{"patent_id": "10-2022-0087780", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0010338", "출원번호": "10-2022-0087780", "발명의 명칭": "디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장치와 시스템", "출원인": "주식회사 메타씨어터", "발명자": "신정화"}}
{"patent_id": "10-2022-0087780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "온-오프라인 공연장 전환 서비스 장치(100)로서,현실정보 센싱 장치(200)로부터 수신한 현실정보를 기반으로 가상정보를 생성하도록 구성되는 현실정보 분석 모듈(120);상기 생성된 가상정보를 기반으로 가상공연을 구현하도록 구성되는 가상화 모듈(130); 및상기 구현된 가상공연에 대한 시뮬레이션을 수행하여 현실공연에 관한 정보를 도출하도록 구성되는 BAS(Bigdata, AI, Simulation) 모듈(140)을 포함하는,온-오프라인 공연장 전환 서비스 장치(100)."}
{"patent_id": "10-2022-0087780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 현실정보 분석 모듈(120)은,상기 현실정보를 상기 가상정보의 생성을 위한 정보로 처리하도록 구성되는 현실정보 처리부(122); 및상기 처리된 현실정보를 기반으로 상기 가상정보를 생성하도록 구성되는 가상정보 생성부(123)를 포함하는,온-오프라인 공연장 전환 서비스 장치(100)."}
{"patent_id": "10-2022-0087780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 가상화 모듈(130)은,상기 생성된 가상정보를 기반으로 상기 가상공연을 위한 가상공간을 생성하도록 구성되는 가상공간 생성부(131); 및상기 생성된 가상공간에 상기 가상공연을 위한 셋업을 수행하도록 구성되는 가상공연 연출부(132)를 포함하는,온-오프라인 공연장 전환 서비스 장치(100)."}
{"patent_id": "10-2022-0087780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 도출된 현실공연에 관한 정보를 기반으로 현실공연 연출 장치(300)를 자동 제어하도록 구성되는 장치 스마트화 모듈(150)을 더 포함하는,온-오프라인 공연장 전환 서비스 장치(100)."}
{"patent_id": "10-2022-0087780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "온-오프라인 공연장 전환 서비스 시스템(1000)으로서,제 1항에 따른 온-오프라인 공연장 전환 서비스 장치(100);상기 온-오프라인 공연장 전환 서비스 장치(100)와 통신 가능하게 결합되는 현실정보 센싱 장치(200); 및상기 온-오프라인 공연장 전환 서비스 장치(100)와 통신 가능하게 결합되는 현실공연 연출 장치(300)를 포함하는,온-오프라인 공연장 전환 서비스 시스템(1000).공개특허 10-2024-0010338-3-청구항 6 온-오프라인 공연장 전환 서비스 방법으로서,현실정보 센싱 장치로부터 수신한 현실정보를 기반으로 가상정보를 생성하는 단계;상기 생성된 가상정보를 기반으로 가상공연을 구현하는 단계; 및상기 구현된 가상공연에 대한 시뮬레이션을 수행하여 현실공연에 관한 정보를 도출하는 단계를 포함하는,온-오프라인 공연장 전환 서비스 방법."}
{"patent_id": "10-2022-0087780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 현실정보 센싱 장치로부터 수신한 현실정보를 기반으로 가상정보를 생성하는 단계는,상기 현실정보를 상기 가상정보의 생성을 위한 정보로 처리하는 단계; 및상기 처리된 현실정보를 기반으로 상기 가상정보를 생성하는 단계를 포함하는,온-오프라인 공연장 전환 서비스 방법."}
{"patent_id": "10-2022-0087780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서,상기 생성된 가상정보를 기반으로 가상공연을 구현하는 단계는,상기 생성된 가상정보를 기반으로 상기 가상공연을 위한 가상공간을 생성하는 단계; 및상기 생성된 가상공간에 상기 가상공연을 위한 셋업을 수행하는 단계를 포함하는,온-오프라인 공연장 전환 서비스 방법."}
{"patent_id": "10-2022-0087780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6항에 있어서,상기 도출된 현실공연에 관한 정보를 기반으로 현실공연 연출 장치를 자동 제어하는 단계를 더 포함하는,온-오프라인 공연장 전환 서비스 방법."}
{"patent_id": "10-2022-0087780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어인 컴퓨터와 결합되어, 제 6항 내지 제 9항 중 어느 한 항에 따른 방법을 수행할 수 있도록 컴퓨터 판독 가능한 기록 매체에 저장되는,컴퓨터 프로그램."}
{"patent_id": "10-2022-0087780", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "온-오프라인 공연장 전환 서비스 장치가 제공된다. 상기 온-오프라인 공연장 전환 서비스 장치는, 현실정보 센싱 장치로부터 수신한 현실정보를 기반으로 가상정보를 생성하도록 구성되는 현실정보 분석 모듈; 상기 생성된 가상 정보를 기반으로 가상공연을 구현하도록 구성되는 가상화 모듈; 및 상기 구현된 가상공연에 대한 시뮬레이션을 수행하여 현실공연에 관한 정보를 도출하도록 구성되는 BAS 모듈을 포함할 수 있다."}
{"patent_id": "10-2022-0087780", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장치와 시스템에 관한 발명 으로서, 보다 구체적으로는 현실세계의 정보를 기반으로 가상세계에서 공연을 구현하고 시뮬레이션을 수행함으 로써 현실세계와 가상세계에서 이루어지는 공연에 관한 연출을 최적화시키고 이와 동시에 다양한 메타버스 관련 컨텐츠를 제공할 수 있는 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장치와 시스 템에 관한 발명이다."}
{"patent_id": "10-2022-0087780", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "메타버스(Metaverse)란 현실 세계를 의미하는 '유니버스(Universe)'와 '가공, 추상'을 의미하는 '메타(Meta)'의 합성어로서 주로 3차원 가상세계를 의미할 수 있으나, 메타버스는 단순히 3차원 가상세계를 의미하는 것만이 아 닌 3차원 가상세계와 관련된 VR(Virtual Reality, 가상현실), AR(Augmented Reality, 증강현실), XR(eXtended Reality, 확장현실) 등과 빅데이터, 인공지능, 블록체인, 전자상거래, IoT 등의 기술을 포괄하고, 이러한 다양 한 기술 등을 이용하여 세상과 소통하는 새로운 방법론이자 변화를 인식하기 위한 틀에 가깝다. 또한, 디지털 트윈(digital twin)은 컴퓨터에 현실 속 사물의 쌍둥이를 만들고, 현실에서 발생할 수 있는 상황을 컴퓨터로 시 뮬레이션함으로써 결과를 미리 예측하는 기술이다. 이러한 디지털 트윈 기술은 에너지, 항공, 헬스케어, 자동차, 국방 등 여러 산업 분야에서 디지털 트윈을 이용하여 자산 최적화, 돌발 사고 최소화, 생산성 증가 등 설계부터 제조, 서비스에 이르는 모든 과정의 효율성을 향상시킬 수 있다. 디지털 트윈 기술은 최근 메타버스 시대에 발맞추어 현실세계와 가상세계의 융합한 대표적인 일 예로 볼 수 있다. 한편, 뮤지컬, 오페라 등의 공연은 단순히 연출된 무대에서 공연자가 공연하는 것만으로 이루어지는 것이 아니 라 미리 공연의 시나리오 등을 고려하여 공연자의 동선, 공연 시간, 조명의 밝기 및 위치, 무대소품, 배경스크 린 연출 등을 미리 디테일하게 설정해야 하는 공연장 셋업 및 무대화의 과정이 반드시 요구된다. 그러나, 이러 한 공연장 셋업 및 무대화의 과정을 미리 디테일하게 설정하고 리허설 등을 수행하더라도, 조명과 공연자의 동 선이 불-일치하거나 무대소품이 배경스크린의 디스플레이 화면이 적절한 밝기나 시간에 출력되지 않는 수많은 시행착오를 겪을 수 밖에 없고, 리허설 반복으로 이러한 시행착오 또는 문제점을 최소화시키기 위해서는 인력, 비용, 시간적 측면에서 상당한 낭비가 발생하는 문제점이 있다. 또한, 뮤지컬, 오페라 등의 공연은 포스트 코로나 이후 공연 현장에서 직접 공연을 관람하는 사람에게만 제공되 는 것이 아니라 온라인을 통해 세계 각지의 다양한 사람들에게도 실시간 스트리밍, 녹화본 송출 등의 방식으로 도 제공될 수 있다. 이와 같은, 온라인 공연 송출을 위해 촬영 전 공연 장면을 적절하게 촬영하게 하기 위한 카 메라의 촬영 앵글, 숏 크기, 기타 장비 등을 디테일하게 설정하여 촬영이 가능하도록 셋업해야 하는 과정도 요 구된다. 또한, 온라인 송출 특성상, 송출되는 화면에 단순한 실제 공연 현장의 촬영 영상 외에도, 소개 영상, 스토리 작화 영상, 볼류메트릭(volumetric) 기술을 활용한 XR 구현 영상 등 다양한 특수 영상이 삽입 또는 편집 되어 송출될 수도 있는데 공연을 실시간으로 스트리밍하며 이러한 다양한 특수 영상을 적절한 공연 중간 타임에 삽입하여 관객에게 원활한 공연 스토리라인을 전달하려면 기존의 오프라인 방식으로 이루어지던 공연에 비해서 보다 훨씬 디테일한 셋업 과정이 필요할 수 밖에 없고, 이러한 과정에서 많은 비용적, 시간적 노력이 필요한 문 제점이 있다. 그러므로, 본 발명자는 이러한 문제점을 해결하기 위해서 오프라인 공연을 위한 셋업 및 무대화 과정에서 발생 하는 인적, 비용적, 시간적 낭비를 기존 오프라인 공연 방식에 비해 최소화시킬 수 있고, 온라인으로 송출되는 공연 영상을 위한 촬영 기타 장비의 셋업을 용이하게 최적화시킬 수 있으며, 또한 최적화된 방식으로 오프라인 공연에서 촬영 기타 장비를 실시간 제어할 수도 있고, 이에 더하여 오프라인 공연을 메타버스화하여 가상세계에 서도 용이하게 구현시킬 수 있는 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장치 와 시스템을 제안한다."}
{"patent_id": "10-2022-0087780", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기의 문제점을 해결하기 위해서 안출된 것으로, 본 발명은 오프라인 공연을 위한 셋업 및 무대화 과정에서 발생하는 인적, 비용적, 시간적 낭비를 기존 오프라인 공연 방식에 비해 최소화시킬 수 있는 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장치와 시스템을 제공하는 것을 목적으로 한다. 또한, 본 발명은 온라인으로 송출되는 공연 영상을 위한 촬영 기타 장비의 셋업을 용이하게 최적화시킬 수 있으 며, 또한 최적화된 방식으로 오프라인 공연에서 촬영 기타 장비를 실시간 제어할 수도 있는 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장치와 시스템을 제공하는 것을 목적으로 한다. 또한, 본 발명은 오프라인 공연을 메타버스화하여 가상세계에서도 용이하게 구현시킬 수 있는 디지털 트윈 기술 을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장치와 시스템을 제공하는 것을 목적으로 한다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재들로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0087780", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 해결하기 위한 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 현 실정보 센싱 장치로부터 수신한 현실정보를 기반으로 가상정보를 생성하도록 구성되는 현실정보 분석 모듈; 상 기 생성된 가상정보를 기반으로 가상공연을 구현하도록 구성되는 가상화 모듈; 및 상기 구현된 가상공연에 대한 시뮬레이션을 수행하여 현실공연에 관한 정보를 도출하도록 구성되는 BAS(Big data, AI, Simulation) 모듈을 포 함할 수 있다. 또한, 상기 현실정보 분석 모듈은, 상기 현실정보를 상기 가상정보의 생성을 위한 정보로 처리하도록 구성되는 현실정보 처리부; 및 상기 처리된 현실정보를 기반으로 상기 가상정보를 생성하도록 구성되는 가상정보 생성부 를 포함할 수 있다. 또한, 상기 가상화 모듈은, 상기 생성된 가상정보를 기반으로 상기 가상공연을 위한 가상공간을 생성하도록 구 성되는 가상공간 생성부; 및 상기 생성된 가상공간에 상기 가상공연을 위한 셋업을 수행하도록 구성되는 가상공 연 연출부를 포함할 수 있다. 또한, 상기 온-오프라인 공연장 전환 서비스 장치는, 상기 도출된 현실공연에 관한 정보를 기반으로 현실공연 연출 장치를 자동 제어하도록 구성되는 장치 스마트화 모듈을 더 포함할 수 있다. 상기의 기술적 과제를 해결하기 위한 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 시스템은, 상기 온-오프라인 공연장 전환 서비스 장치; 상기 온-오프라인 공연장 전환 서비스 장치와 통신 가능하게 결합 되는 현실정보 센싱 장치; 및 상기 온-오프라인 공연장 전환 서비스 장치와 통신 가능하게 결합되는 현실공연 연출 장치를 포함할 수 있다. 상기의 기술적 과제를 해결하기 위한 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 방법은, 현 실정보 센싱 장치로부터 수신한 현실정보를 기반으로 가상정보를 생성하는 단계; 상기 생성된 가상정보를 기반 으로 가상공연을 구현하는 단계; 및 상기 구현된 가상공연에 대한 시뮬레이션을 수행하여 현실공연에 관한 정보 를 도출하는 단계를 포함할 수 있다. 또한, 상기 현실정보 센싱 장치로부터 수신한 현실정보를 기반으로 가상정보를 생성하는 단계는, 상기 현실정보 를 상기 가상정보의 생성을 위한 정보로 처리하는 단계; 및 상기 처리된 현실정보를 기반으로 상기 가상정보를 생성하는 단계를 포함할 수 있다. 또한, 상기 생성된 가상정보를 기반으로 가상공연을 구현하는 단계는, 상기 생성된 가상정보를 기반으로 상기 가상공연을 위한 가상공간을 생성하는 단계; 및 상기 생성된 가상공간에 상기 가상공연을 위한 셋업을 수행하는 단계를 포함할 수 있다. 또한, 상기 온-오프라인 공연장 전환 서비스 방법은, 상기 도출된 현실공연에 관한 정보를 기반으로 현실공연 연출 장치를 자동 제어하는 단계를 더 포함할 수 있다. 상기의 기술적 과제를 해결하기 위한 본 발명의 일 실시예에 따른 컴퓨터 프로그램은, 하드웨어인 컴퓨터와 결 합되어, 상기 온-오프라인 공연장 전환 서비스 방법을 수행할 수 있도록 컴퓨터 판독 가능한 기록 매체에 저장 될 수 있다."}
{"patent_id": "10-2022-0087780", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장치와 시 스템에 의하면, 오프라인 공연을 위한 셋업 및 무대화 과정에서 발생하는 인적, 비용적, 시간적 낭비를 기존 오 프라인 공연 방식에 비해 최소화시킬 수 있다. 또한, 본 발명의 일 실시예에 따른 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장 치와 시스템에 의하면, 온라인으로 송출되는 공연 영상을 위한 촬영 기타 장비의 셋업을 용이하게 최적화시킬 수 있으며, 또한 최적화된 방식으로 오프라인 공연에서 촬영 기타 장비를 실시간 제어할 수도 있다. 또한, 본 발명의 일 실시예에 따른 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장 치와 시스템에 의하면, 발명은 오프라인 공연을 메타버스화하여 가상세계에서도 용이하게 구현시킬 수 있다."}
{"patent_id": "10-2022-0087780", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 실시예들은 첨부된 도면들을 참조하여 설명한다. 각 도면의 구성요소들에 참조 부호를 부 가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면 상에 표시되더라도 가능한 한 동일한 부호를 가 지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한 다. 또한, 이하에서 본 발명의 실시예들을 설명할 것이나, 본 발명의 기술적 사상은 이에 한정되거나 제한되지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외 하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 본 발명의 실시예의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한 정되지 않는다. 도 1은 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 시스템을 설명하기 위한 개략적인 블록도이다. 도 1에 도시되는 바와 같이, 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 시스템은, 온- 오프라인 공연장 전환 서비스 장치, 현실정보 센싱 장치, 현실공연 연출 장치, 스마트글라스 , VR 기기 등을 포함할 수 있다. 먼저, 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 현실정보 센싱 장치로부 터 수신한 현실정보를 기반으로 가상공연을 구현하고, 가상공연에 대한 시뮬레이션을 수행하여 현실공연에 관한 정보를 도출하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치의 세부적인 구성에 대해서는 먼저 현실정보 센싱 장치, 현실공연 연출 장치 등을 기술한 이후 보다 상 세하게 기술하기로 한다. 본 발명의 일 실시예에 따른 현실정보 센싱 장치는, 온-오프라인 공연장 전환 서비스 장치와 통신 가 능하게 결합하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 현실정보 센싱 장치는, 공연장 무대 환경 을 스캔하도록 구성될 수 있다. 예를 들어, 본 발명의 일 실시예에 따른 현실정보 센싱 장치는 3D 스캐너 로 구현되어 공연장 무대 공간을 스캔하도록 구성될 수 있고, 이에 더해 공연장 무대 공간에 제한되지 않고 공 연장 무대 공간에 설치되는 다양한 공연 장비(예를 들어, 카메라 장비, 무대 소품 등)를 스캔하도록 구성될 수 도 있으며, 공연장 관객석을 포함하여 공연장 무대 및 인접한 공연장 전체 공간을 스캔하도록 구성될 수도 있다. 또한, 본 발명의 일 실시예에 따른 현실정보 센싱 장치는, 공연장 무대 환경을 복수 개의 단면 이미 지로 촬영하고 3D 매핑 작업을 통해 3D 공간을 구현할 수 있는 정보를 생성하도록 구성될 수 있다. 또한, 본 발 명의 일 실시예에 따른 현실정보 센싱 장치는 모션 캡쳐 장치로 구현되어 공연자의 신체 움직임 및 이동동선을 감지하고, 감지된 신체 움직임 및 이동 동선에 관한 정보를 포함하는 현실정보를 생성하도록 구성될 수 있다. 즉, 본 발명의 일 실시예에 따른 현실정보 센싱 장치는 공연자, 무대환경 등 공연장의 다양한 인적, 환경적 요소 등을 스캔하도록 구성될 수 있고, 스캔한 정보를 기반으로 현실정보를 생성하여 온-오프라인 공연 장 전환 서비스 장치로 송신하도록 구성될 수 있다. 이어서, 본 발명의 일 실시예에 따른 현실공연 연출 장치는 공연장에서 공연 연출을 위해 설치되는 장치 (예를 들어, 촬영 카메라, 조명 장치, 무대 배경 스크린, 연출용 폭죽 발사 장치, 레이저 효과 구현 장치 등)로 구현될 수 있다. 특히, 본 발명의 일 실시예에 따른 현실공연 연출 장치는 협동 로봇의 움직임에 따라 공 연 현장을 촬영하는 카메라를 포함할 수 있고, 이러한 카메라로 구현되는 현실공연 연출 장치는 공연장 현 장의 적어도 일부 영역(예를 들어, 공연장 천장) 등에 적어도 하나 이상이 설치될 수 있고, 촬영 구도, 촬영 앵 글, 카메라워크 등을 조정하도록 구성될 수 있다. 또한, 협동 로봇과 결합된 형태의 카메라로 구현되는 현실공 연 연출 장치는, 공연장 내부의 천장, 양측 벽면, 공연장 바닥, 무대의 가장자리 등 다양한 영역에 자유롭 게 설치될 수 있되 공연장 무대에서 공연자의 연기와 관객의 관람에 방해되지 않는 위치에 설치될 수 있고, 협 동 로봇은 적어도 하나 이상(예를 들어, 2개 내지 3개 등)의 회전 축이 구비되어 보다 용이하게 일정 반경 내에 서 움직이도록 구성될 수 있다. 예시적으로, 협동 로봇은 적어도 하나 이상(예를 들어, 6개 등)의 고성능 토크 센서가 구비되어 충돌 민감도를 측정 또는 고려하여 움직이도록 구성될 수 있고, 중력 보상 메커니즘이 적용되 고 경량화된 하드웨어를 갖춤으로써 충격량을 감소시키고 작동 시 안정성을 극히 향상시킬 수 있어 보다 안정적 인 카메라 워킹을 구현하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 스마트글라스는 증강현실 기술(AR)을 통해 관객에게 가상의 인물, 가상의 무 대 배경, 가상의 소품 등을 제공하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 스마트 글라스는 공연장 현장의 실제 관객이 착용하는 글라스 형태를 가질 수 있고, 가상의 인물, 소품 배경 등을 출력하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 스마트글라스는 온-오프라인 공연장 전환 서비스 장치와 통신 가능하게 결합될 수 있다. 또한, 본 발명의 일 실시예에 따른 VR 기기는 온-오프라인 공연장 전환 서비스 장치와 통신 가능하게 결합될 수 있다. 본 발명의 일 실시예에 따른 VR 기기는, 온-오프라인 공연장 전환 서비스 장치에 의해 구 현되는 VR 컨텐츠에 참여할 수 있도록 구성되는 장치로서, 예를 들어, VR(Virtual Reality) 기기 형태로 구현될 수 있다. 한편, 도 1을 참고하면, 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 제어 모듈 , 현실정보 분석 모듈, 가상화 모듈, BAS(Big data, AI, Simulation) 모듈, 장치 스마트 화 모듈, 컨텐츠 생성 모듈, 저장 모듈, 통신 모듈 등을 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는 적어도 하나 이상의 현실정보 센싱 장치, 현실공연 연출 장치, 스마트글라스, VR 기기 등과 통신 가능하게 결합되도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 개인 또는 사설 기업에 의해"}
{"patent_id": "10-2022-0087780", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "제작되어 운영되는 자체 컴퓨터 프로그램 기반의 장치에 해당하며, 관련 기술분야에서의 다양한 표현 방식에 따 라 디바이스(device), 장비(equipment), 서버(server), 플랫폼(platform) 등의 용어로 지칭될 수도 있다. 참고로, 도 1에 도시되는 온-오프라인 공연장 전환 서비스 장치의 구성요소들(110, 120, 130, 140, 150, 160, 170, 180)은 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치의 동작, 기능 등을 설명하기 위한 예시적인 구성요소들에 불과하다. 즉, 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서 비스 장치가 도시된 구성요소들(110, 120, 130, 140, 150, 160, 170, 180) 이외의 다른 구성요소(예를 들 어, 전원 모듈 등)를 추가로 포함할 수 있음은 명백하다. 먼저, 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 온-오프라인 공연장 전환 서 비스 장치의 다른 구성요소들(120, 130, 140, 150, 160, 170, 180)을 제어하도록 구성되는 제어 모듈 을 포함할 수 있다. 참고로, 제어 모듈은 프로세서(processor), 마이크로프로세서(micro- processor), 컨트롤러(controller), 마이크로컨트롤러(micro-controller) 등으로 구현될 수 있다. 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 현실정보 센싱 장치로부터 수 신한 현실정보를 기반으로 가상정보를 생성하도록 구성되는 현실정보 분석 모듈을 포함할 수 있다. 도 2를 참고하면, 본 발명의 일 실시예에 따른 현실정보 분석 모듈은 센싱 장치 연동부, 현실정보 처리부 , 가상정보 생성부 등을 포함할 수 있다.참고로, 현실정보는 현실정보 센싱 장치가 스캔한 공연장 무대 환경에 관한 3D 데이터를 포함할 수 있고, 특히 공연장 무대, 관람 좌석, 공연장 연출 소품, 촬영 카메라 등의 위치 및 형태 등을 모두 포함한 공간 형태 적 정보를 포함할 수 있다. 먼저, 본 발명의 일 실시예에 따른 센싱 장치 연동부는 현실정보 센싱 장치와 연동되어 통신 모듈 을 통해 현실정보 센싱 장치가 생성한 현실정보를 수신하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 센싱 장치 연동부는, 실시간으로 현실정보 센싱 장치를 자동으로 감지하고, 사용자가 선택한 범위 내 정보를 생성하는 현실정보 센싱 장치를 선택하여 연동시키도록 구성될 수도 있다. 즉, 본 발명의 일 실시예에 따른 현실정보 센싱 장치는 가상공연 구현에 필요한 정보 중 사용자가 취사선택한 현 실정보를 스캔하는 현실정보 센싱 장치만을 선별하여 연동시키고 선별된 현실정보 센싱 장치로부터 현실정보를 수신하도록 구성될 수도 있다. 이어서, 본 발명의 일 실시예에 따른 현실정보 처리부는, 현실정보를 가상정보의 생성을 위한 정보로 처리 하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 현실정보 처리부는, 센싱 장치 연 동부에 의해 수신된 현실정보를 분석하여 공간에 관한 정보, 색상에 관한 정보, 움직임(공연자 등) 등에 관한 정보 등으로 유형을 분류하고, 사용자가 미리 설정한 입력 정보 범위 내에서 적어도 일부의 현실정보를 추 출하고 데이터 단위로 가공함으로써 현실정보를 가상정보의 생성을 위한 정보로 처리하도록 구성될 수 있다. 또 한, 본 발명의 일 실시예에 따른 현실정보 처리부는, 사용자가 미리 설정한 입력 정보 범위 내뿐만 아니라 인공지능 학습을 통해 인공지능이 필요하다고 판단한 입력 정보 범위 내에서 적어도 일부의 현실정보를 추출하 고 데이터 단위로 가공함으로써 현실정보를 가상정보의 생성을 위한 정보로 처리하도록 구성될 수 있다. 이어서, 본 발명의 일 실시예에 따른 가상정보 생성부는, 처리된 현실정보를 기반으로 가상정보를 생성하 도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 가상정보 생성부는, 현실정보 처리부 에 의해 추출되고 데이터 단위로 가공됨으로써 처리된 현실정보를 가상화 모듈에 전달할 데이터 형식 의 가상정보로 변환 가공시킴으로써 가상정보를 생성하도록 구성될 수 있다. 참고로, 본 발명의 일 실시예에 따 른 가상정보 생성부에 의해 생성되는 가상정보는, 현실정보 센싱 장치가 스캔하여 생성한 현실정보를 가상세계에 도입시키기 위해 필요한 정보 형태로서, 현실정보와 마찬가지로 가상공간 및 가상 공연을 구현시키 기 위한 가상의 공연장 무대 환경에 관한 3D 데이터, 공연장 무대, 관람 좌석, 공연장 연출 소품, 촬영 카메라 등의 위치 및 형태 등을 모두 포함한 공간 형태적 정보를 포함할 수 있다. 즉, 가상정보는, 현실정보와 실질적 으로 동일한 공간 형태적 정보로써 그 적용 범위에 있어 현실세계와 가상세계로 각각 상이할 수 있다. 본 발명의 일 실시예에 따르면, 온-오프라인 공연장 전환 서비스 장치는, 생성된 가상정보를 기반으로 가 상공연을 구현하도록 구성되는 가상화 모듈을 포함할 수 있다. 도 3을 참고하면, 가상화 모듈은, 가 상공간 생성부, 가상공연 연출부, 시각화부 등을 포함할 수 있다. 먼저, 본 발명의 일 실시예에 따른 가상공간 생성부는, 생성된 가상정보를 기반으로 가상공연을 위한 가상 공간을 생성하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 가상공간 생성부는 현 실정보 분석 모듈에 의해 생성된 공연장 무대 공간, 관람객 좌석 공간 등을 포함한 공연장 현장 전체의 공 간에 관한 3D 데이터를 포함하는 가상정보를 기반으로 가상공간을 생성하도록 구성될 수 있다. 즉, 본 발명의 일 실시예에 따른 가상공간 생성부는 현실정보 센싱 장치에 의해 스캔된 현실세계의 공연장 공간 환 경을 그대로 구현하여 현실과 동일한 공간 환경의 가상공간을 생성하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 가상공간 생성부는 가상공간 생성 시 사용자가 별도로 입력한 공간 정보에 따라 가상공간을 생성하거나 또는 생성된 가상공간을 사용자의 입력에 따라 수정 또는 변형하도록 구성될 수도 있다. 이에 따라, 현실세계의 공연장 공간 환경과 상이한 가상공간을 생성하여 공연 연출자인 사용자가 연출하고자 하는 공연 공 간을 생성시키고, 추후 가상세계에서 가상공연을 시뮬레이션하여 모의 시연을 할 수도 있다. 이어서, 본 발명의 일 실시예에 따른 가상공연 연출부는 생성된 가상공간에 가상공연을 위한 셋업을 수행 하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 가상공연 연출부는, 생성된 가상정 보를 기반으로 공연장에서 공연 연출을 위해 설치되는 장치(예를 들어, 촬영 카메라, 조명 장치, 무대 배경 스 크린, 연출용 폭죽 발사 장치, 레이저 효과 구현 장치 등)에 관한 위치, 형태 및 동작을 생성된 가상공간에 그 대로 구현시킴으로써 가상공연을 위한 셋업을 수행하도록 구성될 수 있다. 즉, 본 발명의 일 실시예에 따른 가 상공연 연출부는, 실제 현실세계의 공연장 환경에 설치되는 현실공연 연출 장치를 그대로 가상공간에 구현시킴으로써 가상공연을 위한 셋업을 수행하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 가상공 연 연출부는, 공연자의 신체 움직임 및 이동 동선 등을 포함하는 가상정보를 기반으로 공연자를 가상공간에서 활동할 수 있도록 아바타를 생성하고 실제 공연자의 신체 움직임 및 이동 동선에 따라 아바타가 동작할 수 있도록 하는 가상공연에 관한 데이터를 생성하도록 구성될 수도 있다. 또한, 본 발명의 일 실시예에 따른 시각화부는, 생성된 가상공간 및 수행된 가상공연을 위한 셋업에 대한 시각화를 수행하도록 구성될 수 있다. 보다 구체적으로, 가상공간 생성부가 공간 정보를 확인할 수 있는 가상공간을 제공하고, 가상공연 연출부가 공연 연출을 위해 설치되는 장치, 아바타의 동작에 관한 정보를 제공하면, 본 발명의 일 실시예에 따른 시각화부는 생성된 가상공간 및 가상공연을 위한 셋업에 관련한 장 치 및 아바타에 대한 디테일한 시각화를 수행하도록 구성될 수 있다. 즉, 본 발명의 일 실시예에 따른 시각화부 는 공연장의 색상, 조명 장치의 빛의 밝기 및 그림자, 공연자의 아바타에 대한 키, 얼굴 형상 등을 구체적 으로 구현함으로써 사용자가 가상의 공연장 무대 환경을 시각적으로 확인하도록 구성될 수 있다. 참고로, 본 발 명의 일 실시예에 따른 시각화부는 시각화된 가상의 공연장 무대 환경을 사용자가 VR 기기 등을 통해 체험할 수 있도록 구성되거나 또는 별도의 디스플레이를 통해 시각적으로 출력하도록 구성될 수도 있다. 한편, 본 발명의 일 실시예에 따르면, 온-오프라인 공연장 전환 서비스 장치는, 구현된 가상공연에 대한 시뮬레이션을 수행하여 현실공연에 관한 정보를 도출하도록 구성되는 BAS 모듈을 포함할 수 있다. 도 4를 참고하면, 본 발명의 일 실시예에 따른 BAS 모듈은, 빅데이터화 구현부, 인공지능 학습부, 시뮬 레이션부, 정보 분석부 등을 포함할 수 있다. 먼저, 본 발명의 일 실시예에 따른 빅데이터화 구현부는, 가상공간, 가상공연을 위한 셋업, 시각화된 가상 공연 등에 관한 정보를 저장 모듈에 정보의 유형에 따라 분류하고 저장함으로써 상기 정보의 빅데이터화를 구현하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 빅데이터화 구현부는, 가상화 모듈에 의해 생성된 가상공간, 가상공연을 위한 셋업에 관한 정보 및 시각화된 정보를 데이터의 종류(예를 들어, 공간 정보, 공연자 정보, 조명 정보, 타임라인 정보 등)별로 분류하고 저장 모듈에 저장함으로써 상 기 정보의 빅데이터화를 구현하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 빅데이터화 구현부 는, 후술할 인공지능 학습부에 의한 학습 정보, 시뮬레이션부에 의한 시뮬레이션 정보, 정보 분 석부에 의해 분석 및 도출된 현실공연에 관한 정보 등에 대해서도 빅데이터화를 구현하도록 구성될 수도 있다. 이어서, 본 발명의 일 실시예에 따른 인공지능 학습부는, 빅데이터화된 정보를 기반으로 인공지능 자동학 습을 수행하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 인공지능 학습부는, 빅데 이터화 구현부에 의해 빅데이터화된 정보를 기반으로 가상공연에 대한 선호도, 공연 영상에 대한 시청률, 연출자가 의도한 공연 연출 달성률 등에 관한 정보를 추가로 반영하여 가장 높은 선호도, 시청률, 연출자가 의 도한 공연 연출 달성률 등을 기록한 가상공연을 구현하기 위한 인공지능 자동학습을 수행하도록 구성될 수 있다. 즉, 본 발명의 일 실시예에 따른 인공지능 학습부는, 인공지능 자동학습 수행 시 머신러닝 또는 딥 러닝 알고리즘을 활용하여 최적의 현실공연 및/또는 가상공연을 구현하기 위한 인공지능 자동학습을 수행하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 학습부는, 최적화된 현실공연 및/또는 가상 공연을 구현하기 위한 공연 학습 데이터를 생성하고 사용자가 별로도 입력한 정보(예를 들어, 연출자가 의도한 공연 연출 달성률 기록 등)를 반영하여 인공지능 자동학습을 수행하도록 구성될 수도 있다. 또한, 본 발명의 일 실시예에 따른 시뮬레이션부는, 빅데이터화된 정보를 기반으로 가상공연의 진행에 대 한 시뮬레이션을 수행하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 시뮬레이션부는 빅데이터 화된 정보 및 인공지능 자동학습된 정보를 기반으로 가상공연의 진행에 대한 시뮬레이션을 수행하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 시뮬레이션부는 가상화 모듈에 의해 가상공 간에서 구현되는 가상공연의 진행에 대해 반복적으로 수행함과 동시에 시뮬레이션이 수행되는 가상공연의 진행 에 관한 정보를 빅데이터화 구현부로 전달하여 빅데이터화하고, 빅데이터화된 가상공연의 진행에 관한 정 보는 인공지능 학습부에 의해 인공지능 자동학습되어 실시간으로 시뮬레이션의 수행에 반영될 수 있다. 이 에 따라, 다양한 기준에 따른 최적의 가상공연의 진행에 대한 시뮬레이션이 반복적으로 수행될 수 있다. 이어서, 본 발명의 일 실시예에 따른 정보 분석부는, 가상공연의 진행에 대한 시뮬레이션을 거쳐 빅데이터 화되고 인공지능 자동학습된 정보를 분석하여 현실공연에 관한 정보를 도출하도록 구성될 수 있다. 보다 구체적 으로, 본 발명의 일 실시예에 따른 정보 분석부는, 가상공연의 진행에 대한 시뮬레이션에 관한 정보에서 가장 높은 선호도, 시청률, 연출자가 의도한 공연 연출 달성률 등을 기록한 가상공연의 현실공연 연출 장치 즉, 촬영 카메라, 협동 로봇, 조명 장치, 무대 배경 스크린, 연출용 폭죽 발사 장치, 레이저 효과 구현 장치, 스피커 장치 등에 관한 설정 값을 추출함으로써 현실공연에 관한 정보를 도출하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 정보 분석부는, 현실공연 연출 장치 즉, 촬영 카메라, 협동 로봇, 조명 장치, 무대 배경 스크린, 연출용 폭죽 발사 장치, 레이저 효과 구현 장치, 스피커 장치 외에도 공연자의 동선, 대사 시간 등에 관한 수치적 요소도 추출함으로써 현실공연에 관한 정보를 도출하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 정보 분석부는, 선호도, 시청률, 연출자가 의도한 공연 연출 달성률 등 이 일정 수치 범위 이하인 가상공연에서 추출된 설정 값 및/또는 수치적 요소를 기록하고, 이와 같이 기록된 설 정 값 및/또는 수치적 요소와 상이하게 설정 값 및/또는 수치적 요소를 변경하도록 구성될 수도 있다. 이에 따 라, 본 발명의 일 실시예에 따른 정보 분석부는, 현실공연에 관한 정보를 도출하는 과정에서 추출된 설정 값 및/또는 수치적 요소를 기록하여 가상공연의 문제점을 파악하고, 파악된 문제점에 대한 해결방안을 도출할 수 있다. 참고로, 현실공연에 관한 정보는, 현실의 공연장 무대에서 진행되는 다양한 환경적 요소에 관한 정보 를 포함할 수 있고, 특히 현실공연 연출 장치 즉, 촬영 카메라, 협동 로봇, 조명 장치, 무대 배경 스크린, 연출용 폭죽 발사 장치, 레이저 효과 구현 장치, 스피커 장치 등에 관한 설정 값 및/또는 공연자의 동선, 대사 시간 등에 관한 수치적 요소에 관한 정보도 포함할 수 있다. 한편, 본 발명의 일 실시예에 따르면, 온-오프라인 공연장 전환 서비스 장치는, 도출된 현실공연에 관한 정보를 기반으로 현실공연 연출 장치를 자동 제어하도록 구성되는 장치 스마트화 모듈을 더 포함할 수 있다. 도 5를 참고하면, 본 발명의 일 실시예에 따른 장치 스마트화 모듈은, 연출 장치 연동부, 구동 정보 생성부, 연출 장치 자동교정부 등을 포함할 수 있다. 먼저, 본 발명의 일 실시예에 따른 연출 장치 연동부는, 현실공연 연출 장치와 연동되어 통신 모듈 을 통해 현실공연 연출 장치를 제어할 수 있는 상태로 진입하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 연출 장치 연동부는, 실시간으로 현실공연 연출 장치를 자동으로 감지하 고, 사용자가 선택한 범위 내의 제어 가능한 현실공연 연출 장치를 선택하여 온-오프라인 공연장 전환 서 비스 장치와 연동 또는 동기화시키도록 구성될 수 있다. 이어서, 본 발명의 일 실시예에 따른 구동 정보 생성부는, 상기 도출된 현실공연에 관한 정보에 따라 상기 연동 또는 동기화된 현실공연 연출 장치에 관한 구동 정보를 생성하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 구동 정보 생성부는, BAS 모듈의 정보 분석부에 의해 도출된 설정 값 및/또는 수치적 요소 등을 현실공연 연출 장치를 실제로 구동시킬 수 있는 데이터 정보로 가공함으로써 연동 또는 동기화된 현실공연 연출 장치에 관한 구동 정보를 생성하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 연출 장치 자동교정부는, 생성된 구동 정보에 따라 온-오프라인 공연장 전환 서비스 장치와 연동 또는 동기화된 현실공연 연출 장치에 대한 자동교정을 수행하도록 구성될 수 있다. 즉, 본 발명의 일 실시예에 따른 연출 장치 자동교정부는, 가상공연의 시뮬레이션 수행을 통해 도출된 설정 값 또는 수치적 요소를 그대로 반영한 구동 정보에 따라 현실공연 연출 장치의 작동을 자동으 로 교정하도록 구성될 수 있다. 예시적으로, 본 발명의 일 실시예에 따른 연출 장치 자동교정부는, 협동 로봇과 결합한 촬영 카메라의 카메라 워크, 촬영 각도 등을 시뮬레이션을 통해 도출된 설정 값이 반영된 구동 정보에 따라 자동으로 작동시키도록 구성될 수 있거나 또는 조명 장치의 밝기, 조명 스포트라이트 영역의 위치 및 이동 등을 시뮬레이션을 통해 도출된 설정 값이 반영된 구동 정보에 따라 자동으로 작동시키도록 구성될 수 있다. 이에 따라, 오프라인 공연을 위한 셋업 및 무대화 과정에서 발생하는 인적, 비용적, 시간적 낭비를 기존 오프라 인 공연 방식에 비해 최소화시킬 수 있고, 또한 온라인으로 송출되는 공연 영상을 위한 촬영 기타 장비의 셋업 을 용이하게 최적화시킬 수 있으며, 또한 최적화된 방식으로 오프라인 공연에서 촬영 기타 장비 즉, 현실공연 연출 장치를 실시간 제어할 수도 있다. 본 발명의 일 실시예에 따르면, 온-오프라인 공연장 전환 서비스 장치는, 온-오프라인 공연장 전환 서비스 장치에 의해 구현되는 가상공연 및/또는 현실공연에 관한 정보를 기반으로 AR 컨텐츠 및/또는 VR 컨텐츠를 제공하도록 구성되는 컨텐츠 생성 모듈을 포함할 수 있다. 도 6을 참고하면, 본 발명의 일 실시예에 따른 컨텐츠 생성 모듈은, AR 컨텐츠 제공부, VR 컨텐츠 제공부 등을 포함할 수 있다. 본 발명의 일 실시예에 따른 AR 컨텐츠 제공부는, 온-오프라인 공연장 전환 서비스 장치에 의해 구현 되는 가상공연 및/또는 현실공연에 관한 정보를 기반으로 AR 컨텐츠를 관람할 수 있도록 구성되는 스마트글라스 를 착용한 현실공연의 관람객에게 가상공연에서 구현된 인물, 소품, 조명 등의 연출 요소를 현실공연의 무 대 환경에 출력시킴으로써 AR 컨텐츠를 제공하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 VR 컨텐 츠 제공부는, 온-오프라인 공연장 전환 서비스 장치에 의해 구현되는 가상공연 및/또는 현실공연에관한 정보를 기반으로 VR 컨텐츠를 관람 또는 참여할 수 있도록 구성되는 VR 기기를 착용한 가상공연의 관 람객에게 구현되는 가상공연에 관한 VR 컨텐츠를 출력시킴으로써 VR 컨텐츠를 제공하도록 구성될 수 있다. 이에 따라 현실세계의 오프라인 공연을 메타버스화하여 가상세계에서도 용이하게 구현시킬 수 있다. 한편, 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 온-오프라인 공연장 전환 서 비스 장치의 구성요소들(110, 120, 130, 140, 150, 160, 180)의 동작에 관한 데이터를 저장하도록 구성되 는 저장 모듈을 포함할 수 있다. 예시적으로, 본 발명의 일 실시예에 따른 저장 모듈에는 현실정보 센싱 장치로부터 수신한 현실정보, 가상정보 생성부에 의해 생성된 가상정보, 가상화 모듈에 의 해 생성된 가상공간 및 가상공연의 시각화에 관한 정보, BAS 모듈에 의해 수행된 빅데이터화, 인공지능 자 동학습, 시뮬레이션 수행에 관한 정보, 도출된 현실공연에 관한 정보, 장치 스마트화 모듈에 의해 생성된 구동 정보, 컨텐츠 생성 모듈에 의해 생성된 AR 또는 VR 컨텐츠에 관한 정보 등이 저장될 수 있다. 참고로, 저장 모듈은, HDD(Hard Disk Drive), ROM(Read Only Memory), RAM(Random Access Memory), EEPROM(Electrically Erasable and Programmable Read Only Memory), 플래시 메모리(flash memory), CF(Compact Flash) 카드, SD(Secure Digital) 카드, SM(Smart Media) 카드, MMC(Multimedia) 카드 또는 메모리 스틱(Memory Stick) 등 정보의 입출력이 가능한 다양한 형태의 저장 장치로 구현될 수 있으며, 도 1에 도시된 바와 같이 온-오프라인 공연장 전환 서비스 장치의 내부에 구비되거나 별도의 외부 장치에 구비될 수 있다. 또는, 저장 모듈이 인터넷 상에서 저장 기능을 수행하는 웹 스토리지(web storage)로 대체될 수도 있다. 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 적어도 하나의 현실정보 센싱 장치 , 적어도 하나의 현실공연 연출 장치 등과 통신 가능하게 결합되는 통신 모듈을 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 통신 모듈은, 스마트글라스 및/또는 VR 기기와 통신 가능하게 결합될 수도 있다. 참고로, 통신 모듈은 외부와의 직접 연결 또는 네트워크를 통한 연결을 위해 제공되는 것으로서, 유선 및/또는 무선 통신 모듈일 수 있다. 구체적으로, 통신 모듈은 제어 모듈 , 현실정보 분석 모듈, 가상화 모듈, BAS 모듈, 장치 스마트화 모듈, 컨텐츠 생성 모듈, 저장 모듈 등으로부터의 데이터를 유선 또는 무선으로 전송하거나, 외부로부터 데이터를 유선 또는 무선 수신하여 제어 모듈, 현실정보 분석 모듈, 가상화 모듈, BAS 모듈, 장치 스마트 화 모듈 또는 컨텐츠 생성 모듈로 전달하거나 저장 모듈에 저장할 수 있다. 상기 데이터에는 텍 스트, 이미지, 동화상 등의 컨텐츠 등이 포함될 수 있다. 통신 모듈은 랜(LAN), WCDMA(Wideband Code Division Multiple Access), LTE(Long Term Evolution), WiBro(Wireless Broadband Internet), RF(Radio Frequency)통신, 무선랜(Wireless LAN), 와이파이(Wireless Fidelity), NFC(Near Field Communication), 블루투스, 적외선 통신 등을 통해 통신할 수 있다. 다만, 이는 예"}
{"patent_id": "10-2022-0087780", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "시적인 것으로서, 본 발명이 적용되는 실시예에 따라 당해 기술분야에서 적용 가능한 다양한 유, 무선 통신 기 술이 이용될 수 있다. 한편, 본 발명의 추가 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 공연연출자 등의 사용자가 현실공연의 리허설에서 발생한 문제점 등을 별도의 사용자 단말을 통해 추가로 입력 가능하도록 구성될 수 있고, 추가로 입력된 문제점을 반영하여 가상공연에 대한 시뮬레이션을 수행하도록 구성될 수 있다. 이에 따라, 가상공연의 진행에 대한 시뮬레이션에 직접 사용자가 관여 가능함으로써 가상공연 및 현실공연의 진행에 대한 수장 방향을 설정할 수 있다. 또한, 본 발명의 추가 실시예에 따른 온-오프라인 공연장 전환 서비스 장치는, 최적의 현실공연에 관한 정 보 이외에도 사용자가 설정한 목적에 따라 현실공연의 연출 방향에 관한 다양한 정보를 제공하도록 구성될 수 있다. 이에 따라, 공연연출자 등의 사용자가 다양한 해당 정보를 취사선택하여 사용자 자신이 연출하고자 하는 방향으로 가상공연 및/또는 현실공연을 연출시킬 수 있다. 도 7은 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 방법(S10)을 설명하기 위한 개략적인 순서 도이다. 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 방법(S10)은, 먼저 현실정보 분석 모듈이 현 실정보 센싱 장치로부터 수신한 현실정보를 기반으로 가상정보를 생성하고(S100), 가상화 모듈이 생 성된 가상정보를 기반으로 가상공연을 구현하며(S200), BAS 모듈이 구현되는 가상공연에 대한 빅데이터화, 인공지능 학습, 시뮬레이션 등을 수행하여 현실공연에 관한 정보를 도출하고(S300), 장치 스마트화 모듈이도출된 현실공연에 관한 정보를 기반으로 현실공연 연출 장치를 자동 제어하며(S400), 또한 컨텐츠 생성 모듈이 상기 BAS 모듈에 의해 도출된 정보를 기반으로 다양한 AR 및/또는 VR 컨텐츠를 생성할 수 있 다(S500). 참고로, 도 7에서는 각 단계들이 특정한 순서에 따라 이루어짐으로써 온-오프라인 공연장 전환 서비 스 방법(S10)을 구현하는 것으로 도시되고 있으나, 이는 본 발명의 용이한 이해를 위한 일 예에 불과하며, 도시 되는 순서와 상이한 순서로 각 단계들이 이루어지는 온-오프라인 공연장 전환 서비스 방법(S10) 또한 본 발명의 일 실시예에 포함됨은 물론이다. 또한, 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 방법(S1 0)의 각 단계들(S100, S200, S300, S400, S500)에 관한 세부적인 구성 및 과정에 대해서는 상술한 바와 같으므 로 본 도에서는 생략하기로 한다. 상술한 바와 같이, 본 발명의 일 실시예에 따른 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방 법 및 그 장치와 시스템에 의하면, 오프라인 공연을 위한 셋업 및 무대화 과정에서 발생하는 인적, 비용적, 시 간적 낭비를 기존 오프라인 공연 방식에 비해 최소화시킬 수 있다. 또한, 본 발명의 일 실시예에 따른 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장 치와 시스템에 의하면, 온라인으로 송출되는 공연 영상을 위한 촬영 기타 장비의 셋업을 용이하게 최적화시킬 수 있으며, 또한 최적화된 방식으로 오프라인 공연에서 촬영 기타 장비를 실시간 제어할 수도 있다. 또한, 본 발명의 일 실시예에 따른 디지털 트윈 기술을 이용한 온-오프라인 공연장 전환 서비스 방법 및 그 장 치와 시스템에 의하면, 발명은 오프라인 공연을 메타버스화하여 가상세계에서도 용이하게 구현시킬 수 있다. 한편, 본 명세서에 기재된 다양한 실시예들은 하드웨어, 미들웨어, 마이크로코드, 소프트웨어 및/또는 이들의 조합에 의해 구현될 수 있다. 예를 들어, 다양한 실시예들은 하나 이상의 주문형 반도체(ASIC)들, 디지털 신호 프로세서(DSP)들, 디지털 신호 프로세싱 디바이스(DSPD)들, 프로그램어블 논리 디바이스(PLD)들, 필드 프로그램 어블 게이트 어레이(FPGA)들, 프로세서들, 컨트롤러들, 마이크로컨트롤러들, 마이크로프로세서들, 여기서 제시 되는 기능들을 수행하도록 설계되는 다른 전자 유닛들 또는 이들의 조합 내에서 구현될 수 있다. 또한, 예를 들어, 다양한 실시예들은 명령들을 포함하는 컴퓨터-판독가능한 매체에 수록되거나 인코딩될 수 있 다. 컴퓨터-판독가능한 매체에 수록 또는 인코딩된 명령들은 프로그램 가능한 프로세서 또는 다른 프로세서로 하여금 예컨대, 명령들이 실행될 때 방법을 수행하게끔 할 수 있다. 컴퓨터-판독가능한 매체는 컴퓨터 저장 매 체를 포함하며, 컴퓨터 저장 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수도 있다. 예를 들어, 이러한 컴퓨터-판독가능한 매체는 RAM, ROM, EEPROM, CD-ROM 또는 기타 광학 디스크 저장 매체, 자기 디 스크 저장 매체 또는 기타 자기 저장 디바이스를 포함할 수 있다. 이러한 하드웨어, 소프트웨어, 펌웨어 등은 본 명세서에 기술된 다양한 동작들 및 기능들을 지원하도록 동일한 디바이스 내에서 또는 개별 디바이스들 내에서 구현될 수 있다. 추가적으로, 본 발명에서 \"~부\"로 기재된 구성 요소들, 유닛들, 모듈들, 컴포넌트들 등은 함께 또는 개별적이지만 상호 운용 가능한 로직 디바이스들로서 개별 적으로 구현될 수 있다. 모듈들, 유닛들 등에 대한 서로 다른 특징들의 묘사는 서로 다른 기능적 실시예들을 강 조하기 위해 의도된 것이며, 이들이 개별 하드웨어 또는 소프트웨어 컴포넌트들에 의해 실현되어야만 함을 필수 적으로 의미하지 않는다. 오히려, 하나 이상의 모듈들 또는 유닛들과 관련된 기능은 개별 하드웨어 또는 소프트 웨어 컴포넌트들에 의해 수행되거나 또는 공통의 또는 개별의 하드웨어 또는 소프트웨어 컴포넌트들 내에 통합 될 수 있다. 특정한 순서로 동작들이 도면에 도시되어 있지만, 이러한 동작들이 원하는 결과를 달성하기 위해 도시된 특정한 순서, 또는 순차적인 순서로 수행되거나, 또는 모든 도시된 동작이 수행되어야 할 필요가 있는 것으로 이해되지 말아야 한다. 임의의 환경에서는, 멀티태스킹 및 병렬 프로세싱이 유리할 수 있다. 더욱이, 상술한 실시예에서 다양한 구성요소들의 구분은 모든 실시예에서 이러한 구분을 필요로 하는 것으로 이해되어서는 안되며, 기술된 구성요소들이 일반적으로 단일 소프트웨어 제품으로 함께 통합되거나 다수의 소프트웨어 제품으로 패키징될 수 있다는 것이 이해되어야 한다. 이상에서와 같이 도면과 명세서에서 최적 실시예가 개시되었다. 여기서 특정한 용어들이 사용되었으나, 이는 단 지 본 발명을 설명하기 위한 목적에서 사용된 것이지 의미한정이나 특허청구범위에 기재된 본 발명의 범위를 제 한하기 위하여 사용된 것은 아니다. 그러므로 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2022-0087780", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위하여 각 도면의 간단한 설명이 제공된다. 도 1은 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 시스템을 설명하기 위한 개략적인 블록도이다. 도 2는 본 발명의 일 실시예에 따른 현실정보 분석 모듈을 설명하기 위한 개략적인 블록도이다. 도 3은 본 발명의 일 실시예에 따른 가상화 모듈을 설명하기 위한 개략적인 블록도이다. 도 4는 본 발명의 일 실시예에 따른 BAS 모듈을 설명하기 위한 개략적인 블록도이다. 도 5는 본 발명의 일 실시예에 따른 장치 스마트화 모듈을 설명하기 위한 개략적인 블록도이다. 도 6은 본 발명의 일 실시예에 따른 컨텐츠 생성 모듈을 설명하기 위한 개략적인 블록도이다. 도 7은 본 발명의 일 실시예에 따른 온-오프라인 공연장 전환 서비스 방법(S10)을 설명하기 위한 개략적인 순서 도이다."}
