{"patent_id": "10-2020-0186469", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0094834", "출원번호": "10-2020-0186469", "발명의 명칭": "인공지능 기반의 배전망 자가복구 방법 및 그 장치", "출원인": "한국전기연구원", "발명자": "이진오"}}
{"patent_id": "10-2020-0186469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "배전망과 관련된 정보를 획득하는 단계;상기 획득된 배전망 정보를 기반으로 학습 데이터를 가공하는 단계;상기 가공된 학습 데이터에 대해 미리 결정된 지도 학습 알고리즘을 수행하여 배전망 자가복구모델을 생성하는단계; 및상기 배전망의 정전 시, 상기 배전망 자가복구모델을 이용하여 상기 정전된 배전망을 자가 복구하는 단계를 포함하는 인공지능 기반의 배전망 자가복구 방법."}
{"patent_id": "10-2020-0186469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 가공 단계는, 상기 배전망 정보를 기반으로 상기 배전망의 상태 정보에 따른 복수의 가상 상황 시나리오들을 생성하는 단계;및가상 상황 시나리오 별로, 상기 배전망의 시간대별 최적 복구 구조에 해당하는 최적 복구 시퀀스와, 상기 배전망의 시간대별 복구 구조에서의 분산자원 최적 발전량을 결정하는 단계를 포함하는 것을 특징으로 하는 인공지능 기반의 배전망 자가복구 방법."}
{"patent_id": "10-2020-0186469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 결정 단계는, 혼합정수선형계획법(Mixed Integer Linear Programming, MILP)을 이용하여 상기 배전망의 최적 복구 시퀀스를결정하는 것을 특징으로 하는 인공지능 기반의 배전망 자가복구 방법."}
{"patent_id": "10-2020-0186469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 결정 단계는,이차 계획법(Quadratic Programming, QP)을 이용하여 상기 배전망의 시간대별 복구 구조에서의 분산자원 최적발전량을 결정하는 것을 특징으로 하는 인공지능 기반의 배전망 자가복구 방법."}
{"patent_id": "10-2020-0186469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 가공 단계는,상기 배전망의 상태 정보를 상기 지도 학습 알고리즘의 독립 변수에 해당하는 학습 데이터로 설정하는 단계; 및상기 배전망의 시간대별 최적 복구 구조에 해당하는 최적 복구 시퀀스에 관한 정보와, 상기 배전망의 시간대별복구 구조에서의 분산자원 최적 발전량에 관한 정보를 상기 지도 학습 알고리즘의 종속 변수에 해당하는 학습데이터로 설정하는 단계를 더 포함하는 것을 특징으로 하는 인공지능 기반의 배전망 자가복구 방법."}
{"patent_id": "10-2020-0186469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 지도 학습 알고리즘은 심층 신경망(Deep Neural Network, DNN)임을 특징으로 하는 인공지능 기반의 배전망자가복구 방법."}
{"patent_id": "10-2020-0186469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 자가 복구 단계는, 공개특허 10-2022-0094834-3-상기 배전망의 초기 상태 정보를 검출하는 단계;상기 검출된 상태 정보를 상기 배전망 자가복구모델에 입력하는 단계;상기 배전망 자가복구모델을 이용하여 상기 배전망의 최적 복구 시퀀스를 예측하는 단계; 및상기 예측된 최적 복구 시퀀스를 기반으로 상기 배전망을 자가 복구하는 단계를 포함하는 것을 특징으로 하는인공지능 기반의 배전망 자가복구 방법."}
{"patent_id": "10-2020-0186469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 제1항 내지 제7항 중 어느 하나의 항에 따른 방법이 컴퓨터 상에서 수행될 수 있도록 컴퓨터 판독 가능한 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2020-0186469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "배전망과 관련된 정보를 배전관리시스템(Distribution Management System, DMS)으로부터 획득하는 배전망 정보획득부;상기 획득된 배전망 정보를 기반으로 학습 데이터를 가공하는 학습데이터 가공부; 및상기 가공된 학습 데이터에 대해 미리 결정된 지도 학습 알고리즘을 수행하여 배전망의 최적 복구 시퀀스를 결정하기 위한 배전망 자가복구모델을 생성하는 자가복구모델 생성부; 및상기 배전망의 정전 시, 상기 배전망 자가복구모델을 이용하여 상기 배전망의 최적 복구 시퀀스를 추론하고, 상기 추론된 최적 복구 시퀀스를 기반으로 상기 정전된 배전망을 자가 복구하는 배전망 자가복구부를 포함하는 인공지능 기반의 배전망 자가복구 장치."}
{"patent_id": "10-2020-0186469", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반의 배전망 자가복구 방법에 관한 것으로서, 배전망과 관련된 정보를 획득하는 단계; 상 기 획득된 배전망 정보를 기반으로 학습 데이터를 가공하는 단계; 상기 가공된 학습 데이터에 대해 미리 결정된 지도 학습 알고리즘을 수행하여 배전망 자가복구모델을 생성하는 단계; 및 상기 배전망의 정전 시, 상기 배전망 자가복구모델을 이용하여 상기 정전된 배전망을 자가 복구하는 단계를 포함한다."}
{"patent_id": "10-2020-0186469", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 배전망을 자가 복구하는 방법 및 그 장치에 관한 것으로서, 더욱 상세하게는 자연 재해 또는 에너지 재난 등의 사고로 인해 배전망에 정전이 발생한 경우, 인공지능(AI) 알고리즘을 이용하여 해당 배전망을 빠르고 안정적으로 자가 복구할 수 있는 방법 및 그 장치에 관한 것이다."}
{"patent_id": "10-2020-0186469", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능(Artificial Intelligence, AI)의 목표는 '사람처럼 생각하고 행동하는 기계/컴퓨터'를 만드는 것이다. 인공지능을 구현하고자 할 때, 지식과 규칙에서 시작해서 다양한 응용을 추구하는 top-down 방식과, 실 세계의 데이터에서 시작해서 특정 응용 문제를 해결하고 더 나아가 지식과 규칙의 발견까지도 기대하는 bottom-up 방식 의 두 방향이 가능하다. 최근 주목을 받고 있는 머신러닝(machine learning)은 대표적인 bottom-up 방식이다. 머신러닝의 학습 방법은 크게 지도학습, 비지도학습, 강화학습으로 분류되며, 딥러닝(deep learning)은 머신러 닝의 한 분야이다. 딥러닝(Deep Learning)은 컴퓨터가 여러 데이터를 이용해 마치 사람처럼 스스로 학습할 수 있도록 인공 신경망 (ANN, Artificial Neural Network)을 기반으로 구축한 기술이다. 딥러닝은 인간의 두뇌가 수많은 데이터 속에서 패턴을 발견한 뒤 사물을 구분하는 정보 처리 방식을 모방해 컴퓨터가 사물을 분별하도록 기계를 학습시킨다. 딥러닝 기술을 적용하면 사람이 모든 판단 기준을 정해주지 않아도 컴퓨터가 스스로 인지, 추론, 판단할 수 있 게 된다. 이러한 딥러닝 기술을 가능하게 하는 딥러닝 알고리즘에는 심층 신경망(DNN, Deep Neural Network), 합성곱 신경망(CNN, Convolutional Neural Network), 순환 신경망(RNN, Recurrent Neural Network) 등이 있다. 최근 들어 딥러닝 기술에 대한 사회적 관심이 폭발적으로 증가함에 따라 해당 기술이 자율주행, 생체인식, 영상"}
{"patent_id": "10-2020-0186469", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "인식, 음성인식, 유통 산업, 제조 산업, 의료 산업 및 전력 산업 등과 같은 다양한 기술분야에 폭넓게 적용되고 있다. 한편, 전력망에 대규모 신재생에너지원이 도입되고 있고, 전력망을 구성하는 많은 요소들이 원격 제어가 가능해 짐에 따라 전력망의 관리 및 운영이 점점 자동화되고 있다. 하지만, 이는 오히려 자연 재해가 전력망에 미치는 영향을 증대시키고, 사이버 공격(cyber-attack)에 취약한 상황을 야기하여 정전 발생 가능성을 높이고 있다. 이 에 따라, 배전관리시스템(Distribution Management System, DMS)은 자연 재해 또는 에너지 재난 등의 사고로인해 배전망에 정전이 발생한 경우 내부 분산전원과 부하 및 선로 스위치의 동작으로 빠르고 안정적으로 복구하 여 배전망의 부하에 에너지를 공급해야 하며, 이와 관련된 많은 연구가 진행되고 있다. 기존의 배전망 자가복구 알고리즘은, 자연 재해 또는 에너지 재난 등의 사고로 인해 배전망에 정전이 발생된 경 우, 최적 문제 정식화와 그 풀이를 통해 배전망의 최종 복구 구조를 결정하는 방식을 사용한다. 기존의 다른 배 전망 자가복구 알고리즘은 배전망, 분산전원, 부하 및 선로에 관한 선형화 모델을 이용하여 정전 후 배전망이 복구되는 시간대별 시퀀스를 빠르게 결정하는 방식을 사용한다. 배전망이 전체 또는 넓은 범위에서 정전이 발생한 후 최적의 구조로 자가복구하기 위해서는 회복되는 배전망의 주파수, 전압 및 예비력 등의 안정도를 지속적으로 유지하면서 순차적으로 복구가 진행되어야 하나, 기존의 많 은 연구는 정전 이후 배전망의 최종 복구 구조만을 결정한다. 이 경우, 블랙 스타트(black start) 기능을 갖춘 분산전원의 용량이 충분하지 않다면, 타 분산전원, 부하, 선로의 온(on)/오프(off) 순서에 따라 복구 중인 전력 망에 다시 전압품질 저하 및 재정전이 발생할 가능성이 있다. 한편, 자가복구를 위한 스위치 동작 시퀀스를 결정하는 기존 방식의 경우, 배전망, 분산전원, 선로 스위치 등 비선형성이 많은 모델들을 통합하기 위해 복잡한 최적화 알고리즘을 사용하기 때문에 연산 시간이 오래 걸려서 배전망을 빠르게 복구하기 어렵다는 문제가 있다. 또한, 배전망과 내부 자원들, 그리고 스위칭 동작을 선형화된 수식으로 표현하여 최적의 복구 시퀀스를 빠르게 결정하는 기존 방식의 경우, 최적의 복구 시퀀스를 결정하기 위한 연산시간은 단축했지만 선형화로 인해 유일해가 존재하지 않을 수 있으며 분산전원의 출력이 최적 문제를 푸는 알고리즘에 따라 지속적인 변동이 발생할 여지가 있다. 또한, 모든 분산자원의 수학적 모델이 정수 변수를 포함한 선형 모델이어야 하기 때문에 새로운 분산자원에 관한 모델을 추가하거나 혹은 기존 분산자원에 관한 모 델을 변경할 경우 추가 반영이 어렵다는 단점이 있다."}
{"patent_id": "10-2020-0186469", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제 및 다른 문제를 해결하는 것을 목적으로 한다. 또 다른 목적은 자연 재해 또는 에너지 재난 등의 사고로 인해 배전망에 정전이 발생한 경우, 미리 결정된 지도 학습 알고리즘을 이용하여 해당 배전망 을 빠르고 안정적으로 자가 복구할 수 있는 방법 및 그 장치를 제공함에 있다."}
{"patent_id": "10-2020-0186469", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따르면, 배전망과 관련된 정보를 획득하는 단계; 상 기 획득된 배전망 정보를 기반으로 학습 데이터를 가공하는 단계; 상기 가공된 학습 데이터에 대해 미리 결정된 지도 학습 알고리즘을 수행하여 배전망 자가복구모델을 생성하는 단계; 및 상기 배전망의 정전 시, 상기 배전망 자가복구모델을 이용하여 상기 정전된 배전망을 자가 복구하는 단계를 포함하는 인공지능 기반의 배전망 자가복 구 방법을 제공한다. 본 발명의 다른 측면에 따르면, 배전망과 관련된 정보를 배전관리시스템(DMS)으로부터 획득하는 배전망 정보 획 득부; 상기 획득된 배전망 정보를 기반으로 학습 데이터를 가공하는 학습데이터 가공부; 및 상기 가공된 학습 데이터에 대해 미리 결정된 지도 학습 알고리즘을 수행하여 배전망의 최적 복구 시퀀스를 결정하기 위한 배전망 자가복구모델을 생성하는 자가복구모델 생성부; 및 상기 배전망의 정전 시, 상기 배전망 자가복구모델을 이용하 여 상기 배전망의 최적 복구 시퀀스를 추론하고, 상기 추론된 최적 복구 시퀀스를 기반으로 상기 정전된 배전망 을 자가 복구하는 배전망 자가복구부를 포함하는 인공지능 기반의 배전망 자가복구 장치를 제공한다. 본 발명의 또 다른 측면에 따르면, 배전망과 관련된 정보를 획득하는 과정; 상기 획득된 배전망 정보를 기반으 로 학습 데이터를 가공하는 과정; 상기 가공된 학습 데이터에 대해 미리 결정된 지도 학습 알고리즘을 수행하여 배전망 자가복구모델을 생성하는 과정; 및 상기 배전망의 정전 시, 상기 배전망 자가복구모델을 이용하여 상기 정전된 배전망을 자가 복구하는 과정이 컴퓨터 상에서 수행될 수 있도록 컴퓨터 판독 가능한 기록매체에 저장된 컴퓨터 프로그램을 제공한다."}
{"patent_id": "10-2020-0186469", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예들에 따른 배전망 자가복구 방법 및 그 장치의 효과에 대해 설명하면 다음과 같다. 본 발명의 실시 예들 중 적어도 하나에 의하면, 배전망 정보를 기반으로 가공된 학습 데이터들에 대해 지도 학 습을 수행하여 배전망 자가복구모델을 생성하고, 정전 이벤트 발생 시, 상기 생성된 배전망 자가복구모델을 이 용하여 배전망을 빠르게 안정적으로 자가 복구할 수 있다는 장점이 있다. 본 발명의 실시 예들 중 적어도 하나에 의하면, 배전망 자가 복구를 위한 시간대별 분산전원 출력과 부하, 선로 의 스위치 동작을 인공지능 기반 알고리즘으로 결정함으로써, 배전망의 최적 복구 시퀀스를 결정하기 위한 연산 시간을 획기적으로 줄일 수 있을 뿐만 아니라, 배전망 및 분산자원들의 비선형적 특성을 충분히 반영할 수 있다 는 장점이 있다. 다만, 본 발명의 실시 예들에 따른 배전망 자가복구 방법 및 그 장치가 달성할 수 있는 효과는 이상에서 언급한"}
{"patent_id": "10-2020-0186469", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "것들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0186469", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 즉, 본 발명에서 사용되는 '부' 라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소를 의미하며, '부'는 어떤 역할들을 수행한 다. 그렇지만 '부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '부'는 어드레싱할 수 있는 저장 매 체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요 소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들 및 변수들을 포함한다. 구성요소들과 '부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '부'들 로 결합되거나 추가적인 구성요소들과 '부'들로 더 분리될 수 있다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포 함하는 것으로 이해되어야 한다. 본 발명은 자연 재해 또는 에너지 재난 등의 사고로 인해 배전망에 정전이 발생한 경우, 미리 결정된 지도 학습 알고리즘을 이용하여 해당 배전망을 빠르고 안정적으로 자가 복구할 수 있는 방법 및 그 장치를 제안한다. 상기 지도 학습 알고리즘으로는 K-최 근접 이웃(k-Nearest Neighbors), 선형 회귀(Linear Regression), 로지스틱 회 귀(Logistic Regression), 서포트 벡터 머신(SVM, Support Vector Machine), 결정 트리(Decision Tree), 랜덤 포레스트(Random Forest), 신경망(Neural Network) 등이 사용될 수 있으며 반드시 이에 제한되지는 않는다. 이 하, 본 명세서에서는 딥러닝 알고리즘의 하나인 심층 신경망(Deep Neural Network, DNN)이 지도 학습 알고리즘 으로 사용되는 것을 예시하여 설명하도록 한다.이하에서는, 본 발명의 다양한 실시 예들에 대하여, 도면을 참조하여 상세히 설명한다. 도 1은 본 발명과 관련된 다층 퍼셉트론(MLP)의 구조를 나타내는 도면이고, 도 2는 도 1에 도시된 다층 퍼셉트 론의 학습 과정을 설명하기 위해 참조되는 도면이다. 도 1 및 도 2를 참조하면, 본 발명과 관련된 다층 퍼셉트론(Multi-Layer Perceptron, MLP, 100)은 입력층 (input layer, 110), 은닉층(hidden layer, 120) 및 출력층(output layer, 130)으로 구성된다. 다층 퍼셉트론은 단일 퍼셉트론의 한계를 극복하기 위해 제안된 인공 신경망 구조이다. 즉, 다층 퍼셉트론 은 XOR 게이트(eXclusive-OR gate)와 같이 비선형적으로 분리되는 데이터에 대해서도 학습이 가능하도록 제안된 인공 신경망 구조이다. 이를 위해, 상기 다층 퍼셉트론은, 단일 퍼셉트론과 달리, 하나 이상의 은 닉층을 더 포함하는 구조를 갖는다. 다층 퍼셉트론의 입력층은 독립 변수에 해당하는 입력 벡터가 위치하는 층을 의미하고, 출력층 은 종속 변수에 해당하는 출력 벡터가 위치하는 층을 의미한다. 그리고, 은닉층은 입력층과 출력층 사이에 존재하는 모든 층을 의미한다. 상기 은닉층의 개수가 많아질수록 인공 신경망이 ‘깊어졌다 (deep)’라고 부르며, 이렇게 충분히 깊어진 인공 신경망을 학습 모델로 사용하는 머신러닝 패러다임을 바로 딥 러닝(Deep Learning)이라 지칭한다. 그리고, 딥러닝을 위해 사용하는 충분히 깊은 인공 신경망을 심층 신경망 (DNN)이라 통칭한다. 다층 퍼셉트론 구조에서, 입력층에 존재하는 노드들은 매개 변수(parameter)와 활성 함수(activation function)를 사용하지 않은 반면, 은닉층 및 출력층에 존재하는 노드들은 매개 변수와 활성 함수를 사용한다. 여기서, 상기 매개 변수는 학습 과정을 통해 자동으로 가변되는 값으로서 가중치(weight)와 편향 (bias)을 포함할 수 있다. 가중치는 입력 신호가 결과 출력에 주는 영향도를 조절하는 매개변수이고, 편향은 노 드(또는 뉴런)가 얼마나 쉽게 활성화(activation)되느냐를 조정하는 매개변수이다. 활성 함수는 어떠한 신호를 입력 받아 이를 적절히 처리하여 출력해주는 함수를 의미한다. 상기 활성 함수로는 시그모이드(sigmoid) 함수, ReLU(Rectified Linear Unit) 함수, 소프트맥스(softmax) 함수, 항등(identity) 함수 등이 사용될 수 있으며 반드시 이에 제한되지는 않는다. 다층 퍼셉트론은 각 층의 노드들(또는 뉴런들, nodes) 간에 2차원적으로 연결되는 완전 연결 구조(fully- connected structure)를 갖는다. 이때, 상기 완전 연결 구조는 서로 같은 층에 위치한 노드들 간에는 연결 관계 가 존재하지 않으며, 바로 인접한 층에 위치한 노드들 간에만 연결 관계가 존재하는 구조이다. 이와 같은 다층 퍼셉트론의 학습 동작을 간단히 설명하면 다음과 같다. 먼저, 각 층에서의 매개 변수인 가 중치(weight)와 편향(bias)의 초기값을 설정한다. 이후, 하나의 학습(훈련) 데이터에 대해 각 층에서의 순입력 함수값을 계산하고 최종적으로 활성 함수(activation function)에 의한 출력값(즉, 결과값)을 계산한다. 여기서, 상기 순입력 함수값은 각 노드의 활성 함수에 입력되는 값을 의미한다. 그 다음, 출력층의 활성 함수에 의한 출력값과 실제값의 차이가 허용 오차 이내가 되도록 각 층에서의 가중치 및 편향을 업데이트한다. 마지막 으로, 모든 학습 데이터에 대해서 출력층의 활성 함수에 의한 출력값과 실제값의 차이가 허용 오차 이내가 되면 학습을 종료한다. 즉, 도 2에 도시된 바와 같이, 다층 퍼셉트론의 학습 과정은 순전파(feedforward, FF)와 역전파 (backpropagation, BP)의 반복 과정으로 정의될 수 있다. 이러한 반복 과정은 출력층에서의 오차가 0에 가 까워질 때까지 계속될 수 있다. 순전파(FF) 과정은 입력층에서 출력층 방향으로 이동하면서 각 입력에 해당하는 가중치(w)가 곱해지 고, 결과적으로 가중치 합으로 계산되어 각 층의 활성 함수로 입력되며, 최종적으로 출력층의 활성 함수에 서 결과값이 출력되는 일련의 학습 과정을 일컫는다. 역전파(BP) 과정은 출력층에서 입력층 방향으로 이동하면서 순전파 과정에서 발생한 오차(Error)를 줄이기 위해 각 층의 가중치 및 편향을 업데이트하는 일련의 학습 과정을 일컫는다. 상기 역전파(BP) 과정에서 가중치를 결정하는 방법으로 경사 하강법(Gradient Descent)이 사용될 수 있다. 경사 하강법은 손실 함수(loss function)의 최저 지점을 찾아가는 최적화 기법으로서, 상기 손실 함수의 기울기 를 구하여 기울기가 낮은 쪽으로 계속 이동시켜서 최저 지점에 이를 때까지 계속 반복하는 기법이다. 여기서, 상기 손실 함수는 출력층에서 계산한 결과값과 실제값과의 차이(즉, 오차)를 정의한 함수이다. 상기 손실 함수로는 평균 제곱 오차(Mean Squared Error, MSE) 또는 교차 엔트로피 오차(Cross Entropy Error, CEE)가 사용될 수 있으며 반드시 이에 제한되지는 않는다. 도 3은 본 발명의 일 실시 예에 따른 배전망의 구조를 예시하는 도면이다. 도 3을 참조하면, 본 발명의 일 실시 예에 따른 배전망은 상위 계통의 전력망과 연계 가능하며, 복수의 분 산전원들, 복수의 에너지저장장치들, 복수의 제어 가능한 부하들, 복수의 노드들 및 복수 의 선로 스위치들을 포함할 수 있다. 분산전원들(Distributed Generation, DG, 210)은, 대규모 집중 전원과 달리, 수용가에 분산 배치되는 발전설비 를 의미한다. 상기 분산전원은 신재생에너지를 이용한 발전설비와 자가용 전기설비에 해당하는 발전설비 를 포함한다. 분산전원들 중 적어도 하나는 배전망의 정전 복구를 개시하기 위한 블랙 스타트(black start) 기능을 구비할 수 있다. 여기서, 블랙 스타트는 특정 스테이션이 자체 전원을 생성하여 정전 후 다시 운전을 개시할 수 있도록 한다. 블랙 스타트의 주요 목적은 정전 또는 정전이 발생할 때 배전망을 빠르게 복구시키는 것이다. 대 부분의 분산전원은 정전 후 오프 스테이션 전원 없이 재시동 할 수 없으므로 일부 스테이션의 정전 개시 기능은 정전 후 효율적인 전력 재 확립을 달성하는 데 필수적이다. 분산전원들은 배전망의 최적 복구 시퀀스를 결정하기 위해 고려해야 할 제약 조건 대상에 해당하며, 상기 분산전원들의 제약조건으로는 블랙 스타트 여부에 따른 동작 제약, 증감발율(ramp-rate) 제약, 유효 및 무효 전력 출력 상/하한 제약 등이 있다. 에너지저장장치들(Energy Storage System, ESS, 220)은 화력이나 원자력, 그리고 태양광 및 풍력을 이용한 신재 생에너지 등으로 생산된 전기 에너지를 저장하고 필요할 때 사용할 수 있는 장치를 말한다. 에너지를 저장하는 방식에 따라서 양수 발전, 압축 공기 저장 장치, 플라이 휠 등을 이용하는 물리적 저장과 리튬 이온 전지, 납축 전지, 흐름 전지 등의 화학적 저장으로 분류된다. 또한 전기 에너지로 물을 전기 분해 하여 수소 형태로 저장하 는 것도 일종의 에너지 저장이다. 에너지저장장치들은 배전망의 최적 복구 시퀀스를 결정하기 위해 고려해야 할 제약 조건 대상에 해당 하며, 상기 에너지저장장치들의 제약조건으로는 유효 및 무효 전력 출력 상/하한 제약, 에너지 잔존용량 상/하한 제약 등이 있다. 부하는 전력 계통에서 전기 에너지를 소비하는 모든 장치를 의미한다. 한편, 제어 가능한 부하(Controllable load, 230)는 일반적인 부하들 중 시스템 운영자 또는 전력 사용자에 의해 제어 가능한 부하를 지칭한다. 제어 가능한 부하들은 배전망의 최적 복구 시퀀스를 결정하기 위해 고려해야 할 제약 조건 대상에 해 당하며, 상기 제어 가능한 부하들의 제약조건으로는 모선 가압 시 부하 자동 연계 제약, 제어 가능한 부하 의 연계 여부 제약 등이 있다. 노드들(node, 240)은 배전망을 구성하는 선로, 발전기, 변압기, 조상설비 등이 접속되어 있는 공동도체를 말하며, 모선접속기기를 포함한다. 상기 노드들과 관련된 전력망 운영은 배전망의 최적 복구 시퀀스 를 결정하기 위해 고려해야 할 제약 조건 대상에 해당하며, 상기 전력망 운영의 제약조건으로는 선로 과부하 제 약, 조류 계산 제약, 전압 제약, 예비력 확보 제약 등이 있다. 선로 스위치들(또는 선로 개폐 장치들, 250)은, 배전관리시스템(DMS)의 원격 제어 명령에 따라, 배전망을 구성하는 선로를 자동으로 개폐(on/off)하는 장치이다. 상기 선로 스위치들의 동작은 배전망의 최적 복구 시퀀스를 결정하기 위해 고려해야 할 제약 조건 대상에 해당하며, 상기 선로 스위치들의 동작에 관한 제약조건으로는 스위치 연결 순서 제약, 토폴리지 구성 제약 등이 있다. 이와 같은 구성들(210~250)을 갖는 배전망은 자연 재해 또는 에너지 재난 등과 같은 다양한 사고로 인해 정전 이벤트가 발생할 수 있다. 이러한 경우, 배전망 안정도 유지 및 부하 회복량 최대화를 위한 최적의 배전망 복구 시퀀스를 결정하는 방법이 필요하다. 상기 배전망 복구 시퀀스를 결정하는 방법은 배전관리시스템(DMS)에 의해 수행되거나 혹은 상기 배전관리시스템(DMS)에 포함된 배전망 자가복구 장치에 의해 수행될 수 있다. 도 4 및 도 5는 본 발명의 일 실시 예에 따른 배전망 자가복구 방법을 설명하기 위해 참조되는 도면이다. 상기 배전망 자가복구 방법은 크게 지도 학습 알고리즘을 이용하여 배전망 자가복구모델을 생성하는 방법과, 미리 학 습된 배전망 자가복구모델을 이용하여 배전망을 자가 복구하는 방법으로 구성될 수 있다. 먼저, 도 4는 지도 학습 알고리즘을 이용하여 배전망 자가복구모델을 생성하는 방법을 설명하는 순서도이다. 도 4를 참조하면, 본 발명의 일 실시 예에 따른 배전망 자가복구 장치는 배전망과 관련된 정보를 배전관리시스 템(DMS)으로부터 획득하여 메모리 또는 데이터베이스에 저장할 수 있다(S410). 여기서, 상기 배전망과 관련된 정보(이하, 설명의 편의 상, '배전망 정보'라 칭함)는 해당 배전망을 구성하는 요소들에 관한 정보를 포함한다. 일 예로, 상기 배전망 정보는 해당 배전망의 토폴로지 정보, 계통 주파수 정보, 계통 전압 정보, 전력 조류 정 보, 선로 연계 구조, 선로 스위치 동작 여부, 선로 임피던스, 제어 가능한 부하의 연계 여부, 모선 별 부하 유/ 무효 전력, 분산전원 연계 여부, 분산전원 블랙 스타트 기능 여부, 분산전원 상세 스펙 정보, ESS 상세 스펙 정 보 등을 포함할 수 있으며 반드시 이에 제한되지는 않는다. 배전망 자가복구 장치는 상술한 과정을 통해 획득된 배전망 정보를 기반으로 배전망의 상태 정보에 따른 복수의 가상 상황 시나리오들을 생성하고, 상기 생성된 복수의 가상 상황 시나리오들에 관한 정보를 메모리 또는 데이 터베이스에 저장할 수 있다(S420). 여기서, 상기 복수의 가상 상황 시나리오들은 다양한 배전망 운영 시나리오 와 다양한 배전망 고장 시나리오를 포함할 수 있다. 또한, 상기 배전망의 상태 정보는 모선 별 부하 유/무효전 력 정보, 배터리 위치 정보, 배터리 SOC 정보, 배터리 최대 출력 정보, 배터리 용량 정보, 분산전원의 블랙 스 타트 기능 유무 정보, 분산전원의 최대 발전량 정보, 분산전원의 증감발율(ramp-rate) 제약 정보, 분산전원의 위치 정보, 배전망 토폴로지(선로 구조) 정보, 선로 스위치 정보, 제어 가능한 부하의 부하량 및 위치 정보, 배 전망 임피턴스 정보, 계통 전압 상/하한 정보, 선로 전류 상/하한 정보 등을 포함할 수 있으며 반드시 이에 제 한되지는 않는다. 배전망 자가복구 장치는, 가상 상황 시나리오 별로, 배전망의 최적 복구 시퀀스를 결정하고, 상기 결정된 최적 복구 시퀀스에 관한 정보를 메모리 또는 데이터베이스에 저장할 수 있다(S430). 여기서, 상기 배전망의 최적 복 구 시퀀스는 해당 배전망의 시간대별 최적 복구 구조를 의미한다. 가령, 도 6a 및 도 6b에 도시된 바와 같이, 배전망에 정전 이벤트가 발생한 경우, 해당 배전망의 최적 복구 시퀀스는 정전 이후에 시간대별로 복 구되는 제1 단계 내지 제5 단계의 배전망 구조를 의미한다. 배전망 자가복구 장치는 배전망의 모든 구성 요소를 정수를 포함한 선형식으로 근사화하여 혼합정수선형계획법 (Mixed Integer Linear Programming, MILP)으로 상기 배전망의 최적 복구 시퀀스를 결정할 수 있다. 즉, 배 전망 자가복구 장치는 혼합정수선형계획법(MILP)을 이용하여 배전망 복구 시퀀스와 관련된 최적화 문제의 해를 도출함으로써, 해당 배전망의 시간대별 최적 복구 구조를 결정할 수 있다. 여기서, 상기 혼합정수선형계획법 (MILP)은 선형계획모델에서 사용되는 의사결정변수의 일부가 정수 제약을 가지는 경우의 선형계획모델을 의미한 다. 배전망 자가복구 장치는, 가상 상황 시나리오 별로, 미리 결정된 비선형 알고리즘을 이용하여 배전망의 시간대 별 복구 구조에서의 분산자원 최적 발전량을 결정하고, 상기 결정된 분산자원 최적 발전량에 관한 정보를 메모 리 또는 데이터베이스에 저장할 수 있다(S440). 이때, 상기 미리 결정된 비선형 알고리즘으로는 이차 계획법 (Quadratic Programming, QP)이 사용될 수 있으며 반드시 이에 제한되지는 않는다. 상기 이차 계획법은 수리계 획법의 일종으로 선형 등식 또는 선형 부등식으로 주어진 제약 아래에서 이차함수의 최소값 또는 최대값을 구하 는 방법이다. 배전망의 복구 구조가 정해진 상태에서는 정수 변수가 포함되지 않으므로, 배전망 자가복구 장치는 분산자원들 의 비선형성을 반영할 수 있는 이차 계획법을 이용하여 분산자원 발전량과 관련된 최적화 문제의 해를 도출함으 로써, 해당 배전망의 시간대별 복구 구조에서의 분산자원 최적 발전량을 결정할 수 있다. 배전망 자가복구 장치는, 모든 가상 상황 시나리오에 대해, 배전망의 시간대별 최적 복구 구조와, 해당 배전망 의 시간대별 복구 구조에서의 분산자원 최적 발전량을 결정할 수 있다. 배전망 자가복구 장치는 상술한 410 단계 내지 440 단계를 통해 획득된 정보(또는 데이터)를 기반으로 지도 학 습 모델(즉, 지도 학습 알고리즘)의 변수를 결정할 수 있다(S450). 좀 더 구체적으로, 배전망 자가복구 장치는 배전망의 상태 정보를 지도 학습 모델의 독립 변수에 해당하는 학습 데이터로 결정(또는 설정)할 수 있다. 이때, 상기 배전망의 상태 정보는 모선 별 부하 유/무효전력 정보, 배터 리 위치 정보, 배터리 SOC 정보, 배터리 최대 출력 정보, 배터리 용량 정보, 분산전원의 블랙 스타트 기능 유무 정보, 분산전원의 최대 발전량 정보, 분산전원의 증감발율(ramp-rate) 제약 정보, 분산전원 위치 정보, 배전망 토폴로지(선로 구조) 정보, 선로 스위치 정보, 제어 가능한 부하의 부하량 및 위치 정보, 배전망 임피턴스 정보, 계통 전압 상/하한 정보, 선로 전류 상/하한 정보 등을 포함할 수 있으며 반드시 이에 제한되지는 않는다.배전망 자가복구 장치는 배전망의 시간대별 최적 복구 구조에 해당하는 최적 복구 시퀀스에 관한 정보와, 상기 배전망의 시간대별 복구 구조에서의 분산자원 최적 발전량에 관한 정보를 지도 학습 모델의 종속 변수에 해당하 는 학습 데이터로 결정(또는 설정)할 수 있다. 이때, 상기 배전망의 최적 복구 시퀀스에 관한 정보는 시간대별 제어 가능한 부하의 동작 상태(on/off) 정보 및 시간대별 선로 스위치의 동작 상태(on/off) 정보를 포함할 수 있다. 상기 분산자원 최적 발전량에 관한 정보는 시간대별 ESS 유/무효전력 출력량 정보 및 시간대별 DG 유/무 효전력 출력량 정보를 포함할 수 있다. 배전망 자가복구 장치는 독립 변수 및 종속 변수로 결정된 학습 데이터를 전 처리하는 동작을 수행할 수 있다. 일 예로, 배전망 자가복구 장치는 학습 데이터의 결측치 및 이상치를 검출하고, 상기 검출된 결측치 및 이상치 를 미리 결정된 전 처리 방식에 따라 보정할 수 있다. 배전망 자가복구 장치는 전 처리된 학습 데이터를 훈련 데이터 셋(training data set)과 시험 데이터 셋(test data set)으로 분류하는 동작을 수행할 수 있다. 여기서, 훈련 데이터 셋은 배전망 자가복구모델을 생성하기 위 해 사용되고, 시험 데이터 셋은 배전망 자가복구모델을 검증하기 위해 사용된다. 배전망 자가복구 장치는 훈련 데이터 셋을 기반으로 미리 결정된 지도 학습 알고리즘을 수행할 수 있다(S460). 이때, 상기 지도 학습 알고리즘으로는 K-최 근접 이웃(k-Nearest Neighbors), 선형 회귀(Linear Regression), 로지스틱 회귀(Logistic Regression), 서포트 벡터 머신(SVM, Support Vector Machine), 결정 트리(Decision Tree), 랜덤 포레스트(Random Forest), 신경망(Neural Network) 등이 사용될 수 있으며 반드시 이에 제한되지 는 않는다. 이하, 본 실시 예에서는 딥러닝 알고리즘의 하나인 심층 신경망(DNN)이 지도 학습 알고리즘으로 사 용되는 것을 예시하여 설명하도록 한다. 배전망 자가복구 장치는, 지도 학습 알고리즘의 종속 변수에 관한 예측 정확도가 기준치 이상이 될 때까지, 상 기 지도 학습 알고리즘을 반복적으로 수행할 수 있다(S470). 배전망 자가복구 장치는 상술한 지도 학습 알고리즘을 반복적으로 수행하여 배전망의 최적 복구 시퀀스를 결정 하기 위한 배전망 자가복구모델을 생성할 수 있다(S480). 배전망 자가복구 장치는 시험 데이터 셋을 기반으로 배전망 자가복구모델의 성능을 검증할 수 있다(S490). 상기 배전망 자가복구모델에 대한 성능 검증 완료 시, 배전망 자가복구 장치는 배전망 자가복구모델을 메모리 또는 데이터베이스에 저장할 수 있다. 다음으로, 도 5는 미리 학습된 배전망 자가복구모델을 이용하여 배전망을 자가 복구하는 방법을 설명하는 순서 도이다. 도 5를 참조하면, 배전망 자가복구 장치는 자연 재해 또는 에너지 재난 등의 사고로 인해 배전망에 정전 이벤트 가 발생하는지를 감지(또는 모니터링)할 수 있다(S510). 상기 510 단계의 확인 결과, 정전 이벤트 발생을 감지한 경우, 배전망 자가복구 장치는 배전망의 (초기) 상태 정보를 검출하고, 상기 검출된 배전망의 상태 정보를 메모리 또는 데이터베이스에 저장할 수 있다(S520). 여기 서, 상기 배전망의 상태 정보는 배전망 자가복구모델의 입력 값으로 사용될 수 있다. 배전망 자가복구 장치는 메모리 또는 데이터베이스에 저장된 배전망 자가복구모델을 호출할 수 있다(S530). 배전망 자가복구 장치는 상기 호출된 배전망 자가복구모델을 이용하여 배전망의 시간대별 최적 복구 구조에 해 당하는 최적 복구 시퀀스에 관한 정보와, 상기 배전망의 시간대별 복구 구조에서의 분산자원 최적 발전량에 관 한 정보를 추론할 수 있다(S540). 즉, 배전망 자가복구 장치는 배전망의 상태 정보를 배전망 자가복구모델에 입 력하여 해당 배전망의 최적 복구 시퀀스 및 분산자원 최적 발전량에 관한 정보를 예측할 수 있다. 배전망 자가복구 장치는 상기 예측된 배전망의 최적 복구 시퀀스 및 분산자원 최적 발전량에 관한 정보를 기반 으로 해당 배전망에 대한 자가 복구를 빠르고 안정적으로 수행할 수 있다(S550). 가령, 도 6a 및 도 6b에 도시 된 바와 같이, 배전망 자가복구 장치는, 배전망에 정전 이벤트가 발생한 경우, 해당 배전망의 최적 복구 시퀀스 및 분산자원 최적 발전량에 관한 정보를 기반으로 해당 배전망을 시간대별로 자가 복구할 수 있다. 한편, 본 실시 예에서는, 자가 복구의 대상이 '배전망'임을 예시하고 있으나 반드시 이에 제한되지는 않으며, 전력망 또는 마이크로그리드(microgrid) 등에 본 발명이 적용될 수 있음은 당업자에게 자명할 것이다. 이상 상술한 바와 같이, 본 발명의 일 실시 예에 따른 배전망 자가복구 방법은, 배전망에 정전이 발생한 경우, 인공지능 기반 알고리즘을 통해 미리 학습된 배전망 자가복구모델을 이용하여 해당 배전망을 빠르고 안정적으로 복구시킬 수 있다. 도 7은 본 발명의 일 실시 예에 따른 배전망 자가복구 장치의 구성을 나타내는 도면이다. 도 7을 참조하면, 본 발명의 일 실시 예에 따른 배전망 자가복구 장치는 배전망 정보 획득부, 학습데 이터 가공부, 자가복구모델 생성부 및 배전망 자가복구부를 포함할 수 있다. 도 7에 도시된 구 성요소들은 배전망 자가복구 장치를 구현하는데 있어서 필수적인 것은 아니어서, 본 명세서 상에서 설명되 는 배전망 자가복구 장치는 위에서 열거된 구성요소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 배전망 정보 획득부는 배전망과 관련된 정보를 배전관리시스템(DMS)으로부터 획득할 수 있다. 여기서, 상 기 배전망과 관련된 정보(즉, 배전망 정보)는 해당 배전망을 구성하는 요소들에 관한 정보를 포함한다. 일 예로, 상기 배전망 정보는 해당 배전망의 토폴로지 정보, 계통 주파수 정보, 계통 전압 정보, 전력 조류 정보, 선로 연계 구조, 원격 스위치 동작 여부, 선로 임피던스, 제어 가능한 부하의 연계 여부, 모선 별 부하 유/무효 전력, 분산전원 연계 여부, 분산전원 블랙 스타트 기능 여부, 분산전원 상세 스펙 정보, ESS 상세 스펙 정보 등 을 포함할 수 있으며 반드시 이에 제한되지는 않는다. 학습데이터 가공부는 배전망 정보 획득부를 통해 수집된 배전망 정보를 기반으로 배전망의 상태 정보 에 따른 복수의 가상 상황 시나리오들을 생성할 수 있다. 여기서, 상기 배전망의 상태 정보는 모선 별 부하 유/ 무효전력 정보, 배터리 위치 정보, 배터리 SOC 정보, 배터리 최대 출력 정보, 배터리 용량 정보, 분산전원의 블 랙 스타트 기능 유무 정보, 분산전원의 최대 발전량 정보, 분산전원의 증감발율(ramp-rate) 제약 정보, 분산전 원의 위치 정보, 배전망 토폴로지(선로 구조) 정보, 선로 스위치 정보, 제어 가능한 부하의 부하량 및 위치 정 보, 배전망 임피턴스 정보, 계통 전압 상/하한 정보, 선로 전류 상/하한 정보 등을 포함할 수 있으며 반드시 이 에 제한되지는 않는다. 학습데이터 가공부는, 가상 상황 시나리오 별로, 배전망의 시간대별 최적 복구 구조에 해당하는 최적 복구 시퀀스를 결정할 수 있다. 이때, 학습데이터 가공부는 혼합정수선형계획법(MILP)을 이용하여 배전망의 최 적 복구 시퀀스를 결정할 수 있다. 학습데이터 가공부는, 가상 상황 시나리오 별로, 배전망의 시간대별 복구 구조에서의 분산자원 최적 발전 량을 결정할 수 있다. 이때, 학습데이터 가공부는 비선형 알고리즘에 해당하는 이차 계획법(QP)을 이용하 여 분산자원 최적 발전량을 결정할 수 있다. 학습데이터 가공부는 배전망의 상태 정보, 배전망의 최적 복구 시퀀스에 관한 정보, 배전망 복구 구조에서 의 분산자원 최적 발전량에 관한 정보를 기반으로 지도 학습 모델의 변수에 해당하는 학습 데이터를 결정할 수 있다. 즉, 학습데이터 가공부는 배전망의 상태 정보를 지도 학습 모델의 독립 변수에 해당하는 학습 데이 터로 결정할 수 있다. 또한, 학습데이터 가공부는 배전망의 시간대별 최적 복구 구조에 해당하는 최적 복 구 시퀀스에 관한 정보와, 상기 배전망의 시간대별 복구 구조에서의 분산자원 최적 발전량에 관한 정보를 지도 학습 모델의 종속 변수에 해당하는 학습 데이터로 결정할 수 있다. 학습데이터 가공부는 독립 변수 및 종속 변수로 결정된 학습 데이터를 전 처리하고, 상기 전 처리된 학습 데이터를 훈련 데이터 셋과 시험 데이터 셋으로 분류할 수 있다. 자가복구모델 생성부는 학습데이터 가공부를 통해 생성된 훈련 데이터 셋을 기반으로 미리 결정된 지 도 학습 알고리즘을 수행할 수 있다. 이때, 상기 지도 학습 알고리즘으로는 심층 신경망(DNN)이 사용될 수 있다. 자가복구모델 생성부는 지도 학습 알고리즘을 통해 배전망의 최적 복구 시퀀스를 결정하기 위한 배전망 자 가복구모델을 생성하고, 상기 생성된 배전망 자가복구모델을 메모리 또는 데이터베이스에 저장할 수 있다. 이후, 자가복구모델 생성부는 학습데이터 가공부를 통해 생성된 시험 데이터 셋을 기반으로 배전망 자가복구모델의 성능을 검증할 수 있다. 배전망 자가복구부는 자연 재해 또는 에너지 재난 등의 사고로 인해 배전망에 정전 이벤트가 발생하는지를 감지할 수 있다. 배전망 자가복구부는, 배전망의 정전 이벤트 감지 시, 해당 배전망의 (초기) 상태 정보를 배전관리시스템(DMS)으로부터 획득할 수 있다. 배전망 자가복구부는 자가복구모델 생성부를 통해 생성된 배전망 자가복구모델을 이용하여 배전망의 최적 복구 시퀀스(즉, 배전망의 시간대별 최적 복구 구조)와, 상기 배전망의 시간대별 복구 구조에서의 분산자원 최적 발전량을 추론할 수 있다. 즉, 배전망 자가복구부는 배전망의 상태 정보를 배전망 자가복구모델에 입력하여 해당 배전망의 최적 복구 시퀀스 및 분산자원 최적 발전량에 관한 정보를 예측할 수 있다. 배전망 자가복구부는 상기 예측된 배전망의 최적 복구 시퀀스 및 최적 발전량에 관한 정보를 기반으로 해 당 배전망에 대한 자가 복구를 빠르고 안정적으로 수행할 수 있다. 이상 상술한 바와 같이, 본 발명의 일 실시 예에 따른 배전망 자가복구 장치는, 배전망에 정전이 발생한 경우, 인공지능 기반 알고리즘을 통해 미리 학습된 배전망 자가복구모델을 이용하여 해당 배전망을 빠르고 안정적으로 복구시킬 수 있다. 또한, 상기 배전망 자가복구 장치는 배전망 복구를 위한 시간대별 분산전원 출력과 부하, 선 로의 스위치 동작을 인공지능 기반 알고리즘으로 결정함으로써, 배전망의 최적 복구 시퀀스를 결정하기 위한 연 산 시간을 획기적으로 줄일 수 있을 뿐만 아니라, 배전망을 구성하는 분산자원들의 비선형적 특성을 충분히 반 영할 수 있다. 또한, 상기 배전망 자가복구 장치는 지도 학습에 기반하여 최적 솔루션을 미리 학습시켜두기 때 문에 주어진 배전망의 초기 상태에 대해 최적 해를 즉시 얻을 수 있고, 그에 따라 빠르고 안정적으로 최적의 복 구 절차에 들어갈 수 있다. 또한, 상기 배전망 자가복구 장치는 중요도가 높은 부하를 중심으로 전력을 빠르게 공급할 수 있기 때문에 갑작스런 정전으로 인한 피해를 최소화시킬 수 있다. 도 8은 본 발명의 일 실시 예에 따른 컴퓨팅 장치의 구성 블록도이다. 도 8을 참조하면, 본 발명의 일 실시 예에 따른 컴퓨팅 장치는 적어도 하나의 프로세서, 컴퓨터 판독 가능 저장 매체 및 통신 버스를 포함한다. 상기 컴퓨팅 장치는 상술한 배전망 자가복구 장치 또는 상기 배전망 자가복구 장치를 구성하는 요소들(310~340)에 포함되는 하나 이상의 컴포넌트일 수 있다. 프로세서는 컴퓨팅 장치로 하여금 앞서 언급된 예시적인 실시 예에 따라 동작하도록 할 수 있다. 예 컨대, 프로세서는 컴퓨터 판독 가능 저장 매체에 저장된 하나 이상의 프로그램들을 실행할 수 있다. 상기 하나 이상의 프로그램들은 하나 이상의 컴퓨터 실행 가능 명령어를 포함할 수 있으며, 상기 컴퓨터 실행 가능 명령어는 프로세서에 의해 실행되는 경우 컴퓨팅 장치로 하여금 예시적인 실시 예에 따른 동작들을 수행하도록 구성될 수 있다. 컴퓨터 판독 가능 저장 매체는 컴퓨터 실행 가능 명령어 내지 프로그램 코드, 프로그램 데이터 및/또는 다 른 적합한 형태의 정보를 저장하도록 구성된다. 컴퓨터 판독 가능 저장 매체에 저장된 프로그램은 프 로세서에 의해 실행 가능한 명령어의 집합을 포함한다. 일 실시 예에서, 컴퓨터 판독 가능 저장 매체(82 0)는 메모리(랜덤 액세스 메모리와 같은 휘발성 메모리, 비휘발성 메모리, 또는 이들의 적절한 조합), 하나 이 상의 자기 디스크 저장 디바이스들, 광학 디스크 저장 디바이스들, 플래시 메모리 디바이스들, 그 밖에 컴퓨팅 장치에 의해 액세스되고 원하는 정보를 저장할 수 있는 다른 형태의 저장 매체, 또는 이들의 적합한 조합 일 수 있다. 통신 버스는 프로세서, 컴퓨터 판독 가능 저장 매체를 포함하여 컴퓨팅 장치의 다른 다양 한 컴포넌트들을 상호 연결한다. 컴퓨팅 장치는 또한 하나 이상의 입출력 장치를 위한 인터페이스를 제공하는 하나 이상의 입출력 인 터페이스 및 하나 이상의 네트워크 통신 인터페이스를 포함할 수 있다. 입출력 인터페이스 및 네트워크 통신 인터페이스는 통신 버스에 연결된다. 입출력 장치는 입출력 인터페이스를 통해 컴퓨팅 장치의 다른 컴포넌트들에 연결될 수 있다. 예 시적인 입출력 장치는 포인팅 장치(마우스 또는 트랙패드 등), 키보드, 터치 입력 장치(터치패드 또는 터 치스크린 등), 음성 또는 소리 입력 장치, 다양한 종류의 센서 장치 및/또는 촬영 장치와 같은 입력 장치, 및/ 또는 디스플레이 장치, 프린터, 스피커 및/또는 네트워크 카드와 같은 출력 장치를 포함할 수 있다. 예시적인 입출력 장치는 컴퓨팅 장치를 구성하는 일 컴포넌트로서 컴퓨팅 장치의 내부에 포함될 수도 있 고, 컴퓨팅 장치와는 구별되는 별개의 장치로 컴퓨팅 장치와 연결될 수도 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다. 따라서, 상기 의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본발명의 범위에 포함된다."}
{"patent_id": "10-2020-0186469", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명과 관련된 다층 퍼셉트론(MLP)의 구조를 나타내는 도면; 도 2는 도 1에 도시된 다층 퍼셉트론의 학습 과정을 설명하기 위해 참조되는 도면; 도 3은 본 발명의 일 실시 예에 따른 배전망의 구조를 예시하는 도면; 도 4 및 도 5는 본 발명의 일 실시 예에 따른 배전망 자가복구 방법을 설명하기 위해 참조되는 도면; 도 6a 및 도 6b는 본 발명의 일 실시 예에 따른 배전망 자가복구 방법을 이용하여 배전망을 시간대별로 자가 복 구하는 과정을 설명하기 위해 참조되는 도면; 도 7은 본 발명의 일 실시 예에 따른 배전망 자가복구 장치의 구성을 나타내는 도면; 도 8은 본 발명의 일 실시 예에 따른 컴퓨팅 장치의 구성 블록도."}
