{"patent_id": "10-2020-0089401", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0011241", "출원번호": "10-2020-0089401", "발명의 명칭": "생체 신호와 환경 정보에 기반한 발향 장치의 동작 방법", "출원인": "주식회사 딥센트", "발명자": "권일봉"}}
{"patent_id": "10-2020-0089401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "생체 신호와 환경 정보에 기반한 발향 장치의 동작 방법에 있어서,일정 공간의 가스입자정보를 획득하는 하나 이상의 후각센서를 포함하여 냄새 민감도 정보, 수면실의 온도, 습도, 압력, 조도, 소음도 중 하나 이상을 포함하는 환경 정보를 취득하는 단계;사람의 생체 신호를 취득하는 단계;상기 환경 정보와 생체 신호를 처리하여 발향조건정보로 저장하는 단계;상기 발향조건정보에 기초하여 발향조건 프로세스를 매칭하고, 상기 발향조건 프로세스에 대응하는 발향조절정보를 저장 및 관리하는 단계;상기 발향조절정보에 따라, 하나 이상의 방향물질을 조합하여 발향 처리함과 아울러 상기 냄새 민감도 정보에대해 미리 설정된 탈취기능을 위한 방향물질 조합 정보로 발향 처리하여 탈취기능을 포함하는 단계;를 포함하는발향 장치의 동작 방법."}
{"patent_id": "10-2020-0089401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 발향조절정보를 저장 및 관리하는 단계는,상기 매칭된 발향조건 프로세스가 액티브 프로세스인 경우, 상기 발향조건정보에 따라, 상기 발향조절정보가 포함하는 방향 물질 배출 농도 또는 방향 물질 배출 세기 중하나 이상에 대해 기설정된 기준값과 최대값의 범위 내에서 대응하도록 매칭하는 단계;를 더 포함하는발향 장치의 동작 방법."}
{"patent_id": "10-2020-0089401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 발향조절정보를 저장 및 관리하는 단계는,상기 매칭된 발향조건 프로세스가 패시브 프로세스인 경우,상기 발향조건정보에 따라, 상기 발향조절정보가 포함하는 방향 물질 배출 농도 또는 방향 물질 배출 세기 중하나 이상에 대해 기설정된 최소값과 기준값의 범위 내에서 대응하도록 매칭하는 단계;를 더 포함하는발향 장치의 동작 방법."}
{"patent_id": "10-2020-0089401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 발향조절정보를 저장 및 관리하는 단계는,상기 매칭된 발향조건 프로세스가 제너럴 프로세스인 경우,상기 발향조건정보에 따라, 상기 발향조절정보가 포함하는 방향 물질 배출 농도 또는 방향 물질 배출 세기 중하나 이상에 대해 기설정된 기준값으로 발향하도록 매칭하는 단계;를 더 포함하는발향 장치의 동작 방법."}
{"patent_id": "10-2020-0089401", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2022-0011241-3-제 1 항에 있어서,사람의 생체 신호를 취득하는 단계를 통해 획득하는 생체 신호는 피검체를 대상으로 하여 체온과 맥박, 혈압,호흡, 혈당, 신체 움직임, 뇌파, 심전도, 산소 포화도 중 하나 이상을 포함하는 것을 특징으로 하는발향 장치의 동작 방법."}
{"patent_id": "10-2020-0089401", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따른 발향 장치의 동작 방법에 있어서, 일정 공간의 가스입자정보와 온도, 습도, 압력, 조 도, 소음도 중 하나 이상을 포함하는 환경 정보를 취득하는 단계; 사람의 생체 신호를 취득하는 단계; 상기 환경 정보와 생체 신호를 처리하여 발향조건정보로 저장하는 단계; 상기 발향조건정보에 기초하여 발향조건 프로세스 를 매칭하고, 상기 발향조건 프로세스에 대응하는 발향조절정보를 저장 및 관리하는 단계; 상기 발향조절정보에 따라, 하나 이상의 방향물질을 조합하여 발향 처리하는 단계;를 포함한다."}
{"patent_id": "10-2020-0089401", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 발향 장치 및 그 동작 방법에 관한 것으로, 보다 상세하게는 사람에게서 측정될 수 있는 생체 신호와 상기 사람이 위치한 장소 주위 환경 정보에 따라 발향 강도 또는 발향 종류를 조절할 수 있는 생체 신호와 환경 정보에 기반한 발향 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2020-0089401", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "환경은 생물에게 직접 또는 간접적으로 영향을 줄 수 있는 자연적 조건으로 볼 수 있다. 이러한 환경은 공기 중 에 분포하는 가스입자를 포함할 수 있고 인간은 공기 중에 존재하는 가스 형태의 입자를 코로 흡입하고 코 속의 후각 수용체가 화학적으로 자극되어 후각신경을 통해 냄새로 인지하여 식별할 수 있게 된다. 이 같은 후각 신경 자극에 대해 사람은 감성적으로 반응할 수 있고 정신적 또는 감정적인 안정감을 느낄 수 있다. 또한 이를 통해 숙면을 취할 수도 있고 신체 피로도를 감소시킬 수 있다. 이 같은 향기를 사용자에게 최적화하여 제공하기 위하여, 설치 공간의 온도나 습도 변화에 따라 휘산제의 토출 정도를 자동 조절할 수 있는 휘산기를 제공하는 대한민국 등록특허 제10-1248086호가 개시되어 있다. 상기 등록 특허에는 휘산제가 담기는 용기와, 상기 용기가 내장되는 공간을 제공하는 본체와, 상기 본체에 구비되어 온도 및 습도를 측정하는 측정수단과, 상기 휘산제를 상기 본체의 외부로 토출시키는 송풍수단과, 상기 측정수단에서 측정된 온도 또는 습도에 따라 상기 휘산제의 토출 정도를 조절하는 제어수단을 포함하는 휘산기가 기술되어 있 다. 그러나 이러한 종래 기술을 통해 사용자에게 향기를 제공하는 제어 조건이 온도나 습도로 극히 제한되어 있고, 이는 사용자의 신체 상태나 피로도, 생체 리듬이 고려되지 않은 절대적인 온도와 습도의 환경 변수로만 제어될 수 있는 한계가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-1248086호(2013.03.27)"}
{"patent_id": "10-2020-0089401", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 종래의 문제점을 해결하기 위한 것으로, 사람에게서 측정될 수 있는 생체 신호와 사람이 위치 한 장소의 주위 환경 정보에 기반하여 발향 강도 또는 발향 종류를 조절하여 최적화된 향기를 제공할 수 있는 생체 신호와 환경 정보에 기반한 발향 장치 및 그 동작 방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2020-0089401", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 본 발명의 실시 예에 따른 방법은, 발향 장치의 동작 방법에 있어서, 일정 공간의 가스입자정보와 온도, 습도, 압력, 조도, 소음도 중 하나 이상을 포함하는 환경 정보를 취득하는 단계; 사람의 생체 신호를 취득하는 단계; 상기 환경 정보와 생체 신호를 처리하여 발향조건정보로 저장하는 단계; 상기 발향 조건정보에 기초하여 발향조건 프로세스를 매칭하고, 상기 발향조건 프로세스에 대응하는 발향조절정보를 저장 및 관리하는 단계; 상기 발향조절정보에 따라, 하나 이상의 방향물질을 조합하여 발향 처리하는 단계;를 포함한 다.또한, 상기와 같은 과제를 해결하기 위한 본 발명의 실시 예에 따른 장치는, 생체 신호와 환경 정보에 기반한 발향 장치에 있어서, 일정 공간의 가스입자정보와 온도, 습도, 압력, 조도, 소음도 중 하나 이상을 포함하는 환 경 정보를 취득하는 환경 정보 취득부; 사람의 생체 신호를 취득하는 생체 신호 취득부; 상기 환경 정보와 생체 신호를 처리하여 발향조건정보로 저장하는 저장부; 상기 발향조건정보에 기초하여 발향조건 프로세스를 매칭하 고, 상기 발향조건 프로세스에 대응하는 발향조절정보를 저장 및 관리하는 발향조절정보 관리부; 및 상기 발향 조절정보에 따라, 하나 이상의 방향물질을 조합하여 발향 처리하는 발향 처리부;를 포함하는 발향 장치이다. 한편, 상기와 같은 과제를 해결하기 위한 본 발명의 실시 예에 따른 방법은 상기 방법을 실행시키기 위한 프로 그램 또는 상기 프로그램이 기록되어 컴퓨터가 읽을 수 있는 기록 매체로 구현될 수 있다."}
{"patent_id": "10-2020-0089401", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 사용자가 위치하는 공간의 환경과 사람이 인식할 수 있는 후각 민감도와 피로도를 고려하여 향기를 제공함으로써, 신체 피로도를 감소시키고 정신적, 감정적 신경을 안정시켜 감정을 편안하게 생 활의 활력을 찾게 하는 효과를 제공할 수 있다. 또한 사람의 생체 신호를 분석하고 이용함으로써 향기의 배출 농도와 배출 세기를 최적화하여 숙면을 취할 수 있도록 수면을 안정적으로 유도하고 지속하는 환경을 조성할 수 있다."}
{"patent_id": "10-2020-0089401", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 내용은 단지 본 발명의 원리를 예시한다. 그러므로 당업자는 비록 본 명세서에 명확히 설명되거나 도시 되지 않았지만 본 발명의 원리를 구현하고 본 발명의 개념과 범위에 포함된 다양한 장치와 방법을 발명할 수 있 는 것이다. 또한, 본 명세서에 열거된 모든 조건부 용어 및 실시 예들은 원칙적으로, 본 발명의 개념이 이해되 도록 하기 위한 목적으로만 명백히 의도되고, 이와 같이 특별히 열거된 실시 예들 및 상태들에 제한적이지 않는 것으로 이해되어야 한다. 또한, 본 발명의 원리, 관점 및 실시 예들 뿐만 아니라 특정 실시 예를 열거하는 모든 상세한 설명은 이러한 사 항의 구조적 및 기능적 균등물을 포함하도록 의도되는 것으로 이해되어야 한다. 또한 이러한 균등물들은 현재 공지된 균등물뿐만 아니라 장래에 개발될 균등물 즉 구조와 무관하게 동일한 기능을 수행하도록 발명된 모든 소 자를 포함하는 것으로 이해되어야 한다. 따라서, 예를 들어, 본 명세서의 블록도는 본 발명의 원리를 구체화하는 예시적인 회로의 개념적인 관점을 나타 내는 것으로 이해되어야 한다. 이와 유사하게, 모든 흐름도, 상태 변환도, 의사 코드 등은 컴퓨터가 판독 가능 한 매체에 실질적으로 나타낼 수 있고 컴퓨터 또는 프로세서가 명백히 도시되었는지 여부를 불문하고 컴퓨터 또 는 프로세서에 의해 수행되는 다양한 프로세스를 나타내는 것으로 이해되어야 한다. 또한 프로세서, 제어 또는 이와 유사한 개념으로 제시되는 용어의 명확한 사용은 소프트웨어를 실행할 능력을 가진 하드웨어를 배타적으로 인용하여 해석되어서는 아니 되고, 제한 없이 디지털 신호 프로세서(DSP) 하드웨어, 소프트웨어를 저장하기 위한 롬(ROM), 램(RAM) 및 비휘발성 메모리를 암시적으로 포함하는 것으로 이 해되어야 한다. 주지관용의 다른 하드웨어도 포함될 수 있다. 상술한 목적, 특징 및 장점은 첨부된 도면과 관련한 다음의 상세한 설명을 통하여 보다 분명해질 것이며, 그에"}
{"patent_id": "10-2020-0089401", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "따라 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있 을 것이다. 또한, 본 발명을 실시함에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에 그 상세한 설명을 생략하기로 한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시 예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 도 1과 도 2는 본 발명의 일 실시 예에 따른 발향 장치의 구성을 설명하기 위한 블록도이다. 도 1을 참조하면, 본 발명의 일 실시 예에 따른 발향 장치는, 제어부, 환경 정보 취득부, 생체 신호 취득부, 저장부, 발향조절정보 관리부, 발향 처리부, 스케줄링 발향 처리부, 통 신부를 포함하여 구성될 수 있다. 도 2를 참조하면, 본 발명의 일 실시 예에 따른 발향 장치의 일부 구성인 발향조절정보 관리부를 보다 구체적으 로 설명하기 위한 블록도로 상기 발향조절정보 관리부에는 액티브발향 관리부, 패시브발향 관리부 , 제너럴발향 관리부을 포함하여 구성될 수 있다. 상기 제어부는 발향 장치 각 구성요소들의 동작을 전반적으로 제어하기 위한 하나 이상의 프로세서로 구현될 수 있다. 상기 환경 정보 취득부는 일정 공간에서 측정될 수 있는 가스입자정보와 온도, 습도, 압력, 조도, 소음도 등을 포함하는 환경 정보를 취득할 수 있다. 또한 상기 환경 정보는 사람에게 직접 또는 간접적으로 영향을 줄 수 있는 자연적 조건 항목을 포함할 수 있고, 기체의 확산에 영향을 줄 수 있는 인자 항목을 포함할 수 있다. 또한 기체의 확산과 함께 기체가 상호 반응할 수 있는 화학적 조건 인자를 포함할 수도 있다. 가스입자는 기체와 같은 물질을 구성하는 미세한 크기의 물체, 소립자, 원자, 분자, 콜로이드 등을 통틀어 이르 는 것으로 어떤 공간에 충만한 무정형의 유체를 이룰 수 있다. 상기 가스입자정보는 상기 가스입자와 같이 특정 물질에서 확산되어 나온 휘발성의 냄새 유발 물질이 공기 중에 얼마나 포함되고 집중되어 있는 지 등을 포함할 수 있다. 사람은 후각신경을 통해 가스 중에 포함된 입자를 감지하여 냄새를 분석할 수 있고 이를 통해 주위 대 기 환경의 특징을 파악할 수 있다. 이같은 상기 가스입자정보를 획득하기 위해서 상기 환경 정보 취득부에 는 하나 이상의 후각센서(미도시)를 포함할 수 있다. 상기 후각센서를 통해서 사람이 인지할 수 있는 냄새 입자 뿐만 아니라 사람에게 유해한 가스입자 정보 등을 획득할 수 있다. 또한 상기 후각센서는 일정한 범위의 공간에 대하여 가스입자 종류와 각각의 가스입자의 분포도, 집중도, 단위 시간에 따른 변화 정보 등을 측정하여 가스입 자정보로 제공할 수 있다. 이같은 후각센서 정보는 사람이 후각신경을 통해 냄새를 감지하고 인식할 때, 최초 인식 때와는 다른 역치를 가지는 상황을 고려하여 냄새 자극에 대한 반응을 일으키는데 필요한 최소한도의 자극 의 세기를 결정하는데 검토될 수 있다. 또한 사람의 신경을 편안하게 하고 두려움과 불안을 해소시켜 활력을 찾 게 하는 향기를 제공하기 위하여 주위에 분포하는 냄새 감지 입자를 상쇄시킬 수 있는 발향조건으로 사용될 수 있다. 그리고 수면 시에는 숙면을 취할 수 있는 향기를 제공할 수 있는 발향조건으로도 포함될 수 있다. 이에 더하여, 후각센서를 통해서 인체에 유해한 가스입자정보를 검출할 수 있고 이에 대한 경고나 알람을 즉각적으로 제공할 수 있다. 추가적으로 상기 환경 정보 취득부는 상기 환경 정보에 포함되는 온도, 습도, 압력, 조도, 소음도 등의 정 보를 획득하기 위한 각각의 특정 센서 포함하여 구성될 수 있다. 이 같이 획득되는 온도, 습도, 압력, 조도, 소 음도 등은 기체 분자들의 운동에 영향을 줄 수 있는 인자 또는 사람의 감정과 신체에 영향을 줄 수 있는 인자로 구분될 수 있다. 이를 통해, 사람이 냄새를 감지하여 최상의 컨디션을 유지할 수 있도록 최적화 된 향기의 종류 와 향기 농도의 짙고 옅음 정도를 판단하여 발향할 수 있다. 상기 생체 신호 취득부는 피검체로 인식되는 사람에 대한 체온과 맥박, 혈압, 호흡, 혈당, 신체 움직임, 뇌파, 심전도, 산소 포화도 등을 포함하는 생체 신호를 획득할 수 있다. 상기 생체 신호는 사람의 신체적 생리 지표를 나타내는 항목으로 구분될 수 있고, 이를 통해 피검체로 인식되는 사람의 신체 활동 또는 생활 리듬 등 의 분석을 가능하게 할 수 있다. 상기 생체 신호를 취득하기 위해서는 상기 생체 신호 취득부에 생체 신호 로 구분되는 각각의 항목을 데이터화하여 측정할 수 있는 하나 이상의 센서(미도시)를 구비할 수 있고 또는 사 람의 손목과 팔, 머리, 다리 등 몸에 지니고 다닐 수 있는 스마트 센서를 포함한 웨어러블 기술과 연동하여 생 체 신호를 획득할 수 있다. 예를 들어, 생체 신호의 획득을 통해서 피검체로 인식되는 사람의 신체 움직임이 급 격히 줄어 들거나 미약하게 감지되고, 체온과 혈압이 감소되며, 맥박 또는 심박수가 감소되는 경우 수면 상태로판단하여 수면 상태에 최적화 된 향기를 제공할 수 있다. 또한 상기 환경 정보에 포함되는 소음도에서 코골이로 예측되는 소리를 감지하고 분석하여 수면 상태 판단 신뢰도를 향상 시킬 수 있다. 상기 저장부는 상기 환경 정보와 상기 생체 신호를 처리하여 이를 발향조건정보로 저장할 수 있다. 구체적 으로 상기 환경 정보와 상기 생체 신호를 통해 얻어지는 각각의 정보는 관계형 데이터베이스 방식으로 처리되어 저장 및 관리될 수 있으며 이를 기반으로 정보의 분석과 비교 등의 활용을 위한 통합정보인 발향조건정보 등으 로 이용될 수 있다. 상기 발향조절정보 관리부는 상기 저장부에 저장되는 발향조건정보에 기초하여 발향조건 프로세스를 매칭하고, 상기 발향조건 프로세스에 대응하는 발향조절정보를 저장 및 관리할 수 있다. 상기 발향조건 프로세 스는 상기 발향조건정보에 기초하여 구분될 수 있다. 구체적으로 상기 발향조건 프로세스는 액티브 프로세스, 패시브 프로세스, 제너럴 프로세스 등으로 구분될 수 있다. 또한 상기 발향조절정보는 상기 환경 정보와 상기 생체 신호에 따라 신체 피로도를 감소시키고 정신과 감정을 안정시킬 수 있도록 최적화된 발향 정보를 포함할 수 있다. 이와 함께 사용자가 선호하는 향기를 선택하거나 조합을 설정할 수 있고 또한, 발향정도에 대한 설정 을 지정하여 상기 발향조절정보를 관리할 수 있다. 이를 통해서는 실제 발향 시 강도를 제어할 수 있게 하여 사 용자의 정신적, 감정적 만족도를 높임과 동시에 신체 피로도를 감소시킬 수 있다. 이같은 구분에 따라 상기 발향조절정보 관리부는 액티브발향 관리부, 패시브발향 관리부, 제너 럴발향 관리부를 포함할 수 있다. 상기 액티브발향 관리부는 상기 발향조건정보가 액티브 프로세스에 매칭되는 경우, 상기 발향조건정보에 따라 상기 발향조절정보가 포함하는 방향 물질 배출 농도 또는 방향 물질 배출 세기 중 하나 이상에 대해 기설 정된 기준값과 최대값의 범위 내에서 대응하도록 매칭할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 발향조 건정보에서 기준값으로 설정한 수치 이상의 온도 또는 기준값 이하의 압력이 측정되는 기체 확산이 활발한 조건 이 만족되고 사람이 각성 상태로 판단되는 조건으로 판단 시 액티브 프로세스로 매칭될 수 있다. 또한 후각센서 를 통해 얻어지는 가스입자정보 중 가스입자 종류에 따라 일정 수치 이상의 가스입자가 분포하고 집중될 시 액 티브 프로세스로 매칭될 수 있다. 이는 상기 가스입자 종류가 악취 등으로 구분될 시 이를 상쇄하거나 악취를 억제할 수 있는 발향이 필요한 정보로 판단될 수 있다. 이와는 반대로 가스입자 종류에 따라 일정 수치 이하로 가스입자가 분포할 시에는 기체 확산이 활발한 것으로 판단되어 발향을 높게 조절하는 정보로 이용될 수 있다. 구체적인 예를 들어, 환경 정보에 포함되는 온도가 상대적으로 높게 측정되는 것은 기체 확산이 활발하여 향기 가 골고루 퍼져 금세 얕아질 수 있고 또한 온도가 상대적으로 높게 측정되는 것은 낮 시간대로 예측되고 이 때 에는 신체 활동이 활발하여 다양한 가스입자가 발생될 수 있다. 이같은 상황에서 향기의 일정 농도를 유지할 수 있도록 발향의 세기를 높이고 농도는 짙게 하는 조절을 할 수 있는 액티브 프로세스가 선택될 수 있다. 상기 패시브발향 관리부는 상기 발향조건정보가 패시브 프로세스에 매칭되는 경우, 상기 발향조건정보에 따라, 상기 발향조절정보가 포함하는 방향 물질 배출 농도 또는 방향 물질 배출 세기 중 하나 이상에 대해 기설 정된 최소값과 기준값의 범위 내에서 대응하도록 매칭할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 발향조 건정보에서 기준값으로 설정한 수치 이하의 온도 또는 기준값 이상의 압력이 측정되는 기체 확산이 정체되는 조 건이 만족되고 사람이 수면 또는 정적인 활동 상태로 판단 시 패시브 프로세스로 매칭될 수 있다. 또한 후각센 서를 통해 얻어지는 가스입자정보 중 가스입자 종류에 따라 일정 수치 이하의 가스입자가 분포하고 분산될 시 패시브 프로세스로 매칭될 수 있다. 가스입자의 수가 적고 분산되어 있는 경우는 기체 확산이 활발한 조건일 시 발생될 수도 있지만, 해당 공간에서 생활하는 사람의 수면이 이루어지는 밤 또는 새벽의 주위 환경에 따른 상태 로 구분될 수도 있다. 이 때에는 발향 정도를 상대적으로 낮추고 은은한 향기가 제공될 수 있도록 정보를 관리 할 수 있다. 구체적인 예를 들어, 환경 정보에 포함되는 온도가 상대적으로 낮게 측정되는 것은 기체 확산이 정 체되어 향기가 유지될 수 있고 또한 온도가 상대적으로 낮게 측정되는 것은 밤 시간대로 예측되고 이 때에는 신 체 활동이 정적으로 예측되고 소량의 가스입자가 발생될 수 있다. 이같은 상황에서 향기의 일정 농도를 유지할 수 있도록 발향의 세기를 낮추고 농도는 얕게 하는 조절을 할 수 있는 패시브 프로세스가 선택될 수 있다. 상기 제너럴발향 관리부는 상기 발향조건정보가 제너럴 프로세스에 매칭되는 경우, 상기 발향조건정보에 따라, 상기 발향조절정보가 포함하는 방향 물질 배출 농도 또는 방향 물질 배출 세기 중 하나 이상에 대해 기설 정된 기준값으로 발향하도록 매칭할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 발향조건정보에서 기준값을 설정한 온도 또는 압력이 측정되는 기체 확산 조건이 만족될 시 제너럴 프로세스로 매칭될 수 있다. 또한 후각 센서를 통해 얻어지는 가스입자정보 중 가스입자 종류에 따라 일정 수치에 부합하는 가스입자가 분포하고 유지 될 시 제너럴 프로세스로 매칭될 수 있다. 이 때에는 발향 정도를 기준값으로 유지하여 제공될 수 있도록 정보를 관리할 수 있다. 이같은 발향조건정보에 기초하여 매칭하는 발향조건 프로세스는 상기 환경 정보와 생체 신호가 복합적으로 분석 되어 판단될 수 있고, 또한 빅데이터와 인공지능(Artificial Intelligence), 머신러닝(Machine Learning), 딥 러닝(Deep Learning) 기술을 활용하여 검토될 수 있다. 상기 발향 처리부는 상기 발향조절정보에 따라, 하나 이상의 방향물질을 조합하여 발향을 처리할 수 있다. 또한 상기 발향 처리부는 일정 주기에 따라 상기 발향조절정보를 최신화하여 발향을 처리하는 스케줄링 발 향 처리부를 포함할 수 있다. 이를 통해서는 사람의 후각과 같이 민감한 감각기관이 향기에 쉽게 피로해져 향을 감지할 수 없는 상태에서 방향물질을 바꾸거나 방향물질의 조합을 달리하여 발향을 함으로써 다시 향기를 감지할 수 있도록 조절할 수 있다. 또한 일정 주기에 따라 발향을 달리하거나 조합을 변경하여 향에 대한 피로 도를 줄이고 방향물질의 소모를 줄일 수 있다. 추가적으로 이 같은 발향 장치의 구성을 통해서는 사용자의 수면 을 위한 임면시간 동안만 발향하고 사전에 스케줄링 된 기상시간에 맞추어 다시 발향하는 제어를 가능하게 할 수 있다. 또한 수면으로 접어들었다 판단 시 발향을 중지하고, 얕은 수면이 오래 지속될 경우에는 발향을 은은 하게 유지하는 제어도 가능할 수 있다. 상기 통신부는 상기 저장부의 발향조건정보로 저장될 수 있는 환경 정보와 생체 신호를 획득할 수 있 는 외부 장치들과의 연동을 가능하게 할 수 있다. 또한 상기 발향조건정보와 상기 발향조절정보에 대하여 추가 적인 분석을 가능하게 할 수 있는 외부 장치나 프로그램에 연동하여 관련 기술을 활용하고 그 결과값을 수신하 여 발향 관련 정보로 이용할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 발향 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 3을 참조하면, 생체 신호와 환경 정보에 기반한 발향 장치의 동작 방법에 있어서, 일정 공간의 가스입자정보 와 온도, 습도, 압력, 조도, 소음도 중 하나 이상을 포함하는 환경 정보와 함께 일정 공간에 피검체를 대상으로 사람의 체온과 맥박, 혈압, 호흡, 혈당, 신체 움직임, 뇌파, 심전도, 산소 포화도 등을 포함하는 생체 신호를 취득한다(S101). 상기 환경 정보와 생체 신호를 취득하는 단계를 통해 획득한 환경 정보와 생체 신호를 처리하 여 발향조건정보로 저장한다(S103). 그리고 상기 발향조건정보에 기초하여 발향조건 프로세스를 매칭하고, 상기 발향조건 프로세스에 대응하는 발향조절정보를 저장 및 관리한다(S105). 상기 발향조건정보에 기초하여 매칭되는 발향조건 프로세스가 액티브 프로세스인 경우, 발향조절정보가 포함하 는 방향 물질 배출 농도 또는 방향 물질 배출 세기 중 하나 이상에 대해 기설정된 기준값과 최대값의 범위 내에 서 대응하도록 매칭한다(S107). 상기 액티브 프로세스에 따라 매칭된 발향조절정보에 따라, 하나 이상의 방향물 질을 조합하여 발향을 처리한다(S109). 상기 발향조건정보에 기초하여 매칭되는 발향조건 프로세스가 패시브 프로세스인 경우, 상기 발향조절정보가 포 함하는 방향 물질 배출 농도 또는 방향 물질 배출 세기 중 하나 이상에 대해 기설정된 최소값과 기준값의 범위 내에서 대응하도록 매칭한다(S111). 상기 패시브 프로세스에 따라 매칭된 발향조절정보에 따라, 하나 이상의 방 향물질을 조합하여 발향을 처리한다(S113). 상기 발향조건정보에 기초하여 매칭되는 발향조건 프로세스가 제너럴 프로세스인 경우, 상기 발향조절정보가 포 함하는 방향 물질 배출 농도 또는 방향 물질 배출 세기 중 하나 이상에 대해 기설정된 기준값으로 발향하도록 매칭한다(S115). 상기 제너럴 프로세스에 따라 매칭된 발향조절정보에 따라, 하나 이상의 방향물질을 조합하여 발향을 처리한다(S117). 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에"}
{"patent_id": "10-2020-0089401", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형 실시들은 본 발명의 기 술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2020-0089401", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 발향 장치의 구성을 설명하기 위한 블록도이다. 도 2는 본 발명의 일 실시 예에 따른 발향 장치의 일부 구성인 발향조절정보 관리부를 보다 구체적으로 설명하 기 위한 블록도이다. 도 3은 본 발명의 일 실시 예에 따른 발향 장치의 동작 방법을 설명하기 위한 흐름도이다."}
