{"patent_id": "10-2021-0166360", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0079537", "출원번호": "10-2021-0166360", "발명의 명칭": "비대면 체형 분석 서비스 제공 시스템 및 방법", "출원인": "이창호", "발명자": "이창호"}}
{"patent_id": "10-2021-0166360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말, 그리고사용자 단말로부터 제1 체형 정보를 수신하고, 미리 저장된 알고리즘을 이용하여, 상기 제1 체형 정보를 바탕으로 제1 체형 분석 결과를 생성하고, 상기 사용자 단말에게 상기 제1 체형 분석 결과를 송신하는 서비스 제공 서버를 포함하는 체형 분석 서비스 제공 시스템."}
{"patent_id": "10-2021-0166360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 제1 체형 정보는 사용자 신체 전면을 포함하는 전면 촬영 이미지, 사용자 신체 측면을 포함하는 측면 촬영이미지, 사용자 신체 후면을 포함하는 후면 촬영 이미지, 특정 종류의 운동 동작을 포함하는 동영상 촬영 이미지를 포함하는, 체형 분석 서비스 제공 시스템."}
{"patent_id": "10-2021-0166360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서,상기 제1 체형 분석 결과는 목, 등, 어깨, 골반의 체형 불균형 정보를 포함하는, 체형 분석 서비스 제공시스템."}
{"patent_id": "10-2021-0166360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "서비스 제공 서버가 체형 분석 서비스를 제공하는 방법으로서,사용자 단말로부터 제1 체형 정보를 수신하는 단계, 미리 저장된 알고리즘을 이용하여, 상기 체형 정보를 바탕으로 제1 체형 분석 결과를 생성하는 단계, 그리고상기 사용자 단말에게 상기 제1 체형 분석 결과를 송신하는 단계를 포함하는 체형 분석 서비스 제공 방법."}
{"patent_id": "10-2021-0166360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에서,상기 제1 체형 정보는 사용자 신체 전면을 포함하는 전면 촬영 이미지, 사용자 신체 측면을 포함하는 측면 촬영이미지, 사용자 신체 후면을 포함하는 후면 촬영 이미지, 특정 종류의 운동 동작을 포함하는 동영상 촬영 이미지를 포함하는, 체형 분석 서비스 제공 방법."}
{"patent_id": "10-2021-0166360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에서,상기 제1 체형 분석 결과는 목, 등, 어깨, 골반의 체형 불균형 정보를 포함하는, 체형 분석 서비스 제공 방법."}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사용자 단말, 그리고 사용자 단말로부터 제1 체형 정보를 수신하고, 미리 저장된 알고리즘을 이용하여, 상기 제1 체형 정보를 바탕으로 제1 체형 분석 결과를 생성하고, 상기 사용자 단말에게 상기 제1 체형 분석 결과를 송신하 는 서비스 제공 서버를 포함하는 체형 분석 서비스 제공 시스템이 제공된다."}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 체형 분석 서비스 제공 시스템 및 방법에 관한 것으로, 특히 스마트폰을 이용하여 비대면으로 사용자 의 체형을 분석할 수 있는 체형 분석 서비스 제공 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래에는 사용자가 체형 교정 센터를 방문하여 비용을 지불하고 체형 분석을 받아야 했다. 체형 교정 센터에서 는 몸에 점 스티커(어깨, 무릎, 골반, 발목)을 붙여 측정해야하므로, 탈착이 불편한 문제점이 있었고 고가의 장 비를 활용해야하는 어려움이 있었다. 종래에는 고객이 입력한 체형 설문 데이터에만 의존하여 분석 결과를 도출함으로써, 실제 동작시 어떤 문제점을 갖고 있는지, 각 근육과 관절 간의 이동 관계를 명확하게 파악할 수 없는 문제점이 있었다. 이에 따라, 전면, 측면, 후면 외에 특정 운동 동작의 영상을 이용하여 정확도 높은 체형 불균형 분석 결과를 도 출할 수 있는 기술이 요구된다."}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적 과제는 전면, 측면, 후면 외에 특정 운동 동작의 영상을 이용하여 정확도 높은 체형 불균형 분석 결과를 도출할 수 있는 비대면 체형 분석 서비스 제공 시스템 및 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "한 실시예에 따르면, 체형 분석 서비스 제공 시스템이 제공된다. 상기 체형 분석 서비스 제공 시스템은 사용자 단말, 그리고 사용자 단말로부터 제1 체형 정보를 수신하고, 미리 저장된 알고리즘을 이용하여, 상기 제1 체형 정보를 바탕으로 제1 체형 분석 결과를 생성하고, 상기 사용자 단말에게 상기 제1 체형 분석 결과를 송신하는 서비스 제공 서버를 포함한다. 상기 제1 체형 정보는 사용자 신체 전면을 포함하는 전면 촬영 이미지, 사용자 신체 측면을 포함하는 측면 촬영 이미지, 사용자 신체 후면을 포함하는 후면 촬영 이미지, 특정 종류의 운동 동작을 포함하는 동영상 촬영 이미 지를 포함할 수 있다. 상기 제1 체형 분석 결과는 목, 등, 어깨, 골반의 체형 불균형 정보를 포함할 수 있다. 한 실시예에 따르면, 서비스 제공 서버가 체형 분석 서비스를 제공하는 방법이 제공된다. 상기 체형 분석 서비 스 제공 방법은 사용자 단말로부터 제1 체형 정보를 수신하는 단계, 미리 저장된 알고리즘을 이용하여, 상기 체 형 정보를 바탕으로 제1 체형 분석 결과를 생성하는 단계, 그리고 상기 사용자 단말에게 상기 제1 체형 분석 결 과를 송신하는 단계를 포함한다. 상기 제1 체형 정보는 사용자 신체 전면을 포함하는 전면 촬영 이미지, 사용자 신체 측면을 포함하는 측면 촬영 이미지, 사용자 신체 후면을 포함하는 후면 촬영 이미지, 특정 종류의 운동 동작을 포함하는 동영상 촬영 이미 지를 포함할 수 있다. 상기 제1 체형 분석 결과는 목, 등, 어깨, 골반의 체형 불균형 정보를 포함할 수 있다."}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전면, 측면, 후면 외에 특정 운동 동작의 영상을 이용하여 정확도 높은 체형 불균형 분석 결과를 도출할 수 있 고, 스마트폰을 이용하여 손쉽게 체형 불균형 여부를 판단할 수 있다. 체형 불균형 분석 결과를 바탕으로, 전문가의 맞춤형 운동 목록 및 운동 방법 정보를 제공할 수 있다."}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성 요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 발명의 실시 예에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 실시 예들의 설 명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 실시 예들에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 실시 예들의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 발명의 실시 예에서, 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이 라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한 다. 또한, 본 발명의 실시 예에서, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 또한, 본 발명의 실시 예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동 작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이 나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 또한, 본 발명의 실시 예에서, '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소 프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의'모듈' 혹은 복수의'부'는 특정한 하드웨어로 구현될 필요가 있는 '모듈' 혹은 '부'를 제외하고는 적어도 하나의 모듈로 일 체화되어 적어도 하나의 프로세서로 구현될 수 있다. 도 1은 한 실시예에 따른 체형 분석 서비스 제공 시스템의 블록도이다. 도 2 내지 도 8은 한 실시예에 따른 체형 분석 서비스 제공 시스템의 서비스 제공 서버의 동작 내용을 설명하기 위한 도면이다. 도 9는 한 실시예에 따른 체형 분석 서비스 제공 시스템의 서비스 제공 서버의 블록도이다. 도 1을 참조하면, 한 실시예에 따른 체형 분석 서비스 제공 시스템은 사용자 단말, 서비스 제공 서버 , 전문가 단말을 포함한다. 사용자 단말은 한 실시예로서, 앱(APP) 또는 웹(WEB)을 통해 서비스 제공 서버와 데이터를 송수신할 수 있다. 사용자 단말은 한 실시예로서, 이동 통신 단말기, 데스크톱 컴퓨터, 노트북 컴퓨터, 워크스테이션, 팜톱 (palmtop) 컴퓨터, 개인 휴대 정보 단말기(Personal Digital Assistant, PDA), 웹 패드 등과 같이 메모리 수단 을 구비하고 마이크로 프로세서를 탑재하여 연산 능력을 갖춘 디지털 기기일 수 있다. 도 2를 참조하면, 서비스 제공 서버는 한 실시예로서, 사용자 단말로부터 체형 분석 서비스를 요청하 는 메시지를 수신하면, 사용자 단말의 화면 상에 제1 체형 정보를 요청하는 메시지를 송신할 수 있다. 사용자는 사용자 단말의 화면 상의 안내 메시지에 기반하여 제1 체형 정보를 입력할 수 있다. 도 3을 참조하면, 제1 체형 정보는 한 실시예로서, 사용자 신체 전면을 포함하는 전면 촬영 이미지, 사용자 신 체 측면을 포함하는 측면 촬영 이미지, 사용자 신체 후면을 포함하는 후면 촬영 이미지를 포함할 수 있다. 도 4 및 도 5를 참조하면, 제1 체형 정보는 한 실시예로서, 특정 종류(예, 스쿼트)의 운동 동작을 포함하는 동 영상 촬영 이미지를 포함할 수 있다. 전신, 측면, 후면 외에 스쿼트 후면 영상 이미지에 포함되는 머리와 목의 각도, 무릎의 벌어짐 정도를 통해 체 형 불균형 여부(예, 거북목, 굽은등, 라운드 숄더)를 정밀하게 판단할 수 있다. 서비스 제공 서버는 한 실시예로서, 사용자 단말로부터 제1 체형 정보를 수신하고, 제1 체형 정보를 입력 변수로 하는 미리 저장된 인공지능 알고리즘을 이용하여, 제1 체형 정보를 바탕으로 제1 체형 분석 결과를 생성할 수 있다. 제2 체형 분석 결과는 한 실시예로서, 목, 등, 어깨, 골반의 체형 불균형 정보를 포함할 수 있다. 체형 불균형 정보는 한 실시예로서, 목, 등, 어깨, 골반의 좌 또는 우로 틀어진 각도 정보를 포함할 수 있다. 미리 저장된 인공지능 알고리즘은 한 실시예로서, 머신 러닝(Machine Learning) 학습 알고리즘 또는 딥러닝 (Deep Learning) 학습 알고리즘일 수 있다. 도 6을 참조하면, 서비스 제공 서버는 한 실시예로서, 사용자 단말에게 제1 체형 분석 결과를 송신할 수 있다. 서비스 제공 서버는 한 실시예로서, 사용자 단말로부터 전문가 분석을 요청하는 메시지를 수신하면, 사용자 단말에게 제2 체형 정보를 요청하는 메시지를 송신할 수 있다. 제2 체형 정보는 한 실시예로서, 수술 이력 정보, 신체 질환 정보를 포함할 수 있다. 사용자는 사용자 단말의 화면 상의 안내 메시지에 기반하여 제2 체형 정보를 입력할 수 있다. 서비스 제공 서버는 한 실시예로서, 사용자 단말로부터 제2 체형 정보를 수신하면, 전문가 단말(30 0)에게 제1 체형 정보, 제2 체형 정보, 및 제1 체형 분석 결과를 송신할 수 있다. 전문가 단말은 트레이너로부터 피드백 정보를 제공받을 수 있다. 피드백 정보는 한 실시예로서, 제2 체형 분석 결과, 및 제2 체형 분석 결과에 대응하는 운동 목록(운동 루틴) 및 운동 방법 정보를 포함할 수 있다. 제2 체형 분석 결과는 트레이너가 입력한 해당 사용자의 목, 등, 어깨, 골반의 체형 불균형 정보 및 소견서 정 보를 포함할 수 있다. 서비스 제공 서버는 한 실시예로서, 전문가 단말로부터 피드백 정보를 수신할 수 있다. 도 7 및 도 8을 참조하면, 서비스 제공 서버는 한 실시예로서, 사용자 단말에게 피드백 정보를 송신 할 수 있다. 서비스 제공 서버는 한 실시예로서, 사용자 단말로부터 수신하는 운동 인증 업로드 정보에 기반하여, 미리 저장된 알고리즘을 이용하여 미리 설정된 기간 동안 미리 설정된 운동 횟수를 만족하는 지 여부를 판단할 수 있다. 예를 들어, 서비스 제공 서버는 사용자 단말로부터 수신하는 운동 인증 업로드 정보에 기반 하여, 사용자가 3주 기간 동안 주6회의 운동 횟수를 만족하는 지 여부를 판단할 수 있다. 서비스 제공 서버는 한 실시예로서, 미리 설정된 기간 동안 미리 설정된 운동 횟수를 만족하는 것으로 판 단되면, 사용자 단말에게 환급 금액 정보를 송신할 수 있다. 서비스 제공 서버는 한 실시예로서, 사용자 단말로부터 환급을 요청하는 메시지를 수신하면, 외부 은 행 서버에게 이체를 요청하는 메시지를 송신할 수 있다. 도 9를 참조하면, 서비스 제공 서버는 한 실시예로서, 통신부, 인공지능 분석부, 화면 설정부 , 정산부, 저장부, 제어부를 포함할 수 있다. 통신부는 한 실시예로서, 유무선 통신을 이용하여 사용자 단말 및 전문가 단말과 데이터를 송수 신하는 통신 모듈을 포함할 수 있다. 인공지능 분석부는 한 실시예로서, 미리 저장된 인공지능 알고리즘을 이용하여, 제1 체형 정보에 기반하여 사용자의 얼굴, 어깨, 손목, 팔꿈치, 허리, 골반, 무릎, 및 발뒷꿈치의 위치를 산출할 수 있다.인공지능 분석부는 한 실시예로서, 미리 저장된 인공지능 알고리즘을 이용하여, 제1 체형 정보에 기반하여 사용자의 어깨 사이의 각도, 골반 사이의 각도를 산출할 수 있다. 인공지능 분석부는 한 실시예로서, 제1 체형 정보를 입력 변수로 하는 미리 저장된 인공지능 알고리즘을 이용하여, 제1 체형 정보를 바탕으로 제1 체형 분석 결과를 생성할 수 있다. 인공지능 분석부는 한 실시예로서, 제1 체형 정보 중 특정 종류(예, 스쿼트)의 운동 동작을 포함하는 동영 상 촬영 이미지를 입력 변수로 하는 미리 저장된 인공지능 알고리즘을 이용하여, 얼굴, 어깨, 손목, 팔꿈치, 허 리, 골반, 무릎, 발뒷꿈치의 위치를 추출할 수 있다. 인공지능 분석부는 한 실시예로서, 제1 체형 정보 중 특정 종류(예, 스쿼트)의 운동 동작을 포함하는 동영 상 촬영 이미지를 입력 변수로 하는 미리 저장된 인공지능 알고리즘을 이용하여, 왼발 또는 오른발의 불균형 여 부를 판단할 수 있다. 구체적으로, 인공지능 분석부는 한 실시예로서, 사용자의 정면 방향의 가상의 선과 복숭아뼈와 발뒷꿈치를 연결하는 가상의 선이 이루는 각도와 표 1의 미리 저장된 맵데이터를 비교한 결과에 기 반하여 왼발 또는 오른발의 불균형 여부를 판단할 수 있다. 표 1"}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "인공지능 분석부는 한 실시예로서, 제1 체형 정보 중 측면 촬영 이미지를 입력 변수로 하는 미리 저장된 인공지능 알고리즘을 이용하여, 골반의 불균형 여부를 판단할 수 있다. 구체적으로, 인공지능 분석부는 한 실시예로서, 척추와 골반 끝이 이루는 각도와 표 2의 미리 저장된 맵데이터를 비교한 결과에 기반하여 골반의 불균형 여부를 판단할 수 있다. 표 2"}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "인공지능 분석부는 한 실시예로서, 제1 체형 정보 중 특정 종류(예, 스쿼트)의 운동 동작을 포함하는 동영 상 촬영 이미지를 입력 변수로 하는 미리 저장된 인공지능 알고리즘을 이용하여, 골반의 불균형 여부를 판단할 수 있다. 구체적으로, 인공지능 분석부는 한 실시예로서, 수평선과 골반 평행선이 이루는 각도와 표 3의 미리 저장된 맵데이터를 비교한 결과에 기반하여 골반의 불균형 여부를 판단할 수 있다. 표 3"}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "인공지능 분석부는 한 실시예로서, 제1 체형 정보 중 정면 촬영 이미지를 입력 변수로 하는 미리 저장된 인공지능 알고리즘을 이용하여, 어깨의 좌우 불균형 여부를 판단할 수 있다. 구체적으로, 인공지능 분석부(22 0)는 한 실시예로서, 수평선과 어깨 평행선이 이루는 각도와 표 4의 미리 저장된 맵데이터를 비교한 결과에 기 반하여 어깨 좌우의 불균형 여부를 판단할 수 있다. 표 4"}
{"patent_id": "10-2021-0166360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "화면 설정부는 한 실시예로서, 사용자 단말의 화면 상에 제1 체형 정보 또는 제2 체형 정보를 입력하 는 창을 디스플레이할 수 있다. 화면 설정부는 한 실시예로서, 사용자 단말의 카메라 기능이 실행되면 사용자 단말의 화면 상에 중앙선을 점선으로 표시할 수 있다. 이를 통해, 사용자가 화면의 중앙에 위치하여 촬영하도록 유도함으로써, 정 확도 높은 제1 체형 정보의 생성이 가능하다. 정산부는 한 실시예로서, 사용자 단말로부터 수신하는 운동 인증 업로드 정보에 기반하여, 미리 저장 된 알고리즘을 이용하여 미리 설정된 기간(예, 3주) 동안 미리 설정된 운동 횟수(예, 주6회)를 만족하는 지 여 부를 판단할 수 있다. 정산부는 한 실시예로서, 미리 설정된 기간 동안 미리 설정된 운동 횟수를 만족하는 것으로 판단되면, 통 신부를 통해 사용자 단말에게 환급 금액 정보를 송신할 수 있다. 정산부는 한 실시예로서, 사용자 단말로부터 환급을 요청하는 메시지를 수신하면, 통신부를 통 해 외부 은행 서버에게 이체를 요청하는 메시지를 송신할 수 있다. 저장부는 한 실시예로서, 인공지능 알고리즘, 맵데이터, 제1 체형 정보, 제2 체형 정보, 제1 체형 분석 결 과, 제2 체형 분석 결과를 저장할 수 있다. 제어부는 관리자로부터 수신하는 제어 명령에 기반하여 통신부, 인공지능 분석부, 화면 설정부 , 정산부, 저장부의 동작을 제어할 수 있다. 전문가 단말은 한 실시예로서, 앱(APP) 또는 웹(WEB)을 통해 서비스 제공 서버와 데이터를 송수신할 수 있다. 전문가 단말은 한 실시예로서, 트레이너로부터 피드백 정보를 제공받을 수 있다. 전문가 단말은 한 실시예로서, 이동 통신 단말기, 데스크톱 컴퓨터, 노트북 컴퓨터, 워크스테이션, 팜톱 (palmtop) 컴퓨터, 개인 휴대 정보 단말기(Personal Digital Assistant, PDA), 웹 패드 등과 같이 메모리 수단 을 구비하고 마이크로 프로세서를 탑재하여 연산 능력을 갖춘 디지털 기기일 수 있다. 도 10 및 도 11은 한 실시예에 따른 체형 분석 서비스 제공 방법의 흐름도이다. 도 10 및 도 11을 참조하면, 한 실시예에 따른 체형 분석 서비스 제공 방법은 사용자 단말로부터 제1 체형 정보를 수신하는 단계(S100), 미리 저장된 알고리즘을 이용하여, 체형 정보를 바탕으로 제1 체형 분석 결과를 생성하는 단계(S200), 사용자 단말에게 제1 체형 분석 결과를 송신하는 단계(S300), 사용자 단말로부 터 전문가 분석을 요청하는 메시지를 수신하면, 사용자 단말에게 제2 체형 정보를 요청하는 메시지를 송신 하는 단계(S400), 사용자 단말로부터 제2 체형 정보를 수신하면, 전문가 단말에게 제1 체형 정보, 제 2 체형 정보, 및 제1 체형 분석 결과를 송신하는 단계(S500), 전문가 단말로부터 피드백 정보를 수신하는 단계(S600), 피드백 정보를 사용자 단말에게 송신하는 단계(S700)를 포함할 수 있다. 단계 S100 내지 단계 S700은 위에서 설명한 서비스 제공 서버의 동작 내용과 동일하므로, 상세한 설명은 생략한다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다. 본 실시 예와 관련된 기술 분야에서 통상의 지식을 가진 자는 상기된 기재의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시 방법들은 한정적인 관점이 아 니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으 며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0166360", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 한 실시예에 따른 체형 분석 서비스 제공 시스템의 블록도이다. 도 2 내지 도 8은 한 실시예에 따른 체형 분석 서비스 제공 시스템의 서비스 제공 서버의 동작 내용을 설명하기 위한 도면이다. 도 9는 한 실시예에 따른 체형 분석 서비스 제공 시스템의 서비스 제공 서버의 블록도이다. 도 10 및 도 11은 한 실시예에 따른 체형 분석 서비스 제공 방법의 흐름도이다."}
