{"patent_id": "10-2018-0167515", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0078018", "출원번호": "10-2018-0167515", "발명의 명칭": "전자 장치 및 이의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "이재철"}}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,스피커;마이크; 및입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하고, 상기 스피커의 출력 레벨에 기초하여상기 주파수 대역의 크기가 조정된 오디오 신호의 크기에 대한 조정 여부를 결정하고, 상기 조정 여부에 기초하여 처리된 오디오 신호를 상기 스피커를 통해 출력하는 오디오 프로세서;를 포함하며,상기 오디오 프로세서는,상기 출력된 오디오 신호를 포함하는 사운드 신호가 상기 마이크를 통해 수신되면, 상기 조정 여부에 기초하여상기 입력된 오디오 신호 또는 상기 크기가 조정된 오디오 신호를 이용하여 상기 사운드 신호에 대한 음향 반향제거(Acoustic Echo Cancellation, AEC)를 수행하는, 전자 장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 오디오 프로세서는,상기 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하기 위한 이퀄라이저;상기 스피커의 출력 레벨에 기초하여 상기 이퀄라이저에서 출력되는 오디오 신호의 크기를 조정하기 위한 다이나믹 레인지 컨트롤러; 및상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호를 증폭하기 위한 음향 증폭부;를 포함하는, 전자 장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 오디오 프로세서는,상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신호의 크기에 대한 조정 여부에기초하여 상기 이퀄라이저에 입력되는 오디오 신호 또는 상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오신호를 이용하여 상기 음향 반향 제거를 수행하는, 전자 장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 오디오 프로세서는,상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신호의 크기가 조정되지 않은 경우, 상기 이퀄라이저에 입력되는 오디오 신호에 기초하여 상기 음향 반향 제거를 수행하는, 전자 장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 오디오 프로세서는,상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신호의 크기가 조정된 경우, 상기공개특허 10-2020-0078018-3-다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에 기초하여 상기 음향 반향 제거를 수행하는, 전자 장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 오디오 프로세서는,상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 상기 기설정된 주파수 대역의 신호의 크기를 상기 이퀄라이저와 반대로 조정하고, 상기 조정된 오디오 신호에 기초하여 상기 음향 반향 제거를 수행하는, 전자장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 음향 반향이 제거된 사운드 신호는, 음성 인식에 이용되는, 전자 장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 기설정된 주파수 대역은, 상기 스피커의 특성에 따라 기설정된 주파수 대역인, 전자 장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 입력된 오디오 신호에서 설정된 주파수 대역의 신호의 크기를 조정하는 것은, 상기 스피커로 출력되는 오디오 신호와 상기 입력된 오디오 신호와의 차이를 보상해주도록 상기 스피커의 특성에 기초하여 조정하는 것인,전자 장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "마이크 및 스피커를 포함하는 전자 장치의 제어 방법에 있어서,입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하는 단계; 상기 스피커의 출력 레벨에 기초하여 상기 주파수 대역의 크기가 조정된 오디오 신호의 크기에 대한 조정 여부를 결정하고, 상기 조정 여부에 기초하여 처리된 오디오 신호를 상기 스피커를 통해 출력하는 단계; 및상기 출력된 오디오 신호를 포함하는 사운드 신호가 상기 마이크를 통해 수신되면, 상기 조정 여부에 기초하여상기 입력된 오디오 신호 또는 상기 크기가 조정된 오디오 신호를 이용하여 상기 사운드 신호에 대한 음향 반향제거(Acoustic Echo Cancellation, AEC)를 수행하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 조정하는 단계는,이퀄라이저를 이용하여 상기 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하고,상기 출력하는 단계는, 다이나믹 레인지 컨트롤러를 이용하여 상기 스피커의 출력 레벨에 기초하여 상기 이퀄라이저에서 출력되는 오디오 신호의 크기를 조정하며, 상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호를 증폭하여 상기 스피커를 통해 출력하는, 제어 방법."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 출력하는 단계는,공개특허 10-2020-0078018-4-상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신호의 크기에 대한 조정 여부에기초하여 상기 이퀄라이저에 입력되는 오디오 신호 또는 상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오신호를 이용하여 상기 음향 반향 제거를 수행하는, 제어 방법."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 수행하는 단계는,상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신호의 크기가 조정되지 않은 경우, 상기 이퀄라이저에 입력되는 오디오 신호에 기초하여 상기 음향 반향 제거를 수행하는, 전자 장치."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 수행하는 단계는,상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신호의 크기가 조정된 경우, 상기다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에 기초하여 상기 음향 반향 제거를 수행하는, 제어 방법."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 수행하는 단계는,상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 상기 기설정된 주파수 대역의 신호의 크기를 상기 이퀄라이저와 반대로 조정하고, 상기 조정된 오디오 신호에 기초하여 상기 음향 반향 제거를 수행하는, 제어방법."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서,상기 음향 반향이 제거된 사운드 신호는, 음성 인식에 이용되는, 제어 방법."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서, 상기 기설정된 주파수 대역은, 상기 스피커의 특성에 따라 기설정된 주파수 대역인, 제어 방법."}
{"patent_id": "10-2018-0167515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10항에 있어서,상기 입력된 오디오 신호에서 설정된 주파수 대역의 신호의 크기를 조정하는 것은, 상기 스피커로 출력되는 오디오 신호와 상기 입력된 오디오 신호와의 차이를 보상해주도록 상기 스피커의 특성에 기초하여 조정하는 것인,제어 방법."}
{"patent_id": "10-2018-0167515", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치 및 이의 제어 방법이 제공된다. 본 전자 장치는 스피커, 마이크 및 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하고, 스피커의 출력 레벨에 기초하여 주파수 대역의 크기가 조정된 오디오 신 호의 크기에 대한 조정 여부를 결정하고, 조정 여부에 기초하여 처리된 오디오 신호를 스피커를 통해 출력하는 오디오 프로세서를 포함하며, 오디오 프로세서는 출력된 오디오 신호를 포함하는 사운드 신호가 마이크를 통해 수신되면, 조정 여부에 기초하여 입력된 오디오 신호 또는 상기 크기가 조정된 오디오 신호를 이용하여 사운드 신호에 대한 음향 반향 제거를 수행한다."}
{"patent_id": "10-2018-0167515", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 이의 제어 방법에 관한 것으로, 더욱 상세하게는 음향 반향을 제거하는 전자 장치 및 이의 제어 방법에 관한 것이다."}
{"patent_id": "10-2018-0167515", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 기술의 발전으로, 근래에는 전자 장치는 사용자 음성을 입력받고, 사용자 음성에 대한 응답을 제공하고 있 다. 예를 들어, 날씨를 문의하는 사용자 음성에 대해, 전자 장치는 현재 날씨에 대한 정보를 사용자에게 제공할 수 있다. 한편, 스피커가 내장된 전자 장치의 경우, 음성 인식률을 향상시키기 위해, 스피커에서 출력하는 오디오 신호를 마이크에 입력된 오디오 신호와 비교하여 음향 반향 제거(acoustic echo cancellation, AEC)를 수행하고 있다. 다만, 기존의 시스템에서는 최적의 음향 반향 제거를 하지 못하고 있고, 이에 따라, 전자 장치에서 출력되는 오 디오 신호에 의해 사용자 음성에 대한 음성 인식률이 저하되는 문제점이 존재하였다."}
{"patent_id": "10-2018-0167515", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 문제점을 해결하기 위해 안출된 것으로, 본 개시의 목적은 전자 장치의 동작 여부에 따라 특 정한 오디오 신호를 이용하여 마이크를 통해 수신된 오디오 신호에 대해 음향 반향 제거를 수행하는 전자 장치 및 이의 제어 방법을 제공함에 있다."}
{"patent_id": "10-2018-0167515", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 전자 장치는 스피커, 마이크 및 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하고, 상기 스피커의 출력 레벨에 기초하여 상기 주파수 대역의 크기가 조정된 오디오 신호 의 크기에 대한 조정 여부를 결정하고, 상기 조정 여부에 기초하여 처리된 오디오 신호를 상기 스피커를 통해 출력하는 오디오 프로세서를 포함하며, 상기 오디오 프로세서는 상기 출력된 오디오 신호를 포함하는 사운드 신 호가 상기 마이크를 통해 수신되면, 상기 조정 여부에 기초하여 상기 입력된 오디오 신호 또는 상기 크기가 조 정된 오디오 신호를 이용하여 상기 사운드 신호에 대한 음향 반향 제거(Acoustic Echo Cancellation, AEC)를 수 행할 수 있다. 이 경우, 상기 오디오 프로세서는 상기 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하 기 위한 이퀄라이저, 상기 스피커의 출력 레벨에 기초하여 상기 이퀄라이저에서 출력되는 오디오 신호의 크기를 조정하기 위한 다이나믹 레인지 컨트롤러 및 상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호를 증폭 하기 위한 음향 증폭부를 포함할 수 있다. 또한, 상기 오디오 프로세서는 상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신 호의 크기에 대한 조정 여부에 기초하여 상기 이퀄라이저에 입력되는 오디오 신호 또는 상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호를 이용하여 상기 음향 반향 제거를 수행할 수 있다. 그리고, 상기 오디오 프로세서는 상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신호의 크기가 조정되지 않은 경우, 상기 이퀄라이저에 입력되는 오디오 신호에 기초하여 상기 음향 반향 제거 를 수행할 수 있다. 한편, 상기 오디오 프로세서는 상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신 호의 크기가 조정된 경우, 상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에 기초하여 상기 음향 반 향 제거를 수행할 수 있다. 이 경우, 상기 오디오 프로세서는 상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 상기 기설정된 주파수 대역의 신호의 크기를 상기 이퀄라이저와 반대로 조정하고, 상기 조정된 오디오 신호에 기초하여 상기 음향 반향 제거를 수행할 수 있다. 한편, 상기 음향 반향이 제거된 사운드 신호는 음성 인식에 이용될 수 있다. 한편, 상기 기설정된 주파수 대역은 상기 스피커의 특성에 따라 기설정된 주파수 대역일 수 있다. 한편, 상기 입력된 오디오 신호에서 설정된 주파수 대역의 신호의 크기를 조정하는 것은, 상기 스피커로 출력되 는 오디오 신호와 상기 입력된 오디오 신호와의 차이를 보상해주도록 상기 스피커의 특성에 기초하여 조정하는 것일 수 있다. 한편, 본 개시의 일 실시 예에 따른 마이크 및 스피커를 포함하는 전자 장치의 제어 방법은 입력된 오디오 신호 에서 기설정된 주파수 대역의 신호의 크기를 조정하는 단계, 상기 스피커의 출력 레벨에 기초하여 상기 주파수대역의 크기가 조정된 오디오 신호의 크기에 대한 조정 여부를 결정하고, 상기 조정 여부에 기초하여 처리된 오 디오 신호를 상기 스피커를 통해 출력하는 단계 및 상기 출력된 오디오 신호를 포함하는 사운드 신호가 상기 마 이크를 통해 수신되면, 상기 조정 여부에 기초하여 상기 입력된 오디오 신호 또는 상기 크기가 조정된 오디오 신호를 이용하여 상기 사운드 신호에 대한 음향 반향 제거(Acoustic Echo Cancellation, AEC)를 수행하는 단계 를 포함한다. 이 경우, 상기 조정하는 단계는 이퀄라이저를 이용하여 상기 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하고, 상기 출력하는 단계는 다이나믹 레인지 컨트롤러를 이용하여 상기 스피커의 출력 레벨 에 기초하여 상기 이퀄라이저에서 출력되는 오디오 신호의 크기를 조정하며, 상기 다이나믹 레인지 컨트롤러에 서 출력되는 오디오 신호를 증폭하여 상기 스피커를 통해 출력할 수 있다. 또한, 상기 출력하는 단계는 상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신호 의 크기에 대한 조정 여부에 기초하여 상기 이퀄라이저에 입력되는 오디오 신호 또는 상기 다이나믹 레인지 컨 트롤러에서 출력되는 오디오 신호를 이용하여 상기 음향 반향 제거를 수행할 수 있다. 그리고, 상기 수행하는 단계는 상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신 호의 크기가 조정되지 않은 경우, 상기 이퀄라이저에 입력되는 오디오 신호에 기초하여 상기 음향 반향 제거를 수행할 수 있다. 한편, 상기 수행하는 단계는 상기 다이나믹 레인지 컨트롤러에 의해 상기 이퀄라이저에서 출력되는 오디오 신호 의 크기가 조정된 경우, 상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에 기초하여 상기 음향 반향 제거를 수행할 수 있다. 이 경우, 상기 수행하는 단계는 상기 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 상기 기설정된 주파수 대역의 신호의 크기를 상기 이퀄라이저와 반대로 조정하고, 상기 조정된 오디오 신호에 기초하여 상기 음향 반향 제거를 수행할 수 있다. 한편, 상기 음향 반향이 제거된 사운드 신호는 음성 인식에 이용될 수 있다. 한편, 상기 기설정된 주파수 대역은 상기 스피커의 특성에 따라 기설정된 주파수 대역일 수 있다. 한편, 상기 입력된 오디오 신호에서 설정된 주파수 대역의 신호의 크기를 조정하는 것은, 상기 스피커로 출력되 는 오디오 신호와 상기 입력된 오디오 신호와의 차이를 보상해주도록 상기 스피커의 특성에 기초하여 조정하는 것일 수 있다."}
{"patent_id": "10-2018-0167515", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시 예에 따르면, 효과적으로 음향 반향 제거를 수행할 수 있게 된다."}
{"patent_id": "10-2018-0167515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 개시에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 개시의 실시 예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 개시에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 개시에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 개시에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 어떤 구성요소와 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 개시에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 이하에서는 도면을 참조하여 본 발명에 대해 상세히 설명하기로 한다. 도 1은 본 개시의 일 실시 예에 따른 인공지능 에이전트 시스템의 사용도를 나타낸다. 인공지능 에이전트 시스템은 도 1에 도시된 바와 같이, 전자 장치 및 응답 제공 서버를 포함할 수 있다. 한편, 도 1에서 전자 장치는 텔레비전인 것으로 도시하였으나, 이는 일 예에 불과하다. 본 개시의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 웨어러블 장 치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head- mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는, 예를 들면, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스, 게임 콘솔, 전자 사전, 전자 키, 캠코 더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼 트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기,차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토 스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 이와 같이, 본 개시의 다양한 실시 예에 따른 전자 장치는 다양한 타입의 전자 장치로 구현될 수 있다. 한편, 전자 장치는 인공지능 에이전트 프로그램을 이용하여 사용자 음성에 대한 응답을 사용자에게 제공할 수 있다. 이때, 전자 장치는 사용자 음성을 입력받기 이전에 인공지능 에이전트 프로그램을 활성화하기 위한 트리거 단어를 포함하는 사용자 음성을 입력받을 수 있다. 예를 들어, 전자 장치는 \"빅스비\"와 같은 트리거 단어 를 포함하는 사용자 음성을 입력받을 수 있다. 트리거 단어를 포함하는 사용자 음성이 입력되면, 전자 장치 는 인공지능 에이전트 프로그램을 실행 또는 활성화시키고, 사용자 음성의 입력을 대기할 수 있다. 인공지 능 에이전트 프로그램은 사용자 음성 및 응답을 자연어로 처리할 수 있는 대화 시스템을 포함할 수 있다. 이때, 인공지능 에이전트 프로그램을 활성화하기 위한 트리거 단어 이외에, 전자 장치에 구비된 특정 버튼을 선 택한 후, 사용자 음성을 입력받을 수도 있다. 이후, 전자 장치는 사용자 음성을 입력받을 수 있다. 예를 들어, 도 1과 같이, 전자 장치는 \"오늘 날 씨는 어때\"라는 사용자 음성을 입력받을 수 있다. 이때, 전자 장치는 \"오늘 날씨는 어때\"로부터 \"오늘\", \"날씨\" 등과 같은 키워드를 결정하고, 키워드를 응답 제공 서버로 제공할 수 있다. 응답 제공 서버는 전자 장치로부터 수신한 키워드에 기초하여 사용자 음성에 대한 응답을 제공할 수 있다. 예를 들어, 응답 제공 서버는 \"기온 22℃\"라는 응답을 전자 장치로 제공할 수 있다. 이 경우, 응답 제공 서버는 텍스트를 포함하는 응답을 제공할 수 있으나, 이는 일 예일 뿐이고 자연어 형태의 응답을 제공할 수도 있다. 전자 장치는 응답을 출력할 수 있다. 이때, 전자 장치는 대화 시스템을 이용하여 응답을 자연어로 처 리하여 출력할 수 있다. 예를 들어, 전자 장치는 \"오늘 기온은 22℃ 입니다\"라는 자연어 응답을 제공할 수 있다. 한편, 전자 장치는 상술한 바와 같은 사용자 음성을 대한 응답을 제공하기 위하여 인공지능 에이전트 (Artificial intelligence agent)를 이용할 수 있다. 이때, 인공지능 에이전트는 AI(Artificial Intelligence) 기반의 서비스(예를 들어, 음성 인식 서비스, 비서 서비스, 번역 서비스, 검색 서비스 등)를 제공하기 위한 전 용 프로그램으로서, 기존의 범용 프로세서(예를 들어, CPU) 또는 별도의 AI 전용 프로세서(예를 들어, GPU 등) 에 의해 실행될 수 있다. 특히, 인공지능 에이전트는 다양한 모듈(예로, 대화 시스템)을 제어할 수 있다. 이와 같이, 본 개시의 일 실시 예에 따르면, 전자 장치는 사용자 음성을 입력받고, 그에 대한 응답을 제공 할 수 있다. 한편, 전자 장치의 스피커를 통해 출력딘 오디오 신호(또는, 음향, 사운드 등)이 전자 장치의 마이크 를 통해 에코 신호로 입력되는 경우, 전자 장치는 에코 신호에 의해 사용자 음성에 대한 인식률이 저하될 수 있다. 이에 따라, 전자 장치는 에코 신호에 의한 성능 저하를 방지하기 위해, 음향 반향 제거(acoustic echo cancellation, AEC)를 수행하여 에코 신호를 제거할 수 있다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 도 2를 참조하면, 전자 장치는 스피커, 마이크 및 오디오 프로세서를 포함한다. 스피커는 오디오 신호(또는, 음향, 사운드 등)를 출력한다. 구체적으로, 스피커는 오디오 프로세서 에서 처리된 오디오 신호를 출력할 수 있다. 마이크는 사운드 신호를 입력(또는, 수신)받는다. 구체적으로, 마이크는 사용자가 발화한 음성 신호 및 스피커에서 출력된 오디오 신호 등을 포함하는 사운드 신호를 입력받을 수 있다. 오디오 프로세서는 오디오 신호를 처리하기 위한 구성요소이다. 이를 위해, 오디오 프로세서는 오디 오 신호를 처리하기 위한 프로세서 등과 같은 하드웨어 및/또는 오디오 신호를 처리하기 위한 프로그램 등의 소 프트웨어를 포함할 수 있다.구체적으로, 오디오 프로세서는 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하고, 스피커의 출력 레벨에 기초하여 주파수 대역의 크기가 조정된 오디오 신호의 크기에 대한 조정 여부를 결 정하고, 조정 여부에 기초하여 처리된 오디오 신호를 스피커를 통해 출력할 수 있다. 이를 위해, 오디오 프로세서는 도 3과 같은 구성요소를 포함할 수 있다. 도 3을 참조하면, 오디오 프로세서는 이퀄라이저, 다이나믹 레인지 컨트롤러 및 음향 증폭부 를 포함할 수 있다. 도 3에 도시된 구성요소들 각각은 회로(circuitry)를 포함하는 하드웨어로 구현될 수 있으며, 실시 예에 따라, 각 구성요소의 기능을 수행하기 위해 소프트웨어로 구현될 수도 있다. 이퀄라이저(equalizer, EQ)는 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정할 수 있다. 이 경우, 이퀄라이저는 오디오 신호에서 특정 주파수 대역의 신호의 크기 조정을 위한 필터를 포함 할 수 있다. 예를 들어, 스피커는 고유한 특성에 따라 특정 주파수 대역의 신호를 약하게 출력하거나, 또는 특정 주파 수 대역의 신호를 강하게 출력할 수 있다. 이에 따라, 이퀄라이저는 스피커의 특성에 따라 스피커 에서 약하게 또는 강하게 출력되는 오디오 신호를 보정하기 위해, 오디오 신호에서 특정 주파수 대역의 신 호의 크기를 증가시키거나 감소시킬 수 있다. 한편, 이퀄라이징에 의해 크기가 조정되는 주파수 대역은 스피커 의 고유한 특성에 따라 결정된다는 점에서, 해당 주파수 대역은 기설정되어 있을 수 있다. 이와 같이, 이 퀄라이저는 스피커의 특성을 보상해주는 역할을 하는 보상 회로의 기능을 수행할 수 있다. 즉, 입력 된 오디오 신호에서 설정된 주파수 대역의 신호의 크기를 조정하는 것은, 스피커로 출력되는 오디오 신호 와 입력된 오디오 신호와의 차이를 보상해주도록 스피커의 특성에 기초하여 조정하는 것일 수 있다. 다이나믹 레인지 컨트롤러(dynamic range controller, DRC)는 스피커의 출력 레벨에 기초하여 이퀄 라이저에서 출력되는 오디오 신호의 크기를 조정할 수 있다. 구체적으로, 다이나믹 레인지 컨트롤러는 이퀄라이저에서 출력되는 오디오 신호의 크기를 스피커 의 출력 레벨을 고려하여 적절한 크기로 조정할 수 있다. 예를 들어, 오디오 신호의 크기가 스피커에서 출력될 수 있는 오디오 신호의 레벨보다 큰 경우, 다이나믹 레인지 컨트롤러는 오디오 신호에서 높은 진폭을 갖는 부분을 클리핑하여, 해당 부분의 크기를 감소하거나 제한시킬 수 있다. 또한, 오디오 신호의 크기가 스피커에서 출력될 수 있는 오디오 신호의 레벨보다 작은 경우에는, 다이나믹 레인지 컨트롤러는 이퀄라이저로부터 입력된 오디오 신호의 크기를 조정함이 없 이, 음향 증폭부(amplifier)로 출력할 수 있다. 이와 같이, 다이나믹 레인지 컨트롤러는 스피커의 출력 레벨 및 입력되는 오디오 신호의 크기를 고려 하여, 오디오 신호의 크기를 조정할 수 있다. 음향 증폭부는 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호를 증폭할 수 있다. 이 경우, 스 피커는 음향 증폭부로부터 입력된 오디오 신호를 출력할 수 있다. 한편, 도 3에 도시된 이퀄라이저, 다이나믹 레인지 컨트롤러 및 음향 증폭부는 별도로 구현되거 나, 또는, 이퀄라이저 및 다이나믹 레인지 컨트롤러가 하나의 IC(integrated circuit)로 구현되거나, 이퀄라이저, 다이나믹 레인지 컨트롤러 및 음향 증폭부가 하나의 IC로 구현될 수 있다. 한편, 이퀄라이저, 다이나믹 레인지 컨트롤러 및 음향 증폭부는 이미 공지된 구성요소라는 점에 서, 구체적인 설명은 생략하도록 한다. 한편, 오디오 프로세서는 에코 신호에 의한 성능 저하를 방지하기 위해, 음향 반향 제거를 수행할 수 있다. 일 예로, 오디오 프로세서는 특정 오디오 신호를 기준 데이터(echo reference)로 설정하고, 주파수 분석을 통해 전자 장치의 마이크를 통해 입력된 사운드 신호 중 기준 데이터와 유사한 주파수 특성을 가지는 신호를 에코 신호로 판단하여, 해당 신호를 제거 또는 감쇄시킬 수 있다. 이와 같이, 에코 신호를 제거하기 위해서는 기준 데이터를 설정하여야 한다. 이와 관련하여, 본 개시의 일 실시 예에 따르면, 다이나믹 레인지 컨트롤러에 의한 조정 여부에 기초하여 특정한 오디오 신호를 선택하고, 해 당 오디오 신호를 에코 신호 제거를 위한 기준 데이터로 설정하는데, 이하에서 도 4 내지 도 8을 참조하여 보다구체적으로 설명하도록 한다. 구체적으로, 오디오 프로세서는 스피커를 통해 출력된 오디오 신호를 포함하는 사운드 신호가 마이크 를 통해 수신되면, 조정 여부에 기초하여 입력된 오디오 신호 또는 크기가 조정된 오디오 신호를 이용하여 사운드 신호에 대한 음향 반향 제거를 수행할 수 있다. 즉, 오디오 프로세서는 다이나믹 레인지 컨트롤러에 의해 이퀄라이저에서 출력되는 오디오 신호 의 크기에 대한 조정 여부에 기초하여 이퀄라이저에 입력되는 오디오 신호 또는 다이나믹 레인지 컨트롤러 에서 출력되는 오디오 신호를 이용하여 음향 반향 제거를 수행할 수 있다. 먼저, 오디오 프로세서는 다이나믹 레인지 컨트롤러에 의해 이퀄라이저에서 출력되는 오디오 신 호의 크기가 조정되지 않은 경우, 이퀄라이저에 입력되는 오디오 신호에 기초하여 음향 반향 제거를 수행 할 수 있다. 즉, 오디오 프로세서는 다이나믹 레인지 컨트롤러에 의해 이퀄라이저에서 출력되는 오디오 신호 의 크기가 조정되지 않은 경우, 마이크를 통해 입력된 사운드 신호 중 이퀄라이저에 입력되는 오디오 신호와 유사한 주파수 특성을 가지는 신호를 에코 신호로 판단하여, 해당 신호를 제거할 수 있다. 이 경우, 오디오 프로세서는 도 4에 도시된 바와 같이, 에러 보정부 및 음향 반향 제거부를 포 함할 수 있다. 이때, 이들 구성요소는 회로(circuitry)를 포함하는 하드웨어로 구현될 수 있으며, 실시 예에 따 라, 해당 기능을 수행하기 위한 소프트웨어로 구현될 수도 있다. 구체적으로, 이퀄라이저에 입력되는 오디오 신호 ①는 도 5의 ①과 같은 파형으로 나타낼 수 있다. 이 경우, 이퀄라이저가 오디오 신호에서 저주파수 대역의 신호의 크기를 증폭시키는 경우, 이퀄라이저 에서 출력되는 오디오 신호 ②는 도 5의 ②와 같은 파형으로 나타낼 수 있다. 한편, 다이나믹 레인지 컨트롤러에서 오디오 신호의 크기를 조정하지 않는 경우, 다이나믹 레인지 컨트롤 러에서 출력되는 오디오 신호 ③는 도 5의 ③과 같은 파형으로 나타낼 수 있다. 이 경우, 다이나믹 레인지 컨트롤러에서 별도의 동작을 수행하지 않았다는 점에서, 오디오 신호 ②와 오디오 신호 ③의 파형은 동일 할 수 있다. 이후, 오디오 신호가 스피커를 통해 출력되면, 스피커의 특성에 의해 저주파수 대역의 신호의 크기가 약해진다는 점에서, 스피커에서 출력되는 오디오 신호가 마이크에 입력되면, 마이크에 입력된 오디오 신호는 도 5의 ④와 같은 파형을 가질 수 있다. 한편, 에러 보정부는 다이나믹 레인지 컨트롤러에서 오디오 신호의 크기를 조정하지 않는 경우, 이퀄 라이저로 입력되는 오디오 신호와 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호 중에서 이퀄 라이저로 입력되는 오디오 신호를 음향 반향 제거부로 출력하게 된다. 이에 따라, 음향 반향 제거부는 에러 보정부로부터 입력되는 오디오 신호를 이용하여 마이크에 입력된 사운드 신호에서 에코 신호를 제거하고, 에코 신호가 제거된 오디오 신호를 출력하게 된다. 즉, 음향 반향 제거부는 이퀄라이저에 입력되는 오디오 신호를 기준 데이터로 설정하고, 주파수 분석 을 통해 마이크를 통해 입력된 사운드 신호 중 기준 데이터와 유사한 주파수 특성을 가지는 신호를 에코 신호로 판단하여, 해당 신호를 제거할 수 있다. 구체적으로, 다이나믹 레인지 컨트롤러에서 오디오 신호의 크기를 조정하지 않는 경우, 마이크에 입 력된 사운드 신호는 도 5의 ④와 같은 스키퍼에서 출력된 오디오 신호를 포함하고 있으며, 이는 이퀄라이 저에 입력되는 오디오 신호(도 5의 ①)와 동일한 특성을 가진다. 이에 따라, 음향 반향 제거부는 다이나믹 레인지 컨트롤러에서 오디오 신호의 크기를 조정하지 않는 경우, 이퀄라이저에 입력되는 오디오 신호를 이용하여 음향 반향 제거를 수행하게 된다. 이 경우, 마이크 에 입력된 사운드 신호 중 스피커에서 출력된 오디오 신호, 및 이퀄라이저에 입력되는 오디오 신호는 동일한 특성을 가진다는 점에서, 마이크에 입력된 사운드 신호 중에서 전자 장치에 의해 발생 된 에코 신호가 효율적으로 제거될 수 있게 된다. 한편, 오디오 프로세서는 다이나믹 레인지 컨트롤러에 의해 이퀄라이저에서 출력되는 오디오 신 호의 크기가 조정된 경우, 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에 기초하여 음향 반향 제거를 수행할 수 있다. 이 경우, 오디오 프로세서는 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 기설정된 주파 수 대역의 신호의 크기를 이퀄라이저와 반대로 조정하고, 조정된 오디오 신호에 기초하여 음향 반향 제거 를 수행할 수 있다. 즉, 오디오 프로세서는 다이나믹 레인지 컨트롤러에 의해 이퀄라이저에서 출력되는 오디오 신호 의 크기가 조정된 경우, 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정할 수 있다. 이 경우, 오디오 프로세서는 이퀄라이저에서 조정된 것과는 반대로 다이나믹 레인지 컨트롤러에 서 출력되는 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정할 수 있다. 예를 들어, 이퀄라이저에 의해 특정 주파수 대역의 신호가 약해진 경우, 오디오 프로세서는 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 특정 주파수 대역의 신호의 크기를 증폭시키고, 이퀄라이 저에 의해 특정 주파수 대역의 신호가 강해진 경우, 오디오 프로세서는 다이나믹 레인지 컨트롤러 에서 출력되는 오디오 신호에서 특정 주파수 대역의 신호의 크기를 낮출 수 있다. 그리고, 오디오 프로세서는 마이크를 통해 입력된 사운드 신호 중 특정 주파수 대역의 신호의 크기가 조정된 오디오 신호와 유사한 주파수 특성을 가지는 신호를 에코 신호로 판단하여, 해당 신호를 제거할 수 있다. 이 경우, 오디오 프로세서는 도 4에 도시된 바와 같이, 에러 보정부 및 음향 반향 제거부를 포 함할 수 있다. 구체적으로, 이퀄라이저에 입력되는 오디오 신호 ①는 도 6의 ①과 같은 파형으로 나타낼 수 있다. 이 경우, 이퀄라이저가 오디오 신호에서 저주파수 대역의 신호의 크기를 증폭시키는 경우, 이퀄라이저 에서 출력되는 오디오 신호 ②는 도 6의 ②와 같은 파형으로 나타낼 수 있다. 한편, 다이나믹 레인지 컨트롤러가 오디오 신호의 크기를 조정한 경우, 다이나믹 레인지 컨트롤러에 서 출력되는 오디오 신호 ③는 도 6의 ③과 같은 파형을 가질 수 있다. 즉, 도 6의 ③을 참조하면, 다이나믹 레 인지 컨트롤러에 의해 오디오 신호 ②에서 진폭이 큰 부분의 신호가 클리핑된 것을 알 수 있다. 이후, 오디오 신호가 스피커를 통해 출력되면, 스피커의 특성에 의해 저주파수 대역의 신호의 크기가 약해진다는 점에서, 스피커에서 출력되는 오디오 신호가 마이크에 입력되면, 마이크에 입력된 오디오 신호는 도 6의 ④와 같은 파형을 가질 수 있다. 한편, 에러 보정부는 다이나믹 레인지 컨트롤러에서 오디오 신호의 크기를 조정한 경우, 이퀄라이저 로 입력되는 오디오 신호와 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호 중에서 다이나믹 레 인지 컨트롤러에서 출력되는 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하고, 조정된 오 디오 신호를 음향 반향 제거부로 출력할 수 있다. 구체적으로, 에러 보정부는 이퀄라이저에서 신호의 크기 조정을 위해 이용된 필터의 역필터를 이용하 여, 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 이퀄 라이저와는 반대로 조정할 수 있다. 예를 들어, 이퀄라이저가 저주파수 대역의 신호의 크기를 증폭시키는 경우, 에러 보정부는 저주파수 대역의 신호의 크기를 이퀄라이저에 의해 증폭된 정도만큼 낮출 수 있다. 이에 따라, 에러 보정부에 서 음향 반향 제거부로 출력되는 오디오 신호의 파형은 도 6의 ⑤와 같을 수 있다. 이에 따라, 음향 반향 제거부는 에러 보정부에서 입력되는 오디오 신호를 이용하여 마이크에 입 력된 사운드 신호에서 에코 신호를 제거하고, 에코 신호가 제거된 오디오 신호를 출력하게 된다. 즉, 음향 반향 제거부는 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 기설정된 주파수 대역의 신호의 크기가 조정된 신호를 기준 데이터로 설정하고, 주파수 분석을 통해 마이크를 통해 입력된 사운드 신호 중 기준 데이터와 유사한 주파수 특성을 가지는 신호를 에코 신호로 판단하여, 해당 신호를 제거할 수 있다. 구체적으로, 다이나믹 레인지 컨트롤러에서 오디오 신호의 크기를 조정한 경우, 마이크에 입력된 사 운드 신호는 도 6의 ④와 같은 스키퍼에서 출력된 오디오 신호를 포함하고 있으며, 이는 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 기설정된 주파수 대역의 크기가 조정된 오디오 신호(도 6의 ⑤)와 동일한 특성을 가진다. 이에 따라, 음향 반향 제거부는 다이나믹 레인지 컨트롤러에서 오디오 신호의 크기를 조정한 경우, 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호를 이용하여 음향 반향 제거를 수행하게 된다. 이 경 우, 마이크에 입력된 사운드 신호 중 스피커에서 출력된 오디오 신호, 및 다이나믹 레인지 컨트롤러 에서 출력되는 오디오 신호에서 기설정된 주파수 대역의 크기가 조정된 오디오 신호는 동일한 특성을 가진 다는 점에서, 마이크에 입력된 사운드 신호에서 전자 장치에 의해 발생된 에코 신호를 효율적으로 제 거될 수 있게 된다. 이와 같이, 본 개시의 다양한 실시 예에 따르면, 다이나믹 레인지 컨트롤러의 동작으로 오디오 신호가 왜 곡되는 경우라도, 효과적으로 음향 반향 제거를 수행할 수 있게 된다. 한편, 전술한 예에서는 이퀄라이저에 입력되는 오디오 신호를 이용하여 음향 반향 제거를 수행하는 것으로 설명하였다. 다만, 본 개시의 일 실시 예에 따르면, 오디오 프로세서는 이퀄라이저에 입력되는 오디 오 신호가 아닌 이퀄라이저에서 출력되는 오디오 신호를 이용하여 음향 반향 제거를 수행할 수도 있다. 이 경우, 오디오 프로세서는 이퀄라이저에서 출력되는 오디오 신호에 대해, 이퀄라이저에서 적용된 필터의 역필터를 이용하여, 이퀄라이저에서 출력되는 오디오 신호의 크기를 이퀄라이저와 반대로 조 정하고, 해당 오디오 신호를 이용하여 음향 반향 제거를 수행할 수 있다. 구체적으로, 도 7과 같이, 에러 보정부는 다이나믹 레인지 컨트롤러에서 오디오 신호의 크기를 조정 하지 않는 경우, 이퀄라이저에서 출력되는 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하 고, 조정된 오디오 신호를 음향 반향 제거부로 출력할 수 있다. 이 경우, 에러 보정부는 이퀄라이저에서 신호의 크기 조정을 위해 이용된 필터의 역필터를 이용하여, 이퀄라이저에서 출력되는 오디오 신호에서 기설정된 주파수 대역의 신호의 신호의 크기를 이퀄라이저(13 1)와는 반대로 조정할 수 있다. 그리고, 에러 보정부는 조정된 오디오 신호를 음향 반향 제거부로 출 력할 수 있다. 이에 따라, 음향 반향 제거부는 에러 보정부로부터 입력되는 오디오 신호를 이용하여 마이크에 입력된 사운드 신호에서 에코 신호를 제거하고, 에코 신호가 제거된 오디오 신호를 출력하게 된다. 도 8은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 상세히 도시한 블록도이다. 도 8에 도시된 바와 같이, 전자 장치는 스피커, 마이크, 오디오 프로세서, 프로세서, 메모리, 디스플레이, 통신 인터페이스 및 입력 인터페이스를 포함할 수 있다. 이 경우, 프 로세서는 이들 구성요소와 전기적으로 연결되어 전자 장치의 전반적인 동작 및 기능을 제어할 수 있 다. 한편, 도 8에 도시된 스피커, 마이크 및 오디오 프로세서는 도 2 내지 도 4에서 설명하였으 며, 중복되는 설명은 생략하기로 한다. 프로세서는 중앙처리장치, 어플리케이션 프로세서 및 커뮤니케이션 프로세서 중 하나 또는 그 이상을 포함 할 수 있다. 프로세서는 전자 장치를 제어할 수 있다. 예를 들어, 프로세서는 전자 장치의 적어도 하나의 구성요소들의 제어 및 연산이나 데이터 처리 등을 실행할 수 있다. 한편, 오디오 프로세서 는 프로세서와 구분되어 전자 장치에 포함될 수 있다. 다만, 다른 실시 예에 따르면, 오디오 프로세 서는 프로세서에 포함될 수 있고, 또 다른 실시 예에 따르면, 오디오 프로세서는 독립적인 모듈 로서 구성될 수도 있다. 메모리는 전자 장치의 적어도 하나의 다른 구성요소에 관계된 인스트럭션(instruction) 또는 데이터 를 저장할 수 있다. 메모리는 비휘발성 메모리, 휘발성 메모리, 플래시메모리(flash-memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD) 등으로 구현될 수 있다. 메모리는 프로세서에 의 해 액세스되며, 프로세서에 의한 데이터의 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 디스플레이는 다양한 화면을 표시할 수 있다. 예를 들어, 디스플레이는 전자 장치의 동작과 관 련된 다양한 화면을 표시할 수 있다. 이 경우, 디스플레이는 터치 패널과 결합하여 레이어 구조의 터치 스크린으로 구현될 수 있다. 터치 스크린은 디스플레이 기능뿐만 아니라 터치 입력 위치, 터치된 면적뿐만 아니라 터치 입력 압력까지도 검출하는기능을 가질 수 있고, 또한 실질적인 터치(real-touch)뿐만 아니라 근접 터치(proximity touch)도 검출하는 기 능을 가질 수 있다. 통신 인터페이스는 외부 전자 장치와 통신을 수행하기 위한 구성으로 회로(circuitry)를 포함할 수 있다. 이 경우, 통신 인터페이스가 외부 전자 장치와 통신 연결되는 것은 제3 기기(예로, 중계기, 허브, 엑세스 포인트, 서버 또는 게이트웨이 등)를 거쳐서 통신하는 것을 포함할 수 있다. 예를 들어, 통신 인터페이스는 LTE, WiFi(wireless fidelity) 등과 같은 무선 통신 및, USB(universal serial bus), HDMI(high definition multimedia interface) 등과 같은 유선 통신을 위한 구성요소를 포함할 수 있으며, 무선 통신 또는 유선 통신이 수행되는 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨터 네트 워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나를 포함할 수 있다. 또한, 통신 인터페이스는 외부의 서버와 통신을 수행하여 인공지능 에이전트 서비스를 제공할 수 있다. 입력 인터페이스는 다양한 사용자 커맨드(command)을 입력받기 위한 구성으로, 회로(circuitry)를 포함할 수 있다. 이 경우, 입력 인터페이스는 입력된 사용자 커맨드를 프로세서로 전달할 수 있다. 입력 인 터페이스는 예를 들면, 터치 패널, 또는 키를 포함할 수 있다. 터치 패널은, 예를 들면, 정전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널 은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사 용자에게 촉각 반응을 제공할 수 있다. 키는 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 한편, 본 개시의 일 실시 예에 따르면, 프로세서는 사용자 음성에 대한 응답을 제공할 수 있다. 구체적으로, 사용자 음성을 입력받는 동안에, 스피커에서 오디오 신호가 출력되는 경우, 마이크에 입 력된 사운드 신호는 사용자가 발화한 음성 신호 및 스피커에서 출력된 오디오 신호를 포함할 수 있다. 이 경우, 오디오 프로세서는 전술한 방법을 통해, 마이크에 입력된 사운드 신호 중에서 스피커에서 출력된 오디오 신호를 제거하게 된다. 이 경우, 프로세서는 마이크에 입력된 사운드 신호 중에서 에코 신호가 제거된 사운드 신호 즉, 음성 신호를 이용하여 음성 인식을 수행하게 된다. 즉, 음향 반향이 제거된 사운드 신호가 음성 인식에 이용되게 된 다. 이에 따라, 본 개시의 일 실시 예에 따르면, 음성 인식에 대한 인식률이 보다 향상될 수 있다. 이 경우, 프로세서는 인공지능 에이전트 프로그램을 이용하여 사용자 음성에 대한 응답을 제공할 수 있다. 구체적으로, 프로세서는 음성 신호에 대한 음성 인식을 수행하여 사용자 음성을 텍스트로 변환하고, 음성 인식 결과에 기초하여 사용자 음성에 대한 도메인(domain), 의도(intend) 및 의도를 파악하는데 필요한 파라미 터(parameter)(또는, 슬롯(slot)) 등을 파악할 수 있다. 그리고, 프로세서는 사용자 의도에 따라 검색 등 을 수행하여 사용자 음성에 대한 응답을 획득하고, 획득된 응답을 자연어로 처리하고, 이를 출력하여 사용자 음 성에 대한 응답을 제공할 수 있다. 예를 들어, 전자 장치는 날씨를 문의하는 의도를 갖는 사용자 음성에 대해, 현재 날씨를 검색하여 사용자 음성에 대한 응답울 획득하고, 응답을 자연어 처리하고, 획득된 자연어를 TTS(Text to Speech)를 통해 음성으로 변환하여 전자 장치의 스피커를 통해 출력할 수 있다. 이에 의해, 대화 시스템은 사용자 음성에 대한 응답을 제공할 수 있게 되어, 사용자는 전자 장치와 대화를 수행할 수 있게 된다. 이를 위해, 메모리는 도 9에 도시되 바와 같은 대화 시스템을 구성하는 복수의 모듈을 포함할 수 있다. 이 경우, 프로세서는 도 9에 도시된 복수의 구성을 이용하여 사용자 음성에 대한 응답을 사용자에게 제공할 수 있다. 대화 시스템은 도 9에 도시된 바와 같이, 사용자 음성에 대한 음성 신호를 텍스트로 변환하기 위한 자동 음성 인식(automatic speech recognition)(ASR) 모듈, 사용자 음성에 대한 의도 등을 파악하기 위한 자연 어 이해(natural language understanding)(NLU) 모듈, 사용자 의도에 대응되는 응답을 획득하기 위한 대 화 매니저(dialogue manager)(DM) 모듈, 획득된 응답에 대해 자연어 처리를 수행하기 위한 자연어 생성 (natural language generator)(NLG) 모듈 및 자연어 처리된 텍스트를 음성으로 변환하기 위한 텍스트 음 성 변환(text to speech)(TTS) 모듈을 포함할 수 있다. 한편, 도 9에 도시된 대화 시스템은 가상의인공지능 에이전트와 자연어를 통해 대화를 수행하기 위한 구성으로서, 본 개시의 일 실시 예에 따르면, 대화 시스템은 전자 장치의 메모리 내에 저장될 수 있다. 다만, 이는 일 예일 뿐이고, 대화 시스템 에 포함된 적어도 하나의 모듈은 외부의 적어도 하나의 서버에 포함될 수 있다. 도 10은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 먼저, 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정한다(S1010). 이후, 스피커의 출력 레벨에 기초하여 주파수 대역의 크기가 조정된 오디오 신호의 크기에 대한 조정 여부를 결 정하고, 조정 여부에 기초하여 처리된 오디오 신호를 스피커를 통해 출력한다(S1020). 그리고, 출력된 오디오 신호를 포함하는 사운드 신호가 마이크를 통해 수신되면, 조정 여부에 기초하여 입력된 오디오 신호 또는 크기가 조정된 오디오 신호를 이용하여 사운드 신호에 대한 음향 반향 제거를 수행한다 . 이 경우, S1010 단계는 이퀄라이저를 이용하여 입력된 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 조정하고, S1020 단계는 다이나믹 레인지 컨트롤러를 이용하여 상기 스피커의 출력 레벨에 기초하여 이퀄라이저 에서 출력되는 오디오 신호의 크기를 조정하며, 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호를 증폭하 여 스피커를 통해 출력할 수 있다. 또한, S1020 단계는 다이나믹 레인지 컨트롤러에 의해 이퀄라이저에서 출력되는 오디오 신호의 크기에 대한 조 정 여부에 기초하여 이퀄라이저에 입력되는 오디오 신호 또는 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호를 이용하여 음향 반향 제거를 수행할 수 있다. 또한, S1030 단계는 다이나믹 레인지 컨트롤러에 의해 이퀄라이저에서 출력되는 오디오 신호의 크기가 조정되지 않은 경우, 이퀄라이저에 입력되는 오디오 신호에 기초하여 음향 반향 제거를 수행할 수 있다. 또한, S1030 단계는 다이나믹 레인지 컨트롤러에 의해 이퀄라이저에서 출력되는 오디오 신호의 크기가 조정된 경우, 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에 기초하여 음향 반향 제거를 수행할 수 있다. 이 경우, 다이나믹 레인지 컨트롤러에서 출력되는 오디오 신호에서 기설정된 주파수 대역의 신호의 크기를 이퀄라 이저와 반대로 조정하고, 조정된 오디오 신호에 기초하여 음향 반향 제거를 수행할 수 있다. 한편, 음향 반향이 제거된 사운드 신호는 음성 인식에 이용될 수 있다. 한편, 다이나믹 레인지 컨트롤러의 동작 여부에 따라 특정한 오디오 신호를 이용하여 음향 반향 제거를 수행하 는 구체적인 방법에 대해서는 전술한 바 있다. 한편, 본 개시에서 사용된 용어 \"부\" 또는 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하 며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. \"부\" 또는 \" 모듈\"은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 모듈은 ASIC(application-specific integrated circuit)으로 구성될 수 있다. 본 개시의 다양한 실시예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호 출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시예들에 따른 전자 장치(예: 전자 장치 )를 포함할 수 있다. 상기 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 상기 프로세서의 제어 하에 다른 구성요소들을 이용하여 상기 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인 터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non- transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신호(signal)를 포함하지 않 으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 일시예에 따르면, 본 개시에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어를 통해 온라인으로 배포될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체 에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다.다양한 실시예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요소가 다 양한 실시예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차 적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다."}
{"patent_id": "10-2018-0167515", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 인공지능 에이전트 시스템의 사용도, 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도, 도 3은 본 개시의 일 실시 예에 따른 오디오 프로세서를 설명하기 위한 블록도, 도 4는 본 개시의 일 실시 예에 따른 오디오 프로세서를 설명하기 위한 블록도, 도 5는 본 개시의 일 실시 예에 따른 오디오 신호의 파형을 설명하기 위한 도면, 도 6은 본 개시의 일 실시 예에 따른 오디오 신호의 파형을 설명하기 위한 도면, 도 7은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도, 도 8은 본 개시의 일 실시 예에 따른 전자 장치의 세부 구성을 설명하기 위한 블록도, 도 9는 본 개시의 일 실시 예에 따른 인공지능 에이전트 시스템의 대화 시스템을 도시한 블록도, 그리고 도 10은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
