{"patent_id": "10-2017-0062370", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0127054", "출원번호": "10-2017-0062370", "발명의 명칭": "인공지능 키워드 등록 방법 및 장치", "출원인": "윤택기", "발명자": "윤택기"}}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "검색식에서 중어절을 추출하는 중어절 추출단계와,추출된 중어절이 키워드DB(Data Base)에 등록된 키워드인지 판단하는 중어절 키워드 판단단계와,추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절을 스페이스를 기준으로 전어절과 후어절로 분리하는 전후어절 분리단계와,상기 전어절과 상기 후어절이 각각 키워드DB에 등록된 키워드인지 판단하는 전후어절 키워드 판단단계와,상기 전어절과 상기 후어절이 모두 키워드DB에 등록된 키워드로 판단된 경우 상기 전어절과 상기 후어절로 이루어진 중어절을 키워드DB에 키워드로 등록하는 중어절 키워드 등록단계를 포함하는 인공지능 키워드 등록 방법."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 전후어절 키워드 판단단계에서 상기 전어절과 상기 후어절 중 어느 하나 이상이 키워드DB에 등록되어 있지않은 것으로 판단된 경우 해당 전어절 및/또는 후어절을 분석대상어절로 하여, 상기 분석대상어절을 키워드DB에등록하는 전후어절 키워드 등록단계를 더 포함하는 것을 특징으로 하는 인공지능 키워드 등록 방법."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 전후어절 키워드 등록단계는,상기 분석대상어절을 전절단어와 후절단어로 분리하는 분석대상어절 분리단계와,상기 전절단어 및 상기 후절단어가 각각 키워드DB에 등록된 키워드인지 판단하는 전후절단어 키워드판단단계와,상기 전절단어 및 상기 후절단어가 모두 키워드DB에 등록된 키워드로 판단된 경우 상기 분석대상어절을 키워드DB에 키워드로 등록하는 분석대상어절 키워드 등록단계를 포함하는 것을 특징으로 하는 인공지능 키워드 등록방법."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 전후어절 키워드 등록단계는,상기 분석대상어절 분리단계는 상기 분석대상어절이 m음절(m은 2 이상의 자연수)로 이루어져 음절사이의 경계가m-1개인 경우에, m-1번째 경계를 기준으로 상기 분석대상어절을 전절단어와 후절단어로 분리하되, 재수행 시 상기 경계를 하나씩 앞으로 바꾸어 가며 상기 분석대상어절을 전절단어와 후절단어로 분리하고,상기 분석대상어절 키워드 등록단계 후, 상기 분석대상어절의 분리가 상기 분석대상어절에서 도출 가능한 전절단어와 후절단어의 m-1개의 조합에 대해 이루어졌는지 판단하고, 아닌 경우 상기 분석대상어절 분리단계의 재수행이 진행되도록 해주는 분석대상어절 분리완료 판단단계를 더 포함하는 것을 특징으로 하는 인공지능 키워드등록 방법.공개특허 10-2018-0127054-2-청구항 5 제4항에 있어서,추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 비키워드인 끝음절을 제거하여 끝음절이 제거된 중어절이 키워드DB에 등록된 키워드인지 판단하는 끝음절 제거 중어절 키워드 판단단계를 더 포함하는 것을 특징으로 하는 인공지능 키워드 등록 방법."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 끝음절 제거 중어절 키워드 판단단계는,추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 끝음절을 분리하는 끝음절 분리단계와,분리된 끝음절이 비키워드DB에 등록된 비키워드인지 판단하고, 아닌 경우 상기 전후어절 분리단계가 진행되도록해주는 비키워드 판단단계와,분리된 끝음절이 비키워드DB에 등록된 비키워드로 판단된 경우 이를 추출된 중어절에서 제거하는 끝음절 제거단계와,끝음절이 제거된 중어절이 키워드DB에 등록된 키워드인지 판단하고, 아닌 경우 끝음절이 제거된 중음절을 추출된 중어절로 하여 상기 전후어절 분리단계가 진행되도록 해주는 끝음절 제거 중어절 키워드 판단단계를 포함하는 것을 특징으로 하는 인공지능 키워드 등록 방법."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 중어절 추출단계는 상기 검색식이 n개(n은 2 이상의 자연수)의 어절로 이루어져 n-1개의 스페이스를 가지는 경우에, 읽는 방향에서 처음부터 2개의 어절을 상기 중어절로 추출하되, 재수행 시 직전에 추출된 중어절의후어절을 다음에 추출된 중어절의 전어절이 되도록 추출하며,상기 중어절 키워드 등록단계 또는 상기 전후어절 키워드 등록단계 후에,상기 검색식에 대해 n-1개의 중어절이 추출되었는지 판단하고, 아닌 경우 상기 중어절 추출단계의 재수행이 진행되도록 해주는 중어절 추출완료 판단단계를 더 포함하는 것을 특징으로 하는 인공지능 키워드 등록 방법."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "검색식에서 중어절을 추출하는 중어절 추출부와,상기 중어절 추출부가 추출한 중어절이 키워드DB(Data Base)에 등록된 키워드인지 판단하는 중어절 키워드 판단부와,상기 중어절 키워드 판단부의 판단 결과 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절을 스페이스를 기준으로 전어절과 후어절로 분리하는 전후어절 분리부와,상기 전후어절 분리부가 분리한 전어절과 후어절이 각각 키워드DB에 등록된 키워드인지 판단하는 전후어절 키워드 판단부와,상기 전후어절 키워드 판단부의 판단 결과 상기 전어절과 상기 후어절이 모두 키워드DB에 등록된 키워드로 판단된 경우 상기 전어절과 상기 후어절로 이루어진 중어절을 키워드DB에 키워드로 등록하는 중어절 키워드 등록부공개특허 10-2018-0127054-3-를 포함하는 인공지능 키워드 등록 장치."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 전후어절 키워드 판단부가 상기 전어절과 상기 후어절 중 어느 하나 이상이 키워드DB에 등록되어 있지 않은 것으로 판단한 경우 해당 전어절 및/또는 후어절을 분석대상어절로 하여, 상기 분석대상어절을 키워드DB에등록하는 전후어절 키워드 등록부를 더 포함하는 것을 특징으로 하는 인공지능 키워드 등록 장치."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 전후어절 키워드 등록부는,상기 분석대상어절을 전절단어와 후절단어로 분리하는 분석대상어절 분리부와,상기 분석대상어절 분리부가 분리한 전절단어 및 후절단어가 각각 키워드DB에 등록된 키워드인지 판단하는 전후절단어 키워드 판단부와,상기 전후절단어 키워드 판단부의 판단 결과 상기 전절단어 및 상기 후절단어가 모두 키워드DB에 등록된 키워드로 판단된 경우 상기 분석대상어절을 키워드DB에 키워드로 등록하는 분석대상어절 키워드 등록부를 포함하는 것을 특징으로 하는 인공지능 키워드 등록 장치."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 분석대상어절 분리부는 상기 분석대상어절이 m음절(m은 2 이상의 자연수)로 이루어져 음절사이의 경계가m-1개인 경우에, m-1번째 경계를 기준으로 상기 분석대상어절을 전절단어와 후절단어로 분리하되, 상기 분석대상어절의 분리를 재수행할 경우 상기 경계를 하나씩 앞으로 바꾸어 가며 상기 분석대상어절을 전절단어와 후절단어로 분리하며,상기 분석대상어절의 분리가 상기 분석대상어절에서 도출 가능한 전절단어와 후절단어의 m-1개의 조합에 대해이루어졌는지 판단하고, 아닌 경우 상기 분석대상어절 분리부에 의한 상기 분석대상어절의 분리의 재수행이 진행되도록 해주는 분석대상어절 분리완료 판단부를 더 포함하는 것을 특징으로 하는 인공지능 키워드 등록 장치."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 비키워드인 끝음절을 제거하여 끝음절이 제거된 중어절이 키워드DB에 등록된 키워드인지 판단하는 끝음절 제거 중어절 키워드 판단부를 더 포함하는 것을 특징으로 하는 인공지능 키워드 등록 장치."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 끝음절 제거 중어절 키워드 판단부는,상기 중어절 키워드 판단부의 판단 결과 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 끝음절을 분리하는 끝음절 분리부와,공개특허 10-2018-0127054-4-상기 끝음절 분리부가 분리한 끝음절이 비키워드DB에 등록된 비키워드인지 판단하는 비키워드 판단부와,상기 비키워드 판단부의 판단 결과 분리된 끝음절이 비키워드DB에 등록된 비키워드로 판단된 경우 이를 추출된중어절에서 제거하는 끝음절 제거부와,상기 끝음절 제거부가 끝음절을 제거한 중어절이 키워드DB에 등록된 키워드인지 판단하는 끝음절 제거 중어절키워드 판단부를 포함하는 것을 특징으로 하는 인공지능 키워드 등록 장치."}
{"patent_id": "10-2017-0062370", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항 내지 제13항 중 어느 한 항에 있어서,상기 중어절 추출부는 상기 검색식이 n개(n은 2 이상의 자연수)의 어절로 이루어져 n-1개의 스페이스를 가지는경우에, 읽는 방향에서 처음부터 2개의 어절을 상기 중어절로 추출하되, 중어절 추출의 재수행 시 직전에 추출된 중어절의 후어절을 다음에 추출된 중어절의 전어절이 되도록 중어절을 추출하며,상기 검색식에 대해 n-1개의 중어절이 추출되었는지 판단하고, 아닌 경우 상기 중어절 추출부에 의한 중어절 추출의 재수행이 진행되도록 해주는 중어절 추출완료 판단부를 더 포함하는 것을 특징으로 하는 인공지능 키워드등록 장치."}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 키워드 등록 방법 및 장치에 관한 것으로 더욱 상세하게는, 검색식에서 중어절을 추출하여 추출된 중어절이 키워드DB(Data Base)에 등록된 키워드인지 판단하고, 추출된 중어절이 키워드DB에 등록된 키워 드가 아닌 경우 추출된 중어절을 스페이스를 기준으로 전어절과 후어절로 분리하여, 상기 전어절과 상기 후어절 이 각각 키워드DB에 등록된 키워드인지 판단하며, 상기 전어절과 상기 후어절이 모두 키워드DB에 등록된 키워드 로 판단된 경우 상기 전어절과 상기 후어절로 이루어진 중어절이 키워드DB에 하나의 키워드로 등록되도록 해주는 인공지능 키워드 등록 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 키워드 등록 방법 및 장치에 관한 것으로 더욱 상세하게는, 검색식에서 중어절을 추출하여 추출된 중어절이 키워드DB(Data Base)에 등록된 키워드인지 판단하고, 추출된 중어절이 키워드DB에 등록된 키워 드가 아닌 경우 추출된 중어절을 스페이스를 기준으로 전어절과 후어절로 분리하여, 상기 전어절과 상기 후어절 이 각각 키워드DB에 등록된 키워드인지 판단하며, 상기 전어절과 상기 후어절이 모두 키워드DB에 등록된 키워드 로 판단된 경우 상기 전어절과 상기 후어절로 이루어진 중어절이 키워드DB에 하나의 키워드로 등록되도록 해주 는 인공지능 키워드 등록 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "키워드란 검색 대상이 되는 콘텐츠의 내용 또는 제목 내의 중요한 내용을 요약한 핵심적인 단어 또는 문구를 의 미한다. 문서 등의 콘텐츠를 인터넷, 인트라넷 등을 통해 검색할 때, 키워드를 이용하면 원하는 정보를 쉽게 찾 을 수 있게 된다. 검색서비스를 제공함에 있어서, 위와 같은 키워드를 키워드DB(Data Base)로 구축하여 놓으면 검색창을 통해 검색식이 입력되었을 때 해당 검색식이 상기 키워드DB에 등록된 키워드를 포함하고 있는 경우 해 당 키워드와 관련된 검색 결과를 제공할 수 있다. 그 결과 검색의 효율성을 향상시킬 수 있게 된다. 종래 키워드DB의 키워드 등록은 일반적으로 인위적인 등록 작업을 통해 이루어진다. 따라서 키워드DB의 업데이 트가 이루어지지 않을 경우, 종래 키워드DB에 등록되어 있지 않은 검색어를 포함하는 새로운 검색식에 대한 검 색 효율이 떨어지게 되며, 검색 결과에 많은 노이즈가 발생하게 된다. 또한, 종래 키워드DB는 일반적으로 개개 의 단어들을 키워드로 등록하여 놓는데, 이로 인하여 2 이상의 어절을 포함하는 비정형적인 검색식이 입력된 경 우 효과적인 검색이 어려운 문제도 있다. 이와 같은 배경에서 입력되는 검색식을 학습하여 자동으로 키워드DB에 키워드가 추가로 등록될 수 있게 해주는 기술의 개발이 요구되고 있다. 또한, 더 나아가, 2 이상의 어절을 포함하는 비정형적인 검색식을 토대로 2 이상 의 어절을 포함하는 키워드를 추출하여 중음절 또는 다음절 키워드로 등록될 수 있도록 해주는 것이 필요하다. 만약, 2 이상의 어절을 포함하는 중음절 또는 다음절 키워드가 키워드DB에 등록될 경우, 2 이상의 어절을 포함 하는 비정형적인 검색식의 입력이 이루어지더라도, 해당 검색식이 키워드DB에 등록된 중음절 또는 다음절 키워드를 포함하고 있다면, 매우 정확한 검색결과가 제공될 수 있기 때문이다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허 10-1671374 \"키워드 추천 장치와 방법 및 키워드 지식베이스 구축 방법\", 2016. 10. 26. 등록 (특허문헌 0002) 등록특허 10-1654151 \"컨텐츠 검색을 위한 자동 완성 문장 제공 방법 및 시스템\", 2016. 08. 30. 등록"}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래기술의 문제점을 해결하기 위한 것으로, 본 발명의 목적은, 입력된 검색식으로부터 키워드의 등록 및 확장이 효율적으로 수행될 수 있게 해주는 인공지 능 키워드 등록 방법 및 장치를 제공하는 것이다. 본 발명의 다른 목적은, 검색식에서 중어절을 추출하여 추출된 중어절이 키워드DB(Data Base)에 등록된 키워드 인지 판단하고, 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에 포함된 전어절과 후어 절이 각각 키워드DB에 등록된 키워드인지 판단하여, 상기 전어절과 상기 후어절이 모두 키워드DB에 등록된 키워 드로 판단된 경우 상기 전어절과 상기 후어절로 이루어진 중어절이 키워드DB에 키워드로 등록될 수 있게 해주는 인공지능 키워드 등록 방법 및 장치를 제공하는 것이다. 본 발명의 또 다른 목적은, 상기 전어절과 상기 후어절 중 어느 하나 이상이 키워드DB에 등록되어 있지 않은 것으로 판단된 경우 해당 전어절 및/또는 후어절을 분석대상어절로 하여, 상기 분석대상어절을 전절단어와 후절단 어로 분리하였을 때, 상기 전절단어와 후절단어가 모두 키워드DB에 등록된 키워드로 판단되는 경우가 존재할 경 우 해당 분석대상어절이 키워드DB에 등록될 수 있게 해주는 인공지능 키워드 등록 방법 및 장치를 제공하는 것 이다. 본 발명의 또 다른 목적은, 검색식에서 추출된 중어절의 끝음절이 비키워드로 판단된 경우 이를 제거하고 중어 절에 대한 키워드DB 등록여부의 판단 및 키워드DB 등록을 위한 절차가 수행될 수 있어 효율적인 키워드 등록이 이루어질 수 있게 해주는 인공지능 키워드 등록 방법 및 장치를 제공하는 것이다. 본 발명의 또 다른 목적은, 검색식에서 추출 가능한 모든 중어절에 대해 키워드DB 등록여부의 판단 및 키워드DB 등록을 위한 절차가 수행될 수 있어 효과적인 키워드 등록이 이루어질 수 있게 해주는 인공지능 키워드 등록 방 법 및 장치를 제공하는 것이다."}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 앞서 본 목적을 달성하기 위해서 다음과 같은 구성을 가진 실시예에 의해서 구현된다. 본 발명의 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 방법은, 검색식에서 중어절을 추출하는 중어절 추출단계와, 추출된 중어절이 키워드DB(Data Base)에 등록된 키워드인지 판단하는 중어절 키워드 판단단계와, 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절을 스페이스를 기준으로 전어절과 후어절 로 분리하는 전후어절 분리단계와, 상기 전어절과 상기 후어절이 각각 키워드DB에 등록된 키워드인지 판단하는 전후어절 키워드 판단단계와, 상기 전어절과 상기 후어절이 모두 키워드DB에 등록된 키워드로 판단된 경우 상기 전어절과 상기 후어절로 이루어진 중어절을 키워드DB에 키워드로 등록하는 중어절 키워드 등록단계를 포함한다. 본 발명의 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 방법은, 상기 전후어절 키워드 판단단계 에서 상기 전어절과 상기 후어절 중 어느 하나 이상이 키워드DB에 등록되어 있지 않은 것으로 판단된 경우 해당 전어절 및/또는 후어절을 분석대상어절로 하여, 상기 분석대상어절을 키워드DB에 등록하는 전후어절 키워드 등 록단계를 더 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 방법은, 상기 전후어절 키워드 등록단 계는, 상기 분석대상어절을 전절단어와 후절단어로 분리하는 분석대상어절 분리단계와, 상기 전절단어 및 상기 후절단어가 각각 키워드DB에 등록된 키워드인지 판단하는 전후절단어 키워드 판단단계와, 상기 전절단어 및 상 기 후절단어가 모두 키워드DB에 등록된 키워드로 판단된 경우 상기 분석대상어절을 키워드DB에 키워드로 등록하 는 분석대상어절 키워드 등록단계를 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 방법은, 상기 전후어절 키워드 등록단 계는, 상기 분석대상어절 분리단계는 상기 분석대상어절이 m음절(m은 2 이상의 자연수)로 이루어져 음절사이의 경계가 m-1개인 경우에, m-1번째 경계를 기준으로 상기 분석대상어절을 전절단어와 후절단어로 분리하되, 재수 행 시 상기 경계를 하나씩 앞으로 바꾸어 가며 상기 분석대상어절을 전절단어와 후절단어로 분리하고, 상기 분 석대상어절 키워드 등록단계 후, 상기 분석대상어절의 분리가 상기 분석대상어절에서 도출 가능한 전절단어와 후절단어의 m-1개의 조합에 대해 이루어졌는지 판단하고, 아닌 경우 상기 분석대상어절 분리단계의 재수행이 진 행되도록 해주는 분석대상어절 분리완료 판단단계를 더 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 방법은, 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 비키워드인 끝음절을 제거하여 끝음절이 제거된 중어절이 키워드 DB에 등록된 키워드인지 판단하는 끝음절 제거 중어절 키워드 판단단계를 더 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 방법은, 상기 끝음절 제거 중어절 키 워드 판단단계는, 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 끝음절을 분리하 는 끝음절 분리단계와, 분리된 끝음절이 비키워드DB에 등록된 비키워드인지 판단하고, 아닌 경우 상기 전후어절 분리단계가 진행되도록 해주는 비키워드 판단단계와, 분리된 끝음절이 비키워드DB에 등록된 비키워드로 판단된 경우 이를 추출된 중어절에서 제거하는 끝음절 제거단계와, 끝음절이 제거된 중어절이 키워드DB에 등록된 키워 드인지 판단하고, 아닌 경우 끝음절이 제거된 중음절을 추출된 중어절로 하여 상기 전후어절 분리단계가 진행되 도록 해주는 끝음절 제거 중어절 키워드 판단단계를 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 방법은, 상기 중어절 추출단계는 상기 검색식이 n개(n은 2 이상의 자연수)의 어절로 이루어져 n-1개의 스페이스를 가지는 경우에, 읽는 방향에서 처음 부터 2개의 어절을 상기 중어절로 추출하되, 재수행 시 직전에 추출된 중어절의 후어절을 다음에 추출된 중어절 의 전어절이 되도록 추출하며, 상기 중어절 키워드 등록단계 또는 상기 전후어절 키워드 등록단계 후에, 상기 검색식에 대해 n-1개의 중어절이 추출되었는지 판단하고, 아닌 경우 상기 중어절 추출단계의 재수행이 진행되도 록 해주는 중어절 추출완료 판단단계를 더 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 장치는, 검색식에서 중어절을 추출하 는 중어절 추출부와, 상기 중어절 추출부가 추출한 중어절이 키워드DB(Data Base)에 등록된 키워드인지 판단하 는 중어절 키워드 판단부와, 상기 중어절 키워드 판단부의 판단 결과 추출된 중어절이 키워드DB에 등록된 키워 드가 아닌 경우 추출된 중어절을 스페이스를 기준으로 전어절과 후어절로 분리하는 전후어절 분리부와, 상기 전 후어절 분리부가 분리한 전어절과 후어절이 각각 키워드DB에 등록된 키워드인지 판단하는 전후어절 키워드 판단 부와, 상기 전후어절 키워드 판단부의 판단 결과 상기 전어절과 상기 후어절이 모두 키워드DB에 등록된 키워드 로 판단된 경우 상기 전어절과 상기 후어절로 이루어진 중어절을 키워드DB에 키워드로 등록하는 중어절 키워드 등록부를 포함한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 장치는, 상기 전후어절 키워드 판단부 가 상기 전어절과 상기 후어절 중 어느 하나 이상이 키워드DB에 등록되어 있지 않은 것으로 판단한 경우 해당 전어절 및/또는 후어절을 분석대상어절로 하여, 상기 분석대상어절을 키워드DB에 등록하는 전후어절 키워드 등 록부를 더 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 장치는, 상기 전후어절 키워드 등록부 는, 상기 분석대상어절을 전절단어와 후절단어로 분리하는 분석대상어절 분리부와, 상기 분석대상어절 분리부가 분리한 전절단어 및 후절단어가 각각 키워드DB에 등록된 키워드인지 판단하는 전후절단어 키워드 판단부와, 상기 전후절단어 키워드 판단부의 판단 결과 상기 전절단어 및 상기 후절단어가 모두 키워드DB에 등록된 키워드로 판단된 경우 상기 분석대상어절을 키워드DB에 키워드로 등록하는 분석대상어절 키워드 등록부를 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 장치는, 상기 분석대상어절 분리부는 상기 분석대상어절이 m음절(m은 2 이상의 자연수)로 이루어져 음절사이의 경계가 m-1개인 경우에, m-1번째 경계 를 기준으로 상기 분석대상어절을 전절단어와 후절단어로 분리하되, 상기 분석대상어절의 분리를 재수행할 경우 상기 경계를 하나씩 앞으로 바꾸어 가며 상기 분석대상어절을 전절단어와 후절단어로 분리하며, 상기 분석대상 어절의 분리가 상기 분석대상어절에서 도출 가능한 전절단어와 후절단어의 m-1개의 조합에 대해 이루어졌는지 판단하고, 아닌 경우 상기 분석대상어절 분리부에 의한 상기 분석대상어절의 분리의 재수행이 진행되도록 해주 는 분석대상어절 분리완료 판단부를 더 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 장치는, 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 비키워드인 끝음절을 제거하여 끝음절이 제거된 중어절이 키워드 DB에 등록된 키워드인지 판단하는 끝음절 제거 중어절 키워드 판단부를 더 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 장치는, 상기 끝음절 제거 중어절 키 워드 판단부는, 상기 중어절 키워드 판단부의 판단 결과 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경 우 추출된 중어절에서 끝음절을 분리하는 끝음절 분리부와, 상기 끝음절 분리부가 분리한 끝음절이 비키워드DB 에 등록된 비키워드인지 판단하는 비키워드 판단부와, 상기 비키워드 판단부의 판단 결과 분리된 끝음절이 비키 워드DB에 등록된 비키워드로 판단된 경우 이를 추출된 중어절에서 제거하는 끝음절 제거부와, 상기 끝음절 제거 부가 끝음절을 제거한 중어절이 키워드DB에 등록된 키워드인지 판단하는 끝음절 제거 중어절 키워드 판단부를 포함하는 것을 특징으로 한다. 본 발명의 또 다른 일 실시예에 따르면, 본 발명의 인공지능 키워드 등록 장치는, 상기 중어절 추출부는 상기 검색식이 n개(n은 2 이상의 자연수)의 어절로 이루어져 n-1개의 스페이스를 가지는 경우에, 읽는 방향에서 처음 부터 2개의 어절을 상기 중어절로 추출하되, 중어절 추출의 재수행 시 직전에 추출된 중어절의 후어절을 다음에 추출된 중어절의 전어절이 되도록 중어절을 추출하며, 상기 검색식에 대해 n-1개의 중어절이 추출되었는지 판단 하고, 아닌 경우 상기 중어절 추출부에 의한 중어절 추출의 재수행이 진행되도록 해주는 중어절 추출완료 판단 부를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 전술한 구성을 통해 다음과 같은 효과를 가진다. 본 발명은 입력된 검색식으로부터 키워드의 등록 및 확장이 효율적으로 수행될 수 있게 해주는 인공지능 키워드 등록 방법 및 장치를 제공하는 효과가 있다. 본 발명은 검색식에서 중어절을 추출하여 추출된 중어절이 키워드DB(Data Base)에 등록된 키워드인지 판단하고, 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에 포함된 전어절과 후어절이 각각 키워 드DB에 등록된 키워드인지 판단하여, 상기 전어절과 상기 후어절이 모두 키워드DB에 등록된 키워드로 판단된 경 우 상기 전어절과 상기 후어절로 이루어진 중어절이 키워드DB에 키워드로 등록될 수 있게 해주는 인공지능 키워 드 등록 방법 및 장치를 제공하는 효과를 보여준다. 본 발명은 상기 전어절과 상기 후어절 중 어느 하나 이상이 키워드DB에 등록되어 있지 않은 것으로 판단된 경우 해당 전어절 및/또는 후어절을 분석대상어절로 하여, 상기 분석대상어절을 전절단어와 후절단어로 분리하였을 때, 상기 전절단어와 후절단어가 모두 키워드DB에 등록된 키워드로 판단되는 경우가 존재할 경우 해당 분석대상 어절이 키워드DB에 등록될 수 있게 해주는 인공지능 키워드 등록 방법 및 장치를 제공하는 효과를 나타낸다. 본 발명은 검색식에서 추출된 중어절의 끝음절이 비키워드로 판단된 경우 이를 제거하고 중어절에 대한 키워드 DB 등록여부의 판단 및 키워드DB 등록을 위한 절차가 수행될 수 있어 효율적인 키워드 등록이 이루어질 수 있게 해주는 인공지능 키워드 등록 방법 및 장치를 제공하는 효과를 가진다. 본 발명은 검색식에서 추출 가능한 모든 중어절에 대해 키워드DB 등록여부의 판단 및 키워드DB 등록을 위한 절 차가 수행될 수 있어 효과적인 키워드 등록이 이루어질 수 있게 해주는 인공지능 키워드 등록 방법 및 장치를제공하는 효과를 준다."}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명에 따른 인공지능 키워드 등록 방법 및 장치를 첨부된 도면을 참조하여 상세히 설명한다. 특"}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "별한 정의가 없는 한 본 명세서의 모든 용어는 본 발명이 속하는 기술분야의 통상의 지식을 가진 기술자가 이해 하는 당해 용어의 일반적 의미와 동일하고 만약 본 명세서에 사용된 용어의 의미와 충돌하는 경우에는 본 명세 서에 사용된 정의에 따른다. 또한, 본 발명의 요지를 불필요하게 흐릴 수 있는 공지 기능 및 구성에 대해 상세 한 설명은 생략한다. 도 1에는 본 발명의 일 실시예에 따른 인공지능 키워드 등록 방법의 순서도가 도시되어 있다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 인공지능 키워드 등록 방법은 중어절 추출단계(S1), 중어절 키워 드 판단단계(S2), 전후어절 분리단계(S4), 전후어절 키워드 판단단계(S5), 중어절 키워드 등록단계(S6), 전후어 절 키워드 등록단계(S7)를 포함한다. 상기 중어절 추출단계(S1)는 검색식에서 중어절을 추출하는 단계이다. 상기 검색식은 인터넷, 인트라넷 등의 검 색을 위해 검색창에 입력된 검색어를 의미한다. 상기 검색식은 2 이상의 어절을 포함할 수 있으며, 조사 등이 포함된 비정형적인 데이터일 수 있다. 또한, 중어절은 스페이스에 의해 연결된 2개의 어절을 의미한다. 여기서, 어절은 문장을 구성하는 각각의 마디로서, 띄어쓰기 즉, 스페이스의 단위가 되는 단위를 말한다. 상기 중어절 추출단계(S1)는 상기 검색식이 n개(n은 2 이상의 자연수)의 어절로 이루어져 n-1개의 스페이스를 가지는 경우에, 읽는 방향에서 처음부터 2개의 어절을 상기 중어절로 추출하되, 재수행 시 직전에 추출된 중어 절의 두번째 어절 즉, 후어절을 다음에 추출된 중어절의 첫번째 어절 즉, 전어절이 되도록 추출하는 방식으로 수행될 수 있다. 구체적인 예를 들면, \"보조전원 공급기 제어 회로는\"과 같은 문장이 상기 검색식이 될 수 있다. 이때, 상기 중 어절 추출단계(S1)는 \"보조전원 공급기\"가 중어절로 추출되는 방식으로 진행될 수 있으며, 더 나아가 상기 중어 절 추출단계(S1)의 재수행이 진행될 경우 \"공급기 제어\", \"제어 회로는\"이 순차적으로 중어절로 추출되도록 할 수 있다. 상기 중어절 키워드 판단단계(S2)는 추출된 중어절이 키워드DB(Data Base)에 등록된 키워드인지 판단하는 단계"}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이다. 상기 키워드는 검색 대상이 되는 콘텐츠의 내용 또는 제목 내의 중요한 내용을 요약한 핵심적인 단어 또 는 문구를 의미하고, 상기 키워드DB는 이러한 키워드가 저장된 DB를 의미한다. 상기 중어절 키워드 판단단계 (S2)는 추출된 중어절이 상기 키워드DB에 키워드로 저장되어 있는지 판단함으로써 추출된 중어절이 상기 키워드DB에 등록될 필요가 있는 키워드인지에 관해 일차적인 검토가 수행되도록 해준다. 상기 중어절 키워드 판단단계(S2)에서의 판단 결과 추출된 중어절이 상기 키워드DB에 키워드로 등록되어 있다면, 추출된 중어절을 상기 키워드DB에 새롭게 등록할 필요가 없으므로 절차는 종료된다. 반면, 판단 결과 추출된 중어절이 상기 키워드DB에 키워드로 등록되어 있지 않다면, 다음 단계로 절차가 진행된다. 상기 중어절 키워드 판단단계(S2)에서 추출된 중어절로 \"보조전원 공급기\"가 주어졌을 때, 상기 키워드DB에 등 록된 키워드 중 \"보조전원 공급기\"가 이미 존재한다면, \"보조전원 공급기\"에 대한 키워드 등록이 필요하지 않으 므로 절차는 종료되고, 상기 키워드DB에 등록된 키워드 가운데 \"보조전원 공급기\"가 존재하지 않을 경우 다음 단계로의 진행이 이루어진다. 상기 전후어절 분리단계(S4)는 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절을 스페이 스를 기준으로 전어절과 후어절로 분리하는 단계이다. 전술한 바와 같이 중어절은 스페이스에 의해 연결된 2개 의 어절을 의미하는데, 중어절은 스페이스를 기준으로 읽는 방향에서 스페이스 전에 나오는 어절과 스페이스 후 에 나오는 어절로 이루어져 있는데, 본 발명에서는 전자를 전어절이라 하고 후자를 후어절이라 한다. 상기 전후어절 분리단계(S4)는 추출된 중어절을 이와 같이 전어절과 후어절로 분리하여 줌으로써 이어지는 단계 에서 전어절과 후어절 각각에 대한 키워드DB 등록여부 등의 판단이 이루어질 수 있게 해준다. 상기 전후어절 분리단계(S4)는 추출된 중어절로 \"보조전원 공급기\"가 주어졌을 때, 이를 전어절인 \"보조전원\"과 후어절인 \"공급기\"로 분리하는 방식으로 수행된다. 상기 전후어절 키워드 판단단계(S5)는 상기 전어절과 상기 후어절이 각각 키워드DB에 등록된 키워드인지 판단하 는 단계이다. 추출된 중어절은 상기 키워드DB에 등록되어 있지 않지만, 추출된 중어절을 구성하는 전어절과 후 어절은 개별적으로 상기 키워드DB에 키워드로 등록되어 있을 수 있다. 상기 전후어절 키워드 판단단계(S5)는 이 를 확인하는 단계이다. 상기 전후어절 키워드 판단단계(S5)는 추출된 중어절이 \"보조전원 공급기\"이고, 상기 전후어절 분리단계(S4)에 서 \"보조전원 공급기\"가 전어절인 \"보조전원\"과 후어절인 \"공급기\"로 분리되었을 때, 전어절인 \"보조전원\"과 후 어절인 \"공급기\"가 각각 상기 키워드DB에 등록된 키워드인지 판단하는 방식으로 수행된다. 상기 중어절 키워드 등록단계(S6)는 상기 전어절과 상기 후어절이 모두 키워드DB에 등록된 키워드로 판단된 경 우 상기 전어절과 상기 후어절로 이루어진 중어절을 키워드DB에 키워드로 등록하는 단계이다. 추출된 중어절 전 체로는 상기 키워드DB에 키워드로 등록되어 있지 않지만, 추출된 중어절을 이루는 전어절 및 후어절이 모두 상 기 키워드DB에 키워드로 등록되어 있을 경우 추출된 중어절 역시 하나의 키워드로서의 의미와 가치를 가진다고 볼 수 있으므로 상기 중어절 키워드 등록단계(S6)를 통해 상기 키워드DB에 키워드로 등록하는 것이다. 상기 중어절 키워드 등록단계(S6)를 통해 추출된 중어절이 이와 같이 상기 키워드DB에 키워드로 등록될 경우 상 기 키워드DB를 통한 검색효율과 성능이 향상된다. 해당 중어절이 하나의 키워드로 상기 키워드DB에 등록된 이후 에 해당 중어절이 검색식으로 입력된다면, 노이즈가 제거된 정확한 검색결과가 제공될 수 있게 되기 때문이다. 상기 전후어절 키워드 판단단계(S5)에서 전어절인 \"보조전원\"과 후어절인 \"공급기\"에 대해 상기 키워드DB에 등 록된 키워드인지 판단되었고, 그 결과 \"보조전원\" 및 \"공급기\"가 각각 개별적으로 상기 키워드DB에 등록된 키워 드로 판단된 경우, 상기 중어절 키워드 등록단계(S6)를 통해서 \"보조전원 공급기\"가 하나의 키워드로 상기 키워 드DB에 등록된다. 상기 전후어절 키워드 등록단계(S7)는 상기 전후어절 키워드 판단단계에서 상기 전어절과 상기 후어절 중 어느 하나 이상이 키워드DB에 등록되어 있지 않은 것으로 판단된 경우 해당 전어절 및/또는 후어절을 분석대상어절로 하여, 상기 분석대상어절을 키워드DB에 등록하는 단계이다. 상기 전후어절 키워드 등록단계(S7)는 상기 분석대상어절을 전절단어와 후절단어로 분리하고, 상기 전절단어 및 상기 후절단어가 각각 키워드DB에 등록된 키워드인지 판단하되, 상기 분석대상어절에서 도출 가능한 모든 전절단어와 후절단어의 조합에 대하여 판단하여 상기 전절단어 및 상기 후절단어가 모두 키워드DB에 등록된 키워드 로 판단되는 조합이 하나 이상 있는 경우 해당 분석대상어절을 키워드DB에 등록하는 방식으로 수행될 수 있다. 도 2에는 상기 전후어절 키워드 등록단계(S7)의 순서도가 나타나 있다. 이를 참조하면, 상기 전후어절 키워드 등록단계(S7)는 분석대상어절 분리단계(S71), 전후절단어 키워드 판단단계(S72), 분석대상어절 키워드 등록단계 (S73), 분석대상어절 후보키워드 등록단계(S74) 및 분석대상어절 분리완료 판단단계(S75)를 포함할 수 있다. 상기 분석대상어절 분리단계(S71)는 상기 분석대상어절을 전절단어와 후절단어로 분리하는 단계이다. 상기 분석 대상어절은 추출된 중어절에 포함된 전어절이나 후어절 또는 전어절과 후어절 모두가 될 수 있다. 또한, 상기 분석대상어절을 임의의 음절과 음절 사이를 기준으로 분리하였을 때 읽는 방향에서 앞의 것이 전절단어 뒤의 것 이 후절단어가 된다. 상기 분석대상어절 분리단계(S71)는 상기 분석대상어절이 m음절(m은 2 이상의 자연수)로 이루어져 음절사이의 경계가 m-1개인 경우에, m-1번째 경계를 기준으로 상기 분석대상어절을 전절단어와 후절단어로 분리하되, 재수 행 시 상기 경계를 하나씩 앞으로 바꾸어 가며 상기 분석대상어절을 전절단어와 후절단어로 분리하는 방식으로 수행될 수 있다. 상기 전후어절 키워드 판단단계(S5)에서 전어절인 \"보조전원\"과 후어절인 \"공급기\"에 대해 상기 키워드DB에 등 록된 키워드인지 판단되었고, 그 결과 후어절인 \"공급기\"는 상기 키워드DB에 키워드로 등록되어 있지만 전어절 인 \"보조전원\"은 상기 키워드DB에 키워드로 등록되어 있지 않은 것으로 판단된 경우, 상기 분석대상어절 분리단 계(S71)는 \"보조전원\"을 상기 분석대상어절로 하여 진행된다. 상기 분석대상어절이 \"보조전원\"이라면, 상기 분석대상어절은 음절과 음절 사이 즉, \"보\"와 \"조\" 사이, \"조\"와 \"전\" 사이, \"전\"과 \"원\" 사이에 3개의 경계를 가지는데, 이들을 순서대로 첫번째, 두번째 및 세번째 경계라고 할 때, \"보조전원\"의 전절단어와 후절단어로의 분리는, \"보조전\"과 \"원\", \"보조\"와 \"전원\", \"보\"와 \"조전원\" 등 과 같이 3가지의 조합으로 이루어질 수 있다. 이때, 상기 분석대상어절 분리단계(S71)는 일차적으로는 세번째 경계인 \"전\"과 \"원\" 사이를 기준으로 상기 분석 대상어절을 \"보조전\"을 전절단어로 \"원\"을 후절단어로 하여 분리하고, 반복 수행이 이루어질 경우 \"보조\"와 \"전 원\", \"보\"과 \"조전원\" 등과 같은 나머지 조합으로 전절단어와 후절단어로의 분리가 수행되도록 진행될 수 있다. 상기 전후절단어 키워드 판단단계(S72)는 상기 전절단어 및 상기 후절단어가 각각 키워드DB에 등록된 키워드인 지 판단하는 단계이다. 예를 들어, 상기 전절단어가 \"보조전\"이고, 상기 후절단어가 \"원\"인 경우 \"보조전\"과 \" 원\"이 각각 상기 키워드DB에 등록된 키워드인지 판단한다. 상기 분석대상어절 키워드 등록단계(S73)는 상기 전절단어 및 상기 후절단어가 모두 키워드DB에 등록된 키워드 로 판단된 경우 상기 분석대상어절을 키워드DB에 키워드로 등록하는 단계이다. 예를 들어, 상기 전후절단어 키 워드 판단단계(S72)에서 전절단어인 \"보조전\"과, 후절단어인 \"원\"이 각각 상기 키워드DB에 등록된 키워드로 판 단된 경우 분석대상어절인 \"보조전원\"을 상기 키워드DB에 키워드로 등록한다. 상기 분석대상어절 후보키워드 등록단계(S74)는 상기 전절단어 및 상기 후절단어 중 어느 하나 이상이 키워드DB 에 등록된 키워드로 판단되지 않은 경우 상기 분석대상어절을 후보키워드DB에 후보키워드로 등록하는 절차이다. 상기 후보키워드DB는 향후 키워드 등록 여부에 대한 추가적인 판단이 필요한 분석대상어절들을 저장하는 DB이다. 상기 분석대상어절 후보키워드 등록단계(S74)는 필요에 따라서는 진행되지 않을 수 있으며, 상기 전후절단어 키 워드 판단단계(S72)에서 상기 전절단어 및 상기 후절단어 중 어느 하나 이상이 키워드DB에 등록된 키워드로 판 단되지 않은 경우 별도의 후보키워드 등록 없이 후술하는 분석대상어절 분리완료 판단단계(S75)가 진행되도록 할 수도 있다.상기 분석대상어절 분리완료 판단단계(S75)는 상기 분석대상어절 키워드 등록단계(S73) 후, 상기 분석대상어절 의 분리가 상기 분석대상어절에서 도출 가능한 전절단어와 후절단어의 m-1개의 조합에 대해 이루어졌는지 판단 하고, 아닌 경우 상기 분석대상어절 분리단계의 재수행이 진행되도록 해주는 단계이다. 상기 분석대상어절 분리 완료 판단단계(S75)는 상기 분석대상어절 후보키워드 등록단계(S74) 이후에 이루어질 수도 있다. 전술한 바와 같이 상기 분석대상어절이 \"보조전원\"이라면, 상기 분석대상어절은 음절과 음절 사이 즉, \"보\"와 \"조\" 사이, \"조\"와 \"전\" 사이, \"전\"과 \"원\" 사이에 3개의 경계를 가지는데, 이들을 순서대로 첫번째, 두번째 및 세번째 경계라고 할 때, 일차적으로 세번째 경계인 \"전\"과 \"원\" 사이를 기준으로 상기 분석대상어절을 \"보조 전\"을 전절단어로 \"원\"을 후절단어로 분리하여 위의 절차들이 진행된 경우, \"보조\"와 \"전원\", \"보\"과 \"조전원\" 등과 같은 나머지 조합에 대해서도 위의 절차들이 진행될 필요가 있다. 상기 분석대상어절 분리완료 판단단계(S75)는 상기 분석대상어절의 분리가 상기 분석대상어절에서 도출 가능한 전절단어와 후절단어의 모든 조합에 대해 이루어지지 않았다고 판단되는 경우 상기 분석대상어절 분리단계의 재 수행이 진행되도록 해줌으로써, 상기 분석대상어절에서 분리 가능한 전절단어와 후절단어의 모든 조합에 대하여 상기 전후어절 키워드 등록단계(S7)가 수행될 수 있게 해준다. 도 3에는 본 발명의 다른 일 실시예에 따른 인공지능 키워드 등록 방법의 순서도가 도시되어 있다. 도 3에 나타 난 인공지능 키워드 등록 방법은 도 1의 실시예와 비교하여 중어절 추출완료 판단단계(S8)를 더 포함하고 있으 며, 나머지는 동일하다. 따라서, 도 3과 관련해서는 상기 중어절 추출완료 판단단계(S8)에 대해서만 설명한다. 상기 중어절 추출완료 판단단계(S8)는 상기 중어절 키워드 등록단계(S6) 또는 상기 전후어절 키워드 등록단계 (S7) 후에, 상기 검색식에 대해 추출가능한 모든 중어절이 추출되었는지 판단하고, 그렇지 않은 경우 상기 중어 절 추출단계(S1)의 재수행이 진행되도록 해주는 단계이다. 전술한 바와 같이 상기 중어절 추출단계(S1)는 상기 검색식이 n개(n은 2 이상의 자연수)의 어절로 이루어져 n-1 개의 스페이스를 가지는 경우에, 읽는 방향에서 처음부터 2개의 어절을 상기 중어절로 추출하되, 재수행 시 직 전에 추출된 중어절의 후어절을 다음에 추출된 중어절의 전어절이 되도록 추출하도록 진행될 수 있는데, 이때 상기 중어절 추출완료 판단단계(S8)은 상기 검색식에서 n-1개의 중어절이 추출되었는지 판단하고, 아닌 경우 상 기 중어절 추출단계(S1)의 재수행이 진행되도록 해준다. 앞서 살펴본 예와 같이, 상기 검색식이 \"보조전원 공급기 제어 회로는\"과 같이 주어졌을 때, 상기 검색식으로부 터 추출 가능한 중어절은 \"보조전원 공급기\", \"공급기 제어\", \"제어 회로는\" 등인데, 상기 중어절 추출완료 판 단단계(S8)를 통해 상기 검색식으로부터 추출 가능한 모든 중어절에 대하여 본 발명의 인공지능 키워드 등록 방 법이 수행될 수 있게 된다. 도 4에는 본 발명의 또 다른 일 실시예에 따른 인공지능 키워드 등록 방법의 순서도가 도시되어 있다. 도 4에 나타난 인공지능 키워드 등록 방법은 도 3의 실시예와 비교하여 끝음절 제거 중어절 키워드 판단단계(S3)를 더 포함하고 있으며, 나머지는 동일하다. 따라서, 도 4와 관련하여서는 상기 끝음절 제거 중어절 키워드 판단단계 (S3)를 상세히 살펴본다. 상기 끝음절 제거 중어절 키워드 판단단계(S3)는 상기 중어절 키워드 판단단계(S2)와 상기 전후어절 분리단계 (S4) 사이에, 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 비키워드인 끝음절을 제거하여 끝음절이 제거된 중어절이 키워드DB에 등록된 키워드인지 판단하는 단계이다. 앞서 살펴본 검색식이 \"보조전원 공급기 제어 회로는\"과 같이 주어진 것이 아니라 \"보조전원 공급기를 제어하는 회로는\"과 같이 주어졌고, 그 결과 상기 중어절 추출단계(S1)에서 \"보조전원 공급기를\"과 같은 중어절이 추출되 었다고 하면, \"공급기를\"에 포함된 조사인 \"를\" 때문에 전체적인 절차가 정확하게 수행될 수 없게 된다. \"를\"과 같은 조사는 상기 키워드DB에 등록되는 키워드가 아니기 때문이다.상기 끝음절 제거 중어절 키워드 판단단계(S3)는 이와 같은 경우에 있어, 인공지능 키워드 등록의 효율적인 진 행을 위하여 추출된 중어절에서 비키워드인 \"를\"이 제거된 상태로 절차가 이루어질 수 있게 해준다. 도 5에는 상기 끝음절 제거 중어절 키워드 판단단계의 순서도가 도시되어 있다. 도 5를 참조하면, 상기 끝음절 제거 중어절 키워드 판단단계(S3)는 끝음절 분리단계(S31), 비키워드 판단단계(S32), 끝음절 제거단계(S33) 및 끝음절 제거 중어절 키워드 판단단계(S34)를 포함할 수 있다. 상기 끝음절 분리단계(S31)은 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 끝음 절을 분리하는 단계이다. 예를 들어, 추출된 중어절이 \"보조전원 공급기를\"인 경우 읽는 방향에서의 끝음절인 \"를\"을 분리한다. 상기 비키워드 판단단계(S32)는 분리된 끝음절이 비키워드DB에 등록된 비키워드인지 판단하고, 아닌 경우 상기 전후어절 분리단계(S4)가 진행되도록 해주는 단계이다. 상기 비키워드DB는 검색과정에서 키워드로 보기 어려운, \"을\", \"를\" 등과 같은 각종 조사 등을 비키워드로 등록해놓은 DB이다. 만약, 상기 비키워드 판단단계(S32)에서 판단 결과 분리된 끝음절이 비키워드가 아닌 경우 추출된 중어절 그대로 상기 전후어절 분리단계(S4)가 진행되 게 해주며, 분리된 끝음절이 비키워드인 경우 추출된 중어절에서 비키워드인 끝음절이 제거되도록 뒤에서 설명 하는 끝음절 제거단계(S33)가 진행된다. 위의 예를 이어서 살펴보면, 상기 끝음절 분리단계(S31)에서 \"를\" 이 끝음절로 분리되었는데, \"를\"이 상기 비키 워드DB에 등록된 비키워드로 판단된 경우 상기 끝음절 제거단계(S33)가 진행되게 된다. 상기 끝음절 제거단계(S33)는 분리된 끝음절이 비키워드DB에 등록된 비키워드로 판단된 경우 이를 추출된 중어 절에서 제거하는 단계이다. 즉, 상기 끝음절 분리단계(S31)에서 \"보조전원 공급기를\"의 끝음절인 \"를\"의 분리가 이루어지고, 상기 비키워드 판단단계(S32)에서 \"를\"이 상기 비키워드DB에 등록된 비키워드로 판단된 경우 상기 끝음절 제거단계(S33)를 통해 중어절 \"보조전원 공급기를\"은 \"보조전원 공급기\"로 변경된다. 상기 끝음절 제거 중어절 키워드 판단단계(S34)는 끝음절이 제거된 중어절이 키워드DB에 등록된 키워드인지 판 단하고, 아닌 경우 끝음절이 제거된 중음절을 추출된 중어절로 하여 상기 전후어절 분리단계(S4)가 진행되도록 해주는 단계이다. 추출된 중어절인 \"보조전원 공급기를\"이 상기 끝음절 제거단계(S33)를 통해 \"보조전원 공급기\"로 변경된 경우, 상기 끝음절 제거 중어절 키워드 판단단계(S34)를 통하여 \"보조전원 공급기\"가 상기 키 워드DB에 등록된 키워드인지 판단된다. 상기 끝음절 제거 중어절 키워드 판단단계(S34)에서 이루어진 판단 결과 \"보조전원 공급기\"가 상기 키워드DB에 키워드로 이미 등록되어 있다면, \"보조전원 공급기\"에 대한 키워드 등록이 필요하지 않으므로 절차는 종료되고, 상기 키워드DB에 등록된 키워드에 \"보조전원 공급기\"가 존재하지 않을 경우 다음 단계로의 진행이 이루어진다. 이상에서 설명한 본 발명의 인공지능 키워드 등록 방법은 데이터의 입력, 연산, 처리 등이 가능한 컴퓨터 장치 에 의해 수행될 수 있으며, 그 구체적인 예로 뒤에서 설명할 본 발명의 인공지능 키워드 등록 장치를 들 수 있 다. 또한, 상기 인공지능 키워드 등록 방법의 실시를 위하여 상기 인공지능 키워드 등록 방법의 각 단계들이 컴 퓨터 장치에서 실행될 수 있게 해주는 프로그램이 저장된 저장매체가 사용될 수도 있다. 도 6에는 본 발명의 일 실시예에 따른 인공지능 키워드 등록 장치의 구성도가 도시되어 있다. 도 6을 참조하면, 본 발명의 일 실시예에 따른 인공지능 키워드 등록 장치는 중어절 추출부, 중어절 키워드 판단부, 끝음절 제거 키워드 판단부, 전후어절 분리부, 전후어절 키워드 판단부, 중어절 키워드 등록부, 전후어절 키워드 등록부, 중어절 추출완료 판단부, 키워드DB, 비키워드DB 및 후보키워드DB를 포함할 수 있다. 이상의 구성들은 반드시 물리적으로 분리되어야 하는 구성들은 아니며, 본 발명의 구현을 위한 프로그램이 설치된 컴퓨터 장치에 일체로 이루어질 수도 있다. 상기 중어절 추출부는 검색식에서 중어절을 추출하는 부분이다. 상기 검색식은 위에서 설명한 바와 같이, 인 터넷, 인트라넷 등의 검색을 위해 검색창에 입력된 검색어를 의미하며, 2 이상의 어절을 포함할 수 있으며, 조 사 등이 포함된 비정형적인 데이터일 수 있다. 또한, 중어절은 스페이스에 의해 연결된 2개의 어절을 의미한다. 상기 중어절 추출부는 상기 검색식이 n개(n은 2 이상의 자연수)의 어절로 이루어져 n-1개의 스페이스를 가지 는 경우에, 읽는 방향에서 처음부터 2개의 어절을 상기 중어절로 추출하되, 중어절 추출의 재수행 시 재수행 시 직전에 추출한 중어절의 두번째 어절 즉, 후어절을 다음에 추출한 중어절의 첫번째 어절 즉, 전어절이 되도록 추출할 수 있다. 위에서 살펴본 바와 같이 상기 검색식이 \"보조전원 공급기를 제어하는 회로는\"과 같은 문장이라고 할 때, 상기 중어절 추출부는 \"보조전원 공급기를\"을 중어절로 추출할 수 있으며, 더 나아가 중어절 추출을 재수행할 경 우 \"공급기를 제어하는\", \"제어하는 회로는\"을 순차적으로 중어절로 추출할 수 있다. 상기 중어절 키워드 판단부는 상기 중어절 추출부가 추출한 중어절이 키워드DB(Data Base, 10)에 등록된 키워드인지 판단하는 부분이다. 상기 중어절 키워드 판단부는 추출된 중어절이 키워드DB에 등록된 키워"}
{"patent_id": "10-2017-0062370", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "드인지 판단하는데, 상기 키워드DB는 검색 대상이 되는 콘텐츠의 내용 또는 제목 내의 중요한 내용을 요약 한 핵심적인 단어 또는 문구인 키워드가 저장된 DB를 의미한다. 상기 중어절 키워드 판단부는 추출된 중어절 이 상기 키워드DB에 키워드로 저장되어 있는지 판단함으로써 추출된 중어절이 상기 키워드DB에 등록될 필요가 있는 키워드인지에 관해 일차적인 검토가 수행되도록 해준다. 상기 중어절 추출부가 추출한 중어절이 \"보조전원 공급기를\"이라고 할 때, 상기 중어절 키워드 판단부는 \"보조전원 공급기를\"이 상기 키워드DB에 키워드로 등록되어 있는지 판단한다. 상기 끝음절 제거 중어절 키워드 판단부는 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출 된 중어절에서 비키워드인 끝음절을 제거하여 끝음절이 제거된 중어절이 키워드DB에 등록된 키워드인지 판 단하는 부분이다. 도 7에는 상기 끝음절 제거 중어절 키워드 판단부의 구성도가 도시되어 있다. 이를 참조하면, 상기 끝음절 제거 중어절 키워드 판단부는 끝음절 분리부, 비키워드 판단부, 끝음절 제거부 및 끝음절 제거 중어절 키워드 판단부를 포함할 수 있다. 상기 끝음절 분리부는 상기 중어절 키워드 판단부의 판단 결과 추출된 중어절이 키워드DB에 등록된 키워드가 아닌 경우 추출된 중어절에서 끝음절을 분리하는 역할을 수행한다. 위의 예에서 추출된 중어절은 \"보 조전원 공급기를\"과 같은데, 해당 중어절은 조사 \"를\"을 포함하고 있어 정확한 키워드 판단이 어렵다. 상기 끝 음절 분리부는 추출된 중어절 \"보조전원 공급기를\"에서 끝음절인 \"를\"을 분리하여 준다. 상기 비키워드 판단부는 상기 끝음절 분리부가 분리한 끝음절이 비키워드DB에 등록된 비키워드인지 판단하는 부분이다. 상기 비키워드DB는 검색과정에서 키워드로 보기 어려운, \"을\", \"를\" 등과 같은 각종 조 사 등을 비키워드로 등록해놓은 DB이다. 만약, 상기 비키워드 판단부의 판단 결과 분리된 끝음절이 비키워 드가 아닌 경우 추출된 중어절 그대로 상기 전후어절 분리부에 의한 전후어절 분리가 수행되며, 분리된 끝음 절이 비키워드인 경우 상기 끝음절 제거부가 추출된 중어절에서 비키워드인 끝음절을 제거하여 준다. 위의 예를 이어서 살펴보면, 상기 끝음절 분리부가 \"를\"을 끝음절로 분리하였는데, 상기 비키워드 판단부 가 \"를\"을 상기 비키워드DB에 등록된 비키워드로 판단한 경우 상기 끝음절 제거부에 의한 끝음절 제거가 수행된다.상기 끝음절 제거부는 상기 비키워드 판단부의 판단 결과 분리된 끝음절이 비키워드DB에 등록된 비 키워드로 판단된 경우 이를 추출된 중어절에서 제거하는 부분이다. 즉, 상기 끝음절 분리부가 \"보조전원 공 급기를\"의 끝음절인 \"를\"을 분리하고, 상기 비키워드 판단부가 \"를\"을 상기 비키워드DB에 등록된 비키 워드로 판단한 경우 상기 끝음절 제거부는 중어절 \"보조전원 공급기를\"을 \"보조전원 공급기\"로 변경한다. 상기 끝음절 제거 중어절 키워드 판단부는 상기 끝음절 제거부가 끝음절을 제거한 중어절이 키워드 DB에 등록된 키워드인지 판단하는 부분이다. 상기 끝음절 제거 중어절 키워드 판단부의 판단 결과 끝음 절이 제거된 중어절이 상기 키워드DB에 등록된 키워드가 아닌 경우 상기 전후어절 분리부는 끝음절이 제 거된 중음절을 추출된 중어절로 하여 전후어절의 분리를 수행한다. 상기 끝음절 제거부가 중어절을 \"보조전원 공급기\"로 변경한 경우, 상기 끝음절 제거 중어절 키워드 판단부 는 \"보조전원 공급기\"가 상기 키워드DB에 등록된 키워드인지 판단한다. 상기 끝음절 제거 중어절 키워 드 판단부의 판단 결과 \"보조전원 공급기\"가 상기 키워드DB에 키워드로 이미 등록되어 있다면, \"보조전 원 공급기\"에 대한 키워드 등록이 필요하지 않으므로 절차는 종료되고, 상기 키워드DB에 등록된 키워드에 \"보조전원 공급기\"가 존재하지 않을 경우 상기 전후어절 분리부에 의한 전후어절의 분리가 수행된다. 상기 전후어절 분리부는 상기 중어절 키워드 판단부의 판단 결과 추출된 중어절이 키워드DB에 등록된 키워드 가 아닌 경우 추출된 중어절을 스페이스를 기준으로 전어절과 후어절로 분리하는 부분이다. 위에서 설명한 바와 같이, 중어절은 스페이스에 의해 연결된 2개의 어절을 의미하는데, 중어절은 스페이스를 기준으로 읽는 방향에 서 스페이스 전에 나오는 어절과 스페이스 후에 나오는 어절로 이루어져 있는데, 본 발명에서는 전자를 전어절 이라고 하고 후자를 후어절이라 한다. 상기 전후어절 분리부는 추출된 중어절을 이와 같이 전어절과 후어절로 분리하여 줌으로써 상기 전후어절 키 워드 판단부에 의하여 전어절과 후어절 각각에 대한 키워드DB 등록여부 등의 판단이 이루어질 수 있게 해준다. 상기 전후어절 분리부는 추출된 중어절로 \"보조전원 공급기\"가 주어졌을 때, 이를 전어절인 \"보조전원\"과 후 어절인 \"공급기\"로 분리한다. 상기 전후어절 키워드 판단부는 상기 전후어절 분리부가 분리한 전어절과 후어절이 각각 키워드DB에 등록된 키워드인지 판단하는 부분이다. 추출된 중어절은 상기 키워드DB에 등록되어 있지 않지만, 추출된 중 어절을 구성하는 전어절과 후어절은 개별적으로 상기 키워드DB에 키워드로 등록되어 있을 수 있다. 상기 전 후어절 키워드 판단부는 이를 확인하는 역할을 수행한다. 상기 전후어절 키워드 판단부는 추출된 중어절이 \"보조전원 공급기\"이고, 상기 전후어절 분리부가 추출된 중어절을 전어절인 \"보조전원\"과 후어절인 \"공급기\"로 분리하였을 때, 전어절인 \"보조전원\"과 후어절인 \"공급기\"가 각각 상기 키워드DB에 등록된 키워드인지 판단한다. 상기 중어절 키워드 등록부는 상기 전후어절 키워드 판단부의 판단 결과 상기 전어절과 상기 후어절이 모 두 키워드DB에 등록된 키워드로 판단된 경우 상기 전어절과 상기 후어절로 이루어진 중어절을 키워드DB(1 0)에 키워드로 등록하는 부분이다. 추출된 중어절 전체로는 상기 키워드DB에 키워드로 등록되어 있지 않지 만, 추출된 중어절을 이루는 전어절 및 후어절이 모두 상기 키워드DB에 키워드로 등록되어 있을 경우 추출 된 중어절 역시 하나의 키워드로서의 의미와 가치를 가진다고 볼 수 있으므로 상기 중어절 키워드 등록부는 이러한 중어절을 상기 키워드DB에 키워드로 등록하는 것이다. 상기 중어절 키워드 등록부를 통해 상기 중어절이 상기 키워드DB에 키워드로 등록될 경우, 이후에 해당 중어절이 포함된 검색식이 입력된다면, 노이즈가 제거된 정확한 검색결과가 제공될 수 있게 되므로 상기 키워드 DB를 통한 검색효율과 성능이 향상된다.상기 중어절 키워드 등록부는 상기 전후어절 키워드 판단부가 전어절인 \"보조전원\"과 후어절인 \"공급기\" 에 대해 상기 키워드DB에 등록된 키워드인지 판단하였고, 그 결과 \"보조전원\" 및 \"공급기\"가 각각 개별적으 로 상기 키워드DB에 등록된 키워드로 판단한 경우, \"보조전원 공급기\"를 하나의 키워드로 상기 키워드 DB에 등록한다. 상기 전후어절 키워드 등록부은 상기 전후어절 키워드 판단부가 상기 전어절과 상기 후어절 중 어느 하나 이상이 키워드DB에 등록되어 있지 않은 것으로 판단한 경우 해당 전어절 및/또는 후어절을 분석대상어절로 하여, 상기 분석대상어절을 키워드DB에 등록하는 부분이다. 상기 전후어절 키워드 등록부는 상기 분석대상어절을 전절단어와 후절단어로 분리하고, 상기 전절단어 및 상 기 후절단어가 각각 키워드DB에 등록된 키워드인지 판단하되, 상기 분석대상어절에서 도출 가능한 모든 전 절단어와 후절단어의 조합에 대하여 판단하여 상기 전절단어 및 상기 후절단어가 모두 키워드DB에 등록된 키워드로 판단되는 조합이 하나 이상 있는 경우 해당 분석대상어절을 키워드DB에 등록할 수 있다. 도 8에는 상기 전후어절 키워드 등록부의 구성도가 나타나 있는데, 이를 참조하면, 상기 전후어절 키워드 등 록부는 분석대상어절 분리부, 전후절단어 키워드 판단부, 분석대상어절 키워드 등록부, 분석대 상어절 후보키워드 등록부 및 분석대상어절 분리완료 판단부를 포함할 수 있다. 상기 분석대상어절 분리부는 상기 분석대상어절을 전절단어와 후절단어로 분리하는 부분이다. 상기 분석대 상어절은 추출된 중어절에 포함된 전어절이나 후어절 또는 전어절과 후어절 모두가 될 수 있다. 또한, 상기 분 석대상어절을 임의의 음절과 음절 사이를 기준으로 분리하였을 때 읽는 방향에서 앞의 것이 전절단어 뒤의 것이 후절단어가 된다. 상기 분석대상어절 분리부는 상기 분석대상어절이 m음절(m은 2 이상의 자연수)로 이루어져 음절사이의 경계 가 m-1개인 경우에, m-1번째 경계를 기준으로 상기 분석대상어절을 전절단어와 후절단어로 분리하되, 재수행 시 상기 경계를 하나씩 앞으로 바꾸어 가며 상기 분석대상어절을 전절단어와 후절단어로 분리할 수 있다. 상기 전후어절 키워드 판단부가 전어절인 \"보조전원\"과 후어절인 \"공급기\"에 대해 상기 키워드DB에 등록 된 키워드인지 판단하였고, 그 결과 후어절인 \"공급기\"는 상기 키워드DB에 키워드로 등록되어 있지만 전어 절인 \"보조전원\"은 상기 키워드DB에 키워드로 등록되어 있지 않은 것으로 판단한 경우, 상기 분석대상어절 분리부는 \"보조전원\"을 상기 분석대상어절로 하여 전후어절의 분리를 수행한다. 상기 분석대상어절이 \"보조전원\"이라면, 상기 분석대상어절은 음절과 음절 사이 즉, \"보\"와 \"조\" 사이, \"조\"와 \"전\" 사이, \"전\"과 \"원\" 사이에 3개의 경계를 가지는데, 이들을 순서대로 첫번째, 두번째 및 세번째 경계라고 할 때, \"보조전원\"의 전절단어와 후절단어로의 분리는, \"보조전\"과 \"원\", \"보조\"와 \"전원\", \"보\"와 \"조전원\" 등 과 같이 3가지의 조합으로 이루어질 수 있다. 이때, 상기 분석대상어절 분리부는 일차적으로는 세번째 경계인 \"전\"과 \"원\" 사이를 기준으로 상기 분석대 상어절을 \"보조전\"을 전절단어로 \"원\"을 후절단어로 하여 분리하고, 반복 수행이 이루어질 경우 \"보조\"와 \"전원\", \"보\"과 \"조전원\" 등과 같은 나머지 조합으로 전절단어와 후절단어로의 분리를 수행할 수 있다. 상기 전후절단어 키워드 판단부는 상기 분석대상어절 분리부가 분리한 전절단어 및 후절단어가 각각 키 워드DB에 등록된 키워드인지 판단하는 부분이다. 예를 들어, 상기 전후절단어 키워드 판단부는 상기 전 절단어가 \"보조전\"이고, 상기 후절단어가 \"원\"인 경우 \"보조전\"과 \"원\"이 각각 상기 키워드DB에 등록된 키 워드인지 판단한다. 상기 분석대상어절 키워드 등록부는 상기 전후절단어 키워드 판단부의 판단 결과 상기 전절단어 및 상 기 후절단어가 모두 키워드DB에 등록된 키워드로 판단된 경우 상기 분석대상어절을 키워드DB에 키워드 로 등록하는 부분이다. 예를 들어, 상기 전후절단어 키워드 판단부가 전절단어인 \"보조전\"과, 후절단어인 \"원\"을 각각 상기 키워드DB에 등록된 키워드로 판단한 경우 분석대상어절인 \"보조전원\"을 상기 키워드 DB에 키워드로 등록한다. 상기 분석대상어절 후보키워드 등록부 상기 전절단어 및 상기 후절단어 중 어느 하나 이상이 키워드DB 에 등록된 키워드로 판단되지 않은 경우 상기 분석대상어절을 후보키워드DB에 후보키워드로 등록하는 절차 이다. 상기 후보키워드DB는 향후 키워드 등록 여부에 대한 추가적인 판단이 필요한 분석대상어절들을 저장 하는 DB이다. 상기 분석대상어절 후보키워드 등록부는 필요에 따라서는 상기 전후어절 키워드 등록부에 포함되지 않을 수도 있으며, 상기 전절단어 및 상기 후절단어 중 어느 하나 이상이 키워드DB에 등록된 키워드로 판단되지 않은 경우 별도의 후보키워드 등록없이 절차가 종료되도록 할 수도 있다. 상기 분석대상어절 후보키워드 등록단계(S74)는 필요에 따라서는 상기 전후어절 키워드 등록부에 포함되지 않을 수도 있으며, 상기 전절단어 및 상기 후절단어 중 어느 하나 이상이 키워드DB에 등록된 키워드로 판단 되지 않은 경우 별도의 후보키워드 등록 없이 후술하는 뒤에서 설명하는 분석대상어절 분리완료 판단부에 의한 판단이 수행되도록 할 수도 있다. 상기 분석대상어절 분리완료 판단부는 상기 분석대상어절의 분리가 상기 분석대상어절에서 도출 가능한 전 절단어와 후절단어의 m-1개의 조합에 대해 이루어졌는지 판단하고, 아닌 경우 상기 분석대상어절 분리부에 의한 상기 분석대상어절의 분리의 재수행이 진행되도록 해주는 부분이다. 전술한 바와 같이 상기 분석대상어절이 \"보조전원\"이라면, 상기 분석대상어절은 음절과 음절 사이 즉, \"보\"와 \"조\" 사이, \"조\"와 \"전\" 사이, \"전\"과 \"원\" 사이에 3개의 경계를 가지는데, 이들을 순서대로 첫번째, 두번째 및 세번째 경계라고 할 때, 일차적으로 세번째 경계인 \"전\"과 \"원\" 사이를 기준으로 상기 분석대상어절을 \"보조 전\"을 전절단어로 \"원\"을 후절단어로 분리하여 위의 판단들이 진행된 경우, \"보조\"와 \"전원\", \"보\"과 \"조전원\" 등과 같은 나머지 조합에 대해서도 위의 판단들이 진행될 필요가 있다. 상기 분석대상어절 분리완료 판단부는 상기 분석대상어절의 분리가 상기 분석대상어절에서 도출 가능한 전 절단어와 후절단어의 모든 조합에 대해 이루어지지 않았다고 판단한 경우 상기 분석대상어절 분리부에 의한 상기 분석대상어절의 분리가 재수행되도록 해줌으로써, 상기 전후어절 키워드 등록부가 상기 분석대상어절에 서 분리 가능한 전절단어와 후절단어의 모든 조합에 대하여 전후어절 키워드 등록을 수행할 수 있게 해준다. 상기 중어절 추출완료 판단부은 상기 검색식에 대해 n-1개의 중어절이 추출되었는지 판단하고, 아닌 경우 상 기 중어절 추출부에 의한 중어절 추출의 재수행이 진행되도록 해주는 부분이다. 앞에서 살펴본 바와 같이, 상기 중어절 추출부는 상기 검색식이 n개(n은 2 이상의 자연수)의 어절로 이루어 져 n-1개의 스페이스를 가지는 경우에, 읽는 방향에서 처음부터 2개의 어절을 상기 중어절로 추출하고, 중어절 추출의 재수행 시 직전에 추출된 중어절의 후어절을 다음에 추출된 중어절의 전어절이 되도록 추출할 수 있다. 이때 상기 중어절 추출완료 판단부은 상기 검색식에서 n-1개의 중어절이 추출되었는지 판단하고, 아닌 경우 상기 중어절 추출부에 의한 중어절의 추출이 재수행 되도록 해준다. 앞서 살펴본 예와 같이, 상기 검색식이 \"보조전원 공급기를 제어하는 회로는\"과 같이 주어졌을 때, 상기 검색식 으로부터 추출 가능한 중어절은 \"보조전원 공급기를\", \"공급기를 제어하는\", \"제어하는 회로는\" 등인데, 상기 중어절 추출완료 판단부를 통해 상기 검색식으로부터 추출 가능한 모든 중어절에 대하여 본 발명이 수행될 수 있게 된다. 위에서 설명한 본 발명의 인공지능 키워드 등록 장치는 전술한 각 구성들을 컴퓨터 장치에 구현하여 주는 프로 그램이 설치된 컴퓨터 장치로 이루어질 수 있으며, 이를 위하여 상기 인공지능 키워드 등록 장치의 각 구성들이 컴퓨터 장치에서 구현될 수 있게 해주는 프로그램이 저장된 저장매체가 사용될 수도 있다.이상에서, 출원인은 본 발명의 다양한 실시예들을 설명하였지만, 이와 같은 실시예들은 본 발명의 기술적 사상 을 구현하는 일 실시예일 뿐이며, 본 발명의 기술적 사상을 구현하는 한 어떠한 변경예 또는 수정예도 본 발명 의 범위에 속하는 것으로 해석되어야 한다."}
{"patent_id": "10-2017-0062370", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 키워드 등록 방법의 순서도 도 2는 도 1의 전후어절 키워드 등록단계의 순서도 도 3은 본 발명의 다른 일 실시예에 따른 인공지능 키워드 등록 방법의 순서도 도 4는 본 발명의 또 다른 일 실시예에 따른 인공지능 키워드 등록 방법의 순서도 도 5는 도 4의 끝음절 제거 중어절 키워드 판단단계의 순서도 도 6은 본 발명의 일 실시예에 따른 인공지능 키워드 등록 장치의 구성도 도 7은 도 6의 끝음절 제거 중어절 키워드 판단부의 구성도 도 8은 도 6의 전후어절 키워드 등록부의 구성도"}
