{"patent_id": "10-2024-0143192", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0057678", "출원번호": "10-2024-0143192", "발명의 명칭": "UWB 통신에 기반하여 인증을 수행하기 위한 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "금지은"}}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 의해 수행되는 방법에 있어서,상기 UWB 통신을 수행하는 제2 전자 장치와 BLE(bluetooth low energy) 연결(BLE link)을 수립(establish)하는단계;상기 제2 전자 장치와 상기 수립된 BLE 연결에 기초하여 UWB 세션 정보를 교환(exchange)하는 단계;UWB 센싱 세션(sensing session)을 수행하여 상기 제1 전자 장치와 상기 제2 전자 장치의 사용자 사이의 제1 거리를 획득하는 단계;UWB 레인징 세션(ranging session)을 수행하여 상기 제1 전자 장치와 상기 제2 전자 장치 사이의 제2 거리를 획득하는 단계; 및상기 제1 거리가 제1 임계 값 미만이며, 및 상기 제2 거리가 제2 임계 값 미만인 경우, 상기 제2 전자 장치와상기 사용자의 인증(authentication) 절차를 수행하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 제2 전자 장치와 상기 BLE 연결을 수립하는 단계는:논리적 접근 서비스(logical access service)를 지원하는 장치임을 나타내는 지시자를 포함하는 BLE 광고 패킷(advertisement packet)을 방송(broadcasting)하는 단계;상기 제2 전자 장치로부터, 상기 BLE 광고 패킷에 기초하여 상기 BLE 연결의 설정을 요청하는 메시지를 수신하는 단계; 및상기 제2 전자 장치에게, 상기 BLE 연결의 설정 정보를 포함하는 응답 메시지를 송신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 제2 전자 장치와 상기 UWB 세션 정보를 교환하는 단계는:상기 제2 전자 장치와 상기 UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상(negotiation)하는 단계; 및상기 제2 전자 장치와 상기 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하는 단계를 포함하며,상기 UWB 레인징 세션에 연관된 상기 적어도 하나의 제1 파라미터를 협상하는 단계는:상기 제2 전자 장치로부터, UWB 능력(UWB capability) 정보를 포함하는 UWB 컨트롤리 정보(UWB controleeinformation) 메시지를 수신하는 단계; 및상기 제2 전자 장치에게, 상기 UWB 레인징 세션에 연관된 UWB 설정 정보를 포함하는 UWB 세션 데이터(UWBsession data) 메시지를 송신하는 단계를 포함하고, 및상기 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하는 단계는:상기 제2 전자 장치로부터, UWB 센싱 정보(UWB sensing information)를 포함하는 UWB 센싱 세션 요청 메시지를공개특허 10-2025-0057678-3-수신하는 단계; 및상기 제2 전자 장치에게, 수락(accept) 또는 선호(preferred) UWB 센싱 세션 파라미터를 포함하는 UWB 센싱 세션 응답 메시지를 송신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 UWB 센싱 세션을 수행하여 상기 제1 거리를 획득하는 단계는:상기 제2 전자 장치에게, UWB 센싱 데이터(sensing data)를 송신하는 단계;상기 제2 전자 장치로부터, 상기 UWB 센싱 데이터에 기초하여 획득한 CIR(channel impulse response) 신호를수신하는 단계; 및상기 CIR 신호에 기초하여, 상기 제1 거리를 획득하는 단계를 포함하고, 및상기 UWB 레인징 세션을 수행하여 상기 제2 거리를 획득하는 단계는, UWB DS-TWR(double-sided two-wayranging)를 이용하여 상기 제2 거리를 획득하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 UWB 센싱 세션을 수행하는 단계는:논리적 접근 프레임워크(logical access framework)로부터 UWB 서브시스템(UWB sub-system, UWBS)에게 상기UWB 센싱 세션의 시작을 지시하는 센싱 세션 시작 명령(sensing session start command) 메시지를 전달하는 단계;상기 UWB 서브시스템으로부터 상기 논리적 접근 프레임워크에게 상기 UWB 센싱 세션 시작의 성공 또는 실패 여부에 대한 상태(status)를 포함하는 센싱 세션 시작 응답(sensing session start response) 메시지를 전달하는단계;상기 UWB 센싱 세션이 진행되는 중 거리 센싱을 수행하는 라운드(round)가 종료되거나, 기설정된 조건을 만족함에 기초하여 상기 UWB 서브시스템으로부터 논리적 접근 프레임워크에게 상기 거리 센싱의 결과를 포함하는 센싱세션 정보 통지(sensing session information notification) 메시지를 전달하는 단계; 및상기 논리적 접근 프레임워크로부터 상기 UWB 서브시스템에게, 상기 센싱 세션의 종료를 지시하는 센싱 세션 종료 명령(sensing session termination command) 메시지를 전달하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 제1 전자 장치에 대하여 기설정된 기간 동안 사용자 입력이 수신되지 않음을 식별함에 기초하여:상기 제2 전자 장치와 상기 UWB 센싱 세션을 수행하여 상기 제1 거리를 획득하는 단계;상기 획득한 제1 거리가 상기 사용자 인증을 해제하기 위한 기설정된 조건을 만족하는 지를 판단하는 단계; 및상기 획득한 제1 거리가 상기 사용자 인증을 해제하기 위한 상기 기설정된 조건을 만족하는 것으로 판단함에 기초하여 상기 사용자 인증의 해제 절차를 수행하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2025-0057678-4-UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)에 의해 수행되는 방법에 있어서,상기 UWB 통신을 수행하는 제1 전자 장치와 BLE(bluetooth low energy) 연결을 수립(establish)하는 단계;상기 제1 전자 장치와 상기 수립된 BLE 연결에 기초하여 UWB 세션 정보를 교환(exchange)하는 단계;상기 제1 전자 장치와 UWB 센싱 세션(sensing session)을 수행 하는 단계;상기 제1 전자 장치와 UWB 레인징 세션(ranging session)을 수행 하는 단계; 및상기 제1 전자 장치와 사용자에 대한 인증(authentication) 절차를 수행하는 단계를 포함하고,상기 인증 절차는, 상기 제1 전자 장치와 상기 사용자 사이의 제1 거리가 제1 임계 값 미만이며, 및 상기 제1전자 장치와 상기 제2 전자 장치 사이의 제2 거리가 제2 임계 값 미만인 경우에 수행되는, 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 제1 전자 장치와 상기 BLE 연결을 수립하는 단계는:상기 제1 전자 장치가 방송(broadcasting)하며 논리적 접근 서비스(logical access service)를 지원하는 장치임을 나타내는 지시자를 포함하는 BLE 광고 패킷(advertisement packet)을 수신하는 단계;상기 제1 전자 장치에게, 상기 BLE 광고 패킷에 기초하여 상기 BLE 연결의 설정을 요청하는 메시지를 송신하는단계; 및상기 제1 전자 장치로부터, 상기 BLE 연결의 설정 정보를 포함하는 응답 메시지를 수신하는 단계를 포함하는,방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7 항에 있어서,상기 제1 전자 장치와 상기 UWB 세션 정보를 교환하는 단계는:상기 제1 전자 장치와 상기 UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상(negotiation)하는 단계; 및상기 제1 전자 장치와 상기 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하는 단계를 더 포함하며,상기 UWB 레인징 세션에 연관된 상기 적어도 하나의 제1 파라미터를 협상하는 단계는:상기 제1 전자 장치에게, UWB 능력(UWB capability) 정보를 포함하는 UWB 컨트롤리 정보(UWB controleeinformation) 메시지를 송신하는 단계; 및상기 제1 전자 장치로부터, 상기 UWB 레인징 세션에 연관된 UWB 설정 정보를 포함하는 UWB 세션 데이터(UWBsession data) 메시지를 수신하는 단계를 포함하고, 및상기 UWB 센싱 세션에 연관된 상기 적어도 하나의 제2 파라미터를 설정하는 단계는:상기 제1 전자 장치에게, UWB 센싱 정보(UWB sensing information)를 포함하는 UWB 센싱 세션 요청 메시지를송신하는 단계; 및상기 제1 전자 장치로부터, 수락(accept) 또는 선호(preferred) UWB 센싱 세션 파라미터를 포함하는 UWB 센싱세션 응답 메시지를 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2025-0057678-5-제7 항에 있어서,상기 UWB 센싱 세션을 수행 하는 단계는:상기 제1 전자 장치로부터, UWB 센싱 데이터(sensing data)를 수신하는 단계; 및상기 제1 전자 장치에게, 상기 UWB 센싱 데이터에 기초하여 획득한 CIR(channel impulse response) 신호를 송신하는 단계를 포함하고,상기 UWB 레인징 세션을 수행하는 단계는, 상기 제1 전자 장치와 UWB DS-TWR(double-sided two-way ranging)를수행 하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7 항에 있어서,상기 제1 전자 장치가 상기 제1 전자 장치에 대하여 기설정된 기간 동안 사용자 입력이 수신되지 않음을 식별함에 기초하여:상기 제1 전자 장치와 상기 UWB 센싱 세션을 수행 하는 단계;상기 제1 전자 장치와 상기 사용자 인증의 해제 절차를 수행하는 단계를 더 포함하고,상기 사용자 인증의 해제 절차를 수행하는 단계는, 상기 제1 전자 장치가 획득한 상기 제1 거리가 상기 사용자인증을 해제하기 위한 상기 기설정된 조건을 만족하는 경우에 수행되는, 방법."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 있어서,UWB 모듈;BLE(bluethooth low energy) 모듈;적어도 하나의 프로세서; 및명령어들을 저장하는 메모리를 포함하며,상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제1 전자 장치가:상기 UWB 통신을 수행하는 제2 전자 장치와 BLE(bluetooth low energy) 연결(BLE link)을수립(establish)하고,상기 제2 전자 장치와 상기 수립된 BLE 연결에 기초하여 UWB 세션 정보를 교환하고,UWB 센싱 세션(sensing session)을 수행하여, 상기 제1 전자 장치와 상기 제2 전자 장치의 사용자 사이의 제1거리를 획득하고,UWB 레인징 세션(ranging session)을 수행하여, 상기 제1 전자 장치와 상기 제2 전자 장치 사이의 제2 거리를획득하고, 및상기 제1 거리가 제1 임계 값 미만이며, 및 상기 제2 거리가 제2 임계 값 미만인 경우, 상기 제2 전자 장치와상기 사용자의 인증(authentication) 절차를 수행하도록 하는, 제1 전자 장치."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제1 전자 장치가:논리적 접근 서비스(logical access service)를 지원하는 장치임을 나타내는 지시자를 포함하는 BLE 광고 패킷공개특허 10-2025-0057678-6-(advertisement packet)을 방송(broadcasting)하고,상기 제2 전자 장치로부터, 상기 BLE 광고 패킷에 기초하여 상기 BLE 연결의 설정을 요청하는 메시지를 수신하고, 및상기 제2 전자 장치에게, 상기 BLE 연결의 설정 정보를 포함하는 응답 메시지를 송신하도록 하는, 제1 전자 장치."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12 항에 있어서,상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제1 전자 장치가:상기 제2 전자 장치와 상기 UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상(negotiation)하고,및상기 제2 전자 장치와 상기 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하도록 하되,상기 제2 전자 장치와 상기 UWB 레인징 세션에 연관된 상기 적어도 하나의 제1 파라미터를 협상하기 위하여:상기 제2 전자 장치로부터, UWB 능력(UWB capability) 정보를 포함하는 UWB 컨트롤리 정보(UWB controleeinformation) 메시지를 수신하고, 및상기 제2 전자 장치에게, 상기 UWB 레인징 세션에 연관된 UWB 설정 정보를 포함하는 UWB 세션 데이터(UWBsession data) 메시지를 송신하도록 하고,상기 제2 전자 장치와 상기 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하기 위하여:상기 제2 전자 장치로부터, UWB 센싱 정보(UWB sensing information)를 포함하는 UWB 센싱 세션 요청 메시지를수신하고, 및상기 제2 전자 장치에게, 수락(accept) 또는 선호(preferred) UWB 센싱 세션 파라미터를 포함하는 UWB 센싱 세션 응답 메시지를 송신하도록 하는, 제1 전자 장치."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12 항에 있어서,상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제1 전자 장치가:상기 UWB 센싱 세션을 수행하는 동안:상기 제2 전자 장치에게, UWB 센싱 데이터(sensing data)를 송신하고,상기 제2 전자 장치로부터, 상기 UWB 센싱 데이터에 기초하여 획득한 CIR(channel impulse response) 신호를수신하고, 및상기 CIR 신호에 기초하여, 상기 제1 거리를 획득하도록 하며, 및상기 UWB 레인징 세션을 수행하는 동안, UWB DS-TWR(double-sided two-way ranging)을 이용하여 상기 제2 거리를 획득하도록 하는, 제1 전자 장치."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12 항에 있어서,상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제1 전자 장치가:상기 제1 전자 장치에 대하여 기설정된 기간 동안 사용자 입력이 수신되지 않음을 식별함에 기초하여:공개특허 10-2025-0057678-7-상기 제2 전자 장치와 상기 UWB 센싱 세션을 수행하여 상기 제1 거리를 획득하고,상기 획득한 제1 거리가 상기 사용자 인증을 해제하기 위한 기설정된 조건을 만족하는 지를 판단하고, 및상기 획득한 제1 거리가 상기 사용자 인증을 해제하기 위한 상기 기설정된 조건을 만족하는 것으로 판단함에 기초하여 상기 사용자 인증의 해제 절차를 수행하도록 하는, 제1 전자 장치."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)에 있어서,UWB 모듈;BLE(bluethooth low energy) 모듈;적어도 하나의 프로세서; 및명령어들을 저장하는 메모리를 포함하며,상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제2 전자 장치가:상기 UWB 통신을 수행하는 제1 전자 장치와 BLE(bluetooth low energy) 연결을 수립(establish)하고,상기 제1 전자 장치와 상기 수립된 BLE 연결에 기초하여 UWB 정보를 교환(exchange)하고,상기 제1 전자 장치와 UWB 센싱 세션(sensing session)을 수행하고,상기 제1 전자 장치와 UWB 레인징 세션(ranging session)을 수행하고, 및상기 제1 전자 장치와 사용자에 대한 인증(authentication) 절차를 수행하도록 하되,상기 인증 절차는, 상기 제1 전자 장치와 상기 사용자 사이의 제1 거리가 제1 임계 값 미만이며, 및 상기 제1전자 장치와 상기 제2 전자 장치 사이의 제2 거리가 제2 임계 값 미만인 경우 수행되는, 제2 전자 장치."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서,상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제2 전자 장치가:상기 제1 전자 장치가 방송(broadcasting)하며 논리적 접근 서비스(logical access service)를 지원하는 장치임을 나타내는 지시자를 포함하는 BLE(bluetooth low energy) 광고 패킷(advertisement packet)을 수신하고,상기 제1 전자 장치에게, 상기 BLE 광고 패킷에 기초하여 상기 BLE 연결의 설정을 요청하는 메시지를 송신하고,및상기 제1 전자 장치로부터, 상기 BLE 연결의 설정 정보를 포하는 응답 메시지를 수신하도록 하는, 제2 전자 장치."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 17항에 있어서,상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제2 전자 장치가:상기 제1 전자 장치와 상기 UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상(negotiation)하고,및상기 제1 전자 장치와 상기 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하도록 하되,상기 제1 전자 장치와 상기 UWB 레인징 세션에 연관된 상기 적어도 하나의 제1 파라미터를 협상하기 위하여:공개특허 10-2025-0057678-8-상기 제1 전자 장치에게, UWB 능력(UWB capability) 정보를 포함하는 UWB 컨트롤리 정보(UWB controleeinformation) 메시지를 송신하고, 및상기 제1 전자 장치로부터, 상기 UWB 레인징 세션에 연관된 UWB 설정 정보를 포함하는 UWB 세션 데이터(UWBsession data) 메시지를 수신하도록 하고, 및상기 제1 전자 장치와 상기 UWB 센싱 세션에 연관된 상기 적어도 하나의 제2 파라미터를 설정하기 위하여:상기 제1 전자 장치에게, UWB 센싱 정보(UWB sensing information)를 포함하는 UWB 센싱 세션 요청 메시지를송신하고, 및상기 제1 전자 장치로부터, 수락(accept) 또는 선호(preferred) UWB 센싱 세션 파라미터를 포함하는 UWB 센싱세션 응답 메시지를 수신하도록 하는, 제2 전자 장치."}
{"patent_id": "10-2024-0143192", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제17 항에 있어서,상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제2 전자 장치가:상기 UWB 센싱 세션을 수행하는 동안: 상기 제1 전자 장치로부터, UWB 센싱 데이터(sensing data)를 수신하고, 및 상기 제1 전자 장치에게, 상기 UWB 센싱 데이터에 기초하여 획득한 CIR(channel impulse response) 신호를 송신하고, 및상기 UWB 레인징 세션을 수행하는 동안, 상기 제1 전자 장치와 UWB DS-TWR(double-sided two-way ranging)을수행하도록 하는, 제2 전자 장치."}
{"patent_id": "10-2024-0143192", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예는 UWB 통신에 기반하여 인증을 수행하기 위한 전자 장치 및 그 동작 방법에 관한 것이다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 의해 수행되는 방법은, UWB 통신을 수행하는 제2 전자 장치와 BLE(bluetooth low energy) 연결(BLE link)을 수립 (establish)하는 단계, 제2 전자 장치와 수립된 BLE 연결에 기초하여 UWB 세션 정보를 교환(exchange) 단계, UWB 센싱 세션(sensing session)을 수행하여 제1 전자 장치와 제2 전자 장치의 사용자 사이의 제1 거리를 획득하 는 단계, UWB 레인징 세션(ranging session)을 수행하여 제1 전자 장치와 제2 전자 장치 사이의 제2 거리를 획득 하는 단계, 및 제1 거리가 제1 임계 값 미만이며, 및 제2 거리가 제2 임계 값 미만인 경우, 제2 전자 장치와 사 용자의 인증(authentication) 절차를 수행하는 단계를 포함할 수 있다."}
{"patent_id": "10-2024-0143192", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예들은 UWB 통신에 기반하여 인증을 수행하기 위한 전자 장치 및 그 동작 방법에 관한 것 이다."}
{"patent_id": "10-2024-0143192", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신 기술의 발달에 따라, 전자 장치는 다양한 무선 통신 기술들을 통해 다른 전자 장치와 통신할 수 있다. 블루투스(Bluetooth)는 전자 장치들이 서로 연결되어 데이터나 정보를 교환할 수 있는 근거리 무선 통신 기술 중 하나로, 블루투스 레거시(legacy)(또는 클래식(classic))와 BLE(Bluetooth Low Energy)를 포함할 수 있다. BLE는 전력 소모를 줄이면서도 효율적인 데이터 전송이 가능해 IoT(사물 인터넷) 장치에 널리 사용되고 있다. UWB(ultra-wideband) 역시 근거리 무선 통신 기술로, 넓은 주파수 대역에서 좁은 펄스를 사용함으로써 매 우 낮은 전력으로 통신이 가능하다. UWB는 특히 거리 측정에 있어 높은 정확도를 제공한다. 이러한 무선 통신 기술들이 적용된 다양한 전자 장치(예: 스마트폰, 웨어러블 장치 등)가 개발되고 있으며, 기 존의 전자 장치(가전 제품, 게이트 장치 등)에도 이러한 무선 통신 기술들이 적용되고 있다. 이에 따라, 전자 장치들은 무선 통신 기술들을 이용하여, 다양한 형태의 서비스들을 제공할 수 있게 되었다. 최근에는, 논리적 접근(logical access) 서비스를 제공하는 전자 장치가 무선 통신 기술을 이용하여 인증 (authentication)을 수행할 수 있게 되었다. 예를 들어, 논리적 접근 서비스를 제공하는 전자 장치가, 사용자의 입력을 통한 인증을 수행하는 것이 아닌, 무선 통신 기술을 통하여 사용자가 사용하는 외부 전자 장치를 인식하 여 사용자의 인증 절차를 자동으로 수행하는 서비스를 제공할 수 있게 되었다."}
{"patent_id": "10-2024-0143192", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이에 따라, 이러한 새로운 형태의 서비스들을 효과적으로 제공하기 위한 방안이 요구되고 있다. 발명의 내용"}
{"patent_id": "10-2024-0143192", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 문서에서 개시되는 다양한 실시 예들은 UWB 통신에 기반하여 인증을 수행하기 위한 전자 장치 및 그 동작 방 법을 제공한다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2024-0143192", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-0143192", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 의해 수행되는 방법은, UWB 통신을 수행하는 제2 전자 장치와 BLE(bluetooth low energy) 연결(BLE link)을 수립 (establish)하는 단계를 포함할 수 있다. 상기 제1 전자 장치에 의해 수행되는 방법은, 제2 전자 장치와 수립 된 BLE 연결에 기초하여 UWB 세션 정보를 교환(exchange) 단계를 포함할 수 있다. 상기 제1 전자 장치에 의해 수행되는 방법은, UWB 센싱 세션(sensing session)을 수행하여 제1 전자 장치와 제2 전자 장치의 사용자 사이 의 제1 거리를 획득하는 단계를 포함할 수 있다. 상기 제1 전자 장치에 의해 수행되는 방법은, UWB 레인징 세션 (ranging session)을 수행하여 제1 전자 장치와 제2 전자 장치 사이의 제2 거리를 획득하는 단계를 포함할 수 있다. 상기 제1 전자 장치에 의해 수행되는 방법은, 제1 거리가 제1 임계 값 미만이며, 및 제2 거리가 제2 임 계 값 미만인 경우, 제2 전자 장치와 사용자의 인증(authentication) 절차를 수행하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)에 의해 수행되는 방법은, 상기 UWB 통신을 수행하는 제1 전자 장치와 BLE(bluetooth low energy) 연결을 수립 (establish)하는 단계를 포함할 수 있다. 상기 제2 전자 장치에 의해 수행되는 방법은, 상기 제1 전자 장치와 상기 수립된 BLE 연결에 기초하여 UWB 세션 정보를 교환(exchange)하는 단계를 포함할 수 있다. 상기 제1 전자 장치와 UWB 센싱 세션(sensing session)을 수행 하는 단계를 포함할 수 있다. 상기 제2 전자 장치에 의해 수행 되는 방법은, 상기 제1 전자 장치와 UWB 레인징 세션(ranging session)을 수행 하는 단계를 포함할 수 있다. 상 기 제2 전자 장치에 의해 수행되는 방법은, 상기 제1 전자 장치와 사용자에 대한 인증(authentication) 절차를 수행하는 단계를 포함할 수 있다. 상기 인증 절차는, 상기 제1 전자 장치와 상기 사용자 사이의 제1 거리가 제1 임계 값 미만이며, 및 상기 제1 전자 장치와 상기 제2 전자 장치 사이의 제2 거리가 제2 임계 값 미만인 경우에 수행될 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)는, UWB 모듈, BLE(bluethooth low energy) 모듈, 적어도 하나의 프로세서, 및 명령어들을 저장하는 메모리를 포함하고, 상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제1 전자 장치가, UWB 통신을 수행하는 제2 전자 장치와 BLE(bluetooth low energy) 연결(BLE link)을 수립(establish)하고, 제2 전자 장치와 수립된 BLE 연결에 기초하여 UWB 세션 정보를 교환하고, UWB 센싱 세션(sensing session)을 수행하여, 제1 전자 장치와 제2 전자 장치의 사용자 사이의 제1 거리를 획득하고, UWB 레인징 세션(ranging session)을 수행하여, 제1 전자 장치와 상기 전자 장치 사이의 제2 거리를 획득하고, 및 제1 거리가 제1 임계 값 미만이며, 및 제2 거리가 제2 임계 값 미만인 경우, 제2 전자 장치와 사용자의 인증(authentication) 절차를 수행하도록 할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)는, UWB 모듈, BLE(bluethooth low energy) 모듈, 적어도 하나의 프로세서, 및 명령어들을 저장하는 메모리를 포함할 수 있다. 상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제2 전자 장치가, 상기 UWB 통신 을 수행하는 제1 전자 장치와 BLE(bluetooth low energy) 연결을 수립(establish)하도록 할 수 있다. 상기 명 령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제2 전자 장치가, 상기 제1 전자 장치와 상기 수립된 BLE 연결에 기초하여 UWB 정보를 교환(exchange)하도록 할 수 있다. 상기 명령어들은, 상기 적어도 하나 의 프로세서에 의해 실행되어, 상기 제2 전자 장치가, 상기 제1 전자 장치와 UWB 센싱 세션(sensing session)을 수행하도록 할 수 있다. 상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제2 전자 장치 가, 상기 제1 전자 장치와 UWB 레인징 세션(ranging session)을 수행하도록 할 수 있다. 상기 명령어들은, 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 제2 전자 장치가, 상기 제1 전자 장치와 사용자에 대한 인증 (authentication) 절차를 수행하도록 할 수 있다. 상기 인증 절차는, 상기 제1 전자 장치와 상기 사용자 사이의제1 거리가 제1 임계 값 미만이며, 및 상기 제1 전자 장치와 상기 제2 전자 장치 사이의 제2 거리가 제2 임계 값 미만인 경우 수행될 수 있다."}
{"patent_id": "10-2024-0143192", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면을 참고로 하여 본 개시의 내용이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이 하게 실시할 수 있도록 실시예를 상세히 설명한다. 그러나 개시된 실시예는 여러 가지 상이한 형태로 구현될 수 있으며, 여기에서 설명하는 실시예에 한정되는 것은 아니다. 또한, 도면에서 본 개시를 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시에서 사용되는 용어는, 본 개시에서 언급되는 기능을 고려하여 현재 사용되는 일반적인 용어로 기재되었 으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 다양한 다른 용어를 의미할 수 있다. 따라서 본 개시에서 사용되는 용어는 용어의 명칭만으로 해석되지 아니하며, 용어가 가지는 의 미와 본 개시의 전반에 걸친 내용을 토대로 해석되어야 한다. 또한, 제 1, 제 2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요소들은 이 용어들에 의해 한정되지 아니한다. 이 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로 사용된다. 본 개시에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아 니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로(electrically) 연결\" 또는 \"동작적으로(operatively) 연 결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 개시에서 다양한 곳에 등장하는 \"일 실시예에서\" 등의 어구는 반드시 모두 동일한 실시예를 가리키는 것은 아니다. 본 개시에서, 통신 링크 관리는 사용자가 웨어러블 전자 장치를 착용하였는지 여부에 따라 웨어러블 전자 장치 와 전자 장치 간의 통신 링크를 관리함으로써 원활한 통신을 제공하기 위한 동작들을 포함한다. 예를 들어, 통 신 링크 관리는 통신 링크의 생성, 유지, 해제 및 모니터링을 포함할 수 있다. 다만 이는 일 예에 불과하며, 통 신 링크 관리는 이에 한정되지 않고, 전송 전력 조절, 채널 코딩 및 변조 등 다양한 동작을 포함할 수 있다. 또한, 도면에 도시된 구성 요소들 간의 연결 선 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것일 뿐이다. 실제 장치에서는 대체 가능하거나 추가된 다양한 기능적인 연결, 물 리적인 연결, 또는 회로 연결들에 의해 구성 요소들 간의 연결이 나타내어질 수 있다. 본 개시의 “통신”은 인증 절차를 수행하는 일련의 동작들을 지칭하는 용어로서 언급될 수 있다. 예를 들어, 전자 장치가 인증 절차를 수행하는 동작은 논리적 접근(logical access) 서비스를 제공하는 전자 장치가 무선 통신을 통하여 인증과 연관된 정보 또는 신호를 송수신하는 일련의 동작을 포함할 수 있다. 본 개시의 ”FiRa 표준”은 UWB(ultra wide band) 통신을 이용한 서비스 및 장치에 관한 기술 표준화 단체인 FiRa(Find Ranging)에서 기술하는 표준을 의미하는 용어로서 언급될 수 있다. 이하 첨부된 도면을 참고하여 본 개시를 상세히 설명하기로 한다. 도 1은 본 개시의 일 실시예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈 , 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리 , 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성 요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, UWB(ultra-wideband), WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전 자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모 듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치(10 1)는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반 복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. UWB는 Wi-Fi, 블루투스 등 다른 근거리 무선 통신에 비해 높은 수준의 근거리 측위(localization) 성능을 제공 하며 근접 서비스(proximity service)를 위한 솔루션으로 부상하고 있다. 비접촉식 게이트(contactless gate)(CG), UWB 결제(payment), 디지털 자동차 키 등 UWB 기반 근접 서비스가 등장하고 있다. 또한, 최근에는 스마트폰과 모바일 장치(mobile device, MD)에도 UWB 모듈이 탑재되고 있다. 논리적 접근 제어(logical accsess control)에 있어서, 논리적 접근 제어 서비스를 제공하는 전자 장치가 사용 자로부터 별도의 인증 정보를 입력받는 동작을 생략하고 사용자에 대한 인증을 수행하기 위해서 UWB 통신을 이 용한 거리 측정 기술이 이용될 수 있다. 이를 위해, 최적화된 UWB 통신 설정 및 거리 측정이 필요하다. 본 개시 에서는 UWB 통신에 기반하여 사용자의 인증 절차를 수행하는 방법 및 전자 장치를 제공할 수 있다. 도 2는 본 개시의 일 실시예에 따른 무선 통신에 기반하여 인증 절차를 수행하는 시스템을 설명하기 위한 개요 도를 도시한다. 도 2를 참조하면, 본 개시의 일 실시예에 따른 무선 통신에 기반하여 인증 절차를 수행하는 시스템이 도시되어 있다. 무선 통신에 기반한 인증 절차는 다중 무선 기술을 통하여 구현될 수 있다. 예를 들어, BLE(Bluetooth Low Energy), UWB(ultra-wideband) 및 셀룰러 네트워크(예: LTE 또는 5G 네트워크)를 사용할 수 있다. 또한, 도 2에 도시된 시스템의 개요에서, 제1 전자 장치 및 제2 전자 장치는 본 개시의 일 실시예에 따른 동작을 설명하기 위한 예시적인 장치이며, 제1 전자 장치, 및 제2 전자 장치가 도시된 예시에 제한되 는 것은 아니다. 예를 들어, 제1 전자 장치는, 자동차를 포함할 수 있다. 예를 들어, 제1 전자 장치 는, 데스크탑(desktop)을 포함할 수 있다. 예를 들어, 제1 전자 장치는, 스마트폰(smart phone) 또는 태블 릿(tablet)과 같은 통신 모듈을 포함하는 모바일 기기(mobile device)를 포함할 수 있다. 예를 들어, 제2 전자 장치는, 모바일 기기를 포함할 수 있다. 예를 들어, 제2 전자 장치는 차량용 키(key)를 포함할 수 있다. 일 실시예에 따르면, 제1 전자 장치는 사용자의 제1 전자 장치에 대한 접근 권한을 부여하기 위 한 논리적 접근 제어(logical access control) 서비스를 제공할 수 있다. 예를 들어, 제1 전자 장치는 사 용자의 제1 전자 장치에 대한 접근 권한의 유무를 확인하기 위한 인증(authentication) 절차를 수행 할 수 있다. 여기서 “인증” 또는 “인증 절차”는, 장치, 시스템, 또는 네트워크에 접근하려는 사용자의 접근 권한을 확인하는 일련의 동작을 포함할 수 있다. 예를 들어, 제1 전자 장치는, 적어도 하나의 센서 모듈(예: 도 1의 센서 모듈)을 통하여 접근 권한을 가진 사용자를 식별함에 기초하여, 사용자에 대한 인증 (authentication) 절차를 수행할 수 있다. 예를 들어, 제1 전자 장치는, 입력 모듈(예: 도 1의 입력 모듈 )을 통하여, 인증 정보를 포함하는 사용자의 입력(예: 패스워드(password))을 수신함에 기초하여, 사 용자에 대한 인증 절차를 수행할 수 있다. 일 실시예에 따르면, 제1 전자 장치와 제2 전자 장치는, 무선 통신에 기반하여 사용자의 인증 절차를 수행할 수 있다. 예를 들어, 제1 전자 장치는, 제2 전자 장치와의 UWB 통신에 기반하여 제2 전자 장치의 사용자에 대한 인증 절차를 수행할 수 있다. 예를 들어, 제1 전자 장치는 UWB 통신 에 기반하여 제1 전자 장치와 제2 전자 장치 사이의 거리를 측정할 수 있다. 제1 전자 장치는, 측정된 제1 전자 장치와 제2 전자 장치 사이의 거리가, 기설정된 거리 범위 내에 포함된다 고 판단함에 기초하여 인증 절차를 수행할 수 있다. 이하, 본 개시에서는, 제1 전자 장치와 제2 전자 장치 사이의 거리를 측정하는 동작을 “레인징(ranging)”으로 언급할 수 있다. “레인징”에 연관된 상세한 설명에 관하여는 후술하기로 한다. 일 실시예에 따르면, 제1 전자 장치가 제1 전자 장치와 제2 전자 장치 사이의 거리를 기준 으로 인증 절차를 수행하는 경우, 제1 전자 장치와 사용자의 거리가 기설정된 거리 범위를 벗어나는 경우에도 인증 절차가 수행될 수 있다. 본 개시의 일 실시예에 따르면, UWB 통신을 수행하는 제1 전자 장치는, 제1 전자 장치와 제2 전자 장 치 사이의 거리가 기설정된 거리 범위를 벗어나지 않더라도, UWB 통신에 기반하여 획득한 제1 전자 장치와 사용자의 거리가 기설정된 거리 범위를 벗어나는 경우 인증 절차를 수행하지 않을 수 있다. 제1 전자 장치로부터 기설정된 거리 범위를 벗어난 거리에 위치하던 사용자(23 0)는 임의의 경로를 따라 이동하여 기설정된 거리 범위 내의 거리에 위치할 수 있다. 일 실시예에 따르면, 제1 전자 장치는, 제1 전자 장치와 제2 전자 장치 사이의 거리가 기 설정된 거리 범위를 벗어나지 않으며, 및 UWB 통신에 기반하여 획득한 제1 전자 장치와 사용자 의 거리가 기설정된 거리 범위를 벗어나지 않는 경우 사용자의 인증 절차를 수행할 수 있다. 도 3은 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치가 레인징 및 센싱을 수행하는 개요도를 도시한다. 도 3을 참조하면, 일 실시예에 따른 제1 전자 장치는 컨트롤러(controller)의 역할을 수행할 수 있으며, 제2 전자 장치는, 제1 전자 장치와 반대의 역할인 컨트롤리(controlee)의 역할을 수행할 수 있다. 본 개시에서, 컨트롤러는 UWB 통신에 기반한 거리 측정을 수행함에 있어서 UWB 신호(예: sensing packet)를 전송하 고, 컨트롤리로부터 수신한 응답 신호에 기초하여 거리를 측정(measurement)하는 기능을 수행하는 장치를 의미 할 수 있다. 본 개시에서, 컨트롤리는 컨트롤러로부터 UWB 신호를 수신하고, 수신된 신호를 반사하거나 응답 신 호를 송신하는 기능을 수행할 수 있으며, 컨트롤러에 의한 거리(또는 위치) 측정의 대상이 되는 장치를 포함할 수 있다. 또한, 일 실시예에 따른 제1 전자 장치는 responder의 역할을 수행할 수 있으며, 제2 전자 장치는 initiator의 역할을 수행할 수 있다. 본 개시에서, 'initiator'는 UWB 통신을 수행하는 하나 이상의 다른 장치 와 RF(radio frequency) sensing session을 시작하는 장치를 의미할 수 있다. 본 개시에서, 'responder'는, initiator에게 응답(respond)하는 센싱 장치를 의미할 수 있다. 또한, 일 실시예에 따른 제1 전자 장치는 센싱 송신기(sensing transmitter, Tx)의 역할을 수행할 수 있으 며, 제2 전자 장치는 센싱 수신기(sensing receiver, Rx)의 역할을 수행할 수 있다. 본 개시에서, '센싱 트랜스미터'는, RF 채널 측정(estimation)을 위하여 채널 사운딩 PPDU를 전송하는 장치를 의미할 수 있다. 본 개시에서, '센싱 리시버'는 송신기로부터 채널 사운딩 PPDU를 수신하고 채널 측정을 수행하는 센싱 장치를 의미 할 수 있다.또한, 일 실시예에 따른 제1 전자 장치는, 자격 증명 리더(credential reader)의 역할을 수행할 수 있으며, 제2 전자 장치는 자격 증명 장치(credential device)의 역할을 수행할 수 있다. 본 개시에서, '자 격 증명 리더(credential reader)'는 사용자의 자격 증명 정보를 읽고 인증(authentication)하는 장치를 의미 할 수 있다. 본 개시에서, 자격 증명 장치(credential device)'는 사용자의 자격 증명 정보를 저장하고 자격 증 명 리더에게 제공하는 장치를 의미할 수 있다. 예를 들어, 스마트 카드, 모바일 기기, 또는 생체 인식 장치를 포함할 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 제1 전자 장치는, 제2 전자 장치와의 거리 측정(distance measurement)을 위하 여 UWB 통신에 기반하여 레인징(ranging)을 수행할 수 있다. 예를 들어, 제1 전자 장치는, DS- TWR(double-sided two-way ranging) 방식을 통하여 제2 전자 장치와의 거리 측정을 수행할 수 있다. 본 개시의 일 실시예에 따르면, 제1 전자 장치는, 제2 전자 장치와의 거리 측정을 위한 UWB 통신에 기반한 레인징(예: DS-TWR) 세션(session)과 감지된 외부 물체(예: 사용자)에 대한 거리 측정을 위한 UWB 통신에 기반한 센싱(sensing) 세션을 함께 수행할 수 있다. 이로 인해, 제1 전자 장치는 사용자(예: 도 2 의 사용자)와의 거리(예: 도 2의 거리(260, 270)), 및 제2 전자 장치와의 거리(예: 도 2의 거리 )함께 고려하여 사용자(예: 도 2의 사용자)에 대한 인증 절차를 수행할 수 있다. 도 4는 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치의 블록도를 도시한다. 도 4를 참조하면, 본 개시의 일 실시예에 따른 제1 전자 장치, 및 제 2 전자 장치는, 메모리(예: 도 1의 메모리)에 저장된 논리적 접근 서비스(logical access service)를 제공하는 어플리케이션 (application)을 실행할 수 있다. 예를 들어, 제1 전자 장치는 논리적 접근 서비스를 지원하는 제공하는 접근 서비스 어플리케이션(access service application, AC app)을 통하여 어플리케이션/웹 서비스를 제 공하는 APP/wep 서비스 서버에 접근할 수 있다. 예를 들어, 제2 전자 장치는 논리적 접근 서비스를 지원하는 제공하는 어플리케이션을 실행하여 어플리케이션/웹(WEB) 서비스를 제공하는 APP/wep 서버 에 접근할 수 있다. 일 실시예에 따르면, 제1 전자 장치는 논리적 접근 서비스를 제공하기 위한 논리적 접근 프레임워크 (logical access framework)를 포함할 수 있다. 예를 들어, 논리적 접근 프레임워크(logical access framework)는, 사용자가 시스템에 접근하기 전에 인증 정보를 확인하는 사용자 인증(authentication) 기능, 인증된 사용자에게 특정 작업(task) 또는 데이터(data)에 대한 접근 권한을 부여하는 기능, 또는 데이터 를 암호화(encryption)하는 기능을 포함할 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 제1 전자 장치는, 논리적 접근 프레임워크를 통하여 온-디바이스 인증(on- device authentication) 기능을 제공할 수 있다. 예를 들어, 온-디바이스 인증(on-device authentication) 기능은 승인된 사용자의 인증 정보를 메모리(예: 도 1의 메모리)에 저장하고 관리 (manage)하는 기능을 포함할 수 있다. 일 실시예에 따르면, 제2 전자 장치는, FiRa CSML(FiRa Common Service & Management Layer) 프레임워크 를 포함할 수 있다. 예를 들어, FiRa CSML 프레임워크는 FiRa Consortium에서 개발한 UWB 통신 규격에 따 른, UWB 통신을 수행하기 위한 공통 서비스 및 관리 계층을 포함할 수 있다. FiRa CSML 프레임워크는 UWB 기기 간의 통신 및 관리를 위해 필요한 프로토콜(protocol) 및 API(Application Programming Interface)을 포 함할 수 있다. 또한, FiRa CSML 프레임워크는 UWB 통신을 수행하는 장치의 UWB 통신을 위한 설정, 관리, 보안 서비스를 제공할 수 있다. 이로 인해, FiRa CSML 프레임워크는 응용 프로그램과 장치 간의 상호운영성 (inter-operability)을 보장할 수 있다. 일 실시예에 따르면, 논리적 접근 프레임워크는, FiRa CSML 프레임워크 내의 하나의 엔티티(entity)에 대 응될 수 있다. 예를 들어, FiRa CSML 프레임워크 내의 프로파일 관리자(profile manager)에 논리적 접근 서비스 를 위한 프로파일이 존재하는 경우, 논리적 접근 서비스를 위한 프로파일을 '논리적 접근 프레임워크(logical accses framework)'라고 지칭할 수 있다. 일 실시예에 따르면, 제2 전자 장치는, 보안 요소(secure component)를 메모리(예: 도 1의 메모리 )에 저장할 수 있다. 예를 들어, 보안 요소는 제2 전자 장치의 사용자의 인증 정보를 포함 할 수 있다. 메모리(예: 도 1의 메모리)에 저장된 보안 요소는, 제1 전자 장치와의 무선 통신을 통한 사용자의 인증 절차를 수행하는 경우, 제1 전자 장치에게 송신될 수 있다.일 실시예에 따르면, 제1 전자 장치와 제2 전자 장치는, BLE(bluetooth low energy) 통신을 위한 모 듈을 포함할 수 있다. 예를 들어, 제1 전자 장치는 BLE 통신 모듈을 포함할 수 있다. 예를 들어, 제2 전자 장치는 BLE 통신 모듈을 포함할 수 있다. 제1 전자 장치와 제2 전자 장치는, BLE 통 신 모듈(414, 424)을 통하여 FiRa 규격에 따른 BLE 통신을 수행할 수 있다. 일 실시예에 따르면, 제1 전자 장치와 제2 전자 장치는, UWB 통신을 위한 모듈을 포함할 수 있다. 예 를 들어, 제1 전자 장치는 UWB 서브시스템(UWB subsystem, UWBS)을 포함할 수 있다. 예를 들어, 제2 전자 장치는 UWB 서브시스템 을 포함할 수 있다. 일 실시예에 따르면, UWB 서브시스템 (415, 425)은 FiRa 규격에 따른 UWB 통신을 수행할 수 있다. 예를 들어, UWB 서브시스템(415, 425)은 다른 전자 장치와 통신하여 UWB 광고를 위한 기능, UWB 레인징 및 트랜잭션을 위한 기능, 위치 추정을 위한 기능 중 적어도 하나를 수행하기 위해 사용될 수 있다. 예를 들어, 제1 전자 장치(42 0)의 UWB 서브시스템은 제2 전자 장치의 UWB 서브시스템과 통신하여 UWB 메시지(예: 광고 메시 지)를 송신 또는 수신할 수 있다. 일 실시예에 따르면, UWB 서브시스템(415, 425)은, 인터페이스를 통하여 UWB 프레임워크(예: FiRa CSML 프레임 워크)와 통신할 수 있다. 예를 들어, 인터페이스는, UCI(UWB Command Interface)를 포함할 수 있다. UCI 는 FiRa Consortium에서 정의한 UWB 서브시스템과 호스트(framework) 사이의 통신 프로토콜을 의미할 수 있다. 예를 들어, 제1 전자 장치는, UCI를 통하여 UWB 서브시스템과 논리적 접근 프레임워크 사이의 통신을 수행할 수 있다. 일 실시예에 따르면, 제1 전자 장치의 UWB 프레임워크(또는 애플리케이션 프로세서)(또는 호스트(host))는, UCI를 통해 UWB 서브시스템에게 UWB 통신에 기반한 세션에 연관된 명령(command)을 전달 할 수 있고, UWB 서브시스템은 수신한 명령에 대한 응답(response)을 UCI를 통해 UWB 프레임워크에게 전달 할 수 있다. 일 실시예에 따르면, 제1 전자 장치의 UWB 서브시스템은 UWB 통신에 기반하여 획득한 거리 측정 결과 를 포함하는 통지(notification) 메시지를, UCI를 통해 UWB 프레임워크로 전달할 수 있다. 예를 들어, 통지 메 시지는 UWB 통신에 기반하여 획득한 제1 전자 장치와 사용자 사이의 거리에 연관된 정보를 포함할 수 있다. 일 실시예에 따르면, 제1 전자 장치는, UWB 통신에 기반하여 획득한 거리 정보에 기초하여 사용자에 대한 인증 절차를 수행할 수 있다. 예를 들어, 제1 전자 장치는, 거리 정보가 기설정된 조건을 만족하는 경우, 제1 전자 장치는 제2 전자 장치에게 사용자의 인증 정보를 요청하는 메시지를 송신할 수 있다. 일 실시예에 따른 제1 전자 장치가, UWB 통신에 기반하여 획득한 거리 정보에 기초하여 사용자(43 0)에 대한 인증 절차를 수행하는 동작에 관하여는 이후의 도면을 참조하여 상세히 설명하도록 한다. 도 5는 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치가 UWB 통신에 기반하 여 인증 절차를 수행하는 동작의 개요도를 도시한다. 도 5를 참조하면, 본 개시의 일 실시예에 따른 제1 전자 장치와 제2 전자 장치는, BLE(bluetooth low energy) 통신 및 UWB 통신에 기반하여 사용자의 인증 절차를 수행하는 일련의 동작(510, 520, 530, 540)을 수행할 수 있다. 일 실시예에 따른 제1 전자 장치와 제2 전자 장치는, 동작 510에서, UWB 통신을 수행하는 장치를 탐 색(discover)하고 BLE 연결을 수립(establish)할 수 있다. 예를 들어, 동작 510은, 제2 전자 장치가, OOB 채널(예: BLE 채널)을 통해 UWB 통신을 수행하는 제1 전자 장치를 탐색하는 동작, 및 제1 전자 장치 와 제2 전자 장치가 BLE 연결을 수립(establish)하는 동작을 포함할 수 있다. 일 실시예에 따른 제1 전자 장치와 제2 전자 장치는, 동작 520에서, UWB 통신에 기반하여 거리 측정 을 수행하기 위한 세션에 연관된 파라미터를 협상 또는 설정할 수 있다. 예를 들어, 동작 520은, OOB(예: BLE 채널) 또는 In-band 채널을 통하여, UWB 세션을 설정하기 위한 파라미터(예컨대, UWB 성능 파라미터(컨트롤리 성능 파라미터), UWB 설정(configuration) 파라미터 및/또는 세션 키 관련 파라미터)를 교환하는 동작을 포함할 수 있다. 제1 전자 장치와 제2 전자 장치가 UWB 통신에 기반하여 거리 측정을 수행하기 위한 UWB 세 션과 연관된 파라미터를 협상 또는 설정하는 동작에 관하여는 도 6을 참조하여 상세히 설명하도록 한다.일 실시예에 따른 제1 전자 장치와 제2 전자 장치는, 동작 530에서, UWB에 기반한 거리 측정에 연관 된 UWB 센싱 세션(sensing) 및 UWB 레인징(ranging) 세션을 수행할 수 있다. 예를 들어, UWB 센싱 세션(UWB sensing session)은, 제1 전자 장치와 사용자 사이의 제1 거리를 획득하는 일련의 동작을 포함할 수 있다. 예를 들어, UWB 레인징 세션(UWB ranging session)는, 제1 전자 장치와 제2 전자 장치 사이의 제2 거리를 획득하기 위한 일련의 동작을 포함할 수 있다. UWB 센싱 세션과 UWB 레인징 세션의 상세한 설명은, 도 6을 참조하여 후술하도록 한다. 일 실시예에 따른 제1 전자 장치와 제2 전자 장치는, 동작 540에서, 획득한 거리 정보에 기반하여 사 용자에 대한 인증 절차를 수행할 수 있다. 예를 들어, 제1 전자 장치는 획득한 거리 정보 중 제1 전 자 장치와 사용자 사이의 제1 거리와 제1 전자 장치와 제2 전자 장치 사이의 제2 거리가 기설정된 조건을 만족하는 경우 사용자 인증 절차를 수행할 수 있다. 사용자 인증 절차는 사용자의 입력을 수신 하는 동작을 포함할 수 있으나 이에 제한되지 않는다. 예를 들어, 제2 전자 장치의 메모리(예: 도 1의 메 모리)에 저장된 사용자의 인증 정보를 수신하는 동작을 포함할 수 있다. 도 6은 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치가 UWB 통신에 기반하 여 인증 절차를 수행하는 동작의 흐름도를 도시한다. 도 6을 참조하면, 일 실시예에 따른 제1 전자 장치와 제2 전자 장치가 수행하는 도 6에 도시된 동작 610 내지 동작 680은, 도 5의 개요도의 동작 510 내지 동작 540에 대응될 수 있다. 예를 들어, 도 6의 제1 전자 장치는 도 5의 제1 전자 장치에 대응될 수 있다. 예를 들어 도 6의 제2 전자 장치는 도 5 의 제2 전자 장치에 대응될 수 있다. 예를 들어, 도 6의 동작 610 은 도 5의 동작 510에 대응될 수 있다. 예를 들어, 도 6의 동작 620은, 도 5의 동작 520에 대응될 수 있다. 예를 들어, 도 6의 동작 650은, 도 5의 동 작 530에 대응될 수 있다. 예를 들어, 도 6의 동작 680은, 도 5의 동작 540에 대응될 수 있다. 일 실시예에 따르면, 단계 611에서, 제1 전자 장치는 BLE(Bluetooth low energy) 광고 패킷 (advertisement packet)을 방송(broadcasting) 할 수 있다. 일 실시예에 따르면, 단계 611에서, 제2 전자 장치 는 제1 전자 장치가 방송하는 BLE 광고 패킷을 수신할 수 있다. 도 6의 제1 전자 장치는, 도 2 의 제1 전자 장치 또는 도 3의 제1 전자 장치에 대응될 수 있으며, 예를 들어, 논리적 접근 제어 기 능을 제공하는 credential 리더 장치로서 자동차, 또는 PC를 포함할 수 있다. 또한, 도 6의 제2 전자 장치(60 2)는, 도 1의 전자 장치, 도 2의 제2 전자 장치에 대응될 수 있으며, 스마트폰, 웨어러블 디바이스, 모바일 디바이스를 포함할 수 있다. 일 실시예에 따르면, 제1 전자 장치가 단계 611에서 방송하는 BLE 광고 패킷은, 주변 전자 장치(예: 제2 전자 장치)가 제1 전자 장치를 탐색하기 위해 사용될 수 있다. 예를 들어, 제1 전자 장치가 방 송하는 BLE 광고 패킷은, 헤더(header), 장소 ID(place ID), UWB 주소(UWB address), BLE 광고 패킷을 방송하 는 제1 전자 장치의 위치 정보, 제1 전자 장치의 영역 정보를 포함할 수 있으나, 이에 제한되지 않는 다. 일 실시예에 따르면, 제1 전자 장치가 단계 611에서 방송하는 BLE 광고 패킷의 헤더는, FiRa 서비스 정보 를 포함할 수 있다. 예를 들어, 제1 전자 장치가 방송하는 BLE 광고 패킷의 헤더는, 논리적 접근 서비스를 제공하기 위한 것임을 나타내는 지시자(예: logical access service identifier)를 포함할 수 있다. 예를 들어, BLE 광고 패킷의 헤더는, 제1 전자 장치가 논리적 접근 서비스를 제공하는 장치임을 나타내는 지시 자를 포함할 수 있다. 예를 들어, BLE 광고 패킷의 헤더는, 거리 측정 기술(예: Radio Detection and Ranging, RADAR)에 기반하여 논리적 접근 서비스를 제공하기 위한 광고 패킷임을 나타내는 지시자를 포함할 수 있다. 일 실시예에 따르면, 제1 전자 장치가 단계 611에서 방송하는 BLE 광고 패킷의 UWB 주소는, BLE 광고 패킷 을 전송하는 제1 전자 장치의 UWB MAC 주소(UWB MAC address)를 포함할 수 있다. 예를 들어, UWB 주소는 6B(byte) BLE address를 활용할 수 있다. 또한, 6B Long address 또는 2 B short address를 사용할 수 있다. 일 실시예에 따르면, 단계 611에서, 제2 전자 장치가 제1 전자 장치가 방송하는 BLE 광고 패킷을 수 신함에 기초하여, 동작 610에서, 제1 전자 장치와 제2 전자 장치는 BLE 연결을 수립할 수 있다. 예를 들어, BLE 연결을 수립하는 동작은, BLE 연결 설정(BLE link setup) 및 BLE 연결에 기초한 통신을 시작하는 동 작을 포함할 수 있다. 예를 들어, 제1 전자 장치와 제2 전자 장치는, FiRa consortum에 의해 정의된 BLE-OOB-Channel-Specification에 정의된 BLE 연결 설정, GATT 서비스 연결 기술에 따라 BLE 연결을 수립할 수 있다. 예를 들어, 제1 전자 장치와 제2 전자 장치가 BLE 연결을 수립하는 단계는, 제2 전자 장치가 제1 전자 장치에게, BLE 광고 패킷에 기초하여 BLE 연결의 설정을 요청하는 메시지를 송신하는 단 계, 제1 전자 장치가 제2 전자 장치로부터 BLE 연결의 설정을 요청하는 메시지를 수신하는 단계, 제1 전자 장치가, 제2 전자 장치에게, BLE 연결의 설정 정보를 포함하는 응답 메시지를 송신하는 단계, 제2 전자 장치가, 제1 전자 장치로부터 BLE 연결의 설정 정보를 포함하는 응답 메시지를 수신하는 단 계를 포함할 수 있다. 일 실시예에 따르면, 제1 전자 장치와 제2 전자 장치는, 동작 620에서, UWB 통신에 기반하여 거리 측 정을 수행하기 위한 세션에 연관된 파라미터를 협상 또는 설정할 수 있다. 예를 들어, 제1 전자 장치와 제 2 전자 장치가 수행하는 동작 620은, UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상 (negotiation)하는 동작, 및 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하는 동작을 포함할 수 있다. 일 실시예에 따르면, UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상(negotiation)하는 동작 은, 제1 전자 장치가, 제2 전자 장치로부터 UWB 컨트롤리 정보(UWB controlee information) 메 시지를 수신하는 단계, 및 제1 전자 장치가 제2 전자 장치에게, UWB 레인징 세션에 연관된 UWB 설정 정보를 포함하는 UWB 세션 데이터(UWB session data) 메시지를 송신하는 단계를 포함할 수 있다. 예 를 들어, 단계 631에서, 제2 전자 장치는, PUT 타입의 메시지(예: PUT Controlee_info)를 이용하여, 제1 전자 장치에게, UWB 컨트롤리 정보를 송신할 수 있다. 예를 들어, 단계 632에서, 제1 전자 장치는, PUT 타입의 메시지(예: PUT_Session Data)를 이용하여, 제2 전자 장치에게, UWB 세션 데이터(UWB session data) 메시지를 송신할 수 있다. 도 6에서는 UWB 컨트롤리 정보(UWB controlee information) 또는 UWB 세션 데이터(UWB session data)를 PUT 타 입의 메시지를 통하여 전달하는 예시만을 도시하였으나, 이에 제한되지 않는다. 예를 들어, 단계 631에서, 제1 전자 장치는, GET 타입의 메시지(예: GET Controlee_info)를 이용하여, 제2 전자 장치에게, UWB 컨 트롤리 정보를 요청할 수 있다. 제1 전자 장치로부터 GET 타입의 메시지(예: GET Controlee_info)를 수신 한 제2 전자 장치는, 제1 전자 장치에게, UWB 컨트롤리 정보 메시지를 송신할 수 있다. 예를 들어, 단계 632에서, 제2 전자 장치는, GET 타입의 메시지(예: GET SESSION_DATA)를 이용하여, 제1 전자 장치 에게, UWB 세션 데이터(UWB session data)를 요청할 수 있다. 제2 전자 장치로부터 GET 타입의 메시 지(예: GET SESSION_DATA)를 수신한 제1 전자 장치는, 제2 전자 장치에게, UWB 세션 데이터 메시지 를 송신할 수 있다. UWB 컨트롤리 정보(UWB controlee information) 메시지에 포함된 정보 및 구조에 관하여는, 도 9를 참조하여 상세히 설명하도록 한다. 일 실시예에 따르면, UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하는 동작은, 제2 전자 장치가, 제1 전자 장치에게, UWB 센싱 세션을 요청하는 단계, 및 UWB 센싱 세션 요청 메시지를 수신한 제1 전자 장치가, 제2 전자 장치에게, UWB 센싱 세션 요청에 대하여 응답하는 단계를 포 함할 수 있다. 예를 들어, 제2 전자 장치는, 단계 641에서, UWB 센싱 정보(UWB sensing information)를 포함하는 UWB 센싱 세션 요청(UWB sensing session request) 메시지를 송신할 수 있다. 예를 들어, 단계 641에 서, 제2 전자 장치로부터 UWB 센싱 세션 요청 메시지를 수신한 제1 전자 장치는, 제2 전자 장치(60 2)에게, UWB 센싱 세션 응답(UWB sensing session response) 메시지를 송신할 수 있다. UWB 센싱 세션 응답 메 시지는, 수락(accept) 또는 선호(preferred) UWB 센싱 세션 파라미터를 포함할 수 있다. UWB 센싱 정보(UWB sensing information)에 관하여는 도 10 및 도 11을 참조하여 상세히 설명하도록 한다. 일 실시예에 따르면, UWB에 기반한 거리 측정에 연관된 UWB 센싱 세션(sensing) 및 UWB 레인징(ranging) 세션을 수행하는 동작은, 제1 전자 장치와 사용자 사이의 제1 거리를 획득하는 센싱/측정 단계 (sensing/measurement phase), 및 제1 전자 장치와 제2 전자 장치 사이의 제2 거리를 획득하는 레인징 단계(ranging phase)를 포함할 수 있다. 동작 650은, 제1 전자 장치와 제2 전자 장치는, 동작 620에서 협상 또는 설정한 UWB 세션에 연관된 파라미터에 기초하여, UWB 통신에 기반한 거리 측정을 수행하는 단계로 이해될 수 있다. 일 실시예에 따르면, 센싱/측정 단계는, 제1 전자 장치가 제2 전자 장치와의 UWB 통신에 기반하 여, 제1 전자 장치와 사용자 사이의 제1 거리를 획득하는 단계(단계 661 내지 663), 및 획득한 제1 거리가 기설정된 조건을 만족하는지 여부에 기초하여 이후의 동작의 수행여부를 결정하는 단계(단계 664 내지 665)를 포함할 수 있다. 일 실시예에 따르면, 단계 661에서, 제1 전자 장치는, UWB 통신에 기반하여, 제2 전자 장치에게, UWB 센싱 데이터를 송신할 수 있다. UWB 센싱 데이터에 관하여는 도 13을 참조하여 상세히 설명하도록 한다. 일 실시예에 따르면, 단계 662에서, 제2 전자 장치는, 수신한 UWB 센싱 데이터에 기초하여 CIR 신호를 획 득할 수 있다. 제2 전자 장치는, 획득한 CIR 신호를 제1 전자 장치에게 송신할 수 있다. 일 실시예에 따르면, 단계 663에서, 제1 전자 장치는, 제2 전자 장치가 단계 662에서 송신한 CIR 신 호를 수신하여, CIR 신호에 기초하여 사용자와의 제1 거리를 획득할 수 있다. CIR 신호, 및 CIR 신호에 기 초하여 사용자와의 거리를 획득하는 방법에 관하여는 도 13 및 도 14를 참조하여 상세히 설명하도록 한다. 일 실시예에 따르면, 단계 664에서, 제1 전자 장치는, UWB 센싱 세션을 통한 거리 센싱의 결과를 UWB 모듈 에서 프레임워크로 전달할 수 있다. 예를 들어, 제1 전자 장치는, 단계 663에서 획득한 사용자와의 제1 거 리를, UWB 서브시스템(예: 도 4의 UWB 서브시스템)로부터 논리적 접근 프레임워크(예: 도 4의 논리적 접근 프레임워크)에게 전달할 수 있다. 일 실시예에 따르면, 단계 665에서, 제1 전자 장치는, UWB 서브시스템으로부터 전달받은 UWB 센싱 세션을 통한 거리 센싱의 결과에 기초하여, UWB 레인징 세션의 수행 여부를 결정할 수 있다. 예를 들어, 제1 전자 장치 는, 획득한 사용자와의 제1 거리가 기설정된 조건을 만족하는 지를 판단하고, 제1 거리가 기설정된 조건을 만족하는 경우, 논리적 접근 프레임워크(예: 도 4의 논리적 접근 프레임워크)로부터, UWB 서브시스 템(예: 도 4의 UWB 서브시스템)에게, 제2 거리를 획득하기 위한 UWB 레인징 세션의 시작을 명령하는 메시 지를 전달할 수 있다. 예를 들어, 제1 거리에 대한 기설정된 조건은, 제1 거리가 제1 임계값 미만인 경우를 포 함할 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 레인징 단계(ranging phase)는, 제1 전자 장치가 제2 전자 장치와의 UWB 통신에 기반하여, 제1 전자 장치와 제2 전자 장치 사이의 제2 거리를 획득하는 단계를 포함할 수 있다. 예를 들어, 제1 전자 장치와 제2 전자 장치는, UWB 통신에 기반한 데이터 패킷을 송수신하 는 시간에 기초하여 제1 전자 장치와 제2 전자 장치 사이의 제2 거리를 획득할 수 있다. 예를 들어, 제1 전자 장치와 제2 전자 장치는, DS-TWR(double-sided two-way ranging) 방식을 통하여 제2 거리 를 획득할 수 있다. 일 실시예에 따르면, 단계 680에서, 제1 전자 장치는, 제2 전자 장치와 사용자에 대한 인증 (authentication)절차를 수행할 수 있다. 일 실시예에 따르면, 단계 681에서, 제1 전자 장치는, 단계 671에서 획득한 사용자와의 제2 거리가 기설정된 조건을 만족하는 경우, 제2 전자 장치에게, 사용자의 인증 정보를 요청하는 메시지를 송신 할 수 있다. 예를 들어, 기설정된 조건은, 제2 거리가 제2 임계 값 미만인 경우를 포함할 수 있으나, 이에 제한 되지 않는다. 여기서, 제2 조건에 연관된 제2 임계 값은, 단계 665에서의 제1 임계 값과 동일하게 설정될 수 있 다. 일 실시예에 따르면, 단계 682에서, 제1 전자 장치와 제2 전자 장치는 사용자의 인증 정보를 교 환할 수 있다. 예를 들어, 제2 전자 장치는, 제1 전자 장치의 인증 요청 메시지를 수신함에 응답하여, 제1 전자 장치에게, 사용자가 제1 전자 장치에 대한 접근 권한을 가지는지 여부를 증 명하기 위한 자격 증명(credential) 정보를 송신할 수 있다. 일 실시예에 따르면, 단계 683에서, 제1 전자 장치는, 제2 전자 장치가 송신한 자격 증명 정보에 기 초하여, 사용자 인증 여부를 결정할 수 있다. 일 실시예에 따르면, 단계 690에서, 제1 전자 장치는, 인증된 사용자에게 사용자 서비스를 제공할 수 있다. 여기서, 사용자 서비스는, 제1 전자 장치에서 제공하며 접근 자격을 필요로하는 서비스를 포함할 수 있다. 예를 들어, 제1 전자 장치가 PC인 경우, 제1 전자 장치는 인증된 사용자에게 로그인(log- in) 기능을 제공할 수 있다. 예를 들어, 제1 전자 장치가 차량인 경우, 제1 전자 장치는, 인증된 사 용자에게 차량 문의 잠금 상태를 해제하는 기능 또는 차량 엔진의 시동을 켜는 기능을 제공할 수 있다. 도 6에서는, 단계 630 및 단계 640이 순서를 가지는 별개의 단계인 것으로 도시하였으나, 단계 630 및 단계 640 을 수행하는 순서는 도 6에 도시된 예시에 제한되지 않는다. 예를 들어, 제1 전자 장치 및 제2 전자 장치 는, 단계 630 및 단계 640을 병렬적으로, 또는 역순으로 수행할 수 있다. 도 6에서는, 단계 660 및 단계 670이 순서를 가지는 별개의 단계인 것으로 도시하였으나, 단계 660 및 단계 670 을 수행하는 순서는 도 6에 도시된 예시에 제한되지 않는다. 예를 들어, 제1 전자 장치 및 제2 전자 장치는, 단계 660 및 단계 670을 병렬적으로, 또는 역순으로 수행할 수 있으며, 하위 단계의 일부가 생략되거 나 변형될 수 있다. 예를 들어, 제1 거리가 제1 임계 값 미만인 경우 레인징 세션 시작 메시지를 UWB 서브시스 템에 전송하는 단계 665는 생략되고, 제2 거리가 제2 임계 값 미만인 경우 제1 전자 장치가 제2 전자 장치 에게 인증 요청 메시지를 전송하는 단계 681와 통합될 수 있다. 이 경우, 제1 전자 장치는, 제1 거리 가 제1 임계 값 미만이며, 및 제2 거리가 제2 임계 값 미만인 경우 인증 절차를 수행할 수 있다. 또한, 도 6에 도시된 단계들은, 제1 전자 장치와 제2 전자 장치가 UWB 통신을 통하여 사용자의 인증 절차를 수행하는 예시에 불과하며, 새로운 단계가 추가되거나 일부 단계가 생략 또는 변형될 수 있다. 예 를 들어, 제1 전자 장치와 사용자의 제1 거리를 획득하는 UWB 센싱 세션과 연관된, 단계 640 내지 단 계 665가 생략될 수 있다. 이 경우, 제1 전자 장치는, 제1 거리가 기설정된 조건을 만족하는 경우, 사용자 의 입력을 수신하여 사용자의 인증 절차를 수행할 수 있다. 도 7은 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치가 UWB 통신에 기반하 여 인증 해제 절차를 수행하는 동작의 흐름도를 도시한다. 도 7을 참조하면, 본 개시의 일 실시예에 따른 제1 전자 장치는, 제2 전자 장치와의 UWB 통신에 기반 하여, 사용자 서비스를 제공받는 사용자의 인증 해제 절차를 수행할 수 있다. 일 실시예에 따르면, 단계 710에서, 제1 전자 장치는, 기설정된 기간 동안 서비스를 제공받는 사용자(70 3)의 입력이 없음을 식별할 수 있다. 사용자의 입력은, 제1 전자 장치가 제공하는 서비스에 연관된 사용자 입력을 포함할 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 단계 720에서, 제1 전자 장치는, 제2 전자 장치와 UWB 통신에 기반한 UWB 센싱 세션을 수행하여 사용자와의 제1 거리를 획득할 수 있다. 도 7의 단계 720은, 도 6의 단계 660과 연관되어 이해될 수 있다. 예를 들어, 도 7의 단계 721 및 단계 722는, 각각 도 6의 단계 661 및 단계 662에 대응되는 동 작으로 이해될 수 있다. 예를 들어, 제1 전자 장치는, 단계 721에서, 제2 전자 장치에게 UWB 센싱 데 이터(sensing data)를 송신하고, 단계 722에서, 제2 전자 장치로부터, UWB 센싱 데이터에 기초하여 획득한 CIR(channel impulse response) 신호를 수신할 수 있다 일 실시예에 따르면, 단계 730에서, 제1 전자 장치와 제2 전자 장치는, 단계 721 및 단계 722에 대응 되는 동작을 반복적으로 수행할 수 있다. 이를 통해 후술할 단계 740에서, 제1 전자 장치는 제1 거리에 연 관된 정보(예: 사용자의 이동 속도 또는 방향)를 추가적으로 획득할 수 있다. 일 실시예에 따르면, 단계 740에서, 제1 전자 장치는, 사용자와의 제1 거리를 획득할 수 있다. 단계 740은, 도 6의 단계 663과 연관하여 이해될 수 있다. 일 실시예에 따르면, 단계 750에서, 제1 전자 장치는, 단계 740에서 획득한 제1 거리가 기설정된 사용자 인증을 해제하기 위한 조건을 만족하는지 여부를 판단할 수 있다. 예를 들어, 기설정된 사용자 인증을 해제하기 위한 조건은, 제1 거리가 제1 임계 값 이상인 경우를 포함할 수 있으나, 이에 제한되지 않는다. 예를 들어, 기 설정된 사용자 인증을 해제하기 위한 조건은, 제1 거리가 제1 임계 값 이상이며, 및 사용자의 인증을 해제 하기 위한 입력을 수신한 경우를 포함할 수 있다. 일 실시예에 따르면, 단계 760에서, 제1 전자 장치와 제2 전자 장치는 사용자의 제1 전자 장치 에 대한 인증을 해제하는 절차를 수행할 수 있다. 예를 들어, 제1 전자 장치는, 제2 전자 장치 에게, 사용자에게, 제1 전자 장치에 대한 인증을 해지할지 여부를 선택하도록 하는 UI를 제공하도록 할 수 있다. 예를 들어, 사용자의 제1 전자 장치에 대한 인증을 해제하는 절차는, 사용자에 대 한 인증 해제 요청을 논리적 접근 프레임워크(예: 도 4의 논리적 접근 프레임워크)에 전달하는 단계, 또는 사용자의 인증 상태를 “인증” 상태에서 “미인증” 상태로 변경하는 단계를 포함할 수 있으나, 이에 제 한되지 않는다. 도 7의 단계 760에서는, 제1 전자 장치와 제2 전자 장치가 사용자의 인증을 해 제하는 절차를 함께 수행하는 것으로 도시하였으나, 이에 제한되지 않는다. 예를 들어, 제1 전자 장치는, 단계 760에서, 독립적으로 사용자에 대한 인증 해제 절차를 수행할 수 있다. 도 8은 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치가 UWB 세션을 통한 거리 측정에 기초하 여 제2 전자 장치의 인증 절차를 수행하는 동작의 흐름도를 도시한다. 도 8의 흐름도는 도 5의 개요도 및 도 6의 흐름도를 참조하여 설명한 도 5의 제1 전자 장치 , 및 도 6의 제1 전자 장치의 동작에 대응될 수 있다. 또한, 도 8의 단계 810 내지 단계 860을 수행하는 '제1 전자 장치'는, 도 1의 전자 장치, 도 2의 제1 전자 장치, 도 3의 제1 전자 장치, 도 4의 제1 전자 장치, 도 5의 제1 전자 장치, 및 도 6의 제1 전자 장치에 대응될 수 있다. 예를 들어, 도 8의 단계 810 내지 단계 860을 수행하는 '제1 전자 장치'는, UWB 통신을 수행하는 장치를 포함할 수 있다. 일 실시예에 따르면, 단계 810에서, 제1 전자 장치(예: 도 6의 제1 전자 장치)는, 제2 전자 장치와 BLE 연 결(BLE link)을 수립(establish)할 수 있다. 단계 810에서, 제1 전자 장치(예: 도 6의 제1 전자 장치)가 제2 전자 장치(예: 도 6의 제1 전자 장치)와 BLE 연결(BLE link)을 수립(establish)하는 동작은, 도 6의 단계 610에서 도 6의 제1 전자 장치가 도 6의 제2 전자 장치와 BLE 연결을 수립하는 동작과 대응될 수 있다. 일 실시예에 따르면, 단계 820에서, 제1 전자 장치(예: 도 6의 제1 전자 장치)는, 단계 810에서 수립된 BLE 연결에 기초하여, 제2 전자 장치(예: 도 6의 제2 전자 장치)와 UWB 세션 정보를 교환(exchange)할 수 있다. 단계 820에서 제1 전자 장치(예: 도 6의 제1 전자 장치)가 수립된 BLE 연결에 기초하여, 제2 전자 장치(예: 도 6의 제2 전자 장치)와 UWB 세션 정보를 교환(exchange)하는 동작은, 도 6의 단계 620에 대응 될 수 있다. 예를 들어, 제1 전자 장치는 BLE 광고 패킷을 방송하며, 제2 전자 장치는 제1 전자 장치가 방송하 는 BLE 광고 패킷을 수신하여 제1 전자 장치를 탐색할 수 있다. 예를 들어, 제1 전자 장치는, BLE 광고 패킷을 수신한 제2 전자 장치의 BLE 연결 설정 요청 메시지를 수신함에 기초하여, 제2 전자 장치와 BLE 연결을 수립할 수 있다. 이에 관하여는, 도 6을 참조하여 상세히 설명한 바, 중복된 설명을 피하기 위하여 생략하도록 한다. 일 실시예에 따르면, 단계 830에서, 제1 전자 장치(예: 도 6의 제1 전자 장치)는, UWB 센싱 세션(sensing session)을 수행하여 제1 전자 장치(예: 도 6의 제1 전자 장치)와 제2 전자 장치(예: 도 6의 제2 전자 장 치)의 사용자(예: 도 6의 사용자) 사이의 제1 거리를 획득할 수 있다. 단계 830에서 제1 전자 장치 (예: 도 6의 전자 장치)가 제1 거리를 획득하는 동작은, 도 5의 단계 660에서 도 6의 제1 전자 장치 가 제1 거리를 획득하는 동작을 포함할 수 있다. 수립된 BLE 연결에 기초하여, 제2 전자 장치와 UWB 세션 정보 를 교환(exchange)하는 동작은, 도 6의 단계 620에 대응될 수 있다. 이에 관하여는, 도 6을 참조하여 상세히 설 명한 바, 중복된 설명을 피하기 위하여 생략하도록 한다. 일 실시예에 따르면, 단계 840에서, 제1 전자 장치는, UWB 레인징 세션(ranging session)을 수행하여 제1 전자 장치와 제2 전자 장치 사이의 제2 거리를 획득할 수 있다. 단계 840에서 제1 전자 장치가 UWB 레인징 세션을 통 하여 제2 거리를 획득하는 동작은 도 6의 단계 670에 대응될 수 있다. 예를 들어, 제1 전자 장치는, DS-TWR을 이용하여 제2 전자 장치와의 제2 거리를 획득할 수 있다. 일 실시예에 따르면, 단계 850에서, 제1 전자 장치는, 획득한 제1 거리가 제1 임계 값 미만이며, 및 제2 거리가 제2 임계 값 미만인지 여부를 판단할 수 있다. 예를 들어, 제1 임계 값과 제2 임계 값은 각각 동일한 값으로 기 설정된 거리 값을 포함할 수 있으나, 이에 제한되지 않는다. 예를 들어, 제1 임계 값과 제2 임계 값은, 기설정 된 동일한 거리 값을 포함할 수 있다. 단계 850은, 제2 전자 장치와 사용자 모두가 제1 전자 장치와 인접한 거 리에 위치하는지 여부를 판단하기 위한 단계로 이해될 수 있다. 일 실시예에 따르면, 제1 전자 장치가 단계 850에서 획득한 제1 거리가 제1 임계 값 이상이거나, 또는 제2 거리 가 제2 임계 값 이상인 것으로 판단함에 기초하여, 제1 전자 장치는 제1 거리를 획득하기 위한 단계 830 을 다 시 수행할 수 있다. 도 6에서는 단계 830 을 다시 수행하는 것으로 도시하였으나, 이에 제한되지 않는다. 예를 들어, 제1 전자 장치가 단계 850에서 제1 거리는 제1 임계 값 미만이고, 제2 거리는 제2 임계 값 이상인 것으로 판단함에 기초하여, 제1 전자 장치는 단계 840을 다시 수행하여 제2 거리만을 다시 획득할 수 있다. 일 실시예에 따르면, 단계 860에서, 제1 전자 장치는, 단계 850에서 획득한 제1 거리가 제1 임계 값 미만이며, 및 제2 거리가 제2 임계 값 미만인 것으로 판단함에 기초하여, 제2 전자 장치와 상기 사용자의 인증 (authentication) 절차를 수행할 수 있다. 단계 860은, 도 6의 단계 680에 대응될 수 있다. 도 9는 본 개시의 일 실시예에 따른 UWB 컨트롤리 정보(UWB controlee information) 메시지의 구조를 도시한다. 도 9를 참조하면, 일 실시예에 따른 UWB 컨트롤리 정보는, 컨트롤러와 컨트롤리 간의 UWB 세션 설정 을 위한 정보를 포함할 수 있다. 예를 들어, UWB 컨트롤리 정보는, UWB 기능 또는 능력에 관한 정보 (UWB_CAPABILITY), 선호 설정 정보(UWB_CONROLEE_PREFERENCE), 세션 키 정보(SESSION_KEY_INFO), 규제 정보 (UWB_REGULAROTY)를 포함할 수 있다. 일 실시예에 따르면, UWB 기능 또는 능력에 관한 정보(UWB_CAPABILITY)는, 전자 장치의 UWB 기능 및 지원 가능 한 범위를 나타내는 정보를 포함할 수 있다. 예를 들어, FiRa PHY 버전, MAC 버전, 장치 역할(이니시에이터/응 답자), 지원되는 채널 및 모드를 포함할 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 선호 설정 정보(UWB_CONROLEE_PREFERENCE)는, 예를 들어, 선호 설정 정보 (UWB_CONROLEE_PREFERENCE)는, 컨트롤리 장치가 선호하는 UWB 설정 정보를 포함할 수 있다. 예를 들어, 선호 채 널, 선호 전송 속도, STS(Short-Term Service) 설정 정보를 포함할 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 세션 키 정보(SESSION_KEY_INFO)는, UWB 세션 키를 생성하거나 사용하는데 필요한 정보를 포함할 수 있다. 예를 들어, 세션 키 길이, 세션 키 데이터, 응답자 특정 하위 세션 키 정보를 포함할 수 있으 나, 이에 제한되지 않는다. 일 실시예에 따르면, 규제 정보(UWB_REGULAROTY)는, UWB 통신을 지원하는 장치 간의 규제 준수를 보장하기 위한 정보를 포함할 수 있다. 예를 들어, 정보 소스, 야외 사용 허가, 국가 코드, 타임스탬프, 채널 번호 및 최대 전 력 수준에 관련된 정보를 포함할 수 있으나, 이에 제한되지 않는다. 도 10 및 도 11은 본 개시의 일 실시예에 따른 UWB 센싱 정보(UWB sensing information)의 구조를 도시한다. 도 10 및 도 11을 참조하면, 일 실시예에 따른 UWB 센싱 정보(1000, 1100)는, UWB 센싱 세션을 수행하기 위한 파라미터를 포함할 수 있다. 예를 들어, UWB 센싱 정보(1000, 1100)는, 수신 안테나 수(Number of Rx Antennas), 비트맵 길이(Bitmap Length), 비트맵 오프셋 (Bitmap Offset), 비트맵(Bitmap), 참조 탭의 타이 밍 오프셋(Timing Offset of the Reference Tap), I/Q 정규화 계수(Normalization Factor for In- phase/Quadrature), 수신 신호 강도(Received Signal Strength Indicator, RSSI), CIR In-Phase 리포트 (CIR In-Phase Report), 및 CIR Quadrature 리포트(CIR Quadrature Report)를 포함할 수 있으나, 이에 제한되 지 않는다. 도 11을 참조하면 UWB 센싱 정보(1000, 1100)에 포함된 각 정보들은, 지시하는 정보에 따라 제어 필드(control field) 및 콘텐트 필드(content field)로 분류될 수 있다. 제어 필드(control field)는, 데이터의 구조와 전송 을 제어하는 정보를 포함할 수 있다. 예를 들어, 제어 필드(control field)는, 수신 안테나 수(Number of Rx Antennas), 비트맵 길이(Bitmap Length), 비트맵 오프셋 (Bitmap Offset), 비트맵(Bitmap)을 포함할 수 있다. 예를 들어, 콘텐트 필드(content field)는, 각 세그먼트 및 수신 안테나 쌍에 대한 콘텐트인, 참조 탭의 타이 밍 오프셋(Timing Offset of the Reference Tap), I/Q 정규화 계수(Normalization Factor for In- phase/Quadrature), 수신 신호 강도(Received Signal Strength Indicator, RSSI), CIR In-Phase 리포트 (CIR In-Phase Report), 및 CIR Quadrature 리포트(CIR Quadrature Report)를 포함할 수 있다. 의 일 실시예에 따르면, 수신 안테나 수(Number of Rx Antennas)는, UWB 신호를 수신하는 안테나의 개수 정 보를 포함할 수 있으며, 2bits의 길이로 최대 4개의 수신 안테나까지 지시할 수 있다. 일 실시예에 따르면, 비트맵 길이(Bitmap Length)는, 비트맵 데이터의 길이 정보를 포함할 수 있으며, 2bits의 길이로, 비트맵의 길이가 32, 64, 128, 또는 256 bit임을 지시할 수 있다. 일 실시예에 따르면, 비트맵 오프셋 (Bitmap Offset)은, 비트맵 데이터의 시작 위치를 지시할 수 있다. 10bits의 길이로, 최대 1개까지의 심볼(symbol)을 지시할 수 있다. 여기서, '심볼'은 UWB 신호에서 하나의 데이터 단위를 의미할 수 있다. 일 실시예에 따르면, 비트맵(Bitmap)은, 채널 임펄스 응답(CIR) 데이터의 비트맵 표현에 대응되는 변수 (variable)를 포함할 수 있다. 비트맵(Bitmap)은, 최대 256 bits 의 길이로 표현될 수 있다. 일 실시예에 따르 면, 참조 탭의 타이밍 오프셋(timing offset of the reference tap)은, CIR 신호 중 처음으로 도착하는 탭의 오프셋 정보를 포함할 수 있다. 일 실시예에 따르면, I/Q 정규화 계수(Normalization Factor for In-phase/Quadrature) 는, I/Q 데이터를 정 규화하는 계수 정보를 포함할 수 있다. 예를 들어, 4 bits의 길이를 가지며, in-phase 및 quadrature CIR 값에 대한 공통 정규화 값을 지시할 수 있다. 일 실시예에 따르면, 수신 신호 강도(Received Signal Strength Indicator, RSSI) 는, 안테나에서 수신된 신호 강도를 측정한 값으로, 각 쌍(Rx 안테나, SENS 세그먼트)에 대해 측정되며, 8 bits의 길이로 표현될 수 있 다. 일 실시예에 따르면, CIR In-Phase 리포트 (CIR In-Phase Report)는, 채널 임펄스 응답(CIR)의 In-Phase 데이터를 포함하고, 각각의 탭별로 정규화되며, 및 16 bits의 길이로 표현될 수 있다. 일 실시예에 따르면, CIR Quadrature 리포트(CIR Quadrature Report) 는, 채널 임펄스 응답(CIR)의 Quadrature 데이터를 포함하고, 각각의 탭별로 정규화되며, 및 16 bits의 길이로 표현될 수 있다. 도 12는 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치가 UWB 통신에 기반하여 제2 전자 장치 의 사용자와의 제1 거리를 획득하는 동작의 흐름도를 도시한다. 도 12의 흐름도는, 도 5의 개요도 및 도 6의 흐름도를 참조하여 설명한 도 5의 제1 전자 장치 가 도 5의 단계 530에서 수행하는 동작에 포함될 수 있다. 도 12의 흐름도는, 도 6의 제1 전자 장치 가 도 6의 단계 661 내지 단계 663에서 수행하는 동작에 대응될 수 있다. 또한, 도 12의 흐름도는, 도 8의 단계 830에 대응될 수 있다. 도 12의 단계 1210 내지 단계 1230을 수행하는 '제1 전자 장치' 도 1의 전자 장치, 도 2의 제1 전자 장치 , 도 3의 제1 전자 장치, 도 4의 제1 전자 장치, 도 5의 제1 전자 장치, 및 도 6의 제1 전자 장치에 대응될 수 있다. 예를 들어, 도 12의 단계 1210 내지 단계 1230을 수행하는 '제1 전자 장치' 는, UWB 통신을 수행하는 장치를 포함할 수 있다. 도 12의 단계 1210 내지 단계 1230에서 언급되는 '제2 전자 장치'는, 도 2의 제2 전자 장치, 도 3의 제2 전자 장치, 도 4의 제2 전자 장치, 도 5의 제2 전자 장치, 및 도 6의 제2 전자 장치에 대 응될 수 있다. 일 실시예에 따르면, 단계 1210에서, 제1 전자 장치는, 제2 전자 장치에게, UWB 센싱 데이터를 송신할 수 있다. 예를 들어, UWB 센싱 데이터는, UWB 통신에 기반하여 전송되며, 제1 전자 장치와 제2 전자 장치 사이의 제1 거 리를 측정하기 위한 정보를 포함할 수 있다. UWB 센싱 데이터의 구조에 관하여는 도 13을 참조하여 상세히 설명 하도록 한다. 일 실시예에 따르면, 단계 1220에서, 제1 전자 장치는, 제2 전자 장치로부터, UWB 센싱 데이터에 기초하여 획득 한 CIR(channel impulse response) 신호를 수신할 수 있다. 예를 들어, CIR(channel impulse response) 신호는, UWB 신호가 전파되는 경로에 따른 특성을 나타낼 수 있다. 예를 들어, CIR 내의 각 임펄스는, 제1 전자 장치로부터 송신된 각각의 센싱 데이터가 제2 전자 장치까지 도달하기까지의 동안의 시간 및 도달한 시점 의 신호 세기에 연관된 정보를 포함할 수 있다. CIR 신호의 예시에 관하여는 도 14를 참조하여 상세히 설명하도 록 한다. 일 실시예에 따르면, 단계 1230에서, 제1 전자 장치는, CIR 신호에 기초하여, 제1 전자 장치와 사용자 사이의 제1 거리를 획득할 수 있다. 예를 들어, 제1 전자 장치는, CIR 신호에 포함된 각각의 탭 내지 임펄스 신호의 지 연 시간 및 위상에 기초하여, 제1 전자 장치와 사용자와의 제1 거리를 획득할 수 있다. 도 13은 본 개시의 일 실시예에 따른 UWB 센싱 데이터(sensing data)의 구조를 도시한다. 도 13에 도시된 UWB 센싱 데이터는, 도 12의 단계 1210에서, 제1 전자 장치가 제2 전자 장치에게 송신하 는 UWB 센싱 데이터에 대응될 수 있다. 일 실시예에 따르면, UWB 센싱 데이터는, 동기화 정보(SYNC), 프레임 구분자(start frame delimiter, SFD), 및 센싱(또는 센싱 데이터)(sensing, SENS)를 포함할 수 있으나, 이에 제한되지 않는다. UWB 센싱 데이터 의 각 구성 요소는, 서로 연계되어 거리 측정과 신호 분석에 이용될 수 있다. 일 실시예에 따르면, 동기화 정보(SYNC)는, 제1 전자 장치와 제2 전자 장치 간의 클락(clock)을 동기화시키 기 위한 정보를 포함할 수 있다. 일 실시예에 따르면, 프레임 구분자(start frame delimiter, SFD)는, UWB 센싱 데이터를 수신한 제2 전 자 장치가 센싱 데이터(SENS) 프레임의 시작점을 식별하기 위해 이용될 수 있다. 일 실시예에 따르면, 센싱(또는 센싱 데이터)(sensing, SENS)은, UWB 신호의 구체적인 특성과 거리를 측정 하기 위한 데이터 자체를 의미할 수 있다. 예를 들어, 제2 전자 장치는, UWB 센싱 데이터에 포함된 센싱(SENS) 정보에 기초하여, CIR 신호를 생성(획득)할 수 있다. 도 14는 본 개시의 일 실시예에 따른 CIR(channel impulse response) 신호의 예시를 도시한다. 도 13에 도시된 CIR 신호는, 도 12의 단계 1220에서, 제1 전자 장치가, 제2 전자 장치로부터 수신하는 CIR 신호를 설명하기 위한 예시로 이해될 수 있으며, 1 전자 장치가, 제2 전자 장치로부터 수신하는, 제1 거리 측정을 위한 신호가 도 13에 도시된 예시와 같이 제한되는 것은 아니다. 예를 들어, 제1 전자 장치는, 제2 전자 장치로부터 신호의 도착 각도(angle of arrival, AoA)를 포함하는 보고를 수신할 수 있다. 일 실시예에 따르면, CIR 신호는, 신호의 지연시간을 나타내는 시간축을 가로 축으로 하여, 높이에 따라 수신된 신호의 강도 또는 위상을 표현하는 복수개의 탭들을 포함할 수 있다. 일 실시예에 따르면, 노이즈 임계 값(noise threshold)은, CIR 신호 내의 유의미한 정보를 포함하 는 복수개의 탭들과 노이즈를 구별하기 위한 값을 의미할 수 있다. 일 실시예에 따르면, 최초로 감지된 탭은, CIR 신호 분석을 수행함에 있어, 참조 포인트(reference point)로 이용될 수 있다. 예를 들어, 제1 전자 장치(예: 도 6의 제1 전자 장치)는, 최초로 감지된 탭 의 지연 시간(t0)을 기준으로, 비트맵 오프셋(bitmap offset)에 대응되는 윈도우 오프셋(window offset, W_offset)만큼 떨어진 시점부터 비트맵 길이(bitmap length)에 대응되는 윈도우 길이(window length, W_length)만큼의 시점까지를 윈도우로 결정할 수 있다. 제1 전자 장치(예: 도 6의 제1 전자 장치)는, 윈도우 내의 복수개의 탭들을 분석하여 거리를 산출할 수 있다. 도 15는 본 개시의 일 실시예에 따른 UWB 센싱 세션 라운드의 구조를 도시한다. 도 16은 본 개시의 일 실시예에 따른 복수개의 시간 슬롯(slot)들을 포함하는 UWB 센싱 세션 라운드의 구조를 도시한다. 도 15 및 도 16에 도시된 UWB 센싱 세션 라운드(UWB sensing session round)(1500, 1600)는, 도 6의 단계 660 및 도 8의 단계 830에 연관될 수 있으며, 도 4의 UWB 서브시스템에 의해 수행되는 UWB 센싱 세션에서 수행 되는 동작을 시간단위로 표현한 구조로 이해될 수 있다. 도 15를 참조하면, UWB 센싱 세션 라운드는, 센싱 제어 단계(sensing control phase), 센싱 단계 (sensing phase), 및 센싱 측정 보고 단계(sensing measurement report phase)를 포함할 수 있다. UWB 센싱 세 션 라운드는, FiRa UWB Framework 또는 IEEE 802.15.4a 표준에 따른 규격에 정의된 구조를 포함할 수 있 다. 일 실시예에 따르면, 센싱 제어 단계 (Sensing Control Phase)는, CSML(예: 도 4의 FiRa CSML 프레임워크 )을 통해 센싱을 시작하고, 필요한 설정과 초기화를 수행하는 단계를 포함할 수 있다. 예를 들어, 제1 전 자 장치(예: 도 4의 제1 전자 장치)와 제2 전자 장치(예: 도 4의 제2 전자 장치)는, 이를 통해 센싱 주파수, 타이밍, 신호 강도 등의 파라미터를 설정할 수 있다. 일 실시예에 따르면, 센싱 단계 (Sensing Phase)는, UWB 신호를 수집하고, 거리 측정을 위해 필요한 데이터(예: CIR 신호, 도착각(AoA))를 기록하는 단계를 포함할 수 있다. 센싱 단계 (Sensing Phase)는, 도 6를 참조하여 설 명한, 도 6의 단계 661 내지 662에 대응되는 단계로 이해될 수 있다. 일 실시예에 따르면, 센싱 측정 보고 단계 (Sensing Measurement Report Phase)는, 수집된 데이터를 분석하여 필요한 정보(예: 위치 정보, 거리 정보, 환경 정보)를 도출하고, 시스템 관리자(예: 도 6의 제1 전자 장치 )에게 도출된 정보(예: 위치 정보, 거리 정보, 환경 정보)를 제공하는 단계를 포함할 수 있다. 예를 들어, 본 개시의 일 실시예에 따른 제1 전자 장치(예: 도 6의 제1 전자 장치)는, 센싱 측정 보고 단계 (Sensing Measurement Report Phase)에서, 사용자와의 제1 거리를 획득하는 도 6의 단계 663 및 획득한 제1 거리를 UWB 서브시스템(예: 도 4의 UWB 서브 시스템)에서 논리적 접근 프레임워크(예: 도 4의 논리적 접근 프레임워크 )로 전달하는 단계 664를 수행할 수 있다. 도 16을 참조하면, 일 실시예에 따른 센싱 라운드는 복수개의 시간 슬롯(slot)들로 구성될 수 있다. 각각 의 슬롯은 '센싱 슬롯(sensing slot)'으로 지칭될 수 있다. 일 실시예에 따르면, 센싱 라운드 내의 첫 번째 슬롯(slot 0)은 제어 단계를 위해 사용될 수 있다. 일 실시예에 따르면, 1개 이상(예: m개, m은 자연수)의 슬롯이 센싱 단계를 위하여 사용될 수 있다. 센싱 단계 내의 각 슬롯에서는 센싱 PPDU가 전송될 수 있다. 일 실시예에 따르면, 복수개(예: n-m개, n>m)의 슬롯이 측정 보고 단계를 위하여 사용될 수 있다. 도 17은 본 개시의 일 실시예에 따른 UWB 센싱 세션 시작 명령(UWB sesnsing session start command) 메시지의 구조 및 UWB 센싱 세션 시작 응답(UWB sensing session start response) 메시지의 구조를 도시한다. 도 17에 도시된 각 메시지(1710, 1720)는, 제1 전자 장치(예: 도 6의 제1 전자 장치)가, 도 6의 단계 650, 도 8의 단계 830을 수행함에 있어서, UWB 서브시스템(예: 도 4의 UWB 서브시스템)과 논리적 접근 프 레임워크(예: 도 4의 논리적 접근 프레임워크) 사이에 전달되는 메시지에 포함될 수 있다. 도 17을 참조하면, 일 실시예에 따른 제1 전자 장치(예: 도 4의 제1 전자 장치)는, UWB 센싱 세션을 수행 하기 위하여, 논리적 접근 프레임워크(예: 도 4의 논리적 접근 프레임워크)로부터 UWB 서브시스템(예: 도 4의 UWB 서브시스템)에게 UWB 센싱 세션의 시작을 지시하는 센싱 세션 시작 명령(sensing session start command) 메시지를 전달할 수 있다. 예를 들어, 센싱 세션 시작 명령 메시지는, 어느 센싱 쉘 (shall)을 시작할 지에 연관된 세션 핸들(session handle) 정보를 포함할 수 있다. 여기서, '센싱 쉘'은, 특정 센싱 작업 또는 세션을 관리하기 위한 논리적 단위로서, 특정 센싱 작업이나 세션을 관리하는 과정에서 필요한 자원과 설정을 의미할 수 있다. 예를 들어, '세션 핸들'은 특정 센싱 세션을 구분하는 고유 식별자를 의미할 수 있다. 일 실시예에 따른 제1 전자 장치(예: 도 4의 제1 전자 장치)는, UWB 서브시스템(예: 도 4의 UWB 서브시스 템)으로부터 논리적 접근 프레임워크(예: 도 4의 논리적 접근 프레임워크)에게 UWB 센싱 세션 시작의 성공 또는 실패 여부에 대한 상태(status)를 포함하는 센싱 세션 시작 응답(sensing session start response) 메시지를 전달할 수 있다. 예를 들어, 센싱 세션 시작 응답 메시지는, 1 octet 길이의 상태 정보를 포함하며, 에러(error)가 발생한 경우, 에러의 종류에 따라 상이한 상태 정보로 표현될 수 있다. 도 18은 본 개시의 일 실시예에 따른 센싱 세션 정보 통지(sensing session information notification) 메시지 의 구조를 도시한다. 도 18에 도시된 메시지는, 제1 전자 장치(예: 도 6의 제1 전자 장치)가, 도 6의 단계 650, 도 8의 단계 830을 수행함에 있어서, UWB 서브시스템(예: 도 4의 UWB 서브시스템)과 논리적 접근 프레임워크(예: 도 4 의 논리적 접근 프레임워크) 사이에 전달되는 메시지에 포함될 수 있다. 일 실시예에 따른 제1 전자 장치(예: 도 4의 제1 전자 장치)는, UWB 센싱 세션이 진행되는 중 거리 센싱을 수행하는 라운드(round)가 종료되거나 또는 기설정된 조건을 만족함에 기초하여, UWB 서브시스템(예: 도 4의 UWB 서브시스템)으로부터 논리적 접근 프레임워크(예: 도 4의 논리적 접근 프레임워크)에게 거리 센 싱의 결과를 포함하는 센싱 세션 정보 통지(sensing session information notification) 메시지를 전달 할 수 있다. 일 실시예에 따르면, 센싱 세션 정보 통지(sensing session information notification) 메시지는, 세션 시퀀스 카운터(session sequence counter), 세션 핸들(session handle), 센싱 측정 유형(sensing measurement type), MAC 어드레싱 모드 지시자(MAC Addressing mode indicator), 할당 정보(assigned), 센싱 측정 파라미터 (sensing measurement parameter)를 포함할 수 있다. RFU(reserved for future use)는 예비 공간을 의 미할 수 있다. 일 실시예에 따르면, 세션 시퀀스 카운터(session sequence counter)는, 세션의 수행횟수를 지시할 수 있다. 세 션이 시작될 때 0으로 시작되어 각 세션이 수행될 때마다 1씩 증가하며, 세션 중지 명령(SESSION_STOP_CMD)이 이슈(issue)되면 증가를 멈추고, 이후 세션 시작 명령(SESSION_START_CMD)에 따라 중지된 지점부터 다시 증가될 수 있다. 예를 들어, UWBS로부터 세션 시퀀스 카운터는 호스트(또는 프레임워크)에게 전송되는 모든 세션 정보 통지(SESSION_INFO_NTF)에 따라 세션 시퀀스 카운터가 1씩 증가될 수 있다. 가합니다. 애플리케이션은 세션 시 퀀스 카운터를 참조할 수 있다. 일 실시예에 따르면, 세션 핸들(session handle), 알림이 속한 세션 제어하기 위하여 특정 센싱 세션을 식별 하는 고유 식별자를 포함할 수 있다. 일 실시예에 따르면, 센싱 측정 유형(sensing measurement type)은, 센싱 측정을 수행하는 방식을 구별하기 위 한 유형을 지시할 수 있다. 예를 들어, 0x00에 대응되는 할당(assigned) 방식은, 센싱 세션 시작 시 특정하게 할당된 측정 방식을 의미할 수 있다. 예를 들어, 0x01에 대응되는 모노(mono) 방식은, 단일 안테나 또는 단 일 경로를 사용하는 측정 방식을 의미할 수 있다. 예를 들어, 0x02에 대응되는 Bi STATIC 방식은, 두 개의 고정된 지점을 이용한 측정 방식을 의미할 수 있다. 예를 들어, 도 3 내지 도 6을 참조하여 설명한 센싱 세션수행 방식은 Bi STATIC 방식에 대응될 수 있다. 일 실시예에 따르면, MAC 어드레싱 모드 지시자(MAC Addressing mode indicator)는, 거리 측정에 있어서 MAC 어드레싱을 수행하는 모드를 지시할 수 있다. 예를 들 어, 0x00는, 2 Octets short MAC address를 지시할 수 있다. 예를 들어, 0x01는, 8 Octets extended MAC Address를 지시할 수 있다. 일 실시예에 따르면, 할당 정보(assigned)는, 센싱 세션을 위하여 할당된 대역과 연관된 정보를 포함할 수 있다. 일 실시예에 따르면, 센싱 측정 파라미터(sensing measurement parameter)는, 참조 탭의 타이밍 오프셋 (Timing Offset of the Reference Tap), I/Q 정규화 계수(Normalization Factor for In-phase/Quadrature), 수신 신호 강도(Received Signal Strength Indicator, RSSI), CIR In-Phase 리포트 (CIR In-Phase Report), 및 CIR Quadrature 리포트(CIR Quadrature Report)를 포함할 수 있다. 센싱 측정 파라미터(sensing measurement parameter) 내의 각 구성 요소들의 정의에 관하여는 도 10을 참조하여 상술한 내용과 중복되 므로 생략하도록 한다. 일 실시예에 따르면, 논리적 접근 프레임워크(예: 도 4의 논리적 접근 프레임워크)로부터 UWB 서브시스템 (예: 도 4의 UWB 서브시스템)에게, 센싱 세션의 종료를 지시하는 센싱 세션 종료 명령(sensing session termination command) 메시지(미도시)를 전달할 수 있다. 도 19는 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치가 UWB 통신에 기반하여 사용자의 인증 해제 절차를 수행하는 동작의 흐름도를 도시한다. 도 19를 참조하면, 일 실시예에 따른 제1 전자 장치(예: 도 7의 제1 전자 장치)는, 제2 전자 장치(예: 도 7의 제2 전자 장치)와의 UWB 통신에 기반하여 사용자(예: 도 7의 사용자)에 대한 인증을 해제하는 절 차를 수행할 수 있다. 도 19의 흐름도 내의 동작 1910 내지 동작 1920은, 도 7을 참조하여 설명한, 제1 전자 장치의 동작에 대응될 수 있다. 일 실시예에 따르면, 단계 1910에서, 제1 전자 장치(예: 도 7의 제1 전자 장치)는, 기설정된 기간 동안, 사용자 입력이 수신되지 않으며, 및 제1 전자 장치(예: 도 7의 제1 전자 장치)와 사용자(예: 도 7의 사용 자)의 제1 거리가 제3 임계 값 이상인지 여부를 판단할 수 있다. 예를 들어, 제1 거리는, 제1 전자 장치 (예: 도 7의 제1 전자 장치)는, 도 6의 단계 660 또는 도 7의 단계 720을 참조하여 설명한 동작을 통하여 획득할 수 있다. 예를 들어, 제3 임계 값은, 제1 임계 값과 동일한 값으로 설정될 수 있으나, 이에 제한되지 않 는다. 예를 들어, 제3 임계 값은, 제1 임계 값보다 큰 값으로 설정될 수 있다. 일 실시예에 따르면, 단계 1910에서, 제1 전자 장치(예: 도 7의 제1 전자 장치)가, 기설정된 기간 동안, 사용자 입력이 수신되거나, 또는 제1 전자 장치(예: 도 7의 제1 전자 장치)와 사용자(예: 도 7의 사용자 )의 제1 거리가 제3 임계 값 미만인 것으로 판단된 경우, 제1 전자 장치(예: 도 7의 제1 전자 장치) 는, 단계 1910을 반복적으로 수행할 수 있다. 일 실시예에 따르면, 단계 1920에서, 제1 전자 장치(예: 도 7의 제1 전자 장치)는, 단계 1910에서 기설정 된 기간 동안, 사용자 입력이 수신되지 않으며, 및 제1 전자 장치(예: 도 7의 제1 전자 장치)와 사용자(예: 도 7의 사용자)의 제1 거리가 제3 임계 값 이상인 것으로 판단함에 기초하여, 사용자(예: 도 7 의 사용자)의 인증을 해제하는 절차를 수행할 수 있다. 예를 들어, 단계 1920는 도 7의 단계 760을 참조하 여 설명한, 도 7의 제1 전자 장치의 동작을 포함할 수 있다. 도 20은 본 개시의 일 실시예에 따른 제1 전자 장치의 구성을 나타내는 블록도를 도시한다. 도 20을 참조하면, 본 개시의 일 실시예에 따른 제1 전자 장치는 통신 회로, 안테나 모듈, 메모리 및 프로세서를 포함할 수 있다. 다만, 제1 전자 장치의 구성이 이에 한정되는 것은 아니고, 도 20의 상술한 구성 요소 중 일부만을 포함하거나, 상술한 구성 요소 외에 적어도 하나 이상의 다른 구성 요소(예: 도 1의 입력 모듈, 디스플레이 모듈)을 더 포함할 수도 있다. 일 실시예에 따르면, 제 1 전자 장치는 도 1의 전자 장치, 도 2의 제1 전자 장치, 도 3의 제1 전자 장치, 도 4의제1 전자 장치, 도 5의 제1 전자 장치, 및 도 6의 제1 전자 장치에 대응될 수 있다. 도 20의 제 1 전자 장치는 도 1의 전자 장치, 또는 도 4의 제1 전자 장치의 구성 요소들(예: 모듈들) 중 적어도 하나와 동일하거나 유사한 구성 요소를 포함할 수 있다. 이에 따라, 통신 회로는 도 1의 통신 모 듈, 또는 무선 통신 모듈과 대응될 수 있고, 안테나 모듈은 도 1의 안테나 모듈에 대응될 수 있다. 또한, 메모리 및 프로세서는 도 1의 메모리 및 프로세서에 대응될 수 있다. 통신 회로는 제1 전자 장치와 외부 전자 장치(예: 도 21의 제2 전자 장치) 간의 무선 통신을 지원할 수 있다. 예를 들어, 통신 회로는 규정된 무선 통신 프로토콜에 따라, 무선 통신이 지원하는 주파 수 대역을 이용하여 외부 전자 장치(예: 도 21의 제2 전자 장치)와 신호 및/또는 데이터를 송수신할 수 있다. 일 실시예에서, 통신 회로는, UWB(ultra-wideband), 블루투스, 저전력 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 무선 통신 네트워크를 통해 외부 전자 장치와 통신할 수 있다. 일 실시예에서, 통신 회로는 프로세서와 독립적으로 운영될 수 있고, 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에서, 통신 회로는 통 신 인터페이스 또는 통신 모듈로 지칭될 수도 있다. 일 실시예에서, 통신 회로는 UWB 모듈을 포함할 수 있다. UWB는 IEEE 802.15.4 표준에 따르면 500 MHz 이상의 대역폭을 사용하는 무선 통신 기술로, 넓은 주파수 대역을 사용하는 특성으로 인해 정확한 거리 및 각도를 측정하는 데 사용될 수 있다. UWB는 UWB 통신이 적용되는 대역 자체를 의미할 수도 있다. IEEE 802.15.4z 표준에서는 물리계층에서 외부의 공격자가 UWB 통신에 접근하거나 조작하는 것을 막아주는 STS(scrambled timestamp sequence) 기능을 도입하여 보안을 강화하여 활용도가 높아졌다. UWB 기술을 이용하 면, 장치들 간의 안전하고 정확한 거리 측정이 가능하고, 이를 통해, 다른 UWB 전자 장치(예: 도 21의 제2 전자 장치)의 상대 위치를 결정하거나 또는 고정 장치들로부터의 거리에 기반하여 다른 UWB 전자 장치(예: 도 21의 제2 전자 장치)의 절대 위치를 결정할 수 있다. 일 실시예에서, 통신 회로는 BLE 모듈을 포함할 수 있다. 제1 전자 장치는 BLE 모듈(201 2)을 이용하여 BLE 광고 패킷(advertisement packet)을 방송(broadcast)하거나, 수신할 수 있다. 제1 전자 장 치는, BLE 모듈을 이용하여 BLE 통신을 통해, UWB 세션에 연관된 파리미터를 협상하거나 설정할 수 있다. 안테나 모듈은 복수의 안테나들을 포함할 수 있고, 통신 네트워크(예: 도 1의 제1 네트워크)에서 사 용되는 통신 방식에 적합한 적어도 하나의 안테나가 통신 회로에 의하여 복수의 안테나들로부터 선택될 수 있다. 메모리는 제1 전자 장치의 동작을 위한 다양한 정보를 저장할 수 있다. 메모리에 저장되는 정보는, 예를 들어, 소프트웨어 및 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 일 실시예에서, 메모리에 저장되는 정보는 추가적인 데이터를 송신하기 위한 동작을 위한 적어도 하나의 인스트럭션을 포함할 수 있다. 인스트럭션은 도 1의 프로그램에 대응될 수 있다. 인스트럭션은 프로세서 를 통해 실행될 수 있으며, 프로세서에 의해 인스트럭션들이 실행됨으로써, 제1 전자 장치가 본 개시의 일 실시예에 따른 동작들을 수행할 수 있다. 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로세서는 제1 전자 장치의 적어도 하나의 다른 구성 요소(예: 하드웨어 또는 소프트웨어 구성 요 소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 프로세서는 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성 요소(예: 통신 회로)로부터 수신된 명령 또는 데이 터를 메모리에 로드하고, 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 메모리 에 저장할 수 있다. 도 21은 본 개시의 일 실시예에 따른 제2 전자 장치의 구성을 나타내는 블록도를 도시한다. 도 21을 참조하면, 본 개시의 일 실시예에 따른 제1 전자 장치는 통신 회로, 안테나 모듈, 메모리 및 프로세서를 포함할 수 있다. 다만, 제2 전자 장치의 구성이 이에 한정되는 것은 아니고, 도 21의 상술한 구성 요소 중 일부만을 포함하거나, 상술한 구성 요소 외에 적어도 하나 이상의 다른 구성 요소(예: 도 1의 입력 모듈, 디스플레이 모듈)을 더 포함할 수도 있다. 일 실시예에 따르면, 제 2 전자 장치는 도 1의 전자 장치, 도 2의 제2 전자 장치, 도 3의 제2 전자 장치, 도 4의 제2 전자 장치, 도 5의 제2 전자 장치, 및 도 6의 제2 전자 장치에 대응될 수 있다. 도 21의 제2 전자 장치는 도 1의 전자 장치, 또는 도 4의 제2 전자 장치의 구성 요소들(예: 모듈들) 중 적어도 하나와 동일하거나 유사한 구성 요소를 포함할 수 있다. 이에 따라, 통신 회로는 도 1의 통신 모 듈, 또는 무선 통신 모듈과 대응될 수 있고, 안테나 모듈은 도 1의 안테나 모듈에 대응될 수 있다. 또한, 메모리 및 프로세서는 도 1의 메모리 및 프로세서에 대응될 수 있다. 통신 회로는 제2 전자 장치와 외부 전자 장치(예: 도 20의 제1 전자 장치) 간의 무선 통신을 지원할 수 있다. 예를 들어, 통신 회로는 규정된 무선 통신 프로토콜에 따라, 무선 통신이 지원하는 주파 수 대역을 이용하여 외부 전자 장치(예: 도 20의 제1 전자 장치)와 신호 및/또는 데이터를 송수신할 수 있다. 일 실시예에서, 통신 회로는, UWB(ultra-wideband), 블루투스, 저전력 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 무선 통신 네트워크를 통해 외부 전자 장치와 통신할 수 있다. 일 실시예에서, 통신 회로는 프로세서와 독립적으로 운영될 수 있고, 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에서, 통신 회로는 통 신 인터페이스 또는 통신 모듈로 지칭될 수도 있다. 일 실시예에서, 통신 회로는 UWB 모듈을 포함할 수 있다. UWB는 IEEE 802.15.4 표준에 따르면 500 MHz 이상의 대역폭을 사용하는 무선 통신 기술로, 넓은 주파수 대역을 사용하는 특성으로 인해 정확한 거리 및 각도를 측정하는 데 사용될 수 있다. UWB는 UWB 통신이 적용되는 대역 자체를 의미할 수도 있다. IEEE 802.15.4z 표준에서는 물리계층에서 외부의 공격자가 UWB 통신에 접근하거나 조작하는 것을 막아주는 STS(scrambled timestamp sequence) 기능을 도입하여 보안을 강화하여 활용도가 높아졌다. UWB 기술을 이용하 면, 장치들 간의 안전하고 정확한 거리 측정이 가능하고, 이를 통해, 다른 UWB 전자 장치(예: 도 20의 제1 전자 장치)의 상대 위치를 결정하거나 또는 고정 장치들로부터의 거리에 기반하여 다른 UWB 전자 장치(예: 도 20의 제1 전자 장치)의 절대 위치를 결정할 수 있다. 일 실시예에서, 통신 회로는 BLE 모듈을 포함할 수 있다. 제2 전자 장치는 BLE 모듈 을 이용하여 BLE 광고 패킷(advertisement packet)을 방송(broadcast)하거나, 수신할 수 있다. 제2 전자 장치 는, BLE 모듈을 이용하여 BLE 통신을 통해, UWB 세션에 연관된 파리미터를 협상하거나 설정할 수 있다. 안테나 모듈은 복수의 안테나들을 포함할 수 있고, 통신 네트워크(예: 도 1의 제1 네트워크)에서 사 용되는 통신 방식에 적합한 적어도 하나의 안테나가 통신 회로에 의하여 복수의 안테나들로부터 선택될 수 있다. 메모리는 제2 전자 장치의 동작을 위한 다양한 정보를 저장할 수 있다. 메모리에 저장되는 정보는, 예를 들어, 소프트웨어 및 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 일 실시예에서, 메모리에 저장되는 정보는 추가적인 데이터를 송신하기 위한 동작을 위한 적어도 하나의 인스트럭션을 포함할 수 있다. 인스트럭션은 도 1의 프로그램에 대응될 수 있다. 인스트럭션은 프로세서 를 통해 실행될 수 있으며, 프로세서에 의해 인스트럭션들이 실행됨으로써, 제2 전자 장치가 본 개시의 일 실시예에 따른 동작들을 수행할 수 있다. 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로세서는 제2 전자 장치의 적어도 하나의 다른 구성 요소(예: 하드웨어 또는 소프트웨어 구성 요 소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 프로세서는 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성 요소(예: 통신 회로)로부터 수신된 명령 또는 데이 터를 메모리에 로드하고, 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 메모리 에 저장할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 의해 수행되는 방법은, UWB 통신을 수행하는 제2 전자 장치와 BLE(bluetooth low energy) 연결(BLE link)을 수립 (establish)하는 단계, 제2 전자 장치와 수립된 BLE 연결에 기초하여 UWB 세션 정보를 교환(exchange)하는 단계, UWB 센싱 세션(sensing session)을 수행하여 제1 전자 장치와 제2 전자 장치의 사용자 사이의 제1 거리를 획득하는 단계, UWB 레인징 세션(ranging session)을 수행하여 제1 전자 장치와 제2 전자 장치 사이의 제2 거 리를 획득하는 단계, 및 1 거리가 제1 임계 값 미만이며, 및 제2 거리가 제2 임계 값 미만인 경우, 제2 전자 장치와 사용자의 인증(authentication) 절차를 수행하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 의해 수행되는 방법은, 제2 전자 장치와 BLE 연결을 수립하는 단계는, 논리적 접근 서비스(logical access servic e)를 지원하는 장치임을 나타내는 지시자를 포함하는 BLE 광고 패킷(advertisement packet)을 방송 (broadcasting)하는 단계, 제2 전자 장치로부터, BLE 광고 패킷에 기초하여 BLE 연결의 설정을 요청하는 메 시지를 수신하는 단계 및, 제2 전자 장치에게, BLE 연결의 설정 정보를 포함하는 응답 메시지를 송신하는 단 계를 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 의해 수행되는 방법은, 제2 전자 장치와 UWB 세션 정보를 교환하는 단계는, 제2 전자 장치와 UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상(negotiation)하는 단계, 및 제2 전자 장치와 UWB 센싱 세션에 연 관된 적어도 하나의 제2 파라미터를 설정하는 단계를 포함하며, UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상하는 단계는, 제2 전자 장치로부터, UWB 능력(UWB capability) 정보를 포함하는 UWB 컨트롤리 정보(UWB controlee information) 메시지를 수신하는 단계, 및 제2 전자 장치에게, UWB 레인징 세션에 연관 된 UWB 설정 정보를 포함하는 UWB 세션 데이터(UWB session data) 메시지를 송신하는 단계를 포함하고, 및 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하는 단계는, 제2 전자 장치로부터, UWB 센싱 정보(UWB sensing information)를 포함하는 UWB 센싱 세션 요청 메시지를 수신하는 단계, 및 제2 전자 장치에게, 수락 (accept) 또는 선호(preferred) UWB 센싱 세션 파라미터를 포함하는 UWB 센싱 세션 응답 메시지를 송신하는 단 계를 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 의해 수행되는 방법은, UWB 센싱 세션을 수행하여 제1 거리를 획득하는 단계는, 제2 전자 장치에게, UWB 센싱 데이 터(sensing data)를 송신하는 단계, 제2 전자 장치로부터, UWB 센싱 데이터에 기초하여 획득한 CIR(channel impulse response) 신호를 수신하는 단계, 및 CIR 신호에 기초하여, 제1 거리를 획득하는 단계를 포함하고, 및 UWB 레인징 세션을 수행하여 제2 거리를 획득하는 단계는, UWB DS-TWR(double-sided two-way ranging)를 이용하여 제2 거리를 획득하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 의해 수행되는 방법은, UWB 센싱 세션을 수행하는 단계는, 논리적 접근 프레임워크(logical access framework)로부 터 UWB 서브시스템(UWB sub-system, UWBS)에게 UWB 센싱 세션의 시작을 지시하는 센싱 세션 시작 명령 (sensing session start command) 메시지를 전달하는 단계, UWB 서브시스템으로부터 논리적 접근 프레임워크에 게 UWB 센싱 세션 시작의 성공 또는 실패 여부에 대한 상태(status)를 포함하는 센싱 세션 시작 응답(sensing session start response) 메시지를 전달하는 단계, UWB 센싱 세션이 진행되는 중 거리 센싱을 수행하는 라운드 (round)가 종료되거나, 기설정된 조건을 만족함에 기초하여 UWB 서브시스템으로부터 논리적 접근 프레임워크에 게 거리 센싱의 결과를 포함하는 센싱 세션 정보 통지(sensing session information notification) 메시지를 전달하는 단계, 및 논리적 접근 프레임워크로부터 UWB 서브시스템에게, 센싱 세션의 종료를 지시하는 센싱 세션 종료 명령(sensing session termination command) 메시지를 전달하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)에 의해 수행되는 방법은, 제1 전자 장치에 대하여 기설정된 기간 동안 사용자 입력이 수신되지 않음을 식별함에 기초 하여, 제2 전자 장치와 UWB 센싱 세션을 수행하여 제1 거리를 획득하는 단계, 획득한 제1 거리가 사용자 인증을 해제하기 위한 기설정된 조건을 만족하는 지를 판단하는 단계, 및 획득한 제1 거리가 사용자 인증을 해 제하기 위한 기설정된 조건을 만족하는 것으로 판단함에 기초하여 사용자 인증의 해제 절차를 수행하는 단계 를 더 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)에 의해 수행되는 방법은, UWB 통신을 수행하는 제1 전자 장치와 BLE(bluetooth low energy) 연결을 수립(establish)하 는 단계, 상기 제1 전자 장치와 상기 수립된 BLE 연결에 기초하여 UWB 세션 정보를 교환(exchange)하는 단계, 상기 제1 전자 장치와 UWB 센싱 세션(sensing session)을 수행 하는 단계, 상기 제1 전자 장치와 UWB 레인징 세 션(ranging session)을 수행 하는 단계, 및 상기 제1 전자 장치와 사용자에 대한 인증(authentication) 절차를 수행하는 단계를 포함하고, 상기 인증 절차는, 상기 제1 전자 장치와 상기 사용자 사이의 제1 거리가 제1 임계 값 미만이며, 및 상기 제1 전자 장치와 상기 제2 전자 장치 사이의 제2 거리가 제2 임계 값 미만인 경우에 수행 될 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)에 의해 수행되는 방법은, 제1 전자 장치와 BLE 연결을 수립하는 단계는, 제1 전자 장치가 방송(broadcasting)하며논리적 접근 서비스(logical access service)를 지원하는 장치임을 나타내는 지시자를 포함하는 BLE 광고 패킷 (advertisement packet)을 수신하는 단계, 제1 전자 장치에게, BLE 광고 패킷에 기초하여 BLE 연결의 설정 을 요청하는 메시지를 송신하는 단계, 및 제1 전자 장치로부터, BLE 연결의 설정 정보를 포함하는 응답 메시 지를 수신하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)에 의해 수행되는 방법에 있어서, 제1 전자 장치와 UWB 세션 정보를 교환하는 단계는, 제1 전자 장치와 UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상(negotiation)하는 단계, 및 제1 전자 장치와 UWB 센싱 세 션에 연관된 적어도 하나의 제2 파라미터를 설정하는 단계를 더 포함하며, UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상하는 단계는, 제1 전자 장치에게, UWB 능력(UWB capability) 정보를 포함하는 UWB 컨트롤리 정보(UWB controlee information) 메시지를 송신하는 단계, 및 제1 전자 장치로부터, UWB 레인징 세션에 연관된 UWB 설정 정보를 포함하는 UWB 세션 데이터(UWB session data) 메시지를 수신하는 단계를 포함하 고, 및 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하는 단계는, 제1 전자 장치에게, UWB 센 싱 정보(UWB sensing information)를 포함하는 UWB 센싱 세션 요청 메시지를 송신하는 단계, 및 제1 전자 장치 로부터, 수락(accept) 또는 선호(preferred) UWB 센싱 세션 파라미터를 포함하는 UWB 센싱 세션 응답 메시지를 수신하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)에 의해 수행되는 방법에 있어서, 상기 UWB 센싱 세션을 수행 하는 단계는, 상기 제1 전자 장치로부터, UWB 센싱 데이 터(sensing data)를 수신하는 단계, 및 상기 제1 전자 장치에게, 상기 UWB 센싱 데이터에 기초하여 획득한 CIR(channel impulse response) 신호를 송신하는 단계를 포함하고, 상기 UWB 레인징 세션을 수행하는 단계는, 상기 제1 전자 장치와 UWB DS-TWR(double-sided two-way ranging)를 수행 하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)에 의해 수행되는 방법은, 제1 전자 장치가 제1 전자 장치에 대하여 기설정된 기간 동안 사용자 입력이 수신되지 않음 을 식별함에 기초하여, 상기 제1 전자 장치와 상기 UWB 센싱 세션을 수행 하는 단계, 상기 제1 전자 장치와 상 기 사용자 인증의 해제 절차를 수행하는 단계를 더 포함할 수 있다. 상기 사용자 인증의 해제 절차를 수행하는 단계는, 상기 제1 전자 장치가 상기 획득한 제1 거리가 상기 사용자 인증을 해제하기 위한 상기 기설정된 조건 을 만족하는 경우에 수행될 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제1 전자 장치(electronic device)는, UWB 모듈, BLE(bluethooth low energy) 모듈, 적어도 하나의 프로세서, 및 명령어들을 저장하는 메모리를 포함할 수 있다. 본 개시의 일 실시예에 따르면, 명령어들은, 적어도 하나의 프로세서에 의해 실행되어, 제1 전자 장치가, UWB 통신을 수행하는 제2 전자 장치와 BLE(bluetooth low energy) 연결(BLE link)을 수립(establish)하고, 제 2 전자 장치와 수립된 BLE 연결에 기초하여 UWB 세션 정보를 교환하고, UWB 센싱 세션(sensing session)을 수 행하여, 제1 전자 장치와 제2 전자 장치의 사용자 사이의 제1 거리를 획득하고, UWB 레인징 세션(ranging session)을 수행하여, 제1 전자 장치와 제2 전자 장치 사이의 제2 거리를 획득하고, 및 제1 거리가 제1 임계 값 미만이며, 및 제2 거리가 제2 임계 값 미만인 경우, 제2 전자 장치와 사용자의 인증(authentication) 절 차를 수행할 수 있다. 본 개시의 일 실시예에 따르면, 명령어들은, 적어도 하나의 프로세서에 의해 실행되어, 제1 전자 장치가, 논 리적 접근 서비스(logical access service)를 지원하는 장치임을 나타내는 지시자를 포함하는 BLE 광고 패킷 (advertisement packet)을 방송(broadcasting)하고, 제2 전자 장치로부터, BLE 광고 패킷에 기초하여 BLE 연결의 설정을 요청하는 메시지를 수신하고, 및 제2 전자 장치에게, BLE 연결의 설정 정보를 포함하는 응답 메시지를 송신하도록 할 수 있다. 본 개시의 일 실시예에 따르면, 명령어들은, 적어도 하나의 프로세서에 의해 실행되어, 제1 전자 장치가, 제2 전자 장치와 UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상(negotiation)하고, 및 제2 전 자 장치와 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하도록 하되, 제2 전자 장치와 UWB 레 인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상하기 위하여, 제2 전자 장치로부터, UWB 능력(UWBcapability) 정보를 포함하는 UWB 컨트롤리 정보(UWB controlee information) 메시지를 수신하고, 및 제2 전 자 장치에게, UWB 레인징 세션에 연관된 UWB 설정 정보를 포함하는 UWB 세션 데이터(UWB session data) 메시지 를 송신하도록 하고, 제2 전자 장치와 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하기 위하 여, 제2 전자 장치로부터, UWB 센싱 정보(UWB sensing information)를 포함하는 UWB 센싱 세션 요청 메시지를 수신하고, 및 제2 전자 장치에게, 수락(accept) 또는 선호(preferred) UWB 센싱 세션 파라미터를 포함하는 UWB 센싱 세션 응답 메시지를 송신하도록 할 수 있다. 본 개시의 일 실시예에 따르면, 명령어들은, 적어도 하나의 프로세서에 의해 실행되어, 제1 전자 장치가, UWB 센싱 세션을 수행하는 동안, 제2 전자 장치에게, UWB 센싱 데이터(sensing data)를 송신하고, 제2 전자 장치로부터, UWB 센싱 데이터에 기초하여 획득한 CIR(channel impulse response) 신호를 수신하고, 및 CIR 신호에 기초하여, 제1 거리를 획득하도록 하며, 및 UWB 레인징 세션을 수행하는 동안, UWB DS-TWR(double- sided two-way ranging)을 이용하여 제2 거리를 획득하도록 할 수 있다. 본 개시의 일 실시예에 따르면, 명령어들은, 적어도 하나의 프로세서에 의해 실행되어, 제1 전자 장치가, 제1 전자 장치에 대하여 기설정된 기간 동안 사용자 입력이 수신되지 않음을 식별함에 기초하여, 제2 전자 장 치와 UWB 센싱 세션을 수행하여 제1 거리를 획득하고, 획득한 제1 거리가 사용자 인증을 해제하기 위한 기 설정된 조건을 만족하는 지를 판단하고, 및 획득한 제1 거리가 사용자 인증을 해제하기 위한 기설정된 조건 을 만족하는 것으로 판단함에 기초하여 사용자 인증의 해제 절차를 수행하도록 할 수 있다. 본 개시의 일 실시예에 따른 UWB(ultra-wide band) 통신을 수행하는 제2 전자 장치(electric device)는, UWB 모듈, BLE(bluethooth low energy) 모듈, 적어도 하나의 프로세서, 및 명령어들을 저장하는 메모리를 포함할 수 있다. UWB 통신을 수행하는 제1 전자 장치와 BLE(bluetooth low energy) 연결을 수립(establish)하고, 제1 전 자 장치와 수립된 BLE 연결에 기초하여 UWB 정보를 교환(exchange)하고, 제1 전자 장치와 UWB 센싱 세션 (sensing session)을 수행하고, 제1 전자 장치와 UWB 레인징 세션(ranging session)을 수행하고, 및 제1 전자 장치와 사용자에 대한 인증(authentication) 절차를 수행하도록 할 수 있다. 인증 절차는, 제1 전자 장치와 사 용자 사이의 제1 거리가 제1 임계 값 미만이며, 및 제1 전자 장치와 제2 전자 장치 사이의 제2 거리가 제2 임계 값 미만인 경우 수행될 수 있다. 본 개시의 일 실시예에 따른 명령어들은, 적어도 하나의 프로세서에 의해 실행되어, 제2 전자 장치가, 제1 전자 장치가 방송(broadcasting)하며 논리적 접근 서비스(logical access service)를 지원하는 장치임을 나타 내는 지시자를 포함하는 BLE(bluetooth low energy) 광고 패킷(advertisement packet)을 수신하고, 제1 전자 장치에게, BLE 광고 패킷에 기초하여 BLE 연결의 설정을 요청하는 메시지를 송신하고, 및 제1 전자 장치로부 터, BLE 연결의 설정 정보를 포하는 응답 메시지를 수신하도록 할 수 있다. 본 개시의 일 실시예에 따른 명령어들은, 적어도 하나의 프로세서에 의해 실행되어, 제2 전자 장치가, 제1 전자 장치와 UWB 레인징 세션에 연관된 적어도 하나의 제1 파라미터를 협상(negotiation)하고, 및 제1 전자 장치와 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하도록 하되, 제1 전자 장치와 UWB 레인 징 세션에 연관된 적어도 하나의 제1 파라미터를 협상하기 위하여, 제1 전자 장치에게, UWB 능력(UWB capability) 정보를 포함하는 UWB 컨트롤리 정보(UWB controlee information) 메시지를 송신하고, 및 제1 전 자 장치로부터, UWB 레인징 세션에 연관된 UWB 설정 정보를 포함하는 UWB 세션 데이터(UWB session data) 메시 지를 수신하도록 하고, 및 제1 전자 장치와 UWB 센싱 세션에 연관된 적어도 하나의 제2 파라미터를 설정하기 위하여, 제1 전자 장치에게, UWB 센싱 정보(UWB sensing information)를 포함하는 UWB 센싱 세션 요청 메시지 를 송신하고, 및 제1 전자 장치로부터, 수락(accept) 또는 선호(preferred) UWB 센싱 세션 파라미터를 포함하 는 UWB 센싱 세션 응답 메시지를 수신하도록 할 수 있다. 본 개시의 일 실시예에 따른 명령어들은, 적어도 하나의 프로세서에 의해 실행되어, 제2 전자 장치가, UWB 센싱 세션을 수행하는 동안, 제1 전자 장치로부터, UWB 센싱 데이터(sensing data)를 수신하고, 및 제1 전자 장 치에게, UWB 센싱 데이터에 기초하여 획득한 CIR(channel impulse response) 신호를 송신하고, 및 UWB 레인징 세션을 수행하는 동안, 제1 전자 장치와 UWB DS-TWR(double-sided two-way ranging)을 수행하도록 할 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 본 개시에서, 전자 장치가 수행하는 기능 또는 동작은 하나 이상의 프로세서가 메모리에 저장된 하나 이상의 명 령어를 실행하여 수행될 수 있다. 본 개시에서 언급된 전자 장치의 기능 또는 동작은 하나의 프로세서가 하나 이상의 명령어를 실행함으로써 수행될 수도 있고, 복수 개의 프로세서들의 조합이 하나 이상의 명령어를 실행함 으로써 수행될 수도 있다. 본 개시에서 언급되는 프로세서는 연산을 수행하거나 전자 장치의 다른 구성요소를 제어하기 위한 회로를 포함하는 것으로 이해될 있다. 예를 들어, 상기 하나 이상의 프로세서는 하나 이상의 명 령어를 실행하도록 구성된 CPU(central processing unit), MPU(micro-processor unit), AP(application processor), CP(communication processor), NPU(neural processing unit), system on chip(SoC) 또는 집적 회 로(integrated circuit, IC)를 포함할 수 있다. 상기 하나 이상의 프로세서는 상술한 전자 장치의 동작을 수행 하도록 구성될 수 있다. 본 개시에서, 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시 (flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: read only memory), 전기적 삭제가능 프 로그램가능 롬(EEPROM: electrically erasable programmable read only memory), 자기 디스크 저장 장치 (magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: compact disc-ROM), 디지털 다목적 디스크(DVDs: digital versatile discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 메모리는 하나의 저장 매 체로 구성되거나, 복수개의 저장 매체의 조합으로 구성될 수도 있다. 상기 하나 이상의 명령어는 하나의 저장 매체에 저장되거나, 복수개의 저장 매체에 분산하여 저장될 수 있다. 또한, 상기 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(local area network), WLAN(wide LAN), 또 는 SAN(storage area network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접 근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장 치는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도 의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 또한, 본 개시에서, \"부\", \"모듈\" 등의 용어는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로세서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다. \"부\", \"모듈\"은 어드레싱될 수 있는 저장 매체에 저장되며 프로세서에 의해 실행될 수 있는 프로그램에 의해 구 현될 수도 있다. 예를 들어, \"부\", \"모듈\" 은 소프트웨어 구성 요소들, 객체 지향 소프트웨어 구성 요소들, 클 래스 구성 요소들 및 태스크 구성 요소들과 같은 구성 요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서 브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데 이터 구조들, 테이블들, 어레이들 및 변수들에 의해 구현될 수 있다. 본 개시에서 설명된 특정 실행들은 일 실시예일 뿐이며, 어떠한 방법으로도 본 개시의 범위를 한정하는 것은 아 니다. 명세서의 간결함을 위하여, 종래 전자적인 구성들, 제어 시스템들, 소프트웨어, 및 상기 시스템들의 다른 기능적인 측면들의 기재는 생략될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21"}
{"patent_id": "10-2024-0143192", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 본 개시의 일 실시예에 따른 무선 통신에 기반하여 인증 절차를 수행하는 시스템을 설명하기 위한 개요 도를 도시한다. 도 3은 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치가 레인징 및 센싱을 수행하는 개요도를 도시한다. 도 4는 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치의 블록도를 도시한다. 도 5는 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치가 UWB 통신에 기반하 여 인증 절차를 수행하는 동작의 개요도를 도시한다. 도 6은 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치가 UWB 통신에 기반하 여 인증 절차를 수행하는 동작의 흐름도를 도시한다. 도 7은 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치 및 제2 전자 장치가 UWB 통신에 기반하 여 인증 해제 절차를 수행하는 동작의 흐름도를 도시한다. 도 8은 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치가 UWB 세션을 통한 거리 측정에 기초하 여 제2 전자 장치의 인증 절차를 수행하는 동작의 흐름도를 도시한다. 도 9는 본 개시의 일 실시예에 따른 UWB 컨트롤리 정보(UWB controlee information) 메시지의 구조를 도시한다. 도 10은 본 개시의 일 실시예에 따른 UWB 센싱 정보(UWB sensing information)의 구조를 도시한다. 도 11은 본 개시의 일 실시예에 따른 UWB 센싱 정보(UWB sensing information)의 구조를 도시한다. 도 12는 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치가 UWB 통신에 기반하여 제2 전자 장치 의 사용자와의 제1 거리를 획득하는 동작의 흐름도를 도시한다. 도 13은 본 개시의 일 실시예에 따른 UWB 센싱 데이터(sensing data)의 구조를 도시한다. 도 14는 본 개시의 일 실시예에 따른 CIR(channel impulse response) 신호의 예시를 도시한다. 도 15는 본 개시의 일 실시예에 따른 UWB 센싱 세션 라운드의 구조를 도시한다. 도 16은 본 개시의 일 실시예에 따른 복수개의 시간 슬롯(slot)들을 포함하는 UWB 센싱 세션 라운드의 구조를 도시한다. 도 17은 본 개시의 일 실시예에 따른 UWB 센싱 세션 시작 명령(UWB sesnsing session start command) 메시지의 구조 및 UWB 센싱 세션 시작 응답(UWB sensing session start response) 메시지의 구조를 도시한다. 도 18은 본 개시의 일 실시예에 따른 센싱 세션 정보 통지(sensing session information notification) 메시지 의 구조를 도시한다. 도 19는 본 개시의 일 실시예에 따른 UWB 통신을 수행하는 제1 전자 장치가 UWB 통신에 기반하여 사용자의 인증 해제 절차를 수행하는 동작의 흐름도를 도시한다. 도 20은 본 개시의 일 실시예에 따른 제1 전자 장치의 구성을 나타내는 블록도를 도시한다. 도 21은 본 개시의 일 실시예에 따른 제2 전자 장치의 구성을 나타내는 블록도를 도시한다."}
