{"patent_id": "10-2020-0073062", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0074929", "출원번호": "10-2020-0073062", "발명의 명칭": "지문 인식 기능을 지원하는 전자 장치 및 이의 운용 방법", "출원인": "삼성전자주식회사", "발명자": "이광섭"}}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,화면 출력을 위해 사용되는 복수의 유기발광다이오드(OLED) 픽셀을 포함하는 OLED 디스플레이;상기 복수의 OLED 픽셀들 중 적어도 하나의 픽셀 하부에 배치되는 지문 센서 - 상기 지문 센서는 상기 복수의OLED 픽셀들의 일부에 의해 조사되고 상기 OLED 디스플레이에 근접한 외부 객체에 의해 반사된 광 중 적어도 일부를 기반으로 상기 외부 객체의 지문에 대응하는 이미지 정보를 획득하도록 설정됨 -,상기 OLED 디스플레이 하부에 형성된 후면 패널 - 상기 지문 센서에 대응하는 개구부를 포함함, 상기 OLED 디스플레이를 지지하는 상기 후면 패널의 하부에 배치되는 브라켓;을 포함하고,상기 브라켓은 상기 지문 센서 배치를 위한 센서 안착 영역을 포함하고,상기 센서 안착 영역은 상기 브라켓의 전면 및 후면을 관통하는 홀을 포함하고,상기 지문 센서는 상기 안착 영역에 부착되어 상기 OLED 디스플레이 하부 및 상기 OLED 디스플레이와 상기 지문센서 사이에 갭이 형성되는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 OLED 디스플레이 하부 및 상기 OLED 디스플레이와 상기 지문 센서 사이에 형성된 갭은상기 브라켓의 홀의 일부를 포함하는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 이미지 정보의 적어도 일부를 기반으로 상기 지문의 인증을 수행하도록 설정된 프로세서;를 더 포함하는전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 후면 패널은 상기 OLED 디스플레이에 인접되게 형성된 보호층 및 상기 보호층에 형성된 개구부의 적어도일부를 포함하는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 지문 센서는 디스플레이 FPCB에 연결되지 않고 메인 PCB에 직접적으로 연결되는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 지문 센서의 적어도 일부는공개특허 10-2020-0074929-3-상기 센서 안착 영역에 안착되는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 반사된 광 중 특정 파장의 광을 통과시키며 상기 개구부에 정렬되는 파장 선택부;를 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 반사된 광 중 특정 파장 대역의 광을 통과시키고 상기 지문 센서와 상기 OLED 디스플레이 사이에 배치되는파장 선택부;를 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 OLED 디스플레이의 전체 영역에 지문 인식 영역이 형성되고, 상기 지문 센서는 상기 지문 인식 영역에 대응하도록 형성되는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 지문 센서는 시트 형상으로 마련되는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제3항에 있어서,상기 OLED 디스플레이의 적어도 일부 영역에 지문 인식 영역이 형성되고,상기 프로세서는지문 인증을 위한 요청에 대응하여 특정 파장 대역의 색으로 상기 지문 인식 영역을 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제3항에 있어서,상기 OLED 디스플레이의 적어도 일부 영역에 지문 인식 영역이 형성되고,상기 프로세서는지문 인증을 위한 요청에 대응하여 특정 휘도로 상기 지문 인식 영역을 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 프로세서는상기 이미지 정보 획득을 위한 운용과 관련한 제1 표시 속성을 기반으로 상기 지문 인식 영역을 제어하고,상기 획득된 이미지 정보가 특정 조건을 만족하면, 제2 표시 소석을 기반으로 상기 지문 인식 영역을 제어하는전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,공개특허 10-2020-0074929-4-상기 프로세서는 상기 제2 표시 속성의 적어도 일부로서 특정 휘도 또는 특정 색을 조절하는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제3항에 있어서,상기 OLED 디스플레이의 적어도 일부 영역에 지문 인식 영역이 형성되고,상기 프로세서는 지문의 인증을 위한 요청에 대응하여 상기 OLED 디스플레이를 통해 상기 지문 인식 영역에 상기 외부 객체의 접근을 가이드하기 위한 사용자 인터페이스를 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제3항에 있어서,상기 OLED 디스플레이의 적어도 일부 영역에 지문 인식 영역이 형성되고,상기 프로세서는 상기 지문 인식 영역에 제1 터치 민감도를 사용하도록 제어하고,상기 ILED 디스플레이의 상기 지문 인식 영역의 주변 영역에 제2 터치 민감도를 사용하도록 제어하는 전자장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 프로세서는상기 제1 터치 민감도의 적어도 일부를 기반으로 상기 지문 인식 영역에서 상기 외부 객체의 접근에 대응하는호버링을 검출하면, 상기 지문 인식 영역을 특정 휘도, 특정 색 또는 특정 파장대 중 적어도 하나로 출력하도록설정된 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서,상기 개구부의 적어도 일부에 형성되는 광학 접착층을 포함하는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항에 있어서,상기 브라켓의 상기 홀의 일부에 의해 연장되는 상기 후면 패널에서 상기 개구부에 의해 상기 에어 갭이 형성되는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제1항에 있어서,상기 지문 센서는 상기 후면 패널 하부에 배치되며, 상기 후면 패널로부터 수직 방향으로 이격되는 전자 장치."}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 적어도 하나의 픽셀을 포함하고 적어도 일부 영역이 투명한 디스플레이, 화면이 표시되는 상기 디스플 레이의 하부 일정 영역에 배치되고, 상기 디스플레이 배치된 픽셀에서 조사되고 상기 디스플레이 상에 접근된 물 체에 의해 방향이 변경된 광을 수집하여 지문 인증과 관련한 이미지 정보를 획득하는 지문 센서, 상기 지문 센서 의 이미지 정보 획득 동작을 제어하는 프로세서를 포함하는 전자 장치 및 이의 운용 방법을 개시한다. 이 외에도 명세서를 통해 파악되는 다양한 실시 예가 가능하다."}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시 예는 지문 인식 기능에 관한 것이다."}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래 휴대용 전자 장치는 지문 인식 기능을 지원하고 있다. 종래 지문 인식 기능을 가지는 전자 장치는 전자 장 치의 외관 중 디스플레이 영역 하단 주변부 또는 전자 장치의 케이스 후면 등에 지문 센서를 배치하고, 이를 기 반으로 지문 인증 기능을 지원하고 있다."}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 종래 지문 인식 환경에서, 사용자는 지문 인증을 위해 손가락을 케이스 하단 또는 후면 등의 일정 영역 에 위치시킬 필요가 있었다. 이 과정에서, 사용자는 케이스 하단부에 지문 센서가 배치되는 구조의 전자 장치 운용 시, 파지 상태를 유지하면서 손가락을 지정된 지점에 위치시키는 것이 어려운 문제점이 있었다. 또는, 사 용자는 케이스 후면에 지문 센서가 배치되는 구조의 전자 장치 운용 시, 지문 센서에 감각적으로 손가락을 위치 시켜야 하기 때문에 지문 인증 과정에서 오류가 자주 발생하는 문제가 있었다. 다양한 실시 예들은 손가락을 위치시키기 용이한 지문 인증 구조를 채용하며, 직관적인 UI(User interface)를 기반으로 지문 인증을 수행할 수 있도록 하는 지문 인식 기능을 지원하는 전자 장치 및 이의 운용 방법을 제공 한다."}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따른 전자 장치는 적어도 하나의 픽셀을 포함하고 적어도 일부 영역이 투명한 디스 플레이, 화면이 표시되는 상기 디스플레이의 하부 일정 영역에 배치되고, 상기 디스플레이 배치된 픽셀에서 조 사되고 상기 디스플레이 상에 접근된 물체에 의해 방향이 변경된 광을 수집하여 지문 인증과 관련한 이미지 정 보를 획득하는 지문 센서, 상기 지문 센서의 이미지 정보 획득 동작을 제어하는 프로세서를 포함할 수 있다. 다양한 실시 예에 따른 전자 장치 운용 방법은 지문 인증 요청을 수신하는 동작, 지문 센서가 배치된 위치에 상 응하는 디스플레이의 화면 표시 영역을 포함하는 적어도 일부 영역을 지정된 휘도 또는 지정된 색으로 출력하는 동작을 포함할 수 있다."}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이 다양한 실시 예들은 전자 장치 파지 상태에서도 지문 인증을 위한 손가락 배치를 용이하게 할 수 있는 구조를 제공할 수 있다. 또한, 다양한 실시 예들은 직관적이고 단순한 동작만으로도 지문 인증을 할 수 있도록 지원한다. 또한, 다양한 실시 예들은 디스플레이 배면에 배치된 지문 센서의 지문 인식률을 개선할 수 있도록 지원한다."}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대 해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을한정하지 않는다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도 록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성(또는 설정)된\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것만 을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성 (또는 설정)된 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장 치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서 (generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC (desktop PC), 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라, 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면 웨 어러블 장치는 엑세서리 형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치 (head-mounted-device(HMD)), 직물 또는 의류 일체 형(예: 전자 의복), 신체 부착 형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식 형(예: implantable circuit) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD 플레이어(Digital Video Disk player), 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널(security control panel), TV 박스(예: 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(예: Xbox™, PlayStation™), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(Global Navigation Satellite System)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자 기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things) (예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치 (예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 실시 예에 따른 지문 인증 기능을 지원하는 전자 장치 외관의 한 예를 나타낸 도면이다. 도 1을 참조하면, 본 발명의 전자 장치는 예컨대, 전체적으로 사각형의 형상으로 마련되고, 모서리의 적어 도 일부가 라운딩될 수 있다. 또한, 전자 장치의 측부 중 적어도 한 측부(예: 디스플레이의 세로 표 시 상태를 기준으로 좌측부 또는 우측부)는 가장자리로 갈수록 점진적으로 휘어진 에지 타입으로 마련될 수 있 다. 전자 장치는 화면 하단부 끝단 또는 상단부 끝단 중 적어도 한 부분까지 디스플레이가 확장된 형 태(예: 전면 Full 스크린, edge-to-edge 디스플레이 등)로 마련될 수 있다. 본 발명의 전자 장치에 따르면, 디스플레이의 화면이 표시되는 액티브 영역 중 적어도 일부 영역에 대하여 두께 방향 (z축 방향)으로 실질적으로(substantially) 수직인 공간(예: 디스플레이 pixel층 또는 그 아 래)에 디스플레이의 적어도 일부 영역에 접촉되는 사용자 지문을 센싱하는 지문 센서가 배치될 수 있 다. 한 실시 예에 따르면, 지문 센서는 지정된 크기(예: 사용자의 손가락 지문을 인식할 수 있는 기술적 및 통계적 크기에 대응하는 크기)를 가지며, 디스플레이의 후면의 일측 또는 전체 영역에, 예를 들면, 기 판 또는 시트의 형태로 배치될 수 있다. 한 실시예에 따르면, 상기 지문 센서는 디스플레이에 배치된 적어도 하나의 픽셀에서 조사된 광 중 적어도 일부 광(예: 디스플레이 표면에 접촉되는 손가락에 의해 반 사된 광 등)을 수광하여, 지문 인식에 필요한 이미지 정보를 구성하고, 그 구성된 이미지 정보를 전자 장치 의 프로세서(예: AP, DDI, 저전력 프로세서 등)가 접근할 수 있도록 지문 센서의 내부 메모리(미도시) 또는 상기 전자 장치의 메모리(예: 도13의 130)에 저장할 수 있다. 상기 디스플레이는 적어도 일부가 투명하게 형성될 수 있다. 예컨대, 디스플레이는 특정 파장대의 빛 (550nm 주변 파장대)에 대해 지정된 투명도(대략 2~5%)를 가지는 형태로 마련될 수 있다. 또는, 디스플레이 는 지문 센서가 배치된 영역의 적어도 일부를 포함하는 영역이 투명하게 형성될 수 있다. 이와 관련 하여, 상기 지문 센서는 발광부와 수광부를 포함하고, 프로세서의 제어에 대응하여 발광부를 이용하여 광 을 조사하고, 조사된 광을 수광하여, 지문 인식에 필요한 이미지 정보를 수집할 수도 있다. 상술한 바와 같이, 상기 지문 인식 기능을 가지는 전자 장치는 디스플레이에 포함된 픽셀에서 조사된 광을 이용하여 지문 인식에 필요한 이미지 정보를 수집할 수 있다. 이와 관련하여, 상기 지문 센서는 디스 플레이의 픽셀들이 배치된 위치보다 아래에 위치하고, 픽셀들이 배치된 투명 기판들을 통해 되돌아오는 광 을 수집하여 처리할 수 있다. 도 2는 본 발명의 실시 예에 따른 전자 장치의 분해 사시도의 한 예를 나타낸 도면이다. 도 2를 참조하면, 본 발명의 실시 예에 따른 전자 장치는 디스플레이, 후면 패널, 지문 센서 , 인쇄회로기판, 배터리 및 후면 커버를 포함할 수 있다. 추가로, 상기 전자 장치는 상기 디스플레이의 측면을 감싸도록 마련된 케이스를 더 포함할 수 있다. 또한, 상기 전자 장치는 상 기 후면 패널과 상기 인쇄회로기판 사이에서 상기 디스플레이, 후면 패널, 인쇄회로기판 , 배터리 등을 고정시키는 브라켓을 더 포함할 수 있다. 이러한 브라켓은 상기 케이스의 일부 구성(예: 케이스와 일체화)으로 마련되거나 또는 상기 케이스를 포함할 수 있다. 상기 디스플레이는 매트릭스 형태로 배치된 복수개의 픽셀, 상기 픽셀에 지정된 전원을 공급할 수 있도록 배치된 배선들, 상기 배선들에 신호를 공급하는 DDI(Display Driver Integrated-Chip), 상기 픽셀과 배선들 및 DDI가 놓이는 기판 등을 포함할 수 있다. 이러한 디스플레이는 적어도 일부 영역이 투명하게 형성(또는 지 정된 투명도를 가지며 형성)될 수 있다. 예컨대, 상기 디스플레이의 배선들 사이는 광이 투과가 가능하도 록 지정된 투명도(예: 550nm 주변 파장대(around 550nm)에서 2~5%)를 가질 수 있다. 상기 디스플레이는 전 자 장치의 전면 적어도 일부를 차지하도록 마련될 수 있다. 상기 디스플레이에 배치된 픽셀은 프로세 서 또는 DDI의 제어에 따라 지정된 광을 조사할 수 있다. 픽셀에서 조사된 광은 디스플레이 전면에 배치되 는 물체(예: 손가락)에 의해 반사되고 디스플레이를 투과해 지문 센서의 수광부에 전달될 수 있다.상기 지문 센서는 디스플레이 하부에 위치한 후면 패널 하부에 배치되데, 후면 패널에 형 성된 센서 배치 영역(예: 홀)을 통해 디스플레이의 일정 영역과 대면되도록 배치될 수 있다. 이를 기 반으로, 지문 센서는 디스플레이의 일정 영역을 통해 터치되는 손가락에 대한 지문 센싱을 수행할 수 있다. 한 실시 예에 따르면, 지문 센서는 센서 배치 영역을 통해 적어도 일부 영역이 투명하게 형성 된 디스플레이의 후면에 배치되어, 디스플레이를 관통하여 유입된 광을 수집할 수 있다. 예를 들어, 지문 센서는 디스플레이에 포함된 적어도 하나의 픽셀(또는 지문 인증 영역에 배치된 적어도 하나의 픽셀)에서 조사되고 지문 인증 영역에 위치한 물체에 의해 반사된 광을 센서 배치 영역을 통해 수광할 수 있다. 상기 지문 인증 영역은 디스플레이 영역 중 지문 센서가 배치된 영역을 포함할 수 있다. 또는 상기 지문 인증 영역은 상기 지문 센서와 대면되는 디스플레이 영역을 최소 크기 영역으로 하며, 상 기 지문 센서와 대면된 영역을 중심으로 사용자의 손가락 등이 터치되는 일정 크기의 영역(예: 상기 지문 센서의 크기에 대응하는 영역보다 일정 크기 이상 크게 설정된 영역)을 포함할 수 있다. 다양한 실시 예에 따르면, 지문 센서는 지문 인증을 위한 광원으로 사용될 광을 조사할 수 있는 발광부와, 조사된 광이 사용자의 신체(예: 손가락)에 의해 반사된 반사광을 수집할 수 있는 수광부를 포함할 수 있다. 광 이 수집되면, 지문 센서는 수집된 광에 대응하는 이미지 정보를 생성하고, 생성된 이미지 정보를 인쇄회로 기판에 배치된 프로세서에 의해 사용 가능하도록 저장할 수 있다. 다양한 실시 예에 따르면, 지문 센서 는 이미지 정보 획득에 대한 이벤트(예: 이미지 정보 획득 여부를 나타내는 정보)를 디스플레이에 포 함된 DDI에 전달할 수 있다. 이와 관련하여, 상기 전자 장치는 지문 센서와 DDI 사이에 상기 이벤트 를 전달할 수 있는 신호 라인을 더 포함할 수 있다. 상기 후면 패널은 디스플레이 후면에 배치되어, 디스플레이를 충격에서 보호하거나, 상기 하우 징(예: 브라켓) 상의 디스플레이를 지지하거나, 또는 디스플레이에서 발생되는 열을 발산시킬 수 있 다. 예컨대, 상기 후면 패널은 엠보 패턴이 형성된 보호층(interchangeably, 지지층)(예: 엠보층 또는 쿠 션층) 또는 적어도 일부가 금속 재질로 형성된 방열층을 포함할 수 있다. 상기 보호층은, 예컨대, 충격을 흡수 하기 위한 쿠션 또는 스펀지, 또는 광을 차단하기 위한 광차단 부재 (예: black sheet 또는 black 인쇄층)로 구 성될 수 있으며, 이런 구성물들이 통합되어 일체형으로 구성되거나, 또는 각 구성물 별로 형성된 복수개의 층들 이 적층되어 형성될 수 있다. 다양한 실시 예에 따르면, 상기 후면 패널은 전자기 유도 패널(또는 디지타 이저)을 포함할 수 있다. 상기 전자기 유도 패널은 스타일러스 팬 등 전자기 유도체의 접근을 감지할 수 있다. 상기 전자기 유도 패널은 상기 보호층과 상기 방열층 사이에 배치될 수 있다. 본 발명의 실시 예에 따른 후면 패널은 상기 지문 센서가 삽입되거나 또는 상기 지문 센서의 적어도 일부와 상하 정렬 배치되는 홀 형태의 센서 배치 영역을 포함할 수 있다. 상기 센서 배치 영역은 상기 지문 센서의 크기에 대응하는 일정 크기를 가지면서 후면 패널의 전후면을 관통하도록 마련되는 홀을 포함할 수 있다. 예컨대, 상기 후면 패널의 전후면을 관통하는 홀은 상기 보호층, 전자기 유도 패널 및 방열층의 전후면으로(또는 상하로) 관통하도록 배치될 수 있다. 상기 브라켓은 상기 후면 패널과 상기 인쇄회로기판 사이에 배치될 수 있다. 상기 브라켓 은 상기 지문 센서가 안착 고정되는 제1 센서 안착 영역(241a)을 포함할 수 있다. 상기 제1 센서 안착 영 역(241a)은 예컨대, 상기 지문 센서의 크기에 대응하는 일정 크기를 가지면서, 상기 브라켓의 전후면 을 관통하도록 마련되는 홀 형상 또는 일정 깊이로 음각된 홈 형상으로 마련될 수 있다. 다양한 실시예에 따르 면, 상기 브라켓은 안착되는 지문 센서와 인쇄회로기판에 배치된 프로세서 간의 전기적 연결을 위한 배선이 배치되는 배선홀 또는 배선 홈을 더 포함할 수 있다. 상기 인쇄회로기판은 상기 브라켓 하부에 배치될 수 있다. 상기 인쇄회로기판은 적어도 하나의 전자 장치 하드웨어 구성(component)(예: 카메라 모듈, 마이크, 스피커, 또는 USB 인터페이스 등)이 배치 될 수 있다. 한 실시 예에 따르면, 상기 인쇄회로기판은 지문 인증과 관련한 처리를 수행하는 프로세서가 배치될 수 있다. 또한, 상기 인쇄회로기판은 배터리와 전기적으로 연결되는 접점을 포함하고, 상기 배터리가 제공하는 전원을 상기 지문 센서 및 디스플레이에 전달할 수 있는 배선을 포함할 수 있다. 상기 인쇄회로기판에 배치되는 프로세서는 상기 디스플레이에 연결될 수 있다. 상기 프로세서 는 지문 인증 요청에 대응하여 지문 인증 가이드 UI를 디스플레이에 출력할 수 있다. 상기 프로세서는 상 기 디스플레이의 화면 제어 또는 지문 인증 영역의 휘도 또는 색상 중 적어도 하나를 제어하여, 지문 인증 과정 동안 지문 인증 영역이 지정된 휘도 또는 지정된 색상을 가지도록 제어할 수 있다. 상기 배터리는 상기 후면 패널 하부 및 상기 인쇄회로기판과 나란한 층에 배치될 수 있다. 상기 배터리는 전기적으로 연결된 인쇄회로기판에 전원을 공급하고, 인쇄회로기판의 프로세서 제어에대응하여 지정된 구성들(예: 디스플레이, 지문 센서 등)에 전원을 공급할 수 있다. 상기 후면 커버는 상기 인쇄회로기판 및 배터리 하부에 배치되면서, 상기 인쇄회로기판 및 배터리의 적어도 일부를 감싸도록 배치될 수 있다. 상기 후면 커버는 다양한 재질(예: 플라스틱 또는 금속 재질, 또는 유리 재질)로 마련될 수 있다. 상기 후면 커버는 상술한 케이스 또는 브라켓에 고정될 수 있다. 도 3a는 본 발명의 실시 예에 따른 지문 센서를 가지는 전자 장치의 한 예를 나타낸 도면이다. 도 3a를 참조하면, 본 발명의 전자 장치(300a)는 디스플레이, 후면 패널, 지문 센서, 브라켓 , 배터리, 인쇄회로기판, 무선 충전 회로 및 후면 커버을 포함할 수 있다. 상기 무선 충전 회로는 예컨대, 상기 배터리를 무선으로 충전할 수 있는 회로(예: WPC(wireless power transfer)회로)를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 무선 충전 회로는 NFC(near field communication) 안테나, MST(magnetic secure transmission) 안테나 등을 더 포함할 수도 있다. 상기 디스플레이는 외부 보호층(예: 커버 글래스), 디자인층, 접착층(예: Pressure sensitive adhesive), 편광층, 표시 패널(예: AMOLED)을 포함할 수 있다. 여기서, 상기 디자인층 은 설계 방식의 변경 등에 의해 생략될 수 있다. 상기 외부 보호층은 유리 재질 또는 폴리머 재질 등 투명한 재질로 마련될 수 있다. 상기 외부 보호층은 0.1~1.0t(예컨대, 0.5t(mm))로 형성될 수 있다. 상기 디자인층은 무늬, 로고 등이 인쇄되는 층일 수 있다. 상기 디자인층은 로고 등이 배치된 영역을 제외 한 나머지 영역이 투명하게 형성될 수 있다. 상기 접착층은 상기 외부 보호층과 상기 편광층 사 이에 배치되어, 상기 외부 보호층을 상기 편광층에 고정시키는 역할을 수행할 수 있다. 상기 접착층 은 0.05~0.3t(예컨대, 0.15t(mm))로 형성될 수 있다. 상기 편광층은 외부 보호층에서 유입되는 광(예: 자연광) 또는 표시 패널에서 외부로 조사되는 광(예: 픽셀광)들은 여러 방향으로 진동하게 되는데, 상기 광들 중 특정 방향으로만 진동하는 광을 투과시킬 수 있다. 상기 편광층은 0.05~0.3t(예컨대, 0.147t(mm))로 형성될 수 있다. 상기 표시 패널은 터치 센서 및 표시부를 포함할 수 있다. 상기 표시 패널은 0.1~0.3t(예컨대, 0.14t(mm))로 형성될 수 있다. 상기 터치 센서는 매트릭스 형태로 배치될 수 있다. 상기 터치 센서는 터치 구동 모듈과 전기적으로 연결될 수 있다. 상기 터치 구동 모듈은 예컨대, 연성인쇄회로기판(160a)에 놓이고 상기 터 치 센서가 전기적으로 연결되거나 또는 연성인쇄회로기판을 통해 상기 터치 센서 및 인쇄회로기판과 전기적으로 연결될 수 있다. 상기 표시부는 적어도 하나의 픽셀을 포함할 수 있다. 상기 표시부는 예컨대, 자가 발광을 할 수 있는 OLED 기반 픽셀들을 포함할 수 있다. 상기 표시부는 배터리에서 공급된 전원을 기반으로 프로세서 의 제어 또는 DDI의 제어에 대응하여 지정된 이미지와 관련한 광을 출력할 수 있다. 상기 표시 패널은 상 기 표시부 제어와 관련한 DDI(또는 디스플레이 구동 모듈)를 더 포함할 수 있다. 예컨대, DDI는 상기 표시 패널 의 비표시 영역 상에 COP(chip on glass) 타입으로 실장될 수 있다. 표시 패널에 배치된 DDI는 연성 인쇄회로기판을 통하여 인쇄회로기판에 연결될 수 있다. 이와 관련하여, 브라켓의 적어도 일부에 상 하를 관통하는 홀이 마련되고, 상기 연성회로기판(160a)는 상기 홀을 통하여 상기 인쇄회로기판에 전기적 으로 연결될 수 있다. 이와 관련하여, 상기 표시 패널은 플렉서블 타입으로 마련되고, 표시 패널의 일부(예: 우측 가장자리)는 도시된 바와 같이 휘어져 배치될 수 있다. 다양한 실시 예에 따르면, 상기 표시 패 널로부터 연장되어 휘어져 배치되는 부분은 상기 연성 인쇄회로기판(160a)과 전기적으로 연결될 수 있다. 상기 연성 인쇄회로기판(160a)의 적어도 일 측면에는 디스플레이 구동 모듈(예: DDI 또는 TDI(touch driver IC))이 COF 타입(Chip on film)으로 배치 될 수 있다. 다양한 실시 예에 따르면, 상기 연성 인쇄회로기판(160a) 상에 COF 타입으로 실장되는 DDI 및 TDI는 일체형으로 구현될 수 있다. 또는, 상기 연성 인쇄회로기판(160a) 상 에는 지문 센서가 배치될 수 있으며, 상기 지문 센서는 상기 DDI, 및 TDI는 일체형으로 구현될 수 있다. 또는, 상기 연성 인쇄회로기판(160a) 상에는 압력 센서가 실장될 수 있으며, 상기 압력 센서는 상기 지문 센서, 상기 DDI 및 TDI 중 적어도 하나와 일체형으로 구현될 수 있다. 상기 지문 센서는 상기 후면 패널 중 보호층 또는 방열층 중 적어도 하나의 층의 적어도 일부 영역이 제거되어 홀을 형성하는 센서 배치 영역에 안착될 수 있다. 또는 상기 지문 센서는 상기 후면 패널 중 센서 배치 영역 하부에 정렬 배치될 수 있다. 상기 지문 센서는 광원(예: 상기 표 시 패널의 픽셀)에서 조사되고, 사용자의 신체(예: 손가락)에 의하여 반사되어, 디스플레이의 투명한 영역을 통해 상기 디스플레이의 후면 방향으로 유입된 광을 수집할 수 있다. 상기 지문 센서는 예컨 대, 상기 연성 인쇄회로기판(160a) 상에 배치될 수 있다. 다양한 실시 예에 따르면, 전자 장치(300a)는 지문 센서가 생성한 이미지 정보를 프로세서에 전달할 수 있는 배선을 더 포함할 수 있다. 상기 지문 센서와 연결되는 배선은 예컨대, 상기 연성 인쇄회로기판(160a) 일측에 배치되어, 인쇄회로기판의 프로세서에 전 기적으로 연결될 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치(300a)는 표시 패널 구동과 관련한 DDI가 지문 센서를 구동하는 IC를 포함할 수 있으며, 이 경우, 상기 전자 장치(300a)는 DDI와 상기 지문 센서를 연결하는 배선을 더 포함할 수 있다. 상기 지문 센서는 손가락 접근 인식에 따른 이벤트를 상 기 배선을 통하여 상기 DDI에 전달할 수 있다. 상기 손가락 접근의 판단과 관련하여, 지문 센서가 상기 손 가락 또는 그 지문의 이미지 정보를 획득하여 관련된 메모리(예: 지문센서 내부 레지스터 또는 버퍼)에 저장하 면, 프로세서는 상기 메모리에 저장된 이미지 정보를 기반으로 물체 접근을 판단할 수 있다. 한 실시 예에 따르 면, 프로세서는 지문 인증 영역의 조도가 지정된 조도 이하로 감소하는 경우 물체 접근(또는 손가락 접근)으로 판단할 수 있다. 이와 관련하여, 전자 장치(300a)는 후술하는 도 23에서 설명하는 조도 센서를 더 포함할 수도 있다. 전자 장치(300a)가 별도의 조도 센서를 포함하는 경우, 프로세서는 상기 조도 센서를 기반으로 전자 장치 의 지정된 방향에 대한 조도 정보를 획득하고, 조도 정보에 따라, 지문 접근을 사전에 확인할 수 있다. 예를 들 면, 프로세서는 조도 센서를 기반으로 외부 조도가 지정된 값 이하인 경우, 지문 센서를 활성화할 수도 있다. 상기 조도 센서는 상기 지문 센서가 배치된 위치에 인접된 영역에 배치되거나 또는 전자 장치를 파지하는 위치 등에 배치될 수 있다. 상기 후면 패널은 상기 지문 센서가 배치된 영역을 제외하고, 상기 디스플레이 후면 전체에 배 치될 수 있다. 상기 후면 패널은 앞서 설명한 바와 같이, 엠보 패턴 등이 형성된 보호층, 및 방열 기 능을 수행하는 방열층(예: 구리층)을 포함할 수 있다. 상기 보호층은 블랙 색상의 엠보 쿠션을 통해 표시 패널에 충격이 가해지는 것을 저감하거나 방지하고, 표시 패널의 시인성을 개선할 수 있다. 상기 보 호층은 0.1~0.3t(예컨대, 0.14t(mm))로 형성될 수 있다. 상기 방열층은 상기 디스플레이 구동 모듈 (160a)과 전기적으로 연결되어, 상기 디스플레이 구동 모듈(160a)의 접지 역할(예: 노이즈 차폐)을 수행할 수도 있다. 상기 방열층는 0.02~0.1t(예컨대, 0.04t(mm))로 형성될 수 있다. 다양한 실시 예에 따르면, 상기 보 호층의 일부는 패널 하부에 배치되고, 나머지 일부는 상기 방열층 상부에 놓일 수 있다. 예컨대, 상기 보호층이 엠보층과 쿠션층을 포함하는 경우, 상기 엠보층은 상기 패널 하부에 배치되고, 상기 쿠션층은 상기 방열층 하부에 놓일 수 있다. 상기 브라켓은 상기 후면 패널과 인쇄회로기판 또는 배터리를 전기적으로 절연하면서, 상 기 디스플레이를 지지할 수 있다. 이러한 상기 브라켓은 적어도 일부가 비금속재질로 마련되고 나머 지 일부 영역(예: 케이스 측면부)이 금속 재질로 마련될 수 있다. 예컨대, 브라켓은 전체가 비금속 재질로 마련되거나 또는 전체가 금속 재질로 마련될 수 있다. 상기 배터리는 상기 브라켓 일측에 안착 고정될 수 있다. 상기 인쇄회로기판은 상기 배터리 를 감싸는 형태로 상기 브라켓 상에 배치될 수 있다. 상기 인쇄회로기판은 USB 인터페이스(22 1)가 결합하는 제1 파트와, 상기 연성인쇄회로기판(160a)과 전기적으로 연결되며 프로세서가 배치되는 제2 파트 를 포함하고, 상기 인쇄회로기판의 제1 파트와 상기 인쇄회로기판의 제2 파트를 연결하는 제3 파트를 포함할 수 있다. 상술한 도 3a에서는 지문 센서가 USB 인터페이스가 배치되는 영역의 브라켓 상부에 배치되는 것으로 도시하였으나, 본 발명이 이에 한정되는 것은 아니다. 상기 지문 센서의 적어도 일부는 상기 배터리 가 배치되는 영역의 브라켓 상부에 배치될 수도 있다. 도 3b는 본 발명의 한 실시 예에 따른 COP 타입 전자 장치의 일부 구성의 한 예를 나타낸 도면이다. 도 3b를 참조하면, 한 실시 예에 따른 전자 장치(300b)는 디스플레이, 디지타이저(digitizer)를 포함 하는 후면 패널, 지문 센서, 압력 센서를 포함할 수 있다. 추가적으로 또는 대체적으로 상기 전 자 장치(300b)는 브라켓과, 배터리 등을 더 포함할 수 있다. 상기 디스플레이는 외부 보호층, 제1 접착층(162_1), 편광층, 제2 접착층(162_2), 표시 패널 을 포함할 수 있다. 또는 디스플레이는 디스플레이 구동 모듈(160a_1)을 포함하고, 상기 디스플레이 구동 모듈(160a_1)이 배치되는 표시 패널 연장부(165_1)를 더 포함할 수도 있다. 상기 표시 패널은 터치 패널을 포함할 수 있다. 상기 표시 패널 연장부와 상기 방열층(190_3) 사이에는 접착층(165_9)이 배치될 수 있다. 상기 외부 보호층은 앞서 도 3a에서 설명한 외부 보호층과 동일 또는 유사한 구성일 수 있다. 상기 제1 접착층(162_1)은 상기 외부 보호층과 상기 편광층을 접착시킬 수 있다. 상기 제2 접착층(162_2) 은 상기 편광층과 상기 표시 패널을 접착시킬 수 있다. 표시 패널 상에 구현되는 이미지 시인과 관련하여 제1 접착층(162_1) 및 제2 접착층(162_2)은 광투명성 접착층(optical clear adhesive)으로 형성될 수 있다. 상기 표시 패널은 연성 패널로 마련되어, 도시된 바와 같이 표시 패널 연장부(165_1)가 표시 패널을 기준으로 지정된 각도(예: 180도) 이상으로 휘어져 표시 패널의 후면 일부에 배치될 수 있다. 상기 디스플 레이 구동 모듈(160a_1)은 상기 표시 패널 연장부(165_1) 상에 배치(예: COP 타입)될 수 있다. 추가적으로 또는 대체적으로, 상기 표시 패널은 터치 패널을 포함할 수 있다. 상기 터치 패널 구동과 관련한 신호 회로는 상기 표시 패널 연장부(165_1) 상에 배치되고, 상기 터치 패널 구동 IC는 상기 디스플레이 구동 모듈(160a_1)에 일체화되어 배치될 수 있다. 상기 디스플레이 구동 모듈(160a_1)은 상기 표시 패널을 구동하는 DDI(display driver IC)와 상기 표시 패널에 포함된 터치 패널을 구동하는 터치 구동 모듈을 포함할 수 있다. 상기 디스플레이 구동 모듈(160a_1)은 상기 표시 패널 연장부(165_1) 상에 배치될 수 있다. 추가적으로 상기 표시 패널 연장부(165_1) 상에는 상기 표 시 패널에 데이터 신호 및 게이트 신호를 공급하기 위한 신호 라인들이 배치될 수 있다. 상기 표시 패널 연장부(165_1)는 표시 패널의 일측으로부터 일정 길이만큼 연장되고 휘어져 표시 패널 의 일측 후면에 배치될 수 있다. 표시 패널 연장부(165_1)의 적어도 일부는 비표시 영역을 포함하고, 상기 표시 패널에 신호를 공급할 수 있도록 적어도 하나의 신호 라인이 배치될 수 있다. 상기 표시 패널 연장부 (165_1) 일측에는 상기 디스플레이 구동 모듈(160a_1)이 배치될 수 있다. 상기 표시 패널 연장부(165_1)의 끝단 은 지문 센서가 안착된 센서용 회로 기판의 일측과 전기적으로 연결될 수 있다. 상기 표시 패널 연장 부(165_1)는 상기 표시 패널 형성 시 함께 형성될 수 있다. 상기 센서용 회로 기판은 예컨대 상기 지 문 센서에 포함될 수도 있다. 상기 후면 패널은 보호층, 방열층(190_3), 및 상기 보호층과 상기 방열층(190_3) 사이에 배치되 는 디지타이터를 포함할 수 있다. 상기 후면 패널 중 상기 센서 배치 영역이 형성된 영역에는 홀이 형성될 수 있다. 상기 후면 패널의 보호층 및 방열층(190_3)에 형성된 홀 크기는 상기 디지타이 저에 형성된 홀 크기와 동일 또는 유사하게 형성될 수 있다. 상기 디지타이저는 후면 패널 에 포함될 수 있다. 예컨대, 상기 디지타이저는 상기 후면 패널 의 보호층과 방열층 사이에 배치될 수 있다. 상기 디지타이저는 예컨대, 지정된 액세서리(예: 스타일 러스 팬) 접근 또는 접촉을 인식할 수 있다. 한 실시 예에 따르면, 상기 디지타이저는 액세서리 접근 또는 접촉을 전자기 유도 방식으로 인식할 수 있는 패널을 포함할 수 있다. 상기 디지타이저는 별도의 FPCB를 통하여 메인 인쇄회로기판과 전기적으로 연결될 수 있다. 다양한 실시 예에 따르면, 상기 디지타이저(30 1)는 상기 표시 패널 연장부(165_1)의 후면 일측과 전기적으로 연결되고, 상기 표시 패널 연장부(165_1)를 통하 여 상기 디스플레이 구동 모듈(160a_1)에 연결될 수 있다. 이와 관련하여, 상기 디스플레이 구동 모듈(160a_1) 은 상기 디지타이저 구동과 관련한 구동 모듈을 더 포함하고, 상기 표시 패널 연장부(165_1)의 후면에 배 치된 적어도 하나의 신호 라인을 통하여 상기 디지타이저와 신호를 송수신할 수 있다. 다양한 실시 예에 따르면, 상기 디지타이저의 일측은 센서 배치 영역 형성을 위하여 홀이 형성될 수 있다. 상기 홀의 크기는 예컨대, 상기 지문 센서의 크기에 대응하거나 또는 지문 센싱을 위한 센서 배치 영역의 크기 에 대응할 수 있다. 상기 지문 센서는 상기 후면 패널에 형성된 센서 배치 영역에 대응하는 홀 하부에 배치될 수 있 다. 상기 지문 센서는 한 실시 예에 따르면, 지정된 광을 출력하고, 반사되는 광을 수광하여 지문 이미지 를 획득할 수 있다. 상기 지문 센서는 센서용 회로 기판 상에 전기적으로 장착(예: 솔더링)될 수 있 다. 상기 지문 센서의 일측과 상기 후면 패널 사이에는 제3 접착층이 배치될 수 있다. 상기 제3 접착층은 상기 지문 센서의 가장자리 부에 띠 형상으로 배치될 수 있다. 상기 압력 센서는 상기 센서용 회로 기판 상에 배치되데 상기 지문 센서를 감싸도록 배치될 수 있다. 또는 상기 압력 센서는 상기 센서 배치 영역을 감싸도록 배치될 수 있다. 예컨대, 상기 압력 센서는 원형 또는 타원형 또는 다각형의 띠 형상으로 마련될 수 있다. 상기 압력 센서를 구동하는 구 동 IC는 상기 회로 기판 또는 상기 센서용 회로 기판 중 어느 하나에 배치되고, 압력을 센싱하기 위 한 센싱부는 상기 후면 패널과 상기 센서용 회로 기판 사이에 배치될 수 있다. 다양한 실시 예에 따 르면, 상기 센싱부의 상단과 상기 후면 패널 사이에는 접착층이 배치될 수도 있다.상기 센서용 회로 기판 상에는 지문 센서 및 압력 센서 중 적어도 하나가 안착될 수 있다. 상기 센서용 회로 기판은 상기 센서 배치 영역과 정렬되어 배치될 수 있다. 상기 센서용 회로 기판의 일측은 상기 표시 패널 연장부(165_1)의 일측과 전기적으로 또는 물리적으로 연결될 수 있다. 상기 센서용 회로 기판은 구동과 관련한 신호 또는 전원을 상기 표시 패널 연장부(165_1)에 배치된 디스플레이 구동 모듈 (160a_1)로부터 수신할 수도 있다. 상술한 바와 같이, 다양한 실시 예에 따른 전자 장치(300b)는 표시 패널 하부에 디지타이저가 배치되 데, 지문 센서의 센서 배치 영역을 고려하여 디지타이저의 일부 영역은 상하로 관통되는 홀 영 역을 포함할 수 있다. 도 3c는 본 발명의 한 실시 예에 따른 COF 타입 전자 장치의 한 예를 나타낸 도면이다. 도 3c를 참조하면, 한 실시 예에 따른 전자 장치(300c)는 디스플레이, 디지타이저와 보호층 및 방열층(190_3)를 포함하는 후면 패널, 지문 센서, 압력 센서를 포함할 수 있다. 추가적으로 또 는 대체적으로 상기 전자 장치(300c)는 브라켓과, 배터리 등을 더 포함할 수 있다. 상기 디스플레이는 외부 보호층, 제1 접착층(162_1), 편광층, 제2 접착층(162_2), 표시 패널 을 포함하고, 상기 표시 패널 일측과 연결되는 표시 패널 연결부(165_2)를 포함할 수 있다. 상기 표 시 패널은 터치 패널을 포함할 수 있다. 상기 표시 패널 연장부와 상기 방열층(190_3) 사이에는 접착 층(165_9)이 배치될 수 있다. 상술한 구성 중 외부 보호층, 제1 접착층(162_1), 편광층, 제2 접착층(162_2), 표시 패널 등은 도 3b에서 설명한 구성들과 실질적으로 동일 또는 유사할 수 있다. 상기 표시 패널 연결부(165_2)의 일측은 표시 패널의 일측과 전기적으로 연결되고, 상기 표시 패널 연결부 (165_2)의 타측은 상기 표시 패널의 후면에 휘어져 배치되어 센서용 회로 기판에 연결될 수 있다. 상 기 표시 패널 연결부(165_2)의 일측 상부에는 디스플레이 구동 모듈(160a_1)이 배치될 수 있다. 상기 표시 패널 연결부(165_2)는 필름 형태의 연성회로필름 또는 연성회로기판으로 마련될 수 있다. 다양한 실시 예에 따르면, 상기 표시 패널 연결부(165_2)의 상부면(또는 하부면)에는 표시 패널 구동과 관련한 신호 라인들이 배치되 고, 상기 표시 패널 연결부(165_2)의 하부면(또는 상부면)에는 상기 디지타이저 구동과 관련한 신호 라인 들이 배치될 수 있다. 또는, 표시 패널 연결부(165_2)의 상부 일측(또는 하부 일측)에 표시 패널 구동과 관련한 신호 라인들이 배치되고, 상부 타측(또는 하부 타측)에 디지타이저 구동과 관련한 신호 라인들이 배치될 수도 있다. 상기 표시 패널 연결부(165_2)는 상기 표시 패널과 독립적으로 마련된 후, 상기 표시 패널 일측에 전기적으로 연결될 수 있다. 다양한 실시 예에 따르면, 상기 표시 패널 연결부(165_2) 일측에 는 터치 패널 구동과 관련한 신호 라인이 배치되고, 상기 터치 패널 구동 회로는 상기 디스플레이 구동 모듈 (160a_1)에 포함될 수 있다. 상술한 설명에서는 디스플레이 구동 모듈(160a_1)이 터치 패널 구동 모듈을 포함하는 형태로 설명하였으나 본 발명이 이에 한정되는 것은 아니다. 예컨대, 상기 표시 패널 연장부(165_1) 또는 표시 패널 연결부(165_2) 상에 터치 패널 구동 모듈이 별도로 배치되고, 상기 터치 패널 구동 모듈은 상기 표시 패널 연결부(165_2) 상에 배치 된 신호 라인을 통하여 상기 터치 패널과 신호를 송수신할 수 있다. 도 4는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치의 다른 예를 나타낸 도면이다. 도 4를 참조하면, 본 발명의 전자 장치는 케이스, 디스플레이, 후면 패널, 지문 센서 , 브라켓, 인쇄회로기판 및 배터리, 후면 커버를 포함할 수 있다. 상기 디스플레이는 앞서 언급한 바와 같이, 외부 보호층, 접착층(예: OCA), 편광층, 표시 패널을 포함할 수 있다. 추가적으로 상기 디스플레이는 설계 방식에 따라 로고 등이 인쇄된 디자인층 을 더 포함할 수 있다. 상술한 디스플레이는 적어도 일부(예: 지문 센서가 배치된 지문 인증 영역)가 투명하게 형성될 수 있다. 디스플레이의 표시 패널에 포함된 적어도 하나의 픽셀(예: 지문 인증 영역 에 배치된 픽셀들 또는 지문 인증 영역을 포함한 일정 크기 영역에 배치된 픽셀들)에서 조사된 광은 투명한 디 스플레이 내부를 관통하여 지문 센서에 유입될 수 있다. 상기 후면 패널은 상기 디스플레이 하부에 배치되며, 센서 배치 영역을 포함할 수 있다. 상기 센서 배치 영역 하부에는 지문 센서가 배치될 수 있다. 센서 배치 영역을 통하여, 지문 센서 는 디스플레이를 관통한 광을 수집할 수 있다.상기 지문 센서는 상기 후면 패널 하부에 배치되데, 도시된 바와 같이 브라켓 일측에 마련된 제 1 센서 안착 영역(241a)에 배치될 수 있다. 상기 지문 센서의 상부 중 적어도 일부(예: 광을 수집할 수 있 는 수광부)는 후면 패널의 센서 배치 영역을 통하여 노출될 수 있다. 또는, 지문 센서가 발광부 와 수광부를 모두 포함하는 형태로 마련되는 경우, 발광부 및 수광부가 배치된 부분은 센서 배치 영역을 통하여 디스플레이 방향으로 노출될 수 있다. 디스플레이의 투명 영역을 통해 유입된 광은 센서 배치 영역을 통하여 지문 센서에 전달될 수 있다. 상기 브라켓은 상기 후면 패널 하부에 배치되며, 상기 후면 패널과 디스플레이 등을 지지 할 수 있다. 상기 브라켓의 적어도 일부는 비금속 재질로 마련되거나 또는 적어도 일부는 금속 재질로 마 련될 수 있다. 상기 브라켓은 제1 센서 안착 영역(241a)을 포함할 수 있다. 상기 제1 센서 안착 영역 (241a)은 브라켓의 표면 중 디스플레이 방향으로 배치된 표면의 일정 영역이 음각되어 마련될 수 있 다. 상기 제1 센서 안착 영역(241a)의 깊이는 지문 센서의 높이만큼 형성될 수 있다. 상기 제1 센서 안착 영역(241a)의 넓이는 상기 지문 센서의 크기만큼 형성될 수 있다. 다양한 실시 예에 따르면, 상기 제1 센 서 안착 영역(241a)은 안착되는 지문 센서의 배선들이 배치될 수 있는 배선 홈 또는 배선 홀 중 적어도 하 나를 포함할 수 있다. 상기 배선 홈 또는 배선 홀은 지문 센서와 연결된 배선들을 브라켓 하부에 배 치된 인쇄회로기판과 전기적으로 연결하는 통로 역할을 할 수 있다. 또는 상기 제1 센서 안착 영역(241a) 에 배치되는 배선 홈 또는 배선 홀에는 디스플레이에 배치되는 디스플레이 구동 모듈과 지문 센서를 전기적으로 연결하는 배선이 배치될 수 있다. 상기 인쇄회로기판은 상기 브라켓 하부에 배치되고, 상기 디스플레이 및 상기 지문 센서와 전기적으로 연결될 수 있다. 인쇄회로기판은 디스플레이 구동 및 지문 센서 구동과 관련한 프로 세서가 안착될 수 있다. 상기 배터리는 상기 브라켓 하부에서 상기 인쇄회로기판과 나란한 층에 배치될 수 있다. 상기 후면 커버는 상기 인쇄회로기판과 상기 배터리 등을 감싸도록 배치될 수 있다. 도 5는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치의 또 다른 예를 나타낸 도면이다. 도 5를 참조하면, 본 발명의 전자 장치는 케이스, 디스플레이, 후면 패널, 지문 센서 , 브라켓, 인쇄회로기판, 배터리, 및 후면 커버를 포함할 수 있다. 이러한 구성 중 디스플레이, 후면 패널, 인쇄회로기판, 배터리 및 후면 커버는 앞서 도 4에서 설명한 구성들과 실질적으로 동일한 구성일 수 있다. 상기 지문 센서는 상기 후면 패널의 센서 배치 영역 과 정렬되어 배치될 수 있다. 상기 브라켓은 상기 지문 센서가 배치되는 제2 센서 안착 영역(241b)을 포함할 수 있다. 상기 제2 센 서 안착 영역(241b)은 상기 브라켓의 전면 및 후면을 관통하는 홀 형태로 마련될 수 있다. 상기 제2 센서 안착 영역(241b)에는 상기 지문 센서가 안착 및 고정될 수 있다. 이에 따라, 상기 제2 센서 안착 영역 (241b)의 넓이는 상기 지문 센서의 크기에 대응하는 넓이를 가질 수 있다. 다양한 실시 예에 따르면, 상기 지문 센서가 상기 제2 센서 안착 영역(241b)에 고정되도록 상기 제2 센서 안착 영역(241b)의 측면과 상기 지문 센서 사이에는 접착층이 배치될 수 있다. 다양한 실시 예에 따르면, 지문 센서가 안착홀에 안착 되는 경우 지문 센서는 디스플레이 FPCB에 연결되지 않고 메인 PCB에 직접 연결될 수도 있다. 디스플레이에 상대적으로 가깝게 배치되도록, 상기 지문 센서의 전면은 브라켓의 전면과 동일한 높이로 배치 고정될 수 있다. 한 실시예에 따르면, 상기 지문 센서가 발광부와 수광부를 포함하는 경우, 상기 지문 센서의 발광부는 지문 센서의 외곽에 배치되고, 상기 지문 센서의 수광부는 중앙에 배치될 수 있다. 상기 지문 센서의 수광부는 상기 후면 패널의 센서 배치 영역을 통하여 디스플레이 일정 영역과 대면될 수 있다. 다양한 실시 예에 따르면, 본 발명의 지문 센서는 수광부만을 포함할 수 있다. 전자 장치의 지정된 위치의 광원에서 조사된 광은 손가락의 지문 영역에 반사되거나 굴절되어 상 기 지문 센서에 의해 수집될 수 있다. 상기 광원은 상기 조사된 광이 직접적으로 또는 간접적으로, 또는 굴절이나 반사를 이용하여 상기 지문 영역에 도달할 수 있도록 설정된 전자 장치의 내부의 지정된 위치에 배치될 수 있다. 도 6a는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치 구조의 한 예를 나타낸 도면이다. 도 6a를 참조하면, 본 발명의 전자 장치(600a)는 케이스, 디스플레이, 후면 패널, 브라켓, 지문 센서, 인쇄회로기판, 배터리 및 후면 커버를 포함할 수 있다. 상술한 구성 중 디스플레이, 후면 패널, 인쇄회로기판, 배터리 및 후면 커버는 앞서 도 4에서 설명한 구성 들과 실질적으로 동일한 구성일 수 있다. 상기 지문 센서는 상기 후면 패널의 센서 배치 영역과 정렬되어, 디스플레이의 일정 영역(예: 투명 영역)과 대면될 수 있다. 상기 지문 센서는 제1 센서 안 착 영역(241a)에 안착될 수 있다. 한 실시 예에 따르면, 상기 지문 센서의 고정 방식은 601 상태에서와 같이, 후면 패널에 고정될 수 있다. 상기 지문 센서의 수광부(또는 발광부와 수광부)가 지문 센서 하우징의 중앙에 배치될 수 있다. 이 에 따라, 센서 접착층(198a)의 일측은 상기 수광부가 배치된 지문 센서 하우징의 중앙 영역을 제외하고, 주변 영역에 접착될 수 있다. 상기 센서 접착층(198a)의 타측은 지문 센서 상부에 배치되는 후면 패널의 센서 배치 영역의 테두리에 접착될 수 있다. 상기 지문 센서는 앞서 설명한 센서 안착 영역에 안착 고정될 수 있다. 이때, 센서 안착 영역의 내측에 접착물질이 도포되어 상기 지문 센서를 고정할 수 있다. 또는, 상기 센서 안착 영역은 상기 지문 센서의 크기와 동일하게 형성되어, 상기 지문 센서를 억지끼움 방식으로 삽입되도록 마련될 수 있다. *81한 실시 예에 따르면, 상기 지문 센서의 고정 방식은 603 상태에서와 같이, 브라켓에 고정될 수 있다. 예컨대, 상기 지문 센서는 후면부 또는 측면부 중 적어도 일부에 배치된 센서 접착층(198b)을 포함 할 수 있다. 센서 접착층(198b)이 마련된 지문 센서는 브라켓의 센서 안착 영역에 접착될 수 있 다. 추가적으로, 상기 지문 센서와 후면 패널 사이의 공극을 제거할 수 있는 실링재가 배치될 수 있다. 상기 실링재는 환 형태(예: 타원 링 또는 다각형 링 형태 등)로 마련되고, 지문 센서의 주 변부에 배치될 수 있다. 상기 실링재가 배치되는 영역은 지문 센서의 수광부(또는 발광부와 수광부) 가 배치된 중앙 영역을 제외한 영역이 될 수 있다. 상기 실링재는 선택적 설계에 따른 것으로, 설계 정책 에 따라 생략될 수도 있다. 또한, 상기 실링재는 접착 성분(예: OCA(optically clear adhesive) 또는 OCR(optically clear resin))을 포함하여, 지문 센서를 후면 패널에 고정시키는 역할을 할 수도 있 다. 다음은 디스플레이 패널과 지문센서 간 일정한 air gap을 유지하기 위한 방법에 대한 실시예이다. 지문 인식률 향상을 위해 일정한 air gap 을 유지할 필요가 있다. 지문센서를 Calibration 할 때 상태와 실제 사용시 air gap이 다르면 이미지 품질이 낮아져서 인식률이 매우 떨어질 수 있다. 따라서 지문센서를 디스플레이 후면에 부 착하는 구조를 통해 제조 과정에서의 air gap 단차를 최소화 할 수 있다. 도 6b는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치 구조의 다른 한 예를 나타낸 도면이다. 도 6b를 참조하면, 본 발명의 전자 장치(600b) 일부 구성은 디스플레이, 보호층(190_6), 디지타이저 (301_1), 접착층(302_1), 지문 센서(예: 상기 지문 센서)를 포함할 수 있다. 상기 보호층(190_6) 및 상기 디지타이저(301_1)는 앞서 설명한 상기 후면 패널에 포함될 수 있다. 추가적으로 또는 대체적으로, 상기 디지타이저(301_1) 하부에는 방열층(Cu/Gr, 구리/그래파이트)이 더 배치될 수 있다. 다양한 실시 예에 따 르면, 상기 보호층(190_6)은 분리되어 각기 다른 위치에 배치될 수 있다. 예컨대, 상기 보호층의 일부(예: 엠보 층)는 상기 디지타이저(301_1) 상부에 배치되고, 상기 보호층의 다른 일부(예: 쿠션층)는 상기 디지타이저 (301_1) 하부와 상기 방열층 사이에 배치될 수도 있다. 도시된 도면에서는 지문 센싱과 관련한 센서 배치 영역을 포함하는 일부만을 나타낸 것으로 추가적으로 또 는 대체적으로 앞서 도 6a에서 설명한 바와 같이 상기 전자 장치(600b)는 상기 지문 센서가 안착되는 홈이 형성된 브라켓과, 상기 지문 센서 구동과 관련한 신호를 공급하는 프로세서가 안착된 인쇄회로기판, 전원 을 공급하는 배터리 및 후면 커버 등을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 지문 센서는 605 상태에서와 같이, 디스플레이와 지문 센서 사 이(예: 센서 배치 영역의 적어도 일부 또는 센서 배치 영역에 마련된 후면 패널의 개구부의 적어도 일부)에 에 어 갭이 형성된 형태로 배치될 수 있다. 상기 지문 센서는 예컨대, 광학층(610_1), 다이 (610_2)(die), 센서 접착층(610_3), 기판(610_4) 및 센서 케이스(610_6)를 포함할 수 있다. 상기 광학층 (610_1)은 지문 센싱과 관련한 광을 수광하는 렌즈(예: micro array lens)층 및/또는 광학 필터층을 포함할 수 있다. 상기 다이(610_2)는 상기 광학층(610_1)이 수집한 광을 전기적 신호로 변환한 후 기판(610_4)에 전달하는 반도체(예: photo diode array)를 포함할 수 있다. 상기 센서 접착층(610_3)은 상기 다이(610_2)를 상기 기판(610_4)에 고정시킬 수 있다. 상기 기판(610_4)은 상기 다이(610_2)가 전달한 전기적 신호를 지정된 콤포넌트 (예: 프로세서)에 전달할 수 있다. 이와 관련하여, 상기 기판(610_4) 상에는 적어도 하나의 신호 라인들이 배치 되고, 상기 신호 라인들은 상기 다이(610_2)와 리드(610_5)를 통해 연결(예: 와이어 본딩)될 수 있다. 상기 센 서 케이스(610_6)는 상기 광학층(610_1) 및 다이(610_2)를 감싸는 구조물로서 플라스틱 구조물 또는 폴리머 구 조물 또는 에폭시 몰딩 등으로 형성될 수 있다. 상기 센서 케이스(610_6)는 상하부가 개구되어 상측으로는 지문 센싱과 관련한 광을 수광하고, 하부로는 센싱된 광에 대한 전기적 신호를 기판(610_4)에 전달될 수 있는 통로를 제공할 수 있다. 상기 디스플레이는 앞서 도 3a 등에서 설명한 디스플레이와 동일 또는 유사한 구성을 포함할 수 있다. 예 컨대, 상기 디스플레이는 글래스 등을 포함하는 외부 보호층, 광학 접착층, 편광층 및 터치 패널, 광학 접 착층, 표시 패널 등을 포함할 수 있다. 추가적으로, 상기 디스플레이의 적어도 일부는 디자인층 등을 더 포함할 수 있다. 상기 디스플레이의 일측 하부에는 지문 센싱과 관련한 홀이 형성되고 센서 배치 영역 에 정렬되는 보호층(190_6)과, 디지타이저(301_1), 방열층 및 접착층(302_1)이 배치될 수 있다. 상기 보호층(190_6)은 예컨대 엠보층 또는 쿠션층을 포함하고, 센서 배치 영역에 대응되는 영역에 형성된 일정 크기의 홀을 포함할 수 있다. 다양한 실시 예에 따르면, 보호층(190_6) 중 일부 구성(예: 엠보층)은 지문 센서와 디스플레이 사이의 거리를 최소화하기 위하여 디스플레이 하부에 배치되고, 나머지 일부층(예: 쿠션층) 은 디지타이저(301_1) 하부에 배치될 수 있다. 또는, 상기 전자 장치는 방열층을 더 포함할 수 있고, 상기 방열층은 상기 디지타이저(301_1) 하부에 놓일 수 있다. 다양한 실시 예에 따르면, 상기 방열층 하부 에 쿠션층이 더 배치될 수도 있다. 또는 상기 방열층는 상기 접착층(302_1)과 나란하게 배치될 수 있다. 상기 디지타이저(301_1)는 상기 보호층(190_6) 하부에 배치되면서, 센서 배치 영역에 대응되는 영역에 형 성된 일정 크기의 홀을 포함할 수 있다. 상기 디지타이저(301_1)에 배치된 홀은 상기 보호층(190_6)에 형성된 홀과 상하로 정렬 배치될 수 있다. 상기 디지타이저(301_1)와 상기 지문 센서의 가장자리 영역 사이에는 접착층(302_1)이 배치되어, 지문 센서는 디지타이저(301_1) 하부에 고정될 수 있다. 상기 접착층(302_1)은 중앙에 빈 영역이 형성된 띠 형상으로 마련될 수 있다. 이에 따라, 상기 센서 배치 영역을 기준으로, 상기 디스플레이의 하부면과 상기 지문 센서의 상부면 사이에는 에어 갭이 형성될 수 있다. 상기 에 어 갭은 공기가 매질로 배치된 영역으로서, 상기 디스플레이 상에 놓인 지문의 표면으로 반사된 광이 상기 에어 갭을 통해 산란하면서 상기 지문 센서에 지문과 관련한 보다 많은 광을 제공할 수 있도록 작용할 수 있다. 예컨대, 디스플레이와 지문 센서의 광학층(610_1)이 직접 접촉되어 배치되는 경우 두 물체 간의 매질들의 유전율 차이로 인하여 디스플레이에서 지문 센서 방향으로 진입하는 광이 접 촉면에서 반사가 크게 발생할 수 있다. 상기 에어 갭은 디스플레이과 지문 센서 간의 급격한 유 전율 차이를 줄여 주어, 디스플레이와 지문 센서의 접촉면에서 발생하는 반사율을 줄여 주어 지문 센 서로 진입되는 광을 늘릴 수 있도록 작용할 수 있다. 상술한 구조의 전자 장치(600b)는 센서 배치 영역 상에 배치된 디스플레이의 적어도 일부 픽셀들 또 는 센서 배치 영역 및 센서 배치 영역으로부터 일정 거리 이내에 인접한 디스플레이의 적어도 일부 픽셀들이 지정된 색(예: 백색, 녹색 등)으로 발광하면, 디스플레이 상부에 접촉되는 지문의 표면에서 반사된 광이 센서 배치 영역의 디스플레이를 투과한 후, 에어 갭을 통과하여 지문 센서에 전달될 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치(600b)는 607 상태에서와 같이 디스플레이 하부에 센서 배치 영 역에 대응하는 홀이 형성된 보호층(190_6)과, 보호층(190_6) 하부에 디지타이저(301_2), 방열층 및 접착층(302_2)이 배치되고, 상기 접착층(302_2) 하부에 지문 센서가 배치되는 구조를 가질 수 있다. 이와 관련하여, 상기 디지타이저(301_2)는 상기 지문 센서의 일면(예: 상부면) 크기에 대응하는 홀이 형성될 수 있다. 다양한 실시 예에 따르면, 상기 디지타이저(301_2) 하부에 상술한 후면 패널에 포함되는 방열층이 더 배치될 수 있다. 상기 607 상태에서의 지문 센서는 앞서 605 상태에서 설명한 바와 같이 광학층, 다이, 센서 접착층, 기판 및 센서 케이스 등을 포함할 수 있다. 상기 접착층(302_2)은 상기 디지타이저(301_2)와 동일 레이어에 배치되고, 상기 보호층(190_6)과 상기 지문 센 서를 직접적으로 접착시킬 수 있다. 이에 따라, 상기 센서 배치 영역에서 상기 디스플레이의 하 부 표면과 상기 지문 센서 사이에는 일정 두께의 에어 갭(620_1)이 형성될 수 있다. 상기 에어 갭(620_1) 의 두께는 예컨대, 상기 보호층(190_6) 및 상기 접착층(302_2)(또는 디지타이저(301_2))의 두께를 포함한 두께 를 가질 수 있다. 상기 에어 갭(620_1)의 두께는 상기 디스플레이에서 지문 센서 방향으로 광이 진입할 때 작용하는 두께로서, 상기 지문 센서의 광학층 특성에 따라 607 상태에서와 같이 보호층(190_6)과 접 착층(302_2)의 두께를 가지거나 앞서 도 605에서 설명한 바와 같이 보호층과 디지타이저 및 접착층의 두께를 가 지도록 설계될 수 있을 것이다. 상기 접착층(302_2)의 중심부 홀 크기는 상기 후면 패널의 홀 크기 이상으 로 마련될 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치(600b)는 609 상태에서와 같이 디스플레이 하부에 센서 배치 영 역에 대응하는 홀이 형성된 보호층(190_6)과, 보호층(190_6) 하부에 디지타이저(301_1)가 배치되고, 상기 디지타이저(301_1) 하부에 지문 센서가 배치되는 구조를 가지면서, 상기 디스플레이와 상기 지문 센 서 사이에 광학 접착층이 배치될 수 있다. 상기 디지타이저(301_1)는 상기 후면 패널의 센서 배 치 영역에 대응하는 영역의 홀과 동일 또는 유사한 크기를 가지며 상기 보호층(190_6)의 홀에 상하로 정렬 되는 홀을 가질 수 있다. 상기 보호층(190_6)의 홀 내부 및 상기 디지타이저(301_1)의 홀 내부는 상기 광학 접 착층의 일부가 채워질 수 있다. 상기 디지타이저(301_1)의 홀이 형성된 영역의 주변 하부에는 상기 광학 접착층이 일정 두께로 배치되어 상기 지문 센서를 상기 디지타이저(301_1)에 고정시킬 수 있다. 상기 광학 접착층의 상부면은 상기 디스플레이의 하부면 일측과 접촉되고, 상기 광학 접착층의 하부 면 일부는 상기 지문 센서의 상부면(예: 광학층)과 접촉될 수 있다. 한 실시 예에 따르면, 상기 센서 배치 영역의 디스플레이와 상기 지문 센서 사이에 상기 광학 접착층의 적어도 일부가 배치될 수 있다. 이에 따라, 상기 광학 접착층은 보호층(190_6)의 두께, 상기 디지타이저(301_1)의 두께 및 상기 디 지타이저(301_1)와 상기 지문 센서 사이의 이격 거리를 포함한 상하부 폭을 가질 수 있다. 상기 광학 접착 층은 상기 디스플레이 및 상기 지문 센서와 다른 유전율을 가지는 매질로서 작용하고, 이에 따 라, 디스플레이에서 지문 센서 방향으로 보다 많은 광이 진입하도록 작용하면서, 상기 보호층(190_ 6)과 디지타이저(301_1) 및 지문 센서를 고정시키는 역할을 수행할 수 있다. 다양한 실시 예에 다르면, 상 기 디지타이저(301_1) 하부에는 앞서 설명한 후면 패널에 포함되는 방열층이 더 배치될 수 있다. 도 6c는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치 구조의 또 다른 한 예를 나타낸 도면이다. 도 6c를 참조하면, 본 발명의 전자 장치(600c) 일부 구성은 디스플레이, 후면 패널(예: 보호층 (193_1, 193_2) 및 방열층(195_1, 195_2)), 접착층(302_3, 302_4) 및 지문 센서(예: 상기 지문 센서 )를 포함할 수 있다. 추가적으로 또는 대체적으로 상기 전자 장치(600c)는 디스플레이와 상기 지문 센서 사이에 배치되는 광학 접착층(630_1)을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 보호층 (193_1, 193_2)은 분리되어 각기 다른 위치에 배치될 수 있다. 예컨대, 상기 보호층(예: 엠보층)은 상기 방열층 (195_1, 195_2) 상부에 배치되고, 상기 지지층(예: 쿠션층)은 상기 방열층(195_1, 195_2) 하부에 배치될 수도 있다. 도시된 도면에서는 지문 센싱과 관련한 센서 배치 영역 일부만을 나타낸 것으로 추가적으로 또는 대체적으 로 앞서 도 6a에서 설명한 바와 같이 상기 전자 장치(600c)는 상기 지문 센서가 안착되는 홈이 형성된 브 라켓과, 상기 지문 센서 구동과 관련한 신호를 공급하는 프로세서가 안착된 인쇄회로기판, 전원을 공급하 는 배터리 및 후면 커버 등을 더 포함할 수 있다. 다양한 실시 예에 따르면, 611 상태에서와 같이, 상기 디스플레이는 앞서 도 6a 또는 도 6b 등에서 설명한 디스플레이와 동일 또는 유사한 구성을 포함할 수 있다. 예컨대, 상기 디스플레이는 글래스 등을 포함하는 외부 보호층, 광학 접착층, 편광층 및 터치 패널, 광학 접착층, 표시 패널, 디자인층 중 적어도 하나를 포함할 수 있다. 상기 디스플레이의 일측 하부에는 지문 센싱과 관련한 홀이 형성되고 센서 배치 영역에 정 렬되는 후면 패널과, 지문 센서이 배치될 수 있다. 상기 후면 패널은 예컨대 보호층(193_1), 및 방열층(195_1) 중 적어도 하나의 층을 포함하고, 센서 배치 영역에 대응되는 영역에 형성된 일정 크기의 홀을 포함할 수 있다. 예컨대, 상기 후면 패널에 형성된 홀은 상기 지문 센서의 광학층 전면의 크기 이하로 형성될 수 있다. 상기 후면 패널 일측과 상기 지 문 센서의 가장자리 영역 사이에는 접착층(302_3)이 배치될 수 있다. 이에 따라, 지문 센서는 후면 패널 하부에 고정될 수 있다. 상기 접착층(302_3)은 중앙에 빈 영역이 형성된 띠 형상으로 마련될 수 있다. 상기 접착층(302_3)의 내부 홀 크기는 예컨대 상기 후면 패널에 형성된 홀 크기 이상으로 형성될 수 있다. 이에 따라, 상기 센서 배치 영역을 기준으로, 상기 디스플레이의 하부면과 상기 지문 센서 의 상부면 사이에는 일정 두께의 에어 갭(620_1)이 형성될 수 있다. 예컨대, 상기 에어 갭(620_1)은 상기 후면 패널의 두께 및 접착층(302_3)의 두께를 포함한 두께를 가질 수 있다. 상기 에어 갭(620_1)은 디스플 레이에서 지문 센서 방향으로 갈수록 단면의 면적이 커질 수 있다. 다양한 실시 예에 따르면, 613 상태에서와 같이, 상기 후면 패널(190_1)은 예컨대 보호층(193_2)과 방열층 (195_2)을 포함하고, 지문 센서에 대응하는 일정 크기의 홀을 포함할 수 있다. 예컨대, 상기 후면 패널 (190_1)의 홀은 상기 지문 센서의 전면 크기 이상으로 마련될 수 있다. 상기 후면 패널(190_1)의 홀 내측 가장자리에는 접착층(302_4)이 배치될 수 있다. 상기 접착층(302_4)은 중심부가 빈 띠 형상으로 마련될 수 있다. 이에 따라, 상기 디스플레이와 상기 지문 센서 사이에는 접착층(302_4) 두께에 해당하는 에어 갭(620_2)이 형성될 수 있다. 다양한 실시 예에 따르면, 615 상태에서와 같이, 상기 디스플레이와 상기 지문 센서 사이에 광학 접 착층(630_1)이 배치될 수 있다. 상기 광학 접착층(630_1)은 상기 지문 센서 상부 전면에 고르게 분포될 수 있다. 상기 후면 패널(190_1)은 보호층 (193_2) 및 방열층(195_2)을 포함할 수 있다. 상기 후면 패널(190_1)은 센서 배치 영역에 대응되는 영역에 형성되며 상기 지문 센서의 전면 크기 이상으로 형성되는 홀을 포 함할 수 있다. 이에 따라, 상기 후면 패널(190_1) 내부에는 상기 지문 센서가 놓일 수 있다. 이에 따라, 상기 후면 패널(190_1)의 홀이 상기 지문 센서의 주변부를 감싸는 형태로 배치될 수 있다. 상기 광학 접착 층(630_1)은 상기 디스플레이 및 상기 지문 센서가 직접적으로 접촉된 상태에 비하여 상기 디스플레 이에서 상기 지문 센서 방향으로 보다 많은 광이 진입하도록(또는 광 반사율을 줄여주도록) 작용할 수 있다. 상기 611 상태, 613 상태 및 615 상태에서 설명한 지문 센서는 앞서 도 6b에서 설명한 바와 같이, 광학층, 다이, 센서 접착층, 기판 및 센서 케이스를 포함할 수 있다. 도 7은 본 발명의 실시 예에 따른 전자 장치의 파장 선택 기판 배치의 한 예를 나타낸 도면이다. 도 7을 참조하면, 본 발명의 전자 장치는 케이스, 디스플레이, 파장 선택 기판, 후면 패널 , 지문 센서, 브라켓, 인쇄회로기판 및 배터리, 후면 커버를 포함할 수 있다. 상기 파장 선택 기판은 설계 방식 변경 등에 따라 선택적으로 적용될 수 있다. 예컨대, 상기 파장 선택 기 판은 제거될 수도 있으며, 배치 위치도 변경될 수 있다. 한 실시예에 따르면, 상기 파장 선택 기판은 상기 디스플레이보다 작은 크기를 갖는 영역에 국부적으로 배치 될 수 있으며 (예: 파장 선택부) 이 에 대한 추가적인 정보는, 예를 들면, 도 8, 도 9a, 및 그에 대한 설명 부분에 기재되어 있다. 상기 디스플레이는 앞서 언급한 바와 같이, 외부 보호층, 접착층(예: OCA), 편광층, 표시 패널을 포함할 수 있다. 상술한 디스플레이는 적어도 일부(예: 지문 센서가 배치된 지문 인증 영역)가 투명하게 형성될 수 있다. 디스플레이의 표시 패널에 포함된 적어도 하나의 픽셀(예: 지문 인증 영역에 배치된 픽셀들 또는 지문 인증 영역을 포함한 일정 크기 영역에 배치된 픽셀들)에서 조사된 광은 투명한 디스플레이 내부를 관통하여 지문 센서에 유입될 수 있다. 상기 파장 선택 기판은 상기 디스플레이의 표시 패널 하부에 배치될 수 있다. 예컨대, 상기 파 장 선택 기판은 상기 표시 패널 하부 전체(또는 상기 표시 패널 중 픽셀들이 배치된 액티브 영 역 하부 전체)에 배치될 수 있다. 파장 선택 기판은 광원에서 조사된 광의 주파수 스펙트럼 중 지정된 주 파수대역만을 투과하도록 마련된 기판을 포함할 수 있다. 다양한 실시예에 따르면, 상기 파장 선택 기판의 적어도 일부 층은 지정된 파장 대역의 광만을 선택적으로 투과(예: 특정 파장의 투과율 약 90% 이상)시킬 수 있 는 광필터(optical filter)층을 포함할 수 있다. 광필터 층은 특정한 파장의 광만 통과시키는 특성을 갖는 광수 동 소자를 이용하여 약 0.15T 이하의 두께를 가지며 flexible 또는 rigid하게 구성할 수 있다. 광필터 층은, 예 를 들면, 유리, 플라스틱(예: 폴리에틸렌 테레프탈레이트(polyethylene terephthalate, PET)), 필름, 유전체 박막 필터 (thin film filter (TFF)), 또는 액상(예: 특정 대역의 광원(예: NIR(near infra-red))이 투과 가능 한 블랙 잉크층)의 형태를 가질 수 있다. 한 실시예에 따르면, 상기 파장 선택 기판은 가시광선 대역의 적어도 일부 주파수 대역(또는 파장대) 또는 가시광선 대역 및 적외선 대역을 투과시키도록 마련될 수 있다. 예컨대, 상기 파장 선택 기판은 500nm~800nm 파장대, 또는 디스플레이의 광투과율이 3% 이상인 파장대, 또는 녹색 계열(예: 파장이 약 490nm ~ 570nm)의 주파수 대역을 투과시키도록 마련될 수 있다. 또는, 상기 파장 선택 기판은 녹색 계열의 주파수 를 중심으로 좌우 일정 색의 주파수(예: 파장이 약 650nm ~ 780nm인 적색 계열 또는 파장이 약 780nm ~ 1100nm 인 near infra-red (NIR))까지도 투과시키도록 마련될 수 있다. 상기 파장 선택 기판 하부에 배치되는 후 면 패널은 센서 배치 영역(예: 홀)을 포함하며, 이에 따라, 파장 선택 기판을 투과한 지정된 주 파수 대역의 광은 상기 센서 배치 영역을 통해 지문 센서에 전달될 수 있다. 이러한 파장 선택 기판 은 앞서 언급한 바와 같이, 생략될 수도 있다. 또는 도시된 도면에서의 파장 선택 기판 위치는 다른위치로 변경될 수도 있다. 상기 후면 패널은 상기 파장 선택 기판 하부에 배치되며, 센서 배치 영역을 포함할 수 있다. 상 기 센서 배치 영역 하부에는 지문 센서가 배치될 수 있다. 센서 배치 영역을 통하여, 지문 센서 는 디스플레이를 통과하는 광을 수집할 수 있다. 상기 지문 센서는 상기 후면 패널 하부에 배치되데, 도시된 바와 같이 브라켓 일측에 마련된 센 서 안착 영역에 배치될 수 있다. 상기 지문 센서의 적어도 일부(예: 광을 수집할 수 있는 수광부 또 는 발광부와 수광부)는 후면 패널의 센서 배치 영역을 통하여 노출될 수 있다. 상기 브라켓은 상기 후면 패널 하부에 배치되며, 상기 후면 패널과 디스플레이 등을 지지 할 수 있다. 상기 인쇄회로기판은 상기 브라켓 하부에 배치되고, 상기 디스플레이 및 상기 지문 센서와 전기적으로 연결될 수 있다. 인쇄회로기판은 디스플레이 구동 및 지문 센서 구동과 관련한 프로세서가 안착될 수 있다. 상기 배터리는 상기 브라켓 하부에서 상기 인쇄회로기판과 나란한 층에 배치될 수 있다. 상기 후면 커버는 상기 인쇄회로기판과 상기 배터리 등을 감싸도 록 배치될 수 있다. 상술한 바와 같이, 본 발명의 실시 예에 따른 전자 장치는 디스플레이의 적어도 일부 (예: 지정된 영 역 또는 하부 전체)에 파장 선택 기판을 배치함으로써, 상기 지문 센서에 유입되는 원하지 않는 주파 수 대역의 광의 양을 상기 파장 선택 기판이 배치되지 않을 경우와 비교하여 감소시킬 수 있다. 도 8은 본 발명의 실시 예에 따른 전자 장치의 파장 선택 기판 배치의 다른 예를 나타낸 도면이다. 도 8을 참조하면, 본 발명의 전자 장치는 케이스, 디스플레이, 후면 패널, 파장 선택부 , 지문 센서, 브라켓, 인쇄회로기판 및 배터리, 후면 커버를 포함할 수 있다. 상술한 구성에서, 디스플레이, 후면 패널, 인쇄회로기판, 배터리 및 후면 커버는 앞 서 도 4 등에서 설명한 구성과 실질적으로 동일한 구성일 수 있다. 상기 파장 선택부는 앞서 설명한 파장 선택 기판과 동일한 재질, 두께, 또는 광학 특성(예: 지정된 파장대역의 광을 주로 투과하는 특성으로)을 갖되, 상기 지문센서의 크기와 동일 또는 유사한 크기를 가지며, 상기 지문 센서 상부에 배치될 수 있다. 또는, 상기 파장 선택부은 상기 센서 배치 영역의 크기와 유사 또는 동일한 크기를 가질 수 있 다. 상기 파장 선택부가 전면에 배치된 지문 센서는 상기 브라켓 일측에 배치될 수 있다. 예컨대, 상기 지문 센서는 상기 브라켓에 마련된 센서 안착 영역에 배치될 수 있다. 상기 브라켓은 상기 후면 패널 하부에 배치되며, 일측에 상기 지문 센서가 안착되는 센서 안착 영역을 포함할 수 있다. 상기 센서 안착 영역의 깊이는 상기 지문 센서 및 상기 파장 선택부의 높이에 대응하 는 높이를 가질 수 있다. 상기 센서 안착 영역에 상기 지문 센서를 고정하기 위해, 상기 센서 안착 영역의 내측벽과 상기 지문 센서 사이 중 적어도 일부 영역에 접착층이 배치될 수 있다. 도 9a는 본 발명의 실시 예에 따른 전자 장치의 파장 선택 기판 배치의 또 다른 예를 나타낸 도면이다. 도 9a를 참조하면, 본 발명의 전자 장치는 케이스, 디스플레이, 후면 패널, 파장 선택부 , 지문 센서, 브라켓, 인쇄회로기판 및 배터리, 후면 커버를 포함할 수 있다. 상술한 구성에서, 디스플레이, 인쇄회로기판, 배터리 및 후면 커버는 앞서 도 4 등에서 설 명한 구성과 실질적으로 동일한 구성일 수 있다. 상기 후면 패널은 상기 디스플레이 하부에 배치되어 디스플레이를 보호하거나 디스플레이 에서 발생하는 열을 방열하는 기능을 수행할 수 있다. 상기 후면 패널은 상기 지문 센서가 디스플레 이와 대면되도록 센서 배치 영역(예: 홀)을 포함할 수 있다. 상기 파장 선택부는 앞서 설명한 파장 선택 기판과 동일한 재질, 두께, 또는 광학 특성(예: 지정된 파장대역의 광을 주로 투과하는 특성)을 갖고, 상기 센서 배치 영역 일측에 배치될 수 있다. 예컨대, 상기 파장 선택부는 센서 배치 영역에 삽입 배치되면서, 상기 후면 패널과 나란하게 배치될 수 있다. 상기 파장 선택부는 상기 센서 배치 영역의 크기에 대응하는 크기를 가질 수 있다. 상기 파장 선택부 는 상기 센서 배치 영역에 고정될 수 있다. 다양한 실시예에 따르면, 상기 센서 배치 영역의 크 기는 상기 지문 센서의 전면의 크기와 실질적으로 동일하거나, 더 크거나 (예: 지문 센서의 전면의 크기 대비 약 120%), 또는 더 작도록 (예: 지문 센서의 전면의 크기 대비 약 50~100%) 구성할 수 있다. 상기 파장 선택부가 배치된 센서 배치 영역 하부에 지문 센서가 배치될 수 있다. 상기 지문 센서는 브 라켓의 센서 안착 영역에 안착될 수 있다. 이에 따라, 상기 디스플레이의 픽셀에서 광이 조사되 면, 상기 센서 배치 영역에 배치된 파장 선택부를 거치면서 픽셀에서 조사된 광 중 지정된 대역의 주 파수(예: 파장이 약 490nm ~ 570nm인 녹색 계열, 파장이 약 650nm ~ 780nm인 적색 계열, 또는 파장이 약 780nm ~ 1100nm인 NIR)에 해당하는 일부 광만 투과될 수 있다. 상기 투과된 일부 광은 지문 센서의 수광부에 전 달될 수 있다. 도 9b는 본 발명의 실시 예에 따른 지문 인증과 관련한 광 경로를 설명하는 도면이다. 도 9b를 참조하면, 지문을 포함하는 물체가 전자 장치의 디스플레이 상의 일정 지점(예: 외부 보호층 )에 놓인 상태에서, 표시 패널의 적어도 하나의 픽셀에서 발생한 광은 도시된 도면을 기준으로 상측 방향으로 조사될 수 있다. 상측 방향으로 조사된 광 중 물체(예: 손가락)에 부딪힌 광은 진행 방향이 변경 될 수 있다. 예컨대, 픽셀에서 조사된 광 중 물체에 반사된 광은 지문 센서가 위치한 영역으로 진행 할 수 있다. 이때, 물체에 반사된 광은 제1 접착층(163_1), 편광층, 제2 접착층(163_1), 표시 패널 을 투과하고, 파장 선택층(예: 파장 선택 기판 또는 파장 선택부(251 또는 252)) 및 후면 패널 의 센서 배치 영역을 통하여 지문 센서에 전달될 수 있다. 이 과정에서, 픽셀에서 조사된 광 중 지문 센싱에 사용되지 않는 파장대의 광(예: 노이즈 소스)은 파장 선택 기판에 의하여 걸러지고, 지문 센싱에 사용되는 파장대의 광만이 지문 센서에 전달될 수 있다. 다양한 실시 예에 따르면, 발광부가 지문 센 서에 배치되고, 지문 센서 상부에 파장 선택층이 배치되는 경우, 발광부에서 조사된 광이 파장 선택층을 통과하면서, 지정된 파장 대역의 광 이외의 다른 파장 대역의 광이 감소된 후, 지문 영역에 반사되어 수광될 수 있다. 도 10은 본 발명의 실시 예에 따른 지문센서가 지문 센서 시트의 형태로 배치된 전자 장치의 일부 구 성을 나타낸 도면이다. 도 10을 참조하면, 본 발명의 전자 장치는 외부 보호층, 접착층, 편광층, 표시 패널, 일정 영역에 대한 지문 센싱이 가능하도록 설계된 지문 센서들이 복수개 배치된 지문 센서 시트(예: CMOS 이미지 센서 레이어), 후면 패널을 포함할 수 있다. 추가적으로, 상기 전자 장치는 상기 후면 패널 하부에 배치되는 브라켓, 인쇄회로기판, 배터리, 후면 커버 등을 더 포함할 수 있다. 상기 외부 보호층 , 접착층, 편광층, 표시 패널 및 후면 패널 등은 앞서 도 2에서 설명한 구성들과 실질적으 로 동일 또는 유사한 구성일 수 있다. 상기 지문 센서 시트는 복수개의 지문 센서 모듈(예: photo diode array)이 TFT(Thin Film Transistor) 기반 매트릭스 형태로 배치된 시트일 수 있다. 상기 지문 센서 시트는 앞서 설명한 지문 센서에 비하 여 상대적으로 넓은 영역에서 사용자 지문 인식과 관련한 광 조사 및 수광을 처리할 수 있다. 이와 관련하여, 지문 센서 시트는 복수개의 지문 센서들이 디스플레이 크기와 동일 또는 유사한 크기의 영역에 배치 된 형태를 포함할 수 있다. 상기 지문 센서 시트는 상기 표시 패널 하부에 라미네이션(Lamination)될 수 있다. 상기 지문 센서 시트는 시트 전체 중 적어도 일부 영역에서 지문 검출과 관련한 광을 수집할 수 있다. 상기 지문 센서 시트는 광원에서 조사되어, 사용자의 신체 일부(예: 손가락)에 의해 반사된 광을 수 집하고, 수집된 광을 기반으로 지문 이미지에 대응하는 이미지 정보를 생성하여 프로세서에 의해 사용 가능하도 록 지문센서의 내부 메모리(또는 버퍼)에 저장할 수 있다. 상기 지문 센서 시트는 상기 지문 이미지 를 획득하는 과정에서, 지문 이미지가 획득되는 디스플레이 상의 위치 정보를 수집하고, 수집된 위치 정보도 프 로세서에 의해 사용 가능하도록 저장할 수 있다. 또는, 상기 지문 센서 시트에 배치되는 복수개의 지문 센 서 시트들은 영역별로 독립적으로 운용될 수 있다. 예컨대, 지문 센서 시트는 전자 장치의 프로세서 제어 에 대응하여 손가락 등이 터치된 영역에 대응하는 일정 영역의 이미지 정보를 획득하고, 획득된 이미지 정보를 프로세서에 의해 사용 가능하도록 메모리에 저장할 수 있다. 이와 관련하여, 상기 지문 센서 시트는 지문 인증 동작과 관련된 손가락 등의 이미지를 획득하여 저장함으로써 프로세서가 이 이미지들을 적어도 기반하여, 손가락 접근 여부를 판단할 수 있도록 지원 할 수 있다. 지문 센서 시트는 프로세서가 지문 인증 영역을 지정하는 경우, 해당 영역에서 획득된 이미지 정보만을 획득할 수 있다. 다양한 실시 예에 따르면, 디스플레이 에 포함된 터치 센서에 의해 손가락이 터치되는 영역을 프로세서가 확인하면, 지문 센서 시트는 상기 프로세서 제어에 대응하여 해당 터치 영역에서의 이미지 정보를 획득할 수 있다. 한 실시 예 따르면, 상기 지문 센서 시트 (예: 상기 지문 센서)은 손가락 이미지에 대응하는 정보, 지문 이미지에 대응하는 정보, 또는 손가락 또는 지문에 대응하는 위치 정보를 획득한 후, 그 획득된 정보의 적어도 일부 정보를 프로세서로전달할 수 있다. 도 11a는 본 발명의 실시 예에 따른 전자 장치의 픽셀 구조의 한 예를 나타낸 도면이고, 도 11b는 본 발명의 실 시 예에 따른 전자 장치 픽셀 구조에서의 지문 센서 운용을 설명하는 도면이다. 도 11a 및 도 11b를 참조하면, 디스플레이의 픽셀 구조는 예컨대, 복수개의 서브 픽셀들(1101R, 1101G, 1101B)과, 서브 픽셀들(1101R, 1101G, 1101B)을 연결하는 신호 라인들(1103, 1105) 및 일정 투명도를 가지는 투명 영역들을 포함할 수 있다. 예컨대, 상기 복수개의 서브 픽셀들(1101R, 1101G, 1101B)은 적색 서브 픽셀(1101R), 파란색 서브 픽셀(1101B), 녹색 서브 픽셀(1101G) 등을 포함할 수 있다. 적색 서브 픽셀(1101R), 파란색 서브 픽셀(1101B) 및 두 개의 녹색 서브 픽셀(1101G)은 하나의 픽셀로 동작할 수 있다. 상기 신호 라인들(1103, 1105)은 예컨대, 상기 서브 픽셀들의 광 조사를 제어하기 위한 표시 배선 및 터 치 센싱과 관련한 터치 배선을 포함할 수 있다. 도시된 바와 같이, 서브 픽셀들(1101R, 1101G, 1101B)과 신호 라인들(1103, 1105)이 배치되지 않은 영역은 투명 영역들로 마련될 수 있다. 상기 투명 영역들 을 통하여, 서브 픽셀들(1101R, 1101G, 1101B)에서 조사된 광이 디스플레이의 후면에 배치된 지문 센서로 전달될 수 있다. 지문 센서가 위치한 지문 인증 영역에 배치된 픽셀들 또는 지문 인증 영역의 주변 영역 픽셀들의 광이 신호 라인들(1103, 1105) 사이의 투명 영역들을 통하여 지문 센서에 유입 될 수 있다. 도 12a는 본 발명의 실시 예에 따른 전자 장치의 터치 감도 변경의 한 예를 설명하는 도면이다. 도 12a를 참조하면, 전자 장치는 디스플레이 영역, 전면 비표시 영역 및 지문 센서가 배 치되어 지문 인식이 가능한 지문 인증 영역을 포함할 수 있다. 또는, 전자 장치는 후면 비표시 영역 및 후면 영역을 포함할 수 있다. 상기 지문 인증 영역 주변 영역과 같이 디스플레이의 픽셀들이 배치될 수 있다. 디스플레이의 지문 인증 영역의 디스플레이 하부에는 지문 센서(상기 지문 센서 및 압력 센서 중 적어도 하나가 배치될 수 있다. 상기 지문 인증 영역의 크기는 지문 센서가 지문 인식할 수 있 는 크기에 대응할 수 있다. 예컨대, 지문 센서가 상대적으로 넓은 영역의 지문 이미지를 획득할 수 있도 록 마련되는 경우, 상기 지문 인증 영역의 크기는 더 크게 정의될 수 있다. 상기 지문 인증 영역이 디스플레이 상에 배치된 위치 정보는 전자 장치의 메모리에 저장 관리될 수 있다. 상기 디스플레이 영역 및 지문 인증 영역에 배치된 디스플레이는 터치 센서를 포함할 수 있다. 이에 따라, 상기 디스플레이 영역 및 지문 인증 영역은 물체 접촉 또는 접근에 따른 터치 이 벤트를 수집할 수 있다. 전자 장치의 프로세서는 지정된 조건 만족에 대응하여 지문 인식 영역의 색상 및 밝기를 변경할 수 있다. 예컨대, 프로세서는 디스플레이 상에 지정된 물체의 접촉(또는 터치)가 발생하면, 지문 인식 영역의 색상 및 밝기 중 적어도 하나를 지정된 형태로 변경할 수 있다. 상기 지문 인식 영역은 지문 인식과 관 련한 지문 센서가 배치된 센서 배치 영역에 대응하는 디스플레이 상의 영역으로서, 사용자 지문이 접촉되 는 디스플레이의 영역 중 하부에 지문 센서가 배치된 외부 커버(external glass)의 적어도 일부 영역을 포 함할 수 있다. 상기 지문 인식 영역은 디스플레이 상에서 사용자 지문이 접촉되는 영역이며, 이하에서 설 명하는 센서 배치 영역은 상기 지문 인식 영역에 대응하며, 상기 지문 인식을 위한 지문 센서가 배치되는 영역 (예: 후면 패널의 적어도 일부 또는 브라켓의 적어도 일부)을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 압력 터치 인식 이후 지문 인식 영역의 색상 및 밝기 중 적어 도 하나를 변경할 수 있다. 예컨대, 프로세서는 디스플레이 상에 지정된 크기 이상의 압력을 가지는 터치 입력이 발생하면, 해당 입력 발생에 대응하여 지문 인식 영역의 색상 및 밝기 중 적어도 하나를 변경할 수 있다. 이와 관련하여, 디스플레이의 지문 인증 영역 하부에는 압력 센서가 배치될 수 있다. 한 실시 예에 따르면, 프로세서는 디스플레이가 턴-오프된 상태에서, 지정된 크기 이상의 압력을 가 지는 터치가 발생하면, 전자 장치를 깨움 상태로 전환(예: 디스플레이에 전원 공급)하고, 지문 인증 을 기반으로 하는 언락 기능을 제공할 수 있다. 이 동작에서, 상기 프로세서는 지문 인식 영역의 색상 및 밝기 중 적어도 하나를 변경하거나, 압력 터치에 대응하여 지정된 패턴의 햅틱 피드백을 출력할 수 있다. 다양한 실시 예에 따르면, 프로세서는 지문 인식 속도 개선을 위해 터치 호버링을 통해 손가락 접근을 미 리 감지하고, 손가락 접근이 지정된 거리 이내로 접근하는 경우, 디스플레이의 고휘도 모드(또는 지문 인식 영역에 지정된 크기 이상의 휘도가 제공되도록 픽셀 또는 발광부의 발광 제어)를 수행할 수 있다. 상기 프로 세서는 지문 인식과 관련하여 지문 인식 영역의 밝기를 미리 지정된 색상 및 밝기로 조절하지 않음으로 해 서 전력 소모를 개선할 수 있다. 다양한 실시 예에 따르면, 전자 장치의 프로세서는 지문 인증과 관련한 어플리케이션이 실행되고 있 는 상태에서 디스플레이 영역의 지정된 영역 또는 지문 인증 영역에서 지정된 터치 이벤트가 발생 하면, 터치 이벤트가 발생한 영역(또는 지문 인증 영역)의 색상 및 휘도를 지정된 색상 및 휘도로 변경할 수 있다. 상기 지정된 색상은 지문 인증에 상대적으로 유리한 파장대의 색상 및 휘도가 될 수 있다. 프로세서 는 지문 인증이 완료되면, 터치 이벤트가 발생한 영역의 색상을 터치 발생 이전 색상으로 복원할 수 있다. 한 실시 예에 따르면, 상기 지문 인증 영역에 배치된 터치 센서는 프로세서 제어에 대응하여 터치 감도 조정을 수행할 수 있다. 예컨대, 상기 지문 인증 영역의 터치 감도는 지문 인증이 요청되는 시간 동안 더 민감하게 조정될 수 있다. 이 경우, 전자 장치의 프로세서는 디스플레이 전체 영역의 터치 감도를 이 전 상태에 비하여 상대적으로 더 민감하게 조정하거나 또는 지문 인증 영역을 포함하는 일부 영역의 터치 감도를 상대적으로 더 민감하게 조정할 수 있다. 지문 인증 영역에서 발생하는 호버링 신호(또는 디스플 레이 상에서 물체 접근에 따라 검출된 호버링 신호)는 프로세서에 전달될 수 있다. 예를 들어, 전자 장치는 지문 인증이 요청되면, 디스플레이 전체의 터치 민감도를 상대적으로 더 민감하게 조정하여 지정된 크기의 터치 호버링 상태(예: 디스플레이 표면으로부터 일정 거리 이내 손가락 접근을 감 지할 수 있는 상태)를 제공할 수 있다. 또는, 상기 전자 장치는 디스플레이 표면에 손가락 접촉(또는 터치)을 보다 민감하게 검출할 수 있는 상태를 제공할 수 있다. 또는, 전자 장치는 지문 인증이 요청되면, 압력 센서의 민감도를 조정할 수 있다. 전자 장치는 압력 센서를 보다 민감하게 조정하여, 지정된 크기의 압력을 가지는 터치가 발생하는지 보다 면밀하게 검출할 수 있다. 전자 장치는 디스플레이의 지문 인증 영 역에 물체 접근(예: 사용자 손가락 터치, 지정된 크기의 압력 터치 또는 호버링)에 따른 지정된 신호(예: 터치 신호, 압력 신호, 호버링 신호)가 발생하면 이를 기반으로 지문 인증 영역의 색상 및 휘도를 변경할 수 있다. 한 실시 예에 따르면, 전자 장치는 지문 인증 영역의 색상을 지정된 파장대의 색상(예: 파 장이 약 490nm ~ 570nm인 녹색 계열, 파장이 약 650nm ~ 780nm인 적색 계열, 또는 파장이 약 780nm ~ 1100nm인 NIR 중 적어도 하나의 색상)으로 변경할 수 있다. 또한, 전자장치는 지문 인증 영역의 휘도를 지정 된 휘도(예: 600nit 이상)로 변경할 수 있다. 전자 장치는 호버링 신호가 제거되면(또는 터치가 해제되거 나, 지정된 크기의 압력을 가지는 압력 터치가 해제되면) 해당 영역의 색상을 호버링 신호(또는 터치나 압력 터 치) 발생 이전 색상으로 복원할 수 있다. 전자 장치는 호버링 신호가 제거되면 해당 영역의 휘도를 호버링 신호 발생 이전 휘도로 복원할 수 있다. 전자 장치는 호버링 신호가 발생한 영역에서 터치 신호가 발생하 는 경우 현재 표시되고 있는 색상을 유지할 수 있다. 전자 장치는 터치 신호가 해제되거나 지문 인증이 완 료되면 터치 민감도를 원래의 상태(지문 인증 요청 이전 상태)로 복원할 수 있다. 또한, 전자 장치는 터치 신호가 해제되거나 지문 인증이 완료되면 변경된 색상을 지문 인증 요청 이전 색상으로 복원할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치의 프로세서는 지문 인증 영역의 터치 감도를 주변 영역보 다 상대적으로 더 민감하게 조정하거나 또는 이전 상태보다 더 민감하게 조정할 수 있다. 프로세서는 지문 인증 영역에서 지정된 호버링 신호가 검출되면, 지문 인증 영역이 지정된 휘도 및 지정된 색상 중 적어 도 하나를 표시하도록 처리할 수 있다. 지문 인증이 종료되면, 프로세서는 지문 인증 영역이 지문 인증 동작 이전 상태 또는 호버링 신호 발생 이전 상태가 되도록 처리할 수 있다. 다양한 실시 예에 따르면, 프로세 서는 지정된 이벤트 발생(예: 터치 이벤트 또는 손가락 접근 인식 이벤트 발생)에 대응하여 지문 인증 영역 의 휘도 및 색상 중 적어도 하나를 변경할 수 있다. 상술한 전자 장치의 후면을 고려하면, 상기 디스플레이 구동과 관련하여 상기 디스플레이에 연 장되어 전자 장치의 후면으로 꺽인 연장 영역과, 상기 연장 영역에 연결된 디스플레이 FPCB, 상기 디스플레이 FPCB를 인쇄회로기판에 연결시키기 위한 디스플레이 커넥터가 배치될 수 있다. 상 기 디스플레이 FPCB 상에는 상술한 지문 센서 및 압력 센서가 배치될 수 있다. 추가적으로 또는 대체적으로 상기 지문 센서 및 압력 센서를 구동하기 위한 구동 IC(예: 지문 센서IC 및 압력 센서 IC)가 상기 디스플레이 FPCB 상에 배치될 수 있다. 후면(Rear)은 디스플레이의 후면에 해 당하는 영역으로서, 상기 후면 영역은 예컨대, 앞서 설명한 후면 패널의 적어도 일부이거나 또는 상기 후 면 영역에 놓이는 브라켓의 적어도 일부가 될 수 있다. 도 12b는 본 발명의 실시 예에 따른 지문 인식 관련 전자 장치 운용 방법의 한 예를 나타낸 도면이다. 도 12b를 참조하면, 지문 인식과 관련한 전자 장치 운용 방법과 관련하여, 동작 1231에서, 설정에 따라 디스플 레이는 턴-오프(off) 상태를 유지할 수 있다. 동작 1233에서, 전자 장치는 지문 인식 영역의 터치 활 성화를 수행할 수 있다. 이 동작에서, 상기 전자 장치(예: 프로세서 또는 저전력 프로세서)는 AOT(Always on touch) 기능을 기반으로 지문 인식 영역의 터치 기능을 활성화할 수 있다. 동작 1235에서, 전자 장치는 터치가 감지되는지 확인할 수 있다. 터치 감지가 없는 경우, 전자 장치 는 동작 1231 상태로 복귀할 수 있다. 또는, 전자 장치는 동작 1233 상태로 복귀하여 AOT 상태를 유지할 수 있다. 터치가 감지되는 경우, 동작 1237에서, 전자 장치(예: 저전력 프로세서)는 AP(또는 프로세서), 지문 센서를 wake up할 수 있다. 이 동작에서, 터치 센서가 AP와 지문 센서에 인터럽트를 제공하고, 해당 인터 럽트에 대응하여 AP와 지문 센서가 활성화될 수 있다. 동작 1239에서, 프로세서는 디스플레이에 지정된 화면(예: Lock 화면)을 표시할 수 있다. 동작 1241 에서, 프로세서는 터치가 지정된 시간 동안 유지되는지 확인할 수 있다. 터치가 지정된 시간 동안 유지되 지 않는 경우, 프로세서는 동작 1231 또는 동작 1233 이전으로 분기할 수 있다. 이 동작에서, 프로세서 는 슬립 상태로 천이하고, 저전력 프로세서(또는 센서 허브)가 전자 장치의 AOD 기능을 유지할 수 있 다. 터치가 지정된 시간 동안 유지되는 경우, 동작 1243에서, 프로세서는 지문 인식 영역에 지정된 휘도 및 색 상을 표시할 수 있다. 예컨대, 프로세서는 600nit 이상의 녹색계열 광을 출력하도록 적어도 하나의 픽셀을 제어하거나 지문 센서에 포함된 발광부를 제어할 수 있다. 동작 1245에서, 프로세서는 지문 센서를 통해 지문 이미지를 캡쳐할 수 있다. 동작 1247에서, 프로세서는 등록된 지문과 캡쳐된 지문이 동일한지 확인할 수 있다. 등록된 지문과 캡쳐된 지문이 동일한 경우, 동작 1249에서, 프로세서는 지문 인식 영역 휘도와 색상을 원복하는 UI를 표시할 수 있다. 이 동작에서, 프로세서는 Lock 화면을 해제할 수 있다. 등록된 지문과 캡쳐된 지문이 동일하지 않은 경우, 동작 1251에서, 프로세서는 지문 인식 영역 휘도와 색상을 원복하되, Lock 화면을 유지할 수 있다. 도 12c는 본 발명의 실시 예에 따른 지문 인식 관련 전자 장치 운용 방법의 다른 한 예를 나타낸 도면이다. 도 12c를 참조하면, 지문 인식과 관련한 전자 장치 운용 방법과 관련하여, 동작 1261에서, 설정에 따라 디스플 레이는 턴-오프(off) 상태를 유지할 수 있다. 동작 1263에서, 전자 장치는 지문 인식 영역의 터치 활 성화를 수행할 수 있다. 이 동작에서, 상기 전자 장치(예: 저전력 프로세서)는 AOT(Always on touch) 기능 을 기반으로 지문 인식 영역의 터치 기능을 활성화할 수 있다. 동작 1265에서, 전자 장치는 터치 및 지정된 크기의 압력이 감지되는지 확인할 수 있다. 터치 및 지정된 크기의 압력 감지가 없는 경우, 전자 장치는 동작 1261 상태로 복귀할 수 있다. 또는, 전자 장치는 동작 1263 상태로 복귀하여 AOT 상태를 유지할 수 있다. 터치 및 지정된 크기의 압력이 감지되는 경우, 동작 1267에서, 전자 장치(예: 저전력 프로세서)는 AP(또는 프로세서), 지문 센서를 wake up할 수 있다. 이 동 작에서, 터치 센서가 AP와 지문 센서에 인터럽트를 제공하고, 해당 인터럽트에 대응하여 AP와 지문 센서가 활성 화될 수 있다. 동작 1269에서, 프로세서는 디스플레이에 지정된 화면(예: Lock 화면)을 표시할 수 있다. 동작 1271 에서, 프로세서는 터치 및 지정된 크기의 압력이 지정된 시간 동안 유지되는지 확인할 수 있다. 터치 및 지정된 크기의 압력이 지정된 시간 동안 유지되지 않는 경우, 프로세서는 동작 1261 또는 동작 1263 이전 으로 분기할 수 있다. 이 동작에서, 프로세서는 슬립 상태로 천이하고, 저전력 프로세서(또는 센서 허브) 가 전자 장치의 AOT 기능을 유지할 수 있다. 터치 및 지정된 크기의 압력이 지정된 시간 동안 유지되는 경우, 동작 1273에서, 프로세서는 지문 인식 영 역에 지정된 휘도 및 색상을 표시할 수 있다. 예컨대, 프로세서는 600nit 이상의 녹색계열 광을 출력하도 록 적어도 하나의 픽셀을 제어하거나 지문 센서에 포함된 발광부를 제어할 수 있다. 동작 1275에서, 프로세서 는 지문 센서를 통해 지문 이미지를 캡쳐할 수 있다. 동작 1277에서, 프로세서는 등록된 지문과 캡쳐된 지문이 동일한지 확인할 수 있다. 등록된 지문과 캡쳐된 지문이 동일한 경우, 동작 1279에서, 프로세서는 지문 인식 영역 휘도와 색상을 원복하는 UI를 표시할 수 있다. 이 동작에서, 프로세서는 Lock 화면을 해제할 수 있다. 등록된 지문과 캡쳐된 지문이 동일하지 않은 경우, 동작 1281에서, 프로세서는 지문 인식 영역 휘도와 색상을 원복하되, Lock 화면을 유지할 수 있다.도 13은 본 발명의 실시 예에 따른 전자 장치 운용 환경의 한 예를 나타낸 도면이다. 도 13을 참조하여, 다양한 실시 예에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 통신 인터페이스, 햅 틱부 및 지문 센서를 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는, 구성요소들 중 적어 도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 한 실시 예에 따르면, 상기 디스플레이 는 DDI(display driver Integrated-chip) 및 터치 패널과 터치 IC, 압력 센서와 센서 IC 중 적어도 하나를 포함할 수 있다. 버스는 구성요소들(120-180)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 또는 데이터)을 전 달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치, 어플리케이션 프로세서, 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어 도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 본 발명의 실 시 예에 따른 프로세서는 지문 인증 영역 운용 및 지문 인증과 관련한 처리를 수행할 수 있다. 예컨대, 프 로세서는 지문 인증 요청이 발생하면(예: 지문 인증과 관련한 어플리케이션의 실행), 지정된 지문 인증 가 이드 UI를 디스플레이에 출력할 수 있다. 상기 지문 인증 가이드 UI는 사용자가 디스플레이 상에서 손가락을 접촉해야 할 영역을 지시하는 시각 정보(예: 텍스트 또는 이미지)를 포함할 수 있다. 상기 프로세서 는 지문 인증 가이드 UI를 출력한 후, 지정된 이벤트(예: 터치 이벤트, 압력 터치 이벤트, 호버링 이벤트 또는 손가락 접근 인식 이벤트)가 발생하는지 확인할 수 있다. 프로세서는 지정된 이벤트가 발생하면, 지 문 인증 영역의 표시 상태가 지정된 휘도 또는 색상 중 적어도 하나의 상태로 표시되도록 변경할 수 있다. 지문 인증이 성공하면, 프로세서는 지문 인증 성공에 따른 기능 처리를 할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 지문 인증 가이드 UI 및 지문 인증 영역의 표시 상태 변경을 DDI에 요청할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 지문 인증과 관련한 어플리케이션이 실행되면, 미리 정의한 영 역(예: 디스플레이의 지정된 영역으로서, 예컨대, 카드 이미지가 표시된 영역)을 출력할 수 있다. 터치 센 서는 상기 미리 정의한 영역 내에서 지정된 물체(예: 손가락)가 접촉되면, 해당 좌표 정보를 프로세서에 전달할 수 있다. 프로세서는 해당 좌표 정보에 대응하는 디스플레이 영역에 지정된 UI(예: 지문 인증 가이드 UI 또는 지정된 휘도 또는 색상을 가지는 일정 영역)를 출력할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 0)의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시 예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨 어, 어플리케이션 프로그래밍 인터페이스(API), 및/또는 어플리케이션 프로그램(또는 \"어플리케이 션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일부는, 운영 시스템으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서 , 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또 는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이 션 프로그램 중 적어도 하나에 전자 장치의 시스템 리소스(예: 버스, 프로세서, 또는 메모 리 등)를 사용할 수 있는 우선 순위를 부여하고, 상기 하나 이상의 작업 요청들을 처리할 수 있다. API는 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스 로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함 수(예: 명령어)를 포함할 수 있다. 상기 어플리케이션은 지문 인증이 필요한 어플리케이션(예: 삼성 페이, 언락 기능 등)을 포함할 수 있다. 상기 메모리는 지문 테이블을 저장할 수 있다. 상기 지문 테이블은 지문 인증 영역을 지정된 휘도 또는 지 정된 색상 중 적어도 하나로 표시하도록 설정된 값들을 포함할 수 있다. 한 실시 예에 따르면, 지문 테이블은 제1 휘도 및 제1 색상을 지시하는 제1 설정 값, 제2 휘도 및 제2 색상을 지시하는 제2 설정 값, 제3 휘도 및 제3 색상을 지시하는 제3 설정 값을 등을 포함할 수 있다. 한 실시예에 따르면, 디스플레이 영역의 밝기를 전체적 으로 일괄 제어할 경우, 제 1 휘도는 600nit, 제 2 휘도는 500nit, 및 제 3 휘도는 400nit 에 해당할 수 있다. 한 실시예에 따르면, 디스플레이 영역 중 지문 센서에 대응하는 영역에 대해서 국부적으로 밝기를 제어(디스플 레이의 일부 영역의 밝기만을 제어)하는 경우, 제 1 휘도는 1,000nit, 제 2 휘도는 900nit, 및 제 3 휘도는 800nit 에 해당할 수 있다. 한 실시예에 따르면, 제 1 색상은 적색 계열의 색상, 제 2 색상은 녹색 계열의 색상, 제3 색상은 보라색 색상일 수 있다. 다양한 실시 예에 따르면, 상기 제3 휘도는 0 nit(예: 해당 디스플레 이 영역을 턴-오프) 설정 값을 가질 수 있다. 각각의 설정 값들은 지문 인증의 성공 또는 실패 등에 따라 적용 될 수 있다. 또는, 지문 테이블은 지문 인증 실패뿐만 아니라, 지문 센서가 제공한 이미지의 품질이 지정 된 수준 이하인 경우에도, 지문 인증 영역의 표시 상태를 변경과 관련하여 이용될 수 있다. 상기 프로세서는 디폴트로 설정된 설정 값을 기반으로, 지문 인증 영역의 표시 상태를 제어하고, 지문 인 증의 실패 또는 일정 수준 이상의 이미지 품질 획득 여부에 따라 상기 지문 테이블을 기반으로 상기 설정 값을 조정할 수 있다. 이러한 지문 테이블은 프로세서에서 운용되는 프로세서 지문 테이블 또는 DDI에서 운용되 는 DDI 지문 테이블을 포함할 수 있다. 상기 프로세서 지문 테이블은 프로세서에 의해 지문 인증 영역의 표시 상태를 제어하도록 설정된 경우 이용될 수 있다. 상기 DDI 지문 테이블은 상기 DDI에 포함된 메모리 영역(예: DRAM 또는 DDI 용 메모리)에 저장되고, DDI 제어에 대응하여 지문 인증 영역이 지정된 표시 상태를 가지도록 하는데 이용될 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 지문 테이블에 포함된 설정 값들 중 지문 인증 영역에 디폴트로 적용할 설정 값을 사용자가 선택할 수 있는 사용자 인터페이스 를 제공할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달하거나, 또는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 이러한, 입출력 인터페이스는 오디오 처리 모듈 을 포함할 수 있다. 오디오 처리 모듈은 지문 인증 기능 운용과 관련한 적어도 하나의 오디오 정보를 출력할 수 있다. 예컨대, 오디오 처리 모듈은 지문 인증 동작 수행 중에 지문 인증 영역에 손가락을 대도록 유도하는 오디 오 정보의 출력을 수행할 수 있다. 또한, 지문 인증 동작 수행 중에 손가락 터치를 유지하도록 유도하는 오디오 정보, 손가락 터치를 해제하도록 유도하는 오디오 정보, 지문 인증 성공 또는 실패를 안내하는 오디오 정보 등 을 출력할 수 있다. 다양한 실시 예에 따르면, 상기 오디오 처리 모듈은 사용자 음성 입력에 대응하여 지문 인 증 기능을 실행하도록 지원할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오드 (OLED) 디스플레이, 또는 마이크로 전자기계 시스템 (MEMS) 디스플레이, 또는 전자종이(electronic paper) 디스 플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 및/또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예 를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있 다. 상기 디스플레이는 앞서 설명한 바와 같이, 지정된 화면 인터페이스가 출력되는 디스플레이 영역과, 지문 센서가 배치된 지문 인증 영역을 포함할 수 있다. 앞서 도 10에서 설명한 바와 같이 지문 센서가 시 트 형태로 제공되는 경우, 디스플레이 영역 전체가 지문 인증 영역이 될 수도 있다. 디스플레이는 지문 인 증 영역을 안내하는 가이드 정보(또는 시각 정보)를 출력할 수 있다. 디스플레이는 프로세서 제어에 대응하여 지문 인증 영역이 지정된 휘도 또는 지정된 색상 중 적어도 하나를 가지는 표시 상태로 변환할 수 있 다. 디스플레이는 프로세서 제어에 대응하여 지정된 휘도 또는 지정된 색상 중 적어도 하나에 해당하 는 표시 상태를 가지는 지문 인증 영역을 이전 상태(예: 상기 지정된 휘도 또는 지정된 색상을 가지기 이전 상 태)로 변환할 수 있다. 상기 디스플레이는 DDI를 포함할 수 있다. 상기 DDI는 디스플레이 구동과 관련한 프레임 메모리에 저장된 데이터를 수집하고, 수집된 데이터를 디스플레이에 출력할 수 있다. 본 발명의 실시 예에 따른 DDI는 디스플레이에 포함된 메모리(예: DRAM 또는 DDI 메모리)에 지문 인증 영역을 가이드하는 가이드 UI 및 DDI 지문 테이블을 저장할 수 있다. 상기 DDI는 이벤트 발생에 대응하여 DDI 메모리에 저장 된 가이드 UI를 지문 인증 영역에 출력할 수 있다. 상기 DDI는 이벤트(예: 가이드 UI가 출력된 영역에서 발생하는 호버링 이벤트 또는 터치 이벤트 또는 손가락 접근 인식 이벤트 중 적어도 하나) 발생에 대응하여 DDI 메모리에 저장된 DDI 지문 테이블을 참조하여, 지문 인증 영역의 표시 상태를 제1 휘도 및 제1 색을 가지도록 변경할 수 있다. 상기 DDI는 추가로 발생하는 이벤트(예: 지문 인증 실패 이벤트 또는 획득된 이미지 정보의 품질이 지정된 크기 이하인 경우)에 대응하여 지문 인증 영역의 표시 상태를 제2 휘도 및 제2 색을 가지도록 변경할 수 있다. 상기 호버링 이벤트 또는 터치 이벤트는 디스플레이에 포함된 터치 센서에 의해 획득될 수 있다. 상기 손가락 접근 인식 이벤트는 상기 지문 센서에 의해 획득될 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 외부 전자 장치 또는 서버) 간 의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네트워크 에 연결되어 외부 장치(예: 외부 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신은, 예를 들면, LTE, LTE-A(LTE Advance), 5G, CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또 는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있 다. 한 실시 예에 따르면, 무선 통신은, 예를 들면, WiFi(wireless fidelity), LiFi(light fidelity), 블루투 스, 블루투스 저전력(BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션 (Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 무선 통신은 GNSS를 포함할 수 있다. GNSS는, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System (이하 “Beidou”) 또는 Galileo, the European global satellite-based navigation system일 수 있다. 이하, 본 문서에서는, “GPS”는 “GNSS”와 상호 호환적으로 사용될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔 레폰 네트워크 중 적어도 하나를 포함할 수 있다. 또는 전자 장치는 근거리 통신을 기반으로 다른 전자 장 치와 통신할 수 있다. 상기 햅틱부는 상기 프로세서 제어에 대응하여 전자 장치의 햅틱 피드백을 출력할 수 있다. 한 실시 예에 따르면, 상기 햅틱부는 디스플레이에 배치된 지문 센서에 인접된 영역에 배치될 수 있다. 상기 햅틱부는 상기 지문 센서에 지문 인증을 수행하는 동안 지정된 패턴의 햅틱 피드백(또는 진동 패턴)을 출력할 수 있다. 또는, 상기 햅틱부는 지문 인증 성공 또는 지문 인증 실패를 구분할 수 있 는 서로 다른 햅틱 피드백을 출력할 수 있다. 상기 프로세서는 앞서 언급한 바와 같이, 저전력 프로세서와 일반 프로세서를 포함하고, 저전력 프로세서 는 상기 디스플레이가 턴-오프 상태에서 터치 기능을 수행할 수 있도록 하는 AOT 상태를 지원할 수 있다. 또한, 상기 저전력 프로세서는 AOT 상태에서 지문 인식 영역에 터치 입력이 발생하는 경우 상기 햅틱부를 제어하여, 지문 센서 활성화와 관련한 지정된 패턴의 햅틱 피드백을 출력할 수 있다. 외부 전자 장치는 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 다양한 실시 예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치 , 또는 서버)에서 실행될 수 있다. 한 실시 예에 따르면, 전자 장치가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키 는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치 또는 서버)에 게 요청할 수 있다. 다른 전자 장치(예: 전자 장치 또는 서버)는 요청된 기능 또는 추가 기능을 실행 하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 14는 본 발명의 실시 예에 따른 프로세서의 한 예를 나타낸 도면이다. 도 14를 참조하면, 본 발명의 프로세서는 센서 제어부, 표시 제어부, 지문 정보 처리부를 포함할 수 있다. 상기 센서 제어부는 지문 인증 기능 수행과 관련한 센서 제어를 수행할 수 있다. 한 실시 예에 따르면, 센 서 제어부는 지문 인증 요청이 발생하면, 터치 센서의 민감도를 조정할 수 있다. 예컨대, 센서 제어부 는 지문 인증 영역에 대한 터치 민감도를 조정하여, 물체 접근에 따른 호버링 이벤트가 발생하는지 확인할 수 있다. 또는, 센서 제어부는 지문 인증 영역에서의 터치 이벤트 발생 여부를 확인할 수 있다. 또는, 센 서 제어부는 지문 인증 요청이 발생하면, 지문 센서를 활성화하고, 지문 센서가 획득하는 이미지 정보를 기반으로 손가락 등의 물체가 접근하는지 판단할 수 있다. 센서 제어부는 호버링 이벤트, 터치 이벤트 또는 손가락 접근 이벤트 중 적어도 하나가 발생하면, 해당 이벤트를 표시 제어부에 전달할 수 있 다. 상기 센서 제어부는 표시 제어부에 의해 지문 인증 영역의 상태가 변경되면, 민감도가 조정된 터 치 센서 영역을 원래 상태로 복원할 수 있다. 또는, 상기 센서 제어부는 지문 인증이 완료되면, 상기 민감 도가 조정된 터치 센서 영역을 원래 상태로 복원할 수 있다. 상기 표시 제어부는 지문 인증 요청이 발생하면, 지문 인증 영역에 대응하는 가이드 UI를 출력할 수 있다. 이와 관련하여, 표시 제어부는 메모리에 저장된 지문 인증 가이드 UI를 지문 인증 영역에 출력하거나 또는 DDI에 가이드 UI 출력을 요청할 수 있다. 상기 표시 제어부는 센서 제어부로부터 이벤트 (예: 호버링 이벤트, 터치 이벤트 또는 손가락 접근 인식 이벤트)가 전달되면, 지문 인증 영역을 지정된 표시 상태로 표시할 수 있다. 예컨대, 표시 제어부는 지문 인증 영역을 제1 휘도(예: 600nit) 및 제1 색상(예: 녹색 계열)으로 표시할 수 있다. 이와 관련하여, 표시 제어부는 메모리에 저장된 지문 테이블을 참조 할 수 있다. 또는, 표시 제어부는 지문 인증 영역이 제1 휘도(예: 600nit) 및 제1 색상(예: 녹색)으로 표 시되도록 설정된 설정 값을 표시하도록 DDI에 요청할 수 있다. DDI는 표시 제어부 요청에 대응 하여 DDI 지문 테이블을 참조하여 지문 인증 영역의 지정된 표시 상태로 표시되도록 설정된 데이터, 예를 들면, 디스플레이로 출력할 수 있다. 상기 표시 제어부는 지문 인증 실패 또는 획득된 이미지 정보의 품질이 지정된 수준 이하인 경우, 지문 인 증 영역의 표시 상태를 변경할 수 있다. 예컨대, 표시 제어부는 지문 인증 영역을 제2 휘도(예: 1000nit) 및 제2 색상(예: 녹색 계열)으로 표시할 수 있다. 또는 표시 제어부는 지문 인증 영역의 휘도만을 변경할 수 있다. 이와 관련하여, 표시 제어부는 메모리에 저장된 지문 테이블을 참조할 수 있다. 또는, 상기 표시 제어부는 지문 인증 영역의 표시 상태를 변경하도록 DDI에 요청할 수 있다. 상기 표시 제어부 는 지문 인증 실패 또는 저품질의 이미지 정보 획득 시, 지문 인증 실패 또는 정상 이미지 정보 획득 실패 를 안내하는 메시지를 출력할 수 있다. 상기 표시 제어부는 추가 지문 정보 획득과 관련하여 지정된 안내 메시지(예: 지문 정보 획득 재수행과 관련한 손가락 접촉 상태를 유지하도록 안내하는 메시지 또는 손가락의 접 촉 위치 조정을 안내하는 메시지 등)를 출력할 수 있다. 상기 표시 제어부는 지문 인증이 성공하면, 지문 인증 영역의 표시 상태를 지문 인증 이전 상태로 복원할 수 있다. 예컨대, 표시 제어부는 지문 인증 가이드 UI 또는 지정된 휘도와 색상을 가지는 표시 상태를 제 거하고, 지문 인증과 관련한 어플리케이션 실행에 따른 화면을 디스플레이에 출력할 수 있다. 상기 지문 정보 처리부는 사용자 입력 또는 스케줄링된 이벤트의 도래에 대응하여 지문 인증 어플리케이션 을 실행할 수 있다. 지문 정보 처리부는 지문 인증 어플리케이션 실행에 대응하여, 지문 센서 활성화 또는 터치 센서의 민감도 조정 등을 센서 제어부에 요청할 수 있다. 지문 정보 처리부는 지문 센서 로부터 이미지 정보가 획득되면, 획득된 지문 정보와 저장된 지문 정보를 비교하여 지문 인증을 처리할 수 있다. 이 동작에서, 지문 정보 처리부는 지문 정보 비교를 별도의 신뢰할 수 있는 운영체제 환경(예: TEE, Trusted Execution Environment)에 요청할 수 있다. 지문 정보 처리부는 지문 인증이 실패하거나 또는 지 문 인증 영역에서 획득된 이미지 정보의 품질이 지정된 크기 이하이면, 지문 인증 영역의 표시 상태 변경을 표 시 제어부에 요청할 수 있다. 지문 정보 처리부는 지문 인증 영역의 표시 상태가 변경된 후, 지문 센 서가 획득한 이미지 정보를 기반으로 지문 인증을 재수행할 수 있다. 상기 지문 정보 처리부는 지정 된 횟수 동안 지문 정보 비교를 수행하고, 해당 횟수가 경과하면 지문 인증 실패로 처리할 수 있다. 지정된 횟 수 동안 지문 인증 영역의 휘도 및 색상 중 적어도 하나의 변경이 수행될 수 있다. 지문 인증이 성공하면, 지문 정보 처리부는 지문 인증 성공에 따른 기능 실행을 처리할 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 적어도 하나의 픽셀을 포함하고 적어도 일부 영역이 투명한 디스플레이, 화면이 표시되는 상기 디스플레이의 하부 일정 영역에 배치되고, 상기 디스플레이 배치된 픽셀에서 조사되고 상기 디스플레이 상에 접근된 물체에 의해 방향이 변경된 광을 수집하여 지문 인증과 관련한 이미지 정보를 획득하는 지문 센서, 상기 지문 센서의 이미지 정보 획득 동작을 제어하는 프로세서를 포 함할 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 적어도 일부에 지문 인식 영역이 형성된 디스 플레이, 화면이 표시되는 상기 디스플레이의 아래에 배치된 지문 센서, 상기 지문 센서는 상기 디스플레이의 적 어도 하나의 픽셀에서 조사되고 상기 지문 인식 영역에 접근된 물체에 의해 반사된 광에 적어도 일부 기반하여 상기 물체에 대응하는 지문 인증과 관련한 이미지 정보를 획득하기 위한 지문 센서 및 상기 이미지 정보의 상기획득 동작과 연관하여 상기 지문 센서의 적어도 하나의 기능을 제어하기 위한 프로세서를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 디스플레이의 아래에 형성된 후면 패널;을 더 포함하고, 상기 후면 패널에는 상 기 지문 센서 및 상기 지문 인식 영역과 정열된 개구부(opening)가 형성될 수 있다. 다양한 실시 예에 따르면, 상기 후면 패널은 상기 디스플레이에 인접하여 형성된 보호층을 포함하고, 상기 보호 층에 상기 개구부의 적어도 일부가 형성될 수 있다. 다양한 실시 예에 따르면, 상기 후면 패널은 상기 보호층에 포함되거나, 또는 상기 보호층의 아래에 형성된 디 지타이저를 더 포함하고, 상기 디지타이저에 상기 개구부의 다른(another) 일부가 형성될 수 있다. 다양한 실시 예에 따르면, 상기 후면 패널은, 상기 디지타이저의 아래에 형성된 방열층을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 후면 패널의 아래에 배치되어 상기 디스플레이를 지지하는 브 라켓을 더 포함하고, 상기 브라켓에는 상기 지문 센서의 적어도 일부가 안착되는 센서 안착 영역이 형성될 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 개구부에 정렬되고, 상기 반사된 광 중 지정된 파장대의 광만 을 통과시키기 위한 파장 선택부를 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 디스플레이와 상기 지문 센서 사이에 배치되고, 상기 반사된 광 중 지정된 파장대의 광만을 통과시키기 위한 파장 선택부를 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 지문 인식 영역은 상기 디스플레이의 대체적으로(substantially) 전체 영역을 형성하고, 및 상기 지문 센서는 상기 지문 인식 영역에 대응하여 형성될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는, 상기 지문 인증에 대한 요청에 반응하여 상기 지문 인식 영역을 지 정된 파장대의 색상으로 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는, 상기 지문 인증에 대한 요청에 반응하여 상기 지문 인식 영역을 지 정된 휘도로 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는, 상기 이미지 정보의 획득 동작과 관련하여, 상기 지문 인식 영역을 제 1 디스플레이 속성에 기반하여 제어하고, 및 상기 획득된 이미지 정보가 지정된 조건을 만족하는 경우, 상기 지문 인식 영역을 제 2 디스플레이 속성에 기반하여 제어하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는, 상기 제 2 디스플레이 속성의 적어도 일부로서 휘도 또는 색상을 조정하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지문 인증에 대한 요청에 반응하여, 상기 지문 인식 영역에 대 한 상기 물체의 상기 접근을 가이드하기 위한 user interface를 상기 디스플레이를 통하여 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지문 인식 영역을 제 1 터치 감도를 이용하여 제어하고, 및 상 기 디스플레이의 상기 지문 인식 영역의 주변 영역을 제 2 터치 감도를 이용하여 제어하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 제 1 터치 감도에 적어도 일부 기반하여 상기 지문 인식 영역 에 대한 상기 물체의 상기 접근에 대응하는 호버링이 감지되면, 상기 지문 인식 영역을 지정된 휘도 또는 지정 된 파장대의 색상으로 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 지문 센서는 상기 지문 인식 영역에 대응하는 상기 디스플레이의 하면에 접하도 록 형성될 수 있다. 다양한 실시 예에 따르면, 상기 개구부의 적어도 일부에는 광학 접착층이 형성될 수 있다. 다양한 실시 예에 따 르면, 상기 지문 센서는 상기 디스플레이 중 화면이 표시되는 액티브 영역 전체에서 지문 인식되도록 시트 형태 로 배치될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 지문 인증 요청 시 상기 디스플레이의 적어도 일부 650~780nm, 490~570nm 또는 780~1100nm 등 여러 파장대들 중 선택된 지정된 파장대의 색상으로 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지문 센서가 배치된 영역에 대응하는 상기 디스플레이의 지문 인증 영역을 650~780nm, 490~570nm 또는 780~1100nm 등 여러 파장대들 중 선택된 지정된 파장대의 색으로 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 지문 인증 실패 또는 지정된 크기 이상의 품질을 가지는 이미지 정 보 획득 실패 시, 접촉된 물체가 배치된 디스플레이 영역의 표시 상태를 이전과 다르게 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 접촉된 물체가 배치된 디스플레이 영역의 휘도를 지정된 크기만큼 (예: 300 ~ 1000nit, 예컨대, 600nit 또는 1000nit) 높이도록 처리할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지문 인증 요청 시 상기 지문 센서가 배치된 영역에 대응하는 상기 디스플레이의 지문 인증 영역에 사용자 손가락 배치를 유도하는 가이드 UI(User Interface)를 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 지문 인식 시작 또는 완료 시 햅틱 피드백을 출력할 수 있다. 한 실시 예에 따르면, 상기 프로세서는 지문 인식 수행 결과, 지문 인식 성공에 따른 햅틱 피드백과 지문 인식 실패에 따른 햅틱 피드백을 서로 다른 패턴으로 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지문 인증 영역에서 터치 신호가 감지되면, 상기 지문 인증 영 역을 지정된 휘도(예: 600nit 이상)의 지정된 파장대 (예: 490nm~570nm, 650nm~780nm, 780nm~1100nm, 또는 500nm~800nm)의 색으로 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지문 인증 영역에서 압력 터치 신호가 감지되면, 상기 지문 인 증 영역을 지정된 휘도(예: 600nit 이상)의 지정된 파장대 (예: 490nm~570nm, 650nm~780nm, 780nm~1100nm, 또 는 500nm~800nm)의 색으로 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지문 인증 영역의 터치 감도를 주변과 다르게 처리하여 호버링 신호를 감지 할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지문 인증 영역에서 지정된 호버링 신호가 수신되면, 상기 지 문 인증 영역을 지정된 휘도(예: 600nit 이상)의 지정된 파장대 (예: 490nm~570nm, 650nm~780nm, 780nm~1100nm, 또는 500nm~800nm)의 색으로 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 지문 인증 요청 시, 상기 지문 센서가 획득하는 이미지 정보를 기반 으로 손가락 접근을 인식하고, 손가락 접근 인식 시, 상기 손가락이 인식되는 영역을 지정된 휘도(예: 600nit 이상)의 지정된 파장대 (예: 490nm~570nm, 650nm~780nm, 780nm~1100nm, 또는 500nm~800nm)의 색으로 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지문 센서가 배치된 영역에 대응하는 상기 디스플레이의 지문 인증 영역에 사용자 손가락 배치를 유도하는 가이드 UI(User Interface)를 출력할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 지문 센서와 상기 디스플레이의 사이에 배치되는 제 1 접착층 (도 6c의 302_4), 상기 지문 센서와 상기 디지타이저 사이에 배치되는 제 2 접착층(도 6b의 302_1), 상기 지문 센서와 상기 보호층 사이에 배치되는 제 3 접착층(도 6b의 302_2) 중 적어도 하나의 접착층 중 적어도 하나를 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 디스플레이 하부면과 상기 지문 센서 사이에 형성된 에어 갭, 상기 디스플레이 하부면과 상기 지문 센서 사이에 배치된 광학 접착층 중 적어도 하나를 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치는 상기 디스플레이 일측으로부터 연장되고 상기 디스플레이의 표시 영역의 배면에 휘어져 배치되며 일측에 디스플레이 구동 모듈이 실장되는 표시 패널 연장부, 상기 디스플레이 일측 끝단과 전기적으로 연결되고 상기 디스플레이의 표시 영역의 배면에 휘어져 배치되며 일측에 디스플레이 구동 모듈이 실장되는 표시 패널 연결부 중 어느 하나를 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 디지타이저는 상기 디스플레이와 상기 후면 패널 사이에 배치될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는, 상기 이미지 정보의 상기 획득 동작과 관련하여, 상기 지문 인식 영역을 제 1 디스플레이 속성(예: 지정된 크기의 디스플레이의 휘도, 색상, 지정된 패턴 형태 등)에 기반하여 제어하고(예: 지정된 크기의 휘도, 색상으로 광을 조사하거나 또는 지정된 패턴으로 표시), 및 상기 획득된 이 미지 정보가 지정된 조건을 만족하는 경우(예: 지정된 크기 이하의 해상도를 가지거나 또는 낮은 콘트라스트를 가지는 경우 또는 지문 인식에 필요한 정도의 품질을 가지는 이미지를 획득하지 못하는 경우), 상기 지문 인식 영역을 제 2 디스플레이 속성에 기반하여 제어하도록 설정될 수 있다.상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 지문 센서, 지문 인식 영역을 포함하는 디스 플레이 및 프로세서를 포함하고, 상기 프로세서는, 지문 인증에 대한 요청을 수신하고, 상기 요청에 반응하여, 상기 지문 인식 영역에 대한 물체의 접근을 가이드하기 위한 user interface를 상기 디스플레이를 통하여 출력 하고, 상기 물체의 상기 접근과 관련된 지정된 이벤트의 발생에 적어도 일부 기반하여, 상기 지문 인식 영역에 대한 적어도 하나의 디스플레이 속성을 조정하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는, 상기 요청에 반응하여, 상기 지문 인식 영역에 대응하는 적어도 하 나의 픽셀을 이용하여 상기 물체에 대한 이미지 정보의 획득에 사용되기 위한 광을 조사하도록 설정될 수 있다. 도 15a는 본 발명의 실시 예에 따른 지문 인증 영역의 표시 상태 값 변경에 따른 지문 운용 방법의 한 예를 나 타낸 도면이다. 도 15a를 참조하면, 지문 운용 방법과 관련하여, 동작 1501에서, 이벤트가 발생하면, 전자 장치의 프로세 서(예: 센서 제어부)는 지문 인증 요청과 관련한 이벤트 인지 확인할 수 있다. 지문 인증 요청과 관 련한 이벤트가 아닌 경우, 동작 1503에서, 프로세서는 발생한 이벤트와 관련한 기능 수행을 처리할 수 있 다. 예컨대, 프로세서는 이벤트 종류에 대응하여 홈 화면을 출력하거나 웹 페이지 등을 출력할 수 있다. 또는 프로세서는 이벤트에 따른 통신 기능을 수행할 수 도 있다. 다양한 실시 예에 따르면, 지문 인증 요청과 관련한 이벤트가 발생하면, 프로세서(예: 센서 제어부) 는 지문 센서를 활성화할 수 있다. 동작 1505에서, 프로세서(예: 표시 제어부)는 지문 인증 영 역을 가이드하는 정보를 출력할 수 있다. 예컨대, 프로세서는 디스플레이의 일정 영역에 사용자가 손 가락을 위치시킬 영역을 지시하는 박스나 폐곡면을 출력할 수 있다. 상기 박스 또는 폐곡면 내부에는 손가락 접 촉을 유도하는 텍스트 또는 이미지 중 적어도 하나가 표시될 수 있다. 동작 1507에서, 프로세서(예: 센서 제어부)는 지정된 영역(예: 상기 지문 인식 영역)에서 터치가 발 생하는지 확인할 수 있다. 터치가 발생하지 않는 경우, 프로세서는 1501 단계로 분기하여 지문 인증 요청 이 유효(예: 지문 인증 요청 이후 지정된 시간 이내)한지 확인하고, 이후 단계를 처리할 수 있다. 경우에 따라, 지문 인증 요청의 유효성 검사 동작은 생략될 수 있다. 지문 인식 영역에서 터치가 발생하면, 동작 1509에서, 프로세서(예: 표시 제어부)는 지문 인증 영역 이 지정된 휘도, 색, 상(또는, 형태)을 가지도록 지문 인증 영역의 표시 상태를 변경할 수 있다. 예컨대, 프로 세서는 지문 인증 영역이 지정된 휘도와 지정된 적어도 하나의 색을 가지도록 처리할 수 있다. 지문 센서 는 지문 인증 영역에 해당하는 픽셀의 광 중 터치되는 물체에 반사되어 수광된 광을 기반으로 이미지 정보 를 수집하고, 수집된 이미지 정보를 프로세서(예: 지문 정보 처리부)가 이용할 수 있도록 메모리에 저장할 수 있다. 지문 정보 처리부는 수신된 이미지 정보를 기반으로 지문 인증을 수행할 수 있다. 예컨대, 지문 정보 처리부는 사전에 저장된 지문 정보와 획득된 지문 정보를 비교하고, 일정 비율 이상 일 치하는지 확인할 수 있다. 상기 지정된 비율은 예컨대, FRR/FAR이 10% 이하(예: 3% 이하)의 비율을 포함할 수 있다. 또는, 지정된 비율은 1/50000(FAR이 5만번에 1번) 정도일때 FRR이 3%이하인 비율을 포함할 수 있다. 상기 FAR(False Acceptance Ratio)와 FRR(False Rejection Ratio)는 타인 수락률과 본인 거부율로 생체인식 보안솔루션의 보안성 및 사용성 을 측정하기 위한 기준을 포함할 수 있다. 이 동작에서, 지문 정보 처리부는 획득된 지문 정보의 특징점 추출 및 사전 저장된 지문 정보 특징점 비교 를 수행할 수도 있다. 상기 지문 정보 비교는 예컨대, 신뢰할 수 있는 운영 체제 환경(예: TEE(Trusted Execution Environment), TZ(Trust Zone), Secure world) 하에서 수행될 수 있다. 동작 1511에서, 프로세서는 지문 인증 기능 종료와 관련한 이벤트가 발생하는지 확인할 수 있다. 지문 인 증 기능 종료와 관련한 이벤트가 발생하면, 프로세서는 지문 인증 기능 실행 이전 상태로 돌아가거나, 지 정된 상태(예: 대기 화면 표시 상태 등)로 돌아가도록 처리할 수 있다. 이 동작에서, 프로세서(예: 센서 제어부)는 활성화된 지문 센서를 비활성화할 수 있다. 또한, 프로세서(예: 표시 제어부)는 지정된 표시 상태를 가지는 지문 인증 영역을 이전 상태로 복원할 수 있다. 동작 1511에서, 지문 인증 기능 종 료와 관련한 이벤트가 발생하지 않으면, 예컨대, 지문 인증 실패가 발생하면, 프로세서)는 동작 1501 이전 으로 분기하여 이하 동작을 재수행할 수 있다. 이때, 전자 장치의 상태는 지문 인증 요청이 유효하고, 지 문 인증 영역이 지정된 휘도와 지정된 색으로 표시되고 있는 1509 상태일 수 있다. 이 경우, 지문 센서가 일정 기간 수집된 광을 기반으로 생성한 이미지 정보를 기반으로, 프로세서(예: 지문 정보 처리부)는지문 인증을 재수행할 수 있다. 다양한 실시 예에 따르면, 동작 1509에서, 프로세서(예: 표시 제어부)는 지문 인증 영역의 표시 상태 를 다시 변경할 수 있다. 한 실시 예에 따르면, 프로세서는 지문 인증 영역의 휘도, 색, 상 중 적어도 하 나를 이전 상태와 다르게 할 수 있다. 예컨대, 프로세서는 지문 인증 영역의 휘도를 이전보다 높게 처리할 수 있다. 프로세서는 상대적으로 높아진 휘도에 따라 수집된 광을 기반으로 생성된 이미지 정보를 기반으 로 지문 인증을 재수행할 수 있다. 또는, 프로세서는 디스플레이가 표현할 수 있는 최대 밝기(예: 각 디스 플레이의 물리적 특성에 따라 다름)로 지문 인증 영역의 휘도를 조정하고, 이를 기반으로, 지문 인증을 수행할 수 있다 도 15b는 본 발명의 실시 예에 따른 지문 인증 영역의 표시 상태 값 변경과 관련한 화면 인터페이스의 한 예를 나타낸 도면이다. 도 15b를 참조하면, 전자 장치는 디스플레이 상에 지문 인증과 관련한 어플리케이션 실행 화면을 출 력할 수 있다. 전자 장치는 지정된 영역(예: 지문 인증 영역 또는 지문 인증과 관련한 물체가 접근하는 영 역)을 지정된 색상으로 변경할 수 있다. 예컨대, 지문 인증과 관련하여 카드 이미지가 출력되고 있는 영역 상에, 터치 이벤트(또는 호버링 이벤트)가 발생하면, 전자 장치는 제1 객체, 제2 객체 또는 제3 객체 중 어느 하나를 출력할 수 있다. 상기 제1 객체는 예컨대, 중심원과 외부원을 포함할 수 있다. 중심원은 발광부 역할을 수행할 수 있다. 외부원은 지문의 융(ridge)에서 반사되어 지문 센서로 수광되는 빛의 경로 역할을 수행할 수 있다. 또는 중심원 이 지문의 융에서 반사되는 광의 경로 역할을 수행하고, 외부원이 광이 지문 방향으로 조사되는 발광부 역할을 수행할 수 있다. 이에 따라, 상기 중심원(예: 780~1100 nm 파장대의 색상)과 외부원(예: 650~780nm 또는 490~570nm 파장대의 색상)의 색상을 상이한 파장대의 색상을 가질 수 있다. 상기 제2 객체는 사용자의 터치 영역 또는 호버링 영역에 대응하는 일정 크기의 지정된 색상을 가지는 객 체를 포함할 수 있다. 상기 제2 객체는 사용자의 터치 영역 또는 호버링 영역의 크기에 따라 변경될 수 있다. 상기 제2 객체는 지문 인증에 유리한 파장대(예: 780~1100nm 파장대)의 색을 가질 수 있다. 도시된 도면에서는 제2 객체의 형태가 원 형태로 도시하였으나, 터치 영역의 형태 등에 대응하여 타원형 또는 다 각형의 형태 등일 수 있다. 상기 제3 객체는 사용자의 터치 영역 또는 호버링 영역에 표시되데 지정된 패턴을 포함하는 객체일 수 있 다. 상기 제3 객체의 패턴은 예컨대, 지문의 융 등에 의해 반사되는 광의 경로를 일정 형태로 가이드할 수 있다. 상기 제3 객체의 패턴의 크기 및 형상 등은 사용자 설정에 따라 변경될 수 있다. 도 16은 본 발명의 실시 예에 따른 호버링 신호 기반 지문 운용 방법의 한 예를 나타낸 도면이다. 도 16을 참조하면, 지문 운용 방법과 관련하여, 동작 1601에서, 이벤트가 발생하면, 전자 장치의 프로세서 (예: 센서 제어부)는 지문 인증 요청과 관련한 이벤트 인지 확인할 수 있다. 지문 인증 요청과 관련 한 이벤트가 아닌 경우, 동작 1603에서, 프로세서는 앞서 설명한 동작 1503에서와 유사하게 발생한 이벤트 와 관련한 기능 수행을 처리할 수 있다. 다양한 실시 예에 따르면, 지문 인증 요청과 관련한 이벤트가 발생하면, 동작 1605에서 프로세서(예: 센서 제어부)는 터치 센서의 감도를 조절할 수도 있다. 예컨대, 프로세서는 터치 센서 전체의 감도를 높이 거나 또는 지문 인식 영역의 터치 감도를 주변부보다 높일 수 있다. 상기 지문 인식 영역은 지문 센서가 배치된 영역으로서, 메모리에 기입될 수 있다. 프로세서는 메모리에 기입된 지문 인식 영역의 위치 정보를 참조하여, 해당 영역의 터치 감도를 주변과 다르게 처리할 수 있다. 터치 감도 조정에 앞서, 프로 세서(예: 표시 제어부)는 지문 인식 영역을 지시하는 가이드 정보를 디스플레이에 출력할 수 있 다. 동작 1605에서, 프로세서(예: 센서 제어부)는 호버링 신호가 수집되는지 확인할 수 있다. 예컨대, 프 로세서는 터치 센서의 적어도 일부 영역에서 지정된 호버링 신호(예: 손가락 접근에 따른 호버링 신호)가 수집되는지 또는 지문 인증 영역에서 지정된 호버링 신호가 수집되는지 확인할 수 있다. 지정된 호버링 신호가 검출되지 않는 경우, 프로세서(예: 센서 제어부)는 이하 동작을 스킵하고 동작 1615로 분기할 수 있다. 한 실시 예에 따르면, 동작 1615에서, 프로세서는 지문 인식 기능 종료를 지시하 는 이벤트가 발생하지 않는 경우, 동작 1601 지문 인증 요청이 유효한지 확인할 수 있다. 지문 인증 요청이 유효한 경우(예: 지문 인증과 관련하여 설정된 한계 시간 이내인 경우), 프로세서(예: 센서 제어부)는 터치 감도를 이전 상태로 유지할 수 있다. 또는, 프로세서(예: 센서 제어부)는 터치 감도를 이전 상 태보다 민감하게 변경할 수 있다. 경우에 따라, 지문 인증 요청의 유효성 검사 동작은 생략될 수 있다. 지정된 호버링 신호가 수집되면, 동작 1609에서, 프로세서(예: 표시 제어부)는 지문 인증 영역의 표 시 상태를 변경할 수 있다. 한 실시 예에 따르면, 프로세서는 지문 인증 영역의 휘도, 색 및 형태 중 적어 도 하나를 이전 상태와 다르게 할 수 있다. 예컨대, 프로세서는 지문 인증 영역의 휘도를 이전보다 높게 처리할 수 있다. 프로세서는 상대적으로 높아진 휘도에 따라 수집된 광을 기반으로 생성된 이미지 정보를 기반으로 지문 인증을 재수행할 수 있다. 동작 1611에서, 프로세서(예: 센서 제어부)는 지정된 영역(예: 상기 지문 인식 영역에서 터치가 발생 하는지 확인할 수 있다. 터치가 발생하지 않는 경우, 프로세서는 1607 단계로 분기하여 지정된 호버링 신 호가 수집되는지 확인하고, 그에 따른 처리를 수행할 수 있다. 지문 인식 영역에서 터치가 발생하면, 동작 1613에서, 프로세서(예: 표시 제어부)는 지문 정보 수집 및 처리를 수행할 수 있다. 예컨대, 지문 센서는 지문 인증 영역에 해당하는 픽셀의 광 중 터치되는 물체 에 반사되어 수광된 광을 기반으로 이미지 정보를 수집하고, 수집된 이미지 정보를 프로세서(예: 지문 정 보 처리부)에 전달할 수 있다. 프로세서(예: 지문 정보 처리부)는 앞서 설명한 동작 1509에서의 지문 정보 처리와 유사하게, 수신된 이미지 정보를 기반으로 지문 인증을 수행할 수 있다. 동작 1615에서, 프로세서는 지문 인증 기능 종료와 관련한 이벤트가 발생하는지 확인할 수 있다. 지문 인 증 기능 종료와 관련한 이벤트가 발생하면, 프로세서는 지문 인증 기능 실행 이전 상태로 돌아가거나, 지 정된 상태(예: 대기 화면 표시 상태 등)로 돌아가도록 처리할 수 있다. 이 동작에서, 프로세서(예: 센서 제어부)는 활성화된 지문 센서를 비활성화할 수 있다. 또한, 프로세서(예: 표시 제어부)는 지정된 표시 상태를 가지는 지문 인증 영역을 이전 상태로 복원할 수 있다. 동작 1615에서, 지문 인증 기능 종 료와 관련한 이벤트가 발생하지 않으면, 예컨대, 지문 인증 실패가 발생하면, 프로세서)는 동작 1601 이전 으로 분기하여 이하 동작을 재수행할 수 있다. 또는, 프로세서는 동작 1611에서 터치가 유지된 상태이면 동작 1613으로 분기하여 지문 정보 수집 및 처리를 재수행할 수도 있다. 또는, 프로세서는 동작 1609로 분 기하여 지문 인증 영역의 표시 상태를 이전과 다르게 변경하고 이하 동작을 재수행할 수도 있다. 도 17은 본 발명의 실시 예에 따른 DDI를 이용하는 지문 운용 방법의 한 예를 나타낸 도면이다. 도 17을 참조하면, 지문 운용 방법과 관련하여, 동작 1701에서, 전자 장치의 프로세서는 전원을 공급 받을 수 있다. 예컨대, 프로세서는 전원이 턴-오프된 상태에서 사용자 입력(예: 물리 버튼 입력 등)이 발 생하면, 배터리에 저장된 전원 등을 이용하여 전자 장치의 부팅을 수행할 수 있다. 부팅 완료 후, 또는 부 팅 중 동작 1703에서와 같이, 프로세서(예: 표시 제어부)는 DDI 지문 테이블 기입을 수행할 수 있다. 예컨대, 프로세서는 메모리(예: EMMC or UFS 등)에 저장된 DDI 지문 테이블을 DDI 램(RAM)에 기입할 수 있다. 동작 1705에서, 프로세서(예: 센서 제어부, 표시 제어부, 지문 정보 처리부)는 지문 인증 기능의 실행 여부를 확인할 수 있다. 프로세서는 지문 인증 기능 실행 요청이 없는 경우, 동작 1707에서, 이벤트 발생에 따른 지정된 기능 수행을 처리할 수 있다. 이와 관련하여, 프로세서는 지문 인증 기능과 관 련한 적어도 하나의 어플리케이션 실행을 사용자 입력에 대응하여 또는 지정된 스케줄링 정보의 도래에 따라 수 행할 수 있다. 지문 인증 기능의 실행이 요청되면, 프로세서(예: 센서 제어부)는 지문 센서 및 터치 센서를 활 성화할 수 있다. 동작 1709에서, 프로세서(예: 표시 제어부)는 DDI에 의한 표시 상태 변경을 제어할 수 있다. 예컨대, 지정된 위치(예: 지문 인증 영역)에서의 터치 이벤트가 수집되면, 프로세서는 수집된 터 치 이벤트에 대응하여 표시 상태 변경을 요청하는 변경 요청 신호(또는 해당 터치 이벤트)를 DDI에 전달할 수 있다. DDI는 수신된 변경 요청 신호(또는 터치 이벤트) 수신에 대응하여, 램에 저장된 지문 가이드 정 보를 디스플레이에 출력할 수 있다. 또는, DDI는 램에 저장된 지정된 휘도(예: 300nit ~ 1000nit, 예컨대, 600nit 또는 1000nit)와 지정된 색상(예: Red 계열 650~780nm, Green 계열 490~570 nm, NIR (Near IR) 계열 780~1100 nm 중 적어도 하나의 파장대의 색상)을 가지는 지문 가이드 정보를 디스플레이에 출력할 수 있다. 동작 1711에서, 상기 프로세서(예: 지문 정보 처리부)는 사용자 터치에 대응하여 지문 정보를 수집하 고, 수집된 지문 정보의 지문 인증 여부를 확인할 수 있다. 지문 인증이 정상적으로 수행되면, 동작 1713에서, 프로세서(예: 지문 정보 처리부)는 지문 인증과 관련한 관련 기능 처리를 수행할 수 있다. 지문 인증이 실패한 경우, 동작 1715에서, 프로세서는 지문 인증 기능 종료와 관련한 이벤트가 발생하는지 확인할 수 있다. 지문 인증 기능 종료와 관련한 이벤트 발생 시, 프로세서는 지문 인증 기능을 종료할 수 있다. 지문 인증 기능 종료와 관련한 이벤트 발생이 없는 경우, 프로세서는 동작 1709 이전으로 분기하여 이하 동작을 재 수행할 수 있다. 이 동작에서, DDI는 지문 인증 실패에 대응하여 프로세서(예: 표시 제어부)로부터 변경 요청 신호를 수신하고, 수신된 변경 요청 신호에 따라, 지문 인식 영역이 이전 표시 상태(예: 400nit 휘도에 650~780nm 파장대의 색상)에 다른 표시 상태(예: 600nit 휘도에 동일 색상 또는 Green 계열 490~570nm이나 NIR (Near IR) 계열 780~1100nm 파장대의 색상)로 표시되도록 처리할 수 있다. 또는, DDI는 지정된 지문 처리 시간(예: 1~10초, 예컨대 3초)이 경과하면, 자동으로 지문 인증 영역의 표시 상태 를 변경할 수 있다. 상술한 바와 같이, 본 발명의 실시 예에 따른 지문 운용 방법은 지문 인증 영역의 표시 상태를 제어할 수 있는 설정 값들을 직접 DDI에서 처리함으로써 지문 인식 영역의 표시 상태 변경을 보다 신속하게 처리할 수 있다. 상술한 다양한 실시 예에 따르면, 본 발명의 지문 운용 방법은 지문 인증 요청을 수신하는 동작, 지문 센서가 배치된 위치에 상응하는 디스플레이의 지문 인증 영역에 손가락 접촉을 유도하는 가이드 UI를 출력하는 동작, 상기 지문 인증 영역에서 지정된 이벤트를 상기 지문 센서가 수집하는 동작, 상기 지문 센서가 상기 지정된 이 벤트를 상기 가이드 UI를 출력하는 디스플레이 드라이버 회로(예: 상기 DDI)에 전달하는 동작, 상기 디스플레이 드라이버 회로가 상기 지정된 이벤트에 대응하여 상기 지문 인증 영역의 표시 상태를 지정된 휘도 및 색으로 변 경하는 동작을 포함할 수 있다. 상술한 다양한 실시 예에 따르면, 본 발명의 지문 운용 방법은 지문 인증 요청을 수신하는 동작, 상기 요청에 반응하여 디스플레이의 지문 센싱 영역에 대한 물체의 접근을 가이드하는 가이드 UI를 상기 디스플레이에 출력 하는 동작, 상기 물체의 상기 접근과 관련된 지정된 이벤트의 발생에 적어도 일부 기반하여, 상기 지문 센싱 영 역에 대한 적어도 하나의 디스플레이 속성을 조정하는 동작을 포함할 수 있다. 도 18은 본 발명의 실시 예에 따른 DDI를 이용하여 표시 상태 값을 변경하는 지문 운용 방법의 한 예를 나타낸 도면이다. 도 18을 참조하면, 지문 운용 방법과 관련하여, 앞서 설명한 동작 1601에서와 같이 동작 1801에서, 프로세서 는 지문 인증 요청과 관련한 이벤트가 발생하는지 확인할 수 있다. 지문 인증 요청 이벤트가 발생하지 않 으면, 앞서 설명한 동작 1603에서와 같이 동작 1803에서, 프로세서는 지정된 기능 수행을 처리할 수 있다. 동작 1801에서, 지문 인증 요청 이벤트가 발생하면, 프로세서(예: 센서 제어부는 터치 센서를 활성화 할 수 있다. 상기 프로세서(예: 표시 제어부)는 지문 인식 영역 표시와 관련한 가이드 UI를 출력할 수 있다. 동작 1807에서, 프로세서(예: 센서 제어부)는 터치 인식이 발생하는지 확인할 수 있다. 예컨대, 프로 세서는 지문 인증 영역에서 터치 입력이 발생하는지 확인할 수 있다. 터치 인식이 발생하지 않으면, 동작 1801 이전으로 분기하여 지문 인증 요청이 유효한지 확인한 후, 유효한 경우, 터치 센서의 활성화 상태를 유지 하면서 동작 1807을 수행할 수 있다. 지문 인증 영역에서 유효한 터치 입력이 발생하면, 동작 1809에서, 상기 프로세서(예: 센서 제어부) 는 터치 센서가 수집한 터치 정보가 DDI에 전달되도록 제어할 수 있다. 이와 관련하여, 터치 센서와 DDI는 상기 터치 정보를 송신 및 수신할 수 있는 신호 라인을 가질 수 있다. 이 동작에서 프로세서(예: 센서 제어부 )는 지문 센서를 활성화할 수 있다. 동작 1811에서, DDI는 터치 센서가 전달한 터치 정보에 대응하여, 지문 인증 영역의 표시 상태를 변경할 수 있다. 예컨대, DDI는 지문 인증 영역이 지정된 제1 휘도, 제1 색, 제1 형태를 가지도록 DDI 지문 테이 블에 설정된 값을 기준으로 광이 조사되도록 처리할 수 있다. 동작 1813에서, 프로세서(예: 지문 정보 처리부)는 지문 인증을 수행하여, 수집된 지문 정보가 유효 한지 확인할 수 있다. 수집된 지문 정보가 유효한 경우, 동작 1815에서, 프로세서(예: 지문 정보 처리부 )는 지문 인증과 관련한 기능 처리를 수행할 수 있다. 지문 인증이 실패한 경우, 동작 1817에서, 프로세서 는 기능 종료 여부를 확인할 수 있다. 기능 종료 관련 이벤트 발생이 없으면, 동작 1811에서, 프로세서(예: 표시 제어부)는 DDI에 지문 인증 영역에 대한 표시 상태 변경을 요청할 수 있다. 상술한 바와 같이, 본 발명의 실시 예에 따른 지문 운용 방법은 터치 정보를 직접 DDI에 전달하여, 프로세서 의 제어 없이 지문 인식 영역의 표시 상태를 제어할 수 있다. 이에 따라, 본 발명의 지문 운용 방법은 지 문 인식 영역의 표시 상태 변경을 보다 신속하게 처리할 수 있다. 도 19는 본 발명의 실시 예에 따른 지문 센서를 이용하여 표시 상태 값 변경하는 지문 운용 방법의 한 예를 나 타낸 도면이다. 설명에 앞서, 동작 1901, 동작 1903은 앞서 설명한 동작 1801 및 동작 1803과 동일 또는 유사한 동작이 될 수 있다. 동작 1905에서, 지문 인증 요청이 발생하면, 프로세서(예: 센서 제어부)는 지문 센서 활 성화 및 가이드 UI 출력을 처리할 수 있다. 동작 1907에서, 프로세서는 지문 센서로부터 손가락 접근에 관한 신호의 수신이 있는지 여부를 확인 할 수 있다. 이와 관련하여, 활성화된 지문 센서는 일정 주기 또는 실시간으로 광을 수집하고, 수집된 광 을 기반으로 이미지 정보를 생성한 후, 이를 프로세서에 전달할 수 있다. 또는, 지문 센서는 생성된 이미지 정보를 분석하여 손가락 접근에 대응하는지 판단할 수 있다. 상술한 동작 수행과 관련하여, 프로세서 는 지정된 디스플레이 영역(예: 지문 인식 영역)에 배치된 픽셀들이 지정된 휘도와 색 상의 광을 조 사하도록 제어할 수 있다. 해당 픽셀들이 조사한 광은 지문 센서의 수광부에 의해 집광될 수 있다. 또는, 지문 센서는 발광부를 이용하여 광을 발광하고, 수광부를 이용하여 광을 수집할 수도 있다. 손가락 접근에 대응하는 이미지 정보가 수집되지 않으면, 프로세서는 동작 1905 이전으로 분기하여 이하 동작을 재수행할 수 있다. 이 동작에서, 프로세서는 활성화된 지문 센서를 유지하면서, 손가락 접근 여부 를 확인할 수 있다. 상기 프로세서는 손가락 접근 여부에 대한 확인 여부를 지정된 시간 동안 수행하고, 지정된 시간(예: 1~10초, 예컨대, 3초 또는 5초 등) 경과 시, 지문 인증 요청의 유효성이 종료된 것으로 판단할 수 있다. 손가락 접근에 대응하는 이미지 정보가 획득되면, 동작 1909에서, 프로세서(예: 표시 제어부)는 DDI에 의한 지문 인증 영역의 표시 상태 변경을 처리할 수 있다. 다양한 실시 예에 따르면, 지문 센서 는 이미지 정보 분석에 따른 결과(예: 손가락 접근으로 판단되는 정보)를 DDI에 전달하고, DDI 는 수신된 지문 센서의 정보를 기반으로 지문 인증 영역이 지정된 표시 상태가 되도록 처리할 수 있다. 동작 1911에서, 프로세서는 지문 인증 완료 여부를 확인할 수 있다. 지문 인증이 완료되면, 동작 1913에서, 프로세서는 지문 인증에 따른 관련 기능 처리를 수행할 수 있다. 지문 인증이 실패하면, 동작 1915에서, 지문 인증 기능 종료 여부를 확인하고, 비종료 시, 프로세서는 동작 1909 이전으로 분기하여 이 하 동작을 재 수행할 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치의 운용 방법은 지문 인증 요청을 수신하는 동작, 지문 센서가 배치된 위치에 상응하는 디스플레이의 화면 표시 영역을 포함하는 적어도 일부 영역을 지정 된 휘도 및 색으로 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 출력하는 동작은 상기 지문 센서가 배치된 영역에 대응하는 상기 디스플레이의 지문 인증 영역을 지정된 휘도의 지정된 파장대(예: Red 계열 650~780nm, Green 계열 490~570nm, 또는 NIR (Near IR) 계열 780~1100nm 파장대 중 적어도 하나의 파장대) 중 지정된 파장대 색으로 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 지문 센서가 획득한 이미지 정보와 저장된 지문 정보를 비교하는 동작, 지문 인증 실패 또는 지정된 크기 이상의 품질을 가지는 이미지 정보 획득 실패 시, 접촉된 물체가 배치된 디스 플레이 영역의 표시 상태를 이전과 다르게 출력하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 지문 인증 요청에 따라 상기 지문 센서가 배치된 영역에 대응하는 상기 디스플레이의 지문 인증 영역에 사용자 손가락 배치를 유도하는 가이드 UI(User Interface)를 출력하는 동 작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 지문 인증 영역의 터치 감도를 주변과 다르게 처리하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 지문 인증 영역에서 지정된 호버링 신호가 수신되면, 상기 지문 인 증 영역을 지정된 휘도(예: 300nit~1000nit 중 특정 nit)의 지정된 파장대(예: Red 계열 650~780nm, Green 계 열 490~570nm, 또는 NIR (Near IR) 계열 780~1100nm 파장대 중 적어도 하나의 파장대) 색으로 출력하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 지문 인증 영역에서 터치 신호가 수신되면, 상기 지문 인증 영역을 지정된 휘도의 지정된 파장대(예: Red 계열 650~780nm, Green 계열 490~570nm, 또는 NIR (Near IR) 계열 780~1100nm 파장대 중 적어도 하나의 파장대) 색으로 출력하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 지문 인증 요청 시, 상기 지문 센서가 획득하는 이미지 정보를 기반으로 손가락 접근을 인식하는 동작, 손가락 접근 인식 시, 상기 손가락이 인식되는 영역을 지정된 파장대 예: Red 계 열 650~780nm, Green 계열 490~570nm, 또는 NIR (Near IR) 계열 780~1100nm 파장대 중 적어도 하나의 파장대) 색상으로 출력하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 디스플레이에 물체가 접촉된 영역의 휘도를 지정된 크기만큼 높이도록 처리하는 동작을 더 포함할 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치의 운용 방법은 지문 인증 요청을 수신하는 동작, 지문 센서가 배치된 위치에 상응하는 디스플레이 영역에 손가락 접촉을 유도하는 가이드 UI를 출력하는 동작, 상기 가이드 UI가 출력된 지문 인증 영역과 관련한 지정된 이벤트가 발생하면, 상기 지문 인증 영역의 표 시 상태를 지정된 휘도 또는 지정된 색으로 출력하는 동작을 포함할 수 있다. 도 20은 본 발명의 실시 예에 따른 수집 광 파형의 형태를 설명하는 도면이며, 도 21a는 본 발명의 실시 예에 따른 표시 상태 값 변경 범위를 설명하는 도면이고, 도 21b는 본 발명의 실시 예에 따른 지정된 파장대의 범위 를 지시하는 도면이다. 도 20 내지 도 21a를 참조하면, 지문 센서가 수집하는 지문 이미지의 품질은 지문 센서로 입사하는 광의 회절 정도와 광 에너지로부터 영향을 받을 수 있다. 디스플레이에 접촉된 사용자의 지문에서 반사 된 광이 디스 플레이의 배선과 픽셀의 틈새(aperture)를 통과하며 지문 센서로 입사파가 제공될 때, 입사파의 회절이 발 생할 수 있다. 이에 따라, 각 틈새를 통과 한 입사파는 서로 보강간섭/상쇄간섭을 일으킬 수 있다. 이때 회절 한 정도를 각도로 나타내어 Θ라고 할 때, Θ에 관하여 다음 수학식 1과 같은 관계가 성립될 수 있다. 수학식 1"}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "따라서, 전자 장치의 틈새(예: 디스플레이의 투명 영역들)이 일정할 때, 입사파의 파장이 길면 길수 록 회절이 많이 일어나며, 보강간섭/상쇄간섭이 또한 커지게 되므로 획득된 이미지 품질이 저하될 수 있다. 상기 지문 센서의 민감도(Sensitivity)는 포토 다이오드(Photo Diode)의 성질 상 도 21a에 도시된 바와 같이 입 사 광의 에너지, 즉 광 전력에 의해 결정이 되며, 이에 따라, 다음 수학식 2 내지 4에서와 같이 입사 파의 파장 과 관련될 수 있다. 수학식 2 수학식 3"}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 4"}
{"patent_id": "10-2020-0073062", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상술한 바와 같이, 입사파의 파장이 길면 길수록 발생하는 전류가 높아지고, 포토 다이오드의 민감도가 증가하 기 때문에, 적절한 지문 정보의 품질을 획득하기 위하여 지정된 주파수 대역의 입사파를 조사하는 것이 유리할 수 있다. 이에 따라, 본 발명의 실시 예에 따른 전자 장치는 지문 인증 영역에 배치된 픽셀들 또는 지문 센서의 발광부가 도 21b에 나타낸 바와 같이 지정된 파장대(예: Red 계열 650~780nm, Green 계열 490~570nm, 또는 NIR (Near IR) 계열 780~1100nm 파장대 중 적어도 하나의 파장대)의 색을 조사하도록 제어함으로써, 도21b에 나타난 바와 같이, 지문 정보의 품질을 개선할 수 있다. 또는, 전자 장치는 투과율이 3% 이상인 파장대의 색상을 지문 인증 영역에 출력할 수 있다. 도 22는 본 발명의 실시 예에 따른 전자 장치 운용과 관련한 화면 인터페이스의 한 예를 나타낸 도면이다. 도 22를 참조하면, 본 발명의 실시 예에 따른 디스플레이는 2201 상태에서와 같이, 지문 인증 요청과 관련 한 화면을 출력할 수 있다. 예컨대, 지문 인증 기능이 필요한 어플리케이션이 실행되면, 디스플레이는 도 시된 바와 같이 지문 인증을 요청하는 화면을 출력할 수 있다. 지문 인증 요청과 관련한 화면은 예컨대, 가이드 UI를 포함할 수 있다. 상기 가이드 UI는 예컨대, 디스플레이의 지정된 지문 인증 영역에 표시 될 수 있다. 상기 지정된 지문 인증 영역은 전자 장치의 파지 상태를 고려하여, 특정 손가락이 위치할 수 있는 위치가 될 수 있다. 상기 가이드 UI는 예컨대, 원형의 테두리를 포함하며, 내부에 지정된 이미지(예: 가상 디폴트 지문 이미지)를 포함할 수 있다. 가이드 UI의 형태 및 이미지 내용은 설정에 따 라 변경될 수 있다. 전자 장치의 프로세서는 가이드 UI가 디스플레이에 출력되는 동안, 선택적으로 터치 센서 의 민감도를 조정할 수 있다. 예컨대, 프로세서는 가이드 UI가 출력된 지문 인증 영역을 포함하는 일정 영역의 터치 민감도(예컨대, 민감도 전체 크기를 10으로 정의할 경우 5이하의 민감도)를 이전 상태보다 민 감하게(예: 6이상의 민감도) 조정할 수 있다. 이전 상태보다 민감하게 조정된 터치 영역에 물체가 접근하는 경 우, 터치 센서는 호버링 이벤트 등을 주변 영역에 비하여 먼저 획득할 수 있다. 다양한 실시 예에 따르면, 프로 세서는 가이드 UI가 출력되면, 지문 인증 영역 하부에 배치된 지문 센서를 이용하여 손가락 접 근 등을 판단할 수 있다. 손가락 접근은 다양한 제스처 동작을 포함할 수 있다. 예컨대, 제스처 동작은 숏 터치, 롱 프레스, 더블탭 및 포스 터치 동작을 포함할 수 있다. 상기 숏 터치 동작은 터치 영역 상에 터치 물체 (예: 손가락)가 150ms 이내로 터치되는 동작을 포함할 수 있다. 롱 프레스 동작은 터치 영역 상에 터치 물체가 500ms 이내로 터치되는 동작을 포함할 수 있다. 더블 탭 동작은 터치 영역 상에 터치 물체가 500ms 이내에서 두 번 터치되는 동작을 포함할 수 있다. 포스 터치 동작은 지정된 크기의 압력으로 터치 영역을 터치하는 동작을 포함할 수 있다. 손가락 접근 시, 2203 상태에서와 같이, 프로세서는 지문 인증 영역을 제1 표시 상태로 표시할 수 있다. 제1 표시 상태는 예컨대, 지문 인증 영역을 제1 휘도(예: 600nit 이상) 또는 녹색 계열의 색상으로 표시하는 상태를 포함할 수 있다. 또는, 프로세서는 설정에 따라, 지문 인증 영역을 제2 표시 상태 로 표시할 수 있다. 상기 제2 표시 상태는 예컨대, 지문 인증 영역을 적어도 두 개의 영역으로 나누고, 영역별로 서로 다른 색 또는 서로 다른 휘도를 가지도록 표시하는 상태를 포함할 수 있다. 한 실시 예에따르면, 제2 표시 상태는 중앙부의 휘도가 주변부보다 큰 값으로 표시되는 상태를 포함할 수 있다. 2203 상태에서, 손가락 접촉이 발생하면(예: 터치 인식되면) 프로세서는 지문 센서가 획득하는 이미 지 정보를 기반으로 지문 인증을 수행할 수 있다. 프로세서는 지문 인증이 성공하면, 2205 상태에서와 같 이, 인증 성공과 관련한 메시지를 디스플레이에 출력할 수 있다. 또는, 한 실시예에 따르면, 프로세서 는 인증 성공에 따른 어플리케이션 기능(예: 잠금화면 해제, 페이먼트 승인 등)을 실행하고, 그에 대응하 는 화면을 디스플레이에 출력할 수 있다. 2203 상태에서, 지문 인증이 실패한 경우(또는 지정된 크기의 해상도 또는 품질 이상의 이미지 정보 획득 실패 시), 2207 상태에서와 같이, 프로세서는 지문 인증 실패에 대응하는 메시지 (또는 지정된 해상도의 이미지 정보 획득 실패 메시지)를 출력할 수 있다. 또한, 프로세서는 지문 인증 재 수행을 안내하는 정보를 출력 할 수 있다. 한 실시 예에 따르면, 프로세서는 지문 인증 영역의 표시 상태를 이전과 다른 제3 표시 상태 로 표시할 수 있다. 예컨대, 제3 표시 상태는 제1 표시 상태의 휘도 또는 색 중 적어도 하나 가 다른 표시 상태를 포함할 수 있다. 또는, 제3 표시 상태는 제1 표시 상태의 휘도보다 높은 휘도 값으로 지정된 색상(예: 녹색 계열)을 출력한 상태를 포함할 수 있다. 프로세서는 지문 인증 영역이 제3 표시 상태가 되면, 지문 센서가를 이용하여 이미지 정보를 획득하도록 제어하고, 획득된 지문 정보 에 대한 지문 인증을 재수행할 수 있다. 프로세서는 지문 인증 동작을 지정된 횟수 동안 반복 수행할 수 있다. 도 23는 다양한 실시 예에 따른 전자 장치의 블록도를 나타낸다. 도 23를 참조하면, 전자 장치는, 예를 들면, 앞서 설명한 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP), 통신 모듈, 가입자 식별 모듈, 메 모리, 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카 메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드 웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서 는, 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시 예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서는 도 23에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프 로세서는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈은, 도 13의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈 은, 예를 들면, 셀룰러 모듈, Wi-Fi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모듈, Beidou 모듈, 또는 Galileo 모듈), NFC 모듈, MST 모듈, 및 RF(radio frequency) 모듈을 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)를 이용 하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시 예에 따 르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP)를 포함할 수 있다. Wi-Fi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈, 또는 MST 모듈 각각은, 예 를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시 예에 따르면, 셀룰러 모듈, Wi-Fi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈, 또는 MST 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 IC(integrated chip) 또는 IC 패키지 내에 포 함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜 시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또 는 안테나 등을 포함할 수 있다. 다른 실시 예에 따르면, 셀룰러 모듈, Wi-Fi 모듈, 블루투스 모듈 , GNSS 모듈, NFC 모듈, MST 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신 호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포함할 수 있으며, 고유한 식별 정보(예: ICCID (integrated circuit card identifier)) 또는 가입자 정보(예: IMSI (international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비-휘발성(non-volatile) 메모리 (예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), 마스크(mask) ROM, 플래시(flash) ROM, 플래시 메모리(예: 낸드플래시(NAND flash) 또는 노아플래시(NOR flash) 등), 하드 드라이브, 또는 SSD(solid state drive) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(MultiMediaCard), 또는 메모리 스틱(memory stick) 등을 더 포 함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 전자 장치와 기능적으로 및/또는 물리적 으로 연결될 수 있다. 보안 모듈은 메모리보다 상대적으로 보안 레벨이 높은 저장 공간을 포함하는 모듈로써, 안전한 데 이터 저장 및 보호된 실행 환경을 보장해주는 회로일 수 있다. 보안 모듈은 별도의 회로로 구현될 수 있 으며, 별도의 프로세서를 포함할 수 있다. 보안 모듈은, 예를 들면, 탈착 가능한 스마트 칩, SD(secure digital) 카드 내에 존재하거나, 또는 전자 장치의 고정 칩 내에 내장된 내장형 보안 요소(embedded secure element(eSE))를 포함할 수 있다. 또한, 보안 모듈은 전자 장치의 운영 체제(OS)와 다른 운영 체제로 구동될 수 있다. 예를 들면, 보안 모듈은 JCOP(java card open platform) 운영 체제를 기반 으로 동작할 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지 된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(2340A), 자이로 센서 (2340B), 기압 센서(2340C), 마그네틱 센서(2340D), 가속도 센서(2340E), 그립 센서(2340F), 근접 센서 (2340G), 컬러 센서(2340H)(예: RGB 센서), 생체 센서(2340I), 온/습도 센서(2340J), 조도 센서(2340K), 또는 UV(ultra violet) 센서(2340M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈 은, 예를 들면, 후각 센서(E-nose sensor), EMG(electromyography) 센서, EEG(electroencephalogram) 센 서, ECG(electrocardiogram) 센서, IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구 성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정 전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널 은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 시트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치 는 마이크(예: 마이크)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 또는 프로젝터을 포함할 수 있다. 패널은, 도 13의 디스플레이과 동일 또는 유사한 구성을 포함할 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널 은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입 체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 디스플레이 는 패널, 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수있다. 인터페이스는, 예를 들면, HDMI, USB, 광 인터페이스(optical interface), 또는 D- sub(D-subminiature)을 포함할 수 있다. 인터페이스는, 예를 들면, 도 13에 도시된 통신 인터페이 스에 포함될 수 있다. 추가적으로 또는 대체적으로, 인터페이스는, 예를 들면, MHL(mobile high- definition link) 인터페이스, SD 카드/MMC 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이 스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈(238 0)의 적어도 일부 구성요소는, 예를 들면, 도 13에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또 는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 제논 램프(xenon lamp))를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관 리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리은, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터는 전자 장치 혹은 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있 고, 진동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치 는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들 면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(MediaFLOTM) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. \"모듈\"은, 일체로 구성된 부 품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 기계적으로 또 는 전자적으로 구현될 수 있으며, 예를 들면, 어떤 동작들을 수행하는, 알려졌거나 앞으로 개발될, ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays), 또는 프로그램 가능 논리 장치를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는 프로그램 모 듈의 형태로 컴퓨터로 판독 가능한 저장 매체(예: 메모리)에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서에 의해 실행될 경우, 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 판독 가능 한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(예: 자기테이프), 광기록 매체(예: CD-ROM, DVD, 자 기-광 매체 (예: 플롭티컬 디스크), 내장 메모리 등을 포함할 수 있다. 명령어는 컴파일러에 의해 만들어지는 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른, 모듈, 프로그램 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다.도면 도면1 도면2 도면3a 도면3b 도면3c 도면4 도면5 도면6a 도면6b 도면6c 도면7 도면8 도면9a 도면9b 도면10 도면11a 도면11b 도면12a 도면12b 도면12c 도면13 도면14 도면15a 도면15b 도면16 도면17 도면18 도면19 도면20 도면21a 도면21b 도면22 도면23"}
{"patent_id": "10-2020-0073062", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 지문 인증 기능을 지원하는 전자 장치 외관의 한 예를 나타낸 도면이다. 도 2는 본 발명의 실시 예에 따른 전자 장치의 분해 사시도의 한 예를 나타낸 도면이다. 도 3a는 본 발명의 실시 예에 따른 지문 센서를 가지는 전자 장치의 한 예를 나타낸 도면이다. 도 3b는 본 발명의 한 실시 예에 따른 COP 타입 전자 장치의 한 예를 나타낸 도면이다. 도 3c는 본 발명의 한 실시 예에 따른 COF 타입 전자 장치의 한 예를 나타낸 도면이다. 도 4는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치의 다른 예를 나타낸 도면이다. 도 5는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치의 또 다른 예를 나타낸 도면이다. 도 6a는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치 구조의 한 예를 나타낸 도면이다. 도 6b는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치 구조의 다른 한 예를 나타낸 도면이다. 도 6c는 본 발명의 실시 예에 따른 전자 장치의 지문 센서 배치 구조의 또 다른 한 예를 나타낸 도면이다. 도 7은 본 발명의 실시 예에 따른 전자 장치의 파장 선택 기판 배치의 한 예를 나타낸 도면이다.도 8은 본 발명의 실시 예에 따른 전자 장치의 파장 선택 기판 배치의 다른 예를 나타낸 도면이다. 도 9a는 본 발명의 실시 예에 따른 전자 장치의 파장 선택 기판 배치의 또 다른 예를 나타낸 도면이다. 도 9b는 본 발명의 실시 예에 따른 지문 인증과 관련한 광 경로를 설명하는 도면이다. 도 10은 본 발명의 실시 예에 따른 지문 센서 시트를 포함하는 전자 장치의 일부 구성을 나타낸 도면이다. 도 11a는 본 발명의 실시 예에 따른 전자 장치의 픽셀 구조의 한 예를 나타낸 도면이다. 도 11b는 본 발명의 실시 예에 따른 전자 장치 픽셀 구조에서의 지문 센서 운용을 설명하는 도면이다. 도 12a는 본 발명의 실시 예에 따른 전자 장치의 터치 감도 변경의 한 예를 설명하는 도면이다. 도 12b는 본 발명의 실시 예에 따른 지문 인식 관련 전자 장치 운용 방법의 한 예를 나타낸 도면이다. 도 12c는 본 발명의 실시 예에 따른 지문 인식 관련 전자 장치 운용 방법의 다른 한 예를 나타낸 도면이다. 도 13은 본 발명의 실시 예에 따른 전자 장치 운용 환경의 한 예를 나타낸 도면이다. 도 14는 본 발명의 실시 예에 따른 프로세서의 한 예를 나타낸 도면이다. 도 15a는 본 발명의 실시 예에 따른 지문 인증 영역의 표시 상태 값 변경에 따른 지문 운용 방법의 한 예를 나 타낸 도면이다. 도 15b는 본 발명의 실시 예에 따른 지문 인증 영역의 표시 상태 값 변경과 관련한 화면 인터페이스의 한 예를 나타낸 도면이다. 도 16은 본 발명의 실시 예에 따른 호버링 신호 기반 지문 운용 방법의 한 예를 나타낸 도면이다. 도 17은 본 발명의 실시 예에 따른 DDI를 이용하는 지문 운용 방법의 한 예를 나타낸 도면이다. 도 18은 본 발명의 실시 예에 따른 DDI를 이용하여 표시 상태 값을 변경하는 지문 운용 방법의 한 예를 나타낸 도면이다. 도 19는 본 발명의 실시 예에 따른 지문 센서를 이용하여 표시 상태 값 변경하는 지문 운용 방법의 한 예를 나 타낸 도면이다. 도 20은 본 발명의 실시 예에 따른 수집 광 파형의 형태를 설명하는 도면이다. 도 21a는 본 발명의 실시 예에 따른 표시 상태 값 변경 범위를 설명하는 도면이다. 도 21b는 본 발명의 실시 예에 따른 지정된 파장대의 범위를 지시하는 도면이다. 도 22는 본 발명의 실시 예에 따른 전자 장치 운용과 관련한 화면 인터페이스의 한 예를 나타낸 도면이다. 도 23는 다양한 실시 예에 따른 전자 장치의 블록도를 나타낸다."}
