{"patent_id": "10-2021-0177220", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0089577", "출원번호": "10-2021-0177220", "발명의 명칭": "로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템 및 그 방법", "출원인": "한국광기술원", "발명자": "김선만"}}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나 이상의 구조물을 포함한 대상 공간에서 2차원 평면 이동하면서 동시적 위치 추정 및 지도작성(Simultaneous Localization and Mapping, SLAM) 기능을 수행하여 공간지도를 생성하고, 상기 공간지도에 기초하여 적어도 하나 이상의 공간 충격 응답을 측정하기 위한 적어도 하나 이상의 측정 위치를 결정한 후 기 설정된 주파수 대역의 샘플 측정 신호를 방사하는 로봇 청소기; 및상기 로봇 청소기와 통신망을 통해 연결되어, 상기 측정 위치별 샘플 측정 신호를 획득하여 저장하고, 저장된샘플 측정 신호를 이용하여 공간 충격 응답(room impulse response)을 추정하며, 자신의 위치 정보에 기초하여상기 공간 충격 응답을 음성 데이터베이스에 반영하는 음성 인지도 강화 알고리즘을 수행하고, 상기 음성 데이터베이스에 기초하여 사용자의 발화음성에 대한 음성 인식 결과에 기초하여 음성 컨텐츠를 제공하는 음성인식알고리즘을 수행하는 인공지능 스피커를 포함하는 것인, 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 로봇 청소기와 인공지능 스피커는 음성 강화 애플리케이션을 통해 상호 연동되어 상기 음성 인지도 강화알고리즘을 수행하는 것인, 봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 로봇 청소기는, 적어도 하나 이상의 구조물을 포함한 대상 공간에서 2차원 평면을 이동하기 위한 구동수단을 포함하는 본체;상기 본체에 구비되어 적어도 하나 이상의 센서를 이용하여 구조물 또는 장애물을 감지하는 장애물 감지부;상기 SLAM 기능을 통해 상기 대상 공간에 대한 영역을 탐색하여 구조물이 위치한 장애물 영역을 포함하는 공간지도를 생성하는 지도 생성부;2차원 평면을 기 설정된 간격으로 공간 충격 응답을 측정하기 위한 적어도 하나 이상의 측정 위치로 결정하고,결정된 측정 위치마다 기 설정된 주파수 대역의 샘플 측정 신호를 방사하는 신호 출력부;상기 공간 지도에 기반하여 청소 동작을 수행하고, 인공지능 스피커와 연동하여 음성 인지도 강화 알고리즘의수행에 필요한 각 구성요소의 동작을 제어하는 제어부;외부 장치와 유/무선 통신 방식에 의해 상호 연결을 수행하는 통신부; 및상기 제어부의 제어에 따라 상기 구동수단에 연결된 모터를 구동시켜 상기 본체의 주행 방향을 결정하는 주행구동부를 포함하는 것인, 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 인공지능 스피커는, 통신망과 연동하여 로봇 청소기 또는 외부 장치와의 송수신을 위한 통신 인터페이스를 제공하는 통신부;상기 샘플 측정 신호 또는 발화 음성이 입력되는 마이크; 상기 음성 인지도 강화 알고리즘과 음성 인식 알고리즘을 수행하여, 상기 발화음성에 대한 음성 인식 결과에공개특허 10-2023-0089577-3-기초하여 음성 컨텐츠를 제공하는 제어부;상기 제어부의 제어에 따라 음성 컨텐츠를 출력하는 스피커; 및 상기 음성 인지도 강화 알고리즘과 음성 인식 알고리즘을 수행하면서 누적되는 데이터를 저장하는 데이터베이스를 포함하는 것인, 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는, 상기 측정 위치별 방사된 샘플 측정 신호를 획득하여 저장하는 방사 소리 녹음 모듈;상기 방사 소리 녹음 모듈을 통해 저장된 측정 위치별 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하여저장하는 공간 충격 응답 추정 모듈; 상기 음성 데이터베이스에 상기 공간 충격 응답 추정 모듈에서 추정된 공간 충격 응답을 컨벌루션 처리하여 공간 충격 응답이 반영된 음성 데이터베이스를 제공하는 공간 충격 응답 반영 모듈;상기 음성 데이터베이스에 기초한 심층신경망 기반의 음성 인식 모델을 학습하는 학습 모듈; 및 상기 인공지능 스피커가 배치된 대상 공간에서 사람의 발화 음성을 획득하고, 획득된 발화음성을 상기 음성 인식 모델에 입력하여 잔향이 제거된 음성 변환을 통해 음성 인식 결과를 출력하는 음성인식 모듈을 포함하는 것인, 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 학습 모듈은, 상기 공간 충격 응답이 반영된 음성 데이터베이스에 저장된 음성 데이터를 학습 데이터로 하고, 잔향이 제거된음성 데이터베이스를 목표 출력 데이터가 되도록 학습을 수행하는 것인, 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "로봇 청소기와 인공지능 스피커의 연동을 통한 인공지능 스피커의 음성 인식 강화 방법에 있어서,a) 인공지능 스피커는 음성 인지도 강화 애플리케이션을 통해 상기 로봇 청소기와 연동되는 단계; 및 b) 상기 음성 인지도 강화 애플리케이션에 의해, 상기 로봇 청소기가 적어도 하나 이상의 구조물을 포함한 대상공간에서 2차원 평면 이동하면서 동시적 위치 추정 및 지도작성(Simultaneous Localization and Mapping,SLAM) 기능을 통해 작성된 공간 지도에 기초하여 적어도 하나 이상의 측정 위치를 결정한 후 기 설정된 주파수대역의 샘플 측정 신호를 방사하는 단계;c) 상기 인공지능 스피커는 측정 위치별 샘플 측정 신호를 획득하여 저장하고, 저장된 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하며, 자신의 위치 정보에 기초하여 상기 공간 충격 응답을 음성 데이터베이스에 반영하는 음성 인지도 강화 알고리즘을 수행하는 단계; 및 d) 상기 인공지능 스피커는 상기 음성 데이터베이스에 기초하여 사용자의 발화음성에 대한 음성인식 알고리즘을수행하여, 음성 인식 결과에 기초하여 음성 컨텐츠를 제공하는 단계를 포함하는 것인, 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 방법."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 c) 단계는, 상기 측정 위치별 방사된 샘플 측정 신호를 획득하여 저장하는 방사 소리 녹음 단계;공개특허 10-2023-0089577-4-상기 방사 소리 녹음 단계을 통해 저장된 측정 위치별 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하여저장하는 공간 충격 응답 추정 단계; 상기 음성 데이터베이스에 상기 공간 충격 응답 추정 단계듈에서 추정된 공간 충격 응답을 컨벌루션 처리하여공간 충격 응답이 반영된 음성 데이터베이스를 제공하는 공간 충격 응답 반영 단계; 및 상기 음성 데이터베이스에 기초한 심층신경망 기반의 음성 인식 모델을 학습하는 학습 단계를 포함하는 것인,로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 방법."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 학습 단계는, 상기 공간 충격 응답이 반영된 음성 데이터베이스에 저장된 음성 데이터를 학습 데이터로 하고, 잔향이 제거된음성 데이터베이스를 목표 출력 데이터가 되도록 학습을 수행하는 것인, 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 방법."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 d) 단계는, 상기 인공지능 스피커가 배치된 대상 공간에서 사람의 발화 음성을 획득하고, 획득된 발화음성을 상기 음성 인식 모델에 입력하여 잔향이 제거된 음성 변환을 통해 음성 인식 결과를 출력하는 것인, 로봇 청소기를 이용한인공지능 스피커의 음성 인식 강화 방법."}
{"patent_id": "10-2021-0177220", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "통신망과 연동하여 로봇 청소기 또는 외부 장치와의 송수신을 위한 통신 인터페이스를 제공하는 통신부;상기 로봇 청소기에서 방사되는 샘플 측정 신호 또는 발화 음성이 입력되는 마이크; 음성 인지도 강화 알고리즘과 음성 인식 알고리즘을 수행하여, 상기 발화 음성에 대한 음성 인식 결과에 기초하여 음성 컨텐츠를 제공하는 제어부;상기 제어부의 제어에 따라 음성 컨텐츠를 출력하는 스피커; 및 상기 음성 인지도 강화 알고리즘과 음성 인식 알고리즘을 수행하면서 누적되는 데이터를 저장하는 데이터베이스를 포함하되,상기 음성 인지도 강화 알고리즘은, 기 설정된 측정 위치별 샘플 측정 신호를 획득하여 저장하고, 저장된 샘플측정 신호를 이용하여 공간 충격 응답을 추정하며, 자신의 위치 정보에 기초하여 상기 공간 충격 응답을 음성데이터베이스에 반영하는 것이고,상기 음성인식 알고리즘은, 상기 음성 데이터베이스에 기초하여 사용자의 발화음성에 대한 음성 인식 결과에 기초하여 음성 컨텐츠를 제공하는 것인, 음성 인식이 강화된 인공지능 스피커."}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템 및 그 방법에 관한 것으로서, 적어 도 하나 이상의 구조물을 포함한 대상 공간에서 2차원 평면 이동하면서 동시적 위치 추정 및 지도작성 (Simultaneous Localization and Mapping, SLAM) 기능을 수행하여 공간지도를 생성하고, 상기 공간지도에 기초 (뒷면에 계속)"}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사람의 음성에 대한 음성인식 정확성을 향상시킬 수 있는 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 부분에 기술된 내용은 단순히 본 발명의 일 실시예에 대한 배경 정보를 제공할 뿐 종래기술을 구성하는 것은 아니다. 음성 인식 기술은 데이터를 입력하거나 서비스를 제공받기 위해 음성을 이용하는 기술이다. 음성 인식 기술을 이용한 시스템은 여러 가지 데이터 입력 방법 중 사람의 의사 전달과 가장 유사한 방법을 사용하기 때문에 사용 이 편리하다는 장점이 있다. 하지만 음성 신호는 마우스나 키보드를 통한 일반적인 입력 신호들과 달리 잡음에 노출된 상태에서 실시간으로 처리되기 때문에 실제 환경에서 시스템의 인식률이 떨어지는 경우가 빈번하다. 최근, 딥러닝 및 잡음 처리 기술의 발전으로 인해 현재는 사람간의 자연스러운 대화 음성을 대상으로 기술 고도 화가 이루어지고 있고, 로봇 어드바이저(Robot Advisor), 챗봇(ChatBot), AI 스피커, AI 번역, 지능형 스마트 CCTV, 추천시스템(Recommender Systems) 등 많은 분야에서 AI 기술이 활용되면서 AI 시장 규모는 지속적으로 커 지고 있다. 도 1은 일반적인 음성인식 엔진을 이용한 음성 대화 서비스를 제공하는 과정을 설명하는 도면이다. 도 1에 도시된 바와 같이, 음성 인식을 위해 음성 신호와 매칭되는 텍스트를 이용하여 인공신경망의 학습을 통 한 음성인식 엔진이 구축되고, 이러한 음성인식 엔진이 적용된 음성 대화 서비스를 대표하는 AI 스피커와 음성 대화 로봇은 기기 제어 기능, 웹 정보 검색 및 질의 응답, 채팅 등의 업무를 수행하게 된다. 음성인식 엔진은 크게 음성과 언어 정보라는 중요한 사전 지식을 사용해 음성 신호로부터 텍스트(문자 정보)를 출력하게 되는데, 이때 개념적으로 음성 신호를 문자 기호로 해석한다는 차원에서 음성 인식 알고리즘을 디코더 라고 부르기도 한다. 음성 인식 엔진의 성능은 음성인식 데이터베이스의 크기와 품질에 비례하여 성능 향상이 이루어진다. 따라서, 음성인식 데이터베이스에 저장되어야 하는 어휘의 구가 기하급수적으로 증가하며, 특정 도메인으로만 대상 영역 을 한정할 수 없는 특징이 있기 때문에 언어 모델의 대용량화와 지속적인 확장 기능이 필요하다. 또한, 음성인식 엔진은 디코딩 과정에서의 탐색 공간 및 계산 효율을 위해 단어가 아닌 형태소 기반의 인식 단 위를 사용하기 때문에 형태소 분석에 기반한 어휘 선정의 문제와 함께 인식 대상 어휘의 제한으로 인한 미관측 어휘(Out of Vocabulary, OOV) 발생에 따른 인식 오류 발생이 성능에 영향을 끼치게 된다. 또한, 음성 인식의 성능 개선을 위해서는 음성 로그 뿐만 아니라 방대한 분량의 텍스트 말뭉치 수집 및 한국어 음성 언어 처리 기 술 확보가 필수적이다. 이와 같이, 자동 음성 인식을 기반으로 한 AI 콘텐츠 활용 기술은 이미 스마트홈 시장에서 폭넓은 보급이 이루 어졌지만, 잡음, 공간특성 및 사용자 거리 등의 열악한 실제 사용 환경 요인들로 인해 사용자 만족도가 높지 않 고, 그로 인해 잡음 환경에서 임의의 위치에서 발화되는 음성 정보를 최소의 왜곡으로 수음할 수 있는 기술이 필요하다. 기존에는 통상적으로 잡음, 잔향, 공간특성 등으로 인해 왜곡된 신호에 필터를 적용하여 원하는 신호만 통과시 키고, 왜곡 성분을 차단하는 방법을 사용하였으나, 최근 빅데이터를 활용하여 기존의 필터 설계 보다는 직접 목 표 음성신호를 추론생성 하는 심층 신경망 회귀(Regression)방법이 주로 연구되고 있다. 심층신경망 회귀 방법은 기존의 방법들 보다 우수한 성능을 보이며, 전 세계적으로 관련기술 연구개발에 집중하 고 있지만, 아직까지도 자동 음성 인식 기술에서 만족할 만한 성능에는 미치지 못하고 있다. 이는 실사용 공간 의 음향 환경이 공간크기별, AI 스피커 위치별, 사용자 음성 발화 위치별로 음향 특성 경우의 수가 너무 많아 이를 일반화하는 음성인식 DB를 구축하는 것이 매우 어렵기 때문이다."}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위하여, 본 발명의 일 실시예에 따라 로봇청소기와 인공지능 스피커의 연 동을 통해 공간 충격 응답(room impulse response)을 측정하고, 이를 이용하여 대상 공간 내 임의 지점에서 발 화된 사람 음성의 자동 음성 인식에 대한 정확성을 향상시킬 수 있는 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템 및 그 방법을 제공하는 하는 것에 목적이 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기 술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서 본 발명의 일 실시예에 따른, 로봇 청소기를 이용한 인 공지능 스피커의 음성 인식 강화 시스템은, 적어도 하나 이상의 구조물을 포함한 대상 공간에서 2차원 평면 이 동하면서 동시적 위치 추정 및 지도작성(Simultaneous Localization and Mapping, SLAM) 기능을 수행하여 공간 지도를 생성하고, 상기 공간지도에 기초하여 적어도 하나 이상의 공간 충격 응답을 측정하기 위한 적어도 하나 이상의 측정 위치를 결정한 후 기 설정된 주파수 대역의 샘플 측정 신호를 방사하는 로봇 청소기; 및 상기 로봇 청소기와 통신망을 통해 연결되어, 상기 측정 위치별 샘플 측정 신호를 획득하여 저장하고, 저장된 샘플 측정 신호를 이용하여 공간 충격 응답(room impulse response)을 추정하며, 자신의 위치 정보에 기초하여 상기 공간 충격 응답을 음성 데이터베이스에 반영하는 음성 인지도 강화 알고리즘을 수행하고, 상기 음성 데이터베이스에 기초하여 사용자의 발화음성에 대한 음성 인식 결과에 기초하여 음성 컨텐츠를 제공하는 음성인식 알고리즘을 수행하는 인공지능 스피커를 포함하는 것이다. 상기 로봇 청소기와 인공지능 스피커는 음성 강화 애플리케이션을 통해 상호 연동되어 상기 음성 인지도 강화 알고리즘을 수행하는 것이다. 상기 로봇 청소기는, 적어도 하나 이상의 구조물을 포함한 대상 공간에서 2차원 평면을 이동하기 위한 구동수단 을 포함하는 본체; 상기 본체에 구비되어 적어도 하나 이상의 센서를 이용하여 구조물 또는 장애물을 감지하는 장애물 감지부; 상기 SLAM 기능을 통해 상기 대상 공간에 대한 영역을 탐색하여 구조물이 위치한 장애물 영역을 포함하는 공간지도를 생성하는 지도 생성부; 2차원 평면을 기 설정된 간격으로 공간 충격 응답을 측정하기 위한 적어도 하나 이상의 측정 위치로 결정하고, 결정된 측정 위치마다 기 설정된 주파수 대역의 샘플 측정 신호를 방사하는 신호 출력부; 공간 지도에 기반하여 청소 동작을 수행하고, 인공지능 스피커와 연동하여 음성 인 지도 강화 알고리즘의 수행에 필요한 각 구성요소의 동작을 제어하는 제어부; 외부 장치와 유/무선 통신 방식에 의해 상호 연결을 수행하는 통신부; 및 상기 제어부의 제어에 따라 상기 구동수단에 연결된 모터를 구동시켜 상 기 본체의 주행 방향을 결정하는 주행 구동부를 포함하는 것이다. 상기 인공지능 스피커는, 통신망과 연동하여 로봇 청소기 또는 외부 장치와의 송수신을 위한 통신 인터페이스를 제공하는 통신부; 상기 샘플 측정 신호 또는 발화 음성이 입력되는 마이크; 상기 음성 인지도 강화 알고리즘과 음성 인식 알고리즘을 수행하여, 상기 발화음성에 대한 음성 인식 결과에 기초하여 음성 컨텐츠를 제공하는 제 어부; 상기 제어부의 제어에 따라 음성 컨텐츠를 출력하는 스피커; 및 상기 음성 인지도 강화 알고리즘과 음성 인식 알고리즘을 수행하면서 누적되는 데이터를 저장하는 데이터베이스를 포함하는 것이다. 상기 제어부는, 상기 측정 위치별 방사된 샘플 측정 신호를 획득하여 저장하는 방사 소리 녹음 모듈; 상기 방사 소리 녹음 모듈을 통해 저장된 측정 위치별 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하여 저장하는 공 간 충격 응답 추정 모듈; 상기 음성 데이터베이스에 상기 공간 충격 응답 추정 모듈에서 추정된 공간 충격 응답 을 컨벌루션 처리하여 공간 충격 응답이 반영된 음성 데이터베이스를 제공하는 공간 충격 응답 반영 모듈; 상기 음성 데이터베이스에 기초한 심층신경망 기반의 음성 인식 모델을 학습하는 학습 모듈; 및 상기 인공지능 스피 커가 배치된 대상 공간에서 사람의 발화 음성을 획득하고, 획득된 발화음성을 상기 음성 인식 모델에 입력하여 잔향이 제거된 음성 변환을 통해 음성 인식 결과를 출력하는 음성인식 모듈을 포함하는 것이다. 상기 학습 모듈은, 상기 공간 충격 응답이 반영된 음성 데이터베이스에 저장된 음성 데이터를 학습 데이터로 하 고, 잔향이 제거된 음성 데이터베이스를 목표 출력 데이터가 되도록 학습을 수행하는 것이다. 본 발명의 일 실시예에 따른 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 방법은, 로봇 청소기와 인공지능 스피커의 연동을 통한 인공지능 스피커의 음성 인식 강화 방법에 있어서, a) 인공지능 스피커는 음성 인지도 강화 애플리케이션을 통해 상기 로봇 청소기와 연동되는 단계; 및 b) 상기 음성 인지도 강화 애플리케이 션에 의해, 상기 로봇 청소기가 적어도 하나 이상의 구조물을 포함한 대상 공간에서 2차원 평면 이동하면서 동 시적 위치 추정 및 지도작성(Simultaneous Localization and Mapping, SLAM) 기능을 통해 작성된 공간 지도에 기초하여 적어도 하나 이상의 측정 위치를 결정한 후 기 설정된 주파수 대역의 샘플 측정 신호를 방사하는 단계; c) 상기 인공지능 스피커는 측정 위치별 샘플 측정 신호를 획득하여 저장하고, 저장된 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하며, 자신의 위치 정보에 기초하여 상기 공간 충격 응답을 음성 데이터베이스 에 반영하는 음성 인지도 강화 알고리즘을 수행하는 단계; 및 d) 상기 인공지능 스피커는 상기 음성 데이터베이스에 기초하여 사용자의 발화음성에 대한 음성인식 알고리즘을 수행하여, 음성 인식 결과에 기초하여 음성 컨텐 츠를 제공하는 단계를 포함하는 것이다. 상기 c) 단계는, 상기 측정 위치별 방사된 샘플 측정 신호를 획득하여 저장하는 방사 소리 녹음 단계; 상기 방 사 소리 녹음 단계을 통해 저장된 측정 위치별 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하여 저장하는 공간 충격 응답 추정 단계; 상기 음성 데이터베이스에 상기 공간 충격 응답 추정 단계듈에서 추정된 공간 충격 응답을 컨벌루션 처리하여 공간 충격 응답이 반영된 음성 데이터베이스를 제공하는 공간 충격 응답 반영 단계; 및 상기 음성 데이터베이스에 기초한 심층신경망 기반의 음성 인식 모델을 학습하는 학습 단계를 포함하는 것이다. 상기 학습 단계는, 상기 공간 충격 응답이 반영된 음성 데이터베이스에 저장된 음성 데이터를 학습 데이터로 하 고, 잔향이 제거된 음성 데이터베이스를 목표 출력 데이터가 되도록 학습을 수행하는 것이다. 상기 d) 단계는, 상기 인공지능 스피커가 배치된 대상 공간에서 사람의 발화 음성을 획득하고, 획득된 발화음성 을 상기 음성 인식 모델에 입력하여 잔향이 제거된 음성 변환을 통해 음성 인식 결과를 출력하는 것이다. 한편, 본 발명의 일 실시예에 따른 음성 인식이 강화된 인공지능 스피커는, 통신망과 연동하여 로봇 청소기 또 는 외부 장치와의 송수신을 위한 통신 인터페이스를 제공하는 통신부; 상기 로봇 청소기에서 방사되는 샘플 측 정 신호 또는 발화 음성이 입력되는 마이크; 음성 인지도 강화 알고리즘과 음성 인식 알고리즘을 수행하여, 상 기 발화음성에 대한 음성 인식 결과에 기초하여 음성 컨텐츠를 제공하는 제어부; 상기 제어부의 제어에 따라 음 성 컨텐츠를 출력하는 스피커; 및 상기 음성 인지도 강화 알고리즘과 음성 인식 알고리즘을 수행하면서 누적되 는 데이터를 저장하는 데이터베이스를 포함하되, 상기 음성 인지도 강화 알고리즘은, 기 설정된 측정 위치별 샘 플 측정 신호를 획득하여 저장하고, 저장된 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하며, 자신의 위 치 정보에 기초하여 상기 공간 충격 응답을 음성 데이터베이스에 반영하는 것이고, 상기 음성인식 알고리즘은, 상기 음성 데이터베이스에 기초하여 사용자의 발화음성에 대한 음성 인식 결과에 기초하여 음성 컨텐츠를 제공 하는 것이다."}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단에 의하면, 본 발명은 로봇 청소기와 인공지능 스피커가 연동하여 대상 공간에 대한 공간 충격 응답을 추정하여 이를 인공지능 스피커의 음성 데이터베이스에 반영할 수 있고, 이로 인해 사용 자의 음성 발화 방향과 무관하게 음성인식의 정확도를 높일 수 있다. 따라서, 본 발명은 향후 UI/UX를 고려하여 비대면 발화 방향에서의 자동음성인식 기술을 제공할 수 있다."}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 본 명세서에서 ‘단말’은 휴대성 및 이동성이 보장된 무선 통신 장치일 수 있으며, 예를 들어 스마트 폰, 태블 릿 PC 또는 노트북 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치일 수 있다. 또한, ‘단 말’은 네트워크를 통해 다른 단말 또는 서버 등에 접속할 수 있는 PC 등의 유선 통신 장치인 것도 가능하다. 또한, 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷 (WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 블루투스 통신, 적외선 통신, 초음파 통신, 가시광 통신(VLC: Visible Light Communication), 라이파이(LiFi) 등이 포함되나 이에 한 정되지는 않는다. 이하의 실시예는 본 발명의 이해를 돕기 위한 상세한 설명이며, 본 발명의 권리 범위를 제한하는 것이 아니다. 따라서 본 발명과 동일한 기능을 수행하는 동일 범위의 발명 역시 본 발명의 권리 범위에 속할 것이다. 또한, 본 발명의 각 실시예에 포함된 각 구성, 과정, 공정 또는 방법 등은 기술적으로 상호간 모순되지 않는 범 위 내에서 공유될 수 있다. 이하 첨부된 도면을 참고하여 본 발명의 일 실시예를 상세히 설명하기로 한다. 도 2는 본 발명의 일 실시예에 따른 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템을 설명하 기 위한 도면이다. 도 2를 참조하면, 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템은 로봇 청소기 및 인공 지능 스피커가 상호 연동하여, 발화음성에 대한 인지도를 강화하는 것으로서, 사용자 단말이 로봇 청소기 및 인공지능 스피커와 애플리케이션을 통해 연동되어 각각에 제어 명령을 전송하거나, 상태 정보를 수신할 수 있다. 이러한 사용자 단말은 일반적인 의미의 서버용 컴퓨터 본체일 수 있고, 그 외에 제어 기능을 수행할 수 있는 다 양한 형태의 장치로 구현될 수 있다. 구체적으로, 사용자 단말은 통신 모듈(미도시), 메모리(미도시), 프로세서 (미도시) 및 데이터베이스(미도시)를 포함하는 컴퓨팅 장치에 구현될 수 있는데, 스마트폰이나 TV, PDA, 태블릿 PC, PC, 노트북 PC 및 기타 사용자 단말 장치 등으로 구현될 수 있다. 로봇 청소기는 적어도 하나 이상의 구조물을 포함한 대상 공간에서 2차원 평면 이동하면서 동시적 위치 추 정 및 지도작성(Simultaneous Localization and Mapping, SLAM) 기능을 수행하여 공간지도를 생성하고, 공간지 도에 기초하여 적어도 하나 이상의 공간 충격 응답을 측정하기 위한 적어도 하나 이상의 측정 위치를 결정한 후 기 설정된 주파수 대역의 샘플 측정 신호를 방사한다. 인공지능 스피커는 로봇 청소기와 통신망을 통해 연결되어, 측정 위치별 샘플 측정 신호를 획득하여 저장하고, 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하며, 자신의 위치 정보에 기초하여 공간 충격 응 답을 음성 데이터베이스()에 반영하는 음성 인지도 강화 알고리즘을 수행한다. 또한, 인공지능 스피커는 음성 인지도 강화 알고리즘의 수행 결과에 의해 구축된 음성 데이터베이스()에 기초하여 발화음성에 대한 음성 인식 알고리즘을 수행한다. 인공지능 스피커는 음성인식 알고리즘의 수행 결과에 따라, 음악 재생, 날씨,교통, 뉴스, 쇼핑, 정보 검색, 긴급 구조 알림 등의 기능을 수행할 수 있다. 이때, 음성 인지도는 음성의 명로도 또는 이해도를 이르는 말로서, 인공지능 스피커는 DNN(Deep Neural Network, DNN) 기반의 음성 인지도 강화 알고리즘을 수행하여 소음 또는 잔향 환경에서 강인한 음성 인식 성능 을 갖도록 한다. 대부분 인공지능 스피커는 대상 공간의 바닥면으로부터 기 설정된 높이의 평면에 사용자 접근성이 용이한 위치에 배치된다. 대상 공간(예를 들어, 가정집, 학교, 사무실 등)에는 가구, 벽면, 가전기기 등 적어도 하나 이상의 음향차단 구조물이 배치되어 있다. 따라서, 사용자와 인공지능 스피커 사이에 음향차단 구조물이 위치하고 있거나, 사용자가 인공지능 스피커로부터 일정 거리 이상의 멀리 떨어진 발화위치에서 음성 명령 을 전송하면 인공지능 스피커는 해당 음성 명령을 제대로 인식하지 못해 '인식 실패'하게 된다. 그러나, 본 발명에서는 대상 공간의 바닥면(2차원 평면)을 이동하는 로봇 청소기를 이용하여 인공지능 스피커 는 공간 충격 응답을 추정할 수 있고, 이렇게 추정된 공간 충격 응답을 반영하여 음성 DB를 구축함으 로써 음향차단 구조물이나 사용자의 발화 위치에 상관없이 사용자의 음성 명령에 대한 '인식 성공'의 확률이 매 우 높아지게 된다. 따라서, 기존의 인공지능 스피커는 음성발화방향이 음성인식 마이크로폰을 향하는 대면(對面) 조건을 전제하고 있지만, 본 발명의 인공지능 스피커는 사용자의 음성발화방향과는 무관한, 즉 비대면발화 방향에서의 음성 인식성능을 확보할 수 있다. 이러한 로봇 청소기와 인공지능 스피커는 음성 강화 애플리케이션을 통해 상호 연동되어 음성 인지도 강화 알고리즘을 수행하기 위해 필요한 동작을 수행한다. 이때, 사용자 단말은 음성 강화 애플리케이션을 통해 스마트홈 기기(로봇 청소기, 인공지능 스피커 등)를 제어할 수 있다. 도 3은 본 발명의 일 실시예에 따른 로봇 청소기의 구성을 설명하는 블록도이다. 도 3에 도시된 바와 같이, 로봇 청소기는 본체, 장애물 감지부, 지도 생성부, 신호 출력부 , 제어부, 메모리, 통신부, 주행 구동부, 전원부를 포함하지만 이에 한정되지 않는다. 본체는 적어도 하나 이상의 구조물을 포함한 대상 공간에서 2차원 평면을 이동하기 위한 구동수단을 포함한다. 장애물 감지부는 본체에 구비되어 적어도 하나 이상의 센서를 이용하여 대상 공간 내 구조물 뿐만 아 니라 문턱 등의 클리프(cliff)을 감지한다. 이때, 장애물 감지부는 이미지 센서, 라이다 센서, 속도 센서, 장애물 인식 센서, 추락 방지 센서, 범핑 센서, 초음파 센서, 근접 센서, 기울임 센서(자이로 센서), 먼지 센서 등 각종 센서가 탭재될 수 있다. 지도 생성부는 SLAM 기능을 통해 대상 공간에 대한 영역을 탐색하여 구조물 또는 장애물이 위치한 장애물 영역을 포함하는 공간지도를 생성한다. 여기서, SLAM 기능이 탑재된 로봇 청소기는 구동수단(예를 들어, 바퀴) 회전수와 카메라를 포함한 이미징 센서에서 가져온 데이터를 사용하여 위치 추정을 통해 필요한 이 동량을 파악할 수 있고, 라이다 센서 등의 각종 센서를 동시에 사용하여 주변 환경의 장애물이나 구조물의 위치 를 나타내는 공간 지도를 생성하여, 동일 구역을 여러번 청소하는 경우를 방지할 수 있다. 신호 출력부는 2차원 평면을 일정한 간격, 예를 들어 30cm 정도로 공간 충격 응답을 측정하기 위한 적어도 하나 이상의 측정 위치로 결정하고, 측정 위치마다 기 설정된 주파수 대역의 샘플 측정 신호를 방사한다. 이때, 신호 출력부는 기 설정된 격자 단위로 이동하는 로봇 청소기가 이동중에 측정 위치에 도달하면 30° 방위각 간격으로 전방향에 결쳐 정현파 스윕 신호(sine sweep signal)를 샘플 측정 신호로 방사할 수 있다. 제어부는 공간 지도에 기반하여 청소 동작을 수행하고, 인공지능 스피커와 연동하여 음성 인지도 강 화 알고리즘의 수행에 필요한 각 구성요소의 동작을 제어한다. 메모리는 로봇 청소기의 청소 동작과 음성 인지도 강화 알고리즘을 수행하기 위한 프로그램이 기록되 고, 상태 정보, 위치 정보, 청소 모드 등 각종 정보가 저장된다. 또한, 메모리는 제어부가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기능을 수행한다. 통신부는 외부 장치(사용자 단말, 인공지능 스피커 등)와 유/무선 통신 방식에 의해 상호 연결을 수행할 수 있는데, TCP/IP, 블루투스, 적외선 신호 및 ZigBee 규격 중에서 선택된 어느 하나의 방법으로 연결될 수 있다. 통신부는 사용자 단말로부터 청소지도, 청소 영역, 위치 정보, 장애물 정보 및 청소 모드 등의 제어 명령을 수신할 수 있다. 주행 구동부는 제어부의 제어에 따라 구동수단에 연결된 모터(미도시)를 구동시켜 로봇 청소기 가 전진, 후진, 좌측 또는 우측으로 선회하는 동작을 제어하여 본체의 주행 방향을 결정한다. 전원부는 로봇 청소기가 이동하고, 청소를 수행하는데 따른 동작 전원을 공급한다. 또한, 전원이 부 족한 경우에 로봇 청소기가 별도로 구비되는 충전대(미도시)에 도킹(docking)될 수 있다. 그리고, 전원부 의 전원 공급 수단은 충전대에서 충전 전류를 공급받아 충전될 수 있다. 로봇 청소기는 복수의 버튼, 복수의 LED, 터치패널, 먼지 흡입을 위해 흡입력을 제공하는 흡입유닛, 흡입구 및 먼지통, 걸레가 부착되는 걸레판, 걸레판의 회전구동수단, 물공급수단, 스팀발생수단 등을 더 포함할 수 있다. 도 4는 본 발명의 일 실시예에 따른 인공지능 스피커의 구성을 설명하는 블록도이고, 도 5는 본 발명의 일 실시 예에 따른 제어부가 로봇 청소기를 이용한 음성 인식 강화 방법을 수행하기 위한 프로그램을 설명하는 도면이다. 도 6는 종래 기술의 일 실시예에 따른 Wave U-Net 구조를 설명하는 도면이고, 도 7은 본 발명의 일 실시예에 따른 Nested Wave U-Net 구조의 음성 인식 모델을 설명하는 도면이다. 도 4 및 도 5를 참조하면, 인공지능 스피커는 통신부, 마이크, 스피커, 제어부, 메모 리, 전원부 및 데이터베이스를 포함하지만 이에 한정되지는 않는다. 통신부는 통신망과 연동하여 로봇 청소기 또는 사용자 단말 간의 송수신 신호를 패킷 데이터 형태로 제공하는 데 필요한 통신 인터페이스를 제공한다. 나아가, 통신부은 사용자 단말로부터 데이터 요청을 수 신하고, 이에 대한 응답으로서 데이터를 송신하는 역할을 수행할 수 있다. 여기서, 통신부는 다른 네트워 크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프트웨어를 포함하는 장치일 수 있다. 마이크는 샘플 측정 신호 또는 발화 음성이 입력되고, 스피커는 발화음성에 대한 음성 인식 결과에 기초하여 음악 감상, 정보 검색 등의 음성 컨텐츠를 출력한다. 제어부230()는 음성 인지도 강화 알고리즘과 음성 인식 알고리즘을 수행하여, 음성 DB에 기초하여 발화음 성에 대한 음성 인식 결과의 음성 컨텐츠를 제공한다. 도 5에 도시된 바와 같이, 제어부는 로봇 청소기를 이용한 음성 인식 강화 방법을 수행하기 위해, 방사 소 리 녹음 모듈, 공간 충격 응답 추정 모듈, 공간 충격 응답 반영 모듈, 학습 모듈, 음성인 식 모듈을 포함하여 이루어진다. 방사 소리 녹음 모듈은 측정 위치별 방사된 샘플 측정 신호를 획득하여 저장한다. 공간 충격 응답 추정 모듈은 측정 위치별로 녹음된 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하여 저장한다. 일반적으로 충격 응답(impulse response)은 어떤 하나의 회로와 장치에 대하여 임펄스 형태로 입력이 전달된 경우, 이러한 회로와 장치에서 발생하게 되는 응답 신호, 즉 잡음과 같은 단위 충격파에 의하여 반응하 게 되는 장치의 응답 신호를 의미한다. 공간 충격 응답(Room Impulse Response, RIR)은 인공지능 스피커와 발화 위치간의 거리, 대상 공간의 공간 구조 에 대한 다양한 잔향 환경을 반영하여 측정할 수 있고, 하기 수학식 1로 나타낼 수 있다. [수학식 1]"}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "공간 충격 응답 반영 모듈은 음성 DB에 공간 충격 응답을 컨벌루션 처리하여 해당 공간 충격 응답이 반영 된 음성 DB를 구축한다. 대상 공간에서의 음성 전송 성능에 대한 주관적 평가값은 S/N비와 잔향시간에 의해 크게 영향을 받는 것으로 알려져 있다, 이때, 잔향 시간(reverberation time)은 공간 음향 특성을 나타내는 척도 중에서 거시적이고 가장 기본이 되는 데이터로서 공간 충격 응답으로 산출될 수 있다. 잔향 시간 측정 방법은 핑크 잡음이나 음악을 이용한 FFT(Fast Fourier Transformation) 측정 기법, MLS(Maximum Length Sequence) 신 호를 이용한 측정 기법, 충격성 음원(풍선, 피스톨 등)을 발생시켜 분석하는 기법 등이 있지만, 본 발명에서는 주파수가 지수 함수적으로 변하는 사인 신호인 정현파 스윕 신호를 이용하여 측정한다. 즉, 비선형성이나 외란 등에 강인한 사인 스윕 신호(샘플 측정 신호)를 대상 공간 내에서 재생하고, 인공지능 스피커에서 사인 스윕 신 호를 녹음한 후 이 측정 결과를 역컨볼루션처리하여 선형 특성의 공간 임펄스 응답을 구할 수 있다. 공간 충격 응답 반영 모듈은 음성 DB 내 음성 신호(x[n])와 공간 충격 응답(h[n])을 컨벌루션하여 결과 신 호[y[n]]을 하기 수학식 2 및 수학식 3와 같이 계산할 수 있다. 즉, 공간 충격 응답 반영 모듈은 대상 공 간의 공간 충격 응답을 이용하여 잔향 시간(또는 잔향 효과)를 구하기 위해 음성 DB내 음성 신호와 공간 충격 응답의 컨볼루션 연산을 수행해야 하는데, 음성 신호와 같이 연속적으로 입력되는 신호를 처리하기 위해 블록 컨볼루션 또는 분할 컨볼루션 방법을 많이 사용한다. 본 발명에서는 입력 신호를 더 작은 블록으로 나누어서 각 블럭을 푸리에 변환을 이용하여 처리하고, 출력 신호를 종합하는 연산과정을 수행한다. [수학식 2]"}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[수학식 3]"}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3에서, p= r+s 이며, Y[k], X[k], H[k]는 각 y[n], x[n], h[n]의 주파수 영역 표현이다. 이렇게 각 결 과 신호 블록 안에서의 계산이 수행된 후 이를 Overlap-save 방법으로 적절히 배열하면 컨벌루션된 결과 신호를 얻게 되고, 결과 신호의 음질 왜곡을 최소화할 수 있다. 학습 모듈은 심층신경망 기반의 음성 인식 모델을 학습한다. 심층신경망은 입력계층과 출력 계층 사이에 복수개의 은닉 계층들로 이루어진 인공신경망으로서, 많은 데이터 속에서 복잡한 비선형 관계를 모델링할 수 있 다. 인공지능 스피커는 자체적으로 공간특성이 최소화된 무잔향, 즉 잔향이 제거된 음성 DB를 이용하는데, 학 습 모듈은 공간 충격 응답이 반영된 음성 DB에 저장된 데이터를 학습 데이터로 하고, 잔향이 제거된 음성 DB를 목표 출력 데이터가 되도록 학습을 수행한다. 음성인식 모듈은 인공지능 스피커가 배치된 대상 공간의 임의 지점에서 사람의 발화 음성을 획득하고, 획득된 발화음성을 음성 인식 모델에 입력하여 잔향이 제거된 음성 변환을 통해 음성 인식 결과를 출 력한다. 이때, 음성 DB에 기초한 음성 인식 모델은 End-to-End 방식의 Fully-Convolutional Network 기반 모델인 U-Net 의 딥러닝 구조를 사용하여 알고리즘을 구성하고 있지만, 은닉층의 연결 구조를 달리함에 따라 VGGnet, GoogLeNet, ResNet, DenseNet, fully convolutional network, AlexNet 등 다양한 구조의 딥러닝을 사용할 수 있다. 특히, 음성 인식 모델은 음성 데이터 추출을 위해 Nested wave U-Net을 사용하여 잔향과 음성이 혼합된 오디오 데이터에 2개의 잔향 데이터와 음성 데이터를 나누게 된다. 도 6에 도시된 바와 같이, 기존의 Wave U-Net은 1D Convolution 모듈과 다운샘플링(downsampling) 모듈이 연속 으로 구성되어 앞쪽의 특징 맵 크기가 줄어드는 수축 단계(Contracting Path)을 수행하고, 업샘플링 (upsampling) 모듈의 연속 과정으로 뒤쪽의 특징 맵 크기를 다시 늘려주는 팽창 단계(Expanding Path)을 수행한 다. 이때, 1D Convolution 모듈을 통해서 시간 도메인(Time domain)에서 많은 하이레벨 특징 맵(High-level features map)을 추출해 내고, 다운 샘플링을 하며 시간 단계에 대해 특정한 패턴을 따르며 시간 샘플(time sample)들을 무시하여 시간 분해능(Time resolution)을 절반으로 줄이게 된다. 그러나, 도 7에 도시된 바와 같이, 본 발명의 음성 인식 모델에 적용되는 Nested wave U-Net 구조는 아래로 향 하는 경로인 수축 단계와 위로 향하는 경로인 팽창 단계로 이루어져 수축 단계에서 입력 데이터에 대한 고차원 정보를 포착하고, 팽창 단계에서 세밀한 지역화(localization)를 진행한다. 이때, Nested wave U-Net 구조는 기 존의 Wave U-Net 구조와 다르게, 업샘플링 단계마다 각 단계에 해당하는 수축 단계(contracting path)의 특징 맵을 가져와 뒤로 이어 붙이게 되는데(concate), 특징 맵의 크기를 맞추기 위해 팽창 단계의 특징 맵의 크기에 맞춰 수축 단계의 특징맵을 적당한 크기로 crop(잘라냄)한 후 concat(붙임)하는 방식으로 음성 데이터의 정보를 유지하고 있다. 이와 같이, 음성 인식 모델은 Nested wave U-Net 구조를 이용하여 잡음 환경의 음성 데이터에서 잔향을 제거하 고 깨끗한 음질의 음성 데이터를 추출할 수 있다. 상술한 모듈들은 본 발명을 설명하기 위한 일 실시예일 뿐, 이에 한정되지 않고 다양한 변형으로 구현될 수 있 다. 또한, 상술한 모듈들은 제어부에 의해 제어될 수 있는 컴퓨터로 판독 가능한 기록매체로서 메모리 에 저장된다. 또한, 제어부(230의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구현될 수 있으며, 하나 이상의 기능을 수행하기 위한 모듈, 프로그램, 루틴, 명령어 세트 또 는 프로세스를 포함할 수 있다. 다시 도 4를 설명하면, 메모리는 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 방법을 수행하 기 위한 프로그램이 기록된다. 여기서, 메모리()는 휘발성 저장 매체(volatile storage media) 또는 비휘발성 저장 매체(non-volatile storage media)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 전원부는 인공지능 스피커의 동작에 필요한 구동 전원을 제공한다. 데이터베이스는 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 방법을 수행하면서 누적되는 데 이터, 샘플측정신호, 학습데이터, 측정위치별 공간 충격 응답 정보 뿐만 아니라 적어도 1개국 이상의 언어에 대 한 방대한 단어의 어휘를 저장하는 음성 DB 등이 저장된다. 도 8은 본 발명의 일 실시예에 따른 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 방법을 설명하는 순서도이다. 도 8을 참조하면, 인공지능 스피커는 음성 인지도 강화 애플리케이션을 통해 로봇 청소기와 연동되고, 기 설정된 주기마다 음성 인지도 강화 애플리케이션에 의해 로봇 청소기가 공간 지도에 기초하 여 설정된 측정 위치에서 기 설정된 주파수 대역의 샘플 측정 신호를 방사하게 된다. 따라서, 인공지능 스피커는 로봇 청소기로부터 방사되는 측정 위치별 샘플 측정 신호를 획득하여 저 장하고(S1, S2), 저장된 샘플 측정 신호를 이용하여 공간 충격 응답을 추정하여 저장한다(S3). 인공지능 스피커는 자신의 위치 정보에 기초하여 공간 충격 응답을 음성 데이터베이스에 반영한다(S4). 인공지능 스피커는 대상 공간의 임의 지점에서 사용자의 음성 발화가 감지되면(S5), 음성 데이터베이스에 기초하여 사용자의 발화음성에 대한 음성인식 알고리즘을 수행하여, 음성 인식 결과에 기초하여 음성 컨텐츠를 제공한다(S6) 한편, 도 8의 단계 S1 내지 S6은 본 발명의 구현예에 따라서 추가적인 단계들로 분할되거나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계간의 순서가 변경될 수도 있다. 이상에서 설명한 본 발명의 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행 가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 이러한 기록 매체는 컴퓨터 판독 가능 매체를 포함 하며, 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘 발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 포 함하며, 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정 보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함 한다."}
{"patent_id": "10-2021-0177220", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2021-0177220", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일반적인 음성인식 엔진을 이용한 음성 대화 서비스를 제공하는 과정을 설명하는 도면이다. 도 2는 본 발명의 일 실시예에 따른 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 시스템을 설명하 기 위한 도면이다. 도 3은 본 발명의 일 실시예에 따른 로봇 청소기의 구성을 설명하는 블록도이다. 도 4는 본 발명의 일 실시예에 따른 인공지능 스피커의 구성을 설명하는 블록도이다. 도 5는 본 발명의 일 실시예에 따른 제어부가 로봇 청소기를 이용한 음성 인식 강화 방법을 수행하기 위한 프로 그램을 설명하는 도면이다. 도 6는 종래 기술의 일 실시예에 따른 Wave U-Net 구조를 설명하는 도면이다. 도 7은 본 발명의 일 실시예에 따른 Nested Wave U-Net 구조의 음성 인식 모델을 설명하는 도면이다. 도 8은 본 발명의 일 실시예에 따른 로봇 청소기를 이용한 인공지능 스피커의 음성 인식 강화 방법을 설명하는 순서도이다."}
