{"patent_id": "10-2015-0113972", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0019745", "출원번호": "10-2015-0113972", "발명의 명칭": "생체 정보 검출 방법 및 그 방법을 처리하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "정기성"}}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,하우징;상기 하우징의 일부에 결합되고, 사용자의 신체의 일부에 착탈가능하게 부착되는 결착구;상기 전자 장치의 움직임을 감지할 수 있도록 구성된 적어도 하나의 제1 센서;상기 사용자의 신체의 변화를 감지할 수 있도록 구성된 적어도 하나의 제2 센서;메모리; 및상기 적어도 하나의 제1 센서, 상기 적어도 하나의 제2 센서, 및 상기 메모리와 전기적으로 연결된 프로세서를포함하고,상기 메모리는, 실행 시에, 상기 프로세서가,상기 적어도 하나의 제1 센서를 이용하여 상기 전자 장치가 상기 사용자의 신체의 일부에 착용되었는지 여부를판단하고,상기 전자 장치가 상기 사용자의 신체의 일부에 착용된 시점으로부터 선택된 제1 시간 주기(a first period oftime)를 경과하는 시점 바로 전(immediately before) 및/또는 바로 후(immediately after)의 제2 시간 주기 동안에 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움직임에 관한 정보를획득하고,상기 움직임에 관한 정보에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화하도록 하는 인스트럭션들을 저장하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제2 시간 주기는, 상기 제1 시간 주기보다 짧은 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 적어도 하나의 제2 센서는, 생체 센서를 포함하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 생체 센서는, 심박 센서, 혈압 센서, 심전도 센서, 피부 수분도 센서, 또는 산소포화도 센서 중 적어도 하나를 포함하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2017-0019745-3-제1항에 있어서, 상기 인스트럭션들은, 상기 프로세서가,상기 움직임에 관한 정보가 선택된 조건을 만족하지 않는 경우, 상기 제2 시간 주기를 경과하는 시점 바로 후의, 상기 제1 시간 주기 보다 짧은 제3 시간 주기 동안에, 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움직임에 관한 추가 정보를 획득하고,상기 추가 정보의 적어도 일부에 더 기초하여, 상기 적어도 하나의 제2 센서를 활성화하도록 하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 제2 시간 주기 또는 상기 제3 시간 주기 중 적어도 하나는 상기 제1 시간 주기를 경과하는 시점을 포함하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 제2 시간 주기는 상기 제1 시간 주기를 경과하는 시점을 포함하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 인스트럭션들은, 상기 프로세서가,상기 활성화된 제2 센서로부터 데이터를 선택된 시간 내에 수신하지 않은 경우,상기 선택된 시간이 경과한 후에, 상기 제2 센서를 다시 활성화하도록 하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 인스트럭션들은, 상기 프로세서가,상기 선택된 시간이 경과하는 시점 전의 상기 제2 시간 주기와 실질적으로 동일한 시간 주기 동안에, 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움직임에 관한 추가 정보를 획득하고,상기 추가 정보에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 다시 활성화하도록 하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 인스트럭션들은, 상기 프로세서가,상기 적어도 하나의 제1 센서 또는 상기 적어도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하고,상기 획득된 데이터에 적어도 일부 기초하여 상기 제1 시간 주기 및/또는 제2 시간 주기 및/또는 제3 시간 주기공개특허 10-2017-0019745-4-를 변경하도록 하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 인스트럭션들은, 상기 프로세서가,상기 적어도 하나의 제1 센서 또는 상기 적어도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하고,상기 데이터에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화하도록 하는 적어도 하나의 조건을변경하도록 하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 상기 인스트럭션들은, 상기 프로세서가,상기 적어도 하나의 제1 센서 또는 상기 적어도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하고,상기 데이터에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화시키는 시간 주기 또는 샘플링 비율 중 적어도 하나를 변경하도록 하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "적어도 하나의 제1 센서를 이용하여 전자 장치가 사용자의 신체의 일부에 착용되었는지 여부를 판단하는 동작;상기 전자 장치가 상기 사용자의 신체의 일부에 착용된 경우, 선택된 시간 주기(a period of time)를 경과하는시점에서 상기 선택된 시간 범위 내에 측정된 전자 장치의 움직임의 적어도 일부에 기반하여 적어도 하나의 제2센서를 활성화하는 동작; 및상기 적어도 하나의 제2 센서를 통하여 상기 사용자의 생체 정보를 측정하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 적어도 하나의 제1 센서는, 근접센서, 자이로 센서, 지자기 센서 또는 가속도 센서 중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서, 상기 움직임의 적어도 일부가 선택된 조건을 만족하지 않는 경우, 상기 제2 센서를 활성화하지 않고,상기 시간 주기를 경과하는 시점부터 선택된 시간 동안 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여상기 전자 장치의 움직임에 관한 추가 정보를 획득하는 동작; 및상기 추가 정보에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화하도록 하는 동작을 포함하는방법."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2017-0019745-5-제15항에 있어서,상기 움직임에 관한 추가 정보를 획득하는 동작은,상기 적어도 하나의 제1 센서 또는 상기 적어도 하나의 제2 센서 중 적어도 하나로부터 획득된 데이터에 기반하여 상기 추가 정보를 획득하는 선택된 시간을 변경하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서,상기 적어도 하나의 제2 센서에 기반하여 생체 정보를 측정하는 동작은,상기 생체 정보의 측정이 실패하면, 실패횟수를 누적하는 동작; 및상기 누적된 실패횟수가 선택된 조건을 만족하면 상기 제2 센서를 비활성화하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서, 상기 적어도 하나의 제2 센서에 기반하여 생체 정보를 측정하는 동작은,상기 사용자의 신체 특성 또는 상태에 대한 데이터를 획득하는 동작; 및상기 데이터에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화하도록 하는 적어도 하나의 조건을변경하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서, 상기 적어도 하나의 제2 센서에 기반하여 생체 정보를 측정하는 동작은,상기 적어도 하나의 제1 센서 또는 상기 적어도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하는동작; 및상기 데이터에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 작동활성화하도록 하는 적어도 하나의 조건을 변경하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113972", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "사용자의 신체에 대한 전자 장치의 근접 여부를 판단하는 동작;상기 전자 장치가 상기 사용자의 신체의 일부에 근접한 경우, 선택된 주기를 경과하는 시점으로부터 선택된 시간 범위 내에, 적어도 하나의 제1 센서를 이용하여 상기 전자 장치의 움직임에 관한 정보를 획득하는 동작; 및상기 움직임에 관한 정보에 적어도 일부 기초하여, 적어도 하나의 제 2 센서를 통하여 상기 사용자의 생체 정보를 획득하는 동작을 실행시키기 위한 프로그램을 기록한 컴퓨터 판독 가능한 기록매체."}
{"patent_id": "10-2015-0113972", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 배터리 소모를 줄이면서 생체 정보를 검출하기 위한 장치에 관한 것으로, 하우징, 상기 하우징의 일부 에 결합되고, 사용자의 신체의 일부에 착탈가능하게 부착되는 결착구, 상기 전자 장치의 움직임을 감지할 수 있 도록 구성된 적어도 하나의 제 1 센서, 상기 사용자의 신체의 변화를 감지할 수 있도록 구성된 적어도 하나의 제 (뒷면에 계속)"}
{"patent_id": "10-2015-0113972", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 전자 장치에 관한 것으로서, 예를 들면, 생체 정보 검출을 위한 장치 및 방법에 관 한 것이다."}
{"patent_id": "10-2015-0113972", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 동일하거나 좀더 다양한 기능을 수행하면서 점차 소형화되고 슬림화되어 휴대하기 용이한 방향으로 발전하고 있다. 이러한 소형 전자 장치들은 일반적으로 사용자의 주머니 등에 수납되어 휴대하기도 하지만, 손 목에 착용하거나, 인체의 두부(head portion) 또는 팔에 착용하기도 한다. 더하여, 전자 장치는 개인이 관리하는 생체 정보(예: 건강 데이터)를 측정하기 위하여 생체 센서(예: 건강 감지 센서(health care sensor))들을 탑재할 수 있다. 예를 들어, 생체 정보는 혈압(blood pressure), 심박(heart rate), 심전도(electrocardiogram), 피부수분도(skin moisture), 또는 산소포화도(saturation of peripheral oxygen) 등을 포함할 수 있다."}
{"patent_id": "10-2015-0113972", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는 생체 정보(예: 심박수)를 측정하기 위해 생체 센서(예: 심박 센서)를 작동시킬 수 있다. 생체 센서 의 구동은 전자 장치의 배터리를 소모시키는 요소가 될 수 있다. 이에 따라, 전자 장치에서 장시간 동안(예: 사 용자가 전자 장치를 착용하고 있는 시간 동안) 생체 정보를 측정하기 어려울 수 있다. 다른 예로, 전자 장치가 사용자의 생체 정보를 측정하는 경우, 전자 장치의 움직임에 따라서 생체 정보의 측정 이 불가하거나 측정된 생체 정보의 정확도가 떨어질 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치 및 방법은 선택된(또는, 지정된) 조건에 기반하여 생체 센서를 선택 적으로 동작시킬 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치 및 방법은 선택된(또는, 지정된) 주기에 따라서 생체 센서를 지속적 (예: 주기적(예: 약 1분 간격))으로 동작시킬 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치 및 방법은 전자 장치의 움직임에 기반하여 생체 정보를 측정할 수 있다."}
{"patent_id": "10-2015-0113972", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따른 전자 장치는 하우징, 상기 하우징의 일부에 결합되고, 사용자의 신체의 일부에 착탈가능 하게 부착되는 결착구, 상기 전자 장치의 움직임을 감지할 수 있도록 구성된 적어도 하나의 제1 센서, 상기 사 용자의 신체의 변화를 감지할 수 있도록 구성된 적어도 하나의 제2 센서, 메모리 및 상기 제1 센서, 상기 제2 센서, 및 상기 메모리와 전기적으로 연결된 프로세서를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 적어도 하나의 제1 센서를 이용하여 상기 전자 장치가 상기 사용자의 신체의 일부에 착용되었는지 여부를 판단하고, 상기 전자 장치가 상기 사용자의 신체의 일부에 착용된 시점으로부터 선택된(또는, 지정된) 제1 시간 주기 (a first period of time)를 경과하는 시점 바로 전(immediately before) 및/또는 바로 후(immediately after)의, 상기 제1 시간 주기보다 짧은 제2 시간 주기 동안에, 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움직임에 관한 정보를 획득하고, 상기 움직임에 관한 정보에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하도록 하는 인스트럭션들을 저장할 수 있다. 다양한 실시예에 따른 전자 장치의 생체 정보 측정 방법은 적어도 하나의 제1 센서를 이용하여 전자 장치가 사 용자의 신체의 일부에 착용되었는지 여부를 판단하는 동작, 상기 전자 장치가 상기 사용자의 신체의 일부에 착 용된 시점으로부터 선택된(또는, 지정된) 제1 시간 주기(a first period of time)를 경과하는 시점까지 측정된 전자 장치의 움직임의 적어도 일부에 기반하여 적어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하는 동작 및 상기 적어도 하나의 제2 센서에 기반하여 생체 정보를 측정하는 동작을 포함할 수 있다."}
{"patent_id": "10-2015-0113972", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르는 전자 장치 및 방법은, 예를 들면, 선택된(또는, 지정된) 조건에 기반하여 생 체 센서를 선택적으로 동작시킬 수 있는 바, 배터리 소모를 줄이면서 생체 정보를 측정할 수 있다. 본 발명의 다양한 실시예에 따르는 전자 장치 및 방법은, 예를 들면, 선택된(또는, 지정된) 주기에 따라서 생체 센서를 동작시킬 수 있는 바, 생체 정보를 지속적으로 측정할 수 있다. 또한, 본 발명의 다양한 실시예에 따르는 전자 장치 및 방법은, 예를 들면, 전자 장치의 움직임을 측정하고, 측 정된 움직임에 기반하여 선택적으로 사용자의 생체 정보를 측정할 수 있는 바, 측정된 생체 정보의 정확도를 개 선할 수 있다."}
{"patent_id": "10-2015-0113972", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 개시를 특정한 실시 형태 에 대해 한정하려는 것이 아니며, 본 개시의 실시예의 다양한 변경(modification), 균등물(equivalent), 및/또 는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해 서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, “가진다”, “가질 수 있다”, “포함한다” 또는 “포함할 수 있다” 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, “A 또는 B”, “A 또는/및 B 중 적어도 하나” 또는 “A 또는/및 B 중 하나 또는 그 이상”등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, “A 또는 B”, “ A 및 B 중 적 어도 하나” 또는 “ A 또는 B 중 적어도 하나”는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 다양한 실시예에서 사용된 “제 1”, “제 2”, “첫째” 또는 “둘째”등의 표현들은 다양한 구성요소들을, 순 서 및/또는 중요도에 상관없이 수식할 수 있고, 해당 구성요소들을 한정하지 않는다. 상기 표현들은 한 구성요 소를 다른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순 서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 개시의 권리 범위를 벗어 나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 “~하도록 구성된(또는 설정된)(configured to)”은 상황에 따라, 예를 들면, “~에 적합한(suitable for)”, “~하는 능력을 가지는(having the capacity to)”, “~하도록 설계된(designed to) ”, “~하도록 변경된(adapted to)”, “~하도록 만들어진(made to)” 또는 “~를 할 수 있는(capable of)”과 바꾸어 사용될 수 있다. 용어 “~하도록 구성(또는 설정)된”은 하드웨어적으로 “특별히 설계된(specifically designed to)”것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, “~하도록 구성된 장치”라는 표 현은, 그 장치가 다른 장치 또는 부품들과 함께 “~할 수 있는” 것을 의미할 수 있다. 예를 들면, 문구 “A, B, 및 C를 수행하도록 구성(또는 설정)된 프로세서”는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수 행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시의 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전에 정 의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따 라서, 본 문서에서 정의된 용어일지라도 본 개시의 실시예들을 배제하도록 해석될 수 없다. 본 개시의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 전자 장치는 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상 전화기, 전자북 리더기(e-book reader), 데 스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 스마트 안경, 머리 착용형 장치(head-mounted-device(HMD)), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리 (appcessory), 전자 문신, 스마트 미러, 또는 스마트 와치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에서, 전자 장치는 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예 를 들면, 텔레비전, DVD(digital versatile disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인 지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널(security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중적어도 하나를 포함할 수 있다. 다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트 (infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller’s machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things)(예: 전구, 각종 센서, 전 기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동 기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 개시의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전 자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1을 참조하여, 다양한 실시예에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이 및/또는 통신 인터페이 스를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는 구성요소들 중 적어도 하나를 생략하거나 다 른 구성 요소를 추가적으로 구비할 수 있다. 버스는 예를 들면, 구성요소들(120 내지 170)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및 /또는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는 중앙처리장치(central processing unit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨어 , 어플리케이션 프로그래밍 인터페이스(application programming interface(API)) 및/또는 어플리케 이션 프로그램(또는 “어플리케이션”) 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일부는, 운영 시스템(operating system(OS))라 불릴 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로 그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주고 받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신 된 작업 요청들과 관련하여, 예를 들면, 어플리케이션 프로그램 중 적어도 하나의 어플리케이션에 전자 장 치의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또는 로드 밸런싱)을 수행할 수 있다. API는 예를 들면, 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페이 스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장치 의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력 할 수 있다. 디스플레이는 예를 들면, 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오드 (OLED) 디스플레이, 또는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는 예를 들면, 사용자에게 각종 콘 텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등)를 표시할 수 있다. 디스플레이는 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 통신 인터페이스는 예를 들면, 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외부 전 자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또 는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신은, 예를 들면, 셀룰러 통신 프로토콜로서, 예를 들면, LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro, 또는 GSM 등 중 적어도 하나를 사용할 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 통신 네트워크(telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치, 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 한 실시예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치, , 또는 서버)에서 실행될 수 있다. 한 실시예에 따르면, 전자 장치가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스 를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치 , , 또는 서버)에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치, , 또는 서버 )는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치 는 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하 여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 2는 다양한 실시예에 따른 전자 장치의 블록도이다. 전자 장치는 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 어플리케이션 프로세서(AP: application processor), 통신 모듈, SIM(subscriber identification module) 카드, 메모리 , 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈 , 전력 관리 모듈, 배터리, 인디케이터 및 모터를 포함할 수 있다. AP는 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 AP에 연결된 다수의 하드웨어 또는 소프 트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. AP는 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시예에 따르면, AP는 GPU(graphic processing unit) 및/또 는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. AP는 도 2에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. AP는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈은, 도 1의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를 들면, 셀룰러 모듈, WIFI 모듈, BT 모듈, GPS 모듈, NFC 모듈 및 RF(radiofrequency) 모듈을 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈 은 AP가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. WIFI 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 각각은, 예를 들면, 해당하는 모듈을 통해 서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시예에 따르면, 셀룰러 모듈, WIFI 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜시 버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또는 안테나 등을 포함할 수 있다. 다른 실시예에 따르면, 셀룰러 모듈, WIFI 모듈, BT 모듈, GPS 모 듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. SIM 카드는, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 도 1의 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있 다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), 또는 메모리 스틱(memory stick) 등 을 더 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 전자 장치와 기능적으로 및/또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(240A), 자이로 센서(240B), 기 압 센서(240C), 마그네틱 센서(240D), 가속도 센서(240E), 그립 센서(240F), 근접 센서(240G), color 센서 (240H(예: RGB(red, green, blue) 센서)), 생체 센서(240I), 온/습도 센서(240J), 조도 센서(240K), 또는 UV(ultra violet) 센서(240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈 은, 예를 들면, 후각 센서(E-nose sensor), EMG 센서(electromyography sensor), EEG 센서 (electroencephalogram sensor), ECG 센서(electrocardiogram sensor), IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시예에서는, 전자 장치는 AP의 일부로서 또는 별도로, 센서 모듈 을 제어하도록 구성된 프로세서를 더 포함하여, AP가 슬립(sleep) 상태에 있는 동안, 센서 모듈(24 0)을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel, (디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정전 식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 초 음파 신호를 발생하는 입력 도구를 통해, 전자 장치에서 마이크(예: 마이크)로 음파를 감지하여 데이 터를 확인할 수 있다.디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 또는 프로젝터를 포함할 수 있 다. 패널은, 도 1의 디스플레이와 동일 또는 유사한 구성을 포함할 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널 은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예 를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 디스플레이는 패널 , 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)을 포함할 수 있다. 인 터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적 으로, 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure digital) 카 드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈 은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래쉬 (flash)(예: LED 또는 xenon lamp)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시예에 따르면, 전력 관리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터 리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무 선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터 리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리 는, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터는 전자 장치 혹은 그 일부(예: AP)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상 태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있고, 진동 (vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어 플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시예에서, 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 다양한 실시예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체 (entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 도 3은 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 다양한 실시예에 따르면, 프로그램 모듈 (예: 도 1의 프로그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영 체제 (operating system(OS)) 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프로그램 )을 포함할 수 있다. 운영 체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈(windows), 심비안 (symbian), 타이젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface (API)), 및/또는 어플리케이션을 포함할 수 있다. 프로그램 모듈의 적 어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 전자 장치, 전자 장치,서버 등)로부터 다운로드(download) 가능하다. 커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저 및/또는 디바이스 드라이버를 포함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 다양한 실시예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등 을 포함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 또는 IPC(inter-process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API를 통해 다양한 기능들 을 어플리케이션으로 제공할 수 있다. 다양한 실시예에 따르면, 미들웨어(예: 미들웨어)는 런타 임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매 니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입출 력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기(life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미디어 매 니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하 여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어플리케 이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리할 수 있 다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 (battery) 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매 니저는 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저는, 예를 들면, WiFi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도 착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할 수 있 다. 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는 사용자에게 제공될 그 래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용 자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 전자 장치 )가 전화 기능을 포함한 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니저(telephony manager)를 더 포함할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들웨 어는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미들웨 어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제 공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이 젠(tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일 , 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리(health care)(예: 운동량 또 는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수있는 하나 이상의 어플리케이션을 포함할 수 있다. 다양한 실시예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 전자 장치 , 전자 장치) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의 상, \"정보 교환 어플리 케이션\")을 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위 한 알림 전달(notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 (예: 전자 장치, 전자 장치)로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치, 전자 장치 )의 적어도 하나의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레 이의 밝기(또는, 해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 다양한 실시예에 따르면, 어플리케이션은 외부 전자 장치(예: 전자 장치, 전자 장치)의 속성에 따라 지정된 어플리케이션(예: 모바일 의료 기기의 건강 관리 어플리케이션 등)을 포함할 수 있다. 다양한 실시 예에 따르면, 어플리케이션은 외부 전자 장치(예: 서버 또는 전자 장치, 전자 장치)로부터 수신된 어플리케이션을 포함할 수 있다. 다양한 실시예에 따르면, 어플리케이션은 프리로드 어플리케이션 (preloaded application) 또는 서버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시예에 따른 프로그램 모듈의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시예에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적 어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세서(예: 프로 세서)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하나 이상의 기 능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등 을 포함할 수 있다. 도 4a 내지 도 4c는 다양한 실시예들에 따른 전자 장치를 도시한 도면이다. 도 4a 내지 도 4c에는 3차원 X/Y/Z 직교 좌표계가 도시되었는데, 'Z축'은 전자 장치의 본체의 상하 방향(두께 방향)을, 'X축'은 본체의 가로 방향을, 'Y축'은 본체의 세로 방향을 각각 의미할 수 있다. 도 4a는 본 발명의 다양한 실시예에 따른 전자 장치의 사시도를 도시하고 있다. 도 4a를 참고하면, 전자 장치(예: 도 1의 전자 장치)는 사용자의 손목에 착용할 수 있는 손목 착용형 웨어러블(wearable) 전자 장치일 수 있다. 하지만, 본 발명의 다양한 실시 예들은 이에 한정되지 않으며, 팔찌, 스트립, 밴드, 부착형(반창고형) 밴드, 벨트, 귀착용형 이어폰, 헤드폰, 의복형, 신발형, HMD(Head Mounted Display), 모자형, 장갑형, 골무형(Finger-tip 착용형), 클립형, 암밴드(arm band)형, 콘텍트렌즈 장치, 디지 털의복, 또는 리모컨 중 하나일 수도 있다. 다양한 실시예에 따르면, 전자 장치는 본체와 본체에 장착되는 연결부(예: 스트랩)를 포함 할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 내부에 전원 공급 수단으로 배터리(예: 충전용 배터리 등)를 포함 할 수 있다. 전자 장치는, 예를 들면, 휴대용 충전 크래들(cradle)에 선택적으로 장착되어 배터리를 충전 시키도록 구현될 수도 있다. 다양한 실시예들에 따르면, 본체는 디스플레이, 적어도 하나의 키 버튼(예를 들면, 사이드 키 (K), 터치 센서, 또는 압력 센서) 또는/및 센서 모듈(예: 생체 센서 등) 등을 포함할 수 있다. 다양한 실시예에 따르면, 디스플레이는 터치스크린을 포함하여, 터치 입력을 수신할 수 있다. 일 실시예에 따르면, 본체 는 전면(F)과, 착용 상태에서 사용자의 신체에 접촉하는 후면(R)을 포함할 수 있으며, 예를 들면, 디스플레이는 본체의 전면(F)에, 센서 모듈은 본체의 후면(R)에 각각 배치될 수 있다. 하지만, 본 발 명의 다양한 실시예들은 이에 한정되지 않으며, 디스플레이 또는 센서 모듈은 전자 장치의 다양한 영 역에 배치될 수 있다. 예를 들면, 센서 모듈은 연결부에 배치될 수도 있다. 다양한 실시예에 따르면, 본체는 바타입 형상이면서 적어도 부분적으로 사용자 신체에 대응하는 곡률 (curvature)을 가질 수 있다. 예를 들어, 본체는 세로 방향(Y축 방향)으로 연장된 직사각형 형상이면서 곡 률을 가질 수 있다. 일 실시예에 따르면, 본체의 측면에는 연결부와 맞물리는 결속 홈이 형성될 수 있다. 다양한 실시예에 따르면, 연결부는 본체와 결합하거나 분리 가능하게 구성될 수 있다. 다양한 실시예 에 따르면, 연결부는 탄성 재질로 구성될 수 있다. 이에 따라, 본체를 사용자의 신체 피부에 밀착시 킬 수 있다. 일 실시예에 따르면, 연결부는 교환 가능한(changeable) 구조로 다양한 디자인이나 색상으로 구현될 수 있다. 이에 따라, 사용자는 사용자의 취향에 따라 연결부를 교환하여 사용할 수 있다. 다양한 실시예에 따르면, 연결부는 본체의 일부에 결합되고 사용자의 신체의 일부에 착탈가능하게 부 착되는 결착구를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 속목에 올려놓은 상태에서 연결 부를 서로 엮어 채결하는 방식으로 착용될 수 있다. 예를 들어, 하나의 연결부는 일정 간격으로 복수 의 손목 조절용 개구를 포함하며 하나의 다른 연결부는 손목 조절용 개구를 통해 체결될 수 있도록 결착구 를 포함할 수 있다. 다양한 실시예들에 따르면, 본체는 디스플레이에 표시되는 다양한 사용자 인터페이스 환경을 조절할 수 있는 회전체(미도시)(예: 회전형 입력모듈)가 장착될 수 있다. 다양한 실시예에 따르면, 회전체는 용두 (crown)와 같이 본체의 측면에 돌출형으로 배치되어 회전될 수 있다. 다양한 실시예에 따르면, 본체 가 원형 타입 형상을 가질 경우, 회전체는 본체의 하면, 상면 또는 측면에 회전 가능하게 설치될 수 있다. 예를 들어, 회전체는 본체의 상면에 배치된 디스플레이의 가장자리를 둘러싸는 베젤 부분에 배치될 수 있다. 도 4b는 본 발명의 다양한 실시 예들 중 하나에 따른 전자 장치의 본체를 나타내는 사시도이고, 도 4c는 본 발명의 다양한 실시 예들 중 하나에 따른 전자 장치의 본체를 다른 방향에서 바라본 모습을 나타내는 사시도이다. 도 4b 및 도 4c를 참조하면, 본체는 본체 하우징과, 본체 하우징에 장착된 디스플레이를 포함할 수 있다. 다양한 실시예에 따르면, 본체 하우징은 전면(front surface)(F)과, 후면(rear surface)(R)과, 전면(F)/후면(R)을 연결하는 측면(side surface)을 구비할 수 있다. 하지만, 본 발명의 다양한 실시예들은 이에 한정되지 않으며, 본체 하우징은 전면(F)과 후면(R)으로 구성될 수 있다. 또한, 본체 하우징의 전면 (F), 후면(R), 및 측면은 일체형으로 형성될 수 있다. 일 실시예에 따르면, 전면(F) 및 후면(R)은 각각 곡률을 가지게 구성될 수 있다. 다양한 실시예에 따르면, 본체 하우징은 각종 정보를 입력하기 위한 키 버튼(예: 사이드 키(K), 터치 센서, 또는 압력 센서)을 더 포함할 수 있다. 일 실시예에 따르면, 전면(F)은 디스플레이가 장착되는 면이 고, 후면(R)은 사용자의 신체와 접촉하는 착용 면이 될 수 있다. 하지만, 본 발명의 다양한 실시예들은 이에 한 정되지 않으며, 디스플레이 또는 센서 모듈은 전자 장치의 다양한 영역에 배치될 수 있다. 다양한 실시예에 따르면, 하우징의 전면(F)에 디스플레이가 배치될 수 있다. 이에 따라, 사용자가 전 자 장치를 통하여 디스플레이된 화면 보기가 편할 수 있다. 디스플레이는 사용자의 신체 곡면을 반영한 형 태를 예시하고 있으나, 평면(LCD, OLED) 디스플레이, 곡면 디스플레이 또는 플렉서블 디스플레이로 구성될 수 있다. 예컨대, 본 발명의 구체적인 실시 예들은 본체가 곡면 디스플레이를 구비하는 것으로 예시되지만, 평면 디스플레이 또는 플렉서블 디스플레이로 구성될 수 있다. 도 4c를 참조하면, 일 실시예에 따르면, 후면(R)에는 센서 모듈(예: 생체 센서)이 배치될 수 있다. 예를 들어, 센서 모듈은 사용자의 신체 손목에 밀착되는 형상으로 배치될 수 있다. 이에 따라, 사용자의 전자 장치에 대한 착용감을 향상시킬 수 있다. 하우징에 구비되는 센서 모듈(예: 센서 모듈 또는 생체 센서)은 가속도 센서, 자이로 센서, 지 자기 센서, 심박 센서, 근접 센서, 광센서, GSR 센서, 심전도 센서, 근전도 센서, 혈당 센서, 혈압 센서, 압력 센서 또는 온도 센서 중 적어도 하나를 포함할 수 있다. 이 외에도 센서 모듈은 전자 장치의 착용 여부를 판단하기 위한 센싱 값을 검출하는 다른 센서를 포함할 수도 있다. 다양한 실시예에 따르면, 센서 모듈은전자 장치의 움직임을 측정하기 위한 센서(예: 가속도 센서, 지자기 센서, 또는 자이로 센서)와 신체 착용 여부를 판단하는 이용되는 센서(예: 근접 센서 또는 압력 센서) 및 생체 신호 측정을 위한 생체 센서(예: 심박 센서, 혈압 센서, 또는 체온 센서)를 포함하는 하나의 모듈 형태로서 하우징의 후면(R)에 구비될 수 있다. 다양한 실시예에 따르면, 하우징의 후면(R)에는 접속 부재들(예: 충전 단자 또는 인터페이스 등)이 배치될 수 있다. 도 5a는 다양한 실시예들에 따른 프로세서의 구성을 도시한 도면이다. 다양한 실시예에 따르면, 프로세서 는 전자 장치(예: 전자 장치 또는 전자 장치)의 프로세서(예: 프로세서)일 수 있다. 다양한 실시예에 따르면, 프로세서는 장치상태 판단모듈, 파라미터 변경모듈, 사용자상태 판단 모듈, 측정모듈을 포함할 수 있다. 다양한 실시예에 따르면, 장치상태 판단모듈은 전자 장치의 상태(예: 착용 상태 또는 미착용 상태, 근접 상태 또는 근접하지 않은 상태, 또는 사용(또는, 소지) 상태 또는 사용(또는, 소지)하지 않는 상태)를 판단할 수 있다. 다양한 실시예에 따르면, 장치상태 판단모듈은 적어도 하나의 센서에 기반하여 전자 장치의 상태 를 판단할 수 있다. 일 실시예에 따르면, 장치상태 판단모듈은 가속도 센서, 지자기 센서, 자이로 센서, 근접 센서, 기압 센서(또는, 압력 센서), 또는 온도 센서 중 적어도 하나의 센서를 통해 획득되는 정보에 기반 하여 전자 장치의 상태를 판단할 수 있다. 예를 들면, 장치상태 판단모듈은, 예를 들면, 가속도 센서, 지자기 센서 또는 자이로 센서를 통하여, 전자 장치의 움직임이 감지된 경우, 전자 장치의 상태를 사용자에게 착용된 상태로 판단할 수 있다. 또한, 장치상태 판단 모듈은, 예를 들면, 가속도 센서, 지자기 센서 또는 자이로 센서를 통하여, 전자 장치의 움직임이 감 지되지 않은 경우, 전자 장치의 상태를 사용자에게 미착용된 상태로 판단할 수 있다. 예를 들면, 장치상태 판단모듈은, 예를 들면, 근접 센서를 통하여, 전자 장치로부터 선택된(또는, 지정된) 거리(예: 약 10cm) 내에 오브젝트(예: 사용자)가 감지된 경우, 전자 장치의 상태를 오브젝트로부터 근접한 상태 (예: 사용자가 전자 장치를 사용 또는 소지하는 상태)로 판단할 수 있다. 또한, 장치상태 판단모듈은, 예 를 들면, 근접 센서를 통하여, 전자 장치로부터 선택된 거리 내에 오브젝트가 감지되지 않은 경우, 전자 장치의 상태를 오브젝트로부터 근접하지 않은 상태(예: 사용자가 전자 장치를 사용 또는 소지하지 않은 상태)로 판단할 수 있다. 예를 들면, 장치상태 판단모듈은, 예를 들면, 압력 센서 또는 온도 센서를 통하여, 선택된(또는, 지정된) 압력 또는 선택된(또는, 지정된) 온도(예: 약 37도)가 감지된 경우, 전자 장치의 상태를 사용자가 사용 또는 소 지하는 상태로 판단할 수 있다. 또한, 장치상태 판단모듈은, 예를 들면, 압력 센서 또는 온도 센서를 통하 여, 선택된 압력 또는 선택된 온도가 감지되지 않은 경우, 전자 장치의 상태를 사용자가 사용 또는 소지하지 않 는 상태로 판단할 수 있다. 다양한 실시예에 따르면, 장치상태 판단모듈은 전자 장치의 회로적 연결 또는 기구적 연결 여부에 기반하 여 전자 장치의 상태를 판단할 수 있다. 예를 들면, 전자 장치가 스마트 안경인 경우, 스마트 안경이 사용자의 머리에 착용된 경우, 스마트 안경의 안경 다리에 포함된 스위치 회로가 연결될 수 있다. 이에 따라 장치상태 판 단모듈은 전자 장치의 상태를 착용 상태로 판단할 수 있다. 또한, 스마트 안경이 사용자의 머리에 착용되 지 않은 경우, 스마트 안경의 안경 다리에 포함된 스위치 회로가 연결되지 않을 수 있다. 이에 따라, 장치상태 판단모듈은 전자 장치의 상태를 미착용 상태로 판단할 수 있다. 예를 들면, 전자 장치가 스마트 와치인 경우, 스마트 와치의 버클(buckle)이 연결된 경우, 장치상태 판단모듈 은 전자 장치의 상태를 착용 상태로 판단할 수 있다. 또한, 스마트 와치의 버클이 연결되지 않은 경우, 장 치상태 판단모듈은 전자 장치의 상태를 미착용 상태로 판단할 수 있다. 다양한 실시예에 따르면, 사용자상태 판단모듈은 사용자의 상태(예: 취침 상태)를 판단할 수 있다. 일 실 시예에 따르면, 사용자상태 판단 모듈은 사용자의 패턴에 기반하여 사용자의 상태를 판단할 수 있다. 예를 들어, 사용자의 패턴은 사용자의 움직임 패턴, 지정된 스케줄과 연관된 생활 패턴 등을 포함할 수 있다. 다양한 실시예에 따르면, 사용자상태 판단모듈은, 예를 들어, 생체 정보 측정 시, 사용자의 움직임, 또는 움직임 강도 등을 판단할 수 있다. 예를 들면, 사용자 상태 판단 모듈은 사용자의 움직임 강도가 선택된 (또는, 지정된) 강도 이하인 경우, 사용자의 상태를 취침 상태로 판단할 수 있다. 또한, 사용자 상태 판단 모듈은 사용자의 움직임 강도가 선택된(또는, 지정된) 강도 이상인 경우, 사용자의 상태를 활동 상태(예: 취침 하지 않는 상태)로 판단할 수 있다. 일 실시예에 따르면, 사용자상태 판단모듈은 사용자의 움직임 정보를 측정모듈 또는 파라미터 변경모듈로 제공하여 생체 정보 측정 방식이 변경되도록 처리할 수 있다. 다양한 실시예에 따르면, 사용자상태 판단모듈은 전자 장치에 저장된 스케줄 정보에 기반하여 사용자의 상 태를 판단할 수 있다. 예를 들면, 전자 장치에 저장된 스케줄에 제 1 시간(예: 약 오후 11시에서 약 오전 8시까 지)은 ‘취침 시간’, 제 2 시간은 ‘활동 시간’(예: 약 오전 8시에서 약 오후 11시)으로 지정될 수 있다. 이 경우, 사용자상태 판단모듈은 스케줄에 기반하여 제 1 시간에 사용자의 상태를 ‘취침 상태’로 판단할 수 있다. 또한, 사용자상태 판단모듈은 스케줄에 기반하여 제 2 시간에 사용자의 상태를 ‘활동 상태’로 판 단할 수 있다. 다양한 실시예에 따르면, 측정모듈은 사용자의 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 측 정모듈은 적어도 하나의 센서에 기반하여 생체 정보를 측정할 수 있다. 일 실시예에 따르면, 측정모듈 은 신체의 적어도 일부와 접촉된 센서에 기반하여 혈압(blood pressure), 심박(heart rate), 심전도 (electrocardiogram), 피부수분도(skin moisture), 산소포화도(saturation of peripheral oxygen), 체온(body temperature), 혈당(blood glucose), 뇌전도(electroencephalogram), 또는 근전도(electromyogram) 등 적어도 하나를 측정할 수 있다. 다양한 실시예에 따르면, 측정모듈은 장치상태 판단모듈을 통하여 전자 장치 의 상태가 선택된(또는, 지정된) 상태(예: 착용 상태)로 판단되는 경우에 활성화될 수 있다. 다양한 실시예에 따르면, 측정모듈은 생체 정보 측정 주기(예: 약 1분)가 도래하면 측정 동작을 수행할 수 있다. 다양한 실시예에 따르면, 측정모듈은 생체 정보 측정 주기가 도래하면, 전자 장치 또는 사용자의 움 직임에 기반하여 측정 동작을 수행할 수 있다. 일 실시예에 따르면, 측정모듈은 측정 주기가 도래하면, 주 기가 도래하기 전에 측정된 사용자 또는 전자 장치의 움직임을 확인하고, 움직임이 선택된(또는, 지정된) 조건 을 만족하는 경우(예: 움직임의 강도가 선택된(또는, 지정된) 강도보다 낮은 경우) 생체 정보를 측정할 수 있다. 다른 실시예에 따르면, 측정모듈은 전자 장치 또는 사용자의 움직임이 선택된(또는, 지정된) 조건을 만족하지 못하는 경우(예: 움직임의 강도가 선택된(또는, 지정된) 강도보다 높은 경우) 주기가 도래한 시점을 기준으로 일정 시간(예: 약 10초) 동안 움직임 변화를 모니터링할 수 있다. 일 실시예에 따르면, 선택된(또는, 지정된) 시간 동안 움직임 변화가 선택된(또는, 지정된) 조건을 만족하는 경우(예: 움직임 데이터의 평균이 선 택된(또는, 지정된) 값보다 낮은 경우), 측정모듈은 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 파라미터 변경모듈은 생체 정보 측정에 필요한 측정 파라미터를 변경할 수 있다. 일 실시예에 따르면, 파라미터 변경모듈은 적어도 하나의 센서의 발광 시간, 생체 정보 측정 주기, 샘플링 비율, 생체 정보 측정 트리거, 또는 움직임 판단 조건 등을 변경할 수 있다. 이에 따라, 전자 장치에서 생체 정 보 측정 시 발생되는 소모 전류가 줄어들거나, 생체 정보 측정의 정확도가 향상될 수 있다. 또한, 일 실시예에 따르면, 파라미터 변경모듈은 생체 정보 측정 시, 생체 정보를 측정하는 동안의 전자 장치 또는 신체의 움 직임 강도, 측정 대상의 신체 특성 또는 상태, 또는 측정 품질 또는 측정 결과 등과 연관된 상황 정보에 기반하 여 측정 파라미터를 변경할 수 있다. 다양한 실시예에 따르면, 장치상태 판단모듈, 파라미터 변경모듈, 사용자상태 판단모듈, 측정모 듈은 적어도 하나의 소프트웨어 구성일 수 있다. 다양한 실시예에 따르면, 프로세서는 다양한 실시예에 따라, 상술한 측정하는 동작을 수행하기 위해 장치 상태 판단모듈, 파라미터 변경모듈, 사용자상태 판단모듈, 측정모듈 중 적어도 하나의 모 듈을 포함할 수 있다. 도시되진 않았지만, 다양한 실시예에 따르면, 장치상태 판단모듈, 파라미터 변경모듈, 사용자상태 판 단모듈, 및 측정모듈은 복수의 프로세서(또는, 칩(chip))에 포함될 수 있다. 예를 들면, 장치상태 판 단모듈 및 사용자 상태 판단모듈은 제 1 프로세서(또는, 제 1 칩)에 포함될 수 있다. 파라미터 변경 모듈은 제 2 프로세서(또는, 제 2 칩)에 포함될 수 있다. 또한, 측정 모듈은 제 3 프로세서(또는, 제 3 칩)에 포함될 수 있다 다양한 실시예에 따르면, 전자 장치는 프로세서와 다른 별도의 모듈로 상술한 생체 정보를 측정하는 동작 을 수행할 수 있다. 도 5b는 다양한 실시예들에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 전자 장치 , 또는 프로세서)의 생체 정보 측정 동작을 도시한 도면이다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서)는 선택된(또는, 지정된) 시간을 가지는 주기(예: 약 1 분)를 간격으로 생체 정보의 측정을 시도할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서)는 생 체 정보의 측정을 시도하는 시기를 판단하기 위하여 선택된(또는, 지정된) 시간을 나타내는 제1 타이머를 동작 시킬 수 있다. 예를 들어, 전자 장치(예: 프로세서)는 제1 타이머를 동작하여 1분 간격으로 생체 정보 측 정을 시도할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서)는 제1 타이머의 동작이 만료되기 전의 적어도 일 부 시간 구간(예: 제 1 타이머의 동작이 만료되기 전 약 10초 동안)에 전자 장치의 움직임을 측정할 수 있 으며, 제1 타이머의 동작이 만료되면 측정된 움직임 중 적어도 일부의 움직임이 선택된(또는, 지정된) 기준을 만족하는지 판단할 수 있다. 예를 들어, 전자 장치(예: 프로세서)는 제1 타이머가 만료되기 전 적어도 일 부 구간에 획득된 움직임의 평균을 측정하고, 측정된 움직임의 평균이 선택된(또는, 지정된) 임계값 이하 인지 판단할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서)는 측정된 전자 장치의 움직임이 선택된(또는, 지정된) 기준을 만족하는 경우, 생체 정보를 측정하기 위한 적어도 하나의 센서(예: 생체 센서)를 동작시킬 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서)는 측정된 전자 장치의 움직임이 선택된(또는, 지정된) 기준을 만족하지 못하는 경우, 제2 타이머가 동작하는 시간(예: 약 30초) 동안 전자 장치의 움직임이 선택 된(또는, 지정된) 기준을 만족하는 상태로 변경되는지 판단할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프 로세서)는 이전 측정된 움직임(예: 움직임의 평균)이 임계값 이상으로 지속되면 생체 정보 측정 동작을 수 행하지 않을 수 있다. 다른 실시예에 따르면, 전자 장치(예: 프로세서)는 이전 측정된 움직임(예: 움직임 의 평균)이 임계값 이하로 변경되면 생체 정보를 측정하기 위한 적어도 하나의 센서(예: 생체 센서)를 동작시킬 수 있다. 다른 실시예에 따르면, 전자 장치(예: 프로세서)는 제2 타이머가 동작하는 시간동안 추가적 으로 전자 장치의 움직임을 측정할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서)는 제2 타이머 가 동작하는 시간 동안에 선택된(또는, 지정된) 구간(예: 움직임의 평균이 측정된 구간과 동일하거나 유사한 크기의 구간)의 움직임을 추가적으로 측정하고, 추가적으로 측정된 움직임이 선택된(또는, 지정된) 기준 을 만족하는지 판단할 수 있다. 예를 들어, 전자 장치(예: 프로세서)는 추가적으로 측정된 움직임이 선택된(또 는, 지정된) 기준을 만족하면 생체 정보를 측정하기 위한 적어도 하나의 센서(예: 생체 센서)를 동작시킬 수 있 다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서)는 제2 타이머가 동작하는 시간을 변경할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서)는 이전 측정된 움직임의 평균을 확인하는 시간을 증가 시키고, 증가된 시간 동안 생체 정보 측정이 가능한지를 판단할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서)는 전자 장치의 움직임(예: 움직임의 강도)에 기반하여 제2 타이머가 동작하는 시간을 변경 할 수 있다. 예를 들어, 전자 장치(예: 프로세서)는 이전 측정된 움직임(예: 움직임의 평균)에 기반하여 제2 타이머의 동작 시간을 증가시키거나 또는 감소시킬 수 있다. 예를 들면, 전자 장치의 움직임(예: 움직 임의 평균)이 감소하거나 임계값에 근접한 경우, 전자 장치(예: 프로세서)는 제 2 타이머의 동작 시간 을 증가시킬 수 있다. 예를 들면, 전자 장치의 움직임(예: 움직임의 평균)이 증가하거나 임계값에 근접하 지 않은 경우, 전자 장치(예: 프로세서)는 제 2 타이머의 동작 시간을 감소시킬 수 있다. 다양한 실시예에 따른 전자 장치는 하우징, 상기 하우징의 일부에 결합되고, 사용자의 신체의 일부에 착탈가능 하게 부착되는 결착구, 상기 전자 장치의 움직임을 감지할 수 있도록 구성된 적어도 하나의 제1 센서(예: 가속 도 센서, 지자기 센서, 자이로 센서, 근접 센서 또는 이들의 조합), 사용자의 신체의 변화를 감지할 수 있도록 구성된 적어도 하나의 제2 센서(예: 심박 센서), 메모리 및 상기 적어도 하나의 제1 센서, 상기 적어도 하나의 제2 센서, 및 상기 메모리와 전기적으로 연결된 프로세서를 포함할 수 있다. 일 실시예에 따르면, 상기 메모리 는 상기 프로세서가 예를 들면, 상기 적어도 하나의 제1 센서를 이용하여, 상기 전자 장치가 상기 사용자의 신 체의 일부에 착용되었는지(또는, 근접하였는지) 여부를 판단하고, 상기 전자 장치가 상기 사용자의 신체의 일부 에 착용된(또는, 근접한) 시점으로부터 선택된(또는, 지정된) 제1 시간 주기를 경과하는 시점 바로 전 및/또는 바로 후의 제2 시간 주기 동안에 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움 직임에 관한 정보를 획득하고, 상기 움직임에 관한 정보에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서 를 활성화(또는, 작동 또는 트리거)하도록 하는 인스트럭션들을 저장할 수 있다.다양한 실시예에 따르면, 상기 전자 장치가 상기 사용자의 신체의 일부에 착용되었는지 여부를 판단하는 동작은 신체의 살아있음(liveness)을 판단하는 동작을 포함할 수 있다. 일 실시예에 따르면, 신체의 살아있음을 판단하 는 동작은 심박 센서, 혈압 센서, 체온 센서, 피부 수분도 센서, 산소 포화도 센서, 혈당 센서, 심전도 센서, 뇌전도 센서, 근전도 센서 중 적어도 하나의 센서를 이용하여 판단할 수 있다. 일 실시예에 따르면, 상기 적어 도 하나의 제1 센서를 이용하여, 상기 전자 장치가 상기 사용자의 신체의 일부에 착용되었는지(또는, 근접하였 는지) 여부가 판단되더라도, 심박 센서로부터 수신되는 신호가 신체와 관련된 신호가 아니라고 판단되면 상기 사용자의 신체의 일부에 착용되지 않은 것으로 판단할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 제1 센서를 이용하여, 상기 전자 장치가 상기 사용자의 신체의 일부에 착용되었는지(또는, 근접하였는지) 여부가 판 단되더라도, 체온 센서로부터 수신되는 신호가 신체에 적합한 범위가 아니라고 판단되면 상기 사용자의 신체의 일부에 착용되지 않은 것으로 판단할 수 있다. 다양한 실시예에 따르면, 상기 제2 시간 주기는 상기 제1 시간주기보다 짧을 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제1 센서는, 근접센서, 자이로 센서, 지자기 센서 또는 가속도 센 서를 포함할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제2 센서는 생체 센서를 포함할 수 있다. 일 실시예에 따르면, 상 기 생체 센서는 심박 센서, 혈압 센서, 심전도 센서, 피부 수분도 센서, 또는 산소포화도 센서 중 적어도 하나 를 포함할 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 움직임에 관한 정보가 선택된(또는, 지정 된) 조건을 만족하지 않는 경우, 상기 제2 센서를 활성화(또는, 작동 또는 트리거)하지 않고, 상기 제2 시간 주 기를 경과하는 시점 바로 후의, 상기 제1 시간 주기 보다 짧은 제3 시간 주기 동안에, 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움직임에 관한 추가 정보를 획득하고, 상기 추가 정보에 적어 도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 제2 시간 주기 또는 상기 제3 시간 주기 중 적어도 하나는 상기 제1 시간 주기를 경과하는 시점을 포함하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 제2 시간 주기는 상기 제1 시간 주기를 경과하는 시점을 포함하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 활성화(또는, 작동 또는 트리거)된 제2 센서로부터 데이터를 선택된(또는, 지정된) 시간 내에 수신하지 않은 경우, 상기 선택된(또는, 지정된) 시간이 경과한 후에, 상기 제2 센서를 다시 활성화(또는, 작동 또는 트리거)하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 선택된(또는, 지정된) 시간이 경과하는 시점 전의 상기 제2 시간 주기와 실질적으로 동일한 시간 주기 동안에, 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움직임에 관한 추가 정보를 획득하고, 상기 추가 정보에 적어도 일부 기초하 여, 상기 적어도 하나의 제2 센서를 다시 활성화(또는, 작동 또는 트리거)하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 적어도 하나의 제1 센서 또는 상기 적어 도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하고, 상기 획득된 데이터에 적어도 일부 기초하여 상 기 제1 시간 주기 및/또는 제2 시간 주기 및 또는 제3 시간 주기를 변경하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 적어도 하나의 제1 센서 또는 상기 적어 도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하고, 상기 데이터에 적어도 일부 기초하여, 상기 적어 도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하도록 하는 적어도 하나의 조건을 변경하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 적어도 하나의 제1 센서 또는 상기 적어 도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하고, 상기 데이터에 적어도 일부 기초하여, 상기 적어 도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)시키는 시간 주기 또는 샘플링 비율 중 적어도 하나를 변 경하도록 설정될 수 있다. 다양한 실시예에 따르면, 전자 장치는 메모리 및 상기 메모리와 전기적으로 연결된 프로세서를 포함할 수 있다. 일 실시예에 따르면, 상기 메모리는, 상기 프로세서가 적어도 하나의 제 1 센서를 이용하여 상기 전자 장치가 사용자의 신체의 일부에 착용(또는, 근접)되었는지 여부를 판단하고, 상기 전자 장치가 상기 사용자의 신체의일부에 착용된(또는, 근접한) 경우, 선택된(또는, 지정된) 시간 주기를 경과하는 시점에서 선택된(또는, 지정된) 시간 범위 내에 측정된 전자 장치의 움직임의 적어도 일부에 기반하여 적어도 하나의 제 2 센서를 활성 화(또는, 작동 또는 트리거)하고, 상기 적어도 하나의 제 2 센서를 통하여 상기 사용자의 생체 정보를 측정하도 록 하는 인스트럭션들을 저장할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제 1 센서는, 근접센서, 자이로 센서, 지자기 센서 또는 가속도 센서 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 움직임의 적어도 일부가 선택된(또는, 지 정된) 조건을 만족하지 않는 경우, 상기 제2 센서를 활성화(또는, 작동 또는 트리거)하지 않고, 상기 시간 주기 를 경과하는 시점부터 선택된(또는, 지정된) 시간 동안 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움직임에 관한 추가 정보를 획득하고, 및 상기 추가 정보에 적어도 일부 기초하여, 상기 적어 도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 적어도 하나의 제 1 센서 또는 상기 적어 도 하나의 제 2 센서 중 적어도 하나로부터 획득된 데이터에 기반하여 상기 추가 정보를 획득하는 선택된(또는, 지정된) 시간을 변경하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 생체 정보의 측정이 실패하면, 실패 횟수 를 누적하고, 상기 누적된 실패횟수가 선택된(또는, 지정된) 조건을 만족하면 상기 제2 센서를 비활성화하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 적어도 하나의 제1 센서 또는 상기 적어 도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하고, 상기 데이터에 적어도 일부 기초하여, 상기 적어 도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 인스트럭션들은, 상기 프로세서가 상기 적어도 하나의 제1 센서 또는 상기 적어 도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하고, 상기 데이터에 적어도 일부 기초하여, 상기 적어 도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)시키는 시간 주기 또는 샘플링 비율 중 적어도 하나를 변 경하도록 설정될 수 있다. 다양한 실시예에 따르면, 전자 장치는 메모리 및 상기 메모리와 전기적으로 연결된 프로세서를 포함할 수 있다. 일 실시예에 따르면, 상기 메모리는, 상기 프로세서가 사용자의 신체에 대한 전자 장치의 근접 여부를 판단하고, 상기 전자 장치가 상기 사용자의 신체의 일부에 근접한 경우, 선택된(또는, 지정된) 주기를 경과하는 시점으로부터 선택된(또는, 지정된) 시간 범위 내에, 적어도 하나의 제 1 센서를 이용하여 상기 전자 장치의 움 직임에 관한 정보를 획득하고, 상기 움직임에 관한 정보에 적어도 일부 기초하여, 적어도 하나의 제 2 센서를 통하여 상기 사용자의 생체 정보를 획득하도록 설정될 수 있다. 도 6은 본 발명의 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로 세서 또는 전자 장치)의 생체 정보 측정 동작을 도시한 흐름도이다. 동작 601과 같이, 전자 장치(예: 프로세서(120 또는 500) 또는 장치상태 판단모듈)는 제1 센서에 기반하여 전자 장치의 상태(예: 착용 상태, 근접 상태, 사용 상태, 또는 소지 상태)를 판단할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서에 기반하여 신체 착용(또는, 근접) 과 연관된 전자 장치의 상태를 확인할 수 있다. 일 실시예에 따르면, 신체 착용과 연관된 전자 장치의 상태는 전자 장치가 신체의 적어도 일부에 접촉된 상태, 전자 장치가 신체의 적어도 일부로 접근된 상태 등이 될 수 있 다. 다양한 실시예에 따르면, 제1 센서는 가속도 센서, 지자기 센서, 자이로 센서, 근접 센서, 기압 센서, 또는 온도 센서 중 적어도 하나의 센서로 구성될 수 있다. 동작 603에서, 전자 장치(예: 프로세서(120 또는 500))는 상태 판단 동작을 통해서 신체 착용과 연관된 전자 장 치의 상태(예: 착용 상태 또는 미착용 상태)를 확인할 수 있다. 동작 603에서 신체 착용과 연관된 전자 장치의 상태가 선택된(또는, 지정된) 상태가 아닌 경우(예: 전자 장치의 상태가 미착용 상태인 경우), 동작 601과 같이 전자 장치(예: 프로세서(120 또는 500))는 전자 장치의 상태를 판단하는 동작을 수행할 수 있다.동작 603에서 신체 착용과 연관된 전자 장치의 상태가 선택된(또는, 지정된) 상태인 경우(예: 전자 장치의 상태 가 착용 상태인 경우), 동작 605와 같이, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제2 센서(예: 센서 모듈 또는 생체 센서(240I))를 동작시킬 수 있다. 다양한 실시예에 따르면, 적어도 하나의 제2 센서는 생체 정보를 측정하기 위한 센서가 될 수 있으며, 혈압(blood pressure), 심박(heart rate), 심전도 (electrocardiogram), 피부수분도(skin moisture), 산소포화도(saturation of peripheral oxygen), 체온(body temperature), 혈당(blood glucose), 뇌전도(electroencephalogram), 또는 근전도(electromyogram) 등 적어도 하나를 측정할 수 있다. 예를 들어, 제2 센서는 신체와 접촉될 수 있도록 전자 장치의 일면에 배치될 수 있다. 다양한 실시예에 따르면, 적어도 하나의 제2 센서를 동작시키는 것은 선택된(또는, 지정된) 시간이 경과하는 경 우, 적어도 하나의 제1 센서의 적어도 일부를 이용하여 획득한 전자 장치의 움직임이 선택된(또는, 지정된) 기 준을 만족하는 경우, 또는 선택된(또는, 지정된) 시각이 되는 경우 중 적어도 하나에 기반하여 동작시킬 수 있 다. 일 실시예에 따르면, 전자 장치의 상태가 착용 상태로 판단되면, 선택된(또는, 지정된) 시간을 나타내는 제 1 타이머를 동작시켜서 제1 타이머가 만료되면 적어도 하나의 제2 센서를 동작시킬 수 있다. 일 실시예에 따르 면, 전자 장치의 상태가 착용 상태로 판단되면, 전자 장치의 움직임을 확인하여, 움직임이 선택된(또는, 지정된) 기준을 만족하면 적어도 하나의 제2 센서를 동작시킬 수 있다. 일 실시예에 따르면, 전자 장치의 상태 가 착용 상태로 판단되면, 선택된(또는, 지정된) 시각(예: 착용 판단 시각이 약 6시 10분인 경우, 약 6시 11 분)이 도래하는지 확인하여 적어도 하나의 제2 센서를 동작시킬 수 있다. 동작 607과 같이, 전자 장치(예: 프로세서(120 또는 500) 또는 측정 모듈)는 제2 센서에 기반하여 생체 정 보를 측정할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 제2 센서에 기반하여 측정된 생체 정보를 화면에 출력할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측 정된 생체 정보에 기반하여 헬스케어 기능(예: 심박수 제공 또는 운동량 제공)을 제공할 수도 있다. 도 7은 본 발명의 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로 세서 또는 전자 장치)의 상태 판단 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 상태 판단 방법의 수행 절차는 도 6에 기재된 동작 601에 대한 상세 동작일 수 있다. 동작 701과 같이, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서(예: 근접 센서)에 기반하 여 외부 오브젝트(예: 사용자)의 근접이 감지되는지 확인할 수 있다. 다양한 실시예에 따르면, 근접은 전자 장 치가 신체로 근접된 상태, 전자 장치가 신체에 접촉된 상태 등과 연관될 수 있다. 예를 들어, 전자 장치(예: 프 로세서(120 또는 500))는 제1 센서인 근접 센서를 통해 획득되는 정보에 기반하여 신체와 근접 여부를 판단할 수 있다. 동작 701에서 사용자(예: 신체)와의 근접이 감지되면, 동작 703과 같이, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서(예: 가속도 센서, 지자기 센서, 또는 자이로 센서)에 기반하여 전자 장치의 움 직임을 측정할 수 있다. 다양한 실시예에 따르면, 움직임은 전자 장치 또는 사용자의 움직임과 연관될 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 근접 감지에 대응하여 가속도 센서, 지자기 센 서, 자이로 센서 중 적어도 하나의 센서를 통해 획득되는 정보에 기반하여 움직임을 측정할 수 있다. 동작 705와 같이, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 조건을 만족하는 움직임이 감지되는지 확인할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 신체와 근접된 상태에서 선택된(또는, 지정된) 시간 동안 연속적인 움직임이 감지되는지 확인할 수 있다. 예를 들어, 전자 장 치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 시간 동안 연속적인 움직임이 감지되면 조건을 만족하 는 움직임이 감지되었다고 판단할 수 있다. 동작 705에서 선택된(또는, 지정된) 조건을 만족하는 움직임이 감지되면, 동작 707과 같이, 전자 장치(예: 프로 세서(120 또는 500))는 신체 착용과 연관된 전자 장치의 상태로 판단할 수 있다. 동작 705에서 선택된(또는, 지정된) 조건을 만족하지 움직임이 감지되지 않으면, 동작 709와 같이, 전자 장치 (예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서(예: 근접 센서)에 기반하여 신체와 근접이 감지되는지 확인할 수 있다. 예를 들어, 전자 장치는 제 1 센서인 근접 센서를 통해 획득되는 정보에 기반하여 신체와 근접 여부를 판단할 수 있다. 동작 709에서 전자 장치와 신체의 근접이 감지되면, 동작 707과 같이, 전자 장치(예: 프로세서(120 또는 500)) 는 신체 착용과 연관된 전자 장치의 상태(예: 착용 상태)로 판단할 수 있다. 일 실시예로, 전자 장치 (예: 프로 세서(120 또는 500))는 움직임이 없는 상황(예: 취침 상황)에서 전자 장치가 신체에 접촉 또는 근접되어 있는 경우 신체 착용과 연관된 상태로 판단할 수 있다. 동작 709에서 전자 장치와 신체의 근접이 감지되지 않으면, 동작 713과 같이, 전자 장치(예: 프로세서(120 또는 500))는 전자 장치의 상태를 신체 착용과 연관되지 않은 상태(예: 미착용 상태)로 판단할 수 있다. 동작 701에서 근접이 감지되지 않으면, 동작 711과 같이 전자 장치(예: 프로세서(120 또는 500))는 전자 장치의 움직임이 감지되는지 확인할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 근접 이 감지되지 않은 상태에서, 전자 장치의 움직임에 기반하여 근접 감지를 판단하는 동작의 재수행 여부를 판단 할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 근접이 감지되지 않았지만 전자 장치의 움직 임이 감지되면 근접될 가능성이 있다고 판단할 수 있다. 동작 711에서 움직임이 감지되면, 동작 701과 같이, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서에 기반하여 전자 장치가 신체와 근접하는지를 판단할 수 있다. 동작 711에서 움직임이 감지되지 않으면, 동작 713과 같이, 전자 장치(예: 프로세서(120 또는 500))는 전자 장 치의 상태를 신체 착용과 연관되지 않은 상태(예: 미착용 상태)로 판단할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 신체에 근접할 가능성이 없다고 판단하여 신체 착용과 연관되지 않은 상태로 판단할 수 있다. 다양한 실시예에 따르면, 동작 701에서 동작 713 중 적어도 하나의 동작은 생략될 수 있다. 예를 들면, 동작 701에서 전자 장치(예: 프로세서(120 또는 500))는 사용자로부터 전자 장치의 근접이 감지되는지 확인할 수 있 다. 전자 장치에서 사용자의 근접이 감지된 경우, 동작 707에서 전자 장치(예: 프로세서(120 또는 500))는 신체 착용과 연관된 전자 장치의 상태(예: 착용 상태)로 판단할 수 있다. 또한, 전자 장치에서 사용자의 근접이 감지 되지 않은 경우, 동작 713에서 전자 장치(예: 프로세서(120 또는 500))는 신체 착용과 연관되지 않은 상태(예: 미착용 상태)로 판단할 수 있다. 다양한 실시예에 따르면, 동작 703에서 전자 장치(예: 프로세서(120 또는 500))는 전자 장치의 움직임을 측정할 수 있다. 동작 705에서 전자 장치(예: 프로세서(120 또는 500))는 지정된(또는, 선택된) 시간 동안 움직임(예: 연속적인 움직임)이 감지되는지 확인할 수 있다. 선택된(또는, 지정된) 시간 동안 움직임(예: 연속적인 움직 임)이 감지되는 경우, 동작 707에서 전자 장치(예: 프로세서(120 또는 500))는 신체 착용(또는, 사용자가 소지 또는 사용하는 상태)과 연관된 전자 장치의 상태(예: 착용 상태)로 판단할 수 있다. 선택된(또는, 지정된) 시간 동안 연속적인 움직임이 감지되지 않는 경우, 동작 713에서 전자 장치(예: 프로세서(120 또는 500))는 신체 착 용(또는, 사용자가 미소지 또는 사용하지 않는 상태)과 연관되지 않은 상태(예: 미착용 상태)로 판단할 수 있다. 도 8은 본 발명의 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로 세서 또는 전자 장치)의 제2 센서 동작 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 제2 센서 동작 방법의 수행 절차는 도 6에 기재된 동작 605에 대한 상세 동작일 수 있 다. 동작 801과 같이, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 시간 동안 동작하는 제1 타 이머를 동작시킬 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머의 동 작에 기반하여 생체 정보의 측정을 시도할 수 있다. 일 실시예에 따르면, 제1 타이머는 생체 정보의 측정을 시 도하는 시기를 판단하는 시간이 될 수 있다. 예를 들어, 제1 타이머는 약 1분 주기로 동작할 수 있다. 동작 803과 같이, 전자 장치(예: 프로세서(120 또는 500))는 타이머의 동작에 대응하여 전자 장치의 움직임을 측정할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서(예: 가속도 센서 또는 자이로 센서)에 기반하여 전자 장치의 움직임을 감지할 수 있다. 다양한 실시예에 따르면, 제 1 타이머의 구동에 기반하여, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머가 만료되기 전까지 전자 장 치의 움직임을 측정할 수 있다. 동작 805와 같이, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머의 동작이 만료되는지 확인할 수 있다. 제1 타이머의 동작이 만료되는 시기는, 예를 들면, 생체 정보를 측정하는 동작의 수행 여부를 판단하는 시기가될 수 있다. 생체 정보를 측정하는 동작은, 예를 들면, 생체 정보를 측정하기 위한 적어도 하나의 제2 센서를 구동시키는 것이 될 수 있다. 동작 805에서 제1 타이머의 동작이 만료되지 않으면, 동작 803과 같이, 전자 장치(예: 프로세서(120 또는 50 0))는 전자 장치의 움직임을 측정할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머 의 동작이 만료되기 전까지 전자 장치의 움직임을 측정할 수 있다. 동작 805에서 제1 타이머의 동작이 만료되면, 동작 807과 같이, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머 동작 중 측정된 전자 장치의 움직임이 선택된(또는, 지정된) 기준을 만족하는지 판단할 수 있다. 일 실 시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보를 정확하게 측정할 수 있는 움직임이 발생 되는지 판단할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머가 동작 하는 동안 측정된 움직임 중 적어도 일부의 움직임이 선택된(또는, 지정된) 기준을 만족하는지 판단할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머가 동작하는 동안 측정된 움직임의 평균을 측정하고, 측정된 움직임의 평균이 선택된(또는, 지정된) 조건을 만족하는지 판단할 수 있다. 다른 실시 예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머가 만료되기 전 적어도 일부 구간에서 획득 된 움직임의 평균을 측정하고, 측정된 움직임의 평균이 선택된(또는, 지정된) 조건을 만족하는지 판단할 수 있 다. 다양한 실시예에 따르면, 선택된(또는, 지정된) 조건을 만족하는 상황은 선택된(또는, 지정된) 임계값 이하 의 전자 장치의 움직임이 측정되는 상황이 될 수 있다. 예를 들어, 선택된(또는, 지정된) 임계값 이하의 전자 장치의 움직임이 측정되는 상황은, 전자 장치의 움직임이 발생되지 않거나 또는 움직임 미발생으로 인식될 수 있는 정도의 작은 움직임이 발생된 상태가 될 수 있다. 동작 807에서 제1 타이머가 동작되는 동안 측정된 전자 장치의 움직임이 선택된(또는, 지정된) 기준을 만족하는 경우, 동작 809와 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보를 측정하기 위한 적어도 하나의 제2 센서를 동작시킬 수 있다. 동작 807에서 제1 타이머 동작 중 측정된 전자 장치의 움직임이 선택된(또는, 지정된) 기준을 만족하지 못하는 경우, 동작 811과 같이, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 시간 동안 동작하는 제2 타이머를 동작시킬 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 이미 측정된 기준을 만족하지 못하는 전자 장치의 움직임이 선택된(또는, 지정된) 기준을 만족하는 상태로 변경되는지를 판 단하기 위하여 제2 타이머를 동작시킬 수 있다. 제2 타이머의 동작 시간은 제1 타이머의 동작 시간보다 짧을 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정을 위한 다음 주기가 도래하기 전까 지 전자 장치의 움직임이 변경되는지 확인할 수 있다. 동작 813과 같이, 전자 장치(예: 프로세서(120 또는 500))는 전자 장치의 움직임 변화를 측정할 수 있다. 동작 815와 같이, 전자 장치(예: 프로세서(120 또는 500))는 측정된 움직임의 변화가 선택된(또는, 지정된) 기 준을 만족하는지 확인할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정된 움직 임(예: 기준을 만족하지 못하는 전자 장치의 움직임)이 생체 정보를 정확하게 측정할 수 있는 상태의 움직임으 로 변경되는지 판단할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머가 만료되는 시점에 측정된 움직임의 평균치가 선택된(또는, 지정된) 임계값 이하로 변경되는지 확인할 수 있다. 동작 815에서 움직임 변화가 선택된(또는, 지정된) 기준을 만족하면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작을 수행할 수 있다. 예를 들어, 동작 809와 같이, 전자 장치(예: 프로세서(120 또는 500)) 는 생체 정보를 측정하기 위한 적어도 하나의 제2 센서를 동작시킬 수 있다. 동작 815에서 움직임 변화가 선택된(또는, 지정된) 기준을 만족하지 않으면, 동작 817과 같이, 전자 장치(예: 프로세서(120 또는 500))는 제2 타이머의 동작이 만료되는지 확인할 수 있다. 동작 817에서 제2 타이머가 만료되지 않으면, 전자 장치(예: 프로세서(120 또는 500))는 제2 타이머가 동작하는 동안 전자 장치(예: 프로세서(120 또는 500))의 움직임 변화가 선택된(또는, 지정된) 기준을 만족하는지 재확인 할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 동작 813과 같이 전자 장치의 움직임 변화를 측정할 수 있다. 동작 817에서 제2 타이머가 만료되면, 동작 819와 같이, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머 의 동작 시기를 판단할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 신체 착용과 연관된 전 자 장치의 상태를 판단하는 동작을 수행할 수 있다. 다른 예로, 전자 장치(예: 프로세서(120 또는 500))는 신체 착용과 연관된 전자 장치의 상태(예: 착용 상태)를 판단함에 따라 전자 장치의 상태를 판단하는 동작을 생략하고 제1 타이머를 구동시킬 수도 있다. 다양한 실시예에 따르면, 동작 801에서 동작 819 중 적어도 하나의 동작은 생략될 수 있다. 동작 807에서 제1 타이머가 동작되는 동안 측정된 전자 장치의 움직임이 선택된(또는, 지정된) 기준을 만족하는 경우, 동작 809와 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보를 측정하기 위한 적어도 하나의 제2 센 서를 동작시킬 수 있다. 동작 807에서 제1 타이머 동작 중 측정된 전자 장치의 움직임이 선택된(또는, 지 정된) 기준을 만족하지 못하는 경우, 동작 819와 같이, 전자 장치(예: 프로세서(120 또는 500))는 제1 타이머의 동작 시기를 판단할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 신체 착용과 연관된 전자 장치의 상태를 판단하는 동작을 수행할 수 있다. 다른 예로, 전자 장치(예: 프로세서(120 또는 500))는 신체 착 용과 연관된 전자 장치의 상태(예: 착용 상태)를 판단함에 따라 전자 장치의 상태를 판단하는 동작을 생략하고 제1 타이머를 구동시킬 수도 있다. 도 9는 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 생체 정보 측정 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 생체 정보 측정 방법의 수행 절차는 도 6에 기재된 동작 607에 대한 상세 동작일 수 있다. 동작 901과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정을 시도할 수 있다. 다양한 실시예 에 따르면, 생체 정보 측정은 적어도 하나의 제2 센서를 동작시킴으로써 수행될 수 있다. 다양한 실시예에 따르 면, 적어도 하나의 제2 센서는 빛을 발광시키는 발광부 및 발광부의 빛을 수신하는 수광부를 포함할 수 있으며, 전자 장치(예: 프로세서(120 또는 500))는 제2 센서로부터 출력되는 신호에 기반하여 생체 정보를 측정할 수 있 다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 신체의 적어도 일부에 접촉된 적어도 하나 의 제2 센서를 통해 출력되는 빛의 양에 기반하여 생체 정보(예: 심박수)를 측정할 수 있다. 예를 들어, 수축기 에는 신체에 혈액이 많아져 약간 어두운 빛이 수신되고, 이완기에는 신체에 혈액이 빠지면서 밝은 빛이 수신될 수 있으며, 전자 장치(예: 프로세서(120 또는 500))는 이러한 빛의 양에 기반하여 심박 정보를 측정할 수 있다. 동작 903에서, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보가 성공적으로 측정되는지 확인할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 정상적인 측정 결과가 도출되는지 확인할 수 있 다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정에 소요되는 시간 등에 기반 하여 정상적인 측정 결과가 도출되는지 확인할 수 있다. 예를 들면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정이 시작되고 선택된(또는, 지정된) 시간 안에 측정 결과를 도출하지 못하는 경우 생체 정보 측정 이 실패하였다고 판단할 수 있다. 다른 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 전자 장치 의 움직임에 기반하여, 정상적인 측정 결과가 도출되는지 확인할 수 있다. 예를 들면, 전자 장치(예: 프로세서 (120 또는 500))는 생체 정보 측정이 시작되고 선택된(또는, 지정된) 조건을 만족하지 못하는 움직임을 감지하 는 경우 생체 정보 측정이 실패하였다고 판단할 수 있다. 동작 903에서 생체 정보가 성공적으로 측정되면, 동작 905와 같이, 전자 장치(예: 프로세서(120 또는 500))는 측정된 생체 정보를 출력할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 제2 센서 에 기반하여 측정된 결과를 디스플레이(예: 화면)에 표시할 수 있다. 다른 실시예에 따르면, 전자 장치(예: 프 로세서(120 또는 500))는 측정된 결과에 기반하여 헬스케어 기능(예: 심박수의 이상 여부 제공 기능)을 제공할 수도 있다. 동작 903에서 생체 정보가 측정되지 않으면, 동작 907과 같이 전자 장치(예: 프로세서(120 또는 500))는 실패횟 수를 누적시킬 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정을 시도 한 후, 정상적인 결과가 도출되지 않을 때마다 실패횟수를 누적시킬 수 있다. 예를 들면, 생체 정보 측정의 정 상적인 결과가 1회 도출되지 않았을 경우, 동작 907에서 전자 장치(예: 프로세서(120 또는 500))는 실패횟수를 1회로 결정할 수 있다. 또한, 생체 정보 측정의 정상적인 결과가 3회 도출되지 않았을 경우, 동작 907에서 전자 장치(예: 프로세서(120 또는 500))는 실패횟수를 3회로 결정할 수 있다. 동작 909와 같이, 전자 장치(예: 프로세서(120 또는 500))는 누적된 실패횟수를 확인할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 임계값(예: 약 3회) 이상의 실패횟수가 누적되었는지 확인할 수 있다. 다양한 실시예에 따르면, 임계값 이상의 실패횟수가 누적되면 지속적으로 측정 실패가 발생하여 생체 정보 측정이 불가한 상황으로 판단 될 수 있다.동작 909에서 임계값 미만의 실패횟수가 누적되면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정을 재시도할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 동작 901과 연관된 동작을 재수행할 수 있다. 다른 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 전자 장치의 움직임에 기 반하여 생체 정보를 측정할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 동작 801에서 동작 819 중 적어도 하나의 동작을 수행할 수 있다. 동작 909에서 임계값 이상의 실패횟수가 누적되면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제 2 센서를 비활성화시킬 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측 정이 불가하다고 판단하여 적어도 하나의 제2 센서의 동작을 중단시킬 수 있다. 다양한 실시예에 따르면, 동작 901에서 동작 911 중 적어도 하나의 동작은 생략될 수 있다. 예를 들면, 동작 907에서 동작 911은 생략될 수 있다. 이에 따라, 동작 903에서 생체 정보의 측정이 실패한 경우, 전자 장치(예: 프로세서(120 또는 500))는 동작 901을 다시 수행할 수 있다. 도 10은 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 생체 정보 측정 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 생체 정보 측정 방법의 수행 절차는 도 6에 기재된 동작 607에 대한 상세 동작일 수 있다. 동작 1001과 같이, 전자 장치(예: 프로세서(120 또는 500))는 측정과 연관된 상황 정보를 획득할 수 있다. 다양 한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서 또는/및 적어도 하나의 제2 센서에 기반하여 상황 정보를 획득할 수 있다. 일 실시예에 따르면, 상황 정보는 생체 정보를 측정하는 동 안의 전자 장치 또는 신체의 움직임, 측정 대상의 신체 특성, 측정 대상의 상태, 측정 품질, 또는 측정 결과 등 을 포함할 수 있다. 동작 1003과 같이, 전자 장치(예: 프로세서(120 또는 500))는 상황 정보에 기반하여 측정 파라미터를 변경할 수 있다. 예를 들어, 상황 정보에 기반하여 변경되는 측정 파라미터는 하기 <표1>과 같이 정의할 수 있다. 하지만, 본 발명의 다양한 실시예들은 <표1>에 한정되지 않는다. 예를 들면, 상황 정보가 ‘측정 품질’인 경우 변경 파 라미터는 ‘타이머 주기’가 될 수 있다. 또한, 상황 정보가 신체 특성인 경우 변경 파라미터는 ‘샘플링 비율 ’이 될 수 있다. 표 1 상황 정보 변경 파라미터 측정 품질 측정 시간(발광 시간) 움직임 샘플링 비율 측정 결과 측정 트리거 신체 조건 타이머 주기 사용자 상태 움직임 판단 조건 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 상황 정보에 기반하여 측정 파라미터를 변경함 으로 생체 정보 측정 시 발생하는 전력 소모를 줄일 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 상황 정보에 기반하여 측정 파라미터를 변경함으로 생체 정보 측정 시 측정 정확도를 향상시킬 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 측정 품질이 좋지 않은 상태에서 생체 정보 측정은 무의 미하다고 판단할 수 있다. 이에 따라, 전자 장치(예: 프로세서(120 또는 500))는 제2 센서의 발광 시간을 줄여 소모 전류를 줄일 수 있다. 다른 예로, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 중 정상적인 측정이 불가능한 전자 장치의 움직임 강도가 감지되면 측정 동작을 중단하여 소모 전류를 줄일 수 있다. 또 다 른 예로, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 중 움직임에 의해 지속적으로 측정이 실패 하면 움직임이 발생되지 않을 때까지 측정 동작을 생략하여 소모 전류를 줄일 수 있다. 또 다른 예로, 전자 장 치(예: 프로세서(120 또는 500))는 생체 정보 측정 중 움직임의 강도가 보정 가능할 정도라 판단되면 측정 동작 동안의 측정 샘플링 비율을 높임으로 측정 정확도를 향상시킬 수 있다. 또 다른 예로, 전자 장치(예: 프로세서(120 또는 500))는 기준값 이상의 제2 센서의 발광량을 요구하는 측정 대상의 신체 특성(예를 들어, 어두운 피 부 색)을 감지하면 생체 정보 측정 횟수를 줄이도록 측정 주기를 변경하여 전력 소모를 줄일 수 있다. 또 다른 예로, 전자 장치(예: 프로세서(120 또는 500))는 움직임이 없는 사용자의 상황(예: 취침 상황)에 대해서는 전자 장치의 움직임을 판단하는 동작을 생략하여 전력 소모를 줄일 수도 있다. 동작 1005와 같이, 전자 장치(예: 프로세서(120 또는 500))는 변경된 파라미터에 기반하여 생체 정보를 측정하 는 동작을 수행할 수 있다. 동작 1007과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정이 완료되는지 확인할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 결과가 성공적으로 도출되는지 확 인할 수 있다. 동작 1007에서 생체 정보 측정이 완료되지 않으면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작을 수행할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 동작 1005와 같이 변경 된 파라미터에 기반하여 생체 정보를 측정할 수 있다. 동작 1007에서 생체 정보 측정이 완료되면, 동작 1009와 같이, 전자 장치(예: 프로세서(120 또는 500))는 측정 된 생체 정보를 출력할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 디스플레이 또는 스피커 를 통하여 측정된 생체 정보를 출력할 수 있다. 다양한 실시예에 따르면, 동작 1001에서 동작 1009 중 적어도 하나의 동작은 생략될 수 있다. 예를 들면, 동작 1009는 생략될 수 있다. 도 11은 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 파라미터 변경 방법의 수행 절차는 도 10에 기재된 동작 1003에 대한 상세 동작일 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정 품질이 좋지 않은 상태에서 생체 정보 측 정은 무의미하다고 판단하여 제2 센서의 발광 시간을 줄여 소모 전류를 줄일 수 있다. 동작 1101과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작을 수행할 수 있다. 일 실시 예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제2 센서를 동작시켜 선택된(또는, 지정 된) 시간 동안 빛을 발광시키고, 적어도 하나의 제2 센서로부터 출력되는 신호를 획득할 수 있다. 동작 1103과 같이, 전자 장치(예: 프로세서(120 또는 500))는 측정 품질을 확인할 수 있다. 일 실시예에 따르면, 측정 품질은 적어도 하나의 제2 센서로부터 출력되는 신호의 품질이 될 수 있다. 예를 들어, 전자 장치 (예: 프로세서(120 또는 500))는 제2 센서로부터 출력되는 신호에 대한 신호대잡음비(signal to noise ratio)를 측정 품질로 획득할 수 있다. 동작 1105와 같이, 전자 장치(예: 프로세서(120 또는 500))는 측정 품질이 선택된(또는, 지정된) 기준을 만족하 는지 판단할 수 있다. 일 실시예에 따르면, 측정 품질이 선택된(또는, 지정된) 기준을 만족하지 못하는 것은 생 체 정보 측정이 가능할 정도의 신호가 획득되지 않은 상태가 될 수 있다. 예를 들어, 측정 품질이 선택된(또는, 지정된) 기준을 만족하지 못하는 것은, 정상적인 측정 결과가 도출되지 않은 상태일 수 있다. 또 다른 예를 들 어, 측정 품질이 선택된(또는, 지정된) 기준을 만족하지 못하는 것은, 선택된(또는, 지정된) 측정 시간 동안에 측정 결과가 도출되지 않은 상태일 수 있다. 동작 1105에서 측정 품질이 선택된(또는, 지정된) 기준을 만족하면, 동작 1107과 같이, 전자 장치(예: 프로세서 (120 또는 500))는 선택된(또는, 지정된) 측정 시간에 기반하여 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 측정 시간은 적어도 하나의 제2 센서의 발광 시간과 연관될 수 있다. 일 실시예에 따르면, 전자 장치 (예: 프로세서(120 또는 500))는 측정 품질이 선택된(또는, 지정된) 기준을 만족하면, 생체 정보 측정 주기(예: 약 1분 주기)가 도래할 때마다 선택된(또는, 지정된) 시간(예: 약 10초) 동안 적어도 하나의 제2 센서를 통해 빛을 발광하여 생체 정보를 획득할 수 있다. 동작 1105에서 측정 품질이 선택된(또는, 지정된) 기준을 만족하지 않으면, 동작 1109와 같이, 전자 장치(예: 프로세서(120 또는 500))는 품질에 기반하여 선택된(또는, 지정된) 측정 시간을 변경할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 소모 전류를 줄이기 위해 측정 시간을 변경 할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 측정 시간 동안 생체 정보의 측정 결과가 도출되지 않으면, 소모 전류를 줄이기 위해 측정 시간을 단축시킬 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정 결과의 정확도를 향상시키기 위해 측 정 시간을 변경할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정 된) 측정 시간 동안 생체 정보의 측정 결과가 도출되지 않으면, 생체 정보 측정에 필요한 정보가 충분히 확보될 수 있도록 측정 시간을 증가시킬 수 있다. 동작 1111과 같이, 전자 장치(예: 프로세서(120 또는 500))는 변경된 측정 시간에 기반하여 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 동작 1101에서 동작 1111 중 적어도 하나의 동작은 생략될 수 있다. 도 12는 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 파라미터 변경 방법의 수행 절차는 도 10에 기재된 동작 1003에 대한 상세 동작일 수 있다. 동작 1201과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작을 수행할 수 있다. 일 실시 예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제2 센서(예: 생체 센서)를 동작시켜 선 택된(또는, 지정된) 시간 동안 빛을 발광시키고, 적어도 하나의 제2 센서로부터 출력되는 신호를 획득할 수 있 다. 동작 1203과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보를 측정하는 동안 전자 장치의 움직임이 감지되는지 확인할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서에 기반하여 전자 장치의 움직임을 측정할 수 있다. 동작 1203에서 전자 장치의 움직임이 감지되지 않으면, 동작 1205와 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 선택 된(또는, 지정된) 샘플링 비율에 기반하여 적어도 하나의 제2 센서로부터 출력되는 정보를 획득할 수 있다. 동작 1203에서 전자 장치의 움직임이 감지되면, 동작 1207과 같이, 전자 장치(예: 프로세서(120 또는 500))는 측정된 움직임이 선택된(또는, 지정된) 기준값을 만족하는지 확인할 수 있다. 일 실시예에 따르면, 전자 장치 (예: 프로세서(120 또는 500))는 측정 결과에 영향을 미치지 않는 정도의 작은 움직임 강도가 감지되는지 확인 할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 측정 결과에 영향을 미치지 않는 움직임 강 도를 기준값을 만족하는 움직임으로 판단할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정 결과에 영향을 미칠 수도 있지만 보정 가능한 움직임 강도가 감지되는지 확인할 수 있다. 예를 들 어, 전자 장치(예: 프로세서(120 또는 500))는 측정 결과에 영향을 미치지 않는 움직임 강도 보다 소정의 값 이 상인 값을 기준값으로 정할 수 있다. 동작 1207에서 기준값을 만족하는 움직임을 확인하면, 동작 1209와 같이, 전자 장치(예: 프로세서(120 또는 500))는 제2 센서로부터 출력되는 신호의 샘플링 비율을 변경할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 움직임에 따른 잡음을 보정하기 위해 샘플링 비율을 빠르게 하여 제2 센서로부터 출 력되는 신호를 증가시킬 수 있다. 동작 1207에서 기준값을 만족하는 움직임을 확인하지 못하면, 동작 1211과 같이, 전자 장치(예: 프로세서(120 또는 500))는 제2 센서를 비활성화시킬 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500)) 는 움직임에 따른 잡음 보정이 불가능하다고 판단하여 생체 정보 측정 동작을 중단할 수 있다. 다양한 실시예에 따르면, 동작 1201에서 동작 1211 중 적어도 하나의 동작은 생략될 수 있다. 예를 들면, 동작 1207 및 동작 1211은 생략될 수 있다. 이 경우, 동작 1203에서 전자 장치의 움직임이 감지되는 경우, 동작 1209 에서 샘플링 비율을 변경할 수 있다. 동작 1205에서 변경된 샘플링 비율에 따라서 생체 정보를 측정할 수 있다. 도 13은 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 파라미터 변경 방법의 수행 절차는 도 10에 기재된 동작 1003에 대한 상세 동작일 수 있다. 동작 1301과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작을 수행할 수 있다. 일 실시 예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제2 센서를 동작시켜 선택된(또는, 지정 된) 시간 동안 빛을 발광시키고, 적어도 하나의 제2 센서로부터 출력되는 신호를 획득할 수 있다. 동작 1303과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보를 측정하는 동안 전자 장치의 움직임이 감지되는지 확인할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서에 기반하여 전자 장치의 움직임을 측정할 수 있다. 동작 1305와 같이, 전자 장치(예: 프로세서(120 또는 500))는 측정된 움직임이 선택된(또는, 지정된) 기준을 만 족하는지 확인할 수 있다. 일 실시예에 따르면, 선택된(또는, 지정된) 기준을 만족하는 것은 생체 정보 획득에 영향을 미치지 않는 정도의 움직임이 발생한 것이 될 수 있다. 동작 1305에서 측정된 움직임이 선택된(또는, 지정된) 기준을 만족하면, 동작 1307과 같이, 전자 장치(예: 프로 세서(120 또는 500))는 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또 는 500))는 선택된(또는, 지정된) 측정 시간에 기반하여 적어도 하나의 제2 센서로부터 출력되는 정보를 획득할 수 있다. 동작 1305에서 측정된 움직임이 선택된(또는, 지정된) 기준을 만족하지 않으면, 동작 1309와 같이, 전자 장치 (예: 프로세서(120 또는 500))는 결과를 도출할 수 있는 정도의 정보가 수집된 상태인지 판단할 수 있다. 동작 1309에서 결과를 도출할 수 있는 정도의 정보가 수집되면, 동작 1311과 같이, 전자 장치(예: 프로세서(120 또는 500))는 움직임 판단 동작을 수행할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정이 거의 완료된 시점에서 측정 동작이 중단되는 것을 방지하기 위하여 움직임이 발생하더라도 제2 센서를 비활성화시키지 않고 움직임이 선택된(또는, 지정된) 기준을 만족할 때까지 움직임 판단 동작을 수행할 수 있다. 동작 1309에서 결과를 도출할 수 있는 정도의 정보가 수집되지 않으면, 동작 1313과 같이, 전자 장치(예: 프로 세서(120 또는 500))는 제2 센서를 비활성화시킬 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또 는 500))는 측정이 완료되기까지 소정의 시간이 남은 상태에서 선택된(또는, 지정된) 기준을 만족하지 않는 움 직임이 발생했다고 판단하여 생체 정보 측정 동작을 중단할 수 있다. 다양한 실시예에 따르면, 동작 1301에서 동작 1313 중 적어도 하나의 동작은 생략될 수 있다. 예를 들면, 동작 1309 및 동작 1311은 생략될 수 있다. 이 경우, 동작 1305에서 측정된 움직임이 선택된(또는, 지정된) 기준을 만족하지 않는 경우, 동작 1313에서 전자 장치(예: 프로세서(120 또는 500))는 제 2 센서를 비활성화시킬 수 있 다. 또한, 동작 1305에서 측정된 움직임이 선택된(또는, 지정된) 기준을 만족하는 경우, 동작 1307에서 전자 장 치(예: 프로세서(120 또는 500))는 생체 정보를 측정할 수 있다. 도 14는 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 파라미터 변경 방법의 수행 절차는 도 10에 기재된 동작 1003에 대한 상세 동작일 수 있다. 동작 1401과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작을 수행할 수 있다. 일 실시 예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제2 센서를 동작시켜 선택된(또는, 지정 된) 시간 동안 빛을 발광시키고, 적어도 하나의 제2 센서로부터 출력되는 신호를 획득할 수 있다. 동작 1403과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보를 측정하는 동안 전자 장치의 움직임이 감지되는지 확인할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서에 기반하여 전자 장치의 움직임을 측정할 수 있다.동작 1405와 같이, 전자 장치(예: 프로세서(120 또는 500))는 측정된 움직임이 선택된(또는, 지정된) 기준을 만 족하는지 확인할 수 있다. 일 실시예에 따르면, 선택된(또는, 지정된) 기준을 만족하는 것은 생체 정보 획득에 영향을 미치지 않는 정도의 움직임이 발생한 것이 될 수 있다. 동작 1405에서 측정된 움직임이 선택된(또는, 지정된) 기준을 만족하면, 동작 1407과 같이, 전자 장치(예: 프로 세서(120 또는 500))는 타이머 동작에 기반하여 생체 정보 측정 동작을 수행할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 시간을 가지는 주기 간격으로 생체 정보의 측 정을 시도할 수 있다. 동작 1405에서 측정된 움직임이 선택된(또는, 지정된) 기준을 만족하지 않으면, 동작 1409와 같이, 전자 장치 (예: 프로세서(120 또는 500))는 움직임 기반으로 측정 트리거를 변경할 수 있다. 일 실시예에 따르면, 전자 장 치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 시간을 가지는 주기를 트리거로 하여 생체 정보를 측 정하나, 선택된(또는, 지정된) 기준을 만족하는 움직임이 측정되지 않는 상황에서는 측정 주기가 도래하여도 측 정 동작을 수행하지 않을 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작 을 수행하지 않으면서 선택된(또는, 지정된) 기준을 만족하는 움직임이 측정되는지 확인하고, 선택된(또는, 지 정된) 기준을 만족하는 움직임이 감지되면 생체 정보 측정 동작을 수행할 수 있다. 동작 1411과 같이, 전자 장치(예: 프로세서(120 또는 500))는 변경된 측정 트리거에 기반하여 생체 정보를 측정 할 수 있다. 다양한 실시예에 따르면, 동작 1401에서 동작 1411 중 적어도 하나의 동작은 생략될 수 있다. 도 15는 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 파라미터 변경 방법의 수행 절차는 도 10에 기재된 동작 1003에 대한 상세 동작일 수 있다. 동작 1501과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작을 수행할 수 있다. 일 실시 예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제2 센서를 동작시켜 선택된(또는, 지정 된) 시간 동안 빛을 발광시키고, 적어도 하나의 제2 센서로부터 출력되는 신호를 획득할 수 있다. 동작 1503과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보를 측정하는 동안 이전 측정 결과를 확 인할 수 있다. 이전 측정 결과는 전자 장치(예: 프로세서(120 또는 500))의 적어도 하나의 제1 센서 또는 적어 도 하나의 제2 센서 중 획득한 데이터에 기반한 결과일 수 있다. 동작 1505와 같이, 전자 장치(예: 프로세서(120 또는 500))는 이전 측정 결과에 기반하여 측정 실패가 선택된 (또는, 지정된) 횟수 이상 연속적으로 발생하는지 확인할 수 있다. 동작 1505에서 측정 실패가 선택된(또는, 지정된) 횟수 이상 연속적으로 발생하지 않으면, 동작 1507과 같이, 전자 장치(예: 프로세서(120 또는 500))는 타이머 동작에 기반하여 생체 정보 측정 동작을 수행할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 시간을 가지는 주기 간격으 로 생체 정보의 측정을 시도할 수 있다. 동작 1505에서 측정 실패가 선택된(또는, 지정된) 횟수 이상 연속적으로 발생하면, 동작 1509와 같이, 전자 장 치(예: 프로세서(120 또는 500))는 움직임 기반으로 측정 트리거를 변경할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 시간을 가지는 주기를 트리거로 하여 생체 정보를 측정하던 것을, 선택된(또는, 지정된) 기준을 만족하는 움직임이 측정되는지 확인하고, 선택된(또는, 지정된) 기준을 만족하는 움직임이 감지되면 생체 정보를 측정하는 것으로 변경할 수 있다. 동작 1511과 같이, 전자 장치(예: 프로세서(120 또는 500))는 변경된 측정 트리거에 기반하여 생체 정보를 측정 할 수 있다. 다양한 실시예에 따르면, 동작 1501에서 동작 1511 중 적어도 하나의 동작은 생략될 수 있다. 도 16은 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 측정 트리거 변경 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 파라미터 변경 방법의 수행 절차는 도 14에 기재된 동작 1409, 또는 도 15에 기재된 동작 1509에 대한 상세 동작일 수 있다. 동작 1601과 같이, 전자 장치(예: 프로세서(120 또는 500))는 전자 장치의 움직임을 확인할 수 있다. 일 실시예 에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 움직임 기반으로 측정 트리거가 변경되면 전자 장치의 움 직임을 측정할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제1 센서에 기반 하여 전자 장치의 움직임을 측정할 수 있다. 동작 1603과 같이, 전자 장치(예: 프로세서(120 또는 500))는 전자 장치의 움직임이 조건을 만족하는지 확인할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정에 영향을 미치지 않는 정도의 움직임이 발생하였는지 판단할 수 있다. 동작 1603에서 조건을 만족하는 움직임이 감지되지 않으면, 동작 1609와 같이, 전자 장치(예: 프로세서(120 또 는 500))는 생체 정보를 측정하지 않고 대기하는 동작을 수행할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정에 영향을 미치지 않는 움직임이 감지될 때까지 측정 동작을 수행하지 않고 대 기할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 움직임 기반으로 측정 트리거를 변경하면 측정 주기가 도래해도 측정 동작을 수행하지 않을 수 있다. 동작 1603에서 조건을 만족하는 움직임이 감지되면, 동작 1605와 같이, 전자 장치(예: 프로세서(120 또는 50 0))는 생체 정보 측정 동작을 수행할 수 있다. 동작 1607과 같이, 전자 장치(예: 프로세서(120 또는 500))는 조건을 만족하는 움직임에 기반하여 생체 정보를 측정한 후, 타이머 기반으로 측정 트리거를 변경할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정에 영향을 미치지 않는 움직임이 감지된다고 판단하여 선택된(또는, 지정된) 시간을 가지는 주기 간격으로 생체 정보를 측정하도록 측정 트리거를 변경할 수 있다. 다양한 실시예에 따르면, 동작 1601에서 동작 1609 중 적어도 하나의 동작은 생략될 수 있다. 도 17은 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 측정 트리거 변경 동작을 도시한 도면이다. 도 17을 참조하면, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 시간(예: 약 1분)을 가지는 주기를 간격으로 생체 정보의 측정을 시도할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 선 택된(또는, 지정된) 주기를 측정 트리거로 하여 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 주기가 도래하면 적 어도 하나의 제2 센서에 기반하여 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 주기가 도래한 시점 (t1, t2)에 전자 장치의 움직임이 선택된(또는, 지정된) 조건을 만족하지 않으면(예: 생체 정보를 정확하게 측 정할 수 없는 움직임이 감지되면), 측정 트리거를 변경할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또 는 500))는 생체 정보를 정확하게 측정할 수 있는 움직임이 감지될 때까지 생체 정보 측정 동작을 수행하지 않 을 수 있다. 다시 말해서, 전자 장치(예: 프로세서(120 또는 500))는 조건을 만족하는 움직임(예: 생체 정보를 정확하게 측정할 수 있는 움직임)을 측정 트리거로 하여 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 움직임에 따른 측정 실패가 선택된(또는, 지정된) 횟수(예를 들어, 약 2회) 이상 연속적으로 발생되면 측정 트리거를 변경할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 횟수 이상 연속적으로 측정에 실패 한 이후에 움직임 감지로 측정 트리거를 변경하여 움직임을 모니터링하고 움직임이 감지되는 구간에는 타 이머 기반으로 측정 동작을 수행하지 않고, 움직임이 선택된(또는, 지정된) 조건을 만족하는 시점(t3)에 측정 동작을 수행할 수 있다. 생체 정보의 획득에 성공하면 타이머 기반으로 측정 트리거를 변경할 수 있다 . 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 움직임 감지로 측정 트리거를 변경하여 생체 정보 획득에 성공하면 선택된(또는, 지정된) 시간을 가지는 주기 간격으로 생체 정보를 측정하도록 측정 트리거를 변경할 수 있다. 도 18은 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 파라미터 변경 방법의 수행 절차는 도 10에 기재된 동작 1003에 대한 상세 동작일 수 있다. 동작 1801과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작을 수행할 수 있다. 일 실시 예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제2 센서를 동작시켜 선택된(또는, 지정 된) 시간 동안 빛을 발광시키고, 적어도 하나의 제2 센서로부터 출력되는 신호를 획득할 수 있다. 동작 1803과 같이, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제2 센서가 접촉된 신체의 특성을 판단할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 대상의 신체적 특성을 판단할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 제2 센서가 접촉된 신 체의 피부색을 신체의 특성으로 판단할 수 있다. 동작 1805와 같이, 전자 장치(예: 프로세서(120 또는 500))는 신체 특성이 임계값 이상의 발광량을 요구하는지 판단할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 제2 센서의 수광부에 수신 되는 반사 광량에 기반하여 멜라닌 지수를 측정하고, 측정된 멜라닌 지수에 기반하여 피부색 및 측정시 요구되 는 발광부의 발광량을 확인할 수 있다. 예를 들어, 멜라닌 지수에 따른 발광량은 하기 <표2>와 같이 정의할 수 있다. 표 2 melanin Index 피부색 타입 전류 세기 5-10 Very light 31~40% 11-20 Light 41~50% 21-30 Intermediate 51~60% 31-40 Tan 61~70% 41-70 Brown 71~80% 71-99 black 81~100% 예를 들어, 멜라닌 지수가 높을수록 어두운 색의 피부타입을 나타내며, 전자 장치(예: 프로세서(120 또는 50 0))는 밝은 색의 피부 타입보다 어두운 색의 피부 타입에 대하여 소모 전류가 높다고 판단할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 사용자의 신체 특성을 저장하거나 또는 외 부 장치로부터 제공받을 수도 있다. 동작 1805에서 신체 특성이 임계값 이상의 발광량을 요구하지 않는다고 판단하면, 동작 1811과 같이, 전자 장치 (예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 측정 주기에 기반하여 생체 정보를 측정할 수 있다. 동작 1805에서 신체 특성이 임계값 이상의 발광량을 요구한다고 판단하면, 동작 1807과 같이, 전자 장치(예: 프 로세서(120 또는 500))는 신체 특성에 기반하여 측정 주기를 변경할 수 있다. 예를 들어, 전자 장치(예: 프로세 서(120 또는 500))는 생체 정보 측정시 임계값 이상의 발광량이 요구되면 측정 주기를 증가시켜 측정 횟수를 감 소시킬 수 있다. 동작 1807에서 측정 주기를 변경하면, 동작 1809와 같이, 전자 장치(예: 프로세서(120 또는 500))는 변경된 측 정 주기에 기반하여 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 동작 1801에서 동작 1811 중 적어도 하나의 동작은 생략될 수 있다. 도 19는 다양한 실시예에 따른 전자 장치(예: 전자 장치, 전자 장치의 프로세서, 프로세서 또는 전자 장치)의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 다양한 실시예에 따르면, 파라미터 변경 방법의 수행 절차는 도 10에 기재된 동작 1003에 대한 상세 동작일 수 있다. 동작 1901과 같이, 전자 장치(예: 프로세서(120 또는 500))는 생체 정보 측정 동작을 수행할 수 있다. 일 실시 예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 적어도 하나의 제2 센서를 동작시켜 선택된(또는, 지정 된) 시간 동안 빛을 발광시키고, 적어도 하나의 제2 센서로부터 출력되는 신호를 획득할 수 있다.동작 1903과 같이, 전자 장치(예: 프로세서(120 또는 500))는 사용자의 상태를 확인할 수 있다. 일 실시예에 따 르면, 전자 장치(예: 프로세서(120 또는 500))는 취침 상태 또는 활동 상태 등과 같은 사용자의 상태를 확인할 수 있다. 동작 1905와 같이, 전자 장치(예: 프로세서(120 또는 500))는 움직임 조건 변경이 필요한 상태인지 판단할 수 있다. 다양한 실시예에 따르면, 사용자 상태가 취침 상태라면 움직임이 없거나 움직임의 강도가 낮을 것으로 판 단할 수 있기 때문에 움직임 조건이 필요하지 않을 수 있다. 움직임 조건이 필요하지 않은 경우 움직임 조건 변 경이 필요한 상태라고 판단될 수 있다. 동작 1905에서 움직임 조건 변경이 필요하지 않는다고 판단되면, 동작 1911과 같이, 전자 장치(예: 프로세서 (120 또는 500))는 선택된(또는, 지정된) 움직임 조건에 기반하여 생체 정보를 측정할 수 있다. 동작 1905에서 움직임 조건 변경이 필요하다고 판단되면, 동작 1907과 같이, 전자 장치(예: 프로세서(120 또는 500))는 사용자 상태에 기반하여 움직임 조건을 변경할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 움직임을 판단하는 조건을 생략하거나 만족하는 움직임 기준값을 감소시킬 수 있다. 동작 1907에서 움직임 조건이 변경되면, 동작 1909와 같이, 전자 장치(예: 프로세서(120 또는 500))는 변경된 움직임 조건에 기반하여 생체 정보를 측정할 수 있다. 다양한 실시예에 따르면, 동작 1901에서 동작 1911 중 적 어도 하나의 동작은 생략될 수 있다. 도 20은 다양한 실시예에 따른 전자 장치(예: 전자 장치(101 또는 400) 또는 전자 장치(101 또는 400)과 무선 또는 유선 통신을 통하여 연결된 외부 전자 장치(예: 스마트 폰))의 화면 구성을 도시한 도면이다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 선택된(또는, 지정된) 주기마다 측정된 생 체 정보(예: 심박 정보)를 메모리 저장할 수 있으며, 입력에 기반하여 측정된 결과를 화면에 표시할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정된 심박 정보를 시간 단위, 일 단위, 월 단위 등으로 구분하여 표시할 수 있다. 일 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정 결과를 시간 단위로 표시하는 경우, 매시간 동안에 측정된 심박 정보의 평균값을 시간 단위 로 표시할 수 있다. 다른 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정 결과를 일 단위로 표시하는 경우, 매일 동안에 측정된 심박 정보의 평균값을 일 단위로 표시할 수 있다. 또 다른 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 측정 결과를 월 단위로 표시하는 경우, 매달 동안에 측정된 심박 정보의 평균값을 월 단위로 하여 표시할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 심박 정보의 평균값뿐만 아니라, 시간 단위로 표시되는 심박 정보의 최고값 및 최소값, 을 표시할 수도 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 심박 정보의 결과를 표시할 때, 평균 값이 일정 기준보다 높거나 낮은 시점에 대하여 지시자를 함께 표시할 수 있다. 예를 들어, 전자 장치(예: 프로 세서(120 또는 500))는 선택된(또는, 지정된) 색상, 선택된(또는, 지정된) 문구, 선택된(또는, 지정된) 아이콘 등을 이용하여 지시자를 표시할 수 있다. 도시된 도면에서는 3시 구간에 표시된 느낌표가 평균 값 이상의 심박 정보가 측정됨을 나타내는 지시자가 될 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 프로세서(120 또는 500))는 지시자에 대한 입력이 감지되면, 해당 구간 과 관련된 상세 정보를 표시할 수 있다. 예를 들어, 전자 장치(예: 프로세서(120 또는 500))는 입력이 감지된 지시자에 대응하는 시간 구간에 해당하는 심박 정보와 해당 구간에 대한 전자 장치 또는 사용자의 상태 정보(예: 소모 칼로리 등)를 함께 표시할 수 있다. 도시된 도면에서는 사용자가 3시 15분부터 3시 20분까 지 달리기를 수행하여 심박 정보가 증가하였음을 나타내고 있다. 다양한 실시예에 따른 전자 장치의 운용 방법은, 적어도 하나의 제1 센서(예: 근접 센서, 가속도 센서, 자이로 센서 또는 지자기 센서 중 적어도 하나)를 이용하여 상기 전자 장치가 상기 사용자의 신체의 일부에 착용되었는 지 여부를 판단하는 동작, 상기 전자 장치가 상기 사용자의 신체의 일부에 착용된 시점으로부터 선택된(또는, 지정된) 제1 시간 주기 (a first period of time)를 경과하는 시점 바로 전(immediately before) 및/또는 바로 후(immediately after)의 제2 시간 주기 동안에 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기전자 장치의 움직임에 관한 정보를 획득하는 동작, 상기 움직임에 관한 정보에 적어도 일부 기초하여, 적어도 하나의 제2 센서(예: 심박 센서)를 활성화(또는, 작동 또는 트리거)하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 제2 시간 주기는, 상기 제1 시간 주기보다 짧을 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제2 센서는, 생체 센서를 포함할 수 있다. 다양한 실시예에 따르면, 상기 생체 센서는, 심박 센서, 혈압 센서, 심전도 센서, 피부 수분도 센서, 또는 산소 포화도 센서 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 상기 활성화(또는, 작동 또는 트리거) 동작은, 상기 움직임에 관한 정보가 선택된(또 는, 지정된) 조건을 만족하지 않는 경우, 상기 제2 시간 주기를 경과하는 시점 바로 후의, 상기 제1 시간 주기 보다 짧은 제3 시간 주기 동안에, 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움 직임에 관한 추가 정보를 획득하는 동작, 및 상기 추가 정보에 적어도 일부에 더 기초하여, 상기 적어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 제2 시간 주기 또는 상기 제3 시간 주기 중 적어도 하나는, 상기 제1 시간 주기 를 경과하는 시점을 포함할 수 있다. 다양한 실시예에 따르면, 상기 제2 시간 주기는 상기 제1 시간 주기를 경과하는 시점을 포함할 수 있다. 다양한 실시예에 따르면, 상기 활성화(또는, 작동 또는 트리거) 동작은, 상기 활성화(또는, 작동 또는 트리거) 된 제2 센서로부터 데이터를 선택된(또는, 지정된) 시간 내에 수신하지 않은 경우, 상기 선택된(또는, 지정된) 시간이 경과한 후에, 상기 제2 센서를 다시 활성화(또는, 작동 또는 트리거)하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 활성화(또는, 작동 또는 트리거)하는 동작은, 상기 선택된(또는, 지정된) 시간이 경과하는 시점 전의 상기 제2 시간 주기와 실질적으로 동일한 시간 주기 동안에, 상기 적어도 하나의 제1 센서 의 적어도 일부를 이용하여 상기 전자 장치의 움직임에 관한 추가 정보를 획득하고, 상기 추가 정보에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 다시 활성화(또는, 작동 또는 트리거)하는 동작을 포함할 수 있 다. 다양한 실시예에 따르면, 상기 전자 장치의 운용 방법은, 상기 적어도 하나의 제1 센서 또는 상기 적어도 하나 의 제2 센서 중 적어도 하나로부터 데이터를 획득하는 동작, 및 상기 획득된 데이터에 적어도 일부 기초하여 상 기 제1 시간 주기 및/또는 제2 시간 주기 및 또는 제3 시간 주기를 변경하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 전자 장치의 운용 방법은, 상기 적어도 하나의 제1 센서 또는 상기 적어도 하나 의 제2 센서 중 적어도 하나로부터 데이터를 획득하는 동작, 및 상기 데이터에 적어도 일부 기초하여, 상기 적 어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하도록 하는 적어도 하나의 조건을 변경하는 동작을 더 포함할 수 있다. 다양한 실시옝 따르면, 상기 전자 장치의 운용 방법은, 상기 적어도 하나의 제1 센서 또는 상기 적어도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하는 동작, 및 상기 데이터에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)시키는 시간 주기 또는 샘플링 비율 중 적어도 하나를 변경 하는 동작을 포함할 수 있다. 다양한 실시예에 따른 전자 장치의 운용 방법은 적어도 하나의 제1 센서를 이용하여 전자 장치가 사용자의 신체 의 일부에 착용되었는지 여부를 판단하는 동작, 상기 전자 장치가 상기 사용자의 신체의 일부에 착용된 시점으 로부터 선택된(또는, 지정된) 시간 주기를 경과하는 시점에서 선택된(또는, 지정된) 시간 범위 내에 측정된 전 자 장치의 움직임의 적어도 일부에 기반하여 적어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하는 동 작 및 상기 적어도 하나의 제2 센서를 통하여 생체 정보를 측정하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제1 센서는, 근접센서, 자이로센서, 지자기 센서 또는 가속도 센 서 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 상기 움직임의 적어도 일부가 선택된(또는, 지정된) 조건을 만족하지 않는 경우, 상기 제2 센서를 활성화(또는, 작동 또는 트리거)하지 않고, 상기 시간 주기를 경과하는 시점부터 선택된(또는, 지정 된) 시간 동안 상기 적어도 하나의 제1 센서의 적어도 일부를 이용하여 상기 전자 장치의 움직임에 관한 추가 정보를 획득하는 동작 및 상기 추가 정보에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하도록 하는 동작을 포함할 수 있다.다양한 실시예에 따르면, 상기 적어도 하나의 제2 센서에 기반하여 생체 정보를 측정하는 동작은 상기 생체 정 보의 측정이 실패하면, 실패횟수를 누적하는 동작 및 상기 누적된 실패횟수가 선택된(또는, 지정된) 조건을 만 족하면 상기 제2 센서를 비활성화하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제2 센서에 기반하여 생체 정보를 측정하는 동작은 상기 적어도 하나의 제1 센서 또는 상기 적어도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하는 동작 및 상기 데 이터에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)하도록 하는 적 어도 하나의 조건을 변경하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제2 센서에 기반하여 생체 정보를 측정하는 동작은 상기 적어도 하나의 제1 센서 또는 상기 적어도 하나의 제2 센서 중 적어도 하나로부터 데이터를 획득하는 동작 및 상기 데 이터에 적어도 일부 기초하여, 상기 적어도 하나의 제2 센서를 활성화(또는, 작동 또는 트리거)시키는 시간 주 기 또는 샘플링 비율 중 적어도 하나를 변경하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제 2 센서에 기반하여 생체 정보를 측정하는 동작은, 상기 사용자 의 신체 특성(예: 피부 색) 또는 상태(예: 취침 상태 또는 활동 상태)에 대한 데이터를 획득하는 동작, 및 상기 데이터에 적어도 일부 기초하여, 상기 적어도 하나의 제 2 센서를 활성화(또는, 작동 또는 트리거)하도록 하는 적어도 하나의 조건을 변경하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 움직임에 관한 추가 정보를 획득하는 동작은 상기 적어도 하나의 제1 센서 또는 상기 적어도 하나의 제2 센서 중 적어도 하나로부터 획득된 데이터에 기반하여 상기 추가 정보를 획득하는 선택 된(또는, 지정된) 시간을 변경하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치를 운용하는 방법은, 사용자의 신체에 대한 전자 장치의 근접 여부를 판단하 는 동작, 상기 전자 장치가 상기 사용자의 신체의 일부에 근접한 경우, 선택된(또는, 지정된) 주기를 경과하는 시점으로부터 선택된(또는, 지정된) 시간 범위 내에, 적어도 하나의 제1 센서를 이용하여 상기 전자 장치의 움 직임에 관한 정보를 획득하는 동작, 및 상기 움직임에 관한 정보에 적어도 일부 기초하여, 적어도 하나의 제 2 센서를 통하여 상기 사용자의 생체 정보를 획득하는 동작을 포함할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면,\"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로 그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구 현될 수 있다. 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 하나 이상의 프로세서가 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digital versatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장 치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또 한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해 서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시예 의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시예에 따른 모듈, 프로그램 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으로실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다."}
{"patent_id": "10-2015-0113972", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예에 따른 네트워크 환경 내의 전자 장치를 도시한 도면이다. 도 2는 다양한 실시예에 따른 전자 장치의 블록도이다. 도 3은 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 4a 내지 도 4c는 다양한 실시예들에 따른 전자 장치를 도시한 도면이다. 도 5a는 다양한 실시예들에 따른 프로세서의 구성을 도시한 도면이다. 도 5b는 다양한 실시예들에 따른 전자 장치의 생체 정보의 측정 동작을 도시한 도면이다. 도 6은 본 발명의 다양한 실시예에 따른 전자 장치의 생체 정보 측정 동작을 도시한 흐름도이다. 도 7은 본 발명의 다양한 실시예에 따른 전자 장치의 상태 판단 방법의 수행 절차를 도시한 흐름도이다. 도 8은 본 발명의 다양한 실시예에 따른 전자 장치의 센서 동작 방법의 수행 절차를 도시한 흐름도이다. 도 9는 다양한 실시예에 따른 전자 장치의 생체 정보 측정 방법의 수행 절차를 도시한 흐름도이다. 도 10은 다양한 실시예에 따른 전자 장치의 생체 정보 측정 방법의 수행 절차를 도시한 흐름도이다. 도 11은 다양한 실시예에 따른 전자 장치의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 도 12는 다양한 실시예에 따른 전자 장치의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 도 13은 다양한 실시예에 따른 전자 장치의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 도 14는 다양한 실시예에 따른 전자 장치의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 도 15는 다양한 실시예에 따른 전자 장치의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 도 16은 다양한 실시예에 따른 측정 트리거 변경 방법의 수행 절차를 도시한 흐름도이다. 도 17은 다양한 실시예에 따른 전자 장치의 측정 트리거 변경 동작을 도시한 도면이다. 도 18은 다양한 실시예에 따른 전자 장치의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 도 19는 다양한 실시예에 따른 전자 장치의 측정 파라미터 변경 방법의 수행 절차를 도시한 흐름도이다. 도 20은 다양한 실시예에 따른 전자 장치의 화면 구성을 도시한 도면이다."}
