{"patent_id": "10-2021-0011655", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0108541", "출원번호": "10-2021-0011655", "발명의 명칭": "콘텐츠 공유 범위 설정 방법 및 장치", "출원인": "라인플러스 주식회사", "발명자": "이재의"}}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법에 있어서,사용자 계정과 연관된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 디스플레이 상에 표시하는 단계;제1 사용자 입력에 응답하여, 상기 제1 콘텐츠가 상기 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는 것을 상기 디스플레이 상에 표시하는 단계; 및상기 제1 콘텐츠를 상기 제1 콘텐츠가 할당된 적어도 하나의 그룹과 연관시키는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 사용자 입력에 응답하여, 상기 제1 콘텐츠가 상기 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에할당되는 것을 상기 디스플레이 상에 표시하는 단계는,상기 복수의 콘텐츠 공유 그룹 및 상기 제1 콘텐츠 각각을 상기 디스플레이 상에 시각적으로 구분된 영역에 표시하는 단계; 및상기 제1 사용자 입력에 응답하여, 상기 제1 콘텐츠를 선택하여 상기 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹으로 이동하는 것을 상기 디스플레이 상에 표시하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 복수의 콘텐츠 공유 그룹 중 상기 제1 콘텐츠가 할당된 적어도 하나의 그룹을 상기 제1 콘텐츠가 할당되지않은 그룹과 시각적으로 구분하여 상기 디스플레이 상에 표시하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 복수의 콘텐츠 공유 그룹 중 상기 제1 콘텐츠가 할당된 적어도 하나의 그룹을 상기 제1 콘텐츠가 할당되지않은 그룹과 시각적으로 구분하여 상기 디스플레이 상에 표시하는 단계는,상기 제1 콘텐츠가 할당된 상기 적어도 하나의 그룹의 크기, 형태 또는 색상 중 적어도 하나를 변경하여 상기디스플레이 상에 표시하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 콘텐츠는 상기 복수의 다른 사용자 중 제1 사용자와 연관되며,공개특허 10-2022-0108541-3-상기 방법은,상기 제1 사용자와 연관된 제2 콘텐츠를 수신하는 경우, 상기 제1 콘텐츠가 할당된 상기 적어도 하나의 그룹에상기 제2 콘텐츠를 할당하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 복수의 콘텐츠 공유 그룹 중 제1 그룹에 속하는 사용자와 연관된 제2 콘텐츠를 수신하는 경우, 상기 제1그룹에 상기 제2 콘텐츠를 할당하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제1 사용자 입력에 응답하여, 제1 콘텐츠가 상기 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는 것을 상기 디스플레이 상에 표시하는 단계는,상기 제1 콘텐츠의 대표 이미지가 상기 제1 콘텐츠가 할당된 적어도 하나의 그룹 상에 표시되는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,제2 사용자 입력에 응답하여, 상기 적어도 하나의 그룹에 대한 상기 제1 콘텐츠의 할당을 취소하는 단계를 더포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 복수의 콘텐츠 공유 그룹 중 제1 그룹에 할당된 콘텐츠를 포함하는 제1 페이지를 상기 디스플레이에 표시하는 단계; 및상기 제1 페이지를 스와이핑(swiping)하는 제2 사용자 입력에 응답하여, 상기 복수의 콘텐츠 공유 그룹 중 제2그룹에 할당된 콘텐츠를 포함하는 제2 페이지를 표시하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제1 페이지에 포함된 콘텐츠를 선택하여 상기 제2 페이지로 이동하는 제3 사용자 입력에 응답하여, 상기제1 그룹에 할당된 콘텐츠를 상기 제2 그룹에 할당하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 디스플레이에 표시된 상기 복수의 콘텐츠 공유 그룹 중 제1 그룹을 선택하기 위한 제2 사용자 입력을 수신하는 단계; 및공개특허 10-2022-0108541-4-상기 제2 사용자 입력에 응답하여, 상기 제1 그룹에 할당된 콘텐츠를 포함하는 페이지를 표시하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 복수의 콘텐츠 공유 그룹 중 적어도 하나는 상기 사용자 계정과 연관된 소셜 네트워킹 서비스 상의 그룹대화방 정보를 기초로 생성되는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 복수의 콘텐츠 공유 그룹에 할당된 복수의 콘텐츠를 상기 디스플레이 상에 표시하는 단계; 및상기 복수의 콘텐츠 중 제2 콘텐츠에 대한 제4 사용자 입력에 응답하여, 상기 제2 콘텐츠가 할당된 상기 적어도하나의 그룹을 상기 디스플레이 상에 표시하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,상기 복수의 콘텐츠 공유 그룹에 할당된 복수의 콘텐츠를 상기 디스플레이 상에 표시하는 단계; 및상기 복수의 콘텐츠 중 제2 콘텐츠에 대한 제5 사용자 입력에 응답하여, 상기 제2 콘텐츠를 조회한 다른 사용자에 관한 정보를 상기 디스플레이 상에 표시하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법에 있어서,사용자 계정과 연관된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 디스플레이 상에 표시하는 단계;콘텐츠 분석 모델에 의해 상기 제1 콘텐츠와 상기 복수의 콘텐츠 공유 그룹에 할당된 복수의 콘텐츠의 유사도를결정하는 단계; 및상기 유사도에 기초하여, 상기 제1 콘텐츠가 상기 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는것을 디스플레이 상에 표시하는 단계; 및상기 제1 콘텐츠를 상기 제1 콘텐츠가 할당된 적어도 하나의 그룹과 연관시키는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제1 콘텐츠에 포함된 인물 객체를 추출하는 단계;상기 콘텐츠 분석 모델에 의해, 상기 추출된 인물 객체 및 상기 사용자 계정과 연관된 적어도 하나의 다른 사용자에 관한 정보를 기초로 추가의 콘텐츠 공유 그룹을 생성하는 단계; 및공개특허 10-2022-0108541-5-상기 생성된 추가의 콘텐츠 공유 그룹에 상기 제1 콘텐츠를 할당하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 유사도에 기초하여, 상기 제1 콘텐츠가 상기 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는것을 디스플레이 상에 표시하는 단계는,상기 복수의 콘텐츠 공유 그룹 및 상기 제1 콘텐츠 각각을 상기 디스플레이 상에 시각적으로 구분된 영역에 표시하는 단계; 및사용자 입력에 응답하여, 상기 제1 콘텐츠를 선택하여 상기 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹으로 이동하는 것을 상기 디스플레이 상에 표시하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 복수의 콘텐츠 공유 그룹 중 제1 그룹에 할당된 콘텐츠를 포함하는 제1 페이지를 상기 디스플레이에 표시하는 단계; 및상기 제1 페이지를 스와이핑하는 제2 사용자 입력에 응답하여, 상기 복수의 콘텐츠 공유 그룹 중 제2 그룹에 할당된 콘텐츠를 포함하는 제2 페이지를 표시하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항 내지 제18항 중 어느 한 항에 따른 방법을 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2021-0011655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "콘텐츠 공유 범위 설정 장치로서,통신 모듈;메모리;디스플레이; 및상기 메모리와 연결되고, 상기 메모리에 포함된 컴퓨터 판독 가능한 적어도 하나의 프로그램을 실행하도록 구성된 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로그램은,사용자 계정과 연관된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 상기 디스플레이 상에 표시하고,제1 사용자 입력에 응답하여, 상기 제1 콘텐츠가 상기 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는 것을 상기 디스플레이 상에 표시하고,상기 제1 콘텐츠를 상기 제1 콘텐츠가 할당된 적어도 하나의 그룹과 연관시키기 위한 명령어들을 포함하는, 콘텐츠 공유 범위 설정 장치.공개특허 10-2022-0108541-6-"}
{"patent_id": "10-2021-0011655", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은 사용자 계정과 연관 된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 디스플레이 상에 표시하는 단계, 제1 사용자 입력에 응답하여, 제1 콘텐츠가 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는 것을 디스플레이 상에 표시하는 단계, 및 제1 콘텐츠를 제1 콘텐츠가 할당된 적어도 하나의 그룹과 연 관시키는 단계를 포함한다."}
{"patent_id": "10-2021-0011655", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 콘텐츠 공유 범위 설정 방법 및 장치에 관한 것으로, 구체적으로 사용자 인터페이스 상에 시각적으로 구분되어 표시되는 복수의 콘텐츠 공유 그룹 중 하나 이상의 그룹을 선택함으로써 콘텐츠를 공유할 사용자 그룹 의 범위를 설정할 수 있는 콘텐츠 공유 범위 설정 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2021-0011655", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "카메라, 마이크, 터치 디스플레이 등과 같이 다양한 멀티미디어 데이터의 입출력이 가능한 스마트폰, 태블릿 PC, 랩탑(laptop) 컴퓨터 등의 휴대용 장치의 보급이 널리 확대되고 있다. 뿐만 아니라, 사용자들이 실시간으 로 다양한 콘텐츠와 의견을 공유할 수 있는 소셜 네트워킹 서비스(SNS) 플랫폼이 제공되고 있다. 이러한 환경에 서, 휴대용 장치에 부착된 카메라 등을 활용하여 일상생활의 모습이나 관심 물품의 사진이나 영상을 촬영하고 SNS 플랫폼에 업로드하여 공유하는 것이 일상적인 일이 되었다. 한편 SNS 플랫폼에서 공유하고자 하는 콘텐츠의 공개 범위는 대체로 비공개, 친구공개 및 전체공개로 제한된다. 그러나 SNS 상에서는 쉽게 다른 사용자와 친구를 맺을 수 있어, 대부분의 SNS는 개인정보 유출의 문제를 완전히 해결하지 못하고 있는 실정이다. 또한, 이와 같이 콘텐츠 공유 범위의 옵션이 제한적으로 제공되므로, 사용자들 은 각각의 콘텐츠 내용에 따라 공유 범위를 다르게 설정할 수 없다는 문제가 있다."}
{"patent_id": "10-2021-0011655", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상기와 같은 문제를 해결하기 위한 콘텐츠 공유 범위 설정 방법 및 장치를 제공한다. 구체적으로, 사용자 인터페이스 상에 시각적으로 구분되어 표시되는 복수의 콘텐츠 공유 그룹 중 하나 이상의 그룹을 선택함으로써 콘텐츠를 공유할 사용자 그룹의 범위를 설정할 수 있는 콘텐츠 공유 범위 설정 방법 및 장 치가 제공된다."}
{"patent_id": "10-2021-0011655", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은, 사용자 계정과 연 관된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 디스플레이 상에 표시하는 단계, 제1 사용자 입력에 응답하여, 제1 콘텐츠가 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그 룹에 할당되는 것을 디스플레이 상에 표시하는 단계, 및 제1 콘텐츠를 제1 콘텐츠가 할당된 적어도 하나의 그룹 과 연관시키는 단계를 포함한다. 일 실시예에 따르면, 제1 사용자 입력에 응답하여, 제1 콘텐츠가 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그 룹에 할당되는 것을 디스플레이 상에 표시하는 단계는, 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠 각각을 디스플 레이 상에 시각적으로 구분된 영역에 표시하는 단계, 및 제1 사용자 입력에 응답하여, 제1 콘텐츠를 선택하여 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹으로 이동하는 것을 디스플레이 상에 표시하는 단계를 포함한다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은, 복수의 콘텐츠 공유 그룹 중 제1 콘텐츠가 할당된 적어도 하나의 그룹을 제1 콘텐츠가 할당되지 않은 그룹과 시각적으로 구분하여 디스플레 이 상에 표시하는 단계를 더 포함한다. 일 실시예에 따르면, 복수의 콘텐츠 공유 그룹 중 제1 콘텐츠가 할당된 적어도 하나의 그룹을 제1 콘텐츠가 할 당되지 않은 그룹과 시각적으로 구분하여 디스플레이 상에 표시하는 단계는, 제1 콘텐츠가 할당된 적어도 하나 의 그룹의 크기, 형태 또는 색상 중 적어도 하나를 변경하여 디스플레이 상에 표시하는 단계를 포함한다.일 실시예에 따르면, 제1 콘텐츠는 적어도 하나의 다른 사용자 중 제1 사용자와 연관되며, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은 제1 사용자와 연관된 제2 콘텐츠를 수신하는 경우, 제1 콘텐츠가 할당 된 적어도 하나의 그룹에 제2 콘텐츠를 할당하는 단계를 더 포함한다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은, 복수의 콘텐츠 공유 그룹 중 제1 그룹에 속하는 사용자와 연관된 제2 콘텐츠를 수신하는 경우, 제1 그룹에 제2 콘텐츠를 할당하는 단계를 더 포함한다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은 제1 사용자 입력에 응답하여, 제1 콘텐츠가 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는 것을 디스플레이 상에 표시하는 단계 는, 제1 콘텐츠의 대표 이미지가 제1 콘텐츠가 할당된 적어도 하나의 그룹 상에 표시되는 단계를 포함한다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은, 제2 사용자 입력에 응답하여, 적어도 하나의 그룹에 대한 제1 콘텐츠의 할당을 취소하는 단계를 더 포함한다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은 복수의 콘텐츠 공유 그룹 중 제1 그룹에 할당된 콘텐츠를 포함하는 제1 페이지를 디스플레이에 표시하는 단계, 및 제1 페이지를 스와이핑 (swiping)하는 제2 사용자 입력에 응답하여, 복수의 콘텐츠 공유 그룹 중 제2 그룹에 할당된 콘텐츠를 포함하는 제2 페이지를 표시하는 단계를 더 포함한다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은 제1 페이지에 포함된 콘텐츠 를 선택하여 제2 페이지로 이동하는 제3 사용자 입력에 응답하여, 제1 그룹에 할당된 콘텐츠를 제2 그룹에 할당 하는 단계를 더 포함한다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은 디스플레이에 표시된 복수의 콘텐츠 공유 그룹 중 제1 그룹을 선택하기 위한 제2 사용자 입력을 수신하는 단계, 및 제2 사용자 입력에 응답 하여, 제1 그룹에 할당된 콘텐츠를 포함하는 페이지를 표시하는 단계를 더 포함한다. 일 실시예에 따르면, 복수의 콘텐츠 공유 그룹 중 적어도 하나는 사용자 계정과 연관된 소셜 네트워킹 서비스 상의 그룹 대화방 정보를 기초로 생성된다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은 복수의 콘텐츠 공유 그룹에 할당된 복수의 콘텐츠를 디스플레이 상에 표시하는 단계, 및 복수의 콘텐츠 중 제2 콘텐츠에 대한 제4 사용자 입력에 응답하여, 제2 콘텐츠가 할당된 적어도 하나의 그룹을 디스플레이 상에 표시하는 단계를 더 포함한다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은 복수의 콘텐츠 공유 그룹에 할당된 복수의 콘텐츠를 디스플레이 상에 표시하는 단계, 및 복수의 콘텐츠 중 제2 콘텐츠에 대한 제5 사용자 입력에 응답하여, 제2 콘텐츠를 조회한 다른 사용자에 관한 정보를 디스플레이 상에 표시하는 단계를 더 포함한 다. 본 개시의 다른 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법에 있어서, 사용자 계정과 연관된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 디 스플레이 상에 표시하는 단계, 콘텐츠 분석 모델에 의해 제1 콘텐츠와 복수의 콘텐츠 공유 그룹에 할당된 복수 의 콘텐츠의 유사도를 결정하는 단계, 및 유사도에 기초하여, 제1 콘텐츠가 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는 것을 디스플레이 상에 표시하는 단계, 및 제1 콘텐츠를 제1 콘텐츠가 할당된 적어도 하 나의 그룹과 연관시키는 단계를 포함한다. 일 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법은 제1 콘텐츠에 포함된 인물 객 체를 추출하는 단계, 콘텐츠 분석 모델에 의해, 추출된 인물 객체 및 사용자 계정과 연관된 적어도 하나의 다른 사용자에 관한 정보를 기초로 추가의 콘텐츠 공유 그룹을 생성하는 단계, 및 생성된 추가의 콘텐츠 공유 그룹에 제1 콘텐츠를 할당하는 단계를 더 포함한다. 일 실시예에 따르면, 유사도에 기초하여, 제1 콘텐츠가 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당 되는 것을 디스플레이 상에 표시하는 단계는, 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠 각각을 디스플레이 상에 시각적으로 구분된 영역에 표시하는 단계, 및 사용자 입력에 응답하여, 제1 콘텐츠를 선택하여 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹으로 이동하는 것을 디스플레이 상에 표시하는 단계를 포함한다. 일 실시예에 따르면, 복수의 콘텐츠 공유 그룹 중 제1 그룹에 할당된 콘텐츠를 포함하는 제1 페이지를 디스플레 이에 표시하는 단계, 및 제1 페이지를 스와이핑하는 제2 사용자 입력에 응답하여, 복수의 콘텐츠 공유 그룹 중 제2 그룹에 할당된 콘텐츠를 포함하는 제2 페이지를 표시하는 단계를 더 포함한다. 본 개시의 또 다른 실시예에 따르면, 사용자 단말에 의해 수행되는 콘텐츠 공유 범위 설정 방법에 따른 컴퓨터 에서 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 제공된다. 본 개시의 또 다른 실시예에 따르면, 콘텐츠 공유 범위 설정 장치로서, 통신 모듈, 메모리, 디스플레이 및 메모 리와 연결되고, 메모리에 포함된 컴퓨터 판독 가능한 적어도 하나의 프로그램을 실행하도록 구성된 적어도 하나 의 프로세서를 포함하고, 적어도 하나의 프로그램은, 사용자 계정과 연관된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 디스플레이 상에 표시하고, 제1 사용자 입력에 응답하 여, 제1 콘텐츠가 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는 것을 디스플레이 상에 표시하고, 제1 콘텐츠를 제1 콘텐츠가 할당된 적어도 하나의 그룹과 연관시키기 위한 명령어들을 포함한다."}
{"patent_id": "10-2021-0011655", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 사용자는 공유할 콘텐츠 및 미리 생성된 콘텐츠 공유 그룹을 동시에 시각적으로 확인하여, 콘텐츠의 내용에 따라 콘텐츠를 공유할 그룹을 쉽게 결정할 수 있다. 본 개시의 일 실시예에 따르면, 사용자는 시각적으로 콘텐츠가 할당된 그룹을 콘텐츠가 할당되지 않은 그룹과 쉽게 구분할 수 있다. 본 개시의 일 실시예에 따르면, 사용자는 시각적으로 콘텐츠 공유 그룹들에 대한 특정 콘텐츠의 공유 범위 또는 공유 여부를 쉽게 변경하고, 이와 같은 콘텐츠 공유 상태의 변경 결과를 그래픽 사용자 인터페이스를 통해 직관 적으로 확인할 수 있다. 본 개시의 일 실시예에 따르면, 사용자는 콘텐츠 공유 서비스에서 복수의 콘텐츠 공유 그룹에 공유된 콘텐츠들 과 사용자 계정에만 연관되어 다른 사용자들에게 공유되지 않은 콘텐츠들을 구분하여 저장 및 관리할 수 있다. 본 개시의 일 실시예에 따르면, 사용자는 그래픽 사용자 인터페이스를 이용하여 하나의 콘텐츠 공유 그룹에 이 미 할당된 콘텐츠를 다른 콘텐츠 공유 그룹으로 재할당 또는 추가 할당함으로써, 해당 콘텐츠의 공유 범위를 쉽 게 변경 또는 확장할 수 있다. 본 개시의 일 실시예에 따르면, 사용자는 자신이 업로드한 모든 콘텐츠 각각이 할당 및 공유된 콘텐츠 공유 그 룹의 범위를 시각적으로 간단하게 확인할 수 있고, 콘텐츠 각각에 대한 다른 사용자의 조회 여부를 확인함으로 써 조회하지 않은 다른 사용자에게 콘텐츠 조회 요청에 대한 리마인더를 제공할 수 있다. 본 개시의 일 실시예에 따르면, 사용자는 직접 콘텐츠를 분석하여 해당 콘텐츠가 할당될 콘텐츠 공유 그룹을 결 정할 필요 없이, 인공지능 기반의 콘텐츠 분석 모델에 의해 제공되는 콘텐츠 공유 그룹 추천 기능을 이용하여 쉽게 콘텐츠를 할당할 공유 그룹을 결정할 수 있다."}
{"patent_id": "10-2021-0011655", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 실시를 위한 구체적인 내용을 첨부된 도면을 참조하여 상세히 설명한다. 다만, 이하의 설명에 서는 본 개시의 요지를 불필요하게 흐릴 우려가 있는 경우, 널리 알려진 기능이나 구성에 관한 구체적 설명은 생략하기로 한다. 첨부된 도면에서, 동일하거나 대응하는 구성요소에는 동일한 참조부호가 부여되어 있다. 또한, 이하의 실시예 들의 설명에 있어서, 동일하거나 대응되는 구성요소를 중복하여 기술하는 것이 생략될 수 있다. 그러나, 구성 요소에 관한 기술이 생략되어도, 그러한 구성요소가 어떤 실시예에 포함되지 않는 것으로 의도되지는 않는다. 개시된 실시예의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예 들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시가 완전하도록 하고, 본 개시가 통상의 기술 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것일 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 개시된 실시예에 대해 구체적으로 설명하기로 한다. 본 명세서에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 관련 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서, 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어 가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서의 단수의 표현은 문맥상 명백하게 단수인 것으로 특정하지 않는 한, 복수의 표현을 포함한다. 또한, 복수의 표현은 문맥상 명백하게 복수인 것으로 특정하지 않는 한, 단수의 표현을 포함한다. 명세서 전체 에서 어떤 부분이 어떤 구성요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에서 사용되는 '모듈' 또는 '부'라는 용어는 소프트웨어 또는 하드웨어 구성요소를 의미하며, '모 듈' 또는 '부'는 어떤 역할들을 수행한다. 그렇지만, '모듈' 또는 '부'는 소프트웨어 또는 하드웨어에 한정되 는 의미는 아니다. '모듈' 또는 '부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서, '모듈' 또는 '부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이 크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 또는 변수들 중 적어도 하나를 포 함할 수 있다. 구성요소들과 '모듈' 또는 '부'들은 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '모듈' 또는 '부'들로 결합되거나 추가적인 구성요소들과 '모듈' 또는 '부'들로 더 분리될 수 있다. 본 개시의 일 실시예에 따르면, '모듈' 또는 '부'는 프로세서 및 메모리로 구현될 수 있다. '프로세서'는 범용 프로세서, 중앙 처리 장치(CPU), 마이크로프로세서, 디지털 신호 프로세서(DSP), 제어기, 마이크로제어기, 상태 머신 등을 포함하도록 넓게 해석되어야 한다. 몇몇 환경에서, '프로세서'는 주문형 반도체(ASIC), 프로그램가 능 로직 디바이스(PLD), 필드 프로그램가능 게이트 어레이(FPGA) 등을 지칭할 수도 있다. '프로세서'는, 예를 들어, DSP와 마이크로프로세서의 조합, 복수의 마이크로프로세서들의 조합, DSP 코어와 결합한 하나 이상의 마이크로프로세서들의 조합, 또는 임의의 다른 그러한 구성들의 조합과 같은 처리 디바이스들의 조합을 지칭할 수 도 있다. 또한, '메모리'는 전자 정보를 저장 가능한 임의의 전자 컴포넌트를 포함하도록 넓게 해석되어야 한 다. '메모리'는 임의 액세스 메모리(RAM), 판독-전용 메모리(ROM), 비-휘발성 임의 액세스 메모리(NVRAM), 프 로그램가능 판독-전용 메모리(PROM), 소거-프로그램가능 판독 전용 메모리(EPROM), 전기적으로 소거가능 PROM(EEPROM), 플래쉬 메모리, 자기 또는 광학 데이터 저장장치, 레지스터들 등과 같은 프로세서-판독가능 매체 의 다양한 유형들을 지칭할 수도 있다. 프로세서가 메모리로부터 정보를 판독하고/하거나 메모리에 정보를 기 록할 수 있다면 메모리는 프로세서와 전자 통신 상태에 있다고 불린다. 프로세서에 집적된 메모리는 프로세서 와 전자 통신 상태에 있다. 본 개시에서, '콘텐츠 공유 서비스'는, 컴퓨팅 장치에 설치된 소셜 네트워킹 서비스를 제공하기 위한 어플리케 이션 또는 이와 관련된 웹 브라우저의 서버에 업로드 된 콘텐츠를 하나 이상의 사용자(또는 사용자 계정)가 열 람, 공유, 또는 사용할 수 있는 서비스를 지칭할 수 있다. 콘텐츠 공유 서비스는 기존 인터넷 기반의 소셜 네트 워킹 서비스, 인스턴트 메시징 서비스, 가상 커뮤니티 서비스 등을 제공하는 서버를 통해 부가적으로 제공될 수 있으나, 이에 한정되는 것은 아니며, 콘텐츠 공유 서비스만을 제공하기 위한 서버가 제공될 수도 있다. 본 개시에서, '사용자 계정'은 사용자가 콘텐츠 공유 서비스를 제공 받기 위해 해당 서비스의 가입을 통해 생성 하고 이용하는 계정 또는 이와 관련된 데이터를 나타낼 수 있다. 예를 들어, 콘텐츠 공유 서비스 제공 어플리 케이션의 사용자 계정은, 콘텐츠 공유 서비스 제공 어플리케이션을 이용하는 사용자를 지칭할 수 있다. 이와 유사하게, 사용자는 콘텐츠 공유 서비스 어플리케이션의 사용자 계정을 지칭할 수 있다. 본 개시에서, '콘텐츠 공유 그룹'은, 하나 이상의 콘텐츠를 공유 또는 사용할 수 있는 권한이 부여된 사용자 또 는 사용자 계정들의 그룹을 지칭할 수 있다. 특정 콘텐츠 공유 그룹에 할당된 콘텐츠는 해당 그룹에 속하는 사 용자들 사이에서만 공유 또는 사용될 수 있다. 콘텐츠 공유 서비스의 사용자는 하나 이상의 콘텐츠 공유 그룹에 속할 수 있으며, 이 경우 해당 사용자는 각 콘텐츠 공유 그룹에 할당된 콘텐츠의 공유와 사용이 가능하다. 본 개시에서, '페이지'는 콘텐츠 공유 서비스를 제공하는 어플리케이션을 통해 사용자 단말의 디스플레이 상에 표시되는 하나의 화면 또는 사용자 인터페이스를 지칭할 수 있다. 또한, 페이지는 콘텐츠 공유 서비스를 제공하 는 하나의 웹 페이지를 지칭할 수 있다. 일반적으로 페이지는, 콘텐츠 공유 서비스 제공 애플리케이션을 통해 표시되는 사용자 단말의 디스플레이 상에 표시되는 전체 화면을 지칭할 수 있으나, 이에 한정되는 것은 아니며, 사용자 단말의 디스플레이 상의 화면의 일부를 지칭할 수도 있다. 본 개시에서, 페이지는 하나의 콘텐츠 공유 그룹에 할당된 콘텐츠들을 표시하기 위한 사용자 인터페이스 또는 화면을 지칭할 수 있다. 예를 들어, 하나의 페이지에 포함되는 콘텐츠 전체가 사용자 단말의 디스플레이 상에 전체 화면에 표시되지 않는 경우, 사용자는 페이지를 스크롤(Scroll) 하여 하나의 콘텐츠 공유 그룹에 할당된 모든 콘텐츠를 확인할 수 있다. 도 1은 본 개시의 일 실시예에 따른 사용자가 사용자 단말을 이용하여 콘텐츠의 공유 범위를 설정하 는 예시를 나타낸다. 도시된 바와 같이, 사용자는 사용자 단말의 디스플레이 상에 표시된 콘텐츠 공 유 서비스(예를 들어, 소셜 네트워크 플랫폼을 통한 사용자 그룹 별 콘텐츠 공유 서비스 등)와 연관된 그래픽 사용자 인터페이스를 통해 콘텐츠의 공유 범위를 설정할 수 있다. 사용자는, 사용자 단말을 이 용하여, 예를 들어, 동일한 소셜 네트워크 플랫폼에 가입한 다른 사용자들 중에서 특정 콘텐츠(예를 들어, 사진, 영상, 오디오, 문서 등)를 공유하고자 하는 대상 사용자 범위를 설정할 수 있다. 즉, 사용자는 사전 설정된 복수의 콘텐츠 공유 그룹(134_1 내지 134_6)(예를 들어, 대학 동기, 가족, 고등학교 친구, 동호회, 회사 동료, 중학교 친구 등) 중 적어도 하나의 그룹 (134_3, 134_4, 134_6)(예를 들어, 고등학교 친구, 동호회, 중학 교 친구 등)에게만 해당 콘텐츠가 공유 또는 사용되도록 할 수 있다. 일 실시예에서, 사용자 단말의 그래픽 사용자 인터페이스 상에서 콘텐츠 공유 그룹(134_1 내지 134_6)은 다양한 형태 또는 색상을 갖는 사용자 인터페이스로 표시될 수 있다. 도 1에서는, 각 콘텐츠 공유 그 룹(134_1 내지 134_6)이 원형의 사용자 인터페이스로 표시되었지만, 이에 한정되는 것은 아니며, 사각형 등 다 양한 형태의 다각형 또는 다른 형태의 사용자 인터페이스로 표시될 수도 있다. 또한, 사용자 단말의 그래 픽 사용자 인터페이스 상에서 콘텐츠와 콘텐츠 공유 그룹(134_1 내지 134_6)은 각각 구분되어 중첩되 지 않은 영역에 표시될 수 있다. 도시된 바와 같이, 콘텐츠는 그래픽 사용자 인터페이스 상에서 대략 중심 부분에 표시될 수 있으며, 콘텐츠 공유 그룹(134_1 내지 134_6)은 콘텐츠를 둘러싸는 영역에 각각 구 분되어 표시될 수 있다. 일 실시예에서, 사용자는, 콘텐츠를 나타내는 사용자 인터페이스를 선택하여 콘텐츠 공유 그룹(134_1 내지 134_6)중 어느 하나(예를 들어, 134_1, 134_2 및 134_5 중의 어느 하나)의 사용자 인터페이스의 영역으로이동하여 중첩되게 함으로써, 해당 콘텐츠가 중첩된 콘텐츠 공유 그룹(예를 들어, 134_2)에 할당 및 공유 되도록 설정할 수 있다. 예를 들어, 사용자는 콘텐츠를 나타내는 사용자 인터페이스를 터치한 상태에 서, 해당 사용자 인터페이스를 드래그 앤 드롭(drag and drop)하여 콘텐츠 공유 그룹(134_2)에 할당할 수 있다. 콘텐츠를 콘텐츠 공유 그룹(134_1 내지 134_6) 중 어느 하나에 할당하는 사용자 입력 방식은 터치, 드래그 앤 드롭에 한정되는 것은 아니며, 다른 형태의 사용자 입력 방식을 포함할 수도 있다. 예를 들어, 사용자 는, 콘텐츠를 먼저 1회 터치한 후, 콘텐츠 공유 그룹(134_2)을 1회 터치함으로써, 콘텐츠를 콘텐츠 공유 그룹(134_2)에 할당할 수 있다. 일 실시예에서, 사용자는 사용자 단말을 이용하여 본인의 사용자 계정과 연관된 복수의 다른 사용자 에 관한 정보를 기초로 복수의 콘텐츠 공유 그룹을 생성할 수 있다. 예를 들어, 사용자는 사용자 단말 을 이용하여 콘텐츠 공유 서비스 상에서 자신의 사용자 계정과 연관된 다른 사용자에 관한 정보(예를 들어, 다른 사용자의 계정 정보에 포함된 프로필 사진, 아이디, 이름, 이메일 주소, 사용자와의 관계 등) 를 확인하고, 해당 다른 사용자에 관한 정보를 기초로 콘텐츠 공유 그룹을 생성할 수 있다. 다른 예를 들어, 사용자는 콘텐츠 공유 서비스의 서버가 사용자 단말에 저장된 연락처 목록에 접근하는 것을 허용함으 로써, 해당 연락처 목록에 포함된 정보(예를 들어, 이름, 사진, 직장, 그룹, 메모 등)를 기초로 콘텐츠 공유 그 룹을 생성할 수 있다. 여기서, 다른 사용자 각각은 하나의 콘텐츠 공유 그룹에만 속할 수 있고, 복수의 콘텐츠 공유 그룹에 중복하여 속할 수도 있다. 일 실시예에서, 사용자 단말 또는 프로세서는 이미지 또는 영상과 같은 콘텐츠를 분석함으로써 하나의 콘 텐츠 공유 그룹을 생성할 수 있다. 예를 들어, 사용자가 사용자 단말을 통해 콘텐츠 공유 서비스 상 에 업로드하기 위한 이미지를 선택하면, 사용자 단말 또는 프로세서는 인공지능 기반의 콘텐츠 분석 모델 을 이용하여 해당 이미지에 포함된 인물 객체들을 식별하고, 식별된 인물 객체들과 연관된 다른 사용자를 포함 하는 하나 이상의 콘텐츠 공유 그룹을 생성할 수 있다. 이 동작에서, 사용자 단말 또는 프로세서는, 식별 된 인물 객체의 정보를 다른 사용자 계정 정보와 비교 분석을 실행함으로써, 식별된 인물 객체와 다른 사용자와 의 연관성을 결정할 수 있다. 추가적으로, 사용자는 사용자 단말을 통해 특정 콘텐츠가 공유될 적어 도 하나의 콘텐츠 공유 그룹을 추천받을 수 있다. 예를 들어, 사용자가 사용자 단말을 통해 콘텐츠 공유 서비스 상에 업로드 하기 위한 이미지를 선택하면, 사용자 단말 또는 프로세서는 인공지능 기반의 콘 텐츠 분석 모델을 이용하여 해당 이미지를 분석한 결과를 기초로 해당 이미지를 공유할 콘텐츠 공유 그룹을 제 안할 수 있다. 일 실시예에서, 사용자에 의하여 공유되는 콘텐츠는 사용자가 자신의 사용자 계정을 통해 콘텐 츠 공유 서비스 상에 업로드 예정인 콘텐츠를 지칭할 수 있다. 또한, 사용자에 의하여 공유되는 콘텐츠 는 자신의 사용자 계정을 통해 콘텐츠 공유 서비스 상에 이미 업로드 된 콘텐츠를 지칭할 수 있다. 추가 적으로 또는 대안적으로, 사용자에 의하여 공유되는 콘텐츠는 콘텐츠 공유 서비스 상에 사용자 가 아닌 제3 자에 의해 업로드 된 콘텐츠를 지칭할 수 있다. 일 실시예에서, 사용자는 그래픽 사용자 인터페이스를 통해 콘텐츠가 이미 공유된 그룹(134_3, 134_4, 134_6)을 변경할 수 있다. 예를 들어, 사용자는 콘텐츠가 공유되지 않은 그룹(대학 동기, 가 족, 회사 동료)에도 추가적으로 콘텐츠를 공유하도록 설정할 수 있다. 다른 예를 들어, 사용자는 콘 텐츠가 이미 공유된 그룹(고등학교 친구, 동호회, 중학교 친구) 중 적어도 하나의 그룹에 대해 콘텐츠 의 할당을 취소할 수 있다. 이상 설명한 다양한 실시예들에 따르면, 사용자는, 예를 들어 동일한 소셜 네트워킹 플랫폼에 가입된 다른 사용자들의 다양한 특성 또는 속성에 기초하여 콘텐츠를 공유할 사용자 그룹을 사용하기 간단하며 직관적 인 그래픽 사용자 인터페이스를 이용하여 설정할 수 있다. 또한, 사용자는, 사용자 단말의 디스 플레이 상에 표시된 그래픽 사용자 인터페이스를 통해 하나 이상의 사용자 그룹 중 어느 하나 이상의 그룹 에 콘텐츠를 간단하고 편리하게 할당함으로써, 콘텐츠가 하나 이상의 콘텐츠 공유 그룹 내에 포함된 다른 사용자들에 의해 공유 또는 사용될 수 있도록 설정할 수 있다. 도 2는 본 개시의 일 실시예에 따른 콘텐츠 공유 서비스를 제공하기 위하여, 정보 처리 시스템이 복수의 사용자 단말(210_1, 210_2, 210_3)과 통신 가능하도록 연결된 구성을 나타내는 개요도이다. 정보 처리 시스템 은 네트워크를 통해 콘텐츠 공유 서비스 및/또는 소셜 네트워킹 서비스를 제공할 수 있는 시스템 (들)을 포함할 수 있다. 일 실시예에서, 정보 처리 시스템은 콘텐츠 공유 서비스(또는 소셜 네트워킹 서 비스)와 관련된 컴퓨터 실행 가능한 프로그램(예를 들어, 다운로드 가능한 어플리케이션) 및 데이터를 저장, 제공 및 실행할 수 있는 하나 이상의 서버 장치 및/또는 데이터베이스, 또는 클라우드 컴퓨팅 서비스 기반의 하나 이상의 분산 컴퓨팅 장치 및/또는 분산 데이터베이스를 포함할 수 있다. 예를 들어, 정보 처리 시스템은 콘텐츠 공유 서비스를 제공하기 위한 별도의 시스템(예를 들어, 서버)들을 포함할 수 있다. 정보 처리 시스템에 의해 제공되는 콘텐츠 공유 서비스, 복수의 사용자 단말(210_1, 210_2, 210_3)의 각각 에 설치된 콘텐츠 공유를 위한 어플리케이션 또는 웹 브라우저 어플리케이션을 통해 사용자에게 제공될 수 있다. 일 실시예에서, 콘텐츠 공유 서비스는 소셜 네트워킹 서비스의 일부로서 제공될 수 있다. 대안적으로, 소셜 네트워킹 서비스는 콘텐츠 공유 서비스의 일부로서 제공될 수도 있다. 정보 처리 시스템에 의해 제 공되는 콘텐츠 공유 서비스는, 복수의 사용자 단말(210_1, 210_2, 210_3)의 각각에 설치된 콘텐츠 공유를 위한 어플리케이션 또는 웹 브라우저 어플리케이션을 통해 사용자에게 제공될 수 있다. 복수의 사용자 단말(210_1, 210_2, 210_3)은 네트워크를 통해 정보 처리 시스템과 통신할 수 있다. 네트워크는 복수의 사용자 단말(210_1, 210_2, 210_3)과 정보 처리 시스템 사이의 통신이 가능하도록 구성될 수 있다. 네트워크는 설치 환경에 따라, 예를 들어, 이더넷(Ethernet), 유선 홈 네트워크(Power Line Communication), 전화선 통신 장치 및 RS-serial 통신 등의 유선 네트워크, 이동통신망, WLAN(Wireless LAN), Wi-Fi, Bluetooth 및 ZigBee 등과 같은 무선 네트워크 또는 그 조합으로 구성될 수 있다. 통신 방식은 제한되지 않으며, 네트워크가 포함할 수 있는 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방 송망, 위성망 등)을 활용하는 통신 방식뿐 아니라 사용자 단말(210_1, 210_2, 210_3) 사이의 근거리 무선 통신 역시 포함될 수 있다. 도 2에서 휴대폰 단말(210_1), 태블릿 단말(210_2) 및 PC 단말 (210_3)이 사용자 단말의 예로서 도시되었으나, 이에 한정되지 않으며, 사용자 단말(210_1, 210_2, 210_3)은 유선 및/또는 무선 통신이 가능하고 이미지 센서가 탑재된 임의의 컴퓨팅 장치일 수 있다. 예를 들어, 사용자 단말은, 스마트폰, 휴대폰, 내비게이션, 컴퓨터, 노 트북, 디지털방송용 단말, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player), 태블릿 PC, 게임 콘솔(game console), 웨어러블 디바이스(wearable device), IoT(internet of things) 디바이스, VR(virtual reality) 디바이스, AR(augmented reality) 디바이스 등을 포함할 수 있다. 또한, 도 2에는 3개의 사용자 단말(210_1, 210_2, 210_3)이 네트워크를 통해 정보 처리 시스템과 통신하는 것으로 도시되어 있으나, 이에 한정되지 않으며, 상이한 수의 사용자 단말이 네트워크를 통해 정보 처리 시스템과 통 신하도록 구성될 수도 있다. 복수의 사용자 단말(210_1, 210_2, 210_3)은 콘텐츠 공유 서비스/인스턴트 메시징 서비스를 이용하는 사용자들의 사용자 단말일 수 있다. 일 실시예에서, 정보 처리 시스템은 사용자 단말에서 동작하는 콘텐츠 공유를 위한 어플리케이션 등을 통 해 사용자 단말로부터 입력되는 데이터(예를 들어, 사진, 영상, 오디오, 텍스트 등)를 수신할 수 있다. 그 후, 정보 처리 시스템은 수신한 미디어 데이터를 저장하거나/저장하고 네트워크와 연결된 다른 사용자 단 말로 전송할 수 있다. 추가적으로, 정보 처리 시스템은 사용자 단말로부터 입력되는 사용자 입력에 기초 하여 콘텐츠 공유 서비스를 제어할 수 있다. 도 3은 본 개시의 일 실시예에 따른 사용자 단말 및 정보 처리 시스템의 내부 구성을 나타내는 블록 도이다. 사용자 단말은 콘텐츠 공유를 위한 어플리케이션, 웹 브라우저 어플리케이션 등이 실행 가능하고 유/무선 통신이 가능한 임의의 컴퓨팅 장치를 지칭할 수 있으며, 예를 들어, 도 2의 휴대폰 단말(210_1), 태블 릿 단말(210_2), PC 단말(210_3) 등을 포함할 수 있다. 도시된 바와 같이, 사용자 단말은 메모리, 프로세서, 통신 모듈 및 입출력 인터페이스를 포함할 수 있다. 이와 유사하게, 정보 처리 시스 템은 메모리, 프로세서, 통신 모듈 및 입출력 인터페이스를 포함할 수 있다. 도 3에 도시된 바와 같이, 사용자 단말 및 정보 처리 시스템은 각각의 통신 모듈(316, 336)을 이용하여 네트 워크를 통해 정보 및/또는 데이터를 통신할 수 있도록 구성될 수 있다. 또한, 입출력 장치는 입출력 인터페이스를 통해 사용자 단말에 정보 및/또는 데이터를 입력하거나 사용자 단말로부터 생성된 정보 및/또는 데이터를 출력하도록 구성될 수 있다. 메모리(312, 332)는 비-일시적인 임의의 컴퓨터 판독 가능한 기록매체를 포함할 수 있다. 일 실시예에서, 메모 리(312, 332)는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device) 를 포함할 수 있다. 다른 예로서, ROM, SSD, 플래시 메모리, 디스크 드라이브 등과 같은 비소멸성 대용량 저장 장치는 메모리와는 구분되는 별도의 영구 저장 장치로서 사용자 단말 또는 정보 처리 시스템에 포함 될 수 있다. 또한, 메모리(312, 332)에는 운영체제와 적어도 하나의 프로그램 코드(예를 들어, 사용자 단말에 설치되어 구동되는 콘텐츠 공유 서비스 제공 어플리케이션 등을 위한 코드)가 저장될 수 있다. 이러한 소프트웨어 구성요소들은 메모리(312, 332)와는 별도의 컴퓨터에서 판독 가능한 기록매체로부터 로딩될 수 있다. 이러한 별도의 컴퓨터에서 판독가능한 기록매체는 이러한 사용자 단말 및 정보 처리 시스템 에 직접 연결가능한 기록 매체를 포함할 수 있는데, 예를 들어, 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 컴퓨터에서 판독 가능한 기록매체를 포함할 수 있다. 다른 예로서, 소 프트웨어 구성요소들은 컴퓨터에서 판독 가능한 기록매체가 아닌 통신 모듈을 통해 메모리(312, 332)에 로딩될 수도 있다. 예를 들어, 적어도 하나의 프로그램은 개발자들 또는 어플리케이션의 설치 파일을 배포하는 파일 배포 시스템이 네트워크를 통해 제공하는 파일들에 의해 설치되는 컴퓨터 프로그램(예를 들어, 콘텐츠 공 유 서비스를 위한 어플리케이션)에 기반하여 메모리(312, 332)에 로딩될 수 있다. 프로세서(314, 334)는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하 도록 구성될 수 있다. 명령은 메모리(312, 332) 또는 통신 모듈(316, 336)에 의해 프로세서(314, 334)로 제공 될 수 있다. 예를 들어, 프로세서(314, 334)는 메모리(312, 332)와 같은 기록 장치에 저장된 프로그램 코드에 따라 수신되는 명령을 실행하도록 구성될 수 있다. 통신 모듈(316, 336)은 네트워크를 통해 사용자 단말과 정보 처리 시스템이 서로 통신하기 위한 구성 또는 기능을 제공할 수 있으며, 사용자 단말 및/또는 정보 처리 시스템이 다른 사용자 단말 또 는 다른 시스템(일례로 별도의 클라우드 시스템 등)과 통신하기 위한 구성 또는 기능을 제공할 수 있다. 일례 로, 사용자 단말의 프로세서가 메모리 등과 같은 기록 장치에 저장된 프로그램 코드에 따라 생 성한 요청 또는 데이터(예를 들어, 콘텐츠 공유 요청 등)는 통신 모듈의 제어에 따라 네트워크를 통 해 정보 처리 시스템으로 전달될 수 있다. 역으로, 정보 처리 시스템의 프로세서의 제어에 따 라 제공되는 제어 신호나 명령이 통신 모듈과 네트워크를 거쳐 사용자 단말의 통신 모듈을 통해 사용자 단말에 수신될 수 있다. 입출력 인터페이스는 입출력 장치와의 인터페이스를 위한 수단일 수 있다. 일 예로서, 입력 장치는 오디오 센서 및/또는 이미지 센서를 포함한 카메라, 키보드, 마이크로폰, 마우스 등의 장치를, 그리고 출력 장 치는 디스플레이, 스피커, 햅틱 피드백 디바이스(haptic feedback device) 등과 같은 장치를 포함할 수 있다. 다른 예로, 입출력 인터페이스는 터치스크린 등과 같이 입력과 출력을 수행하기 위한 구성 또는 기능이 하 나로 통합된 장치와의 인터페이스를 위한 수단일 수 있다. 도 3에서는 입출력 장치가 사용자 단말에 포함되지 않도록 도시되어 있으나, 이에 한정되지 않으며, 사용자 단말과 하나의 장치로 구성될 수 있다. 또한, 정보 처리 시스템의 입출력 인터페이스는 정보 처리 시스템과 연결되거나 정보 처리 시스템이 포함할 수 있는 입력 또는 출력을 위한 장치(미 도시)와의 인터페이스를 위한 수단일 수 있다. 도 3에서는 입출력 인터페이스(318, 338)가 프로세서(314, 33 4)와 별도로 구성된 요소로서 도시되었으나, 이에 한정되지 않으며, 입출력 인터페이스(318, 338)가 프로세서 (314, 334)에 포함되도록 구성될 수 있다. 사용자 단말 및 정보 처리 시스템은 도 3의 구성요소들보다 더 많은 구성요소들을 포함할 수 있다. 그러나, 대부분의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 일 실시예에서, 사용자 단말(21 0)은 상술된 입출력 장치 중 적어도 일부를 포함하도록 구현될 수 있다. 또한, 사용자 단말은 트랜 시버(transceiver), GPS(Global Positioning system) 모듈, 카메라, 각종 센서, 데이터베이스 등과 같은 다른 구성요소들을 더 포함할 수 있다. 예를 들어, 사용자 단말이 스마트폰인 경우, 일반적으로 스마트폰이 포 함하고 있는 구성요소를 포함할 수 있으며, 예를 들어, 가속도 센서, 자이로 센서, 카메라 모듈, 각종 물리적인 버튼, 터치패널을 이용한 버튼, 입출력 포트, 진동을 위한 진동기 등의 다양한 구성요소들이 사용자 단말 에 더 포함되도록 구현될 수 있다. 일 실시예에 따르면, 사용자 단말의 프로세서는 콘텐츠 공유 서비스를 위한 어플리케이션 또는 웹 브 라우저 어플리케이션을 동작하도록 구성될 수 있다. 이 때, 해당 어플리케이션과 연관된 프로그램 코드가 사용 자 단말의 메모리에 로딩될 수 있다. 어플리케이션이 동작되는 동안에, 사용자 단말의 프로세 서는 입출력 장치로부터 제공된 정보 및/또는 데이터를 입출력 인터페이스를 통해 수신하거나 통신 모듈을 통해 정보 처리 시스템으로부터 정보 및/또는 데이터를 수신할 수 있으며, 수신된 정보 및/또는 데이터를 처리하여 메모리에 저장할 수 있다. 또한, 이러한 정보 및/또는 데이터는 통신 모듈 을 통해 정보 처리 시스템에 제공할 수 있다.콘텐츠 공유 서비스를 위한 어플리케이션 또는 웹 브라우저 어플리케이션이 동작되는 동안에, 프로세서는 입출력 인터페이스와 연결된 터치 스크린, 키보드, 오디오 센서 및/또는 이미지 센서를 포함한 카메라, 마 이크로폰 등의 입력 장치를 통해 입력되거나 선택된 텍스트, 이미지, 영상 등을 수신할 수 있으며, 수신된 텍스 트, 이미지 및/또는 영상 등을 메모리에 저장하거나 통신 모듈 및 네트워크를 통해 정보 처리 시스템에 제공할 수 있다. 정보 처리 시스템의 프로세서는 복수의 사용자 단말 및/또는 복수의 외부 시스템으로부터 수신된 정 보 및/또는 데이터를 관리, 처리 및/또는 저장하도록 구성될 수 있다. 일 실시예에서, 프로세서는 사용자 단말 로부터 수신한 사진, 영상, 오디오, 문서, 연락처 목록 등을 저장, 처리 및 전송할 수 있다. 추가적 으로 또는 대안적으로, 프로세서는 사용자 단말로부터 수신한 사용자 입력에 응답하여, 콘텐츠 공유 서비스를 제어할 수 있다. 도 4는 일 실시예에 따라 사용자가 다른 사용자와 공유할 콘텐츠를 업로드하는 예시를 나타낸다. 도 4에 는 사용자 단말(또는 사용자 단말의 적어도 하나의 프로세서)의 제1 동작 단계 및 제2 동작 단계가 도시되어 있다. 제1 동작 단계는 사용자 단말이 콘텐츠, 콘텐츠를 업로드하기 위한 제1 아이콘 및 콘텐츠의 공유 범위를 설정하기 위한 제2 아이콘을 디스플레이 상에 표시하는 예시를 나타 낸다. 일 실시예에서, 사용자 단말은 제1 아이콘에 대한 사용자 입력에 응답하여, 콘텐츠를 콘텐츠 공유 서비스의 서버에 업로드할 수 있다. 사용자 단말은 제2 동작 단계에서, 제2 아이콘에 대한 사용자 입력에 응답하여, 사용자 계정과 연관 된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복수의 콘텐츠 공유 그룹(422_1 내지 422_7)및 콘텐츠 를 디스플레이 상에 표시할 수 있다. 일 실시예에서, 사용자 단말은 복수의 콘텐츠 공유 그룹(422_1 내지 422_7)및 콘텐츠 각각을 디스플레이 상에 시각적으로 구분된 영역에 표시할 수 있다. 예를 들어, 콘텐츠 가 디스플레이 상의 대략 가운데에 표시되고, 복수의 콘텐츠 공유 그룹(422_1 내지 422_7) 각각은 콘텐츠 와는 구분되는 그 주변 영역에 표시될 수 있다. 또한, 복수의 콘텐츠 공유 그룹(422_1 내지 422_7) 각각은 그룹명(대학 동기, 가족, 고등학교 친구, 동호회, 회사 동료, 중학교 친구)을 포함하는 원형의 인터페이스로 표 시될 수 있다. 이러한 구성에 의해, 사용자는 공유할 콘텐츠 및 미리 생성된 콘텐츠 공유 그룹을 동시에 시각 적으로 확인하여, 콘텐츠의 내용에 따라 콘텐츠를 공유할 그룹을 쉽게 결정할 수 있다. 도 4에서는 복수의 콘텐츠 공유 그룹(422_1 내지 422_7)이 동일한 형태, 크기 및/또는 색상을 갖는 것으로 도시 되었으나, 이에 한정되지 않는다. 일 실시예에서, 사용자 단말은 복수의 콘텐츠 공유 그룹(422_1 내지 422_7) 각각의 크기, 형태 또는 색상 중 적어도 하나를 서로 다르게 표시할 수 있다. 예를 들어, '가족'은 '집' 모양 의 인터페이스로 표시될 수 있고, '대학 동기', '고등학교 친구', '중학교 친구'는 '학교' 모양의 인터페이스로 표시될 수 있다. 다른 예를 들어, '동호회'에 미리 공유된 콘텐츠가 10개이고, '회사 동료'에 미리 공유된 콘 텐츠가 5개인 경우, '동호회'를 나타내는 인터페이스가 '회사 동료'를 나타내는 인터페이스보다 크게 표시될 수 도 있다. 추가적으로 또는 대안적으로, 사용자 단말은 제2 동작 단계에서, 사용자 입력에 응답하여, 사용자 계정과 연관된 복수의 다른 사용자에 관한 정 보를 기초로 생성된 콘텐츠 공유 그룹을 변경하여 표시할 수 있다. 예를 들어, 사용자 단말은 사용자 입력에 응답하여, 미리 생성된 복수의 콘텐츠 공유 그룹(422_1 내지 422_7) 중 어 느 하나의 그룹(예를 들어, 동호회)을 삭제할 수 있다. 이 예에서, 사용자는 사용자 단말에 표시된 복수의 콘 텐츠 공유 그룹(422_1 내지 422_7) 중 어느 하나의 그룹을 선택하여 터치한 후 그 상태를 유지하여, 그룹 삭제 를 위한 인터페이스가 표시되게 할 수 있다. 이에 따라, 사용자는 그룹 삭제를 위한 인터페이스(미도시)를 이용 하여 선택된 콘텐츠 공유 그룹을 삭제할 수 있다. 다른 예를 들어, 사용자 단말은 사용자 입력에 응답하여, 미 리 생성된 복수의 콘텐츠 공유 그룹(422_1 내지 422_7)에 사용자 계정과 연관된 복수의 다른 사용자에 관한 정 보를 기초로 콘텐츠 공유 그룹을 추가적으로 생성 및 표시할 수 있다. 이 예에서, 사용자는 사용자 단말에 표시 된 그룹 추가를 위한 인터페이스(미도시)를 선택함으로써, 복수의 콘텐츠 공유 그룹(422_1 내지 422_7)에 속하 지 않은 다른 사용자를 포함하는 추가의 콘텐츠 공유 그룹을 생성할 수도 있다. 일 실시예에서, 복수의 콘텐츠 공유 그룹(514_1 내지 514_7)은 '나만보기' 그룹(422_4)을 포함할 수 있다. 여 기서, '나만보기' 그룹(422_4)은 사용자 계정(또는 사용자)만 포함된 그룹을 지칭할 수 있다. 일 실시예에서, 사용자 단말은 콘텐츠를 '나만보기' 그룹(422_4)에 우선적으로 할당할 수 있다. 예를 들어, 사용자 단말 은 제2 아이콘에 대한 사용자 입력에 응답하여, 제2 동작 단계에서 콘텐츠를 '나만보기' 그룹 (422_4)에 할당할 수 있다. 이 경우, '나만보기' 그룹(422_4)의 크기, 형태 또는 색상 중 적어도 하나는, 콘텐츠가 할당되지 않은 나머지 콘텐츠 공유 그룹들과 다르게 표시될 수 있다. 도 5는 일 실시예에 따라 사용자가 콘텐츠를 복수의 콘텐츠 공유 그룹(514_1 내지 514_7) 중 하나 이상에 할당하는 예시를 나타낸다. 도 5에는 사용자 단말(또는 사용자 단말의 적어도 하나의 프로세서)의 제1 동작 단 계 및 제2 동작 단계가 도시되어 있다. 제1 동작 단계는 사용자 단말이 사용자 입력에 응답하 여 콘텐츠가 복수의 콘텐츠 공유 그룹(514_1 내지 514_7) 중 적어도 하나의 그룹(514_2, 514_3, 514_6)에 할당되는 것을 디스플레이 상에 표시하는 예시를 나타낸다. 일 실시예에서, 사용자 단말은, 사용자 입력에 응답하여, 콘텐츠를 선택하여 적어도 하나의 그룹(514_2, 514_3, 514_6)으로 각각 이동하는 것을 디스플레이 상에 표시할 수 있다. 예를 들어, 사용자가 사용자 단말의 디스플레이 상에 표시된 콘텐츠를 터치한 상태에서 적어도 하나의 그룹(514_2, 514_3, 514_6)으로 이동하 는 드래그 앤 드롭 동작을 실행하는 경우, 사용자 단말은 선택된 콘텐츠가 적어도 하나의 그룹(514_2, 514_3, 514_6)으로 각각 이동하는 것을 디스플레이 상에 애니메이션을 이용하여 표시할 수 있다. 다른 예를 들 어, 적어도 하나의 그룹(514_2, 514_3, 514_6)을 선택하는 사용자 입력에 응답하여, 사용자 단말은 콘텐츠(51 2)가 적어도 하나의 그룹(514_2, 514_3, 514_6)으로 각각 이동하는 것을 디스플레이 상에 표시할 수 있다. 즉, 사용자가 사용자 단말의 디스플레이 상에 표시된 적어도 하나의 그룹(514_2, 514_3, 514_6)을 터치하여 선택한 경우, 사용자 단말은 선택된 콘텐츠가 적어도 하나의 그룹(514_2, 514_3, 514_6)으로 각각 이동하는 것을 디스플레이 상에 애니메이션을 이용하여 표시할 수 있다. 콘텐츠가 적어도 하나의 그룹(514_2, 514_3, 514_6)으로 각각 이동하는 것에 응답하여, 사용자 단말은 제2 동작 단계에서 콘텐츠가 할당된 적어도 하나의 그룹(514_2, 514_3, 514_6)을 콘텐츠가 할당되지 않은 그룹(514_1, 514_4, 514_5)과 시각적으로 구분하여 디스플레이 상에 표시할 수 있다. 일 실시예에서, 사 용자 단말은 콘텐츠가 할당된 적어도 하나의 그룹(514_2, 514_3, 514_6)의 크기, 형태 또는 색상 중 적어 도 하나를 변경하여 디스플레이 상에 표시할 수 있다. 추가적으로 또는 대안적으로 사용자 단말은 콘텐츠(51 2)의 대표 이미지를 콘텐츠가 할당된 적어도 하나의 그룹(514_2, 514_3, 514_6) 상에 표시할 수 있다. 이 러한 구성에 의해, 사용자는 시각적으로 콘텐츠가 할당된 그룹을 콘텐츠가 할당되지 않은 그룹과 쉽 게 구분할 수 있다. 일 실시예에서, 사용자 단말은 콘텐츠가 '나만보기'그룹으로 할당되는 경우, 적어도 하나의 그룹(514_2, 514_3, 514_6)에 대한 콘텐츠의 할당을 취소할 수 있다. 예를 들어, 제2 동작 단계에서 콘텐츠(51 2)가 '나만 보기' 그룹으로 이동하는 것에 응답하여, 사용자 단말은 적어도 하나의 그룹(514_2, 514_3, 514_6) 에 대한 콘텐츠의 할당을 취소할 수 있다. 이 경우, 적어도 하나의 그룹(514_2, 514_3, 514_6)의 색상은 콘텐츠가 할당되기 이전의 색상으로 변경될 수 있다. 또한, 적어도 하나의 그룹(514_2, 514_3, 514_6)에 표시된 대표 이미지는 제거될 수 있다. 추가적으로 또는 대안적으로, 사용자 단말은 콘텐츠가 적어도 하나의 그룹(514_2, 514_3, 514_6)으로 할당 되는 경우, '나만보기' 그룹(514_4)에 자동으로 콘텐츠를 할당할 수 있다. 예를 들어, 콘텐츠가 '고 등학교 친구' 그룹(514_2)으로 이동하는 것에 응답하여, 사용자 단말은 콘텐츠를 선택하여 '나만보기' 그 룹(514_4)으로 이동하는 사용자의 입력 없이, 콘텐츠를 '나만보기' 그룹(514_4)에 할당할 수 있다. 도 6은 일 실시예에 따라 사용자가 콘텐츠 공유 그룹에 대하여 콘텐츠의 할당을 취소하는 예시를 나타낸다. 도 6에는 사용자 단말(또는 사용자 단말의 적어도 하나의 프로세서)의 제1 동작 단계 및 제2 동작 단계가 도시되어 있다. 제1 동작 단계는 사용자 단말이 사용자 입력에 응답하여 콘텐츠 공유 그룹에 대한 콘텐츠의 할당을 취소하는 것을 디스플레이 상에 표시하는 예시를 나타낸다. 일 실시예에서, 사용자 단말은 콘텐츠가 할당된 콘텐츠 공유 그룹에 표시된 대표 이미지에 대한 사용 자 입력에 응답하여, 콘텐츠 공유 그룹에 대한 해당 콘텐츠의 할당을 취소할 수 있다. 예를 들어, 사용자 단말은, 대표 이미지를 선택하여 콘텐츠 공유 그룹 외부로 드래그 앤 드롭하는 사용자 입력에 응답하 여, 콘텐츠 공유 그룹에 대한 콘텐츠의 할당을 취소할 수 있다. 다른 예를 들어, 콘텐츠 공유 그룹 에 대한 사용자 입력에 응답하여, 콘텐츠 공유 그룹에 대한 콘텐츠의 할당을 취소할 수도 있다. 즉, 사용 자가 콘텐츠 공유 그룹을 터치로 선택하면, 사용자 단말은 해당 콘텐츠 공유 그룹에 할당된 콘텐츠의 리스트를 표시하는 추가의 사용자 인터페이스(미도시)를 표시할 수 있다. 이에 따라, 사용자는 추가의 사용자 인터페이스를 통해 할당을 취소할 콘텐츠를 선택함으로써, 콘텐츠 공유 그룹에 대한 해당 콘텐츠의 할당을 취소할 수 있다.일 실시예에서, 사용자 단말은, 콘텐츠 공유 그룹에 대하여 콘텐츠의 할당을 취소하는 것에 응답하여, 제2 동작 단계에서 콘텐츠 공유 그룹상에 표시된 콘텐츠의 대표 이미지를 제거할 수 있다. 추가적 으로 또는 대안적으로, 사용자 단말은 콘텐츠의 대표 이미지가 삭제된 콘텐츠 공유 그룹의 사용자 인 터페이스를 콘텐츠가 할당되지 않은 그룹(대학 동기, 가족, 회사 동료)의 사용자 인터페이스와 동일하게 변경하 여 표시할 수 있다. 이러한 구성에 의해, 사용자는 시각적으로 콘텐츠 공유 그룹들에 대한 특정 콘텐츠의 공유 범위 또는 공유 여부를 쉽게 변경하고, 이와 같은 콘텐츠 공유 상태의 변경 결과를 그래픽 사용자 인터페이스를 통해 직관적으로 확인할 수 있다. 도 7은 일 실시예에 따라 사용자가 콘텐츠 공유 그룹 별로 할당된 콘텐츠를 표시하는 페이지(712, 722)를 이동 하는 예시를 나타낸다. 도 7에는 사용자 단말(또는 사용자 단말의 적어도 하나의 프로세서)의 제1 동작 단계 내지 제3 동작 단계가 도시되어 있다. 제1 동작 단계는 복수의 공유 콘텐츠 공유 그룹 중 제1 그룹(예를 들어, 가족)에 할당된 하나 이상의 콘텐츠를 포함하는 제1 페이지의 예시를 나타낸다. 도시된 바와 같이, 제1 페이지는 제1 그룹(가족)에 할당된 콘텐츠(예를 들어, 가족 사진, 집 밖의 풍경 사진 등), 및 콘텐츠에 관한 정보(예를 들어, 콘텐츠를 공유한 가족 구성원의 사용자 아이디, 업로드 날짜 등) 등을 포함 할 수 있다. 추가적으로, 제1 페이지는 제1 그룹(가족)에 속하는 다른 사용자가 업로드한 코멘트(또는 댓 글) 등을 포함할 수 있다. 일 실시예에서, 사용자 단말은 제1 페이지에 대한 사용자 입력에 응답하여, 제2 동작 화면에서 제1 페이지에서 제2 페이지로 이동하는 것을 디스플레이 상에 표시할 수 있다. 예를 들어, 사용자 단말 은 제1 페이지를 스와이핑(swiping)하는 사용자 입력에 응답하여, 복수의 콘텐츠 공유 그룹 중 제2 그룹 (고등학교 친구)에 할당된 콘텐츠를 포함하는 제2 페이지를 표시할 수 있다. 즉, 스와이핑에 대응하는 사 용자 입력에 응답하여, 사용자 단말은 제1 페이지에서 제2 페이지로 이동하는 것을 애니메이션으로 표시한 후, 제3 동작 단계에서 제2 페이지를 표시할 수 있다. 도 7에서는 스와이핑을 통해 제1 페이지에서 제2 페이지로 이동하여 제2 페이지를 표시하는 예 시만을 도시하였으나, 이에 한정되지 않는다. 예를 들어, 사용자 단말은 제2 페이지에 대한 사용자 입력 에 응답하여, 제2 페이지에서 다시 제1 페이지로 이동할 수 있다. 다른 예를 들어, 사용자 단말은 제2 페이지에 대한 사용자 입력에 응답하여, 복수의 콘텐츠 공유 그룹 중 또 다른 그룹(예를 들어, 중학교 친구)에 할당된 콘텐츠를 포함하는 제3 페이지(미도시)를 표시할 수 있다. 추가적으로 또는 대안적으로, 사용자 단말은 콘텐츠가 사전 설정된 복수의 콘텐츠 공유 그룹(예를 들어, 도 4의 422_1 내지 422_7) 중 어느 그룹에도 할당되지 않은 상태에서 콘텐츠 공유 서비스의 서버에 업로드 된 경우, 해 당 콘텐츠를 사용자 계정에만 연관시킬 수 있다. 이 경우, 사용자 단말은 사용자 계정에만 연관된 하나 이상의 콘텐츠를 모두 포함하는 제4 페이지(미도시)를 표시할 수 있다. 이러한 구성에 의해, 사용자는 콘텐츠 공유 서 비스에서 복수의 콘텐츠 공유 그룹에 공유된 콘텐츠들과 사용자 계정에만 연관되어 다른 사용자들에게 공유되지 않은 콘텐츠들을 구분하여 저장 및 관리할 수 있다. 도 8은 일 실시예에 따라 사용자가 제1 그룹(가족)에 이미 할당된 콘텐츠를 제2 그룹(고등학교 친구)에 할 당하는 예시를 나타낸다. 도 8에는 사용자 단말(또는 사용자 단말의 적어도 하나의 프로세서)의 제1 동작 단계 , 제2 동작 단계 및 제3 동작 단계가 도시되어 있다. 제1 동작 단계는 복수의 콘텐츠 공 유 그룹 중 제1 그룹(가족)에 할당된 콘텐츠를 포함하는 제1 페이지의 예시를 나타낸다. 일 실시예에서, 사용자 단말은 콘텐츠에 대한 사용자 입력에 응답하여, 제2 동작 단계에서 콘텐츠 를 제2 페이지로 이동하는 것을 디스플레이 상에 표시할 수 있다. 예를 들어, 사용자 단말은 제1 페 이지에서 콘텐츠를 터치하여 선택한 상태에서 드래그 동작을 실행함으로써 해당 콘텐츠를 제1 페이지의 우측 테두리 영역으로 이동할 수 있다. 이에 따라, 제1 페이지의 우측 테두리 영역이 디스 플레이 상의 좌측으로 이동하는 동시에 제2 페이지의 좌측 테두리 영역이 좌측으로 이동하면 제2 페이지 의 일부가 디스플레이 상에 표시될 수 있다. 이와 같이, 제1 페이지로부터 콘텐츠를 제2 페이지 로 드래그 앤 드롭하는 사용자 입력에 응답하여, 콘텐츠를 제2 페이지(고등학교 친구)로 이동하는 것 을 애니메이션으로 표시할 수 있다. 사용자 단말은 콘텐츠가 제1 페이지에서 제2 페이지로 이 동하는 것을 표시한 후, 제3 동작 단계에서 콘텐츠를 제2 페이지와 연관된 제2 그룹(고등학교 친구)으로 할당 및 연관시킬 수 있다. 이러한 구성에 의해, 사용자는 그래픽 사용자 인터페이스를 이용하여 하 나의 콘텐츠 공유 그룹에 이미 할당된 콘텐츠를 다른 콘텐츠 공유 그룹으로 재할당 또는 추가 할당함으로써, 해 당 콘텐츠의 공유 범위를 쉽게 변경 또는 확장할 수 있다.도 9는 일 실시예에 따라 사용자가 업로드한 콘텐츠의 공유 범위를 확인하는 예시를 나타낸다. 도 9에는 사용자 단말(또는 사용자 단말의 적어도 하나의 프로세서)의 제1 동작 단계 및 제2 동작 단계가 도시 되어 있다. 제1 동작 단계는 사용자가 콘텐츠 공유 서비스의 서버에 업로드한 모든 콘텐츠를 포함하는 페 이지의 예시를 나타낸다. 도시된 바와 같이, 페이지는 콘텐츠, 콘텐츠에 관한 정보(예를 들어, 사용자 아 이디, 업로드 날짜 등) 및 공유 그룹을 확인하기 위한 사용자 인터페이스를 표시할 수 있다. 일 실시예에서, 사용자 단말은 사용자 인터페이스에 대한 사용자 입력에 응답하여, 제2 동작 단계에 서 콘텐츠가 해당 콘텐츠가 할당된 콘텐츠 공유 그룹 각각을 나타내는 사용자 인터페이스를 표시할 수 있다. 추가적으로 또는 대안적으로, 사용자 단말은 사용자 인터페이스에 대한 사용자 입력에 응답하여, 사용자 인터페이스에 대한 그룹(회사 동료)에 속한 다른 사용자의 정보(예를 들어, 다른 사용자 의 프로필 사진, 아이디, 이름 등)를 표시할 수도 있다. 또한, 사용자 단말은 사용자 인터페이스에 대한 사용자 입력에 응답하여, 해당 그룹(회사 동료)에 속한 다른 사용자의 콘텐츠 조회 여부를 표시할 수 있다. 이러한 구성에 의해, 사용자는 자신이 업로드한 모든 콘텐츠 각각이 할당 및 공유된 콘텐츠 공유 그룹의 범위를 시각적으로 간단하게 확인할 수 있고, 콘텐츠 각각에 대한 다른 사용자의 조회 여부를 확인함으로써 조 회하지 않은 다른 사용자에게 콘텐츠 조회 요청에 대한 리마인더를 제공할 수 있다. 추가적으로 또는 대안적으로, 사용자 단말은 콘텐츠 공유 그룹 변경 인터페이스에 대한 사용자 입력에 응 답하여, 콘텐츠 공유 그룹 변경 화면(예를 들어, 도 5 또는 도 6)으로 이동할 수 있다. 콘텐츠 공유 그룹 변경 화면으로 이동한 후, 사용자 단말은 사용자 입력에 응답하여, 콘텐츠의 공유 그룹을 추가 또는 삭제할 수 있다. 예를 들어, 사용자 단말은 콘텐츠의 공유 그룹의 범위에 '동호회' 그룹을 추가하거나, '회사 동료' 그룹을 삭제할 수 있다. 도 10은 일 실시예에 따라 사용자가 인공지능 기반의 콘텐츠 분석 모델에 의해 콘텐츠를 콘텐츠 공유 그 룹에 할당하는 예시를 나타낸다. 일 실시예에서, 사용자 단말(또는 사용자 단말의 적어도 하나의 프로세서)은 인공지능 기반의 콘텐츠 분석 모델에 의해 콘텐츠와 복수의 콘텐츠 공유 그룹에 미리 할당된 복수의 콘텐 츠 사이의 유사도를 결정할 수 있다. 예를 들어, 사용자 단말은 콘텐츠 모델에 의해 '음식'을 나타내는 이미지 콘텐츠와 복수의 공유 콘텐츠 그룹(가족, 고등학교 친구, 동호회, 회사 동료, 중학교 친구, 대학 동기) 각각에 사전 할당된 복수의 콘텐츠 각각을 비교하여 유사도를 산출할 수 있다. 그리고 나서, 사용자 단말은 콘 텐츠와 유사도가 높은 콘텐츠가 할당된 적어도 하나의 공유 그룹(1016_1, 1016_2)을 결정할 수 있다. 일 실시예에서, 사용자 단말 또는 프로세서는, 이미지 또는 영상과 같은 콘텐츠들 사이의 유사도를 산출하도록 학습된 인공신경망 기반의 콘텐츠 분석 모델을 실행할 수 있다. 예를 들어, 콘텐츠 분석 모델은 콘볼루션 인공 신경망(CNN: convolution neural network) 기반의 이미지 분석 모델을 포함할 수 있다. 인공신경망 기반의 콘텐 츠 분석 모델은, 동일 또는 유사한 내용을 포함하는 이미지들이 입력될 때 높은 유사도 값을 산출하도록 학습될 수 있다. 예를 들어, 인공신경망 기반의 콘텐츠 분석 모델은, 동일한 사용자의 얼굴을 포함하는 2개의 이미지 또는 영상에 대해서는 높은 유사도 값을 산출하는 반면, 서로 다른 사용자의 얼굴을 각각 포함하는 2개의 이미 지 또는 영상에 대해서는 낮은 유사도 값을 산출하도록 학습될 수 있다. 콘텐츠와 복수의 콘텐츠 공유 그 룹들에 할당된 복수의 콘텐츠 각각의 유사도 값은 사전 결정된 임계값과 비교될 수 있다. 그 비교 결과, 콘텐츠 는, 임계값 보다 높은 유사도 값을 갖는 콘텐츠가 할당된 공유 콘텐츠 공유 그룹에 할당될 수 있다. 일 실시예에서, 사용자 단말은, 이상 설명한 방법에 따라 콘텐츠 분석 모델에 의해 결정된 적어도 하나의 그룹 (1016_1, 1016_2)을 다른 그룹보다 디스플레이 상에 크게 표시할 수 있다. 추가적으로 또는 대안적으로, 사용 자 단말은 결정된 적어도 하나의 그룹(1016_1, 1016_2)의 형태 및/또는 색상을 변경하여 표시할 수도 있다. 추 가적으로 또는 대안적으로, 사용자 단말은 결정된 적어도 하나의 그룹(1016_1, 1016_2)에 관한 정보를 별도의 사용자 인터페이스를 통해 디스플레이 상에 표시할 수 있다. 예를 들어, 콘텐츠와 유사한 콘텐츠 가 가장 많이 할당된 적어도 하나의 공유 그룹(1016_1, 1016_2)이 '가족' 및 '동호회'인 경우, 사용자 단말은 'Sally 님은 그동안 음식사진을 “가족”, “동호회” 그룹과 공유해왔어요'라는 메시지를 사용자 인터페이스 를 통해 표시할 수 있다. 이러한 구성에 의해, 사용자는 직접 콘텐츠를 분석하여 해당 콘텐츠가 할당될 콘텐츠 공유 그룹을 결정할 필요 없이, 인공지능 기반의 콘텐츠 분석 모델에 의해 제공되는 콘텐츠 공유 그룹 추천 기능을 이용하여 쉽게 콘텐츠를 할당할 공유 그룹을 결정할 수 있다. 도 10에는 콘텐츠가 이미지인 것으로 도시되었으나, 이에 한정되지 않는다. 예를 들어, 콘텐츠는 이미지 외에 동영상, 오디오, 문서 등을 포함할 수 있다. 이 경우, 인공지능 기반의 콘텐츠 분석 모델은, 다양 한 형식으로 표현된 2개의 콘텐츠를 분석 및 비교하여 유사도를 산출하도록 학습된 인공지능 기반 모델을 포함할 수 있다. 도 11은 일 실시예에 따라 사용자가 인공지능 기반의 콘텐츠 분석 모델에 의해 인물 객체를 포함하는 콘텐츠 를 콘텐츠 공유 그룹에 할당하는 예시를 나타낸다. 도 11에는 사용자 단말(또는 사용자 단말의 적어도 하나의 프로세서)의 제1 동작 단계 및 제2 동작 단계가 도시되어 있다. 제1 동작 단계는 사 용자 단말이 콘텐츠에 포함된 각각의 인물 객체와 매칭된 다른 사용자 정보를 포함하는 사용자 인터페이 스를 표시하는 예시를 나타낸다. 일 실시예에서, 사용자 단말은 인공지능 기반의 콘텐츠 분석 모델에 의해 콘텐츠로부터 인물 객체를 추출 할 수 있다. 그리고 나서, 사용자 단말은 추출된 인물 객체와 사용자 계정과 연관된 다른 사용자의 인물 이미 지(예를 들어, 프로필 사진) 각각을 비교하여, 콘텐츠에 포함된 인물 객체를 다른 사용자 계정과 매칭시 킬 수 있다. 예를 들어, 사용자 단말은 인공지능 기반의 콘텐츠 분석 모델을 이용하여, 콘텐츠를 분석하 고, 해당 콘텐츠에 포함된 다른 사용자(예를 들어, Brown, James, Cony)의 인물 객체를 다른 사용자 계정 의 프로필 사진 각각과 비교하여 유사도를 산출할 수 있다. 이와 같이 산출된 유사도는 사전 결정된 임계값과 비교될 수 있으며, 임계값 보다 큰 유사도를 갖는 콘텐츠에 포함된 인물 객체에 대응하는 다른 사용자(Brown, James, Cony)의 계정이 결정될 수 있다. 일 실시예에서, 사용자 단말은, 미리 생성된 복수의 공유 콘텐츠 그룹(예를 들어, 대학 동기, 가족, 고등학교 친구, 동호회, 회사 동료) 중에서, 콘텐츠에 포함된 인물객체에 대응하는 다른 사용자(Brown, James, Cony)의 계정과 연관된 콘텐츠 공유 그룹의 존재 여부를 판단할 수 있다. 해당 콘텐츠 공유 그룹이 존재하지 않는 것으로 판단된 경우, 사용자 단말은 제2 동작 단계에서 콘텐츠 분석 모델에 의해 결정된 다른 사용 자(예를 들어, Brown, James, Cony)의 계정을 기초로 'Brown', 'James', 'Cony'가 속하는 추가의 콘텐츠 공유 그룹을 생성하고 디스플레이 상에 표시할 수 있다. 추가적으로 또는 대안적으로, 사용자 단말은 다른 사 용자(Brown, James, Cony)의 계정을 기초로 추가의 콘텐츠 공유 그룹의 생성을 요청하는 사용자 인터페이 스를 디스플레이 상에 표시할 수 있다. 도 12는 일 실시예에 따른 콘텐츠 공유 범위 설정 방법의 예시를 나타낸다. 방법은, 사용자 단말 (또는 사용자 단말의 적어도 하나의 프로세서)에 의해 수행될 수 있다. 일 실시예에서, 방법은 사용자 계정과 연관된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 디 스플레이 상에 표시하는 단계(S1210)로 개시될 수 있다. 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 표시한 후, 사용자 단말은 제1 사용자 입력에 응답하여, 제1 콘텐츠가 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되는 것을 디스플레이 상에 표시할 수 있다(S1220). 또한, 사용자 단말은 제1 콘텐츠를 제1 콘텐츠가 할당 된 적어도 하나의 콘텐츠 공유 그룹과 연관시킬 수 있다(S1230). 일 실시예에서, 제1 콘텐츠 및 해당 콘텐츠가 할당된 적어도 하나의 콘텐츠 공유 그룹에 대한 정보는 사용자 단말에 저장되거나, 사용자 단말이 네트워크를 통해 연결된 서버로 전송될 수 있다. 일 실시예에서, 사용자 단말은 복수의 콘텐츠 공유 그룹 및 제1 콘텐츠 각각을 상기 디스플레이 상에 시각적으 로 구분된 영역에 표시할 수 있다. 그리고 나서, 사용자 단말은 제1 사용자 입력에 응답하여, 제1 콘텐츠를 선 택하여 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹으로 이동하는 것을 디스플레이 상에 표시할 수 있다. 또한, 사용자 단말은 복수의 콘텐츠 공유 그룹 중 제1 콘텐츠가 할당된 적어도 하나의 그룹을 제1 콘텐츠가 할 당되지 않은 그룹과 시각적으로 구분하여 디스플레이 상에 표시할 수 있다. 이 경우, 사용자 단말은 제1 콘텐 츠가 할당된 적어도 하나의 그룹의 크기, 형태 또는 색상 중 적어도 하나를 변경하여 디스플레이 상에 표시할 수 있다. 일 실시예에서, 제1 콘텐츠는 적어도 하나의 다른 사용자 중 제1 사용자와 연관되며, 사용자 단말은 제1 사용자 와 연관된 제2 콘텐츠를 수신하는 경우, 제1 콘텐츠가 할당된 적어도 하나의 그룹에 제2 콘텐츠를 할당할 수 있 다. 추가적으로, 사용자 단말은 복수의 콘텐츠 공유 그룹 중 제1 그룹에 속하는 사용자와 연관된 제2 콘텐츠를 수신하는 경우, 제1 그룹에 제2 콘텐츠를 할당할 수 있다. 추가적으로, 사용자 단말은 제1 콘텐츠의 대표 이미 지가 제1 콘텐츠가 할당된 적어도 하나의 그룹 상에 표시할 수 있다. 일 실시예에서, 사용자 단말은 제2 사용자 입력에 응답하여, 적어도 하나의 그룹에 대한 제1 콘텐츠의 할당을 취소할 수 있다. 추가적으로, 사용자 단말은 복수의 콘텐츠 공유 그룹 중 제1 그룹에 할당된 콘텐츠를 포함하 는 제1 페이지를 디스플레이에 표시할 수 있다. 그리고 나서, 사용자 단말은 제1 페이지를 스와이핑(swiping) 하는 제2 사용자 입력에 응답하여, 복수의 콘텐츠 공유 그룹 중 제2 그룹에 할당된 콘텐츠를 포함하는 제2 페이 지를 표시할 수 있다. 추가적으로, 사용자 단말은 제1 페이지에 포함된 콘텐츠를 선택하여 제2 페이지로 이동하는 제3 사용자 입력에 응답하여, 제1 그룹에 할당된 콘텐츠를 제2 그룹에 할당할 수 있다. 일 실시예에서, 사용자 단말은 디스플레이에 표시된 복수의 콘텐츠 공유 그룹 중 제1 그룹을 선택하기 위한 제2 사용자 입력을 수신할 수 있다. 그리고 나서, 제2 사용자 입력에 응답하여, 제1 그룹에 할당된 콘텐츠를 포함하 는 페이지를 표시할 수 있다. 일 실시예에서, 복수의 콘텐츠 공유 그룹은 상기 사용자 계정과 연관된 인스턴트 메시지 서비스 상의 그룹 대화방을 기초로 생성될 수 있다. 일 실시예에서, 사용자 단말은 복수의 콘텐츠 공유 그룹에 할당된 복수의 콘텐츠를 디스플레이 상에 표시할 수 있다. 그리고 나서, 사용자 단말은 표시된 복수의 콘텐츠 중 제2 콘텐츠에 대한 제2 사용자 입력에 응답하여, 제2 콘텐츠가 할당된 적어도 하나의 그룹을 디스플레이 상에 표시할 수 있다. 추가적으로, 사용자 단말은 복수 의 콘텐츠 중 제2 콘텐츠에 대한 제2 사용자 입력에 응답하여, 제2 콘텐츠를 조회한 다른 사용자에 관한 정보를 디스플레이 상에 표시할 수 있다. 도 13은 일 실시예에 따른 인공지능 기반의 콘텐츠 분석 모델을 이용한 콘텐츠 공유 범위 설정 방법의 예 시를 나타낸다. 방법은, 사용자 단말(또는 사용자 단말의 적어도 하나의 프로세서)에 의해 수행될 수 있 다. 일 실시예에서, 방법은 사용자 계정과 연관된 복수의 다른 사용자에 관한 정보를 기초로 생성된 복 수의 콘텐츠 공유 그룹 및 제1 콘텐츠를 디스플레이 상에 표시하는 단계(S1310)로 개시될 수 있다. 복수의 콘 텐츠 공유 그룹 및 제1 콘텐츠를 표시한 후, 사용자 단말은 인공지능 기반의 콘텐츠 분석 모델에 의해 제1 콘텐 츠와 복수의 콘텐츠 공유 그룹에 할당된 복수의 콘텐츠의 유사도를 결정할 수 있다(S1320). 유사도를 결정한 후, 사용자 단말은 유사도에 기초하여, 제1 콘텐츠가 복수의 콘텐츠 공유 그룹 중 적어도 하나의 그룹에 할당되 는 것을 디스플레이 상에 표시할 수 있다(S1330). 또한, 사용자 단말은 제1 콘텐츠를 제1 콘텐츠가 할당된 적어 도 하나의 콘텐츠 공유 그룹과 연관시킬 수 있다(S1340). 일 실시예에서, 제1 콘텐츠 및 해당 콘텐츠가 할당된 적어도 하나의 콘텐츠 공유 그룹에 대한 정보는 사용자 단말에 저장되거나, 사용자 단말이 네트워크를 통해 연 결된 서버로 전송될 수 있다. 일 실시예에서, 사용자 단말은 제1 콘텐츠에 포함된 인물 객체를 추출할 수 있다. 그리고 나서, 사용자 단말은 인공지능 기반의 콘텐츠 분석 모델에 의해 추출된 인물 객체 및 사용자 계정과 연관된 적어도 하나의 다른 사용 자에 관한 정보를 기초로 추가의 콘텐츠 공유 그룹을 생성할 수 있다. 또한, 생성된 추가의 콘텐츠 공유 그룹 에 상기 제1 콘텐츠를 할당할 수 있다. 본 개시의 방법, 동작 또는 기법들은 다양한 수단에 의해 구현될 수도 있다. 예를 들어, 이러한 기법들은 하드 웨어, 펌웨어, 소프트웨어, 또는 이들의 조합으로 구현될 수도 있다. 본원의 개시와 연계하여 설명된 다양한 예시적인 논리적 블록들, 모듈들, 회로들, 및 알고리즘 단계들은 전자 하드웨어, 컴퓨터 소프트웨어, 또는 양자 의 조합들로 구현될 수도 있음을 통상의 기술자들은 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호 대 체를 명확하게 설명하기 위해, 다양한 예시적인 구성요소들, 블록들, 모듈들, 회로들, 및 단계들이 그들의 기능 적 관점에서 일반적으로 위에서 설명되었다. 그러한 기능이 하드웨어로서 구현되는지 또는 소프트웨어로서 구 현되는지의 여부는, 특정 애플리케이션 및 전체 시스템에 부과되는 설계 요구사항들에 따라 달라진다. 통상의 기술자들은 각각의 특정 애플리케이션을 위해 다양한 방식들로 설명된 기능을 구현할 수도 있으나, 그러한 구현 들은 본 개시의 범위로부터 벗어나게 하는 것으로 해석되어서는 안된다. 하드웨어 구현에서, 기법들을 수행하는 데 이용되는 프로세싱 유닛들은, 하나 이상의 ASIC들, DSP들, 디지털 신 호 프로세싱 디바이스들(digital signal processing devices; DSPD들), 프로그램가능 논리 디바이스들 (programmable logic devices; PLD들), 필드 프로그램가능 게이트 어레이들(field programmable gate arrays; FPGA들), 프로세서들, 제어기들, 마이크로제어기들, 마이크로프로세서들, 전자 디바이스들, 본 개시에 설명된 기능들을 수행하도록 설계된 다른 전자 유닛들, 컴퓨터, 또는 이들의 조합 내에서 구현될 수도 있다. 따라서, 본 개시와 연계하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 및 회로들은 범용 프로세서, DSP, ASIC, FPGA나 다른 프로그램 가능 논리 디바이스, 이산 게이트나 트랜지스터 로직, 이산 하드웨어 컴포넌트들, 또는 본원에 설명된 기능들을 수행하도록 설계된 것들의 임의의 조합으로 구현되거나 수행될 수도 있다. 범용 프로세서는 마이크로프로세서일 수도 있지만, 대안으로, 프로세서는 임의의 종래의 프로세서, 제어기, 마이크로 제어기, 또는 상태 머신일 수도 있다. 프로세서는 또한, 컴퓨팅 디바이스들의 조합, 예를 들면, DSP와 마이크 로프로세서, 복수의 마이크로프로세서들, DSP 코어와 연계한 하나 이상의 마이크로프로세서들, 또는 임의의 다 른 구성의 조합으로 구현될 수도 있다. 펌웨어 및/또는 소프트웨어 구현에 있어서, 기법들은 랜덤 액세스 메모리(random access memory; RAM), 판독 전 용 메모리(read-only memory; ROM), 비휘발성 RAM(non-volatile random access memory; NVRAM), PROM(programmable read-only memory), EPROM(erasable programmable read-only memory), EEPROM(electrically erasable PROM), 플래시 메모리, 컴팩트 디스크(compact disc; CD), 자기 또는 광학 데이 터 스토리지 디바이스 등과 같은 컴퓨터 판독가능 매체 상에 저장된 명령어들로 구현될 수도 있다. 명령들은 하나 이상의 프로세서들에 의해 실행 가능할 수도 있고, 프로세서(들)로 하여금 본 개시에 설명된 기능의 특정 양태들을 수행하게 할 수도 있다. 이상 설명된 실시예들이 하나 이상의 독립형 컴퓨터 시스템에서 현재 개시된 주제의 양태들을 활용하는 것으로 기술되었으나, 본 개시는 이에 한정되지 않고, 네트워크나 분산 컴퓨팅 환경과 같은 임의의 컴퓨팅 환경과 연계 하여 구현될 수도 있다. 또 나아가, 본 개시에서 주제의 양상들은 복수의 프로세싱 칩들이나 장치들에서 구현 될 수도 있고, 스토리지는 복수의 장치들에 걸쳐 유사하게 영향을 받게 될 수도 있다. 이러한 장치들은 PC들, 네트워크 서버들, 및 휴대용 장치들을 포함할 수도 있다."}
{"patent_id": "10-2021-0011655", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서에서는 본 개시가 일부 실시예들과 관련하여 설명되었지만, 본 개시의 발명이 속하는 기술분야의 통상 의 기술자가 이해할 수 있는 본 개시의 범위를 벗어나지 않는 범위에서 다양한 변형 및 변경이 이루어질 수 있 다. 또한, 그러한 변형 및 변경은 본 명세서에 첨부된 특허청구의 범위 내에 속하는 것으로 생각되어야 한다."}
{"patent_id": "10-2021-0011655", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 사용자가 사용자 단말을 이용하여 콘텐츠의 공유 범위를 설정하는 예시를 나타낸다. 도 2는 본 개시의 일 실시예에 따른 콘텐츠 공유 서비스를 제공하기 위하여, 정보 처리 시스템이 복수의 사용자 단말과 통신 가능하도록 연결된 구성을 나타내는 개요도이다. 도 3은 본 개시의 일 실시예에 따른 사용자 단말 및 정보 처리 시스템의 내부 구성을 나타내는 블록도이다. 도 4는 일 실시예에 따라 사용자가 다른 사용자와 공유할 콘텐츠를 업로드하는 예시를 나타낸다. 도 5는 일 실시예에 따라 사용자가 콘텐츠를 복수의 콘텐츠 공유 그룹 중 하나 이상에 할당하는 예시를 나타낸 다. 도 6은 일 실시예에 따라 사용자가 콘텐츠 공유 그룹에 대하여 콘텐츠의 할당을 취소하는 예시를 나타낸다. 도 7은 일 실시예에 따라 사용자가 콘텐츠 공유 그룹 별로 할당된 콘텐츠를 표시하는 페이지를 이동하는 예시를나타낸다. 도 8은 일 실시예에 따라 사용자가 제1 그룹에 이미 할당된 콘텐츠를 제2 그룹에 할당하는 예시를 나타낸다. 도 9는 일 실시예에 따라 사용자가 업로드한 콘텐츠의 공유 범위를 확인하는 예시를 나타낸다. 도 10은 일 실시예에 따라 사용자가 인공지능 기반의 콘텐츠 분석 모델에 의해 콘텐츠를 콘텐츠 공유 그룹에 할 당하는 예시를 나타낸다. 도 11은 일 실시예에 따라 사용자가 인공지능 기반의 콘텐츠 분석 모델에 의해 인물 객체를 포함하는 콘텐츠를 콘텐츠 공유 그룹에 할당하는 예시를 나타낸다. 도 12는 일 실시예에 따른 콘텐츠 공유 범위 설정 방법의 예시를 나타낸다. 도 13은 일 실시예에 따른 인공지능 기반의 콘텐츠 분석 모델을 이용한 콘텐츠 공유 범위 설정 방법의 예시를 나타낸다."}
