{"patent_id": "10-2023-0140132", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0056420", "출원번호": "10-2023-0140132", "발명의 명칭": "머신러닝 비전인식 기반 자동화 렌즈 조정 시스템", "출원인": "김준영", "발명자": "김준영"}}
{"patent_id": "10-2023-0140132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "머신러닝 비전인식 기반 자동화 렌즈 조정 시스템에 있어서,라이다센서를 하부에 고정하고, 상하동작을 수행하는 가이드모듈;상기 라이다센서에서 출사되는 광을 반사시키는 카메라모듈;상기 라이다센서를 회전시키는 회전구동모듈;을 구비하는,머신러닝 비전인식 기반 자동화 렌즈 조정 시스템."}
{"patent_id": "10-2023-0140132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 회전구동모듈은, 적외선을 감지할 수 있는 IR 카메라모듈에 라이다 센서에서 생성된 빛이 감지되면, 설정된 크기의 원이 빛에 자동으로 적용되어 빛의 파장 크기를 비교하고, 빛의 파장이 설정한 원보다 크면 작아지는 방향으로 라이다센서를회전시키는 모터를 제어하고, 파장이 원보다 작으면 파장을 크게 하는 방향으로 모터가 돌아갈 수 있는 기능을수행하도록 하는,머신러닝 비전인식 기반 자동화 렌즈 조정 시스템."}
{"patent_id": "10-2023-0140132", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 가이드모듈을 승하강 시키는 승하강모듈;을 더 포함하는,머신러닝 비전인식 기반 자동화 렌즈 조정 시스템."}
{"patent_id": "10-2023-0140132", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 머신러닝 비전인식 기반 자동화 렌즈 조정 시스템에 대한 것으로, 머신러닝 비전 인식 기반, 자동화 렌즈 조정 공정 시스템을 사용하면 다음과 같은 기대 효과를 얻을 수 있다. 특히 인구감소에 따른 생산자 부족이 나 인건비 상승에 대비할 수 있으며, 부분 자동화로 전환하는 모델을 통해 매번 정확한 초점을 가진 라이다 센서 를 양산하여 공급 기업으로서의 장점을 가질 수 있고, 증가하는 자율주행 사고에 큰 도움을 기대할 수 있다."}
{"patent_id": "10-2023-0140132", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 머신러닝 비전인식 기반 자동화 렌즈 조정 시스템에 대한 것이다."}
{"patent_id": "10-2023-0140132", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 산업에서 생성되고 있는 라이다 센서는 제작 과정 중 라이다 센서의 빛을 투과시키는 렌즈의 초점을 산업 에서 정해진 규격대로 맞추는 과정이 ‘수동’의 방식으로 존재한다. 해당 방식은 사람이 직접 모눈종이에 비친 빛을 맨눈으로 확인하며 렌즈의 초점을 맞추고 있다. 따라서, 매번 균일하지 않은 제품이 양산되고 렌즈 초점의 정확도가 떨어진다는 문제가 존재한다. 이러한 문제는 자율주행의 사고 증가를 유발하며, 라이다 센서를 양산하 는 기업이 공급기업으로서의 메리트를 가질수없도록 함. “비전인식을 이용한 렌즈 초점 자동화 공정 시스템” 은 이러한 문제를 해결하기 위해 착안하였다."}
{"patent_id": "10-2023-0140132", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제를 해결하기 위하여 안출된 것으로, 본 발명은 비전인식을 이용한 렌즈 초점 자동화 공정 시스템은 인공지능 및 머신러닝 기술과 기구 설계 기술(모터)을 이용하여 모눈종이에 비친 라이다 센서의 빛을 자동으로 인식하고 분석해 정해진 규격에 맞는 픽셀값으로 범위를 설정하여 초점이 해당 범위에 겹칠 때까지 feedback 과정을 겪으며 초점을 맞추는 것으로 구현된다. 여기서 feedback과정이 의미하는 것은 초점이 풀어져 야할 때 풀어지도록 모터가 회전하고, 조여져야 할 때 모터가 조여주는 방향으로 회전하는 것을 의미한다."}
{"patent_id": "10-2023-0140132", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 문제를 해결하기 위한 수단으로서, 본 발명은 현재 자율주행 사고율의 증가로 인해 주로 사용되는 라이 다 센서의 초점 조절 문제에 주목하여 진행되었으며, 일정한 렌즈 초점을 가진 라이다 센서를 자동화된 기계 제 어 시스템을 통해 균일한 품질로 양산할 수 있도도록 한다. 이를 위해 인공지능 비전 인식 기술을 활용하여 실 시간 피드백 프로세스를 통해 초점 크기를 조절하며, 이러한 자동화된 공정을 통해 자율주행 사고 발생을 예방 하고 라이다 센서 생산 업체가 균일한 렌즈 초점을 유지함으로 신뢰성과 공정에 필요한 인력 감소를 통해 라이 다 센서가 사용되는 자율주행 관련된 산업에서 긍정적인 영향을 미칠 것으로 기대된다. 구체적으로, 본 발명은 머신러닝 비전인식 기반 자동화 렌즈 조정 시스템에 있어서, 라이다센서를 하부에 고정 하고, 상하동작을 수행하는 가이드모듈; 상기 라이다센서에서 출사되는 광을 반사시키는 카메라모듈; 상기 라이 다센서를 회전시키는 회전구동모듈;을 구비하는, 머신러닝 비전인식 기반 자동화 렌즈 조정 시스템을 제공할 수 있다. 이 경우, 상기 회전구동모듈은, 적외선을 감지할 수 있는 IR 카메라모듈에 라이다 센서에서 생성된 빛이 감지되 면, 설정된 크기의 원이 빛에 자동으로 적용되어 빛의 파장 크기를 비교하고, 빛의 파장이 설정한 원보다 크면 작아지는 방향으로 라이다센서를 회전시키는 모터를 제어하고, 파장이 원보다 작으면 파장을 크게 하는 방향으 로 모터가 돌아갈 수 있는 기능을 수행하도록 할 수 있다."}
{"patent_id": "10-2023-0140132", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 머신러닝 비전 인식 기반, 자동화 렌즈 조정 공정 시스템을 사용하면 다음과 같은 기대 효과를 얻을 수 있다. 특히 인구감소에 따른 생산자 부족이나 인건비 상승에 대비할 수 있으며, 부분 자동 화로 전환하는 모델을 통해 매번 정확한 초점을 가진 라이다 센서를 양산하여 공급 기업으로서의 장점을 가질 수 있고, 증가하는 자율주행 사고에 큰 도움을 기대할 수 있다."}
{"patent_id": "10-2023-0140132", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예를 참조하면 명확해질 것이다. 그러나 본 발명은 여기서 설명되는 실시예들에 한정되지 않고 다른 형태로 구 체화될 수도 있다. 오히려, 여기서 소개되는 실시예들은 개시된 내용이 철저하고 완전해질 수 있도록 그리고 당 업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 1. 본 발명의 개요 자율주행의 기본이 되는 라이다 센서의 초점이 매번 다르게 양산되는 문제는 자율주행의 사고를 유발하는 가장 큰 원인으로 알려졌다. 미국 고속도로교통국(NHTSA)은 우버 자율주행 사고 조사 결과를 발표하면서 자율주행 소 프트웨어가 충돌 6초 전에 보행자를 발견했음에도 이를 단순한 물체 또는 다른 차로 인식했다고 발표하였다. 이 어 충돌 1.3초 전에 긴급 비상 제동장치(EBS) 작동이 필요한 상황으로 판단했지만, 해당 기능이 차단돼 결국 보행자 충돌로 이어졌다고 설명하였다. 이처럼 자율주행에 사용되는 라이다 센서의 초점은 양산될 때, 정확하게 양산되어야 함. 현재 라이다 센서를 양산할 때 초점의 조절은 “수동” 과정으로 진행되고 있다. 수동의 방식의 초점 조절은 매번 다른 초점을 가지는 라이다 센서를 양산함. 따라서, 수동이 아닌 자동화 공정의 설계에 대한 필요성이 시급함. 라이다 센서의 공급 기업이 매번 다른 초점을 가진 라이다 센서를 양산한다면 제품의 신뢰성 이 저하되어 자율주행 산업 전반적으로 악영향을 주게된다. 이처럼 라이다 생산기업이 매번 정확한 라이다 센서를 양산 하도록 돕는 시스템 연구개발을 목표로 한다. 매년 증가하는 인건비의 상승으로 인해 생산자를 많이 뽑을 수 없는 상황에 더해 인구감소 문제까지 겹치며 악순환은 반복되고 있는 상황으로 볼 때도, 해당 공정과 같은 자동화 시스템을 적용할 필요성이 크다. 앞서 언급할 필요 성에 기반하여 수동으로 진행하는 공정을 자동화로 변환하여 수동 공정의 문제를 해결하고자 한다. 2. 발명의 배경과 필요성 최근 지속적인 인구감소 추세와 인건비의 상승은 사회적으로 큰 문제를 가지고 있음. 도 1에서 볼 수 있듯이 인 구감소 문제는 가파르게 진행되고 있으며, 2115년에는 1,543만 명으로 현재 인구보다 약 4,000만 명이나 더 줄 어들 것으로 예상된다. 인구가 감소 되면서 생산직을 맡을 인원은 지속해서 줄어들게 되고 이는 인건비의 상승 으로 이어지게 된다. 도 2에서 볼 수 있듯이 한국 G5 임금 상승률은 G5에 비해 2.6배나 더 높은 수치의 상승률을 기록하고 있으며 이는 물가 상승에 압박을 가하기에, 충분한 수치이다. 따라서, 인구감소 및 인건비의 상승은 경제적으로 큰 타 격을 입히기에 충분하다는 것을 알 수 있음. 수많은 인구로 한국보다 비교적 싼 인건비를 자랑하던 중국도 인구 감소 및 인건비의 상승을 대비하기 위해 큰 노력을 기울이고 있는 것을 알 수 있음. 최근 중국은 10년간 매년 10%의 인건비 상승을 겪고 있으며, 늘어나는 의료 보험 등 기업에서 부담해야 하는 비용이 증가하며 고용 비용 은 지속해서 상승하고 있음. 이러한 문제점에 의해 중국은 중진국 함정을 벗어나기 위한 정책을 펼치는 중임. 공장자동화, 로봇산업 육성을 통해 중진국 함정을 극복하려는 정책을 펼치고 있다. 여기서 중진국 함정이란, 값 싼 인건비로 인해 쉽게 성장한 개발 도상국이 상승하는 인건비에 의해 산업 경쟁력을 잃어버리는 현상을 의미한 다. 말레이시아·태국 등 동남아 국가들, 대부분의 남미 국가들, 일부 동유럽 국가들은 저임을 바탕으로 성장했 다가 임금이 올라가는 국면에서 일자리 창출에 실패했고 경제성장률이 하락한다. 이러한 문제는 공장자동화를 통해 해결할 수 있음. 먼저, 로봇을 이용하여 공장을 자동화한다면 감시자 즉, 1명의 인원으로 많은 생산과정을 총괄할 수 있다는 장점이 있다. 또한, 로봇을 사용함으로써 더욱 더 정확한 제품을 양산할 수도 있기에 중진국 함정 극복에 큰 도움이 되며 인구감소 및 인건비 상승으로 예상되는 생산기업의 침체를 방지할 수 있기에 로봇 자동화의 적용은 필연적으로 다가온다. 최근 자율주행 사고가 증가하고 있음. 앞서 서론에서 언급한 사건인 우버 충돌사건은 자율주행의 인지 부족으로 인해 발생한 사건이다. 자율주행의 인지 부족은 사고로 직결될 수 있는 문제이므로, 신속히 해결해야 하는 문제 이다. 자율주행의 사고 원인들은 ADS 장치와 차량의 장치 및 부품의 기계적 결함, 내재적 소프트웨어 결함, 통 신 시스템상 오류 정보 제공과 같은 여러 가지의 요인으로 문제가 발생하고 있다. 우리가 주목해야 할 부분은 1. ADS 장치와 차량의 장치 및 부품의 기계적 결함 부분이다. 여기서 ADS 장치란 Automatic Driving System의 약자로 완전 자율주행을 의미한다. ADS 장치의 결함은 사물 인식과 사람 인식을 구별할 수 있는 기능을 상실한 다는 것을 의미하고, 이는 자율주행 사고 발생 위험을 증가하는 데 크게 일조할 수 있다. 요즘은, ADS가 아닌 ADAS로 전환되고 있지만, 이러한 추세에도 라이다 센서의 초점 문제의 중요성은 지속해서 대두되고 있다. 3. 본 발명에 적용되는 이론 1) TOF TOF란 Time-Of-Flight의 약자로 물체, 입자 또는 파동이 매질을 통해 거리를 이동하는 데 걸리는 시간을 측정 한 것을 의미한다. 라이다 센서의 기반이 되는 개념으로써 라이다 센서가 빛을 발사하고 물체에 반사되어 돌아 오기까지의 시간을 측정하여 측정하고 싶은 물체의 거리를 측정하는 센서가 라이다 센서이다. 2) 설계 제안 라이다 센서의 레이저가 어떻게 맺히는지 도 6에 보이는 라즈베리파이 적외선 카메라를 이용해서 실시간 인식을 진행하는 것을 1차 목표로 한다. 2차 목표는 비전 인식을 통해 분석한 초점의 크기를 보고, 초점을 풀어주는 방 향으로 모터를 제어해야 할지 초점을 조여주는 방향으로 모터를 제어해야 할지를 정해주는 신호를 보내며 모터 를 제어한다. 이때, 초점을 맞추기 위해 사용되는 도구인 “콜렛”을 사용해서 라이다 센서의 초점을 맞추어준 다. 도 4는 라이다 센서의 사진을 첨부하였으며, 도 5는 설계에 적용될 라이다 센서의 초점을 맞춰주는 도구의사진을 첨부하였다. 4. 틀 구상 가장 기본적인 문제인 라이다 센서의 초점을 자동으로 조절하는 기능을 위해서 톱니를 이용해 모터와 연결된 톱 니가 다른 톱니를 돌리고, 이 톱니와 연결된 콜렛이 렌즈를 돌리며 초점을 조절하는 구조를 구상하였다. 이런 구조를 구상한 후, 직면한 여러 문제가 존재하였다. 먼저 도 7 및 도 8처럼 렌즈가 다 조여진 상태와 다 풀어진 상태를 비교하면 렌즈의 높이 차이가 발생한다는 것을 알 수 있다. 그래서 렌즈가 풀리고 조이는 상태에 따라 그 높이에 맞춰 조절을 해줘야 한다는 것이 첫 번째 문제였고, 이를 해결하기 위해 렌즈와 콜렛이 수직으로 마주 보도록 설계한 뒤, 도 9의 위 판의 무게를 이용해 렌즈를 콜렛과 밀착시킴으로서 렌즈가 위아래로 움직임에 따라 생기는 위치 변화를 해결하였다. 또 이때 발생한 문제가 라이다 센서의 초점을 정확하게 측정하기 위해선 최소 5m 이상의 거리를 두고 측정해야 하기 때문에, 도 9에서 아래로 발사된 빛이 45도로 설치된 거울에 반사되고, 굴절된 빛이 틀의 구멍을 따라 통과해 상이 맺힐 수 있도록 설계 하였다. 이때 발생한 또 다른 문제가 콜렛과 연결된 톱니 부분이 “ 가운데에 구멍이 뚫려있는 구조 + 회전 기 능”의 조건을 가지고 있어야 했기 때문에 단순하게 고정하는 것이 불가능하다는 문제가 존재하였고, 이를 해결 하기 위해 우리는 도 9의 틀 설계에서, 큰 틀의 상단부에 도 10의 두 얇은 철판을 고정하고, 거기에 도 11 및 도 12 처럼 서로 맞물려 돌아갈 수 있도록 설계한 구조를 이용하여, 공중에 뜬 상태로 돌아갈 수 있게 설계하였 다. 그렇게 해서 처음에 해결해야 했던 문제 및 설계하는 과정에서 생긴 문제들을 해결한 틀을 구상하였다. -스텝 모터 전반적인 틀을 설계한 뒤 렌즈의 초점을 조절하는 데에 가장 기반이 되는 모터 제어를 함. 기본적으로 모터가 가져야 했던 기능이 “ 인공지능으로 인식한 초점의 상태에 따른 모터 제어”였기 때문에 가장 먼저 원하는 방 향과 속도로 돌리는 코드를 먼저 설계하여 확인하였다. -구현 가능성 확인 모터 제어를 구현한 뒤, 설계한 틀의 실제 구현 가능성을 확인하기 위해, 각각의 부품들을 3D Printer를 이용해 뽑아 조립한 뒤 도 13 처럼 실제로 틀을 구현하였다. 틀을 구현한 뒤 톱니를 모터와 연결하고 모터를 제어해, 설계한 대로 모터와 연결된 톱니가 다른 톱니를 우리가 원하는 정확도로 돌릴 수 있는지와 그 외에 돌아가면서 발생하는 문제들은 없는지에 관해 확인하였다. 확인 후 몇 가지 문제를 발견하였고, 그 문제들은 첫 번째로 소음 문제가 발생함. 도 11 및 도 12의 구조로 콜렛 톱니가 공중에 떠 있을 수 있도록 설계하였는데, 이때 이 부분이 돌아가면서 서로 마찰이 발생해 “드드득” 거리는 소 음 문제가 발생함. 두 번째로 설계할 때 예상하였던 문제점이지만, 설계한 틀이 Z축으로의 이동이 우리가 원하 는 데로 제어할 수 없다는 문제점이 있었고, 전반적인 틀의 크기도 불필요하게 컸으며, 톱니가 우리가 원하는 만큼의 정확도를 갖출 수 있는지 확신할 수 없다는 문제점을 발견하였다. - 인공지능 기반 소프트웨어 제작 아이디어 설계에서 가장 중점이 되는 파트가 바로 인공지능을 기반으로 한 소프트웨어 제작이다. 우리는 라즈베 리 파이4를 기본 메커니즘으로 구성하여, 적외선을 감지할 수 있는 IR 카메라에 라이다 센서에서 생성된 빛이 감지되면, 설정된 크기의 원이 빛에 자동으로 적용되어 빛의 파장 크기를 비교하고, 빛의 파장이 설정한 원보다 크면 작아지는 방향으로 모터를 제어하고, 파장이 원보다 작으면 파장을 크게 하는 방향으로 모터가 돌아갈 수 있는 기능을 수행하도록 코딩하여 소프트웨어를 구상하였고 그 결과물은 도 14와 같다. 도 14에서 확인할 수 있듯이, 라이더 센서의 빛이 IR 카메라에 인식된 후, 우리가 설정한 크기의 원이 빛을 자 동으로 인식하여 빛의 가운데에 위치함. 그 후 파장이 원보다 크면 파장이 작아지는 방향으로, 반대의 경우에는 모터가 반대로 작동하도록 제작하였다. 추가로 도 14 에서 볼 수 있듯이 정지상태의 픽셀 크기, 즉 원의 크기를 쉽게 조절할 수 있게 함으로써, 만약 작업 위치의 변화 등의 이유로 적절한 파장 크기가 변하더라도, 이에 따라 유동적으로 적절한 원의 크기, 측 픽셀값 조정이 가능하게 하여 유동적인 장점을 가지게 된다. -틀 최적화 첫 번째 틀 설계 후 구현화 하는 단계에서 발생한 문제들이 있었음. 1. 소음 문제, 2. Z축 조절 불가 문제, 3. 정확도 문제, 4. 크기 문제를 해결하기 위해서 새로운 전체 틀을 구상하였으며, 구상한 틀은 도 15와 같다. 먼 저 가장 기본적인 메커니즘인 콜렛과 렌즈가 수직으로 설계되어 빛이 아래로 발사되고, 45도 거울이 빛을 반사해 인식하는 메커니즘은 유지한 상태로 해서, 모터가 돌아갈 때 발생한 소음 문제는 팬 벨트 형식으로 고정한 구조로 설계해 소음 문제를 해결했을 뿐 아니라, 톱니가 돌아갈 때, 원하는 만큼 정밀하게 톱니를 조절할 수 없 어 약간 부족하였던 정확도 문제를 팬 벨트 형식으로 바꾸어서, 더 미세한 조절이 가능하게 한다. 또 Z축으로의 이동 조절이 불가능했던 문제도, Z축에 리니어 모터를 추가로 설치하여 Z축으로 이동 또한 가능하게 설계함. 마 지막으로 전체적인 틀도 핵심적이고 기본적인 기능들이 들어가 있는 상태로 최소화하여 불필요하게 컸던 틀 크 기 문제까지 해결하였다. 그렇게 설계한 틀을 실제로 만들어본 결과는 도 16과 같다. -결과값 도출을 위한 과정 도 17 및 도 18은 결과값 도출을 위해 다음과같은 python 코드를 짜서 초점의 사진의 픽셀을 나누고 , 픽셀의 개수를 분석하는 과정을 수행한 결과를 도시한 것이다. 본 발명은 다음과 같은 장점을 가진다. 먼저, 라이다 센서의 초점 정확성이 증가할 수 있으며, 초점의 크기는 사람의 컨디션에 따라서 매번 다르다는 문제점을 가지고 있다. 도 19는 사람이 수동으로 초점을 맞추려고 할 때 매번 다른 초점의 크기로 생산되는 것을 보여주는 이미지이다. 이처럼 사람이 수동으로 초점 조절 과정을 맡 게 된다면, 매번 다른 컨디션 및 손 떨림에 의해 초점의 정확도가 떨어지며 이는, 생산품으로서의 가치를 떨어 뜨리게 됨. 하지만, 설계된 본 팀의 아이디어를 적용한다면 아래 그림과 같이 매번 같은 초점을 가진 라이다 센 서를 양산할 수 있음을 알 수 있다. 도 20은, 이러한 본 발명에 따른 제품을 사용하여 초점을 맞춘 사진이다. 수동으로 진행하던 본 작업은 대량생산 시에 많은 인건비가 사용된다는 단점이 있을 수 있다. 따라서, 본 발명 에 따른 시스템을 이용하여 대량생산을 적은 인원으로 효율적인 시간에 해결할 수 있게 된다. 본 발명을 적용하면, 수동으로 진행하는 렌즈 초점 조절 공정을 자동화하는 효과를 볼 수 있다. 해당 과정을 통 해 많은 생산자로 생산하는 과정에서 몇 명의 생산자만으로 대량생산이 가능하게 하는 혁신을 이룰 수 있으며, 앞서 언급한 중진국 함정을 극복할 수 있는 공정 시스템을 적용할 수 있다. 또한, 다량 생산을 위해 많은 돈을 들일 필요가 없으며, 증가하는 인건비 및 물가 상승에 대비할 수 있다. 비록, 초기비용이 들어가는 단점이 있지 만 제품 양산에서의 정확성 및 가격 경쟁력의 우위를 가질 수 있기에 라이다 센서 제조 기업에 큰 도움이 될 것으로 예상된다. 도 21 및 도 22는 라이너 엑츄에이터를 이용한 수직 방향의 움직임을 구현하는 장치 구조를 도시한 것이고, 스 토퍼 구조를 제시한 것이다. 도 23은, 픽셀 에러범위를 도시된 표를 참고하여 서술하겠다. 파란색은 자동화된 기기에 결착하여 픽셀을 분석 한 것이고, 주황색은 피실험자 5명을 기준으로 렌즈의 초점을 맞춰본 것이다. 이때 카네비 모빌리티 기업에서 가이드라인으로 사용하는 초점의 크기를 기준으로 픽셀을 분석함. 이때 픽셀의 수는 38,000개 이다. 38,000 개 를 기준으로 픽셀의 오차 범위를 측정하였다. 그 결과, 주황색 (수동) 은 최대 14,703개의 오차 픽셀 수가 나왔 고 최소 305개의 오차를 가짐을 알게 됨. 수동과 다르게, 자동화 기기에 적용한 파란색 (자동) 은 평균 500개의 오차범위를 가진다는."}
{"patent_id": "10-2023-0140132", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 도 2는 지속적인 인구감소 추세와 인건비 상승의 문제를 설명하기 위한 이미지이다. 도 3은 라이다 센서를 4개를 연동하여 다양한 초점을 측정하는 사례를 설명하기 위한 도면이다. 도 4 내지 도 22는 본 발명의 구현 예를 설명하기 위한 이미지이다."}
