{"patent_id": "10-2020-0094263", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0014543", "출원번호": "10-2020-0094263", "발명의 명칭": "이용자와 판매자의 자발적 참여로 선순환 연결되는 온라인 플랫폼의 방법과 시스템", "출원인": "권혁민", "발명자": "권혁민"}}
{"patent_id": "10-2020-0094263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "패션 빅데이터를 데이터의 성질에 따라 구분 저장하는 문자,숫자,이미지 수집/저장부 ; 수집된 데이터 중 이미지의 판별을 통해 이미지 분류 값을 판별하는 인공지능 이미지 판별부 ; 수집된 데이터 중 텍스트 마이닝 기법이나 사칙 연산이 가능한 데이터에 대한 문자, 숫자 데이터 가공부 ; 수집된 데이터를 연결자 ( PRIMARY KEY )로 결합 저장하고 사용 환경을 반영한 분석 원천 데이터 저장/관리부 ; 패션 이미지 사진을 조회해서 유사한 상품을 추천해 주고 온라인 쇼핑몰로 연결을 지원하는 서비스와 고객이 판매자의 상품을 추천 등록하는 고객 유사상품 조회/결과, 추천상품 판매자 연결부 ; 패션 이미지와 온라인 판매 URL을 직접 등록하고 관리하는 판매자상품 등록/관리부 ; 고객 조회 패션 이미지와 유사한 상품을 제안한 경우 선택한 상품, 인터넷 쇼핑몰로 연결한목록을 저장하는 고객, 판매자 반응 데이터 저장부 ; 고객별로 선호하는 브랜드, 또는 패션 유형을 분석,연령, 성별, 지역별등의 고객군별로 상품 선택의 유형을 분석하는 고객, 판매자 반응 데이터 분석부를 포함하는것을 특징으로 하는 이용자와 판매자의 자발적 참여로 선순환 연결되는 온라인 플랫폼의 방법과 시스템 의 방법과 장치이다."}
{"patent_id": "10-2020-0094263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "문자, 숫자, 이미지 수집/저장부(100)는, 패션 이커머스 플랫폼 또는 패션 연관 SNS에서 상품명, 상품 관련 정보와 판매량, 고객 반응 정보 ( 댓글,댓글수, …) 등의 문자,숫자 추출/저장 모듈 (110), 상품의 이미지 정보를추출, 저장하는 이미지 추출/저장 모듈(120)을 포함한다."}
{"patent_id": "10-2020-0094263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "상기 인공지능 이미지 판별부(200)는, 지도학습 라벨 관리 모듈 (210), 머신러닝 CNN 학습 모듈 (220) , 머신러닝 CNN 재학습 모듈 (230)을 포함한다. 지도 학습에 있어 목표값(라벨)을 패션 카데고리 분류체계에 맞도록 분류 기준을 만들고 대-중-소의 흐름을 관리하는 하는 지도학습 라벨 관리 모듈 (210, ) 라벨에 맞는 데이터 사진을 다양한 환경과 조건에서 촬영한 이미지를 수집. 머신러닝 학습전 가공하는 선처리 과정을 포함, 실제 머신러닝의 학습 과정을 진행하는 머신러닝 CNN 학습 모듈 (220) , 학습결과를 TEST를 통해 정확도를 높이기 위한 재학습의 과정을 포함한 머신러닝 CNN 재학습 모듈 (230)을 포함한다."}
{"patent_id": "10-2020-0094263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "상기 문자, 숫자 데이터 가공부(300)는, 분류 체계별 가공 모듈 (310) , 수집 단위별 순위화 모듈 (320)을 포함한다. 패션 관련 수집된 문자, 숫자 정보는 패션 분류(대-중-소) 체계와 데이터 출처. 브랜드 단위별로 분석을 빠르게 수행하기 위한 사전 집계가 필요하다. 이런 분류,출처,단위별로 사전 데이터를 집계, 가공 선 처리하는 분류 체계별 가공 모듈 (310) , 또한 고객 반응에 따른 규모별, 상품 스타일수별로 우선순위와 비중, 누적비중을 사전에 선 집계하는 수집 단위별 순위화 모듈 (320)을 포함한다"}
{"patent_id": "10-2020-0094263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "상기 분석 원천 데이터 저장/관리부(400)는, 이미지, 문자, 숫자 연결 모듈 (410) , 분석 항목 관리 모듈 (420) , 사용자 권한 모듈 (430)을 포함한다. 문자와 숫자 처리부를 통해 추가된데이터와 와 이미지 처리부로 이미지 별로 분류 코드화 된 데이터를 연결자 ( PRIMARY KEY )로 결합하는 이미지,문자,숫자 연결 모듈 (410) ,사용자는 분석을 경쟁자를 압축하거나 상품의 아이템 단위만 집중해 볼 필요성이 있다. 사용자가 원하는 브랜드또는 상품 단위를 따로 분석 집계할 수 있는 분석 항목 관리 모듈 (420) , 데이터를 통해 제공할 서비스중 고객공개특허 10-2022-0014543-3-이 원하는 서비스를 고객의 선택 제공 받도록 사용자별 서비스 사용 항목에 대한 권한을 관리하는 사용자 권한모듈 (430)을 포함한다"}
{"patent_id": "10-2020-0094263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "상기 고객 유사 상품 조회/결과, 추천상품 판매자 연결부 (500) , 사진 관리 모듈 (510) , 결과 조회 모듈(520) , 추천상품 등록 판매자 연결모듈 (530)을 포함한다. 이용 고객이 유사 이미지 찾기 서비스를 사용하기위해 등록한 사진을 저장, 관리하는 사진 관리 모듈 (510) , 조회 이미지에 맞는 유사한 이미지 결과를 관리하고 그중 고객이 선택한 이미지를 관리 저장하는 결과 조회 모듈 (520) , 사용자가 판매자 상품 추천을 위해 사진과 온라인 판매 주소를 등록,관리하는 추천 상품 등록 판매자 연결 모듈 (530) 을 포함한다."}
{"patent_id": "10-2020-0094263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "상기 판매자 상품 등록/관리부 (600)는, 사진 관리 모듈 (610) , 사진 확정 모듈 (620) , 사진 등록 이력 저장모듈 (630)을 포함한다. 판매를 목적으로 상품을 등록 하는 사진 관리 모듈 (610) , 등록 사진은 인공 지능을통해 패션 카테고리 (대-증-소)를 자동으로 분류해 판매자가 확인후 최종 확정한다. 결과가 오분류라고 생각되는 경우에 직접 적합한 패션 카테고리로 변경후 확정하는 사진 확정 모듈 (620) , 등록한 패션 상품의 사진과등록 정보의 이력을 관리하는 사진 등록 이력 저장 모듈 (630) 을 포함한다."}
{"patent_id": "10-2020-0094263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항8상기 고객, 판매자 반응 데이터 저장부 (700)는, 고객 조회 관리 모듈 (710) , 판매자 등록 관리 모듈 (720) ,판매자 연결 기록 관리 모듈 (730)을 포함한다. 고객의 특징(성별,연령) 을 포함해 연결 이력을 관리 하는 고객 조회 관리 모듈 (710) , 판매를 목적으로 상품 등록에 참여한 판매자를 관리 하는 판매자 등록 관리 모듈(720) , 고객의 유사 이미지 조회후 인터넷 쇼핑몰로 연결한 이력을 관리 하는 판매자 연결 기록 관리 모듈(730) 을 포함한다."}
{"patent_id": "10-2020-0094263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "상기 고객,판매자 반응 데이터 분석부 (800)는, 고객 특징별 분석 모듈 (810) , 판매자 분석 모듈 (820) , 고객X 판매자 교차 분석 모듈 (830)을 포함한다. 고객의 특징(성별,연령) 에 따라 선택의 유형을 분석 하는 고객특징별 분석 모듈 (810) , 판매자별로 등록한 상품의 유형, 연결 정도를 분석 하는 판매자 분석 모듈 (820) ,고객과 판매자별로 반응 정도를 분석 하는 고객 X 판매자 교차 분석 모듈 (830) 을 포함한다."}
{"patent_id": "10-2020-0094263", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "서비스 이용자가 모바일, PC의 카메라를 이용해 촬영 또는 저장된 패션 상품을 업로드 하면 유사 이미지 검색을 통해 유사 상품의 검색 결과를 제공하고 쇼핑을 원할 경우 온라인 플랫폼으로 연결한다. 초기 플랫폼 활성화를 위해 패션 빅데이터를 수집해 제공한다. 판매를 원하는 누구든 자신의 상품 이미지를 업로드, 판매 경로 URL 입 (뒷면에 계속)"}
{"patent_id": "10-2020-0094263", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시 예는 고객이 상품 사진을 업로드 하면 가장 유사한 상품을 찾아 온라인 쇼핑몰로 연결해 주는 것과 판매자가 자신의 상품을 등록하고 인터넷 판매 주소를 저장하면 유사한 이미지일 경우 연결해 주는 이용자 와 판매자의 자발적 참여로 선순환 연결되는 온라인 플랫폼의 방법과 시스템에 관한 것이다."}
{"patent_id": "10-2020-0094263", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능의 발전으로 패션 상품의 이미지 만으로도 유사한 이미지를 판별하고 유사도 판단이 가능하며, 빅데이 터 수집과 데이터 처리 기술의 발전으로 다양한 패션 상품을 수집, 저장해 다양한 패션 상품중 유사한 이미지를찾아 제공하는 서비스가 가능하다. 소비자는 쇼핑시 검색어로 제품을 찾는 것 보다 이미지로 찾을 때 더 정확한 상품을 조회할 수 있다. 판매자 역 시 고객에게 더 나은 쇼핑 편의성 제공을 원하지만 이미지로 데이터를 비교해 연결하는 것은 시스템이 필요하다. 서비스 이용자가 판매자의 상품을 등록해 판매 홍보를 대행할 수도 있으며 언제든지 판매자로 자신의 상품을 등 록해 플랫폼안에 다른 서비스 이용자에게 상품을 제안할 수도 있다. 판매자로 자신의 등록 상품을 등록할 때 이미 인공지능 분류 기술로 패션 카테고리 분류 체계에 맞는 대-중-소 판단을 제공하지만 등록 시 승인 절차를 통해 오분류라고 판단 시 수정해 확정할 수 있다. 이런 경우에 인공 지 능의 재학습 DATA로 전이 학습으로 인공지능의 정확도를 높이는 방법이 된다. 플랫폼 서비스 이용자는 언제는 이용자에서 판매 참여자가 될 수 있고 상품 등록 과정중에 오분류를 점검해 플 랫폼에 장착된 인공지능의 정확도 향상을 위한 선순환 연결 고리가 가능하다. 시장과 고객 서비스를 위해 다양한 브랜드 위주의 데이터 연결로 초기 서비스를 제공하고 이용자와 판매자의 쉬 운 전환 환경을 통해 상호 규모의 상승 작용을 만들며 이 과정중에 플랫폼안의 인공지능 향상을 통해 서비스의 질을 높여간다."}
{"patent_id": "10-2020-0094263", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 서비스 이용자의 쇼핑몰 구매 편의성을 높이기 위해 검색어 대신 이미지를 사용하며 업로된 이미지는 유사도 판단을 통해 추천된 유사한 상품 리스트를 비교해 보면서 원하는 상품을 선택해 온라인 쇼핑몰에 연결될 수 있다. 그리고 판매자의 상품을 추천하기 위해 직접 사진과 온라인 판매 경로를 입력 추천을 진행할 수도 있 다. 이런 서비스 참여를 위해 판매자 누구나 제품 등록만으로도 유사 이미지 검색 상품군으로 등록할 수 있도 록 해서 제품 판매를 위한 유입 경로로 활용하게 한다. 등록의 절차를 최소화하고 번잡한 상품 등록의 과정을 인공지능 통해 판별한 결과 값을 우선 제공하고 등록 확정시 오분류라고 판단되면 수정해 확정하도록 한다. 이 런 연결 플랫폼을 통해 서비스 이용자와 판매자 간에 연결을 지원하는 플랫폼을 제공하며, 플랫폼의 인공 지능 진화를 위해 자발적 참여자의 오분류 확인의 개선 과정을 진화의 순환 고리로 시스템화 한다. 반응 데이터가 누 적되면 트랜드 제안, 또래 집단 선호 상품, 브랜드등의 맞춤 추천으로 개인화된 고객서비스를 지원한다."}
{"patent_id": "10-2020-0094263", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명에 따른 패션 빅데이터 정보 처리 방법, 패션 상품 기획과 상품 운영을 위한 방법과 시스템은 패션관련 온라인 판매 플랫폼과 SNS상을 통해 수집되는 문자,숫자,이미지 수집/저 장부 : 수집된 정보중 패션 이미지 데이터는 패션 분류 체계로 학습된 인공 지능 모델을 통한 인공지능 이미지 판별부 : 수집된 문자,숫자데이터에 패션 복종, 아이템, 구분자별 집계와 순위를 위한 문자,숫자 데이터 가공부 : 이미지와 문자 숫자의 원천 데이터와 가공 데이터 연결과 사용자별 필터 적용을 위한 구분자를 구성하는 분석 원천 데이터 저장/관리부 : 패션 이미지 사진을 조회해서 유사한 상품을 추천해 주고 온라인 쇼핑몰로 연결을 지원하는 서비스와 고객이 판매자의 상품을 추천 등록하는 고객 유사 상품 조회/결과, 추천상품 판매자 연결부 : 패션 이미지와 온라인 판매 URL을 직접 등록하고 관리하는 판매자 상품 등록/관리부 : 고객 조회 패션 이미 지와 유사한 상품을 제안한 경우 선택한 상품, 인터넷 쇼핑몰로 연결한 목록을 저장하는 고객, 판매자 반응 데 이터 저장부 : 고객별로 선호하는 브랜드, 또는 패션 유형을 분석, 연령, 성별, 지역별등의 고객군별로 상품 선 택의 유형을 분석하는 고객, 판매자 반응 데이터 분석부를 포함하는 것을 특징으로 한다. 또한, 상기 문자, 숫자, 이미지 수집/저장부는, 패션 상품별 상품명, 가격, 실제 가격, 판매수량, 재고 정보, 고객 반응 ( 댓글,리트윗,추천 ) 등의 정보를 관계형 데이터 베이스 구조의 테이블 형태의 문자,숫자 추출/저장 모듈 ; 패션 상품의 이미지는 테이블 형태의 데이터와 연결하기 위한 연결자 ( PRIMARY KEY ) 를 파일명으로 한 이미지 추출/저장 모듈 ; 을 포함할 수 있다. 또한, 상기 인공지능 이미지 판별부는, 이미지 판별을 위한 판별 목표값을 패션에 적합한 라벨값으로 분류한 목 표값을 분류 체계로 관리하기 위한 지도학습 라벨 관리 모듈 ; Faster RCNN 모델을 사용. 데이터의 선처리와 머 신러닝 학습을 위한 머신러닝 CNN 학습 모듈 ; 목표값의 정확도를 높이기 위한 오답된 이미지의 재 학습과 전이 학습 과정을 포함한 머신러닝 CNN 재학습 모듈; 을 포함할 수 있다. 또한, 상기 문자, 숫자 데이터 가공부는, 수집된 원천 정보를 분석을 위한 기본 단위로 처리하는 분류 체계별 가공 모듈 ; 수집은 브랜드 단위, 유명인(파워 블로그, 파워 유투버, 파워 SNS 유저) 단위로 구분 또는 동일 기준으로 묶어서 분류할 수 있는 수집 단위별 순위화 모듈 ; 을 포함할 수 있다. 또한, 상기 분석 원천 데이터 저장/관리부는 , 위 상기 이미지 판별부와 문자,숫자 데이터 가공부의 결과를 연 결자 ( PRIMARY KEY )로 통합하는 이미지,문자,숫자 연결 모듈 ; 연결된 데이터를 정기, 동일 관점으로 데이터 베이스 처리화 하는 분석 항목 관리 모듈 ; 사용자별로 타겟팅 하고자 하는 구분자와 아이템 정보에 접근하도록 하는 사용자 권한 모듈 ; 을 포함할 수 있다. 또한, 상기 고객 유사 상품 조회/결과, 추천상품 판매자 연결부는, 패션 이미지 사진을 조회해서 유사한 상품을 추천해 주고 온라인 쇼핑몰로 연결을 지원한다. 서비스 이용자가 직접 촬영한 사진 또는 저장된 사진을 업로드 하기 위한 사진 관리 모듈 ; 업로드한 사진은 사전 저장된 사진 중에 유사한 상품을 판단해 유사 상품 리스트를 전달하는 결과 조회 모듈 ; 이용자가 판매자의 상품을 직접 추천 하기 위해 제품 사진과 온라인 판매 경로를 입 력하는 추천상품 등록 판매자 연결 모듈 ; 을 포함할 수 있다. 또한, 상기 판매자 상품 등록/관리부는, 패션 이미지와 온라인 판매 URL을 직접 등록하고 관리한다. 판매자가 상품을 서비스 이용자에게 노출하기 위해 등록하는 사진 관리 모듈 ; 등록된 사진은 플랫폼내 인공지능을 통해 판별한 결과값을 제공하며 이를 보고 판매자가 확인, 확정하는 사진 확정 모듈 ; 판매자가 등록된 사진을 재 조 회 하고 관리할 수 있도록 하는 사진 등록 이력 저장 모듈 ; 을 포함할 수 있다. 또한, 상기 고객, 판매자 반응 데이터 저장부는, 고객 조회 패션 이미지와 유사한 상품을 제안한 경우 선택한 상품, 인터넷 쇼핑몰로 연결한 목록을 저장한다. 고객이 조회한 상품 사진을 관리하는 고객 조회 관리 모듈 ; 판매자가 등록한 상품 사진을 관리하는 판매자 등록 관리 모듈 ; 고객이 조회하고 온라인 쇼핑몰로 연결한 데이 터를 관리하는 판매자 연결 기록 관리 모듈 ; 을 포함할 수 있다. 또한, 상기 고객, 판매자 반응 데이터 분석부는, 고객별로 선호하는 브랜드, 또는 패션 유형을 분석, 연령, 성 별, 지역별등의 고객군별로 상품 선택의 유형을 분석한다. 고객의 성별, 연령별에 따라 구분 집계되어 분석, 관 리 되는 고객 특징별 분석 모듈 ; 판매자 연결도와 복종, 컨셉 특징에 따라 구분 집계되어 분석, 관리 되는 판 매자 분석 모듈 ; 고객과 판매자의 구매 연결 또는 추천 고객과 판매자를 교차로 분석해 구분 집계되어 분석, 관리 되는 고객 X 판매자 교차 분석 모듈 ; 을 포함할 수 있다."}
{"patent_id": "10-2020-0094263", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "패션 사업에 BIG.DATA와 인공지능을 적용해 온라인 쇼핑몰 플랫폼 비즈니스의 효율을 개선할 비즈니스 모델, 시 스템 도구라는 점에서 혁신, 선진, 창의성을 가진다. 서비스 이용자가 언제든 쉽게 판매자의 상품을 대신 홍보하기 위해 상품 등록을 진행할 수 있으며 , 판매자로 자신의 상품을 등록할 수도 있다. 상품 등록이 많아지면 더 많은 이용자를 만들며 이런 상호 작용은 더 큰 규모 의 참여자를 만들 수 있다. 판매자의 상품 등록 과정중 확정 절차를 통한 확인의 과정으로 인공지능 분류의 오류를 판매자가 확인하며 이 과정은 재학습을 통해 플랫폼 구성의 인공지능의 진전을 기대할 수 있다. 현재 인공지능의 가장 큰 난제가 결과 값의 결정과 데이터의 수집과 결과갑의 라벨링 부분으로 이 부분을 해결할 획기적 대안이 된다. 또한 서비스 이용자. 판매자의 규모 증가에 따라 누적될 반응 데이터는 트랜드 현황 파악, 트랜드 예측, 판매자 제안, 또래 집단 선호 상품 분석으로 고객 개별화 서비스가 된다."}
{"patent_id": "10-2020-0094263", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 실시 예를 상세히 설명한다. 우선 도면들 중 동일한 구성요소 들은 가 능한 동일한 참조 부호를 나타내고 있음에 유의해야 한다. 도 1은 본 발명의 실시 예에 따른 이용자와 판매자의 자발적 참여로 선순환 연결되는 온라인 플랫폼의 방법과 시스템 제공 장치의 구성도이다. 본 발명에 따른 이용자와 판매자의 자발적 참여로 선순환 연결되는 온라인 플랫폼의 방법과 시스템은 도1에 도 시된 바와 같이, 문자,숫자,이미지 수집/저장부 , 인공지능 이미지 판별부 , 문자,숫자 데이터 가공 부 , 분석 원천 데이터 저장/관리부 , 고객 서비스부 , 판매자 관리부, 고객,판매자 반응 데이터 저장부, 고객,판매자 반응 데이터 분석부 을 포함한다. 이런 서비스를 가시화하면 도 10, 선순환 연결 온라인 플랫폼의 방법과 시스템의 개념도와 같다. 도 2은 본 발명에 따른 문자, 숫자, 이미지 수집/저장부의 구성도이다. 본 발명에 따른 문자, 숫자, 이미지 수집/저장부는 도2에 도시된 바와 같이 , 문자,숫자 추출/저장 모듈 , 이미지 추출/저장 모듈을 포함한다. 상기 문자, 숫자, 이미지 수집/저장부는 빅데이터를 그 특징에 따라 이미지와 문자, 숫자로 구분해 수집, 저장 한다.도 3은 본 발명에 따른 인공지능 이미지 판별부의 구성도이다. 본 발명에 따른 인공지능 이미지 판별부는 도3에 도시된 바와 같이 지도학습 라벨 관리 모듈 , 머신러닝 이미지 인식 합성곱 신경망 ( CNN : Convolutional Neural Network ) 학습 모듈 , 머신러닝 CNN( Convolutional Neural Network ) 재학습 모듈 을 포함한다. 상기 지도학습 라벨 관리 모듈 은 인공지능 이미지 판별 학습을 위한 머신러닝의 지도학습에 라벨값(목표 값)으로 사용된다. 이미지를 입력 받았을 때 분류체계에 따라 판단하도록 지도학습이 되며 이 라벨값은 패션에 적합한 기준으로 정리한다. 라벨값은 카테고리 체계인 대-중-소 분류체계와 동일하며 그 체계는 도안 8 패션 카테고리 분류체계도와 같다."}
{"patent_id": "10-2020-0094263", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 머신러닝 CNN( Convolutional Neural Network ) 학습 모듈 은 인공 지능을 통한 판별 모델은 대 1 개, 중 4개, 소 13개로 각각 구분해 학습 한다. 이미지 한장을 판단하기 위해 대-중-소 단계로 이미지를 분류한 다. 대분류에서 outer 분류시 중분류 단계에서는 COAT,JACKET ,JUMPER,JUMPER_ PARKA,VEST중 한가지로 분류되며 만약 COAT로 분류되었다면 COAT안에 소 분류중 분류하게 된다. 결국 범주에 따라 판별을 좁혀 가면서 인공지능을 통한 이미지 정확도를 높이는 것이다. 상기 머신러닝 CNN 재학습 모듈 은 판단의 결과가 사람이 판단할 때 다른 경우에 오 분류된 이미지는 별도 로 다시 인공 지능의 전이 학습 자료로 다시 사용한다. 판매자 관리부 구성도의 사진 확정 모듈 을 통해 오분류 판단한 이미지는 머신러닝 CNN 재학습 모 듈 의 대학습 데이터로 활용된다. 도 4은 본 발명에 따른 문자, 숫자 데이터 가공부의 구성도이다. 본 발명에 따른 문자, 숫자 데이터 가공부는 도4에 도시된 바와 같이 분류 체계별 가공 모듈 , 수집 단 위별 순위화 모듈 을 포함한다. 상기 분류 체계별 가공 모듈 은 패션 카테고리 분류 체계 ( 대-중-소 )로 각 분류마다 스타일수, 판매수 량,재고 수량, 고객 반응 정보( 좋아요,댓글,리트윗) 등의 합계와 크기에 따른 순위를 사전 구성한다. 상기 수집 단위별 순위화 모듈 은 수집 데이터가 브랜드, 판매자, 컨셉별, 임의 그룹핑별로 스타일수, 판 매 수량, 재고 수량, 고객 반응 정보( 좋아요,댓글,리트윗) 등의 합계와 크기에 따른 순위를 사전 구성한다. 도 5은 본 발명에 따른 분석 원천 데이터 저장/관리부의 구성도이다. 본 발명에 따른 분석 원천 데이터 저장/관리부는 도5에 도시된 바와 같이 이미지, 문자, 숫자 연결 모듈 , 분석 항목 관리 모듈 , 사용자 권한 모듈 을 포함한다. 상기 이미지, 문자, 숫자 연결 모듈 은 데이터의 성질에 따라 이미지 판별부 과 문자,숫자,데이터 가 공부 을 통해 나온 결과를 연결자 ( PRIMARY KEY ) 로 연결하여 데이터를 통합한다. 상기 분석 항목 관리 모듈 은 이 서비스와 시스템 이용자에 맞도록 분석의 단위를 결정하는 것이다. 이용 자의 요구에 특정 상품의 아이템만 분류할 경우 또는 특정 브랜드, 특정 복종만을 대상으로 핵심 경쟁 범위로 분석하도록 구성한다. 상기 사용자 권한 모듈 은 제공할 서비스의 종류중 이용자가 사용하고자 하는 항목만 서비스 항목으로 제 공되어 지도록 구성하는 것이다. 상기 분석 항목 관리 모듈 을 사용자별로 관리한다. 이때 권한과 권한의 기간을 같이 관리하도록 구성한다. 도 6은 본 발명에 따른 고객 유사 상품 조회/결과 추천상품 판매자 연결부이다. 본 발명에 따른 고객 서비스부는 도6에 도시된 바와 같이 사진 관리 모듈 , 결과 조회 모듈 , 추 천상품 등록 판매자 연결 모듈 을 포함한다. 이런 서비스는 도11. 이용자_고객 유사 상품 조회/추천 서비스부의 가시화 예시도와 같다. 상기 사진 관리 모듈 은. 이용 고객이 유사 이미지를 찾기 위해 등록한 사진을 모바일, PC를 통해 업로드 하면 해당 이미지는 이미지 인식 합성곱 신경망 ( CNN : Convolutional Neural Network ) 통해 최종 label 판별 전 인공지능 레이어(layer)의 출력 결과를 임베딩 (embedding) 벡터(vector) 값으로 변환 하는 모듈을 포 함한다. 상기 결과 조회 모듈 은, 빅데이터를 통해 수집된 상품 이미지는 합성곱 신경망을 통해 임베딩 (embedding) 벡터(vector) 값으로 변환된 값과 비교 된다. 이때 최근접 이웃 탐색 ( Nearest neighbor search ) 기법을 통해 입력 받은 고객 이미지와 가장 유사한 결과를 찾아 이용 고객에게 결과 값을 제공하는 결과 조회 모듈을 포함한다. 상기 추천상품 등록 판매자 연결 모듈 은, 이용자가 판매자의 상품을 이미지와 온라인 판매 경로를 직접 입력해 판매자 대신 광고하는 고객 추천의 기능을 지원한다. 이용자가 판매자의 홍보를 위해 누구나 참여할 수 있으며 이용자와 판매자 간의 상호 연결 모듈을 포함한다. 도 7은 본 발명에 판매자 상품 등록/관리부의 구성도이다. 본 발명에 따른 패션 판매자 관리부는 도7에 도시된 바와 같이 사진 관리 모듈 , 사진 확정 모듈 , 사진 등록 이력 저장 모듈 을 포함한다. 서비스 이용자가 언제든 판매자가 될 수 있다. 상호 전환의 선순 환이 있는 경우 빠르게 플랫폼 사용자가 확대될 수 있다. 서비스 이용자와 판매자가 상호 순환 되어 규모의 성 장을 유도하면 상품은 다양화 되어 제공되며 이용자는 많아지고 이런 성장은 플랫폼 자체의 인공지능 진화의 동 력으로 서로 선순환 된다. 인공지능의 지도 학습은 타겟값 (라벨 )이 정확도 이미지가 필요하다. 이에 대한 학습 데이터가 참여자를 통해 직접 수집되고 조정되기에 머신러닝 학습을 위한 사전 데이터 처리의 과정을 단축할 수 있으며 규모가 증가할수 록 인공지능 정확도를 향상의 기회를 만든다. 이런 서비스는 도12. 판매자 상품 등록/관리부의 가시화 예시도와 같다."}
{"patent_id": "10-2020-0094263", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 사진 관리 모듈 은, 판매를 목적으로 상품을 등록 하기 위해 이미지 업로드, 상품의 패션 카테고리 값 확정과 인터넷 상품 판매의 URL을 입력하는 과정을 판매자가 직접 진행하는 사진 관리 모듈로 구성된다. 상기 사진 확정 모듈 은, 등록 사진은 판매자 등록 편의성을 위해 제품의 패션 카테고리 (대-증-소) 분류 는 사전 정의된 패션 카테고리로 머신러닝으로 학습된 인공지능을 통해 결과값을 주고 해당 카테고리 안에서 수 정하도록 한다. 본 발명에 따른 도13. 패션 카테고리 분류 체계도에 따라 분류한다. 결과가 오분류라고 생각되 는 경우에 직접 적합한 패션 카테고리로 변경 후 확정하는 사진 확정 모듈을 포함한다. 상기 사진 등록 이력 저장 모듈 은 판매자가 등록한 패션 상품의 사진과 등록 정보의 이력을 관리하는 사 진 등록 이력 저장 모듈로 구성한다. 도 8은 본 발명에 따른 고객, 판매자 반응 데이터 저장부의 구성도이다. 본 발명에 따른 고객, 판매자 반응 데이터 저장부는 도8에 도시된 바와 같이 고객 조회 관리 모듈 , 판매 자 등록 관리 모듈 , 판매자 연결 기록 관리 모듈 을 포함한다. 상기 고객 조회 관리 모듈 은, 고객의 특징 (성별, 연령)을 포함해 연결 이력을 관리하는 고객 조회 관리 모듈을 포함한다. 상기 판매자 등록 관리 모듈 은, 판매를 목적으로 상품 등록에 참여한 판매자를 패션 복종, 컨셉, 참여도 에 따라 관리하는 판매자 등록 관리 모듈을 포함한다. 상기 판매자 연결 기록 관리 모듈 은 고객의 유사 이미지 조회 후 인터넷 쇼핑몰로 연결한 이력을 관리 하 는 판매자 연결 기록 관리 모듈로 구성한다. 도 9은 본 발명에 따른 고객, 판매자 반응 데이터 분석부의 구성도이다. 본 발명에 따른 고객, 판매자 반응 데이터 분석부는 도8에 도시된 바와 같이 고객 특징별 분석 모듈 , 판 매자 분석 모듈 , 고객 X 판매자 교차 분석 모듈 을 포함하다. 고객의 성별, 연령대의 데이터와 브랜드, 컨셉에 따른 선호도 분석은 트랜드 현황 확인과 트랜드 예측, 또래 집 단 선호 상품 추천, 적합한 판매자 연결 서비스를 위한 분석 결과를 제공한다. 상기 고객 특징별 분석 모듈 은, 고객의 특징(성별, 연령) 에 따라 선택의 유형을 분석 하는 고객 특징별 분석 모듈을 포함한다. 상기 판매자 분석 모듈 은, 판매자별로 등록한 상품의 유형, 패션 복종, 컨셉, 이용자 연결 정도를 분석 하는 판매자 분석 모듈을 포함 한다. 상기 고객 X 판매자 교차 분석 모듈 은 고객과 판매자별로 반응 정도를 분석하는 고객 X 판매자 교차 분석 모듈로 구성한다."}
{"patent_id": "10-2020-0094263", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 이용자와 판매자의 자발적 참여로 선순환 연결되는 온라인 플랫폼의 방법과 시스템에 대 한 구성도이다. 도 2은 본 발명에 따른 문자,숫자,이미지 수집/저장부의 구성도이다. 도 3은 본 발명에 따른 인공지능 이미지 판별부의 구성도이다. 도 4은 본 발명에 따른 문자,숫자 데이터 가공부의 구성도 이다. 도 5은 본 발명에 따른 분석 원천 데이터 저장/관리부의 구성도이다. 도 6은 본 발명에 따른 고객 유사 상품 조회/결과, 추천상품 판매자 연결부의 구성도이다. 도 7은 본 발명에 판매자 상품 등록/관리부의 구성도이다. 도면 8은 본 발명에 따른 고객,판매자 반응 데이터 저장부이다. 도면 9 본 발명에 따른 고객, 판매자 반응 데이터 분석부이다. 도면 10 본 발명에 따른 선순환 연결 온라인 플랫폼의 방법과 시스템의 개념도이다. 도면 11 본 발명에 따른 이용자_고객 유사 상품 조회 / 추천 서비스부의 가시화 예시도이다. 도면 12 본 발명에 따른 판매자 상품 등록 / 관리부의 가시화 예시도 이다. 도면 13 본 발명에 따른 따른 패션 카테고리 분류 체계도이다."}
