{"patent_id": "10-2019-0099854", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0099950", "출원번호": "10-2019-0099854", "발명의 명칭": "인공 지능 통합 관제 서비스 제공 방법 및 시스템", "출원인": "주식회사 뉴라이크", "발명자": "이성안"}}
{"patent_id": "10-2019-0099854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량 내 장착되는 차량 관제 장치에서의 통합 관제 서비스 제공 방법에 있어서,차량 시동이 OFF되고, 도어가 잠금 설정되어 보안 모드로 진입하면, 차량 내 잔류 인원이 있는지 감지하는단계;상기 감지 결과, 잔류 인원이 존재하면, 차량 내부 온도 및 이산화탄소 농도를 측정하는 단계;상기 측정된 온도가 소정 기준 범위를 벗어나면 차량 시동을 ON시킨 후 상기 차량에 구비된 공조기를 구동하여상기 차량 내부 온도가 상기 기준 범위를 유지하도록 제어하는 단계;상기 측정된 이산화 탄소 농도가 소정 기준치를 초과하면, 외부 공기가 유입되도록 상기 공조기를 제어하는 단계; 및미리 지정된 단말로 차량 내 잔류 인원이 존재함을 지시하는 소정 경고 메시지를 전송하는 단계를 포함하는, 통합 관제 서비스 제공 방법."}
{"patent_id": "10-2019-0099854", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "차량 내 장착되는 차량 관제 장치에서의 통합 관제 서비스 제공 방법은 차량 시동이 OFF되고, 도어가 잠금 설정 되어 보안 모드로 진입하면, 차량 내 잔류 인원이 있는지 감지하는 단계와 상기 감지 결과, 잔류 인원이 존재하 면, 차량 내부 온도 및 이산화탄소 농도를 측정하는 단계와 상기 측정된 온도가 소정 기준 범위를 벗어나면 차량 시동을 ON시킨 후 상기 차량에 구비된 공조기를 구동하여 상기 차량 내부 온도가 상기 기준 범위를 유지하도록 제어하는 단계와 상기 측정된 이산화 탄소 농도가 소정 기준치를 초과하면, 외부 공기가 유입되도록 상기 공조기 를 제어하는 단계와 미리 지정된 단말로 차량 내 잔류 인원이 존재함을 지시하는 소정 경고 메시지를 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2019-0099854", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 안전 취약 계층을 위안 지능형 관제 서비스 제공 시스템에 관한 것으로서, 상세하게, 긴급 상황 감지 시 관제 대상의 현재 위치 및 상태에 따라 지능적으로 최적의 안전한 구조 서비스를 제공하는 것이 가능한 인공 지능 통합 관제 서비스 제공 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2019-0099854", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 유치원 및 학원 통학 버스에 어린이가 갇혀 더위나 이산화탄소 부족으로 질식하여 사망하는 사례가 빈번히 발생되고 있다. 한편, 대한민국 특허공개공보 제10-2000-0040373호(2000.07.05.)에는 차량 내 좌석에 압력센서를 설치하여 검출 사항에 따라 차량 내 승객이 있는지 여부를 판별하고 승객이 있는 경우에 고온이 되면 경보를 발생하는 방법에 의하고 있으나, 좌석에 압력센서를 이용하는 방법의 경우, 통학차량의 아동 좌석에 모두 설치 및 운영을 해야 하므로 차량 배터리 방전 및 설치비 등의 문제가 야기될 수 있다. 대한민국 공개특허번호 10-2018-0058915(2018년 06월04일)에는 차량 내 아동 유기 여부를 검출하고, 검출 결과 에 따라 주변 경보 수단을 출력하고, 미리 설정된 비상연락망으로 위급 신호를 송신하는 어린이 통학차량 안전 장치 및 어린이 통학차량 안전시스템이 개시된 바 있다. 하지만, 유기된 아동의 생사가 촌각을 다투는 상황에서 주변에 경고 알람만을 출력하거나 보호자 등에 경고 메시지를 전송하는 것은 근본적이 해결책이 될 수 없는 단 점이 있었다. 또한, 이산화탄소 농도 증가 시 별도 구비된 산소 공급기를 구비하여 차량 내 산소를 공급하는 것 은 현실적으로 비용 부담이 큰 단점이 있었다."}
{"patent_id": "10-2019-0099854", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 종래 기술의 문제점을 해결하기 위해 고안된 것으로, 본 발명의 목적은 인공 지능 통합 관제 서비스 제공 방법 및 시스템을 제공하는 것이다. 본 발명은 블루존과 레드존을 지정하여 안전 예방 차원의 통합 관제 서비스를 제공할 수 있는 인공 지능 통합 관제 서비스 제공 방법 및 시스템을 제공하는 것이다. 또한, 본 발명은 관제 대상 단말의 현재 위치 뿐만 아니라 관제 대상 단말에 의해 수집된 생체 정보에 기반하여 위급 상황을 식별할 수 있으며, 그에 따른 신속한 사고 대응이 가능한 인공 지능 통합 관제 서비스 제공 방법 및 시스템을 제공하는 것이다. 본 발명의 다른 목적은 길 안내 드론을 연동하여 안전 취약 계층에 안전 귀가 서비스를 제공하는 것이 가능한 인공 지능 통합 관제 서비스 제공 방법 및 시스템을 제공하는 것이다. 본 발명의 또 다른 목적은 차량 ECU와의 연동을 통해 차량 내 유기된 인원을 안전하게 구조하는 것이 가능한 인 공 지능 통합 관제 서비스 제공 방법 및 시스템을 제공하는 것이다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확 하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0099854", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 인공 지능 통합 관제 서비스 제공 방법 및 시스템을 제공할 수 있다. 본 발명의 일 실시 예에 따른 안전 취약 계층을 위한 통합 관제 서비스 제공 시스템은 GPS(Global Positioning System) 신호를 수신하여 현재 위치를 측위하는 보호 단말과 상기 보호 단말에 대한 블루존 및 집 주소가 포함 된 보호자 정보를 설정하기 위한 웹 화면을 제공하는 통합 웹 안전 서버와 특정 지역에 할당된 적어도 하나의 길 안내 드론을 제어하고, 긴급 구조 요청 수신 시 해당 보호 단말을 위한 최적의 길 안내 드론을 선택하고 해 당 보호 단말의 현재 위치로 상기 선택된 길 안내 드론을 이동시키는 적어도 하나의 로컬 보호 센터 서버와 상 기 보호 단말의 현재 위치가 상기 블루존을 이탈하였는지 여부를 판단하고, 상기 블루존 이탈 시 상기 현재 위 치에 상응하는 상기 로컬 보호 센터 서버를 식별하고, 식별된 상기 로컬 보호 센터 서버로 상기 보호 단말의 상 기 현재 위치 및 상기 보호자 정보가 포함된 상기 긴급 구조 요청 신호를 전송하는 지능형 통합 관제 서버를 포 함하고, 상기 선택된 길 안내 드론은 상기 보호 단말의 현재 위치와 상기 집 주소까지의 제1 최적 이동 경로를 산출하여 상기 보호 단말을 길 안내 하되, 상기 제1 최적 이동 경로의 이동 거리가 기준치를 초과하면, 상기 보 호 단말의 현재 위치에서 가장 근접한 보호소까지의 제2 최적 이동 경로를 산출하고, 상기 제2 최적 이동 경로 에 따라 상기 보호 단말을 길 안내 할 수 있다. 여기서, 상기 로컬 보호 센터 서버는 상기 보호 단말의 현재 위치; 상기 보호 단말의 현재 위치에 대응하여 산 출된 상기 최적 이동 경로; 및 상기 길 안내 드론의 성능, 배터리 충전 상태 및 현재 임부 수행 여부; 중 적어 도 하나에 기반하여 상기 보호 단말을 위한 최적의 길 안내 드론을 선택하되, 상기 성능은 최고 비행 속도, 최 대 비행 시간, 최대 통신 반경 중 적어도 하나를 포함할 수 있다. 또한, 상기 보호 단말은 구비된 생체 센서를 이용하여 생체 정보를 생성하고, 상기 생체 정보를 근거리 무선 통 신을 통해 상기 길 안내 드론으로 전송하는 웨어러블 디바이스를 포함하고, 상기 길 안내 드론은 상기 보호 단 말로부터 수신된 상기 생체 정보에 기반하여 상기 보호 단말 사용자의 건강 상태를 판단하는 건강 상태 판단부 와 상기 건강 상태가 위급 상태이면, 소정 구조 요청 메시지를 출력하는 출력부와 주변 밝기 및(또는) 일몰 시 간에 따라 자동으로 조명을 켜지게 제어하는 조명 제어부와 상기 제1 최적 이동 경로 또는 상기 제2 최적 이동 경로에 따라 상기 보호 단말과 일정 거리를 유지하며, 일정 고도로의 자율 비행을 제어하는 비행 제어 모듈과 상기 제1 최적 이동 경로 또는 상기 제2 최적 이동 경로에 따른 상기 보호 단말의 진행 방향을 표시하는 방향 표시부를 포함할 수 있다. 또한, 상기 보호자 정보는 보호자 단말의 전화 번호를 더 포함하고, 상기 제2 최적 이동 경로가 산출되면, 상기 길 안내 드론이 구비된 무선 통신부를 통해 상기 보호소에 상응하는 주소 정보를 상기 보호자 단말로 전송할 수 있다. 본 발명의 다른 실시 예에 따른 차량 내 장착되는 차량 관제 장치에서의 통합 관제 서비스 제공 방법은 차량 시 동이 OFF되고, 도어가 잠금 설정되어 보안 모드로 진입하면, 차량 내 잔류 인원이 있는지 감지하는 단계와 상기 감지 결과, 잔류 인원이 존재하면, 차량 내부 온도 및 이산화탄소 농도를 측정하는 단계와 상기 측정된 온도가 소정 기준 범위를 벗어나면 차량 시동을 ON시킨 후 상기 차량에 구비된 공조기를 구동하여 상기 차량 내부 온도 가 상기 기준 범위를 유지하도록 제어하는 단계와 상기 측정된 이산화 탄소 농도가 소정 기준치를 초과하면, 외 부 공기가 유입되도록 상기 공조기를 제어하는 단계와 미리 지정된 단말로 차량 내 잔류 인원이 존재함을 지시 하는 소정 경고 메시지를 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2019-0099854", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "상기 본 발명의 양태들은 본 발명의 바람직한 실시예들 중 일부에 불과하며, 본원 발명의 기술적 특징들이 반영 된 다양한 실시예들이 당해 기술분야의 통상적인 지식을 가진 자에 의해 이하 상술할 본 발명의 상세한 설명을 기반으로 도출되고 이해될 수 있다."}
{"patent_id": "10-2019-0099854", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 방법, 장치 및 시스템에 대한 효과에 대해 설명하면 다음과 같다. 본 발명은 인공 지능 통합 관제 서비스 제공 방법 및 시스템을 제공하는 장점이 있다. 또한, 본 발명은 블루존과 레드존을 지정하여 안전 예방 차원의 통합 관제 서비스를 제공할 수 있는 장점이 있 다. 또한, 본 발명은 관제 대상 단말의 현재 위치뿐만 아니라 관제 대상 단말에 의해 수집된 생체 정보에 기반하여 위급 상황을 식별할 수 있으며, 그에 따른 신속한 사고 대응이 가능한 장점이 있다. 또한, 본 발명은 길 안내 드론을 이용하여 안전 취약 계층에 안전 귀가 서비스를 제공하는 것이 가능한 인공 지 능 통합 관제 서비스 제공 방법 및 시스템을 제공하는 장점이 있다. 또한 본 발명은 차량 ECU와의 연동을 통해 차량 내 유기된 인원을 안전하게 구조하는 것이 가능한 인공 지능 통 합 관제 서비스 제공 방법 및 시스템을 제공하는 장점이 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2019-0099854", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0099854", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예들이 적용되는 장치 및 다양한 방법들에 대하여 도면을 참조하여 보다 상세하게 설명한 다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여 되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 실시예의 설명에 있어서, 각 구성 요소의 \" 상(위) 또는 하(아래)\"에 형성되는 것으로 기재되는 경우에 있어, 상(위) 또는 하(아래)는 두개의 구성 요소들이 서로 직접 접촉되거나 하나 이상의 또 다른 구성 요소가 두 개의구성 요소들 사이에 배치되어 형성되는 것을 모두 포함한다. 또한 “상(위) 또는 하(아래)”으로 표현되는 경우 하나의 구성 요소를 기준으로 위쪽 방향뿐만 아니라 아래쪽 방향의 의미도 포함할 수 있다. 도 1a는 본 발명의 실시 예에 따른 통합 관제 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1a를 참조하면, 통합 관제 서비스 제공 시스템은 웨어러블 디바이스, 차량 관제 장치, 보호자 단말 , 운전자 단말 및 지능형 통합 관제 서버를 포함하여 구성될 수 있다. 웨어러블 디바이스, 차량 관제 장치, 보호자 단말 및 운전자 단말은 무선망(미도시)을 통해 지능형 통합 관제 서버와 연동될 수 있다. 여기서, 무선망은 이동 통신망, 무선 인터넷망, 차량 텔레매틱스 통신망 등을 포함할 수 있으나, 이에 한정되지는 않는다. 본 실시 예에 따른 보호자는 자신의 스마트폰 또는 테스트탑 PC 또는 노트북 등을 통해 지능형 통합 관제 서버 가 제공하는 웹 화면에 접속할 수 있다. 보호자는 웹 화면상에서 자녀의 웨어러블 디바이스를 통합 관제 서비스에 등록할 수 있다. 또한, 보호자 단말은 지능형 통합 관제 서버와 연동하여 다양한 통합 관제 서비스를 제공받기 위한 통합 관제 서비스 앱-이하, 설명의 편의를 위해 간단히, 앱이라 명함-을 다운로드 받아 설치할 수 있다. 보호자는 등록한 웨어러블 디바이스에 상응하는 블루존을 앱을 통해 설정할 수 있다. 여기서, 블루존은 웨 어러블 디바이스를 소지한 자녀의 이동이 허용된 지리적인 안전 지역으로 정의될 수 있다. 통합 관제 서비스에 등록된 웨어러블 디바이스는 구비된 GPS 수신기를 통해 자신의 현재 위치를 실시간 측위 할 수 있다. 이때, 측위된 현재 위치 정보는 무선망을 통해 주기적으로 지능형 통합 관제 서버로 전송될 수 있다. 일 예로, 지능형 통합 관제 서버는 웨어러블 디바이스의 현재 위치가 기 설정된 블루존을 벗어났음을 감 지하면, 해당 웨어러블 디바이스가 블루존을 벗어났음을 지시하는 소정 경고 알람 메시지를 보호자 단말 에 전송할 수 있다. 다른 일 예로, 지능형 통합 관제 서버는 웨어러블 디바이스의 현재 위치에 기반하여 해당 웨어러블 디바 이스가 레드존-즉, 청소년 유해 지역-에 접근하고 있음을 감지하면, 해당 웨어러블 디바이스가 청소년 유 해 지역에 접근하고 있음을 지시하는 소정 경고 알람 메시지를 보호자 단말에 전송할 수도 있다. 여기서, 보 호자는 앱을 통해 해당 웨어러블 디바이스에 상응하는 레드존은 설정할 수도 있다. 또한, 웨어러블 디바이스 및(또는) 보호자 단말은 지능형 통합 관제 서버와 연동되는 소정 앱을 통해 웨어러블 디바이스의 이동 목적지를 설정할 수도 있다. 이 경우, 웨어러블 디바이스가 설정된 목적지에 도착하였음이 확인되면, 지능형 통합 관제 서버는 보호자 단말로 도착 알림 메시지를 전송할 수도 있다. 지능형 통합 관제 서버는 앱을 통해 웨어러블 디바이스의 현재 위치가 지도상에 매핑된 화면을 생성하여 보호자 단말에 제공할 수 있다. 따라서, 보호자는 자녀의 현재 위치를 실시간 모니터링할 수 있다. 여기서, 지도에는 설정된 블루존과 레드존이 표시될 수 있으나, 이에 한정되지는 않으며, 저수지, 강, 공사 현장, 산 등 과 같은 위험 지역도 함께 표시될 수 있다. 또한, 보호자는 앱을 통해 해당 웨어러블 디바이스의 통상적인 이동 경로를 설정할 수도 있다. 일 예로, 특정 시간대 이후에 통상적인 이동 경로를 벗어난 경우, 지능형 통합 관제 서버는 웨어러블 디바이 스의 현재 위치 정보가 포함된 통상 경로 이탈 안내 메시지를 생성하여 보호자 단말에 전송할 수 있다. 만약, 웨어러블 디바이스 사용자가 미성년자가 아닌 성인 여성인 경우, 해당 여성의 웨어러블 디바이스에 탑재된 앱에는 소정 설정 메뉴가 구비될 수 있다. 일 예로, 설정 메뉴는 위치 정보 전송을 활성화하거나 비활성화하기 위한 메뉴, 위험 또는 긴급 상황 발생 시 긴급 안내 메시지를 수신할 수신자를 지정 및 변경하기 위한 메뉴, 지정된 수신자에 전송될 긴급 안내 문자를 지정하기 위한 메뉴, 긴급 안내 문자 전송 시간대를 설정하기 위한 메뉴 등을 포함할 수 있으나, 이에 한정되지 는 않는다. 웨어러블 디바이스는 구비된 생체 센서를 이용하여 생체 정보를 수집하고, 수집된 생체 정보를 지능형 통합 관제 서버에 전송할 수도 있다. 일 예로, 생체 정보는 맥박 정보, 혈류 정보, 체온 정보, 혈당 정보, 움직임 정보 등을 포함할 수 있으나, 이에 한정되지는 않는다. 일 예로, 웨어러블 디바이스는 측정한 체온이 기준치를 초과하는 경우, 측정된 체온 정보가 포함된 소정 경 고 메시지를 지능형 통합 관제 서버로 전송할 수 있다. 다른 일 예로, 웨어러블 디바이스는 측정한 맥박이 기준치 이하로 떨어진 경우, 측정된 맥박 정보가 포함 된 소정 경고 메시지를 지능형 통합 관제 서버로 전송할 수 있다. 또 다른 일 예로, 웨어러블 디바이스는 일정 시간 동안 움직임이 감지되지 않는 경우, 움직임이 감지되지 않 음을 지시하는 소정 경고 메시지를 지능형 통합 관제 서버로 전송할 수도 있다. 지능형 통합 관제 서버는 웨어러블 디바이스로부터 수신된 생체 정보에 기반하여 위급 상황을 감지하면, 119 등으로 긴급 구조를 요청할 수도 있다. 웨어러블 디바이스는 심박수 체크 기능 및 운동량 체크 기능-예를 들면, 도보 이동 거리 측정 기능, 달린 거 리 측정 기능, 만보기 기능, 소비 칼로리 산출 기능 등을 포함함-이 탑재되어 사용자의 건강을 유지시킬 수 있 다. 상기한 바와 같이, 본 발명에 따른 지능형 통합 관제 시스템은 블루존과 레드존을 지정하여 안전 예방 차원의 통합 관제 서비스를 제공할 수 있는 장점이 있다. 또한, 본 발명에 따른 지능형 통합 관제 시스템은 관제 대상인 웨어러블 디바이스의 위치 정보 외에도 웨어 러블 디바이스에 의해 수집된 보호 대상자의 생체 정보를 기반으로 위급 상황을 식별할 수 있으며, 그에 따 른 신속한 사고 대응이 가능한 장점이 있다. 차량 관제 장치는 차량 단말(2-1), 무선 통신 안테나(2-2), 모션 인식 센서(2-3), 비상벨(2-4) 및 GPS 안테 나(2-5)를 포함하여 구성될 수 있다. 차량 단말(2-1)은 무선 통신 안테나(2-2)를 통해 무선망(미도시)에 접속하여 지능형 통합 관제 서버와 통신 을 수행할 수 있다. 차량 단말(2-1)은 GPS 안테나(2-5)를 통해 수신된 신호에 기반하여 차량의 현재 위치를 측정할 수 있다. 차량 단말(2-1)은 차량 시동이 OFF되면, 모션 인식 센서가 구동되도록 제어할 수 있다. 모션 인식 센서는 차량 내 사람의 움직임이 감지되면, 소정 모션 감지 신호를 차량 단말(2-1)로 전송할 수 있다. 차량 단말(2-1)은 모션 감지 신호가 수신되면, 차량에 구비된 스피커(미도시)를 통해 소정 경고음이 출력되도록 제어할 수 있다. 또한, 차량 단말(2-1)은 모션 감지 신호가 수신되면, 차량 식별 정보 및 해당 차량의 현재 위치 정보가 포함된 긴급 구조 요청 신호를 지능형 통합 관제 서버로 전송할 수 있다. 지능형 통합 관제 서버는 해당 차량 내 사람이 존재함을 지시하는 소정 경고 안내 메시지를 차량 식별 정보 에 대응하여 미리 등록된 운전자 단말 및(또는) 인솔 교사 단말(미도시)로 전송할 수 있다. 차량 단말(2-1)은 시동 OFF 및 도어 잠금이 설정된 후, 비상벨(2-4)이 눌리면, 차량 식별 정보 및 해당 차량의 현재 위치 정보가 포함된 긴급 구조 요청 신호를 지능형 통합 관제 서버로 전송할 수 있다. 지능형 통합 관제 서버는 해당 차량 내 구비된 비상벨을 통해 구조가 요청되었음을 지시하는 소정 경고 안내 메시지를 차량 식별 정보에 대응하여 미리 등록된 운전자 단말 및(또는) 인솔 교사 단말(미도시)로 전송할 수 있다. 본 발명의 실시 예에 따른 차량 단말(2-1)은 시동 OFF 및 도어 잠금이 설정된 후 모션 감지 신호가 수신되거나 비상벨(2-4)이 눌리면, 일정 시간 경과 후-예를 들면, 10분 후- 차량 도어가 자동 열리도록 제어할 수도 있다. 또한, 차량 단말(2-1)은 차량 주행 중 현재 위치 및 주행 속도를 측정하고, 현재 위치 정보 및 주행 속도 정보 를 지능형 통합 관제 서버로 전송할 수 있다.지능형 통합 관제 시스템은 차량의 현재 위치가 표시된 지도를 보호자 단말 및(또는) 웨어러블 디바이스 로 전송할 수 있다. 이를 통해, 학생은 차량의 현재 위치 확인 후 탑승지로 이동할 수 있으므로 통학 대기 시간을 절약할 수 있다. 또한, 차량 주행 속도가 실시간 보호자 단말로 보고되므로, 차량 과속을 방지할 수 있다. 도 1b는 본 발명의 일 실시 예에 따른 안전 취약 계층을 위한 통합 관제 서비스 제공 시스템을 설명하기 위한 도면이다. 이하, 설명의 편의를 위해 안전 취약 계층을 위한 통합 관제 서비스 제공 시스템을 간단히 ‘시스템’이라 명하 기로 한다. 도 1b를 참조하면, 시스템은 보호 단말, 통합 안전 웹 서버, 지능형 통합 관제 서버, 로컬 보 호 센터 서버, 길 안내 드론, 보호자 단말, 무선망, 인터넷망 및 GPS(Global Positioning System) 위성을 포함하여 구성될 수 있다. 본 실시 예에 따른 로컬 보호 센터 서버는 특정 지역 단위로 구비되어 운영될 수 있다. 일 예로, 로컬 보호 센 터 서버는 소정 행정 구역 단위-예를 들면, 동 단위일 수 있음-로 구비되어 운영될 수 있으나, 이는 하나의 실 시 예에 불과하며, 시스템 내 구비되는 로컬 보호 센터 서버의 개수 및 배치 방법은 당업자의 설계에 따라 상이할 수 있다. 각각의 로컬 보호 센터 서버는 자신의 관리 영역 내에서 자율 비행하는 적어도 하나의 길 안내 드론을 구비할 수 있다. 로컬 보호 센터 서버는 보호 대상자의 현재 위치 및 현재 건강 상태 등에 기초하여 복수의 길 안내 드론 중 해당 보호 대상자의 길 안내를 위해 사용할 드론을 동적으로 결정할 수 잇다. 일 예로, 로컬 보호 센터 서버는 보호 단말의 현재 위치뿐만 아니라 구비된 길 안내 드론의 성능, 배터리 충전 상태, 현재 임무 수행 여부 등을 고려하여 해당 보호 단말에 상응하여 할당할 길 안내 드론 을 지능적으로 선택할 수 있다. 여기서, 길 안내 드론의 성능을 결정하는 파라메터는 최대 비행 속도, 최대 비행 시간, 최대 통신 반경 등을 포함할 수 있으나, 이에 한정되지는 않는다. 실시 예에 따른 로컬 보호 센터 서버는 배터리 충전 상태가 보호 단말의 현재 위치로 이동하여 보호 단 말의 집 또는 보호소까지 비행하기에 충분한 길 안내 드론을 식별할 수 있다. 또한, 로컬 보호 센터 서버는 보호 단말 사용자의 건강 상태가 위급 상태인 경우, 배터리가 충분한 드론 중 비행 속도가 가장 빠른 드론을 해당 보호 단말로 급파할 드론으로 최종 선택할 수 있다. 보호 단말은 보호 대상자-예를 들면, 아동, 치매 노인, 장애인 등을 포함한 안전 취약 계층일 수 있음-에 의해 소지된 스마트폰 및(또는) 웨어러블 디바이스를 의미할 수 있다. 웨어러블 디바이스는 근거리 무선 통신-예를 들면, 블루투스 통신-을 통해 보호 대상자가 소지한 스마트폰과 연 동될 수도 있다. 일 실시 예에 따른 웨어러블 디바이스는 손목 시계 타입, 신발 타입, 목걸이 타입, 손목 밴드 타입, 귀걸이 타 입, 밸트 타입 등을 포함할 수 있으나, 이에 한정되지는 않으며, 보호 대상자 신체의 특정 부위에 착용 가능한 디바이스로 무선망에 접속 가능한 디바이스면 충분하다. 실시 예에 따른 웨어러블 디바이스는 보호 대상자의 체온, 심박수, 혈당, 온도, 움직임 등의 현재 건강 상태를 측정할 수 있는 다양한 생체 센서가 더 구비될 수도 있다. 보호 단말은 길 안내 드론과 근거리 무선 통신이 연결되어 각종 정보를 교환할 수도 있다. 보호 단말은 무선망 및 인터넷망 중 적어도 하나를 통해 통합 안전 웹 서버, 지능형 통합 관제 서버, 로컬 보호 센터 서버 및 보호자 단말과 통신을 수행할 수 있다. 또한, 보호 단말은 GPS 수신 안테나가 구비되어 GPS 위성의 신호를 수신하고, 수신된 신호에 기반하여 현재 위치를 측정할 수 있다. 보호 단말은 일정 주기로 자신의 현재 위치 정보를 생성하여 지능형 통합 관제 서버로 전송할 수 있다. 보호 단말 또는 보호자 단말은 통합 안전 웹 서버에 접속하여 해당 보호 단말을 위한 보호자 정보를 설정할 수도 있다. 여기서, 보호자 정보는 집 주소 정보, 보호자 단말의 전화 번호 정보, 블루 존 정보, 보호 단말 사용자의 건강 상태 정보-예를 들면, 질병 및 장애 여부에 관한 정보를 포함할 수 있음-, 외모적 특징에 관한 정보 등의 보호 대상자 정보, 보호 단말의 디바이스 식별 정보 등을 포함할 수 있으나, 이에 한정되지는 않는다. 통합 안전 웹 서버를 통해 설정된 보호자 정보는 소정 사용자 데이터베이스(미도시)에 유지되어 관리될 수 있다. 지능형 통합 관제 서버는 보호 단말의 현재 위치가 미리 설정된 블루 존을 벗어난 것으로 판단하면, 보 호 단말의 현재 위치에 대응하는 로컬 보호 센터 서버를 탐색할 수 있다. 지능형 통합 관제 서버는 탐색된 로컬 보호 센터 서버로 보호 단말의 현재 위치 정보, 보호 단말 사용자의 집 주소 정보 및 보호 단말과 길 안내 드론 사이의 근거리 무선 통신 연결에 필요한 디 바이스 식별 정보 등이 포함된 긴급 구조 요청 신호를 전송할 수 있다. 또한, 지능형 통합 관제 서버는 보호 단말이 블루 존을 벗어났음을 지시하는 소정 경고 안내 메시지를 보호자 단말로 전송할 수도 있다. 로컬 보호 센터 서버는 긴급 구조 요청 신호가 수신되면, 보호 단말를 위한 최적의 길 안내 드론을 선택하고, 선택된 길 안내 드론이 보호 단말의 현재 위치로 자율 비행하여 이동하도록 제어할 수 있다. 길 안내 드론은 보호 단말을 감지하여 근거리 무선 통신 채널을 설정할 수 있다. 길 안내 드론은 보호자 정보에 기반하여 목적지-즉, 집 주소-를 식별하고, 보호 단말의 현재 위치에 서 식별된 목적지까지의 최적 이동 경로를 산출할 수 있다. 다른 일 예로, 길 안내 드론은 보호 단말과 근거리 무선 통신 채널이 설정되면, 설정된 근거리 무선 통 신 채널을 통해 보호 단말로부터 집 주소 정보를 획득할 수도 있다. 또 다른 일 예로, 로컬 보호 센터 서버는 보호 단말에 상응하는 보호자 정보-즉, 집 주소 정보- 및 현재 위치 정보에 기반하여 최적 이동 경로를 산출하고, 산출된 최적 이동 경로에 관한 정보를 길 안내 드론 에 제공할 수도 있다. 여기서, 최적 이동 경로는 우범 지역, 유해 업소 밀집 지역, 교통 혼잡 지역 등을 제외하여 산출된 최단 거리일 수 있다. 길 안내 드론은 목적지까지의 이동 거리가 소정 기준치를 초과하는지 판단할 수 있다. 판단 결과, 기준치를 초과하면, 길 안내 드론은 현재 위치에서 가장 가까운 보호소를 로컬 보호 센터 서 버와 연동하여 검색하고, 검색된 보호소로 보호 단말 사용자를 안내할 수 있다. 이때, 로컬 보호 센 터 서버는 검색된 보호 센터에 관한 정보를 보호자 단말에 전송할 수 있다. 만약, 목적지까지의 이동 거리가 기준치 이하이면, 길 안내 드론은 산출된 최적 이동 경로에 기반하여 보호 단말 사용자를 집까지 안내할 수 있다. 여기서, 최적 이동 경로는 우범 지역, 청소년 유해 업소 밀집 지역 등이 포함되지 않도록 결정될 수 있다. 즉, 최적 이동 경로는 거리뿐만 아니라 안전도를 고려하여 산출될 수 있다. 길 안내 드론은 길 안내 서비스 중 구비된 카메라를 이용하여 해당 보호 단말 사용자를 촬영할 수 있다. 이때, 촬영된 영상은 무선망을 통해 직접 보호자 단말에 전송될 수 있으나, 이는 하나의 실시 예 에 불과하며, 다른 실시 예는 촬영된 영상이 로컬 보호 센터 서버 및 지능형 통합 관제 서버 중 적어도 하나에 전송되고, 로컬 보호 센터 서버 또는 지능형 통합 관제 서버가 수신된 영상을 편집/변환하여 보 호자 단말로 전달할 수도 있다. 도 2는 본 발명의 일 실시 예에 따른 안전 취약 계층을 위한 통합 관제 서비스 제공 방법을 설명하기 위한 순서 도이다. 도 2를 참조하면, 보호자는 통합 안전 웹 서버에 접속하여 보호 단말-예를 들면, 아동 및 치매 노인의 웨어러블 단말일 수 있음-에 대한 블루 존 및 보호자 정보를 설정할 수 있다(S201). 여기서, 보호자 정보는 보 호자의 전화 번호 정보, 보호자의 집 주소 정보 등을 포함할 수 있으나, 이에 한정되지는 않으며, 보호 단말의고유 디바이스 식별 정보를 포함할 수도 있다. 본 실시 예에 있어서, 블루 존은 보호 단말와 관련하여 지리적으로 안전한 활동 영역을 의미할 수 있다. 보호자는 통합 안전 웹 서버에 의해 제공되는 소정 웹 화면상에서 보호 단말에 상응하는 블루 존을 설 정할 수 있다. 여기서, 블루 존은 건물 단위, 아파트 단위, 행정 구역 단위 등으로 설정될 수 있으나, 이는 하나의 실시 예에 불과하며, 지도상에서 사용자가 선택한 특정 영역이 블루 존으로 설정될 수도 있다. 실시 예는 보호 단말에 상응하는 복수의 블루 존이 설정될 수 있다. 다른 실시 예는 보호 단말에 상응하여 시간대 별 상이한 블루 존이 설정될 수도 있다. 일 예로, 자녀가 오전에 잠실동에서 대치동으로 영어 학원을 다녀오고, 오후에 잠실동에서 삼전동으로 수학 학 원을 다녀오는 경우, 시간대 별 블루 존은 상이하게 설정될 수 있다. 보호 단말에 구비된 GPS 모듈은 GPS 위성으로부터 신호를 수신하여 보호 단말의 현재 위치를 측정 될 수 있다(S203). 일 예로, 보호 단말에 상응하여 측정된 현재 위치에 관한 정보는 통합 안전 웹 서버로 전송될 수 있으 며, 이 경우, 통합 안전 웹 서버는 보호 단말에 상응하여 측정된 현재 위치와 보호 단말에 상응하 여 기 설정된 블루 존을 비교하여 해당 보호 단말이 블루 존을 이탈하였는지 여부를 판단할 수 있다(S205). 통합 안전 웹 서버는 측정된 현재 위치가 블루 존을 벗어난 경우, 보호 단말의 현재 위치 정보가 포함 된 소정 보호 요청 메시지를 지능형 통합 관제 서버로 전송할 수 있다. 여기서, 보호 요청 메시지는 보호자 정보, 보호 단말과의 무선 통신 연결-예를 들면, 블루투스 통신 연결일 수 있으나, 이에 한정되지는 않음- 에 필요한 정보가 더 포함될 수 있다. 지능형 통합 관제 서버는 보호 단말의 현재 위치에 대응하는 지역 보호 센서 서버를 식별한 후, 식 별된 로컬 보호 센터 서버로 보호 단말에 상응하는 현재 위치 정보, 보호자 정보 및 무선 통신 연결에 필요한 정보가 포함된 긴급 구조 요청 신호를 전송할 수 있다(S209). 이때, 지능형 통합 관제 서버는 보호 단말에 상응하는 보호자 단말로 보호 단말이 블루 존을 이탈하였음을 지시하는 소정 경고 메시지를 전송할 수 있다. 로컬 보호 센터 서버는 보호 단말에 길 안내 서비스를 제공할 수 있는 적어도 하나의 자율 비행 드론- 이하, 설명의 편의를 위해 ‘길 안내 드론’이라 명함-을 제어할 수 있다. 로컬 보호 센터 서버는 가용한 길 안내 드론을 식별하고, 식별된 길 안내 드론이 보호 단말의 현재 위치로 자율 비행하여 이동하도록 제어할 수 있다(S211). 길 안내 드론과 보호 단말 사이에 무선 통신이 연결되면, 길 안내 드론(또는 로컬 보호 센터 서버 )는 보호자 정보에 기반하여 목적지-즉, 보호자의 집-를 식별하고, 보호 단말의 현재 위치에서 식별 된 목적지까지의 최적 이동 경로를 산출할 수 있다(S213). 길 안내 드론은 목적지까지의 이동 거리가 소정 기준치를 초과하는지 판단할 수 있다(S215). 판단 결과, 기준치를 초과하면, 길 안내 드론은 현재 위치에서 가장 가까운 보호소를 로컬 보호 센터 서 버와 연동하여 검색하고, 보호 단말의 사용자가 검색된 보호소로 이동하도록 길 안내 서비스를 제공 할 수 있다(S217). 이때, 로컬 보호 센터 서버는 검색된 보호소에 관한 정보를 보호자 단말에 전송 할 수 있다. 상기한 215 단계의 판단 결과, 목적지까지의 이동 거리가 기준치 이하이면, 길 안내 드론은 산출된 최적 이 동 경로에 기반하여 길 안내 서비스를 제공할 수 있다(S219). 도 3은 본 발명의 일 실시예에 따른 길 안내 드론의 내부 구성을 설명하기 위한 블록도이다. 본 발명의 일 실시예에 따른 길 안내 드론은 무선 통신부, 경로 산출부, 건강 상태 판단부, 비행 제어 모듈, 조명 제어부, 카메라 구동부, 저장부, 출력부, 방향 표시부, 배터리, 무선 전력 수신부, 제어부 중 적어도 하나를 포함하여 구성될 수 있다. 무선 통신부는 이동 통신 모듈, 근거리 통신 모듈, 무선 인터넷 모듈 중 적어도 하나를 포함하여 구성될 수 있다. 이동 통신 모듈은 이동 통신망의 무선 인터페이스를 통해 기지국, 중계기, 리피터, 펨토셀, RRH(Radio Remote Head) 등과 무선 신호를 송/수신하는 기능을 수행한다. 여기서, 무선 신호는 음성 통화 신호, 화상 통화 신호, 문자/멀티미디어 메시지 송수신에 따른 다양한 형태의 데이터 신호를 포함할 수 있다. 이동 통신 모듈에 탑재되는 무선 접속 방식으로는 WCDMA(Wideband Code Division Multiple Access) 방식, LTE(Long Term Evolution)/LTE-Advanced 방식 등을 포함할 수 있으나 이에 한정되지는 않으며, 추후 출시 예정 인 이동 통신 서비스인 5G 이상의 통신 기술도 포함될 수 있다. 실시 예에 따른 길 안내 드론은 이동 통신 모듈을 이용하여 로컬 보호 센터 서버, 지능형 통합 관제 센 터 및 보호자 단말 등과 통신을 수행할 수 있다. 무선 인터넷 모듈은 무선 인터넷 접속을 위한 송/수신 모듈을 의미하며, 무선 인터넷 모듈은 길 안내 드론 에 내장되거나 소정의 인터페이스 단자를 통해 외장될 수 있다. 무선 인터넷 기술로는 WLAN(Wireless LAN)(Wi- Fi), Wibro(Wirelessbroadband), Wimax(World Interoperability for Microwave Access) 등이 이용될 수 있다. 일 실시 예에 따른 길 안내 드론은 이동 통신 모듈 또는 무선 인터넷 모듈을 통해 인터넷망에 연결된 로컬 보호 센터 서버, 지능형 통합 관제 서버와 통신 채널을 설정하여 실시간 촬영된 영상을 전송할 수도 있 다. 다른 실시 예로, 길 안내 드론은 이동 통신 모듈 또는 무선 인터넷 모듈을 통해 무선망에 연결된 보호 자 단말에 실시간 촬영 영상 및 메시지를 전송할 수 있다. 일 예로, 길 안내 드론는 보호 단말 사용자를 구비된 카메라를 통해 촬영하고, 실시간 촬영된 영상 및 현재 위치에 관한 정보를 보호자 단말로 전송할 수 있다. 또한, 길 안내 드론은 길 안내 목적지가 보호 소로 결정된 경우, 해당 보호소의 주소 정보가 포함된 안내 메시지를 보호자 단말로 전송할 수도 있 다. 또 다른 실시 예에 따른 지능형 통합 관제 센터는 길 안내 드론으로부터 보호 단말의 현재 위치 및 최적 이동 경로에 관한 정보를 수신할 수도 있다. 이 경우, 지능형 통합 관제 센터는 지도상에 보호 단말 의 최적 이동 경로 및 현재 위치를 매핑하여 보호자 단말로 전송할 수도 있다. 근거리 무선 통신 모듈은 근거리 무선 통신을 위한 통신 모듈을 말한다. 근거리 무선 통신 기술로 블루투스 (Bluetooth), RFID(Radio Frequency Identification), 적외선 통신(IrDA, infrared Data Association), UWB(UltraWideband) 등이 이용될 수 있다. 경로 산출부는 보호자 정보에 포함된 집 주소 정보 및 보호 단말의 현재 위치에 기반하여 최적 이동 경로를 산출할 수 있다. 경로 산출부는 산출된 최적 이동 경로의 이동 거리가 소정 기준치를 초과하면, 보호 단말의 현재 위치 에서 가장 가까운 보호소까지의 최적 이동 경로를 산출할 수도 있다. 건강 상태 판단부는 근거리 무선 통신을 통해 보호 단말로부터 수신된 각종 생체 정보에 기반하여 보 호 단말 사용자의 현재 건강 상태를 판단할 수 있다. 여기서, 생체 정보는 맥박 정보, 체온 정보, 혈당 정 보 등을 포함할 수 있으나, 이에 한정되지는 않는다. 실시 예에 따른 제어부는 건강 상태 판단부에 의해 판단된 보호 단말 사용자의 건강 상태가 위급 상황이면, 로컬 보호 센터 서버로 현재 위치 정보가 포함된 긴급 구조 요청 신호를 전송할 수 있다. 이때, 제어부는 보호 단말 사용자에 대한 촬영된 영상도 함께 로컬 보호 센터 서버로 전송할 수 있다. 로컬 보호 센터 서버는 보호 단말의 현재 위치에서 가장 가까운 소방서 또는 병원을 검색하여 긴급 구 조를 요청할 수 있다. 본 발명의 다른 실시 예에 따른 제어부는 보호 단말 사용자의 건강 상태가 정상이 아니거나 위급 상황 이면, 구비된 출력부-예를 들면, 스피커일 수 있음-를 통해 주변에 구조 요청 메시지를 출력하도록 제어할 수도 있다. 비행 제어 모듈는 보호 단말과 길 안내 드론이 일정 거리 및(또는) 고도를 유지하며 비행하도록 제어할 수 있다. 이를 위해, 비행 제어 모듈은 복수의 모터와 각각의 모터에 연결된 프로펠러 등을 포함하는 구동부와 비행 고도 및 길 안내 드론과 보호 단말 사이의 이격 거리를 측정하는 고도 및 거리 산출 부를 포함할 수 있다. 여기서, 비행 고도는 중력 센서 등을 이용하여 측정될 수 있으며, 길 안내 드론과 보 호 단말 사이의 거리는 보호 단말이 송출하는 비콘 신호 세기에 기반하여 측정될 수 있다. 조명 제어부는 주변 밝기-즉, 조도-를 측정하고, 측정된 조도가 기준치 이하이면, 조명을 켜도록 제어할 수 있다. 또한 조명 제어부는 현재 시간이 일몰 시간을 경과하면, 조명이 켜지도록 제어할 수도 있다. 일부 시각 장애인의 경우, 주변 밝기가 기준치 이상이면, 어느 정도 사물의 윤곽을 구분할 수 있으나, 주변 밝 기가 기준치 이하이면, 전혀 보이지 않을 수 있다. 또한, 보호 단말 사용자는 조명을 통해 야간에도 심적 안정 상태를 유지할 수 있을 뿐만 아니라 위급 상황 발생 시 주변에 자신의 위치를 구조 요원에게 분명하게 알릴 수 있다. 실 시예 따른 길 안내 드론은 야간 위급 상황이 발생하여 구조를 요청한 경우, 조명을 켠 상태로 고도를 높 여 보호 단말의 현재 위치를 먼 거리에서도 식별 가능하도록 제어할 수도 있다. 카메라 구동부는 제어부의 제어 신호에 따라 구비된 카메라(351, 353)를 이용하여 주변 영상을 촬영 하고, 촬영된 영상 정보를 제어부에 전달할 수 있다. 실시 예에 따른 길 안내 드론은 두 개의 카메라가 구비될 수 있다. 그 하나는 보호 단말 사용자를 촬영 하기 위한 후방 카메라이고, 다른 하나는 산출된 최적 이동 경로에 따른 자율 비행을 제어하기 위한 전방 카메라일 수 있다. 제어부는 전방 카메라에 의해 촬영된 영상에 기초하여 길 안내 드론의 비행을 제어할 수 있다. 제어부는 로컬 보호 센터 서버으로부터 영상 전송 요청 신호가 수신되면, 카메라 촬영된 영상을 로컬 보호 센터 서버로 전송할 수 있다 저장부는 길 안내 드론 동작에 필요한 각종 프로그램 코드가 저장될 수 있다. 또한, 저장부는 일 정 시간 동안 촬영된 영상 정보가 저장될 수 있다. 출력부는 긴급 상황 발생 시 제어부의 제어 신호에 따라, 주변에 경고음 또는(및) 경고등을 출력하거 나, 구조 요청 메시지를 출력하는 기능을 수행할 수 있다. 방향 표시부는 보호 단말 사용자가 진행할 방향을 표시할 수 있다. 일 예로, 방향 표시부는 복수의 방향 표시 램프를 보호 단말 사용자의 진행 방향을 표시할 수 있다. 여기서, 방향 표시 램프는 직진 방향을 표시하는 제1 방향 표시 램프, 좌회전 방향을 표시하는 제2 방향 표시 램프, 우회전 방향을 표시하는 제3 방향 표시 램프 및 유턴을 표시하는 제4 방향 표시 램프 을 포함할 수 있다. 다른 일 예로, 방향 표시부는 구비된 디스플레이 화면에 최적 이동 경로에 따라 보호 단말 사용자가 진행할 방향을 표시할 수도 있다. 배터리는 길 안내 드론 구동에 필요한 전력을 공급할 수 있다. 전력 관리부는 전원 포트 또는 무선 전력 수신기로부터 수신된 전력을 배터리로 전달하여 충전이 이루어지도록 제어할 수 있다. 전력 관리부는 과전압/과전류 차단 회로가 구비되어 배터리의 파손을 방지할 수도 있다. 무선 전력 수신기는 외부 무선 전력 송신기와 연동하여 전자기 유도 현상을 통해 무선으로 전력을 수신할 수 있다. 전원 포트는 외부 전원 플러그가 연결되면, 플러그를 통해 인가되는 전력을 전력 관리부로 전달할 수 있다. 도 4은 본 발명의 다른 실시 예에 따른 안전 취약 계층을 위한 통합 관제 서비스 제공 시스템을 설명하기 위한 도면이다. 도 4를 참조하면, 이하, 설명의 편의를 위해 안전 취약 계층을 위한 통합 관제 서비스 제공 시스템을 간단히 ‘ 시스템’이라 명하기로 한다. 도 4를 참조하면, 시스템은 차량 관제 장치, 통합 안전 웹 서버, 지능형 통합 관제 서버, 보호자 단말, 운전자 단말, GPS(Global Positioning System) 위성, 인터넷망 및 무선망 을 포함하여 구성될 수 있다. 차량 관제 장치는 차량용 외부 안테나를 통해 무선망에 접속할 수 있다. 차량 관제 장치의 세부 구성은 후술할 도면의 설명을 통해 보다 명확해질 것이다. 보호자 단말 또는(및) 운전자 단말은 통합 안전 웹 서버에 접속하여 관제 대상 차량 또는 관제 대상 차량에 장착된 차량 관제 장치를 등록할 수 있다. 보호자 단말은 통합 안전 웹 서버에 접속하여 보호 대상 단말을 등록할 수도 있다. 차량 관제 장치는 차량의 시동이 OFF되고, 도어가 잠금 설정되면, 내부 구비된 각종 센서를 이용하여 차량 내부에 잔류 인원-예를 들면, 유기 아동-이 존재하는지 판단할 수 있다. 차량 관제 장치는 잔류 인원이 존재하면, 지능형 통합 관제 서버로 잔류 인원이 존재함을 지시하는 소정 경고 메시지를 전송할 수 있다. 지능형 통합 관제 서버는 해당 차량 관제 장치를 등록한 운전자 단말 및(또는) 보호자 단말 로 해당 차량에 잔류 인원이 존재함을 지시하는 소정 경고 메시지를 전송할 수 있다. 차량 관제 장치는 잔류 인원이 존재하면, 차량 내부 온도를 측정할 수도 있다. 차량 관제 장치는 차량 내부 온도가 제1 기준치를 초과하거나 제2 기준치 미만이면, 차량 시동 ON 후 공조 기를 구동하여 차량 내부 온도가 미리 설정된 적정 온도를 유지하도록 제어할 수 있다. 차량 관제 장치는 차량 내부 온도가 제2 기준치 이상이고 제1 기준치 이하이면, 무선망을 통해 미리 지정된 보호자 단말 및(또는) 운전자 단말로 차량 내 잔류 인원이 존재함을 알리는 소정 경고 메시지 를 전송할 수도 있다. 차량 관제 장치는 잔류 인원이 존재하면, 차량 내부 이산화탄소 농도를 측정할 수도 있다. 측정된 이산화탄소 농도가 소정 제3 기준치를 초과하면, 차량 관제 장치는 차량 시동 후 공조기를 구동하 여 외부 신선한 공기가 차량 내부에 유입되도록 제어할 수 있다. 다른 일 예로, 차량 관제 장치는 측정된 이산화탄소 농도가 소정 제4 기준치를 초과하면, 차량 시동 후 도 어 구동 릴레이를 제어하여 차량 창문을 열거나 또는 썬루프를 작동시켜 외부 신선한 공기가 차량 내부로 유입 되도록 제어할 수도 있다. 여기서, 제4 기준치는 상기한 제3 기준치보다 클 수 있다. 차량 관제 장치는 모션 인식 센서, 열 감지 센서 등이 구비될 수도 있다. 차량 관제 장치는 모션 인식 센서 및(또는) 열 감지 센서를 이용하여 차량 내 잔류 인원의 존재 여부를 판 단할 수 있다. 차량 관제 장치는 차량 내 잔류 인원의 단말(미도시)과 근거리 무선 통신을 수행할 수도 있다. 차량 관제 장치는 차량 내 잔류 인원의 단말-이하, 설명의 편의를 위해 잔류자 단말이라 명함-로부터 생체 정보를 수집할 수도 있다. 일 예로, 잔류 단말은 생체 정보 수집을 위한 센서가 구비된 웨어러블 디바이스일 수 있다. 차량 관제 장치는 수집된 생체 정보에 기반하여 잔류 인원의 현재 건강 상태를 판단할 수 있다. 일 예로, 차량 관제 장치는 잔류 인원의 현재 건강 상태에 기반하여 공조기, 창문, 썬루프 중 적어도 하나 를 제어할 수 있다. 차량 관제 장치는 잔류 인원의 현재 건강 상태가 위급 상태인 경우, 차량의 클락션 및 헤드라이트 중 적어 도 하나를 구동하여 외부에 구조를 요청할 수도 있다. 차량 관제 장치는 잔류 인원이 존재하면, 차량에 구비된 AVN(Audio Video Navigation) 시스템을 구동시켜 라디오 또는 음악을 재생함으로써, 잔류 인원이 심리적 안정을 취하도록 제어할 수도 있다.만약, 잔류 인원이 유아인 경우, 해당 유아는 카시트에 앉아 안전 벨트를 착용한 상태일 수 있다. 차량 관제 장치는 차량 내부 촬영이 가능한 카메라를 이용하여 잔류 인원을 촬영하고, 촬영된 이미지를 분 석하여 잔류 인원이 유아인지 여부를 판단할 수 있다. 판단 결과, 유아이면, 차량 관제 장치는 또 다른 사고를 방지하기 위해 도어는 잠금 상태로 유지하고, 공 조기를 구동하여 내부 공기가 적정 온도의 쾌적한 상태를 유지할 수 있도록 제어할 수 있다. 이때, 차량 관제 장치는 미리 설정된 음악을 재생할 수 있다. 이를 통해 차량 내부에 홀로 남겨진 유아가 신체적/심리적으 로 안정된 상태에서 다른 사람의 구조를 기다릴 수 있다. 도 5는 본 발명의 일 실시 예에 따른 차량 관제 장치의 구성을 설명하기 위한 도면이다. 도 5를 참조하면, 차량 관제 장치는 크게 차량 단말, 안테나, 센서, 입력 디바이스, 출력 디바이스, 전자제어유닛, AVN 시스템 및 차량 내부 통신망을 포함하여 구성될 수 있 다. 차량 단말은 무선 통신 모듈, 측위 모듈, 센싱 모듈, 입력 모듈, 출력 모듈, 차량 내부 통신 모듈 및 제어기을 포함하여 구성될 수 있다. 무선 통신 모듈은 안테나와 연결되고, 안테나는 차량 내부에 위치한 통신 단말과의 통신을 위한 근거리 통신 안테나 모듈과 차량 외부의 통신 신호를 수신하는 통합 안테나 모듈를 포함할 수 있다. 일 예로 통합 안테나 모듈은 차량 외부 일측에 장착되는 샤크 안테나를 포함할 수 있다. 일 예로, 근거리 통신 안테나 모듈은 블루투스 통신을 위한 안테나 모듈일 수 있으나, 이에 한정되지는 않 는다. 일 예로, 통합 안테나 모듈은 이동 통신 신호 뿐만 아니라 GPS 신호를 수신할 수 있도록 구현될 수 있다. 이때, 이동 통신 신호는 무선 통신 모듈에 의해 처리되고, GPS 신호는 측위 모듈에 의해 처리될 수 있다. 차량 단말은 차량 내부 통신 모듈을 통해 차량 내부 통신망에 연결된 각종 전자제어유닛 및 AVN 시스템의 동작을 제어할 수도 있다. 일 예로, 전자제어유닛는 도어, 썬루프, 창문 등의 개폐를 제어하는 도어 제어 ECU, 차량 시동을 ON/OFF 제어하는 시동 제어 ECU, 공조기의 동작을 제어하는 공조 제어 ECU, 차량에 구비된 각종 조명 기기의 동작을 제어하는 조명 제어 ECU, 클락션을 제어하기 위한 클락션 제어 ECU 등을 포함할 수 있 다. 측위 모듈은 GPS 신호를 이용하여 차량의 현재 위치를 측정할 수 있다. 센싱 모듈은 제어기의 제어 신호에 따라 센서로부터 해당 센싱 정보를 수집하여 제어기에 전달할 수 있다. 센서는 차량 내부 온도를 측정하는 온도 센서는 적어도 하나의 카메라 센서에 의해 캡쳐된 이미지 분 석을 통해 감지 영역 내의 피사체의 존재 및 움직임을 감지하는 모션 인식 센서, 차량 내부 이산화탄소 농 도를 측정하는 이산화탄소 센서 등을 포함할 수 있으나, 이에 한정되지는 않는다. 입력 디바이스는 마이크 및 카메라를 포함할 수 있다. 출력 디바이스는 스피커 및 경광등을 포함할 수 있다. 제어기는 모션 인식 센서로부터 수신된 센싱 정보에 기초하여 차량 내부에 유기 인원이 존재하는지 판단할 수 있다. 다른 일 예로, 제어기는 마이크를 통해 입력되는 음성 신호를 인식하여 차량 내부에 유기 인원이 존 재하는지 판단할 수도 있다. 제어기는 온도 센서로부터 수신된 센싱 정보에 기초하여 공조기, 도어(창문), 썬루프, 경광등, 조명, 경고음 중 적어도 하나를 제어할 수 있다. 또한, 제어기는 이산화탄소 센서로부터 수신된 센싱 정보에 기초하여 공조기, 도어(창문), 썬루프, 경광등, 조명, 경고음 중 적어도 하나를 제어할 수도 있다. 또한, 제어기는 차량 내부 잔류 인원의 존재가 확인되면, 카메라 촬영된 영상 분석을 통해 잔류 인원이 유 아인지 여부를 판단할 수 있다. 판단 결과, 유아이면, 제어기는 라디오 또는 특정 음원-예를 들면, 지정된 동요-이 재생되도록 제어할 수 도 있다. 실시 예에 따른 제어기는 차량의 시동이 OFF되고, 도어가 잠금 설정되면-즉, 보안 모드에 진입하면-, 내부 구비된 각종 센서를 이용하여 차량 내부에 잔류 인원-예를 들면, 유기 아동-이 존재하는지 판단할 수 있다. 제어기는 잔류 인원이 존재하면, 차량 내 잔류 인원이 존재함을 지시하는 소정 경고 메시지를 생성하고, 생성된 경고 메시지를 무선 통신 모듈 및 통합 안테나 모듈을 통해 지능형 통합 관제 서버로 전 송할 수 있다. 제어기는 잔류 인원이 존재하면, 온도 센서가 차량 내부 온도를 측정하도록 제어할 수 있다. 제어기는 차량 내부 온도가 제1 기준치를 초과하거나 제2 기준치 미만이면, 차량 내부 통신 모듈을 통해 시동 제어 ECU에 소정 제어 신호를 전송하여 차량 시동을 ON시킨 후, 공조 제어 ECU에 소정 제 어 신호를 전송하여 공조기를 구동시킬 수 있다. 이때, 공조기는 차량 내부 온도가 미리 설정된 적정 온도를 유 지하도록 제어될 수 있다. 제어기는 차량 내 잔류 인원이 존재하면, 이산화탄소 센서가 차량 내부 이산화탄소 농도를 측정하도 록 제어할 수도 있다. 측정된 이산화탄소 농도가 소정 제3 기준치를 초과하면, 제어기는 차량 시동 후 공조기를 구동하여 외부 신선한 공기가 차량 내부에 유입되도록 제어할 수 있다. 다른 일 예로, 제어기는 측정된 이산화탄소 농도가 소정 제4 기준치를 초과하면, 차량 시동 후 도어 구동 릴레이를 제어하여 차량 창문을 개방시키거나 썬루프를 작동시켜 외부 신선한 공기가 차량 내부에 빠르게 유입 되도록 제어할 수도 있다. 여기서, 제4 기준치는 상기한 제3 기준치보다 클 수 있다. 제어기는 잔류자 단말과 근거리 무선 통신을 연결하여, 잔류자의 생체 정보를 수집할 수도 있다. 일 예로, 잔류자 단말은 생체 정보 수집을 위한 센서가 구비된 웨어러블 디바이스일 수 있다. 일 예로, 웨어러블 디바이 스는 체온 측정 센서, 맥박 측정 센서, 혈류량 측정 센서 및 혈당 측정 센서 등을 포함할 수 있으나, 이에 한정 되지는 않는다. 제어기는 수집된 생체 정보에 기반하여 잔류 인원의 현재 건강 상태를 판단할 수 있다. 일 예로, 제어기는 잔류 인원의 현재 건강 상태에 기반하여 공조기, 창문, 썬루프 중 적어도 하나를 제어 할 수 있다. 제어기는 잔류 인원의 현재 건강 상태가 위급 상태인 경우, 클락션 제어 ECU 및 조명 제어 ECU 중 적어도 하나를 제어하여 외부에 구조를 요청할 수도 있다. 제어기는 잔류 인원이 존재하면, 차량에 구비된 AVN(Audio Video Navigation) 시스템을 제어하여 라 디오 또는 특정 음원을 재생시킬 수 있다, 이를 통해 차량 내 잔류 인원은 심리적으로 안정될 수 있다. 만약, 잔류 인원이 유아인 경우, 해당 유아는 카시트에 위에 안전 벨트를 착용한 상태일 수 있다. 제어기 차량 내부 촬영이 가능한 카메라를 이용하여 잔류 인원을 촬영하고, 촬영된 영상을 분석하여 잔류 인원이 유아인지 여부를 판단할 수 있다. 판단 결과, 유아이면, 제어기는 또 다른 사고를 방지하기 위해 도어는 잠금 상태를 유지시키고, 공조기를 제어하여 내부 공기가 적정 온도의 쾌적한 상태를 유지할 수 있도록 제어할 수 있다. 이때, 제어기는 미리 설정된 음원을 재생할 수 있으며, 이를 통해, 차량 내 혼자 남겨진 유아는 신체적/심 리적으로 안정된 상태에서 부모 또는 다른 사람의 구조를 기다릴 수 있다. 상기한 실시 예와 같이, 본 발명은 이산화 탄소 농도 증가나 온도 상승 시 산소 공급 및 온도를 낮추기 위해 별 도의 산소 공급기나 온열 기구를 장착하지 않고도, 차량 내 이미 장착된 공조기를 제어함으로써, 비용 증가를 방지하고, 빠르고 효과적으로 차량 내 유기된 사람을 구조할 수 있는 장점이 있다.도 6은 상기한 도 5에서 설명한 모션 인식 센서의 세부 구조를 설명하기 블록도이다. 도 6을 참조하면, 모션 인식 센서는 크게 적외선 모션 센서, 카메라 모션 센서, 모션 감지부 및 감지 방향 변경부를 포함하여 구성될 수 있다. 적외선 모션 센서는 적외선 파장 영역의 빛을 방출하는 발광소자 및 물체 또는 사람으로부터 반사되 는 신호를 수신하는 수광소자, 수광 소자로부터 수신되는 전기 신호를 처리하여 적외선 발산 물체의 움직임을 판별하기 위한 제1 움직임 데이터를 생성하는 제1 신호 처리부을 포함하여 구성될 수 있다. 카메라 모션 센서는 기준 영상 및 확장 영상을 촬영하는 제1 내지 제n 카메라와 제1 내지 제n 카메라 에 의해 촬영된 영상으로부터 추출된 특징점들에 기초하여 3차원 공간 정보를 획득하고, 획득된 3차원 공 간 내에서의 3차원 동작 정보인 제2 움직임 데이터를 생성하는 제2 신호 처리부를 포함하여 구성될 수 있 다. 모션 감지부는 제1 움직임 데이터 및 제2 움직임 데이터를 이용하여 차량 내 잔류 인원의 움직임을 감지할 수 있다. 감지 방향 변경부는 모션 감지부의 제어 신호에 따라 관심 영역 내 감지 방향을 제어할 수 있다. 일 예로, 모션 감지부는 적외선 모션 센서의 제1 움직임 데이터에 기초하여 움직임을 감지하면, 카메 라 모션 센서를 구동하여 제2 움직임 데이터를 획득할 수도 있다. 다른 일 예로, 모션 감지부는 제1 움직임 데이터 및 제2 움직임 데이터에 기초하여 차량 내 피사체의 움직 임을 감지하면 움직임이 감지되었음을 지시하는 소정 제어 신호를 제어기에 전송할 수 있다. 이때, 제어기 는 스피커를 통해 소정 메시지-예를 들면, ‘성함을 말해주세요’-를 출력할 수 있다. 이후 마이크를 통해 입력된 신호를 음성 인식하여 차량 내부의 잔여 인원이 있는지 여부를 최종 판단할 수 도 있다. 물론, 음성 인식을 통해 잔여 인원의 이름에 관한 정보를 획득할 수도 있다. 제어기는 획득된 잔여 인원의 이름이 포함된 소정 긴급 구조 요청 메시지를 지능형 통합 관제 서버로 전송할 수 있다. 지능형 통합 관제 서버는 수신된 이름에 상응하여 미리 등록된 보호자 단말 또는 운 전자 단말로 해당 차량 내부에 해당 이름의 사람이 남아 있음을 지시하는 소정 경고 알람 메시지를 전송할 수 있다. 도 7은 본 발명의 일 실시 예에 따른 차량 관제 장치에서의 통합 관제 서비스 제공 방법을 설명하기 위한 순서 도이다. 도 7을 참조하면, 차량 관제 장치는 정차 후 차량 시동이 OFF되었는지 확인할 수 있다(S701). 확인 결과, 차량 시동이 OFF되면, 차량 관제 장치는 보안 모드가 설정되었는지 확인할 수 있다(S703). 여기서, 차량 시동 OFF 후, 차량 도어가 잠금 설정되면 해당 차량은 보안 모드로 진입할 수 있다. 확인 결과, 보안 모드가 설정된 경우, 차량 관제 장치는 차량 내 잔류 인원이 존재하는지 판단할 수 있다 (S705). 판단 결과, 잔류 인원이 존재하는 경우, 차량 관제 장치는 차량 내부 온도를 측정할 수 있다(S707). 차량 관제 장치는 측정된 온도가 제1 기준치를 초과하는지 확인할 수 있다(S709). 확인 결과, 측정된 온도가 제1 기준치를 초과하면-즉, 내부 온도가 기준치 이상으로 높으면-, 차량 관제 장치는 차량 시동을 ON 시킨 후 공조기를 구동하여 차량 내부 온도가 미리 설정된 적정 온도를 유지하도록 제어할 수 있다(S711). 상기한 709 단계의 확인 결과, 측정된 온도가 제1 기준치를 초과하지 않으면, 차량 관제 장치는 측정된 온도가 제2 기준치 미만인지 확인할 수 있다(S713). 측정된 온도가 제2 기준치 미만이면, 차량 관제 장치는 711 단계를 수행할 수 있다. 일 예로, 차량 관제 장치는 측정된 온도가 제2 기준치 이상이고 제1 기준치 이하이면 미리 지정된 보호자 단말 로 차량 내 잔류 인원이 존재함을 알리는 소정 경고 메시지를 전송할 수 있다(S715). 다른 일 예로, 차량 관제 장치는 측정된 온도가 제2 기준치 이상이고 제1 기준치 이하이면 지능형 통합 관제 서 버로 차량 내 잔류 인원이 존재함을 알리는 소정 구조 요청 메시지 전송할 수도 있다. 도 8은 본 발명의 다른 실시 예에 따른 차량 관제 장치에서의 통합 관제 서비스 제공 방법을 설명하기 위한 순 서도이다. 도 8을 참조하면, 차량 관제 장치는 정차 후 차량 시동이 OFF되었는지 확인할 수 있다(S801). 확인 결과, 차량 시동이 OFF되면, 차량 관제 장치는 보안 모드가 설정되었는지 확인할 수 있다(S803). 여기서, 차량 시동 OFF 후, 차량 도어가 잠금 설정되면 해당 차량은 보안 모드로 진입할 수 있다. 확인 결과, 보안 모드가 설정된 경우, 차량 관제 장치는 차량 내 잔류 인원이 존재하는지 판단할 수 있다 (S805). 판단 결과, 잔류 인원이 존재하는 경우, 차량 관제 장치는 차량 내부 이산화탄소 농도 및 온도를 측정할 수 있 다(S807). 차량 관제 장치는 측정된 이산화탄소 농도가 제1 기준치를 초과하는지 확인할 수 있다(S809). 확인 결과, 측정된 농도가 제1 기준치를 초과하면, 차량 관제 장치는 차량 시동을 ON 시킨 후 공조기를 구동하 여 신선한 외부 공기가 차량 내부에 유입되도록 제어할 수 있다(S811). 상기한 809 단계의 확인 결과, 측정된 농도가 제1 기준치를 초과하지 않으면, 차량 관제 장치는 측정된 온도가 설정된 온도 범위를 벗어나는지 확인할 수 있다(S813). 확인 결과, 측정된 온도가 설정된 온도 범위를 벗어난 경우, 차량 관제 장치는 차량 내부 온도가 설정된 온도 범위를 유지하도록 공조기를 제어할 수 있다(S815). 이후, 차량 관제 장치는 미리 지정된 보호자 단말 및(또는) 운전자 단말로 차량 내 잔류 인원이 존재함을 알리 는 소정 경고 메시지를 전송할 수 있다(S817). 다른 일 예로, 차량 관제 장치는 지능형 통합 관제 서버로 차량 내 잔류 인원이 존재함을 알리는 소정 구 조 요청 메시지 전송할 수도 있다. 도 9는 본 발명의 또 다른 실시 예에 따른 차량 관제 장치에서의 통합 관제 서비스 제공 방법을 설명하기 위한 순서도이다. 도 9를 참조하면, 차량 관제 장치는 정차 후 차량 시동이 OFF되었는지 확인할 수 있다(S901). 확인 결과, 차량 시동이 OFF되면, 차량 관제 장치는 보안 모드가 설정되었는지 확인할 수 있다(S903). 여기서, 차량 시동 OFF 후, 차량 도어가 잠금 설정되면 해당 차량은 보안 모드로 진입할 수 있다. 확인 결과, 보안 모드가 설정된 경우, 차량 관제 장치는 차량 내 잔류 인원이 존재하는지 판단할 수 있다 (S905). 판단 결과, 잔류 인원이 존재하는 경우, 차량 관제 장치는 차량 내부 이산화탄소 농도(a)를 측정할 수 있다 (S907). 차량 관제 장치는 측정된 이산화탄소 농도 a가 제1 기준치와 제2 기준치 사이인지 확인할 수 있다(S909). 확인 결과, 측정된 농도가 제1 기준치와 제2 기준치 사이이면, 차량 관제 장치는 차량 시동을 ON 시킨 후 공조 기를 구동하여 신선한 외부 공기가 차량 내부에 유입되도록 제어할 수 있다(S911). 상기한 909 단계의 확인 결과, 측정된 이산화 탄소 농도 a가 제1 기준치와 제2 기준치 사이가 아니면, 차량 관 제 장치는 측정된 이산화탄소 농도 a가 제2 기준치를 초과하는지 확인할 수 있다(S913). 확인 결과, 측정된 온도가 측정된 이산화탄소 농도 a가 제2 기준치를 초과하면, 차량 관제 장치는 차량 시동 ON 후 도어 구동 릴레이를 제어를 통해 창문을 내려 외부 신선한 공기가 차량 내부로 빠르게 유입되도록 제어할 수 있다(S915). 다른 일 예로, 확인 결과, 측정된 온도가 측정된 이산화탄소 농도 a가 제2 기준치를 초과하고, 해당 차량에 썬 루프가 장착된 경우, 차량 관제 장치는 차량 시동 ON 후 썬루프를 더 개방할 수도 있다. 이후, 차량 관제 장치는 미리 지정된 보호자 단말 및(또는) 운전자 단말로 차량 내 잔류 인원이 존재함을 알리 는 소정 경고 메시지를 전송할 수 있다(S917). 다른 일 예로, 차량 관제 장치는 지능형 통합 관제 서버로 차량 내 잔류 인원이 존재함을 알리는 소정 구 조 요청 메시지 전송할 수도 있다. 본 발명은 본 발명의 정신 및 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있음은 당업자에게 자명하다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한 다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2019-0099854", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명의 실시 예에 따른 통합 관제 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1b는 본 발명의 일 실시 예에 따른 안전 취약 계층을 위한 통합 관제 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 본 발명의 일 실시 예에 따른 안전 취약 계층을 위한 통합 관제 서비스 제공 방법을 설명하기 위한 순서 도이다. 도 3은 본 발명의 일 실시예에 따른 길 안내 드론의 내부 구성을 설명하기 위한 블록도이다. 도 4은 본 발명의 다른 실시 예에 따른 안전 취약 계층을 위한 통합 관제 서비스 제공 시스템을 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시 예에 따른 차량 관제 장치의 구성을 설명하기 위한 도면이다. 도 6은 상기한 도 5에서 설명한 모션 인식 센서의 세부 구조를 설명하기 블록도이다. 도 7은 본 발명의 일 실시 예에 따른 차량 관제 장치에서의 통합 관제 서비스 제공 방법을 설명하기 위한 순서 도이다. 도 8은 본 발명의 다른 실시 예에 따른 차량 관제 장치에서의 통합 관제 서비스 제공 방법을 설명하기 위한 순 서도이다. 도 9는 본 발명의 또 다른 실시 예에 따른 차량 관제 장치에서의 통합 관제 서비스 제공 방법을 설명하기 위한 순서도이다."}
