{"patent_id": "10-2023-0044384", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0148676", "출원번호": "10-2023-0044384", "발명의 명칭": "인공지능 휴머노이드 로봇의 원격 관리 제어 시스템 및 그 운용 방법", "출원인": "주식회사 렌쥴리에듀테인먼트", "발명자": "이대오"}}
{"patent_id": "10-2023-0044384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 휴머노이드 로봇에 대한 원격 제어 및 관리용의 데이터를 인공지능 휴머노이드 로봇들로부터 수집하기위한 애플리케이션(110, 이하 “원격 제어/관리 서비스 애플리케이션”이라 함)이 저장되고, 인공지능 휴머노이드 로봇의 원격 제어 및 관리를 위한 원격 제어/관리 프로그램(120)이 탑재되며, 상기 원격 제어/관리 서비스애플리케이션(110)의 다운로드 및 실행이 이루어진 인공지능 휴머노이드 로봇별 원격 제어 내지 관리 기능을 수행하는 휴머노이드 로봇 원격 서비스 제공서버(100);상기 원격 제어/관리 서비스 애플리케이션(110)이 다운로드되어 설치되며, 상기 원격 제어/관리 서비스 애플리케이션(110)의 실행을 기번으로, 원격 제어 및 관리용의 상태 데이터(이하 “상태 데이터”라 함)를 상기 휴머노이드 로봇 원격 서비스 제공서버(100)에 제공하고, 상기 휴머노이드 로봇 원격 서비스 제공서버(100)의 원격제어신호를 수신하는 인공지능 휴머노이드 로봇(200); 및하나 또는 둘 이상의 상기 인공지능 휴머노이드 로봇(200)과 매칭되며, 해당 인공지능 휴머노이드 로봇(200)에대해 상기 휴머노이드 로봇 원격 서비스 제공서버(100)로부터 제공되는 모니터링 정보들을 수신하여 화면 표시하고, 해당 인공지능 휴머노이드 로봇(200)에 대해 원격 제어신호를 전송하는 사용자 단말기(300)를 포함하는인공지능 휴머노이드 로봇의 원격 관리 제어 시스템."}
{"patent_id": "10-2023-0044384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 인공지능 휴머노이드 로봇(200)은 상기 상태 데이터를 획득하는 복수의 센서(210-1∼210-n)와, 상기 센서(210-1∼210-n)들로부터 획득되는 상태 데이터를 무선 송출하는 제1 무선통신모듈(220)과, 상기 휴머노이드 로봇 원격 서비스 제공서버(100)의 원격 제어신호 및 상기 사용자 단말기(300)의 원격 제어신호를 수신하는 제2무선통신모듈(230)을 포함하고,상기 휴머노이드 로봇 원격 서비스 제공서버(100)는, 상기 인공지능 휴머노이드 로봇(200)별 상기 상태 데이터를 해당 인공지능 휴머노이드 로봇(200)별 사전 부여된 식별정보를 기준으로 매핑하여 저장하되, 상기 인공지능휴머노이드 로봇(200)의 모델명을 기준으로 그룹화하여 저장하는 데이터베이스 서버(130)와, 상기 데이터베이스서버(130)에 저장된 상태 데이터들을 대상으로 하는 동시에 상기 모델명을 기준으로 그룹화된 인공지능 휴머노이드 로봇(200)의 그룹별로 구분하여 그 상태 데이터들에 대해 딥러닝을 수행하여 해당 인공지능 휴머노이드 로봇(200)의 그룹별 유효 모니터링/관리 데이터를 생성하여 상기 원격 제어/관리 프로그램(120), 인공지능 휴머노이드 로봇(200) 및 사용자 단말기(300) 중 적어도 하나에 제공하는 인공지능모듈(140)을 포함하며,상기 휴머노이드 로봇 원격 서비스 제공서버(100)의 원격 제어신호 및 상기 사용자 단말기(300)의 원격 제어신호를 상기 인공지능 휴머노이드 로봇(200)의 상기 제2 무선통신모듈(230)에 전송하고, 상기 인공지능 휴머노이드 로봇(200)의 상기 제1 무선통신모듈(220)로부터 송출되는 상기 상태 데이터를 상기 휴머노이드 로봇 원격 서비스 제공서버(100)에 전송하는 무선AP모듈(400)을 더 포함하는 것을 특징으로 하는 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템."}
{"patent_id": "10-2023-0044384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 휴머노이드 로봇 원격 서비스 제공서버(100)는 상기 인공지능 휴머노이드 로봇(200)의 그룹별 해당 인공지능 휴머노이드 로봇(200)에 대한 블록코딩 서비스를 제공하기 위한 블록코딩 서비스 시스템(150)을 더포함하며,공개특허 10-2024-0148676-3-상기 사용자 단말기(300)는 상기 휴머노이드 로봇 원격 서비스 제공서버(100)에 접속하여 상기 블록코딩 서비스시스템(150)을 통해 운용되는 블록코딩 서비스 플랫폼(151)에서 상기 인공지능 휴머노이드 로봇(200)의 그룹별제공되는 블록코딩 서비스를 통해 해당 인공지능 휴머노이드 로봇(200)에 대한 맞춤형 제어코드 및 제어스케줄을 제작하여 다운로드한 다음, 다운로드한 상기 맞춤형 제어코드 및 제어스케줄에 따라 해당 인공지능 휴머노이드 로봇(200)을 제어하거나 다운로드한 상기 맞춤형 제어코드 및 제어스케줄을 해당 인공지능 휴머노이드 로봇(200)에 전송하는 작업 중 적어도 하나를 수행하는 것을 특징으로 하는 인공지능 휴머노이드 로봇의 원격 관리제어 시스템."}
{"patent_id": "10-2023-0044384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 유효 모니터링/관리 데이터에는 단위 시간당 이동 속도 또는 동작 속도에 따른 고장/이상 경고 정보, 제조년월 및 동작 시간에 따른 팔 관절, 무릎 관절 등 부분별 유지 보수 점검시기 알림정보 중 적어도 하나가 포함되는 것을 특징으로 하는 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템."}
{"patent_id": "10-2023-0044384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "휴머노이드 로봇 원격 서비스 제공서버의 원격 제어/관리 서비스 애플리케이션이 인공지능 휴머노이드 로봇에다운로드되어 설치되는 단계;상기 인공지능 휴머노이드 로봇에서 원격 제어/관리 서비스 애플리케이션의 실행을 기반으로 원격 제어 및 관리용의 상태 데이터(이하 “상태 데이터”라 함)를 상기 휴머노이드 로봇 원격 서비스 제공서버에 제공하는 단계;상기 휴머노이드 로봇 원격 서비스 제공서버에 탑재된 원격 제어/관리 프로그램에서 상기 인공지능 휴머노이드로봇으로부터 제공되는 상기 상태 데이터를 토대로 모니터링 정보를 생성하여 상기 인공지능 휴머노이드 로봇에대한 사용자의 사용자 단말기에 전송하는 단계;상기 인공지능 휴머노이드 로봇에서 무선 AP모듈을 통해 상기 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어신호를 수신하거나 사용자 단말기의 원격 제어신호를 수신하는 단계;상기 인공지능 휴머노이드 로봇이 수신되는 원격 제어신호에 따라 제어되면서 해당 원격 제어신호에 기반하는기능을 발휘하는 단계를 포함하는 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템의 운용 방법."}
{"patent_id": "10-2023-0044384", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 휴머노이드 로봇의 기능을 스마트폰, 태블릿 PC 등의 이동 디바이스 내지 데스크탑 PC 등의 PC를 통해서 원격으로 접속하여 제어할 수 있게 되며, 이를 위해 인공지능 휴머노이드 로봇의 작동이나 특정 동 작 내지 운행 상태 등이 실시간으로 모니터링 및 제어되기 위한 각종 상태 데이터들이 해당 인공지능 휴머노이드 로봇으로부터 수집되어 실시간으로 해당 서비스의 운용버에 전달될 수 있도록 하는 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템 및 그 운용 방법에 관한 것으로서, 본 발명에 따른 인공지능 휴머노이드 로봇의 원격 관 리 제어 시스템은, 휴머노이드 로봇 원격 서비스 제공서버, 인공지능 휴머노이드 로봇, 사용자 단말기 및 무선AP 모듈을 포함하여 구성된다."}
{"patent_id": "10-2023-0044384", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템 및 그 운용 방법에 관한 것으로서, 더욱 상세하 게는 인공지능 휴머노이드 로봇의 기능을 스마트폰, 태블릿 PC 등의 이동 디바이스 내지 데스크탑 PC 등의 PC를 통해서 원격으로 접속하여 제어할 수 있게 되며, 이를 위해 인공지능 휴머노이드 로봇의 작동이나 특정 동작 내 지 운행 상태 등이 실시간으로 모니터링 및 제어되기 위한 각종 상태 데이터들이 해당 인공지능 휴머노이드 로 봇으로부터 수집되어 실시간으로 해당 서비스의 운용버에 전달될 수 있도록 하는 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템 및 그 운용 방법에 관한 것이다."}
{"patent_id": "10-2023-0044384", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인간의 파트너로서 생활을 지원하는 즉, 일상 생활 중 다양한 측면에서 인적 활동을 지원하는 실용 로봇의 개발 이 진행되고 있으며, 이러한 실용 로봇은 산업용 로봇과는 다르게 인간과 같은 생활 환경에서 인간과 유사한 움 직임을 갖는 동시에 인간처럼 만들어진 로봇이라 하여 휴머노이드 로봇(Humanoid Robot)이라 불려지고 있다. 부 연 설명하면, 휴머노이드는 Human(인간)과 Android(안드로이드)의 합성어로 인간과 같은 인식 및 운동 기능을구현하기 위해 각종 기계/전자 장비들을 포함하여 구성된다. 이와 같이 인간의 외모와 유사한 형태의 휴머노이드 로봇은 외관에서뿐만 아니라 실제 동작을 수행함에 있어서 도 인간과 유사한 모습을 보여주어야 사용자로 하여금 자연스러움과 친밀함, 편안함을 제공할 수 있다. 또한 최근 들어 휴머노이드 로봇에 인공지능 시스템을 탑재하기 위한 기술 개발이 활발히 진행되고 있고, 오락 (여가)이나 교육 기능을 갖는 개인용 로봇의 상용화가 활발히 이루어지고 있는 추세에 비춰볼 때, 인공지능 휴 머노이드 로봇의 사용 내지 운용이 보편화되는 생활 환경이 가까운 미래에 펼쳐질 뿐만 아니라 유희, 오락, 교 육 등의 기능을 수행하는 개인용 휴머노이드 로봇의 사용이 보편화되는 세상이 도래할 것으로 예상된다. 따라서 인공지능 휴머노이드 로봇에 대한 효율적인 관리의 필요성이 크게 대두될 것으로 예상되며, 또한 인공지 능 휴머노이드 로봇의 개인별 취향 등의 차이, 설치되는 장소, 사용 용도 등에 따른 맞춤형 제어 및 관리의 필 요성이 크게 부각될 것으로 예상된다. 이에 본 출원인은 스마트폰, 태블릿 PC 등의 모바일 디바이스 내지 PC를 통해 인공지능 휴머노이드 로봇에 원격 접속하여 해당 인공지능 휴머노이드 로봇을 효율적으로 제어 및 관리하면서 그 기능을 보다 잘 활용할 수 있도 록 하는 기술로서 본 발명을 제안하게 되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허 제10-2018-0119515호(2018.11.02.공개), “스마트 휴대 기기를 이용한 스마트 기기와 로봇의 개인 맞춤형 서비스 운용 시스템 및 방법” (특허문헌 0002) 한국 등록특허 제10-1141603호(2012.05.17.공고), “다중 주파수 환경에서의 원격 로봇 운용을 위한 원격 통제 장치 및 원격 통제 방법” (특허문헌 0003) 한국 공개특허 제10-2022-0023370호(2022.03.02.공개), “SNS 기반의 소프트웨어 로봇 원격 제어 서비스 시스템 및 방법”"}
{"patent_id": "10-2023-0044384", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시 예는 인공지능 휴머노이드 로봇의 기능을 스마트폰, 태블릿 PC 등의 이동 디바이스 내지 데스크 탑 PC 등의 PC를 통해서 원격으로 접속하여 제어할 수 있게 되며, 이를 위해 인공지능 휴머노이드 로봇의 작동 이나 특정 동작 내지 운행 상태 등이 실시간으로 모니터링 및 제어되기 위한 각종 상태 데이터들이 해당 인공지 능 휴머노이드 로봇으로부터 수집되어 실시간으로 해당 서비스의 운용버에 전달될 수 있도록 하는 인공지능 휴 머노이드 로봇의 원격 관리 제어 시스템 및 그 운용 방법을 제공한다. 또한, 본 발명의 실시 예는 인공지능 휴머노이드 로봇에 대한 원격 관리 및 제어 작용이 해당 서비스를 제공하 는 서버를 통해서 여러 대의 인공지능 휴머노이드 로봇을 대상으로 동시에 이루어질 수 있고, 이를 위해 해당 서비의 제공 서버는 관련 애플리케이션을 모바일앱 및 PC모드로 각각 지원하게 되는 인공지능 휴머노이드 로봇 의 원격 관리 제어 시스템 및 그 운용 방법을 제공한다. 또한, 본 발명의 실시 예는 인공지능 휴머노이드 로봇들을 대상으로 로봇의 상태, 시스템 업데이트, 알림, 음악, 사진, 동영상, 춤추기, 채팅, 스케쥴 등의 기능을 일괄적으로 관리하면서 효율적인 활용이 이루어질 수 있도록 하는 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템 및 그 운용 방법을 제공한다."}
{"patent_id": "10-2023-0044384", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템은, 인공지능 휴머노이드 로봇에 대한 원격 제어 및 관리용의 데이터를 인공지능 휴머노이드 로봇들로부터 수집하기 위한 애플리케이션(이하 “원격 제어/관리 서비스 애플리케이션”이라 함)이 저장되고, 인공지능 휴머노이드 로봇의 원격 제어 및 관리를 위한 원격 제어/관리 프로그램이 탑재되며, 상기 원격 제어/관리 서비스 애플리케이션의 다운로드 및 실행이 이 루어진 인공지능 휴머노이드 로봇별 원격 제어 내지 관리 기능을 수행하는 휴머노이드 로봇 원격 서비스 제공서 버와, 상기 원격 제어/관리 서비스 애플리케이션이 다운로드되어 설치되며, 상기 원격 제어/관리 서비스 애플리 케이션의 실행을 기번으로, 원격 제어 및 관리용의 상태 데이터(이하 “상태 데이터”라 함)를 상기 휴머노이드 로봇 원격 서비스 제공서버에 제공하고, 상기 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어신호를 수신하 는 인공지능 휴머노이드 로봇과, 하나 또는 둘 이상의 상기 인공지능 휴머노이드 로봇과 매칭되며, 해당 인공지 능 휴머노이드 로봇에 대해 상기 휴머노이드 로봇 원격 서비스 제공서버로부터 제공되는 모니터링 정보들을 수 신하여 화면 표시하고, 해당 인공지능 휴머노이드 로봇에 대해 원격 제어신호를 전송하는 사용자 단말기를 포함 할 수 있다. 또한, 상기 인공지능 휴머노이드 로봇은 상기 상태 데이터를 획득하는 복수의 센서와, 상기 센서들로부터 획득되는 상태 데이터를 무선 송출하는 제1 무선통신모듈과, 상기 휴머노이드 로봇 원격 서비스 제공서버의 원 격 제어신호 및 상기 사용자 단말기의 원격 제어신호를 수신하는 제2 무선통신모듈을 포함하고, 상기 휴머노이 드 로봇 원격 서비스 제공서버는, 상기 인공지능 휴머노이드 로봇별 상기 상태 데이터를 해당 인공지능 휴머노 이드 로봇별 사전 부여된 식별정보를 기준으로 매핑하여 저장하되, 상기 인공지능 휴머노이드 로봇의 모델명을 기준으로 그룹화하여 저장하는 데이터베이스 서버와, 상기 데이터베이스 서버에 저장된 상태 데이터들을 대상으 로 하는 동시에 상기 모델명을 기준으로 그룹화된 인공지능 휴머노이드 로봇의 그룹별로 구분하여 그 상태 데이 터들에 대해 딥러닝을 수행하여 해당 인공지능 휴머노이드 로봇의 그룹별 유효 모니터링/관리 데이터를 생성하 여 상기 원격 제어/관리 프로그램, 인공지능 휴머노이드 로봇 및 사용자 단말기 중 적어도 하나에 제공하는 인 공지능모듈을 포함할 수 있다. 또한, 본 발명의 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템은, 상기 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어신호 및 상기 사용자 단말기의 원격 제어신호를 상기 인공지능 휴머노이드 로 봇의 상기 제2 무선통신모듈에 전송하고, 상기 인공지능 휴머노이드 로봇의 상기 제1 무선통신모듈로부터 송출 되는 상기 상태 데이터를 상기 휴머노이드 로봇 원격 서비스 제공서버에 전송하는 무선AP모듈을 더 포함할 수 있다. 또한, 상기 휴머노이드 로봇 원격 서비스 제공서버는 상기 인공지능 휴머노이드 로봇의 그룹별 해당 인공지능 휴머노이드 로봇에 대한 블록코딩 서비스를 제공하기 위한 블록코딩 서비스 시스템을 더 포함하며, 상기 사용자 단말기는 상기 휴머노이드 로봇 원격 서비스 제공서버에 접속하여 상기 블록코딩 서비스 시스템을 통해 운용되 는 블록코딩 서비스 플랫폼에서 상기 인공지능 휴머노이드 로봇의 그룹별 제공되는 블록코딩 서비스를 통해 해 당 인공지능 휴머노이드 로봇에 대한 맞춤형 제어코드 및 제어스케줄을 제작하여 다운로드한 다음, 다운로드한 상기 맞춤형 제어코드 및 제어스케줄에 따라 해당 인공지능 휴머노이드 로봇을 제어하거나 다운로드한 상기 맞 춤형 제어코드 및 제어스케줄을 해당 인공지능 휴머노이드 로봇에 전송하는 작업 중 적어도 하나를 수행하는 것 일 수 있다. 또한, 상기 유효 모니터링/관리 데이터에는 단위 시간당 이동 속도 또는 동작 속도에 따른 고장/이상 경고 정보, 제조년월 및 동작 시간에 따른 팔 관절, 무릎 관절 등 부분별 유지 보수 점검시기 알림정보 중 적어도 하 나가 포함되는 것일 수 있다. 그리고 본 발명의 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템의 운용 방법, 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어/관리 서비스 애플리케이션이 인공지능 휴머노이드 로봇에 다운로드되어 설치되는 단계와, 상기 인공지능 휴머노이드 로봇에서 원격 제어/관리 서비스 애플리케이션의 실행을 기반으로 원격 제어 및 관리용의 상태 데이터(이하 “상태 데이터”라 함)를 상기 휴머노이드 로봇 원격 서비스 제공서버 에 제공하는 단계와, 상기 휴머노이드 로봇 원격 서비스 제공서버에 탑재된 원격 제어/관리 프로그램에서 상기 인공지능 휴머노이드 로봇으로부터 제공되는 상기 상태 데이터를 토대로 모니터링 정보를 생성하여 상기 인공지 능 휴머노이드 로봇에 대한 사용자의 사용자 단말기에 전송하는 단계와, 상기 인공지능 휴머노이드 로봇에서 무 선 AP모듈을 통해 상기 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어신호를 수신하거나 사용자 단말기의 원격 제어신호를 수신하는 단계와, 상기 인공지능 휴머노이드 로봇이 수신되는 원격 제어신호에 따라 제어되면 서 해당 원격 제어신호에 기반하는 기능을 발휘하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0044384", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 인공지능 휴머노이드 로봇의 기능을 스마트폰, 태블릿 PC 등의 이동 디바이스 내 지 데스크탑 PC 등의 PC를 통해서 원격으로 접속하여 제어할 수 있게 되고, 이를 위해 인공지능 휴머노이드 로 봇의 작동이나 특정 동작 내지 운행 상태 등이 실시간으로 모니터링 및 제어되기 위한 각종 상태 데이터들이 해 당 인공지능 휴머노이드 로봇으로부터 수집되어 실시간으로 해당 서비스의 운용버에 전달될 수 있게 된다. 또한, 인공지능 휴머노이드 로봇에 대한 원격 관리 및 제어 작용이 해당 서비스를 제공하는 서버를 통해서 여러 대의 인공지능 휴머노이드 로봇을 대상으로 동시에 이루어질 수 있고, 이를 위해 해당 서비의 제공 서버는 관련 애플리케이션을 모바일앱 및 PC모드로 각각 지원하게 된다. 또한, 인공지능 휴머노이드 로봇들을 대상으로 로봇의 상태, 시스템 업데이트, 알림, 음악, 사진, 동영상, 춤추 기, 채팅, 스케쥴 등의 기능을 일괄적으로 관리하면서 효율적인 활용이 이루어질 수 있게 된다."}
{"patent_id": "10-2023-0044384", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 본 발명에 관한 상세한 설명들은 본 발명이 실시될 수 있는 실시 예이고 해당 실시 예의 예시로써 도시 된 첨부 도면을 참조한다. 이들 실시 예는 당업자가 본 발명의 실시에 충분하도록 상세히 설명된다. 본 발명의 다양한 실시 예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 여기에 기재되어 있는 특정 형상, 구조 및 특성은 일 실시 예에 관련하여 본 발명의 사상 및 범위를 벗어나지 않으면서 다른 실 시 예로 구현될 수 있다. 또한, 각각의 기재된 실시 예 내의 개별 구성요소의 위치 또는 배치는 본 발명의 사상 및 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서 후술되는 상세한 설명은 한정적인 의미로서 취하려는 것이 아니며, 본 발명의 범위는 적절하게 설명된다 면 그 청구항들이 주장하는 것과 균등한 모든 범위와 더불어 첨부된 청구항에 의해서만 한정된다. 도면에서 유 사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유사한 기능을 지칭한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 발명에서 전체에서 어떤 부분이 어떤 구성요소를 “포함”한다고 할 때, 이는 특별히 반대되는 기재가 없는 한, 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 “…부”, ＂…모듈“ 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 도 1 내지 도 3을 참조하여 본 발명의 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템 및 그 운용 방법에 대해 설명한다. 먼저 도 1 및 도 2를 참조하여 본 발명의 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템에 대해 설명한다. 도 1은 본 발명의 일 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템을 예시한 블록 구성도 이고, 도 2는 본 발명의 일 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템에서 블록코딩 서비스 사스템의 세부 구성을 예시한 블록 구성도이다.도시된 바와 같이, 본 발명의 일 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템은, 휴머노 이드 로봇 원격 서비스 제공서버, 인공지능 휴머노이드 로봇 및 사용자 단말기를 포함하여 구성 될 수 있다. 또한, 본 발명의 일 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템은 무선AP 모듈을 더 포함하여 구성될 수 있다. 휴머노이드 로봇 원격 서비스 제공서버는 인공지능 휴머노이드 로봇에 대한 원격 제어 및 관리용의 데이터 를 인공지능 휴머노이드 로봇들로부터 수집하기 위한 애플리케이션(110, 이하 “원격 제어/관리 서비스 애플리 케이션”이라 함)이 저장되고, 인공지능 휴머노이드 로봇의 원격 제어 및 관리를 위한 원격 제어/관리 프로그램 이 탑재된다. 그리고 휴머노이드 로봇 원격 서비스 제공서버는 원격 제어/관리 서비스 애플리케이션 의 다운로드 및 실행이 이루어진 인공지능 휴머노이드 로봇별 원격 제어 내지 관리 기능을 수행한다. 인공지능 휴머노이드 로봇은 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어/관리 서비스 애플리 케이션이 다운로드되어 설치되며, 원격 제어/관리 서비스 애플리케이션의 실행을 기번으로, 원격 제 어 및 관리용의 상태 데이터(이하 “상태 데이터”라 함)를 휴머노이드 로봇 원격 서비스 제공서버에 제공 한다. 또한, 인공지능 휴머노이드 로봇은 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어신호를 수신한다. 사용자 단말기는 하나 또는 둘 이상의 인공지능 휴머노이드 로봇과 매칭되며, 해당 인공지능 휴머노 이드 로봇에 대해 휴머노이드 로봇 원격 서비스 제공서버로부터 제공되는 모니터링 정보들을 수신하 여 화면 표시한다. 또한, 사용자 단말기는 해당 인공지능 휴머노이드 로봇에 대해 원격 제어신호를 전송한다. 부연 설명하면, 상기 사용자 단말기는 스마트폰, 태블릿 PC 등의 모바일 디바이스 및 PC를 포함하는 개념 이며, 인공지능 휴머노이드 로봇의 상기 상태 데이터는 해당 인공지능 휴머노이드 로봇을 통해 휴머 노이드 로봇 원격 서비스 제공서버에 직접 제공되는 방식일 수 있고, 이와 달리 사용자 단말기의 중 계 기능을 통해 휴머노이드 로봇 원격 서비스 제공서버에 제공되는 방식일 수도 있다. 이와 마찬가지로 원 격 제어/관리 서비스 애플리케이션의 다운로드 또한 해당 인공지능 휴머노이드 로봇이 휴머노이드 로 봇 원격 서비스 제공서버에서 직접 다운로드하는 방식일 수 있고, 이와 달리 사용자 단말기의 중계 기능을 통해 인공지능 휴머노이드 로봇에 다운로드되는 방식일 수 있다. 그리고 인공지능 휴머노이드 로봇은 상기 상태 데이터를 획득하는 복수의 센서(210-1∼210-n)와, 이러한 센서(210-1∼210-n)들로부터 획득되는 상태 데이터를 무선 송출하는 제1 무선통신모듈과, 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어신호 및 사용자 단말기의 원격 제어신호를 수신하는 제2 무선통신 모듈을 포함하여 구성된다. 그리고 휴머노이드 로봇 원격 서비스 제공서버는, 인공지능 휴머노이드 로봇별 상기 상태 데이터를 해당 인공지능 휴머노이드 로봇별 사전 부여된 식별정보를 기준으로 매핑하여 저장하되, 인공지능 휴머노 이드 로봇의 모델명을 기준으로 그룹화하여 저장하는 데이터베이스 서버와, 이러한 데이터베이스 서 버에 저장된 상태 데이터들을 대상으로 하는 동시에 상기 모델명을 기준으로 그룹화된 인공지능 휴머노이 드 로봇의 그룹별로 구분하여 그 상태 데이터들에 대해 딥러닝을 수행하여 해당 인공지능 휴머노이드 로봇 의 그룹별 유효 모니터링/관리 데이터를 생성하여 원격 제어/관리 프로그램, 인공지능 휴머노이드 로 봇 및 사용자 단말기 중 적어도 하나에 제공하는 인공지능모듈을 포함하여 구성될 수 있다. 무선AP모듈은 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어신호 및 사용자 단말기의 원격 제어신호를 인공지능 휴머노이드 로봇의 제2 무선통신모듈에 전송하고, 인공지능 휴머노이드 로봇 의 제1 무선통신모듈로부터 송출되는 상기 상태 데이터를 상기 휴머노이드 로봇 원격 서비스 제공서 버에 전송하는 기능을 수행한다. 또한, 휴머노이드 로봇 원격 서비스 제공서버는 인공지능 휴머노이드 로봇의 그룹별 해당 인공지능 휴머노이드 로봇에 대한 블록코딩 서비스를 제공하기 위한 블록코딩 서비스 시스템을 더 포함할 수 있다. 이에 따라 사용자 단말기는 휴머노이드 로봇 원격 서비스 제공서버에 접속하여 블록코딩 서비스 시스 템을 통해 운용되는 블록코딩 서비스 플랫폼에서 인공지능 휴머노이드 로봇의 그룹별 제공되는 블록코딩 서비스를 통해 해당 인공지능 휴머노이드 로봇에 대한 맞춤형 제어코드 및 제어스케줄을 제작하 여 다운로드한 다음, 다운로드한 상기 맞춤형 제어코드 및 제어스케줄에 따라 해당 인공지능 휴머노이드 로봇을 제어하거나 다운로드한 상기 맞춤형 제어코드 및 제어스케줄을 해당 인공지능 휴머노이드 로봇에 전송하는 작업 중 적어도 하나를 수행하는 것일 수 있다. 이러한 휴머노이드 로봇 원격 서비스 제공서버의 블록코딩 서비스를 통해서 인공지능 휴머노이드 로봇의 사용자들은 각각 사용자 자신의 인공지능 휴머노이드 로봇에 최적화된 제어코드 및 제어스케줄을 블록코딩의 직 관적인 코딩 방식을 통해 용이하게 제작 후 해당 인공지능 휴머노이드 로봇에 탑재시켜 해당 인공지능 휴머노이 드 로봇을 맞춤형으로 작동시킬 수 있게 된다. 그리고 블록코딩 서비스 시스템은 제1 데이터베이스 서버, 코드 변환부, 제2 데이터베이스 서버 및 제어부를 포함하여 구성될 수 있다. 제1 데이터베이스 서버는 휴머노이드 로봇을 제조하는 회사들의 서버로부터 전송되는 휴머노이드 로봇별 제어코드들을 해당 휴머노이드 로봇 제조사의 상호명 및 해당 휴머노이드 로봇의 모델명을 기준으로 매핑하여 저장한다. 코드 변환부는 제1 데이터베이스 서버의 상기 제어코드들을 사전 정의된 표준 명령어로 코딩한 블록 코딩용 제어코드로 각각 변환한다. 제2 데이터베이스 서버는 코드 변환부에서 변환된 상기 블록코딩용 제어코드들을 각각 해당 휴머노이 드 로봇 제조사의 상호명 및 해당 휴머노이드 로봇의 모델명을 기준으로 매핑하여 저장한다. 제어부는 제2 데이터베이스 서버의 블록코딩용 제어코드를 블록코딩 서비스 플랫폼에 제공하며, 블록코딩 서비스 플랫폼을 통한 사용자의 서비스 요청신호에 따라 상기 블록코딩용 제어코드들 중 선택되 는 블록코딩용 제어코드를 조합하여 실행 코딩 파일을 생성 후 생성된 실행 코딩 파일을 원격 제어/관리 프로그 램에 제공히는 기능을 수행한다. 그리고 상술한 유효 모니터링/관리 데이터에는 단위 시간당 이동 속도 또는 동작 속도에 따른 고장/이상 경고 정보, 제조년월 및 동작 시간에 따른 팔 관절, 무릎 관절 등 부분별 유지 보수 점검시기 알림정보 중 적어도 하 나가 포함되는 것일 수 있다. 다음은 도 3을 참조하여 본 발명의 일 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템의 운 용 방법에 대해 설명한다. 도 3은 본 발명의 일 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템의 운용 방법을 예시한 플로우챠트이다. 도시된 바와 같이, 단계(S110)에서, 휴머노이드 로봇 원격 서비스 제공서버의 원격 제어/관리 서비스 애플리케 이션이 인공지능 휴머노이드 로봇에 다운로드되어 설치된다. 단계(S120)에서, 상기 인공지능 휴머노이드 로봇에서 원격 제어/관리 서비스 애플리케이션의 실행을 기반으로 원격 제어 및 관리용의 상태 데이터(이하 “상태 데이터”라 함)를 상기 휴머노이드 로봇 원격 서비스 제공서버 에 제공된다. 그리고 단계(S110) 내지 단계(S120)에서, 상기 원격 제어/관리 서비스 애플리케이션의 상기 인공지능 휴머노이 드 로봇에 대한 다운로드는 상기 인공지능 휴머노이드 로봇이 상기 휴머노이드 로봇 원격 서비스 제공서버로부 터 직접 다운로드하는 방식일 수 있고, 이와 달리 후술되는 사용자 단말기의 중계 기능을 통해 인공지능 휴머노 이드 로봇에 다운로드되는 방식일 수 있다. 또한, 상기 인공지능 휴머노이드 로봇의 상기 상태 데이터는 해당 인공지능 휴머노이드 로봇을 통해 상기 휴머노이드 로봇 원격 서비스 제공서버에 직접 제공되는 방식일 수 있고, 이와 달리 사용자 단말기의 중계 기능을 통해 휴머노이드 로봇 원격 서비스 제공서버에 제공되는 방식일 수도 있다. 또한, 사용자 단말기는 스마트폰, 태블릿 PC 등의 모바일 디바이스 및 PC를 포함하는 개념이다. 단계(S130)에서, 상기 휴머노이드 로봇 원격 서비스 제공서버에 탑재된 원격 제어/관리 프로그램에서 상기 인공 지능 휴머노이드 로봇으로부터 제공되는 상기 상태 데이터를 토대로 모니터링 정보를 생성하여 상기 인공지능 휴머노이드 로봇에 대한 사용자의 사용자 단말기에 전송한다. 단계(S140)에서, 상기 인공지능 휴머노이드 로봇에서 무선 AP모듈을 통해 상기 휴머노이드 로봇 원격 서비스 제 공서버의 원격 제어신호를 수신하거나 사용자 단말기의 원격 제어신호를 수신한다.단계(S150)에서, 상기 인공지능 휴머노이드 로봇이 수신되는 원격 제어신호에 따라 제어되면서 해당 원격 제어 신호에 기반하는 기능을 발휘한다. 상술한 구성에 의해서, 인공지능 휴머노이드 로봇의 기능을 스마트폰, 태블릿 PC 등의 이동 디바이스 내지 데스 크탑 PC 등의 PC를 통해서 원격으로 접속하여 제어할 수 있게 되며, 이를 위해 인공지능 휴머노이드 로봇의 작 동이나 특정 동작 내지 운행 상태 등이 실시간으로 모니터링 및 제어되기 위한 각종 상태 데이터들이 해당 인공 지능 휴머노이드 로봇으로부터 수집되어 실시간으로 휴머노이드 로봇 원격 서비스 제공서버에 제공된다. 그리고 상술한 인공지능 휴머노이드 로봇에 대한 원격 관리 및 제어 작용이 해당 서비스를 제공하는 상기 휴머 노이드 로봇 원격 서비스 제공서버를 통해서 여러 대의 인공지능 휴머노이드 로봇을 대상으로 동시에 이루어질 수 있고, 이를 위해 상기 휴머노이드 로봇 원격 서비스 제공서버는 해당 애플리케이션을 모바일앱 및 PC모드로 각각 지원하게 된다. 또한 인공지능 휴머노이드 로봇들을 대상으로 로봇의 상태, 시스템 업데이트, 알림, 음악, 사진, 동영상, 춤추 기, 채팅, 스케쥴 등의 기능을 일괄적으로 관리하면서 효율적인 활용을 할 수 있게 된다. 이상과 같이 본 설명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시 예 및 도면에 의해 설명 되었으나, 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시 예에 한 정되는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서 본 발명의 사상은 설명된 실시 예에 국한되어 정하여 저서는 안되며, 후술되는 청구범위뿐만 아니라 이 청구범위와 균등하거나 등가적인 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2023-0044384", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템을 예시한 블록 구성도 도 2는 본 발명의 일 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템에서 블록코딩 서비스 사스템의 세부 구성을 예시한 블록 구성도 도 3은 본 발명의 일 실시 예에 따른 인공지능 휴머노이드 로봇의 원격 관리 제어 시스템의 운용 방법을 예시한 플로우챠트"}
