{"patent_id": "10-2022-0142282", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0065335", "출원번호": "10-2022-0142282", "발명의 명칭": "인공지능 기반의 지능형 감성 완구 서비스 제공 시스템", "출원인": "주식회사 모몽스튜디오", "발명자": "김경욱"}}
{"patent_id": "10-2022-0142282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "캐릭터 완구;상기 캐릭터 완구에 탈착 가능하게 설치되고, 사용자로부터 음성신호를 입력 받아 인식하되, 인식된 음성신호의내용에 미리 정의된 호출어가 포함되어 있으면, 음성인식 대기모드로 진입하고, 음성인식 대기모드로 진입한 이후에 입력되는 음성신호를 외부로 전송하고, 전송된 음성신호에 따른 응답데이터를 외부로부터 수신하여 음성으로 출력하는 인공지능 모듈; 및상기 인공지능 모듈에서 전송한 음성신호를 수신하여 인식하고, 인식된 음성신호의 내용을 분석하고, 분석 결과에 따라 인공지능 기반의 기본 정보 서비스 및 오디오 콘텐츠 서비스 중 어느 하나의 서비스를 제공하기 위한응답데이터를 생성하여 상기 인공지능 모듈로 전송하는 클라우드 서버를 포함하는 것을 특징으로 하는 인공지능기반의 지능형 감성 완구 서비스 제공 시스템."}
{"patent_id": "10-2022-0142282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 캐릭터 완구는, 인형;상기 인형에 입히는 의류 및 상기 의류에 부착되는 장식도구 중 적어도 어느 하나를 포함하는 액세서리; 및상기 액세서리에 부착 또는 인쇄된 2차원 식별코드를 구비하는 서비스 카드를 포함하고,상기 2차원 식별코드는 상기 클라우드 서버에 접속하기 위한 URL 정보를 포함하며, 상기 URL 정보를 통해 상기기본 정보 서비스 및 오디오 콘텐츠 서비스 중 어느 하나의 서비스를 제공하는 것을 특징으로 하는 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템."}
{"patent_id": "10-2022-0142282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 인형은,상기 인형의 몸체 내부에 형성되어 개구부를 통해 상기 인공지능 모듈이 삽입되어 내부에 안착되는 포켓; 및상기 개구부를 폐쇄하여 상기 포켓의 내부에 안착된 상기 인공지능 모듈이 외부로 이탈되지 않도록 상기 개구부를 잠그는 잠금 수단을 포함하고,상기 잠금 수단은 지퍼, 단추, 벨크로 중 적어도 하나를 포함하는 것을 특징으로 하는 인공지능 기반의 지능형감성 완구 서비스 제공 시스템."}
{"patent_id": "10-2022-0142282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 인공지능 모듈은,하우징;무선 통신을 통해 상기 클라우드 서버 및 휴대통신단말 중 적어도 하나와 통신하기 위한 디바이스 무선 통신 모공개특허 10-2024-0065335-3-듈; 상기 하우징에 설치되고, 사용자로부터 아날로그의 음성신호를 입력 받아 디지털의 음성데이터로 변환하는 디바이스 마이크 모듈;상기 하우징에 설치되고, 상기 디바이스 무선 통신 모듈을 통해 상기 클라우드 서버로부터 수신되는 응답데이터를 오디오 신호로 변환하여 출력하는 디바이스 스피커 모듈;상기 하우징에 탑재되고, 상기 디바이스 마이크 모듈을 통해 변환된 음성데이터를 텍스트데이터로 변환하고, 변환된 텍스트데이터에 상기 호출어가 포함되어 있는지 여부를 판단하고, 변환된 텍스트데이터에 상기 호출어가포함된 경우 음성인식 대기모드로 진입하고, 음성인식 대기모드로 진입한 상태에서 상기 디바이스 마이크 모듈을 통해 입력되는 음성데이터를 텍스트데이터로 변환하여 상기 디바이스 무선 통신 모듈로 전달하는 인공지능프로세서;상기 하우징의 외부에 설치되고, 음성인식 대기모드로의 직접 진입, 상기 디바이스 스피커 모듈의 음량조절, 및오디오 신호의 재생 기능을 각각 제공하기 위해 각각의 키 값을 입력 받는 다수의 물리 키 버튼 모듈; 및상기 물리 키 버튼 모듈을 통해 입력되는 키 값에 따라 상기 디바이스 스피커 모듈의 음량조절, 및 오디오 신호의 재생 기능을 각각 제어하는 컨트롤러를 포함하는 것을 특징으로 하는 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템."}
{"patent_id": "10-2022-0142282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 클라우드 서버는,상기 인공지능 모듈로부터 수신되는 텍스트데이터에 대한 자연어 처리를 통해 텍스트데이터에 대한 의미를 분석하는 음성 의미 분석부; 및상기 음성 의미 분석부를 통한 의미 분석 결과와 매칭되는 응답데이터를 생성하되, 의미 분석 결과와 매칭되는응답데이터가 없는 경우 미리 준비된 음악 또는 음향을 제공하고, 의미 분석 결과와 매칭되는 응답데이터가 있는 경우 날씨정보, 사칙연산, 언어번역, 기념일관리, 정보검색, 알람, 메시지전달 중 적어도 하나의 기능을 포함하는 기본 정보 서비스 또는 동화 서비스 및 동요 서비스 중 적어도 하나를 포함하는 오디오 콘텐츠 서비스를제공하는 인공지능 콘텐츠 제공부를 포함하는 것을 특징으로 하는 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템."}
{"patent_id": "10-2022-0142282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4 항에 있어서,상기 인형은, 상기 인형의 몸체 내부에 형성되어 개구부를 통해 상기 인공지능 모듈이 삽입되어 내부에 안착되는 공간과, 상기 물리 키 버튼 모듈에 포함된 각각의 키 버튼을 외부에 노출시키기 위한 버튼 홀이 구비된 포켓; 및상기 개구부를 폐쇄하여 상기 포켓의 내부에 안착된 상기 인공지능 모듈이 외부로 이탈되지 않도록 상기 개구부를 잠그는 잠금 수단을 포함하고,상기 잠금 수단은 지퍼, 단추, 벨크로 중 적어도 하나를 포함하고,상기 캐릭터 완구는,상기 인형의 외형부 중 어느 한 부위와 상기 포켓의 내부 사이를 연결하는 제1 케이블, 상기 제1 케이블의 일측과 연결되고 상기 인형의 외형부 중 어느 한 부위에 설치된 마이크 소자, 및 상기 제1 케이블의 타측과 연결된제1 커넥터를 포함하는 인형 마이크 모듈; 및상기 인형의 외형부 중 어느 한 부위와 상기 포켓의 내부 사이를 연결하는 제2 케이블, 상기 제2 케이블의 일측공개특허 10-2024-0065335-4-과 연결되고 상기 인형의 외형부 중 어느 한 부위에 설치된 스피커 소자, 및 상기 제2 케이블의 타측과 연결된제2 커넥터를 포함하는 인형 스피커 모듈을 포함하는 것을 특징으로 하는 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템."}
{"patent_id": "10-2022-0142282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 캐릭터 완구는,상기 포켓의 내부 중 상기 제1 커넥터를 둘러싸도록 형성된 제1 마그네틱;상기 포켓의 내부 중 상기 제2 커넥터를 둘러싸도록 형성된 제2 마그네틱; 및상기 포켓의 내부 중 버튼 홀을 각각 둘러싸도록 형성된 제3 마그네틱을 더 포함하고,상기 하우징은,상기 디바이스 마이크 모듈과 연결된 마이크 커넥터;상기 디바이스 스피커 모듈과 연결된 스피커 커넥터;상기 마이크 커넥터를 둘러싸도록 형성된 제4 마그네틱;상기 스피커 커넥터를 둘러싸도록 형성된 제5 마그네틱; 및상기 물리 키 버튼 모듈에 포함된 각각의 키 버튼을 각각 둘러싸도록 형성된 제6 마그네틱을 더 포함하고,상기 제1 커넥터와 상기 마이크 커넥터 간은 물리적 결합에 의해 전기적으로 연결되고, 상기 제1 마그네틱과 상기 제4 마그네틱 간의 자성에 의해 물리적으로 고정되고,상기 제2 커넥터와 상기 스피커 커넥터 간은 물리적 결합에 의해 전기적으로 연결되고, 상기 제2 마그네틱과 상기 제5 마그네틱 간의 자성에 의해 물리적으로 고정되고,상기 키 버튼이 상기 버튼 홀을 관통하여 상기 인형의 외부로 노출되되, 상기 키 버튼과 상기 버튼 홀 간은 상기 제3 마그네틱과 상기 제6 마그네틱 간의 자성에 의해 물리적으로 고정되는 것을 특징으로 하는 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템."}
{"patent_id": "10-2022-0142282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4 항에 있어서,상기 지능형 감성 완구 서비스 제공 시스템은, 휴대통신단말에 설치되고, 휴대통신단말과의 무선 통신을 통해 상기 인공지능 모듈과 페어링되어 지능형 감성완구 서비스에 대한 확장 서비스를 지원하기 위한 어플리케이션을 더 포함하고,상기 어플리케이션은,사용자로부터 적어도 하나의 음성신호를 입력 받고, 입력된 음성신호에 포함된 음성정보를 상기 인공지능 모듈로 등록하기 위한 사용자 음성정보 등록부;사용자의 보호자로부터 적어도 하나의 음성신호를 입력 받고, 입력된 음성신호에 포함된 음성정보를 상기 인공지능 모듈로 등록하기 위한 보호자 음성정보 등록부; 및보호자의 음성정보 등록 시, 상기 사용자 음성정보 등록부를 통해 등록되는 음성정보를 입력음성정보로 설정하고, 상기 보호자 음성정보 등록부를 통해 등록되는 음성정보를 응답음성정보로 설정하여 상기 인공지능 모듈로등록하기 위한 음성정보 설정부를 포함하고,상기 인공지능 프로세서는,상기 음성정보 설정부를 통해 설정된 상기 입력음성정보와 상기 응답음성정보를 한 세트의 정보단위로 각각 저공개특허 10-2024-0065335-5-장하고, 상기 입력음성정보가 입력되면 한 세트의 정보단위로 매칭되어 있는 상기 응답음성정보가 출력되도록제어하는 것을 특징으로 하는 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템."}
{"patent_id": "10-2022-0142282", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템에 관한 것으로, 해결하고자 하는 과제는 유아 동을 대상으로 사회 환경 및 활동의 변화에 따라 삶과 밀접하게 마주치는 자연스러운 환경을 구현함으로써, 현실 적인 부정적 발달 결과를 최소화하면서 긍정적 발달을 가능하게 하는 스마트 기술을 활용하여 유아동의 정서적인 (뒷면에 계속)"}
{"patent_id": "10-2022-0142282", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템에 관한 것이다."}
{"patent_id": "10-2022-0142282", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능이 발전함에 따라 인공지능을 활용한 서비스가 고도화 및 다각화되고 있다. 사람의 언어를 학습하고 이 해하는 인공지능 스피커는 사용자와 의사소통 및 상호작용하여 사용자가 원하거나 원할 것으로 예상되는 정보를 적절한 상황에 맞춰 제공할 수 있다. 예를 들어, 인공지능 스피커는 날씨, 시간, 뉴스와 같은 기본적인 정보를 실 시간으로 제공하는 것뿐만 아니라 사용자의 취향에 따라 복잡한 단계 없이 쇼핑 및 결제 서비스를 제공하고 사용자의 일정에 맞춰 택시와 같은 교 통수단을 예약하는 서비스를 제공하고 있다. 인공지능 기술은 콘텐츠 제공 방식에도 적용되고 있다. 사용자가 선택하거나 시청한 콘텐츠의 히스토리를 기반 으로 사용자에게 맞춤형 콘텐츠가 제시되는 방식은 보편화되고 있다. 현재에는 사용자에게 콘텐츠를 일 방향으로 제공하는 방식에서 벗어나 사용자와 콘텐츠 제공자가 서로 상호 작 용하면서 콘텐츠가 유동적으로 변형되면서 제공되는 다양한 기법들도 등장하고 있다. 사람의 역할을 대체하기 위한 인공지능 로봇도 빅데이터, 인식기술, 센서의 고도화 등에 따라 응용 분야를 넓히고 있다. 한편, 코로나 19를 계기로 비대면 사회활동이라는 생활의 디지털 전환이라는 커다란 변화가 급속도로 진행 되었 다. 이로 인해 디지털 원주민 세대인 유아동들에게 교육 패러다임 역시 디지털 전환이라는 산업 대전환 혁신의 변화 속에 스마트 기술의 필요성이 관련 산업 전반에 강조되고 있으며, 기술에 순응하고 디지털 삶 속에 일상을 반영할 수 있는 유아동 디지털 도구의 제공과 지능형 서비스의 필요성이 대두되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-2073979호(등록일자: 2020년01월30일) (특허문헌 0002) 등록특허공보 제10-2134189호(등록일자: 2020년07월09일) (특허문헌 0003) 공개특허공보 제10-2021-0089416호(공개일자: 2021년07월16일)"}
{"patent_id": "10-2022-0142282", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는, 유아동을 대상으로 사회 환경 및 활동의 변화에 따라 삶과 밀접하게 마주치는 자연스러운 환경을 구현함으로써, 현실적인 부정적 발달 결과를 최소화하면서 긍정적 발달을 가능하게 하는 스마트 기술을 활용하여 유아동의 정서적인 교육 방법과 사회 상호작용에 도움이 되는 지능형 서비스를 제공하는 인공지능 기 반의 지능형 감성 완구 서비스 제공 시스템을 제공한다."}
{"patent_id": "10-2022-0142282", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템은, 캐릭터 완구; 상기 캐릭터 완구에 탈착 가능하게 설치되고, 사용자로부터 음성신호를 입력 받아 인식하되, 인식된 음성신호의 내용에 미리 정의된 호출어가 포함되어 있으면, 음성인식 대기모드로 진입하고, 음성인식 대기모드로 진입한 이후에 입력되 는 음성신호를 외부로 전송하고, 전송된 음성신호에 따른 응답데이터를 외부로부터 수신하여 음성으로 출력하는인공지능 모듈; 및 상기 인공지능 모듈에서 전송한 음성신호를 수신하여 인식하고, 인식된 음성신호의 내용을 분석하고, 분석 결과에 따라 인공지능 기반의 기본 정보 서비스 및 오디오 콘텐츠 서비스 중 어느 하나의 서비 스를 제공하기 위한 응답데이터를 생성하여 상기 인공지능 모듈로 전송하는 클라우드 서버를 포함한다. 또한, 상기 캐릭터 완구는, 인형; 상기 인형에 입히는 의류 및 상기 의류에 부착되는 장식도구 중 적어도 어느 하나를 포함하는 액세서리; 및 상기 액세서리에 부착 또는 인쇄된 2차원 식별코드를 구비하는 서비스 카드를 포 함하고, 상기 2차원 식별코드는 상기 클라우드 서버에 접속하기 위한 URL 정보를 포함하며, 상기 URL 정보를 통 해 상기 기본 정보 서비스 및 오디오 콘텐츠 서비스 중 어느 하나의 서비스를 제공할 수 있다. 또한, 상기 인형은, 상기 인형의 몸체 내부에 형성되어 개구부를 통해 상기 인공지능 모듈이 삽입되어 내부에 안착되는 포켓; 및 상기 개구부를 폐쇄하여 상기 포켓의 내부에 안착된 상기 인공지능 모듈이 외부로 이탈되지 않도록 상기 개구부를 잠그는 잠금 수단을 포함하고, 상기 잠금 수단은 지퍼, 단추, 벨크로 중 적어도 하나를 포함할 수 있다. 또한, 상기 인공지능 모듈은, 하우징; 무선 통신을 통해 상기 클라우드 서버 및 휴대통신단말 중 적어도 하나와 통신하기 위한 디바이스 무선 통신 모듈; 상기 하우징에 설치되고, 사용자로부터 아날로그의 음성신호를 입력 받아 디지털의 음성데이터로 변환하는 디바이스 마이크 모듈; 상기 하우징에 설치되고, 상기 디바이스 무선 통 신 모듈을 통해 상기 클라우드 서버로부터 수신되는 응답데이터를 오디오 신호로 변환하여 출력하는 디바이스 스피커 모듈; 상기 하우징에 탑재되고, 상기 디바이스 마이크 모듈을 통해 변환된 음성데이터를 텍스트데이터로 변환하고, 변환된 텍스트데이터에 상기 호출어가 포함되어 있는지 여부를 판단하고, 변환된 텍스트데이터에 상 기 호출어가 포함된 경우 음성인식 대기모드로 진입하고, 음성인식 대기모드로 진입한 상태에서 상기 디바이스 마이크 모듈을 통해 입력되는 음성데이터를 텍스트데이터로 변환하여 상기 디바이스 무선 통신 모듈로 전달하는 인공지능 프로세서; 상기 하우징의 외부에 설치되고, 음성인식 대기모드로의 직접 진입, 상기 디바이스 스피커 모듈의 음량조절, 및 오디오 신호의 재생 기능을 각각 제공하기 위해 각각의 키 값을 입력 받는 다수의 물리 키 버튼 모듈; 및 상기 물리 키 버튼 모듈을 통해 입력되는 키 값에 따라 상기 디바이스 스피커 모듈의 음량조절, 및 오디오 신호의 재생 기능을 각각 제어하는 컨트롤러를 포함할 수 있다. 또한, 상기 클라우드 서버는, 상기 인공지능 모듈로부터 수신되는 텍스트데이터에 대한 자연어 처리를 통해 텍 스트데이터에 대한 의미를 분석하는 음성 의미 분석부; 및 상기 음성 의미 분석부를 통한 의미 분석 결과와 매 칭되는 응답데이터를 생성하되, 의미 분석 결과와 매칭되는 응답데이터가 없는 경우 미리 준비된 음악 또는 음 향을 제공하고, 의미 분석 결과와 매칭되는 응답데이터가 있는 경우 날씨정보, 사칙연산, 언어번역, 기념일관리, 정보검색, 알람, 메시지전달 중 적어도 하나의 기능을 포함하는 기본 정보 서비스 또는 동화 서비 스 및 동요 서비스 중 적어도 하나를 포함하는 오디오 콘텐츠 서비스를 제공하는 인공지능 콘텐츠 제공부를 포 함할 수 있다. 또한, 상기 인형은, 상기 인형의 몸체 내부에 형성되어 개구부를 통해 상기 인공지능 모듈이 삽입되어 내부에 안착되는 공간과, 상기 물리 키 버튼 모듈에 포함된 각각의 키 버튼을 외부에 노출시키기 위한 버튼 홀이 구비 된 포켓; 및 상기 개구부를 폐쇄하여 상기 포켓의 내부에 안착된 상기 인공지능 모듈이 외부로 이탈되지 않도록 상기 개구부를 잠그는 잠금 수단을 포함하고, 상기 잠금 수단은 지퍼, 단추, 벨크로 중 적어도 하나를 포함하고, 상기 캐릭터 완구는, 상기 인형의 외형부 중 어느 한 부위와 상기 포켓의 내부 사이를 연결하는 제1 케이블, 상기 제1 케이블의 일측과 연결되고 상기 인형의 외형부 중 어느 한 부위에 설치된 마이크 소자, 및 상 기 제1 케이블의 타측과 연결된 제1 커넥터를 포함하는 인형 마이크 모듈; 및 상기 인형의 외형부 중 어느 한 부위와 상기 포켓의 내부 사이를 연결하는 제2 케이블, 상기 제2 케이블의 일측과 연결되고 상기 인형의 외형부 중 어느 한 부위에 설치된 스피커 소자, 및 상기 제2 케이블의 타측과 연결된 제2 커넥터를 포함하는 인형 스피 커 모듈을 포함할 수 있다. 또한, 상기 캐릭터 완구는, 상기 포켓의 내부 중 상기 제1 커넥터를 둘러싸도록 형성된 제1 마그네틱; 상기 포 켓의 내부 중 상기 제2 커넥터를 둘러싸도록 형성된 제2 마그네틱; 및 상기 포켓의 내부 중 버튼 홀을 각각 둘 러싸도록 형성된 제3 마그네틱을 더 포함하고, 상기 하우징은, 상기 디바이스 마이크 모듈과 연결된 마이크 커 넥터; 상기 디바이스 스피커 모듈과 연결된 스피커 커넥터; 상기 마이크 커넥터를 둘러싸도록 형성된 제4 마그 네틱; 상기 스피커 커넥터를 둘러싸도록 형성된 제5 마그네틱; 및 상기 물리 키 버튼 모듈에 포함된 각각의 키 버튼을 각각 둘러싸도록 형성된 제6 마그네틱을 더 포함하고, 상기 제1 커넥터와 상기 마이크 커넥터 간은 물리 적 결합에 의해 전기적으로 연결되고, 상기 제1 마그네틱과 상기 제4 마그네틱 간의 자성에 의해 물리적으로 고 정되고, 상기 제2 커넥터와 상기 스피커 커넥터 간은 물리적 결합에 의해 전기적으로 연결되고, 상기 제2 마그네틱과 상기 제5 마그네틱 간의 자성에 의해 물리적으로 고정되고, 상기 키 버튼이 상기 버튼 홀을 관통하여 상 기 인형의 외부로 노출되되, 상기 키 버튼과 상기 버튼 홀 간은 상기 제3 마그네틱과 상기 제6 마그네틱 간의 자성에 의해 물리적으로 고정될 수 있다. 또한, 상기 지능형 감성 완구 서비스 제공 시스템은, 휴대통신단말에 설치되고, 휴대통신단말과의 무선 통신을 통해 상기 인공지능 모듈과 페어링되어 지능형 감성 완구 서비스에 대한 확장 서비스를 지원하기 위한 어플리케 이션을 더 포함하고, 상기 어플리케이션은, 사용자로부터 적어도 하나의 음성신호를 입력 받고, 입력된 음성신 호에 포함된 음성정보를 상기 인공지능 모듈로 등록하기 위한 사용자 음성정보 등록부; 사용자의 보호자로부터 적어도 하나의 음성신호를 입력 받고, 입력된 음성신호에 포함된 음성정보를 상기 인공지능 모듈로 등록하기 위 한 보호자 음성정보 등록부; 및 보호자의 음성정보 등록 시, 상기 사용자 음성정보 등록부를 통해 등록되는 음 성정보를 입력음성정보로 설정하고, 상기 보호자 음성정보 등록부를 통해 등록되는 음성정보를 응답음성정보로 설정하여 상기 인공지능 모듈로 등록하기 위한 음성정보 설정부를 포함하고, 상기 인공지능 프로세서는, 상기 음성정보 설정부를 통해 설정된 상기 입력음성정보와 상기 응답음성정보를 한 세트의 정보단위로 각각 저장하고, 상기 입력음성정보가 입력되면 한 세트의 정보단위로 매칭되어 있는 상기 응답음성정보가 출력되도록 제어할 수 있다."}
{"patent_id": "10-2022-0142282", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 유아동을 대상으로 사회 환경 및 활동의 변화에 따라 삶과 밀접하게 마주치는 자연스러운 환 경을 구현함으로써, 현실적인 부정적 발달 결과를 최소화하면서 긍정적 발달을 가능하게 하는 스마트 기술을 활 용하여 유아동의 정서적인 교육 방법과 사회 상호작용에 도움이 되는 지능형 서비스를 제공하는 인공지능 기반 의 지능형 감성 완구 서비스 제공 시스템을 제공할 수 있다."}
{"patent_id": "10-2022-0142282", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나 이상의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설 명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를붙였다. 도 1은 본 발명의 실시예에 따른 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템의 전체 구성을 나타낸 개요도이다. 도 2 및 도 3은 본 발명의 실시예에 따른 인공지능 모듈이 탑재되는 캐릭터 인형의 구성을 나타낸 도면이고, 도 4는 본 발명의 실시예에 따른 인공지능 모듈의 구성을 나타낸 도면이고, 도 5는 본 발명의 실시예에 따른 클라 우드 서버의 구성을 나타낸 블록도이고, 도 6은 본 발명의 실시예에 따른 어플리케이션의 구성을 나타낸 블록도 이며, 도 7은 본 발명의 실시예에 따른 어플리케이션의 음성정보 등록 설정과 동작 방식을 설명하기 위해 나타 낸 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템은 캐 릭터 완구, 인공지능 모듈, 클라우드 서버 및 어플리케이션 중 적어도 하나를 포함할 수 있다. 상기 캐릭터 완구는 도 2에 도시된 바와 같이, 인형, 액세서리, 서비스 카드, 인형 마이크 모듈, 인형 스피커 모듈, 제1 마그네틱, 제2 마그네틱 및 제3 마그네틱 중 적어도 하 나를 포함할 수 있다. 상기 인형은 유아동에게 친숙한 디자인과 캐릭터를 갖는 형태로 제작될 수 있으며, 포켓과 잠금 수단 중 적어도 하나를 포함할 수 있다. 상기 포켓은, 인형의 몸체 내부에 형성되어 개구부(111a)를 통해 인공지능 모듈이 삽입되어 내 부에 안착되는 공간과, 물리 키 버튼 모듈에 포함된 각각의 키 버튼을 외부에 노출시키기 위한 버튼 홀(111b)이 구비될 수 있다. 상기 잠금 수단은, 개구부(111a)를 폐쇄하여 포켓의 내부에 안착된 인공지능 모듈이 외부로 이 탈되지 않도록 개구부(111a)를 잠그는 역할을 할 수 있다. 이러한 잠금 수단은 지퍼, 단추, 벨크로 중 적 어도 하나를 포함할 수 있으나, 본 실시예에서는 특정한 수단으로 한정하지는 않는다. 상기 액세서리는, 인형에 입히는 의류 및 의류에 부착되는 장식도구 중 적어도 어느 하나를 포함할 수 있 다. 상기 서비스 카드는, 액세서리에 부착 또는 인쇄된 2차원 식별코드를 구비할 수 있다. 이러한 2차원 식별코드 QR코드나 BAR코드 등으로 이루어질 수 있으며, 클라우드 서버에 접속하기 위한 URL 정보를 포함 할 수 있다. 2차원 식별코드를 휴대통신단말을 통해 스캔하면, 해당 URL 정보를 통해 기본 정보 서비스 및 오디오 콘텐츠 서비스 중 어느 하나의 서비스를 휴대통신단말을 통해 직접적으로 제공 받을 수 있다. 본 실 시예에 따른 기본 정보 서비스는, 날씨정보, 사칙연산, 언어번역, 기념일관리, 정보검색, 알람, 메시지전달 중 적어도 하나를 포함하며, 음성 대화 방식으로 진행될 수 있다. 또한, 오디오 콘텐츠 서비스는 동화 서비스 및 동요 서비스 중 적어도 하나를 포함하며, 음성 명령에 의해 원하는 오디오 콘텐츠를 제공 받을 수 있다. 상기 인형 마이크 모듈은, 인형의 외형부 중 어느 한 부위와 포켓의 내부 사이를 연결하는 제1 케이 블, 제1 케이블의 일측과 연결되고 인형의 외형부 중 어느 한 부위에 설치된 마이크 소자, 및 제1 케이블의 타측과 연결된 제1 커넥터를 포함할 수 있다. 예를 들어, 마이크 소자는 인형 의 귀 부분에 설치되고, 제1 커넥터는 포켓 내부에 설치되며, 제1 케이블은 마이크 소자 와 제1 커넥터 사이를 전기적으로 연결할 수 있다. 이러한 제1 케이블, 마이크 소자 및 제 1 커넥터는 인형의 세탁 시 수분 침투에 의해 고장 나지 않도록 방수 처리된 것이 바람직하다. 한편, 제1 커넥터는 마이크 커넥터가 삽입되도록 상보적인 구조로 이루어질 수 있으며, 예를 들어 홈 구조 로 이루어질 수 있다. 상기 인형 스피커 모듈은, 인형의 외형부 중 어느 한 부위와 포켓의 내부 사이를 연결하는 제2 케이 블, 제2 케이블의 일측과 연결되고 인형의 외형부 중 어느 한 부위에 설치된 스피커 소자, 및 제2 케이블의 타측과 연결된 제2 커넥터를 포함할 수 있다. 예를 들어, 스피커 소자는 인형 의 입이나 코 부분에 설치되고, 제2 커넥터는 포켓 내부에 설치되며, 제2 케이블은 스피커 소자와 제2 커넥터 사이를 전기적으로 연결할 수 있다. 이러한 제2 케이블, 스피커 소자 및 제2 커넥터는 인형의 세탁 시 수분 침투에 의해 고장 나지 않도록 방수 처리된 것이 바람직하다. 또한, 스피커 소자는 오디오신호가 출력될 때 점등 또는 점멸하는 LED 소자를 포함하여 인형이 말을하는 듯한 느낌을 주거나, 말을 하고 있음을 쉽게 인지할 수 있도록 한다. 한편, 제2 커넥터는 스피커 커 넥터가 삽입되도록 상보적인 구조로 이루어질 수 있으며, 예를 들어 홈 구조로 이루어질 수 있다. 상기 제1 마그네틱은, 포켓의 내부 중 제1 커넥터를 둘러싸도록 형성될 수 있으며, 예를 들어 링 형상으로 이루어질 수 있으나, 본 실시예에서는 제2 마그네틱의 구체적인 형상에 대하여 한정하지는 않 는다. 상기 제2 마그네틱은, 포켓의 내부 중 제2 커넥터를 둘러싸도록 형성될 수 있으며, 예를 들어 링 형상으로 이루어질 수 있으나, 본 실시예에서는 제2 마그네틱의 구체적인 형상에 대하여 한정하지는 않 는다. 상기 제3 마그네틱은, 포켓의 내부 중 버튼 홀(111b)을 각각 둘러싸도록 형성될 수 있으며, 예를 들 어 링 형상으로 이루어질 수 있으나, 본 실시예에서는 제3 마그네틱의 구체적인 형상에 대하여 한정하지는 않는다. 상기 인공지능 모듈는, 캐릭터 완구에 탈착 가능하게 설치되고, 사용자(영유아동)로부터 음성신호를 입력 받아 인식하되, 인식된 음성신호의 내용에 미리 정의된 호출어(예를 들어 \"안녕 펜타\")가 포함되어 있으면, 음성인식 대기모드로 진입하고, 음성인식 대기모드로 진입한 이후에 입력되는 음성신호를 클라우드 서 버로 전송하고, 전송된 음성신호에 따른 응답데이터를 클라우드 서버로부터 수신하여 음성으로 출력 할 수 있다. 상기 인공지능 모듈은 도 3 및 도 4에 도시된 바와 같이, 하우징, 디바이스 무선 통신 모듈, 디 바이스 마이크 모듈, 디바이스 스피커 모듈, 인공지능 프로세서, 물리 키 버튼 모듈 및 컨 트롤러 중 적어도 하나를 포함할 수 있다. 상기 하우징은, 직육면체의 박스 형상으로 이루어질 수 있으며, 그 내부에 다양한 구성요소를 수용할 수 있다. 본 실시예에 따른 하우징은 박스 형태로 설명 및 도시하였으나, 이에 한정되는 것이 아니라, 구형, 타원형 또는 기하학적 구조 등 다양한 변형이 가능하다. 상기 하우징은 마이크 커넥터, 스피커 커넥터, 제4 마그네틱, 제5 마그네틱, 제6 마 그네틱 중 적어도 하나를 포함할 수 있다. 상기 마이크 커넥터는 돌출 형상으로 이루어질 수 있으며, 디바이스 마이크 모듈과 전기적으로 연결 될 수 있다. 상기 스피커 커넥터는 돌출 형상으로 이루어질 수 있으며, 디바이스 스피커 모듈과 연결될 수 있다. 상기 제4 마그네틱는, 마이크 커넥터를 둘러싸도록 형성될 수 있으며, 예를 들어 링 형상으로 이루어 질 수 있으나, 본 실시예에서는 제4 마그네틱의 구체적인 형상에 대하여 한정하지는 않는다. 상기 제5 마그네틱는, 스피커 커넥터를 둘러싸도록 형성될 수 있으며, 예를 들어 링 형상으로 이루어질 수 있으나, 본 실시예에서는 제5 마그네틱의 구체적인 형상에 대하여 한정하지는 않는다. 상기 제6 마그네틱는, 물리 키 버튼 모듈에 포함된 각각의 키 버튼을 각각 둘러싸도록 형성될 수 있 으며, 예를 들어 링 형상으로 이루어질 수 있으나, 본 실시예에서는 제6 마그네틱의 구체적인 형상에 대하 여 한정하지는 않는다. 도 3에 도시된 바와 같이, 제1 커넥터와 마이크 커넥터 간은 물리적 결합에 의해 이들이 전기적으로 연결될 수 있으며, 제1 마그네틱과 제4 마그네틱 간의 자성에 의해 물리적으로 고정되고, 제2 커넥터 와 스피커 커넥터 간은 물리적인 결합에 의해 전기적으로 연결되고, 제2 마그네틱과 제5 마그네 틱 간의 자성에 의해 물리적으로 고정되고, 키 버튼이 버튼 홀(111b)을 관통하여 인형의 외부로 노출되되, 키 버튼과 버튼 홀(111b) 간은 제3 마그네틱과 제6 마그네틱 간의 자성에 의해 물리 적으로 고정됨으로써, 구조적 결합과 자성에 의한 결합이 동시에 작용하도록 하여 인형 내부에서 인공지능 모듈이 보다 견고히 고정될 수 있도록 한다. 상술한 인공지능 모듈은 인형과의 전기적 결합이 가능함을 설명하였으나, 이는 생략될 수 있으며 인 공지능 모듈이 포켓 내부에 안착되는 형태로도 실시 가능하다. 상기 디바이스 무선 통신 모듈은, 무선 통신을 통해 클라우드 서버 및 휴대통신단말 중 적어도 하나와 통신할 수 있다. 본 실시예에 따른 무선 통신은 LTE나 WiFi와 같은 인터넷 통신을 이용해 클라우드 서버 와 연결되는 구성과, 블루투스와 같은 근거리 무선 통신을 이용해 휴대통신단말과 페어링되는 구성을 모두 포함할 수 있다. 상기 디바이스 마이크 모듈은, 하우징의 내부에 탑재되고, 사용자(영유아동, 보호자 등)로부터 아날 로그의 음성신호를 입력 받아 디지털의 음성데이터로 변환할 수 있다. 상기 디바이스 스피커 모듈은, 하우징에 설치되고, 디바이스 무선 통신 모듈을 통해 클라우드 서버로부터 수신되는 응답데이터를 오디오 신호로 변환하여 출력할 수 있다. 상기 인공지능 프로세서는, 하우징의 내부에 탑재되고, 디바이스 마이크 모듈을 통해 변환된 음 성데이터를 텍스트데이터로 변환하고, 변환된 텍스트데이터에 호출어(예를 들어 \"안녕 펜타\")가 포함되어 있는 지 여부를 판단하고, 변환된 텍스트데이터에 호출어가 포함된 경우 음성인식 대기모드로 진입하고, 음성인식 대 기모드로 진입한 상태에서 디바이스 마이크 모듈을 통해 입력되는 음성데이터를 텍스트데이터로 변환하여 디바이스 무선 통신 모듈로 전달할 수 있다. 상기 물리 키 버튼 모듈은, 하우징의 외부에 설치되고, 음성인식 대기모드로의 직접 진입, 디바이스 스피커 모듈의 음량조절, 및 오디오 신호의 재생 기능을 각각 제공하기 위해 각각의 키 값을 입력 받을 수 있다. 이러한 물리 키 버튼 모듈은 도 3 및 도 4에 도시된 바와 같이 A 버튼(Right Function Key), B 버 튼(Wake-up Key), C 버튼(Left Function Key)를 포함할 수 있으며, B 버튼(Wake-up Key)을 짧게 한번 누르면 음성인식 대기모드로 전환되고, 길게 한번 누르면 A 버튼의 기능이 선택되고, 두 번 연속 누르면 B 버튼의 기능 이 선택될 수 있다. A 버튼은 볼륨-업 기능을 수행할 수 있으며, B 버튼은 볼륨-다운 기능을 수행할 수 있다. 이러한 물리 키 버튼 모듈은 상술한 기능뿐만 아니라 각 버튼 조합을 통해 새로운 명령 값이 입력되어 그 에 따라 미리 준비된 오디오 콘텐츠가 출력될 수 있다. 예를 들어, A 버튼과 B 버튼을 함께 3초 이상 누르게 되 면 미리 저장된 오디오 콘텐츠가 출력된 후 C 버튼 조작을 통해 다음 오디오 콘텐츠가 출력될 수 있다. 상기 컨트롤러는, 물리 키 버튼 모듈을 통해 입력되는 키 값에 따라 디바이스 스피커 모듈의 음 량조절, 및 오디오 신호의 재생 기능(플레이, 중지, 건너뛰기, 다시 듣기 등)을 각각 제어할 수 있다. 상기 클라우드 서버는, 인공지능 모듈에서 전송한 음성신호를 수신하여 인식하고, 인식된 음성신호의 내용을 분석하고, 분석 결과에 따라 인공지능 기반의 기본 정보 서비스 및 오디오 콘텐츠 서비스 중 어느 하나 의 서비스를 제공하기 위한 응답데이터를 생성하여 인공지능 모듈로 전송할 수 있다. 이러한 클라우드 서버는 도 5에 도시된 바와 같이, 음성 의미 분석부와 인공지능 콘텐츠 제공부 중 적어도 하나를 포함할 수 있다. 상기 음성 의미 분석부는, 인공지능 모듈로부터 수신되는 텍스트데이터에 대한 자연어 처리를 통해 텍스트데이터에 대한 의미를 분석할 수 있다. 상기 인공지능 콘텐츠 제공부는, 음성 의미 분석부를 통한 의미 분석 결과와 매칭되는 응답데이터를 생성하되, 의미 분석 결과와 매칭되는 응답데이터가 없는 경우 미리 준비된 음악 또는 음향을 제공하고, 의미 분석 결과와 매칭되는 응답데이터가 있는 경우 날씨정보, 사칙연산, 언어번역, 기념일관리, 정보검색, 알람, 메 시지전달 중 적어도 하나의 기능을 포함하는 기본 정보 서비스 또는 동화 서비스 및 동요 서비스 중 적어도 하 나를 포함하는 오디오 콘텐츠 서비스를 제공할 수 있다. 본 실시예에 따른 클라우드 서버에서 탑재된 인공지능 알고리즘은 입력 값으로 텍스트데이터와 음성피치분 석정보를 입력 받을 수 있는데, 이러한 텍스트데이터에는 사용자의 요구사항이 포함될 수 있으며, 이러한 요구 사항에는 예를 들어 날씨정보요청, 사칙연산과 같은 간단한 수학문제풀이요청, 번역요청(영어, 중국어, 일어 등), 기념일관리요청, 오디오 북 서비스 요청, 대화요청 등을 포함할 수 있다. 또한, 음성피치분석정보에는 사 용자의 감정상태를 나타내는 데이터 값이 포함될 수 있으며, 예를 들어, 기쁨, 슬픔, 분노 등에 대한 데이터 값 이 포함될 수 있다. 이와 같은 입력 값을 받는 인공지능 알고리즘은 해당 입력 값들을 고려하여 학습된 결과들을 다양한 가중치를 기반으로 추론하여 출력할 수 있다. 여기서, 학습 결과는 사용자의 요구사항과 감정상태를 기반으로 학습된 오 디오 콘텐츠를 의미할 수 있다. 즉, 사용자가 무엇을 요구하고 있으며 현재 사용자의 감정상태를 고려해 어떠한 오디오 콘텐츠를 제공할 것인지에 대하여 학습 과정을 통해 추론하여 그 결과물을 제공할 수 있다는 것이다. 본 실시예에 따른 오디오 콘텐츠는 사용자의 요구사항과 감정상태에 따라 다양하게 결정될 수 있으며, 오디오 콘텐츠는 기본적으로 음성메시지 또는 음성정보를 의미할 수 있다. 예를 들어, 사용자가 오늘 또는 특정일자, 특정위치, 주간날씨 등 날씨정보를 요청하는 경우 해당 요구사항에 부합하는 날씨정보를 읽어와 음성 서비스로 제공할 수 있다. 이때, 날씨정보는 주기적으로 업데이트되어야 할 정보이므로 클라우드 서버와의 연동을 통해 제공 받을 수 있다. 또한, 사칙연산에 대한 요구사항이 입력되는 경우 해당 문제에 대한 답을 풀이하여 음 성 서비스로 제공할 수 있다. 또한, 번역요청의 경우 번역내용정보와 번역대상국가에 대한 정보를 인식하여 해 당 인식정보에 부합하는 변역정보를 음성 서비스로 제공할 수 있다. 한편, 오디오 북 서비스에 대한 요청의 경우 요구사항에 따른 오디오 콘텐츠를 그대로 제공할 수 있으나, 음성 피치분석정보에 따라 사용자의 감정상태정보가 고려될 수 있다. 예를 들어, 사용자가 \"나 지금 너무 화가 나 있 어\"라고 직접적으로 말하거나, 다른 표현 방식으로 현재 사용자의 분노 상태를 인지하면 사용자의 감정을 다운 시킬 수 있는 그에 맞는 동요(또는 음악), 동화 읽기 서비스, 유행어(개그), 재미있는 이야기 등의 오디오 콘텐 츠를 자동으로 실행할 수 있다. 또한, 사용자가 현재 행복하거나 기쁜 상태의 경우 그에 맞게 흥을 돋울 수 있 는 동요(음악), 동화 읽기 서비스, 유행어(개그) 등의 오디오 콘텐츠를 자동으로 실행할 수 있다. 이 뿐만 아니 라, 오디오 콘텐츠는 사용자의 대화 요청에 따른 챗봇 서비스를 제공하기 위한 정보를 포함할 수도 있다. 상기 어플리케이션은, 휴대통신단말에 설치되고, 휴대통신단말과의 무선 통신을 통해 상기 인공지능 모듈 과 페어링되어 지능형 감성 완구 서비스에 대한 확장 서비스를 지원 이러한 어플리케이션은 도 6에 도시된 바와 같이, 사용자 음성정보 등록부, 보호자 음성정보 등록부 및 음성정보 설정부 중 적어도 하나를 포함할 수 있다. 상기 사용자 음성정보 등록부는, 사용자로부터 적어도 하나의 음성신호를 입력 받고, 입력된 음성신호에 포함된 음성정보를 인공지능 모듈로 등록할 수 있다. 상기 보호자 음성정보 등록부는, 사용자의 보호자로부터 적어도 하나의 음성신호를 입력 받고, 입력된 음 성신호에 포함된 음성정보를 인공지능 모듈로 등록할 수 있다. 상기 음성정보 설정부는, 보호자의 음성정보 등록 시, 사용자 음성정보 등록부를 통해 등록되는 음성 정보를 입력음성정보로 설정하고, 보호자 음성정보 등록부를 통해 등록되는 음성정보를 응답음성정보로 설 정하여 인공지능 모듈로 등록할 수 있다. 이때, 인공지능 프로세서는, 도 7에 도시된 바와 같이 어플리케이션의 음성정보 설정부를 통해 설정된 입력음성정보(유아동의 음성정보)와 응답음성정보(보호자의 음성정보)를 한 세트의 정보단위로 각각 저 장하고, 해당 입력음성정보가 입력되면 한 세트의 정보단위로 매칭되어 있는 응답음성정보(보호자의 음성정보) 가 출력되도록 제어할 수 있다. 예를 들어, 아이가 \"엄마 보고 싶어\"라는 음성정보가 등록하고, 보호자가 \"아가야 엄마 금방 갈게\"라는 음성정 보를 등록한 후, \"엄마 보고 싶어\"와 \"아가야 엄마 금방 갈게\"라는 한 쌍의 음성정보를 매칭 설정할 수 있으며, 이렇게 매칭 저장된 후 아이가 인형에게 \"엄마 보고 싶어\"라는 말을 하게 되면, 이를 인식하여 \"아가야 엄마 금 방 갈게\"라는 응답을 할 수 있게 된다. 이상에서 설명한 것은 본 발명에 의한 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템을 실시하기 위한 하나의 실시예에 불과한 것으로서, 본 발명은 상기 실시예에 한정되지 않고, 이하의 특허청구범위에서 청구하는 바와 같이 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변경 실시가 가능한 범위까지 본 발명의 기술적 정신이 있다고 할 것이다."}
{"patent_id": "10-2022-0142282", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 인공지능 기반의 지능형 감성 완구 서비스 제공 시스템의 전체 구성을 나타낸 개요도이다. 도 2 및 도 3은 본 발명의 실시예에 따른 인공지능 모듈이 탑재되는 캐릭터 인형의 구성을 나타낸 도면이다. 도 4는 본 발명의 실시예에 따른 인공지능 모듈의 구성을 나타낸 도면이다. 도 5는 본 발명의 실시예에 따른 클라우드 서버의 구성을 나타낸 블록도이다. 도 6은 본 발명의 실시예에 따른 어플리케이션의 구성을 나타낸 블록도이다. 도 7은 본 발명의 실시예에 따른 어플리케이션의 음성정보 등록 설정과 동작 방식을 설명하기 위해 나타낸 도면 이다."}
