{"patent_id": "10-2023-0041233", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0146365", "출원번호": "10-2023-0041233", "발명의 명칭": "등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇 및 이를 이용", "출원인": "주식회사 렌쥴리에듀테인먼트", "발명자": "이대오"}}
{"patent_id": "10-2023-0041233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "학교, 유치원, 학원, 병원 및 기타 어린이의 정기적인 출입이 이루어지는 시설(이하 “학교”를 기준으로 설명함)을 대상으로 설치되고, 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 적어도 하나의 인사 동작이 가능한 관절 구조를 가지며, 등하교 시간에 학교 내에서 어린이들과 상기 인사 동작들을 나눌수 있는 위치에 설치되는 휴머노이드 로봇의 로봇 본체(100);상기 로봇 본체(100)에 설치되며, 학교에 등록된 어린이 중 사전에 정해진 그룹 내 어린이들의 얼굴 정보가 각각 해당 어린이의 이름 및 이름의 음성정보와 매핑되어 저장되는 데이터베이스부(200);상기 로봇 본체(100)에 설치되어 로봇 본체(100)의 정면 방향을 기준으로 사전 설정된 거리 내로 진입하는 어린이의 얼굴을 인식하는 안면 인식부(300);상기 데이터베이스부(200)의 상기 음성정보를 외부 송출하기 위해 상기 로봇 본체(100)에 설치되는 스피커(400); 및상기 로봇 본체(100)에 설치되며, 상기 안면 인식부(300)의 얼굴 스캔 정보 및 상기 데이터베이스부(200)의 얼글 정보를 비교하여 해당 어린이의 상기 음성정보에 해당하는 이름을 상기 스피커(400)를 통해 송출시키고, 상기 로봇 본체(100)가 상기 인사 동작들 중 어느 하나를 수행토록 제어하는 제어부(500)를 포함하는 등교 유도와등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇."}
{"patent_id": "10-2023-0041233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 어느 하나의 인사 동작을 어린이가선택할 수 있도록 상기 로봇 본체(100)에 설치되는 터치스크린(600)을 더 포함하며,상기 제어부(500)는 상기 안면 인식부(300)로부터 수신된 얼굴 스캔 정보가 상기 데이터베이스부(200)에 저장된어린이의 얼굴 정보에 해당되면, 해당 어린이의 상기 음성정보에 해당하는 이름을 상기 스피커(400)를 통해 송출시키는 동시에 상기 터치스크린(600)을 통해서 상기 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를숙이는 인사 중 어느 하나의 인사 동작을 선택할 수 있도록 하는 화면을 디스플레이시킨 다음, 선택되는 인사동작이 상기 로봇 본체(100)를 통해 수행되도록 하는 것을 특징으로 하는 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇."}
{"patent_id": "10-2023-0041233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "학교, 유치원, 학원, 병원 및 기타 어린이의 정기적인 출입이 이루어지는 시설(이하 “학교”를 기준으로 설명함)을 대상으로 설치되고, 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 적어도 하나의 인사 동작이 가능한 관절 구조를 가지며, 하나의 학교를 기준으로 해당 학교에 등록된 어린이 중 사전에 정해진 그룹 내 어린이들의 얼굴 정보가 각각 해당 어린이의 이름 및 이름의 음성정보와 매핑되어 저장되는 데이터베이스부(200) 및 정면 방향을 기준으로 사전 설정된 거리 내로 진입하는 어린이의 얼굴을 인식하는 안면 인식부(300) 그리고 상기 데이터베이스부(200)의 상기 음성정보를 외부 송출하기 위한 스피커(400) 및 상기 안면인식부(300)의 얼굴 스캔 정보와 상기 데이터베이스부(200)의 얼글 정보를 비교하여 해당 어린이의 상기 음성정보에 해당하는 이름을 상기 스피커(400)를 통해 송출시키고 상기 로봇 본체(100)가 상기 인사 동작들 중 어느하나를 수행토록 제어하는 제어부(500) 그리고 상기 안면 인식부(300)의 얼굴 스캔 정보를 실시간으로 외부의수신 대상에 전송하기 위한 무선통신모듈(700)을 포함하며, 등하교 시간에 학교 내에서 어린이들과 상기 인사동작들을 나눌 수 있는 위치에 설치되는 휴머노이드 로봇(1000);공개특허 10-2024-0146365-3-상기 휴머노이드 로봇(1000)들의 상기 데이터베이스부(200)의 정보와 동일한 정보들이 상기 휴머노이드 로봇(1000)별 사전 부여된 식별정보를 기준으로 휴머노이드 로봇(1000)별 구분되어 저장되며, 상기 무선통신모듈(700)로부터 전송되는 상기 안면 인식부(300)의 얼굴 스캔 정보가 그 수신 시마다 수신 시의 현재 시간이 포함된 정보로써 상기 식별정보를 기준으로 해당 휴머노이드 로봇(1000)의 정보 저장 영역에 해당 어린이의 상기 이름과 매핑되어 저장되는 등하교 정보 DB서버(2000);상기 안면 인식부(300)의 얼굴 스캔 정보를 기반으로 하는 상기 등하교 정보 DB서버(2000)의 등하교 정보를 선생님 또는 학부모의 요청 시 검출하여 전송하는 등하교 통합관리서버(3000); 및선생님 또는 학부모가 각각 휴대하며, 상기 등하교 통합관리서버(3000)에 해당 어린의의 등하교 정보를 요청 후상기 등하교 통합관리서버(3000)로부터 전송되는 해당 어린이의 등하교 정보를 수신하는 사용자 스마트 모바일디바이스(4000)를 포함하는 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을이용한 등하교 관리 시스템."}
{"patent_id": "10-2023-0041233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 휴머노이드 로봇(1000)의 데이터베이스부(200) 및 상기 등하교 정보 DB서버(2000)에 이름이 등록된 어린이의 가정 현관에 설치되어 귀가하는 어린이에 대한 얼굴 스캔 정보를 획득 후 실시간으로 상기 등하교 정보 DB서버(2000)에 전송하되, 얼굴 인식 성능이 상기 안면 인식부(300)와 동일한 안면 인식 모듈(5000)을 더 포함하며,상기 등하교 정보 DB서버(2000)는 상기 안면 인식 모듈(5000)의 얼굴 스캔 정보를 수신 시마다 수신 시의 현재시간이 포함된 귀가정보를 생성하여 해당 어린이의 얼굴 정보를 기준으로 매핑하여 저장하고, 상기 등하교 통합관리서버(3000)는 상기 휴머노이드 로봇(1000)의 데이터베이스부(200) 및 상기 등하교 정보 DB서버(2000)에 이름이 등록된 어린이별 하교한 시각 및 귀가한 시각 사이의 시간(이하 “귀가소요시간”이라함)을 상기 등하교 정보 DB서버(2000)에 저장된 정보를 토대로 매일 계산하는 연산모듈(3100)과, 상기 연산모듈(3100)에서 계산되는 상기 귀가소요시간을 어린이의 이름과 매핑하는 동시에 일자 및 요일 기준으로 구분하여저장하는 저장부(3200)와, 상기 저장부(3200)에 저장된 일자 및 요일별 귀가소요시간을 대상으로 딥러닝을 수행하여 해당 어린이들 각각의 요일별 귀가 관리용 임계시간을 산출하되, 상기 귀가 관리용 임계시간을 사전에 설정된 단위기간(2개월, 3개월, 6개월 등)을 기준으로 주기적으로 새로 산출하는 인공지능모듈(3300)과, 상기 등하교 정보 DB서버(2000)에 어린이의 하교 시각이 저장될 때마다 해당 어린이에 대해 산출된 이전 단위기간의 상기 귀가 관리용 임계시간을 상기 인공지능모듈(3300)로부터 제공받은 다음, 해당 어린이의 귀가 시각이 상기 인공지능모듈(3300)에서 제공된 상기 귀가 관리용 임계시간이 지나도록 상기 등하교 정보 DB서버(2000)에 전송되어 저장되지 않을 시, 안전귀가 확인요청신호를 생성하여 해당 어린이의 학부모가 소유한 상기 사용자 스마트모바일 디바이스(4000)에 전송하는 제어모듈(3400)을 포함하는 것을 특징으로 하는 등교 유도와 등하교 관리를위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 이용한 등하교 관리 시스템."}
{"patent_id": "10-2023-0041233", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "안면 인식 기능을 갖는 동시에 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 적어도하나의 인사 동작을 할 수 있는 휴머노이드 로봇이 학교의 교실 문앞 또는 학교 교문 앞에 배치되는 단계;상기 휴머노이드 로봇이 등교 또는 하교 중인 어린이의 안면을 인식하는 단계;상기 휴머노이드 로봇이 사전 저장된 데이터베이스부의 어린이별 얼굴정보와 상기 안면 인식된 얼굴 스캔 정보를 비교하여 사전에 등록된 어린이의 등교 또는 하교인지 확인하는 단계;상기 휴머노이드 로봇이 사전에 등록된 어린이의 등교 또는 하교로 확인 시, 상기 데이터베이스부에 사전 저장된 해당 어린이의 이름에 대한 음성정보를 검출하여 장착된 스피커를 통해 송출하고, 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 적어도 하나의 인사 동작을 취하는 단계;상기 휴머노이드 로봇이 인식된 안면 스캔 정보를 실시간으로 등하교 정보 DB서버에 전송하여 저장되게 하는 단계를 포함하는 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇 및 이를 이용한공개특허 10-2024-0146365-4-등하교 관리 방법."}
{"patent_id": "10-2023-0041233", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 어린이들이 등하교 시 교실 문앞이나 학교 교문 앞에서 하이파이브, 포옹, 마주보면서 하는 큰 동작의 인사 등 활기차고 다이내믹한 인사를 휴머노이드 로봇과 하게 됨에 따라, 친근감, 행복함, 흥미감 및 신비감 등 을 느낄 수 있는 동시에 이를 통한 보다 즐겁고 활기찬 등하교 시간의 실현이 가능하여 아침 등교 시의 보다 적 극적인 등교 유도까지 가능한 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇 및 이를 이용한 등하교 관리 시스템 및 그 방법에 관한 것으로서, 본 발명에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 이용한 등하교 관리 시스템은 휴머노이드 로봇, 등하교 정보 DB 서버, 등하교 통합관리서버, 사용자 스마트 모바일 디바이스 및 안면 인식 모듈을 포함하여 구성된다."}
{"patent_id": "10-2023-0041233", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇 및 이를 이용한 등하 교 관리 시스템 및 그 방법에 관한 것으로서, 더욱 상세하게는 어린이들이 등하교 시 교실 문앞이나 학교 교문 앞에서 하이파이브, 포옹, 마주보면서 하는 큰 동작의 인사 등 활기차고 다이내믹한 인사를 휴머노이드 로봇과 하게 됨에 따라, 친근감, 행복함, 흥미감 및 신비감 등을 느낄 수 있는 동시에 이를 통한 보다 즐겁고 활기찬 등하교 시간의 실현이 가능하여 아침 등교 시의 보다 적극적인 등교 유도까지 가능한 등교 유도와 등하교 관리 를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇 및 이를 이용한 등하교 관리 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0041233", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "휴머노이드는 Human(인간)의 형태를 한(-oid) 것을 의미하며 1867년에 처음 사용되기 시작하였고, 세 글자로 줄 여 말한다면 '인간형'이란 의미이며 인간형 로봇 또는 인간형 생명체를 표현하는 단어이다. 즉, 동물, 외계인, 기계 등을 포함하는 모든 사물 중 인간을 외형적으로 닮거나 인간과 같은 사고방식 및 운동 기능을 구현하는 각종 기계/전자 장비들을 포함하며, 정면에서 보았을 때 머리가 하나, 팔은 둘, 다리도 둘 등 과 같이 좌우 대칭의 신체적구조, 직립보행 등의 특성을 갖으면 눈과 손가락 및 발가락 갯수가 인간보다 많고 적음에 관계없이 또한, 꼬리와 날개가 있어도 모두 '휴머노이드' 또는 '휴머노이드 형태'로 호칭되며 오늘날에 는 인간형 로봇을 지칭한다. 한편, 유인원은 anthropoid라는 단어가 따로 있고 '유인원형' 이라는 의미와 함께 사용될 수도 있겠으나 휴머노 이드를 사용하는 것이 매우 보편적이다. 일반적으로 유치원 원생이나 초등학교 저학년 학생의 경우 아침잠이 많은 동시에 등원 내지 등교를 귀찮아하거 나 어려워 하는 경우가 많아, 유치원 원생 내지 초등학교 저학년 학생(이하 “어린이”라 함)의 부모들은 해당 자녀들을 유치원 내지 초등학교에 등원 내지 등교(이하 “등교”를 예로 설명함)시키는 일에 어려움을 겪는다. 따라서 어린이들에게 등교가 즐거움과 재미를 느낄 수 있는 행복한 시간이 되도록 하고, 이를 통해 어리인들의 등교를 보다 적극적으로 유도하는 동시에 해당 부모들의 자녀 등교 시 어려움이 줄어들 수 있도록 하는 기술이 필요하다. 또한 어린이들은 등하교 중에 게임기 등의 유희에 빠져 제때 등교를 하지 않거나 하교 후 귀가를 늦게 하는 등 의 행동을 할 수 있는바, 이에 따른 부모들의 걱정을 덜어주는 동시에 어린이들의 등하교에 관한 정보들을 보다 효율적으로 체크 및 관리할 수 있도록 하는 기술이 필요한 상황이다. 특히 최근 들어 어린이를 대상으로 하는 범죄가 증가하는 추세이며, 따라서 어린이들의 등하교 시간이 보다 정 확하고 효율적으로 체크되는 동시에 이를 기반으로 어린이들의 등하굣길 안전 관리가 보다 잘 이루어질 수 있도 록 하는 기술이 필요한 상황이다. 이에 본 출원인은 어린이들의 등하교 시 교실이나 교문 앞 등에서 하이파이브 등의 반갑고 활기찬 인사를 나누 는 동시에 이 과정에서 해당 어린이들을 대상으로 인공지능 기반의 안면인식을 통해 어린이별 등교 및 하교 시 간을 획득하게 되는 휴머노이드 로봇 기술을 제공함으로써, 이를 통해 어린이들의 등교를 보다 적극적으로 유도 하는 동시에 어린이들의 등하교 시간 등 등하교에 관한 정보들이 보다 정확하고 효율적으로 관리될 수 있도록 하는 기술로서 본 발명을 제안하게 되었다. 선행기술문헌 특허문헌(특허문헌 0001) 한국 등록특허 제10-2299063호(2021.09.07.공고), “안면 인식을 사용한 학원 등하교 관리 시 스템 및 그 방법” (특허문헌 0002) 한국 등록특허 제10-1783044호(2017.09.28.공고), “학생 등하교 알림 시스템”"}
{"patent_id": "10-2023-0041233", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시 예는 어린이들이 등하교 시 교실 문앞이나 학교 교문 앞에서 하이파이브, 포옹, 마주보면서 하 는 큰 동작의 인사 등 활기차고 다이내믹한 인사를 휴머노이드 로봇과 하게 됨에 따라, 친근감, 행복함, 흥미감 및 신비감 등을 느낄 수 있는 동시에 이를 통한 보다 즐겁고 활기찬 등하교 시간의 실현이 가능하여 아침 등교 시의 보다 적극적인 등교 유도까지 가능한 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇 및 이를 이용한 등하교 관리 시스템 및 그 방법을 제공한다. 또한, 본 발명의 실시 예는 상술한 하이파이브 등의 인사 과정에서 해당 어린이들의 얼굴을 인식하는 동시에 이 렇게 인식되는 얼굴 인식 정보를 실시간으로 저장하여 데이터베이스를 구축함으로써, 이를 활용하여 해당 어린 이들에 대한 등하교 관리를 할 수 있는 동시에 해당 등하교 정보가 필요에 따라 언제든지 선생님 및 학부모에게 제공되어 활용될 수 있게 하는 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇 및 이를 이용한 등하교 관리 시스템 및 그 방법을 제공한다."}
{"patent_id": "10-2023-0041233", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 에에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇은, 학교, 유치원, 학원, 병원 및 기타 어린이의 정기적인 출입이 이루어지는 시설(이하 “학교”를 기준으로 설명 함)을 대상으로 설치되고, 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 적어도 하나 의 인사 동작이 가능한 관절 구조를 가지며, 등하교 시간에 학교 내에서 어린이들과 상기 인사 동작들을 나눌 수 있는 위치에 설치되는 휴머노이드 로봇의 로봇 본체와, 상기 로봇 본체에 설치되며, 학교에 등록된 어린이 중 사전에 정해진 그룹 내 어린이들의 얼굴 정보가 각각 해당 어린이의 이름 및 이름의 음성정보와 매핑되어 저 장되는 데이터베이스부와, 상기 로봇 본체에 설치되어 로봇 본체의 정면 방향을 기준으로 사전 설정된 거리 내 로 진입하는 어린이의 얼굴을 인식하는 안면 인식부와, 상기 데이터베이스부의 상기 음성정보를 외부 송출하기 위해 상기 로봇 본체에 설치되는 스피커와, 상기 로봇 본체에 설치되며, 상기 안면 인식부의 얼굴 스캔 정보 및 상기 데이터베이스부의 얼글 정보를 비교하여 해당 어린이의 상기 음성정보에 해당하는 이름을 상기 스피커를 통해 송출시키고, 상기 로봇 본체가 상기 인사 동작들 중 어느 하나를 수행토록 제어하는 제어부를 포함할 수 있다. 또한, 본 발명의 실시 에에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로 봇은 상기 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 어느 하나의 인사 동작을 어 린이가 선택할 수 있도록 상기 로봇 본체에 설치되는 터치스크린을 더 포함하며, 상기 제어부는 상기 안면 인식 부로부터 수신된 얼굴 스캔 정보가 상기 데이터베이스부에 저장된 어린이의 얼굴 정보에 해당되면, 해당 어린이 의 상기 음성정보에 해당하는 이름을 상기 스피커를 통해 송출시키는 동시에 상기 터치스크린을 통해서 상기 하 이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 어느 하나의 인사 동작을 선택할 수 있도 록 하는 화면을 디스플레이시킨 다음, 선택되는 인사 동작이 상기 로봇 본체를 통해 수행되도록 하는 것일 수 있다. 그리고 본 발명의 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로 봇을 이용한 등하교 관리 시스템은, 학교, 유치원, 학원, 병원 및 기타 어린이의 정기적인 출입이 이루어지는 시설(이하 “학교”를 기준으로 설명함)을 대상으로 설치되고, 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 적어도 하나의 인사 동작이 가능한 관절 구조를 가지며, 하나의 학교를 기준으로 해당 학교에 등록된 어린이 중 사전에 정해진 그룹 내 어린이들의 얼굴 정보가 각각 해당 어린이의 이름 및 이름의 음성정보와 매핑되어 저장되는 데이터베이스부 및 정면 방향을 기준으로 사전 설정된 거리 내로 진입하는 어린 이의 얼굴을 인식하는 안면 인식부 그리고 상기 데이터베이스부의 상기 음성정보를 외부 송출하기 위한 스피커및 상기 안면 인식부의 얼굴 스캔 정보와 상기 데이터베이스부의 얼글 정보를 비교하여 해당 어린이의 상기 음 성정보에 해당하는 이름을 상기 스피커를 통해 송출시키고 상기 로봇 본체가 상기 인사 동작들 중 어느 하나를 수행토록 제어하는 제어부 그리고 상기 안면 인식부의 얼굴 스캔 정보를 실시간으로 외부의 수신 대상에 전송하 기 위한 무선통신모듈을 포함하며, 등하교 시간에 학교 내에서 어린이들과 상기 인사 동작들을 나눌 수 있는 위 치에 설치되는 휴머노이드 로봇과, 상기 휴머노이드 로봇들의 상기 데이터베이스부의 정보와 동일한 정보들이 상기 휴머노이드 로봇별 사전 부여된 식별정보를 기준으로 휴머노이드 로봇별 구분되어 저장되며, 상기 무선통 신모듈로부터 전송되는 상기 안면 인식부의 얼굴 스캔 정보가 그 수신 시마다 수신 시의 현재 시간이 포함된 정 보로써 상기 식별정보를 기준으로 해당 휴머노이드 로봇의 정보 저장 영역에 해당 어린이의 상기 이름과 매핑되 어 저장되는 등하교 정보 DB서버와, 상기 안면 인식부의 얼굴 스캔 정보를 기반으로 하는 상기 등하교 정보 DB 서버의 등하교 정보를 선생님 또는 학부모의 요청 시 검출하여 전송하는 등하교 통합관리서버와, 선생님 또는 학부모가 각각 휴대하며, 상기 등하교 통합관리서버에 해당 어린의의 등하교 정보를 요청 후 상기 등하교 통합 관리서버로부터 전송되는 해당 어린이의 등하교 정보를 수신하는 사용자 스마트 모바일 디바이스를 포함할 수 있다. 또한, 본 발명의 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로 봇을 이용한 등하교 관리 시스템은, 상기 휴머노이드 로봇의 데이터베이스부 및 상기 등하교 정보 DB서버에 이 름이 등록된 어린이의 가정 현관에 설치되어 귀가하는 어린이에 대한 얼굴 스캔 정보를 획득 후 실시간으로 상 기 등하교 정보 DB서버에 전송하되, 얼굴 인식 성능이 상기 안면 인식부와 동일한 안면 인식 모듈을 더 포함하 며, 상기 등하교 정보 DB서버는 상기 안면 인식 모듈의 얼굴 스캔 정보를 수신 시마다 수신 시의 현재 시간이 포함된 귀가정보를 생성하여 해당 어린이의 얼굴 정보를 기준으로 매핑하여 저장하고, 상기 등하교 통합관리서 버는 상기 휴머노이드 로봇의 데이터베이스부 및 상기 등하교 정보 DB서버에 이름이 등록된 어린이별 하교한 시 각 및 귀가한 시각 사이의 시간(이하 “귀가소요시간”이라 함)을 상기 등하교 정보 DB서버에 저장된 정보를 토 대로 매일 계산하는 연산모듈과, 상기 연산모듈에서 계산되는 상기 귀가소요시간을 어린이의 이름과 매핑하는 동시에 일자 및 요일 기준으로 구분하여 저장하는 저장부와, 상기 저장부에 저장된 일자 및 요일별 귀가소요시 간을 대상으로 딥러닝을 수행하여 해당 어린이들 각각의 요일별 귀가 관리용 임계시간을 산출하되, 상기 귀가 관리용 임계시간을 사전에 설정된 단위기간(2개월, 3개월, 6개월 등)을 기준으로 주기적으로 새로 산출하는 인 공지능모듈과, 상기 등하교 정보 DB서버에 어린이의 하교 시각이 저장될 때마다 해당 어린이에 대해 산출된 이 전 단위기간의 상기 귀가 관리용 임계시간을 상기 인공지능모듈로부터 제공받은 다음, 해당 어린이의 귀가 시각 이 상기 인공지능모듈에서 제공된 상기 귀가 관리용 임계시간이 지나도록 상기 등하교 정보 DB서버에 전송되어 저장되지 않을 시, 안전귀가 확인요청신호를 생성하여 해당 어린이의 학부모가 소유한 상기 사용자 스마트 모바 일 디바이스에 전송하는 제어모듈을 포함하는 것일 수 있다. 그리고 본 발명의 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로 봇 및 이를 이용한 등하교 관리 방법은, 안면 인식 기능을 갖는 동시에 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 적어도 하나의 인사 동작을 할 수 있는 휴머노이드 로봇이 학교의 교실 문앞 또 는 학교 교문 앞에 배치되는 단계와, 상기 휴머노이드 로봇이 등교 또는 하교 중인 어린이의 안면을 인식하는 단계와, 상기 휴머노이드 로봇이 사전 저장된 데이터베이스부의 어린이별 얼굴정보와 상기 안면 인식된 얼굴 스 캔 정보를 비교하여 사전에 등록된 어린이의 등교 또는 하교인지 확인하는 단계와, 상기 휴머노이드 로봇이 사 전에 등록된 어린이의 등교 또는 하교로 확인 시, 상기 데이터베이스부에 사전 저장된 해당 어린이의 이름에 대 한 음성정보를 검출하여 장착된 스피커를 통해 송출하고, 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리 를 숙이는 인사 중 적어도 하나의 인사 동작을 취하는 단계와, 상기 휴머노이드 로봇이 인식된 안면 스캔 정보 를 실시간으로 등하교 정보 DB서버에 전송하여 저장되게 하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0041233", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 어린이들이 등하교 시 교실 문앞이나 학교 교문 앞에서 하이파이브, 포옹, 마주보 면서 하는 큰 동작의 인사 등 활기차고 다이내믹한 인사를 휴머노이드 로봇과 하게 됨에 따라, 친근감, 행복함, 흥미감 및 신비감 등을 느낄 수 있는 동시에 이를 통한 보다 즐겁고 활기찬 등하교 시간의 실현이 가능하여 아 침 등교 시의 보다 적극적인 등교 유도까지 가능하게 된다. 또한, 상술한 하이파이브 등의 인사 과정에서 해당 어린이들의 얼굴을 인식하는 동시에 이렇게 인식되는 얼굴 인식 정보를 실시간으로 저장하여 데이터베이스를 구축함으로써, 이를 활용하여 해당 어린이들에 대한 등하교관리를 할 수 있는 동시에 해당 등하교 정보가 필요에 따라 언제든지 선생님 및 학부모에게 제공되어 활용될 수 있게 된다."}
{"patent_id": "10-2023-0041233", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 본 발명에 관한 상세한 설명들은 본 발명이 실시될 수 있는 실시 예이고 해당 실시 예의 예시로써 도시 된 첨부 도면을 참조한다. 이들 실시 예는 당업자가 본 발명의 실시에 충분하도록 상세히 설명된다. 본 발명의 다양한 실시 예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 여기에 기재되어 있는 특정 형상, 구조 및 특성은 일 실시 예에 관련하여 본 발명의 사상 및 범위를 벗어나지 않으면서 다른 실 시 예로 구현될 수 있다. 또한, 각각의 기재된 실시 예 내의 개별 구성요소의 위치 또는 배치는 본 발명의 사상 및 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서 후술되는 상세한 설명은 한정적인 의미로서 취하려는 것이 아니며, 본 발명의 범위는 적절하게 설명된다 면 그 청구항들이 주장하는 것과 균등한 모든 범위와 더불어 첨부된 청구항에 의해서만 한정된다. 도면에서 유 사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유사한 기능을 지칭한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 발명에서 전체에서 어떤 부분이 어떤 구성요소를 “포함”한다고 할 때, 이는 특별히 반대되는 기재가 없는 한, 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 '…부', '…모듈' 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 도 1 내지 도 4를 참조하여 본 발명의 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇 및 이를 이용한 등하교 관리 시스템 및 그 방법에 대해 설명한다. 먼저 도 1 및 도 2를 참조하여 본 발명의 일 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인 공지능 휴머노이드 인사 로봇에 대해 설명한다. 도 1은 본 발명의 일 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 예시한 블록 구성도이고, 도 2는 본 발명의 일 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인 식 기능 인공지능 휴머노이드 인사 로봇에서 제어부의 제어 동작을 예시한 플로우챠트이다. 설명에 앞서, 본 실시 예에서는 어린이가 초등하교 3학년 이하의 어린이인 것을 예로 하였으나, 본 발명이 이에 한정되는 것은 아니다. 도시된 바와 같이, 본 발명의 일 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머 노이드 인사 로봇은 로봇 본체, 데이터베이스부, 안면 인식부, 스피커 및 제어부를포함하여 구성된다. 또한, 본 발명의 일 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지 능 휴머노이드 인사 로봇은 터치스크린을 더 포함하여 구성될 수 있다. 로봇 본체는 학교, 유치원, 학원, 병원 및 기타 어린이의 정기적인 출입이 이루어지는 시설(이하 “학교” 를 기준으로 설명함)을 대상으로 설치되는 하이브리드 로봇의 로봇 본체에 해당하는 구성이다. 그리고 이러한 로봇 본체는 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 적어도 하나의 인사 동작이 가능한 관절 구조를 가지며, 등하교 시간에 학교 내에서 어린이들과 상기 인사 동작들을 나눌 수 있는 위치에 설치된다. 데이터베이스부는 로봇 본체에 설치되며, 이러한 데이터베이스부는 학교에 등록된 어린이 중 사 전에 정해진 그룹 내 어린이들의 얼굴 정보가 각각 해당 어린이의 이름 및 이름의 음성정보와 매핑되어 저장된 다. 안면 인식부는 로봇 본체에 설치되어 로봇 본체의 정면 방향을 기준으로 사전 설정된 거리 내로 진입하는 어린이의 얼굴을 인식하는 기능을 수행한다. 스피커는 데이터베이스부의 상기 음성정보를 외부 송출하기 위해 로봇 본체에 설치된다. 제어부는 로봇 본체에 설치되며, 이러한 제어부는 안면 인식부의 얼굴 스캔 정보 및 데이 터베이스부의 얼글 정보를 비교하여 해당 어린이의 상기 음성정보에 해당하는 이름을 스피커를 통해 송출시키고, 로봇 본체가 상기 인사 동작들 중 어느 하나를 수행토록 제어한다. 그리고 터치스크린은 상술한 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 어느 하나의 인사 동작을 어린이가 선택할 수 있도록 로봇 본체에 설치된다. 그리고 제어부는 안면 인식부로부터 수신된 얼굴 스캔 정보가 상기 데이터베이스부에 저장된 어 린이의 얼굴 정보에 해당되면, 해당 어린이의 상기 음성정보에 해당하는 이름을 스피커를 통해 송출시키는 동시에 터치스크린을 통해서 상기 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 어느 하나의 인사 동작을 선택할 수 있도록 하는 화면을 디스플레이시킨 다음, 선택되는 인사 동작이 상기 로봇 본체를 통해 수행되도록 하는 것일 수 있다. 도 2를 참조하면, 제어부는 단계(S110)에서, 안면 인식부로부터 얼굴 스캔 정보의 수신 여부를 확인 한다. 단계(S120)에서, 단계(S110)을 통해 안면 인식부로부터 얼굴 스캔 정보의 수신이 확인되면, 데이터베이스 부에서 해당 어린이의 얼굴 정보를 검출한다. 단계(S130)에서, 단계(S110)의 얼굴 스캔 정보가 단계(S120)의 얼굴 정보에 해당하는지 여부를 다시 확인한다. 단계(S140)에서, 스피커를 통해 해당 어린이의 이름을 송출하고, 터치스크린을 통해 인사 동작을 선 택할 수 있는 화면을 표시한다. 단계(S150)에서, 로봇 본체가 단계(S140)에서 선택되는 인사 동작을 하도록 제어한다. 다음은 도 3을 참조하여 본 발명의 일 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 이용한 등하교 관리 시스템에 대해 설명한다. 도 3은 본 발명의 일 실시 에에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 이용한 등하교 관리 시스템을 예시한 블록 구성도이다. 도시된 바와 같이, 본 발명의 일 실시 에에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머 노이드 인사 로봇을 이용한 등하교 관리 시스템은 휴머노이드 로봇, 등하교 정보 DB서버, 등하교 통합관리서버 및 사용자 스마트 모바일 디바이스를 포함하여 구성된다. 또한, 본 발명의 일 실시 에에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 이용한 등하교 관 리 시스템은 안면 인식 모듈을 더 포함하여 구성될 수 있다. 휴머노이드 로봇은 학교, 유치원, 학원, 병원 및 기타 어린이의 정기적인 출입이 이루어지는 시설(이하 “학교”를 기준으로 설명함)을 대상으로 설치되고, 하이파이브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙 이는 인사 중 적어도 하나의 인사 동작이 가능한 관절 구조를 갖는다. 그리고 이러한 휴머노이드 로봇은 하나의 학교를 기준으로 해당 학교에 등록된 어린이 중 사전에 정해진 그룹 내 어린이들의 얼굴 정보가 각각 해당 어린이의 이름 및 이름의 음성정보와 매핑되어 저장되는 데이터베이 스부와, 정면 방향을 기준으로 사전 설정된 거리 내로 진입하는 어린이의 얼굴을 인식하는 안면 인식부 와, 데이터베이스부의 상기 음성정보를 외부 송출하기 위한 스피커와, 안면 인식부의 얼굴 스캔 정보와 데이터베이스부의 얼글 정보를 비교하여 해당 어린이의 상기 음성정보에 해당하는 이름을 스 피커를 통해 송출시키고, 로봇 본체가 상기 인사 동작들 중 어느 하나를 수행토록 제어하는 제어부 와, 안면 인식부의 얼굴 스캔 정보를 실시간으로 외부의 수신 대상에 전송하기 위한 무선통신모듈 을 포함하여 구성된다. 등하교 정보 DB서버는 휴머노이드 로봇들의 데이터베이스부의 정보와 동일한 정보들이 휴머노 이드 로봇별 사전 부여된 식별정보를 기준으로 휴머노이드 로봇별 구분되어 저장된다. 그리고 등하 교 정보 DB서버는 휴머노이드 로봇의 무선통신모듈로부터 전송되는 안면 인식부의 얼굴 스캔 정보가 그 수신 시마다 수신 시의 현재 시간이 포함된 정보로써 상기 식별정보를 기준으로 해당 휴머노이 드 로봇의 정보 저장 영역에 해당 어린이의 상기 이름과 매핑되어 저장된다. 등하교 통합관리서버는 안면 인식부의 얼굴 스캔 정보를 기반으로 하는 등하교 정보 DB서버의 등하교 정보를 선생님 또는 학부모의 요청 시 검출하여 전송한다. 사용자 스마트 모바일 디바이스는 선생님 또는 학부모가 각각 휴대하며, 이러한 사용자 스마트 모바일 디 바이스는 등하교 통합관리서버에 해당 어린의의 등하교 정보를 요청 후 등하교 통합관리서버(300 0)로부터 전송되는 해당 어린이의 등하교 정보를 수신한다. 안면 인식 모듈은 휴머노이드 로봇의 데이터베이스부 및 등하교 정보 DB서버에 이름이 등록된 어린이의 가정 현관에 설치되어 귀가하는 어린이에 대한 얼굴 스캔 정보를 획득 후 실시간으로 등하교 정보 DB서버에 전송하되, 얼굴 인식 성능이 안면 인식부와 동일하게 이루어지는 구성이다. 그리고 등하교 정보 DB서버는 안면 인식 모듈의 얼굴 스캔 정보를 수신 시마다 수신 시의 현재 시 간이 포함된 귀가정보를 생성하여 해당 어린이의 얼굴 정보를 기준으로 매핑하여 저장한다. 또한, 등하교 통합관리서버는 연산모듈, 저장부, 인공지능모듈 및 제어모듈을 포함하여 구성될 수 있다. 연산모듈은 휴머노이드 로봇의 데이터베이스부 및 등하교 정보 DB서버에 이름이 등록된 어린이별 하교한 시각 및 귀가한 시각 사이의 시간(이하 “귀가소요시간”이라 함)을 등하교 정보 DB서버(200 0)에 저장된 정보를 토대로 매일 계산하는 기능을 수행한다. 저장부는 연산모듈에서 계산되는 상기 귀가소요시간을 어린이의 이름과 매핑하는 동시에 일자 및 요일 기준으로 구분하여 저장한다. 인공지능모듈은 저장부에 저장된 일자 및 요일별 귀가소요시간을 대상으로 딥러닝을 수행하여 해당 어린이들 각각의 요일별 귀가 관리용 임계시간을 산출하되, 상기 귀가 관리용 임계시간을 사전에 설정된 단위기 간(2개월, 3개월, 6개월 등)을 기준으로 주기적으로 새로 산출한다. 제어모듈은 등하교 정보 DB서버에 어린이의 하교 시각이 저장될 때마다 해당 어린이에 대해 산출된 이전 단위기간의 상기 귀가 관리용 임계시간을 인공지능모듈로부터 제공받은 다음, 해당 어린이의 귀가 시각이 인공지능모듈에서 제공된 상기 귀가 관리용 임계시간이 지나도록 등하교 정보 DB서버에 전 송되어 저장되지 않을 시, 안전귀가 확인요청신호를 생성하여 해당 어린이의 학부모가 소유한 사용자 스마트 모 바일 디바이스에 전송한다. 다음은 도 4를 참조하여 본 발명의 일 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇 및 이를 이용한 등하교 관리 방법에 대해 설명한다. 도 4는 본 발명의 일 실시 에에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 이용한 등하교 관리 방법을 예시한 플로우챠트이다. 도시된 바와 같이, 단계(S210)에서, 안면 인식 기능을 갖는 동시에 하이파이브, 포옹, 마주보며 45∼90°의 각 도로 허리를 숙이는 인사 중 적어도 하나의 인사 동작을 할 수 있는 휴머노이드 로봇이 학교의 교실 문앞 또는 학교 교문 앞에 배치된다. 단계(S220)에서, 상기 휴머노이드 로봇이 등교 또는 하교 중인 어린이의 안면을 인식한다. 단계(S230)에서, 상기 휴머노이드 로봇이 사전 저장된 데이터베이스부의 어린이별 얼굴정보와 상기 안면 인식된 얼굴 스캔 정보를 비교하여 사전에 등록된 어린이의 등교 또는 하교인지 확인한다. 단계(S240)에서, 상기 휴머노이드 로봇이 사전에 등록된 어린이의 등교 또는 하교로 확인 시, 상기 데이터베이 스부에 사전 저장된 해당 어린이의 이름에 대한 음성정보를 검출하여 장착된 스피커를 통해 송출하고, 하이파이 브, 포옹, 마주보며 45∼90°의 각도로 허리를 숙이는 인사 중 적어도 하나의 인사 동작을 취힌다. 단계(S250)에서, 상기 휴머노이드 로봇이 인식된 안면 스캔 정보를 실시간으로 등하교 정보 DB서버에 전송하여 저장되게 한다. 상술한 구성에 의해서, 어린이들이 등교 시 교실 문앞이나 학교 교문 앞에서 하이파이브, 포옹, 마주보면서 하 는 큰 동작의 인사 등 활기차고 다이내믹한 인사를 휴머노이드 로봇과 하게 됨에 따라, 흥미감 및 신비감을 느 낄 수 있는 동시에 이를 통한 보다 즐겁고 활기찬 등교 시간의 실현을 통해 보다 적극적인 등교 유도가 가능하 게 된다. 부연 설명하면, 학교나 유치원에 가기 싫고 잠도 아직 깨지 않은 어린이들이지만 휴머노이드 로봇이 반갑고 즐 겁게 맞이하며 하이파이브 등의 다이내믹한 인사를 해준다면, 어린이들은 행복한 얼굴로 교실에 입장할 수 있다. 이에 더하여 어린이들 자신의 이름을 기억하여 불러주고 하이파이브 등의 활기찬 인사로 맞아주게 되는 휴머노이드 로봇을 해당 어린이들을 친구처럼 느끼게 되면, 이러한 친밀감이 해당 어린이들의 보다 즐겁고 활기 찬 등교 시간 유도에 도움을 주게 된다. 또한, 이는 어린이들의 하교길에도 일정 부분 동일하게 적용될 수 있을 것이다. 다시 말해 하교 시간에 휴머노 이드 로봇이 위에서 언급한 것처럼 반갑게 인사를 하면서 배웅해주면, 어린이들은 즐거운 하교 시간을 보내게 되면서 다음 날 등교에 대한 거부감이 보다 해소될 수 있게 된다. 또한, 상술한 하이파이브 등의 인사 과정에서 해당 어린이들의 얼굴을 인식하는 동시에 이렇게 인식되는 얼굴 인식 정보를 실시간으로 저장하여 데이터베이스를 구축함으로써, 이를 활용하여 해당 어린이들에 대한 등하교 관리를 할 수 있는 동시에 해당 등하교 정보가 필요에 따라 언제든지 선생님 및 학부모에게 제공되어 활용될 수 있게 된다. 이에 더하여 어린이들의 하교 후 귀가까지의 시간 차이에 대한 관리 및 평상시보다 귀가 시간이 늦 어지는 어린이의 경우 해당 사실이 실시간으로 신속하게 감지되면서 해당 학부모 내지 선생님에게 전달되어 조 치가 취해질 수 있으므로, 어린이들의 안전 귀가길 확보에 매우 효율적인 기능을 제공할 수 있게 된다. 이상과 같이 본 설명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시 예 및 도면에 의해 설명 되었으나, 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시 예에 한 정되는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서 본 발명의 사상은 설명된 실시 예에 국한되어 정하여 저서는 안되며, 후술되는 청구범위뿐만 아니라 이 청구범위와 균등하거나 등가적인 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2023-0041233", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 예시한 블록 구성도, 도 2는 본 발명의 일 실시 예에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇에서 제어부의 제어 동작을 예시한 플로우챠트, 도 3은 본 발명의 일 실시 에에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 이용한 등하교 관리 시스템을 예시한 블록 구성도, 그리고 도 4는 본 발명의 일 실시 에에 따른 등교 유도와 등하교 관리를 위한 안면인식 기능 인공지능 휴머노이드 인사 로봇을 이용한 등하교 관리 방법을 예시한 플로우챠트."}
