{"patent_id": "10-2023-0123105", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0040279", "출원번호": "10-2023-0123105", "발명의 명칭": "인공지능 기반 콘크리트 교량 결함 식별 방법 및 장치", "출원인": "인천대학교 산학협력단", "발명자": "전광길"}}
{"patent_id": "10-2023-0123105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "콘크리트 교량의 결함 유형을 포함하는 이미지를 수집하고, 이미지 크기를 변환하는 이미지 전처리 단계;상기 결함 유형을 분류하기 위하여 사전 학습모델 활용하되, 상기 사전 학습모델의 구조를 변형하거나 파라미터의 일부를 새롭게 학습하는 전이 학습 단계;상기 콘크리트 교량 이미지에서 어느 영역이 상기 결함 유형을 분류하는 프로세스에 영향을 미쳤는지 알 수 있도록 강조하는 히트맵(heatmap)을 생성하는 히트맵 생성 단계; 및상기 생성된 히트맵을 활용하여 교량의 세 가지 결함 유형으로 분류하는 이미지 분류 단계;를 포함하고, 상기 이미지 분류 단계에서 상기 교량의 세 가지 결함 유형에는 균열, 박리, 백화를 포함하는, 인공지능 기반콘크리트 교량 결함 식별 방법."}
{"patent_id": "10-2023-0123105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 사전 학습모델은 VGG16 네트워크 및 DCNN의 학습 레이아웃을 활용하고, 상기 세 가지 결함 유형의 패턴을구별하기 위해 높은 레벨 특징(high level features)을 추출할 수 있는, 인공지능 기반 콘크리트 교량 결함 식별 방법."}
{"patent_id": "10-2023-0123105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 사전 학습모델의 마지막 레이어를 콘크리트 교량의 결함이 포함된 데이터 세트에서 재학습하여 학습 매개변수를 업데이트할 수 있는, 인공지능 기반 콘크리트 교량 결함 식별 방법."}
{"patent_id": "10-2023-0123105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 VGG16 네트워크 및 DCNN의 학습 레이아웃은 역전파(via back propagation)를 통해 예측 출력과 손실 함수최적화를 기반으로 할 수 있고, 상기 최적화 기법은 경사하강법 최적화기를 사용하여 네트워크의 학습 매개변수를 업데이트할 수 있는, 인공지능 기반 콘크리트 교량 결함 식별 방법."}
{"patent_id": "10-2023-0123105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 히트맵 생성 단계에서,픽셀 수준의 히트맵을 생성하고 콘크리트 결함을 파악하기 위해 그래디언트 기반 역전파(via back propagation)해석 기술인 Grad-CAM(Gradient-weighted Class Activation Mapping) 또는 Grad-CAM++을 사용할 수 있는, 인공지능 기반 콘크리트 교량 결함 식별 방법."}
{"patent_id": "10-2023-0123105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 Grad-GAM은 역전파(via back propagation)를 활용할 수 있고,전역 평균 풀링(global average pooling, GAP)된 가중치 는 수학식 1에 기반하여 계산할 수 있으며, 공개특허 10-2025-0040279-3-[수학식 1]여기서, y는 입력이 주어진 신경망의 예측 또는 출력, c는 시각화를 생성하려는 대상 클래스, A는 최종 컨볼루션 레이어의 활성화 정도, k는 Grad-CAM 맵, Z는 활성화된 Grad-CAM 맵의 픽셀의 숫자를 나타내는, 인공지능 기반 콘크리트 교량 결함 식별 방법."}
{"patent_id": "10-2023-0123105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 클래스에 따라 차별화한 로컬 맵 은 수학식 2에 기반하여 계산할 수 있고, [수학식 2]여기서, c는 시각화를 생성하려는 대상 클래스, k는 Grad-CAM 맵, 는 클래스 c와 관련하여 k의 가중치, A는최종 컨볼루션 레이어의 활성화 정도, ReLU는 Rectified Linear Unit 활성화 함수를 의미하는, 인공지능 기반콘크리트 교량 결함 식별 방법."}
{"patent_id": "10-2023-0123105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서, 상기 Grad-CAM++에서 가중치는 수학식 3에 기반하여 계산할 수 있고, [수학식 3]여기서, 는 에 대한 픽셀 별 기울기에 대한 가중치 계수, y는 입력이 주어진 신경망의 예측 또는 출력,c는 시각화를 생성하려는 대상 클래스, A는 최종 컨볼루션 레이어의 활성화 정도, k는 Grad-CAM 맵을 나타내며, 상기 는 수학식 4에 기반하여 계산할 수 있는, 인공지능 기반 콘크리트 교량 결함 식별 방법.공개특허 10-2025-0040279-4-[수학식 4]"}
{"patent_id": "10-2023-0123105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "콘크리트 교량의 결함 유형을 포함하는 이미지를 수집하고, 이미지 크기를 변환하는 이미지 전처리부;상기 결함 유형을 분류하기 위하여 사전 학습모델 활용하되, 상기 사전 학습모델의 구조를 변형하거나 파라미터의 일부를 새롭게 학습하는 전이 학습부;상기 콘크리트 교량 이미지에서 어느 영역이 상기 결함 유형을 분류하는 프로세스에 영향을 미쳤는지 알 수 있도록 강조하는 히트맵(heatmap)을 생성하는 히트맵 생성부; 및상기 생성된 히트맵을 활용하여 교량의 세 가지 결함 유형으로 분류하는 이미지 분류부;를 포함하고, 상기 분류 단계에서 상기 교량의 세 가지 결함 유형에는 균열, 박리, 백화를 포함하는, 인공지능 기반 콘크리트교량 결함 식별 장치."}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 콘크리트 교량 식별 방법 및 장치에 관한 것으로, 콘크리트 교량의 결함 유형을 포함하 는 이미지를 수집하고, 이미지 크기를 변환하는 이미지 전처리 단계; 상기 결함 유형을 분류하기 위하여 사전 학 습모델 활용하되, 상기 사전 학습모델의 구조를 변형하거나 파라미터의 일부를 새롭게 학습하는 전이 학습 단계; 상기 콘크리트 교량 이미지에서 어느 영역이 상기 결함 유형을 분류하는 프로세스에 영향을 미쳤는지 알 수 있도 록 강조하는 히트맵(heatmap)을 생성하는 히트맵 생성 단계; 및 상기 생성된 히트맵을 활용하여 교량의 세 가지 결함 유형으로 분류하는 이미지 분류 단계;를 포함하고, 상기 이미지 분류 단계에서 상기 교량의 세 가지 결함 유형에는 균열, 박리, 백화를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능의 전이 학습을 활용하여 콘크리트 교량 이미지에서 세 가지 유형의 결함을 식별하고 분류하 기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "교량은 도로 네트워크의 핵심 요소이며 교통 시스템의 기능적 운영에 중요한 역할을 하는데, 특히 콘크리트 교 량은 사용가능한 수명기간 동안에 재료 노후화, 가변 하중, 환경 작용 및 극한 기상 조건으로 인하여 여러 가지 열화 메커니즘에 노출될 수 있다. 결과적으로 시간이 지남에 따라 다양한 유형의 손상(예: 균열 및 부식)이 발 생하고 교량의 구조를 변경시킬 수 있다. 따라서 고장을 예방하고 구조적 안전성과 사용성을 유지하기 위해서는 손상을 정확하고 시기 적절하게 감지하고 평가하는 것이 필수적이다. SHM(Structural Health Monitoring)기술은 많은 관심을 끌고 있는데, 센서(예: 가속도계, 속도계 및 변위 센서), 비파괴 검사(예: 지면 관통 레이더, 적외선 및 초음파 기술)를 기반으로 하여 다양한 기술 교량의 손상 을 식별, 로컬화 및 정량화하기 위한 기술이 발달하였음에도 육안 검사가 교량 상태 평가를 위한 지배적인 관행 이다. 육안 검사는 훈련된 검사관이 확립된 지침에 따라 교량 요소의 현장 검사를 수행하고 전체 교량의 상태를 평가할 수 있으나, 검사자의 주관적인 판단으로 인해 시간이 많이 걸리고 노동 집약적이며 오류가 발생하기 쉽 다는 문제점이 있다. 또한 접근성이 낮은 교량 영역에 도달하기 위해서는 접근 장비와 차량이 필요하므로 모니 터링 작업에 추가 비용이 발생한다. 따라서 교량에 대한 검사 자동화를 위한 보조적이고 효율적이며 비용 절감 을 위한 수단이 필요하다. 선행기술문헌 특허문헌"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "(특허문헌 0001) KR 10-2018-0051972 B1 발명의 내용"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이와 같은 문제점을 해결하기 위하여, 본 발명은 인공지능 기반 콘크리트 교량 식별 방법 및 장치를 제공하는데 그 목적이 있다. 콘크리트 교량의 결함 유형을 포함하는 이미지를 수집하고, 이미지 크기를 변환하는 이미지 전처리를 진행한다. 그리고 상기 결함 유형을 분류하기 위하여 사전 학습모델 활용하되, 상기 사전 학습모델의 구조를 변형하거나 파라미터의 일부를 새롭게 학습하는 전이 학습을 수행한다. 상기 콘크리트 교량 이미지에서 어느 영역이 상기 결함 유형을 분류하는 프로세스에 영향을 미쳤는지 알 수 있도록 강조하는 히트맵(heatmap)을 생성할 수 있는데, 결과적으로 상기 생성된 히트맵을 활용하여 교량의 이미지를 세 가지 결함 유형으로 분류한다. 즉, 본 발명은 DCNN 및 전이 학습을 사용하여 콘크리트 교량 이미지의 손상을 식별하고 로컬화하는 효율적이고 자동화 가능한 방법 및 장치를 구현할 수 있다."}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법은, 콘크 리트 교량의 결함 유형을 포함하는 이미지를 수집하고, 이미지 크기를 변환하는 이미지 전처리 단계; 상기 결함 유형을 분류하기 위하여 사전 학습모델 활용하되, 상기 사전 학습모델의 구조를 변형하거나 파라미터의 일부를 새롭게 학습하는 전이 학습 단계; 상기 콘크리트 교량 이미지에서 어느 영역이 상기 결함 유형을 분류하는 프로 세스에 영향을 미쳤는지 알 수 있도록 강조하는 히트맵(heatmap)을 생성하는 히트맵 생성 단계; 및 상기 생성된 히트맵을 활용하여 교량의 세 가지 결함 유형으로 분류하는 이미지 분류 단계;를 포함하고, 상기 이미지 분류 단계에서 상기 교량의 세 가지 결함 유형에는 균열, 박리, 백화를 포함할 수 있다. 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법은, 상기 사전 학습모델은 VGG16 네 트워크 및 DCNN의 학습 레이아웃을 활용하고, 상기 세 가지 결함 유형의 패턴을 구별하기 위해 높은 레벨 특징 (high level features)을 추출할 수 있다. 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법은, 상기 사전 학습모델의 마지막 레 이어를 콘크리트 교량의 결함이 포함된 데이터 세트에서 재학습하여 학습 매개변수를 업데이트할 수 있다. 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법은, 상기 VGG16 네트워크 및 DCNN의 학습 레이아웃은 역전파를 통해 예측 출력과 손실 함수 최적화를 기반으로 할 수 있고, 상기 최적화 기법은 경 사하강법 최적화기를 사용하여 네트워크의 학습 매개변수를 업데이트할 수 있다. 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법은, 상기 히트맵 생성 단계에서, 픽셀 수준의 히트맵을 생성하고 콘크리트 결함을 파악하기 위해 그래디언트 기반 역전파 해석 기술인 Grad- CAM(Gradient-weighted Class Activation Mapping) 또는 Grad-CAM++을 사용할 수 있다. 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법은, 상기 Grad-Cam 접근 방식은 학습 된 네트워크의 마지막 컨벌루션 레이어에 대한 기울기 정보를 기반으로 하고, 컨볼루션 레이어의 특징 맵 에 대한 의 기울기는 역전파(via back propagation)로 계산할 수 있는데, 이에 대하여 전역 평균 풀링(global average pooling, GAP)된 가중치 는 수학식 1에 기반하여 계산할 수 있고, [수학식 1] 여기서, y는 입력이 주어진 신경망의 예측 또는 출력, c는 클래스를, A는 신경망 내의 레이어의 활성화 정도를, Z는 활성화된 맵의 픽셀의 숫자를, 는 c로 분류된 특징 맵 k에 대한가중치를 나타낼 수 있다. 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법은, 클래스별로 차이를 두는 로컬 맵 Grad-CAM의 마지막 컨볼루션 레이어의 순방향 특징 맵 의 가중치된 합인 는 수학식 2에 기반하 여 계산할 수 있고, [수학식 2]"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "여기서, ReLU는 Rectified Linear Unit 활성화 함수를 의미하고, 목표로 하는 클래스에 영향을 미치는 특징 들 에만 초점을 둘 수 있다. 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법은, Grad-CAM++에서 가중치 는 수 학식 3에 기반하여 계산할 수 있고, [수학식 3]"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "여기서, 클래스 c와 특징 맵 에 대한 픽셀 별 그래디언트에 대한 가중치 계수를 나타내며 수학식 4에 기반하여 계산할 수 있다. [수학식 4]"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 장치는, 콘크리트 교량의 결함 유형을 포 함하는 이미지를 수집하고, 이미지 크기를 변환하는 이미지 전처리부; 상기 결함 유형을 분류하기 위하여 사전 학습모델 활용하되, 상기 사전 학습모델의 구조를 변형하거나 파라미터의 일부를 새롭게 학습하는 전이 학습부; 상기 콘크리트 교량 이미지에서 어느 영역이 상기 결함 유형을 분류하는 프로세스에 영향을 미쳤는지 알 수 있 도록 강조하는 히트맵(heatmap)을 생성하는 히트맵 생성부; 및 상기 생성된 히트맵을 활용하여 교량의 세 가지 결함 유형으로 분류하는 이미지 분류부;를 포함하고, 상기 분류 단계에서 상기 교량의 세 가지 결함 유형에는 균열, 박리, 백화를 포함할 수 있다."}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "구조 상태 모니터링(Structural Health Monitoring, SHM)은 교량의 손상 심각도를 식별, 로컬화 및 평가할 수 있으므로 교량상태를 진단하는데 점점 더 중요해지고 있는데, 본 발명은 인공지능을 활용하여 콘크리트 교량의세 가지 결함인 균열, 백화, 박리 테스트에서 높은 정확도로 콘크리트 교량의 결함을 분류할 수 있고, 균열 경 로와 밀도 변화를 정확하게 식별하고 캡처함으로써 효과를 입증할 수 있다. 즉, 본 발명에서 제안하는 모델을 통해 균열 경로와 밀도 변화를 정확하게 식별하고 캡처하여 결함 분류 정확도 를 높일 수 있고, 이로써 콘크리트 교량의 손상 감지 작업을 효과적이고 효율적으로 수행할 수 있다."}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적, 특정한 장점들 및 신규한 특징들은 첨부된 도면들과 연관되어지는 이하의 상세한 설명과 바람 직한 실시예들로부터 더욱 명백해질 것이다. 이때, 각각의 도면에서 동일한 구성요소는 가능한 동일한 부호로 나타낸다. 또한, 이미 공지된 기능 및/또는 구성에 대한 상세한 설명은 생략한다. 이하에 개시된 내용은, 다양한 실시 예에 따른 동작을 이해하는데 필요한 부분을 중점적으로 설명하며, 그 설명 의 요지를 흐릴 수 있는 요소들에 대한 설명은 생략한다. 또한 도면의 일부 구성요소는 과장되거나 생략되거나 또는 개략적으로 도시될 수 있다. 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니며, 따라서 각각의 도면에 그려진 구성요소들의 상대적인 크기나 간격에 의해 여기에 기재되는 내용들이 제한되는 것은 아 니다. 본 발명의 실시예들을 설명함에 있어서, 본 발명과 관련된 공지기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 그리고, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 상세한 설명에서 사용되 는 용어는 단지 본 발명의 실시 예들을 기술하기 위한 것이며, 결코 제한적이어서는 안 된다. 명확하게 달리 사 용되지 않는 한, 단수 형태의 표현은 복수 형태의 의미를 포함한다. 본 설명에서, \"포함\" 또는 \"구비\"와 같은 표현은 어떤 특성들, 숫자들, 단계들, 동작들, 요소들, 이들의 일부 또는 조합을 가리키기 위한 것이며, 기술된 것 이외에 하나 또는 그 이상의 다른 특성, 숫자, 단계, 동작, 요소, 이들의 일부 또는 조합의 존재 또는 가능 성을 배제하도록 해석되어서는 안 된다. 또한, 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어 들에 의해 한정되는 것은 아니며, 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 이하에서는, 첨부된 도면들을 참조하여, 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법 및 장치에 대해 설명하기로 한다. 본 발명의 인공지능 기반 콘크리트 교량 결함 식별 방법 흐름도는 도 9에 나와 있다. 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 방법 에는 다음과 같은 주요 단계가 있다. 도 9를 참조하면, 단계 S910에서는, 콘크리트 교량의 결함 유형을 포함하는 이미지를 수집하여 수집한 이미지의 크기를 변환하는 이미지 전처리를 수행한다. 단계 S920에서는, 상기 결함 유형을 분류하기 위하여 사전 학습모델 활용하고, 상기 사전 학습모델의 구조를 변 형하거나 파라미터의 일부를 새롭게 학습하는 전이 학습을 수행할 수 있는데, 여기서 상기 콘크리트 교량의 결 함 유형에는 세 가지 결함 유형(균열, 박리, 백화)을 포함하는 것을 특징으로 한다. 단계 S930에서는, 상기 콘크리트 교량 이미지에서 어느 영역이 상기 결함 유형을 분류하는 프로세스에 영향을 미쳤는지 알 수 있도록 강조하는 히트맵(heatmap)을 생성하여 활용한다. 한편, 도 10을 참조하면, 본 발명의 일 실시예에 의한 인공지능 기반 콘크리트 교량 결함 식별 장치에는 프로세서, 메모리, 입출력 인터페이스, 네트워크 통신 인터페이스를 포함하는 것을 특 징으로 한다. < VGG16 및 전이 학습 > 도 9를 참조하면, 단계 S910에서는, 콘크리트 교량의 결함 유형을 포함하는 이미지를 수집하여 수집한 이미지의 크기를 변환하는 이미지 전처리를 수행한다. 구체적으로, 콘크리트 교량의 결함이 포함된 데이터 세트 이미지 수집 및 준비 프로세스에 해당한다. 상기 데이터 세트는 6,900개 이상의 이미지가 포함된 다중 클래스 레이블 데이터 세트가 구성될 수 있고, 이 데 이터 세트는 콘크리트 교량의 세 가지 일반적인 결함 유형(균열, 박리, 백화)의 특징을 포함 할 수 있다. 도 9을 참조하면, 단계 S920에서는, 상기 결함 유형을 분류하기 위하여 사전 학습모델 활용하고, 상기 사전 학 습모델의 구조를 변형하거나 파라미터의 일부를 새롭게 학습하는 전이 학습을 수행할 수 있다. 구체적으로, 콘크리트 교량 이미지를 세 가지 유형(균열, 박리, 백화)의 결함으로 분류하기 위해 전이 학습을 사용하여 사전 학습된 VGG16 네트워크를 활용할 수 있다. 구체적으로, 도메인별 데이터셋의 크기가 제한적이기 때문에 레이블링된 데이터의 부족을 극복하기 위해 전이 학습 기법을 적용할 수 있다. 구체적으로, 전이 학습 접근 방식에서 큰 데이터 세트(예: ImageNet)의 사전 학습된 모델은 세밀하게 조정되고, 작은 데이터 세트에서 부분적으로 재학습될 수 있다. 구체적으로, VGG16 네트워크 및 일반적으로 DCNN의 학습 레이아웃은 역전파를 통해 예측 출력과 손실 함수(예: 이진 및 다중 클래스 교차 엔트로피 손실) 최적화를 기반으로 할 수 있다. 구체적으로, 최적화 기법은 일반적으로 경사하강법 최적화기(예: Stochastic Gradient Descent 및 적응형 최적 화기)를 사용하여 네트워크의 학습 매개변수를 업데이트할 수 있다. 도 9을 참조하면, 단계 S930에서는, 상기 콘크리트 교량 이미지에서 어느 영역이 상기 결함 유형을 분류하는 프 로세스에 영향을 미쳤는지 알 수 있도록 강조하는 히트맵(heatmap)을 생성한다. 구체적으로, 해석 기술이 세 번째 모듈에 배치되어 콘크리트 손상의 위치를 파악하기 위해 픽셀 수준 히트맵을 생성할 수 있다. 구체적으로, 픽셀 수준의 히트맵을 생성하고 결함을 파악하기 위해 두 가지 그래디언트 기반 역전파 해석 기술, 즉, Gradient-weighted Class Activation Mapping(Grad-CAM) 또는 Grad-CAM++을 사용할 수 있다. 본 발명에서는, 사전 학습된 VGG(Visual Geometry Group) 네트워크와 16개의 학습 레이어(즉, VGG16), 전이 학 습 및 제안된 데이터 세트를 사용하여 세 가지 분류 체계를 비교할 수 있고, 분류 측정(즉, 정확도, 정밀도, 재 현율 및 F1 점수), 계산 시간 및 일반화 측면에서 모델의 성능에 대한 재학습할 레이어의 수의 영향을 조사할 수 있다. 본 발명의 일 실시예로, 특징을 추출하기 위해 3Х3 필터(즉, 컨볼루션 커널)가 있는 13개의 컨볼루션 레이어를 포함할 수 있다. 또한, 학습 가능한 매개변수(즉, 가중치 및 편향)의 수를 줄이기 위한 5개의 최대 풀링 레이어와 대상 클래스 확률이 계산되는 Softmax 레이어에 평탄화된 기능을 매핑하기 위한 3개로 완전히 연결된 레이어가 포함될 수 있 다. 그리고, ReLU(Rectified Linear Unit) 활성화 함수를 사용하여 모델의 비선형성을 높일 수 있다. <Gradient-Weighted Class Activation Mapping(Grad-CAM)> Grad-CAM 기술은 인공 지능 분야, 특히 컴퓨터 비전 작업에서 중요한 역할을 하는데, 주로 이미지 분류 및 객체 감지 작업에서 심층 신경망, 특히 CNN(컨볼루션 신경망)이 내린 결정을 해석하고 시각화하고 위치화하는 데 도 움을 줄 수 있다. 구체적으로, 심층 신경망이 특정한 예측을 하는 원인을 규명하기 어려울 수 있기 때문에 심층 신경망은 종종 ' 블랙박스' 모델로 간주되는데, Grad-CAM은 해석 가능성을 제공하여 이 문제를 해결할 수 있고, 입력 이미지의 어느 영역이 네트워크의 의사 결정 프로세스에 가장 큰 영향을 미쳤는지 강조하는 히트맵(heatmap)을 생성함으 로써 모델이 초점을 맞추고 있는 이미지의 어떤 특징이나 부분을 이해하는 데 도움을 줄 수 있다. 본 발명의 일 실시예로, CNN(Convolutional Neural Network)에서 Grad-CAM은 ReLU 활성화를 사용하여 다음과 같은 순서로 가중치 'W'를 계산할 수 있다. Grad-CAM 시각화를 생성하려는 대상 클래스 'c'를 선택한다. 이미지를 입력하고 순방향으로 전달하는 동안에 사전 학습된 CNN 모델을 통해 대상 클래스 'c'에 대한 최종 컨볼루션 계층(전역 평균 풀링 계층 전)의 활성화를 나타내는 'A'를 기록한다. 활성화도 'A'에 대한 대상 클래스 점수의 기울기를 계산하고, 해당하는 기울기는 각 활성화의 변화에 따라 대상 클래스 점수가 얼마나 변경되는지를 정량화할 수 있다. ReLU 활성화 함수를 계산된 기울기에 요소별로 적용한다. Grad-CAM은 중요한 활성화도를 더욱 강조하기 위해 가중치를 도입하는데, 가중치 'W'는 ReLU 활성화 기울기 의 가중치 합으로 계산되고, 가중치는 ReLU 활성화 기울기의 전역 평균 풀링을 사용하여 계산된다. 마지막으로 가중치 'W'를 사용하여 활성화 'A'의 가중치 합을 취하여 Grad-CAM 맵 'k'를 생성할 수 있는데, Grad-CAM 맵 'k'는 대상 클래스 예측에 긍정적으로 기여하는 입력 이미지의 영역을 강조 표시한다. 입력 이미지에 Grad-CAM 맵을 오버레이하여 대상 클래스에 대한 모델 결정에 긍정적인 영향을 미친 영역을 시각화한다. 본 발명의 일 실시예로, Grad-Cam(Gradient-Weighted Class Activation Mapping) 접근 방식은 학습된 네트워크 의 마지막 컨벌루션 레이어에 대한 기울기 정보를 기반으로 한다. 구체적으로, 출력 값 의 활성화 에 대한 기울기는 역전파(via back propagation)로 계산할 수 있는데, 상기 기울기에 대해 전역 평균 풀링(global average pooling, GAP)된 가중치는 로 나타낼 수 있다. 즉, 대상 클래스 'c'를 분류하기 위해 입력이 주어진 신경망의 출력 값 의 Grad-CAM 맵 k에 관한 활성화 에 대한 기울기를 전역 평균 풀링된 가중치 는 수학식 1에 기반하여 계산할 수 있다. 수학식 1 여기서, y는 입력이 주어진 신경망의 예측 또는 출력, c는 시각화를 생성하려는 대상 클래스, A는 최종 컨볼루 션 레이어의 활성화 정도, k는 Grad-CAM 맵, Z는 활성화된 Grad-CAM 맵의 픽셀의 숫자를 나타낸다. 상기 전역 평균 풀링(global average pooling, GAP)은 중요한 정보를 유지하면서 텐서(데이터의 다차원 배열)의 공간 차원을 줄이기 위해 인공 신경망, 특히 컴퓨터 비전 분야에서 사용되는 기술로 컨볼루셔널 레이어의 출력 특징 맵에 적용될 수 있다. 한편, Grad-CAM(Gradient Class Activation Map)의 '로컬 맵'은 특히 특정 대상 클래스에 대한 신경망의 결정 에 대한 입력 이미지 내의 다양한 공간 영역 또는 위치의 중요성 또는 기여도를 나타내는 히트맵으로, 입력 이 미지의 어느 부분이 선택한 클래스에 대한 네트워크 예측에 가장 큰 영향을 미쳤는지 지역화하고 시각화하는 데 도움이 될 수 있다. 본 발명의 일 실시예로, 클래스 c에 따라 차별화한 로컬 맵 은 수학식 2에 기반하여 계산할 수 있 다. 수학식 2"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, c는 시각화를 생성하려는 대상 클래스, k는 Grad-CAM 맵, 는 클래스 c와 관련하여 k의 가중치, A는 최종 컨볼루션 레이어의 활성화 정도, ReLU는 Rectified Linear Unit 활성화 함수를 의미한다. ReLu는 목표로 하는 클래스에 영향을 미치는 특징들에만 초점을 둘 수 있다. <Grad-CAM++> Grad-CAM++은 Grad-CAM의 일반화 버전이고, 네트워크 결정을 더욱 시각화할 수 있다. Grad-CAM++에서 가중치 는 수학식 3에 기반하여 계산할 수 있다. 수학식 3"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, 는 에 대한 픽셀 별 기울기에 대한 가중치 계수, y는 입력이 주어진 신경망의 예측 또는 출력, c는 시각화를 생성하려는 대상 클래스, A는 최종 컨볼루션 레이어의 활성화 정도, k는 Grad-CAM 맵을 나타낸다. 여기서, 는 수학식 4에 기반하여 계산할 수 있다. 수학식 4"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "< 테스트 셋업 > 본 발명의 일 실시예로, 데이터 세트에서 사전 학습된 VGG16 모델을 재학습하기 위한 전이 학습 체계를 활용할 수 있다. 세부적인 조정 및 사전 학습한 VGG16 모델은 높은 레벨 특징(high level features)을 추출할 수 있으며 이 성능 은 다른 데이터 세트를 통해 일반화할 수 있다. 여기서 높은 레벨 특징(high level features)이란 픽셀 값, 색상 채널, 가장자리, 텍스처 또는 단순한 모양 등 을 포함하는 낮은 레벨 특징(low level features)보다 더 추상적이고 더 복잡한 패턴이나 개념을 나타내는 것으 로, 객체, 객체 일부, 객체의 관계성 또는 전체 장면을 나타낼 수 있고, 딥 네트워크를 처음부터 학습하려면 막 대한 계산 리소스, 상당히 레이블이 지정된 데이터 및 과도한 학습 시간이 필요하므로, 세 가지의 전이 학습 설 정을 통해 데이터를 탐색하고 표준 분류 메트릭, 학습 시간 및 일반화를 기반으로 비교할 수 있다. 우선 ImageNet 가중치로 사전 학습된 VGG16을 업로드하고, 모델의 마지막 완전 연결 레이어를 클래스 수(예: 4 개 클래스)로 조정할 수 있다. 심층 합성곱 신경망(Deep Convolutional Neural Network, DCNN)의 높은 레벨의 레이어(high-level layers)가 데이터 세트에 더 민감하게 반응한다는 가정에 기초하여 사전 학습된 모델의 마지막 레이어를 구성된 데이터 세 트에서 재학습하여 학습 매개변수를 업데이트할 수 있다. 본 발명에서는, 세 가지 전이 학습 설정에 따라 경사 하강법(Gradient descent) 및 역전파(back- propagation)를 사용할 수 있다. 도 4를 참조하면, (a) 분류 레이어만 다시 학습하는 경우, (b) 분류 레이어와 마지막 한개 컨볼루션 레이어도 다시 학습하는 경우, (c) 분류 레이어와 마지막 두개 컨볼루션 레이어도 다시 학습하는 경우의 세 가지 전이 학 습 기반의 학습 세팅을 나타낸다. 데이터 세트 이미지는 무작위로 세 개의 하위 집합으로 분할될 수 있다. 데이터 세트 이미지의 70%는 학습 세트에, 10%는 검증 세트에, 20%는 테스트 세트에 사용될 수 있다. 표 1은 각 분류에 따른 하위 세트의 이미지 수를 나타낸다. 표 1 본 발명의 일 실시예로, 과적합(overfitting)을 방지하기 위해 데이터 확대 기술(즉, 무작위 수평 및 수직 뒤집 기 및 무작위 회전)을 학습 세트에 적용할 수 있다. 모멘텀과 학습률이 작은 SGD(Stochastic Gradient Descent) 기반의 최적화 방법을 활용할 수 있는데, 이로써 계 산 부하를 줄이고 학습 컨버젼스를 가속화할 수 있다. 교차 엔트로피 손실 함수는 학습 속도 0.001, 모멘텀 0.9, 미니 배치 크기 32로 SGD를 사용하여 최적화될 수 있 다. < 메트릭 평가 > 본 발명의 일 실시예로, 각 학습 구성에서는 수학식 5 내지 8에 기반한 메트릭에 의해 평가될 수 있다. 수학식 5"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 6"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 7"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 8"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "여기서, TP(True Positives)는 교량 결함으로 올바르게 분류된 이미지의 수, TN(True Negatives)은 배경으로 올바르게 분류되는 배경 이미지의 수, FP(False Positives)는 교량 결함으로 잘못 식별된 배경 이미지의 수, FN(False Negatives)은 배경 이미지로 잘못 식별된 이미지의 수를 나타낸다. 본 발명의 성능을 평가하기 위하여, 세 가지 다른 전이 학습 체계에서 RMSE(Root Mean Squared Error)를 사용할 수 있고, 이는 수학식 9에 기반하여 계산할 수 있다. 수학식 9"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서, yi는 Ground Truth 클래스에 속하는(테스트 하위 집합에서) 이미지 i의 확률을 나타내고, Ground Truth 클래스는 지도 학습 문제에서 데이터 포인트의 참되고 정확한 클래스 레이블 또는 카테고리를 나타내며, 학습, 평가 및 테스트하기 위한 참조 지점 역할을 하여 모델이 정확한 예측을 수행하고 새로운 데이터에 대해 일반화 하는 방법을 학습하도록 도울 수 있다. 도 5를 참조하면, (a) 분류 레이어만 다시 학습하는 경우, (b) 분류 레이어와 마지막 한개 컨볼루션 레이어도 다시 학습하는 경우, (c) 분류 레이어와 마지막 두개 컨볼루션 레이어도 다시 학습하는 경우의 세 가지 전이 학 습 설정에 따른 모델의 학습 및 손실 곡선을 나타낸다. 도 5를 참조하면, 세 가지 모델이 학습 초반부터 빠르게 수렴되었음을 알 수 있는데, 이는 재학습할 레이어 수 가 감소하고 학습할 수 없는 레이어의 고정 매개변수 때문일 수 있다. 세 가지 학습 설정의 학습 및 검증 정확도는 일반적으로 시간이 지남에 따라 증가하여 마지막 세 에포크 주변이 정체기에 도달하고, (b)와 (c)의 손실 곡선은 해당 학습 체계에서 업데이트할 매개변수 수가 증가하기 때문에 과적합되는 경향을 나타내므로 2개가 넘는 컨볼루션 레이어를 학습하면 과대적합의 가능성이 커져 결과적으로 모델의 일반화 능력이 저하될 수 있다. 표 2는 세 가지의 학습 세팅에 대하여 최고의 학습 정확도, 최고의 타당성 정확도, 테스트 정확도, RMSE, 학습 시간을 나타낸다. 표 2"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "상기 세 가지 전이 학습 모델 중에서 모델 (c)가 모델 (a) 및 모델 (b)에 비해 더 나은 성능을 나타낸다. 구체적으로, 정확도는 모델 (c)에서 98.34%, 모델 (b) 및 모델 (a)에서 각각 94.62% 및 91.10%를 기록하였고, 설정 모델 (c)는 또한 모델 (b)와 모델 (a)에서 각각 94.61% 및 91.10%보다 97.13%의 더 높은 테스트 정확도를 산출했다. 또한, 1.21%의 과대적합(학습 정확도와 테스트 정확도의 차이로 계산됨)으로 얻어졌는데, 이는 모델 (c)가 하위 집합에서 보이지 않는 테스트 데이터로 학습을 확장할 때 더 나은 일반화 가능성을 가질 수 있음을 보여준다. 데이터 세트를 나타내는 더 중요한 특징이 사전 학습된 모델의 마지막 두 개의 컨볼루션 레이어에서 학습되었음 을 보여준다. 또한 평균 제곱근 오차(Root Mean Squared Error)는 재학습된 레이어가 많을수록 감소했다(각각 0.20에서 (c)는 0.15, (b) 및 (a)는 0.27). 더 많은 학습 매개변수를 업데이트하면 모델의 예측 능력이 향상됨을 나타낸다. 또한, 학습 시간 측면에서 세 가지 접근법 간의 차이는 상당히 낮고(예: 모델 (b)와 모델 (c) 사이에 8초), 동 시에 상당한 성능 향상이 관찰되었다(예: 모델 (b)와 모델 (c) 사이의 학습 정확도에서 1.61% 향상). 사전 학습된 VGG16의 분류 레이어와 마지막 두 컨볼루션 레이어를 미세 조정하는 것은 예측 성능, 학습 시간 및 과적합의 균형을 맞출 수 있다. 도 6을 참조하면, 테스트 하위 집합에서 학습된 DCNN의 성능을 더 시각화하기 위해 세 가지 학습 체계에 대한 정규화 혼동 행렬을 나타내고, 결과 값은 배경 및 백화 이미지와 배경 및 균열 사진 사이의 혼동을 반영한다. 구체적으로, 위 혼동은 모델 (a)와 모델 (b)에서 특히 관찰되었는데, 배경 이미지의 7%와 6%는 모델 (a)와 모델 (b)에서 각각 균열 또는 백화로 분류되었고, 배경 이미지의 3% 미만이 모델 (c)에서 균열 또는 백화로 예측되었 다. 위 혼동은 주로 색상과 질감 측면에서 콘크리트 표면의 복잡성과 관련이 있는데, 데이터 세트의 일부 표면가 변 화된 것(예: 얼룩, 표시, 크기 조정 및 분리와 같은 사소한 결함)은 구체적인 이미지의 특징과 같아 노이즈 결 함을 나타내며 결과적으로 특징 학습을 더욱 어렵게 만들 수 있다. 클래스 간의 혼동은 학습 데이터 세트에 더 많은 레이블이 지정된 샘플을 추가하고 추가 노이즈 제거 프로세스 를 이미지 데이터에 통합하여 추가로 처리할 수 있다. 도 7을 참조하면, 모델 (c)에서 사용된 학습 설정에서 몇 가지 오분류 예를 확인할 수 있다. 각 결함 클래스의 정밀도, 재현율 및 F1-점수는 혼동 행렬을 사용하여 계산된다. 구체적으로, 모델 (c)는 다른 학습 설정에 비해 더 높은 정확도, 재현율 및 F1 점수 결과를 달성했는데, 예를 들어, 86.64%, 94.03% 및 97.38%는 각각 학습 설정 (a), (b) 및 (c)에서의 균열 F1 점수이다. 구체적으로, 모델 (c)에서 3개 등급의 F1점수를 비교하면 백화 등급이 다른 불량품보다 낮은 점수를 받아 거의 비슷한 성능을 보였다(백화 95.01% 이상 백화 97.38% 이상, 균열 97.35% 이상). 이는 콘크리트에서 백화의 광범위한 표현과 이 결함 등급을 설명하는 데 필요한 특징의 복잡성에 기인할 수 있 다. 이러한 유형의 손상에 대한 다양한 표현을 광범위하게 다루는 더 많은 학습 데이터를 추가하여 해결할 수 있다. 표 3은 본 발명의 일 실시예에 따른 정밀도, 재현율, F1 스코어를 나타낸다. 표 3"}
{"patent_id": "10-2023-0123105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "< 결함 로컬화 > 도 8을 참조하면, 본 발명의 일 실시예로, 모델 (c)를 사용하여 학습된 모델을 사용하여 해석 기술을 구현한 결 과의 샘플 예를 나타낸다. 구체적으로, 히트맵은 이미지 분류에 기여한 차별적인 이미지 영역을 강조하여 표시할 수 있고, 히트맵은 각 픽 셀에서 대상 클래스의 확률을 보여줄 수 있다. 도 8에서 결과를 분석하면, 활성 영역이 주로 결함 영역과 일치한다는 것을 확인할 수 있다. 구체적으로, Grad-CAM++는 Grad-CAM에 비해 균열 및 백화 사례에 대해 더 나은 시각화 결과를 제공할 수 있는데, 임계값 0.5를 적용한 후 생성된 픽셀 수준 맵은 구체적인 결함의 대략적인 위치를 제공하고 결함과 배 경 사이의 픽셀 수준에서 의미상 의미 있는 식별을 제공할 수 있다."}
{"patent_id": "10-2023-0123105", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기반 콘크리트 교량 결함 식별 방법 흐름도 도 2는 본 발명의 일 실시예에 따른 데이터 세트의 샘플 이미지의 구성 도 3은 본 발명의 일 실시예에 따른 VGG 모델의 아키텍쳐 도 4는 본 발명의 일 실시예에 따른 전이 학습의 개요도 도 5는 본 발명의 일 실시예에 따른 학습 손실 그래프 도 6은 본 발명의 일 실시예에 따른 세 가지의 학습 세팅에 대한 혼동 행렬 도 7은 본 발명의 일 실시예에 따른 오분류된 예시들 도 8은 본 발명의 일 실시예에 따른 (c)학습 체계로 학습된 모델을 사용하여 해석 기술을 구현한 결과의 샘플 예 도 9는 본 발명의 일 실시예에 따른 인공지능 기반 콘크리트 교량 결함 식별 장치"}
