{"patent_id": "10-2022-0108201", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0029872", "출원번호": "10-2022-0108201", "발명의 명칭": "인공지능을 사용한 안저영상 생성 방법", "출원인": "성균관대학교산학협력단", "발명자": "신지태"}}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능을 사용한 안저영상 생성 방법에 있어서,제1 안저영상 데이터, 상기 제1 안저영상과 대응되는 안질환 정보 및 중증도 정보를 포함하는 제1 데이터셋, 제2 안저영상 데이터 및 상기 제2 안저영상과 대응되는 안질환 정보를 포함하는 제2 데이터셋, 및 검사대상자의안저 검사를 통해 획득한 제3 안저영상 데이터를 전처리하여 획득한 혈관 영상분할 정보 및 시신경 유두 영상분할 정보를 저장하는 단계;노이즈, 상기 제1 데이터셋의 안질환 정보 및 중증도 정보를 사용하여 병변 정보 지도를 생성하는 단계;상기 생성된 병변 정보 지도, 상기 제1 데이터셋의 안질환 정보 및 중증도 정보, 상기 혈관 영상분할 정보 및상기 시신경 유두 영상분할 정보를 사용하여 합성 안저영상을 생성하는 단계;상기 생성된 병변 정보 지도에 사용된 상기 제1 데이터셋의 안질환 정보를 기반으로 상기 생성된 합성 안저영상의 안질환을 특정하고, 상기 생성된 합성 안저영상 및 상기 제1 데이터셋의 제1 안저영상 데이터를 사용하여 상기 합성 안저영상의 특정된 안질환과 연관된 중증도를 판단하는 단계; 및상기 생성된 합성 안저영상, 상기 특정된 안질환 정보 및 상기 판단된 중증도 정보를 포함하는 합성 데이터셋을획득하는 단계를 포함하는, 안저영상 생성 방법."}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 합성 안저영상을 생성하는 단계는,상기 생성된 합성 안저영상 및 상기 제1 데이터셋의 제1 안저영상 데이터를 사용하여 상기 생성된 합성 안저영상의 합성 여부를 판단하는 단계;상기 합성 여부 판단 결과에 기반하여 상기 합성 안저영상이 실제의 안저영상에 대해 안저영상의 진위와 관련하여 같아지도록 학습하는 단계; 및상기 안저영상 진위와 관련한 학습을 통해 합성 안저영상을 생성하는 단계를 포함하는 것을 특징으로 하는 안저영상 생성 방법."}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 합성 안저영상을 생성하는 단계는,상기 제2 데이터셋의 제2 안저영상 데이터에서, 상기 생성된 합성 안저영상의 상기 특정된 안질환과 동일한 안질환의 제1 비교 안저영상을 획득하는 단계;상기 제2 데이터셋의 제2 안저영상 데이터에서, 상기 생성된 합성 안저영상의 상기 특정된 안질환과 다른 안질환의 제2 비교 안저영상을 획득하는 단계;상기 생성된 합성 안저영상 및 상기 제1 비교 안저영상을 기반으로 제1 특징값쌍을, 상기 생성된 합성 안저영상및 상기 제2 비교 안저영상을 기반으로 제2 특징값쌍을 추출하는 단계;상기 추출된 제1 특징값쌍을 서로 유사한 특징인 것으로, 상기 추출된 제2 특징값쌍을 서로 다른 특징인 것으로학습하는 단계; 및상기 추출된 특징값쌍들과 관련한 학습을 통해 합성 안저영상을 생성하는 단계를 포함하는 것을 특징으로 하는안저영상 생성 방법.공개특허 10-2024-0029872-3-청구항 4 제1항에 있어서,상기 중증도를 판단하는 단계는,상기 제1 데이터셋의 중증도 정보를 사용하여 상기 합성 안저영상의 특정된 안질환과 연관된 중증도를 판단하는것을 특징으로 하는 안저영상 생성 방법."}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 데이터셋은 병변 정답 정보를 추가적으로 포함하고,상기 병변 정보 지도는 상기 병변 정답 정보를 비교값으로 추가적으로 사용하여 생성되는 것을 특징으로 하는안저영상 생성 방법."}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제2 데이터셋은 상기 제2 안저영상과 대응되는 중증도 정보는 포함하지 않는 것을 특징으로 하는 안저영상생성 방법."}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 안저영상 생성 방법은 하나의 인공지능 장치에서 수행되는 것을 특징으로 하는 안저영상 생성 방법."}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "인공지능을 사용한 안저영상 생성 방법에 있어서,안저영상 데이터, 상기 안저영상 데이터와 대응되는 안질환 정보 및 중증도 정보를 포함하는 데이터셋 및 상기안저영상 데이터를 전처리하여 획득한 전처리 데이터를 저장하는 단계;상기 데이터셋을 기반으로 병변 정보 지도를 생성하는 단계;상기 병변 정보 지도, 상기 데이터셋 및 상기 전처리 데이터를 기반으로 합성 안저영상을 생성하는 단계;상기 병변 정보 지도 생성에 사용된 상기 안질환 정보를 기반으로 상기 생성된 합성 안저영상의 안질환을 특정하고, 상기 생성된 합성 안저영상 및 상기 데이터셋의 안저영상 데이터를 사용하여 상기 합성 안저영상의 특정된 안질환과 연관된 중증도를 판단하는 단계; 및상기 생성된 합성 안저영상, 상기 특정된 안질환 정보 및 상기 판단된 중증도 정보를 포함하는 합성 데이터셋을획득하는 단계를 포함하고,상기 데이터셋은 제1 및 제2 데이터셋을 포함하고, 상기 제2 데이터셋은 중증도 정보는 포함하지 않으며,상기 병변 정보 지도 생성, 상기 합성 안저영상 생성, 상기 중증도 판단에는 상기 제1 데이터셋이 사용되는 것을 특징으로 하는 안저영상 생성 방법."}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 합성 안저영상의 생성은,상기 생성된 합성 안저영상 및 상기 제1 데이터셋의 안저영상 데이터를 사용하여 상기 생성된 합성 안저영상의합성 여부를 판단하고, 상기 판단 결과에 기반하여 상기 합성 안저영상이 실제의 안저영상에 대해 안저영상의진위와 관련하여 같아지도록 학습함으로써 수행되는 것을 특징으로 하는 안저영상 생성 방법.공개특허 10-2024-0029872-4-청구항 10 제8항에 있어서,상기 합성 안저영상의 생성은,상기 제2 데이터셋의 제2 안저영상 데이터에서, 상기 생성된 합성 안저영상의 상기 특정된 안질환과 동일한 안질환 및 다른 안질환의 비교 안저영상들을 각각 획득하고, 상기 생성된 합성 안저영상 및 상기 비교 안저영상들을 기반으로 특징값쌍들을 추출하여 특징값들 간의 유사 여부가 상기 특정된 안질환과 상기 비교 안저영상들의안질환이 동일한지 여부에 따라 결정되도록 학습함으로써 수행되는 것을 특징으로 하는 안저영상 생성 방법."}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 전처리 데이터는 혈관 영상분할 정보 및 시신경 유두 영상분할 정보인 것을 특징으로 하는 안저영상 생성방법."}
{"patent_id": "10-2022-0108201", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 안저영상 생성 방법은 하나의 인공지능 장치에서 수행되는 것을 특징으로 하는 안저영상 생성 방법."}
{"patent_id": "10-2022-0108201", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법은, 제1 안저영상 데이터, 상기 제1 안저영 상과 대응되는 안질환 정보 및 중증도 정보를 포함하는 제1 데이터셋, 제2 안저영상 데이터 및 상기 제2 안저영 상과 대응되는 안질환 정보를 포함하는 제2 데이터셋, 및 검사대상자의 안저 검사를 통해 획득한 제3 안저영상 (뒷면에 계속)"}
{"patent_id": "10-2022-0108201", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 사용한 안저영상 생성 방법에 관한 것으로, 보다 구체적으로는 하나의 인공지능 장치에서 다양한 안질환 데이터를 같이 사용하는 방식으로 안질환 별 중증도에 따른 안저영상을 생성 가능한 인공지능을 사용한 안저영상 생성 방법에 관한 것이다."}
{"patent_id": "10-2022-0108201", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "안저 촬영은 현재 안과에서 빈번하게 시행되는 기본 검사로서, 환자의 안저영상을 획득하여 안질환 여부를 판단 하고 안질환의 중증도 단계를 파악하는데 사용된다. 안저영상으로부터 관찰 가능한 당뇨 망막 변증, 환자의 연 령과 관련된 황반 변성, 녹내장 등은 실명의 가장 흔한 원인들로 실명 원인이 되는 질환 중 상위권에 해당되는 중요한 질환이다. 특히 희귀 안과 질환의 경우에는 유병률은 낮으나 실명률이 높아 정확한 안질환 분석이 필요 하다. 정확도 높은 안질환 분석을 위해서는 전문가의 지식 습득 혹은 인공지능 학습이 필요하기에 안질환 별로 다른 중증도를 가진 안저영상이 대량으로 요구된다. 그러나 희귀 안질환의 안저영상, 특히 중증도 별로 구분된 안저 영상의 데이터셋을 확보하기에는 현실적인 어려움이 존재한다. 이에 대한 해결을 위해 인공지능 기반으로 안저영상을 생성하는 장치에 대한 연구가 진행되어 왔다. 하지만 기 존의 인공지능을 활용한 장치에서는 안저영상의 생성에 있어서, 안질환 별로, 중증도 별로 특징을 구분하여 반 영하지 못하고 하나의 안질환에 대한 안저영상만을 생성하는 한계가 있었다. 따라서 종전에는 소정 안질환에 대 한 안저영상 생성을 위해서 안질환의 수만큼의 독립적인 인공지능 장치가 필요하여 하나의 안질환에 대한 안저 영상 생성 시에는 다른 안질환의 데이터셋을 함께 사용하지 못하므로 각각의 안질환 별 인공지능 장치를 개발하 는데 필요한 안저영상이 상당히 많이 요구되는 문제점이 있었다."}
{"patent_id": "10-2022-0108201", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 바와 같은 종래 기술의 문제점을 해결하기 위한 것으로서, 하나의 인공지능 장치에서 다양한 안질환 데이터를 같이 사용하는 방식을 통해 보다 구축이 용이한 학습 데이터로 안질환 별 중증도에 따른 안저 영상을 생성 가능한 인공지능을 사용한 안저영상 생성 방법을 제공하는 것이다."}
{"patent_id": "10-2022-0108201", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 제1 특징에 따른 인공지능을 사용한 안저영상 생성 방법은, 제1 안저영상 데이터, 상기 제1 안저영상 과 대응되는 안질환 정보 및 중증도 정보를 포함하는 제1 데이터셋, 제2 안저영상 데이터 및 상기 제2 안저영상 과 대응되는 안질환 정보를 포함하는 제2 데이터셋, 및 검사대상자의 안저 검사를 통해 획득한 제3 안저영상 데 이터를 전처리하여 획득한 혈관 영상분할 정보 및 시신경 유두 영상분할 정보를 저장하는 단계; 노이즈, 상기 제1 데이터셋의 안질환 정보 및 중증도 정보를 사용하여 병변 정보 지도를 생성하는 단계; 상기 생성된 병변 정 보 지도, 상기 제1 데이터셋의 안질환 정보 및 중증도 정보, 상기 혈관 영상분할 정보 및 상기 시신경 유두 영 상분할 정보를 사용하여 합성 안저영상을 생성하는 단계; 상기 생성된 병변 정보 지도에 사용된 상기 제1 데이 터셋의 안질환 정보를 기반으로 상기 생성된 합성 안저영상의 안질환을 특정하고, 상기 생성된 합성 안저영상 및 상기 제1 데이터셋의 제1 안저영상 데이터를 사용하여 상기 합성 안저영상의 특정된 안질환과 연관된 중증도 를 판단하는 단계; 및 상기 생성된 합성 안저영상, 상기 특정된 안질환 정보 및 상기 판단된 중증도 정보를 포 함하는 합성 데이터셋을 획득하는 단계를 포함하는 것을 특징으로 한다. 본 발명의 제2 특징에 따른 인공지능을 사용한 안저영상 생성 방법은, 안저영상 데이터, 상기 안저영상 데이터 와 대응되는 안질환 정보 및 중증도 정보를 포함하는 데이터셋 및 상기 안저영상 데이터를 전처리하여 획득한 전처리 데이터를 저장하는 단계; 상기 데이터셋을 기반으로 병변 정보 지도를 생성하는 단계; 상기 병변 정보 지도, 상기 데이터셋 및 상기 전처리 데이터를 기반으로 합성 안저영상을 생성하는 단계; 상기 병변 정보 지도 생성에 사용된 상기 안질환 정보를 기반으로 상기 생성된 합성 안저영상의 안질환을 특정하고, 상기 생성된 합 성 안저영상 및 상기 데이터셋의 안저영상 데이터를 사용하여 상기 합성 안저영상의 특정된 안질환과 연관된 중 증도를 판단하는 단계; 및 상기 생성된 합성 안저영상, 상기 특정된 안질환 정보 및 상기 판단된 중증도 정보를 포함하는 합성 데이터셋을 획득하는 단계를 포함하고, 상기 데이터셋은 제1 및 제2 데이터셋을 포함하고, 상기 제2 데이터셋은 중증도 정보는 포함하지 않으며, 상기 병변 정보 지도 생성, 상기 합성 안저영상 생성, 상기 중 증도 판단에는 상기 제1 데이터셋이 사용되는 것을 특징으로 한다."}
{"patent_id": "10-2022-0108201", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법은 다음과 같은 효과를 제공한다. 안저영상 데이터, 관련된 안질환 정보 및 중증도 정보의 수집에 있어서, 중증도 정보가 포함된 데이터셋과 중증 도 정보가 포함되지 않은 상대적으로 풍부한 양의 데이터셋으로 저장하여 상기 데이터셋들을 기반으로 합성 안 저영상을 생성하고, 생성된 합성 안저영상의 안질환을 특정하여 하나의 인공지능 장치에서 특정된 안질환 별로 구분하여 중증도를 판단함으로써 보다 구축이 용이한 학습 데이터로 안질환 별 중증도에 따른 안저영상을 생성 가능하다. 좀 더 상세하게는, 안저영상 생성에 대한 인공지능 학습에 있어서, 중증도 정보가 포함된 데이터셋을 기반으로 합성 안저영상의 진위 판단을 통해 실제 안저영상에 근접한 출력값을 얻을 수 있도록 하고, 중증도 정보가 포함 되지 않은 데이터셋을 기반으로 안질환의 동일 여부를 판단하는 특징을 획득함으로써 동일 안질환과 관련된 데 이터 뿐 아니라 다른 안질환과 관련된 데이터도 활용하여 특정 안질환의 합성 안저영상을 생성할 수 있다. 유병률이 낮은 주요 실명 원인의 안질환들의 경우 대량의 원본 데이터 확보가 상당히 어렵다. 다양한 안질환의 중증도 별 안저영상을 생성함으로써 특히 유병률이 낮은 안질환에 대해서 이점을 가질 수 있다."}
{"patent_id": "10-2022-0108201", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 대해서 실시예 및 도면을 참조하여 구체적으로 설명한다. 그러나, 이하의 설명은 본 발명을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 도 1은 개시된 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법이 수행되는 장치를 개념적으로 도시한 도 면이다. 개시된 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법이 수행되는 장치는 안저영상 생성부 및 중증도 판별부를 포함할 수 있다. 안저영상 생성부를 통해서 데이터베이스화된 데이터를 기반으로 합성 안저영상이 생 성되고, 중증도 판별부를 통해서 생성된 합성 안저영상의 중증도를 판단하게 된다. 보다 구체적인 개시된 실시 예의 인공지능을 사용한 안저영상 생성 방법에 대해서는 이하에서 단계 별로 자세히 설명하도록 한다. 도 2는 개시된 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법에 사용되는 데이터의 종류 및 내용을 도 시한 도면이다. 도 2를 참조하면, 개시된 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법에 사용하기 위해 데이터베이스 에 저장되는 데이터에는, 안저영상 데이터, 안저영상과 관련된 안질환 정보 및 중증도 정보를 포함하는 제1 데 이터셋과 안저영상 데이터 및 안저영상과 관련된 안질환 정보를 포함하는 제2 데이터셋, 그리고 안저 검사를 받 는 검사대상자(여기서, 검사대상자는 환자 뿐 아니라 정상인도 포함됨)로부터 검사를 통해 직접 획득한 안저영 상 데이터를 전처리하여 추출한 전처리 데이터가 포함될 수 있다. 상기 제1 및 제2 데이터셋의 안저영상 데이터 는 기 촬영되어 기관 등이 보유하고 있는 안저영상 데이터를 수집한 것이고, 상기 전처리 데이터는 혈관 영상분 할 정보 및 시신경 유두 영상분할 정보이다. 제2 데이터셋은 제1 데이터셋과는 달리 중증도 정보를 포함하지 않고 있으며, 인공지능 학습 데이터의 구축에 있어서 안질환 정보와 대응되는 중증도 정보까지 포함하는 제1 데이터셋에 비해 보다 용이하게 수집이 가능하다. 도 3은 개시된 실시 예에 따른 합성 안저영상을 생성하는 과정을 개념적으로 도시한 도면이다. 도 3을 참조하면 개시된 실시 예에서, 안저영상 생성부는 병변 생성기, 안저영상 생성기, 진위 판별기를 포함할 수 있다. 병변 생성기를 통해 병변 정보 지도를 생성하고, 생성된 병변 정보 지도를 사용하여 안저영상 생성기 를 통해 합성 안저영상을 생성한다. 진위 판별기는 안저영상 생성기가 실제 안저영상과 유사한 합성 안저영상을 생성할 수 있도록 한다. 병변 생성기는 병변의 위치, 모양, 크기 등을 나타내는 병변 정보 지도를 생성한다. 병변 생성기는 노이즈, 안 질환 정보 및 중증도 정보를 입력값으로 사용하여 상기 입력값을 기반으로 안질환에 대한 병변 정보 지도를 생 성하게 된다. 안질환 정보 및 중증도 정보는 제1 데이터셋의 데이터를 사용한다. 개시된 일 실시 예에서, 병변 생성기는 인공지능 장치와 관련하여 Conditional Generative Adversarial Network(CGAN)를 사용하는 것이 바람 직할 수 있다. 한편, 개시된 일 실시 예에서, 제1 데이터셋은 병변 정답 정보를 추가적으로 포함할 수 있으며, 병변 정보 지도 는 병변 생성기를 통한 생성 시, 상술한 바와 같은 입력값에 추가적으로 상기 병변 정답 정보를 비교값으로 사 용하여 생성될 수 있다. 안저영상 생성기는 안질환 정보 및 중증도 정보와 일치하도록 합성 안저영상을 생성한다. 안저영상 생성기는 병 변 생성기에서 생성된 병변 정보 지도를 입력값으로 사용하고, 추가적으로 안질환 정보, 중증도 정보, 혈관 영 상분할 정보 및 시신경 유두 영상분할 정보를 입력값으로 사용한다. 안질환 정보 및 중증도 정보는 마찬가지로 제1 데이터셋의 데이터를 사용하고, 혈관 영상분할 정보 및 시신경 유두 영상분할 정보는 상술한 바와 같이 검 사대상자로부터 직접 획득한 안저영상 데이터의 전처리 데이터를 사용한다. 안저영상 생성기는 상기 입력값을 기반으로 소정 조건에 따라 소정 안질환의 중증도를 가진 합성 안저영상을 생 성하며, 일 실시 예에서 합성 안저영상은 컬러 영상일 수 있다. 개시된 일 실시 예에서, 안저영상 생성기는 인 공지능 장치와 관련하여 Conditional Variational Autoencoder(CVAE)를 사용하는 것이 바람직할 수 있다. 진위 판별기는 안저영상 생성기를 통해 생성되는 합성 안저영상이 실제의 안저영상에 대해 안저영상의 진위와 관련하여 같아질 수 있도록(다시 말하면, 합성 안저영상이 실제 안저영상처럼 최대한 보일 수 있도록) 기능한다. 진위 판별기는 안저영상 생성기에서 생성된 합성 안저영상 및 제1 데이터셋의 안저영상 데이터(일 예로, 제1 데 이터셋에서 추출된 실제 안저영상)를 입력값으로 사용하여 생성된 합성 안저영상의 합성 여부 즉, 진위를 판단 한다. 진위 판별기의 진위 판단을 통해 안저영상 생성기는 실제 안저영상과 같은 안저 영상을 생성할 수 있도록 학습된다. 개시된 일 실시 예에서, 진위 판별기는 인공지능 장치와 관련하여 Convolutional Neural Network(CNN) 기반의 모델을 사용하는 것이 바람직할 수 있다. 도 4는 개시된 실시 예에 따른 합성 안저영상으로 중증도를 판단하는 예시적인 과정을 도시한 도면이다. 도 4를 참조하면 개시된 실시 예에서, 중증도 판별부는 제1 데이터에 포함된 안질환 정보에 있어서 그 종류의 수만큼의 각각의 안질환 별 중증도 판별기를 포함할 수 있다. 안질환 별로 중증도는 다르게 구분되므로 안질환 별 중증도 판별기 각각은 해당 안질환의 기준에 맞춰 중증도의 구별이 가능하다. 보다 상세하게는, 병변 생성기의 입력값 중 하나인 안질환 정보(즉, 제1 데이터에 포함된 안질환 정보)를 사용 하여 안질환을 특정하고, 생성하는 합성 안저영상의 안질환과 동일한(즉, 특정된 안질환의) 중증도 판별기를 선 택한다. 선택된 중증도 판별기는 안저영상 생성부에서 생성된 합성 안저영상 및 제1 데이터셋의 안저영상 데이 터(일 예로, 제1 데이터셋에서 추출된 실제 안저영상)를 사용하여 합성 안저영상의 특정된 안질환과 연관된 중 증도를 판단하게 된다. 따라서, 특정된 안질환 정보 및 판단된 중증도 정보를 갖는 합성 안저영상을 획득할 수 있다. 개시된 실시 예에서, 중증도 판별기의 중증도 판단은 제1 데이터셋의 중증도 정보를 사용하여 안저영상 생성기 에서 생성된 합성 안저영상의 특정된 안질환과 연관된 중증도를 판단하도록 수행될 수 있다. 도 5는 개시된 실시 예에 따른 다양한 안질환 데이터셋을 활용하여 합성 안저영상 생성을 위한 학습을 수행하는 과정을 개념적으로 도시한 도면이다. 개시된 실시 예에서, 안저영상 생성기는 중증도 판별부를 통해 합성 안저영상과 동일 및 다른 안질환의 안저영 상들을 비교함으로써 학습될 수 있다. 합성 안저영상 및 비교 안저영상들은 중증도 판별부의 입력값으로 사용되 어 특징값이 추출될 수 있다. 비교 안저영상들은, 생성된 합성 안저영상의 특정된 안질환과 동일한 안질환 및 다른 안질환의 안저영상들을 제 2 데이터셋의 안저영상 데이터에서 추출한 데이터이다. 합성 안저영상 및 동일한 안질환의 안저영상으로부터 중 증도 판별부를 통해 추출된 특징값들은 Positive Pair로 설정하여 유사한 특징값을 포함하는 것으로 간주하고, 합성 안저영상 및 다른 안질환의 안저영상으로부터 중증도 판별부를 통해 추출된 특징값들은 Negative Pair로 설정하여 다른 특징값을 포함하는 것으로 간주하는 방식으로 학습이 이루어진다. 도 6은 개시된 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법을 순차적으로 나타내는 플로우차트이다. 개시된 실시 예에서, 인공지능을 사용한 안저영상 생성 방법이 수행되는 장치의 데이터베이스에는 안저영상 데 이터, 상기 안저영상 데이터와 대응되는 안질환 정보 및 중증도 정보를 포함하는 데이터셋 및 상기 안저영상 데 이터를 전처리하여 획득한 전처리 데이터가 저장된다. 병변 생성기는 데이터베이스에 저장된 데이터셋을 입력값으로 사용하여 병변 정보 지도를 생성한다. 안저영상 생성기는 생성된 병변 정보 지도를 기반으로 데이터베이스에 저장된 데이터셋 및 전처리 데이터를 사 용하여 합성 안저영상을 생성한다. 중증도 판별부는 병변 생성기에 사용된 안질환 정보를 기반으로 생성된 합성 안저영상의 안질환을 특정하여 중 증도 판별기를 선택하고, 생성된 합성 안저영상 및 데이터셋의 안저영상 데이터를 선택된 중증도 판별기의 입력 값으로 사용하여 중증도를 판별한다. 최종적으로, 특정 안질환에 대해 중증도가 판단된 합성 안저영상을 획득하고, 획득된 합성 안저영상과 연 관된 안질환 정보 및 중증도 정보는 데이터베이스 등 저장 장치에 저장된다.도 7은 개시된 실시 예에 따른 안질환 별로 중증도가 구분되어 생성된 예시적인 안저영상의 모습을 나타낸 도면 이다. 지금까지 설명한 바와 같이, 본 발명의 인공지능을 사용한 안저영상 생성 방법을 활용하면 하나의 인공지능 장 치에서 다양한 안질환 데이터를 같이 사용함으로써 보다 구축이 용이한 학습 데이터로 안질환 별 중증도에 따른 안저영상을 생성 가능한 장점이 달성된다. 한편, 본 발명의 실시예들은 컴퓨터로 읽을 수 있는 기록 매체에 컴퓨터가 읽을 수 있는 코드로 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록 매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록 장치를 포함한다. 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있으며, 또한 캐리어 웨이브(예를 들어 인터넷을 통한 전송)의 형태로 구현하는 것을 포함한다. 또한, 컴 퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산 방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고 본 발명을 구현하기 위한 기능적인(functional) 프로그램, 코 드 및 코드 세그먼트들은 본 발명이 속하는 기술 분야의 프로그래머들에 의하여 용이하게 추론될 수 있다. 다양한 변형예가 본 발명의 범위를 벗어남이 없이 본 명세서에 기술되고 예시된 구성 및 방법으로 만들어질 수 있으므로, 상기 상세한 설명에 포함되거나 첨부 도면에 도시된 모든 사항은 예시적인 것으로 본 발명을 제한하 기 위한 것이 아니다. 따라서, 본 발명의 범위는 상술한 예시적인 실시예에 의해 제한되지 않으며, 이하의 청구 범위 및 그 균등물에 따라서만 정해져야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2022-0108201", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 개시된 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법이 수행되는 장치를 개념적으로 도시한 도 면이다. 도 2는 개시된 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법에 사용되는 데이터의 종류 및 내용을 도 시한 도면이다. 도 3은 개시된 실시 예에 따른 합성 안저영상을 생성하는 과정을 개념적으로 도시한 도면이다. 도 4는 개시된 실시 예에 따른 합성 안저영상으로 중증도를 판단하는 예시적인 과정을 도시한 도면이다. 도 5는 개시된 실시 예에 따른 다양한 안질환 데이터셋을 활용하여 합성 안저영상 생성을 위한 학습을 수행하는 과정을 개념적으로 도시한 도면이다.도 6은 개시된 실시 예에 따른 인공지능을 사용한 안저영상 생성 방법을 순차적으로 나타내는 플로우차트이다. 도 7은 개시된 실시 예에 따른 안질환 별로 중증도가 구분되어 생성된 예시적인 안저영상의 모습을 나타낸 도면 이다."}
