{"patent_id": "10-2021-0145818", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0061012", "출원번호": "10-2021-0145818", "발명의 명칭": "CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템", "출원인": "주식회사 제이솔루션", "발명자": "장홍석"}}
{"patent_id": "10-2021-0145818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실시간 수위측정데이터 및 촬영 영상데이터를 수신하고, 기후 및 기상 관련 공공데이터를 수신하고, 수신된 수위측정데이터 및 영상데이터를 기초로 인공지능 알고리즘을 활용해 정확한 수위예측데이터를 생성하고, 수신된공공데이터와 지리정보데이터를 활용해 침수예측데이터를 생성하여, 생성된 수위예측데이터와 침수예측데이터를기반으로 수위예측 내지 침수예측 시각화 콘텐츠와 이와 연계된 재난 예경보 관련 콘텐츠를 생성하여, 디지털사이니지장치를 포함한 다양한 출력수단에 제공하고 관리하는 운영컴퓨터와; 상기 운영컴퓨터와 통신 접속되어 있거나 자체에 포함되어 있고, 상기 운영컴퓨터가 수신한 실시간 수위측정데이터 및 영상데이터 및 공공데이터를 저장시키고, 상기 운영컴퓨터가 생성한 수위예측데이터 및 침수예측데이터를 저장시키고, 상기 운영컴퓨터가 생성한 수위예측 내지 침수예측 시각화 콘텐츠를 저장한 데이터저장장치와; 상기 운영컴퓨터와 통신 접속되어 있고 모니터링 장소에 설치된 적어도 하나의 수위측정센서 등을 포함하여 해당 장소의 수위를 실시간으로 측정한 데이터를 상기 운영컴퓨터로 전송하는 수위데이터수집장치부와; 상기 운영컴퓨터와 통신 접속되어 있고 모니터링 장소에 설치된 CCTV를 포함하는 적어도 하나의 영상촬영카메라를 포함하여 해당 장소의 수위를 포함한 환경을 실시간으로 촬영한 영상데이터를 상기 운영컴퓨터로 전송하는영상데이터수집장치부와; 상기 운영컴퓨터가 통신 수단으로 접속하여 기후 및 기상 정보와 관련된 데이터를 수집할 수 있도록 공공데이터를 제공하는 적어도 하나의 공공기관컴퓨터를 포함하는 공공데이터제공장치부와; 상기 운영컴퓨터와 통신 접속되어 있고 상기 운영컴퓨터에서 생성한 수위예측 내지 침수예측 콘텐츠 및 재난 예경보 콘텐츠를 수신하여 출력시키는 디지털 사이니지, 스마트폰 또는 전용 단말기 등의 디지털출력장치를 포함하는 콘텐츠출력장치부를 포함하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템."}
{"patent_id": "10-2021-0145818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 운영컴퓨터는 수신한 수위측정데이터 및 영상데이터를 기반으로 빅데이터를 구축하고, 구축된 빅데이터에서 인공지능 알고리즘을 이용해 수위예측데이터를 생성하는 것을 특징으로 하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템."}
{"patent_id": "10-2021-0145818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 수위예측데이터를 생성하는 인공지능 알고리즘에서는, 수신된 수위측정데이터 및 영상데이터에서 침수 관심영역이 선정되고, 영상데이터의 색상 값을 활용하여 침수 정도를 판단하고 이를 기초로 수위예측데이터가 생성되는 것을 특징으로 하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템."}
{"patent_id": "10-2021-0145818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 운영컴퓨터는 생성된 상기 수위예측데이터를 지역별 조건정보를 반영하고 지리정보(GIS)를 적용시켜 침수모의시험을 수행한 후, 침수 모의시험 결과를 바탕으로 침수예측데이터를 지리정보(GIS)를 통해 시각화 콘텐츠로 생성시키는 것을 특징으로 하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템."}
{"patent_id": "10-2021-0145818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 운영컴퓨터에서의 수위예측 내지 침수예측 시각화 콘텐츠의 생성은, 특정 지역의 침수흔적도와 실시간 강공개특허 10-2023-0061012-3-우량 및 과거 시간별 강우량을 포함하는 공공데이터를 해당 지역의 지리정보(GIS)에 매핑하여 이루어지는 것을특징으로 하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템."}
{"patent_id": "10-2021-0145818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 수위데이터수집장치부의 적어도 하나의 수위측정센서는, 플로트의 움직임에 따른 수위를 측정하는 플로트수위계, 레이더 펄스반사방식의 레이더 수위계 및 압력식 수위계 중 어느 하나인 것을 특징으로 하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템."}
{"patent_id": "10-2021-0145818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 영상데이터수집장치부의 적어도 하나의 영상촬영카메라는, 모니터링 장소에 기 설치된 CCTV인 것을 특징으로 하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템."}
{"patent_id": "10-2021-0145818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "모니터링 장소의 실시간 수위측정데이터 및 해당 장소의 기후 및 기상 관련 공공데이터를 수신하여 빅데이터화및 분석을 관리하는 데이터관리컴퓨터와, 모니터링 장소의 촬영 영상데이터를 수신하여 영상/이미지데이터를 관리하는 영상관리컴퓨터와, 상기 데이터관리컴퓨터에서 제공된 수위측정데이터와 상기 영상관리컴퓨터에서 제공된 영상/이미지데이터를 기초로 인공지능 알고리즘을 활용해 모니터링 장소의 정확한 수위예측데이터를 생성하고 상기 데이터관리컴퓨터에서 제공된 공공데이터와 지리정보데이터를 활용해 침수예측데이터를 생성하여 생성된 수위예측데이터와 침수예측데이터를 기반으로 시각화 콘텐츠와 이와 연계된 재난 예경보 관련 콘텐츠를 생성하여 다양한 디스플레이 수단에 제공하고 관리하는 웹운영컴퓨터를 포함하는 운영컴퓨터부와; 상기 데이터관리컴퓨터와 통신 접속되어 있거나 자체에 포함되어 있고, 상기 데이터관리컴퓨터가 수신한 실시간수위측정데이터 및 적어도 하나의 공공기관컴퓨터로부터 수집한 공공데이터를 저장한 수집데이터저장장치, 상기영상관리컴퓨터가 수신한 모니터링 장소의 촬영 영상데이터 및 이미지데이터를 저장한 영상/이미지저장장치, 생성된 수위예측데이터 및 침수예측데이터를 기반으로 상기 웹운영컴퓨터가 생성한 침수예측 시각화 콘텐츠를 저장한 콘텐츠저장장치를 포함하는 데이터저장장치부와; 상기 데이터관리컴퓨터와 통신 접속되어 있고 모니터링 장소에 설치된 적어도 하나의 수위측정센서를 포함하여해당 장소의 수위를 실시간으로 측정한 데이터를 상기 데이터관리컴퓨터로 전송하는 수위데이터수집장치부와;상기 영상관리컴퓨터와 통신 접속되어 있고 모니터링 장소에 설치된 CCTV를 포함하는 적어도 하나의 영상촬영카메라를 포함하여 해당 장소의 수위를 포함한 환경을 실시간으로 촬영한 영상데이터를 상기 영상관리컴퓨터(200)로 전송하는 영상데이터수집장치부와; 상기 데이터관리컴퓨터가 통신 수단으로 접속하여 기후 및 기상 정보와관련된 데이터를 수집할 수 있도록 공공데이터를 제공하는 적어도 하나의 공공기관컴퓨터를 포함하는 공공데이터제공장치부와; 상기 웹운영컴퓨터와 통신 접속되어 있고 상기 웹운영컴퓨터에서 생성한 침수예측 콘텐츠 및재난 예경보 콘텐츠를 수신하여 출력시키는 디지털 사이니지, 스마트폰 또는 전용 단말기 등의 디지털출력장치를 포함하는 콘텐츠출력장치부를 포함하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및예방시스템."}
{"patent_id": "10-2021-0145818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "에 있어서,상기 디지털 사이니지장치는 표시영역을 갖고 상기 표시영역에는, 디지털 사이니지 전체 표시영역에 출력되는모니터링 장소의 침수예측 시각화 콘텐츠 영역과, 상기 침수예측 시각화 콘텐츠 영역의 소정 부위에 출력되는텍스트 형태의 재난상황전파 메시지 영역과, 상기 침수예측 시각화 콘텐츠 영역의 소정 부위에 출력되는 디지털사이니지장치 설치 지역의 기후 및 기상상태 정보 영역과, 상기 표시영역의 소정 부위에 출력되는 재난정보 및재난시 행동요령 등의 안내문을 표시하는 안내 정보 영역을 포함하는 것을 특징으로 하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템."}
{"patent_id": "10-2021-0145818", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 침수 재난/재해 예경보 시스템에 관한 것으로서, 본 발명에서는 침수 재난재해 예방의 비구조적 대책 으로 CCTV 영상과 수위센서의 빅데이터와 인공지능을 활용하여 수위예측 및 침수위험 지역을 예측하고, 예측 결 과를 일반 시민들이 쉽게 인식할 수 있도록 가시성과 전달력을 높여 웹, 모바일 및 사이니지로 출력시켜 침수가 발생하기 전에 미리 예경보 서비스를 제공함으로써 인명 피해와 재산손실을 최소화하는 CCTV와 사이니지를 활용 한 빅데이터 기반 침수 예경보 및 예방 시스템이 제시된다."}
{"patent_id": "10-2021-0145818", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 CCTV와 사이니지를 활용한 빅데이터 기반 스마트 도시 침수 예경보 및 예방시스템에 관한 것이다. 더 상세하게는 침수 재난재해 예방의 비구조적 대책으로 CCTV 영상데이터, 수위센서의 실시간 수위측정데이터 및 공공데이터를 수집하고, 수집된 데이터로 구축된 빅데이터를 분석하고 인공지능을 활용하여 수위예측 및 침수위 험 지역을 예측하고, 예측 결과를 일반 시민들이 쉽게 인식할 수 있도록 가시성과 전달력을 높여 웹, 모바일 및 사이니지로 표출하여 침수가 발생하기 전에 미리 예경보 서비스를 제공함으로써 인명 피해와 재산손실을 최소화 시키기 위한 발명이다."}
{"patent_id": "10-2021-0145818", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "CCTV의 실시간 영상데이터 및 수위측정데이터를 활용하여 지역의 침수를 예측하고 디지털 사이니지 등의 출력장 치를 이용하여 예경보하고자 하는 기술이 구현되고 있고, 그 효율성을 높이기 위한 연구가 활발하게 이루어지고 있다. 이와 관련하여, 대한민국 특허번호 제10-1719320호(등록일: 2017년03월17일)의 재난 예방용 수위 감시 시스템의 특허발명이 공개되어 있다. 상기 특허발명은, 하천의 수위를 포함한 환경 정보를 수집하는 센싱부와, 하나 이상의 카메라를 포함하고 카메 라로부터 촬영된 하천의 실시간 현장 영상을 제공하는 영상부 및 상기 센싱부 및 영상부로부터 하천의 실시간 환경 정보 및 영상 데이터를 전송받고 이를 취합하여 수위를 산출하는 산출부를 포함하는 영상수위감시장치; 및 유무선 통신망을 통해 상기 영상수위감시장치와 연동되어 하천의 환경 정보, 현장 영상 및 산출 데이터를 전달 받고 관리자의 요청 명령에 따른 처리 결과를 출력하는 운영서버;를 포함하는 구성이다. 상기 특허발명은 수신된 카메라 영상에 비교레벨을 매칭시키고 미리 설정된 기준수위레벨과 비교하여 현재의 수 위를 산출하여 제공하는 발명이므로, 해당 지역의 침수를 예측하여 예경보 정보를 제공할 수 없는 문제점이 있 다. 또한, 대한민국 특허번호 제10-2018151호(등록일: 2019년08년29일)의 영상기준 재난상황 관리시스템의 특허발명 이 공개되어 있다. 상기 특허발명은, 지능형 CCTV를 기반으로 하여 자동 수위감지 시스템의 실시간 수위감지 정보 수집과 위치정보 기반 정보표출 및 수위감지영상의 실시간 스트리밍을 제공함으로써, 급박한 재난상황에서 신속, 정확하게 대처 할 수 있도록 하는 영상기준 재난상황 관리시스템으로서, CCTV 영상을 기반으로 위험수위 감지시스템이 분석하 는 수위감지정보를 수집 및 적재하여, 사용자의 데이터 요청이 있는 경우 적재된 정보를 호출하여 GIS기반으로 지도상에서 CCTV 지점과 감지정보를 시각화하여 제공하는 구성이다. 상기 특허발명은 CCTV에서 확보한 영상을 기준으로 GIS 기반 현재의 수위감지영상을 제공하기 위해 지능형 CCTV 를 신규 설치해야 하는 문제점과, 해당 지역의 침수를 예측하여 예경보 정보를 제공할 수 없는 문제점이 있다. 또한, 대한민국 특허번호 제10-2043999호(등록일: 2019년11월06일)의 홍수 예/경보를 위한 브레이니 RTU 및 이 를 이용한 강우 예측 방법과 화재/침수 관련 알람 전송 방법의 특허발명이 공개되어 있다. 상기 특허발명은, 수위 센서 및 우량 센서에서 측정된 수위 데이터 및 우량 데이터를 수신하는 RTU측 측정 데이 터 수신 모듈; 상기 RTU측 측정 데이터 수신 모듈에서 수신된 수위 데이터 및 우량 데이터를 홍수 예/경보를 위 해 사용자 단말로 실시간 송신하는 측정 데이터 송신 모듈; 온도 센서로부터 온도 데이터를 수신하고, 습도 센 서로부터 습도 데이터를 수신하고, 기상 센서로부터 기상 데이터를 수신하는 센서값 측정 모듈; CCTV 카메라로 부터 주변의 영상 데이터 및 상기 브레이니 RTU가 설치된 국사의 영상 데이터를 수신하는 RTU측 영상 데이터 수 신 모듈; 인공위성으로부터 위성통신 데이터를 수신하는 위성통신 데이터 수신 모듈; 상기 센서값 측정 모듈에 서 수신된 온도 데이터, 습도 데이터 및 기상 데이터와, 상기 RTU측 영상 데이터 수신모듈에서 수신된 영상 데 이터와, 상기 위성통신 데이터 수신 모듈에서 수신된 위성통신 데이터의 강우 감쇠에 따른 데이터 결측 현상을 각각 분석하여 강우 예측값을 생성하는 인공지능 분석 모듈; 상기 인공지능 분석 모듈에서 생성된 강우 예측값 을 사용자 단말로 송신하는 강우 예측값 송신 모듈; 상기 수위 데이터 및 우량 데이터가 소정 기준 이상인 경우 홍수 예/경보 알람을 사용자 단말로 실시간 송신하거나 화재/침수 관련 알람을 생성하여 사용자 단말로 송신하 는 알람 송신 모듈; 상기 RTU측 영상 데이터 수신 모듈에서 수신된 CCTV 카메라 주변의 영상 데이터 및 상기 브 레이니 RTU가 설치된 국사의 영상 데이터를 상기 사용자 단말로 송신하는 영상 데이터 송신 모듈; 상기 사용자 단말로부터 상기 브레이니 RTU를 원격 제어하기 위한 명령을 수신하는 무선 입력 명령 수신 모듈; 상기 사용자 로부터 상기 브레이니 RTU를 제어하기 위한 버튼 입력을 받는 버튼 입력 모듈; 상기 사용자의 상기 브레이니 RTU를 제어하기 위한 터치 입력을 받는 터치 입력 모듈을 포함하는 구성의 발명이다. 상기 특허발명은 현장에 RTU를 설치하여야 하므로 해당 RTU의 유지 관리 및 모니터링에 어려움이 있는 문제가 있다. 따라서, 도시 등의 하천에 설치되어 있는 기존의 CCTV와 수위측정장치를 활용하여 실시간 수위측정데이터 및 영 상데이터를 확보하여 수위관련 빅데이터를 구축하고 이를 기반으로 수위예측을 위한 인공지능 알고리즘을 적용 하여 정확한 수위예측데이터를 도출하고, 실시간 수집되는 해당 지역의 기후 등의 공공데이터를 기초로 GIS 기 반의 침수예측 매핑데이터를 생성하여, 실측데이터 기반의 수위예측데이터와 공공데이터 기반의 침수예측 매핑 데이터를 기초로 해당 지역의 침수예측을 시각화하여 디지털 사이니지 등의 출력장치에 송출하여 디스플레이시 키는 재난 예경보 및 예방시스템의 발명이 요망된다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허번호 제10-1719320호(등록일: 2017년03월17일) (특허문헌 0002) 대한민국 특허번호 제10-2018151호(등록일: 2019년08년29일) (특허문헌 0003) 대한민국 특허번호 제10-2043999호(등록일: 2019년11월06일)"}
{"patent_id": "10-2021-0145818", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기 종래기술의 문제점을 해결하기 위한 것으로서, 본 발명의 목적은 침수 재난재해 예방의 비구조 적 대책으로 CCTV 영상과 수위센서의 빅데이터와 인공지능을 활용하여 수위예측 및 침수위험 지역을 예측하고, 예측 결과를 일반 시민들이 쉽게 인식할 수 있도록 가시성과 전달력을 높여 웹, 모바일 및 사이니지로 출력시켜 침수가 발생하기 전에 미리 예경보 서비스를 제공함으로써 인명 피해와 재산손실을 최소화하는 CCTV와 사이니지 를 활용한 빅데이터 기반 침수 예경보 및 예방 시스템을 제공함에 있다."}
{"patent_id": "10-2021-0145818", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 목적을 달성하기 위한 기술적 해결 수단으로서, 본 발명의 제1 관점으로, 실시간 수위측정데이터 및 촬영 영상데이터를 수신하고, 기후 및 기상 관련 공공데이터를 수신하고, 수신된 수위측정데이터 및 영상데이터 를 기초로 인공지능 알고리즘을 활용해 정확한 수위예측데이터를 생성하고, 수신된 공공데이터와 지리정보데이 터를 활용해 침수예측데이터를 생성하여, 생성된 수위예측데이터와 침수예측데이터를 기반으로 시각화 콘텐츠와 이와 연계된 재난 예경보 관련 콘텐츠를 생성하여, 다양한 디스플레이 수단에 제공하고 관리하는 운영컴퓨터와; 상기 운영컴퓨터와 통신 접속되어 있거나 자체에 포함되어 있고, 상기 운영컴퓨터가 수신한 실시간 수위측정데 이터 및 영상데이터 및 공공데이터를 저장시키고, 상기 운영컴퓨터가 생성한 수위예측데이터 및 침수예측데이터를 저장시키고, 상기 운영컴퓨터가 생성한 침수예측 시각화 콘텐츠를 저장한 데이터저장장치와; 상기 운영컴퓨 터와 통신 접속되어 있고 모니터링 장소에 설치된 적어도 하나의 수위측정센서 등을 포함하여 해당 장소의 수위 를 실시간으로 측정한 데이터를 상기 운영컴퓨터로 전송하는 수위데이터수집장치부와; 상기 운영컴퓨터와 통신 접속되어 있고 모니터링 장소에 설치된 CCTV를 포함하는 적어도 하나의 영상촬영카메라를 포함하여 해당 장소의 수위를 포함한 환경을 실시간으로 촬영한 영상데이터를 상기 운영컴퓨터로 전송하는 영상데이터수집장치부와; 상기 운영컴퓨터가 통신 수단으로 접속하여 기후 및 기상 정보와 관련된 데이터를 수집할 수 있도록 공공데이터 를 제공하는 적어도 하나의 공공기관컴퓨터를 포함하는 공공데이터제공장치부와; 상기 운영컴퓨터와 통신 접속 되어 있고 상기 운영컴퓨터에서 생성한 침수예측 콘텐츠 및 재난 예경보 콘텐츠를 수신하여 출력시키는 디지털 사이니지, 스마트폰 또는 전용 단말기 등의 디지털출력장치를 포함하는 콘텐츠출력장치부를 포함하는 CCTV와 사 이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템이 제시된다. 또한, 본 발명의 제2 관점으로, 모니터링 장소의 실시간 수위측정데이터 및 해당 장소의 기후 및 기상 관련 공 공데이터를 수신하여 빅데이터화 및 분석을 관리하는 데이터관리컴퓨터와, 모니터링 장소의 촬영 영상데이터를 수신하여 영상/이미지데이터를 관리하는 영상관리컴퓨터와, 상기 데이터관리컴퓨터에서 제공된 수위측정데이터 와 상기 영상관리컴퓨터에서 제공된 영상/이미지데이터를 기초로 인공지능 알고리즘을 활용해 모니터링 장소의 정확한 수위예측데이터를 생성하고 상기 데이터관리컴퓨터에서 제공된 공공데이터와 지리정보데이터를 활용해 침수예측데이터를 생성하여 생성된 수위예측데이터와 침수예측데이터를 기반으로 시각화 콘텐츠와 이와 연계된 재난 예경보 관련 콘텐츠를 생성하여 다양한 디스플레이 수단에 제공하고 관리하는 웹운영컴퓨터를 포함하는 운 영컴퓨터부와; 상기 데이터관리컴퓨터와 통신 접속되어 있거나 자체에 포함되어 있고, 상기 데이터관리컴퓨터가 수신한 실시간 수위측정데이터 및 적어도 하나의 공공기관컴퓨터로부터 수집한 공공데이터를 저장한 수집데이터 저장장치, 상기 영상관리컴퓨터가 수신한 모니터링 장소의 촬영 영상데이터 및 이미지데이터를 저장한 영상/이 미지저장장치, 생성된 수위예측데이터 및 침수예측데이터를 기반으로 상기 웹운영컴퓨터가 생성한 침수예측 시 각화 콘텐츠를 저장한 콘텐츠저장장치를 포함하는 데이터저장장치부와; 상기 데이터관리컴퓨터와 통신 접속되어 있고 모니터링 장소에 설치된 적어도 하나의 수위측정센서를 포함하여 해당 장소의 수위를 실시간으로 측정한 데이터를 상기 데이터관리컴퓨터로 전송하는 수위데이터수집장치부와; 상기 영상관리컴퓨터와 통신 접속되어 있 고 모니터링 장소에 설치된 CCTV를 포함하는 적어도 하나의 영상촬영카메라를 포함하여 해당 장소의 수위를 포 함한 환경을 실시간으로 촬영한 영상데이터를 상기 영상관리컴퓨터로 전송하는 영상데이터수집장치부와; 상기 데이터관리컴퓨터가 통신 수단으로 접속하여 기후 및 기상 정보와 관련된 데이터를 수집할 수 있도록 공공데이 터를 제공하는 적어도 하나의 공공기관컴퓨터를 포함하는 공공데이터제공장치부와; 상기 웹운영컴퓨터와 통신 접속되어 있고 상기 웹운영컴퓨터에서 생성한 침수예측 콘텐츠 및 재난 예경보 콘텐츠를 수신하여 출력시키는 디지털 사이니지, 스마트폰 또는 전용 단말기 등의 디지털출력장치를 포함하는 콘텐츠출력장치부를 포함하는 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템이 제시된다."}
{"patent_id": "10-2021-0145818", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 하천, 교량 등에 기 설치된 CCTV를 활용하여 도시침수 재난으로 인한 재산손실 절감 및 인명 피해를 예방할 수 있고, 실시간 수위측정데이터 및 영상데이터를 분석하여 인공지능 알고리즘에 적용시킴으로써 보다 정확한 수위예측데이터를 생성할 수 있고, 해당 장소의 기후 및 기상 관련 공공데이터를 가져와 지리정보 와 접목시켜 침수예측데이터를 생성함으로써 정확한 수위예측 및 침수예측을 시각화하여 제공할 수 있고, 디지 털 사이니지장치를 하천, 교량, 배수펌프장 도로알림판(전광판), 저지대 주택가, 저지대업소 등의 침수 재난 취 약 장소에 설치하여 침수를 예경보할 수 있으므로 필요한 장소의 재난 예경보 서비스를 효율적으로 제공할 수 있는 효과가 있다."}
{"patent_id": "10-2021-0145818", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 본 발명의 실시예를 첨부한 도면을 참조하면서 상세히 설명하기로 한다. 본 발명의 실시예의 설명에 사용되는 용어에 관해 정의하기로 한다. 본 발명에서 사용하는 각종 컴퓨터는 하드 웨어 자체 구성일 수 있고, 그 하드웨어 자원을 활용하는 컴퓨터 프로그램, 웹프로그램의 구성일 수 있다. 예를 들면 본 발명의 운영컴퓨터, 데이터관리컴퓨터, 영상관리컴퓨터, 웹운영컴퓨터 및 공공데이터컴퓨터는 해당 컴 퓨터에 포함된 하드웨어의 각 구성으로 이루어질 수 있고, 해당 컴퓨터의 저장수단인 메모리에 저장된 웹프로그 램 또는 컴퓨터프로그램의 각 구성요소가 컴퓨터의 레지스터에 저장된 명령어 및 알고리즘 등을 포함하는 중앙 처리장치(CPU)의 적어도 하나의 하드웨어 프로세서를 포함하는 자원을 활용하여 실행되는 구성일 수 있다. 또한, 본 발명의 실시예 설명에서 사용되거나 사용될 수 있는 용어 중 수위데이터수집장치부, 영상데이터수집장 치부, 운영컴퓨터부, 데이터저장장치부에서 사용된 '~부'는 관련된 장치가 또는 컴퓨터가 적어도 하나 이상을 포함하는 구성을 나타낼 수 있다. 또한, '~모듈'은 하드웨어로 이루어진 구성요소 또는 하드웨어 자원을 활용하여 실행되는 컴퓨터프로그램 또는 웹프로그램으로 이루어진 구성요소를 나타낼 수 있다. 본 발명의 실시예에서는 상기 용어들이 웹프로그램 또는 컴퓨터프로그램의 각 구성요소를 나타내는 용어로 주로 사용된다. 그 밖에 여기서 정의하지 않는 용어 또는 표현은 그 용어나 표현에 얽매이는 것이 아니고, 나타내는 구성요소의 작용이나 기능의 내용에 더 큰 의미가 있음은 물론이다. 도 1은 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템의 실시예에 관한 개략적 인 구성도이다. 도 1에 도시한 바와 같이 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템은, 실 시간 수위측정데이터 및 촬영 영상데이터를 수신하고, 기후 및 기상 관련 공공데이터를 수신하고, 수신된 수위 측정데이터 및 영상데이터를 기초로 인공지능 알고리즘을 활용해 정확한 수위예측데이터를 생성하고, 수신된 공 공데이터와 지리정보데이터를 활용해 침수예측데이터를 생성하여, 생성된 수위예측데이터와 침수예측데이터를 기반으로 침수예측 시각화 콘텐츠와 이와 연계된 재난 예경보 관련 콘텐츠를 생성하여, 다양한 디스플레이 수단 에 제공하고 관리하는 운영컴퓨터와; 상기 운영컴퓨터와 통신 접속되어 있거나 자체에 포함되어 있 고, 상기 운영컴퓨터가 수신한 실시간 수위측정데이터 및 영상데이터 및 공공데이터를 저장시키고, 상기 운영컴퓨터가 생성한 수위예측데이터 및 침수예측데이터를 저장시키고, 상기 운영컴퓨터가 생성한침수예측 시각화 콘텐츠를 저장한 데이터저장장치와; 상기 운영컴퓨터와 통신 접속되어 있고 모니 터링 장소에 설치된 적어도 하나의 수위측정센서 등을 포함하여 해당 장소의 수위를 실시간으로 측정한 데이터를 상기 운영컴퓨터로 전송하는 수위데이터수집장치부와; 상기 운영컴퓨터와 통신 접 속되어 있고 모니터링 장소에 설치된 CCTV를 포함하는 적어도 하나의 영상촬영카메라를 포함하여 해당 장 소의 수위를 포함한 환경을 실시간으로 촬영한 영상데이터를 상기 운영컴퓨터로 전송하는 영상데이터수집 장치부와; 상기 운영컴퓨터가 통신 수단으로 접속하여 기후 및 기상 정보와 관련된 데이터를 수집 할 수 있도록 공공데이터를 제공하는 적어도 하나의 공공기관컴퓨터를 포함하는 공공데이터제공장치부 와; 상기 운영컴퓨터와 통신 접속되어 있고 상기 운영컴퓨터에서 생성한 침수예측 콘텐츠 및 재난 예경보 콘텐츠를 수신하여 출력시키는 디지털 사이니지, 스마트폰 또는 전용 단말기 등의 디지털출력장치 를 포함하는 콘텐츠출력장치부를 포함하는 구성이다. 상기 운영컴퓨터는, 모니터링 장소의 실시간 수위측정데이터, 영상데이터 및 기후 관련 공공데이터를 수 집하여 수집된 데이터를 빅데이터화하고, 구축된 빅데이터를 정확성이 향상된 인공지능 알고리즘을 활용해 수위 예측데이터를 생성하고, 기후 관련 공공데이터와 지리(GIS)정보를 활용하여 침수예측데이터를 생성하고, 생성된 수위예측데이터와 침수예측데이터를 침수예측 시각화 콘텐츠로 생성하여 디지털 사이니지 등의 출력장치에 전송 하도록 실행되는 컴퓨터 프로그램 또는 웹프로그램의 실행을 제어하는 구성으로서, 통신 수단을 구비하고 있고 적어도 하나의 하드웨어 프로세서와 메모리를 구비하고 있는 서버컴퓨터로 구성될 수 있다. 상기 데이터저장장치는, 상기 운영컴퓨터에서 수집한 수위측정데이터, 영상데이터 및 공공데이터를 저장시키고, 이들 데이터로 구축된 빅데이터를 저장시키고, 상기 운영컴퓨터의 요구에 부응하여 데이터를 제공하고 관리하는 데이터베이스 매니지먼트 시스템(DBMS)으로 구성될 수 있다. 상기 수위데이터수집장치부는 모니터링 장소에 각각 설치된 적어도 하나의 수위측정센서를 포함하 되, 상기 수위측정센서는 교량, 하천, 배수펌프장을 포함하는 모니터링 장소에 설치되어 수위를 실시간으 로 측정하여 운영컴퓨터로 전송하는 장치로서, 예를 들면 부자의 움직임에 따라서 수위를 측정하는 초정 밀 플로트 수위계, 레이더 펄스 방식으로 수위를 측정하는 레이더 수위계 또는 액위의 변화에 따른 압력값을 단 부에 설치된 압전소자가 감지하여 수위를 측정하는 압력식 수위계 중 적어도 하나로 구성될 수 있다. 그러나 수 위측정센서의 종류는 이에 한정되는 것이 아니다. 상기 영상데이터수집장치부는 모니터링 장소에 각각 설치된 적어도 하나의 영상촬영카메라를 포함 하되, 상기 영상촬영카메라는 예를 들면, 모니터링 장소의 수위 영상을 촬영하여 실시간 촬영 영상 또는 설정된 수의 이미지로 상기 운영컴퓨터로 전송하는 해당 장소에 기 설치된 적어도 하나의 폐쇄회로텔레비 전(CCTV)를 기본으로 하고, 선택된 위치에 신규 설치된 적어도 하나의 CCTV를 포함하여 구성될 수 있다. 상기 공공데이터제공장치부는 날씨, 강우량, 온습도, 자외선 지수 등의 기후 및 기상 관련 데이터를 제공 하는 공공기관에서 운용하는 적어도 하나의 공공기관컴퓨터로서, 상기 운영컴퓨터에서 주기적 또는 수시로 데이터를 요청하면 상기 운영컴퓨터에 요구 데이터를 제공하는 공공기관의 서버컴퓨터로 구성될 수 있다. 상기 콘텐츠출력장치부는, PC, 노트북, 텔레비전과 같은 웹서비스 출력 디바이스, 웹 또는 앱프로그램을 실행시켜 서비스를 출력하는 모바일 디바이스 및 각 모니터링 장소 또는 그 장소와 근접한 위치에 설치된 디지 털 사이니지 장치를 포함하여 구성될 수 있다. 도 2는 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템의 주요부인 운영컴퓨터 의 실시예에 관한 개략적인 구성도이다. 도 2에 도시한 바와 같이 본 발명의 운영컴퓨터는, 모니터링 장소에 설치되어 실시간으로 수위를 측정하는 적어 도 하나의 수위측정센서의 고유 식별정보를 포함하는 정보를 관리하는 수위데이터수집장치관리모듈(110 0)과; 모니터링 장소에 설치되어 실시간으로 수위 영상을 촬영하는 적어도 하나의 영상촬영카메라의 고유 식별정보를 포함하는 정보를 관리하는 영상데이터수집장치관리모듈과; 모니터링 장소와 관련되어 기후 및 기상 정보를 제공하는 적어도 하나의 공공기관컴퓨터로부터 기후 및 기상 관련 데이터를 수집하기 위한 크 롤러 등의 공공데이터수집수단의 정보를 관리하는 공공데이터수집수단관리모듈과; 상기 수위데이터수집장 치부 및 영상데이터수집장치부에서 수집된 실시간 수위데이터 및 영상데이터를 기반으로 빅데이터 화하여 저장시키고 관리하는 수집데이터정보관리모듈과; 상기 운영컴퓨터의 요구에 의해 적어도 하 나의 공공기관컴퓨터가 제공한 기후 및 기상 관련 공공데이터를 수신하여 해당 장소의 지리정보를 조회하여 저장시키고 관리하는 공공데이터정보관리모듈과; 상기 수위데이터 및 영상데이터를 기반으로 구축된 빅데이터를 분석하여 수위예측 알고리즘을 적용해 정확성이 향상된 수위예측데이터를 생성하고, 상기 공공데이 터 및 해당 장소와 관련된 지리정보(GIS)를 접목하여 침수예측 알고리즘을 적용하여 침수예측데이터를 생성하여 저장시키고 관리하는 침수예측정보관리모듈과; 상기 침수예측데이터를 유무선 웹서비스 디바이스, 앱서비 스 디바이스 및 디지털 사이니지를 포함하는 출력장치에 디스플레이시키기에 적합한 시각화 콘텐츠로 생성시키 고 관리하는 콘텐츠정보관리모듈과; 상기 운영컴퓨터가 상기 시각화 콘텐츠를 전송하여 출력시키기 위한 적어도 하나의 유무선 디지털출력장치의 식별 정보를 포함한 정보를 관리하는 콘텐츠출력수단관리모듈 과; 적어도 하나의 수위측정센서, 적어도 하나의 영상촬영카메라, 적어도 하나의 공공기관컴 퓨터와의 통신프로토콜, 적어도 하나의 디지털출력장치와의 통신프로토콜 정보를 관리하는 통신정 보관리모듈을 포함하는 구성이다. 도 3은 본 발명의 운영컴퓨터의 주요부인 수위데이터수집장치관리모듈의 실시예에 관한 개략적인 구성도이다. 도 3에 도시한 바와 같이 본 발명의 수위데이터수집장치관리모듈은, 모니터링 장소에 설치된 적어도 하나 의 수위측정센서의 고유 식별정보 및 설치 위치 정보 등을 저장시키고 디바이스의 상태 정보를 모니터링 할 수 있는 수위측정센서정보관리모듈과; 상기 수위측정센서가 구비하고 있는 감지된 수위신호를 수신하여 설정된 통신프로토콜을 통해 상기 운영컴퓨터에 수위측정데이터를 송신하는 미들웨어수단의 정 보를 관리하는 미들웨어통신정보관리모듈을 포함하는 구성이다. 도 4는 본 발명의 운영컴퓨터의 주요부인 영상데이터수집장치관리모듈의 실시예에 관한 개략적인 구성도이다. 도 4에 도시한 바와 같이 본 발명의 영상데이터수집장치관리모듈은, 모니터링 장소에 설치된 적어도 하나 의 영상촬영카메라의 고유 식별정보 및 설치 위치 정보 등을 저장시키고 디바이스의 상태 정보를 모니터 링할 수 있는 영상카메라정보관리모듈과; 상기 영상촬영카메라가 구비하고 있는 촬영된 영상데이터 를 수신하여 설정된 통신프로토콜을 통해 상기 운영컴퓨터에 영상데이터를 송신하는 미들웨어수단의 정보 를 관리하는 미들웨어통신정보관리모듈을 포함하는 구성이다. 도 5는 본 발명의 운영컴퓨터의 주요부인 공공데이터수집수단관리모듈의 실시예에 관한 개략적인 구성도이다. 도 5에 도시한 바와 같이 본 발명의 공공데이터수집수단관리모듈은, 날씨, 강우량, 온습도, 자외선 지수 를 포함하는 기후 및 기상 관련 공공데이터를 제공하는 포털사이트를 운영하는 적어도 하나의 공공기관의 정보 및 운용하는 공공기관컴퓨터 정보를 관리하는 공공데이터제공기관정보관리모듈과; 적어도 하나의 공공기 관컴퓨터에서 운용하는 포털사이트에 상기 포털사이트가 제공하는 API를 활용하여 접속한 후 설정한 데이터를 수집하는 크롤러를 포함하는 공공데이터수집수단의 식별정보를 포함한 정보를 관리하는 공공데이터수집수단정보 관리모듈을 포함하는 구성이다. 도 6은 본 발명의 운영컴퓨터의 주요부인 수집데이터정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 6에 도시한 바와 같이 본 발명의 수집데이터정보관리모듈은, 상기 수위데이터수집장치부 및 영 상데이터수집장치부에서 수집된 실시간 수위데이터 및 영상데이터를 기초로 텍스트마이닝, 통계기법 및 옵션분석을 포함하는 분석을 통하여 빅데이터로 구축하고 업데이트를 관리하는 빅데이터구축정보관리모듈(141 0)과; 빅데이터로 구축된 수위데이터 및 영상데이터에서 수위예측데이터를 생성시키기 위해 운영컴퓨터의 요구에 부응하여 해당 기초분석데이터를 조회하고 관리하는 기초분석데이터관리모듈을 포함하는 구성이다. 도 7은 본 발명의 운영컴퓨터의 주요부인 공공데이터정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 7에 도시한 바와 같이 본 발명의 공공데이터정보관리모듈은, 적어도 하나의 공공기관컴퓨터가 운용하 는 포털사이트에 API를 통해 수집한 기후 및 기상 관련 공공데이터를 특정 패턴이나 순서로 추출하여 정보를 가 공하는 데이터 파싱(parsing) 과정을 관리하는 공공데이터파싱정보관리모듈과; 공공기관컴퓨터에서 제공 하는 기후 및 기상 관련 데이터를 수집하여 파싱 처리하기 전에 데이터저장장치에 해당 장송의 기후 및 기상 데이터가 존재하는지를 조회한 후, 데이터가 존재하는 경우 해당 데이터를 가져와 활용하고, 데이터가 존 재하지 않는 경우 크롤러를 이용하여 공공데이터를 수집하여 저장시키고 관리하는 기상데이터정보관리모듈 을 포함하는 구성이다. 도 8은 본 발명의 운영컴퓨터의 주요부인 침수예측정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 8에 도시한 바와 같이 본 발명의 침수예측정보관리모듈은, 상기 수위데이터 및 영상데이터를 기반으로 구축된 빅데이터를 분석하여 수위예측 알고리즘을 적용해 정확성이 향상된 수위예측데이터를 생성하는 수위예측 데이터생성관리모듈과; 상기 공공데이터 및 해당 장소와 관련된 지리정보(GIS)를 접목하여 침수예측 알고 리즘을 적용하여 침수예측데이터를 생성하는 침수예측데이터생성관리모듈을 포함하는 구성이다. 도 9는 본 발명의 운영컴퓨터의 주요부인 콘텐츠정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 9에 도시한 바와 같이 본 발명의 콘텐츠정보관리모듈은, 상기 수위예측데이터 및 침수 예측데이터를 기초로 침수지역을 예측할 수 있도록 데이터별로 위치데이터와 매핑시키는 데이터매핑정보관리모듈과; 침 수예측데이터와 위치정보의 매핑데이터를 디지털 사이니지 등에 출력시켜 이용자가 확인할 수 있도록 콘텐츠를 시각화하여 관리하되, 유무선 웹서비스, 앱서비스 및 디지털 사이니지 서비스로 제공되는 시각화 콘텐츠를 관리 하는 콘텐츠시각화정보관리모듈을 포함하는 구성이다. 도 10은 본 발명의 운영컴퓨터의 주요부인 콘텐츠출력수단관리모듈의 실시예에 관한 개략적인 구성도이다. 도 10에 도시한 바와 같이 본 발명의 콘텐츠출력수단관리모듈은, PC, TV 및 이동통신단말기 등에 제공되 는 웹사이트를 통하여 출력시키도록 상기 웹사이트에 침수예측 관련 시각화 콘텐츠 및 관련 재난 정보를 실시간 으로 업데이트시키고 관리하는 웹서비스출력수단관리모듈과; 스마트폰, 태블릿컴퓨터와 같은 모바일 디바 이스에서 실행되는 어플리케이션 프로그램(앱)을 통하여 출력시키도록 상기 모바일 디바이스에 침수예측 관련 시각화 콘텐츠 및 관련 재난 예경보 정보를 실시간으로 업데이트시키고 관리하는 모바일출력수단관리모듈(182 0)과; 모니터링 장소에 설치된 디지털 사이니지에 콘텐츠 인터럽트 기능을 수행하여 침수예측 관련 시각화 콘텐 츠 및 관련 재난 예경보 정보를 출력시키고 업데이트를 관리하는 디지털사이니지관리모듈을 포함하는 구 성이다. 도 11은 본 발명의 운영컴퓨터의 주요부인 통신정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 11에 도시한 바와 같이 본 발명의 통신정보관리모듈은, 수위데이터수집장치부, 영상데이터수집 장치부, 공공데이터제공장치부 및 콘텐츠출력장치부와의 데이터 송수신을 위한 통신프로토콜 을 관리하는 TCP/IP통신정보관리모듈과; 콘텐츠출력장치부 중 디지털 사이니지의 셋탑장치와의 단 순 명령어 송신을 위한 통신프로토콜을 관리하는 HTTP통신정보관리모듈과; 네트워크 통신의 오류를 모니 터링하기 위한 네트워크모니터링관리모듈을 포함하는 구성이다. 도 12는 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템의 다른 실시예에 관한 개략적인 구성도이다. 도 12에 도시한 바와 같이 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템은, 모니터링 장소의 실시간 수위측정데이터 및 해당 장소의 기후 및 기상 관련 공공데이터를 수신하여 빅데이터화 및 분석을 관리하는 데이터관리컴퓨터와, 모니터링 장소의 촬영 영상데이터를 수신하여 영상/이미지데이터 를 관리하는 영상관리컴퓨터와, 상기 데이터관리컴퓨터에서 제공된 수위측정데이터와 상기 영상관리 컴퓨터에서 제공된 영상/이미지데이터를 기초로 인공지능 알고리즘을 활용해 모니터링 장소의 정확한 수위 예측데이터를 생성하고 상기 데이터관리컴퓨터에서 제공된 공공데이터와 지리정보데이터를 활용해 침수예 측데이터를 생성하여 생성된 수위예측데이터와 침수예측데이터를 기반으로 시각화 콘텐츠와 이와 연계된 재난 예경보 관련 콘텐츠를 생성하여 다양한 디스플레이 수단에 제공하고 관리하는 웹운영컴퓨터를 포함하는 운 영컴퓨터부(1000a)와; 상기 데이터관리컴퓨터와 통신 접속되어 있거나 자체에 포함되어 있고, 상기 데이터 관리컴퓨터가 수신한 실시간 수위측정데이터 및 적어도 하나의 공공기관컴퓨터로부터 수집한 공공데 이터를 저장한 수집데이터저장장치, 상기 영상관리컴퓨터가 수신한 모니터링 장소의 촬영 영상데이 터 및 이미지데이터를 저장한 영상/이미지저장장치, 생성된 수위예측데이터 및 침수예측데이터를 기반으 로 상기 웹운영컴퓨터가 생성한 침수예측 시각화 콘텐츠를 저장한 콘텐츠저장장치를 포함하는 데이터저장 장치부(2000a)와; 상기 데이터관리컴퓨터와 통신 접속되어 있고 모니터링 장소에 설치된 적어도 하나의 수 위측정센서를 포함하여 해당 장소의 수위를 실시간으로 측정한 데이터를 상기 데이터관리컴퓨터로 전송하는 수위데이터수집장치부와; 상기 영상관리컴퓨터와 통신 접속되어 있고 모니터링 장소에 설 치된 CCTV를 포함하는 적어도 하나의 영상촬영카메라를 포함하여 해당 장소의 수위를 포함한 환경을 실시 간으로 촬영한 영상데이터를 상기 영상관리컴퓨터로 전송하는 영상데이터수집장치부와; 상기 데이터 관리컴퓨터가 통신 수단으로 접속하여 기후 및 기상 정보와 관련된 데이터를 수집할 수 있도록 공공데이터 를 제공하는 적어도 하나의 공공기관컴퓨터를 포함하는 공공데이터제공장치부와; 상기 웹운영컴퓨 터와 통신 접속되어 있고 상기 웹운영컴퓨터에서 생성한 침수예측 콘텐츠 및 재난 예경보 콘텐츠를수신하여 출력시키는 디지털 사이니지, 스마트폰 또는 전용 단말기 등의 디지털출력장치를 포함하는 콘텐 츠출력장치부를 포함하는 구성이다. 상기 데이터관리컴퓨터 및 영상관리컴퓨터는 구비된 적어도 하나의 하드웨어 프로세서가 메모리에 저 장된 상기 작용을 위한 컴퓨터 프로그램 또는 웹프로그램의 실행을 제어하는 구성으로서, 통신 수단을 구비하고 있고 적어도 하나의 하드웨어 프로세서와 메모리를 구비하고 있는 서버컴퓨터로 구성될 수 있다. 또한, 상기 웹운영컴퓨터는 상기 디지털출력장치들과 통신 수단으로 접속하여 광고 및 홍보 콘텐츠 를 전송하여 출력시키고, 침수예측 관련 및 재난 관련 상태 변화 콘텐츠를 전송하여 출력시킬 수 있는 웹서버로 구성될 수 있다. 수집되는 수위측정데이터 및 영상/이미지데이터를 빅데이터화하여 인공지능 알고리즘을 활용해 수위예측데이터 를 생성하고, 수집된 공공데이터를 지리정보(GIS)와 접목하여 침수예측데이터를 생성하는 구성 및 수위예측데이 터 및 침수예측데이터를 시각화 콘텐츠로 생성시키는 구성은 상기 데이터관리컴퓨터 또는 영상관리컴퓨터 에서 구현되도록 구성될 수 있다. 이하에서 도 1 내지 도 12를 참조하여 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방 시스템의 작용을 상세히 설명하기로 한다. 본 발명의 실시예는 기본적으로 도시 침수 재난으로 인한 재산 손실 및 인명 피해를 예방하기 위해, 하천, 교량, 배수펌프장, 도로알림판(전광판), 저지대 주택가, 저지대 업소 등에 설치된 기존의 CCTV 및 수위측정센서 를 활용하여 해당 지역에 설치된 디지털 사이니지 및 다양한 출력장치에의 웹 및 앱서비스를 통해 침수 재난 예 경보 서비스를 제공하기 위한 시스템에 관한 발명이다. 따라서, 본 발명의 실시예에서의 주된 구성요소로는 수위측정데이터 및 CCTV 영상데이터 기반 정확한 수위예측 알고리즘, 침수위험 예측 알고리즘, 및 침수예측데이터와 지리정보의 매핑 및 디지털 사이니지를 통한 예경보 콘텐츠의 출력 기술요소를 들 수 있다. 본 발명의 다른 실시예인 도 12는 도 1의 실시예에서의 운영컴퓨터가 수위데이터와 공공데이터를 수집하 여 처리하는 데이터관리컴퓨터와 영상/이미지데이터를 수집하여 처리하는 영상관리컴퓨터 및 시각화 콘텐츠를 디지털 사이니지 등의 적어도 하나의 디지털출력장치에 전송하여 출력시키는 웹운영컴퓨터(30 0)로 세분된 구성이다. 그러므로, 이하에서는 도 1의 운영컴퓨터의 실시예를 위주로 설명하기로 한다. 수위데이터수집장치부는 모니터링 장소에 설치된 적어도 하나의 수위측정센서에서 실시간 감지한 수위데이터를 구비된 미들웨어를 통해 수신하여 상기 운영컴퓨터로 전송하고, 영상데이터수집장치부 는 모니터링 장소에 설치된 CCTV와 같은 적어도 하나의 영상촬영카메라에서 촬영한 영상 및 영상데 이터를 설정된 기준에 따라 변환 또는 캡쳐한 복수의 이미지데이터를 구비된 미들웨어를 통해 수신하여 상기 운 영컴퓨터로 전송하고, 상기 운영컴퓨터가 상기 공공데이터제공장치부의 적어도 하나의 공공 기관컴퓨터가 운용하는 기후 및 기상 관련 정보를 제공하는 포털사이트에 API를 통해 접속하여 설정된 기 준에 따른 주기 및 방식으로 기후 및 기상 관련 공공데이터를 크롤링하여 파싱 과정을 통해 유효한 모니터링 장 소의 기후 및 기상 관련 공공데이터로 수집한다. 상기 운영컴퓨터는 수신된 실시간 수위측정데이터 및 영상/이미지데이터를 빅데이터 저장수단인 데이터저 장장치에 저장시킨다. 아울러, 수집한 공공데이터를 데이터저장장치에 저장시킨다. 영상데이터수집장치부에서 촬영한 영상데이터는 예를 들면, 1분에 5장씩 영상데이터를 수집하여 영상데이 터를 이미지데이터로 변환시키는 전처리 과정을 거쳐 상기 데이터저장장치에 이미지 파일로 저장시킬 수 있다. 상기 수위데이터수집장치부에서 수집된 수위측정데이터는 상기 영상데이터에서 추출된 이미지 영상에서 알고리즘을 적용하여 분석한 수위를 계산하고 그 결과를 상기 데이터저장장치에 저장시킬 수 있다. 이와 같이 수위측정데이터와 영상데이터를 인공지능 알고리즘을 적용시켜 수위예측데이터를 생성하여 저장시킬 수 있 다. 여기서 수위예측데이터 내지 침수예측데이터를 생성하는 인공지능 알고리즘은, 상기 수위데이터수집장치부 로부터 수신한 수위측정데이터를 활용하거나 및 영상데이터수집장치부로부터 수신된 수위 관련 영 상데이터를 분석하여 강수량과 수위데이터를 추출하고, 상기 강수량데이터에서 순간 강수량데이터와 누적 강수 량데이터를 구분하여 설정 시간으로 적용하여 그래프를 추출하여 모니터링 장소의 침수 여부를 판단하는데 사용할 수 있다. 또한, 패턴분석 방식을 이용하여 기준 패턴과 유사도를 판단하거나 및 회귀식을 도출하여 도출된 회귀식을 통한 수위예측 내지 침수지역을 예측할 수 있다. 또한, 일반 CCTV와 같은 영상촬영카메라의 촬영 영상데이터에서 관심영역을 선정하고, 색상값을 활용하여 침수정도를 실시간으로 추적하는 방식으로서, 영상의 전체 영역을 침수 관심영역 선정 수단을 이용하여 선별한 후 선별된 영역에서 좌표계와 색상값을 이용하여 해당 지역의 수위예측 내지 침수 여부를 판단하는 방법으로 수 위예측데이터 내지 침수예측데이터를 생성할 수 있다. 상술한 알고리즘을 이용하여 생성된 수위예측데이터 내지 침수예측데이터를 기초로 다양한 콘텐츠출력장치에서 디스플레이 되어 확인할 수 있도록 한 시각화 콘텐츠의 생성은, 상기 공공데이터제공장치부에서 API를 통 해 수집된 모니터링 장소의 침수흔적도, 기상데이터의 공공데이터를 지리정보(GIS)데이터와 매핑시켜 생성할 수 있다. 이를 위해서, 상기 수위예측 내지 침수예측 알고리즘을 통해 생성된 수위예측데이터 내지 침수예측데이터에 지 역별 조건 정보를 반영하여 침수 모의시험을 수행할 수 있다. 즉, 모의실험을 통해 결과를 예측하고 예측된 결 과를 지리정보(GIS) 기반으로 시각화 콘텐츠로 생성할 수 있다. 더 구체적으로는 지리정보(GIS)기반 모의시험의 결과로서, 지리정보(GIS) 기반 침수위험지도 및 침수예측의 시 각화가 가능하므로, 예상 침수지역을 지리정보(GIS)를 통해 각하여 콘텐츠를 생성시킬 수 있다. 또한, 시각화된 침수지역은 침수정보에 따라서 영역을 구분하여 콘텐츠출력장치부에 출력시킬 수 있다. 도 13은 본 발명의 공공데이터 및 지리정보(GIS)를 활용한 침수예측 개념도이다. 도 13에 도시한 바와 같이 본 발명의 공공데이터 및 지리정보(GIS)를 활용한 침수예측은, 공공데이터수집부문 과 수집한 공공데이터를 이용하여 침수지역예측매핑부문의 범위로 설명될 수 있다. 공공데이터수집부문은 침수데이터 및 침수흔적도와, 해당 지역의 지역의 지리정보(GIS)데이터와, 공 공기관컴퓨터로부터 수집한 기상데이터를 포함하고, 상기 침수지역예측매핑부문은 공공데이터를 분석하 여 해당 지역의 구역별 침수빈도를 지리정보(GIS)에 매핑하여 표시시킨 구역별침수빈도콘텐츠와, 해당 지역 의 면적당 배수펌프 비율을 지리정보(GIS)에 매핑하여 표시시킨 배수펌프비율콘텐츠와, 해당 지역의 침수확 률을 예측하여 지리정보(GIS)에 매핑하여 표시시킨 지역별 침수확률예측콘텐츠를 생성할 수 있다. 그러나 이에 한정되는 것은 아니고, 수집된 공공데이터를 지리정보(GIS)를 인공지능 알고리즘을 이용하여 매핑 시킴으로써 다양한 침수예측 시각화 콘텐츠로 생설할 수 있다. 또한, 공공데이터포털(data.go.kr)에서 지역별 실시간 강우량 데이터, 과거 강우량 데이터, 초단기 강우량 데이 터, 침수흔적데이터 등의 다양한 지역 정보 데이터를 확보하여 웹/모바일 및 디지털 사이니지 시스템에 실시간 표출시킬 수 있다. 상기 공공데이터 수집은, 웹 크롤링 기법을 활용한 데이터 수집, API를 통해 수집한 데이터를 원하는 형태로 가 공하는 스크래핑(scraping) 과정과, 수집된 데이터를 특정 패턴이나 순서로 추출하여 정보 가공하고 일련의 문 자열을 의미 있는 토큰으로 분해 및 정렬하는 파싱(parsing)과정을 통해 공공데이터를 처리하여 저장시킬 수 있 다. 또한, 게시 정보의 크롤링 프로세스로서, 데이터저장장치의 기존 데이터베이스에서 기상정보의 존재 유무 를 확인하여, 데이터가 존재하는 경우 존재하는 데이터를 처리하여 활용하고, 데이터가 없는 경우 크롤링 모듈 을 통해 수집 및 저장 후 처리하도록 구성될 수 있다. 또한, 침수지역예측 매핑에 관하여, 공공데이터는 제공하고 있는 기관에 따라 관리 기준 및 표시 방식이 상이하 므로 데이터를 하나의 데이터로 조합하기 위해서 기준이 되는 데이터를 바탕으로 데이터 간 공통 요소를 분석하 여 연결관계를 정의한다. 이를 위하여, 각 데이터에서 해당 정보가 나타내는 위치 및 영역 정보 분석하고, GIS 데이터와 연결하기 위한 공통요소의 추출(예, 좌표, 행정구역)하고, 시각화 정보를 지리정보(GIS)와 연동하기 위한 정보 영역의 정의와, 매핑된 정보에 따라 필요 데이터를 시각화하도록 구성될 수 있다. 또한, 수위예측데이터 내지 침수예측데이터의 웹/모바일 콘텐츠출력과 관련하여, 웹/모바일 디바이스 화면에서 지역 클릭시 설치된 CCTV 영상과 해당 지역의 기상정보를 모니터링할 수 있도록 구성할 수 있다. 또한, 설치 지 역에 침수예측 및 발생 시 위험 메시지 출력이 가능하도록 구성될 수 있다. 또한, 수집된 빅데이터 기반 침수예측도를 표시하도록 구성될 수 있다. 또한, 수집된 데이터를 기반으로 배수펌프비율 및 침수빈도 맵을 표시하도 록 구성될 수 있다. 또한, 수집된 데이터를 기반으로 실시간 침수위험도를 표시하도록 구성될 수 있다. 수위예측데이터 내지 침수예측데이터의 디지털 사이니지 콘텐츠출력과 관련하여, 운영컴퓨터는 스케쥴링된 영상 콘텐츠를 저장하고, 디지털 사이니지 장치에 푸쉬신호를 통해 전송하는 역할을 수행하도록 구성될 수 있다. 또 한, 디지털 사이니지의 운영에 필요한 데이터 관리용 데이터베이스로서 콘텐츠 표출 위치 메니지먼트/ 대용량 파일 저장관리/ 공공데이터 분류 및 저장/수위센서 및 CCTV 영상데이터 저장/콘텐츠 우선순위 도출 및 관리 수 단 저장 기능을 수행하도록 구축할 수 있다. 또한, 디지털 사이니지 장치에 일반 기능 표출 기능으로서, 수집한 데이터 기반 콘텐츠 맞춤형 콘텐츠 변환 뷰 기능으로 구현되어, 평상시에는 지역 정보 콘텐츠(민원정보, 관광정보, 일반 홍보/광고영상 등)을 출력시키도록 구성될 수 있다. 디지털 사이니지 장치에 침수 재난/재해 콘텐츠(대피요령 및 실시간 상황보고 영상)를 제공하도록, 국지성 폭우, 소나기, 우박 등 악천후 발생 시 침수정보 콘텐츠의 신속한 전달을 위한 콘텐츠 인터럽트 수단을 구비할 수 있다. 동시에 공공데이터포털에서 제공하는 “재난상황전파 메시지정보 서비스” API를 활용하여 공공데이터 컴퓨터와 연결된 모든 디지털 사이니지 장치에 콘텐츠 전달을 통해 주변 사람들에게 비상 상황 전달기능을 구현 하도록 구성될 수 있다. 도 14는 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템의 주요부인 침수예측 콘텐츠 내지 재난 예경보 콘텐츠의 디지털 사이니지를 통한 출력 구성의 실시예에 관한 개략적인 구성도이다. 도 14에 도시한 바와 같이 본 발명의 디지털 사이니지 장치를 통한 침수 예경보 시스템(이하에서 '환경변화정보 표시 시스템'이라 함)은, 각 모니터링 장소에 설치된 광고/홍보를 위한 디지털 사이니지 장치의 구동을 제어하 는 셋탑장치 정보를 관리하고, 수위예측 내지 침수예측 시각화 콘텐츠를 화면 인터럽트 수단을 활용하여 출력시 킬 수 있고, 상기 셋탑장치에 통신 접속된 CCTV를 포함하는 환경상태감지장치들의 정보를 관리하고, 특정 지역 의 재난/재해 및 환경 관련 공공 환경 변화 정보를 수집하고, 상기 셋탑장치로부터 제공된 환경 상태 감지 데이 터를 수집하고, 사회관계망을 통하여 환경 관련 관심 데이터를 수집하고, 수집한 공공 환경 변화 정보, 환경 상 태 감지 데이터 및 환경 관련 관심 데이터를 디지털 사이니지장치에 출력시키기 위한 형태로 편집한 환경 상태 콘텐츠를 관리하고, 환경 상태 콘텐츠의 출력 스케줄을 설정하고, 상기 셋탑장치에 상기 환경 상태 콘텐츠를 설 정된 스케줄 정보와 함께 제공하는 콘텐츠관리컴퓨터와; 상기 콘텐츠관리컴퓨터와 통신 접속되어 있거나 포함되어 있고, 각 지역의 셋탑장치 및 환경상태감지장치 의 위치 정보 및 상태정보 등을 저장하고, 상기 콘텐츠관리컴퓨터로부터 제공된 공공 환경 변화 정보, 환경 상 태 감지 데이터, 환경 관련 관심 데이터, 환경 상태 콘텐츠 및 스케줄 정보를 저장하고 상기 콘텐츠관리컴퓨터 가 요청하는 콘텐츠를 제공하는 콘텐츠저장장치와; 상기 콘텐츠관리컴퓨터와 통신 접속되어 제공받은 공공 환경 변화 정보, 환경 상태 감지 데이터, 환경 관 련 관심 데이터를 기초로 디지털 사이니지 장치에 출력시킬 환경 상태 콘텐츠를 편집하여 상기 콘텐츠관리컴퓨 터에 제공하는 적어도 하나의 관리자단말기와; 상기 콘텐츠관리컴퓨터와 API 등을 통해 통신 접속되어 있고 지역별 재난 또는 재해, 날씨 등의 환경 상태 정보를 제공하는 공공콘텐츠제공컴퓨터와; 상기 콘텐츠관리컴퓨터와 통신접속되어 수집되는 환경 관련 관심 데이터를 제공하는 사회관계망(SNS)(55 0)과; 상기 콘텐츠관리컴퓨터와 통신 접속되어 있고 수신된 환경 상태 감지 데이터를 전달하고 콘텐츠관리컴퓨터 로부터 편집된 환경 상태 콘텐츠 및 스케줄 정보를 수신하여 디지털 사이니지장치에 제공하여 출력을 제어 하는 각지역의 셋탑장치와; 상기 셋탑장치와 통신 접속되어 있고 주변의 환경 상태 변화를 감지하여 상기 셋탑장치에 전달하는 촬상장치 및 각종 센서를 포함하는 환경변화감지장치와; 상기 셋탑장치와 통신 접속되어 있고 광고/홍보 콘텐츠를 디스플레이 하다 셋탑장치로부터 제공된 제 어에 따라서 환경 상태 콘텐츠를 디스플레이 하는 디지털 사이니지장치를 포함하는 구성이다. 도 14의 시스템은 도 1 또는 도 12의 실시예와 별도로 구비되어 디지털 사이니지장치를 공유하면서 도 1 또는 도 12의 실시예와 통신 수단을 이용하여 데이터를 송수신할 수 있도록 구성할 수 있다. 또한, 도 1 및 도 12의 실시예의 구성요소를 공유하도록 구성될 수 있다. 상기 콘텐츠관리컴퓨터는 통신 수단을 구비하고, 공공콘텐츠제공컴퓨터, 셋탑장치 및 사회관계 망(SNS)으로부터 데이터를 수집하고, 수집된 데이터를 편집하여 셋탑장치에 제공하는 적어도 하나의 서버컴퓨터로 구성될 수 있고, 서버컴퓨터가 구비하고 있는 적어도 하나의 하드웨어 프로세서 및 메모리 등의 하드웨어 자원을 활용하여 저장되고 실행되는 컴퓨터 프로그램 또는 웹프로그램으로 이루어질 수 있다. 상기 콘텐츠관리컴퓨터는 도 1의 실시예 중 운영컴퓨터를 활용한 구성일 수 있고, 또한, 도 12의 운 영컴퓨터부(1000a)를 활용한 구성으로 할 수 있다. 상기 콘텐츠저장장치는 상기 콘텐츠관리컴퓨터로부터 제공된 콘텐츠를 저장시키고 상기 콘텐츠관리컴 퓨터가 요청하는 데이터를 제공하는 데이터베이스관리서버(DBMS)로 구성될 수 있다. 상기 콘텐츠저장장치는 도 1의 데이터저장장치를 활용한 구성일 수 있고, 도 12의 데이터저장장치부 (2000a)를 활용한 구성으로 할 수 있다. 상기 관리자단말기는 통신 수단을 구비하고 상기 콘텐츠관리컴퓨터에서 제공된 환경 관련 공공콘텐츠 및 상기 환경 상태 감지 데이터를 모니터링 장소의 디지털 사이니지장치에 출력시키는데 적합한 형태로 편 집하기 위한 콘텐츠 관련 편집수단의 웹프로그램 및 컴퓨터 애플리케이션 프로그램의 운용 수단을 포함하는, PC, 노트북, 각종 휴대폰, 휴대통신단말기, 태블릿컴퓨터, 스마트폰 등으로 구성될 수 있다. 상기 공공콘텐츠제공컴퓨터는 통신 수단을 구비하고, 상기 콘텐츠관리컴퓨터에 지역별 재난 또는 재 해, 날씨, 온도, 습도, 안개, 초미세먼지 및 미세먼지 등의 환경 상태 데이터를 제공하는, 예를 들면 기상청에 설치되어 있거나 공공데이터플랫폼의 구성요소로서의 서버컴퓨터로 구성될 수 있다. 상기 공공콘텐츠제공컴퓨터는 도 1 및 도 12의 공공기관컴퓨터를 활용하는 구성으로 할 수 있다. 상기 사회관계망(SNS)은 다양한 소셜 네트워크 서비스 시스템(SNS)으로 구성될 수 있다. 상기 셋탑장치는 통신 수단을 구비하고 상기 환경변화감지장치에서 수집된 데이터를 상기 콘텐츠관리 컴퓨터에서 제공하고, 상기 콘텐츠관리컴퓨터가 제공하는 스케줄 정보와 환경 상태 콘텐츠를 수신하 여 스케줄에 따라서 통신 접속되어 있는 디지털 사이니지장치에서의 상기 환경 상태 콘텐츠의 디스플레이 를 제어하는 디바이스로 구성될 수 있다. 상기 환경변화감지장치는 통신 수단이 구비되어 있고, 상기 셋탑장치에 통신 접속되어 감지한 데이터 를 제공하는, CCTV, 카메라를 포함하는 촬상장치, 온도, 습도, 안개, 미세먼지, 풍속, 풍향 및 조도를 측정하는 센서를 포함하는 사물인터넷(IoT) 디바이스로 구성될 수 있다. 상기 촬상장치는 도 1 및 도 12의 영상촬영카메라를 활용하도록 구성될 수 있다. 상기 디지털 사이니지장치는, 액정 디스플레이, 발광다이오드(LED) 디스플레이를 포함하고 모니터링 장소 에 설치된 장치를 포함하는 구성이다. 상기 디지털 사이니지장치는 도 1 및 도 12의 디지털출력장치를 활용하도록 구성될 수 있다. 또한, 상기 콘텐츠관리컴퓨터는 상기 콘텐츠저장장치와 모니터링 장소의 셋탑장치를 연결해주는 미들웨어를 포함할 수 있다. 이하 실시예의 설명에서 모니터링 장소의 셋탑장치와 콘텐츠저장장치의 데이터 송수신은 미들웨어의 연결 기능에 의한 것으로 볼 수 있다. 상기 콘텐츠관리컴퓨터가 공공데이터플랫폼 등의 환경관련 공공콘텐츠를 제공하는 적어도 하나의 공공웹사 이트 제공하는 API(Application Programming Interface)를 활용하여 각각의 공공 포털웹사이트에 접속하여 크 롤링 기법으로 날씨, 재난, 재해, 날씨, 온도 및 습도, 풍향, 풍속, 초미세먼지 및 미세먼지 정보의 데이터를 수집하여 파싱을 거쳐 원하는 공공 환경 변화 정보를 실시간 또는 주기적으로 생성하여 저장시킨다. 또한, 콘텐 츠관리컴퓨터가 각 지역에 설치된 디지털 사이니지장치 또는 디지털 사이니지장치 그룹과 통신 접속되어 있는 셋탑장치에 연결되고 된 촬상장치 및 각종 감지장치를 포함하는 IoT 디바이스에서 셋탑장치가 있는 위치 주변의 영상, 온도, 습도, 안개, 풍속, 조도, 초미세먼지 및 미세먼지를 포함하는 환경 상태 감지 데이터를 각 각의 셋탑장치를 통하여 수집하여 지역별로 저장시킨다. 또한, 콘텐츠관리컴퓨터가 SNS 등의 사회관계망으 로부터 날씨 또는 미세먼지와 같은 환경 관련 관심 데이터를 수집하여 지역별로 분류하여 저장시킨다. 상기 콘테츠관리컴퓨터는 상기 공공 환경 변화 정보와 환경 상태 감지 데이터와의 지역별 내용별 유사 및 비유사점을 분석하여 유사점을 찾아가도록 하는 알고리즘을 통해 공공 환경 변화 정보를 기초로 환경 상태 감지 데이터의 최적 상태 정보를 찾아가도록 한다. 이어서 환경 관련 관심 데이터를 분석하여 지역별로 관심도가 높 은 환경 관련 데이터를 추출하여 상기 공공 환경 변화 정보 및 환경 상태 변화 데이터 중 관심도가 높은 환경 관련 데이터와 매칭되는 환경 변화 정보에 디스플레이 시간의 가중치를 부여하고 환경 상태 콘텐츠를 생성하여 저장시킨다. 상기 콘텐츠관리컴퓨터는 각 지역에 출력시키기로 선택된 광고 또는 홍보 콘텐츠와 지역별 환경 상태 콘텐 츠를 가져와 미리 정해져 있거나 우선순위 가중치를 적용하여 광고 또는 홍보 콘텐츠와 환경 상태 콘텐츠의 배 치를 결정하여 지역별 추천 콘텐츠를 생성하여 저장시키고 각 지역의 셋탑장치로 전송하여 해당 셋탑장치와 접 속된 디지털 사이니지장치에 출력시킨다. 이 경우 디지털 사이니지장치에 출력되는 추천 콘텐츠는 광고 또는 홍보 콘텐츠가 출력되다가 환경 상태 콘텐츠 변환되도록 한 배치 설정일 수 있고, 출력되는 광고 또는 홍보 콘텐츠의 소정의 위치에 배치된 설정일 수 있다. 또한, 상기 지역별 추천 콘텐츠의 디지털 사이니지장치에서의 출력은 설정한 스케줄 또는 자동 설정되는 스케줄 링 정보를 각 셋탑장치에 상기 추천 콘텐츠와 함께 전송하여 출력시킬 수 있다. 또한, 각 디지털 사이니지장치에 출력되는 추천 콘텐츠의 형태는 미리 편집된 형태 또는 자동 편집된 형태로 할 수 있고, 디지털 사이니지장치의 화면 사이즈 및 해상도에 자동 적응하여 출력되도록 구성될 수 있다. 또한, 콘텐츠관리컴퓨터는 지진, 해일, 화재 등의 재난 또는 재해가 발생시 공공 포털웹사이트의 API를 활 용하여 공공 포털웹사이트가 제공하는 예를 들면, 재난상황전파 메시지정보 서비스를 가져와 설정된 형태의 긴 급 재난 콘텐츠로 생성시켜 인터럽트 명령어와 함께 전체 셋탑장치로 전송하고, 각 셋탑장치는 접속되어 있는 디지털 사이니지장치의 현재 출력되는 광고 또는 홍보 콘텐츠를 인터럽트 기능으로 멈추게 하고 긴급 재난 콘텐 츠를 출력시킨다. 인터럽트 명령 또는 기능은 출력 순서가 스케줄링되어 있는 현재의 콘텐츠 출력 순서를 순연시키고 긴급 재난 콘텐츠를 그 스케줄 사이에 끼워넣어 출력시키도록 구성될 수 있다. 또한, 상기 긴급 재난 콘텐츠의 정보를 음성파일로 생성하여 상기 긴급 재난 콘텐츠와 함께 셋탑장치로 전송하 여 연결된 음성출력장치를 통해 음성으로도 출력시키도록 구성될 수 있다. 그러나 상술한 실시예의 작용은 이에 한정되는 것이 아니고, 당연히 대체할 수 있는 다양한 수단을 적용한 실시 예의 작용도 포함될 수 있다. 도 14의 시스템이 도 1 및 도 12의 실시예의 구성요소를 공유하도록 구성된 경우, 상기 콘텐츠관리컴퓨터 에서의 인터럽트 명령 또는 기능은 출력 순서가 스케줄링되어 있는 현재의 콘텐츠 출력 순서를 순연시키고 수위 예측 내지 침수예측 시각화 콘텐츠 및 재난 예경보 콘텐츠를 그 스케줄 사이에 끼워넣어 디지털 사이니지장치로 출력시키도록 구성될 수 있다. 이 경우, 모니터링 장소에 설치된 디지털 사이니지장치에 평상시에는 예를 들면, 해당 지역의 민원정보, 관광정 보, 일반 홍보 및 광고영상 등을 포함하는 지역정보를 디지털 사이니지장치의 설치 위치 주변의 기후 및 기상 정보와 함께 출력시킨다. 상기 콘텐츠관리컴퓨터에 수위예측 내지 침수예측 시각화 콘텐츠가 생성되면, 상 기 셋탑박스로 HTTP 통신프로토콜을 통해 디지털 사이니지장치의 화면전환 명령을 전송함과 동시에 수위예측 내 지 침수예측 시각화 콘텐츠를 전송하여 상기 디지털 사이니지장치에 출력되면 평상시 지역정보 콘텐츠를 상기 수위예측 내지 침수예측 시각화 콘텐츠로 전환하여 출력시키도록 구성될 수 있다. 상기 디지털 사이니지장치에는 국지성 폭우, 소나기, 우박 등 악천후 발생 시 콘텐츠 인터럽트 기능을 구현하여 상기 수위예측 내지 침수예측 시각화 콘텐츠의 신속하게 전환 출력되도록 구성될 수 있다. 또한, 공공기관 포털웹사이트에서 제공하는 “재난상황전파 메시지정보 서비스” API를 활용하여 모든 디지털 사이니지장치에 재난상황 콘텐츠를 전달하여 출력시킴으로써 주변 사람들에게 비상 상황 전달기능을 구현할 수 있다. 도 15는 본 벌명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 시스템의 주요부인 디지털 사이니지장 치에 출력되는 수위예측 내지 침수예측 시각화 콘텐츠의 화면 예시도이다. 도 15에 도시한 바와 같이 본 발명의 디지털 사이니지장치의 화면은, 디지털 사이니지 전체 디스플레이 영 역에 출력되는 모니터링 장소의 침수예측 시각화 콘텐츠와, 상기 침수예측 시각화 콘텐츠의 상측 부위 에 오버랩되어 출력되는 텍스트 형태의 재난상황전파 메시지 영역과, 상기 침수예측 시각화 콘텐츠의 하측 양측 부위에 오버랩되어 출력되는 디지털 사이니지장치 설치 지역의 기후 및 기상상태 정보 영역과, 재난정보 및 재난시 행동요령 등의 안내문을 표시하는 안내 정보 영역이 표시되는 구성이다. 그러나 이에 한정되는 것은 아니고, 디지털 사이니지장치에 평상시 출력되던 지역정보 등의 콘텐츠가 침수예측 시각화 콘텐츠가 전달되면 인터럽트 명령에 의해 침수예측 시각화 콘텐츠로 전환되어 표시되고, 공공기관컴퓨터 로부터 전송되어 온 재난상황전파 메시지정보가 표시되고, 디지털 사이니지장치의 주변 기후 및 기상 정보가 동 시에 표시되는 다양한 구조의 영역으로 구성될 수 있다. 도 16은 본 발명의 침수예측 시각화 콘텐츠를 출력시키는 디지털 사이니지 장치의 예시도이다. 본 발명의 실시예의 작용을 정리하면, 실시간 수위측정데이터, 영상데이터 및 공공데이터를 수신하여 침수 예경 보 및 예방을 위한 콘텐츠를 생성하여 관리하는 운영컴퓨터를 포함하는 시스템으로서, 상기 운영컴퓨터가 모니 터링 장소에 설치된 적어도 하나의 수위측정장치에서 전송한 실시간 수위측정데이터와 상기 모니터링 장소에 설 치된 적어도 하나의 영상촬영카메라에서 전송한 실시간 촬영 영상데이터를 수신하고; 상기 운영컴퓨터가 기후 및 기상 관련 공공데이터를 제공하는 공공기관컴퓨터에서 모니터링 장소의 기후 및 기상 관련 공공데이터를 수 집하고; 상기 운영컴퓨터가 수신한 수위측정데이터 및 영상데이터를 기반으로 빅데이터를 구축하고; 상기 운영 컴퓨터가 구축된 빅데이터에서 인공지능 알고리즘을 이용한 수위예측데이터 및 수집된 기후 및 기상 관련 공공 데이터를 해당 장소의 지리정보에 접목한 침수예측데이터를 생성하고; 상기 운영컴퓨터가 생성된 수위예측데이 터 및 침수예측데이터를 침수예측 시각화 콘텐츠로 생성하여; 상기 운영컴퓨터가 생성된 침수예측 시각화 콘텐 츠를 모니터링 장소에 설치된 디지털 사이니지장치를 포함하는 적어도 하나의 콘텐츠출력장치로 전송하여 출력 시키되; 상기 디지털 사이니지장치에는 평상시에 지역정보 관련 콘텐츠와 디지털 사이니지장치의 주변 환경상태 변화정보를 출력시키다가 수위예측 내지 침수예측 시각화 콘텐츠가 수신되면, 상기 디지털 사이니지장치의 현재 화면을 재난/재해 콘텐츠 축력화면으로 전환시켜 실시간으로 주변 사람들에게 재난/재해 정보 및 부가정보를 신 속하게 전달하는 것을 특징으로 한다. 이상에서 설명한 본 발명의 실시예는 다양한 실시예 중 일부에 불과하다. 모니터링 장소에서 수위측정센서 등으 로 측정한 실시간 수위데이터와 CCTV를 포함하는 영상촬영카메라 등으로 촬영한 영상데이터를 가져와 인공지능 알고리즘에 적용시켜 수위예측데이터를 생성하고, 공공기관컴퓨터에서 수집한 모니터링 장소의 기후 및 기상 공 공데이터와 해당 지역의 지리정보(GIS)를 접목시켜 침수예측데이터를 생성하고, 수위예측데이터 및 침수예측데 이터를 기반으로 수위예측 내지 침수예측 시각화 콘텐츠를 생성하여, 모니터링 장소에 설치된 디지털 사이니지 장치에 화면 인터럽트 기능으로 출력시키거나, 웹/모바일 출력수단에 전달하여 재난상황 및 재난 예측 정보를 실시간으로 전달하는 기술적 사상에 포함하는 다양한 실시예가 본 발명의 보호범위에 해당하는 것은 당연하다."}
{"patent_id": "10-2021-0145818", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템의 실시예에 관한 개략적 인 구성도이다. 도 2는 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템의 주요부인 운영컴퓨터 의 실시예에 관한 개략적인 구성도이다. 도 3은 본 발명의 운영컴퓨터의 주요부인 수위데이터수집장치관리모듈의 실시예에 관한 개략적인 구성도이다. 도 4는 본 발명의 운영컴퓨터의 주요부인 영상데이터수집장치관리모듈의 실시예에 관한 개략적인 구성도이다.도 5는 본 발명의 운영컴퓨터의 주요부인 공공데이터수집수단관리모듈의 실시예에 관한 개략적인 구성도이다. 도 6은 본 발명의 운영컴퓨터의 주요부인 수집데이터정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 7은 본 발명의 운영컴퓨터의 주요부인 공공데이터정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 8은 본 발명의 운영컴퓨터의 주요부인 침수예측정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 9는 본 발명의 운영컴퓨터의 주요부인 콘텐츠정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 10은 본 발명의 운영컴퓨터의 주요부인 콘텐츠출력수단관리모듈의 실시예에 관한 개략적인 구성도이다. 도 11은 본 발명의 운영컴퓨터의 주요부인 통신정보관리모듈의 실시예에 관한 개략적인 구성도이다. 도 12는 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템의 다른 실시예에 관한 개략적인 구성도이다. 도 13은 본 발명의 공공데이터 및 지리정보(GIS)를 활용한 침수예측 개념도이다. 도 14는 본 발명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 및 예방시스템의 주요부인 침수예측 콘텐츠 내지 재난 예경보 콘텐츠의 디지털 사이니지를 통한 출력 구성의 실시예에 관한 개략적인 구성도이다. 도 15는 본 벌명의 CCTV와 사이니지를 활용한 빅데이터 기반 침수 예경보 시스템의 주요부인 디지털 사이니지장 치에 출력되는 수위예측 내지 침수예측 시각화 콘텐츠의 화면 예시도이다. 도 16은 본 발명의 침수예측 시각화 콘텐츠를 출력시키는 디지털 사이니지 장치의 예시도이다."}
