{"patent_id": "10-2025-0047951", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0056865", "출원번호": "10-2025-0047951", "발명의 명칭": "휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시스템", "출원인": "(주)베테랑소사이어티", "발명자": "이두희"}}
{"patent_id": "10-2025-0047951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "집중도 모니터링 장치(100)와 페어링 된 PC, 스마트폰, 태블릿을 포함하는 스마트 디바이스(200) 상의 스피커(250)를 통해 소리를 제공하면서 상기 스마트 디바이스(200)를 통해 개인 사용자들의 과목별 집중력을 수집하는서버 및 클라우드 저장소(500) 및 상기 서버 및 클라우드 저장소(500)에 수집된 개인 사용자들이 상기 스피커(250)를 통해 제공된 소리에 대한 개인의 집중시간, 집중의 깊이 및 이와 관련한 변수들을 AI를 통해 실시간 분석하는 애플리케이션(400)을 이용하여 실시간 분석하는 실시간 분석 시스템(600)를 포함하여, 개인이 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 머리에 장착한 후, 학습을 비롯한 인지활동을하는 과정에서의 집중시간, 집중의 깊이 및 이와 관련한 변수들을 상기 스마트 디바이스(200)를 통해 측정하고,상기 측정된 데이터를 애플리케이션(400)이 설치된 컴퓨터(PC)나 스마트 폰을 통해 수집하며, 상기 수집된 데이터를 상기 서버 및 클라우드 저장소(500)에 누적하며, 상기 서버 및 클라우드 저장소(500)에 누적된 데이터를상기 애플리케이션(400)을 활용한 실시간 분석 시스템(600)이 실시간 분석하고, 분석한 결과를 수치, 비율 및변수로 하여 그래프로 표현하는 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시스템."}
{"patent_id": "10-2025-0047951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시스템은, 평상시, 사용자들의 국어, 수학을 포함하는 과목별, 주제별 또는 인지활동별로 분석하여 개인의 과목이나 주제에 따른 집중시간, 집중의 깊이 및 이와 관련한 변수들 간의 상대적 비교분석을 하며, 상기 스마트 디바이스(200)를 통해 획득한 개인의 분석 데이터를 빅데이터를 참조하여 학습시의 강점과 약점, 흥미, 적성을 파악하는것을 특징으로 하는 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시스템."}
{"patent_id": "10-2025-0047951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 집중도 모니터링 장치(100)와 페어링된 PC, 스마트폰, 태블릿을 포함하는 스마트 디바이스(200) 상의 스피커(250)를 통해 소리를 제공하면서 집중시간, 집중의 깊이 및 이와 관련된 변수들을 측정하여 각종 소리와의 상호작용효과를 분석하여, 사용자의 과목별 집중력을 강화할 수 있는 소리를 찾는 것을 특징으로 하는 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시스템."}
{"patent_id": "10-2025-0047951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 하나의 항에 있어서,상기 스마트 디바이스(200)를 사용한 참여자 모두에게 적용하여 전 참여자가 생산하는 빅데이터를 실시간으로구축하며, 그 빅데이터를 독립 성분 분석(independent component analysis) 기반의 상기 신호원 분리 알고리즘AI를 활용하여 한 개인이 전체 참여자 중 상위 몇 퍼센트에 해당되는지 상대적인 위치를 수치, 비율 및 그래프로 실시간 표현하는 것을 특징으로 하는 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시스템.공개특허 10-2025-0056865-3-"}
{"patent_id": "10-2025-0047951", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전선 혹은 광섬유를 사용하지 않고 경량이어서 측정 시 착용자의 행동에 불편을 주지 않으며 센서 부 분이 착용자의 이마에 편안하게 밀착되면서 집중도를 모니터링 할 수 있고, 작고 착용이 편리하며 높은 성능을 지니는 집중도 모니터링 시스템으로, 근적외선 분광법을 통한 집중도 모니터링은 착용자의 움직임을 통한 신호 (뒷면에 계속)"}
{"patent_id": "10-2025-0047951", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 뇌영상을 이용한 집중도 모니터링에 관한 것으로, 더욱 상세하게는 뇌 영상 분야 중 근적외선 분광법 (fNIRS)을 이용한 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시스템 에 관한 것이다."}
{"patent_id": "10-2025-0047951", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "뇌는 우리의 행동과 환경에 따라 회로를 새롭게 바꾸기도 하고, 새로운 기능을 만들어 내거나 세포를 만들어 성 장하기도 한다. 그리고 우리가 어떤 생각을 하는가에 따라 뇌 영역의 기능이 바뀌기도 한다. 뇌 영역 중에서 학습과 기억력을 담당하는 히포캠퍼스(hippocampus)는 새로운 신경세포(neuron)를 생산 (neurogenesis)하는 역할을 하며, 가장 신경 발생이 활발하게 일어나는 영역이다. 히포캠퍼스 다음으로, 신경세 포 생산과 신경 발생이 활발한 부위는 영역은 후각 관련 영역으로서, 새로운 냄새를 맡으면 뇌는 냄새를 감별하 는 새로운 뇌세포를 만들어 낸다. 그러나 뇌 세포를 포함한 모든 신경섬유소는 장기간 생존하는 것이 아니라 시간이 지나면서 소멸한다. 세포의 소멸은 노화 또는 퇴화를 의미하므로, 소멸되는 것보다 세포의 생산 및 신경 발달이 활발해야 한다. 따라서, 신 경섬유소, 특히 뇌 세포를 활발하게 하기 위해서는 신경 발생의 속도 그리고 신경세포의 생존 기간에 영향을 미 치는 요인들을 찾아내는 것이 매우 중요하다. 뇌 세포의 생산, 신경 발생, 신경 발생의 속도 및 생존 기간 등을 활발하게 하는 것을 활성화라고 할 때, 기존 에는 뇌를 활성화하기 위한 방법으로 운동이나 음식, 자극제, 게임, 음악, 명상 등이 활용하였다. 그러나 최근 신경과학자들에 의해 상기 요인들이 발견되었고, 발견된 요인들을 적용해서 뇌를 활성화하여 뇌 기능을 향상시 키는 방법들이 개발되고 있다. 한편, 뇌기능을 검사하거나 진단하는 경우에는, 컴퓨터 단층 촬영(Computer Tomography, CT), 자기 공명 영상 (Magnetic Resonance Imaging, MRI), 양전자 방출 단층 촬영(Proton Emission Tomography, PET), 뇌전도 (electroencephalograph, EEG), 뇌자도(magnetoencephalography, MEG), 기능적 자기 공명 영상(Functional Magnetic Resonance Imaging, FMRI), 근적외선 분광기 등 다양한 방식을 이용하고 있다. 참고로, 근적외선 분광법(functional near-infrared spectroscopy, fNIRS)이란, 근적외선을 이용하여 조직의 생리적 특성을 조사하는 방식으로 의료, 연구 목적으로 널리 이용되고 있다. 그중 기능적 근적외선 분광법은 인지작용에 의한 뇌의 생리적 활동 양상을 조사하는 기법으로 혈역학적 작용에 의한 대뇌 피질의 활성화를 측정 하는 연구기법으로 널리 활용되고 있으며, 대뇌 피질 활성도에 따라 정신 집중도를 측정할 수 있다. 참고로 도 1은 종래의 근적외선 분광기의 사용예를 나타낸 도면이고, 도 2는 근적외선 분광기의 작동 원리를 설 명하기 위한 도면이다. 이러한 기존의 의료, 연구용 근적외선 분광기는 일반적으로 고가이며 무선 장비로 개발되었다고 하더라도 도 1 에 나타낸 바와 같이 부피가 크고 무겁거나 착용법이 복잡해 착용자에게 불편을 유발하는 문제가 있었고, 종래 의 근적외선 분광법을 활용한 시스템은 착용자 개개인의 신체적, 인지적 특성에 따라 다르게 측정되는 혈역학적 활성화 차이를 고려하지 않아 그 작동이 안정적이지 못하다는 문제도 있었다. 또한 기존의 타 뇌 영상 기법 (뇌전도 등)을 이용한 집중도 모니터링 시스템은 착용자의 움직임에 의해 유발되 는 신호 오염에 취약하며, 공간적 해상도가 매우 낮아서 활성화를 보이는 영역을 특정하기 힘들다는 제약을 갖 고 있었다. 그리고 종래의 뇌전도 (EEG)를 이용한 집중도 모니터링 시스템은 일정 수준 이상의 분류 정확도를 얻기 위하여 도 1에서 나타낸 근적외선 분광기의 광전극 수 이상으로 많은 수의 전극을 착용자에게 부착하여야 했으며, 이러 한 전극은 착용의 편리성을 크게 제한하는 문제가 있었다.선행기술문헌 특허문헌 (특허문헌 0001) 특허문헌 1 : 대한민국 공개특허10-2018-0010548호(2018. 01. 31.) (특허문헌 0002) 특허문헌 2 : 대한민국 등록특허 10-1031507호(2011. 04. 20.) (특허문헌 0003) 특허문헌 3 : 대한민국 등록특허 10-2143343호(2020. 08. 06.)"}
{"patent_id": "10-2025-0047951", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술의 제반 단점과 문제점을 해결하기 위한 것으로, 전선 혹은 광섬유를 사용하지 않고 경량이어서 측정 시 착용자의 행동에 불편을 주지 않으며 센서 부분이 착용자의 이마에 편안하게 밀착되면 서 집중도를 모니터링 할 수 있고, 작고 착용이 편리하며 높은 성능을 지니는 집중도 모니터링 시스템으로, 근 적외선 분광법을 통한 집중도 모니터링은 착용자의 움직임을 통한 신호 잡음에 비교적 강하며 높은 공간해상도 를 지니므로 활성화가 나타나는 영역에 대하여 상세한 정보 획득이 가능하고, 적은 수의 채널로도 높은 정확도 의 집중도 모니터링이 가능하며, 고해상도의 혈역학 반응 영상을 측정 및 송수신 하는 것을 가능케 하는 동시에 전력소비의 효율이 극대화되어 우표 크기의 저용량의 배터리로도 5시간 이상 연속적인 구동이 보장되기에 장시 간 연속적인 운용이 가능하며, 기판과 케이스를 제외하면 상용화된 부품만을 이용하여 제작되며 매우 낮은 제작 단가를 가지고 짧은 시간 동안에 대량 생산이 가능한 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치 를 이용한 집중도 모니터링 시스템을 제공하는데 그 목적이 있다. 또한 본 발명은 보조 채널들을 탑재하여, 피부 혈류반응에 의한 간섭이 제거된 고품질의 혈역학 신호 측정이 가 능하고, 최신 블루투스 통신 규격이 내장된 저전력 블루투스 모듈을 탑재하여 고속의 신호 송수신을 하는 동시 에 최소한의 전력 소비를 구현하였으며, 스마트폰과 노트북 PC 등 다양한 블루투스 지원 장비와 연결되어 사물 인터넷 분야의 어플리케이션으로 확장될 수 있어 정기적 집중도 캘리브레이션 측정을 통하여 사용자의 집중도를 서버에 저장하고 이에 대한 모니터링 기능을 제공하여, 사용자로 하여금 향상 및 저하된 집중도 정보를 바탕으 로 한 훈련이 가능하도록 하고, 집중도와 집중 시간을 파악하여 평소 학습 시 어느 과목이 가장 재미를 느끼는 지 알 수 있고 다른 과목을 공부할 때도 집중도를 높이는 환경 조성이 가능하며, 집중도를 향상하는 프로그램 개발이 가능하도록 한 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시 스템을 제공하는데 다른 목적이 있다."}
{"patent_id": "10-2025-0047951", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위하여 본 발명은 집중도 모니터링 장치와 페어링 된 PC, 스마트폰, 태블릿을 포 함하는 스마트 디바이스 상의 스피커를 통해 소리를 제공하면서 상기 스마트 디바이스를 통해 개인 사용자들의 과목별 집중력을 수집하는 서버 및 클라우드 저장소 및 상기 서버 및 클라우드 저장소 에 수집된 개인 사용자들이 상기 스피커를 통해 제공된 소리에 대한 개인의 집중시간, 집중의 깊이 및 이와 관련한 변수들을 AI를 통해 실시간 분석하는 애플리케이션을 이용하여 실시간 분석하는 실시간 분 석 시스템을 포함하여, 개인이 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 머리에 장착한 후, 학습을 비롯한 인지활동을 하는 과정에서의 집중시간, 집중의 깊이 및 이와 관련한 변수들을 상기 스마트 디바이스를 통해 측정하고, 상기 측정된 데이터를 애플리케이션이 설치된 컴퓨터(PC)나 스마트 폰을 통해 수집하며, 상기 수집된 데이터를 상기 서버 및 클라우드 저장소에 누적하며, 상기 서버 및 클라우드 저장소에 누적된 데이터를 상기 신호원 분리 알고리즘(blind source separation)과 상기 애플리케이션 을 활용한 실시간 분석 시스템이 실시간 분석하고, 분석한 결과를 수치, 비율 및 변수로 하여 그래프 로 표현하는 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시스템을 제 공한다. 여기서 휴대용 무선 fNIRS 기술을 이용하는 집중도 모니터링 장치를 이용한 집중도 모니터링 시스템은, 평상시, 사용자들의 국어, 수학을 포함하는 과목별, 주제별 또는 인지활동별로 분석하여 개인의 과목이나 주제에 따른 집중시간, 집중의 깊이 및 이와 관련한 변수들 간의 상대적 비교분석을 하며, 상기 스마트 디바이스를 통 해 획득한 개인의 분석 데이터를 빅데이터를 참조하여 학습시의 강점과 약점, 흥미, 적성을 파악하는 것을 특징 으로 한다. 그리고 집중도 모니터링 장치와 페어링된 PC, 스마트폰, 태블릿을 포함하는 스마트 디바이스 상의 스 피커를 통해 소리를 제공하면서 집중시간, 집중의 깊이 및 이와 관련된 변수들을 측정하여 각종 소리와의 상호작용효과를 분석하여, 사용자의 과목별 집중력을 강화할 수 있는 소리를 찾는 것을 특징으로 한다. 한편 상기 스마트 디바이스를 사용한 참여자 모두에게 적용하여 전 참여자가 생산하는 빅데이터를 실시간 으로 구축하며, 그 빅데이터를 독립 성분 분석(independent component analysis) 기반의 상기 신호원 분리 알고 리즘 AI를 활용하여 한 개인이 전체 참여자 중 상위 몇 퍼센트에 해당되는지 상대적인 위치를 를 수치, 비율 및 그래프로 실시간 표현하는 것을 특징으로 한다."}
{"patent_id": "10-2025-0047951", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면 다음과 같은 효과가 있다. 첫째, 본 발명은 기능성 근적외선 분광법 장비로, 전선 혹은 광섬유를 사용하지 않고 경량이어서 측정 시 착용 자의 행동에 불편을 주지 않으며 센서 부분이 착용자의 이마에 편안하게 밀착되면서 집중도를 모니터링 할 수 있고, 작고 착용이 편리하며 높은 성능을 지니는 집중도 모니터링 시스템 설계가 가능하다. 둘째, 근적외선 분광법을 통한 집중도 모니터링은 착용자의 움직임을 통한 신호 잡음에 비교적 강하며 높은 공 간해상도를 지니므로 활성화가 나타나는 영역에 대하여 상세한 정보 획득이 가능하고, 적은 수의 채널로도 높은 정확도의 집중도 모니터링이 가능하다는 장점을 가지고 있다. 셋째, 본 발명에 적용된 모든 구동 회로와 전력공급 회로는 독자적인 기술을 통해 설계되어 고해상도의 혈역학 반응 영상을 측정 및 송수신 하는 것을 가능케 하는 동시에 전력소비의 효율이 극대화되어 우표 크기의 저용량 의 배터리로도 5시간 이상 연속적인 구동이 보장되기에 장시간 연속적인 운용이 가능하며, 기판과 케이스를 제 외하면 상용화된 부품만을 이용하여 제작되며 매우 낮은 제작 단가를 가지고 짧은 시간 동안에 대량 생산이 가 능하다. 넷째, 본 발명은 종래 근적외선 분광법의 정규 광전극 채널 외에 보조 채널들을 탑재하여, 피부 혈류반응에 의 한 간섭이 제거된 고품질의 혈역학 신호 측정이 가능하다. 다섯째, 본 발명에는 최신 블루투스 통신 규격이 내장된 저전력 블루투스 모듈을 탑재하여 고속의 신호 송수신 을 하는 동시에 최소한의 전력 소비를 구현하였으며, 스마트폰과 노트북 PC 등 다양한 블루투스 지원 장비와 연 결되어 사물인터넷 분야의 어플리케이션으로 확장될 수 있다. 여섯째, 본 발명은 간단한 게임을 통해 착용자 개별의 신체적, 인지적 특성에의한 영향을 고려한 fNIRS 신호 측 정을 가능케 하는 캘리브레이션 기능을 탑재하여 착용자 개개인에 최적화로 안정적인 집중도 측정을 가능하게 한다. 일곱째, 본 발명은 정기적 집중도 캘리브레이션 측정을 통하여 사용자의 집중도를 서버에 저장하고 이에 대한 모니터링 기능을 제공하여, 사용자로 하여금 향상 및 저하된 집중도 정보를 바탕으로 한 훈련이 가능하도록 하 는데 이용될 수 있다. 여덟째, 교육 분야의 응용에서는 공부하는 과목에 따라서 집중도와 집중도가 유지되는 시간의 측정이 가능한데, 집중도와 집중 시간을 파악하여 어느 과목이 가장 재미를 느끼는지 알 수 있고 다른 과목을 공부할 때도 집중도 를 높이는 환경 조성이 가능한 자료로 이용할 수 있다. 아홉째, 집중도가 낮은 과목을 공부할 때와 집중도가 높은 과목도 공부할 때 어떤 종류의 배경 음악이나 소리를 어느 크기로 들려주었을 때 집중도가 높고 집중 시간이 길어지는지를 파악하여 집중도를 향상하는 프로그램 개 발에 이용할 수 있다."}
{"patent_id": "10-2025-0047951", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 바람직한 실시 예를 첨부된 도면에 의하여 상세히 설명하면 다음과 같다. 아울러, 본 발명에서 사용되는 용어는 가능한 한 현재 널리 사용되는 일반적인 용어를 선택하였으나, 특정한 경 우는 출원인이 임의로 선정한 용어도 있으며 이 경우는 해당되는 발명의 설명부분에서 상세히 그 의미를 기재하 였으므로, 단순한 용어의 명칭이 아닌 용어가 가지는 의미로서 본 발명을 파악하여야 함을 밝혀두고자 한다. 또한 실시예를 설명함에 있어서 본 발명이 속하는 기술 분야에 익히 알려져 있고, 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않고 더욱 명확히 전달하기 위함이다. 도 3은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치의 회로 구성과 배치의 설명하기 위한 도면이고, 도 4는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 경/연성 인쇄 회로 기판에 구현하는 실시예를 나타낸 도면이다. 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치의 회로 구성과 배치는 도 3에 나타낸 바와 같이 착용자 피부 접촉면과 부품 실장면이 있는데, 착용자 피부 접촉면에는 발광소자인 1개의 에미터 광전 극(LED)과 수광소자인 6개의 제1 내지 제6디텍터 광전극(PD : Photo Diode)(20, 21, 22, 23, 24, 25)이 구 성된다. 이때, 1개의 에미터 광전극과 제1 내지 제6디텍터 광전극(20, 21, 22, 23, 24, 25)은 미리 설정된 소정의 간격을 갖도록 각각 7개의 제1 내지 제7 경성 기판 영역(30, 31, 32, 33, 34, 35, 36)에 배치되되, 6개의 제1 내지 제6디텍터 광전극(20, 21, 22, 23, 24, 25)은 1개의 에미터 광전극을 중심으로 그 외부에 구성된다. 그리고 그 중 2개의 제1, 제2디텍터 광전극(20, 21)은 1개의 에미터 광전극의 양측으로 미리 설정된 제1의 소정간격(예를 들어 5 내지 15mm)을 갖도록 배치되고, 나머지 4개의 제3 내지 제6디텍터 광전극(22, 23, 24, 25)은 1개의 에미터 광전극을 중심으로 사분면 각각에 미리 설정된 제2의 소정간격(예를 들어 25 내지 35mm)을 갖도록 배치된다. 또한 1개의 에미터 광전극과 6개의 제1 내지 제6디텍터 광전극(20, 21, 22, 23, 24, 25)이 배치되는 7개의 제1 내지 제7 경성기판 영역(30, 31, 32, 33, 34, 35, 36)의 사이에는 각각 제1 내지 제6 연성기판 영역(40, 41, 42, 43, 44, 45)이 정의된다. 이러한 제1 내지 제6연성기판 영역(40, 41, 42, 43, 44, 45)은 1개의 에미터 광전극이 배치되는 제1경성기 판 영역 양측의 2개의 제1, 제2연성기판 영역(40, 41)과, 1개의 에미터 광전극과 제2 소정간격을 갖고 배치되는 4개의 제4 내지 제7경성기판 영역(33, 34, 35, 36) 사이에 4개의 제3 내지 제6연성기판 영역(42, 43, 44, 45)으로 정의된다. 그에 따라 경성기판에 구성되는 1개의 에미터 광전극과 6개의 제1 내지 제6디텍터 광전극(20, 21, 22, 23, 24, 25)은 경성기판에 안정적으로 위치할 수 있고, 경성기판들 사이에는 연성기판이 배치됨으로써 착용자에게 1 개의 에미터 광전극과 6개의 제1 내지 제6디텍터 광전극(20, 21, 22, 23, 24, 25)이 구비된 본 발명 근적외 선 분광기를 부착하는 경우 착용자의 신체 곡선에 따라 부드럽고, 안정적으로 부착되도록 할 수 있는 효과가 있 다(도 9 및 도 10 참조) 한편 부품 실장면은 피부 접촉면과 대응되는 면으로, 제3 내지 제6 디텍터 광전극(22, 23, 24, 25)이 형성되는 제4 내지 제7 경성기판 영역(33, 34, 35, 36)과 대응되는 영역의 경성기판에는 각각 제1 내지 제4 트랜스 임피 던스 앰프 회로(이하, TIA 회로)(51 ~ 54)가 구성되고, 제3 내지 제6 디텍터 광전극(22, 23, 24, 25)과 전기적 으로 연결된다. 또한 1개의 에미터 광전극과 제1 내지 제2디텍터 광전극(20, 21)이 형성되는 영역과 대응되는 경성기판에는 전원공급회로, 마이크로 컨트롤러(프로세서) 및 LED 드라이버 회로가 구성된다. 이와 같은 본 발명 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치는 전원공급부, 에미터 광전극과 6개의 제1 내지 제6디텍터 광전극(20, 21, 22, 23, 24, 25)이 배치되는 광전극 배치부, 통신 및 제어부(마이크 로 컨트롤로)로 구성되며, 이상의 1개의 에미터 광전극과 제1 내지 제6디텍터 광전극(20, 21, 22, 23, 24, 25)로 구성되는 광전극 배치부, 전원공급부 및 통신 및 제어부는 기구부는 도 4에 나타낸 바와 같은 경/연성 회 로기판 상에 실장된다. 도 4에서와 같은 경/연성 인쇄회로기판은 경성 인쇄회로기판 영역과 연성 인쇄회로기판 영역을 가지고 있어서, 회로 소자를 안정적으로 실장하는 동시에 장비가 착용자의 이마 모양을 따라 부드럽게 밀착될 수 있도록 한다. 도 5는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 광전극 간의 거리에 따라 채널이 형성되는 방식을 나타낸 도면이다. 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 광전극 간의 거리에 따라 채널이 형성되는 방식은 도 5에서와 같은데, 기본적으로 적외선 분광법 시스템은 빛 신호를 발생하는 에미터 광전극과 빛 신호를 탐지하는 디텍터 광전극 사이의 거리에 따라서 서로 다른 깊이의 조직을 조사하는 채널을 형성할 수 있다. 이때, 근적외선 분광법 시스템에서 광전극 간의 거리에 따라 채널이 형성되는 방식은 도 5와 같은데 본 발명은 도 3에서와 같이 25 내지 35mm(바람직하게는 30mm) 간격을 지니며 대뇌 피질의 조직을 조사하는 4개의 정규 채널인 제 3 내지 제6디텍터 광전극(22, 23, 24, 25)과 5 내지 15mm(바람직하게는 10mm) 간격을 지니며 피 부 중 머리의 이마에서의 혈류반응을 조사하는 2개의 보조 채널(short distance channel) 인 제1 내지 제2 디텍 터 광전극(20, 21)을 탑재하여 2개의 보조 채널을 통해 측정된 혈류반응의 정보는 정규 채널에서 측정된 신호상 에 존재하는 피부 혈류반응에 의한 간섭을 제거하는데 활용함에 특징이 있다. 도 6은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치의 전원공급부의 실시예를 설명 하기 위한 블록 구성도이다, 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치의 전원공급부의 실시예는 도 6에 나타 낸 바와 같은데, 단일 셀의 리튬-폴리머 배터리와 충전 모듈로 구성되는 충전기 및 배터리부에 의해 구동되 며, 충전기 및 배터리부에 의해 공급되는 전력는 두 개의 제1, 제2전원공급장치(62, 63)로 나뉘어지되, 제1 전원공급장치는 리니어 레귤레이터인 LDO(Low Dropout)로 구성되는 제3전원공급장치로 전원을 공급하도 록 구성되어 있어 매우 낮은 수준의 대기전력을 달성하도록 구성되었으며, 휴대용 무선 fNIRS 기술을 이용한 집 중도 모니터링 장치는 통상의 단순한 버튼 스위치(도 16 참조)를 통해 켜지거나 꺼지도록 구성할 수 있다. 도 7 및 도 8은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 광전극 구동회로의 실시예를 나타낸 도면이다. 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 광전극 구동회로의 실시예는 도 7 및 도 8에 나타낸 바와 같은데, 앞에서도 설명한 바와 같이 본 발명의 광전극인 디텍터 광전극과 제1 내지 제6 에미터 광전극(20~25)는 경성/연성 회로 기판(rfPCB)에 실장되어 있으며, 이러한 구조는 광전극이 착용자의 이마 모양에 따라 자연스럽게 밀착할 수 있도록 하는 동시에 광전극을 구동하기 위한 신호 및 전원이 효율적으 로 배치될 수 있도록 하는데, 이러한 구조에 의해 본 발명은 기존의 근적외선 분광기에서 광전극을 착용자의 이 마에 밀착시키기 위해 사용되었던 거추장스러운 전선이나 광섬유 없이 모든 광전극을 착용자의 이마에 밀착할 수 있다. PD와 LED로 구성되는 광전극은 근적외선 분광법의 원리에 따라 근적외선을 발산하는 발광부로 동작하는 에미터 광전극(LED)과 조직을 투과하고 난 빛을 측정하는 수광부인 제1 내지 제6디텍터 광전극(PD : Photo Diode)(20, 21, 22, 23, 24, 25)으로 구성되고 도 7은 디텍터 광전극 구동회로의 예이고, 도 8은 에미터 광전극 구동회로의 예이다. 이때, 본 발명에서의 광전극들은 전전두엽(prefrontal cortex) 부위의 활성화 측정에 최적화된 광전극 배치를 통해 총 4개의 정규 채널(제3 내지 제6디텍터 광전극(22, 23, 24, 25))과 총 2개의 보조 채널(제1 내지 제2디텍 터 광전극(20, 21)으로 구성된다. 또한 본 발명은 최신형의 저전력 블루투스 마이크로프로세서에 의해 제어될 수 있는데, 해당 마이크로프로세서 는 ARM사의 Cortex-M4 코어를 채용한 초저전력 MCU 시리즈인 STM32WB를 탑재하여, 고속의 제어 및 통신을 수행 할 수 있는 한편 매우 낮은 수준의 전력 소모를 하도록 할 수 있다. 해당 마이크로프로세서는 LED 제어 회로를 구동하는 동시에 내장된 12bit ADC로 TIA에 의해 증폭된 빛 신호를 측정하며, 측정된 fNIRS 신호는 내장 블루투 스 기능을 통하여, PC 혹은 스마트 디바이스로 전송된다. 도 9는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치 외주면에 실리콘 케이스의 실시 예를 나타낸 도면이다.본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치 외주면에 실리콘 케이스의 실시예는 도 9에 나타낸 바와 같은데, 실리콘 케이스를 통해 충격이나 정전기 등으로부터 보호되며, 피부에 밀착된다. 실리 콘 케이스는 다소의 신축성을 지닌 소재로, 외부 빛을 차단하는 동시에 광전극이 착용자의 이마 모양을 따라 부 드럽게 밀착되는 것을 돕는다. 이때 도 9에서의 돌기 형태의 구조는 발광부와 수광부가 피부에 잘 밀착되게 하 여 발광부 빛이 외부로 새어나가 바로 수광부로 전달되는 것을 막고, 또한 외부 빛이 수광부로 들어와 외부 빛 으로 발생하는 잡음을 방지할 수 있다. 본 발명에서는 케이스 양쪽 끝에 달린 끈을 통해 착용자의 이마에 착용 되도록 할 수 있다. 도 10은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 집중도 산출 과정을 설명 하기 위한 도면이다. 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 집중도 산출 과정은 도 10에 나타 낸 바와 같은데, 본 발명의 소프트웨어부는 기구부인 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치 에서 측정된 신호를 바탕을 착용자의 집중도 정보를 산출한다. 이때 앞에서 설명한 바와 같은 블루투스 통 신을 통해 PC 또는 스마트 디바이스(스마트 패드, 스마트 폰, 노트북 등)와 페어링되며 측정된 정보를 전송한다. 전송된 혈역학 반응 신호는 페어링된 스마트 디바이스 상에서 미리 설정된 프로그램에 따라 실시간적 으로 전처리를 거친 후 추출된 특징들로부터 착용자의 집중도 정보로 정량화된다. 본 발명은 개별 착용자의 신체적, 인지적 특성에 따라 발생하는 혈역학적 활성화의 차이를 고려한 집중도의 정 량화를 수행한다. 이러한 정량화를 위하여, 본 발명에서는 예를 들어 간단한 게임을 통하여 분류기를 최적화하 는 기능(캘리브레이션)을 포함한다. 이때, 스마트 디바이스에는 블루투스 페이링된 집중도 모니터링 장치로부터 전송된 집중도 정보를 처 리하는 별도의 소프트웨어부가 구성되는데, 소프트웨어부는 전처리부, 특징추출부 및 분류부를 포함하여 구성된다. 여기서 전처리부는 전송된 빛 신호를 혈역학 신호로 변환하고 잡음을 처리한다. 특징추출부는 전처리부에서 전처리된 혈역학 신호로부터 기울기, 평균값, 치우침 등의 특징을 추출한 다. 분류부는 특징추출부에서 추출된 특징으로부터 착용자의 집중도를 미리 설정된 기준에 따라 정량화한 다. 도 11은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 수정된 비어-램버트 법칙 을 통해 빛 신호가 혈역학 신호로 변환되는 원리를 나타낸 도면이다. 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 수정된 비어-램버트 법칙을 통해 빛 신호가 혈역학 신호로 변환되는 원리는 도 11에 나타낸 바와 같은데, 본 발명의 기구부인 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 측정되어 블루투스를 통해 전송된 빛 세기 신호는 서로 다른 두 가지 근적외선 파장에 관한 것으로, 이 신호는 수정된 비어-램버트 법칙(modified Beer-Lambert law)을 통해 혈류반 응 신호로 변환되고, 변환된 혈류반응 신호는 움직임, 호흡, 생체활동 등에 의해 유발된 잡음이 포함되어 있으 나 이러한 잡음은 이후 PC 또는 스마트 디바이스에서 필터를 사용한 신호 전처리 과정에서 제거된다. 도 12는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 신호원 분리 알고리즘을 통하여 보조 채널과 정규채널의 신호를 분리하는 과정을 나타낸 도면이다. 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 신호원 분리 알고리즘을 통하여 보 조 채널과 정규채널의 신호를 분리하는 과정은 도 12에 나타낸 바와 같은데, 정규 채널과 보조 채널로부터 측정 된 신호는 각각 대뇌 피질과 피부에서의 혈류반응을 나타내는 신호이다. 전처리부에서는 정규 채널과 보조 채널의 신호들을 이용하여 독립 성분 분석(independent component analysis) 기반의 신호원 분리 알고리즘(blind source separation)를 수행하고, 혈역학 반응이 아닌 혈류반응을 제거된 고품질의 혈역학 반응 신호를 추출한다. 도 12에서는 정규채널과 보조채널을 이용하여 혈역학 반응으로부터 피부 의 혈류반응 성분을 제거하는 과정을 보여주고 있다. 도 13은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 착용자의 신체적, 인지적 특성을 반영한 혈역학 신호 측정을 위한 캘리브레이션을 수행하는 과정을 사용되는 암산 게임의 일예를 나타낸 도면이고, 도 14는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 이용하여 착용자 의 신체적 특성을 반영한 혈역학 신호 측정을 위한 캘리브레이션을 수행하는 과정을 설명한 흐름도이다. 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 이용하여 착용자의 신체적 특성을 반 영한 혈역학 신호 측정을 위한 캘리브레이션을 수행하는 과정은 도 14에 나타낸 바와 같은데, 종래의 근적외선 분광법을 통한 혈역학 반응 측정은 측정 대상의 신체적 특성에 따라 다르게 측정되는 혈역학적 활성화의 차이를 고려하지 않고 이후의 신호처리에 적용한다는 한계를 지니고 있었으나, 본 발명은 개별 착용자의 혈역학적 활성 화 패턴을 미리 조사하는 캘리브레이션 과정을 거쳐서, 착용자의 신체적 특성에 따른 측정 결과의 오차를 보정 한다. 이러한 캘리브레이션은 도 13에서와 같은 간단한 게임을 통해 수행되며 그 절차는 다음과 같다. 사용자는 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 스마트폰 등의 스마트 디바이스와 페어링 한 후 장비를 착용한다. 그리고 스마트 디바이스에서 암산게임을 수행하도록 하며(S10), 이때 난이도는 가장 쉬운 게임부터 수행되도록 한다. 사용자의 fNIRS 신호를 측정하며(S20), 게임을 통과한 경우(S30) 스마트 디바이스에서는 게임 난이도를 상승시 킨다(S50). 즉 난이도가 점진적으로 상승하는 암산 게임을 플레이하는 암산게임을 진행시킨다. 게임은 사용자가 통과하지 못할 때까지 플레이되며(S30), 서로 다른 난이도의 게임 간에는 휴식시간 주며, 이때, 약 30초 이상(30초 내지 60초) 주는 것이 바람직하다. 그리고 게임의 난이도를 상승시키는 단계에서 게임을 통과하지 못한 경우(S30), 스마트 디바이스에서는 사용자 가 통과한 최고 난이도의 게임에서 측정된 혈역학 신호를 바탕으로 사용자의 최적화 난이도와 해당 난이도에서 의 혈역학 반응의 크기를 기반으로 한 혈역학적 활성화 매개변수가 산출된다(S40). 여기서 도 13은 본 발명에서 착용자의 신체적, 인지적 특성을 반영한 혈역학 신호 측정을 위한 캘리브레이션을 수행하는 과정을 사용되는 암산 게임의 일 예이다. 사용자는 예를 들어 최소 6개월(1개월 내지 6개월)에 한번 정기적으로 집중도에 대한 캘리브레이션 측정을 수행 하여 집중도의 향상 또는 저하를 모니터링 할 수 있다. 측정 결과는 모니터링 서버(도 17 참조)에 저장되며, 사용자는 이러한 정보를 바탕으로 다시 최대한의 집중도를 가질 수 있도록 훈련할 수 있다. 이와 같이 본 발명은 간단한 게임을 통해 착용자 개별의 신체적, 인지적 특성에 의한 영향을 고려한 fNIRS 신호 측정을 가능케 하는 캘리브레이션 기능을 탑재하여 착용자 개개인에 최적화로 안정적인 집중도 측정을 가능하게 하여, 사용자로 하여금 향상 및 저하된 집중도 정보를 바탕으로 한 훈련이 가능하도록 하는데 이용될 수 있는데, 교육 분야의 응용에서는 공부하는 과목에 따라서 집중도와 집중도가 유지되는 시간의 측정이 가능하므 로 집중도와 집중 시간을 파악하여 어느 과목이 가장 재미를 느끼는지 알 수 있고 다른 과목을 공부할 때도 집 중도를 높이는 환경 조성이 가능한 자료로 이용할 수 있고, 집중도가 낮은 과목을 공부할 때와 집중도가 높은 과목도 공부할 때 어떤 종류의 배경 음악이나 소리를 어느 크기로 들려주었을 때 집중도가 높고 집중 시간이 길 어지는지를 파악하여 집중도를 향상하는 프로그램 개발에 이용될 수 있다. 도 15는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 정기적 집중도 캘리브레이 션 결과를 보여주는 방식을 나타낸 도면이다. 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 정기적 집중도 캘리브레이션 결과 는 전처리가 완료된 혈역학 신호로부터 특징 추출기에 의해 기울기, 평균, 치우침, 분산 등의 특징 정보가 계산 되고, 이후 특징 정보는 분류기에 의해 정량화된 후 착용자의 집중도 정보로 산출된다.이러한 본 발명 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치는 학습을 비롯하여 전반적인 인지적 활 동과 과제 수행에 따른 뇌 활성화 모니터링과 뇌의 혈역학 반응간 동기화를 연구하는 데에 이용될 수 있다. 도 16은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치의 실시예를 설명하기 위한 블 록 구성도이고, 도 17은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 포함하는 집 중도 모니터링 시스템의 제1실시예를 설명하기 위한 도면이다. 한편 도 16은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치의 실시예를 설명하 기 위한 블록 구성도로, 제1 내지 제6 디텍터 광전극부와 에미터 광전극부를 포함하는 광전극 배치부와, TIA 회 로부, 전원공급부, 드라이버 회로부 및 통신 및 제어부를 포함하여 구성된다. 이러한 집중도 모니터링 장치에는 외부로 충전단자와 온/오프 스위치가 더 구성된다. 한편 도 17은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 포함하는 집중도 모니 터링 시스템의 제1실시예를 나타내고 있다. 이와 같은 집중도 모니터링 시스템에서는 집중도 모니터링 장치들로부터 전송된 과목에 따른 집중도와 집 중도가 유지되는 집중 시간을 파악하여 어느 과목이 가장 재미를 느끼는지 사용자별 데이터를 집중도 모니터링 서버에 누적함에 따라 알 수 있고, 이러한 데이터는 사용자별 다른 과목을 공부할 때도 집중도를 높이는 환경 조성이 가능하는 자료로 이용할 있는 연구에 이용될 수 있다. 또한 집중도가 낮은 과목을 공부할 때와 집 중도가 높은 과목도 공부할 때 어떤 종류의 배경 음악이나 소리를 어느 크기로 들려주었을 때 집중도가 높고 집 중 시간이 길어지는지를 파악하는 프로그램 개발에 이용될 수 있다. 도 18은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 포함하는 집중도 모니터링 시스템의 제2실시예를 설명하기 위한 도면이다. 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 포함하는 집중도 모니터링 시스템의 제2실시예는 도 18에 나타낸 바와 같이, 입/출력 시스템, 인터페이스, 빅데이터 웨어하우스 및 분석 시스템으로 구성될 수 있는데, 입/출력 시스템은 집중도 모니터링 장치와 스마트 디바이스에 내장된 스피커나 PC에 연 결된 스피커 등으로 구성되고, 인터페이스는 집중도 모니터링 장치와 페어링되는 스마트 디바이스 (PC, 스마트폰, 스마트 패드 등)와, 스마트 디바이스에 탑재되는 애플리케이션(사용자 인터페이스 UI/UX, 실시간 분석기) 등으로 구성될 수 있고, 빅데이터 웨어하우스는 서버 및 클라우드 저장소로 구성될 수 있으며, 분석 시스템은 빅데이터에 기반한 인공지능 학습 모델로 구성될 수 있다. 이와 같은 본 발명 제2실시예에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 포함하는 집중 도 모니터링 시스템을 이용하여 한 개인이 집중도 모니터링 장치를 머리에 장착한 후, 스마트 디바이스와 스피커를 통해 학습을 비롯한 다양한 인지활동을 하는 과정에서 집중시간, 집중의 깊이 및 이와 관련한 변 수들을 측정하고, 이 데이터를 스마트 폰 앱 또는 컴퓨터(PC)의 애플리케이션 소프트웨어를 활용하여 서버 및 클라우드 저장소에 누적한다. 이와 같이 누적되는 데이터는 한 개인뿐 아니라 이러한 스마트 디바이스 를 활용한 많은 사용자들의 데이터 누적이 가능한데, AI를 활용한 분석 시스템은 서버 및 클라우드 저장소에 누적된 빅데이터를 활용하여 개별 사용자에게 최적화된 매개변수를 산출하며 이를 스마트 폰 앱 또는 컴퓨터(PC)의 애플리케이션에 업데이트한다. 따라 서 스마트 폰 앱 또는 컴퓨터(PC)의 애플리케이션은 실시간 분석 결과를 수치, 비율 및 관련 변수를 다양 한 그래프와 시각 디자인적 상징(도 15 참조)으로 표현하는 것이 가능할 것이다. 참고로, 사용자의 장치 사용 시 스마트 디바이스에 내장된 스피커를 통해 백색 소음과 자연 소음을 비롯한 다양한 소리의 제공이 가능 한데, 그와 같은 다양한 소리의 제공 시 해당 개인의 집중시간, 집중의 깊이 및 이와 관련한 변수들이 사용자의 집중도 및 혈역학 신호와 함께 빅데이터로 구축되어, 인공지능을 통한 분석 과정에서 사용자 개인에 최적화된 집중 보조 음성 신호로 선별되고 향후 집중력 증진을 위하여 제공될 수 있다. 그리고 이러한 과정을 평상시, 사용자들의 학습, 예를 들어 국어, 수학 등과 같은 과목별, 주제별 또는 인지활 동별로 분석가능하며, 개인의 과목이나 주제에 따른 집중시간, 집중의 깊이 및 이와 관련한 변수들 간의 상대적 비교분석을 하여, 그 스마트 디바이스를 통해 획득한 개인의 분석 데이터를 빅데이터를 참조하여 학습시의 강점과 약점, 흥미, 적성 등의 파악이 가능하다.집중도 모니터링 장치와 페어링 된 PC, 스마트폰, 태블릿 등의 스마트 디바이스 상의 스피커를 통해 다양한 소리를 제공하면서 집중시간, 집중의 깊이 및 이와 관련한 변수들을 측정하여 각종소리와의 상호작 용효과를 분석하여, 그 사용자의 일반상황 및 과목별 집중력을 강화할 수 있는 최선의 소리를 찾아 주어 집중력 향상을 도와주는 것이 가능하고, 이를 통해 사용자의 일반상황 및 과목별 집중력을 강화할 수 있는 최선의 소리 를 찾는 것이 가능하고, 이를 통해 역시 집중력 향상을 도와주는 것이 가능하게 된다. 또한 스마트 디바이스를 사용한 참여자 모두에게 적용하여 전 참여자가 생산하는 빅데이터를 실시간으로 구축하며, 그 빅데이터를 통계기법 및 AI 등을 활용하여, 한 개인이 전체 참여자 중 상위 몇 퍼센트에 해당되는 지 상대적인 위치를 실시간으로 분석이 가능하며, 이를 수치, 비율 및 다양한 그래프와 시각디자인적 상징으로 실시간 표현할 수 있다. 이상과 같은 예로 본 발명을 설명하였으나, 본 발명은 반드시 이러한 예들에 국한되는 것이 아니고, 본 발명의 기술사상을 벗어나지 않는 범위 내에서 다양하게 변형 실시될 수 있다. 따라서 본 발명에 개시된 예들은 본 발 명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 예들에 의하여 본 발명의 기술 사 상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2025-0047951", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 근적외선 분광기의 사용예를 나타낸 도면, 도 2는 근적외선 분광기의 작동 원리를 설명하기 위한 도면, 도 3은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치의 회로 구성과 배치의 설명하기 위한 도면, 도 4는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 경/연성 인쇄 회로 기판에 구 현하는 실시예를 나타낸 도면, 도 5는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 광전극 간의 거리에 따라 채널이 형성되는 방식을 나타낸 도면, 도 6은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치의 전원공급부의 실시예를 설명 하기 위한 블록 구성도, 도 7 및 도 8은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 광전극 구동회로의 실시예를 나타낸 도면, 도 9는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치 외주면에 실리콘 케이스가 형성 된 실시예를 나타낸 도면, 도 10은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 집중도 산출 과정을 설명 하기 위한 도면, 도 11은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 수정된 비어-램버트 법칙 을 통해 빛 신호가 혈역학 신호로 변환되는 원리를 나타낸 도면, 도 12는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 신호원 분리 알고리즘을 통하여 보조 채널과 정규채널의 신호를 분리하는 과정을 나타낸 도면, 도 13은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 착용자의 신체적, 인지적 특성을 반영한 혈역학 신호 측정을 위한 캘리브레이션을 수행하는 과정을 사용되는 암산 게임의 일예를 나타낸 도면, 도 14는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 이용하여 착용자의 신체적 특성을 반영한 혈역학 신호 측정을 위한 캘리브레이션을 수행하는 과정을 설명한 흐름도, 도 15는 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치에서 정기적 집중도 캘리브레이 션 결과를 보여주는 방식을 나타낸 도면이다. 도 16은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치의 실시예를 설명하기 위한 블 록 구성도, 도 17은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 포함하는 집중도 모니터링 시스템의 제1실시예를 설명하기 위한 도면, 도 18은 본 발명에 따른 휴대용 무선 fNIRS 기술을 이용한 집중도 모니터링 장치를 포함하는 집중도 모니터링 시스템의 제2실시예를 설명하기 위한 도면이다."}
