{"patent_id": "10-2022-0185308", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0103286", "출원번호": "10-2022-0185308", "발명의 명칭": "인공지능 기반 거주자 활동유형 분석을 위한 학습데이터 자동화 라벨링 시스템 및 라벨링 방", "출원인": "한국건설기술연구원", "발명자": "이홍철"}}
{"patent_id": "10-2022-0185308", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "재실자 활동 유형 분석을 위한 인공지능 모델의 학습에 사용하기 위한 거주데이터와 일상데이터의 라벨링 방법으로서, 거주데이터와 일상데이터를 수신하는 단계; 수신된 거주데이터와 일상데이터에 대하여 이상치를 제거하는 데이터 전처리 단계; 및 데이터 기반 재실자 활동 상황별 카테고라이징 단계를 포함하는 것을 특징으로 하는 데이터 라벨링 방법."}
{"patent_id": "10-2022-0185308", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "재실자 활동 유형 분석을 위한 인공지능 모델의 학습에 사용하기 위한 거주데이터와 일상데이터의 라벨링 시스템으로서, 거주데이터와 일상데이터를 수신하는 수신 모듈; 수신된 거주데이터와 일상데이터에 대하여 이상치를 제거하는 데이터 전처리를 수행하는 데이터 전처리 모듈;및 거주데이터와 일상데이터를 기반으로 재실자 활동 상황별로 서로 매칭시켜 재실자의 활동을 카테고라이징하여라벨링하는 카테고라이징 모듈(3)을 포함하는 것을 특징으로 하는 데이터 라벨링 시스템."}
{"patent_id": "10-2022-0185308", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 안시스템, 냉난방-환기시스템, 나아가 거주자 건강관리시스템 등 거주자의 일상생활 지원을 위한 재실 자 활동 유형(현재 상태) 분석을 위하여, 사용자 직접 데이터를 입력하던 종래의 방식을 개선하여, 데이터 라벨 링을 자동적으로 수행하게 되어 인공지능 학습에 유용하게 사용할 있는 \"인공지능 기반 재실자 활동유형 분석을 위한 거주 데이터 자동화 라벨링 시스템 및 방법\"에 관한 것이다."}
{"patent_id": "10-2022-0185308", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 재실자 활동유형 분석을 위한 인공지능 학습데이터 자동 라벨링 시스템 및 방법에 관 한 것으로서, 구체적으로는 실내 냉난방 시스템, 공조시스템, 온습도 조절장치 등과 같이 재실자(在室子)의 일 상생활 지원을 위한 시스템(실내환경조정시스템)을 조정하여 거주자에게 적합한 실내환경을 만들어주는 관리 서 비스를 제공할 목적으로, 센서에 의해 취득된 실내 공기질 관련 정보를 기반으로 재실자(在室子)의 현재 상태와 활동 상태 등의 활동유형을 분석하기 위하여 인공지능 모델을 사용함에 있어서, 인공지능 모델의 학습과정에서 필요한 학습데이터의 라벨링을 자동적으로 수행하게 되는 \"인공지능 기반 재실 활동유형 분석을 위한 학습데이 터 자동화 라벨링 시스템 및 방법\"에 관한 것이다."}
{"patent_id": "10-2022-0185308", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "재실자에게 적합한 실내환경을 만들어주기 위하여 센서에 의해 측정된 실내의 공기질 정보 및 재실자의 생체 정 보를 기반으로 재실자의 활동유형을 분석하여, 실시간으로 재실자의 위치 및 재실자의 활동유형에 따라 실내 공 기질을 제어하는 서비스를 제공하는 방안이 본 발명자에 의해 제안되었다. 그런데 이러한 서비스를 제공하기 위해서는 재실자의 활동유형에 대한 분석이 필요하며, 재실자의 활동유형 분석에는 인공지능 모델을 이용할 수 있다. 이와 같이 재실자의 활동유형 분석에 인공지능 모델을 이용하기 위해서는 인공지능 모델을 학습시키기 위 한 학습데이터가 필요하다. 인공지능 모델을 이용하여 재실자의 활동유형을 분석할 수 있는데, 이를 위해서는 인공지능 모델을 학습시키기 위한 학습데이터를 구성함에 있어서 데이터 라벨링을 해야 하는 것이다. 인공지능 학습데이터의 라벨링 분야의 종래 기술로는 대한민국 등록특허 제10-2244699호 등이 존재하지만, 이러 한 종래 기술은 재실자 활동 유형을 분석하여 분류하고, 그 결과에 따라 데이터 라벨링을 하는 것에는 사용하기 에 적합하지 않다. 선행기술문헌 특허문헌(특허문헌 0001) 대한민국 등록특허공보 제10-2244699호(2021. 04. 27. 공고)."}
{"patent_id": "10-2022-0185308", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 위와 같은 종래 기술의 한계를 극복하기 위하여 개발된 것으로서, 재실자의 위치 및 재실자의 활동유 형에 따라 실내 공기질을 제어하는 서비스를 제공할 목적으로 재실자의 활동유형에 대한 분석을 수행할 인공지 능 모델을 구축하고 이를 학습시킴에 있어서, 인공지능 모델의 학습을 위한 학습데이터를 구성할 때 필요한 \"재 실자 활동 유형에 따른 데이터 라벨링\"을 효율적으로 수행할 수 있는 기술을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0185308", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "위와 같은 과제를 달성하기 위하여 본 발명에서는, 실내환경조정시스템 제어용 인공지능 모델의 학습을 위한 데 이터의 라벨링 방법으로서, 거주 데이터를 수신하는 단계; 수신된 거주 데이터에 대하여 이상치를 제거하는 데 이터 전처리 단계; 및 재실자 활동 상황별 분석 및 분류 단계를 포함하는 것을 특징으로 하는 데이터 라벨링 방 법이 제공된다. 또한 본 발명에서는 상기한 목적을 달성하기 위하여 실내환경조정시스템 제어용 인공지능 모델의 학습을 위한 데이터의 라벨링 시스템으로서, 거주 데이터를 수신하는 수신 모듈; 수신된 거주 데이터에 대하여 이상치를 제 거하는 데이터 전처리를 수행하는 데이터 전처리 모듈; 및 재실자 활동 상황별 분석 및 분류를 수행하는 재실자 활동 분류모듈을 포함하는 것을 특징으로 하는 데이터 라벨링 시스템이 제공된다."}
{"patent_id": "10-2022-0185308", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 보안시스템, 냉난방-환기시스템, 나아가 거주자 건강관리시스템 등 거주자의 일상생활 지원 을 위한 재실자 활동 유형(현재 상태) 분석을 위하여, 거주자가 직접 데이터를 입력하던 종래의 방식을 개선하 여, 데이터 라벨링을 자동적으로 수행하게 되어 인공지능 모델의 학습데이터로서 유용하게 사용할 있게 되는 효 과가 발휘된다."}
{"patent_id": "10-2022-0185308", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부한 도면을 참조하여 설명한다. 본 발명은 도면에 도시된 실시예를 참고 로 설명되었으나 이는 하나의 실시예로서 설명되는 것이며, 이것에 의해 본 발명의 기술적 사상과 그 핵심 구성 및 작용이 제한되지 않는다. 앞서 언급하였듯이 재실자의 위치 및 재실자의 활동유형에 따라 실내 공기질을 제어하는 서비스를 제공하기 위 해서는 재실자의 활동유형에 대한 분석을 수행할 인공지능 모델을 구축하고 이를 학습시킬 필요가 있다. 본 발 명은 이러한 재실자의 활동유형에 대한 분석을 목적으로 하는 인공지능 모델의 학습을 위한 학습데이터를 구성 하기 위하여, 재실자 활동 유형에 따른 데이터 라벨링을 수행하는 방법과 시스템이다. 도 1에는 데이터 라벨링의 개념을 보여주는 개략도가 도시되어 있고, 도 2에는 라벨링 샘플로 학습된 SVM 마진 표본의 사례를 보여주는 그래프도가 도시되어 있다. 인공지능 학습은 어떠한 종류의 것을 이용하여도 무방하지 만 패턴 인식, 자료 분석 등에 주로 이용되는 지도학습모델의 한 종류인 서포트벡터머신(SVM, Support Vector Machine)을 이용하는 것이 바람직하다. 서포트벡터머신을 이용한 인공지능 학습은 주로 분류와 회귀 분석을 위 해 사용된다. 인공지능 학습을 수행할 때에는 여러 카테고리 중 어느 하나에 속한 데이터의 집합이 주어졌을 때, 데이터 집합을 바탕으로 하여 새로운 데이터가 어느 카테고리에 속할지 판단하는 비확률적 이진 선형 분류모델을 만들게 된다. 그리고 만들어진 비확률적 이진 선형 분류 모델은 데이터가 사상된 공간에서 경계로 표현 되는데, 상기 서포트벡터머신의 알고리즘은 데이터가 사상된 공간에서 중 가장 큰 폭을 가진 경계를 찾는 알고 리즘이다. 인공지능 학습에 이러한 서포트벡터머신의 알고리즘을 활용하기 위해서는 라벨링 데이터가 필수적으 로 필요하게 된다. 본 발명에 따른 데이터 라벨링 방법은 거주데이터와 일상데이터를 수신하는 단계, 수신된 거주데이터와 일상데 이터에 대하여 이상치를 제거하는 데이터 전처리 단계, 및 거주데이터와 일상데이터를 기반으로 재실자 활동 상 황별로 서로 매칭시켜 재실자의 활동을 카테고라이징하여 라벨링하는 단계를 포함한다. 그리고 본 발명에 따른 데이터 라벨링 시스템은 거주데이터 및 일상데이터를 수신하는 데이터 수신 모듈, 수 신된 거주데이터와 일상데이터에 대하여 이상치를 제거하기 위한 데이터 전처리 작업을 수행하는 데이터 전처리 모듈, 및 거주데이터와 일상데이터를 기반으로 재실자 활동 상황별로 서로 매칭시켜 재실자의 활동을 카테고 라이징하여 라벨링하는 카테고라이징 모듈을 포함하는 구성을 가진다. 본 발명의 데이터 라벨링 방법에서는 우선 실내환경센서가 측정한 재실자가 존재하는 실내의 환경에 대한 물리 량(예를 들면, 온도, 습도, 이산화탄소 농도, 미세먼지 농도 등)의 측정값을 \"거주데이터\"로서 데이터 수신 모 듈을 통해서 수신하며, 더 나아가 거주자가 실내에서 일상적인 생활을 하면서 TV 등의 각종 생활용품을 사용 하는지의 여부에 대한 데이터를 \"일상데이터\"로서 데이터 수신 모듈을 통해서 수신한다(단계 S1 - 거주데이 터 및 일상데이터의 수신단계). 여기서 일상데이터는 TV의 on/off 데이터, 개인용 컴퓨터 on/off 데이터, 책상에 놓이는 탁상스텐드 on/off 데 이터, 주방 후드 on/off 데이터, 욕실 전등 on/off 데이터, 실내의 각 구획공간 전등 on/off 데이터, 침대 착좌 센서의 on/off 데이터 및 의자 착좌센서의 on/off 데이터로 이루어진 그룹에서 선택된 하나 또는 복수개의 데이 터로 이루어질 수 있다. 이를 위해서 구체적으로는 집안을 청소하는데 사용하는 청소기의 전원부에 on 또는 off 상태를 확인할 수 있는 센서 설치하여 청소기의 on/off 데이터를 수신할 수 있다. 실내의 주방 등과 같은 구획 공간의 전등 on 또는 off 상태를 확인할 수 있는 센서 설치하여 전등의 on/off 데이터를 수신할 수 있다. 주방 후드에도 on 또는 off 상태를 확인할 수 있는 센서 설치하여 주방 후드의 on/off 데이터를 수신할 수 있다. TV 전원부에도 on 또는 off 상태를 확인할 수 있는 센서 설치하여 TV의 on/off 데이터를 수신할 수 있다. 개인용 컴퓨터 전원부에도 on 또는 off 상태를 확인할 수 있는 센서 설치하여 개인용 컴퓨터의 on/off 데이터를 수신할 수 있다. 책상의 탁상스탠드에도 on 또는 off 상태를 확인할 수 있는 센서 설치하여 탁상스탠드의 on/off 데이 터를 수신할 수 있다. 책상 의자에 착좌를 확인할 수 있는 센서를 설치하여 착좌여부에 대한 데이터를 수신할 수 있다. 욕실전등에도 on 또는 off 상태를 확인할 수 있는 센서 설치하여 욕실 점등 여부에 대한 데이터를 수 신할 수 있다. 침대 주변에 놓이는 수면용 전등에도 on 또는 off 상태를 확인할 수 있는 센서 설치하여 수면용 전등의 on/off 데이터를 수신할 수 있다. 침대 매트리스에 착좌를 확인할 수 있는 센서 설치하여 침대 매트리 스의 사용여부에 대한 데이터를 \"일상데이터\"로서 수신할 수 있다. \"데이터 라벨링\"은 인공지능 모델이 학습할 수 있는 형태로 데이터를 분류하고 가공하는 작업을 의미한다. 학 습의 효율을 높이기 위해 데이터 라벨링에는 각 데이터들을 분류하는 작업뿐만 아니라 잘못된 데이터들을 판별 하여 제외하는 작업이 포함된다. 즉, 데이터 라벨링을 위해서는 <데이터 전처리>가 필요한 것이다. 데이터 전 처리의 종류에는 데이터 클리닝(cleaning), 데이터 통합(integration), 데이터 변환(transformation), 데이터 축소(reduction), 데이터 이산화(decartelization) 등이 존재한다. 데이터의 결측치 내지 이상치의 존재 여부 를 파악하고, 이상치가 존재하는 경우에는 이를 제거하며, 결측치가 존재하거나 불일치되는 부분이 존재하는 경 우에는 일관성 있는 데이터의 형태로 전환하는 과정이 <데이터의 전처리>에 포함된다. 이와 같이 본 발명에서 는 데이터 전처리를 수행함으로써, 품질이 낮은 데이터를 이용해서도 더욱 우수한 분석 결과를 도출할 수 있게 된다. 따라서 본 발명에서는 데이터 전처리 모듈을 구비하여 수신된 거주 데이터에 대하여 이상치를 제거하기 위한 데이터 전처리 작업을 수행하게 된다. 도 3에는 공부 활동의 미세먼지 데이터에서 이상치를 제거하기 전의 상 태를 보여주는 그래프도가 도시되어 있고, 도 4에는 데이터의 전처리 작업에 의해 이상치를 제거한 후의 상태를 보여주는 그래프도가 도시되어 있다. 본 발명에서 데이터 전처리 작업이 수행된 후에는 카테고라이징 모듈에서 거주데이터와 일상데이터를 기반으 로 재실자 활동 상황별로 서로 매칭시켜 재실자의 활동을 카테고라이징하여 라벨링함으로써, 인공지능 모델의 학습을 위한 학습데이터를 구성하게 된다. 데이터 기반 재실자 활동 상황별 카테고라이징하여 재실자 활동 분 류하는 것이다. 여기서 인공지능 모델은 \"재실자의 활동유형에 대한 분석\"을 목적으로 하는 인공지능모델이다. 카테고라이징 모듈에서는 우선 거주데이터로 취득된 실내 이산화탄소 농도 및 실내 미세먼지 농도와 관련해 서는 각각의 센서가 OFF 에서 ON 으로 변경되었을 때부터 다시 OFF 될때 까지의 실내 이산화탄소 농도 측정값 및 미세먼지 측정값을 학습용 데이터로 저장한다. 그리고 \"일상데이터\"로 측정된 청소기 on/off 데이터와 관련하여, 청소기 전원부이 ON인 상태의 데이터를 매칭 시켜서 \"청소상태 데이터\"로 라벨링하며, 주방전등이 ON 인 상태 또는 주방후드가 ON 인 상태의 데이터를 매칭 시켜서 \"요리상태 데이터\"로 라벨링한다. TV 전원 센서 및 개인용 컴퓨터 전원 센서가 ON 이면서 이와 동시에 미세먼지(PM10) 측정값이 40 ug/m3,min 이상인 데이터를 매칭시켜서 \"운동상태 데이터\"로 라벨링한다. 탁상스 텐드 센서, 의자 착좌센서, 욕실전등 센서, 수면 전등 센서 및 메트리스 착좌 센서 중 어느 하나라도 ON 인 상 태의 데이터는 \"비활동 상태 데이터\"로 라벨링한다. 본 발명에서는 위와 같은 방식으로 데이터 라벨링이 이루어지며, 이를 통해서 인공지능 모델을 위한 학습데이 터가 구성되고, 이러한 학습데이터를 이용하여 서포트벡터머신(SVM, Support Vector Machine) 기법에 의한 재실 자 활동 유형 학습 수행한다. 본 발명에 의하면, 가전에 설치된 명확한 라벨링 기반의 학습데이터를 만들어 낼 수 있고, 이를 실내 공기질 데 이터와 연계하게 되므로, 이러한 라벨링 과정에 의해 만들어진 학습데이터로 학습이 이루어진 인공지능 모델의 경우, 가전 센서가 작동하지 않는 조건에서도 재실자 상태를 진단 가능하게 된다는 장점이 있다. 본 발명에서는 재실자의 일상생활을 통하여 수집된 실내환경센서(온습도, CO2, 미세먼지), 재실자위치센서, 생 체신호센서(호흡측정센서 등)의 거주데이터와 사용자의 생활 중 사용되는 일상데이터(TV on/off, 컴퓨터 on/off, 탁상스텐드 on/off, 주방 on/off, 욕실등 on/off, 침대 착좌센서 on/off, 의자 착좌센서 on/off 등)를 자동화 매칭하여 라벨링 데이터셋을 자동으로 구성하고, 학습데이터로 활용하므로서 사용자 맞춤형 보안관리, 공기질관리, 건강관리 서비스를 제공할 수 있게 된다. 물론 인공지능 학습데이터가 충분히 확보되지 이전에는 아래에 제시하고 있는 전문가시스템 등을 적용하여 사용 자에게 유사 서비스를 제공할 수 있다. 특히, 본 발명에 의하면, 이용하면 보안시스템, 냉난방-환기시스템, 나아가 거주자 건강관리시스템 등 거주자의 일상생활 지원을 위한 인공지능 학습용 자동화 라벨링 기능의 지원이 가능하게 되는 매우 유용한 효과가 발휘된 다. 도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2022-0185308", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 데이터 라벨링의 개념을 보여주는 개략도이다. 도 2는 라벨링 샘플로 학습된 SVM 마진 표본의 사례를 보여주는 그래프도이다. 도 3은 공부 활동의 미세먼지 데이터에서 이상치를 제거하기 전의 상태를 보여주는 그래프도이다. 도 4는 이상치를 제거한 후의 상태를 보여주는 그래프도이다."}
