{"patent_id": "10-2023-0072731", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0173784", "출원번호": "10-2023-0072731", "발명의 명칭": "인공지능 기반 패션 코디네이션 제공 장치 및 방법", "출원인": "이성일", "발명자": "이성일"}}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 지능 기반 패션 코디네이션 제공 장치로서,적어도 하나의 단말과 통신하기 위한 통신부;적어도 하나의 명령을 저장하는 메모리; 및 프로세서를 포함하고,상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금,상기 통신부를 통해 사용자의 단말로부터 수신된 서비스 요청 또는 기 저장된 사용자 코디네이션 속성 데이터를기반으로 상기 사용자를 위한 패션 코디네이션 서비스와 연계된 기준 아이템을 결정하고,상기 기준 아이템 또는 상기 사용자의 코디네이션 속성 데이터 중 적어도 하나를 기반으로 상기 사용자의 가상옷장에 저장된 아이템 중 적어도 하나를 포함하는 복수의 후보 아이템 조합을 생성하고,각 후보 아이템 조합을 입력으로 하여 상기 사용자의 코디네이션 속성에 대한 각 후보 아이템 조합의 스코어를출력하는 인공 지능 기반 사용자별 코디네이션 추천 모델을 실행하고,상기 각 후보 아이템 조합의 스코어를 기반으로 상기 패션 코디네이션 서비스와 연계된 서비스 응답을 생성하도록 구성되는,패션 코디네이션 제공 장치."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 후보 아이템 조합을생성하기 위하여,상기 기준 아이템 또는 상기 사용자의 코디네이션 속성 데이터 중 적어도 하나를 입력으로 하여 상기 복수의 후보 아이템 조합을 출력하는 인공 지능 기반 아이템 조합 생성 모델을 실행하도록 구성되는,패션 코디네이션 제공 장치."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 기준 아이템을 결정하기 위하여,상기 사용자의 보유 아이템 중에서 상기 사용자의 코디네이션 속성 데이터를 기반으로 상기 기준 아이템을 선택하는 제 1 명령;상기 사용자의 미보유 아이템 중에서 상기 사용자의 코디네이션 속성 데이터를 기반으로 상기 기준 아이템을 선택하는 제 2 명령, 및상기 서비스 요청과 연계하여 상기 단말로부터 수신한 입력 아이템을 상기 기준 아이템으로 선택하는 제 3 명령중 적어도 하나를 실행하도록 구성되는,공개특허 10-2024-0173784-3-패션 코디네이션 제공 장치."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 서비스 응답을 생성하기 위하여,상기 스코어를 기반으로 상기 복수의 후보 아이템 조합 중 적어도 일부를 상기 사용자를 위한 패션 코디네이션으로 결정하도록 구성되는,패션 코디네이션 제공 장치."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 서비스 응답을 생성하기 위하여,상기 스코어를 기반으로 상기 기준 아이템과 상기 사용자의 가상 옷장 간의 매칭도를 결정하고,상기 매칭도를 기반으로 상기 기준 아이템을 상기 사용자에게 추천하도록 구성되는,패션 코디네이션 제공 장치."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서,상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금,상기 통신부를 통해 상기 사용자의 단말로부터 수신한 상기 패션 코디네이션에 대한 사용자 피드백을 기반으로상기 패션 코디네이션을 변경하도록 구성되고,상기 사용자 피드백은 아이템 교체, 아이템 추가, 아이템 제외 및 아이템 속성 변경 중 적어도 하나를포함하는,패션 코디네이션 제공 장치."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 2 항에 있어서,상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금,상기 서비스 응답에 대한 사용자 피드백을 기반으로 상기 복수의 후보 아이템 조합의 각각에 대한 상기 사용자의 선호도를 결정하고,상기 사용자 피드백을 기반으로 상기 사용자별 코디네이션 추천 모델 및 상기 아이템 조합 생성 모델 중 적어도하나를 훈련하도록 구성되는,패션 코디네이션 제공 장치."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2024-0173784-4-프로세서를 포함한 패션 코디네이션 제공 장치에 의해 실행되는 인공지능 기반 패션 코디네이션 제공 방법으로서,사용자의 단말로부터 수신된 서비스 요청 또는 기 저장된 사용자 코디네이션 속성 데이터에 따라 상기 사용자를위한 패션 코디네이션 서비스와 연계된 기준 아이템을 결정하는 단계;상기 기준 아이템 또는 상기 사용자의 코디네이션 속성 데이터 중 적어도 하나를 기반으로 상기 사용자의 가상옷장에 저장된 아이템 중 적어도 하나를 포함하는 복수의 후보 아이템 조합을 생성하는 단계;각 후보 아이템 조합을 입력으로 하여 상기 사용자의 코디네이션 속성에 대한 각 후보 아이템 조합의 스코어를출력하는 인공 지능 기반 사용자별 코디네이션 추천 모델을 실행하는 단계; 및상기 각 후보 아이템 조합의 스코어를 기반으로 상기 패션 코디네이션 서비스와 연계된 서비스 응답을 생성하는단계를 포함하는,패션 코디네이션 제공 방법."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 후보 아이템 조합을 생성하는 단계는,상기 기준 아이템 또는 상기 사용자의 코디네이션 속성 데이터 중 적어도 하나를 입력으로 하여 상기 복수의 후보 아이템 조합을 출력하는 인공 지능 기반 아이템 조합 생성 모델을 실행하는 단계를 포함하는,패션 코디네이션 제공 방법."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 기준 아이템을 결정하는 단계는,상기 사용자의 보유 아이템 중에서 상기 사용자의 코디네이션 속성 데이터를 기반으로 상기 기준 아이템을 선택하는 단계;상기 사용자의 미보유 아이템 중에서 상기 사용자의 코디네이션 속성 데이터를 기반으로 상기 기준 아이템을 선택하는 단계; 및상기 서비스 요청과 연계하여 상기 단말로부터 수신한 입력 아이템을 상기 기준 아이템으로 선택하는 단계 중적어도 하나를 포함하는,패션 코디네이션 제공 방법."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서,상기 서비스 응답을 생성하는 단계는,상기 스코어를 기반으로 상기 복수의 후보 아이템 조합 중 적어도 일부를 상기 사용자를 위한 패션 코디네이션으로 결정하는 단계를 포함하는,패션 코디네이션 제공 방법."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2024-0173784-5-제 8 항에 있어서,상기 서비스 응답을 생성하는 단계는,상기 스코어를 기반으로 상기 기준 아이템과 상기 사용자의 가상 옷장 간의 매칭도를 결정하는 단계; 및상기 매칭도를 기반으로 상기 기준 아이템을 상기 사용자에게 추천하는 단계를 포함하는,패션 코디네이션 제공 방법."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 8 항에 있어서,상기 사용자의 단말로부터 수신한 상기 패션 코디네이션에 대한 사용자 피드백을 기반으로 상기 패션 코디네이션을 변경하는 단계를 더 포함하고,상기 사용자 피드백은 아이템 교체, 아이템 추가, 아이템 제외 및 아이템 속성 변경 중 적어도 하나를포함하는,패션 코디네이션 제공 방법."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9 항에 있어서,상시 서비스 응답에 대한 사용자 피드백을 기반으로 상기 복수의 후보 아이템 조합의 각각에 대한 상기 사용자의 선호도를 결정하는 단계; 및상기 사용자 피드백을 기반으로 상기 사용자별 코디네이션 추천 모델 및 상기 아이템 조합 생성 모델 중 적어도하나를 훈련하는 단계를 더 포함하는,패션 코디네이션 제공 방법."}
{"patent_id": "10-2023-0072731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "프로세서에 의해 제 8 항 내지 제 14 항 중 어느 한 항에 따른 패션 코디네이션 제공 방법을 실행하도록 구성된적어도 하나의 명령을 포함한 컴퓨터 프로그램."}
{"patent_id": "10-2023-0072731", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기반 패션 코디네이션 제공 장치 및 방법이 제공된다. 실시예에 의하면, 사용자 특성 및 상황 정보를 기반으로 사용자별로 학습된 아이템 조합 생성 모델 및 코디네이션 추천 모델을 이용하여 보유한 패션 아이템 또 는 새로 구입하려는 패션 아이템에 대한 사용자의 선호 스타일에 맞는 패션 코디네이션을 제공할 수 있다."}
{"patent_id": "10-2023-0072731", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 패션 코디네이션 제공 장치 및 방법에 관한 것이다. 구체적으로 사용자 특성 및 상황 정보를 기반으로 사용자별로 학습된 코디네이션 추천 모델을 이용하여 보유한 패션 아이템 또는 새로 구입하려 는 패션 아이템에 대한 사용자의 선호 스타일에 맞는 패션 코디네이션을 제공하는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0072731", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이하에서 기술되는 내용은 본 발명의 실시예와 관련되는 배경 정보를 제공할 목적으로 기재된 것일 뿐이고, 기 술되는 내용들이 당연하게 종래기술을 구성하는 것은 아니다. 알려진 통계에 따르면 현대인들은 모두 옷을 고르기 위해 평균 하루에 15분 정도를 이용하며, 구입한 옷의 44% 는 입지 않는 옷이다. 그 만큼 사람들은 스타일링을 위해 시간과 돈 그리고 노력을 하고 있다, 하지만 급변하는 시대의 빠른 스타일의 변화에 맞추려면 바쁜 일상에서 시간을 들여 최신 트렌드를 파악해야 하 고, 트렌드에 맞게 가지고 있는 옷을 매치하거나 최신 유행 옷을 구입하려면 많은 노력과 시간, 비용이 소요되는 어려움이 있다. 최근 인공 지능을 이용하여 사용자에게 코디 스타일을 제공하는 기술이 개발되고 있지만, 사용자의 선호 스타일, 최근 트렌드, 수정 이력, 착용 이력과 같은 정보를 지속적으로 고려하지 않기 때문에 모든 사용자는 동 일한 스타일링을 제공받게 되는 한계가 있다. 선행기술문헌 (특허문헌 1) 대한민국 특허공보 10-1886161(2017.12.05) 한편, 전술한 선행기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다."}
{"patent_id": "10-2023-0072731", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해결하기 위하여 본 발명의 일 과제는 사용자 피드백에 따라 사용자의 선호 스타일을 학습하고, 상황에 어울리는 패션 코디네이션을 사용자의 취향에 맞게 제공하는 것이다. 본 발명의 일 과제는 인공지능 기반 사용자별 모델을 이용하는 패션 코디네이션 제공 장치 및 방법을 제안하는 것이다. 본 발명의 목적은 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발명 의 목적 및 장점들은 청구범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2023-0072731", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예의 일 측면은, 인공 지능 기반 패션 코디네이션 제공 장치로서, 적어도 하나의 단말과 통신하기 위한 통 신부; 적어도 하나의 명령을 저장하는 메모리; 및 프로세서를 포함하고, 상기 적어도 하나의 명령은 상기 프로 세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 통신부를 통해 사용자의 단말로부터 수신된 서비스 요청 또는 기 저장된 사용자 코디네이션 속성 데이터를 기반으로 상기 사용자를 위한 패션 코디네이션 서비스와 연계 된 기준 아이템을 결정하고, 상기 기준 아이템 또는 상기 사용자의 코디네이션 속성 데이터 중 적어도 하나를 기반으로 상기 사용자의 가상 옷장에 저장된 아이템 중 적어도 하나를 포함하는 복수의 후보 아이템 조합을 생 성하고, 각 후보 아이템 조합을 입력으로 하여 상기 사용자의 코디네이션 속성에 대한 각 후보 아이템 조합의 스코어를 출력하는 인공 지능 기반 사용자별 코디네이션 추천 모델을 실행하고, 상기 각 후보 아이템 조합의 스 코어를 기반으로 상기 패션 코디네이션 서비스와 연계된 서비스 응답을 생성하도록 구성되는, 패션 코디네이션 제공 장치를 제공한다. 상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 후보 아이템 조합을 생성하기 위하여, 상기 기준 아이템 또는 상기 사용자의 코디네이션 속성 데이터 중 적어도 하나를 입력으로 하 여 상기 복수의 후보 아이템 조합을 출력하는 인공 지능 기반 아이템 조합 생성 모델을 실행하도록 구성될 수 있다. 상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 기준 아이템을 결정 하기 위하여, 상기 사용자의 보유 아이템 중에서 상기 사용자의 코디네이션 속성 데이터를 기반으로 상기 기준 아이템을 선택하는 제 1 명령; 상기 사용자의 미보유 아이템 중에서 상기 사용자의 코디네이션 속성 데이터를 기반으로 상기 기준 아이템을 선택하는 제 2 명령, 및 상기 서비스 요청과 연계하여 상기 단말로부터 수신한 입 력 아이템을 상기 기준 아이템으로 선택하는 제 3 명령 중 적어도 하나를 실행하도록 구성될 수 있다. 상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 서비스 응답을 생성 하기 위하여, 상기 스코어를 기반으로 상기 복수의 후보 아이템 조합 중 적어도 일부를 상기 사용자를 위한 패 션 코디네이션으로 결정하도록 구성될 수 있다. 상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 서비스 응답을 생성 하기 위하여, 상기 스코어를 기반으로 상기 기준 아이템과 상기 사용자의 가상 옷장 간의 매칭도를 결정하고, 상기 매칭도를 기반으로 상기 기준 아이템을 상기 사용자에게 추천하도록 구성될 수 있다.상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 통신부를 통해 상기 사용자의 단말로부터 수신한 상기 패션 코디네이션에 대한 사용자 피드백을 기반으로 상기 패션 코디네이션을 변경하도록 구성될 수 있다. 상기 사용자 피드백은 아이템 교체, 아이템 추가, 아이템 제외 및 아이템 속성 변경 중 적어도 하나를 포함할 수 있다. 상기 적어도 하나의 명령은 상기 프로세서에 의해 실행될 때 상기 프로세서로 하여금, 상기 사용자 피드백을 기 반으로 상기 복수의 후보 아이템 조합의 각각에 대한 상기 사용자의 선호도를 결정하고, 상기 사용자 피드백을 기반으로 상기 사용자별 코디네이션 추천 모델 및 상기 아이템 조합 생성 모델 중 적어도 하나를 훈련하도록 구 성될 수 있다. 실시예의 일 측면은 프로세서를 포함한 패션 코디네이션 제공 장치에 의해 실행되는 인공지능 기반 패션 코디네 이션 제공 방법으로서, 사용자의 단말로부터 수신된 서비스 요청 또는 기 저장된 사용자 코디네이션 속성 데이 터에 따라 상기 사용자를 위한 패션 코디네이션 서비스와 연계된 기준 아이템을 결정하는 단계; 상기 기준 아이 템 또는 상기 사용자의 코디네이션 속성 데이터 중 적어도 하나를 기반으로 상기 사용자의 가상 옷장에 저장된 아이템 중 적어도 하나를 포함하는 복수의 후보 아이템 조합을 생성하는 단계; 각 후보 아이템 조합을 입력으로 하여 상기 사용자의 코디네이션 속성에 대한 각 후보 아이템 조합의 스코어를 출력하는 인공 지능 기반 사용자 별 코디네이션 추천 모델을 실행하는 단계; 및 상기 각 후보 아이템 조합의 스코어를 기반으로 상기 패션 코디 네이션 서비스와 연계된 서비스 응답을 생성하는 단계를 포함하는, 패션 코디네이션 제공 방법을 제공한다. 상기 후보 아이템 조합을 생성하는 단계는, 상기 기준 아이템 또는 상기 사용자의 코디네이션 속성 데이터 중 적어도 하나를 입력으로 하여 상기 복수의 후보 아이템 조합을 출력하는 인공 지능 기반 아이템 조합 생성 모델 을 실행하는 단계를 포함할 수 있다. 상기 기준 아이템을 결정하는 단계는, 상기 사용자의 보유 아이템 중에서 상기 사용자의 코디네이션 속성 데이 터를 기반으로 상기 기준 아이템을 선택하는 단계; 상기 사용자 미보유 아이템 중에서 상기 사용자의 코디네이 션 속성 데이터를 기반으로 상기 기준 아이템을 선택하는 단계; 및 상기 서비스 요청과 연계하여 상기 단말로부터 수신한 입력 아이템을 상기 기준 아이템으로 선택하는 단계 중 적어도 하나를 포함할 수 있다. 상기 서비스 응답을 생성하는 단계는, 상기 스코어를 기반으로 상기 복수의 후보 아이템 조합 중 적어도 일부를 상기 사용자를 위한 패션 코디네이션으로 결정하는 단계를 포함할 수 있다. 상기 서비스 응답을 생성하는 단계는, 상기 스코어를 기반으로 상기 기준 아이템과 상기 사용자의 가상 옷장 간 의 매칭도를 결정하는 단계; 및 상기 매칭도를 기반으로 상기 기준 아이템을 상기 사용자에게 추천하는 단계를 포함할 수 있다. 상기 사용자의 단말로부터 수신한 상기 패션 코디네이션에 대한 사용자 피드백을 기반으로 상기 패션 코디네이 션을 변경하는 단계를 더 포함할 수 있다. 상기 사용자 피드백은 아이템 교체, 아이템 추가, 아이템 제외 및 아이템 속성 변경 중 적어도 하나를 포함할 수 있다. 상기 사용자 피드백을 기반으로 상기 복수의 후보 아이템 조합의 각각에 대한 상기 사용자의 선호도를 결정하는 단계; 및 상기 사용자 피드백을 기반으로 상기 사용자별 코디네이션 추천 모델 및 상기 아이템 조합 생성 모델 중 적어도 하나를 훈련하는 단계를 더 포함할 수 있다. 실시예의 일 측면은, 프로세서에 의해 제 8 항 내지 제 14 항 중 어느 한 항에 따른 패션 코디네이션 제공 방법 을 실행하도록 구성된 적어도 하나의 명령을 포함한 컴퓨터 프로그램을 제공한다. 전술한 것 외의 다른 측면, 특징, 및 이점이 이하의 도면, 청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2023-0072731", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 의하면, 사용자는 자신의 옷을 가상 옷장에 등록하고 보유한 옷에 대한 정보를 손쉽게 관리 할수 있다. 실시예에 의하면, 주어진 상황에 적절하고, 사용자의 취향에 맞는 코디를 제안하여 사용자는 매일 옷을 입기 위 해 고민하는 시간을 줄일 수 있다. 실시예에 의하면, 새로운 옷을 구입하기 전에 최신 스타일과 어울리는 옷을 조사하고 보유한 옷과 어울리는 옷 을 사기 위해 고민하는 시간을 절약할 수 있다. 실시예에 의하면, 사용자에게 어울리는 옷 및/또는 사용자에게 부족한 옷을 추천하여 여러 옷 브랜드 및 쇼핑몰 의 구입 및 인지도를 올릴 수 있다."}
{"patent_id": "10-2023-0072731", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0072731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 여러 가지 상이한 형태로 구현될 수 있으며, 여기에서 설명하는 실시예들에 한정되지 않는다. 이하 실시예에서는 본 발명을 명확하게 설명하기 위해서 설명과 직접적인 관계가 없는 부분을 생략하지만, 본 발명의 사상이 적용된 장치 또는 시스템을 구현함에 있어서, 이와 같이 생략된 구성이 불필요함을 의미하는 것은 아니 다. 아울러, 명세서 전체를 통하여 동일 또는 유사한 구성요소에 대해서는 동일한 참조번호를 사용한다. 이하의 설명에서 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는 데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안되며, 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목 적으로만 사용된다. 또한, 이하의 설명에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표 현을 포함한다. 이하의 설명에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요 소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 도 1은 실시예에 따른 인공지능 기반 패션 코디네이션 제공 동작 환경을 개략적으로 도시한다. 인공지능 기반 패션 코디네이션 제공 시스템은 사용자의 단말과 패션 코디네이션 제공 장치를 포함한다. 패션 코디네이션 제공 장치는 패션 코디네이션 서비스를 제공하는 전자 장치로서, 적어도 하나의 단말 과 서버-클라이언트 구조로 작동가능한 컴퓨팅 장치이다. 패션 코디네이션 제공 장치에 대하여는 도 2를 참조하여 후술한다. 사용자는 단말 설치된 어플리케이션 프로그램을 실행하여 패션 코디네이션 제공 장치가 제공하는 서 비스를 이용할 수 있다. 단말은 컴퓨팅 기능을 수행할 수 있는 전자 장치로서, 사용자가 조작하는 데스크탑 컴퓨터, 스마트폰, 노 트북, 태블릿 PC, 스마트 TV, 휴대폰, PDA(personal digital assistant), 랩톱, 미디어 플레이어, 마이크로 서 버, GPS(global positioning system) 장치, 전자책 단말기, 디지털방송용 단말기, 네비게이션, 키오스크, MP3플레이어, 디지털 카메라, 가전기기 및 기타 모바일 또는 비모바일 컴퓨팅 장치, 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 기기일 수 있으나, 이에 제한되지 않는다. 네트워크(NETWORK)는 단말과 패션 코디네이션 제공 장치를 연결한다. 이러한 네트워크는 예컨대 LANs(local area networks), WANs(wide area networks), MANs(metropolitan area networks), ISDNs(integrated service digital networks) 등의 유선 네트워크나, 무선 LANs, CDMA, 블루투스, 위성 통신 등의 무선 네트워크를 망라할 수 있으나, 이에 한정되는 것은 아니다. 또한 네트워크는 근거리 통신 및/또는 원 거리 통신을 이용하여 정보를 송수신할 수 있다. 여기서 근거리 통신은 블루투스(bluetooth), RFID(radio frequency identification), 적외선 통신(IrDA, infrared data association), UWB(ultra-wideband), ZigBee, Wi-Fi (wireless fidelity) 기술을 포함할 수 있고, 원거리 통신은 CDMA(code division multiple access), FDMA(frequency division multiple access), TDMA(time division multiple access), OFDMA(orthogonal frequency division multiple access), SC-FDMA(single carrier frequency division multiple access) 기술을 포함할 수 있다. 실시예에 따른 인공지능 기반 패션 코디네이션 제공 시스템은 패션 코디네이션 제공 장치와 적어도 하나의 단말을 포함한다. 단말은 네트워크(NEWORK)를 통해 패션 코디네이션 제공 장치와 통신하 고, 패션 코디네이션 제공 장치는 단말의 서비스 요청 또는 사용자의 서비스 설정에 따라 실시예에 따른 패션 코디네이션 서비스를 사용자에게 제공한다. 여기서 패션 코디네이션 서비스는 예를 들어 사용자별 가상 옷장, 코디 리포트, 의류 추천 및 옷장 매칭 서비스 를 포함할 수 있다. 가상 옷장은 사용자가 단말을 통해 등록한 아이템을 분석하여 의류 정보(예를 들어, 색상, 스타일, 무늬, 재질, 계절, 브랜드, 가격 등)를 아이템별로 목록화한 데이터베이스로서, 패션 코디네이션 제공 장치의 메 모리 및/또는 단말의 메모리에 저장될 수 있다. 가상 옷장은 사용자 보유 아이템 리스트, 사용자가 현재는 보유하고 있지 않으나 보유를 희망하는 위시 리스트 및 최신 트렌드에 따른 추천 아이템 리스트를 포함할 수 있다. 코디 리포트는 실시예에 따른 패션 코디네이션 제공 방법에 따라 소정의 주기(예를 들어 매일)로 사용자가 설정 한 시간에 사용자의 가상 옷장, 날씨 정보, 상황 정보 및 사용자 정보(예를 들어 선호 스타일, 학습 정보, 신체 정보, 최근 서비스 이용자 선호 스타일, 최근 의류 검색 상위 검색 키워드 등)를 이용하여 사용자에게 적합한 스타일을 추천한다. 예를 들어 코디 리포트는 매일 아침에 사용자에게 그 날의 코디를 추천하는 일일 코디로 기 능할 수 있다. 예를 들어 코디 리포트는 사용자가 제공한 데이터 성향, 스타일, 장소, 속성 등을 반영하여 사용자가 보유한 옷 에서 임의의 옷을 선정하고, 선정된 옷과 사용자가 제공한 데이터의 정보를 이용하여 사용자가 선호하는 스타일 의 옷(후술할 기준 아이템)을 선정하고, 사용자에게 선정된 기준 아이템과 복수 개의 아이템 조합을 생성하고, 각 조합에 대한 스코어를 사용자에게 제공한다. 의류 추천은, 사용자에게 특정 기간별로 임의의 옷을 추천하는 기능으로(광고) 일일 코디 추천과 달리 사용자의 데이터를 기반으로 사용자가 보유하지 않은 옷에서 기준 아이템을 선정하고, 해당 기준 아이템을 이용하여 사용 자가 보유한 옷들로 조합을 생성하고, 각 조합에 대한 스코어를 제공한다.옷장 매칭은 사용자가 입력 또는 지정 한 기준 아이템을 기준으로 사용자가 보유한 옷들로 조합을 생성하여, 사용자의 데이터를 기준으로 스코어(ex. 활용도 점수)를 제공한다. 옷장 매칭은 사용자가 입력한 아이템(예를 들어 사용자가 구입을 고려 중인 미보유 옷)에 대한 조합 및 활용도 점수를 제공한다. 예를 들어 사용자의 가상 옷장 및/또는 코디 이력 정보를 기반으로 사용자가 해당 아이템을 구매할 경우 현재 보유 중인 아이템과 조합가능한 예상 코디를 복수 개(예를 들어 3개) 제시하고, 활용도 점수 를 제공할 수 있다. 실시예에 따른 인공지능 기반 패션 코디네이션 제공 시스템은 사용자 피드백에서 사용자가 선택한 아이 템 또는 코디네이션과 사용자 피드백에 따라 수정된 이력을 저장하고, 후술할 인공지능 모델의 지속 강화 학습 을 통해 사용자를 위한 AI 코디네이터를 만들수 있다. 도 2는 실시예에 따른 인공지능 기반 패션 코디네이션 제공 장치의 블록도이다. 실시예에 따른 패션 코디네이션 제공 장치는 프로세서, 메모리 및 통신부를 포함한다. 프로세서는 메모리와 물리적/논리적으로 연결되고, 메모리에 저장된 명령/데이터를 읽기/쓰기 가능하고, 해당 명령을 실행할 수 있다. 프로세서는 일종의 중앙처리장치로서, 메모리에 저장된 하나 이상의 명령어를 실행하여 실시예에 따 른 패션 코디네이션 제공 방법을 실행할 수 있다. 프로세서는 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 프로세서는 예를 들어 프 로그램 내에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드 웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로서, 마이크로프로세서(microprocessor), 중앙처리장치 (central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망 라할 수 있으나, 이에 한정되는 것은 아니다. 프로세서는 적어도 하나의 프로세서를 포함할 수 있다. 프로세서는 복수의 컴퓨팅 장치에 배치된 적 어도 하나의 프로세서를 포함할 수 있다. 메모리는 적어도 하나의 명령을 포함하는 프로그램을 저장할 수 있다. 프로세서는 메모리에 저 장된 프로그램, 명령어들에 기반하여 실시예에 패션 코디네이션 제공 방법을 실행할 수 있다. 메모리는 내장 메모리 및/또는 외장 메모리를 포함할 수 있으며, DRAM, SRAM, 또는 SDRAM 등과 같은 휘발 성 메모리, OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, NAND 플래시 메 모리, 또는 NOR 플래시 메모리 등과 같은 비휘발성 메모리, SSD, CF(compact flash) 카드, SD 카드, Micro-SD 카드, Mini-SD 카드, Xd 카드, 또는 메모리 스틱(memory stick) 등과 같은 플래시 드라이브, 또는 HDD와 같은 저장 장치를 포함할 수 있다. 메모리는 자기 저장 매체(magnetic storage media) 또는 플래시 저장 매체 (flash storage media)를 포함할 수 있으나, 이에 한정되는 것은 아니다. 통신부는 패션 코디네이션 제공 장치와 통신 모듈을 구비한 단말 사이의 통신을 가능하게 하는 하나 이상의 유무선 통신 모듈을 포함할 수 있다. 통신부는 유선 통신 모듈, 이동 통신 모듈 및 근거리 통 신 모듈 등을 포함할 수 있다. 프로세서는 학습 데이터를 이용하여 인공 신경망으로 구성된 사용자별 아이템 조합 생성 모델 및/또는 코 디네이션 추천 모델을 학습하기 위한 러닝 프로세서를 포함할 수 있다. 이 경우 러닝 프로세서는 인공 신경망을 반복적으로 학습시킴으로써, 인공 신경망의 최적화된 모델 파라미터들을 결정하여 사용자별 아이템 조합 생성 생성 모델 및 코디네이션 추천 모델을 생성할 수 있다. 인공 신경망은, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network), MLP(Multilayer Perceptron), CNN(Convolutional Neural Network)와 같은 방식의 네트 워크 모델들을 포함할 수 있으나, 이에 한정되지 않는다. 실시예에 따른 인공지능 기반 패션 코디네이션 제공 장치는 고객이 선호하는 스타일 정보와 날씨, 활동 이 벤트를 조합하여 사용자를 위한 패션 코디네이션을 추천할수 있다. 패션 코디네이션 제공 장치는 소정의 주기(예들 들어 매일)로, 사용자가 설정한 시간(예를 들어 아침 6시, 출근 1시간 전)에 사용자에게 복수 개(예 를 들어 3개)의 코디네이션을 추천할 수 있다(코디 리포트 기능). 패션 코디네이션 제공 장치는 사용자가 새로 구입하고자 하는 옷을 촬영 또는 입력할 경우 고객이 보유한 옷을 기반으로 조합 및 활용성 정보를 제공할 수 있다(옷장 매칭 기능). 실시예에 따른 패션 코디네이션 제공 장치는 패션 코디네이션 제공 방법을 실행하여 이와 같은 기능을 구 현할 수 있다. 패션 코디네이션 제공 장치는 적어도 하나의 단말과 통신하기 위한 통신부, 적어도 하나의 명령 을 저장하는 메모리 및 프로세서를 포함하고, 메모리에 저장된 적어도 하나의 명령은 프로세서 에 의해 실행될 때 프로세서로 하여금, 통신부를 통해 사용자의 단말로부터 수신된 서비 스 요청 또는 기 저장된 사용자 코디네이션 속성 데이터를 기반으로 사용자를 위한 패션 코디네이션 서비스와 연계된 기준 아이템을 결정하고, 결정된 기준 아이템 또는 사용자의 코디네이션 속성 데이터를 기반으로 사용자의 가상 옷장에 저장된 아이템 중 적어도 하나를 포함하는 복수의 후보 아이템 조합을 생성하고, 각 후보 아이 템 조합을 입력으로 하여 사용자의 코디네이션 속성에 대한 각 후보 아이템 조합의 스코어를 출력하는 인공 지 능 기반 사용자별 코디네이션 추천 모델(도 4를 참조하여 후술할 M2)을 실행하고, 각 후보 아이템 조합의 스코 어를 기반으로 패션 코디네이션 서비스와 연계된 서비스 응답을 생성하도록 구성될 수 있다.메모리에 저장 된 적어도 하나의 명령은 프로세서에 의해 실행될 때 프로세서로 하여금, 후보 아이템 조합을 생성하 기 위하여, 기준 아이템 또는 사용자의 코디네이션 속성 데이터 중 적어도 하나를 입력으로 하여 복수의 후보 아이템 조합을 출력하는 인공 지능 기반 아이템 조합 생성 모델(도 4를 참조하여 후술할 M1)을 실행하도록 구성 될 수 있다.여기서 기준 아이템은 사용자 보유 아이템 또는 사용자 미보유 아이템 중에서 사용자의 선택 또는 랜덤(random) 선택된 적어도 하나의 아이템을 포함할 수 있다. 여기서 기준 아이템은 사용자 보유 아이템 또는 사용자 미보유 아이템 중에서 사용자가 선택한 또는 랜덤하게 선택된 적어도 하나의 아이템을 포함할 수 있다. 예를 들어 기준 아이템은 사용자의 속성, 특성을 기준으로 결 정된 아이템으로서, 사용자 보유 아이템 또는 미 보유 아이템을 포함할 수 있다. 메모리에 저장된 적어도 하나의 명령은 프로세서에 의해 실행될 때 프로세서로 하여금, 기준 아 이템을 결정하기 위하여, 사용자의 보유 아이템 중에서 사용자의 코디네이션 속성 데이터를 기반으로 기준 아이 템을 선택하는 제 1 명령, 사용자의 미보유 아이템 중에서 사용자의 코디네이션 속성 데이터를 기반으로 기준 아이템을 선택하는 제 2 명령, 및 패션 코디네이션 서비스 요청과 연계하여 단말로부터 수신한 입력 아이 템을 기준 아이템으로 선택하는 제 3 명령 중 적어도 하나를 실행하도록 구성될 수 있다.메모리에 저장된 적어도 하나의 명령은 프로세서에 의해 실행될 때 프로세서로 하여금, 서비스 응답을 생성하기 위하 여, 각 후보 아이템에 대하여 결정된 스코어를 기반으로 복수의 후보 아이템 조합 중 적어도 일부를 사용자를 위한 패션 코디네이션으로 결정하도록 구성될 수 있다. 메모리에 저장된 적어도 하나의 명령은 프로세서에 의해 실행될 때 프로세서로 하여금, 서비스 응답을 생성하기 위하여, 각 후보 아이템 조합에 대하여 결정된 스코어(예를 들어 후술할 활용도 점수)를 기반 으로 기준 아이템과 사용자의 가상 옷장 간의 매칭도를 결정하고, 결정된 매칭도를 기반으로 기준 아이템을 사 용자에게 추천하도록 구성될 수 있다. 메모리에 저장된 적어도 하나의 명령은 프로세서에 의해 실행될 때 프로세서로 하여금, 통신부 를 통해 사용자의 단말로부터 수신한 사용자 피드백을 기반으로 패션 코디네이션을 변경하도록 구성 될 수 있다. 여기서 사용자 피드백은 아이템 교체, 아이템 추가 및 아이템 제외 중 적어도 하나를 포함할 수 있다. 여기서 코디네이션 속성 데이터는 사용자 정보(ex. 키, 몸무게, 피부색, 신발 치수, 연령, 성별, 선호 스타일, 선호 색상, 선호 브랜드, 유행 민감도 등), 가상 옷장 정보(ex. 보유 아이템 유형, 수, 색상, 스타일, 브랜드 등에 대한 통계 정보, 변화 추이, 경향 등), 코디네이션 상황 정보(ex. 날씨, 장소, 특별한 행사, 기념일, 모임, 유행 스타일, 유행 아이템 등), 사용자별 코디네이션 이력 정보 및 패션 코디네이션 장치가 제공한 코디네이션에 대한 사용자 피드백을 포함할 수 있다.메모리에 저장된 적어도 하나의 명령은 프로세서(11 0)에 의해 실행될 때 프로세서로 하여금, 통신부를 통해 사용자 단말로부터 수신한 사용자 피드백을 기반으로 사용자별 코디네이션 추천 모델(M2) 및 아이템 조합 생성 모델(M1) 중 적어도 하나를 훈련하도록 구성 될 수 있다. 메모리에 저장된 적어도 하나의 명령은 프로세서에 의해 실행될 때 프로세서로 하여금, 사용자 로부터 수신한 사용자 피드백을 기반으로 복수의 후보 아이템 조합의 각각에 대한 사용자의 선호도를 결정하도 록 구성될 수 있다. 이하에서 도 3 내지 도 7을 참조하여 패션 코디네이션 제공 장치의 패션 코디네이션 제공 방법 실행 과정 을 구체적으로 살펴본다. 도 3은 실시예에 따른 패션 코디네이션 제공 방법의 흐름도이다. 실시예에 따른 패션 코디네이션 제공 방법은 사용자의 단말로부터 수신된 서비스 요청 또는 기 저장된 사 용자 코디네이션 속성 데이터에 따라 사용자를 위한 패션 코디네이션 서비스와 연계된 기준 아이템을 결정하는 단계(S1), 기준 아이템 또는 사용자의 코디네이션 속성 데이터 중 적어도 하나를 기반으로 사용자의 가상 옷장 에 저장된 아이템 중 적어도 하나를 포함하는 복수의 후보 아이템 조합을 생성하는 단계(S2), 각 후보 아이템 조합을 입력으로 하여 사용자의 코디네이션 속성에 대한 각 후보 아이템 조합의 스코어를 출력하는 인공 지능기반 사용자별 코디네이션 추천 모델(M2)을 실행하는 단계(S3) 및 결정된 각 후보 아이템 조합의 스코어를 기반 으로 패션 코디네이션 서비스와 연계된 서비스 응답을 생성하는 단계(S4)를 포함한다. 단계(S1)에서 프로세서는 사용자의 단말로부터 수신된 서비스 요청 또는 기 저장된 사용자 코디네이 션 속성 데이터에 따라 사용자를 위한 패션 코디네이션 서비스와 연계된 기준 아이템을 결정한다. 여기서 기준 아이템은 단계(S2)에서 후보 아이템 조합 생성의 기준이 되는 적어도 하나의 패션 아이템으로서, 프로세서는 기준 아이템을 기반으로 후술할 후보 아이템 조합 생성 모델(M1)의 입력 데이터(DTA_IN)를 생 성한다. 단계(S1)는 프로세서에 의해 사용자의 보유 아이템 중에서 사용자의 코디네이션 속성 데이터를 기반으로 기준 아이템을 선택하는 단계(즉, 제 1 명령 실행 단계), 사용자 미보유 아이템 중에서 사용자의 코디네이션 속 성 데이터를 기반으로 기준 아이템을 선택하는 단계(즉, 제 2 명령 실행 단계), 및 서비스 요청과 연계하여 단 말로부터 수신한 입력 아이템을 기준 아이템으로 선택하는 단계(즉, 제 3 명령 실행) 중 적어도 하나를 포 함할 수 있다. 예를 들어, 제 1 명령 실행 단계에 의해, 일일 코디 서비스를 위한 기준 아이템을 결정하고, 제 2 명령 실행 단 계에 의해, 의류 추천 서비스를 위한 기준 아이템을 결정하고, 제 3 명령 실행 단계에 의해, 옷장 매칭 서비스 를 위한 기준 아이템을 결정할 수 있다. 단계(S2)는 프로세서에 의해 사용자의 단말로부터 수신된 서비스 요청을 기반으로 사용자의 가상 옷 장에 저장된 아이템 중 적어도 하나를 포함하는 복수의 후보 아이템 조합을 생성한다. 단계(S2)는 프로세서에 의해 기준 아이템 또는 사용자의 코디네이션 속성 데이터 중 적어도 하나를 기반으 로 후보 아이템 조합을 출력하는 인공 지능 기반 아이템 조합 생성 모델(M1)을 실행하는 단계를 포함한다. 단계(S2)에 대하여는 도 6을 참조하여 후술한다. 단계(S3)은 프로세서에 의해 각 후보 아이템 조합을 입력받고 사용자의 코디네이션 속성에 대한 각 후보 아이템 조합의 스코어를 출력하는 인공 지능 기반 사용자별 코디네이션 추천 모델(M2)을 실행한다. 여기서 코디네이션 속성 데이터는 사용자 정보(ex. 키, 몸무게, 피부색, 신발 치수, 연령, 성별, 선호 스타일, 선호 색상, 선호 브랜드, 유행 민감도 등), 가상 옷장 정보(ex. 보유 아이템 유형, 수, 색상, 스타일, 브랜드 등에 대한 통계 정보, 변화 추이, 경향 등), 코디네이션 상황 정보(ex. 날씨, 장소, 시간, 계정, 특별한 행사, 기념일, 모임, 유행 스타일, 유행 아이템 등), 사용자별 코디네이션 이력 정보 및 패션 코디네이션 장치 가 제공한 코디네이션에 대한 사용자 피드백을 포함할 수 있다. 예를 들어 코디네이션 상황 정보는 사용자의 복장이 갖추어야할 조건으로서, 사용자가 방문(또는 참석)할 장소 정보(예를 들어 해변가, 장례식, 결혼식 등), 시간 정보(예를 들어 아침, 오후 3시, 저녁 등), 계절 정보를 포 함할 수 있다. 예를 들어, 사용자별 코디네이션 이력 정보는 코디네이션 상황에 따라 사용자에게 추천한 패션 코디네이션 정보, 사용자가 채택한 패션 코디네이션 정보 및 사용자가 피드백으로 변경한 패션 코디네이션 정보를 포함한다. 사용자별 코디네이션 이력 정보는 메모리에 사용자 로그로서 저장될 수 있다. 예를 들어, 사용자 피드백은 패션 코디네이션 장치가 사용자에게 제안한 패션 코디네이션에 대한 사용자의 좋아요 또는 싫어요와 같은 선호 여부 정보, 사용자가 코디네이션에 포함된 아이템을 교체, 추가 및 제외 중 적 어도 하나를 지시한 정보, 사용자가 코디네이션에 포함된 아이템의 속성(예를 들어, 색상, 사이즈 등)을 변경한 내역 등을 포함한다. 단계(S3)에 대하여는 도 5 내지 도 7을 참조하여 후술한다. 단계(S4)는 프로세서에 의해 단계(S3)에서 결정된 각 후보 아이템 조합의 스코어를 기반으로 패션 코디네 이션 서비스와 연계된 서비스 응답을 생성한다. 일 예에서 단계(S4)는 프로세서에 의해 단계(S3)에서 결정된 스코어를 기반으로 복수의 후보 아이템 조합 중 적어도 일부를 사용자를 위한 패션 코디네이션으로 결정하는 단계를 포함할 수 있다. 예를 들어, 패션 코디네이션 제공 장치는 단계(S4)에서 결정된 적어도 하나의 패션 코디네이션을 서비스 응답에 포함하여 단말로 전송할 수 있다(ex. 코디 리포트 또는 의류 추천 서비스). 추가로 스코어 및/또는스코어에 따른 순위를 함께 전송할 수 있다. 예를 들어 스코어가 가장 높은 아이템 조합을 패션 코디네이션으로 결정할 수 있다. 예를 들어 스코어 내림차순 으로 상위 몇 개(ex. 3개)를 패션 코디네이션으로 결정할 수 있다. 단계(S4)는 프로세서에 의해 단계(S3)에서 결정된 스코어를 기반으로 기준 아이템과 사용자의 가상 옷장 간의 매칭도를 결정하는 단계 및 결정된 매칭도를 기반으로 기준 아이템을 사용자에게 추천하는 단계를 포함할 수 있다. 여기서 기준 아이템은 사용자가 서비스 요청 시 제공한 입력 아이템을 포함할 수 있다. 예를 들어 사용자는 단 말에서 유행 아이템 또는 미보유 아이템 중 구매를 고려 중인 아이템을 입력 아이템으로 설정하여 서비스 요청을 패션 코디네이션 제공 장치로 전송할 수 있다. 패션 코디네이션 제공 장치는 서비스 요청을 수신하고 단계(S1)에서 입력 아이템을 기준 아이템으로 결정 하고(제 3 명령 실행 단계), 단계(S2) 내지 단계(S4)를 실행할 수 있다. 예를 들어 패션 코디네이션 제공 장치는 스코어가 높을수록 매칭도(ex. 활용도 점수)를 높게 판단할 수 있 다. 예를 들어 패션 코디네이션 제공 장치는 매칭도가 소정의 임계값 이상이면 사용자에게 기준 아이템의 구매를 추천하는 서비스 응답을 생성할 수 있다. 예를 들어 서비스 응답은 매칭도 및 추천 여부를 포함할 수 있 다. 예를 들어 서비스 응답은 기준 아이템을 활용한 적어도 하나의 아이템 조합을 포함할 수 있다. 패션 코디네이션 제공 장치는 단말로부터 서비스 요청 수신 시에 또는 소정의 사용자 설정 주기로 (ex. 매일 또는 시즌별로) 단계(S1) 내지 단계(S4)를 실행할 수 있다. 한편, 실시예에 따른 패션 코디네이션 제공 방법은 프로세서에 의해 사용자의 단말로부터 수신한 사 용자 피드백을 기반으로 패션 코디네이션을 변경하는 단계(도 7을 참조하여 단계S5)를 더 포함할 수 있다. 여기서 사용자 피드백은 아이템 교체, 아이템 추가, 아이템 제외 및 아이템 속성 변경 중 적어도 하나를 포함할 수 있다. 아이템 교체는 사용자 피드백에 따라 현재 코디의 적어도 하나의 아이템을 다른 아이템으로 대체하는 것을 의미 한다. 아이템 추가는 사용자가 선택한 아이템을 현재 코디에 추가하는 것을 의미한다. 아이템 제외는 현재 코디 에서 사용자가 선택한 아이템을 빼는 것을 의미한다. 아이템 속성 변경은 현재 코디의 아이템은 유지하고 해당 아이템의 속성(예를 들어 색상, 사이즈)을 변경하는 것을 의미한다. 예를 들어, 사용자는 보유 아이템 및 미보유 아이템 중에서 대체 아이템 또는 추가 아이템을 선택할 수 있다. 예를 들어, 프로세서는 사용자 보유 아이템, 최신 유행 미보유 아이템, 사용자 위시 리스트에 있는 아이템 중에서 이와 같은 대체 아이템 또는 추가 아이템을 사용자에게 추천할 수 있다. 도 4는 실시예에 따른 패션 코디네이션 방법의 패션 아이템 등록 과정을 예시적으로 설명하기 위한 도면이다. 도 3을 참조하여 전술한 단계(S1) 이전에 실시예에 따른 패션 코디네이션 제공 방법은 프로세서에 의해 가 상 옷장을 생성하고 패션 아이템을 등록하는 단계를 포함할 수 있다. 아이템 등록 단계는 사용자가 보유한 옷을 패션 코디네이션 제공 장치의 메모리의 사용자 가상 옷장 에 등록하는 단계이다. 이를 위하여 프로세서는 사용자가 단말에서 촬영 및/또는 전송한 사진을 통신부를 통해 수신하 고, 의류 영역 분할 모델에 의해 의류 영역을 특정하고, 불필요한 데이터를 지우고 의류 영상을 추출하고 (Crop), 의류 속성 분류 모델에 의해 의류 영상으로부터 의류 속성 정보를 분류하고, 의류 속성 정보 및 사용자 가 해당 의류에 대하여 입력한 정보(예를 들어 자동 분류된 속성를 사용자가 수정한 정보)를 저장할 수 있다. 여기서 의류 영역 분할 모델 및 의류 속성 분류 모델은 예를 들어 Ma, Yunshan, et al. \"Who, where, and what to wear? extracting fashion knowledge from social media.\" Proceedings of the 27th ACM International Conference on Multimedia. 2019.에서 제시된 모델을 이용할 수 있으며, 이에 제한되지 않고 이미지로부터 의류 속성을 추출하는 CNN 기반의 다양한 모델을 활용할 수 있다. 한편, 전술한 단계(S1) 이전에 실시예에 따른 패션 코디네이션 제공 방법은 단말로부터 사용자 선호 스타 일, 코디 리포트 설정(예를 들어 주기, 시간 등) 및/또는 사용자 신체 정보를 수신하고 메모리에 저장할 수 있다.도 5는 실시예에 따른 패션 코디네이션 제공 과정을 설명하기 위한 도면이다. 도 3을 참조하여 전술한 단계(S2)에서 프로세서는 아이템 조합 생성 모델(M1)의 입력 데이터(DTA_IN)를 구 성하고, 구성된 입력 데이터(DTA_IN)를 아이템 조합 생성 모델(M1)에 입력하고, 복수의 아이템 조합(M1_OUT)을 출력한다. 단계(S3)에서 복수의 아이템 조합(M1_OUT) 및 입력 데이터(DTA_IN)를 사용자별 코디네이션 추천 모델(M2)에 입 력하고, 아이템 조합(M1_OUT)의 스코어(M2_OUT)를 출력한다. 예를 들어 사용자별 코디네이션 추천 모델(M2)은 예를 들어 Wang, Xin, Bo Wu, and Yueqi Zhong. \"Outfit compatibility prediction and diagnosis with multi-layered comparison network.\" Proceedings of the 27th ACM International Conference on Multimedia. 2019.을 참조하여 입력된 의류 간의 호환 점수(Compatibility Score)를 출력하는 모델을 활용할 수 있다. 단계(S4)에서 스코어(M2_OUT)를 기반으로 서비스 응답을 생성한다. 추가적으로 필요 시 패션 코디네이션에 대한 사용자 피드백(U_IN)을 기반으로 패션 코디네이션을 변경할 수 있 다(도 7을 참조하여 단계 S5). 사용자 피드백(U_IN)을 기반으로 아이템 조합 생성 모델(M1) 및/또는 사용자별 코디네이션 추천 모델(M2)을 학습할 수 있다. 최종적으로 서비스 응답을 사용자에게 전송한다. 도 6은 실시예에 따른 아이템 조합 생성 모델을 도시한다. 아이템 조합 생성 모델(M1)의 입력 데이터(DTA_IN)의 크기를 (W, H, C)로 설정하고, 사용자 나이, 성별, 착용이 력, 선호스타일, 신체조건, 수정이력, 날씨, 상황 정보 및 최신 트렌드에 대한 정보를 나타내는 벡터를 입력 데 이터(DTA_IN)의 가로, 세로 방향으로 조합하여 입력 데이터(DTA_IN)를 구성할 수 있다. 추가적으로 아이템 조합 생성 모델(M1)의 입력 데이터(DTA_IN)는 도 3을 참조하여 전술한 단계(S1)에서 결정된 기준 아이템에 대한 정보(예를 들어, 기준 아이템의 이미지 정보 및/또는 특징 벡터(feature vector) 등)를 포 함할 수 있다. CNN의 합성곱(Convolution)과 풀링(Pooling) 연산을 통해 입력 데이터(DTA_IN)로부터 특징 맵(Feature Map)을 추출하고, 마지막으로 분류(Classification)하는 출력층(Output Layer)으로 전달된다. 출력층(Output Layer)은 복수의 아이템 조합(M1_OUT)을 출력한다. 출력된 복수의 아이템 조합(M1_OUT)의 각각은 사용자별 코디네이션 추천 모델(M2)에 입력되어 아이템 조합마다 스코어가 결정된다. 한편 프로세서는 사용자가 입력한 아이템(예를 들어 사용자가 구입을 고려 중인 미 보유 옷)에 대한 조합 및 활용도 점수를 제공하기 위해 아이템 조합 생성 모델(M1)을 사용할 수 있다. 예를 들어 사용자의 가상 옷장 및/또는 코디 이력 정보를 기반으로 사용자가 해당 아이템을 구매할 경우 보유 중인 아이템과 조합가능한 예상 코디를 복수 개(예를 들어 3개) 제시하고, 활용도 점수를 제공할 수 있다. 예를 들어 소정의 주기마다 이와 같 은 미 보유 옷을 포함한 조합 및 활용도 점수를 제공할 수 있다. 여기서 예상 코디는 아이템 조합 생성 모델(M1)에서 출력한 복수의 아이템 조합(M1_OUT)에 대응하고 활용도 점 수는 각 아이템 조합에 포함된 아이템의 코디 이력 정보(예를 들어 코디 횟수, 사용자 선호도 등)의 합으로 결 정될 수 있다. 도 7은 실시예에 따른 패션 코디네이션 제공 방법의 추가 흐름도이다. 실시예에 따른 패션 코디네이션 방법은 사용자 피드백을 기반으로 패션 코디네이션을 변경하는 단계(S5) 이후에 사용자 피드백을 기반으로 사용자별 코디네이션 추천 모델(M2) 또는 아이템 조합 생성 모델(M1) 중 적어도 하나 를 훈련하는 단계(S6)를 더 포함할 수 있다. 단계(S6)에서 알려진 인공신경망 학습 방법 또는 사용자 피드백 기반 강화 학습(Reinforcement Learning) 방식 으로 아이템 조합 생성 모델(M1) 및/또는 사용자별 코디네이션 추천 모델(M2)를 훈련할 수 있다. 예를 들어 인 공신경망의 알려진 손실 함수를 이용한 역전파에 의해 사용자별 코디네이션 추천 모델(M2) 및/또는 아이템 조합 생성 모델(M1)의 파라미터를 업데이트할 수 있다. 예를 들어 단계(S3)에서 결정된 패션 코디네이션에 사용자가선호도가 높을수록(또는 사용자가 만족할수록) 또는 피드백에 의해 패션 코디네이션 변경이 발생하지 않을수록 리워드를 높게 주는 방식으로 아이템 조합 생성 모델(M1) 및/또는 사용자별 코디네이션 추천 모델(M2)를 훈련할 수 있다. 한편 의류 속성을 추출하기 위하여 예를 들어 EfficientNet 모델을 사용할 수 있다. 추가적으로 아이템 조합 생 성 모델(M1) 및/또는 사용자별 코디네이션 추천 모델(M2)의 속도 및 성능 개선을 위해 예를 들어 Vision Transformer 기반의 MobileVit을 적용할 수 있다. 실시예에 따른 패션 코디네이션 방법은 전술한 단계(S5) 이후에 사용자 피드백을 기반으로 단계(S1)에서 생성된 복수의 후보 아이템 조합의 각각에 대한 사용자 선호도를 결정하는 단계(S7)를 더 포함할 수 있다. 사용자 선호도는 패션 코디네이션 제공 장치에 의해 코디네이션 상황 정보와 연계하여 사용자 코디네이션 이력 정보에 저장될 수 있다. 또한, 사용자 선호도는 해당 패션 코디네이션에 포함된 아이템 각각의 아이템 속 성 중 하나로 관리될 수 있다. 사용자 선호도는 후보 아이템 조합 생성 모델(M1)의 입력 데이터(DTA_IN)에 포함 될 수 있다. 단계(S7)에서 프로세서는 사용자 피드백에 따른 코디네이션 변경 여부 및 변경 횟수를 기반으로 각각의 후 보 아이템 조합에 대한 사용자 선호도 및 각 후보 아이템 조합에 포함된 패션 아이템에 대한 사용자 선호도를 결정할 수 있다. 예를 들어 사용자가 추가한 아이템은 사용자 선호도를 높게 책정하고 사용자가 변경 또는 제외한 아이템은 사용 자 선호도를 낮게 책정할 수 있다. 예를 들어 최종 패션 코디네이션에 포함된 아이템은 사용자 선호도를 높게 책정할 수 있다. 단계(S6) 및 단계(S7)는 동시에, 순차적으로 또는 역순으로 실행될 수 있으며 이에 제한되지 않고 독립적으로 실행가능하다. 전술한 본 발명의 일 실시예에 따른 방법은 컴퓨터 프로그램이 기록된 비 일시적 기록 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 비 일시적 기록 매체는, 컴퓨터 시스템에 의하 여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 비 일시적 기 록 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD- ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다."}
{"patent_id": "10-2023-0072731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 설명된 본 발명의 실시예에 대한 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가 능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한 정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 개시에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 개시가 한정되는 것은 아니 다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 청구범위에 의하여 나타내어지며, 청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석 되어야 한다."}
{"patent_id": "10-2023-0072731", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 인공지능 기반 패션 코디네이션 제공 동작 환경을 개략적으로 도시한다. 도 2는 실시예에 따른 인공지능 기반 패션 코디네이션 제공 장치의 블록도이다. 도 3은 실시예에 따른 패션 코디네이션 제공 방법의 흐름도이다. 도 4는 실시예에 따른 패션 코디네이션 방법의 패션 아이템 등록 과정을 예시적으로 설명하기 위한 도면이다. 도 5는 실시예에 따른 패션 코디네이션 제공 과정을 설명하기 위한 도면이다. 도 6은 실시예에 따른 아이템 조합 생성 모델을 도시한다. 도 7은 실시예에 따른 패션 코디네이션 제공 방법의 추가 흐름도이다."}
