{"patent_id": "10-2018-0141106", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0056864", "출원번호": "10-2018-0141106", "발명의 명칭": "홈케어 플랫폼을 이용한 치매환자 홈케어 서비스 제공 방법", "출원인": "웰니스인텔리전스", "발명자": "서동필"}}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 시스템(computing system) 및 통신망에 기반한 홈케어 플랫폼(home care platform)을 이용한 치매환자홈케어 서비스 제공 방법으로서, 홈케어 플랫폼은 인공지능 전문가 시스템(A.I. expert system)을 포함하고,홈케어 플랫폼 상에서 플랫폼 사용자에게 치매환자의 치매 극복, 완화, 또는 진행 저지 또는 지연을 위한 훈련프로그램을 제공하는 단계,치매환자의 라이프로그(LifeLog)에 기반한 로그데이터(log data)를 수집하는 단계,플랫폼 사용자에게 치매환자의 개인 맞춤형 훈련 프로그램 수행을 위한 인공지능적 절차를 진행하는 훈련 프로그램 진행 단계를 포함하는, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 훈련 프로그램 제공 단계는 인공지능 전문가 시스템에 의해 개발된 훈련 프로그램을 초기치로제공하는 초기 단계를 포함하는, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 훈련 프로그램 제공 단계는 홈케어 플랫폼 상에 구비된 훈련 프로그램을 선택하여 초기치로 제공하는 초기 단계를 포함하는, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 실제 치매전문가 시스템과 연계하여 훈련 프로그램 및 데이터를 중계하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 훈련 프로그램 제공 단계는 중계 단계를 통해 실제 치매전문가 시스템으로부터 획득되는 훈련프로그램을 초기치로 제공하는 초기 단계를 포함하는, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항 또는 제5항에 있어서, 훈련 프로그램 진행 단계는 이미 제공된 훈련 프로그램을 중계 단계를 통해 실제치매전문가 시스템으로부터 획득되는 훈련 프로그램으로 수정하여 제공하는 단계를 포함하는, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 실제 치매전문가 시스템은 치매전문 의료기관 처방전달시스템(OCS : Order CommunicationSystem)을 포함하는, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 로그데이터 수집 단계는, 인지훈련 수행 및 평가를 통한 인지능력 로그데이터; 음성인식 문진을 통한 일상생활 수행능력 로그데이터; 일대일 대면방문을 통한 생활패턴(life pattern) 로그데이터; 및 사물인터넷(IoT) 스마트버튼(smart button)을 통한 생활패턴 로그데이터 중 하나 이상을 수집하도록 구성된, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 로그데이터 수집 단계는 치매케어 소셜로봇(social robot)을 이용하여 로그데이터를 수집하는단계를 더 포함하고, 공개특허 10-2020-0056864-3-치매케어 소셜로봇은, 인지능력 로그데이터, 및 일상생활 수행능력 로그데이터 중 적어도 하나를 수집하도록 구성된, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 훈련 프로그램 진행 단계는 치매케어 소셜로봇에 의해 실행되는, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 훈련 프로그램 진행 단계는 치매케어 소셜로봇에 의해 인지(Visuospatial) 훈련 콘텐츠; 주의(Attention) 훈련 콘텐츠; 사고(Execution) 훈련 콘텐츠; 기억(Memory) 훈련 콘텐츠; 및 언어(Language) 훈련콘텐츠 중 하나 이상을 실행하는, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 치매케어 소셜로봇에 의해 사용자의 발화를 트래킹(tracking)하는 단계를 더 포함하고,치매케어 소셜로봇이 음성인식 전처리 기능 고도화에 의한 노년층 대화 인터페이스를 구현하도록 구성된, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 발화 트래킹 단계의 과정과 결과를 표현하는 데이터를 인공지능 전문가 시스템 또는 치매전문의료기관에 전달하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2018-0141106", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨팅 시스템에 의해 판독 가능한 기록매체로서, 컴퓨팅 시스템 상에서 실행되어 제1항 내지 제13항 중 어느한 항에 기재된 방법을 구현할 수 있는 프로그램이 기록된, 기록매체."}
{"patent_id": "10-2018-0141106", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "홈케어 플랫폼을 이용한 치매환자 홈케어 서비스 제공 방법을 제공한다. 방법은, 홈케어 플랫폼 상에서 플랫폼 사용자에게 치매환자의 치매 극복, 완화, 또는 진행 저지 또는 지연을 위 한 훈련 프로그램을 제공하는 단계(S110), 치매환자의 라이프로그에 기반한 로그데이터를 수집하는 단계(S130), 및 플랫폼 사용자에게 치매환자의 개인 맞춤형 훈련 프로그램 수행을 위한 인공지능적 절차를 진행하는 훈련 프 로그램 진행 단계(S150)를 포함한다. 훈련 프로그램 진행 단계(S150)는 이미 제공된 훈련 프로그램을 중계 단계(S160)를 통해 실제 치매전문가 시스템 으로부터 획득되는 훈련 프로그램으로 수정하여 제공하는 단계(S170)를 포함한다."}
{"patent_id": "10-2018-0141106", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이 발명은 치매환자 홈케어 서비스(home care service) 제공 방법에 관한 것이며, 더 자세하게는, 인공지능 전 문가 시스템(A.I. expert system)을 포함하는 홈케어 플랫폼(home care platform)을 이용한 치매환자 홈케어 서비스 제공 방법에 관한 것이다."}
{"patent_id": "10-2018-0141106", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정상인이 치매환자로 진행하는 중간단계로 인식되는 경도인지장애를 겪고 있는 노인은 전체 노인 인구의 약 1/4 에 달하며, 경도인지장애를 겪고 있는 노인의 치매유병률은 8% 내지 9%로서, 그렇지 않은 노인의 약 3배에 달한 다. 경도인지장애 노인은 여러 인지기능 중 주로 기억저하를 호소하고 있고, 기억저하로 인해 삶의 만족도가 떨어질 뿐민 아니라, 이들 중 1/3 내지 1/2이 치매로 진행되기 때문에, 이 단계에서 기억력을 유지하고 치매로의 진행 을 억제하기 위한 진료 및 치료가 매우 중요하다. 경도인지장애 노인들 중 겨우 5% 정도만 병원진료를 받고 있는 상황이고, 치매 예방 관리의 패러다임은 치료권 장에서 환자주도의 적극적 자가 관리 형태로 변하고 있다. 치매환자 또는 경도인지장애자의 효과적인 홈캐어를 위해서는 요양전문가의 방문지도와 보호자의 교육 등이 반 드시 동반되어야 하지만, 막대한 인력 및 사회적 비용이 발생하는 문제가 있다."}
{"patent_id": "10-2018-0141106", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러므로, 전문 간호 인력의 방문, 즉, 치매환자 가족의 비용 부담을 최소화 하면서 홈케어의 효용을 극대화 하 기 위한 양질의 홈케어 서비스의 개발이 요구된다.이 발명은 라이프로그 기반 홈캐어 데이터를 이용하는 양질의 홈케어 서비스를 제안하고자 한다."}
{"patent_id": "10-2018-0141106", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "위와 같은 기술적 과제를 해결하기 위한, 이 발명의 제1 양태에 따르면, 컴퓨팅 시스템(computing system) 및 통신망에 기반한 홈케어 플랫폼을 이용한 치매환자 홈케어 서비스 제공 방법이 제공되며, 여기에서, 홈케어 플 랫폼은 인공지능 전문가 시스템을 포함한다. 방법은, 홈케어 플랫폼 상에서 플랫폼 사용자에게 치매환자의 치매 극복, 완화, 또는 진행 저지 또는 지연을 위한 훈련 프로그램을 제공하는 단계, 치매환자의 라이프로그(LifeLog)에 기반한 로그데이터(log data)를 수집하는 단계, 및 플랫폼 사용자에게 치매환자의 개인 맞춤형 훈련 프로그램 수행을 위한 인공지능적 절차를 진행하는 훈련 프로 그램 진행 단계를 포함한다. 훈련 프로그램 제공 단계는 인공지능 전문가 시스템에 의해 개발된 훈련 프로그램을 초기치로 제공하는 초기 단 계를 포함할 수 있다. 훈련 프로그램 제공 단계는 홈케어 플랫폼 상에 구비된 훈련 프로그램을 선택하여 초기치로 제공하는 초기 단계 를 포함할 수 있다. 방법은, 실제 치매전문가 시스템과 연계하여 훈련 프로그램 및 데이터를 중계하는 단계를 더 포함할 수 있다. 훈련 프로그램 제공 단계는 중계 단계를 통해 실제 치매전문가 시스템으로부터 획득되는 훈련 프로그램을 초기 치로 제공하는 초기 단계를 포함할 수 있다. 훈련 프로그램 진행 단계는 이미 제공된 훈련 프로그램을 중계 단계를 통해 실제 치매전문가 시스템으로부터 획 득되는 훈련 프로그램으로 수정하여 제공하는 단계를 포함할 수 있다. 실제 치매전문가 시스템은 치매전문 의료기관 처방전달시스템(OCS : Order Communication System)을 포함할 수 있다. 로그데이터 수집 단계는, 인지훈련 수행 및 평가를 통한 인지능력 로그데이터; 음성인식 문진을 통한 일상생활 수행능력 로그데이터; 일대일 대면방문을 통한 생활패턴(life pattern) 로그데이터; 및 사물인터넷(IoT) 스마트 버튼(smart button)을 통한 생활패턴 로그데이터 중 하나 이상을 수집하도록 구성될 수 있다. 로그데이터 수집 단계는 치매케어 소셜로봇(social robot)을 이용하여 로그데이터를 수집하는 단계를 더 포함할 수 있고, 치매케어 소셜로봇은, 인지능력 로그데이터, 및 일상생활 수행능력 로그데이터 중 적어도 하나를 수집 하도록 구성될 수 있다. 훈련 프로그램 진행 단계는 치매케어 소셜로봇에 의해 실행될 수 있다. 훈련 프로그램 진행 단계는 치매케어 소셜로봇에 의해 인지(Visuospatial) 훈련 콘텐츠; 주의(Attention) 훈련 콘텐츠; 사고(Execution) 훈련 콘텐츠; 기억(Memory) 훈련 콘텐츠; 및 언어(Language) 훈련 콘텐츠 중 하나 이 상을 실행할 수 있다. 방법은, 치매케어 소셜로봇에 의해 사용자의 발화를 트래킹(tracking)하는 단계를 더 포함하고, 치매케어 소셜로봇은 음성인식 전처리 기능 고도화에 의한 노년층 대화 인터페이스를 구현하도록 구성될 수 있 다. 방법은, 발화 트래킹 단계의 과정과 결과를 표현하는 데이터를 인공지능 전문가 시스템 또는 치매전문 의료기관 에 전달하는 단계를 더 포함할 수 있다. 이 발명의 제2 양태에 따르면, 컴퓨팅 시스템에 의해 판독 가능한 기록매체가 제공되며, 기록매체는, 컴퓨팅 시 스템 상에서 실행되어 위에서 설명한 방법을 구현할 수 있는 프로그램이 기록된다. 이 명세서에서, \"컴퓨팅 시스템\"이라고 함은 슈퍼컴, 서버, PC, 노트북, 랩탑, 팜탑, 스마트폰, 또는 모바일 기 기를 포함한 연산 능력을 가진 다양한 유형의 각종 기기, 또는 그러한 기기를 이용하여 구성된 시스템을 통칭한다. 이 명세서에서, \"통신망\"이라고 함은 각종 컴퓨팅 시스템이 서로 통신하게 하는 인터넷, 인트라넷, 이더넷, 또는 각종 근거리 통신망을 포함하는 다양한 유형의 통신망을 통칭한다. 이 명세서에서, \"라이프로그\"라고 함은 개인의 일상 생활과 관련된, 온도, 조도, 습도 등과 같은 환경정보, 호흡, 혈압, 맥박 등과 같은 생체정보, 취침시간, 기상시간, 식사시간, 운동시간 등과 같은 생활정보, 또는 음 용제, 복용제, 도포제, 마사지, 투약시간 등과 같은 치료정보를 포함하는 다양한 정보를 수집하고 태깅하여 개 인 맞춤형으로 가공된 데이터를 의미한다. 이 명세서에서, \"소셜로봇\"이라고 함은 사교성(sociability)이 있는 로봇을 의미하고, \"치매케어 소셜로봇\"이라 고 함은 캐어 대상자와 어떤 미디어(media)로든 상호작용(interactive)을 자발적, 적극적으로 시도하는 로봇을 의미한다. 이 명세서에서, \"휴대형 기기\"라고 함은 스마트폰(Smart Phone) 등과 같은 다양한 기능을 가진 휴대형 기기를 의미하고, \"스마트버튼\"이라고 함은 블루투스(Bluetooth 등과 같은 근거리 통신을 이용하여 휴대형 기기 등을 편리하게 작동시킬 수 있게 구성된 각종 액세서리(accessories)를 통칭한다. 이 명세서에서, \"실제 치매전문가\"라고 함은 의사, 간호사, 치료사, 용양보호사, 조무사 등 치매환자 치료, 처 방 및 보호 업무에 종사하는 전문가를 의미하고, \"실제 치매전문가 시스템\"이라고 함은 이러한 치매전문가들이 업무에 도움을 받기 위해 활용하는 각종 컴퓨팅 시스템을 의미한다. 이 명세서에서, \"인공지능 전문가 시스템\"이라고 함은 인공 신경망 기술(neural network)에 기반하여 실제 치료 전문가들의 행위의 일부를 모방하는 인공지능적 치료, 처방 및 보호 절차를 진행하는 각종 컴퓨팅 시스템을 의 미한다. 이 명세서에서, \"발화 트래킹\"이라고 함은 사용자의 장단기적 발화 및 대화 패턴을 추적하고 분석하는 것을 의 미한다. 이 명세서에서, \"플렛폼 사용자\"라고 함은 치매환자 또는 치매환자를 치료, 처방, 또는 보호하는 전문가 및 가 족 등과 같은 보호자로서 이 발명에 따른 방법을 실행 또는 사용하기 위해 홈케어 플랫폼을 사용하는 사람을 통 칭한다."}
{"patent_id": "10-2018-0141106", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "위에서 설명한 이 발명에 따른 홈케어 서비스를 이용하면, 병원에 내원하지 않고 집에서 임상테스트를 진행하고 결과를 분석하여 피드백 함으로써 홈케어 서비스 모델을 고도화 할 수 있다. 그렇게 고도화 된 양질의 비용 절감적 홈케어 서비스에 의해 정상인과 경도인지장애자 모두의 치매 발명을 지연 또는 억제함으로써, 노인들의 삶의 질을 향상시키고, 가족들의 경제적 부담 뿐만 아니라, 사회적 비용을 줄일 수 있다."}
{"patent_id": "10-2018-0141106", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는. 첨부된 도면을 참조하여, 이 발명을 구현하는 양호한 실시예들에 대해 상세하게 설명하는데, 이 발 명이 예시된 양호한 실시예로 한정되는 것은 아니며, 예시된 실시예에 다양한 변경, 수정 또는 치환이 있을 수 있다. 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용 된다. 예를 들어, 이 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 이 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 이 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 이 출원에서, \"포 함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 이 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가진 것으로 해석되어야 하며, 이 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이 발명을 설명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 도 1은 이 발명의 한 실시예에 따른 치매환자 홈케어 서비스 제공 방법을 구현하기 위해 이용하는 홈케어 플랫 폼을 개략적으로 도시하고, 도 4는 도 1에 도시된 플랫폼의 개념을 이모티콘과 사진을 이용하여 묘사 하며, 도 5는 도 1에 도시된 시스템에서 이용하는 소셜로봇의 외관을 개략적으로 스케치한 것이다. 홈케어 플랫폼은, 컴퓨팅 시스템 및 통신망에 기반하여 구성되며, 홈캐어 운용 시스템 및 인공지능 전문가 시스템을 포함한다. 도 2는 도 1에 도시된 홈케어 플랫폼을 이용하여 구현되는 이 발명의 한 실시예에 따른 치매환자 홈케어 서비스 제공 방법을 개략적으로 도시한다. 방법은, 홈케어 플랫폼 상에서 플랫폼 사용자에게 치매환자의 치매 극복, 완화, 또는 진행 저지 또는 지연 을 위한 훈련 프로그램을 제공하는 단계(S110), 치매환자의 라이프로그에 기반한 로그데이터를 수집하는 단계 (S130), 및 플랫폼 사용자에게 치매환자의 개인 맞춤형 훈련 프로그램 수행을 위한 인공지능적 절차를 진행하는 훈련 프로그램 진행 단계(S150)를 포함한다. 훈련 프로그램 제공 단계(S110)는 인공지능 전문가 시스템에 의해 개발된 훈련 프로그램을 초기치로 제공 하는 초기 단계(S112)를 포함할 수 있다. 훈련 프로그램 제공 단계(S110)는 홈케어 플랫폼 상에 구비된 훈련 프로그램을 선택하여 초기치로 제공하는 초 기 단계(S114)를 포함할 수 있다. 방법은, 실제 치매전문가 시스템과 연계하여 훈련 프로그램 및 데이터를 중계하는 단계(S160)를 더 포함할 수 있다. 훈련 프로그램 제공 단계(S110)는 중계 단계(S160)에서 데이터 중계부를 통해 실제 치매전문가 시스템 으로부터 획득되는 훈련 프로그램을 초기치로 제공하는 초기 단계(S116)를 포함할 수 있다. 훈련 프로그램 진행 단계(S150)는 이미 제공된 훈련 프로그램을 중계 단계(S160)를 통해 실제 치매전문가 시스 템으로부터 획득되는 훈련 프로그램으로 수정하여 제공하는 단계(S170)를 포함할 수 있다. 실제 치매전문가 시스템은 치매전문 의료기관 처방전달시스템등과 같은 다양한 전문가 시스템을 포함 할 수 있다. 로그데이터 수집 단계(S130)에서는, 인지훈련 수행 및 평가를 통한 인지능력 로그데이터를 수집할 수 있다. 또한, 로그데이터 수집 단계(S130)에서는, 음성인식 문진을 통한 일상생활 수행능력 로그데이터를 수집할 수도 있다. 또한, 로그데이터 수집 단계(S130)에서는, 일대일 대면방문을 통한 생활패턴 로그데이터를 수집할 수도 있다. 또한, 로그데이터 수집 단계(S130)에서는, 사물인터넷 스마트버튼을 통한 생활패턴 로그데이터를 수집할 수 있 다. 로그데이터 수집 단계(S130)는 치매케어 소셜로봇을 이용하여 로그데이터를 수집하는 단계(S132)를 더 포 함할 수 있다. 치매케어 소셜로봇은, 인지능력 로그데이터의 적어도 일부를 수집할 수 있다. 또한, 치매케어 소셜로봇은, 일상생활 수행능력 로그데이터의 적어도 일부를 수집할 수도 있다. 훈련 프로그램 진행 단계(S150)는 치매케어 소셜로봇에 의해 실행될 수도 있다. 훈련 프로그램 진행 단계(S150)는 치매케어 소셜로봇에 의해 인지 훈련 콘텐츠; 주의 훈련 콘텐츠; 사고 훈련 콘텐츠; 기억 훈련 콘텐츠; 및 언어(Language) 훈련 콘텐츠 등을 실행할 수 있다. 방법은, 치매케어 소셜로봇에 의해 사용자의 발화를 트래킹하는 단계(S180)를 더 포함할 수 있다. 치매케어 소셜로봇은 음성인식 전처리 기능 고도화에 의한 노년층 대화 인터페이스를 구현할 수 있다. 방법은, 발화 트래킹 단계(S180)의 과정과 결과를 표현하는 데이터를 인공지능 전문가 시스템 또는 치매전문 의 료기관에 전달하는 단계(S190)를 더 포함할 수 있다. 발화 트래킹은 사용자의 장단기적 발화 및 대화 패턴, 예를 들어, 발음의 명료성 및 발음장애의 진행 정도, 대 화의 원활함, 및 대화에서의 무응답, 부적절한 응답, 또는 “예”, “아니오” 형태의 단답형 응답이 존재하는 지 여부 및 그 빈도 등을 진단하는 데이터를 제공할 수 있다. 인공지능 전문가 시스템 또는 치매전문 의료기관에 전달된 발화 트래킹 과정 및 결과는 사용자의 언어 장애의 조짐을 사전에 발견하거나, 언어 장애의 진행을 진단하기 위해 활용될 수 있다. 위에서 설명한 방법을 구현할 수 있는 프로그램은 컴퓨팅 시스템에 의해 판독 가능한 기록매체에 기록될 수 있 고, 기록매체에 기록된 프로그램을 컴퓨팅 시스템에서 판독하여 실행함으로써, 위에서 설명한 방법을 구현할 수 있다. 도 3은 도 1에 도시된 홈케어 플랫폼에서 홈캐어 운용 시스템의 기능을 적어도 일부를 수행할 수 있 는 예시적 홈케어 데이터 확보 시스템의 구성을 개략적으로 도시한다. 도시된 홈케어 데이터 확보 시스템은 라이프로그에 기반하여 치매환자 홈케어 데이터를 확보한다. 시스템은, 라이프로그에 기반한 로그데이터를 수집하는 데이터 수집부를 포함한다. 시스템은, 실제 치매전문가 시스템과 연계하는 데이터 중계부를 더 포함할 수 있다. 실제 치매전문가 시스템은, 예를 들어, 치매전문 의료기관 처방전달시스템 등과 같은 다양한 전문가 시스템을 포함할 수 있다. 시스템은, 데이터 수집부의 로그데이터 수집기능의 일부를 구현하는 치매케어 소셜로봇을 더 포 함할 수 있다. 치매케어 소셜로봇은 케어 대상자가 수행할 훈련 콘텐츠를 구비하고 케어 대상자의 훈련과정을 진행하도록 구성될 수 있다. 시스템은, 인공 신경망 기술에 기반한 인공지능 전문가 시스템을 더 포함할 수 있다. 인공지능 전문가 시스템은 개인 맞춤형 인지훈련 테스크를 개발하여 데이터 수집부에 제공할 수 있다. 인공지능 전문가 시스템은 데이터 중계부와 연동하도록 구성될 수 있다. 또한, 인공지능 전문가 시스템은 개발된 개인 맞춤형 인지훈련 테스크와 전문가로부터 획득된 대응하는 훈 련 테스크(치매전문 의료기관 처방전달시스템에서 획득된 것을 포함함)을 비교할 수 있다. 인공지능 전문가 시스템은, 비교 결과에 따라, 양자의 차이를 인공지능 전문가 시스템의 개인 맞춤형 인지훈련 테스크 개발에 피드백할 수 있다. 또한, 비교 결과는 데이터 수집부에 전달되어 그 이후의 로그데이터 수집에 반영될 수 있다. 치매케어 소셜로봇은, 프로세서와 출력수단 및 입력인터페이스를 포함할 수 있다. 프로세서는 훈련 진행을 위한 치매케어 소셜로봇의 전반적인 운용을 제어하도록 구성된다. 출력수단은 프로세서가 실행하는 훈련 콘텐츠를 시각적, 청각적, 또는 촉각적으로 출력하도록 구성된 다. 입력인터페이스는 실행중인 훈련 콘텐츠에 대한 사용자의 반응 및 행동을 받아들이도록 구성된다. 치매케어 소셜로봇은, 내장되거나 통신망으로 연결된 데이터베이스를 더 포함할 수 있고, 훈련 콘텐 츠 및 사용자 반응과 행동을 저장하도록 구성될 수 있다. 도면에서는, 치매케어 소셜로봇이 거치식인 것으로 도시되어 있지만, 치매케어 소셜로봇은 특정한 위 치에 거치해 두는 것이 아니라, 바퀴 등을 구비하여 사용자의 이동에 종동하여 이동하도록 구성될 수도 있다. 이하에서는, 이 발명을 양호하게 구현하는 예시적 실시형태에 관해 설명한다. 이 발명의 제1 실시형태에 따른 방법은, 컴퓨팅 시스템 및 통신망에 기반한 홈케어 플랫폼을 이용한 치매환자 홈케어 서비스 제공 방법으로서, 홈케어 플랫폼은 인공지능 전문가 시스템을 포함하고, 홈케어 플랫폼 상에서 플랫폼 사용자에게 치매환자의 치매 극복, 완화, 또는 진행 저지 또는 지연을 위한 훈련 프로그램을 제공하는 단계, 치매환자의 라이프로그에 기반한 로그데이터를 수집하는 단계, 플랫폼 사용자에게 치매환자의 개인 맞춤형 훈련 프로그램 수행을 위한 인공지능적 절차를 진행하는 훈련 프로 그램 진행 단계를 포함한다. 이 발명의 제2 실시형태에 따른 방법은, 제1 실시형태에 따른 방법에 있어서, 훈련 프로그램 제공 단계는 인공 지능 전문가 시스템에 의해 개발된 훈련 프로그램을 초기치로 제공하는 초기 단계를 포함하는 것을 특징으로 한 다. 이 발명의 제3 실시형태에 따른 방법은, 제1 실시형태 또는 제2 실시형태에 따른 방법에 있어서, 훈련 프로그램 제공 단계는 홈케어 플랫폼 상에 구비된 훈련 프로그램을 선택하여 초기치로 제공하는 초기 단계를 포함하는 것 을 특징으로 한다. 이 발명의 제4 실시형태에 따른 방법은, 제1 실시형태 내지 제3 실시형태 중 어느 한 실시형태에 따른 방법에 있어서, 실제 치매전문가 시스템과 연계하여 훈련 프로그램 및 데이터를 중계하는 단계를 더 포함하는 것을 특 징으로 한다. 이 발명의 제5 실시형태에 따른 방법은, 제4 실시형태에 따른 방법에 있어서, 훈련 프로그램 제공 단계는 중계 단계를 통해 실제 치매전문가 시스템으로부터 획득되는 훈련 프로그램을 초기치로 제공하는 초기 단계를 포함하 는 것을 특징으로 한다. 이 발명의 제6 실시형태에 따른 방법은, 제4 실시형태 또는 제5 실시형태에 따른 방법에 있어서, 훈련 프로그램 진행 단계는 이미 제공된 훈련 프로그램을 중계 단계를 통해 실제 치매전문가 시스템으로부터 획득되는 훈련 프 로그램으로 수정하여 제공하는 단계를 포함하는 것을 특징으로 한다. 이 발명의 제7 실시형태에 따른 방법은, 제4 실시형태 내지 제6 실시형태 중 어느 한 실시형태에 따른 방법에 있어서, 실제 치매전문가 시스템은 치매전문 의료기관 처방전달시스템을 포함하는 것을 특징으로 한다.이 발명의 제8 실시형태에 따른 방법은, 제1 실시형태 내지 제7 실시형태 중 어느 한 실시형태에 따른 방법에 있어서, 로그데이터 수집 단계는, 인지훈련 수행 및 평가를 통한 인지능력 로그데이터; 음성인식 문진을 통한 일상생활 수행능력 로그데이터; 일대일 대면방문을 통한 생활패턴 로그데이터; 및 사물인터넷 스마트버튼을 통 한 생활패턴 로그데이터 중 하나 이상을 수집하도록 구성된 것을 특징으로 한다. 이 발명의 제9 실시형태에 따른 방법은, 제1 실시형태 내지 제9 실시형태 중 어느 한 실시형태에 따른 방법에 있어서, 로그데이터 수집 단계는 치매케어 소셜로봇을 이용하여 로그데이터를 수집하는 단계를 더 포함하고, 치매케어 소셜로봇은, 인지능력 로그데이터, 및 일상생활 수행능력 로그데이터 중 적어도 하나를 수집하도록 구 성된 것을 특징으로 한다. 이 발명의 제10 실시형태에 따른 방법은, 제1 실시형태 내지 제9 실시형태 중 어느 한 실시형태에 따른 방법에 있어서, 훈련 프로그램 진행 단계는 치매케어 소셜로봇에 의해 실행되는 것을 특징으로 한다. 이 발명의 제11 실시형태에 따른 방법은, 제1 실시형태 내지 제10 실시형태 중 어느 한 실시형태에 따른 방법에 있어서, 훈련 프로그램 진행 단계는 치매케어 소셜로봇에 의해 인지 훈련 콘텐츠; 주의 훈련 콘텐츠; 사고 훈련 콘텐츠; 기억 훈련 콘텐츠; 및 언어 훈련 콘텐츠 중 하나 이상을 실행하는 것을 특징으로 한다. 이 발명의 제12 실시형태에 따른 방법은, 제1 실시형태 내지 제11 실시형태 중 어느 한 실시형태에 따른 방법에 있어서, 치매케어 소셜로봇에 의해 사용자의 발화를 트래킹하는 단계를 더 포함하고, 치매케어 소셜로봇이 음성인식 전처리 기능 고도화에 의한 노년층 대화 인터페이스를 구현하도록 구성된 것을 특징으로 한다. 이 발명의 제13 실시형태에 따른 방법은, 제12 실시형태에 따른 방법에 있어서, 발화 트래킹 단계의 과정과 결 과를 표현하는 데이터를 인공지능 전문가 시스템 또는 치매전문 의료기관에 전달하는 단계를 더 포함하는 것을 특징으로 한다. 이 발명의 제3 실시형태에 따른 기록매체는, 컴퓨팅 시스템에 의해 판독 가능한 기록매체로서, 컴퓨팅 시스템 상에서 실행되어 제1항 내지 제13항 중 어느 한 항에 기재된 방법을 구현할 수 있는 프로그램이 기록된다. 이상, 도면과 양호한 실시예 및 예시적 실시형태를 참조하여 설명하였지만, 이 발명의 보호범위가 상기 도면, 실시예 또는 실시형태에 의해 한정되는 것을 의미하지는 않으며 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구의 범위에 기재된 이 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 이 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2018-0141106", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 이 발명의 한 실시예에 따른 치매환자 홈케어 서비스 제공 방법을 구현하기 위해 이용하는 홈케어 플랫 폼을 개략적으로 도시한 블록선도이고, 도 2는 도 1에 도시된 홈케어 플랫폼을 이용하여 구현되는 이 발명의 한 실시예에 따른 치매환자 홈케어 서비스 제공 방법을 개략적으로 도시한 흐름도이며, 도 3은 도 1에 도시된 홈케어 플랫폼에서 이용할 수 있는 예시적 홈케어 데이터 확보 시스템의 구성을 개략적으 로 도시한 블록선도이고, 도 4는 도 1에 도시된 플랫폼의 개념을 이모티콘과 사진을 이용하여 묘사한 개요도이며, 도 5는 도 1에 도시된 플랫폼 및 도 3에 도시된 시스템에서 이용하는 소셜로봇의 외관을 개략적으로 스케치한 개요도이다."}
