{"patent_id": "10-2023-0088369", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0008275", "출원번호": "10-2023-0088369", "발명의 명칭": "인공지능 분리수거 장치", "출원인": "호남대학교 산학협력단", "발명자": "강경현"}}
{"patent_id": "10-2023-0088369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전체적으로 상하 반전되어 있고 밑면이 비어 있는 사각뿔 형태이되, 사각뿔을 이루는 각 면이 분리되어 있고,각 면은 밑면의 바깥쪽 변을 축으로 하방으로 개폐할 수 있는 커버로 구성되어 있으며, 상기 커버의 꼭지점이만나는 곳 주변의 물체를 사용자가 설정한 4종류의 분리수거 대상으로 인식하는 인공지능 비전 센서부를 포함하는 분리수거 식별부;상기 커버의 수직방향 단면을 이루는 삼각형을 수직으로 연장하는 비어 있는 삼각기둥 형태이되, 하강하는 물체를 저장하여 분리수거하도록 하는 복수개의 수거부; 및상부에 분리수거 식별부를 포함하되 하방으로 상기 커버에 대응하는 수거부를 각 사면에 탑재하여 수평 외곽 방향으로 분리할 수 있도록 하는 베이스부;로 구성되되,상기 분리수거 식별부는 사용자가 버리는 물체를 4종류의 분리수거 대상으로 인식할 수 있도록 미리 딥러닝 학습시키되 학습된 데이터를저장한 인공지증 학습 데이터베이스부와 사용자가 버리는 물체의 시각적 이미지를 상기 인공지능 학습 데이터베이스부의 데이터를 기초로 임베딩된 분리수거 알고리즘 프로그램에 따라 판단 식별하도록 하는 인공지능 보드와상기 인공지능 보드에서 식별된 입력데이터에 따라 4개의 커버를 개폐하도록 하는 시그널을 출력하도록 하는 입출력 보드를 더 포함하는 것을 특징으로 하는 인공지능 분리수거 장치."}
{"patent_id": "10-2023-0088369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 커버는 바깥쪽 변을 축으로 하여 하방으로 개폐하되, 축 양쪽에 서버모터가 연결되어 있어, 상기 입출력보드 시그널에 따라 개폐할 수 있음을 특징으로 하는 인공지능 분리수거 장치."}
{"patent_id": "10-2023-0088369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 인공지능 비전 센서부는 초점거리 15mm 이하, 화각 160도 이상인 초광각렌즈를 사용하고, 이미지센서에 커버가 이루는 사각뿔 높이까지 자동으로 초점이 맺히도록 프로그래밍된 것을 특징으로 하는 인공지능 분리수거장치."}
{"patent_id": "10-2023-0088369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 인공지능 보드는 수거부에 저장 공간이 없는 경우 이를 검측하여 외부에 알리는 LED 또는 디스플레이부를더 포함하는 것을 특징으로 하는 인공지능 분리수거 장치."}
{"patent_id": "10-2023-0088369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 수거부 중 어느 1개는 폐스티로폴을 분리 수거하며,폐스티로폴을 분리 수거하는 수거부는 내부에 외부 전력원 또는 배터리 장치로 구동되는 열선 절단 레이어 장치를 포함하여 구성되며,상기 열선 절단 레이어 장치는 위아래로 일정 거리를 가지는 다층의 열선이 포함되는 절단 레이어; 상기 다층의공개특허 10-2025-0008275-3-열선의 전력 공급 및 차단 스위치와 전력 공급 및 차단을 외부에서 인식할 수 있도록 하는 디스플레이부를 포함하는 조작부;를 포함하여 구성되는 것을 특징으로 하는 인공지능 분리수거 장치."}
{"patent_id": "10-2023-0088369", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명인 자성 및 비자성 시트 분리 장치는 판 형상을 갖는 자성 및 비자성 시트 재료를 낱개로 분리하는 시트 분리 장치에 관한 것으로서, 보다 상세하게는 전체적으로 상하 반전되어 있고 밑면이 비어 있는 사각뿔 형태이되, 사각뿔을 이루는 각 면이 분리되어 있고, 각 면은 밑면의 바깥쪽 변을 축으로 하방으로 개폐할 수 있 (뒷면에 계속)"}
{"patent_id": "10-2023-0088369", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명인 자성 및 비자성 시트 분리 장치는 판 형상을 갖는 자성 및 비자성 시트 재료를 낱개로 분리하는 시트 분리 장치에 관한 것으로서, 보다 상세하게는 전체적으로 상하 반전되어 있고 밑면이 비어 있는 사각뿔 형태이 되, 사각뿔을 이루는 각 면이 분리되어 있고, 각 면은 밑면의 바깥쪽 변을 축으로 하방으로 개폐할 수 있는 커 버로 구성되어 있으며, 상기 커버의 꼭지점이 만나는 곳 주변의 물체를 사용자가 설정한 4종류의 분리수거 대상 으로 인식하는 인공지능 비전 센서부를 포함하는 분리수거 식별부; 상기 커버의 수직방향 단면을 이루는 삼각형 을 수직으로 연장하는 비어 있는 삼각기둥 형태이되, 하강하는 물체를 저장하여 분리수거하도록 하는 수거부; 및 상부에 분리수거 식별부를 포함하되 하방으로 상기 커버에 대응하는 수거부를 각 사면에 탑재하여 수평 외곽 방향으로 분리할 수 있도록 하는 베이스부;로 구성되되, 상기 분리수거 식별부는 사용자가 버리는 물체를 4종류 의 분리수거 대상으로 인식할 수 있도록 미리 딥러닝 학습시키되 학습된 데이터를 저장한 인공지증 학습 데이터 베이스부와 사용자가 버리는 물체의 시각적 이미지를 상기 인공지능 학습 데이터베이스부의 데이터를 기초로 임 베딩된 분리수거 알고리즘 프로그램에 따라 판단 식별하도록 하는 인공지능 보드와 상기 인공지능 보드에서 식 별된 입력데이터에 따라 4개의 커버를 개폐하도록 하는 시그널을 출력하도록 하는 입출력 보드를 더 포함하는 것을 특징으로 하는 인공지능 분리수거 장치에 관한 것이다."}
{"patent_id": "10-2023-0088369", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 자원 순환 솔루션에 대한 관심이 증가하고 있는데, 특히 재사용이 가능한 물품은 분리 수거하여 재사용함 으로써 부족한 자원을 효율적으로 활용할 수 있다. 다만, 재활용품의 분리 수거 과정은 각 가정의 구성원 또는 인부 등에 의해 수작업으로 이루어지고 있음이 현실 이다. 이를 해결하기 위해 대한민국 등록특허 제10-2517542호(발명의 명칭 : 인공 지능 모델을 활용하여 음료용 투명 페트병을 분류 가능한 지능형 재활용품 수거 장치, 공고일자 2023년04월04일)에 의하면, 지능형 재활용품 수거 장치는, 선별 모듈, 적어도 하나의 카메라, 및 프로세서를 포함하고, 상기 프로세서는, 상기 적어도 하나의 카 메라를 이용하여 상기 선별 모듈 내에 위치하는 적어도 하나의 물체에 대한 이미지를 획득하고, 상기 이미지를 특정 오브젝트의 종류를 판단하기 위한 인공 지능 모델에 적용하여, 상기 이미지 내에서 상기 적어도 하나의 물 체에 대응하는 오브젝트의 종류를 판단하고 -상기 인공 지능 모델은 복수 개의 오브젝트들의 형태, 색상, 및 사 이즈에 관한 데이터에 기반하여 학습됨-, 상기 오브젝트의 종류가 음료용 투명 페트병인 경우, 상기 적어도 하 나의 물체를 제1 적재함과 연결된 압축 모듈로 전달하도록 상기 선별 모듈의 움직임을 제어하고, 상기 오브젝트 의 종류가 비음료용 투명 페트병, 불투명 페트병, 또는 일반 플라스틱 중 하나인 경우, 상기 적어도 하나의 물 체를 제2 적재함으로 전달하도록 상기 선별 모듈의 움직임을 제어하도록 설정될 수 있는데, 다만 분리수거되어 야 하는 객체와 이를 저장하기 위한 구조에 대한 기능적 고려 및 쓰레기가 발생하여 즉각 투입되는 공공장소 또 는 가정에서 1차적으로 분류 내지 분리되어야 하는 장치적 고려가 미흡한 것으로 사료된다. 또한 기존의 최신기술을 적용한 스마트 쓰레기통들은 단순히 센서를 통해 개폐구만 열리고 닫히는 형식이다. 결 국 자동으로 쓰레기 감지로 개폐구 ON/OFF 형식으로 추가적으로 사용자가 쓰레기를 분리수거 해야 하는 단점이 있다."}
{"patent_id": "10-2023-0088369", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명인 인공지능 분리수거 장치는 종래 기술의 문제점을 해결하기 위해 안출된 것으로서 다음과 같은 목적이 있다. 본 발명의 목적은 학습된 인공지능의 정확도 높은 쓰레기 분리로 공공장소에 하나의 쓰레기통으로 1차 분리 를 할 수 있는 인공지능 분리 수거 장치를 제공함에 있다. 본 발명의 또다른 목적은 공공장소용으로 쓰레기통의 개수를 줄임으로써 공간 확보는 물론 기능미를 가진 인공지능 분리 수거 장치를 제공함에 있다. 본 발명의 또다른 목적은 가정용으로 4가지 분리수거 객체를 하나의 장치로 통합하여 분리수거할 수 있는 소형화된 인공지능 분리 수거 장치를 제공함에 있다. 본 발명의 또다른 목적은 추가적인 분리수거 작업을 없애 분리수거 소요 비용을 줄일 수 있는 인공지능 분 리 수거 장치를 제공함에 있다. 본 발명의 또다른 목적은 사용자가 분리수거를 염두에 두고 쓰레기를 처리하는 가정과는 달리 공공장소의 쓰레기통은 공공성에 따른 별도의 분리수거를 염두하지 않고 무분별하게 버리는 특징이 있는데, 이를 해소하기 위하여 쓰레기 물체를 인식하기 위하여 Deep Learning기술을 접목하고 이를 쓰레기통의 물리적 구성으로 손쉽게 쓰레기가 분리되고 이를 회수할 수 있는 AI 물체 인식에 따른 서보모터 제어방식의 인공지능 분리 수거 장치를 제공함에 있다."}
{"patent_id": "10-2023-0088369", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명인 인공지능 분리수거 장치(AISD)는 전체적으로 상하 반전되어 있고 밑면이 비어 있는 사각뿔 형태이되, 사각뿔을 이루는 각 면이 분리되어 있고, 각 면은 밑면의 바깥쪽 변을 축으로 하방으로 개폐할 수 있는 커버 로 구성되어 있으며, 상기 커버의 꼭지점이 만나는 곳 주변의 물체를 사용자가 설정한 4종류의 분리 수거 대상으로 인식하는 인공지능 비전 센서부를 포함하는 분리수거 식별부; 상기 커버의 수직 방향 단면을 이루는 삼각형을 수직으로 연장하는 비어 있는 삼각기둥 형태이되, 하강하는 물체를 저장하여 분리 수거하도록 하는 수거부; 및 상부에 분리수거 식별부를 포함하되 하방으로 상기 커버에 대응하 는 수거부를 각 사면에 탑재하여 수평 외곽 방향으로 분리할 수 있도록 하는 베이스부;로 구성된다. 상기 분리수거 식별부는 사용자가 버리는 물체를 4종류의 분리수거 대상으로 인식할 수 있도록 미리 딥러 닝 학습시키되 학습된 데이터를 저장한 인공지증 학습 데이터베이스부와 사용자가 버리는 물체의 시각적 이미지를 상기 인공지능 학습 데이터베이스부의 데이터를 기초로 임베딩된 분리수거 알고리즘 프로그램에 따라 판단 식별하도록 하는 인공지능 보드와 상기 인공지능 보드에서 식별된 입력데이터에 따라 4개 의 커버를 개폐하도록 하는 시그널을 출력하도록 하는 입출력 보드를 더 포함하는 것을 특징으로 한 다. 상기 커버는 바깥쪽 변을 축으로 하여 하방으로 개폐하되, 축 양쪽에 서버모터가 연결되어 있어, 상기 입 출력 보드 시그널에 따라 개폐할 수 있음이 바람직하다. 상기 인공지능 비전 센서부는 초점거리 15mm 이하, 화각 160도 이상인 초광각렌즈를 사용하고, 이미지센서 에 커버가 이루는 사각뿔 높이까지 자동으로 초점이 맺히도록 프로그래밍된 것을 특징으로 한다. 상기 인공지능 보드는 수거부에 저장 공간이 없는 경우 이를 검측하여 외부에 알리는 LED 또는 디스 플레이부를 더 포함함이 바람직하다. 상기 수거부중 어느 1개는 폐스티로폴을 분리 수거할 수 있으며, 폐스티로폴을 분리 수거하는 수거부는 내부에 외부 전력원 또는 배터리 장치로 구동되는 열선 절단 레이어 장치(미도시 및 부호 미부여)를 포함하여 구성되며, 상기 열선 절단 레이어 장치는 위아래로 일정 거리를 가지는 다층의 열선이 포함되는 절단 레이어(미 도시 및 부호 미부여); 상기 다층의 열선의 전력 공급 및 차단 스위치와 전력 공급 및 차단을 외부에서 인식할 수 있도록 하는 디스플레이부를 포함하는 조작부(미도시 및 부호 미부여);를 포함하여 구성되는 것을 특징으로 한다."}
{"patent_id": "10-2023-0088369", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 다음과 같은 효과가 있다. 본 발명은 학습된 인공지능의 정확도 높은 쓰레기 분리로 공공장소에 하나의 쓰레기통으로 1차 분리를 할 수 있는 인공지능 분리 수거 장치를 제공한다. 본 발명은 공공장소용으로 쓰레기통의 개수를 줄임으로써 공간 확보는 물론 기능미를 가진 인공지능 분리 수거 장치를 제공한다. 본 발명은 가정용으로 4가지 분리수거 객체를 하나의 장치로 통합하여 분리수거할 수 있는 소형화된 인공지 능 분리 수거 장치를 제공한다. 본 발명은 추가적인 분리수거 작업을 없애 분리수거 소요 비용을 줄일 수 있는 인공지능 분리 수거 장치를 제공한다. 본 발명은 사용자가 분리수거를 염두에 두고 쓰레기를 처리하는 가정과는 달리 공공장소의 쓰레기통은 공공 성에 따른 별도의 분리수거를 염두하지 않고 무분별하게 버리는 특징이 있는데, 이를 해소하기 위하여 쓰레기 물체를 인식하기 위하여 Deep Learning기술을 접목하고 이를 쓰레기통의 물리적 구성으로 손쉽게 쓰레기가 분리 되고 이를 회수할 수 있는 AI 물체 인식에 따른 서보모터 제어방식의 인공지능 분리 수거 장치를 제공한다."}
{"patent_id": "10-2023-0088369", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "먼저, 본 발명의 구체적인 설명에 들어가기에 앞서, 본 발명에 관련된 공지 기술 또는 구성에 대한 구체적인 설 명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라 질 수 있으므로, 그 정의는 본 발명에 따른 \"인공지능 분리수거 장치\"를 설명하는 본 명세 서 전반에 걸친 내용을 토대로 내려져야 한다. 본 명세서에서 사용되는 전문용어는 단지 특정 실시예를 언급하기 위한 것이며, 본 발명을 한정하는 것을 의도 하지는 않는다. 여기서 사용되는 단수 형태들은 문구들이 이와 명백히 반대의 의미를 나타내지 않는 한 복수 형 태들도 포함한다. 본 명세서에서 사용되는 \"포함하는\"의 의미는 특정 특성, 영역, 정수, 단계, 동작, 요소 및/또는 성분을 구체화 하며, 다른 특정 특성, 영역, 정수, 단계, 동작, 요소, 성분 및/또는 군의 존재나 부가를 제외시키는 것은 아니 다."}
{"patent_id": "10-2023-0088369", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서에서 사용되는 기술용어 및 과학용어를 포함하는 모든 용어들은 본 발명이 속하는 기술분야에서 통상 의 지식을 가진 자가 일반적으로 이해하는 의미와 동일한 의미를 가진다. 사전에 정의된 용어들은 관련기술문헌 과 현재 개시된 내용에 부합하는 의미를 가지는 것으로 추가 해석되고, 정의되지 않는 한 이상적이거나 매우 공 식적인 의미로 해석되지 않는다. 본 발명은 일면에 있어서, 도 1은 본 발명인 인공지능 분리수거 장치에 대한 사시도이며, 도 2는 본 발명인 인 공지능 분리수거 장치의 일 구성인 수거부가 분리되는 것을 나타낸 사시도이고, 도 3은 본 발명인 인공지능 분 리수거 장치의 일 구성으로서 인공지능 비전 센서부가 본체로부터 조립될 수 있음을 나타낸 일부 분리 사시도이 며, 도 4는 본 발명인 인공지능 분리수거 장치의 작동을 나타내기 위해 일부를 투명처리한 사시도이고, 도 5는 본 발명인 인공지능 분리수거 장치의 작동에 대한 다이어그램 순서도이며, 도 6은 본 발명인 인공지능 분리수거 장치의 분리 수거 작동에 대한 알고리즘을 개략적으로 나타낸 도면이고, 도 7은 본 발명인 인공지능 분리수거 장치에 의해 오브젝트 구분을 위해 미리 학습되는 과정을 간략하게 나타낸 도면이다.도 1 내지 4를 참조하면 본 발명인 인공지능 분리수거 장치(AISD)는 전체적으로 상하 반전되어 있고 밑면이 비 어 있는 사각뿔 형태이되, 사각뿔을 이루는 각 면이 분리되어 있고, 각 면은 밑면의 바깥쪽 변을 축으로 하방으 로 개폐할 수 있는 커버로 구성되어 있으며, 상기 커버의 꼭지점이 만나는 곳 주변의 물체를 사용자 가 설정한 4종류의 분리수거 대상으로 인식하는 인공지능 비전 센서부를 포함하는 분리수거 식별부; 상기 커버의 수직방향 단면을 이루는 삼각형을 수직으로 연장하는 비어 있는 삼각기둥 형태이되, 하강하는 물체를 저장하여 분리수거하도록 하는 수거부; 및 상부에 분리수거 식별부를 포함하되 하방으로 상기 커버에 대응하는 수거부를 각 사면에 탑재하여 수평 외곽 방향으로 분리할 수 있도록 하는 베이스부 ;로 구성된다. 상기 베이스부의 단면이 정사각형이라면 상기 수거부의 안쪽 꼭지점의 각도는 90도가 될 것이며, 각 수거 부는 모두 동일한 형태가 됨은 물론이다. 도 5 내지 7을 참조하면 상기 분리수거 식별부는 사용자가 버리는 물체를 4종류의 분리수거 대상으로 인식 할 수 있도록 미리 딥러닝 학습시키되 학습된 데이터를 저장한 인공지증 학습 데이터베이스부와 사용자가 버리는 물체의 시각적 이미지를 상기 인공지능 학습 데이터베이스부의 데이터를 기초로 임베딩된 분리수거 알고리즘 프로그램에 따라 판단 식별하도록 하는 인공지능 보드와 상기 인공지능 보드에서 식별된 입 력데이터에 따라 4개의 커버를 개폐하도록 하는 시그널을 출력하도록 하는 입출력 보드를 더 포함하 는 것을 특징으로 한다. 4종류의 분리수거 대상이라고 하면, 보통 플라스틱, 캔, 유리와 이에 해당하지 않는 일반 쓰레기라 할 수 있는 데, 본원발명은 이는 하나의 예시에 불과하며 분리수거 대상으로서 다른 대상으로 지정할 수 있다. 만약 스티로폼이 지정된 다면, 수거부 내부에 낙하하는 스티로폼을 잘게 자를 수 있는 전류에 의한 격자 형태의 열선이 더 포함될 수 있음이 바람직하다. 도 3 및 4를 참조하면 상기 커버는 바깥쪽 변을 축으로 하여 하방으로 개폐하되, 축 양쪽에 서버모터가 연결되어 있어, 이에 구동 명령을 내리는 상기 입출력 보드 시그널에 따라 개폐할 수 있음이 바람직하다. 도 4를 참조하면 MCU 보드(입출력 보드)를 통해 서보모터를 제어하여 커버가 스스로 열리고 닫히게 하는 것으로 커버 상단 부분에 인공지능 비전 센서부를 설치하여 이에 포함된 렌즈가 투입된 쓰레기를 촬상하고 인공지 능 분리수거 장치(AISD) 스스로 쓰레기 종류에 알맞은 부분의 커버를 개폐하여 중력에 의해 해당 수거부로 낙하 되어 쓰레기를 분리 저장하게 된다. 도 4를 참조하면 상기 인공지능 비전 센서부는 초점거리 15mm 이하, 화각 160도 이상인 초광각렌즈를 사용 하고, 이미지센서에 커버가 이루는 사각뿔 높이까지 자동으로 초점이 맺히도록 프로그래밍된 것을 특징으로 한 다. 상기 인공지능 보드는 수거부에 저장 공간이 없는 경우 이를 검측 내지 센싱하여 외부에 알리는 LED 또는 디스플레이부를 더 포함함이 바람직하다. 상기 수거부중 어느 1개는 폐스티로폴을 분리 수거할 수 있으며, 폐스티로폴을 분리 수거하는 수거부는 내부에 외부 전력원 또는 배터리 장치로 구동되는 열선 절단 레이어 장치(미도시 및 부호 미부여)를 포함하여 구성되며, 상기 열선 절단 레이어 장치는 위아래로 일정 거리를 가지는 다층의 열선이 포함되는 절단 레이어(미 도시 및 부호 미부여); 상기 다층의 열선의 전력 공급 및 차단 스위치와 전력 공급 및 차단을 외부에서 인식할 수 있도록 하는 디스플레이부를 포함하는 조작부(미도시 및 부호 미부여);를 포함하여 구성되는 것을 특징으로 한다. 이러한 열선 절단 레이어 장치는 폐스티로폼이 통과할 경우에만 전력으로 구동되는 것이 바람직하며, 기타 폐스 티로폼 절단시 발생하는 연기를 흡착하여 제거하는 흡착필터도 별도로 내부에 부착함이 바람직하다. 폐스티로폼 또는 폐스티로폴은 부피가 큰 경우가 많아 시계열적 통과 및 분할 공간 통과 방식을 적용하여 미세 조각으로 배출하게 되는바, 즉 부피가 큰 폐스티로폼을 일정 간격으로 배치된 다층의 열선을 통과시키게 하면서 미세조각으로 나뉘어 배출하게 되는 것이므로, 사용자의 간단한 조작에 의해 안전한 스티로폴의 최적 처리방식 을 제공하기 위함이다. 본 발명은 다음과 같은 효과가 있다. 본 발명은 학습된 인공지능의 정확도 높은 쓰레기 분리로 공공장소에 하나의 쓰레기통으로 1차 분리를 할 수 있는 인공지능 분리 수거 장치를 제공한다. 본 발명은 공공장소용으로 쓰레기통의 개수를 줄임으로써 공간 확보는 물론 기능미를 가진 인공지능 분리 수거 장치를 제공한다. 본 발명은 가정용으로 4가지 분리수거 객체를 하나의 장치로 통합하여 분리수거할 수 있는 소형화된 인공지 능 분리 수거 장치를 제공한다. 본 발명은 추가적인 분리수거 작업을 없애 분리수거 소요 비용을 줄일 수 있는 인공지능 분리 수거 장치를 제공한다."}
{"patent_id": "10-2023-0088369", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명인 인공지능 분리수거 장치에 대한 사시도이다. 도 2는 본 발명인 인공지능 분리수거 장치의 일 구성인 수거부가 분리되는 것을 나타낸 사시도이다. 도 3은 본 발명인 인공지능 분리수거 장치의 일 구성으로서 인공지능 비전 센서부가 본체로부터 조립될 수 있음 을 나타낸 일부 분리 사시도이다. 도 4는 본 발명인 인공지능 분리수거 장치의 작동을 나타내기 위해 일부를 투명처리한 사시도이다. 도 5는 본 발명인 인공지능 분리수거 장치의 작동에 대한 다이어그램 순서도이다. 도 6은 본 발명인 인공지능 분리수거 장치의 분리 수거 작동에 대한 알고리즘을 개략적으로 나타낸 도면이다. 도 7은 본 발명인 인공지능 분리수거 장치에 의해 오브젝트 구분을 위해 미리 학습되는 과정을 간략하게 나타낸 도면이다."}
