{"patent_id": "10-2022-0008454", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0112330", "출원번호": "10-2022-0008454", "발명의 명칭": "영상콘텐츠 내의 음성 및 텍스트 번역 방법", "출원인": "(주)온비", "발명자": "이영주"}}
{"patent_id": "10-2022-0008454", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "재생중인 영상콘텐츠를 기 설정된 프레임간격으로 캡처한 캡처 이미지를 그레이스케일(Grayscale) 이미지로 변환시키고, 변환된 그레이스케일 이미지에 소정의 임계값(Threshold)를 적용한 그레이스케일 이미지 상의 점 성분 노이즈를 저감시켜 영상콘텐츠 내의 텍스트 검출을 준비하는 준비단계;상기 영상콘텐츠에 포함된 음성 또는 상기 준비단계에서 준비된 영상콘텐츠 내의 텍스트의 검출을 감지하는 감지단계;상기 감지단계에서 감지된 텍스트 또는 음성을 설정된 설정 언어로 번역하는 번역단계;상기 감지단계의 감지결과에 따라 상기 번역단계에서 번역된 텍스트 또는 음성의 영상콘텐츠 내 출력영역을 설정하는 설정단계; 및상기 설정단계에서 설정된 출령영역 상에 상기 번역단계에서의 번역결과를 출력시키는 출력단계;를 포함하며,상기 감지단계는 상기 준비단계에서 준비된 점 성분 노이즈가 저감된 그레이스케일 이미지로부터 미리 설정된비율단위를 가지는 라인 형상을 검출하고, 각 라인 형상의 크기 또는 각 라인 형상이 이루는 수직 간격 또는 수평 간격 중 적어도 어느 하나의 기준에 따라 적어도 하나 이상의 그룹단위를 생성하여, 생성된 그룹단위 내에텍스트를 검출하는 단계이며, 상기 설정단계는 상기 감지단계에서 생성된 그룹단위가 이루는 영역에 소정의 마진(Margin)을 적용하여 상기 번역단계 번역된 텍스트가 출력되는 출력영역을 설정하되, 상기 감지단계에서 영상콘텐츠의 동일 재생시점에 텍스트와 음성이 모두 검출되면, 상기 번역단계에서 번역된 영상콘텐츠의 음성 번역결과가 출력될 출력영역을 텍스트 번역결과가 출력될 출력영역을 제외한 영상콘텐츠의 외곽영역으로 설정하는 단계인 것을 특징으로 하는 영상콘텐츠 내의 음성 및 텍스트 번역 방법."}
{"patent_id": "10-2022-0008454", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 영상콘텐츠 내의 음성 및 텍스트 번역 방법에 관한 것으로, 재생중인 영상콘텐츠를 기 설정된 프레임 간격으로 캡처한 캡처 이미지를 그레이스케일(Grayscale) 이미지로 변환시키고, 변환된 그레이스케일 이미지에 소정의 임계값(Threshold)를 적용한 그레이스케일 이미지 상의 점 성분 노이즈를 저감시켜 영상콘텐츠 내의 텍스 (뒷면에 계속)"}
{"patent_id": "10-2022-0008454", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 영상콘텐츠에 포함된 음성과 텍스트를 감지하여, 영상콘텐츠 상에 번역결과를 출력 제공하는 영상콘 텐츠 내의 음성 및 텍스트 번역 기술에 관한 것이다."}
{"patent_id": "10-2022-0008454", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신기술의 발전에 의해, 많은 사람들은 인터넷에 접속하여 세계 각국의 소식과 정보를 접할 수 있게 되었다. 하지만, 세계 각국의 소식 및 정보는 이를 제공하는 국가의 언어로 작성되어 있는 경우가 대부분이기 때문에 별 도의 번역문이 제공되지 않는다면, 해당 내용을 정확하게 이해하기 어려우며, 더욱이 텍스트가 명확하게 기재된 문서 형태의 콘텐츠가 아닌 이미지 또는 영상 등과 같은 영상콘텐츠에 포함된 텍스트의 경우에는 직관성이 떨어 지기 때문에 번역에 소요되는 시간 또한 증가하게 되는 문제점이 있었다. 이러한, 문제점을 해결하기 위해, 대한민국 등록특허공보 제10-1019496호(출원일: 2008.07.16., 공고일: 2011.03.07., 이하 ‘종래기술’이라 함.)에서는 번역자가 많은 인원에 의해 시청되거나 번역의 요청이 접수된 동영상 콘텐츠에 한하여 번역을 수행하고, 번역이 완료된 이후에 사용자에게 번역 내용이 포함된 영상 콘텐츠가 제공되는 영상 콘텐츠 번역 기술이 개시된 바 있다. 하지만, 종래기술은 사용자의 요청 또는 콘텐츠 감상 횟수의 확인과 번역자에 의한 번역작업에 일정량 이상의 시간이 소요되기 때문에, 즉각적인 번역내용을 전달받을 수 없으며, 번역내용을 콘텐츠 상에 전달하는 방법을포함하고 있지 않아, 콘텐트와 번역내용을 동시에 제공하지 못할 수 있으며, 제공한다 하더라도, 번역된 내용이 콘텐츠의 감상을 저해할 수 있는 문제점이 있었다."}
{"patent_id": "10-2022-0008454", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위해, 즉각적인 영상 및 음성의 번역내용 전달이 가능하며, 번역결과가 영 상콘텐츠 감상을 저해하지 않는 영상콘텐츠 내의 음성 및 텍스트 번역 기술을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0008454", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 하는 영상콘텐츠 내의 음성 및 텍스트 번역 방법은, 화재생중인 영상콘텐츠를 기 설정된 프레임간격으로 캡처한 캡처 이미지를 그레이스케일(Grayscale) 이미지로 변환시키고, 변환된 그레이스 케일 이미지에 소정의 임계값(Threshold)를 적용한 그레이스케일 이미지 상의 점 성분 노이즈를 저감시켜 영상 콘텐츠 내의 텍스트 검출을 준비하는 준비단계; 상기 영상콘텐츠에 포함된 음성 또는 상기 준비단계에서 준비된 영상콘텐츠 내의 텍스트의 검출을 감지하는 감지단계; 상기 감지단계에서 감지된 텍스트 또는 음성을 설정된 설 정 언어로 번역하는 번역단계; 상기 감지단계의 감지결과에 따라 상기 번역단계에서 번역된 텍스트 또는 음성의 영상콘텐츠 내 출력영역을 설정하는 설정단계; 및 상기 설정단계에서 설정된 출령영역 상에 상기 번역단계에서 의 번역결과를 출력시키는 출력단계;를 포함하며, 상기 감지단계는 상기 준비단계에서 준비된 점 성분 노이즈가 저감된 그레이스케일 이미지로부터 미리 설정된 비율단위를 가지는 라인 형상을 검출하고, 각 라인 형상의 크기 또는 각 라인 형상이 이루는 수직 간격 또는 수평 간격 중 적어도 어느 하나의 기준에 따라 적어도 하나 이상의 그룹단위를 생성하여, 생성된 그룹단위 내에 텍스트를 검출하는 단계이며, 상기 설정단계는 상기 감지단계에서 생성된 그룹단위가 이루는 영역에 소정의 마진(Margin)을 적용하여 상기 번역단계 번역된 텍스트가 출력되는 출 력영역을 설정하되, 상기 감지단계에서 영상콘텐츠의 동일 재생시점에 텍스트와 음성이 모두 검출되면, 상기 번 역단계에서 번역된 영상콘텐츠의 음성 번역결과가 출력될 출력영역을 텍스트 번역결과가 출력될 출력영역을 제 외한 영상콘텐츠의 외곽영역으로 설정하는 단계인 것을 특징으로 한다."}
{"patent_id": "10-2022-0008454", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 영상콘텐츠 내의 음성 및 텍스트 번역 방법은, 영상 콘텐츠를 기 설정된 프레임 간격으로 캡처 하고 단순화한 이미지 또는 영상콘텐츠 내의 음성을 감지하여, 영상콘텐츠에 포함된 음성 및 텍스트를 번역하여, 상호 겹치지 않은 영상콘텐츠의 영역 상에 오버레이시켜 배치함으로써, 영상콘텐츠에 포함된 텍스트 및 음성에 대한 번역을 동시에 제공할 수 있으며, 더욱이, 텍스트의 경우, 번역결과가 영상콘텐츠와 일체감을 형성함으로써, 텍스트 번역결과 확인이 용이하고, 영상콘텐츠의 시인성 저하를 최소화할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0008454", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 발명의 영상콘텐츠 내의 음성 및 텍스트 번역 방법에 대한 바람직한 실시 예 를 상세히 설명한다. 각 도면에 제시된 동일한 참조부호는 동일한 부재를 나타낸다. 또한 본 발명의 실시 예들에 대해서 특정한 구조 적 내지 기능적 설명들은 단지 본 발명에 따른 실시 예를 설명하기 위한 목적으로 예시된 것으로, 다르게 정의 되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는 것이 바람직하다. 도 1은 본 발명의 바람직한 실시예에 따른 영상콘텐츠 내의 음성 및 텍스트 번역 방법의 각 단계를 도시한 순서 도이다. 도 1을 참조하여 설명하자면, 본 발명의 바람직한 실시예에 따른 영상콘텐츠 내의 음성 및 텍스트 번역 방법은, 준비단계(S100), 감지단계(S200), 번역단계(S300), 설정단계(S400) 및 출력단계(S500)를 포함할 수 있다. 준비단계(S100)는 재생중인 영상콘텐츠를 기 설정된 프레임간격으로 캡처한 캡처 이미지를 그레이스케일 (Grayscale) 이미지로 변환시키고, 변환된 그레이스케일 이미지에 소정의 임계값(Threshold)를 적용한 그레이스 케일 이미지 상의 점 성분 노이즈를 저감시켜 영상콘텐츠 내의 텍스트 검출을 준비하는 단계이다. 감지단계 (S100)는 세부적으로, 캡처 이미지로부터 그레이스케일 이미지를 생성하는 이진화단계(S110), 그레이스케일 이 미지 내의 라인성분을 좀 더 명확하게 하기 위해, 그레이스케일 이미지의 선명도를 소정의 수치만큼 증가시킨 제1 이미지와 그레이스케일 이미지를 블러(Blur)처리한 제2 이미지를 비교하여 그레이스케일 이미지로부터 에지 (Edge)를 추출한 에지 이미지를 생성하는 선명화단계(S120), 에지 이미지 내의 소정의 길이 이하의 라인 성분을 검출하고, 각 라인 성분의 인접 영역에 끊어진 점 성분이 있는지 확인하여, 인접 영역에 끊어진 점 성분이 위치 한 소정 길이 이하의 라인 성분을 제거하여 노이즈를 메워 단순화 이미지를 생성하는 단순화단계(S130) 및 단순 화 이미지 내에 설정 길이 이상의 라인 성분을 검출 제거하여 후술할 검출단계(S200)에서 이용될 최소화된 라인 성분을 포함하는 기준 이미지를 생성하는 최소화단계(S140)를 포함할 수 있다. 감지단계(S200)는 영상콘텐츠에 포함된 음성 또는 준비단계(S100)에서 준비된 영상콘텐츠 내의 텍스트의 검출을 감지하는 단계이다. 이 단계에서는, 준비단계(S100)로부터 생성된 기준 이미지로부터 미리 설정된 비율단위 영 역에 배치되는 적어도 하나 이상의 라인 성분을 포함하는 라인 형상을 검출하되, 기준 이미지로부터 FCN(Fully Convolutional Network)를 사용하여 영상콘텐츠 내에 텍스트에 대응하는 특징적인 라인 형상을 검출하는 것으로 영상콘텐츠 내에 텍스트를 감지할 수 있으며, 검출된 각 라인 형상의 크기 또는 각 라인 형상이 이루는 수직 간 격 또는 수평 간격 중 적어도 어느 하나의 기준에 따라 그룹핑하여, 적어도 하나 이상의 그룹단위를 생성할 수 있다. 감지단계(S200)에서 생성되는 그룹단위는 영상콘텐츠 내의 텍스트가 위치한 영역으로 판단되는 영역으로 후술할 설정단계(S400)에서는 이러한 그룹단위에 소정의 마진을 적용하여 번역결과를 출력하는 영역으로 사용할 수도 있다. 이때, 어느 하나의 라인 형상과 인접한 또 다른 라인 형상이 이루는 거리가 가까우면 하나의 텍스트 인 것으로 인식할 수 있으며, 유사 간격을 가지며 동일한 각도를 이루며 행 또는 열 방향으로 인접 위치한 또 다른 라인 형상을 그룹핑하여 그룹단위를 생성한다 함은, 동일 간격으로 인접 위치한 복수의 라인 형상을 띄어 쓰기에 의해 분리된 하나의 어절단위로 인식하여, 기준 이미지 내에 복수의 라인 형상을 복수의 어절 단위로 그 룹화 함을 의미한다. 이러한, 감지단계(S200)에서의 그룹단위 생성은 후술할 번역단계(S300) 이전에 번역의 완 성도를 높이기 위해 필요한 단계이다. 예를 들어, 영문에서의 ‘~ in visible area’와 ‘invisible area’는 각각 ‘가시영역 내에’, ‘불가시권’이라는 상이한 의미를 가질 수 있음에 따라. ‘in visible’과‘ invisible’의 차이를 정확하게 번역하기 위해서는 띄어쓰기 단위로 텍스트 그룹을 분리해야하는 것과 같다. 이 러한, 감지단계(S200)에서의 복수의 그룹단위 생성을 통해, 기준 이미지 내의 텍스트가 위치하는 영역, 다시 말 해, 영상콘텐츠 내에 번역 대상이 되는 텍스트가 나타난 영역을 구분할 수 있게 된다. 또한, 감지단계(S200)에 서는 영상콘텐츠에 포함된 음성에서 사람의 목소리에 해당하는 주파수 대역의 음성을 추출하고, 추출된 음성이 언어인지 여부와 언어인 경우에 해당 언어 사용 국가를 검출할 수도 있다. 번역단계(S300)는 감지단계(S200)에서 감지된 텍스트 또는 음성을 설정된 설정 언어로 번역하는 단계이다. 이 단계에서는 감지단계(S200)에서 감지된 텍스트 또는 음성을 사용자가 최초 설정한 언어로 번역할 수 있으며, 웹 상에서의 텍스트-크롤링(Text-crawling)을 통해 감지단계(S200)에서 확인왼 텍스트 또는 음성 사용 국가에서 통 용되는 통상의 의미를 함께 검색하여 문자열 단위의 번역을 수행하고, 모든 문자열에 대한 개별적인 번역이 완 료되면, 열 또는 행을 이루는 복수의 문자열로 조합된 문장의 번역을 재차 수행하여 번역된 텍스트를 생성하게 된다. 설정단계(S400)는 감지단계의 감지결과에 따라 번역단계(S300)에서 번역된 텍스트 또는 음성의 영상콘텐츠 내 출력영역을 설정하는 단계이다. 이 단계에서는, 감지단계(S200)에서 생성된 그룹단위가 이루는 영역에 소정의 마진(Margin)을 적용하여 번역단계(S300) 번역된 텍스트가 출력되는 출력영역을 설정하되, 감지단계(S200)에서 텍스트와 음성이 동시에 검출되면, 번역단계(S300)에서 번역된 영상콘텐츠의 음성 번역결과가 출력될 출력영역 을 텍스트 번역결과가 출력될 출력영역을 제외한 영상콘텐츠의 외곽영역으로 설정할 수 있다. 이때, 설정단계 (S400)가 번역단계(S300) 이후에 배치되는 것은 국가별 언어에 따라 번역 이후의 언어가 이루는 텍스트열(이하, ‘도착 텍스트열’라 함.)의 길이가 번역 이전의 언어가 이루는 텍스트열(이하, ‘출발 텍스트열’라 함.)의 길 이보다 길 수 있기 때문이며, 설정단계(S400)에서는 상술한 내용에서와 같이, 번역단계(S300)에서의 도착 텍스 트열이 이루는 길이에 따라 도착 텍스트열이 출력될 출력영역의 크기를 설정할 수 있다. 만약, 영상콘텐츠 내에 서 검출된 텍스트의 도착 텍스트 열이 이루는 길이가 출발 텍스트열이 이루는 길이보다 길면, 설정단계(S400)에 서는 출력영역 내에 모든 도착 텍스트열이 출력되게 텍스트의 크기, 자간 폭 등을 조정할 수 있으며, 동일 조건 에서의 영상콘텐츠 내에 음성에 대한 텍스트 열의 경우, 소정 프레임 이후에 나누어 출력하는 방식으로 도착 텍 스트열을 출력영역을 설정할 수도 있다. 이때, 영상콘텐츠 내의 텍스트에 대한 도착 텍스트열은 영상콘텐츠의 해당 텍스트가 위치한 영역으로 설정되되, 준비단계(S100)에서 캡처한 캡처이미지 중, 감지단계(S200)에서 텍스 트가 감지된 시점의 캡처이미지에서 텍스트가 검출된 그룹 단위 영역을 이루는 각 픽셀 별 색상 정보를 확인하 고, 해당 그룹 단위 영역을 이루는 중간 값에 해당하는 색상을 대표 색상으로 선정하여, 도착 텍스트열이 출력 될 출력영역의 배경색을 설정할 수 있다. 이때, 도착 텍스트열이 출력될 출력영역의 배경색에 따라 도착 텍스트 열의 색상을 보색 등으로 설정하여 도착 텍스트열의 시인성 문제를 해결할 수 있다. 또한, 영상콘텐츠 내의 음 성에 대한 도착 텍스트열의 경우, 통상적으로는 영상콘텐츠의 중앙 하단 영역에 출력시키나, 영상 콘텐츠에 포 함된 텍스트의 도착 텍스트열과 음성의 도착 텍스트열의 출력영역이 상호 겹칠 경우, 음성의 도착 텍스트열의 출력영역 위치를 텍스트의 도착 텍스트열의 출력영여 위치에 따라 일부 이동시키거나, 음성의 도착 텍스트열이 출력될 출력영역의 형태를 변형시켜 도착 텍스트열이 복수의 열을 이루며 출력될 수도 있다. 출력단계(S500)는 설정단계(S400)에서 설정된 출령영역 상에 번역단계(S300)에서의 번역결과를 출력시키는 단계 이다. 이때, 출력단계(S500)에서는 영상콘텐츠의 영상영역에 설정단계(S400)에서 설정된 출력영역에 번역단계 (S300)에서의 번역결과가 오버레이 된 형태로 출력됨으로써, 영상콘텐츠에 포함된 텍스트 및 음성에 대한 번역 텍스트를 영상콘텐츠의 감상과 동시에 제공할 수 있게 된다. 즉, 본 발명에 따른 영상콘텐츠 내의 음성 및 텍스트 번역 방법은, 영상 콘텐츠를 기 설정된 프레임 간격으로 캡처하고 단순화한 이미지 또는 영상콘텐츠 내의 음성을 감지하여, 영상콘텐츠에 포함된 음성 및 텍스트를 번역 하여, 상호 겹치지 않은 영상콘텐츠의 영역 상에 오버레이시켜 배치함으로써, 영상콘텐츠에 포함된 텍스트 및 음성에 대한 번역을 동시에 제공할 수 있으며, 더욱이, 텍스트의 경우, 번역결과가 영상콘텐츠와 일체감을 형성 함으로써, 텍스트 번역결과 확인이 용이하고, 영상콘텐츠의 시인성 저하를 최소화할 수 있는 효과가 있다. 상기한 본 발명의 실시 예는 예시의 목적을 위해 개시된 것이고, 본 발명에 대해 통상의 지식을 가진 당업자라 면 본 발명의 사상과 범위 안에서 다양한 수정, 변경, 부가가 가능할 것이며, 이러한 수정, 변경 및 부가는 하 기의 특허 청구범위에 속하는 것으로 보아야 할 것이다.도면 도면1"}
{"patent_id": "10-2022-0008454", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시예에 따른 영상콘텐츠 내의 음성 및 텍스트 번역 방법의 각 단계를 도시한 순서 도이다."}
