{"patent_id": "10-2019-0119599", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0037232", "출원번호": "10-2019-0119599", "발명의 명칭": "인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치 및 방법", "출원인": "주식회사 에이치투케이", "발명자": "김우현"}}
{"patent_id": "10-2019-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "특정 음소를 한글의 General Corpus 에서의 출현 빈도를 기초로 선정하고, 선정된 상기 특정 음소에 대한 진단문제를 학습자의 클라이언트인 학습자 클라이언트의 유아 학습 애플리케이션 모듈에 출력하는 진단 문제 출력모듈;상기 진단 문제에 대한 상기 학습자의 입력인 진단 문제 풀이 정보를 상기 학습자 클라이언트에서 수신하고, 상기 진단 문제 풀이 정보의 전체 학습자들에 대한 분포를 기초로 상기 특정 음소에 대한 성취도 정보를생성하며, 상기 특정 음소에 대한 벡터에 상기 성취도 정보를 임베딩하는 임베딩 모듈; 상기 임베딩 정보를 기초로 상기 특정 음소 이외의 나머지 전체 음소에 대한 성취도 정보의 예측값인 예측 성취도 정보를 출력하고, 상기 특정 음소에 대한 상기 성취도 정보 및 상기 나머지 전체 음소에 대한 상기 예측 성취도 정보를 병합하여 전체 음소에 대한 성취도 정보인 수준 정보를 생성하는 수준 정보 생성 모듈; 및상기 수준 정보 및 커리큘럼에 출력하고자 하는 문제의 음소에 대한 정보인 문제 음소 정보를 입력 벡터로 하고상기 커리큘럼을 학습한 뒤의 상기 수준 정보의 변화율인 수준 정보 변화율을 출력 벡터로 하여 기학습된 인공신경망 모듈을 포함하고, 상기 수준 정보 변화율을 기초로 상기 문제 음소 정보를 선정하는 커리큘럼 선정모듈;을 포함하는,인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치."}
{"patent_id": "10-2019-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "유아 학습 애플리케이션 모듈이 설치된 학습자의 클라이언트인 학습자 클라이언트와 연결되어 유아 한글 수준별진단 평가를 수행하는 유아 한글 수준별 진단 평가 프로그램 코드를 저장하는 메모리 모듈; 및 상기 유아 한글 수준별 진단 평가 프로그램 코드를 처리하는 처리 모듈;을 포함하고, 상기 유아 한글 수준별 진단 평가 프로그램 코드는,특정 음소를 한글의 General Corpus 에서의 출현 빈도를 기초로 선정하고, 선정된 상기 특정 음소에 대한 진단문제를 상기 학습자 클라이언트의 상기 유아 학습 애플리케이션 모듈에 출력하는 진단 문제 출력 단계;상기 진단 문제에 대한 상기 학습자의 입력인 진단 문제 풀이 정보를 상기 학습자 클라이언트에서 수신하고, 상기 진단 문제 풀이 정보의 전체 학습자들에 대한 분포를 기초로 상기 특정 음소에 대한 성취도 정보를생성하며, 상기 특정 음소에 대한 벡터에 상기 성취도 정보를 임베딩하는 임베딩 단계; 상기 임베딩 정보를 기초로 상기 특정 음소 이외의 나머지 전체 음소에 대한 성취도 정보의 예측값인 예측 성취도 정보를 출력하고, 상기 특정 음소에 대한 상기 성취도 정보 및 상기 나머지 전체 음소에 대한 상기 예측 성취도 정보를 병합하여 전체 음소에 대한 성취도 정보인 수준 정보를 생성하는 수준 정보 생성 단계; 및상기 수준 정보 및 커리큘럼에 출력하고자 하는 문제의 음소에 대한 정보인 문제 음소 정보를 입력 벡터로 하고상기 커리큘럼을 학습한 뒤의 상기 수준 정보의 변화율인 수준 정보 변화율을 출력 벡터로 하여 기학습된 인공신경망 모듈을 포함하고, 상기 수준 정보 변화율을 기초로 상기 문제 음소 정보를 선정하는 커리큘럼 선정단계;를 포함하여 컴퓨터 상에서 수행하도록 구성되는 것을 특징으로 하는, 공개특허 10-2021-0037232-3-인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치."}
{"patent_id": "10-2019-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "진단 문제 출력 모듈이, 특정 음소를 한글의 General Corpus 에서의 출현 빈도를 기초로 선정하고, 선정된 상기특정 음소에 대한 진단 문제를 학습자의 클라이언트인 학습자 클라이언트의 유아 학습 애플리케이션 모듈에 출력하는 진단 문제 출력 단계;임베딩 모듈이, 상기 진단 문제에 대한 상기 학습자의 입력인 진단 문제 풀이 정보를 상기 학습자 클라이언트에서 수신하고, 상기 진단 문제 풀이 정보의 전체 학습자들에 대한 분포를 기초로 상기 특정 음소에 대한 성취도정보를 생성하며, 상기 특정 음소에 대한 벡터에 상기 성취도 정보를 임베딩하는 임베딩 단계; 수준 정보 생성 모듈이, 상기 임베딩 정보를 기초로 상기 특정 음소 이외의 나머지 전체 음소에 대한 성취도 정보의 예측값인 예측 성취도 정보를 출력하고, 상기 특정 음소에 대한 상기 성취도 정보 및 상기 나머지 전체 음소에 대한 상기 예측 성취도 정보를 병합하여 전체 음소에 대한 성취도 정보인 수준 정보를 생성하는 수준 정보생성 단계; 및커리큘럼 선정 모듈이, 상기 수준 정보 및 커리큘럼에 출력하고자 하는 문제의 음소에 대한 정보인 문제 음소정보를 입력 벡터로 하고 상기 커리큘럼을 학습한 뒤의 상기 수준 정보의 변화율인 수준 정보 변화율을 출력 벡터로 하여 기학습된 인공신경망 모듈을 포함하고, 상기 수준 정보 변화율을 기초로 상기 문제 음소 정보를 선정하는 커리큘럼 선정 단계;를 포함하는, 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 방법."}
{"patent_id": "10-2019-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "학습자의 클라이언트인 학습자 클라이언트에 구성되고, 상기 학습자 클라이언트에 설치되는 유아 한글 애플리케이션 모듈을 저장하는 메모리 모듈; 및상기 학습자 클라이언트에 구성되고, 상기 유아 한글 애플리케이션 모듈의 프로그램 코드를 처리하는 처리모듈;을 포함하고, 상기 유아 한글 애플리케이션 모듈의 프로그램 코드는,제1항에 따른 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치에서 특정 음소에 대한 진단 문제를 수신하는 진단 문제 수신 단계;상기 진단 문제에 대하여 상기 학습자에 의해 입력되는 진단 문제 풀이 정보를 생성하는 진단 문제 풀이 정보생성 단계; 상기 진단 문제 풀이 정보를 상기 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치에 송신하는 진단 문제풀이 정보 송신 단계; 및상기 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치에서 상기 진단 문제 풀이 정보를 기초로 생성한 수준 정보에 의해 생성된 커리큘럼 정보를 수신하는 커리큘럼 정보 수신 단계;를 포함하여 컴퓨터 상에서 수행하도록 구성되는 것을 특징으로 하는, 인공지능 기반의 유아 한글 학습 장치."}
{"patent_id": "10-2019-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "학습자의 클라이언트인 학습자 클라이언트에 구성되고 상기 학습자 클라이언트에 설치되는 유아 한글 애플리케공개특허 10-2021-0037232-4-이션 모듈이, 제1항에 따른 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치에서 특정 음소에 대한 진단문제를 수신하는 진단 문제 수신 단계;상기 유아 한글 애플리케이션 모듈이, 상기 진단 문제에 대하여 상기 학습자에 의해 입력되는 진단 문제 풀이정보를 생성하는 진단 문제 풀이 정보 생성 단계; 상기 유아 한글 애플리케이션 모듈이, 상기 진단 문제 풀이 정보를 상기 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치에 송신하는 진단 문제 풀이 정보 송신 단계; 및상기 유아 한글 애플리케이션 모듈이, 상기 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치에서 상기 진단 문제 풀이 정보를 기초로 생성한 수준 정보에 의해 생성된 커리큘럼 정보를 수신하는 커리큘럼 정보 수신 단계;를 포함하는,인공지능 기반의 유아 한글 학습 방법."}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치 및 방법에 관한 것이다. 이를 위하여, 특정 음소를 한글의 General Corpus 에서의 출현 빈도를 기초로 선정하고, 선정된 특정 음소에 대한 진단 문제를 학습 자의 클라이언트인 학습자 클라이언트의 유아 학습 애플리케이션 모듈에 출력하는 진단 문제 출력 모듈; 진단 문 (뒷면에 계속)"}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "한글, 영어, 일어, 중국어 등 각종 언어들에 대한 교육열이 과열되면서, 최근의 학부모들은 빠르면 4세부터 한 글, 영어 등 다양한 언어를 교육하기 시작하였다. 특히, 조기교육의 핵심인 한글의 경우, 한국교육과정평가원의 통계에 따르면, 입학 전 한글 교육 비율은 91.6%에 달하는 것으로 나타났다. 기존의 한글 교육 방식은 학부모 또는 돌보미의 돌봄 시간에 한글 학습지 등의 자료를 이용하여 교육하는 방식 이 대세를 이루었고, 점차 온라인 혹은 오프라인에서 스마트폰이나 태블릿 등의 애플리케이션을 통해 교육하는 방식으로 전환되고 있었다. 그러나, 이러한 한글 교육 방식은 유아의 한글 수준과 관련 없는 기설정된 커리큘럼 에 따른 저가의 일방향 한글 교육 방식이거나 학습지 교사의 지도가 포함된 고가의 양방향 한글 교육 방식이었 다. 이러한 점 때문에 저가로 유아의 한글 교육을 수행하여야 하는 경우, 애플리케이션을 이용하여 한글 교육을 진 행하더라도 난이도가 너무 높거나 너무 낮아 유아의 흥미를 유발하는 데에 어려움이 있었으며, 유아의 흥미 유 발을 위해 학부모 또는 돌보미가 유아의 한글 교육에 많은 교육 시간을 할애하여야 하는 문제가 있었다. 또한, 학부모와 돌보미는 시중에 판매되는 4,000개 이상의 한글 교육 학습지와 수많은 한글 교육 애플리케이션이라는 지나치게 많은 선택지 중에서 어떤 것이 가장 적절할지 선택하는 것이 매우 어려운 문제가 있었다. 또한, 학습지 교사가 방문하여 지도하는 고가의 양방향 한글 교육 방식을 취하더라도, 학습지 교사는 일주일에 15분 교육하는 경우가 대부분이며, 나머지 시간에는 학부모가 직접 한글 교육을 책임져야 하는 문제가 있었다. 선행기술문헌 비특허문헌 (비특허문헌 0001) (특허문헌 1) 대한민국 등록특허 10-1921888, 온라인 평가 기반 언어재활 훈련 방법, 대한 민국(국립재활원장) (비특허문헌 0002) (특허문헌 2) 대한민국 공개특허 10-2017-0108622, 영어 말하기의 운율 및 유창성 평가 장 치 및 그 방법, 한국전자통신연구원 (비특허문헌 0003) (특허문헌 3) 대한민국 공개특허 10-2017-0087367, 범언어적 시맨틱 웹 정보 품질평가 방법, 한국과학기술원 (비특허문헌 0004) (특허문헌 4) 대한민국 등록특허, 10-1943520, 비원어민의 영어 말하기 발음의 자동평가 시 스템 및 이를 이용한 평가방법, 한국외국어대학교 연구산학협력단"}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명의 목적은 인공지능을 이용하여 유아의 한글 실력에 대하여 수준별 진단 평가를 수행하고, 이를 기초로 전문적인 1:1 개인 맞춤형 커리큘럼을 생성하기 위한 인공지능 기반의 유아 한글 수준별 진단 평가 장치 및 방법을 제공하는데에 있다."}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이하 본 발명의 목적을 달성하기 위한 구체적 수단에 대하여 설명한다. 본 발명의 목적은, 특정 음소를 한글의 General Corpus 에서의 출현 빈도를 기초로 선정하고, 선정된 상기 특정 음소에 대한 진단 문제를 학습자의 클라이언트인 학습자 클라이언트의 유아 학습 애플리케이션 모듈에 출력하는 진단 문제 출력 모듈; 상기 진단 문제에 대한 상기 학습자의 입력인 진단 문제 풀이 정보를 상기 학습자 클라이 언트에서 수신하고, 상기 진단 문제 풀이 정보의 전체 학습자들에 대한 분포를 기초로 상기 특정 음소에 대한 성취도 정보를 생성하며, 상기 특정 음소에 대한 벡터에 상기 성취도 정보를 임베딩하는 임베딩 모듈; 및 상기 임베딩 정보를 입력 벡터로 하여 상기 특정 음소 이외의 나머지 전체 음소에 대한 성취도 정보의 예측값인 예측 성취도 정보를 출력 벡터로 출력하는 인공신경망 모듈을 포함하고, 상기 특정 음소에 대한 상기 성취도 정보 및 상기 나머지 전체 음소에 대한 상기 예측 성취도 정보를 병합하여 전체 음소에 대한 성취도 정보인 수준 정보를 생성하는 수준 정보 생성 모듈;을 포함하고, 상기 수준 정보 생성 모듈의 상기 인공신경망 모듈은, 기존 학습자 들의 상기 특정 음소에 대한 상기 성취도 정보를 입력 벡터로 하고, 상기 나머지 전체 음소 각각에 대한 상기 성취도 정보를 출력 벡터로 하여 기학습된 인공신경망인 것을 특징으로 하는, 인공지능 기반의 유아 한글 수준 별 진단 평가 장치를 제공하여 달성될 수 있다. 본 발명의 다른 목적은, 유아 학습 애플리케이션 모듈이 설치된 학습자의 클라이언트인 학습자 클라이언트와 연 결되어 유아 한글 수준별 진단 평가를 수행하는 유아 한글 수준별 진단 평가 프로그램 코드를 저장하는 메모리 모듈; 및 상기 유아 한글 수준별 진단 평가 프로그램 코드를 처리하는 처리 모듈;을 포함하고, 상기 유아 한글 수준별 진단 평가 프로그램 코드는, 특정 음소를 한글의 General Corpus 에서의 출현 빈도를 기초로 선정하고, 선정된 상기 특정 음소에 대한 진단 문제를 상기 학습자 클라이언트의 상기 유아 학습 애플리케이션 모듈에 출 력하는 진단 문제 출력 단계; 상기 진단 문제에 대한 상기 학습자의 입력인 진단 문제 풀이 정보를 상기 학습자 클라이언트에서 수신하고, 상기 진단 문제 풀이 정보의 전체 학습자들에 대한 분포를 기초로 상기 특정 음소에 대한 성취도 정보를 생성하며, 상기 특정 음소에 대한 벡터에 상기 성취도 정보를 임베딩하는 임베딩 단계; 및 인공신경망 모듈에 상기 임베딩 정보를 입력하여 상기 특정 음소 이외의 나머지 전체 음소에 대한 성취도 정보 의 예측값인 예측 성취도 정보를 출력하고, 상기 특정 음소에 대한 상기 성취도 정보 및 상기 나머지 전체 음소 에 대한 상기 예측 성취도 정보를 병합하여 전체 음소에 대한 성취도 정보인 수준 정보를 생성하는 수준 정보 생성 단계;를 포함하여 컴퓨터 상에서 수행하도록 구성되고, 상기 수준 정보 생성 모듈의 상기 인공신경망 모듈 은, 기존 학습자들의 상기 특정 음소에 대한 상기 성취도 정보를 입력 벡터로 하고, 상기 나머지 전체 음소 각 각에 대한 상기 성취도 정보를 출력 벡터로 하여 기학습된 인공신경망인 것을 특징으로 하는, 인공지능 기반의 유아 한글 수준별 진단 평가 장치를 제공하여 달성될 수 있다. 본 발명의 다른 목적은, 진단 문제 출력 모듈이, 특정 음소를 한글의 General Corpus 에서의 출현 빈도를 기초 로 선정하고, 선정된 상기 특정 음소에 대한 진단 문제를 학습자의 클라이언트인 학습자 클라이언트의 유아 학 습 애플리케이션 모듈에 출력하는 진단 문제 출력 단계; 임베딩 모듈이, 상기 진단 문제에 대한 상기 학습자의 입력인 진단 문제 풀이 정보를 상기 학습자 클라이언트에서 수신하고, 상기 진단 문제 풀이 정보의 전체 학습자 들에 대한 분포를 기초로 상기 특정 음소에 대한 성취도 정보를 생성하며, 상기 특정 음소에 대한 벡터에 상기성취도 정보를 임베딩하는 임베딩 단계; 및 수준 정보 생성 모듈이, 상기 수준 정보 생성 모듈에 포함된 인공신 경망 모듈에 상기 임베딩 정보를 입력하여 상기 특정 음소 이외의 나머지 전체 음소에 대한 성취도 정보의 예측 값인 예측 성취도 정보를 출력하고, 상기 특정 음소에 대한 상기 성취도 정보 및 상기 나머지 전체 음소에 대한 상기 예측 성취도 정보를 병합하여 전체 음소에 대한 성취도 정보인 수준 정보를 생성하는 수준 정보 생성 단계;를 포함하고, 상기 수준 정보 생성 모듈의 상기 인공신경망 모듈은, 기존 학습자들의 상기 특정 음소에 대 한 상기 성취도 정보를 입력 벡터로 하고, 상기 나머지 전체 음소 각각에 대한 상기 성취도 정보를 출력 벡터로 하여 기학습된 인공신경망인 것을 특징으로 하는, 인공지능 기반의 유아 한글 수준별 진단 평가 방법을 제공하 여 달성될 수 있다. 본 발명의 다른 목적은, 학습자의 클라이언트인 학습자 클라이언트에 구성되고, 상기 학습자 클라이언트에 설치 되는 유아 한글 애플리케이션 모듈을 저장하는 메모리 모듈; 및 상기 학습자 클라이언트에 구성되고, 상기 유아 한글 애플리케이션 모듈의 프로그램 코드를 처리하는 처리 모듈;을 포함하고, 상기 유아 한글 애플리케이션 모 듈의 프로그램 코드는, 제1항에 따른 인공지능 기반의 유아 한글 수준별 진단 평가 장치에서 특정 음소에 대한 진단 문제를 수신하는 진단 문제 수신 단계; 상기 진단 문제에 대하여 상기 학습자에 의해 입력되는 진단 문제 풀이 정보를 생성하는 진단 문제 풀이 정보 생성 단계; 및 상기 진단 문제 풀이 정보를 상기 인공지능 기반의 유아 한글 수준별 진단 평가 장치에 송신하는 진단 문제 풀이 정보 송신 단계;를 포함하여 컴퓨터 상에서 수행 하도록 구성되고, 상기 인공지능 기반의 유아 한글 수준별 진단 평가 장치에서 상기 진단 문제 풀이 정보를 기 초로 생성한 수준 정보에 의해 출력되는 커리큘럼 정보를 수신하는 것을 특징으로 하는, 인공지능 기반의 유아 한글 학습 장치를 제공하여 달성될 수 있다. 본 발명의 다른 목적은, 학습자의 클라이언트인 학습자 클라이언트에 구성되고 상기 학습자 클라이언트에 설치 되는 유아 한글 애플리케이션 모듈이, 제1항에 따른 인공지능 기반의 유아 한글 수준별 진단 평가 장치에서 특 정 음소에 대한 진단 문제를 수신하는 진단 문제 수신 단계; 상기 유아 한글 애플리케이션 모듈이, 상기 진단 문제에 대하여 상기 학습자에 의해 입력되는 진단 문제 풀이 정보를 생성하는 진단 문제 풀이 정보 생성 단계; 및 상기 유아 한글 애플리케이션 모듈이, 상기 진단 문제 풀이 정보를 상기 인공지능 기반의 유아 한글 수준별 진단 평가 장치에 송신하는 진단 문제 풀이 정보 송신 단계;를 포함하고, 상기 인공지능 기반의 유아 한글 수준 별 진단 평가 장치에서 상기 진단 문제 풀이 정보를 기초로 생성한 수준 정보에 의해 출력되는 커리큘럼 정보를 수신하는 것을 특징으로 하는, 인공지능 기반의 유아 한글 학습 방법을 제공하여 달성될 수 있다. 본 발명의 다른 목적은, 특정 음소를 한글의 General Corpus 에서의 출현 빈도를 기초로 선정하고, 선정된 상기 특정 음소에 대한 진단 문제를 학습자의 클라이언트인 학습자 클라이언트의 유아 학습 애플리케이션 모듈에 출 력하는 진단 문제 출력 모듈; 상기 진단 문제에 대한 상기 학습자의 입력인 진단 문제 풀이 정보를 상기 학습자 클라이언트에서 수신하고, 상기 진단 문제 풀이 정보의 전체 학습자들에 대한 분포를 기초로 상기 특정 음소에 대한 성취도 정보를 생성하며, 상기 특정 음소에 대한 벡터에 상기 성취도 정보를 임베딩하는 임베딩 모듈; 상 기 임베딩 정보를 기초로 상기 특정 음소 이외의 나머지 전체 음소에 대한 성취도 정보의 예측값인 예측 성취도 정보를 출력하고, 상기 특정 음소에 대한 상기 성취도 정보 및 상기 나머지 전체 음소에 대한 상기 예측 성취도 정보를 병합하여 전체 음소에 대한 성취도 정보인 수준 정보를 생성하는 수준 정보 생성 모듈; 및 상기 수준 정 보 및 커리큘럼에 출력하고자 하는 문제의 음소에 대한 정보인 문제 음소 정보를 입력 벡터로 하고 상기 커리큘 럼을 학습한 뒤의 상기 수준 정보의 변화율인 수준 정보 변화율을 출력 벡터로 하여 기학습된 인공신경망 모듈 을 포함하고, 상기 수준 정보 변화율을 기초로 상기 문제 음소 정보를 선정하는 커리큘럼 선정 모듈;을 포함하 는, 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치를 제공하여 달성될 수 있다."}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같이, 본 발명에 의하면 이하와 같은 효과가 있다. 첫째, 본 발명의 일실시예에 따르면, 유아의 한글 실력에 대하여 수준별 진단 평가가 가능해지는 효과가 발생된 다.둘째, 본 발명의 일실시예에 따르면, 유아의 한글 실력에 따라 1:1 개인 맞춤형 커리큘럼이 생성되는 효과가 발 생된다. 이에 의해, 전문적인 한글 개인 맞춤형 교육이 저렴해질 수 있는 효과가 발생된다. 셋째, 본 발명의 일실시예에 따르면, 유아의 한글 실력에 따라 최적의 커리큘럼을 선정할 수 있는 효과가 발생 된다."}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 본 발명을 쉽게 실시할 수 있는 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예에 대한 동작원리를 상세하게 설명함에 있 어서 관련된 공지기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되 는 경우에는 그 상세한 설명을 생략한다. 또한, 도면 전체에 걸쳐 유사한 기능 및 작용을 하는 부분에 대해서는 동일한 도면 부호를 사용한다. 명세서 전 체에서, 특정 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고, 간접적으로 연결되어 있는 경우도 포함한다. 또한, 특정 구성요소를 포함한다 는 것은 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라, 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하 발명의 설명에서 컨볼루져널 곱을 활용한 Neural Network인 Convolutional Neural Network은 CNN, ConvNet 등으로 기재될 수 있다. 이하 발명의 설명에서, 한글은 낱소리(음소) 문자로서 자음(닿소리)과 모음(홑소리)으로 구성되며, 음절(소리마 디)은 첫소리(초성), 가운뎃소리(중성), 끝소리(종성)의 낱소리(음소) 세 벌로 이루어지는데, 첫소리(초성)와 끝소리(종성)에는 닿소리(자음)를 쓰고 가운뎃소리(중성)에는 홀소리(모음)를 쓴다. 현대 한글에서 단음을 내는 닿소리(자음)에는 ㄱ,ㄴ,ㄷ,ㄹ,ㅁ 등 14자가 있고, 홑소리(모음)에는 ㅏ,ㅑ, ㅓ, ㅕ 등 10자가 있다. 복음을 내는 겹닿소리(쌍자음)에는 ㄲ, ㄸ, ㅃ, ㅆ, ㅉ 의 5자가 있고, 겹홑소리(쌍모음)에는 ㅐ, ㅒ, ㅔ, ㅖ 등 11자가 있다. 또한, 현대 한글에서 끝소리(종성)가 있을 때 활용되는 받침은 홑받침 또는 곁 받침이 있고, 홑받침에는 모든 닿소리(자음)가 쓰이며, 곁받침에는 ㄲ,ㅆ,ㄳ,ㄵ 등 13자가 있다. 현대 한글은 낱자를 엮어 11,172(첫소리 19 × 가운뎃소리 21 × (끝소리 27 + 끝소리 없음 1))글자 마디를 쓸 수 있다. 11,172자 중 399자는 무받침 글자이며 10,773자는 받침 글자이다. 어문 규정에 의하여, 현대 한국어 표준어에서 실제 사용하는 음절은 이보다 적다. 한국어의 소리는 첫소리+가운 뎃소리(+끝소리)로 이루어지는데, 표준어에서 첫소리에는 19가지 닿소리가 모두 쓰이되 첫소리에 놓인 ㅇ은 소 리 나지 않는다. 끝소리는 7종성법에 따라 7갈래로 모이며 끝소리가 없는 것까지 더하여 모두 8갈래이므로 현대 한국어의 발음은 첫소리 19 × 가운뎃소리 21 × 끝소리 8 = 3,192가지 소리가 된다. 표준 발음법을 따르면 구 개음 ㅈ, ㅉ, ㅊ 뒤의 이중 모음 ㅑ, ㅒ, ㅕ, ㅖ, ㅛ, ㅠ는 단모음 ㅏ, ㅐ, ㅓ, ㅔ, ㅗ, ㅜ로 소리나므로 첫소 리 3 × 가운뎃소리 6 × 끝소리 8 = 144소리가 빠지고, 아울러 소리나는 첫소리 (ㅇ이 아닌 첫소리 뒤에 오 는)를 얹은 가운뎃소리 [ㅢ]는 ㄴ을 제외하면(ㄴ의 경우는 구개음화에 따른 다른 음소로 인정하고 있다.) [ㅣ] 로 소리나므로(한글 맞춤법 제9항 및 표준 발음법 제5항 단서 3) 첫소리 17 × 가운뎃소리 1 × 끝소리 8 = 136 소리가 다시 빠진다. 따라서, 현재 한국어 표준어에서 실제 사용하는 소리마디는 3192 - 144 - 136 = 2,912가지 가 된다. 도 1은 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 학습 세션 제공 시스템을 도시한 모식도 이다. 도 1에 도시된 바와 같이, 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 학습 세션 제공 시스템은, 인공지능 기반의 유아 한글 수준별 진단 평가 장치, 인공지능 기반의 유아 한글 맞춤형 커리 큘럼 생성 장치, 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치를 포함할 수 있다. 도 1에 도시된 바와 같이, 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 학습 세션 제공 시스템은 학습 자 클라이언트의 메모리 모듈에 포함되어 처리 모듈에 의해 처리되는 유아 한글 학습 애플리케이션 모듈에 진단 문제 혹은 문제를 송신하고, 학습자에 의해 입력되는 진단 문제 풀이 정보 혹은 문제 풀이 정보를 수신하며, 진 단 문제 풀이 정보/문제 풀이 정보에 기초하여 생성된 커리큘럼 정보 혹은 세부조정 커리큘럼 정보를 송신하도 록 구성될 수 있다. 인공지능 기반의 유아 한글 수준별 진단 평가 장치 도 2는 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 진단 평가 장치를 도시한 모식도이다. 도 2에 도시된 바와 같이, 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 진단 평가 장치는, 수 준 정보 분류 모듈, 진단 기준 설정 모듈, 진단 평가 모듈을 포함할 수 있다. 본 발명의 일실시예 에 따른 인공지능 기반의 유아 한글 수준별 진단 평가 장치는 특정 웹서버, 클라우드 서버와 같은 가상 서버, 스마트폰, 태블릿 PC, 데스크탑 PC 등의 컴퓨팅 장치의 처리모듈에 의해 처리되고, 각 장치의 메모리 모 듈에 저장되도록 구성될 수 있다. 수준 정보 분류 모듈은 진단 문제를 출력하고, 학습자가 상기 진단 문제를 풀이하여 입력한 진단 문제 풀이 정보의 오답 횟수 정보, 학습자의 음소별 입력 시간 정보, 진단 문제의 기설정된 레이블(자음 문제, 모음 문제, 음절 문제, 단어 문제)을 입력 정보로 하여 학습자의 수준을 분류하여 수준 정보를 출력하는 인공 신경망을 포 함하는 모듈이다. 수준 정보 분류 모듈의 출력 정보인 수준 정보는 한글 학습 시작 수준인 제1수준, 자모 인지 수준인 제2수준, 단어 인지 수준인 제3수준을 포함한 복수의 레이블로 구성될 수 있다. 진단 기준 설정 모듈은 수준 정보 분류 모듈에 의해 분류된 수준 정보를 기초로 한글 수준의 진단 기준 을 설정하여 진단 기준 정보를 생성하는 모듈이다. 진단 기준 설정 모듈에 의해 각 수준 정보에 따라 설정 되는 진단 기준이 상이하게 설정되는데, 학습자가 한글 학습 시작 수준으로 분류되는 경우에는 자음, 단모음 및 이중모음(ㅑ, ㅕ, ㅛ, ㅠ)에 대한 진단 기준인 제1진단 기준으로 설정되고, 학습자가 자모 인지 수준으로 분류되는 경우에는 제1진단 기준 및 쌍자음, 이중모음(ㅘ, ㅟ, ㅝ, ㅚ, ㅖ, ㅙ, ㅢ, ㅒ, ㅞ) 및 받침에 대한 진단 기준인 제2진단 기준으로 설정되며, 학습자가 단어 인지 수준인 경우에는 제2진단 기준에서 음절의 비율을 상승 시킨 기준인 제3진단 기준으로 설정되도록 구성될 수 있다. 진단 평가 모듈은 진단 기준 설정 모듈에서 설정된 진단 기준 정보를 기초로 진단 문항을 생성하고, 상 기 진단 문항을 기초로 각 음소별/음절별 성취도를 측정하여 학습자를 평가하는 모듈이다. 본 발명의 일실시예 에 따른 각 음소별/음절별 성취도는 예를 들어, '가'라는 소리를 듣고 '가'라는 글자를 찾을 수 있는지, 찾는데 걸리는 시간은 어느 정도인지를 측정하는 지표 정보가다. 또한, 진단 평가 모듈은 진단 문항을 생성하면서 실시간으로 진단 평가를 수행하여 진단 문항의 난이도 또 는 수를 조절하도록 구성될 수 있다. 진단 평가 모듈은 진단 문항의 제한 시간을 조절하여 진단 문항의 난 이도를 조절하도록 구성될 수 있다. 또한, 진단 평가 모듈은 수행된 진단 평가에서 특정 수준 이상으로 평 가되는 경우, 기설정된 개수의 진단 문항을 건너뛰거나 진단을 종료하도록 구성될 수 있다. 본 발명의 변형예에 따른 인공지능 기반의 유아 한글 수준 진단 장치와 관련하여, 도 3은 본 발명의 변형예 에 따른 인공지능 기반의 유아 한글 수준 진단 장치를 도시한 모식도이다. 도 3에 도시된 바와 같이, 본 발 명의 변형예에 따른 인공지능 기반의 유아 한글 수준 진단 장치는, 진단 문제 출력 모듈, 임베딩 모듈 , 수준 정보 생성 모듈을 포함할 수 있다. 진단 문제 출력 모듈은 음소(자음, 모음과 같이 하나의 음운적 분절음을 내는 요소)를 한글의 General Corpus 에서의 출현 빈도를 기초로 학습자 클라이언트에 진단 문제로 출력하거나, 음절(음의 한 마디. 단어 또 는 단어의 일부를 이루며 하나의 종합된 음의 느낌을 주는 음의 단위 요소)을 한글의 General Corpus 에서의 출 현 빈도를 기초로 진단 문제로 학습자 클라이언트에 출력하는 모듈이다. 예를 들어, 해당 유아 한글 학습 애플 리케이션 모듈을 처음 이용하는 학습자가 유아 한글 학습 애플리케이션 모듈에 접속하면, 기설정되어 있거나 General Corpus 에서의 출현 빈도를 기초로 선정되는 음소 정보(예를 들어, ㄱ,ㄴ,ㅏ,ㅓ)를 기초로 진단 문제를 학습자 클라이언트의 유아 한글 학습 애플리케이션 모듈에 출력하도록 구성될 수 있다. 임베딩 모듈은 모든 음소를 텍스트 정보 벡터화 기법(Bag of Words, n-gram, TF-IDF, Word2Vec)으로 벡터 화하고, 전체 음소 중 진단 문제에 해당하는 벡터에 해당 학습자의 해당 진단 문제의 음소에 대한 성취도 정보 를 병합하여 임베딩 정보를 생성하는 모듈이다. 본 발명의 일실시예에 따른 성취도 정보는 해당 진단 문제를 기 초로 학습자 클라이언트에서 입력된 진단 문제 풀이 정보(음소 입력 시간, 오답 횟수 등)의 전체 학습자의 음소 입력 시간/오답 횟수에 대한 분포를 기초로 계산한 정보를 의미할 수 있다. 예를 들어, A라는 학습자가 'ㄱ'이 라는 음소에 대하여 음소 입력 시간이 1.5초(진단 문제 풀이 정보)이고 이러한 음소 입력 시간은 전체 학습자 중 상위 40%의 분포를 나타낼 때, 학습자 A의 성취도 정보는 0.6으로 생성될 수 있다. 이후 임베딩 모듈은 학습자 A의 'ㄱ'의 벡터에 성취도 정보 0.6을 병합한 임베딩 정보를 생성하도록 구성될 수 있다. 도 4는 본 발명의 변형예에 따른 임베딩 모듈를 도시한 모식도이다. 임베딩 모듈은, 전체 음소에 대하 여 첫소리(초성), 가운뎃소리(중성), 끝소리(종성)를 축으로 하는 3차원 매트릭스(또는 초성-자음, 초성-쌍자음, 중성-모음, 중성-쌍모음, 종성-자음, 종성-홑받침, 종성-곁받침을 축으로 하는 6차원 매트릭스)를 생성하고, 전체 음소 중 진단 문제에 해당하는 음소에 대해 해당 학습자의 각 음소에 대한 성취도 정보(또는, 진단 문제 풀이 정보)를 병합하여 임베딩 정보(성취도 매트릭스)를 생성할 수 있다. 아래 표 1은 임베딩 정보 (성취도 매트릭스)의 일부를 도시한 예시이다. 아래 표 1에 도시된 바와 같이, 성취도 매트릭스는 전체 음소에 대해 각각 페어와이즈(pair-wise)하게 구성될 수 있다. 표 1 성취도 매트릭스 예 시0 ㄱ ㄴ ㄷ 0 0 0.8 0.5 0.4 ㅏ 0.5 0.2 0.3 0.1 ㅑ 0.6 0.5 0.8 0.4 ㅓ 0.7 0.2 0 0 수준 정보 생성 모듈은 임베딩 모듈에서 생성된 임베딩 정보를 기초로 진단 문제의 음소 이외의 나머지 전체 음소에 대해 성취도 정보를 예측하여 예측 성취도 정보를 생성하고, 나머지 전체 음소에 대해 상기 예측 성취도 정보가 병합된 정보인 수준 정보를 생성하는 모듈이다. 수준 정보 생성 모듈의 나머지 전체 음소에 대한 성취도 정보의 예측과 관련하여, 도 5는 본 발명의 변형예 에 따른 수준 정보 생성 모듈의 인공신경망을 도시한 모식도이다. 도 5에 도시된 바와 같이, 수준 정보 생 성 모듈은 기존 학습자들의 일부 음소에 대한 성취도 정보(또는, 진단 문제 풀이 정보)인 입력 성취도 매트 릭스를 입력 정보로 하고, 나머지 전체 음소 각각에 대한 성취도 정보(또는 진단 문제 풀이 정보)를 출력 정보 로 하여 기학습된 인공신경망을 포함할 수 있다. 특히, 수준 정보 생성 모듈의 인공신경망 모듈은 출력층 (output layer)의 노드가 나머지 전체 음소 각각에 대응되도록 복수개로 구성되어 각각의 음소에 대한 예측 성 취도 정보(또는 진단 문제 풀이 정보)를 출력하도록 구성되며 실제 성취도 정보와의 차이(에러, error)를 기초 로 Back Propagation 되어 각 노드의 가중치가 학습 될 수 있다. 수준 정보 생성 모듈의 인공신경망에서 출 력된 나머지 전체 음소 각각에 대한 예측 성취도 정보(또는 진단 문제 풀이 정보)는 임베딩 모듈에 입력되 어 출력 성취도 매트릭스를 생성하게 되고, 수준 정보 생성 모듈은 출력 성취도 매트릭스와 입력 성취도 매 트릭스를 병합하어 전체 음소에 대한 성취도 정보(또는 진단 문제 풀이 정보)를 포함하는 수준 정보를 생성하도 록 구성될 수 있다. 수준 정보 생성 모듈의 나머지 전체 음소에 대한 성취도 정보의 예측의 제1변형예와 관련하여, 수준 정보 생성 모듈은 해당 학습자의 일부 음소에 대한 성취도 정보(또는, 진단 문제 풀이 정보)인 입력 성취도 매트 릭스를 기초로 주변 음소(또는, 관련 음소)에 대한 예측 성취도 정보(또는, 진단 문제 풀이 정보의 예측값)를 순차적으로 생성하여 출력 성취도 매트릭스를 출력하는 RNN(Recurrent Neural Network)이나 LSTM(Long-Short Term Memory)을 포함할 수 있다. 도 6은 본 발명의 제1변형예에 따른 수준 정보 생성 모듈의 RNN 모듈을 도 시한 모식도이다. 도 6에 도시된 바와 같이, 수준 정보 생성 모듈의 RNN 모듈은 학습자들의 특정 음소에 대 한 성취도 정보(또는, 진단 문제 풀이 정보)인 입력 성취도 매트릭스를 입력 정보로 하고, 주변 음소(또는, 관 련 음소)에 대한 성취도 정보를 포함한 출력 성취도 매트릭스를 출력 정보로 하여 기학습된 RNN 으로 구성될 수 있다. 본 발명의 제1변형예에 따른 수준 정보 생성 모듈의 RNN 모듈의 hidden layer인 현재인 시간 t 상태 (state)의 hidden vector는 이하 수학식 1과 같이 이전 시간인 t-1의 상태(state)와 입력 벡터의 함수로 업데이 트 되도록 구성될 수 있다. 수학식 1"}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "위 수학식에서, ht는 시간 t의 Hidden vector, Whh는 이전 시간인 t-1의 Hidden vector ht-1에 대한 가중치, wxh 는 시간 t의 입력 벡터 xt에 대한 가중치, bh는 상수를 의미할 수 있다. 본 발명의 제1변형예에 따른 주변 음소 또는 관련 음소는, 첫소리(초성), 가운뎃소리(중성), 끝소리(종성)를 축 으로 하는 매트릭스 상에서 특정 음소에 해당하는 픽셀의 인근 픽셀에 대응되는 음소를 의미하거나, 텍스트 정 보 벡터화 기법(Bag of Words, n-gram, TF-IDF, Word2Vec)으로 벡터화 하였을 때 상호 거리가 가까운 음소를 의미할 수 있다. 본 발명의 제1변형예에 따르면, 아래의 단계로 수준 정보가 생성될 수 있다. 해당 학습자의 일부 음소에 대한 성취도 정보(또는, 진단 문제 풀이 정보)를 포함하고 첫소리(초성), 가운 뎃소리(중성), 끝소리(종성)를 축으로 하는 3D matrix(입력 성취도 매트릭스) 생성. 특히 해당 일부 음소에 대 한 성취도 정보(또는 진단 문제 풀이 정보)의 위치는 3D matrix의 Convolution 곱이 진행되는 방향으로 구성 일부 음소에 대한 성취도 정보를 포함하는 입력 성취도 매트릭스를 수준 정보 생성 모듈의 RNN 모듈에 입력. 이때 RNN 모듈은 예측하고자 하는 Future pixel의 data가 입력 정보로 입력되는 것을 방지하기 위하여, 예측하고자 하는 Future Pixel이 마스크된 커널(Masked Kernal, Masked Convolution, Masked Filter)을 구성. 즉, RNN 모듈에 입력 벡터 xt 입력 RNN 모듈이 예측 대상이 되는 Pixel인 주변 음소(또는, 관련 음소)에 대한 성취도 정보를 예측하여 상기 주 변 음소(또는, 관련 음소)에 대한 예측 성취도 정보(또는, 진단 문제 풀이 정보의 예측값)를 출력(yt)하고, 상 기 예측 성취도 정보(또는, 진단 문제 풀이 정보의 예측값)을 포함하여 입력 성취도 매트릭스 업데이트. 시간 t의 상태(state)인 ht 및 입력 성취도 매트릭스에 마스크된 커널을 구성한 입력 벡터 xt 을 기초로 RNN 모듈을 업데이트하고, 업데이트 된 입력 성취도 매트릭스를 업데이트 된 RNN 모듈에 다시 Feed. 1~4를 반복하여 나머지 전체 음소에 대한 예측 성취도 정보(또는, 진단 문제 풀이 정보의 예측값)인 출력 성취도 매트릭스를 생성하고, 입력 성취도 매트릭스와 출력 성취도 매트릭스가 병합된 3D matrix 인 수준 정보 출력 본 발명의 제1변형예에 따르면, 기존 학습자들의 전체 음소에 대한 수준 정보를 기초로 한 학습 속도가 상대적 으로 빠른 효과가 발생되고, 각 음소에 대한 성취도를 예측하는 것을 트래킹할 수 있는 효과가 있다. 또한, 비 교적 학습이 안정적으로 진행될 수 있는 효과가 있다. 수준 정보 생성 모듈의 나머지 전체 음소에 대한 성취도 정보의 예측의 제2변형예와 관련하여, 수준 정보 생성 모듈은 해당 학습자의 일부 음소에 대한 성취도 정보(또는, 진단 문제 풀이 정보)인 입력 성취도 매트 릭스를 기초로 나머지 전체 음소에 대한 예측 성취도 정보(또는, 진단 문제 풀이 정보의 예측값)인 출력 성취도 매트릭스를 포함하는 수준 정보를 생성하는 모듈인 생성 모듈, 그리고 해당 생성 모듈에 의해 생성된 수준 정보 가 기존 학습자들의 전체 음소에 대한 수준 정보와 유사한지를 구분하여 생성 모듈을 학습시키는 인코더인 구분 모듈를 포함할 수 있다. 도 7은 본 발명의 제2변형예에 따른 수준 정보 생성 모듈의 인공신경망 모듈인 생 성 모듈 및 구분 모듈을 도시한 모식도이다. 도 7에 도시된 바와 같이, 수준 정보 생성 모듈은 생성 모듈 및 구분 모듈을 포함할 수 있다. 생성 모듈은 VAE, GAN 등의 인코더 및 디코더로 구성된 이미지 제너레이터로 구성될 수 있다. 생성 모듈 의 추론 단계(inference)에서는 학습자의 일부 음소에 대한 성취도 정보(또는, 진단 문제 풀이 정보)인 입 력 성취도 매트릭스를 입력 정보로 수신하고, 상기 일부 음소를 제외한 나머지 전체 음소에 대한 예측 성취도 정보(또는 진단 문제 풀이 정보의 예측값)를 포함한 벡터인 출력 성취도 매트릭스를 생성하고, 상기 입력 성취 도 매트릭스와 상기 출력 성취도 매트릭스를 병합하여 전체 음소에 대한 성취도 매트릭스인 수준 정보를 생성하 도록 구성된다. 생성 모듈의 학습 단계(training)에서는 구분 모듈에 의해 생성 모듈이 학습되게 되며, 생성 모 듈이 기존 학습자의 일부 음소에 대한 성취도 정보(또는 진단 문제 풀이 정보)를 포함하는 벡터인 입력 성 취도 매트릭스를 입력 정보로 수신하여 상기 일부 음소를 제외한 나머지 전체 음소에 대한 예측 성취도 정보(또 는 진단 문제 풀이 정보의 예측값)를 포함하는 벡터인 출력 성취도 매트릭스를 생성하고 상기 입력 성취도 매트 릭스와 상기 출력 성취도 매트릭스를 병합하여 상기 수준 정보를 생성하면 ConvNet 인코더인 구분 모듈에 서 생성된 상기 수준 정보가 기존의 실제 학습자들의 수준 정보와 유사한 매트릭스인지 구분(분류)하게 되며, 생성 모듈에 의해 생성된 수준 정보가 구분 모듈에서 기존의 실제 학습자들의 수준 정보와 유사한 매 트릭스가 아닌 것으로 구분되게 되는 경우, 생성 모듈에 의해 생성된 수준 정보와 구분 모듈에서 기 존의 실제 학습자들의 수준 정보의 차이(Cross entropy 등 적용)를 기초로 에러(error)를 출력하여 생성 모듈 을 업데이트하는 방법(예를 들어, Back Propagation)으로 구분 모듈의 출력값에 의해 생성 모듈(15 0)이 학습되게 된다. 이에 따르면, 생성 모듈은 학습 배치가 진행될수록 기존의 실제 학습자들의 수준 정 보와 유사한 매트릭스를 출력하게 되는 효과가 발생된다. 도 8은 본 발명의 제2변형예에 따른 구분 모듈인 ConvNet 인코더의 예를 도시한 모식도이다. 도 8에 도시 된 바와 같이, 구분 모듈인 ConvNet 인코더는 [INPUT-CONV-RELU-POOL-FC]으로 구축될 수 있다. 입력 정보 인 생성된 수준 정보의 경우, 첫소리(초성), 가운뎃소리(중성), 끝소리(종성)으로 depth가 구성되는 경우 초성 의 가지수인 19자, 중성의 가지수인 21자, 종성의 가지수인 27자를 포함할 수 있도록 INPUT vector 인 수준 정 보가 가로 32, 세로 32, 그리고 초성-중성-종성 채널을 가지고 입력의 크기는 [32x32x3]인 매트릭스로 구성될 수 있다. CONV 레이어(Conv. Filter, 101)는 수준 정보의 일부 영역과 연결되어 있으며, 이 연결된 영역과 자신 의 가중치의 내적 연산(dot product)을 계산하게 된다. 결과 볼륨은 [32x32x12]와 같은 크기를 갖게 된다. RELU 레이어는 max(0,x)와 같이 각 요소에 적용되는 액티베이션 함수(activation function)이다. RELU 레이어는 볼륨의 크기를 변화시키지 않는다([32x32x12]). 그 결과 Activation map 1 을 생성한다. POOL 레이어 (pooling, 103)는 \"가로,세로\" 차원에 대해 다운샘플링(downsampling)을 수행해 [16x16x12]와 같이 줄어든 볼 륨(Activation map 2, 104)을 출력한다. n번째 Activation map n과 연결된 FC(fully-connected) 레이어 는 클래스 점수들을 계산해 [1x1x1]의 크기를 갖는 볼륨(output layer, 107)을 출력한다. output layer에서는 생성 모듈에서 생성되어 입력된 수준 정보가 기존의 학습자들의 수준 정보와 유사한 것으로 분류되는지, 아니면 기존의 학습자들의 수준 정보와 유사하지 않은 것으로 분류되는지를 출력하게 된다. FC 레이어는 이전 볼륨의 모든 요소와 연결되어 있다. 이와 같이, 구분 모듈의 ConvNet은 특정 음소에 해당되는 성취도에 대한 픽셀 값으로 이뤄진 원본 매트릭 스인 수준 정보를 각 레이어를 거치며 클래스 점수(기존의 학습자들의 수준 정보와의 유사도)로 변환 (transform)시킨다. 어떤 레이어는 모수 (parameter)를 갖지만 어떤 레이어는 모수를 갖지 않는다. 특히 CONV/FC 레이어들은 단순히 입력 볼륨만이 아니라 가중치(weight)와 바이어스(bias)도 포함하는 액티베이션 (activation) 함수이다. 반면 RELU/POOL 레이어들은 고정된 함수이다. CONV/FC 레이어의 모수 (parameter)들은 각 매트릭스에 대한 클래스 점수가 해당 매트릭스의 레이블과 같아지도록 그라디언트 디센트(gradient descen t)로 학습된다. CONV 레이어의 모수(parameter)들은 일련의 학습가능한 필터들로 이뤄져 있다. 각 필터는 가로/세로 차원으로는 작지만 깊이 (depth) 차원으로는 전체 깊이를 아우른다. 포워드 패스(forward pass) 때에는 각 필터를 입력 볼 륨의 가로/세로 차원으로 슬라이딩시키며(정확히는 convolve 시키며) n차원의 액티베이션 맵 (activation map) 을 생성한다. 필터를 입력 위로 슬라이딩 시킬 때, 필터와 입력 볼륨 사이에서 내적 연산(dot product)이 이뤄 진다. 이러한 과정으로 ConvNet은 입력 정보의 특정 위치의 특정 패턴에 대해 반응하는(activate) 필터를 학습 하게 된다. 이런 액티베이션 맵(activation map)을 깊이(depth) 차원으로 쌓은 것이 곧 출력 볼륨이 된다. 그러 므로 출력 볼륨의 각 요소들은 입력의 작은 영역만을 취급하고, 같은 액티베이션 맵 내의 뉴런들은 같은 필터를 적용한 결과이므로 같은 모수들을 공유한다. 본 발명의 제2변형예에 따르면, 비교적 해당 학습자의 성취도 수준에 대한 예측 정확도가 높고, 몇 가지 음소로 구성된 진단 문제만으로도 높은 정확도로 나머지 음소에 대한 성취도를 예측할 수 있는 효과가 있다. 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치 도 9는 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 맞춤형 커리큘럼 출력 장치를 도시한 모식도이다. 도 9에 도시된 바와 같이, 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치는, 커리큘럼 선정 모듈, 반복 횟수 조정 모듈, 영역 비율 조정 모듈, 커리큘럼 출력 모듈을 포함할 수 있다. 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치 는 특정 웹서버, 클라우드 서버와 같은 가상 서버, 스마트폰, 태블릿 PC, 데스크탑 PC 등의 컴퓨팅 장치의 처리모듈에 의해 처리되고, 각 장치의 메모리 모듈에 저장되도록 구성될 수 있다. 커리큘럼 선정 모듈은, 상기 진단 평가 모듈에서 생성된 음소별/음절별 성취도를 기초로 전체 커리큘럼 상에서의 학습자의 현재 수준에 맞는 커리큘럼을 선정하여 커리큘럼 정보를 생성하는 모듈이다. 본 발명의 일실 시예에 따른 커리큘럼 정보는 적어도 하나 이상의 학습할 음소/학습할 음절로 구성된 문제에 대한 정보인 음소 정보, 반복 횟수 정보, 영역 비율 정보(초성, 중성, 종성, 자음, 쌍자음 등의 영역), 게임, 이미지, 영상 등의 교육 방법인 콘텐츠 종류 정보, 속도 정보, 시간 제한 정보, 학습 순서 정보 등의 속성 및 해당 속성에 대한 정 보를 포함한 학습 세션(문제)에 대한 정보로 구성될 수 있다. 반복 횟수 조정 모듈은, 상기 커리큘럼 선정 모듈에서 선정된 커리큘럼 정보 및 음소별/음절별 성취도 정보(또는 수준 정보)를 기초로, 해당 커리큘럼의 반복 횟수를 조정하여 반복 횟수 정보를 생성하는 모듈이다. 본 발명의 일실시예에 따른 반복 횟수 조정 모듈은 상기 커리큘럼 선정 모듈에서 선정된 커리큘럼에 대 해 음소별/음절별 성취도 정보가 상대적으로 높은 수준인 경우 반복 횟수를 기설정된 횟수보다 상대적으로 낮은 횟수로 조정하고, 상기 커리큘럼 선정 모듈에서 선정된 커리큘럼에 대해 음소별/음절별 성취도 정보가 상대 적으로 낮은 수준인 경우 반복 횟수를 기설정된 횟수보다 상대적으로 높은 횟수로 조정하는 모듈이다. 영역 비율 조정 모듈은, 상기 커리큘럼 선정 모듈에서 선정된 커리큘럼 정보 및 음소별/음절별 성취도 정보(또는 수준 정보)를 기초로, 해당 커리큘럼의 영역 비율을 조정하여 영역 비율 정보를 생성하는 모듈이다. 영역 비율 조정 모듈에서 조정되는 영역 비율이란, 모음, 자음, 받침, 이중모음, 쌍자음, 초성, 중성, 종성등의 영역이 커리큘럼에 출력될 각 영역 사이의 비율로서, 커리큘럼에 출력될 확률 가중치로 이용될 수 있다. 커리큘럼 출력 모듈은, 커리큘럼 선정 모듈에서 생성된 커리큘럼 정보를 상기 반복 횟수 조정 모듈 및 영역 비율 조정 모듈에서 생성된 반복 횟수 정보와 영역 비율 정보를 기초로 조정하고, 조정된 커리큘럼 정보에 따라 문제 정보를 출력하는 모듈이다. 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치의 커리큘럼 선정 모듈 와 관련하여, 도 10은 본 발명의 일실시예에 따른 커리큘럼 선정 모듈의 인공신경망 모듈을 도시한 모 식도이다. 도 10에 도시된 바와 같이, 본 발명의 일실시예에 따른 커리큘럼 선정 모듈의 인공신경망 모듈은, 인공지능 기반의 유아 한글 수준별 진단 평가 장치의 변형예에서 수신한 수준 정보와 해당 커리큘럼 에 출력하고자 하는 문제가 되는 음소나 음절에 대한 vector인 음소 정보를 입력 정보로 하고, 학습자가 해당 음소 정보를 기반으로 한 커리큘럼을 학습한 뒤에 예상되는 수준 정보의 변화율(각 음소에 대한 성취도 정보의 변화율의 총합)을 출력 정보로 하는 인공신경망으로 구성될 수 있다. 본 발명의 변형예에 따른 커리큘럼 선정 모듈의 학습 단계에서는 기존 학습자의 수준 정보와 적어도 하나 이상의 음소로 구성된 vector인 음소 정보 를 입력 정보로 하고, 출력 정보로 예상되는 수준 정보의 변화율과 실제 수준 정보의 변화율의 차이(에러, error)를 Back Propagation 하여 인공신경망을 학습시킬 수 있다. 본 발명의 일실시예에 따른 커리큘럼 선정 모듈의 인공신경망 모듈에 따르면 특정 학습자의 수준 정보에 대 해 특정 음소 정보를 커리큘럼으로 하였을 때 예상되는 수준 정보의 변화율이 출력되게 되고, 커리큘럼 선정 모 듈은 상호 다양한 음소/음절의 조합으로 구성된 복수개의 음소 정보에 대하여 예상되는 수준 정보의 변화율 을 출력하고 특정 값 이상의 수준 정보 변화율이 출력되는 적어도 하나의 음소 정보를 기초로 커리큘럼 정보를 생성하도록 구성될 수 있다. 본 발명의 일실시예에 따른 커리큘럼 선정 모듈은 구체적으로 아래의 단계로 커리큘럼 정보를 생성할 수 있 다. 특정 학습자의 수준 정보와 특정 음소 정보를 병합한 입력 벡터를 복수개 생성 생성된 복수개의 입력 벡터를 커리큘럼 선정 모듈의 인공신경망 모듈에 입력 복수개의 음소 정보에 대해 각각 수준 정보 변화율 출력 특정 값 이상의 수준 정보 변화율이 출력되는 적어도 하나의 음소 정보를 선정 선정된 음소 정보를 기초로 커리큘럼 정보 생성 커리큘럼이 종료된 후, 학습자의 성취도 정보를 기초로 학습자의 수준 정보 업데이트(Moving average 등 이 용) 업데이트 된 수준 정보를 기초로 1단계에서 다시 시작 본 발명의 일실시예에 따른 커리큘럼 선정 모듈에 따르면, 매 커리큘럼마다 학습자의 성취도를 가장 상승시 킬 수 있는 음소와 음절을 기초로 하는 학습 커리큘럼이 생성될 수 있는 효과가 발생된다. 본 발명의 변형예에 따른 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치의 커리큘럼 선정 모듈 와 관련하여, 도 11은 본 발명의 변형예에 따른 커리큘럼 선정 모듈의 강화학습을 도시한 모식도이다. 도 11에 도시된 바와 같이, 본 발명의 변형예에 따른 커리큘럼 선정 모듈은 강화학습에 의해 커리큘럼의 음소 정보 선정이 업데이트 되도록 구성될 수 있다. 강화학습의 관점에서, 본 발명의 변형예에 따른 커리큘럼 선정 모듈의 Objective는 커리큘럼의 학습 이후의 수준 정보 변화량을 향상시키는 것이고, 상태(State) 및 환경 (Environment)는 해당 학습자의 수준 정보(각 음소별 성취도 정보)를 의미할 수 있고, 액션(Action)은 커리큘럼 선정 모듈의 음소 정보 선정을 의미할 수 있으며, 보상(Reward)은 선정된 음소 정보를 기초로 한 커리큘럼 정보를 학습한 이후 학습자의 수준 정보의 변화량을 의미할 수 있다. 본 발명의 변형예에 따라 커리큘럼 선정 모듈의 음소 정보 선정이 강화학습에 의해 학습되게 되면, 학습자들이 커리큘럼 선정 모듈에 의해 선정 된 커리큘럼을 학습하면 할수록 학습자의 수준 정보를 보다 향상시킬 수 있는 커리큘럼을 선정할 수 있게 되는 효과가 발생된다. 즉, 커리큘럼 선정 모듈의 향상을 위해 한명의 학습자에 대해 많은 커리큘럼 학습 정보가반드시 필요한 것이 아니라, 여러명의 학습자에 대해 커리큘럼 학습 정보가 발생되는 경우에도 커리큘럼 선정 모듈을 강화학습 할 수 있게 되는 것이다. 본 발명의 변형예에 따른 커리큘럼 선정 모듈은 아래의 구성에 의해 보다 효과적인 강화학습에 의해 커리큘 럼의 음소 정보 선정이 업데이트 되도록 구성될 수 있다. 도 12는 본 발명의 변형예에 따른 커리큘럼 선정 모듈 을 도시한 모식도이다. 도 12에 도시된 바와 같이, 본 발명의 변형예에 따른 커리큘럼 선정 모듈은 특 정 상태에서의 가치를 출력하는 가치 함수를 학습하는 인공신경망인 가치망 및 커리큘럼 정보의 각 속성의 확률을 출력하는 정책 함수를 학습하는 정책망을 포함할 수 있고, 본 발명의 변형예에 따른 정책망 및 가치망은 수준 정보 변화율을 예측하는 커리큘럼 선정 모듈의 인공신경망 모듈에 연결되도록 구성 될 수 있다. 또한, 정책망과 가치망은 최적 커리큘럼 탐색 모듈과 연결되어 선정된 커리큘럼 속성 정 보를 출력할 수 있다. 정책망은 커리큘럼 선정 모듈의 각 상태에서 선정된 커리큘럼의 특정 속성들(음소 정보, 반복 횟수 정 보, 영역 정보, 학습 시간 정보, 콘텐츠 종류 정보 등)의 확률을 결정하는 인공신경망이고, 정책 함수를 학습하 여 선정된 커리큘럼 속성 확률을 출력하게 된다. 정책망의 Cost function은 정책함수와 가치망의 Cost Function 을 곱하여 크로스 엔트로피(Cross Entropy)를 계산한 뒤 Policy gradient를 취한 함수일 수 있고, 예를 들면, 아래 수학식 2와 같이 구성될 수 있다. 정책망은 크로스 엔트로피와 가치망의 cost function인 시간차 에러의 곱을 기초로 back propagation 될 수 있다. 수학식 2"}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 1에서, π는 정책 함수, θ는 정책망 파라미터, πθ(ai│si)는 현재 에피소드에서 특정 액션(특정 속성의 커리큘럼)을 할 가능성, V는 가치 함수, w는 가치망 파라미터, si는 현재 에피소드인 i의 상태 정보, Si+1은 다 음 에피소드인 i+1의 상태 정보, ri+1은 다음 에피소드에서 획득하는 것으로 예상되는 보상, Vw(si)는 현재 에피 소드에서의 보상 가능성, Vw(si+1)는 다음 에피소드에서의 보상 가능성, γ는 감가율을 의미할 수 있다. 이때, ri+1은 수준 정보 변화율을 예측하는 인공신경망 모듈에서 수신하도록 구성될 수 있다. 결국, 본 발명의 일실시 예에 따른 정책망은 Policy gradient를 통해 초기에는 학습자의 커리큘럼 히스토리를 모사하는 커리큘럼 속성을 출력하게 된다. 본 발명의 일실시예에 따른 정책망은 강화학습이 진행되기 이전에 기존의 커리큘럼 속성 정보(음소 정보, 반복 횟수 정보, 영역 정보, 학습 시간 정보, 콘텐츠 종류 정보 등)와 이에 따른 성과 정보(수준 정보 변화율) 를 기초로 지도학습(Supervised Learning)되어 정책망의 weight가 업데이트 됨으로써 정책의 기초를 학습할 수 있다. 즉, 정책망의 weight는 기존의 커리큘럼 속성 정보 및 성과 정보를 토대로 지도학습되어 설정될 수 있다. 이에 따르면, 기존의 커리큘럼의 기록에 의해 정책망이 매우 빠르게 학습될 수 있는 효과가 발생된다. 또한, 본 발명의 일실시예에 따르면 정책망의 지도학습 시에 랜덤 벡터를 포함하여 기존의 커리큘럼 속성 정보와 이에 따른 성과 정보를 기초로 지도학습이 되도록 구성될 수 있다. 랜덤 벡터는 예를 들면 가우시안 확 률 분포(Gaussian distribution)를 이용할 수 있다. 이에 따르면, 정책망이 랜덤한 확률로 도전적인 커리큘럼 정책을 출력할 수 있게 되는 효과가 발생된다. 정책망의 지도학습 시에 기존의 커리큘럼 속성 정보와 이에 따른 성과 정보를 기초로 지도학습이 되도록 구성하면 커리큘럼의 선정이 기존의 정책 내에서 최적화되는 결과 가 나타나게 된다. 하지만, 본 발명의 일실시예에 따라 정책망의 지도학습 시에 랜덤 벡터를 포함하게 되면 강 화학습이 진행될수록 정책망이 기존의 정책보다 더 효과적인 커리큘럼을 학습할 수 있게 되는 효과가 발생된다. 가치망은 커리큘럼 선정 모듈이 가질 수 있는 각 상태(State)에서 보상(Reward)을 달성할 가능성을 도 출하는 인공신경망이고, 가치 함수를 학습하게 된다. 가치망은 에이전트(agent)인 커리큘럼 선정 모듈(2 0)이 어떤 방향으로 업데이트 될 지에 대한 방향성을 제시해주게 된다. 이를 위해, 가치망의 입력 변수는 커리큘럼 선정 모듈의 상태에 대한 정보인 상태 정보로 설정되고, 가치망의 출력 변수는 커리큘럼 선정 모듈이 보상을 달성할 가능성인 보상 가능성 정보(수준 정보 변화율)로 설정될 수 있다. 본 발명의 일실 시예에 따른 보상 가능성 정보는 아래 수학식과 같은 Q-function으로 계산될 수 있다. 수학식 3"}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "위 수학식 3에서 Qπ는 특정 정책 π에서 상태 s, 액션 a인 경우 미래에 예상되는 전체 보상 가능성 정보를 의미 하고, R은 특정 기간의 보상, gamma는 감가율을 의미할 수 있다. St는 시간 t의 상태, At는 시간 t의 액션, E는 기대값을 의미할 수 있다. 본 발명의 일실시예에 따른 보상 가능성 정보(Q value)는 정책망의 업데이트 방 향 및 크기를 규정하게 된다. 이때, 가치망의 Cost function은 가치 함수에 대한 MSE(Mean Square error) 함수일 수 있고, 예를 들면 아래 수학식 4와 같이 구성될 수 있다. 가치망은 가치망의 cost function인 시간차 에러를 기초로 back propagation 될 수 있다. 수학식 4"}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 4에서, V는 가치 함수, w는 가치망 파라미터, si는 현재 에피소드인 i의 상태 정보, Si+1은 다음 에피소 드인 i+1의 상태 정보, ri+1은 다음 에피소드에서 획득하는 것으로 예상되는 보상, Vw(si)는 현재 에피소드에서의 보상 가능성, Vw(si+1)는 다음 에피소드에서의 보상 가능성, γ는 감가율을 의미할 수 있다. 이때, ri+1은 수준 정 보 변화율을 예측하는 인공신경망 모듈에서 수신하도록 구성될 수 있다. 이에 따라, 가치망은 커리큘럼 선정 모듈의 상태가 변경될 때 수학식 4의 Cost Function을 Gradient descent 시키는 방향으로 업데이트 할 수 있다. 본 발명의 일실시예에 따르면 가치망을 정책망과 별도로 학습시키면서, 가치망의 Q value가 랜덤에서 시작하지 않고 Supervised되게 되므로 빠른 학습이 가능해지는 효과가 발생된다. 이에 따르면 매우 복잡도가 높은 커리큘 럼 속성의 조합을 선택하는 액션(action)에 있어서 탐구(exploration) 부담을 크게 줄일 수 있게 되는 효과가 발생된다. 본 발명의 일실시예에 따른 커리큘럼 선정 모듈에 따르면, 지도학습을 마친 정책망이 현재 에피소드 i 의 커리큘럼 속성을 선정하게 되면 가치망이 선정된 커리큘럼 속성을 진행할 경우의 보상(수준 정보의 변 화율)을 예측하도록 학습된다. 학습을 마친 커리큘럼 선정 모듈의 정책망과 가치망은 최적 커리 큘럼 탐색 모듈을 활용한 시뮬레이션과 조합되어 최종적으로 커리큘럼 속성(음소 정보, 반복 횟수 정보, 영역 정보, 학습 시간 정보, 콘텐츠 종류 정보 등)을 선정하는데 활용된다. 또한, 본 발명의 일실시예에 따른 가치망에 따르면 선정된 커리큘럼 속성의 확률을 출력하는 정책망의 업 데이트가 매 에피소드마다 진행될 수 있는 효과가 발생된다. 기존의 강화학습에서는 강화학습 모델의 업데이트 가 모든 에피소드가 종료된 이후에 진행되는 문제가 있어서, 커리큘럼 선정 모델에 적용하는데는 어려움이 있었 다. 최적 커리큘럼 탐색 모듈은 정책망과 가치망에서 계산되는 복수의 에이전트(agent)를 기초로 다양한 상태 및 다 양한 액션에 대한 복수회의 시뮬레이션을 진행하여 최적의 커리큘럼 속성을 탐색하는 구성이다. 본 발명의 일실 시예에 따른 최적 커리큘럼 탐색 모듈은, 예를 들어, 몬테카를로 트리 탐색을 활용할 수 있고, 트리의 각 노드 는 상태(state)를, 각 연결(edge)은 해당 상태에 대한 특정 액션에 따라 예상되는 가치(value)를 나타내며, 현재 상태를 뿌리 노드로 두고 새로운 액션을 취해 새로운 상태로 전이될 때 마다 잎(leaf) 노드가 확장되는 구조 이다. 본 발명의 일실시예에 따른 최적 커리큘럼 탐색 모듈에서 최적 커리큘럼 탐색은 몬테카를로 트리 탐색이 활용되는 경우, Selection, Expansion, Evaluation, Backup의 4 단계로 처리될 수 있다. 최적 커리큘럼 탐색 모듈의 Selection 단계는, 현재 상태로부터 잎 노드가 나올 때까지 선택 가능한 액션 중 가 장 가치가 높은 액션을 선택하며 진행하는 단계이다. 이 때 연결(edge)에 저장해 둔 가치함수의 값과 탐구-이용 균형을 맞추기 위한 방문빈도 값을 이용한다. Selection 단계에서 액션 선택을 위한 수학식은 아래와 같다. 수학식 5"}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "위 수학식 5에서 at는 시간t에서의 액션(커리큘럼 수행)이고, Q(st,a)는 트리에 저장된 가치함수의 값이며, u(st,a)는 해당 상태-액션 쌍의 방문횟수에 반비례하는 값으로 탐구(exploration)와 이용의 균형을 맞추기 위해 사용된 것이다. 최적 커리큘럼 탐색 모듈의 Expansion 단계는, 시뮬레이션이 잎 노드까지 진행되면 지도학습으로 학습된 정책망 의 확률에 따라 액션하여 새로운 노드를 잎 노드로 추가하는 단계이다. 최적 커리큘럼 탐색 모듈의 Evaluation 단계는, 새로 추가된 잎 노드로부터 가치망을 사용해 판단한 가치(보상 가능성)와 잎 노드로부터 정책망을 사용해 커리큘럼 에피소드가 끝날 때까지 진행해 얻은 보상을 통해 잎 노드 의 가치를 평가하는 단계이다. 아래 수학식은 새로운 잎 노드의 가치를 평가하는 예시이다. 수학식 6"}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "위 수학식 6에서 V(sL)은 잎 노드의 가치, λ는 mixing 파라미터, vθ(sL)은 가치망을 통해 얻은 가치, zL은 시뮬 레이션을 계속하여 얻은 보상을 의미할 수 있다. 최적 커리큘럼 탐색 모듈의 Backup 단계는, 새로 추가된 잎 노드의 가치를 반영하여 시뮬레이션 중 방문한 노드 들의 가치를 재평가하고 방문 빈도를 업데이트하는 단계이다. 아래 수학식은 노드 가치 재평가 및 방문 빈도 업 데이트의 예시이다. 수학식 7"}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "위 수학식 7에서 sLi는 i번째 시뮬레이션에서의 잎 노드를, 1(s,a,i)는 i번째 시뮬레이션에서 연결 (s,a)를 방문 했는지를 나타내고, 트리 탐색이 완료되면 알고리즘은 뿌리 노드로부터 가장 많이 방문된 연결(s,a)을 선택하도 록 구성될 수 있다. 본 발명의 일실시예에 따른 최적 커리큘럼 탐색 모듈에 따르면 정책망에 의해 선별되는 복 수의 커리큘럼 속성에 대해 가치망을 기초로 복수회 시뮬레이션을 선행하여 최적의 커리큘럼 속성(음소 정보, 반복 횟수 정보, 영역 정보, 학습 시간 정보, 콘텐츠 종류 정보 등)을 선택할 수 있게되는 효과가 발생된다. 본 발명의 일실시예에 따르면, 복수의 에이전트(Agent)가 구성되도록 커리큘럼 선정 모듈이 구성될 수 있다. 복수의 에이전트가 구성되면 특정 상태, 특정 커리큘럼 속성 각각에 대해 커리큘럼 선정 모듈가 선정 하는 커리큘럼이 상호 경쟁하여, 가장 최적의 커리큘럼을 선정할 수 있게 되는 효과가 발생된다. 도 13은 본 발명의 일실시예에 따른 커리큘럼 선정 모듈의 동작예를 도시한 흐름도이다. 도 13에 도시된 바 와 같이, 복수의 학습자 클라이언트의 유아 한글 학습 애플리케이션 모듈에서 상태 정보를 트래킹하는 인공지능 기반의 유아 한글 수준별 진단 평가 장치에 의해 상태 s(t)가 입력되면 가치망에 의해 정책망의 복수개의 에이전트(agent)들에 의해 다양한 커리큘럼 속성들이 최적 커리큘럼 탐색 모듈에 입력되고, 최적 커리 큘럼 탐색 모듈에 의해 출력되는 액션(action)인 선정된 커리큘럼 속성 확률 a(t)에 의해 커리큘럼이 진행되는 것으로 에피소드 t가 종료되고 에피소드 t+1이 시작된다. 에피소드 t+1에서는 다시 a(t)에 의한 상태 변화인 s(t+1)이 인공지능 기반의 유아 한글 수준별 진단 평가 장치에 의해 입력되고, a(t)에 따른 보상인 r(t+1)이 곧바로 입력되어 가치망 및 정책망을 업데이트하게 된다. 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치 도 14는 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치를 도시한 모식도이다. 도 14에 도시된 바와 같이, 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치 는, 선호도 생성 모듈, 세부조정 모듈, 커리큘럼 출력 모듈을 포함할 수 있다. 본 발명의 일실시예 에 따른 인공지능 기반의 유아 한글 맞춤형 커리큘럼 출력 장치는 특정 웹서버, 클라우드 서버와 같은 가상 서버, 스마트폰, 태블릿 PC, 데스크탑 PC 등의 컴퓨팅 장치의 처리모듈에 의해 처리되고, 각 장치의 메모리 모 듈에 저장되도록 구성될 수 있다. 선호도 생성 모듈은 학습자의 커리큘럼의 수행 횟수, 각 커리큘럼의 성취도, 각 커리큘럼에 대한 학습자의 평가를 기초로 각 커리큘럼에 대한 선호도 정보를 생성하는 모듈이다. 세부조정 모듈은 선호도 생성 모듈에서 생성된 선호도 정보를 기초로 해당 커리큘럼의 각 속성을 세부 조정하여 세부조정 커리큘럼 정보를 생성하는 모듈이다. 본 발명의 일실시예에 따른 세부조정은 각 세션의 음소 /음절 재학습 및 재확인, 음소/음절 생략 또는 건너뛰기, 음소/음절 순서 변경, 반복 횟수 조정, 영역비율 조정 등을 의미할 수 있다. 커리큘럼 출력 모듈은 세부조정 모듈에서 생성된 세부조정 커리큘럼 정보를 기초로 세부조정된 커리큘 럼 정보를 학습자 클라이언트에 출력하는 모듈이다. 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치의 세부조정 커리큘럼 정보의 출력에 관한 변형예와 관련 하여, 인공지능 기반의 유아 한글 커리큘럼 생성 장치에서 생성된 커리큘럼 정보(음소 정보, 반복 횟수 정보, 영역 비율 정보, 콘텐츠 종류 정보 등)를 기초로 학습자 클라이언트의 유아 한글 학습 애플리케이션 모듈 에 유아 한글 커리큘럼을 출력한 뒤, 학습자의 입력에 의해 수신되는 문제 풀이 정보(음소 입력 시간, 오답 횟 수 등) 또는 해당 커리큘럼의 음소 정보에 대한 현재 성취도 정보를 기초로 학습자가 이탈할 가능성인 이탈 가 능성 정보를 예측하고, 이탈 가능성 정보를 기초로 커리큘럼 정보(음소 정보, 반복 횟수 정보, 영역 비율 정보, 콘텐츠 종류 정보 등)를 세부조정하도록 구성될 수 있다. 본 발명의 변형예에 따른 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치의 이탈 가능성 정보 예측과 관 련하여, 도 15는 본 발명의 변형예에 따른 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치의 인공신경망 모듈을 도시한 모식도이다. 도 15에 도시된 바와 같이, 본 발명의 변형예에 따른 인공지능 기반의 유아 한글 커 리큘럼 세부조정 장치의 인공신경망 모듈은 인공지능 기반의 유아 한글 커리큘럼 생성 장치에서 생성된 커리큘럼 정보(음소 정보, 반복 횟수 정보, 영역 비율 정보, 콘텐츠 종류 정보 등), 문제 풀이 정보(음소 입력 시간, 오답 횟수 등), 해당 학습자의 수준 정보, 해당 학습자의 수준 정보와 문제 풀이 정보에 의해 계산된 실제 성취도 정보와의 차이인 현재 집중도 정보를 입력 벡터로 하고, 이탈 가능성 정보를 출력 벡터로 구성할 수 있다. 해당 인공신경망 모듈의 학습 단계에서는 출력된 이탈 가능성 정보과 학습자의 실제 이탈 정보의 차이를 기초로 인공신경망 모듈을 학습하도록 구성될 수 있다. 본 발명의 변형예에 따르면, 매 커리큘럼의 종료 시, 또는 특정 시간, 또는 특정 커리큘럼 학습 횟수 이후마다 이탈 가능성 정보를 예측하도록 구성될 수 있고, 커리큘럼 생성 장치에서 생성된 커리큘럼 정보(수준 정보 변화량이 특정 값 이상 높을 것으로 예상되는 커리큘럼 정보)를 기초로 각각의 속성값(음소 정보, 반복 횟수 정 보, 영역 비율 정보, 콘텐츠 종류 정보 등)이 세부조정된 복수개의 후보 커리큘럼 정보를 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치의 인공신경망 모듈의 입력 벡터에 포함하여 입력하고, 각각의 후보 커리큘럼 정보에 대응되는 이탈 가능성 정보를 출력하도록 구성될 수 있다. 인공지능 기반의 유아 한글 커리큘럼 세부조 정 장치는 각각의 후보 커리큘럼 정보에 대응되는 이탈 가능성 정보를 기초로, 이탈 가능성 정보가 특정 값 이하(예를 들어, 이전 커리큘럼에서의 이탈 가능성 정보 이하)인 후보 커리큘럼 정보 중 적어도 하나를 세부조 정 커리큘럼 정보로서 출력하도록 구성될 수 있다. 본 발명의 변형예에 따르면, 인공지능 기반의 유아 한글 커리큘럼 생성 장치에서 생성된 커리큘럼 정보에 의 해 수준 정보 변화량이 특정 값 이상으로 높을 것으로 예상되는 커리큘럼들 중에서 이탈 가능성 정보가 특정 값 이하로 낮을 것으로 계산되는 커리큘럼으로 자동 세부조정 되는 효과가 발생된다. 또한, 학습자들의 현재 집중 도에 따라서 최적의 커리큘럼이 출력될 수 있는 효과가 발생된다."}
{"patent_id": "10-2019-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "인공지능 기반의 유아 한글 수준별 학습 세션 제공 방법 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 학습 세션 제공 방법과 관련하여, 도 16은 본 발 명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 학습 세션 제공 방법을 도시한 흐름도이다. 도 16에 도시된 바와 같이, 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 학습 세션 제공 방법은 진단 문제 출력 단계(S10), 진단 문제 풀이 정보 수신 단계(S11), 성취도 정보 생성 단계(S12), 수준 정보 생성 단계 (S13), 커리큘럼 정보 생성 단계(S14), 문제 풀이 정보 수신 단계(S15), 이탈 가능성 정보 생성 단계(S16), 세 부조정 커리큘럼 정보 생성 단계(S17)를 포함할 수 있다. 진단 문제 출력 단계(S10)는 인공지능 기반의 유아 한글 수준별 진단 평가 장치가 학습자 클라이언트에 특정 음소에 대한 진단 문제를 출력하는 단계이다. 진단 문제 풀이 정보 수신 단계(S11)는 인공지능 기반의 유아 한글 수준별 진단 평가 장치가 학습자 클라이 언트에서 상기 진단 문제에 대하여 입력된 진단 문제 풀이 정보(음소 입력 시간 정보, 오답 횟수 정보 등)를 수 신하는 단계이다. 성취도 정보 생성 단계(S12)는 인공지능 기반의 유아 한글 수준별 진단 평가 장치가 진단 문제에 대응되는 특정 음소에 대하여 성취도 정보를 생성하는 단계이다. 수준 정보 생성 단계(S13)는 인공지능 기반의 유아 한글 수준별 진단 평가 장치가 S12에서 생성된 특정 음소 에 대한 성취도 정보를 기초로 나머지 전체 음소에 대한 성취도 정보를 예측하고, 예측된 성취도 정보인 예측 성취도 정보를 기초로 해당 학습자의 전체 음소에 대한 성취도 정보인 수준 정보를 생성하는 단계이다. 커리큘럼 정보 생성 단계(S14)는 인공지능 기반의 유아 한글 맞춤형 커리큘럼 생성 장치가 S13에서 생성된 수준 정보를 기초로 수준 정보 변화량이 특정 값 이상으로 예상되는 커리큘럼 정보(음소 정보, 반복 횟수 정보, 영역 비율 정보, 콘텐츠 종류 정보 등)를 생성하고, 생성된 커리큘럼 정보를 기초로 학습자 클라이언트에 문제 를 출력하는 단계이다. 학습자가 기존에 유아 한글 학습 애플리케이션 모듈을 통해 한글을 학습하여, 해당 학습 자에 대해 수준 정보, 커리큘럼 정보가 기저장되어 있는 경우에는 학습자가 로그인 하였을 때 S14 단계부터 수 행되도록 구성될 수 있다. 문제 풀이 정보 수신 단계(S15)는 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치가 학습자 클라이언트 에서 상기 문제에 대하여 입력된 문제 풀이 정보(음소 입력 시간 정보, 오답 횟수 정보 등)를 수신하는 단계이 다. 이탈 가능성 정보 생성 단계(S16)는 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치가 S15에서의 문제 풀이 정보(음소 입력 시간 정보, 오답 횟수 정보 등)를 기초로 복수의 후보 커리큘럼 정보에 대한 해당 학습자의 이탈 가능성 정보를 생성하는 단계이다. 세부조정 커리큘럼 정보 생성 단계(S17)는 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치가 S16에서의 복수의 후보 커리큘럼 정보에 대한 이탈 가능성 정보를 기초로 세부조정 커리큘럼 정보를 생성하고, 생성된 세 부조정 커리큘럼 정보를 기초로 학습자 클라이언트에 문제를 출력하는 단계이다. 이상에서 설명한 바와 같이, 본 발명이 속하는 기술 분야의 통상의 기술자는 본 발명이 그 기술적 사상이나 필 수적 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 상술한 실시예들은 모든 면에서 예시적인 것이며 한정적인 것이 아닌 것으로서 이해해야만 한다. 본 발명의 범 위는 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 등가 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함하는 것으로 해석되어야 한다. 본 명세서 내에 기술된 특징들 및 장점들은 모두를 포함하지 않으며, 특히 많은 추가적인 특징들 및 장점들이 도면들, 명세서, 및 청구항들을 고려하여 당업자에게 명백해질 것이다. 더욱이, 본 명세서에 사용된 언어는 주 로 읽기 쉽도록 그리고 교시의 목적으로 선택되었고, 본 발명의 주제를 묘사하거나 제한하기 위해 선택되지 않 을 수도 있다는 것을 주의해야 한다. 본 발명의 실시예들의 상기한 설명은 예시의 목적으로 제시되었다. 이는 개시된 정확한 형태로 본 발명을 제한 하거나, 빠뜨리는 것 없이 만들려고 의도한 것이 아니다. 당업자는 상기한 개시에 비추어 많은 수정 및 변형이 가능하다는 것을 이해할 수 있다. 그러므로 본 발명의 범위는 상세한 설명에 의해 한정되지 않고, 이를 기반으로 하는 출원의 임의의 청구항들에 의해 한정된다. 따라서, 본 발명의 실시예들의 개시는 예시적인 것이며, 이하의 청구항에 기재된 본 발명의 범 위를 제한하는 것은 아니다."}
{"patent_id": "10-2019-0119599", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 첨부되는 다음의 도면들은 본 발명의 바람직한 실시예를 예시하는 것이며, 발명의 상세한 설명과 함께 본 발명의 기술사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재된 사항에만 한정되어 해석되어서는 아니 된다. 도 1은 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 학습 세션 제공 시스템을 도시한 모식도, 도 2는 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 진단 평가 장치를 도시한 모식도, 도 3은 본 발명의 변형예에 따른 인공지능 기반의 유아 한글 수준 진단 장치를 도시한 모식도, 도 4는 본 발명의 변형예에 따른 임베딩 모듈를 도시한 모식도, 도 5는 본 발명의 변형예에 따른 수준 정보 생성 모듈의 인공신경망을 도시한 모식도, 도 6은 본 발명의 제1변형예에 따른 수준 정보 생성 모듈의 RNN 모듈을 도시한 모식도, 도 7은 본 발명의 제2변형예에 따른 수준 정보 생성 모듈의 인공신경망 모듈인 생성 모듈 및 구분 모 듈을 도시한 모식도, 도 8은 본 발명의 제2변형예에 따른 구분 모듈인 ConvNet 인코더의 예를 도시한 모식도, 도 9는 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 맞춤형 커리큘럼 출력 장치를 도시한 모식도, 도 10은 본 발명의 일실시예에 따른 커리큘럼 선정 모듈의 인공신경망 모듈을 도시한 모식도, 도 11은 본 발명의 변형예에 따른 커리큘럼 선정 모듈의 강화학습을 도시한 모식도, 도 12는 본 발명의 변형예에 따른 커리큘럼 선정 모듈을 도시한 모식도, 도 13은 본 발명의 일실시예에 따른 커리큘럼 선정 모듈의 동작예를 도시한 흐름도, 도 14는 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치를 도시한 모식도, 도 15는 본 발명의 변형예에 따른 인공지능 기반의 유아 한글 커리큘럼 세부조정 장치의 인공신경망 모듈을 도시한 모식도, 도 16은 본 발명의 일실시예에 따른 인공지능 기반의 유아 한글 수준별 학습 세션 제공 방법을 도시한 흐름도이 다."}
