{"patent_id": "10-2024-0106191", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0053696", "출원번호": "10-2024-0106191", "발명의 명칭": "생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법, 장치 및 컴퓨터프로그램", "출원인": "신태영", "발명자": "신태영"}}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 장치에 의해 수행되는 방법에 있어서,환자의 진료 데이터를 획득하는 단계; 및기 학습된 생성형 인공지능 모델(Generative AI)을 이용하여 상기 획득된 진료 데이터에 대응하는 의료 차트를획득하는 단계를 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 획득된 진료 데이터는,상기 환자에 대한 진료 내용을 포함하는 데이터로, 상기 환자를 진료하는 의료진으로부터 제1 사용자 입력을 획득한 시점부터 제2 사용자 입력을 획득한 시점까지의 음성을 녹음함에 따라 생성되는 음성 형태의 데이터인,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 의료 차트를 획득하는 단계는,상기 획득된 진료 데이터를 기반으로 입력 데이터를 생성하는 단계; 및상기 생성된 입력 데이터를 상기 기 학습된 생성형 인공지능 모델에 입력함에 따라 상기 획득된 진료 데이터에대응하는 의료 차트를 결과 데이터로서 획득하는 단계를 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 획득된 진료 데이터는,상기 환자에 대한 진료 내용을 녹음한 음성 형태의 진료 데이터를 포함하며,상기 입력 데이터를 생성하는 단계는,상기 음성 형태의 진료 데이터를 텍스트 형태의 진료 데이터로 변환하는 단계;획득하고자 하는 의료 차트의 종류와 의료 차트 생성을 지시하는 명령어를 포함하는 프롬프트를 생성하는 단계;및상기 변환된 텍스트 형태의 진료 데이터와 상기 생성된 프롬프트를 포함하는 입력 데이터를 생성하는 단계를 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 의료 차트를 획득하는 단계는,공개특허 10-2025-0053696-3-상기 획득된 진료 데이터를 전처리하는 단계; 및상기 전처리된 진료 데이터를 이용하여 의료 차트를 획득하는 단계를 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 전처리하는 단계는,상기 획득된 진료 데이터에 포함된 복수의 정보 중 진료와 관련된 키워드를 포함하는 정보를 필요 정보로서 추출하거나, 진료와 관련되지 않은 키워드를 포함하는 정보를 불필요 정보로서 필터링하는 단계를 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 전처리하는 단계는,획득하고자 하는 의료 차트의 종류에 기초하여 정보 필터링 기준을 설정하는 단계; 및상기 설정된 정보 필터링 기준을 기반으로, 상기 획득된 진료 데이터에 포함된 복수의 정보 중 필요 정보만을추출하거나, 불필요 정보를 필터링하는 단계를 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 의료 차트를 획득하는 단계는,상기 획득된 진료 데이터를 분석하여 복수의 키워드를 추출하는 단계;상기 추출된 복수의 키워드를 기반으로, 사전에 설정된 복수의 의료 차트 양식 중 어느 하나의 의료 차트 양식을 선택하는 단계; 및상기 선택된 어느 하나의 의료 차트 양식에 대응하여 상기 획득된 진료 데이터를 가공함에 따라 의료 차트를 획득하는 단계를 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 의료 차트를 획득하는 단계는,상기 획득된 진료 데이터로부터 기 설정된 의료 차트 양식에 포함된 복수의 항목 각각에 대응하는 키워드를 추출하고, 상기 추출된 키워드를 기반으로 상기 복수의 항목 각각에 대응하는 정보를 획득하되,상기 복수의 항목 중 어느 하나의 항목에 대응하는 키워드가 추출되지 않는 경우, 상기 어느 하나의 항목을 제외한 나머지 항목들에 대응하여 추출된 키워드를 기반으로 상기 어느 하나의 항목에 대응하는 정보를 획득하는단계를 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 기 설정된 의료 차트 양식은,공개특허 10-2025-0053696-4-환자의 주장에 대한 정보를 기재하는 Subjective 항목, 의료인이 진료 과정에서 수집되는 사실 정보를 기재하는Objective 항목, 의료진이 환자의 현재 상태에 평가한 평가 정보를 기재하는 Assessment 항목 및 환자의 치료및 추적 계획 정보를 기재하는 Plan 항목을 포함하는 SOAP 의료 차트 양식인,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 획득된 진료 데이터와 상기 획득된 의료 차트를 출력하는 사용자 인터페이스(User Interface, UI)를 제공하는 단계를 더 포함하며,상기 제공된 사용자 인터페이스는,상기 획득된 진료 데이터가 출력되는 제1 영역과 상기 획득된 의료 차트를 출력하는 제2 영역을 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 사용자 인터페이스를 제공하는 단계는,상기 획득된 진료 데이터에 대응하여 서로 다른 종류의 복수의 의료 차트가 획득되는 경우, 상기 제공된 사용자인터페이스의 서로 다른 영역을 통해 상기 획득된 복수의 의료 차트 각각을 개별적으로 출력하는 단계를 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "프로세서;네트워크 인터페이스;메모리; 및상기 메모리에 로드(load) 되고, 상기 프로세서에 의해 실행되는 컴퓨터 프로그램을 포함하되,상기 컴퓨터 프로그램은,환자의 진료 데이터를 획득하는 인스트럭션(instruction); 및기 학습된 생성형 인공지능 모델(Generative AI)을 이용하여 상기 획득된 진료 데이터에 대응하는 의료 차트를획득하는 인스트럭션을 포함하는,생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법을 수행하는 컴퓨팅 장치."}
{"patent_id": "10-2024-0106191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨팅 장치와 결합되어,환자의 진료 데이터를 획득하는 단계; 및기 학습된 생성형 인공지능 모델(Generative AI)을 이용하여 상기 획득된 진료 데이터에 대응하는 의료 차트를획득하는 단계를 포함하는 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법을 실행시키기 위하여 컴퓨팅 장치로 판독 가능한 기록매체에 저장된, 컴퓨터프로그램."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법, 장치 및 컴퓨터프로그램이 제공된다. 상기 생성형 인 공지능 모델을 이용한 의료 차트 자동생성 방법은 컴퓨팅 장치에 의해 수행되는 방법에 있어서, 환자의 진료 데 이터를 획득하는 단계 및 기 학습된 생성형 인공지능 모델(Generative AI)을 이용하여 상기 획득된 진료 데이터 에 대응하는 의료 차트를 획득하는 단계를 포함한다."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법, 장치 및 컴퓨터프로그램 에 관한 것이다."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "병, 의원을 포함한 각종의료기관에서, 의사는 환자를 진료하는 과정에서 환자에 대한 의료 차트를 작성하는 것 이 일반적이다. 여기서, 의료 차트(또는 환자 차트 또는 의료 기록)는 환자의 의료 이력과 관련된 모든 정보가 담긴 파일이나 전자 문서이며, 환자가 받은 진료의 전반적인 이력을 표현할 수 있고, 환자나 환자가 가진 질병에 대한 각종 정 보를 포함할 수 있다. 예컨대, 의료 차트에는 환자의 기본 정보(예: 환자의 이름, 나이, 성별, 주소 등의 개인 정보), 의료 이력(예: 과거 및 현재의 의료 이력, 수술 이력, 알레르기, 복용 중인 약물 등의 정보), 진료 내용 (예: 환자가 클리닉이나 병원을 방문할 때마다의 진료 내용, 검사 결과, 진료소견 등을 기록한 문서), 진단 정 보(예: 현재 및 과거 진단, 병력 등의 정보), 검사 결과 정보(예: 혈액 검사, X-레이, MRI 등의 다양한 검사 결 과), 치료 및 처방 정보(예: 환자에게 제공된 치료와 처방 약물, 그리고 그에 대한 환자의 반응), 면담 기록(예: 의사와 환자 간의 상담이나 면담 내용), 예방 접종 정보(예: 환자의 예방 접종 이력) 및 종합적인 평 가 정보(예: 다양한 전문가들(예: 신경학자, 정신과 의사, 심장병 전문의 등)에 의한 평가와 의견) 등을 포함할 수 있다. SOAP 의료 차트(SOAP 노트)는 이러한 의료 차트를 작성하는 템플릿이며, 환자의 진료과정을 구체적이고 체계적 으로 문서화할 수 있는 방법론을 제시한다. 여기서, SOAP는 환자가 자신의 상태에 대해 보고하는 부분인 S(Subjective), 환자의 상태에 관한 구체적이고 측정 가능한 데이터를 기록하는 부분 O(Objective), 의료진이 환자의 상태를 평가하는 부분인 A(Assessment) 및 환자의 치료 및 회복을 위한 계획을 기록하는 부분인 P(Pla n)로 구분된다. 한편, 종래에는 의료진들이 직접 마우스나 키보드와 같은 입력 수단을 이용하여 의료 차트를 직접 입력하는 방 식을 사용하였으나, 이러한 의료 차트 작성 방식의 경우, 다소 번거로운 절차를 수행해야 하기 때문에 많은 시 간과 노력이 투자되어야 한다는 문제가 있다. 또한, 종래의 의료 차트 작성 방식의 경우, 사람이 일일이 수행하는 방식이기 때문에, 오기 입력이나 잘못된 정 보 입력 등과 같은 휴먼 에러가 발생될 문제가 있다."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "전술한 배경기술은 발명자가 본 발명의 내용을 도출하는 과정에서 보유하거나 습득한 것으로서, 반드시 본 출원 전에 일반 공중에 공개된 공지기술이라고 할 수는 없다."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 생성형 인공지능 모델을 기반으로, 환자의 진료 과정에서 수집되는 진료 데 이터를 가공함에 따라 사전에 설정된 형태의 템플릿의 의료 차트를 자동적으로 생성함으로써, 보다 편리하게 의 료 차트를 작성할 수 있도록 함과 동시에, 휴먼 에러를 줄여 보다 정확한 의료 차트 작성이 가능하도록 하는 생 성형 인공지능 모델을 이용한 의료 차트 자동생성 방법, 장치 및 컴퓨터프로그램을 제공하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법은 컴퓨팅 장치에 의해 수행되는 방법에 있어서, 환자의 진료 데이터를 획득하는 단계 및 기 학습된 생성형 인공지능 모델(Generative AI)을 이용하여 상기 획득된 진료 데이터에 대응하는 의료 차트를 획득하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 획득된 진료 데이터는, 상기 환자에 대한 진료 내용을 포함하는 데이터로, 상기 환자 를 진료하는 의료진으로부터 제1 사용자 입력을 획득한 시점부터 제2 사용자 입력을 획득한 시점까지의 음성을 녹음함에 따라 생성되는 음성 형태의 데이터일 수 있다. 다양한 실시예에서, 상기 의료 차트를 획득하는 단계는, 상기 획득된 진료 데이터를 기반으로 입력 데이터를 생 성하는 단계 및 상기 생성된 입력 데이터를 상기 기 학습된 생성형 인공지능 모델에 입력함에 따라 상기 획득된 진료 데이터에 대응하는 의료 차트를 결과 데이터로서 획득하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 획득된 진료 데이터는, 상기 환자에 대한 진료 내용을 녹음한 음성 형태의 진료 데이 터를 포함하며, 상기 입력 데이터를 생성하는 단계는, 상기 음성 형태의 진료 데이터를 텍스트 형태의 진료 데 이터로 변환하는 단계, 획득하고자 하는 의료 차트의 종류와 의료 차트 생성을 지시하는 명령어를 포함하는 프 롬프트를 생성하는 단계 및 상기 변환된 텍스트 형태의 진료 데이터와 상기 생성된 프롬프트를 포함하는 입력 데이터를 생성하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 의료 차트를 획득하는 단계는, 상기 획득된 진료 데이터를 전처리하는 단계 및 상기 전처리된 진료 데이터를 이용하여 의료 차트를 획득하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 전처리하는 단계는, 상기 획득된 진료 데이터에 포함된 복수의 정보 중 진료와 관련된 키워드를 포함하는 정보를 필요 정보로서 추출하거나, 진료와 관련되지 않은 키워드를 포함하는 정보를 불필요 정보로서 필터링하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 전처리하는 단계는, 획득하고자 하는 의료 차트의 종류에 기초하여 정보 필터링 기준 을 설정하는 단계 및 상기 설정된 정보 필터링 기준을 기반으로, 상기 획득된 진료 데이터에 포함된 복수의 정 보 중 필요 정보만을 추출하거나, 불필요 정보를 필터링하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 의료 차트를 획득하는 단계는, 상기 획득된 진료 데이터를 분석하여 복수의 키워드를 추출하는 단계, 상기 추출된 복수의 키워드를 기반으로, 사전에 설정된 복수의 의료 차트 양식 중 어느 하나의 의료 차트 양식을 선택하는 단계 및 상기 선택된 어느 하나의 의료 차트 양식에 대응하여 상기 획득된 진료 데 이터를 가공함에 따라 의료 차트를 획득하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 의료 차트를 획득하는 단계는, 상기 획득된 진료 데이터로부터 기 설정된 의료 차트 양식에 포함된 복수의 항목 각각에 대응하는 키워드를 추출하고, 상기 추출된 키워드를 기반으로 상기 복수의 항목 각각에 대응하는 정보를 획득하되, 상기 복수의 항목 중 어느 하나의 항목에 대응하는 키워드가 추출되지 않는 경우, 상기 어느 하나의 항목을 제외한 나머지 항목들에 대응하여 추출된 키워드를 기반으로 상기 어느 하 나의 항목에 대응하는 정보를 획득하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 기 설정된 의료 차트 양식은, 환자의 주장에 대한 정보를 기재하는 Subjective 항목, 의료인이 진료 과정에서 수집되는 사실 정보를 기재하는 Objective 항목, 의료진이 환자의 현재 상태에 평가한 평가 정보를 기재하는 Assessment 항목 및 환자의 치료 및 추적 계획 정보를 기재하는 Plan 항목을 포함하는 SOAP 의료 차트 양식일 수 있다. 다양한 실시예에서, 상기 획득된 진료 데이터와 상기 획득된 의료 차트를 출력하는 사용자 인터페이스(User Interface, UI)를 제공하는 단계를 더 포함하며, 상기 제공된 사용자 인터페이스는, 상기 획득된 진료 데이터가 출력되는 제1 영역과 상기 획득된 의료 차트를 출력하는 제2 영역을 포함할 수 있다. 다양한 실시예에서, 상기 사용자 인터페이스를 제공하는 단계는, 상기 획득된 진료 데이터에 대응하여 서로 다 른 종류의 복수의 의료 차트가 획득되는 경우, 상기 제공된 사용자 인터페이스의 서로 다른 영역을 통해 상기 획득된 복수의 의료 차트 각각을 개별적으로 출력하는 단계를 포함할 수 있다. 상술한 과제를 해결하기 위한 본 발명의 다른 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생 성 방법을 수행하는 컴퓨팅 장치는 프로세서, 네트워크 인터페이스, 메모리 및 상기 메모리에 로드(load) 되고, 상기 프로세서에 의해 실행되는 컴퓨터 프로그램을 포함하되, 상기 컴퓨터 프로그램은, 환자의 진료 데이터를 획득하는 인스트럭션(instruction) 및 기 학습된 생성형 인공지능 모델(Generative AI)을 이용하여 상기 획득된 진료 데이터에 대응하는 의료 차트를 획득하는 인스트럭션을 포함할 수 있다. 상술한 과제를 해결하기 위한 본 발명의 또 다른 실시예에 따른 컴퓨터프로그램은 컴퓨팅 장치와 결합되어, 환 자의 진료 데이터를 획득하는 단계 및 기 학습된 생성형 인공지능 모델(Generative AI)을 이용하여 상기 획득된 진료 데이터에 대응하는 의료 차트를 획득하는 단계를 포함하는 생성형 인공지능 모델을 이용한 의료 차트 자동 생성 방법을 실행시키기 위하여 컴퓨팅 장치로 판독 가능한 기록매체에 저장될 수 있다. 본 발명의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 생성형 인공지능 모델을 기반으로, 환자의 진료 과정에서 수집되는 진료 데 이터를 가공함에 따라 사전에 설정된 형태의 템플릿의 의료 차트를 자동적으로 생성함으로써, 보다 편리하게 의 료 차트를 작성할 수 있도록 함과 동시에, 휴먼 에러를 줄여 보다 정확한 의료 차트 작성이 가능하도록 한다."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 본 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각 각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용 되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성요소는 본 발명의 기술 적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 본 명세서에서 사용되는 \"부\" 또는 “모듈”이라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요 소를 의미하며, \"부\" 또는 “모듈”은 어떤 역할들을 수행한다. 그렇지만 \"부\" 또는 “모듈”은 소프트웨어 또 는 하드웨어에 한정되는 의미는 아니다. \"부\" 또는 “모듈”은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\" 또는 “ 모듈”은 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라 이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\" 또는 “모듈”들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\" 또는 “모듈”들로 결합되거나 추가적인 구성요소들과 \"부\" 또는 “모듈”들로 더 분리될 수 있다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소들과의 상관관계를 용이하게 기술하기 위해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작시 구성 요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤 집을 경우, 다른 구성요소의 \"아래(below)\"또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성 요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있 다. 본 명세서에서 사용되는 \"제1\", \"제2\", 또는 \"첫째\", \"둘째\" 등의 표현은, 문맥상 다르게 뜻하지 않는 한, 복수 의 동종 대상들을 지칭함에 있어 한 대상을 다른 대상과 구분하기 위해 사용되며, 해당 대상들간의 순서 또는 중요도를 한정하는 것은 아니다. 본 명세서에서 사용되는 \"A, B, 및 C,\" \"A, B, 또는 C,\" \"A, B, 및/또는 C\" 또는 \"A, B, 및 C 중 적어도 하 나,\" \"A, B, 또는 C 중 적어도 하나,\" \"A, B, 및/또는 C 중 적어도 하나,\" \"A, B, 및 C 중에서 선택된 적어도 하나,\" \"A, B, 또는 C 중에서 선택된 적어도 하나,\" \"A, B, 및/또는 C 중에서 선택된 적어도 하나\" 등의 표현은, 각각의 나열된 항목 또는 나열된 항목들의 가능한 모든 조합들을 의미할 수 있다. 예를 들어, \"A 및 B 중에서 선택된 적어도 하나\"는, A, A 중 적어도 하나, B, B 중 적어도 하나, A 중 적어도 하나 및 B 중 적어도 하나, A 중 적어도 하나 및 B, B 중 적어도 하나 및 A, A 및 B를 모두 지칭할 수 있다. 본 명세서에서 사용되는 \"~에 기초하여\"라는 표현은, 해당 표현이 포함되는 어구 또는 문장에서 기술되는, 결정, 판단의 행위 또는 동작에 영향을 주는 하나 이상의 인자를 기술하는데 사용되고, 이 표현은 해당 결정, 판단의 행위 또는 동작에 영향을 주는 추가적인 인자를 배제하지 않는다. 본 명세서에서 사용되는, 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"연결되어\" 있다거나 \"접속되어\" 있다는 표현은, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결 또는 접속되 는 것뿐 아니라, 새로운 다른 구성요소(예: 제3 구성요소)를 매개로 하여 연결 또는 접속되는 것을 의미할 수 있다. 본 명세서에서 사용된 표현 \"~하도록 구성된(configured to)\"은 문맥에 따라, \"~하도록 설정된\", \"~하는 능력을 가지는\", \"~하도록 변경된\", \"~하도록 만들어진\", \"~를 할 수 있는\" 등의 의미를 가질 수 있다. 해당 표현은, \"하드웨어적으로 특별히 설계된\"의 의미로 제한되지 않으며, 예를 들어 특정 동작을 수행하도록 구성된 프로세 서란, 소프트웨어를 실행함으로써 그 특정 동작을 수행할 수 있는 범용 프로세서(generic-purpose processor)를 의미할 수 있다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 본 명세서에서, 컴퓨터는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로서 이해될 수 있다. 예 를 들어, 컴퓨터는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애 플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 본 명세서에서 설명되는 각 단계들은 컴퓨터에 의하여 수행되는 것으로 설명되나, 각 단계의 주체는 이에 제한 되는 것은 아니며, 실시 예에 따라 각 단계들의 적어도 일부가 서로 다른 장치에서 수행될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 시스템을 도시한 도면 이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 시스템은 컴 퓨팅 장치, 사용자 단말, 외부 서버 및 네트워크를 포함할 수 있다. 여기서, 도 1에 도시된 생성형 인공지능 모델을 이용한 의료 차트 자동생성 시스템은 일 실시예에 따른 것이고, 그 구성 요소가 도 1에 도시된 실시예에 한정되는 것은 아니며, 필요에 따라 부가, 변경 또는 삭제될 수 있다. 일 실시예에서, 컴퓨팅 장치는 의료 차트 자동생성 프로세스를 수행할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 의료진으로부터 환자와의 진료 내용을 포함하는 진료 데이터를 획득할 수 있고, 기 학습된 인공지능 모델을 이용하여 진료 데이터에 대응하는 의료 차트를 획득할 수 있다. 여기서, 인공지능 모델(예: 신경망)은 하나 이상의 네트워크 함수로 구성되며, 하나 이상의 네트워크 함수는 일 반적으로 ‘노드’라 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성될 수 있다. 이러한 ‘노드’들 은 ‘뉴런(neuron)’들로 지칭될 수도 있다. 하나 이상의 네트워크 함수는 적어도 하나 이상의 노드들을 포함하 여 구성된다. 하나 이상의 네트워크 함수를 구성하는 노드(또는 뉴런)들은 하나 이상의 ‘링크’에 의해 상호 연결될 수 있다. 인공지능 모델 내에서, 링크를 통해 연결된 하나 이상의 노드들은 상대적으로 입력 노드 및 출력 노드의 관계를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 전술 한 바와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나 이상 의 출력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서, 출력 노드는 입력 노드에 입력된 데이터에 기초 하여 그 값이 결정될 수 있다. 여기서 입력 노드와 출력 노드를 상호 연결하는 노드는 가중치(weight)를 가질 수 있다. 가중치는 가변적일 수 있으며, 인공지능 모델이 원하는 기능을 수행하기 위해, 사용자 또는 알고리즘 에 의해 가변될 수 있다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연 결된 경우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하 는 링크에 설정된 가중치에 기초하여 출력 노드 값을 결정할 수 있다. 전술한 바와 같이, 인공지능 모델은 하나 이상의 노드들이 하나 이상의 링크를 통해 상호연결 되어 인공지능 모 델 내에서 입력 노드 및 출력 노드 관계를 형성한다. 인공지능 모델 내에서 노드들과 링크들의 개수 및 노드들 과 링크들 사이의 연관관계, 링크들 각각에 부여된 가중치의 값에 따라, 인공지능 모델의 특성이 결정될 수 있 다. 예를 들어, 동일한 개수의 노드 및 링크들이 존재하고, 링크들 사이의 가중치 값이 상이한 두 인공지능 모 델이 존재하는 경우, 두 개의 인공지능 모델들은 서로 상이한 것으로 인식될 수 있다. 인공지능 모델을 구성하는 노드들 중 일부는, 최초 입력 노드로부터의 거리들에 기초하여, 하나의 레이어 (layer)를 구성할 수 있다. 예를 들어, 최초 입력 노드로부터 거리가 n인 노드들의 집합은, n 레이어를 구성할 수 있다. 최초 입력 노드로부터 거리는, 최초 입력 노드로부터 해당 노드까지 도달하기 위해 거쳐야 하는 링크 들의 최소 개수에 의해 정의될 수 있다. 그러나, 이러한 레이어의 정의는 설명을 위한 임의적인 것으로서, 인공 지능 모델 내에서 레이어의 차수는 전술한 것과 상이한 방법으로 정의될 수 있다. 예를 들어, 노드들의 레이어 는 최종 출력 노드로부터 거리에 의해 정의될 수도 있다. 최초 입력 노드는 인공지능 모델 내의 노드들 중 다른 노드들과의 관계에서 링크를 거치지 않고 데이터가 직접 입력되는 하나 이상의 노드들을 의미할 수 있다. 또는, 인공지능 모델 네트워크 내에서, 링크를 기준으로 한 노 드 간의 관계에 있어서, 링크로 연결된 다른 입력 노드들 가지지 않는 노드들을 의미할 수 있다. 이와 유사하게, 최종 출력 노드는 인공지능 모델 내의 노드들 중 다른 노드들과의 관계에서, 출력 노드를 가지지 않 는 하나 이상의 노드들을 의미할 수 있다. 또한, 히든 노드는 최초 입력 노드 및 최후 출력 노드가 아닌 인공지 능 모델을 구성하는 노드들을 의미할 수 있다. 본 발명의 일 실시예에 따른 인공지능 모델은 입력 레이어의 노 드가 출력 레이어에 가까운 히든 레이어의 노드보다 많을 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 감소하는 형태의 인공지능 모델일 수 있다. 인공지능 모델은 하나 이상의 히든 레이어를 포함할 수 있다. 히든 레이어의 히든 노드는 이전의 레이어의 출력 과 주변 히든 노드의 출력을 입력으로 할 수 있다. 각 히든 레이어 별 히든 노드의 수는 동일할 수도 있고 상이 할 수도 있다. 입력 레이어의 노드의 수는 입력 데이터의 데이터 필드의 수에 기초하여 결정될 수 있으며 히든 노드의 수와 동일할 수도 있고 상이할 수도 있다. 입력 레이어에 입력된 입력 데이터는 히든 레이어의 히든 노 드에 의하여 연산될 수 있고 출력 레이어인 완전 연결 레이어(FCL: fully connected layer)에 의해 출력될 수 있다. 다양한 실시예에서, 인공지능 모델은 딥러닝(Deep learning) 모델일 수 있다. 딥러닝 모델(예: 딥 뉴럴 네트워크(DNN: deep neural network, 심층신경망)는 입력 레이어와 출력 레이어 외에 복수의 히든 레이어를 포함하는 인공지능 모델을 의미할 수 있다. 딥 뉴럴 네트워크를 이용하면 데이터의 잠재 적인 구조(latent structures)를 파악할 수 있다. 즉, 사진, 글, 비디오, 음성, 음악의 잠재적인 구조(예를 들 어, 어떤 물체가 사진에 있는지, 글의 내용과 감정이 무엇인지, 음성의 내용과 감정이 무엇인지 등)를 파악할 수 있다. 딥 뉴럴 네트워크는 컨벌루셔널 뉴럴 네트워크(CNN: convolutional neural network), 리커런트 뉴럴 네트워크 (RNN: recurrent neural network), 오토 인코더(auto encoder), GAN(Generative Adversarial Networks), 제한 볼츠만 머신(RBM: restricted boltzmann machine), 심층 신뢰 네트워크(DBN: deep belief network), Q 네트워 크, U 네트워크, 샴 네트워크 등을 포함할 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 네트워크 함수는 오토 인코더를 포함할 수도 있다. 여기서, 오토 인코더는 입력 데이터와 유사한 출력 데이터를 출력하기 위한 인공 신경망의 일종일 수 있다. 오토 인코더는 적어도 하나의 히든 레이어를 포함할 수 있으며, 홀수 개의 히든 레이어가 입출력 레이어 사이에 배치될 수 있다. 각각의 레이어의 노드의 수는 입력 레이어의 노드의 수에서 병목 레이어(인코딩)라는 중간 레 이어로 축소되었다가, 병목 레이어에서 출력 레이어(입력 레이어와 대칭)로 축소와 대칭되어 확장될 수도 있다. 차원 감소 레이어와 차원 복원 레이어의 노드는 대칭일 수도 있고 아닐 수도 있다. 또한, 오토 인코더는 비선형 차원 감소를 수행할 수 있다. 입력 레이어 및 출력 레이어의 수는 입력 데이터의 전처리 이후에 남은 센서들의 수와 대응될 수 있다. 오토 인코더 구조에서 인코더에 포함된 히든 레이어의 노드의 수는 입력 레이어에서 멀어 질수록 감소하는 구조를 가질 수 있다. 병목 레이어(인코더와 디코더 사이에 위치하는 가장 적은 노드를 가진 레이어)의 노드의 수는 너무 작은 경우 충분한 양의 정보가 전달되지 않을 수 있으므로, 특정 수 이상(예를 들 어, 입력 레이어의 절반 이상 등)으로 유지될 수도 있다. 다양한 실시예에서, 인공지능 모델은 생성형 인공지능 모델(Generative AI)일 수 있다. 생성형 인공지능 모델은 트랜스포머를 이용하여 대규모 데이터를 사전 학습한(Pre-trained) 자연어 모델을 의미 할 수 있다. 트랜스포머 모델은 어텐션 매커니즘을 기반으로 구성되며, 인코더-디코더 구조를 기반으로 하면서 도 기존의 시퀀스-투-시퀀스 모델의 단점을 개선하였으며, 순환 신경망을 사용하지 않는 인코더-디코더를 설계 한 것이 특징이다. 어텐션은 기존에 시퀀스-투-시퀀스 모델의 순환 신경망을 보정하는데 사용되었으나, 트랜스포머는 순환 신경망 없이 어텐션만으로 인코더-디코더를 설계하였다. 트랜스포머에서 사용되는 어텐션 기법은 멀티 헤드 어텐션 (Multi-Head Attention) 혹은 셀프 어텐션(Self-Attention) 이라 불린다. 트랜스포머 모델은 인코더의 입력(입력 시퀀스)과, 디코더의 입력(출력 시퀀스를 구성하는 단어)이 주어졌을 때 정답(출력 시퀀스의 다음 단어)의 확률값을 높이는 방식으로 학습되는 것을 특징으로 한다. 사전 학습된 언어 모델은 대규모의 언어 데이터(말뭉치: Corpus)를 이용하여 특정 태스크를 수행하는 과정을 학 습한 언어 모델을 의미할 수 있다. 예를 들어, GPT 계열 모델에서는 이전 단어들이 주어졌을 때 다음 단어를 예 측하도록 하는 태스크를 학습하며, 다음 단어를 올바르게 예측하도록 모델을 업데이트하는 학습 과정을 수행한 다. 다른 예로, BERT 계열 모델에서는 주어진 양쪽의 단어들로부터 가운데의 비어 있는 단어를 예측하는 태스크 를 학습하며, 비어 있는 단어를 올바르게 예측하도록 모델을 업데이트하는 학습 과정을 수행한다. 이러한 태스크의 특징은, 상대적으로 쉽게 수집할 수 있는 대량의 언어 데이터를 별도의 사전 작업 없이 입력하 여도, 컴퓨터가 스스로 단어를 하나씩 가리고 맞혀 가며 자기지도학습(Self-Supervised Learning)을 수행할 수 있다는 데 있다. 이러한 방식으로 대량의 언어 데이터를 사전 학습한 모델이 완성되면, 해당 모델이 다양한 세 부 태스크를 수행할 수 있도록 파인 튜닝(Fine Tuning)하여 활용할 수 있다. 파인 튜닝은 특정 태스크를 학습한 모델이 다른 태스크를 수행할 수 있도록 재학습시키는 전이 학습(Transfer Learning) 방법의 일종으로, 이미 사전 학습된 모델의 경험을 활용하여 새로운 태스크를 상대적으로 쉽게 학습 하도록 하는 방법이다. 예를 들어, 사전 학습된 언어 모델은 빈칸의 단어를 맞추도록 학습되었지만, 이를 파인 튜닝하면 질문에 대한 응답을 생성하거나, 문서를 분류하는 모델을 얻을 수 있다. 이러한 사전 학습된 언어 모델의 규모를 크게 키우고, 압도적으로 많은 데이터를 사전 학습시키면서 기존의 인 공지능 모델의 성능을 크게 능가하는 결과를 얻게 되었다. 이에 따라 개발된 인공지능 모델을 초거대 인공지능(Hyperscale AI) 또는 대규모 언어 모델(LLM: Large Language Model)이라 부른다. 여기서, 본 발명의 다양한 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법은 하나의 인 공지능 모델을 구축하고, 다수의 의료진이 하나의 인공지능 모델을 사용하여 의료 차트를 획득하는 형태로 구현 될 수 있으나, 경우에 따라 다수의 의료진 각각에 대응하는 인공지능 모델 즉, 의료진 맞춤형 인공지능 모델을 구축할 수 있고, 의료진들 각각이 자신의 의료진 맞춤형 인공지능 모델을 이용하여 의료 차트를 획득할 수 있다. 예컨대, 컴퓨팅 장치는 제1 의료진의 진료 데이터와 제1 의료진으로부터 작성된 의료 차트를 학습 데이터 로 하여 제1 의료진 맞춤형 인공지능 모델을 구축할 수 있고, 제1 의료진으로부터 진료 데이터가 획득되는 경우 제1 의료진 맞춤형 인공지능 모델을 통해 진료 데이터에 대응하는 의료 차트를 생성할 수 있다. 또한, 컴퓨팅 장치는 제2 의료진의 진료 데이터와 제2 의료진으로부터 작성된 의료 차트를 학습 데이터로 하여 제2 의료진 맞춤형 인공지능 모델을 구축할 수 있고, 제2 의료진으로부터 진료 데이터가 획득되는 경우 제 2 의료진 맞춤형 인공지능 모델을 통해 진료 데이터에 대응하는 의료 차트를 생성할 수 있다. 이와 같이, 의료 진 각각에 대응하는 맞춤형 인공지능 모델을 구축하고, 이를 통해 의료 차트를 생성함으로써, 의료진이 선호하 는 양식, 스타일의 의료 차트를 생성할 수 있다. 또한, 컴퓨팅 장치는 경우에 따라 제2 의료진으로부터 제1 의료진이 선호하는 양식 및 스타일의 의료 차트 생성을 요구할 경우, 제2 의료진으로부터 획득된 진료 데이터를 제1 의료진 맞춤형 인공지능 모델에 입력함에 따라 제1 의료진 맞춤형 인공지능 모델을 통해 진료 데이터에 대응하는 의료 차트를 생성할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 인공지능 모델을 통해 진료 데이터에 대응하는 의료 차트를 생성하되, 의료진으로부터 사전에 설정된 언어로 의료 차트를 획득할 수 있다. 이를 위해, 인공지능 모델은 다양한 언어의 학습 데이터로 학습됨에 따라 다양한 언어의 지원이 가능한 형태로 구현될 수 있다. 여기서, 본 발명의 다양한 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법은 인공지능 모델을 통해 의료 차트를 자동적으로 획득하는 것으로 설명하고 있으나, 이에 한정되지 않고, 인공지능 모델을 통해, 환자의 상태를 진단 및 예측하고, 이에 따라 치료 계획을 수립하는 등 종합적인 의료 솔루션을 제공하는 형태로 구현될 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 환자로부터 환자의 증상 내용을 포함하는 증상 데이터를 획득할 수 있 고, 기 학습된 인공지능 모델을 이용하여 증상 데이터에 대응하는 의료 솔루션 정보를 획득할 수 있으며, 획득 된 의료 솔루션 정보를 환자에게 제공할 수 있다. 예컨대, 컴퓨팅 장치는 환자로부터 환자의 증상 내용을 포함하는 증상 데이터(예컨대, 증상에 대한 내용을 녹음함에 따라 생성되는 음성 형태의 증상 데이터)를 획득하는 경우, 증상 데이터를 분석하여 환자에 대한 진단 을 수행할 수 있고, 수행된 진단의 결과에 따라 치료 및 처방 정보를 도출할 수 있다. 또한, 컴퓨팅 장치 는 수행된 진단의 결과, 도출된 치료 및 처방 정보를 포함하는 의료 솔루션 정보를 생성하고, 이를 환자에게 제 공할 수 있다. 이때, 컴퓨팅 장치는 환자로부터 증상 데이터와 함께 이미지 데이터를 업로드 받는 경우, 증상 데이터에 포함된 증상 내용에 기초한 이미지 데이터 분석을 수행할 수 있고, 이를 기반으로 환자에 대한 진단, 치료 및 처방 정보를 포함하는 의료 솔루션 정보를 생성하여 환자에게 제공할 수 있다. 일례로, 컴퓨팅 장치는 환자로부터 증상 데이터와 함께 X-RAY를 획득한 상태에서, 증상 데이터에 포함된 증상 내용이 \"가슴 통증\"인 경우, X-RAY를 분석하여 폐, 심장, 뼈 등의 상태를 판단함에 따라 \"가슴 통증\"을 유 발하는 원인을 분석하고, 분석된 원인에 따라 환자에 대한 진단을 수행할 수 있으며, 수행된 진단의 결과에 따 라 치료 및 처방 정보를 도출할 수 있다. 또한, 컴퓨팅 장치는 수행된 진단의 결과, 도출된 치료 및 처방 정보를 포함하는 의료 솔루션 정보를 생성하고, 이를 환자에게 제공할 수 있다. 이를 위해, 인공지능 모델은 서로 다른 종류의 둘 이상의 데이터를 입력으로 하여, 하나의 결과 데이터를 출력 하는 멀티모달 모델일 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 컴퓨팅 장치는 의료진 및/또는 환자로부터 치료 내용을 포함하는 치료 영상 데이터를 획득하는 경우, 인공지능 모델을 통해 치료 영상 데이터를 분석함에 따라 치료 가이드 정보를 획득할 수 있다. 예컨대, 컴퓨팅 장치는 의료진 및/또는 환자로부터 치료 행위와 관련된 동영상 데이터가 획득되는 경우, 획득된 동영상 데이터에 포함된 복수의 프레임 각각을 분석하여 치료와 관련된 정보를 추출할 수 있고, 추출된 정보를 포함하는 치료 가이드 정보를 획득할 수 있다. 여기서, 치료 가이드 정보에 포함된 치료와 관련된 정보는, 치료 영역, 치료가 수행된 시점에 대응하는 프레임 의 위치, 치료가 종료된 시점에 대응하는 프레임의 위치, 치료 영역에 대하여 수행된 치료 행위에 관한 정보를 포함하는 것일 수 있으나, 이에 한정되지 않는다. 여기서, 본 발명의 다양한 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법은 생성형 인 공지능 모델을 기반으로, 환자가 의료진을 방문하여 실제 대면 진료를 진행함에 따라 생성되는 진료 데이터를 이용하여 의료 차트를 자동적으로 획득하는 방문 중(In-visit) 서비스를 제공하는 것으로 설명하고 있으나, 이 에 한정되지 않고, 방문 전(Pre-visit) 서비스와 방문 후(Post-Visit) 서비스도 제공할 수 있다. 먼저, 방문 전(Pre-visit) 서비스는 의료 기관에 방문하고자 하는 환자를 대상으로 간단한 방문 전 평가를 수행 하는 서비스를 의미할 수 있다. 예컨대, 방문 전 서비스는 의료 기관에 방문하고자 하는 환자를 대상으로 사전 상담을 진행함에 따라 생성되는 상담 데이터를 기반으로, 환자에 대하여 실제 진료를 진행하고자 할 때 도움이 되는 정보(예: 환자의 병력, 현재 상태, 증상, 궁금증 등)를 사전에 도출하고, 이에 따라 진료를 자동적으로 예 약하거나, 진료 예약을 보조하는 서비스를 의미할 수 있다. 여기서, 상담 데이터는 전화 통화 상에서 환자에 대한 사전 상담을 진행하는 과정에서 수집되는 데이터를 의미 할 수 있다. 일례로, 상담 데이터는 자동 응답 시스템(ARS)을 기반으로 환자에게 하나 이상의 사전 질문을 제공함에 따라 환 자로부터 획득되는 하나 이상의 음성 형태의 답변을 의미할 수 있다. 다른 예로, 상담 데이터는 사용자 단말로 제공된 UI를 통해 획득되는 데이터로, 예컨대, UI를 통해 출력된 하나 이상의 사전 질문에 대응하여 환자로부터 획득되는 하나 이상의 텍스트 형태의 답변 또는 음성 형태의 답 변을 의미할 수 있다. 다음으로, 방문 중(In-visit) 서비스는 본 발명의 다양한 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법을 통해 제공되는 서비스로, 의료 기관에 방문한 환자에 대한 진료를 진행하는 과정에서 자 동적으로 의료 차트를 획득하는 서비스를 의미할 수 있다. 의료진이 의료 차트를 보다 수월하게 작성할 수 있는 환경을 구축하기 위해 전자 의료 기록(EMR) 시스템을 도입 하였으나, 이러한 시스템은 의료 차트를 작성하기 위해 의료진의 손과 눈을 키보드와 모니터에 묶어두는 상황을 발생시켰으며, 이에 따라 환자와의 소통을 등한시하게 하는 문제를 야기하였다. 이에, 본 발명의 다양한 실시예에 따르면, 생성형 인공지능 모델을 기반으로, 환자에 대한 의료 차트를 자동적 으로 획득하는 방문 중 서비스를 제공함으로써, 의료진이 의료 차트 작성 보다는 환자와의 소통에 더욱 집중할 수 있도록 하고, 이를 통해 환자와 원활한 소통(Seamless Communication)을 가능케 한다는 이점이 있다. 다음으로, 방문 후(Post-visit) 서비스는 환자가 의료 기관에 방문하여 진료 및 치료를 수행한 이후에 제공되는 서비스로, 예컨대, 환자에게 처방된 약물의 복용을 안내하거나(예: 복용시기마다 알림 제공), 환자의 상태 변화 를 관찰 및 기록하거나, 검사 결과 분석 및 피드백을 제공하거나, 다음 진료를 예약하는 서비스를 제공할 수 있 으나, 이에 한정되지 않는다. 다양한 실시예에서, 컴퓨팅 장치는 네트워크를 통해 사용자 단말과 연결될 수 있으며, 사용자 단말로 생성형 인공지능 모델을 이용한 의료 차트 자동생성 서비스를 제공하는 UI(예: 도 5 내지 도 8)를 제공할 수 있다. 여기서, 사용자 단말은 컴퓨팅 장치와 통신을 위한 메커니즘을 갖는 시스템에서의 임의의 형태의 엔 티티(들)를 의미할 수 있다. 예를 들어, 이러한 사용자 단말은 PC(personal computer), 노트북(note book), 모바일 단말기(mobile terminal), 스마트 폰(smart phone), 태블릿 PC(tablet pc) 및 웨어러블 디바이 스(wearable device) 등을 포함할 수 있으며, 유/무선 네트워크에 접속할 수 있는 모든 종류의 단말을 포함할 수 있다. 또한, 사용자 단말은 에이전트, API(Application Programming Interface) 및 플러그-인(Plug- in) 중 적어도 하나에 의해 구현되는 임의의 컴퓨팅 장치를 포함할 수도 있다. 또한, 사용자 단말은 애플 리케이션 소스 및/또는 클라이언트 애플리케이션을 포함할 수 있다. 또한, 여기서, 네트워크는 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미할 수 있다. 예를 들어, 네트워크는 근거리 통신망(LAN: Local Area Network), 광역 통신망 (WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통 신망, CAN(Controller Area Network) 및 이더넷(Ethernet) 등을 포함할 수 있다. 무선 데이터 통신망은 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와 이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스(Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등을 포함할 수 있으나, 이에 한정되지는 않는다. 다양한 실시예에서, 컴퓨팅 장치는 의료 차트뿐만 아니라, 진료 데이터 기반으로 의료 관련 서류 작성을 자동적으로 수행할 수 있다. 예컨대, 컴퓨팅 장치는 도 9에 도시된 바와 같이, 진료 데이터를 기반으로 진 료 계획서 및 진료 기록지를 획득하여 환자에게 제공할 수 있다. 여기서, 진료 계획서와 진료 기록지는 의학 전 문가가 아닌 환자에게 제공되는 서류인 바, 의학 전문 용어가 아닌 layman’s terms로 번역되며, 환자들이 직관 적으로 이해하기 쉽게끔 안내문 형식으로 획득할 수 있으나, 이에 한정되지 않는다. 일 실시예에서, 외부 서버는 네트워크를 통해 컴퓨팅 장치와 연결될 수 있으며, 컴퓨팅 장치 가 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법을 수행하기 위해 필요한 각종 정보/데이터를 저장 및 관리하거나, 컴퓨팅 장치를 통해 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법을 수행 함에 따라 획득되는 각종 정보/데이터 제공받아 저장 및 관리할 수 있다. 예컨대, 외부 서버는 컴퓨팅 장 치의 외부에 별도로 구비되는 저장 서버일 수 있으나, 이에 한정되지 않는다. 이하, 도 2를 참조하여, 생 성형 인공지능 모델을 이용한 의료 차트 자동생성 방법을 수행하는 컴퓨팅 장치에 대해 설명하도록 한다. 도 2는 본 발명의 다른 실시예에 따른 컴퓨팅 장치의 하드웨어 구성도이다. 도 2를 참조하면, 다양한 실시예에서, 컴퓨팅 장치는 하나 이상의 프로세서, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(Load)하는 메모리, 버스, 통신 인터페이스 및 컴퓨터 프 로그램을 저장하는 스토리지를 포함할 수 있다. 여기서, 도 2에는 본 발명의 실시예와 관련 있는 구"}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "성요소들만 도시되어 있다. 따라서, 본 발명이 속한 기술분야의 통상의 기술자라면 도 2에 도시된 구성요소들 외에 다른 범용적인 구성 요소들이 더 포함될 수 있음을 알 수 있다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 발명의 기술 분야에 잘 알려진 임의의 형태의 프로세서를 포함하여 구성될 수 있다. 또한, 프로세서는 본 발명의 실시예들에 따른 방법을 실행하기 위한 적어도 하나의 애플리케이션 또는 프 로그램에 대한 연산을 수행할 수 있으며, 컴퓨팅 장치는 하나 이상의 프로세서를 구비할 수 있다. 다양한 실시예에서, 프로세서는 프로세서 내부에서 처리되는 신호(또는, 데이터)를 일시적 및/또는 영구적으로 저장하는 램(Random Access Memory, RAM)(미도시) 및 롬(Read-Only Memory, ROM)(미도시)을 더 포 함할 수 있다. 또한, 프로세서는 그래픽 처리부, 램 및 롬 중 적어도 하나를 포함하는 시스템온칩(System on Chip, SoC) 형태로 구현될 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 발명의 다양한 실시예에 따른 방 법/동작을 실행하기 위하여 스토리지로부터 컴퓨터 프로그램을 로드할 수 있다. 메모리에 컴퓨 터 프로그램이 로드되면, 프로세서는 컴퓨터 프로그램을 구성하는 하나 이상의 인스트럭션들을 실행함으로써 상기 방법/동작을 수행할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있을 것 이나, 본 발명의 기술적 범위가 이에 한정되는 것은 아니다. 버스는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공한다. 버스는 주소 버스(address Bus), 데 이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스는 컴퓨팅 장치의 유무선 인터넷 통신을 지원한다. 또한, 통신 인터페이스는 인 터넷 통신 외의 다양한 통신 방식을 지원할 수도 있다. 이를 위해, 통신 인터페이스는 본 발명의 기술 분 야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 몇몇 실시예에서, 통신 인터페이스는 생략될 수도있다. 스토리지는 컴퓨터 프로그램을 비 임시적으로 저장할 수 있다. 컴퓨팅 장치를 통해 생성형 인공 지능 모델을 이용한 의료 차트 자동생성 프로세스를 수행하는 경우, 스토리지는 생성형 인공지능 모델을 이용한 의료 차트 자동생성 프로세스를 제공하기 위하여 필요한 각종 정보를 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 발명의 다양한 실시예에 따른 방 법/동작을 수행하도록 하는 하나 이상의 인스트럭션들을 포함할 수 있다. 즉, 프로세서는 상기 하나 이상 의 인스트럭션들을 실행함으로써, 본 발명의 다양한 실시예에 따른 상기 방법/동작을 수행할 수 있다. 일 실시예에서, 컴퓨터 프로그램은 환자의 진료 데이터를 획득하는 단계 및 기 학습된 생성형 인공지능 모 델(Generative AI)을 이용하여 획득된 진료 데이터에 대응하는 의료 차트를 획득하는 단계를 포함하는 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법을 수행하도록 하는 하나 이상의 인스트럭션을 포함할 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다. 본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조 합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 이하, 도 3 내지 도 9을 참조하여 컴퓨팅 장치에 의해 수행되는 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법에 대해 설명하도록 한다. 도 3은 본 발명의 또 다른 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법의 순서도이 다. 도 3을 참조하면, S110 단계에서, 컴퓨팅 장치는 환자의 진료 데이터를 획득할 수 있다 여기서, 환자의 진료 데이터는 의료인이 환자를 진료하는 과정에서, 환자의 진료 내용을 포함하는 데이터일 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 컴퓨팅 장치는 음성 형태의 진료 데이터를 획득할 수 있다. 예컨대, 컴퓨팅 장치(10 0)는 사용자 단말로 녹음 기능을 제공하는 UI(예: 도 7)할 수 있고, 환자를 진료하는 의료진으로부터 제1 사용자 입력(예: 녹음 시작)을 획득한 시점부터 제2 사용자 입력(예: 녹음 종료)을 획득한 시점까지의 음성을 녹음함에 따라 생성되는 음성 형태의 진료 데이터를 획득할 수 있다. 그러나, 이에 한정되지 않고, 컴퓨팅 장치 는 다양한 방식으로, 다양한 형태의 진료 데이터를 획득할 수 있다. 일례로, 컴퓨팅 장치는 의료진이 환자의 진료를 녹음함에 따라 사전에 생성 및 저장된 음성 형태의 진료 데이터를 UI를 통해 업로드받을 수 있다. 다른 예로, 컴퓨팅 장치는 UI를 통해 환자에 대한 진료 내용을 포함하는 텍스트를 입력받거나, 진료 내용 을 포함하는 텍스트 형태의 진료 데이터를 UI를 통해 업로드받을 수 있다. 또 다른 예로, 컴퓨팅 장치는 수기로 기록된 진료 내용을 포함하는 이미지를 이미지 형태의 진료 데이터로 서 UI를 통해 업로드받을 수 있다.여기서, 환자의 진료 데이터가 환자에 대한 진료 내용을 녹음한 음성 형태의 진료 데이터인 것으로 설명하고 있 으나, 이에 한정되지 않고, 진료 데이터는 환자에 대한 기존 의료기록 데이터, 전자 의무 기록(Electronic Medical Record, EMR), 환자에 대한 의료 영상 및 의료 영상 촬영/분석 결과 등 다양한 형태의 데이터를 포함할 수 있다. S120 단계에서, 컴퓨팅 장치는 S110 단계를 거쳐 획득된 진료 데이터에 대응하는 의료 차트를 획득할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 생성형 인공지능 모델을 이용하여 진료 데이터를 가공함에 따라 진료 데이터에 대응하는 의료 차트를 획득할 수 있다. 예컨대, 컴퓨팅 장치는 진료 데이터를 기반으로 입력 데 이터를 생성하고, 입력 데이터를 생성형 인공지능 모델에 입력함에 따라 결과 데이터로서 의료 차트를 도출할 수 있다. 이하, 도 4를 참조하여, 보다 구체적으로 설명하도록 한다. 도 4는 다양한 실시예에서, 생성형 인공지능 모델을 통해 의료 차트를 생성하는 방법을 설명하기 위한 순서도이 다. 도 4를 참조하면, S210 단계에서, 컴퓨팅 장치는 음성 형태의 진료 데이터를 텍스트 형태의 진료 데이터로 변환할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 STT(Speech to Text) 프로세스를 수행하는 인공지능 모델을 이용하여, 음성 형태의 진료 데이터를 텍스트 형태의 진료 데이터로 변환할 수 있다. 보다 구체적으로, 먼저, 컴퓨팅 장치는 음성 형태의 진료 데이터를 전처리 함에 따라 음성 형태의 진료 데 이터에 포함된 노이즈를 제거하고 음성을 강화할 수 있다. 이후, 컴퓨팅 장치는 노이즈가 제거된 음성 형태의 진료 데이터에 포함된 음성 신호를 분석하여 음성의 특 성을 추출할 수 있다. 이후, 컴퓨팅 장치는 STT 프로세스를 수행하는 인공지능 모델 중 음향 모델을 통해, 음성의 특성을 분석함 에 따라 음성을 개별 단어나 음절로 분해하고, 분해된 음성을 텍스트 형태로 매칭할 수 있다. 또한, 컴퓨팅 장치는 STT 프로세스를 수행하는 인공지능 모델 중 언어 모델을 통해 단어의 조합과 문맥을 이해하여 자연스러운 언어 구조를 구축할 수 있다. 마지막으로, 컴퓨팅 장치는 상기의 과정을 거쳐 도출되는 텍스트를 텍스트 형태의 진료 데이터로서 추출할 수 있다. 여기서, 도 3의 S110 단계를 거쳐, 환자에 대한 텍스트 형태의 진료 데이터가 획득된 경우, 컴퓨팅 장치에 의해 수행되는 S210 단계가 생략할 수 있으나, 이에 한정되지 않는다. S220 단계에서, 컴퓨팅 장치는 S210 단계를 거쳐 변환된 텍스트 형태의 진료 데이터를 전처리할 수 있다. 여기서, 텍스트 형태의 진료 데이터를 전처리한다는 것은 텍스트 형태의 진료 데이터에 포함된 복수의 정보 중 필요 정보만을 추출하거나, 불필요 정보를 필터링하는 것을 의미할 수 있다. 일례로, 컴퓨팅 장치는 생성형 인공지능 모델을 통해 진료 데이터로부터 불필요 정보를 필터링할 수 있다. 예컨대, 컴퓨팅 장치는 진료 데이터와 진료 데이터로부터 불필요 정보를 필터링할 것을 지시하는 프롬프트 를 이용하여 입력 데이터를 생성하고, 생성된 입력 데이터를 생성형 인공지능 모델에 입력함으로써, 결과 데이 터로서 진료 데이터로부터 추출된 불필요 정보와 불필요 정보가 필터링된 진료 데이터를 획득할 수 있다. 다른 예로, 컴퓨팅 장치는 진료 데이터에 포함된 복수의 정보 중 진료와 관련된 키워드를 포함하는 정보를 필요 정보로서 추출하거나, 진료와 관련되지 않은 키워드를 포함하는 정보를 불필요 정보로서 필터링할 수 있다. 이를 위해, 진료와 관련된 키워드와 진료와 관련되지 않은 키워드에 관한 정보가 사전에 정의되어 저장될 수 있다. 또 다른 예로, 컴퓨팅 장치는 획득하고자 하는 의료 차트의 종류에 기초하여 정보 필터링 기준을 설정할 수 있고, 필터링 기준을 기반으로 진료 데이터에 포함된 복수의 정보 중 필요 정보만을 추출하거나, 불필요 정 보를 필터링할 수 있다.통상적으로, 의료 차트는 다양한 양식이 존재하며, 각각의 양식마다 요구하는 정보가 상이하기 때문에, 어떠한 종류의 의료 차트를 획득할 것인지에 따라 필요 정보와 불필요 정보가 상이할 수 있다. 예컨대, SOAP((Subjective, Objective, Assessment, Plan) 의료 차트 양식의 경우, 환자의 주관적 설명, 객관 적 검사 결과, 진단 평가, 치료 계획에 관한 정보가 필요하나, 개인적 세부사항, 관련 없는 이전 의료 기록 등 에 관한 정보는 불필요하다. 또한, PIE (Problem, Intervention, Evaluation) 의료 차트 양식의 경우, 식별된 문제, 취해진 개입, 개입의 효과 평가에 관한 정보가 필요하나, 문제와 직접 관련 없는 관찰이나 데이터는 불필요하다. 또한, FOCUS(Focus, Objective, Charting, Action, Summary) 의료 차트 양식의 경우, 특정 문제에 대한 집중,"}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "객관적인 데이터, 조치, 요약에 관한 정보가 필요하나, 주요 문제와 관련 없는 세부사항은 불필요하다. 즉, 각 의료 차트 양식마다 필요 정보와 불필요 정보가 상이한 바, 이러한 점을 고려하여, 컴퓨팅 장치는 획득하고자 하는 의료 차트의 종류에 기초하여 정보 필터링 기준으로서, 어떠한 정보가 필요한 지 또는 어떠한 정보가 필요없는 지를 정의할 수 있고, 이러한 정보 필터링 기준에 따라 필요 정보만을 추출하거나, 불필요 정 보를 필터링함으로써, 의료 차트가 정확하게 획득될 수 있도록 하는 것이다. S230 단계에서, 컴퓨팅 장치는 의료 차트 획득을 위한 프롬프트를 생성할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 기 설정된 구조의 프롬프트를 생성할 수 있다. 여기서, 기 설정된 구조는 획득하고자 하는 의료 차트의 종류와 의료 차트 생성을 지시하는 명령어를 포함하는 형태일 수 있다. 일례로, 획득하고자 하는 의료 차트의 종류가 SOAP 의료 차트인 경우, 기 설정된 구조의 프롬프트는 진료 데이 터를 기반으로 SOAP 의료 차트가 획득될 수 있도록 SOAP 의료 차트 형태의 정보가 도출되도록 유도하는 형태의"}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "구조(예: \"환자와 의사의 대화를 요약해서 SOAP 의료 차트 양식으로 재구성해줘\")를 가질 수 있다. S240 단계에서, 컴퓨팅 장치는 S210 단계를 거쳐 변환된 텍스트 형태의 진료 데이터 또는 S220 단계를 거 쳐 전처리된 텍스트 형태의 진료 데이터와 S230 단계를 거쳐 생성된 프롬프트를 포함하는 입력 데이터를 생성할 수 있다. S250 단계에서, 컴퓨팅 장치는 S240 단계를 거쳐 생성된 입력 데이터를 생성형 인공지능 모델에 입력함에 따라 진료 데이터에 대응하는 의료 차트를 결과 데이터로서 획득할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 진료 데이터에 적합한 의료 차트 양식을 선정할 수 있고, 선정된 의료 차트 양식에 맞춰 의료 차트를 획득할 수 있다. 예컨대, 컴퓨팅 장치는 진료 데이터로부터 복수의 키워드 를 추출할 수 있고, 복수의 키워드를 기반으로 사전에 설정된 복수의 의료 차트 양식 중 어느 하나의 의료 차트 양식을 선택할 수 있으며, 어느 하나의 의료 차트 양식에 대응하여 진료 데이터를 가공함에 따라 의료 차트를 획득할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 진료 데이터를 분석하여 진료 과목 및 질병 정보를 추출할 수 있고, 추 출된 진료 과목 및 질병에 대응하여 사전에 설정된 복수의 의료 차트 양식 중 어느 하나의 의료 차트 양식을 선 택할 수 있으며, 어느 하나의 의료 차트 양식에 대응하여 진료 데이터를 가공함에 따라 의료 차트를 획득할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 진료 데이터로부터 기 설정된 의료 차트 양식에 포함된 복수의 항목 각 각에 대응하는 키워드를 추출하고, 키워드를 기반으로 복수의 항목 각각에 대응하는 정보를 획득할 수 있으며, 획득된 정보들을 복수의 항목 각각에 대응하는 영역에 배치함에 따라 기 설정된 의료 차트 양식의 의료 차트를 획득할 수 있다. 이때, 컴퓨팅 장치는 복수의 항목 중 어느 하나의 항목에 대응하는 키워드가 추출되지 않는 경우, 어느 하 나의 항목을 제외한 나머지 항목들에 대응하여 추출된 키워드를 기반으로 어느 하나의 항목에 대응하는 정보를 획득할 수 있다. 일례로, 컴퓨팅 장치는 SOAP 의료 차트를 획득하고자 하는 경우, 진료 데이터로부터 추출된 키워드를 기반 으로, S(Subjective) 항목, O(Objective) 항목, A(Assessment) 항목 및 P(Plan) 항목 각각에 대응하는 정보를 획득하되, P(Plan) 항목에 대응하는 키워드(예: 환자의 치료 및 추적 계획과 관련된 키워드)가 추출되지 않을경우, S(Subjective) 항목, O(Objective) 항목 및 A(Assessment) 항목 각각에 대응하여 추출된 키워드를 기반 으로 환자의 치료 및 추적 계획을 예측할 수 있고, 예측된 치료 및 추적 계획에 기초하여 P(Plan) 항목에 대한 내용을 획득할 수 있다. 다른 예로, 컴퓨팅 장치는 P(Plan) 항목에 대응하는 키워드(예: 환자의 치료 및 추적 계획과 관련된 키워 드)가 추출되지 않을 경우, 사전에 학습된 진료, 진단 및 처방 모델(예: 논문/치료 기록 등의 데이터를 기반으 로 학습된 모델)을 기반으로 환자의 치료 및 추적 계획을 도출할 수 있고, 도출된 치료 및 추적 계획에 관한 정 보를 P(Plan) 항목에 대응하는 정보로서 획득할 수 있다. 또 다른 예로, 컴퓨팅 장치는 P(Plan) 항목에 대응하는 키워드(예: 환자의 치료 및 추적 계획과 관련된 키 워드)가 추출되지 않을 경우, 룰베이스(rule-base) 모델을 통해 사전에 설정된 처방 정보를 P(Plan) 항목에 대 응하는 정보로서 획득할 수 있다. 여기서, 사전에 설정된 처방 정보는 진단명에 대응하여 기 설정된 처방 정보 또는 P(plan) 항목에 대응하는 키 워드가 없는 경우에 대응하여 기 설정된 처방 정보 등과 같이 의료진들 간의 사전에 약속, 협의된 오더에 기초 한 처방 정보일 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 컴퓨팅 장치는 사용자로부터 서로 다른 복수의 의료 차트 양식에 맞춰 의료 차트를 획 득할 것을 요청받는 경우, 서로 다른 복수의 의료 차트 양식에 맞춰 의료 차트를 생성할 것을 명령하는 프롬프 트를 생성하여 생성형 인공지능 모델에 입력함으로써, 서로 다른 복수의 의료 차트 양식 각각에 대응하는 복수 의 의료 차트를 획득할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 사용자로부터 획득하고자 하는 의료 차트의 종류가 지정되지 않을 경우, 진료 데이터를 분석하여 추출된 키워드를 기반으로 획득 가능한 의료 차트의 종류를 판단할 수 있고, 판 단된 종류의 의료 차트 양식에 맞춰 의료 차트를 획득할 수 있다. 예컨대, 컴퓨팅 장치는 진료 데이터를 기반으로 SOAP 의료 차트, PIE 의료 차트 및 FOCUS 의료 차트의 획득이 가능한 경우, 진료 데이터를 이용하여 SOAP 의료 차트, PIE 의료 차트 및 FOCUS 의료 차트 각각을 획득할 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 컴퓨팅 장치는 상기의 과정을 거쳐 획득된 의료 차트를 검증할 수 있다. 일례로, 컴퓨팅 장치는 상기의 과정을 거쳐 획득된 의료 차트를 이용하여 검증용 진료 데이터를 생성할 수 있고, 의료 차트 획득을 위해 사용된 원본 진료 데이터와 검증용 진료 데이터 간의 유사도를 산출할 수 있으며, 산출된 유사도가 임계값 이상인지 여부에 따라 의료 차트의 적절성을 판단할 수 있다. 다른 예로, 컴퓨팅 장치는 상기의 과정을 거쳐 획득된 의료 차트를 사용자에게 제공할 수 있고, 사용자로 부터 의료 차트가 적절하지 않다는 피드백을 획득하는 경우, 진료 데이터를 기반으로 의료 차트를 재획득할 수 있다. 이때, 컴퓨팅 장치는 사용자로부터 의료 차트가 적절하지 않은 사유를 객관식 혹은 주관식으로 입력받을 수 있으며, 사용자로부터 입력받은 사유를 프롬프트에 추가함으로써, 의료 차트가 적절하지 않은 사유를 반영하 여 의료 차트가 재획득되도록 할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 환자에 대한 진료 데이터로서, 음성 형태의 진료 데이터와 이미지 형태 의 진료 데이터(예: 터치펜 등을 통해 사용자 단말에 출력된 UI 상에 수기로 입력된 진료 내용을 캡쳐한 이미지 등)를 함께 획득하는 경우, 음성 형태의 진료 데이터를 기반으로 의료 차트를 획득할 수 있고, 의료 차 트와 이미지 형태의 진료 데이터를 연동하여 저장할 수 있다. 다시, 도 3을 참조하면, S130 단계에서, 컴퓨팅 장치는 S110 단계를 거쳐 획득된 진료 데이터와 S120 단계 를 거쳐 획득된 의료 차트를 출력하는 UI를 제공할 수 있다. 여기서, UI는 도 8에 도시된 바와 같이, 진료 데이터가 출력되는 제1 영역과 의료 차트를 출력하는 제2 영역을 포함할 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 컴퓨팅 장치는 진료 데이터에 대응하여 서로 다른 종류의 복수의 의료 차트가 획득되 는 경우, UI의 서로 다른 영역을 통해 복수의 의료 차트 각각을 개별적으로 출력할 수 있다. 예컨대, 컴퓨팅 장 치는 서로 다른 복수의 의료 차트 각각에 개별적으로 출력하는 복수의 탭을 포함하는 UI를 생성하여 사용 자 단말로 제공할 수 있으나, 이에 한정되지 않는다.다양한 실시예에서, 컴퓨팅 장치는 UI를 통해 특정 진료 데이터와 특정 진료 데이터를 기반으로 획득된 특 정 의료 차트를 함께 출력하되, 특정 의료 차트를 생성하는 과정에서 특정 진료 데이터로부터 하나 이상의 불필 요 정보가 필터링된 경우, 하나 이상의 불필요 정보를 취합하여 특정 의료 차트와 함께 제공할 수 있다. 예컨대, 컴퓨팅 장치는 UI의 제1 영역을 통해 진료 데이터를 출력하고, UI의 제2 영역 상단부를 통해 의료 차트를 출력하며, UI의 제2 영역 하단부를 통해 필터링된 불필요 정보들을 출력할 수 있다. 이때, 컴퓨팅 장치는 UI를 통해 불필요 정보를 출력함과 동시에, 불필요 정보가 진료 데이터로부터 필터링 된 사유에 관한 정보(예: 진료와 관계없음 등)를 함께 출력할 수 있으나, 이에 한정되지 않는다. 즉, 컴퓨팅 장치는 진료 데이터, 의료 차트 및 진료 데이터로부터 필터링된 불필요 정보를 포함하는 레포 트를 생성하고, 생성된 레포트를 출력하는 UI를 제공하여, 사용자가 하나의 화면을 통해 진료 데이터, 의료 차 트 및 불필요 정보를 모두 확인할 수 있도록 함으로써, 보다 효율적인 진료를 수행할 수 있도록 한다. 전술한 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법은 도면에 도시된 순서도를 참조하여 설명하였 다. 간단한 설명을 위해 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법은 일련의 블록들로 도시하여 설명하였으나, 본 발명은 상기 블록들의 순서에 한정되지 않고, 몇몇 블록들은 본 명세서에 도시되고 서술된 것 과 상이한 순서로 수행되거나 또는 동시에 수행될 수 있다. 또한, 본 명세서 및 도면에 기재되지 않은 새로운 블록이 추가되거나, 일부 블록이 삭제 또는 변경된 상태로 수행될 수 있다. 이하, 도 5 내지 도 9를 참조하여, 컴퓨팅 장치가 제공하는 UI에 대해 설명하도록 한다. 도 5 내지 도 9는 다양한 실시예에 적용 가능한 사용자 인터페이스(User Interface, UI)를 예시적으로 도시한 도면이다. 먼저, 도 5를 참조하면, 컴퓨팅 장치는 사용자로부터 사용자 단말을 통해 서비스 실행 요청(예컨대, 의료 차트 자동생성 서비스를 제공하는 애플리케이션의 실행)을 획득하는 경우, 사용자 단말로 제1 UI(1 1)를 제공할 수 있다. 여기서, 제1 UI는 의료 차트 자동생성 서비스의 시작 화면을 출력하는 UI일 수 있으나, 이에 한정되지 않는 다. 다음으로, 도 6을 참조하면, 컴퓨팅 장치는 사용자 단말로 제1 UI을 제공한 이후 소정의 시간이 경과할 경우 또는 사용자로부터 제1 UI의 적어도 일부분을 터치하는 입력을 획득할 경우, 사용자 단말(20 0)로 제2 UI를 제공할 수 있다. 여기서, 제2 UI는 의료 차트 자동생성 서비스를 이용하기 위해 필요한 사용자의 계정 정보를 입력받는 로그 인 화면을 출력하는 UI일 수 있다. 예컨대, 제2 UI는 사용자의 계정 정보 입력 필드(ID), 비밀번호 입력 필 드(PASSWORD), 로그인 버튼(LOGIN), 비밀번호 변경 버튼(Password Change), 회원가입 버튼(Sign up), 사용자 커뮤니티 진입 버튼(User community) 및 원격 도움 버튼(remote support)을 포함할 수 있으나, 이에 한정되지 않는다. 다음으로, 도 7을 참조하면, 컴퓨팅 장치는 의료 차트를 획득하고자 하는 사용자로부터 진료 데이터 업로 드 요청을 획득하는 경우, 사용자 단말로 제3 UI를 제공할 수 있다. 여기서, 제3 UI는 녹음 기능을 제공하는 UI일 수 있다. 예컨대 제3 UI는 녹음 시작 버튼(Start), 녹음 종료 버튼(Stop), 녹음 이력 버튼(History), 메뉴 버튼(Menu)을 포함할 수 있다. 일례로, 제3 UI는 도 7의 (A)에 도시된 바와 같이 녹음 시작 버튼(Start)을 포함할 수 있으며, 컴퓨팅 장치 는 사용자로부터 녹음 시작 버튼을 선택하는 제1 사용자 입력을 획득함에 따라 도 7의 (B)에 도시된 바와 같이 녹음 기능을 활성화하여 음성 입력 장치(예: 마이크)를 통해 입력되는 음성을 녹음할 수 있다. 또한, 제3 UI는 도 7의 (A)에 도시된 바와 같이 녹음 종료 버튼(Stop)을 포함할 수 있으며, 컴퓨팅 장치 는 녹음 기능이 활성화된 상태에서 사용자로부터 녹음 종료 버튼을 선택하는 제2 사용자 입력을 획득함에 따라 녹음 기능을 중지할 수 있고, 제1 사용자 입력을 획득한 시점부터 제2 사용자 입력을 획득한 시점까지의 음성을 녹음함에 따라 음성 형태의 진료 데이터를 생성할 수 있다.다음으로, 도 8을 참조하면, 컴퓨팅 장치는 사용자로부터 진료 데이터가 획득된 경우, 사용자 단말로 제4 UI를 제공할 수 있다. 여기서, 제4 UI는 사용자로부터 획득된 진료 데이터에 대응하여 획득된 의료 차트를 출력하는 UI일 수 있다. 예컨대. 제4 UI는 진료 데이터 리스트 출력 영역, 제1 영역, 제2 영역, 의료 차트 변환 버튼 (Translation) 및 변환 재수행 버튼(Do it again)을 포함할 수 있다. 진료 데이터 리스트 출력 영역(14A)은 사용자로부터 획득된 복수의 진료 데이터들을 사전에 설정된 조건(예: 진 료 데이터 업로드 순, 환자명 가나다순, 의료 차트 획득 시간 순 등)에 따라 정렬한 진료 데이터 리스트를 출력 하는 영역일 수 있다. 제1 영역(14B)은 진료 데이터가 출력되는 영역일 수 있다. 예컨대, 컴퓨팅 장치는 사용자로부터 진료 데이 터 리스트 출력 영역에 출력된 복수의 진료 데이터 중 특정 진료 데이터가 선택되는 경우, 특정 진료 데이터에 해당하는 텍스트를 제1 영역(14B)을 통해 출력할 수 있다. 제2 영역(14C)은 의료 차트가 출력되는 영역일 수 있다. 예컨대, 컴퓨팅 장치는 사용자로부터 진료 데이터 리스트 출력 영역에 출력된 복수의 진료 데이터 중 특정 진료 데이터가 선택될 때, 특정 진료 데이터에 대응하 는 의료 차트를 제2 영역(14C)을 통해 출력할 수 있다. 여기서, 컴퓨팅 장치는 특정 진료 데이터에 대응하여 기 획득된 의료 차트가 있을 경우, 특정 진료 데이터 에 대응하여 기 획득된 의료 차트를 제2 영역(14C)을 통해 출력할 수 있다. 한편, 특정 진료 데이터에 대응하여 기 획득된 의료 차트가 없을 경우, 사용자가 의료 차트 변환 버튼(Translation)을 선택하여 특정 진료 데이터에 대한 의료 차트를 획득할 것을 가이드할 수 있다. 또한, 컴퓨팅 장치는 사용자로부터 변환 재수행 버튼(Do it again)을 선택하는 사용자 입력을 획득하는 경 우, 제1 영역(14B)을 통해 출력된 진료 데이터에 대응하는 의료 차트를 재획득할 수 있고, 재성성된 의료 차트 를 제2 영역(14C)을 통해 출력할 수 있다. 그러나, 이에 한정되지 않고, 컴퓨팅 장치는 제1 영역(14B)을 통해 출력된 특정 진료 데이터의 적어도 일 부 내용이 사용자로부터 수정되는 경우, 수정된 내용에 따라 의료 차트를 자동적으로 재획득하여 제2 영역(14 C)을 통해 출력할 수 있다. 이때, 컴퓨팅 장치는 제1 영역(14B)을 통해 출력된 특정 진료 데이터에 대하여 복수의 의료 차트가 획득된 경우, 복수의 의료 차트 각각을 서로 다른 탭으로 분할하여 각각의 탭에 포함된 제2 영역(14C)을 통해 출력할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 제1 영역(14B)를 통해 출력된 특정 진료 데이터로부터 특정 정보가 불 필요 정보인 것으로 판단될 경우, 특정 정보를 진료와 관계없는 정보로 분류할 수 있고, 특정 정보가 불필요 정 보로서 분류 및 필터링 되었음을 제1 영역(14B) 상에 표시(예컨대, 취소선, 하이라이트 표시, 불필요 정보임을 명시하는 텍스트 입력 등)할 수 있다. 마지막으로, 컴퓨팅 장치는 사용자로부터 환자에게 제공할 진료 기록지 작성 요청을 획득하는 경우, 제5 UI를 제공할 수 있다. 여기서, 제5 UI는 진료 데이터 기반으로 작성된 진료 기록지를 출력하는 UI일 수 있다. 여기서, 진료 계획서와 진료 기록지는 의학 전문가가 아닌 환자에게 제공되는 서류인 바, 의학 전문 용어가 아 닌 layman’s terms로 번역되며, 환자들이 직관적으로 이해하기 쉽게끔 안내문 형식으로 작성되어 제5 UI를 통해 출력될 수 있다. 이 밖에도, 컴퓨팅 장치는 사용자가 환자를 진료하는 과정에서, 환자의 진료 내용을 보다 편리하게 수기로 기록할 수 있도록, 펜 및 그림 기능을 제공하는 UI, 텍스트 또는 이미지 형태의 진료 데이터를 업로드 받기 위 한 UI 등 다양한 기능을 제공하는 UI를 제공할 수 있다."}
{"patent_id": "10-2024-0106191", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2024-0106191", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 첨부되는 다음의 도면들은 본 발명의 바람직한 실시예를 예시하는 것이며, 발명의 상세한 설명과 함께 본 발명의 기술사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재된 사항에만 한정되어 해석되어서는 아니 된다. 도 1은 본 발명의 일 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 시스템을 도시한 도면 이다. 도 2는 본 발명의 다른 실시예에 따른 컴퓨팅 장치의 하드웨어 구성도이다. 도 3은 본 발명의 또 다른 실시예에 따른 생성형 인공지능 모델을 이용한 의료 차트 자동생성 방법의 순서도이 다. 도 4는 다양한 실시예에서, 생성형 인공지능 모델을 통해 의료 차트를 획득하는 방법을 설명하기 위한 순서도이 다. 도 5 내지 도 9는 다양한 실시예에 적용 가능한 사용자 인터페이스(User Interface, UI)를 예시적으로 도시한 도면이다."}
