{"patent_id": "10-2024-0100493", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0122701", "출원번호": "10-2024-0100493", "발명의 명칭": "전립선암 진단을 위한 바이오마커, 이들의 조합, 및 이의 용도", "출원인": "한국과학기술연구원", "발명자": "이관희"}}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "PSMA(prostate-specific membrane antigen), ERG(erythroblast transformation-specific related geneprotein) 및 ENG(endoglin)으로 구성된 군에서 선택된 하나 이상을 포함하는, 전립선암 진단용 바이오마커 조성물로서,상기 조성물은 ANXA3(annexin A3)를 포함하지 않는 것인, 조성물."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 조성물은 ERG 및 ENG를 포함하고, ANXA3(annexin A3)를 포함하지 않는 것인, 바이오마커 조성물."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "PSMA(prostate-specific membrane antigen), ERG(erythroblast transformation-specific related geneprotein) 및 ENG(endoglin)으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현수준을 측정할 수 있는 제제를 포함하는, 전립선암 진단용 조성물로서,상기 조성물은 ANXA3(annexin A3) 단백질 또는 이를 암호화하는 유전자의 발현 수준을 측정할 수 있는 제제를포함하지 않는 것인, 조성물."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서, 상기 조성물은 ERG 및 ENG의 단백질 또는 이를 암호화하는 유전자의 발현 수준을 측정할 수있는 제제를 포함하고, ANXA3(annexin A3) 단백질 또는 이를 암호화하는 유전자의 발현 수준을 측정할 수 있는제제를 포함하지 않는 것인, 조성물."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3 또는 4의 조성물을 포함하는, 전립선암 진단용 키트."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 키트는 전기화학적 바이오센서인 것인, 키트."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "개체로부터 분리된 생물학적 시료로부터, PSMA(prostate-specific membrane antigen), ERG(erythroblasttransformation-specific related gene protein) 및 ENG(endoglin)으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준을 측정하는 단계를 포함하고, ANXA3(annexin A3) 단백질 또는 이를 암호화하는 유전자의 발현 수준을 측정하는 단계를 포함하지 않는 것인,전립선암 진단을 위한 정보제공 방법."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "에 있어서, 상기 방법은상기 개체의 발현 수준이 상기 대조군보다 높은 경우, 상기 개체를 전립선암이 발병한 것으로 판별하거나 발병위험을 높은 수준으로 예측하는 단계를 추가로 포함하는 것인, 방법."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7에 있어서, 상기 방법은상기 측정된 단백질 또는 이를 암호화하는 유전자의 발현 수준을 기계학습 알고리즘 모델에 적용하는 단계를 추가로 포함하는 것인, 방법."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서, 상기 기계학습 알고리즘 모델은 1) 전립선암 환자에서의 PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준 및 2) 대조군에서의 PSMA, ERG 및ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준을 입력값으로 설정하여 학습된 것인, 방법."}
{"patent_id": "10-2024-0100493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서, 상기 기계학습 알고리즘 모델에 적용하는 단계는 상기 개체에서 측정된 단백질 또는 이를암호화하는 유전자의 발현 수준을 상기 기계학습 알고리즘 모델에 입력하여, 출력값으로서 상기 개체의 전립선암 발병 여부 또는 발병 위험 여부를 출력하는 것을 포함하는 것인, 방법."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전립선암 진단을 위한 바이오마커 및 이의 용도에 관한 것이다. 본 발명의 전립선암 진단용 바이오마커 조성물에 따르면, 전립선암을 효과적으로 진단할 수 있는 최적의 바이오 마커 조합을 발굴하였으며, 상기 바이오마커 조합 및 기계학습 모델 알고리즘을 이용하여 높은 정확도로 전립선 암을 진단할 수 있다는 장점이 있다."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전립선암 진단을 위한 바이오마커 및 이의 용도에 관한 것이다."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전립선암은 남성의 전립선에 발생하는 악성종양이며, 발병률이 높은 고위험군의 병으로 알려져 있다. 특히 전 립선암은 미국에서 두 번째로 흔한 암 사망 원인으로 알려져 있을 뿐만 아니라 2016년 국가 암 등록 통계에 따 르면 2016년에 새로 발생한 암 환자의 수는 전년도(2015년) 21만 2542명에 비해 22만 9180명(남 12만 68명, 여 10만 9112명)으로 1만 2638명(5.8%)가 증가한 것으로 보도되었고, 이 중 전립선암은 2015년과 비교 하였을 때, 간암을 제치고 4번째로 많이 발생하는 암으로 보고되었다. 최근 우리나라도 고령화 사회로 진입하면서 전립선암의 유병률이 증가한 것으로 보이는데, 그 이유는 전립선 암의 가장 중요한 위험 인자가 나이로 주로 60대 이후 노인에게 전립선암이 많이 발생하기 때문이다. 하지만 50대 이하의 남성에게서도 많이 발병하고 있는 실정이다. 따라서, 전립선암은 꾸준한 관리가 필요한 만성 질환 으로 자리 잡고 있으며, 이에 대한 전립선암의 정확한 진단이 필요한 시점이다. 또한, 전립선암은 예측하기 어려운 병의 진행 형태를 보이기 때문에 예후를 통해 사전에 예측하는 것이 필요하다. 한편, 현재까지 암 진단 방법은 조직 샘플의 채취 및 내시경 검사와 같은 침습적인 방법으로 이루어지고 있다. 특히, 조직검사는 질병이 의심되는 부위의 일부를 적출해 현미경으로 관찰하는 방식으로 이루어지고 있다. 따라 서, 조직 샘플을 채취하기 위해 침이나 펀치, 내시경 또는 복강경을 이용하기 위해서는, 인체를 절개하여야 하 므로, 환자가 느끼는 불편함이 적지 않을 뿐 아니라 흉터가 남고 회복하는데 오랜 시간이 걸린다. 전립선암 진단을 위한 종래기술로는 PSA(Prostate Specific Antigen) 측정 및 바이옵시가 있다. PSA 측정은 전립선암 진단에서 가장 많이 쓰이는 방법으로, 전립선 세포에서 만들어지는 특이 항원 수치를 측정해 전립선 암 위험도를 결정짓는 방법이다. 악성 전립선암일수록 PSA 수치는 높으며, 전립선암이 없는 대부분의 남성들 은 4ng/mL 미만의 수치를 가지고 있다. 하지만 측정한 PSA 수치가 전립선암의 부재에도 불구하고 굉장히 높거나 혹은 PSA gray zone(PSA 4ng/mL 이상 10ng/mL 이하)구간에 들어 설 경우 바이옵시를 요하게 된다. 바이옵시 는 암이 의심되는 장기 부분의 조직을 바늘로 취해 병리조직학적 검사를 통해 환자의 해당 장기에 암, 육종 등 의 악성종양 유무를 진단하는 방법이다. 이러한 바이옵시 검사는 환자들로 하여금 굉장히 고통스러우며, 특히 PSA gray zone에서의 전립선암 진단의 정확률은 채 30% 가 되질 않는다. 즉 다시 말해 약 70%의 환자들이 PSA 의 한계로 인해 비용이 들고 고통스러운 리바이옵시를 겪게 된다는 단점이 있다. 따라서, 본 발명에서는 이러한 한계를 극복하기 위해 전립선암 진단을 위한 전립선암 특이적 다중 바이오마커 조합을 발굴하였으며, 상기 다중 바이오마커 측정 신호와 전립선암간의 상관관계를 인공지능 기술을 이용하여 분석함으로서 본 발명을 완성하였다."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 양상은 ANXA3(annexin A3), PSMA(prostate-specific membrane antigen), ERG(erythroblast transformation-specific related gene protein) 및 ENG(endoglin)으로 구성된 군에서 선택된 하나 이상을 포 함하는, 전립선암 진단용 바이오마커 조성물을 제공한다. 다른 양상은 ANXA3(annexin A3), PSMA(prostate-specific membrane antigen), ERG(erythroblast transformation-specific related gene protein) 및 ENG(endoglin)으로 구성된 군에서 선택된 하나 이상의 단 백질 또는 이를 암호화하는 유전자의 발현 수준을 측정할 수 있는 제제를 포함하는, 전립선암 진단용 조성물을 제공한다. 또 다른 양상은 상기 전립선암 진단용 조성물을 포함하는, 전립선암 진단용 키트를 제공한다. 또 다른 양상은 개체로부터 분리된 생물학적 시료로부터, ANXA3(annexin A3), PSMA(prostate-specific membrane antigen), ERG(erythroblast transformation-specific related gene protein) 및 ENG(endoglin)으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준을 측정하는 단계를 포함하 는, 전립선암 진단을 위한 정보제공 방법을 제공한다."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 양상은 ANXA3(annexin A3), PSMA(prostate-specific membrane antigen), ERG(erythroblast transformation-specific related gene protein) 및 ENG(endoglin)으로 구성된 군에서 선택된 하나 이상을 포 함하는, 전립선암 진단용 바이오마커 조성물을 제공하는 것이다. 상기 바이오마커 조성물은 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준을 검출 또는 측정함으로서 특정 개체의 전립선암을 진단하거나 및/또는 예후를 예측할 수 있다. 본 명세서에서의 용어 \"진단\"은 병리 상태의 존재 또는 특징을 확인하는 것을 의미한다. 본 발명의 목적상, 진 단이란 전립선암의 발병 여부를 판별하는 것을 의미하는 것일 수 있다. 본 명세서에서의 용어 \"예후\"는 병세의 진행, 회복에 관한 예측을 의미하는 것으로, 전망 내지는 예비적 평가를 말한다. 본 발명의 목적상, 예후란 전립선암의 치료 후 해당 개체에서 치료 성공 여부, 생존, 재발, 전이, 약물 반응성, 내성 등과 같은 여부를 판단하는 것을 의미한다. 즉, 의학적 귀추(예컨대, 장기 생존 가능성, 무병생존 율 등)에 대한 예상을 의미하며, 양성적 예후(긍정적 예후) 또는 음성적 예후(부정적 예후)를 포함하며, 상기 음성적 예후는 재발, 종양 성장, 전이, 약 저항성 등의 병의 진행 또는 치명성(mortality)을 포함하고, 양성적 예후는 질병이 없는 상태 등의 질병의 차도, 종양 퇴행 등의 질병의 개선 또는 안정화(stabilization)를 포함한 다. 본 명세서에서의 용어 \"예측\"은 의학적 귀추에 대하여 미리 헤아려 짐작하는 것을 의미하며, 본 발명의 목적 상 전립선암으로 진단받은 환자의 병의 경과(병의 진행, 개선, 암의 재발, 종양 성장, 약 저항성)를 미리 짐작하 는 것을 의미하는 것일 수 있다. 본 명세서에서의 용어 \"전립선암 (prostate cancer, PCa)\"은 전립선에서 발생하는 암을 의미한다. 전립선 (prostate)은 방광 바로 밑, 직장 앞쪽에 있는 밤톨만 한 크기의 남성 생식기관으로, 정액의 일부를 만들어내고 저장하는 역할을 한다. 위로는 방광경부, 즉 방광에서 요도로 이행하는 부위와 인접해 앞쪽의 치골전립 선인대에 고정되어 있고, 아래로는 비뇨생식격막에 의해 고정되어 있다. 전립선에서 발생하는 암의 대부분은 전립선 세포에서 발생하는 선암(샘세포의 암)이며, 종양 조직의 분화 정도와 세포의 특성 등에 따라 유형을 구분할 수 있다. 본 명세서에서의 용어 \"바이오마커(biomarker)\"는 일반적으로 단백질, 핵산(DNA 및 mRNA 등), 대사물질(지질, 당지질, 당단백질 및 당 등) 등의 유기생체분자를 이용해 몸 안의 변화를 알아 낼 수 있는 지표를 의미하는 것으로서, 구체적으로 특정 질병이나 또는 암의 경우에서 정상이나 병적인 상태를 구분할 수 있거나 치료 반응을 예측할 수 있고 객관적으로 측정할 수 있는 표지자를 의미한다. 바이오마커는 그 활용에 따라, 약물 타겟의 존 재를 확인하는 타겟마커, 병의 유무를 진단하는 진단마커, 특정 약물에 대한 반응군과 비반응군을 구별할 수 있 는 예상마커, 약물 치료효과를 모니터링할 수 있는 대리표지자마커, 질병의 예후를 알려주는 예후 바이오마커 등이 있다. 상기 ANXA3(annexin A3)는 ANXA3 유전자에 의해 암호화되는 단백질로서, annexin 패밀리에 속한다. 상기 단백질 은 포스포리파제 A2를 억제하고 이노시톨 1,2-사이클릭 포스페이트를 절단하여 이노시톨 1-포스페이트를 형성하 는 기능을 하는 것으로 알려져 있으며, 또한 항응고 작용을 할 수 있다. 상기 ANXA3는 인간에서 Uniprot 번호 P12429의 아미노산 서열을 포함할 수 있다. 상기 ANXA3는 바람직하게 서열번호 1의 아미노산 서열을 포함할 수 있으나, 서열번호 1의 아미노산 서열과 90% 이상, 93% 이상, 95% 이상, 96% 이상, 97% 이상, 98% 이상, 또는 99% 이상 동일한 서열을 포함하는 것일 수 있 다. 상기 PSMA(prostate-specific membrane antigen)는 FOLH1 유전자에 의해 암호화되는 단백질로서, GCPII (Glutamate carboxypeptidase II)로도 알려져 있다. PSMA는 주로 전립선 상피, 신장의 근위세뇨관, 소장에서 공장의 브러쉬 보더 및 신경계의 신경절에서 주로 발현하는 것으로 알려져 있다. 특히, 인간 PSMA는 전립선에 높게 발현되어 있으며, 일부 전립선암에서는 비암성 전립선 세포보다 8-12배 상향되어 발현된다. PSMA는 인간에 서 Uniprot 번호 Q04609의 아미노산 서열을 포함할 수 있다. 상기 PSMA는 바람직하게 서열번호 2의 아미노산 서열을 포함할 수 있으나, 서열번호 2의 아미노산 서열과 90% 이상, 93% 이상, 95% 이상, 96% 이상, 97% 이상, 98% 이상, 또는 99% 이상 동일한 서열을 포함하는 것일 수 있 다. 상기 ERG(erythroblast transformation-specific related gene protein) ERG 유전자에 의해 암호화되는 단백질 로서, 전사 조절자 역할을 하는 것으로 알려져 있다. ERG는 성숙한 림프구보다 초기 골수구에서 더 높은 수준으 로 발현되는 바, ERG는 초기 조혈 세포의 분화 조절자 역할을 할 수 있다. 또한, ERG 유전자는 원 종양 형성 유 전자(proto-oncogene)으로 분류되며, 세포분열 시 발생하는 염색체 전위에서 다른 염색체와 융합할 수 있다. 상 기 ERG는 인간에서 Uniprot 번호 P11308의 아미노산 서열을 포함할 수 있다. 상기 ERG는 바람직하게 서열번호 3의 아미노산 서열을 포함할 수 있으나, 서열번호 3의 아미노산 서열과 90% 이 상, 93% 이상, 95% 이상, 96% 이상, 97% 이상, 98% 이상, 또는 99% 이상 동일한 서열을 포함하는 것일 수 있다. 상기 ENG(endoglin)는 ENG 유전자에 의해 암호화되는 단백질로서, 세포 표면에 위치한 타입I 막 당단백질이며 TGF 베타 수용체 복합체의 일부를 구성한다. 상기 ENG는 혈관 신생에 중요한 역할을 하며, 종양 성장, 생존 및 암세포의 신체의 다른 위치로의 전이에 중요한 단백질로 알려져 있다. 상기 ENG는 인간에서 Uniprot 번호 P17813의 아미노산 서열을 포함할 수 있다. 상기 ENG는 바람직하게 서열번호 4의 아미노산 서열을 포함할 수 있으나, 서열번호 4의 아미노산 서열과 90% 이 상, 93% 이상, 95% 이상, 96% 이상, 97% 이상, 98% 이상, 또는 99% 이상 동일한 서열을 포함하는 것일 수 있다. 상기 전립선암 진단용 바이오마커는 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 둘 이상의 조합을 포함 하는 것일 수 있으며, 구체적으로 PSMA/ERG, PSMA/ENG, ENG/ERG, ANXA3/ENG/ERG, PSMA/ENG/ERG 및 ANXA3/PSMA/ENG/ERG 중 선택된 바이오마커 조합을 포함하는 것일 수 있으며, 보다 구체적으로 ERG 및 ENG을 포 함하는 것일 수 있다. 또한, 상기 전립선암 진단용 바이오마커는 진단 정확도를 향상시키기 위해 ANXA3는 포함 하지 않는 것일 수 있다. 다른 양상은 ANXA3(annexin A3), PSMA(prostate-specific membrane antigen), ERG(erythroblast transformation-specific related gene protein) 및 ENG(endoglin)으로 구성된 군에서 선택된 하나 이상의 단 백질 또는 이를 암호화하는 유전자의 발현 수준을 측정할 수 있는 제제를 포함하는, 전립선암 진단용 조성물을제공하는 것이다. 상기에서 설명한 내용과 동일한 부분은 상기 조성물에도 공히 적용된다. 본 명세서에서의 용어 \"발현 수준의 측정\"은 특정 단백질(펩타이드) 또는 상기 단백질을 암호화하는 유전자의 존재 여부, 발현 여부 또는 발현 정도를 측정하는 것으로서, 구체적으로 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 mRNA 또는 유전자의 발현 수준을 측정하는 것일 수 있 다. 상기 전립선암 진단용 조성물은 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 둘 이상의 단백질 또는 이 를 암호화하는 mRNA 또는 유전자의 발현 수준을 측정할 수 있는 제제를 포함하는 것일 수 있으며, 구체적으로 PSMA/ERG, PSMA/ENG, ENG/ERG, ANXA3/ENG/ERG, PSMA/ENG/ERG 및 ANXA3/PSMA/ENG/ERG 중 선택된 바이오마커 조 합의 발현 수준을 측정하는 제제를 포함하는 것일 수 있으며, 보다 구체적으로 ERG 및 ENG 단백질 또는 이를 암 호화하는 mRNA 또는 유전자의 발현 수준을 측정할 수 있는 제제를 포함하는 것일 수 있다. 또한, 상기 전립선암 진단용 조성물은 진단 정확도를 향상시키기 위해 ANXA3 단백질 또는 이를 암호화하는 mRNA 또는 유전자의 발현 수준을 측정할 수 있는 제제를 포함하지 않는 것일 수 있다. 상기 단백질의 발현 수준을 측정하는 방법은 웨스턴 블랏팅(Western blotting), ELISA(enzyme linked immunosorbent assay), 방사선면역분석(RIA: radioimmunoassay), 방사 면역 확산법(radical immunodiffusion), 오우크테로니면역 확산법(Ouchterlony immunodiffusion), 로케트 면역전기영동(rocket immunoeletrophoresis), 면역조직화학염색법(immunohistochemical staining), 면역침전분석법(immunoprecipitation assay), 보체 고정 분석법(complenent Fixation Assay), 면역형광법(immunofluorescence), 면역크로마토그래피법 (immunochromatography), FACS 분석법(fluorescenceactivated cell sorter analysis), 단백질 칩 방법 (protein chip technology) 또는 바이오센서(biosensor)인 것일 수 있다. 상기 mRNA 또는 유전자의 발현 수준을 측정하는 방법은 역전사효소 중합반응(RT-PCR), 경쟁적 역전사효소 중합 효소반응(competitive RT-PCR), 실시간 역전사 효소 중합효소반응(real time quantitative RT-PCR), 정량적 중 합효소반응(quantitative RT-PCR), RNase 보호 분석법(RNase protection method), 노던 블랏팅(Nothern blotting), DNA 칩 방법(DNA chip technology) 또는 바이오센서(biosensor)인 것일 수 있다. 본 명세서에서의 용어 \"발현 수준을 측정할 수 있는 제제\"는 특정 단백질 또는 이를 암호화하는 유전자의 발현 수준을 확인하기 위하여 사용될 수 있는 분자를 의미하며, 구체적으로 상기 단백질 또는 상기 유전자를 검출 및 /또는 증폭할 수 있는 제제를 포함하는 것일 수 있으나, 이에 제한되는 것은 아니다. 상기 \"특정 단백질 또는 이를 암호화하는 유전자를 검출할 수 있는 제제\"는 상기 특정 유전자 또는 단백질에 특 이적으로 결합하여 인식할 수 있도록 하거나, 검출하여 증폭시킬 수 있는 제제를 의미하고, \"특정 유전자 또는 단백질을 증폭할 수 있는 제제\"는 상기 특정 유전자 또는 단백질의 복제를 반복하여 그 수를 증가시킬 수 있는 제제를 의미하며, 예를 들어 상기 유전자를 포함하는 폴리뉴클레오티드를 특이적으로 증폭할 수 있는 프라이머 또는 특이적으로 결합할 수 있는 프로브를 의미하는 것일 수 있으나, 이에 제한되는 것은 아니다. 상기 전립선암 진단용 조성물은 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 mRNA 또는 유전자에 특이적으로 결합하는 프라이머, 프로브, 뉴클레오티드, 항체, 항체 단편 또는 이의 항원 결합 단편, 리간드, 수용체, 단백질 또는 그 조합을 포함하는 것일 수 있다. 본 명세서에서의 용어 \"프라이머(primer)\"는 자유 3-말단 수산화기 (free 3' hydroxyl group)를 가지는 핵산 서열로 특정 염기 서열에 대해 상보적인 주형 (template)과 염기쌍을 형성할 수 있고 주형 가닥 복사를 위한 시 작 지점으로서 작용하는 핵산 서열을 말한다. 프라이머는 적절한 완충용액 및 온도에서 중합반응을 위한 시약 (즉, DNA 폴리머라제 또는 역전사효소) 및 상이한 4가지의 뉴클레오시드 트리포스페이트의 존재하에서 DNA 합성 을 개시할 수 있다. 예를 들어 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질을 암호 화하는 유전자 또는 mRNA에 대한 특이적인 프라이머로서 7개 내지 50개의 뉴클레오티드 서열을 가진 센스 및 안 티센스 프라이머를 이용하여 PCR 증폭을 실시하여 원하는 생성물의 생성량의 측정을 통해 개체의 전립선암 발병 여부 등을 진단할 수 있다. PCR 조건, 센스 및 안티센스 프라이머의 길이는 당업계에 공지된 기술에 따라 적절 히 선택될 수 있다. 상기 프라이머는 10 내지 100, 15 내지 100, 10 내지 80, 10 내지 50, 10 내지 30, 10 내 지 20, 15 내지 80, 15 내지 50, 15 내지 30, 15 내지 20, 20 내지 100, 20 내지 80, 20 내지 50, 또는 20 내 지 30 nt를 갖는 것일 수 있다. 본 명세서에서의 용어 \"프로브(probe)\"는 표적 핵산 예를 들면, mRNA와 특이적으로 결합을 이룰 수 있는 RNA 또 는 DNA 등의 핵산 단편을 의미하며 특정 mRNA의 존재 유무, 함량 및 발현량을 확인할 수 있도록 라벨링(labeling)되어 있을 수 있다. 프로브는 올리고뉴클레오티드(oligonucleotide) 프로브, 단일가닥 DNA (single strand DNA) 프로브, 이중가닥 DNA(double strand DNA) 프로브, RNA 프로브 등의 형태로 제작될 수 있다. 예를 들어 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질을 암호화하는 유전자 또는 mRNA와 상보적인 핵산 서열을 갖는 프로브를 이용하여 혼성화를 실시하여, 혼성화 정도를 통해 mRNA의 발현량을 측정함 으로써 개체의 전립선암 발병 여부 등을 진단할 수 있다. 적절한 프로브의 선택 및 혼성화 조건은 당해 기술분 야에 공지된 기술에 따라 적절히 선택할 수 있다. 상기 프로브는 10 내지 100, 15 내지 100, 10 내지 80, 10 내 지 50, 10 내지 30, 10 내지 20, 15 내지 80, 15 내지 50, 15 내지 30, 15 내지 20, 20 내지 100, 20 내지 80, 20 내지 50, 또는 20 내지 30 nt를 갖는 것일 수 있다. 상기 프라이머 또는 프로브는 포스포아미다이트 (phosphoramidite) 고체 지지체 합성법이나 기타 널리 공지된"}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "방법을 이용하여 화학적으로 합성될 수 있다. 또한 이러한 핵산 서열은 당해 기술분야에 공지된 다양한 방법을 통해 변형시킬 수 있다. 이러한 변형의 예는 메틸화, 캡화, 천연 뉴클레오티드 하나 이상의 동족체로의 치환, 또는 뉴클레오티드 간의 변형, 예를 들면 하전되지 않은 연결체(예: 메틸 포스포네이트, 포스포트리에스테르, 포스포로아미데이트, 카바메이트 등) 또는 하전된 연결체 (예: 포스포로티오에이트, 포스포로디티오에이트 등) 로의 변형을 포함할 수 있다. 또한 프라이머 또는 프로브는 검출 가능한 신호를 직접적으로 또는 간접적으로 제 공할 수 있는 표지를 이용하여 변형될 수 있다. 상기 표지의 예는 방사성 동위원소, 형광성 분자, 또는 바이오 틴을 포함할 수 있다."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "본 명세서에서의 용어 \"항체 (antibody)\"는 당해 기술분야에 공지된 용어로서 항원성 부위에 대하여 지시되는 특이적인 면역 글로불린을 의미한다. 예를 들어 상기 항체는 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택 된 하나 이상의 단백질 또는 이의 단편에 대해 특이적으로 결합할 수 있다. 상기 단편은 상기 단백질에 대한 항 체에 의해 인식될 수 있는 하나 이상의 에피토프 (epitope)를 가지고 있는 단백질 단편을 의미하며, 예를 들어 면역원성 단편일 수 있다. 상기 항체의 형태는 폴리클로날 항체, 모노클로날 항체, 또는 재조합 항체를 포함하 며, 모든 면역글로불린 항체가 포함된다. 또한, 상기 항체는 인간화 항체 등의 특수 항체도 포함된다."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "이러한 항체들을 이용하여 당해 기술분야에 공지된 효소 면역측정법 (enzyme linked immunosorbent assay; ELISA), 방사선면역 측정법 (radioimmunoassay; RIA), 샌드위치 측정법 (sandwich assay), 폴리아크릴 겔상의 웨스턴 블롯팅 또는 면역 블롯팅 등의 방법에 의해 생물학적 샘플 중에 상기 단백질이 발현되었는지를 확인할 수 있다. 본 명세서에서의 용어 \"항체 단편\"은 온전한 항체, 펩티드 또는 단백질의 구조를 갖지는 않지만, 항원성 부위에 대해 지시되는 특이적인 항원결합부위 또는 결합 도메인을 갖는 폴리펩티드를 의미한다. 상기 단편은 2개의 경 쇄 및 2개의 중쇄를 갖는 완전한 형태의 항체가 아닌 항체 분자의 기능적 단편을 포함한다. 항체 분자의 기능적 단편이란 적어도 항원 결합 기능을 보유하고 있는 단편을 의미하며, Fab, F(ab'), F(ab')2 또는 Fv일 수 있다. 상기 결합 단편은 최소한 7개 이상의 아미노산, 예를 들면 9 개 이상의 아미노산, 12개 이상의 아미노산을 포함 할 수 있다. 또 다른 양상은 상기 전립선암 진단용 조성물을 포함하는 전립선암 진단용 키트를 제공하는 것이다. 상기에서 설명한 내용과 동일한 부분은 상기 키트에도 공히 적용된다. 상기 키트는 전립선암 진단용 바이오마커인 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단 백질 또는 이를 암호화하는 유전자의 발현을 검출하거나 발현 수준을 측정함으로서 상기 바이오마커를 검출할 수 있다. 상기 키트는 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유 전자의 발현을 검출하거나 발현 수준을 측정하기 위한 프라이머, 프로브 또는 선택적으로 마커를 인지하는 항체 또는 항원 결합능을 유지하는 이의 단편뿐만 아니라, 상기 측정 또는 분석 방법에 적합한 하나 또는 그 이상의 다른 구성 성분 조성물 또는 장치가 포함될 수 있다. 예를 들어, 폴리뉴클레오티드 또는 유전자의 검출 또는 발현 수준 측정을 위한 전립선암 진단용 키트는 상기 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질을 암호하하는 폴리뉴클레오티드 또는 유전자에 특이적으로 결합하는 1 종 이상의 올리고 뉴클레오티드를 포함할 수 있는데, 상기 유전자 또는 이의 일부 서열에 대응하는 프라이머, 역전사 효소, Taq 폴리머레이즈, PCR용 프라이머 및 dNTP를 포함할 수 있으며, 폴리뉴클레오티드 발현 수준을 측정하기 위해 상기 mRNA 또는 유전자의 발현 수준과 관련하여 기술된 측정 방법 을 이용한 키트를 이용할 수 있다.또한, 폴리펩타이드 또는 단백질의 검출 또는 발현 수준 측정을 위한 전립선암 진단용 키트는 상기 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이의 단편에 특이적으로 결합하는 항체 또는 항체 단편을 포함할 수 있으며, 폴리펩타이드의 발현 수준을 측정하기 위해 상기 단백질의 발현 수준과 관 련하여 기술된 측정 방법을 이용한 키트를 이용할 수 있다. 상기 키트는 전립선암을 진단하기 위한 전기화학적 바이오센서 또는 바이오센서 키트일 수 있으며, 구체적으로 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현을 검출하거나 발현 수준을 측정하기 위한 제제 및 상기 측정 또는 분석 방법에 바이오센서를 포함하는 것일 수 있 다. 본 명세서에서의 용어 \"바이오센서(biosensor)\" 또는 \"바이오 칩(bio chip)\"은 유리, 실리콘 혹은 나일론 등의 재질로 된 작은 기판 위에 DNA, 단백질 등의 생물 분자들을 결합시켜 유전자 발현 양상, 유전자 결함, 단백질 분포, 반응 양상 등을 분석해낼 수 있는 생물학적 마이크로칩을 말한다. 특정한 물질에 대한 인식기능을 갖는 생물학적 수용체가 전기 또는 광학적 변환기와 결합되어 생물학적 상호작용 및 인식반응을 전기적 또는 광학적 신호로 변환함으로써 분석하고자 하는 물질을 선택적으로 감지할 수 있는데, 이 때 특정한 물질이라 함은 DNA 또는 혈당과 같은 생체물질뿐만 아니라 일반적인 화학물질도 포함하며, 생물학적 수용체라 함은 분석물질을 선 택적으로 인식함과 동시에 변환기가 측정할 수 있는 신호를 발생시키는 역할을 하는 생체분자로서 효소, 단백질, DNA, 바이러스, 세포, 호르몬, 생체막, 티슈 등이 사용된다. 상기 전립선암 진단용 바이오센서는 검출하고자 하는 타깃 바이오 물질(DNA, 단백질 등)이 센서 감지부의 프로 브(probe) 물질과 특이적으로 결합할 때 유도되는 센서의 전기적 특성 변화를 검출하는 것인 전기적 감지 방식 에 의한 것일 수 있으며, 구체적으로 FET(Field-Effective Transistor) 방식일 수 있다. 상기 FET 바이오센서에서 소스와 드레인을 나노 와이어로 연결하는 나노선 채널을 이용한 FET 방식의 바이오 센 서는 나노선 표면에 결합하는 바이오 물질의 자체 전하에 의해 유발되는 나노선 내부의 전기 전도도 변화를 검 출하는 원리를 이용한 비표지 방식이다. 본 발명의 실시예에 따르면, 시료 (구체적으로 소변 샘플)에서 전립선암 진단을 위한 바이오마커를 검출하기 위 해, FET (field-effect transistor)와 EG (extended gate)로 구성되는 DGFET (dual-gate field-effect transistor) 바이오센서를 이용하였다. 구체적으로, 상기 EG에 전립선암 진단용 바이오마커를 검출하기 위한 제 제 (구체적으로, 항체 또는 항체 단편)를 부착시켰으며, 상기 바이오마커가 검출 제제가 결합되는 경우 발생하 는 전기적 신호를 측정함으로서 바이오마커의 발현 수준을 측정할 수 있다. 또 다른 양상은 개체로부터 분리된 생물학적 시료로부터, ANXA3(annexin A3), PSMA(prostate-specific membrane antigen), ERG(erythroblast transformation-specific related gene protein) 및 ENG(endoglin)으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준을 측정하는 단계를 포함하 는, 전립선암 진단을 위한 정보제공 방법을 제공하는 것이다. 상기에서 설명한 내용과 동일한 부분은 상기 방법 에도 공히 적용된다. 본 명세서에서의 용어 \"개체\"는 전립선암이 발병되거나 발병될 가능성이 있는 모든 생물체를 의미하며, 구체적 인 예로, 개, 고양이, 마우스, 래트, 원숭이, 소, 돼지, 미니돼지, 가축, 인간 등을 포함하는 포유동물, 양식어 류 등을 포함할 수 있으며, 이에 제한되는 것은 아니다. 본 명세서에서의 용어 \"시료\"는 상기 개체로부터 유래한 물질을 의미하며, 구체적으로 조직, 세포, 전혈, 혈청, 혈장, 타액, 객담, 뇌척수액, 소변 등을 포함할 수 있으며, 이에 제한되는 것은 아니다. 또한, 이들 시료로부터 유전자 및/또는 단백질 시료를 얻을 수 있으며, 유전자 시료는 핵산, 예를 들어, DNA, mRNA, 또는 mRNA로부터 합성되는 cDNA 등을 포함할 수 있으며, 이로부터 특정 유전자/단백질의 발현 수준을 확인할 수 있는 한, 그 종 류는 이에 제한되는 것은 아니다. 상기 시료는 소변 또는 소변으로부터 유래된 시료일 수 있다. 또한, 상기 시료는 직장 수지 검사 (digital rectal examination, DRE) 시행 전 또는 시행 후 개체로부터 분리된 것일 수 있으며, 구체적으로 DRE 시행 후 개체로부터 분리된 것일 수 있다. 상기 방법은 대조군으로부터 분리된 생물학적 시료로부터, ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준을 측정하는 단계; 및 상기 개체 및 상기 대조군 의 발현 수준을 비교하는 단계를 추가로 포함하는 것일 수 있다.본 명세서에서의 용어 \"대조군\"은 전립선암이 발병되지 않은 일반 개체, 비-전립선암 환자군, 비환자군 등을 의 미하는 것일 수 있다. 상기 방법은 상기 개체에서의 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이 를 암호화하는 유전자의 발현 수준이 상기 대조군보다 높은 경우, 상기 개체를 전립선암이 발병한 것으로 판별 하거나 발병 위험을 높은 수준으로 예측하는 단계를 추가로 포함하는 것일 수 있다. 또한, 상기 방법은 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 둘 이상의 단백질 또는 이를 암호화하는 mRNA 또는 유전자의 발현 수준을 측정하는 것일 수 있으며, 구체적으로 PSMA/ERG, PSMA/ENG, ENG/ERG, ANXA3/ENG/ERG, PSMA/ENG/ERG 및 ANXA3/PSMA/ENG/ERG 중 선택된 바이오마커 조합의 발현 수준을 측정하는 것일 수 있고, 보다 구체적으로 ERG 및 ENG 단백질 또는 이를 암호화하는 mRNA 또는 유전자의 발현 수준을 측정하는 것일 수 있다. 또한, 상기 방법은 진단 정확도를 향상시키기 위해 ANXA3 단백질 또는 이를 암호화하는 mRNA 또 는 유전자의 발현 수준을 측정하는 것을 포함하지 않는 것일 수 있다. 상기 방법은 상기 측정된 단백질 또는 이를 암호화하는 유전자의 발현 수준을 기계학습 알고리즘 모델에 적용하 는 단계를 추가로 포함하는 것일 수 있다. 상기 기계학습 알고리즘 모델에 적용하는 단계는 상기 개체에서 측정된 단백질 또는 이를 암호화하는 유전자의 발현 수준을 상기 기계학습 알고리즘 모델에 입력하여, 출력값으로서 상기 개체의 전립선암 발병 여부 또는 발 병 위험 여부를 출력하는 것을 포함하는 것일 수 있다. 상기에서 모델에 입력되는 입력값은 전립선암 환자로 의심되는 개체로부터 측정된 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준을 수치화한 값일 수 있으 며, 상기 입력값은 구체적으로 본 발명의 DGFET 바이오센서를 이용하여 측정된 전압시프트 값일 수 있다. 또한, 상기 모델에서 출력되는 출력값은 상기 개체의 전립선암 발병 여부 또는 발병 위험 여부에 대해 판단한 결과로서, 구체적으로 0 에서 1 사이의 숫자로 표현되는 예측 변수 값으로 출력되는 것일 수 있다. 상기 예측 변수 값이 0.5 이상인 경우 상기 개체를 전립선암이 발병하거나 발병 위험이 높은 것으로 판별할 수 있고, 상기 예측 변수 값이 0.5 미만인 경우에는 상기 개체를 전립선암이 발병하지 않거나 발병 위험이 낮은 정상 개체로 판별할 수 있다. 또한, 상기 예측 변수 값은 0 또는 1에 가까울수록 알고리즘 예측의 확실성이 높아지며, 예를 들어 1에 가까울수록 상기 개체의 전립선암 발병 예측에 대한 정확성이 높아지며, 0에 가까울수록 상기 개체의 전립선암이 발병하지 않을 것이라는 예측에 대한 정확성이 높아질 수 있다. 상기 기계학습 알고리즘 모델은 1) 전립선암 환자에서의 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하 나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준 및 2) 대조군에서의 ANXA3, PSMA, ERG 및 ENG으로 구성된 군에서 선택된 하나 이상의 단백질 또는 이를 암호화하는 유전자의 발현 수준을 입력값으로 설정하여 학 습된 것일 수 있으며, 구체적으로 상기 입력값은 본 발명의 DGFET 바이오센서를 이용하여 측정된 전압시프트 값 일 수 있다. 또한, 본 발명의 DGFET 바이오센서를 이용하여 측정된 ANXA3, PSMA, ERG 또는 ENG 바이오마커의 기 준 전압 시프트가 추가적으로 입력된 것일 수 있다. 또한, 상기 입력된 전립선암 환자 및 대조군의 전립선암 발병 여부를 결과값으로 설정하여 학습시킨 것일 수 있 다. 상기 기계학습 알고리즘 모델은 랜덤 포레스트 (Random forest, RF) 알고리즘 및/또는 신경망 (neural networks, NN) 알고리즘을 포함하는 것일 수 있다."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 전립선암 진단용 바이오마커 조성물에 따르면, 전립선암을 효과적으로 진단할 수 있는 최적의 바이오 마커 조합을 발굴하였으며, 상기 바이오마커 조합 및 기계학습 모델 알고리즘을 이용하여 높은 정확도로 전립선 암을 진단할 수 있다는 장점이 있다."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 실시예를 통하여 보다 상세하게 설명한다. 그러나, 이들 실시예는 예시적으로 설명하기 위한 것으로 본 발 명의 범위가 이들 실시예에 한정되는 것은 아니다. 본 발명은 전립선 암을 진단하기 위한 조성물 및 방법에 관한 것이다. 구체적으로, 전립선 암 진단을 위해 생검 이 필요할 수 있는 환자를 선별하기 위한 검체(시료)로 소변을 선택하였다. 요도가 전립선 조직으로 둘러싸여 있어, 전립선암 (prostate cancer, PCa) 세포에서 소변으로 바이오마커가 수동 확산되기 때문에, 소변은 PCa 스 크리닝에 특히 중요하게 작용할 수 있으며, 소변 검체의 채취는 비침습적이기 때문에, 환자의 순응도 또한 높아진다. 그러나, 소변에 존재하는 바이오마커의 농도는 낮기 때문에 소변 검체를 이용하여 전립선암을 진단하는 것을 어렵다. 본 발명에서는 이 문제를 해결하기 위해, 고감도의 DGFET (dual-gate field-effect transistor) 를 소변 다중마커 센서로 사용했다. 상기 DGFET는 감지 성능과 신뢰성을 향상시키기 위해 변환기와 분리되는 일 회용 4채널 확장 게이트 (extended gate. EG)로 구성된다. DGFET 바이오 센서를 이용하면 20분 만에 환자 및 동 물 샘플 등에서 미량의 단백질 기반 바이오마커의 검출이 가능하다. 또한, 복잡한 다중마커 감지 신호로부터 임 상적으로 중요한 정보를 추출하기 위해, 두 가지 ML 알고리즘[RF(random forest) 및 NN (neural network)]을 도입했다. 특히, RF와 NN을 비교하여, PCa 스크리닝에서 가장 높은 정확도를 제공하는 최고의 알고리즘과 바이 오 마커 조합을 개발하였다. 본 발명의 전반적인 개요는 도 1에 기재하였다. 구체적으로, PCa 세포로부터 여러 바이오마커가 수동적으로 요 도로 확산되고 배뇨에 의해 운반된다. 자연적으로 배뇨된 소변은 잠재적인 PCa 환자로부터 수집되었다. 상기 소 변 표본을 DGFET 바이오 센서에 적용하여 상이한 바이오 마커로부터 전기 신호를 얻었다. 본 발명에서는 4개의 바이오마커를 이용하였다: ANXA3(annexin A3), PSMA(prostate-specific membrane antigen), ERG(erythroblast transformation-specific related gene protein), 및 ENG(endoglin). 76개의 소변 샘플에서 얻은 데이터를 훈 련 데이터 세트 (70 %)와 테스트 데이터 세트 (30 %)로 무작위로 나눴다. 훈련 단계 후, ML은 테스트 세트에서 PCa 환자를 선별했다. PCa 스크리닝 성능은 더 많은 바이오마커가 결합됨에 따라 점증적으로 향상될 수 있다. 따라서, 한 방울의 소변만을 사용하더라도 거의 100% 정확도를 나타낼 수 있다. 실시예 1: DGFET 바이오센서의 제작 DGFET (dual-gate field-effect transistor) 는 FET (field-effect transistor)와 EG (extended gate)로 구성 되며, DGFET 장치는 기존 문헌(Adv. Sci. 2019, 6 , 1802115) 에 기재된 방법으로 제조하였다. 구체적으로, 750-nm 매입 산화층(buried oxide layer) 및 100-nm 상부 실리콘 층을 갖는 6인치 p-타입 실리콘 웨이퍼가 사용되었다. 활동 영역을 정의하기 위해, 유도결합 플라즈마 반응성 이온 에칭 (Inductively coupled plasma reactive-ion etching, ICP-RIE) 및 사진석판술(photolithography)을 적용하였다. 건식 산화 공정을 사용하여 탑 게이트에 10nm 두께의 산화층을 증착했다. 이 층에서, Ti/TiN/Al/TiN 다층은 ICP-RIE에 이 어 박막층착 시스템(sputtering system)을 통해 성장하여 게이트 전극을 형성하였다. 비소 이온 주입은 드레인 및 소스 부분을 형성했다. 4 개의 PDMS(polydimethylsiloxane) 채널이 있는 EG는 상부에 인듐/주석 산화물 (indium tin oxide, ITO, 300 nm) 필름이 있는 유리 기판 상에 제작되었다. 0.5 cm2의 표면적을 가진 4개의 PDMS 채널은 홀 펀치(직경 0.8 cm)를 사용하여 제조되었다. 상기 4개의 채널은 O2 플라즈마 처리(70W, 1분 동안 30sccm의 O2 가스 흐름, Plasma System Cute, Femto Science) 후 플라즈마 결합을 통해 ITO 기판에 부착되었다. 다음으로, EG의 표면을 개질하기 위해, 70W에서 1분 동안 O2 플라즈마 처리에 의해 히드록시기(-OH)가 도입되었 다. 그런 다음 5% APTES (3-aminopropyltriethoxysilane) (에탄올)에 표면을 1시간 동안 담가 아민기(-NH2)를 도입했다. 초음파 처리기로 세척한 후 APTES 층은 120 ℃에서 30분 동안 경화되었다. 아미드 결합을 통해 APTES 층에 항체 또는 단백질을 접합하기 위해, 2.5% 글루타르알데히드 용액으로 처리했다. 그 후, 5 μg/ml의 4개의 바이오 마커 (PSMA, ANXA3, ENG, ERG)를 검출할 수 있는 항체를 각 채널에 첨가하고 1시간 동안 반응시켰다. PBS(phosphate-buffered saline)로 세척한 후, 0.2M 에탄올아민을 1시간 동안 첨가하여 미반응 카르복실산기를 비활성화시켰다. 그런 다음, EG를 3% BSA가 포함된 PBS 용액과 함께 1시간 동안 배양하여 소변 생체 분자로부터 의 비특이적 결합을 차단했다. 실시예 2: DGFET 바이오센서의 측정 설정 이중-채널 매개변수 분석기 (dual-channel parameter analyzer, 4200A-SCS, Keithley)를 사용하여 DGFET에서 ID-VG 곡선을 수득했다. ID-VG 곡선의 경우, 하단 게이트의 스위핑 전압(sweeping voltage)은 -10 ~ 10V이고 드 레인 전압(drain voltage)은 3V 로 하였다. 표준 곡선을 얻기 위해, 정상 소변에서 다양한 농도의 PSMA, ANXA3, ENG 및 ERG (0.1 fg/ml ~ 10 ng/ml)에서의 전압 시프트를 측정했다. 초기 전압 신호는 1x PBS 용액의 ID-VBG 곡 선으로부터 얻었다. 그 후 용액을 제거하고, 소변 검체를 개질된 EG에 직접 주입하고 20분 동안 반응시켰다. 1x PBS 용액으로 3회 세척한 후, 세척된 용액을 채널에서 제거하였다. 마지막으로, 깨끗한 1x PBS 용액을 첨가하고 최종 전압 신호를 측정했다. 검출 전압 (전압 시프트)은 기준 전류(1 nA)에서 최종(t = 20분) 전압 신호에서 초 기(t = 0분) 전압 신호를 뺀 값이다. 다중마커 감지의 경우, EG의 4개 채널에 서로 다른 항체가 접합된 것을 제외하고는 상기와 동일한 절차로 수행 되었다. 1Х PBS에서 최초 전압 신호를 기록하고, 이어서 각 채널에서 20분동안 동시에 소변 검체를 주입하여 배양하고, 1x PBS 용액으로 3회 세척하였다. 마지막으로, 깨끗한 1x PBS 용액을 첨가하고 최종 전압 신호를 측 정했다. 실시예 3: 인공지능모델을 이용한 분석 방법 각 바이오마커 패널에 대한 예측 변수 값(predictor values)을 생성하기 위해, Scikit Learn, Panda, Numpy 및 Matplotlib를 비롯한 다중 개방형 라이브러리를 사용하여 Python 3.6.1로 맞춤형 ML(machine learning) 소프트 웨어를 개발했다. 본 발명에서는 NN 알고리즘을 위해 RF 의사결정 트리(RF decision trees) 및 피드포워드 신경 망(feedforward neural networks)을 사용했다. RF는 암 및 정상 케이스에 대한 이진법 분류가 있는 80개의 무 작위 의사 결정 트리로 구성되며 모든 바이오마커 패널에 대해 다수결 결과가 수집된다. NN의 경우, 3개의 노드 의 3개 은닉층이 있는 피드포워드 신경망이 사용되었다. NN 모델은 TensorFlow 프레임워크와 함께 Keras를 사용 하여 구현되었다. 두 알고리즘을 훈련하기 위해 지도학습법(supervised learning method)을 이용하였으며, 전체 데이터세트의 70%를 무작위로 할당하여 반복적으로 훈련되었다. 나머지 블라인드 테스트 세트 (전체의 30%)는 알고리즘의 스크리닝 성능을 검증하는 데 사용되었다. 신호 조합을 평가하고 예측 변수 값을 생성하기 위해, 4 개의 바이오마커 감지 채널의 전압 시프트가 RF 및 NN 알고리즘에 입력되었다. 정확도를 계산할 때, 0.5의 예측 변수 값을 임계값으로 사용하였다 (암의 경우 ≥0.5, 정상의 경우 <0.5). 각 소변 샘플을 3회 측정하였으며, 측 정된 예측 변수 값의 평균을 사용하여 전립선암 스크리닝에 대한 최종 결정을 내렸다. 실시예 4: 통계 분석 방법 본 발명의 실험예에 기재된 데이터는 3회의 독립적인 실험으로부터 얻었으며, 달리 표시되지 않는 한 평균±표 준 편차로 표시되었다. 두 그룹 간의 통계적 비교는 독립 표본 스튜던트의 T 검정(unpaired Student's t- tests)을 기반으로 수행하였다. 차이는 P<0.05일 경우 유의미한 것으로 간주하였다. 실험예 1: 전립선암 진단을 위한 바이오마커 선정 본 발명의 전립선암 진단용 조성물 및 방법에 사용하기 위한 바이오마커를 선별하기 위해 하기와 같은 실험을 수행하였다. 구체적으로, 전립선암과의 임상적 관계를 고려하여, PCa 환자에서 상향 조절되고 병태생리학적으로 상호비관련 성인 4개의 바이오마커를 선택했다: ANXA3, PSMA, ERG, 및 ENG. ANXA3는 PCa에 대한 특이성이 높은 소변에서 발 견되며, ANXA3 발현은 PCa의 전구체인 전립선 상피내 종양(prostatic intraepithelial neoplasia)에서 관찰된 다. PSMA는 내피 세포의 정점 표면(apical surface)에서 발현되는 막 단백질이다. PSMA 과발현은 더 높은 등급 의 PCa 및 안드로겐 결핍 관련이 있으며, 이는 PSMA가 PCa 진행에 기능적 역할을 하는 것을 알 수 있다. ERG의 발현은 종양 진행 및 침습을 촉진하는 TMPRSS2/ERG 융합 유전자의 증가된 수준과 강하게 연관되어 있다. 증가된 ENG 발현은 종양 혈관 형성 및 염증 과정동안 전립선 내피 세포에서 발견된다. ENG는 또한 전립선 상피내 종양 에서 발현되어, 예후 마커로서의 잠재력을 보여준다. 다음으로, 상기 선택된 4개의 바이오마커가 DGFET 시스템에서 충분한 전하 분극 및 후속 임계 전압 변화를 유도 할 수 있는지 여부를 확인하기 위해, 세부적인 감지 특성을 평가하였다. 그 결과, 상기 4개의 후보 바이오마커 는 모두 전압 시프트와 농도 수준 사이에서 선형 관계를 보여주었는 바(도 2), DGFET 시스템에 적합한 바이오마 커임을 알 수 있다. 실험예 2: DGFET 바이오센서의 소변 샘플 내 바이오마커 검출능 평가 본 발명의 바이오센서는 가공처리되지 않은 소변을 EG의 각 감지 채널에 직접 처리하는 과정을 통해 작동되며, 바이오센서의 반응부에 고정된 항체와 소변 샘플 내에 존재하는 항원이 결합되면 센서의 표면 전위의 변화를 유 도하고, 이러한 변화는 기준 전류 (1 nA)에서 하단 게이트 전압의 시프트로 모니터링된다(도 3a). 한편, 인간의 혈액의 경우에는 일정한 pH (pH 7.35-7.45)를 갖지만, 소변의 pH는 사람마다 크게 다르며 (pH 4.5-8.0), 이는 감지 특성에 영향을 미칠 수 있다. 따라서, 본 발명의 바이오센서가 소변 샘플 내 바이오마커를 안정적으로 검출할 수 있는 지 평가하기 위해, DGFET의 pH 안정성을 pH 4, 6(일반 소변) 및 10에 대해 연속적인 5회 사이클로 테스트하였다. 동일한 EG 채널에서 5회 사이클의 pH 변화 동안 기준 전류에서 하단 게이트 전압을 모니터링한 결과, 전압 시프트는 작은 이력(hysteresis) (pH 4, 6 및 10에 대해 각각 0.13, 0.095 및 0.029V의 변화)만을 나타냈는 바, 본 발명의 센서 성능이 요구되는 소변 샘플의 반응 환경에서 안정적임을 확인하였다 (도 3b). 또한, 24분 동안 서로 다른 pH 용액에 대한 작은 전압 시프트를 보여주었는 바 (도 3c) (각각 pH 4, 6및 10의 경우 0.002, 0.021 및 0.007V), 소변 샘플을 안정적으로 이용할 수 있음을 알 수 있다. 실험예 3: 실험군 설정 정상인 및 전립선암 환자로부터 수득한 소변 샘플을 3개의 군으로 나눴다: 정상 그룹, DRE (digital rectal examination) 이전의 PCa 그룹, DRE 이후의 PCa 그룹. 한편, 전립선 비대증(Benign prostatic hyperplasia, BPH)은 전립선의 비대를 유발한다는 점에서 PCa와 유사하나, 특정 바이오마커의 발현 수준이 영향을 받을 수 있 다. 상기 BPH는 40세 이상의 남성에게서 흔하게 발병할 수 있는 질병이라는 점을 고려할 때, 본 발명에서는 PCa 를 정확하게 선별할 수 있도록 정상군에 BPH 환자의 소변 검체를 포함시켰다. 정상 그룹의 경우에는 정기 건강검진 시 자연 배설된 소변 검체를 채취하였다. PCa 환자의 경우 DRE 절차 전후 에 두 번 소변을 수집했다. 샘플 모집단의 Gleason 점수는 도 4에 나타냈으며, 표 1에서 수집/연구된 51명의 환"}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "자에 대한 정보를 요약하여 나타냈다. 표 1 정상인 암 환자 P 값 개체수 26 25 - 연령 중앙값 (범위) 55.5 (31-79) 66.1 (51-77) <0.0001 혈청 PSA 중앙값(범위), ng/ml 1.2 (0.2-5.1) 9.4 (3.4-44.2) <0.0001 전립선 부피 중앙값(범위). ml 31.5 (19-53) 37.3 (14-106) 0.2862 정상 그룹과 전립선암 그룹 사이의 연령 및 혈청 PSA 수치의 차이는 통계적으로 유의했으나, 전립선의 부피 차 이는 유의하지 않았다. 불편 예측(unbiased prediction)의 경우, 상기 인자들은 모두 ML 알고리즘에서 고려되지 않았다. 실험예 4: 단일 바이오마커 분석을 이용한 전립선암 진단능 평가 4-1: 단일 바이오마커를 이용한 DGFET 바이오센서 감지 결과 분석 상기 실시예에서 수득한 76개의 소변 샘플에 대해 DGFET 바이오센서를 이용하여 단일 바이오마커 분석을 수행하 였다. 구체적으로, 각 소변 샘플은 4종의 바이오마커를 검출할 수 있는 항체가 각각 접합된 4개의 감지 채널에 각각 처리되었으며, 20분 후 상기 바이오센서는 기준 전류(1 nA)에서 게이트 전압 시프트를 측정하였다. 1개의 샘플 당 3반복으로 수행되었으며, PCa 스크리닝을 위한 컷-오프 전압 값은 정상인 혼주 소변 (pooled urine) (0.19 V)에 의해 유도된 시프트 전압 값으로 설정하였다 (도 5a). 분석 결과, PSMA의 경우 DRE 이전 및 이후의 소변 샘플에서는 유사한 신호를 나타냈으나, 정상 그룹과는 구별되 었다 (도 5b). 구체적으로, 정상 그룹의 경우 78개 데이터 포인트 중 1개만이 컷-오프 전압 시프트에 가까이 도 달한 반면, 암(DRE 이전 및 이후) 그룹은 총 75개 데이터 포인트 중 30개 및 38개 데이터 포인트가 컷-오프값을 각각 초과하였다. 정상 그룹과 DRE 이전 또는 이후 그룹 사이의 p-값은 0.0001 미만이었고, 이는 유의미하게 구 별할 수 있음을 의미한다. 그러나, DRE 이전 및 이후 그룹 간의 p-값은 0.083으로 계산되어 두 데이터 세트가 통계적으로 유의하지 않음을 나타낸다. 따라서, 상기 PSMA 단일 바이오마커를 이용한 감지 결과는 본 발명의 바 이오센서를 이용하여 직접적으로 소변을 감지한 경우 DRE 절차에 관계없이 유사한 수준의 정확도로 PCa 환자를 선별할 수 있음을 알 수 있다. 또한, ENG 또는 ERG 바이오마커를 이용한 경우에도 상기와 유사한 결과를 얻었다. 그러나, ANXA3 바이오마커는 상기 3개의 바이오마커와는 다른 경향성을 나타냈다. 구체적으로, ANXA3는 DRE 이 전 및 이후 그룹에서 컷-오프 값을 초과하는 데이터 포인트의 수는 다른 바이오마커의 데이터 포인트 수와 유사 했으나 (DRE 이전 및 이후 그룹에서 각각 34개 및 35개), 정상 그룹의 데이터 포인트 중 상당히 많은 비율이 컷 -오프 값보다 더 큰 전압 시프트를 나타냈다 (78개 중 18개). 따라서, ANXA3 바이오마커는 단일 바이오마커로서 가장 낮은 감지 성능을 가짐을 알 수 있다. 4-2: 단일 바이오마커의 민감도, 특이도 및 정확도 평가 4가지 바이오마커 각각의 민감도(sensitivity), 특이도(specificity) 및 정확도(accuracy)를 분석하였다 (도 6). 상기 민감도는 질병이 있는 사람을 얼마나 잘 찾아 내는가에 대한 값이고 특이도는 정상을 얼마나 잘 찾아 내는 가에 대한 값이다. 즉, 민감도는 질병이 있는 사람을 질병이라고 진단하는 비율이고, 특이도는 정상을 정상이 라고 진단하는 비율이다. 상기 민감도와 특이도는 하기의 공식으로 도출할 수 있다. - 민감도 = TP / (TP + FN) - 특이도 = TN / (TN + FP) (True Positive, TP: 진단 방법에 의하여 양성(질병)으로 진단되었고 실제로도 양성인 경우 True Negative, TN: 진단 방법에 의하여 음성(정상)으로 진단되었고 실제로도 음성인 경우. False Positive, FP: 진단 방법은 양성(질병)으로 진단하였으나 실제로는 음성인 경우. False Negative, FN: 진단 방법은 음성(정상)으로 진단하였으나 실제로는 양성인 경우.) 또한, 정확도는 질병이 있는 사람 및 정상을 얼마나 잘 찾아내는가에 대한 값이며, 다음의 공식으로 도출할 수 있다. - 정확도 = (TP + TN) / (TP + FN + TN + FP) 상기 분석 결과, 민감도는 모든 바이오마커에서 43.3-52.0% 범위를 나타냈으며, ANXA3 바이오마커의 민감도가 가장 낮았다. 특이도의 경우, PSMA, ERG 및 ENG는 94.9% 이상의 특이도를 갖는 반면 ANXA3은 76.9%에 불과했다. 상기 ANXA3의 낮은 감지 성능은 세 실험 그룹 모두의 감지 신호가 크게 겹치는 figure 3b-e의 박스 플롯 결과와 유사하다. 또한, 정확도의 경우, PSMA, ERG 및 ENG는 유사한 정확도(63.6-66.7%)를 나타낸 반면 ANXA3은 54.8% 의 정확도를 나타냈다. 상기 결과를 종합해보면, PSMA, ERG 및 ENG 바이오마커의 스크리닝 성능은 유사한 반면, ANXA3 바이오마커의 성 능은 다른 바이오마커보다 뒤처져 있음을 알 수 있다. 본 발명의 주요 목적을 고려할 때, 위양성 결과의 비율을 줄이는 것은 불필요한 생검의 수를 줄일 수 있기 때문에 가장 중요한 목적이다. 이와 관련하여, 상기 4가지 바 이오마커는 모두 PSA 테스트를 능가한다. 그러나 높은 특이도는 민감도를 낮출 수 있다. 상기 실험 결과에서, 높은 수준의 특이성을 나타냈으나 PCa 환자의 약 절반을 놓쳤다. 즉, 현재의 단일 바이오마커 검사는 불필요한 생검을 최소화할 수 있으나, 높은 비율의 위음성 때문에 PCa 환자의 상당 부분을 놓칠 수 있다. 따라서, 민감도 를 손상시키지 않으면서 특이도를 높이는 전략을 세울 필요가 있다. 4-3: 바이오마커간의 연관성 분석 다중마커를 이용하는 방식으로 특이성을 향상시키기 위해서는, 상관관계가 적은 바이오마커들을 선택하는 것이 중요하며, 바이오마커간의 상관관계가 낮을수록 특이성은 향상될 수 있다. 따라서, 상기 4개의 바이오마커간의 상관관계를 분석하였다. 그 결과, 상기 4개의 바이오마커로부터 구성되는 바이오마커 쌍의 Pearson 상관 계수 매트릭스를 살펴보면, ERG-ENG 쌍은 가장 상관관계가 높은 것으로 확인되었고(κ=0.27), 반면에 ANXA3-PSMA 쌍은 상관관계가 가장 낮 은것으로 확인되었다 (κ=0.04) (도 7). 또한, 개별 바이오마커의 평균 상관 계수는 ANXA3, PSMA, ERG 및 ENG에 대해 각각 0.13, 0.15, 0.22 및 0.22였다. 상기 결과를 토대로, 상기의 모든 바이오마커 쌍에 대한 낮은 κ 값은 이들이 상관관계가 없고 뚜렷한 감지 결 과를 나타낼 수 있음을 알 수 있다. 따라서, 상기에서 선택된 4개의 바이오마커로부터 얻을 수 있는 감지 신호 를 적절히 혼합한다면 감지 성능을 현저하게 향상시킬 수 있음을 알 수 있다. 실험예 5: 머신러닝 기반 다중마커 분석 평가 전립선암을 진단하는 데에 있어서 다중마커를 이용한 접근방식의 중요성을 확인하기 위해, 2가지 일반적인 머신 러닝(ML) 알고리즘인 RF (random forest) 및 NN (neural network)을 적용하였다. 구체적으로, 두 알고리즘 모 두 지도 학습(supervised learning) 하에서 총 데이터 세트의 70%로 훈련되었으며, 블라인드 테스트 세트(총 데 이터 세트의 30%)에서 PCa를 스크리닝하여 성능을 검증했다(도 8a). 각 바이오마커의 기준 전압 시프트는 두 알 고리즘 모두에 입력되어, 정상 및 PCa의 두 가지 다른 유형의 출력(output)을 제공한다. 한편, 상기에서 컷오프 값(0.19V)은 알고리즘에서 고려되지 않았다. 이는 두 알고리즘 모두 DGFET의 미가공 데이터를 학습하여 크게 영향을 미치지 않을 것으로 판단되는 소변으로 인한 사소한 특성도 고려한다는 것을 의미한다. 5-1: 바이오마커의 상대적 중요성 평가 RF 알고리즘은 변수를 이해하는 데 유용하며, 예를 들어, RF는 결정 과정에서 각 바이오마커의 중요성과 같은 유용한 정보를 제공할 수 있다. 구체적으로, RF를 이용하여 4개의 바이오마커 조합 시스템에서 각 바이오마커의 상대적 중요성을 확인하였다. 그 결과, 전술한 실시예에서 유사한 감지 성능을 보인 PSMA, ERG 및 ENG 바이오마커는 RF 알고리즘에서는 현저 하게 다른 중요성을 나타냈다(도 9). PSMA와 ERG는 유사한 정도의 상대적 중요성을 나타내었지만 (두 바이오마 커 모두 0.23), 정확도는 ERG가 더 높은 것을 확인하였는 바, 상대적 중요성이 반드시 정확도를 의미하는 것은 아님을 알 수 있다. 또한, 도 6의 결과와 유사하게 ANXA3은 가장 낮은 중요성(7%만)을 나타냈는 바, 일부 바이 오마커는 진단 성능에 거의 기여하지 않음을 알 수 있다. 5-2: 바이오마커 수에 따른 정확성 평가 바이오마커 패널 수준에서 서로 다른 수의 바이오마커를 사용한 경우, RF 및 NN 알고리즘을 기반으로 한 PCa 스 크리닝의 평균 정확도를 확인하였다. 그 결과, 두 알고리즘 모두 평균적으로 패널의 바이오마커 수가 증가함에 따라 정확도가 증가했다(도 10). 구체 적으로, 단일 바이오마커를 사용한 RF 및 NN 알고리즘의 정확도는 각각 73.2% 및 66.3%였으며, 바이오마커의 수 가 증가함에 따라 평균 정확도는 RF 및 NN에서 각각 97.1% 및 94.2%로 크게 향상되었다. 상기 결과를 토대로, 두 가지 다른 ML 알고리즘에서 바이오마커 수의 증가에 따른 개선된 평균 정확도를 보여줌으로서, 다중마커 접 근법이 보다 정확한 임상 결과를 제공할 수 있음을 알 수 있다. 5-3: 다중마커를 이용한 전립선암 스크리닝 평가 - 예측 변수 값 일반적으로, 머신러닝을 이용한 스크리닝에서는 예측 변수 값을 기반으로 하며, 예측 변수 값이 0 또는 1에 가 까울수록 알고리즘 예측의 확실성이 높아진다. 따라서, 상기 4가지 바이오마커 조합을 이용하여 각 바이오마커 패널의 예측 변수 값을 분석하였다. 그 결과, 바이오마커 패널 수준에서, RF 알고리즘은 정상 및 암 바이오마커 패널 각각에서 하나를 제외하고 모 두 정확했다. NN 알고리즘은 정상 그룹의 3개 바이오마커 패널과 암 그룹의 1개 바이오마커 패널을 놓쳤다(도 11a). 각 소변 샘플을 세 번 측정하므로 세 개의 연속 패널 번호가 각 샘플에 해당한다. NN의 경우 한 샘플에 두 개의 연속적으로 잘못된 패널(패널 번호 4 및 5)이 있었다(회색으로 강조 표시함). 다음으로, 상기 바이오마커 패널 수준의 예측 변수 값을 기반으로, 각 샘플의 평균 예측 변수 값을 분석하였다. 그 결과, RF 알고리즘의 정확도는 100%였으며, 이는 PCa 스크리닝에서 잘못된 결과가 전혀 없음을 의미한다. 다 만, 예측 변수 값이 0.5에 가까운 샘플 또한 존재하였다. NN 알고리즘의 경우에는 하나의 위양성 샘플이 발견되 었다(회색으로 표시함) (도 11b). 따라서, 알고리즘 분석 결과에 불확실성 부분을 설정하는 것이 중요하며, 이 에 속하는 환자는 추가 검사를 받아야 할 것으로 판단된다. 또한, 이 제한된 수의 데이터 세트에서의 분석 결과 를 검증하기 위해 다른 검증 세트로 4개의 추가 예측을 수행했으며, 그 결과 5% 미만의 정확도 변동을 보이며 스크리닝 성능이 우수함을 확인하였다(도 12). 5-4: 다중마커를 이용한 전립선암 스크리닝 평가 - ROC 곡선 ROC (receiver operating characteristic) 곡선을 이용하여 상기 ML 기반 스크리닝 모델의 성능을 분석하였다. 구체적으로, 다양한 바이오마커의 수와 조합으로 RF 알고리즘에 의해 예측된 바이오마커 패널 수준에서 ROC 곡 선을 분석하였다. 그 결과, 바이오마커의 수가 증가할수록 ROC 곡선이 각 축에 가까워지며, 이는 정확도가 증가 함을 의미한다(도 13). 또한, 바이오마커의 수가 증가할수록 ROC 곡선의 변동이 감소했다. 상기와 같은 경향성 은 NN 알고리즘에서도 확인되었다 (도 14). 다음으로, ML 모델의 감지 성능을 나타내는 단일 매개변수인 AUROC (area under ROC curve)를 분석하였다. 상기 도 13 및 도 14의 ROC에 대한 AUROC를 분석한 결과, 바이오마커의 수가 증가할수록 AUROC 값 또한 증가하는 것 을 확인하였다 (도 15a). 구체적으로, 단일 바이오마커를 이용한 경우, ENG에서 AUROC가 가장 크고 ERG, PSMA 및 ANXA3 순으로 AUROC 값이 작아졌다. 또한, AUROC 값은 바이오마커의 조합에 따라 크게 달라졌으며, 상기 조 합은 바이오마커의 수보다 중요한 것으로 분석되었다. 예를 들어, ENG + ERG는 PSMA + ERG + ANXA3보다 감지 성 능이 우수하였다(도 15b). ANXA3가 포함되는 경우에는 RF 및 NN 알고리즘 모두에서 감지 성능이 저하되는 것을확인하였는 바, 최적의 바이오마커 조합이 있음을 알 수 있다. 예를 들어, AUROC 값을 고려하였을 때, 최상의 감지 결과는 RF 및 NN에 대해 각각 ENG + ERG + PSMA 및 ENG + ERG에서 달성되었다. 상기 결과를 토대로, RF 및 NN은 비선형 함수가 있는 복잡한 알고리즘으로서, 단순히 바이오마커의 수를 늘리는 것이 반드시 스크리닝 정확도를 향상시키는 것으로 이어지지 않으며 바이오마커의 조합 또한 중요하다는 것을 알 수 있다. 실험예 6: 오류 신호의 임상적 분석 바이오마커 기반 전립선암 스크리닝 시스템에서 오류 신호를 갖는 환자를 분석하면 ML을 통한 예측 결과와 환자 의 질병 상태 간의 상관관계를 알 수 있으며, 이를 ML 알고리즘을 개선하는데 활용할 수 있다. 또한, 상기 정보 는 환자를 위한 피드백 루프를 구성하는 데 사용될 수 있으며, 이를 통해 높은 오류율을 나타내는 환자는 PCa가 없는지 확인하기 위해 추가 테스트를 수행할 수 있다. 따라서, 먼저 다양한 수의 바이오마커로 테스트 세트를 확인한 경우 각 바이오마커 패널에서의 RF-예측 평균 오류율(false rate)을 확인하였다. 그 결과, 바이오마커의 수가 증가할수록 오류율은 감소되는 것을 확인할 수 있으며, 예를 들어 4개의 바이오마 커 조합을 이용한 경우에는 단 2개의 오류만이 발견되었다(도 16). 한편, 상기 오류가 발견된 2개의 패널은 바 이오마커의 수에 관계없이 항상 오류가 발견되었다. 또한, 바이오마커의 수가 증가할수록 0.5보다 높은 오류율 을 갖는 패널의 수는 점점 감소하였다(21개, 17개, 6개 및 2개로 점차 감소됨). 다음으로, 다양한 수의 바이오마커로 정상 그룹 및 BPH 그룹의 위양성 비율을 확인한 결과, 2개의 바이오마커의 조합을 제외하고는 정상 그룹과 BPH 그룹 간의 차이가 유의미하지 않은 것을 확인하였다(도 17a, p=0.03). 또한, 다양한 수의 바이오마커로 DRE 이전 및 이후 그룹의 위음성 비율을 확인한 결과, 4개의 바이오마커의 조 합의 경우에는 두 그룹 모두 95.2% 이상의 민감도를 보였으나, 전반적으로 DRE 이전 그룹에서 위음성비율이 더 높은 것을 확인하였는 바(도 17b), DRE 이후의 소변 샘플이 보다 우수한 전립선암 특이성을 나타낼 수 있음을 알 수 있다. 다음으로, ML 알고리즘에서 임상 매개변수는 고려되지 않았으므로, ML 알고리즘에서 오류 신호에 영향을 미치는 인자들을 확인하기 위해, 오류 매트릭스의 임상적 분석을 수행하였다. 그 결과, 정상 그룹에서는 노인이 젊은 개체보다 PCa에 대해 잘못 선별될 가능성이 더 높은 것으로 나타났으나, 암 그룹에서는 두 그룹간의 통계적 유 의성은 없었다 (도 18a). 이와는 대조적으로, 혈청 PSA 수치가 높은 사람들은 정상 그룹과 암 그룹 모두에서 양 성 반응을 보일 가능성이 더 높았다 (도 18b). 또한, 전립선 용적이 낮은 사람들은 정상 그룹과 암 그룹 모두에 서 잘못된 선별 검사 결과를 받을 가능성이 더 높았다 (도 18c). 따라서, 본 발명의 다중마커를 이용한 전립선 암 스크리닝 시스템에서 임상 매개변수를 고려하면 보다 정확한 결과를 얻을 수 있음을 알 수 있다."}
{"patent_id": "10-2024-0100493", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2024-0100493", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 전립선암 진단용 바이오센서 및 시스템의 과정을 개략적으로 기재한 도면으로서, a는 소변 샘 플에 존재하는 4종의 바이오마커를 DGFET 바이오센서를 이용하여 검출하는 단계를 나타내고, b는 바이오센서 검 출 결과를 토대로 머신러닝 기반 알고리즘을 통해 전립선암을 진단하는 과정을 나타낸다.도 2는 바이오마커 농도에 따른 기준 전압 시프트를 선형 그래프로 나타낸 도면으로서, 100x 농도 변화당 기준 전압 이동은 ANXA3에서 가장 낮은 결과를 나타냈으며(82 mV/dec), PSMA, ERG 및 ENG의 경우 각각 145 mV/dec, 129 mV/dec 및 278 mV/dec을 나타냈다. 도 3의 a는 소변 샘플에 대한 측정 과정을 나타내는 도면이고, b는 동일한 채널에 pH 4, 6 및 10의 완충용액을 순차적으로 첨가하고 기준 전류(1nA)에서 하단 게이트 전압 측정 결과를 나타낸 도면으로서 5회 반복 측정 결과 전압 변화가 거의 없는 바, 소변 환경에서 안정된 센싱 성능을 보여주며, c는 각 채널에 pH 4, 6 및 10의 완충 용액을 첨가하고 24분 동안 하단 게이트 전압 측정 결과를 나타내는 도면으로서, 전압 변화가 거의 없어 안정적 인 센싱 성능을 나타낸다. 도 4는 샘플 모집단의 Gleason 점수 통계를 나타낸 도면이다. 도 5의 a는 76개의 소변 샘플에 대한 단일 바이오마커를 이용한 전립선암 진단 과정을 나타낸 도면이고, b는 4 개의 바이오마커 각각을 이용하여 3반복으로 수행된 전립선암 스크리닝 결과를 나타낸 도면이고, c는 소변 샘플 별로 4개의 바이오마커 각각을 이용하여 전립선암 스크리닝 결과를 나타낸 도면이다 (***p < 0.001, ****p < 0.0001). 도 6은 단일 바이오마커의 감지 성능을 민감도, 특이성 및 정확도로 평가한 결과를 나타낸 도면이다. 도 7은 바이오마커 쌍의 상관 매트릭스를 나타낸 도면이다. 도 8은 RF 및 NN 알고리즘을 기반으로 하는 다중마커 시스템의 설정 과정을 나타낸 도면이다. 도 9는 각 바이오마커의 감지 특헝을 평가한 도면이다. 도 10은 다양한 수의 바이오마커를 사용한 경우 RF 및 NN 알고리즘에 의한 예측 변수 값을 나타낸 도면이다. 도 11은 바이오마커 패널 수준(a) 또는 샘플 수준(b)에서의 예측 변수 값을 나타낸 도면이다. 도 12는 추가적인 데이터 세트에 대한 진단 성능 평가 결과를 나타낸 도면이다. 도 13은 바이오마커 패널 수준에서 다양한 수의 바이오마커 조합을 갖는 다중마커 감지 시스템의 RF 알고리즘 ROC 곡선을 나타낸 도면이다. 도 14는 바이오마커 패널 수준에서 다양한 수의 바이오마커 조합을 갖는 다중마커 감지 시스템의 NN 알고리즘 ROC 곡선을 나타낸 도면이다. 도 15의 a는 도 13 및 도 14의 ROC 곡선에 대한 AUROC 값을 나타낸 도면이고 (파란색: ANXA3, 녹색: PSMA, 주 황색: ERG, 보라색: ENG), b는 다양한 수의 바이오마커에 대한 평균 AUROC 값을 나타낸 도면이다 (오차막대는 s.d.를 나타낸다). 도 16의 a 내지 d는 RF 알고리즘에 의해 예측된 오류 신호의 임상 분석 결과를 나타낸 도면으로서, 테스트 세트 (총 69개의 패널)에서 다양한 수의 바이오마커 조합에 대한 결과를 나타내며, e는 0.5보다 높은 오류율을 나타 내는 바이오마커 패널의 수를 나타내는 도면이다. 도 17의 a는 정상인 및 BPH 환자에 대한 바이오마커 패널의 위양성 비율을 나타내는 도면이고, b는 DRE 전후 그 룹에 대한 바이오마커 패널의 위음성 비율을 나타내는 도면이다. 도 18은 4개의 바이오마커 조합에 대한 진양성(true positive, TP), 진음성(true negative, TN), 위양성(false positive, FP), 및 위음성(false negative, FN) 군에서의 임상적 분석 결과를 나타내는 도면으로서, 구체적으로 연령(a), PSA 수준(b) 및 전립선 용적(c)에 대한 분석 결과를 나타낸다 (***p < 0.001, ****p < 0.0001)."}
