{"patent_id": "10-2023-0129230", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0045815", "출원번호": "10-2023-0129230", "발명의 명칭": "각 자재마다 별도로 설정된 가중치를 이용하는 인공지능 알고리즘에 기초한 인테리어 자동 견", "출원인": "(주) 더라이브러리", "발명자": "송지훈"}}
{"patent_id": "10-2023-0129230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "장치에 의해 수행되는, 인공지능 알고리즘에 기초하여 인테리어 자동 견적 서비스를 제공하는 방법으로서,데이터 수집 모듈에 복수의 참조 공간에 대한 인테리어 견적서 데이터를 제공하는 단계;데이터 수집 모듈을 사용하여 제공된 상기 각각의 인테리어 견적서 데이터를 전처리하고, 전처리된 인테리어 견적서 데이터로부터 참조 공간정보 데이터 및 참조 시공이력 데이터를 추출하는 단계;데이터 수집 모듈에 특정 공간에 대한 인테리어 요청서 데이터를 제공하는 단계;데이터 수집 모듈을 사용하여 제공된 상기 인테리어 요청서 데이터를 전처리하고, 전처리된 인테리어 요청서 데이터로부터 특정 공간에 대한 공간정보 데이터 및 특정 공간에 대한 기호도 데이터를 추출하는 단계;상기 참조 공간정보 데이터 및 참조 시공이력 데이터를 제1 인공신경망 모델의 입력 레이어에 제공하여, 특정공간에 대한 공간정보 데이터가 입력되었을 때 상기 특정 공간에 대한 예상 시공목록 데이터 및 예상 시공비용데이터가 출력되도록 상기 제1 인공신경망 모델을 학습시키는 단계;복수의 주소 데이터 및 상기 각각의 주소 데이터에 대응되는 지형데이터 및 기후데이터가 저장된 환경 데이터베이스에 기초하여, 특정 공간에 대한 공간정보 데이터가 입력되었을 때 상기 특정 공간에 대한 예상 지형데이터및 예상 기후데이터가 출력되도록 제2 인공신경망 모델을 학습시키는 단계;상기 참조 공간정보 데이터, 참조 시공이력 데이터, 예상 지형데이터, 및 예상 기후데이터를 제3 인공신경망 모델의 입력 레이어에 제공하여, 특정 공간에 대한 공간정보 데이터 및 기호도 데이터가 입력되었을 때 상기 특정공간에 대한 예상 공정난이도 데이터가 출력되도록 상기 제3 인공신경망 모델을 학습시키는 단계;상기 예상 시공목록 데이터, 예상 지형데이터, 및 예상 기후데이터를 제4 인공신경망 모델의 입력 레이어에 제공하여, 특정 공간에 대한 공간정보 데이터 및 기호도 데이터가 입력되었을 때 상기 특정 공간에 대한 제안 시공목록 데이터가 출력되도록 상기 제4 인공신경망 모델을 학습시키는 단계;제안서 생성 모듈에 상기 예상 공정난이도 데이터 및 상기 예상 시공비용 데이터를 제공하여, 상기 예상 공정난이도 데이터를 바탕으로 제1 가중치를 획득하고, 상기 제1 가중치를 상기 예상 시공비용 데이터에 반영하여 제안 시공비용 데이터를 획득하는 단계; 및제안서 생성 모듈을 사용하여 상기 제안 시공목록 데이터 및 상기 제안 시공비용 데이터를 바탕으로 인테리어제안서를 생성하는 단계;를 포함하는고,상기 참조 시공이력 데이터는 상기 인테리어 견적서에 포함된 시공 항목으로서 바닥재, 벽체, 문, 창호, 조명,및 공조장치 각각을 식별하는 자재견적 데이터를 포함하고, 상기 자재견적 데이터는 상기 인테리어 견적서에 기재된 상기 각 자재견적 데이터에 대응되는 비용견적 데이터를 포함하고, 상기 비용견적 데이터는 상기 제1 인공신경망 모델을 학습시키는 단계에서 상기 예상 시공비용 데이터를 획득함에 있어 각 자재견적 데이터에 포함되는 각 자재마다 별도로 설정된 가중치에 따라 획득되도록 구성된 것을 특징으로 하는, 인테리어 자동 견적 서비스를 제공하는 방법."}
{"patent_id": "10-2023-0129230", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 인테리어 자동 견적 서비스 제공 분야에 관한 것으로서, 더욱 상세하게는 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0129230", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인테리어 자동 견적 서비스 제공 분야에 관한 것으로서, 더욱 상세하게는 각 자재마다 별도로 설정된 가중치를 이용하는 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0129230", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인테리어는 거주공간 및 상업공간과 같은 공간의 내부의 구성과 각종 기물의 배치 등에 관한 계획 및 수행을 통 칭한다. 최근 다양한 기호의 등장 및 가구와 건자재 등의 발전으로 인테리어의 구성에 있어 선택지가 점차 확대 되고 있는 가운데, 선택의 다양성으로 인한 최종 결정의 어려움을 호소하는 경우 또한 증가되고 있다. 공간의 인테리어를 계획하고 설계함에 있어서, 인테리어 의뢰자는 대부분 실내 디자인 분야에 대해 충분한 지식 이 없는 경우가 대부분이고, 이 경우 의뢰자는 별도의 인테리어 업체를 통해 인테리어를 진행하는 경우에도 추 상적이고 모호한 요청을 제공하게 됨에 따라 최종 결과물이 최초 의도한 바와 예상 외로 큰 차이가 발생될 위험 또한 존재하며, 전문가라 하더라도 요청에 대해 달리 해석하고 이해하는 경우가 있어 이와 같은 위험은 여전히 존재한다. 또한, 기존에는 컴퓨터 프로그램을 사용하더라도 인테리어 요청에 따른 대부분의 분석은 인력에 의존하는 환경 이었으나, 이로부터 탈피하여 검증된 기존 인테리어 견적서를 바탕으로 학습된 인공신경망 모델을 사용하여 신 속하면서도 합리적인 제안서를 제공할 수 있는 방법이 절실하게 요구되고 있다. 나아가, 인테리어를 계획하고 견적을 산출하는 전문가라 하더라도 매우 광범위한 인테리어의 전 분야의 전 제품 모두를 인지하고 있을 수 없고, 최근에는 에너지 절약에 대한 관심을 바탕으로 기후환경을 고려한 자재의 선택 또한 활발하게 이루어지고 있으므로, 인공신경망 알고리즘을 활용하여 인테리어의 대상이 되는 장소의 기후적 환경, 예를 들면 온습도 등을 고려하여 보다 적절한 자재를 제안할 수 있는 인테리어 자동 견적 서비스가 절실 하게 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제 10-2023-0054059호 (2023.04.24. 공개)"}
{"patent_id": "10-2023-0129230", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술된 문제점을 해결하기 위해 안출된 것으로서, 본 개시의 목적은 각 자재마다 별도로 설정된 가중 치를 이용하는 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 방법을 제공함에 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0129230", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예로, 장치에 의해 수행되는, 인공지능 알고리즘에 기초하여 인테리어 자동 견적 서비스를 제 공하는 방법은, 데이터 수집 모듈에 복수의 참조 공간에 대한 인테리어 견적서 데이터를 제공하는 단계; 데이터 수집 모듈을 사용하여 제공된 상기 각각의 인테리어 견적서 데이터를 전처리하고, 전처리된 인테리어 견 적서 데이터로부터 참조 공간정보 데이터 및 참조 시공이력 데이터를 추출하는 단계; 데이터 수집 모듈에 특정 공간에 대한 인테리어 요청서 데이터를 제공하는 단계; 데이터 수집 모듈을 사용하여 제공된 상기 인테리어 요청서 데이터를 전처리하고, 전처리된 인테리어 요청서 데 이터로부터 특정 공간에 대한 공간정보 데이터 및 특정 공간에 대한 기호도 데이터를 추출하는 단계; 상기 참조 공간정보 데이터 및 참조 시공이력 데이터를 제1 인공신경망 모델의 입력 레이어에 제공하여, 특정 공간에 대한 공간정보 데이터가 입력되었을 때 상기 특정 공간에 대한 예상 시공목록 데이터 및 예상 시공비용 데이터가 출력되도록 상기 제1 인공신경망 모델을 학습시키는 단계; 복수의 주소 데이터 및 상기 각각의 주소 데이터에 대응되는 지형데이터 및 기후데이터가 저장된 환경 데이터베 이스에 기초하여, 특정 공간에 대한 공간정보 데이터가 입력되었을 때 상기 특정 공간에 대한 예상 지형데이터 및 예상 기후데이터가 출력되도록 제2 인공신경망 모델을 학습시키는 단계; 상기 참조 공간정보 데이터, 참조 시공이력 데이터, 예상 지형데이터, 및 예상 기후데이터를 제3 인공신경망 모 델의 입력 레이어에 제공하여, 특정 공간에 대한 공간정보 데이터 및 기호도 데이터가 입력되었을 때 상기 특정 공간에 대한 예상 공정난이도 데이터가 출력되도록 상기 제3 인공신경망 모델을 학습시키는 단계; 상기 예상 시공목록 데이터, 예상 지형데이터, 및 예상 기후데이터를 제4 인공신경망 모델의 입력 레이어에 제 공하여, 특정 공간에 대한 공간정보 데이터 및 기호도 데이터가 입력되었을 때 상기 특정 공간에 대한 제안 시 공목록 데이터가 출력되도록 상기 제4 인공신경망 모델을 학습시키는 단계; 제안서 생성 모듈에 상기 예상 공정난이도 데이터 및 상기 예상 시공비용 데이터를 제공하여, 상기 예상 공정난 이도 데이터를 바탕으로 제1 가중치를 획득하고, 상기 제1 가중치를 상기 예상 시공비용 데이터에 반영하여 제 안 시공비용 데이터를 획득하는 단계; 및 제안서 생성 모듈을 사용하여 상기 제안 시공목록 데이터 및 상기 제안 시공비용 데이터를 바탕으로 인테리어 제안서를 생성하는 단계;를 포함하는 것일 수 있다. 그리고, 상기 참조 공간정보 데이터는 상기 인테리어 견적서가 발행된 대상 공간의 구성 데이터, 면적 데이터, 층고 데이터, 및 공간이 형성된 연도 데이터 중 적어도 하나가 포함된 세부 참조 공간정보 데이터로 구성된 것 일 수 있다. 그리고, 상기 참조 시공이력 데이터는 상기 인테리어 견적서에 포함된 시공 항목으로서 바닥재, 벽체, 문, 창호, 조명, 및 공조장치 각각을 식별하는 자재견적 데이터를 포함할 수 있고, 상기 자재견적 데이터는 상기 인 테리어 견적서에 기재된 상기 각 자재견적 데이터에 대응되는 비용견적 데이터를 포함할 수 있으며, 상기 비용 견적 데이터는 상기 제1 인공신경망 모델을 학습시키는 단계에서 상기 예상 시공비용 데이터를 획득함에 있어 각 자재견적 데이터에 포함되는 각 자재마다 별도로 설정된 가중치에 따라 획득되도록 구성될 수 있다. 그리고, 상기 특정 공간에 대한 공간정보 데이터는 상기 인테리어 요청서에 의해 요청되는 공간의 주소 데이터, 위치 데이터, 구성 데이터, 층고 데이터, 및 공간이 형성된 연도 데이터 중 적어도 하나가 포함된 세부 특정 공 간정보 데이터로 구성된 것일 수 있다. 그리고, 상기 특정 공간에 대한 기호도 데이터는 특정 공간에 대한 사용자의 기호도가 반영된 데이터로서, 공간 의 바닥재의 색상, 공간의 벽체의 색상, 공간의 문 및 창호의 색상 및 투명도, 공간의 조명의 조도, 공간의 온 도, 및 공간의 습도 중 적어도 하나가 포함된 세부 기호도 데이터로 구성된 것일 수 있다. 그리고, 상기 제1 인공신경망 모델을 학습시키는 단계의 상기 예상 시공목록 데이터에는 바닥재, 벽체, 문, 및 창호를 식별하는 토목 식별데이터가 포함될 수 있다. 그리고, 상기 제1 인공신경망 모델을 학습시키는 단계의 상기 예상 시공비용 데이터에는 인건비데이터 및 자재 비용데이터가 포함될 수 있다. 그리고, 상기 제2 인공신경망 모델을 학습시키는 단계의 상기 주소 데이터는 특정 장소의 위도 및 경도를 바탕 으로 한 위치 데이터일 수 있고, 상기 지형데이터는 상기 주소 데이터가 지시하는 위치의 위도, 경도, 및 고도 를 포함하는 지형에 관한 데이터일 수 있으며, 상기 기후데이터는 상기 주소 데이터가 지시하는 위치의 평균 기 온, 평균 습도, 및 평균 일조량을 포함하는 기후에 관한 데이터일 수 있다. 그리고, 상기 제3 인공신경망 모델을 학습시키는 단계의 상기 예상 공정난이도 데이터는 상기 세부 공간정보 데 이터의 각 데이터마다 별도로 설정된 가중치에 따라 획득되도록 구성될 수 있다. 그리고, 상기 제3 인공신경망 모델을 학습시키는 단계의 상기 예상 공정난이도 데이터는 상기 기호도 데이터에 포함된 세부 기호도 데이터 각각에 별도로 부여된 가중치를 반영하여 획득되도록 구성될 수 있다. 그리고, 상기 제4 인공신경망 모델을 학습시키는 단계의 상기 제안 시공목록 데이터에는 바닥재, 벽체, 문, 및 창호를 식별하는 토목 제안데이터가 포함될 수 있다. 그리고, 상기 제4 인공신경망 모델을 학습시키는 단계의 상기 제안 시공목록 데이터는 상기 기호도 데이터에 포 함된 세부 기호도 데이터 각각에 따라 상기 토목 제안데이터에 포함되는 바닥재, 벽체, 문, 및 창호를 결정하도 록 구성될 수 있다. 그리고, 상기 제4 인공신경망 모델은 상기 토목 식별데이터, 예상 지형데이터, 및 예상 기후데이터를 바탕으로 상기 토목 제안데이터에 포함되는 바닥재, 벽체, 문, 및 창호를 결정하도록 구성될 수 있다. 그리고, 상기 제안 시공비용 데이터를 획득하는 단계에서는 상기 제1 가중치를 상기 예상 시공비용 데이터에 반 영함에 있어, 상기 예상 시공비용 데이터에 포함되는 인건비데이터에 상기 예상 지형데이터에 종속되는 상기 제 1 가중치의 하위 가중치로서 제1-1 가중치를 반영하고, 상기 예상 시공비용 데이터에 포함되는 자재비용데이터 에 상기 예상 기후데이터에 종속되는 상기 제1 가중치의 하위 가중치로서 제1-2 가중치를 반영하여 상기 제안 시공비용 데이터를 획득하도록 구성될 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기 록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2023-0129230", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예에 의해, 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 방법이 제공될 수 있다. 본 개시의 다양한 실시예에 의해, 복수의 인테리어 견적서로부터 획득한 인테리어 관련 데이터 및 주소데이터를 바탕으로 획득한 지형데이터 및 기후데이터를 바탕으로, 인테리어 요청서를 분석하고 이에 가장 적합한 기존의 인테리어 견적에 포함된 시공목록을 바탕으로 요청자의 기호도를 반영한 시공항목을 제안하고, 그에 따른 예상 비용을 함께 안내하여 신속하고 예측가능한 인테리어 제안 서비스가 제공될 수 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0129230", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시의 개시가 완전하도록 하고, 본 개시가 속하는 기술 분야의 통상의 기술자에게 본 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 개시를 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되 나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성요소는 본 개시의 기 술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 개시가 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용 되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되 지 않는다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소과의 상관관계를 용이하게 기술하기 위해사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용 시 또는 동작 시 구성 요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤집을 경우, 다른 구성요소의 \"아래(below)\"또는 \"아래 (beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위(above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \" 아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있다. 본 개시를 설명함에 있어서, \"관리자\"는 서버에 의해 제공되는 서비스를 사용하여 인테리어 제안서를 생성하는 자를 의미할 수 있다. 그리고, \"사용자\"는 서버에 의해 제공되는 서비스를 사용하여 인테리어 요청서를 제출하 고 그에 따라 생성된 인테리어 제안서를 제공받는 자를 의미할 수 있다. 이하에서는 도면을 참조하여 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 방법에 대해 구체적으로 설명하도록 한다. 도 1은 본 개시의 일 실시예에 따른, 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 시스 템을 간략히 도시한 도면이다. 도 1에 도시된 바와 같이, 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 방법을 구현하기 위한 시스템은, 장치, 제1 사용자가 이용하는 단말 장치, 및 데이터베이스를 포함할 수 있다. 여기서, 도 1에는 장치는 데스크탑으로 구현된 경우를 도시하고 있으며, 제1 사용자가 이용하는 단말 장치 가 하나의 스마트 폰의 형태로 구현된 경우를 도시하고 있으나, 이에 한정되는 것은 아니다. 장치 및 제1 사용자가 이용하는 단말 장치는 다양한 유형의 전자 장치(예로, 노트북, 데스크톱 (desktop), 랩톱(laptop), 태블릿 PC, 슬레이트 PC 장치, 서버 장치 등)로 구현될 수 있으며, 하나 이상의 유형 의 장치가 연결된 장치 군으로도 구현될 수 있다. 예로, 장치는 하나 이상의 유형의 장치가 연결된 장치 군으로 구현될 수 있다. 예로, 장치는 인공지 능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 어플리케이션을 관리하는 장치, 어플리케이션과 관련된 데이터를 저장하는 클라우드 서버 등으로 구현될 수 있다. 도 1에는 인공지능 알고리즘에 기초하여 상담 서비스를 제공받는 사용자(즉, 제1 사용자)가 한명인 경우를 가정 하고 있으나 이에 제한되는 것은 아니다. 사용자의 수는 다양한 값으로 구현될 수 있다. 시스템에 포함된 장치, 제1 사용자가 이용하는 단말 장치, 및 데이터베이스(즉, 데이터베 이스가 포함된 클라우드 서버)는 네트워크(W)를 통해 통신을 수행할 수 있다. 여기서, 네트워크(W)는 유선 네트워크와 무선 네트워크를 포함할 수 있다. 예를 들어, 네트워크는 근거리 네트 워크(LAN: Local Area Network), 도시권 네트워크(MAN: Metropolitan Area Network), 광역 네트워크(WAN: Wide Area Network) 등의 다양한 네트워크를 포함할 수 있다. 또한, 네트워크(W)는 공지의 월드 와이드 웹(WWW: World Wide Web)을 포함할 수도 있다. 그러나, 본 개시의 실 시예에 따른 네트워크(W)는 상기 열거된 네트워크에 국한되지 않고, 공지의 무선 데이터 네트워크나 공지의 전 화 네트워크, 공지의 유무선 텔레비전 네트워크를 적어도 일부로 포함할 수도 있다. 장치는 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 어플리케이션을 하나 이상의 사용자에게 제공할 수 있다. 해당 어플리케이션은 사용자로부터 인테리어 요청서를 제공받고 복수의 인테리어 견적서에 포함된 데이터로 학습된 인공신경망에 의해 자동으로 생성된 인테리어 제안서를 사용자에게 제공하는 서비스를 제공할 수 있다. 구체적으로, 장치는 복수의 인테리어 견적서로부터 참조 공간정보 데이터 및 참조 시공이력 데이터를 추출 하고, 추출된 상기 데이터, 및 복수의 주소 데이터, 상기 주소 데이터에 대응되는 지형데이터 및 기후데이터에 기초하여, 인테리어 요청서로부터 특정 공간에 대한 공간정보 데이터 및 기호도 데이터를 추출하여 복수의 인공 신경망 모델을 학습 및 사용하여 자동 생성된 인테리어 제안서를 제공하도록 할 수 있다. 장치가 상술된 각종 동작을 수행하는 방법은 도 2 내지 도 3을 참조하여 구체적으로 설명하도록 한다. 데이터베이스(즉, 데이터베이스가 포함된 클라우드 서버)는 장치가 AI 모델을 학습시키기 위해 사용하는 각종 텍스트/이미지 데이터가 구축된 데이터베이스를 의미할 수 있다. 데이터베이스는 장치 의 일 구성 요소로 구현될 수 있으나 이에 제한되는 것은 아니며 별도의 클라우드 서버로 구현될 수도 있 다. 도 2는 본 개시의 일 실시예에 따른, 인공지능 알고리즘에 기초하여 인테리어 자동 견적 서비스를 제공하는 서 버의 구성을 간략히 도시한 블록도이다. 도 2에 도시된 바와 같이, 장치는 메모리, 통신 모듈, 디스플레이, 및 프로세서를 포 함할 수 있다. 다만, 도 2에 도시된 구성은 본 개시의 실시 예들을 구현하기 위한 예시도이며, 통상의 기술자에게 자명한 수준 의 적절한 하드웨어 및 소프트웨어 구성들이 장치에 추가로 포함될 수 있다. 메모리는 프로세서가 각종 동작을 수행하기 위한 하나 이상의 인스트럭션(instruction)을 저장할 수 있다. 메모리는 장치의 다양한 기능을 지원하는 데이터와, 프로세서의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들을 저장할 수 있다. 메모리는 인테리어 견적서, 인테리어 요청서, 주소 데이터, 지형데이터, 및 기후데이터를 저장할 수 있다. 메모리는 각종 AI 모델(예로, 제1 AI 모델, 제2 AI 모델, 및 전체 AI 모델)에 대해 학습/추론 동작을 수행 하기 위한 하나 이상의 파라미터를 저장할 수 있다. 상술한 바와 같이, 메모리는 도 1의 데이터베이스 에 구축된 음성/데이터 데이터를 저장할 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입(Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM: random access memory), SRAM(static random access memory), 롬(ROM: read-only memory), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 통신 모듈은 외부 장치(예로, 사용자가 이용하는 단말 장치 등)와의 통신이 가능하게 하는 회로를 포함하 는 하나 이상의 구성 요소를 포함할 수 있다. 예를 들어, 통신 모듈은 방송 수신 모듈, 유선통신 모듈, 무선통신 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나를 포함할 수 있다. 디스플레이는 장치에서 처리되는 정보를 표시(출력)한다. 예를 들어, 본 디스플레이는 본 장치 에서 구동되는 응용 프로그램(예로, 인공지능 알고리즘에 기초하여 인테리어 자동 견적 서비스를 제공하는 어플리케이션/웹 사이트)의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface) (예를 들어, 관리자가 인테리어 견적서의 세부 항목에 대한 텍스트 및 세부 항목을 설명하는 이미지를 입력할 수 있는 UI 등), GUI(Graphic User Interface) 정보를 표시할 수 있다. 입력 모듈은 장치에 각종 입력 데이터 또는/및 입력 인터렉션(예로, 터치, 스와이프 등)을 인가하기 위한 구성 요소를 의미한다. 프로세서는 메모리에 저장된 하나 이상의 인스트럭션(instruction)을 실행함으로써 인공지능 알고리 즘에 기초하여 인테리어 자동 견적 서비스를 제공하는 방법을 제공할 수 있다. 즉, 프로세서는 장치(10 0)의 각 구성 요소를 이용하여 전반적인 동작 및 기능을 제어할 수 있다. 구체적으로, 프로세서는 장치 내의 구성요소들의 동작을 제어하기 위한 알고리즘 또는 알고리즘을 재 현한 프로그램에 대한 데이터를 저장하는 메모리, 및 메모리에 저장된 데이터를 이용하여 전술한 동작을 수행하 는 적어도 하나의 프로세서로 구현될 수 있다. 이때, 메모리와 프로세서는 각각 별개의 칩으로 구현될 수 있다. 또는, 메모리와 프로세서는 단일 칩으로 구현될 수도 있다. 또한, 프로세서는 이하의 도 3에서 설명되는 본 개시에 따른 다양한 실시 예들을 본 장치 상에서 구 현하기 위하여, 위에서 살펴본 구성요소들을 중 어느 하나 또는 복수를 조합하여 제어할 수 있다. 도 3은 본 개시의 일 실시예에 따른, 인공지능 알고리즘에 기초하여 인테리어 자동 견적 서비스를 제공하는 방 법을 설명하기 위한 순서도이다. 장치는 데이터 수집 모듈, 제1 인공신경망 모델, 제2 인공신경말 모델, 제3 인공신경말 모델, 제4 인공신경말 모델, 및 제안서 생성 모듈을 포함할 수 있다.장치는 데이터 수집 모듈이 복수의 참조 공간에 대한 인테리어 견적서 데이터를 제공받도록 할 수 있다(S310). 예로, 데이터 수집 모듈은 다양한 공간 및 장소에 대해 발행된 각종 인테리어 견적서를 제공받아, 이로부터 유 의미한 데이터를 확보하여 제공받을 수 있고, 다양한 공간 및 장소는 일반 주택, 아파트, 오피스텔, 사무공간, 식당, 카페, 판매용 쇼룸 등일 수 있고, 유의미한 데이터로는 상기 각 공간 및 장소 자체에 대한 물리적 구조 및 환경에 대한 데이터와 상기 각 공간 및 장소의 인테리어를 위한 바닥재, 벽체, 문, 창호 등에 관한 데이터가 포함될 수 있다. 즉, 데이터 수집 모듈은 각종 인테리어 견적서를 스캔하여 견적서에 포함된 텍스트 및 이미지 등의 정보를 데이 터로서 식별하여 제공받을 수 있고, 별도의 관리자에 의해 각종 정보가 상기 모듈에 입력될 수도 있다. 데이터 수집 모듈을 통해 수집된 인테리어 견적서로부터 기인한 데이터는 별도의 데이터베이스로서 저장되고 관리될 수 있다. 장치는 데이터 수집 모듈을 사용하여 제공된 상기 각각의 인테리어 견적서 데이터를 전처리하고, 전처리된 인테 리어 견적서 데이터로부터 참조 공간정보 데이터 및 참조 시공이력 데이터를 추출할 수 있다(S320). 예로, 데이터 수집 모듈은 제공받은 인테리어 견적서 데이터를 분석하고 이에 포함된 하위 데이터 및 벡터를 추 출하여 분류하고 라벨링할 수 있고, 인테리어 견적서 데이터로부터 추출된 하위 데이터 및 벡터를 사전 정의된 규칙에 따라 분류 및 조합하여 참조 공간정보 데이터 및 참조 시공이력 데이터를 추출할 수 있다. 참조 공간정 보는 인테리어 견적서가 발행된 대상 공간에 관한 데이터일 수 있고, 참조 시공이력 데이터는 인테리어 견적서 가 발행된 대상 공간에 시공할 것으로 견적되었던 각종 항목의 분류 및 각 항목에 포함되는 자재 내지는 제품에 관한 데이터일 수 있다. 예를 들어, 상기 참조 공간정보 데이터는 상기 인테리어 견적서가 발행된 대상 공간의 구성 데이터, 면적 데이 터, 층고 데이터, 및 공간이 형성된 연도 데이터 중 적어도 하나가 포함된 세부 참조 공간정보 데이터로 구성된 것일 수 있다. 예를 들어, 상기 참조 시공이력 데이터는 상기 인테리어 견적서에 포함된 시공 항목으로서 바닥재, 벽체, 문, 창호, 조명, 및 공조장치 각각을 식별하는 자재견적 데이터를 포함할 수 있고, 상기 자재견적 데이터는 상기 인 테리어 견적서에 기재된 상기 각 자재견적 데이터에 대응되는 비용견적 데이터를 포함할 수 있으며, 상기 비용 견적 데이터는 상기 제1 인공신경망 모델을 학습시키는 단계에서 상기 예상 시공비용 데이터를 획득함에 있어 각 자재견적 데이터에 포함되는 각 자재마다 별도로 설정된 가중치에 따라 획득되도록 구성될 수 있다. 장치는 데이터 수집 모듈은 특정 공간에 대한 인테리어 요청서 데이터를 제공받도록 할 수 있다(S330). 예로, 데이터 수집 모듈은 특정한 공간에 대한 인테리어를 요청하는 요청서를 제공받아, 이로부터 유의미한 데 이터를 확보하여 제공받을 수 있고, 특정한 공간은 일반 주택, 아파트, 오피스텔, 사무공간, 식당, 카페, 판매 용 쇼룸 등일 수 있고, 유의미한 데이터로는 상기 각 공간 및 장소 자체에 대한 물리적 구조 및 환경에 대한 데 이터와 상기 각 공간 및 장소의 인테리어를 위한 바닥재, 벽체, 문, 창호 등에 관한 데이터가 포함될 수 있다. 즉, 데이터 수집 모듈은 각종 인테리어 요청서를 스캔하여 견적서에 포함된 텍스트 및 이미지 등의 정보를 데이 터로서 식별하여 제공받을 수 있고, 별도의 사용자에 의해 각종 정보가 상기 모듈에 입력될 수도 있다. 데이터 수집 모듈을 통해 수집된 인테리어 요청서로부터 기인한 데이터는 별도의 데이터베이스로서 저장되고 관리될 수 있다. 장치는 데이터 수집 모듈을 사용하여 제공된 상기 인테리어 요청서 데이터를 전처리하고, 전처리된 인테리어 요 청서 데이터로부터 특정 공간에 대한 공간정보 데이터 및 특정 공간에 대한 기호도 데이터를 추출할 수 있다 (S340). 예로, 데이터 수집 모듈은 제공받은 인테리어 요청서 데이터를 분석하고 이에 포함된 하위 데이터 및 벡터를 추 출하여 분류하고 라벨링할 수 있고, 인테리어 요청서 데이터로부터 추출된 하위 데이터 및 벡터를 사전 정의된 규칙에 따라 분류 및 조합하여 특정 공간에 대한 공간정보 데이터 및 특정 공간에 대한 기호도 데이터를 추출할 수 있다. 특정 공간에 대한 공간정보 데이터는 인테리어 요청서가 목적하는 대상 공간에 관한 데이터일 수 있 고, 특정 공간에 대한 기호도 데이터는 인테리어 요청서를 작성한 사용자가 희망하는 인테리어의 컨셉, 디자인 방향, 인테리어가 완료되었을 때 희망되는 공간의 분위기 등에 관한 추상적인 정보일 수 있고, 공간을 구성하는 각종 자재들의 조합이 나타내는 주된 색감 내지는 색상, 공간의 조도와 밝기, 습도, 향기 등 공간에 관한 인식 을 구성하는 모든 항목들을 포괄하는 것에 관한 데이터일 수 있다.예를 들어, 상기 특정 공간에 대한 공간정보 데이터는 상기 인테리어 요청서에 의해 요청되는 공간의 주소 데이 터, 위치 데이터, 구성 데이터, 층고 데이터, 및 공간이 형성된 연도 데이터 중 적어도 하나가 포함된 세부 특 정 공간정보 데이터로 구성된 것일 수 있다. 예를 들어, 상기 특정 공간에 대한 기호도 데이터는 특정 공간에 대한 사용자의 기호도가 반영된 데이터로서, 공간의 바닥재의 색상, 공간의 벽체의 색상, 공간의 문 및 창호의 색상 및 투명도, 공간의 조명의 조도, 공간의 온도, 및 공간의 습도 중 적어도 하나가 포함된 세부 기호도 데이터로 구성된 것일 수 있다. 장치는 상기 참조 공간정보 데이터 및 참조 시공이력 데이터를 제1 인공신경망 모델의 입력 레이어에 제공하여, 특정 공간에 대한 공간정보 데이터가 입력되었을 때 상기 특정 공간에 대한 예상 시공목록 데이터 및 예상 시공 비용 데이터가 출력되도록 상기 제1 인공신경망 모델을 학습시킬 수 있다(S350). 예로, 제1 인공신경망 모듈은, 교사 신호(정답)의 입력에 의해서 문제의 해결에 최적화되도록 학습하는 지도 학 습(Supervised Learning) 방법과, 교사 신호를 필요로 하지 않는 비지도 학습(Unsupervised Learning) 방법을 포함하는 방법으로 학습될 수 있고, 머신러닝(Machine Learning)기술을 사용하여 학습될 수 있다. 제1 인공신경망 모듈은 인테리어 견적서로부터 제공 및 추출된 참조 공간정보 데이터 및 참조 시공이력 데이터 를 사용하여 인테리어 요청서로부터 제공 및 추출된 특정 공간에 대한 공간정보 데이터를 바탕으로 해당 공간에 대한 인테리어가 수행되었을 경우 필요한 시공의 항목 및 상기 각 항목에 포함되는 요소들에 관한 데이터를 출 력할 수 있고, 상기 각 요소들에 페어링(Pairing)된 비용 데이터를 조합하여 예상 시공비용 데이터를 출력할 수 있다. 즉, 사용자는 인테리어 요청서를 제출하는 것을 통해 이에 포함된 각종 데이터들을 인공신경망에 입력하여 자동 생성된 인테리어 제안서를 제공받을 수 있으며, 별도의 인공신경망 모듈을 사용하는 것을 통해 기호도가 반영되 었을 때 예측되는 인테리어의 내용에 관한 정보 또한 제공받을 수 있다. 예를 들어, 상기 제1 인공신경망 모델을 학습시키는 단계의 상기 예상 시공목록 데이터에는 바닥재, 벽체, 문, 및 창호를 식별하는 토목 식별데이터가 포함될 수 있다. 즉, 예상 시공목록 데이터에는 바닥재, 벽체, 문, 및 창호 각각의 시공에 관한 데이터가 포함되어, 각각의 요소들이 시공되었을 때 어떠한 구체 요소가 선택될 수 있 을지 및 그에 따른 예상 비용이 포함될 수 있다. 예를 들어, 상기 제1 인공신경망 모델을 학습시키는 단계의 상기 예상 시공비용 데이터에는 인건비데이터 및 자 재비용데이터가 포함될 수 있다. 즉, 예상 시공비용 데이터는 자재 자체의 비용에 관한 데이터와 시공이 수행됨 에 있어 지출되어야 하는 인건비에 관한 데이터가 포함될 수 있다. 상기 각각의 데이터는 별도로 구분되어 출력 될 수도 있고, 은닉될 수도 있다. 장치는 복수의 주소 데이터 및 상기 각각의 주소 데이터에 대응되는 지형데이터 및 기후데이터가 저장된 환경 데이터베이스에 기초하여, 특정 공간에 대한 공간정보 데이터가 입력되었을 때 상기 특정 공간에 대한 예상 지 형데이터 및 예상 기후데이터가 출력되도록 제2 인공신경망 모델을 학습시킬 수 있다(S360). 예로, 제2 인공신경망 모듈은 임의의 주소데이터와 이에 대응되는 지형데이터 및 기후데이터를 활용하여 임의의 공간정보 데이터를 제공받았을 때 이에 대응되는 지형데이터 및 기후데이터를 제공하거나, 예측되는 지형데이터 및 기후데이터를 제공할 수 있다. 즉, 제2 인공신경망 모듈이 사용됨에 따라 인테리어 요청서로부터 제공받은 공간정보 데이터만으로도 관련 지형 데이터 및 기후데이터를 제공할 수 있으며, 제공된 지형데이터 및 기후데이터는 인테리어를 위한 자재의 선택, 시공 항목의 결정, 시공 공법의 결정, 시공 관련 비용이 산정 등에 활용될 수 있다. 예를 들어, 상기 제2 인공신경망 모델을 학습시키는 단계의 상기 주소 데이터는 특정 장소의 위도 및 경도를 바 탕으로 한 위치 데이터일 수 있고, 상기 지형데이터는 상기 주소 데이터가 지시하는 위치의 위도, 경도, 및 고 도를 포함하는 지형에 관한 데이터일 수 있으며, 상기 기후데이터는 상기 주소 데이터가 지시하는 위치의 평균 기온, 평균 습도, 및 평균 일조량을 포함하는 기후에 관한 데이터일 수 있다. 장치는 상기 참조 공간정보 데이터, 참조 시공이력 데이터, 예상 지형데이터, 및 예상 기후데이터를 제3 인공신 경망 모델의 입력 레이어에 제공하여, 특정 공간에 대한 공간정보 데이터 및 기호도 데이터가 입력되었을 때 상 기 특정 공간에 대한 예상 공정난이도 데이터가 출력되도록 상기 제3 인공신경망 모델을 학습시킬 수 있다 (S370).예를 들어, 상기 제3 인공신경망 모델을 학습시키는 단계의 상기 예상 공정난이도 데이터는 상기 세부 공간정보 데이터의 각 데이터마다 별도로 설정된 가중치에 따라 획득되도록 구성될 수 있다. 예로, 상기 세부 공간정보 데이터에 포함되는 공간의 주소 데이터, 위치 데이터, 구성 데이터, 층고 데이터, 및 공간이 형성된 연도 데이 터 각각은 별도의 가중치가 사전 설정되어 있을 수 있다. 예를 들어, 공간의 층고가 너무 낮은 경우 작업 난이 도의 상승으로 인해 전체 공정난이도가 상승될 수 있으므로 다른 요소에 비해 상대적으로 높은 가중치가 부여되 어, 너무 낮은 층고를 갖는 공간에 대한 인테리어가 요청된 경우 예상 공정난이도가 현저히 높은 것으로 평가될 수 있다. 예를 들어, 상기 제3 인공신경망 모델을 학습시키는 단계의 상기 예상 공정난이도 데이터는 상기 기호도 데이터 에 포함된 세부 기호도 데이터 각각에 별도로 부여된 가중치를 반영하여 획득되도록 구성될 수 있다. 장치는 상기 예상 시공목록 데이터, 예상 지형데이터, 및 예상 기후데이터를 제4 인공신경망 모델의 입력 레이 어에 제공하여, 특정 공간에 대한 공간정보 데이터 및 기호도 데이터가 입력되었을 때 상기 특정 공간에 대한 제안 시공목록 데이터가 출력되도록 상기 제4 인공신경망 모델을 학습시킬 수 있다(S380). 예를 들어, 상기 제4 인공신경망 모델을 학습시키는 단계의 상기 제안 시공목록 데이터에는 바닥재, 벽체, 문, 및 창호를 식별하는 토목 제안데이터가 포함될 수 있다. 또한, 상기 제4 인공신경망 모델을 학습시키는 단계의 상기 제안 시공목록 데이터는 상기 기호도 데이터에 포함된 세부 기호도 데이터 각각에 따라 상기 토목 제안데 이터에 포함되는 바닥재, 벽체, 문, 및 창호를 결정하도록 구성될 수 있다. 예로, 세부 기호도에 포함된 항목이 바닥재의 재료를 특정하는 경우, 제안 시공목록 데이터에 포함되는 바닥재에 관한 데이터는 인테리어 요청서에 의해 특정된 바닥재의 재료를 지시할 수 있다. 또한, 상기 제4 인공신경망 모델은 상기 토목 식별데이터, 예상 지형데이터, 및 예상 기후데이터를 바탕으로 상기 토목 제안데이터에 포함되는 바닥재, 벽체, 문, 및 창호를 결 정하도록 구성될 수 있다. 장치는 제안서 생성 모듈이 상기 예상 공정난이도 데이터 및 상기 예상 시공비용 데이터를 제공받아, 상기 예상 공정난이도 데이터를 바탕으로 제1 가중치를 획득하도록 할 수 있고, 상기 제1 가중치를 상기 예상 시공비용 데 이터에 반영하여 제안 시공비용 데이터를 획득할 수 있다(S390). 예를 들어, 상기 제안 시공비용 데이터를 획득하는 단계에서는 상기 제1 가중치를 상기 예상 시공비용 데이터에 반영함에 있어, 상기 예상 시공비용 데이터에 포함되는 인건비데이터에 상기 예상 지형데이터에 종속되는 상기 제1 가중치의 하위 가중치로서 제1-1 가중치를 반영하고, 상기 예상 시공비용 데이터에 포함되는 자재비용데이 터에 상기 예상 기후데이터에 종속되는 상기 제1 가중치의 하위 가중치로서 제1-2 가중치를 반영하여 상기 제안 시공비용 데이터를 획득하도록 구성될 수 있다. 장치는 제안서 생성 모듈을 사용하여 상기 제안 시공목록 데이터 및 상기 제안 시공비용 데이터를 바탕으로 인 테리어 제안서를 생성할 수 있다(S310). 즉, 사용자는 인테리어 요청서를 제출한 이후 장치에 의해 자동으로 생 성된 인테리어 제안서를 제공받을 수 있다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하 여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2023-0129230", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통 상의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어 서는 안 된다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2023-0129230", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른, 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 시스 템을 간략히 도시한 도면이다. 도 2는 본 개시의 일 실시예에 따른, 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 장치 를 간략히 도시한 블록도이다. 도 3은 본 개시의 일 실시예에 따른, 인공지능 알고리즘에 기초한 인테리어 자동 견적 서비스를 제공하는 방법 을 설명하기 위한 순서도이다."}
