{"patent_id": "10-2023-0037894", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0061550", "출원번호": "10-2023-0037894", "발명의 명칭": "스마트 데이터 수집 장치 및 에너지 데이터 필터링 방법", "출원인": "국민대학교산학협력단", "발명자": "라이한 빈 모피둘"}}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트 데이터 수집 장치에 있어서,상기 스마트 데이터 수집 장치와 연결된 가전 기기의 전력 소비에 관한 에너지 데이터를 수집하는 수집부; 및상기 가전 기기의 연결 부하로 인한 상기 에너지 데이터의 변동 추이를 기초로, 상기 에너지 데이터 상의 노이즈를 필터링한 필터링 데이터를 반환하는 필터링부를 포함하는 것을 특징으로 하는 스마트 데이터 수집 장치."}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 에너지 데이터는,전압 센서를 통해서 측정되는 전압 값을 포함하며,상기 필터링부는,공급 전압의 주파수를 기준으로 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로그 전압의 최대 피크 전압과 최소 피크 전압을 관측하기 위한 타겟 이벤트 주기를 결정하며,상기 타겟 이벤트 주기마다 축적된 최대 피크 전압과 최소 피크 전압 간 차이의 변동 폭에 대해서 평균 값을 반영하여 계산한 전압의 실효 값을 상기 필터링 데이터로 반환하는 것을 특징으로 하는 스마트 데이터 수집 장치."}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 에너지 데이터는,전류 센서를 통해서 측정되는 전류 값을 포함하며,상기 필터링부는,공급 전압의 주파수를 기준으로, 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로그 전압의 관측을 위한 타겟 이벤트 주기를 결정하며,상기 타겟 이벤트 주기마다 축적된 아날로그 전압의 변동 폭에 대해 평균 값을 반영하여 계산한 전류의 실효 값을 상기 필터링 데이터로 반환하는 것을 특징으로 하는 스마트 데이터 수집 장치."}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 스마트 데이터 수집 장치는,MQTT(Message Queuing Telemetry Transport) 프로토콜을 통해서 상기 필터링 데이터를 전송하는 전송부를 더포함하며,상기 전송부는,에지(Edge) 단에서 원격의 중앙 집중식 산업용 사물 인터넷 시스템(Centralized IIoT system)과 데이터를 교환하는 에지 산업용 사물 인터넷 시스템(Edge IIoT system)으로 상기 필터링 데이터를 전송하는 것을 특징으로 하는 스마트 데이터 수집 장치."}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0061550-3-스마트 데이터 수집 장치에서 수행되는 에너지 데이터 필터링 방법에 있어서,상기 스마트 데이터 수집 장치와 연결된 가전 기기의 전력 소비에 관한 에너지 데이터를 수집하는 수집단계; 및상기 가전 기기의 연결 부하로 인한 상기 에너지 데이터의 변동 추이를 기초로, 상기 에너지 데이터 상의 노이즈를 필터링한 필터링 데이터를 반환하는 필터링단계를 포함하는 것을 특징으로 하는 에너지 데이터 필터링 방법."}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 에너지 데이터는,전압 센서를 통해서 측정되는 전압 값을 포함하며,상기 필터링단계는,공급 전압의 주파수를 기준으로 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로그 전압의 최대 피크 전압과 최소 피크 전압을 관측하기 위한 타겟 이벤트 주기를 결정하며,상기 타겟 이벤트 주기마다 축적된 최대 피크 전압과 최소 피크 전압 간 차이의 변동 폭에 대해서 평균 값을 반영하여 계산한 전압의 실효 값을 상기 필터링 데이터로 반환하는 것을 특징으로 하는 에너지 데이터 필터링 방법."}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 4 항에 있어서,상기 에너지 데이터는,전류 센서를 통해서 측정되는 전류 값을 포함하며,상기 필터링단계는,공급 전압의 주파수를 기준으로, 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로그 전압의 관측을 위한 타겟 이벤트 주기를 결정하며,상기 타겟 이벤트 주기마다 축적된 아날로그 전압의 변동 폭에 대해 평균 값을 반영하여 계산한 전류의 실효 값을 상기 필터링 데이터로 반환하는 것을 특징으로 하는 에너지 데이터 필터링 방법."}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 4 항에 있어서,상기 방법은,MQTT(Message Queuing Telemetry Transport) 프로토콜을 통해서 상기 필터링 데이터를 전송하는 전송단계를 더포함하며,상기 전송단계는,에지(Edge) 단에서 원격의 중앙 집중식 산업용 사물 인터넷 시스템(Centralized IIoT system)과 데이터를 교환하는 에지 산업용 사물 인터넷 시스템(Edge IIoT system)으로 상기 필터링 데이터를 전송하는 것을 특징으로 하는 에너지 데이터 필터링 방법."}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 5 항 내지 제 8 항 중 어느 한 항의 방법을 실행시키기 위한 프로그램을 기록한 컴퓨터 판독 가능 기록매체."}
{"patent_id": "10-2023-0037894", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어와 결합되어, 제 5 항 내지 제 8 항 중 어느 한 항의 방법을 실행시키기 위해 매체에 저장된 컴퓨터 프로그램.공개특허 10-2024-0061550-4-"}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 댁내 가전 기기에 대해서 수집되는 에너지 데이터의 필터링 방안에 관한 것이다."}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 산업용 사물 인터넷(IIoT: Industrial Internet of Things)과 관련하여, 댁내 가전 기기에 대해서 수집되는 에너지 데이터의 필터링 방안에 관한 것이다."}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 사물 인터넷(IoT: Internet of Things) 망으로 진화하고 있다. 이러한, 사물 인터넷 환경에서는, 기존의 IT(information technology)기술과 다양한 산업 간의 융합 및 복합을 통하여 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스마트 그리드, 헬스 케어, 스마트 가전, 및 첨단의료서비스 등의 분야에 응용될 수 있는 것이다. 최근에는, 이러한 사물 인터넷보다 하위 범주의 개념으로서, 인더스트리 4.0 기술의 기본 요소가 되는 산업용 사물 인터넷(IIoT: Industrial Internet of Things)이 주목받고 있다. 산업용 사물 인터넷은, 사물 인터넷 기술(연결된 기계, 장치, 센서)을 산업용 애플리케이션에서 활용할 수 있으 며, 인공지능(AI)와 머신러닝 기능을 갖춘 현대식 ERP에서 실현되는 경우, 산업용 사물 인터넷의 센서 노드로부 터 수집되는 데이터를 분석하고 활용하여 효율성, 생산성, 가시성 등을 개선할 수 있다. 한편, 이러한 산업용 사물 인터넷 기술의 응용 분야가 될 수 있는 스마트 홈에서 가전 기기에 대한 에너지 데이 터 측정은, 빌딩 에너지 관리 시스템(BEMS: Building Energy Management System)뿐만 아니라 스마트 에너지 관 리 시스템(SEMS: Smart Energy Management System) 구축을 위해 필수적이다. 그러나, 댁내 이처럼 가전 기기에 대해서 수집되는 에너지 데이터는 AI 모델의 학습을 위해 이용되는 반면, 측 정된 에너지 데이터의 품질을 보장할 수 없는 경우, 이러한 모델 학습에 있어서 큰 장애가 될 수 있다."}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 사정을 감안하여 창출된 것으로서, 본 발명에서 도달하고자 하는 목적은, 산업용 사물 인터넷 (IIoT: Industrial Internet of Things)과 관련하여, 댁내 가전 기기에 대해서 수집되는 에너지 데이터의 신뢰 도 확보를 위한 필터링 방안을 제안하는데 있다."}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치는, 상기 스마트 데이터 수집 장치와 연결된 가전 기기의 전력 소비에 관한 에너지 데이터를 수집하는 수집부; 및 상기 가전 기기의 연결 부 하로 인한 상기 에너지 데이터의 변동 추이를 기초로, 상기 에너지 데이터 상의 노이즈를 필터링한 필터링 데이 터를 반환하는 필터링부를 포함하는 것을 특징으로 한다. 구체적으로, 상기 에너지 데이터는, 전압 센서를 통해서 측정되는 전압 값을 포함하며, 상기 필터링부는, 공급 전압의 주파수를 기준으로 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로그 전압의 최대 피크 전압과 최소 피크 전압을 관측하기 위한 타겟 이벤트 주기를 결정하며, 상기 타겟 이벤트 주 기마다 축적된 최대 피크 전압과 최소 피크 전압 간 차이의 변동 폭에 대해서 평균 값을 반영하여 계산한 전압 의 실효 값을 상기 필터링 데이터로 반환할 수 있다. 구체적으로, 상기 에너지 데이터는, 전류 센서를 통해서 측정되는 전류 값을 포함하며, 상기 필터링부는, 공급 전압의 주파수를 기준으로, 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로 그 전압의 관측을 위한 타겟 이벤트 주기를 결정하며, 상기 타겟 이벤트 주기마다 축적된 아날로그 전압의 변동 폭에 대해 평균 값을 반영하여 계산한 전류의 실효 값을 상기 필터링 데이터로 반환할 수 있다. 구체적으로, 상기 스마트 데이터 수집 장치는, MQTT(Message Queuing Telemetry Transport) 프로토콜을 통해서 상기 필터링 데이터를 전송하는 전송부를 더 포함하며, 상기 전송부는, 에지(Edge) 단에서 원격의 중앙 집중식산업용 사물 인터넷 시스템(Centralized IIoT system)과 데이터를 교환하는 에지 산업용 사물 인터넷 시스템 (Edge IIoT system)으로 상기 필터링 데이터를 전송할 수 있다. 상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치에서 수행되는 에너지 데이터 필터링 방법은, 상기 스마트 데이터 수집 장치와 연결된 가전 기기의 전력 소비에 관한 에너지 데이터를 수집하 는 수집단계; 및 상기 가전 기기의 연결 부하로 인한 상기 에너지 데이터의 변동 추이를 기초로, 상기 에너지 데이터 상의 노이즈를 필터링한 필터링 데이터를 반환하는 필터링단계를 포함하는 것을 특징으로 한다. 구체적으로, 상기 에너지 데이터는, 전압 센서를 통해서 측정되는 전압 값을 포함하며, 상기 필터링단계는, 공 급 전압의 주파수를 기준으로 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날 로그 전압의 최대 피크 전압과 최소 피크 전압을 관측하기 위한 타겟 이벤트 주기를 결정하며, 상기 타겟 이벤 트 주기마다 축적된 최대 피크 전압과 최소 피크 전압 간 차이의 변동 폭에 대해서 평균 값을 반영하여 계산한 전압의 실효 값을 상기 필터링 데이터로 반환할 수 있다. 구체적으로, 상기 에너지 데이터는, 전류 센서를 통해서 측정되는 전류 값을 포함하며, 상기 필터링단계는, 공 급 전압의 주파수를 기준으로, 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날 로그 전압의 관측을 위한 타겟 이벤트 주기를 결정하며, 상기 타겟 이벤트 주기마다 축적된 아날로그 전압의 변 동 폭에 대해 평균 값을 반영하여 계산한 전류의 실효 값을 상기 필터링 데이터로 반환할 수 있다. 구체적으로, 상기 방법은, MQTT(Message Queuing Telemetry Transport) 프로토콜을 통해서 상기 필터링 데이터 를 전송하는 전송단계를 더 포함하며, 상기 전송단계는, 에지(Edge) 단에서 원격의 중앙 집중식 산업용 사물 인 터넷 시스템(Centralized IIoT system)과 데이터를 교환하는 에지 산업용 사물 인터넷 시스템(Edge IIoT system)으로 상기 필터링 데이터를 전송할 수 있다."}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이에, 본 발명의 스마트 데이터 수집 장치 및 에너지 데이터 필터링 방법에서는 가전 기기의 연결 부하로 인해 발생되는 에너지 데이터의 변동 추이를 고려한 필터링 알고리즘을 통해서 에너지 데이터 상의 노이즈를 효율적 으로 제거하는 것이 가능해지므로, 산업용 사물 인터넷 환경에서 AI 모델의 학습에 이용되는 에너지 데이터의 신뢰도를 크게 제고시킬 수 있다."}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예에 대하여 설명한다. 본 발명의 일 실시예에서는, 산업용 사물 인터넷(IIoT: Industrial Internet of Things) 기술을 다룬다. 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 사물 인터넷(IoT: Internet of Things) 망으로 진화하고 있다. 이러한, 사물 인터넷 환경에서는, 기존의 IT(information technology)기술과 다양한 산업 간의 융합 및 복합을 통하여 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스마트 그리드, 헬스 케어, 스마트 가전, 및 첨단의료서비스 등의 분야에 응용될 수 있는 것이다. 최근에는, 이러한 사물 인터넷보다 하위 범주의 개념으로서, 인더스트리 4.0 기술의 기본 요소가 되는 산업용 사물 인터넷이 주목받고 있다. 산업용 사물 인터넷은, 사물 인터넷 기술(연결된 기계, 장치, 센서)을 산업용 애플리케이션에서 활용할 수 있으 며, 인공지능(AI)와 머신러닝 기능을 갖춘 현대식 ERP에서 실현되는 경우, 산업용 사물 인터넷의 센서 노드로부터 수집되는 데이터를 분석하고 활용하여 효율성, 생산성, 가시성 등을 개선할 수 있다. 한편, 이러한 산업용 사물 인터넷 기술의 응용 분야가 될 수 있는 스마트 홈에서 가전 기기에 대한 에너지 데이 터 측정은, 빌딩 에너지 관리 시스템(BEMS: Building Energy Management System)뿐만 아니라 스마트 에너지 관 리 시스템(SEMS: Smart Energy Management System) 구축을 위해 필수적이다. 그러나, 댁내 이처럼 가전 기기에 대해서 수집되는 에너지 데이터는 AI 모델의 학습을 위해 이용되는 반면, 측 정된 에너지 데이터의 품질을 보장할 수 없는 경우, 이러한 모델 학습에 있어서 큰 장애가 될 수 있다. 이에 본 발명의 일 실시예에서는 댁내 가전 기기에 대해서 수집되는 에너지 데이터의 신뢰도를 확보할 수 있는 필터링을 제안하고자 한다. 도 1은 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경을 예시적으로 보여주고 있다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경에서는, 클라우드 및 에지 컴퓨 팅(Edge computing) 기술을 채택한다. 이에 따라, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경은, 댁내 가전 기기에 대해서 측정된 에너지 데이터를 수집하는 스마트 데이터 수집 장치(SDAD: Smart Data Acquisition Device, 100), 및 에지(Edge) 단에 서 스마트 데이터 수집 장치가 수집한 에너지 데이터를 획득하는 에지 산업용 사물 인터넷 시스템(Edge IIoT system, 200), 및 에지 산업용 사물 인터넷 시스템과 필요한 데이터를 교환하는 중앙 집중식 산업용 사물 인터넷 시스템(Centralized IIoT system, 300)을 포함하는 형태로 구축될 수 있다. 스마트 데이터 수집 장치는 전압 센서(Voltage Sensor)를 통해 측정되는 전압 값과, 전류 센서(Current Sensor)를 통해 측정되는 전류 값을 에너지 데이터로서 수집하는 장치를 일컫는 것으로서, 아날로그 디지털 변 환기(ADC) 기반의 마이크로 프로세서 유닛(MCU)과, MQTT(Message Queuing Telemetry Transport) 프로토콜 통신 을 지원하는 사물 인터넷(IoT) 모듈을 포함할 수 있다. 이와 관련하여, 도 2에는 댁내 난방기(Home Heater)의 에너지 데이터 수집을 위해 스마트 데이터 수집 장치 가 적용된(연결된) 상태를 예시적으로 보여주고 있다. 에지 산업용 사물 인터넷 시스템은 AI 모델인 Edge AIoT의 실행을 기반으로 개별 주택의 스마트 데이터 수 집 장치로부터 에너지 데이터 획득 및 처리뿐만 아니라, 기능 추출과 에너지 데이터를 이용한 Edge AIoT 학습을 처리할 수 있다. 이를 위해, 에지 산업용 사물 인터넷 시스템은 로컬 서버(Local Server)로 구현될 수 있고, 로컬 라우터를 통해 개별 주택의 스마트 데이터 수집 장치와 무선 통신을 설정하며, 또한, 중앙 집중식 산업용 사물 인터 넷 시스템에 대해서는 글로벌 인터넷(Global Internet) 연결을 통해 MQTT 기반의 HTTP 데이터 전송을 지원 한다. 여기서, 에지 산업용 사물 인터넷 시스템에서 사용될 수 있는 AI 모델에는, 전술의 Edge AIoT뿐만 아니라 중앙 집중식 산업용 사물 인터넷 시스템에서 학습된 Cloud AIoT가 더 포함될 수 있는데, 이러한 Cloud AIoT를 사용하는 동안에는 Cloud AIoT의 학습을 위해 중앙 집중식 산업용 사물 인터넷 시스템으로 데이터 가 전송될 수 있다. 중앙 집중식 산업용 사물 인터넷 시스템은 AI 모델인 Cloud AIoT의 실행을 기반으로, 에지 산업용 사물 인 터넷 시스템과 필요한 데이터의 교환과 처리, 그리고 기능 추출 및 데이터를 이용한 Cloud AIoT 학습을 처 리할 수 있다. 여기서, Cloud AIoT의 경우 원격 접속을 기반으로 에지 산업용 사물 인터넷 시스템에서 사용될 수 있다. 이를 위해, 중앙 집중식 산업용 사물 인터넷 시스템은 클라우드 서버(Cloud Server)로 구현될 수 있고, 전 술한 바와 같이 글로벌 인터넷(Global Internet) 연결을 통한 에지 산업용 사물 인터넷 시스템과의 MQTT 기반의 HTTP 데이터 전송을 지원한다. 한편, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경에서, 스마트 데이터 수집 장치에서 수집된 에 너지 데이터는, 전술한 바와 같이 에지 산업용 사물 인터넷 시스템과 중앙 집중식 산업용 사물 인터넷 시 스템으로 전달되어, AI 모델의 학습에 각각 이용될 수 있음을 언급한 바 잇다. 그러나, 에너지 데이터 수집을 위해 스마트 데이터 수집 장치가 가전 기기가 연결되는 경우, 가전 기기의 연결 부하는 에너지 데이터에 노이즈를 발생시키게 되며, 이러한 노이즈는 곧 AI 모델의 학습에 이용되는 에너 지 데이터의 신뢰도를 크게 떨어뜨리는 결과를 초래한다. 이에 본 발명의 일 실시예에서는, 댁내 가전 기기에 대해서 수집되는 에너지 데이터의 신뢰도를 보장할 수 있는 새로운 방안을 제안하고자 하며, 이하에서는 이를 실현하기 위한 스마트 데이터 수집 장치의 구성을 보다 구체적으로 설명하기로 한다. 도 3은 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치의 구성을 보여주고 있다. 도 3에 도시된 바와 같이, 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치는 수집부, 및 필터 링부를 포함하는 구성을 가질 수 있다. 또한, 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치는 전술한 구성 이외에, 전송부를 더 포 함하는 구성을 가질 수 있다. 이상의 수집부, 필터링부, 및 전송부를 포함하는 스마트 데이터 수집 장치의 전체 구성 내 지는 적어도 일부는 하드웨어 모듈 형태 또는 소프트웨어 모듈 형태로 구현되거나, 하드웨어 모듈과 소프트웨어 모듈이 조합된 형태로 구현될 수 있다. 여기서, 소프트웨어 모듈이란, 예컨대, 스마트 데이터 수집 장치 내에서 연산을 제어하는 마이크로 프로세 서 유닛(MCU)에 의해 실행되는 명령어로 이해될 수 있으며, 이러한 명령어는 스마트 데이터 수집 장치 내 메모리에 탑재된 형태를 가질 수 있다. 한편, 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치는 전술한 구성 이외에, MQTT(Message Queuing Telemetry Transport) 프로토콜 기반의 통신 기능을 담당하는 통신 모듈인 통신부(도시 안됨)의 구성을 더 포함 할 수 있다. 이상 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치는 전술한 구성을 통해서 가전 기기에 대해서 수집되는 에너지 데이터의 노이즈 및 변동 상태를 필터링할 수 있는데, 이하에서는 이를 실현하기 위한 스마트 데이터 수집 장치 내 구성을 보다 구체적으로 설명하기로 한다. 수집부는 에너지 데이터를 수집하는 기능을 담당한다. 보다 구체적으로, 수집부는 스마트 데이터 수집 장치와 연결된 가전 기기의 전력 소비에 관한 에너지 데이터를 수집하게 된다. 이때, 수집부는 전압 센서(Voltage Sensor)를 통해 측정되는 전압 값과, 전류 센서(Current Sensor)를 통 해 측정되는 전류 값을 가전 기기의 에너지 데이터로서 수집할 수 있다. 여기서, 본 발명의 일 실시예에 따른 에너지 데이터에는 전술의 전압 값 및 전류 값 이외에 에너지 데이터가 수 집된 시점에 관한 시각 정보가 더 포함될 수 있다. 필터링부는 에너지 데이터를 필터링하는 기능을 담당한다. 보다 구체적으로, 필터링부는 가전 기기에 대해서 에너지 데이터가 수집되면, 수집된 에너지 데이터의 노 이즈를 필터링한 필터링 데이터를 반환하게 된다. 이때, 필터링부는 가전 기기의 연결 부하로 인해 발생되는 에너지 데이터의 변동 추이를 기초로, 에너지 데이터의 노이즈를 필터링할 수 있다. 이와 관련하여, 에너지 데이터는, 전압 센서를 통해서 측정되는 전압 값과 전류 센서를 통해서 측정되는 전류 값으로 구분될 수 있음을 앞서 언급한 바 있다. 이에, 이하의 설명에서는, 에너지 데이터로부터 구분되는 전압 값과 전류 값 각각에 대한 필터링 방식을 구체적 으로 설명하기로 한다. 먼저, 본 발명의 일 실시예에 따른 전압 값에 대한 필터링 방식을 설명하면 다음과 같다. 즉, 필터링부는 공급 전압의 주파수를 기준으로 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로그 전압의 최대 피크 전압( )과 최소 피크 전압( )을 관측하기 위한타겟 이벤트 주기( )를 결정한다. 또한, 필터링부는 타겟 이벤트 주기( )가 결정되면 각 타겟 이벤트 주기 ( )마다 축적된 최대 피크 전압( )과 최소 피크 전압( ) 간 차 이의 변동 폭에 대해서 평균 값을 반영하여 계산한 전압의 실효 값( )을 필터링 데이터로 반환할 수 있 다. 이러한, 전압 값에 대한 필터링 방식은 아래의 알고리즘 1(Algorithm 1)과 같이 정의될 수 있다."}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, 공급 전압 주파수는 60Hz 이므로, 타겟 이벤트 주기( )가 50인 조건에서, 최소 한번의 최대 피크 전압( )과 최소 피크 전압( )을 관측할 수 있다. 이와 관련하여, 타겟 이벤트 개수( )를 20으로 지정함으로써, 필터링 데이터 즉, 전압의 실효 값( )의 반환 간격을 1초로 유지시킬 수 있다.한편, 알고리즘 1(Algorithm 1)에서 상수 는 전압의 실효 값( )에 대한 보정 값으로서, 예컨대, 아래 [수식 1]을 통해서 계산될 수 있다. [수식 1]"}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, 는 측정된 전압 값이며, 는 가 1일 때 위 알고리즘 1(Algorithm 1)을 통해서 계산된 전압의 실효 값( )을 말한다. 참고로, 알고리즘 1(Algorithm 1)에서, 는 마이크로 프로세서 유닛의 아날로그 입력 포트이며, 는 아날로그 비트 값(예: 10비트 ADC -> 2^10 or 1024, 12비트 ADC -> 2^12 or 4096)이며, 는 마이크로 프로세서 유닛의 기준 전압을 일컫는다. 다음, 본 발명의 일 실시예에 따른 전류 값에 대한 필터링 방식을 설명하면 다음과 같다. 즉, 필터링부는 공급 전압의 주파수를 기준으로, 아날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로그 전압( )의 관측을 위한 타겟 이벤트 주기 ( )를 결정한다. 또한, 필터링부는 타겟 이벤트 주기( )가 결정되면 각 타겟 이벤트 주기 ( )마다 축적된 아날로그 전압( )의 변동 폭에 대해서 평균 값을 반영하여 계산한 전류의 실효 값( )을 필터링 데이터로 반환할 수 있다.이러한, 전류 값에 대한 필터링 방식은 아래의 알고리즘 2(Algorithm 2)와 같이 정의될 수 있다."}
{"patent_id": "10-2023-0037894", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, 공급 전압 주파수는 60Hz 이며, 60Hz의 신호는, 1/60초 또는 약 16.67msec에 하나의 전체 주기를 완료 한다. 따라서, 타겟 이벤트 주기( )가 250인 조건에서는, 아날로그 전압 ( )의 변동 폭을 15회 관측하는 것이 가능해진다. 참고로, 알고리즘 2(Algorithm 2)에서, 는 마이크로 프로세서 유닛의 아날로그 입력 포트이며, 는 아날로그 비트 값(예: 10비트 ADC -> 2^10 or 1024, 12비트 ADC -> 2^12 or 4096)이며, 는 마이크로 프로세서 유닛의 기준 전압이며, 은 전류 센서의 교정 계수(배율 인수)로서, 예컨대, 20A AC 전류 센서(예: SEN0211)에 대해서는 교정 계수 20이 선택될 수 있다. 전송부는 필터링 데이터를 전송하는 기능을 담당한다. 보다 구체적으로, 전송부는 에너지 데이터의 노이즈를 필터링한 필터링 데이터가 반환되면, 반환된 필터링 데이터를 에지 산업용 사물 인터넷 시스템으로 전송하게 된다. 이때, 전송부는 MQTT(Message Queuing Telemetry Transport) 프로토콜을 통해서 필터링 데이터를 에지 산 업용 사물 인터넷 시스템으로 전송할 수 있다. 한편, 본 발명의 일 실시예에서는 이처럼 에지 산업용 사물 인터넷 시스템으로 전송되는 필터링 데이터의 이력은, 예컨대, 도 4에서와 같은 JavaScript 형식의 메시지를 작성되어 MQTT(Message Queuing Telemetry Transport) 프로토콜을 통해서 열람 가능하도록 구현될 수 있음은 물론이다. 이상에서 살펴본 바와 같이, 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치의 구성에 따르면, 가전 기기의 연결 부하로 인해 발생되는 에너지 데이터의 변동 추이를 고려한 필터링 알고리즘을 통해서 에너지 데이 터 상의 노이즈를 효율적으로 제거하는 것이 가능해지므로, 산업용 사물 인터넷 환경에서 AI 모델의 학습에 이 용되는 에너지 데이터의 신뢰도를 크게 제고시킬 수 있다. 이하에서는, 도 5를 참조하여 본 발명의 일 실시예에 따른 에너지 데이터 필터링 방법을 설명하기로 한다. 본 발명의 일 실시예에 따른 에너지 데이터 필터링 방법의 동작 주체는 앞서 도 3을 참조하여 설명한 스마트 데 이터 수집 장치임을 전제로 설명을 이어 가기로 한다. 먼저, 스마트 데이터 수집 장치는, 스마트 데이터 수집 장치와 연결된 가전 기기의 전력 소비에 관한 에너지 데이터를 수집한다(S110). 이때, 스마트 데이터 수집 장치는 전압 센서(Voltage Sensor)를 통해 측정되는 전압 값과, 전류 센서 (Current Sensor)를 통해 측정되는 전류 값을 가전 기기의 에너지 데이터로서 수집할 수 있다. 여기서, 본 발명의 일 실시예에 따른 에너지 데이터에는 전술의 전압 값 및 전류 값 이외에 에너지 데이터가 수 집된 시점에 관한 시각 정보가 더 포함될 수 있다. 나아가, 스마트 데이터 수집 장치는 가전 기기에 대해서 에너지 데이터가 수집되면, 수집된 에너지 데이터 의 노이즈를 필터링한 필터링 데이터를 반환하게 된다. 이때, 스마트 데이터 수집 장치는 는 가전 기기의 연결 부하로 인해 발생되는 에너지 데이터의 변동 추이 를 기초로, 에너지 데이터의 노이즈를 필터링할 수 있다. 이와 관련하여, 에너지 데이터는, 전압 센서를 통해서 측정되는 전압 값과 전류 센서를 통해서 측정되는 전류 값으로 구분될 수 있음을 앞서 언급한 바 있다. 이에, 스마트 데이터 수집 장치는 에너지 데이터 내 전압 값에 대해서 공급 전압의 주파수를 기준으로 아 날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로그 전압의 최대 피크 전압 ( )과 최소 피크 전압( )을 관측하기 위한 타겟 이벤트 주기( )를 결정 한다(S120-S130). 또한, 스마트 데이터 수집 장치는 타겟 이벤트 주기( )가 결정되면 각 타겟 이벤트 주기( )마다 축적된 최대 피크 전압( )과 최소 피크 전압 ( ) 간 차이의 변동 폭에 대해서 평균 값을 반영하여 계산한 전압의 실효 값( )을 필터링 데 이터로 반환할 수 있다(S150-S160). 이러한, 전압 값에 대한 필터링 방식은 앞서 예시한 알고리즘 1(Algorithm 1)과 같이 정의될 수 있다. 그리고, 스마트 데이터 수집 장치는 에너지 데이터 내 전류 값에 대해 공급 전압의 주파수를 기준으로, 아 날로그 디지털 변환기(ADC) 기반의 마이크로 프로세서 유닛으로 입력되는 아날로그 전압 ( )의 관측을 위한 타겟 이벤트 주기( )를 결 정한다(S160). 이어서, 스마트 데이터 수집 장치는 타겟 이벤트 주기( )가 결정되면 각 타 겟 이벤트 주기( )마다 축적된 아날로그 전압 ( )의 변동 폭에 대해서 평균 값을 반영하여 계산한 전류의 실효 값 ( )을 필터링 데이터로 반환할 수 있다(S170-S180). 이러한, 전류 값에 대한 필터링 방식은 앞서 예시한 알고리즘 2(Algorithm 2)와 같이 정의될 수 있다. 이후, 스마트 데이터 수집 장치는 에너지 데이터의 노이즈를 필터링한 필터링 데이터가 반환되면, 반환된 필터링 데이터를 에지 산업용 사물 인터넷 시스템으로 전송한다(S190). 이때, 스마트 데이터 수집 장치는 MQTT(Message Queuing Telemetry Transport) 프로토콜을 통해서 필터링 데이터를 에지 산업용 사물 인터넷 시스템으로 전송할 수 있다.한편, 본 발명의 일 실시예에서는 이처럼 에지 산업용 사물 인터넷 시스템으로 전송되는 필터링 데이터의 이력은, 앞서 예시한, 도 4에서와 같은 JavaScript 형식의 메시지를 작성되어 MQTT(Message Queuing Telemetry Transport) 프로토콜을 통해서 열람 가능하도록 구현될 수 있음은 물론이다. 이상에서 살펴본 바와 같이, 본 발명의 일 실시예에 따른 에너지 데이터 필터링 방법에 따르면, 가전 기기의 연 결 부하로 인해 발생되는 에너지 데이터의 변동 추이를 고려한 필터링 알고리즘을 통해서 에너지 데이터 상의 노이즈를 효율적으로 제거하는 것이 가능해지므로, 산업용 사물 인터넷 환경에서 AI 모델의 학습에 이용되는 에 너지 데이터의 신뢰도를 크게 제고시킬 수 있다. 한편, 본 명세서에서 설명하는 기능적인 동작과 주제의 구현물들은 디지털 전자 회로로 구현되거나, 본 명세서 에서 개시하는 구조 및 그 구조적인 등가물들을 포함하는 컴퓨터 소프트웨어, 펌웨어 혹은 하드웨어로 구현되거 나, 이들 중 하나 이상의 결합으로 구현 가능하다. 본 명세서에서 설명하는 주제의 구현물들은 하나 이상의 컴 퓨터 프로그램 제품, 다시 말해 처리 시스템의 동작을 처리하기 위하여 혹은 이것에 의한 실행을 위하여 유형의 프로그램 저장매체 상에 인코딩된 컴퓨터 프로그램 명령에 관한 하나 이상의 모듈로서 구현될 수 있다. 컴퓨터로 판독 가능한 매체는 기계로 판독 가능한 저장 장치, 기계로 판독 가능한 저장 기판, 메모리 장치, 혹 은 이들 중 하나 이상의 조합일 수 있다. 본 명세서에서 \"시스템\"이나 \"장치\"라 함은 예컨대 프로그래머블 프로세서, 컴퓨터 혹은 다중 프로세서나 컴퓨 터를 포함하여 데이터를 처리하기 위한 모든 기구, 장치 및 기계를 포괄한다. 처리 시스템은, 하드웨어에 부가 하여, 예컨대 프로세서 펌웨어를 구성하는 코드, 프로토콜 스택, 데이터베이스 관리 시스템, 운영 체제 혹은 이 들 중 하나 이상의 조합 등 요청 시 컴퓨터 프로그램에 대한 실행 환경을 형성하는 코드를 포함할 수 있다. 컴퓨터 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션, 스크립트 혹은 코드로도 알려져 있음)은 컴 파일되거나 해석된 언어나 선험적 혹은 절차적 언어를 포함하는 프로그래밍 언어의 어떠한 형태로도 작성될 수 있으며, 독립형 프로그램이나 모듈, 컴포넌트, 서브루틴 혹은 컴퓨터 환경에서 사용하기에 적합한 다른 유닛을 포함하여 어떠한 형태로도 전개될 수 있다. 컴퓨터 프로그램은 파일 시스템의 파일에 반드시 대응하는 것은 아 니다. 프로그램은 요청된 프로그램에 제공되는 단일 파일 내에, 혹은 다중의 상호 작용하는 파일(예컨대, 하나 이상의 모듈, 하위 프로그램 혹은 코드의 일부를 저장하는 파일) 내에, 혹은 다른 프로그램이나 데이터를 보유 하는 파일의 일부(예컨대, 마크업 언어 문서 내에 저장되는 하나 이상의 스크립트) 내에 저장될 수 있다. 컴퓨 터 프로그램은 하나의 사이트에 위치하거나 복수의 사이트에 걸쳐서 분산되어 통신 네트워크에 의해 상호 접속 된 다중 컴퓨터나 하나의 컴퓨터 상에서 실행되도록 전개될 수 있다. 한편, 컴퓨터 프로그램 명령어와 데이터를 저장하기에 적합한 컴퓨터로 판독 가능한 매체는, 예컨대 EPROM, EEPROM 및 플래시메모리 장치와 같은 반도체 메모리 장치, 예컨대 내부 하드디스크나 외장형 디스크와 같은 자 기 디스크, 자기광학 디스크 및 CD-ROM과 DVD-ROM 디스크를 포함하여 모든 형태의 비휘발성 메모리, 매체 및 메 모리 장치를 포함할 수 있다. 프로세서와 메모리는 특수 목적의 논리 회로에 의해 보충되거나, 그것에 통합될 수 있다. 본 명세서에서 설명한 주제의 구현물은 예컨대 데이터 서버와 같은 백엔드 컴포넌트를 포함하거나, 예컨대 애플 리케이션 서버와 같은 미들웨어 컴포넌트를 포함하거나, 예컨대 사용자가 본 명세서에서 설명한 주제의 구현물 과 상호 작용할 수 있는 웹 브라우저나 그래픽 유저 인터페이스를 갖는 클라이언트 컴퓨터와 같은 프론트엔드 컴포넌트 혹은 그러한 백엔드, 미들웨어 혹은 프론트엔드 컴포넌트의 하나 이상의 모든 조합을 포함하는 연산 시스템에서 구현될 수도 있다. 시스템의 컴포넌트는 예컨대 통신 네트워크와 같은 디지털 데이터 통신의 어떠한 형태나 매체에 의해서도 상호 접속 가능하다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 마찬가지로, 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특 정한 특징들은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양 한 특징들 역시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부 터의 하나 이상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 또한, 본 명세서에서는 특정한 순서로 도면에서 동작들을 묘사하고 있지만, 이는 바람직한 결과를 얻기 위하여 도시된 그 특정한 순서나 순차적인 순서대로 그러한 동작들을 수행하여야 한다거나 모든 도시된 동작들이 수행 되어야 하는 것으로 이해되어서는 안 된다. 특정한 경우, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 또한, 상술한 실시형태의 다양한 시스템 컴포넌트의 분리는 그러한 분리를 모든 실시형태에서 요구하는 것으로 이해되 어서는 안되며, 설명한 프로그램 컴포넌트와 시스템들은 일반적으로 단일의 소프트웨어 제품으로 함께 통합되거 나 다중 소프트웨어 제품에 패키징될 수 있다는 점을 이해하여야 한다 이와 같이, 본 명세서는 그 제시된 구체적인 용어에 본 발명을 제한하려는 의도가 아니다. 따라서, 상술한 예를 참조하여 본 발명을 상세하게 설명하였지만, 당업자라면 본 발명의 범위를 벗어나지 않으면서도 본 예들에 대한 개조, 변경 및 변형을 가할 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하 여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 등가개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다. 산업상 이용가능성 본 발명에 따른 스마트 데이터 수집 장치 및 에너지 데이터 필터링 방법에 따르면, 댁내 가전 기기에 대해서 수 집되는 에너지 데이터의 신뢰성을 보장할 수 있는 필터링 방안을 제안하고 있다는 점에서, 기존 기술의 한계를 뛰어 넘음에 따라 관련 기술에 대한 이용만이 아닌 적용되는 장치의 시판 또는 영업의 가능성이 충분할 뿐만 아 니라 현실적으로 명백하게 실시할 수 있는 정도이므로 산업상 이용가능성이 있는 발명이다."}
{"patent_id": "10-2023-0037894", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경을 설명하기 위한 예시도. 도 2는 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치의 연결 상태를 설명하기 위한 예시도. 도 3은 본 발명의 일 실시예에 따른 스마트 데이터 수집 장치를 설명하기 위한 구성도. 도 4는 본 발명의 일 실시예에 따른 필터링 데이터의 이력에 관한 메시지 형식을 설명하기 위한 예시도. 도 5는 본 발명의 일 실시예에 따른 에너지 데이터 필터링 방법을 설명하기 위한 순서도."}
