{"patent_id": "10-2020-0062946", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0146000", "출원번호": "10-2020-0062946", "발명의 명칭": "인공지능 기반의 신용등급 변동 예측 처리 장치 및 그 동작 방법", "출원인": "주식회사 다날", "발명자": "박지만"}}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "N(N은 3이상의 자연수)개의 신용등급들 각각에 대한 미리 정해진(predetermined) 서로 다른 N차원의 원-핫(One-Hot) 벡터가 저장되어 있는 신용등급 벡터 저장부;M(M은 2이상의 자연수)명의 고객들 각각으로부터 수집된 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보와 상기 M명의 고객들 각각의 입력 세트 정보에 대한 정답 정보로 상기 M명의 고객들 각각에 대해서 미리 산출된 변동 신용등급 - 상기 변동 신용등급은 상기 N개의 신용등급들 중에 속하는 어느 하나의 신용등급임 - 이 하나씩 매칭되어 있는 M개의 트레이닝세트들이 저장되어 있는 트레이닝 세트 저장부;상기 M명의 고객들 각각에 대해, 각 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 입력 벡터를 구성함으로써, 상기 M명의 고객들 각각에대응되는 4차원의 입력 벡터를 생성하는 입력 벡터 생성부;상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터가 생성되면, 상기 신용등급 벡터 저장부를 참조하여 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 확인하는 원-핫 벡터 확인부;상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 둘 이상의 가중치 행렬들로 구성된 심층 신경망 - 상기 심층 신경망을 구성하는 둘 이상의 가중치 행렬들은 상기 심층 신경망의 출력으로 산출되는 벡터의 차원이 N차원이 되도록 구성된 행렬들임 - 에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 생성하는 출력 벡터 생성부;상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터가 생성되면, 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 미리 정해진 활성화 함수(Activation Function) - 상기 활성화 함수는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들을 0이상 1이하의 값으로 변환하는 함수임 - 에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 생성하는 연산 벡터 생성부; 및상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터와 상기 M명의 고객들 각각에 대응되는 변동 신용등급에대한 N차원의 원-핫 벡터를 서로 비교하여 상기 심층 신경망에 대한 기계학습을 수행함으로써, 고객의 신용등급변동을 예측하기 위한 예측모델을 생성하는 예측모델 생성부를 포함하는 인공지능 기반의 신용등급 변동 예측 처리 장치."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 활성화 함수는 하기의 수학식 1과 같은 소프트맥스(Softmax) 함수인 인공지능 기반의 신용등급 변동 예측처리 장치. [수학식 1]여기서, 는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들 중 i번째 성분에대한 연산 값으로, 는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들 중 i번째 성공개특허 10-2021-0146000-3-분의 값, 는 자연상수를 의미함."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 예측모델 생성부는상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터가 상기 M명의 고객들 각각에 대응되는 변동 신용등급에대한 N차원의 원-핫 벡터에 최대로 근접하도록 상기 심층 신경망에 대한 기계학습을 수행하는 기계학습 수행부를 포함하는 인공지능 기반의 신용등급 변동 예측 처리 장치."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 기계학습 수행부는상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 구성하는 성분들과 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 구성하는 성분들을 기초로 하기의 수학식 2에 따른 손실 함수(Loss Function)를 기반으로 한 손실 값을 연산함으로써, 상기 M명의 고객들 각각에 대한 손실 값을 산출하고,상기 M명의 고객들 각각에 대한 손실 값의 평균이 최소가 되도록 상기 심층 신경망에 대한 기계학습을 수행하는인공지능 기반의 신용등급 변동 예측 처리 장치.[수학식 2]여기서, 은 상기 손실 값으로, 는 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 구성하는 성분들 중 i번째 성분의 값, 는 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 구성하는 성분들 중 i번째 성분의 값을 의미함."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 예측모델의 생성이 완료된 이후, 제1 고객의 고객 단말로부터 상기 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보가 수신되면서, 상기 제1 고객의 신용등급에 대한 변동 예측 명령이 수신되면, 상기 제1 고객의 고객 단말에 대한 인증을완료한 후 상기 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 예측용 입력 벡터를 생성하는 예측용 입력 벡터 생성부;상기 4차원의 예측용 입력 벡터가 생성되면, 상기 4차원의 예측용 입력 벡터를 기계학습이 완료된 상기 심층 신경망에 입력으로 인가하여 상기 4차원의 예측용 입력 벡터에 대응되는 N차원의 예측용 출력 벡터를 생성하는 예측용 출력 벡터 생성부;상기 N차원의 예측용 출력 벡터가 생성되면, 상기 N차원의 예측용 출력 벡터를 상기 활성화 함수에 입력으로 인가하여 상기 N차원의 예측용 출력 벡터에 대응되는 N차원의 예측용 연산 벡터를 생성하는 예측용 연산 벡터 생성부;상기 N차원의 예측용 연산 벡터가 생성되면, 상기 N차원의 예측용 연산 벡터와 상기 N개의 신용등급들 각각에대한 N차원의 원-핫 벡터 간의 유사도를 연산하는 유사도 연산부; 및상기 N개의 신용등급들 각각에 대한 N차원의 원-핫 벡터 중 상기 N차원의 예측용 연산 벡터와의 유사도가 최대공개특허 10-2021-0146000-4-로 연산된 N차원의 제1 원-핫 벡터를 확인한 후 상기 신용등급 벡터 저장부로부터 상기 N차원의 제1 원-핫 벡터에 대응하는 제1 신용등급을 확인하고, 상기 확인된 제1 신용등급을 상기 제1 고객의 변동 신용등급으로 결정한후 상기 제1 고객의 변동 신용등급에 대한 정보를 상기 제1 고객의 고객 단말로 전송하는 변동 신용등급 예측부를 더 포함하는 인공지능 기반의 신용등급 변동 예측 처리 장치."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 예측용 입력 벡터 생성부는상기 제1 고객의 고객 단말과 서로 동일한 일회용 인증 번호를 생성하도록 사전 공유하고 있는 OTP(One TimePassword) 생성 함수가 저장되어 있는 OTP 저장부;상기 제1 고객의 고객 단말과 사전 공유하고 있는 유클리드 노름(Euclidean Norm)에 대한 정보가 저장되어 있는유클리드 노름 저장부;상기 제1 고객의 고객 단말로부터 상기 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보가 수신되면서, 상기 제1 고객의 신용등급에대한 변동 예측 명령이 수신되면, 상기 OTP 생성 함수를 기초로 제1 일회용 인증 번호를 생성하고, 상기 제1 일회용 인증 번호에서 미리 정해진 제1 자릿수에 해당되는 숫자를 확인한 후 상기 숫자의 크기에 대응하는 해밍무게(Hamming Weight)를 가지면서, 미리 정해진 길이를 갖는 랜덤 벡터를 랜덤하게 생성하고, 상기 랜덤 벡터를상기 제1 고객의 고객 단말로 전송하면서, 상기 제1 고객의 고객 단말로 상기 랜덤 벡터에 대응되는 피드백 벡터의 전송을 요청하는 요청부;상기 제1 고객의 고객 단말로부터 상기 랜덤 벡터에 대응되는 피드백 벡터로 제1 피드백 벡터 - 상기 제1 피드백 벡터는 상기 랜덤 벡터와 합산되었을 때의 유클리드 노름이 상기 제1 고객의 고객 단말에 기 저장되어 있는상기 유클리드 노름과 동일해지도록 생성된 벡터임 - 가 수신되면, 상기 제1 피드백 벡터와 상기 랜덤 벡터를합산한 합산 벡터에 대한 제1 유클리드 노름을 연산하고, 상기 제1 유클리드 노름이 상기 유클리드 노름과 동일한지 확인하는 유클리드 노름 확인부; 및상기 제1 유클리드 노름이 상기 유클리드 노름과 동일한 것으로 확인되면, 상기 제1 고객의 고객 단말에 대한인증을 완료하는 인증 완료부를 포함하는 인공지능 기반의 신용등급 변동 예측 처리 장치."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제1 고객의 고객 단말은메모리 상에 상기 유클리드 노름, 상기 OTP 생성 함수와 동일한 검증용 OTP 생성 함수를 저장하고 있고, 상기신용등급 변동 예측 처리 장치로부터 상기 랜덤 벡터가 수신되면, 상기 메모리 상에 저장되어 있는 상기 검증용OTP 생성 함수를 기초로 검증용 일회용 인증 번호를 생성한 후 상기 검증용 일회용 인증 번호에서 상기 제1 자릿수에 해당되는 검증용 숫자를 확인하여 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자의 크기에 대응하는해밍 무게와 일치하는지 여부를 확인하며, 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자의 크기에 대응하는해밍 무게와 일치하는 것으로 확인되는 경우, 상기 랜덤 벡터와 합산되었을 때의 유클리드 노름이 상기 메모리상에 저장되어 있는 상기 유클리드 노름과 동일해지도록 하는 상기 제1 피드백 벡터를 생성하여 상기 신용등급변동 예측 처리 장치로 전송하는 인공지능 기반의 신용등급 변동 예측 처리 장치."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "N(N은 3이상의 자연수)개의 신용등급들 각각에 대한 미리 정해진(predetermined) 서로 다른 N차원의 원-핫(One-Hot) 벡터가 저장되어 있는 신용등급 벡터 저장부를 유지하는 단계;M(M은 2이상의 자연수)명의 고객들 각각으로부터 수집된 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보와 상기 M명의 고객들 각각의 입력 세트 정보에 대한 정답 정보로 상기 M명의 고객들 각각에 대해서 미리 산출된 변동 신용등급 - 상기 변동 신용등공개특허 10-2021-0146000-5-급은 상기 N개의 신용등급들 중에 속하는 어느 하나의 신용등급임 - 이 하나씩 매칭되어 있는 M개의 트레이닝세트들이 저장되어 있는 트레이닝 세트 저장부를 유지하는 단계;상기 M명의 고객들 각각에 대해, 각 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 입력 벡터를 구성함으로써, 상기 M명의 고객들 각각에대응되는 4차원의 입력 벡터를 생성하는 단계;상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터가 생성되면, 상기 신용등급 벡터 저장부를 참조하여 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 확인하는 단계;상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 둘 이상의 가중치 행렬들로 구성된 심층 신경망 - 상기 심층 신경망을 구성하는 둘 이상의 가중치 행렬들은 상기 심층 신경망의 출력으로 산출되는 벡터의 차원이 N차원이 되도록 구성된 행렬들임 - 에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 생성하는 단계;상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터가 생성되면, 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 미리 정해진 활성화 함수(Activation Function) - 상기 활성화 함수는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들을 0이상 1이하의 값으로 변환하는 함수임 - 에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 생성하는 단계; 및상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터와 상기 M명의 고객들 각각에 대응되는 변동 신용등급에대한 N차원의 원-핫 벡터를 서로 비교하여 상기 심층 신경망에 대한 기계학습을 수행함으로써, 고객의 신용등급변동을 예측하기 위한 예측모델을 생성하는 단계를 포함하는 인공지능 기반의 신용등급 변동 예측 처리 장치의 동작 방법."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 활성화 함수는 하기의 수학식 1과 같은 소프트맥스(Softmax) 함수인 인공지능 기반의 신용등급 변동 예측처리 장치의 동작 방법. [수학식 1]여기서, 는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들 중 i번째 성분에대한 연산 값으로, 는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들 중 i번째 성분의 값, 는 자연상수를 의미함."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 예측모델을 생성하는 단계는상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터가 상기 M명의 고객들 각각에 대응되는 변동 신용등급에대한 N차원의 원-핫 벡터에 최대로 근접하도록 상기 심층 신경망에 대한 기계학습을 수행하는 단계를 포함하는 인공지능 기반의 신용등급 변동 예측 처리 장치의 동작 방법."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2021-0146000-6-제10항에 있어서,상기 기계학습을 수행하는 단계는상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 구성하는 성분들과 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 구성하는 성분들을 기초로 하기의 수학식 2에 따른 손실 함수(Loss Function)를 기반으로 한 손실 값을 연산함으로써, 상기 M명의 고객들 각각에 대한 손실 값을 산출하고,상기 M명의 고객들 각각에 대한 손실 값의 평균이 최소가 되도록 상기 심층 신경망에 대한 기계학습을 수행하는인공지능 기반의 신용등급 변동 예측 처리 장치의 동작 방법.[수학식 2]여기서, 은 상기 손실 값으로, 는 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 구성하는 성분들 중 i번째 성분의 값, 는 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 구성하는 성분들 중 i번째 성분의 값을 의미함."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 예측모델의 생성이 완료된 이후, 제1 고객의 고객 단말로부터 상기 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보가 수신되면서, 상기 제1 고객의 신용등급에 대한 변동 예측 명령이 수신되면, 상기 제1 고객의 고객 단말에 대한 인증을완료한 후 상기 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 예측용 입력 벡터를 생성하는 단계;상기 4차원의 예측용 입력 벡터가 생성되면, 상기 4차원의 예측용 입력 벡터를 기계학습이 완료된 상기 심층 신경망에 입력으로 인가하여 상기 4차원의 예측용 입력 벡터에 대응되는 N차원의 예측용 출력 벡터를 생성하는 단계;상기 N차원의 예측용 출력 벡터가 생성되면, 상기 N차원의 예측용 출력 벡터를 상기 활성화 함수에 입력으로 인가하여 상기 N차원의 예측용 출력 벡터에 대응되는 N차원의 예측용 연산 벡터를 생성하는 단계;상기 N차원의 예측용 연산 벡터가 생성되면, 상기 N차원의 예측용 연산 벡터와 상기 N개의 신용등급들 각각에대한 N차원의 원-핫 벡터 간의 유사도를 연산하는 단계; 및상기 N개의 신용등급들 각각에 대한 N차원의 원-핫 벡터 중 상기 N차원의 예측용 연산 벡터와의 유사도가 최대로 연산된 N차원의 제1 원-핫 벡터를 확인한 후 상기 신용등급 벡터 저장부로부터 상기 N차원의 제1 원-핫 벡터에 대응하는 제1 신용등급을 확인하고, 상기 확인된 제1 신용등급을 상기 제1 고객의 변동 신용등급으로 결정한후 상기 제1 고객의 변동 신용등급에 대한 정보를 상기 제1 고객의 고객 단말로 전송하는 단계를 더 포함하는 인공지능 기반의 신용등급 변동 예측 처리 장치의 동작 방법."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 예측용 입력 벡터를 생성하는 단계는상기 제1 고객의 고객 단말과 서로 동일한 일회용 인증 번호를 생성하도록 사전 공유하고 있는 OTP(One TimePassword) 생성 함수가 저장되어 있는 OTP 저장부를 유지하는 단계;상기 제1 고객의 고객 단말과 사전 공유하고 있는 유클리드 노름(Euclidean Norm)에 대한 정보가 저장되어 있는공개특허 10-2021-0146000-7-유클리드 노름 저장부를 유지하는 단계;상기 제1 고객의 고객 단말로부터 상기 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보가 수신되면서, 상기 제1 고객의 신용등급에대한 변동 예측 명령이 수신되면, 상기 OTP 생성 함수를 기초로 제1 일회용 인증 번호를 생성하고, 상기 제1 일회용 인증 번호에서 미리 정해진 제1 자릿수에 해당되는 숫자를 확인한 후 상기 숫자의 크기에 대응하는 해밍무게(Hamming Weight)를 가지면서, 미리 정해진 길이를 갖는 랜덤 벡터를 랜덤하게 생성하고, 상기 랜덤 벡터를상기 제1 고객의 고객 단말로 전송하면서, 상기 제1 고객의 고객 단말로 상기 랜덤 벡터에 대응되는 피드백 벡터의 전송을 요청하는 단계;상기 제1 고객의 고객 단말로부터 상기 랜덤 벡터에 대응되는 피드백 벡터로 제1 피드백 벡터 - 상기 제1 피드백 벡터는 상기 랜덤 벡터와 합산되었을 때의 유클리드 노름이 상기 제1 고객의 고객 단말에 기 저장되어 있는상기 유클리드 노름과 동일해지도록 생성된 벡터임 - 가 수신되면, 상기 제1 피드백 벡터와 상기 랜덤 벡터를합산한 합산 벡터에 대한 제1 유클리드 노름을 연산하고, 상기 제1 유클리드 노름이 상기 유클리드 노름과 동일한지 확인하는 단계; 및상기 제1 유클리드 노름이 상기 유클리드 노름과 동일한 것으로 확인되면, 상기 제1 고객의 고객 단말에 대한인증을 완료하는 단계를 포함하는 인공지능 기반의 신용등급 변동 예측 처리 장치의 동작 방법."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제1 고객의 고객 단말은메모리 상에 상기 유클리드 노름, 상기 OTP 생성 함수와 동일한 검증용 OTP 생성 함수를 저장하고 있고, 상기신용등급 변동 예측 처리 장치로부터 상기 랜덤 벡터가 수신되면, 상기 메모리 상에 저장되어 있는 상기 검증용OTP 생성 함수를 기초로 검증용 일회용 인증 번호를 생성한 후 상기 검증용 일회용 인증 번호에서 상기 제1 자릿수에 해당되는 검증용 숫자를 확인하여 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자의 크기에 대응하는해밍 무게와 일치하는지 여부를 확인하며, 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자의 크기에 대응하는해밍 무게와 일치하는 것으로 확인되는 경우, 상기 랜덤 벡터와 합산되었을 때의 유클리드 노름이 상기 메모리상에 저장되어 있는 상기 유클리드 노름과 동일해지도록 하는 상기 제1 피드백 벡터를 생성하여 상기 신용등급변동 예측 처리 장치로 전송하는 인공지능 기반의 신용등급 변동 예측 처리 장치의 동작 방법."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제8항 내지 제14항 중 어느 한 항의 방법을 컴퓨터와의 결합을 통해 실행시키기 위한 컴퓨터 프로그램을 기록한컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2020-0062946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제8항 내지 제14항 중 어느 한 항의 방법을 컴퓨터와의 결합을 통해 실행시키기 위한 저장매체에 저장된 컴퓨터프로그램."}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기반의 신용등급 변동 예측 처리 장치 및 그 동작 방법이 개시된다. 본 발명은 인공지능을 기반으로 고객의 신용등급이 어떻게 변동될 것인지를 예측할 수 있는 예측모델을 생성하고, 이를 기초로 고객의 변동 신용 등급을 예측할 수 있는 신용등급 변동 예측 처리 장치 및 그 동작 방법을 제시함으로써, 고객에게 보다 정확한 신용등급의 변동 예측 결과를 제공하고, 이를 기초로 고객이 신용등급 관리를 위한 적절한 재무설계를 진행할 수 있도록 지원할 수 있다."}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반의 신용등급 변동 예측 처리 장치 및 그 동작 방법에 대한 것이다."}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "신용등급이란, 개인신용평가회사에서 금융거래 정보를 바탕으로 각 개인의 신용도를 평가한 등급을 의미한다. 여기서, 신용등급은 상환이력, 신용형태정보, 현재부채수준 및 신용거래기간을 기초로 산출된다. 보통, 신용등 급이 낮게 산출된 사용자는 신용등급이 높게 산출된 사용자에 비해 높은 이자를 물어야 하며, 대출을 받더라도 원하는 금액을 다 받지 못하게 되는 경우가 많다. 그러므로, 사용자는 지속적인 신용등급 관리를 통해 높은 신용등급을 유지할 필요가 있다. 기존에는 사용자의 현재 대출금액이나 현재의 신용카드 발급건수, 현재의 채무에 대한 연체금액을 고려하여 현 재의 신용등급을 산출해 주는 서비스만 존재하고 있을 뿐, 사용자의 신용등급이 미래에 어떻게 변동될 것인지를 예측해 주는 서비스가 존재하지 않았다. 즉, 사용자가 앞으로 대출을 얼마나 더 받을지, 신용카드는 얼마나 더 만들지 등에 따라 미래에 신용등급이 어떻게 변동될 것인지를 예측해 주는 서비스가 존재하지 않아, 사용자는 자신의 신용등급을 관리하기가 쉽지 않은 실정이다. 만약, 사용자의 신규 대출예정금액, 신용카드 신규 발급예정건수, 채무에 대한 신규 연체예정금액을 고려하여 사용자의 신용등급이 어떻게 변동될 것인지를 예측할 수 있는 서비스가 제공된다면, 사용자는 자신의 신용등급 의 예측 결과를 참고하여 자신의 신용등급을 높은 상태로 유지하기 위해 적절한 형태의 재무설계를 할 수 있을 것이다. 한편, 최근에는 일부의 샘플 데이터를 기초로 소정의 결과를 예측하기 위한 예측모델을 만들 수 있는 기계학습 기반의 인공지능 기술이 등장하고 있다. 이와 관련해서, 고객의 신용등급의 변동을 예측하는데에 있어서도, 기 계학습 기반의 인공지능 기술을 이용할 수 있을 것이다. 따라서, 고객의 신용등급 변동을 예측하기 위한 인공지능 기반의 예측모델을 만들고, 이를 기초로 고객의 신용 등급이 어떻게 변동될지를 예측할 수 있는 기술에 대한 연구가 필요하다."}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인공지능을 기반으로 고객의 신용등급이 어떻게 변동될 것인지를 예측할 수 있는 예측모델을 생성하 고, 이를 기초로 고객의 변동 신용등급을 예측할 수 있는 신용등급 변동 예측 처리 장치 및 그 동작 방법을 제 시함으로써, 고객에게 보다 정확한 신용등급의 변동 예측 결과를 제공하고, 이를 기초로 고객이 신용등급 관리 를 위한 적절한 재무설계를 진행할 수 있도록 지원하고자 한다."}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예에 따른 인공지능 기반의 신용등급 변동 예측 처리 장치는 N(N은 3이상의 자연수)개의 신용 등급들 각각에 대한 미리 정해진(predetermined) 서로 다른 N차원의 원-핫(One-Hot) 벡터가 저장되어 있는 신용 등급 벡터 저장부, M(M은 2이상의 자연수)명의 고객들 각각으로부터 수집된 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보와 상기 M명의 고객 들 각각의 입력 세트 정보에 대한 정답 정보로 상기 M명의 고객들 각각에 대해서 미리 산출된 변동 신용등급 - 상기 변동 신용등급은 상기 N개의 신용등급들 중에 속하는 어느 하나의 신용등급임 - 이 하나씩 매칭되어 있는 M개의 트레이닝 세트들이 저장되어 있는 트레이닝 세트 저장부, 상기 M명의 고객들 각각에 대해, 각 고객의 현 재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 입력 벡터를 구성함으로써, 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 생성하는 입 력 벡터 생성부, 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터가 생성되면, 상기 신용등급 벡터 저장 부를 참조하여 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 확인하는 원-핫 벡터 확인부, 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 둘 이상의 가중치 행렬들로 구성된 심층 신경망 - 상기 심층 신경망을 구성하는 둘 이상의 가중치 행렬들은 상기 심층 신경망의 출력으로 산출되는 벡터 의 차원이 N차원이 되도록 구성된 행렬들임 - 에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원 의 출력 벡터를 생성하는 출력 벡터 생성부, 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터가 생성되면, 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 미리 정해진 활성화 함수(Activation Function) - 상기 활성화 함수는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들을 0 이상 1이하의 값으로 변환하는 함수임 - 에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원의 연 산 벡터를 생성하는 연산 벡터 생성부 및 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터와 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 서로 비교하여 상기 심층 신경망에 대한 기계학습을 수행함으로써, 고객의 신용등급 변동을 예측하기 위한 예측모델을 생성하는 예측모델 생성부를 포함 한다. 또한, 본 발명의 일실시예에 따른 인공지능 기반의 신용등급 변동 예측 처리 장치의 동작 방법은 N(N은 3이상의 자연수)개의 신용등급들 각각에 대한 미리 정해진 서로 다른 N차원의 원-핫 벡터가 저장되어 있는 신용등급 벡터 저장부를 유지하는 단계, M(M은 2이상의 자연수)명의 고객들 각각으로부터 수집된 현재 신용등급, 신규 대출 예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보와 상기 M 명의 고객들 각각의 입력 세트 정보에 대한 정답 정보로 상기 M명의 고객들 각각에 대해서 미리 산출된 변동 신 용등급 - 상기 변동 신용등급은 상기 N개의 신용등급들 중에 속하는 어느 하나의 신용등급임 - 이 하나씩 매칭 되어 있는 M개의 트레이닝 세트들이 저장되어 있는 트레이닝 세트 저장부를 유지하는 단계, 상기 M명의 고객들 각각에 대해, 각 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 입력 벡터를 구성함으로써, 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 생성하는 단계, 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터가 생성되면, 상기 신용등급 벡터 저장부를 참조하여 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 확인 하는 단계, 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 둘 이상의 가중치 행렬들로 구성된 심층 신경망 - 상기 심층 신경망을 구성하는 둘 이상의 가중치 행렬들은 상기 심층 신경망의 출력으로 산출되는 벡터 의 차원이 N차원이 되도록 구성된 행렬들임 - 에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원 의 출력 벡터를 생성하는 단계, 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터가 생성되면, 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 미리 정해진 활성화 함수 - 상기 활성화 함수는 상기 M명의 고객 들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들을 0이상 1이하의 값으로 변환하는 함수임 - 에 입력 으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 생성하는 단계 및 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터와 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 서로 비교하여 상기 심층 신경망에 대한 기계학습을 수행함으로써, 고객의 신용등급 변동을 예측하기 위 한 예측모델을 생성하는 단계를 포함한다."}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 인공지능을 기반으로 고객의 신용등급이 어떻게 변동될 것인지를 예측할 수 있는 예측모델을 생성하 고, 이를 기초로 고객의 변동 신용등급을 예측할 수 있는 신용등급 변동 예측 처리 장치 및 그 동작 방법을 제 시함으로써, 고객에게 보다 정확한 신용등급의 변동 예측 결과를 제공하고, 이를 기초로 고객이 신용등급 관리 를 위한 적절한 재무설계를 진행할 수 있도록 지원할 수 있다."}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명에 따른 실시예들을 첨부된 도면을 참조하여 상세하게 설명하기로 한다. 이러한 설명은 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구 성요소에 대해 사용하였으며, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 본 명세서 상"}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "에서 사용되는 모든 용어들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 사람에 의해 일반적으로 이해 되는 것과 동일한 의미를 가지고 있다. 본 문서에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구 성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 또한, 본 발명의 다양한 실시예들에 있어서, 각 구성요소들, 기능 블록들 또는 수단들은 하나 또는 그 이상의 하부 구성요소로 구성될 수 있고, 각 구성요소들이 수행하는 전기, 전자, 기계적 기능들은 전자회로, 집적회로, ASIC(Application Specific Integrated Circuit) 등 공지된 다양한 소자들 또는 기계적 요소들로 구현될 수 있으며, 각각 별개로 구현되거나 2 이상이 하나로 통합되어 구현될 수도 있다. 한편, 첨부된 블록도의 블록들이나 흐름도의 단계들은 범용 컴퓨터, 특수용 컴퓨터, 휴대용 노트북 컴퓨터, 네 트워크 컴퓨터 등 데이터 프로세싱이 가능한 장비의 프로세서나 메모리에 탑재되어 지정된 기능들을 수행하는 컴퓨터 프로그램 명령들(instructions)을 의미하는 것으로 해석될 수 있다. 이들 컴퓨터 프로그램 명령들은 컴퓨터 장치에 구비된 메모리 또는 컴퓨터에서 판독 가능한 메모리에 저장될 수 있기 때문에, 블록도의 블록들 또 는 흐름도의 단계들에서 설명된 기능들은 이를 수행하는 명령 수단을 내포하는 제조물로 생산될 수도 있다. 아 울러, 각 블록 또는 각 단계는 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 명령들을 포 함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 가능한 실시예들에서는 블록들 또는 단계들에서 언급된 기능들이 정해진 순서와 달리 실행되는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 또는 단계들은 실질적으로 동시에 수행되거나, 역순으로 수행될 수 있으며, 경우 에 따라 일부 블록들 또는 단계들이 생략된 채로 수행될 수도 있다. 도 1은 본 발명의 일실시예에 따른 인공지능 기반의 신용등급 변동 예측 처리 장치의 구조를 도시한 도면이다. 도 1을 참조하면, 본 발명에 따른 신용등급 변동 예측 처리 장치는 신용등급 벡터 저장부, 트레이닝 세트 저장부, 입력 벡터 생성부, 원-핫 벡터 확인부, 출력 벡터 생성부, 연산 벡터 생성부 및 예측모델 생성부를 포함한다. 신용등급 벡터 저장부에는 N(N은 3이상의 자연수)개의 신용등급들 각각에 대한 미리 정해진 (predetermined) 서로 다른 N차원의 원-핫(One-Hot) 벡터가 저장되어 있다. 예컨대, 'N=10'이라고 하는 경우, 신용등급 벡터 저장부에는 하기의 표 1과 같이 정보가 저장되어 있을 수 있다. 표 1 10개의 신용등급들 10차원의 원-핫 벡터 1등급 [1 0 0 0 0 0 0 0 0 0] 2등급 [0 1 0 0 0 0 0 0 0 0] 3등급 [0 0 1 0 0 0 0 0 0 0] 4등급 [0 0 0 1 0 0 0 0 0 0] 5등급 [0 0 0 0 1 0 0 0 0 0] 6등급 [0 0 0 0 0 1 0 0 0 0] 7등급 [0 0 0 0 0 0 1 0 0 0] 8등급 [0 0 0 0 0 0 0 1 0 0] 9등급 [0 0 0 0 0 0 0 0 1 0] 10등급 [0 0 0 0 0 0 0 0 0 1] 트레이닝 세트 저장부에는 M(M은 2이상의 자연수)명의 고객들 각각으로부터 수집된 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보와 상 기 M명의 고객들 각각의 입력 세트 정보에 대한 정답 정보로 상기 M명의 고객들 각각에 대해서 미리 산출된 변 동 신용등급이 하나씩 매칭되어 있는 M개의 트레이닝 세트들이 저장되어 있다. 여기서, 상기 변동 신용등급은 상기 N개의 신용등급들 중에 속하는 어느 하나의 신용등급을 의미한다. 예컨대, 'M=5'라고 하는 경우, 트레이닝 세트 저장부에는 하기의 표 2와 같이 정보가 저장되어 있을 수 있 다. 표 2 5개의 트레이닝 세트 들고객들입력 세트 정보 변동 신용 등급현재 신용등급신규 대출예정금 액신용카드 신규 발급 예정건수신규 연체예정 금액 트레이닝 세트 1고객 1 5등급 6천만원 3건 4백만원 8등급 트레이닝 세트 2고객 2 1등급 0천만원 1건 0백만원 1등급트레이닝 세트 3고객 3 2등급 0천만원 2건 2백만원 3등급 트레이닝 세트 4고객 4 3등급 3천만원 6건 3백만원 7등급 트레이닝 세트 5고객 5 4등급 1천만원 0건 0백만원 5등급 입력 벡터 생성부는 상기 M명의 고객들 각각에 대해, 각 고객의 현재 신용등급, 신규 대출예정금액, 신용 카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 입력 벡터를 구성함으로써, 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 생성한다. 원-핫 벡터 확인부는 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터가 생성되면, 신용등급 벡터 저장부를 참조하여 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 확인 한다. 출력 벡터 생성부는 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 둘 이상의 가중치 행렬들로 구성된 심층 신경망에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 생성한다. 여기서, 상기 심층 신경망을 구성하는 둘 이상의 가중치 행렬들은 상기 심층 신경망의 출력으로 산출되는 벡터 의 차원이 N차원이 되도록 구성된 행렬들이다. 예컨대, 앞서 설명한 예시와 같이, 'M=5'라고 하고, 'N=10'이라고 가정하자. 이때, 입력 벡터 생성부는 상기 표 2와 같은 트레이닝 세트 저장부를 참조하여 상기 5명의 고객들인 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대해, 각 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 입력 벡터를 구성함으로써, '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 4차원의 입력 벡터를 생성할 수 있다. 이와 관련해서, '고객 1'에 대해서는 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액이 각각 '5(등 급)', '6(천만원)', '3(건)', '4(백만원)'이므로, 입력 벡터 생성부는 '고객 1'에 대한 4차원의 입력 벡터 로 '[5 6 3 4]'를 생성할 수 있다. 이러한 방식으로, 입력 벡터 생성부는 상기 표 2와 같은 트레이닝 세 트 저장부를 참조하여 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 4차원의 입력 벡터로 '[5 6 3 4], [1 0 1 0], [2 0 2 2], [3 3 6 3], [4 1 0 0]'을 생성할 수 있다. 이렇게, 입력 벡터 생성부에 의해 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 4차원의 입 력 벡터가 '[5 6 3 4], [1 0 1 0], [2 0 2 2], [3 3 6 3], [4 1 0 0]'과 같이 생성되면, 원-핫 벡터 확인부 는 상기 표 1과 같은 신용등급 벡터 저장부를 참조하여 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 변동 신용등급인 '8등급, 1등급, 3등급, 7등급, 5등급'에 대한 10차원의 원-핫 벡터인 '[0 0 0 0 0 0 0 1 0 0], [1 0 0 0 0 0 0 0 0 0], [0 0 1 0 0 0 0 0 0 0], [0 0 0 0 0 0 1 0 0 0], [0 0 0 0 1 0 0 0 0 0]'을 확인할 수 있다. 그러고 나서, 출력 벡터 생성부는 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 4차원의 입 력 벡터인 '[5 6 3 4], [1 0 1 0], [2 0 2 2], [3 3 6 3], [4 1 0 0]'을 둘 이상의 가중치 행렬들로 구성된 심 층 신경망에 입력으로 인가하여 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 10차원의 출력 벡 터를 '[a1 a2 a3 a4 a5 a6 a7 a8 a9 a10], [b1 b2 b3 b4 b5 b6 b7 b8 b9 b10], [c1 c2 c3 c4 c5 c6 c7 c8 c9 c10], [d1 d2 d3 d4 d5 d6 d7 d8 d9 d10], [e1 e2 e3 e4 e5 e6 e7 e8 e9 e10]'과 같이 생성할 수 있다. 연산 벡터 생성부는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터가 생성되면, 상기 M명의 고객 들 각각에 대응되는 N차원의 출력 벡터를 미리 정해진 활성화 함수(Activation Function)(상기 활성화 함수는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들을 0이상 1이하의 값으로 변환하는 함 수임)에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 생성한다. 이때, 본 발명의 일실시예에 따르면, 상기 활성화 함수는 하기의 수학식 1과 같은 소프트맥스(Softmax) 함수일 수 있다.수학식 1"}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, 는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들 중 i번째 성분에 대한 연산 값으로, 는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터를 구성하는 성분들 중 i번째 성 분의 값, 는 자연상수를 의미한다. 예측모델 생성부는 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터와 상기 M명의 고객들 각각에 대 응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 서로 비교하여 상기 심층 신경망에 대한 기계학습을 수행함 으로써, 고객의 신용등급 변동을 예측하기 위한 예측모델을 생성한다. 예컨대, 앞서 설명한 예시와 같이, 'M=5'라고 하고, 'N=10'이라고 하며, 상기 5명의 고객들인 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 10차원의 출력 벡터가 '[a1 a2 a3 a4 a5 a6 a7 a8 a9 a10], [b1 b2 b3 b4 b5 b6 b7 b8 b9 b10], [c1 c2 c3 c4 c5 c6 c7 c8 c9 c10], [d1 d2 d3 d4 d5 d6 d7 d8 d9 d10], [e1 e2 e3 e4 e5 e6 e7 e8 e9 e10]'과 같이 생성되었다고 하는 경우, 연산 벡터 생성부는 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각 각에 대응되는 10차원의 출력 벡터인 '[a1 a2 a3 a4 a5 a6 a7 a8 a9 a10], [b1 b2 b3 b4 b5 b6 b7 b8 b9 b10], [c1 c2 c3 c4 c5 c6 c7 c8 c9 c10], [d1 d2 d3 d4 d5 d6 d7 d8 d9 d10], [e1 e2 e3 e4 e5 e6 e7 e8 e9 e10]'을 상기의 수학식 1과 같은 활성화 함수에 입력으로 인가함으로써, '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 10차원의 연산 벡터를 '[a a a a a a a a a a], [b b b b b b b b b b], [c c c c c c c c c c], [d d d d d d d d d d], [e e e e e e e e e e]'과 같이 생성할 수 있다. 그 이후, 예측모델 생성부는 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 10차원의 연산 벡터인 '[a a a a a a a a a a], [b b b b b b b b b b], [c c c c c c c c c c], [d d d d d d d d d d], [e e e e e e e e e e]'과 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 변동 신용등급인 '8등급, 1등급, 3등급, 7등급, 5등급'에 대한 10차원의 원-핫 벡터인 '[0 0 0 0 0 0 0 1 0 0], [1 0 0 0 0 0 0 0 0 0], [0 0 1 0 0 0 0 0 0 0], [0 0 0 0 0 0 1 0 0 0], [0 0 0 0 1 0 0 0 0 0]'을 서로 비교하여 상기 심층 신경망에 대한 기계학습을 수행함으로써, 고객의 신용등급 변동을 예측하기 위한 예측모델을 생성할 수 있다. 이때, 본 발명의 일실시예에 따르면, 예측모델 생성부는 기계학습 수행부를 포함할 수 있다. 기계학습 수행부는 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터가 상기 M명의 고객들 각각에 대 응되는 변동 신용등급에 대한 N차원의 원-핫 벡터에 최대로 근접하도록 상기 심층 신경망에 대한 기계학습을 수 행한다. 이때, 본 발명의 일실시예에 따르면, 기계학습 수행부는 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 구성하는 성분들과 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 구 성하는 성분들을 기초로 하기의 수학식 2에 따른 손실 함수(Loss Function)를 기반으로 한 손실 값을 연산함으 로써, 상기 M명의 고객들 각각에 대한 손실 값을 산출하고, 상기 M명의 고객들 각각에 대한 손실 값의 평균이 최소가 되도록 상기 심층 신경망에 대한 기계학습을 수행할 수 있다.수학식 2"}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, 은 상기 손실 값으로, 는 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원- 핫 벡터를 구성하는 성분들 중 i번째 성분의 값, 는 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터 를 구성하는 성분들 중 i번째 성분의 값을 의미한다. 예컨대, 앞서 설명한 예시와 같이 'M=5'라고 하고, 'N=10'이라고 하며, 상기 5명의 고객들인 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 10차원의 연산 벡터를 '[a a a a a a a a a a], [b b b b b b b b b b], [c c c c c c c c c c], [d d d d d d d d d d], [e e e e e e e e e e]'이라고 하고, '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 변동 신용등급인 '8등급, 1등급, 3등급, 7등급, 5등급'에 대한 10차원의 원-핫 벡터를 '[0 0 0 0 0 0 0 1 0 0], [1 0 0 0 0 0 0 0 0 0], [0 0 1 0 0 0 0 0 0 0], [0 0 0 0 0 0 1 0 0 0], [0 0 0 0 1 0 0 0 0 0]'이라고 가정하자. 이때, 기계학습 수행부는 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 10차원의 연산 벡터 인 '[a a a a a a a a a a], [b b b b b b b b b b], [c c c c c c c c c c], [d d d d d d d d d d], [e e e e e e e e e e]'을 구성하는 성분들과 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대응되는 변동 신용등급인 '8등급, 1등급, 3등급, 7등급, 5등급'에 대한 10차원의 원-핫 벡터인 '[0 0 0 0 0 0 0 1 0 0], [1 0 0 0 0 0 0 0 0 0], [0 0 1 0 0 0 0 0 0 0], [0 0 0 0 0 0 1 0 0 0], [0 0 0 0 1 0 0 0 0 0]'을 구성하는 성분들을 기초로 상기의 수학식 2에 따른 손실 함수를 기반으로 한 손실 값을 연산함으로써, '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대한 손실 값을 'L1, L2, L3, L4, L5'와 같이 산출할 수 있다. 그러고 나서, 기계학습 수행부 는 '고객 1, 고객 2, 고객 3, 고객 4, 고객 5' 각각에 대한 손실 값인 'L1, L2, L3, L4 L5'의 평균인 'Lm' 이 최소가 되도록 상기 심층 신경망에 대한 기계학습을 수행할 수 있다. 이때, 본 발명의 일실시예에 따르면, 기계학습 수행부는 상기 M명의 고객들 각각에 대한 손실 값의 평균이 최소가 되도록 역전파(backpropagation) 처리를 수행함으로써, 상기 심층 신경망에 대한 기계학습을 수행할 수 있다. 본 발명의 일실시예에 따르면, 신용등급 변동 예측 처리 장치는 예측용 입력 벡터 생성부, 예측용 출 력 벡터 생성부, 예측용 연산 벡터 생성부, 유사도 연산부 및 변동 신용등급 예측부를 더 포함할 수 있다. 예측용 입력 벡터 생성부는 상기 예측모델의 생성이 완료된 이후, 제1 고객의 고객 단말로부터 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예 정금액으로 구성된 입력 세트 정보가 수신되면서, 제1 고객의 신용등급에 대한 변동 예측 명령이 수신되면, 제1 고객의 고객 단말에 대한 인증을 완료한 후 제1 고객의 현재 신용등급, 신규 대 출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 예측용 입력 벡터를 생성한다. 예측용 출력 벡터 생성부는 상기 4차원의 예측용 입력 벡터가 생성되면, 상기 4차원의 예측용 입력 벡터를 기계학습이 완료된 상기 심층 신경망에 입력으로 인가하여 상기 4차원의 예측용 입력 벡터에 대응되는 N차원의 예측용 출력 벡터를 생성한다. 예측용 연산 벡터 생성부는 상기 N차원의 예측용 출력 벡터가 생성되면, 상기 N차원의 예측용 출력 벡터를 상기 활성화 함수에 입력으로 인가하여 상기 N차원의 예측용 출력 벡터에 대응되는 N차원의 예측용 연산 벡터를 생성한다. 예컨대, 상기 예측모델의 생성이 완료된 이후, 제1 고객의 고객 단말로부터 신용등급 변동 예측 처리 장치에 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보인 '6등급, 2천만원, 7건, 1백만원'이 수신되면서, 제1 고객(13 0)의 신용등급인 '6등급'에 대한 변동 예측 명령이 수신되면, 예측용 입력 벡터 생성부는 제1 고객의 고객 단말에 대한 인증을 완료한 후 제1 고객의 현재 신용등급인 '6(등급)', 신규 대출예정금액인 '2(천만원)', 신용카드 신규 발급예정건수인 '7(건)' 및 채무에 대한 신규 연체예정금액인 '1(백만원)'을 성분 으로 하는 4차원의 예측용 입력 벡터를 '[6 2 7 1]'과 같이 생성할 수 있다. 이렇게, 예측용 입력 벡터 생성부에 의해 상기 4차원의 예측용 입력 벡터가 '[6 2 7 1]'로 생성되면, 예측 용 출력 벡터 생성부는 상기 4차원의 예측용 입력 벡터인 '[6 2 7 1]'을 기계학습이 완료된 상기 심층 신 경망에 입력으로 인가하여 상기 4차원의 예측용 입력 벡터인 '[6 2 7 1]'에 대응되는 10차원의 예측용 출력 벡 터를 '[f1 f2 f3 f4 f5 f6 f7 f8 f9 f10]'과 같이 생성할 수 있다. 이때, 예측용 출력 벡터 생성부에 의해 상기 10차원의 예측용 출력 벡터가 '[f1 f2 f3 f4 f5 f6 f7 f8 f9 f10]'으로 생성되면, 예측용 연산 벡터 생성부는 상기 10차원의 예측용 출력 벡터인 '[f1 f2 f3 f4 f5 f6 f7 f8 f9 f10]'을 상기의 수학식 1과 같은 활성화 함수에 입력으로 인가하여 상기 10차원의 예측용 출력 벡터인 '[f1 f2 f3 f4 f5 f6 f7 f8 f9 f10]'에 대응되는 10차원의 예측용 연산 벡터를 '[f f f f f f f f f f]'과 같이 생성할 수 있다. 유사도 연산부는 상기 N차원의 예측용 연산 벡터가 생성되면, 상기 N차원의 예측용 연산 벡터와 상기 N개 의 신용등급들 각각에 대한 N차원의 원-핫 벡터 간의 유사도를 연산한다. 이때, 본 발명의 일실시예에 따르면, 상기 N차원의 예측용 연산 벡터와 상기 N개의 신용등급들 각각에 대한 N차 원의 원-핫 벡터 간의 유사도는 유클리드 거리(Euclidean Distance)나 코사인 유사도(Cosine Similarity) 등과 같은 벡터 유사도가 활용될 수 있다. 변동 신용등급 예측부는 상기 N개의 신용등급들 각각에 대한 N차원의 원-핫 벡터 중 상기 N차원의 예측용 연산 벡터와의 유사도가 최대로 연산된 N차원의 제1 원-핫 벡터를 확인한 후 신용등급 벡터 저장부로부터 상기 N차원의 제1 원-핫 벡터에 대응하는 제1 신용등급을 확인하고, 상기 확인된 제1 신용등급을 제1 고객(13 0)의 변동 신용등급으로 결정한 후 제1 고객의 변동 신용등급에 대한 정보를 제1 고객의 고객 단말 로 전송한다. 예컨대, 앞서 설명한 예시와 같이, 'N=10'이라고 하고, 예측용 연산 벡터 생성부에 의해 상기 10차원의 예 측용 연산 벡터가 '[f f f f f f f f f f]'으로 생성되었다고 하는 경우, 유사도 연산부 는 상기 10차원의 예측용 연산 벡터인 '[f f f f f f f f f f]'과 상기 10개의 신용 등급들인 '1등급, 2등급, 3등급, ..., 10등급' 각각에 대한 10차원의 원-핫 벡터인 '[1 0 0 0 0 0 0 0 0 0], [0 1 0 0 0 0 0 0 0 0], [0 0 1 0 0 0 0 0 0 0], ..., [0 0 0 0 0 0 0 0 0 1]' 간의 유사도를 연산할 수 있다. 만약, 유사도 연산부에 의해 상기 10차원의 예측용 연산 벡터인 '[f f f f f f f f f f]'과 상기 10개의 신용등급들인 '1등급, 2등급, 3등급, ..., 10등급' 각각에 대한 10차원의 원-핫 벡터인 '[1 0 0 0 0 0 0 0 0 0], [0 1 0 0 0 0 0 0 0 0], [0 0 1 0 0 0 0 0 0 0], ..., [0 0 0 0 0 0 0 0 0 1]' 간의 유사도 중 '10등급'에 대한 10차원의 원-핫 벡터인 '[0 0 0 0 0 0 0 0 0 1]'과의 유사도가 최대로 연산되었다고 가정하는 경우, 변동 신용등급 예측부는 상기 10개의 신용등급들인 '1등급, 2등급, 3등급, ..., 10등급' 각각에 대한 10차원의 원-핫 벡터인 '[1 0 0 0 0 0 0 0 0 0], [0 1 0 0 0 0 0 0 0 0], [0 0 1 0 0 0 0 0 0 0], ..., [0 0 0 0 0 0 0 0 0 1]' 중 상기 유사도가 최대로 연산된 10차원의 제1 원-핫 벡터로 '[0 0 0 0 0 0 0 0 0 1]'을 확인할 수 있다.그 이후, 변동 신용등급 예측부는 상기 표 1과 같은 신용등급 벡터 저장부로부터 상기 10차원의 제1 원-핫 벡터인 '[0 0 0 0 0 0 0 0 0 1]'에 대응하는 제1 신용등급인 '10등급'을 확인하고, 상기 확인된 제1 신용 등급인 '10등급'을 제1 고객의 변동 신용등급으로 결정한 후 제1 고객의 변동 신용등급인 '10등급'에 대한 정보를 제1 고객의 고객 단말로 전송할 수 있다. 이를 통해, 제1 고객은 신규 대출로 '2천만원'을 받고, 신용카드를 신규로 '7건' 발급하며, '1백만원'이라 는 채무에 대한 연체를 신규로 하는 경우, 신용등급이 '6등급'에서 '10등급'으로 변경될 수 있음을 파악할 수 있고, 높은 신용등급을 유지하기 위해 미래의 재무설계를 다시 진행할 수 있을 것이다. 본 발명의 일실시예에 따르면, 예측용 입력 벡터 생성부는 제1 고객의 고객 단말로부터 신용등 급의 변동 예측 명령이 수신되었을 때, 제1 고객의 고객 단말을 인증하기 위한 구성으로, OTP 저장부 , 유클리드 노름 저장부, 요청부, 유클리드 노름 확인부 및 인증 완료부를 포함할 수 있다. OTP 저장부에는 제1 고객의 고객 단말과 서로 동일한 일회용 인증 번호를 생성하도록 사전 공유 하고 있는 OTP(One Time Password) 생성 함수가 저장되어 있다. 여기서, OTP란 고정된 패스워드 대신 무작위로 생성되는 일회용 인증 번호를 의미하고, 상기 OTP 생성 함수는 개발자에 의해 미리 설정될 수 있는 함수로서, 일회용 인증 번호가 생성되도록 설정될 수 있다. 유클리드 노름 저장부에는 제1 고객의 고객 단말과 사전 공유하고 있는 유클리드 노름 (Euclidean Norm)에 대한 정보가 저장되어 있다. 여기서, 유클리드 노름이란 유클리드 공간 상에 어느 하나의 벡터가 존재할 때, 상기 벡터의 크기를 의미하는 것으로 하기의 수학식 3에 따라 연산될 수 있다. 수학식 3"}
{"patent_id": "10-2020-0062946", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "상기 수학식 3에서 는 유클리드 노름, Ai는 벡터에 포함되어 있는 i번째 성분들을 의미한다. 요청부는 제1 고객의 고객 단말로부터 제1 고객의 현재 신용등급, 신규 대출예정금액, 신 용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보가 수신되면서, 제1 고 객의 신용등급에 대한 변동 예측 명령이 수신되면, 상기 OTP 생성 함수를 기초로 제1 일회용 인증 번호를 생성하고, 상기 제1 일회용 인증 번호에서 미리 정해진 제1 자릿수에 해당되는 숫자를 확인한 후 상기 숫자의 크기에 대응하는 해밍 무게(Hamming Weight)를 가지면서, 미리 정해진 길이를 갖는 랜덤 벡터를 랜덤하게 생성 하고, 상기 랜덤 벡터를 제1 고객의 고객 단말로 전송하면서, 제1 고객의 고객 단말로 상 기 랜덤 벡터에 대응되는 피드백 벡터의 전송을 요청한다. 여기서, 해밍 무게란 '0'과 '1'의 코드로 구성된 데이터에서 '1'의 개수를 의미하고, 상기 미리 정해진 제1 자 릿수는 개발자에 의해 미리 설정될 수 있는 것으로, 왼쪽부터 몇 번째 자리인지를 지시하는 숫자로 설정될 수 있다. 예컨대, 전술한 바와 같이, 제1 고객의 고객 단말로부터 신용등급 변동 예측 처리 장치에 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금 액으로 구성된 입력 세트 정보인 '6등급, 2천만원, 7건, 1백만원'이 수신되면서, 제1 고객의 신용등급인 '6등급'에 대한 변동 예측 명령이 수신되면, 요청부는 상기 OTP 생성 함수를 기초로 제1 일회용 인증 번호 를 생성할 수 있다. 만약, 상기 제1 일회용 인증 번호가 '123456'으로 생성되었고, 상기 제1 자릿수가 '4'인 경우, 요청부는 상기 제1 일회용 인증 번호인 '123456'에서 4번째 자릿수에 해당되는 숫자 '4'를 확인할수 있다. 그 이후, 요청부는 상기 숫자인 '4'의 크기에 대응하는 해밍 무게를 가지면서, 상기 길이를 갖 는 랜덤 벡터를 랜덤하게 생성할 수 있다. 관련해서, 상기 길이를 '6'이라고 하는 경우, 요청부는 '1'의 개수가 4개이면서 길이가 6인 랜덤 벡터를 랜덤하게 생성할 수 있다. 예컨대, 상기 랜덤 벡터가 '[1 0 1 1 1 0]'으로 생성되었다고 하는 경우, 요청부는 상기 랜덤 벡터인 '[1 0 1 1 1 0]'을 제1 고객의 고객 단말로 전송하면서, 제1 고객의 고객 단말로 상기 랜덤 벡터인 '[1 0 1 1 1 0]'에 대응되는 피드백 벡터의 전송을 요청할 수 있다. 이때, 본 발명의 일실시예에 따르면, 제1 고객의 고객 단말은 메모리 상에 상기 유클리드 노름, 상기 OTP 생성 함수와 동일한 검증용 OTP 생성 함수를 저장하고 있을 수 있다. 만약, 신용등급 변동 예측 처리 장치로부터 제1 고객의 고객 단말에 상기 랜덤 벡터가 수신되면, 제1 고객의 고객 단말은 상기 메모리 상에 저장되어 있는 상기 검증용 OTP 생성 함수를 기 초로 검증용 일회용 인증 번호를 생성한 후 상기 검증용 일회용 인증 번호에서 상기 제1 자릿수에 해당되는 검 증용 숫자를 확인하여 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자의 크기에 대응하는 해밍 무게와 일치하 는지 여부를 확인할 수 있다. 이때, 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자의 크기에 대응하는 해밍 무게와 일치하는 것으로 확인되 는 경우, 제1 고객의 고객 단말은 상기 랜덤 벡터와 합산되었을 때의 유클리드 노름이 상기 메모리 상에 저장되어 있는 상기 유클리드 노름과 동일해지도록 하는 제1 피드백 벡터를 생성하여 신용등급 변동 예측 처리 장치로 전송할 수 있다. 관련해서, 상기 메모리 상에 저장되어 있는 상기 유클리드 노름을 ' '이라고 하고, 신용등급 변동 예측 처리 장치로부터 제1 고객의 고객 단말에 '[1 0 1 1 1 0]'이라고 하는 상기 랜덤 벡터가 수신되었다 고 하는 경우, 제1 고객의 고객 단말은 상기 메모리 상에 저장되어 있는 상기 검증용 OTP 생성 함수 를 기초로 검증용 일회용 인증 번호인 '123456'을 생성한 후 상기 검증용 일회용 인증 번호에서 상기 제1 자릿 수인 '4'에 해당되는 검증용 숫자 '4'를 확인할 수 있다. 그 이후, 제1 고객의 고객 단말은 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자인 '4'의 크기에 대응하는 해밍 무게와 일치하는지 확인할 수 있다. 본 실시예에서 상기 랜덤 벡터의 해밍 무게는 '4'로 상기 검증용 숫자와 일치하는데, 상기 랜덤 벡터의 해밍 무 게인 '4'와 상기 검증용 숫자인 '4'가 서로 일치한다는 것은 상기 랜덤 벡터가 신용등급 변동 예측 처리 장치 와 제1 고객의 고객 단말이 사전 공유하고 있는 동일한 OTP 생성 함수를 기초로 도출된 일회용 인증 번호에 기초하여 생성된 것이 맞다는 의미로 볼 수 있다. 따라서, 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자의 크기에 대응하는 해밍 무게와 일치하는 것으로 확인 되는 경우, 제1 고객의 고객 단말은 상기 랜덤 벡터와 합산되었을 때의 유클리드 노름이 상기 메모리 상에 저장되어 있는 상기 유클리드 노름인 ' '과 동일해지도록 하는 제1 피드백 벡터를 생성하여 신용등급 변동 예측 처리 장치로 전송할 수 있다. 유클리드 노름 확인부는 제1 고객의 고객 단말로부터 상기 랜덤 벡터에 대응되는 피드백 벡터로 상기 제1 피드백 벡터가 수신되면, 상기 제1 피드백 벡터와 상기 랜덤 벡터를 합산한 합산 벡터에 대한 제1 유 클리드 노름을 연산하고, 상기 제1 유클리드 노름이 상기 유클리드 노름과 동일한지 확인한다. 인증 완료부는 상기 제1 유클리드 노름이 상기 유클리드 노름과 동일한 것으로 확인되면, 제1 고객의 고객 단말에 대한 인증을 완료한다. 예컨대, 앞서 설명한 예시와 같이, 상기 랜덤 벡터를 '[1 0 1 1 1 0]'이라고 하고, 상기 유클리드 노름을 ' '이라고 가정하자. 이때, 제1 고객의 고객 단말로부터 상기 랜덤 벡터인 '[1 0 1 1 1 0]'에 대응되는 피드백 벡터로 상 기 제1 피드백 벡터가 신용등급 변동 예측 처리 장치에 수신되면, 유클리드 노름 확인부는 상기 제1 피드백 벡터와 상기 랜덤 벡터인 '[1 0 1 1 1 0]'을 합산한 합산 벡터에 대한 제1 유클리드 노름을 연산하고, 상기 제1 유클리드 노름이 상기 유클리드 노름인 ' '과 동일한지 확인할 수 있다. 이렇게, 상기 제1 유클리드 노름이 상기 유클리드 노름인 ' '과 동일한 것으로 확인되면, 인증 완료부 는 제1 고객의 고객 단말에 대한 인증을 완료할 수 있다. 즉, 제1 고객의 고객 단말은 신용등급 변동 예측 처리 장치로부터 랜덤 벡터가 수신되는 경우에 상기 랜덤 벡터와 합산되었을 때의 유클리드 노름이 메모리 상에 저장되어 있는 미리 정해진 유클리드 노름과 동일해지도록 하는 제1 피드백 벡터를 생성하여 신용등급 변동 예측 처리 장치로 전송하고, 신용등급 변동 예측 처리 장치는 제1 고객의 고객 단말로부터 상기 랜덤 벡터에 대응되는 피드백 벡터로 상기 제1 피드백 벡터가 수신되면, 상기 제1 피드백 벡터와 상기 랜덤 벡터를 합산한 합산 벡터에 대한 제1 유클리드 노름을 연산한 후 상기 제1 유클리드 노름이 상기 유클리드 노름과 동일한 것으로 확인되는 경우에만 제1 고객 의 고객 단말에 대한 인증을 완료함으로써, 비인증 고객이 본 발명에 따른 신용등급 변동 예측 서비 스를 이용하는 것을 방지할 수 있다. 본 발명의 일실시예에 따르면, 본 발명에 따른 신용등급 변동 예측 서비스는 신용정보 종합조회, 스미싱 보상 보험 가입 등의 서비스를 제공하는 소정의 통합 신용관리 서비스 내에 포함되는 형태로 고객들에게 제공될 수 있다. 이와 관련해서, 도 2에는 통합 신용관리 서비스의 가입 화면에 대한 예시가 도시되어 있다. 고객들은 도 2에 도시된 그림과 같은 가입 화면을 통해 상기 통합 신용관리 서비스에 가입할 수 있고, 상기 통합 신용관 리 서비스에 가입함으로써, 본 발명에 따른 신용등급 변동 예측 서비스를 이용할 수 있다. 도 3은 본 발명의 일실시예에 따른 인공지능 기반의 신용등급 변동 예측 처리 장치의 동작 방법을 도시한 순서 도이다. 단계(S310)에서는 N(N은 3이상의 자연수)개의 신용등급들 각각에 대한 미리 정해진 서로 다른 N차원의 원-핫 벡 터가 저장되어 있는 신용등급 벡터 저장부를 유지한다. 단계(S320)에서는 M(M은 2이상의 자연수)명의 고객들 각각으로부터 수집된 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보와 상기 M명의 고객 들 각각의 입력 세트 정보에 대한 정답 정보로 상기 M명의 고객들 각각에 대해서 미리 산출된 변동 신용등급(상 기 변동 신용등급은 상기 N개의 신용등급들 중에 속하는 어느 하나의 신용등급임)이 하나씩 매칭되어 있는 M개 의 트레이닝 세트들이 저장되어 있는 트레이닝 세트 저장부를 유지한다. 단계(S330)에서는 상기 M명의 고객들 각각에 대해, 각 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신 규 발급예정건수 및 채무에 대한 신규 연체예정금액을 성분으로 하는 4차원의 입력 벡터를 구성함으로써, 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 생성한다. 단계(S340)에서는 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터가 생성되면, 상기 신용등급 벡터 저장 부를 참조하여 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 확인한다. 단계(S350)에서는 상기 M명의 고객들 각각에 대응되는 4차원의 입력 벡터를 둘 이상의 가중치 행렬들로 구성된 심층 신경망(상기 심층 신경망을 구성하는 둘 이상의 가중치 행렬들은 상기 심층 신경망의 출력으로 산출되는 벡터의 차원이 N차원이 되도록 구성된 행렬들임)에 입력으로 인가하여 상기 M명의 고객들 각각에 대응되는 N차 원의 출력 벡터를 생성한다. 단계(S360)에서는 상기 M명의 고객들 각각에 대응되는 N차원의 출력 벡터가 생성되면, 상기 M명의 고객들 각각 에 대응되는 N차원의 출력 벡터를 미리 정해진 활성화 함수(상기 활성화 함수는 상기 M명의 고객들 각각에 대응 되는 N차원의 출력 벡터를 구성하는 성분들을 0이상 1이하의 값으로 변환하는 함수임)에 입력으로 인가하여 상 기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터를 생성한다. 단계(S370)에서는 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터와 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터를 서로 비교하여 상기 심층 신경망에 대한 기계학습을 수행함으로써, 고객의 신용등급 변동을 예측하기 위한 예측모델을 생성한다. 이때, 본 발명의 일실시예에 따르면, 상기 활성화 함수는 상기의 수학식 1과 같은 소프트맥스 함수일 수 있다. 또한, 본 발명의 일실시예에 따르면, 단계(S370)에서는 상기 M명의 고객들 각각에 대응되는 N차원의 연산 벡터 가 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫 벡터에 최대로 근접하도록 상기 심 층 신경망에 대한 기계학습을 수행하는 단계를 포함할 수 있다. 이때, 본 발명의 일실시예에 따르면, 상기 기계학습을 수행하는 단계는 상기 M명의 고객들 각각에 대응되는 N차 원의 연산 벡터를 구성하는 성분들과 상기 M명의 고객들 각각에 대응되는 변동 신용등급에 대한 N차원의 원-핫벡터를 구성하는 성분들을 기초로 상기의 수학식 2에 따른 손실 함수를 기반으로 한 손실 값을 연산함으로써, 상기 M명의 고객들 각각에 대한 손실 값을 산출하고, 상기 M명의 고객들 각각에 대한 손실 값의 평균이 최소가 되도록 상기 심층 신경망에 대한 기계학습을 수행할 수 있다. 또한, 본 발명의 일실시예에 따르면, 상기 신용등급 변동 예측 처리 장치의 동작 방법은 상기 예측모델의 생성 이 완료된 이후, 제1 고객의 고객 단말로부터 상기 제1 고객의 현재 신용등급, 신규 대출예정금액, 신용카드 신 규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보가 수신되면서, 상기 제1 고객의 신용등급에 대한 변동 예측 명령이 수신되면, 상기 제1 고객의 고객 단말에 대한 인증을 완료한 후 상기 제1 고 객의 현재 신용등급, 신규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액을 성 분으로 하는 4차원의 예측용 입력 벡터를 생성하는 단계, 상기 4차원의 예측용 입력 벡터가 생성되면, 상기 4차 원의 예측용 입력 벡터를 기계학습이 완료된 상기 심층 신경망에 입력으로 인가하여 상기 4차원의 예측용 입력 벡터에 대응되는 N차원의 예측용 출력 벡터를 생성하는 단계, 상기 N차원의 예측용 출력 벡터가 생성되면, 상기 N차원의 예측용 출력 벡터를 상기 활성화 함수에 입력으로 인가하여 상기 N차원의 예측용 출력 벡터에 대응되는 N차원의 예측용 연산 벡터를 생성하는 단계, 상기 N차원의 예측용 연산 벡터가 생성되면, 상기 N차원의 예측용 연산 벡터와 상기 N개의 신용등급들 각각에 대한 N차원의 원-핫 벡터 간의 유사도를 연산하는 단계 및 상기 N개 의 신용등급들 각각에 대한 N차원의 원-핫 벡터 중 상기 N차원의 예측용 연산 벡터와의 유사도가 최대로 연산된 N차원의 제1 원-핫 벡터를 확인한 후 상기 신용등급 벡터 저장부로부터 상기 N차원의 제1 원-핫 벡터에 대응하 는 제1 신용등급을 확인하고, 상기 확인된 제1 신용등급을 상기 제1 고객의 변동 신용등급으로 결정한 후 상기 제1 고객의 변동 신용등급에 대한 정보를 상기 제1 고객의 고객 단말로 전송하는 단계를 더 포함할 수 있다. 이때, 본 발명의 일실시예에 따르면, 상기 예측용 입력 벡터를 생성하는 단계는 상기 제1 고객의 고객 단말과 서로 동일한 일회용 인증 번호를 생성하도록 사전 공유하고 있는 OTP 생성 함수가 저장되어 있는 OTP 저장부를 유지하는 단계, 상기 제1 고객의 고객 단말과 사전 공유하고 있는 유클리드 노름에 대한 정보가 저장되어 있는 유클리드 노름 저장부를 유지하는 단계, 상기 제1 고객의 고객 단말로부터 상기 제1 고객의 현재 신용등급, 신 규 대출예정금액, 신용카드 신규 발급예정건수 및 채무에 대한 신규 연체예정금액으로 구성된 입력 세트 정보가 수신되면서, 상기 제1 고객의 신용등급에 대한 변동 예측 명령이 수신되면, 상기 OTP 생성 함수를 기초로 제1 일회용 인증 번호를 생성하고, 상기 제1 일회용 인증 번호에서 미리 정해진 제1 자릿수에 해당되는 숫자를 확인 한 후 상기 숫자의 크기에 대응하는 해밍 무게를 가지면서, 미리 정해진 길이를 갖는 랜덤 벡터를 랜덤하게 생 성하고, 상기 랜덤 벡터를 상기 제1 고객의 고객 단말로 전송하면서, 상기 제1 고객의 고객 단말로 상기 랜덤 벡터에 대응되는 피드백 벡터의 전송을 요청하는 단계, 상기 제1 고객의 고객 단말로부터 상기 랜덤 벡터에 대 응되는 피드백 벡터로 제1 피드백 벡터(상기 제1 피드백 벡터는 상기 랜덤 벡터와 합산되었을 때의 유클리드 노 름이 상기 제1 고객의 고객 단말에 기 저장되어 있는 상기 유클리드 노름과 동일해지도록 생성된 벡터임)가 수 신되면, 상기 제1 피드백 벡터와 상기 랜덤 벡터를 합산한 합산 벡터에 대한 제1 유클리드 노름을 연산하고, 상 기 제1 유클리드 노름이 상기 유클리드 노름과 동일한지 확인하는 단계 및 상기 제1 유클리드 노름이 상기 유클 리드 노름과 동일한 것으로 확인되면, 상기 제1 고객의 고객 단말에 대한 인증을 완료하는 단계를 포함할 수 있 다. 이때, 본 발명의 일실시예에 따르면, 상기 제1 고객의 고객 단말은 메모리 상에 상기 유클리드 노름, 상기 OTP 생성 함수와 동일한 검증용 OTP 생성 함수를 저장하고 있고, 상기 신용등급 변동 예측 처리 장치로부터 상기 랜 덤 벡터가 수신되면, 상기 메모리 상에 저장되어 있는 상기 검증용 OTP 생성 함수를 기초로 검증용 일회용 인증 번호를 생성한 후 상기 검증용 일회용 인증 번호에서 상기 제1 자릿수에 해당되는 검증용 숫자를 확인하여 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자의 크기에 대응하는 해밍 무게와 일치하는지 여부를 확인하며, 상기 랜덤 벡터의 해밍 무게가 상기 검증용 숫자의 크기에 대응하는 해밍 무게와 일치하는 것으로 확인되는 경우, 상 기 랜덤 벡터와 합산되었을 때의 유클리드 노름이 상기 메모리 상에 저장되어 있는 상기 유클리드 노름과 동일 해지도록 하는 상기 제1 피드백 벡터를 생성하여 상기 신용등급 변동 예측 처리 장치로 전송할 수 있다. 이상, 도 3을 참조하여 본 발명의 일실시예에 따른 신용등급 변동 예측 처리 장치의 동작 방법에 대해 설명하였 다. 여기서, 본 발명의 일실시예에 따른 신용등급 변동 예측 처리 장치의 동작 방법은 도 1을 이용하여 설명한 신용등급 변동 예측 처리 장치의 동작에 대한 구성과 대응될 수 있으므로, 이에 대한 보다 상세한 설명은 생략하기로 한다. 본 발명의 일실시예에 따른 신용등급 변동 예측 처리 장치의 동작 방법은 컴퓨터와의 결합을 통해 실행시키기 위한 저장매체에 저장된 컴퓨터 프로그램으로 구현될 수 있다.또한, 본 발명의 일실시예에 따른 신용등급 변동 예측 처리 장치의 동작 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매 체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업 자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디 스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플 롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨 터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 이상과 같이 본 발명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 의해 설명되 었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정되 는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2020-0062946", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 인공지능 기반의 신용등급 변동 예측 처리 장치의 구조를 도시한 도면이다. 도 2는 본 발명에 따른 신용등급 변동 예측 서비스를 제공하는 통합 신용관리 서비스의 가입 화면의 예시를 나 타내는 도면이다. 도 3은 본 발명의 일실시예에 따른 인공지능 기반의 신용등급 변동 예측 처리 장치의 동작 방법을 도시한 순서 도이다."}
