{"patent_id": "10-2023-0141464", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0057530", "출원번호": "10-2023-0141464", "발명의 명칭": "믹스 배너 광고 시스템 및 방법", "출원인": "(주)디지털캠프", "발명자": "이용진"}}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웹 서버(200)로부터 사용자 프로파일 정보를 포함한 사용자 단말(100) 정보와 광고 지면의 호출 정보가 수신되면, 상기 웹 서버(200)의 광고 지면으로 광고 플랫폼(500)을 생성하여 제공하되,상기 사용자 단말(100)이 등록된 사용자 단말(100)이면, 상기 사용자 프로파일 정보와 서로 다른 광고주 단말(400, 400a, 내지 400n)이 요청한 임의의 타겟 모수 정보를 비교하여 타겟팅 광고 대상인지 판단하고, 상기 사용자 단말(100)이 타겟팅 광고 대상으로 판단됨에 따라, 미리 설정된 광고 플랫폼 설정 정보에 따라 하나의 광고주 단말(400)이 제공하는 하나 이상의 캠페인 정보(410)에 대응하는 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼(500)에 생성하여 제공하거나, 또는 상기 타겟 모수 정보에 기반한 각 광고주 단말(400, 400a, 내지 400n)의 크로스 캠페인 정보(411)에 대응하는 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼1(500a)에 생성하여 제공하는 것을 특징으로 하는 광고 관리 서버(300);를 포함하는 믹스 배너 광고시스템."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 광고 플랫폼(500)은 복수의 광고 영역(510, 520, 530)으로 구획되고, 상기 광고 영역(510, 520, 530)은 하나의 광고주 단말(400)로부터 설정된 캠페인 정보(410)의 제품 또는 서비스가 노출되도록 하는 것을 특징으로 하는 믹스 배너 광고 시스템."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 광고 플랫폼(500)은 임의의 캠페인 메시지가 노출되는 광고 메시지 영역(540)을 더 포함하는 것을 특징으로 하는 믹스 배너 광고 시스템."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 광고 플랫폼1(500a)은 복수의 광고 영역(510a, 520a, 530a)으로 구획되고, 구획된 개별 광고 영역(510a,520a, 530a)은 임의의 광고주 단말(400, 400a, 내지 400n)과 연동되며, 각 광고주 단말(400, 400a, 내지 400n)로부터 설정된 크로스 캠페인 정보(411)의 제품 또는 서비스가 노출되도록 하는 것을 특징으로 하는 믹스 배너 광고 시스템."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 광고 플랫폼1(500a)은 임의의 캠페인 메시지가 노출되는 광고 메시지 영역(540a)을 더 포함하는 것을 특징으로 하는 믹스 배너 광고 시스템."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항 내지 제 5 항 중 어느 한 항에 있어서,상기 광고 관리 서버(300)는 상기 사용자 프로파일 정보로부터 사용자의 페르소나를 추출하고, 상기 광고주 단말(400, 400a, 내지 400n)로부터 입력되는 프롬프트 데이터, 캠페인 정보(410) 및 카테고리 정보(420)로부터 키워드를 추출하며,공개특허 10-2025-0057530-3-상기 추출된 사용자 페르소나와 키워드를 기반으로 시뮬레이션을 통해 타겟팅 대상을 고려한 캠페인 메시지를생성하는 것을 특징으로 하는 믹스 배너 광고 시스템."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 광고 관리 서버(300)는 사용자 단말(100)이 신규 사용자의 단말이면, 신규 사용자로부터 입력되는 사용자 프로파일 정보에 기반한 데이터 태깅과 신규 사용자 단말의 고유 정보를 수집하여 저장하는 것을 특징으로 하는 믹스 배너 광고 시스템."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 광고 관리 서버(300)는 타겟팅 광고 대상이 아니면, 상기 광고주 단말(400, 400a, 내지 400n)로부터 입력된 임의의 논타겟팅 광고 제품 또는 서비스를 광고 플랫폼(500, 500a)에 생성하여 상기 웹 서버(200)의 광고 지면에 제공하는 것을 특징으로 하는 믹스 배너 광고 시스템."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 광고 관리 서버(300)는 웹 서버(200), 서로 다른 광고주 단말(400, 400a, 내지 400n)과 데이터를 송수신하는 데이터 통신부(310);상기 웹 서버(200)로부터 수신되는 사용자 프로파일 정보를 포함한 사용자 단말(100) 정보를 이용하여 상기 사용자 단말(100)에 대한 고유 정보 설정과, 사용자 프로파일 정보에 기반한 데이터 태깅을 수행하고, 상기 웹 서버(200)의 광고 지면 호출에 따른 사용자 단말(100)과 사용자 프로파일 정보를 분석하는 사용자 정보 관리부(320);상기 웹 서버(200)의 광고 지면 호출에 대응하여 입력된 상기 사용자 단말(100)과 사용자 프로파일 정보를 기반으로 타겟팅 광고 대상인지 판단하고, 상기 사용자 단말(100)이 타겟팅 광고 대상으로 판단됨에 따라 미리 설정된 광고 플랫폼의 설정 정보에 기반하여 하나의 광고주 단말(400)이 제공하는 하나 이상의 캠페인 정보(410)에대응하는 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼(500)에 생성하거나 또는 서로 다른 광고주 단말(400, 400a, 내지 400n)이 제공하는 복수의 서로 다른 카테고리 정보(420)로 이루어진 캠페인 정보(410)중에서, 타겟 모수에 대응하는 각 광고주 단말(400, 400a, 내지 400n)의 캠페인 정보(410)를 추출하여 크로스캠페인 정보(411)를 구성하며, 상기 크로스 캠페인 정보(411)에 대응하는 각 광고주 단말(400, 400a, 내지400n)의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼1(500a)에 생성하여 상기 웹 서버(200)의 광고 지면으로 출력하는 광고 정보 관리부(330);상기 사용자 프로파일 정보로부터 사용자의 페르소나를 추출하고, 상기 광고주 단말(400, 400a, 내지 400n)로부터 입력되는 타겟팅 광고 제품 및 서비스와 관련된 프롬프트 데이터, 캠페인 정보(410) 및 카테고리 정보(420)로부터 키워드를 추출하며, 상기 추출된 사용자 페르소나와 키워드를 기반으로 시뮬레이션을 수행하여 타겟팅대상을 고려한 캠페인 메시지를 생성하는 메시지 생성부(340); 및상기 사용자 단말(100) 정보, 사용자 프로파일 정보, 광고주 단말(400, 400a, 내지 400n) 정보, 타겟팅 광고 제품 및 서비스와 관련된 프롬프트 데이터, 캠페인 정보(410) 및 카테고리 정보(420)를 저장하는 데이터베이스(350);를 포함하는 것을 특징으로 하는 믹스 배너 광고 시스템."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "a) 광고 관리 서버(300)가 웹 서버(200)로부터 사용자 프로파일 정보를 포함한 사용자 단말(100) 정보와 광고지면의 호출 정보를 수신하면, 상기 사용자 단말(100) 정보를 분석하여 등록된 단말인지 판단하는 단계;b) 상기 사용자 단말(100)이 등록된 사용자 단말(100)로 판단됨에 따라, 상기 광고 관리 서버(300)가 상기 사용자 단말(100)의 사용자 프로파일 정보와 광고주 단말(400, 400a, 내지 400n)이 요청한 임의의 타겟 모수 정보를비교하여 타겟팅 광고 대상인지 판단하는 단계; 및공개특허 10-2025-0057530-4-c) 상기 사용자 단말(100)이 타겟팅 광고 대상으로 판단됨에 따라, 상기 광고 관리 서버(300)가 미리 설정된 광고 플랫폼 설정 정보에 따라 하나의 광고주 단말(400)이 제공하는 하나 이상의 캠페인 정보(410)에 대응하는 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼(500)에 생성하거나, 또는 상기 타겟 모수 정보에 기반한 각 광고주 단말(400, 400a, 내지 400n)의 크로스 캠페인 정보(411)에 대응하는 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼1(500a)에 생성하여 상기 웹 서버(200)의 광고 지면으로 출력하는 단계;를 포함하는 믹스 배너 광고 방법."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 c) 단계의 광고 플랫폼(500)은 복수의 광고 영역(510, 520, 530)으로 구획되고, 상기 광고 영역(510, 520, 530)은 하나의 광고주 단말(400)로부터 설정된 캠페인 정보(410)의 제품 또는 서비스가 노출되도록 하는 것을 특징으로 하는 믹스 배너 광고 방법."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 c) 단계의 광고 플랫폼(500)은 임의의 캠페인 메시지가 노출되는 광고 메시지 영역(540)을 포함하는 것을특징으로 하는 믹스 배너 광고 방법."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 10 항에 있어서,상기 c) 단계의 광고 플랫폼1(500a)은 복수의 광고 영역(510a, 520a, 530a)으로 구획되고, 구획된 개별 광고 영역(510a, 520a, 530a)은 임의의 광고주 단말(400, 400a, 내지 400n)과 연동되며, 각 광고주 단말(400, 400a, 내지 400n)로부터 설정된 크로스 캠페인 정보(411)의 제품 또는 서비스가 노출되도록 하는것을 특징으로 하는 믹스 배너 광고 방법."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 10 항 내지 제 13 항 중 어느 한 항에 있어서,상기 캠페인 메시지는 상기 광고 관리 서버(300)가 상기 사용자 프로파일 정보로부터 사용자의 페르소나를 추출하고, 상기 광고주 단말(400, 400a, 내지 400n)로부터 입력되는 프롬프트 데이터, 캠페인 정보(410) 및 카테고리 정보(420)로부터 키워드를 추출하며,상기 추출된 사용자 페르소나와 키워드를 기반으로 시뮬레이션을 통해 타겟팅 대상을 고려하여 생성되는 것을특징으로 하는 믹스 배너 광고 방법."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 b) 단계의 판단 결과, 상기 사용자 단말(100)이 신규 사용자의 단말이면, 상기 광고 관리 서버(300)는 신규 입력되는 사용자 프로파일 정보에 기반한 데이터 태깅과 신규 사용자 단말의 고유 정보를 수집하여 저장하는단계;를 포함하는 것을 특징으로 하는 믹스 배너 광고 방법."}
{"patent_id": "10-2023-0141464", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 c) 단계의 판단 결과, 상기 사용자 단말(100)이 타겟팅 광고 대상이 아니면, 상기 광고 관리 서버(300)는상기 광고주 단말(400, 400a, 내지 400n)로부터 입력된 임의의 논타겟팅 광고 제품 또는 서비스를 광고 플랫폼(500, 500a)에 생성하여 상기 웹 서버(200)의 광고 지면에 제공하는 단계;를 포함하는 것을 특징으로 하는 믹스공개특허 10-2025-0057530-5-배너 광고 방법."}
{"patent_id": "10-2023-0141464", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "믹스 배너 광고 시스템 및 방법을 개시한다. 하나의 광고 플랫폼에 다수의 광고 영역을 구분하고, 구분된 광고 영역에 하나 이상의 광고주가 제공하는 다양한 타겟팅 광고를 적용하여 사용자에게 노출시킴으로써 광고 효율을 개선할 수 있다."}
{"patent_id": "10-2023-0141464", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 믹스 배너 광고 시스템 및 방법에 관한 발명으로서, 더욱 상세하게는 하나의 광고 플랫폼에 다수의 광고 영역을 구분하고, 구분된 광고 영역에 하나 이상의 광고주가 제공하는 다양한 타겟팅 광고를 적용하여 사 용자에게 노출시킴으로써 광고 효율을 개선할 수 있는 믹스 배너 광고 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0141464", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "광고란 누구인지를 확인할 수 있는 광고주가 고객의 태도나 행동에 영향을 주고 궁극적으로 자신의 상품을 구매 하도록 하기 위한 목표로 매체를 통해 유료로 시행하는 정보 전달 활동이다. 광고는 고객이 구매 등 광고주의 비즈니스에 가치 있는 행위를 수행하는 것을 목표로 하며, 광고와 상호작용(예 를 들어, 텍스트 광고 클릭, 동영상 광고 조회)한 고객이 광고의 목표가 되는 행위를 수행하는 것을 전환 (conversion)이라고 한다. 광고의 목표가 되는 행위는 광고자에 의해 규정될 수 있다. 광고 타겟팅이란 특정한 기준으로 광고가 노출될 타겟을 설정하는 것으로, 타겟팅된 집단을 대상으로 광고를 집 행함으로써, 불특정 다수를 상대로 광고를 집행하는 것보다 광고 효율을 높일 수 있다. 종래에는 '30대 서울 거주 여성' 등 성, 연령, 지역 등의 기준을 고려한 인구 통계학적인 타겟팅 방법을 많이 사용하였으나, 빅데이터 환경 하에서는 '광고주의 제품을 구매할 것 같은 사용자', '광고주의 서비스를 좋아할 것 같은 사용자' 등 광고주에 대응하여 개인화된 자동화 타겟팅 방법이 많이 사용되고 있다. 인터넷상에서 사용되는 광고 방법은 주로 웹 페이지 내의 특정 위치에 제공되는 배너 광고를 사용하고 있다. 배너 광고는 주로 사각형상의 광고 플랫폼에 광고가 노출되도록 하고, 해당 웹 페이지 및 모바일 앱에 접속한 네트워크 사용자가 해당 배너 광고를 클릭하면 연동된 광고 메시지와 연결되도록 구성된다. 그러나 종래기술에 따른 광고 서비스 시스템은 하나의 배너 광고에 대하여 하나의 광고주와 하나의 타겟팅이 적 용된 광고만을 제공함으로써, 다양한 타켓팅이 적용된 광고를 사용자에게 노출시키지 못하는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허공보 등록번호 제10-2574847호(발명의 명칭: 메인 배너광고 데이터 제공 시스템)"}
{"patent_id": "10-2023-0141464", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이러한 문제점을 해결하기 위하여, 본 발명은 하나의 광고 플랫폼에 다수의 광고 영역을 구분하고, 구분된 광고 영역에 하나 이상의 광고주가 제공하는 다양한 타겟팅 광고를 적용하여 사용자에게 노출시킴으로써 광고 효율을 개선할 수 있는 믹스 배너 광고 시스템 및 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0141464", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위하여 본 발명의 일 실시 예는 믹스 배너 광고 시스템으로서, 웹 서버로부터 사용자 프로파일 정보를 포함한 사용자 단말 정보와 광고 지면의 호출 정보가 수신되면, 상기 웹 서버의 광고 지면으로 광고 플랫폼을 생성하여 제공하되, 상기 사용자 단말이 등록된 사용자 단말이면, 상기 사용자 프로파일 정보와 서로 다른 광고주 단말이 요청한 임의의 타겟 모수 정보를 비교하여 타겟팅 광고 대상인지 판단하고, 상기 사용 자 단말이 타겟팅 광고 대상으로 판단됨에 따라, 미리 설정된 광고 플랫폼 설정 정보에 따라 하나의 광고주 단 말이 제공하는 하나 이상의 캠페인 정보에 대응하는 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫 폼에 생성하여 제공하거나, 또는 상기 타겟 모수 정보에 기반한 각 광고주 단말의 크로스 캠페인 정보에 대응하는 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼에 생성하여 제공하는 것을 특징으로 하는 광고 관리 서버;를 포함한다. 또한, 상기 실시 예에 따른 광고 플랫폼은 복수의 광고 영역으로 구획되고, 상기 광고 영역은 하나의 광고주 단 말로부터 설정된 캠페인 정보의 제품 또는 서비스가 노출되도록 하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 광고 플랫폼은 임의의 캠페인 메시지가 노출되는 광고 메시지 영역을 더 포함하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 광고 플랫폼은 복수의 광고 영역으로 구획되고, 구획된 개별 광고 영역은 임의의 광 고주 단말과 연동되며, 각 광고주 단말로부터 설정된 크로스 캠페인 정보의 제품 또는 서비스 중 어느 하나가 노출되도록 하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 광고 플랫폼은 임의의 캠페인 메시지가 노출되는 광고 메시지 영역을 더 포함하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 광고 관리 서버는 상기 사용자 프로파일 정보로부터 사용자의 페르소나를 추출하고, 상기 광고주 단말로부터 입력되는 프롬프트 데이터, 캠페인 정보 및 카테고리 정보로부터 키워드를 추출하며, 상기 추출된 사용자 페르소나와 키워드를 기반으로 시뮬레이션을 통해 타겟팅 대상을 고려한 캠페인 메시지를 생성하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 광고 관리 서버는 사용자 단말이 신규 사용자의 단말이면, 신규 사용자로부터 입력 되는 사용자 프로파일 정보에 기반한 데이터 태깅과 신규 사용자 단말의 고유 정보를 수집하여 저장하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 광고 관리 서버는 타겟팅 광고 대상이 아니면, 상기 광고주 단말로부터 입력된 임의 의 논타겟팅 광고 제품 또는 서비스를 광고 플랫폼에 생성하여 상기 웹 서버의 광고 지면에 제공하는 것을 특징 으로 한다. 또한, 상기 실시 예에 따른 광고 관리 서버는 웹 서버, 서로 다른 광고주 단말과 데이터를 송수신하는 데이터 통신부; 상기 웹 서버로부터 수신되는 사용자 프로파일 정보를 포함한 사용자 단말 정보를 이용하여 상기 사용 자 단말에 대한 고유 정보 설정과, 사용자 프로파일 정보에 기반한 데이터 태깅을 수행하고, 상기 웹 서버의 광 고 지면 호출에 따른 사용자 단말과 사용자 프로파일 정보를 분석하는 사용자 정보 관리부; 상기 웹 서버의 광 고 지면 호출에 대응하여 입력된 상기 사용자 단말과 사용자 프로파일 정보를 기반으로 타겟팅 광고 대상인지 판단하고, 상기 사용자 단말이 타겟팅 광고 대상으로 판단됨에 따라 미리 설정된 광고 플랫폼의 설정 정보에 기 반하여 하나의 광고주 단말이 제공하는 하나 이상의 캠페인 정보에 대응하는 광고주의 타겟팅 광고 제품 및 서 비스를 하나의 광고 플랫폼에 생성하거나 또는 서로 다른 광고주 단말이 제공하는 복수의 서로 다른 카테고리 정보로 이루어진 캠페인 정보 중에서, 타겟 모수에 대응하는 각 광고주 단말의 캠페인 정보를 추출하여 크로스 캠페인 정보를 구성하며, 상기 크로스 캠페인 정보에 대응하는 각 광고주 단말의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼에 생성하여 상기 웹 서버의 광고 지면으로 출력하는 광고 정보 관리부; 상기 사용자 프로파 일 정보로부터 사용자의 페르소나를 추출하고, 상기 광고주 단말로부터 입력되는 타겟팅 광고 제품 및 서비스와 관련된 프롬프트 데이터, 캠페인 정보 및 카테고리 정보로부터 키워드를 추출하며, 상기 추출된 사용자 페르소 나와 키워드를 기반으로 시뮬레이션을 수행하여 타겟팅 대상을 고려한 캠페인 메시지를 생성하는 메시지 생성부; 및 상기 사용자 단말 정보, 사용자 프로파일 정보, 광고주 단말 정보, 타겟팅 광고 제품 및 서비스와 관련된 프롬프트 데이터, 캠페인 정보 및 카테고리 정보를 저장하는 데이터베이스;를 포함하는 것을 특징으로 한다. 또한, 본 발명의 일 실시 예는 믹스 배너 광고 방법으로서, a) 광고 관리 서버가 웹 서버로부터 사용자 프로파 일 정보를 포함한 사용자 단말 정보와 광고 지면의 호출 정보를 수신하면, 상기 사용자 단말 정보를 분석하여 등록된 단말인지 판단하는 단계; b) 상기 사용자 단말이 등록된 사용자 단말로 판단됨에 따라, 상기 광고 관리 서버가 상기 사용자 단말의 사용자 프로파일 정보와 광고주 단말이 요청한 임의의 타겟 모수 정보를 비교하여 타겟팅 광고 대상인지 판단하는 단계; 및 c) 상기 사용자 단말이 타겟팅 광고 대상으로 판단됨에 따라, 상기 광 고 관리 서버가 미리 설정된 광고 플랫폼 설정 정보에 따라 하나의 광고주 단말이 제공하는 하나 이상의 캠페인 정보에 대응하는 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼에 생성하거나, 또는 상기 타겟 모 수 정보에 기반한 각 광고주 단말의 크로스 캠페인 정보에 대응하는 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼에 생성하여 상기 웹 서버의 광고 지면으로 출력하는 단계;를 포함한다.또한, 상기 실시 예에 따른 c) 단계의 광고 플랫폼은 복수의 광고 영역으로 구획되고, 상기 광고 영역은 하나의 광고주 단말로부터 설정된 캠페인 정보의 제품 또는 서비스가 노출되도록 하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 c) 단계의 광고 플랫폼은 임의의 캠페인 메시지가 노출되는 광고 메시지 영역을 포 함하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 c) 단계의 광고 플랫폼은 복수의 광고 영역으로 구획되고, 구획된 개별 광고 영역은 임의의 광고주 단말과 연동되며, 각 광고주 단말로부터 설정된 크로스 캠페인 정보의 제품 또는 서비스 중 어느 하나가 노출되도록 하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 캠페인 메시지는 상기 광고 관리 서버가 상기 사용자 프로파일 정보로부터 사용자의 페르소나를 추출하고, 상기 광고주 단말로부터 입력되는 프롬프트 데이터, 캠페인 정보 및 카테고리 정보로부터 키워드를 추출하며, 상기 추출된 사용자 페르소나와 키워드를 기반으로 시뮬레이션을 통해 타겟팅 대상을 고려 하여 생성되는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 b) 단계의 판단 결과, 상기 사용자 단말이 신규 사용자의 단말이면, 상기 광고 관리 서버는 신규 입력되는 사용자 프로파일 정보에 기반한 데이터 태깅과 신규 사용자 단말의 고유 정보를 수집하여 저장하는 단계;를 포함하는 것을 특징으로 한다. 또한, 상기 실시 예에 따른 c) 단계의 판단 결과, 상기 사용자 단말이 타겟팅 광고 대상이 아니면, 상기 광고 관리 서버는 상기 광고주 단말로부터 입력된 임의의 논타겟팅 광고 제품 또는 서비스를 광고 플랫폼에 생성하여 상기 웹 서버의 광고 지면에 제공하는 단계;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0141464", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 하나의 광고 플랫폼에 다수의 광고 영역을 구분하고, 구분된 광고 영역에 하나 이상의 광고주가 제공 하는 다양한 타겟팅 광고를 적용하여 사용자에게 노출시킴으로써 광고 효율을 개선할 수 있는 장점이 있다."}
{"patent_id": "10-2023-0141464", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 바람직한 실시 예 및 첨부하는 도면을 참조하여 본 발명을 상세히 설명하되, 도면의 동일 한 참조부호는 동일한 구성요소를 지칭함을 전제하여 설명하기로 한다. 본 발명의 실시를 위한 구체적인 내용을 설명하기에 앞서, 본 발명의 기술적 요지와 직접적 관련이 없는 구성에 대해서는 본 발명의 기술적 요지를 흩뜨리지 않는 범위 내에서 생략하였음에 유의하여야 할 것이다. 또한, 본 명세서 및 청구범위에 사용된 용어 또는 단어는 발명자가 자신의 발명을 최선의 방법으로 설명하기 위 해 적절한 용어의 개념을 정의할 수 있다는 원칙에 입각하여 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 할 것이다. 본 명세서에서 어떤 부분이 어떤 구성요소를 \"포함\"한다는 표현은 다른 구성요소를 배제하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 또한, \"‥부\", \"‥기\", \"‥모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는 그 둘의 결합으로 구분될 수 있다.또한, \"적어도 하나의\" 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존 재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명하 다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시 예에 따라 변경가능하다 할 것이다. 이하, 첨부된 도면을 참조하여 본 발명의 일 실시 예에 따른 믹스 배너 광고 시스템 및 방법의 바람직한 실시 예를 상세하게 설명한다. 도1은 본 발명의 일 실시 예에 따른 믹스 배너 광고 시스템의 구성을 나타낸 예시도이고, 도2는 도1의 실시 예 에 따른 믹스 배너 광고 시스템의 광고 관리 서버의 구성을 나타낸 블록도이며, 도3은 도1의 실시 예에 따른 믹 스 배너 광고 시스템의 타겟팅 설정을 설명하기 위해 나타낸 예시도이고, 도4는 도1의 실시 예에 따른 믹스 배 너 광고 시스템의 타겟팅 설정을 설명하기 위해 나타낸 예시도이며, 도5는 도1의 실시 예에 따른 믹스 배너 광 고 시스템의 광고 플랫폼을 설명하기 위해 나타낸 예시도이고, 도6은 도1의 실시 예에 따른 믹스 배너 광고 시 스템의 광고 플랫폼을 설명하기 위해 나타낸 예시도이다. 도1 내지 도6을 참조하면, 본 발명의 일 실시 예에 따른 믹스 배너 광고 시스템은 광고 플랫폼(500, 500a)에 노 출되는 하나 이상의 사용자 단말, 사용자 단말 1(100a) 내지 사용자 단말 n(100n)과, 임의의 정보를 제공 하고 광고 지면을 통해 광고 플랫폼(500, 500a)이 노출되도록 하는 웹 서버와, 광고 플랫폼(500, 500a)을 제공하는 광고 관리 서버와, 광고를 제공하는 서로 다른 복수의 광고주 단말, 광고주 단말 1(400a) 내지 광고주 단말 n(400n)을 포함하여 구성될 수 있다. 사용자 단말, 사용자 단말 1(100a) 내지 사용자 단말 n(100n)은 네트워크를 통해 접속 가능한 구성으로서, 데스크탑 PC, 노트북 PC, 태블릿 PC, 스마트폰, 모바일 단말기, 스마트 워치 등으로 구성될 수 있지만, 이에 한 정되는 것은 아니고 네트워크 접속이 가능한 단말장치면 모두 포함될 수 있다. 또한, 사용자 단말, 사용자 단말 1(100a) 내지 사용자 단말 n(100n)은 웹 브라우저를 이용하여 웹 기반 서 비스를 제공하는 웹 서버와 접속하고, 웹 서버에서 제공되는 광고 플랫폼(500, 500a)을 통해 광고에 노출될 수 있다. 또한, 사용자 단말, 사용자 단말 1(100a) 내지 사용자 단말 n(100n)은 웹 서버에 접속하기 위해, 사 용자 단말, 사용자 단말 1(100a) 내지 사용자 단말 n(100n)의 기기 고유 정보, 네트워크 접속 정보, 회원 가입 정보, 거주지, 성별, 나이, 구매 성향, 상품 보유 정보, 앱 가입 정보, 상품 구매 이력 정보 등의 사용자 프로파일 정보를 제공할 수 있다. 웹 서버는 웹 페이지를 통해 임의의 웹 서비스를 제공하는 구성으로서, 서버 시스템으로 구성될 수 있다. 또한, 웹 서버는 접속한 사용자 단말, 사용자 단말 1(100a) 내지 사용자 단말 n(100n)로부터 웹 서비 스를 제공하기 위한 사용자 프로파일 정보를 입력받을 수 있다. 또한, 웹 서버는 웹 페이지 상의 적어도 일부 영역에 광고 지면이 설정될 수 있고, 웹 서버에 하나 이상의 사용자 단말, 사용자 단말 1(100a) 내지 사용자 단말 n(100n)이 접속하면, 광고 지면에 연동된 광 고 플랫폼(500, 500a)이 노출되도록 한다. 또한, 웹 서버는 하나 이상의 사용자 단말, 사용자 단말 1(100a) 내지 사용자 단말 n(100n)이 접속하 면, 광고 관리 서버로 광고 지면의 호출 정보와 함께 접속한 사용자 단말의 사용자 프로파일 정보를 제공할 수 있다. 광고 관리 서버는 웹 서버로부터 사용자 프로파일 정보를 포함한 사용자 단말 정보와 광고 지면 의 호출 정보가 수신되면, 웹 서버의 광고 지면으로 광고 플랫폼(500, 500a)을 생성하여 제공하는 구성으 로서, 서버 시스템으로 구성될 수 있다. 본 실시 예에서는 설명의 편의를 위해 웹 서버와 광고 관리 서버를 분리하여 설명하지만, 이에 한정 되는 것은 아니고, 웹 서버와 광고 관리 서버는 하나의 서버 시스템에 구성될 수도 있다. 광고 관리 서버는 네트워크를 통해 접속한 임의의 사용자 단말이 등록된 사용자 단말인지 판단 하여 등록된 사용자 단말인 경우, 사용자 프로파일 정보와 하나의 광고주 단말이 요청한 임의의 타겟 모수 정보 또는 서로 다른 광고주 단말(400, 400a, 내지 400n)이 요청한 공통 타겟 모수 정보를 비교하여 타겟팅 광고 대상인지 판단할 수 있다. 타겟 모수 정보는 광고에 노출될 대상을 설정하기 위한 특정 값, 특정 범위, 특정 카테고리 등으로 설정될 수 있고, 타겟 모수는 광고주 단말(400, 400a, 내지 400n)을 통해 광고주가 설정한 정보이다. 또한, 사용자 프로파일 정보와 복수의 카테고리 정보로 구성된 캠페인 정보(410, 410a)를 비교하여 타겟팅 광고 대상인지 판단할 수도 있다. 광고 관리 서버는 사용자 단말이 타겟팅 광고 대상으로 판단됨에 따라, 미리 설정된 광고 플랫폼 설 정 정보에 따라 하나의 광고주 단말이 제공하는 하나 이상의 캠페인 정보에 대응하는 광고주의 타겟 팅 광고 제품 및 서비스를 하나의 광고 플랫폼에 생성하여 제공할 수 있다. 또한, 광고 관리 서버는 사용자 단말이 타겟팅 광고 대상으로 판단됨에 따라, 설정된 광고 플랫폼 설 정 정보에 따라 크로스 캠페인 정보에 대응하는 서로 다른 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼1(500a)에 생성하여 제공할 수 있다. 즉, 광고 관리 서버는 타겟팅 광고 대상에 대하여 하나의 광고주 단말이 제공하는 타겟팅 광고 제품 및 서비스를 제공하는 것으로 설정된 경우, 해당 광고주 단말이 제공하는 하나 이상의 캠페인 정보에 대응 하는 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼에 생성하여 제공한다. 또한, 광고 관리 서버는 타겟팅 광고 대상에 대하여 서로 다른 광고주 단말(400, 400a, 내지 400n)이 제공 하는 타켓팅 광고 제품 및 서비스를 제공하는 것으로 설정된 경우, 하나의 광고 플랫폼에 다수의 광고 영역을 구분하고, 구분된 개별 광고 영역에 서로 다른 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼 1(500a)에 생성하여 제공한다. 이를 위해, 광고 관리 서버는 하나의 광고 플랫폼에 다수의 광고 영역을 구분하고, 구분된 광고 영역에 하 나의 광고주가 제공하는 다양한 타켓팅 광고를 개별 광고 영역에 적용하여 사용자에게 노출되도록 하거나, 또는 구분된 광고 영역에 서로 다른 광고주 단말(400, 400a, 내지 400n)이 제공하는 타켓팅 광고를 구분된 개별 광고 영역에 적용하여 사용자에게 노출될 수 있도록 데이터 통신부와, 사용자 정보 관리부와, 광고 정보 관리부와, 메시지 생성부와, 데이터베이스를 포함하여 구성될 수 있다. 데이터 통신부는 웹 서버 및 광고주 단말(400, 400a, 내지 400n)과 데이터를 송수신하는 구성으로서, 웹 서버와 광고 지면의 호출 정보, 사용자 단말의 사용자 프로파일 정보, 광고 플랫폼 정보를 송수신하고, 광고주 단말(400, 400a, 내지 400n)과 캠페인 정보(410, 410a)에 기반한 타겟팅 광고 제품, 타겟팅 광고 서비스, 논타겟팅 광고 제품 또는 논타겟팅 광고 서비스 정보를 송수신한다. 사용자 정보 관리부는 웹 서버로부터 수신되는 사용자 프로파일 정보와 사용자 단말 정보를 이 용하여 사용자 단말에 대한 고유 정보를 설정할 수 있다 또한, 사용자 정보 관리부는 설정된 사용자 단말의 고유 정보를 이용하여 이미 등록된 사용자 단말인 지 또는 새로운 신규 사용자 단말인지 확인할 수 있다. 즉, 사용자 정보 관리부는 웹 서버의 광고 지면 호출에 따른 사용자 단말과 사용자 프로파일 정 보를 수신하면, 사용자 단말에 설정된 고유 정보를 기반으로 기등록된 사용자 단말인지 또는 신규 사용자 단말인지 확인한다. 사용자 정보 관리부는 사용자 단말이 신규 사용자의 단말이면, 신규 사용자로부터 입력되는 사용자 프로파일 정보에 기반한 데이터 태깅과 신규 사용자 단말의 고유 정보를 수집하여 데이터베이스에 저장한 다. 사용자 정보 관리부는 데이터 태깅을 통해 사용자 프로파일 정보로부터 사용자의 주요 접속 시간, 요일, 웹 페이지 정보, 앱 가입 정보, 상품의 조회와 구매 성향, 구매 이력, 접속지 위치 정보, 배송지 정보, 광고 지 면의 게제 위치 정보, 국가 정보, 도시 정보 등을 수집할 수 있다. 광고 정보 관리부는 설정된 광고 플랫폼 정보로부터 하나의 광고주 단말이 제공하는 타겟팅 광고 제 품 및 서비스를 광고하는지 또는 서로 다른 광고주 단말이 제공하는 타겟팅 광고 제품 및 서비스를 광고하는지 분석한다. 분석 결과, 하나의 광고주 단말이 제공하는 타겟팅 광고 제품 및 서비스를 광고하는 경우, 광고 관리 서버 는 해당 광고주 단말로부터 하나 이상의 캠페인 정보에 대응하는 광고주의 타겟팅 광고 제품 및 서비스를 수신하여 하나의 광고 플랫폼에 생성한다. 또한, 서로 다른 광고주 단말이 제공하는 타겟팅 광고 제품 및 서비스를 광고하는 경우, 광고 관리 서버는 서로 다른 개별 광고주 단말(400, 400a, 내지 400n)로부터 제공된 크로스 캠페인 정보에 대응하는 서로 다 른 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼1(500a)에 생성한다. 크로스 캠페인 정보는 각 광고주 단말(400, 400a, 내지 400n)로부터 제공되는 복수의 카테고리 정보 로 구성된 캠페인 정보(410, 410a)에 기반하여 타겟팅 대상을 판단하기 위한 비교정보일 수 있다. 광고 정보 관리부는 비교 결과를 분석하여 입력된 사용자 단말의 사용자가 타겟팅 광고 대상인지 판 단한다. 광고 정보 관리부는 사용자 단말이 등록된 기기인 경우, 사용자 단말과 연동된 사용자 프로파일 정보와 개별 광고주가 설정한 타겟 모수 정보와 비교하여 사용자 단말의 사용자가 타겟팅 광고 대상인지 조회할 수 있다. 여기서 캠페인 정보는 임의의 광고주 단말이 하나 이상의 카테고리 정보를 조합하여 생성된 캠 페인 정보로서, 카테고리 정보는 예를 들어, 연령, 성별, 시간, 요일, 웹 사이트, 앱, 광고 반응, 주제, 지역, 장소, 관심사, 키워드, 리타겟팅, 구매의도, 광고 지면의 게제 위치, 국가, 도시 등의 서로 다른 카테고 리로 구성될 수 있다. 예를 들어, 한 명의 광고주가 설정한 하나 이상의 캠페인 정보는 캠페인 1에 카테고리 정보 정보 중 에서 연령, 관심사를 반영하고, 캠페인 2는 성별, 키워드를 반영하여 설정될 수 있다. 또한, 서로 다른 광고주가 설정하는 경우, 제1 광고주에 의해 설정된 캠페인 정보는 캠페인 1.1에 카테고 리 정보 정보 중에서 연령, 관심사를 반영하고, 캠페인 1.2에 성별, 키워드를 반영하며, 캠페인 1.3에 시 간과 구매의도를 반영하여 설정될 수도 있다. 또한, 제2 광고주에 의해 설정된 캠페인 정보(410a)는 캠페인 2.1에 성별을 반영하고, 캠페인 2.2에 광고 반응 과 광고지면의 게재위치를 반영하며, 캠페인 2.3에는 요일과 도시를 반영하여 타겟팅 광고를 위한 캠페인 정보 가 설정될 수도 있다. 또한, 크로스 캠페인 정보는 각 광고주 단말(400, 400a, 내지 400n)에서 설정된 캠페인 정보 중에서 유사 한 캠페인 정보 또는 임의의 카테고리별로 분류한 캠페인 정보를 조합하여 구성될 수 있다. 광고 정보 관리부는 접속한 사용자 단말의 사용자가 타겟팅 광고 대상으로 판단되면, 하나의 광고주 가 제공한 캠페인 정보에 대응하는 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼에 구 성하여 웹 서버의 광고 지면으로 출력한다. 광고 플랫폼은 하나의 배너 광고로서, 복수의 광고 영역, 예를 들어 제1 광고 영역, 제2 광고 영역 및 제3 광고 영역으로 구획될 수 있다. 구획된 제1 광고 영역, 제2 광고 영역 및 제3 광고 영역에는 하나의 광고주 단말로부터 설 정된 캠페인 정보에 대응하는 제품 또는 서비스가 각각 노출되도록 배치된 멀티 배너 광고로 생성될 수 있 다. 즉, 멀티 배너 광고는 한명의 광고주로부터 설정된 캠페인 정보에 기반하여 하나의 배너 광고인 광고 플랫 폼에서 3개로 구획된 광고 영역중 제1 광고 영역에는 시간을 카테고리로 하여 타겟팅한 제품 또는 서 비스가 노출되도록 하고, 제2 광고 영역에는 주제를 카테고리로 하여 타겟팅한 제품 또는 서비스가 노출되 도록 하며, 제3 광고 영역에는 구매의도를 카테고리로 하여 타겟팅된 제품 또는 서비스가 노출되도록 구성 한다. 이러한 하나의 배너 광고에 서로 다른 타겟팅 광고가 노출되도록 함으로써, 광고주의 카테고리 선택에 대한 폭 을 증가시키고, 광고 효율이 향상될 수 있도록 한다. 또한, 광고 플랫폼은 제1 광고 영역, 제2 광고 영역 및 제3 광고 영역으로 노출되는 타겟 팅 광고에 대응하는 캠페인 메시지가 노출되는 광고 메시지 영역이 추가 구성될 수 있다. 또한, 크로스 캠페인 정보에 대응하는 각 광고주 단말(400, 400a, 내지 400n)의 타겟팅 광고 제품 및 서비 스를 하나의 광고 플랫폼1(500a)에 구성하여 웹 서버의 광고 지면으로 출력할 수 있다. 구획된 제1 광고 영역(510a), 제2 광고 영역(520a) 및 제3 광고 영역(530a)에는 서로 다른 광고주 단말(400, 400a, 내지 400n)로부터 설정된 크로스 캠페인 정보에 대응하는 제품 또는 서비스가 각각 노출되도록 교차 하여 배치된 크로스 배너 광고로 생성될 수 있다. 즉, 크로스 배너 광고는 타겟 모수에 기반하여 서로 다른 광고주로부터 수집된 크로스 캠페인 정보에 기반하여 하나의 배너 광고인 광고 플랫폼1(500a)에서 3개로 구획된 광고 영역중에서, 예를 들어 제1 광고 영역(510a)에 는 광고주 1의 시간을 카테고리로 하여 타겟팅한 제품 또는 서비스 광고가 노출되도록 하고, 제2 광고 영역 (520a)에는 광고주 2의 주제를 카테고리로 하여 타겟팅한 제품 또는 서비스가 노출되도록 하며, 제3 광고 영역 (530a)에는 광고주 3의 구매의도를 카테고리로 하여 타겟팅된 제품 또는 서비스가 노출되도록 구성할 수 있다. 따라서, 하나의 배너 광고에 서로 다른 광고주의 타겟팅 광고가 교차(Cross)하여 노출되도록 함으로써, 광고주 의 카테고리 선택에 대한 폭을 증가시키고, 광고 효율이 향상될 수 있도록 한다. 또한, 광고 플랫폼1(500a)은 제1 광고 영역(510a), 제2 광고 영역(520a) 및 제3 광고 영역(530a)으로 노출되는 타겟팅 광고에 대응하는 캠페인 메시지가 노출되는 광고 메시지 영역(540a)이 추가 구성될 수 있다. 또한, 광고 정보 관리부는 접속한 사용자 단말의 사용자가 타겟팅 광고 대상이 아니면, 광고주 단말 (400, 400a, 내지 400n)로부터 입력된 임의의 논타겟팅 광고 제품 또는 서비스를 하나의 광고 플랫폼(500, 500a)에 생성하여 웹 서버의 광고 지면을 통해 노출되도록 한다. 계속해서, 메시지 생성부는 광고 메시지 영역(540, 540a)으로 제공하기 위한 캠페인 메시지를 생성하는 구 성으로서, 사용자 프로파일 정보와 광고주 단말(400, 400a, 내지 400n)로부터 입력되는 타겟팅 광고 제품 및 서 비스와 관련된 프롬프트 데이터, 캠페인 정보(410, 410a) 및 카테고리 정보를 기반으로 최적의 캠페인 메 시지를 생성한다. 메시지 생성부는 사용자 프로파일 정보로부터 사용자의 페르소나를 추출할 수 있다. 즉, 메시지 생성부는 데이터베이스에 저장된 사용자의 접속 시간, 요일, 웹 페이지 정보, 앱 가입 정 보, 상품의 조회와 구매 성향, 구매 이력, 접속지 위치 정보, 배송지 정보, 광고 지면의 게제 위치 정보, 국가 정보, 도시 정보로부터 사용자의 페르소나를 추출하여 임베딩을 통해 벡터화 할 수 있다. 메시지 생성부는 광고주 단말(400, 400a, 내지 400n)로부터 입력되는 타겟팅 광고 제품 및 서비스와 관련 된 프롬프트 데이터, 캠페인 정보(410, 410a) 및 카테고리 정보로부터 키워드를 추출하여 임베딩을 통해 벡터화할 수 있다. 또한, 메시지 생성부는 추출된 사용자의 페르소나와 키워드별로 각 벡터의 위치 좌표값에 기반하여 페르소 나와 키워드 간의 관계를 수치적으로 표현할 수도 있다. 메시지 생성부는 추출된 사용자 페르소나와 키워드를 기반으로 시뮬레이션을 수행하여 타겟팅 대상을 고려 한 캠페인 메시지를 생성할 수 있다. 또한, 메시지 생성부는 과거의 사용자 구매 패턴을 학습한 인공지능(AI) 모델의 결과를 캠페인 메시지 생 성을 위한 시뮬레이션에 반영하여 최적의 캠페인 메시지를 예측 및 생성할 수 있다. 또한, 메시지 생성부는 접속한 사용자 단말의 사용자가 타겟팅 광고 대상이 아닌 경우, 광고주 단말 (400, 400a, 내지 400n)로부터 입력된 임의의 논타겟팅 광고 제품 또는 서비스와 관련된 키워드를 기반으로 캠 페인 메시지를 자동으로 생성할 수 있다. 데이터베이스는 사용자 단말 정보, 사용자 프로파일 정보, 광고주 단말(400, 400a, 내지 400n), 타겟 팅 광고 제품 및 서비스와 관련된 프롬프트 데이터, 캠페인 정보(410, 410a), 크로스 캠페인 정보 및 카테 고리 정보를 저장한다. 광고주 단말(400, 400a, 내지 400n)은 광고를 위한 캠페인 정보(410, 410a)를 제공하는 구성으로서, 서로 다른 광고주로 구성될 수 있다. 또한, 광고주 단말(400, 400a, 내지 400n)은 각 광고주가 하나 이상의 카테고리 정보를 조합하여 생성한 하나 이상의 캠페인 정보(410, 410a)를 제공할 수 있다. 캠페인 정보(410, 410a)는 각 광고주 단말(400, 400a, 내지 400n)이 복수의 카테고리 정보 정보 중에서 예 를 들어, 연령, 관심사를 반영한 캠페인 정보, 성별, 키워드를 반영한 캠페인 정보, 시간, 요일, 웹 사이트, 구 매의도 등을 반영한 캠페인 정보 등 다양한 캠페인 정보로 구성될 수 있다. 크로스 캠페인 정보는 각 광고주 단말(400, 400a, 내지 400n)에서 설정된 캠페인 정보 중에서 임의의 타겟 모수 정보에 기반하여 조합된 캠페인 정보일 수 있다. 카테고리 정보는 예를 들어, 연령, 성별, 시간, 요일, 웹 사이트, 앱, 광고 반응, 주제, 지역, 장소, 관심 사, 키워ㄷ, 리타겟팅, 구매의도, 광고 지면의 게제 위치, 국가, 도시 등의 서로 다른 카테고리로 구성될 수 있 다. 다음은 본 발명의 일 실시 예에 따른 믹스 배너 광고 방법을 설명한다. 도7은 본 발명의 일 실시 예에 따른 믹스 배너 광고 방법을 설명하기 위해 나타낸 흐름도이다. 도1 내지 도7에 나타낸 바와 같이, 광고 관리 서버는 웹 서버로부터 사용자 프로파일 정보를 포함한 사용자 단말 정보와 광고 지면의 호출 정보를 수신(S100)한다. 광고 관리 서버는 S100 단계에서 수신된 사용자 단말 정보를 분석(S110)하고, 사용자 단말이 등 록된 단말인지 판단(S120)한다. S120 단계의 판단 결과, 사용자 단말이 등록된 사용자 단말로 판단되면, 광고 관리 서버는 타겟 모수를 조회(S130)하여 사용자 단말의 사용자 프로파일 정보와 광고주 단말(400, 400a, 내지 400n)이 요청 한 임의의 타겟 모수 정보와 비교하여 타겟팅 광고 대상인지 판단(S140)한다. S140 단계의 판단 결과, 사용자 단말이 타겟팅 광고 대상으로 판단됨에 따라, 광고 관리 서버는 미리 설정된 광고 플랫폼 설정 정보에 따라 광고주를 결정하여 타겟 모수 정보에 기반한 하나의 광고주 단말이 제공하는 하나 이상의 캠페인 정보 또는 각 광고주 단말(400, 400a, 내지 400n)의 크로스 캠페인 정보 가 설정되도록 멀티 배너 광고 또는 크로스 배너 광고가 설정(S150)되도록 한다. S150 단계에서 하나의 광고주 단말이 제공하는 하나 이상의 캠페인 정보에 기반한 멀티 배너 광고이 면, 광고 관리 서버는 광고주 단말이 제공하는 하나 이상의 캠페인 정보에 대응하는 광고주의 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼에 생성(S160)한다. S160 단계에서 생성되는 광고 플랫폼은 복수의 광고 영역(510, 520, 530)으로 구획될 수 있다. 또한, 구획된 광고 영역(510, 520, 530)에는 하나의 광고주 단말로부터 설정된 캠페인 정보에 따른 제품 또는 서비스의 광고 정보가 각각 노출되도록 배치하여 멀티 배너 광고가 구성될 수 있도록 한다. 또한, S150 단계에서 생성되는 광고 플랫폼은 광고 영역(510, 520, 530)에 노출되는 광고 정보와 타겟팅 대상인 사용자 프로파일 정보를 반영한 캠페인 메시지가 광고 메시지 영역에 노출되도록 한다. 캠페인 메시지는 광고 관리 서버가 사용자 프로파일 정보로부터 사용자의 페르소나를 추출하고, 광고주 단 말로부터 입력되는 프롬프트 데이터, 캠페인 정보 및 카테고리 정보로부터 키워드를 추출하여 추출된 사용자 페르소나와 키워드를 기반으로 시뮬레이션을 통해 생성될 수 있다. 즉, 타겟팅 대상을 고려하여 최적의 캠페인 메시지를 생성하여 광고 메시지 영역을 통해 노출될 수 있도록 한다. 또한, S160 단계에서 서로 다른 광고주 단말(400, 400a, 내지 400n)이 제공하는 크로스 캠페인 정보에 기 반한 크로스 배너 광고이면, 광고 관리 서버는 각 광고주 단말(400, 400a, 내지 400n)의 크로스 캠페인 정 보를 조회하고, 조회된 크로스 캠페인 정보에 대응하는 타겟팅 광고 제품 및 서비스를 하나의 광고 플랫폼 1(500a)에 생성할 수 있다. 또한, 구획된 광고 영역(510a, 520a, 530a)에는 각 광고주 단말(400, 400a, 내지 400n)로부터 설정된 크로스 캠페인 정보에 따른 제품 또는 서비스의 광고 정보가 각각 노출되도록 배치하여 크로스 배너 광고가 구성 될 수 있도록 한다. 또한, S160 단계에서 생성되는 광고 플랫폼1(500a)은 광고 영역(510a, 520a, 530a)에 노출되는 광고 정보와 타 겟팅 대상인 사용자 프로파일 정보를 반영한 캠페인 메시지가 광고 메시지 영역(540a)에 노출되도록 한다.캠페인 메시지는 광고 관리 서버가 사용자 프로파일 정보로부터 사용자의 페르소나를 추출하고, 각 광고주 단말(400, 400a, 내지 400n)로부터 입력되는 프롬프트 데이터, 캠페인 정보 및 카테고리 정보로부터 키워드를 추출하여 추출된 사용자 페르소나와 키워드를 기반으로 시뮬레이션을 통해 생성될 수 있다. 즉, 타겟팅 대상을 고려하여 최적의 캠페인 메시지를 생성하여 광고 메시지 영역(540a)을 통해 노출될 수 있도 록 한다. 계속해서, 광고 관리 서버는 S160 단계에서 생성된 광고 플랫폼, 광고 플랫폼1(500a)을 웹 서버(20 0)의 광고 지면으로 출력하여 크로스 배너 광고가 노출(S170)되도록 한다. 한편, S140 단계의 판단 결과, 사용자 단말이 타겟팅 광고 대상이 아니면, 광고 관리 서버는 각 광고 주 단말(400, 400a, 내지 400n)로부터 입력된 임의의 논타겟팅 광고 제품 또는 서비스를 하나의 광고 플랫폼 에 논타겟팅 크로스 배너 광고로 생성하여 웹 서버의 광고 지면에 제공함으로써, 논타겟팅 광고에 노 출(S171)되도록 한다. 또한, S120 단계의 판단 결과, 사용자 단말이 기등록된 사용자 단말이 아니면, 광고 관리 서버는 신 규 사용자인지 확인하고, 신규 사용자 단말의 등록 여부를 판단(S131)한다. S131 단계의 판단 결과, 신규 사용자 단말의 등록 요청이 확인되면, 광고 관리 서버는 신규 입력되는 사용 자 프로파일 정보에 기반한 데이터 태깅과 신규 사용자 단말의 고유 정보를 수집하여 데이터베이스에 저장 (S151)한다. 또한, S131 단계의 판단 결과, 신규 사용자 단말의 등록이 요청되지 않으면, 광고주 단말로부터 입력된 임 의의 논타겟팅 광고 제품 또는 서비스를 하나의 광고 플랫폼에 논타겟팅 크로스 배너 광고로 생성하여 웹 서버의 광고 지면에 제공함으로써, 논타겟팅 광고에 노출(S171)되도록 한다. 따라서, 하나의 광고 플랫폼에 다수의 광고 영역을 구분하고, 구분된 광고 영역에 다양한 광고주가 제공하는 다 양한 타겟팅 광고를 적용하여 사용자에게 노출시킴으로써 광고 효율을 개선할 수 있다. 또한, 설정된 광고주에 따라 하나의 광고주 단말로부터 설정된 캠페인 정보에 따른 제품 또는 서비스의 광고 정 보가 각각 노출되도록 배치하는 멀티 배너 광고를 구성하거나 서로 다른 광고주 단말로부터 설정된 크로스 캠페 인 정보)에 따른 제품 또는 서비스의 광고 정보가 각각 노출되도록 배치하여 크로스 배너 광고가 구성될 수 있 도록 믹스된 배너 광고를 통해 효율적인 광고 서비스를 제공할 수 있다. 상기와 같이, 본 발명의 바람직한 실시 예를 참조하여 설명하였지만 해당 기술 분야의 숙련된 당업자라면 하기 의 특허청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수 정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 또한, 본 발명의 특허청구범위에 기재된 도면번호는 설명의 명료성과 편의를 위해 기재한 것일 뿐 이에 한정되 는 것은 아니며, 실시예를 설명하는 과정에서 도면에 도시된 선들의 두께나 구성요소의 크기 등은 설명의 명료 성과 편의상 과장되게 도시되어 있을 수 있다. 또한, 상술된 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관 례에 따라 달라질 수 있으므로, 이러한 용어들에 대한 해석은 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다."}
{"patent_id": "10-2023-0141464", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한, 명시적으로 도시되거나 설명되지 아니하였다 하여도 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명의 기재사항으로부터 본 발명에 의한 기술적 사상을 포함하는 다양한 형태의 변형을 할 수 있음은 자명하며, 이는 여전히 본 발명의 권리범위에 속한다. 또한, 첨부하는 도면을 참조하여 설명된 상기의 실시예들은 본 발명을 설명하기 위한 목적으로 기술된 것이며 본 발명의 권리범위는 이러한 실시예에 국한되지 아니한다."}
{"patent_id": "10-2023-0141464", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명의 일 실시 예에 따른 믹스 배너 광고 시스템의 구성을 나타낸 예시도. 도2는 도1의 실시 예에 따른 믹스 배너 광고 시스템의 광고 관리 서버의 구성을 나타낸 블록도. 도3은 도1의 실시 예에 따른 믹스 배너 광고 시스템의 타겟팅 설정을 설명하기 위해 나타낸 예시도. 도4는 도1의 실시 예에 따른 믹스 배너 광고 시스템의 타겟팅 설정을 설명하기 위해 나타낸 예시도. 도5는 도1의 실시 예에 따른 믹스 배너 광고 시스템의 광고 플랫폼을 설명하기 위해 나타낸 예시도. 도6은 도1의 실시 예에 따른 믹스 배너 광고 시스템의 광고 플랫폼을 설명하기 위해 나타낸 예시도. 도7은 본 발명의 일 실시 예에 따른 믹스 배너 광고 방법을 설명하기 위해 나타낸 흐름도."}
