{"patent_id": "10-2020-0169833", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0080800", "출원번호": "10-2020-0169833", "발명의 명칭": "인공지능 네트워크 시스템을 포함하는 배터리실", "출원인": "한국 전기안전공사", "발명자": "송길목"}}
{"patent_id": "10-2020-0169833", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "배터리(Battery) 또는 배터리랙(Battery Rack)과 배터리실의 상태 정보를 입력받는 입력부;상기 입력부를 통해 입력된 입력정보를 토대로 배터리 상태 모니터링, 배터리실 환경 상태 모니터링 및 전력시스템의 안전상태 모니터링을 위한 연산을 수행하는 연산부;미리 설정된 RPN(위험우선순위)에 따라 순차적으로 입력부의 입력정보와, 연산부의 연산결과를 토대로 분석하여배터리의 상태 변화를 파악하고, 배터리에 영향을 줄 수 있는 인자를 검출하는 분석부; 및상기 입력부의 입력정보 또는 연산부의 연산결과와, 분석부의 분석 결과를 토대로 RPN(위험우선순위)을 기반으로 하는 순차적 제어를 통해 배터리실의 안전장치를 동작하거나 알람을 발생하는 제어부를 포함하는 것을 특징으로 하는 인공지능 네트워크 시스템을 포함하는 배터리실."}
{"patent_id": "10-2020-0169833", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 입력부는 BMS(Battery Management System, 배터리관리시스템)와, PMS(Power Management System, 전력관리시스템) 및 RMS(Risk Management System, 위험관리시스템)를 포함하는 것을 특징으로 하는 인공지능 네트워크시스템을 포함하는 배터리실."}
{"patent_id": "10-2020-0169833", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 BMS는 배터리 온도, 배터리 셀 전압, 배터리랙 전압, 배터리랙 전류, SOC(State of Charge, 충전율) 및 셀반란싱(cell balancing) 데이터 중 적어도 하나를 입력받고,상기 PMS는 배터리실 내부에 설치되어 배터리실 외부로부터 입력되는 3상 교류 전원의 A, B, C전압값과 A, B, C전류값과, 배터리랙 전압 및 배터리랙 전류 중 적어도 하나를 입력받으며,상기 RMS는 배터리실 내부에 설치되어 배터리 절연상태 정보, 배터리랙의 접지 및 누설전류값, 배터리실의 실기압, CMV(Common Mode Voltage), 배터리실의 실온 및 습도, PCS 동작모드 데이터, AC SPD 및 DC SPD 데이터중 적어도 하나를 입력받는 것을 특징으로 하는 인공지능 네트워크 시스템을 포함하는 배터리실."}
{"patent_id": "10-2020-0169833", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 연산부는 미리 설정된 기준온도를 토대로 배터리실의 실온 및 배터리 온도를 비교하며, 상기 배터리실의실온과 배터리 온도 간의 편차를 연산하고, 배터리 셀 전압의 최대값(max)과 최소값(min) 간의 편차를연산하며, 배터리실의 습도에 대한 최대값(max)과 최소값(min)을 구하고, 배터리실의 온도에 따른 이슬점(Dewpoints)을 산출하는 것을 특징으로 하는 인공지능 네트워크 시스템을 포함하는 배터리실."}
{"patent_id": "10-2020-0169833", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,공개특허 10-2022-0080800-3-상기 연산부는 SOC(State of Charge, 충전율)가 100%일 때와 0%일 때의 편차를 연산하고, 배터리의 SOC(Stateof Charge, 충전율)가 100%일 경우 배터리 랙 전류 간의 편차를 연산하며, 배터리의 1회 충방전시 셀반란싱(cell balancing)을 연산하고, 시간(t)에 따른 배터리 셀 전압(V1)의 최소값(min)에 대한 기울기를 산출하는 것을 특징으로 하는 인공지능 네트워크 시스템을 포함하는 배터리실."}
{"patent_id": "10-2020-0169833", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 분석부는 배터리실의 온도 또는 배터리 온도의 변화에 따른 이슬점(Dew points)과, 시간의 변화에 따른 배터리 셀 전압 또는 배터리랙 전압의 편차(Deviation)와, 시간의 변화에 따른 셀발란싱(cell balancing)과, 시간의 변화에 따른 SOC 상태를 분석하는 것을 특징으로 하는 인공지능 네트워크 시스템을 포함하는 배터리실."}
{"patent_id": "10-2020-0169833", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 에너지저장장치(ESS, Energy Storage System)에서 배터리 상태 모니터링, 배터리실 환경 상태 모니터 링, 전력시스템의 안전상태 모니터링의 데이터를 수집하고, 수집된 데이터를 토대로 RPN(위험우선순위)을 기반으 로 하는 순차적 제어를 통해 ESS의 화재를 방지하고 전기설비의 안전을 확보하는 인공지능 네트워크 시스템을 포 (뒷면에 계속)"}
{"patent_id": "10-2020-0169833", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 네트워크 시스템을 포함하는 배터리실에 관한 것으로서, 더욱 상세하게는 에너지저장장치 (ESS, Energy Storage System)에서 배터리 상태 모니터링, 배터리실 환경 상태 모니터링, 전력시스템의 안전상 태 모니터링의 데이터를 수집하고, 수집된 데이터를 토대로 RPN(위험우선순위)을 기반으로 하는 순차적 제어를 통해 ESS의 화재를 방지하고 전기설비의 안전을 확보하는 인공지능 네트워크 시스템을 포함하는 배터리실에 관 한 것이다."}
{"patent_id": "10-2020-0169833", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 국내에서 발생한 총 28건의 ESS(Energy Storage System) 화재 조사 과정에서 나온 결과 중 하나인 통합관 리 부재에 대한 문제점을 해결하기 위하여 전기안전기술을 접목하여 체계적으로 판단하고 관리할 수 있는 시스 템이 요구된다. 특히, 국내에서 발생한 ESS 화재는 배터리실에 집중되어 있는데, 이때 배터리는 리튬이온을 기반으로 하는 배터 리로 구성된다. 환경적인 원인으로는 습도와 온도에 따른 결로 발생으로 절연 기능이 저하되면서 지락으로 인해 발생하는 화재가 있었으며, 배터리 취급상태의 불량으로 인한 화재 가능성도 추정되었다. 또한, 배터리 자체 문제에 있어서도 내부 마이크로쇼트 발생이 원인이 되어 셀의 온도가 상승하고 압력이 증가 하면서 열 폭주하는 사례가 발견된다. 이러한 화재가 발생하면 대체적으로 전소가 되어 수십억 원 또는 그 이상 의 경제적 손실이 발생하고, 복구 이후에도 전기안전에 대한 불안요소를 지속적으로 가지게 된다. 따라서, 다양 한 조건의 화재발생을 미연에 방지하기 위해 신호검출과 분석이 요구된다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2020-0081736호(2020년 07월 08일 공개)"}
{"patent_id": "10-2020-0169833", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명이 이루고자 하는 기술적 과제는 종래의 단점을 해결한 것으로서, 전기화재가 집중적으로 발생 하는 에너지저장장치(ESS, Energy Storage System)의 배터리실을 중심으로 하는 데이터 모니터링과 전기안전기술 적용을 통한 안전스킴을 통해 ESS 고장을 미리 파악하여 전기설비의 안전을 확보하고, 화재 발생시 즉각 대 응으로 피해를 최소화하고자 하는데 그 목적이 있다."}
{"patent_id": "10-2020-0169833", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 기술적 과제를 이루기 위한 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실은 입력부, CCTV, 연산부, 분석부, 제어부, 데이터베이스 및 디스플레이부를 포함한다. 상기 입력부는 배터리 (Battery) 또는 배터리랙(Battery Rack)과 배터리실의 상태 정보를 입력받는다. 또한, 상기 입력부는 BMS(Battery Management System, 배터리관리시스템)와, PMS(Power Management System, 전 력관리시스템) 및 RMS(Risk Management System, 위험관리시스템)를 포함한다. 상기 연산부는 입력부를 통해 입력된 입력정보를 토대로 배터리 상태 모니터링, 배터리실 환경 상태 모니터링 및 전력시스템의 안전상태 모니터링을 위한 연산을 수행한다. 상기 분석부는 미리 설정된 RPN(위험우선순위)에 따라 순차적으로 입력부의 입력정보와, 연산부의 연산결과를 토대로 분석하여 배터리의 상태 변화를 파악하고, 배터리에 영향을 줄 수 있는 인자를 검출한다. 상기 제어부는 입력부의 입력정보 또는 연산부의 연산결과와, 분석부의 분석 결과를 토대로 RPN(위험우선순위) 을 기반으로 하는 순차적 제어를 통해 배터리실의 안전장치를 동작하거나 알람을 발생한다. 상기 데이터베이스는 입력부의 입력정보와 연산부의 연산결과를 저장한다. 또한, 상기 데이터베이스는 분석부의 분석 결과와 CCTV에서 촬영된 동영상을 저장한다. 또한, 상기 디스플레이부는 제어부의 제어에 따라 입력부의 입력정보와, 연산부의 연산결과를 디스플레이한다. 또한, 상기 디스플레이부는 분석부의 분석 결과와 CCTV에서 촬영된 동영상을 디스플레이한다."}
{"patent_id": "10-2020-0169833", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이, 본 발명에 따른 인공지능 네트워크 시스템을 포함하는 배터리실은 전기화재가 집중 적으로 발생하는 ESS(Energy Storage System)의 배터리실을 중심으로 하는 데이터 모니터링과 전기안전기술 적 용을 통한 안전스킴을 통해 ESS 고장을 미리 파악하여 설비의 안전을 확보하고, 화재 발생시 즉각 대응으로 피 해를 최소화할 수 있는 효과가 있다. 또한, ESS의 배터리실에서 출력되는 다양한 신호를 하나로 패키지하고 안전하게 관리할 수 있는 효과가 있다. 또한, 현장에서 지속적인 데이터 분석을 통해 배터리실 상태의 건전성과 배터리 이력 관리에 효율적으로 대응할 수 있는 효과가 있다. 또한, 국내에서 적용되는 전기안전검사제도에 적합하여 전기안전 업무의 효율성과 편이성 을 확보할 수 있는 효과가 있다."}
{"patent_id": "10-2020-0169833", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재 된 \"…부\", \"…기\", \"…모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하 드웨어나 또는 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예를 설명함으로써, 본 발명을 상세히 설명한다. 각 도면에 제시된 동일한 참조 부호는 동일한 부재를 나타낸다. 도 1은 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실의 개념도이고, 도 2는 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실의 블록도이며, 도 3은 본 발명의 실 시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실의 구성도이다. 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실은 리튬배터리 기반의 에너지저장 장치(ESS, Energy Storage System)에서 주요 안전 이슈에 해당하는 배터리 상태 모니터링, 배터리실 환경 상태 모니터링, 전력시스템의 안전상태 모니터링에 대한 결과 데이터를 수집하고, 분석알고리즘 적용을 통해 순차적 제어가 가능하도록 함으로써 무인 관리가 가능한 배터리실 운영과 더불어 화재 발생시 소실될 수 있는 데이터를 안전하게 저장할 수 있다. 즉, 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실은 배터리실을 지능화하여 내 부의 배터리 및 전력 상태와 환경상태의 데이터를 동시에 저장 및 분석할 수 있다. 또한, 수집과 분석된 데이터는 온라인 인터페이스를 통해 서버로 전송하여 배터리실의 모니터링을 위한 적정한 데이터의 수집과 분석이 가능하고, 수집 데이터의 안전한 저장과 이동관리가 가능하며, 배터리실 내 부를 보지 않아도 내부의 상태를 모니터링할 수 있는 디스플레이부를 통해 현장에서 어려움을 갖는 불안전 요소를 해결할 수 있다. 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실은 배터리실 내에 설치되어 배터리랙에 연결되는 인공지능 네트워크 시스템을 포함할 수 있다. 또한, 인공지능 네트워크 시스템 은 입력부, CCTV, 연산부, 분석부, 제어부, 데이터베이스 및 디스플레이 부를 포함할 수 있다. 또한, 입력부는 BMS(Battery Management System, 배터리관리시스템)와, PMS(Power Management System, 전력관리시스템) 및 RMS(Risk Management System, 위험관리시스템)를 포함한다. 또한, BMS는 배터리랙에 연결되어 배터리의 상태 정보를 입력받는다. 즉, BMS는 배터리 온 도(T2), 배터리 셀 전압(V1), 배터리랙 전압(V3), 배터리랙 전류(C3), SOC(State of Charge, 충전율)(S1) 및 셀반란싱(cell balancing)(A1)을 입력받는다. 또한, PMS는 배터리실 내부에 설치되어 배터리실 외부로부터 입력되는 3상 교류 전원의 A, B, C전 압값(순서대로 V4, V5, V6)과 A, B, C전류값(순서대로 C4, C5, C6)과, 배터리랙 전압(V3) 및 배터리랙 전류 (C3)를 입력받는다. 또한, RMS는 배터리실 내부에 설치되어 배터리 절연상태(B1), 배터리랙의 접지 및 누설전류 (C1), 배터리실의 실 기압(P1), CMV(Common Mode Voltage)(V2), 배터리실의 실온(T1) 및 습도(H1), PCS 동작모드(P1/P2), AC SPD(D1) 및 DC SPD(D2)를 입력받는다. 이때, 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실은 온도 측정부, 습도 측정부, 전압 측정부 및 전류 측정부를 더 포함할 수 있다. 온도 측정부는 배터리 또는 배터리랙의 온도와, 배터리실의 온도를 측정한다. 또한, 습도 측정부는 배터리실 내의 습도를 측정한다. 또한, 전압 측정부는 배터리랙 또는 배터리(20 1)의 전압을 측정한다. 또한, 전류 측정부는 배터리랙 또는 배터리의 전류를 측정한다. 또한, CCTV는 제어부의 제어에 따라 배터리랙 및 배터리실 내부의 동영상을 촬영한다. 또한, 연산부는 입력부를 통해 입력된 입력정보를 토대로 배터리 상태 모니터링, 배터리실 환경 상태 모니터링 및 전력시스템의 안전상태 모니터링을 위한 연산을 수행한다. 즉, 연산부는 미리 설정된 기준온도를 토대로 배터리실의 실온(T1) 및 배터리 온도(T2)를 비교한다. 또한, 배터리실의 실온(T1)와 배터리 온도(T2) 간의 편차를 연산하고, 배터리 셀 전압(V1)의 최대값(max)과최소값(min) 간의 편차를 연산한다. 또한, 연산부는 배터리실의 습도(H1)에 대한 최대값(max)과 최소값(min)을 구하고, 배터리실의 온 도(T)에 따른 이슬점(Dew points)을 산출한다. 또한, 연산부는 SOC(State of Charge, 충전율)(S1)가 100%일 때와 0%일 때의 편차(V7)를 연산한다. 또한, 배터리의 SOC(State of Charge, 충전율)(S1)가 100%일 경우 배터리랙 전류(C3) 간의 편차를 연산한다. 또한, 연산부는 배터리의 1회 충방전시 셀반란싱(cell balancing)(A1)을 연산한다. 또한, 연산부 는 SOC(State of Charge, 충전율)(S1)가 0%일 경우 배터리 셀 전압(V1)의 최소값(min)을 구하고, 시간 (t)에 따른 배터리 셀 전압(V1)의 최소값(min)에 대한 기울기를 산출한다. 또한, 연산부는 배터리에 대한 0%~90%까지의 충전율을 산출한다. 또한, 분석부는 미리 설정된 RPN(위험우선순위)에 따라 순차적으로 입력부의 입력정보와, 연산부 의 연산결과를 토대로 분석하여 배터리의 상태 변화를 파악하고, 배터리에 영향을 줄 수 있는 인자를 검출한다. 즉, 분석부는 배터리실의 온도 또는 배터리 온도(T2)의 변화에 따른 이슬점(Dew points)을 분석 할 수 있다. 또한, 분석부는 시간(t)의 변화에 따른 배터리 셀 전압(V1) 또는 배터리랙 전압(V3)의 편차 (Deviation)를 분석할 수 있다. 또한, 분석부는 시간(t)의 변화에 따른 셀발란싱(cell balancing)과, 시간(t)의 변화에 따른 SOC 상태를 분석할 수 있다. 또한, 제어부는 입력부, CCTV, 연산부, 분석부, 데이터베이스 및 디스플레이부 를 제어한다. 또한, 제어부는 데이터베이스에 저장된 데이터를 서버에 전송하여 저장한다. 즉, 제어부는 입력부의 입력정보 또는 연산부의 연산결과와, 분석부의 분석 결과 및 CCTV에서 촬영된 동영상 데이터를 인터넷 인터페이스를 통해 서버로 전송하여 저장한다. 또한, 제어부는 입력부의 입력정보 또는 연산부의 연산결과와, 분석부의 분석 결과를 토대 로 RPN(위험우선순위)을 기반으로 하는 순차적 제어를 통해 배터리실의 안전장치를 동작하거나 알람을 발생 함으로써 ESS(Energy Storage System)의 화재를 방지하고 전기설비의 안전을 확보할 수 있다. 즉, 미리 설정된 RPN(위험우선순위)에 따라 위험 순위가 높은 순서대로 전기설비의 전력을 차단하거나 안전장치 의 동작을 개방한다. 예를 들어, 제어부는 수집된 데이터를 토대로 공조기를 제어하고, 방압변을 개방할 수 있다. 또한, 제어부 는 수집된 데이터를 토대로 DC 차단기 또는 AC 차단기를 개방하거나 소화 장치를 개방할 수 있다. 이때, 제어부는 분석부를 통해 분석되는 데이터 분석의 변화율(0%~100%)에 따라 위험율을 판단한다. 이를 통해 전기설비의 사고 및 화재를 자체적으로 예방함은 물론 외부관리자에게 신속하게 통보하여 알릴 수 있 다. 또한, 데이터베이스는 입력부의 입력정보와, 연산부의 연산결과를 저장한다. 또한, 데이터베이 스는 분석부의 분석 결과와, CCTV에서 촬영된 동영상을 저장한다. 이때, 데이터베이스는 배터리와 이격되어 설치됨으로써 배터리실 내부 화재에 의한 직접적인 화 염으로부터 보호된다. 또한, 데이터베이스는 블랙박스 기능을 통해 현장의 데이터를 저장한다. 즉, 데이터 베이스는 화재시에도 저장된 데이터가 손상되지 않고 유지되도록 블랙박스의 내열성과 내구성을 갖는다. 디스플레이부는 제어부의 제어에 따라 입력부의 입력정보와, 연산부의 연산결과를 디스플 레이한다. 또한, 분석부의 분석 결과와, CCTV에서 촬영된 동영상을 디스플레이한다. 이때, 디스플레이부는 배터리실의 외부 격판에 설치된다. 이를 통해 현장의 작업자가 실시간으로 배터 리실 내부 상태를 모니터링할 수 있다. 또한, 배터리실에서 배터리랙은 미리 설정된 이격 거리에 따라 안전이격되도록 배치된다. 또한, 배터 리실은 방압변, 항온항습설비, TSP(transient suppression plate)와 접지본딩 연결단자가 구비되고, 내부 의 배터리랙 간 순환전류를 방지하기 위한 격판이 설치된다.또한, 배터리실의 외부에는 임피던스의 저하를 위한 접지 시스템이 구비된다. 예를 들어, 배터리실의 모서리에 4개의 접지선이 연결될 수 있다. 이로 인해, 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실은 RPN(위험우선순 위)을 기반으로 하는 순차적 제어를 통해 ESS(Energy Storage System)의 화재를 방지할 수 있다. 또한, ESS 고 장을 사전에 미리 파악하여 전기설비의 안전을 확보할 수 있고, 배터리실의 화재 발생시 즉각 대응으로 피 해를 최소화할 수 있는 효과가 있다. 또한, 인터넷 정보기술을 기반으로 산지 또는 산간벽지 등에 독립하여 설치된 ESS의 안전을 통합관제하고, 데이 터의 분석을 통한 ESS의 독립적인 판단과 상태관리가 가능한 지능형 배터리실을 공급할 수 있는 효과가 있 다. 또한, ESS 설비의 안정화와, 표준모델을 통한 소용량 배터리실의 설계에 효과적으로 대응할 수 있다. 또한, 배터리실의 환경적 요인과 전기적 요인 및 배터리 자체 영향에 따른 단계적 열화 구조를 판단할 수 있 다. 또한, 위험우선순위에 의한 순차적 제어를 통해 ESS의 화재에 대하여 신속하고 효과적인 대응이 가능하다. 이상으로 본 발명에 관한 바람직한 실시예를 설명하였으나, 본 발명은 상기 실시예에 한정되지 아니하며, 본 발"}
{"patent_id": "10-2020-0169833", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명의 실시예로부터 당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의한 용이하게 변경되어 균등하 다고 인정되는 범위의 모든 변경을 포함한다."}
{"patent_id": "10-2020-0169833", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실의 개념도이다. 도 2는 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실의 블록도이다. 도 3은 본 발명의 실시 예에 따른 인공지능 네트워크 시스템을 포함하는 배터리실의 구성도이다."}
