{"patent_id": "10-2020-0009804", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0096403", "출원번호": "10-2020-0009804", "발명의 명칭": "인공지능 기반의 최적배차 시스템 및 이를 위한 방법", "출원인": "(주)서울소프트", "발명자": "노병진"}}
{"patent_id": "10-2020-0009804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 기반의 최적배차 시스템을 위한 방법에 있어서,배차 기준 정보 및 학습 데이터를 기반으로 계획 배차를 위한 기준 배차 정보를 생성하는 단계;제1 운행 회차를 운행하는 버스의 도착 예정 시간이 상기 기준 배차표 정보에 따른 기준 배차 시간을 초과하는지 여부를 판단하는 단계;상기 제1 운행 회차의 도착 예정 시간이 상기 기준 배차표 정보에 따른 제2 운행 회차를 위한 기준 배차 시간을초과한다고 판단될 때, 자동 배차 조정 계산법에 따른 조정 시간을 기반으로 다음 운행 회차의 배차 간격을 조정하는 단계;조정된 배차 시간을 기반으로 상기 기준 배차 정보를 갱신하는 단계; 및상기 갱신된 기준 배차 정보를 운전자의 스마트폰으로 송신하는 단계를 포함하는 방법."}
{"patent_id": "10-2020-0009804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 배차 기준 정보는 상기 버스와 연관된 차량 정보, 상기 버스의 운행 횟수 및 상기 버스의 기본 배차 간격을 포함하는 방법."}
{"patent_id": "10-2020-0009804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 버스가 운행하는 버스 노선의 마지막 정류소에서 차고지까지 이동하기 위한 평균 도착시간을 도출하는 단계를 더 포함하되,상기 평균 도착시간은 공공 데이터 포탈에서 제공하는 버스도착 정보조회 서비스 API를 통해 누적된 운행 데이터를 기반으로 예측되는 정보인, 방법."}
{"patent_id": "10-2020-0009804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 조정 시간은 상기 도착 예정 시간이 상기 기준 배차 시간을 초과하지 않는 범위에서 결정되는 값인 방법."}
{"patent_id": "10-2020-0009804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 학습 데이터는 정류장 도착시간과 연관된 버스 운행 데이터를 기반으로 RNN 학습을 수행하여 생성된 데이터인 방법."}
{"patent_id": "10-2020-0009804", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템을 위한 방법은, 배차 기준 정보 및 학습 데이터를 기반 으로 계획 배차를 위한 기준 배차 정보를 생성하는 단계; 제1 운행 회차를 운행하는 버스의 도착 예정 시간이 기 준 배차표 정보에 따른 기준 배차 시간을 초과하는지 여부를 판단하는 단계; 제1 운행 회차의 도착 예정 시간이 기준 배차표 정보에 따른 제2 운행 회차를 위한 기준 배차 시간을 초과한다고 판단될 때, 자동 배차 조정 계산법 에 따른 조정 시간을 기반으로 다음 운행 회차의 배차 간격을 조정하는 단계; 조정된 배차 시간을 기반으로 기준 배차 정보를 갱신하는 단계; 및 갱신된 기준 배차 정보를 운전자의 스마트폰으로 송신하는 단계를 포함한다."}
{"patent_id": "10-2020-0009804", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서는 인공지능 기반의 최적배차 시스템 및 이를 위한 방법에 관한 것으로, 더 상세하게는 실시간으로 배 차 간격의 조정이 가능한 인공지능 기반의 최적배차 시스템 및 이를 위한 방법에 관한 것이다."}
{"patent_id": "10-2020-0009804", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "버스의 경우에는 일반적으로 배차 간격이 지하철 등에 비해 다소 길뿐 아니라, 교통 혼잡 시 버스 배차 간격이 배차 계획보다 지연될 수 있는 문제점이 있다. 특히, 종래 버스 배차 편성자의 임의에 따른 버스 배차 편성으로 인하여 배차 편성표와 실제 도로 상황 및 승객 수요가 맞지 않는 문제가 존재하였다. 또한, 버스 회사의 배차 담당자가 매일 수기로 배차 편성표를 작성해야 되는 불편함이 있었다. 한편, 순환 인공 신경망(Recurrent neural network, RNN)은 인공 신경망의 한 종류로, 유닛간의 연결이 순환적 구조를 갖는 특징이 있다. 순환 인공 신경망(RNN)은 내부의 메모리를 이용하여 시퀀스 형태의 입력을 처리할 수 있기 때문에, 시계열 분석 혹은 자연어 처리 등과 같이 시변적 특성을 가지는 데이터 처리에 널리 사용된다."}
{"patent_id": "10-2020-0009804", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서의 목적은 도로 상황 및 버스 운행 상태를 고려하여 버스 배차 간격의 조정이 가능한 인공지능 기반의 최적배차 시스템 및 이를 위한 방법을 제공하는데 있다."}
{"patent_id": "10-2020-0009804", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템을 위한 방법은, 배차 기준 정보 및 학습 데이터를 기반 으로 계획 배차를 위한 기준 배차 정보를 생성하는 단계; 제1 운행 회차를 운행하는 버스의 도착 예정 시간이 기준 배차표 정보에 따른 기준 배차 시간을 초과하는지 여부를 판단하는 단계; 제1 운행 회차의 도착 예정 시간 이 기준 배차표 정보에 따른 제2 운행 회차를 위한 기준 배차 시간을 초과한다고 판단될 때, 자동 배차 조정 계 산법에 따른 조정 시간을 기반으로 다음 운행 회차의 배차 간격을 조정하는 단계; 조정된 배차 시간을 기반으로 기준 배차 정보를 갱신하는 단계; 및 갱신된 기준 배차 정보를 운전자의 스마트폰으로 송신하는 단계를 포함한 다."}
{"patent_id": "10-2020-0009804", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 일 실시 예에 따르면, 도로 상황 및 버스 운행 상태를 고려하여 버스 배차 간격의 조정이 가능한 인공지능 기반의 최적배차 시스템 및 이를 위한 방법이 제공될 수 있다."}
{"patent_id": "10-2020-0009804", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 특성 및 이하 상세한 설명은 모두 본 명세서의 설명 및 이해를 돕기 위한 예시적인 사항이다. 즉, 본 명 세서는 이와 같은 실시 예에 한정되지 않고 다른 형태로 구체화될 수 있다. 다음 실시 형태들은 단지 본 명세서 를 완전히 개시하기 위한 예시이며, 본 명세서가 속하는 기술 분야의 통상의 기술자들에게 본 명세서를 전달하 기 위한 설명이다. 따라서, 본 명세서의 구성 요소들을 구현하기 위한 방법이 여럿 있는 경우에는, 이들 방법중 특정한 것 또는 이와 동일성 있는 것 가운데 어떠한 것으로든 본 명세서의 구현이 가능함을 분명히 할 필요 가 있다. 본 명세서에서 어떤 구성이 특정 요소들을 포함한다는 언급이 있는 경우, 또는 어떤 과정이 특정 단계들을 포함 한다는 언급이 있는 경우는, 그 외 다른 요소 또는 다른 단계들이 더 포함될 수 있음을 의미한다. 즉, 본 명세 서에서 사용되는 용어들은 특정 실시 형태를 설명하기 위한 것일 뿐이고, 본 명세서의 개념을 한정하기 위한 것 이 아니다. 나아가, 발명의 이해를 돕기 위해 설명한 예시들은 그것의 상보적인 실시 예도 포함한다. 본 명세서에서 사용되는 용어들은 본 명세서가 속하는 기술 분야의 통상의 기술자들이 일반으로 이해하는 의미 를 갖는다. 보편적으로 사용되는 용어들은 본 명세서의 맥락에 따라 일관적인 의미로 해석되어야 한다. 또한, 본 명세서에서 사용되는 용어들은, 그 의미가 명확히 정의된 경우가 아니라면, 지나치게 이상적이거나 형식적인 의미로 해석되지 않아야 한다. 이하 첨부된 도면을 통하여 본 명세서의 실시 예가 설명된다. 도 1은 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템을 포함하는 버스 운행 정보 안내 시스템의 전체 구성도이다. 도 1을 참조하면, 본 일 실시 예에 따른 버스 운행 정보 안내 시스템은 버스, GPS(Global Positioning System) 위성, 기지국(12a), 이동통신 서비스 시스템, 버스 정보 시스템(Bus Information System; 이 하, BIS) 센터, 버스 관제 시스템 그리고 인공지능 기반 최적 배차 시스템을 포함할 수 있다. 예를 들어, 버스는 일반적으로 승객을 목적지까지 운송하기 위한 교통 수단으로서, 버스 운행 안내 장치(미 도시)가 구비될 수 있다. GPS 위성은 지구상의 이동체의 위치를 거리 및 거리변동 속도계산에 의해 측정하기 위한 장치이다. 4개 이 상의 GPS 위성에 의해 이동체(예로, 버스)의 위치정보가 획득될 수 있다. 기지국(12a) 및 이동 통신 시스템은 버스에 구비된 버스 운행 안내 장치(미도시) 혹은 운전자의 핸드폰 (예로, APP)으로부터 통신망을 거쳐 수신된 음성 데이터, 문자 데이터, 영상 데이터, 위치 데이터를 BIS 센터 로 송신할 수 있다. 한편, 기지국(12a) 및 이동 통신 시스템은 BIS 센터로부터 수신된 음성 데이터, 문자 데이터 및 최적배 차 편성정보를 버스의 버스 운행 안내 장치 혹은 운전자의 핸드폰(예로, APP)으로 송신할 수 있다. BIS 센터는 버스에 구비된 버스 운행 안내 장치(미도시) 혹은 운전자의 핸드폰(예로, APP)으로부터 수 신된 음성 데이터, 문자 데이터, 영상 데이터 및 위치 데이터를 버스를 관리하는 버스 관제 센터로 송 신할 수 있다. 또한, 수신된 위치 데이터 및 도착 시간 산출 알고리즘을 기반으로 생성된 최적배차 편성정보에 따른 해당 버 스의 도착 예정 시간 데이터는 통신망을 거쳐 해당 버스의 도착 예정 정류장에 설치된 정류장 단말기 로 송신될 수 있다. 버스 관제 센터는 BIS 센터로부터 음성 데이터, 문자 데이터, 위치 데이터를 수신하고, 수신된 관련 데 이터를 이용하여 미리 지정된 방법(예로, 지도 이미지 상에 당해 버스의 현재 위치 표시)으로 당해 버스의 현재 위치, 교통 상황 등을 모니터상에 디스플레이할 수 있다. 인공지능 기반 최적 배차 시스템은 BIS 센터로부터 API(Application Programming Interface)를 기반 으로 버스 운행과 연관된 공공 데이터를 수신할 수 있다. 예를 들어, 공공 데이터는 각 버스 노선 별 버스 정류 장의 출발 시간 및 도착 시간과 연관된 정보를 포함할 수 있다. 인공지능 기반 최적 배차 시스템은 기 획득된 공공 데이터를 기반으로 학습된 인공지능을 기반으로 도로 상황 및 버스 운행 상태를 고려하여 버스 배차 간격을 조정할 수 있다. 예를 들어, 기 획득된 공공 데이터는 후술될 순환 인공 신경망(RNN) 기법을 이용하여 인공지능 기반 최적 배차 시스템에 학습될 수 있다. 인공지능 기반 최적 배차 시스템에 의해 생성된 최적배차 편성정보 혹은 알람 정보는 버스에 구비된 버스 운행 안내 장치(미도시) 혹은 운전자의 핸드폰(예로, APP)으로 송신될 수 있다. 이하, 후술되는 관련 도면을 참조하여 본 일 실시 예에 다른 인공지능 기반 최적 배차 시스템이 더 상세하게 설 명된다.도 2은 RNN의 기본 개념을 설명하기 위한 도면이다. 도 2를 참조하면, 현재 상태의 히든 state(t)는 직전 시점의 히든 state(t-1)을 기반으로 갱신될 수 있다. 한편, 현재 상태의 ouput은 현재 상태의 히든 state(t)를 기반으로 갱신될 수 있다. 예를 들어, 히든 state를 위한 활성함수(activation function)는 비선형 함수인 하이퍼볼릭탄젠트(tanh)일 수 있다. 도 3은 RNN의 다양한 구현 방식을 보여주는 도면이다. 예를 들어, One to One 방식은 t 시점에 수신된 데이터를 기반으로 출력 데이터를 생성하는 방식이다. One to One 방식의 일 예는 이미지 분류(image classification)일 수 있다. 예를 들어, One to Many 방식은 t 시점에 수신된 하나의 데이터를 기반으로 복수의 출력 데이터를 생성하는 방 식이다. One to Many 방식의 일 예는 이미지를 읽어 들인 후 해당 이미지에 다양한 심볼(사람, 개 등)이 포함되 는지 여부를 확인하는 경우일 수 있다. 예를 들어, Many to One 방식은 복수의 시점에 수신된 복수의 데이터를 기반으로 하나의 출력 데이터를 생성하 는 방식이다. Many to One 방식의 일 예는 text 등의 sequence 데이터를 기반으로 호불호 분석(sentiment analysis)을 수행하는 경우일 수 있다. 예를 들어, Many to Many 방식은 본 일 실시 예에 적용되는 방식으로 복수의 시점에 수신된 복수의 데이터를 기 반으로 하나의 복수의 데이터를 생성하는 방식이다 본 명세서에 따른 구현 방식은 단방향(unidirectional), 양방향(bidirectional), many-to-one/many-to-many, 단층구조/다층구조 (multi-layered LSTM, stacked LSTM) 등이 있을 수 있으며ㅑ, 이들을 서로 조합하면서 다양 한 방식으로 구성할 수 있다. 도 4는 LSTM(Long Short Term Memory networks)을 설명하기 위한 블록도이다. 본 명세서에서, LSTM(Long Short Term Memory networks)는 RNN의 특별한 종류로 이해될 수 있다. 도 4를 참조하면, LSTM은 단일 뉴럴 네트워크 구조를 대신하여, 4개의 상호작용이 가능한 레이어가 반복되는 구 조로 구현될 수 있다. 예를 들어, 도 4의 각 라인은 벡터를 의미하며, 각 출력 값은 다른 노드의 입력 값으로 전달될 수 있다. 예를 들어, 도 4의 네모 기호는 뉴럴 네트워크의 단위를 나타내며, 도 4의 원 기호는 점 단위 연산(예로, 벡터 합 연산)이 수행되는 구성을 나타낼 수 있다. 한편, 도 4의 블록도의 상단의 수평선은 LSTM의 셀 스테이트(cell state)이며, 각 단계에서 출력되는 정보는 전 체 체인을 관통하여 계속적으로 다음 단계로 전달될 수 있다. 예를 들어, LSTM은 셀 스테이트에 추가된 게이트(gate)를 기반으로 출력된 정보를 선택적으로 더하거나 제거할 수 있다. 일 예로, 게이트(gate)들은 시그모이드 뉴럴넷(sigmoid neural net layer) 및 점 단위 곱 연산으로 구현될 수 있다. 시그모이드 뉴럴넷은 0 혹은 1의 값을 출력할 수 있으며, 해당 값은 각 구성요소가 미래의 결 과에 어느 정도의 영향을 주는지를 결정하는데 이용될 수 있다. 도 5는 본 일 실시 예에 따른 LSTM을 기반으로 학습 및 예측이 수행되는 방법을 설명하기 위한 도면이다. 도 1 내지 도 5를 참조하면, 전날 데이터에 LSTM이 적용되어 다음날 데이터가 생성될 수 있다. 이 경우, 다음날 데이터에는 LSTM의 역전파(Back Propagation)가 적용될 수 있다. 한편, 전날 데이터에 LSTM이 적용되어 다음날을 위해 예측된 데이터가 생성될 수 있다. 도 6은 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템에 의한 최적 배차를 설명하기 위한 도면이다. 본 일 실시 예의 명확하고 간결한 이해를 위하여, 1개의 노선을 운행하는 버스 회사 소속의 40대의 버스가 1일 에 5회 반복 운행하여 총 200회 운행되는 것을 가정할 수 있다. 도 6의 (a)를 참조하면, 도 6의 (a)의 가로축은 1개의 노선의 운행 회차이고, 도 6의 (a)의 세로축은 운행 회차 에 상응하는 차고지로부터 마지막 정류장까지의 운행시간으로 이해될 수 있다. 이 경우, 운행시간이 가장 오래 걸린 P1 운행 회차는 출근 시간대와 연관되고, P2 운행 회차는 퇴근 시간대와 연관될 수 있다.도 6의 (b)를 참조하면, 도 6의 (b)의 가로축은 1개의 노선의 운행 회차이고, 도 6의 (b)의 세로축은 운행 회차 에 따른 배차 간격으로 이해될 수 있다. 이 경우, 운행시간이 가장 오래 걸린 P1 운행 회차와 P2 운행 회차에 가장 짧은 배차 간격이 설정되는 것이 바 람직할 수 있다. 즉, 도 6의 (b)의 이상적인 배차 간격 그래프은 도 6의 (a)의 운행 시간 그래프와 반대 경향으 로 나타날 수 있다.. 한편, 버스 업체의 현실 배차 간격은 도 6의 (b)의 운행 시간 그래프와 같은 경향으로 나타나는 것이 일반적이 다. 본 일 실시 예에 따른 도 6의 (b)의 인공지능 최적 배차에 따른 그래프는 현실 배차와 이상적인 배차 사이 값을 기반으로 생성될 수 있다. 도 7은 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템이 하나의 버스 노선에 적용되는 과정을 설명하 기 위한 도면이다. 도 1 내지 도 7을 참조하면, 하나의 버스 노선이 제1 내지 제8 정류장(TM_1~TM_8)을 포함한다고 가정할 수 있다. 또한, 각 버스(B#1,…, B#6)는 미리 결정된 배차 간격에 따라 운행될 수 있다. 도 7의 제1 정류장(TM_1)은 해당 버스 노선의 기점인 차고지로 이해될 수 있다. 또한, 도 7의 제1 정류장(TM_ 1)은 계획 배차에 따른 배차 시간 정보의 기준 지점으로 이해될 수 있다. 제2 내지 제 7 정류장(TM_2~TM_7)는 버스가 운행되는 중간 정류장으로 이해될 수 있다. 한편, 제8 정류장(TM_ 8)은 해당 버스 노선의 종점으로 이해될 수 있다. 각 버스(B#1,…, B#6)는 종점인 제8 정류장(TM_8)을 거쳐 차 고지인 제1 정류장(TM_1)으로 복귀할 수 있다. 도 8은 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템에 의한 계획 배차 및 배차 시간 조정 과정을 설 명하기 위한 도면이다. 도 1 내지 도 8을 참조하면, 특정 노선에 포함된 복수의 정류장은 도 8의 행 정보와 연관되고, 특정 노선을 운 행하는 버스는 도 8의 열 정보와 연관될 수 있다. 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템은 계획 배차를 위한 출발 시간 정보(TB_start)를 생성 할 수 있다. 즉, 도 8의 제1 정류장(TM_1)에 상응하는 열 정보는 계획 배차를 위한 출발시간정보(TB_start)로 이해될 수 있 다. 예를 들어, 출발 타임 테이블 정보(TB_start)는 배정된 운전 기사의 APP을 통해 전달될 수 있다. 예를 들어, 계획배차를 위한 출발시간정보(TB_start)에는 일정한 시간 간격(예로, 8분 간격)을 갖도록 생성될 수 있다. 예를 들어, 도 8의 출발 타임 테이블 정보(TB_start)에 포함된 '4:10'은 제1 버스(B#1)가 제1 정류장(TM_1)에 도착하여 승객을 태우고 출발하는 시간으로 이해될 수 있다. 또한, 도 8의 출발 타임 테이블 정보(TB_start)에 포함된 '4:18' 은 제2 버스(B#2)가 제1 정류장(TM_1)에 도착 하여 승객을 태우고 출발하는 시간으로 이해될 수 있다. 예를 들어, 도 8의 출발 타임 테이블 정보(TB_start)에 포함된 '4:26' 은 제3 버스(B#3)가 제1 정류장(TM_1)에 도착하여 승객을 태우고 출발하는 시간으로 이해될 수 있다. 또한, 도 8의 출발 타임 테이블 정보(TB_start)에 포함된 '4:34'는 제4 버스(B#4)가 제1 정류장(TM_1)에 도착하 여 승객을 태우고 출발하는 시간으로 이해될 수 있다. 예를 들어, 도 8의 출발 타임 테이블 정보(TB_start)에 포함된 '4:42'는 제5 버스(B#5)가 제1 정류장(TM_1)에 도착하여 승객을 태우고 출발하는 시간으로 이해될 수 있다. 또한, 도 8의 출발 타임 테이블 정보(TB_start)에 포함된 '4:50'은 제6 버스(B#6)가 제1 정류장(TM_1)에 도착하 여 승객을 태우고 출발하는 시간으로 이해될 수 있다. 한편, 도 8의 제8 정류장(TM_8)의 열 정보에 상응하는 '4:23'은 제1 버스(B#1)가 종점인 제8 정류장(TM_8)에 도 착하여 승객을 모두 하차시킨 후 기점(즉, TM_1)으로 복귀하기 위해 출발하는 시간으로 이해될 수 있다.여기서, 제1 버스(B#1)가 기점(즉, TM_1)으로 복귀하기 위해 제1 복귀 시간(T_1)이 소요될 수 있다. 또한, 도 8의 제8 정류장(TM_8)의 열 정보에 상응하는 '4:32'은 제2 버스(B#2)가 종점인 제8 정류장(TM_8)에 도 착하여 승객을 모두 하차시킨 후 기점(즉, TM_1)으로 복귀하기 위해 출발하는 시간으로 이해될 수 있다. 여기서, 제2 버스(B#2)가 기점(즉, TM_1)으로 복귀하기 위해 제2 복귀 시간(T_2)이 소요될 수 있다. 또한, 도 8의 제8 정류장(TM_8)의 열 정보에 상응하는 '4:40'는 제3 버스(B#3)가 종점인 제8 정류장(TM_8)에 도 착하여 승객을 모두 하차시킨 후 기점(즉, TM_1)으로 복귀하기 위해 출발하는 시간으로 이해될 수 있다. 여기서, 제3 버스(B#3)가 기점(즉, TM_1)으로 복귀하기 위해 제3 복귀 시간(T_3)이 소요될 수 있다. 또한, 도 8의 제8 정류장(TM_8)의 열 정보에 상응하는 '4:49'는 제4 버스(B#4)가 종점인 제8 정류장(TM_8)에 도 착하여 승객을 모두 하차시킨 후 기점(즉, TM_1)으로 복귀하기 위해 출발하는 시간으로 이해될 수 있다. 여기서, 제4 버스(B#4)가 기점(즉, TM_1)으로 복귀하기 위해 제4 복귀 시간(T_4)이 소요될 수 있다. 또한, 도 8의 제8 정류장(TM_5)의 열 정보에 상응하는 '4:57'은 제5 버스(B#5)가 종점인 제8 정류장(TM_8)에 도 착하여 승객을 모두 하차시킨 후 기점(즉, TM_1)으로 복귀하기 위해 출발하는 시간으로 이해될 수 있다. 여기서, 제5 버스(B#5)가 기점(즉, TM_1)으로 복귀하기 위해 제5 복귀 시간(T_5)이 소요될 수 있다. 또한, 도 8의 제6 정류장(TM_6)의 열 정보에 상응하는 '5:05'는 제6 버스(B#6)가 종점인 제8 정류장(TM_8)에 도 착하여 승객을 모두 하차시킨 후 기점(즉, TM_1)으로 복귀하기 위해 출발하는 시간으로 이해될 수 있다. 여기서, 제6 버스(B#6)가 기점(즉, TM_1)으로 복귀하기 위해 제6 복귀 시간(T_6)이 소요될 수 있다. 제1 내지 제 6 복귀 시간(T_1~T_6)은 기 확보된 데이터 및 운행 데이터를 기반으로 인공지능 학습을 통해 획득 된 학습 데이터로부터 도출되는 정보로 이해될 수 있다. 도 9는 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템을 위한 방법을 설명하기 위한 순서도이다. 도 1 내지 도 9를 참조하면, S910 단계에서, 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템은 배차 기 준 정보 및 학습 데이터를 기반으로 계획 배차를 위한 기준 배차표 정보를 생성할 수 있다. 예를 들어, 배차 기준 정보는 버스와 연관된 차량 정보, 버스 운전 기사와 연관된 인사 정보, 운행 정보를 포함 할 수 있다. 여기서, 운행 정보는 해당 버스 노선의 운행 횟수, 기본 배차간격, 운전자 휴게시간을 포함할 수 있다. 예를 들어, 학습 데이터는 공공 데이터 포탈에서 제공하는 버스도착 정보조회 서비스 API를 통해 정류장 도착시 간과 연관된 버스 운행 데이터를 기반으로 RNN(혹은 LSTM) 학습을 수행하여 생성된 데이터로 이해될 수 있다. 예를 들어, 기준 배차표 정보는 도 8의 계획 배차를 위한 출발시간정보(TB_start)를 포함할 수 있다. S920 단계에서, 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템은 마지막 정류소에서 기점인 차고지까 지 이동하는데 소요되는 평균 도착시간을 도출할 수 있다. 예를 들어, 평균 도착시간은 특정 버스(예로, B#1)의 운행을 위한 특정 시간대의 특정 버스(예로, B#1) 노선의 종점인 제6 정류장(TM_6)에서 기점(즉, TM_1)으로 복귀하기 위해 복귀 시간(예로, T_1)을 의미할 수 있다. 한편, 평균 도착시간은 일정기간 동안 공공 데이터 포탈에서 제공하는 버스도착 정보조회 서비스 API를 통해 누 적된 운행 데이터를 기반으로 예측되는 정보일 수 있다. 나아가, 보다 정확한 평균 도착시간을 도출하기 위하여 운전자의 스마트폰에 설치된 APP 기반의 GPS 위치 정보 가 함께 이용될 수 있다. 예를 들어, GPS 위치 정보는 특정 버스 노선을 운행하는 특성 시간대의 특정 버스가 차고지에 도착하는지 여부 및 차고지 도착 시간을 확인하기 위해 사용될 수 있다. 다시 말해, 누적된 운행 데이터를 기반으로 예측된 도착시간 데이터와 APP 기반의 GPS 위치 정보의 비교를 토해 보다 정확한 데이터가 도출될 수 있다. 일 예로, BIS 센터 측에서 데이터 통신 장애가 발생한 경우, 운전자의 APP 기반의 GPS 위치 정보를 기반으 로 평균 도착시간이 도출될 수 있다. 다른 일 예로, 운전자의 스마트폰 측에서 데이터 통신 장애가 발생한 경우가 설명된다. 운전자의 스마트폰에 설 치된 APP 기반의 GPS 정보는 기본적으로 1분 간격으로 전송되도록 설정될 수 있다. 만일 도착 예정 시간의 경과에도 수신된 GPS 정보가 없는 경우, 다음 운행 회차의 배차 간격은 기 생성된 계획 배차를 위한 출발시간정보(TB_start)를 기반으로 조정될 수 있다. 또 다른 일 예로, 운전자의 휴대폰에서 GPS 정보의 송수신을 지원하지 않는 스마트폰에 해당하는 경우, 해당 운 전자가 운행하는 버스의 도착 시간은 계획 배차를 위한 출발시간정보(TB_start)로 설정될 수 있다. S920 단계는 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템의 정확도를 향상하기 위하여 선택적으로 수행될 수 있음은 이해될 것이다. S930 단계에서, 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템은 해당 운행 회차의 도착 예정 시간이 계획 배차를 위한 기준 배차 시간을 초과하는지 여부를 판단할 수 있다. 여기서, 해당 운행 회차의 도착 예정 시간은 해당 운행 회차를 운행하는 버스가 종점(TM_8)으로부터 차고지 (TM_1)에 도착하는 시간을 의미할 수 있다. 예를 들어, 도 8의 4회차를 운행하는 제4 번 버스(B#4)가 교통 상황 등의 이유로 제2 정류장(TM_2)을 위한 기준 배차 시간인 4시 36분에서 20분 지연된 경우, 제4 번 버스(B#4)의 도착 예정 시간은 5시 9분과 제4 복귀 시간 (T_4)를 합산한 시간으로 이해될 수 있다. 이 경우, 도 8의 기준 배차표 정보의 출발시간정보(TB_start)를 참조하면, 4회차 운행을 마친 제4 번 버스 (B#4)의 도착 예정 시간은 8회차 운행을 위한 기준 배차 시간(5시 8분)을 초과하는 것으로 판단될 수 있다. 만일 해당 운행 회차의 도착 예정 시간이 계획 배차를 위한 기준 배차 시간을 초과한다고 판단되면, 수순은 S940 단계로 진행된다. 만일 해당 운행 회차의 도착 예정 시간이 계획 배차를 위한 기준 배차 시간을 초과하지 않는다고 판단되면, 수 순은 S970 단계로 진행된다. S940 단계에서, 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템은 자동 배차 조정 계산법을 기반으로 다음 운행 회차의 배차 간격을 조정할 수 있다. 예를 들어, 기준 배차표 정보의 5회차부터 출발시간정보(TB_start)에 조정 시간(α)이 추가될 수 있다. 여기서, 조정 시간(α)은 4회차 운행을 마친 제4 번 버스(B#4)의 도착 예정 시간은 8회차 운행을 위한 기준 배 차 시간(5시 8분)을 초과하지 않기 위한 시간 값으로 설정될 수 있다. 나아가, 조정 시간(α)은 4회차를 운행하는 제4 번 버스(B#4)의 제2 정류장(TM_2)에 실제 도착한 시간(4시 56분)과 3회차를 운행하는 제3 번 버스(B#3)의 제2 정류장(TM_2)에 실제 도착한 시간(4시 28분)의 시간 차이(28 분)를 조정하기 위한 시간 값으로 설정될 수 있다. S950 단계에서, 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템은 조정된 배차 시간을 기반으로 기 생 성된 기준 배차표 정보를 갱신할 수 있다. 예를 들어, 도 8의 기준 배차표 정보의 5회차부터 조정 시 간(α)이 적용되므로, 기준 배차표 정보 전체가 갱신될 수 있다. 이 경우, 갱신된 기준 배차표 정보 는 해당 노선의 운행 상황이 반영된 최적 배차 정보로 언급될 수 있다. S960 단계에서, 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템은 최적 배차 정보를 운전자의 스마트폰 으로 송신할 수 있다. S970 단계에서, 만일 해당 운행 회차의 도착 예정 시간이 계획 배차를 위한 기준 배차 시간을 초과하지 않는다 고 판단되면, 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템은 기 생성된 기준 배차 정보를 유지할 수 있다. 도 10은 본 다른 실시 예에 따른 인공지능 기반의 최적배차 시스템을 위한 방법을 설명하기 위한 순서도이다. 도 1 내지 도 10을 참조하면, 도 10의 S1010 단계의 설명은 S910 단계에 대한 설명으로 대체될 수 있음은 이해 될 것이다. S1020 단계에서, 본 다른 실시 예에 따른 인공지능 기반의 최적배차 시스템은 계획 배차를 위한 기준 배차 정보 와 실제 운행에 따른 GPS 위치 정보의 시간 차이가 임계 값을 초과하는지 여부를 판단할 수 있다.다시 말해, 기준 배차 정보에 따른 정류장 별 시간 정보와 버스로부터 수집된 실제 운행 정보와의 시간 차 이가 임계 값을 초과하는지 여부를 판단할 수 있다. 만일, 기준 배차 정보에 따른 정류장 별 시간 정보와 버스로부터 수집된 실제 운행 정보와의 시간 차이가 임계 값을 초과하면, 수순은 S1030 단계로 진행된다. S1030 단계에서, 본 다른 실시 예에 따른 인공지능 기반의 최적배차 시스템은 운전 기사용 APP을 통해 실시간 알림 정보를 제공할 수 있다. 본 명세서의 상세한 설명에서는 구체적인 실시 예에 관하여 설명하였으나, 본 명세서의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능하다. 그러므로, 본 명세서의 범위는 상술한 실시 예에 국한되어 정해져서는 안되며 후술하는 특허청구범위뿐만 아니라 이 발명의 특허청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2020-0009804", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템을 포함하는 버스 운행 정보 안내 시스템의 전체 구성도이다. 도 2은 RNN의 기본 개념을 설명하기 위한 도면이다. 도 3은 RNN의 다양한 구현 방식을 보여주는 도면이다. 도 4는 LSTM(Long Short Term Memory networks)을 설명하기 위한 블록도이다. 도 5는 본 일 실시 예에 따른 LSTM을 기반으로 학습 및 예측이 수행되는 방법을 설명하기 위한 도면이다. 도 6은 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템에 의한 최적 배차를 설명하기 위한 도면이다. 도 7은 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템이 하나의 버스 노선에 적용되는 과정을 설명하 기 위한 도면이다. 도 8은 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템에 의한 계획 배차 및 배차 시간 조정 과정을 설 명하기 위한 도면이다. 도 9는 본 일 실시 예에 따른 인공지능 기반의 최적배차 시스템을 위한 방법을 설명하기 위한 순서도이다. 도 10은 본 다른 실시 예에 따른 인공지능 기반의 최적배차 시스템을 위한 방법을 설명하기 위한 순서도이다."}
