{"patent_id": "10-2022-0087113", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0010632", "출원번호": "10-2022-0087113", "발명의 명칭": "차량 정비소 간 차량부품 중개 서비스 제공 시스템", "출원인": "주식회사 디엔민어소시에이션", "발명자": "김대성"}}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량 정비소의 위치 및 영업시간을 등록하고, 판매할 차량부품의 판매 데이터를 업로드하는 판매자 단말;구매할 차량부품을 검색하고, 검색결과 내 차량부품을 선택하여 구매 및 결제하는 구매자 단말; 및상기 판매자 단말로부터 상기 차량 정비소의 위치 및 영업시간을 등록받는 등록부, 상기 판매자 단말에서 판매할 차량부품의 판매 데이터를 업로드하는 경우, 상기 판매자 단말 및 차량 정비소와 매핑하여 업로드하는 업로드부, 상기 구매자 단말에서 상기 차량부품을 검색한 후 구매 및 결제하는 경우 상기 판매자 단말로 결제 이벤트를 전송하는 전송부, 상기 판매자 단말에서 상기 차량부품의 운송장을 등록한 경우 상기 구매자 단말로 배송트래킹 결과를 공유하는 트래킹부, 상기 구매자 단말에서 수취확인을 하는 경우 상기 판매자 단말로 대금을 정산하는 정산부를 포함하는 중개 서비스 제공 서버;를 포함하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 중개 서비스 제공 서버는,상기 구매자 단말에서 위치 기반으로 상기 차량부품을 검색하는 경우, 상기 구매자 단말의 현위치 또는 등록된위치에서 기 설정된 반경 내 위치한 적어도 하나의 차량 정비소 중 상기 차량부품을 업로드한 차량 정비소의 위치 및 차량부품의 가격을 지도에 표시하는 위치기반검색부;를 더 포함하는 것을 특징으로 하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 중개 서비스 제공 서버는,상기 구매자 단말에서 상기 차량부품을 검색할 때, 제조사, 모델, 차종 및 부품부위에 대응하는 카테고리를 선택하여 검색하도록 하는 카테고리제공부;를 더 포함하는 것을 특징으로 하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 중개 서비스 제공 서버는,상기 판매자 단말에서 상기 판매 데이터 중 차량부품의 모델명을 입력하는 경우, 상기 차량부품의 모델명으로등록된 거래가격의 평균가를 제시하는 시세제공부;를 더 포함하는 것을 특징으로 하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0010632-3-제 1 항에 있어서,상기 중개 서비스 제공 서버는,상기 판매자 단말로부터 재고 데이터를 업로드받고, 상기 판매자 단말에서 재고소진 이벤트를 출력하는 경우,상기 재고 데이터를 상기 판매 데이터로 업로드하는 재고소진부;를 더 포함하는 것을 특징으로 하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 중개 서비스 제공 서버는,상기 판매자 단말 및 구매자 단말에서 로그인을 진행할 때, 지문 또는 얼굴에 대응하는 터치 로그인 또는 페이스 로그인을 선택하여 사용자 인증을 진행하도록 하는 생체인증부;를 더 포함하는 것을 특징으로 하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 중개 서비스 제공 서버는,상기 구매자 단말에서 상기 구매할 차량부품을 검색할 때, 카메라를 구동하여 차량부품을 이미지 기반 검색을수행하는 경우, 촬영된 이미지 내 객체를 추출하고, 상기 객체와 기 설정된 유사도를 가진 적어도 하나의 차량부품을 검색하여 제공하는 이미지검색부;를 더 포함하는 것을 특징으로 하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 중개 서비스 제공 서버는,상기 판매자 단말의 차량부품을 상기 구매자 단말에서 구매완료한 경우, 상기 판매자 단말 및 구매자 단말로 탄소 포인트를 제공하는 탄소중립부;를 더 포함하는 것을 특징으로 하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 중개 서비스 제공 서버는,상기 판매자 단말 및 구매자 단말의 거래 건수에 따라 거래 포인트를 지급하고, 거래 빈도가 높을수록 상기 거래 포인트를 증가시켜 지급하며, 상기 거래 포인트에 기반하여 등급을 부여하고, 상기 등급이 높을수록 거래 수수료가 감소하도록 설정하는 로열티부;를 더 포함하는 것을 특징으로 하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2024-0010632-4-제 1 항에 있어서,상기 중개 서비스 제공 서버는,상기 판매자 단말에서 상기 판매 데이터를 업로드할 때, 상기 판매자 단말에서 상기 차량부품을 구매할 때 저장한 상기 차량부품의 구매이력, 구매처, 구매날짜 및 구매가격을 포함하는 로그 데이터를 상기 판매 데이터와 함께 업로드하는 로그공유부;를 더 포함하는 것을 특징으로 하는 차량 정비소 간 차량부품 중개 서비스 제공 시스템."}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "차량 정비소 간 차량부품 중개 서비스 제공 시스템이 제공되며, 차량 정비소의 위치 및 영업시간을 등록하고, 판 매할 차량부품의 판매 데이터를 업로드하는 판매자 단말, 구매할 차량부품을 검색하고, 검색결과 내 차량부품을 선택하여 구매 및 결제하는 구매자 단말 및 판매자 단말로부터 차량 정비소의 위치 및 영업시간을 등록받는 등록 부, 판매자 단말에서 판매할 차량부품의 판매 데이터를 업로드하는 경우, 판매자 단말 및 차량 정비소와 매핑하 여 업로드하는 업로드부, 구매자 단말에서 차량부품을 검색한 후 구매 및 결제하는 경우 판매자 단말로 결제 이 벤트를 전송하는 전송부, 판매자 단말에서 차량부품의 운송장을 등록한 경우 구매자 단말로 배송 트래킹 결과를 공유하는 트래킹부, 구매자 단말에서 수취확인을 하는 경우 판매자 단말로 대금을 정산하는 정산부를 포함하는 중개 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량 정비소 간 차량부품 중개 서비스 제공 시스템에 관한 것으로, 차량 정비소 간 차량부품을 판매 및 구매할 수 있도록 중개하고, 탄소 포인트를 적립하여 거래 참여율을 높일 수 있는 시스템을 제공한다."}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "재고란 생산에서 판매까지 공급사슬의 모든 과정에서 불확실성에 대비하기 위해 남아있는 원자재 및 상품을 말 한다. 대부분의 조직에서 재고를 획득하고 유지하는데 관련된 비용은 경영활동 비용의 상당 부분을 차지하고, 예산의 제약을 받게 되기 때문에, 공급사슬 내 가장 이상적인 재고의 양은 제로에 근접하는 것이다. 하지만, 재고를 최소치로 설정할 경우에는 결품 문제가 발생하며, 최대치로 설정할 경우에는 과잉재고의 문제가 발생한 다. 과거에는 재고자산이 대차대조표 내 자산에 분류되기 때문에 다량의 재고자산 보유가 기업의 규모를 커보 이게 한다는 인식을 가지고 있었지만, 재고에 투입된 자본만큼의 기회비용이 상실되며, 재고관리에 소모되는 비 용이 추가로 발생하기 때문에, 과다재고는 총자본회전율과 총자본 이익률을 하락시킨다. 적정 재고를 어느 수 준으로 유지해야 하는 가는 중요한 문제라 할 수 있다. 그 이유는 재고수준을 낮게 운영할 경우 비용은 절감시 킬 수 있지만 품절 비용이 발생할 수 있으며, 충분히 보유하는 경우 고객의 수요를 만족시킬 수 있지만 재고 유 지비용이 커질 수 있기 때문이다. 이때, 적정 재고를 유지하기 위하여 공업사 간 차량부품을 거래하거나 중고차를 처분할 때 차량부품을 거래하는 플랫폼이 연구 및 개발되었는데, 이와 관련하여 선행기술인 한국공개특허 제2009-0099135호(2009년09월22일 공 개) 및 한국공개특허 제2020-0139554호(2020년12월14일 공개)에는, 정비소나 공업사에 재고로 남아있는 차량부 품을 업로드받아 체계적으로 관리하도록 데이터베이스화하고, 정비소나 공업사 간 차량부품을 상호 공유하여 서 로 거래할 수 있는 구성과, 중고차량의 폐차 후 재활용이 가능한 중고부품정보를 입력받아 데이터베이스화하고, 정비체인점 간 중고부품 데이터베이스를 이용하도록 하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 정비소 간 차량부품을 판매하거나 구매하려고 해도, 판매가를 얼마로 설정해야 하는지, 사진 은 어떻게 찍어서 올려야 하는지, 판매가 되었다 할지라도 배송은 어떠한 방식으로 해야 하는지 등에 대한 프로 세스가 정립되어 있지 않아 고물을 수거하는 고물상에 헐 값으로 팔아넘기는 것이 대부분이다. 후자의 경우에 는 폐차가 된 후 중고부품을 데이터베이스화하기 위해 이를 주도적으로 관리하고 데이터를 입력하는 직원 및 인 프라가 구축되어야 한다. 이에, 판매자는 판매가 설정 및 배송의 불편없이 판매를 할 수 있고, 구매자는 차량 부품의 신뢰성과 안전성을 확보하면서 구매 및 결제를 할 수 있는 플랫폼의 연구 및 개발이 요구된다."}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 차량 정비소 간 차량부품을 직관적으로 판매 및 구매할 수 있도록, 판매자 단말로부터 차량부품의 모델명을 입력받고 사진을 입력받으면 모델명 및 사진에 따라 평균시세를 가이드로 제시함으로써 가 격설정을 할 수 있도록 하고, 판매자 단말의 차량부품 구매이력을 수집함으로써 차량부품의 히스토리 로그를 구 매자에게 안내할 수 있도록 하며, 구매자 단말에서는 위치 기반 또는 가격 기반으로 차량부품을 검색하고 구매 및 결제할 수 있고, 구매자 및 판매자에게 각각 차량부품을 생산하는데 발생하는 탄소발생량에 대응하는 탄소 포인트를 제공함으로써 거래를 유도하며, 차량정비가 시급한 경우 현위치를 기반으로 차량부품이 있는 차량 정 비소를 검색하여 직접 픽업할 수 있도록 함으로써 빠른 거래 및 직관적인 거래를 제공할 수 있는, 차량 정비소 간 차량부품 중개 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 차량 정비소의 위치 및 영업 시간을 등록하고, 판매할 차량부품의 판매 데이터를 업로드하는 판매자 단말, 구매할 차량부품을 검색하고, 검 색결과 내 차량부품을 선택하여 구매 및 결제하는 구매자 단말 및 판매자 단말로부터 차량 정비소의 위치 및 영 업시간을 등록받는 등록부, 판매자 단말에서 판매할 차량부품의 판매 데이터를 업로드하는 경우, 판매자 단말 및 차량 정비소와 매핑하여 업로드하는 업로드부, 구매자 단말에서 차량부품을 검색한 후 구매 및 결제하는 경 우 판매자 단말로 결제 이벤트를 전송하는 전송부, 판매자 단말에서 차량부품의 운송장을 등록한 경우 구매자 단말로 배송 트래킹 결과를 공유하는 트래킹부, 구매자 단말에서 수취확인을 하는 경우 판매자 단말로 대금을 정산하는 정산부를 포함하는 중개 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 차량 정비소 간 차량부품을 직관적으로 판매 및 구매 할 수 있도록, 판매자 단말로부터 차량부품의 모델명을 입력받고 사진을 입력받으면 모델명 및 사진에 따라 평 균시세를 가이드로 제시함으로써 가격설정을 할 수 있도록 하고, 판매자 단말의 차량부품 구매이력을 수집함으 로써 차량부품의 히스토리 로그를 구매자에게 안내할 수 있도록 하며, 구매자 단말에서는 위치 기반 또는 가격 기반으로 차량부품을 검색하고 구매 및 결제할 수 있고, 구매자 및 판매자에게 각각 차량부품을 생산하는데 발 생하는 탄소발생량에 대응하는 탄소 포인트를 제공함으로써 거래를 유도하며, 차량정비가 시급한 경우 현위치를 기반으로 차량부품이 있는 차량 정비소를 검색하여 직접 픽업할 수 있도록 함으로써 빠른 거래 및 직관적인 거 래를 제공할 수 있다."}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 차량 정비소 간 차량부품 중개 서비스 제공 시스템을 설명하기 위한 도면이 다. 도 1을 참조하면, 차량 정비소 간 차량부품 중개 서비스 제공 시스템은, 적어도 하나의 구매자 단말 , 중개 서비스 제공 서버, 적어도 하나의 판매자 단말을 포함할 수 있다. 다만, 이러한 도 1의 차량 정비소 간 차량부품 중개 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 구매자 단말은 네트워크를 통하여 중개 서비스 제공 서버와 연결 될 수 있다. 그리고, 중개 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 구매자 단말 , 적어도 하나의 판매자 단말과 연결될 수 있다. 또한, 적어도 하나의 판매자 단말은, 네트워 크를 통하여 중개 서비스 제공 서버와 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스 (Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워 크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 구매자 단말은, 차량 정비소 간 차량부품 중개 서비스 관련 웹 페이지, 앱 페이지, 프로그 램 또는 애플리케이션을 이용하여 차량부품을 검색하고 구매하는 구매자의 단말일 수 있다. 이때, 구매자는 차 량 정비소를 운영하는 업주일 수도 있으나 차량부품을 구매하고자 하는 개인일 수도 있다. 여기서, 적어도 하나의 구매자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 구매자 단말은, 네트워크를통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 구매자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 중개 서비스 제공 서버는, 차량 정비소 간 차량부품 중개 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 제공하는 서버일 수 있다. 그리고, 중개 서비스 제공 서버는, 판매자 단말로부터 차량 부품의 명칭 또는 모델명 등을 입력받고, 시세 평균가를 제시한 후 판매자 단말에서 판매가를 설정하고 사 진을 등록하는 경우, 판매자의 차량 정비소 위치를 기반으로 차량부품을 등록하는 서버일 수 있다. 또한, 중개 서비스 제공 서버는, 적어도 하나의 구매자 단말에서 차량부품을 검색하는 경우, 카테고리별 리스트 를 제공하거나 검색결과를 거리순 또는 유사순 등으로 정렬하여 제공하는 서버일 수 있다. 그리고, 중개 서비 스 제공 서버는, 구매자 단말에서 판매자 단말로 구매 이벤트를 전송한 경우 판매자 단말 에서 운송장을 등록하면 구매자 단말로 배송 트래킹을 공유하는 서버일 수 있다. 또한, 중개 서비스 제공 서버는, 구매자 단말에서 수취확인 및 구매결정을 하는 경우 판매자 단말로 정산을 하는 서버일 수 있다. 여기서, 중개 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 판매자 단말은, 차량 정비소 간 차량부품 중개 서비스 관련 웹 페이지, 앱 페이지, 프로그 램 또는 애플리케이션을 이용하는 판매자의 단말일 수 있다. 판매자 단말은 차량부품을 구매한 이력, 모 델명, 사진, 판매가 등을 입력하고 차량부품의 판매 데이터를 업로드하는 단말일 수 있다. 또한, 판매자 단말 은, 중개 서비스 제공 서버를 경유하여 구매자 단말의 구매 이벤트가 전송된 경우 운송장을 출 력하고 운송 트래킹 정보를 공유하는 단말일 수 있다. 그리고, 판매자 단말은 구매자 단말에서 수취 확인 및 구매결정을 하는 경우 중개 서비스 제공 서버로부터 수수료를 제외한 나머지 금액을 정산받는 단 말일 수 있다. 만약, 구매자 단말에서 픽업 시간 및 날짜 등을 설정한 경우, 판매자 단말의 판매자 는 픽업 시간 및 날짜에 맞게 차량부품을 준비해둘 수 있다. 여기서, 적어도 하나의 판매자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 판매자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 판매자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 중개 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 차량 정비소 간 차량부품 중개 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 중개 서비스 제공 서버는, 등록부, 업로드부, 전송부, 트래킹부, 정산부, 위치기반검색부, 카테고리제공부, 시세제공부, 재고소진부, 생체인증부 , 이미지검색부, 탄소중립부, 로열티부 및 로그공유부를 포함할 수 있다. 본 발명의 일 실시예에 따른 중개 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하 나의 구매자 단말 및 적어도 하나의 판매자 단말로 차량 정비소 간 차량부품 중개 서비스 애플리케이 션, 프로그램, 앱 페이지, 웹 페이지 등을 전송하는 경우, 적어도 하나의 구매자 단말 및 적어도 하나의 판매자 단말은, 차량 정비소 간 차량부품 중개 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등 을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크립트를 이용하여 서비스 프로그램이 적어도하나의 구매자 단말 및 적어도 하나의 판매자 단말에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 넷스케이프(Netscape), 익스플로러 (Explorer), 크롬(Chrome) 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그램(Application)을 의 미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 등록부는, 판매자 단말로부터 차량 정비소의 위치 및 영업시간을 등록받을 수 있다. 판매자 단말은, 차량 정비소의 위치 및 영업시간을 등록하고, 판매할 차량부품의 판매 데이터를 업 로드할 수 있다. 이때, 본 발명의 일 실시예에 따른 플랫폼은 재고관리 플랫폼을 더 제공할 수 있다. 판매자 단말의 판매자는 임의로 작성하거나 수기로 관리하는 재고관리에서 시스템에 의하여 데이터 기반으로 관리 를 수행할 수 있고, 바코드나 QR 코드와 같은 고유식별코드를 이용하여 편리하게 판매 및 관리할 수 있다. 또, 제조업체, 차종, 차량명, 모델명, 부품명 등의 코드화로 물류유통의 기반을 조성할 수 있고, 또, 음성적으로 거 래되던 차량부품을 온라인을 통하여 B2B는 물론, B2C까지 가능하도록 할 수 있으며, 일반인에게 공개되지 않았 던 차량부품의 정보를 온라인으로 실시간 제공할 수 있다. 업로드부는, 판매자 단말에서 판매할 차량부품의 판매 데이터를 업로드하는 경우, 판매자 단말 및 차량 정비소와 매핑하여 업로드할 수 있다. 이때, 모델명을 기반으로 업로드를 할 수 있다. 이를 위하여 본 발명의 플랫폼은 각종 차량부품의 모델명, 제조업체, 차종, 차량명, 부품명 등의 데이터베이스를 구축해야 하는데, 예를 들어, 부품정보는, 일련번호, 정렬코드, 부품명, 옵션, 구분코드, 영문명, 영문옵션명 및 등록일 등일 수 있다. 하지만 내연기관차량의 경우 차량부품의 수가 약 3 만여개에 달하기에 이를 모두 데이터베이스 화할 수 없는 경우, 웹크롤러나 웹스크래퍼로 수집한 후 차량부품 이미지, 사진, 사양 등의 정보를 실시간으로 업로드하도록 할 수 있다. 이에 따라, 판매자는 각 정보를 모두 입력할 필요없이 각 차량부품의 사진이나 바코 드 등만 업로드하고 판매가만 입력하면 되도록 프로세스를 간소화할 수 있다. 전송부는, 구매자 단말에서 차량부품을 검색한 후 구매 및 결제하는 경우 판매자 단말로 결제 이벤트를 전송할 수 있다. 구매자 단말은, 구매할 차량부품을 검색하고, 검색결과 내 차량부품을 선택하 여 구매 및 결제할 수 있다. 이때, 구매자는 판매자와 동일한 차량 정비소를 운영하는 업자일 수도 있고, 자가 운전자인 일반인일 수도 있고, 해외업체일 수도 있다. 중고거래의 경우 특히 구매자는 차량부품이 불량일 수 있다는 위험부담을 안게 된다. 새제품이라고 할지라도 부품사와 직접 거래를 하는 경우 불량이라면 이를 바로 교환해주거나 환불받을 수 있지만, 개인 간 거래를 하는 경우에는 판매자는 정상작동하는 제품을 넘겨줬지만 구 매자가 고장을 냈다고 주장할 수도 있고, 실제로 구매자는 자신이 고장을 낸 후 판매자가 고장난 제품을 판매했 다고 주장할 수도 있다. 이에, 구매자 단말에서 안전거래를 요청하는 경우, 본 발명의 플랫폼에서 작동여 부를 확인한 후 구매자에게 제공하는 방법을 더 이용할 수도 있다. <정상작동 검사> 엑스레이 검사장비에 딥러닝 알고리즘을 적용하여 성능을 극대화하고, 각종 설비에서 발생하는 진동, 전류, 속 도 등 다양한 데이터를 인공지능 기술로 분석하여 상태를 진단하고 고장발생시기와 잔여수명을 예측할 수 있다. 부품불량검사과정에서 육안으로 크랙(Crack) 등을 검사하지 않고 인공지능을 도입하지 않고 이미지 판독 기술을 이용하여 비전검사로 자동화할 수도 있다. 또, 프레스 가공시 금속판에 생기는 미세한 균열을 정확하게 인식하 고 표시해줄 수도 있다. 또 진동 신호에 음성처리기술과 딥러닝을 이용하여 핵심 구동부품인 감속기의 이상을 탐지할 수도 있다. <진동검사> 차량의 속도 및 조향상태에 따라 유압을 조절하는 EPS(Electric Power Steering)는 회전 시 차축으로부터 전해 오는 진동원에 따른 비(Non) 이상적인 잡음이나 이음 및 미세한 떨림을 선별하기 위해 오더분석(Order Analysis) 및 다양한 검사방법을 통해 불량을 검출하고 있으나, 다양한 정보가 복잡하게 얽혀있는 진동데이터 특성상 제대로 불량을 검출하지 못할 수 있다. 이에 따라, 회전 진동(Rotating Vibration)에 따른 품질 결함문 제를 구분 및 판단하기 위해, 회전 가진에 영향을 받는 부품으로부터 추출된 시계열 데이터를 선별할 수 있도록 한다. 이를 위하여, 선형층(Linear Layer)만을 활용한 MLP(Multi-Layer Perceptron) 모델, FCN(Fully Convolutional Networks) 모델, ResNET 모델, Inception 모델 그리고 CNN 모델에 이르는 딥러닝 알고리즘을 적 용하여 정확도가 높은 모델을 선택한 후 차량부품 불량 검사에 이용할 수 있다. <비전검사> 비전검사는 예를 들어 기준영상(Reference Image) 기반 불량검출 비전검사를 이용할 수 있다. 양품의 기준영상 을 기반으로, 전자부품, 예를 들어, PCB, TFT-LCD 등을 검사할 수 있다. 물론 PCB나 TFT 같은 경우 전원을 인 가하여 구동시켜 보는 것이 가장 정확하지만, Edge-Tolerance 비전검사 알고리즘도 높은 정확도를 가지고 있다. 이때, 양품인 기준영상과 검사영상(Inspection Image)을 비교하는 비교 알고리즘(Compare Algorithm)으로 차영 상(Subtraction Image)를 사용할 수도 있는데 정확도가 더 높은 알고리즘을 본 발명의 플랫폼의 검사 알고리즘 으로 세팅하면 된다. Edge-Tolerance 비전검사 알고리즘은, 영상의 에지부분에서 존재할 수 있는 샘플링에러(Sampling Error) 보정을 위해 명암 형태학적 처리(Gray-Scale Morphological Processing)를 이용하여 이하 수학식 1과 같은 Rmax와 Rmin 영상을 생성한다. 수학식 1"}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, Rmax는 명암 형태학적 처리 중 팽창(Dilation)연산을 통하여 생성되고, Rmin은 명암 형태학적 처리 중 침식연산을 통하여 생성된다. 그리고, R(x,y)는 기준영상을 의미한다. p와 q는 -1에서 +1 값을 갖는 정수값이 고, ρ는 에지보정파라미터(Edge Tolerance Parameter)로 0.0에서 1.0 사이의 실수값을 갖는 변수이다. 수학식 1과 같이 생성된 Rmax, Rmin 이미지와 결함 검사이미지(I(x,y))를 이용하여 수학식 2와 같은 차영상 D(x,y)를 계산한다.\u0000 수학식 2"}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "불량이 없는 기준영상과 검사영상이 흑백영상이면 D(x,y)도 흑백영상이고, 기준영상과 검사영상이 컬러영상이면 D(x,y)도 컬러영상이다. 이러한 D(x,y) 영상에서 결함이 있는 부분은 비교적 큰 값을 가지게 되고, 결함이 없 는 부분은 0에 가까운 값을 가지게 된다. 덧붙여서, 기준영상에 대해 검사하고자 하는 입력 검사영상을 기준영상에 정렬한 후, 양품영상과 검사영상을 이 진화한 후, 이진화된 두 영상을 비교하고, 이진화 방법은 전체영상에 대한 전역 이치화(Global Threshold) 대신 영상의 부분부분에 대한 적응적 이치화(Adaptive Threshold)를 통해 이진화를 더 수행할 수도 있다. 이진화된 두 영상에 대한 비교는 수학식 3과 같은 이진블록매칭 알고리즘(Binary Block Matching Algorithm)을 이용하여 두 이진 영상간 비교를 수행할 수 있다. 수학식 3"}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, BBD(x,y)는 이진블록차이영상(Binary Block Difference)을 의미하고, Br(m,n)은 양품 기준영상에 대한 이진영상을 Bt(m+x, n+y)는 입력 검사부품에 대한 이진영상을 나타낸다. 최종적인 불량유무는 이진블록차이영 상(BBD(x,y))를 기준으로 수학식 4와 같은 최종 룰에 의하여 불량이 있는 블록인지 아닌지를 판단하게 된다.수학식 4"}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "예를 들어, CCD 카메라를 이용하고 부품 외형검사, PCB 검사, 터미널단자 유무 검사 및 위치정렬검사 등을 수행 할 수 있다. 외형적으로 파손된 영역, 터미널이 돌출된 불량부분을 검출할 수 있고, 이렇게 불량으로 표시된 것들은 다시 판매자 단말로 배송하거나 또는 판매자 단말로부터 수수료를 받고 제조사로 직접 반품을 신청할 수도 있다. 트래킹부는, 판매자 단말에서 차량부품의 운송장을 등록한 경우 구매자 단말로 배송 트래킹 결 과를 공유할 수 있다. 정산부는, 구매자 단말에서 수취확인을 하는 경우 판매자 단말로 대금을 정산할 수 있다. 위치기반검색부는, 구매자 단말에서 위치 기반으로 차량부품을 검색하는 경우, 구매자 단말의 현위치 또는 등록된 위치에서 기 설정된 반경 내 위치한 적어도 하나의 차량 정비소 중 차량부품을 업로드한 차 량 정비소의 위치 및 차량부품의 가격을 지도에 표시할 수 있다. 이때, 각 차량 정비소나 공업사에서 어떠한 차량부품을 어디에 또 얼마나 가지고 있는지 조차 파악을 못하거나 안하는 경우가 존재할 수 있다. 이에, 본 발명의 일 실시예는, QR 코드나 바코드 등을 리딩하는 오픈소스 라이브러리를 이용하여 판매자 단말에서 창고를 촬영하거나 각 박스나 제품을 촬영하는 경우 어떠한 차량부품을 얼마나 보유하고 있는지에 대한 정보를 자동으로 정리할 수 있도록, 즉 재고를 정리할 수 있도록 도와줄 수 있다. 예를 들어, 오픈소스 라이브러리는 QR 코드의 경우 Zbar를 이용할 수 있다. 이때, 판매자 단말에서 차량부품을 촬영한 위치를 QR 코드로 바 꾸어주는 것인데 예를 들어, 차량부품이 위치한 선반 층수, 층수에서 몇 번째 칸에 있는 제품인지 등을 XYZ 좌 표로 표시할 수 있도록 할 수 있다. 예를 들어, A 공업사의 B 건물 내 선반 2층의 첫 번째 칸 차량부품일 때, AB201이라고 QR 코드에 매핑하여 저장할 수 있다. 이렇게 되는 경우, 어느 공업사의 어느 건물 몇 번째 칸에, 어떠한 차량부품이 존재하는지를 알 수 있다. 이때, 각 차량부품에는 바코드나 QR 코드가 미리 박스 외부 등에 부착되어 있는 것을 전제한다. 여기서, 판매자 단말에서 촬영을 하면서 각 차량부품의 위치를 파악한 후 QR 코드나 바코드에 매핑하여 저장해야 하므로 멀티-스레드(Multi-Thread)를 적용할 수도 있다. 카테고리제공부는, 구매자 단말에서 차량부품을 검색할 때, 제조사, 모델, 차종 및 부품부위에 대응 하는 카테고리를 선택하여 검색하도록 할 수 있다. 시세제공부는, 판매자 단말에서 판매 데이터 중 차량부품의 모델명을 입력하는 경우, 차량부품의 모 델명으로 등록된 거래가격의 평균가를 제시할 수 있다. 이때, 모델명에 따른 차량부품이 새제품인지 중고인지, 중고라면 차량부품이 부착되었던 차량의 히스토리는 어떻게 되는지, 중고일지라도 구하기 어려워 수요가 많은 제품인지 아닌지 등에 따라 가중치를 주어 계산을 해줄 수도 있다. 재고소진부는, 판매자 단말로부터 재고 데이터를 업로드받고, 판매자 단말에서 재고소진 이벤트 를 출력하는 경우, 재고 데이터를 판매 데이터로 업로드할 수 있다. 예를 들어, 판매자 단말에서 재고를 급하게 처분하고 싶거나 모든 재고를 판매하고자하는 경우 일일이 차량부품에 대한 데이터를 업로드하지 않고 재고 데이터를 업로드하는 경우, 재고 데이터 내 모델명 등으로 이미지는 웹크롤링으로 자동검색 후 업로드하며, 가격도 상술한 평균가 또는 시세 등으로 자동 업로드하도록 함으로써 판매자가 판매하는데 신경쓰 거나 시간을 쓰는 일이 없도록 할 수도 있다. 생체인증부는, 판매자 단말 및 구매자 단말에서 로그인을 진행할 때, 지문 또는 얼굴에 대응하 는 터치 로그인 또는 페이스 로그인을 선택하여 사용자 인증을 진행하도록 할 수 있다. 이미지검색부는, 구매자 단말에서 구매할 차량부품을 검색할 때, 카메라를 구동하여 차량부품을 이미 지 기반 검색을 수행하는 경우, 촬영된 이미지 내 객체를 추출하고, 객체와 기 설정된 유사도를 가진 적어도 하 나의 차량부품을 검색하여 제공할 수 있다. 예를 들어, 구매자가 일반인이거나 공업사 직원이지만 모델명을 모 르는 경우가 존재할 수 있다. 모델명을 모르는 경우 이미지 기반으로 검색을 한 후, 다시 본 발명의 플랫폼에 서 차량부품이 있는지를 파악해야 하는데, 본 발명의 플랫폼에서는 구매자가 구하고자 하는 차량부품을 구매자 단말에서 촬영하면, 이와 가장 유사한 차량부품을 이미지 기반으로 검색한 후, 구매자 단말로 검색결과를 제공해줄 수도 있다. 탄소중립부는, 판매자 단말의 차량부품을 구매자 단말에서 구매완료한 경우, 판매자 단말 및 구매자 단말로 탄소 포인트를 제공할 수 있다. 로열티부는, 판매자 단말 및 구매자 단말의 거래 건수에 따라 거래 포인트를 지급하고, 거래 빈 도가 높을수록 거래 포인트를 증가시켜 지급하며, 거래 포인트에 기반하여 등급을 부여하고, 등급이 높을수록 거래 수수료가 감소하도록 설정할 수 있다. 로그공유부는, 판매자 단말에서 판매 데이터를 업로드할 때, 판매자 단말에서 차량부품을 구매 할 때 저장한 차량부품의 구매이력, 구매처, 구매날짜 및 구매가격을 포함하는 로그 데이터를 판매 데이터와 함 께 업로드할 수 있다. 이하, 상술한 도 2의 중개 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설명 하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하다 할 것이다. 본 발명의 일 실시예에 따른 플랫폼(엠카즈)은 도 3a와 같은 플랫폼을 제공하는데, 도 3b 및 도 3c와 같은 종사 자 및 업계의 니즈를 충족시키기 위해 도 3d와 같은 시스템을 구축할 수 있다. 도 3e와 같이 구매를 하고 도 3f와 같이 판매를 하며 도 3g와 같이 검색을 하고 도 3h와 같이 결제를 하는 직관적인 UI/UX 구성으로 도 3i와 같이 탄소중립이라는 국가 정책 및 과제에 부응하고 도 3j 및 도 3k와 같은 자원의 선순환을 이끌 수 있다. 도 4a와 같은 메인 페이지에서 도 4b와 같은 스플래시 스크린으로 간단히 사용자들에게 가이드를 주고, 도 4c와 같은 간단한 로그인으로 도 4d와 같은 검색화면을 제공할 수 있다. 고객센터 페이지는 도 4e와 같을 수 있고, 메인 페이지에서 도 4f와 같이 판매를 원하는지 또는 구매를 원하는지에 따라 판매자 단말의 프로세스, 구 매자 단말의 프로세스를 각각 진행하게 된다. 또 메인 페이지에서 도 4g와 같이 구매내역, 판매내역, 탄 소포인트, 나의 재고관리 등을 하거나 조회할 수 있고, 도 4h와 같이 차량부품을 검색하는 경우 도 4i와 같은 검색결과를 제공하고 도 4j와 같이 카테고리 검색도 제공하며, 도 4k와 같은 간편결제로 검색, 선택 및 결제까 지의 과정을 최소화 및 단순화하여 제공한다. 도 4l은 판매 페이지인데 도 4m과 같이 판매 금액을 설정하기 어려워하는 판매자들을 위해 시세 또는 평균가 등 을 가이드로 제시해주고, 새제품인 경우 데이터베이스에 기 저장된 이미지를, 중고재품 등일 경우에는 사진을 업로드하도록 함으로써, 가격설정 및 사진업로드라는 2 가지 단계로 간단히 차량부품을 판매할 수 있도록 구성 한다. 장바구니에는 도 4n과 같이 구매한 상품, 찜한 상품, 배송완료 상품 등을 조회할 수 있도록 구성되고, 도 4o와 같이 상품판매알림, 상품구매알림, 배송정보알림, 결제내역알림 등을 푸시로 제공하며, 도 4p와 같이 드롭다운을 하거나 카테고리 선택 또는 선택해제(초기화) 기능을 제공할 수도 있다. 도 4q와 같은 검색결과 페 이지에서 거리순 또는 비슷한 상품 검색기능도 제공하고, 정비소 이름이나 브랜드 입점명을 함께 제공하여 어디 에서 판매하는 제품인지 등을 확인할 수 있도록 한다. 도 4q와 같이 결제정보 페이지에는 결제카드를 등록하거 나 변경할 수 있고, 도 4s와 같이 탄소 포인트는 구매 또는 판매 내역의 8%를 제공하는데 이를 이용하여 수수료 를 내거나 결제에 사용할 수 있도록 한다. 도 4t와 같이 배송조회를 할 수도 있고, 도 4u 및 도 4v와 같이 구 매목록 및 판매목록을 조회하고 탄소포인트나 금액을 연동하도록 구성할 수 있다. 이와 같은 도 2 내지 도 4의 차량 정비소 간 차량부품 중개 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1을 통해 차량 정비소 간 차량부품 중개 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 차량 정비소 간 차량부품 중개 서비스 제공 시스템에 포함된 각 구 성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터 가 송수신되는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설"}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "명한 다양한 실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 중개 서비스 제공 서버는, 판매자 단말로부터 차량 정비소의 위치 및 영업시간을 등록하고 (S5100), 판매자 단말에서 판매할 차량부품의 판매 데이터를 업로드하는 경우, 판매자 단말 및 차량 정비소와 매핑하여 업로드한다(S5200). 그리고, 중개 서비스 제공 서버는, 구매자 단말에서 차량부품을 검색한 후 구매 및 결제하는 경우 판매자 단말 로 결제 이벤트를 전송하고(S5300), 판매자 단말에서 차량부품의 운송장을 등록한 경우 구매자 단말로 배송 트 래킹 결과를 공유한다(S5400). 또, 중개 서비스 제공 서버는, 구매자 단말에서 수취확인을 하는 경우 판매자 단말로 대금을 정산한다(S5500). 상술한 단계들(S5100~S5500)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5500)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 차량 정비소 간 차량부품 중개 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4를 통해 차량 정비소 간 차량부품 중개 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 차량 정비소 간 차량부품 중개 서비스 제공 방법은, 컴퓨터에 의해 실행 되는 애플리케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로 도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 차량 정비소 간 차량부품 중개 서비스 제공 방법은, 단말기에 기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 차량 정비소 간 차량부품 중개 서비 스 제공 방법은 단말기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2022-0087113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다.도면 도면1 도면2 도면3a 도면3b 도면3c 도면3d 도면3e 도면3f 도면3g 도면3h 도면3i 도면3j 도면3k 도면4a 도면4b 도면4c 도면4d 도면4e 도면4f 도면4g 도면4h 도면4i 도면4j 도면4k 도면4l 도면4m 도면4n 도면4o 도면4p 도면4q 도면4r 도면4s 도면4t 도면4u 도면4v 도면5"}
{"patent_id": "10-2022-0087113", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 차량 정비소 간 차량부품 중개 서비스 제공 시스템을 설명하기 위한 도면이 다. 도 2는 도 1의 시스템에 포함된 중개 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 차량 정비소 간 차량부품 중개 서비스가 구현된 일 실시예를 설명 하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 차량 정비소 간 차량부품 중개 서비스 제공 방법을 설명하기 위한 동작 흐 름도이다."}
