{"patent_id": "10-2015-0182277", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0073398", "출원번호": "10-2015-0182277", "발명의 명칭": "웨어러블 전자장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "정한수"}}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웨어러블 전자장치에 있어서,시침 및 분침을 통해 시계 화면을 표시하는 디스플레이와,프로세서를 포함하며,상기 프로세서는 시간 정보를 가지는 아이콘을 표시하는 어플리케이션을 실행하며, 상기 어플리케이션이 실행되면 상기 시계 화면의 분침 및/또는 시침 회전 영역의 상기 시간 정보 위치에 상기 아이콘을 표시하는 장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 어플리케이션은 외부 장치에서 전송되는 교통 수단의 도착/출발 시간 정보를 표시하는 교통 어플리케이션이며,상기 아이콘은 교통 수단 아이콘인 장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는 상기 교통 수단 아이콘이 선택되면 선택된 교통 수단의 상세 도착/출발 시간 정보를 표시하는장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 회전되는 베젤을 더 포함하며,상기 프로세서는 상기 베젤의 회전을 나타내는 표시 인디케이터를 표시하며, 상기 표시 인디케이터 위치의 교통수단 아이콘을 선택하는 장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로세서는상기 시계화면, 교통 수단 아이콘, 표시 인디케이터를 서로 다른 레이어에 표시하는 장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서, 상기 교통수단은 버스이며,상기 프로세서는 상기 버스 아이콘이 선택되면 선택된 버스의 번호, 도착시간 및/또는 잔여 좌석 등의 상세 도공개특허 10-2017-0073398-3-착 정보를 표시하는 장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 프로세서는 교통 어플리케이션의 시계 화면에 설정 아이콘을 표시하며, 상기 설정 아이콘이 선택되면 정류소 및/또는 버스 번호를 설정하는 장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는 복수의 정류소를 설정할 수 있으며,상기 교통 어플리케이션의 화면에서 특정 위치가 선택되면 설정된 다음 정류소의 화면으로 전환하여 표시하는장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 프로세서는 설정 아이콘이 선택되면 추가 옵션 아이콘을 표시하며,상기 추가 옵션 아이콘이 선택되면 버스 번호를 삭제할 수 있는 삭제 아이콘을 포함하는 정보를 표시하는 장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서, 상기 프로세서는 설정된 정류소에 가장 빨리 도착하는 버스의 상세 정보를 표시하는 미니 어플리케이션을 포함하며,상기 미니 어플리케이션 화면에서 특정 위치를 선택하면 상기 버스 어플리케이션 화면으로 전환하는 장치."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "웨어러블 전자장치의 동작 방법에 있어서,시침 및 분침을 통해 시계 화면을 표시하는 단계와, 교통 수단의 시간 정보를 수신하는 단계와,상기 시계 화면의 분침 및/또는 시침 회전 영역의 상기 시간 정보 위치에 상기 교통수단의 아이콘을 표시하는표시 단계를 포함하는 방법."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 표시 단계는 상기 교통 수단의 설정된 정류소의 도착/출발하는 교통 수단의 아이콘들을 상기 시간 정보에 따라 표시하는 방법.공개특허 10-2017-0073398-4-청구항 13 제12항에 있어서,상기 표시 단계는상기 교통 수단 아이콘이 선택되면 선택된 교통 수단의 상세 도착/출발 시간을 표시하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 표시 단계는베젤의 회전에 따라 회전되는 표시 인디케이터를 표시하며, 상기 표시 인디케이터에 의해 지시되는 교통 수단아이콘을 선택하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 표시 단계는상기 시계화면, 교통 수단 아이콘, 표시 인디케이터를 서로 다른 레이어에 표시하는 방법."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서, 상기 교통수단은 버스이며,상기 표시 단계는상기 버스 아이콘이 선택되면 선택된 버스의 번호, 도착시간 및/또는 잔여 좌석 등의 상세 정보를 표시하는 방법."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 표시 단계는 시계 화면에 버스 큐 및 설정 아이콘을 표시하며, 상기 설정 아이콘이 선택되면 정류소 및/또는 버스 번호의 목록을 표시하는 단계와,상기 표시되는 목록에 선택된 버스 정류소 및 버스 번호를 등록하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 표시 단계는상기 시계 화면의 특정 위치가 선택되면 설정된 다음 정류소의 화면으로 전환하여 표시하는 단계를 더 포함하는공개특허 10-2017-0073398-5-방법."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서, 상기 표시 단계는 설정 아이콘이 선택되면 추가 옵션 아이콘을 표시하는 단계와, 상기 추가 옵션 아이콘이 선택되면 버스 번호를 삭제할 수 있는 삭제 아이콘을 포함하는 정보를 표시하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-0182277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서, 상기 표시단계는 설정된 정류소에 가장 빨리 도착하는 버스의 상세 정보를 표시하는 미니 어플리케이션을 수행하는 단계와, 상기 미니 어플리케이션 화면에서 특정 위치를 선택하면 버스 어플리케이션의 화면을 표시하는 상기 표시 단계로 전환하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-0182277", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 웨어러블 전자장치 및 그 동작 방법에 관한 것이다. 본 발명의 다양한 실시 예에 따르면, 웨어러블 전자장치는 시침 및 분침을 통해 시계 화면을 표시하는 디스플레이와, 프로세서를 포함하며, 상기 프로세서는 시 간 정보를 가지는 아이콘을 표시하는 어플리케이션을 실행하며, 상기 어플리케이션이 실행되면 상기 시계 화면의 분침 및/또는 시침 회전 영역의 상기 시간 정보 위치에 상기 아이콘을 표시할 수 있다. 다양한 실시 예들이 가능 하다."}
{"patent_id": "10-2015-0182277", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 웨어러블 전자장치 및 그의 동작 방법에 관한 것이다."}
{"patent_id": "10-2015-0182277", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 디지털 기술의 발달과 함께 이동통신 단말기, 스마트 폰(smart phone), 태블릿(tablet) PC(Personal Computer), PDA(Personal Digital Assistant), 전자수첩, 노트북(notebook) 또는 웨어러블 디바이스(wearable device) 등과 같은 다양한 유형의 전자 장치가 널리 사용되고 있다. 상기 전자 장치는, 다른 장치들의 기능까 지 아우르는 모바일 컨버전스(mobile convergence) 단계에 이르고 있다. 예를 들어, 전자 장치는 음성통화 및 영상통화 등과 같은 통화 기능, SMS(Short Message Service)/MMS(Multimedia Message Service) 및 전자메일(e- mail) 등과 같은 메시지 송수신 기능, 전자수첩 기능, 촬영 기능, 방송 재생 기능, 동영상 재생 기능, 음악 재 생 기능, 인터넷 기능, 메신저 기능, 게임 기능, 또는 소셜 네트워크 서비스(SNS, Social Networking Service) 기능 등을 제공할 수 있다. 전자장치는 다양한 형태로 디자인되고 있다. 이런 형태 중의 하나가 웨어러블 전자장치가 될 수 있다. 웨어러블 전자장치는 사용자의 신체 일부분에 착용 될 수 있다."}
{"patent_id": "10-2015-0182277", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "웨어러블 전자장치는 대중 교통의 운행 시간을 제공하는 어플리케이션을 탑재하여 지하철, 버스 등의 운행 정보 를 표시할 수 있다. 일반적인 어플리케이션의 경우, 대중 교통의 정보를 리스트 형태로 표시하기 때문에 문자를 교통 정보를 문자로 인식하여야 했다. 또한 전자장치에 표시되는 교통 정보는 작은 화면 사이즈에 많은 정보가 표시되어 인식하기 어려울 수 있었다. 또한 전자장치에 표시되는 교통 정보는 단일 정류장 또는 단일 버스에 대한 정보만 제공하고 있다. 즉, 전자장치에 표시되는 교통정보는 사용자에게 필요한 정보가 통합/정리되지 않은 정보가 될 수 있으며, 하나의 화면에 하나의 교통 정보만을 표시할 수 있었다. 본 발명의 다양한 실시 예들에서는 외부(예를들면, content provider)에서 제공되는 교통 정보를 웨어러블 전자 장치의 화면에 효율적으로 표시할 수 있는 장치 및 방법을 제공할 수 있다. 본 발명의 다양한 실시 예들에 따른 전자장치는 교통정보를 표시할 때, 사용자가 직관적으로 시간 정보를 인지 할 수 있도록 웨어러블 전자장치의 화면 위에서 교통 수단의 도착 정보를 아이콘 이미지를 표시할 수 있는 장치 및 방법을 제공할 수 있다. 본 발명의 다양한 실시예에 따른 전자장치는 시간을 표시하는 웨어러블 전자장치가 될 수 있으며, 웨어러블 전 자장치는 시침/분침에 대응되는 위치에 교통 수단의 아이콘 이미지들을 배치하여 도착 정보를 표시할 수 있는 장치 및 방법을 제공할 수 있다. 본 발명의 다양한 실시예에 따른 전자장치는 시간을 표시하는 웨어러블 전자장치가 될 수 있으며, 웨어러블 전 자장치는 버스의 도착 시간을 표시할 때 분침의 반경 내의 도착 시간 위치에 대응되는 버스 아이콘 이미지를 표 시할 수 있는 장치 및 방법을 제공할 수 있다."}
{"patent_id": "10-2015-0182277", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예들에 따른 웨어러블 전자장치는, 시침 및 분침을 통해 시계 화면을 표시하는 디스플레 이와, 프로세서를 포함하며, 상기 프로세서는 시간 정보를 가지는 아이콘을 표시하는 어플리케이션을 실행하며, 상기 어플리케이션이 실행되면 상기 시계 화면의 분침 및/또는 시침 회전 영역의 상기 시간 정보 위치에 상기 아이콘을 표시할 수 있다. 본 발명의 다양한 실시예에 따른 웨어러블 전자장치의 동작 방법은, 시침 및 분침을 통해. 시계 화면을 표시하 는 단계와, 교통 수단의 시간 정보를 수신하는 단계와, 상기 시계 화면의 분침 및/또는 시침 회전 영역의 상기 시간 정보 위치에 상기 교통수단의 아이콘을 표시하는 표시 단계를 포함할 수 있다."}
{"patent_id": "10-2015-0182277", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예들에 따른 웨어러블 전자 장치 및 그 동작 방법은, 사용자의 설정을 바탕으로 통합/정 리된 교통 정보를 시계 화면의 특성을 이용하여 시계 위에 효과적으로 구성하여 표시할 수 있으며, 교통 정보를 확인하기 위한 사용자 인터렉션을 줄이고 직관적으로 시간 정보 및 교통 수단의 도착/출발 시간을 인식할 수 있 다."}
{"patent_id": "10-2015-0182277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다.본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구성요 소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상 의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으 며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시예들을 배제하도록 해석될 수 없다. 본 발명의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션 (workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다 양한 실시예에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나를 포함할 수 있 다. 상기 웨어러블 장치는 플렉서블 장치가 될 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전 자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 본 발명 의 다양한 실시예들에서 전자장치는 시간을 표시할 수 있는 웨어러블 전자장치일 수 있다. 웨어러블 전자장치는 시계 기능을 포함할 수 있다. 본 발명의 다양한 실시예에 따른 웨어러블 전자장치는 아날로그 시계가 표시되는 화면에 교통 수단의 도착 정보를 표시할 수 있는 장치 및 방법을 제공할 수 있다. 이하의 설명에서 교통 수단은 버스인 경우를 예로들어 설명하기로 한다. 일반적으로 사용자들이 이용하는 버스 노선은 집과 직장, 집과 학교 등으로 일정한 노선을 가질 수 있다. 따라 서 사용자가 버스 도착 정보를 확인할 때 제한된 버스 정류장과 노선들을 반복적으로 확인하게 될 수 있다. 예 를들면, 사용자가 출근 및 최근시 버스를 탑승하는 정류소와 버스를 내리는 정류소는 일정할 수 있다. 현재 여 러 어플리케이션에서 버스 도착 정보를 제공하고 있다. 일반 전자장치(예를들면, 스마트 폰)을 사용하는 경우, 사용자는 전자장치를 조작하여 해당하는 어플리케이션에 진입하고, 원하는 버스 노선들을 탐색하여야 한다. 사 용자는 최적의 버스를 찾기까지 여러 번의 인터렉션(interaction)을 필요로 하며, 표시되는 버스의 도착 정보는 리스트 기반의 텍스트 정보를 읽어 확인할 수 있었다. 또한 교통 정보를 표시하는 전자장치는 접근성 측면에서 일반 전자장치보다 웨어러블 전자장치(예를들면, Gear S2와 같은 Smart Watch)가 더 좋을 수 있지만, 작은 화면 으로 인해 여러가지 정보를 한 번에 표시하기 어려울 수 있었다. 본 발명의 다양한 실시예에 따른 전자장치는 시침/분침으로 시간을 표시할 수 있는 시계 기능(예를들면, 아날로 그 시계 표시 기능)을 가지는 웨어러블 전자장치가 될 수 있다. 그리고 본 발명의 다양한 실시예에 따른 웨어러 블 전자장치는 아날로그 시계(Analog Clock)의 특성을 이용하여 사용자의 설정을 바탕으로 통합/정리된 교통 정 보를 시계 화면 상에 표시할 수 있는 장치 및 방법을 제공할 수 있다. 웨어러블 전자장치는 교통 수단의 정보를 제공하는 서버로부터 전송되는 교통 정보(예를들면, 버스 도착 시간, 잔여 좌석 등)를 시계 화면에 현재의 시간 과 함께 표시할 수 있다. 본 발명의 다양한 실시예에 따른 웨어러블 전자장치는 사용자가 직관적으로 현재의 시 간 및 교통 수단의 도착 시간을 인지할 수 있도록 화면을 표시할 수 있으며, 버스 정보를 표시할 때 레이어 구 조 및 아이콘의 위치를 정의할 수 있으며, 외부 서버에서 전달되는 교통 수단의 시간 정보의 가공 방법을 정의 하고, 교통수단의 정보(예를들면, 버스 번호)를 표시할 때 유사한 번호들을 명확하게 구분할 수 있는 장치 방법 을 제공할 수 있다. 도 1은 웨어러블 전자장치를 포함하는 시스템 구성을 도시하는 도면이다. 도 1을 참조하면, 웨어러블 전자장치 110은 손목에 착용할 수 있는 전자장치이며, 시침 및 분침을 이용하여 시 간을 표시할 수 있는 아날로그 시간 표시를 할 수 있다. 제2 전자장치 120은 스마트 폰(mobile phone)이 될 수 있으며, 웨어러블 전자장치 110과 근거리 통신을 수행할 수 있다. 교통 서버 130은 교통 수단의 운행 시간 정보 를 제공하는 외부 장치(contents provider)가 될 수 있다. 웹서버 140은 제2 전자장치 120에 웹 서비스를 수행 할 수 있다. 웨어러블 전자장치 110은 교통서버 130과 무선 통신 기능을 수행할 수 있다. 웨어러블 전자장치 110은 교통 어 플리케이션이 실행되면, 대응되는 교통 수단의 정보를 교통 서버 130에 전송할 수 있으며, 상기 교통 서버 130 으로부터 교통 수단의 운행 시간 정보를 다운로드할 수 있다. 그리고 웨어러블 전자장치 110은 시침, 분침 및 초침을 이용하여 현재 시간을 시계 화면으로 표시할 수 있으며, 교통 서버 130으로부터 수신되는 교통 수단의 운행 시간 정보를 가공하여 시계 화면에 함께 표시할 수 있다. 웨어러블 전자장치 110은 교통 시간의 운행 정보 를 표시할 때 교통 수단의 아이콘 이미지로 표시할 수 있으며, 아이콘 이미지는 분 단위의 시간 정보이면 분침 의 회전 영역의 도착 시간 위치에 표시하고, 시간 단위의 시간 정보이면 시침의 회전 영역의 도착 시간 위치에 표시할 수 있다. 웨어러블 전자장치 110은 교통 수단의 도착 시간을 설정하기 위한 정류소(예를들면, 버스 정거장 ID, 역 ID, 공 항 ID 등) 및 교통 수단 정보(예를들면, 버스 번호, 열차 번호, 비행기 편명 등)를 검색하기 위하여 웹서버 140 의 정보를 필요로 할 수 있다. 웨어러블 전자장치 110은 웹서버 140에 직접 연결하여 원하는 정보를 검색할 수 있으며, 또는 제2 전자장치 120을 통해 웹서버 140에 접속되어 원하는 정보를 검색할 수도 있다. 이하의 설명에서 교통 수단은 버스인 경우를 예로들어 설명하기로 한다. 웨어러블 전자장치 100은 버스 어플리 케이션을 실행하여 시계 화면을 표시하는 상태에서 설정된 버스의 도착 예정시간을 분침의 회전 영역 또는 시침 의 회전 영역 상에 표시할 수 있다. 도 2는 본 발명의 다양한 실시예에 따른 전자장치의 구성을 도시하는 도면이다. 도 2의 전자장치는 웨어러블 전 자장치(wearable electronic device)가 될 수 있다. 이하의 설명에서 전자장치는 웨어러블 전자장치가 될 수 있 다. 도 2를 참조하면, 전자장치는 프로세서 200, 메모리 210, 통신부 220,센서부 230, 입력부240, 디스플레이 250을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 프로세서200은, 중앙처리장치(central processing unit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할수 있다. 프로세서 200은 예를 들면, 전자 장치의 적어도 하나의 다른 구성 요소들의 제어 및/또는 어플리케이 션 실행에 따른 관한 연산이나 데이터 처리를 실행할 수 있다. 프로세서 200은 버스 어플리케이션을 실행하여 버스의 도착 예정 시간을 시계 화면의 분침 회전 영역 및 시침 회전 영역 상에 아이콘 이미지로 표시할 수 있다. 메모리210은 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리 210은 전자 장치의 적어도 하나의 다 른 구성요소에 관계된 명령(command) 또는 데이터(data)를 저장할 수 있다. 메모리 210은 소프트웨어 (software) 및/또는 프로그램(program)을 저장할 수 있다. 프로그램은 커널(kernel), 미들웨어(middleware), 어플리케이션 프로그래밍 인터페이스(application programming interface(API)) 및/또는 어플리케이션 프로그 램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일부는 운영 시스템 (operating system(OS))으로 지칭될 수 있다. 통신부220은 무선 통신 모듈 및 유선 통신 모듈을 셀룰라 통신모듈을 포함할 수 있다. 무선 통신 모듈은 셀룰러 통신 모듈 및 근거리 통신 모듈을 포함할 수 있다. 셀룰라 통신모듈은 LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또 는 GSM(global system for mobile communications) 등 중 적어도 하나를 사용할 수있다. 셀룰러 통신모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등을 제공할 수 있다. 한 실시예에 따르면, 셀룰러 통신 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 통신 모듈은 프로세서 200이 제공할 수 있 는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 통신 모듈은 커뮤니케이션 프로세 서(CP: communication processor)를 포함할 수 있다. 근거리 통신 모듈은 WiFi(wireless fidelity), 블루투스(Bluetooth), NFC(near field communication), 또는 GNSS(global navigation satellite system, 또는 GPS(global positioning system)) 등 중 적어도 하나를 포함 할 수 있다. MST는 전자기 신호를 이용하여 전송 데이터에 따라 펄스를 생성하고, 펄스는 자기장 신호를 발생시 킬 수 있다. 전자장치는 자기장 신호를POS(point of sales)에 전송하고, POS는 MST 리더(MST reader)를 이용하 여 자기장 신호를 검출하고, 검출된 자기장 신호를 전기신호로 변환함으로써 데이터를 복원할 수 있다. GNSS는 사용 지역 또는 대역폭 등에 따라, 예를들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 “Beidou”) 또는Galileo, the European global satellite-based navigation system중 적어도 하나를 포함할 수 있다. 이하,“GPS”는 “GNSS”와 혼용 되어 사용(interchangeably used)될 수 있다. 유선 통신 모듈은, 예를들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS- 232(recommended standard232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 통신부 120은 버스 어플리케이션을 실행할 때, 설정된 버스 정보를 교통 서버 130에 전송할 수 있으며, 교통 서 버 130에서 전송되는 설정된 버스의 도착 정보를 수신할 수 있다. 또한 통신부 120은 웹서버 140에 접속되어 웹 정보를 검색할 수 있다. 또한 통신부 120은 제2전자장치 120과 웹 검색을 위한 정보를 통신할 수 있다. 센서부 130은 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서부130은 제스처 센서(gesture sensor), 자이로 센서(gyro sensor), 기압 센서 (barometer), 마그네틱 센서(magnetic sensor), 가속도 센서(acceleration sensor), 그립 센서(grip sensor), 근접 센서(proximity sensor), 컬러 센서(color sensor) 240H(예: RGB(red, green, blue) 센서), 생체 센서 (medical sensor), 온/습도 센서(temperature-humidity sensor), 조도 센서(illuminance sensor), UV(ultra violet) 센서 또는 전자장치의 휘어짐을 감지하는 플렉서블 감지 센서 중의 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에 따른 센서부 130은 전자장치의 베젤 회전을 감지하는 베젤 센서를 더 포함할 수 있 다. 프로세서 200은 교통 어플리케이션을 실행할 때, 베젤 센서를 통해 베젤의 회전을 인식하고, 인식된 회전 값에 대응되는 교통 아이콘의 상세 도착 정보 표시할 수 있다. 입력부 240은 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키(key) 또는 초음파(ultrasonic) 입력 부들 중에 적어도 하나의 입력부를 포함할 수 있다. 터치 패널은 정전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서 는, 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 키는 물리적인 버튼, 광학식 키, 또는 키패드(keypad)를 포함할 수 있다. 초음파 입력부는 마이크를 통해, 입력 도구에서 발생된 초음파를 감지 하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 본 발명의 다양한 실시예에 따른 입력부는 터 치 패널이 될 수 있으며, 터치패널은 압력 센서 기능을 포함할 수 있다. 디스플레이 250은 액정 디스플레이(liquid crystal display(LCD)), 발광 다이오드(light-emitting diode(LED)) 디스플레이, 유기 발광 다이오드(organic light-emitting diode(OLED)) 디스플레이, 또는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이250은 사용자에게 다양한 화면(예: 텍스트(text), 이미지(image), 비디오(video), 아이콘(icon), 또는 심볼(symbol) 등)을 표시할 수 있다. 입력부 240과 디스플레이 250은 각각 일체형의 터치 스크린(touch screen)으로 구성될 수 있다. 터치스크린은 프로세서 200의 제어 하에 화면을 표시할 수 있으며, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치 (touch), 제스처(gesture), 근접(proximity), 또는 호버링(hovering) 입력을 검출할 수 있다. 이하에서 설명되는 본 발명의 다양한 실시 예들에서는, 상기 웨어러블 전자장치는 상기와 같은 전자 장치의 범 주에 포함될 수 있으며, 전자 장치들 간에 연동하는 동작은 상기 웨어러블 전자장치와 다양한 전자 장치에서도 동작할 수 있다. 예를 들어, 본 발명의 다양한 실시 예들에서 웨어러블 전자 장치는 본 발명의 다양한 실시 예 들에 따른 기능을 지원하는 모든 정보통신기기, 멀티미디어기기, 웨어러블 디바이스 및 그에 대한 응용기기와 같이 AP(application processor)), CP(communication processor), GPU(Graphic Processing Unit), 및 CPU(central processing unit) 등의 다양한 프로세서(예: 프로세서(220, 210)) 중 하나 또는 그 이상을 사용하 는 모든 장치를 포함할 수 있다. 또한 웨어러블 전자장치는 다른 전자장치와 연결된 상태에서, 상기 전자 장치에 디바이스의 연결 또는 연결 해 제에 따라 전자 장치와 웨어러블 디바이스 간에 상기 디바이스에 대응하는 기능을 연계하여 수행할 수 있도록 하는 동작을 수행할 수 도 있다. 프로세서200은 메모리 210을 이용하여 어플리케이션의 실행을 제어할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈(home), 다이얼러(dialer), SMS/MMS(short messaging service/multimedia messaging service), IM(instant message), 브라우저(browser), 카메라, 알람, 컨택트(contact), 음성 다이얼, 이메일, 달력, 미디어 플레이어, 앨범, 시계, 건강 관리(health care)(예: 운동량 또는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케 이션을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 전자 장치와 외부 전자장치(다른 전자장치) 사이의 정보 교환을 지원하는 어플리케이션(\"정보 교환 어플리케이션\"이라 칭함)을 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달(notification relay) 어플리케이션, 또는 외부 전자 장 치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치의 적어도 하나의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 외부 전 자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서 비스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시예에 따르면, 어플리케이션은 외부 전자 장치의 속성(에 따라 지정된 어플리케이션(예: 모바일 의료 기 기의 건강 관리 어플리케이션 등)을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 외부 전자 장치로부 터 수신된 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 프리로드 어플리케이션 (preloaded application) 또는 서버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 본 발명의 실시예에 따르면, 교통 어플리케이션은 전자장치에서 시계 화면을 이용하여 교통 정보를 시각화하여 직관적으로 인식할 수 있도록 제공할 수 있다. 교통 어플리케이션은 아날로그 시계 화면 위에 교통 아이콘 이미 지를 표시할 수 있으며, 시계의 중심점에서의 거리(예를들면, 시침의 길이, 분침의 길이)와 현재 시간을 표시하 는 시침/분침과의 각도를 조합하여 현재 시간과의 차이에 따른 위치에 교통 아이콘 이미지를 표시할 수 있다. 본 발명의 실시예에 따른, 전자장치는 교통 어플리케이션과 교통 미니 어플리케이션을 이용하여 교통 수단의 도 착 정보를 표시할 수 있다. 어플리케이션은 설치 과정을 통해서 직접 운영체제에 연동해서 자원을 효과적으로 사용하는 것을 의미할 수 있다. 미니 어플리케이션은 운영체제나 어플리케이션과 직접 연동하는 것이 아니라, 미니 어플리케이션 엔진이나 내장된 형태로 운영체제 또는 어플리케이션과 연동하는 것을 의미할 수 있다. 상기 미니 어플리케이션은 위젯(widget)이 될 수 있다. 위젯은 사용자와 어플리케이션, 운영체제와 상호 작용을 원활 하게 지원해주는 GUI(graphic user interface)의 하나인 미니 어플리케이션이 될 수 있다. 교통 위젯은 전자장 치의 화면에서 설정된 교통 수단의 정보를 표시할 수 있으며, 교통 어플리케이션의 일부 정보를 표시할 수 있다. 이하에서 설명되는 본 발명의 다양한 실시 예들에서는 하드웨어적인 접근 방법을 예시로서 설명한다. 하지만, 본 발명의 다양한 실시 예들에서는 하드웨어와 소프트웨어를 모두 사용하는 기술을 포함하고 있으므로, 본 발명 의 다양한 실시 예들이 소프트웨어 기반의 접근 방법을 제외하는 것은 아니다. 도 3a - 도 3c는 본 발명의 다양한 실시예에 따른 전자장치의 구성을 도시하는 도면이다. 도 3a는 본 발명의 다 양한 실시예에 따른 전자 장치의 사시도이다. 도 3a를 참조하면, 전자 장치 100은 사용자의 손목에 착용할 수 있는 손목 착용형 웨어러블(wearable) 전자 장 치를 도시하고 있다. 한 실시예에 따르면, 전자 장치 100은 본체 310과, 본체 310에 장착되는 연결부(예: 스트 랩) 330을 포함할 수 있다. 한 실시예에 따르면, 전자 장치 100은 본체 310을 손목에 올려놓은 상태에서 연결부 330을 손목에 감는 방식으로 착용될 수 있으며, 연결부 330에는 일정 간격으로 복수의 손목 조절용 개구(미도시 됨)를 포함하여 사용자의 손목에 맞게 착용 위치를 조절할 수 있다. 한 실시예에 따르면, 연결부 330은 금속, 가죽, 러버, 실리콘, 우레탄 중 적어도 하나의 재질로 형성될 수 있다. 다양한 실시예에 따르면, 본체 310은 디스플레이 250을 포함할 수 있다. 디스플레이 250은 터치 스크린 방식으 로 적용될 수 있다. 한 실시예에 따르면, 본체 310의 적소에는 적어도 하나의 키 버튼(미도시 됨)이 배치될 수 있다. 한 실시예에 따르면, 전자 장치 100은 내부에 전원 공급 수단으로 배터리(예: 충전용 배터리 등)가 적용 될 수 있고, 소정의 휴대용 충전 크래들(cradle)에 선택적으로 장착되어 배터리를 충전시키도록 구현될 수도 있 다. 다양한 실시예에 따르면, 전자 장치 100은 본체 310에서 회전 가능하게 설치되는 회전체 320을 포함할 수 있다. 한 실시예에 따르면, 회전체 320은 본체 310에 배치되는 디스플레이 250 전체를 감싸는 방식으로 설치될 수 있 다. 한 실시예에 따르면, 전자 장치 100은 손목 착용형 전자 장치일 경우, 상기 회전체 320은 회전 가능한 베젤 (bezel) 방식으로 배치될 수 있다. 한 실시예에 따르면, 회전체 320은 z-축을 회전축으로 시계 방향 또는 반시 계 방향으로 회전될 수 있으며, 최대 360도로 회전량이 제한되거나, 무한 회전되도록 구성될 수도 있다. 한 실 시예에 따르면, 회전체 320은 테두리를 따라 상면에 인디케이터 325를 포함할 수 있다. 한 실시예에 따르면, 인 디케이터 325는 회전체 320에 도료를 도포하거나, 각인되는 방식 또는 디스플레이를 구비하는 형태로 형성될 수 있다. 한 실시예에 따르면, 인디케이터 325는 사용자가 용이하게 볼 수 있는 위치에 배치되어, 회전체 320의 회 전 방향, 회전량을 사용자에게 용이하게 인지시킬 수 있다. 다양한 실시예에 따르면, 회전체 320은 외주면에 배치되는 적어도 하나의 기능 윈도우 324를 포함할 수 있다. 한 실시예에 따르면, 본체 310에는 다양한 센서들을 포함하는 센서부 130이 배치될 수 있다. 기능 윈도우 324는 회전체 320의 회전에 따라 센서 장치들 중 적어도 하나의 센서와 대응하는 위치에 배치될 수 있다. 한 실시예에 따르면, 프로세서 200은 베젤 센서에 의해 회전체 320의 회전 위치를 감지할 수 있으며, 회전체 320의 회전에 따른 기능 윈도우 324의 위치에 따라 대응되는 센서의 기능을 자동으로 수행하거나 디스플레이 250에 표시할 수 있다. 본 발명의 다양한 실시예에 따른 전자장치는 다양한 실시예에 따르면, 전자 장치 100은 기능 윈도우 324 와 관계 없이 회전체 320의 회전 파라미터에 따라 다양한 기능을 수행할 수도 있다. 한 실시예에 따르면, 회전 파라미터는 회전체의 회전 방향, 회전 속도, 회전량, 회전된 위치 중 적어도 하나를 포함할 수 있다. 도 3b는 본 발명의 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 3b를 참고하면, 전자 장치 100은 본체 310과, 본체 310에 회전 가능하게 설치되는 회전체 320을 포함할 수 있다. 한 실시예에 따르면, 본체 310은 내부 공간에 각종 전자 부품이 배치될 수 있다. 한 실시예에 따르면, 전자 부품은 디스플레이 모듈 313을 포함할 수 있다. 디스플레이 모듈 313은 터치 방식의 입력 감지 센서를 포함 할 수 있다. 한 실시예에 따르면, 디스플레이 모듈 313은 전자 펜에 의한 호버링 방식의 간접 터치를 인식하기 위한 입력 감지 센서(예: 디지타이저)를 포함할 수도 있다. 다양한 실시예에 따르면, 전자 부품은 회전체 320의 회전을 감지할 수 있는 회전 검출 부재 314를 포함할 수 있 다. 회전 검출 부재 314는 베젤의 회전을 감지하는 베젤 센서가 될 수 있다. 한 실시예에 따르면, 회전 검출 부 재 314는 회전체 320에 일정 간격으로 형성된 복수의 개구를 검출하기 위한 엔코더 센서일 수 있다. 한 실시예 에 따르면, 회전 검출 부재 314는 회전체 320에 형성된 특정 패턴을 검출하는 이미지 센서일 수도 있다. 회전 검출 부재 314는 적외선 센서일 수도 있다. 회전 검출 부재 314는 포토 커플러일 수도 있다. 다양한 실시예에 따르면, 전자 부품은 본체 310에 배치되는 다양한 센서 장치를 포함할 수 있다. 한 실시예에 따르면, 센서 장치는 카메라 센서, 지문 인식 센서, 적외선 센서, HRM 센서, 포토 센서, 근접 센서, 조도 센서, 온도 센서 등 다양한 센서들을 포함할 수 있다. 한 실시예에 따르면, 회전체 320에 포함되는 기능 윈도우 324를 통하여 기능을 수행할 경우, 대응 센서들은 전자 장치 100의 회전체 320이 설치되는 대응 외주면에 노출될 수 있는 방식으로 배치될 수 있다. 다양한 실시예에 따르면, 본체 310의 회전체 320이 회전 가능하게 설치되는 외주면 311에는 적어도 하나 이상의 걸림 부재(예: 디텐트(detent), 래치(ratch)) 315가 배치될 수 있다. 걸림 부재 315는 본체 310에서 회전체 320과 접촉하는 방식으로 설치되며, 회전체 320의 회전된 위치를 유지시켜줄 수 있다. 한 실시예에 따르면, 걸 림 부재 315는 사용자가 회전체 320를 회전시킬 때, 사용자에게 회전감(예: 클릭감)을 제공할 수도 있다. 다양한 실시예에 따르면, 회전체 320은 중공형 방식으로 형성되며, 본체 310의 외주면 311을 내주면 321이 감싸 는 방식으로 회전 가능하게 설치될 수 있다. 한 실시예에 따르면, 회전체 320은 내주면 321을 따라 상술한 회전 검출 부재 314에 의해 검출되기 위한 피 검출 수단 322가 배치될 수 있다. 한 실시예에 따르면, 회전 검출 부재 314가 이미지 센서일 경우, 피 검출 수단 322는 흑색과 백색이 교번하여 형성된 샌딩 패턴일 수 있다. 한 실시 예에 따르면, 회전 검출 부재 314가 이미지 센서일 경우, 피 검출 수단 322는 특정 패턴이 샌딩된 형태일 수 있 다. 이러한 경우, 이미지 센서는 샌딩된 특정 패턴을 확인하여 회전체의 회전 위치를 검출하여 전자 장치의 프 로세서에 제공할 수도 있다. 다양한 실시예에 따르면, 회전체 320은 내주면 321을 따라 형성되는 걸림홈 323을 포함할 수 있다. 한 실시예에 따르면, 걸림홈 323은 회전체 320의 내주면 321을 따라 연속적으로 형성될 수 있다. 한 실시예에 따르면, 회전 체 320이 본체 310에 회전 가능하게 장착된 후, 일정 방향으로 회전될 경우, 걸림 부재 315는 하나의 걸림홈에 서 이웃하는 걸림홈을 타고 넘는 방식으로 동작하여, 사용자에게 회전체 320의 회전에 따라 일정 회전 각도 마 다 걸림 느낌(예: 클릭감)을 제공할 수 있다. 다양한 실시예에 따르면, 회전체 320은 상면에 인디케이터(indicator) 325를 포함할 수 있다. 인디케이터 325는 각인되거나 프린팅되는 방식으로 형성될 수 있다. 한 실시예에 따르면, 인디케이터 325는 사용자에게 회전체 320의 회전량, 회전 방향을 용이하게 인지할 수 있는 회전 관련 정보를 제공할 수 있다. 다양한 실시예에 따르면, 회전체 320의 외주면 327에는 기능 윈도우 324가 배치될 수 있다. 한 실시예에 따르면, 기능 윈도우 324는 투명 재질 또는 반투명 재질로 형성될 수 있다. 한 실시예에 따르면, 기능 윈도우 324는 글라스 재질 또는 합성 수지 재질로 형성될 수 있다. 한 실시예에 따르면, 기능 윈도우 324는 회전체 320 이 본체 310과 회전 가능하게 조립되었을 경우, 기능 윈도우 324를 통해 본체 310의 외주면 311에 노출되는 센 서 316, 317의 기능을 수행할 수 있는 방식으로 배치될 수 있다. 다양한 실시예에 따르면, 본체 310은 디스플레이 모듈 313을 보호하고, 전자 장치 100의 외관을 형성하는 본체 윈도우 240을 포함할 수 있다. 한 실시예에 따르면, 본체 윈도우 240이 본체 310에 조립된 상태에서 회전체 320 이 본체 310에 회전 가능하게 설치될 수 있다. 한 실시예에 따르면, 회전체 320은 합성 수지 재질 또는 금속 재 질로 형성될 수 있다. 도 3c는 본 발명의 다양한 실시예에 따른 전자 장치 100의 결합된 상태를 도시한 요부 단면도이다. 도 3c를 참조하면, 전자 장치100은 본체 윈도우 240을 포함하는 본체 310과 본체 310에 회전 가능하게 설치되는 회전체 320을 포함할 수 있다. 한 실시예에 따르면, 본체 310의 외주면 311에는 가이드 리브 318이 돌출될 수 있다. 한 실시예에 따르면, 회전체 320의 대응 위치에는 가이드 홈 326이 형성될 수 있다. 따라서, 본체 310에 회전체 320이 설치될 경우, 본체 310의 가이드 리브 318은 회전체 320의 가이드 홈 326에 삽입된 후, 가이드됨 으로써, 회전체 320은 본체 310에서 이탈되지 않고 단속받으면서 회전 동작을 수행할 수 있다. 한 실시예에 따르면, 가이드 리브 318이 회전체 320에 설치되고, 본체 310의 대응 위치에 가이드 홈 326이 형성될 수도 있다. 다양한 실시예에 따르면, 회전 검출 부재 314는 본체 310의 내부 공간 312에 설치되어, 회전하는 회전체의 내주 면에 배치되는 피 검출 수단을 개구 319를 통해 감지할 수 있도록 설치될 수 있다. 한 실시예에 따르면, 회전 검출 부재 314는 엔코더 센서, 광 센서, 이미지 센서 중 적어도 하나일 수 있다. 한 실시예에 따르면, 회전 검 출 부재 314는 본체 310의 내부 공간 312에 배치되었으나, 이에 국한되지 않는다. 예컨대, 공간이 허여될 경우, 본체 310 및 회전체 320 사이의 공간에서 본체 310의 외주면 311에 설치될 수도 있다. 다양한 실시예에 따르면, 걸림 부재 315는 본체 310의 내부 공간 312를 통하여 외주면 311에 돌출되도록 설치되 어 회전체 320의 내주면 321에 형성된 걸림홈 323에 걸리는 방식으로 배치될 수 있다. 한 실시예에 따르면, 걸 림 부재 315는 본체 310의 외주면 311에 부착되는 방식으로 배치될 수도 있다. 한 실시예에 따르면, 걸림 부재 315는 스프링을 이용한 디텐트(detent) 또는 랫치(ratch)일 수 있다. 본 발명의 다양한 실시예에 따른 회전체 320(예를들면, 베젤)의 회전되면, 프로세서 200은 회전 검출 부재 314 인 베젤 센서에 의해 베젤의 회전 정보(예를들면, 회전각, 회전량)를 인식할 수 있다. 예를들면, 본 발명의 실 시예에 따른 전자장치는 교통 어플리케이션을 실행하는 상태에서 상기 베젤의 회전이 인식되면, 베젤의 회전량 에 따른 위치에 표시되는 교통 수단의 도착 상세 정보를 표시할 수 있다. 도 4a - 도 4c는 본 발명의 다양한 실시예에 따른 전자장치에서 교통 수단의 도착 시간을 표시하는 예를 도시하 는 도면이다. 도 4a를 참조하면, 디스플레이 250에 표시되는 시계 화면은 시침 410 및 분침 450에 의해 시간을 표시하는 아날 로그 시계 화면이 될 수 있다. 도 4a의 시계 화면에서 시침 410의 1회전은 12시간이 될 수 있으며, 분침 450의 1회전은 60분이 될 수 있다. 본 발명의 다양한 실시예에 따른 전자장치는 아날로그 시계(round clock)의 특성을 이용하여 현재의 시침 410과 분침 450의 거리와 각도를 이용하여 버스의 도착 정보를 표시할 수 있다. 도 4a에 서 시침 410의 회전 영역 415 상에 위치되는 버스 아이콘 420(시침의 길이와 동일한 직경을 가지는 버스 아이콘)은 해당하는 버스가 도착하는 시간(time of arrival)의 시간(hours) 정보를 나타내며, 분침 450의 회전 영역 455 상에 위치되는 버스 아이콘 460(분침의 길이와 동일한 직경을 가지는 버스 아이콘)은 해당하는 버스가 도착하는 시간(time of arrival)의 분(minutes)의 정보를 나타낼 수 있다. 그리고 시침 410 및 분침 450과 버 스 아이콘 420 및 460의 각도는 시간(time)의 크기를 나타낼 수 있다. 도 4b를 참조하면, 분침 450의 길이를 A라고 하면, 분 단위의 도착 시간 정보를 가지는 버스 460은 분침 450의 회전 영역에 위치되는 도착 시간 위치에 배치될 수 있다. 한 실시예에 따르면, 분 단위의 도착 시간을 가지는 버스 460은 중점에서 A` 거리 떨어진 위치에 표시될 수 있으며, A=A`이 될 수 있다. 이때 분침 450과 버스 460 사이의 각도는 분 차이(예를들면, 현재 시간과 버스 도착 시간의 차이)가 될 수 있다. 이때 5분은 30도가 될 수 있다. 도 4b의 경우, 분침 450과 버스 460의 각도 차이는 120도가 될 수 있으며, 현재 시간과 버스 도착 시간의 차이는 20분이 될 수 있다. 도 4c를 참조하면, 시침 410의 길이를 B라고 하면, 시간 단위의 도착 시간 정보를 가지는 버스 420은 시침 410 의 회전 영역에 위치되는 도착 시간 위치에 배치될 수 있다. 한 실시예에 따르면, 시간 단위의 도착 시간을 가 지는 버스 420은 중점에서 B` 거리 떨어진 위치에 표시될 수 있으며, B=B`이 될 수 있다. 이때 시침 410과 버스 420 사이의 각도는 시간 차이(예를들면, 현재 시간과 버스 도착 시간의 차이)가 될 수 있다. 이때 1시간은 30도 가 될 수 있다. 도 4c의 경우, 시침 410과 버스 420의 각도 차이는 150도가 될 수 있으며, 현재 시간과 버스 도 착 시간의 차이는 5 시간이 될 수 있다. 전자장치 110은 버스 어플리케이션이 실행되면, 설정된 버스 정류소 ID 및 버스 번호 등을 포함하는 정보를 서 브 130에 전송할 수 있다. 그러면 서버 130은 설정된 시간 주기로 갱신되는 버스 도착 정보를 텍스트 형태로 상 기 전자장치 110에 전송할 수 있다. 이때 전송되는 버스 도착 정보는 하기 <표 1> 같은 형태를 가질 수 있다.표 1 <delayYn1>N</delayYn1> <delayYn2>N</delayYn2> <flag>PASS</flag> <locationNo1>2</locationNo1> <locationNo2>10</locationNo2> <lowplate1>0</lowplate1> <lowplate2>0</lowplate2> <plateNo1>경기77바2403</plateNo1> <plateNo1>경기77바3604</plateNo2> <predictTime1>5</predictTime1> <predictTime2>23</predictTime2> <remainSeatCnt1>26</remainSeatCnt1> <remainSeatCnt2>30</remainSeatCnt2> <routeID>234001285</routeID> <stationID>121000921</stationID> 상기 <표 1>과 같은 도착 정보는 다음과 같은 버스들의 도착 정보를 가지고 있다. 설정된 정류소 ID(route ID) 는 234001285이며, 설정된 정류소에 도착하는 버스는 두 대인 예를 도시하고 있다. 상기 <표 1>에서 경기 77 바 2403 버스가 도착하는 시간(predict time)은 5분 후이며, 잔여 좌석수는 26개임을 나타내고 있다. 상기 <표 1> 에서 경기 77 바 3604 버스가 정류수에 도착하는 시간(predict time)은 23분 후이며, 잔여 좌석수는 30개임을 나타내고 있다. 상기 <표 1>과 같이 서버 130은 전자장치 110에 설정된 버스 정류소에 도착하는 버스들의 도착 정보를 텍스트 형태로 전송할 수 있다. 이때 버스 도착 정보의 도착 예정 시간은 몇 분 후, 또는 몇 초 후로 전달될 수 있다. 그러면 전자장치는 상기 도착 예정 시간을 디스플레이 250에 표시되는 시계 화면에 도 4a와 같이 현재 시간을 기준으로 표시할 수 있다. 따라서 전자장치 110의 사용자는 자신이 설정된 버스 정류소에서 설정된 버스들의 도착 시간을 시계 화면 상에서 확인할 수 있다. 도 5a - 도 5c는 본 발명의 다양한 실시예에 따른 전자장치의 교통 수단 표시 방법을 설명하는 도면이다. 도 5a를 참조하면, 전자장치 110은 손목 시계 형태의 웨어러블 전자장치가 될 수 있다. 전자장치 110의 디스플 레이 250에는 도 5a와 같이 시침/분침으로 시간을 표시하는 아날로그 시계 화면이 표시될 수 있다. 전자장치 110은 상기 <표 1>과 같은 버스 도착 정보가 수신되면, 버스 도착 예정 시간을 확인하고, 현재 시간과 도착 예 정 시간의 차이에 따라 순서대로 버스 아이콘들을 배치할 수 있다. 이때 분 단위의 시간 차이를 갖는 경우에는 도 4b와 같이 분 침의 회전 영역에 버스 아이콘들을 배치하고, 시간 단위의 차이를 갖는 경우에는 도 4c와 같이 시 침의 회전 영역에 버스 아이콘들을 배치할 수 있다. 도 5b를 참조하면, 전자장치는 시계 화면과 버스 도착 정보를 표시하는 화면을 다른 레이어로 표시할 수 있다. 예를들면, 시계 화면에서 Z-order 상으로 더 위에 버스 도착 정보를 표시할 경우 시계 화면을 보면서 동시에 버 스 시간 정보도 같이 인식할 수 있다. 본 발명의 다양한 실시예에 따른 전자장치는 도 5b에 도시된 바와 같이 아날로그 시계의 판 530에 시간을 나타내는 구역이 이미 나타나 있으므로, 이를 활용하여 단순한 아이콘의 위치 로도 정보를 표시할 수 있게 된다. 예를들면, 전자장치는 레이어를 이용하여 다양한 Watch face 530 위에서 버 스 도착 정보 535를 표시할 수 있다. 또한 도 5a에 도시된 바와 같아. 꼭 Round Clock 형태의 Watch Face가 아니더라도 현재 분침에 참조번호 510과 같이 “흰 점”을 표시하여 현재 분을 나타내면, 흰 점 510을 기준으로 버스 도착 시간을 인지할 수 있다. 5c를 참조하면, 전자장치는 참조번호 550과 같이 시계 화면 및 버스 도착 정보를 표시하는 상태에서 참조번호 560과 같이 상세 도착 정보를 원하는 버스 아이콘을 터치하여 선택할 수 있다. 또한 본 발명의 다양한 실시예에 따른 전자장치는 도 3a - 도 3d와 같은 구조를 가지는 베젤을 포함할 수 있다. 그리고 사용자는 참조번호 570과 같이 베젤을 회전시켜 상세 도착 정보를 확인하기 위한 버스 아이콘을 선택할 수 있다. 그러면 전자장치는 참조 번호 550과 같이 선택된 버스의 상세 도착 정보를 표시할 수 있다. 도 6a - 도 6c는 본 발명의 다양한 실시예에 따른 전자장치에서 교통 수단의 도착 정보를 표시하는 방법을 설명 하기 위한 도면이다. 도 6a를 참조하면, 전자장치는 다양한 타입의 어플리케이션으로 버스 도착 예정 시간을 표시할 수 있다. 도 6a 에서 참조번호 610은 버스 위젯 화면의 예를 도시하고 있으며, 참조번호 520은 버스 어플리케이션 화면 예를 도 시하고 있다. 버스 위젯 화면은 설정된 버스 정류소에 첫번째로 도착하는 버스의 정보를 표시할 수 있다. 버스 어플리케이션 화면은 설정된 버스 정류소에 도착하는 버스들의 도착 예정 시간을 버스 아이콘 이미지로 표시할 수 있다. 버스 어플리케이션 화면 620은 버스 정류소에 설정된 모든 버스들의 도착 예정 시간을 표시할 수 있다. 도 6b를 참조하면, 전자장치는 버스 어플리케이션에서 시계 및 버스 도착 시간 정보를 표시할 때, 각 정보들을 서로 다른 레이어로 표시하는 예를 도시하고 있다. 도 6b는 시계 정보 & 버스 정보를 중요도에 따라 표시하는 Z-order 레이어 구조의 예를 도시하고 있다. 예를들면, 전자장치는 버스 번호와 도착 예정 시간은 가장 중요한 정보이므로 가장 상위 레이어에 표시할 수 있다. 그리고 버스 정보를 인식하기 위해서는 현재 시간도 인지되어 야 하므로 시침/분침을 다음레이어에표시할 수 있다. 도 6b는 디스플레이 250에 참조번호 630과 같이 시계 및 버스 도착 정보를 표시할 때, 참조번호 640과 같이 버스 정보(bus info)를 최상위 레이어(top layer)로 표시하 고, 시계 정보(watch face), 버스 정류소 정보(bus station info), 버스 큐(bus queue), 도착 예정 시간(time left line)의 순으로 레이어를 설정하여 표시하는 예를 도시하고 있다. 도 6c를 참조하면, 전자장치는 하나 이상의 교통 수단들을 하나의 시계 화면에 표시할 수 있다. 전자장치는 시 계 화면에 버스 도착 정보 뿐만 아니라, 시간에 관련된 다른 교통 수단의 도착 정보들로 표시할 수 있다. 예를 들면, 상위 레이어의 정보만 바꿔 주면, 전자장치는 참조번호 660 또는 670과 같이 버스, 지하철, 택시 등의 교 통정보도 나타낼 수 있다.지하철 모양의 아이콘을 분침과 같은 궤도에 표시하여 몇 분 후에 지하철이 도착하는 지 알 수 있다. 시계의 중앙 부분을 원점으로 하여 얼마나 먼 거리에 택시가 존재하는지 확인할 수 있다 사용자들이 이용하는 버스 노선은 집과 직장, 집과 학교 등으로 일정할 수 있다. 따라서 사용자가 버스 도착 정 보를 확인할 때 제한된 버스 정류장과 노선들을 반복적으로 확인하게 될 수 있다. 휴대 단말 장치는 여러 어플 리케이션에서 버스 도착 정보를 제공하고 있다. 그러나 버스의 도착 정보를 확인하기 위하여, 사용자는 휴대 단 말장치를 꺼내어 해당하는 어플리케이션에 진입하고, 원하는 버스 노선을 찾아서 버스 도착 예정시간을 확인할 수 있다. 따라서 버스의 도착 정보를 확인하기 위하여, 최적의 버스를 찾기까지 여러 번의 인터렉션 (interaction) 을 필요로 하며, 리스트 기반의 텍스트 정보를 읽어야 한다. 그리고 접근성 측면에서도 휴대 단 말장치보다는 항상 착용하고 있는 웨어러블 전자장치(예를들면, Gear S2와 같은 smart watch가 더 좋을 수 있다. 그러나 웨어러블 전자장치는 디스플레이의 크기가 제한된 크기를 가지므로, 여러가지 정보를 한 번에 표 시하기 어렵다. 본 발명의 다양한 실시예에 따른 전자장치는 웨어러블 전자장치가 될 수 있으며, 사용자의 설정 을 바탕으로 통합/정리된 교통 정보를 시계(analog clock) 화면의 특성을 이용하여 표시할 수 있다. 본 발명의 다양한 실시예에 따른 웨어러블 전자장치는 시계 화면 상에 설정된 버스 정류소의 버스 도착 정보를 함께 표시 할 수 있으며, 이로 인해 사용자의 인터렉션을 줄이고 직관적으로 시간 정보 및 버스 도착 시간 정보를 인식할 수 있다. 본 발명의 다양한 실시예에 따른 전자장치는 그리고 시계화면을 표시하는 상태에서 버스 어플리케이션의 실행에 의해 서버(content provider)에서 제공하는 교통 정보를(버스 도착 시간 등)를 효과적으로 표시할 수 있다. 본 발명의 다양한 실시예에 따른 웨어러블 전자장치는 시계 화면 위에서 버스의 도착 시간 정보를 표시할 수 있으 며, 버스의 도착 정보를 표시할 때 레이어 구조 및 아이콘의 위치 정의하고, 서버에서 전달되는 시간 정보를 직 관적으로 인식할 수 있도록 가공하고, 버스 번호를 표시할 때 유사한 번호들 사이의 명확한 구분할 수 있는 장 치 및 방법을 제안한다. 본 발명의 다양한 실시예에 따른 웨어러블 전자장치는, 시침 및 분침을 통해 시계 화면을 표시하는 디스플레이 와, 프로세서를 포함하며, 상기 프로세서는 시간 정보를 가지는 아이콘을 표시하는 어플리케이션을 실행하며, 상기 어플리케이션이 실행되면 상기 시계 화면의 분침 및/또는 시침 회전 영역의 상기 시간 정보 위치에 상기 아이콘을 표시할 수 있다. 전자장치는 상기 어플리케이션은 외부 장치에서 전송되는 교통 수단의 도착/출발 시간 정보를 표시하는 교통 어 플리케이션이며, 상기 아이콘은 교통 수단 아이콘이 될 수 있다. 상기 전자장치는 상기 교통 수단 아이콘이 선 택되면 선택된 교통 수단의 상세 도착/출발 시간 정보를 표시할 수 있다. 상기 전자장치는 회전되는 베젤을 더 포함할 수 있으며, 상기 베젤의 회전을 나타내는 표시 인디케이터를 표시하며, 상기 표시 인디케이터 위치의 교 통 수단 아이콘을 선택할 수 있다. 상기 전자장치는 상기 시계화면, 교통 수단 아이콘, 표시 인디케이터를 서로다른 레이어에 표시할 수 있다. 상기 교통수단은 버스이며, 상기 전자장치는 상기 버스 아이콘이 선택되면 선택 된 버스의 번호, 도착시간 및/또는 잔여 좌석 등의 상세 도착 정보를 표시할 수 있다. 상기 전자장치는 교통 어 플리케이션의 시계 화면에 설정 아이콘을 표시하며, 상기 설정 아이콘이 선택되면 정류소 및/또는 버스 번호를 설정할 수 있다. 상기 전자장치는 복수의 정류소를 설정할 수 있으며, 상기 교통 어플리케이션의 화면에서 특정 위치가 선택되면 설정된 다음 정류소의 화면으로 전환하여 표시할 수 있다. 상기 전자장치는 설정 아이콘이 선 택되면 추가 옵션 아이콘을 표시할 수 있으며, 상기 추가 옵션 아이콘이 선택되면 버스 번호를 삭제할 수 있다. 상기 전자장치는 설정된 정류소에 가장 빨리 도착하는 버스의 상세 정보를 표시하는 미니 어플리케이션을 포함 하며, 상기 미니 어플리케이션 화면에서 특정 위치를 선택하면 상기 버스 어플리케이션 화면으로 전환할 수 있 다. 도 7은 본 발명의 다양한 실시예에 따른 전자장치가 버스 도착 정보를 표시하는 방법을 도시하는 흐름도이다. 도 8은 본 발명의 다양한 실시예에 따른 전자장치가 버스 도착 정보를 표시하는 예를 도시하는 도면이다. 도 7을 참조하면, 버스 어플리케이션이 실행될 때, 전자장치는 711 단계에서 시계 화면을 디스플레이 250에 표 시할 수 있다. 전자장치는 시계 화면을 표시하는 상태에서 설정된 시간 주기로 외부 서버(예를들면, 설정된 버 스 정류소의 설정된 버스 도착 예정 시간을 전송하는 contents provider)로부터 상기 <표 1>과 같은 버스 도착 정보를 수신할 수 있다. 그리고 전자장치는 713단계에서 수신되는 버스 도착 정보를 분석하며, 715 단계에서 도 5b 및 도 5c와 같이 시계 화면에 표시된 버스 아이콘의 위치를 결정하고, 도 5a와 같이 시계 화면의 분침 회전 영역 및/또는 시침 회전 영역의 도착 시간 위치에 버스 아이콘을 표시할 수 있다. 이후 사용자가 시계화면에 표시되는 버스 아이콘을 선택하면, 전자장치는 717단계에서 이를 인식하고, 719단계 에서 선택된 버스의 상세 도착 정보를 표시할 수 있다. 버스 아이콘을 선택하는 방법은 전자장치의 베젤을 회전 시켜 원하는 버스 아이콘 위치를 설정할 수 있으며, 표시되는 버스 아이콘을 탭(tap)하여 버스 아이콘을 선택할 수 있다. 버스 아이콘이 선택되면, 전자장치는 선택된 버스의 번호, 도착 예정시간 및/또는 잔여 좌석 수 등을 포함하는 상세 도착 정보를 디스플레이 250에 표시할 수 있다. 이때 상세 도착 정보를 표시하는 방법은 도 8a - 도 8d와 같이 다양한 방법으로 실행할 수 있다. 도 8a와 같이 선택된 버스의 도착 예정시간을 참조번호 810과 같이 표시할 수 있다. 예를들면, “3007” 버스 아이콘이 선택 되면, 전자장치는 참조번호 810 영역에 도착 예정시간 10분을 표시할 수 있다. 또한 도 8b와 같이 현재의 시간 에서 선택된 버스 아이콘까지 참조번호 820과 같이 표시하고, 영역 825에 상세 도착 정보를 표시할 수 있다. 예 를들면, “3100” 버스 아이콘이 선택되면, 전자장치는 현재의 분침 위치에서 3100번 버스 아이콘 위치까지 참 조번호 820과 같이 표시하고, 825 영역에서 3100번 버스의 잔여 좌석수를 표시할 수 있다. 또한 도 8c와 같이, 전자장치는 현재 분침에 “흰 점”을 표시하여 현재 분을 나타내고, 흰 점을 기준으로 버스 도착 예정 시간을 인지할 수 있도록 할 수 있다. 그리고 전자장치는 선택된 버스 아이콘의 인접 위치에 상세 도착 정보를 표시할 수 있다. 예를들면, “M5422” 버스 아이콘이 선택되면, 전자장치는 참조번호 830과 같이 M5422 버스 아이콘과 인접한 위치에 버스 번호 및 도착 예정 시간을 포함하는 상세 도착 정보를 표시할 수 있다. 또한 도 8d와 같이 전자장치는 버스 아이콘이 선택되면, 상세 도착 정보를 표시하기 위한 표시 인디케이터 840을 표시하고, 표시 인디케이터 840 내에 도착 선택된 버스의 상세 도착 정보를 표시할 수 있다. 이때 표시 인디케이터 840은 선택 된 버스 아이콘을 지시하는 UI 형태로 구성할 수 있다. 예를들면, “1005-1”버스 아이콘이 선택되면, 전자장치 는 표시 인디케이터 840이 선택된 1005-1 번 버스 아이콘을 지시하도록 표시하며, 표시 인디케이터 840의 영역 내에 해당 버스의 상세 도착 정보를 표시할 수 있다. 상기와 같은 동작은 버스 어플리케이션의 종료가 요구될 때까지 반복 수행될 수 있으며, 버스 어플리케이션의 종료가 요구되면 전자장치는 721단계에서 이를 인식하고 버스 어플리케이션의 실행을 종료할 수 있다. 도 9는 본 발명의 다양한 실시예에 따른 전자장치가 교통 어플리케이션을 실행하는 동작을 도시하는 흐름도이다. 이하의 설명에서 교통 수단은 버스로 설명될 것이며, 목적지는 도착 정류소로 설명될 것이다. 도 10a 및 도 10b는 본 발명의 다양한 실시예에 따라 전자장치가 교통 수단의 식별 정보를 등록하는 예를 설명하기 위한 도면이다. 도 9를 참조하면, 교통 어플리케이션이 실행되면, 전자장치는 911단계에서 디스플레이 250에 시계 화면을 표시 할 수 있다. 상기 시계 화면은 시침 및 분침을 이용하여 시간을 표시하는 아날로그 시계 화면이 될 수 있다. 그 리고 설정동작이 수행되지 않은 상태이면, 전자장치는 931단계에서 외부 서버로부터 전송되는 버스의 도착 정보 를 수신하며, 수신된 도착 정보를 분석하여 상기 도 5a와 같이 표시할 수 있다. 상기 931 단계의 동작은 상기 도 7과 같은 절차를 수행하면서, 현재의 시간과 버스 도착 예정 시간의 차이를 분석하고, 그 결과에 따라 분침및/또는 시침 회전 영역의 도착시간 위치에 대응되는 버스 아이콘 이미지들을 표시할 수 있다. 그리고 버스 아 이콘이 선택되면, 상기 도 8a - 도 8d와 같은 표시 방법들 중의 한가지 방법으로 선택된 버스의 상세 도착 정보 를 표시할 수 있다. 사용자는 버스 어플리케이션을 실행할 때, 버스 정류소 및 해당하는 버스 정류소에서 확인하고자 하는 버스들을 설정할 수 있다. 버스 어플리케이션에서 설정 모드가 선택되면, 전자장치는 913단계에서 이를 인식하고, 915단 계에서 목적지 설정하는 메뉴를 표시할 수 있다. 여기서 목적지는 버스 정류소로써 버스가 도착하는 정류소가 될 수 있다. 사용자가 목적지 버스 정류소를 선택하면, 전자장치는 915단계에서 이를 인식하고, 917단계에서 선 택된 버스 정류소를 등록할 수 있다. 이후 전자장치는 919 단계에서 등록된 버스 정류소에서 도착 시간을 확인 할 버스들의 목록을 표시할 수 있다. 그리고 사용자가 적어도 하나의 버스 번호를 선택하면, 전자장치는 919 단 계에서 이를 인식하고, 921 단계에서 선택된 버스 번호를 설정된 버스 정류소에 등록할 수 있다. 도 10a 및 도 10b를 참조하면, 버스 번호 리스트를 표시하는 경우 유사한 버스번호가 많을 수 있다. 예를들면, 도심 지역을 운행하는 버스들은 지역에 따라 버스 번호가 결정될 수 있다. 도 10b는 서울 지역 및 서울 외곽 지 역을 운행하는 버스들의 노선 번호를 부여하는 예를 도시하고 있다. 서울에서 운행되는 버스는 설정된 권역에 따라 도 10b에 도시된 바와 같은 버스 노선 번호가 할당될 수 있다. 하기 <표 2>는 서울 버스의 노선 할당 예가 될 수 있다. 표 2 구분 부여방법 파란(간선) 버스 3자리번호 출발지권역 + 도착지권역 + 1자리일련번호 (예: 141) 초록(지선) 버스 4자리번호 출발지권역 + 도착지권역 + 2자리일련번호 (예: 2412) 노랑(순환) 버스 2자리번호 권역번호 + 일련번호 (예: 41) 빨강(광역) 버스 4자리번호 9 + 경기도출발권역 + 2자리일련번호 (예: 9412) 상기 <표 2>에서, 파란(간선) 버스는 서울 외곽 지역에서 출발하여 도심에 도착하는 버스들이 될 수 있다. 초록 (지선) 버스는 도심 지역을 통과하지 않고 서울 외곽 지역을 통과하는 버스가 될 수 있고, 빨강(광역) 버스(또 는 M버스)는 지방(예를들면, 경기도 지역)을 출발하여 서울 도심 지역에 도착하는 버스가 될 수 있으며, 노랑 (순환) 버스(초록 색의 마을 버스)는 일부 지역을 순환하는 버스가 될 수 있다. 상기한 바와 같이, 버스 번호는 버스가 운행하는 노선에 따라 결정될 수 있으며, 버스 번호의 자리 수는 내선/ 순환/광역 버스 종류에 따라서 2자리, 3자리, 4자리로 표시되어 유사한 경로의 버스들이 유사한 번호를 가질 수 있다. 따라서 버스 정류소에 버스 번호를 설정할 때, 화면에 표시되는 리스트에서 숫자/택스트/패턴이 유사한 형태로 나타날 수 있다. 따라서 본 발명의 실시예에 따른 전자장치는 버스 번호를 설정할 때, 도 10a의 참조번 호 1010, 1020 및 1030과 같이 디스플레이 250에 표시되는 버스 목록의 화면에서 버스 번호의 색상, 필체, 사이 즈 등의 변화를 주거나 에니메이션 효과를 적용하여 구분을 명확하게 할 수 있다. 전자장치는 유사한 정도를 판 단할 때, 버스 번호의 형태/길이에 따라 적합한 로직을 적용할 수 있다. 예를들면, 버스 번호를 나타낼 경우 420 vs. 421, 3002 vs. 3007 과 같이 숫자 한 글자가 아주 중요한 구분자가 되므로 한 글자만 달라도 로직을 적용할 수 있따. 유사성 판단시 전체 리스트를 기준으로 하면 상당히 많은 유사 결과가 존재하여 차이점 을 강조하여도 구분에 도움이 되지 않을 수 있다. 그러나 화면에 보이는 리스트 내용만을 기준으로 하여 판단할 경우, 사용자가 인식한 범위 내에서 차이점만 강조되어 나타나기 때문에 효과적으로 차이점을 인식시킬 수 있다. 상기한 바와 같이, 전자장치는 버스 어플리케이션이 실행되면 시계 화면에서 버스 정류소에 도착하는 버스들을 표시할 수 있으며, 설정 모드에서 버스 정류소 및 버스번호들을 등록할 수 있다. 그리고 버스 어플리케이션의 종료 요구가 발생되면, 전자장치는 923단계에서 이를 인식하고, 버스 어플리케이션을 종료할 수 있다. 도착 정류소에 버스 도착 시간을 표시하는 방법은 다양한 형태로 수행할 수 있다. 본 발명의 다양한 실시예에 따른 전자장치는 버스 미니 어플리케이션을 통해 버스의 도착 정보를 표시할 수 있으며, 버스 어플리케이션을통해 버스의 도착 정보를 표시할 수 있다. 상기 버스 어플리케이션은 설치 과정을 통해서 직접 운용체제에 연동 해서 자원을 효과적으로 사용할 수 있다. 이에 반하여, 버스 미니 어플리케이션은 운영체제나 어플리케이션과 직접 연동하는 것이 아니라 전용 엔진이나 내장된 형태로 운영체제 또는 어플리케이션과 연동할 수 있다. 여기 서 미니 어플리케이션은 위젯이 될 수 있다. 도 11은 본 발명의 다양한 실시예에 따른 전자장치의 버스 위젯 및 버스 어플리케이션의 전환 동작을 도시하는 흐름도이다. 도 12는 버스 위젯과 버스 어플리케이션의 표시 예를 설명하기 위한 도면이다. 도 11을 참조하면, 전자장치는 1111 단계에서 시계 화면을 표시할 수 있다. 이때 미니 어플리케이션(위젯)이 실 행되면, 전자장치는 1113 단계에서 이를 인식하고, 1115 단계에서 버스 위젯 화면을 디스플레이 250에 표시할 수 있다. 상기 버스 위젯 화면은 도 12의 1210 화면과 같을 수 있다. 버스 위젯 화면은 설정된 버스 정류소에 가장 빨리 도착하는 버스 번호 및 도착 시간이 표시될 수 있다. 이때 표시되는 버스 번호는 해당하는 버스 정류 소에서 도착 시간을 확인하기 위한 설정된 버스 번호들이 될 수 있으며, 설정된 버스 번호들 중에서 가장 빨리 도착하는 버스의 번호 및 도착 시간이 표시될 수 있다. 또한 버스 위젯 화면을 표시하는 경우, 전자장치는 시계 화면은 표시하지 않을 수 있다. 또한 버스 어플리케이션이 설정되면, 전자장치는 1113 단계에서 이를 인식하고, 1119단계에서 버스 어플리케이 션 화면을 디스플레이 250에 표시할 수 있다. 도 12의 1220 화면은 버스 어플리케이션의 실행 화면이 될 수 있 다. 버스 어플리케이션은 시침 410 및 분침 450을 이용하여 현재의 시간을 표시하는 시계 화면을 표시할 수 있 으며, 서버에서 전송되는 버스 도착 정보들을 표시할 수 있다. 또한 화면 1230과 같이 베젤을 이용하여 특정 버 스의 상세 도착 정보를 확인할 수 있다. 화면 1230과 같이 사용자가 베젤 이용하여 표시되는 특정 버스 아이콘 을 선택하면, 전자장치는 화면 1220에서와 같이 표시 인디케이터 840을 표시하여 선택된 버스를 표시하고, 표시 인디케이터 840의 영역에 선택된 버스의 상세 도착 정보를 표시할 수 있다. 상기 상세 도착 정보는 버스 번호, 도착 시간 및/또는 잔여 좌석 수 등이 될 수 있다. 사용자가 버스 위젯 또는 버스 어플리케이션의 실행을 종료하면, 전자장치는 1117 단계에서 이를 인식하고, 버 스 도착 정보를 표시하는 어플리케이션의 동작을 종료할 수 있다. 도 13은 본 발명의 다양한 실시예에 따른 전장치의 버스 위젯 실행 동작을 도시하는 흐름도이다. 도 14a - 도 14c는 버스 위젯 실행 과정에서 표시되는 화면의 예들을 도시하는 도면이다. 도 13을 참조하면, 버스 위젯이 실행되면 전자장치는 1311 단계에서 버스 위젯 화면을 표시할 수 있다. 버스 위 젯 화면은 도 14a와 같은 구조를 가질 수 있다. 도 14a에서 버스 위젯은 정류소를 표시하는 영역 1411과, 설정 된 버스들 중에서 현재 시간을 기준으로 가장 빨리 도착하는 버스 번호를 표시하는 영역 1413과, 도착 예상 시 간을 표시하는 영역 1415 및 버스 도착 예상 시간을 갱신하는 버튼 1417을 포함할 수 있다. 이때 1411 영역은 버스 정류소 이름을 표시하며, 정류소 전환을 위한 버튼으로 사용될 수 있다. 예를들면, 사용자가 1411 영역을 선택하면, 전자장치는 다음으로 설정된 정류소의 버스 위젯 화면으로 전환할 수 있다. 또한 버튼 1417이 선택되 면, 전자장치는 서버에 해당하는 버스번호의 도착 예상 시간을 요청할 수 있으며, 영역 1415에 표시되는 정보를 서버에서 전송되는 도착 예상 시간으로 갱신할 수 있다. 상기 도 14a와 같은 버스 위젯 화면이 표시되는 상태에서 사용자가 버튼(refresh button) 1417을 선택(tap)하면, 전자장치는 1313 단계에서 이를 인식하고, 1315 단계에서 서버에 해당 버스의 도착 예상 시간의 전송을 요구할 수 있다. 그리고 도착 예상 시간이 수신되면, 전자장치는 1315 단계에서 영역 1415에 표시되는 도착 예상 시간을 갱신할 수 있다. 상기 도 14a와 같은 버스 위젯 화면이 표시되는 상태에서 사용자가 버스 정류소 이름이 표시되는 영역 1411을 선택(tap)하면, 전자장치는 1321 단계에서 이를 인식하고, 1323 단계에서 설정된 다음 버스 정류소의 위젯 화면 을 표시할 수 있다. 도 14b는 전자장치는 3개의 정류소(예를들면, 강남역, 역삼역, 올림픽 공원 입구)들을 설정 한 예를 도시하고 있다. 화면 1420이 표시되는 상태에서 사용자가 버스 정류소 영역을 참조번호 1425와 같이 탭 하면, 전자장치는 1321 단계에서 이를 인식하고, 1323 단계에서 화면 1430과 같이 다음 버스 정류소(예를들면, 역삼역)의 위젯 화면을 표시할 수 있다. 그리고 화면 1430이 표시되는 상태에서 사용자가 버스 정류소 영역을 참조번호 1435와 같이 탭하면, 전자장치는 1321 단계에서 이를 인식하고, 1323 단계에서 화면 1440과 같이 다음 버스 정류소(올림픽 공원 입구)의 위젯 화면을 표시할 수 있다. 화면 1440이 표시되는 상태에서 참조벊노 1445 와 같이 탭이 발생되면, 전자장치는 마지막 버스 정류소임을 인식하고, 처음 위젯 화면인 1420 화면을 표시할 수 있다. 버스 위젯 화면은 현재 버스 정류소에서 첫번째로 도착하는 버스의 정보를 표시할 수 있다. 현재의 버스 정류소 에서 다른 버스의 도착 상태를 확인하거나 또는 정류소/버스번호의 설정 동작을 수행하는 경우, 전자장치는 버 스 위젯 화면에서 버스 어플리케이션으로 전환할 수 있다. 사용자가 버스 위제 화면에서 버스 어플리케이션으로 의 전환을 요구하면, 전자장치는 1331 단계에서 이를 인식하고, 1333단계에서 버스 어플리케이션 화면으로 전환 할 수 있다. 도 14c를 참조하면, 사용자는 1450과 같이 버스 위젯 화면이 표시되는 상태에서 버스 위젯 화면의 임의 영역을 선택하면, 전자장치는 이를 버스 어플리케이션의로 전환을 요구하는 입력으로 인식할 수 있다. 따 라서 1450 화면과 같이 버스 위젯 화면이 표시되는 상태에서 사용자가 참조번호 1455와 같이 버스 위젯 화면을 선택(예를들면, tap)하면, 전자장치는 1331 단계에서 이를 인식하고, 1333단계에서 1460 화면과 같은 버스 어플 리케이션 화면으로 전환할 수 있다. 이때 전환되는 버스 어플리케이션 화면은 동일한 버스 정류소의 버스 어플 리케이션 화면이 될 수 있다. 버스 어플리케이션의 1460 화면은 시계화면이 표시되는 상태에서 해당하는 버스 정류소의 설정된 버스들의 도착 시간 위치에 버스 아이콘들이 표시될 수 있다. 이때 버스정류소 및/또는 버스 번호를 선택하기 위한 버튼이 참조번호 1465와 같이 선택되면, 전자장치는 이를 인식하고 참조번호 1470과 같이 세팅 화면을 표시할 수 있다. 상기 도 14a와 같은 구조를 가지는 버스 위젯 화면을 표시하는 상태에서 사용자가 버스 위젯 동작의 종료를 요 구하면, 전자장치는 1317단계에서 이를 인식하고, 버스 위젯 화면의 표시를 종료할 수 있다. 도 15는 본 발명의 다양한 실시예에 따른 전자장치의 버스 위젯 화면을 표시하는 다른 방법을 도시하는 흐름도 이다. 도 16a - 도 16c는 도 15와 같은 동작을 수행할 때의 버스 위젯 화면을 표시하는 예를 도시하고 있다. 도 15를 참조하면, 전자장치는 1511단계에서 버스 위젯을 실행할 수 있다. 이때 버스 위젯의 최초 실행 요구이 면, 전자장치는 1513단계에서 이를 인식하고, 1515 단계에서 버스 어플리케이션의 화면으로 전환을 유도할 수 있다. 예를들면, 전자장치는 최초 버스 위젯의 실행이 요구되면, 도 16a의 1610 화면을 디스플레이 250에 표시 할 수 있다. 전자장치는 버스 위젯을 실행하기 위한 버스 정류소가 설정되지 않았음을 인식하고, 디스플레이 250에 1610 화면과 같은 팝업 메시지(예를들면, “정류소를 추가해주세요”) 를 표시할 수 있다. 이때 1610 화 면에서 추가 버튼 영역을 참조번호 1615와 같이 선택(예를들면, tap)하면, 전자장치는 같이 버스 어플리케이션 화면으로 전환하여 정류소 ID를 설정할 수 있는 화면 1620을 표시할 수 있다. 그리고 전자장치는 버스 어플리케 이션의 설정 절차를 수행하면서 버스 정류소 및 버스 번호들을 설정할 수 있다. 또한 버스 위젯의 실행이 요구된 상태에서 해당 정류소에 도착 예정인 버스가 없으면, 전자장치는 1521 단계에 서 이를 인식하고, 1523 단계에서 해당 정류소에 도착 예정인 버스가 없음을 표시할 수 있다. 예를들면, 전자장 치는 버스 위젯 실행 요구되면, 현재 설정된 버스 정류소의 버스 도착 정보를 서버에 요청하며, 서버로부터 버 스의 도착 정보를 수신할 수 있다. 이때 해당 정류소에 도착할 버스가 없으면(예를들면, 도착 예정인 버스가 없 거나 또는 1 시간 내에 도착하는 버스가 없으면), 전자장치는 도 16b와 화면을 디스플레이 250에 표시할 수 있 다. 버스 위젯의 실행되는 상태에서, 업데이트 버튼 1417이 선택되면, 전자장치는 서버에 접속되어 버스 도착 정보 를 수신할 수 있다. 따라서 전자장치는 버스 위젯이 실행되는 동안 서버와의 통신 연결 상태를 검사할 수 있다. 이때 네트워크의 오류가 인식되면, 전자장치는 1531 단계에서 이를 인식하고, 1533단계에서 디스플레이 250에 네트워크 오류 상태를 표시할 수 있다. 전자장치는 네트워크 오류 상태가 감지되면, 네트워크 오류 팝업 메시지 를 표시하는 도 16c와 화면을 디스플레이 250에 표시할 수 있다. 버스 위젯을 실행할 때, 버스 정류소 및 버스번호가 설정되고, 도착 예정인 버스가 있으며, 네트워크 상태가 정 상이면, 전자장치는 1551 단계에서 버스 위젯 화면을 디스플레이 250에 표시할 수 있다. 상기 1551 단계의 동작 은 정상적인 버스 위젯이 실행되는 상태가 될 수 있으며, 전자장치는 1551 단계에서 상기 도 13과 같은 절차를 수행하면서 버스 위젯 동작을 수행할 수 있다. 사용자가 버스 위젯 동작의 종료를 요구하면, 전자장치는 1517단 계에서 이를 인식하고, 버스 위젯 화면의 표시를 종료할 수 있다. 도 17은 본 발명의 다양한 실시예에 따른 전자장치의 버스 어플리케이션 실행 방법을 도시하는 흐름도이다. 도 17을 참조하면, 전자장치는 1711단계에서 버스 어플리케이션의 화면을 표시할 수 있다. 상기 버스 어플리케 이션의 화면은 시 침 및 분 침에 의해 시간을 표시하는 시계 화면에 설정된 정류소의 버스들의 도착 시간을 표 시하는 화면이 될 수 있다. 예를들면, 상기 버스 어플리케이션 화면은 도 5a와 같은 화면이 될 수 있다. 상기 도 5a와 같은 버스 어플리케이션 화면이 표시되는 상태에서 버스 아이콘이 선택되면, 전자장치는 1713 단계에서 이를 인식하고, 1715 단계에서 선택된 버스의 상세 도착 정보를 화면에 표시할 수 있다. 이때 표시되는 버스의상세 도착 정보는 도 8a - 도 8d와 같은 형태가 될 수 있다. 본 발명의 다양한 실시예에서는 도 8d와 같은 형태 로 버스의 상세 도착 정보를 표시하는 것으로 가정한다. 상기 1711 단계에서 버스 어플리케이션 화면을 표시하는 상태에서, 사용자가 화면 전환을 요구하면, 전자장치는 1721 단계에서 이를 인식하고, 1723 단계에서 설정된 다음 정류소의 버스 어플리케이션 화면을 표시할 수 있다. 전자장치의 버스 정류소 및/또는 버스번호 설정 동작에서 복수의 버스 정류소들을 설정할 수 있다. 그리고 버스 정류소의 전환이 요구되면, 전자장치는 설정된 다음 정류소의 버스 어플리케이션 화면을 표시할 수 있다. 상기 1711 단계에서 버스 어플리케이션 화면을 표시하는 상태에서, 사용자가 정류소 및/또는 버스 번호의 설정 을 요구하면, 전자장치는 1731 단계에서 이를 인식하고, 1733 단계에서 버스 정류소 및/또는 버스 번호의 설정 동작을 수행할 수 있다. 여기서 버스 정류소 및 버스 정류소의 설정 동작은 등록, 편집, 추가 및 삭제 등의 동 작이 될 수 있다. 버스 어플리케이션을 실행하는 중에 사용자가 버스 어플리케이션 동작의 종료를 요구하면, 전자장치는 1717단계 에서 이를 인식하고, 버스 어플리케이션의 동작을 종료할 수 있다. 도 18은 본 발명의 다양한 실시예에 따른 전자장치의 버스 어플리케이션 화면을 표시하는 방법을 도시하는 흐름 도이다. 도 19는 버스 어플리케이션 화면의 표시 예를 도시하는 도면이다. 도 18은 도 17에서 1711 단계의 버스 어플리케이션 화면을 표시하는 흐름도가 될 수 있다. 도 18을 참조하면, 전자장치는 711 단계에서 시계 화면을 디스플레이 250에 표시할 수 있다. 시계화면은 시침 및 분침을 이용하여 시간을 표시하는 아날로그 시계의 화면이 될 수 있다. 전자장치는 1813 단계에서 표시되는 시계 화면에 버스 정류소의 이름을 표시할 수 있다. 상기 전자장치는 시계 화면을 표시하는 상태에서 설정된 시 간 주기로 서버 130에 표시되는 버스 정류소에 설정된 버스들의 도착 정보를 요청할 수 있으며, 상기 서버 130 으로부터 전송되는 버스들의 도착 시간 정보를 수신할 수 있다. 그리고 전자장치는 1815단계에서 수신되는 버스 도착 시간 정보를 분석하며, 1817 단계에서 도 5b 및 도 5c와 같이 시계 화면에 표시된 버스 아이콘의 위치를 결정하고, 도 5a와 같이 시계 화면의 분침 회전 영역 및/또는 시침 회전 영역의 도착 시간 위치에 버스 아이콘 을 표시할 수 있다. 이후 사용자가 시계화면에 표시되는 버스 아이콘을 선택하면, 전자장치는 1819단계에서 이를 인식하고, 1821단 계에서 선택된 버스의 상세 도착 정보를 표시할 수 있다. 도 19는 도 18의 1821 단계에서 표시되는 버스 어플리케이션 화면의 예가 될 수 있다. 전자장치는 시침 410 및 450을 통해 현재의 시간을 디스플레이 250에 표시할 수 있다. 또한 전자장치는 현재 선택된 버스 정류소 이름 1910, 버스 정류소 및 버스 설정 버튼 1920, 그리고 현재 정류소에 설정된 버스들의 도착 시간을 표시하는 버스 큐 1935 등을 표시할 수 있다. 그리고 사용자에 의해 특정 버스가 선택되면, 전자장치는 1950과 같이 표시 인디 케이터 840을 표시할 수 있으며, 표시 인디케이터 840은 선택된 버스 1930을 지시하고, 선택된 버스 1930은 선 택된 버스 큐 1935와 다른 형태로 표시할 수 있다. 그리고 전자장치는 표시 인디케이터 840의 내부 영역에 현재 선택된 버스의 상세 도착 정보 1915(예를들면, 버스 번호, 도착 예정시간, 버스 종류, 잔여 좌석 수 등)를 표시 할 수 있다. 또한 버스의 경우 지선, 간선, 광역 버스 등 종류에 따라서 색상이 정해져 있는데 840 영역이나 1930에 버스와 동일한 색상을 적용할 수 있다. 이때 특정 버스의 선택이 이루어지지 않은 경우, 전자장치는 도 19와 같은 버스 어플리케이션 화면에서 현재 선택된 버스 정류소의 이름 1910, 버스 정류소 및 버스 설정 버튼 1920 및 버스 큐 1935를 표시할 수 있다. 이때 버스 아이콘 1930도 버스 큐의 형태로 표시될 수 있다. 도 20은 본 발명의 다양한 실시예에 따른 전자장치의 버스 상세 도착 정보를 표시하는 절차를 도시하는 흐름도 이다. 도 21a - 도 21d는 버스 상세 도착 정보를 표시하는 예를 나타내는 도면이다. 도 20을 참조하면, 버스 어플리케이션 화면의 버스큐 1935에서 특정 버스가 선택되면, 전자장치는 2011 단계에 서 선택된 버스 아이콘을 확인할 수 있다. 이때 선택된 시간에 하나의 버스 아이콘이 위치될 수 있으며, 또는 두 개 이상의 아이콘이 위치될 수도 있다. 예를들면, 해당 시간에 도착하는 버스가 두 대 이상이면, 전자장치는 사용자의 선택에 따라 중첩된 버스 아이콘들을 순차적으로 선택하면서 각 버스들의 상세 도착 정보를 표시할 수 있다. 이때 선택된 버스 아이콘의 위치에 하나의 버스 아이콘이 존재하면, 전자장치는 2013 단계에서 이를 인식 하고, 2015 단계에서 선택된 버스의 상세 도착 정보를 표시할 수 있다. 그러나 선택된 위치에 복수의 버스 아이 콘들이 위치되어 있으면, 전자장치는 2017 단계에서 첫번째 버스 아이콘에 해당하는 버스의 상세 도착 정보를 표시할 수 있다. 그리고 첫번째 버스의 상세 도착 정보를 표시하는 상태에서 또 다른 선택이 발생되면, 전자장 치는 2019 단계에서 이를 인식하고, 2021 단계에서 다음 버스 아이콘의 상세 도착 정보를 표시할 수 있다.도 21a는 베젤을 회전시켜 버스 아이콘을 선택하는 예를 도시하는 도면이다. 상기 도 21a는 강남역 버스 정류소 에 M3007, M3200 및 340번 버스를 설정한 상태의 예가 될 수 있다. 사용자가 베젤을 회전시켜 첫번째 도착 예정 인 M3007 버스를 선택한 상태가 될 수 있으며, 전자장치는 2013 단계에서 해당 버스의 도착 예정시간이 다른 버 스와 중복되지 않았음을 인식하고, 2015 단계에서 선택된 버스 M3007의 상세 도착 정보를 1915와 같이 표시할 수 있다. 이때 사용자가 참조번호 2131과 같이 베젤을 회전시키면, 전자장치는 이를 인식하고, 2011 단계에서 상기 베젤의 회전에 의해 선택되는 버스 아이콘을 확인할 수 있다. 그리고 전자장치는 상기 베젤의 회전에 의해 선택되는 버스 아이콘(예를들면, 도 19의 버스 아이콘 1930)을 버스 큐(예를들면, 도 19의 1935)와 다른 형태로 표시하여 사용자에게 버스 아이콘이 선택되었음을 인식시킬 수 있다. 그리고 전자장치는 2013 단계에서 선택된 버스 아이콘의 위치에 다른 버스 아이콘이 중복되지 않았음을 인식하고, 선택된 버스 아이콘의 도착 상세 정보 를 표시 인디케이터 840의 영역에 표시할 수 있다. 상기 도 21a의 2110, 2115, 2120 및 2125 화면에 도시된 바와 같이 각 버스 아이콘들이 중복되지 않은 경우, 전 자장치는 각각 2131, 2133, 2135와 같이 회전됨에 따라 선택되는 각 버스들의 상세 도착 정보를 표시 인디케이 터 840에 표시할 수 있다. 또한 2125와 같은 화면이 표시되는 상태에서 참조번호 2141, 2143, 2145와 같이 베젤 을 역방향으로 회전시키면, 전자장치는 이를 인식하고 각각 2120, 2115, 2110 화면과 같이 역방향으로 선택되는 버스들의 상세 도착 정보를 표시할 수 있다. 상기 도 21a는 사용자가 시계 방향 또는 반시계 방향으로 베젤을 회전시키면서 순차적으로 도착 시간에 따른 버스큐의 버스들을 선택하는 예를 도시하고 있지만, 베젤의 회전 크 기에 따라 선택되는 버스 아이콘들은 비 순차적인 순서로 선택할 수도 있다. 베젤이 없는 장치의 경우 840영역 을 버튼으로 활용하여 순차적으로 다음 버스를 선택하도록 할 수 있다. 이 때 가장 마지막 버스가 선택된 상태 에서 840영역을 터치할 경우 첫 번째 버스가 선택 되도록 할 수 있다. 도 21a는 베젤의 회전에 의해 버스를 선택하는 동작을 도시하고 있다. 그러나 도 21b와 같이 표시되는 버스 큐 를 터치하여 버스를 선택할 수 있다. 사용자가 화면 2150, 2155 또는 2160과 같이 표시되는 버스 큐의 특정 버 스를 선택하면, 전자장치는 선택된 버스를 인식하고, 선택된 버스의 상세 도착 정보를 표시할 수 있다. 도 21c는 도착 예정 시간이 5분인 버스 아이콘 위치에 3대의 M3007, M3200및 340번 버스 들이 중복된 예를 도시 하고 있다. 그러면 전자장치는 2013 단계에서 선택된 버스의 도착시간이 다른 버스들의 도착 시간과 중복됨을 인식하고, 2017 단계에서 2171 화면과 같이 첫번째 버스(예를들면, M3007 버스)의 상세 도착 정보를 표시할 수 있다. 이때 서버 130은 버스들의 동작 정보를 초 단위로 전송할 수 있다. 그리고 전자장치는 도착되는 버스의 분 및 초를 분석하여 최초 도착 버스를 확인할 수 있다. 그리고 사용자가 참조번호 2181, 2182, 2183과 같이 베 젤을 회전시키면, 전자장치는 2019 단계에서 순차적으로 선택되는 버스들을 인식하고, 2012 단계에서 선택된 버 스의 상세 도착 정보를 화면 2173, 2175 및 2177과 같이 표시할 수 있다. 즉, 사용자가 베젤을 회전시키면서 순 차적으로 버스들을 선택하면, 전자장치는 베젤의 회전을 인식하고 각각 대응되는 버스의 상세 도착 정보(버스 번호, 도착 예정 시간)들을 순차적으로 표시할 수 있다. 그리고 사용자가 참조번호 2186, 2187, 2188과 같이 역 방향으로 베젤을 회전시키면, 전자장치는 역방향으로 화면 2175, 2173, 2171과 같이 도착되는 버스들의 상세 도 착 정보를 표시할 수 있다. 이때 사용자는 베젤의 회전 크기를 다르게 발생할 수 있으며, 전자장치는 베젤의 회 전 크기에 따라 선택되는 버스 아이콘들은 비 순차적인 순서로 선택할 수도 있다. 베젤이 없는 장치의 경우 840 영역을 버튼으로 활용하여 순차적으로 다음 버스를 선택하도록 할 수 있다. 이 때 가장 마지막 버스가 선택된 상태에서 840영역을 터치할 경우 첫 번째 버스가 선택 되도록 할 수 있다. 또한 선택된 버스 아이콘의 위치에 다른 버스 아이콘이 중복되는 경우, 전자장치는 도 21d와 같이 중복되는 위 치의 버스들을 2193 및 2197과 같은 버스 큐 형태로 표시할 수 있다. 서버로부터 수신하는 버스의 도착정보는 초 단위의 도착 예정 시간을 포함할 수 있다. 따라서 전자장치는 초 단위의 도착 시간 정보에 따라 버스 큐를 오더링(ordering)할 수 있다. 즉, 전자장치는 동일한 시간에 복수의 버스들의 도착 시간이 존재하는 경우, 2190 및 2195와 같이 화면의 상단에 버스 큐 인디케이터 2193 및 2195를 표시할 수 있다. 그리고 사용자가 버스 큐 인디케이터를 선택하면, 선택된 버스 큐에 해당하는 버스의 상세 도착 정보를 2190 또는 2195와 같이 표시할 수 있다. 도 22는 본 발명의 다양한 실시예에 따른 전자장치의 버스 어플리케이션 화면을 전환하는 절차를 도시하는 흐름 도이다. 도 23은 버스 어플리케이션 화면의 전환 표시예를 도시하는 도면이다. 상기 도 22는 도 17의 1723 단계 의 동작 절차가 될 수 있다. 도 22를 참조하면, 전자장치는 2211 단계에서 선택된 버스 정류소의 화면을 표시할 수 있다. 버스 정류소의 화 면을 표시하는 상태에서 정류소 전환이 선택되면, 전자장치는 2213단계에서 이를 인식하고, 2215 단계에서 현재표시 중인 화면이 마지막 정류소의 버스 어플리케이션 화면인가 검사한다. 전자장치는 마지막 정류소가 아니면, 2219단계에 다음 정류소의 버스 어플리케이션 화면을 표시하고, 마지막 정류소이면 처음 정류소의 버스 어플리 케이션 화면을 표시할 수 있다. 전자장치는 복수의 버스 어플리케이션 화면이 설정된 경우, 사용자의 선택에 따라 버스 어플리케이션 화면을 전 환하여 표시할 수 있다. 도 23은 3개의 버스 정류소(강남역, 양재역, 수원역)를 설정한 예를 도시하고 있다. 그 리고 자주 탑승하는 버스는 M3007, M3200이 설정된 예를 도시하고 있다. 또한 버스 어플리케이션 화면은 화면의 1910 영역에 버스 정류소 이름을 표시할 수 있으며, 표시 인디케이터 840에는 선택된 버스의 상세 도착 정보가 표시될 수 있다. 도 23의 화면 2310과 같이 버스 어플리케이션 화면이 표시되는 상태에서 참조번호 2313과 같이 영역 1910이 선택(예를들면, tap)되면, 전자장치는 2213 단계에서 버스 정류소의 전환 요구로 인식할 수 있다. 그러면 전자장치는 다음 버스 정류소가 설정된 마지막 정류소인가 검사하며, 마지막 정류소가 아니면 2219 단계 에서 화면 2320과 같이 다음 정류소(예를들면, 양재역)의 버스 어플리케이션 화면을 표시할 수 있다. 상기 2320 화면이 표시되는 상태에서 참조번호 2323과 같이 영역 1910이 선택(예를들면, tap)되면, 전자장치는 2219 단계 에서 화면 2330과 같이 다음 정류소(예를들면, 수원역)의 버스 어플리케이션 화면을 표시할 수 있다. 또한 상기 2330 화면이 표시되는 상태에서 참조번호 2333과 같이 영역 1910이 선택(예를들면, tap)되면, 전자장치는 2215 단계에서 2330 화면이 설정된 마지막 정류소의 버스 어플리케이션 화면임을 인식하고, 2217 단계에서 처음 설정 정류소(예를들면, 강남역)의 버스 어플리케이션 화면 2310을 표시할 수 있다. 상기 도 22 및 도 23에 도시된 바와 같이, 버스 정류소의 이름이 선택되면 전자장치는 다음 버스 정류소의 어플 리케이션 화면으로 전환할 수 있다. 그리고 전자장치는 전환되는 버스 정류소를 기준으로 사용자가 설정한 버스 번호 및 도착 예상 시간을 포함하는 상세 도착 정보를 표시할 수 있다. 도 24는 본 발명의 다양한 실시예에 따른 전자장치의 버스 어플리케이션에서 정류소 및 버스 번호를 설정하는 절차를 도시하는 흐름도이다. 도 25는 버스 어플리케이션에서 정류소 및 버스 번호의 설정 화면 표시예를 도시 하는 도면이다. 도 26은 버스 어플리케이션에서 설정 화면 및 추가 옵션 화면의 전환 예를 도시하는 도면이다. 도 27a - 도 27d는 버스 어플리케이션에서 정류소 식별자를 검색하는 예를 도시하는 도면이다. 도 28a - 도 28c 는 버스 어플리케이션에서 정류소 및/또는 버스 번호를 설정하는 예를 도시하는 도시하는 도면이다. 도 29a - 도 29b는 버스 어플리케이션에서 추가 옵션 동작을 수행하는 예를 도시하는 도면이다. 도 30a - 도 30b는 버스 어플리케이션에서 버스 위젯의 동작 예를 설명하기 위한 도면이다. 상기 도 24는 도 17의 1733 단계의 동작 절 차가 될 수 있다. 도 24를 참조하면, 도 19와 같은 버스 어플리케이션 화면에서 업데이트 버튼 1920을 선택(예를들면, tap)하면, 전자장치는 도 25와 같은 설정 화면을 표시할 수 있다. 디스플레이 250에 표시되는 설정화면은 정류소 목록 (setting title)을 표시하는 영역 2510, 설정된 버스 정류소들을 표시하는 영역 2520, 버스 정류소 추가 버튼 2530, 추가 옵션(more option) 버튼 2540들을 표시할 수 있다. 도 26에 도시된 바와 같이 버스 어플리케이션 화 면이 표시되는 상태에서, 사용자가 2615와 같이 업데이트 버튼 1920을 선택(예를들면, tap)하면, 전자장치는 도 26의 2620 화면을 표시할 수 있다. 이때 사용자가 추가 버튼 2540을 선택하면 도 27a와 같은 화면들을 표시하면 서 정류소 ID를 검색 및 입력 하는 동작을 수행할 수 있으며, 추가 옵션 버튼 2540을 누르면 도 26의2630 화면 을 표시하여 버스 번호의 삭제 버튼 2640 및 정보 제공처 버튼 2645를 표시할 수 있다. 이때 도 25와 같이 표시되는 설정 화면에서 정류소 추가 버튼 2530을 선택하면, 전자장치는 2409 단계에서 버스 정류소 추가를 설정하기 위한 화면을 표시할 수 있다. 이때 버스 정류소 ID를 알수 없는 경우, 사용자는 검색 모드를 수행하여 버스 정류소 ID를 검색할 수 있다. 따라서 설정화면에서 정류소 검색이 선택되면, 전자장치는 2411 단계에서 정류소 ID를 검색할 수 있다. 설정화면 에서 정류소 ID가 입력되면, 전자장치는 2415 단계에서 이를 인식하고, 2417 단계에서 입력된 정류소 ID를 추가하고, 추가된 정류소 ID에 대응되는 버스 번호들을 표시 할 수 있다. 전자장치는 정류소 ID가 추가되면, 추가된 정류소 ID를 등록하고, 해당하는 정류소 ID에서 도착 정 보를 표시할 수 있는 버스번호 리스트를 표시할 수 있다. 이때 사용자가 표시되는 리스트에서 버스 번호를 선택 하면, 전자장치는 2419 단계에서 이를 인식하고, 2421 단계에서 선택된 버스 번호들을 등록된 버스 정류소 ID에 링크시켜 저장할 수 있다. 그러나 표시되는 버스 번호 리스트에서 버스 번호를 선택하지 않으면, 전자장치는 2419 단계에서 이를 인식하고, 2423 단계에서 표시되는 버스 번호들을 등록된 버스 정류소 ID에 링크시켜 저장 할 수 있다. 또한 전자장치는 설정 화면에서 버스 정류소에 링크된 버스 번호들을 편집할 수 있다. 상기 버스 번호 편집은 추가 또는 삭제 등이 될 수 있다. 상기 버스 번호의 편집 요구가 발생되면, 전자장치는 2431 단계에서 이를 인식하고, 2433 단계에서 선택된 버스 번호를 편집할 수 있다. 또한 전자장치는 등록된 버스 정류소를 삭제할 수 있다. 버스 정류소의 삭제는 추가 옵션에서 삭제 버튼의 선택에 의해 수행될 수 있다. 버스 정류소의 삭제가 요 구되면, 전자장치는 2441 단계에서 이를 인식하고, 2443 단계에서 등록된 버스 정류소 목록을 표시하며, 사용자 에 의해 선택된 버스 정류소를 삭제할 수 있다. 또한 추가 옵션 화면에서 정보제공처 버튼 2645가 선택되면, 전 자장치는 2451 단계에서 추가 정보의 선택을 인식하고, 2453 단계에서 추가 정보를 표시할 수 있다. 여기서 상 기 추가 정보는 정보 제공처의 URL 정보가 될 수 있다. 또한 설정 화면에서 위젯 기능을 설정할 수 있다. 위젯 기능이 선택되면, 전자장치는 2461 단계에서 이를 인식하고, 2463 단계에서 설정된 버스 정류소 및 버스 번호들 을 버스 위젯의 정보로 설정할 수 있다. 상기 버스 어플리케이션의 설정 동작을 실행하는 중에 사용자가 버스 어플리케이션 동작의 종료를 요구하면, 전 자장치는 2425단계에서 이를 인식하고, 버스 어플리케이션의 설정 동작을 종료할 수 있다. 상기 도 24에서 버스 정류소를 검색하는 2413 단계의 동작을 구체적으로 살펴본다. 도 27a를 참조하면, 전자장 치는 설정 버튼 1920이 선택되면, 설정되어 있는 정류소 리스트들을 표시하는 2710 화면을 표시할 수 있다. 이 때 버스 정류소 추가 버튼 2530을 참조번호 2713과 같이 선택하면, 전자장치는 버스 정류소를 검색하기 위하여 2715 화면을 표시할 수 있다. 이때 정류소 ID를 모르면, 사용자는 주변 정류소 검색 또는 웹사이트로 검색 항목 을 선택할 수 있다. 이때 검색 항목을 선택하면, 전자장치는 2411 단계에서 이를 인식하고 2413 단계에서 정류 소 검색 동작을 수행할 수 있다. 먼저 주변 정류소 검색 모드를 선택(예를들면, tap)하면, 전자장치는 전자장치 의 현재 위치를 검색(예를들면, GPS를 통한 검색)하여 2720 화면과 같이 주변 정류소의 목록들을 표시할 수 있 다. 그리고 2720 화면과 같이 표시되는 주변 정류소의 목록에서 참조번호 2723과 같이 선택되면, 전자장치는 2415 단계에서 정류소 입력을 감지하고, 2725 화면과 같이 선택된 해당 정류소에 정차하는 버스들의 목록을 표 시할 수 있다. 이때 사용자가 버스 번호를 선택하고 확인 버튼 2727을 선택하면, 전자장치는 2419 단계에서 이 를 인식하고 2421 단계에서 선택된 버스 정류소 및 선택된 버스 번호들을 등록할 수 있다. 그러나 사용자가 버 스 번호를 선택하지 않고 확인버튼 2727을 선택하면, 전자장치는 2419 단계에서 이를 인식하고, 2423 단계에서 해당 버스 정류소에 정차하는 모든 버스 번호들을 등록할 수 있다. 이후 전자장치는 2730 화면과 같이 버스 정 류소가 추가되었음을 디스플레이 250에 표시하고, 27235 화면과 같이 버스 정류소 목록을 표시할 수 있다. 또한 버스 정류소 ID는 웹 검색에 의해 수행할 수 있다. 웹 검색은 전자장치에서 수행할 수 있으며, 또는 다른 전자장치(예를들면, 도 1의 제2 전자장치 120)에 수행될 수 있다. 여기서 다른 전자장치는 디스플레이가 상대적 으로 큰 전자장치(예를들면, 스마트 폰, 태블릿)가 될 수 있다. 여기서 다른 전자장치는 휴대 단말장치이며, 휴 대 단말장치는 전자장치(도 1의 웨어러블 전자장치 110)과 근거리 무선 통신을 통해 접속할 수 있는 장치라고 가정한다. 이때 웹 사이트로 검색이 선택되면, 전자장치의 디스플레이 250에는 2745 화면과 같이 휴대 단말장치 로 검색한 후 전자장치에 입력하라는 메시지를 표시할 수 있다. 그리고 휴대 단말장치를 통해 웹 검색을 하면, 참조번호 2751 및 2753과 같은 정류소 ID를 검색할 수 있다. 즉, 휴대 단말장치를 통해 버스 정류소 이름(예를 들면, 강남역)을 입력하면, 웹 사이트로부터 강남역 ID(2753 화면에서 22997)를 다운로드할 수 있다. 상기 웹 검색을 수행한 후, 사용자가 2743과 같이 2745 화면을 선택하면, 전자장치는 2755 화면과 같이 정류소 ID를 입 력하기 위한 키패드를 표시할 수 있다. 이때 사용자가 키패들을 통해 웹 검색된 버스 정류소 ID를 입력한 후, 2757과 같이 완료 버튼을 선택하면 전자장치는 2415 단계에서 정류소 ID 입력을 인식할 수 있다. 이후 전자장치 는 도 27a의 2725 화면에 도시된 바와 같이 입력된 버스 정류소에 정차되는 버스 번호 목록을 표시할 수 있으며, 사용자의 선택에 따른 버스 번호들을 버스 정류소 목록에 링크시킬 수 있다. 상기한 바와 같이, 전자장치는 도 27c의 2760과 같은 설정 화면을 표시할 수 있으며, 사용자가 버스 정류소 추 가 버튼 2530을 참조번호 2763과 같이 선택하면, 2765와 같이 정류소 ID 입력 화면을 표시할 수 있다. 이때 정 류소 ID를 모르는 경우, 사용자는 주변정류소 검색 또는 웹사이트로 검색을 선택하여 버스 정류소 ID를 검색할 수 있다. 그리고 정류소 ID 입력을 선택하면, 전자장치는 2770 화면과 같이 버스 정류소 ID를 입력할 수 있는 키패드를 표시할 수 있다. 그리고 버스 정류소 ID를 입력한 후 참조번호 2773과 같이 완료 버튼을 선택하면, 전 자장치는 2775와 같은 화면을 표시할 수 있다. 상기 2775 화면은 버스 정류소를 추가한 후, 추가된 버스 정류소 에 버스 번호를 선택할 것인지를 아닌지를 문의하는 팝업 메시지를 표시하는 화면이 될 수 있다. 이때 사용자가 참조번호 2776과 같이 버스 번호를 선택하지 않는 버튼을 선택하면, 전자장치는 2790과 같이 추가된 정류소를 등록하는 화면을 표시할 수 있다. 이런 경우, 추가된 정류소에 등록되는 버스번호들은 해당 정류소에 정차하는 모든 버스들이 될 수 있다. 그리고 2775 화면에서 버스 번호를 선택하기 위한 버튼이 참조번호 2778과 같이 선 택되면, 전자장치는 2780 화면과 같이 해당 정류소에 정차하는 버스들의 목록을 표시하고, 사용자가 선택하는 버스 번호들을 선택할 수 있다. 이후 사용자가 2780 화면에서 확인 버튼을 2783과 같이 선택하면, 전자장치는이를 인식하고 2785 화면과 같이 버스의 설정을 확인하였음을 나타내는 팝업 메시지를 표시할 수 있으며, 2790 화면과 같이 버스 정류소 목록에 추가된 정류소 및 선택된 버스 번호들을 등록할 수 있다. 또한 도 27d에 도시된 바와 같이, 2770 화면에서 입력된 버스 정류소 ID 입력의 오류가 발생되면(예를들면, 입 력된 버스 정류소의 ID와 일치하는 버스 정류소 ID가 없으면), 전자장치는 2795 화면과 같이 버스 정류소 ID의 오류 상태를 팝업 메시지로 표시할 수 있다. 도 28a 및 도 28b는 도 24의 2419 단계 -2423 단계의 동작 예를 설명하기 위한 도면이다. 전자장치는 도 28a의 2810 화면과 같이 버스 어플리케이션 화면은 해당 버스 정류소에서 정차하는 모든 버스들을 도착 예정 순서에 따라 버스큐 형태로 표시할 수 있다. 2810화면은 버스 정류소 영역 1910에 버스 정류소 이름을 표시하고, 선택 된 버스 1930의 상세 도착 정보 1915를 표시하며, 선택되지 않은 버스 1935들은 버스 큐 형태로 표시하는 예가 될 수 있다. 2810 화면에서 설정 버튼 1920을 선택하면, 전자장치는 2815 화면과 같이 버스 정류소 목록을 설정 할 수 있으며, 버스 정류소 추가 버튼 2530을 선택하면 새로운 버스 정류소를 추가할 수 있다. 또한 2815 화면 의 정류소 목록에서 참조번호 2818과 같이 버스 정류소 이름을 선택하면, 전자장치는 2820 화면에서와 같이 선 택된 버스 정류소의 버스 목록들을 표시할 수 있다. 이때 사용자가 버스 목록에서 버스를 선택하지 않고 확인버 튼 2727을 선택하면, 전자장치는 해당 버스 정류소에 정차하는 모든 버스들을 선택할 수 있다. 상기한 바와 같 이 전자장치는 버스 정류소를 설정한 후, 버스 번호를 선택하지 않고 확인 버튼 2727을 선택하면, 해당 버스 정 류소에 정차하는 모든 버스들을 등록할 수 있다. 도 28b의 2830 화면과 같이 버스 어플리케이션 화면은 해당 버스 정류소에서 정차하는 버스들 중에서 선택된 버 스들만을 표시할 수 있다. 2830화면에서 설정 버튼 1920을 선택하면, 전자장치는 2815 화면과 같이 버스 정류소 목록을 설정할 수 있으며, 버스 정류소 추가 버튼 2530을 선택하면 새로운 버스 정류소를 추가할 수 있다. 또한 2835 화면의 정류소 목록에서 참조번호 2838과 같이 버스 정류소 이름을 선택하면, 전자장치는 2840 화면에서와 같이 선택된 버스 정류소의 버스 목록들을 표시할 수 있다. 이때 사용자가 버스 목록에서 버스를 선택하고 확인 버튼 2727을 선택하면, 전자장치는 해당 버스 정류소에 정차하는 버스들 중에서 사용자에 의해 선택된 버스들만 을 해당 버스 정류소에 등록할 수 있다. 상기한 바와 같이 전자장치는 버스 정류소를 설정한 후, 버스 번호를 선택하고 확인 버튼 2727을 선택하면, 전자장치는 해당 버스 정류소에 선택된 버스번호들을 등록할 수 있다. 도 28c는 도 24의 2431 단계 및 2433 단계의 동작 예를 설명하기 위한 도면이다. 전자장치는 버스 정류소에 도 28a 또는 도 28b와 같이 버스 번호들을 등록한 후, 버스 번호들을 편집할 수 있다. 2850 화면과 같이 정류소 목 록을 표시하는 화면에서 사용자가 버스 번호를 편집하기 위한 정류소 이름을 참조번호 2853과 같이 선택하면, 전자장치는 2855 화면과 같이 해당 버스 정류소에 등록된 버스 번호들을 표시할 수 있다. 이때 사용자가 표시되 는 버스 목록에서 원하는 버스 번호들을 선택(예를들면, 버스 번호를 편집하는 동작)할 수 있다. 이때 전자장치 는 사용자가 이미 등록한 버스 번호를 선택하면 토글되어 해당 버스 번호의 등록을 해제할 수 있으며, 선택되지 않은 버스 번호를 선택하면 토글되어 해당 버스 번호를 선택할 수 있다. 이후 사용자가 확인 버튼 2727을 선택 하면, 전자장치는 버스 번호 목록에서 선택된 버스 번호들을 해당하는 버스 정류소에 등록할 수 있다. 도 29a는 도 24의 2441 단계 및 2443 단계의 동작 예를 설명하기 위한 도면이다. 전자장치는 화면 2910과 같이 버스 정류소의 설정 화면을 표시할 수 있다. 상기 버스 정류소 설정 화면에서 추가 옵션 버튼 2540을 선택하면, 2915 화면과 같이 삭제 버튼 2640 및 정보 제공처 버튼 2645를 표시할 수 있다. 이때 사용자가 삭제 버튼 2640 을 선택하면, 전자장치는 2920 화면과 같이 버스 정류소 목록을 표시할 수 있다. 이때 사용자가 참조번호 2921 과 같이 삭제하고자 하는 버스 정류소를 선택하고, 삭제버튼 2923을 선택하면, 전자장치는 2441 단계에서 이를 인식하고, 2443 단계에서 해당 버스 정류소를 삭제하고 2925 화면을 표시하면서 해당 버스 정류소의 삭제를 표 시할 수 있다. 또한 2910 화면에서 사용자가 삭제하고자 하는 버스 정류소 이름을 참조번호 2913과 같이 롱터치(tap and hol d)하면, 전자장치는 버스 정류소의 삭제 요구임을 인식하고, 2920 화면을 표시할 수 있다. 그리고 사용자가 참 조번호 2921과 같이 삭제하고자 하는 버스 정류소를 선택하고, 삭제버튼 2923을 선택하면, 전자장치는 2441 단 계에서 이를 인식하고, 2443 단계에서 해당 버스 정류소를 삭제하고 2925 화면을 표시하면서 해당 버스 정류소 의 삭제를 표시할 수 있다. 도 29b는 도 24의 2451 단계 및 2453 단계의 동작 예를 설명하기 위한 도면이다. 전자장치는 화면 2930과 같이 버스 정류소의 설정 화면을 표시할 수 있다. 상기 버스 정류소 설정 화면에서 추가 옵션 버튼 2540을 선택하면, 2935 화면과 같이 삭제 버튼 2640 및 정보 제공처 버튼 2645를 표시할 수 있다. 이때 사용자가 정보 제공처 버 튼 2645를 선택하면, 전자장치는 2940 화면과 같이 버스 어플리케이션의 정보를 제공하는 제공처의 정보를 표시할 수 있다. 여기서 정보 제공처의 정보는 url 정보로 표시할 수 있다. 그리고 화면 2940과 같이 정보 제공처가 표시되는 상태에서 사용자가 확인 버튼 2943를 선택하면, 전자장치는 버스 정류소 목록을 표시하는 화면으로 되 돌아갈 수 있다. 도 30a는 도 24의 2461 단계 및 2463 단계의 동작 예를 설명하기 위한 도면이다. 전자장치는 상기와 같이 버스 정류소들이 설정되면 이를 버스 위젯의 정류소 설정할 수 있다. 전자장치는 버스 위젯 설정이 요구되면, 전자장 치는 버스 정류소 별로 설정하여 버스 위젯 영역에서 설정할 수 있다. 버스 위젯이 설정되면, 전자장치는 버스 위젯 화면에서 설정된 버스 정류소의 순서에 따라 3010 화면, 3015 화면, 3020 화면과 같이 버스 위젯 화면으로 설정할 수 있다. 또한 도 30b의 3030 화면과 같은 버스 위젯 화면이 표시되는 상태에서 사용자가 참조번호 3033 과 같이 위젯 화면을 터치하면, 전자장치는 3035 화면과 같이 버스 해당하는 버스 정류소의 버스 어플리케이션 화면으로 전환할 수 있다. 도 31은 본 발명의 실시예에 따른 전자장치의 버스 어플리케이션 실행 동작을 도시하는 흐름도이다. 도 32a - 도 32c는 버스 어플리케이션을 실행하는 상태에서 팝업 메시지를 표시하는 예를 도시하는 도면이다. 도 33a - 33d는 버스 어플리케이션의 실행 화면에서 버스 도착 정보를 표시하는 예를 도시하는 도면이다. 도 34a - 도 34d는 버스 어플리케이션의 화면에서 버스 정류소 및 버스 번호들을 설정하는 예를 도시하는 도면이다. 도 31을 참조하면, 사용자가 버스 어플리케이션 실행을 요청하면, 전자장치는 3111 단계에서 버스 어플리케이션 을 실행할 수 있다. 버스 어플리케이션이 최초 실행되는 경우에는 버스 정류소가 설정되지 않을 수 있다. 따라 서 최초 실행이면, 전자장치는 3113 단계에서 이를 인식하고 3115 단계에서 디스플레이 250에 최초 실행임을 표 시하는 팝업 메시지를 표시하고, 사용자가 버스 정류소 추가를 선택하면 버스 어플리케이션의 설정 동작으로 전 환할 수 있다. 도 32a를 참조하면, 버스 어플리케이션이 최초 실행되면 버스 정류소가 설정되어 있지 않은 상태 가 될 수 있따. 버스 정류소가 설정되어 있지 않은 경우, 전자장치는 도 32a의 3210 화면과 같이 정류소 추가를 표시하는 팝업 메시지를 표시할 수 있다. 그리고 사용자가 참조번호 3213과 같이 추가 버튼을 선택하면, 전자장 치는 디스플레이 250에 3215 화면과 같은 버스 정류소의 설정 화면을 표시할 수 있다. 상기 버스 정류소의 추가 화면을 표시한 후, 전자장치는 버스 정류소 및 버스 번호 설정 동작으로 전환될 수 있다. 또한 버스 어플리케이션의 실행이 요구된 상태에서 해당 정류소에 도착 예정인 버스가 없으면, 전자장치는 3121 단계에서 이를 인식하고, 3123 단계에서 해당 정류소에 도착 예정인 버스가 없음을 표시할 수 있다. 예를들면, 전자장치는 버스 어플리케이션의 실행이 요구되면, 현재 설정된 버스 정류소의 버스 도착 정보를 서버에 요청하 며, 서버로부터 버스의 도착 정보를 수신할 수 있다. 이때 해당 정류소에 도착할 버스가 없으면(예를들면, 도착 예정인 버스가 없거나 또는 1 시간 내에 도착하는 버스가 없으면), 전자장치는 도 32b에 도시된 바와 같은 팝업 메시지를 디스플레이 250에 표시할 수 있다. 버스 어플리케이션이 실행되는 상태에서, 전자장치는 서버에 접속되어 버스 정류소 및 선택된 버스 번호를 전송 하고, 서버로부터 선택된 버스의 도착 예정 정보를 수신하는 동작을 주기적으로 수행할 수 있다. 이때 네트워크 의 오류가 인식되면, 전자장치는 3131 단계에서 이를 인식하고, 3133단계에서 디스플레이 250에 네트워크 오류 상태를 표시할 수 있다. 전자장치는 네트워크 오류 상태가 감지되면, 네트워크 오류 팝업 메시지를 표시하는 도 32c와 화면을 디스플레이 250에 표시할 수 있다. 버스 어플리케이션을 행할 때, 버스 정류소 및 버스번호가 설정되고, 도착 예정인 버스가 있으며, 네트워크 상 태가 정상이면, 전자장치는 3141 단계에서 디스플레이 250에 버스 어플리케이션 화면을 표시할 수 있다. 상기 버스 어플리케이션 화면은 시침 및 분침에 의해 현재 시간을 표시하는 시계 화면에 설정된 버스 정류소의 버스 아이콘들이 도착 시간에 따라 버스 큐 형태로 표시되는 화면이 될 수 있다. 버스 어플리케이션 화면이 표시되는 상태에서 사용자가 버스 아이콘을 선택하면, 전자장치는 3143 단계에서 이를 인식하고, 3145 단계에서 선택된 버스의 상세 도착 정보를 버스 어플리케이션 화면에 표시할 수 있다. 도 33a - 도 33d는 상세 도착 정보를 표시하는 버스 어플리케이션의 화면의 표시 예를 도시하는 도면이다. 도 33a 및 도 33b는 동일 시간대에 버스가 도착되는 버스가 중복되지 않는 예가 될 수 있으며, 도 33c 및 도 33d는 동일 시간 대에 도착하는 버스가 중복되는 예가 될 수 있다. 도 33a를 참조하면, 사용자는 베젤을 회전시켜 어플리케이션에 표시되는 버스를 선택할 수 있다. 3310화면은 버 스 어플리케이션 화면에서 베젤을 이용하여 첫번째로 도착할 예정인 버스(예를들면, 5분 후에 도착 예정인 3007 버스)를 선택한 예가 될 수 있다. 이후 사용자가 참조번호 3331과 같이 베젤을 회전하면 버스 어플리케이션 화 면의 두번째 버스를 선택할 수 있으며, 두번째로 도착 예정인 버스의 선택을 인식하면 전자장치는 3315 화면과같이 두번째 버스의 상세 도착 정보(예를들면, 15분 후에 도착 예정인 3007 버스)를 버스 어플리케이션 화면에 표시할 수 있다. 그리고 참조번호 3333과 같이 베젤을 회전시키면, 전자장치는 세번째 버스의 선택을 인식하고 3320 화면과 같이 세번째로 도착할 예정인 버스의 상세 도착 정보(예를들면, 20분 후에 도착 예정인 3200번 버 스)를 버스 어플리케이션 화면에 표시할 수 있다. 또한 3320 화면이 표시되는 상태에서 참조번호 3335 및 3337 과 같이 베젤을 역회전시키면, 전자장치는 이를 인식하고 각각 3315 화면 및 3310 화면을 표시할 수 있다. 도 33b를 참조하면, 사용자는 표시되는 버스 어플리케이션의 버스큐에서 버스를 선택(예를들면, tap)하여 상세 도착 정보를 표시하기 위한 선택할 수 있다. 전자장치는 3340화면에서와 같이 참조번호 3351과 같이 선택된 버 스의 상세 도착 정보를 표시하는 상태에서 참조번호 3353과 같이 다른 버스를 선택하면, 전자장치는 이를 인식 하고, 3345 화면과 같이 표시할 수 있다. 전자장치는 3345 화면의 참조번호 3346과 같이 선택된 버스의 상세 도 착 정보를 표시할 수 있다. 이때 사용자가 참조번호 3348과 같이 다른 버스를 선택하면, 전자장치는 3350 화면 의 참조번호 3351과 같이 선택된 버스의 상세 도착 정보를 표시할 수 있다. 상기 도 33b에 도시된 바와 같이 버 스 어플리케이션 화면을 표시하는 상태에서 표시되는 버스큐의 임의 버스가 선택되면, 전자장치는 사용자에 의 해 선택된 버스의 상세 도착 정보를 표시할 수 있다. 도 33c를 참조하면, 3360 화면은 분 후에 도착되는 버스가 3007번 버스 및 3200번 버스가 중복된 예가 될 수 있 다. 이때 상세 도착 정보를 선택하면, 3360 화면과 같이 중복되는 버스 번호에 먼저 도착하는 버스(예를들면, 초 단위로 먼저 도착 예정인 버스, 3007번 버스)의 상세 도착 정보를 표시할 수 있다. 3360 화면이 표시되는 상 태에서 참조번호 3373과 같이 베젤이 회전되면, 전자장치는 이를 인식하고 3365 화면과 같이 중복 시간대의 다 른 버스(예를들면, 3200번 버스)의 상세 도착 정보를 표시할 수 있다. 그리고 3365 화면이 표시되는 상태에서 3375와 같이 베젤의 회전을 인식하면, 전자장치는 3370 화면과 같이 다른 시간에 도착하는 버스(예를들면, 15분 후에 도착하는 3007번 버스)의 상세 도착 정보를 표시할 수 있다. 그리고 3370 화면이 표시되는 상태에서, 사용 자가 참조번호 3377 및 참조번호 3379와 같이 베젤을 역회전시키면, 전자장치는 3365 화면 및 3360 화면과 같이 동일 시간대에 중복된 버스(예를들면, 3200번 버스 및 3007 버스)의 상세 도착 정보를 순차적으로 표시할 수 있 다. 도 33d를 참조하면, 사용자는 표시되는 버스 어플리케이션의 버스큐에서 버스를 선택(예를들면, tap)하여 상세 도착 정보를 표시하기 위한 선택할 수 있다. 이때 3380 화면 및 3385 화면에 도시된 바와 같이 5분 후에 도착하 는 버스들이 중복된 시간 대에서 표시될 수 있다. 전자장치는 3380화면에서와 같이 중복된 시간대의 첫번째 버 스(예를들면, 3007 버스)의 상세 도착 정보를 표시하는 상태에서 참조번호 3393과 같이 중복된 시간 대의 버스 를 선택하면, 전자장치는 이를 인식하고, 3385 화면과 같이 표시할 수 있다. 그러면 전자장치는 3385 화면에서 중복된 시간 대의 다른 버스(예를들면, 3200번 버스)의 상세 도착 정보를 표시할 수 있다. 이때 사용자가 참조 번호 3395와 같이 다른 버스를 선택하면, 전자장치는 3390 화면에서 선택된 버스의 상세 도착 정보를 표시할 수 있다. 상기 도 33d에 도시된 바와 같이 버스 어플리케이션 화면을 표시하는 상태에서 표시되는 버스큐의 임의 버스가 선택되면, 전자장치는 사용자에 의해 선택된 버스의 상세 도착 정보를 표시할 수 있다. 또한 버스 어플리케이션 화면이 표시되는 상태에서 사용자가 정류소 전환을 요구하면, 전자장치는 3151 단계에 서 이를 인식하고, 3153 단계에서 다음 정류소의 어플리케이션 화면을 표시할 수 있다. 도 34a는 3개의 버스 정 류소를 설정한 예를 도시하고 있다. 그리고 자주 탑승하는 버스는 M3007, M3200이 설정된 예를 도시하고 있다. 또한 전자장치는 버스 어플리케이션 화면에 버스 정류소 이름을 표시할 수 있으며, 선택된 버스의 상세 도착 정 보를 표시할 수 있다. 도 34a의 화면 3410 화면에서 3413과 같이 버스 정류소 이름을 선택(예를들면, tap)되면, 전자장치는 3151 단계에서 버스 정류소의 전환 요구로 인식할 수 있다. 그러면 전자장치는 설정된 마지막 정류 소가 아니면 3151 단계에서 3415 화면과 같이 다음 정류소(예를들면, 버스정류소 #2)의 버스 어플리케이션 화면 을 표시할 수 있다. 상기 3415 화면이 표시되는 상태에서 참조번호3418과 같이 버스 정류소 영역이 선택(예를들 면, tap)되면, 전자장치는 다음 정류소(예를들면, 버스 정류소 #N)의 버스 어플리케이션 화면을 표시할 수 있다. 또한 상기 3420 화면이 표시되는 상태에서 참조번호 3423과 같이 브스 정류소 영역이 선택(예를들면, tap)되면, 전자장치는 설정된 마지막 정류소의 버스 어플리케이션 화면임을 인식하고, 처음 설정 정류소(예를들 면, 버스 정류소 #1)의 버스 어플리케이션 화면 3410을 표시할 수 있다. 상기 도 34a에 도시된 바와 같이, 버스 정류소의 이름이 선택되면 전자장치는 다음 버스 정류소의 어플리케이션 화면으로 전환할 수 있다. 그리고 전자장치는 전환되는 버스 정류소를 기준으로 사용자가 설정한 버스 번호 및 도착 예상 시간을 포함하는 상세 도착 정보를 표시할 수 있다. 버스 어플리케이션이 표시하는 상태에서 사용자가 정류소 및/또는 버스 설정을 선택하면, 전자장치는 3161 단계 에서 이를 인식하고, 3163 단계에서 정류소 추가 및/또는 버스 설정 동작을 수행할 수 있다. 도 34b를 참조하면, 3450 화면이 표시되는 상태에서 사용자가 설정버튼 1920을 선택하면, 전자장치는 3161 단계 에서 버스 정류소 및/또는 버스 설정을 인식하고, 3163 단계에서 3460 화면과 같이 설정 화면을 표시하면서 버 스 정류소 및/또는 버스 설정 모드로 진입할 수 있다. 또한 3455 화면이 표시되는 상태에서 사용자가 참조번호 3458과 같이 버스 정류소 이름을 롱터치(tap and hold) 하면, 전자장치는 3161 단계에서 버스 정류소 및/또는 버스 설정을 인식하고, 3163 단계에서 3460 화면과 같이 설정 화면을 표시하면서 버스 정류소 및/또는 버스 설 정 모드로 진입할 수 있다. 도 34c는 설정 버튼 1920의 선택에 의해 버스 정류소 및/또는 버스를 설정하는 동작을 설명하기 위한 도면이다. 3470 화면과 같이 버스 어플리케이션이 표시되는 상태에서 사용자가 참조번호 3473과 같이 설정 버튼을 선택하 면, 전자장치는 3475 화면과 같이 버스 정류소 설정 화면을 표시할 수 있다. 3475 화면에서 참조번호 3478과 같 이 버스 정류소 추가 버턴을 선택하면, 전자장치는 3480 화면과 같이 정류소 ID를 입력할 수 있는 화면을 표시 할 수 있다. 이때 사용자가 참조번호 3483과 같이 정류소 ID 입력을 선택하면, 전자장치는 3485 화면과 같이 정 류소 ID를 입력할 수 있는 키패드를 표시할 수 있다. 이때 사용자가 키패드를 통해 정류소 ID를 입력하고, 참조 번호 3488과 같이 완료버튼을 선택하면, 전자장치는 3490 화면과 같이 추가된 버스 정류소의 버스 번호를 선택 할 수 있는 버스 목록을 표시할 수 있다. 이때 사용자가 표시되느 버스 목록에서 버스를 선택한 후 확인 버튼을 누르면 전자장치는 추가된 버스 정류소 및 버스 번호들을 등록할 수 있다. 도 34d는 등록된 버스 정류소를 삭제하는 동작을 설명하기 위한 도면이다. 3400 화면과 같이 정류소 목록을 표 시하는 상태에서 참조번호 3401과 같이 등록된 버스 정류소를 선택하면(예를들면, 버스 정류소 #2), 전자장치는 삭제 버튼을 표시할 수 있다. 그리고 사용자가 참조번호 3402와 같이 삭제 버튼을 선택하면, 전자장치는 3403과 같이 선택된 버스 정류소를 삭제할 수 있으며, 버스 정류소(예를들면, 버스 정류소 #2)가 삭제되었음을 나타내 는 팝업 메시지를 표시할 수 있다. 버스 정류소를 삭제한 후, 전자장치는 3405 화면과 같이 변경된 버스 정류소 목록을 표시할 수 있다. 상기 도 31과 같이 버스 어플리케이션을 실행하는 중에 사용자가 버스 어플리케이션 동작의 종료를 요구하면, 전자장치는 3165단계에서 이를 인식하고, 버스 어플리케이션의 동작을 종료할 수 있다. 상기한 바와 같이, 웨어러블 전자장치는 시침 및 분침을 통해 시간을 표시하는 시계 화면에 설정된 버스 정류소 의 버스 도착 시간을 표시할 수 있다. 따라서 사용자는 시계 화면을 통해 현재의 시간과 함께 설정된 버스 정류 소에 도착하는 버스들의 도착 예정 시간을 확인할 수 있다. 본 발명의 다양한 실시예에서는 교통 수단이 버스인 경우를 예로들어 설명하고 있다. 그러나 버스 어플리케이션과 같이 교통 수단의 도착 예정 시간 정보를 전송할 수 있는 서버(content provider)와 접속되는 경우, 다양한 교통 수단의 도착 시간 정보를 웨어러블 전자장치에 서 표시할 수 있다. 예를들면, 콜 택시인 경우, 서버가 택시의 도착 위치 및 도착 예정시간을 전송하면, 전자장치는 수신되는 콜택 시의 도착 예정시간을 확인하고, 시계 화면의 시침 또는 분침의 회전 영역에서 해당하는 시간 위치에 택시의 도 착 예정 시간을 표시할 수 있다. 예를들면, 기차인 경우, 전자장치는 버스 정류소를 설정하는 방법과 유사한 방법으로 역을 설정하고, 역에 정차 하는 기차들 중에서 원하는 기차들이 되면, 선택된 역 및 기차 정보들을 등록할 수 있다. 그리고 전자장치는 서 버에서 전송되는 설정된 역의 기차 출발/도착 예정 시간을 확인하고, 시계 화면의 시침 및 분침의 회전 영역의 해당하는 기차의 도착/출발 시간 위치에 기차들을 큐 형태로 표시할 수 있다. 그리고 큐 형태로 표시되는 기차 들 중에서 상세 도착/출발 정보의 표시를 원하는 기차를 선택하면, 전자장치는 해당 기차의 상세 도착/출발 정 보를 표시할 수 있다. 예를들면, 선박인 경우, 전자장치는 버스 정류소를 설정하는 방법과 유사한 방법으로 선박을 탑승할 수 있는 항 구를 설정하고, 항구에 도착/출발하는 선박들 중에서 원하는 선박들이 선택되면, 선택된 항구 및 선박 정보들을 등록할 수 있다. 그리고 전자장치는 서버에서 전송되는 설정된 항구의 선박 도착/출발 예정 시간을 확인하고, 시계 화면의 시침 및 분침의 회전 영역의 해당하는 도착 시간 위치에 기차들을 큐 형태로 표시할 수 있다. 그리 고 큐 형태로 표시되는 선박들 중에서 상세 도착/출발 정보를 표시하기 위한 선박이 선택되면, 전자장치는 해당 기차의 상세 도착 정보를 표시할 수 있다. 예를들면, 비행기인 경우, 버스 정류소를 설정하는 방법과 유사한 방법으로 비행기를 탑승할 수 있는 공항을 설 정하고, 공항에 도착/출발하는 비행기들 중에서 원하는 비행기가 선택되면, 선택된 공항 및 비행기 정보들을 등록할 수 있다. 그리고 전자장치는 서버에서 전송되는 설정된 공항의 비행기 도착/출발 예정 시간을 확인하고, 시계 화면의 시침 및 분침의 회전 영역의 해당하는 도착/출발 시간 위치에 비행기들을 큐 형태로 표시할 수 있 다. 그리고 큐 형태로 표시되는 비행기들 중에서 상세 도착/출발 정보를 확인하기 위한 비행기가 선택되면, 전 자장치는 해당 비행기의 상세 도착/출발 도착 정보를 표시할 수 있다. 또한 사용자는 복수의 교통 수단들(예를들면, 시내버스와 시외 버스, 버스와 기차, 버스와 비행기, 기차와 버스 와 비행기 등)을 이용하여 이동할 수 있다. 복수의 교통 수단을 이용하는 경우, 전자장치는 각각 대응되는 교통 수단의 어플리케이션들을 구비할 수 있다. 그리고 해당하는 교통 수단의 어플리케이션을 실행하여 교통 수단을 탑승할 수 있는 정류소 및 탑승할 교통 수단을 설정할 수 있다. 그리고 전자장치는 각 교통 수단의 어플리케이 션을 실행하여 설정된 교통 수단의 서버들과 접속할 수 있다. 이후 전자장치는 각 교통 수단들의 서버로부터 해 당하는 정류소에 설정된 교통 수단들의 도착/출발 예정 시간을 수신할 수 있으며, 수신되는 교통 수단의 도착/ 출발 예정 시간들을 시계 화면에 표시할 수 있는 형태고 가공할 수 있다. 전자장치는 디스플레이 250이 시계 화 면에 해당하는 교통 수단들의 도착/출발 시간을 표시할 때, 시침 및/또는 분침의 회전 영역의 대응되는 도착/출 발 시간 위치에 해당하는 교통 수단의 아이콘을 표시할 수 있다. 이때 복수의 교통 수단들을 연동하여 표시하는 경우, 전자장치는 먼저 도착/출발하는 교통 수단의 어플리케이션을 실행하고, 해당하는 교통 수단의 도착/출발 이 이루어지는 시점에서 다음 교통 수단의 어플리케이션을 실행할 수 있다. 본 발명의 다양한 실시예에 따른 웨어러블 전자장치의 동작 방법은, 시침 및 분침을 통해. 시계 화면을 표시하 는 단계와, 교통 수단의 시간 정보를 수신하는 단계와, 상기 시계 화면의 분침 및/또는 시침 회전 영역의 상기 시간 정보 위치에 상기 교통수단의 아이콘을 표시하는 표시 단계를 포함할 수 있다. 상기 표시 단계는 상기 교통 수단의 설정된 정류소의 도착/출발하는 교통 수단의 아이콘들을 상기 시간 정보에 따라 표시할 수 있다. 상기 표시 단계는 상기 교통 수단 아이콘이 선택되면 선택된 교통 수단의 상세 도착/출발 시간을 표시하는 단계를 더 포함할 수 있다. 상기 표시 단계는 베젤의 회전에 따라 회전되는 표시 인디케이터를 표시하며, 상기 표시 인디케이터에 의해 지시되는 교통 수단 아이콘을 선택하는 단계를 더 포함할 수 있다. 상 기 표시 단계는 상기 시계화면, 교통 수단 아이콘, 표시 인디케이터를 서로 다른 레이어에 표시할 수 있다. 상 기 교통수단은 버스이며, 상기 표시 단계는 상기 버스 아이콘이 선택되면 선택된 버스의 번호, 도착시간 및/또 는 잔여 좌석 등의 상세 정보를 표시할 수 있다. 상기 표시 단계는 시계 화면에 버스 큐 및 설정 아이콘을 표시 하며, 상기 설정 아이콘이 선택되면 정류소 및/또는 버스 번호의 목록을 표시하는 단계와, 상기 표시되는 목록 에 선택된 버스 정류소 및 버스 번호를 등록하는 단계를 더 포함할 수 있다. 상기 표시 단계는 상기 시계 화면 의 특정 위치가 선택되면 설정된 다음 정류소의 화면으로 전환하여 표시하는 단계를 더 포함할 수 있다. 상기 표시 단계는 설정 아이콘이 선택되면 추가 옵션 아이콘을 표시하는 단계와, 상기 추가 옵션 아이콘이 선택되면 버스 번호를 삭제할 수 있는 삭제 아이콘을 포함하는 정보를 표시하는 단계를 더 포함할 수 있다. 상기 표시단 계는 설정된 정류소에 가장 빨리 도착하는 버스의 상세 정보를 표시하는 미니 어플리케이션을 수행하는 단계와, 상기 미니 어플리케이션 화면에서 특정 위치를 선택하면 상기 표시 단계로 전환하는 단계를 더 포함할 수 있다. 본 명세서와 도면에 개시된 본 발명의 다양한 실시 예들은 본 발명의 기술 내용을 쉽게 설명하고 본 발명의 이 해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발 명의 범위는 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변 형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3a 도면3b 도면3c 도면4a 도면4b 도면4c 도면5a 도면5b 도면5c 도면6a 도면6b 도면6c 도면7 도면8a 도면8b 도면8c 도면8d 도면9 도면10a 도면10b 도면11 도면12 도면13 도면14a 도면14b 도면14c 도면14d 도면15 도면16a 도면16b 도면16c 도면17 도면18 도면19 도면20 도면21a 도면21b 도면21c 도면21d 도면22 도면23 도면24 도면25 도면26 도면27a 도면27b 도면27c 도면27d 도면28a 도면28b 도면28c 도면29a 도면29b 도면30a 도면30b 도면31 도면32a 도면32b 도면32c 도면33a 도면33b 도면33c 도면33d 도면34a 도면34b 도면34c 도면34d"}
{"patent_id": "10-2015-0182277", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 웨어러블 전자장치를 포함하는 시스템 구성을 도시하는 도면이다. 도 2는 본 발명의 다양한 실시예에 따른 전자장치의 구성을 도시하는 도면이다. 도 3a - 도 3c는 본 발명의 다양한 실시예에 따른 전자장치의 구성을 도시하는 도면이다. 도 4a - 도 4c는 본 발명의 다양한 실시예에 따른 전자장치에서 교통 수단의 도착 시간을 표시하는 예를 도시하 는 도면이다. 도 5a - 도 5c는 본 발명의 다양한 실시예에 따른 전자장치의 교통 수단 표시 방법을 설명하는 도면이다. 도 6a - 도 6c는 본 발명의 다양한 실시예에 따른 전자장치에서 교통 수단의 도착 정보를 표시하는 방법을 설명 하기 위한 도면이다. 도 7은 본 발명의 다양한 실시예에 따른 전자장치가 버스 도착 정보를 표시하는 방법을 도시하는 흐름도이다. 도 8은 본 발명의 다양한 실시예에 따른 전자장치가 버스 도착 정보를 표시하는 예를 도시하는 도면이다. 도 9는 본 발명의 다양한 실시예에 따른 전자장치가 교통 어플리케이션을 실행하는 동작을 도시하는 흐름도이다.도 10a 및 도 10b는 본 발명의 다양한 실시예에 따라 전자장치가 교통 수단의 식별 정보를 등록하는 예를 설명 하기 위한 도면이다. 도 11은 본 발명의 다양한 실시예에 따른 전자장치의 버스 위젯 및 버스 어플리케이션의 전환 동작을 도시하는 흐름도이다. 도 12는 버스 위젯과 버스 어플리케이션의 표시 예를 설명하기 위한 도면이다. 도 13은 본 발명의 다양한 실시예에 따른 전장치의 버스 위젯 실행 동작을 도시하는 흐름도이다. 도 14a - 도 14c는 버스 위젯 실행 과정에서 표시되는 화면의 예들을 도시하는 도면이다. 도 15는 본 발명의 다양한 실시예에 따른 전자장치의 버스 위젯 화면을 표시하는 다른 방법을 도시하는 흐름도 이다. 도 16a - 도 16c는 도 15와 같은 동작을 수행할 때의 버스 위젯 화면을 표시하는 예를 도시하고 있다. 도 17은 본 발명의 다양한 실시예에 따른 전자장치의 버스 어플리케이션 실행 방법을 도시하는 흐름도이다. 도 18은 본 발명의 다양한 실시예에 따른 전자장치의 버스 어플리케이션 화면을 표시하는 방법을 도시하는 흐름 도이다. 도 19는 버스 어플리케이션 화면의 표시 예를 도시하는 도면이다. 도 20은 본 발명의 다양한 실시예에 따른 전자장치의 버스 상세 도착 정보를 표시하는 절차를 도시하는 흐름도 이다. 도 21a - 도 21d는 버스 상세 도착 정보를 표시하는 예를 나타내는 도면이다. 도 22는 본 발명의 다양한 실시예에 따른 전자장치의 버스 어플리케이션 화면을 전환하는 절차를 도시하는 흐름 도이다. 도 23은 버스 어플리케이션 화면의 전환 표시예를 도시하는 도면이다. 도 24는 본 발명의 다양한 실시예에 따른 전자장치의 버스 어플리케이션에서 정류소 및 버스 번호를 설정하는 절차를 도시하는 흐름도이다. 도 25는 버스 어플리케이션에서 정류소 및 버스 번호의 설정 화면 표시예를 도시하는 도면이다. 도 26은 버스 어플리케이션에서 설정 화면 및 추가 옵션 화면의 전환 예를 도시하는 도면이다. 도 27a - 도 27d는 버스 어플리케이션에서 정류소 식별자를 검색하는 예를 도시하는 도면이다. 도 28a - 도 28c는 버스 어플리케이션에서 정류소 및/또는 버스 번호를 설정하는 예를 도시하는 도시하는 도면 이다. 도 29a - 도 29b는 버스 어플리케이션에서 추가 옵션 동작을 수행하는 예를 도시하는 도면이다. 도 30a - 도 30b는 버스 어플리케이션에서 버스 위젯의 동작 예를 설명하기 위한 도면이다. 도 31은 본 발명의 실시예에 따른 전자장치의 버스 어플리케이션 실행 동작을 도시하는 흐름도이다. 도 32a - 도 32c는 버스 어플리케이션을 실행하는 상태에서 팝업 메시지를 표시하는 예를 도시하는 도면이다. 도 33a - 33d는 버스 어플리케이션의 실행 화면에서 버스 도착 정보를 표시하는 예를 도시하는 도면이다. 도 34a - 도 34d는 버스 어플리케이션의 화면에서 버스 정류소 및 버스 번호들을 설정하는 예를 도시하는 도면 이다."}
