{"patent_id": "10-2025-0046097", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0056848", "출원번호": "10-2025-0046097", "발명의 명칭": "공중권 분쟁 해결 및 법률 대응 자동화 시스템 및 방법", "출원인": "강성운", "발명자": "강성운"}}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "공중권, 조망권, 일조권을 포함하는 공간적 권리의 침해에 대응하기 위한 시스템에 있어서,침해 상황을 실시간으로 감지하는 침해감지부(100);감지된 침해 데이터를 분석하고 법률적 대응 시나리오를 생성하는 침해분석 및 법률대응모듈(200);분석된 침해 정보에 따라 자동으로 보상 절차를 수행하는 스마트 계약 기반 보상 시스템(300);침해 유형과 연관된 과거 판례 및 법률 기준을 연계하여 분석 및 추천을 수행하는 법률 DB 및 판례추천시스템(400);상기 모든 정보를 정부기관 또는 지자체와 연계하여 행정적 조치 및 정책 수립을 지원하는 행정/정책 연계 모듈(500);을 포함하는 것을 특징으로 하는 공중권 분쟁 해결 및 법률 대응 자동화 시스템."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 침해감지부(100)는 드론, UAM 등의 공중 이동체로 인한 공간적 권리 침해 여부를 속도, 고도, 위치, 경로등의 데이터를 기반으로 실시간 감지하며, AI 기반 침해 패턴 학습 기능을 포함하는 것을 특징으로 하는시스템."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 침해분석 및 법률대응모듈(200)은 감지된 침해 데이터를 기반으로 고의성, 반복성, 침해 강도 등의 침해유형을 자동 분류하고, 법적 대응을 위한 리포트 생성, 소송 또는 조정 시뮬레이션 기능을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 스마트 계약 기반 보상 시스템(300)은 침해 비율, 고의성 점수, 반복성 등을 정량화하여 보상 기준을 산정하고, 블록체인 기반의 스마트 계약을 통해 보상 절차를 자동 실행하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 법률 DB 및 판례추천시스템(400)은 침해 유형, 침해 지속 시간, 고의성 등 복수의 조건에 기반하여 유사판례를 자동 검색하고, 추천 결과를 리포트로 제공하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 행정/정책 연계 모듈(500)은 반복 침해 지역을 자동 분석하고, 보호구역 지정 요청, 정책 보고서 자동 생성, 건축허가 및 규제 시스템과의 연계를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2025-0056848-3-공중권, 조망권, 일조권의 침해에 대응하기 위한 법률 대응 자동화 방법에 있어서,침해감지부를 통해 공간적 권리 침해를 실시간으로 감지하는 단계;침해분석 및 법률대응모듈을 통해 감지된 데이터를 기반으로 침해 유형 및 법적 책임을 분석하는 단계;법률 DB 및 판례추천시스템을 통해 관련 판례 및 법률 기준을 자동 검색 및 추천하는 단계;스마트 계약 기반 보상 시스템을 통해 보상 절차를 자동 실행하는 단계;행정/정책 연계 모듈을 통해 정부기관 및 정책기관에 데이터를 연계하여 행정적 대응을 수행하는 단계;를 포함하는 것을 특징으로 하는 공중권 분쟁 해결 및 법률 대응 자동화 방법."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 침해감지부(100)는 사전 정의된 침해 예측 기준치에 도달할 경우, 피해자, 가해자 및 행정기관에 경고 알림을 전송하고, 지속 감시 상태로 전환하는 침해 경고 시스템을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 침해분석 및 법률대응모듈(200)은 침해 사실의 시공간 정보, 침해 경과, 고의성 판단, 유사 판례 매칭 결과 등을 법률적으로 유효한 증거 구조(예: 해시 처리된 시계열 로그, 이미지 증거 파일, AI 분석 리포트)로 자동 생성하여 저장하는 증거 생성 알고리즘을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서, 상기 침해분석 및 법률대응모듈(200)은 침해의 고의성, 반복성, 피해 면적, 시간대, 침해 빈도 등을 종합적으로분석하여 0~1 범위의 침해 위험도 점수를 산출하고, 이 위험도 점수를 기반으로 보상 기준 및 행정 조치 강도를자동 조정하는 기능을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 4에 있어서,상기 스마트 계약 기반 보상 시스템(300)은 다음과 같은 예외 처리 조건을 포함하는 것을 특징으로 하는시스템;(i) 피해자 신원 검증 절차 수행,(ii) 일정 기간 내 이의 제기 수용,(iii) 반복 침해 시 가중 보상,(iv) 행정기관 사전 승인 조건이 존재할 경우, 자동 실행 보류 및 승인 요청 수행."}
{"patent_id": "10-2025-0046097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,상기 법률 DB 및 판례추천시스템(400) 및 행정/정책 연계 모듈(500)은 외부 법률 시스템, 변호사 포털, 행정기관 서버와 RESTful API, Webhook, 또는 RPC 방식으로 연계되어, 침해 리포트, 판례 추천 결과, 보호구역 지정정보 등이 실시간으로 전달 및 통합될 수 있도록 구성된 법률 연계 API 구조를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 공중권, 조망권, 일조권 등 공간적 권리 침해를 실시간으로 감지하고, AI 기반 분석을 통해 고의성· 중대성을 판단하며, 유사 판례 추천과 스마트 계약 기반 자동 보상, 행정기관 연계까지 수행하는 리걸테크 (LegalTech) 기반 분쟁 대응 시스템 및 방법에 관한 것이다. 본 시스템은 공간 권리 보호의 법적·정책적 자동화 를 실현한다."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 공중권(Air Rights), 조망권(View Rights), 일조권(Solar Access Rights)을 포함하는 공간적 권리 (spatial rights) 침해와 관련된 법적 분쟁을 효율적으로 해결하기 위한 리걸테크(LegalTech) 분야에 관한 것으 로서, 특히 침해 데이터를 기반으로 법률적 책임 판단, 자동화된 분쟁 조정 및 보상 프로세스, 전자 문서 생성, 행정기관·사법기관과의 연계 시스템을 포함하는 법률 대응 자동화 시스템 및 방법에 관한 것이다. 본 발명은 2022년 2월 4일 출원된 원출원(출원번호: KR1020220014502)의 기술사상을 기반으로 하며, 그 후속 출 원인 공중권 데이터 시각화 및 리포팅 시스템(출원번호 KR1020250036078)에서 확보한 실시간 침해 감지 및 분석 기술, 보상 기준 산출 및 시각화 기술을 바탕으로, 그 침해 데이터를 법률적 판단 및 분쟁 해결 목적에 활용하 는 응용 기술로 확장된 발명이다. 기존의 공중권 및 공간적 권리 침해에 관한 법률 분쟁은 대부분 침해 발생 이후 수동적인 절차에 의존해왔으며, 피해자가 침해 사실을 입증하고 법적 책임을 추궁하는 데에 상당한 시간과 비용이 소요되었다. 특히, 반복적 침 해, 고의성 판단, 정량적 보상 기준 산출, 관련 판례 검색, 행정기관 연계 등 다양한 과정이 수작업 또는 비표 준화된 방식으로 처리되어왔다. 이에 따라, 본 발명은 공간적 권리 침해 데이터를 실시간으로 수집·분석하고, 해당 데이터를 바탕으로 AI 기반의 법률적 판단, 분쟁 조정안 자동 생성, 스마트 계약 기반 보상 처리, 전자 법 률문서 생성 및 제출, 법령 및 판례 연계 기능을 통해 공중권 분쟁에 대한 효율적·정량적·자동화된 법률 대응 프로세스를 실현하고자 한다. 이와 같은 기술은 부동산 개발, UAM/드론 운행, 도시계획, 행정규제 분야에서 공 중권과 관련된 법적 권리 보호를 지원함과 동시에, 법률 전문가, 보험사, 공공기관, 민간 플랫폼 등 다양한 주 체가 사용할 수 있는 법률지원 인프라로서의 기능도 수행할 수 있다."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 드론, 도심항공교통(UAM), 고층 건축물 등 공중 공간의 활용이 급증함에 따라, 공중권을 포함한 공간적 권 리 침해가 새로운 사회적 갈등 요인으로 부상하고 있다. 이에 따라 공중 이동체나 구조물로 인해 발생하는 조망 권 침해, 일조권 감소, 사생활 침해, 소음 피해 등이 민형사상 법적 분쟁으로 발전하는 사례가 증가하고 있으며, 이와 관련한 법률적 판단과 분쟁 해결의 수요 또한 폭발적으로 확대되고 있다. 하지만 현재까지 공중권 을 비롯한 공간적 권리 침해와 관련된 분쟁 해결은 대부분 피해자의 수동적 제소 또는 전문가 감정 평가를 통한 개별적 대응에 의존하고 있으며, 다음과 같은 구조적 한계를 내포하고 있다; 1. 객관적 침해 데이터의 부족 공중권, 조망권, 일조권 등 공간적 권리는 물리적으로 명확한 경계선이 존재하지 않고, 시공간적으로 변화하는 특성을 가지므로 그 침해 여부를 실시간으로 감지하거나 정량적으로 측정하는 것이 쉽지 않다. 기존에는 이러한 침해 상황을 피해자가 직접 체감하고, 직접 입증해야 하는 구조로 되어 있어, 분쟁 발생 시 피해자가 감정적· 법적 부담을 동시에 떠안는 경우가 많았다. 예를 들어, 한 아파트 주민이 맞은편에 신축된 고층 건물로 인해 하 루 중 일조 시간이 3시간 감소했다고 주장하더라도, 이를 입증하기 위해서는 첫째, 특정 날짜와 시간의 일조량 을 측정하고, 둘째, 과거의 일조 조건과 비교 분석한 감정서를 제출해야 하며, 셋째, 전문가의 증언까지 요구될 수 있다. 그러나 일반 시민이 이러한 절차를 직접 수행하는 것은 거의 불가능에 가깝고, 대부분의 경우 “느낌 에 불과한 주장”으로 받아들여질 가능성이 크다. 이는 피해 사실이 존재하더라도 법적으로 실효성 있는 구제를 받기 어렵게 만드는 구조적 장벽이다. 또한, 공중 이동체(드론, UAM 등)에 의한 침해의 경우에는 그 경로와 고도, 체공 시간, 반복 여부, 촬영 행위 등의 세부 요소가 침해 판단에 결정적이나, 이 역시 피해자가 직접 비행기록이나 영상을 확보하지 않는 한 법적 으로 침해를 입증할 수단이 없는 경우가 대부분이다. 더욱이 침해의 고의성, 즉 해당 비행이 우발적인 일회성 비행인지, 아니면 특정 건물을 의도적으로 반복 촬영하는 고의적 행위인지 판단하려면 단순 위치정보만이 아니 라 패턴 인식 기반의 분석 시스템이 필요하다. 하지만 현재의 시스템은 그러한 정밀 분석 능력을 갖추지 못하고 있으며, 단순히 위치 로그를 저장하거나 알림을 보내는 수준에 머물고 있다. 이러한 상황은 마치 블랙박스가 없 는 차량 사고와도 같다. 충돌이 있었고 피해가 발생했더라도, 정황만으로는 과실 비율을 판단할 수 없기 때문에 결국 목격자 증언이나 운전자의 주장에 의존해야 하는 구조가 되고 만다. 공간적 권리 침해 문제 역시 정확한 침해 기록 시스템이 없다는 점에서, 입증과 책임 판단의 공백이 반복되고 있다. 결과적으로, 객관적이고 정량적인 침해 데이터를 사전에 확보하고 자동 분석할 수 있는 기술 기반 시스템 의 부재는 공중권 및 공간적 권리 침해 관련 분쟁의 신속하고 공정한 해결을 어렵게 만들고 있으며, 이러한 문제는 리걸테크 기반 자동 분쟁 대응 기술의 필요성을 더욱 부각시키고 있다. 2. 법적 판단 및 문서화의 비표준성 공중권, 조망권, 일조권 등의 공간적 권리에 관한 침해가 발생했을 경우, 단순한 피해의 유무를 넘어서 해당 행 위가 법률적으로 위법한 침해인지 여부를 판단하고, 이에 따라 어떠한 법적 절차를 밟아야 하는지를 결정하는 과정은 매우 복잡하고 전문적인 해석을 요구한다. 그럼에도 불구하고 현재 이와 같은 판단과 대응은 대부분 수 작업, 비정형화, 사후적 대응에 의존하고 있으며, 다음과 같은 한계를 갖는다; 첫째, 법적 해석의 일관성 부족이다. 동일한 침해 상황임에도 불구하고, 담당 전문가나 기관에 따라 다른 법적 해석이 내려지는 경우가 많다. 예컨대, 특정 고층 건물이 인근 건물의 일조권을 침해한 사례에서, A 지역에서는 \"합리적인 설계 범위 내의 불가피한 그림자 효과\"로 간주되지만, B 지역에서는 \"거주자의 채광권 침해로 인한 실질적 피해\"로 인정되어 보상이 산정되기도 한다. 이러한 판단 기준의 불일치는 피해자와 가해자 모두에게 예 측 가능성을 떨어뜨리고, 불필요한 법적 분쟁과 비용을 양산하게 된다. 둘째, 법률 대응 문서의 비표준성과 작성의 어려움이다. 공간적 권리 침해가 발생한 경우, 이를 민사상 손해배 상 청구로 이어가기 위해서는 피해 사실을 기술하고, 법적 근거와 침해 유형을 명확히 제시한 서면(청구서, 민 원서, 진정서 등)을 작성해야 한다. 그러나 이 과정은 법률적 전문성이 없는 일반 시민에게는 매우 높은 진입장 벽이 되며, 결국 전문 변호사나 감정인의 도움을 받아야만 정식 절차에 들어갈 수 있는 구조로 이어진다. 이는 곧 시간과 비용의 문제로 연결되며, 침해 피해를 입고도 소극적으로 대응하거나, 아예 포기하는 사례로 이어진 다. 셋째, 과거 판례나 유사 사례와의 연계 부족이다. 공중권 및 조망권, 일조권 침해는 물리적으로는 유사한 구조 를 갖더라도, 법적으로는 어느 정도의 침해가 위법인지, 어떤 상황에서 정당한 이용으로 간주되는지 여부가 세 밀한 기준과 판례에 따라 좌우된다. 그러나 기존 시스템에서는 침해 분석 결과와 법적 판례 데이터를 자동으로 연결하거나, 해당 사건과 유사한 과거 사례를 제시하는 기능이 없다. 결과적으로, 피해자는 개별적으로 법률 검 색을 하거나, 전문 변호인의 자문 없이는 적절한 대응을 구성하기 어려운 구조에 놓인다. 이러한 상황은 마치 진단 장비 없는 병원에서 의사가 환자의 증상만 듣고 진단서를 써야 하는 것과 같다. 환자 가 분명히 고통을 호소하고 있지만, 그 고통의 원인을 정량적으로 증명할 영상 장비나 혈액 분석기가 없다면, 그 주장은 단순한 ‘주관적 호소’에 불과하게 되어버린다. 공중권 침해 피해자 역시 마찬가지다. 실제 피해가 발생했음에도, 그 피해를 객관적으로 법적 언어로 변환해줄 수 있는 정형화된 문서화 시스템이 존재하지 않으면, 그 권리는 사회적으로 인정받기 어렵다. 따라서 본 발명은 이러한 문제점을 극복하기 위해, 실시간 침해 데이터를 법률 기준과 자동 연계하고, 법령, 조 례, 판례, 정책 기준을 반영한 표준화된 법률 문서 자동 생성 기능을 제공함으로써, 누구나 손쉽게 법률적 대응 을 시작할 수 있는 리걸테크 기반 자동 분쟁 대응 체계를 구축하고자 한다. 3. 행정 및 사법 시스템과의 연계 부족 공중권 및 공간적 권리 침해와 관련된 분쟁은 단순한 사적 갈등에 머물지 않고, 건축 인허가, 항공 비행 허가, 도시계획, 민원처리, 소송 등 다양한 공적 절차와 밀접하게 얽혀 있는 사안이다. 따라서 침해가 발생했을 때, 그 사실이 법률적·행정적으로 즉시 반영되고, 조정 및 제한 조치가 내려질 수 있는 시스템적 연계성이 매우 중 요하다. 그러나 현재는 이러한 연계 시스템이 매우 단편적이거나, 아예 존재하지 않는 수준에 머물고 있다. 가 령, 드론 배송 서비스가 특정 주거지역의 상공을 반복적으로 비행하며 조망권과 사생활을 침해하고 있음이 객관 적으로 확인되었다고 가정하자. 하지만 이 정보는 드론 등록기관, 항공청, 지자체, 도시계획과, 법원, 민원포털 등 서로 다른 기관에 분산되어 있어, 각 기관이 실시간으로 해당 침해 정보를 공유하거나 조치를 취하기가 사실 상 불가능하다. 결과적으로, 피해자가 지자체에 민원을 제기하더라도, 지자체는 “항공기 비행은 국토부 소관”이라고 회피하거 나,“사생활 침해는 형사 문제이므로 경찰에 진정하라”고 안내할 뿐이고, 경찰은 “고의성이 불분명하며, 사적 분쟁일 수 있다”고 판단하여 사건을 종결시키는 식의 책임 전가 구조가 반복된다. 또 다른 예로, 고층 건물 신 축을 위한 건축허가 신청 단계에서 이미 조망권이나 일조권 침해 가능성이 높은 것으로 분석되었더라도, 그 정 보는 설계사무소나 감정기관의 보고서에만 존재할 뿐, 건축허가 시스템이나 도시계획 위원회의 데이터베이스에 는 반영되지 않는다. 이로 인해, 침해가 사전에 충분히 예측되었음에도 행정적 허가는 그대로 진행되고, 결국 피해자들은 사후적인 민사소송 외에는 대응 수단이 없는 상황에 처하게 된다. 이러한 행정 및 사법 시스템 간의 비연계성은 마치 병원이 환자의 병명을 정확히 알고 있음에도, 처방전이 약국으로 자동 전달되지 않아 환자가고통을 감수하고 다시 설명해야 하는 상황과 유사하다. 정보는 존재하지만, 시스템이 그것을 자동으로 전달하고 반영하지 못하기 때문에, 사회 전체적으로 반복되는 비용과 분쟁이 발생하는 구조인 것이다. 본 발명은 이러한 문제를 해결하기 위해, 첫째, 공중권 및 공간적 권리 침해 데이터를 실시간으로 분석하고, 둘 째, 해당 결과를 지자체·국토부·행정기관·민원포털 등과 연계 가능하도록 구성된 API 기반 구조, 셋째, 스마 트 계약 기반의 행정 조정 자동화 프로세스를 포함함으로써, 분쟁 발생 즉시 예방적 조치를 취하거나, 법률적 판단 결과가 제도적으로 반영되는 자동화된 시스템 연계 구조를 실현하고자 한다. 이를 통해 피해자 개인이 행 정기관과 사법기관을 하나하나 찾아다니며 설명해야 하는 구조에서 벗어나, 한 번의 침해 인지와 데이터 기록만 으로도 자동적인 조치가 이어질 수 있는 리걸테크 기반 생태계를 구축하는 것이 본 발명의 핵심 목적 중 하나이 다. 4. 기존 기술의 한계 공중권 및 공간적 권리 침해에 관한 기존 기술들은 주로 감시, 모니터링 또는 단편적인 데이터 기록 기능에 국 한되어 있으며, 실제 법적 분쟁 해결이나 보상 절차, 정책 조정에 이르는 종단형 프로세스를 통합적으로 처리하 는 시스템은 전무한 상태다. 이로 인해 다음과 같은 핵심적인 한계들이 존재한다; 단순 모니터링 시스템의 한계 기존 시스템은 침해 여부를 실시간으로 감지하더라도, 그 정보를 분석, 기록, 법적 근거화, 피해 산정, 보상 실 행으로 연결하지 못한다. 예를 들어, 어떤 시스템이 드론의 비행경로를 기록하고 특정 지역의 상공 체류 시간을 감지할 수 있다고 해도, 그 데이터가 법률적으로 “침해에 해당한다”고 해석할 수 있는 구조는 갖추고 있지 않 다. 이는 마치 CCTV가 침입자의 모습을 포착했음에도 불구하고, 해당 영상을 범죄 혐의로 자동 분류하거나 판단 해주는 기능이 없어 수동 검토에 의존하는 상황과 유사하다. 정형화된 판단 모델과 판례 연계 부족 공중권, 조망권, 일조권 침해는 정성적인 판단 요소가 강하기 때문에, 정확하고 일관된 법률 판단을 위해서는 수많은 과거 사례, 행정규정, 판례 데이터를 기반으로 한 정형화된 판단 모델이 필요하다. 하지만 기존 시스템 은 침해를 감지하더라도, 그 결과를 바탕으로 “이 침해가 법적으로 어떤 분류에 해당하며, 과거에 어떤 판례가 있었는가”를 자동 연결하지 못한다. 결국 법적 대응은 변호사나 감정 전문가의 해석에 전적으로 의존하게 되며, 이는 비용 증가, 대응 시간 지연, 법률 접근성 저하 등으로 이어진다. 자동화된 분쟁 대응 시스템 부재 공중권 침해와 같은 복합적이고 민감한 권리 침해 문제는, 단순 감지가 아닌 분쟁 예방 → 침해 판단 → 법적 조치 → 보상 → 정책 반영의 일련의 흐름을 자동으로 처리해야 실질적인 효과를 낼 수 있다. 그러나 기존 기술 은 대부분 특정 구간에만 집중되어 있어, 분쟁이 발생하면 여전히 사람이 직접 데이터를 추출하고, 해석하고, 대응 수단을 모색해야 하는 수동적 구조에 머물러 있다. 이는 마치 비행기가 자동 조종 장치 없이 기장과 부기 장이 모든 버튼을 직접 눌러야 하는 1960년대 수준의 항공기 조종 시스템과도 같다. 분쟁의 시대에 접어든 공간 적 권리 관리 기술은 이제 단순한 센서 기반 감시가 아닌 전 과정 자동화·지능화된 리걸테크 기반 인프라로 진 화해야 할 시점이다. 제도 및 정책과의 실시간 연동성 미비 도시계획, 건축허가, 비행 허가 등은 시간과 지역에 따라 수시로 바뀌는 행정 데이터 및 법령 기준에 따라 다르 게 판단된다. 그러나 기존 기술은 그러한 제도 변화와 침해 감지 데이터를 동적으로 연동하지 못하므로, 시스템 이 제 역할을 하기 위해서는 수동으로 법률 정보를 지속 업데이트해야 하며, 이는 현실적으로 운영을 어렵게 만 든다. 따라서 본 발명이 제안하는 시스템은 단순한 감지 기술을 넘어서, 실시간 데이터 수집 → 침해 판단 → 법률적 분류 → 보상 자동화 → 정책 연계까지 전 주기 자동화 및 지능화를 실현함으로써 기존 기술의 결정적 한계를 해결하고자 한다."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "표 1공중권 리걸테크 기반 침해 해결 시스템 필요성 요약 구분 핵심 문제점 필요한 개선 방향 1. 객관적 침해 데이터의 부족피해자가 침해 사실을 스스로 입 증해야 하며, 고의성/반복성 판 단 기준 부재AI 기반 실시간 침해 감지 및 자 동 정량 분석 체계 2. 법적 판단 및 문서화의 비표 준성법적 해석 불일치, 법률 문서 작 성 어려움, 판례·기준 연계 법률 판단 기준과 판례 연계된 자동 문서 생성 기능 3. 행정 및 사법 시스템과의 연 계 부족기관 간 정보 공유 체계 미비, 행정적 대응 지연, 책임 소재 불 명확행정기관 및 법률 시스템과 실시 간 연계 가능한 API 4. 기존 기술의 한계 감지/분석 시스템의 부분적 기능 에 국한, 자동화·통합성 부족종단형 침해 대응 흐름 자동화 및 정책 반영 시스템 선행기술문헌 특허문헌 (특허문헌 0001) KR1020220014502 (특허문헌 0002) KR1020230085428 (특허문헌 0003) KR1020250036078 비특허문헌 (비특허문헌 0001) 공대식, 「공중권의 범위에 관한 연구」,『토지법학』13: 67-111 (비특허문헌 0002) 성덕근, 부동산 등기제도의 개선에 관한 연구 -등기의 공신력 확보를 중심으로-, 서울:한국 법학원, 2023.12.31., 민-23-06, 1-92"}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 공중권 및 공간적 권리(조망권, 일조권 등)의 침해에 대한 실시간 감지 및 데이터 기반 분석 기술을 바탕으로, 침해가 발생했을 때 이를 법률적으로 대응하고 분쟁 해결까지 자동화할 수 있는 시스템을 제공하는 것을 주요 과제로 한다. 기존 기술들은 침해 여부를 감지하거나 시각화하는 수준에서 머무르고 있으며, 침해 사 실을 법적 증거로 가공하고, 피해자와 가해자 간의 보상 분쟁을 중재하며, 나아가 행정기관 및 사법기관과 연계 된 실질적인 법률 대응 시스템으로 발전시키는 데에는 한계가 있었다. 특히, 침해의 고의성, 반복성, 중대성 등 에 대한 법적 판단 기준이 시스템적으로 정립되지 않았고, 침해가 발생한 이후에도 피해자가 직접 증거를 수집 하고 행정기관을 찾아다니는 방식으로 대응해야 했다. 본 발명은 이러한 기존 기술의 한계를 해결하고, 다음과 같은 과제를 달성하고자 한다; 1. 공중권 및 공간적 권리 침해에 대한 법적 증거 자동화 시스템 구축 침해 감지 데이터를 법률적으로 유효한 형태로 변환하여, 소송, 행정조정, 분쟁 중재 등에 바로 활용할 수 있는 정형화된 법적 증거 문서로 자동 생성하는 시스템을 제공한다. 침해의 유형, 지속성, 고의성 등을 AI 기반으로"}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "평가하고, 사건 요약, 법률 위반 항목, 관련 판례를 자동으로 연결하여 판단의 객관성과 일관성을 확보할 수 있 도록 한다. 2. 법적 대응 및 보상 조정의 자동화 구현 침해가 일정 기준 이상일 경우, 시스템이 스마트 계약 기반으로 자동 보상 금액을 산출하고, 당사자 간 중재 절 차를 자동 개시할 수 있도록 한다. 법률 자문 없이도 피해자와 가해자 모두가 시스템을 통해 법률적 절차를 이 해하고 대응할 수 있도록 하는 자동화된 조정 절차 및 협상 알고리즘을 포함한다.3. 행정 및 사법 시스템과의 연동을 통한 실질적 제도화 지원 침해 감지 결과가 지자체, 국토교통부, 건축위원회, 도시계획과, 민원처리시스템, 법원 등과 자동 연계될 수 있 도록 API 기반 구조를 마련한다. 특정 빈도 이상 침해가 발생한 지역은 자동으로 공중권 보호구역으로 지정되거 나, 비행 제한구역 등록, 건축허가 반려 등의 행정적 대응이 시스템적으로 이루어질 수 있도록 한다. 4. 리걸테크 기반 공공 정책 및 판례 데이터와의 융합 기존의 판례, 행정지침, 보상 기준 등을 AI 학습 모델에 연동하여, 자동 판례 추천, 유사 사건 비교 분석, 보상 기준의 지역별 차등 반영 등이 가능하도록 한다. 이를 통해 피해자의 권리 보호뿐 아니라, 법적 기준과 보상 체 계의 표준화 및 고도화를 실현할 수 있도록 한다. 5. 기술적 연속성과 차별성 확보 본 발명은 선출원(출원번호: KR1020250036078)에서 제시된 공중권 감지 및 보상 자동화 기술을 기반으로 하되, 침해 데이터를 법적 대응 수단으로 활용하고, 리걸테크 기반 자동 분쟁 해결 기술로 확장함으로써, 기존 기술과 명확히 구별되는 고유한 기술적 영역을 형성한다."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 공중권, 조망권, 일조권 등 공간적 권리 침해를 실시간으로 감지하고, 이를 법률적으로 분류 및 분석 하여 자동으로 대응 및 분쟁 해결까지 가능한 공중권 분쟁 해결 및 법률 대응 자동화 시스템 및 방법에 관한 것 이다. 본 발명은 공중권, 조망권, 일조권 등 공간적 권리에 대한 침해 상황을 도 1에 도시된 바와 같이 입체적 공간 구조로 구분하여 정의하고, 그 침해 여부를 실시간으로 감지하고 시각화할 수 있는 시스템을 제공한다. 특 히, 공중권과 개발권 간의 상호작용 및 보상 구조는 도 2에 도시된 바와 같이 구조화되어 있으며, 이 구조는 공 중권 침해가 발생했을 경우, 자동화된 보상 및 법률적 대응 흐름과 연계된다.본 발명은 다음과 같은 구성 요소 및 기술적 수단을 포함하여, 기존 기술에서 해결하지 못한 법적 대응 자동화 과제를 실질적으로 해결하고자 한 다. 1. 침해 데이터 기반 법률 대응 모듈 본 발명은 공중권 또는 조망권, 일조권 침해를 실시간으로 감지하는 침해 감지부로부터 수집된 데이터를 법률적 으로 가공 가능한 형태의 증거 자료로 자동 전환하는 법률 대응 모듈을 포함한다. 감지된 침해 데이터는 침해 발생 시간, 위치, 대상, 유형, 지속시간, 반복성 등을 포함하며, AI 기반의 분류 알고리즘을 통해 침해의 고의 성 여부, 경중 정도, 반복 여부를 판단한다. 판단 결과는 행정기관 및 사법기관 제출에 적합한 구조화된 법률 증거 문서(예: 침해 리포트)로 자동 변환된다. 예를 들어, 드론이 특정 아파트 상공을 반복적으로 저속으로 체 류하며 촬영을 시도한 경우, AI는 해당 행위를 “의도적 공중권 및 사생활 침해”로 분류하고, 이를 기반으로 민사상 손해배상 청구서, 행정 경고 요청서, 분쟁 조정 신청서 등의 초안을 자동 생성할 수 있다. 2. 스마트 계약 기반 보상 자동화 및 중재 시스템 본 발명은 법률적으로 침해로 판정된 사례에 대하여 스마트 계약 기반 보상 프로토콜을 통해 보상금 산정, 지급 요청, 협상 중재까지 자동으로 수행할 수 있도록 구성된다. 침해 유형별 보상 기준은 AI가 과거 사례 및 판례 데이터를 기반으로 자동 갱신하며, 지역, 시간, 침해 지속성, 주거 유형 등을 고려한 가중치 기반 보상 산정이 가능하다. 보상안은 당사자에게 자동 통보되며, 이의 제기 → AI 기반 조정안 생성 → 합의 중재의 절차를 거쳐 처리된다. 예를 들어, 조망권이 30% 이상 침해되고 침해가 7일 이상 지속되었을 경우, 기준 보상액의 50%~70% 사이에서 중재안을 제시하고, 이의 제기 시 과거 유사 사례를 기반으로 AI가 합리적인 조정안을 생성해주는 방 식이다. 3. 정책 및 행정 대응 연계 API 구성 본 발명은 행정기관 또는 정책관리기관과의 실시간 연계를 위한 인터페이스(API)를 포함한다. 이를 통해 침해가 일정 기준을 초과하거나 반복될 경우, 시스템이 행정적으로 직접 대응할 수 있도록 한다. 예를 들어, 특정 구역 에서 한 달간 10회 이상 공중권 침해가 발생한 경우, 해당 데이터를 기반으로 지자체에 자동 보고, 필요 시 비 행제한구역으로의 행정적 지정 요청이 자동 생성된다. 행정법, 도시계획, 건축법, 항공법 등 관련 규정과 연계 된 법률 해석 모듈이 탑재되어, 현재 법적 기준에 부합하는 판단을 제공할 수 있도록 구성된다. 4. 판례·법률 데이터베이스 및 AI 자동 추천 시스템 본 발명은 법률 분쟁 해결을 위한 국내외 판례 및 법령 DB와 연동된 AI 추천 시스템을 포함한다. 침해가 발생하 면 시스템은 침해 유형에 부합하는 유사 판례, 손해배상 인정 사례, 보상 산정 기준을 자동으로 매칭하여 사용 자에게 제공한다. 이 기능은 변호사 또는 공공기관에서의 사건 처리 시간을 줄이며, 피해자가 스스로 법률 절차 를 이해하고 대응할 수 있도록 지원한다. 예를 들어, 드론 비행으로 조망권이 침해된 사례가 발생하면, \"서울중 앙지방법원 2020가합123456\" 판례처럼 유사 판례 및 배상 인용 사례를 실시간으로 추천받을 수 있다. 5. 정책 수립 지원 및 공중권 보호구역 지정 기능 본 발명은 반복 침해가 발생하는 지역을 자동 분석하고, 공중권 보호구역 자동 지정 및 도시계획/행정지도 반영 기능을 제공한다. 특정 조건에 따라 리포팅 모듈은 정책기관에 자동 보고서를 제출하고, 해당 구역에 대한 비행 제한, 건축 제한, 주민 안내 조치 등의 행정 정책을 연계할 수 있도록 설계된다. 도시계획기관과 연계될 경우, 향후 건축 설계에 본 시스템에서 도출한 침해 예측 시뮬레이션이 직접 반영될 수 있다. 본 발명은 상기와 같은 구성요소 및 수단을 통해, 기존의 공중권 감지 및 시각화 시스템을 법률적 대응 기술로 확장하며, AI 기반의 자동화된 분쟁 해결, 법적 중재, 보상 처리, 정책 반영까지 실현하는 리걸테크 기반의 통 합형 공중권 분쟁 대응 시스템을 제공한다."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 공중권, 조망권, 일조권 등 공간적 권리에 대한 침해가 발생한 경우, 이를 단순히 감지하는 수준을 넘어서 실시간으로 정량화된 데이터를 기반으로 침해를 분석하고, AI 기반 침해 판단 및 판례 추천, 스 마트 계약 기반 보상 실행, 행정·정책 연계까지 모두 자동으로 수행할 수 있는 리걸테크(LegalTech) 기반의 통 합 시스템을 제공함으로써, 공간적 권리에 대한 법률적 보호와 행정적 개입을 구조적으로 실현할 수 있다. 특히, 본 시스템은 위치, 고도, 방향, 체류 시간 등 이동체 또는 구조물의 데이터를 실시간으로 수집하여 침해 여부를 감지하고, AI 분류 모델을 통해 침해의 고의성, 반복성, 피해 강도 등을 자동 판별하며, 해당 결과를 바 탕으로 침해 유형에 따른 법률 리포트를 자동 생성한 후, 과거 판례 및 법리를 비교하여 법적 대응 방향을 도출 함으로써, 기존에는 수작업으로 이루어졌던 법률 검토 과정을 자동화할 수 있다. 더불어, 정량화된 침해 분석 결과는 스마트 계약 조건으로 자동 삽입되어 Ethereum 또는 Hyperledger 등의 플랫폼 상에서 피해자의 디지털 지갑으로 보상금이 자동 송금되며, 이 내역은 블록체인 원장에 불가역적으로 기록되어, 향후 동일 침해의 누적 이력 분석과 분쟁 예방에도 활용 가능하다. 뿐만 아니라, 일정 기준 이상의 반복 침해가 발생할 경우, 시스템은 해당 지역을 ‘공중권 보호구역’ 후보로 자동 지정하고, 도시계획 및 건축허가 심사 과정에 자동 연동되는 정 책 데이터를 생성·전송함으로써, 실질적인 제도 개선 및 행정 조치를 가능케 한다. 이로써 본 발명은 법률, 기 술, 행정의 전 과정을 자동화·통합한 공중권 분쟁 대응 시스템으로서, 회피 설계를 원천적으로 방지하면서도 법률 서비스의 접근성과 효율성을 대폭 향상시키며, 나아가 리걸테크(LegalTech) 산업의 구조적 확장성과 사회 적 수요에 부합하는 기술적 기여를 실현할 수 있게 된다."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 공중권, 조망권, 일조권을 포함하는 공간적 권리에 대한 침해가 발생할 경우, 이를 실시간으로 감지 하고, 침해 관련 데이터를 구조화된 형태로 수집·분석하여 법률적으로 유효한 증거로 자동 전환하며, 이어서 스마트 계약 기반 보상 절차, 인공지능(AI) 기반 법률적 판단 및 조정, 행정기관과의 정책 연계까지 자동으로 수행하는 공중권 분쟁 해결 및 법률 대응 자동화 시스템 및 방법에 관한 것이다. 전체 시스템의 개념적 구조와 공간적 권리의 입체적 범위는 도 1에 도시되어 있으며, 공중권과 이전 가능한 개발권(TDR: Transferable Development Rights) 간의 관계 및 보상 메커니즘은 도 2를 통해 개념적으로 설명된다. 또한, 공중권 및 조망권, 일조권 침해 사례에 대한 기존의 감지 및 보상 시스템의 통합적 활용 시나리오는 도 3에서 제시된 바와 같이 구성된다. 도 1 내지 도 3의 도면은 모두 본 발명의 선출원(KR1020250036078)에서 이미 제시된 도면을 참조한 것이다. 본 분할출원에서 새롭게 제안되는 자동화된 법률 대응 시스템의 전체 구성은 도 4에 도시되어 있으며, 침해감지부 에 의한 데이터 수집을 시작으로, 침해분석 및 법률대응모듈을 통한 고의성 및 중대성 판단, 법률 DB 및 판례추천시스템에 의한 유사 판례 자동 추천, 스마트 계약 기반 보상 시스템에 의한 보상 절차 자 동 실행, 그리고 행정/정책 연계 모듈을 통한 공공기관 보고 및 보호구역 지정 제안에 이르기까지, 침해 대응의 전 과정을 자동화된 흐름으로 구성한다. 이 중에서도, 침해 발생 이후 리포트 생성 및 법률적 근거 확보 절차는 도 5에 도시된 바와 같이 보다 구체적으 로 구성되며, 침해 유형, 발생 시각, 위치 정보, 반복성, 고의성 등의 항목에 기반한 자동 분류 및 법률적 리포 트가 생성된다. 이 과정은 이후 법적 분쟁이나 손해배상 청구 등에 활용될 수 있도록 증거화되며, 판례 추천 결 과와 함께 자동 첨부된다. 침해가 일정 기준 이상일 경우, 도 6에 도시된 스마트 계약 기반 보상 시스템이 자동 으로 실행되며, 침해 비율, 지속 시간, 고의성 점수, 반복성 등을 반영하여 보상액을 산출한 후, Ethereum 또는 Hyperledger 기반 스마트 계약을 통해 피해자에게 직접 보상금이 전송된다. 이 보상 내역은 블록체인에 자동 기 록되며, 법률 리포트와 함께 각 당사자 및 행정기관에 공유된다. 특히, 특정 지역에서 침해가 반복적으로 발생 하는 경우, 도 7에 도시된 바와 같이, 침해 빈도, 고의성 점수, 피해 면적 등을 기준으로 해당 지역을 자동으로 ‘공중권 보호구역 후보’로 지정할 수 있으며, 이 결과는 지자체의 도시계획 시스템 또는 관련 행정기관에 자 동으로 전송된다. 해당 데이터는 건축허가 심사, 드론 비행 제한, 사생활 보호 정책 등의 실질적 규제 반영에 활용될 수 있도록 설계되어 있다. 이하, 본 발명의 구체적인 실시 형태는 시스템의 주요 구성요소별로 상세히 설명한다. 1. 침해 감지부 침해 감지부는 드론, UAM, 고정 구조물 등으로 인해 조망권, 일조권, 공중권 등 공간적 권리가 침해되는지 를 실시간으로 감지하고, 관련 데이터를 수집하여 분석 가능한 형태로 구조화하는 구성이다. 침해 감지부 는 침해 행위가 일정 기준에 도달하기 전, 이를 사전에 예측하여 사용자 또는 행정기관에 경고할 수 있는 사전 경고 기능을 포함할 수 있다. 예컨대, 동일 객체가 3분 이상 동일 고도에서 정지해 있는 경우, 아직 침해 기준 (예: dwell time 5분)을 초과하지 않았더라도 “침해 임박” 상태로 분류하여, 경고 메시지를 실시간으로 피해 자 스마트폰 또는 도시 관제 시스템에 전송할 수 있다. 이러한 기능은 침해를 사전에 방지하고, 분쟁 가능성을 줄이는 데 유용하다. 침해 감지부는 물리적 감지장치와 분석 알고리즘을 포함하는 통합 센서 모듈로서, 다 음과 같은 하위 구성요소를 포함한다. 이동체 추적 센서 모듈 이동체 추적 센서 모듈은 공중에서 이동하거나 정지 중인 객체(예: 드론, UAM 등)의 세부적인 이동 패턴을 실시 간으로 정밀 추적하기 위해, 다양한 위치 및 자세 센서의 융합 데이터를 활용한다. 본 모듈은 위성 기반 측위 시스템(GPS, GLONASS, Galileo, BeiDou 등)으로부터 수신되는 정밀 좌표 데이터를 바탕으로 대상 객체의 위도, 경도, 고도 정보를 지속적으로 수집하며, 실시간 위치 변화를 1초 이하의 간격으로 샘플링한다. 이와 함께, 관 성 측정 장치(IMU)는 3축 가속도계 및 자이로스코프 데이터를 통해 이동체의 속도 변화, 회전 방향, 각속도, 가 속도 등을 감지하고, 자기 센서(Magnetometer)는 이동체의 절대 방향(나침반 값 기준)을 확인함으로써, 드론 또 는 UAM이 특정 지점에서 방향을 고정하거나 회전하는 패턴을 포착할 수 있도록 한다. 특히, 본 모듈은 아래와 같은 조건을 만족하는 경우 침해 패턴 가능성이 있는 것으로 간주한다; 표 2 AI 기반 고의성 분석을 위한 침해 행위 정량화 조건 예시 고도 40m 이상에서 동일 좌표(±2m 이내) 내 60초 이상 체류 동일한 방향각(azimuth) ±5도 내에서 30초 이상 연속 시선 고정 반복적으로 동일 좌표에서 일정 시간 간격(예: 매일 오전 9시)으로 비행 및 정지 행위 발생 이러한 데이터는 객체 식별 코드(object_id), 시점별 위치 및 고도, 체류 시간, 방향 고정 지속 시간 등으로 구 성된 구조화된 형태로 정리되어, 침해 감지부 또는 법률 분석 모듈로 전송된다. 표 3 침해 감지부에 의해 수집된 위치 기반 침해 데이터의 예시 구조 { \"object_id\": \"UAM_0072\", \"lat\": 37.553203, \"lon\": 127.037091, \"altitude\": 48.5, \"speed\": 0.3, \"heading\": 145.0, \"dwell_time\": 92.5, \"azimuth_hold\": 38.4, \"timestamp\": \"2025-04-09T07:14:55\" } 이러한 정보는 단순한 이동 기록을 넘어서, \"사생활 침해 가능성\" 또는 \"조망권 장기 방해 여부\" 등 공간적 권 리에 대한 실질적 침해 가능성을 수치적으로 정량화하는 데에 중요한 역할을 수행한다. 또한, 추후 침해 리포트 자동 생성 시, 고의성 여부 판단의 핵심 지표로 활용된다. 환경 감시 센서 모듈 환경 감시 센서 모듈은 드론, UAM, 고정 구조물 등으로부터 발생하는 물리적·시각적 침해 요소를 감지하고, 이 를 정량화된 데이터로 변환하여 침해 여부를 판단할 수 있도록 지원하는 복합 센서 시스템이다. 본 모듈은 침해 행위가 단순한 위치 기반 움직임을 넘어, 시선 고정, 조망 차단, 사생활 침해 가능성 등 행태적 침해 요소를 포착하는 데 핵심적인 역할을 수행한다. 침해 감지부는 다양한 센서 및 감지 수단을 통해 공간적 권리의 침 해 가능성을 정밀하게 탐지하며, 이를 위해 다음과 같은 구성 센서와 기능을 포함한다. 먼저, 이미지 인식 기반 카메라 센서는 고정형 또는 회전형 카메라 모듈이 장착된 이동체(예: 드론)에 탑재되어, 카메라의 시선 방향을 추적한다. 이 센서는 AI 기반의 시선 추적 알고리즘과 결합되어, 특정 창문이 나 옥외 공간(예: 테라스, 발코니 등)에 대해 장시간 동안 카메라가 초점을 유지하는 경우를 자동으로 감지한다. 예컨대, 동일한 창 방향으로 30초 이상 시선이 고정될 경우 해당 행위를 ‘시선 침해’ 패턴으로 분 류하여 침해 가능성을 판단한다. 다음으로, 라이다(LiDAR) 센서는 고해상도 거리 측정 데이터를 수집하여, 고정 구조물(예: 신축 건물, 철탑 등)이 기존 건물의 조망권 또는 일조권을 차단하고 있는지를 3차원 공간 상에서 시뮬레이션한다. 본 센서는 조 망 차단각, 그림자 투사 면적, 시간대별 일조 차단율 등의 요소를 정량적으로 분석하여, 특정 구조물이 인접 건 물에 미치는 시야 차단 또는 일조 방해 정도를 수치화된 데이터로 제공한다. 또한, 열 감지 센서(Infrared Sensor)는 야간 시간대나 시각적으로 가시성이 떨어지는 상황에서도 침입 객체(예: 드론)의 열 신호를 기반으로 체류 시간, 접근 경로 등을 추적함으로써 단순 시각적 침해 여부를 넘어 실질적인 침입 행위까지 포착할 수 있다. 마지막으로, 초음파 거리 센서는 외부 환경의 소리 반사를 활용하여, 구조물 간 거리 또는 이동체와 대상물 간 의 거리를 측정한다. 이 센서를 통해 일정 거리 이하(예: 3m 이내)로 지속적으로 접근하는 경우를 실시간으로 탐지하며, 이와 같은 근접 행위는 ‘근접 침해’ 가능성이 있는 것으로 판단된다. 이러한 다층적 감지 체계는 공간 이동체 또는 고정 구조물에 의한 침해 행위를 입체적으로 분석하고, 침해 유형 별로 구체적인 패턴을 분류하여 AI 분석 모듈로 전달할 수 있는 구조화된 데이터로 변환함으로써, 법적 판단의 기초 자료로 활용될 수 있다. 표 4 다중 센서 융합을 통한 공간 침해 분석 데이터 예시 { \"object_id\": \"DRONE_3021\", \"target\": \"A아파트 701호 테라스\", \"hover_time\": 44.1, \"camera_focus_direction\": \"동남동(125°)\", \"lidar_occlusion_angle\": 37, \"shadow_area\": 8.2, \"inferred_privacy_risk\": 0.87, \"timestamp\": \"2025-04-09T15:21:03\" } 위 데이터는 해당 드론이 특정 세대의 테라스를 향해 44초 이상 시선을 고정하고, 동시에 주간 라이다 시뮬레이 션 상 조망 차단각이 37도에 달하며, 사생활 침해 위험도 점수 0.87을 기록한 상황을 예시로 보여준다. 이러한 데이터는 침해 감지부와 연계되어 AI 기반 침해 분석 알고리즘에 투입되며, 침해 유형 분류, 고의성 판단, 보상 산정 및 법률적 대응을 위한 핵심 입력값으로 사용된다. 이처럼, 환경 감시 센서 모듈은 물리적 측정과 행 태 인식이 결합된 행위 기반 침해 감지 기술의 중심을 이룬다. 건축물 변화 감지 모듈 건축물 변화 감지 모듈은, 일정 간격으로 수집되는 항공 촬영 데이터 또는 드론 기반의 정밀 3D 스캔 데이터를 분석하여 신규로 세워진 고정 구조물(예: 고층 건물, 옥상 증축, 간판, 송전탑 등)의 형상과 위치를 식별하고, 기존 건축 환경 대비 어떠한 변화가 발생했는지를 정량적으로 추출하는 기능을 수행한다. 이 모듈은 먼저 다중 시점에서 촬영된 이미지를 기반으로 Structure-from-Motion(SfM) 기술 및 3D 포인트 클라우드 매핑을 수행하여, 변화된 구조물의 입체적 형태를 재구성한다. 이후, 해당 구조물의 좌표, 높이, 폭, 방향 등을 수치화하고, 기존 구조물 정보와 비교함으로써 조망권 및 일조권 침해 가능성이 있는지를 자동 분석한다. 가. 그림자 투사 시뮬레이션 : 시뮬레이션 알고리즘은 위도, 경도, 일시, 구조물 높이 및 방향 정보를 기반으로, 태양의 고도와 방위각에 따라 그림자의 길이와 방향을 예측한다. 분석 결과는 일자별로 시간대별 그 림자 범위를 생성하며, 다음과 같은 기준으로 침해 가능성을 판단한다; 특정 날짜(예: 동지 기준) 오전 9시~오 후 3시 사이 그림자가 대상지의 일조면을 1시간 이상 덮는 경우, ‘일조권 침해’ 위험으로 판단한다. 또한 침 해 시간 누적이 하루 2시간 이상인 경우, ‘중대한 일조권 침해’로 분류한다. 해당 구조물이 특정 일시에 어느 방향으로, 어느 정도의 길이로 그림자를 투사하는지를 시뮬레이션하기 위해, 시스템은 태양의 고도와 방위각 정보를 기반으로 그림자의 길이와 투사 좌표를 정밀하게 계산한다. 이러한 시뮬 레이션은 지리적 위치, 건축물의 높이, 해당 날짜와 시간 등의 요소를 종합적으로 고려하여 이루어지며, 시간대 별로 그림자의 이동 경로와 범위를 예측하는 데 활용된다. 특히, 인접 건물의 창호부, 테라스, 정원 등 주요 생 활 공간에 그림자가 도달하는 빈도와 지속 시간을 분석함으로써, 구조물에 의한 일조권 침해 가능성을 정량적으 로 평가할 수 있다. 이러한 분석 결과는 침해 분석 및 보상 기준 산정 과정에 자동으로 반영되어, 법률적 대응 및 정책 결정에 신뢰할 수 있는 자료로 활용된다. 표 5 건축물 그림자 범위 산출을 위한 태양 위치 기반 시뮬레이션 코드 예시 import math from datetime import datetime from pysolar.solar import get_altitude, get_azimuth # 건물 위치 및 높이 lat, lon = 37.5665, 126.9780 # 서울시청 좌표 building_height = 50 # meters date_time = datetime(2025, 6, 21, 10, 0, 0) # 6월 21일 오전 10시 # 태양 고도각 및 방위각 계산 altitude = get_altitude(lat, lon, date_time) azimuth = get_azimuth(lat, lon, date_time) # 그림자 길이 계산 if altitude > 0: shadow_length = building_height / math.tan(math.radians(altitude)) else: shadow_length = 0 print(f\"[그림자 시뮬레이션] 고도각: {altitude:.2f}°, 그림자 길이: {shadow_length:.2f}m, 방위 각: {azimuth:.2f}°\") 표 6 태양 위치 기반 그림자 길이 및 방향 출력 예시 [그림자 시뮬레이션] 고도각: 45.10°, 그림자 길이: 55.60m, 방위각: 130.45° 해당 분석 결과는 지리정보시스템(GIS)과 연동되어, 실제 지형 및 건물 배치 정보를 반영한 2D 또는 3D 지도 상 에 그림자 투사 범위를 시각적으로 표현할 수 있다. 이를 통해 특정 시간대에 구조물이 주변 공간에 어떤 방식 으로 영향을 미치는지를 한눈에 파악할 수 있으며, 그림자가 닿는 범위, 이동 경로, 일조 차단 시간 등을 시각 적으로 직관적으로 확인할 수 있다. 예를 들어, 고층 건물이 남향 주거지역 앞에 신축될 경우, 해당 건물의 오 전 9시부터 오후 3시 사이 그림자 범위를 시뮬레이션하여, 주변 건물의 일조권 침해 여부를 예측할 수 있다. 이 시각화 정보는 도시계획 검토, 인허가 심사, 민원 대응 및 법률적 판단의 기초자료로도 활용될 수 있으며, 추후 반복 측정 데이터를 통해 침해 경향을 장기적으로 모니터링하고 정책 조정에 반영할 수 있는 기반이 된다. 나. 조망 차단 분석 : 신규 구조물의 전면 또는 측면이 특정 세대 또는 위치에서 확보되던 조망을 차단하는지를 분석한다. 사용자는 기존에 확보되었던 조망각(예: 60도 시야 확보)을 기준으로 하며, 신규 구조물이 차지하는면적을 시야 내 각도 및 높이 기준으로 정량화한다. 예를 들어, 기존 조망각 60도 중 20도가 차단될 경우, 조망 권 침해율은 33.3%로 기록된다. 조망 차단 비율이 30% 이상이면 법률상 '실질적 침해' 기준에 해당할 수 있으며, 자동으로 침해 분석 보고서에 첨부된다. 본 기능은 특정 위치에서 조망권을 판단하기 위해, 관측 지점 을 중심으로 형성되는 시야각(視野角)을 기준으로 하여, 새롭게 건설된 구조물이 해당 시야를 얼마나 차단하는 지를 정량적으로 분석하는 방식으로 이루어진다. 구체적으로는 3차원 모델링된 건축물의 좌표 정보를 기반으로, 원래 확보되어 있던 시야각을 기준으로 하여 차단된 영역의 각도 또는 면적 비율을 산정하고, 이를 통해 전체 시야 중 차단된 부분이 차지하는 상대적 비율을 계산하게 된다. 예를 들어, 한 지점에서 전방 120도 범위의 조 망권이 확보되어 있었으나, 신축된 고층 건물에 의해 35도가 차단되었다면, 해당 위치의 조망 차단율은 약 29.2%로 산출되며, 이 수치는 조망권 침해 여부 판단의 핵심 기준으로 활용된다. 이러한 분석은 시뮬레이션 결 과와 함께 GIS 또는 시각화 엔진과 연동되어, 차단된 시야 범위를 직관적으로 확인할 수 있도록 한다. 표 7 조망권 침해율 산출을 위한 수치 기반 시뮬레이션 예시 # 기존 조망각 (예: 좌측 30도 ~ 우측 30도 → 총 60도 확보) original_view_angle = 60 # degrees # 신규 구조물로 차단된 각도 측정 blocked_angle = 18 # degrees # 침해율 계산 obstruction_rate = blocked_angle / original_view_angle print(f\"[조망 차단] 총 시야각: {original_view_angle}°, 차단 각도: {blocked_angle}°, 침해율: {obstruction_rate*100:.2f}%\") 표 8 조망 차단율 시뮬레이션 결과 출력 예시 [조망 차단] 총 시야각: 60°, 차단 각도: 18°, 침해율: 30.00% 침해율이 30%를 초과하는 경우, 시스템은 해당 침해를 ‘경미한 수준’이 아닌 ‘중대한 조망권 침해’로 자동 분류한다. 이 기준은 법률적 판단에서 실질적인 피해 여부를 평가하는 데 있어 중요한 임계값으로 작용하며, 조 망 차단의 정도가 사용자의 일상적 시야에 중대한 영향을 미친다고 판단될 수 있는 수준을 의미한다. 예컨대, 조망의 3분의 1 이상이 차단되는 경우에는 해당 건축물이나 구조물이 거주자 또는 토지 소유자의 심리적·경제 적 이익에 실질적인 침해를 야기한다고 간주할 수 있기 때문에, AI 분석 결과에서는 이를 ‘중대한 침해’로 자 동 태깅하고, 후속 법률 보고서 또는 판례 검색 기준에도 이와 같은 분류가 반영된다. 생성되는 리포트에는 ‘ 중대한 조망권 침해’라는 명확한 문구와 함께, 해당 침해율 수치(예: 32.8%) 및 시뮬레이션 이미지가 포함되며, 피해자, 법률대리인, 행정기관이 쉽게 이해하고 활용할 수 있도록 구성된다. 다. 결과 처리 : 분석된 결과는 JSON 또는 GeoJSON 형태로 구조화되어 침해 분석 및 법률 대응 모듈에 전 달된다. 이 데이터는 이후 스마트 계약 기반 보상 시스템 및 법률 DB 및 판례 추천 시스템에서 보상 기준 및 판례 검색 조건으로 연동된다. 행정기관 연계 모듈에도 자동으로 보고서 형태로 제공되어, 건축허 가 심사 과정에 영향을 줄 수 있다. 침해 분석 결과는 단순 시각화나 내부 알림에 그치지 않고, 행정기관의 도 시계획 시스템이나 법률 대응 모듈 등과의 연계를 위해 즉시 활용 가능한 데이터 형식으로 출력된다. 이러한 출 력 데이터는 JSON, XML 등 구조화된 형식을 기반으로 하며, 침해 유형, 발생 시간, 위치 정보, 침해율, 고의성 점수 등의 핵심 지표가 표준화된 형태로 포함된다. 이와 같이 정형화된 출력 결과는 각 기관의 시스템에 자동으 로 연동되어 실시간 정책 반영, 법률 검토, 또는 보상 실행의 기초 자료로 활용될 수 있도록 설계되며, 시스템 의 확장성과 상호운용성을 동시에 확보하는 중요한 역할을 수행한다. 표 9공간적 권리 침해 분석 결과의 JSON 출력 예시 { \"event_id\": \"OBS20250409-001\", \"location\": { \"lat\": 37.5665, \"lon\": 126.9780 }, \"object_type\": \"building\", \"height_m\": 50, \"shadow_length_m\": 55.6, \"shadow_azimuth_deg\": 130.45, \"shadow_time\": \"2025-06-21T10:00:00+09:00\", \"obstruction_type\": \"조망권 침해\", \"obstruction_angle_deg\": 18, \"obstruction_rate\": 0.3, \"judgment\": \"중대한 침해\", \"recommendation\": \"보상 또는 행정 제한 검토\" } 위 JSON 구조는 침해 감지부에서 수집된 데이터를 기반으로 생성된 침해 분석 결과를 표준화된 형식으로 구조화한 것으로, 법률 대응 모듈, 행정 연계 모듈, 스마트 계약 기반 보상 시스템에 동시에 전 달되어 후속 조치를 신속하고 자동화된 방식으로 처리할 수 있도록 한다. 법률 대응 모듈에서는 이를 기반 으로 침해 유형에 따라 유사 판례 검색 및 법률 리포트 생성을 자동으로 수행하며, 행정 연계 모듈은 반복 침해 지역 여부를 판단하여 보호구역 지정 또는 건축 허가 검토 등의 행정적 대응 절차를 자동 개시할 수 있다. 동시에 보상 시스템은 JSON 데이터 내 포함된 침해율, 고의성 점수, 체류 시간 등 정량적 지표를 활용하여 보상 기준을 산출하고, 스마트 계약을 통해 자동으로 금액 산정 및 보상 실행까지 이어지도록 구성된다. 이처럼 JSON 구조는 각 구성요소 간의 데이터 흐름을 일관되고 중복 없이 유지함으로써, 전체 시스템의 통합성과 자동 화 수준을 비약적으로 향상시키는 핵심 매개체로 기능한다. 데이터 구조화 및 전달 포맷 침해 감지부는 각 센서 및 감지 모듈로부터 수집된 정보를 표준화된 포맷(JSON, CSV, XML 등)으로 구조화 하여 후속 구성요소인 침해분석 및 법률대응모듈로 전송한다. 예시 구조는 다음과 같다; 표 10 공중 이동체 침해 행위 데이터의 구조화 예시(JSON 포맷) { \"object_id\": \"DRONE_0234\", \"lat\": 37.553, \"lon\": 127.037, \"altitude\": 52.3, \"dwell_time\": 14.6, \"pattern\": \"hover\", \"gaze_target\": \"window_A302\", \"obstruction_rate\": 0.26, \"timestamp\": \"2025-04-09T11:45:00\" } 위 구조는 단일 침해 상황에 대한 핵심 데이터를 포함하며, 이후 침해의 고의성 판단, 반복성 평가, 법률적 책 임 판단 등 후속 단계에 필요한 핵심 기반 자료로 활용된다. 침해 감지부는 일종의 공간적 CCTV와 블랙박스의 역할을 수행한다. 단순히 침입 여부를 기록하는 수준이 아니라, 법률 판단을 위한 증거를 정량적이고 구조적으로 수집하는 고도화된 시스템이다. 2. 침해 분석 및 법률 대응 모듈 침해 분석 및 법률 대응 모듈은 침해 감지부로부터 수신된 공간적 권리 침해 관련 데이터를 기반으로, 해당 침해의 법률적 성격을 정량적으로 분석하고, 자동으로 법률적 대응을 위한 정보를 생성하는 구 성요소이다. 본 모듈은 다음과 같은 주요 구성 요소를 포함한다. AI 기반 침해 분류 엔진 본 발명의 침해 분석 및 법률 대응 모듈에 포함되는 AI 기반 침해 분류 엔진은 공간 이동체 또는 고정 구 조물로 인한 공간적 권리(공중권, 조망권, 일조권, 사생활권) 침해를 자동으로 분류하고, 침해 행위의 성격 및 법률 대응 수준을 판단하기 위한 인공지능 알고리즘 기반의 분석 시스템이다. 이 엔진은 머신러닝 및 딥러닝 모 델을 활용하여 침해 패턴을 학습하고, 이를 통해 다음과 같은 주요 판단 요소를 자동으로 산출한다; 고의성 (intent), 반복성(recurrence), 시선 고정 체류 시간(dwell & gaze time), 공간 침투율(obstruction rate), 침 해 강도(severity) 등. 가. 학습 데이터 구조 및 구성 : 침해 분류 엔진은 실제 또는 시뮬레이션 데이터를 기반으로 훈련된 모델이며, 데이터는 아래와 같이 구조화된다; 표 11 조망권 침해 판단을 위한 드론 비행 시퀀스 및 시선 고정 분석 데이터 예시 { \"case_id\": \"CASE_20250409_001\", \"drone_id\": \"DRN0234\", \"lat_sequence\": [37.5530, 37.5530, 37.5531], \"lon_sequence\": [127.0370, 127.0371, 127.0371], \"altitude_sequence\": [52.3, 52.4, 52.5], \"dwell_time\": 58.3, \"gaze_target\": \"APT_701\", \"gaze_duration\": 31.7, \"repetition_count\": 3, \"obstruction_rate\": 0.27, \"actual_label\": \"조망권 침해\" } 상기 데이터셋은 실제 판례 정보를 기반으로 수집되며, 침해 유형별 정답 레이블이 포함되어 supervised learning이 가능하다. 나. 알고리즘 구조 및 모델 예시 : 다음과 같은 모델 구조가 적용된다; 침해 행위의 정밀한 분류와 예측을 위해 본 발명에서는 다양한 특성에 적합한 인공지능 모델 구조가 함께 적용된다. 먼저, LSTM(Long Short-Term Memory) 모델은 드론이나 공간 이동체의 위치, 고도, 속도 등의 시계열 데이터를 입력으로 받아, 시간의 흐름에 따른 이동 패턴을 학습함으로써 침해의 고의성이나 반복성과 같은 행동 양상을 동적으로 분석한다. 이어서, XGBoost 모델은 수집된 데이터로부터 정량화된 입력값들?예를 들어 침해 지속 시간, 침해율, 고의성 점수 등?을 바탕으로 침해 여부 및 중대성을 분류하며, 해당 결과를 기반으로 침해 등급을 세분화하는 데 효과적으로 작용 한다. 또한, CNN(Convolutional Neural Network) 구조는 영상 기반 정보의 해석을 담당하며, 특히 드론의 카메 라가 특정 방향을 장시간 주시하는 등의 시선 고정 이미지 패턴을 분석할 때 적용된다. 이 모델은 프레임 간 변 화가 거의 없는 정지 영상을 탐지하여, ‘시선 침해’와 같은 침해 유형을 정밀하게 분류하는 데 유용하게 활용 된다. 이러한 복합적 모델 구성은 침해 데이터를 다각도로 분석함으로써, 정밀하고 신뢰도 높은 법률 대응 판단 을 가능하게 한다. 표 12LSTM 기반 고의성 판단 모델의 예시 코드(TensorFlow) # 예시 코드: LSTM 기반 고의성 판단 모델 (TensorFlow) from tensorflow.keras.models import Sequential from tensorflow.keras.layers import LSTM, Dropout, Dense model = Sequential() model.add(LSTM(64, input_shape=(time_steps, features), return_sequences=True)) model.add(Dropout(0.2)) model.add(LSTM) model.add(Dense(1, activation='sigmoid')) # Output: 고의성 점수 model.compile(optimizer='adam', loss='binary_crossentropy') 다. 침해 판단 기준 및 정량화 방식 : 본 발명에서는 침해 행위의 법률적 판단 기준을 정량화하여 자동화 시스 템에 적용함으로써 일관된 분석이 가능하도록 구성된다. 우선, 고의성 판단 기준으로는 동일한 위도·경도 좌표 내에서(오차 범위 ±1.5m) 동일 객체가 세 차례 이상 정지 상태를 유지한 경우, 이를 ‘고의적 침해’로 간주하 며, 이때 시스템은 학습된 알고리즘에 따라 고의성 점수를 0.8 이상으로 자동 산출하도록 설계된다. 이어서, 중 대성 판단 기준은 해당 침해 행위가 조망권의 30% 이상을 차단하거나, 일조권 차단 시간이 하루 기준 2시간 이 상 지속된 경우와 같이, 공간적 권리의 본질적 기능을 현저히 저해한다고 판단되는 상황에서 적용되며, 이 경우 자동으로 중대한 침해로 분류된다. 마지막으로, 침해 유형 자동 분류 기능을 통해 시스템은 입력된 침해 데이터 를 기반으로 해당 행위를 ‘사생활권 침해’, ‘조망권 침해’, 또는 ‘일조권 침해’ 중 하나 또는 복수로 자 동 태깅하며, 이 분류 결과는 추후 생성되는 침해 리포트 및 법률 대응 모듈과 연동되어 후속 절차의 정밀성과 효율성을 높이도록 구성된다. 표 13 AI 기반 위험도 종합 점수 산출 방식 예시 # 종합 점수 계산 예시 intent_score = 0.85 recurrence_score = 0.72 obstruction_rate = 0.31 dwell_score = 0.91 risk_score = (intent_score * 0.4 + recurrence_score * 0.3 + obstruction_rate * 0.2 + dwell_score * 0.1) 이처럼 각 침해 항목별 정량 수치를 기반으로 최종 침해 위험도 점수를 도출하며, 이 점수는 법률 대응 우선순 위 또는 보상 기준 결정에 직접 반영된다. 라. 결과 출력 및 리포트 자동화 : 분석 결과는 다음과 같은 형식으로 리포트화된다: 표 14 AI 기반 침해 유형 분류 및 법률 대응 우선순위 산출 예시 { \"intent_score\": 0.87, \"recurrence_score\": 0.72, \"obstruction_rate\": 0.31, \"dwell_score\": 0.91, \"classified_violation\": [\"조망권 침해\", \"사생활권 침해\"], \"severity_level\": \"중대한 침해\", \"legal_response_priority\": \"상\" }해당 결과는 자동으로 PDF 보고서 및 JSON API 형태로 변환되어 침해 분석 및 법률 대응 모듈, 법률 DB 및 판례 추천 시스템, 스마트 계약 기반 보상 시스템, 행정/정책 연계 모듈에 전달되며, 리걸테크 기반의 자동화된 대응 체계를 실현한다. 본 발명은 기술적 차별성과 진보성을 다음과 같은 측면에서 확보하고 있다. 우선, 침해 여부 판단에 있어 기존 의 단순 규칙 기반 판단이 아니라, AI 학습 기반의 패턴 인식 및 분류 알고리즘을 적용함으로써 사람의 주관적 판단을 대체하고, 자동화된 고도 분석을 가능하게 한다는 점에서 기술적 고도화가 이루어졌다. 특히, 공중권 및 공간적 권리 침해 상황을 수치화하고 등급화할 수 있도록 설계하여, 객관적이고 정량화된 법률적 근거를 제공한 다. 또한, 시선 추적, 반복성, 체류 시간 등 복합적인 요소들을 통합 분석하여, 기존 시스템으로는 식별이 어려 운 고차원의 침해 패턴을 식별할 수 있는 기능을 구현하였다. 더 나아가, 이와 같이 수집되고 분석된 다양한 형 식의 데이터는 법률적으로 유효한 구조의 리포트로 자동 전환되며, 스마트 계약 기반의 보상 자동화 조건으로도 활용됨으로써, 기술 시스템과 법률 시스템, 행정 시스템 간의 유기적인 연계와 상호 작용이 가능하게 되는 구조 를 실현하였다. 이는 기존 기술에 비해 분쟁 대응의 정확성, 효율성, 예측 가능성을 획기적으로 향상시킨다는 점에서 진보성을 갖는다. 또한, 본 발명에서 활용되는 AI 침해 분류 모델은 다양한 성능 지표를 통해 체계적으로 검증되어 그 신뢰성을 확보하였다. 다음은 실제 침해 사례 1,000건을 기반으로 학습 및 테스트한 모델의 성능 평가 결과이다; 표 15"}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "AI 침해 분류 모델의 정량적 성능 평가 지표 요약 평가 지표 설명 성능 수치(예시) Accuracy 전체 예측 중 맞춘 비율 94.1% Precision 침해로 예측된 것 중 실제 침해 비율 91.7% Recall 실제 침해 중 올바르게 탐지된 비율 92.4% F1-score Precision과 Recall의 조화 평균 92.0% AUC-ROC 침해 여부 분류의 임계값 민감도 분석 0.967 성능 검증에는 5-fold cross-validation 기법을 적용하였으며, 침해 판단 알고리즘의 일반화 능력과 민감도를 함께 평가함으로써, 본 발명의 AI 엔진이 다양한 실제 상황에서 신뢰도 높은 예측을 수행할 수 있음을 입증하였 다. 마. AI 기반 위험도 스코어링 : AI는 침해 상황을 단순히 감지하고 분류하는 데 그치지 않고, 각 침해 행위에 대한 종합적 위험도를 산출한다. 위험도는 ‘고의성’, ‘반복성’, ‘피해 면적’, ‘예상 지속 시간’ 등을 종합하여 0.0~1.0 범위의 스코어로 수치화되며, 위험도 ≥ 0.8인 경우는 ‘법률적 대응 권장’, 위험도 ≥ 0.9 는 ‘보상 우선 조치 필요’로 분류된다. 이러한 등급화는 피해자와 행정기관의 대응 우선순위를 자동으로 설정 하는 데 활용된다. 법률 리포트 자동 생성기 법률 리포트 자동 생성기는 침해 분석 결과를 바탕으로, 법률 대응에 활용 가능한 구조화된 문서를 자동으로 생 성하는 모듈로서, 침해 감지 이후의 핵심적인 법적 절차를 지원하는 역할을 수행한다. 본 구성은 침해 데이터를 법률적 판단 요소로 전환하고, 각종 판례 정보 및 대응 권고까지 포함된 리포트를 자동으로 출력함으로써, 피해 자·행정기관·법률 대리인 등이 직접 법률적 문서를 작성하지 않더라도 즉시 활용 가능한 근거 자료를 제공할 수 있도록 설계된다. 본 자동 생성기는 AI 기반 침해 분류 엔진으로부터 제공된 분석 결과(침해 유형, 고 의성, 반복성, 피해 면적 등)를 입력으로 받아, 해당 침해에 대응하는 적법한 대응 방안을 정형화된 템플릿에 기반하여 자동 구성한다. 출력되는 리포트는 PDF, JSON, XML 등 다양한 포맷으로 변환 가능하며, 지자체 행정 시스템 및 소송 관리 시스템과 API 연계를 통해 자동으로 제출할 수 있도록 구성된다. 리포트에는 다음과 같은 항목이 자동으로 포함된다; 표 16공간적 권리 침해 리포트 자동 생성 항목 구성표 침해 주체: 감지된 객체 ID 및 소유자 정보 침해 위치: 위도/경도 좌표 및 주소 정보 침해 시간: 발생 시각, 지속 시간 침해 유형: 조망권 침해, 일조권 침해, 사생활권 침해 등 자동 태깅된 분류 침해 판단: 고의성 점수, 반복성 계수, 피해 면적 비율, 중대성 판단 결과 관련 판례 추천: 유사 유형의 국내외 판례, 행정 사례 번호, 위자료 산정 정보 대응 권고: 법적 경고장 송부, 행정 민원 접수, 민사소송 제기 여부 등 이러한 리포트는 실제 소송 시 ‘입증 책임’의 부담을 덜어주는 핵심 자료로 활용될 수 있으며, 표준화된 형식 으로 출력되기 때문에 법률 전문가나 행정 담당자의 빠른 이해 및 대응이 가능하도록 설계되었다. 표 17 AI 기반 공중권 침해 리포트 자동 출력 포맷 예시(PDF 구조) ───────────────────────────────────────── [공중권 침해 리포트] ───────────────────────────────────────── ■ 침해 주체: DRONE_0234 ■ 침해 위치: 서울시 강남구 A아파트 701호 상공 ■ 침해 시간: 2025.04.09 11:45~11:59 ■ 침해 유형: 고의성 있음 / 반복성 있음 / 시선 정지 감지 ■ 침해된 권리: 조망권, 사생활권 ■ 정량 분석 지표: - 고의성 점수: 0.85 - 반복성 계수: 0.7 - 피해 면적: 25% - 조망권 차단각: 45도 - 일조권 차단 시간: 1.8시간 ■ 관련 판례: - 서울고등법원 2021나89324 - 대법원 2019다34761 - 법리 요지: 반복적 드론 비행에 의한 조망권 침해에 대한 위자료 인정 ■ 대응 권고: - 민사상 손해배상 청구 가능 - 사전 경고장 자동 송부 - 관할 지자체 행정 민원 연계: YES ■ 리포트 생성일시: 2025.04.09 12:00:02 ■ 자동 생성 모듈: 법률 리포트 자동 생성기 v2.3 ───────────────────────────────────────── 해당 리포트는 침해 감지 후 수 분 내에 자동으로 생성되며, API를 통해 피해자 모바일 앱, 법률 대리인 플랫폼, 지자체 클라우드 시스템 등에 자동 전달될 수 있다. 또한, 소송 시 법원 제출용으로 활용될 수 있도록 법원 양식과 호환되는 구조로 설계되어 있으며, 증거로서의 법적 효력을 고려하여 자동 해시값 서명 또는 디지 털 서명이 추가되는 형태도 구현 가능하다. 법적 증거 자동 생성기 침해 분석 결과는 단순 수치 분석을 넘어서, 법적 효력을 갖는 증거 문서로 자동 변환될 수 있도록 구성된다. 예를 들어, 각 침해 사건마다 JSON 기반의 디지털 증거 해시값을 생성하고, 이를 블록체인 상에 timestamp와 함 께 기록하여 위변조가 불가능한 형태로 보존한다. 이때 침해 시점, 위치, 객체 식별 정보(ID), 분석 결과 및 판 례 매칭 내역까지 포함된 전자증거 문서가 자동으로 생성된다. 이는 소송 또는 행정 대응 시, 법원이나 관할 기 관에 제출 가능한 자료로 활용될 수 있다. 3. 스마트 계약 기반 보상 시스템 스마트 계약 기반 보상 시스템은 감지된 침해 데이터와 그 분석 결과를 바탕으로, 피해자에 대한 보상 절 차를 블록체인 상에서 자동으로 수행하는 자동화 보상 모듈이다. 이 시스템은 수작업 없는 보상 집행을 통해 공 정성과 신속성을 보장하며, 분쟁 예방 및 책임 추적 기능까지 포함한다. 해당 시스템은 일련의 자동화된 절차를 통해 보상 처리를 수행하며, 그 구성은 다음과 같은 다섯 단계로 이어진 다. 먼저, 침해 감지 단계에서는 침해 감지부와 침해분석 및 법률대응모듈로부터 전달된 정량화된 침 해 정보를 수신하여, 해당 사건의 구체적인 침해 특성을 파악한다. 이어지는 침해 등급 분류 단계에서는 감지된 침해 정보 중 고의성, 반복성, 침해 면적 비율 등의 요소를 기준으로 침해의 심각도를 분석하고 등급화함으로써 보상 수준의 기초 데이터를 마련한다. 세 번째 단계인 보상 기준 산정 과정에서는 이전 단계에서 분류된 침해 등급을 바탕으로 보상 산출 함수를 적용하여, 피해 보상액을 정량적으로 산출하며, 이는 피해 규모에 대한 공정 한 금전적 환산 기준으로 작용한다. 네 번째 단계에서는 해당 보상 기준이 사전에 설정된 조건을 만족할 경우, 스마트 계약이 블록체인 상에서 자동으로 실행되며, 그 결과로 가해자 지갑에서 피해자 지갑으로 보상 금액이 무인 개입 없이 전송된다. 마지막으로, 결과 기록 및 보고 단계에서는 전체 보상 처리 과정이 블록체인 원장에 불가역적으로 기록되고, 그 기록은 법률 대응 모듈 및 행정기관 연계 모듈과 실시간으로 연계되어, 관련 기관에 자동 보고되거나 정책 판단의 근거로 활용될 수 있도록 한다. 보상 기준 산출 함수 보상은 침해 강도를 종합적으로 반영하기 위해, 면적 비율, 체류 시간, 반복성 점수를 기반으로 가중치를 부여 하여 계산된다. 내부적으로 다음과 같은 보상 산출 함수가 활용될 수 있다; 표 18 스마트 계약 기반 보상 금액 산출 함수 예시(Python 코드) def calculate_compensation(invasion_ratio, dwell_time, repeat_score): base_price = 1_000_000 # 기본 보상 단가 (예: 100만 원) weight = (invasion_ratio * 1.5 + dwell_time * 0.2 + repeat_score * 2.0) return base_price * weight 예를 들어, 침해 면적이 30%(0.3), 체류 시간이 6분, 반복성 점수가 0.9인 경우, 보상액은 다음과 같이 계산된 다; 표 19 스마트 계약 보상 금액 산출 수식 예시 및 결과 계산 weight = (0.3 * 1.5) + (6 * 0.2) + (0.9 * 2.0) = 0.45 + 1.2 + 1.8 = 3.45 보상액 = 1,000,000 × 3.45 = 3,450,000원 이와 같은 계산 방식은 침해가 경미한 경우 보상이 낮고, 반복성 및 고의성이 높을수록 보상 수준이 높아지도록 설계되어, 피해 수준에 비례한 정량적 보상이 가능하다. 스마트 계약 구조 및 구현 예시 스마트 계약은 Ethereum, Hyperledger Fabric, Polygon 등 다양한 블록체인 플랫폼 상에서 Solidity 또는 Chaincode 등으로 구현될 수 있으며, 다음과 같은 조건문 구조를 내포한다; 표 20스마트 계약 기반 보상 트리거 조건문 예시 if (invasion_score >= threshold) { triggerCompensation(offender_wallet, victim_wallet, calculatedAmount); } 여기서 invasion_score는 침해분석 및 법률대응모듈로부터 전달된 통합 침해 점수이며, threshold는 사전 에 정책적으로 설정된 보상 기준값이다. 보상 트리거가 발동되면, 시스템은 사전에 정의된 조건에 따라 일련의 자동화 절차를 순차적으로 실행하게 된다. 먼저, 가해자의 디지털 지갑에서 피해자의 지갑으로 사전에 산정된 보상 금액이 자동으로 이체되며, 이 과정은 스마트 계약의 실행을 통해 중개자 없이 블록체인 상에서 신속하고 투명하게 수행된다. 이어서, 해당 보상 계약의 해시값과 실행 결과는 블록체인 원장에 불가역적으로 기록되어 향후 법적 분쟁이나 회계 검증 시 신뢰 가능한 증거로 활용될 수 있다. 보상 내역은 피해자와 가해자 양측에게 동시에 통지되며, 동시에 관련 행정기관 시스템에도 자동으로 보고되어, 공공기록으로서의 역할을 수행하게 된 다. 더불어, 동일 객체가 향후 반복적으로 침해 행위를 할 경우, 시스템은 과거의 보상 이력 및 침해 기록을 자 동으로 참조하여 누적된 침해 여부를 판단하고, 이에 따라 가중된 법적 책임이나 추가적인 조치를 유도할 수 있 도록 설계되어 있다. 예외 조건 및 분쟁 방지 조항 스마트 계약은 단순한 송금 기능에 국한되지 않고, 실제 법률적 분쟁 상황에서의 효력을 고려하여 보다 정교하 고 복합적인 분쟁 방지 로직을 내장할 수 있다. 우선, 피해자 인증 프로세스를 통해 보상 실행 전에 피해자의 신원을 전자적으로 검증하는 절차가 포함될 수 있으며, 이를 통해 부정 청구나 위조된 침해 리포트를 사전에 차 단할 수 있다. 또한, 계약 실행 직후 일정 기간 동안 이의 제기를 허용하는 조건부 대기 상태를 설정함으로써, 보상 당사자 간의 분쟁 발생 시 중재나 심사를 받을 수 있는 기회를 제공하게 된다. 더불어, 시스템은 동일 드 론 또는 특정 비행체가 반복적으로 침해를 유발한 이력이 축적되면, 해당 이력을 바탕으로 자동으로 가중 처벌 또는 추가 페널티를 부여할 수 있는 구조로 설계될 수 있다. 마지막으로, 보상 실행이 공공성과 밀접하게 관련 된 사안일 경우, 행정기관의 승인을 연동하여 특정 조건이 만족되었을 때에만 스마트 계약이 발효되도록 제어함 으로써, 공공 기록과 행정 절차 간의 정합성을 유지할 수 있다. 이러한 로직들은 단순 자동화를 넘어 실질적인 법적 정당성과 공공 신뢰성을 동시에 확보할 수 있도록 본 발명의 보상 시스템을 고도화하는 핵심 요소로 작용 한다. 이와 같이 구성된 스마트 계약 기반 보상 시스템은, 공간적 권리 침해에 대한 보상 처리를 사람의 개입 없이 자 동화하고, 침해 수준의 정량적 판단과 보상 절차의 법적·행정적 연계를 동시에 실현할 수 있다. 이를 통해 공 중권 및 공간적 권리에 대한 권리 보호가 실시간으로 이루어지며, 법률 대응 및 정책 대응의 효율성 또한 획기 적으로 향상된다. 예외 보상 로직 및 예외 처리 조건 스마트 계약 시스템은 일반 보상 조건 외에도 예외 상황에 따른 분기 처리 로직을 포함한다. 예를 들어, 피해자 가 보상을 원하지 않거나, 특정 보상 기준이 법률상 인정되지 않는 경우(예: 미등기 불법 건축물 침해), 보상 조건이 자동으로 무효화되도록 설계할 수 있다. 또한, 공공기관 또는 재난 대응 비행체의 비상 침투에 대해서는 자동 면책 처리가 가능하며, 이러한 예외 처리는 스마트 계약 조건 내에 명시적으로 정의된다. 4. 법률 DB 및 판례 추천 시스템 법률 DB 및 판례 추천 시스템은 침해 분석 결과 및 보상 판단 정보를 기반으로 하여, 침해 행위와 법률적 으로 유사한 사례를 자동으로 탐색하고, 관련 법리 및 판례 정보를 정제된 보고서 형식으로 제공하는 기능을 수 행한다. 본 시스템은 다음과 같은 목적을 달성한다: 첫째, 침해 유형에 대한 법적 선례 및 보상 기준을 제공함 으로써 피해자의 법률적 대응 근거를 강화하고, 둘째, 유사 사건에 대한 판례 정보를 비교 분석하여 분쟁 시 조 정 가능성을 높이며, 셋째, 행정기관과 법률 전문가(로펌 등)에게 정책 설계 및 법률 해석 근거를 제공한다. 이 러한 기능을 수행하기 위해, 본 시스템은 다음과 같은 세부 모듈로 구성된다; 법률 조건 기반 필터링 엔진 이 모듈은 침해분석 및 법률 대응 모듈에서 전달된 구조화된 데이터를 바탕으로, 다중 조건 필터링을 수행 한다. 침해 유형(예: 조망권, 일조권, 사생활권), 침해 비율(예: 30% 이상), 침해 지속 시간(예: 5분 초과), 고의성 점수(예: 0.7 이상) 등 정량화된 기준을 기반으로 조건 검색을 수행하며, 해당 조건을 만족하는 판례만을 대상으로 데이터베이스 질의를 수행한다. 표 21 보상 조건 산출용 침해 정량 데이터 예시 { \"right_type\": \"조망권\", \"invasion_rate\": 0.32, \"dwell_time\": 6.4, \"intent_score\": 0.81 } 이처럼 입력된 조건을 기준으로 자동 검색 알고리즘이 발동되며, 각 판례의 사건 메타데이터(사건번호, 결정기 관, 연도, 결과 등)와의 일치 여부를 다각도로 평가한다. 유사 판례 자동 추천 알고리즘 다중 필드 유사도 평가 알고리즘(Multi-Feature Similarity Matching Algorithm)을 기반으로 작동한다. 각 침 해 사례의 정량화된 요소들과 판례 DB 내 등록된 과거 사건 데이터를 벡터화한 후, 코사인 유사도(cosine similarity), 유클리디안 거리 등 수치 기반 유사도 계산을 통해 매칭 점수를 산출한다. 예를 들어, 특정 침해 사건이 조망권 침해에 해당하고, 침해 비율이 30% 이상이며, 체류 시간이 5분을 초과하고, 고의성 점수가 0.8 이상으로 평가된 경우, 시스템은 이러한 조건에 부합하는 판례를 자동으로 탐색하여 추천하게 되며, 그 결과로 “서울중앙지방법원 2019가단13729” 사건과 같이 반복적인 드론 침입과 고정 체류로 인해 조망권 침해가 인정 되어 위자료 300만 원 지급이 명령된 판례가 제시될 수 있다; 표 22 유사 판례 자동 추천 결과 예시 { \"case_id\": \"서울중앙지법 2019가단13729\", \"issue\": \"조망권 침해에 따른 정신적 손해\", \"result\": \"위자료 300만 원 지급 판결\", \"precedent_summary\": \"드론의 반복적 침입 및 고정 체류가 고의적 조망권 침해로 판단됨\" } 해당 추천 알고리즘은 일정 유사도 임계값(예: 0.85 이상)을 넘는 경우에만 최종 리스트에 포함시킴으로써, 불 필요한 결과 노출을 방지하고 법률적 정확도를 높인다."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "판례 요약 및 결과 요약 생성기"}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "추천된 판례에 대해서는 사건 요약기와 법리 요약기가 작동하여 다음과 같은 형식의 정리된 보고서를 생성한다. 해당 보고서는 PDF, HTML, JSON 포맷으로 출력 가능하며, 사용자의 목적(소송, 경고, 사전 조정 등)에 따라 커 스터마이징할 수 있다. 표 23유사 판례 기반 자동 보고서 출력 예시 사건번호: 서울중앙지방법원 2019가단13729 침해 유형: 조망권 침해 비율: 32% 고의성 판단: 있음 (score = 0.81) 주요 쟁점: 반복된 저고도 비행으로 인한 정신적 손해 결과: 위자료 300만 원 지급 명령 적용 법리: 주거 프라이버시 침해는 민사상 손해배상의 대상이 되며, 일정 기간 반복되고 고의성이 높 은 경우 가중 판단 가능 시스템 확장 및 정책 연계 해당 시스템은 외부 판례 데이터베이스(예: 대법원 판례 검색 API, 지자체 행정결정 데이터베이스 등)와의 연동 이 가능하도록 설계된다. 데이터 연동 시, 신규 판례가 등록되면 머신러닝 기반 판례 분류기가 자동 학습하며, 침해 유형별 판례 분류 정확도를 지속적으로 개선한다. 또한, 행정기관의 도시계획 시스템, 건축 허가 플랫폼 등과 API 연계를 통해 침해 이력 및 판례 정보를 직접 전달함으로써, 정책 설계 및 공공 규제 수립에도 활용될 수 있다. 법률 대응 전략 수립 지원 본 발명의 판례 추천 시스템은 피해자, 변호사, 로펌 등 사용자에게 적합한 리포트를 제공함으로써, 민사소송 또는 행정조정 과정에서의 논리적 근거를 제공하고, 침해가 실제로 발생했음을 증명할 수 있는 정량적·법리적 자료를 자동으로 생성한다. 이로써 기존 법률 대응의 시간과 비용을 획기적으로 절감하며, 분쟁 예방 및 사전 조정 기능까지 포함한 고도화된 리걸테크 시스템을 실현하게 된다. 5. 행정/정책 연계 모듈 행정/정책 연계 모듈은 침해 감지 및 분석 결과를 바탕으로 행정기관과의 실시간 연계, 보호구역 지정 요 청, 정책 보고 자동 생성 등의 기능을 수행하여, 단순한 침해 대응을 넘어 제도적 개입과 예방 조치까지 지원하 는 핵심 구성요소이다. 이 모듈은 특히 지방자치단체의 도시계획, 건축 허가, 드론 운항 규제 등과 직접 연결되 어, 공중권 및 공간적 권리 보호의 실질적 제도화에 기여한다. 다음과 같은 세부 기능으로 구성된다; 반복 침해 지역 자동 탐색 및 보호구역 지정 요청 시스템은 일정 기간 동안 동일 위치 또는 일정 반경 내에서 반복적으로 침해가 발생하는 경우, 해당 지역을 ‘ 공중권 보호구역’ 후보로 지정할 수 있도록 자동 판단한다. 예를 들어, 30일 이내 동일 좌표 기준 ±3m 범위 내에서 5회 이상의 침해가 발생하고, 이들 사건의 평균 고의성 점수가 0.75 이상이며, 평균 피해 면적이 20%를 초과할 경우, 해당 지역은 시스템에 의해 ‘경고 지역’으로 자동 분류된다. 그 결과, 시스템은 해당 침해 지역 의 위치 정보, 침해 유형 분포, 반복성과 고의성 지표, 예측 침해 위험도를 포함한 데이터를 자동 분석하여, 보 호구역 지정 요청 보고서를 생성하고 이를 지방자치단체 도시계획 부서 또는 국토교통부와 같은 행정기관에 자 동 전송한다. 보고서는 PDF 포맷 외에도 행정 시스템과 연계가 가능한 JSON, XML 포맷으로도 자동 변환되며, 스 마트 도시계획 플랫폼과의 연동도 고려된다. 이러한 기능은 침해가 빈발하는 지역에 대한 조기 탐지와 선제적 제도 개입을 가능하게 한다. 지자체 자동 보고 시스템 본 시스템은 침해 감지 결과 및 AI 분석 정보를 바탕으로 실시간 자동 보고서를 생성하여 해당 지자체의 행정 포털 또는 정책 시스템에 직접 연동되는 형태로 제공한다. 보고서에는 다음과 같은 내용이 포함된다; 표 24 행정기관 제출용 자동 보고서 구성 항목 예시 침해 발생 위치 및 발생 시간대의 히트맵 침해 유형별 분류 통계 (예: 드론 침입 vs 건물 그림자) 침해 주체의 식별 정보(ID, 소유자, 등록 정보 등) 고의성, 반복성, 피해 면적, 예상 지속성에 대한 종합 분석 보호구역 지정 여부 판단 결과 및 경고 알림보고서는 정책 담당자의 검토가 용이하도록 시각적 차트, 레이더 그래프, 시계열 분석 등 시각화 요소를 포함하 며, 자동 이메일 송신, 행정포털 연동 API 등을 통해 배포된다. 특히, 보고서 내의 침해 트렌드는 향후 도시계 획 및 지역 개발 시 중요한 참고 자료로 활용될 수 있다. 건축 허가 심사 시 정책 데이터 제공 해당 모듈은 건축 허가 신청이 접수된 경우, 해당 부지가 과거 공간권 침해의 이력이 있는지 여부를 자동으로 조회하여, 심사자에게 경고 메시지 또는 설계 보완 요청을 제공한다. 예를 들어, 이전에 같은 구역에서 일조권 침해 민원이 다수 발생한 경우, 허가 신청 시스템은 해당 정보를 기반으로 “침해 이력 있음” 알림을 출력하며, 침해 예측 시스템을 통해 조망권 차단률, 그림자 범위 등을 시뮬레이션하여 설계 가이드라인을 제시 할 수 있다. 또한, 시스템은 도시계획 및 건축 허가 심사 과정에서 공간적 권리를 효과적으로 반영할 수 있도록 다음과 같은 정량적 기준을 제안할 수 있다. 예를 들어, 조망 차단률이 40%를 초과하는 경우에는 설계 변경을 권고하며, 일조권 침해 지속 시간이 하루 2시간 이상으로 예상될 경우에는 자동으로 심사 보류 절차를 트리거한 다. 또한, 신청된 위치가 이미 보호구역으로 지정된 지역에 포함되어 있을 경우에는 별도의 보완 검토 요청이 자동으로 생성되어, 행정기관의 심사 시스템에 연동된다. 이러한 기능은 도시계획 수립 초기 단계에서부터 공간 적 권리에 대한 고려를 가능하게 하며, 추후 발생할 수 있는 조망권, 일조권, 공중권 관련 분쟁을 사전에 예방 하고, 보다 공정하고 지속 가능한 도시개발을 유도하는 제도적 기반을 제공한다. 행정/정책 연계 모듈은 단순한 기술 시스템이 아니라, 본 발명이 제안하는 전체 공간 권리 보호 체계의 법 적·행정적 실현 장치에 해당한다. 침해를 감지하고 분석하는 단계에서 멈추지 않고, 그 결과를 근거로 실질적 인 제도적 조치를 자동화하는 이 모듈은, 리걸테크(LegalTech)와 어반테크(UrbanTech)의 융합 사례로서 도시 공 간 정의 실현과 공공 정책의 스마트화를 동시에 실현하는 구조로 설계되었다. 행정기관 및 법률 API 연계 구조 행정/정책 연계 모듈은 외부 시스템과의 통합을 위해 RESTful API 구조로 설계된다. 예를 들어, /policy/report/submit와 같은 경로로 행정기관 시스템에 침해 리포트를 제출하거나, /legal/precedent/query 를 통해 중앙법령정보시스템과 연동하여 실시간 법령 검색이 가능하다. 이러한 구조는 JSON 및 XML 포맷을 지원 하며, TLS 기반 암호화 및 OAuth 인증 방식을 채택하여 보안성도 확보된다."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "다음은 청구항별 실시예 요약 및 구체적인 실시예이다; 표 25"}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "청구항별 실시예 요약 및 적용 시나리오 정리표 청구항 번"}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "호청구항 요지 구체적 실시예 요약 1항 분쟁 해결 시스템 전체 서울 A아파트 상공 드론 침해 감지 → 보상 45% 자동 산정 및 리포트 발송 2항 AI 기반 침해 분석 모듈3일 반복 침해 → AI가 고의성 자동 판단 및 고의성 점수 부 여 3항 스마트 계약 기반 보상 시스 템조망권 침해 25% 감지 → 스마트 계약 발동, 자동 보상 전송 4항 법률 판례 추천 및 대응 침해 유형 판별 후 서울고법 유사 판례 자동 추천 및 리포트 생성 5항 행정기관 연계 및 자동 보고1개월 내 8건 침해 → 보호구역 후보 지정 및 행정기관 자동 보고 6항 법률 대응 자동화 방법 센서 감지 → AI 판단 → 보상 산출 → 스마트 계약 실행 → 법률 리포트 생성 → 행정기관 연계 실 시 예 1 청구항 1에 따른 구성은 다음과 같이 구체적으로 구현된다. 서울시 강남구 A아파트 상공에서 드론이 저고도(40m 이하)로 약 6분간 머무르며 특정 창문 방향으로 회전 및 정지 상태를 반복하였다. 침해 감지부는 드론의 GPS 기반 위치 정보, 고도, 방향, 체류 시간을 실시간으로 수집하였으며, 내장된 침해 판단 알고리즘은 “일정시간(예: 5분 이상) 고도 유지 + 특정 방향 고정 상태”를 침해 가능성 조건으로 인식하였다. 이에 따라 침해 감지 이벤트가 트리거되었고, 감지된 데이터는 침해 분석 및 법률 대응 모듈로 전달되었다. 침해 분석 모듈은 해당 침해를 “의도적 조망권 침해”로 판단하였으며, 고의성 점수를 0.8로 산출하였다. 이어 서 보상 기준 산정 절차가 실행되어, 침해 면적 약 25%, dwell time 6분, 고의성 점수 0.8 등을 고려한 결과, 기준 보상액(1,000,000원)의 45%에 해당하는 보상금이 산정되었다. 스마트 계약 기반 보상 시스템은 이 조 건에 따라 자동으로 보상 계약을 실행하였고, 보상 금액은 피해자의 디지털 지갑 주소로 자동 이체되었다. 최종적으로, 법률 DB 및 판례 추천 시스템은 해당 침해 유형과 유사한 판례(예: “서울고등법원 2021나"}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "89324”)를 자동으로 매칭하였으며, 판례 요약 및 적용 법리 내용이 포함된 리포트가 자동 생성되어 피해자에게 PDF 형식으로 송부되었다. 보고서에는 드론의 ID, 침해 시간대, 침해 위치, 침해 유형(조망권 침해), 침해 정도 및 관련 판례 정보가 구조화된 데이터와 함께 포함되어, 향후 소송 또는 분쟁 조정 시 법적 증거 자료로 활용될 수 있도록 구성되었다. 실 시 예 2 청구항 2에 따른 구성은 반복적인 침해 패턴을 인공지능 기반으로 분석하는 기능에 관한 것이다. 서울시 내 B지 역 상공에서 특정 드론(ID: DRONE_0234)이 3일 연속으로 동일한 좌표(위도/경도 오차 범위 ±1.5m 이내)에서 일 정 시간 동안 체류하였다. 침해 감지부는 각 날짜별로 드론의 위치, 고도, 체류 시간, 방향 등을 실시간으 로 수집하였고, 그 결과는 침해 분석 및 법률 대응 모듈로 전송되었다. AI 기반 침해 분석 엔진은 입력된 데이터를 분석하여 드론이 특정 위치에 고의적으로 반복 접근하고 있으며, 동일 시간대(오전 9:00) 및 유사한 체류 패턴(약 56분 정지)을 보이고 있다는 점에서 ‘의도적 침해’의 가능성이 높다고 판단하였다. 시스템은 반 복성 계수(예: 0.78), 시간 간격의 규칙성, 체류 위치 간 유사도(95% 이상)를 종합적으로 평가하여, 최종 고의 성 점수를 0.85로 자동 산정하였다. 이러한 고의성 판단 결과는 스마트 계약 기반 보상 시스템에 반영되어, 반복적 침해 가중치를 적용한 보상 금 산정이 수행되었으며, 예를 들어 기준 보상가의 60%에 해당하는 금액이 자동으로 산출되어 피해자의 지갑 주 소로 송금되었다. 또한, 법률 DB 및 판례 추천 시스템은 반복 침해 사례에 해당하는 유사 판례를 자동 검 색하였고, ‘반복적 무인기 침해에 대한 손해배상 판례’(예: 서울동부지방법원 2020가단11233)를 추천하였다. 생성된 리포트에는 반복 침해 정황, 침해 시간표, 체류 위치 좌표, 관련 판례 및 권고 대응 문구가 포함되어 있 다. 행정/정책 연계 모듈은 본 반복 침해 데이터를 누적 분석하여 해당 지역을 ‘공중권 보호구역 후보’로 자 동 분류하고, 지방자치단체 도시계획부서로 해당 사실을 포함한 보고서를 자동 제출하였다. 보고서에는 반복성 지표, 침해 유형 빈도, 고의성 점수의 평균치 등이 함께 포함되어 향후 건축 허가나 드론 비행 허가 시 자동 경 고 요소로 반영되도록 연계되었다. 실 시 예 3 청구항 3에 따른 구성은 침해 판단 결과를 바탕으로 자동으로 보상 절차를 수행하는 스마트 계약 기반 보상 시 스템의 작동 사례에 관한 것이다. 본 사례에서, C지역의 고층 아파트 옥상에 설치된 감시 시스템은 인근 신축 건물에 의해 조망권이 부분적으로 침해되었음을 감지하였다. 침해 감지부는 3D 시뮬레이션을 통해 조망 차 단 각도를 분석한 결과, 거주자가 확보하고 있던 기존 시야각 대비 약 25%의 시야가 새로운 구조물에 의해 차단 되었음을 확인하였다. 이 분석 결과는 침해 분석 및 법률 대응 모듈에 전달되었고, 시스템은 해당 침해 유 형을 “조망권 침해”로 분류하였다. 동시에, 드론 등 이동체가 아닌 고정 구조물에 의한 침해로서 고의성 점수 는 설계 패턴과 허가 이력 등을 분석한 결과 0.75로 산정되었다. 이와 같은 조건을 바탕으로, 스마트 계약 기반 보상 시스템은 사전에 정의된 조건문을 기준으로 자동 실행 절차를 개시하였다. 사용된 Ethereum 기반의 스마트 계약은 아래와 같은 논리를 포함하고 있다; 표 26 스마트 계약 트리거 조건문 예시 if (obstructionRate >= 0.2 && intentScore >= 0.7) { executeCompensation(victimWallet, calculatedAmount); }해당 계약은 조망권 침해율이 20% 이상이고, 고의성 점수가 0.7 이상일 경우 자동으로 발동되며, 피해자의 지갑 주소로 정량화된 보상 금액이 송금된다. 보상금은 기본 보상가(예: 1,000,000원)에 침해율 및 고의성 점수를 가 중한 내부 산출식을 통해 계산되었으며, 이 건에서는 약 45만 원이 자동 지급되었다. 계약의 실행 결과는 즉시 블록체인 원장에 불가역적으로 기록되며, 해당 스마트 계약의 해시값, 실행 시간, 송금 내역, 대상 지갑 주소 등의 메타데이터도 함께 저장되었다. 이 기록은 추후 분쟁이 발생하거나 반복 침해 여부를 판단할 때 법적 근거 로 활용 가능하도록 설계되었다. 추가로, 시스템은 이 보상 계약 실행 결과를 피해자와 가해자에게 자동 전송하는 동시에, 행정기관(예: 시청 도 시계획과)에 관련 데이터를 PDF 보고서 및 JSON 형식 데이터로 자동 송부하였다. 보고서에는 침해의 위치, 침해"}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "율, 보상 산출 근거, 실행된 스마트 계약 코드 요약 등이 포함되어 있으며, 향후 유사한 사례에 대한 행정 기준 수립에 참고 자료로 활용된다. 스마트 계약은 단순한 송금 기능을 넘어, 실제 분쟁 상황에서의 정당성과 신뢰성을 확보하기 위해 보다 정교한 예외 처리 로직을 함께 포함한다. 우선, 보상 절차가 시작되기 전에는 피해자의 신원을 확인하는 인증 절차가 실행되어, 보상 수령의 적법성이 검증된다. 그 후 일정 기간 동안 이의 제기를 할 수 있도록 유예 기간을 설정 하여, 가해자 측의 소명 또는 행정기관의 판단이 반영될 수 있는 기회를 제공한다. 또한, 동일 위치 또는 유사 조건에서 반복적인 침해가 발생한 이력이 확인될 경우에는 누적 가중치를 적용함으로써 보상의 강도와 대응 수 위를 조정할 수 있도록 하였다. 특히 일정 기준 이상의 침해일 경우, 해당 스마트 계약의 실행은 행정기관의 사 전 승인 절차와 연계되며, 이 승인이 완료될 때까지 계약 실행이 자동으로 보류되고 후속 확인 단계가 진행된다. 이러한 다층적 조건과 절차를 통해, 본 발명의 보상 프로세스는 법적?행정적 정당성을 확보하면서도 전체적인 처리 과정을 자동화하고, 신속한 피해 복구와 분쟁 예방이라는 실질적인 효과를 동시에 실현할 수 있 도록 설계되었다. 실 시 예 4 청구항 4에 따른 구성에서, 침해 분석 결과는 조망권 침해율이 35% 이상이며 동일 위치에서 반복적 체류 행위가 3회 이상 감지되어, 고의성 점수가 0.82로 산정되었다. 이에 따라 침해 분석 및 법률 대응 모듈은 해당 침 해 상황을 “중대한 조망권 침해 및 고의성 있음”으로 자동 판별하였고, 그에 따른 법률 대응 절차를 즉시 개 시하였다. 시스템은 침해의 주요 속성인 ‘조망권 침해’, ‘반복성 있음’, ‘주간 시간대 발생’, ‘고층 구 조물 신축’ 등의 조건을 기준으로, 내장된 법률 판례 데이터베이스를 탐색하였으며, 서울고등법원 2021나 89324 사건이 높은 유사도 점수(0.91)를 기록하며 자동으로 매칭되었다. 해당 사건은 유사한 고의성 침해 상황 에서 300만 원의 위자료 지급이 명령된 판례로, 본 시스템은 그 판결의 요지, 적용 법리, 위자료 기준, 판결일, 사건번호 등의 핵심 정보를 포함한 리포트를 PDF 형식으로 자동 생성하였다. 생성된 리포트는 피해자 측에 즉시 전송되며, 추후 소송 절차 진행 시 법원에 제출할 수 있도록 법률 서식에 맞 춰 자동 포맷팅되어 있다. 특히 이 리포트는 변호사 시스템과의 API 연계를 통해, 법률 대리인이 직접 수정?첨 부할 수 있는 구조로 설계되어 있으며, 관련 판례와 법리를 한 눈에 파악할 수 있도록 시각적 도표 및 법령 비 교표도 함께 포함된다. 또한, 이 리포트는 피해자의 법률 대응 전략 수립에 실질적 도움을 줄 수 있도록 침해 개요, 판례 비교, 손해 추정, 소송 절차 가이드 등으로 구성되어, 실질적인 소송 준비 문서로 활용이 가능하다. 실 시 예 5 청구항 5에 따른 구성으로, 본 시스템은 서울시 마포구 B구역(위도 37.558, 경도 126.923 부근)에서 30일 이내 총 8건의 공중권 및 조망권 침해 사례가 반복적으로 발생한 사실을 자동 감지하였다. 해당 침해 사례들은 동일 한 드론 기체 ID를 중심으로 발생하였으며, 대부분 주거지역 상공 50m 이내에서 5분 이상 체류하며 창문 방향으 로 카메라 고정이 관측되었다. 침해 감지부와 침해분석 및 법률대응모듈은 수집된 데이터를 기반으로 침해의 빈도, 고의성 점수 평균(0.78), 피해 면적 평균(22.4%), 반복성 계수(0.84)를 계산하였으며, 이에 따라 해당 지역을 ‘공중권 보호구역 후보’로 자동 지정하였다. 이 판단은 시스템 내에 정의된 보호구역 지정 조 건?① 동일 좌표(±3m) 내 30일간 5건 이상 침해, ② 고의성 점수 평균 ≥ 0.75, ③ 피해면적 ≥ 20%?을 충족한 결과이다. 이후, 행정/정책 연계 모듈은 보호구역 지정 요청 데이터를 자동으로 생성하였으며, 해당 데이터는 서울시 도시계획 부서의 시스템과 연계된 API를 통해 실시간으로 전송되었다. 이 과정에서 시스템은 침해 감지 및 분석결과를 기반으로 표준화된 보고서를 자동 작성하였으며, 해당 보고서는 침해 발생 위치와 시간대별 침해 빈도를 시각화한 그래프, 침해 유형별 분류 통계(예: 조망권 침해 6건, 일조권 침해 2건), 고의성 및 반복성 점수의 평 균값과 분산, AI 기반의 침해 지속 가능성 예측 결과(향후 60일 이내 추가 침해 발생 확률 87%) 등을 포함한다."}
{"patent_id": "10-2025-0046097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "아울러, 보고서에는 해당 지역을 보호구역으로 지정할 필요성과 제안 이유에 대한 요약 분석도 함께 포함되어, 행정기관이 이를 도시계획 및 규제 정책 수립에 직접 활용할 수 있도록 설계되었다. 이 보고서는 PDF 및 JSON 형식으로 자동 출력되며, 도시계획 데이터베이스에 자동 업로드되어 향후 해당 지역에 대한 건축 허가 심사 시 자동 참조된다. 또한, 자동 생성된 경고 메시지는 해당 지역 내 부동산 개발업체 및 드 론 등록 사용자에게 실시간으로 발송되어, 사전 예방과 자율 규제를 유도하는 역할을 한다. 결과적으로 본 실시 예는 침해 발생 → 반복 감지 → 보호구역 지정 → 행정 반영이라는 본 발명의 핵심 자동화 흐름을 완전하게 구 현한 사례로 작용한다. 실 시 예 6 청구항 6에 따른 구성은 본 발명에 따른 법률 대응 자동화 방법의 전체 절차적 흐름을 구체적으로 설명한 것이다. 가. 먼저 침해 감지부는 드론, UAM 등 공간 이동체의 실시간 위치(GPS), 고도, 비행 속도, 체류 시간 등 핵심 데이터를 수집한다. 예컨대, 특정 건물 상공에서 40m 이하의 고도에서 5분 이상 체류하거나, 동일 경로로 반복 비행할 경우, 해당 데이터를 기반으로 침해 감지부는 잠재적 침해 상황으로 판단 가능한 원시 데이터를 기 록한다. 나. 이후, 해당 데이터는 침해 분석 및 법률 대응 모듈로 전송되며, AI 침해 분류 엔진은 고의성(예: 동일 위치 3회 이상 정지), 반복성(패턴 유사도 분석), 체류 시간(예: dwell time ≥ 4분) 등 정량화된 요소를 바탕 으로 침해 강도를 분석하고, ‘우발적 침해’, ‘고의적 반복 침해’ 등으로 등급화한다. 다. 분석 결과는 스마트 계약 기반 보상 시스템에 연동되어, 침해 유형(예: 조망권 침해), 면적(예: 30%), 고의성 점수(예: 0.82), 반복성 점수(예: 0.73) 등을 고려하여 보상 기준을 자동 산정하고, 보상 금액을 결정한 다. 이때 기준 보상가에 가중치를 부여하는 방식으로 산정 알고리즘이 실행된다. 라. 보상 기준이 확정되면, 사전에 등록된 피해자의 지갑 주소로 자동 보상이 수행되며, 스마트 계약은 Ethereum 등의 블록체인 네트워크 상에서 실행된다. 이 거래는 블록체인 원장에 불가역적으로 기록되며, 침해 이력의 누적 분석에도 활용된다. 마. 동시에, 법률 DB 및 판례 추천 시스템은 침해 유형과 조건에 부합하는 유사 판례를 자동 검색하고, 사 건번호, 판결 요지, 위자료 기준 등이 포함된 리포트(PDF)를 생성한다. 이 리포트는 피해자 또는 법률대리인이 소송에 활용할 수 있도록 구조화되며, 변호사 시스템과의 API 연계도 지원된다. 바. 마지막으로, 행정/정책 연계 모듈은 반복 침해 여부, 고의성 점수, 침해 위치 등을 종합 분석하여 보 호구역 지정이 필요한 지역을 식별한다. 시스템은 자동으로 시청 도시계획 서버에 보호구역 지정 요청을 전송하 고, 침해 통계 및 예측 모델 결과를 포함한 보고서를 자동 생성하여, 도시계획 또는 드론 비행 통제 등의 정책 결정에 기여한다. 이와 같은 절차는 침해 감지에서 보상, 법률 대응, 행정 연계에 이르기까지 전 과정을 데이터 기반으로 자동화 한 것으로, 법적 실효성과 기술적 신뢰성을 동시에 확보할 수 있는 공중권 분쟁 대응 체계를 제공한다. 산업상 이용가능성 본 발명인 공중권 분쟁 해결 및 법률 대응 자동화 시스템 및 방법은 공간적 권리(공중권, 조망권, 일조권 등) 침해에 대한 실시간 감지, 침해 분석, 법률적 대응 및 보상 절차를 자동화하는 기술로서, 다음과 같은 산업적 활용 가능성을 가진다; 첫째, 부동산 산업 분야에서의 활용이 가능하다. 특히 고층 건물 개발, 재개발 사업, 도심 내 조망권 및 일조권 관련 분쟁 발생 가능성이 높은 지역에서는 본 시스템을 통해 사전 침해 예측 및 법률 리포트 생성을 통해 분쟁 을 예방하고, 설계 단계부터 조정이 가능하도록 지원할 수 있다. 둘째, 도시계획 및 행정 정책 분야에 응용 가능하다. 본 발명의 행정/정책 연계 모듈을 활용하면 반복적 침해 지역에 대한 자동 보호구역 지정, 공공기관에 대한 침해 리포트 자동 제출, 건축허가 심사 시 과거 침해 이력자동 반영 등의 기능을 통해 도시계획 결정에 과학적이고 법리적인 기반을 제공할 수 있다. 이는 특히 스마트시 티 구축, 지능형 행정 시스템 구축에 적합하다. 셋째, 리걸테크(LegalTech) 산업 전반에서 폭넓게 활용 가능하다. 본 시스템은 공간적 권리 침해 데이터를 법적 증거로 구조화하고, AI 기반 판례 추천 및 자동 리포트 생성을 통해 법률 서비스의 디지털화를 가능하게 한다. 변호사, 법무법인, 법률 플랫폼 사업자는 이를 통해 사건 대응의 자동화, 리스크 평가의 정량화, 비용 절감 및 대응 속도 향상 등의 이점을 누릴 수 있다. 넷째, 보험 및 리스크 평가 분야에서도 본 발명을 활용할 수 있다. 예컨대, 공간적 권리 침해로 인한 민사상 손 해배상 위험을 사전에 예측하고, 그 위험도를 수치화해 보험료를 책정하거나, 보상 조건을 자동화된 계약 형태 로 구성함으로써 새로운 형태의 보험 상품 개발이 가능하다. 다섯째, 드론(UAV), UAM 등 공간 이동체 운용 산업에 있어서도, 비행 경로의 법적 적정성 판단, 침해 발생 가능 성 자동 경고, 관련 리포트 자동 생성 등을 통해 공간 이동체 운용의 법률 리스크를 최소화할 수 있다. 이처럼, 본 발명은 부동산 개발, 도시행정, 법률 서비스, 보험 산업, 드론 산업 등 다양한 산업 분야에서 유용 하게 적용될 수 있으며, AI 기반 침해 판단과 스마트 계약 기반 보상 시스템을 결합함으로써 공간적 권리에 대 한 종합적 대응 체계를 제공한다는 점에서 산업상 이용가능성이 매우 높다."}
{"patent_id": "10-2025-0046097", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 : 공중권 및 공간적 권리의 입체적 구조 개념도이다. 공중권, 조망권, 일조권 등 공간적 권리의 3차원적 범위를 개념적으로 설명한 도면이다. 공중 이동체의 비행, 인접 건물의 그림자, 시야 차단 등 다양한 침해 요소 들을 입체적으로 표현하여, 본 발명의 보호 대상이 되는 권리 구조를 시각적으로 제시한다. 도 2 : 공중권과 개발권의 상호관계 및 보상 개념 구조도이다. 공중권과 개발권의 경계 및 연동 구조를 도식화 한 도면이다. 공중권의 양도, 개발권의 제한, 침해 발생 시의 보상 메커니즘까지 연결하여, 공중권 거래 및 보 호 시스템이 기존의 부동산 등기 시스템과 어떻게 접목되는지를 설명한다. 도 3 : 공중권 데이터 시각화 및 리포팅 시스템의 통합 구성 및 활용 사례이다. 고층 건물 신축, 드론 비행, 조 망권 침해 등 실질적 침해 시나리오를 기반으로 AI 기반 분석, 시각화, 자동 보상, 리포트 생성 등 전체 시스템 의 흐름을 도시화한 도면이다. 본 발명의 핵심 기술이 어떻게 실생활에 적용되는지를 사례 중심으로 보여준다. 청구항 3에 따른 보상 시스템은 도 6의 스마트 계약 실행 흐름을 통해 실현된다. 도 4 : 공중권 침해 감지 및 분석 시스템 구성도이다. 본 도면은 본 발명의 공중권 분쟁 해결 및 법률 대응 자 동화 시스템에서 사용되는 기술적 구성 요소 간 연계 구조를 도시한 블록 다이어그램이다. 침해감지부는 드론, UAM 등의 이동체 및 고정 구조물로 인한 조망권, 일조권, 공중권 침해 여부를 실시간으로 감지한다. 감지 된 데이터는 침해분석 및 법률대응모듈로 전달되어, AI 기반 침해 분석 및 고의성 판단이 수행된다. 분석 결과는 스마트 계약 기반 보상 시스템으로 연계되어 보상 절차가 자동화되며, 관련된 판례와 법적 판단은법률 DB 및 판례추천시스템과 연계되어 처리된다. 나아가 행정/정책 연계 모듈은 공공기관에 침해 사 례를 자동 보고하고, 보호구역 지정 등 정책적 대응을 가능케 한다. 도 5 : 침해 유형별 법률 대응 프로세스 흐름도이다. 본 도면은 침해 발생 후 각 구성 요소가 법률 대응 및 보 상 처리에 이르는 전체 절차를 흐름도로 설명한 것이다. 침해감지부가 드론 등의 비행 패턴을 감지하면, 침해분석 및 법률대응모듈이 고의성 및 반복성을 평가한다. 평가 결과는 스마트 계약 기반 보상 시스템 으로 전송되며, 일정 기준을 충족할 경우 보상 스마트 계약이 자동 실행된다. 동시에 법률 DB 및 판례추천 시스템은 유사 판례를 검색하여 침해 보고서에 첨부하고, 행정/정책 연계 모듈은 지역 보호구역 지정 및 규제 조치를 자동화하는 흐름을 따른다. 도 6 : AI 기반 판례 추천 및 리포트 자동화 구조도이다. 본 도면은 침해 발생 시 법적 판단 자동화 및 증거 리 포트 생성 과정을 보여주는 구조도이다. 침해분석 및 법률대응모듈은 침해의 유형, 시간, 위치 데이터를 기반으로 법률 DB 및 판례추천시스템과 연동된다. 시스템은 AI 모델을 활용하여 유사한 침해 판례를 자동 매칭하고, 관련 판결 요지, 보상 판례, 법률 기준 등을 포함한 PDF 형식의 자동 리포트를 생성한다. 해당 리포 트는 피해자, 가해자, 행정기관, 법률대리인에게 자동 송부되며, 변호사 시스템과의 API 연계도 지원된다. 도 7 : 공공기관 정책 연계 및 보호구역 자동 지정 프로세스이다. 본 도면은 침해가 반복적으로 발생하는 지역 에 대해 행정기관과의 연계를 통해 정책적 대응이 자동으로 이루어지는 절차를 설명한 도면이다. 침해 감지 및 분석 결과가 일정 빈도를 초과하거나 고의성이 반복되는 경우, 행정/정책 연계 모듈은 해당 지역을 공중권 보호구역 후보로 지정한다. 이 정보는 시청, 지자체, 국토부 등 관련 행정기관에 자동으로 보고되며, 건축 허가, 드론 비행 제한, 정책 수립 등에 실시간 반영된다. 생성된 행정 리포트에는 침해 빈도, 반복성, 고의성 점수, 추정 침해 지속도 등이 포함되며, 스마트 도시 인프라 시스템과의 연동도 가능하다."}
