{"patent_id": "10-2020-0123044", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0040562", "출원번호": "10-2020-0123044", "발명의 명칭": "무인 테이크아웃 무인판매기세트 및 이를 이용한 판매방법", "출원인": "현석남", "발명자": "현석남"}}
{"patent_id": "10-2020-0123044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무인판매기세트(10)와, 가입자스마트기기(20)가 인터넷망(60)을 통해 설정아이디로 가입하여 판매물품을 주문토록하고, 해당 무인판매기세트(10)의 판매현황 및 재고를 파악하고, 인공지능(AI)을 이용하여(Deep Running) 판매물품별 판매데이타를 기초로 인기상품을 우선순위로 안내하는 어플을 제공하는 메인서버(30);메인서버(30)와 연동하여 물품구매 대금을 스마트기기(20) 가입자가 결제토록하는 결제서버(40); 및메인서버(30)에서 무인판매기세트(10)의 재고량을 파악하여 부족한 물품을 해당 무인판매기세트(10)로 운송하여보충토록 관리하는 물류저장 관리서버(50)로 시스템을 이루고;상기 무인판매기세트(10)는 해당 물품별, 위치별로 인식하는 센서부((S10~S1n)~(Sn0~Snn)), 선택되어 작동하는센서부((S10~S1n)~(Sn0~Snn))중의 센싱값을 제어부(18)가 인식 가능토록 변환하는 입출력인터페이스(17)를 포함하고;인터넷망(60)과 설정 아이디로 쌍방향 통신하는 모뎀(11);사용자가 구매시 지불할 내장카드나 별도의 카드를 선택하여 가입자스마트기기(20)화면이나 별도의 카드를 인식하는 카메라(12);카메라(12)를 통해 제어부(18)에서 인식한 카드로 구매할 품목, 개수 및 해당 가격을 표시하는 디스플레이(15a);디스플레이(15a)에서 표시한 품목 중에 원하는 상품 및 개수를 선택하는 키보드(15);키보드(15)의 선택을 제어부(18)에서 인식하여 선택 상품을 출하하도록 구동하는 출하구동부(14)를 포함하여 구성한 것을 특징으로 하는 무인테이크아웃 무인판매기세트."}
{"patent_id": "10-2020-0123044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 무인판매기세트(10)에는 카드 인식용 엔에프시리더(13)를 부가하고, 엔에프시리더(13)의 인식은 제어부(18)에서 인식하도록 구성한 것을 특징으로 하는 무인테이크아웃 무인판매기세트."}
{"patent_id": "10-2020-0123044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "무인판매기세트(10)와, 가입자스마트기기(20)가 인터넷망(60)을 통해 설정아이디로 가입하여 판매물품을 주문하도록하고, 해당 무인판매기세트(10)의 판매현황 및 재고를 파악하고, 인공지능(AI)을 이용하여(Deep Running)구매시 판매물품별 판매데이타를 기초로 인기상품을 우선순위별로 인내하는 어플을 제공하는 메인서버(30);메인서버(30)와 연동하여 물품구매 대금을 스마트기기(20) 가입자의 내장 카드나 별도의 카드 또는 지불 가능한디지탈 쿠폰(화폐) 등의 결제가능수단중의 하나로 결제토록하는 결제서버(40); 및메인서버(30)에서 무인판매기세트(10)의 재고량을 파악하여 부족한 물품을 해당 무인판매기세트(10)로 운송하여보충토록 관리하는 물류저장 관리서버(50)로 시스템을 이루고;상기 어플은 무인판매기세트(10)와 가입자스마트기기(20)에 아이디를 부여하는 로그인단계(S10);로그인을 수행하면 메인서버(30)는 인공지능(AI) 을 이용하여(Deep Running) 판매물품별 판매데이타를 기초로인기상품을 우선순위별로 안내하는 안내단계(S15);안내단계(S15)에 이어 무인판매기세트(10)의 상품(판매 물품)을 가입자스마트기기(20) 화면이나 무인판매기세트(10)의 디스플레이(15a)를 통하여 선택하여 상품 및 개수를 선택하는 구매단계(S20);공개특허 10-2022-0040562-3-구매단계(S20)에 이어 메인서버(30)는 결제서버(40)에서 선택물품 가격을 결제하고, 박스형 묶음 구매 물품을결제한 경우 무인판매기세트(10)의 제어부(18)에서는 구매 금액 및 묶음구매 여부를 확인하고, 결제금액 한도내에서 원하는 물품을 나누어 무인판매기세트(10)에서 출하토록 하는 결제단계(S30); 및메인서버(30)는 구입한 물품을 확인하여 물류저장 관리서버(50)로 통보하고, 해당 무인판매기 세트(10)의 물품재고 현황도 통보하는 통보단계(S40)를 순차 수행함을 특징으로 하는 무인테이크아웃 판매방법."}
{"patent_id": "10-2020-0123044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서, 통보단계(S40) 후에 해당 무인판매기세트(10) 내의 판매 가능한 물품이 하루 예상판매 개수미만이면 물류저장 관리서버(50)에서 지시한 운송업자나 별도의 운송라인을 통해 해당 무인판매기세트(10)에 보충토록하고,무인판매기세트(10) 내의 내장 물품확인센서를 통하여 잔고를 확인하여 인터넷망으로 물류저장 관리서버(50)에통지하여 부족한 물품을 보충하는 물류보충단계(S50)를 더 수행함을 특징으로 하는 무인테이크아웃 판매방법."}
{"patent_id": "10-2020-0123044", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 무인판매기세트와, 가입자스마트기기가 인터넷망을 통해 설정아이디로 가입하여 판매물품 을 주문하고, 무인판매기세트의 판매 재고를 파악하고, 인공지능을 이용하여 판매물품별 판매데이타를 기초 로 인기상품을 우선순위별로 안내하는 어플을 제공하는 메인서버; 메인서버와 연동하여 물품구매 대금을 (뒷면에 계속)"}
{"patent_id": "10-2020-0123044", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무인 테이크아웃 무인판매기세트 및 이를 이용한 판매방법에 관한 것이다."}
{"patent_id": "10-2020-0123044", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자동판매 기능을 갖는 무인점포 시스템 관련 기술은 국내특허등록 10-0988754호로 개시되어 있고, 온라인 상거 래와 오프라인 상거래의 복합적인 전자상거래 기술은 국내공개특허10-2000-0037269호로 알려져 있고, 통합음식 제공 서비스관련 기술은 국네특허등록 10-1645157호로 알려져 있으나, 이러한 기술은 무인점포들을 일괄 관리하고, 판매한 물품 보충은 별도의 물류저장관리서버에서 담당하는 방법은 제시하지 못하고 있다."}
{"patent_id": "10-2020-0123044", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 이를 해결하고자 하는 것으로, 본 발명의 목적은 무인점포판매기를 매장 시설 및 다수의 사람이 이동 하는 공공기관, 공원, 지하철, 대로변 등에 설치하고 이들을 인터넷 통신망으로 메인서버의 관리하에 판매량과 재고량을 관리토록 하고, 사용자는 메인서버와 결제서버를 통하여 원하는 물품을 카드 등으로 구입토록 하여 사 용자에게는 현금 사용시의 부작용을 최소화하고, 선결제 여부를 확인하여 일시에 묶음물품을 구입한 경우, 결제 금액 내에서 하나씩 출하 가능토록 하는 새로운 판매방법을 제공하려는 것이다. 본 발명의 다른 목적은 비용을 결제하는 결제서버와, 물품을 관리하여 무인판매기에 보충하는 물류저장 관리서 버를 두고 무인판매기는 물품의 구매 및 관리를 하지 않아도 판매 및 관리가 가능토록 하는 무인 테이크아웃 판 매방법을 제공하려는 것이다."}
{"patent_id": "10-2020-0123044", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "메인서버를 매개로 설정아이디로 가입하여 판매물품을 주문토록하고, 해당 무인판매기세트의 판매현황 및 재고 를 파악하고, 인공지능을 이용하여 판매물품별 판매데이타를 기초로 인기상품을 우선순위별로 안내하는 어플을 제공하는 메인서버; 메인서버와 연동하여 물품구매 대금을 스마트기기 가입자가 결제토록하는 결제서버; 및 메인서버에서 무인판매기세트의 재고량을 파악하여 부족한 물품을 해당 무인판매기세트로 운송하여 보충토록 관 리하는 물류저장 관리서버로 시스템을 이루고;상기 무인판매기세트는 해당 물품별, 위치별로 인식하는 센서부, 선택되어 작동하는 센서부의 센싱값을 제어부 가 인식 가능토록 변환하는 입출력인터페이스를 포함하고; 인터넷망과 설정 아이디로 쌍방향 통신하는 모뎀; 사용자가 구매시 지불할 카드 등의 지불수단을 가입자스마트기기 화면이나 별도의 카드를 통해 인식하는 카메라; 카메라를 통해 제어부에서 인식하면 구매할 품목,수량 및 가격을 표시하는 디스플레이; 디스플레이에서 표시한 품목 중에 원하는 상품 및 개수를 선택하는 키보드; 키보드의 선택을 제어부에서 인식하여 선택 상품을 출하하도록 구동하는 출하구동부를 포함하여 구성한 무인테 이크아웃 무인판매기세트를 제공한다. 본 발명은 또한 무인판매기세트와 가입자스마트기기에 아이디를 부여하는 로그인단계(S10); 로그인을 수행하면 메인서버는 인공지능을 이용하여 판매물품별 판매데이타를 기초로 인기상품을 우선순위로 안 내하는 안내단계(S15); 안내단계(S15)에 의한 무인판매기세트의 안내물품에서 구매물품 및 개수를 선택하여 구매결정토록하는 구매단계 (S20); 구매단계(S20)에 이어 결제서버에서 구매물품 및 개수에 따라 비용을 결제하면 메인서버는 무인판매기세트에서 해당 물품을 출하토록 하는 결제단계(S30); 및 메인서버는 판매 및 출하한 물품을 확인하여 물류저장 관리서버로 통보하고, 해당 무인판매기세트의 물품재고 현황도 통보하는 통보단계(S40)를 순차 수행함을 특징으로 하는 무인테이크아웃 판매방법을 제공한다."}
{"patent_id": "10-2020-0123044", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본원발명은 무인판매기세트를 메인서버와 연동하여 무인으로 관리하고, 가입자는 가입자스마트기기 내장카드나 별도의 카드나 별도의 현찰대용 쿠폰 등의 지불수단을 카메라 인식이나 별도의 지불인식수단으로 확 인하여 구매토록 하므로 별도의 판매공간과 유지비 없이도 무인으로 운영 가능하다. 또한 박스로 구입한 상품은 선결제 인지를 확인하여 집에 적재할 필요없이 필요시에만 무인판매기세트에서 출하 하여 편리하게 쓸 수 있어, 경제 개념이 약한 어린이나 노인들이 물품구매 및 출하하기에 좋다. 메인서버는 결제서버와 협력하여 무인점포 개념의 무인판매기세트를 임대할 수도 있고 판매도 하며, 관리도 해 줌으로써 무인판매기세트 구매자는 별도의 시간 소비 없이 이익을 지속적으로 창출할 수 있는 신 시장을 개척할 수 있다."}
{"patent_id": "10-2020-0123044", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본원발명의 실시예를 도면을 참조하여 상세히 설명한다. 본원발명은 도 1 과 같이, 무인판매기세트와, 가입자스마트기기가 인터넷망을 통해 메인서버를 매개로 설정아이디로 가입하여 판매물품을 주문토록하고, 해당 무인판매기세트의 판매현황 및 재고를 파악 하고, 인공지능을 이용하여 판매물품별 판매데이타를 기초로 인기상품을 우선순위별로 안내하는 어플을 무인판매기세트에 제공하는 메인서버; 메인서버와 연동하여 물품구매 대금을 스마트기기 가입자가 결제토록하는 결제서버; 및 메인서버에서 무인판매기세트의 재고량을 파악하여 부족한 물품을 해당 무인판매기세트로 운송하여 보충토록 관리하는 물류저장 관리서버로 시스템을 이루고; 상기 무인판매기세트는 도 2 내지 도 5와 같이, 해당 물품별, 위치별로 물품 여부를 인식하는 센서부 ((S10~S1n)~(Sn0~Snn)), 선택되어 작동하는 센서부((S10~S1n)~(Sn0~Snn))중의 해당 센싱값을 제어부가 인 식 가능토록 변환하는 입출력인터페이스를 포함하고; 인터넷망과 설정 아이디로 쌍방향 통신하는 모뎀; 사용자가 구매시 사용한 가입자스마트기기 내장카드 화면이나 별도의 카드를 인식하는 카메라; 카메라를 통해 제어부에서 인식한 카드로 구매할 품목, 개수 및 해당 가격을 표시하는 디스플레이 (15a); 디스플레이(15a)에서 표시한 품목 중에 원하는 물품 및 개수를 선택하는 키보드; 키보드의 선택을 제어부에서 인식하여 선택 상품을 출하하도록 구동하는 출하구동부를 포함하여 구 성한다. 상기, 무인판매기세트에는 도 2 와 같이 추가로 엔에프시리더를 부가하고, 엔에프시리더의 인식은 제어부에서 인식하도록 구성한다. 도 1 에보인 는 메인서버에서 무인판매기세트에 관한 정보와, 판매내역 및 가입자스마트기기 사용자의 아이디와 결제서버로부터 받은 결제내역 등을 저장하 는 저장장치, 는 결제서버에서 결제금액과 결제한 가입자스마트기기의 아이디나 카드번호 등을 저 장하는 저장장치이다. 이와같이 구성한 시스템을 이용하여 판매하는 방법은, 무인판매기세트와, 가입자스마트기기가 인터넷망을 통해 설정아이디로 가입하여 판매물품을 주문하 도록하고, 해당 무인판매기세트의 판매현황 및 재고를 파악하고, 인공지능(AI)을 이용하여(Deep Running) 구매시 판매물품별 판매데이타를 기초로 인기상품을 우선순위별로 안내하는 어플을 제공하는 메인서버; 메인서버와 연동하여 물품구매 대금을 스마트기기 가입자가 내장카드나 별도의 카드 또는 지불가능한 디지탈 쿠폰(화폐) 등의 결제가능수단으로 결제토록하는 결제서버; 및 메인서버에서 무인판매기세트의 재고량을 파악하여 부족한 물품을 해당 무인판매기세트로 운송하여 보충토록 관리하는 물류저장 관리서버로 시스템을 구비하고; 상기 어플은 도 5 와 같이 메인서버는 무인판매기세트와 가입자스마트기기에 어플을 설치할 때 아 이디를 부여하여 메인서버의 저장장치에 아이디별로 저장하는 로그인단계(S10)를 수행한다. 이어 로그인하면 메인서버는 인공지능(AI) 을 이용하여(Deep Running) 판매물품별 판매데이타를 기초로 인 기상품을 우선순위별로 안내하는 안내단계(S15); 안내단계(S15)에 이어 무인판매기세트의 상품(판매 물품)을 가입자스마트기기 화면이나 무인판매기세트 의 디스플레이(15a)를 통하여 선택하여 물품 및 개수를 선택하는 구매단계(S20); 및 구매단계(S20)에 이어 메인서버는 결제서버에서 선택물품 가격을 결제하고, 박스형 묶음 구매 물품을 결제한 경우 무인판매기세트의 제어부에서는 구매 금액 및 묶음구매 여부를 확인하고, 결제금액 한도 내에서 원하는 물품을 나누어 무인판매기세트에서 출하토록 하는 결제단계(S30)를 수행한다. 출하시에는 디스플레이(15a)에 지불한금액과 출하 가능한 상품 및 개수(박스형태의 묵음 구매시)를 리스트업하 면, 가입자스마트기기 사용자는 키보드로 원하는 상품(번호) 및 개수를 눌러서 출하를 요청한다. 그러 면 제어부는 해당 상품의 적재대에 있는 상품 출하 구동부를 구동시키고(예를 들어 도어 개폐식, 언로 딩 방식 등 알려진 기술을 이용하므로 상세 출하 설명은 생략한다), 출하시에는 해당 상품이 적재된 위치에 있 는지 여부를 확인 하는 센서부의 해당 센서(예를 들어 포토커플러, 마이크르스위치센서 등)의 변동을 인식 하여 출하 여부와 개수를 제어부에서 확인토록 한다. 구입 후 출하 요청시 인출구(19a)를 통하여 출하하면 무인으로 구매 가능하게 된다.해당 무인판매기세트는 판매 현황을 실시간으로 제어부에서 인식하고 이를 모뎀을 통하여 도 1 에 보인 인터넷망을 통하여 메인서버로 통보한다. 메인서버는 판매한 물품 재고를 확인하여 물류저장 관리서버로 통보하는 통보단계(S40)를 순차 수행한다. 상기, 통보단계(S40) 후에 메인서버에서는 저장장치를 통하여 구축한 데이타베이스를 기초로, 해당 무 인판매기세트 내의 판매 가능한 물품이 하루 예상판매 개수 미만으로 확인되면, 메인서버는 물류저장 관리서버에서 별도의 운송라인을 통해 해당 무인판매기세트에 보충토록하고, 무인판매기세트는 보충 여부를 내장 물품확인센서를 통하여 인터넷망으로 메인서버 및 물류저장 관 리서버에 통지하여 보충하는 물류보충단계(S50)를 더 수행한다. 본 발명에서의 카드는 가입자스마트기기내에 내장한 내장형카드나 별도의 카드를 사용 할 수 있고, 이 카드 인식은 카메라외에 별도의 카드결제기를 추가로 사용할 수도 있다(추가하는 결제방식은 알려진 기술이므로 부가설명은 생략한 것임을 알 수 있을 것이다). 본 발명에서의 주문 물품 선택(구매단계(S20))은 무인판매기세 트의 디스플레이(15a)화면을 통하여 선택할수도 있고, 가입자스마트기기 화면에서 제공하는 어플제공 선택화면을 통하여 선택 가능함은 알 수 있을 것이다. 본 발명에서의 결제 또한 무인판매기세트와 가입자스마트기기가 메인서버를 매개로 인터넷통신망을 통하여 연동토록 하여, 구매단계(S20) 와 결제단계(S30)를 수행토록 하고 물품 출하만 해당위치의 무인판매기세 트에서 출하도록 하면, 예를들어 묶음 구매의 경우 A위치의 무인판매기세트에서 하나를 출하하고, B위 치의 무인판매기세트에서 다른 하나를 출하토록 할 수도 있어 편리하다."}
{"patent_id": "10-2020-0123044", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 시스템 구성도, 도 2는 본 발명의 무인판매기 구성도, 도 3은 본 발명의 평단면 예시도, 도 4는 본 발명의 무인판매기 블럭 구성도, 도 5는 본 발명의 센서부 구성 예시도, 도 6은 본 발명의 흐름도이다."}
