{"patent_id": "10-2007-0086295", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2009-0021641", "출원번호": "10-2007-0086295", "출원인": "이원구", "발명자": "이원구"}}
{"patent_id": "10-2007-0086295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "돌멩이를 이용하여 어린이의 지능을 개발하는 학습교재에 있어서, 주변환경의 자연으로부터 구하는 소정 크기의 자연 돌멩이; 점토를 주원료로 하여 다수 형상으로 만들어진 것 중에서 선택된 어느 하나의 인공 돌멩이; 상기 점토를 주원료로 하고 원하는 형상의 돌멩이로 만드는 인공 돌멩이 재료; 상기 자연 돌멩이 또는 인공 돌멩이에 색칠하기 위한 물감; 및 상기 자연 돌멩이 또는 인공 돌멩이를 장식하기 위한 장식 재료; 가 포함되어 구성되는 돌멩이를 이용한 지능개발 학습교재."}
{"patent_id": "10-2007-0086295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 인공돌멩이 재료는, 상기 점토를 주원료로 하고, 색상을 내는 물감과 습기가 포함되어 구성되고 물기를 제어하여 말리는 구성으로이루어지는 것을 특징으로 하는 돌멩이를 이용한 지능개발 학습교재."}
{"patent_id": "10-2007-0086295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 물감은, 아크릴 물감, 크레용, 매직, 색연필이 포함되는 것 중에서 선택된 어느 하나 이상이고, 상기 장식 재료는, 주변환경으로부터 구할 수 있는 재료 중에서 선택된 어느 하나 이상으로 이루어지는 것을 특징으로 하는 돌멩이를 이용한 지능개발 학습교재."}
{"patent_id": "10-2007-0086295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "자연 돌멩이를 이용하여 어린이의 지능을 개발하는 교육방법에 있어서, 상기 돌멩이를 소정크기로 수집하고 세척하여 교육을 준비하는 과정; 상기 돌멩이에 색칠할 재료와 장식할 재료를 준비하는 과정; 상기 준비된 돌멩이에 표현할 주제를 지정하고 어린이에게 돌멩이의 특징적 형상을 관찰시키는 과정; 및 상기 돌멩이의 형상이 지정된 주제가 표현되도록 색칠과 장식하고 전시하는 과정; 이 포함되는 돌멩이를 이용한지능개발 교육방법."}
{"patent_id": "10-2007-0086295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 주제는, 동물, 식물, 인공물이 포함되는 것 중에서 선택된 어느 하나인 것을 특징으로 하는 돌멩이를 이용한 지능개발교육방법."}
{"patent_id": "10-2007-0086295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "인공 돌멩이를 이용하여 어린이의 지능을 개발하는 교육방법에 있어서, 상기 인공 돌멩이 재료를 준비하고, 이미 만들어진 소정 형상의 다수 인공 돌멩이 중에서 어느 하나를 선택하는과정; 상기 돌멩이에 색칠할 재료와 장식할 재료를 준비하는 과정; 상기 선택된 돌멩이의 형상을 관찰하고 표현할 주제를 결정하며 준비된 인공 돌멩이의 재료로 주제와 연관된 형상의 인공 돌멩이를 만드는 과정; 및 - 2 -공개특허 10-2009-0021641상기 돌멩이의 형상을 주제가 부각되도록 색칠과 장식하고 전시하는 과정; 이 포함되는 돌멩이를 이용한 지능개발 교육방법."}
{"patent_id": "10-2007-0086295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 상기 돌멩이 형상을 만드는 것은, 상기 준비된 인공 돌멩이 재료의 습기를 짜면서 선택된 주제의 형상으로 만드는 것을 특징으로 하는 돌멩이를이용한 지능개발 교육방법."}
{"patent_id": "10-2007-0086295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서, 상기 인공 돌멩이 재료는, 점토를 주성분으로 하고 물감과 습기가 포함되는 것을 특징으로 하는 돌멩이를 이용한 지능개발 교육방법. 명 세 서발명의 상세한 설명 발명의 목적 발명이 속하는 기술 및 그 분야의 종래기술본 발명은 돌멩이를 이용하여 어린이의 지능을 개발하는 것으로 특히 일상의 주변환경으로부터 쉽게 구할 수 있 <11>고 지나쳐 버릴 수 있는 흔한 대상 중에 하나인 돌멩이를 이용하여 연상되는 사물을 표현하도록 함으로서 관찰력, 사고력, 상상력을 개발하는 동시에 자연환경을 이해하며 친환경적으로 만들고 정서적으로 안정시키는 돌멩이를 이용한 지능개발 학습교재 및 교육방법에 관한 것이다. 일반적으로 유치원에 들어가기 전까지 연령대의 아이를 유아라 하며, 유치원 및 초등학교에 다니는 연령대의 아 <12>이를 어린이라 한다. 유아 또는 어린이는 집중력, 사고력, 판단력 등이 완전하게 발달하지 못하였으며, 이러한어린이의 특징은 싫증을 빨리 내고 흥미를 지속적으로 느끼지 못하며 집중력이 약하여 놀이 또는 장난 등을 오래 동안 계속하지 못한다는 단점이 있다. 이하 본"}
{"patent_id": "10-2007-0086295", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 돌멩이를 이용한 지능개발 학습교재 및 교육방법에 관한 것으로, 특히 자연의 돌멩이를 이용하여 어린 이의 지능을 개발하는 교육방법에 있어서, 돌멩이를 소정크기로 수집하고 세척하여 교육을 준비하는 과정; 돌멩 이에 색칠할 재료와 장식할 재료를 준비하는 과정; 준비된 돌멩이에 표현할 주제를 지정하고 어린이에게 돌멩이 의 특징적 형상을 관찰시키는 과정; 및 돌멩이의 형상이 지정된 주제가 표현되도록 색칠과 장식하고 전시하는 과 정; 이 포함되는 구성을 특징으로 하여, 어린이의 관찰력과 표현력 및 상상력을 발달시키고 자연환경에 친근감을 느껴 자연을 보호하는 심성을 기르고 정서적으로 안정되도록 하는 효과가 있다."}
{"patent_id": "10-2007-0086295", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 구성의 본 발명은 주변에서 흔히 구할 수 있는 돌멩이를 가지고 어린이가 관찰하여 주제를 발견하 <73> 도록 하며, 색칠과 장식에 의하여 발견된 주제가 부각되도록 표현하므로, 어린이의 관찰력과 표현력 및 상상력 을 발달시키는 현장학습의 효과가 있다. 또한, 어린이가 주변환경을 잘 관찰하고 자연의 소중함과 필요함을 인식하며 자연환경에 친근감을 느끼도록 하 <74> 는 동시에 정서적으로 안정시키는 효과가 있다."}
