{"patent_id": "10-2021-0187606", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0098441", "출원번호": "10-2021-0187606", "발명의 명칭": "인공지능 기반의 석출경화형 합금 설계 방법 및 인공지능 기반의 석출경화형 합금 설계 시스", "출원인": "한국재료연구원", "발명자": "최은애"}}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자장치에 의해 수행되는 인공지능 기반의 석출경화형 합금 설계 방법에 있어서, 상기 인공지능 기반의 석출경화형 합금 설계 방법은,복수의 변수들을 가공하는 입력변수 가공단계; 상기 입력변수 가공단계에서 생성된 입력변수들에 대응하는 데이터를 학습하는 인공신경망 학습단계; 상기 인공신경망 학습단계에서 생성된 출력변수들을 가공하는 출력변수 가공단계; 및상기 출력변수 가공단계에서 가공된 출력변수들을 이용하여 석출경화형 합금의 기계적 성질 및 전기적 성질을추정하는 성질 추정단계를 포함하며,상기 입력변수 가공단계는, 복수의 석출경화형 합금들 각각이 포함하는 복수의 금속물질들에 대한 데이터에서 제1 금속물질의 양에 대응하는 데이터를 제거하는 조성변수 가공단계; 및상기 복수의 석출경화형 합금들 각각에 대응하는 복수의 공정정보들이 서로 다른 코드값을 가지도록 하는 공정정보 코드화단계를 포함하는 인공지능 기반의 석출경화형 합금 설계 방법."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 제1 금속물질은 상기 복수의 금속물질들 중 가장 큰 weight % 또는 가장 큰 atomic %를 차지하는 금속물질인 인공지능 기반의 석출경화형 합금 설계 방법."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 복수의 금속물질들은 Cu, Ni, Si, Mg, Sn, Al, Zn, Fe, Ti, Cr, Zr, Mn, Ag, P, Co, 및 Pb를 포함하는 인공지능 기반의 석출경화형 합금 설계 방법."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 제1 금속물질은 Cu인 인공지능 기반의 석출경화형 합금 설계 방법."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 복수의 공정정보들은 용체화 처리조건, 열처리 조건, 가공 공정 조건, 및 시효조건 중 적어도 어느 하나에대응하는 정보를 포함하는 인공지능 기반의 석출경화형 합금 설계 방법."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 입력변수 가공단계는 무처리공정 데이터 증강 단계를 더 포함하고,상기 무처리공정 데이터 증강 단계는 상기 복수의 석출경화형 합금들을 생성하기 위한 시간을 포함하는 공정이이루어 지지 않았을 경우, 상기 시간 외에 다른 변수들이 의미 있도록 하는 학습데이터를 생성하는 인공지능 기반의 석출경화형 합금설계 방법.공개특허 10-2023-0098441-3-청구항 7 제6 항에 있어서,상기 학습데이터는 열처리 시간은 0이면서, 열처리 온도가 서로 다른 복수의 데이터들을 포함하고, 상기 학습데이터는 상기 인공신경망 학습단계를 통해 학습되는 인공지능 기반의 석출경화형 합금설계 방법."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6 항에 있어서,상기 입력변수 가공단계에서 생성된 상기 입력변수들은 평균 0, 분산 1을 만족시키도록 선형 변환되는 인공지능기반의 석출경화형 합금설계 방법."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 인공신경망 학습단계에서 이용되는 인공 신경망은 제1 은닉층 및 제2 은닉층을 포함하는 완전연결 신경망이며, 상기 제1 은닉층 및 상기 제2 은닉층 각각은 40개 이상 80개 이하의 뉴런들을 포함하는 인공지능 기반의 석출경화형 합금설계 방법."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 뉴런들에 가해지는 활성화 함수는 시그모이드(sigmoid) 함수, 쌍곡탄젠트(tanh) 함수, ELU(ExponentialLinear Unit) 함수, 및 선형 함수 중 적어도 어느 하나를 포함하는 인공지능 기반의 석출경화형 합금설계 방법."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "복수의 전자장치들을 포함하는 인공지능 기반의 석출경화형 합금 설계 시스템에 있어서, 상기 인공지능 기반의석출경화형 합금 설계 시스템은,복수의 변수들을 가공하여 복수의 입력변수들을 생성하고, 인공 신경망을 이용하여 상기 복수의 입력변수들에 대응하는 데이터를 학습하며, 상기 인공 신경망에 의해서 생성된 복수의 출력변수들을 가공하고,상기 가공된 복수의 출력변수들을 이용하여 석출경화형 합금의 기계적 성질 및 전기적 성질을 추정하며,상기 복수의 입력변수들은, 복수의 석출경화형 합금들 각각이 포함하는 복수의 금속물질들에 대한 데이터에서 제1 금속물질의 양에 대응하는 데이터를 제거하여 생성된 복수의 조성변수들; 및각각이 복수의 공정정보들에 대응하며 서로 다른 값을 가지는 복수의 코드값들을 포함하는 인공지능 기반의 석출경화형 합금 설계 시스템."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 제1 금속물질은 상기 복수의 금속물질들 중 가장 큰 weight % 또는 가장 큰 atomic %를 차지하는 금속물질인 인공지능 기반의 석출경화형 합금 설계 시스템."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11 항에 있어서,상기 복수의 금속물질들은 Cu, Ni, Si, Mg, Sn, Al, Zn, Fe, Ti, Cr, Zr, Mn, Ag, P, Co, 및 Pb를 포함하는 인공개특허 10-2023-0098441-4-공지능 기반의 석출경화형 합금 설계 시스템."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 제1 금속물질은 Cu인 인공지능 기반의 석출경화형 합금 설계 시스템."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서,상기 복수의 공정정보들은 용체화 처리조건, 열처리 조건, 가공 공정 조건, 및 시효조건 중 적어도 어느 하나에대응하는 정보를 포함하는 인공지능 기반의 석출경화형 합금 설계 시스템."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11 항에 있어서,상기 복수의 입력변수들은 무처리공정 데이터를 더 포함하고,상기 무처리공정 데이터는 상기 복수의 석출경화형 합금들을 생성하기 위한 시간을 포함하는 공정이 이루어 지지 않았을 경우, 상기 시간 외에 다른 변수들이 의미 있도록 하는 학습데이터인 인공지능 기반의 석출경화형 합금설계 시스템."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서,상기 학습데이터는 열처리 시간은 0이면서, 열처리 온도가 서로 다른 복수의 데이터들을 포함하고, 상기 학습데이터는 상기 인공 신경망을 통해 학습되는 인공지능 기반의 석출경화형 합금설계 시스템."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16 항에 있어서,상기 복수의 입력변수들은 평균 0, 분산 1을 만족시키도록 선형 변환되는 인공지능 기반의 석출경화형 합금설계시스템."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11 항에 있어서,상기 인공 신경망은 제1 은닉층 및 제2 은닉층을 포함하는 완전연결 신경망이며, 상기 제1 은닉층 및 상기 제2 은닉층 각각은 40개 이상 80개 이하의 뉴런들을 포함하는 인공지능 기반의 석출경화형 합금설계 시스템."}
{"patent_id": "10-2021-0187606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서,상기 뉴런들에 시그모이드(sigmoid) 함수, 쌍곡탄젠트(tanh) 함수, ELU(Exponential Linear Unit) 함수, 및 선형 함수 중 적어도 어느 하나가 적용되는 인공지능 기반의 석출경화형 합금설계 시스템."}
{"patent_id": "10-2021-0187606", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기반의 석출경화형 합금 설계 시스템은 복수의 변수들을 가공하여 복수의 입력변수들을 생성하고, 인공 신경망을 이용하여 상기 복수의 입력변수들에 대응하는 데이터를 학습한다. 상기 인공지능 기반의 석출경화형 합 금 설계 시스템은 상기 인공 신경망에 의해서 생성된 복수의 출력변수들을 가공하고, 상기 가공된 복수의 출력변 수들을 이용하여 석출경화형 합금의 기계적 성질 및 전기적 성질을 추정한다. 상기 복수의 입력변수들은 복수의 석출경화형 합금들 각각이 포함하는 복수의 금속물질들에 대한 데이터에서 제1 금속물질의 양에 대응하는 데이터 를 제거하여 생성된 복수의 조성변수들 및 각각이 복수의 공정정보들에 대응하며 서로 다른 값을 가지는 복수의 코드값들을 포함한다."}
{"patent_id": "10-2021-0187606", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 석출경화형 합금 설계 방법 및 석출경화형 합금 설계 시스템에 대한 것으로, 구체적으로 머신러닝 등 과 같은 인공지능을 이용한 석출경화형 합금 설계 방법 및 인공지능 기반의 석출경화형 합금 설계 시스템에 대 한 것이다."}
{"patent_id": "10-2021-0187606", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "머신 러닝 또는 기계 학습은 컴퓨터 과학 중 인공지능의 한 분야로, 패턴인식과 컴퓨터 학습 이론의 연구로부터 진화한 분야이다. 머신 러닝은 경험적 데이터를 기반으로 학습을 하고 예측을 수행하고 스스로의 성능을 향상시 키는 시스템과 이를 위한 알고리즘을 연구하고 구축하는 기술이라 할 수 있다. 머신 러닝의 알고리즘들은 엄격 하게 정해진 정적인 프로그램 명령들을 수행하는 것이라기보다, 입력 데이터를 기반으로 예측이나 결정을 이끌 어내기 위해 특정한 모델을 구축하는 방식을 취한다. 석출경화란 하나의 고체 속에 다른 고체가 별개의 상으로 되어 나올 때, 그 모재(parent metal)가 단단해지는 현상이다. 이 경화를 이용해서 재료를 강하게 하여 공업재료에 사용하고 있는 경우가 많으며, 강력한 알루미늄 합금 및 강력한 구리합금에 그 예가 많다."}
{"patent_id": "10-2021-0187606", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인공지능을 이용하여 석출경화형 합금의 기계적 성질 및 전기적 성질을 효과적으로 추정할 수 있는 합금 설계 방법 및 합금 설계 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2021-0187606", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능 기반의 석출경화형 합금 설계 방법은 전자장치에 의해 수행될 수 있다. 상기 인공지능 기반의 석출경화형 합금 설계 방법은 복수의 변수들을 가공하는 입력변수 가공단계, 상기 입력변 수 가공단계에서 생성된 입력변수들에 대응하는 데이터를 학습하는 인공신경망 학습단계, 상기 인공신경망 학습 단계에서 생성된 출력변수들을 가공하는 출력변수 가공단계, 및 상기 출력변수 가공단계에서 가공된 출력변수들 을 이용하여 석출경화형 합금의 기계적 성질 및 전기적 성질을 추정하는 성질 추정단계를 포함할 수 있다. 상기 입력변수 가공단계는 복수의 석출경화형 합금들 각각이 포함하는 복수의 금속물질들에 대한 데이터에서 제 1 금속물질의 양에 대응하는 데이터를 제거하는 조성변수 가공단계 및 상기 복수의 석출경화형 합금들 각각에 대응하는 복수의 공정정보들이 서로 다른 코드값을 가지도록 하는 공정정보 코드화단계를 포함할 수 있다. 본 발명의 일 실시예에서, 상기 제1 금속물질은 상기 복수의 금속물질들 중 가장 큰 weight % 또는 가장 큰 atomic %를 차지하는 금속물질일 수 있다. 본 발명의 일 실시예에서, 상기 복수의 금속물질들은 Cu, Ni, Si, Mg, Sn, Al, Zn, Fe, Ti, Cr, Zr, Mn, Ag, P, Co, 및 Pb를 포함할 수 있다. 본 발명의 일 실시예에서, 상기 제1 금속물질은 Cu일 수 있다. 본 발명의 일 실시예에서, 상기 복수의 공정정보들은 용체화 처리조건, 열처리 조건, 가공 공정 조건, 및 시효 조건 중 적어도 어느 하나에 대응하는 정보를 포함할 수 있다. 본 발명의 일 실시예에서, 상기 입력변수 가공단계는 무처리공정 데이터 증강 단계를 더 포함할 수 있다. 상기 무처리공정 데이터 증강 단계는 상기 복수의 석출경화형 합금들을 생성하기 위한 시간을 포함하는 공정이 이루 어 지지 않았을 경우, 상기 시간 외에 다른 변수들이 의미 있도록 하는 학습데이터를 생성할 수 있다. 본 발명의 일 실시예에서, 상기 학습데이터는 열처리 시간은 0이면서, 열처리 온도가 서로 다른 복수의 데이터 들을 포함하고, 상기 학습데이터는 상기 인공신경망 학습단계를 통해 학습될 수 있다. 본 발명의 일 실시예에서, 상기 입력변수 가공단계에서 생성된 상기 입력변수들은 평균 0, 분산 1을 만족시키도 록 선형 변환될 수 있다. 본 발명의 일 실시예에서, 상기 인공신경망 학습단계에서 이용되는 인공 신경망은 제1 은닉층 및 제2 은닉층을 포함하는 완전연결 신경망이며, 상기 제1 은닉층 및 상기 제2 은닉층 각각은 40개 이상 80개 이하의 뉴런들을 포함할 수 있다. 본 발명의 일 실시예에서, 상기 뉴런들에 가해지는 활성화 함수는 시그모이드(sigmoid) 함수, 쌍곡탄젠트(tanh) 함수, ELU(Exponential Linear Unit) 함수, 및 선형 함수 중 적어도 어느 하나를 포함할 수 있다. 본 발명의 일 실시예에 따른 인공지능 기반의 석출경화형 합금 설계 시스템은 복수의 전자장치들을 포함할 수 있다. 상기 인공지능 기반의 석출경화형 합금 설계 시스템은 복수의 변수들을 가공하여 복수의 입력변수들을 생 성하고, 인공 신경망을 이용하여 상기 복수의 입력변수들에 대응하는 데이터를 학습할 수 있다. 상기 인공지능 기반의 석출경화형 합금 설계 시스템은 상기 인공 신경망에 의해서 생성된 복수의 출력변수들을 가공하고, 상기 가공된 복수의 출력변수들을 이용하여 석출경화형 합금의 기계적 성질 및 전기적 성질을 추정할 수 있다. 상기 복수의 입력변수들은 복수의 석출경화형 합금들 각각이 포함하는 복수의 금속물질들에 대한 데이터에서 제1 금 속물질의 양에 대응하는 데이터를 제거하여 생성된 복수의 조성변수들 및 각각이 복수의 공정정보들에 대응하며 서로 다른 값을 가지는 복수의 코드값들을 포함할 수 있다."}
{"patent_id": "10-2021-0187606", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 인공지능을 이용하여 석출경화형 합금의 기계적 성질 및 전기적 성질을 효과적 으로 추정할 수 있는 합금 설계 방법 및 합금 설계 시스템을 제공할 수 있다."}
{"patent_id": "10-2021-0187606", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예들을 설명한다. 도면들에 있어서, 구성요소들의 비율 및 치수는 기술적 내용의 효과적인 설명을 위해 과장된 것이다. \"및/또 는\"은 연관된 구성들이 정의할 수 있는 하나 이상의 조합을 모두 포함한다. \"포함하다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반의 석출경화형 합금 설계 시스템(DS)을 예시적으로 도시한 것 이다. 인공지능 기반의 석출경화형 합금 설계 시스템(DS)은 복수의 전자장치들(PC, SV)를 포함할 수 있다. 본 발명의 일 실시예에서, 전자장치들(PC, SV)은 퍼스널 컴퓨터(PC) 및 서버(SV)를 포함할 수 있다. 퍼스널 컴퓨터(PC)과 서버(SV)는 서로 유선 또는 무선 방식으로 통신할 수 있다. 본 발명의 일 실시예에서, 인공지능 기반의 석출경화형 합금 설계 시스템(DS)은 학습되는 각종 데이터가 서버 (SV)에 저장될 수 있다. 단, 이에 제한되는 것은 아니며, 본 발명의 다른 실시예에서, 퍼스널 컴퓨터(PC)가 별 도의 저장 장치를 구비하여 별도로 구비된 저장장치에 각종 데이터가 저장될 수 있다. 도 2는 본 발명의 일 실시예에 따른 인공지능 기반의 석출경화형 합금 설계 시스템(DS)에 의해 수행되는 석출경 화형 합금 설계방법(DM)에 대응되는 모식도이다. 본 발명의 일 실시예에 따른 인공지능 기반의 석출경화형 합금 설계방법(DM)은 입력변수 가공단계(IVP), 인공신 경망 학습단계(ANL), 출력변수 가공단계(OVP), 및 성질 추정단계(PES)를 포함할 수 있다. 입력변수 가공단계(IVP)에서는 인공신경망 학습단계(ANL)에서 학습될 학습 데이터를 생성하기 위한 복수의 변수 들을 가공하여 인공 신경망에 입력할 복수의 입력변수들을 생성할 수 있다. 본 발명의 일 실시예에서, 입력변수 가공단계(IVP)는 조성변수 가공단계(CVP), 공정정보 코드화단계(PIC), 및 무처리공정 데이터증강 단계(NDE)를포함할 수 있다. 인공신경망 학습단계(ANL)에서는 인공 신경망을 이용하여 입력변수 가공단계(IVP)에서 생성된 입력변수들에 대 응하는 데이터를 학습할 수 있다. 출력변수 가공단계(OVP)에서는 인공신경망 학습단계(ANL)에서 생성된 출력변수들을 가공할 수 있다. 성질 추정단계(PES)에서는 출력변수 가공단계(OVP)에서 가공된 출력변수들을 이용하여 석출경화형 합금의 기계 적 성질 및 전기적 성질을 추정할 수 있다. 상기 기계적 성질은 석출경화형 합금의 강도에 대한 성질 및 경도에 대한 성질을 포함할 수 있다. 상기 전기적 성질은 전기 전도도에 대한 성질을 포함할 수 있다. 도 3은 도 2에서 조성변수 가공단계(CVP)를 확대하여 도시한 것이다. 조성변수 가공단계(CVP)에서는 복수의 석 출경화형 합금들(합금1~합금n) 각각이 포함하는 복수의 금속물질들에 대한 데이터에서 제1 금속물질의 양에 대 응하는 데이터를 제거할 수 있다. 본 발명의 일 실시예에서, 제1 금속물질은 복수의 금속물질들 중 가장 큰 weight %(또는, 중량 %) 또는 가장 큰 atomic %(또는, 몰 %)를 차지하는 금속물질일 수 있다. 가장 큰 weight % 또는 가장 큰 atomic %를 차지하는 금 속물질의 양에 대응하는 데이터를 제거함에 따라, 합금을 구성하는 금속물질들 중 주재료에 해당하는 금속물질 외에, 다른 금속물질들의 선형독립성이 유지될 수 있다. 또한, 불필요한 정보를 제거함에 따라, 인공신경망 학 습단계(ANL)에서 학습 데이터가 학습되는 속도를 증가시킬 수 있다. 본 발명의 일 실시예에서 석출경화형 합금들(합금1~합금n) 각각이 포함하는 금속물질들은 Cu, Ni, Si, Mg, Sn, Al, Zn, Fe, Ti, Cr, Zr, Mn, Ag, P, Co, 및 Pb를 포함할 수 있으나, 이에 제한되는 것은 아니다. 본 발명의 일 실시예에서, 제거되는 데이터인 제1 금속물질은 복수의 Cu일 수 있다. 이 경우, 본 발명의 일 실 시예에 따라 형성되는 석출경화형 합금은 구리 합금(copper base alloy)에 해당할 수 있다. 도 4는 도 2에서 공정정보 코드화단계(PIC)를 확대하여 도시한 것이다. 공정정보 코드화단계(PIC)에서는 복수의 석출경화형 합금들 각각에 대응하는 복수의 공정정보들이 서로 다른 코드값을 가지도록 데이터 처리가 수행될 수 있다. 공정정보들은 용체화 처리조건, 열처리 조건, 가공 공정 조건, 및 시효조건 중 적어도 어느 하나에 대응하는 정 보를 포함할 수 있다. 도 4에서는 코드화 대상이 되는 공정정보가 용체화 처리조건 및 담금질(Quenching) 종류 인 것을 예시적으로 도시하였다. 도 4에 도시된 것과 같이, 용체화 처리를 하였는지 여부 및 담금질(Quenching) 종류에 따라 구분되는 서로 다른 공정들은 서로 다른 코드값을 가지게 될 수 있다. 예를들어, 용체화 처리가 행 해지지 않았으면 코드값 0, 용체화 처리가 행해지고 air quenching하였으면 코드값 1, 용체화 처리가 행해지고 water quenching하였으면 코드값 2가 지정될 수 있다. 이러한 코드화 방법은 용체화 처리가 행해지지 않은 상황 이 재료과학적으로 water quenching한 상황 보다는 air quneching한 상황에 더 가깝다는 관찰에 기반한 것일 수 있다. 도 5는 도 2에서 무처리공정 데이터증강 단계(NDE)를 확대하여 도시한 것이다. 무처리공정 데이터증강 단계 (NDE)에서는 복수의 석출경화형 합금들을 생성하기 위한 시간을 포함하는 공정이 이루어 지지 않았을 경우, 상 기 시간 외에 다른 변수들이 의미 있도록 하는 학습데이터를 생성할 수 있다. 상기 학습데이터는 인공신경망 학 습단계(ANL)를 통해 학습될 수 있다. 도 5를 참조하면, 본 발명의 일 실시예에서, 무처리공정 데이터증강 단계(NDE)에서 생성되는 학습데이터는 열처 리 시간은 0이면서, 열처리 온도가 서로 다른 복수의 데이터들을 포함할 수 있다. 구체적으로, 시간이 포함된 공정에서 시간이 0일 때는 공정이 진행되지 않은 것을 의미하므로 해당공정의 기타 변수는 그 의미를 잃게 된다. 따라서, 시간변수를 복제하되 기타변수는 임의의 값으로 다수 생성하여 학습데이 터를 증강시킬 수 있다. 특정 실시 예에서, 도 5에 도시한 바와 같이, 시간과 온도를 포함하는 열처리공정에 대 해 0인 열처리 시간은 복제하되 열처리 온도만 임의의 값으로 다수 생성하여 학습데이터를 증강시킬 수 있다. 이러한 방법으로 공정 시간 0일 때는 온도값이 의미를 갖지 말아야 한다는 사실을 인공 신경망을 통해 학습시킬 수 있다. 별도로 도시하지는 않았으나, 본 발명의 일 실시예에서 입력변수 가공단계(IVP)는 공정방법 데이터 구축 단계를 더 포함할 수 있다. 공정방법 데이터 구축 단계에서는 공정의 종류, 공정의 순서, 및 공정의 횟수 중 적어도 어 느 하나가 출력값에 영향을 주도록 데이터를 생성할 수 있다. 상기 공정에 영향을 주는 변수는 석출경화형 합금의 조성비율(중량, 또는 atomic %), 온도, 시간, 및 가공도 중 적어도 어느 하나를 포함할 수 있다. 상기 가공 도는 단면적 감소율 및 진변형률(True strain)를 포함할 수 있다. 도 2를 참조하면, 본 발명의 일 실시예에서 입력변수 가공단계(IVP)에서 생성된 입력변수들은 평균 0, 분산 1을 만족시키도록 선형 변환될 수 있다. 본 발명의 다른 실시 예에서, 첨가원소량은 원소 구분 없이 전체량의 최소 값이 0, 최대값이 1이 되도록 선형변환될 수 있다. 이와 같은 선형 변환을 통해 인공신경망을 통해 진행되는 기 계학습이 효율적으로 달성될 수 있다. 선형 변환은 자료의 분포 모양을 그대로 유지하면서 데이터를 일정 규칙에 따라 다른 데이터로 바꾸는 것으로, Y＝aX＋b 형식의 일차방정식으로 정의된다. 즉, 어떤 데이터에 상수를 더하거나 빼거나 곱하거나 나누어서 다른 값으로 변환하는 것일 수 있다. 어떤 데이터에서 선형변환에 의하여 새로운 데이터로 변환하였을 때, 변환된 데 이터의 분포는 본래 데이터의 분포와 동일하다. 도 6은 도 2에서 인공신경망 학습단계(ANL)를 확대하여 도시한 것이다. 본 발명의 일 실시예에서 인공신경망 학습단계(ANL)에서 이용되는 인공 신경망은 완전 연결 신경망(FCNN: Fully Connected Neural Network)일 수 있다. 단, 이에 제한되는 것은 아니며, 인공 신경망은 자기 조직화 지도(SOM: Self-Organizing Map), 순환 신경망(RNN: Recurrent Neural Network), 콘볼루션 신경망(CNN: Convolutional Neural Network)일 수 있다. 본 발명의 일 실시예에서, 완전 연결 신경망(FCNN: Fully Connected Neural Network)은 제1 은닉층 및 제2 은 닉층을 포함할 수 있다. 본 발명의 일 실시예에서, 제1 은닉층 및 제2 은닉층 각각은 40개 이상 80개 이하의 뉴 런들을 포함할 수 있다. 제1 은닉층 및 제2 은닉층 각각이 포함하는 뉴런의 개수가 40개 미만인 경우, 학습 능 력이 떨어지게 될 수 있다. 제1 은닉층 및 제2 은닉층 각각이 포함하는 뉴런의 개수가 80개를 초과하는 경우, 학습을 위해 계산하는 시간이 비효율적으로 증가할 수 있다. 단, 완전 연결 신경망이 포함하는 은닉층의 개수 및 은닉층에 포함하는 뉴런들의 개수는 예시적인 것으로, 이에 제한되지 않는다. 본 발명의 일 실시예에서, 상기 뉴런들에 가해지는 활성화 함수(activation function)는 시그모이드(sigmoid) 함수, 쌍곡탄젠트(tanh) 함수, ELU(Exponential Linear Unit) 함수, 및 선형 함수 중 적어도 어느 하나를 포함 할 수 있다. 활성화 함수는 신경망 학습에서, 입력받은 신호를 학습에 이용될 수 있게 출력 신호로 처리하는 함 수를 말한다. 활성화 함수는 입력받은 데이터의 활성화 여부를 설정하며, 활성화에 따라 가중치와 최종 결과에 영향을 미친다. 시그모이드 함수는 입력된 데이터를 0과 1 사이의 값으로 출력하는 비선형 함수로 미분가능한 연속성을 가진 함수일 수 있다. 쌍곡탄젠트 함수는 쌍곡선 사인 함수를 쌍곡선 코사인 함수로 나누어서 만든 함 수일 수 있다. 예를들어, 본 발명의 일 실시예에서 제1 은닉층의 뉴런들 및 제2 은닉층의 뉴런들에는 모두 시그모이드 (sigmoid) 함수가 가해질 수 있다. 본 발명의 일 실시예에서 제1 은닉층의 뉴런들에는 시그모이드(sigmoid) 함수가 가해지고, 제2 은닉층의 뉴런들 에는 ELU(Exponential Linear Unit) 함수가 가해질 수 있다. 이와 같이 제2 은닉층의 뉴런들에 ELU(Exponential Linear Unit) 함수를 가하는 경우, 강도 및 전기 전도도와 같이 양의 값을 갖는 물성치를 학습 하는데 유리할 수 있다. 출력변수 가공단계(OVP)에서는 인공신경망 학습단계(ANL)에서 생성된 출력변수들을 선형변환 할 수 있다. 이와 같은 선형변환을 통해 인공신경망을 통해 학습된 결과물을 효율적으로 활용할 수 있다. 성질 추정단계(PES)에서는 출력변수 가공단계(OVP)에서 가공된 출력변수들을 이용하여 석출경화형 합금의 기계 적 성질 및 전기적 성질을 추정할 수 있으므로, 높은 강도 및 높은 전기 전도도를 가지는 석출경화형 합금(예를 들어, 구리 합금)에 대한 개발을 가속화할 수 있다. 실시 예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구의 범위에 기재된 본 발 명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 또한 본 발명에 개시된 실시 예는 본 발명의 기술 사상을 한정하기 위한 것이 아니고, 하기의 특허 청구의 범위 및 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해 석되어야 할 것이다.부호의 설명 PC: 퍼스널 컴퓨터 SV: 서버"}
{"patent_id": "10-2021-0187606", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기반의 석출경화형 합금 설계 시스템을 예시적으로 도시한 것이다. 도 2는 본 발명의 일 실시예에 따른 인공지능 기반의 석출경화형 합금 설계 시스템에 의해 수행되는 석출경화형 합금 설계방법에 대응되는 모식도이다. 도 3은 도 2에서 조성변수 가공단계를 확대하여 도시한 것이다. 도 4는 도 2에서 공정정보 코드화단계를 확대하여 도시한 것이다. 도 5는 도 2에서 무처리공정 데이터증강 단계를 확대하여 도시한 것이다. 도 6은 도 2에서 인공신경망 학습단계를 확대하여 도시한 것이다."}
