{"patent_id": "10-2014-0091389", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0010237", "출원번호": "10-2014-0091389", "발명의 명칭": "심 운용 방법 및 이를 지원하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이상수"}}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 통신 사업자 네트워크가 제공하는 통신 서비스 연결과 관련한 프로파일이 설치되지 않은 심을 기반으로 연결 가능한 통신 사업자 네트워크를 검색하는 통신 인터페이스;검색된 통신 사업자 네트워크를 기반으로 적어도 하나의 통신 사업자 정보를 수집하는 프로비져닝 매니저;수집된 통신 사업자 정보를 출력하는 디스플레이;를 포함하는 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 프로비져닝 매니저는특정 통신 사업자 항목 선택을 수신하면, 상기 전자 장치 관련 정보를 수집하고, 상기 선택된 통신 사업자 항목에 대응하는 통신 사업자 장치에 상기 수집된 전자 장치 관련 정보를 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 프로비져닝 매니저는 상기 전자 장치의 장치 고유 정보, 심의 심 식별 정보, 프로파일 전송을 지원하는 장치의 서버 식별 정보 중 적어도 하나를 수집하도록 설정된 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 프로비져닝 매니저는상기 심에 기입된 심 식별 정보 또는 상기 서버 식별 정보를 수집하도록 설정된 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서,상기 프로비져닝 매니저는 상기 전자 장치의 장치 고유 정보를 심 관련 정보를 관리하는 관리 서버 장치에 전송하고 상기 관리 서버 장치로부터 상기 심 식별 정보 또는 서버 식별 정보를 수신하도록 설정된 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 2에 있어서,상기 프로비져닝 매니저는상기 통신 사업자 장치가 생성 요청한 프로파일 수신을 제어하는 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 프로비져닝 매니저는상기 심과 상기 서버 식별 정보에 대응하는 프로파일 전송 지원 장치와 세션을 형성하도록 제어하고, 상기 세션공개특허 10-2016-0010237-2-을 통하여 상기 심이 상기 프로파일을 생성한 지원 장치로부터 프로파일을 수신하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서,상기 프로비져닝 매니저는상기 수신된 프로파일을 심에 설치하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 프로비져닝 매니저는상기 전자 장치가 턴-오프 상태에서 턴-온 상태로 변경되는 경우 상기 연결 가능한 통신 사업자 네트워크를 검색하도록 제어하거나, 통신 사업자 변경 요청 수신에 대응하여 상기 연결 가능한 통신 사업자 네트워크를 검색하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 2에 있어서,상기 프로비져닝 매니저는상기 심에 기 설정된 프로파일에 의해 이용 가능한 통신 사업자 정보와 미설치된 프로파일 관련 통신 사업자 항목을 구분하여 출력하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서,상기 프로비져닝 매니저는입력 이벤트에 대응하여 상기 심 또는 심 관련 정보를 관리하는 외부 서버 장치로부터 심 관련 정보를획득하고, 상기 심 관련 정보를 표시하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 프로비져닝 매니저는상기 심 관련 정보에 대응하는 텍스트 정보를 출력하거나, 상기 심 관련 정보에 대응하는 지정된 코드 정보로출력하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "적어도 하나의 통신 사업자 네트워크가 제공하는 통신 서비스 연결과 관련한 프로파일이 설치되지 않은 심을 기반으로 연결 가능한 통신 사업자 네트워크를 검색하는 동작;검색된 통신 사업자 네트워크를 기반으로 적어도 하나의 통신 사업자 정보를 수집하는 동작;수집된 통신 사업자 정보를 출력하는 동작;을 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,특정 통신 사업자 항목 선택을 수신하는 동작;상기 선택 수신에 대응하여 상기 전자 장치 관련 정보를 수집하는 동작;상기 선택된 통신 사업자 항목에 대응하는 통신 사업자 장치에 상기 수집된 전자 장치 관련 정보를 전송하는 동공개특허 10-2016-0010237-3-작;을 더 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서,상기 전자 장치 관련 정보를 수집하는 동작은장치 고유 정보, 심 식별 정보, 프로파일 전송을 지원하는 장치의 서버 식별 정보 중 적어도 하나를 수집하는동작;을 포함하는"}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서,상기 전자 장치 관련 정보를 수집하는 동작은상기 심에 기입된 심 식별 정보 또는 상기 서버 식별 정보를 수집하는 동작;을 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 15에 있어서,상기 전자 장치 관련 정보를 수집하는 동작은 상기 전자 장치의 장치 고유 정보를 심 관련 정보를 관리하는 관리 서버 장치에 전송하는 동작;상기 관리 서버 장치로부터 상기 심 식별 정보 또는 서버 식별 정보를 수신하는 동작;을 더 포함하는 심 운용방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 14에 있어서,상기 통신 사업자 장치가 생성 요청한 프로파일을 수신하는 동작;을 더 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 18에 있어서,상기 심과 상기 서버 식별 정보에 대응하는 프로파일 전송 지원 장치와 세션을 형성하는 동작;상기 세션을 통하여 상기 심이 상기 프로파일을 생성한 지원 장치로부터 프로파일을 수신하는 동작;을 더 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 18에 있어서,상기 수신된 프로파일을 심에 설치하는 동작;을 더 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 13에 있어서,상기 검색하는 동작은전자 장치가 턴-오프 상태에서 턴-온 상태로 변경되는 경우 상기 연결 가능한 통신 사업자 네트워크를 검색하는동작;통신 사업자 변경 요청 수신에 대응하여 상기 연결 가능한 통신 사업자 네트워크를 검색하는 동작; 중 어느 하나를 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 13에 있어서,공개특허 10-2016-0010237-4-상기 출력하는 동작은상기 심에 기 설정된 프로파일에 의해 이용 가능한 통신 사업자 정보와 미설치된 프로파일 관련 통신 사업자 항목을 구분하여 출력하는 동작;을 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "청구항 13에 있어서,입력 이벤트에 대응하여 상기 심 또는 심 관련 정보를 관리하는 외부 서버 장치로부터 심 관련 정보를 획득하는동작;상기 심 관련 정보를 표시하는 동작;을 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "청구항 23에 있어서,상기 표시하는 동작은상기 심 관련 정보에 대응하는 텍스트 정보를 출력하는 동작;상기 심 관련 정보에 대응하는 지정된 코드 정보로 출력하는 동작; 중 적어도 하나를 포함하는 심 운용 방법."}
{"patent_id": "10-2014-0091389", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "적어도 하나의 통신 사업자 네트워크가 제공하는 통신 서비스 연결과 관련한 프로파일이 설치되지 않은 심을 기 반으로 연결 가능한 통신 사업자 네트워크를 검색하는 통신 인터페이스, 검색된 통신 사업자 네트워크를 기반으 로 적어도 하나의 통신 사업자 정보를 수집하는 프로비져닝 매니저, 수집된 통신 사업자 정보를 출력하는 디스플 레이를 포함하는 전자 장치가 개시된다. 이 외에도 명세서를 통해 파악되는 다양한 실시 예가 가능하다."}
{"patent_id": "10-2014-0091389", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 전자 장치의 심 운용에 관련된다."}
{"patent_id": "10-2014-0091389", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 기존의 전자 장치들은, 통신 기능을 지원하고 있다. 전자 장치는 통신 기능을 지원하기 위하여 심 (SIM: Subscriber Identification Module)을 이용하고 있다. 심은 전자 장치의 일정 영역에 탑재되고, 통신 사 업자에 의해 인증된 후 운용될 수 있다."}
{"patent_id": "10-2014-0091389", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 심은 별도의 심 제조사가 제조하여 전자 장치 제조사에 납품할 수 있다. 전자 장치 제조사는 납품된 심 을 전자 장치에 탑재하여 특정 통신 사업자에 판매할 수 있다. 통신 사업자는 특정 사용자가 전자 장치 구매를 희망하는 경우, 전자 장치의 통신 서비스 기능 운용과 관련한 프로파일을 탑재하여 해당 사용자에게 판매할 수 있다. 상술한 전자 장치 유통 구조에서 보면, 사용자가 별도로 전자 장치를 획득하거나 또는 통신 사업자와 무관하게 전자 장치를 획득(예: 오픈 마켓에서 구매)하는 경우 특정 통신 사업자 관련 프로파일 탑재가 불가능하여, 전자 장치의 통신 서비스 이용이 불가능한 문제가 있었다. 본 발명의 다양한 실시 예들은, 사용자 희망에 따라 통신 서비스를 제공받고자 하는 통신 사업자를 결정할 수 있도록 하는 심 운용 방법 및 이를 지원하는 전자 장치를 제공함에 있다. 본 발명의 다양한 실시 예들은 사용자 희망에 따라 통신 사업자 변경이 가능한 심 운용 방법 및 이를 지원하는 전자 장치를 제공함에 있다."}
{"patent_id": "10-2014-0091389", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따른 전자 장치는, 적어도 하나의 통신 사업자 네트워크가 제공하는 통신 서비스 연결과 관련한 프로파일이 설치되지 않은 심을 기반으로 연결 가능한 통신 사업자 네트워크를 검색하는 통신 인 터페이스, 검색된 통신 사업자 네트워크를 기반으로 적어도 하나의 통신 사업자 정보를 수집하는 프로비져닝 매니저, 수집된 통신 사업자 정보를 출력하는 디스플레이를 포함할 수 있다."}
{"patent_id": "10-2014-0091389", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, 다양한 실시 예들은 사용자 희망에 따라 통신 사업자를 선택하거나 변경할 수 있도록 지원한다."}
{"patent_id": "10-2014-0091389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 개시를 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 개시의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대 해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, “가진다,”“가질 수 있다,”“포함한다,” 또는“포함할 수 있다”등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서,“A 또는 B,”“A 또는/및 B 중 적어도 하나”, 또는 “A 또는/및 B 중 하나 또는 그 이상” 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, “A 또는 B”, “ A 및 B 중 적 어도 하나”, 또는 “ A 또는 B 중 적어도 하나”는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 다양한 실시 예에서 사용된 “제1,”“제2,”“첫째,”또는“둘째,”등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관 없이 수식할 수 있고, 해당 구성 요소들을 한정하지 않는다. 상기 표현들은 한 구성요소 를 다른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들면, 제 1 사용자기기와 제 2 사용자기기는, 순서 또 는 중요도와 무관하게, 서로 다른 사용자기기를 나타낼 수 있다. 예를 들면, 본 개시의 권리범위를 벗어나지 않 으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 “~하도록 구성된(또는 설정된)(configured to)”은 상황에 따라, 예를 들면, “~에 적합한(suitable for),” “~하는 능력을 가지는(having the capacity to),” “~하도록 설계된(designed t o),” “~하도록 변경된(adapted to),” “~하도록 만들어진(made to),”또는 “~를 할 수 있는(capable of)” 과 바꾸어 사용될 수 있다. 용어 “~하도록 구성(또는 설정)된”은 하드웨어적으로 “특별히 설계된 (specifically designed to)”것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는,“~하도록 구성된 장치”라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께“~할 수 있는” 것을 의미할 수 있다. 예를 들면, 문구 “A, B, 및 C를 수행하도록 구성(또는 설정)된 프로세서”는 해당 동작을 수행하기 위한 전용프로세서(예: 임베이디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함 으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할"}
{"patent_id": "10-2014-0091389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시의 기술분야에서 통상 의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경 우에 따라서, 본 문서에서 정의된 용어일지라도 본 개시의 실시 예들을 배제하도록 해석될 수 없다. 본 개시의 다양한 실시 예들에 따른 전자장치는, 예를 들면, 전자장치는 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동전화기(mobile phone), 화상전화기, 전자북 리더기(e-book reader), 데스 크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블장치(wearabledevice)(예:스마트안경, 머리 착용형 장치(head-mounted-device(HMD)), 전자의복, 전자팔찌, 전자목걸이, 전자 앱세서리(appcessory),전자문신, 스 마트 미러, 또는 스마트와치(smartwatch))중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자장치는 스마트 가전제품(smart home appliance)일 수 있다. 스마트 가전제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁 기, 공기청정기, 셋톱박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널(security control panel), TV 박스(예: 삼성 HomeSync™, 애플 TV™, 또는 구글 TV™), 게임콘솔 (예: Xbox™, PlayStation™), 전자사전, 전자키, 캠코더(camcorder), 또는 전자액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종의료기기(예:각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation)장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트 (infotainment) 장치, 선박용 전자장비(예:선박용 항법장치, 자이로 콤파스 등), 항공전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit),산업용 또는 가정용로봇, 금융기관의 ATM(automatic teller’s machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things)(예: 전구, 각종 센서, 전기 또는 가 스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수 탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자장치 는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 개시의 실시 예에 따른 전자장치는 전술한 기기들에 한정되지 않으며, 기술 발 전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자장치가 설명된다. 본 문서에서, 사용자라는 용어는 전 자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 다양한 실시 예에 따른 심 이용과 관련한 전자 장치 운용 환경을 개략적으로 도시한다. 도 1을 참조하면, 다양한 실시 예에 따른 전자 장치의 운용 환경은 전자 장치 100, 네트워크 162, 통신 사업자 장치 200, 프로파일 생성 지원 장치 210, 프로파일 전송 지원 장치 300을 포함할 수 있다. 다양한 실시 예에 따 르면, 통신 사업자 장치 200과 프로파일 생성 지원 장치 210은 하나의 장치로 통합될 수 있다. 또는 통신 사업 자 장치 200, 프로파일 생성 지원 장치 210, 프로파일 전송 지원 장치 300은 하나의 장치로 통합될 수 있다. 또 는 프로파일 생성 지원 장치 210과 프로파일 전송 지원 장치 300은 하나의 장치로 통합될 수 있다. 각 구성들이 통합되는 경우, 이하에서 설명하는 각 장치들의 기능이 하나의 통합된 장치에서 제공될 수 있다.이러한 구성의 전자 장치 운용 환경에서 전자 장치 100은 임베이디드 형태로 장착된 심(SIM: subscriber Identification Module 또는embedded SIM(eSIM), 또는 eUICC)의 심 식별 정보(EID: eUICC ID), 프로파일 전송 지원 장치 300과 관련한 서버 식별 정보(SRID: subscription manager secure routing(SM-SR) ID)를 수집할 수 있다. 예컨대, 전자 장치 100은 장착된 심에 저장된 정보 또는 전자 장치 제조사 서버 장치 또는 심 제조사 서 버 장치 중 적어도 하나로부터 심 식별 정보 및 서버 식별 정보(예: 프로파일 전송 지원 장치 300 접속과 관련 한 서버 식별 정보) 중 최소 하나를 수집할 수 있다. 전자 장치 100은 획득된 심 식별 정보 및 서버 식별 정보와 장치 고유 식별 정보(예: IMEI or Serial Number) 중 최소 하나를 통신 사업자에 제공할 수 있다. 전자 장치 100은 통신 사업자에게 제공한 정보를 이용하여 프로 파일 생성 지원 장치 210이 생성한 프로파일을 프로파일 전송 지원 장치 300을 통하여 수신 및 설치할 수 있다. 상술한 동작에서 전자 장치 100은 주변 네트워크 스캔을 수행하여 이용 가능한 통신 사업자 네트워크를 검색하 고, 상술한 식별 정보들의 전송(예: IP 네트워크를 통한 전송)을 기반으로 해당 통신 사업자 네트워크를 이용할 수 있는 프로파일을 수신 및 설치할 수 있다. 상기 프로파일은 전자 장치 100이 통신 사업자 네트워크에 접속하 여 정상적인 통신 서비스 이용에 필요한 정보(예: 프로토콜, 프로그램, 명령어, 인증키, 식별자 등)를 포함할 수 있다. 상술한 전자 장치 운용 환경에서 네트워크 162는 전자 장치 100, 통신 사업자 장치 200, 프로파일 생성 지원 장 치 210, 프로파일 전송 지원 장치 300 간의 신호 송수신을 지원할 수 있다. 예컨대, 네트워크 162는 특정 통신 사업자가 통신 서비스 지원과 관련하여 구축한 네트워크일 수 있다. 예를 들어, 네트워크 162는 SKT, LGU, KT, Verizon, Orange 등의 통신 사업자가 구축한 네트워크일 수 있다. 다양한 실시 예에 따르면, 네트워크 162는 전자 장치 100, 통신 사업자 장치 200, 프로파일 생성 지원 장치 210, 프로파일 전송 지원 장치 300 간의 신호 전송이 가능한 IP 네트워크를 포함할 수 있다. 한 실시 예에 따르 면, 네트워크 162는 전자 장치 100의 장치 고유 정보(또는 장치 식별 정보) 또는 심 식별 정보를 특정 네트워크 (예: IP 네트워크)를 통해 통신 사업자 장치 200에 전달할 수 있다. 다양한 실시 예에 따르면, 네트워크 162는 통신 사업자 장치 200과 제조사 서버 장치 간의 통신 채널 형성을 지 원할 수 있다. 다양한 실시 예에 따르면, 네트워크 162는 통신 사업자 장치 200과 프로파일 생성 지원 장치 210 간의 통신 채널 형성, 프로파일 생성 지원 장치 210과 프로파일 전송 지원 장치 300 간의 통신 채널 형성, 또는 통신 사업자 장치 200과 전자 장치 100 간의 통신 채널 형성 중 적어도 하나를 지원할 수 있다. 통신 사업자 장치 200은 제1 네트워크(예: 셀룰러 네트워크)와 통신 채널을 형성할 수 있는 통신 모듈, 셀룰러 네트워크와 연결된 사업자 서버 장치, 제2 네트워크(예: IP 네트워크)와 통신 채널을 형성할 수 있는 통신 모듈 을 포함할 수 있다. 이러한 통신 사업자 장치 200은 통신 서비스 운용과 관련한 등록(통신 서비스 가입을 희망 하는 사용자들의 가입 처리)을 IP 네트워크를 통하여 지원할 수 있다. 통신 사업자 장치 200은 통신 서비스에 가입한 사용자들의 서비스 지원과 관련한 다양한 전자 장치 제어를 수행할 수도 있다. 통신 사업자 장치 200은 셀룰러 네트워크 또는 IP 네트워크 중 적어도 하나를 통해 접속할 수 있는 통신 채널을 제공할 수 있다. 통신 사업자 장치 200은 예컨대, 미등록 심을 가진 전자 장치 100의 접속 채널을 IP 네트워크 를 통해 제공할 수 있다. 상기 접속 채널은 미등록된 심의 등록과 관련하여 통신 사업자 장치 200이 제공하는 통신 채널(예: 미등록 심에 배정한 임시 전화 번호를 기반으로 형성한 통신 채널)을 포함할 수 있다. 한 실시 예에 따르면, 통신 사업자 장치 200은 전자 장치 100으로부터 장치 고유 정보(또는 추가적으로 대체적 으로 심 식별 정보)를 수신할 수 있다. 또한 통신 사업자 장치 200은 전자 장치 100으로부터 프로파일을 수신할 프로파일 전송 지원 장치 300의 서버 식별 정보를 수신할 수 있다. 통신 사업자 장치 200은 서버 식별 정보, 장 치 고유 정보, 심 식별 정보 및 전자 장치 100의 통신 서비스 등록에 필요한 정보 중 최소 하나를 프로파일 생 성 지원 장치 210에 제공할 수 있다. 프로파일 생성 지원 장치 210은 통신 사업자 장치 200이 제공한 전자 장치 관련 정보(예: 장치 고유 정보, 심 식별 정보, 서버 식별 정보 등)의 최소 일부를 기반으로 전자 장치 100의 통신 서비스 운용과 관련한 프로파일 을 생성할 수 있다. 프로파일 생성 지원 장치 210이 생성한 프로파일은 보안과 관련하여 암호화될 수 있다. 프 로파일 생성 지원 장치 210은 생성된 프로파일 전송과 관련한 요청을 수신하고 이를 상기 획득된 서버 식별 정 보에 대응하는 프로파일 전송 지원 장치 300에 전달할 수 있다. 프로파일 생성 지원 장치 210은 프로파일을 프 로파일 전송 지원 장치 300을 통해 전자 장치 100에 전달할 수 있다. 프로파일 전송 지원 장치 300은 프로파일 생성 지원 장치 210 요청에 대응하여 전자 장치 100과 프로파일 전송 과 관련한 채널을 형성할 수 있다. 한 실시 예에 따르면, 프로파일 전송 지원 장치 300은 프로파일을 IP 네트워 크를 기반으로 전자 장치 100에 전송할 수 있다. 상기 프로파일 전송 지원 장치 300은 고유 서버 식별 정보를 가질 수 있다. 특정 심은 고유 서버 식별 정보에 대응하는 프로파일 전송 지원 장치 300을 통해서 수신된 프로 파일을 설치할 수 있다. 프로파일 전송 지원 장치 300과 관련한 서버 식별 정보는 심 제조사에서 생성 및 운용 하거나, 전자 장치 제조사에서 운용할 수 있다. 전자 장치 100은 특정 통신 모듈(예: 셀룰러 통신 모듈)을 이용하여 주변에 어떠한 통신 사업자 네트워크가 존 재하는지 확인할 수 있다. 예컨대, 전자 장치 100은 통신 모듈을 이용한 스캔 동작을 수행할 수 있다. 전자 장 치 100은 스캔 동작에 따라 획득한 통신 사업자 네트워크 정보를 기반으로 통신 사업자 선택 기능을 제공할 수 있다. 전자 장치 100은 통신 사업자 선택과 관련한 이벤트가 발생하면, IP 네트워크(또는 임시적으로 사용 가능 한 셀룰러 네트워크)를 기반으로 선택된 정보에 대응하는 통신 사업자 장치 200에 접속할 수 있다. 전자 장치 100은 접속된 통신 사업자 장치 200에 장치 고유 정보 및 심 식별 정보 중 최소 하나를 제공할 수 있다. 전자 장치 100은 통신 사업자 장치 200으로부터 해당 통신 서비스 이용과 관련한 프로파일을 수신하고, 이를 심에 설 치할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100은 하나의 통신 사업자 네트워크만 검색되는 경우, 해당 통신 사업자 네트워크와 관련한 통신 사업자 장치 200에 자동(또는 사용자 입력에 따른 수동) 접속(예: IP 네트워크 또는 임 시 접속 가능한 셀룰러 네트워크를 이용한 접속)하고, 장치 고유 정보, 심 식별 정보, 서버 식별 정보 등을 전 송할 수도 있다. 도 1을 참조하면, 상기 전자 장치 100은 버스 110, 프로세서 120, 메모리 130, 입출력 인터페이스 140, 디스플 레이 150, 통신 인터페이스 160, 프로비져닝 매니저(provisioning manager) 170, 심 180을 포함할 수 있다. 다 양한 실시 예에 따르면, 프로비져닝 매니저 170은 프로세서 120, 통신 인터페이스 160을 포함하는 형태로 마련 될 수도 있다. 상기 버스 110은 전술한 구성요소들을 서로 연결하고, 전술한 구성요소들 간의 통신(예: 제어 메시지, 입력 이 벤트, 데이터 등)을 전달하는 회로일 수 있다. 예컨대, 버스 110은 입출력 인터페이스 140에서 입력된 입력 신 호를 프로세서 120 또는 프로비져닝 매니저 170 중 적어도 하나에 전달할 수 있다. 버스 110은 예컨대, 전자 장 치 100의 장치 고유 정보 또는 심 식별 정보를 디스플레이 150에 전달할 수 있다. 버스 110은 통신 인터페이스 160에 장치 고유 정보 또는 심 식별 정보를 전달할 수 있다. 상기 프로세서 120은, 예를 들면, 상기 버스 110을 통해 전술한 다른 구성요소들(예: 상기 메모리 130, 상기 입 출력 인터페이스 140, 상기 디스플레이 150, 상기 통신 인터페이스 160, 또는 상기 프로비져닝 매니저 170 등) 로부터 명령을 수신할 수 있다. 프로세서 120은 수신된 명령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실행할 수 있다. 이러한 프로세서 120은 프로비져닝 매니저 170을 포함하는 형태로 마련되거나 또는 프 로비져닝 매니저 170과 독립적인 형태로 마련되고, 버스 110을 기반으로 또는 직접적으로 통신을 수행하는 형태 로 마련될 수 있다. 또는 프로세서 120은 프로비져닝 매니저 170의 구성으로 배치될 수도 있다. 프로세서 120은 다양한 실시 예에 따른 심 180의 프로파일 설치와 관련한 신호 처리를 수행할 수 있다. 예컨대, 프로세서 120은 장치 고유 정보 및 심 관련 정보(예: 심 식별 정보 또는 서버 식별 정보 중 적어도 하나) 중 최소 하나를 포함 하는 전자 장치 관련 정보 수집과 관련한 신호 처리, 전자 장치 관련 정보의 전송 처리, 프로파일 수신 제어 및 설치 제어에 필요한 신호 처리를 수행할 수 있다. 상기 메모리 130은, 상기 프로세서 120 또는 다른 구성요소들(예: 상기 입출력 인터페이스 140, 상기 디스플레 이 150, 상기 통신 인터페이스 160, 또는 상기 프로비져닝 매니저 170 등)로부터 수신되거나 상기 프로세서 120 또는 다른 구성요소들에 의해 생성된 명령 또는 데이터를 저장할 수 있다. 상기 메모리 130은, 전자 장치 100의 장치 고유 정보 예컨대 IMEI 135(또는 Serial Number)를 저장할 수 있다. IMEI 135는 심 식별 정보 또는 서버 식별 정보 중 적어도 하나의 획득을 위해 이용될 수 있다. IMEI 135는 프로파일 생성 요청과 관련하여 통신 사 업자 장치 200에 제공될 수 있다. 메모리 130은 예를 들면, 커널 131, 미들웨어 132, 어플리케이션 프로그래밍 인터페이스(API: application programming interface) 133 또는 어플리케이션 134 등의 프로그래밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래밍 모듈들은 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이 상의 조합으로 구성될 수 있다. 상기 커널 131은 나머지 다른 프로그래밍 모듈들, 예를 들면, 상기 미들웨어 132, 상기 API 133 또는 상기 어플 리케이션 134에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 상기 버스 110, 상기 프로 세서 120 또는 상기 메모리 130 등)을 제어 또는 관리할 수 있다. 또한, 상기 커널 131은 통신 사업자 네트워크검색 기능, 상기 전자 장치 관련 정보 수집과 전송 및 프로파일 처리와 관련하여 상기 미들웨어 132, 상기 API 133 또는 상기 어플리케이션 134에서 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어 132는 상기 API 133 또는 상기 어플리케이션 134가 상기 커널 131과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어 132는 상기 어플리케이션 134로부터 수신된 작업 요청들과 관련하여, 예를 들면, 상기 어플리케이션 134 중 적어도 하나의 어플리케이션에 상기 전자 장치 100의 시스템 리소스(예: 상기 버스 110, 상기 프로세서 120 또는 상기 메모리 130 등)를 사용할 수 있는 우선순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또는 로드 밸런싱)을 수행할 수 있다. 상기 API 133은 상기 어플리케이션 134가 상기 커널 131 또는 상기 미들웨어 132에서 제공되는 기능을 제어하기 위한 인터페이스일 수 있다. API 133은 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 상기 어플리케이션 134는 전자 장치 100 운용과 관련한 적어도 하나의 어플리케이션을 포함할 수 있다. 예컨대, 어플리케이션 134는 카메라 기능, 음악 재생 기능, 동영상 재생 기능, 통신 기능, 녹음 기능, 게임 기능, 헬스 케어 기능 등과 관련한 어플리케이션을 포함할 수 있다. 다양한 실시 예에 따르면, 어플리케이션 134는 통신 사 업자 선택 기능과 관련한 어플리케이션을 포함할 수 있다. 통신 사업자 선택 기능과 관련한 어플리케이션은 선 택 가능한 통신 사업자 검색과 관련한 프로그램(예: 적어도 하나의 명령어, 명령어 셋, 적어도 하나의 명령어들 로 구성된 프로그램 루틴, 탬플릿, 구문 등을 포함하는 데이터 집합체), 전자 장치 관련 정보(예: 장치 고유 정 보, 심 식별 정보, 서버 식별 정보) 획득과 관련한 프로그램, 전자 장치 관련 정보를 기반으로 선택된 통신 사 업자의 프로파일 수신 및 설치 실행과 관련한 프로그램 등을 포함할 수 있다. 상기 입출력 인터페이스 140은, 입출력 장치(예: 키 버튼, 터치키, 센서, 키보드 또는 터치스크린)를 통하여 사 용자로부터 입력된 명령 또는 데이터를, 예를 들면, 상기 버스 110을 통해 상기 프로세서 120, 상기 메모리 130, 상기 통신 인터페이스 160, 또는 상기 프로비져닝 매니저 170에 전달할 수 있다. 다양한 실시 예에 따르면, 입출력 인터페이스 140은 오디오 처리와 관련한 기능을 수행할 수 있다. 이와 관련하여 입출력 인터페 이스 140은 스피커 및 마이크 중 적어도 하나를 단수 개 또는 복수 개 포함할 수 있다. 한 실시 예에 따르면, 입출력 인터페이스 140은 특정 통신 사업자 네트워크를 통한 통신 서비스 지원과 관련하여 프로파일이 필요한지 (예: 프로파일이 미설치된 상태인지)에 대한 안내 정보를 출력할 수 있다. 입출력 인터페이스 140은 디스플레이 150에 표시된 특정 통신 사업자 항목 선택과 관련한 입력 이벤트를 생성하여 프로비져닝 매니저 170에 제공할 수 있다. 입출력 인터페이스 140은 선택 가능한 통신 사업자 정보를 출력할 수 있다. 상기 디스플레이 150은 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)를 표시할 수 있다. 예컨대, 디스플레이 150은 락 스크린, 대기 화면 등을 출력할 수 있다. 다양한 실시 예에 따르면, 디스플레이 150은 통 신 사업자 선택 기능과 관련한 메뉴나 아이콘 또는 팝업창을 출력할 수 있다. 디스플레이 150은 선택 가능한 통 신 사업자 정보를 출력할 수 있다. 디스플레이 150은 특정 통신 사업자 선택에 대응하여 프로파일 수신 및 설치 와 관련한 화면을 출력할 수 있다. 이 동작에서 디스플레이 150은 통신 사업자 네트워크 연결에 필요한 장치 고 유 정보, 심 식별 정보, 서버 식별 정보 등을 출력할 수 있다. 상기 통신 인터페이스 160은 상기 전자 장치 100과 외부 장치(예: 통신 사업자 장치 200, 프로파일 생성 지원 장치 210, 프로파일 전송 지원 장치 300중 적어도 하나) 간의 통신을 연결할 수 있다. 예를 들면, 상기 통신 인 터페이스 160은 무선 통신 또는 유선 통신을 통해서 네트워크 162(예: 통신 사업자 장치 200이 연결된 또는 운 용하는 네트워크)에 연결되어 상기 외부 장치와 통신할 수 있다. 상기 무선 통신은, 예를 들어, cellular 통신 (예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 포함할 수 있다. 또는 상기 무선 통신은 Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication) 을 포함할 수 도 있다. 상기 유선 통신은, 예를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS- 232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 상기 통신 인터페이스 160은 심 180과 직접적으로 연결될 수 있다. 통신 인터페이스 160은 프로비져닝 매니저 170의 제어 신호와 데이터를 심 180에 전달할 수 있다. 또한 통신 인터페이스 160은 프로비져닝 매니저 170 요 청에 대응하여 심 180에 저장된 심 식별 정보 또는 서버 식별 정보(예 프로파일을 제공하는 프로파일 전송 지원 장치 300의 주소 정보) 중 적어도 하나를 프로비져닝 매니저 170에 제공할 수 있다. 통신 인터페이스 160은 심 180의 운영 체제에 대응하여 프로파일 전송 지원 장치 300과 통신 채널을 형성하고, 특정 통신 사업자의 통신 서비스 이용과 관련한 프로파일을 수신할 수 있다. 통신 인터페이스 160은 수신한 프로파일을 심 180에 전달할 수 있다. 다양한 실시 예에 따르면, 통신 인터페이스 160은 다양한 통신 사업자의 네트워크를 스캔할 수 있는 적어도 하 나의 통신 모듈을 포함할 수 있다. 예컨대, 통신 인터페이스 160은 제1 통신 사업자 네트워크와 연결할 수 있는 제1 통신 모듈, 제2 통신 사업자 네트워크와 연결할 수 있는 제2 통신 모듈 등을 포함할 수 있다. 추가적으로 또는 대체적으로 통신 인터페이스 160은 셀룰러 통신이 가능한 보다 다양한 통신 모듈을 더 포함할 수도 있다. 또는 통신 인터페이스 160은 복수의 통신 사업자 네트워크를 스캔할 수 있는 하나의 통신 모듈을 포함할 수도 있다. 다양한 실시 예에 따르면, 통신 인터페이스 160은 전자 장치 관련 정보를 통신 사업자 장치 200에 전송할 수 있는 IP 네트워크와 연결되는 통신 모듈을 포함할 수 있다. 심 180은 예컨대 전자 장치 100에 임베이디드 형태로 삽입될 수 있다. 또는 심 180은 착탈 가능하도록 마련되어 전자 장치 100에 형성된 슬롯에 삽입될 수도 있다. 다양한 실시 예에 따른 심 180은 통신 서비스 운용과 관련하 여 미등록 상태로 전자 장치 100에 장착될 수 있다. 또는 심 180은 통신 서비스 운용과 관련한 프로파일이 미설 치된 상태로 전자 장치 100에 장착될 수 있다. 심 180은 프로파일 전송 지원 장치 300을 통해 통신 서비스 이용 을 위해 필요한 프로파일을 수신 및 설치할 수 있다. 심 180은 통신 인터페이스 160을 통해 프로비져닝 매니저 170 또는 프로세서 120에 연결될 수 있다.심 180은 제조사의 정책에 따라 심 식별 정보(EID), 서버 식별 정보 (SRID)를 저장할 수 있다. 또는 심 180은 심 식별 정보(EID) 또는 서버 식별 정보(SRID) 중 최소 하나를 저장하 지 않은 상태로 전자 장치 100에 탑재될 수도 있다. 상술한 동작 처리와 관련하여 심 180은 프로파일 설치와 관 련한 심 운영 체제, 보안 처리 도메인 모듈(ISD-R), 프로파일 관리 모듈(ISD-P)을 포함할 수 있다. 보안 처리 도메인 모듈은 프로비져닝 매니저 170 요청에 따라 지정된 서버 식별 정보에 대응하는 프로파일 전송 지원 장치 300과 세션을 형성할 수 있다. 보안 처리 도메인 모듈은 세션을 통해 프로파일을 수신하고, 수신된 프로파일의 설치를 수행할 수 있다. 이 동작과 관련하여, 보안 처리 도메인 모듈은 특정 프로파일 운용과 관련한 프로파일 관리 모듈을 생성하고, 수신된 프로파일의 설치를 수행할 수 있다. 프로비져닝 매니저 170은 전자 장치 100의 통신 사업자 선택 기능 및 프로파일 수신 및 설치와 관련한 제어를 수행할 수 있다. 이와 관련하여, 프로비져닝 매니저 170은 통신 인터페이스 160을 제어하여 선택 가능한 통신 사업자를 검색할 수 있다. 프로비져닝 매니저 170은 검색 결과를 출력하고, 통신 사업자가 선택되면, 선택된 통 신 사업자 항목에 대응하는 통신 사업자 장치 200에 전자 장치 관련 정보를 전달할 수 있다. 프로비져닝 매니저 170은 지정된 프로파일 전송 지원 장치 300과 세션 형성을 심 180에 요청하여 프로파일 설치를 지원할 수 있다. 다양한 실시 예에 따르면, 프로비져닝 매니저 170은 통신 사업자 선택 화면을 제공한 후, 특정 통신 사업자가 선택되면, 심 180에 심 관련 정보(예: EID, SRID)가 존재하는지 확인할 수 있다. 프로비져닝 매니저 170은 심 관련 정보가 존재하면, 이를 디스플레이 150에 출력하도록 제어할 수 있다. 다양한 실시 예에 따르면, 프로비져 닝 매니저 170은 심 관련 정보가 심 180에 존재하지 않는 경우 디스플레이 150에 장치 고유 정보(예: IMEI or Serial number) 획득을 요청하는 정보를 출력하도록 제어할 수 있다. 예컨대, 프로비져닝 매니저 170은 장치 고 유 정보를 입력할 수 있는 입력창 출력을 제어하거나, 카메라를 활성화하여 장치 고유 정보에 대응하여 전자 장 치 100에 프린팅된 코드 정보(예: 바코드 또는 QR 코드 등) 획득을 요청할 수 있다. 예컨대, 사용자는 배터리 커버 등에 배치된 장치 고유 정보에 대응하는 코드 정보를 카메라를 이용하여 촬영할 수 있다. 프로비져닝 매니 저 170은 장치 고유 정보가 수집되면, 해당 정보를 제조사 서버 장치에 제공하여 심 관련 정보를 획득할 수 있 다. 이 동작에서 프로비져닝 매니저 170은 코드 정보를 해석할 수 있는 알고리즘을 포함하고, 코드 정보를 텍스 트 정보로 변환한 후 제조사 서버 장치에 제공할 수 있다. 다양한 실시 예에 따르면, 통신 사업자 장치 200이 제조사 서버 장치와 연동되는 경우, 프로비져닝 매니저 170은 장치 고유 정보를 통신 사업자 장치 200에 전송할 수도 있다. 도 2는 다양한 실시 예에 따른 프로비져닝 매니저의 일예를 도시한다. 도 2를 참조하면, 프로비져닝 매니저 170은 정보 표시 모듈 171, 정보 수집 모듈 173, 프로파일 처리 모듈 175 를 포함할 수 있다. 정보 표시 모듈 171은 통신 사업자 선택 기능과 관련한 정보 수집 및 출력을 처리할 수 있다. 예컨대, 정보 표 시 모듈 171은 전자 장치 100이 턴-오프 상태에서 턴-온 상태로 변경되는 경우, 등록된 통신 사업자 네트워크와 관련한 프로파일이 심 180에 존재하는지 확인할 수 있다. 정보 표시 모듈 171은 심 180에 특정 통신 사업자 네 트워크와 관련한 프로파일이 존재하지 않는 경우 연결 가능한 통신 사업자 네트워크가 존재하는지 확인(예: 통 신 인터페이스 160을 제어하여 전자 장치 100 주변에서 검색되는 통신 사업자 네트워크 검색)할 수 있다. 정보 표시 모듈 171은 연결 가능한 적어도 하나의 통신 사업자 네트워크가 검색되면, 검색 결과를 기반으로 통신 사 업자 선택 화면을 디스플레이 150에 출력할 수 있다. 다양한 실시 예에 따르면, 정보 표시 모듈 171은 심 180에 특정 통신 사업자 관련 프로파일이 존재하더라도, 연 결 가능한 통신 사업자 네트워크를 검색할 수 있다. 이와 관련하여, 정보 표시 모듈 171은 통신 사업자 선택 기 능을 실행할 메뉴 또는 아이콘을 제공하고, 해당 기능 실행이 요청되면 통신 사업자 네트워크 검색을 수행할 수 있다. 다양한 실시 예에 따르면, 정보 표시 모듈 171은 전자 장치 100의 상태 변경(예: 턴-오프 상태에서 턴-온 상태로 변경) 시 자동으로 통신 사업자 네트워크 검색을 수행할 수도 있다. 다양한 실시 예에 따르면, 정보 표시 모듈 171은 특정 통신 사업자 장치 200의 등록(예: 특정 통신 사업자 관련 프로파일 설치)과 관련한 화면을 출력할 수 있다. 정보 표시 모듈 171은 통신 사업자 선택 화면을 제공하고, 디 스플레이 150에 표시된 통신 사업자 항목들 중 특정 항목이 선택되면, 장치 고유 정보, 심 식별 정보, 서버 식 별 정보 등의 수집을 정보 수집 모듈 173에 요청할 수 있다. 정보 표시 모듈 171은 전자 장치 관련 정보(예: 장 치 고유 정보, 심 식별 정보, 프로파일 전송 지원 장치 300의 서버 식별 정보 중 적어도 하나)가 수집되면, 해 당 정보 출력을 수행할 수 있다. 정보 표시 모듈 171은 서버 식별 정보 수집과 관련하여 심 제조사가 운용하는 서버 장치 접속 화면, 또는 서버 식별 정보를 제공할 수 있는 전자 장치 제조사가 운용하는 서버 장치 접속 화 면을 제공할 수 있다. 정보 수집 모듈 173은 정보 표시 모듈 171로부터 정보 수집이 요청되면, 전자 장치 관련 정보(예: 장치 고유 정 보, 심 식별 정보, 서버 식별 정보)를 수집할 수 있다. 예컨대, 정보 수집 모듈 173은 전자 장치 100의 메모리 130에 저장된 장치 고유 정보(예: IMEI, Serial Number 등)를 수집할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100의 장치 고유 정보는 전자 장치 100의 케이스에 프린팅되거나 각인되거나 또는 별도의 스티커에 프린팅 되어 부착될 수 있다. 장치 고유 정보가 메모리 130에 저장되지 않고 케이스에 배치되는 경우, 정보 수집 모듈 173은 장치 고유 정보 획득을 위한 다양한 인터페이스를 제공할 수 있다. 예를 들어, 정보 수집 모듈 173은 장 치 고유 정보 획득을 위한 장치 고유 정보 입력창을 출력할 수 있다. 사용자는 장치 고유 정보 입력창을 통해 장치 고유 정보 입력을 수행할 수 있다. 또 다른 예로, 정보 수집 모듈 173은 장치 고유 정보 획득을 위해 카메 라 모듈을 동작시킬 수 있다. 정보 수집 모듈 173은 카메라 모듈을 통해 입력되는 정보를 바탕으로 장치 고유 정보를 획득할 수 있다. 심 식별 정보(예: EID)는 심 180에 저장될 수 있다. 이에 따라, 정보 수집 모듈 173은 심 180에 심 식별 정보 (예: EID)를 요청하여 획득할 수 있다. 또는 심 식별 정보가 별도의 관리 서버 장치(예: 심 제조사 서버 장치 또는 전자 장치 제조사 서버 장치 등 심 관련 정보를 운용하는 서버 장치)에서 저장 관리되는 경우, 정보 수집 모듈 173은 전자 장치 100의 장치 고유 정보를 기반으로 심 식별 정보를 획득할 수도 있다. 이와 관련하여, 정 보 수집 모듈 173은 전자 장치 100의 별도 네트워크(예: 심 식별 정보를 관리하는 서버 장치가 연결된 IP 네트 워크와 연결되는 와이파이 기반의 통신 네트워크 또는 IP 네트워크와 연결된 다른 전자 장치와의 근거리 통신 네트워크)를 이용하여 관리 서버 장치에 접속할 수 있다. 정보 수집 모듈 173은 장치 고유 정보를 제공하고 해 당 전자 장치에 할당된 심 식별 정보 또는 서버 식별 정보를 획득할 수 있다. 심 식별 정보가 탑재된 심 180으로부터 획득된 경우 정보 수집 모듈 173은 획득된 장치 고유 정보 또는 심 식별 정보를 기반으로 서버 식별 정보(예: SRID)를 수집할 수 있다. 이와 관련하여, 정보 수집 모듈 173은 심 180에 저장된 임시 연결 정보(예: SRID 획득과 관련하여 해당 서버 장치에 접속할 수 있는 정보)를 기반으로 심 제조 사 서버 장치가 운용하는 서버 장치에 접속하여 해당 심 180과 관련한 서버 식별 정보를 획득할 수 있다. 다양 한 실시 예에 따르면, 정보 수집 모듈 173은 전자 장치 제조사가 운용하는 서버 장치에 접속(예: 전자 장치 제 조사에 의해 전자 장치 100에 기입된 접속 정보 또는 심 180에 기입된 접속 정보를 기반으로 접속)하여 서버 식 별 정보를 획득할 수도 있다. 이 경우, 전자 장치 제조사의 서버 장치는 특정 전자 장치에 탑재된 심 180의 서 버 식별 정보를 저장 및 관리할 수 있다. 다양한 실시 예에 따르면, 서버 식별 정보는 통신 사업자 장치 200에 의해 획득될 수도 있다. 이 경우 정보 수집 모듈 173은 장치 고유 정보 또는 심 식별 정보를 통신 사업자 장치 200에 제공(예: IP 네트워크를 통한 접속을 기반으로 제공하거나, 임시 연결 정보를 기반으로 접속하여 제공)할 수 있다. 프로파일 처리 모듈 175는 특정 통신 사업자의 통신 서비스 이용과 관련한 프로파일 수신 및 처리를 지원할 수 있다. 예컨대, 프로파일 처리 모듈 175는 특정 통신 사업자가 선택되면, 해당 통신 사업자가 운용하는 네트워크 와 연결을 수행하여, 통신 사업자 장치 200에 장치 고유 정보 또는 심 식별 정보를 제공할 수 있다. 이 동작에 서 프로파일 처리 모듈 175는 서버 식별 정보가 이미 획득된 경우, 서버 식별 정보를 함께 통신 사업자 장치 200에 제공할 수 있다. 프로파일 처리 모듈 175는 서버 식별 정보가 획득되지 않은 경우, 장치 고유 정보 또는 심 식별 정보를 제공하면서 서버 식별 정보의 획득을 통신 사업자 장치 200에 요청할 수도 있다. 통신 사업자 장치 200은 서버 식별 정보를 제공하는 서버 장치(예: 심 제조사 서버 장치 또는 전자 장치 제조사 서버 장치)로부터 해당 장치 고유 정보와 심 식별 정보에 대응하는 서버 식별 정보를 획득할 수 있다. 프로파일 처리 모듈 175는 통신 사업자 장치 200 또는 프로파일 생성 지원 장치 210, 프로파일 전송 지원 장치 300 중 적어도 하나로부터 프로파일 수신과 관련한 요청을 수신할 수 있다. 프로파일 처리 모듈 175는 프로파일 수신 관련 요청이 수신되면, 프로파일 전송 지원 장치 300과 세션을 형성하도록 심 180에 요청할 수 있다. 이와 관련하여, 프로파일 처리 모듈 175는 이미 획득된 서버 식별 정보를 기반으로 프로파일 전송 지원 장치 300과 통신 채널을 형성하거나 통신 사업자 장치 200으로부터 서버 식별 정보를 획득하여 프로파일 전송 지원 장치 300과 통신 채널을 형성할 수 있다. 프로파일 처리 모듈 175는 심 180에 프로파일 전송 지원 장치 300과 프로파 일 수신과 관련한 세션을 형성하도록 요청할 수 있다. 세션이 형성되면 특정 통신 사업자의 통신 서비스 운용 관련 프로파일은 통신 인터페이스 160을 통해 심 180에 전달될 수 있다. 프로파일 처리 모듈 175는 심 180에 특 정 프로파일 설치가 완료되면, 그에 대응하는 정보 출력을 정보 표시 모듈 171에 요청할 수 있다. 상술한 바와 같이, 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 적어도 하나의 통신 사업자 네트 워크가 제공하는 통신 서비스 연결과 관련한 프로파일이 설치되지 않은 심을 기반으로 연결 가능한 통신 사업자 네트워크를 검색하는 통신 인터페이스, 검색된 통신 사업자 네트워크를 기반으로 적어도 하나의 통신 사업자 정 보를 수집하는 프로비져닝 매니저, 수집된 통신 사업자 정보를 출력하는 디스플레이를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 특정 통신 사업자 항목 선택을 수신하면, 상기 전자 장치 관련 정보를 수집하고, 상기 선택된 통신 사업자 항목에 대응하는 통신 사업자 장치에 상기 수집된 전자 장치 관련 정보를 전송하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 상기 전자 장치의 장치 고유 정보, 심의 심 식별 정보, 프 로파일 전송을 지원하는 장치의 서버 식별 정보 중 적어도 하나를 수집하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 상기 심에 저장된 심 식별 정보 또는 상기 서버 식별 정보 를 수집하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 상기 전자 장치의 장치 고유 정보를 심 관련 정보를 관리 하는 관리 서버 장치에 전송하고 상기 관리 서버 장치로부터 상기 심 식별 정보 또는 서버 식별 정보를 수신하 도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 상기 통신 사업자 장치가 생성 요청한 프로파일 수신을 제 어할 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 상기 심이 상기 서버 식별 정보에 대응하는 프로파일 전송 지원 장치와 세션을 형성하도록 제어하고, 상기 세션을 통하여 상기 심이 상기 프로파일을 생성한 프로파일 생 성 지원 장치로부터 프로파일을 수신하도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 상기 수신된 프로파일을 심에 설치하도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 상기 전자 장치가 턴-오프 상태에서 턴-온 상태로 변경되 는 경우 상기 연결 가능한 통신 사업자 네트워크를 검색하도록 제어하거나, 통신 사업자 변경 요청 수신에 대응 하여 상기 연결 가능한 통신 사업자 네트워크를 검색하도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 상기 심에 기 설치된 프로파일에 의해 이용 가능한 통신 사업자 정보와 미설치된 프로파일 관련 통신 사업자 항목을 구분하여 출력하도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 입력 이벤트에 대응하여 상기 심 또는 심 관련 정보를 관 리하는 외부 서버 장치로부터 심 관련 정보를 획득하고, 상기 심 관련 정보를 표시하도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 프로비져닝 매니저는 상기 심 관련 정보에 대응하는 텍스트 정보를 출력하거나, 상기 심 관련 정보에 대응하는 지정된 코드 정보로 출력하도록 제어할 수 있다. 도 3은 다양한 실시 예에 따른 통신 사업자 선택과 관련한 전자 장치 운용 방법에 관한 도면이다. 도 3을 참조하면, 전자 장치 운용 방법에 있어서, 동작 301에서 프로비져닝 매니저 170은 선택 가능한 통신 사 업자 정보 표시를 수행할 수 있다. 이와 관련하여, 프로비져닝 매니저 170은 통신 인터페이스 160에 포함된 적 어도 하나의 통신 모듈을 이용하여 지정된 특정 위치에서 연결 가능한 통신 사업자 네트워크를 검색할 수 있다. 프로비져닝 매니저 170은 이미 등록된 통신 사업자 네트워크와 미등록된 통신 사업자 네트워크를 구분하여 통신사업자 정보 표시를 수행할 수 있다. 또는 프로비져닝 매니저 170은 미등록된 통신 사업자 네트워크에 해당하는 통신 사업자 정보를 표시할 수 있다. 동작 303에서, 프로비져닝 매니저 170은 통신 사업자 선택과 관련한 입력 이벤트 발생을 확인할 수 있다. 통신 사업자 선택과 관련한 입력 이벤트 발생이 없는 경우, 이하 동작들을 스킵하고, 동작 313으로 분기할 수 있다. 예컨대, 통신 사업자 선택과 관련한 입력 이벤트 발생이 지정된 시간 이내에 없거나 취소 입력 이벤트가 있으면, 프로비져닝 매니저 170은 통신 사업자 선택과 관련한 화면을 종료시킬 수 있다. 통신 사업자 선택과 관련한 이벤트가 발생하면, 동작 305에서 프로비져닝 매니저 170은 통신 서비스 이용과 관 련하여 심 180에 설치할 프로파일 수신에 필요한 전자 장치 관련 정보를 수집할 수 있다. 예컨대, 프로비져닝 매니저 170은 장치 고유 정보, 심 식별 정보, 서버 식별 정보(SRID)중 최소 하나를 수집하여 선택된 통신 사업 자 장치 200 또는 프로파일 생성 지원 장치 210에게 제공할 수 있다. 여기서 프로비져닝 매니저 170은 심 식별 정보(예: EID)를 통신 사업자 장치 200 또는 프로파일 생성 지원 장치 210에게 제공할 수 있다. 다양한 실시 예에 따르면, 동작 305에서 프로비져닝 매니저 170은 장치 고유 정보를 기반으로 상술한 관리 서버 장치(예: 심 식별 정보 또는 서버 식별 정보 중 적어도 하나의 관리를 위한 심 제조사 서버 장치 또는 전자 장 치 제조사 서버 장치)를 이용하여 심 식별 정보와 서버 식별 정보를 수집할 수 있다. 또는 심 180에 심 식별 정 보만 저장된 경우, 프로비져닝 매니저 170은 장치 고유 정보와 심 식별 정보를 관리 서버 장치에 제공하여 서버 식별 정보를 수집할 수 있다. 다양한 실시 예에 따르면, 프로비져닝 매니저 170은 장치 고유 정보와 심 식별 정 보를 통신 사업자 장치(또는 프로파일 생성 지원 장치 210)에 제공(예: IP 네트워크 등을 이용하여 접속하여 제 공)하고, 서버 주소 정보는 통신 사업자 장치 200이 관리 서버 장치로부터 획득하도록 요청할 수도 있다. 동작 307에서 프로비져닝 매니저 170은 프로파일 설치 요청을 수행할 수 있다. 예컨대, 프로비져닝 매니저 170 은 통신 사업자 장치 200, 프로파일 생성 지원 장치 210 또는 프로파일 전송 지원 장치 300 중 적어도 하나로부 터 프로파일 수신과 관련한 메시지를 수신할 수 있다. 프로비져닝 매니저 170은 프로파일 수신을 요청받으면 심 180에 프로파일 수신과 관련한 세션 형성을 요청할 수 있다. 심 180은 프로비져닝 매니저 170을 통하여 해당 통 신 사업자와 관련한 프로파일 수신 동작을 처리할 수 있다. 동작 309에서 프로비져닝 매니저 170은 프로파일 수신이 완료되었는지 확인하고, 수신 중 또는 수신 완료에 따 른 정보 표시를 처리할 수 있다. 동작 311에서 전자 장치 100의 심 180은 수신된 프로파일의 설치와 관련한 처 리를 수행할 수 있다. 프로비져닝 매니저 170은 심 180으로부터 프로파일 설치 등에 대한 정보를 수신하고, 이 에 대한 정보 표시를 수행할 수 있다. 동작 313에서 프로비져닝 매니저 170은 프로파일 설치와 관련한 기능 종료 이벤트가 발생하는지 확인할 수 있다. 기능 종료 시, 프로비져닝 매니저 170은 전자 장치 100의 기능 운용 단계로 진입하거나, 슬립 모드 또는 사용자 지정 스케줄에 따른 기능 처리를 지원할 수 있다. 다양한 실시 예에 따르면, 프로비져닝 매니저 170은 다른 통신 사업자 선택 및 프로파일 설치와 관련한 이벤트가 발생하면 동작 303 이전으로 분기하여 이하 과정을 재수행할 수 있다. 예컨대, 프로비져닝 매니저 170은 통신 사업자 변경과 관련한 메뉴 화면을 제공하고, 변경과 관련한 이벤트가 발생하면, 동작 303 이전으로 분기하여 이하 과정을 재수행할 수 있다. 다양한 실시 예에 따르 면 프로파일 수신이 완료되지 않은 상태이면, 프로비져닝 매니저 170은 동작 309 이전으로 분기하여 이하 과정 을 재수행할 수도 있다. 도 4는 다양한 실시 예에 따른 전자 장치의 프로파일 설치와 관련한 도면이다. 도 4를 참조하면, 다양한 실시 예에 따르면 전자 장치 관련 정보 획득과 관련하여, 동작 401에서 전자 장치 100 은 전자 장치 100의 장치 고유 정보(예: IMEI)를 통신 사업자 장치 200에 전달할 수 있다. 이와 관련하여, 전자 장치 100은 통신 사업자 장치 200이 연결된 네트워크(예: IP 네트워크)를 통해 통신 채널을 형성하고, 장치 고 유 정보를 통신 사업자 장치 200에 제공할 수 있다. 동작 403에서 통신 사업자 장치 200은 전자 장치 100이 제공한 장치 고유 정보를 제조사 서버 장치 400에 제공 할 수 있다. 제조사 서버 장치 400은 예컨대 특정 장치 고유 정보를 가지는 전자 장치 100에 탑재된 심의 심 식 별 정보 또는 서버 식별 정보를 관리하는 서버 장치일 수 있다. 동작 405에서 제조사 서버 장치 400은 장치 고유 정보에 매핑된 심 식별 정보(EID) 또는 서버 식별 정보(SRID) 를 통신 사업자 장치 200에 제공할 수 있다. 상술한 동작에서 통신 사업자 장치 200과 제조사 서버 장치 400은 유무선 IP 네트워크를 통해 연결될 수 있다. 다양한 실시 예에 따르면, 제조사 서버 장치 400은 통신 사업자 장치 200에 통합된 형태일 수도 있다. 동작 407에서, 통신 사업자 장치 200은 획득된 장치 고유 정보, 심 식별 정보, 서버 식별 정보 중 최소 하나를 프로파일 생성 지원 장치 210(예: SM-DP 장치)에 제공하면서 프로파일 생성 요청을 할 수 있다. 동작 409에서 프로파일 생성 지원 장치 210은 수신된 장치 고유 정보, 심 식별 정보, 서버 식별 정보 및 통신 사업자 장치 200의 고유 정보를 기반으로 전자 장치 100의 통신 서비스 운용과 관련한 프로파일을 생성할 수 있다. 동작 411 에서, 프로파일 생성 지원 장치 210은 생성된 프로파일을 서버 식별 정보에 대응되는 프로파일 전송 지원 장치 300(예: SM-SR 장치)에 제공할 수 있다. 동작 413에서 프로파일 전송 지원 장치 300은 특정 프로파일을 전자 장 치 100에 제공할 수 있다. 이 동작에서 프로파일 전송 지원 장치 300은 전자 장치 100의 심 180과 세션을 형성 하고, 형성된 세션을 통해 프로파일을 전송할 수 있다. 도 5는 다양한 실시 예에 따른 전자 장치의 프로파일 설치와 관련한 다른 예를 나타낸 도면이다. 도 5를 참조하면, 다양한 실시 예에 따르면, 동작 501에서 프로파일 생성 지원 장치 210은 적어도 하나의 프로 파일을 생성하여 저장 및 관리할 수 있다. 이 동작에서 프로파일 생성 지원 장치 210은 통신 사업자 장치 200의 요청에 따라 또는 지정된 정책에 따라 프로파일을 생성할 수 있다. 동작 502에서 전자 장치 100은 통신 사업자 장치 200에 장치 고유 정보(예: IMEI 또는 Serial Number)를 제공하 면서 프로파일 다운로드를 요청할 수 있다. 통신 사업자 장치 200은 장치 고유 정보에 대응하는 심 관련 정보 (예: EID 또는 SRID)를 획득하고, 획득된 심 관련 정보를 프로파일 생성 지원 장치 210에 전달할 수 있다. 동작 505에서, 프로파일 생성 지원 장치 210은 기 생성된 프로파일을 프로파일 전송 지원 장치 300에 전달할 수 있다. 동작 507에서 프로파일 전송 지원 장치 300은 전자 장치 100에 프로파일을 전송할 수 있다. 다양한 실시 예에 따르면, 동작 505에서 프로파일 생성 지원 장치 210은 프로파일을 프로파일 전송 지원 장치 300에 전송하 지 않고, 프로파일 전송 요청을 프로파일 전송 지원 장치 300에 전달할 수 있다. 그러면, 프로파일 전송 지원 장치 300은 전자 장치 100과 세션을 형성하고, 프로파일 생성 지원 장치 210과 전자 장치 100 간에 터널링 채널 을 제공할 수 있다. 프로파일 전송 지원 장치 300은 해당 채널을 이용하여 프로파일을 전자 장치 100에 전송할 수 있다. 다양한 실시 예에 따르면, 프로파일 생성 지원 장치 210은 적어도 하나의 또는 대량의 프로파일을 사전에 생성 하여 저장하고, 동작 503에서 통신 사업자 장치 200으로부터 EID와 SRID를 수신하면, 해당 심 관련 정보에 대응 하도록 프로파일을 변경하고, 프로파일 전송 지원 장치 300을 통하여 전자 장치 100에 해당 프로파일을 전송할 수도 있다. 다양한 실시 예에 따르면, 동작 502에서 전자 장치 100으로부터 장치 고유 정보를 수신하면, 통신 사업자 장치 200은 전자 장치 100과 관련한 심 관련 정보를 획득하는 동작을 수행할 수 있다. 예컨대, 통신 사업자 장치 200 은 도 4에서 설명한 바와 같이 제조사 서버 장치 400과 연동하여 EID와 SRID 값을 획득할 수 있다. 이 동작에서 통신 사업자 장치 200은 SOAP 또는 RESTful 프로토콜을 기반으로 Input Value(IMEI 또는 전자 장치 100의 Serial Number)을 제조사 서버 장치 400에 제공하고, 제조사 서버 장치 400은 Output Value(EID & SRID)를 통 신 사업자 장치 200에 전달할 수 있다. 다양한 실시 예에 따르면, 통신 사업자 장치 200 또는 통신 사업자 장치 200에 접속된 통신 서비스 가입용 전자 장치가 가입처리 POS 화면을 제공하고, EID와 SRID 값이 입력되면, 통신 사업자 장치 200이 EID와 SRID를 획득 할 수도 있다. 통신 서비스 가입용 전자 장치는 통신 사업자 장치 200과 관련된 대리점 등에 배치된 전자 장치 일 수 있다. 이와 관련하여, 오프라인 환경에서 수동으로 전자 장치 100의 심 180에 저장된 EID와 SRID 값을 통 신 서비스 가입용 전자 장치에 입력하면, 해당 정보가 통신 사업자 장치 200에 제공될 수도 있다. 다양한 실시 예에 따르면, EID 및 SRID 확인과 관련하여, 전자 장치 100은 심 180에 저장된 EID 값과 SRID 값을 디스플레이 150에 출력하거나, 또는 통신 서비스 가입용 전자 장치와 전자 장치 100이 통신 연결되어, 자동으로 전자 장치 100이 심 180 정보를 통신 서비스 가입용 전자 장치에 전송할 수도 있다. 상술한 동작 지원과 관련하 여, 심 180은 외부 입력(예: 메뉴 선택 또는 통신 서비스 가입용 전자 장치의 요청 메시지)에 대응하여 EID 값 및 SRID 값을 디스플레이 150에 출력하거나 전송할 수 있는 기능이 탑재될 수 있다. EID 값 및 SRID 값이 디스 플레이 150에 출력되는 상황에서, 통신 서비스 가입용 전자 장치의 입력 장치(예: 키보드)를 이용하여 EID 값 및 SRID 값이 통신 서비스 가입용 전자 장치에 입력될 수 있다. 다양한 실시 예에 따르면, 전자 장치 100은 바코드 또는 QR 코드 형태로 출력할 수도 있다. 통신 서비스 가입용 전자 장치는 바코드 또는 QR 코드를 읽을 수 있는 기기를 마련하고, 디스플레이 150에 표시된 정보를 통해 EID값 및 SRID 값을 획득할 수 있다. 또는 전자 장치 100의 외관에 EID 값 및 SRID 값이 프린팅될 수도 있으며, 이 경우 통신 서비스 가입용 전자 장치는 코드 리딩 기기(예: 스캐너, 카메라 등)를 이용하여 EID 값 및 SRID 값을 획득할 수도 있다. 통신 서비스 가입용 전자 장치는 획득된 EID 값과 SRID 값을 통신 사업자 장치 200에 전송할 수 있다. 통신 서비스 가입용 전자 장치는 통신 사업자 장치 200 또는 통신 사업자 장치 200과 연계된 서버 장치(예: 웹 포털)가 제공하는 서버 페이지를 통하여 EID 및 SRID 값을 수집하고, 이를 통신 사업자 장치 200에 제공할 수도 있다. 이와 관련하여, 서버 페이지(예: 웹 포털 화면)는 IMEI 또는 전자 장치 100의 Serial Number를 입력할 수 있는 입력창을 제공할 수 있다. 통신 사업자 장치 200은 서버 페이지 상에서 통신 서비스 가입용 전자 장치 100 이 수동으로 입력한 EID 값 및 SRID 값을 수신하거나, EID 값 및 SRID 값에 대응하는 바코드나 QR코드 값을 수 신할 수도 있다. 도 6은 다양한 실시 예에 따른 서버 식별 정보 획득의 다른 예와 관련한 도면이다. 도 6을 참조하면, 다양한 실시 예에 따르면, 서버 식별 정보 획득과 관련하여, 동작 601에서 전자 장치 100은 장치 고유 정보(예: IMEI or Serial Number)를 제조사 서버 장치 400에 제공할 수 있다. 상기 제조사 서버 장치 400은 장치 고유 정보를 기반으로 심 관련 정보(예: 심 식별 정보와 서버 식별 정보)를 제공할 수 있는 데이터 베이스를 저장 및 관리할 수 있다. 이와 관련하여, 도 6에서는 심 관련 정보를 제공하는 장치를 제조사 서버 장 치 400으로 명명하여 설명하지만 다양한 실시 예들이 이에 한정되는 것은 아니다. 예컨대, 심 관련 정보는 통신 사업자 장치 200, 프로파일 생성 지원 장치 210, 프로파일 전송 지원 장치 300, 심 제조사 서버 장치, 전자 장 치 제조사 장치 중 적어도 하나에서 저장 관리할 수 있다. 이에 따라, 제조사 서버 장치 400은 심 관련 정보의 저장 및 관리를 수행하는 장치로 대체될 수 있다. 전자 장치 100으로부터 장치 고유 정보를 수신하면, 동작 603에서, 제조사 서버 장치 400은 장치 고유 정보에 대응하는 심 식별 정보 또는 서버 식별 정보를 검색할 수 있다. 이와 관련하여, 제조사 서버 장치 400은 심 관 련 정보와 장치 고유 정보를 매핑한 데이터베이스를 참조할 수 있다. 심 식별 정보 및 서버 식별 정보가 검색되 면, 동작 603에서 제조사 서버 장치 400은 심 식별 정보 및 서버 식별 정보를 전자 장치 100에 전송할 수 있다. 상술한 바와 같이, 한 실시 예에 따른 심 운용 방법은 적어도 하나의 통신 사업자 네트워크가 제공하는 통신 서 비스 연결과 관련한 프로파일이 설치되지 않은 심을 기반으로 연결 가능한 통신 사업자 네트워크를 검색하는 동 작, 검색된 통신 사업자 네트워크를 기반으로 적어도 하나의 통신 사업자 정보를 수집하는 동작, 수집된 통신 사업자 정보를 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 특정 통신 사업자 항목 선택을 수신하는 동작, 상기 선택 수신에 대응하 여 상기 전자 장치 관련 정보를 수집하는 동작, 상기 선택된 통신 사업자 항목에 대응하는 통신 사업자 장치에 상기 수집된 전자 장치 관련 정보를 전송하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치 관련 정보를 수집하는 동작은 장치 고유 정보, 심 식별 정보, 프로파 일 전송을 지원하는 장치의 서버 식별 정보 중 적어도 하나를 수집하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치 관련 정보를 수집하는 동작은 상기 심에 기입된 심 식별 정보 또는 상기 서버 식별 정보를 수집하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치 관련 정보를 수집하는 동작은 상기 전자 장치의 장치 고유 정보를 심 관련 정보를 관리하는 관리 서버 장치에 전송하는 동작, 상기 관리 서버 장치로부터 상기 심 식별 정보 또는 서 버 식별 정보를 수신하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 통신 사업자 장치가 생성 요청한 프로파일을 수신하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 심과 상기 서버 식별 정보에 대응하는 프로파일 전송 지원 장치와 세션을 형성하는 동작, 상기 세션을 통하여 상기 심이 상기 프로파일을 생성한 지원 장치로부터 프로파일을 수 신하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 수신된 프로파일을 심에 설치하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 검색하는 동작은 전자 장치가 턴-오프 상태에서 턴-온 상태로 변경되는 경우 상 기 연결 가능한 통신 사업자 네트워크를 검색하는 동작, 통신 사업자 변경 요청 수신에 대응하여 상기 연결 가능한 통신 사업자 네트워크를 검색하는 동작 중 어느 하나를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 출력하는 동작은 상기 심에 기 설정된 프로파일에 의해 이용 가능한 통신 사업 자 정보와 미설치된 프로파일 관련 통신 사업자 항목을 구분하여 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 입력 이벤트에 대응하여 상기 심 또는 심 관련 정보를 관리하는 외부 서 버 장치로부터 심 관련 정보를 획득하는 동작, 상기 심 관련 정보를 표시하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 표시하는 동작은 상기 심 관련 정보에 대응하는 텍스트 정보를 출력하는 동작, 상기 심 관련 정보에 대응하는 지정된 코드 정보(예: 바코드, QR 코드 등)로 출력하는 동작 중 적어도 하나를 포함할 수 있다. 도 7은 다양한 실시 예에 따른 통신 사업자 선택과 관련한 화면 예시도이다. 도 7을 참조하면, 다양한 실시 예에 따르면, 상태 701에서와 같이 전자 장치 100은 턴-오프 상태를 가질 수 있 다. 전자 장치 100은 턴-온 요청과 관련한 이벤트(예: 전원 키 입력 이벤트 등)가 발생하면, 부팅을 수행할 수 있다. 전자 장치 100은 부팅 과정에서 통신 인터페이스 160을 제어하여 연결 가능한 통신 사업자 네트워크가 존 재하는지 확인할 수 있다. 전자 장치 100은 연결 가능한 통신 사업자 네트워크가 존재하는 경우, 해당 통신 사 업자 정보를 수집할 수 있다. 전자 장치 100은 수집된 통신 사업자 정보를 토대로 상태 705에서와 같이 통신 사 업자 선택 화면을 출력할 수 있다. 예컨대, 전자 장치 100은 복수의 통신 사업자를 선택할 수 있는 선택 화면을 출력할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100은 연결 가능한 하나의 통신 사업자 네트워크가 존재 하는 경우에도 상태 705에서와 같이 통신 사업자 선택 화면을 출력할 수 있다. 또는 전자 장치 100은 연결 가능 한 하나의 통신 사업자 네트워크가 존재하는 경우 통신 사업자 선택 화면 출력 없이, 통신 사업자의 프로파일 수신 및 설치와 관련한 동작을 처리할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100은 부팅 과정에서 심 180에 저장된 프로파일이 있는지 확인할 수 있다. 전자 장치 100은 연결 가능한 통신 사업자 정보와 등록된 통신 사업자 정보(예: 특정 통신 사업자 관련 프로파 일이 설치된 상태)를 구분하여 출력할 수 있다. 이 동작에서 전자 장치 100은 등록된 통신 사업자 네트워크에 통신 연결을 수행할 수 있다. 이후 전자 장치 100은 사용자 선택에 대응하여 다른 통신 사업자 관련 프로파일을 설치하고, 해당 통신 사업자 네트워크에 접속할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100은 상태 703에서와 같이 턴-온 상태를 가지되 통신 설정과 관련한 화면 을 출력할 수 있다. 이 상태에서, 전자 장치 100의 심 180은 별도의 프로파일이 설치되지 않은 상태를 가질 수 있다. 또는 전자 장치 100의 심 180은 특정 통신 사업자와 관련한 프로파일이 설치된 상태를 가질 수도 있다. 전자 장치 100은 통신 사업자 변경과 관련한 통신 설정 화면을 출력할 수 있다. 전자 장치 100은 통신 설정 화 면에서 통신 사업자 변경 항목이 선택되면, 연결 가능한 통신 사업자 네트워크를 검색하고, 검색된 통신 사업자 정보를 기반으로 상태 705에서와 같이 통신 사업자 선택 화면을 출력할 수 있다. 상태 705에서, 특정 통신 사업자 항목(심 180에 통신 사업자 관련 프로파일이 설치되지 않은 통신 사업자 항 목)이 선택되면, 전자 장치 100은 IP 네트워크 등을 통하여 해당 통신 사업자 장치 200에 프로파일 생성을 요청 할 수 있다. 통신 사업자 장치 200은 프로파일 생성과 관련하여 전자 장치 100에 전자 장치 관련 정보를 요청할 수 있다. 예컨대, 전자 장치 100은 상태 707에서와 같이 전자 장치 관련 정보를 입력하는 입력창을 출력할 수 있다. 해당 입력창은 통신 사업자 장치 200이 제공하는 서버 페이지일 수 있다. 통신 사업자 장치 200은 전자 장치 관련 정보(예: IMEI, EID, SRID)가 수집되면, 해당 정보를 프로파일 생성 지원 장치 210에 제공하여 프로 파일 생성을 요청할 수 있다. 다양한 실시 예에 따르면, 상태 707에서 제공된 화면은 심 식별 정보 또는 서버 식별 정보 중 적어도 하나를 획 득하는 화면일 수 있다. 앞서 설명한 바와 같이, 전자 장치 100은 장치 고유 정보를 제조사 서버 장치 400에 전 송하여 심 식별 정보 또는 서버 식별 정보를 요청할 수 있다. 이에 따라, 상태 707에서 제공된 화면은 제조사 서버 장치 400이 특정 장치 고유 정보에 할당된 심 식별 정보 또는 서버 식별 정보를 제공한 서버 페이지일 수 있다. 본 발명의 다양한 실시 예에 사용된 용어 \"모듈\"은, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은 예를 들어, 유닛(unit), 로직 (logic), 논리 블록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용 (interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. 다양한 실시 예에 따르면, 본 발명의 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로그래밍 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer- readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어는, 하나 이상의 프로세서에 의해 실 행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체에는 하드디스크, 플로피디스크 및 자기 테이프와 같은 마그네틱 매체 (magnetic media)와, CD-ROM(compact disc ROM), DVD(digital versatile disc)와 같은 광기록 매체(optical media)와, 플롭티컬 디스크(Flopticaldisk)와 같은 자기-광 매체(magneto-optical media)와, 그리고 ROM, RAM, 플래시 메모리 등과 같은 프로그램 명령(예: 프로그래밍 모듈)을 저장하고 수행하도록 특별히 구성된 하드웨어 가 포함될 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 는 본 발명의 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예에 따르면, 명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서 에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로 서, 상기 적어도 하나의 동작은, 적어도 하나의 통신 사업자 네트워크가 제공하는 통신 서비스 연결과 관련한 프로파일이 설치되지 않은 심을 기반으로 연결 가능한 통신 사업자 네트워크를 검색하는 동작, 검색된 통신 사 업자 네트워크를 기반으로 적어도 하나의 통신 사업자 정보를 수집하는 동작, 수집된 통신 사업자 정보를 출력 하는 동작을 포함할 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시 예들은 본 발명의 실시 예에 따른 의 기술 내용을 쉽게 설명 하고 본 발명의 실시 예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시 예의 범위를 한정 하고자 하는 것은 아니다. 따라서, 본 발명의 다양한 실시 예의 범위는 여기에 개시된 실시 예들 이외에도 본 발명의 다양한 실시 예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실 시 예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0091389", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예에 따른 심 이용과 관련한 전자 장치 운용 환경을 개략적으로 도시한다. 도 2는 다양한 실시 예에 따른 프로비져닝 매니저의 일예를 도시한다. 도 3은 다양한 실시 예에 따른 통신 사업자 선택과 관련한 전자 장치 운용 방법에 관한 도면이다. 도 4는 다양한 실시 예에 따른 전자 장치의 프로파일 설치와 관련한 도면이다. 도 5는 다양한 실시 예에 따른 서버 식별 정보 획득의 일예와 관련한 도면이다. 도 6은 다양한 실시 예에 따른 서버 식별 정보 획득의 다른 예와 관련한 도면이다. 도 7은 다양한 실시 예에 따른 통신 사업자 선택과 관련한 화면 예시도이다."}
