{"patent_id": "10-2010-7028369", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2011-0020830", "출원번호": "10-2010-7028369", "출원인": "제너럴 일렉트릭 캄파니", "발명자": "카스테니 보그단 지"}}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지능형 전자 장치(IED)에 대한 유지 관리(maintenance)를 예측하는 방법으로서,상기 지능형 전자 장치 내의 다수의 센서를 사용하여서 환경적 상태(environmental condition)를 측정하는 단계와,상기 환경적 상태 측정값을 처리하여서 상기 지능형 전자 장치의 동작 상태 이력을 나타내는 장기 노출 데이터(long-term exposure factor)를 결정하는 단계와,상기 장기 노출 데이터에 신뢰성 모델을 적용하는 단계와,상기 장기 노출 데이터 및 상기 신뢰성 모델을 기초로 하여서 상기 지능형 전자 장치의 수명의 수치를 결정하는단계와,상기 결정된 수치와 사전 선정된 경계치를 서로 비교하는 단계와,상기 결정된 수치가 상기 사전 선정된 경계치를 벗어나 있는지의 여부를 알리는 단계를 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 환경적 상태를 측정하는 단계는 온도, 피크 전류 서지 값, 접지 존재 여부, 기계적 충격, 기계적 진동, 화학적 요인, 복사형 전자기 간섭 및 습도 중 적어도 하나를 측정하는 단계를 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 환경적 상태 측정값을 처리하여서 상기 지능형 전자 장치의 동작 상태 이력을 나타내는 장기 노출 데이터를 결정하는 단계는, 원 측정치들(raw measurements), 상기 원 측정치들의 적분치, 상기 원 측정치들의 평균치및 상기 원 측정치들의 최대치 중 적어도 하나를 결정하는 단계를 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 지능형 전자 장치의 핵심 구성 요소(key IED component)의 신뢰성 데이터를 사용하여서 상기 신뢰성 모델을 개발하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 지능형 전자 장치의 가속화 수명 테스트 결과 및 특정 제조자의 지능형 전자 장치에 대한 필드 데이터공개특허 10-2011-0020830-3-(field data) 중 적어도 하나를 사용하여서 상기 신뢰성 모델을 개발하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 장기 노출 데이터에 신뢰성 모델을 적용하는 단계는 결정론적 신뢰성 모델, 확률론적 신뢰성 모델, 퍼지수학(fuzzy mathematics)에 기초한 신뢰성 모델 및 인공 신경 회로망에 기초한 신뢰성 모델 중 하나를 적용하는단계를 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 장기 노출 데이터 및 상기 신뢰성 모델을 기초로 하여서 상기 지능형 전자 장치의 수명의 수치를 결정하는단계는, 상기 지능형 전자 장치의 잔여 수명, 상기 지능형 전자 장치의 기사용 기간(used life) 및 상기 지능형전자 장치의 마모 레이트(wear rate) 중 적어도 하나를 결정하는 단계를 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 장기 노출 데이터 및 상기 신뢰성 모델을 기초로 하여서 상기 지능형 전자 장치의 수명의 수치를 결정하는단계는, 정상적 마모에 대한 실제적 마모의 비 및 여러 시간 단위로 표현되는 지능형 전자 장치의 기사용 기간중 적어도 하나를 결정하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 장기 노출 데이터 및 상기 신뢰성 모델을 기초로 하여서 상기 지능형 전자 장치의 수명의 수치를 결정하는단계는, 상기 지능형 전자 장치에 대해서 허용 가능한 특정 범위의 동작 상태를 벗어난 동작 상태에 기초하여서마모 레이트를 결정하는 단계를 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 결정된 수치가 상기 사전 선정된 경계치를 벗어나 있는지의 여부를 알리는 단계는 상기 지능형 전자 장치의 잔여 수명, 기사용 기간 및 마모 레이트 중 적어도 하나에 기초하여서 신호를 트리거(trigger)하는 단계를포함하는,지능형 전자 장치 유지 관리 예측 방법.공개특허 10-2011-0020830-4-청구항 11 제 1 항에 있어서,상기 결정된 수치가 상기 사전 선정된 경계치를 벗어나 있는지의 여부를 알리는 단계는 시각적 표시, 물리적 출력, 상기 지능형 전자 장치의 동작 코드 내에서 생성된 가상 포인트 및 상기 지능형 전자 장치의 사용자 프로그램 가능한 코드 내에서 생성된 가상 포인트 중 적어도 하나를 사용하여서 신호를 생성하는 단계를 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 장기 노출 데이터가 상기 지능형 전자 장치가 고장날 시에 추출가능하게 되도록 상기 장기 노출 데이터를저장하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서,상기 지능형 전자 장치가 부분적으로 복구되거나 새롭게 단장되면, 상기 지능형 전자 장치의 실제적 마모를 반영하도록 상기 장기 노출 데이터를 증분하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서,상기 신뢰성 모델을 상기 지능형 전자 장치의 동작 코드 내에 통합시키는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항에 있어서,상기 신뢰성 모델을 데이터 개체로서 저장하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 신뢰성 모델을 업그레이드하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 1 항에 있어서,상기 장기 노출 데이터를 중앙 애플리케이션에 다운로드시켜서 상기 중앙 애플리케이션이 상기 다운로드된 장기공개특허 10-2011-0020830-5-노출 데이터에 기초하여서 다수의 지능형 전자 장치에 대해서 필요한 유지 관리 사항을 결정하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 1 항에 있어서,상기 신뢰성 모델을 중앙 애플리케이션을 사용하여서 원격으로 갱신하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 1 항에 있어서,다수의 지능형 전자 장치의 다수의 해당 신뢰성 모델들을 집합(aggregate)하는 단계를 더 포함하는,지능형 전자 장치 유지 관리 예측 방법."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "다수의 지능형 전자 장치(IED)에 대한 신뢰성 모델을 확립 및 유지 관리하는 시스템으로서,상기 다수의 지능형 전자 장치로부터 장기 노출 데이터를 취득하는 취득부와,상기 다수의 지능형 전자 장치 중 고장난 지능형 전자 장치로부터 고장 정보를 수신하는 입력부와,상기 취득부와 상기 입력부에 접속된 프로세서를 포함하며,상기 프로세서는, 상기 다수의 지능형 전자 장치의 각각의 신뢰성을 결정하고, 상기 결정된 신뢰성과 상기 장기노출 데이터 간을 상관시키는 신뢰성 모델을 도출하도록 프로그램된,신뢰성 모델 확립 유지 관리 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20 항에 있어서,상기 취득부는 전자적 통신 및 수동 데이터 입력 중 적어도 하나를 사용하여서 상기 다수의 지능형 전자 장치로부터 상기 장기 노출 데이터를 취득하는,신뢰성 모델 확립 유지 관리 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 20 항에 있어서,상기 장기 노출 데이터는 온도, 피크 전류 서지 값, 접지 존재 여부, 기계적 충격, 기계적 진동, 화학적 요인,복사형 전자기 간섭 및 습도 중 적어도 하나와 연관된,신뢰성 모델 확립 유지 관리 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "공개특허 10-2011-0020830-6-제 20 항에 있어서,상기 고장 정보는 상기 지능형 전자 장치(IED)의 고장 시간, 상기 지능형 전자 장치의 성능 저하 시간, IED 서브시스템의 고장 시간 및 IED 서브시스템의 성능 저하 시간 중 적어도 하나를 포함하는,신뢰성 모델 확립 유지 관리 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 20 항에 있어서,상기 신뢰성 모델은 상기 다수의 지능형 전자 장치 중 하나의 고장 또는 다수의 고장을 예측하는,신뢰성 모델 확립 유지 관리 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 20 항에 있어서,상기 다수의 지능형 전자 장치는 사용자에 의해서 제어되며,상기 프로세서는 또한 상기 다수의 지능형 전자 장치에 기초하여서 상기 신뢰성 모델을 도출하도록 프로그램된,신뢰성 모델 확립 유지 관리 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 20 항에 있어서,상기 프로세서는 또한 상기 다수의 지능형 전자 장치의 제조자가 제공하는 데이터에 기초하여서 상기 신뢰성 모델을 도출하도록 프로그램된,신뢰성 모델 확립 유지 관리 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 20 항에 있어서,상기 프로세서는 또한 사용자에 의해서 제어되는 다수의 지능형 전자 장치의 제조자가 제공하는 데이터에 기초하여서 상기 신뢰성 모델을 도출하도록 프로그램된,신뢰성 모델 확립 유지 관리 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "환경적 데이터를 취득하는 다수의 센서를 그 내부에 포함하는 지능형 전자 장치의 동작 상태를 모니터링하는 시스템으로서,상기 다수의 지능형 전자 장치로부터 장기 노출 데이터를 취득하는 취득부와,상기 다수의 지능형 전자 장치 중 고장난 지능형 전자 장치로부터 고장 정보를 수신하는 입력부와,상기 취득부와 상기 입력부에 접속된 프로세서를 포함하며,상기 프로세서는,상기 다수의 지능형 전자 장치의 각각의 신뢰성을 결정하고,공개특허 10-2011-0020830-7-상기 결정된 신뢰성과 상기 장기 노출 데이터 간을 상관시키는 신뢰성 모델을 도출하며,상기 지능형 전자 장치의 수명의 수치를 사전 선정된 경계치와 비교하며,상기 결정된 수치가 상기 사전 선정된 경계치를 벗어나 있는지의 여부를 알리는 신호를 생성하도록 프로그램된,지능형 전자 장치의 동작 상태 모니터링 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 28 항에 있어서,상기 프로세서는 또한 상기 지능형 전자 장치의 핵심 구성 요소의 신뢰성 데이터를 사용하여서 상기 신뢰성 모델을 개발하도록 프로그램된,지능형 전자 장치의 동작 상태 모니터링 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 29 항에 있어서,상기 프로세서는 또한 상기 지능형 전자 장치의 잔여 수명, 상기 지능형 전자 장치의 기사용 기간(used life)및 상기 지능형 전자 장치의 마모 레이트(wear rate) 중 적어도 하나를 결정함으로써 상기 지능형 전자 장치의수명의 수치를 결정하도록 프로그램된,지능형 전자 장치의 동작 상태 모니터링 시스템."}
{"patent_id": "10-2010-7028369", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 29 항에 있어서,상기 프로세서는 또한 상기 지능형 전자 장치의 잔여 수명, 상기 지능형 전자 장치의 기사용 기간 및 상기 지능형 전자 장치의 마모 레이트 중 적어도 하나에 기초하여서 신호를 생성하도록 프로그램된,지능형 전자 장치의 동작 상태 모니터링 시스템.명 세 서기 술 분 야본 발명은 전반적으로 혹독한 환경에서 사용되는 지능형 전자 장치(intelligent electronic device; IED)를 유 [0001]지 관리하는 분야에 관한 것으로 보다 구체적으로, 본 발명은 지능형 전자 장치의 동작 상태의 계속적인 모니터링, 외부 환경에 대한 노출 데이터 및 지능형 전자 장치 내에 내장된 신뢰성 모델(reliability model)에 기초하여 지능형 전자 장치를 예측적으로 유지 관리(predictive maintenance)하는 방법 및 시스템에 관한 것이다.배 경 기 술내장된 생산, 전송, 분배 및 에너지 변환 수단을 포함하는 전기 그리드(electrical grid)는 종종 지능형 전자 [0002]장치(IED)의 보조를 받아서 동작한다. 이러한 지능형 전자 장치는 전기 그리드를 고장(faults) 및 다른 비정상적인 상태로부터 보호하고 에너지 사용 상황을 모니터링 및 측정하고 이와 다른 측면의 전기 그리드 동작을 제어한다. 이러한 지능형 전자 장치는 다음으로만 한정되는 것은 아니지만 보호 계전기, 원격 단말 유닛, 프로그램가능한 로직 제어기(PLC), 미터, 로컬 HMI(local human machine interface), 이더넷 스위치 및/또는 라우터,모뎀 및 다른 유사한 장치들을 포함한다.지능형 전자 장치들은 종종 고압 변전소 제어 하우스, 중간 전압 계폐기(medium voltage switchgear), 발전소, [0003]공개특허 10-2011-0020830-8-산업용 플랜 및 모터 제어 센터와 같은 거칠고 험한 환경에 설치되어서 동작한다. 따라서, IED는 극한 온도,전자기 간섭, 전기 서지(surge), 기계적 충격 및 진동 및 화학제와 같은 환경에 노출되게 된다. 적어도 몇몇알려진 IED는 산업상의 규격 및/또는 확립된 설계상의 관행에 의해서 사전 규정된 바대로 상기와 같은 환경을견디거나 제조업자들 간의 경쟁에 의해서 그러한 험한 환경을 견디도록 설계되고 있다.적어도 몇몇 알려진 IED는 전기 그리드 내에서 보호 기능 및/또는 제어 기능과 같은 중요한 기능들을 수행한다. [0004]이로써, 작동 시간 동안 기능들을 완벽하게 수행하도록 유지될 필요가 있다. 이렇게 IED가 요구되는 기능들을필요할 때에 수행하도록 하기 위해서는, IED를 주기적으로 검사하고 유지 관리할 필요가 있다. 이러한 주기적유지 관리 절차는 전기 기계적 기술 및 아날로그 기술들을 채용한 보호 장치, 제어 장치 및/또는 측정 장치의이전 세대의 사용 이후부터 변해오고 있다. 적어도 몇몇 알려진 주기적 유지 관리 절차에서는, 문제 징후를 찾기 위해서 IED를 시각적으로 검사하고 IED를 서비스 현장으로부터 주기적으로 취하며 이를 자신이 속한 시스템으로부터 떼어내어서 그 기능을 테스트한다. 이러한 주기적 유지 관리 절차에서 그 검사 주기의 간격은 2 내지3 년 사이일 수 있으며 소정의 사용자의 과거 경험 사항, 검사되고 있는 IED의 제조사, 평균 동작 상태 또는 애플리케이션의 중요 정도와 같은 요소 또는 다른 관련 요소들에 근거하고 있다.그러나, IED들이 서로 다른 예상 수명을 가지거나 고장율을 가지기 때문에 상기와 같은 주기적 유지 관리 절차 [0005]들은 최적화되지 못한다. IED들은 평균적으로 예상되는 동작 상태와는 크게 상이한 동작 상태 하에서 설치될수 있다. 가령, 이러한 가변적인 동작 상태로서는 평균 주변 온도와 같이 용이하게 입증할 수 있는 요소들이있거나 전자기 간섭 노출 및 국소적 동작 온도와 같이 용이하게 입증할 수 없는 숨겨진 요소들이 있을 수 있다.때로는, 소정의 시설 내의 모든 종류의 IED들이 그들의 동작 상태(operating condition) 및/또는 제조사에 상관없이 일괄적으로 설치되기도 한다. 이로써, 몇몇 IED들은 과잉 유지 관리되는 한편 몇몇 IED들은 평균에 미달할 정도로 유지 관리되지 않아서, 예상되지 않은 고장이 발생한다.또한, 이러한 주기적 유지 관리 절차에서는, IED의 사용자 및/또는 운영자에게 비용 절감에 대한 중대한 가능성 [0006]이 다루어지지 않고 있다. 가령, 관련된 노동의 양으로 인해서 유지 관리 비용이 높을 수 있으며, 여분의 장치가 제공되지 않고 있다면 해당 유지 관리 절차에서는 보호 및/또는 제어되고 있는 프로세스 및/또는 자원들을중지시킬 필요가 있다. 또한, IED에 예상하지 않은 고장이 발생하게 되면 비상 상황 형태의 대응이요구되는데, 이러한 비상 상황 형태의 대응 시에는 스케줄에 없던 작업이 실시되거나 스케줄에 없던 예비 부품이 사용되거나 적절한 준비도 없이 작업을 해야 하는 비효율성이 발생하거나 보호 및 제어된 자원들이 스케줄에맞지 않게 중지되어 이와 관련된 처리 단계들도 역시 중지되고 만다.발명의 내용해결하려는 과제적어도 몇몇 알려진 IED들은 마이크로프로세서를 포함하고 있어서 이 마이크로프로세서를 사용하여서 IED는 센 [0007]서로부터의 정보를 수집하여서 분석한다. 그러나, IED의 동작 상태(operating condition)와 노출 정황(exporsure)을 이해하기 위한 정보 수집 및 분석을 신뢰성 모델과 같은 IED의 예상 수명을 알려주는 내장형 정보와 함께 활용하여서 예측적 유지 관리 요청 및/또는 예측적 유지 관리 신호를 생성하는 방법 및 시스템이 필요하다.과제의 해결 수단본 발명의 일 측면에 따라서, 지능형 전자 장치(IED)에 대한 유지 관리(maintenance)를 예측하는 방법이 제공된 [0008]다. 이 방법은 상기 지능형 전자 장치 내의 다수의 센서를 사용하여서 환경적 상태를 측정하는 단계와, 상기환경적 상태를 처리하여서 상기 지능형 전자 장치의 동작 상태 이력을 나타내는 장기 노출 데이터(long-termexposure factor)를 결정하는 단계와, 상기 장기 노출 데이터에 신뢰성 모델을 적용하는 단계와, 상기 장기 노출 데이터 및 상기 신뢰성 모델을 기초로 하여서 상기 지능형 전자 장치의 수명의 수치를 결정하는 단계와, 상기 결정된 수치와 사전 선정된 경계치를 서로 비교하는 단계와, 상기 결정된 수치가 상기 사전 선정된 경계치를벗어나 있는지의 여부를 알리는 단계를 포함한다.본 발명의 다른 측면에 따라서, 다수의 지능형 전자 장치(IED)에 대한 신뢰성 모델을 확립 및 유지 관리하는 시 [0009]공개특허 10-2011-0020830-9-스템이 제공된다. 이 시스템은 상기 다수의 지능형 전자 장치로부터 장기 노출 데이터를 취득하는 취득부와,상기 다수의 지능형 전자 장치 중 고장난 지능형 전자 장치로부터 고장 정보를 수신하는 입력부와, 상기 취득부와 상기 입력부에 접속된 프로세서를 포함하며, 상기 프로세서는, 상기 다수의 지능형 전자 장치의 각각의 신뢰성을 결정하고, 상기 결정된 신뢰성과 상기 장기 노출 데이터 간을 상관시키는 신뢰성 모델을 도출하도록 프로그램된다.본 발명의 또 다른 측면에 따라서, 환경적 데이터를 취득하는 다수의 센서를 그 내부에 포함하는 지능형 전자 [0010]장치의 동작 상태를 모니터링하는 시스템이 제공된다. 이 시스템은 상기 다수의 지능형 전자 장치로부터 장기노출 데이터를 취득하는 취득부와, 상기 다수의 지능형 전자 장치 중 고장난 지능형 전자 장치로부터 고장 정보를 수신하는 입력부와, 상기 취득부와 상기 입력부에 접속된 프로세서를 포함하며, 상기 프로세서는 상기 다수의 지능형 전자 장치의 각각의 신뢰성을 결정하고, 상기 결정된 신뢰성과 상기 장기 노출 데이터 간을 상관시키는 신뢰성 모델을 도출하며, 상기 지능형 전자 장치의 수명의 수치를 사전 선정된 경계치와 비교하며, 상기 결정된 수치가 상기 사전 선정된 경계치를 벗어나 있는지의 여부를 알리는 신호를 생성하도록 프로그램된다.도면의 간단한 설명이하의 발명의 상세한 설명 부분에서는, 다음의 첨부 도면을 참조하여서, 본 명세서에서 개시되는 본 발명에 따 [0011]른 방법 및 시스템의 장점 및 특징을 포함하는 예시적인 실시예들이 예시적으로 기술될 것이다.도 1은 동작 온도를 모니터링하기 위해서 사용되는 예시적인 지능형 전자 장치(IED)의 개략도이다.도 2는 전기 서지(electrical surge)를 모니터링 및/또는 측정하기 위해서 사용되는 예시적인 IED의개략도이다.도 3은 접지 지점과 관련하여서 입력이 올바르지 않게 접지된 바를 검출하는데 사용되는 예시적인 IED의 개략도이다.도 4는 IED에 대한 예시적인 예측적 유지 관리 방법을 설명하는 흐름도이다.발명을 실시하기 위한 구체적인 내용이하에서 기술되는 실시예들이 온도, 전기 서지 및 접지 상황과 같은 환경적 요소들을 기반으로 하여 지능형 전 [0012]자 장치(IED)의 수명을 모니터링하는 것을 기술하지만, 다른 환경적 요소들도 역시 모니터링될 수 있음을 본 기술 분야의 당업자는 이해할 것이다. 또한, 환경적 요소들에 의한 영향은 엔지니어링 또는 건설의 흐름, 또는예상되지 않은 이벤트에 의해서 변화되거나, 사용자가 IED가 가속적으로 마모되게 IED를 의도적으로 사용하는바에 의해서 변화될 수 있다는 것을 본 기술 분야의 당업자는 이해할 것이다. 또한, 소형화 및/또는 집적화로인해서 IED는 이하에서 기술될 바와 같이 하나의 센서를 포함하거나 다수의 센서를 포함하며, 이로써 각 IED는다수의 환경적 요소들을 동시에 모니터링한다. 가령, IED는 다수의 센서를 포함하며, 이로써 IED는 기계적 충격, 진동, 습기, 화학적 요소에 대한 노출, 전원 레벨, 복사형 전자기 간섭 및/또는 전도형 전자기 간섭 등을동시에 모니터링한다.도 1은 동작 온도를 모니터링하는데 사용되는 예시적인 지능형 전자 장치(IED)의 개략도이다. IED(100)는 다수 [0013]의 구성 요소(104) 및 적어도 하나의 온도 센서(106)를 포함하는 샤시(chassis)(102)를 포함한다. 본 예시적인실시예에서, 구성 요소(104)들은 다음으로만 한정되지는 않지만 캐패시터, 마이크로제어기, 그래픽 디스플레이및/또는 통신 송수신기와 같은 중요한 구성 요소(critical component)들이다. 온도 센서(106)는 IED(100) 내부의 온도뿐만 아니라 외부 주변(108)의 온도도 모니터링할 수 있도록 IED(100) 내에서 배치되어 있다. 보다구체적으로, 프로세서(110)가 각 구성 요소(104)의 온도와 외부 주변(108)의 온도 간의 온도 구배(gradient)를결정할 수 있도록, 온도 센서(106)는 각 구성 요소(104)의 온도 및 외부 주변(108)의 온도를 정확하게 추정할수 있게 위치하고 있다.동작 동안, 그리고 대기 상태 조건(steady state condition) 하에서, 온도 센서(106)에 의해서 측정된 온도는 [0014]외부 주변(108)에 대해서는 실질적으로 일정한 오프셋 △TA로 유지된다. 또한, 온도 센서(106)에 의해서 측정된 온도는 각 구성 요소(104)에 대해서는 실질적으로 일정한 오프셋으로 유지된다. 가령, 온도 센서(106)에 의해서 측정된 온도는 제 1 구성 요소(112)에 대해서는 실질적으로 일정한 제 1 오프셋 △T1로 유지된다. 온도센서(106)에 의해서 측정된 온도는 제 2 구성 요소(114)에 대해서는 실질적으로 일정한 제 2 오프셋 △T2로 유공개특허 10-2011-0020830-10-지된다. 각 오프셋 △TA, △T1, △T2는 IED를 구축하는 동안의 계산 결과 및/또는 측정 결과 및/또는 IED를 구축한 후의 테스트 결과에 의해서 결정된다.예시적인 실시예에서, 온도 센서(106)는 IED(100) 내의 온도를 측정한다. 온도 센서(106)는 이 측정된 온도를 [0015]나타내는 신호를 생성하고 이 신호를 프로세서(110)에 전송한다. 프로세서(110)는 상기 알려진 온도 오프셋을가산 또는 감산함으로써 각 구성 요소(104)의 추정 온도를 결정한다. 가령, 프로세서(110)는 온도 센서(106)로부터 측정된 온도에/로부터 △T1를 적절하게 가산/감산함으로써 제 1 구성 요소(112)의 추정 온도를 결정한다.또한, 프로세서(110)는 온도 센서(106)로부터 측정된 온도에/로부터 △TA를 적절하게 가산/감산함으로써IED(100)의 내부 동작 온도와 주변 환경(108)의 온도 간의 온도차의 추정치를 결정한다. 각 구성 요소(104) 및/또는 온도 센서(106)를 탑재하는데 사용된 탑재 스타일, 순환 공기의 패턴 등과 같은 외 [0016]적인 환경들이 IED(100) 내의 온도 프로파일에 영향을 주며, 이로써 각 구성 요소(104)의 온도 추정치의 정확도가 영향을 받는다는 사실을 본 기술 분야의 당업자는 잘 이해하고 있을 것이다.도 2는 전기 서지를 모니터링 및/또는 측정하는데 사용되는 예시적인 IED(200)의 개략도이다. IED(200)는 다수 [0017]의 입력부(202), 적어도 하나의 접지 지점(204) 및 제 1 단부(208)에서 입력부(202)에 접속되는 다수의 서지 억제 회로(206)를 포함하고 있다. 또한, 각 서지 억제 회로(206)는 제 2 단부(210)에서 션트(shunt)(212)에 접속되어서 션트(212) 양단의 측정 가능한 전압을 생성한다. 또한, 각 서지 억제 회로(206)는 캐패시터 및/또는 비선형 저항을 사용하여서 구현된다. 션트(212)는 예를 들자면 서지 전류 내의 원하는 주파수 성분을 포획하도록설계된 저항 또는 RLC 회로에 의해서 구현된다. 예시적인 실시예에서, 션트(212) 양단 간에 생성된 전압은 서지 측정 회로(214)에 의해서 측정된다. 이 서지 측정 회로(214)는 그 측정된 전압을 나타내는 신호를 생성하여서 이 신호를 프로세서(216)에 전송한다. 상기 측정된 서지 전압을 생성한 서지 전류는 션트(212)에 의해 접지지점(204)으로 션트된다. 다른 실시예에서, 션트(212)는 고주파수 성분들을 서지 전류를 나타내는 신호로 적분하기 위한 다수의 캐패시터에 의해서 구현되며, 서지 측정 회로(214)는 다수의 표준 증폭기에 의해서 구현된다.이러한 실시예에서, 서지 측정 회로(214)는 신호를 증폭하여 이 증폭된 신호를 아날로그-디지털 변환기(A/Dconverter)(미도시)에 전송하며, 이 아날로그-디지털 변환기는 그 신호를 디지털화하여서 디지털 신호를 프로세서(216)에 전송한다. 서지 전류의 나머지 성분들은 션트(212)에 의해서 접지 지점(204)으로 션트된다.동작 동안, 서지 억제 회로(206)는 고주파수 신호 성분에 대한 바이패스 경로를 생성하고 이 고주파수 신호 성 [0018]분을 접지 지점(204)으로 션트시켜서 IED(200) 내의 다른 내부 회로(미도시)가 과도한 전기적 스트레스를 받지않게 한다. 예시적인 실시예에서, 서지 전류는 입력부(202)를 통해서 IED(200) 내부로 흐른다. 서지 전류는각 입력부(202)로부터 해당 서지 억제 회로(206)로 흐르게 되고 이로써 서지 전류는 다른 내부 IED 회로를 바이패스하게 된다. 이어서, 서지 전류는 션트(212)를 통해서 흐르게 되며 이로써 이 서지 전류 및 션트(212)의 저항에 비례하는 서지 전압이 생성된다. 이어서, 이 서지 전류는 접지 지점(204)으로 흐른다. 서지 전압은 서지측정 회로(214)에 의해서 측정된다. 서지 측정 회로(214)는 서지 전압을 나타내는 신호를 생성하여 이를 프로세서(216)에 전송한다. 다른 실시예에서, 서지 전류는 션트(212)를 통해서 흐르고 이 션트는 서지 전류에 대응하는 신호를 생성한다. 서지 측정 회로(214)는 이 신호를 증폭하여서 프로세서(216)에 전송한다.도 3은 접지 지점과 관련하여서 입력이 올바르지 않게 접지된 바를 검출하는데 사용되는 예시적인 IED(300)의 [0019]개략도이다. IED(300)와 같은 IED가 전류 및/또는 전압의 2 차 생성기(secondary generator)에 접속되는 경우에, 2 차 전압 및/또는 2 차 전류를 운반하는 적어도 하나의 배선은 일반적으로 접지된다. 2 차 생성기의 일례는 고전압 변압기이다. 배선을 접지하게 되면 전류 및/또는 전압의 1 차 생성기와의 용량 결합이 방지된다. 예시적인 실시예에서, IED(300)는 고전압 전류 변환기(302) 및 전압 변압기(304)를 포함하며, 이들 모두는 각각 [0020]의 입력부(306,308)에 접속되어 있다. 구체적으로, 전류 입력부(306)는 입력 단자(310)를 포함하고, 전압 입력부(308)는 입력 단자(312)를 포함한다. IED(300)는 또한 접지된 입력 단자(314,316)를 포함하며, 이들 각각은각각의 입력부(306,308)에 대응한다. 전류 변환기(302)는 제 1 차 회로(primary circuit)(318) 및 접지된 입력 단자(314)에 접속된 제 2 차 회로(secondary circuit)(320)를 포함한다. 마찬가지로, 전압 변압기(304)는제 1 차 회로(322) 및 접지된 입력 단자(316)에 접속된 제 2 차 회로(324)를 포함한다. 두 제 2 차 회로(320,324)를 접지시킴으로써 접지된 입력 단자(314,316)는 접지 전위로 유지하고 접지되지 않은 입력 단자(310,312)는 접지 전위에 비해서 상대적으로 낮은 전압으로 유지된다. 전류 입력부(306)의 임피던스는 입력 단자(310) 및 접지된 입력 단자(314) 양자를 접지 전위와 실질적으로 동등한 전위로 유지시킨다. 또한, 전압 입력부(308)의 임피던스는 입력 단자(312) 및 접지된 입력 단자(316)를 가령 10.0 볼트 또는 100.0 볼트와 같은상대적으로 낮은 전압 차 내에 있도록 유지시킨다. 예시적인 실시예에서, IED(300)는 접지 단자(326)를 더 포공개특허 10-2011-0020830-11-함하며, 이 접지 단자(326)는 전류 입력 단자(310)를 자신에 대해서 거의 접지 전위 상태로 유지시킨다. 또한,접지 단자(326)는 전압 입력 단자(312)를 자신에 대해서 낮은 전위 상태로 유지시킨다.예시적인 실시예에서, IED(300)는 전류 입력부(306)와 전압 입력부(308) 간의 전압을 모니터링하는 다수의 전압 [0021]검출 회로(328)를 더 포함한다. 보다 구체적으로 말하자면, 제 1 전압 검출 회로(330)는 전류 입력 단자(310)와 접지 단자(314) 간의 전압을 모니터링하고, 제 2 전압 검출 회로(332)는 전압 입력 단자(312)와 접지 단자(316) 간의 전압을 모니터링한다. 전압 검출 회로(328)는 입력부(306,308)에 입력되는 신호 중 고주파수 성분에 응답할 뿐만 아니라 대략 50.0 Hz 및 대략 60.0 Hz의 시스템 주파수 성분에도 응답한다. 각 전압 검출 회로(328)는 검출된 전압을 나타내는 신호를 생성하고 이를 디지털화하여서 프로세서(334)에 전송한다.동작 동안, 고전압 전류 변환기(302) 및 전압 변압기(304)는 입력 신호들을 생성하여서 이 입력 신호들을 전류 [0022]입력부(306) 및 전압 입력부(308)에 각기 전송한다. 각 입력부(306,308)의 단자들 간의 전압은 전압 검출 회로(328)에 의해서 모니터링된다. 보다 구체적으로, 제 1 전압 검출 회로(330)는 전류 입력 단자(310)와 접지 단자(314) 간의 전압을 모니터링하고, 제 2 전압 검출 회로(332)는 전압 입력 단자(312)와 접지 단자(316) 간의전압을 모니터링한다. 각 전압 검출 회로(328)는 검출된 전압을 나타내는 신호를 생성하고 이를 디지털화하여서 프로세서(334)에 전송한다.도 4는 IED를 사용하는 예시적인 예측적 유지 관리 방법(400)을 설명하는 흐름도이다. IED는 가용한 규격 및 [0023]설계 관행에 있어서 극한 온도, 전기 서지, 부적합한 접지, 고전압 노출 등과 같은 요인들을 견디도록 설계되지만, 이러한 요인들은 IED에 손상을 가하여 IED의 수명에 영향을 주게 되어 있다. 또한, IED가 이러한 환경 요인들에 반복적으로 노출되게 되면, IED의 예상 수명이 단축된다. 따라서, 본 방법(400)은 상술한 바와 같이 측정된 데이터를 사용하여서 이 측정된 데이터를 IED를 위해서 개발된 신뢰성 모델에 적용한다. 본 방법(400)은(도 1에서 도시된) IED(100)를 참조하여서 이하에서 기술될 것이지만, 본 방법은 이로만 한정되는 것이 아니라임의의 IED에 대한 유지 관리 사항을 예측하는데 적용될 수 있다.예시적인 실시예에서, 신뢰성 모델이 개발된다(402). 가령, 마이크로제어기와 같은 집적 회로는 통상적으로 동 [0024]작 온도가 특정 값을 초과하면 온도-신뢰성 관계를 신뢰성이 저하되는 것으로 나타낸다. 이러한 정보는 집적회로 제조자로부터 입수 가능하며 테스트를 통해서 입증될 수 있다. 가령, 115℃의 내부 온도에서 동작하는 집적 회로는 75℃의 내부 온도에서 동작하는 경우보다 그 예상 수명이 반으로 줄어든다. IED(100)의 제조자는IED(100)의 온도 프로파일을 기초로 하여서 (도 1에 도시된) 각 구성 요소(104)의 내부 동작 온도를 도출하거나상술한 바와 같이 (도 1에 도시된) IED 샤시(102) 내의 하나 이상의 지점들을 직접 측정함으로써 각 구성 요소의 내부 동작 온도를 도출한다. 일 실시예에서, 장기 노출 데이터(long-term exposure factor)에 적용되는 신뢰성 모델은 결정론적(deterministic) 신뢰성 모델이다. 다른 실시예에서, 장기 노출 데이터에 적용되는 신뢰성 모델은 확률론적(stochastic) 신뢰성 모델이다. 또 다른 실시예에서, 상기 신뢰성 모델은 가령 퍼지 수학(fuzzy mathematics) 및/또는 인공 신경 회로망을 기초로 한다. 일 실시예에서, 이 신뢰성 모델은 IED(100)의동작 코드 내에 통합된다. 다른 실시예에서, 신뢰성 모델은 IED(100)에 의해서 데이터 개체로서 저장된다. 이렇게 신뢰성 모델이 저장되는 방식에서는 IED 운영자는 이 신뢰성 모델을 업그레이드할 수 있다. 가령, 운영자는 IED 설치 사이트에서 신뢰성 모델을 수동으로 업그레이드하거나 이 신뢰성 모델은 IED와 떨어진 중앙 시스템에 위치한 애플리케이션에 의해서 업그레이드될 수 있다.다음으로, 환경적 요소들이 가령 도 1에 도시된 온도 센서(106)를 사용하여서 IED(100) 내에서 측정된다(404). [0025]이 측정된 환경적 요소들이 처리되고 이로써 IED(100)의 동작 상태 이력(historical operating condition)을나타내는 장기 노출 데이터를 결정한다(406). 구체적으로, 도 1에 도시된 프로세서(110)는 원 측정치(rawmeasuremnt), 원 측정치의 적분치, 원 측정치의 평균치 및/또는 원 측정치의 최대치를 결정한다. 가령, 온도센서(106)에 의해서 기록된 내부 온도 판독 결과 집합이 -40.0℃ 내지 -25.0℃, -25.0℃ 내지 0.0℃, 0.0℃ 내지 25.0℃, 25.0℃ 내지 30.0℃, 30.0℃ 내지 35.0℃ 등과 같은 온도 대역 별로 분류된다. 이어서, 각 온도 대역에 대한 총 동작 시간이 프로세서(110)에 의해서 누산된다.예시적인 실시예에서, 장기 노출 데이터는 IED(100) 및/또는 각 구성 요소(104)의 신뢰성 모델에 적용된다 [0026](408). 온도-신뢰성 관계 또는 신뢰성 모델을 사용하여서, 각 구성 요소(104)의 잔여 수명 및/또는 고장 확률이 상기 장기 노출 데이터를 기초로 하여서 프로세서(110)에 의해서 계산된다. 보다 구체적으로 말하자면, 프로세서(110)는 상기 장기 노출 데이터 및 신뢰성 모델을 기초로 하여서 IED의 잔여 수명의 수치를 결정한다(410). 이러한 수치의 실례는 다음으로만 한정되는 것은 아니지만 IED(100)의 잔여 수명, IED(100)의 기사용기간(used life) 및 IED(100)의 마모 레이트(wear rate)를 포함한다. 일 실시예에서, IED(100)의 기사용 기간공개특허 10-2011-0020830-12-이 시 단위, 일 단위, 주 단위, 월 단위 및/또는 년 단위와 같은 다양한 시간 단위로서 표현된다. 수치의 또다른 실례는 정상적 마모 대 실제적 마모의 비를 포함한다. 일 실시예에서, IED(100)의 마모 레이트는IED(100)에 대해서 허용 가능한 특정 범위의 동작 상태를 벗어난 동작 상태를 기초로 한다. 일 실시예에서, 장기 노출 데이터들은 IED(100)로부터 멀리 떨어진 중앙 시스템에 위치한 애플리케이션으로 전송되며, 이로써 이중앙 시스템에 위치한 애플리케이션은 다수의 IED로부터 수신된 장기 노출 데이터들을 하나 이상의 신뢰성 모델에 적용하여 각 개별 IED에 대한 잔여 수명의 수치를 결정한다.본 발명의 예시적인 실시예에서, 프로세서(110)는 IED의 잔여 수명의 수치를 사전 선정된 잔여 수명 값과 비교 [0027]한다(412). 만일 이 IED의 잔여 수명의 수치가 상기 사전 선정된 잔여 수명 값보다 작으면, 프로세서(110)는알람(alarm)과 같은 신호를 생성한다(414). 이러한 신호는 가령 IED(100)의 결정된 잔여 수명, IED(100)의 결정된 기사용 기간, IED(100)의 결정된 마모 레이트 및/또는 초과 동작 상태들을 기초로 한다. 일 실시예에서,상기 신호는 알파벳 문자 메시지 또는 발광 다이오드(LED) 등을 이용해서 IED 운영자에게 그 상황을 시각적으로알린다. 다른 실시예에서, 이 신호는 물리적으로 오프/온 출력이다. 또 다른 실시예에서, 이 신호는 프로세서(110)에 의해서 생성되는, IED(100)의 동작 코드 및/또는 프로그래밍 코드 내의 가상 포인트일 수 있다. 가령,이러한 경우에는, 유지 관리 출력 릴레이(maintenance output relay) 또는 장애 시 안전 릴레이(fail saferelay)가 개방되어 그 릴레이가 비활성화되어서 IED 운영자에게 IED(100)가 복구가 필요하거나 IED(100)를 주의할 필요가 있다는 것을 알린다. 이러한 경우에, IED(100)는 동작 환경이 비정상임을 IED 운영자에게 알리면서계속하여서 자신의 기능을 수행할 수 있다. 또한, 상기 개방된 회로는 IED(100)가 가속적으로 마모를 받고 있거나 IED(100)의 잔여 수명이 서비스가 필요한 지점에 도달했음을 알린다. 예시적인 실시예에서, 이러한 신호의 감도 및/또는 기능은 사용자 설정 사항을 통해서 선택될 수 있다.일 실시예에서, IED(100)에 고장이 발생했거나 특정 구성 요소(104)에 고장이 발생했으면, IED(100)에 대해서 [0028]결정된 장기 노출 데이터들은 도시되지 않은 메모리 내에 저장되고 이로써 이 장기 노출 데이터들은 가령 서비스 기술자에 의해서 추출될 수 있다. 이와 달리, 이 장기 노출 데이터들은 프로세서(110)에 의해서 원격 저장장치(미도시)에 전송되어서 저장될 수 있다. IED(100) 및/또는 특정 구성 요소(104)가 고장난 후에 IED(100)가복구 또는 새롭게 단장되기 위해서 보내지면, IED(100)가 복구 또는 새롭게 단장되면 IED(100)에 대해서 개선된동작 상태가 반영될 수 있도록 저장된 장기 노출 데이터는 IED(100)의 실제 마모 정도를 반영하도록 증가된다.또한, 신뢰성 모델은 그 복구 동안 서비스 기술자에 의해서 수집된 장기 노출 데이터와 같은 데이터를 반영하도록 갱신된다. 신뢰성 데이터에서 큰 변화가 있으면, IED(100)의 제조자는 새로 제조되는 장치들에서는 그 신뢰성 모델을 갱신한다.본 명세서에서 개시된 시스템 및 방법은 센서 및 이 센서로부터 획득된 정보를 IED로 하여금 수집 및 분석하게 [0029]하는 프로세서를 사용함으로써 지능형 전자 장치(IED)에서 필요한 유지 관리를 예측한다. 이렇게 정보를 수집및 분석함으로써 신뢰성 모델과 같은 IED의 예상 수명을 알리는 내장된 지식과 함께 IED의 동작 상태 및 노출상황을 이해할 수 있게 되며 예측적 유지 관리 요청 및/또는 신호를 생성한다. 본 발명의 실시예들 또는 측면들의 여러 요소들을 설명할 때에 사용된 명사의 단수형은 해당 요소가 복수 개 존 [0030]재하는 것을 배제하지 않는다. 또한, 본 명세서에서 사용되는 용어 \"포함한다\", \"있다\", \"구비한다\" 또는 \"갖는다\"는 배타적인 방식으로 해석되지 말아야 하는데, 즉 열거된 요소들 이외의 다른 요소들의 존재를 배제하지않는다.지능형 전자 장치(IED)에 대한 유지 관리를 예측하는 방법 및 시스템의 예시적인 실시예들이 지금까지 상세하게 [0031]설명되었다. 그러나, 이러한 방법 및 시스템은 본 명세서에서 기술된 특정 실시예들로만 한정되는 것이아니라, 이보다는 방법의 단계들 또는 시스템의 구성 요소들은 본 명세서에서 개시된 다른 단계 또는 다른 구성요소와는 별도로 독립적으로 사용될 수 있다. 또한, 상술한 단계들 또는 구성 요소들은 다른 시스템 또는 다른방법에서 규정되거나 다른 시스템 또는 다른 방법과 결합되어서 사용될 수 있다. 따라서, 상술한 단계들 또는구성 요소들이 본 명세서에서 개시된 방법 및 시스템에서만 실시되는 것으로 한정되지는 않는다.상기 본 발명에 대한 기재는 다양한 실례들을 사용하여서 본 발명에 대한 최상의 실시 형태가 포함되게 본 발명 [0032]을 개시하였으며 본 기술 분야의 당업자가 임의의 디바이스 또는 시스템을 제조 및 사용하고 임의의 인용된 방법들을 수행하는 것을 포함하여서 본 발명을 실시할 수 있도록 개시하고 있다. 본 발명의 특허 범위는 청구 범위에 의해서 규정되며 본 기술 분야의 당업자에게는 가능한 다른 실례들을 포함한다. 이러한 다른 실례들은 청구 범위에서 사용되는 언어가 의미하는 바와 다르지 않는 구조적 요소들을 구비하거나 청구 범위에서 사용되는언어가 의미하는 바와 차이는 있으나 그 차이가 실질적이지 않는 균등한 요소를 포함하는 경우에는 이하의 청구공개특허 10-2011-0020830-13-범위 내에 포함되는 바로 해석되어야 한다.도면도면1공개특허 10-2011-0020830-14-도면2공개특허 10-2011-0020830-15-도면3공개특허 10-2011-0020830-16-도면4공개특허 10-2011-0020830-17-"}
{"patent_id": "10-2010-7028369", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "예측적 유지 관리 방법 및 시스템이 개시된다. 본 방법은 지능형 전자 장치 내의 다수의 센서를 사용하여서 환 경적 상태를 측정하는 단계와, 상기 환경적 상태를 처리하여서 상기 지능형 전자 장치의 동작 상태 이력을 나타 내는 장기 노출 데이터(long-term exposure factor)를 결정하는 단계와, 상기 장기 노출 데이터에 신뢰성 모델을 적용하는 단계와, 상기 장기 노출 데이터 및 상기 신뢰성 모델을 기초로 하여서 상기 지능형 전자 장치의 수명의 수치를 결정하는 단계와, 상기 결정된 수치와 사전 선정된 경계치를 서로 비교하는 단계와, 상기 결정된 수치가 상기 사전 선정된 경계치를 벗어나 있는지의 여부를 알리는 단계를 포함한다."}
{"patent_id": "10-2010-7028369", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전반적으로 혹독한 환경에서 사용되는 지능형 전자 장치(intelligent electronic device; IED)를 유 지 관리하는 분야에 관한 것으로 보다 구체적으로, 본 발명은 지능형 전자 장치의 동작 상태의 계속적인 모니터 링, 외부 환경에 대한 노출 데이터 및 지능형 전자 장치 내에 내장된 신뢰성 모델(reliability model)에 기초하 여 지능형 전자 장치를 예측적으로 유지 관리(predictive maintenance)하는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2010-7028369", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "내장된 생산, 전송, 분배 및 에너지 변환 수단을 포함하는 전기 그리드(electrical grid)는 종종 지능형 전자 장치(IED)의 보조를 받아서 동작한다. 이러한 지능형 전자 장치는 전기 그리드를 고장(faults) 및 다른 비정상 적인 상태로부터 보호하고 에너지 사용 상황을 모니터링 및 측정하고 이와 다른 측면의 전기 그리드 동작을 제 어한다. 이러한 지능형 전자 장치는 다음으로만 한정되는 것은 아니지만 보호 계전기, 원격 단말 유닛, 프로그 램가능한 로직 제어기(PLC), 미터, 로컬 HMI(local human machine interface), 이더넷 스위치 및/또는 라우터, 모뎀 및 다른 유사한 장치들을 포함한다. 지능형 전자 장치들은 종종 고압 변전소 제어 하우스, 중간 전압 계폐기(medium voltage switchgear), 발전소, 산업용 플랜 및 모터 제어 센터와 같은 거칠고 험한 환경에 설치되어서 동작한다. 따라서, IED는 극한 온도, 전자기 간섭, 전기 서지(surge), 기계적 충격 및 진동 및 화학제와 같은 환경에 노출되게 된다. 적어도 몇몇 알려진 IED는 산업상의 규격 및/또는 확립된 설계상의 관행에 의해서 사전 규정된 바대로 상기와 같은 환경을 견디거나 제조업자들 간의 경쟁에 의해서 그러한 험한 환경을 견디도록 설계되고 있다. 적어도 몇몇 알려진 IED는 전기 그리드 내에서 보호 기능 및/또는 제어 기능과 같은 중요한 기능들을 수행한다. 이로써, 작동 시간 동안 기능들을 완벽하게 수행하도록 유지될 필요가 있다. 이렇게 IED가 요구되는 기능들을 필요할 때에 수행하도록 하기 위해서는, IED를 주기적으로 검사하고 유지 관리할 필요가 있다. 이러한 주기적 유지 관리 절차는 전기 기계적 기술 및 아날로그 기술들을 채용한 보호 장치, 제어 장치 및/또는 측정 장치의 이전 세대의 사용 이후부터 변해오고 있다. 적어도 몇몇 알려진 주기적 유지 관리 절차에서는, 문제 징후를 찾 기 위해서 IED를 시각적으로 검사하고 IED를 서비스 현장으로부터 주기적으로 취하며 이를 자신이 속한 시스템 으로부터 떼어내어서 그 기능을 테스트한다. 이러한 주기적 유지 관리 절차에서 그 검사 주기의 간격은 2 내지 3 년 사이일 수 있으며 소정의 사용자의 과거 경험 사항, 검사되고 있는 IED의 제조사, 평균 동작 상태 또는 애 플리케이션의 중요 정도와 같은 요소 또는 다른 관련 요소들에 근거하고 있다. 그러나, IED들이 서로 다른 예상 수명을 가지거나 고장율을 가지기 때문에 상기와 같은 주기적 유지 관리 절차 들은 최적화되지 못한다. IED들은 평균적으로 예상되는 동작 상태와는 크게 상이한 동작 상태 하에서 설치될 수 있다. 가령, 이러한 가변적인 동작 상태로서는 평균 주변 온도와 같이 용이하게 입증할 수 있는 요소들이 있거나 전자기 간섭 노출 및 국소적 동작 온도와 같이 용이하게 입증할 수 없는 숨겨진 요소들이 있을 수 있다. 때로는, 소정의 시설 내의 모든 종류의 IED들이 그들의 동작 상태(operating condition) 및/또는 제조사에 상관 없이 일괄적으로 설치되기도 한다. 이로써, 몇몇 IED들은 과잉 유지 관리되는 한편 몇몇 IED들은 평균에 미달 할 정도로 유지 관리되지 않아서, 예상되지 않은 고장이 발생한다. 또한, 이러한 주기적 유지 관리 절차에서는, IED의 사용자 및/또는 운영자에게 비용 절감에 대한 중대한 가능성 이 다루어지지 않고 있다. 가령, 관련된 노동의 양으로 인해서 유지 관리 비용이 높을 수 있으며, 여분의 장치 가 제공되지 않고 있다면 해당 유지 관리 절차에서는 보호 및/또는 제어되고 있는 프로세스 및/또는 자원들을 중지시킬 필요가 있다. 또한, IED에 예상하지 않은 고장이 발생하게 되면 비상 상황 형태의 대응이 요구되는데, 이러한 비상 상황 형태의 대응 시에는 스케줄에 없던 작업이 실시되거나 스케줄에 없던 예비 부품 이 사용되거나 적절한 준비도 없이 작업을 해야 하는 비효율성이 발생하거나 보호 및 제어된 자원들이 스케줄에 맞지 않게 중지되어 이와 관련된 처리 단계들도 역시 중지되고 만다."}
{"patent_id": "10-2010-7028369", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "적어도 몇몇 알려진 IED들은 마이크로프로세서를 포함하고 있어서 이 마이크로프로세서를 사용하여서 IED는 센 서로부터의 정보를 수집하여서 분석한다. 그러나, IED의 동작 상태(operating condition)와 노출 정황 (exporsure)을 이해하기 위한 정보 수집 및 분석을 신뢰성 모델과 같은 IED의 예상 수명을 알려주는 내장형 정 보와 함께 활용하여서 예측적 유지 관리 요청 및/또는 예측적 유지 관리 신호를 생성하는 방법 및 시스템이 필 요하다."}
{"patent_id": "10-2010-7028369", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따라서, 지능형 전자 장치(IED)에 대한 유지 관리(maintenance)를 예측하는 방법이 제공된 다. 이 방법은 상기 지능형 전자 장치 내의 다수의 센서를 사용하여서 환경적 상태를 측정하는 단계와, 상기 환경적 상태를 처리하여서 상기 지능형 전자 장치의 동작 상태 이력을 나타내는 장기 노출 데이터(long-term exposure factor)를 결정하는 단계와, 상기 장기 노출 데이터에 신뢰성 모델을 적용하는 단계와, 상기 장기 노 출 데이터 및 상기 신뢰성 모델을 기초로 하여서 상기 지능형 전자 장치의 수명의 수치를 결정하는 단계와, 상 기 결정된 수치와 사전 선정된 경계치를 서로 비교하는 단계와, 상기 결정된 수치가 상기 사전 선정된 경계치를 벗어나 있는지의 여부를 알리는 단계를 포함한다. 본 발명의 다른 측면에 따라서, 다수의 지능형 전자 장치(IED)에 대한 신뢰성 모델을 확립 및 유지 관리하는 시 스템이 제공된다. 이 시스템은 상기 다수의 지능형 전자 장치로부터 장기 노출 데이터를 취득하는 취득부와, 상기 다수의 지능형 전자 장치 중 고장난 지능형 전자 장치로부터 고장 정보를 수신하는 입력부와, 상기 취득부 와 상기 입력부에 접속된 프로세서를 포함하며, 상기 프로세서는, 상기 다수의 지능형 전자 장치의 각각의 신뢰 성을 결정하고, 상기 결정된 신뢰성과 상기 장기 노출 데이터 간을 상관시키는 신뢰성 모델을 도출하도록 프로 그램된다. 본 발명의 또 다른 측면에 따라서, 환경적 데이터를 취득하는 다수의 센서를 그 내부에 포함하는 지능형 전자 장치의 동작 상태를 모니터링하는 시스템이 제공된다. 이 시스템은 상기 다수의 지능형 전자 장치로부터 장기 노출 데이터를 취득하는 취득부와, 상기 다수의 지능형 전자 장치 중 고장난 지능형 전자 장치로부터 고장 정보 를 수신하는 입력부와, 상기 취득부와 상기 입력부에 접속된 프로세서를 포함하며, 상기 프로세서는 상기 다수 의 지능형 전자 장치의 각각의 신뢰성을 결정하고, 상기 결정된 신뢰성과 상기 장기 노출 데이터 간을 상관시키 는 신뢰성 모델을 도출하며, 상기 지능형 전자 장치의 수명의 수치를 사전 선정된 경계치와 비교하며, 상기 결 정된 수치가 상기 사전 선정된 경계치를 벗어나 있는지의 여부를 알리는 신호를 생성하도록 프로그램된다."}
{"patent_id": "10-2010-7028369", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 기술되는 실시예들이 온도, 전기 서지 및 접지 상황과 같은 환경적 요소들을 기반으로 하여 지능형 전 자 장치(IED)의 수명을 모니터링하는 것을 기술하지만, 다른 환경적 요소들도 역시 모니터링될 수 있음을 본 기 술 분야의 당업자는 이해할 것이다. 또한, 환경적 요소들에 의한 영향은 엔지니어링 또는 건설의 흐름, 또는 예상되지 않은 이벤트에 의해서 변화되거나, 사용자가 IED가 가속적으로 마모되게 IED를 의도적으로 사용하는 바에 의해서 변화될 수 있다는 것을 본 기술 분야의 당업자는 이해할 것이다. 또한, 소형화 및/또는 집적화로 인해서 IED는 이하에서 기술될 바와 같이 하나의 센서를 포함하거나 다수의 센서를 포함하며, 이로써 각 IED는 다수의 환경적 요소들을 동시에 모니터링한다. 가령, IED는 다수의 센서를 포함하며, 이로써 IED는 기계적 충 격, 진동, 습기, 화학적 요소에 대한 노출, 전원 레벨, 복사형 전자기 간섭 및/또는 전도형 전자기 간섭 등을 동시에 모니터링한다. 도 1은 동작 온도를 모니터링하는데 사용되는 예시적인 지능형 전자 장치(IED)의 개략도이다. IED는 다수 의 구성 요소 및 적어도 하나의 온도 센서를 포함하는 샤시(chassis)를 포함한다. 본 예시적인 실시예에서, 구성 요소들은 다음으로만 한정되지는 않지만 캐패시터, 마이크로제어기, 그래픽 디스플레이 및/또는 통신 송수신기와 같은 중요한 구성 요소(critical component)들이다. 온도 센서는 IED 내 부의 온도뿐만 아니라 외부 주변의 온도도 모니터링할 수 있도록 IED 내에서 배치되어 있다. 보다 구체적으로, 프로세서가 각 구성 요소의 온도와 외부 주변의 온도 간의 온도 구배(gradient)를 결정할 수 있도록, 온도 센서는 각 구성 요소의 온도 및 외부 주변의 온도를 정확하게 추정할 수 있게 위치하고 있다. 동작 동안, 그리고 대기 상태 조건(steady state condition) 하에서, 온도 센서에 의해서 측정된 온도는 외부 주변에 대해서는 실질적으로 일정한 오프셋 △TA로 유지된다. 또한, 온도 센서에 의해서 측정 된 온도는 각 구성 요소에 대해서는 실질적으로 일정한 오프셋으로 유지된다. 가령, 온도 센서에 의 해서 측정된 온도는 제 1 구성 요소에 대해서는 실질적으로 일정한 제 1 오프셋 △T1로 유지된다. 온도 센서에 의해서 측정된 온도는 제 2 구성 요소에 대해서는 실질적으로 일정한 제 2 오프셋 △T2로 유지된다. 각 오프셋 △TA, △T1, △T2는 IED를 구축하는 동안의 계산 결과 및/또는 측정 결과 및/또는 IED를 구 축한 후의 테스트 결과에 의해서 결정된다. 예시적인 실시예에서, 온도 센서는 IED 내의 온도를 측정한다. 온도 센서는 이 측정된 온도를 나타내는 신호를 생성하고 이 신호를 프로세서에 전송한다. 프로세서는 상기 알려진 온도 오프셋을 가산 또는 감산함으로써 각 구성 요소의 추정 온도를 결정한다. 가령, 프로세서는 온도 센서로 부터 측정된 온도에/로부터 △T1를 적절하게 가산/감산함으로써 제 1 구성 요소의 추정 온도를 결정한다. 또한, 프로세서는 온도 센서로부터 측정된 온도에/로부터 △TA를 적절하게 가산/감산함으로써 IED의 내부 동작 온도와 주변 환경의 온도 간의 온도차의 추정치를 결정한다. 각 구성 요소 및/또는 온도 센서를 탑재하는데 사용된 탑재 스타일, 순환 공기의 패턴 등과 같은 외 적인 환경들이 IED 내의 온도 프로파일에 영향을 주며, 이로써 각 구성 요소의 온도 추정치의 정확도 가 영향을 받는다는 사실을 본 기술 분야의 당업자는 잘 이해하고 있을 것이다. 도 2는 전기 서지를 모니터링 및/또는 측정하는데 사용되는 예시적인 IED의 개략도이다. IED는 다수 의 입력부, 적어도 하나의 접지 지점 및 제 1 단부에서 입력부에 접속되는 다수의 서지 억 제 회로를 포함하고 있다. 또한, 각 서지 억제 회로는 제 2 단부에서 션트(shunt)에 접속 되어서 션트 양단의 측정 가능한 전압을 생성한다. 또한, 각 서지 억제 회로는 캐패시터 및/또는 비 선형 저항을 사용하여서 구현된다. 션트는 예를 들자면 서지 전류 내의 원하는 주파수 성분을 포획하도록 설계된 저항 또는 RLC 회로에 의해서 구현된다. 예시적인 실시예에서, 션트 양단 간에 생성된 전압은 서 지 측정 회로에 의해서 측정된다. 이 서지 측정 회로는 그 측정된 전압을 나타내는 신호를 생성하여 서 이 신호를 프로세서에 전송한다. 상기 측정된 서지 전압을 생성한 서지 전류는 션트에 의해 접지 지점으로 션트된다. 다른 실시예에서, 션트는 고주파수 성분들을 서지 전류를 나타내는 신호로 적분 하기 위한 다수의 캐패시터에 의해서 구현되며, 서지 측정 회로는 다수의 표준 증폭기에 의해서 구현된다. 이러한 실시예에서, 서지 측정 회로는 신호를 증폭하여 이 증폭된 신호를 아날로그-디지털 변환기(A/D converter)(미도시)에 전송하며, 이 아날로그-디지털 변환기는 그 신호를 디지털화하여서 디지털 신호를 프로세 서에 전송한다. 서지 전류의 나머지 성분들은 션트에 의해서 접지 지점으로 션트된다. 동작 동안, 서지 억제 회로는 고주파수 신호 성분에 대한 바이패스 경로를 생성하고 이 고주파수 신호 성 분을 접지 지점으로 션트시켜서 IED 내의 다른 내부 회로(미도시)가 과도한 전기적 스트레스를 받지 않게 한다. 예시적인 실시예에서, 서지 전류는 입력부를 통해서 IED 내부로 흐른다. 서지 전류는 각 입력부로부터 해당 서지 억제 회로로 흐르게 되고 이로써 서지 전류는 다른 내부 IED 회로를 바이 패스하게 된다. 이어서, 서지 전류는 션트를 통해서 흐르게 되며 이로써 이 서지 전류 및 션트의 저 항에 비례하는 서지 전압이 생성된다. 이어서, 이 서지 전류는 접지 지점으로 흐른다. 서지 전압은 서지 측정 회로에 의해서 측정된다. 서지 측정 회로는 서지 전압을 나타내는 신호를 생성하여 이를 프로 세서에 전송한다. 다른 실시예에서, 서지 전류는 션트를 통해서 흐르고 이 션트는 서지 전류에 대응 하는 신호를 생성한다. 서지 측정 회로는 이 신호를 증폭하여서 프로세서에 전송한다. 도 3은 접지 지점과 관련하여서 입력이 올바르지 않게 접지된 바를 검출하는데 사용되는 예시적인 IED의 개략도이다. IED와 같은 IED가 전류 및/또는 전압의 2 차 생성기(secondary generator)에 접속되는 경우 에, 2 차 전압 및/또는 2 차 전류를 운반하는 적어도 하나의 배선은 일반적으로 접지된다. 2 차 생성기의 일례 는 고전압 변압기이다. 배선을 접지하게 되면 전류 및/또는 전압의 1 차 생성기와의 용량 결합이 방지된다. 예시적인 실시예에서, IED는 고전압 전류 변환기 및 전압 변압기를 포함하며, 이들 모두는 각각 의 입력부(306,308)에 접속되어 있다. 구체적으로, 전류 입력부는 입력 단자를 포함하고, 전압 입력 부는 입력 단자를 포함한다. IED는 또한 접지된 입력 단자(314,316)를 포함하며, 이들 각각은 각각의 입력부(306,308)에 대응한다. 전류 변환기는 제 1 차 회로(primary circuit) 및 접지된 입 력 단자에 접속된 제 2 차 회로(secondary circuit)를 포함한다. 마찬가지로, 전압 변압기는 제 1 차 회로 및 접지된 입력 단자에 접속된 제 2 차 회로를 포함한다. 두 제 2 차 회로 (320,324)를 접지시킴으로써 접지된 입력 단자(314,316)는 접지 전위로 유지하고 접지되지 않은 입력 단자 (310,312)는 접지 전위에 비해서 상대적으로 낮은 전압으로 유지된다. 전류 입력부의 임피던스는 입력 단 자 및 접지된 입력 단자 양자를 접지 전위와 실질적으로 동등한 전위로 유지시킨다. 또한, 전압 입 력부의 임피던스는 입력 단자 및 접지된 입력 단자를 가령 10.0 볼트 또는 100.0 볼트와 같은 상대적으로 낮은 전압 차 내에 있도록 유지시킨다. 예시적인 실시예에서, IED는 접지 단자를 더 포함하며, 이 접지 단자는 전류 입력 단자를 자신에 대해서 거의 접지 전위 상태로 유지시킨다. 또한, 접지 단자는 전압 입력 단자를 자신에 대해서 낮은 전위 상태로 유지시킨다. 예시적인 실시예에서, IED는 전류 입력부와 전압 입력부 간의 전압을 모니터링하는 다수의 전압 검출 회로를 더 포함한다. 보다 구체적으로 말하자면, 제 1 전압 검출 회로는 전류 입력 단자 와 접지 단자 간의 전압을 모니터링하고, 제 2 전압 검출 회로는 전압 입력 단자와 접지 단자 간의 전압을 모니터링한다. 전압 검출 회로는 입력부(306,308)에 입력되는 신호 중 고주파수 성분 에 응답할 뿐만 아니라 대략 50.0 Hz 및 대략 60.0 Hz의 시스템 주파수 성분에도 응답한다. 각 전압 검출 회로 는 검출된 전압을 나타내는 신호를 생성하고 이를 디지털화하여서 프로세서에 전송한다. 동작 동안, 고전압 전류 변환기 및 전압 변압기는 입력 신호들을 생성하여서 이 입력 신호들을 전류 입력부 및 전압 입력부에 각기 전송한다. 각 입력부(306,308)의 단자들 간의 전압은 전압 검출 회로 에 의해서 모니터링된다. 보다 구체적으로, 제 1 전압 검출 회로는 전류 입력 단자와 접지 단 자 간의 전압을 모니터링하고, 제 2 전압 검출 회로는 전압 입력 단자와 접지 단자 간의 전압을 모니터링한다. 각 전압 검출 회로는 검출된 전압을 나타내는 신호를 생성하고 이를 디지털화하여 서 프로세서에 전송한다. 도 4는 IED를 사용하는 예시적인 예측적 유지 관리 방법을 설명하는 흐름도이다. IED는 가용한 규격 및 설계 관행에 있어서 극한 온도, 전기 서지, 부적합한 접지, 고전압 노출 등과 같은 요인들을 견디도록 설계되지 만, 이러한 요인들은 IED에 손상을 가하여 IED의 수명에 영향을 주게 되어 있다. 또한, IED가 이러한 환경 요 인들에 반복적으로 노출되게 되면, IED의 예상 수명이 단축된다. 따라서, 본 방법은 상술한 바와 같이 측 정된 데이터를 사용하여서 이 측정된 데이터를 IED를 위해서 개발된 신뢰성 모델에 적용한다. 본 방법은 (도 1에서 도시된) IED를 참조하여서 이하에서 기술될 것이지만, 본 방법은 이로만 한정되는 것이 아니라 임의의 IED에 대한 유지 관리 사항을 예측하는데 적용될 수 있다. 예시적인 실시예에서, 신뢰성 모델이 개발된다. 가령, 마이크로제어기와 같은 집적 회로는 통상적으로 동 작 온도가 특정 값을 초과하면 온도-신뢰성 관계를 신뢰성이 저하되는 것으로 나타낸다. 이러한 정보는 집적 회로 제조자로부터 입수 가능하며 테스트를 통해서 입증될 수 있다. 가령, 115℃의 내부 온도에서 동작하는 집 적 회로는 75℃의 내부 온도에서 동작하는 경우보다 그 예상 수명이 반으로 줄어든다. IED의 제조자는 IED의 온도 프로파일을 기초로 하여서 (도 1에 도시된) 각 구성 요소의 내부 동작 온도를 도출하거나 상술한 바와 같이 (도 1에 도시된) IED 샤시 내의 하나 이상의 지점들을 직접 측정함으로써 각 구성 요소 의 내부 동작 온도를 도출한다. 일 실시예에서, 장기 노출 데이터(long-term exposure factor)에 적용되는 신 뢰성 모델은 결정론적(deterministic) 신뢰성 모델이다. 다른 실시예에서, 장기 노출 데이터에 적용되는 신뢰 성 모델은 확률론적(stochastic) 신뢰성 모델이다. 또 다른 실시예에서, 상기 신뢰성 모델은 가령 퍼지 수학 (fuzzy mathematics) 및/또는 인공 신경 회로망을 기초로 한다. 일 실시예에서, 이 신뢰성 모델은 IED의 동작 코드 내에 통합된다. 다른 실시예에서, 신뢰성 모델은 IED에 의해서 데이터 개체로서 저장된다. 이 렇게 신뢰성 모델이 저장되는 방식에서는 IED 운영자는 이 신뢰성 모델을 업그레이드할 수 있다. 가령, 운영자 는 IED 설치 사이트에서 신뢰성 모델을 수동으로 업그레이드하거나 이 신뢰성 모델은 IED와 떨어진 중앙 시스템 에 위치한 애플리케이션에 의해서 업그레이드될 수 있다. 다음으로, 환경적 요소들이 가령 도 1에 도시된 온도 센서를 사용하여서 IED 내에서 측정된다. 이 측정된 환경적 요소들이 처리되고 이로써 IED의 동작 상태 이력(historical operating condition)을 나타내는 장기 노출 데이터를 결정한다. 구체적으로, 도 1에 도시된 프로세서는 원 측정치(raw measuremnt), 원 측정치의 적분치, 원 측정치의 평균치 및/또는 원 측정치의 최대치를 결정한다. 가령, 온도 센서에 의해서 기록된 내부 온도 판독 결과 집합이 -40.0℃ 내지 -25.0℃, -25.0℃ 내지 0.0℃, 0.0℃ 내 지 25.0℃, 25.0℃ 내지 30.0℃, 30.0℃ 내지 35.0℃ 등과 같은 온도 대역 별로 분류된다. 이어서, 각 온도 대 역에 대한 총 동작 시간이 프로세서에 의해서 누산된다. 예시적인 실시예에서, 장기 노출 데이터는 IED 및/또는 각 구성 요소의 신뢰성 모델에 적용된다 . 온도-신뢰성 관계 또는 신뢰성 모델을 사용하여서, 각 구성 요소의 잔여 수명 및/또는 고장 확률 이 상기 장기 노출 데이터를 기초로 하여서 프로세서에 의해서 계산된다. 보다 구체적으로 말하자면, 프 로세서는 상기 장기 노출 데이터 및 신뢰성 모델을 기초로 하여서 IED의 잔여 수명의 수치를 결정한다 . 이러한 수치의 실례는 다음으로만 한정되는 것은 아니지만 IED의 잔여 수명, IED의 기사용 기간(used life) 및 IED의 마모 레이트(wear rate)를 포함한다. 일 실시예에서, IED의 기사용 기간이 시 단위, 일 단위, 주 단위, 월 단위 및/또는 년 단위와 같은 다양한 시간 단위로서 표현된다. 수치의 또 다른 실례는 정상적 마모 대 실제적 마모의 비를 포함한다. 일 실시예에서, IED의 마모 레이트는 IED에 대해서 허용 가능한 특정 범위의 동작 상태를 벗어난 동작 상태를 기초로 한다. 일 실시예에서, 장 기 노출 데이터들은 IED로부터 멀리 떨어진 중앙 시스템에 위치한 애플리케이션으로 전송되며, 이로써 이 중앙 시스템에 위치한 애플리케이션은 다수의 IED로부터 수신된 장기 노출 데이터들을 하나 이상의 신뢰성 모델 에 적용하여 각 개별 IED에 대한 잔여 수명의 수치를 결정한다. 본 발명의 예시적인 실시예에서, 프로세서는 IED의 잔여 수명의 수치를 사전 선정된 잔여 수명 값과 비교 한다. 만일 이 IED의 잔여 수명의 수치가 상기 사전 선정된 잔여 수명 값보다 작으면, 프로세서는 알람(alarm)과 같은 신호를 생성한다. 이러한 신호는 가령 IED의 결정된 잔여 수명, IED의 결 정된 기사용 기간, IED의 결정된 마모 레이트 및/또는 초과 동작 상태들을 기초로 한다. 일 실시예에서, 상기 신호는 알파벳 문자 메시지 또는 발광 다이오드(LED) 등을 이용해서 IED 운영자에게 그 상황을 시각적으로 알린다. 다른 실시예에서, 이 신호는 물리적으로 오프/온 출력이다. 또 다른 실시예에서, 이 신호는 프로세서 에 의해서 생성되는, IED의 동작 코드 및/또는 프로그래밍 코드 내의 가상 포인트일 수 있다. 가령, 이러한 경우에는, 유지 관리 출력 릴레이(maintenance output relay) 또는 장애 시 안전 릴레이(fail safe relay)가 개방되어 그 릴레이가 비활성화되어서 IED 운영자에게 IED가 복구가 필요하거나 IED를 주의 할 필요가 있다는 것을 알린다. 이러한 경우에, IED는 동작 환경이 비정상임을 IED 운영자에게 알리면서 계속하여서 자신의 기능을 수행할 수 있다. 또한, 상기 개방된 회로는 IED가 가속적으로 마모를 받고 있 거나 IED의 잔여 수명이 서비스가 필요한 지점에 도달했음을 알린다. 예시적인 실시예에서, 이러한 신호 의 감도 및/또는 기능은 사용자 설정 사항을 통해서 선택될 수 있다. 일 실시예에서, IED에 고장이 발생했거나 특정 구성 요소에 고장이 발생했으면, IED에 대해서 결정된 장기 노출 데이터들은 도시되지 않은 메모리 내에 저장되고 이로써 이 장기 노출 데이터들은 가령 서비 스 기술자에 의해서 추출될 수 있다. 이와 달리, 이 장기 노출 데이터들은 프로세서에 의해서 원격 저장 장치(미도시)에 전송되어서 저장될 수 있다. IED 및/또는 특정 구성 요소가 고장난 후에 IED가 복구 또는 새롭게 단장되기 위해서 보내지면, IED가 복구 또는 새롭게 단장되면 IED에 대해서 개선된 동작 상태가 반영될 수 있도록 저장된 장기 노출 데이터는 IED의 실제 마모 정도를 반영하도록 증가된다. 또한, 신뢰성 모델은 그 복구 동안 서비스 기술자에 의해서 수집된 장기 노출 데이터와 같은 데이터를 반영하도 록 갱신된다. 신뢰성 데이터에서 큰 변화가 있으면, IED의 제조자는 새로 제조되는 장치들에서는 그 신뢰 성 모델을 갱신한다. 본 명세서에서 개시된 시스템 및 방법은 센서 및 이 센서로부터 획득된 정보를 IED로 하여금 수집 및 분석하게 하는 프로세서를 사용함으로써 지능형 전자 장치(IED)에서 필요한 유지 관리를 예측한다. 이렇게 정보를 수집 및 분석함으로써 신뢰성 모델과 같은 IED의 예상 수명을 알리는 내장된 지식과 함께 IED의 동작 상태 및 노출 상황을 이해할 수 있게 되며 예측적 유지 관리 요청 및/또는 신호를 생성한다. 본 발명의 실시예들 또는 측면들의 여러 요소들을 설명할 때에 사용된 명사의 단수형은 해당 요소가 복수 개 존 재하는 것을 배제하지 않는다. 또한, 본 명세서에서 사용되는 용어 \"포함한다\", \"있다\", \"구비한다\" 또는 \"갖 는다\"는 배타적인 방식으로 해석되지 말아야 하는데, 즉 열거된 요소들 이외의 다른 요소들의 존재를 배제하지 않는다. 지능형 전자 장치(IED)에 대한 유지 관리를 예측하는 방법 및 시스템의 예시적인 실시예들이 지금까지 상세하게 설명되었다. 그러나, 이러한 방법 및 시스템은 본 명세서에서 기술된 특정 실시예들로만 한정되는 것이 아니라, 이보다는 방법의 단계들 또는 시스템의 구성 요소들은 본 명세서에서 개시된 다른 단계 또는 다른 구성 요소와는 별도로 독립적으로 사용될 수 있다. 또한, 상술한 단계들 또는 구성 요소들은 다른 시스템 또는 다른 방법에서 규정되거나 다른 시스템 또는 다른 방법과 결합되어서 사용될 수 있다. 따라서, 상술한 단계들 또는 구성 요소들이 본 명세서에서 개시된 방법 및 시스템에서만 실시되는 것으로 한정되지는 않는다. 상기 본 발명에 대한 기재는 다양한 실례들을 사용하여서 본 발명에 대한 최상의 실시 형태가 포함되게 본 발명 을 개시하였으며 본 기술 분야의 당업자가 임의의 디바이스 또는 시스템을 제조 및 사용하고 임의의 인용된 방 법들을 수행하는 것을 포함하여서 본 발명을 실시할 수 있도록 개시하고 있다. 본 발명의 특허 범위는 청구 범 위에 의해서 규정되며 본 기술 분야의 당업자에게는 가능한 다른 실례들을 포함한다. 이러한 다른 실례들은 청 구 범위에서 사용되는 언어가 의미하는 바와 다르지 않는 구조적 요소들을 구비하거나 청구 범위에서 사용되는 언어가 의미하는 바와 차이는 있으나 그 차이가 실질적이지 않는 균등한 요소를 포함하는 경우에는 이하의 청구범위 내에 포함되는 바로 해석되어야 한다."}
{"patent_id": "10-2010-7028369", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하의 발명의 상세한 설명 부분에서는, 다음의 첨부 도면을 참조하여서, 본 명세서에서 개시되는 본 발명에 따 른 방법 및 시스템의 장점 및 특징을 포함하는 예시적인 실시예들이 예시적으로 기술될 것이다. 도 1은 동작 온도를 모니터링하기 위해서 사용되는 예시적인 지능형 전자 장치(IED)의 개략도이다. 도 2는 전기 서지(electrical surge)를 모니터링 및/또는 측정하기 위해서 사용되는 예시적인 IED의 개략도이다. 도 3은 접지 지점과 관련하여서 입력이 올바르지 않게 접지된 바를 검출하는데 사용되는 예시적인 IED의 개략도 이다. 도 4는 IED에 대한 예시적인 예측적 유지 관리 방법을 설명하는 흐름도이다."}
