{"patent_id": "10-2023-0140335", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0056518", "출원번호": "10-2023-0140335", "발명의 명칭": "네트워크 엘리먼트를 관리하는 서비스 관리 및 조정의 이중화를 위한 방법 및 장치", "출원인": "주식회사 엘지유플러스", "발명자": "김민종"}}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "네트워크 엘리먼트(Network Element: NE)의 동작 방법에 있어서,서빙 SMO(Service Management and Orchestration)로부터 후보 SMO의 정보를 수신하는 단계;상기 후보 SMO와 링크를 설정하는 단계; 및상기 NE와 상기 서빙 SMO와의 링크가 실패하면, 상기 설정된 후보 SMO와의 링크를 통하여 상기 후보 SMO에게 최소 모드 데이터를 송신하는 단계를 포함하며,상기 최소 모드 데이터는, 상기 NE에 대한 전체 데이터 중 상기 NE의 관리에 필요한 미리 설정된 최소 비율의데이터인, NE의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 후보 SMO와 링크를 설정하는 단계는,상기 후보 SMO를 대기(standby) 모드로 설정하는 단계; 및상기 후보 SMO의 정보를 이용하여 상기 후보 SMO와 링크를 설정하는 단계를 포함하는, NE의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 데이터 백업을 위한 일정 기간의 정보를 포함하는 데이터 백업의 설정 정보를 수신하는 단계; 및상기 데이터 백업의 설정 정보에 기초하여, 상기 일정 기간 동안의 상기 NE의 데이터를 백업하는 단계를 더 포함하는, NE의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 일정 기간 동안 상기 실패한 상기 NE와 상기 서빙 SMO와의 링크가 복구되지 않으면, 상기 대기 모드의 후보 SMO에게 활성화 모드로의 변경을 요청하는 단계를 더 포함하는, NE의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 백업된 NE의 데이터를 상기 후보 SMO에게 송신하는 단계를 더 포함하는, NE의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "네트워크 엘리먼트(Network Element: NE)를 관리하는 서빙 SMO(Service Management and Orchestration)의 동작방법에 있어서,적어도 하나의 다른 SMO으로부터 상기 다른 SMO의 가용 자원의 정보를 수신하는 단계;상기 가용 자원의 정보에 기초하여 상기 NE를 위한 후보 SMO를 결정하는 단계; 및상기 결정된 후보 SMO의 정보를 상기 NE에게 송신하는 단계를 포함하는, 서빙 SMO의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 NE의 데이터 백업을 위한 일정 기간의 정보를 포함하는 데이터 백업의 설정 정보를 상기 NE에게 송신하는공개특허 10-2025-0056518-3-단계를 더 포함하는, 서빙 SMO의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 서빙 SMO에 이상이 발생한 이후, 상기 일정 기간이 경과하여 상기 서빙 SMO가 복구되면, 미리 저장된 소정기간 동안의 상기 NE의 데이터를 상기 후보 SMO에게 송신하는 단계를 포함하는, 서빙 SMO의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 가용 자원은,상기 다른 SMO의 최대 수용 자원, 현재 사용 자원을 이용하여 결정되고,상기 최대 수용 자원은, 미리 설정된 자원 조정 인자에 의하여 조정되는, 서빙 SMO의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "서빙 SMO에 의해 관리되는 네트워크 엘리먼트(Network Element: NE)를 관리하는 후보 SMO(Service Managementand Orchestration)의 동작 방법에 있어서,상기 NE에 의해 대기 모드로 설정된 상태에서, 상기 NE와의 링크를 생성하는 단계;상기 NE와 상기 서빙 SMO와의 링크가 실패하면, 상기 생성된 NE와의 링크를 통하여상기 NE로부터 최소 모드 데이터를 수신하는 단계; 및 상기 최소 모드 데이터에 기초하여, 상기 NE를 임시로 관리하는 단계를 포함하며,상기 최소 모드 데이터는, 상기 NE에 대한 전체 데이터 중 상기 NE의 관리에 필요한 미리 설정된 최소 비율의데이터인, 후보 SMO의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,일정 기간 동안 상기 실패한 상기 NE와 상기 서빙 SMO와의 링크가 복구되지 않으면, 상기 NE로부터 상기 대기모드에서 활성화 모드로의 변경 요청을 수신하는 단계; 및상기 변경 요청에 대응하여 상기 활성화 모드로 변경하여 동작하는 단계를 더 포함하는, 후보 SMO의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 NE에서 백업된 상기 일정 기간 동안의 상기 NE의 데이터를, 상기 NE로부터 수신하는 단계를 더 포함하는,후보 SMO의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 일정 기간이 경과하여 상기 서빙 SMO가 복구된 경우, 미리 저장된 소정 기간 동안의 상기 NE의 데이터를상기 서빙 SMO로부터 수신하는 단계를 더 포함하는, 후보 SMO의 동작 방법."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "네트워크 엘리먼트(Network Element: NE) 장치에 있어서,서빙 SMO(Service Management and Orchestration)로부터 후보 SMO의 정보를 수신하는 통신부; 및상기 후보 SMO와 링크를 설정하고, 상기 NE와 상기 서빙 SMO와의 링크가 실패하면, 상기 설정된 후보 SMO와의링크를 통하여 상기 후보 SMO에게 최소 모드 데이터를 송신하도록 상기 통신부를 제어하는 프로세서를공개특허 10-2025-0056518-4-포함하고,상기 최소 모드 데이터는, 상기 NE에 대한 전체 데이터 중 상기 NE의 관리에 필요한 미리 설정된 최소 비율의데이터인, NE 장치."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 프로세서는,상기 후보 SMO를 대기(standby) 모드로 설정하고, 상기 후보 SMO의 정보를 이용하여 상기 후보 SMO와 링크를 설정하는, NE 장치."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서, 상기 통신부는, 데이터 백업을 위한 일정 기간의 정보를 포함하는 데이터 백업의 설정 정보를 수신하고,상기 프로세서는, 상기 데이터 백업의 설정 정보에 기초하여, 상기 일정 기간 동안의 상기 NE의 데이터를 저장부에 백업하고, 상기 일정 기간 동안 상기 실패한 상기 NE와 상기 서빙 SMO와의 링크가 복구되지 않으면, 상기대기 모드의 후보 SMO에게 활성화 모드로의 변경을 요청하고, 상기 백업된 NE의 데이터를 상기 후보 SMO에게 송신하도록 상기 통신부를 제어하는, NE 장치."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "네트워크 엘리먼트(Network Element: NE)를 관리하는 서빙 SMO(Service Management and Orchestration) 장치에있어서,적어도 하나의 다른 SMO으로부터 상기 다른 SMO의 가용 자원의 정보를 수신하는 통신부; 및 상기 가용 자원의 정보에 기초하여 상기 NE를 위한 후보 SMO를 결정하고, 상기 결정된 후보 SMO의 정보를 상기NE에게 송신하도록 상기 통신부를 제어하는, 서빙 SMO 장치."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 통신부는, 상기 NE의 데이터 백업을 위한 일정 기간의 정보를 포함하는 데이터 백업의 설정 정보를 상기NE에게 송신하고, 상기 서빙 SMO에 이상이 발생한 이후, 상기 일정 기간이 경과하여 상기 서빙 SMO가 복구되면,미리 저장된 소정 기간 동안의 상기 NE의 데이터를 상기 후보 SMO에게 송신하는, 서빙 SMO 장치."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "서빙 SMO에 의해 관리되는 네트워크 엘리먼트(Network Element: NE)를 관리하는 후보 SMO(Service Managementand Orchestration) 장치에 있어서,상기 NE에 의해 대기 모드로 설정된 상태에서, 상기 NE와의 링크를 생성하는 프로세서; 및상기 NE와 상기 서빙 SMO와의 링크가 실패하면, 상기 생성된 NE와의 링크를 통하여 상기 NE로부터 최소 모드 데이터를 수신하는 통신부를 포함하고, 상기 프로세서는, 상기 최소 모드 데이터에 기초하여, 상기 NE를 임시로 관리하고, 상기 최소 모드 데이터는, 상기 NE에 대한 전체 데이터 중 상기 NE의 관리에 필요한 미리 설정된 최소 비율의데이터인, 후보 SMO 장치."}
{"patent_id": "10-2023-0140335", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 통신부는, 일정 기간 동안 상기 실패한 상기 NE와 상기 서빙 SMO와의 링크가 복구되지 않으면, 상기 NE로부터 상기 대기 모드에서 활성화 모드로의 변경 요청을 수신하고,공개특허 10-2025-0056518-5-상기 프로세서는, 상기 변경 요청에 대응하여 상기 활성화 모드로 변경하여 동작하고,상기 통신부는, 상기 NE에서 백업된 상기 일정 기간 동안의 상기 NE의 데이터를, 상기 NE로부터 수신하고, 상기일정 기간이 경과하여 상기 서빙 SMO가 복구된 경우, 미리 저장된 소정 기간 동안의 상기 NE의 데이터를 상기서빙 SMO로부터 수신하는, 후보 SMO 장치."}
{"patent_id": "10-2023-0140335", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 네트워크 엘리먼트(Network Element: NE)의 동작 방법은, 서빙 SMO(Service Management and Orchestration)로부터 후보 SMO의 정보를 수신하는 단계, 상기 후보 SMO와 링크를 설정하는 단 계, 및 상기 NE와 상기 서빙 SMO와의 링크가 실패하면, 상기 설정된 후보 SMO와의 링크를 통하여 상기 후보 SMO 에게 최소 모드 데이터를 송신하는 단계를 포함하며, 상기 최소 모드 데이터는, 상기 NE에 대한 전체 데이터 중 상기 NE의 관리에 필요한 미리 설정된 최소 비율의 데이터이다."}
{"patent_id": "10-2023-0140335", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 네트워크 엘리먼트를 관리하는 서비스 관리 및 조정(Service Management and Orchestration: SMO)의 이중화를 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0140335", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신 네트워크의 복잡성과 규모가 증가함에 따라, 네트워크 엔터티(예: 기지국 장비 등)의 관리와 조정의 중요 성은 점점 더 커지고 있다. 네트워크를 관리하고 조정하는 전통적인 방식에서는, 각 기지국 제조사별로 자체적 인 EMS(Element Management System) 서버를 가지고 있고, 이 EMS 서버를 통해 해당 제조사의 기지국 장비 등과 같은 네트워크 장비들을 운용하고 관리한다. 이러한 방식은 각기 다른 제조사에 의한 EMS 서버 간의 상호 운용 성이 부족하며, 하나의 EMS 서버가 문제를 일으킬 경우 해당 제조사의 모든 네트워크 장비에 영향을 미치게 된 다. 한편, 최근에는 네트워크 관리와 조정을 위하여 O-RAN(Open RAN) 얼라이언스(Alliance)는 SMO(Service Management and Orchestration)를 도입하였다. 참고로 ORAN은 전통적인 무선 통신 시스템의 구조를 개선하고 업 계 간의 상호 운용성을 증가시키기 위해 설계된 개방형 무선 액세스 네트워크 아키텍처이고, O-RAN 얼라이언스 는 O-RAN 아키텍처의 개방성과 상호 운용성을 증가시키기 위하여 설립된 국제 표준화 단체이다. SMO는 인공지능/머신러닝(Artificial Intelligence/ Machine Learning: AI/ML) 기반의 알고리즘을 사용하여 네 트워크의 트래픽 패턴, 사용자 행동 등의 데이터를 분석하고 최적화할 수 있다. 또한, SMO는 서비스 조정 및 관 리 기능을 제공하여, 다양한 네트워크 서비스와 응용 프로그램이 필요로 하는 자원을 적절하게 할당하고 조정한 다. 또한, 장애 관리와 성능 모니터링 기능을 통하여 네트워크 운영자가 시스템 내의 문제를 신속하게 파악하고 해결할 수 있도록 하고, 구성 관리 기능을 통해 네트워크 장치들의 설정 변경 작업을 쉽게 수행할 수 있도록 지 원한다. 이와 같이 SMO는 복잡한 O-RAN 네트워크 환경에서 효율적인 서비스 제공과 안정적인 네트워크 운영에 크게 기여한다."}
{"patent_id": "10-2023-0140335", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는 SMO를 이중화하여 네트워크 엘리먼트를 관리하기 위한 방안을 제안한다. 본 발명의 일 실시예는 SMO의 이중화를 위하여 후보 SMO의 자원 소모를 최소화면서 더 많은 네트워크 엘리먼트 들을 지원하기 위한 방안을 제안한다. 본 발명의 일 실시예는 하나의 SMO에 장애가 발생 시 신속하게 다른 SMO가 네트워크 엘리먼트를 관리하기 위한 방안을 제안한다. 본 발명의 일 실시예는 네트워크를 관리하는 하나의 SMO에 장애가 발생하고 다른 SMO가 네트워크 엘리먼트를 관 리하는 경우, 네트워크 엘리먼트의 데이터를 다른 SMO에게 제공하는 방안을 제안한다."}
{"patent_id": "10-2023-0140335", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 네트워크 엘리먼트(Network Element: NE)의 동작 방법은, 서빙 SMO(Service Management and Orchestration)로부터 후보 SMO의 정보를 수신하는 단계, 상기 후보 SMO와 링크를 설정하는 단 계, 및 상기 NE와 상기 서빙 SMO와의 링크가 실패하면, 상기 설정된 후보 SMO와의 링크를 통하여 상기 후보 SMO 에게 최소 모드 데이터를 송신하는 단계를 포함하며, 상기 최소 모드 데이터는, 상기 NE에 대한 전체 데이터 중상기 NE의 관리에 필요한 미리 설정된 최소 비율의 데이터이다. 여기서, 상기 후보 SMO와 링크를 설정하는 단계는, 상기 후보 SMO를 대기(standby) 모드로 설정하는 단계 및 상 기 후보 SMO의 정보를 이용하여 상기 후보 SMO와 링크를 설정하는 단계를 포함한다. 여기서, 데이터 백업을 위한 일정 기간의 정보를 포함하는 데이터 백업의 설정 정보를 수신하는 단계 및 상기 데이터 백업의 설정 정보에 기초하여, 상기 일정 기간 동안의 상기 NE의 데이터를 백업하는 단계를 더 포함한다. 여기서, 상기 일정 기간 동안 상기 실패한 상기 NE와 상기 서빙 SMO와의 링크가 복구되지 않으면, 상기 대기 모 드의 후보 SMO에게 활성화 모드로의 변경을 요청하는 단계를 더 포함한다. 여기서, 상기 백업된 NE의 데이터를 상기 후보 SMO에게 송신하는 단계를 더 포함한다. 본 발명의 일 실시예에 따른 NE를 관리하는 서빙 SMO의 동작 방법은, 적어도 하나의 다른 SMO으로부터 상기 다 른 SMO의 가용 자원의 정보를 수신하는 단계, 상기 가용 자원의 정보에 기초하여 상기 NE를 위한 후보 SMO를 결 정하는 단계 및 상기 결정된 후보 SMO의 정보를 상기 NE에게 송신하는 단계를 포함한다. 여기서, 상기 NE의 데이터 백업을 위한 일정 기간의 정보를 포함하는 데이터 백업의 설정 정보를 상기 NE에게 송신하는 단계를 더 포함한다. 여기서, 상기 서빙 SMO에 이상이 발생한 이후, 상기 일정 기간이 경과하여 상기 서빙 SMO가 복구되면, 미리 저 장된 소정 기간 동안의 상기 NE의 데이터를 상기 후보 SMO에게 송신하는 단계를 포함한다. 여기서, 상기 가용 자원은, 상기 다른 SMO의 최대 수용 자원, 현재 사용 자원을 이용하여 결정되고, 상기 최대 수용 자원은, 미리 설정된 자원 조정 인자에 의하여 조정된다. 본 발명의 일 실시예에 따른 서빙 SMO에 의해 관리되는 NE를 관리하는 후보 SMO의 동작 방법은, 상기 NE에 의해 대기 모드로 설정된 상태에서, 상기 NE와의 링크를 생성하는 단계, 상기 NE와 상기 서빙 SMO와의 링크가 실패하 면, 상기 생성된 NE와의 링크를 통하여 상기 NE로부터 최소 모드 데이터를 수신하는 단계 및 상기 최소 모드 데 이터에 기초하여, 상기 NE를 임시로 관리하는 단계를 포함하며, 상기 최소 모드 데이터는, 상기 NE에 대한 전체 데이터 중 상기 NE의 관리에 필요한 미리 설정된 최소 비율의 데이터이다. 여기서, 일정 기간 동안 상기 실패한 상기 NE와 상기 서빙 SMO와의 링크가 복구되지 않으면, 상기 NE로부터 상 기 대기 모드에서 활성화 모드로의 변경 요청을 수신하는 단계 및 상기 변경 요청에 대응하여 상기 활성화 모드 로 변경하여 동작하는 단계를 더 포함한다. 여기서, 상기 NE에서 백업된 상기 일정 기간 동안의 상기 NE의 데이터를, 상기 NE로부터 수신하는 단계를 더 포 함한다. 여기서, 상기 일정 기간이 경과하여 상기 서빙 SMO가 복구된 경우, 미리 저장된 소정 기간 동안의 상기 NE의 데 이터를 상기 서빙 SMO로부터 수신하는 단계를 더 포함한다. 본 발명의 일 실시예에 따른 NE 장치는, 서빙 SMO로부터 후보 SMO의 정보를 수신하는 통신부 및 상기 후보 SMO 와 링크를 설정하고, 상기 NE와 상기 서빙 SMO와의 링크가 실패하면, 상기 설정된 후보 SMO와의 링크를 통하여 상기 후보 SMO에게 최소 모드 데이터를 송신하도록 상기 통신부를 제어하는 프로세서를 포함하고, 상기 최소 모 드 데이터는, 상기 NE에 대한 전체 데이터 중 상기 NE의 관리에 필요한 미리 설정된 최소 비율의 데이터이다. 여기서, 상기 프로세서는, 상기 후보 SMO를 대기(standby) 모드로 설정하고, 상기 후보 SMO의 정보를 이용하여 상기 후보 SMO와 링크를 설정한다. 여기서, 상기 통신부는, 데이터 백업을 위한 일정 기간의 정보를 포함하는 데이터 백업의 설정 정보를 수신하고, 상기 프로세서는, 상기 데이터 백업의 설정 정보에 기초하여, 상기 일정 기간 동안의 상기 NE의 데이 터를 저장부에 백업하고, 상기 일정 기간 동안 상기 실패한 상기 NE와 상기 서빙 SMO와의 링크가 복구되지 않으 면, 상기 대기 모드의 후보 SMO에게 활성화 모드로의 변경을 요청하고, 상기 백업된 NE의 데이터를 상기 후보 SMO에게 송신하도록 상기 통신부를 제어한다. 본 발명의 일 실시예에 따른 NE를 관리하는 서빙 SMO 장치는, 적어도 하나의 다른 SMO으로부터 상기 다른 SMO의 가용 자원의 정보를 수신하는 통신부 및 상기 가용 자원의 정보에 기초하여 상기 NE를 위한 후보 SMO를 결정하 고, 상기 결정된 후보 SMO의 정보를 상기 NE에게 송신하도록 상기 통신부를 제어한다.여기서, 상기 통신부는, 상기 NE의 데이터 백업을 위한 일정 기간의 정보를 포함하는 데이터 백업의 설정 정보 를 상기 NE에게 송신하고, 상기 서빙 SMO에 이상이 발생한 이후, 상기 일정 기간이 경과하여 상기 서빙 SMO가 복구되면, 미리 저장된 소정 기간 동안의 상기 NE의 데이터를 상기 후보 SMO에게 송신한다. 본 발명의 일 실시예에 따른 서빙 SMO에 의해 관리되는 NE를 관리하는 후보 SMO 장치는, 상기 NE에 의해 대기 모드로 설정된 상태에서, 상기 NE와의 링크를 생성하는 프로세서 및 상기 NE와 상기 서빙 SMO와의 링크가 실패 하면, 상기 생성된 NE와의 링크를 통하여 상기 NE로부터 최소 모드 데이터를 수신하는 통신부를 포함하고, 상기 프로세서는, 상기 최소 모드 데이터에 기초하여, 상기 NE를 임시로 관리하고, 상기 최소 모드 데이터는, 상기 NE에 대한 전체 데이터 중 상기 NE의 관리에 필요한 미리 설정된 최소 비율의 데이터이다. 여기서, 상기 통신부는, 일정 기간 동안 상기 실패한 상기 NE와 상기 서빙 SMO와의 링크가 복구되지 않으면, 상 기 NE로부터 상기 대기 모드에서 활성화 모드로의 변경 요청을 수신하고, 상기 프로세서는, 상기 변경 요청에 대응하여 상기 활성화 모드로 변경하여 동작하고, 상기 통신부는, 상기 NE에서 백업된 상기 일정 기간 동안의 상기 NE의 데이터를, 상기 NE로부터 수신하고, 상기 일정 기간이 경과하여 상기 서빙 SMO가 복구된 경우, 미리 저장된 소정 기간 동안의 상기 NE의 데이터를 상기 서빙 SMO로부터 수신한다."}
{"patent_id": "10-2023-0140335", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, SMO를 이중화하여 네트워크 엘리먼트를 관리하여, 안정적으로 네트워크 엘리먼트들 을 관리할 수 있다. 또한, 대기 상태의 SMO의 자원 소모를 최소화하면서도 더 많은 네트워크 엘리먼트들을 지원 할 수 있다. 또한, 장애가 발생한 SMO가 가지고 있던 데이터를 새로운 SMO에게 전달하여, 연속적인 네트워크 엘 리먼트를 수행할 수 있다. 본 명세서의 구체적인 일례를 통해 얻을 수 있는 효과는 이상에서 나열된 효과로 제한되지 않는다. 예를 들어,"}
{"patent_id": "10-2023-0140335", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "관련된 기술분야의 통상의 지식을 가진 자(a person having ordinary skill in the related art)가 본 명세서 로부터 이해하거나 유도할 수 있는 다양한 기술적 효과가 존재할 수 있다. 이에 따라 본 명세서의 구체적인 효 과는 본 명세서에 명시적으로 기재된 것에 제한되지 않고, 본 명세서의 기술적 특징으로부터 이해되거나 유도될 수 있는 다양한 효과를 포함할 수 있다."}
{"patent_id": "10-2023-0140335", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 본 명세서에서 \"제1\", \"제2\", \"A\", \"B\" 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 또한 \"및/또는\" 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 명세서에서 사용되는 용어는 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식 적인 의미로 해석되지 않는다. 도면에 대한 상세한 설명을 하기에 앞서, 본 명세서에서의 구성부들에 대한 구분은 각 구성부가 담당하는 주기 능 별로 구분한 것에 불과함을 명확히 하고자 한다. 즉, 이하에서 설명할 2개 이상의 구성부가 하나의 구성부로 합쳐지거나 또는 하나의 구성부가 보다 세분화된 기능별로 2개 이상으로 분화되어 구비될 수도 있다. 그리고 이하에서 설명할 구성부 각각은 자신이 담당하는 주기능 이외에도 다른 구성부가 담당하는 기능 중 일부 또는 전부의 기능을 추가적으로 수행할 수도 있으며, 구성부 각각이 담당하는 주기능 중 일부 기능이 다른 구성 부에 의해 전담되어 수행될 수도 있다. 따라서, 본 명세서를 통해 설명되는 각 구성부들의 존재 여부는 기능적 으로 해석되어야 할 것이다. 본 명세서에서 \"A 또는 B(A or B)\"는 \"오직 A\", \"오직 B\" 또는 \"A와 B 모두\"를 의미할 수 있다. 달리 표현하면, 본 명세서에서 \"A 또는 B(A or B)\"는 \"A 및/또는 B(A and/or B)\"으로 해석될 수 있다. 예를 들어, 본 명세서에 서 \"A, B 또는 C(A, B or C)\"는 \"오직 A\", \"오직 B\", \"오직 C\", 또는 \"A, B 및 C의 임의의 모든 조합(any combination of A, B and C)\"를 의미할 수 있다. 본 명세서에서 사용되는 슬래쉬(/)나 쉼표(comma)는 \"및/또는(and/or)\"을 의미할 수 있다. 예를 들어, \"A/B\"는 \"A 및/또는 B\"를 의미할 수 있다. 이에 따라 \"A/B\"는 \"오직 A\", \"오직 B\", 또는 \"A와 B 모두\"를 의미할 수 있다. 예를 들어, \"A, B, C\"는 \"A, B 또는 C\"를 의미할 수 있다. 본 명세서에서 \"A 및 B 중 적어도 하나(at least one of A and B)\"는, \"오직 A\", \"오직 B\" 또는 \"A와 B 모두\" 를 의미할 수 있다. 또한, 본 명세서에서 \"적어도 하나의 A 또는 B(at least one of A or B)\"나 \"적어도 하나의 A 및/또는 B(at least one of A and/or B)\"라는 표현은 \"적어도 하나의 A 및 B(at least one of A and B)\"와 동일하게 해석될 수 있다. 또한, 본 명세서에서 \"적어도 하나의 A, B 및 C(at least one of A, B and C)\"는, \"오직 A\", \"오직 B\", \"오직 C\", 또는 \"A, B 및 C의 임의의 모든 조합(any combination of A, B and C)\"를 의미할 수 있다. 또한, \"적어도 하나의 A, B 또는 C(at least one of A, B or C)\"나 \"적어도 하나의 A, B 및/또는 C(at least one of A, B and/or C)\"는 \"적어도 하나의 A, B 및 C(at least one of A, B and C)\"를 의미할 수 있다. 이하, 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 본 발명의 실시예의 주요 개념은, SMO의 이중화를 위하여 서빙 SMO가 네트워크 엘리먼트(Network Element: NE) 를 관리하는 상태에서, 서빙 SMO의 이상 상태 시 상기 NE에 관한 최소의 정보를 후보 SMO에게 제공하고, 후보 SMO가 최소의 자원을 이용하여 서빙 SMO를 대신하여 NE를 관리할 수 있도록 하는 것이다. 또한, 서빙 SMO의 이 상 상태가 일정 기간 이상 동안 복구되지 않으면, NE가 자신의 데이터를 후보 SMO에게 추가로 제공하여, 후보 SMO가 새로운 서빙 SMO로 동작하도록 한다. 그리고 추후에 기존의 서빙 SMO가 복구되면, 기존의 서빙 SMO가 가 지고 있던 NE의 데이터를 새로운 서빙 SMO에게 송신하여, 새로운 서빙 SMO가 NE를 관리할 수 있도록 한다.상술한 본 발명의 기본 개념에 기초하여 이하에서 본 발명의 실시예를 설명한다. 도 1은 본 발명의 실시예에 따른 SMO의 이중화를 위한 아키텍처를 설명하는 도면이다. 도 1을 참조하면, SMO 0은 현재 적어도 하나의 네트워크 엘리먼트(Network Element: NE)들(120-1, 120-2, ... , 120-n)을 관리하는 서빙 SMO이다. SMO 0의 IP 주소는 x.x.x.x으로 예시된다. SMO 1(130-1) 내지 SMO n(130-n)은 임의의 NE와 서빙 SMO인 SMO 0와의 링크에 이상이 발생한 경우, 해당 NE가 서빙 SMO를 대신하여 링크를 재설정할 수 있는 후보 SMO들이다. SMO 1(130-1)의 IP 주소는 y.y.y.y 이고, SMO n(130-n)의 IP 주소는 z.z.z.z로 예시된다. SMO 0은 NE들 각각에 대해 적어도 하나의 후보 SMO를 할당할 수 있다. 일 예로, 도 1에서 SMO 0은 NE 1(120-1)에 대하여 SMO 1(130-1)을 제1(primary) 후보 SMO로 할당하고, SMO n(130-n)을 제2(secondary) 후보 SMO로 할당할 수 있다. 도 1에 예시되지는 않았지만, SMO 1(130-1)와 SMO n(130-n)을 서로 다른 NE에 할당할 수도 있다. 예를 들어, 도 1에서 모든 SMO들(110, 130-1, ... , 130-n)이 수용할 수 있는 NE의 개수는 1000개라고 가정한다. 현재 서빙 SMO가 최대 수용 한도인 1000개의 NE들(즉, n=1000)을 관리하고 있고, 후보 SMO 1(130-1)은 800개의 NE들 (미도시)을 관리하고 있고, 후보 SMO n(130-n)이 700개의 NE들(미도시)을 관리하고 있는 경우, 후보 SMO 1(130- 1)는 최대 수용 한도(=1000개)를 기준으로 200개의 NE를 추가로 관리할 수 있고, 후보 SMO n(130-n)은 300개의 NE를 추가로 관리할 수 있다. 따라서 SMO 0가 현재 관리하고 있는 1000개의 NE들 중 500개의 NE들에 후보 SMO 1(130-1) 또는 후보 SMO n(130-n)를 할당할 수 있다. 예를 들어, SMO 0이 관리하고 있는 1000개의 NE 들 중 200개의 NE들에 후보 SMO 1(130-1)에 할당하고, 300개의 NE들에 후보 SMO n(130-n)을 할당할 수 있다. 이와 같이 서빙 SMO는 다른 SMO들의 가용 자원을 이용하여 자신이 관리하는 NE들에 대해 후보 SMO를 할당할 수 있다. 이처럼, 서빙 SMO는 자신은 제외한 다른 SMO들의 가용 자원에 기초하여 해당 NE를 위한 적어도 하나의 후보 SMO 를 결정할 수 있다. 이에 대해서는 후술하기로 한다. 서빙 SMO인 SMO 0은 결정된 후보 SMO에 대한 정보를 해당 NE에게 송신한다. 도 1의 예에서, SMO 0은 결정된 후보 SMO인 SMO 1(130-1) 및 SMO n(130-n)의 SMO 식별자 및 해당 SMO의 IP 주소 정보를 NE 1에게 제공 한다. NE 1(120-1)은 자신에게 할당된 SMO 1(130-1) 및 SMO n(130-n)을 '대기(standby) 모드'로 등록한다. 한편, NE 1(120-1)은 현재의 서빙 SMO인 SMO 0을 '활성화(active) 모드'로 등록한 상태이다. 상기 활성화 모드와 대 기 모드에 대하여 설명한다. SMO가 해당 NE에 대해 활성화 모드(active mode)인 경우, SMO는 해당 NE의 관리를 위한 데이터를 처리하기 위하 여 해당 SMO의 자원(예: CPU(Central Processor Unit), 메모리 등)을 할당한다. 반면, SMO가 대기 모드 (Standby mode)인 경우, NE ID 및 IP 주소와 같이 해당 NE와의 링크를 유지하기 위한 정보를 위하여 자원을 할 당하고, NE의 관리를 위한 다른 데이터(PM/FM/CM: 이들은 후술된다.)에는 자원을 할당하지 않는다. SMO가 대기 모드에서 해당 NE에게 할당하는 자원은 자신의 전체 자원의 1~2% 정도에 불과할 정도로 적은 양이다. 따라서 NE 에 대해 대기 모드로 연결된 SMO는 자원 소모는 적으면서 해당 NE에 대해 활성화된 서빙 SMO의 장애 시, 서빙 SMO를 대신하여 즉시 해당 NE를 관리할 수 있다. 상술한 바에 따라 NE 1(120-1)의 상태를 하기 <표 1>과 같이 표시될 수 있다. 표 1 -NE ID : 1 -NE IP : x.x.x.1 -OMCH(Operating Management CHannel) mode : Active -OM IP(Active) : x.x.x.x -OM IP(standby:primary) : y.y.y.y -OM IP(standby:secondary) : z.z.z.z 상기 <표 1>을 참조하면, NE 1(NE ID : 1)의 IP 주소는 x.x.x.1이고, 현재 동작 관리 채널(OMCH)의 모드는 활 성화 상태이고, 활성화 상태인 동작 관리 엔터티의 IP 주소는 x.x.x.x이고, 제1 대기 상태인 동작 관리 엔터티 의 IP 주소는 y.y.y.y이고, 제2 대기 상태인 동작 관리 엔터티의 IP 주소는 z.z.z.z이다. 이러한 상황에서, SMO 0의 고장 또는 네트워크 장애 등의 이상 상태에 의하여, NE 1(120-1)과 SMO 0와의 링크가 끊어지거나 실패한(fail) 경우, NE 1(120-1)은 1차로 SMO 1(130-1)과 링크를 설정할 수 있다. 만일 SMO 1(130-1)과의 링크가 설정되지 않으면, NE 1(120-1)은 2차로 SMO n(130-n)과 링크를 설정할 수 있다. 이렇게 NE 1(120-1)과 링크를 설정한 후보 SMO, 즉, SMO 1(130-1) 또는 SMO n(130-n)은 SMO 0과 NE 1(120-1)과의 링크가 복구될 때까지, NE 1(120-1)을 관리할 수 있다. 한편, NE의 관리를 위하여 SMO에게 제공될 수 있는 정보의 양과 관련하여, '풀 모드(full mode)'와 '최소 모드 (minimum mode)'로 구분될 수 있다. 상기 풀 모드란 SMO에게 NE의 상태 관리를 위한 정보가 모두 제공되는 상태이다. 여기서 NE의 상태 관리를 위한 정보는 FM(fault management) 정보, PM(performance management) 정보 및 CM(configuration management) 정보 를 포함할 수 있다. FM은 시스템에서 발생하는 오류 또는 장애를 탐지하고 분석하며 문제 해결을 위한 조치를 취하기 위한 프로세스이고, FM 정보는 이러한 프로세스를 위한 정보이다. PM은 네트워크의 성능 데이터를 수집 하고 분석하여 시스템의 작동 상태와 성능을 모니터링하고 관리하기 위한 프로세스이고, PM 정보는 이러한 프로 세스를 위한 정보이다. CM은 네트워크 장치들의 설정 정보를 관리하는 프로세스이고, CM 정보는 이러한 프로세 서를 위한 정보이다. 상기 최소 모드란 SMO에게 NE의 상태 관리를 위한 최소한의 필수 정보가 제공되는 상태이다. 최소 모드에서 필 요한 데이터의 종류 및 양은 설정에 따라 달라질 수 있다. 본 발명의 실시예에서 최소 모드의 데이터량은 풀 모 드의 데이터량의 5% 정도 비율로 설정될 수 있다. 상기 데이터량의 비율은 변경될 수 있음은 물론이다. 도 2는 본 발명의 실시예에 따라 풀 모드와 최소 모드에서의 데이터량을 설명하는 도면이다. 도 2를 참조하면, (a)는 풀 모드를 나타내고 (b)는 최소 모드를 나타낸다. 상술한 것처럼 풀 모드는 FM, PM 및 CM을 포함한다. 한편, 최소 모드는 풀 모드의 데이터량과 비교하여 미리 설정된 최소의 데이터량을 포함한다. 이를 나타내기 위하여, 최소 모드는 크기가 작은 소문자 형 태, 즉, fm, pm 및 cm을 포함하는 것으로 도시되었다. 예를 들어, 최소 모드의 데이터량이 풀 모드의 데이터량의 5%로 설정된 상태에서, 풀 모드에서 FM의 데이 터 항목의 개수가 2000개이고, PM의 데이터 항목의 개수가 10000개이고, CM의 데이터 항목의 개수가 8000개라면, 최소 모드에서 fm의 데이터 항목의 개수는 100개이고, pm의 데이터 항목의 개수는 500개 이고, cm의 데이터 항목의 개수는 400개가 된다. SMO는 NE에 대해 풀 모드로 동작할 수도 있고, 최소 모드로 동작할 수도 있다. 일 예로, 서빙 SMO인 SMO 0(11 0)은 NE들(120-1, ~ 120-n)에 대하여 풀 모드로 동작할 수 있다. 한편, 후보 SMO인 SMO 1(130-1) ~ SMO n(130- n)은 NE들(120-1, ~ 120-n)에 대하여 최소 모드로 동작할 수 있다. 다만, NE들(120-1, ~ 120-n)에 대하여 후보 SMO인 SMO 1(130-1) ~ SMO n(130-n) 각각은 다른 NE들(미도시)에 대해서는 서빙 SMO로 풀 모드에서 동작할 수 있다. 이하에서는 앞서 간략히 언급된, 서빙 SMO가 후보 SMO를 결정하는 방식을 설명한다. 본 발명의 실시예에서 서빙 SMO는 다른 SMO들에 대해서 해당 SMO의, 최대 수용 자원, 현재 사용 자원 및 가용 자원 중 적어도 하나에 기초 하여, NE에 대한 후보 SMO를 결정할 수 있다. 예를 들어, 해당 SMO의 최대 수용 자원의 크기가 1000이고, 현재 사용 자원의 크기가 800이면 가용 자원은 200이 된다. 일반적으로, 최대 수용 자원의 양은 SMO의 하드웨어 사양에 따라 정해지므로, SMO들의 사양이 동일하다고 가정 하면 최대 수용 자원의 양은 동일하다. 따라서 현재 사용 자원의 양에 따라 가용 자원의 양이 결정된다. 다만, 본 발명에서는 SMO 별로 최대 수용 자원의 양을 운용자가 조정하여, 결과적으로 가용 자원의 양을 조정할 수 있 도록 한다. 예를 들어, 실제 하드웨어 사양에 따른 SMO의 최대 수용 자원은 1000이지만, 최대 수용 자원을 900 으로 설정하면 가용 자원의 양은 100이 된다. 즉, SMO의 운용자는 해당 SMO의 최대 수용 자원의 양을 실제와 다 르게 설정하여, 후보 SMO로써 다른 NE들을 위하여 지원 할 수 있는 가용 자원의 양을 조절할 수 있다. 계산된 가용 자원이 100이면, 5%의 최소 데이터 모드에서 후보 SMO로 지원할 수 있는 NE의 개수는 100 X (1/0.05)=20000개가 될 수 있다. 즉, 본 발명의 실시예에서 후보 SMO는 최소 모드 데이터를 사용하여, 하나의 NE를 지원하는 데 필요한 자원의 양은, 일 예로, 풀 모드의 5%이다. 따라서 후보 SMO로 지원 가능한 NE의 개수는 풀 모드로 지원하는 경우(즉, 가용 자원=100개)의 20배가 될 수 있다. 상술한 설명의 연산을 일반화하면 다음과 같다. 먼저, 상기 '최대 수용 자원'을 'R_total'로 표기하고, '현재 사용 자원'을 'R_current'로 표기하고, '가용 자 원'을 'R_available'로 표기한다. 최대 수용 자원(R_total)= (수용 가능한 NE의 최대 개수) x (풀 모드 정보량)으로 계산될 수 있다. 상기 '풀 모드 정보량'은 풀 모드에서 필요한 데이터 항목의 개수이다. 즉, 풀 모드 정보량은, FM 개수, PM 개 수 및 CM 개수의 합이 된다. 예를 들어, FM 개수는 2000개, PM 개수는 10000개, CM 개수는 8000개이면, '풀 모 드 정보량'은 '20,000'이다. 한편, NE가 결정되면 상기 '풀 모드 정보량'은 고정된 값(예: 20000)이 된다. 또한, 상기 풀 모드 정보량의 값 이 크기 때문에, 편의상 '상기 풀 모드 정보량'을 상수 값으로 'A'로 표기하기로 한다. 상기 예에서 A의 값은 20000이다. 따라서 SMO가 수용 가능한 NE의 최대 개수가 1000개라면, '최대 수용 자원(R_total)'은 '1000 x A'가 된다. 한편, 상기 '최대 수용 자원(R_total)'의 값을 조정하기 위하여, '자원 조정 인자(R_factor)'를 정의한다. 상기 자원 조정 인자는, 0부터 1 사이의 값으로 설정 가능하다. 예를 들어, '자원 조정 인자(R_factor)'가 0.9라면 상기 예에서 '최대 수용 자원(R_total)'은 '900 x A'로 조정된다. '조정 최대 수용 자원'을 'R'_total'로 표기 하면, R'_total= (R_total) x (R_factor)로 계산될 수 있다. 즉, 상기 예에서, R'_total= (R_total_NE) x (R_factor) = (1000 x A) x 0.9 = 900 x A 로 계산된다. 만일 현재 사용 자원(R_current)이 800 x A이면, 가용 자원(R_available)은 100 x A로 계산될 수 있다. 이때, 상기 'SMO의 현재 사용 자원량 (R_available)'은 풀 모드를 기준으로 5%의 최소 모드의 경우, 해당 SMO의 가용 자원 대비 20배의 NE를 수용할 수 있다. 한편, (R_total) x (R_factor)의 값이 현재 사용 자원(R_current)보다 작거나 같으면, 가용 자원(R_availabl) 은 0으로 간주된다. 도 3은 본 발명의 실시예에 따른 SMO의 이중화를 위한 엔티티들 간의 신호 흐름 및 동작을 설명하는 도면이다. 도 3의 예에서는, NE 1을 위하여 2개의 SMO(SMO 1, SMO 2) 중에서 하나의 후보 SMO를 결정하는 것으로 가정한다. 한편, NE 1은, 예를 들어 기지국 장치일 수 있다. 도 3을 참조하면, SMO 0은 SMO 1과 후보 SMO 2와 각각 세션을 설정할 수 있다(S311, S313). 이 단계들에 의하여, SMO 0은 SMO 1 SMO 2와 연결된다. 이때 SMO 간의 세션에는 NETCONF(Network Configuration Protocol) 프로토콜이 사용될 수 있다. 참고로, NETCONF는 네트워크 장비의 구성 관리를 위한 IETF(Internet Engineering Task Force) 표준 프로토콜이다. 네 트워크 관리자와 장비 간에 XML(extensible markup language) 기반의 구조화된 데이터를 주고받아 장비를 구성 하고 관리하는 데 사용된다. NETCONF는 네트워크 장비의 구성 및 관리를 효율적이고 안전하게 수행할 수 있는 프로토콜로, 현대 네트워크 환경에서 네트워크 자동화 및 프로그래머 가능성 프로세스에 적합하다. NE 1과 SMO 0은 상호 간의 링크를 생성할 수 있다(S315). 이 링크를 통하여 NE 1은 SMO 0과 연동할 수 있다. 또 한, SMO 0은 이 링크를 통하여 NE 1와 정보를 송수신하거나, 또는 NE의 상태를 관리할 수 있다. SMO 0은 SMO 1 및 SMO 2과 가용한 자원에 대한 정보를 교환할 수 있다(S317, S319). 예를 들어, SMO 1이 NE의 최대 수용 한도가 1000개이고, 현재 운용 중인 NE의 개수는 800개이며, 따라서 200개의 NE를 추가로 수용할 수 있다는 정보를 SMO 0에게 알릴 수 있다. 동일한 방식으로 SMO 2도 자신의 가용 자원의 정보를 SMO 0에게 알릴 수 있다. SMO 0은 다른 SMO들의 가용 자원 정보에 기초하여 NE 1에 대한 복수 개의 SMO들 중에서 적어도 하나의 후보 SMO 를 결정할 수 있다(S321). 도 3에서는 편의상 SMO 1과 SMO 2 중에서 하나의 SMO(=SMO 2)를 결정한 것으로 도시되었지만, 더 많은 SMO들 중에서 적어도 하나의 SMO를 결정할 수 있다. 즉, 앞서 도 1에서 NE 1을 위하여 두 개 의 SMO들이 결정된 것처럼, NE를 위하여 복수 개의 SMO들이 후보 SMO로 결정될 수 있다. SMO 0은 결정된 후보 SMO(=SMO 2)의 정보를 NE 1에게 송신하여, 후보 SMO를 설정할 것을 요청할 수 있다(S323). 이때, 서빙 SMO는 NE의 데이터 백업에 대한 설정 정보를 NE 1에게 송신할 수 있다. 상기 설정 정보는 상기 S323단계에서 함께 송신되거나 또는 별도의 절차(미도시)로 송신될 수도 있다. 상기 데 이터 백업에 대한 설정 정보는 데이터 백업의 지시 정보와 데이터 백업의 기간 정보(예: 3일, 7일, 14일 등)를 포함할 수 있다. 다만, 데이터 백업에 대한 설정 정보가 미리 NE에게 제공되었다면, 여기서 설정 정보는 다시 송신되지 않을 수 있다. 다만, 데이터 백업의 기간 정보가 변경된 경우 변경된 기간 정보는 송신되어야 한다. 또한, 상기 데이터 백업에 대한 설정 정보는 주기적으로 송신될 수도 있다. 일 예로, 1시간 단위로 최대 24시간 동안 송신될 수 있다. 이하에서 상기 데이터 백업에 대해 설명한다. 본 발명의 실시예에서 서빙 SMO인 SMO 0는 NE 1과 SMO 0과의 링크 이상에 대비하여 일정 기간(예: 3일, 1주일, 2주일 등) 단위로 NE 1에게 NE 1의 데이터를 백업할 것을 지시할 수 있다. 일 예로, NE 1은 자신의 3일 동안의 상태 데이터를 백업하고, NE 1과 SMO 0과의 링크 이상이 발생한 이후, 3일 내에 링크가 복구되지 않으면, 백업 한 데이터를 후보 SMO에게 송신한다. 즉, 본 발명의 실시예에서 서빙 SMO는 NE와 서빙 SMO의 링크가 복구되지 않을 경우에 대비하여, NE에게 데이터 백업을 지시할 수 있다. 이렇게 NE 1이 백업한 데이터는 아래 S341단계에 서 SMO 2에게 송신될 수 있다(S341 단계 참조). 다시 도 3을 참조하면, NE 1은 상기 설정 요청에 대응하여 SMO 2를 대기 상태로 설정하고(S323), 상기 설정 요 청에 대한 긍정 응답(ACK)을 SMO 0에게 송신할 수 있다(S327). 또한, NE 1은 후보 SMO로서 대기 상태로 설정된 SMO 2와의 링크를 생성할 수 있다(S329). 여기서 SMO 2와의 링 크는 SMO 0과의 링크에 이상이 생긴 경우, 즉시 SMO 2가 NE 1을 관리할 수 있도록 하기 위하여 미리 생성된다. 링크가 생성된 이후, NE 1과 SMO 2 사이에 하트비트(Heart Beat) 메시지가 소정 시간(예: 1시간) 간격으로 송수 신될 수 있다. 참고로, 상기 하트비트 메시지는 주로 컴퓨터 네트워크나 분산 시스템에서 노드 간의 연결 상태를 모니터링하는 데 사용되는 메시지이다. 이 메시지는 그 이름에서 알 수 있듯이 정기적으로(즉, 마치 심장 박동처럼) 송신되며, 이 메시지를 통하여 해당 노드와의 연결이 유지되고 있고, 그 노드가 동작 중임을 확인할 수 있다. 만일 하트비트 메시지가 미리 설정된 시간 내에 도착하지 않으면, 이는 네트워크의 문제 또는 해당 노드의 장애 를 나타내는 것으로 해석될 수 있다. 이처럼 하트비트 메시지는 시스템 관리자나 자동화된 복구 메커니즘이 네 트워크 또는 해당 노드의 문제를 인식하고 적절한 조치를 취하는데 사용된다. 예를 들어, 클러스터 환경에서 하 나의 노드에 장애가 생기면 해당 노드로부터의 하트비트 메시지가 중단되며, 다른 노드들이 해당 노드의 장애를 감지할 수 있다. 이 경우, 클러스터는 자동으로 재구성되어 서비스 중단을 최소화할 수 있다. NE 1이 SMO 2와의 링크를 생성한 결과, 서빙 SMO인 SMO 0은 활성화 상태에서 NE 1의 상태를 관리하고 있고, SMO 2는 대기 상태에서 NE 1의 상태 관리를 대기하고 있다. 따라서 NE 1은 SMO 0과 주기적으로 하트 비트 메시지를 송수신한다(S331, S333). 만일, NE 1과 SMO 0 간의 하트비트 메시지가 소정 횟수(=m번) 송수신되지 않았다면 (S335), NE 1은 SMO 0과의 링크에 이상이 발생한 것으로 판단할 수 있다. 그에 따라 NE 1은 대기 상태로 설정된 후보 SMO인 SMO 2에게 NE 1과 SMO 0과의 링크가 이상 상태임을 알리고, 또한, 최소 모드 접속을 요청하고 (S337), 상기 최소 모드 접속 요청에 대한 승인 응답(ACK)을 수신한다(S339). 이후, 상기 최소 모드 접속 요청 승인에 따라 NE 1은 최소 모드 데이터를 SMO 2에게 송신한다(S340). 상기 최소 모드 접속이란 최소 모드 데이터를 이용하여 NE의 관리를 위하여 접속하는 것을 의미한다. 즉, NE 1 의 관리를 위하여 필요한 전체 데이터 중 일정 비율(예: 5%)의 최소의 정보를 이용하여 NE 1의 관리를 수행하기 위한 접속이다. 상기 최소 모드 데이터는 도 2에서 설명된 바와 같다. 이후, 상기 S323단계에서 설명된 바와 같이, 데이터 백업 설정 정보에 따라 NE 1은 일정 기간(예: 3일) 동안 자 신(=NE 1)의 상태 데이터를 백업(backup)할 수 있다(S341). 현재 NE 1과 SMO 0과의 링크가 실패한 상태에서, SMO 2가 최소 모드 데이터를 이용하여 임시로 NE 1을 관리하고 있으므로, NE 1은 자신의 상태 데이터를 SMO 2에 게 업로드하지 않는다. 따라서 NE 1과 SMO 0과의 링크가 복구되는 동안 NE 1의 상태 데이터를 백업하고, 이후 NE 1과 SMO 0과의 링크가 복구되면 자신의 상태 데이터를 SMO 0에게 송신할 수 있다.만일 일정 기간(예: 3일)이 지나도 NE 1과 SMO 0과의 링크가 복구되지 않으면(S343), NE 1은 SMO 2의 모드를 대 기 모드에서 활성화 모드로 변경할 것을 요청한다(S345). 즉, NE 1은 3일이 지나도 NE 1과 SMO 0과의 링크가 복 구되지 않았기 때문에, 대기 상태의 SMO 2를 활성화 상태로 변경하도록 하여, 자신의 서빙 SMO를 SMO 0에서 SMO 2로 변경하는 것이다. 이후, NE 1은 백업한 자신의 상태 데이터를 새로운 서빙 SMO인 SMO 2에게 송신한다 (S349). 한편, 상기 소정 기간(=3일) 이후에 SMO 0가 복구되었다면(S349), SMO 0은 자동으로 자신이 가지고 있던 기존의 NE 1의 모든 정보를 NE 1의 새로운 서빙 SMO인 SMO 2에게 송신한다. 이는 새로운 서빙 SMO인 SMO 2에게 SMO 0가 가지고 있던 NE 1의 모든 정보를 송신하여, 새로운 서빙 SMO인 SMO 2가 NE 1을 관리하는 데 사용할 수 있도록 하기 위함이다. 이처럼, 서빙 SMO가 일정 기간이 경과한 이후 복구된 후 자신이 가지고 있던 NE의 모든 데이터 를 NE의 새로운 서빙 SMO에게 송신하는 동작을 '오토-마이그레이션(auto-migration)'이라 칭한다. 상기 오토 마 이그레이션의 대상이 되는 NE 1의 데이터는 SMO 0과 NE 1과의 링크가 실패되기 전부터 소정 기간(예: 3개월)으 로 결정될 수 있다. 도 4는 본 발명의 실시예에 따른 NE의 동작을 설명하는 도면이다. 도 4를 참조하면, NE는 서빙 SMO로부터 후보 SMO의 정보를 포함하는 후보 SMO 설정 요청을 수신한다(S410). 상 기 설정 요청에는 데이터 백업에 관한 설정 정보가 추가로 포함될 수 있다. NE는 수신한 후보 SMO의 정보를 이 용하여 후보 SMO를 대기 상태로 설정한다(S420). 이후, NE는 후보 SMO와 링크를 설정한다(S430). NE는 NE와 현 재의 서빙 SMO와의 링크가 실패라고 판단되면, 후보 SMO에게 최소 모드 데이터를 송신한다(S440). 즉, NE는 후 보 SMO에게 최소 모드 접속을 요청하고, 승인 응답을 수신하면 최소 모드 데이터를 후보 SMO에게 송신한다. 상 기 최소 모드 데이터를 수신한 후보 SMO는 최소 모드 데이터를 이용하여 NE를 임시로 관리할 수 있다. 한편, NE는 일정 기간(예: 3일) 동안 자신의 상태 데이터를 백업할 수 있다(S450). 만일 상기 일정 기간 동안 NE와 서빙 SMO와의 링크가 복구되지 않으면, NE는 후보 SMO에게 동작 모드를 대기 모드에서 활성화 모드로 변경 할 것을 요청한다(S460). 이를 통하여 후보 SMO를 서빙 SMO로 변경할 수 있다. 또한, NE는 상기 백업한 자신의 상태 데이터를 새로운 서빙 SMO인 후보 SMO에게 송신한다(S470). 도 5는 본 발명의 실시예에 따른 NE 장치의 구성을 설명하는 도면이다. 상기 NE는 일 예로, 기지국이 될 수 있다. 도 5를 참조하면, NE 장치는 통신부, 프로세서 및 저장부 를 포함할 수 있다. 통신부는 외부 엔터티와 통신을 수행할 수 있다. 일 예로, 통신부는 서빙 SMO 또는 후보 SMO와 통신 을 수행할 수 있다. 일 예로, 통신부는 서빙 SMO로부터 후보 SMO의 정보를 포함하는 후보 SMO 설정 요청을 수신할 수 있다. 프로세서는 NE 장치의 전반적인 동작을 수행하거나, 또는 NE 장치의 구성 요소들을 제어할 수 있다. 일 예 로, 프로세서는 후보 SMO의 정보를 이용하여 후보 SMO를 대기 상태로 설정할 수 있고, 후보 SMO와 링크 설 정을 제어할 수 있다. 또한, 프로세서는 NE와 현재의 서빙 SMO와의 링크가 실패되었는지 여부를 판단할 수 있다. 예를 들어, 소정 횟수 동안 하트비트가 송수신되지 않으면 상기 링크가 실패된 것으로 판단한 수 있다. 프로세서는 상기 링크가 실패되었다고 판단되면, 통신부를 제어하여 후보 SMO에게 최소 모드 데이터 를 송신할 수 있다. 구체적으로, 프로세서는 후보 SMO에게 최소 모드 접속을 요청하고, 승인 응답을 수신 하면 최소 모드 데이터를 후보 SMO에게 송신하도록 제어한다. 여기서, 상기 최소 모드 데이터를 수신한 후보 SMO는 최소 모드 데이터를 이용하여 NE를 임시로 관리할 수 있다. 한편, 프로세서는 일정 기간(예: 3일) 동안 자신의 상태 데이터를 저장부 또는 외부 엔터티에 백업할 수 있다. 또한, 프로세서는 상기 일정 기간 동안 NE와 서빙 SMO와의 링크가 복구되지 않으면, 후보 SMO에 게 동작 모드를 대기 모드에서 활성화 모드로 변경할 것을 요청할 수 있다. 이를 통하여 프로세서는 후보 SMO를 서빙 SMO로 변경할 수 있다. 또한, 프로세서는 통신부를 제어하여 상기 백업한 자신의 상태 데 이터를 새로운 서빙 SMO인 후보 SMO에게 송신한다. 도 6은 본 발명의 실시예에 따른 서빙 SMO의 동작을 설명하는 도면이다. 서빙 SMO는 다른 SMO들과의 세션을 설정한다(S610). 상기 세션 설정에는 NETCONF 프로토콜이 사용될 수 있다. 서빙 SMO는 다른 SMO들의 가용 자원에 대한 정보를 획득할 수 있다(S620). 이후, 서빙 SMO는 상기 가용 자원에 대한 정보에 기초하여 NE를 위한 적어도 하나의 후보 SMO를 결정할 수 있다 (S630). 서빙 SMO는 결정된 후보 SMO에 대한 정보를 포함하는 후보 SMO 설정 요청을 NE에게 송신할 수 있다 (S640). 한편, 서빙 SMO의 상태 이상 등으로 NE와의 링크가 실패한 이후, 일정 기간(예: 3일)이 경과하여 복구되면, 소 정 기간(예: 3개월)의 NE의 상태 데이터를 후보 SMO에게 송신하는 오토 마이그레이션을 수행한다(S650). 이를 위하여 서빙 SMO는 미리 상기 소정 기간(3개월)에 해당하는 NE들의 데이터를 백업할 수 있다. 도 7은 본 발명의 실시예에 따른 후보 SMO 장치의 동작을 설명하는 도면이다. 도 7을 참조하면, 후보 SMO는 서빙 SMO와 세션을 설정한다(S710). 상기 세션 설정에는 NETCONF 프로토콜이 사용 될 수 있다. 후보 SMO는 서빙 SMO에게 자신의 가용 자원에 대한 정보를 제공할 수 있다(S720). 후보 SMO는 서빙 SMO에 의하여 자신이 할당된 NE와 링크를 설정할 수 있다(S730). 후보 SMO는 NE로부터 최소 모드 데이터를 수신할 수 있다(S740). 구체적으로, NE로부터 최소 모드 접속 요청을 수신하고, 그에 대한 긍정 응답을 송신하면, NE로부터 최소 모드 데이터를 수신한다. 후보 SMO는 상기 최소 모 드 데이터를 이용하여 상기 NE를 임시로 관리할 수 있다. 후보 SMO는 NE로부터 활성 모드로의 변경 요청을 수신할 수 있다(S750). 후보 SMO는 상기 변경 요청을 수신하고 활성 모드로 진입하여 해당 NE에 대해 서빙 SMO로 동작할 수 있다(S760). 후보 SMO는 NE로부터 NE의 백업 데이터를 수신할 수 있다(S770). 또한, 기존의 서빙 SMO로부터 오토 마이그레이 션에 따라 소정 기간 동안의 NE의 모든 데이터를 수신할 수 있다(S780). 도 8은 본 발명의 실시예에 따른 SMO 장치의 구성을 설명하는 도면이다. 도 8의 SMO 장치는 서빙 SMO 또는 후보 SMO로 동작할 수 있으며, 통신부, 프로세서 및 저장부을 포함할 수 있다. 통신부는 외부 엔터티와의 통신을 수행한다. 구체적으로, 다른 SMO(즉, 서빙 SMO 또는 후보 SMO) 및 NE와 통신을 수행한다. 프로세서는 SMO 장치의 전반적인 동작을 수행하거나, 다른 구성 요소들을 제어한다. 저 장부는 필요한 데이터를 저장한다. 먼저 SMO 장치가 서빙 SMO일 때의 동작은 다음과 같다. 프로세서는 다른 SMO들과의 세션을 설정한다. 상기 세션 설정에는 NETCONF 프로토콜이 사용될 수 있다. 통 신부는 다른 SMO들의 가용 자원에 대한 정보를 획득할 수 있다. 프로세서는 상기 가용 자원에 대한 정보에 기초하여 NE를 위한 후보 SMO를 결정할 수 있다. 프로세서는 결정된 후보 SMO에 대한 정보를 포함 하는 후보 SMO 설정 요청을 NE에게 송신하도록 통신부를 제어할 수 있다. 한편, 프로세서는 상태 이상 등으로 NE와의 링크가 실패된 이후, 일정 기간(예: 3일)이 경과하여 복구되면, 소정 기간(예: 3개월)의 NE의 상태 데이터를 후보 SMO에게 송신하여 오토 마이그레이션 동작을 수행 하도록 통신부를 제어한다. 이를 위하여 프로세서는 미리 상기 소정 기간(3개월)에 해당하는 NE들의 데이터를 저장부에 백업할 수 있다. SMO 장치가 후보 SMO일 때의 동작은 다음과 같다. 프로세서는 서빙 SMO와 세션을 설정한다. 상기 세션 설정에는 NETCONF 프로토콜이 사용될 수 있다. 프로세 서는 서빙 SMO에게 자신의 가용 자원에 대한 정보를 제공한다. 프로세서는 서빙 SMO에 의하여 자신이 할당된 NE와 링크를 설정할 수 있다. 이후, 통신부는 NE로부터 최소 모드 데이터를 수신할 수 있다. 구체 적으로, 통신부는 NE로부터 최소 모드 접속 요청을 수신하고, 그에 대한 긍정 응답을 송신하면, NE로부터 최소 모드 데이터를 수신한다. 프로세서는 상기 최소 모드 데이터를 이용하여 상기 NE를 임시로 관리할 수 있다. 통신부는 NE로부터 활성 모드로의 변경 요청을 수신할 수 있다. 프로세서는 상기 변경 요청을 수신하 고 활성 모드로 진입하여 해당 NE에 대해 서빙 SMO로 동작할 수 있다. 통신부는 NE로부터 NE의 백업 데이 터를 수신할 수 있다. 또한, 기존의 서빙 SMO로부터 오토 마이그레이션에 따라 소정 기간 동안의 NE의 모든 데이터를 수신할 수 있다. 본 명세서에서 제안하는 방법들은 상기 통신 장치 이외에도, 적어도 하나의 프로세서(processor)에 의해 실행됨 을 기초로 하는 명령어(instruction)를 포함하는 적어도 하나의 컴퓨터로 읽을 수 있는 기록 매체(computer readable medium) 및 하나 이상의 프로세서 및 상기 하나 이상의 프로세서에 의해 실행 가능하게 연결되고, 및 명령들을 저장하는 하나 이상의 메모리를 포함하되, 상기 하나 이상의 프로세서는 상기 명령어들을 실행하여 본 명세서에서 제안하는 방법들을 수행하는, 상기 통신 장치를 제어하도록 설정된 장치(apparatus)에 의해서도 수 행될 수 있다. 본 명세서에 기재된 청구항들은 다양한 방식으로 조합될 수 있다. 예를 들어, 본 명세서의 방법 청구항의 기술 적 특징이 조합되어 장치로 구현될 수 있고, 본 명세서의 장치 청구항의 기술적 특징이 조합되어 방법으로 구현 될 수 있다. 또한, 본 명세서의 방법 청구항의 기술적 특징과 장치 청구항의 기술적 특징이 조합되어 장치로 구 현될 수 있고, 본 명세서의 방법 청구항의 기술적 특징과 장치 청구항의 기술적 특징이 조합되어 방법으로 구현 될 수 있다."}
{"patent_id": "10-2023-0140335", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하의 도면은 본 명세서의 구체적인 일례를 설명하기 위해 작성되었다. 도면에 기재된 구체적인 장치의 명칭이 나 구체적인 신호/메시지/필드의 명칭은 예시적으로 제시된 것이므로, 본 명세서의 기술적 특징이 이하의 도면 에 사용된 구체적인 명칭에 제한되지 않는다. 도 1은 본 발명의 실시예에 따른 SMO의 이중화를 위한 아키텍처를 설명하는 도면이다. 도 2는 본 발명의 실시예에 따라 풀 모드와 최소 모드에서의 데이터량을 설명하는 도면이다. 도 3은 본 발명의 실시예에 따른 SMO의 이중화를 위한 엔티티들 간의 신호 흐름 및 동작을 설명하는 도면이다. 도 4는 본 발명의 실시예에 따른 NE의 동작을 설명하는 도면이다. 도 5는 본 발명의 실시예에 따른 NE 장치의 구성을 설명하는 도면이다. 도 6은 본 발명의 실시예에 따른 서빙 SMO의 동작을 설명하는 도면이다. 도 7은 본 발명의 실시예에 따른 후보 SMO 장치의 동작을 설명하는 도면이다. 도 8은 본 발명의 실시예에 따른 SMO 장치의 구성을 설명하는 도면이다."}
