{"patent_id": "10-2023-0111024", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0149776", "출원번호": "10-2023-0111024", "발명의 명칭": "인공지능 모델 기반 코딩 테스트 피드백 방법 및 시스템", "출원인": "김석준", "발명자": "김석준"}}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버의 프로세서에 의해 수행되는 방법에 있어서, a) 학습자 단말로부터 코딩 문제에 대한 코드를 수신하고, 상기 코드의 오답 여부를 판단하는 단계; b) 상기 코드가 상기 코딩 문제에 대한 오답 코드이면, 기저장된 코드 기록으로부터 상기 오답 코드와의 유사도가 기설정된 값을 갖는 상기 코딩 문제에 대한 정답 코드를 도출하는 단계; 및c) 인공지능 모델을 이용하여, 상기 정답 코드의 변수인 정답 변수와 상기 오답 코드의 변수인 오답 변수를 비교하여 상기 정답 변수와 유사도가 높은 오답 변수인 주요 변수를 인식하고, 상기 정답 변수를 상기 주요 변수로 변환하여 최종 정답 코드를 생성하는 단계를 포함하는, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 기 저장된 코드 기록에 포함된 코드들은 벡터로 변환된 코드들이고, 상기 기 저장된 코드 기록은 상기 벡터로 변환된 코드들 각각에 대한 코드 저장 순서, 상기 코딩 문제에 포함된하나 이상의 테스트 케이스 각각에 대한 테스트 케이스 통과 정보, 정답 코드 여부 및 오답 코드 여부 중 적어도 하나 이상을 포함하는 것인, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 b) 단계는, b-1) 상기 오답 코드를 벡터로 변환하는 단계; 및b-2) 상기 벡터로 변환된 오답 코드와 상기 기 저장된 코드 기록에 포함된 코드들을 비교하여 상기 기 저장된코드 기록에서 상기 정답 코드를 도출하는 단계를 포함하는, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 b-2) 단계는, 상기 기 저장된 코드 기록에 포함된 코드들 중 상기 벡터로 변환된 오답 코드와 유사도가 가장 높은 코드를 주요 코드로 선정하는 단계; 및상기 주요 코드가 상기 코딩 문제에 정답인 특정 학습자의 코드이면, 상기 주요 코드를 상기 정답 코드로 선정하고, 상기 주요 코드가 상기 코딩 문제에 오답인 코드이면, 상기 주요 코드를 제출한 특정 학습자의 코드 제출기록에서 상기 코딩 문제에 대해 정답인 코드를 상기 정답 코드로 선정하는 단계를 포함하는, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 c) 단계는, c-1) 상기 오답 코드 및 상기 정답 코드로부터 상기 오답 변수 및 상기 정답 변수를 추출하는 단계;c-2) 상기 정답 변수와 상기 오답 변수를 비교하여 상기 주요 변수를 인식하는 단계; 및공개특허 10-2024-0149776-3-c-3) 상기 정답 변수의 변수명을 상기 주요 변수의 변수명으로 변환하는 단계를 포함하는, 인공지능 모델 기반코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 c-2) 단계는, 상기 정답 변수 및 상기 오답 변수에 대한 특성 벡터를 도출하는 단계; 상기 정답 변수에 대한 특성 벡터와 상기 오답 변수에 대한 특성 벡터를 비교하여 상기 유사도를 도출하는단계; 및상기 정답 변수에 대한 특성 벡터와 상기 유사도가 가장 높은 상기 주요 변수를 인식하는 단계를 포함하는, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 정답 변수에 대한 특성 벡터는, 상기 정답 변수의 종류 및 상기 코딩 문제 또는 기설정된 코딩 테스트 케이스에 대한 상기 정답 코드의 실행 과정에 따른 상기 정답 변수 값의 변화 중 적어도 하나 이상을 기초로 도출되고, 상기 오답 변수에 대한 특성 벡터는,상기 오답 변수의 종류 및 상기 코딩 문제 또는 기설정된 코딩 테스트 케이스에 대한 상기 오답 코드의 실행 과정에 따른 상기 오답 변수 값의 변화 중 적어도 하나 이상을 기초로 도출되는 것인, 인공지능 모델 기반 코딩테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 c) 단계는, c-4) 상기 정답 코드에서 상기 정답 변수의 코드 실행 순서가 상기 오답 코드에서 상기 주요 변수의 코드 실행순서와 같도록 상기 정답 코드 내에서 상기 정답 변수의 코드 실행 순서를 변경하는 단계를 더 포함하는, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 인공지능 모델은, 특정 코딩 문제에 대한 정답 코드인 제1 코드 및 오답 코드인 제2 코드를 수신 받으면, 상기 제1 코드의 변수와 유사도가 가장 높은 상기 제2 코드의 변수를 인식하고, 상기 제1 코드의 변수를 상기제1 코드의 변수와 유사도가 가장 높은 상기 제2 코드의 변수로 변환한 제3 코드를 출력하도록 훈련된 것인, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서, d) 상기 오답 코드 및 상기 최종 정답 코드를 비교하여 상기 오답 코드와 상기 최종 정답 코드의 차이점을 표시하는 코드 비교 영역을 포함하는 피드백 인터페이스를 상기 학습자 단말로 제공하는 단계를 더 포함하는, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2024-0149776-4-제10항에 있어서, 상기 d) 단계는, 코드 해설 모델을 이용하여, 상기 오답 코드 및 상기 최종 정답 코드를 기초로 상기 오답 코드를 상기 최종 정답 코드로 수정하기 위한 코드 수정 방향을 포함하는 답변을 도출하는 단계를 더 포함하고, 상기 피드백 인터페이스는, 상기 답변을 표시하는 영역을 더 포함하고, 그리고, 상기 코드 해설 모델은, 특정 코딩 문제, 상기 특정 코딩 문제에 대한 특정 오답 코드 및 특정 정답 코드를 기초로 상기 특정 오답 코드를 상기 특정 정답 코드로 수정하기 위한 수정 방향을 포함하는 답변을 출력하도록 훈련된 것인, 인공지능 모델기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 정답 코드가 복수일 경우, 상기 c) 단계는, 상기 복수의 정답 코드에 대한 복수의 상기 최종 정답 코드를 생성하고, 상기 d) 단계는, 상기 복수의 최종 정답 코드 각각에 대한 피드백 블록을 포함하는 피드백 목록 인터페이스를 상기 학습자 단말로 제공하는 것인, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 학습자 단말로부터 상기 피드백 블록 중 특정 피드백 블록에 대한 선택 입력을 수신하면, 상기 특정 피드백 블록과 연관된 피드백 인터페이스를 상기 피드백 목록 인터페이스 상에 표시하는 것인, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서, 상기 피드백 인터페이스는, 상기 기 저장된 코드 기록으로부터 상기 정답 코드를 제출한 특정 학습자의 상기 코딩 문제에 대한 코드 제출기록에 따라, 해당 코드 제출 기록에 포함된 코드들의 변화 과정이 표시되는 변화 과정 표시 영역을 더 포함하는 것인, 인공지능 모델 기반 코딩 테스트 피드백 방법."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 변화 과정 표시 영역은, 상기 특정 학습자의 상기 코딩 문제에 대한 코드 제출 기록에 포함된 코드들을 대상으로 코드 저장 순서에 따른이전 코드와 다음 코드가 표시되는 코드 영역을 포함하고, 이전 코드와 상기 다음 코드의 차이점이 상기 코드 영역에 표시된 상기 이전 코드와 상기 다음 코드 상에 표시되고, 상기 이전 코드 및 상기 다음 코드에 포함된 변수는 인공지능 모델을 통해, 상기 오답 변수와 상기 이전 코드 및 상기 다음 코드에 포함된 변수 간의 유사도를 기초로 상기 오답 변수로 변환된 것인, 인공지능 모델 기반 코딩 테스트 피드백 방법.공개특허 10-2024-0149776-5-청구항 16 적어도 하나의 프로세서; 및상기 프로세서와 전기적으로 연결되고, 상기 프로세서에서 수행되는 코딩 테스트 피드백 프로그램이 저장되는메모리를 포함하고,상기 메모리는, 상기 프로세서가,학습자 단말로부터 코딩 문제에 대한 코드를 수신하고, 상기 코드의 오답 여부를 판단하고, 상기 코드가 상기 코딩 문제에 대한 오답 코드이면, 기 저장된 코드 기록으로부터 상기 오답 코드와의 유사도가기 설정된 값을 갖는 상기 코딩 문제의 정답 코드를 도출하고, 그리고, c) 인공지능 모델을 이용하여, 상기 정답 코드의 변수인 정답 변수와 상기 오답 코드의 변수인 오답 변수를 비교하여 상기 정답 변수와 유사도가 높은 오답 변수인 주요 변수를 인식하고, 상기 정답 변수를 상기 주요 변수로 변환하여 최종 정답 코드를 생성하도록 야기하는 코드를 저장하는 것인, 인공지능 모델 기반 코딩 테스트 피드백 시스템."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 메모리는 상기 프로세서로 하여금,상기 오답 코드 및 상기 정답 코드로부터 상기 오답 변수 및 상기 정답 변수를 추출하고, 상기 정답 변수와 상기 오답 변수를 비교하여 상기 주요 변수를 인식하고, 그리고, 상기 정답 변수의 변수명을 상기 주요 변수의 변수명으로 변환하는 것인, 인공지능 모델 기반 코딩 테스트 피드백 시스템."}
{"patent_id": "10-2023-0111024", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 메모리는 상기 프로세서로 하여금,상기 정답 코드에서 상기 정답 변수의 코드 실행 순서가 상기 오답 코드에서 상기 주요 변수의 코드 실행 순서와 같도록 상기 정답 코드 내에서 상기 정답 변수의 코드 실행 순서를 변경하는 것인, 인공지능 모델 기반 코딩테스트 피드백 시스템."}
{"patent_id": "10-2023-0111024", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예는 서버의 프로세서에 의해 수행되는 인공지능 모델 기반 코딩 테스트 피드백 방법을 제공한 다. 본 방법은, 학습자 단말로부터 코딩 문제에 대한 코드를 수신하고, 상기 코드의 오답 여부를 판단하는 단계, 상기 코드가 상기 코딩 문제에 대한 오답 코드이면, 기 저장된 코드 기록으로부터 상기 오답 코드와의 유사도가 기 설정된 값을 갖는 상기 코딩 문제에 대한 정답 코드를 도출하는 단계 및 인공지능 모델을 이용하여, 상기 정 답 코드의 변수인 정답 변수와 상기 오답 코드의 변수인 오답 변수를 비교하여 상기 정답 변수와 유사도가 높은 오답 변수인 주요 변수를 인식하고, 상기 정답 변수를 상기 주요 변수로 변환하여 최종 정답 코드를 생성하는 단 계를 포함한다."}
{"patent_id": "10-2023-0111024", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 모델 기반 코딩 테스트 피드백 방법 및 시스템에 관한 것으로, 보다 상세하게는, 학습자 단 말로부터 수신한 코드가 코딩 문제에 대한 오답 코드이면, 오답 코드와 유사한 코딩 문제에 대한 정답 코드를 도출하고, 인공지능 모델을 이용하여 정답 코드의 변수를 오답 코드의 변수로 변환한 최종 정답 코드를 생성하 는 인공지능 모델 기반 코딩 테스트 피드백 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2023-0111024", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4차 산업혁명 기술로 불리는 사물인터넷, 클라우드 컴퓨팅, 인공지능, 5G 등의 정보통신 기술의 중요성이 커짐 에 따라, 정보통신 기술의 기초가 되는 코딩에 대한 중요성이 강조되고 있는 추세이다. 이러한 추세에 발맞춰, 프로그래머를 양성하기 위한 온라인 교육 플랫폼 및 오프라인 교육 학원 등이 생겨나고 있으며, 프로그래머의 코딩에 오류가 없는지 테스트하는 프로그램 역시 개발되고 있다. 온라인 교육 플랫폼의 경우에는 사용자에게 코딩 문제를 제공하고, 사용자가 문제 해답 코드를 입력하면, 오답 여부와 해설을 제공한다. 종래의 온라인 교육 플랫폼은 간단한 코딩 문제에 대해서는 답변 및 해설을 제공할 수있지만, 복수의 테스트 케이스를 포함하는 복잡한 코딩 문제에 대해서는 정해진 답변과 정해진 해설만을 제공할 수 있다. 복수의 테스트 케이스를 포함하는 복잡한 코딩 문제는 해당 코딩 문제를 푸는 학습자에 따라 다양한 정답 코드가 존재한다. 이와 같은 이유로, 학습자가 복잡한 코딩 문제를 해결하기 위한 코드를 작성하고, 작성 된 코드가 정답이 아닐 경우, 정답 코드 및 수정 방향을 얻고자 하더라도, 정해진 답변과 정해진 해설만을 제공 하는 종래의 온라인 교육 플랫폼을 통해서는 정확한 정답 코드를 포함한 피드백을 얻지 못하는 실정이다."}
{"patent_id": "10-2023-0111024", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위한 것으로, 학습자 단말로부터 수신한 코드가 코딩 문제에 대한 오답 코 드이면, 오답 코드와 유사한 코딩 문제에 대한 정답 코드를 도출하고, 인공지능 모델을 이용하여 정답 코드의 변수를 오답 코드의 변수로 변환한 최종 정답 코드를 생성하는 인공지능 모델 기반 코딩 테스트 피드백 방법 및 시스템을 제공하는 것을 일 기술적 과제로 한다. 본 발명이 이루고하 하는 기술적 과제들은 상기한 기술적 과제로 제한되지 않으며, 이하의 설명으로부터 본 발 명의 또 다른 기술적 과제들이 도출될 수 있다."}
{"patent_id": "10-2023-0111024", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 해결하기 위한 기술적 수단으로서, 서버의 프로세서에 의해 수행되는 인공지능 모델 기반 코딩 테스트 피드백 방법을 제공한다. 본 방법은, 학습자 단말로부터 코딩 문제에 대한 코드를 수신하고, 상기 코드의 오답 여부를 판단하는 단계, 상기 코드가 상기 코딩 문제에 대한 오답 코드이면, 기 저장된 코드 기록으 로부터 상기 오답 코드와의 유사도가 기 설정된 값을 갖는 상기 코딩 문제에 대한 정답 코드를 도출하는 단계 및 인공지능 모델을 이용하여, 상기 정답 코드의 변수인 정답 변수와 상기 오답 코드의 변수인 오답 변수를 비 교하여 상기 정답 변수와 유사도가 높은 오답 변수인 주요 변수를 인식하고, 상기 정답 변수를 상기 주요 변수 로 변환하여 최종 정답 코드를 생성하는 단계를 포함한다. 또한, 상술한 기술적 과제를 해결하기 위한 기술적 수단으로서, 인공지능 모델 기반 코딩 테스트 피드백 시스템 이 제공된다. 본 시스템은, 적어도 하나의 프로세서 및 상기 프로세서와 전기적으로 연결되고, 상기 프로세서에 서 수행되는 코딩 테스트 피드백 프로그램이 저장되는 메모리를 포함하고, 상기 메모리는, 상기 프로세서가, 학 습자 단말로부터 코딩 문제에 대한 코드를 수신하고, 상기 코드의 오답 여부를 판단하고, 상기 코드가 상기 코 딩 문제에 대한 오답 코드이면, 기저장된 코드 기록으로부터 상기 오답 코드와의 유사도가 기설정된 값을 갖는 상기 코딩 문제에 대한 정답 코드를 도출하고, 그리고, 인공지능 모델을 이용하여, 상기 정답 코드의 변수인 정 답 변수와 상기 오답 코드의 변수인 오답 변수를 비교하여 상기 정답 변수와 유사도가 높은 오답 변수인 주요 변수를 인식하고, 상기 정답 변수를 상기 주요 변수로 변환하여 최종 정답 코드를 생성하도록 야기하는 코드를 저장한다."}
{"patent_id": "10-2023-0111024", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단들에 따르면, 코딩 문제에 대한 학습자의 오답 코드와 유사도가 높은 정답 코 드를 도출하고, 인공지능 모델을 이용하여 해당 정답 코드의 변수를 오답 코드의 변수로 변환한 최종 정답 코드 를 학습자에게 제공함으로써, 학습자가 작성한 오답 코드와 유사한 형태의 정답 코드를 제공할 수 있다. 또한, 본 발명에 따르면, 코딩 문제에 대한 학습자의 오답 코드와 학습자의 오답 코드와 유사한 형태를 갖는 코 딩 문제에 대한 최종 정답 코드의 차이점 및 학습자의 오답 코드를 최종 정답 코드로 수정하기 위한 코드 수정 방향을 학습자에게 제공할 수 있다."}
{"patent_id": "10-2023-0111024", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명을 상세히 설명하기로 한다. 다만, 본 발명은 여러 가지 상이한 형 태로 구현될 수 있으며, 여기에서 설명하는 실시예들로 한정되는 것은 아니다. 또한, 첨부된 도면은 본 명세서 에 개시된 실시예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않는다. 여기에 사용되는 기술용어 및 과학용어를 포함하는 모든 용어들은 본 발명이 속하는"}
{"patent_id": "10-2023-0111024", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자가 일반적으로 이해하는 의미로 해석되어야 한다. 사전에 정의된 용어들은 관련기술문헌과 현재 개시된 내용에 부합하는 의미를 추가적으로 갖는 것으로 해석되어야 하며, 별도로 정의되 지 않는 한 매우 이상적이거나 제한적인 의미로 해석되지 않는다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 도면에 나타난 각 구성요 소의 크기, 형태, 형상은 다양하게 변형될 수 있다. 명세서 전체에 대하여 동일/유사한 부분에 대해서는 동일/ 유사한 도면 부호를 붙였다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 “부” 등은 명세서 작성의 용이함만이 고려되어 부여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서 에 개시된 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략하였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결(접속, 접촉 또는 결합)\"되어 있다고 할 때, 이는 \"직접적으로 연결(접속, 접촉 또는 결합)\"되어 있는 경우뿐만 아니라, 그 중간에 다른 부재를 사이에 두고 \"간접적으로 연결 (접속, 접촉 또는 결합)\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함(구비 또는 마 련)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소 를 더 \"포함(구비 또는 마련)\"할 수 있다는 것을 의미한다. 본 명세서에서 사용되는 제1, 제2 등과 같이 서수를 나타내는 용어들은 하나의 구성 요소를 다른 구성요소로부 터 구별하는 목적으로만 사용되며, 구성 요소들의 순서나 관계를 제한하지 않는다. 예를 들어, 본 발명의 제1구 성요소는 제2구성요소로 명명될 수 있고, 유사하게 제2구성요소도 제1구성 요소로 명명될 수 있다. 본 명세서에 서 사용되는 단수 표현의 형태들은 명백히 반대의 의미를 나타내지 않는 한 복수 표현의 형태들도 포함하는 것으로 해석되어야 한다. 이하에서 설명되는 통신 모듈은 다른 네트워크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프트웨어를 포함하는 장치를 포함할 수 있다. 또한, 메모리는 통 신 모듈로 입력되는 정보 및 데이터, 프로세서에 의해 수행되는 기능에 필요한 정보 및 데이터, 프로세서의 실 행에 따라 생성된 데이터 중 적어도 어느 하나 이상을 저장할 수 있다. 메모리는 전원이 공급되지 않아도 저장 된 정보를 계속 유지하는 비휘발성 저장장치 및 저장된 정보를 유지하기 위하여 전력을 필요로 하는 휘발성 저 장장치를 통칭하는 것으로 해석되어야 한다. 메모리는 저장된 정보를 유지하기 위하여 전력이 필요한 휘발성 저 장장치 외에 자기 저장 매체(magnetic storage media) 또는 플래시 저장 매체(flash storage media)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 프로세서는 데이터를 제어 및 처리하는 다양한 종류 의 장치들을 포함할 수 있다. 프로세서는 프로그램 내에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위 해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 일 예에서, 프로 세서는 마이크로프로세서(microprocessor), 중앙처리장치(central processing unit: CPU), 프로세서 코어 (processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 형태로 구현될 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 도 1은 본 발명의 일 실시예에 따른 학습자 단말과 통신 연결된 인공지능 모델 기반 코딩 테스트 피드백 시스템을 나타낸 도면이다. 도 1을 참조하면, 인공지능 모델 기반 코딩 테스트 피드백 시스템과 학습자 단말은 유선 또는 무선 통신망을 통해 상호 연결될 수 있다. 인공지능 모델 기반 코딩 테스트 피드백 시스템은 SaaS (Software as a Service), PaaS (Platform as a Service) 또는 IaaS (Infrastructure as a Service)와 같은 클라우드 컴퓨팅 서버로 형성될 수 있다. 학습자 단말은 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱 (desktop), 랩톱(laptop), 휴대성과 이동성이 보장되는 무선 통신 장치 또는 스마트폰, 터치패드를 포함하는 태 블릿 PC 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 의미할 수 있다. 통신망은 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN) 또는 부가가치 통신망(Value Added Network; VAN) 등과 같은 유선 네트워크나 이동 통신망(mobile radio communication network) 또는 위성 통신 망 등과 같은 모든 종류의 무선 네트워크로 구현될 수 있다. 학습자 단말은 적어도 하나의 프로세서 및 메모리를 포함한다. 학습자 단말은 통신 모듈 및 입출력 모듈을 더 포함할 수 있다. 학습자 단말의 통신 모듈은 인공지능 모델 기반 코딩 테스트 피드백 시스템과의 정보 송수신을 수행 한다. 학습자 단말의 프로세서는 메모리와 전기적으로 연결된다. 학습자 단말의 메모리는 프로세서에 서 수행되는 적어도 하나의 코드가 저장된다. 학습자 단말의 입출력 모듈은 외부로부터 학습자 단말 로 전송되는 정보, 데이터 등을 입력 받거나, 학습자 단말이 보유한 정보, 데이터 등을 외부로 출력할 수 있다. 예컨대, 학습자 단말의 입출력 모듈은 디스플레이, 터치패드, 스피커 및 마이크 등을 포함할 수 있 다. 학습자 단말의 메모리에는 프로세서를 통해 실행될 때, 프로세서가 다음과 같은 기능 및 절차들을 수행하 도록 야기하는 코드가 저장된다. 학습자 단말의 메모리에는 인공지능 모델 기반 코딩 테스트 피드백 시스템으로부터 코딩 문제 및 코 딩 문제에 대한 코드 입력 영역을 포함하는 문제 인터페이스를 수신하여 입출력 모듈 상에 출력하도록 야기하는 코드가 저장된다. 학습자 단말의 메모리에는 코드 입력 영역에 입력된 학습자의 코드를 인공지능 모델 기 반 코딩 테스트 피드백 시스템으로 송신하도록 야기하는 코드가 저장된다. 학습자 단말의 메모리에는 인공지능 모델 기반 코딩 테스트 피드백 시스템으로부터 학습자의 코드에 대한 오답 여부, 학습자의 코드 에 포함된 변수를 포함하는 정답 코드 및 오답 코드를 정답 코드로 수정하기 위한 수정 방향을 포함하는 해설을 수신하도록 야기하는 코드가 저장된다. 정답 코드는 학습자의 코드와 코드 스타일이 동일하도록 구성된다. 도 2는 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템의 구성을 도시한 블록도이고, 도 3 은 인공지능 모델 기반 코딩 테스트 피드백 시스템이 최종 정답 코드를 생성하는 것에 대한 일례를 나타낸 도면이고, 도 4는 인공지능 모델 기반 코딩 테스트 피드백 시스템이 정답 코드의 변수를 변환하여 최종 정 답 코드를 생성하는 것에 대한 일례를 나타낸 도면이다. 도 1 내지 도 4를 함께 참조하면, 인공지능 모델 기반 코딩 테스트 피드백 시스템은 적어도 하나의 프로세 서 및 메모리를 포함한다. 인공지능 모델 기반 코딩 테스트 피드백 시스템은 통신 모듈 및데이터베이스를 더 포함할 수 있다. 통신 모듈은 학습자 단말과의 정보 송수신을 수행한다. 통신 모듈은 외부 장치 또는 서버와 정 보 송수신을 수행하여 코딩 테스트 피드백에 필요한 데이터를 송수신할 수 있다. 데이터베이스는 코딩 테스트 피드백에 필요한 데이터가 저장되는 곳일 수 있다. 데이터베이스는 메모 리의 일부 영역에 구축되거나 별도의 하드웨어로 구현될 수 있다. 프로세서는 메모리에 저장된 코드에 따라 동작을 수행한다. 메모리는 프로세서와 전기적으로 연결되고, 프로세서에서 수행되는 코드들이 저장된다. 메모리 는 프로세서를 통해 실행될 때 프로세서가 다음과 같은 기능 및 절차들을 수행하도록 야기하는 코드가 저장된다. 메모리에는 학습자 단말로부터 코딩 문제에 대한 학습자의 코드를 수신하고, 학습자의 코드 의 오답 여부를 판단하도록 야기하는 코드가 저장된다. 보다 상세하게는, 메모리에는 학습자 단 말로 코딩 문제를 제공하고, 학습자 단말로부터 코딩 문제에 대한 학습자의 코드를 수신하도록 야기하는 코드가 저장된다. 메모리에는 학습자의 코드가 코딩 문제에 대한 오답인지 여부를 판 단하도록 야기하는 코드가 저장된다. 코딩 문제는 하나 이상의 테스트 케이스를 포함한다. 학습자의 코드 는 코드 변수를 포함한다. 보다 상세하게는, 메모리에는 학습자 단말로 코딩 문제 및 해당 코딩 문제 에 대한 코드 입력 영역을 포함하는 문제 인터페이스를 제공하고, 학습자 단말로부터 코드 입력 영 역에 입력된 학습자의 코드를 수신하도록 야기하는 코드가 저장된다. 메모리에는 학습자의 코드가 코딩 문제에 대한 오답 코드이면, 기 저장된 코드 기록으로부 터 오답 코드와의 유사도가 기 설정된 값을 갖는 코딩 문제에 대한 정답 코드를 도출하도록 야기하는 코드가 저장된다. 메모리에는 TF-IDF(Term Frequency-Inverse Document Frequency), 문장 유사도 검색, 문서 유사도 검색, 자연어 처리(NLP, Natural Language Processing), 벡터 검색(Vector Search)을 통해 기저장 된 코드 기록으로부터 오답 코드와의 유사도를 도출하도록 야기하는 코드가 저장될 수 있다. 기 저장 된 코드 기록에 포함된 코드들은 벡터로 변환된 코드들이다. 기 저장된 코드 기록은 벡터로 변환된 코드들 각각에 대한 코드 저장 순서, 코딩 문제에 포함된 하나 이상의 테스트 케이스 각각에 대한 테스트 케이 스 통과 정보, 정답 코드 여부 및 오답 코드 여부 중 적어도 하나 이상을 포함한다. 코딩 문제가 복수의 테스트 케이스를 포함하고 있을 경우, 정답 코드는 코딩 문제에 포함된 복수의 테스트 케이스 모두를 통과한 코드이고, 오답 코드는 코딩 문제에 포함된 복수의 테스트 케이스 중 어느 하나를 통과하지 못한 코드이다. 보다 상세하게는, 메모리에는 오답 코드를 벡터로 임베딩하도록 야기하는 코드가 저장된다. 메모리 에는 벡터로 변환된 오답 코드와 기 저장된 코드 기록에 포함된 코드를 비교하여 기 저장된 코 드 기록에서 오답 코드와 유사도가 기설정된 값을 갖는 정답 코드를 도출하도록 야기하는 코드 가 저장된다. 기설정된 값은 기설정된 범위 값일 수 있다. 보다 상세하게는, 메모리에는 기 저장된 코드 기록에 포함된 코드들 중 학습자 단말로부터 수신 되고, 벡터로 변환된 오답 코드와 유사도가 가장 높은 코드를 주요 코드로 선정하도록 야기하는 코드가 저 장된다. 메모리에는 주요 코드가 코딩 문제에 정답인 특정 학습자의 코드이면, 주요 코드를 정답 코드 로 선정하도록 야기하는 코드가 저장된다. 메모리에는 주요 코드가 코딩 문제에 오답인 코드이면, 주 요 코드를 제출한 특정 학습자의 코드 제출 기록에서 코딩 문제에 대해 정답인 코드를 정답 코드로 선정하 도록 야기하는 코드가 저장된다. 기 저장된 코드 기록에 포함된 코드들은 다른 학습자의 단말로부터 수신한 코드 및 코드 기록 생성 모델로 생성된 코드 중 적어도 하나 이상을 포함한다. 코드 기록 생성 모델은 대규모 언어 모델일 수 있다. 코드 기록 생성 모델은 기 저장된 코드 기록에 포함된 코딩 문제에 대한 정답 코드에서 해당 정답 코드의 변수, 코드 언어 및 상수 스타일 중 적어도 하나 이상을 포함하는 코드 스타일 및 코드 구조를 변경한 추가 정답 코드를 생 성한다. 기 저장된 코드 기록에 포함된 정답 코드에 함수가 포함되어 있지 않을 경우, 코드 기록 생성 모 델은 기 저장된 코드 기록에 포함된 정답 코드에 함수를 포함시켜 추가 정답 코드를 생성한다. 코드 기록 생성 모델은 기 저장된 코드 기록에 포함된 오답 코드와 해당 오답 코드와 연관된 코딩 문제를 기초로 기 저장된 코드 기록에 포함된 오답 코드를 해당 오답 코드와 연관된 코딩 문제의 정답 코드가 되도록 수정하 여 정답 코드를 생성한다. 코드 기록 생성 모델을 통해 기 저장된 코드 기록에 포함된 코드를 확장할 수 있다.메모리에는 인공지능 모델을 이용하여, 정답 코드의 변수인 정답 변수(710, 720, 730)와 오답 코드의 변수인 오답 변수(510, 520, 530)를 비교하여 정답 변수(710, 720, 730)와 유사도가 높은 오답 변 수(510, 520, 530)인 주요 변수를 인식하고, 정답 변수(710, 720, 730)를 주요 변수로 변환하여 최종 정답 코드 를 생성하도록 야기하는 코드가 저장된다. 메모리에는 최종 정답 코드를 기 저장된 코드 기록 에 저장하도록 야기하는 코드가 저장된다. 인공지능 모델은 특정 코딩 문제에 대한 정답 코드인 제1 코드 및 오답 코드인 제2 코드를 수신 받으면, 제1 코드의 변수와 유사도가 가장 높은 제2 코드의 변수를 인식 하고, 제1 코드의 변수를 제1 코드의 변수와 유사도가 가장 높은 제2 코드의 변수로 변환한 제3 코드를 출력하 도록 훈련된 모델이다. 인공지능 모델은 대규모 언어 모델(LLM, Large Language Model), 정적 분석 모델, 동적 분석 모델 및 딥러닝 기반의 신경망 모델 중 적어도 하나 이상일 수 있다. 대규모 언어 모델은 ChatGPT일 수 있다. 딥러닝 기반의 신경망 모델은 그래프 신경망(GNN, Graph Neural Networks), 재귀 신경망(RvNNs, Recursive Neural Networks), 합성곱 신경망(CNN, Convolutional Neural Networks), 순환 신경망 (RNN, Recurrent Neural Network), Transformer 모델일 수 있다. 보다 상세하게는, 메모리에는 오답 코드 및 정답 코드로부터 오답 변수(510, 520, 530) 및 정답 변수(710, 720, 730)를 추출하도록 야기하는 코드가 저장된다. 메모리에는 오답 코드 및 정답 코드 를 추상 구문 트리(AST, Abstract Syntax Tree) 또는 제어 흐름 그래프(Control Flow Graph)로 파싱하고, 파싱된 오답 코드 및 정답 코드에서 오답 변수(510, 520, 530) 및 정답 변수(710, 720, 730)를 추출 하도록 야기하는 코드가 저장된다. 오답 변수(510, 520, 530)는 오답 코드의 변수이고, 정답 변수(710, 720, 730)는 정답 코드의 변수이다. 메모리에는 정답 변수(710, 720, 730)와 오답 변수(510, 520, 530)를 비교하여 주요 변수를 인식하도록 야 기하는 코드가 저장된다. 보다 상세하게는, 메모리에는 정답 변수(710, 720, 730) 및 오답 변수(510, 520, 530)에 대한 특성 벡터를 도출하고, 정답 변수(710, 720, 730)에 대한 특성 벡터와 오답 변수(510, 520, 530) 에 대한 특성 벡터를 비교하여 유사도를 도출하도록 야기하는 코드가 저장된다. 메모리에는 정답 변수 (710, 720, 730)에 대한 특성 벡터와 유사도가 가장 높은 주요 변수를 인식하도록 야기하는 코드가 저장된다. 정답 변수(710, 720, 730)에 대한 특성 벡터는 정답 변수(710, 720, 730)의 종류 및 학습자 단말로 제공 된 코딩 문제 또는 기설정된 코딩 테스트 케이스에 대한 정답 코드의 실행 과정에 따른 정답 변수(710, 720, 730) 값의 변화 중 적어도 하나 이상을 기초로 도출된 벡터이다. 오답 변수(510, 520, 530)에 대한 특성 벡터는 오답 변수(510, 520, 530)의 종류 및 학습자 단말로 제공된 코딩 문제 또는 기설정된 코딩 테스트 케이스에 대한 오답 코드의 실행 과정에 따른 오답 변수 값의 변화 중 적어도 하나 이상을 기초로 도출되 는 벡터이다. 보다 상세하게는, 정답 변수에 대한 특성 벡터는 정답 변수의 종류에 따른 벡터값 및 학습자 단말 로 제공된 코딩 문제 또는 기설정된 코딩 테스트 케이스에 대한 정답 코드의 실행 과정에 따라 변화 하는 정답 변수(710, 720, 730) 값들 중 적어도 하나 이상을 합성곱(convolution)하여 도출된 벡터이다. 오답 변수(510, 520, 530)에 대한 특성 벡터는 오답 변수(510, 520, 530)의 종류에 따른 벡터값 및 학습자 단말 로 제공된 코딩 문제 또는 기설정된 코딩 테스트 케이스에 대한 오답 코드의 실행 과정에 따라 변화 하는 오답 변수 값들 중 적어도 하나 이상을 합성곱하여 도출되는 벡터이다. 인공지능 모델 기반 코딩 테스트 피드백 시스템은 정답 변수(710, 720, 730)의 특성 변수와 오답 변수(510, 520, 530)의 특성 변수를 이용 함으로써, 정답 변수(710, 720, 730)와 유사한 역할을 하는 오답 변수(510, 520, 530)를 인식할 수 있다. 변수 의 종류는 int, float 등을 의미한다. 메모리에는 인공지능 모델로 오답 코드와 정답 코드(70 0)를 입력하고, 인공지능 모델로 오답 코드와 정답 코드 간에 유사한 역할을 수행하는 변수명을 출력해달라는 문구를 입력하여 정답 코드 변수(710, 720, 730)와 오답 코드 변수(510, 520, 530) 간의 변 수명의 관계를 대응시키도록 야기하는 코드가 저장될 수 있다. 예를 들면, 제1 정답 변수와 제1 오답 변수, 제2 오답 변수 및 제3 오답 변수를 비교하여 도출된 유사도가 하기 표 1과 같으면, 인공지능 모델 기반 코딩 테스트 피드백 시스템은 제1 정답 변수 와 가장 유사도가 높은 제1 오답 변수를 제1 정답 변수에 대한 주요 변수로 인식한다. 표 1 구분 제1 정답 변수와의 유사도 제1 오답 변수 99% 제2 오답 변수 30% 제3 오답 변수 20%메모리에는 정답 변수(710, 720, 730)의 변수명(711, 712, 713)을 주요 변수의 변수명으로 변환하도록 야 기하는 코드가 저장된다. 예를 들면, 제1 정답 변수에 대한 주요 변수가 제1 오답 변수이고, 제2 정 답 변수에 대한 주요 변수가 제2 오답 변수이고, 제3 정답 변수에 대한 주요 변수가 제3 오답 변수이면, 인공지능 모델 기반 코딩 테스트 피드백 시스템은 제1 정답 변수의 변수명을 제 1 오답 변수의 변수명로 변환하고, 제2 정답 변수의 변수명을 제2 오답 변수의 변수 명로 변환하고, 제3 정답 변수의 변수명을 제3 오답 변수의 변수명으로 변환한다. 메모리에는 오답 코드 및 최종 정답 코드를 비교하여 오답 코드와 최종 정답 코드의 차이점을 표시하는 코드 비교 영역을 포함하는 피드백 인터페이스를 학습자 단말로 제공하도록 야기하는 코드가 저장된다. 메모리에는 코드 해설 모델을 이용하여 오답 코드 및 최종 정답 코드를 기초 로 오답 코드를 최종 정답 코드로 수정하기 위한 코드 수정 방향을 포함하는 답변을 도출하도록 야기 하는 코드가 더 저장되고, 피드백 인터페이스는 해당 답변을 표시하는 영역을 더 포함할 수 있다. 코드 해설 모 델은 특정 코딩 문제, 특정 코딩 문제에 대한 특정 오답 코드 및 특정 정답 코드를 기초로 특정 오답 코드를 특 정 정답 코드로 수정하기 위한 수정 방향을 포함하는 답변을 출력하도록 훈련된 인공지능 모델이다. 코드 해설 모델은 대규모 언어 모델(LLM, Large Language Model)일 수 있다. 피드백 인터페이스는, 기 저장된 코드 기록 으로부터 정답 코드를 제출한 특정 학습자의 학습자 단말로 제공된 코딩 문제에 대한 코드 제출 기록에 따라, 해당 코드 제출 기록에 포함된 코드들의 변화 과정이 표시되는 변화 과정 표시 영역(미도시)을 더 포함할 수 있다. 변화 과정 표시 영역은 특정 학습자의 학습자 단말로 제공된 코딩 문제에 대한 코드 제출 기록에 포함된 코드들을 대상으로 코드 저장 순서에 따른 이전 코드와 다음 코드가 표시되는 코드 영역을 포함 하고, 이전 코드와 다음 코드의 차이점이 코드 영역에 표시된 이전 코드와 다음 코드 상에 표시된다. 다음 코드 는 이전 코드와 비교했을 때, 코드 변화도가 기설정된 범위에 해당하고, 이전 코드 보다 코딩 문제에 포함된 테 스트 케이스 통과 수가 더 많은 코드일 수 있다. 이전 코드 및 상기 다음 코드에 포함된 변수는 인공지능 모델 을 통해, 오답 변수와 이전 코드 및 다음 코드에 포함된 변수 간의 유사도를 기초로 오답 변수로 변환된다. 피드백 인터페이스는 도 7에서 후술하고자 한다. 도 5는 인공지능 모델 기반 코딩 테스트 피드백 시스템이 정답 코드의 변수 위치를 변경하는 것에 대 한 일례를 나타낸 도면이다. 도 5를 참조하면, 인공지능 모델 기반 코딩 테스트 피드백 시스템은 정답 코드에서 정답 변수의 코드 실행 순서가 오답 코드에서 주요 변수의 코드 실행 순서와 같도록 정답 코드 내에서 정답 변수의 코드 실행 순서를 변경하여 코드 실행 순서가 변경된 정답 변수(740-1)를 포함하는 정답 코드(700- 1)를 도출한다. 인공지능 모델 기반 코딩 테스트 피드백 시스템은 코드 실행 순서가 변경된 정답 코드 (700-1)의 오류 발생 여부를 판단하고, 오류가 있는 것으로 판단되면, 정답 변수(740-1)의 코드 실행 순서를 정 답 변수(740-1)의 코드 실행 순서가 변경되기 전으로 수정한다. 이를 통해, 코드의 결과에 영향이 가지 않는 선 에서 코드의 정답 코드와 오답 코드를 비교하고 유사 역할을 하는 정답 코드 줄의 순서를 오답 코드의 코드 줄 의 순서와 일치시키는 작업을 거쳐, 도출된 유사한 정답 코드가 오답 코드와 보다 유사하도록 수정할 수 있다. 도 6은 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 문제 인터페이스에 대한 일례를 나타낸 도면이다. 도 1 및 도 6을 함께 참조하면, 문제 인터페이스는 코딩 문제 표시 영역 및 코드 입력 영역 을 포함한다. 코딩 문제 표시 영역은 코딩 문제가 표시되는 영역이다. 코드 입력 영역은 코딩 문제 표시 영역 에 표시된 코딩 문제에 대한 코드가 입력되는 영역이다. 인공지능 모델 기반 코딩 테스트 피드백 시스템 은 코딩 문제 표시 영역에 입력된 코드를 학습자 단말로부터 수신한다. 도 7은 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 피드백 인터페이스에 대한 일례 를 나타낸 도면이다. 도 7을 참조하면, 피드백 인터페이스는 학습자 코드 표시 영역, 정답 코드 표시 영역 및 해 설 표시 영역을 포함한다. 학습자 코드 표시 영역은 학습자의 오답 코드가 표시되는 영역이다. 학습자 코드 표시 영역 은 오답 코드와 최종 정답 코드의 차이점이 강조되어 표시된다. 정답 코드 표시 영역은 최종 정답 코드가 표시되는 영역이다. 정답 코드 표시 영역은 최종 정답 코드와 오답 코드의 차이점이 강조되어 표시된다. 해설 표시 영역은 코드 해설 모델에 의해 출력된 오답 코드를 최종 정답 코드로 수정하기 위 한 수정 방향을 포함하는 답변이 표시되는 영역이다. 학습자 코드 표시 영역에 표시되는 오답 코드와 최종 정답 코드의 차이점과 정답 코드 표시 영역에 표시되는 최종 정답 코드와 오답 코드의 차이점은 서로 다른 색상으로 표시될 수 있 다. 도 8은 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 피드백 인터페이스에 대한 다른 일례를 나타낸 도면이다. 도 8을 참조하면, 피드백 인터페이스는 코드 차이점 표시 영역 및 해설 표시 영역을 포함한 다. 코드 차이점 표시 영역은 오답 코드와 최종 정답 코드의 차이점이 강조되어 표시되는 영역이다. 보다 상세하게는, 코드 차이점 표시 영역은 학습자의 오답 코드에서 최종 정답 코드(90 0)와 차이점이 있는 제1 코드 줄(1211-1 내지 1211-4)이 제1 색상으로 강조 표시된다. 코드 차이점 표시 영역 은 제1 코드 줄(1211-1 내지 1211-4)의 하단 또는 상단 코드 줄에 제1 코드 줄(1211-1 내지 1211-4)의 오답 코드와 대응되는 최종 정답 코드의 코드가 표시되는 제2 코드 줄(1212-1 내지 1212-4)을 포함한 다. 제2 코드 줄은 제2 색상으로 강조 표시된다. 제1 색상과 제2 색상은 서로 다른 색상일 수 있다. 해설 표시 영역은 코드 해설 모델에 의해 출력된 오답 코드를 최종 정답 코드로 수정하기 위 한 수정 방향을 포함하는 답변이 표시되는 영역이다. 도 9는 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 피드백 목록 인터페이스에 대한 다른 일례를 나타낸 도면이다. 도 3, 7 및 9를 함께 참조하면, 인공지능 모델 기반 코딩 테스트 피드백 시스템이 도출한 정답 코드 가 복수일 경우, 인공지능 모델 기반 코딩 테스트 피드백 시스템은 복수의 정답 코드에 대한 복수의 최종 정답 코드를 생성한다. 인공지능 모델 기반 코딩 테스트 피드백 시스템은 복수의 최종 정답 코 드 각각에 대한 피드백 블록(1310 내지 1380)을 포함하는 피드백 목록 인터페이스를 학습자 단말 로 제공한다. 피드백 블록(1310 내지 1380)은 피드백 블록(1310 내지 1380)의 번호, 피드백 블록(1310 내 지 1380)과 연관된 최종 정답 코드의 복잡도, 실행시간 및 오답 코드와의 유사도 중 적어도 하나 이 상을 포함한다. 학습자 단말로부터 특정 피드백 블록에 대한 선택 입력을 수신하면, 인공지능 모델 기반 코딩 테스 트 피드백 시스템은 특정 피드백 블록과 연관된 피드백 인터페이스(1100-1)를 피드백 목록 인터페이 스 상에 표시할 수 있다. 도 10은 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 질의 응답 인터페이스에 대한 일례를 나타낸 도면이다. 도 10을 참조하면, 인공지능 모델 기반 코딩 테스트 피드백 시스템은 학습자 단말로부터 질의 응답 요청을 수신하면, 학습자 단말로 질의 응답 인터페이스를 제공한다. 질의 응답 인터페이스는 질문 입력 영역 및 답변 표시 영역을 포함한다. 질문 입력 영역은 학습자의 질문이 입력되는 영역이다. 답변 표시 영역은 질문 입력 영역에 입력된 질문에 대한 답변이 표시되는 영역이다. 인공지능 모델 기반 코딩 테스트 피드백 시스템은 학습자 단말로부터 질문 입력 영역에 입력된 학습자의 질문을 수신한다. 인공지능 모델 기반 코딩 테스트 피드백 시스템은 질의 응답 모델을 이용하여 학습자의 질문을 기초로 학습자의 질문에 대한 응답을 생성하고, 해당 응답을 질문 답변 표시 영역에 표시한다. 도 11은 본 발명의 다른 실시예에 따른 인공지능 모델 기반 코딩 테스트 피드백 방법을 설명하는 동작 흐름도이 고, 도 12 내지 도 15는 인공지능 모델 기반 코딩 테스트 피드백 방법의 단계들이 포함하는 세부 단계들을 나타낸 흐름도이다. 이하에서 도 11 내지 도 15를 참조하여, 인공지능 모델 기반 코딩 테스트 피드백 방법을 설명하 도록 한다. 이하에서 설명될 인공지능 모델 기반 코딩 테스트 피드백 방법의 각 단계들은 앞서 도 1 내지 도 10 을 참조하여 설명한 인공지능 모델 기반 코딩 테스트 피드백 시스템에 의해 수행될 수 있다. 따라서, 앞서 도 1 내지 도 10을 참조하여 설명한 본 발명의 실시예에 대한 내용은 이하에서 설명될 실시예에도 동일하게 적 용될 수 있으며, 이하에서 상술한 설명과 중복되는 내용은 생략하도록 한다. 이하에서 설명되는 단계들은 반드 시 순서대로 수행되어야 하는 것은 아니고, 단계들의 순서는 다양하게 설정될 수 있으며, 단계들은 거의 동시에 수행될 수도 있다. 도 11을 참조하면, 인공지능 모델 기반 코딩 테스트 피드백 방법은 코드 수신 및 오답 판단 단계(S1100), 정답 코드 도출 단계(S1200) 및 최종 정답 코드 생성 단계(S1300)를 포함하고, 피드백 인터페이스 제공 단계(S1400) 를 더 포함한다. 코드 수신 및 오답 판단 단계(S1100)는 학습자 단말로부터 코딩 문제에 대한 코드를 수신하고, 해당 코드의 오 답 여부를 판단하는 단계이다. 정답 코드 도출 단계(S1200)는 학습자의 코드가 코딩 문제에 대한 오답 코드이면, 기저장된 코드 기록으로부터 오답 코드와의 유사도가 기설정된 값을 갖는 코딩 문제에 대한 정답 코드를 도출하는 단계이다. 기 저장된 코드 기록은 코딩 문제에 대한 코드들이 벡터로 변환되어 저장된 기록이다. 최종 정답 코드 생성 단계(S1300)는 인공지능 모델을 이용하여, 정답 코드의 변수인 정답 변수와 오답 코드의 변수인 오답 변수를 비교하여 정답 변수와 유사도가 높은 오답 변수인 주요 변수를 인식하고, 정답 변수를 주요 변수로 변환하여 최종 정답 코드를 생성하는 단계이다. 정답 코드 도출 단계(S1200)에서 도출된 정답 코드가 복 수일 경우, 최종 정답 코드 생성 단계(S1300)는 복수의 정답 코드에 대한 복수의 최종 정답 코드를 생성하는 단 계이다. 인공지능 모델은 특정 코딩 문제에 대한 정답 코드인 제1 코드 및 오답 코드인 제2 코드를 수신 받으면, 제1 코드의 변수와 유사도가 가장 높은 제2 코드의 변수를 인식하고, 제1 코드의 변수를 제1 코드의 변 수와 유사도가 가장 높은 제2 코드의 변수로 변환한 제3 코드를 출력하도록 훈련된 모델이다. 피드백 인터페이스 제공 단계(S1400)는 오답 코드 및 최종 정답 코드를 비교하여 오답 코드와 최종 정답 코드의 차이점을 표시하는 코드 비교 영역을 포함하는 피드백 인터페이스를 상기 학습자 단말로 제공하는 단계이다. 피 드백 인터페이스 제공 단계(S1400)는 코드 해설 모델을 이용하여, 오답 코드 및 최종 정답 코드를 기초로 오답 코드를 최종 정답 코드로 수정하기 위한 코드 수정 방향을 포함하는 답변을 도출하는 단계를 더 포함한다. 피드 백 인터페이스는 코드 해설 모델을 이용하여 출력된 답변을 표시하는 영역을 더 포함한다. 코드 해설 모델은 특 정 코딩 문제, 특정 코딩 문제에 대한 특정 오답 코드 및 특정 정답 코드를 기초로 특정 오답 코드를 특정 정답 코드로 수정하기 위한 수정 방향을 포함하는 답변을 출력하도록 훈련된 인공지능 모델이다. 최종 정답 코드 생성 단계(S1300)에서 복수의 정답 코드에 대한 복수의 최종 정답 코드를 생성하면, 피드백 인 터페이스 제공 단계(S1400)는 복수의 최종 정답 코드 각각에 대한 피드백 블록을 포함하는 피드백 목록 인터페 이스를 학습자 단말로 제공하는 단계이다. 학습자 단말로부터 특정 피드백 블록에 대한 선택 입력을 수신하면, 특정 피드백 블록과 연관된 피드백 인터페이스는 피드백 목록 인터페이스 상에 표시된다. 도 12를 참조하면, 정답 코드 도출 단계(S1200)는 오답 코드 벡터 변환 단계(S1210) 및 오답 코드와 코드 기록 비교 단계(S1220)를 포함한다. 오답 코드 벡터 변환 단계(S1210)는 오답 코드를 벡터로 변환하는 단계이다. 오답 코드와 코드 기록 비교 단계 (S1220)는 벡터로 변환된 오답 코드와 기 저장된 코드 기록에 포함된 코드들을 비교하여 기 저장된 코드 기록에 서 정답 코드를 도출하는 단계이다. 도 13을 참조하면, 오답 코드와 코드 기록 비교 단계(S1220)는 주요 코드 선정 단계(S1221) 및 정답 코드 선정 단계(S1222)를 포함한다. 주요 코드 선정 단계(S1221)는 기 저장된 코드 기록에 포함된 코드들 중 벡터로 변환된 오답 코드와 유사도가 가장 높은 코드를 주요 코드로 선정하는 단계이다. 정답 코드 선정 단계(S1222)는 주요 코드가 코딩 문제에 정 답인 특정 학습자의 코드이면, 주요 코드를 정답 코드로 선정하고, 주요 코드가 코딩 문제에 오답인 코드이면, 주요 코드를 제출한 특정 학습자의 코드 제출 기록에서 코딩 문제에 대해 정답인 코드를 상기 정답 코드로 선정 하는 단계이다. 도 14를 참조하면, 최종 정답 코드 생성 단계(S1300)는 코드 변수 추출 단계(S1310), 주요 변수 인식 단계 (S1320) 및 변수명 변환 단계(S1330)를 포함하고, 코드 실행 순서 변경 단계(S1340)를 더 포함할 수 있다. 코드 변수 추출 단계(S1310)는 오답 코드 및 정답 코드로부터 오답 변수 및 정답 변수를 추출하는 단계이다. 주 요 변수 인식 단계(S1320)는 정답 변수와 오답 변수를 비교하여 주요 변수를 인식하는 단계이다. 변수명 변환 단계(S1330)는 정답 변수의 변수명을 주요 변수의 변수명으로 변환하는 단계이다. 코드 실행 순서 변경 단계(S1340)는 정답 코드에서 정답 변수의 코드 실행 순서가 오답 코드에서 주요 변수의 코드 실행 순서와 같도록 정답 코드 내에서 정답 변수의 코드 실행 순서를 변경하는 단계이다. 도 15를 참조하면, 주요 변수 인식 단계(S1320)는 특성 벡터 도출 단계(S1321), 유사도 도출 단계(S1322) 및 유 사도 기반 주요 변수 인식 단계(S1323)를 포함한다. 특성 벡터 도출 단계(S1321)는 정답 변수 및 오답 변수에 대한 특성 벡터를 도출하는 단계이다. 정답 변수에 대 한 특성 벡터는 정답 변수의 종류 및 코딩 문제 또는 기설정된 코딩 테스트 케이스에 대한 정답 코드의 실행 과 정에 따른 정답 변수 값의 변화 중 적어도 하나 이상을 기초로 도출된다. 오답 변수에 대한 특성 벡터는 오답 변수의 종류 및 코딩 문제 또는 기설정된 코딩 테스트 케이스에 대한 오답 코드의 실행 과정에 따른 오답 변수 값의 변화 중 적어도 하나 이상을 기초로 도출된다. 유사도 도출 단계(S1322)는 정답 변수에 대한 특성 벡터와 오답 변수에 대한 특성 벡터를 비교하여 유사도를 도 출하는 단계이다. 유사도 기반 주요 변수 인식 단계(S1323)는 정답 변수에 대한 특성 벡터와 유사도가 가장 높 은 주요 변수를 인식하는 단계이다. 이상 지금까지 설명한 본 발명의 실시예들에 따른 인공지능 모델 기반 코딩 테스트 피드백 방법은, 컴퓨터에 의 해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비 휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 포 함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모 두 포함한다."}
{"patent_id": "10-2023-0111024", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 상술한 설명을 기초로 본 발명의 기술적 사상이나 필수 적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러 므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해되어야만 한다. 본 발명의 범위는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개 념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다. 본원 의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범 위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해석 되어야 한다."}
{"patent_id": "10-2023-0111024", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 학습자 단말과 통신 연결된 인공지능 모델 기반 코딩 테스트 피드백 시스템 을 나타낸 도면이다. 도 2는 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템의 구성을 도시한 블록도이다. 도 3은 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템이 최종 정답 코드를 생성하는 것에 대한 일례를 나타낸 도면이다. 도 4는 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템이 정답 코드의 변수를 변환하여 최종 정 답 코드를 생성하는 것에 대한 일례를 나타낸 도면이다. 도 5는 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템이 정답 코드의 변수 위치를 변경하는 것 에 대한 일례를 나타낸 도면이다. 도 6은 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 코드 문제 인터페이스에 대한 일례를 나타낸 도면이다. 도 7은 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 피드백 인터페이스에 대한 일 례를 나타낸 도면이다. 도 8은 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 피드백 인터페이스에 대한 다 른 일례를 나타낸 도면이다. 도 9는 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 피드백 목록 인터페이스에 대 한 일례를 나타낸 도면이다. 도 10은 도 1에 도시된 인공지능 모델 기반 코딩 테스트 피드백 시스템이 제공하는 질의 응답 인터페이스에 대 한 일례를 나타낸 도면이다. 도 11은 본 발명의 다른 실시예에 따른 인공지능 모델 기반 코딩 테스트 피드백 방법을 설명하는 동작 흐름도이 다. 도 12 내지 도 15는 도 11에 도시된 인공지능 모델 기반 코딩 테스트 피드백 방법의 단계들이 포함하는 세부 단 계들을 나타낸 흐름도이다."}
