{"patent_id": "10-2021-0177093", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0088164", "출원번호": "10-2021-0177093", "발명의 명칭": "인공지능 기반의 재선충 검지 시스템 및 방법.", "출원인": "(주)엘컴텍", "발명자": "유대상"}}
{"patent_id": "10-2021-0177093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "촬영기기를 통해 공중에서 산림상태를 촬영하는 공중 촬영기와, 상기 공중 촬영기를 통해 촬영된 이미지를 토대로 재선충 피해 지역을 검출하는 재선충 검출 서버를 포함하여 이루어지되,상기 재선충 검출 서버는 공중 촬영기를 통해 촬영된 이미지를 일정한 포멧에 맞춰 지정된 곳에 저장하는 이미지 입수부와, 수집된 이미지를 토대로 재선충 피해지역을 검출을 위한 운영부와 시멘틱 세그멘테이션을 통해 분리 인식하고 학습하는 학습부로 구성되고,상기 학습부는 이미지 입수부로부터 수집된 이미지를 시맨틱 세그멘테이션을 통해 픽셀단위로 라벨링하여 침엽수림지대와 활엽수림지대 혼합림지대 기타지역으로 분리 인식할 수 있게 학습하는 수림 분리 학습부와, 상기 이미지 입수부를 통해 수집된 이미지를 시맨틱 세그멘테이션을 통해 픽셀단위로 라벨링하여 재선충 피해지역을 분리 인식할 수 있게 학습하는 재선충 학습부와, 상기 재선충 학습부를 통해 검출된 피해지역의 피해 정도를 각각의 단계별로 분리 인식 가능하게 학습하는 정밀 분리 학습부를 포함하고,상기 운영부는 이미지 입수부를 통해 촬영된 이미지를 보정하여 동일 축척으로 식별되게 하는 정사 이미지로 만든 후 반복 촬영된 다수의 이미지를 조합하여 픽셀간 기하학적인 역학관계를 연산하여 위치 인식 가능한 이미지를 생성하는 이미지 생성부와, 상기 이미지 생성부를 통해 생성된 이미지에서 침엽수림지대와 활엽수림지대 혼합림지대와 기타지역 중 침엽수림지대 영역만을 분리해 내기 위한 재선충 검출 영역 분리부와, 상기 재선충 검출 영역 분리부를 통해 분리된 침엽수림지대 영역 중에서 재선충 학습부를 통해 피해지역만을 분리해 내는 재선충 검출부와, 상기 재선충 검출부를 통해 분리된 피해지역을 확대한 후 해당 지역을 정밀 분리 학습부를 통해피해 정도를 파악하여 단순 의심지역인지 혹은 진짜 피해지역인지 확인하는 재선충 정밀 분석부와, 위치 인식가능한 이미지 내에서 검출된 피해지역을 원본 이미지에서 실재 피해를 입은 지역을 추출해 내는 원본 이미지비교부와, 상기 원본 이미지 비교부를 통해 검출된 피해지역을 지리정보시스템과 호환 가능한 정보 저장 형식으로 저장하고 화면에 피해지역을 디스플레이하는 검출 결과 저장 표출부를 포함하여 이루어져, 재선충 피해를 입은 피해지역이 자동 식별되어 용이하게 모니터링되는 동시에 향상된 정확도를 가지는 인공지능기반의 재선충 검지 시스템."}
{"patent_id": "10-2021-0177093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 재선충 검출 서버는 반복적으로 촬영한 이미지를 시계열화하고, 이미지 보정후 피해지역을 피드백 입력시켜 학습되게 하는 시계열 중첩 판별부를 더 포함하는 인공지능 기반의 재선충 검지 시스템."}
{"patent_id": "10-2021-0177093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "공중 촬영기가 산림상태를 반복 촬영하는 단계 및, 재선충 검출 서버가 촬영된 이미지를 전송받는 단계와,상기 재선충 검출 서버의 이미지 입수부가 지정된 장소에 촬영된 이미지를 수집 저장하는 단계와,상기 재선충 검출 서버의 수림 분리 학습부는 이미지 입수부를 통해 수집된 이미지를 시멘틱 세그멘테이션을 통해 픽셀단위로 라벨링하여 침엽수림지대와 활엽수림지대 혼합림지대 기타지역으로 분리 인식 가능하게 학습하는단계와,상기 재선충 검출 서버의 재선충 학습부는 이미지 입수부를 통해 수집된 이미지를 시멘틱 세그멘테이션을 통해픽셀단위로 라벨링하여 분리된 피해지역을 학습하는 단계와,상기 재선충 검출 서버의 정밀 분리 학습부는 재선충 학습부를 통해 검출된 피해지역들을 피해 정도 혹은 유사도를 구분 인식할 수 있게 학습하는 단계로 이루어지는 인공지능 기반의 재선충 검지 방법."}
{"patent_id": "10-2021-0177093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2023-0088164-3-제3항에 있어서,상기 재선충 검출 서버의 이미지 입수부를 통해 수집된 이미지를 위치 인식 가능한 이미지를 생성하는 단계와,상기 재선충 검출 서버는 위치 인식 가능한 이미지에서, 재선충 영역 분리부가 수림 분리 학습부를 통해 침엽수림지대 영역만을 분리해 내는 단계와,상기 재선충 검출 서버는 재선충 영역 분리부를 통해 분리된 침엽수림지대 영역에서, 재선충 검출부가 재선충학습부를 통해 피해지역을 검출해 내는 단계와,상기 재선충 검출 서버는 재선충 검출부를 통해 검출된 피해영역 중에서, 재선충 정밀 분석부가 정밀 분리 학습부를 통해 확인된 유사도 혹은 피해 정도를 토대로 진짜 피해지역을 검출하는 단계와,상기 재선충 검출 서버는 재선충 정밀 분석부를 통해 검출된 진짜 피해지역 중에서, 원본 이미지 비교부를 통해원본 이미지에서 진짜 피해지역의 위치를 확인하고 그 영역을 추출하는 단계와,상기 재선충 검출 서버는 원본 이미지 비교부를 통해 확인된 지역을 검출결과 저장 표출부를 통해 지정된 형식에 맞춰 저장하고 화면에 디스플레이하는 단계로 이루어지는 인공지능 기반의 재선충 검지 방법."}
{"patent_id": "10-2021-0177093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 재선충 검출 서버는 재선충 검출부를 통해 검출된 피해영역 중에서, 재선충 정밀 분석부가 정밀 분리 학습부를 통해 확인된 유사도 혹은 피해 정도를 토대로 진짜 피해지역을 검출하는 단계는,검출된 피해지역의 피해 정도가 나뭇잎이 없이 몸통만 검붉게 존재하는 말기단계인지 혹은 소나무의 상부가 갈색으로 변화한 중기단계인지 혹은 소나무의 표면만 갈색으로 변한 초기단계인지 확인하는 단계,또는 피해지역이 말기단계의 재선충 피해를 입은 침엽수들을 중심으로 외측에 중기 단계의 재선충 피해를 입은침엽수들이 위치했는지 그리고 중기단계의 피해를 입은 침엽수 외측으로 초기단계의 재선충 피해를 입은 침엽수가 위치했는지 확인하는 단계로 이루어지는 인공지능 기반의 재선충 검지 방법."}
{"patent_id": "10-2021-0177093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 재선충 검출 서버는 재선충 정밀 분석부를 통해 검출된 진짜 피해지역 중에서, 원본 이미지 비교부를 통해원본 이미지에서 진짜 피해지역의 위치를 확인하는 단계는,위치 인식 가능하게 생성된 이미지에서 피해지역을 추출하는 단계와,원본 이미지에서 피해지역에 대응하는 영역을 추출하는 단계와,상기 재선충 정밀 분석부를 통해 재선충 피해 정도가 초기단계 또는 중기단계 또는 말기단계인지 재검증하는 단계로 이루어지는 인공지능 기반의 재선충 검지 방법."}
{"patent_id": "10-2021-0177093", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 재선충 검출 서버는 시계열 중첩 판별부를 통해 반복 촬영된 이미지를 시계열화하는 단계와,상기 재선충 검출 서버는 위치 인식 가능한 이미지에서 피해지역을 제거하고 시맨틱 세그멘테이션을 통해 피해지역을 분리 인식되는지 확인하는 단계와,상기 재선충 검출서버가 피해지역을 인식하게 되면, 시계열화된 이미지 중에서 이전 이미지를 피드백 입력하여학습되게 하고, 상기 재선충 검출서버가 피해지역을 인식하지 못하게 되면, 학습 결과를 제외시키도록 하는 단계를 더 포함하여이루어지는 인공지능 기반의 재선충 검지 방법."}
{"patent_id": "10-2021-0177093", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 재선충의 확산 및 피해를 방지하기 위한 인공지능 기반의 재선충 검지 시스템 및 방법에 관한 것으로, 특히 자동으로 피해지역을 찾아 식별되게 함으로써 용이하게 모니터링되게 하는 한편 정밀도를 높인 인공지능 기 반의 재선충 검지 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0177093", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 재선충의 확산 및 피해를 방지하기 위한 인공지능 기반의 재선충 검지 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0177093", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 재선충(Pine wood nematode, Bursaphelenchus xylophilus)은 소나무, 해송 등에 침입하여 고사시키 는 해충을 말한다. 그리고 이러한 재선충은 자체적으로 다른 나무로 이동할 능력이 없기 때문에 매개충인 솔수염하늘소(Monochamus aternatus)를 통해 전파되고, 특히 매개충의 몸에 기생하는 재선충이 매개충의 후식과 산란과정에 생기는 상처 를 통해 건전한 소나무로 전파하는 것으로 알려져 있다. 그리고 이러한 재선충은 암수 한 쌍이 소나무에 서식할 경우 20일 뒤 20여만 마리로 불어날 정도로 그 번식력이 뛰어난 대다가 소나무 침입시 수분과 양분의 이동을 차단하여 100% 고사시키는 치명적인 병이다. 더욱이 소나무가 고사한다고 하더라도 날씨 및 계절에 따라 소나무 내부에 그대로 재선충 및 알이 존재하는 대 다가 가스 분출로 솔수염하늘소를 유혹해 쉽게 주변으로 퍼지면서 피해지역이 점점 더 늘어나게 된다. 따라서 우리나라에서는 재선충을 산림재해로 보고, 감염 및 피해 확산을 방지하기 위하여 무인 항공기를 통해 주기적으로 항공 촬영하고 산림 상태를 모니터링하고 있는 것이다. 그러나 종래 모니터링 방법은 전문 탐사 장치를 요구하거나 혹은 숙련된 전문가가 촬영된 항공사진을 토대로 육 안으로 영상 판독을 통해 재선충의 피해지역을 확인하는 것이다. 따라서 검사자의 개인차에 의한 오류와 검출면적의 한계로 정확한 피해상황을 확인하고 방역망을 구축하는데 어 려움이 있을 뿐만 아니라, 자동 모니터링되더라도 피해지역의 인식 정도가 떨어지는 것이다. 선행기술문헌 특허문헌"}
{"patent_id": "10-2021-0177093", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명이 해결하고자 하는 과제는 재선충의 확산 및 피해상태를 모니터링할 때에 뛰어난 전문가가 아니 더라도 자동으로 검출영역(피해지역)을 찾아 식별되게 하는 한편, 정밀도를 높인 인공지능 기반의 재선충 검지 시스템 및 방법을 목적으로 하는 것이다."}
{"patent_id": "10-2021-0177093", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이를 위해 본 발명은 촬영기기를 통해 공중에서 산림상태를 촬영하는 공중 촬영기와 상기 공중 촬영기를 통해 촬영된 이미지를 토대로 재선충 피해 지역을 검출하는 재선충 검출 서버로 구성된 것이다. 더불어 본 발명의 재선충 검출 서버는 공중 촬영기를 통해 촬영된 이미지를 일정한 포멧에 맞춰 지정된 곳에 저 장하는 이미지 입수부와, 수집된 이미지를 토대로 재선충 피해지역을 검출을 위한 운영부와, 수집된 이미지를 세그멘테이션을 통해 분리 인식할 수 있게 학습하는 학습부로 구성된 것이다. 더불어 본 발명이 학습부는 이미지 입수부로부터 수집된 이미지를 시맨틱 세그멘테이션을 통해 픽셀단위로 라벨 링하여 침엽수림지대와 활엽수림지대 혼합림지대 기타지역으로 분리 인식할 수 있게 학습하는 수림 분리 학습부 와, 상기 이미지 입수부를 통해 수집된 이미지를 시맨틱 세그멘테이션을 통해 픽셀단위로 라벨링하여 재선충 피 해지역을 분리 인식할 수 있게 학습하는 재선충 학습부와, 상기 재선충 학습부를 통해 검출된 피해지역의 피해 정도를 각각의 단계별로 분리 인식하고 학습하는 정밀 분리 학습부를 포함한다. 더불어 본 발명의 운영부는 이미지 입수부를 통해 촬영된 이미지를 보정하여 동일 축척으로 식별되게 하는 정사 이미지로 만들고, 주기적으로 촬영된 다수의 이미지를 조합하여 픽셀간 기하학적인 역학관계를 연산하여 위치인식 가능한 이미지를 생성하는 이미지 생성부와, 상기 이미지 생성부를 통해 생성된 이미지에서 침엽수림지대 와 활엽수림지대 혼합림지대와 기타지역 중 침엽수림지대 영역만을 분리해 내는 재선충 검출 영역 분리부와, 재 선충 검출 영역 분리부를 통해 분리된 침엽수림지대 영역 중에서 상기 재선충 학습부에 의해 재선충 피해를 입 은 피해지역만을 분리해 내는 재선충 검출부와, 상기 재선충 검출부를 통해 분리된 피해지역을 일정한 비율로 확대한 후 해당 지역을 정밀 분리 학습부를 통해 진짜 피해지역인지 확인하고 그 정도를 분리 식별되게 하는 재 선충 정밀 분석부와, 위치 인식 가능한 이미지 내에서 검출된 피해지역을 원본 이미지에 일치하는 영역을 추출 해 내는 원본 이미지 비교부와, 검출된 피해지역을 지리정보시스템과 호환 가능한 정보 저장 형식으로 저장하고 화면에 피해지역을 표시하는 검출 결과 저장 표출부와, 주기적으로 산림의 상태를 촬영하여 시계열화된 정사영 상에서 피해지역이 제거된 영상과 이에 해당하는 이전 영상을 피드백 입력시켜 재선충병으로의 확신도를 높여서 학습에 반영하여 정밀도를 높여주는 시계열 중첩 판별부로 구성된 것이다."}
{"patent_id": "10-2021-0177093", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "따라서 본 발명은 재선충의 확산 및 피해상태를 모니터링할 때에 전문 인력을 투입할 필요없이 재선충 피해를 입은 피해지역이 자동 식별되어 용이하게 모니터링할 수 있고, 특히 식별된 지역도 유사한 지역(예, 산중에 황토가 노출된 공사지역, 개인묘지 등등)이 아닌 재선충 피해를 입 은 피해지역들을 안내해 주는 향상된 정확도를 가진 것이다."}
{"patent_id": "10-2021-0177093", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 먼저, 본 발명의 명세서 및 청구범위에 사용되는 용어는 사전적인 의미로 한정하여 해석되어서는 아니되 며, 발명자는 자신의 발명을 최선의 방법으로 설명하기 위하여 용어의 개념을 적절히 정의할 수 있다는 원칙에 입각하여, 본 발명의 기술사상에 부합되는 의미와 개념으로 해석되어야 할 것이다. 따라서 명세서상에 기재된 실시 예에 따른 구성 및 도면에 도시된 구성은 본 발명의 바람직한 실시 예에 불과할 뿐, 본 발명의 기술사상을 모두 표현하는 것은 아니기 때문에, 출원 시점에 있어서 이들의 구성을 대체할 수 있 는 균등물과 변형 예들에 의해 다양하게 실시될 수도 있음을 이해하여야 할 것이다. 참고로 명세서에 기재된 \"...부\". \"...모듈\", \"...블록\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어와 소프트웨어의 기능적 구조적 결합으로 구현될 수 있으며, 공지된 구성 또는 설명이 본 발명의 요지를 흐릴 수 있다고 판단될 경우에는 그 상세한 설명을 생략 할 수 있다. 이하, 본 발명의 실시 예를 첨부된 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 시스템 구성을 간략하게 보여주는 것이다. 이를 참고하여 설명하면, 본 발명은 공중 촬영기 와 재선충 검출 서버를 포함하여 이루어진다. 여기서 공중 촬영기는 촬영기기를 구비하고 있는 항공기 혹은 드론 혹은 인공위성으로, 저면으로부터 수직 방향에서 재선충 피해지역을 확인하기 위하여 산림상태를 공중 촬영하는 것이다. 또한, 재선충 검출 서버는 공중 촬영기를 통해 촬영된 이미지를 토대로 재선충 피해지역을 자동 식별할 수 있게 서비스하며, 특히 전송받은 이미지를 정사영상으로 보정하여 위치 확인 가능하게 만든 후, 시멘틱 세그 멘텐이션을 통해 픽셀단위로 라벨링(레이블링)하여 학습된 정보를 토대로 산림지역과 피해지역을 구분하여 식별 할 수 있게 하는 것이다. 이때 재선충 검출 서버는 피해 정도를 확인하고 단순 의심지역과 진짜 피해지역을구분하여 확인할 수 있는 주제도를 서비스한다. 도 2는 피해지역을 자동 식별하기 위한 재선충 검출 서버의 구성을 구체화한 블럭도이다. 더불어 도 3은 촬영된 이미지를 토대로 재선충 피해를 입은 피해지역을 분리 식별되는 모습을 보여주는 것이다. 더불어 도 4 내지 도 4c는 각각 침엽수림지대와 피해지역과 피해 정도 등을 분리 식별되는 모습과, 시계열화된 모습을 보여주는 것이다. 이를 참고하여 설명하면, 본 발명의 재선충 검출 서버는 이미지를 수집하는 이미지 입수부와, 상기 이 미지 입수부를 통해 수집된 이미지를 토대로 수림의 종류, 재선충 피해지역, 피해 정도 등을 학습하는 학습부 와, 상기 이미지 입수부를 통해 수집된 이미지상에서 피해지역 등을 확인하기 위한 운영부로 구성된다. 여기서 이미지 입수부는 통신모듈을 통해 지정된 각각의 공중 촬영기로부터 촬영된 이미지를 전송받아 일정한 포멧에 맞춰 지정된 곳에 저장하고, 상기 이미지를 로드하여 가공 가능하게 한 것이다. 이때 이미지 입 수부는 수집된 이미지를 학습부로 제공하여 학습시키기 위한 것이기도 하지만 수집된 이미지를 운영부로 제 공하여 피해지역을 검출하기 위한 것이기도 하다. 더불어 학습부는 수림 분리 학습부(21a)와 재선충 학습부(21b)와 정밀 분리 학습부(21c)로 구성되고, 운영 부는 이미지 생성부(22a)와 재선충 검출 영역 분리부(22b)와, 재선충 검출부(22c)와, 재선충 정밀 분석부 (22d)와 원본 이미지 비교부(22e)와 검출 결과 저장 표출부(22f)로 구성되고, 실시 예에 따라 시계열 중첩 판별 부를 더 포함한다. 학습부의 수림 분리 학습부(21a)는 이미지 입수부로부터 수집된 이미지를 시맨틱 세그멘테이션 (Semantic Segmentation)을 통해 픽셀단위로 레이블링(이라 라벨링이라고도 함)하여 자동 혹은 반자동으로 침엽 수림지대와, 활엽수림지대, 혼합림지대, 기타(예, 도로, 길 등등) 등을 분리 인식할 수 있게 학습하는 것이다. 이때 수림 분리 학습부(21a)는 잎이 뾰족한 침엽수와 잎이 둥그스레한 활엽수의 외형상의 특징 및 색상정보 등 을 토대로 분리 인식할 수 있게 학습하는 인공지능 모델을 기반으로 하며, 대표적으로 FCN(Fully Convolutional Networt), SegNet아키텍처, DeepLap, UNET, RdfiNet, PSPnet, 등이 있다. 또한, 재선충 학습부(21b)는 이미지 입수부로부터 수집된 이미지를 시맨틱 세그멘테이션(Semantic Segmentation)을 통해 픽셀단위로 라벨링(레이블링)하여 자동 혹은 반자동으로 피해지역을 분리 인식할 수 있게 학습하는 것이다. 이때 재선충 학습부(21b)는 침엽수가 재선충 피해를 입을 경우 잎이 아래로 처지면서 갈색 혹 은 붉은색으로 변화하는 특징을 토대로 분리 인식할 수 있게 학습하는 인공지능 모델을 기반으로 하며, 대표적 으로 FCN(Fully Convolutional Networt), SegNet아키텍처, DeepLap, UNET, RdfiNet, PSPnet, 등이 있다. 또한, 정밀 분리 학습부(21c)는 피해지역을 확대하여 재선충 피해 정도를 각각의 단계별로 분리 인식하고 학습 할 수 있는 것이다. 즉, 피해 정도가 완전히 고사하여 나뭇잎이 없이 몸통만 검붉게 존재하는 말기단계인지 혹은 소나무의 상부가 갈색으로 변화한 중기단계인지 혹은 소나무의 표면만 갈색으로 변한 초기단계인지 분리 인식할 수 있게 학습하 여, 운영부의 요청이 있을 때에 검출된 피해지역이 단순 의심지역인지 아니면 진짜 피해지역인지 확인(검출)할 수 있게 하기 위한 것이다. 이때 피해 정도는 실시 예에 따라 사전 학습된 CNN,RNN, FNN 등의 학습모델을 통해 측정된 유사도(이하, 확신 도라고 함)를 기반으로 할 수도 있는 것이다. 더불어 운영부의 이미지 생성부(22a)는 촬영된 이미지를 보정하여 동일 축척으로 적용 가능한 정사 이미지 로 만들고 위치 확인 가능하게 만들어 주는 것이다. 이때 이미지 생성부(22a)는 공중 촬영기를 통해 확보된 GPS 좌표, 고도, 방위각, 초점 정보 등을 토대로 할 수도 있지만, 바람직하게는 반복하여 촬영된 다수 간의 이미지 를 조합하여 픽셀간 기하학적인 역학관계(예, 삼각측량방법으로 기준이되는 위치를 중심으로 방향, 각도, 거리 등등)를 활용하여 위치 인식 가능한 이미지를 생성한다. 또한, 운영부의 재선충 검출 영역 분리부(22b)는 상기 이미지 생성부(22a)를 통해 생성된 이미지에서, 도 4 에 도시된 바와 같이 수림 분리 학습부(21a)를 통해 침엽수림지대와 활엽수림지대 혼합림지대와 기타지역(예, 도로, 길 등등)으로 분리한 후 침엽수림지대에서만 피해지역을 찾기 위한 것이다. 또한, 운영부의 재선충 검출부(22c)는 상기 재선충 검출 영역 분리부(22b)를 통해 확인된 침엽수림지대 영 역 중에서, 도 4a에 도시된 바와 같이 상기 재선충 학습부(21b)을 통해 재선충 피해를 입은 피해지역을 검출하 기 위한 것이다. 이때 검출된 피해지역은 공사로 지표면이 노출되면서 피해지역처럼 보이는 의심지역도 포함한다. 또한, 운영부의 재선충 정밀 분석부(22d)는 상기 재선충 검출부(22c)를 통해 검출된 피해지역들을 일정한 비율로 확대한 후, 검출된 피해지역을 정밀 분리 학습부(21c)를 통해 각각의 피해지역이 의심지역인지 아니면 진짜 재선충 피해를 입은 피해지역인지 확인한다. 이때의 재선충 정밀 분석부(22d)는 해당 지역의 피해정도 혹 은 유사도(확신도)를 통해 정밀 분석하는 것이다. 즉, 피해지역이 초기단계 혹은 중기단계 혹은 말기단계인지 확인하거나, 도 4c에 도시된 바와 같이 피해지역이 자연스럽게 소나무가 완전히 고사한 말기단계의 지역을 중심으로 테두리에 상부가 갈색으로 변한 중기 단계의 재선충 피해를 입은 소나무가 위치하고, 그 외측으로 초기단계의 재선충 피해를 입은 소나무가 위치하게 되는 특징으로 통해 그 유사도(확신도)를 측정하는 것이다. 또한, 운영부의 원본 이미지 비교부(22e)는 위치 인식 가능한 이미지 내에서 피해지역의 위치정보를, 원본 이미지의 GPS 좌표, 고도, 방위각, 초점정보를 활용하여 대응하는 영역을 검출하고, 실시 예에 따라서는 해당 영역을 정밀 분리 학습부(21b) 또는 재선충 학습부(21c)를 통해 피해지역인지 재검즘을 한다. 또한, 운영부의 검출 결과 저장 표출부(22f)는 상기 원본 이미지 비교부(22e)를 통해 확인된 실제 피해지역 을 지리정보시스템과 호환 가능한 정보저장 형식으로 저장하고 화면에 표시한다. 또한, 시계열 중첩 판별부는, 도 4c에 도시된 바와 같이 반복적으로 산림의 상태를 촬영한 이미지를 시계열 화하고, 정사 이미지에서 피해지역이 제거되었을 때, 이에 해당되는 이전 영상의 부분을 피해지역으로 피드백 입력하여 학습되게 함으로써 정밀도(정확도)를 높여주는 것이다. 더불어 도 5는 재선충 검출 서버와 이미지를 제공하는 사용자단말이 물리적으로 분리되어 있는 경우에 원격 파 일공유 방법을 통해 파일을 이미지 파일을 공유하는 과정을 보여주는 것이다. 이때 사용자단말은 공중 촬영기를 통해 촬영된 이미지를 확보하는 장치이며, 대표적으로 네트워크 연결 가능한 PC나 노트북 혹은 서버, 스마트폰, 타블릿 PC 중 어느 하나이며, 확보된 정시영상을 공유폴더에 올려 놓 으면, 상기 재선충 검출서버가 공유폴더에 저장된 정시영상을 자동 인식하고, 상기 재선충 검출 서버는 로드된 정시셩상을 토대로 재선충 피해를 입은 피해지역을 확인할 수 있는 주제도를 생성하게 되고, 상기 재선충 검출 서버는 주제도를 공유폴더에 올려놓는 것이다. 그리고 사용자 단말은 지정된 공유폴더에 올려져 있는 주제도를 로드하여 피해ㅑ지역을 확인할 수 있게 구성할 수도 있는 것이다. 도 6과 도 7은 학습과정 또는 검출과정을 보여주는 것이다. 이를 참조하여 설명하면, 본 발명의 재선충 검출 서 버는 이미지 입수부를 통해 산림상태를 확인할 수 있는 이미지를 확보하게 되면, 지정된 장소에 촬영된 이미지 를 저장하고 가공 가능하게 한다. 이때 재선충 검출 서버의 수림 분리 학습부는 이미지 입수부를 통해 수집된 다량의 이미지를 시멘틱 세그멘테이 션을 통해 픽셀단위로 라벨링하여 침엽수림지대와 활엽수림지대 혼합림지대 기타지역으로 분리 인식 가능하게 학습한다. 더불어 상기 재선충 검출 서버의 재선충 학습부는 이미지 입수부를 통해 수집된 이미지를 시멘틱 세그멘테이션 을 통해 픽셀단위로 라벨링하여 분리된 피해 지역을 학습한다. 더불어 상기 재선충 검출 서버의 정밀 분리 학습부는 피해 지역의 피해 정도 혹은 유사도를 구분 인식(측정)할 수 있게 학습한다. 그리고 공중 촬영기가 산림상태를 반복 촬영하여 이미지를 확보하게 되면, 이를 지정된 재선충 검출 서버로 전 송하여 수집되게 하고, 상기 재선충 검출 서버는 이미지 입수부를 통해 전송된 이미지를 지정된 장소에 저장하여 가공 가능하게 한다. 이때 재선충 검출 서버는 이미지 입수부를 통해 수집된 이미지를 위치 인식 가능한 이미지를 생성하고, 재선충 영역 분리부가 수림 분리 학습부를 통해 침엽수림지대 영역만을 분리해 내고, 특히, 상기 침엽수림지대의 영역에서 피해지역을 검출해 내는 것이다. 그리고 이때 재선충 정밀 분석부는 정밀 분리 학습부를 통해 확인된 유사도 혹은 피해 정도를 토대로 다수의 의 심지역과 피해지역 중에서 진짜 피해지역만을 검출하는 것이다. 이때 재선충 정밀 분석부는 검출된 피해지역의 피해 정도가 나뭇잎이 없이 몸통만 검붉게 존재하는 말기단계인 지 혹은 소나무의 상부가 갈색으로 변화한 중기단계인지 혹은 소나무의 표면만 갈색으로 변한 초기단계인지 확 인함으로써, 진짜 피해지역인지 확인하고, 실시 예에 따라서는 상기 재선충 정밀 분석부가 말기단계의 재선충 피해를 입은 침엽수들을 중심으로 외측에 중 기 단계의 재선충 피해를 입은 침엽수들이 위치했는지 그리고 중기단계의 피해를 입은 침엽수 외측으로 초기단 계의 재선충 피해를 입은 침엽수가 위치했는지 확인하는 유사도 측정을 통해, 진짜 피해지역인지 아니면 의심지 역인지 정밀 확인하는 과정을 거치게 되는 것이다. 더불어 재선충 검출 서버는 재선충 정밀 분석부를 통해 검출된 진짜 피해지역 중에서, 원본 이미지 비교부를 통 해 원본 이미지에서 진짜 피해지역의 위치 및 영역을 확인한다. 즉, 위치 인식 가능하게 생성된 이미지에서 피해지역을 추출하고, 이에 대응하는 원본 이미지에서 피해지역에 대응하는 영역을 추출하여 디스플레이되게 하는 것이다. 이때 원본 이미지 비교부는 추출된 원본 이미지의 영역이 진짜 재선충 피해를 입은 영역인지 재선충 정밀 분석 부를 통해 피해정도 혹은 유사도 측정을 통해 확인하고 개검증하는 과정을 거치게 된다. 그리고 원본 이미지 비교부를 통해 확인된 지역은 검출결과 저장 표출부를 통해 지정된 형식에 맞춰 저장하고 화면상에 디스플레이하는 것이다. 이때 재선충 검출 서버는 시계열 중첩 판별부를 통해 반복 촬영된 이미지를 시계열화하고, 위치 인식 가능한 이 미지에서 피해지역을 제거하고 시맨틱 세그멘테이션을 통해 피해지역을 분리 인식되는지 확인하는 과정을 거칠 수 있다. 이때 재선충 검출서버가 피해지역을 인식하게 되면, 시계열화된 이미지 중에서 이전 이미지를 피드백 입력하여 학습되게 하고, 만일 재선충 검출서버가 피해지역을 인식하지 못하면, 해당 이미지의 학습 결과를 제외시키는 과정을 거침으로써, 재선충 검출부 또는 재선충 학습부의 인식률/정밀도를 높이도록 하는 것이다. 지금까지 본 발명은 첨부된 도면을 참고하여 설명하였으나, 이는 예시적인 것에 불과하며, 당해 기술이 속하는 분야에서 통상의 지식을 가진 자라면 이로부터 다양하게 변형 및 균등이론에 의해 용이하게 실시할 수 있을 것 이다. 따라서 본 발명의 진정한 기술적 보호범위는 특허청구범위에 의해서 정해져야 할 것이다."}
{"patent_id": "10-2021-0177093", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 시스템 구성을 보여주는 일실시 예. 도 2는 재선충 검출 서버의 구성을 보여주는 일실시 예. 도 3은 이미지 획득시 피해지역과 그렇지 않은 지역이 자동식별되어 보여지는 모습을 보여주는 일실시 예. 도 4 내지 도 4c는 검출된 지역을 보여주는 일실시 예 도 5는 사용자단말을 포함하는 시스템 구성을 보여주는 일실시 예. 도 6과 도 7은 피해지역을 검출하는 과정을 보여주는 일실시 예."}
