{"patent_id": "10-2023-0079041", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0177545", "출원번호": "10-2023-0079041", "발명의 명칭": "인공지능 기반 모빌리티 튜닝 추천 장치 및 방법", "출원인": "주식회사 헤이트먼데이", "발명자": "최원석"}}
{"patent_id": "10-2023-0079041", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고객 회원의 보유 모빌리티 정보 및 튜닝 이력을 포함하는 고객 모빌리티 정보를 회원별 모빌리티 DB에 저장하는 고객회원정보 저장부;고객 회원이 원하는 모빌리티 튜닝에 관한 이미지, 텍스트 및 음성 중 적어도 하나를 튜닝 요청 정보로서 입력받는 튜닝 요청 입력부;파츠 DB에 저장된 각 파츠를 이용한 튜닝 정보에 기초하여 모빌리티 종, 파츠의 순정 여부, 호환 여부, 가격,품질, 기능, 튜닝 업체 및 고객 회원 후기 중 적어도 하나를 수집하는 튜닝 데이터 수집부;학습된 인공지능 모델을 통해 상기 고객 모빌리티 정보에 기초하여 상기 튜닝 요청 정보에 매칭하는 파츠를 모빌리티의 부위 별로 적어도 하나씩 결정하고, 상기 결정된 파츠 중에서 상기 부위 별로 하나씩 파츠를 선택 및조합해서 하나 이상의 추천 튜닝안을 생성하는 튜닝안 산출부;상기 추천 튜닝안, 및 해당 추천 튜닝안의 작업이 가능한 튜닝 업체 정보를 고객 회원 단말로 제공하는 튜닝안추천부; 및 상기 고객 회원의 선택에 따른 튜닝 업체 결정 후 계약을 진행하기 위한 튜닝 업체 결정부를 포함하는,인공지능 기반 모빌리티 튜닝 추천 장치."}
{"patent_id": "10-2023-0079041", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 튜닝 요청 입력부는,복수의 고객 선호 모빌리티 이미지를 상기 고객 회원의 선호 모빌리티 외관 정보로서 입력받고, 상기 고객 선호모빌리티 이미지들의 유사 외관을 추출하는데 있어 각 고객 선호 모빌리티 이미지가 반영될 가중치를 설정받으며,상기 튜닝안 산출부는,세맨틱 세그멘테이션(Semantic Image Segmentation) 방식으로 학습된 제1 인공지능 모델을 이용해 상기 고객 선호 모빌리티 이미지 각각으로부터 항목별 파츠를 분류 및 검출하고, 상기 분류 및 검출된 항목별 파츠에 대해CNN 기반으로 학습된 제2 인공지능 모델을 통해 상기 고객 선호 모빌리티 이미지 간의 외관의 유사도가 기 설정된 기준 이상인 부분 영역을 추출하며, 추천 모델을 통해 상기 추출된 부분 영역이 해당하는 파츠 항목과 파츠DB의 파츠들 간의 외관의 유사도 점수를 산출하고, 상기 유사도 점수에 상기 가중치를 반영하여 점수가 높은 순으로 파츠들을 상기 파츠 DB로부터 추출하여, 상기 추출된 파츠를 상기 고객 회원의 보유 모빌리티에 조합하여적어도 하나의 상기 추천 튜닝안을 생성하는,인공지능 기반 모빌리티 튜닝 추천 장치."}
{"patent_id": "10-2023-0079041", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 튜닝안 산출부는,상기 튜닝안을 생성하는데 있어서, 기본적으로 튜닝 대상 모빌리티 모종의 기본 골조를 기준으로 상기 순정 파츠를 먼저 고려하되, 순정 파츠가 부재한 경우 상기 호환 파츠를 차선으로 고려하여 튜닝 조합을 생성하는,인공지능 기반 모빌리티 튜닝 추천 장치."}
{"patent_id": "10-2023-0079041", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2024-0177545-3-제 3 항에 있어서,상기 튜닝안 산출부는,상기 추천 튜닝안으로서 결정된 파츠의 부품 도면에 기초하여 모빌리티 튜닝을 시뮬레이션하여 3D 모델링 데이터를 생성하는,인공지능 기반 모빌리티 튜닝 추천 장치."}
{"patent_id": "10-2023-0079041", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 튜닝안 산출부는,상기 튜닝 요청 정보 및 튜닝 시뮬레이션 결과 중 적어도 하나가 튜닝 관련 규정에 부합하는지 여부를판단하되,상기 튜닝 요청 정보 또는 상기 튜닝 시뮬레이션 결과가 상기 튜닝 관련 규정에 부적합한 것으로 판단된 경우,상기 튜닝 요청 정보의 스펙과 최대한 가까우면서 상기 튜닝 관련 규정 범위 내에 해당하는 파츠로 재선별하고,재선별된 상기 파츠로 튜닝 조합을 생성하는,인공지능 기반 모빌리티 튜닝 추천 장치"}
{"patent_id": "10-2023-0079041", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 모빌리티 튜닝 추천 장치 및 방법에 관한 것으로, 더욱 상세하게는 고객 회원의 취향에 따라 파츠를 선별하여 추천 튜닝안을 제공하고, 그의 작업이 가능한 튜닝 업체 정보를 제공하는 인공지능 기반 모빌리티 튜닝 추천 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0079041", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 모빌리티 튜닝 추천 장치 및 방법에 관한 것으로, 더욱 상세하게는 고객 회원의 취향 에 따라 파츠를 선별하여 추천 튜닝안을 제공하고, 그의 작업이 가능한 튜닝 업체 정보를 제공하는 인공지능 기 반 모빌리티 튜닝 추천 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0079041", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 차량이 가진 성능을 끌어올리거나, 외관상 변화를 주기 위해 차에 가하는 모든 작업을 튜닝이라 한다. 엔진, 배기구와 기타 외부 장착품, 도색 및 랩핑은 물론이고 인테리어나 사제 내비게이션 매립, 블랙박스 장착, 썬팅과 같은 작업들 또한 차량 튜닝의 범주 내에 들어간다. 모빌리티의 경우 특히 차량과 달리, 튜닝의 제한이 없는 영역으로 실제로 모빌리티를 순정으로 타고 다니는 라 이더는 전체의 10% 미만일 정도이고, 그만큼 다양한 튜닝 제품이 존재하고, 모빌리티의 부위에 따라 다양한 외 관 및 기능을 가진 파츠들이 존재한다. 그러나, 아이러니하게도 '튜닝의 끝은 순정'이라는 말이 생길 정도로 튜닝을 하는 오너들이 튜닝 작업을 한 결 과가 순정보다 별 나을 것 없다는 반응도 많은 상황이다. 따라서, 이러한 문제 현상을 방지하고 모빌리티에 적합한 튜닝을 시행하기 위해서는 먼저 그 목적을 분명히 해 야하고, 그에 따른 기술적인 분석과 예측 시뮬레이션이 수반되어야 할 것이다. 한편, 한국에서는 차량 구조변경을 위해서 관련 법령에 따라 한국교통안전공단의 승인을 얻어야 하도록 안전기 준절차를 따라야하기 때문에 튜닝 시 준법 범위도 고려해야 한다. 실제 예로, 이륜자동차에 대해서 자기인증 여부 관계없이 전 차종 캐노피 튜닝이 허용되되, 높이는 안전기준범 위 2m 이내, 제원 허용차 이내로, 단 전면 창유리는 설치가 제한된다. 이륜자동차 조향장치에 대해서는 동일한 제작사에서 자기인증된 이륜자동차의 조향핸들과 조향장치 구성부품이 변경되는 경우의 튜닝이 허용되고, 조향장치 구성부품(업켓, 라이저, 어져스터 등)의 추가 설치가 허용된다. 또한, '자동차관리법'에 따라 안전기준에서 규정하는 수입 자동차 등화부품의 튜닝이 허용되고, 이륜자동차 선 택사양(옵션)으로 제원이 통보된 조향장치로 변경하거나, 운전자의 체형에 맞게 조향핸들의 설치 각도 변경은 경미한 튜닝에 포함된다. 따라서, 모빌리티 튜닝을 작업하기 전에 사전 조사와 시뮬레이션 및 계획이 수반되어야 하고, 이를 위한 서비스 를 사용자가 편리하게 이용할 수 있는 플랫폼 시스템이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-2481571호"}
{"patent_id": "10-2023-0079041", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상술한 바와 같은 문제점을 해결하기 위하여 제안된 것으로, 고객 회원의 튜닝 요청 정보에 따라 튜닝 데이터를 인공지능 기반으로 분석하여 추천 튜닝안을 생성하여 고객 회원에게 추천하고, 선택된 추천 튜닝안을 작업 가능한 튜닝 업체 정보를 제공하는 플랫폼 시스템을 통해 고객 회원과 튜닝 업체가 시간과 비용 면에서 효율적으로 계약을 체결하도록 도움을 줄 수 있는 인공지능 기반 모빌리티 튜닝 추천 장치 및 방법을 제 공하는데 그 목적이 있다. 본 발명의 목적은 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로부 터 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0079041", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 실시예에 따른 인공지능 기반 모빌리티 튜닝 추천 장치는, 고객 회원의 보유 모빌리티 정보 및 튜닝 이력을 포함하는 고객 모빌리티 정보를 회원별 모빌리티 DB에 저장하는 고 객회원정보 저장부; 고객 회원이 원하는 모빌리티 튜닝에 관한 이미지, 텍스트 및 음성 중 적어도 하나를 튜닝 요청 정보로서 입력받는 튜닝 요청 입력부; 파츠 DB에 저장된 각 파츠를 이용한 튜닝 정보에 기초하여 모빌리티 종, 파츠의 순정 여부, 호환 여부, 가격, 품질, 기능, 튜닝 업체 및 고객 회원 후기 중 적어도 하나를 포함하는 튜닝 특징을 제공하는 튜닝 데이터 수집부; 튜닝 데이터를 수집하여 빅데이터로 저장하고, 인공지능을 통해 분 석하여 상기 고객 모빌리티 정보를 기반으로 상기 튜닝 요청 정보에 매칭하는 파츠를 결정하여 적어도 하나 이 상의 추천 튜닝안을 생성하는 튜닝안 산출부; 상기 추천 튜닝안, 및 해당 추천 튜닝안의 작업이 가능한 튜닝 업 체 정보를 고객 회원 단말로 제공하는 튜닝안 추천부; 및 상기 고객 회원의 선택에 따른 튜닝 업체 결정 후 계 약을 진행하기 위한 튜닝 업체 결정부를 포함할 수 있다. 본 발명의 실시 예에 따른 인공지능 기반 모빌리티 튜닝 추천 방법은, 고객 회원의 보유 모빌리티 정보 및 튜닝 이력을 포함하는 고객 모빌리티 정보를 회원별 모빌리티 DB에 저장하는 단계; 고객 회원이 원하는 모빌리티 튜 닝에 관한 이미지, 텍스트 및 음성 중 적어도 하나를 튜닝 요청 정보로서 입력받는 단계; 학습된 인공지능 모델 을 통해 상기 고객 모빌리티 정보에 기초하여 상기 튜닝 요청 정보에 매칭하는 파츠를 결정하고, 상기 결정된 파츠에 기초하여 적어도 하나 이상의 추천 튜닝안을 생성하는 단계; 상기 추천 튜닝안 각각의 작업이 가능한 튜 닝 업체 정보를 고객 회원 단말로 제공하는 단계; 및 상기 고객 회원의 선택에 따른 튜닝 업체 결정 후 계약을 진행하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0079041", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 인공지능 기반 모빌리티 튜닝 추천 장치 및 방법은 사용자 입장에서 간편하게 모빌리티 정보를 입력하고, 원하는 모빌리티 튜닝에 관한 이미지나 텍스트 또는 음성을 입력하는 것만으로도 사용자의 취향과, 순정 부품, 호환 부품 및 관련 규정 등의 조건이 고려된 추천 튜닝안을 제공받을 수 있고, 선택한 추천 튜닝안 의 작업이 가능한 튜닝 업체에 관한 정보를 제공받아 계약까지 실행함으로써, 플랫폼 시스템의 활용도를 높일 수 있다. 본 발명에 따른 인공지능 기반 모빌리티 튜닝 추천 장치 및 방법에 의하면, 사용자의 튜닝 요청 정보를 분석하 여 취향에 따라 적당한 파츠들을 선별하여 추천 튜닝안을 제공함으로써 사용자 만족도를 높일 수 있다."}
{"patent_id": "10-2023-0079041", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로부 터 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0079041", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적 및 효과, 그리고 그것들을 달성하기 위한 기술적 구성들은 첨부되는 도면과 함께 상세하게 후술 될 실시 예들을 참조하면 명확해질 것이다. 본 발명을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리 고 뒤에 설명되는 용어들은 본 발명에서의 구조, 역할 및 기능 등을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2023-0079041", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다. 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가 진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 오로지 특허청구범위에 기재된 청구항의 범주에 의하여 정의될 뿐이다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하에서는 첨부한 도면을 참조하며, 본 발명의 바람직한 실시예들을 보다 상세하게 설명하기로 한다. 한편, 본 발명의 실시 예에 있어서, 첨부된 블록도의 각 블록과 흐름도의 각 단계의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수도 있다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터, 휴 대용 노트북 컴퓨터, 네트워크 컴퓨터 등 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 장치 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스 트럭션들이 아래에서 설명할 블록도의 각 블록 또는 흐름도의 각 단계에서 설명된 기능들을 수행하는 수단을 생 성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 장치 또는 기 타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 장치에 이용 가능한 메모리 또는 컴퓨터 판 독 가능 메모리에 저장되는 것도 가능하므로, 블록도의 각 블록 또는 흐름도 각 단계에서 설명된 기능을 수행하 는 인스트럭션 수단을 내포하는 제조물을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 장 치 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되는 것도 가능하므로, 컴퓨터 장치 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되기 위한 프로세스를 생성하여 블록 도의 각 블록 및 흐름도의 각 단계에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록 또는 각 단계는 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들 을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실시예들에서는 블록들 또 는 단계들에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시 되어 있는 두 개의 블록들 또는 단계들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들 또는 단계들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이하에서는 본 발명에 따른 모빌리티 튜닝 추천 플랫폼 시스템에 대하여 첨부된 도면을 참고하여 보다 구체적으 로 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반 모빌리티 튜닝 추천 플랫폼 시스템을 도시하는 개념도이고, 도 2는 본 발명의 일 실시예에 따른 인공지능 기반 모빌리티 튜닝 추천 서버(장치)의 구성을 도시하는 블록도이 다. 모빌리티는 이륜차, 승용차, 승합차, 특수차, 농기계, 도심 항공 모빌리티 및 드론을 포함하는 개념으로, 이동 을 지원하는 모든 기기를 의미한다. 본 발명의 일 실시예에 따른 인공지능 기반 모빌리티 튜닝 추천 플랫폼 시스템은 다수의 고객 회원 단말 (100: 101~100N), 모빌리티 튜닝 추천 서버, 및 다수의 튜닝업체 단말(500:501~500M)을 포함할 수 있다. 일 실시예로, 모빌리티 튜닝 추천 서버는 기계 학습 알고리즘의 수행을 위한 다수의 인공지능 모델을 포함 할 수 있다. 다수의 고객 회원 단말, 모빌리티 튜닝 추천 서버 및 다수의 튜닝업체 단말은 네트 워크를 통하여 서로 통신 가능하도록 연결될 수 있다. 고객 회원 단말(100: 101~100N)은 모빌리티 튜닝 추천 정보 제공 서비스에 회원 가입한 고객 회원에 의해 사용 되는 통신 가능한 컴퓨팅 디바이스로서, 스마트폰 등의 모바일 단말일 수 있다. 고객 회원 단말에는 모바일 애플리케이션인 모빌리티 튜닝 추천 전용 앱이 설치되어 실행될 수 있다. 모빌 리티 튜닝 추천 전용 앱은 모빌리티 튜닝 추천 서버와 데이터 통신하여 고객 회원에게 모빌리티 튜닝 추천 정보를 제공한다. 여기서, 고객 회원 단말이 반드시 모바일 애플리케이션에 기반하여 고객 회원에게 모빌 리티 튜닝 추천 정보를 제공하는 것은 아니고, 웹 등을 통해서도 모빌리티 튜닝 추천 정보를 제공할 수도 있다. 여기서, 모빌리티 튜닝 추천 정보라 함은 고객 회원이 입력한 튜닝 요청 정보에 대응하여 서버가 고객 회 원의 보유 모빌리티 정보(또는 튜닝하고자 하는 모빌리티 정보), 튜닝 이력, 튜닝 특징, 파츠 정보 및 관련 법 규를 포함하는 튜닝 데이터를 인공지능 기반으로 분석하여 생성된 적어도 하나 이상의 추천 튜닝안, 고객 회원 에게 선택된 추천 튜닝안의 작업이 가능한 튜닝 업체, 튜닝 업체와 계약 및 거래할 수 있는 정보 등을 의미한다. 여기서, 튜닝 특징은 각 파츠를 이용한 튜닝 이력, 파츠 생산 업체 등을 통해 수집된 모빌리티종, 순정 부품 여 부, 호환 부품 여부, 가격, 품질, 기능 및 튜닝 가능 업체, 튜닝 후기 중 적어도 하나를 포함할 수 있고, 튜닝 특징은 파츠 DB에 저장될 수 있다. 모빌리티 튜닝 추천 서버는 튜닝 업체 대신 플랫폼을 구축, 운영하고 마케팅을 지원하는 대가로 튜닝 업체는 모빌리티 튜닝 추천 서버 에 수수료, 일 예로 광고 수수료를 지불할 수 있다. 모빌리티 튜닝 추천 서버는 고객 회원 단말에 모빌리티 추천 튜닝 정보를 제공할 수 있다. 회원 고객 단말은 원하는 모빌리티 튜닝에 관한 이미지나 텍스트 또는 음성을 입력하고, 적어도 하나 이상 의 추천 튜닝안을 제공받아 그 중 하나의 튜닝안을 선택하고, 선택한 튜닝 업체와 거래 및 계약을 성사하고, 튜 닝 결과 후기를 플랫폼을 통해 타 고객 회원들과 공유할 수 있다. 튜닝 업체 단말은 튜닝 업체의 통신 가능한 디바이스로서, PC나 서버 등의 전자장치 일 수 있다. 튜닝 업체 단말에도 모바일 애플리케이션 모빌리티 튜닝 추천 전용 앱이 설치되어 실행될 수 있다. 튜닝 업체 단말은 모빌리티 튜닝 추천 전용 앱을 통해 튜닝 업체 정보나 튜닝 결과 정보를 업로드할 수 있다. 모빌리티 튜닝 추천 서버는 모빌리티 튜닝 정보를 제공하기 위한 온라인 플랫폼을 서비스하기 위한 것으로, 하나 이상의 서버를 포함하여 구성되는 서버 시스템일 수 있으며, 윈도우 계열 운영체제나 MacOS, 자바, 유닉스(UNIX) 또는 리눅스(LINUX)를 포함하거나 이에 포함되지 않은 다양한 운영체제 하에서 운영될 수 있다. 그리고 이 같은 모빌리티 튜닝 추천 서버는 모빌리티 튜닝 추천 전용 앱과의 연동을 통해 회원들에 게 튜닝 추천 정보 및 튜닝 업체 정보를 제공할 수 있다. 도 2를 참조하면, 모빌리티 튜닝 추천 서버는 학습 데이터를 이용하여 기계 학습을 수행할 수 있는 장치로 서, 인공 신경망으로 구성된 모델을 이용하여 학습하는 장치를 포함할 수 있다. 즉, 모빌리티 튜닝 추천 서버 는 데이터 마이닝, 데이터 분석, 지능형 의사 결정 및 기계 학습 알고리즘을 위해 이용될 정보를 수신, 분 류, 저장 및 출력하도록 구성될 수 있다. 여기서, 기계 학습 알고리즘은 딥 러닝 알고리즘을 포함할 수 있다. 모빌리티 튜닝 추천 서버는 인공 신경망을 학습하기 위한 다양한 장치로서, 통상적으로 서버를 의미할 수 있고, 신경망 학습 장치 또는 신경망 학습 서버 등으로 지칭할 수 있다. 특히, 모빌리티 튜닝 추천 서버는 단일한 서버뿐만 아니라 복수의 서버 세트, 클라우드 서버 또는 이들의 조합으로 구현될 수 있다. 즉, 모빌리티튜닝 추천 서버는 복수로 구성되어 신경망 학습 장치 세트(혹은 클라우드 서버)를 구성할 수 있고, 신경망 학습 장치 세트에 포함된 적어도 하나 이상의 모빌리티 튜닝 추천 서버는 분산 처리를 통하여 데이터 분석 또는 학습하여 결과를 도출할 수 있다. 모빌리티 튜닝 추천 서버는 통신부, 입력부, 메모리, 러닝 프로세서, 전원 공급부 및 프로세서 등을 포함할 수 있다. 통신부는 무선 통신부(미도시) 및 인터페이스부(미도시)를 포함하는 구성을 의미할 수 있다. 즉, 통신부 는 유무선 통신이나 인터페이스를 통하여 다른 장치와 데이터를 송수신할 수 있다. 입력부는 모델 학습을 위한 훈련 데이터 또는 학습된 모델을 이용하여 출력을 획득하기 위한 입력 데이터 등을 획득할 수 있다. 입력부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 러닝 프로세서 또는 프로세서 는 획득한 데이터를 전처리하여 모델 학습에 입력이 가능한 훈련 데이터 또는 전처리된 입력 데이터를 생 성할 수 있다. 메모리는 러닝 프로세서 또는 모빌리티 튜닝 추천 서버에서 학습된 모델을 저장할 수 있다. 이 때, 메모리는 필요에 따라 학습된 모델을 학습 시점 또는 학습 진척도 등에 따라 복수의 버전으로 구분하 여 저장할 수 있다. 메모리는 모델 저장부 및 데이터베이스 등을 포함할 수 있다. 모델 저장부는 러닝 프로세스을 통하여 학습 중인 또는 학습된 신경망 모델(또는 인공 신경망, 331 a)을 저장하며, 학습을 통하여 모델이 업데이트되면 업데이트된 모델을 저장한다. 이때, 모델 저장부는 필 요에 따라 학습된 모델을 학습 시점 또는 학습 진척도 등에 따라 복수의 버전으로 구분하여 저장할 수 있다. 도 2에 도시된 인공 신경망(331a)은 복수의 은닉층을 포함하는 인공 신경망의 하나의 예시일 뿐이며, 본 발명의 인공 신경망이 이에 한정되는 것은 아니다. 인공 신경망(331a)은 하드웨어, 소프트웨어 또는 하드웨어와 소프트 웨어의 조합으로 구현될 수 있다. 인공 신경망(331a)의 일부 또는 전부가 소프트웨어로 구현되는 경우, 인공 신 경망(331a)을 구성하는 하나 이상의 명령어는 메모리에 저장될 수 있다. 데이터베이스는 입력부에서 획득한 입력 데이터, 모델 학습을 위하여 이용되는 학습 데이터(또는 훈 련 데이터), 모델의 학습 히스토리 등을 저장할 수 있다. 데이터베이스에 저장된 입력 데이터는 모델 학습 에 적합하게 가공된 데이터뿐만 아니라, 가공되지 않은 입력 데이터 그 자체일 수 있다. 러닝 프로세서는 훈련 데이터 또는 트레이닝 셋을 이용하여 인공 신경망(331a)을 훈련시킬 수 있다. 프로세서는 데이터 분석 및 기계 학습 알고리즘을 사용하여 결정되거나, 생성된 정보에 기초하여 모빌리티 튜닝 추천 서버의 적어도 하나의 실행 가능한 동작을 결정 또는 예측할 수 있다. 이를 위해, 프로세서 는 러닝 프로세서의 데이터를 요청, 검색, 수신 또는 활용할 수 있고, 상기 적어도 하나의 실행 가능 한 동작 중 예측되는 동작이나, 바람직한 것으로 판단되는 동작을 실행하도록 모빌리티 튜닝 추천 서버를 제어할 수 있다. 프로세서는 모빌리티 튜닝 추천 서버에서 사용 히스토리 정보를 수집하여 메모리에 저장할 수 있다. 프로세서는 저장된 사용 히스토리 정보 및 예측 모델링을 사용하여 특정 기능을 실행하기 위한 최상 의 매치를 결정할 수 있다. 프로세서는 입력부로부터 이미지 정보(또는 해당 신호), 오디오 정보(또는 해당 신호), 데이터 또는 사용 자 입력 정보를 수신할 수 있다. 프로세서는 정보를 실시간으로 수집하고, 정보(예를 들어, 지식 그래프, 명령 정책, 개인화 데이터베이스, 대화 엔진 등)를 처리 또는 분류하고, 처리된 정보를 메모리 또는 러닝 프로세서에 저장할 수 있다. 모빌리티 튜닝 추천 서버의 동작이 데이터 분석 및 기계 학습 알고리즘 및 기술에 기초하여 결정될 때, 프 로세서는 결정된 동작을 실행하기 위해 모빌리티 튜닝 추천 서버의 구성 요소를 제어할 수 있다. 그 리고, 프로세서는 제어 명령에 따라 모빌리티 튜닝 추천 서버를 제어하여 결정된 동작을 수행할 수 있다. 프로세서는 특정 동작이 수행되는 경우, 데이터 분석 및 기계 학습 알고리즘 및 기법을 통해 특정 동작의 실행을 나타내는 이력 정보를 분석하고, 분석된 정보에 기초하여 이전에 학습한 정보의 업데이트를 수행할 수 있다. 따라서, 프로세서는 러닝 프로세서와 함께, 업데이트 된 정보에 기초하여 데이터 분석 및 기계 학습 알고리즘 및 기법의 미래 성능의 정확성을 향상시킬 수 있다. 도 2를 참조하면, 구체적으로 프로세서는 고객회원정보 저장부, 튜닝 요청 입력부, 튜닝 데이터 수집부, 튜닝안 산출부, 튜닝안 추천부, 및 튜닝 업체 결정부를 포함할 수 있다. 고객회원정보 저장부는 고객 회원의 보유 모빌리티 정보 및 튜닝 이력을 포함하는 고객 모빌리티 정보를 회원별 모빌리티 DB에 저장할 수 있다. 일 실시예로, 고객 모빌리티 정보는 고객 회원이 튜닝하고자 하는 보유 모빌리티의 종류, 명칭, 버전, 생산연도, 중량, 색상, 2D 이미지, 3D 이미지 및 투시도 등을 포함할 수 있다. 일 예로, 고객 회원이 보유 모빌리티에 대한 정보를 \"BMW F900XR\"이라고 입력하면, 고객회원정보 저장부 는 저장부에 미리 저장되어 있는 모빌리티에 관한 정보를 검출하거나, 스크래핑(scraping) 또는 크롤링 (crawling)을 통해 해당하는 모빌리티 정보, 즉 \"BMW F900XR\"의 생산연도, 중량, 색상, 2D 이미지, 3D 이미지 및 투시도 등을 수집하여 자동 저장할 수 있다. 아울러, 고객회원정보 저장부는 이전에 고객 회원이 모빌리티 튜닝 추천 전용 앱을 통해 튜닝안을 선택하 고 튜닝 업체를 선정하여 계약한 경우, 튜닝 이력 정보를 더 저장할 수 있고, 고객 회원 단말이나 튜닝 업 체 단말로부터 해당 튜닝 작업 결과를 수신하여 저장할 수 있다. 이때, 고객회원 저장부는 고객 회원 의 모빌리티 튜닝 영역, 이용된 파츠, 튜닝 업체, 비용 및 튜닝 결과 이미지 등을 더 저장할 수 있다. 고객회원정보 저장부는 고객 회원이 직접 입력할 수도 있고, 모빌리티 튜닝 추천 전용 앱을 통해 입력한 정보들에 기초하여 서버가 추가적인 정보들을 스크래핑 또는 크롤링하여 더 수집하고, 수집된 정보들을 분 석하여 자동 저장할 수 있다. 튜닝 요청 입력부는 고객 회원 단말을 통해 고객 회원으로부터 고객 회원이 원하는 모빌리티 튜닝에 관한 이미지, 텍스트 및 음성 중 적어도 하나를 튜닝 요청 정보로서 입력받을 수 있다. 제1 실시 예로, 튜닝 요청 입력부는 도 3에 도시된 바와 같이 복수의 고객 선호 모빌리티 이미지를 상기 고객 회원의 선호 모빌리티 외관 정보로서 입력받을 수 있다. 예를 들어, 고객 회원의 단말을 통해 고객 회원 자신이 좋아하는 모빌리티 이미지를 캡쳐, 스크랩, 촬영 등의 방법으로 획득하여 고객 회원의 단말을 통해 튜닝 요청 입력부에 전달되도록 할 수 있다. 이때, 모빌리티 이미지는 서로 다른 모빌리티를 포함하는 복수의 이미지일 수 있다. 그리고, 튜닝 요청 입력부는 고객 선호 모빌리티 이미지들의 유사 외관을 추출하는데 있어 각 고객 선호 모빌리티 이미지가 반영될 가중치를 고객 회원으로부터 설정받을 수 있다. 즉, 복수 개의 고객 선호 모빌리티 이미지에서 유사한 외관 특징을 추출할 때 각 고객 선호 모빌리티 이미지가 동일한 비율로 반영될 수도 있고, 고객 회원의 취향에 따라 각 고객 선호 모빌리티 이미지가 반영될 비율이 고 객 회원의 입력 설정에 따라 조정될 수 있다. 또는 복수 개의 고객 선호 모빌리티 이미지 각각에서 추출된 외관 특징을 소정의 기준에 따라 정렬한 결과에 따라, 외관 특징의 개수가 많은 순서에 비례해서 가중치가 정해지면, 이렇게 정해진 가중치에 따라 전술한 비율이 조정될 수도 있다. 예를 들어, 고객 선호 모빌리티 이미지가 5장이 있는데, 각 이미지가 반영될 가중치를 5:2:2:1로 고객 회원이 입력하면, 이러한 가중치에 따라 추천 튜닝안이 생성되는 데에 각 고객 선호 모빌리티 이미지가 가중치에 따라 차별적으로 반영될 수 있다. 이러한 가중치는 고객 회원에 의해 변경될 수 있고, 가중치의 변경에 따라 차후 추천 튜닝안에 이용될 파츠가 변경될 수 있으며, 이에 따라 예상되는 튜닝 이미지를 나타내는 3D 모델링 데이터가 변경되어 출력될 수 있다. 튜닝안 산출부는 적어도 하나 이상의 인공지능 모델을 이용하여 전술한 고객 선호 모빌리티 이미지들에 대 한 분석을 통해 고객 취향에 맞춘 추천 튜닝안을 생성할 수 있다. 이를 위해, 제1 실시 예에 따른 튜닝안 산출부는 이하, 복수의 학습된 인공지능 모델을 이용하여 추천 튜 닝안을 산출할 수 있다.구체적으로, 튜닝안 산출부는 시맨틱 세그멘테이션(Semantic Image Segmentation) 방식으로 학습된 제1 인 공지능 모델을 이용해 상기 고객 선호 모빌리티 이미지 각각으로부터 항목별 파츠를 분류 및 검출할 수 있다. 시맨틱 세그멘테이션은 객체를 검출하고, 각 객체의 물리적 의미 단위를 인식한다. 즉, 고객 선호 모빌리티 이 미지에서 모빌리티 및 모빌리티를 구성하는 각 파츠를 분류할 수 있고, 각 파츠가 무슨 파츠인지 인식할 수 있 다. 이어, 튜닝안 산출부는 시맨틱 세그멘테이션으로 분류 및 검출된 항목별 파츠에 대해 CNN(Convolutional Neural Network) 기반으로 학습된 제2 인공지능 모델을 적용하여 고객 선호 모빌리티 이미지 간의 외관의 유사 도가 기 설정된 기준 이상인 부분 영역을 추출할 수 있다. 예를 들어, 5장의 고객 선호 모빌리티 이미지들 각각의 파츠들을 항목별로 비교하여 5장에서 외관이 기 설정된 유사도 이상으로 유사한 파츠의 적어도 일부 영역들을 검출할 수 있다. 그 일부 영역으로서 검출된 부분이 손잡 이이고, 손잡이 중에서도 말단 부분의 외관이 5장에서 기준치 이상으로 유사한 영역일 수 있다. 설명의 편의를 위해 유사도가 기준치 이상인 영역을 손잡이 영역으로 가정했을 뿐, 이외의 복수의 영역 즉, 복수의 파츠에 해 당하는 부분들이 추출될 수 있다. 다음으로, 튜닝안 산출부는 추천 모델 기반의 제3 인공지능 모델을 통해 추출된 부분 영역이 해당하는 파 츠 항목과 파츠 DB의 파츠들 간의 외관의 유사도 점수를 산출하고, 산출된 유사도 점수에 전술한 튜닝 요청 입 력부에서 고객 회원에 의해 각 고객 선호 모빌리티 이미지에 대해 설정된 가중치를 반영하여 점수가 높은 순으로 파츠들을 파츠 DB로부터 추출할 수 있다. 도 4를 참조하여 예로, 3장의 고객 선호 모빌리티 이미지에 대해 전술한 제1 및 제2 인공지능 모델을 적용하여 손잡이 부위의 외관이 공통되는 것으로 결정된 경우를 가정해볼 수 있다. 이에, 파츠 DB에 저장된 복수의 손잡 이 부품들의 이미지와 3장의 이미지에 포함된 손잡이 이미지들을 각각 비교하여 유사도 점수를 산출할 수 있다. 이에 더하여, 고객 회원이 각 고객 선호 모빌리티 이미지에 대해 미리 설정한 가중치 비율을 전술한 유사도 점 수에 반영하여 점수를 다시 산출할 수 있다. 그리고, 각 선호 이미지의 손잡이와 DB에 저장된 손잡이들 간에 산 출된 가중치 반영 유사도 점수 및 이들을 DB의 손잡이 별로 합산한 점수를 이용하여 오르내림 순으로 DB의 손잡 이들을 나열할 수 있다.아울러, 튜닝안 산출부는 파츠 DB로부터 추출된 각 파츠의 스펙 정보와 고객이 튜 닝하고자 하는 모빌리티의 정보에 기초하여 상기 추출된 파츠를 순정 파츠 및 호환 파츠로 분류할 수 있다. 파츠 DB에 저장된 파츠는 고객 회원이 튜닝하고자 하는 모빌리티의 종에 따라 순정 파츠로 분류될 수도 있고, 호환 파츠로 분류될 수도 있다. 최종적으로 튜닝안 산출부는 적어도 하나의 파츠를 고객 회원의 보유 모빌리티에 조합하여 적어도 하나의 추천 튜닝안을 생성할 수 있다. 다시 말해서, 튜닝안 산출부는 인공지능으로 학습한 이미지 기반의 외관 추출 모델을 통해 고객 회원이 입 력한 선호 모빌리티 외관들로부터 공통된 외관의 특징을 추출하고, 튜닝 대상인 모빌리티 기종의 기본 골조를 기준으로 상기 추출된 외관 특징을 구현하기 위해 순정 파츠 또는 호환 파츠 중 적어도 하나에 기초한 튜닝 조 합을 실행할 수 있다. 이 때, 추천 튜닝안을 생성하는 과정에서는 각 파츠에 대해 추천된 하나 이상의 파츠가, 각 파츠 별로 조합될 수 있다. 예컨대 바퀴에 대해 제1 내지 제3 파츠, 손잡이에 대해 제1 내지 제5 파츠 그리고 안장에 대해 제1 내 지 제10 파츠가 추천되었다고 가정하자. 그러면, 추천 튜닝안은 다음과 같이 생성 가능하며, 다만 이에 한정되 는 것은 아니다. - 제1 추천 튜닝안 : 바퀴에 대한 제1 파츠, 손잡이에 대한 제2 파츠, 안장에 대한 제4파츠 - 제2 추천 튜닝안 : 바퀴에 대한 제1 파츠, 손잡이에 대한 제3 파츠, 안장에 대한 제3파츠 - 제3 추천 튜닝안 : 바퀴에 대한 제3 파츠, 손잡이에 대한 제4 파츠, 안장에 대한 제8파츠 여기서, 각각의 추천 튜닝안에서 각 파츠들이 조합되는 기준은 다양할 수 있다. 예컨대, 각 파츠에 대해 전술한 유사도 점수가 고려되어서 조합 가능하다. 즉, 제1 추천 튜닝안에서는 각 파츠 별로 가장 높은 유사도를 갖는파츠들이 조합되는 반면, 제2 추천 튜닝안에서는 각 파츠 별로 두번 째로 높은 유사도를 갖는 파츠들이 조합될 수 있다. 이와 달리, 제3 추천 튜닝안에서는 바퀴에 대해서는 제1 파츠로 고정되어 있는 반면, 손잡이에 대해서 는 유사도가 가장 높은 파츠 그리고 안장에 대해서는 유사도가 가장 낮은 파츠가 조합될 수도 있다. 즉, 각 파 츠에 대해 선택되는 파츠는 유동적일 수 있고, 이 때 유사도가 고려될 수도 있고 그렇지 않을 수도 있으며, 각 파츠 중 일부는 미리 고정된 파츠가 존재할 수도 있다. 여기서, 튜닝안 산출부는 추천 튜닝안을 생성하는데 있어서, 기본적으로 튜닝 대상 모빌리티 모종의 기본 골조를 기준으로 순정 파츠를 먼저 고려하되, 순정 파츠가 부재한 경우 호환 파츠를 차선으로 고려하여 튜닝 조 합을 생성할 수 있다. 이로써, 튜닝안 산출부는 고객 회원이 선호하는 모빌리티 이미지와 가장 유사한 순정 부품을 위주로 튜닝 안을 추천하여 안전성과 신뢰성을 추구할 수 있고, 적합한 순정 부품이 부재할 경우 호환 가능한 파츠들로 대체 함으로써 고객 취향을 유지하며 만족도를 높일 수 있다. 제2 실시 예로, 튜닝 요청 입력부는 고객 회원이 원하는 모빌리티 튜닝을 의미하는 문장을 입력받은 경우, 입력 문장에 형태소 분석을 수행하여 입력 문장을 복수의 단어들로 분리하고, 분리된 단어들 중에서 개체명에 해당하는 타겟 단어를 인식하며, 인식된 타겟 단어를 파츠 DB에 기 저장된 파츠 관련 용어들과 비교 분석할 수 있다. 여기서, 고객 회원이 음성을 입력한 경우에는 입력된 음성을 문장으로 변환하여 변환된 문장을 분석할 수 있다. 예를 들어, 고객 회원이 \"짐을 최대한 많이 실을 수 있게 튜닝\"이라고 음성이나 문자를 입력한 경우, 튜닝 요청 입력부는 '짐', '최대한', '많이', '실어', '튜닝' 등의 단어를 추출하고, 추출된 단어들 중에서 개체명에 해당하는 타겟 단어로서 '짐', '많이', '실어', '튜닝' 등을 타겟 단어로 인식할 수 있다. 이에, 튜닝안 산출부는 인식된 타겟 단어와 파츠 DB에 기 저장된 '짐칸', '짐받이', '탑박스', '바구니' 등의 파츠 관련 용어들에 대해 유사도 분석을 통해 파츠 DB로부터 소정의 파츠들을 검출할 수 있다. 이어서, 튜닝안 산출부는 파츠 DB로부터 추출된 각 파츠의 스펙 정보와 고객이 튜닝하고자 하는 모빌리티 의 정보에 기초하여 상기 적어도 하나의 파츠를 순정 파츠 및 호환 파츠로 분류할 수 있다. 최종적으로 튜닝안 산출부는 적어도 하나의 파츠를 고객 회원의 보유 모빌리티에 조합하여 적어도 하나의 상기 추천 튜닝안을 생성할 수 있다. 이때, 제1 실시 예와 마찬가지로, 튜닝안 산출부는 추천 튜닝안을 생성하는데 있어서, 기본적으로 튜닝 대 상 모빌리티 모종의 기본 골조를 기준으로 순정 파츠를 먼저 고려하되, 순정 파츠가 부재한 경우 호환 파츠를 차선으로 고려하여 튜닝 조합을 생성할 수 있다. 제3 실시 예로, 튜닝 요청 입력부는 고객 회원이 튜닝 요청 정보로서 입력한 모빌리티 이미지와 고객이 보 유한 모빌리티를 비교함으로써, 고객이 원하는 튜닝 정보를 파악할 수 있다. 도 5의 (a)는 고객 회원이 보유하고 있는 현재 모빌리티의 이미지를 촬영한 이미지이고, 도 5의 (b)는 고객 회 원이 자신이 보유한 모빌리티를 튜닝하고자 하는 원하는 이미지를 수집하여 입력된 튜닝 이미지의 일 예를 도시 한다. 튜닝 요청 입력부는 (a)와 (b)의 이미지를 비교 분석하여, 고객 회원이 절삭 레바, 카본 포크슬라이 더, 에스피커텍트 바이크마운트 폰 거치대 브라켓, 아크라포빅 레이싱라인 티탄 풀시스템 머플러에 대해 튜닝 요청을 한 것으로 추측할 수 있고, 추측된 튜닝 요청 내용을 고객 회원에게 확인하는 절차를 더 수행할 수 있다. 이때, (a)와 (b)의 모빌리티는 동일한 종이 아닐 수도 있고, 고객 회원이 (b)의 튜닝 요청 이미지를 입력할 때, (b)의 모빌리티 전체 부위 중 자신이 원하는 모방을 원하는 부위를 표시하여 입력할 수 있다. 일 예로, 모방을 원하는 부위를 모빌리티 이미지 상에 하이라이트 표시하거나, 해당 부위의 파츠 명칭이나 영역 명칭을 기재하여 입력하도록 할 수 있다. 여기서, 튜닝 요청 입력부는 학습된 심층신경망(CNN: Convolutional Network) 기반의 세그멘테이션 (Semantic Image Segmentation) 모델을 이용하여 사진 이미지로부터 타겟 객체인 파츠들을 검출할 수 있다. 제3 실시예에서 튜닝안 산출부는 고객이 보유한 모빌리티(a)와 튜닝을 원하는 즉, 모방하고자 하는 모빌리 티(b) 간의 비교 결과, 서로 상이한 부위의 모빌리티(b)의 파츠를 추출하고, 추출된 파츠를 파츠 DB에 저장된 파츠들과 비교하여 기 설정된 기준 이상의 유사도를 갖는 적어도 하나의 파츠를 추출할 수 있다.이어, 튜닝안 산출부는 파츠 DB로부터 추출된 각 파츠의 스펙 정보와 고객이 튜닝하고자 하는 모빌리티의 정보에 기초하여 상기 적어도 하나의 파츠를 순정 파츠 및 호환 파츠로 분류할 수 있다. 최종적으로 튜닝안 산출부는 적어도 하나의 파츠를 고객 회원의 보유 모빌리티에 조합하여 적어도 하나의 추천 튜닝안을 생성할 수 있다. 한편, 튜닝 요청 입력부는 고객 회원 단말로부터 고객 회원이 원하는 모빌리티 튜닝에 관한 이미지에 관한 요청뿐만 아니라, 추후 튜닝안 선택 결정시 가중치를 둘 조건으로서 일 예로, 비용, 순정 부품, 호환 부품 등에 관한 조건 정보를 더 입력받을 수 있다. 튜닝 데이터 수집부는 파츠 DB에 저장된 각 파츠를 이용한 튜닝 정보에 기초하여 모빌리티 종, 파츠의 순 정 여부, 호환 여부, 가격, 품질, 기능, 튜닝 업체 및 고객 회원 후기 중 적어도 하나를 수집할 수 있다. 일 실시예로, 튜닝 데이터 수집부는 튜닝안 추천부에서 고객 회원에게 추천한 튜닝안에 대응하는 튜 닝 결과를 수집하여 파츠 DB를 지속적으로 업데이트할 수 있다. 여기서, 튜닝 결과는 고객 회원 단말이나 튜닝 업체 단말로부터 수신될 수 있다. 아울러, 튜닝 데이터 수집부는 튜닝 업체 단말에서 새로 운 파츠에 관한 정보가 생성될 때마다 이에 관한 정보를 수신하여 파츠 DB를 실시간 업데이트할 수 있다. 도 6에 도시된 바와 같이, 튜닝안 산출부는 튜닝 요청 입력부로부터 획득한 모빌리티 정보(차종, 모 델명, 연식, 튜닝 이력, 정비 이력 등) 및 선정된 각 파츠의 부품 도면을 이용하여 추천 튜닝안에 대응하는 모 빌리티 튜닝의 3D 모델링 데이터를 생성할 수 있다. 즉, 각 추천 튜닝안에 대응하여 선별된 파츠에 기초하여 튜닝 작업을 수행했을 때 예상되는 이미지를 시뮬레이 션하여 3D 모델링 데이터로 출력할 수 있다. 3D 모델링 데이터를 고객 회원 단말에 제공하면, 고객 회원의 선택에 따라 각 추천 튜닝안 별로 출력된 3D 모델링 데이터를 고객 회원이 확인한 뒤, 추가로 튜닝 관련 규정에 부합하는 범위 내에서 고객 회원이 다시 선 택 가능한 항목(예를 들어, 색상이나 사이즈)을 변경하면, 그에 따라 변경된 3D 모델링 데이터를 확인하도록 할 수 있다. 아울러, 튜닝안 산출부는 튜닝 요청 정보 또는 튜닝 시뮬레이션 결과 중 적어도 하나가 튜닝 관련 규정에 부합하는지 여부를 판단할 수 있다. 일 예로, 튜닝 요청 정보로서 입력된 모빌리티 이미지를 세그멘테이션 모델을 통해 튜닝된 파츠를 검출하고, 검 출된 파츠를 파츠 DB에 저장된 파츠 정보와 비교하여 유사도 분석을 통해 검출된 파츠의 스펙 정보를 추출하고, 추출된 스펙 정보가 튜닝 관련 규정을 준수하는지 여부를 파악할 수 있다. 여기서, 세그멘테이션 모델은 모빌리 티 이미지의 모빌리티에서 튜닝된 파츠 이미지만 검출하도록 빅데이터를 이용하여 학습된 모델일 수 있다. 다른 예로, 튜닝 요청 정보로서 입력된 모빌리티 이미지를 세그멘테이션 모델과 딥러닝 모델을 통해 모빌리티 종과 튜닝된 파츠를 검출하고, 해당 모빌리티 종의 실제 크기와 이미지 상의 모빌리티 크기를 비교하여 비율을 산출하여, 산출된 비율을 통해 모빌리티 이미지에서 튜닝된 파츠의 실제 사이즈 및 크기 등의 스펙 정보를 추정 할 수 있으며, 추정된 스펙 정보가 튜닝 관련 규정을 준수하는지 여부를 파악할 수 있다. 이를 위해, 모빌리티 튜닝 추천 서버는 한국교통안전공단에서 발행한 이륜차 튜닝 업무 매뉴얼이나 검증 기관의 관계법령을 저장하거나 여 조회 및 검토하거나, 해당 웹사이트에 대해 스크래핑(scraping) 또는 크롤링 (crawling)을 통해 튜닝 관련 규정을 가져올 수 있다. 이에 따라, 튜닝안 산출부는 튜닝 요청 정보 또는 튜닝 시뮬레이션 결과가 튜닝 관련 규정에 부적합한 것으로 판단된 경우, 튜닝 요청 정보의 스펙과 최대한 가까우면서 튜닝 관련 규정 범위를 준수하는 파츠를 재선별 하고, 재선별된 상기 파츠로 튜닝 조합을 생성할 수 있다. 즉, 고객 회원이 원하는 튜닝의 스펙이 튜닝 관련 규정에 부적합한 것으로 판단된 경우, 튜닝 요청 정보와 완전 히 동일하지 않더라도, 최대한 고객 회원의 튜닝 요청 이미지와 유사하면서 튜닝 관련 규정 범위 내에 해당하도 록 추천 튜닝안을 생성할 수 있다. 튜닝안 추천부는 적어도 하나 이상의 추천 튜닝안, 및 해당 추천 튜닝안의 작업이 가능한 업체 정보를 고 객 회원 단말로 추천 제공할 수 있다. 일 실시예로, 튜닝안 추천부는 고객 회원이 추천 튜닝안에 기초하여 튜닝 업체를 선정할 때, 해당 튜닝안 의 튜닝 작업을 위한 파츠별 비용, 작업 비용 및 파츠에 따른 추가된 기능 등을 비교하여 고객 회원 단말 에서 조회 가능하도록 할 수 있다. 또한, 튜닝안 추천부는 추천하는 튜닝안은 고객 회원이 추가로 입력한 가중치를 부여한 조건을 고려하여 적어도 하나 이상의 튜닝안의 추천 우선순위를 결정하여 고객 회원 단말에 추천 튜닝안 리스트로 제공할 수 있다. 또는, 튜닝안 추천부는 각 추천 튜닝안에 대응하는 튜닝 작업이 가능한 튜닝 업체에 관한 정보를 튜닝 작 업 비용이 저렴한 업체, 고객 회원들의 평점이 높은 업체, 고객 회원의 주거지와 거리상 가까운 업체 중 적어도 하나에 기초하는 우선순위로 제공할 수 있다. 일 실시예로, 튜닝안 추천부는 적어도 하나 이상의 튜닝안에 해당하는 3D 모델링 데이터를 고객 회원 단말 에 출력할 수 있다. 고객 회원 단말은 모빌리티의 3D 모델링 데이터를 출력하고, 출력된 3D 모델링 데이터 화면에서 튜닝을 위한 파츠에 관한 정보를 조회할 수 있다. 튜닝 부품 조회 시, 파츠가 순정 부품인 경 우 호환 부품과 교체 가능 여부를 판단할 수 있다. 호환 부품으로 교체 가능 여부란 튜닝 부품이 순정 부품 대 신 해당 모빌리티에 설치 가능한지 여부를 판단하는 것을 의미한다. 필요에 따라 튜닝 파츠의 조회는 튜닝 부품 의 가격대 별, 인기순 등의 조건으로 필터링하여 수행될 수도 있다. 튜닝 업체 결정부는 고객 회원 단말을 통한 고객 회원의 선택에 따른 튜닝 업체 결정 후 계약을 진행 하도록 거래 및 결제 서비스 등을 제공할 수 있다. 고객 회원 단말을 통해 선택된 튜닝안에 대응하는 파츠를 보유하고 튜닝 작업이 가능한 적어도 하나의 튜 닝 업체 중 고객 회원이 선택한 튜닝 업체에 관한 정보를 고객 회원 단말에 전송할 수 있다. 고객 회원 단 말이 튜닝 업체를 선택하면, 튜닝 업체 결정부는 튜닝 업체 단말로 모빌러티 정보, 튜닝 주문 정보를 포함하는 튜닝 요청 정보를 전송할 수 있다. 도 7은 본 발명의 제1 실시예에 따른 인공지능 기반 모빌리티 튜닝 추천 방법을 설명하기 위한 순서도이다. 앞 서 도 1 내지 도 6을 참조하여 설명한 부분과 중복되는 설명은 생략하기로 한다. 도 7을 참조하면, 본 발명의 제1 실시예에 따른 인공지능 기반 모빌리티 튜닝 추천 방법은, 먼저 프로세서가 고 객 회원의 보유 모빌리티 정보 및 튜닝 이력을 포함하는 고객 모빌리티 정보를 회원별 모빌리티 DB에 저장할 수 있다(S110). 다음으로, 고객 회원이 원하는 모빌리티 튜닝에 관한 이미지, 텍스트 및 음성 중 적어도 하나를 튜닝 요청 정보 로서 입력받을 수 있다(S120). 다음으로, 학습된 인공지능 모델을 통해 상기 고객 모빌리티 정보에 기초하여 상기 튜닝 요청 정보에 매칭하는 파츠를 결정하고, 상기 결정된 파츠에 기초하여 적어도 하나 이상의 추천 튜닝안을 생성할 수 있다(S130). 다음으로, 상기 추천 튜닝안 각각의 작업이 가능한 튜닝 업체 정보를 고객 회원 단말로 제공할 수 있다(S140). 다음으로, 상기 고객 회원의 선택에 따른 튜닝 업체 결정 후 계약을 진행할 수 있다(S150). 여기서, S120의 튜닝 요청 정보를 입력받는 단계는, 복수의 고객 선호 모빌리티 이미지를 상기 고객 회원의 선 호 모빌리티 외관 정보로서 입력받는 단계 및 상기 고객 선호 모빌리티 이미지들의 유사 외관을 추출하는데 있 어 각 고객 선호 모빌리티 이미지가 반영될 가중치를 설정받는 단계를 포함할 수 있다. S130의 추천 튜닝안을 생성하는 단계는, 세맨틱 세그멘테이션(Semantic Image Segmentation) 방식으로 학습된 제1 인공지능 모델을 이용해 상기 고객 선호 모빌리티 이미지 각각으로부터 항목별 파츠를 분류 및 검출하는 단 계, 상기 분류 및 검출된 항목별 파츠에 대해 CNN 기반으로 학습된 제2 인공지능 모델을 통해 상기 고객 선호 모빌리티 이미지 간의 외관의 유사도가 기 설정된 기준 이상인 부분 영역을 추출하는 단계, 및 추천 모델을 통 해 상기 추출된 부분 영역이 해당하는 파츠 항목과 파츠 DB의 파츠들 간의 외관의 유사도 점수를 산출하고, 상 기 유사도 점수에 상기 가중치를 반영하여 점수가 높은 순으로 파츠들을 상기 파츠 DB로부터 추출하는 단계를 포함할 수 있다. 본 발명의 실시 예에 따른 인공지능 기반 모빌리티 튜닝 추천 장치에 의하면, 고객 회원의 모빌리티 외관에 대 한 선호도나 취향을 최대한 고려하면서 튜닝 관련 규정 범위 내에 해당하도록 추천 튜닝안을 제안하고, 추천 튜 닝안의 파츠를 보유하고 해당 튜닝 작업이 가능한 튜닝 업체 정보를 제공하여, 튜닝 업체와 계약하고 튜닝 후 튜닝 결과를 업데이트하는 일련의 과정을 하나의 플랫폼을 통해 진행하도록 함으로써, 사용자와 튜닝업체가 서로 시공간의 제약없이 편리하고 효율적으로 모빌리티 튜닝을 진행할 수 있도록 하였다. 본 발명에 따른 인공지능 기반 모빌리티 튜닝 추천 장치는 사용자 입장에서 간편하게 모빌리티 정보를 입력하고, 원하는 모빌리티 튜닝에 관한 이미지나 텍스트 또는 음성을 입력하는 것만으로도 사용자의 취향과, 순정 부품, 호환 부품 및 관련 규정 등의 조건이 고려된 추천 튜닝안을 제공받을 수 있고, 선택한 추천 튜닝안 의 작업이 가능한 튜닝 업체에 관한 정보를 제공받아 계약까지 실행함으로써, 플랫폼 시스템의 활용도를 높일 수 있다. 본 발명에 따른 인공지능 기반 모빌리티 튜닝 추천 장치에 의하면, 사용자의 튜닝 요청 정보를 분석하여 취향에 따라 적당한 파츠들을 선별하여 추천 튜닝안을 제공함으로써 사용자 만족도를 높일 수 있다. 본 발명에 따른 방법 및 장치는 하나 이상의 프로세서로 하여금 앞서 설명한 기능들과 프로세서를 수행하도록 하는 명령에 의하여 구동될 수 있다. 예를 들어 그러한 명령으로는, 예컨대 JavaScript나 ECMAScript 명령 등의 스크립트 명령과 같은 해석되는 명령 이나 실행 가능한 코드 혹은 컴퓨터로 판독 가능한 매체에 저장되는 기타의 명령이 포함될 수 있다. 나아가 본 발명에 따른 장치는 서버 팜(Server Farm)과 같이 네트워크에 걸쳐서 분산형으로 구현될 수 있으며, 혹은 단일 의 컴퓨터 장치에서 구현될 수도 있다. 비록 본 명세서와 도면에서는 예시적인 장치 구성을 기술하고 있지만, 본 명세서에서 설명하는 기능적인 동작과 주제의 구현물들은 다른 유형의 디지털 전자 회로로 구현되거나, 본 명세서에서 개시하는 구조 및 그 구조적인 등가물들을 포함하는 컴퓨터 소프트웨어, 펌웨어 혹은 하드웨어로 구현되거나, 이들 중 하나 이상의 결합으로 구현 가능하다. 본 명세서에서 설명하는 주제의 구현물들은 하나 이상의 컴퓨터 프로그램 제품, 다시 말해 본 발명에 따른 장치의 동작을 제어하기 위하여 혹은 이것에 의한 실행을 위하여 유형의 프로그램 저장매체 상에 인코딩된 컴퓨터 프로그램 명령에 관한 하나 이상의 모듈로서 구현될 수 있다. 컴퓨터로 판독 가능한 매체는 기 계로 판독 가능한 저장 장치, 기계로 판독 가능한 저장 기판, 메모리 장치, 기계로 판독 가능한 전파형 신호에 영향을 미치는 물질의 조성물 혹은 이들 중 하나 이상의 조합일 수 있다. 본 명세서에서 설명한 주제의 구현물은 예컨대 데이터 서버와 같은 백엔드 컴포넌트를 포함하거나, 예컨대 어플 리케이션 서버와 같은 미들웨어 컴포넌트를 포함하거나, 예컨대 사용자가 본 명세서에서 설명한 주제의 구현물 과 상호 작용할 수 있는 웹 브라우저나 그래픽 유저 인터페이스를 갖는 클라이언트 컴퓨터와 같은 프론트엔드 컴포넌트 혹은 그러한 백엔드, 미들웨어 혹은 프론트엔드 컴포넌트의 하나 이상의 모든 조합을 포함하는 연산 시스템에서 구현될 수 있다. 시스템의 컴포넌트는 예컨대 통신 네트워크와 같은 디지털 데이터 통신의 어떠한 형태나 매체에 의해서도 상호 접속 가능하다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특정한 특징들 은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양한 특징들 역 시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특 정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부터의 하나 이 상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 마찬가지로, 특정한 순서로 도면에서 동작들을 묘사하고 있지만, 이는 바람직한 결과를 얻기 위하여 도시된 그 특정한 순서나 순차적인 순서대로 그러한 동작들을 수행하여야 한다거나 모든 도시된 동작들이 수행되어야 하는 것으로 이해되어서는 안 된다. 특정한 경우, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 또한, 상술한 실시 형태의 다양한 시스템 컴포넌트의 분리는 그러한 분리를 모든 실시형태에서 요구하는 것으로 이해되어서는 안되 며, 설명한 프로그램 컴포넌트와 시스템들은 일반적으로 단일의 소프트웨어 제품으로 함께 통합되거나 다중 소 프트웨어 제품에 패키징될 수 있다는 점을 이해하여야 한다. 본 명세서에서 설명한 주제의 특정한 실시형태를 설명하였다. 기타의 실시형태들은 이하의 청구항의 범위 내에 속한다. 예컨대, 청구항에서 인용된 동작들은 상이한 순서로 수행되면서도 여전히 바람직한 결과를 성취할 수 있다. 일 예로서, 첨부도면에 도시한 프로세스는 바람직한 결과를 얻기 위하여 반드시 그 특정한 도시된 순서나 순차적인 순서를 요구하지 않는다. 특정한 구현 예에서, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 본 기술한 설명은 본 발명의 최상의 모드를 제시하고 있으며, 본 발명을 설명하기 위하여, 그리고 당업자가 본 발명을 제작 및 이용할 수 있도록 하기 위한 예를 제공하고 있다. 이렇게 작성된 명세서는 그 제시된 구체적인 용어에 본 발명을 제한하는 것이 아니다. 따라서, 상술한 예를 참조하여 본 발명을 상세하게 설명하였지만, 당 업자라면 본 발명의 범위를 벗어나지 않으면서도 본 예들에 대한 개조, 변경 및 변형을 가할 수 있다. 따라서 본 발명의 범위는 설명된 실시 예에 의하여 정할 것이 아니고 특허청구범위에 의해 정하여져야 한다."}
{"patent_id": "10-2023-0079041", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기반 모빌리티 튜닝 추천 플랫폼 시스템을 도시하는 개념도이다. 도 2는 본 발명의 일 실시예에 따른 인공지능 기반 모빌리티 튜닝 추천 서버(모빌리티 튜닝 추천 장치)의 구성 을 도시하는 블록도이다. 도 3은 본 발명의 일 실시 예에 따른 고객 선호 모빌리티 입력 이미지의 일 예를 도시한다. 도 4는 본 발명의 일 실시 예에 따른 추천 튜닝안에 이용될 파츠를 선정하기 위한 예시 표를 도시한다. 도 5는 고객 회원의 보유 모빌리티 이미지(a) 및 튜닝 요청 이미지(b)의 일 예를 도시한다. 도 6은 본 발명의 일 실시예에 따라 제공되는 3D 모델링 데이터의 일 예를 도시한다. 도 7은 본 발명의 일 실시예에 따른 인공지능 기반 모빌리티 튜닝 추천 방법을 설명하기 위한 순서도이다."}
