{"patent_id": "10-2020-0112783", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0031176", "출원번호": "10-2020-0112783", "발명의 명칭": "인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템", "출원인": "인제대학교 산학협력단", "발명자": "김진"}}
{"patent_id": "10-2020-0112783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "영상획득부, 영상처리부, 디스플레이부 및 안면신경마비 평가부를 포함한, 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템에 있어서,상기 안면신경마비 평가부에는 하기와 같은 제어로직이 기 저장된 것을 특징으로 하는, 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템.F’=[(7a-3b’)/4a]X100=(43.75/a)-75{b+a[1-(p’/p)]X100}/a"}
{"patent_id": "10-2020-0112783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "에 있어서,상기 (e) 단계에서 안면근육의 기능은 하기의 식을 이용하는, 인공지능 안면인식 알고리즘을 이용한 안면 장애진단 방법.F’=[(7a-3b)/4a]X100=(43.75/a)-{75{b+a[1-(p’/p)]X100}/a"}
{"patent_id": "10-2020-0112783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 (a) 단계는 하기의 식으로 정의되는, 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 방법.D=[(b-a)/w]x100=[(b-a)/(4a/3)]x100"}
{"patent_id": "10-2020-0112783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 (b) 단계는 하기의 식으로 정의되는, 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 방법.F=100-d=100-[(b-a)/(4a/3)]x100=[(7a-3b)/4a]X100"}
{"patent_id": "10-2020-0112783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 2에 있어서,상기 (c)와 상기 (d) 단계의 판단시 하기의 식을 이용하는, 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 방법.S=[(p-p’)/(p/4)]X100=4[1-(p’/p)]X100 (이차현상으로 수축되는 비정상 근육의 길이의 비율)L=(a/4)XS=a[1-(p’/p)]X100 (이차현상으로 추가되어 수축되는 비정상 근육의 길이)b’=b+L=b+a[1-(p’/p)]X100 (이차현상까지 고려한 b'의 길이)공개특허 10-2022-0031176-3-청구항 6"}
{"patent_id": "10-2020-0112783", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템이 소개된다. 이를 위해 본 발명은 영상획득부, 영상처리부, 디스플레이부 및 안면신경마비 평가부를 포함하고, 상기 안면신경 마비 평가부에는 하기와 같은 제어로직이 기 저장된 것을 특징으로 한다. (뒷면에 계속)"}
{"patent_id": "10-2020-0112783", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템에 관한 것이다."}
{"patent_id": "10-2020-0112783", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인간은 여러 다양한 안면 표정을 통하여 서로 교통을 하고 있으며, 이는 비언어적이고 인간만이 할 수 있는 고 차원적 의사소통의 수단으로서 인간만이 누릴 수 있는 특권이기도 하다. 이러한 중요한 역할을 하고 있는 22개의 안면 근육이 어떠한 원인에 의해서 그 기능을 발휘하지 못하는 경우 개 인의 삶에 막대한 피해를 줄 수 있다. 얼굴 표정, 눈물과 침의 분비, 미각, 청각 등 많은 기능과 연관된 안면신경은 인체 부위 중 가장 쉽게 마비가 생기는 신경 중의 하나이다. 편측성 안면신경마비는 인구 10만명당 2025명의 발생률을 보이는 비교적 흔한 질환 이다. 그러나 양측성 안면 신경마비는 그에 비해 발생률도 훨씬 적고 다른 전식적인 질환에 동반되어 이차적으로 나타 나는 것이 대부분이다. 안면신경마비 환자의 치료효과를 객관화하기 위해서는 객관적이고도 범용성 있는 안면신경마비 평가 장치의 개 발이 필요하다. 객관적 방법은 진단기를 사용한다. 신경전도(ENoG, Electroneuronography)를 사용하여 안면신경을 변성정도를 직접평가하거나 적외선 체열진단기를 이용하여 간접적으로 안면부 자율신경의 기능을 평가하기도 하였다. 또는 안면부의 근육과 신경을 동시에 평가하기 위하여, 근전도(EMG)와 신경전도 또는 근전도와 심박변이도를 함 께 사용하기도 하였다. 주관적인 방법은 전체적인 안면신경마비와 이차적 동반증상을 한번에 평가하는 총괄법( Gross scale), 안면을 부위별로 나누어 각각의 마비정도를 평가한 뒤 전체적인 등급으로 환산하는 부위법(Regional scale), 안정시와 운동시 장애 그리고 이차적 동반증상을 따로 나누어 등급을 평가하는 특수법 (Specific facial nerve grading system)으로 분류된다. 이중 총괄법의 HB법과 Nottingham법, 그리고 부위법의 Yanagihara법이 임상에서 빈번하게 사용되고 있다. 안면에 장애가 생기는 경우 기 설명한 바와 같이 정확한 진단에 기반으로 한 섬세한 치료는 안면 장애의 치료시 필수적으로 요구되는 사항이기도 하다. 하지만 안면 장애는 위에서 설명하였지만, 다른 질환과 달리 그 평가 방법이 객관적이지 못하였고, 의사 혹은 환자의 주관적 판단으로 이루어지고 있어 여러 문제를 가지고 있다. 이에 본 발명은 임상적인 현실에서 안면장애를 객관적으로 평가할 수 있는 평가 도구를 개발하고자 함에 있고, 이를 통해 보다 효율적이고 섬세하게 안면 근육의 움직임을 감지하고자 인공지능을 이용한 안면인식 시스템을 평가 도구에 활용하고자 하였으며, 이러한 본 발명에 의한다면 안면부 이상이 있는 환자에게 정확한 진단과정을 보다 효율적으로 공급할 수 있게 된다. 선행기술문헌특허문헌 (특허문헌 0001) KR 10-1580038 (2015.12.17 등록)"}
{"patent_id": "10-2020-0112783", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래기술에 따른 평가방법으로, 진단기기를 이용하는 객관적 방법은 정확하고 객관적이기는 하나, 개인적 취향 이 반영된 연구단계 수준에 머물러 있으며, 주관적인 방법처럼 임상적에서 보편적으로 사용되고 있지는 않다. 주관적 방법은 접근성이 쉽고 평가지표가 세계적으로 널리 사용되고 있다는 장점이 있으나 의사의 주관이 개입 될 가능성이 많은 문제점이 있었다. 이에 본 발명의 목적은 상기한 바와 같은 문제점을 해결하기 위한 것으로, 객관적으로 안면신경 마비 여부를 평 가할 수 있는 일종의 알고리즘을 제공함에 그 목적이 있다. 이를 통해 객관화된 수치를 통해 종래 주관적으로 판단된 안면장애 평가에 새로운 시스템을 제공함에 그 목적이 있다."}
{"patent_id": "10-2020-0112783", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템이 소개된다. 이를 위해 본 발명은 영상획득부, 영상처리부, 디스플레이부 및 안면신경마비 평가부를 포함하고, 상기 안면신 경마비 평가부에는 하기와 같은 제어로직이 기 저장된 것을 특징으로 한다. F’=[(7a-3b’)/4a]X100=(43.75/a)-75{b+a[1-(p’/p)]X100}/a 이와 함께, 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 방법이 소개된다. 이를 위해 본 발명은 (a)실제 수축해야 하는 근육의 길이에서 수축하지 못한 근육의 길이를 하기의 식으로 측정 하는 단계, (b)설정된 갯수의 안면근육의 비정상근육의 수축력을 정상근육의 수축력과의 차이에 의한 평균값을 구하는 단계, (c)설정된 갯수의 안면근육 이외에 안면의 다른 곳에서 움직인 근육의 길이를 고려하여 보정하는 단계, (d)비정상 근육의 길이와 상기 (c)단계의 이차현상을 고려하는 단계, (e)최종 안면근육의 기능을 측정하 기 위한 판단식을 제공하는 단계를 포함한다. 상기 (a) 단계는 하기의 식으로 정의된다. D=[(b-a)/w]x100=[(b-a)/(4a/3)]x100 상기 (b) 단계는 하기의 식으로 정의된다. F=100-d=100-[(b-a)/(4a/3)]x100=[(7a-3b)/4a]X100 상기 (c)와 상기 (d) 단계의 판단시 하기의 식을 이용한다. S=[(p-p’)/(p/4)]X100=4[1-(p’/p)]X100 (이차현상으로 수축되는 비정상 근육의 길이의 비율) L=(a/4)XS=a[1-(p’/p)]X100 (이차현상으로 추가되어 수축되는 비정상 근육의 길이) b’=b+L=b+a[1-(p’/p)]X100 (이차현상까지 고려한 b'의 길이) 상기(e) 단계에서 안면근육의 기능은 하기의 식을 이용한다. F’=[(7a-3b)/4a]X100=(43.75/a)-{75{b+a[1-(p’/p)]X100}/a"}
{"patent_id": "10-2020-0112783", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템에 의하면, 피험자의 안면신경 마 비 여부를 객관적이고 정확하게 평가할 수 있다는 효과가 얻어진다.또한, 본 발명에 의하면 매우 객관적이며 검사 간 오차가 적은 안면마비의 정량화 결과를 얻을 수 있다. 또한, 이러한 안면마비의 정량화 방법은 안면마비의 진단과 치료를 위한 정보를 제공하는 방법으로 사용될 수 있는 등 다양한 효과가 구현된다."}
{"patent_id": "10-2020-0112783", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조로 본 발명인 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템의 바람직한 실시 예를 설명한다. 이하, 도면을 참조하여 본 발명의 실시예에 따른 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템 설명한다. 본 발명을 설명함에 있어서, 관련된 공지기능 혹은 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단된 경우 그 상세한 설명은 생략한다. 도 1에 도시된 바와 같이, 본 발명은 크게 영상획득부, 영상처리부, 디스플레이부 및 안면신경마비 평가부를 포 함한다. 영상획득부는 카메라를 포함할 수 있으며, 피험자의 얼굴을 실시간으로 촬영한다. 한편, 이하 설명할 안면신경마비 평가부에서 수행될 제어로직에 대해 설명하기에 앞서, 본 발명의 제어로직의 기반에 대해 설명하면 다음과 같으며, 결국 본 발명은 아래와 같은 구성과 제어로직을 포함할 수 있다. 영상획득부, 영상처리부, 디스플레이부 및 안면신경마비 평가부를 포함한, 인공지능 안면인식 알고리즘을 이용 한 안면 장애 진단 시스템에 있어서, 안면신경마비 평가부에는 하기와 같은 제어로직이 기 저장된 것을 특징으 로 한다. F’=[(7a-3b’)/4a]X100=(43.75/a)-75{b+a[1-(p’/p)]X100}/a 우선, 본 발명인 인공지능 안면인식 알고리즘을 이용한 안면 장애 진단 시스템의 객관화를 위해 우선 얼굴에 있 는 22 개의 안면 근육의 이동 방향 및 강도를 포함하는 안면 근육의 해부학적 특성을 반영한 대표 점을 설정할 필요가 있다. 또한, 이하 설명할 대표점은 안면인식에 대한 것인바 얼굴의 주변 구조와 구별되는 특성을 가져야 한다. 이에 본 발명은 인간의 가장 일반적인 7 가지 얼굴 표정 기반으로 총 68개의 점을 상정하였다. 해당 68개의 점 중에는 안면 근육의 움직임에 관계없이 고정되는 점이 있을 것이고, 안면 근육의 움직임에 의해 변하는 점이 있다. 이때, 고정되는 점은 총 21개인데, 얼굴의 중간 선 부분에 4개의 점과 얼굴 윤곽선에 있는 17 개 점으로 구성된 다. 그 다음으로, 안면 근육의 움직임에 의해 변하는 점인 47개의 점은 눈썹 부위의 10 개의 점, 눈꺼풀 주변의 12 개의 점, 콧 구멍 혹은 코 주변의 5개의 점, 입 주변의 20개의 점으로 구성된다.상기와 같이 설명한 68개의 점을 안면에 표시한 도면이 도 2에 개시되어 있다. 한편, 본 발명에서 객관적으로 측정하고자 하는 안면 장애 정도 혹은 얼굴 비대칭 점수는 비교 및 평가의 편의 성을 위해 Sunnybrook 점수와 같이 최소 0에서 최대 100까지의 척도를 갖도록 설정한다. 주지 혹은 공지된 바와 같이, 안면 근육은 마이크로 필라멘트의 슬라이딩 운동에 의해 수축 강도에 최대 길이 (전장 수축)의 75 %까지 길이를 감소시키는 특성을 가지게 되고, 결국 최대 강제 수축에 의한 근육의 최대 단축 은 휴식 상태의 근육의 3/4의 길이를 갖게 된다. 본 발명의 이해를 돕기 위해 도 3을 참조로 설명하면 다음과 같다. 정상 근육은 제대로 수축하면 정상근육길이의 약 1/4이 단축이 된다. 따라서 최대 수축하였을 경우 최종 길이는 a=(3w)/4로 정의될 수 있다. 비정상 근육은 수축력이 약하여 비정상근육의 길이와 수축하였을 경우의 길이가 큰 차이가 없다. 이를 차이로 나타내면 (w-b)로 정의된다. 즉, 정상근육과 비정상 근육의 수축력을 비교하려면 (w-a)와 (w-b)를 비교해야 하고, (w-a)와 (w-b)의 차이가 없다면 안면기능은 100% 장애가 없다는 의미이고, 이와 반대로 그 차이가 클수록 비정상근육의 수축력이 떨어지 는 것으로 판단되는바 안면기능 장애의 병이 더 심한 상태라고 할 수 있다. 이를 여러 비정상 근육이 해당되는 정상 근육과의 차이를 합하여 평균치를 낸 것이 F인데, 결과적으로 F는 22개 의 안면근육의 비정상 근육의 수축력을 정상측과 비교하여 수축력의 차이의 평균치가 되므로 비정상적인 안면근 육의 기능을 반영한다고 할 수 있다. 이를 수식으로 표현하면 다음과 같은데, D는 실제 수축해야 하는 길이에서 수축하지 못한 거리를 의미하며, 아 래와 같이 정의된다. 한편, 본 발명의 시간의 순서에 따른 제어로직 과정을 설명하면 다음과 같다. (a)실제 수축해야 하는 근육의 길이에서 수축하지 못한 근육의 길이를 하기의 식으로 측정하는 단계, (b)설정된 갯수의 안면근육의 비정상 근육의 수축력을 정상근육의 수축력과의 차이에 의한 평균값을 구하는 단계, (c)설정 된 갯수의 안면근육 이외에 안면의 다른 곳에서 움직인 근육의 길이를 고려하여 보정하는 단계, (d)비정상 근육 의 길이와 상기 (c)단계의 이차현상을 고려하는 단계, (e)최종 안면근육의 기능을 측정하기 위한 판단식을 제공 하는 단계를 포함한다. 이 중 (a) 단계는 하기의 식으로 정의된다. D=[(b-a)/w]x100=[(b-a)/(4a/3)]x100 또한, (b) 단계는 하기의 식으로 정의되는데, F는 안면기능을 100점 만점으로 해야 하는바, 아래와 같이 정의될 수 있다. F=100-d=100-[(b-a)/(4a/3)]x100=[(7a-3b)/4a]X100 그런데 실제로 22개의 근육 중에 원치 않게 혹은 무의식적으로 다른 위치에서 움직이는 근육이 생기게 되는데 이를 이차현상이라고 한다. 이러한 이차현상이 있으면 실제로 더 안면기능이 떨어지는 것이기 때문에 이차현상에 의해 움직이는 근육의 길 이를 빼야 정확하고도 객관적인 안면기능을 반영한다고 할 수 있다.(도 4 참조)이를 고려하여 상기 (c)와 상기 (d) 단계의 판단시 하기의 식을 이용한다. 즉, 이차현상으로 수축되는 비정상 근육의 길이의 비율은 아래와 같이 정의된다. S=[(p-p’)/(p/4)]X100=4[1-(p’/p)]X100 이에 의한다면 이차현상으로 추가되어 수축되는 비정상 근육의 길이는 아래와 같이 정의된다. L=(a/4)XS=a[1-(p’/p)]X100 결과적으로 이차현상까지 고려한 b'의 길이는 아래와 같이 정의되고, b’=b+L=b+a[1-(p’/p)]X100 그 결과, 최종 안면근육의 기능은 아래와 같이 정의된다. F’=(7a-3b’)/4a]X100=(43.75/a)-75{b+a[1-(p’/p)]X100}/a 이하, 위에서 설명한 본 발명의 기술적 특징에 대해 보완하여 설명하면 다음과 같다.(도 5 내지 도 13) 기 설명한 바와 같이, 얼굴 비대칭 점수 혹은 안면기능 장애 정도를 측정하기 위해서는 객관적인 수학 함수가 필요하다. 본 발명에서 제시되는 안면기능 장애 정도를 나타내는 알고리즘 혹은 수학식의 유용성을 평가하기 위해 안면 마 비 분야의 전문의가 평가 한 Sunnybrook 점수와 비교하였다. 일 예로, 눈썹 운동의 경우, 눈썹 관련 얼굴 표정을 만들기 위해서는 한 쌍의 이마 근육, procerus 근육(눈살근, 비근근), orbicularis oculi 근육(눈둘레근, 안륜근), 그리고 골수 supercilii 근육(눈썹주름근, 추미근) 등이 협력한다. 그러나 눈꺼풀 주변의 표정을 만들기 위해서는 훨씬 더 많은 근육이 필요하다. 예를들어, 약간의 눈을 감는 경우에는 orbicularis oculi muscle(눈둘레근, 안륜근)의 기능만이 필요하나, 눈의 감는 정도의 강도가 증가함에 따라, 관련된 근육이 증가하여 이로 인해 입 주위 근육의 강도가 증가된다. 이에 본 발명에서는 특별한 상황에서 사용되는 전체 근육보다 얼굴 표정에 주로 사용되는 근육만 포함하여 결정 하고, 이에 관한 분석을 하였다. 한편, 눈꺼풀 움직임을 평가하기 위해서는 한 쌍의 이마근육, orbicularis oculi muscle(눈둘레근, 안륜근), procerus muscle(눈살근), corrugator supercilii muscle(눈썹주름근, 추미근), nasalis muscle(코근), levator labii superioris muscle(위입술올림근, 상순거근), depressor supercili muscle(미모하체근) and zygomaticus minor muscle(소협골근)이 필요하다. 또한, 입의 움직임은 다양한 얼굴 표정을 만들기 위해 더 복잡한 패턴과 더 많은 근육을 가지고 있는데, 눈꺼풀 주위뿐만 아니라 입 주위의 근육 전체를 포함한다. 그러나, 해당 부위에서는 paired forehead muscle, orbicularis oculi muscle, procerus muscle, corrugator supercilii muscle, nasalis muscle와 같은 근육들은 직접적인 영향이 아닌바 제외하였다. 한편, 콧 구멍 주변 부위에서는 the muscles of nasalis, levator labii superioris muscle, orbicularis oculi muscle, and zygomaticus minor muscle 등을 고려하여 4개의 점을 책정하였다. 얼굴에 지정된 모든 지점은 주로 일상 생활에서 사용되는 표정에 따라 선이 표시되었고, 휴식 상태, 눈을 약간 감은 상태, 눈을 타이트하게 감은 상태에서 ,“e”라고 말하고,“o”라고 말하고, 위로 보고, 으르렁 거리게 하 였다. 이를 통해 각각의 개별 얼굴 표정에 사용 된 벡터를 고려하여, 선을 만들고 거리를 계산하여 양쪽을 비교하였다.상기와 같은 본 발명에 의한다면, 안면 장애를 객관적으로 진단하는 평가 알고리즘이 적용된 장비 혹은 프로그 램에 의해 임상적으로 섬세하고 정확한 치료에 기여할 수 있게 된다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2020-0112783", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 개략적인 전체 구성도, 도 2 내지 도 13은 본 발명에서 최종적으로 구현된 안면 장애 진단 로직이 도출되기 위해 필요한 가정 및 설명 하기 위한 도면이다."}
