{"patent_id": "10-2022-0178058", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0098182", "출원번호": "10-2022-0178058", "발명의 명칭": "인공신경망 모델들을 변경할 수 있는 신경 프로세싱 유닛", "출원인": "주식회사 딥엑스", "발명자": "김유준"}}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "NPU(neural processing unit)로서,제1 인공신경망모델의 합성곱 연산 및 상기 제1 인공신경망모델과 상이한 아키텍처를 가지는 제2 인공신경망모델의 합성곱 연산을 수행하도록 구성된, 다수의 PE들(processing elements);상기 제1 인공신경망모델과 상기 제2 인공신경망모델의 데이터의 적어도 일부(portion)를 저장하도록 구성된 메모리; 그리고결정 데이터에 기초하여, 상기 제1 인공신경망모델의 합성곱 연산 또는 상기 제2 인공신경망모델의 합성곱 연산이 선택적으로 수행될 수 있도록, 상기 다수의 PE들과 그리고 상기 메모리를 제어하도록 구성된 제어부를 포함하고,상기 결정 데이터는, 상기 제1 인공신경망모델과 상기 제2 인공신경망모델의 객체 감지 성능 데이터를 각각 포함하는, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제1 인공신경망모델과 상기 제2 인공신경망모델 각각의 객체 감지 성능 데이터는 적어도하나의 환경 상황(environmental condition) 하에서 결정되는, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 제1 인공신경망모델과 상기 제2 인공신경망모델 각각의 객체 감지 성능 데이터는 이미지의 사이즈 또는 이미지 내에서 객체의 사이즈에 기초하여 결정되는, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 제어부는 상기 결정 데이터에 기초하여 제어 신호를 생성하도록 구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 결정 데이터는비행 고도, 해수면으로부터의 높이 또는 지면으로부터의 높이에 대한 정보, 또는 이미지의 사이즈 또는 이미지내에서 객체의 사이즈에 대한 정보를 포함하는, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 다수의 PE들은 상기 제어부의 제어에 따라 상기 제1 인공신경망모델의 합성곱 연산을 일시 정지(pause) 또는 비활성화(deactivate)한 후, 상기 제2 인공신경망모델의 합성곱 연산을 개시하거나, 또는상기 제어부의 제어에 따라 상기 제2 인공신경망모델의 합성곱 연산을 일시 정지한 후, 상기 제1 인공신경망모델의 합성곱 연산을 개시하도록 구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 다수의 PE들은상기 제어부의 제어에 따라 상기 제1 인공신경망모델의 합성곱 연산을 수행하는 제1 부분과; 그리고상기 제어부의 제어에 따라 상기 제2 인공신경망모델의 합성곱 연산을 수행하는 제2 부분을 포함하는, NPU.공개특허 10-2024-0098182-3-청구항 8 제7항에 있어서, 상기 제어부의 제어에 따라 상기 다수의 PE들 중에서 상기 제1 부분이 최소화되거나 또는 없어지고 그리고 상기다수의 PE들 중에서 상기 제2 부분이 생성되도록 구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 제어 신호에 기초하여, 상기 다수의 PE들 중에서 상기 제2 부분이 최소화되거나 또는 없어지고 그리고 상기 다수의 PE들 중에서 상기 제1 부분이 최대화되도록 구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "NPU(neural processing unit)로서,제1 인공신경망모델의 합성곱 연산 및 제2 인공신경망모델의 합성곱 연산을 수행하도록 구성된, 다수의 PE들(processing elements);상기 제1 인공신경망모델과 상기 제2 인공신경망모델의 데이터의 적어도 일부(portion)를 저장하도록 구성된 메모리; 그리고이미지의 사이즈 또는 이미지 내에서 객체의 사이즈에 기초하여, 상기 제1 인공신경망모델의 합성곱 연산 또는상기 제2 인공신경망모델의 합성곱 연산이 선택적으로 수행될 수 있도록, 상기 다수의 PE들과 그리고 상기 메모리를 제어하도록 구성된 제어부를 포함하는, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 다수의 PE들은상기 제어부의 제어에 따라 상기 제1 인공신경망모델의 합성곱 연산을 수행하는 제1 부분과; 그리고상기 제어부의 제어에 따라 상기 제2 인공신경망모델의 합성곱 연산을 수행하는 제2 부분을 포함하는, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 다수의 PE들은 상기 제어부의 제어에 따라 상기 제1 인공신경망모델의 합성곱 연산을 일시 정지(pause) 또는 비활성화(deactivate)한 후, 상기 제2 인공신경망모델의 합성곱 연산을 개시하거나, 또는상기 제어부의 제어에 따라 상기 제2 인공신경망모델의 합성곱 연산을 일시 정지한 후, 상기 제1 인공신경망모델의 합성곱 연산을 개시하도록 구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "NPU(neural processing unit)로서,제1 인공신경망 모델과 제2 인공신경망모델을 포함하는 다수의 인공신경망모델들 중에서 적어도 하나의 인공신경망모델과 관련된 정보를 저장하는, 메모리; 및상기 적어도 하나의 인공신경망모델의 합성곱 연산을 수행하는, 다수의 PE들(processing elements)을 포함하고,상기 다수의 인공신경망모델들은 하나 또는 복수의 카메라로부터 획득된 하나 또는 복수의 이미지들을 입력으로사용하도록 구성되고,상기 다수의 PE들 중에서 제1 부분은, 상기 제1 인공신경망모델을 위한 제1 연산을 수행하도록 할당되도록 구성되고,공개특허 10-2024-0098182-4-상기 다수의 PE들 중에서 제2 부분은, 상기 제2 인공신경망모델을 위한 제2 연산을 수행하도록 할당되도록 구성되고, 그리고상기 제1 부분과 상기 제2 부분은 결정 데이터에 기초한 제어 신호에 따라 순차적으로 또는 동시에 결정되도록구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 제어 신호는상기 다수의 PE들에게 상기 제1 부분과 상기 제2 부분 간의 스위칭을 수행하도록 명령하는데 사용되도록구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서, 상기 제어 신호는상기 다수의 PE들이 상기 제2 부분을 생성하거나 또는 최소화시키거나 또는 없애도록(disappear) 명령하는데 사용되도록 구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서, 상기 제어 신호는 제1 이벤트에 기초하여 생성되도록 구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 비행 고도, 해수면으로부터의 높이 또는 지면으로부터의 높이가 임의의 상한 임계값 보다 크다고 측정되는경우, 또는상기 하나 또는 복수의 이미지 내의 객체가 임의의 하한 임계값 보다 작다고 측정되는 경우, 상기 제1 이벤트가 발생하도록 구성된, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서, 상기 제1 인공신경망모델은 저 전력 소모를 위해 설정되고, 그리고 상기 제2 인공신경망모델은 상기 제1 인공신경망모델 보다는 높은 전력 소모를 위해 설정되는, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서, 상기 제어 신호에 기초하여, 상기 다수의 PE들 중에서 상기 제1 부분이 최소화되거나 또는 없어지고 그리고 상기 다수의 PE들 중에서 상기 제2 부분이 생성되는, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항에 있어서, 상기 제어 신호에 기초하여, 상기 다수의 PE들 중에서 상기 제2 부분이 최소화되거나 또는 없어지고 그리고 상기 다수의 PE들 중에서 상기 제1 부분이 최대화되는, NPU."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "NPU(neural processing unit) 구동 방법으로서,다수의 PE들(processing elements) 중 제1 그룹의 PE들을 이용하여 제1 인공신경망 모델을 연산하는 단계와; 그리고결정 데이터에 기초한 제어 신호에 따라 상기 다수의 PE들 중에서 제2 그룹의 PE들을 이용하여, 제2 인공신경망모델을 연산하는 단계를 포함하고,상기 제1 인공신경망모델의 연산과 상기 제2 모델의 연산은 순차적으로 또는 동시에 진행되는, NPU 구동 방법.공개특허 10-2024-0098182-5-청구항 22 제21항에 있어서, 상기 다수의 PE들을 상기 제1 그룹의 PE들과 상기 제2 그룹의 PE들로 분할하는 단계를 더 포함하는, NPU 구동방법."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제21항에 있어서, 상기 제1 그룹의 PE들의 개수와 상기 제2 그룹의 PE들의 개수를 각각 조정하는 단계를 더 포함하는, NPU 구동 방법."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제21항에 있어서, 상기 다수의 PE들 중에서 상기 제1 그룹의 PE들의 개수가 감소되고 그리고 상기 제2 그룹의 PE들의 개수가 증가되는, NPU 구동 방법."}
{"patent_id": "10-2022-0178058", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제21항에 있어서, 상기 다수의 PE들 중에서 상기 제2 그룹의 PE들의 개수가 감소되고 그리고 상기 제1 그룹의 PE들의 개수가 증가되는, NPU 구동 방법."}
{"patent_id": "10-2022-0178058", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 예시에 따르면, NPU(neural processing unit)가 제시된다. 상기 NPU는 제1 인공신경망 모델의 합 성곱 연산 및 상기 제1 인공신경망모델과 상이한 아키텍처를 가지는 제2 인공신경망모델의 합성곱 연산을 수행하 는, 다수의 PE들(processing elements); 상기 제1 인공신경망모델과 상기 제2 인공신경망모델의 데이터의 적어도 일부(portion)를 저장하는 메모리; 그리고 결정 데이터에 기초하여, 상기 제1 인공신경망모델의 합성곱 연산 또 는 상기 제2 인공신경망모델의 합성곱 연산이 선택적으로 수행될 수 있도록, 상기 다수의 PE들과 그리고 상기 메 모리를 제어하는 제어부를 포함할 수 있다. 상기 결정 데이터는, 상기 제1 인공신경망모델과 상기 제2 인공신경 망모델의 객체 감지 성능 데이터를 각각 포함할 수 있다."}
{"patent_id": "10-2022-0178058", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 고정된 기기 또는 이동가능한 기기에 장착되고, 인공지능 반도체를 탑재한 전자 장치에 관한 것이다."}
{"patent_id": "10-2022-0178058", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에는 인공지능 반도체를 탑재한 전자 장치에 관한 연구가 진행되고 있다. 이동가능한 기기에는 대표적으로 자율주행 자동차, 로봇(robot) 또는 드론(drone) 등이 있다. 예를 들면, 드론 은 조종사 없이 자율 비행 또는 무선 전파의 유도에 의해 비행 및 조종이 가능한 비행기나 헬리콥터 모양의 무 인항공기(UAV: unmanned aerial vehicle/uninhabited aerial vehicle)을 총칭한다. 드론은 군사용 및 산업용으로 영역을 확장하면서 다양한 분야에 활용되고 있다."}
{"patent_id": "10-2022-0178058", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "객체 인식 및 추적 정확도는 객체의 크기 및 속도에 따라 상이해질 수 있다. 이에, 고정된 기기 또는 이동가능 한 기기는 다양한 환경과 조건에서 객체 인식 및 추적의 정확도를 향상시킬 수 있어야 한다. 이동가능한 기기는 기기의 이동 속도에 비례하여 빠른 판단을 해야 한다. 따라서 이동가능한 기기는 기기의 빠 른 속도에 대응되는 처리속도를 가지는 인공지능 시스템을 필요로 한다. 이동가능한 기기는 먼 거리의 물체를 인식할 수 있어야 한다. 따라서 이동가능한 기기는 먼 거리의 물체를 효과 적으로 인식할 수 있는 인공지능 시스템을 필요로 한다. 이동가능한 기기는 장시간 비행할 수 있어야 한다. 따라서 이동가능한 기기는 저전력으로 구동 가능한 인공지능 시스템을 필요로 한다. 따라서, 본 개시의 예시는 전술한 문제점을 해결하고자, 인공지능 시스템을 탑재한 고정된 또는 이동가능한 기 기를 제시하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0178058", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 예시에 따르면, NPU(neural processing unit)가 제시된다. 상기 NPU는 제1 인공신경망 모델의 합 성곱 연산 및 상기 제1 인공신경망모델과 상이한 아키텍처를 가지는 제2 인공신경망모델의 합성곱 연산을 수행 하도록 구성된, 다수의 PE들(processing elements); 상기 제1 인공신경망모델과 상기 제2 인공신경망모델의 데 이터의 적어도 일부(portion)를 저장하도록 구성된 메모리; 그리고 결정 데이터에 기초하여, 상기 제1 인공신경 망모델의 합성곱 연산 또는 상기 제2 인공신경망모델의 합성곱 연산이 선택적으로 수행될 수 있도록, 상기 다수 의 PE들과 그리고 상기 메모리를 제어하는 제어부를 포함할 수 있다. 상기 결정 데이터는, 상기 제1 인공신경망 모델과 상기 제2 인공신경망모델의 객체 검출 성능 데이터를 각각 포함할 수 있다. 상기 제1 인공신경망모델과 상기 제2 인공신경망모델 각각의 객체 감지 성능 데이터는 적어도 하나의 환경 상황 (environmental condition) 하에서 결정될 수 있다. 상기 제1 인공신경망모델과 상기 제2 인공신경망모델 각각의 객체 감지 성능 데이터는 이미지의 사이즈 또는 이 미지 내에서 객체의 사이즈에 기초하여 결정될 수 있다. 상기 제어부는 상기 결정 데이터에 기초하여 제어 신호를 생성하도록 구성될 수 있다. 상기 결정 데이터는: 비행 고도, 해수면으로부터의 높이 또는 지면으로부터의 높이에 대한 정보, 또는 이미지의 사이즈 또는 이미지 내에서 객체의 사이즈에 대한 정보를 포함할 수 있다. 상기 다수의 PE들은: 상기 제어부의 제어에 따라 상기 제1 인공신경망모델의 합성곱 연산을 일시 정지(pause) 또는 비활성화(deactivate)한 후, 상기 제2 인공신경망모델의 합성곱 연산을 개시하거나, 또는 상기 제어부의 제어에 따라 상기 제2 인공신경망모델의 합성곱 연산을 일시 정지한 후, 상기 제1 인공신경망모델의 합성곱 연 산을 개시하도록 구성될 수 있다. 상기 다수의 PE들은: 상기 제어부의 제어에 따라 상기 제1 인공신경망모델의 합성곱 연산을 수행하는 제1 부분 과; 그리고 상기 제어부의 제어에 따라 상기 제2 인공신경망모델의 합성곱 연산을 수행하는 제2 부분을 포함할 수 있다. 상기 제어부의 제어에 따라 상기 다수의 PE들 중에서 상기 제1 부분이 최소화되거나 또는 없어지고 그리고 상기 다수의 PE들 중에서 상기 제2 부분이 생성되도록 구성될 수 있다. 상기 제어 신호에 기초하여, 상기 다수의 PE들 중에서 상기 제2 부분이 최소화되거나 또는 없어지고 그리고 상 기 다수의 PE들 중에서 상기 제1 부분이 최대화되도록 구성될 수 있다. 본 개시의 다른 일 예시에 따르면, NPU가 또한 제시된다. 상기 NPU(neural processing unit)는, 제1 인공신경 망모델의 합성곱 연산 및 제2 인공신경망모델의 합성곱 연산을 수행하도록 구성된, 다수의 PE들(processing elements); 상기 제1 인공신경망모델과 상기 제2 인공신경망모델의 데이터의 적어도 일부(portion)를 저장하도 록 구성된 메모리; 그리고 이미지의 사이즈 또는 이미지 내에서 객체의 사이즈에 기초하여, 상기 제1 인공신경 망모델의 합성곱 연산 또는 상기 제2 인공신경망모델의 합성곱 연산이 선택적으로 수행될 수 있도록, 상기 다수 의 PE들과 그리고 상기 메모리를 제어하도록 구성된 제어부를 포함할 수 있다. 상기 다수의 PE들은: 상기 제어부의 제어에 따라 상기 제1 인공신경망모델의 합성곱 연산을 수행하는 제1 부분 과; 그리고 상기 제어부의 제어에 따라 상기 제2 인공신경망모델의 합성곱 연산을 수행하는 제2 부분을 포함할 수 있다. 상기 다수의 PE들은: 상기 제어부의 제어에 따라 상기 제1 인공신경망모델의 합성곱 연산을 일시 정지(pause) 또는 비활성화(deactivate)한 후, 상기 제2 인공신경망모델의 합성곱 연산을 개시하거나, 또는 상기 제어부의 제어에 따라 상기 제2 인공신경망모델의 합성곱 연산을 일시 정지한 후, 상기 제1 인공신경망모델의 합성곱 연 산을 개시하도록 구성될 수 있다. 본 개시의 다른 일 예시에 따르면, NPU가 또한 제시된다. 상기 NPU는 제1 인공신경망모델과 제2 인공신경망모델 을 포함하는 다수의 인공신경망모델들 중에서 적어도 하나의 인공신경망모델과 관련된 정보를 저장하는, 메모 리를 포함할 수 있다. 상기 NPU는 상기 적어도 하나의 인공신경망모델의 합성곱 연산을 수행하는, 다수의 PE들 (processing elements)을 포함할 수 있다. 상기 다수의 인공신경망모델들은 하나 또는 복수의 카메라로부터 획 득된 하나 또는 복수의 이미지들을 입력으로 사용하도록 구성될 수 있다. 상기 다수의 PE들 중에서 제1 부분은, 상기 제1 인공신경망모델을 위한 제1 연산을 수행하도록 할당되도록 구성될 수 있다. 상기 다수의 PE들 중에서 제2 부분은, 상기 제2 인공신경망모델을 위한 제2 연산을 수행하도록 할당되도록 구성될 수 있다. 상기 제1 부 분과 상기 제2 부분은 결정 데이터에 기초한 제어 신호에 따라 순차적으로 또는 동시에 결정되도록 구성될 수있다. 상기 제어 신호는: 상기 다수의 PE들에게 상기 제1 부분과 상기 제2 부분 간의 스위칭을 수행하도록 명령하는데 사용되도록 구성될 수 있다. 상기 제어 신호는: 상기 다수의 PE들이 상기 제2 부분을 생성하거나 또는 최소화시키거나 또는 없애도록 (disappear) 명령하는데 사용되도록 구성될 수 있다. 상기 제어 신호는 제1 이벤트에 기초하여 생성되도록 구성될 수 있다. 비행 고도, 해수면으로부터의 높이 또는 지면으로부터의 높이가 임의의 상한 임계값 보다 크다고 측정되는 경우, 또는 상기 하나 또는 복수의 이미지 내의 객체가 임의의 하한 임계값 보다 작다고 측정되는 경우, 상기 제1 이벤트가 발생하도록 구성될 수 있다. 상기 제1 인공신경망모델은 저 전력 소모를 위해 설정되고, 그리고 상기 제2 인공신경망모델은 상기 제1 인공신 경망모델 보다는 높은 전력 소모를 위해 설정될 수 있다. 상기 제어 신호에 기초하여, 상기 다수의 PE들 중에서 상기 제1 부분이 최소화되거나 또는 없어지고 그리고 상 기 다수의 PE들 중에서 상기 제2 부분이 생성될 수 있다. 상기 제어 신호에 기초하여, 상기 다수의 PE들 중에서 상기 제2 부분이 최소화되거나 또는 없어지고 그리고 상 기 다수의 PE들 중에서 상기 제1 부분이 최대화될 수 있다. 본 개시의 다른 일 예시에 따르면, NPU(neural processing unit) 구동 방법이 제시된다. 상기 방법은 다수의 PE 들(processing elements) 중 제1 그룹의 PE들을 이용하여 제1 인공신경망 모델을 연산하는 단계와; 그리고 결정 데이터에 기초한 제어 신호에 따라 상기 다수의 PE들 중에서 제2 그룹의 PE들을 이용하여, 제2 인공신경망모델 을 연산하는 단계를 포함할 수 있다. 상기 제1 인공신경망모델의 연산과 상기 제2 모델의 연산은 순차적으로 또 는 동시에 진행될 수 있다. 상기 방법은 상기 다수의 PE들을 상기 제1 그룹의 PE들과 상기 제2 그룹의 PE들로 분할하는 단계를 더 포함할 수 있다. 상기 방법은 상기 제1 그룹의 PE들의 개수와 상기 제2 그룹의 PE들의 개수를 각각 조정하는 단계를 더 포함할 수 있다. 상기 조정에 따라, 상기 다수의 PE들 중에서 상기 제1 그룹의 PE들의 개수가 감소되고 그리고 상기 제2 그룹의 PE들의 개수가 증가될 수 있다. 상기 조정에 따라, 상기 다수의 PE들 중에서 상기 제2 그룹의 PE들의 개수가 감소되고 그리고 상기 제1 그룹의 PE들의 개수가 증가될 수 있다."}
{"patent_id": "10-2022-0178058", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 예시들에 따르면, 피사체를 카메라를 이용하여 높은 신뢰도로 감지 내지 추적할 수 있다. 보다 구체 적으로, 이동 가능한 기기의 고도가 상승되는 경우, 피사체가 상당히 작게 촬영되게 되기 때문에, 감지 또는 추 적 정확도가 낮아질 수 있는 단점이 있다. 그러나 본 개시의 예시들에 따르면, 고도가 상승하는 경우에도, 감지 또는 추적의 정확도를 향상시킬 수 있다."}
{"patent_id": "10-2022-0178058", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 예시들의 특정한 구조적 내지 단계적 설명들은 단지 본 개시의 개념에 따른 예시를 설명하기 위한 것 이다. 따라서 본 개시의 개념에 따른 예시들은 다양한 형태로 실시될 수 있다. 본 개시의 개념에 따른 예시들은 다양한 형태로 실시될 수 있다. 본 개시는 본 개시의 예시들에 한정되는 것으로 해석되어서는 아니 된다. 본 개시의 개념에 따른 예시에 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있다. 이에, 특정 예시들 을 도면에 예시하고 본 개시 또는 출원에 대해서 상세하게 설명하고자 한다. 그러나, 이는 본 개시의 개념에 따 른 예시를 특정한 개시 형태에 대해 한정하려는 것이 아니다. 본 개시의 개념에 따른 여시는 본 개시의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1 및/또는 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용 어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으 로만 사용될 수 있다. 상기 용어들은 본 개시의 개념에 따른 권리 범위로부터 이탈되지 않은 채, 제1 구성요소 는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있다. 하지만 복수의 구성요소들 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거 나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성요소들 간의 관계를 설명하는 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 이웃하는\"과 \"~ 에 직접 이웃하는\" 등도 마찬가지로 해석되어야 한다. 본 개시에서 사용한 용어는 단지 특정한 예시를 설명하기 위해 사용된 것으로, 본 개시를 한정하려는 의도가 아 니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시에서, \"포함하 다\" 또는 \"가지다\" 등의 용어는 서술된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존 재함을 지정하려는 것이다. 따라서 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미 를 가지는 것으로 해석되어야 한다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 본 개시에 서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 예시를 설명함에 있어서 본 개시가 속하는 기술 분야에 익히 알려져 있고 본 개시와 직접적으로 관련이 없는 기 술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 개시의 요지를 흐리지 않고 더욱 명확히 전달하기 위함이다. <용어의 정의> 이하, 본 개시에서 제시되는 개시들의 이해를 돕고자, 본 개시에서 사용되는 용어들에 대하여 간략하게 정리하 기로 한다. NPU: 신경망 프로세싱 유닛(Neural Processing Unit)의 약어로서, CPU(Central processing unit)과 별개로 인 공신경망모델의 연산을 위해 특화된 프로세서를 의미할 수 있다. ANN: 인공신경망(artificial neural network)의 약어로서, 인간의 지능을 모방하기 위하여, 인간 뇌 속의 뉴런 들(Neurons)이 시냅스(Synapse)를 통하여 연결되는 것을 모방하여, 노드들을 레이어(Layer: 계층) 구조로 연결 시킨, 네트워크를 의미할 수 있다. DNN: 심층 신경망(Deep Neural Network)의 약어로서, 보다 높은 인공 지능을 구현하기 위하여, 인공신경망의 은 닉 레이어의 개수를 늘린 것을 의미할 수 있다. CNN: 컨볼루션 신경망(Convolutional Neural Network)의 약어로서, 인간 뇌의 시각 피질에서 영상을 처리하는 것과 유사한 기능을 하는 신경망이다. 컨볼루션 신경망은 영상처리에 적합한 것으로 알려져 있으며, 입력 데이 터의 특징들을 추출하고, 특징들의 패턴을 파악하기에 용이한 것으로 알려져 있다. 이하, 첨부한 도면을 참조하여 본 개시의 바람직한 예시를 설명함으로써, 본 개시를 상세히 설명한다. 이하, 본 개시의 예시를 첨부된 도면을 참조하여 상세하게 설명한다. <인공지능> 인간은 인식(Recognition), 분류(Classification), 추론(Inference), 예측(Predict), 조작/의사결정 (Control/Decision making) 등을 할 수 있는 지능을 갖추고 있다. 인공지능(artificial intelligence: AI)은 인간의 지능을 인공적으로 모방하는 것을 의미한다. 인간의 뇌는 뉴런(Neuron)이라는 수많은 신경세포로 이루어져 있다. 각각의 뉴런은 시냅스(Synapse)라고 불리는 연결부위를 통해 수백에서 수천 개의 다른 뉴런들과 연결되어 있다. 인간의 지능을 모방하기 위하여, 생물학적 뉴런의 동작원리와 뉴런 간의 연결 관계를 모델링한 것을, 인공신경망모델이라고 한다. 즉, 인공신경망은 뉴런 들을 모방한 노드들을 레이어(Layer: 계층) 구조로 연결시킨, 시스템이다. 이러한 인공신경망모델은 레이어 수에 따라 '단층 신경망'과 '다층 신경망'으로 구분한다. 일반적인 다층신경망 은 입력 레이어와 은닉 레이어, 출력 레이어로 구성된다. 입력 레이어(input layer)은 외부의 자료들을 받 아들이는 레이어로서, 입력 레이어의 뉴런 수는 입력되는 변수의 수와 동일하다. 은닉 레이어(hidden layer)은 입력 레이어와 출력 레이어 사이에 위치하며 입력 레이어로부터 신호를 받아 특성을 추출하여 출력층 으로 전달한다. 출력 레이어(output layer)은 은닉 레이어로부터 신호를 받아 외부로 출력한다. 뉴런 간의 입력신호는 0에서 1 사이의 값을 갖는 각각의 연결강도와 곱해진 후 합산된다. 이 합이 뉴런의 임계치보다 크면 뉴런이 활성화되어 활성화 함수를 통하여 출력 값으로 구현된다. 한편, 보다 높은 인공 지능을 구현하기 위하여, 인공신경망의 은닉 레이어의 개수를 늘린 것을 심층 신경망 (Deep Neural Network, DNN)이라고 한다. DNN은 다양한 구조로 개발되고 있다. 예를 들면, DNN의 일 예시인 합성곱 신경망(convolutional neural network, CNN)은 입력 값 (영상 또는 이미지)의 특징들을 추출하고, 추출된 출력 값의 패턴을 파악하기에 용이 한 것으로 알려져 있다. CNN은 합성곱 연산, 활성화 함수 연산, 풀링(pooling) 연산 등이 특정 순서로 처리되는 형태로 구성될 수 있다. 예를 들면, DNN의 레이어 각각에서, 파라미터(i.e., 입력 값, 출력 값, 가중치 또는 커널 등)는 복수의 채널로 구성된 행렬일 수 있다. 파라미터는 합성곱 또는 행렬 곱셈으로 NPU에서 처리될 수 있다. 각 레이어에서 연산이 처리된 출력 값이 생성된다. 예를 들면, 트랜스포머(transformer)는 어텐션(attention) 기술에 기반한 DNN이다. 트랜스포머는 행렬 곱셈 (matrix multiplication) 연산을 다수 활용한다. 트랜스포머는 입력 값과 쿼리(query; Q), 키(key; K), 및 값 (value; V) 등의 파라미터를 사용하여 출력 값인 어텐션(Q,K,V)를 획득할 수 있다. 트랜스포머는 출력 값 (즉, 어텐션(Q,K,V))에 기초하여 다양한 추론 연산을 처리할 수 있다. 트랜스포머는 CNN 보다 더 우수한 추론 성능을 보여주는 경향이 있다. 도 1은 예시적인 인공신경망모델을 설명하는 개략적인 개념도이다. 이하 신경망 프로세싱 유닛에서 작동될 수 있는 예시적인 인공신경망모델(110a)의 연산에 대하여 설명한다. 도 1의 예시적인 인공신경망모델(110a)은 객체 인식, 음성 인식 등 다양한 추론 기능을 수행하도록 학습된 인공 신경망일 수 있다. 인공신경망모델(110a)은 심층 신경망(DNN, Deep Neural Network)일 수 있다. 단, 본 개시의 예시들에 따른 인공신경망모델(110a)은 심층 신경망에 제한되지 않는다. 예를 들어, 인공신경망모델(110a)은 Transformer, YOLO, CNN, PIDNet, BiseNet, RCNN, VGG, VGG16, DenseNet, SegNet, DeconvNet, DeepLAB V3+, U-net, SqueezeNet, Alexnet, ResNet18, MobileNet-v2, GoogLeNet, Resnet- v2, Resnet50, Resnet101, Inception-v3 등의 모델로 구현될 수 있다. 단, 본 개시는 상술한 모델들에 제한되 지 않는다. 또한 인공신경망모델(110a)은 적어도 두 개의 서로 다른 모델들에 기초한 앙상블 모델일 수도 있다. 이하 예시적인 인공신경망모델(110a)에 의해서 수행되는 추론 과정에 대해서 설명하기로 한다. 인공신경망모델(110a)은 입력 레이어(110a-1), 제1 연결망(110a-2), 제1 은닉 레이어(110a-3), 제2 연결망 (110a-4), 제2 은닉 레이어(110a-5), 제3 연결망(110a-6), 및 출력 레이어(110a-7)을 포함하는 예시적인 심층 신경망 모델이다. 단, 본 개시는 도 1에 도시된 인공신경망모델에만 제한되는 것은 아니다. 제1 은닉 레이어 (110a-3) 및 제2 은닉 레이어(110a-5)는 복수의 은닉 레이어로 지칭되는 것도 가능하다. 입력 레이어(110a-1)는 예시적으로, x1 및 x2 입력 노드를 포함할 수 있다. 즉, 입력 레이어(110a-1)는 2개의 입력 값에 대한 정보를 포함할 수 있다. 제1 연결망(110a-2)은 예시적으로, 입력 레이어(110a-1)의 각각의 노드를 제1 은닉 레이어(110a-3)의 각각의 노 드로 연결시키기 위한 6개의 가중치 값에 대한 정보를 포함할 수 있다. 각각의 가중치 값은 입력 노드 값과 곱 해지고, 곱해진 값들의 누산된 값이 제1 은닉 레이어(110a-3)에 저장된다. 가중치 값과 입력 노드 값은 인공신 경망모델의 파라미터로 지칭될 수 있다. 제1 은닉 레이어(110a-3)는 예시적으로 a1, a2, 및 a3 노드를 포함할 수 있다. 즉, 제1 은닉 레이어(110a-3)는 3개의 노드 값에 대한 정보를 포함할 수 있다. 도 3의 제1 프로세싱 엘리먼트(PE1)는 a1 노드의 연산을 처리할 수 있다. 도 3의 제2 프로세싱 엘리먼트(PE2)는 a2 노드의 연산을 처리할 수 있다. 도 3의 제3 프로세싱 엘리먼트(PE3)는 a3 노드의 연산을 처리할 수 있다.제2 연결망(110a-4)은 예시적으로, 제1 은닉 레이어(110a-3)의 각각의 노드를 제2 은닉 레이어(110a-5)의 각각의 노드로 연결시키기 위한 9개의 가중치 값에 대한 정보를 포함할 수 있다. 제2 연결망(110a-4)의 가중치 값은 제1 은닉 레이어(110a-3)로부터 입력되 는 노드 값과 각각 곱해지고, 곱해진 값들의 누산된 값이 제2 은닉 레이어(110a-5)에 저장된다. 제2 은닉 레이어(110a-5)는 예시적으로 b1, b2, 및 b3 노드를 포함할 수 있다. 즉, 제2 은닉 레이어(110a-5)는 3개의 노드 값에 대한 정보를 포함할 수 있다. 도 3의 제4 프로세싱 엘리먼트(PE4)는 b1 노드의 연산을 처리할 수 있다. 도 3의 제5 프로세싱 엘리먼트(PE5)는 b2 노드의 연산을 처리할 수 있다. 도 3의 제6 프로세싱 엘리먼트(PE6)는 b3 노드의 연산을 처리할 수 있다. 제3 연결망(110a-6)은 예시적으로, 제2 은닉 레이어(110a-5)의 각각의 노드와 출력 레이어(110a-7)의 각각의 노 드를 연결하는 6개의 가중치 값에 대한 정보를 포함할 수 있다. 제3 연결망(110a-6)의 가중치 값은 제2 은닉 레 이어(110a-5)로부터 입력되는 노드 값과 각각 곱해지고, 곱해진 값들의 누산된 값이 출력 레이어(110a-7)에 저 장된다. 출력 레이어(110a-7)는 예시적으로 y1, 및 y2 노드를 포함할 수 있다. 즉, 출력 레이어(110a-7)는 2개의 노드 값에 대한 정보를 포함할 수 있다. 도 3의 제7 프로세싱 엘리먼트(PE7)는 y1 노드의 연산을 처리할 수 있다. 도 3의 제8 프로세싱 엘리먼트(PE8)는 y2 노드의 연산을 처리할 수 있다. 도 2a은 컨볼루션 신경망(CNN)의 기본 구조를 설명하기 위한 도면이다. 도 2a을 참조하면, 입력 이미지는 특정 사이즈(size)의 행과 특정 사이즈의 열로 구성된 2차원적 행렬로 표시될 수 있다. 입력 이미지는 복수의 채널을 가질 수 있는데, 여기서 채널은 입력 데이터 이미지의 컬러 성분의 수를 나타낼 수 있다. 컨볼루션 과정은 입력 이미지를 지정된 간격으로 순회하면서 커널과 합성곱 연산을 수행하는 것을 의미한다. 컨볼루션 신경망은 현재 레이어의 출력 값(합성곱 또는 행렬 곱셈)을 다음 레이어의 입력 값으로 전달하는 구조 를 가질 수 있다. 예를 들면, 합성곱(컨볼루션)은, 두 개의 주요 파라미터(입력 특징맵 및 커널)에 의해 정의된다. 파라미터는 입 력 특징맵, 출력 특징맵, 활성화 맵, 가중치, 커널, 및 어텐션(Q,K,V) 등을 포함할 수 있다, 합성곱(컨볼루션)은 입력 특징맵 위로 커널 윈도우를 슬라이딩 한다. 커널이 입력 특징맵을 슬라이딩 하는 단차 사이즈를 보폭(stride)이라고 한다. 합성곱 이후에는 풀링(pooling)이 적용될 수 있다. 또한, 컨볼루션 신경망의 끝단에는 FC (fully-connected)레 이어가 배치될 수 있다. 도 2b는 컨볼루션 신경망의 동작을 이해하기 쉽게 나타낸 종합도이다. 도 2b을 참조하면, 예시적으로 입력 이미지가 6 x 6 크기를 갖는 2차원적 행렬인 것으로 나타나 있다. 또한, 도 2b에는 예시적으로 3개의 노드, 즉 채널 1, 채널 2, 채널 3이 사용되는 것으로 나타내었다. 먼저, 합성곱 동작에 대해서 설명하기로 한다. 입력 이미지(도 2b에서는 예시적으로 6 x 6 크기인 것으로 나타내어짐)는 첫 번째 노드에서 채널 1을 위한 커널 1(도 2b에서는 예시적으로 3 x 3 크기인 것으로 나타내어짐)과 합성곱되고, 그 결과로서 특징맵1(도 2b에서는 예시적으로 4 x 4 크기인 것으로 나타내어짐)이 출력된다. 또한, 상기 입력 이미지(도 2b에서는 예시적으로 6 x 6 크기인 것으로 나타내어짐)는 두 번째 노드에서 채널 2를 위한 커널 2(도 2b에서는 예시적으로 3 x 3 크기인 것으로 나타내어짐)와 합성곱되고 그 결과로서 특징맵 2(도 2b에서는 예시적으로 4 x 4 크기인 것으로 나타내어 짐)가 출력된다. 또한, 상기 입력 이미지는 세 번째 노드에서 채널 3을 위한 커널 3(도 2b에서는 예시적으로 3 x 3 크기인 것으로 나타내어짐)과 합성곱되고, 그 결과로서 특징맵3(도 2b에서는 예시적으로 4 x 4 크기인 것으 로 나타내어짐)이 출력된다. 각각의 합성곱을 처리하기 위해서 NPU의 프로세싱 엘리먼트들(PE1 to PE12)은 MAC 연산을 수행하도록 구성 된다. 다음으로, 활성화 함수의 동작에 대해서 설명하기로 한다. 합성곱 동작으로부터 출력되는 특징맵1, 특징맵2 그리고 특징맵3(도 2b에서는 각각의 크기는 예시적으로 4 x 4 인 것으로 나타내어짐)에 대해서 활성화 함수가 적용될 수 있다. 활성화 함수가 적용되고 난 이후의 출력은 예 시적으로 4 x 4의 크기일 수 있다. 다음으로, 폴링(pooling) 동작에 대해서 설명하기로 한다. 상기 활성화 함수로부터 출력되는 특징맵1, 특징맵2, 특징맵3(도 2b에서는 각각의 크기는 예시적으로 4 x 4인 것으로 나타내어짐)은 3개의 노드로 입력된다. 활성화 함수로부터 출력되는 특징맵들을 입력으로 받아서 폴링 (pooling)을 수행할 수 있다. 상기 폴링이라 함은 크기를 줄이거나 행렬 내의 특정 값을 강조할 수 있다. 폴링 방식으로는 최대값 폴링과 평균 폴링, 최소값 폴링이 있다. 최대값 폴링은 행렬의 특정 영역 안에 값의 최댓값 을 모으기 위해서 사용되고, 평균 폴링은 특정 영역내의 평균을 구하기 위해서 사용될 수 있다. 도 2b의 예시에서는 4 x 4 크기의 특징맵이 폴링에 의하여 2 x 2 크기로 줄어지는 것으로 나타내었다. 구체적으로, 첫 번째 노드는 채널 1을 위한 특징맵1을 입력으로 받아 폴링을 수행한 후, 예컨대 2 x 2 행렬로 출력한다. 두 번째 노드는 채널 2을 위한 특징맵2을 입력으로 받아 폴링을 수행한 후, 예컨대 2 x 2 행렬로 출 력한다. 세 번째 노드는 채널 3을 위한 특징맵3을 입력으로 받아 폴링을 수행한 후, 예컨대 2 x 2 행렬로 출력 한다. 전술한 합성곱, 활성화 함수과 폴링이 반복되고 최종적으로는, 도 8a과 같이 fully connected로 출력될 수 있다. 해당 출력은 다시 이미지 인식을 위한 인공 신경망으로 입력될 수 있다. 단, 본 개시는 특징맵, 커널의 크기에 제한되지 않는다. 지금까지 설명한 CNN은 다양한 심층신경망(DNN) 방법 중에서도 컴퓨터 비전(Vision) 분야에서 가장 많이 쓰이는 방법이다. 특히, CNN은 이미지 분류(image classification) 및 객체 검출(objection detection)과 같은 다양한 작업을 수행하는 다양한 연구 영역에서 놀라운 성능을 보였다. <CNN을 위해 필요한 하드웨어 자원> 도 3은 본 개시에 따른 신경 프로세싱 유닛을 설명하는 개략적인 개념도이다. 도 3에 도시된 신경 프로세싱 유닛(neural processing unit, NPU)은 인공신경망을 위한 동작을 수행하도록 특화된 프로세서이다. 인공신경망은 여러 입력 또는 자극이 들어오면 각각 가중치를 곱해 더해주고, 추가적으로 편차를 더한 값을 활 성화 함수를 통해 변형하여 전달하는 인공 뉴런들이 모인 네트워크를 의미한다. 이렇게 학습된 인공신경망은 입 력 데이터로부터 추론(inference) 결과를 출력하는데 사용될 수 있다. NPU는 전기/전자 회로로 구현된 반도체일 수 있다. 전기/전자 회로라 함은 수많은 전자 소자, (예컨대 트렌지스터, 커패시터)를 포함하는 것을 의미할 수 있다. Transformer 및/또는 CNN 기반의 인공신경망모델인 경우, NPU는 행렬 곱셈 연산, 합성곱 연산, 등을 인공 신경망의 구조(architecture)에 따라 선별하여, 처리할 수 있다. 예를 들어, 합성곱 신경망(CNN)의 레이어 각각에서, 입력 데이터에 해당하는 입력 특징맵(Input feature map)과 가중치(Weight)에 해당하는 커널(kernel)은 복수의 채널로 구성된 행렬일 수 있다. 입력 특징맵과 커널의 합성 곱 연산이 수행되며, 각 채널에서 합성곱 연산과 풀링 출력 특징맵(output feature map)이 생성된다. 출력 특징 맵에 활성화 함수를 적용하여 해당 채널의 활성화맵(activation map)이 생성된다. 이후, 활성화맵에 대한 풀링 이 적용될 수 있다. 여기서 포괄적으로 활성화맵은 출력 특징맵으로 지칭될 수 있다. 단, 본 개시의 예시들은 이에 제한되지 않으며, 출력 특징맵은 행렬 곱셈 연산 또는 합성곱 연산등이 적용된 것 을 의미한다. 부연 설명하면, 본 개시의 예시들에 따른 출력 특징맵은 포괄적인 의미로 해석되어야 한다. 예를 들면, 출력 특 징맵은 행렬 곱셈 연산 또는 합성곱 연산 결과값일 수 있다. 이에, 복수의 프로세싱 엘리먼트는 추가 알고 리즘을 위한 처리 회로부를 더 포함하도록 변형 실시되는 것도 가능하다. NPU는 상술한 인공신경망 연산에 필요한 합성곱 및 행렬 곱셈을 처리하기 위한 복수의 프로세싱 엘리먼트 를 포함하도록 구성될 수 있다. NPU는 상술한 인공신경망 연산에 필요한 행렬 곱셈 연산, 합성곱 연산, 활성화 함수 연산, 풀링 연산, 스 트라이드 연산, 배치 정규화 연산, 스킵 커넥션 연산, 접합 연산, 양자화 연산, 클리핑 연산, 패딩 연산에 최적 화된 각각의 처리 회로를 포함하도록 구성될 수 있다. 예를 들면, NPU는 상술한 알고리즘들 중 활성화 함수 연산, 풀링 연산, 스트라이드 연산, 배치 정규화 연 산, 스킵 커넥션 연산, 접합 연산, 양자화 연산, 클리핑 연산, 패딩 연산 중 적어도 하나를 처리하기 위한 SFU를 포함하도록 구성될 수 있다. 구체적으로, NPU는 복수의 프로세싱 엘리먼트(processing element: PE) , SFU, NPU 내부 메모 리, NPU 컨트롤러, 및 NPU 인터페이스를 포함할 수 있다. 복수의 프로세싱 엘리먼트, SFU, NPU 내부 메모리, NPU 컨트롤러, 및 NPU 인터페이스 각각은 수많은 트렌지스터들이 연결된 반도체 회로일 수 있다. 따라서, 이들 중 일부는 육안으로는 식별되어 구분되기 어려울 수 있고, 동작에 의해서만 식별될 수 있다. 예컨대, 임의 회로는 복수의 프로세싱 엘리먼트으로 동작하기도 하고, 혹은 NPU 컨트롤러로 동작될 수도 있다. NPU 컨트롤러는 NPU의 인공신경망 추론 동작을 제어하도록 구성된 제어부의 기능을 수행 하도록 구성될 수 있다. NPU는 복수의 프로세싱 엘리먼트 및 SFU에서 추론될 수 있는 인공신경망모델의 파라미터를 저장 하도록 구성된 NPU 내부 메모리, 및 복수의 프로세싱 엘리먼트, SFU, 및 NPU 내부 메모리의 연산 스케줄을 제어하도록 구성된 스케줄러를 포함하는 NPU 컨트롤러를 포함할 수 있다. NPU는 SVC 또는 SFC를 이용한 인코딩 및 디코딩 방식에 대응되어 특징맵을 처리하도록 구성될 수 있다. 복수의 프로세싱 엘리먼트는 인공신경망을 위한 동작의 일부를 수행할 수 있다. SFU는 인공신경망을 위한 동작의 다른 일부를 수행할 수 있다. NPU는 복수의 프로세싱 엘리먼트와 SFU를 사용하여 인공신경망모델의 연산을 하드웨어적으로 가 속하도록 구성될 수 있다. NPU 인터페이스는 시스템 버스를 통해서 NPU와 연결된 다양한 구성요소들, 예컨대 메모리와 통신할 수 있다. NPU 컨트롤러는 신경 프로세싱 유닛의 추론 연산을 위한 복수의 프로세싱 엘리먼트의 연산, SFU의 연산 및 NPU 내부 메모리의 읽기 및 쓰기 순서를 제어하도록 구성된 스케줄러를 포함할 수 있 다. NPU 컨트롤러 내의 스케줄러는 인공신경망모델의 데이터 지역성 정보 또는 구조에 대한 정보에 기초하여 복수의 프로세싱 엘리먼트, SFU, 및 NPU 내부 메모리를 제어하도록 구성될 수 있다. NPU 컨트롤러 내의 스케줄러는 복수의 프로세싱 엘리먼트 및 SFU에서 작동할 인공신경망모델의 구조를 분석하거나 또는 이미 분석된 정보를 제공받을 수 있다. 예를 들면, 인공신경망모델이 포함할 수 있는 인공신경망의 데이터는 각각의 레이어의 노드 데이터(즉, 특징맵), 레이어들의 배치 데이터, 지역성 정보 또는 구조에 대한 정보, 각각의 레이어의 노드를 연결하는 연결망 각각의 가중치 데이터 (즉, 가중치 커널) 중 적어 도 일부를 포함할 수 있다. 인공신경망의 데이터는 NPU 컨트롤러 내부에 제공되는 메모리 또는 NPU 내부 메모리에 저장될 수 있다. NPU 컨트롤러 내의 스케줄러는 인공신경망모델의 데이터 지역성 정보 또는 구조에 대한 정보에 기초하여 NPU가 수행할 인공신경망모델의 연산 순서를 스케줄링 할 수 있다. NPU 컨트롤러 내의 스케줄러는 인공신경망모델의 데이터 지역성 정보 또는 구조에 대한 정보에 기초하여 인공신경망모델의 레이어의 특징맵 및 가중치 데이터가 저장된 메모리 어드레스 값을 획득할 수 있다. 예를 들 면, NPU 컨트롤러 내의 스케줄러는 메모리에 저장된 인공신경망모델의 레이어의 특징맵 및 가중치 데이터 가 저장된 메모리 어드레스 값을 획득할 수 있다. 따라서 NPU 컨트롤러 내의 스케줄러는 구동할 인공신경 망모델의 레이어의 특징맵 및 가중치 데이터를 메인 메모리에서 가져와서 NPU 내부 메모리에 저장할 수 있 다. 각각의 레이어의 특징맵은 대응되는 각각의 메모리 어드레스 값을 가질 수 있다. 각각의 가중치 데이터는 대응되는 각각의 메모리 어드레스 값을 가질 수 있다. NPU 컨트롤러 내의 스케줄러는 인공신경망모델의 데이터 지역성 정보 또는 구조에 대한 정보, 예를 들면, 인공신경망모델의 인공신경망의 레이어들의 배치 데이터, 지역성 정보 또는 구조에 대한 정보에 기초해서 복수 의 프로세싱 엘리먼트의 연산 순서를 스케줄링 할 수 있다. NPU 컨트롤러 내의 스케줄러는 인공신경망모델의 데이터 지역성 정보 또는 구조에 대한 정보에 기초하여 스케줄링 하기 때문에, 일반적인 CPU의 스케줄링 개념과 다르게 동작할 수 있다. 일반적인 CPU의 스케줄링은 공 평성, 효율성, 안정성, 반응 시간 등을 고려하여, 최상의 효율을 낼 수 있도록 동작한다. 즉, 우선 순위, 연산 시간 등을 고려해서 동일 시간내에 가장 많은 프로세싱을 수행하도록 스케줄링 한다. 종래의 CPU는 각 프로세싱의 우선 순서, 연산 처리 시간 등의 데이터를 고려하여 작업을 스케줄링 하는 알고리 즘을 사용하였다. 이와 다르게 NPU 컨트롤러 내의 스케줄러는 인공신경망모델의 데이터 지역성 정보 또는 구조에 대한 정보 에 기초하여 결정된 NPU의 프로세싱 순서대로 NPU를 제어할 수 있다. 더 나아가면, NPU 컨트롤러 내의 스케줄러는 인공신경망모델의 데이터 지역성 정보 또는 구조에 대한 정보 및/또는 사용하려는 신경 프로세싱 유닛의 데이터 지역성 정보 또는 구조에 대한 정보에 기초하여 결정된 프로세싱 순서대로 NPU를 구동할 수 있다. 단, 본 개시는 NPU의 데이터 지역성 정보 또는 구조에 대한 정보에 제한되지 않는다. NPU 컨트롤러 내의 스케줄러는 인공신경망의 데이터 지역성 정보 또는 구조에 대한 정보를 저장하도록 구 성될 수 있다. 즉, NPU 컨트롤러 내의 스케줄러는 적어도 인공신경망모델의 인공신경망의 데이터 지역성 정보 또는 구조 에 대한 정보만 활용하더라도 프로세싱 순서를 결정할 수 있다. 더 나아가서, NPU 컨트롤러 내의 스케줄러는 인공신경망모델의 데이터 지역성 정보 또는 구조에 대한 정보 및 NPU의 데이터 지역성 정보 또는 구조에 대한 정보를 고려하여 NPU의 프로세싱 순서를 결정할 수 있다. 또한, 결정된 프로세싱 순서대로 NPU의 프로세싱 최적화도 가능하다. 복수의 프로세싱 엘리먼트는 인공신경망의 특징맵과 가중치 데이터를 연산하도록 구성된 복수의 프로세싱 엘리먼트들(PE1 to PE12)이 배치된 구성을 의미한다. 각각의 프로세싱 엘리먼트는 MAC (multiply and accumulate) 연산기 및/또는 ALU (Arithmetic Logic Unit) 연산기를 포함할 수 있다. 단, 본 개시에 따른 예시 들은 이에 제한되지 않는다. 각각의 프로세싱 엘리먼트는 추가적인 특수 기능을 처리하기 위해 추가적인 특수 기능 유닛을 선택적으로 더 포 함하도록 구성될 수 있다. 예를 들면, 프로세싱 엘리먼트(PE)는 배치-정규화 유닛, 활성화 함수 유닛, 인터폴레이션 유닛 등을 더 포함하 도록 변형 실시되는 것도 가능하다. SFU는 활성화 함수 연산, 풀링(pooling) 연산, 스트라이드(stride) 연산, 배치 정규화(batch- normalization) 연산, 스킵 커넥션(skip-connection) 연산, 접합(concatenation) 연산, 양자화(quantization) 연산, 클리핑(clipping) 연산, 패딩(padding) 연산 등을 인공신경망의 구조(architecture)에 따라 선별하여, 처리하도록 구성된 회로부를 포함할 수 있다. 즉, SFU는 복수의 특수 기능 연산 처리 회로 유닛들을 포함 할 수 있다. 도 5에서는 예시적으로 복수의 프로세싱 엘리먼트들이 도시되었지만, 하나의 프로세싱 엘리먼트 내부에 MAC을 대체하여, 복수의 곱셈기(multiplier) 및 가산기 트리(adder tree)로 구현된 연산기들이 병렬로 배치되어 구성 되는 것도 가능하다. 이러한 경우, 복수의 프로세싱 엘리먼트는 복수의 연산기를 포함하는 적어도 하나의 프로세싱 엘리먼트로 지칭되는 것도 가능하다. 복수의 프로세싱 엘리먼트는 복수의 프로세싱 엘리먼트들(PE1 to PE12)을 포함하도록 구성된다. 도 5에 도 시된 복수의 프로세싱 엘리먼트들(PE1 to PE12)은 단지 설명의 편의를 위한 예시이며, 복수의 프로세싱 엘리먼 트들(PE1 to PE12)의 개수는 제한되지 않는다. 복수의 프로세싱 엘리먼트들(PE1 to PE12)의 개수에 의해서 복수 의 프로세싱 엘리먼트의 사이즈 또는 개수가 결정될 수 있다. 복수의 프로세싱 엘리먼트의 사이즈는 N x M 행렬 형태로 구현될 수 있다. 여기서 N 과 M은 0보다 큰 정수이다. 복수의 프로세싱 엘리먼트는 N x M 개의 프로세싱 엘리먼트를 포함할 수 있다. 즉, 프로세싱 엘리먼트는 1개 이상일 수 있다. 복수의 프로세싱 엘리먼트의 사이즈는 NPU이 작동하는 인공신경망모델의 특성을 고려하여 설계할 수 있다. 복수의 프로세싱 엘리먼트는 인공신경망 연산에 필요한 덧셈, 곱셈, 누산 등의 기능을 수행하도록 구성된 다. 다르게 설명하면, 복수의 프로세싱 엘리먼트는 MAC(multiplication and accumulation) 연산을 수행하 도록 구성될 수 있다. 이하 복수의 프로세싱 엘리먼트 중 제1 프로세싱 엘리먼트(PE1)를 예를 들어 설명한다. 도 4a는 본 개시에 적용될 수 있는 복수의 프로세싱 엘리먼트 중 하나의 프로세싱 엘리먼트를 설명하는 개략적 인 개념도이다. 본 개시의 일 예시에 따른 NPU는 복수의 프로세싱 엘리먼트, 복수의 프로세싱 엘리먼트에서 추 론될 수 있는 인공신경망모델을 저장하도록 구성된 NPU 내부 메모리 및 복수의 프로세싱 엘리먼트 및 NPU 내부 메모리를 제어하도록 구성된 NPU 컨트롤러를 포함하고, 복수의 프로세싱 엘리먼트는 MAC 연산을 수행하도록 구성되고, 복수의 프로세싱 엘리먼트는 MAC 연산 결과를 양자화해서 출력하도록 구 성될 수 있다. 단, 본 개시의 예시들은 이에 제한되지 않는다. NPU 내부 메모리은 메모리 사이즈와 인공신경망모델의 데이터 사이즈에 따라 인공신경망모델의 전부 또는 일부를 저장할 수 있다. 제1 프로세싱 엘리먼트(PE1)는 곱셈기, 가산기, 누산기, 및 비트 양자화 유닛을 포함할 수 있다. 단, 본 개시에 따른 예시들은 이에 제한되지 않으며, 복수의 프로세싱 엘리먼트는 인공신경망의 연 산 특성을 고려하여 변형 실시될 수도 있다. 곱셈기는 입력 받은 (N)bit 데이터와 (M)bit 데이터를 곱한다. 곱셈기의 연산 값은 (N+M)bit 데이터 로 출력된다. 곱셈기는 하나의 변수와 하나의 상수를 입력 받도록 구성될 수 있다. 누산기는 (L)loops 횟수만큼 가산기를 사용하여 곱셈기의 연산 값과 누산기의 연산 값을 누산 한다. 따라서 누산기의 출력부와 입력부의 데이터의 비트 폭은 (N+M+log2(L))bit로 출력될 수 있다. 여기서 L은 0보다 큰 정수이다. 누산기는 누산이 종료되면, 초기화 신호(initialization reset)를 입력 받아서 누산기 내부에 저장된 데이터를 0으로 초기화 할 수 있다. 단, 본 개시에 따른 예시들은 이에 제한되지 않는다. 비트 양자화 유닛은 누산기에서 출력되는 데이터의 비트 폭을 저감할 수 있다. 비트 양자화 유닛 은 NPU 컨트롤러에 의해서 제어될 수 있다. 양자화된 데이터의 비트 폭은 (X)bit로 출력될 수 있다. 여기서 X는 0보다 큰 정수이다. 상술한 구성에 따르면, 복수의 프로세싱 엘리먼트는 MAC 연산을 수행하도 록 구성되고, 복수의 프로세싱 엘리먼트는 MAC 연산 결과를 양자화해서 출력할 수 있는 효과가 있다. 특히 이러한 양자화는 (L)loops가 증가할수록 소비 전력을 더 절감할 수 있는 효과가 있다. 또한 소비 전력이 저감되 면 발열도 저감할 수 있는 효과가 있다. 특히 발열을 저감하면 NPU의 고온에 의한 오동작 발생 가능성을 저감할 수 있는 효과가 있다. 비트 양자화 유닛의 출력 데이터(X)bit은 다음 레이어의 노드 데이터 또는 합성곱의 입력 데이터가 될 수 있다. 만약 인공신경망모델이 양자화되었다면, 비트 양자화 유닛은 양자화된 정보를 인공신경망모델에서 제공받도록 구성될 수 있다. 단, 이에 제한되지 않으며, NPU 컨트롤러는 인공신경망모델을 분석하여 양자 화된 정보를 추출하도록 구성되는 것도 가능하다. 따라서 양자화된 데이터 사이즈에 대응되도록, 출력 데이터 (X)bit를 양자화 된 비트 폭으로 변환하여 출력될 수 있다. 비트 양자화 유닛의 출력 데이터(X)bit는 양자 화된 비트 폭으로 NPU 내부 메모리에 저장될 수 있다. 본 개시의 일 예시에 따른 NPU의 복수의 프로세싱 엘리먼트는 곱셈기, 가산기, 및 누산기 를 포함한다. 비트 양자화 유닛은 양자화 적용 여부에 따라 취사 선택될 수 있다. 도 4b는 본 개시에 적용될 수 있는 SFU를 설명하는 개략적인 개념도이다. 도 4b를 참고하면 SFU는 여러 기능 유닛을 포함한다. 각각의 기능 유닛은 선택적으로 동작될 수 있다. 각 각의 기능 유닛은 선택적으로 턴-온되거나 턴-오프될 수 있다. 즉, 각각의 기능 유닛은 설정이 가능하다. 다시 말해서, SFU는 인공신경망 추론 연산에 필요한 다양한 회로 유닛들을 포함할 수 있다. 예를 들면, SFU의 회로 유닛들은 건너뛰고 연결하기(skip-connection) 동작을 위한 기능 유닛, 활성화 함 수(activation function) 동작을 위한 기능 유닛, 풀링(pooling) 동작을 위한 기능 유닛, 양자화 (quantization) 동작을 위한 기능 유닛, NMS(non-maximum suppression) 동작을 위한 기능 유닛, 정수 및 부동 소수점 변환(INT to FP32) 동작을 위한 기능 유닛, 배치 정규화(batch-normalization) 동작을 위한 기능 유닛, 보간법(interpolation) 동작을 위한 기능 유닛, 연접(concatenation) 동작을 위한 기능 유닛, 및 바이아스 (bias) 동작을 위한 기능 유닛 등을 포함할 수 있다. SFU의 기능 유닛들은 인공신경망모델의 데이터 지역성 정보에 의해서 선택적으로 턴-온되거나 혹은 턴-오 프될 수 있다. 인공신경망모델의 데이터 지역성 정보는 특정 레이어를 위한 연산이 수행될 때, 해당 기능 유닛 의 턴-오프 혹은 턴-오프와 관련된 제어 정보를 포함할 수 있다. SFU의 기능 유닛들 중 활성화된 유닛은 턴-온 될 수 있다. 이와 같이 SFU의 일부 기능 유닛을 선택적 으로 턴-오프하는 경우, NPU의 소비 전력을 절감할 수 있다. 한편, 일부 기능 유닛을 턴-오프하기 위하여, 파워 게이팅(power gating)을 이용할 수 있다. 또는, 일부 기능 유닛을 턴-오프하기 위하여, 클럭 게이팅(clockgating)을 수행할 수도 있다. 도 5는 도 3에 도시된 NPU의 변형예를 나타낸 예시도이다. 도 5에 도시된 NPU는 도 3에 예시적으로 도시된 프로세싱 유닛과 비교하면, 복수의 프로세싱 엘리먼 트를 제외하곤 실질적으로 동일하기 때문에, 이하 단지 설명의 편의를 위해서 중복 설명은 생략할 수 있다. 도 5에 예시적으로 도시된 복수의 프로세싱 엘리먼트는 복수의 프로세싱 엘리먼트들(PE1 to PE12) 외에, 각각의 프로세싱 엘리먼트들(PE1 to PE12)에 대응되는 각각의 레지스터 파일들(RF1 to RF12)을 더 포함할 수 있 다. 도 5에 도시된 복수의 프로세싱 엘리먼트들(PE1 to PE12) 및 복수의 레지스터 파일들(RF1 to RF12)은 단지 설명 의 편의를 위한 예시이며, 복수의 프로세싱 엘리먼트들(PE1 to PE12) 및 복수의 레지스터 파일들(RF1 to RF12) 의 개수는 제한되지 않는다. 복수의 프로세싱 엘리먼트들(PE1 to PE12) 및 복수의 레지스터 파일들(RF1 to RF12)의 개수에 의해서 복수의 프 로세싱 엘리먼트의 사이즈 또는 개수가 결정될 수 있다. 복수의 프로세싱 엘리먼트 및 복수의 레지스 터 파일들(RF1 to RF12)의 사이즈는 N x M 행렬 형태로 구현될 수 있다. 여기서 N 과 M은 0보다 큰 정수이다. 복수의 프로세싱 엘리먼트의 어레이 사이즈는 NPU이 작동하는 인공신경망모델의 특성을 고려하여 설 계할 수 있다. 부연 설명하면, 레지스터 파일의 메모리 사이즈는 작동할 인공신경망모델의 데이터 사이즈, 요구 되는 동작 속도, 요구되는 소비 전력 등을 고려하여 결정될 수 있다. NPU의 레지스터 파일들(RF1 to RF12)은 프로세싱 엘리먼트들(PE1 to PE12)과 직접 연결된 정적 메모리 유 닛이다. 레지스터 파일들(RF1 to RF12)은 예를 들면, 플립플롭, 및/또는 래치 등으로 구성될 수 있다. 레지스터 파일들(RF1 to RF12)은 대응되는 프로세싱 엘리먼트들(PE1 to PE12)의 MAC 연산 값을 저장하도록 구성될 수 있 다. 레지스터 파일들(RF1 to RF12)은 NPU 내부 메모리와 가중치 데이터 및/또는 노드 데이터를 제공하거나 제공받도록 구성될 수 있다. 레지스터 파일들(RF1 to RF12)은 MAC 연산 시 누산기의 임시 메모리의 기능을 수행하도록 구성되는 것도 가능하 다. <본 개시가 적용되는 이동가능한 기기> 도 6a 및 도 6b는 본 개시가 적용되는 드론(Drone)의 예들을 나타낸다. 도 6a 및 도 6b를 참조하면, 인공지능 객체 인식 기능이 고도화된 이동가능한 기기는 이동하는 타겟 물체를 추 적하면서 촬영할 수 있다. 본 개시에 따른 기기는 카메라를 자동으로 조종하도록 구성된다. 구체적으로 카메라를 자종으로 조종하여 기기 에 장착된 카메라로 촬영된 영상 내에서 특정 피사체(예컨대, 임의의 사람)를 감지(detection) 또는 추적 (tracking)하도록 구성될 수 있다. 본 개시에 따른 기기는 목표 피사체가 이동할 경로 또는 방향을 NPU를 이용하여 예측하도록 구성된다. 따라서 기기에서 예측된 경로 또는 방향으로 이동가능한 기기 또는 카메라를 자동 조정하도록 구성될 수 있다. 도 6a 및 도 6b을 참조하면, 이동가능한 기기에는 하나 또는 복수의 카메라가 장착될 수 있다. 복수의 카 메라는 제1 카메라 및 제2 카메라를 포함할 수 있다. 예를 들어, 제1 카메라는 망원 카메라(telephoto camera)일 수 있다. 제2 카메라는 망원 카메라 (wide-angle camera)일 수 있다. 즉, 제2 카메라는 제1 카메라 보다 작은 화각을 가질 수 있다. 또는 제1 카메라는 가시 광선 카메라일 수 있다. 제2 카메라는 자외선 카메라(ultra violet camera), 적외선 카메라(infrared camera), 열화상 카메라(thermal imaging camera) 및 나이트 비전 카메라 (night vision camera) 중 적어도 하나일 수 있다. 도 7은 도 6a 및 도 6b에 도시된 복수의 카메라의 구성을 나타낸 예시도들이다. 도 7을 참조하면, 제1 카메라는 제1 렌즈(1021-1), 제1 이미지 센서(1021-2), 제1 렌즈(1021-1)를 물리 적으로 조정하는 제1 렌즈 구동 모터(1021-3) 그리고 제1 ISP(image signal processor)(1021-4)를 포함할 수있다. 제2 카메라는 제2 렌즈(1022-1), 제2 이미지 센서(1022-2), 제2 렌즈(1022-1)를 물리적으로 조정하는 제 2 렌즈 구동 모터(1022-3), 및 제2 ISP(1022-4)를 포함할 수 있다. 제1 카메라와 제2 카메라는 카메라 조정부와 연결될 수 있다. 카메라 조정부는 제1 카메라의 제1 ISP(1021-4), 상기 제1 이미지 센서(1021-2), 및 제1 렌즈 구 동 모터(1021-3)와 연결되어, 이들을 제어할 수 있다. 카메라 조정부는 제2 카메라의 제2 ISP(1022-4), 상기 제2 이미지 센서(1022-2), 및 제2 렌즈 구 동 모터(1022-3)와 연결되어, 이들을 제어할 수 있다. 카메라 조정부는 제1 카메라의 제1 이미지 센서(1021-2) 또는 제1 ISP(1021-4)를 제어할 수 있다. 카메라 조정부는 제1 카메라가 더 높은 해상도의 이미지를 캡쳐할 수 있도록, 제1 이미지 센서 (1021-2)를 제어할 수 있다. 제1 ISP(1021-4)는 촬영된 이미지를 다운스케일(또는 다운사이징)하도록 구성될 수 있다. 카메라 조정부는 제2 카메라의 제2 이미지 센서(1022-2) 또는 제2 ISP(1022-4)를 제어할 수 있다. 카메라 조정부는 제2 카메라가 더 높은 해상도의 이미지를 캡쳐할 수 있도록, 제2 이미지 센 서(1022-2)를 제어할 수 있다. 제2 ISP(1022-4)는 촬영된 이미지를 다운스케일(또는 다운사이징)하도록 제어할 수 있다. 도 8은 도 6a 및 도 6b에 도시된 이동가능한 기기의 구성을 예시적으로 나타낸 블록도이다. 도 8을 참조하면, 이동가능한 기기는 도 1 또는 도 3에 도시된 NPU, 메모리, 무선 통신부 , 카메라 조정부, 센싱부 시스템 버스, 그리고 CPU를 포함할 수 있다. 무선 통신부는 4G 통신부, 5G 통신부, 6G 통신부 그리고 근거리 통신부 중 하나 이상을 포함할 수 있다. 4G 통신부는 LTE(Long Term Evolution) 또는 LTE-A(LTE-Advanced)를 위한 것일 수 있다. 5G 통신부는 5G NR(New Radio)를 위한 것일 수 있다. 근거리 통신부는 예를 들면 WLAN(Wireless LAN), Wi-Fi(Wireless- Fidelity), Wi-Fi(Wireless Fidelity) Direct, 블루투스(Bluetooth쪠), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wireless USB(Wireless Universal Serial Bus) 등을 지원할 수 있다. 무선 통신부는 상기 이동가능한 기기의 비행을 조정하기 위한 신호를 송수신하거나, 촬영된 영상을 전송 하거나, 또는 NPU에 의한 추론 결과를 전송하기 위해서 사용될 수 있다. 도 7을 참조하면, 상기 카메라 조정부는 외부로부터 제어 신호(또는 결정 데이터)를 입력받을 수 있다. 카메라 조정부는 제어 신호(또는 결정 데이터)에 의해서제1 카메라의 제1 이미지 센서(1021-2) 및/ 또는 제1 ISP(1021-4)를 제어하도록 구성될 수 있다. 카메라 조정부는 입력 받은 제어 신호(또는 결정 데 이터)에 기초하여 제1 이미지 센서(1021-2), 제1 렌즈 구동 모터(1021-3) 및 제1 ISP(1021-4) 중 적어도 하나 에 대응되는 제어 신호(또는 결정 데이터)를 제공할 수 있다. 카메라 조정부는 제어 신호(또는 결정 데이터)에 의해서 제2 카메라의 제2 이미지 센서(1022-2) 및?또는 제2 ISP(1022-4)를 제어하도록 구성될 수 있다. 카메라 조정부는 입력 받은 제어 신호(또는 결정 데이터)에 기초하여 제2 이미지 센서(1022-2), 제2 렌즈 구동 모터(1022-3) 및 제2 ISP(1022-4) 중 적어도 하 나에 대응되는 제어 신호(또는 결정 데이터)를 제공할 수 있다. 여기서, 카메라 조정부에 입력되는 제어 신호(또는 결정 데이터)와 제1 이미지 센서(1021-2), 제1 렌즈 구동 모터(1021-3) 및 제1 ISP(1021-4)에 입력되는 제어 신호(또는 결정 데이터)는 서로 실질적으로 동일한 신 호일 수 있다. 단, 이에 제한되지 않으며, 카메라 조정부에 입력되는 제어 신호(또는 결정 데이터)와 제1 이미지 센서 (1021-2), 제1 렌즈 구동 모터(1021-3) 및 제1 ISP(1021-4) 각각에 입력되는 각각의 제어 신호(또는 결정 데이 터)는 각각의 구성 요소에 대응되도록 변환된 신호 일 수 있다. 카메라 조정부는 제1 이미지 센서(1021-2) 또는 제1 ISP(1021-4)에게 제어 신호(또는 결정 데이터)를 전 달하여 제1 이미지 센서(1021-2) 또는 제1 ISP(1021-4)를 제어할 수 있다. 카메라 조정부는 제1 카메라의 제1 이미지 센서(1021-2)가 캡쳐링된 이미지의 해상도 및/또는 초당 프레임 속도(fps)를 조절할 수 있도록, 제1 이미지 센서(1021-2)에게 제어 신호(또는 결정 데이터)를 전달할 수 있다. 상기 카메라 조정부는 제2 이미지 센서(1022-2) 또는 제2 ISP(1022-4)에게 제어 신호(또는 결정 데이터) 를 전달하여 제2 이미지 센서(1022-2) 또는 제2 ISP(1022-4)를 제어할 수 있다. 카메라 조정부는 제2 카메라의 제2 이미지 센서(1022-2)가 캡쳐링된 이미지의 해상도 및/또는 초당 프레임 속도(fps)를 조절할 수 있도록, 제2 이미지 센서(1022-2)에게 제어 신호(또는 결정 데이터)를 전달할 수 있다. 또한, 상기 카메라 조정부는 상기 제1 카메라의 제1 ISP(1021-4)가 상기 캡쳐링된 이미지를 다운스 케일링 또는 업스케일링할 수 있도록, 상기 제1 ISP(1021-4)에게 제어 신호(또는 결정 데이터)를 전달할 수 있 다. 마찬가지로, 상기 카메라 조정부는 상기 제2 카메라의 제2 ISP(1022-4)가 상기 캡쳐링된 이미지를 다운스케일링 또는 업스케일링할 수 있도록, 상기 제2 ISP(1022-4)에게 제어 신호(또는 결정 데이터)를 전달할 수 있다. 상기 센싱부는 고도 센서, 위치 센서(예컨대, GNSS 또는 GPS), 자이로 센서, 속도 센 서를 포함할 수 있다. 상기 고도 센서는 상기 이동가능한 기기이 지면으로부터 떠 있는 높이 를 측정할 수 있다. 상기 위치 센서는 상기 이동가능한 기기의 위치 좌표를 측정할 수 있다. 또한, 상기 위치 센서는 상기 이동가능한 기기 이 지면으로부터 떠 있는 높이를 측정할 수도 있다. 상기 속도 센서는 상기 이동가능한 기기의 속도 뿐만 아니라 가속도도 측정할 수 있다. 상기 센싱부는 측정된 데이터를 상기 CPU로 전달하거나, 상기 무선 통신부를 통해 인터넷으로 전송하거나 혹은 상 기 무선 통신부를 통해 상기 이동가능한 기기을 조정하는 사용자의 단말기로 전달할 수 있다. 상기 시스템 버스은 상기 무선 통신부, 상기 카메라 조정부, 상기 센싱부, 상기 메모리 , 상기 CPU, 상기 NPU를 서로 연결하는 인터페이스를 제공할 수 있다. 상기 메모리는 다수의 인공신경망(ANN) 모델에 대한 정보를 저장할 수 있다. 상기 다수의 인공신경망모델 은 제1 인공신경망모델과 제2 인공신경망모델을 포함을 포함할 수 있다. 또한, 상기 다수의 인공신경망모델은 제3 모델을 더 포함할 수도 있다. 상기 다수의 인공신경망모델은 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network)를 포함할 수 있다. 상기 CNN 모델은 하나의 이미지 내의 오브젝트(object)를 감지하는데 사용될 수 있고, 상기 RNN 모델은 시간 개념을 활용하여 오브젝트를 예측하기 위해서 사용될 수 있 다. 또한, 상기 다수의 인공신경망모델은 R-CCN(Region-based CNN), SPP-Net (Spatial Pyramid Pooling network), YOLO (You only look once), SSD (Single-Shot Multibox Detector), DSSD (Deconvolutional Single-Shot Multibox Detector), LTSM (Long-Short Term Memory), GRU (Gated Recurrent Unit) 등을 포함할 수 있다. 예를 들어, 상기 제1 인공신경망모델은 CNN 일종인 예컨대 Yolo일 수 있다. 그리고, 상기 제2 인공신경망모델은 SSD일 수 있다. 예를 들어, 상기 제1 인공신경망모델은 제1 사이즈(예, 200 x 200)의 입력 특징맵을 이용하는, 인공신경망모델 일 수 있다. 상기 제2 인공신경망모델은 제2 사이즈(예, 320 x 320)의 입력 특징맵을 이용하는 인공신경망모델 일 수 있다. 또한, 상기 제3 인공신경망모델은 제3 사이즈(예, 400 x 400)의 입력 특징맵을 이용하는 인공신경 망모델일 수 있다. 상기 메모리에 저장된 인공신경망모델에 대한 정보는 인공신경망모델의 레이어 개수, 레이어 당 채널 개수, 각 레이어 내의 각 채널에 사용되는 가중치 행렬에 대한 정보를 포함할 수 있다. 구체적으로, 상기 메모리는 머신 코드 저장부, 이미지 저장부, 출력 특징맵 저장부 그리고 머신 코드 별 가중치 저장부 등을 포함할 수 있다. 이에 대해서는, 도 11을 참조하여 후술하기로 한다. 상기 NPU는 도 3 또는 도 5에 도시된 바와 같이, 복수의 프로세싱 엘리먼트, 내부 메모리, NPU 컨트롤러, SFU(Special Function Unit) 그리고 상기 내부 메모리에 액세스하고 제어하는 DMA(direct memory access)을 포함할 수 있다. 또한, 도 8에 도시되지는 않았지만, 상기 NPU는 도 3또는 도 5에 도시된 바와 같이 NPU 인터페이스를 더 포함할 수 있다. 상기 NPU 내의 복수의 프로세싱 엘리먼트 및/또는 SFU는 상기 제1 카메라과 상기 제2 카 메라로부터 획득된 하나 이상의 이미지에 기초하여, 적어도 하나의 객체인 피사체를 감지(detect) 또는 추적(track)하기 위한 추론 결과를 출력하도록 학습된 인공신경망모델의 연산을 인공신경망모델의 각 레이어 별로 수행할 수 있다. 상기 NPU 내의 복수의 프로세싱 엘리먼트는 제1 인공신경망모델을 위한 제1 연산을 위해 할당된 제1 그룹의 프로세싱 엘리먼트들과 그리고 제2 인공신경망모델을 위한 제2 연산을 위해 할당된 제2 그룹의 프로세 싱 엘리먼트들을 포함할 수 있다. 이에 대해서는 도 10A를 참조하여 후술하기로 한다. 상기 NPU 내의 상기 내부 메모리는 상기 적어도 하나의 객체를 감지(detect) 또는 추적(track)하기 위한 인공신경망모델에 대한 정보를 상기 DMA를 이용하여 상기 시스템 버스를 통해 상기 메모리 로부터 가져와서 임시 저장할 수 있다. 즉, 상기 내부 메모리는 다수의 인공신경망모델에 대한 정보 를 저장할 수 있다. 상기 다수의 인공신경망모델은 전술한 바와 같이 제1 인공신경망모델, 제2 인공신경망모델 또는 제3 인공신경망모델을 포함할 수 있다. 또한, 상기 NPU 내의 상기 내부 메모리는 상기 인공신경 망모델의 연산을 위하여 입력 특징맵(Input Feature Map)과 출력 특징맵(Output Feature Map)활성화맵, 가중치 커널 등의 파라미터를 임시 저장할 수 있다. 이를 위해, 상기 NPU 내의 상기 내부 메모리는 입력 특 징맵 저장부, 출력 특징맵 저장부 그리고 가중치 저장부 등을 포함할 수 있다. 구체적으로, NPU의 내부 메모리의 구성은 인공신경망모델의 구조에 따라 상이해질 수 있다. 예를 들 면, CNN 모델을 처리하도록 구성된 NPU의 경우, NPU 내의 내부 메모리는 후술하는 바와 같이, 입력 특징맵 저장부, 출력 특징맵 저장부 그리고 가중치 저장부 등을 포함할 수 있다.단, 이에 대해서는, 도 11 을 참조하여 후술하기로 한다. 상기 NPU 내의 상기 NPU 컨트롤러은 도 3 또는 도 5에 도시된 바와 같은 스케줄러 외에도, 펌웨어 저 장부를 더 포함할 수 있다. 펌웨어 저장부는 예를 들어, 컴파일된 복수의 머신 코드들의 세트와 명렁어 세트를 저장할 수 있다. 대안적으로, 상기 복수의 머신 코드들의 세트는 상기 내부 메모리에 저장되어 있을 수도 있다. 예를 들어, 복수의 머신 코드들의 세트는 제1 사이즈(예, 200 x 200 x 3)의 입력 특징맵을 이용하는 제1 인공 신경망모델을 위한 제1 세트의 머신 코드와, 제2 사이즈(예, 320 x 320 x 3)의 입력 특징맵을 이용하는 제2 인 공신경망모델을 위한 제2 세트의 머신 코드를 포함할 수 있다. 추가적으로, 복수의 머신 코드들의 세트는 제3 사이즈(예, 400 x 400 x 3)의 입력 특징맵을 이용하는 제3 인공신경망모델을 위한 제3 세트의 머신 코드를 더 포함할 수도 있다. 부연 설명하면, 제어 신호(또는 결정 데이터)에 따라서 입력 특징맵의 사이즈가 변경되도록 구성될 수 있다. 이에, 복수의 입력 특징맵의 사이즈에 대응되는 복수의 머신 코드가 각각 컴파일 되어야 한다. 그리고 NPU는 입력 특징맵 사이즈 변경 시 대응되는 머신 코드로 스위칭 할 수 있다. 예를 들면, 복수의 머신 코드들의 세트는 서로 다른 인공신경망모델을 포함도록 구성될 수 있다. 여기서 제1 인 공신경망모델은 작은 객체인식에 유리한 특성을 가지고 제2 인공신경망모델은 큰 객체인식에 유리한 특성을 가 질 수 있다. 각 인공신경망모델의 머신 코드를 컴파일링(compiling)하기 위하여, 컴파일러가 사전에 준비될 수 있다. 컴파일 러는 특정 인공신경망모델을 처리하기 위해서, 입력 특징맵의 사이즈 및 해당 인공신경망모델의 구조 데이터에 기초하여 최적의 연산을 스케줄링 할 수 있다. 즉, 컴파일러는 임의 인공신경망모델 내의 레이어 각각에 대응되 는 데이터의 사이즈를 분석하고, 그에 따라 NPU 내의 내부 메모리를 효율적으로 사용하여, 메모리 의 액세스 명령 생성 빈도를 최소화하는 머신 코드를 생성할 수 있다. 또한, 컴파일러는 임의 인공신경망모델 내의 각 레이어의 가중치와 특징맵의 데이터 사이즈 그리고 NPU의 내부 메모리의 메모리 사이즈를 기초로, 각 레이어 별로 특징맵 및/또는 커널의 최적의 타일(tile)의 개수 를 산출할 수 있다. 입력 특징맵의 사이즈가 크고, 내부 메모리의 메모리 사이즈가 작을수록 타일의 개수 가 증가할 수 있다. 입력 특징맵의 사이즈가 작고, 내부 메모리의 메모리 사이즈가 클수록 타일의 개수가 감소할 수 있다. 따라서, 컴파일러는 최적의 타일의 개수에 대응되는 인공신경망모델을 위한 복수의 머신 코드 들의 세트를 생성할 수 있다. 즉, 입력 특징맵의 사이즈에 따라서 타일의 개수가 다르게 컴파일 되어야 한다. 즉, 제공될 수 있는 세트에 포함된 복수의 머신 코드들의 개수는 NPU에 입력되는 스위칭 가능한 입력 특징 맵의 사이즈들의 개수와 대응될 수 있다. 예를 들면, 스위칭 가능한 입력 특징맵의 사이즈가 200 x 200 x 3 및 400 x 400 x3 일 경우, 세트에 포함된 복수의 머신 코드들의 개수는 2일 수 있다. 복수의 머신 코드들의 세트에 대한 인덱스 정보는 NPU 컨트롤러 내의 펌웨어 저장부에 저장되어 있을 수 있다. 이동가능한 기기의 구동 초기에, CPU는 NPU 컨트롤러 내의 펌웨어 저장부로부터 복수의 머신 코드들의 세트에 대한 인덱스 정보를 로딩한 후, CPU 내의 캐시 메모리에 저장해둘 수 있다. 상기 CPU는 상기 이동가능한 기기의 이동 경로 또는 이동 방향을 결정한 후, 상기 결정된 이동 경 로 또는 이동 방향으로 상기 이동가능한 기기가 움직이도록 제어할 수 있다. 이를 위해, 상기 CPU 은 상기 센싱부로부터 측정 데이터(즉, 환경적 조건 데이터)를 수신할 수 있다. 구체적으로, CPU는 이동가능한 기기의 비행을 제어할 수 있다. 단 본 개시의 이동가능한 기기는 비 행 물체에 제한되지 않으며, 지상, 수상 및 수중에서 이동가능한 기기로 확장 실시될 수 있다. 예를 들어, 상기 CPU은 상기 위치 센서를 통해 측정된 위치 정보와 도착지 위치 정보를 비교하면서, 상기 이동가능한 기기의 비행 경로와 비행 속도, 비행 고도 등을 결정할 수 있다. 또한, 상 기 CPU는 상기 결정된 비행 속도와 결정된 비행 고도로 상기 이동가능한 기기이 정상적으로 비행되 는지 여부를 상기 고도 센서, 상기 자이로 센서 그리고 상기 속도 센서로부터 획득된 측정치 들과 비교하여 이동가능한 기기의 정상 비행 여부를 판단할 수 있다. 따라서 이동가능한 기기는 비 행을 지속적으로 제어할 수 있다. 상기 CPU는 상기 제1 카메라 및 상기 제2 카메라로부터 촬영된 영상을 수신할 수 있다. 또한, 상기 CPU는 상기 NPU로부터 추론 결과(즉, 객체 감지 또는 추적 결과)를 수신할 수 있다. 상기 CPU는 상기 감지 또는 상기 추적의 정확도를 높이기 위하여, 상기 카메라 조정부로 제어 신호 (또는 결정 데이터)를 전송할 수 있다. 예를 들어, 상기 적어도 하나의 객체가 제1 임계값 보다 작은 신뢰도 레 벨로 감지되거나 추적되는 경우, 상기 제어 신호(또는 결정 데이터)를 생성한 후, 상기 카메라 조정부로 전달할 수 있다. 신뢰도 레벨은 0 내지 1의 값일 수 있으며, 신뢰도 레벨 0.0의 의미는, 감지된 객체의 클래스의 추론 정확도가 0%라는 것을 의미할 수 있다. 신뢰도 레벨 0.5의 의미는, 감지된 객체의 클래스의 추론 정확도가 50%라는 것을 의미할 수 있다. 신뢰도 레벨 1.0의 의미는, 감지된 객체의 클래스의 추론 정확도가 100%라는 것을 의미할 수 있다. 임계값은 0 내지 1의 값일 수 있다. 상기 제어 신호(또는 결정 데이터)에 기초하여, 상기 제1 ISP(1021-4) 또는 상기 제2 ISP(1022-4)는 영상 또는 일련의 이미지들을 영상처리할 수 있다. 상기 영상 또는 일련의 이미지들은 상기 NPU로 입력되기 때문에, 입력 특징맵(input feature map)이라고 불릴 수 있다. 또한, 상기 CPU는 상기 추적의 정확도를 높이기 위하여, 캐시 메모리에 저장된 상기 복수의 머신 코드들 의 세트 중 하나를 선택한 후, 상기 NPU의 NPU 컨트롤러로 전달할 수 있다. 보다 구체적으로, 상기 CPU는 상기 센싱부의 고도 센서, 또는 위치 센서로부터 비행 고도 정보, 해수면 또는 지면으로부터의 높이에 대한 정보를 수신할 수 있다. 만약, 비행 고도가 상승되는 경우 (즉, 해수면 또는 지면으로부터 드론의 높이가 높아지는 경우), 이미지 내에서 객체의 사이즈는 보다 작아지기 때문에, 상기 객체는 제1 임계값 보다 작은 신뢰도 레벨로 감지되거나, 감지가 실패될 수 있다. 따라서, 상기 CPU는 상기 감지 또는 상기 추적의 정확도를 높이기 위하여, 상기 CPU는 상기 복수의 머신 코드들 의 세트 중에서 해당 고도에 적합한 머신 코드의 세트를 선택할 수 있다. 상기 선택된 세트는 해당 비행 고도에 적합한 인공신경망모델을 위한 머신 코드의 세트일 수 있다. 상기 CPU는 상기 머신 코드의 세트에 대한 인덱스 정보를 상기 NPU의 NPU 컨트롤러로 전달할 수 있다. 도 9는 고도에 따라 인공신경망모델들을 스위칭하는 예를 나타낸 개념도이다. 도 9를 참조하여 알 수 있는 바와 같이, 비행 고도, 해수면으로부터의 높이 또는 지면으로부터의 높이가 낮은 경우, 즉 임의의 하한 임계값 보다 작다고 측정되는 경우, 제1 인공신경망모델이 사용될 수 있다. 그러나, 비행 고도, 해수면으로부터의 높이 또는 지면으로부터의 높이가 상승되어, 임의의 상한 임계값 보다 크 다고 측정되는 경우, 제2 인공신경망모델이 사용될 수 있다. 예를 들어, 해수면으로부터의 높이 또는 지면으로 부터의 높이가 상승되면, 카메라로 촬영된 이미지 내에서 객체(즉, 피사체)가 임의의 하한 임계값 보다 작게 획득될 수 있다. 이처럼, 상기 이미지 내에서 객체(즉, 피사체)의 사이즈는 상대적으로 작기 때문에, 상기 객체는 상기 NPU에 의해서 제1 임계값 보다 작은 신뢰도 레벨로 감지되거나, 감지가 실패될 수 있다. 이 경우, 제 1 인공신경망모델에서 제2 인공신경망모델로 스위칭될 수 있다. 이후, 상기 비행 고도, 해수면으로부터의 높이 또는 지면으로부터의 높이가 하강되어, 임의의 하한 임계값 작다 고 측정되는 경우, 상기 제1 인공신경망모델이 다시 사용될 수 있다. 각각의 인공신경망모델의 장점과 단점에 관한 정보가 사전에 분석될 수 있다. 각각의 인공신경망모델의 장점과 단점에 관한 정보는 파라미터 사이즈, 1회 추론에 소요되는 연산량, 1회 추론에 소요되는 소비 전력량, 객체의 크기에 따른 객체 인식 정확도이다. 예를 들면, 제1 인공신경망모델은 50 x 50 크기의 객체의 인식 정확도가 제2 인공신경망모델 보다 5% 이상 더 높게 측정되었을 수 있다. 이러한 경우, CPU는 사전에 분석된 정보에 기초하여, NPU가 제1 인공신경 망모델을 활용하여 객체 인식 연산을 처리하도록 명령할 수 있다. 예를 들면, 제2 인공신경망모델은 25 x 25 크기의 객체의 인식 정확도가 제1 인공신경망모델 보다 3% 이상 더 높게 측정되었을 수 있다. 이러한 경우, CPU는 사전에 분석된 정보에 기초하여, NPU가 제2 인공신경 망모델을 활용하여 객체 인식 연산을 처리하도록 명령할 수 있다. 도 10A는 복수의 신경망 모델들의 연산이 할당된 PE들을 나타낸 예시도이다. 도 10A에는 예시적으로 PE1부터 PE24까지 총 24개의 PE들이 존재하는 것으로 나타나 있다. 제1 인공신경망모델 을 위한 제1 연산을 위해 할당된 제1 그룹의 PE들은 PE1부터 PE16까지 총 16개일 수 있다. 제2 인공신경망모델 을 위한 제2 연산을 위해 할당된 제2 그룹의 PE들은 PE17, PE18, PE19, PE20, PE22, PE23 그리고 PE24로서 총 8개일 수 있다. 상기 제1 그룹의 PE들의 개수와 상기 제2 그룹의 PE들의 개수는, 시변될 수 있다. 예를 들어, 상기 제1 인공신 경망모델에서 상기 제2 인공신경망모델로의 스위칭이 시작되는 경우, 총 24개의 PE들 중에서 20개 PE들이 제1 그룹에 할당되고, 나머지 4개의 PE들이 제2 그룹에 할당될 수 있다. 상기 제2 인공신경망모델로의 스위칭이 시 작된 후, 일정 시간 혹은 일정 클록 사이클이 경과되면, 총 24개의 PE들 중에서 12개 PE들이 제1 그룹에 할당되 고, 나머지 12개의 PE들이 제2 그룹에 할당될 수 있다. 상기 제2 인공신경망모델로의 스위칭이 완료되기 직전에 는 후, 총 24개의 PE들 중에서 4개 PE들이 제1 그룹에 할당되고, 나머지 20개의 PE들이 제2 그룹에 할당될 수 있다. 상기 제1 그룹의 PE들의 개수와 상기 제2 그룹의 PE들의 개수는, 각 인공신경망모델 내의 각 레이어의 가중치와 특징맵의 데이터 크기 그리고 NPU의 내부 메모리의 메모리 크기를 기초로, 결정될 수 있다. 또한, 상 기 제1 그룹의 PE들의 개수와 상기 제2 그룹의 PE들의 개수는, 상기 머신 코드의 세트에 기초하여 설정될 수도 있다. 도 10B는 복수의 신경망 모델들에 대한 연산이 수행되는 예를 나타낸다. 도 10B를 참조하여 알 수 있는 바와 같이, 제1 인공신경망모델을 위한 제1 연산들이 수행된다. 상기 제1 인공신 경망모델의 i번째 레이어에 대한 연산이 수행되면, 제2 인공신경망모델을 위한 제2 연산이 시작될 수 있다. 도 시된 바와 같이, 제1 인공신경망모델을 위한 제1 연산과 제2 인공신경망모델을 위한 제2 연산은 시분할로 수행 될 수 있다. 도 10A와 도 10B를 함께 참조하면, 제1 인공신경망모델을 위한 연산을 위해 PE1부터 PE16까지 총 16개의 PE들이 할당될 수 있다. 그러다가, 제1 인공신경망모델의 i번째 레이어에 대한 연산이 수행되면, PE1 내지 PE16 중에서 상기 PE10, PE11, PE14, PE15 및 PE16는 제2 인공신경망모델을 위한 연산을 위해서 재할당될 수 있다. 즉, 상기 제1 인공신경망모델의 후속 연산은 나머지 PE들, 즉 PE1, PE2, PE3, PE4, PE5, PE6, PE7, PE8, PE9 그리고 PE13에 의해서만 수행될 수 있다. 도시된 바와 같이 상기 제1 인공신경망모델을 위한 제1 연산들과 상기 제2 인공신경망모델을 위한 제2 연산들은 병렬적(in parallel) 또는 시분할(time division) 방식으로 수행될 수 있다. 또한, 도시된 바와 같이 상기 제1 인공신경망모델의 연산을 위해 할당된 상기 제1 그룹의 PE들과 상기 제2 그룹 의 인공신경망모델의 연산을 위해 할당된 상기 제2 그룹의 PE들은 부분적으로 동일하거나, 서로 완전히 다를 수 있다.도 10B에서는 상기 제1 인공신경망모델의 i번째 레이어에 대한 연산이 수행되면, 제2 인공신경망모델을 위한 제 2 연산이 시작되는 것으로 도시되어 있으나, 이와 달리 다른 변형예도 가능하다. 예를 들어, 제2 인공신경망모델을 위한 제2 연산은 상기 복수의 ANN들의 연산 순서에 대한 정보에 기초하여 시 작될 수 있다. 상기 연산 순서에 대한 정보는 레이어에 대한 정보, 커널에 대한 정보, 프로세싱 시간에 대한 정보, 남은 시간 에 대한 정보, 그리고 클럭(clock)에 대한 정보 중 하나 이상을 포함할 수 있다. 상기 레이어에 대한 정보는 상기 제1 인공신경망모델의 모든 레이어들 중에서 i번째 레이어를 나타낼 수 있다. 상기 제2 인공신경망모델을 위한 연산은 상기 제1 인공신경망모델의 i번째 레이어를 위한 연산이 시작된 이후에 시작될 수 있다. 상기 커널에 대한 정보는 상기 제1 인공신경망모델의 모든 커널들 중에서 k번째 커널을 나타낼 수 있다. 상기 제2 인공신경망모델을 위한 연산은 상기 제1 인공신경망모델의 k번째 커널을 위한 연산이 시작된 이후에 시작될 수 있다. 상기 프로세싱 시간에 대한 정보는 상기 제1 인공신경망모델을 위한 연산을 수행한 이후에 경과된 시간을 나타 낼 수 있다. 상기 제2 인공신경망모델을 위한 연산은 상기 경과 시간 이후에 시작될 수 있다. 상기 잔여 시간에 대한 정보는 상기 제1 인공신경망모델의 연산들이 완료되기까지 남은 시간을 나타낼 수 있다. 상기 제2 인공신경망모델을 위한 연산은 상기 남은 시간에 도달하기 전에 시작될 수 있다. 도 11은 도 8에 도시된 구성을 주요 동작 관점에서 나타낸 블록도이다. 도 11에 도시된 NPU, 메모리, 카메라 조정부, 센싱부 그리고 CPU 사이에는 도 8 에 도시된 바와 같은 시스템 버스가 위치될 수 있다. 따라서, 상기 NPU, 메모리, 카메라 조정 부, 센싱부 그리고 CPU는 도 8에 도시된 바와 같은 시스템 버스를 통하여, 서로 통신 할 수 있다. 도 11에 도시된 상기 NPU는 도 8에 도시된 바와 같이 복수의 프로세싱 엘리먼트, SFU와, 내부 메모리와 DMA와 그리고 NPU 컨트롤러를 포함할 수 있다. 내부 메모리는 입력 특징맵 저장부와, 출력 특징맵 저장부와, 그리고 가중치 저장부를 포함할 수 있다. 각 각의 저장부는 저장되는 데이터를 구분하기 위한 개념적인 것으로 이해되어야 하며, DMA에 의해서 제어될 수 있다. 도 11에 도시된 메모리은 머신 코드 저장부, 이미지 저장부, 출력 특징맵 저장부, 그리고 머신 코드 별 가 중치 저장부를 저장할 수 있다. 전술한 바와 같이, 복수의 인공신경망모델이 사용될 수 있다. 각 인공신경망모델은 전술한 바와 같이 사전에 준 비된 컴파일러에 의하여 머신 코드로 변환될 수 있다. 예를 들어, 컴파일러는 임의 인공신경망모델 내의 레이어 각각에 대응되는 데이터의 사이즈를 분석한다. 컴파일러는 분석 결과에 따라 NPU 내의 내부 메모리를 효율적으로 사용하고, 메모리의 액세스를 최소화하는 머신 코드를 생성할 수 있다. 따라서, 각 인공신경망모델을 위한 머신 코드가 생성될 수 있다. 복수의 인공신경망모델이 존재하는 경우, 머신 코드가 복수 세트로 생성될 수 있다. 예를 들어, 복수의 머신 코드들의 세트는 제1 사이즈(예, 200 x 200 x 3)의 입력 특징맵을 이용하는 제1 인공신경망모델을 위한 제1 세트의 머신 코드와, 제2 사이즈(예, 320 x 320 x 3)의 입력 특징맵을 이용하는 제2 인공신경망모델을 위한 제2 세트의 머신 코드를 포함할 수 있다. 추가적으로, 복수의 머신 코드들의 세트는 제3 사이즈의 입력 특징맵을 이용하는 제3 인공신경망모델을 위한 제3 세트의 머 신 코드를 더 포함할 수도 있다. 예를 들면, 메모리 내의 머신 코드 저장부는 컴파일된 복수의 머신 코드들의 세트를 저장할 수 있다. 이 경우, NPU 컨트롤러 내의 펌웨어 저장부는 복수의 머신 코드들의 세트에 대한 인덱스 정보 만을 저장하고 있을 수 있다. 예를 들면, NPU 컨트롤러의 펌웨어 저장부는 컴파일된 복수의 머신 코드들의 세트를 저장할 수 있다. 예를 들면, NPU 컨트롤러의 펌웨어 저장부는 메모리에서 복수의 머신 코드들의 세트에서 현재 처리중 인 특정 머신 코드만 임시 저장하고 있을 수 있다. 이동가능한 기기의 구동 초기에, CPU는 NPU 컨트롤러 내의 펌웨어 저장부로부터 복수의 머신 코드들의 세트에 대한 인덱스 정보를 로딩한 후, CPU 내의 캐시 메모리에 저장해둘 수 있다. 메모리 내의 머신 코드 별 가중치 저장부는 각 인공신경망모델에 대응하는 머신 코드를 위한 가중치들을 저장할 수 있다. 예를 들어, 메모리 내의 머신 코드 별 가중치 저장부는 제1 인공신경망모델에 대응하는 제1 세트의 머신 코드를 위한 가중치들의 제1 세트와, 제2 인공신경망모델에 대응하는 제2 세트의 머신 코드를 위한 가중치들의 제2 세트를 저장할 수 있다. 추가적으로, 메모리 내의 머신 코드 별 가중치 저장부는 제3 인공신경망모델에 대응하는 제3 세트의 머신 코드를 위한 가중치들의 제3 세트를 저장할 수 있다. CPU는 제1 카메라의 제1 이미지 센서(1021-2) 또는 제1 ISP(1021-4) 또는 제2 카메라의 제2 이미지 센서 (1022-2) 또는 제2 ISP(1022-4)를 제어하여, 촬영된 영상 또는 복수의 이미지를 시스템 버스을 통하여 메 모리의 이미지 저장부에 저장되도록 한다. 그러면, NPU는 NPU 컨트롤러의 제어에 따라 DMA를 이용하여, 메모리의 이미지 저장부로부 터 영상 또는 복수의 이미지를 가져와서 내부 메모리의 입력 특징맵 저장부에 저장시킬 수 있다. CPU는 센싱부으로부터 고도 정보(예컨대, 해수면 또는 지면으로부터의 높이에 대한 정보)를 수신할 수 있다. 만약, 비행 고도가 상승되는 경우(즉, 해수면 또는 지면으로부터 이동가능한 기기의 높이가 높아지는 경우), 이 미지 내에서 객체의 사이즈는 보다 작아지기 때문에, 객체는 NPU에 의해서 제1 임계값 보다 작은 신뢰도 레벨로 감지되거나, 감지가 실패될 수 있다. 따라서, CPU는 감지 또는 추적의 정확도를 높이기 위하여, CPU는 복수의 머신 코드들의 세트 중에서 해당 고도에 적합한 복수의 머신 코드들의 세트를 선택할 수 있 다. 그리고, CPU는 선택한 복수의 머신 코드들의 세트에 대한 인덱스 정보를 NPU로 전달할 수 있다. 그러면, NPU는 전달받은 인덱스 정보에 기초하여, 펌웨어 저장부로부터 선택된 복수의 머신 코드들의 세트 를 가져올 수 있다. 대안적으로, NPU는 전달받은 인덱스 정보에 기초하여, DMA를 이용하여 메모리 내의 머신 코드 저장부로부터 선택된 복수의 머신 코드들의 세트를 가져올 수 있다. 또한, NPU는 전달받은 인덱스 정보에 기초하여, DMA를 이용하여 메모리 내의 머신 코드 별 가중 치 저장부로부터 선택된 복수의 머신 코드들의 세트를 위한 가중치들을 가져올 수 있다. 앞서 설명한 바와 같이, 비행 고도가 낮은 경우, 이미지 내에서 객체의 사이즈는 상대적으로 작지 않게 포착되 기 때문에, 제1 인공신경망모델에 대응하는 제1 세트의 머신 코드를 위한 가중치들을 이용하여, 제1 인공신경망 모델의 합성곱 연산이 수행될 수 있다. 그러나, 비행 고도가 상승되는 경우(즉, 해수면 또는 지면으로부터 이동가능한 기기의 높이가 높아지는 경우), 이미지 내에서 객체의 사이즈는 상대적으로 작게 포착되기 때문에, 제2 인공신경망모델에 대응하는 제2 세트의 머신 코드를 위한 가중치들을 이용하여, 제2 인공신경망모델의 합성곱 연산이 수행될 수 있다. 이 처럼, 상기 제1 인공신경망모델의 합성곱 연산 또는 상기 제2 인공신경망모델의 합성곱 연산은, 이미지의 사 이즈 또는 이미지 내에서 객체의 사이즈에 기초하여, 선택적으로 수행될 수 있다. 한편, 비행 고도가 상승되는 경우 감지 또는 추적의 정확도를 높이기 위하여, CPU는 제어 신호(예, 결정 데이터)를 생성한 후, 카메라 조정부의 제1 카메라의 제1 이미지 센서(1021-2) 또는 제1 ISP(1021-4) 또 는 제2 카메라의 제2 이미지 센서(1022-2) 또는 제2 ISP(1022-4)에게 전달할 수 있다. 제어 신호(예, 결정 데이터)는 제1 카메라의 제1 이미지 센서(1021-2) 또는 제2 카메라의 제2 이미지 센 서(1022-2)가 캡쳐링된 이미지의 해상도를 조절하기 위한 것일 수 있다. 제어 신호(예, 결정 데이터)는 제1 카메라의 제1 ISP(1021-4) 또는 제2 카메라의 제2 ISP(1022-4)가 캡 쳐링된 이미지를 다운스케일링 또는 업스케일링할 수 있도록 하기 위한 것일 수 있다. 구체적으로, 비행 고도가 낮은 경우에는, 제어 신호(예, 결정 데이터)는 다운스케일링의 수준을 높일 수 있다. 예를 들어, 촬영된 원본 이미지의 사이즈가 2048 x 2048 x 3인 경우, 비행 고도가 낮아지면 제어 신호(예, 결정 데이터)는 다운스케일링의 수준을 높임으로써, 320 x 320 x 3 사이즈의 이미지로 변환되도록 할 수 있다. 반대 로, 비행 고도가 높아지면 제어 신호(예, 결정 데이터)는 다운스케일링의 수준을 낮춤으로써, 2048 x 2048 x 3 사이즈의 촬영 원본 이미지를 1920 x 1920 x 3 사이즈의 이미지로 변환되도록 할 수 있다. 대안적으로, 비행 고 도가 더 높아지면 제어 신호(예, 결정 데이터)는 업스케이링을 지시할 수 있고, 그에 따라 2048 x 2048 x 3 사이즈의 촬영 원본 이미지는 4096 x 4096 x 3 사이즈의 이미지로 변환될 수 있다. 변환된 이미지는 메모리 의 이미지 저장부에 저장되게 된다. 따라서 NPU에서 처리해야할 데이터 사이즈가 저감될 수 있다. 이에, 이동가능한 기기의 소비 전력이 저감되고, 비행 시간이 증가될 수 있다. 다른 한편, NPU가 CPU으로부터 전달받은 인덱스 정보에 기초하여, 펌웨어 저장부로부터 선택된 복수 의 머신 코드들의 세트를 가져온 다음, NPU는 머신 코드에 따라 미리 정해진 타일링 개수를 확인한다. 그 다음, NPU는 메모리의 이미지 저장부에 저장되어 있는 변환 이미지를 타일링 개수에 따라 블록 단 위로 분할하여, DMA를 이용하여 NPU의 내부 메모리 내의 입력 특징맵 저장부에 저장시킨다. 예를 들어, 비행 고도가 낮아서 해상도 저감 또는 다운스케일링이 높은 수준으로 수행된 경우, 메모리의 이미지 저장부에 저장되어 있는 변환 이미지의 사이즈는 640 x 640 x 3일 수 있다. 이 경우, 640 x 640 x 3 사 이즈의 변환 이미지는 320 x 320 x 3 사이즈의 4개의 블록들로 타일링될 수 있다. 따라서, NPU는 메모리 의 이미지 저장부에 저장되어 있는 640 x 640 x 3 사이즈의 변환 이미지를 4개의 블록들(예, 제1 블록, 제 2 블록, 제3 블록 그리고 제4 블록)로 분할한 뒤, 320 x 320 x 3 사이즈의 제1 블록을 DMA를 이용하여 NPU의 내부 메모리 내의 입력 특징맵 저장부에 저장시킨다. 그러면, NPU의 PE들은 내부 메모리의 입력 특징맵 저장부로부터 제1 블록을 읽어오고, 내부 메 모리의 가중치 저장부로부터 가중치를 읽어와서, 합성곱 연산을 수행한다. 이어서, NPU의 PE들 은 내부 메모리의 입력 특징맵 저장부로부터 제2 블록을 읽어오고, 내부 메모리의 가중치 저장부로부 터 가중치를 읽어와서, 합성곱 연산을 수행한다 NPU의 PE들은 합성곱 연산의 수행에 따라 생성된 출력 특징맵을 내부 메모리의 출력 특징맵 저 장부에 저장시킨다. 도 12A 및 도 12B는 피사체를 포함하는 이미지의 예를 나타낸 예시도들이다. 도 12A에 도시된 이미지(900a)는 예를 들어 이동가능한 기기의 비행 고도가 낮을 때 제1 카메라 또는 제2 카메라에 의해서 촬영된 이미지일 수 있다. 비행 고도가 낮기 때문에, 상기 촬영된 이미지(900a) 내에서 제1 피사체과 제2 피사체는 사이즈가 상대적으로 크게 나타날 수 있다. 이처럼, 제1 피사체과 제2 피사체는 사이즈가 상대적으로 크게 보이기 때문에, 제1 인공신경망모델을 이용하여서도 잘 감지될 수 있다. 한편, 도 12B에 도시된 이미지(900b)는 예를 들어 이동가능한 기기의 비행 고도가 높을 때, 제1 카메라 또는 제2 카메라에 의해서 촬영된 이미지일 수 있다. 비행 고도가 높기 때문에, 상기 촬영된 이미지 (900b) 내에서 제1 피사체과 제2 피사체는 사이즈가 상대적으로 작게 나타날 수 있다. 이처럼, 제1 피사체과 제2 피사체는 사이즈가 상대적으로 작게 보이기 때문에, 상기 이미지(900b) 내 에서 상기 제1 피사체과 제2 피사체를 상기 제1 인공신경망모델을 이용하여 감지 혹은 추적한 결과에 대한 신뢰도 레벨은 제1 임계값 보다 낮을 수 있다. 이 경우, 상기 감지 또는 상기 추적의 정확도를 높이기 위하여, 상기 CPU는 상기 센싱부로부터 획 득된 고도 정보에 기초하여, 상기 제1 ISP(1021-4) 또는 상기 제2 ISP(1022-4)에게 제2 인공신경망모델을 위한 입력 특징맵 사이즈로 이미지를 제공해달라는 제어 신호를 전달할 수 있다. 그러면, 상기 제1 ISP(1021-4) 또는 상기 제2 ISP(1022-4)는 이미지를 상기 제어 신호에 따른 사이즈로 다운스케일링한 후, 상기 메모리 내의 이미지 저장부에 저장할 수 있다. 또한, CPU는 상기 센싱부로부터 획득된 고도 정보에 기초하여, 제2 인공신경망모델을 선택할 수 있 다. 그리고, 상기 CPU는 상기 선택된 제2 인공신경망모델에 대응하는 머신 코드의 세트에 대한 인덱스 정 보를 상기 NPU로 전달할 수 있다. 그러면, 상기 NPU 컨트롤러는 상기 인덱스 정보에 기초하여, 펌웨어 저장부 혹은 상기 메모리 내의 머신 코드 저장부로부터 상기 선택된 복수의 머신 코드들의 세트를 가져올 수 있다. 또한, 상기 NPU 컨트롤러 는 상기 전달받은 인덱스 정보에 기초하여, 상기 DMA를 이용하여 상기 메모리 내의 머신 코드 별 가중치 저장부로부터 상기 선택된 복수의 머신 코드들의 세트를 위한 가중치들을 가져올 수 있다. 이후, 상기 NPU 컨트롤러는 상기 PE들을 제1 그룹(즉, 제1 부분)의 PE들과 제2 그룹(즉, 제2 부분)의 PE들로 분할할 수 있다. 다시 말해서, 상기 NPU 컨트롤러는 상기 PE들 중에서 제2 그룹(즉, 제2부분)의 PE들을 선정할 수 있다. 그러면, 상기 제2 그룹의 PE들은 상기 제2 인공신경망모델을 위한 제2 연산을 수행할 수 있다. 한편, 입력 특징맵 사이즈 별 인공신경망모델과 가중치를 정리하여 나타내면 아래의 표와 같다. 표 1 구분 입력 특징맵 사이즈머신 코드의 세트머신 코드 세트의 인 덱스가중치 제1 인공신경망모델 200 x 200 제1 세트의 머신 코 드01 제1 세트의 가중치 제2 인공신경망모델 320 x 320 제2 세트의 머신 코 드02 제2 세트의 가중치 제3 인공신경망모델 400 x 400 제3 세트의 머신 코 드03 제3 세트의 가중치 도 13은 본 개시에 따른 일 방안을 나타낸 흐름도이다. 도 13을 참조하면, 다수의 PE들이 제1 그룹의 PE들과 상기 제2 그룹의 PE들로 분할될 수 있다(S1310). 이어서, 상기 제1 그룹의 PE들을 이용하여 제1 인공신경망모델이 연산될 수 있다(S1320). 즉, 상기 제1 그룹의 PE들은 제1 인공신경망모델의 합성곱 연산을 수행할 수 있다. 그리고, 상기 제2 그룹의 PE들을 이용하여 제2 인공신경망모델이 연산될 수 있다(S1330). 즉, 상기 제2 그룹의 PE들은 제2 인공신경망모델의 합성곱 연산을 수행할 수 있다. 상기 제1 인공신경망모델의 연산과 상기 제2 모델의 연산은 순차적으로 또는 동시에 진행될 수 있다. 상기 제1 그룹의 PE들의 개수와 상기 제2 그룹의 PE들의 개수가 각각 조정될 수 있다. 예를 들어, 상기 다수의 PE들 중에서 상기 제1 그룹의 PE들의 개수가 감소되고 그리고 상기 제2 그룹의 PE들의 개수가 증가될 수 있다. 반대로, 상기 다수의 PE들 중에서 상기 제2 그룹의 PE들의 개수가 감소되고 그리고 상기 제1 그룹의 PE들의 개 수가 증가될 수 있다. 상기 제1 인공신경망모델의 합성곱 연산 또는 상기 제2 인공신경망모델의 합성곱 연산은, 이미지의 사이즈 또는 이미지 내에서 객체의 사이즈에 기초하여, 선택적으로 수행될 수 있다. 본 명세서와 도면에 나타난 본 개시의 예시들은 본 개시의 기술 내용을 쉽게 설명하고 본 개시의 이해를 돕기 위해 특정 예를 제시한 것뿐이며, 본 명의 범위를 한정하고자 하는 것은 아니다. 지금까지 설명한 예시들 이외 에도 다른 변형 예들이 실시 가능하다는 것은 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 자명 한 것이다.도면 도면1 도면2a 도면2b 도면3 도면4a 도면4b 도면5 도면6a 도면6b 도면7 도면8 도면9 도면10a 도면10b 도면11 도면12a 도면12b 도면13"}
{"patent_id": "10-2022-0178058", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 인공신경망모델을 설명하는 개략적인 개념도이다. 도 2A은 컨볼루션 신경망(CNN)의 기본 구조를 설명하기 위한 도면이다. 도 2B는 컨볼루션 신경망의 동작을 이해하기 쉽게 나타낸 종합도이다. 도 3은 본 개시에 따른 신경 프로세싱 유닛을 설명하는 개략적인 개념도이다. 도 4a는 본 개시에 적용될 수 있는 복수의 프로세싱 엘리먼트 중 하나의 프로세싱 엘리먼트를 설명하는 개략적 인 개념도이다. 도 4b는 본 개시에 적용될 수 있는 SFU를 설명하는 개략적인 개념도이다.도 5는 도 3에 도시된 NPU의 변형예를 나타낸 예시도이다. 도 6A 및 도 6B는 본 개시가 적용되는 드론(Drone)의 예들을 나타낸다. 도 7은 도 6A 및 도 6B에 도시된 복수의 카메라의 구성을 나타낸 예시도들이다. 도 8은 도 6A 및 도 6B에 도시된 드론의 구성을 예시적으로 나타낸 블록도이다. 도 9는 고도에 따라 인공신경망모델들을 스위칭하는 예를 나타낸 개념도이다. 도 10A는 복수의 신경망 모델들의 연산이 할당된 PE들을 나타낸 예시도이다. 도 10B는 복수의 신경망 모델들에 대한 연산이 수행되는 예를 나타낸다. 도 11은 도 8에 도시된 구성을 주요 동작 관점에서 나타낸 블록도이다. 도 12A 및 도 12B는 피사체를 포함하는 이미지의 예를 나타낸 예시도들이다. 도 13은 본 개시에 따른 일 방안을 나타낸 흐름도이다."}
