{"patent_id": "10-2021-0073952", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0165393", "출원번호": "10-2021-0073952", "발명의 명칭": "수소가스 위험시설물 관리장치 및 그 장치의 구동방법", "출원인": "케이에스이씨 주식회사", "발명자": "김광석"}}
{"patent_id": "10-2021-0073952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "위험 시설물이 설치되는 지역의 맵(map) 데이터와 상기 위험 시설물에서의 가스 누출시 대피하기 위한 대피 장소의 정보를 매칭시켜 저장하는 저장부; 및상기 위험 시설물에서의 가스 누출 발생시 기상 상태, 상기 저장한 맵 데이터 및 상기 대피 장소의 정보를 근거로 가스 확산 분석을 수행하여 상기 기상 상태에 따른 가스 누출 영역 및 가스 영향권을 각각 추출하고, 상기추출한 가스 영향권 내의 임의의 대피 장소에서 최단거리에 있는 복수의 건물에 대한 건물정보를 그룹화하여 메타데이터의 형태로 알람 메시지를 생성하는 제어부;를포함하는 수소가스 위험시설물 관리장치."}
{"patent_id": "10-2021-0073952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 가스 확산 분석을 위한 복수의 프로그램 모델 중 시뮬레이션의 분석 결과에 의해 상기 위험 시설물이 설치되는 지역에 최적화되는 하나의 분석 모델을 선정하여 상기 가스 확산 분석을 수행하는 수소가스 위험시설물 관리장치."}
{"patent_id": "10-2021-0073952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는, 상기 분석 모델로서 가우시안 플름(Plume) 모델 및 가우시안 퍼프(Puff) 모델 중 하나를 선정하여 실행시키는 수소가스 위험시설물 관리장치."}
{"patent_id": "10-2021-0073952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는, 상기 메타데이터를 생성하기 위하여 순위에 따라 구분되는 각 대피 장소와 상기 각 대피 장소에소속되는 복수의 건물의 건물 정보를 통합하는 수소가스 위험시설물 관리장치."}
{"patent_id": "10-2021-0073952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는 학교, 운동장 또는 공원을 포함하는 공공시설을 1순위의 대피 장소로 구분하여 상기 1순위의 대피 장소에 소속되는 복수의 건물 중 상기 위험 시설물과 최단거리에 있을 때 상기 메타데이터에 포함시키는 수소가스 위험시설물 관리장치."}
{"patent_id": "10-2021-0073952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 제어부는, 상기 가스 누출 영역 및 상기 가스 영향권을 추출할 때 누출 가스의 유형에 근거해 서로 다른크기의 영역을 추출하는 수소가스 위험시설물 관리장치."}
{"patent_id": "10-2021-0073952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 제어부는, 상기 지역의 신선한 공기량 대비 유독가스의 비율(PPM)을 계산하여 상기 계산한 비율을 근거로상기 가스 누출 영역 및 상기 가스 영향권을 추출하는 수소가스 위험시설물 관리장치.공개특허 10-2022-0165393-3-청구항 8 제4항에 있어서,상기 제어부는, 상기 가스 누출 영역을 추출하고, 상기 추출한 가스 누출 영역에 겹치는 상기 가스 영향권을 추출하며, 상기 가스 영향권을 추출할 때 상기 지역에서의 최소 단위의 행정 구역을 추출하는 수소가스 위험시설물 관리장치."}
{"patent_id": "10-2021-0073952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "저장부가, 위험 시설물이 설치되는 지역의 맵 데이터와 상기 위험 시설물에서의 가스 누출시 대피하기 위한 대피 장소의 정보를 매칭시켜 저장하는 단계; 및제어부가, 상기 위험 시설물에서의 가스 누출 발생시 기상 상태, 상기 저장한 맵 데이터 및 상기 대피 장소의정보를 근거로 가스 확산 분석을 수행하여 상기 기상 상태에 따른 가스 누출 영역 및 가스 영향권을 각각 추출하고, 상기 추출한 가스 영향권 내의 임의의 대피 장소에서 최단거리에 있는 복수의 건물에 대한 건물정보를 그룹화하여 메타데이터의 형태로 알람 메시지를 생성하는 단계;를포함하는 수소가스 위험시설물 관리장치의 구동방법."}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 위험시설물 관리장치 및 그 장치의 구동방법에 관한 것으로서, 본 발명의 실시예에 따른 수소가스 위 험시설물 관리장치는, 위험 시설물이 설치되는 지역의 맵 데이터와 상기 위험 시설물에서의 가스 누출시 대피하 기 위한 대피 장소의 정보를 매칭시켜 저장하는 저장부, 및 위험 시설물에서의 가스 누출 발생시 기상 상태, 저 장한 맵 데이터 및 대피 장소의 정보를 근거로 가스 확산 분석을 수행하여 기상 상태에 따른 가스 누출 영역 및 가스 영향권을 각각 추출하고, 추출한 가스 영향권 내의 임의의 대피 장소에서 최단거리에 있는 복수의 건물에 대한 건물정보를 그룹화하여 메타데이터의 형태로 알람 메시지를 생성하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 수소가스 위험시설물 관리장치 및 그 장치의 구동방법에 관한 것으로서, 더 상세하게는 가령 가정이 나 산업 현장에서 사용되는 가스의 확산 위험을 분석하여 사건이나 사고를 미연에 방지하거나 빠르게 대처할 수 있는 수소가스 현장 시설물 관리장치 및 그 장치의 구동방법에 관한 것이다."}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 유선에 의한 가스 제어·차단 서비스는 재난 상황 발생시 단선으로 인한 유선 통신망의 동작 불능으로 인해 정상적인 기능 수행이 불가능하고, 유선 기반 서비스의 정상적인 기능 수행 불가는 2차 피해에 대한 대응 의 어려움을 초래하여, 대형 재난 사고를 유발할 수 있는 문제가 있다. 따라서, 무선 기반 가스 제어·차단 서 비스 제공으로 비용 절감을 통한 보급 확산의 필요성이 제기되고 있다. 또한, 기존의 유선 기반 가스 제어·차 단 서비스는 장거리 선로 구축 및 격오지 선로 구축비용이 과도하게 발생하고, 자연 재해 및 사고 등에 의한 복 구 발생 시 설비 및 인건비가 과도하게 발생하는 문제가 있다. 기존 유선 기반 가스 차단 서비스를 무선으로 대 체할 경우, 기존 대비 설치 및 운영비용이 60% 이상 절감할 수 있어서, 비용 절감에 따른 보급화가 확산될 수 있다. 무선 기반 가스 감지 서비스는 안전성 및 편리성을 제공해 줄 수 있음에도 불구하고, 기존에는 단순 감지 데이 터를 전송하는 역할만을 수행하였다. 사회와 산업 규모의 발달에 따라 대규모, 복합 및 고밀도화되고 있는 가스 안전시설의 이상 상황 발생시, 제어 및 차단에 대한 의사결정에 필요한 높은 유의도 수준의 정보를 지원하여 시설 환경의 변화, 주변 상황, 장치나 작업 인원의 이동 등 상황의 복잡성 또는 근무 피로로 유발되는 인적 오판에 의한 위험 발생 확률을 낮추고, 원 격 조정으로 신속한 대처가 가능한 운영 환경을 조성하여 시설의 안전 수준을 높여 재난으로부터 국민을 안전하 게 보호하고, 일상생활을 유지할 수 있는 서비스 개발이 필요하다. 또한, 도시 구조물의 대형화, 복잡화, 고층화로 인해, 가스 시설이 밀집해 있어서, 가스 시설로 인한 대형화재 ·폭발 등 재난 유형이 복잡·다양화되고 있고, 가스 재난 및 가스안전사고로부터 국민안전 기본권 확대를 위해, 무인 이동체를 활용한 영상정보, 각종 센서 데이터와 가스안전 무선제어서비스 플랫폼을 연계하여 신속한 가스안전관리 대응이 가능한 가스 위험시설 주변 상황감지, 위험 감지시 가스 재난환경 변화를 예측분석하여 신 속한 조치 및 가스안전관리대응이 가능한 스마트 가스 안전 정보 분석 기술이 필요하다. 고압가스 탱크 등의 가스 시설물은 고 위험성 시설물로서, 시설물의 설치부터 운영, 폐기까지 설치된 위치에서 이동 상황이 발생해서는 안된다. 그러나, 태풍, 홍수, 산사태, 첫돌사고, 기반침하 등의 이유로 시설물의 이동이 발생할 수 있으며, 이 경우 가 스 유출로 인한 피해가 발생할 수 있다. 이에 현재 시장에서는 가스 유출 또는 누출을 조기에 예측하거나 사건이나 사고 발생시에도 빠르게 대처할 수 있는 방안이 절실히 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-0238384호(1999.10.13) (특허문헌 0002) 한국등록특허공보 제10-1146474호(2012.05.08) (특허문헌 0003) 한국등록특허공보 제10-1557745호(2015.09.30) (특허문헌 0004) 한국등록특허공보 제10-2113918호(2020.05.15) (특허문헌 0005) 한국등록특허공보 제10-2194665호(2020.12.17) (특허문헌 0006) 한국등록특허공보 제10-2185378호(2020.11.25)"}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 가령 가정이나 산업 현장에서 사용되는 가스의 확산 위험을 분석하여 사건이나 사고를 미연 에 방지하거나 빠르게 대처할 수 있는 수소가스 현장 시설물 관리장치 및 그 장치의 구동방법을 제공함에 그 목 적이 있다."}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 특허 출원은 중소벤처기업부의 규제자유특구혁신사업육성의 연구비 지원(P0011215)에 의해 수행되었습니다. 본 발명의 실시예에 따른 수소가스 위험시설물 관리장치는, 위험 시설물이 설치되는 지역의 맵(map) 데이터와 상기 위험 시설물에서의 가스 누출시 대피하기 위한 대피 장소의 정보를 매칭시켜 저장하는 저장부, 및 상기 위 험 시설물에서의 가스 누출 발생시 기상 상태, 상기 저장한 맵 데이터 및 상기 대피 장소의 정보를 근거로 가스 확산 분석을 수행하여 상기 기상 상태에 따른 가스 누출 영역 및 가스 영향권을 각각 추출하고, 상기 추출한 가 스 영향권 내의 임의의 대피 장소에서 최단거리에 있는 복수의 건물에 대한 건물정보를 그룹화하여 메타데이터 의 형태로 알람 메시지를 생성하는 제어부를 포함한다. 상기 제어부는, 상기 가스 확산 분석을 위한 복수의 프로그램 모델 중 시뮬레이션의 분석 결과에 의해 상기 위 험 시설물이 설치되는 지역에 최적화되는 하나의 분석 모델을 선정하여 상기 가스 확산 분석을 수행할 수 있다. 상기 제어부는, 상기 분석 모델로서 가우시안 플름(Plume) 모델 및 가우시안 퍼프(Puff) 모델 중 하나를 선정하 여 실행시킬 수 있다. 상기 제어부는, 상기 메타데이터를 생성하기 위하여 순위에 따라 구분되는 각 대피 장소와 상기 각 대피 장소에 소속되는 복수의 건물의 건물 정보를 통합할 수 있다. 상기 제어부는 학교, 운동장 또는 공원을 포함하는 공공시설을 1순위의 대피 장소로 구분하여 상기 1순위의 대 피 장소에 소속되는 복수의 건물 중 상기 위험 시설물과 최단거리에 있을 때 상기 메타데이터에 포함시킬 수 있 다. 상기 제어부는, 상기 가스 누출 영역 및 상기 가스 영향권을 추출할 때 누출 가스의 유형에 근거해 서로 다른 크기의 영역을 추출할 수 있다. 상기 제어부는, 상기 지역의 신선한 공기량 대비 유독가스의 비율(PPM)을 계산하여 상기 계산한 비율을 근거로 상기 가스 누출 영역 및 상기 가스 영향권을 추출할 수 있다. 상기 제어부는, 상기 가스 누출 영역을 추출하고, 상기 추출한 가스 누출 영역에 겹치는 상기 가스 영향권을 추 출하며, 상기 가스 영향권을 추출할 때 상기 지역에서의 최소 단위의 행정 구역을 추출할 수 있다. 또한, 본 발명의 실시예에 따른 수소가스 위험시설물 관리장치의 구동방법은 저장부가, 위험 시설물이 설치되는 지역의 맵 데이터와 상기 위험 시설물에서의 가스 누출시 대피하기 위한 대피 장소의 정보를 매칭시켜 저장하는 단계, 및 제어부가, 상기 위험 시설물에서의 가스 누출 발생시 기상 상태, 상기 저장한 맵 데이터 및 상기 대피 장소의 정보를 근거로 가스 확산 분석을 수행하여 상기 기상 상태에 따른 가스 누출 영역 및 가스 영향권을 각 각 추출하고, 상기 추출한 가스 영향권 내의 임의의 대피 장소에서 최단거리에 있는 복수의 건물에 대한 건물정 보를 그룹화하여 메타데이터의 형태로 알람 메시지를 생성하는 단계를 포함한다."}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면 위험 시설물에서 가령 가스 누출 사고의 발생시 기상 상태를 근거로 가스 확산을 예 측 혹은 분석하고 그에 따라 대피 장소를 선정하여 작업자 등을 대피시킴으로써 사건이나 사고에 빠르게 대처할 수 있을 것이다. 또한, 본 발명의 실시예는 안전한 대피 공간 중에서도 가장 최단거리의 장소 즉 건물을 선정하여 대피시킴으로 써 신속한 대피가 이루어질 수 있을 것이다. 나아가, 본 발명의 실시예는 사전에 시뮬레이션을 통해 특정 지역에 최적화된 분석 모델을 실행하므로 안전의 정확도를 증가시킬 수 있을 것이다."}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예에 대하여 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 위험 시설물 관리시스템을 나타내는 도면, 도 2a는 도 1의 위험 시설물 관리시 스템을 도식화하여 나타낸 도면, 도 2b는 도 1의 위험시설물 관리장치의 시뮬레이션 화면의 예시도이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 위험 시설물 관리시스템은 시설물 감시장치, 통신 망, 위험시설물 관리장치 및 서드파티장치의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 통신망과 같은 일부 구성요소가 생략되어 시설물 감시장치 와 위험시설물 관리장치가 다이렉트 통신(예: P2P 통신 등)을 수행하거나, 위험시설물 관리장치(12 0)를 구성하는 구성요소의 일부 또는 전부가 통신망을 구성하는 네트워크장치(예: 무선교환장치 등)에 통 합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 시설물 감시장치는 도 2a에서와 같이 가스 시설물 등을 감시하기 위하여 주변에 설치되는 또는 동작하는 다양한 장치를 포함할 수 있다. 본 발명의 실시예에 따른 시설물 감시장치는 드론과 같은 무인 이동체 (100')뿐 아니라, 시설물 주변을 이동하는 감지 차량, 그리고 가스 누설 등을 감지하는 가스 센서 등 다양한 장 치를 포함할 수 있다. 물론 가스 센서는 가스의 종류를 구분하기 위한 다양한 유형의 유해 가스 센서를 포함할 수 있다. 가스 시설물은 수소가스 등의 위험시설물을 나타낼 수 있다.시설물 감시장치로서 도 1의 무인 이동체(100') 즉 드론 비행체는 가스 시설물과 그 주변 지형을 촬영하고, 촬영된 영상 데이터와 현재 위치 데이터를 수집하여 통신망을 구성하는 기지국(110')으로 송출 함으로써 위험시설물 관리장치에서 위험 시설물의 설치 지역에 대한 데이터 수집과 함께 감시 동작을 수행 할 수 있을 것이다. 이와 같이 위험 시설물의 주변에서 가스 감지 등을 수행하기 위한 다양한 장치가 설치되어 운영될 수 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 뿐만 아니라, 시설물 감시장치는 위험 시설물 등의 주변에서 작업을 수행하는 작업자들의 작업모나 작업복 등과 같은 웨어러블장치를 포함할 수도 있다. 작업모에는 가스센서 등을 장착함으로써 이를 통해 가스 감지가 이루어지도록 하고, 센싱 데이터의 전송시에는 작업자의 위치에 대한 정보도 함께 주변의 기지국(110') 등으로 전송해 줄 수 있다. 본 발명의 실시예에 따른 위험 시설물의 작업 공간, 또는 그 주변 지역 등에서는 작업자들이나 다수의 사용자들 이 더 존재할 수 있다. 이러한 작업자들이나 일반 거주민들은 스마트폰 등의 사용자 단말장치를 소지할 수 있다. 따라서, 위험 시설물에서 가스 누출과 같은 위험한 상황이 발생한 경우에는 도 1의 위험시설물 관리장치 에서 제공하는 안전 대피처와 관련한 알람(혹은 알림) 메타데이터를 수신하여 이를 근거로 안전한 장소로 대피가 이루어질 수 있다. 물론 이러한 알람 메시지는 메타데이터의 형태로 제공되며, 단순히 가스 누출에 의한 것이 아니라, 주변의 기상 상태를 근거로 안전한 대피 장소가 변경되어, 다시 말해 누출되는 가스의 유형이나 기상 상태에 따라 최적화되는 대피 장소의 정보가 제공된다. 통상 메타데이터 즉 데이터에 대한 데이터는 속성 정보 또는 부가 정보 등을 포함하므로, 본 발명의 실시예에서의 메타데이터도 이러한 의미를 크게 벗어나지 않 는다. 물론 이러한 알림 메타데이터의 생성은 주변 거주자들이나 작업자들을 위한 메시지일 수 있지만, 위험 시설물이 설치되는 장소나 지역에 설치되는 다양한 장비들을 제어하기 위한 제어 데이터가 될 수도 있으므로, 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 예를 들어, 알림 메타데이터는 많은 사용자 들에게 동시에, 또 복수의 장비로 동시에 전송되는 형태로 이루어짐으로써 빠른 시간 내에 사건이나 사고에 대 피나 대처가 이루어질 수 있다. 통신망은 유무선 통신망을 모두 포함한다. 가령 통신망으로서 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서 유선망은 케이블망이나 공중 전화망(PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함하는 의미이다. 물론 본 발명의 실시예에 따른 통신망은 이에 한정되는 것이 아니며, 차세대 이동통신 시스템의 접속망으로서 가령 클라우드 컴퓨팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있다. 가령, 통신망 이 유선 통신망인 경우 통신망 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지만, 무선 통신망인 경우에는 통신사에서 운용하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속하여 데이터를 처리 하거나, BTS(Base Station Transmission), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터를 처리할 수 있다. 통신망은 액세스포인트를 포함할 수 있다. 액세스포인트는 건물 내에 많이 설치되는 펨토(femto) 또는 피 코(pico) 기지국과 같은 소형 기지국을 포함한다. 여기서, 펨토 또는 피코 기지국은 소형 기지국의 분류상 시설 물 감시장치를 최대 몇 대까지 접속할 수 있느냐에 따라 구분된다. 물론 액세스포인트는 시설물 감시장치 와 지그비 및 와이파이 등의 근거리 통신을 수행하기 위한 근거리 통신 모듈을 포함한다. 액세스포인트는 무선통신을 위하여 TCP/IP 혹은 RTSP(Real-Time Streaming Protocol)를 이용할 수 있다. 여기서, 근거리 통신 은 와이파이 이외에 블루투스, 지그비, 적외선(IrDA), UHF(Ultra High Frequency) 및 VHF(Very High Frequency)와 같은 RF(Radio Frequency) 및 초광대역 통신(UWB) 등의 다양한 규격으로 수행될 수 있다. 이에 따라 액세스포인트는 데이터 패킷의 위치를 추출하고, 추출된 위치에 대한 최상의 통신 경로를 지정하며, 지정 된 통신 경로를 따라 데이터 패킷을 다음 장치, 예컨대 위험시설물 관리장치로 전달할 수 있다. 액세스포 인트는 일반적인 네트워크 환경에서 여러 회선을 공유할 수 있으며, 예컨대 라우터(router), 리피터(repeater) 및 중계기 등이 포함된다. 위험시설물 관리장치는 가령 수소가스 등을 관리하기 위한 서버를 포함할 수 있으며, 물론 위험시설물 관 리를 위한 다양한 동작을 할 수 있지만, 본 발명의 실시예에서는 가스 누출시 대피 알람을 위한 동작을 수행할 수 있다. 기존과 같이 단순히 가스 누출을 감지하여 알람 메시지를 제공해 준다기보다는 누출되는 가스의 유형 이나 가스 누출 당시의 기상 상태 등을 근거로 정확하고 안전한 대피가 이루어지도록 하기 위한 동작을 수행한 다. 이를 위하여, 사전에 시뮬레이션 등을 통해 위험 시설물이 설치되는 지역에 대한 분석을 수행하고, 그 분석결과를 근거로 최적의 모델을 탑재하여 위험 시설물의 관리 동작이 이루어질 수 있다. 물론 위험시설물 관리장 치는 통합 운영될 수 있으므로, 복수의 모델을 탑재한 후 특정 시설물에 최적화된 모델을 선택적으로 운영 하는 것도 얼마든지 가능할 수 있다. 따라서, 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 예를 들어, 가스 확산 분석을 위해서는 가우시안 플름 모델이나 가우시안 퍼프 모델이 사용될 수 있다. 플름 모델은 가벼운 가스의 연속 누출에 적용될 수 있으며, 퍼프 모델은 가벼운 가스의 순간 누출에 적용 될 수 있지만, 어느 하나에 특별히 한정하지는 않을 것이다. 어느 하나의 모델이 선택되어 사용될 수 있으며, 하이브리드 형태로 적용될 수도 있을 것이다. 물론 여기서의 모델은 프로그램 모델이며, 프로그램의 다양한 제 품 유형을 의미한다고 볼 수 있다. 위험시설물 관리장치는 본 발명의 실시예에 따른 동작을 수행하기 위하여 위험 시설물이 설치되는 장소의 주변 지역에 대한 맵 데이터를 구축할 수 있으며, 대피 장소 등과 관련한 정보를 수집하여 구축할 수 있다. 그 리고 이러한 구축 과정이 완료되면 기상 상태를 근거로 시뮬레이선 동작이 이루어질 수도 있다. 도 2b는 시뮬레 이션 화면을 보여주고 있다. 실제 가스 누출시에 관리자장치를 통해 관리자가 육안으로 모니터상에서 확인할 수 있는 화면이라고 이해해도 무방하다. 물론 이와 관련한 자세한 내용은 이후에 좀더 다루기로 한다. 또한, 도 2b 의 이러한 시뮬레이션 과정은 특정 상황을 설정하기 위한 과정으로 이해될 수도 있다. 다시 말해, 기상 상태에 따라 위험 시설물을 기준으로 가스 누출 영역과, 또 가스 누출 영역에 접하는 가스 영향권은 상이하다. 따라서, 어떠한 기상 상태에서 어떠한 가스 누출 영역과 그에 접하는 혹은 겹치는 어떠한 가스 영향권을 추출할지를 사 전에 설정하고 특정 기상 상태를 만족할 때 그에 상응하여 기설정한 가스 누출 영역과 가스 영향권이 선택되어 야 하고, 또 그에 상응하는 대피 장소가 선정되어야 하는 것이다. 이러한 과정은 프로그램 제작시에 또는 제작 후에 별도의 설정 과정이 이루어질 수 있으며, 이의 과정에서 도 2b의 시뮬레이션 데이터가 활용될 수도 있다. 예를 들어, 도 2b에서 볼 때, 가스 확산 모델을 선택한다(① 참조). 플름이나 퍼프의 2가지 확산 모델을 선택할 수 있으며, 이는 필수 입력사항이다. 또한, 가스 확산 분석 대상 시설물을 선택한다(② 참조). 분석시 화면에 마커로 해당 위치가 표시된다. 또한, 기상 정보를 선택한다(③ 참조). 해당 일시 또는 특정 날짜에 기록된 기상 정보를 불러온다. 그리고 시뮬레이션 상세옵션을 입력한다(④ 참조). 이후 시뮬레이션 버튼을 클릭하여 가스확 산위험분석을 실행한다(⑤ 참조). 이에 따라 도 2b의 우측에서와 같이 시뮬레이션 결과가 화면에 출력된다(⑥ 참조). 도면에서 볼 때 붉은색 선은 최대 PPM을 나타내고 파란색 선은 최소 PPM을 나타낸다. 여기서, PPM은 신 선한 공기의 양에 대한 유독가스의 비율을 나타낸다. 데이터 구축과 모델의 선정 과정 등이 완료되면, 위험시설물 관리장치는 위험시설물의 상태를 감지하고, 가령 가스 누출시에는 기탑재되어 있는 플름 모델을 실행하여 기상 상태나 누출 가스의 유형 등을 근거로 가스 누출 영역을 추출한다. 이를 위하여, 도 1의 DB(120a)에 저장되어 있는 데이터를 추출할 수 있다. 가스 누출 영 역의 추출 즉 검색시에는 가스확산분석 실행시 설정한 최소 PPM의 값을 기준으로 영역을 계산한다. 또한, 가스 누출 영역에 겹치는 가스 영향권을 검색 혹은 추출한다. 가스 영향권은 가스 누출 영역에 겹치는 행정구역상의 최소 단위가 될 수 있다. 가령, '리' 단위로 가스 영향권을 검색할 수 있다. 가스 누출 영역과 가스 영향권에는 대피 장소의 정보가 포함된다. 따라서, 가스 누출 영역과 가스 영향권에 매칭되어 있는 대피 장소의 정보를 검 색한다. 가령 도 1의 DB(120a)에 맵핑 방식으로 데이터가 저장되도록 쉽게 검색이 이루어질 수 있다. 대피 장소 는 사전에 1순위, 2순위 등의 순위를 매겨 정보를 저장한다. 예를 들어 선정기준은 학교, 운동장, 공원 등의 공 공시설이 1순위가 될 수 있고, 정류장은 2순위, 그리고 은행, 마트 등 장소 검색이 용이한 특정 상호 등은 3순 위가 될 수 있다. 위험시설물 관리장치는 위의 검색된 대피 장소 중에서 가스 누출 영역의 대피 장소를 제거한다. 물론 이는 데이터 처리의 효율성 측면에서 이루어질 수 있는 것이므로, 제거 동작에 특별히 한정하지는 않을 것이다. 그리 고 가스 영향권 내 건물별 대피장소를 선정하여 건물별 최단거리 대피장소를 선정한다. 건물 좌표와 가장 가까 운 대피장소 좌표를 조회한다. 그리고, 건물정보 그룹화 동작을 수행한다. 동일한 대피장소를 갖는 건물정보를 그룹화하는 것이다. 이후 알람 메시지 메타데이터를 생성한다. 대피 장소를 기준으로 그룹화하여 알람 메시지를 생성한다. 물론 메타데이터는 다양한 속성 정보를 모두 포함한다고 볼 수 있기 때문에 본 발명의 실시예에서는 위의 그룹화되는 동일 대피장소와 대피장소 내의 대피대상 건물정보를 그룹화하여 형성한 것을 의미한다고 볼 수 있다. 위험시설물 관리장치는 생성한 알람 메시지 메타데이터를 앞서 언급한 바와 같이 위험시설물의 작업자들이 나 주변에 거주하는 거주민들이 소지하는 스마트폰 등의 사용자 단말장치로 전송해 줄 수 있다. 물론, 대피 장 소가 아니라, 위험시설물 주변의 장비를 제어하기 위한 제어 데이터가 생성되는 경우에는 해당 장비들을 지정된 상태로 제어하기 위한 데이터를 알람 메시지 메타데이터의 형태로 생성해 전송할 수도 있는 것이므로 본 발명의실시예에 따른 대피 알람에 특별히 한정하지는 않을 것이다. 서드파티장치는 위험시설물 관리장치에 연계하여 동작하는 다양한 장치를 포함할 수 있다 가령, 기상 데이터를 제공하는 기상 서버가 될 수 있으며, 서버의 형태로 운영되는 위험시설물 관리장치에 접속하여 위험시설물의 관리 즉 모니터링 동작을 수행하는 관리자의 관리자장치를 포함할 수 있다. 관리자장치는 도 2a에 서와 같이 컴퓨터 등의 모니터가 될 수 있으며, 관제센터에 구비되는 전광판 등의 디스플레이가 될 수도 있다. 또는 관리자들이 소지하는 스마트폰 등의 단말장치가 될 수도 있다. 따라서, 본 발명의 실시예에서는 어느 하나 의 형태에 특별히 한정하지는 않을 것이다. 도 3은 도 1의 위험시설물 관리장치의 세부구조를 예시한 블록다이어그램이다. 도 3에 도시된 바와 같이, 본 발명의 실시예에 따른 도 1의 위험시설물 관리장치는 통신 인터페이스부 , 제어부, 위험시설물 관리부 및 저장부의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 저장부와 같은 일부 구성요소가 생략되어 위험시설물 관리장 치가 구성되거나, 위험시설물 관리부와 같은 일부 구성요소가 제어부와 같은 다른 구성요소에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 통신 인터페이스부는 도 1의 시설물 감시장치 및 서드파티장치 중 적어도 하나의 장치와 통신한 다. 예를 들어, 시설물 감시장치는 드론 등의 무인 이동체와 통신하여 위험 시설물이 설치되는 장소를 촬 영하여 촬영영상을 제공하거나, 가스 누출이 있는 경우에는 가스 누출을 센싱하여 센싱 데이터를 제공할 수 있 다. 이외에도 위험 시설물의 위치를 측위하여 위치 정보를 제공할 수도 있으며, 기상 상태를 측정하여 풍향, 풍 속 등의 정보를 제공할 수도 있다. 물론 통신 인터페이스부는 본 발명의 실시예에 따른 동작을 수행하기 위하여 시설물 감시장치와 통신 하는 것 이외에도 기상청의 기상 서버 등과 같은 서드파티장치와 통신할 수 있으며, 위험 시설물이 설치되 는 장소의 맵 데이터를 제공하는 서비스 업체의 서버에 연동하여 동작할 수도 있다. 이에 따라 본 발명의 실시 예에 따른 서비스를 제공하기 위한 데이터 구축 동작에 관여할 수 있다. 따라서, 본 발명의 실시예에서는 어떠 한 방식으로 데이터 구축이 이루어지는지에 대하여 특별히 한정하지는 않을 것이다. 물론 통신 인터페이스부는 서드파티장치로서 관리자나 프로그램 설계자의 컴퓨터와 통신하는 것도 얼 마든지 가능하다. 따라서, 프로그램 설계자는 본 발명의 실시예에 따른 다양한 서비스가 이루어지도록 설정 동 작을 수행할 수 있다. 대표적으로, 위험 시설물에서 가스 누출이 있을 때, 최소 PPM 값을 얼마나 설정할지, 또 가스의 유형에 따라 어떠한 영역의 가스 누출 영역을 추출할지, 또 가스 누출 영역에 접촉하는 또는 겹치는 가 스 영향권을 어떠한 형태로 추출 또는 검색이 이루어지도록 할지를 설정할 수 있다. 본 발명의 실시예에서는 가 스 영향권을 검출할 때 행정구역상 '리' 단위로 검색하는 것을 예시한 바 있다. 이외에도 가스 누출 영역과 가 스 영향권 내에서 어떠한 대피장소와 또 그 대피장소 내의 어떠한 건물을 대피 건물로 이용하도록 할지에 대한 다양한 설정 가령 프로그램 설계가 이루어질 수 있다. 통신 인터페이스부는 이러한 동작에 관여할 수 있다. 물론 이러한 동작은 인공지능(AI)의 딥러닝을 통해 자동으로 수행할 수도 있을 것이다. 이외에도 통신 인터페이스부는 탑재된 프로그램에 대한 시뮬레이션 동작을 수행할 수도 있으며, 나아가 시 뮬레이션 동작에 의해 최종적으로 프로그램을 확정 혹은 결정하는 동작을 수행할 수도 있다. 즉 그러한 동작에 관여한다. 예를 들어, 2개의 가스 확산 모델을 시뮬레이션한 결과 특정 모델 즉 프로그램이 특정 지역이나 특정 위험 시설물에 정확도를 보이는 경우 이를 최적화하여 시스템을 구축하도록 관여한다. 이를 위해 통신 인터페이 스부는 관리자나 프로그래머의 요청에 따라 서드파티장치와 통신할 수 있다. 제어부는 통신 인터페이스부, 위험시설물 관리부 및 저장부의 전반적인 제어 동작을 담당 한다. 제어부는 대표적으로 본 발명의 실시예에 따른 서비스가 이루어지도록 시스템 구축 동작을 수행할 수 있으며, 구축된 시스템을 근거로 서비스를 수행할 수 있다. 시스템 구축과 관련해서는 위에서 이미 설명하였 으므로 더 이상의 설명은 생략하도록 한다. 다만 서비스 동작을 예시하면 제어부는 서비스 제공을 위하여 위험시설물 관리부와 연계하여 동작할 수 있다. 가령 특정 위험 시설물에서 가스 누출 신고가 있는 경우, 제어부는 해당 위험 시설물 주변의 기상 상태와, 또 누출된 가스의 유형을 판단하기 위한 동작을 수행할 수 있다. 이를 위하여 위험시설물 관리부에 탑재되어 있는 프로그램을 실행시킬 수 있다. 또한, 제어부는 통신 인터페이스부를 통해 제공되는 다양한 유형의 데이터나 정보를 저장부에 임시 저장한 후 위험시설물 관리부에 제공하여 시스템 구축이나 구축 이후에 서비스 제공을 위한 동작이이루어지도록 할 수 있다. 예를 들어, 시스템 구축이 완료된 상태에서 시뮬레이션 동작이 이루어지는 경우 통신 인테페이스부를 통해 요청 신호가 있을 때 시뮬레이터를 실행하여 시뮬레이션 동작이 이루어지도록 할 수 있다. 위험시설물 관리부는 위험 시설물에서 가스 누출 사고가 접수되는 경우 내부에 탑재된 프로그램을 실행하 여 해당 위험 시설물 주변의 기상 상태와, 또 누출된 가스의 유형을 판단할 수 있다. 물론 해당 가스(예: 수소 가스 등)를 포함하는 가스 확산 분석에 따라 가스 누출 영역과 그에 겹치는 가스 영향권을 도 1의 DB(120a)에서 검색 혹은 추출할 수 있다. 가스 누출 영역은 가스 확산 분석 실행시 설정한 최소 PPM의 값을 기준으로 영역을 계산하여 추출한다. 또한 가스 확산 분석 모델은 시설물 몰 질량을 가질 수 있는데, 이는 가스 종류에 따라 정 해지는 고유값을 나타낸다. 또한, 위험시설물 관리부는 가스 누출 영역과 가스 영향권을 검색하여 그에 매칭되어 있는 대피장소나, 특 정 대피장소에 매칭되어 DB(120a)에 저장되어 있는 건물정보를 검색 혹은 추출할 수 있다. 이의 과정에서 위험 시설물 관리부는 가스 누출 영역의 대피 장소는 제거하고 가스 영향권 내 건물별 대피장소를 선정하여 대 피대상 건물정보를 그룹화하고 그룹화한 건물정보를 이용해 알람 메시지 메타데이터를 생성한다. 물론 위험시설 물 관리부는 가스 누출 영역의 대피 장소나 건물 정보에 대한 검색을 배제하고 가스 영향권에 매칭되는 대 피 장소와 그에 속하는 건물 정보를 가령 도 1의 DB(120a)에서 바로 검색하는 것도 얼마든지 가능하므로 본 발 명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 물론 위험시설물 관리부는 알람 메시지 메타데이터를 생성한 후 제어부로 해당 메타메시지를 제공하 여 기설정되어 있는 작업자들이나 위험 시설물 주변의 사용자들, 혹은 거주자들에게 전송하여 신속한 대피가 이 루어지도록 한다. 실질적으로 이러한 동작은 시뮬레이션이나 실제 상황에서 인공지능(AI)의 딥러닝 등을 통해 학습이 이루어질 수 있고, 이를 통해 다양한 과정에서 정확도를 높여가는 것도 얼마든지 가능하다. 물론 가스 누출 사고가 빈번히 발행하는 일은 없지만, 가령 특정 일시의 사고에서 문제점이 발생하였다면 이의 학습을 통 해 문제점을 보완함으로써 사건, 사고의 발생시 신속한 대처가 이루어질 수 있다. 따라서 이러한 과정은 인공지 능 프로그램을 통해 자동으로 이루어질 수 있다. 이의 과정에서 위험시설물 관리부는 앞서 언급한 바 있는 다양한 시각화 화면을 생성하여 관리자들의 모니터링이 이루어지도록 관리자장치로 데이터를 제공할 수 있다. 저장부는 제어부의 제어하에 처리되는 다양한 유형의 데이터나 정보를 임시 저장하는 동작을 수행한 다. 이를 위하여 저장부는 램(RAM)이나 롬(ROM) 등의 메모리로 구성될 수 있다. 저장부는 위험시설물 관리부에 의해 처리되는 분석 결과를 임시 저장한 후 제어부의 제어하에 도 1의 DB(120a)에 체계적으 로 분류하여 저장되도록 할 수 있다. 상기한 내용 이외에도 도 3의 통신 인터페이스부, 제어부, 위험시설물 관리부 및 저장부는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한 다. 한편, 본 발명의 다른 실시예로서 제어부는 CPU 및 메모리를 포함할 수 있으며, 원칩화하여 형성될 수 있 다. CPU는 제어회로, 연산부(ALU), 명령어해석부 및 레지스트리 등을 포함하며, 메모리는 램을 포함할 수 있다. 제어회로는 제어동작을, 그리고 연산부는 2진비트 정보의 연산동작을, 그리고 명령어해석부는 인터프리터나 컴 파일러 등을 포함하여 고급언어를 기계어로, 또 기계어를 고급언어로 변환하는 동작을 수행할 수 있으며, 레지 스트리는 소프트웨어적인 데이터 저장에 관여할 수 있다. 상기의 구성에 따라, 가령 위험시설물 관리장치 의 동작 초기에 위험시설물 관리부에 저장되어 있는 프로그램을 복사하여 메모리 즉 램(RAM)에 로딩한 후 이를 실행시킴으로써 데이터 연산 처리 속도를 빠르게 증가시킬 수 있다. 도 4a 내지 도 4d는 가우시안 퍼프 모델의 가스 확산 분석을 설명하는 도면이며, 도 5a 내지 도 5d는 가우시안 플름 모델의 가스 확산 분석을 설명하는 도면이다. 가우시안 모델의 특징은 오염농도가 연기 중심축으로부터의 거리에 따라 정규분포 즉 가우시안 분포를 이룬다는 통계적 가정을 채택하며, 예측 정확도에 한계가 있기는 하지만 비교적 정확하고 사용이 간편하다. 퍼프 모델은 가수의 순간 방출을 나타낸 것으로써 한순간에 방출된 가스의 시간에 따른 분포 변화를 나타낸 모델이며, 플름 모델은 가스의 연속 방출을 나타낸 것으로써 변하지 않고 무한히 연속하여 방출되는 가스의 분포를 나타낸 모델 이다. 좀더 살펴보면, 가우시안 퍼프 모델과 가우시안 플름 모델은 공정위험성 평가시 화재, 폭발, 누출과 같은 사고 시의 피해 정보 및 피해 범위 등을 정량적으로 선정하고 피해를 최소화 대책을 수립하는 등의 공정 위험성 평가에 대한 누출 모델이다. 사고 피해 예측은 4단계에 의해 진행되는데 가우시안 퍼프 모델과 가우시안 플름 모델 은 가벼운 가스의 확산 모델에 해당한다. 사고피해 예측 절차에서 1단계는 근본적인 위험 요소 확인 단계, 즉 정성적인 위험성 평가 단계로서 주로 위험과 운전 분석 기법 또는 체크리스트 기법 등에 의하여 공정 내에 잠재 하고 있는 위험요소를 확인한다. 2단계는 누출 모델 작성 단계로서 누출 모델은 물질이 어떻게 누출되는지를 분 석하는 것이다. 3단계는 확산 모델로서 2단계의 누출 모델을 근거로 대기 중으로 확산되는 위험 물질의 거리에 따른 농도, 확산되는 증기를 구름의 크기, 농도, 형태를 예측한다. 4단계는 피해 예측 단계로 누출되는 위험물 질이 작업자, 인근 주민 또는 주변 환경/시설에 미치는 영향을 계산한다. 또한 더블 가우시안 퍼프는 double G(총 누출량(kg)), double x(누출지점으로부터 바람 방향의 수평 거리(m)), double y(누출지점으로부터 바람 방향의 수직 거리(m)), double z(측정 높이), double u(풍속(km/h)), double t(누출 순간으로부터의 시간(초)), double H(누출 높이), char stability(대기안정도)를 입력 파라미터로 하며, double concertration(누출 순간으로부터 t 시간 이후 해당지점의 가스농도)를 출력 결과로 한다. 파라미터를 입력하면 파라미터에 따른 누출 순간으로부터 t 시간 이후 해당 지점의 가스농도를 알 수 있다. 한편, 더블 가우시안 플름은 double G(초당 누출량(kg/s)), double x(누출지점으로부터 바람 방향의 수평 거리 (m)), double y(누출지점으로부터 바람 방향의 수직 거리(m)), double z(측정 높이), double H(누출 높이), double u(풍속(km/h)), char _stability(대기안정도), char _RUcondition(농촌(R), 도시 (U))를 입력 파라미터 로 하며, double concertration(해당지점의 가스농도)를 출력 결과로 한다. 파라미터를 입력하면 파라미터에 따 른 누출 순간으로부터 t 시간 이후 해당 지점의 가스농도를 알 수 있다 상기의 모델들은 PPM 변환 동작을 수행할 수 있으며, 가령 더블 변환PPM은 입력 파라미터로서 double concentration(농도), double temp(온도), double pressure(압력), double moleWeight(몰질량)을 사용하며, double PPMconcertration(PPM)을 출력 결과로 한다. 파라미터를 입력하면 파라미터에 따른 PPM을 알 수가 있다. 상기의 모델 중 가우시안 퍼프 모델은 가벼운 가스의 순간 누출에 적용하며, 가우시안 퍼프 모델은 다음을 전제 조건으로 한다. 1)장애물이 없는 평평한 곳에서 누출이 일어난다. 2) 화학반응이나 열역학적인 영향이 없다 3) 누출기간이 일정지점에 도달하는 데 걸리는 시간보다 짧다 4) 누출된 물질은 오랜시간 동안 공기 중에 머무를 수 있는 안정된 가수이다 5)예측농도가 순간누출의 최대농도이다 6)누출이 한 지역에서 일어난다 등을 포함한다. 농도 예측 순서는 확산계수 산출, 유효누출높이 산출, 일정지점에서의 농도 산출 등의 순으로 이루어 진다. 한편, 본 발명의 실시예에 따른 퍼프 모델의 가시화 방법을 살펴보면, 가스안전공사에서 제공된 알고리즘인 gaussianPuff는 가스 순간 방출 이후 t 시간 후의 방출지점으로부터 x, y 지점의 가스 농도이다. 또한 가시화를 하기 위한 방법으로 일정 PPM 이상의 지점인지 확인하고 그 부분에 대해서 색을 표시하기로 결정하였다. 최대검 측 PPM과 최소검측 PPM을 설정하였고, 그 사이를 단계별로 표시하기 위해 분할 PPM을 설정하였다. 최대검측 PPM 이상의 PPM을 가진 지점에 대해 빨간색으로 표시하였고, 적녹청(RGB) 패턴대로 PPM 순차별로 색을 변경하였다. 시간별로 생성된 정보를 지도에 표시하였다. 퍼프 모델의 분석 프로세스는 반복문을 이용하여 분석 시간을 최대 분석 시간까지 분석 시간 분할만큼 증가시키 며 다음의 프로세스를 진행한다(1번). 반복문을 이용하여 기준 PPM이 최소 PPM보다 클 때까지 최대 PPM부터 PPM 분할만큼 감소시키며 다음의 프로세스를 진행한다(2번). 이중 포문을 이용하여 x, y를 증가시키며 gaussianPuff 를 실행시켜 해당 지점의 PPM을 구하면 아래의 데이터가 생성된다(3번). 표 1"}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "위의 데이터의 마지막데이터처럼 PPM 중 최초로 기준 PPM보다 낮은 지점의 x,y 값을 Array 추가한다(4번). -y에 대해서도 동일한 값을 가지기 때문에, 저장된 Array값을 순차적으로 y값에 -1을 곱해 저장한다(5번). Array의 지점이 나타내는 위치를 위경도 좌표로 변경시킨다(6번). 위경도 좌표의 중심점을 구한다(7번). 중심점으로부터각 지점의 평균 거리를 구해 반지름으로 사용한다(8번). 중심점과 반지름과 기준 PPM을 배열에 추가한 후 2번으 로 돌아가 반복한다(9번). 시간 기준 PPM 단계별로 중심점(center)과 중심점으로부터 평균거리(radius)를 DB에 저장한다(10번). 저장된 원을 Leaflet을 이용하여 PPM별로 다른 색으로 지도에 그린다(11번). 또한, 퍼프 모델에서의 입력 파라미터 및 안정도는 <표 2> 및 <표 3>에서와 같이 결정될 수 있다. 날씨에 따라 대기 안정도가 변화한다. 하지만, 원활한 시뮬레이션 동작을 위해 시뮬레이션 동작시 해당 값을 입력해 준다. Default 값은 D이다. 표 2 Data 설명 단위 value(예시) 비고 vec 풍향 ° 120 기상청데이터 wsd 풍속 m/s 5 기상청데이터 t1h 기온 ℃ 27 기상청데이터 moleWeight 몰 mol 17.1 위험물데이터 baseX 경도 ° 127.429104 위험물데이터 baseY 위도 ° 36.725467 위험물데이터 totalReleaseAmount총 유출량 kg 700 위험물데이터 leakHeiht 위험물높이 m 1.5m 위험물데이터 stability 대기안정도 char D 분석파라미터 simulTime 분석시간 분 10 분석파라미터 simulTimePer 분석시간분할초 10 분석파라미터 maxPPM 최대검측 PPMPPM 10000 분석파라미터 minPPM 최소검측 PPMPPM 2000 분석파라미터 ppmPer PPM 분할 PPM 2000 분석파라미터 표 3"}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "퍼프 모델의 분석 기준 데이터를 구하기 위해 위의 입력파라미터로 분석을 실행하였다. 분석은 t가 simulTime에 도달할 때까지 실행되며, simulTime은 simulTimePer 만큼 증가한다. 기준 PPM은 maxPPM 10000,PPMPer 2000, minPPM 2000 일 때 10000,8000,6000,4000,2000이며, x y를 증가시키며 기준 PPM 이하로 들어왔을 때의 X, Y 좌 표데이터를 획득하여 기준데이터 (Array) 를 생성할 수 있다. 도 4a는 기준데이터 중 일부를 보여주고 있다. 기준 데이터를 이용하여 PPM 경계의 중심점과 반지름을 계산하여 DB에 저장한다. 가령, 중심 좌표는 127.42641 36.71957, 반지름은 32.07373m가 될 수 있다. 다음은 퍼프 모델의 시뮬레이션 출력데이터를 보여주고 있다. <표 4>는 출력데이터에 포함되는 용어의 설명이다. [퍼프 모델의 시뮬레이션 출력데이터] time : 140 max_conc : 13838.937 circle_datas: [{\"radius\":19.958208,\"x\":127.4359062,\"y\":36.7223304,\"ppm\":10000.0},{\"radius\":25.938138,\"x\":127.435911 1,\"y\":36.7223282,\"ppm\":8000.0},{\"radius\":32.048902,\"x\":127.4359136,\"y\":36.7223272,\"ppm\":6000.0},{\"radi us\":39.09213,\"x\":127.4359209,\"y\":36.7223237,\"ppm\":4000.0},{\"radius\":48.83107,\"x\":127.4359307,\"y\":36.72 23193,\"ppm\":2000.0}] 표 4 Data 설명 단위 비고 time 시간 s max_conc 최대농도 PPM circle_datas 원데이터 circle_data 리스트 circle_data.radius반지름 m circle_data.x 중심경도 ° circle_data.y 중심위도 ° circle_data.ppm 기준농도 PPM 도 4b는 위의 출력데이터를 화면으로 변환한 즉 화면에 시각화한 상태를 보여주고 있으며, 도 4c 및 도 4d는 퍼 프 모델의 파라미터별 분석 결과를 각각 보여주고 있다. 한편, 본 발명의 실시예에서 적용하는 플름 모델의 가시화 방법은 다음과 같다. 가스안전공사에서 제공된 알고 리즘인 gaussianPlume는 가스 방출이 무한대로 지속되고 있는 상황에서 x, y 지점의 가스 농도이다. 가시화를 하기 위한 방법으로 일정 PPM 이상의 지점인지 확인하고 그 부분에 대해서 색을 표시하기로 결정하였다. 최대검 측 PPM과 최소검측 PPM 설정하였고, 그 사이를 단계별로 표시하기 위해분할 PPM을 설정하였다. 최대검측 PPM 이 상의 PPM을 가진 지점에 대해 빨간색으로 표시하였고, RGB 패턴대로 PPM 순차별로 색을 변경하였다. 생성된 정 보를 지도에 표시한다. 플름 모델의 분석 프로세스는 다음의 절차대로 이루어진다고 볼 수 있다. 반복문을 이용하여 기준 PPM이 최소 PPM보다 클 때까지 최대 PPM부터 PPM 분할만큼 감소시킨다(1번). 이중 포문을 이용하여 x, y를 증가시키며 gaussianPlume을 실행시켜 해당지점의 PPM을 구한다(2번). 구한 PPM 중 최초로 기준 PPM보다 낮은 지점의 x,y 값을 Array 추가한다(3번). -y에 대해서도 동일한 값을 가지기 때문에, 저장된 Array값을 순차적으로 y값에 -1 을 곱해 저장한다(4번). 각 지점이 나타내는 위치를 위경도 좌표로 변경시킨다(5번). 해당 Array를 Geojson의 Ploygon으로 저장한다(6번). 저장된 Geojson을 Leaflet을 이용하여 PPM별로 다른 색으로 지도에 그린다(7번). 플름 모델의 입력 파라미터는 위의 퍼프 모델의 입력 파라미터와 크게 다르지 않으므로 그 내용들로 대신하고자 한다. 해당 입력파라미터로 분석을 실행하였다. 기준 PPM은 maxPPM 10000,PPMPer 2000, minPPM 2000일 때 10000,8000,6000,4000,2000이며, x y를 증가시키며 기준 PPM 이하로 들어왔을 때의 X, Y 좌표데이터를 획득하 여 기준데이터(Array)를 생성한다. 이 Array를 꼭지점으로 하는 Polygon을 GeoJson 형태로 저장한다. PPM 경계를 GeoJson 형태로 모두 저장하면 도 5a에서와 같은 결과를 얻을 수 있다. 여기서, PPM은 2000이 될 수 있다. <표 5>는 결과의 용어 정의를 나타내며, 도 5b는 출력 데이터를 화면으로 변환한 것을 보여주고 있다. 표 5 Data 설명 단위 비고 stdPPM 기준 PPM PPM polygon_geojson ggeojson json 또한, 도 5c 및 도 5d는 플름 모델의 파라미터별 분석 결과를 보여준다. 도 6은 본 발명의 실시예에 따른 가스 누출 대피 알람 프로세스를 나타내는 도면이며, 도 7a 내지 7h는 도 6의 각 단계를 구체적으로 설명하기 위한 도면이다. 설명의 편의상 도 6 내지 도 7h를 도 1과 함께 참조하면, 본 발명의 실시예에 따른 위험시설물 관리장치는 가스 확산 분석(S600), 누출영역추출(S610), 가스 영향권 추출(S620), 대피장소 검색(S630), 대피장소 필터링(S640), 건물별 대피장소 선정(S650), 건물정보 그룹화(S660) 및 알람메시지 생성(S670)의 일부 또는 전부의 동 작을 수행할 수 있다. 여기서, \"일부 또는 전부의 동작을 수행할 수 있다\"는 것은 대피장소 필터링(S640) 등의 동작이 생략되어 이루 어지거나, 대피장소 필터링(S640) 등의 일부 동작이 건물별 대피장소 선정(S650) 등의 다른 동작과 통합되어 이 루어질 수 있는 것을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 이루어지는 것으로 설명한다. 위의 동작들은 위험시설물 관리장치를 구성하는 하드웨어(H/W) 및 소프트웨어(S/W) 또는 그 조합을 통해 이루어질 수 있으며, 본 발명의 실시예에서는 어느 하나의 구성 및 동작에 특별히 한정하지는 않을 것이다. 시스템 구축이 완료된 전제하에, 위험시설물 관리장치는 가스 확산 분석 동작을 수행한다(S600). 이를 위 하여, 도 1의 위험시설물에 설치 또는 운영되는 시설물 감시장치로부터 가스 누출 등의 이벤트 신호를 수 신할 수 있다. 또는 다양한 유형의 데이터를 감지하여 이의 분석을 통해 가스 누출 여부를 판단할 수 있다. 이 러한 분석 동작을 수행하는 과정에서 가스 누출 영역을 계산할 수 있고, 기상 상태, 나아가 가스의 유형 등을 판단할 수도 있다. 예를 들어 도 7a에서와 같이 플름 모델을 사용하여 가스 확산 분석을 실행할 수 있다. 도 7a 에서 시설물 몰 질량은 가스 종류에 따라 정해지는 고유값을 나타내며 PPM은 신선한 공기의 양에 대한 유독가스 의 비율을 나타낸다. 이어 위험시설물 관리장치는 누출 영역 추출 동작을 수행한다(S610). 이전 단계에서의 가스 확산 분석을 통해 얻은 분석 결과를 근거로 누출 영역을 추출할 수 있으며, 분석 결과를 근거로 복수의 기설정된 추출 영역 중에서 하나를 선택하는 형태로 동작이 이루어질 수도 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특 별히 한정하지는 않을 것이다. 가스 누출 영역은 가스확산분석 실행시 설정한 최소 PPM의 값을 기준으로 영역을 계산하여 이루어진다. 도 7b는 도 6의 S610 단계를 확대하여 보여주고 있다. 또한, 위험시설물 관리장치는 가스 영향권 추출 동작을 수행한다(S620). 가스 영향권 검색은 가스 누출 영 역에 겹치는 구역의 공간 정보를 검색할 수 있으며, 이때 겹치는 구역은 행정구역상 '리' 단위의 최소 단위를 근거로 검색이 이루어진다. 이는 도 7c에서 잘 보여주고 있다. 물론 이러한 리 단위의 경계에 대한 정보는 사전 에 도 1의 DB(120a)에 정의되어 있으므로 이를 근거로 검색 동작이 이루어질 수 있을 것이다. 뿐만 아니라, 위험시설물 관리장치는 도 6 및 도 7d에서와 같이 가스 영향권 내 대피장소 검색 동작을 수 행한다(S630). 이때 대피장소의 선정 기준은 순위를 근거로 할 수 있다. 예를 들어, 1순위의 대피장소가 있으면 이를 우선 선정하고, 만약 1순위의 대피장소가 없으면 2순위의 대피장소를 선정하는 형태로 동작이 이루어질 수 있다. 가령, 1순위는 학교, 운동장, 공원 등의 공공시설이 될 수 있고, 2순위는 정류장 등이 될 수 있으며, 3순 위는 은행, 마트 등 장소 검색이 용이한 곳으로서 특정 상호의 형태로 검색 또는 선정이 이루어질 수 있다. 다음 단계로서, 위험시설물 관리장치는 도 6 및 도 7e서와 같이 대피장소의 필터링 동작을 수행한다 (S640). 다시 말해, 위험시설물 관리장치는 가스 누출 영역과 가스 영향권에 포함되는 대피장소에 대한 정 보를 함께 검색하지만, 검색 결과에서 가스 누출 영역의 대피장소는 제거해 버리는 것이다. 물론 이러한 동작은 다양하게 변형되어 이루어질 수 있으므로, 본 발명의 실시예에서는 위의 동작에 특별히 한정하지는 않을 것이다. 다시 말해, 위험시설물 관리장치가 도 1의 DB(120a)에서 대피장소에 대한 정보를 검색하여 추출할 때, 가스 누출 영역에 대한 대피장소의 정보를 배제하고 가스 영향권의 대피장소에 대한 장소만을 추출하면 되 기 때문이다. 통상적으로 DB(120a)에는 리 단위에 맵핑하여 대피장소가 매칭되어 저장되어 있을 수 있고, 따라 서 어떠한 '리'가 선정되는지에 따라 그에 매칭되어 저장되어 있는 대피장소의 정보를 검출하는 형태로 이루어 질 수 있다. 또한, 위험시설물 관리장치는 도 6 및 도 7f에서와 같이 필터링하고 난 후의 가스 영향권 내 건물별 대피 장소를 선정한다(S650). 다시 말해 위의 S640 단계에서 가스 영향권 내의 대피장소를 선정하였으므로 선정한 대 피장소의 건물에 대한 선정 동작이 이루어진다고 볼 수 있다. 이는 1순위 대피장소만 선정되어 있을 수 있고, 또는 2순위나 3순위의 대피장소를 포함할 수도 있다. 가령, 1순위의 대피장소는 복수의 건물이 위치할 수 있으 며, 따라서 이러한 대피 건물을 선정하기 위한 동작이 이루어질 수 있다. 물론 그러한 건물 선정은 건물별 최단 거리 대피장소 선정이 이루어진다. 건물 좌표와 가장 가까운 대피장소 좌표를 조회한다. 가령 대피 장소의 경계 에 대한 또는 중심에 대한 좌표값을 저장하고 있고, 또 주변의 건물에 대한 좌표값을 저장하고 있으므로 2개의 좌표를 통해 거리를 계산하여 최단 거리를 계산할 수 있다. 물론 사전에 거리가 계산되어 값이 저장되어 있으므 로 이를 확인하여 최단거리를 판단할 수도 있을 것이다. 실제로 사건, 사고의 경우 대피에 빠른 시간을 요하므 로 후자의 경우가 바람직할 수 있다. 그리고 위험시설물 관리장치는 도 7g에서와 같이 대피대상 건물정보를 그룹화하는 동작을 수행한다(S660). 건물정보의 그룹화는 동일한 대피장소를 갖는 건물정보를 그룹화한다. 예를 들어, 동일 대피장소로서 1순위의 공공시설이라면 해당 공공시설에 속하는 건물정보를 그룹화한다고 볼 수 있다. 마지막으로 위험시설물 관리장치는 도 7h에서와 같이 알람 메시지 메타데이터의 생성 동작을 수행한다 (S670). 대피장소를 기준으로 그룹화하여 알람 메시지를 생성하는 것이다. 해당 메타데이터는 가령 복수의 대피 장소와 각 대피장소의 복수의 건물정보가 포함될 수 있다. 예컨대, a와 b의 대피장소, 그리고 a의 대피장소에 대한 a1, a2, ..., an(여기서, n은 양의 정수)의 건물정보, 또 b의 대피장소에 대한 b1, b2, ..., bn(여기서, n은 양의 정수)의 건물정보의 형태를 가질 수 있다. 도 7h에 근거할 때 메타데이터의 포맷은 다음과 같은 구조 를 가질 수 있다. {\"msg\": [ {\"poi\":\"각리중학교\", \"buildList\":[빌딩정보]}, {\"poi\":\"양청고등학교”, \"buildList\":[빌딩정보]}, {\"poi\":\"어12호 공원”, \"buildList\":[빌딩정보]}, {\"poi\":\"태실공원”, \"buildList\":[빌딩정보]}, ]} 상기한 내용 이외에도 도 1의 위험시설물 관리장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용 은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 도 8은 도 1의 위험시설물 관리장치의 구동과정을 나타내는 흐름도이다. 설명의 편의상 도 8을 도 1과 함께 참조하면, 본 발명의 실시예에 따른 도 1의 위험시설물 관리장치는 위 험 시설물이 설치되는 지역의 맵 데이터와 위험 시설물에서의 가스 누출시 대피하기 위한 대피 장소의 정보를 매칭시켜 저장한다(S800). 또한, 위험시설물 관리장치는 위험 시설물에서의 가스 누출 발생시 기상 상태, 저장한 맵 데이터 및 대피 장소의 정보를 근거로 가스 확산 분석을 수행하여 기상 상태에 따른 가스 누출 영역 및 가스 영향권을 각각 추 출하고, 추출한 가스 영향권 내의 임의 대피 장소에서 최단 거리에 있는 복수의 건물에 대한 건물정보를 그룹화 하여 메타데이터(metadate)의 형태로 알람 메시지를 생성한다(S810). 상기한 내용 이외에도 도 1의 위험시설물 관리장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용 은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자한다. 한편, 본 발명의 실시 예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되 었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각 각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프 로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일 시적 저장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다. 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에"}
{"patent_id": "10-2021-0073952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "한정되지 아니하며, 청구범위에 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다.부호의 설명 100: 시설물 감시장치 110: 통신망 120: 위험시설물 관리장치 130: 서드파티장치 300: 통신 인터페이스부 310: 제어부 320: 위험시설물 관리부 330: 저장부"}
{"patent_id": "10-2021-0073952", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 위험 시설물 관리시스템을 나타내는 도면, 도 2a는 도 1의 위험 시설물 관리시스템을 도식화하여 나타낸 도면, 도 2b는 도 1의 위험시설물 관리장치의 시뮬레이션 화면의 예시도, 도 3은 도 1의 위험시설물 관리장치의 세부구조를 예시한 블록다이어그램, 도 4a 내지 도 4d는 가우시안 퍼프 모델의 가스 확산 분석을 설명하는 도면, 도 5a 내지 도 5d는 가우시안 플름 모델의 가스 확산 분석을 설명하는 도면, 도 6은 본 발명의 실시예에 따른 가스 누출 대피 알람 프로세스를 나타내는 도면, 도 7a 내지 7h는 도 6의 각 단계를 구체적으로 설명하기 위한 도면, 그리고 도 8은 도 1의 위험시설물 관리장치의 구동과정을 나타내는 흐름도이다."}
