{"patent_id": "10-2022-0163174", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0079842", "출원번호": "10-2022-0163174", "발명의 명칭": "진화 기반 인공지능 객체 군집을 이용하여 창작물을 생성하는 장치", "출원인": "주식회사 엑소게임즈", "발명자": "염의준"}}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "진화 기반 인공지능 객체 군집을 이용하여 창작물을 생성하는 장치에 있어서,각각이 제 1 활성 상속 정보에 기초하여 서로 다른 창작물을 생성하도록 학습되어 복수의 창작물을 생성하는 복수의 제 1 타입 인공지능 객체;각각이 제 2 활성 상속 정보에 기초하여 상기 복수의 창작물 중 적어도 하나를 선택하도록 학습되어 상기 복수의 창작물 중 적어도 하나를 선택하는 복수의 제 2 타입 인공지능 객체; 및상기 복수의 제 2 타입 인공지능 객체에 의해 선택된 복수의 창작물에 기초하여 최종 창작물을 제공하는 창작물제공부를 포함하는 창작물 창작 장치."}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 복수의 제 1 타입 인공지능 객체 및 상기 복수의 제 2 타입 인공지능 객체는 상속 관계에서 상위인 복수의제 1 타입 조상 인공지능 객체 및 복수의 제 2 타입 조상 인공지능 객체 중 기정의된 속성 결합 조건을 만족하는 제 1 타입 조상 인공지능 객체 및 제 2 타입 조상 인공지능 객체 각각의 활성 상속 정보를 상속받아 생성된것인, 창작물 창작 장치."}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 제 1 활성 상속 정보 및 상기 제 2 활성 상속 정보는 적어도 하나의 제 1 타입 조상 인공지능 객체에 대한제 1 유전 속성 정보 및 적어도 하나의 제 2 타입 조상 인공지능 객체에 대한 제 2 유전 속성 정보에 기초하여결정되는 것인, 창작물 창작 장치."}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 제 1 유전 속성 정보는 제 1 타입 부모 인공지능 객체에 대한 부모 유전 속성 정보 및 제 1 타입 조부모인공지능 객체에 대한 조부모 유전 속성 정보를 포함하고, 상기 제 2 유전 속성 정보는 제 2 타입 부모 인공지능 객체에 대한 부모 유전 속성 정보 및 제 2 타입 조부모인공지능 객체에 대한 조부모 유전 속성 정보를 포함하는 것인, 창작물 창작 장치."}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서, 상기 제 1 유전 속성 정보 및 상기 제 2 유전 속성 정보는 다음 세대로의 유전 속성 정보의 유전을 유도하는 우성 속성 정보 및 다음 세대로의 유전 속성 정보의 유전을 억제하는 열성 속성 정보 중 하나를 포함하는 것인,창작물 창작 장치.공개특허 10-2024-0079842-3-청구항 6 제 1 항에 있어서, 초기 속성 정보에 기초하여 생성된 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체 중 제1 군에 속하는 복수의 제 1 타입 인공지능 객체는 대중성을 갖는 제 1 창작물에 대응하는 제 1 유사 창작물을생성하도록 학습되고, 상기 제 1 군에 속하는 복수의 제 2 타입 인공지능 객체는 복수의 창작물 중 상기 제 1유사 창작물을 선택하도록 학습되고, 제 2 군에 속하는 복수의 제 1 타입 인공지능 객체는 대중성을 갖는 제 2 창작물에 대응하는 제 2 유사 창작물을 생성하도록 학습되고, 상기 제 2 군에 속하는 복수의 제 2 타입 인공지능 객체는 복수의 창작물 중 상기 제2 유사 창작물을 선택하도록 학습되는 것인, 창작물 창작 장치."}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 복수의 제 1 타입 인공지능 객체가 상기 창작물을 생성하기 위한 제 1 시간을 제한하고, 상기 복수의 제 2타입 인공지능 객체가 상기 창작물을 선택하기 위한 제 2 시간을 제한하는 제한 시간 설정부를 더 포함하고,상기 제 1 시간은 상기 제 2 시간보다 짧은 것인, 창작물 창작 장치."}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 복수의 제 1 타입 인공지능 객체 및 상기 복수의 제 2 타입 인공지능 객체 중 기정의된 속성 결합 조건을만족하는 제 1 타입 인공지능 객체 및 제 2 타입 인공지능 객체를 결정하고, 상기 기정의된 속성 결합 조건을만족하는 제 1 타입 인공지능 객체의 제 1 활성 상속 정보 및 제 2 타입 인공지능 객체의 제 2 활성 상속 정보를 상속받는 신규 인공지능 객체를 생성하는 객체 생성부를 더 포함하는 것인, 창작물 창작 장치."}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 객체 생성부는 상기 신규 인공지능 객체가 임의로 선정된 상기 제 1 활성 상속 정보 및 상기 제 2 활성 상속 정보 중 적어도하나 상속받도록 하는 것인, 창작물 창작 장치."}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서, 상기 복수의 제 1 타입 인공지능 객체 및 상기 복수의 제 2 타입 인공지능 객체 마다 수명이 설정되어 있는 것인, 창작물 창작 장치."}
{"patent_id": "10-2022-0163174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "진화 기반 인공지능 객체 군집을 이용하여 창작물을 생성하는 장치에 있어서,복수의 제 1 타입 인공지능 객체 각각에 의해 생성된 복수의 창작물을 획득하는 창작물 획득부;공개특허 10-2024-0079842-4-복수의 제 2 타입 인공지능 객체 각각이 상기 생성된 복수의 창작물 중 적어도 하나를 선택한 결과에 기초하여투표 결과를 생성하는 투표 결과 생성부;상기 투표 결과에 기초하여 상기 생성된 복수의 창작물 중 최종 창작물을 제공하는 창작물 제공부를 포함하고,상기 복수의 제 1 타입 인공지능 객체 각각은 제 1 활성 상속 정보에 기초하여 서로 다른 창작물을 생성하도록학습되어 상기 복수의 창작물을 생성하고,상기 복수의 제 2 타입 인공지능 객체 각각은 제 2 활성 상속 정보에 기초하여 상기 복수의 창작물 중 적어도하나를 선택하도록 학습되어 상기 복수의 창작물 중 적어도 하나를 선택하는 것인, 창작물 창작 장치"}
{"patent_id": "10-2022-0163174", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "진화 기반 인공지능 객체 군집을 이용하여 창작물을 생성하는 장치는 각각이 제 1 활성 상속 정보에 기초하여 서 로 다른 창작물을 생성하도록 학습되어 복수의 창작물을 생성하는 복수의 제 1 타입 인공지능 객체, 각각이 제 2 활성 상속 정보에 기초하여 복수의 창작물 중 적어도 하나를 선택하도록 학습되어 복수의 창작물 중 적어도 하나 를 선택하는 복수의 제 2 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체에 의해 선택된 복수의 창작물 에 기초하여 최종 창작물을 제공하는 창작물 제공부를 포함할 수 있다."}
{"patent_id": "10-2022-0163174", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 진화 기반 인공지능 객체 군집을 이용하여 창작물을 생성하는 장치에 관한 것이다."}
{"patent_id": "10-2022-0163174", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "과거에는 창작이 전문가의 영역으로 오랜 기간 동안 지속되어 왔으나, 최근에는 GAN(Generative Adversarial Network) 모델 등의 인공지능 모델을 이용하여 창작물의 창작이 가능해지고 있다. 기존의 인공지능 모델은 클래스에 대한 예측값 또는 연속확률변수(continuous random variable)에 대한 예측구 간 등의 결과값을 도출한다. 예를 들어, GAN 모델은 분포 데이터 또는 분산 데이터 형태를 생성하는데 초점을 두고 있다. 한편, 컨텐츠가 대중성을 갖기 위해서는 대중에서의 영향력을 갖기 위해 하나의 흐름속에서 사용자가 쉽게 이해 하고 공감하기 위한 유사성, 다른 컨텐츠와의 차별성 및 급진적인 변화를 이끌어내기 위한 독창성 등이 적절한 비율로 형성될 필요가 있다. 즉, 컨텐츠가 대중 문화에 미치는 영향력 등은 정답이 존재하지 않기 때문에 기존의 정답을 찾는 형태인 인공지 능 모델을 이용하여 대중성을 갖는 컨텐츠를 제작하기 어렵다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제2021-0052496호 (2021.05.10. 공개)"}
{"patent_id": "10-2022-0163174", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 복수의 제 1 타입 인공지능 객체를 통해 복수 의 창작물을 생성하고, 생성된 복수의 창작물 중 복수의 제 2 타입 인공지능 객체에 의해 선택된 복수의 창작물 에 기초하여 최종 창작물을 제공하고자 한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0163174", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 제 1 측면에 따른 진화 기반 인공지능 객체 군집을 이용하여 창작물을 생성하는 장치는 각각이 제 1 활성 상속 정보에 기초하여 서로 다른 창작물을 생성하 도록 학습되어 복수의 창작물을 생성하는 복수의 제 1 타입 인공지능 객체; 각각이 제 2 활성 상속 정보에 기초하여 상기 복수의 창작물 중 적어도 하나를 선택하도록 학습되어 상기 복수의 창작물 중 적어도 하나를 선택하 는 복수의 제 2 타입 인공지능 객체; 및 상기 복수의 제 2 타입 인공지능 객체에 의해 선택된 복수의 창작물에 기초하여 최종 창작물을 제공하는 창작물 제공부를 포함할 수 있다. 본 발명의 제 2 측면에 따른 진화 기반 인공지능 객체 군집을 이용하여 창작물을 생성하는 장치는 복수의 제 1 타입 인공지능 객체 각각에 의해 생성된 복수의 창작물을 획득하는 창작물 획득부; 복수의 제 2 타입 인공지능 객체 각각이 상기 생성된 복수의 창작물 중 적어도 하나를 선택한 결과에 기초하여 투표 결과를 생성하는 투표 결과 생성부; 상기 투표 결과에 기초하여 상기 생성된 복수의 창작물 중 최종 창작물을 제공하는 창작물 제공부 를 포함하고, 상기 복수의 제 1 타입 인공지능 객체 각각은 제 1 활성 상속 정보에 기초하여 서로 다른 창작물 을 생성하도록 학습되어 상기 복수의 창작물을 생성하고, 상기 복수의 제 2 타입 인공지능 객체 각각은 제 2 활 성 상속 정보에 기초하여 상기 복수의 창작물 중 적어도 하나를 선택하도록 학습되어 상기 복수의 창작물 중 적 어도 하나를 선택할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본 발명을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 기재된 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2022-0163174", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 본 발명은 복수의 제 1 타입 인공지능 객체를 통해 복수의 창작물을 생성하고, 생성된 복수의 창작물 중 복수의 제 2 타입 인공지능 객체에 의해 선택된 복수의 창 작물에 기초하여 최종 창작물을 제공할 수 있다."}
{"patent_id": "10-2022-0163174", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 본 명세서에 있어서 단말 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말 또는 디 바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말 또는 디바이스에서 수행될 수도 있다. 이하, 첨부된 구성도 또는 처리 흐름도를 참고하여, 본 발명의 실시를 위한 구체적인 내용을 설명하도록 한다. 도 1은 본 발명의 일 실시예에 따른, 창작물 창작 장치의 블록도이다. 도 1을 참조하면, 창작물 창작 장치는 복수의 제 1 타입 인공지능 객체, 복수의 제 2 타입 인공지능 객체, 제한 시간 설정부, 창작물 제공부, 객체 생성부, 학습부 및 수명 설정부(16 0)를 포함할 수 있다. 다만, 도 1에 도시된 창작물 창작 장치는 본 발명의 하나의 구현 예에 불과하며, 도 1에 도시된 구성요소들을 기초로 하여 여러 가지 변형이 가능하다. 본원에 있어서, 제 1 타입 인공지능 객체는 생태계에서 수컷(Male)의 성향을 가진 인공지능 객체이고, 제 2 타입 인공지능 객체는 암컷(Female)의 성향을 가진 인공지능 객체일 수 있다. 수컷의 성향을 가진 제 1 타입 인공지능 객체는 최대한 많은 제 2 타입 인공지능 객체로부터 선택 받 는 것이 목표이고, 암컷의 성향을 가진 제 2 타입 인공지능 객체는 최고의 속성을 가진 제 1 타입 인공지 능 객체를 선택하는 것이 목표로서, 이러한 방식을 통해서 2가지 타입의 인공지능 객체가 상반된 고유의 목표를 향해 경쟁하면서 진화하는 시스템이 구현될 수 있다. 이하에서는 도 2를 참조하여 도 1을 설명하기로 한다. 객체 생성부는 초기 속성 정보에 기초하여 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인 공지능 객체를 생성할 수 있다. 여기서, 초기 속성 정보는 창작물을 창작하는 제 1 타입 인공지능 객체 및 창작된 창작물을 선택하는 제 2 타입 인공지능 객체를 생성하기 위한 초기값일 수 있다. 즉, 복 수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체는 유전될 수 있는 속성값인 초기 속성 정보인 유전 파라미터를 다수 가지며, 유전 파라미터는 문자열, 숫자열, 배열 등 데이타셋이 될 수 있다. 이러한, 초기 속성 정보는 사전에 관리자에 의해 세팅된 속성값을 포함할 수 있다. 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체 각각은 별도의 속성 및 목표를 갖는 독립적인 인공지능 객체로서, 다음 세대로 유전될 수 있는 속성값인 유전 속성 정보를 가진다. 여기서, 다음 세대란 부모의 유전 인자를 물려받는 자손 세대를 의미한다. 이러한, 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체는 창작물 창작 장치 내에서 동작하는 가상 객체일 수 있다. 예를 들어, 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체는 자가 복제를 통한 병렬적 진화가 가능한 객체일 수 있다. 복수의 제 1 타입 인공지 능 객체 및 복수의 제 2 타입 인공지능 객체는 장단기 메모리 용량 및 컴퓨터 파워 정보 등에 기초하 여 병렬적 자가 복제가 효율적으로 진행될 수 있다. 복수의 제 1 타입 인공지능 객체는 다수의 제 2 타입 인공지능 객체로부터 선택받을 만한 창작물을 생성하는 것을 목표로 하는 객체이고, 복수의 제 2 타입 인공지능 객체는 복수의 제 1 타입 인공지능 객체 에 의해 생성된 복수의 창작물 중 선호하는 창작물을 선택하는 것을 목표로 하는 객체이다. 예를 들어, 객체 생성부는 기검증된 초기 속성 정보에 기초하여 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체를 생성할 수 있다. 여기서, 기검증된 초기 속성 정보는 시뮬레이션을 통해 도출된 복수의 속성값 중 사용자가 설정한 특정 조건을 만족하는 컨텐츠가 생성되기 위한 속성값일 수 있 다. 이때, 시뮬레이션이란 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체가 속성 결 합을 다수 수행하는 과정을 의미하며, 이를 통해 진화가 이루어질 수 있다. 예를 들어, 제 1 타입 인공지능 객체 및 제 2 타입 인공지능 객체을 생성하기 위해 사용되는 기검증 된 초기 속성 정보의 양이 부족한 경우, 객체 생성부는 자가 랜덤 생성 복제에 의해 생성된 다량의 초기 속성 정보에 기초하여 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체를 생성할 수도 있다. 여기서, 자가 랜덤 생성 복제는 기검증된 초기 속성 정보와 유사한 다른 속성 정보를 랜덤으로 생 성하는 방법을 의미한다. 예를 들어, 객체 생성부는 사용자가 설정한 초기 속성 정보에 기초하여 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체를 생성할 수도 있다. 학습부는 초기 속성 정보에 기초하여 생성된 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체 각각을 학습시킬 수 있다. 학습부는 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체를 복수의 군으로 그룹핑하고, 각 군마다 특정 형태의 창작물이 생성 및 선택되도록 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 학습시킬 수 있다. 여기서, 특정 형태는 창작물을 분류하는 기준으로서, 창작물의 장르, 창작물의 기법, 창작물의 특징, 창작물의 기원, 창작물에 담긴 철학 등을 포함할 수 있다. 예를 들어, 학습부는 제 1 군에 속하는 복수의 제 1 타입 인공지능 객체를 대중성을 갖는 제 1 창작물에 대응하는 복수의 제 1 유사 창작물을 생성하도록 학습시키고, 제 1 군에 속하는 복수의 제 2 타입 인공지능 객 체를 복수의 창작물 중 제 1 유사 창작물을 선택하도록 학습시킬 수 있다. 학습부는 제 2 군에 속하는 복수의 제 1 타입 인공지능 객체를 특정 장르의 제 2 창작물에 대응하는 복수 의 제 2 유사 창작물을 생성하도록 학습시키고, 제 2 군에 속하는 복수의 제 2 타입 인공지능 객체를 복수의 창 작물 중 해당 특정 장르의 제 2 유사 창작물을 선택하도록 학습시킬 수 있다. 예를 들어, 도 3을 참조하면, 제 1 군(32-1)에 속하는 복수의 제 1 타입 인공지능 객체는 고흐 화풍(30- 1)의 복수의 유사 창작물을 생성하도록 학습되고, 제 1 군(32-1)에 속하는 복수의 제 2 타입 인공지능 객체 는 고흐 화풍의 유사 창작물 및 다른 창작물을 포함하는 복수의 창작물 중 고흐 화풍의 유사 창작물을 선 택하도록 학습될 수 있다. 다른 예를 들어, 제 2 군(32-3)에 속하는 제 1 타입 인공지능 객체는 현대미술(30-3)에 속하는 복수의 유 사 창작물을 생성하도록 학습되고, 제 2 군(32-3)에 속하는 복수의 제 2 타입 인공지능 객체는 현대미술에 속하는 유사 창작물 및 다른 창작물을 포함하는 복수의 창작물 중 현대미술에 속하는 유사 창작물을 선택하도록 학습될 수 있다. 제 3 군(32-5)에 속하는 복수의 제 1 타입 인공지능 객체는 인상파(30-5) 기법의 복수의 유사 창작물을 생 성하도록 학습되고, 제 3 군(32-5)에 속하는 복수의 제 2 타입 인공지능 객체는 인상파 기법의 유사 창작 물 및 다른 창작물을 포함하는 복수의 창작물 중 인상파 기법의 유사 창작물을 선택하도록 학습될 수 있다. 제한 시간 설정부는 복수의 제 1 타입 인공지능 객체가 창작물을 생성하기 위한 제한 시간으로 제 1 시간 을 설정하고, 복수의 제 2 타입 인공지능 객체가 창작물을 선택하기 위한 제한 시간으로 제 2 시간을 설정할 수 있다. 여기서, 제 1 시간은 제 2 시간보다 짧을 수 있다. 제 1 시간을 제 2 시간보다 상대적으로 짧게 설정함으로써 복수의 제 1 타입 인공지능 객체는 창작물의 창작을 위한 최선의 선택을 하게 된다. 이에 반해, 제 2 시간을 제 1 시간보다 상대적으로 길게 설정함으로써 복수의 제 2 타입 인공지능 객체는 비교 적 최고의 창작물을 선택하게 된다. 이에 따라, 복수의 제 1 타입 인공지능 객체가 창작물을 생성하고 복수의 제 2 타입 인공지능 객체가 창작물을 선택하기 위한 제한 시간을 설정함으로써 다양한 창작물이 생성될 수 있고, 이로 인해 인공지능 객체들이 다양 한 형태로 진화될 수 있다. 예를 들어, 제한 시간 설정부는 제 1 타입 인공지능 객체 및 제 2 타입 인공지능 객체의 객체수에 기초하 여 제 1 시간 및 제 2 시간을 조정할 수 있다. 예를 들어, 제 1 타입 인공지능 객체의 객체수가 복수의 제 2 타 입 인공지능 객체보다 객체수가 많은 경우, 복수의 제 2 타입 인공지능 객체의 창작물 선택 제한 시간을 길게 조정할 수 있다. 예를 들어, 제한 시간 설정부는 제 1 타입 인공지능 객체의 객체수가 기설정된 임계치 미만인 경우, 복수 의 제 2 타입 인공지능 객체의 창작물 선택 제한 시간을 짧게 조정할 수 있다. 이를 통해, 자연 생태계처럼 인공지능 객체가 너무 많아지면, 인공지능 객체끼리 경쟁이 너무 심해지기 때문에 제한 시간을 늘려서 경쟁을 완화하고, 반면에 인공지능 객체가 너무 부족해서 속성 결합의 활성화에 문제가 생 기는 것을 방지하기 해 카운터 밸런싱(Counter balancing)이 가능하다. 한편, 객체 생성부는 복수의 제 1 타입 조상 인공지능 객체 및 복수의 제 2 타입 조상 인공지능 객체 중 기정의된 속성 결합 조건을 만족하는 제 1 타입 조상 인공지능 객체 및 제 2 타입 조상 인공지능 객체를 결정하 고, 기정의된 속성 결합 조건을 만족하는 제 1 타입 조상 인공지능 객체의 제 1 활성 상속 정보 및 제 2 타입 조상 인공지능 객체의 제 2 활성 상속 정보를 상속받는 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체를 생성할 수 있다. 여기서, 기정의된 속성 결합 조건은 학습 과정이 완료된 조상 인공지능 객체로서, 제 1 타입 조상 인공지능 객 체의 경우, 창작물 생성 학습 과정이 완료되고, 제 2 타입 조상 인공지능 객체의 경우, 창작물 선택 학습 과정 이 완료되는 조건을 포함할 수 있다. 기정의된 속성 결합 조건은 제 1 타입 인공지능 객체 및 제 2 타입 인공지능 객체 각각이 결합할 상대방이 기설 정된 탐색 범위 내에서 검색되거나 결합할 상대방이 제한 시간(즉, 제 1 타입 인공지능 객체의 경우, 창작물 생 성 제한 시간이고, 제 2 타입 인공지능 객체의 경우, 창작물 선택 제한 시간)에 해당하지 않는 경우를 포함할 수 있다. 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체가 상속 관계에서 상위인 복수의 제 1 타입 조상 인공지능 객체 및 복수의 제 2 타입 조상 인공지능 객체 각각의 유전 속성 정보 중 일부를 상속 받아 생성된 객체인 경우, 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체는 현 재 각자의 유전 속성 정보를 가지고 있을 뿐만 아니라, 상속받은 제 1 타입 조상 인공지능 객체 및 제 2 타입 조상 인공지능 객체에 대한 유전 이력 정보를 가질 수 있다. 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체는 상속 관계에서 상위인 복수의 제 1 타입 조상 인공지능 객체 및 복수의 제 2 타입 조상 인공지능 객체 중 기정의된 속성 결합 조건을 만족하 는 제 1 타입 조상 인공지능 객체 및 제 2 타입 조상 인공지능 객체 각각의 활성 상속 정보를 상속받아 생성될 수 있다. 여기서, 활성 상속 정보는 자손 인공지능 객체가 상속받는 적어도 하나의 조상 인공지능 객체의 상속 정보에 대한 비율 정보를 포함할 수 있다. 예를 들어, 제 1 타입 인공지능 객체가 부모 인공지능 객체, 조부모 인공지능 객체, 증조부모 인공지능 객체의 상속 정보를 가지고 있는 경우, 제 1 타입 인공지능 객체로 상속되는 부모 인공지능 객체의 활성 상속 정보는 10%의 비율을 갖는 부모 인공지능 객체의 상속 정보이고, 제 1 타입 인공지능 객체로 상속되는 조부모 인공지능 객체의 활성 상속 정보는 5%의 비율을 갖는 조부모 인공지능 객체의 상속 정보이고, 제 1 타입 인공지능 객체로 상속되는 증조부모 인공지능 객체의 활성 상속 정보는 2.5% 비율을 갖는 증조부모 인공지능 객체의 상속 정보일 수 있다. 복수의 제 1 타입 인공지능 객체 각각은 적어도 하나의 제 1 타입 조상 인공지능 객체 및 제 2 타입 조상 인공지능 객체의 제 1 활성 상속 정보에 기초하여 서로 다른 창작물을 생성하도록 학습되어 복수의 창작물을 생 성할 수 있다. 복수의 제 2 타입 인공지능 객체 각각은 적어도 하나의 제 2 타입 조상 인공지능 객체 및 제 2 타입 조상 인공지능 객체의 제 2 활성 상속 정보에 기초하여 복수의 창작물 중 적어도 하나를 선택하도록 학습되어 복수의 제 1 타입 인공지능 객체에 의해 창작된 복수의 창작물 중 적어도 하나를 선택할 수 있다. 여기서, 제 1 활성 상속 정보 및 제 2 활성 상속 정보는 적어도 하나의 제 1 타입 조상 인공지능 객체에 대한 제 1 유전 속성 정보 및 적어도 하나의 제 2 타입 조상 인공지능 객체에 대한 제 2 유전 속성 정보에 기초하여 결정될 수 있다. 여기서, 적어도 하나의 제 1 타입 조상 인공지능 객체에 대한 제 1 유전 속성 정보는 제 1 타입 부모 인공지능 객체에 대한 부모 유전 속성 정보 및 제 1 타입 조부모 인공지능 객체에 대한 조부모 유전 속성 정보를 포함할 수 있다. 이 때, 세대가 멀어질수록 자손 인공지능 객체로 전달되는 조상 인공지능 객체의 유전 속성 정보에 대한 비율이 줄어들 수 있다. 예를 들어, 50% 비율의 제 1 타입 부모 인공지능 객체에 대한 부모 유전 속성 정 보와 25%의 비율의 제 1 타입 조부모 인공지능 객체에 대한 조부모 유전 속성 정보가 복수의 제 1 타입 인공지 능 객체로 유전 상속될 수 있다. 적어도 하나의 제 2 타입 조상 인공지능 객체에 대한 제 2 유전 속성 정보는 제 2 타입 부모 인공지능 객체에 대한 부모 유전 속성 정보 및 제 2 타입 조부모 인공지능 객체에 대한 조부모 유전 속성 정보를 포함할 수 있다. 예를 들어, 50% 비율의 제 2 타입 부모 인공지능 객체에 대한 부모 유전 속성 정보와 25%의 비율의 제 2 타입 조부모 인공지능 객체에 대한 조부모 유전 속성 정보가 복수의 제 2 타입 인공지능 객체로 유전 상 속될 수 있다. 제 1 타입 조상 인공지능 객체에 대한 제 1 유전 속성 정보 및 제 2 타입 조상 인공지능 객체에 대한 제 2 유전 속성 정보는 다음 세대로의 유전 속성 정보의 유전을 유도하는 우성 속성 정보 및 다음 세대로의 유전 속성 정 보의 유전을 억제하는 열성 속성 정보 중 하나를 포함할 수 있다. 예를 들어, 우성 속성 정보가 다음 세대로 유전될 유전 확률이 70%이면, 열성 속성 정보가 다음 세대로 유전될 유전 확률은 30%일 수 있다. 수명 설정부는 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체 마다 수명 을 설정할 수 있다. 수명 설정부는 동일 특성을 갖는 제 1 타입 인공지능 객체(제 2 타입 인공지능 객체)의 객체수가 증가할수 록 동일 특성을 갖는 제 1 타입 인공지능 객체(제 2 타입 인공지능 객체)의 수명이 짧아지도록 설정할 수 있다. 예를 들어, A 특성을 80%의 제 1 타입 인공지능 객체가 가지고 있는 경우, A 특성을 갖고 있는 제 1 타입 인공 지능 객체의 수명은 20%(1/5)로 짧아지도록 설정될 수 있다. 이는, 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체 간의 적절한 수명 밸런스 를 유지하면서 계속해서 세대 간의 유전적 특성에 대한 상속이 이루어지도록 하기 위함이다. 객체 생성부는 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체 중 기정의된 속성 결 합 조건을 만족하는 제 1 타입 인공지능 객체 및 제 2 타입 인공지능 객체를 결정하고, 기정의된 속성 결합 조 건을 만족하는 제 1 타입 인공지능 객체의 제 1 활성 상속 정보 및 제 2 타입 인공지능 객체의 제 2 활성 상속 정보를 상속받는 신규 인공지능 객체를 생성할 수 있다. 한편, 본 발명은 창작물의 독창성 및 차별화가 가능해지도록 하기 위해 돌연변이 속성을 갖는 신규 인공지능 객 체를 생성할 수 있다. 구체적으로, 객체 생성부는 임의로 선정된 유전 속성 정보를 갖도록 함으로써 돌연변이 속성을 갖는 신규 인공지능 객체를 생성할 수 있다. 예를 들어, 돌연변이 속성을 갖는 신규 인공지능 객체는 예를 들어, 기정의된 속성 결합 조건을 만족하는 제 1 타입 인공지능 객체의 제 1 활성 상속 정보와, 제 2 타입 인공지능 객체의 제 2 활성 상속 정보가 일부 변형된 제 2 변경 활성 상속 정보를 상속받는 객체일 수 있다. 예를 들어, 돌연변이 속성을 갖는 신규 인공지능 객체는 기정의된 속성 결합 조건을 만족하는 제 1 타입 인공지능 객체의 제 1 활성 상속 정보가 일부 변형된 제 1 변경 활성 상속 정보와 기정의된 속성 결합 조건을 만족하는 제 2 타입 인공지능 객체의 제 2 활성 상속 정보를 상속 받는 객체일 수 있다. 예를 들어, 객체 생성부는 기설정된 돌연변이 비율(예컨대, 20%)에 기초하여 임의로 선정된 제 1 타입 인 공지능 객체의 제 1 활성 상속 정보의 일부가 변형된 제 1 변경 활성 상속 정보 및 임의로 선정된 제 2 타입 인 공지능 객체의 제 2 활성 상속 정보의 일부가 변형된 2 변경 활성 상속 정보 중 적어도 하나를 상속받는 신규 인공지능 객체를 생성할 수 있다. 예를 들어, 객체 생성부는 결합 대상인 제 1 타입 인공지능 객체 및 제 2 타입 인공지능 객체의 제 1 활성 상속 정보 및 제 2 활성 상속 정보와 무관한 유전 속성 정보를 갖는 신규 인공지능 객체를 생성할 수도 있다. 창작물 제공부는 복수의 제 2 타입 인공지능 객체에 의해 선택된 복수의 창작물에 기초하여 최종 창작물을 제공할 수 있다. 이와 같이, 본 발명은 다양한 분야(예컨대, 그림, 음악 작곡, 요리 등)에서 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체를 이용하여 대중들의 공감을 받고 대중이 좋아할 만한 창작물을 생성할 수 있다. 예를 들어, 복수의 제 1 타입 인공지능 객체는 대중들이 좋아하는 그림에 대한 트렌드 정보를 학습하여 복 수의 그림을 창작하고, 복수의 제 2 타입 인공지능 객체는 복수의 제 1 타입 인공지능 객체가 창작한 복수의 그림 중 대중들이 구매를 가장 희망할 만한 그림을 선택할 수 있다. 예를 들어, 복수의 제 1 타입 인공지능 객체는 꾸준히 인기가 많은 음악에 대한 속성 정보 및 새로운 속성 를 학습하여 복수의 음악을 작곡하고, 복수의 제 2 타입 인공지능 객체는 복수의 제 1 타입 인공지능 객체 가 작곡한 복수의 음악 중 대중들에게 친숙할 만한 음악을 선택할 수 있다. 예를 들어, 복수의 제 1 타입 인공지능 객체는 기존의 요리 레시피 및 조리 방법과 함께 새로운 요리 레시 피 및 조리 방법을 학습하여 새로운 형태의 요리 방법(예컨대, 같은 중국 요리이지만 한국식 중국 요리)를 창작 할 수 있다. 복수의 제 2 타입 인공지능 객체는 맛을 구성하는 요소(예컨대, 짠맛, 신맛, 쓴맛, 단맛, 감 칠맛 등) 및 온도 요소에 기초하여 복수의 제 1 타입 인공지능 객체가 창작한 복수의 요리 중 대중적인 맛 을 갖는 요리를 선택할 수 있다. 한편, 당업자라면, 복수의 제 1 타입 인공지능 객체, 복수의 제 2 타입 인공지능 객체, 제한 시간 설 정부, 창작물 제공부, 객체 생성부 학습부 및 수명 설정부 각각이 분리되어 구현되거 나, 이 중 하나 이상이 통합되어 구현될 수 있음을 충분히 이해할 것이다. 도 4는 본 발명의 다른 실시예에 따른, 창작물 창작 장치의 블록도이다. 도 4를 참조하면, 창작물 창작 장치는 창작물 획득부, 투표 결과 생성부 및 창작물 제공부 를 포함할 수 있다. 다만, 도 4에 도시된 창작물 창작 장치는 본 발명의 하나의 구현 예에 불과하며, 도 4 에 도시된 구성요소들을 기초로 하여 여러 가지 변형이 가능하다. 다른 실시예에 따르면, 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체는 별도의 인공지능 객체 생성 장치에서 생성 및 관리되고, 창작물 창작 장치는 인공지능 객체 생성 장치와의 통신을 통해 창작 물을 생성 및 선택할 수 있다. 여기서, 복수의 제 1 타입 인공지능 객체는 다수의 제 2 타입 인공지능 객체로부터 선택받는 창작물을 생성하는 것을 목표로 학습된 객체이고, 복수의 제 2 타입 인공지능 객체는 복수의 제 1 타입 인공지능 객체에 의해 생성 된 복수의 창작물을 선택(평가)하는 것을 목표로 학습된 객체이다. 구체적으로, 창작물 획득부는 인공지능 객체 생성 장치로부터 창작물 정보를 수신할 수 있다. 창작물 획득부는 복수의 제 1 타입 인공지능 객체 각각에 의해 생성된 복수의 창작물을 인공지능 객체 생 성 장치로부터 획득할 수 있다. 창작물 획득부는 복수의 제 2 타입 인공지능 객체 각각이 복수의 제 1 타입 인공지능 객체에 의해 생성된 복수의 창작물 중 적어도 하나를 선택한 결과를 인공지능 객체 생성 장치로부터 수신할 수 있다. 투표 결과 생성부는 수신된 복수의 제 2 타입 인공지능 객체의 선택 결과에 기초하여 투표 결과를 생성할 수 있다. 투표 결과 생성부는 복수의 제 2 타입 인공지능 객체 각각으로부터 선택된 복수의 창작물별 투표 결과를 생성할 수 있다. 창작물 제공부는 투표 결과에 기초하여 생성된 복수의 창작물 중 최종 창작물을 제공할 수 있다. 예를 들어, 창작물 제공부는 복수의 창작물별 투표 결과 중 투표를 가장 많이 받은 창작물을 최종 창작물 로 선정하여 사용자에게 제공할 수 있다. 한편, 당업자라면, 창작물 획득부, 투표 결과 생성부 및 창작물 제공부 각각이 분리되어 구현되 거나, 이 중 하나 이상이 통합되어 구현될 수 있음을 충분히 이해할 것이다. 도 5는 본 발명의 일 실시예에 따른, 창작물을 생성하는 방법을 나타낸 흐름도이다. 도 5를 참조하면, 단계 S501에서 창작물 창작 장치는 복수의 제 1 타입 인공지능 객체 각각에 의해 생성된 복수의 창작물을 획득할 수 있다. 여기서, 복수의 제 1 타입 인공지능 객체 각각은 제 1 활성 상속 정보에 기 초하여 서로 다른 창작물을 생성하도록 학습되어 복수의 창작물을 생성할 수 있다. 여기서, 제 1 활성 상속 정보는 상속 관계에서 상위인 적어도 하나의 제 1 타입 조상 인공지능 객체에 대한 제 1 유전 속성 정보 및 적 어도 하나의 제 2 타입 조상 인공지능 객체에 대한 제 2 유전 속성 정보에 기초하여 결정될 수 있다. 단계 S503에서 창작물 창작 장치는 복수의 제 2 타입 인공지능 객체 각각이 생성된 복수의 창작물 중 적어 도 하나를 선택한 결과에 기초하여 투표 결과를 생성할 수 있다. 여기서, 복수의 제 2 타입 인공지능 객체 각 각은 제 2 활성 상속 정보에 기초하여 복수의 창작물 중 적어도 하나를 선택하도록 학습되어 복수의 창작물 중 적어도 하나를 선택할 수 있다. 여기서, 제 2 활성 상속 정보는 상속 관계에서 상위인 적어도 하나의 제 1 타 입 조상 인공지능 객체에 대한 제 1 유전 속성 정보 및 적어도 하나의 제 2 타입 조상 인공지능 객체에 대한 제 2 유전 속성 정보에 기초하여 결정될 수 있다. 단계 S505에서 창작물 창작 장치는 투표 결과에 기초하여, 생성된 복수의 창작물 중 최종 창작물을 제공할 수 있다. 상술한 설명에서, 단계 S501 내지 S505는 본 발명의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적 은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본 발명의 일 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행 가능한 명령어를 포 함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이 터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다."}
{"patent_id": "10-2022-0163174", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0163174", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른, 창작물 창작 장치의 블록도이다. 도 2는 본 발명의 일 실시예에 따른, 진화 기반의 인공지능 객체 군집을 나타낸 도면이다. 도 3은 본 발명의 일 실시예에 따른, 복수의 제 1 타입 인공지능 객체 및 복수의 제 2 타입 인공지능 객체를 학 습하는 방법을 설명하기 위한 도면이다. 도 4는 본 발명의 다른 실시예에 따른, 창작물 창작 장치의 블록도이다. 도 5는 본 발명의 일 실시예에 따른, 창작물을 생성하는 방법을 나타낸 흐름도이다."}
