{"patent_id": "10-2023-0121014", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0038381", "출원번호": "10-2023-0121014", "발명의 명칭": "인공지능 모델 기반 파트 포장 자동화 시스템 및 이를 이용한 자동 포장 방법", "출원인": "현대글로비스 주식회사", "발명자": "전지원"}}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 모델을 이용한 적입공간 내 파트(part) 포장 자동화 시스템에 있어서,상기 파트 포장 대상에 대한 입력 데이터에 적입 제한 조건 정보를 반영하여 전치리할 수 있도록 구성된UI(User Interface)를 포함하는 디스플레이; 및상기 전처리된 입력 데이터를 휴리스틱(heuristic) 알고리즘 기반 제 1 인공지능 모델을 통해 제 1 차 적재 결과를 도출하고, 상기 제 1 차 적재 결과를 상기 적입 제한 조건에 따라 재배치를 수행하는 제 2 인공지능 모델을 통해 제 2 차 적재 결과를 도출하도록 구성되는 프로세서를 포함하는, 파트 포장 자동화 시스템."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 적입 제한 조건 정보는,상기 파트 포장 대상별 혼적 금지 규칙 정보를 포함하며,상기 제 1 인공지능 모델은 상기 적입 제안 조건을 고려한 제 1 FFD (First Fit Decreasing) 알고리즘에 기반하는, 파트 포장 자동화 시스템."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 프로세서는,상기 제 2 차 적재 결과에 기반하여 상기 적입공간 내 여유 공간에 추가 적입 가능한 추가 파트 포장 후보를 도출하고, 상기 추가 파트 포장 후보를 제 2 FFD 알고리즘에 기반하여 추가 배치하여 제 3 차 적재 결과를 도출하는 제 3 인공지능 모델을 추가적으로 포함하는, 파트 포장 자동화 시스템."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제 1 FFD 알고리즘과 상기 제 2 FFD 알고리즘은 서로 상이한 적입 제한 기준 또는 충진율 기준 중 하나 이상에 기반하여 운용되는, 파트 포장 자동화 시스템."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 프로세서는,상기 제 2 차 적재 결과에 기반하여 상기 적입공간 내 여유 공간에 추가 적입 가능한 추가 파트 포장 후보를 상기 디스플레이에 표시하고;상기 UI를 통해 추가 적입 대상으로 결정된 추가 파트 포장 대상을 상기 디스플레이를 통해 2D 또는 3D 배닝도에 표시하며;상기 UI를 통해 추가 적입 대상으로 확정된 결과를 반영하여 제 3 차 적재 결과를 도출하도록 구성되는, 파트포장 자동화 시스템."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,공개특허 10-2025-0038381-3-상기 제 2 인공지능 모델은,상기 제 1 차 적재 결과에 기반하여 Z축 기반 순서 재배치를 판단하고,상기 파트 포장 대상에 대한 정보에 기반하여 X축 및 Y축 중 하나 이상의 순서 재배치를 판단하도록 구성되는,파트 포장 자동화 시스템."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 파트 포장 자동화 시스템은 로트(lot) 포장 자동화 시스템과 구분되어 운용되는, 파트 포장 자동화시스템."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 적입공간은 컨테이너 박스를 포함하며,상기 파트 포장 대상은 KD(Knock Down) 물류 프로세스에서 소정 기간 내 파트 단위 주문에 기반하는, 파트 포장자동화 시스템."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "인공지능 모델을 포함하는 프로세서를 이용하여 적입공간 내 파트(part) 포장을 자동으로 수행하는 방법에 있어서,상기 파트 포장 대상에 대한 입력 데이터에 적입 제한 조건 정보를 반영하여 전치리가 수행된 데이터를, 상기프로세서에 구비된 휴리스틱(heuristic) 알고리즘 기반 제 1 인공지능 모델을 통해 제 1 차 적재 결과를 도출하고; 그리고상기 제 1 차 적재 결과를 상기 적입 제한 조건에 따라 재배치를 수행하는 상기 프로세서의 제 2 인공지능 모델을 통해 제 2 차 적재 결과를 도출하는 것을 포함하는, 파트 포장 자동 수행 방법."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 적입 제한 조건 정보는,상기 파트 포장 대상별 혼적 금지 규칙 정보를 포함하며,상기 제 1 인공지능 모델은 상기 적입 제안 조건을 고려한 제 1 FFD (First Fit Decreasing) 알고리즘에 기반하는, 파트 포장 자동 수행 방법."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 프로세서가, 상기 제 2 차 적재 결과에 기반하여 상기 적입공간 내 여유 공간에 추가 적입 가능한 추가 파트 포장 후보를 도출하고; 상기 추가 파트 포장 후보를 제 2 FFD 알고리즘에 기반하여 추가 배치하여 제 3 차 적재 결과를 도출하는 것을추가적으로 포함하는, 파트 포장 자동 수행 방법."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 제 1 FFD 알고리즘과 상기 제 2 FFD 알고리즘은 서로 상이한 적입 제한 기준에 기반하여 운용되는, 파트포장 자동 수행 방법.공개특허 10-2025-0038381-4-청구항 13 제 10 항에 있어서,상기 프로세서가,상기 제 2 차 적재 결과에 기반하여 상기 적입공간 내 여유 공간에 추가 적입 가능한 추가 파트 포장 후보를 디스플레이에 표시하고;상기 디스플레이의 UI(User Interface)를 통해 추가 적입 대상으로 결정된 추가 파트 포장 대상을 상기 디스플레이를 통해 2D 또는 3D 배닝도에 표시하며;상기 UI를 통해 추가 적입 대상으로 확정된 결과를 반영하여 제 3 차 적재 결과를 도출하는 것을 추가적으로 포함하는, 파트 포장 자동 수행 방법."}
{"patent_id": "10-2023-0121014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 9 항에 있어서,상기 제 2 인공지능 모델은,상기 제 1 차 적재 결과에 기반하여 Z축 기반 순서 재배치를 판단하고;상기 파트 포장 대상에 대한 정보에 기반하여 X축 및 Y축 중 하나 이상의 순서 재배치를 판단하는, 파트 포장자동 수행 방법."}
{"patent_id": "10-2023-0121014", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 명세서는 인공지능 모델 기반 파트 포장 자동화 시스템 및 이를 이용한 자동 포장 방법에 대한 것이다. 이에 따른 파트 포장 자동화 시스템은, 파트 포장 대상에 대한 입력 데이터에 적입 제한 조건 정보를 반영하여 전치리할 수 있도록 구성된 UI(User Interface)를 포함하는 디스플레이; 및 상기 전처리된 입력 데이터를 휴리스 틱(heuristic) 알고리즘 기반 제 1 인공지능 모델을 통해 제 1 차 적재 결과를 도출하고, 상기 제 1 차 적재 결 과를 상기 적입 제한 조건에 따라 재배치를 수행하는 제 2 인공지능 모델을 통해 제 2 차 적재 결과를 도출하도 록 구성되는 프로세서를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0121014", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이하의 설명은 물류 프로세스에서 인공지능 모델에 기반하여 적입공간 내 포장대상물을 자동 적입하는 기술에 대한 것으로서, 구체적으로 적입 대상물을 파트(part) 포장과 로트(lot) 포장으로 구분할 경우, 인공지능 모델 에 기반하여 파트 포장을 위한 자동화 시스템 및 이를 이용한 자동 포장 방법에 대한 것이다."}
{"patent_id": "10-2023-0121014", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "물류 프로세스 중 해외에서의 완제품 조립/생산을 위한 부품을 국내외 협력사로부터 수급하여 해외 현지 공장에 공급하는 방식을 KD (Knock Down) 물류 프로세스로 지칭한다. 도 1은 기본적인 KD 물류 프로세스를 설명하기 위한 도면이다. 먼저 KD 물류 주문이 접수(S110)되면, 이에 따라 포장 계획을 수립(S120)하게 된다. 포장 계획을 수립하는 것은, 구체적으로 주문 물량을 확인하고, 이에 따라 포장 계획을 수립하며, 검토를 거쳐 이러한 포장 계획을 확 정하는 과정을 포함할 수 있다. 그 후, KD 물류를 위해 발주가 이루어질 수 있다(S130). 발주는 납입 지시를 생성하고, 이와 같이 생성된 납입 지시를 확정하며, 부품의 조달을 관리하는 절차를 포함할 수 있다. 또한, 발주(S130) 단계에서의 관리 포인트로 는 긴급품의 일정 관리, 공급 지연 부품 관리, 업체 생산능력 관리 등이 고려되어야 한다. 발주(S130)에 후속하여 입고(S140) 절차가 수행될 수 있다. 입고(S140) 단계에서는 부품을 하역하고, 입고 품질 을 검사하고, 이를 위한 부품 검수를 수행하여, 입고 처리를 진행하며, 이때 포장 사양을 등록할 수 있다. 또한, 피딩(S150) 단계에서는 PDA 리딩을 통해 이종관리가 수행될 수 있으며, 후속하여 포장(S160) 단계가 수행 될 수 있다. 포장(S160) 단계에서는 먼저 포장 사양서를 확인하고, 이에 따라 각 부품별 포장이 이루어져 파킹 티켓/쉬핑마크가 부착될 수 있다. 이와 같이 포장(S160)이 완료되면, 출하(S170) 단계가 수행될 수 있으며, 출하(S170) 단계에서는 컨테이너 배치, 케이스 그룹핑, 컨테이너 적입을 통해, 적입 완료 보고가 이루어질 수 있다. 최종적으로 부품이 적입 완료된 컨테이너가 선적(S180)을 통해 KD 물류가 진행될 수 있다. 상술한 바와 같은 KD 물류 프로세스에서 컨테이너 등의 적입공간에 포장된 부품을 적입하는 출하(S170) 단계를 인공지능을 이용하여 자동화하기 위한 다양한 시도가 존재한다. 다만, 단순히 적입 대상물에 대한 정보를 인공지능 모델에 입력하여 최적의 적입 효율을 도출하려는 시도는 파 트 포장과 로트 포장에서 서로 상이한 요구조건이 존재하는 것을 고려하지 않아, 그 활용이 제한적일 수밖에 없 다."}
{"patent_id": "10-2023-0121014", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같은 문제를 해결하기 위해 본 발명의 일 측면에서는 파트 포장과 로트 포장의 서로 상이한 요구조 건을 고려하여, 인공지능 모델에 기반한 파트 포장 자동화 시스템 및 이를 이용한 자동 포장 방법을 제안하고자 한다. 구체적으로, 파트 포장 자동화를 위한 시스템에서는 파트 포장 대상에 대한 입력 데이터에 적입 제한조건 정보 를 반영하여 전처리를 수행하고, 이를 입력 받은 인공지능 모델을 휴리스틱(heuristic) 알고리즘 기반 제 1 인 공지능 모델과 상기 적입 제한조건을 고려하여 재배치를 수행하는 제 2 인공지능 모델을 순차적으로 연결하여 사용함으로써, 빠른 파트 포장 결과물을 도출하면서도 파트 포장 대상별 적입 제약조건을 효율적으로 반영할 수 있는 시스템을 제안하고자 한다. 아울러, 본 발명의 일 실시예에서는 상술한 인공지능 모델의 처리 결과에도 적입 공간 내 여유공간을 파악하고, 서로 다른 기준을 이용하는 추가적인 FFD (First Fit Decreasing) 알고리즘을 통해 충진율을 높이기 위한 방법 을 제안한다. 본 발명에서 해결하고자 하는 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은 또"}
{"patent_id": "10-2023-0121014", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0121014", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 바와 같은 과제를 해결하기 위한 본 발명의 일 측면에서는, 인공지능 모델을 이용한 적입공간 내 파트 (part) 포장 자동화 시스템에 있어서, 상기 파트 포장 대상에 대한 입력 데이터에 적입 제한 조건 정보를 반영 하여 전치리할 수 있도록 구성된 UI(User Interface)를 포함하는 디스플레이; 및 상기 전처리된 입력 데이터를 휴리스틱(heuristic) 알고리즘 기반 제 1 인공지능 모델을 통해 제 1 차 적재 결과를 도출하고, 상기 제 1 차 적재 결과를 상기 적입 제한 조건에 따라 재배치를 수행하는 제 2 인공지능 모델을 통해 제 2 차 적재 결과를 도출하도록 구성되는 프로세서를 포함하는, 파트 포장 자동화 시스템을 제안한다. 상기 적입 제한 조건 정보는, 상기 파트 포장 대상별 혼적 금지 규칙 정보를 포함할 수 있으며, 상기 제 1 인공 지능 모델은 상기 적입 제안 조건을 고려한 제 1 FFD (First Fit Decreasing) 알고리즘에 기반할 수 있다. 상기 프로세서는, 상기 제 2 차 적재 결과에 기반하여 상기 적입공간 내 여유 공간에 추가 적입 가능한 추가 파 트 포장 후보를 도출하고, 상기 추가 파트 포장 후보를 제 2 FFD 알고리즘에 기반하여 추가 배치하여 제 3 차 적재 결과를 도출하는 제 3 인공지능 모델을 추가적으로 포함할 수 있다. 이때, 상기 제 1 FFD 알고리즘과 상기 제 2 FFD 알고리즘은 서로 상이한 적입 제한 기준 또는 충진율 기준 중 하나 이상에 기반하여 운용되는 것이 바람직하다. 한편, 상기 프로세서는, 상기 제 2 차 적재 결과에 기반하여 상기 적입공간 내 여유 공간에 추가 적입 가능한 추가 파트 포장 후보를 상기 디스플레이에 표시하고; 상기 UI를 통해 추가 적입 대상으로 결정된 추가 파트 포 장 대상을 상기 디스플레이를 통해 2D 또는 3D 배닝도에 표시하며; 상기 UI를 통해 추가 적입 대상으로 확정된 결과를 반영하여 제 3 차 적재 결과를 도출하도록 구성될 수도 있다. 상기 제 2 인공지능 모델은, 상기 제 1 차 적재 결과에 기반하여 Z축 기반 순서 재배치를 판단하고, 상기 파트 포장 대상에 대한 정보에 기반하여 X축 및 Y축 중 하나 이상의 순서 재배치를 판단하도록 구성될 수 있다. 한편, 상술한 바와 같은 과제를 해결하기 위한 본 발명의 다른 일 측면에서는, 인공지능 모델을 포함하는 프로 세서를 이용하여 적입공간 내 파트(part) 포장을 자동으로 수행하는 방법에 있어서, 상기 파트 포장 대상에 대 한 입력 데이터에 적입 제한 조건 정보를 반영하여 전치리가 수행된 데이터를, 상기 프로세서에 구비된 휴리스틱(heuristic) 알고리즘 기반 제 1 인공지능 모델을 통해 제 1 차 적재 결과를 도출하고; 그리고 상기 제 1 차 적재 결과를 상기 적입 제한 조건에 따라 재배치를 수행하는 상기 프로세서의 제 2 인공지능 모델을 통해 제 2 차 적재 결과를 도출하는 것을 포함하는, 파트 포장 자동 수행 방법을 제안한다. 이 경우 역시, 상기 적입 제한 조건 정보는, 상기 파트 포장 대상별 혼적 금지 규칙 정보를 포함할 수 있으며, 상기 제 1 인공지능 모델은 상기 적입 제안 조건을 고려한 제 1 FFD (First Fit Decreasing) 알고리즘에 기반할 수 있다. 상술한 방법은, 상기 프로세서가, 상기 제 2 차 적재 결과에 기반하여 상기 적입공간 내 여유 공간에 추가 적입 가능한 추가 파트 포장 후보를 도출하고; 상기 추가 파트 포장 후보를 제 2 FFD 알고리즘에 기반하여 추가 배치 하여 제 3 차 적재 결과를 도출하는 것을 추가적으로 포함할 수 있다. 이때, 상기 제 1 FFD 알고리즘과 상기 제 2 FFD 알고리즘은 서로 상이한 적입 제한 기준에 기반하여 운용되는 것이 바람직하다. 또한, 상술한 방법은, 상기 프로세서가, 상기 제 2 차 적재 결과에 기반하여 상기 적입공간 내 여유 공간에 추 가 적입 가능한 추가 파트 포장 후보를 디스플레이에 표시하고; 상기 디스플레이의 UI(User Interface)를 통해 추가 적입 대상으로 결정된 추가 파트 포장 대상을 상기 디스플레이를 통해 2D 또는 3D 배닝도에 표시하며; 상 기 UI를 통해 추가 적입 대상으로 확정된 결과를 반영하여 제 3 차 적재 결과를 도출하는 것을 추가적으로 포함 할 수도 있다. 또한, 상기 제 2 인공지능 모델은, 상기 제 1 차 적재 결과에 기반하여 Z축 기반 순서 재배치를 판단하고; 상기 파트 포장 대상에 대한 정보에 기반하여 X축 및 Y축 중 하나 이상의 순서 재배치를 판단할 수 있다. 상술한 설명에서, 상기 파트 포장 자동화 시스템은 로트(lot) 포장 자동화 시스템과 구분되어 운용되는 것이 바 람직하다. 또한, 상기 적입공간은 컨테이너 박스를 포함할 수 있으며, 상기 파트 포장 대상은 KD(Knock Down) 물류 프로세 스에서 소정 기간 내 파트 단위 주문에 기반할 수 있으나, 이에 한정될 필요는 없다."}
{"patent_id": "10-2023-0121014", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같은 본 발명의 실시예들에 따르면, 파트 포장과 로트 포장의 서로 상이한 요구조건을 고려하여, 인공지능 모델에 기반한 파트 포장 자동화에 특화된 시스템을 제공할 수 있다. 구체적으로, 파트 포장 자동화를 위한 시스템에서 파트 포장 대상에 대한 입력 데이터에 적입 제한조건 정보를 반영하여 전처리를 수행하고, 인공지능 모델을 휴리스틱 알고리즘 기반 제 1 인공지능 모델과 상기 적입 제한조 건을 고려하여 재배치를 수행하는 제 2 인공지능 모델을 순차적으로 연결하여 사용함으로써, 빠른 파트 포장 결 과물을 도출하면서도 파트 포장 대상별 적입 제약조건을 효율적으로 반영할 수 있다. 아울러, 상술한 인공지능 모델의 처리 결과에도 적입 공간 내 여유공간을 파악하고, 서로 다른 기준을 이용하는 추가적인 FFD 알고리즘을 통해 충진율을 효율적으로 높일 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2023-0121014", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0121014", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하의 설명에 있어서, “인공지능”은 “머신러닝” 및 “딥러닝”을 포함하는 광의의 개념으로, “머신러닝” 은 “딥러닝”을 포함하는 광의의 개념으로 사용된다. “머신러닝”은 특정 규칙과 논리에 따라 방대한 데이터 를 분석한 뒤 이를 기반하여 예측치를 제공하는 방식을, “딥러닝”은 머신러닝의 일종으로 기계가 스스로 데이 터를 분석/학습하고 특징을 추출하여 학습/예측을 수행하는 개념을 가정한다. 즉, 머신러닝 중 기계가 스스로 특징을 추출하는 방식을 딥러닝으로 볼 수 있다. 또한, 이하에서 설명할 적입공간 내 파트 포장, 로트 포장은 KD 물류 프로세스에서 컨테이너에 포장대상물을 적 입하는 예를 중심으로 설명하나, 본 발명은 이에 한정될 필요는 없다. 구체적으로, '적입공간'은 상술한 컨테이 너 박스뿐만 아니라 물류 창고, 출하지/제조지 저장 공간 등 다양한 대상을 의미할 수 있으며, '물류 프로세 스'는 상술한 KD 물류 프로세스뿐만 아니라 파트 단위, 로트 단위의 물류가 이루어지는 다양한 물류 프로세스를 포함할 수 있다. 상술한 바와 같이 본 발명의 일 측면에서는 물류 프로세스에서 파트 포장과 로트 포장의 서로 상이한 요구조건 을 고려하여, 인공지능 모델에 기반한 파트 포장 자동화 시스템 및 이를 이용한 자동 포장 방법을 제안하고자 한다. 이를 위해 먼저 파트 포장과 로트 포장의 서로 상이한 요구조건에 대해 구체적으로 살펴본다. 도 2는 본 발명의 일 측면에서 고려하는 파트 포장과 로트 포장의 개념을 설명하기 위한 도면이다. 도 2는 설명의 편의를 위해 KD 물류 프로세스를 예를 들어 파트 포장과 로트 포장에 대해 설명하고 있다. 먼저, 단계에서 포장 대상은 물류 프로세스의 주문 정보에 따라 실시간으로 변동될 수 있으며, 단계에 서 KD 포장 완료 대박스를 기준으로 파트 포장 대상물과 로트 포장 대상물을 구분하여 적입 대상 아이템 데이터 를 생성할 수 있다. 본 발명 및 본 발명과 동일자로 출원되는 “인공지능 모델 기반 로트 포장 자동화 시스템 및 이를 이용한 자동 포장 방법”에서는, 공통적으로 단계에서 이와 같이 생성된 적입 대상 아이템 데이터를 인공지능 모델(구체 적으로 컨테이너 적입 AI 모델)에 입력하고, 이때 인공지능 모델은 휴리스틱 모델을 포함하며, 학습 기반의 강 화학습 모델을 이용하는 것을 제안한다. 이와 같은 인공지능 모델의 출력은 컨테이너 적입 방식에 대한 시각화된 배닝도 및 작업 지시서의 형태로 출력될 수 있다. 다만, 본 발명에서는 물류 프로세스에서 파트 포장과 로트 포장에서 각각 요구되는 효율화조건이 아래와 같이 다른 점에 주목한다.표 1 유형 주문 부품, 포장자재대박스 크기보관공간 (동일 수량 가정)포장사양출하방법 파트포장부품별 주문수 량 상이소 중,소 (표준화)소 표준목표 충진율 만족시 출 하를 진행 로트포장물량이 정해진 로트 기준으로 주문 발행대 대 (비표준)대 다양출하 컨테이너 수와 출 하 케이스가 사전에 지 정되어 있음 상기 [표 1]에서 구체적으로, 파트포장의 주문은 월별 현지 고객사 생산 및 재고수량을 고려하여 생산 관리자가 주문을 발행하므로, 부품별로 주문 수량이 상이한 특징을 가지는 반면, 로트 포장의 주문은 차량의 KD 물류를 가정하면, '40대 분' 등으로 대수로 정해진 로트 기준으로 주문이 발행되는 것이 일반적이다. 이에 따라 파트포장은 부품의 포장자재가 작으며, 대박스의 크기도 중, 소형 박스에 대응하며, 동일한 수량(대 수)를 가정하였을 때 보관공간이 작은 반면, 파트 포장 대상의 포장 사양은 표준화된 특성을 가진다. 이에 따라 로트포장은 부품의 포장자재가 크며, 대박스의 크기도 대형 박스에 대응하며, 동일한 수량(대수)를 가정하였을 때 보관공간이 큰 반면, 로트 포장 대상의 포장 사양은 로트 단위 내에서 다양한 특성을 가진다. 한편, 파트 포장은 컨테이너별 목표 충진율을 만족하게 되면 출하를 진행하는 반면, 로트 포장은 출하 컨테이너 수와 출하 물품 케이스가 사전에 지정되어 있으며, 정해진 배닝 /소요량을 준수하여 출하되는 것이 일반적이다. 이와 같은 파트 포장과 로트 포장의 프로세스 상 차이로 인하여, 본 발명에서 제안하는 파트 포장 자동화 시스 템은, 물류 고객사의 적입 요구사항(적입 제한조건)을 효율적으로 반영하여 파트 포장을 수행하는 것이 필 요하며, 바람직하게 인공지능 모델의 처리속도를 빠르게 유지하면서도, 충진율을 개선하고, 고객별로 일관 된 충진율을 제공하는 것을 제안한다. 또한, 본 발명과 동일자로 출원되는 로트 포장 자동화 시스템은, 파트 포장과 대비하여 포장 대상이 로트 단위로 일관화되어 있는 점에 기반하여, 로트 포장 대상에 대해 모든 적입 조합을 고려하는 LP (Linear Programing) 알고리즘을 활용하되, 해당 LP 알고리즘의 적용 방식을 효율화하고, 이를 다른 로트 포장에 대해서 도 반복 적용하는 방식을 제안하며, 부품사 입고/포장 계획 등의 변수로 인하여 배닝도 작성 작업의 효율성 을 증가시키는 시스템을 제안하고자 한다. 본 발명자는 상술한 바와 같은 파트 포장과 로트 포장의 상이점에 기반하여, 파트 포장 자동화 시스템 및 로트 포장 자동화 시스템을 별도의 시스템으로 구축하고, 이러한 시스템을 별도의 포장 작업장에 적용하여, 각각의 포장 작업에 최적화된 솔루션을 제공하고자 한다. 이를 위해 도 2는 KD 포장장별(포트 포장 포장장 및 파트 포장 포장장) 웹페이지를 구현하고, 각각의 업무 프로 세스에 대해 최적화를 수행하기 위한 UX/UI를 구현하고자 한다. 도 3은 본 발명의 일 실시예에 따른 파트 포장 자동화 시스템의 구성을 설명하기 위한 도면이다. 먼저, 본 실시예에 따른 파트 포장 자동화 시스템은, 파트 포장 대상에 대한 입력 데이터(I)에 사용자가 적입 제한 조건 정보(R: 예를 들어, 고객이 요구한 파트 포장 대상별 혼적 금지 규칙 정보)를 반영하여 전치리할 수 있도록 구성된 UI를 포함하는 디스플레이를 포함할 수 있다. 입력 데이터(I)에 적입 제한 조건 정보 (R)를 반영하는 전처리의 구체적인 방식은 이하 도 4 및 도 5와 관련하여 후술하기로 한다. 또한, 본 실시예에 따른 시스템은, 상술한 바와 같이 전처리된 입력 데이터를 휴리스틱(heuristic) 알고리즘 기 반 제 1 인공지능 모델을 통해 제 1 차 적재 결과를 도출하고, 상기 제 1 차 적재 결과를 상기 적입 제한 조건(R)에 따라 재배치를 수행하는 제 2 인공지능 모델을 통해 제 2 차 적재 결과를 도출하도록 구성되는 프로세서를 포함할 수 있다. 이때, 제 1 인공지능 모델은 제 1 FFD (First Fit Decreasing) 알고리즘에 기반하되, 상술한 적입 제한 조건(R)을 고려하여 운용될 수 있다. 이와 같이 제 1 FFD 알고리즘에 의해 빠르게 포장 방식을 결정하면서도, 적입 제한 조건을 고려한 제 2 인공지능 모델을 순차적으로 적용하여, 포장 방식의 처리를 신속하게 유지하면서도, 고객이 요구한 적입 제한 조건을 명확하게 반영한 결과를 도출할 수 있다. 본 발명의 바람직한 일 실시예에 따른 프로세서는, 상술한 제 2 차 적재 결과에 기반하여 컨테이너와 같은 적입공간 내 여유 공간에 추가 적입 가능한 추가 파트 포장 후보를 도출하고, 상기 추가 파트 포장 후보를 제 2 FFD 알고리즘에 기반하여 추가 배치하여 제 3 차 적재 결과를 도출하는 제 3 인공지능 모델을 추가적으로 포함할 수 있다. 이때, 상술한 제 1 인공지능 모델이 활용하는 제 1 FFD 알고리즘과 상술한 제 3 인공지능 모델이 활 용하는 제 2 FFD 알고리즘은 서로 상이한 적입 제한 기준 및/또는 충진율 기준에 기반하여 운용될 수 있다. 예 를 들어, 제 1 인공지능 모델은 빠른 적입 방식 도출을 위해 일반적인 적입 제한 기준 및/또는 충진율 기 준에 의해 운용되고, 제 3 인공지능 모델은 특정 고객사에서 요청하는 높은 충진율 조건을 만족하기 위해 추가적으로 여유 공간을 활용하도록 제 2 FFD 알고리즘을 운용하도록 동작할 수 있다. 상술한 설명에 기반하여 이하에서는 KD 물류 프로세스를 예를 들어 구체적인 예를 설명한다. 도 4 및 도 5는 본 발명의 일 실시예에 따라 KD 물류 프로세스에서 입력 데이터에 전처리를 수행하는 방법을 설 명하기 위한 도면이다. 도 4에 도시된 바와 같이 KD 물류 프로세스의 파트 포장에 있어서, 활용 가능한 입력 정보는 가용 컨테이너 데 이터, 주문정보, 부품 데이터, 포장사양 데이터, 포장완료 데이터 등이 있다. 본 실시예에서는 먼저, 케이스 단위의 포장 완료 데이터를 케이스별 적입 세부 데이터와 결합하여, 품번 기준의 데이터 세트화를 수행할 수 있다(S410). 이러한 데이터에 후속적으로, 케이스 단위의 포장 완료 데이터 를 주문 정보와 결합하여 부품 단위의 품목, 위험물 정보, 긴급도, ETA 주차정보 및 주문설명 값을 반영할 수 있다(S420). 이후, 케이스 단위로 그룹핑하고, 각 케이스의 포장재 유형, 포장된 부품기준 위험물과 일반 그룹 케이스로 분 류할 수 있으며(S430), 이는 도 5에 표시된 UI 의 예에서 그룹 항목을 이용하여, A 그룹, B 그룹, C 그룹 과 같이 그룹핑할 수 있다. 또한, 도 5에 도시된 바와 같이, 케이스 그룹핑 조건을 관리하는 마스터 테이블을 통하여 혼적금지 규칙 등을 반영하여 고객사별 특수 단독적입 구분자를 적용(S440)하는 것을 제안하며, 도 5에서는 그룹 항 목에 이를 반영하여, A001 그룹, A002 그룹 등으로 구분되어 표시되는 형태를 예시적으로 나타내고 있다. 도 4에서는 위와 같은 데이터 전처리를 사용자가 도 5의 마스터 테이블을 표시하는 UI를 통해 지정하는 것 을 개념적으로 설명하였으나, 이에 한정될 필요는 없으며, 상술한 바와 같은 고객별 혼적금지 요건 등을 고려한 그룹핑 작업(S440)은 고객별 혼적금지 요건이 일반화될 수 있는 상황에서 규칙 기반 모델 등을 활 용하여 자동적으로 수행할 수 있으며, 학습 데이터의 축적 정보에 따라 강화 학습 모델을 활용하여 자동적으로 수행될 수 있음은 물론이다. 도 4 및 도 5의 실시예에서 포장완료 케이스 단위의 특성 데이터는 도 5에 도시된 바와 같은 형태를 가질 수 있 으며, 이는 도 3에서 상술한 입력 데이터(I)에 대응할 수 있다. 도 6 및 도 7은 본 발명의 일 실시예에 따른 프로세서 내 인공지능 모델들의 구성 및 동작을 구체적으로 설명하 기 위한 도면이다. 먼저, 상술한 바와 같이 프로세서는 FFD 휴리스틱 알고리즘을 활용하는 제 1 인공지능 모델과 제약조건에 따른 재배치 알고리즘을 활용하는 제 2 인공지능 모델이 순차적으로 운용되도록 구성될 수 있다. 구체적으로, 도 6의 FFD 휴리스틱 알고리즘은 입력 데이터에 기반하여, 적재 대상 케이스를 밑면 크기 순 으로 정렬하고(S610), 좌측 코너에 가장 큰 케이스를 적재(S620) 하는 방식으로 최초 적재 대상을 선정할 수 있 으며, 이는 도 7의 도면부호 710에 나타낸 바와 같다. 이후, 본 실시예에 따른 FFD 휴리스틱 알고리즘은 후속 적재 후보 케이스를 선정(S630)하고, 현재 적재된 케이스들의 6면 방향 빈 공간을 탐색하며(S640), 빈 공간에 해당 케이스를 적재(S650)하는 과정을 반복할 수 있 으며, 이는 도 7의 도면부호 720에 나타낸 바와 같다. 도 7의 도면부호 720에서, 기 적재된 제 1 케이스 기준 6면의 빈 공간을 탐색하여, 'O' 표시된 방향이 후 속 적재 가능 영역으로 표시하고 있으며, 후속하여 제 2 케이스 기준으로 6면의 빈 공간을 탐색하여, 모든 면에 후속 적재가 가능한 것을 나타내고 있으며, 본 실시예에서는 모든 면에 후속 적재가 가능할 때 z축을 우선 하여 제 3 케이스를 적재한 것을 나타내고 있다. 다시 도 6을 참조하면, 상술한 바와 같은 FFD 휴리스틱 알고리즘의 적재 결과에 대해 재배치 알고리즘 이 이를 재배치하여 수정된 적재 결과를 도출하는 과정을 수행할 수 있다. 구체적으로, 재배치 알고리즘은 FFD 휴리스틱 알고리즘의 적재 결과(제 1 차 적재 결과)에 기반하여 Z축 기반 순서 재배치를 판단하고(S660), 상기 파트 포장 대상에 대한 정보에 기반하여 X축 및 Y축 중 하나 이 상의 순서 재배치를 판단(S670)하도록 구성될 수 있다. 이러한 재배치는 도 7의 도면부호 730에 예시적으로 도시하고 있으며, 단계 S731에서는 Z축 기반 순서 재배치로 서, 고중량 케이스, 스틸 케이스를 하단으로 조정하는 예를 나타내고 있다. 또한, 단계 S732에서는 Z축 기반 재 배치의 일례로서, 위험물 케이스를 후면에 적재되도록 재배치하는 개념을 도시하고 있다. 도 8은 본 발명의 일 실시예에 따라 도 7과 같이 재배치가 이루어진 후 추가 적입을 수행하는 방식을 설명하기 위한 도면이다. 도 8은 추가 적입을 수행하기 위한 UI 화면의 형태를 예를 들어 도시하고 있다. 먼저, 본 실시예에 따른 UI는 추가 적입 후보의 검색 조건창(811, 812, 813, 814)을 구비하여 이를 사용자가 설정하도록 유도할 수 있다. 도 8에서는 차량의 KD 물류를 가정하여, 차종, 그룹, 케이스, 긴급도를 기준으로 추가 적입 후보의 검색 조건을 설정하는 예를 도시하고 있으나, 이는 예시일 뿐이다. 이러한 추가 적입 검색 조건창(811, 812, 813, 814)의 설정에 따라 추가 적입 대상에 대한 조회 데이터가 표시 될 수 있다. 이에 기반하여 사용자가 적입 수행 버튼을 활성화하면, 2D 및/또는 3D 배닝도를 포 함하여, 추가 적입 후보들의 추가 적입을 위한 도구들이 활성화될 수 있다. 한편, 사용자는 추가 적입을 도 3에서 상술한 바와 같이 제 3 인공지능 모델을 통해 자동적으로 수행할 수 있으며, 도 8의 예에서는 이를 위해 추가 적입(자동) 버튼(860a)을 통해 이를 구동할 수 있다. 본 발명의 다른 일 실시예에서는 사용자가 도 8에 도시된 2D/3D 배닝도 상에서 수동으로 추가 적입을 수행할 수 있으며, 이 경우 추가 적입 버튼(860b)을 통해 이를 구동할 수 있다. 2D/3D 배닝도 상에서 여유 공간이 있는 컨 테이너 또는 빈 컨테이너를 클릭 시, 적입 후보 케이스들의 정보가 팝업 형태로 도출되도록 구성할 수 있 다. 이러한 과정을 거쳐 적입/추가적입이 이루어진 결과는 적입 확정 적용 버튼을 통해 확정할 수 있으며, 그 결과 컨테이너 배정이 확정된 파트 포장 결과를 표시할 수 있다. 도 9는 도 4 내지 도 8에서 설명한 파트 포장 자동화 방식 전체를 정리하여 설명하기 위한 도면이다. 도 9에서 단계 S410 내지 단계 S450을 통해 전처리를 수행하여 입력 데이터(I)를 확보하는 과정은 도 4에서 상 술한 바와 같다. 이와 같이 전처리된 입력 데이터에 기반하여, 도 9에 도시된 실시예에서는 차량 KD 물류 프로세스를 가정하여, 고객사/차종을 선택하고(S910), 컨테이너 규격을 선택(S920)한 후, 제 1 인공지능 모델의 FFD 알고리즘(S980)을 활용하여 컨테이너 적입(S930)을 수행할 수 있다. 이때, 단계 S910에서 선택된 고객사/차종에 따라 추출된 적입 제약조건에 기반하여 FFD 알고리즘(S980)을 운용하는 것이 바람직하다. 또한, 컨테이너 적입(S930) 단계에서 사 용되는 FFD 알고리즘(S980)은 후술하는 추가 적입 시 사용하는 FFD 알고리즘(S1000)과의 구분을 위해 제 1 FFD 알고리즘(S980)으로 지칭한다. 도 9에 도시된 실시예에서는 상술한 바와 같이 컨테이너 적입(S930)이 완료된 후 추가적인 적입을 위한 후보 케 이스를 선정하고, 이에 따라 추가 적입(S950)을 수행하여 충진율을 개선할 수 있다. 이를 위해 제 1 FFD 알고리즘(S980)은 컨테이너 여유 공간 내 적입 가능 케이스를 도출하여 제 2 FFD 알고리즘 (S1000)에 제공할 수 있으며, 제 2 FFD 알고리즘(S1000)은 제 1 FFD 알고리즘과 상이한 적입 제한/충진율 기준에 따라 추가 적입(S950)을 수행할 수 있다. 예를 들어, 높은 충진율 조건을 요청한 고객의 물류를 위한 기준 등 제 2 FFD 알고리즘(S1000)이 사용하는 기준은 제 1 FFD 알고리즘(S980)에 비해 조금 더 제약에 너그러운 조 건을 가진 기준이 이용될 수 있다. 이러한 절차를 거쳐 최종적인 작업지시서를 생성(S960)할 수 있다. 상술한 바와 같이 개시된 본 발명의 바람직한 실시예들에 대한 상세한 설명은 당업자가 본 발명을 구현하고 실 시할 수 있도록 제공되었다. 상기에서는 본 발명의 바람직한 실시예들을 참조하여 설명하였지만, 해당 기술 분 야의 숙련된 당업자는 본 발명의 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시 킬 수 있음을 이해할 수 있을 것이다. 예를 들어, 당업자는 상술한 실시예들에 기재된 각 구성을 서로 조합하는 방식으로 이용할 수 있다. 따라서, 본 발명은 여기에 나타난 실시예들에 제한되려는 것이 아니라, 여기서 개시된 원리들 및 신규한 특징들 과 일치하는 최광의 범위를 부여하려는 것이다. 산업상 이용가능성 상술한 바와 같은 실시예들에 따른 인공지능 모델 기반 파트 포장 자동화 시스템 및 이를 이용한 자동 포장 방 법은 상술한 KD 물류 프로세스의 컨테이너 적입뿐만 아니라, 다양한 적입공간에 파트 포장을 수행하는 물류 프 로세스에 다양하게 활용될 수 있다."}
{"patent_id": "10-2023-0121014", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 기본적인 KD 물류 프로세스를 설명하기 위한 도면이다. 도 2는 본 발명의 일 측면에서 고려하는 파트 포장과 로트 포장의 개념을 설명하기 위한 도면이다. 도 3은 본 발명의 일 실시예에 따른 파트 포장 자동화 시스템의 구성을 설명하기 위한 도면이다. 도 4 및 도 5는 본 발명의 일 실시예에 따라 KD 물류 프로세스에서 입력 데이터에 전처리를 수행하는 방법을 설 명하기 위한 도면이다. 도 6 및 도 7은 본 발명의 일 실시예에 따른 프로세서 내 인공지능 모델들의 구성 및 동작을 구체적으로 설명하기 위한 도면이다. 도 8은 본 발명의 일 실시예에 따라 도 7과 같이 재배치가 이루어진 후 추가 적입을 수행하는 방식을 설명하기 위한 도면이다. 도 9는 도 4 내지 도 8에서 설명한 파트 포장 자동화 방식 전체를 정리하여 설명하기 위한 도면이다."}
