{"patent_id": "10-2023-0140598", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0056652", "출원번호": "10-2023-0140598", "발명의 명칭": "바이어 매칭 장치 및 방법", "출원인": "(주)선인시스템", "발명자": "정보덕"}}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "판매 상품별로 판매자와 해외 바이어를 매칭시켜 주는 장치에 있어서,메모리; 및적어도 하나 이상의 판매자 단말로부터 해외 바이어 추천 요청을 수신하면, 상기 해외 바이어와 관련된 정보를획득하여 해외 바이어 DB를 구축하고, 상기 관련된 정보에 기반하여 상기 판매자에게 적합한 해외 바이어를 추천하는 제어부를 포함하는, 바이어 매칭 장치."}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 해외 바이어의 취급상품, 고객정보, 물류량, 각국 관세청 관련 자료, 각국 특허청 관련 자료, SNS 데이터및 고객이 필요로 하는 부품 중 적어도 하나에 대한 정보를 수집하여 구성요소로 하는 상기 해외 바이어의 DB를구축하는, 바이어 매칭 장치."}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는,상기 해외 바이어의 DB를 구성하는 구성요소에 서로 다른 가중치를 부여하고, 상기 가중치에 기반하여 상기 판매자에게 해외 바이어를 추천하는, 바이어 매칭 장치."}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는,SNS를 기반으로 상기 해외 바이어에 대한 정보를 추가로 획득 및 주기적으로 최신화하고, 판매 상품에 대한 시장의 수요를 지속적으로 확인하는, 바이어 매칭 장치."}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "판매 상품별로 판매자와 해외 바이어를 매칭시켜 주는 방법에 있어서,적어도 하나 이상의 판매자 단말로부터 해외 바이어 추천 요청을 수신하는 단계;상기 해외 바이어와 관련된 정보를 획득하여 해외 바이어 DB를 구축하는 단계; 및상기 판매자에게 적합한 해외 바이어를 추천하는 단계를 포함하는, 바이어 매칭 방법."}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 해외 바이어 DB를 구축하는 단계는,상기 해외 바이어의 취급상품, 고객정보, 물류량, 각국 관세청 관련 자료, 각국 특허청 관련 자료, SNS 데이터및 고객이 필요로 하는 부품 중 적어도 하나에 대한 정보를 수집하는 단계를 포함하는, 바이어 매칭 방법."}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2025-0056652-3-제6항에 있어서,상기 판매자에게 적합한 해외 바이어를 추천하는 단계는,상기 해외 바이어의 취급상품, 고객정보, 물류량, 각국 관세청 관련 자료, 각국 특허청 관련 자료, SNS 데이터및 고객이 필요로 하는 부품 중 적어도 하나에 대한 정보에 서로 다른 가중치를 부여하는 단계; 및상기 가중치에 기반하여 상기 판매자에게 해외 바이어를 추천하는 단계를 포함하는, 바이어 매칭 방법."}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 바이어 매칭 방법은,SNS를 기반으로 상기 바이어에 대한 정보를 획득 및 최신화하는 단계; 및 관련상품의 수요를 지속적으로 확인하는 단계를 더 포함하는, 바이어 매칭 방법."}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제5항에 기재된 방법을 수행하는 프로그램이 기록된 컴퓨터 판독 가능한 기록매체."}
{"patent_id": "10-2023-0140598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "바이어 매칭 장치에 의해 수행되며, 제5항에 기재된 방법을 수행하기 위해 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은 판매 상품별로 판매자와 해외 바이어를 매칭시켜 주는 장치에 있어서, 메모 리; 및 적어도 하나 이상의 판매자 단말로부터 해외 바이어 추천 요청을 수신하면, 상기 해외 바이어와 관련된 정보를 획득하여 해외 바이어 DB를 구축하고, 상기 관련된 정보에 기반하여 상기 판매자에게 적합한 해외 바이어 를 추천하는 제어부를 포함한다."}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은 바이어 매칭 장치 및 방법에 관한 것으로, 보다 구체적으로 관세청, 통계청, SNS 등 바이어와 관련된 자료를 토대로 판매자가 보다 적합한 해외 바이어를 찾을 수 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "산업이 점차 발전하고 고도화됨에 따라 새로운 기술과 이를 적용한 수많은 제품들이 해외시장에 쏟아져 나오고 있고, 대한민국과 같이 수출 중심의 무역구조에 토대를 두고 있는 국가들은 해외시장에서의 수출경쟁력이 경제 성장의 원동력으로 여겨지고 있다. 이에 따라, 각 기업들은 R&D 및 제품 개발뿐만 아니라 해외 시장 개척에도 많은 노력을 기울이고 있고, 세계 각 국의 다양한 바이어들과 접촉하면서 제품 홍보에 열을 올리고 있다. 최근 들어, 인공지능(AI) 기술이 발전함에 따라 빠르고 정확한 수출거래를 위해 제품과 회사에 대한 이해가 깊 고 믿을만한 바이어를 발굴하는 기술에 대한 관심이 높아지고 있다. 이와 관련하여, 해당분야의 선행기술 문헌이라고 할 수 있는 한국특허공개번호 제 10-2020-0137464호에서는 해 외 진출이 요구되는 기업 역량과 현지의 네트워크를 활용하여 기업의 해외 진출을 지원하고 컨설팅을 수행하는 방법에 대해 기재하고 있다. 그러나 상기 선행문헌은 기업이 진출하고자 하는 해외 국가의 박람회 또는 전시회의 일정 정보 및 해외 국가의 전문가 또는 바이어의 정보를 추출하여 미팅을 요청하고 해당 미팅 결과를 제공받는 내용이 기재되어 있을 뿐, 바이어에 대한 정보 및 관련제품에 대한 수요와 시장변화를 기반으로 적절한 바이어를 추천받는 내용까지는 기 재하지 못한다. 따라서, 상술한 문제점을 해결할 수 있는 기술이 필요하게 되었다."}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "한편, 전술한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한"}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다.발명의 내용"}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서에서 개시되는 일 실시예는, 바이어의 취급상품, 고객정보, 물동량, 각국 관세청 관련 자료, 각국 특 허청 관련 자료, SNS 데이터, 고객이 필요로 하는 부품 중 적어도 하나에 대한 정보를 기반으로 바이어에 관련 된 데이터베이스를 구축하는 장치 및 방법을 제시하는 데 목적이 있다. 또한, 본 명세서에서 개시되는 실시예들은, 제공되는 바이어의 다양한 정보들에 대하여 각기 다른 가중치를 부 여하고, 가중치에 기반하여 판매자에게 적합한 바이어를 추천하는 장치 및 방법을 제시하는 데 목적이 있다. 마지막으로 본 명세서에서 개시되는 실시예들은, SNS를 기반으로 바이어에 대한 정보를 획득하고 이를 최신화하 면서 동시에 관련제품의 수요를 지속적으로 확인하는 장치 및 방법을 제시하는 데 목적이 있다."}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 일 실시예에 따르면, 바이어 매칭 장치는 메모리; 및 적어도 하나 이상의 판매자 단말로부터 해외 바이어 추천 요청을 수신하면, 상기 해외 바이어와 관련된 정보를 획득하여 해외 바이어 DB를 구축하고, 상기 관련된 정보에 기반하여 상기 판매자에게 적합한 해외 바이어를 추 천하는 제어부를 포함할 수 있다. 다른 실시예에 따르면, 바이어 매칭 방법은 적어도 하나 이상의 판매자 단말로부터 해외 바이어 추천 요청을 수 신하는 단계; 상기 해외 바이어와 관련된 정보를 획득하여 해외 바이어 DB를 구축하는 단계; 및 상기 판매자에 게 적합한 해외 바이어를 추천하는 단계를 포함할 수 있다. 또 다른 실시예에 따르면, 바이어 매칭 방법을 수행하는 컴퓨터 판독 가능한 기록매체에서 바이어 매칭 방법은, 적어도 하나 이상의 판매자 단말로부터 해외 바이어 추천 요청을 수신하는 단계; 상기 해외 바이어와 관련된 정 보를 획득하여 해외 바이어 DB를 구축하는 단계; 및 상기 판매자에게 적합한 해외 바이어를 추천하는 단계를 포 함할 수 있다. 나아가 또 다른 실시예에 따르면, 바이어 매칭 방법을 수행하기 위해 기록매체에 저장된 컴퓨터 프로그램에서 바이어 매칭 방법은, 적어도 하나 이상의 판매자 단말로부터 해외 바이어 추천 요청을 수신하는 단계; 상기 해 외 바이어와 관련된 정보를 획득하여 해외 바이어 DB를 구축하는 단계; 및 상기 판매자에게 적합한 해외 바이어 를 추천하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 과제 해결 수단 중 어느 하나에 의하면, 바이어의 취급상품, 고객정보, 물동량, 각국 관세청 관련 자료, 각국 특허청 관련 자료, SNS 데이터, 고객이 필요로 하는 부품 중 적어도 하나에 대한 정보를 기반으로 바이어 에 관련된 데이터베이스를 구축하는 장치 및 방법을 제시할 수 있다. 또한, 전술한 과제 해결 수단 중 어느 하나에 의하면, 바이어의 다양한 정보들에 대하여 각기 다른 가중치를 부 여하고, 가중치에 기반하여 판매자에게 적합한 바이어를 추천하는 장치 및 방법을 제시할 수 있다. 마지막으로, 전술한 과제 해결 수단 중 어느 하나에 의하면, SNS를 기반으로 바이어에 대한 정보를 획득하고 이 를 최신화함과 동시에 관련제품의 수요를 지속적으로 확인하는 장치 및 방법을 제시할 수 있다. 개시되는 실시예들로부터 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또"}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "다른 효과들은 아래의 기재로부터 개시되는 실시예들이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 다양한 실시예들을 상세히 설명한다. 아래에 설명되는 실시예들은 여러 가 지 상이한 형태로 변형되어 실시될 수도 있다. 실시예들의 특징을 보다 명확히 설명하기 위하여, 이하의 실시예"}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "들이 속하는 기술분야에서 통상의 지식을 가진 자에게 널리 알려져 있는 사항들에 관해서 자세한 설명은 생략하 였다. 그리고, 도면에서 실시예들의 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분 에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 구성이 다른 구성과 \"연결\"되어 있다고 할 때, 이는 '직접적으로 연결'되어 있는 경우뿐 만 아니라, '그 중간에 다른 구성을 사이에 두고 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성이 어떤 구 성을 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한, 그 외 다른 구성을 제외하는 것이 아니라 다 른 구성들을 더 포함할 수도 있음을 의미한다. 우선, 본 명세서에서 사용하는 용어에 대해 정의하도록 한다. '해외 바이어'는 무역거래에 있어 판매자로부터 물건을 구입하는 사람이나 기업을 의미하고, 본원발명에서 판매 자가 해외 바이어 추천 요청을 한다는 것은 판매자가 특정 제품을 수출하기 위하여 해외 현지에서 무역업을 영 위하는 사람이나 기업을 추천해주기를 요청한다는 것을 의미한다. 또는, 해외 현지에서 판매자를 대신하여 제품 판매를 대행하는 사람이나 기업에 대한 추천을 요청한다는 것을 의미할 수도 있다. '매칭'은 판매자와 해외 바이어를 연결하는 행위를 의미하며, 판매자와 해외 바이어 간 연락처를 주고 받는 행 위 뿐만 아니라 본 발명이 제공하는 바이어 매칭 장치 또는 프로그램에 의해 판매자와 해외 바이어 사이에서 이 루어질 수 있는 어떠한 형태의 커뮤니케이션도 모두 포함할 수 있다. 이하 첨부된 도면을 참고하여 실시된 예들을 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 바이어 매칭 장치와 판매자 단말 간 네트워크 구성을 도시한 구성도이다. 도 1을 참조하면, 본 실시예에 따른 바이어 매칭 장치는 판매자가 해외에서 제품을 판매하려 할 때, 판매 상품별로 판매자와 해외 바이어를 매칭시켜 주는 장치로서, 이를 위해 적어도 하나 이상의 판매자 단말로 부터 해외 바이어 추천 요청이 수신되면, 해외 바이어와 관련된 정보를 획득할 수 있다. 이때, 바이어 매칭 장치는 네트워크(N)를 통해 특정되지 않은 임의의 판매자가 소지하고 있는 판매자 단말 및 외부 서버(미도시)와 통신하는 서버 장치로 구현될 수 있다. 여기서 언급하는 서버는, 판매자와 인터 랙션을 위한 어플리케이션이나 웹 브라우저가 설치된 단말기 등과 같이 네트워크를 통해 통신이 가능한 컴퓨터 로 구현되거나, 클라우드 컴퓨팅 서버로 구현될 수도 있다. 또한 서버는, 데이터를 저장할 수 있는 저장장치가 포함되거나, 제3의 서버를 통해 데이터를 저장할 수도 있다. 한편, 판매자 단말은 상품 별로 해외에서의 판매를 추진하고자 하는 판매자가 상품을 인수받아 해외에서 영리활동을 영위하려는 해외 바이어 가운데 적합한 해외 바이어를 추천받기 위해 사용하는 단말 장치일 수 있다. 따라서 전술한 단말 장치는 일반의 개인용 정보처리장치로 구현될 수 있으며, 판매자 단말에는 바이어 매 칭에 따라 적절한 해외 바이어를 추천하는 어플리케이션이 설치되거나 판매자에게 바이어를 추천하는 서비스에 접근하는데 필요한 웹 브라우저가 설치될 수 있고, 전술한 어플리케이션이나 웹 브라우저는 서버의 형태로 구현 되는 바이어 매칭 장치와 연동되어 바이어 매칭 서비스를 제공하는데 이용될 수 있다. 이와 같은 판매자 단말은 네트워크(N)를 통해 원격지의 서버에 접속하거나, 타 단말 및 서버와 연결 가능 한 컴퓨터나 휴대용 단말기, 텔레비전, 웨어러블 디바이스(Wearable Device) 등으로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop)등을 포함하 고, 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), GSM(Global System for Mobile communications), IMT(International Mobile Telecommunication)- 2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet), 스마트폰(Smart Phone), 모바일 WiMAX(Mobile Worldwide Interoperability for Microwave Access) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 또한, 텔레비전은 IPTV(Internet Protocol Television), 인터넷 TV(Internet Television), 지상파 TV, 케이블 TV 등을 포함할 수 있다. 나아가 웨어러블 디바이스는 예를 들어, 시계, 안경, 액세서리, 의복, 신발 등 인체에 직접 착용 가능한 타입의 정보처리장치로서, 직접 또는 다른 정보처리장치를 통해 네트워 크를 경유하여 원격지의 서버에 접속하거나 타 단말과 연결될 수 있다. 본 실시예를 설명함에 있어서, 판매자 단말은 휴대성이 용이한 휴대용 단말기인 것으로 설명하지만 이에 한하지 않으며, 상술된 바와 같이 네트워크를 통해 바이어 매칭 장치와 통신이 가능한 것이라면 관계없다. 한편, 일 실시예에 따르면 바이어 매칭 장치는 판매자 단말과 별도의 장치일 수 있으나, 또 다른 실 시예에 따르면, 바이어 매칭 장치는 판매자 단말과 일체로서 동작할 수도 있다. 본 실시예에 따른 바이어 매칭 장치는 사용자와 인터랙션할 수 있는 어플리케이션이 설치된 판매자 단말로 구현되거나 서버로 구현되거나 또는 서버-클라이언트 시스템으로 구현될 수 있으며, 서버-클라이언트 시스템으 로 구현되는 경우, 판매자와의 인터랙션을 위한 온라인 서비스용 어플리케이션이 설치된 판매자 단말을 포함할 수 있다. 상술된 바와 같이 바이어 매칭 장치는 전자단말기, 서버 또는 서버-클라이언트 시스템 중 어느 하나의 형 태로 구현될 수 있으며, 서버로 구현될 경우 바이어 제공 장치를 구성하는 구성부는 물리적으로 분리된 복 수의 서버에서 수행되거나 하나의 서버에서 수행될 수 있으며, 전자단말기로 구현되는 경우 사용자 단말과 일체 로서 동작할 수도 있다. 도 2는 일 실시예에 따른 바이어 매칭 장치의 기능을 설명하기 위한 블록도이다. 도 2를 참조하면, 바이어 매칭 장치는 메모리, 제어부 및 통신부를 포함할 수 있다. 메모리는 파일, 어플리케이션 및 프로그램 등과 같은 다양한 종류의 데이터를 설치 및 저장될 수 있으며, RAM, HDD 및 SSD 등과 같이 다양한 종류의 메모리 중 적어도 하나를 포함하도록 구성될 수 있다. 또한, 바이어 매칭 방법을 수행하기 위한 바이어 매칭 프로그램이 설치될 수도 있고, 후술하는 제어부는 메모리에 저장된 데이터에 접근하여 이를 이용하거나, 또는 새로운 데이터를 메모리에 저장할 수도 있다. 또한, 제 어부는 메모리에 설치된 프로그램을 실행할 수도 있다. 한편, 일 실시예에 따르면, 메모리에는 판매자에 대한 정보와 판매자가 취급하는 상품에 대한 정보가 연동 되어 함께 저장될 수 있다. 여기서 판매자에 대한 정보는 기업의 경우, 판매의 주체가 될 수 있는 법인명, 사업 자 번호, 대표자 이름 및 연락처 등이 포함될 수 있고, 이외에도 판매자임을 식별할 수 있는 판매자의 식별정보 와 상품에 대한 정보가 포함될 수 있다. 판매되는 혹은 판매 예정인 상품에 대한 정보는 상품명, 상품의 가격, 상품이 속하는 상품군에 대한 정보, 상품의 원료에 대한 정보 및 상품의 지역별, 연령별 선호도 등에 대한 정보 가 포함될 수 있다. 또한, 메모리에는 판매자의 주요 거래 고객에 대한 정보가 판매자의 주요 상품 정보와 연동하여 저장될 수 도 있고, 외부 서버(미도시)로부터 획득된 소셜 미디어(SNS), 인터넷 기사, 인터넷 게시물 등이 저장될 수도 있 다. 아울러, 메모리에는 인공지능 모델이 저장될 수 있다. 인공지능 모델은, 예를 들어, BERT(Bidirectional Encoder Representations from Trasformers)와 같은 자연어 처리 모델(NLP, Natural Language Processing), Word2Vec, GloVe(Global Vectors for Word Representation), CNN(Convolution Neural Networks), RNN(Recurrent Neural Networks), LSTM(Long Short-Term Memory) 등일 수 있다. 제어부는 바이어 매칭 장치의 전체적인 동작을 제어하며, CPU, GPU 등과 같은 프로세서를 포함할 수 있다. 제어부는 적어도 하나 이상의 판매자 단말로부터 해외 바이어 추천 요청을 수신한다면, 수신된 요청에 대응할 수 있는 동작을 수행하도록 바이어 매칭 장치에 포함된 다른 구성들을 제어할 수 있다. 예를 들어, 제어부는 메모리에 저장된 프로그램을 실행시키거나, 메모리에 저장된 파일을 읽어 오거나, 새로운 파일을 메모리에 저장할 수도 있다. 제어부는 메모리에 저장된 데이터에 접근하 여 이를 이용하거나, 또는 새로운 데이터를 메모리에 저장할 수도 있다. 또한, 제어부는 특정되지 않은 판매자 단말로부터 해외 바이어 추천 요청이 수신되면, 하나 이상의 국가에서 활동하고 있는 해외 바이어에 관한 정보를 수집하여 분석할 수 있다. 여기서, 해외 바이어에 관한 정보는 판매자가 판매하려는 상품이 속한 상품군을 주로 취급하는 해외 바이어에 대한 통계자료를 포함할 수 있다. 이때, 통계자료는 데이터베이스를 검색하거나 전화나 대면으로 이루어지는 설문조사 및 인터넷 리서치 등을 통해 얻어지는 자료를 의미한다. 나아가, 제어부는 해외 바이어와 관련된 정보를 획득하여 해외 바이어 DB(데이터 베이스)를 구축할 수 있 다. 이때 해외 바이어와 관련된 정보는 구체적으로 해외 바이어가 취급하는 상품 및 해외 바이어의 고객에 대한 정보일 수 있다. 또한, 해외 바이어와 관련된 정보는 일정 기간 동안 해외 바이어가 취급하는 상품의 물류량, 또는 각국 관세청이 제공하는 상품 관련 세관 자료일 수 있고, 각국 관련 특허청에서 제공하는 상품 관련 지식 재산권 자료일 수도 있다. 또한, 해외 바이어와 관련된 정보는 해외 바이어가 속해 있는 기업의 소셜 미디어 (SNS) 데이터이거나 해외 바이어가 직접 운영하는 개인 소셜 미디어(SNS) 데이터일 수도 있다. 뿐만 아니라 만 약 판매자가 취급하는 상품이 제조업과 관련된 상품이라면, 해외 바이어와 관련된 정보는 고객이 필요로 하는 부품 등에 대한 정보일 수도 있으며, 전술한 바와 같이 해외 바이어와 관련된 다양한 정보를 수집하여 이를 구 성요소로 하는 해외 바이어의 DB를 구축할 수도 있다. 제어부는 해외 바이어와 관련된 다양한 정보를 토대로 해외 바이어의 DB를 구축한 후에는, 해외 바이어와 관련된 정보를 기반으로 판매자에게 적합한 해외 바이어를 추천할 수 있다. 추가적으로, 제어부는 판매자 단말로부터 해외 바이어 추천 요청을 수신하면 기 구축된 해외 바이어 DB에서 판매자의 상품과 관련된 해 외 바이어 정보를 우선적으로 검색할 수 있다. 이와 같은 경우에는, 상품과 관련된 해외 바이어에 대한 정보를 획득할 필요 없이 기 구축된 DB를 이용할 뿐이므로 해외 바이어 추천 요청의 수신부터 해외 바이어를 추천하는 과정까지 걸리는 시간을 단축시킬 수 있다. 또한, 제어부는 해외 바이어와 관련된 정보를 수집하면서 외부 서버(미도시)로부터 소셜 미디어(SNS) 게시 물 및 인터넷 기사 등을 크롤링할 수도 있다. 나아가, 제어부는 상품과 관련된 해외 바이어의 DB에서 각 항목에 따라 동등한 가중치를 부여할 수도 있고, 서로 다른 가중치를 부여할 수도 있다. 예를 들어, 판매자의 상품과 관련하여 A라는 해외 바이어와 B라는 해외 바이어가 있다고 했을 때, 바이어 A는 바이어 B보다 취급하는 상품의 종류 및 물류량이 많고, 소정기간 동 안 세관을 통과한 물품의 양이 많고, 바이어 B는 바이어 A보다 소셜 미디어(SNS)를 통해 제품을 홍보한 횟수가 많다고 가정할 수 있다. 이와 같은 경우, 판매자가 많은 종류의 상품을 취급하거나 한 종류의 상품이라도 다량 의 상품을 주로 거래하는 유형이라면, 제어부는 기 입력된 판매자의 유형을 고려하여 취급상품, 물류량, 각국 관세청 관련 자료에 다른 항목보다 더 높은 가중치를 부여할 수 있다. 따라서 항목별로 합산 점수를 계산 했을 때, 가중치가 더 높은 항목들의 영향에 의해 바이어 A에 대한 점수가 바이어 B에 대한 점수보다 높을 수 있고, 이에 따라 판매자에게 바이어 A가 적합한 바이어로 추천될 수 있다. 또다른 실시예에 따르면, 판매자가 해외 시장에 이제 막 진입하여 판매로 인한 수익률 보다는 해외 소비자들에 게 홍보하는 것에 더욱 초점을 맞추고 있다면, 제어부는 소셜 미디어(SNS) 데이터에 다른 항목보다 더 높 은 가중치를 부여할 수 있다. 제어부는 상품과 관련된 해외 바이어 DB내의 어떤 항목에 대하서도 가중치를 부여할지 여부에 대해 결정할 수 있으며, 가중치를 부여하지 않는다면 각 항목당 동등한 가중치를 부여한 것으로 가정하고 바이어에 대한 합 산 점수를 산출할 수 있다. 또한 제어부는 자동으로 소셜 미디어(SNS)를 기반으로 해외 바이어에 대한 정보를 추가적으로 획득할 수 있고, 해외 바이어에 대한 정보를 주기적으로 업데이트할 수도 있다. 뿐만 아니라 제어부는 판매자의 판매 상품에 대한 수요를 지속적으로 확인할 수도 있다. 이때, 제어부는 판매 상품에 대한 수요를 지속적으로 확인하는 데 있어, 각종 소셜 미디어(SNS), 인터넷 기사, 관련 학술자료 및 웹페이지를 크롤링하여 관련 정보를 수집할 수도 있다. 통신부는 판매자 단말, 외부 서버(미도시)와 유무선의 형태로 통신을 수행할 수 있다. 이를 위해, 통 신부는 다양한 유무선 통신 방법 중 적어도 하나를 지원하는 통신 모듈을 포함할 수 있다. 예를 들어, 통 신 모듈은 칩셋(chipset) 형태로 구현될 수 있다. 통신부가 지원하는 무선 통신은, 예를 들어 Wi-Fi(Wireless Fidelity), Wi-Fi Direct, 블루투스 (Bluetooth), UWB(Ultra Wide Band) 또는 NFC(Near Field Communication) 등일 수 있다. 또한, 통신부가 지원하는 유선 통신은, 예를 들어 USB 또는 HDMI(High Definition Multimedia Interface) 등일 수 있다. 도 3은 일 실시예를 따른 바이어 매칭 방법을 설명하기 위한 순서도이다. 도 3에 도시된 실시예에 따른 바이어 매칭 방법은 도 1 내지 도 2에 도시된 바이어 매칭 장치에서 시계열 적으로 처리되는 단계들을 포함한다. 따라서, 이하에서 생략된 내용이라고 하더라도 도 1 내지 도 2에 도시된 바이어 매칭 장치에 관하여 이상에서 기술한 내용은 도 3에 도시된 실시예에 따른 바이어 매칭 방법에도 적용될 수 있다. 도 3을 참조하면, 바이어 매칭 장치는 적어도 하나 이상의 판매자 단말로부터 해외 바이어 추천 요청 을 수신할 수 있다(S310). 바이어 매칭 장치는 판매 상품에 대한 해외 바이어와 관련된 정보를 획득하여 해외 바이어 DB를 구축할 수 있다(S320). 이어서, 해외 바이어 DB가 구축된 후에는 바이어 매칭 장치는 판매자에게 적합한 해외 바이어를 추천할 수 있다(S330). S330 단계는 도 4를 참조하여 아래에 후술된다. 도 4는 일 실시예에 따른 바이어 매칭 방법을 설명하기 위한 순 서도이다. 도 4를 참조하면, 바이어 매칭 장치는 해외 바이어의 취급상품, 고객정보, 물류량, 각국 국세청 관련 자료, 각국 특허청 관련 자료, SNS 데이터, 고객이 필요로 하는 부품 중 적어도 하나에 대한 정보에 서로 다른 가중치를 부여할 수 있다(S410). 이를 통해 바이어 매칭 장치는 조사대상 바이어에 대해 항목별로 상 이한 가중치를 적용하여 그 점수를 합산함으로써 판매자에 대한 바이어의 적합도를 점수로 산출할 수 있다. 바이어 매칭 장치는 앞서 항목별로 다르게 적용한 가중치에 기반하여 판매자에게 적합한 해외 바이어를 추 천할 수 있다(S420). 이는 S410에서 기 산출한 바이어별 합산 점수를 비교함으로써, 가장 높은 점수를 획득한 바이어를 추천하는 것이 일반적이다. 바이어 매칭 방법은 판매자에게 적합한 해외 바이어를 추천하는 단계(S330) 이후에도 소셜 미디어(SNS)를 기반 으로 해외 바이어에 대한 정보를 추가적으로 획득하는 단계 및 이를 주기적으로 최신화하는 단계를 더 포함할 수도 있다. 또한, 판매 상품에 대한 시장의 수요를 지속적으로 확인하는 단계를 더 포함시켜 해외 바이어에 및 해외 시장에 대한 변화되는 내용을 계속 업데이트 함으로써 향후 바이어 추천 시 해당 상품에 가장 적합한 바이 어를 추천할 수 있는 DB를 구축할 수 있다. 이상의 실시예들에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(field programmable gate array) 또는 ASIC 와 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구 성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프 로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램특허 코드의 세그먼트들, 드라이버들, 펌웨어, 마 이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구 성요소들과 '~부'들로부터 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU 들을 재생시키도록 구현될 수도 있다. 도 3 및 도 4를 통해 설명된 실시예에 따른 바이어 매칭 방법은 컴퓨터에 의해 실행 가능한 명령어 및 데이터를 저장하는, 컴퓨터로 판독 가능한 매체의 형태로도 구현될 수 있다. 이때, 명령어 및 데이터는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 소정의 프로그램 모듈을 생성하여 소정의 동작을 수 행할 수 있다. 또한, 컴퓨터로 판독 가능한 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있 고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터로 판독 가능한 매체는 컴퓨터 기록 매체일 수 있는데, 컴퓨터 기록 매체는 컴퓨터 판독 가능 명령어, 데이터 구조, 프로그램 모듈 또 는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비 분리형 매체를 모두 포함할 수 있다. 예를 들어, 컴퓨터 기록 매체는 HDD 및 SSD 등과 같은 마그네틱 저장 매체, CD, DVD 및 블루레이 디스크 등과 같은 광학적 기록 매체, 또는 네트워크를 통해 접근 가능한 서버에 포 함되는 메모리일 수 있다. 아울러 도 3 및 도 4를 통해 설명된 실시예에 따른 수출 대상 국가 추천 방법은 컴퓨터에 의해 실행 가능한 명 령어를 포함하는 컴퓨터 프로그램(또는 컴퓨터 프로그램 제품)으로 구현될 수도 있다. 컴퓨터 프로그램은 프로 세서에 의해 처리되는 프로그래밍 가능한 기계 명령어를 포함하고, 고레벨 프로그래밍 언어(High-level Programming Language), 객체 지향 프로그래밍 언어(Object-oriented Programming Language), 어셈블리 언어 또는 기계 언어 등으로 구현될 수 있다. 또한 컴퓨터 프로그램은 유형의 컴퓨터 판독가능 기록매체(예를 들어,메모리, 하드디스크, 자기/광학 매체 또는 SSD(Solid-State Drive) 등)에 기록될 수 있다. 따라서 도 3 및 도 4를 통해 설명된 실시예에 따른 바이어 매칭 방법은 상술한 바와 같은 컴퓨터 프로그램이 컴 퓨팅 장치에 의해 실행됨으로써 구현될 수 있다. 컴퓨팅 장치는 프로세서와, 메모리와, 저장 장치와, 메모리 및 고속 확장포트에 접속하고 있는 고속 인터페이스와, 저속 버스와 저장 장치에 접속하고 있는 저속 인터페이스 중 적어도 일부를 포함할 수 있다. 이러한 성분들 각각은 다양한 버스를 이용하여 서로 접속되어 있으며, 공통 머더보드에 탑재되거나 다른 적절한 방식으로 장착될 수 있다. 여기서 프로세스는 컴퓨팅 장치 내에서 명령어를 처리할 수 있는데, 이런 명령어로는, 예컨대 고속 인터페이스 에 접속된 디스플레이처럼 외부 입력, 출력 장치상에 GUI(Graphic User Interface)를 제공하기 위한 그래픽 정 보를 표시하기 위해 메모리나 저장 장치에 저장된 명령어를 들 수 있다. 다른 실시예로서, 다수의 프로세서 및 (또는) 다수의 버스가 적절히 다수의 메모리 및 메모리 형태와 함께 이용될 수 있다. 또한 프로세서는 독립적인 다수의 아날로그 및(또는) 디지털 프로세서를 포함하는 칩들이 이루는 칩셋으로 구현될 수 있다. 또한 메모리는 컴퓨팅 장치 내에서 정보를 저장한다. 일례로, 메모리는 휘발성 메모리 유닛 또는 그들의 집합으 로 구성될 수 있다. 다른 예로, 메모리는 비휘발성 메모리 유닛 또는 그들의 집합으로 구성될 수 있다. 또한 메 모리는 예컨대, 자기 혹은 광 디스크와 같이 다른 형태의 컴퓨터 판독 가능한 매체일 수도 있다. 그리고 저장장치는 컴퓨팅 장치에게 대용량의 저장공간을 제공할 수 있다. 저장 장치는 컴퓨터 판독 가능한 매 체이거나 이런 매체를 포함하는 구성일 수 있으며, 예를 들어 SAN(Storage Area Network) 내의 장치들이나 다른 구성도 포함할 수 있고, 플로피 디스크 장치, 하드 디스크 장치, 광 디스크 장치, 혹은 테이프 장치, 플래시 메 모리, 그와 유사한 다른 반도체 메모리 장치 혹은 장치 어레이일 수 있다."}
{"patent_id": "10-2023-0140598", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상술된 실시예들은 예시를 위한 것이며, 상술된 실시예들이 속하는 기술분야의 통상의 지식을 가진 자는 상술된 실시예들이 갖는 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하 다는 것을 이해할 수 있을 것이다. 그러므로 상술된 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마 찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 명세서를 통해 보호받고자 하는 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지 며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태를 포함하 는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0140598", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 바이어 매칭 장치와 사용자 단말의 네트워크 구성을 도시한 구성도이다. 도 2는 일 실시예에 따른 바이어 매칭 장치의 기능을 설명하기 위한 블록도이다. 도 3 및 도 4는 일 실시예에 따른 바이어 매칭 방법을 설명하기 위한 순서도이다."}
