{"patent_id": "10-2023-0140162", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0056435", "출원번호": "10-2023-0140162", "발명의 명칭": "차량의 연락정보 제공시스템 및 방법", "출원인": "현대자동차주식회사", "발명자": "조동철"}}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량의 외부에서 인식가능하도록 차량에 배치되는 디스플레이;상기 디스플레이에 표시되는 정보를 선택하도록 구성되는 조작부; 상기 차량의 외부를 촬영하도록 구성되는 카메라; 및 상기 디스플레이, 조작부 및 카메라와 통신하도록 구성되는 제어기를 포함하고, 상기 제어기는, 상기 조작부의 선택에 기초하여 선택된 정보를 상기 디스플레이에 출력 정보로 표시하고, 상기 카메라에 의해 촬영된 촬영 정보에 기반하여 기 설정된 인식 조건이 만족되는 경우 상기 출력 정보를 디스플레이에 출력하도록 구성되는 것인 차량의 연락정보 제공 시스템."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 디스플레이는 Always on Display (AOD)인 것인 시스템."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 조작부는 상기 디스플레이와 통신가능하게 구성되는 차량의 Audio, Video, Navigation(AVN) 시스템 또는 상기 AVN 시스템과 통신가능하게 구성되는 제1 이동통신기기인 것인 시스템."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 출력 정보는 차량의 운전자의 연락정보를 포함하고, 상기 연락정보는, 상기 차량의 운전자의 연락정보와 연결가능한 가상의 안심번호 또는 QR(Quick Response) 코드 형태로 출력되는 것인 시스템."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 출력 정보는 본인 인증 요청 링크를 포함하고, 상기 제어기는 상기 본인 인증 요청 링크에 제2 이동통신기기에 의한 접속이 요청되면, 상기 제2 이동통신기기에 본인 인증 페이지가 표시되도록 구성되는 것인 시스템."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 제2 이동통신기기에서 상기 본인 인증 페이지를 통해 본인 인증이 완료된 경우, 상기 제어기는 상기 제2이동통신기기로 하여금 상기 출력 정보 중 운전자의 연락정보에 접근가능하게 하는 것인 시스템."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 상기 연락정보에 연결되어 표시되는 상기 제2 이동통신기기의 식별 번호는 가상의 안심번호인 것인 시스템."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 상기 인식 조건은 기 설정된 시간의 경과 또는 상기 카메라에 촬영되는 사람의 인식이 가능한 경우인 것인 시스템."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2025-0056435-3-청구항 1에 있어서, 상기 제어기는 상기 차량이 주차된 시점으로부터 경과한 시간을 측정하도록 구성되는 타이머를 포함하고, 상기제어기는 상기 타이머에 의해 측정된 시간이 기 설정된 시간을 경과하면 상기 출력 정보를 변경하는 것인 시스템."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "조작부에 의해 차량 외부를 향하도록 상기 차량에 구비되는 디스플레이에 표시될 출력 정보가 선택되는 단계;및상기 조작부 및 상기 디스플레이와 통신하도록 구성되는 제어기에 의해 상기 출력 정보가 표시되는 단계를 포함하고, 상기 출력 정보가 표시되는 단계는, 상기 차량의 외부를 촬영하도록 구성되는 카메라에 의해 촬영된 촬영 정보에 기초하여 상기 제어기에 의해 기설정된 인식 조건이 만족되는지 판단되는 단계; 및 상기 인식 조건이 만족된 것으로 판단되면, 상기 제어기에 의해 상기 출력 정보가 표시되는 단계를 포함하는 것인 차량의 연락정보 제공 방법."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서, 상기 조작부는 상기 디스플레이와 통신가능하게 구성되는 차량의 Audio, Video,Navigation (AVN) 시스템 또는 상기 AVN 시스템과 통신가능하게 구성되는 제1 이동통신기기인 것인 방법."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서, 상기 출력 정보는 차량의 운전자의 연락정보를 포함하고, 상기 연락정보는, 상기 차량의운전자의 연락정보와 연결가능한 가상의 안심번호 또는 QR(Quick Response) 코드 형태로 출력되는 것인 방법."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 10에 있어서, 상기 제어기에 의해 본인 인증 요청 링크를 상기 출력 정보로 표시하는 단계를 더 포함하는 것인 방법."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서, 상기 본인 인증 요청 링크에 접속하는 제2 이동통신기기에서 본인 인증이 완료된 경우, 상기 제어기에 의해 상기 차량의 연락 정보를 출력 정보로 상기 디스플레이에 표시하는 단계를 더 포함하는 것인 방법."}
{"patent_id": "10-2023-0140162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 13에 있어서, 상기 제어기에 의해 상기 차량이 주차가 시작된 시점으로부터 경과된 시간이 수집되는 단계; 및상기 경과된 시간이 기 설정된 시간을 초과하는 것으로 판단되면 상기 제어기에 의해 상기 출력 정보를 자동으로 변경하는 단계를 더 포함하는 것인 방법."}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 차량의 연락정보 제공시스템 및 방법에 관한 것으로, 특히, 주차 중 차주의 연락정보를 표시하는 기술 에 관한 것이다. 본 발명의 일부 실시형태에 따르면, 차량의 연락정보 제공시스템은 상기 차량의 외부에서 인식 가능하도록 차량에 배치되는 디스플레이, 상기 디스플레이에 표시되는 정보를 선택하도록 구성되는 조작부, 상기 차량의 외부를 촬영하도록 구성되는 카메라 및 상기 디스플레이, 조작부 및 카메라와 통신하도록 구성되는 제어 기를 포함하고, 상기 제어기는, 상기 조작부의 선택에 기초하여 선택된 정보를 상기 디스플레이에 출력 정보로 표시하고, 상기 카메라에 의해 촬영된 촬영 정보에 기반하여 기 설정된 인식 조건이 만족되는 경우 상기 출력 정 보를 디스플레이에 출력하도록 구성된다."}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량의 연락정보 제공시스템 및 방법에 관한 것으로, 특히, 주차 중 차주의 연락정보를 표시하는 기 술에 관한 것이다."}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "차량의 운전자는 차량 내 본인의 연락처 정보가 기재된 표시판을 비치하기도 한다. 주차 공간이 협소하여 이중 주차를 한 경우나 사고 등 긴급 상황 등의 경우, 운전자와 연락이 필요한 일이 생길 수 있기 때문이다. 다만, 운전자의 휴대전화 등의 개인 정보가 외부로 상시 노출되므로 개인정보가 악용될 수 있고, 운전자는 그에 따른 피해를 받을 수 있다. 물론 운전자에게 연락을 취하는 상대방의 전화번호도 발신자 번호 표시에 따라 그대 로 운전자에게 노출되므로 양 자의 개인정보가 침해될 수 있다. 이에 최근에는 운전자의 전화번호를 직접 표시하지 않고, 운전자의 전화와 연결될 수 있는 일회성이며 가상의 안심번호나 QR(quick-response code) 코드 등이 차량 내에 구비되기도 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-2458958호 (등록일자: 2022.10.20)"}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위하여 안출된 것으로서, 운전자 및 운전자에게 전화를 거는 상대방의 개인정보를 보호할 수 있는 차량의 연락정보 제공시스템 및 방법을 제공하고자 한다. 차량 내 운전자의 연락처를 표시함에 있어 편의성이 증대된 차량의 연락정보 제공시스템 및 방법을 제공하고자 한다. 특히, 쉐어링 카에서 유용성 및 안전성을 제공하는 차량의 연락정보 제공시스템 및 방법을 제공하고자 한다. 본 발명의 목적은 이상에서 언급된 목적으로 제한되지 않으며, 언급되지 않은 다른 목적들은 아래의 기재로부터"}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "본 발명이 속하는 기술분야에서 통상의 지식을 지닌 자(이하 '통상의 기술자')에게 명확하게 이해될 수 있을 것 이다."}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 본 발명의 목적을 달성하고, 후술하는 본 발명의 특징적인 기능을 수행하기 위한, 본 발명의 특징은 다음과 같다. 본 발명의 일부 실시형태에 따르면, 차량의 연락정보 제공시스템은 상기 차량의 외부에서 인식가능하도록 차량 에 배치되는 디스플레이, 상기 디스플레이에 표시되는 정보를 선택하도록 구성되는 조작부, 상기 차량의 외부를 촬영하도록 구성되는 카메라 및 상기 디스플레이, 조작부 및 카메라와 통신하도록 구성되는 제어기를 포함하고, 상기 제어기는, 상기 조작부의 선택에 기초하여 선택된 정보를 상기 디스플레이에 출력 정보로 표시하고, 상기 카메라에 의해 촬영된 촬영 정보에 기반하여 기 설정된 인식 조건이 만족되는 경우 상기 출력 정보를 디스플레 이에 출력하도록 구성된다. 본 발명의 일부 실시형태에 따르면, 차량의 연락정보 제공 방법은, 조작부에 의해 차량 외부를 향하도록 상기 차량에 구비되는 디스플레이에 표시될 출력 정보가 선택되는 단계; 및 상기 조작부 및 상기 디스플레이와 통신 하도록 구성되는 제어기에 의해 상기 출력 정보가 표시되는 단계를 포함하고, 상기 출력 정보가 표시되는 단계 는, 상기 차량의 외부를 촬영하도록 구성되는 카메라에 의해 촬영된 촬영 정보에 기초하여 상기 제어기에 의해 기 설정된 인식 조건이 만족되는지 판단되는 단계; 및 상기 인식 조건이 만족된 것으로 판단되면, 상기 제어기 에 의해 상기 출력 정보가 표시되는 단계를 포함한다."}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 운전자 및 운전자에게 전화를 거는 상대방의 개인정보를 보호할 수 있는 차량의 연락정보 제 공시스템 및 방법이 제공된다. 본 발명에 따르면, 차량 내 운전자의 연락처를 표시함에 있어 편의성이 증대된 차량의 연락정보 제공시스템 및 방법이 제공된다. 본 발명에 따르면, 특히, 쉐어링 카에서 유용성 및 안전성을 제공하는 차량의 연락정보 제공시스템 및 방법이 제공된다."}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 전술한 것으로 제한되지 않으며, 언급되지 않은 다른 효과들은 아래의 기재로부터 통상의 기 술자에게 명확하게 인식될 수 있을 것이다."}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "발명의 실시예에서 제시되는 특정한 구조 내지 기능적 설명들은 단지 본 발명의 개념에 따른 실시예를 설명하기 위한 목적으로 예시된 것으로, 본 발명의 개념에 따른 실시예들은 다양한 형태로 실시될 수 있다. 또한 본 명세 서에 설명된 실시예들에 한정되는 것으로 해석되어서는 아니 되며, 본 발명의 사상 및 기술 범위에 포함되는 모 든 변경물, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 한편, 본 발명에서 제1 및/또는 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구 성 요소들은 상기 용어들에 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소들과 구별하는 목적으로만, 예컨대 본 발명의 개념에 따른 권리 범위로부터 벗어나지 않는 범위 내에서, 제1구성요소는 제2구 성요소로 명명될 수 있고, 유사하게 제2구성요소는 제1구성요소로도 명명될 수 있다. 어떠한 구성요소가 다른 구성요소에 \"연결되어\"있다거나 \"접속되어\"있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어 야 할 것이다. 반면에, 어떠한 구성요소가 다른 구성요소에 \"직접 연결되어\"있다거나 또는 \"직접 접촉되어\"있다 고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성요소들 간의 관계 를 설명하기 위한 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 인접하는\"과 \"~에 직접 인접하는\"등 의 표현도 마찬가지로 해석되어야 한다. 명세서 전체에 걸쳐서 동일한 참조번호들은 동일한 구성요소들을 나타낸다. 한편, 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급되지 않는 한 복수형도 포함된다. 명세서에서 사용되는 \"포함한다(comprises)\" 및/또는 \"포함하는 (comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자가 하나 이상의 다른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 이하에서는 첨부된 도면을 참조하여 본 발명에 대해 상세히 설명한다. 도 1에 도시된 바와 같이, 본 발명에 따른 차량의 연락정보 제공시스템은 디스플레이, 조작부 및 제 어기를 포함한다. 디스플레이는 차량의 운전자가 표시하고자 하는 정보를 표시하도록 구성된다. 일부 구현예에서, 디스플레이에는 운전자에 의해 선택되는 스킨이 표시될 수 있다. 일부 구현예에서, 디스플레이 에 표시되는 스킨은 시큐리티 인디케이터 역할을 하도록 빨강색 바탕의 화면을 기 설정된 시간, 예를 들어, 1초만큼 표시하고, 디스플레이를 기 설정된 시간, 예를 들어, 30초 동안 끄는 스킨일 수 있다. 일부 구현예 에서는, 디스플레이에는 운전자에 의해 선택되는 휴대전화번호와 같은 연락처가 표시될 수 있다. 일부 구현 예에서, 디스플레이에는 운전자의 휴대전화와 연결할 수 있는 QR 코드가 표시될 수도 있다. 일부 구현예에 서는, 이들 중 임의의 조합이 디스플레이에 표시될 수 있다. 이를 위해, 디스플레이는 차량 외부에서 인식될 수 있도록 차량 내 설치될 수 있다. 디스플레이는 차량 의 외부를 향하도록 차량 내에 배치될 수 있고, 예를 들어, 크래시 패드 상에 설치될 수 있다. 디스플레이는 AOD(always on display)일 수 있다. AOD에서는 디스플레이의 스크린이 오프상태일 때에도 일정 정보가 디스플레이에 표시될 수 있다. 또한, 디스플레이는 설정에 따라 상시 또는 간헐적으로 화 면을 출력하도록 구성될 수도 있다. 일 구현예에서, 디스플레이의 크기는 주어진 조건에 따라 선택될 수 있다. 디스플레이의 크기가 증가하면 디스플레이에 전력을 공급하는 배터리의 수명이 줄어드므로 약 1.5 내지 2 인치 범위가 적합할 수 있다. 디스플레이에는 전원에 의해 전력이 공급될 수 있다. 예를 들어, 전원은 디스플레이의 작동을 위한 별개의 전원일 수 있다. 또한, 전원은 차량의 보조배터리로부터 충전가능한 배터리일 수 있다. 조작부는 디스플레이와 통신가능하게 구성되어 운전자가 디스플레이에 표시될 정보를 선택할 수 있 는 인터페이스 역할을 수행한다. 예를 들어, 조작부는 차량의 오디오, 비디오, 내비게이션(AVN) 시스템(4 2)일 수 있다. 일부 구현예에서, 조작부는 이동통신기기일 수 있다. 이동통신기기는 차량의 AVN 시 스템과 통신가능한 스마트폰과 같은 전자기기일 수 있다. 조작부를 통해 디스플레이에 출력될 스킨, 전화번호 또는 QR 코드 등이 편집되고 선택될 수 있다. 일부 구현예에서, 조작부는 AVN 시스템 및 이동통신기기를 모두 포함할 수 있다. AVN 시스템과 이동통신기기는 설정된 네트워크에 의해 통신가능하게 구성된다. 예를 들어, AVN 시스템 또는 이동 통신기기에서 선택되는 출력 정보가 디스플레이에 표시될 수 있다. 일부 구현예에서, 이동통신기기(4 4)에는 디스플레이의 제어를 위한 애플리케이션이 설치될 수도 있다. 또한, 상기 애플리케이션은 각 차량의 AVN 시스템을 제어할 수 있도록 구성되는 애플리케이션일 수 있다. 제어기는 디스플레이 및 조작부와 통신할 수 있다. 제어기는 조작부에 의해 입력되는 정보 를 처리하여 디스플레이에 표시될 정보를 표시할 수 있다. 또한, 제어기는 디스플레이에 전력을 공 급하는 전원의 작동을 제어할 수 있다. 제어기는 디스플레이, 조작부, 카메라에 의한 정보 를 수집, 처리 및 저장할 수 있는 프로세서 및 메모리를 포함한다. 여기에서 제어기는 디스플레이, 조작부를 각각 제어하는 별개의 제어기로 마련될 수도 있고, 이들 을 통합적으로 제어하는 통합 제어기일 수도 있다. 제어기는, 또한, 차량과 통신할 수 있다. 예를 들어, 제어기는 CAN(Controller Area Network)을 통해 차량 내 구성요소들과 통신할 수 있다. 제어기는 이에 의해 차량의 주차 상태 여부를 확인할 수 있다. 제어기는 타이머를 포함할 수 있다. 타이머는 시간을 측정할 수 있다. 예를 들어, 디스플레이 에 표시되는 출력 정보는 차량 주차 후 경과된 시간에 기초하여 자동으로 변경될 수 있다. 이때 타이머는 CAN 신호를 통해 주차의 시작 시점부터 경과된 시간을 측정할 수 있다. 본 발명의 일부 구현예에 따르면, 차량의 연락정보 제공시스템은 카메라를 포함할 수 있다. 카메라 는 차량 내 구비되는 빌트인 캠일 수 있다. 빌트인 캠은 차량 주행 중 또는 주차 중 영상을 녹화하기 위해 차량 내 설치되는 빌트인 카메라일 수 있다. 일부 구현예에서, 카메라는 차량에 구비되고 제어기와 통신하도 록 구성되는 차량으로부터 탈부착가능한 카메라일 수 있다. 카메라는 차량의 외부를 촬영하도록 구성된다. 예를 들어, 카메라는 디스플레이에 표시되는 정보를 획득하기 위하여 접근한 사람의 얼굴을 인식할 수 있다. 본 발명에 의하면, 카메라에 의해 사람의 얼굴이 어느 정도 인식된 경우, 사람이 일정 시간 감지되는 경우에만 디스플레이에 운전자의 연락 정보 또는 운전 자에 의해 선택되는 출력 정보를 표시할 수 있다. 이는 차량의 운전자의 개인 정보가 악용될 경우를 방지하여 안전을 향상시킬 수 있다. 예를 들어, 인공지능 딥러닝 학습에 의해 제어기는 카메라에 의해 획득된 영 상에 기반하여 폭력적인 물건을 들고 있는 등 위험한 상황이 초래될 수 있는 경우로 판단하면, 디스플레이 에 연락처 정보를 표시하지 않을 수 있다. 카메라는 제어기와는 별개의 카메라를 위한 카메라 제어기를 포함할 수 있다. 이 경우, 제어기(6 0)는 카메라 제어기와 통신가능하게 구성되어 요청을 송신할 수 있다. 일부 구현예에서, 제어기에는 카메라 제어기가 통합되어 제어기에 의해 직접 카메라가 제어될 수도 있다. 본 발명에 의한 제공시스템에 의해 다양한 제어가 가능할 수 있다. 도 2에 도시된 바와 같이, 연락 정보 제공시스템의 작동은 차량의 AVN 시스템에 의해 시작될 수 있다. 운전자가 AVN 시스템을 통해 연락정보 제공을 활성화할 수 있다(S200). 일부 구현예에서, 이동통신기기(4 4)를 통해 연락정보 제공이 활성화될 수 있다(S240). 단계 S210에서 AVN 시스템 또는 이동통신기기 내 애플리케이션에서 디스플레이의 활성화 여부가 선택될 수 있다. 활성화가 선택되면 디스플레이는 작동 할 수 있는 상태에 놓이고(S220), 활성화가 선택되지 않으면 디스플레이는 주차 중 미작동할 수 있다(S230). 일부 구현예에서, 차량의 AVN 시스템을 조작부로 하여 디스플레이에 연락처 정보를 표시하는 경우 에는, 주행 또는 정차 상태에서 차량의 AVN 시스템에서 디스플레이에 출력될 출력 정보를 입력하거나 스킨이 선택될 수 있다. 예를 들어, 출력될 정보는 차량 운전자의 전화번호 또는 이를 나타내는 가상의 안심번 호, 전화번호를 나타내는 QR 코드, '잠시 주차중입니다' 등의 문자 메시지일 수 있다. 도 3에 도시된 바와 같이, 일부 구현예에서, 차량의 제어기 또는 AVN 시스템과 통신하도록 구성되는 이 동통신기기에 의한 조작의 경우에는, 차량이 정차 또는 주차된 상태에서 운전자의 이동통신기기(예를 들어, 애플리케이션을 통해)에서 디스플레이에 출력될 정보 또는 스킨이 선택될 수 있다(S300). 선택된 출 력될 정보는 네트워크를 통해 AVN 시스템을 거쳐 제어기에 전달될 수 있(S310, S320)고, 제어기 는 이에 기초하여 디스플레이에 표시될 정보를 출력할 수 있다(S300). 일부 구현예에서, 제공시스템에 의한 작동은 이하의 경우를 포함할 수 있다. 도 4에 도시된 바와 같이, 본 발명에 의한 차량의 연락정보 제공시스템은 차량의 운전자와 연락하고자 하는 상대방의 본인 인증이 완료된 경우에 운전자와 연락이 가능하게 할 수 있다. 단계 S400에서, AVN 시스템 또는 이동통신기기에 의해 차량의 연락정보 제공이 활성화되어 있는 상태이 다. 이 동안 카메라는 차량 주위를 촬영할 수 있고, 촬영 정보를 제어기에 전달할 수 있다. 제어기(6 0)는 전달된 촬영 정보에 기초하여 인식 조건이 만족되는지 판단한다(S410). 예를 들어, 제어기는 상대방이 차량에 접근하여 일정 시간 머무는 경우에는 인식 조건을 만족한 것으로 판단할 수 있다. 또한, 제어기는 상대방의 얼굴이 일정 범위 인식되는 경우에 인식 조건을 만족한 것으로 판단할 수 있다. 인식 조건이 만족되지 않는 경우, 제어기는 디스플레이의 출력을 금지할 수 있다. 인식 조건이 만족된 것으로 판단되면, 제어 기는 디스플레이를 활성화하여 안심화면 링크를 표시한다(S420). 상대방이 안심화면 링크를 통해 자신 의 이동통신기기를 통해 인증 페이지로 접속하면, 본인 인증이 요청된다(S430). 여기에서 인증 페이지는 상대방 의 이동통신기기에 설치되는 애플리케이션에 표시될 수 있다. 여기에서 운전자의 이동통신기기에 설치되는 애플 리케이션과 상대방의 이동통신기기에 설치되는 애플리케이션은 동일한 것일 수 있고, 이들은 알려진 통신망에 의해 서로 통신할 수 있다. 일부 구현예에서, 인증 페이지는 웹페이질 수도 있다. 상대방이 소정의 본인 인증을 완료하면(S440)하면 상대방에게 운전자의 연락처정보가 상기 애플리케이션 또는 문자 메시지 등을 통해 제공되 고, 운전자와 연락 가능한 상태에 놓인다(S450). 운전자의 연락처 정보는 운전자의 스마트폰 등과 연결될 수 있 는 가상의 전화번호일 수 있다. 또한, 상대방은 운전자에게 문자 메시지 등을 송신할 수도 있다. 추가적으로, 상대방의 전화번호는 안심번호로 전환되어 운전자의 휴대전화 등에 표시될 수 있다. 차량의 운전자는 이동통신 기기의 애플리케이션을 통해 푸쉬 메시지, 전화 등을 수신할 수 있다. 이러한 메시지, 전화 연결 기록은 일 정 기간 저장되게 구성될 수도 있다. 본 발명의 일부 구현예에 따르면, 도 5에 도시된 바와 같이, 디스플레이에 표시되는 출력 정보는 일정 시간 마다 자동으로 변경될 수 있다. 단계 S500에서 본 발명에 따른 차량의 연락정보 제공시스템은 활성화된 상태이다. 제어기는 타이머 로부터 차량의 주차 시작 후 경과된 시간을 입력받는다. 제어기는 경과된 시간이 기 설정된 시간인지 판단 하도록 구성된다(S510). 주차 후 기 설정된 시간이 경과된 것으로 판단되면 제어기는 자동으로 디스플레이 의 출력 정보를 변경한다(S520). 예를 들어, 출력 정보가 운전자의 연락처를 나타내는 안심번호인 경우, 안 심번호는 다른 안심번호로 변경된다. 다른 예로서, 출력 정보가 운전자의 연락처를 나타내는 QR 코드인 경우, QR 코드는 다른 QR 코드로 변경된다. 또한, 운전자가 미리 변경될 화면을 설정한 경우라면, 제어기는 해당 화면으로 디스플레이의 출력 정보를 변경할 수도 있다. 화면이 변경된 후, 제어기는 타이머를 초기 화하여 화면이 변경된 시간부터 시간이 측정되도록 한다(S530). 이때부터 기 설정된 시간이 경과된 경우에는 제 어기는 또한 자동으로 화면을 변경할 수 있다. 일부 구현예에서, 자동 화면 변경 시 단기 주차 상태 등과 같은 경우 디스플레이가 차량의 보조배터리와 연 결되어 있는 경우라면 디스플레이는 항시 켜질 수 있고, 제어기에 의해 기 설정된 시간마다 안심번호 또는 QR 코드 등이 자동으로 변경될 수 있다. 일부 구현예에서, 자동 화면 변경 시 차량이 장기 주차 상태의 경 우라면 제어기는 최종적으로 저장된 안심번호, QR 코드 등을 정해진 조건에서 온/오프하여 출력할 수 있다. 일부 구현예에서, 자동 화면 변경 시, 차량의 시동이 걸려 차량 보조배터리에 의해 디스플레이를 위한 전원 이 충전되면 제어기는 다시 자동으로 화면을 변경할 수 있다. 종래 배터리 또는 태양광에 의한 충전에 의해 작동하는 전화번호 표시판의 경우, 사용자가 한번 설정된 번호를 그때그때 바꾸기 어렵다. 다만, 본 발명은 디스플레이를 포함하여, 차량, 심지어 렌탈차량 등의 쉐어링 카에서 도 표시될 전화번호를 바로 변경하여 노출할 수 있다. 또한, 본 발명에 의하면, 디스플레이의 온/오프가 제어될 수 있으므로 디스플레이를 위한 배터리의 수명이 증가 될 수 있다. 본 발명에 따르면, 차량 운전자의 연락처를 알고자 하는 상대방의 얼굴이 일정 범위 인식된 경우에만 연락처가 노출되므로 안전성이 향상된다. 본 발명에 의하면, 차량 외부로 노출되는 안심번호도 주기적으로 자동 변경 가능하므로 안전성이 향상될 수 있 다. 이상에서 설명한 본 발명은 전술한 실시예 및 첨부된 도면에 의해 한정되는 것이 아니고, 본 발명의 기술적 사"}
{"patent_id": "10-2023-0140162", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상을 벗어나지 않는 범위 내에서 여러 가지 치환, 변형 및 변경이 가능함은 본 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에게 명백할 것이다."}
{"patent_id": "10-2023-0140162", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 차량의 연락정보 제공시스템의 구성도이고, 도 2 내지 5는 본 발명의 다양한 실시예에 따른 차량의 연락정보 제공방법의 흐름도를 도시한다."}
