{"patent_id": "10-2023-0008257", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0166871", "출원번호": "10-2023-0008257", "발명의 명칭": "인공지능을 이용한 특허명세서 작성 방법 및 장치", "출원인": "이지현", "발명자": "이지현"}}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "특허명세서 작성 장치에 의해 수행되는 방법에 있어서, 청구항 내용을 포함하는 입력값을 복수의 제1 인공지능 모델로 분산 입력시키는 단계; 및상기 복수의 제1 인공지능 모델에서 상기 입력값을 기초로 출력값을 생성하는 단계;를 포함하고,상기 복수의 제1 인공지능 모델은, 특허명세서의 식별항목에 따라 구분되어 학습된 개별 인공지능 모델을 포함하고,상기 개별 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학습 데이터로 학습된,특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 제1 인공지능 모델은,상기 청구항의 내용을 포함하는 상기 소스 데이터 데이터를 수신하는 단계;상기 소스 데이터를 식별항목별 작성 기준에 따라 학습 처리하는 단계; 및상기 소스 데이터에 매칭된 식별항목별 타겟 데이터를 출력하도록 학습하는 단계;를 포함하여 생성되며,상기 소스 데이터는, 청구항 각 구성요소로 구성된 문장, 청구항의 한 줄로 구분되어 구성된 한 문장, 청구항내 의미 단위로 분절된 한 문장, 또는 하나의 청구항 내 전체 문장을 포함하는,특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 식별항목은,기술분야, 발명의 배경이 되는 기술, 해결하고자 하는 과제, 과제의 해결 수단, 발명의 효과, 도면의 간단한 설명, 발명을 실시하기 위한 구체적인 내용, 부호의 설명 및 요약서 중 적어도 하나 이상을 포함하고,상기 식별항목별 작성 기준은,상기 식별항목별 작성규칙, 목적, 금지어, 제안어 및 최대 토큰 수에 기초한 문장 숫자 중 적어도 하나 이상을포함하는,특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제1 인공지능 모델은,공개특허 10-2023-0166871-3-상기 소스 데이터에 따라 상기 타겟 데이터가 상기 소스 데이터와 상기 타겟 데이터의 조합을 기초로 출력되도록 하고,상기 소스 데이터와 상기 타겟 데이터의 조합은, 상기 식별항목별로 상기 소스 데이터의 문장의 수를 기준으로일대일(1:1), 일대다수(1:N), 다수대일(M:1) 및 다수대다수(M:N) 중 적어도 어느 하나인,특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,제2 인공지능 모델에서 도면용 입력값을 기초로 출력값인 도면을 생성하는 단계;를 더 포함하고,상기 제2 인공지능 모델은,특허명세서 내용으로부터 도면 부호 또는 도면 참조 내용을 삭제하는 전처리를 수행하는 단계;전처리된 도면용 소스 데이터를 수신하는 단계; 및상기 도면용 소스 데이터를 텍스트 투 이미지 생성을 수행하는 인공지능 모델에 입력하여 이미지 형태의 도면을도면용 타겟 데이터로 출력하도록 학습하는 단계;를 포함하여 생성되는, 특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 복수의 제1 인공지능 모델은,상기 소스 데이터를 상기 청구항의 내용 및 복수의 식별항목의 내용을 조합하여 구성하고,상기 복수의 식별항목은, 해결하고자 하는 과제 및 발명의 효과를 포함하는, 특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 복수의 제1 인공지능 모델은,상기 소스 데이터를 상기 타겟 데이터의 문장, 상기 타겟 데이터의 문단 및 상기 타겟 데이터의 전체 내용 중적어도 하나 이상을 포함하여 구성하는,특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 복수의 제1 인공지능 모델은,상기 청구항의 내용에서 구성요소를 분리하는 단계;상기 구성요소를 포함하는 명세서 단락번호를 분리하는 단계;상기 구성요소와 상기 명세서 단락번호의 단락 내용을 학습데이터 쌍으로 그룹 형성하는 단계; 및공개특허 10-2023-0166871-4-제1 인공지능 모델을 상기 구성요소의 개수에 대응되도록 생성하여 학습하는 단계;를 포함하여 상기 학습 데이터를 구성하는,특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,사용자의 조작, 또는 기 설정된 검수기준에 따라 상기 특허명세서의 내용을 체크 및 수정하는 단계;를 더 포함하고,상기 기 설정된 검수기준은,청구항 순서, 독립항 및 종속항 여부, 종속항의 인용항 기준, 청구항 번호 부여 규칙, 특허법 기준 작성규칙,맞춤법 및 문법 검사를 포함하는,특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "컴퓨터와 결합되어, 제1항 내지 제9항 중 어느 한 항의 특허명세서 작성 방법을 실행시키기 위하여 컴퓨터 판독가능한 기록매체에 저장된 프로그램."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "인공지능 모델 생성부;작성부; 및검증 및 편집부의 동작을 제어하는 프로세서;를 포함하고,상기 프로세서는,청구항 내용을 포함하는 입력값을 복수의 제1 인공지능 모델로 분산 입력시키고, 및상기 복수의 제1 인공지능 모델에서 상기 입력값을 기초로 출력값을 생성하는 것을 포함하며,상기 복수의 제1 인공지능 모델은, 특허명세서의 식별항목에 따라 구분되어 학습된 개별 인공지능 모델을 포함하고, 및상기 개별 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학습 데이터로 학습된,특허명세서 작성 장치."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 프로세서는,상기 복수의 제1 인공지능 모델은,상기 청구항의 내용을 포함하는 상기 소스 데이터를 수신하고,상기 소스 데이터를 식별항목별 작성 기준에 따라 학습 처리하고, 및상기 소스 데이터에 매칭된 식별항목별 타겟 데이터를 출력하도록 학습하는 것을 포함하여 생성되며,공개특허 10-2023-0166871-5-상기 소스 데이터는, 청구항 각 구성요소로 구성된 문장, 청구항의 한 줄로 구분되어 구성된 한 문장, 청구항내 의미 단위로 분절된 한 문장, 또는 하나의 청구항 내 전체 문장을 포함하는,특허명세서 작성 장치."}
{"patent_id": "10-2023-0008257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "특허명세서 작성 장치에 의해 수행되는 방법에 있어서, 청구항 내용을 포함하는 입력값을 제3 인공지능 모델로 입력시키는 단계; 및상기 제3 인공지능 모델에서 상기 입력값을 기초로 출력값을 생성하는 단계;를 포함하고,상기 제3 인공지능 모델은, 하나의 모델에서 특허명세서의 복수의 식별항목에 따라 구분되어 학습되되, 상기 복수의 식별항목의 기 설정된 순서에 따라 학습된 통합 인공지능 모델을 포함하고,상기 통합 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스 데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학습 데이터로 학습되며,상기 소스 데이터에 따라 상기 타겟 데이터가 상기 소스 데이터와 상기 타겟 데이터의 조합을 기초로 출력되도록 하고,상기 소스 데이터와 상기 타겟 데이터의 조합은, 상기 식별항목별로 상기 소스 데이터의 문장의 수를 기준으로일대일(1:1), 일대다수(1:N), 다수대일(M:1) 및 다수대다수(M:N) 중 적어도 어느 하나인,특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능을 이용한 특허명세서 작성 방법 및 장치가 개시된다. 본 발명의 일 실시예에 따른 특허명세서 작성 방 법은 청구항의 내용을 포함하는 청구항 내용을 포함하는 입력값을 수신하면, 이를 복수의 제1 인공지능 모델로 분산 입력시키는 단계; 및 복수의 제1 인공지능 모델에서 식별항목별 학습 처리를 수행하여 특허명세서를 생성하 는 단계;를 포함한다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": ", 발명의 배경이 되는 기술, 해결하고자 하는 과제,"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "특허명세서는 보호받고자 하는 권리범위 및 이를 뒷받침하는 기술내용을 기재하는 것으로, 올바른 권리범위를 보호받기 위해서는 특허명세서의 작성이 중요하다. 상술한 특허명세서는 특허의 권리범위를 결정하는 청구항을 중심으로 다수의 식별항목을 포함하여 구성될 수 있 다. 출원인의 발명 의도와 특허명세서가 다르게 작성되는 경우, 보호받고자 하는 권리범위를 확보하지 못할 수 있기 때문에, 특허 전문가가 발명자를 대리하여 특허명세서를 작성할 수 있다. 한편, 특허명세서를 작성하는 모든 과정이 사용자의 수기로 이루어지기 때문에, 사용자의 업무 스케쥴 등의 환 경적 요인으로 인해 특허명세서 작성에 병목 및 지연 현상이 발생할 수 있다. 이에, 운용자는 특허명세서 작성을 보다 효율적으로 수행하기 위해 다양한 방안을 모색하고 있는 실정이다. 선행기술문헌 특허문헌(특허문헌 0001) 대한민국 공개특허공보 제10-2020-0070506호 (2020. 06. 18.)"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에 개시된 실시예는 특허명세서의 작성 과정 중 일부를 인공지능 모델을 이용하여 자동으로 수행할 수 있도록 하기 위한 인공지능을 이용한 특허명세서 작성 방법 및 장치를 제공하는데 그 목적이 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": ","}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": ", 도면의 간단한 설 명,"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": ", 부호의 설명 및 요약서 중 적어도 하나 이상을 포함하고, 상기 식별항목별 작성 기준은, 상기 식별항목별 작성규칙, 목적, 금지어, 제안어 및 최대 토큰 수에 기초한 문장 숫자 중 적어도 하나 이상을 포함하는, 특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "청구항 4 제3항에 있어서, 상기 제1 인공지능 모델은,상기 소스 데이터에 따라 상기 타겟 데이터가 상기 소스 데이터와 상기 타겟 데이터의 조합을 기초로 출력되도 록 하고, 상기 소스 데이터와 상기 타겟 데이터의 조합은, 상기 식별항목별로 상기 소스 데이터의 문장의 수를 기준으로 일대일(1:1), 일대다수(1:N), 다수대일(M:1) 및 다수대다수(M:N) 중 적어도 어느 하나인, 특허명세서 작성 방법. 청구항 5 제1항에 있어서, 제2 인공지능 모델에서 도면용 입력값을 기초로 출력값인 도면을 생성하는 단계;를 더 포함하고, 상기 제2 인공지능 모델은, 특허명세서 내용으로부터 도면 부호 또는 도면 참조 내용을 삭제하는 전처리를 수행하는 단계; 전처리된 도면용 소스 데이터를 수신하는 단계; 및 상기 도면용 소스 데이터를 텍스트 투 이미지 생성을 수행하는 인공지능 모델에 입력하여 이미지 형태의 도면을 도면용 타겟 데이터로 출력하도록 학습하는 단계;를 포함하여 생성되는, 특허명세서 작성 방법. 청구항 6 제1항에 있어서, 상기 복수의 제1 인공지능 모델은, 상기 소스 데이터를 상기 청구항의 내용 및 복수의 식별항목의 내용을 조합하여 구성하고,"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 복수의 식별항목은, 해결하고자 하는 과제 및 발명의 효과를 포함하는, 특허명세서 작성 방법. 청구항 7 제1항에 있어서, 상기 복수의 제1 인공지능 모델은, 상기 소스 데이터를 상기 타겟 데이터의 문장, 상기 타겟 데이터의 문단 및 상기 타겟 데이터의 전체 내용 중 적어도 하나 이상을 포함하여 구성하는, 특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "청구항 8 제1항에 있어서, 상기 복수의 제1 인공지능 모델은, 상기 청구항의 내용에서 구성요소를 분리하는 단계; 상기 구성요소를 포함하는 명세서 단락번호를 분리하는 단계; 상기 구성요소와 상기 명세서 단락번호의 단락 내용을 학습데이터 쌍으로 그룹 형성하는 단계; 및제1 인공지능 모델을 상기 구성요소의 개수에 대응되도록 생성하여 학습하는 단계;를 포함하여 상기 학습 데이 터를 구성하는, 특허명세서 작성 방법."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "청구항 9 제1항에 있어서, 사용자의 조작, 또는 기 설정된 검수기준에 따라 상기 특허명세서의 내용을 체크 및 수정하는 단계;를 더 포함 하고, 상기 기 설정된 검수기준은, 청구항 순서, 독립항 및 종속항 여부, 종속항의 인용항 기준, 청구항 번호 부여 규칙, 특허법 기준 작성규칙, 맞춤법 및 문법 검사를 포함하는, 특허명세서 작성 방법. 청구항 10 컴퓨터와 결합되어, 제1항 내지 제9항 중 어느 한 항의 특허명세서 작성 방법을 실행시키기 위하여 컴퓨터 판독 가능한 기록매체에 저장된 프로그램. 청구항 11 인공지능 모델 생성부; 작성부; 및 검증 및 편집부의 동작을 제어하는 프로세서;를 포함하고, 상기 프로세서는, 청구항 내용을 포함하는 입력값을 복수의 제1 인공지능 모델로 분산 입력시키고, 및 상기 복수의 제1 인공지능 모델에서 상기 입력값을 기초로 출력값을 생성하는 것을 포함하며, 상기 복수의 제1 인공지능 모델은, 특허명세서의 식별항목에 따라 구분되어 학습된 개별 인공지능 모델을 포함 하고, 및 상기 개별 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스 데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학습 데이터로 학습된, 특허명세서 작성 장치. 청구항 12 제11항에 있어서, 상기 프로세서는, 상기 복수의 제1 인공지능 모델은, 상기 청구항의 내용을 포함하는 상기 소스 데이터를 수신하고, 상기 소스 데이터를 식별항목별 작성 기준에 따라 학습 처리하고, 및 상기 소스 데이터에 매칭된 식별항목별 타겟 데이터를 출력하도록 학습하는 것을 포함하여 생성되며,상기 소스 데이터는, 청구항 각 구성요소로 구성된 문장, 청구항의 한 줄로 구분되어 구성된 한 문장, 청구항 내 의미 단위로 분절된 한 문장, 또는 하나의 청구항 내 전체 문장을 포함하는, 특허명세서 작성 장치. 청구항 13 특허명세서 작성 장치에 의해 수행되는 방법에 있어서, 청구항 내용을 포함하는 입력값을 제3 인공지능 모델로 입력시키는 단계; 및 상기 제3 인공지능 모델에서 상기 입력값을 기초로 출력값을 생성하는 단계;를 포함하고, 상기 제3 인공지능 모델은, 하나의 모델에서 특허명세서의 복수의 식별항목에 따라 구분되어 학습되되, 상기 복 수의 식별항목의 기 설정된 순서에 따라 학습된 통합 인공지능 모델을 포함하고, 상기 통합 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스 데이터와 매칭되는 특허명세 서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학습 데이터로 학습되며, 상기 소스 데이터에 따라 상기 타겟 데이터가 상기 소스 데이터와 상기 타겟 데이터의 조합을 기초로 출력되도 록 하고, 상기 소스 데이터와 상기 타겟 데이터의 조합은, 상기 식별항목별로 상기 소스 데이터의 문장의 수를 기준으로 일대일(1:1), 일대다수(1:N), 다수대일(M:1) 및 다수대다수(M:N) 중 적어도 어느 하나인, 특허명세서 작성 방법. 발명의 설명 기 술 분 야 본 개시는 특허명세서를 자동으로 작성하는 방법에 관한 것이다. 보다 상세하게는, 본 개시는 인공지능을 이용 한 특허명세서 작성 방법 및 장치에 관한 것이다. 배 경 기 술 특허명세서는 보호받고자 하는 권리범위 및 이를 뒷받침하는 기술내용을 기재하는 것으로, 올바른 권리범위를 보호받기 위해서는 특허명세서의 작성이 중요하다. 상술한 특허명세서는 특허의 권리범위를 결정하는 청구항을 중심으로 다수의 식별항목을 포함하여 구성될 수 있 다. 출원인의 발명 의도와 특허명세서가 다르게 작성되는 경우, 보호받고자 하는 권리범위를 확보하지 못할 수 있기 때문에, 특허 전문가가 발명자를 대리하여 특허명세서를 작성할 수 있다. 한편, 특허명세서를 작성하는 모든 과정이 사용자의 수기로 이루어지기 때문에, 사용자의 업무 스케쥴 등의 환 경적 요인으로 인해 특허명세서 작성에 병목 및 지연 현상이 발생할 수 있다. 이에, 운용자는 특허명세서 작성을 보다 효율적으로 수행하기 위해 다양한 방안을 모색하고 있는 실정이다. 선행기술문헌 특허문헌(특허문헌 0001) 대한민국 공개특허공보 제10-2020-0070506호 (2020. 06. 18.)"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "해결하려는 과제 본 개시에 개시된 실시예는 특허명세서의 작성 과정 중 일부를 인공지능 모델을 이용하여 자동으로 수행할 수 있도록 하기 위한 인공지능을 이용한 특허명세서 작성 방법 및 장치를 제공하는데 그 목적이 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "과제의 해결 수단 상술한 기술적 과제를 달성하기 위한 본 개시에 일 측면에 따른 특허명세서 작성 방법은, 특허명세서 작성 장치 에 의해 수행되는 방법에 있어서, 청구항 내용을 포함하는 입력값을 복수의 제1 인공지능 모델로 분산 입력시키 는 단계; 및 상기 복수의 제1 인공지능 모델에서 상기 입력값을 기초로 출력값을 생성하는 단계;를 포함하고, 상기 복수의 제1 인공지능 모델은, 특허명세서의 식별항목에 따라 구분되어 학습된 개별 인공지능 모델을 포함 하고, 상기 개별 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상 기 소스 데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학습 데이터로 학 습될 수 있다. 상기 복수의 제1 인공지능 모델은, 상기 청구항의 내용을 포함하는 상기 소스 데이터를 수신하는 단계; 상기 소 스 데이터를 식별항목별 작성 기준에 따라 학습 처리하는 단계; 및 상기 소스 데이터에 매칭된 식별항목별 타겟 데이터를 출력하도록 학습하는 단계;를 포함하여 생성되며, 상기 소스 데이터는, 청구항 각 구성요소로 구성된 문장, 청구항의 한 줄로 구분되어 구성된 한 문장, 청구항 내 의미 단위로 분절된 한 문장, 또는 하나의 청구항 내 전체 문장을 포함할 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "상기 식별항목은, 기술분야, 발명의 배경이 되는 기술, 해결하고자 하는 과제, 과제의 해결 수단, 발명의 효과,"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "도면의 간단한 설명, 발명을 실시하기 위한 구체적인 내용, 부호의 설명 및 요약서 중 적어도 하나 이상을 포함 하고, 상기 식별항목별 작성 기준은, 상기 식별항목별 작성규칙, 목적, 금지어, 제안어 및 최대 토큰 수에 기초 한 문장 숫자 중 적어도 하나 이상을 포함할 수 있다. 상기 제1 인공지능 모델은, 상기 소스 데이터에 따라 상기 타겟 데이터가 상기 소스 데이터와 상기 타겟 데이터 의 조합을 기초로 출력되도록 하고, 상기 소스 데이터와 상기 타겟 데이터의 조합은, 상기 식별항목별로 상기 소스 데이터의 문장의 수를 기준으로 일대일(1:1), 일대다수(1:N), 다수대일(M:1) 및 다수대다수(M:N) 중 적어 도 어느 하나일 수 있다. 상기 특허명세서 작성 방법은, 제2 인공지능 모델에서 도면용 입력값을 기초로 출력값인 도면을 생성하는 단 계;를 더 포함하고, 상기 제2 인공지능 모델은, 특허명세서 내용으로부터 도면 부호 또는 도면 참조 내용을 삭 제하는 전처리를 수행하는 단계; 전처리된 도면용 소스 데이터를 수신하는 단계; 및 상기 도면용 소스 데이터를 텍스트 투 이미지 생성을 수행하는 인공지능 모델에 입력하여 이미지 형태의 도면을 도면용 타겟 데이터로 출력 하도록 학습하는 단계;를 포함하여 생성될 수 있다. 상기 복수의 제1 인공지능 모델은, 상기 소스 데이터를 상기 청구항의 내용 및 복수의 식별항목의 내용을 조합"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "하여 구성하고, 상기 복수의 식별항목은, 해결하고자 하는 과제 및 발명의 효과를 포함할 수 있다. 상기 복수의 제1 인공지능 모델은, 상기 소스 데이터를 상기 타겟 데이터의 문장, 상기 타겟 데이터의 문단 및 상기 타겟 데이터의 전체 내용 중 적어도 하나 이상을 포함하여 구성할 수 있다. 상기 복수의 제1 인공지능 모델은, 상기 청구항의 내용에서 구성요소를 분리하는 단계; 상기 구성요소를 포함하 는 명세서 단락번호를 분리하는 단계; 상기 구성요소와 상기 명세서 단락번호의 단락 내용을 학습데이터 쌍으로 그룹 형성하는 단계; 및 제1 인공지능 모델을 상기 구성요소의 개수에 대응되도록 생성하여 학습하는 단계;를 포함하여 상기 학습 데이터를 구성할 수 있다. 상기 특허명세서 작성 방법은, 사용자의 조작, 또는 기 설정된 검수기준에 따라 상기 특허명세서의 내용을 체크 및 수정하는 단계;를 더 포함하고, 상기 기 설정된 검수기준은, 청구항 순서, 독립항 및 종속항 여부, 종속항의 인용항 기준, 청구항 번호 부여 규칙, 특허법 기준 작성규칙, 맞춤법 및 문법 검사를 포함할 수 있다. 본 개시에 다른 측면에 따른 특허명세서 작성 장치는, 인공지능 모델 생성부; 및 작성부; 및 검증 및 편집부의 동작을 제어하는 프로세서;를 포함하고, 상기 프로세서는, 청구항 내용을 포함하는 입력값을 복수의 제1 인공지 능 모델로 분산 입력시키고, 및 상기 복수의 제1 인공지능 모델에서 상기 입력값을 기초로 출력값을 생성하는 것을 포함하고, 상기 복수의 제1 인공지능 모델은, 특허명세서의 식별항목에 따라 구분되어 학습된 개별 인공지 능 모델을 포함하고, 상기 개별 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스 데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학 습 데이터로 학습될 수 있다. 상기 복수의 제1 인공지능 모델은, 상기 청구항의 내용을 포함하는 상기 소스 데이터를 수신하고, 상기 소스 데 이터를 식별항목별 작성 기준에 따라 학습 처리하고, 및 상기 소스 데이터에 매칭된 식별항목별 타겟 데이터를 출력하도록 학습하는 것을 포함하여 생성되며, 상기 소스 데이터는, 청구항 각 구성요소로 구성된 문장, 청구항 의 한 줄로 구분되어 구성된 한 문장, 청구항 내 의미 단위로 분절된 한 문장, 또는 하나의 청구항 내 전체 문 장을 포함할 수 있다. 본 개시에 다른 측면에 따른 특허명세서 작성 방법은, 특허명세서 작성 장치에 의해 수행되는 방법에 있어서, 청구항 내용을 포함하는 입력값을 제3 인공지능 모델로 입력시키는 단계; 및 상기 제3 인공지능 모델에서 상기 입력값을 기초로 출력값을 생성하는 단계;를 포함하고, 상기 제3 인공지능 모델은, 하나의 모델에서 특허명세서 의 복수의 식별항목에 따라 구분되어 학습되되, 상기 복수의 식별항목의 기 설정된 순서에 따라 학습된 통합 인 공지능 모델을 포함하고, 상기 통합 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스 데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성 된 학습 데이터로 학습되며, 상기 소스 데이터에 따라 상기 타겟 데이터가 상기 소스 데이터와 상기 타겟 데이 터의 조합을 기초로 출력되도록 하고, 상기 소스 데이터와 상기 타겟 데이터의 조합은, 상기 식별항목별로 상기 소스 데이터의 문장의 수를 기준으로 일대일(1:1), 일대다수(1:N), 다수대일(M:1) 및 다수대다수(M:N) 중 적어 도 어느 하나일 수 있다. 이 외에도, 본 개시를 구현하기 위한 실행하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 더 제공될 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기 록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "발명의 효과"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "본 개시의 전술한 과제 해결 수단에 의하면, 특허명세서 작성 시 청구항의 내용을 기초로 배경기술을 비롯한 식 별항목의 내용을 자동으로 완성하는 인공지능 모델을 제공할 수 있다는 효과를 기대할 수 있다. 본 개시의 전술한 과제 해결 수단에 의하면, 특허명세서 작성을 위한 인공지능 모델로 인해, 특허명세서의 작성 속도가 향상될 수 있다는 것이다. 본 개시의 전술한 과제 해결 수단에 의하면, 청구항의 내용을 비롯하여 기 작성된 식별항목의 내용을 다양한 방 식으로 조합한 후 학습된 학습 데이터를 적용하여 인공지능 모델을 생성하기 때문에, 이를 통해 작성되는 특허 명세서의 정확도가 향상될 수 있다는 것이다. 본 개시의 전술한 과제 해결 수단에 의하면, 완성된 특허명세서에 대한 검증 및 수정 절차를 수행하기 때문에, 특허명세서의 품질의 더욱 향상될 수 있다는 것이다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "도면의 간단한 설명 도 1은 본 개시의 특허명세서 작성 장치의 블록도 도 2는 본 개시의 특허명세서 작성 방법을 설명하기 위한 흐름도도 3은 도 2의 일부를 상세하게 설명하기 위한 흐름도 도 4 내지 도 8은 본 개시의 특허명세서 작성 방법을 설명하기 위한 예시도 도 9는 도 2와 관련된 일부를 상세하게 설명하기 위한 흐름도 도 10은 본 개시의 특허명세서 작성 방법의 다른 예를 설명하기 위한 흐름도"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "발명을 실시하기 위한 구체적인 내용 본 개시 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 개시가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "하는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 '부, 모듈, 부재, 블록'이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블 록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우 뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제 1, 제 2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 본 명세서에서 '본 개시에 따른 특허명세서 작성 장치'는 연산처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들이 모두 포함된다. 예를 들어, 본 개시에 따른 특허명세서 작성 장치는, 컴퓨터, 서 버 장치 및 휴대용 단말기를 모두 포함하거나, 또는 어느 하나의 형태가 될 수 있다. 여기에서, 상기 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱 (laptop), 태블릿 PC, 슬레이트 PC 등을 포함할 수 있다. 상기 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 애플리케이션 서버, 컴퓨팅 서버, 데이터베이스 서버, 파일 서버, 게임 서버, 메일 서버, 프록시 서버 및 웹 서버 등을 포함할 수 있다. 상기 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device, HMD) 등과 같은 웨어러블 장치를 포함할 수 있다. 도 1은 본 개시의 특허명세서 작성 장치의 블록도이다. 도 1을 참고하면, 특허명세서 작성 장치는 프로세서, 메모리 및 통신부를 포함한다. 이때, 프로세서는 인공지능 모델 생성부, 작성부, 및 검증 및 편집부를 포함하여 해당 각 구성의동작을 제어할 수 있다. 도 1에 도시된 구성요소들은 본 개시에 따른 특허명세서 작성 장치를 구현하는데 있어서 필수적인 것은 아니어서, 본 명세서 상에서 설명되는 특허명세서 작성 장치는 위에서 열거된 구성 요소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 프로세서는 청구항 내용을 포함하는 입력값을 복수의 제1 인공지능 모델로 분산 입력시킬 수 있다. 복수의 제1 인공지능 모델 각각이 하나의 식별항목을 생성하기 때문에, 프로세서는 복수의 제1 인공지능 모델 각 각으로 입력값을 분산 입력시키는 것이다. 프로세서는 복수의 제1 인공지능 모델에서 입력값을 기초로출력값을 생성할 수 있다. 상기 복수의 제1 인공지능 모델은, 특허명세서의 식별항목에 따라 구분되어 학습된 개별 인공지능 모델을 포함 할 수 있다. 상기 개별 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스 데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학습 데이터로 학습될 수 있다. 즉, 상기 복수의 제1 인공지능 모델은 식별항목별 인공지능 모델일 수 있다. 즉, 도 4와 같이, 하나의 인"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "공지능 모델로 하나의 식별항목(예를 들어, 기술분야)의 내용을 생성할 수 있다는 것이다. 상술한 개별 인공지능 모델을 포함하는 복수의 제1 인공지능 모델은 프로세서를 통해 생성될 수 있으며, 이에 한정되지 않고, 특허명세서 작성 장치 내 타 구성 또는 외부 구성을 통해 생성되는 것 역시 가능하다 할 것이다. 이하에서는, 설명의 편의를 위해 프로세서를 통해 생성되는 것을 예로 들어 설명하기로 한다. 상기 소스 데이터는 청구항 각 구성요소로 구성된 문장, 청구항의 한 줄로 구분되어 구성된 한 문장, 청구항 내 의미 단위로 분절된 한 문장, 또는 하나의 청구항 내 전체 문장을 포함할 수 있다. 프로세서는 복수의 제1 인공지능 모델을 생성할 때, 청구항의 내용을 포함하는 소스 데이터를 수신하고, 소스 데이터를 식별항목별 작성 기준에 따라 학습 처리할 수 있다. 프로세서는 소스 데이터에 매칭된 식별항목별 타겟 데이터를 출력하도록 복수의 제1 인공지능 모델을 생성 할 수 있다. 상술한 프로세서를 통한 특허명세서 작성 방법의 구체 내용은 후술하는 도 2를 이용하여 상세하게 설명하 기로 한다. 본 개시의 프로세서는 하나 이상의 코어로 구성될 수 있으며, 컴퓨팅 장치의 중앙 처리 장치(central processing unit), 범용 그래픽 처리 장치 (general purpose graphics processing unit), 텐서 처리 장치 (tensor processing unit) 등의 데이터 분석, 딥러닝을 위한 프로세서를 포함할 수 있다. 프로세서는 메모 리에 저장된 컴퓨터 프로그램을 판독하여 본 개시에 따른 기계 학습을 위한 데이터 처리를 수행할 수 있다. 본 개시에 따라 프로세서는 신경망의 학습을 위한 연산을 수행할 수 있다. 프로세서는 딥러닝 (deep learning)에서 학습을 위한 입력 데이터의 처리, 입력 데이터에서의 피처 추출, 오차 계산, 역전파 (backpropagation)를 이용한 신경망의 가중치 업데이트 등의 신경망의 학습을 위한 계산을 수행할 수 있다. 상기 뉴럴 네트워크 모델은 딥 뉴럴 네트워크일 수 있다. 본 개시에서, 신경망, 네트워크 함수, 뉴럴 네트워크 (neural network)는 동일 한 의미로 사용될 수 있다. 딥 뉴럴 네트워크(DNN: deep neural network, 심층신경 망)는 입력 레이어와 출력 레이어 외에 복수의 히든 레이어를 포함하는 신경망을 의미할 수 있다. 딥 뉴럴 네트 워크를 이용하면 데이터의 잠재적인 구조(latent structures)를 파악할 수 있다. 즉, 사진, 글, 비디오, 음성, 음악의 잠재적인 구조(예를 들어, 어떤 물체가 사진에 있는지, 글의 내용과 감정이 무엇인지, 음성의 내용과 감 정이 무엇인지 등)를 파악할 수 있다. 딥 뉴럴 네트워크는 컨벌루셔널 뉴럴 네트워크(CNN: convolutional neural network), 리커런트 뉴럴 네트워크(RNN: recurrent neural network), 제한 볼츠만 머신(RBM: restricted boltzmann machine), 심층 신뢰 네트워크(DBN: deep belief network), Q 네트워크, U 네트워크, 샴 네트워크 등을 포함할 수 있다. 컨벌루셔널 뉴럴 네트워크는 딥 뉴럴 네트워크의 일종으로서, 컨벌루셔널 레이어를 포함하는 신경망을 포함한다. 컨벌루셔널 뉴럴 네트워크는, 최소 한의 전처리(preprocess)를 사용하도록 설계된 다계층 퍼셉트론 (multilayer perceptrons)의 한 종류이다. CNN은 하나 또는 여러 개의 컨벌루셔널 레이어와 이와 결합된 인공 신경망 계층들로 구성될 수 있다. CNN은 가중치와 풀링 레이어(pooling layer)들을 추가로 활용할 수 있다. 이 러한 구조 덕분에 CNN은 2차원 구 조의 입력 데이터를 충분히 활용할 수 있다. 컨벌루셔널 뉴럴 네트워크는 이 미지에서 오브젝트를 인식하기 위하여 사용될 수 있다. 컨벌루셔널 뉴럴 네트워크는, 이미지 데이터를 차원을가진 행렬로 나타내어 처리할 수 있다. 예를 들어 RGB(red-green-blue)로 인코딩 된 이미지 데이터의 경우, R, G, B 색상별로 각각 2 차원(예를 들어, 2 차원 이미지 인 경우) 행렬로 나타내 질 수 있다. 즉, 이미지 데이터 의 각 픽셀의 색상 값이 행렬의 성분이 될 수 있으며 행렬의 크기는 이미지의 크기와 같을 수 있다. 따라서, 이 미지 데이터는 3개의 2차원 행렬로(3차원의 데이터 어레이)로 나타내질 수 있다. 컨벌루셔널 뉴럴 네트워크에서, 컨벌루셔널 필터를 이동해가며 컨벌루셔널 필터와 이미지의 각 위치에서의 행렬 성분끼리 곱하는 것으로 컨벌루셔널 과정(컨벌루셔널 레이어의 입출력)을 수행할 수 있다. 컨벌루셔널 필터는 n*n 형태의 행렬로 구성될 수 있다. 컨벌루셔널 필터는, 일반적으로 이미지의 전체 픽셀의 수보다 작은 고정된 형태의 필터로 구성될 수 있다. 즉, m*m 이미지를 컨벌루셔널 레이어(예를 들어, 컨벌루셔널 필터의 사이즈가 n*n인 컨벌루셔널 레이어)입력시키는 경우, 이미지의 각 픽셀을 포함하는 n*n 픽셀을 나타내는 행렬이 컨벌루셔 널 필터와 성분 곱 (즉, 행렬의 각 성분끼리의 곱) 될 수 있다. 컨벌루셔널 필터와의 곱에 의하여 이 미지에서 컨벌루셔널 필터와 매칭되는 성분이 추출될 수 있다. 예를 들어, 이미지에서 상하 직선 성분을 추출하기 위한 3*3 컨벌루셔널 필터는 [[0,1,0], [0,1,0], [0,1,0]] 와 같이 구성될 수 있다. 이미지에서 상하 직선 성분을 추 출하기 위한 3*3 컨벌루셔널 필터가 입력 이미지에 적용되면 이미지에서 컨벌루셔널 필터와 매칭되는 상하 직선 성분이 추출되어 출력될 수 있다. 컨벌루셔널 레이어는 이미지를 나타낸 각각의 채널에 대한 각각의 행렬(즉, R, G, B 코딩 이미 지의 경우, R, G, B 색상)에 컨벌루셔널 필터를 적용할 수 있다. 컨벌루셔널 레이 어는 입력 이미지에 컨벌루셔널 필터를 적용하여 입력 이미지에서 컨벌루셔널 필터 와 매칭되는 피쳐를 추출할 수 있다. 컨벌루셔널 필터의 필터 값(즉, 행렬의 각 성 분의 값)은 컨벌루셔널 뉴럴 네트워크의 학습 과정에서 역전파에 의하여 업데이트 될 수 있다. 컨벌루셔널 레이어의 출력에는, 서브샘플링 레이어가 연결되어 컨벌 루셔널 레이어의 출력을 단순화하여 메모리 사용량과 연산량을 줄일 수 있다. 예를 들어, 2*2 맥스 풀링 필터를 가지는 풀링 레이어에 컨벌루셔널 레이어의 출력을 입 력시키는 경우, 이미지의 각 픽셀에서 2*2 패치마다 각 패치에 포함되는 최대값을 출력하여 이미지를 압축할 수 있다. 전술한 풀링은 패치에서 최소값을 출력하거나, 패치의 평균값을 출력하는 방식일 수도 있으며 임의의 풀링 방식이 본 개시에 포함될 수 있다. 컨벌루셔널 뉴럴 네트워크는, 하나 이상의 컨벌루셔널 레이어, 서브 샘플링 레이어를 포함할 수 있다. 컨벌루셔 널 뉴럴 네트워크는 컨벌루셔널 과정과 서브샘플링 과정(예를 들어, 전술한 맥스 풀링 등)을 반복적으로 수행하 여 이미지에서 피쳐를 추출할 수 있다. 반복적인 컨벌루션널 과정과 서브샘플링 과정을 통해 뉴럴 네트워크는 이미지의 글로벌 피쳐를 추출할 수 있다. 컨벌루셔널 레이어 또는 서브샘플링 레이어의 출력은 풀 커넥티드 레이어(fully connected layer)에 입력될 수 있다. 풀 커넥티드 레이어는 하나의 레이어에 있는 모든 뉴런과 이웃한 레이어에 있는 모든 뉴런이 연결되는 레 이어이 다. 풀 커넥티드 레이어는 뉴럴 네트워크에서 각 레이어의 모든 노드가 다른 레이 어의 모든 노드에 연 결된 구조를 의미할 수 있다. 프로세서의 CPU, GPGPU, 및 TPU 중 적어도 하나가 네트워크 함수의 학습을 처리할 수 있다. 예를 들어, CPU와 GPGPU가 함께 네트워크 함수의 학습, 네트워크 함수를 이용한 데이터 분류를 처리할 수 있다. 또한, 본 개시의 일 실시예에서 복수의 컴퓨팅 장치의 프로세서를 함께 사용하여 네트워크 함수의 학습, 네트워크 함수를 이용한 데이터 분류를 처리할 수 있다. 또한, 본 개시의 일 실시예에 따른 컴퓨팅 장치에서 수행되는 컴퓨터 프 로그램은, CPU, GPGPU 또는 TPU 실행가능 프로그램일 수 있다. 메모리는 특허명세서 작성 방법을 제공하기 위한 컴퓨터 프로그램을 저장할 수 있으며, 저장된 컴퓨터 프 로그램은 프로세서에 의해 판독되어 구동될 수 있다. 메모리는 프로세서가 생성하거나 결정한 임의의 형태의 정보 및 통신부가 수신한 임의의 형태의 정보를 저장할 수 있다. 메모리는 특허명세서 작성 장치의 다양한 기능을 지원하는 데이터와, 프로세서의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들을 저장할 있고, 특허명세서 작성 장치에서 구동되는 다 수의 응용 프로그램(application program 또는 애플리케이션(application)), 특허명세서 작성 장치의 동 작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 이러한, 메모리는 플래시 메모리 타입(Flash memory type), 하드디스크 타입(Hard disk type), SSD 타입 (Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(Multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(Random access memory; RAM),SRAM(Static random access memory), 롬(Read-only memory; ROM), EEPROM(Electrically erasable programmable read-only memory), PROM(Programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 본 장치와는 분리되어 있으나, 유선 또는 무선으로 연결된 데이터베이스가 될 수도 있다. 통신부는 외부 장치와 통신을 가능하게 하는 하나 이상의 구성 요소를 포함할 수 있으며, 예를 들어, 방송 수신 모듈, 유선통신 모듈, 무선통신 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나를 포함할 수 있다. 도시하지 않았지만, 본 개시의 특허명세서 작성 장치는 출력부 및 입력부를 더 포함할 수도 있다. 출력부는 제1 및 제2 인공지능 모델과 관련된 정보 및 특허명세서 작성 결과 등을 제공하기 위한 사용자 인터페 이스(UI, user interface)를 표시할 수 있다. 출력부는 프로세서가 생성하거나 결정한 임의의 형태의 정보 및 통신부가 수신한 임의의 형태의 정보를 출력할 수 있다. 출력부는 액정 디스플레이(LCD: liquid crystal display), 박막 트랜지스터 액정 디스플레이(TFT LCD: thin film transistor- liquid crystal display), 유기 발광 다이오드(OLED: organic light-emitting diode), 플렉 시블 디스플레이(Flexible display), 3차원 디스플레이(3D display) 중에서 적어도 하나를 포함할 수 있다. 이 들 중 일부 디스플레이 모듈은, 그를 통해 외부를 볼 수 있도록 투명형 또는 광 투과형으로 구성될 수 있다. 이 는 투명 디스플레이 모듈이라 지칭될 수 있는데, 상기 투명 디스플레이 모듈의 대표적 인 예로는 TOLED(Transparent OLED) 등이 있다. 입력부는 사용자에 의해서 입력된 정보를 수신할 수 있다. 입력부는 사용자에 의해서 입력된 정보를 수신하기 위한 사용자 인터페이스 상의 키 및/또는 버튼들, 또는 물리적인 키 및/또는 버튼들을 구비할 수 있다. 입력부 를 통한 사용 자 입력에 따라 본 개시의 실시예들에 따른 디스플레이를 제어하기 위한 컴퓨터 프로그램이 실행 될 수 있다. 도 2는 본 개시의 특허명세서 작성 방법을 설명하기 위한 흐름도이고, 도 3은 도 2의 일부를 상세하게 설명하기 위한 흐름도이다. 이하에서는, 본 개시의 특허명세서 작성 방법을 설명하기 위한 예시도인 도 4 내지 도 8을 참조하여 설명하기로 한다. 먼저, 특허명세서 작성 장치의 프로세서는 인공지능 모델 생성부를 통해 청구항의 내용을 포함 하는 소스 데이터를 기초로 소스 데이터에 매칭되는 식별항목별 타겟 데이터를 출력하도록 하는 학습 데이터를 적용한 복수의 제1 인공지능 모델을 생성할 수 있다. 상기 복수의 제1 인공지능 모델은, 특허명세서의 식 별항목에 따라 구분되어 학습된 개별 인공지능 모델을 포함할 수 있다. 상기 개별 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스 데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학습 데이터로 학습될 수 있다. 상술한 개별 인공지능 모델을 포함하는 복수의 제1 인공지능 모델은 프로세서의 인공지능 모델 생성부 를 통해 생성될 수 있으며, 이에 한정되지 않고, 특허명세서 작성 장치 내 타 구성 또는 외부 구성을 통해 생성되는 것 역시 가능하다 할 것이다. 이하에서는, 설명의 편의를 위해 프로세서의 인공지능 모델 생성부를 통해 생성되는 것을 예로 들어 설명하기로 한다.본 개시의 제1 인공지능 모델은 자연어 처리 (natural language processing, NLP)에 적합한 인공지능 모델을 활용하여 파인 튜닝(fine tuning) 과정을 거쳐, 특허명세서를 작성하도록 하는 모델일 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "상술한 식별항목은 기술분야, 발명의 배경이 되는 기술, 해결하고자 하는 과제(도 4의 해결과제), 과제의 해결"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "수단, 발명의 효과(도 4의 효과), 도면의 간단한 설명, 발명을 실시하기 위한 구체적인 내용, 부호의 설명 및"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "요약서 중 적어도 하나 이상을 포함할 수 있다. 상술한 복수의 식별항목 각각은 작성방법, 작성패턴 및 목적 등이 다르기 때문에, 하나의 인공지능 모델이 동일 한 방식으로 모든 식별항목의 내용을 생성하도록 학습하는 것은 양질의 특허명세서를 기대하기 어렵기 때문에, 도 4와 같이, 각 식별항목별로 인공지능 모델을 별도로 구현할 수 있다. 도 4를 참고하면, 프로세서는 인공지능 모델을 통해 소스 데이터인 청구항의 내용을 수신하면, 복수의 제1"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "인공지능 모델(AI 모델 #1, AI 모델 #2, AI 모델 #3, …) 각각을 통해 기술분야, 해결하고자 하는 과제(도 4의"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "해결과제) 및 발명의 효과(도 4의 효과) 등의 식별항목의 내용을 타겟 데이터로 출력하도록 학습하여 학습 데이 터를 구성하고, 이를 반영한 제1 인공지능 모델을 생성할 수 있다. 구체적으로, 도 3을 참고하면, 프로세서는 인공지능 모델 생성부를 통해 청구항의 내용을 포함하는 소스 데이터를 수신할 수 있다. 상기 소스 데이터는 청구항 각 구성요소로 구성된 문장, 청구항의 한 줄로 구분되어 구성된 한 문장, 청구항 내 의미 단위로 분절된 한 문장, 또는 하나의 청구항 내 전체 문장을 포함할 수 있다. 예를 들어, 프로세서는 청구항의 내용 중 세미콜론( ; ), 쉼표( , ), 엔터표시 등의 각 구성요소를 구분하 는 문장부호를 기초로 청구항의 구성요소로 구성된 문장으로 구분할 수 있다. 또한, 프로세서는 청구항 내 에서 물리적인 한 줄을 한 문장으로 인식할 수 있다. 또한, 프로세서는 청구항 내에서 문장부호와 상관없 이 기 설정된 의미 단위로 분절된 문장을 한 문장으로 인식할 수 있다. 상술한 소스 데이터는 최대 토큰(max_token) 수에 기초한 문장 숫자를 제한할 수 있다. 다음, 프로세서는 인공지능 모델 생성부를 통해 소스 데이터를 식별항목별 작성 기준에 따라 학습 처 리할 수 있다. 상기 식별항목별 작성 기준은 식별항목별 작성규칙, 목적, 금지어, 제안어 및 최대 토큰 수에 기초한 문장 숫자 중 적어도 하나 이상을 포함할 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "예를 들어, 식별항목 중 [기술분야]는 특허를 받으려는 발명의 기술분야를 명확하고 간력하게 기재하는 항목이 다. 식별항목 중 [해결하고자 하는 과제]는 특허를 받으려는 발명이 과제로 하고 있는 종래 기술의 문제점 등을"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "기재하는 항목이다. 식별항목 중 [발명의 효과]는 특허를 받으려는 발명이 종래의 기술과 비교하여 우수하다고"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "인정되는 사항을 기재하는 항목이다. 식별항목 중 [발명을 실시하기 위한 구체적인 내용]은 그 발명이 속하는"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "기술분야에서 통상의 지식을 가진 자가 그 발명이 어떻게 실시되는지를 쉽게 알 수 있도록 그 발명의 실시를 위 한 구체적인 내용을 적어도 하나 이상, 가급적 여러 형태로 기재하고, 필요한 경우 [실시예]란을 만들어 발명의 구체적인 실시예들을 기재하는 항목이다. 상술한 바와 같이, 식별항목 각각은 기재되어야 하는 목적이 반영된 내용이 서로 상이하고, 내용에 따라 주로 사용하는 작성규칙 등이 상이할 수 있다. 이에, 본 개시는 식별항목별 작성 기준을 서로 상이하게 생성할 수 있 다. 이로 인해, 학습을 통해 출력되는 식별항목의 품질이 향상될 수 있다는 효과를 기대할 수 있다. 본 개시에 서 언급하는 식별항목은 식별항목의 내용을 포함하는 의미일 수 있다. 다음, 프로세서는 인공지능 모델 생성부를 통해 소스 데이터에 매칭된 식별항목별 타겟 데이터를 출 력하도록 학습하여 복수의 제1 인공지능 모델을 생성할 수 있다. 이때, 타겟 데이터는 전처리된 식별항목의 한 문장 또는 전체 문장을 포함할 수 있다. 또한, 타겟 데이터는 학 습 가능한 최대 토큰(max_token) 수에 따라 문장 숫자를 제한할 수 있다. 본 개시의 프로세서는 인공지능 모델 생성부를 통해 상술한 서로 다른 식별항목별로 사전에 설정된 작성 기준에 따라 소스 데이터에 대응되는 타겟 데이터가 출력되도록 학습할 수 있다. 제1 실시예로, 도 5 내지 도 8을 참고하면, 프로세서는 인공지능 모델 생성부를 통해 소스 데이터에 따라 타겟 데이터가 소스 데이터와 타겟 데이터의 조합을 기초로 출력되도록 할 수 있다. 상기 소스 데이터와 상기 타겟 데이터의 조합은, 식별항목별로 상기 소스 데이터의 문장의 수를 기준으로 일대일(1:1), 일대다수 (1:N), 다수대일(M:1) 및 다수대다수(M:N) 중 적어도 어느 하나일 수 있다. 도 5를 참고하면, 프로세서는 인공지능 모델 생성부를 통해 소스 데이터 1을 기초로 타겟 데이터 1을"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "생성(예를 들어, [청구항 구성1] : [기술분야 문장1], [청구항 구성1 : 기술분야 문장2], …하도록 학습 처리하 여 학습 데이터를 구성할 수 있다. 도 6을 참고하면, 프로세서는 인공지능 모델 생성부를 통해 소스 데이터 1을 기초로 타겟 데이터 N"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "(복수 개)을 생성(예를 들어, [청구항 구성1] : [기술분야 문장1, 기술분야 문장2 및 기술분야 문장3])하도록학습 처리하여 학습 데이터를 구성할 수 있다. 도 7을 참고하면, 프로세서는 인공지능 모델 생성부를 통해 소스 데이터 M을 기초로 타겟 데이터 1을"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 28, "content": "생성(예를 들어, [청구항 구성1, 청구항 구성2 및 청구항 구성3] : [기술분야 문장1])하도록 학습 처리하여 학 습 데이터를 구성할 수 있다. 도 8을 참고하면, 프로세서는 인공지능 모델 생성부를 통해 소스 데이터 M을 기초로 타겟 데이터 N을"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 29, "content": "생성(예를 들어, [청구항 구성1, 청구항 구성2, 청구항 구성3 및 청구항 구성4] : [기술분야 문장1, 기술분야"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 30, "content": "문장2, 기술분야 문장3, 기술분야 문장4 및 기술분야 문장5])하도록 학습 처리하여 학습 데이터를 구성할 수 있 다. 제2 실시예로, 프로세서는 인공지능 모델 생성부를 통해 제1 인공지능 모델을 생성할 때, 소스 데이 터를 다음과 같이 구현할 수 있다. 프로세서는 인공지능 모델 생성부를 통해 소스 데이터를 청구항의 내용 및 복수의 식별항목의 내용을"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 31, "content": "조합하여 구성할 수 있다. 상기 복수의 식별항목은 해결하고자 하는 과제 및 발명의 효과를 포함할 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 32, "content": "특허명세서는 해결하고자 하는 과제(목적), 구성 및 발명의 효과(효과)로 크게 세 가지로 구성될 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 33, "content": "이때, 청구항은 구성을 중심으로 작성되기 때문에, 청구항을 기초로 해결하고자 하는 과제 및 발명의 효과를 생 성하는 것은 상대적으로 낮은 정확도를 가질 수 있다. 이에, 본 개시의 프로세서는 인공지능 모델 생성부를 통해 소스 데이터를 구성할 때, 복수의 식별항 목도 추가로 조합할 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 34, "content": "예를 들어, 프로세서는 청구항 + 발명의 효과, 청구항 + 해결하고자 하는 과제, 청구항 + 발명의 효과 + 해결하고자 하는 과제로 소스 데이터를 구성할 수 있다. 이때, 프로세서는 이전 실시예와 같이 소스 데이터와 타겟 데이터는 한 문장 또는 전체 문장의 교차 조합 으로 구성될 수 있으며, 해당 제1 인공지능 모델의 학습 가능한 최대 토큰 수에 따라 문장 숫자를 제한할 수 있 다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 35, "content": "소스 데이터와 타겟 데이터의 조합은, 소스 데이터가 [청구항+ 발명의 효과]이고, 타겟 데이터가 [식별항목]인 경우, 프로세서는 인공지능 모델 생성부를 통해 청구항은 1 또는 다수(M), 효과는 1 또는 다수(N), 식별항목은 1 또는 다수(P)일 수 있다. 예를 들어, 소스 데이터와 타겟 데이터의 조합은 [1+1] : [1], [1+N] : [1], [M+1] : [1], [M+N] : [1], [1+1] : [P], [1+N] : [P], [M+1] : [P], [M+N] : [P]의 8가지 유형일 수 있다. 제3 실시예로, 프로세서는 인공지능 모델 생성부를 통해 제1 인공지능 모델을 생성할 때, 추가 학습 데이터를 다음과 같이 구현할 수 있다. 구체적으로, 프로세서는 인공지능 모델 생성부를 통해 소스 데이터를 타겟 데이터의 문장, 타겟 데이 터의 문단 및 타겟 데이터의 전체 내용 중 적어도 하나 이상을 포함하여 구성할 수 있다. 이때, 프로세서는 소스 데이터 입력 시, 문장 중 일부를 입력하면 나머지 문장을 자동 완성하는 GPT(Generative Pre-trained Transformer) 계열의 인공지능 모델을 통해 학습할 수 있다. 상술한 소스 데이터가 이전에 학습된 타겟 데이터의 문장, 타겟 데이터의 문단 및 타겟 데이터의 전체 내용 중 적어도 하나 이상을 포함하도록 구성한 학습 데이터를 적용한 제1 인공지능 모델을 통해 특허명세서를 작성할 때, 본 개시는 입력값에 따라 출력된 문장 및 단락을 다시 제1 인공지능 모델에 입력할 수 있고, 이로 인해 출 력값이 증폭되어 추가 학습 데이터의 완성도가 높아질 수 있다는 효과를 기대할 수 있다. 제4 실시예로, 프로세서는 인공지능 모델 생성부를 통해 복수의 제1 인공지능 모델을 생성할 때, 청 구항의 내용에서 구성요소를 분리하고, 구성요소를 포함하는 명세서 단락번호를 분리하며, 상기 구성요소와 상 기 명세서 단락번호의 단락 내용을 학습데이터 쌍으로 그룹 형성하고, 및 제1 인공지능 모델을 구성요소의 개수에 대응되도록 생성하여 학습하는 것을 포함하여 학습 데이터를 구성할 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 36, "content": "이때, 단락이 많은 [발명을 실시하기 위한 구체적인 내용](상세한 설명)의 경우, 프로세서는 인공지능 모 델 생성부를 통해 소스 데이터(청구항) : 타겟 데이터(상세한 설명)을 포함하는 학습 데이터를 구성할 때, 전체 단락을 학습시키지 않고 청구항 구성요소와 관련된 상세한 설명의 해당 단락만 추출하여 학습시킬 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 37, "content": "한편, 본 개시의 프로세서는 인공지능 모델 생성부를 통해 제1 인공지능 모델을 생성할 때, 기술분야 에 따라 명세서 작성내용, 방향 및 용어가 다른 특징을 고려하여, IPC 코드별로 인공지능 모델을 별도로 구축할 수 있다. 이때, 일부 식별항목의 경우, 프로세서는 IPC 코드와 무관하게 병합 진행할 수 있다. 본 개시의 프로세서는 인공지능 모델 생성부를 통해 제1 인공지능 모델을 생성할 때, 지정된 대리인 없는 특허명세서는 학습대상에서 제외할 수 있다. 또한, 프로세서는 인공지능 모델 생성부를 통해 제1 인공지능 모델을 생성할 때, 대리인별로 학습 데 이터를 그룹핑하여 동일 모델로 학습할 수 있다. 또한, 프로세서는 인공지능 모델 생성부를 통해 제1 인공지능 모델을 생성할 때, 주요 단어만 추출한 단어 데이터셋으로 키워드 단위의 정교함을 높이기 위한 모델 보충 학습을 병행할 수 있다. 또한, 프로세서는 인공지능 모델 생성부를 통해 제1 인공지능 모델을 생성할 때, 영문을 기반으로 한 인공지능 모델의 경우, 문장 순서를 교정하는 인공지능 모델을 추가로 활용할 수 있다. 다음, 프로세서는 작성부를 통해 청구항 내용을 포함하는 입력값을 복수의 제1 인공지능 모델로 분산 입력시킬 수 있다. 1100 단계 이후, 프로세서는 작성부를 통해 복수의 제1 인공지능 모델에서 입력값을 기초로 출력값을 생성할 수 있다. 즉, 프로세서는 작성부를 통해 입력값을 기초로 식별항목별 출력값인 특허명 세서를 생성할 수 있다. 다음, 프로세서는 검증 및 편집부를 통해 사용자의 조작, 또는 기 설정된 검수기준에 따라 특허명세 서의 내용을 체크 및 수정할 수 있다. 상기 기 설정된 검수기준은 청구항 순서, 독립항 및 종속항 여부, 종속항의 인용항 기준, 청구항 번호 부여 규 칙, 특허법 기준 작성규칙, 맞춤법 및 문법 검사를 포함할 수 있다. 이때, 특허법 기준 작성규칙은 다중 인용항 기준 및 출원 국가별 청구항 작성규칙 등을 포함할 수 있다. 추가로, 프로세서는 검증 및 편집부를 통해 기 작성된 청구항에 대해 특허관련 실정법에 따라 다중 인용항인지 여부를 체크한 후, 다중 인용항인 경우 경고 알림을 출력할 수 있다. 또한, 프로세서는 검증 및 편집부를 통해 출원 대상 국가에 따라 청구항 형태를 추천할 수 있다. 예 를 들어, 출원 대상 국가가 미국인 경우, 독립항 3개 및 전체 청구항의 20개의 청구항 형태를 추천할 수 있다. 또한, 프로세서는 입력부(미도시)를 통해 청구항 입력 완료되고 명세서 완성하기 버튼이 선택되면, 작성부 를 통한 인공지능 모델에 입력하여 특허명세서를 완성할 수 있다. 이후, 프로세서는 검증 및 편집부를 통해 완성된 특허명세서를 웹 페이지 상에서 수정할 수 있도록 할 수 있다. 이때, 프로세서는 특허명세서 수정 과정에서 청구항 수정이 추가 발생하는 경우, 즉시 대응 가능하도록 청구항 수정을 위한 버튼을 웹 페이지 상에 함께 출력할 수 있다. 이때, 청구항 수정은 기존 기재의 수정, 추가, 삭제 등을 모두 포함할 수 있다. 또한, 프로세서는 검증 및 편집부를 통해 청구항 수정 버튼이 선택될 때, 전체 특허명세서를 수정하거나, 또는 추가 또는 변경된 청구항에 대해서만 수정될 수 있도록 해당 부분을 선택적으로 지정하여 수정할 수 있도록 옵션을 제공할 수 있다. 예를 들어, 프로세서는 특정 단락만 수정하길 요청하는 의도를 고려하여 단락별로 표시하되, 특정 단락만 표시하거나, 또는 특정 단락을 제외한 나머지 단락을 표시할 수 있도록 선택 옵션 기능을 제공할 수 있다. 이를 위해, 프로세서는 출력부(미도시)를 통해 웹 페이지 상에 상술한 기능을 선택할 수 있도록 버튼을 함께 출력할 수 있다. 이는, 다른 기능에도 동일 적용될 수 있다. 즉, 1차 청구항을 기초로 식별항목을 생성(드래프팅)한 후, 2차로 청구항을 수정한 후 식별항목 생성을 요청한 경우, 전체를 변경할지, 또는 일부만 변경할지 여부를 선택할 수 있는 것이다. 또한, 프로세서는 검증 및 편집부를 통해 청구항의 추가 변경이 없더라도 식별항목 내용(드래프트 내 용)이 마음에 들지 않는 경우에는 식별항목 내용 중 일부 문장이나 단락만 고정시키고 다시 생성하기를 눌러서 식별항목 재 생성(재드래프팅)이 가능하도록 지원할 수 있다. 프로세서는 인공지능 모델 생성부를 통해 상술한 과정에서 사용자가 직접 수정한 데이터나 여러 번 재생성을 거쳐서 선택한 데이터를 실시간 수집해서 추가 학습 진행에 적용할 수 있다. 도시하지 않았지만, 특허명세서 작성 장치는 클라우드 기반 웹 페이지 상에서의 특허명세서 작성 지원 서 비스를 제공할 수 있다. 구체적으로, 특허명세서 작성 장치의 프로세서는 입력부(미도시)를 통한 사용자의 조작에 따라 클라 우드 기반 웹 페이지에 접근하여 로그인 처리를 수행할 수 있다. 프로세서는 작성부를 통해 독립항 항목 또는 종속항 항목이 선택됨에 따라, 해당 청구항을 입력할 수 있도록 서비스를 제공할 수 있다. 이때, 종속항의 경우, 인용항 독립항을 지정하는 기능도 구현할 수 있다. 프로세서는 작성부를 통해 청구항 작성 중 청구항 사이의 입력 관계를 변경할 수 있다. 이때, 프로세 서는 작성부를 통해 변경된 청구항 간의 주종 관계에 따라 청구항 번호 자동 부여할 수 있다. 프로세서는 작성부를 통해 청구항 작성 중 청구항 입력 시 키워드나 문장 자동 추천 기능을 제공할 수 있다. 프로세서는 인공지능 모델 생성부를 통해 입력된 청구항에 학습데이터 생성할 때의 전처리를 동일하 게 적용할 수 있다. 도 9는 도 2와 관련된 일부를 상세하게 설명하기 위한 흐름도로서, 도면을 작성하기 위한 제2 인공 지능 모델을 생성하는 것을 예로 들어 설명하기로 한다. 도 2의 1100 단계 이후, 프로세서는 인공지능 모델 생성부를 통해 도면 작성을 위한 제2 인공지능 모 델을 생성할 수 있다. 구체적으로, 프로세서는 인공지능 모델 생성부를 통해 특허명세서 내용으로부터 도면 부호 또는 도면 참조 내용을 삭제하는 전처리를 수행할 수 있다. 이때, 도면 부호는 이미지 형태의 도면의 각 구성에 부여된 참조 번호를 의미하는 것이고, 도면 참조 내용은 이 미지 형태의 도면에 기재된 도면과 관련된 기술 내용을 의미할 수 있다. 다음, 프로세서는 인공지능 모델 생성부를 통해 전처리된 도면용 소스 데이터를 수신할 수 있다 . 이때, 전처리된 도면용 소스 데이터를 수신하는 것은 프로세서가 학습 처리를 통해 제2 인공지능 모델을 생성하기 위한 도면용 소스 데이터를 인식, 입력 또는 확정하는 것을 의미할 수 있다. 프로세서는 인공지능 모델 생성부를 통해 도면용 소스 데이터를 텍스트 투 이미지 생성을 수행하는 인공지능 모델에 입력하여 이미지 형태의 도면을 도면용 타겟 데이터로 출력하도록 학습하여 제2 인공지능 모델 을 생성할 수 있다. 한편, 프로세서는 인공지능 모델 생성부를 통해 제2 인공지능 모델을 생성할 때, 발명을 실시하기 위"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 38, "content": "한 구체적인 내용, 도면의 간단한 설명 및 도면의 세 가지 식별 항목을 교차하여 할 수 있다. 예를 들어, 프로세서는 인공지능 모델 생성부를 통해 소스 데이터와 타겟 데이터를 포함하는 학습 데"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 39, "content": "이터를 구현할 때, [발명을 실시하기 위한 구체적인 내용] : [도면의 간단한 설명], [도면의 간단한 설명] :"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 40, "content": "[도면] 및 [발명을 실시하기 위한 구체적인 내용] : [도면]의 조합으로 구현할 수 있다. 다른 한편, 프로세서는 인공지능 모델 생성부를 통해 도면 생성을 위한 후가공을 통해 [발명을 실시 하기 위한 구체적인 내용](상세한 설명) 전체 및 실시예의 문장 또는 단락을 재배치할 수 있다. 프로세서는 작성부를 통해 제2 인공지능 모델에서 도면용 입력값을 기초로 출력값인 도면을 생성할 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 41, "content": "도면 생성 후, 프로세서는 검증 및 편집부를 통해 [발명을 실시하기 위한 구체적인 내용]란에 기 설 정된 번호 추가 기준에 따라 도면 부호를 추가할 수 있다. 기 설정된 번호 추가 기준은 [발명을 실시하기 위한 구체적인 내용] 내 구성요소 다음에 일치하는 도면의 구성요소에 대한 도면 부호를 추가하는 기준일 수 있다. 이때, 기 설정된 번호 추가 기준은 출원 국가별로 도면 부호 기재 형식을 추가로 포함할 수 있다. 예를 들어, 대한민국은 괄호(()) 내에 도면 부호를 기재하는 형식, 미국은 구성요소명 다음에 한칸 이격 후 도면 부호를 기 재하는 형식일 수 있다. 도 10은 본 개시의 특허명세서 작성 방법의 다른 예를 설명하기 위한 흐름도로서, 하나의 통합 인공지능 모델에 서 복수의 식별항목에 대한 특허명세서 작성을 처리할 수 있는 경우를 예로 들어 설명하기로 한다. 먼저, 특허명세서 작성 장치의 프로세서는 작성부를 통해 청구항 내용을 포함하는 입력값을 제3 인공지능 모델로 입력시킬 수 있다. 상기 제3 인공지능 모델은, 하나의 모델에서 특허명세서의 복수의 식별항목에 따라 구분되어 학습되되, 상기 복 수의 식별항목의 기 설정된 순서에 따라 학습된 통합 인공지능 모델을 포함할 수 있다. 이때, 기 설정된 순서는 식별항목의 학습 순서를 의미하는 것으로, 이는 이후에 제3 인공지능 모델에서 입력값 에 따라 출력값인 식별항목의 문장을 포함하는 출력값(특허 명세서)을 생성할 때도 동일하게 적용될 수 있다. 예를 들어, 제3 인공지능 모델은 식별항목별로 구분하여 학습하되, 복수의 식별항목을 기 설정된 순서(예를 들"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 42, "content": "어, 기술분야 -> 발명의 배경이 되는 기술 -> 해결하고자 하는 과제 -> 과제의 해결 수단 -> 발명의 효과 -> 발"}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 43, "content": "명을 실시하기 위한 구체적인 내용 -> 요약서 순서)에 따라 순차적으로 학습할 수 있는 것이다. 이때, 기 설정 된 순서는 상술한 순서에 한정되지 않고 운용자에 따라 임의로 결정될 수 있다. 상기 통합 인공지능 모델은, 청구항의 구성요소를 기준으로 분리된 문장을 포함하는 소스 데이터, 및 상기 소스 데이터와 매칭되는 특허명세서 내 식별항목의 문장을 포함하는 타겟 데이터로 구성된 학습 데이터로 학습될 수 있다. 또한, 통합 인공지능 모델은, 소스 데이터에 따라 타겟 데이터가 소스 데이터와 타겟 데이터의 조합을 기초로 출력되도록 할 수 있다. 이때, 소스 데이터와 타겟 데이터의 조합은, 식별항목별로 소스 데이터의 문장의 수를 기준으로 일대일(1:1), 일대다수(1:N), 다수대일(M:1) 및 다수대다수(M:N) 중 적어도 어느 하나일 수 있다. 도시하지 않았지만, 상술한 제3 인공지능 모델은 인공지능 모델 생성부를 통해 생성되거나, 또는 외부 구 성을 통해 생성될 수 있다. 프로세서는 작성부를 통해 제3 인공지능 모델에서 입력값을 기초로 출력값을 생성할 수 있다. 이때, 출력값은 특허명세서일 수 있다. 이후, 프로세서는 검증 및 편집부를 통해 도 1의 1400 단계를 수행하여 특허명세서의 내용을 체크 및 수정할 수 있다. 한편, 상술한 통합 인공지능 모델은 여러 인공지능 모델이 종속 및 연결되어 있거나, 또는 논리적 내지 개념적 으로 구분되어 있는 경우도 있을 수 있다. 다른 한편, 상술한 통합 인공지능 모델은 Open AI나 클로바 AI처럼 초거대 AI와 같이 큰 모델 하나에서 Few Shot Learning 방식으로 생성 모드를 필요에 따라 실시간으로 또는 미리 수정하고 해결과제, 효과 등 성격에 맞 는 출력패턴으로 생성하는 방식도 적용할 수 있다. 상기 Few Shot Learning 방식은 학습 데이터를 통해 학습하 는 방법 자체를 습득하고, 이를 통해 적은 양의 데이로도 예측을 수행하도록 하는 방식을 의미할 수 있다. 한편, 전술한 본 개시에 따른 방법은, 하드웨어인 서버와 결합되어 실행되기 위해 프로그램(또는 애플리케이 션)으로 구현되어 매체에 저장될 수 있다. 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2023-0008257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 44, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2023-0008257", "section": "도면", "subsection": "도면설명", "item": 1, "content": ","}
