{"patent_id": "10-2022-0054277", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0156845", "출원번호": "10-2022-0054277", "발명의 명칭": "뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법", "출원인": "주식회사 페스티벌온", "발명자": "김재한"}}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "?운영서버를 통해 실행되는 방법에 있어서, 지정된 제r(r≥1) 맵 영역에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 매칭되게 구성된 제r 뷰잉 맵(Viewing Map) 데이터를 등록받는 제1 단계; 지정된 실측 기반 측위 기술에 근거한 T(T≥1)개의 위치 추적 시스템에 대응하는 T개의 위치 추적 기반 좌표계와 매칭되거나 지정된 좌표계 변환을 통해 매칭 가능하면서 실제 현실공간과 지정된 축척 관계를 지닌 고유 좌표계를 포함하는 실축척 맵(Actual Scale Map) 중 상기 제r 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하는제r 실축척 맵 데이터를 확인하는 제2 단계; 지정된 t(1≤t≤T)개의 위치 추적 시스템을 통해 추적된 사용자 위치에 대응하는 제r 실축척 맵 상의 고유 좌표계 기반 위치 좌표 정보를 확인한 경우, 지정된 학습 대상 실축척 맵 상의 고유 좌표계에 대응하는 i(i≥1)개의위치 좌표 정보를 입력 정보에 포함하고 상기 학습 대상 실축척 맵의 맵 영역과 매칭된 맵 영역을 지정된 맵 표시 방식으로 구성한 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력 정보로 포함하는 복수의 학습 데이터를 학습한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 실축척 맵 상의 위치 좌표 정보와 매칭된 제r 뷰잉맵 상의 표시 좌표 정보를 확인하는 제3 단계; 및사용자 단말에 표시되는 제r 뷰잉 맵 상의 표시 좌표에 상기 사용자 위치에 대응하는 지정된 표지를 표시하도록처리하는 제4 단계;를 포함하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 뷰잉 맵은, 지정된 지리적 위치나 구조에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 대응하는 지정된 왜곡이 포함된 맵을 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항 또는 제 2항에 있어서, 상기 뷰잉 맵은, 지정된 맵 표시 방식에 대응하는 약도, 3D구조 맵, 간략 맵, 버드뷰 맵, VR(Virtual Reality) 맵 중 적어도 하나의 맵을 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 지정된 R(R≥1)개의 맵 영역에 대응하는 학습 대상 실축척 맵 상에 존재하는 i(i≥1)개의 위치 좌표 정보를 입력 정보에 포함하고 상기 학습 대상 실축척 맵의 맵 영역과 매칭된 맵 영역을 포함하여 지정된 맵 표시 방식으로 구성된 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력공개특허 10-2023-0156845-3-정보로 포함하는 복수의 학습 데이터를 지정된 인공지능모듈에 대입하여 학습시키는 단계를 포함하며, 상기 제3 단계는, 상기 제r 뷰잉 맵의 맵 표시 방식과 매칭된 맵 표시 방식으로 구성된 학습 대상 뷰잉 맵에 대응하는 복수의 학습 데이터를 학습한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 뷰잉 맵 상의 표시 좌표 정보를 확인하는 단계를 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서, 상기 제r 실축척 맵을 포함하는 학습 대상 실축척 맵 상에 존재하는 i(i≥1)개의 위치 좌표 정보를 입력 정보에포함하고 상기 제r 뷰잉 맵을 포함하는 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력 정보로 포함하는 복수의 학습 데이터를 지정된 인공지능모듈에 대입하여 학습시키는 단계를 포함하며, 상기 제3 단계는, 상기 학습된 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 뷰잉 맵 상의 표시 좌표 정보를 확인하는 단계를 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4항 또는 제 5항에 있어서, 상기 입력 정보는, 상기 학습 대상 뷰잉 맵의 종류를 식별 가능한 뷰잉 맵 종류 정보, 상기 학습 대상 뷰잉 맵의 맵 표시 방식을 식별 가능한 뷰잉 맵 고유 정보 중 적어도 하나의 정보를 더 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 4항에 있어서, 상기 입력 정보는, 상기 R개의 맵 영역을 식별 가능한 맵 영역 정보, 상기 R개의 맵 영역 중 상기 i개의 위치 좌표 정보에 대응하는 적어도 하나의 맵 영역을 식별하는 맵 영역 정보중 적어도 하나의 정보를 더 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 4항 또는 제 5항에 있어서, 상기 입력 정보는, 상기 학습 대상 뷰잉 맵 상에 존재하는 M(M≥2)개의 랜드마크 중 지정된 m(1≤m≤M)개의 랜드마크를 관측한 특징에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보와, 상기 학습 대상 실축척 맵 상의 지정된 지리적 위치나 구조에 대응하는 N(N≥2)개의 객체 중 상기 학습 대상 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n(1≤n≤N, n=m)개의 객체를 관측한 특징에 대응하는 실축척 맵 기반 n개의 객체 정보를 더 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법.공개특허 10-2023-0156845-4-청구항 9 제 4항 또는 제 5항에 있어서, 상기 고유 위치 정보는, 상기 제r 뷰잉 맵의 종류를 식별 가능한 뷰잉 맵 종류 정보, 상기 제r 뷰잉 맵의 맵 표시 방식을 식별 가능한 뷰잉 맵 고유 정보 중 적어도 하나의 정보를 더 포함하는 것을특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 4항에 있어서, 상기 고유 위치 정보는, 상기 제r 맵 영역을 식별 가능한 맵 영역 정보를 더 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 4항 또는 제 5항에 있어서, 상기 고유 위치 정보는, 상기 제r 뷰잉 맵 상에 존재하는 M(M≥2)개의 랜드마크 중 지정된 m(1≤m≤M)개의 랜드마크를 관측한 특징에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보와, 상기 제r 실축척 맵 상의 지정된 지리적 위치나 구조에 대응하는 N(N≥2)개의 객체 중 상기 제r 뷰잉 맵 상의지정된 m개의 랜드마크와 일대일 매칭된 n(1≤n≤N, n=m)개의 객체를 관측한 특징에 대응하는 실축척 맵 기반 n개의 객체 정보를 더 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1항에 있어서, 상기 뷰잉 맵 데이터는, 비트맵 구조의 맵 데이터를 포함하며, 상기 뷰잉 맵 기반 표시 좌표 정보는, 상기 비트맵 구조 상의 픽셀 위치에 대응하는 픽셀 좌표계를 포함하는 화면 표시 좌표계 기반의 좌표 정보를 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시방법."}
{"patent_id": "10-2022-0054277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1항에 있어서, 상기 뷰잉 맵 데이터는, 벡터 드로잉 구조의 맵 데이터를 포함하며, 상기 뷰잉 맵 기반 표시 좌표 정보는, 상기 벡터 드로잉 구조의 크기와 방향을 해석 가능한 벡터 드로잉 좌표계를 포함하는 화면 표시 좌표계 기반의 좌표 정보를 포함하는 것을 특징으로 하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법."}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법에 관한 것으로서, 본 발명에 따른 운영서버를 통해 실행되는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법은, 지정된 제r(r≥1) 맵 영역에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 매칭되게 구성된 제r 뷰잉 맵(Viewing Map) 데이터를 (뒷면에 계속)"}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법에 관한 것으로, 위치 추적 시스템을 통해 추적된 사 용자 위치에 대응하는 실축적 맵 상의 추적 위치좌표가 산출되면, 인공지능모듈에 실축적 맵 상의 추적 위치좌 표를 대입하여 뷰잉 맵 상의 출력 위치좌표를 산출한 후, 뷰잉 맵 상의 출력 위치좌표에 사용자 위치를 표시하는 방법에 관한 것이다."}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다양하게 벌여지던 페스티벌이 코로나 시국으로 한동안 주춤하였으나, 점차 사태가 완화되면서 다시금 활발하게 열리게 될 전망이다. 특히, 오프라인 상에서 큰 규모로 열리는 페스티벌의 경우, 페스티벌에 참가하는 업체나 개인은 물론 관람하는 업체나 개인까지 페스티벌에 대한 안내 지도나 약도가 필요할 수 밖에 없다. 통상적으로 페스티벌을 주최하는 주최측에서 홈페이지 등을 통해 안내 지도나 약도를 배포하고는 있으나, 페스 티벌을 위한 형식적인 안내 지도나 약도일 뿐, 특정 업체나 개인을 위한 안내 지도나 약도는 업체나 개인 스스 로 필요에 따라 만들 수 밖에 없었다. 대한민국 공개특허공보 제10-2014-0117337호(2014년10월07일 공개)는 NFC 태그를 이용한 지도 및 안내도 그리고 약도의 제작에 관한 방법으로, 지도 및 안내도 그리고 약도 상에 표시되어 있는 이정표의 객체별 상세정보 제공 을 목적으로 하여 NFC태그를 부착하고 상세정보를 NFC 기능을 지원하는 단말기로 태깅하여 NFC태그에 저장되어 있는 정보나 NFC태그의 URL 링크 정보에 따라 접속하여 정보를 확인하는 내용이 기재되어 있다. 그러나, 이는 단순히 지도나 안내도의 특정 객체에 대한 상제 정보를 지도 자체에 NFC 태그를 부탁하여 사용자 가 태깅을 통해 확인할 수 있도록 하는 것으로, 사용자나 특정 업체 만을 위한 개인화된 페스티벌 용 지도나 안 내도의 효과를 기대할 수는 없었다. 즉, 대규모 페스티벌에 참가하거나 관람하고자 하는 업체 또는 개인(또는 집단)이 본인들 만의 특정 목적의 페 스티벌 용 안내 지도를 만들기는 쉽지 않았다."}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 사용자의 맵 가독성을 최적화하여 제작된 뷰잉 맵을 등록받고, 뷰잉 맵의 장소와 매칭된 맵 영역을 포함하며 T개의 위치 추적 시스템과 매칭된 실축적 맵을 확인하거나 등록받고, 실축척 맵 상에 존재하는 i(i≥1)개의 위치정보를 입력정보로 포함하고 이와 일대일 매칭시켜 뷰잉 맵 상에 특정된 i개의 위치정보를 출 력정보로 포함하는 복수의 학습데이터를 구성하여 인공지능모듈을 학습시킨 후, T개의 위치 추적 시스템을 통해 추적된 사용자 위치에 대응하는 실축적 맵 상의 추적 위치좌표가 산출되면, 인공지능모듈에 실축적 맵 상의 추 적 위치좌표를 대입하여 뷰잉 맵 상의 출력 위치좌표를 산출한 후, 뷰잉 맵 상의 출력 위치좌표에 사용자 위치 를 표시하는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법을 제공함에 있다."}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 운영서버를 통해 실행되는 뷰잉 맵을 이용한 인공지능 기반 위치 표시 방법은, 지정된 제r(r≥ 1) 맵 영역에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 매칭되게 구성된 제 r 뷰잉 맵(Viewing Map) 데이터를 등록받는 제1 단계와, 지정된 실측 기반 측위 기술에 근거한 T(T≥1)개의 위 치 추적 시스템에 대응하는 T개의 위치 추적 기반 좌표계와 매칭되거나 지정된 좌표계 변환을 통해 매칭 가능하 면서 실제 현실공간과 지정된 축척 관계를 지닌 고유 좌표계를 포함하는 실축척 맵(Actual Scale Map) 중 상기제r 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하는 제r 실축척 맵 데이터를 확인하는 제2 단계와, 지정된 t(1≤t≤T)개의 위치 추적 시스템을 통해 추적된 사용자 위치에 대응하는 제r 실축척 맵 상의 고유 좌표계 기반 위치 좌표 정보를 확인한 경우, 지정된 학습 대상 실축척 맵 상의 고유 좌표계에 대응하는 i(i≥1)개의 위치 좌 표 정보를 입력 정보에 포함하고 상기 학습 대상 실축척 맵의 맵 영역과 매칭된 맵 영역을 지정된 맵 표시 방식 으로 구성한 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출 력 정보로 포함하는 복수의 학습 데이터를 학습한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 실축척 맵 상의 위치 좌표 정보와 매칭된 제r 뷰잉 맵 상 의 표시 좌표 정보를 확인하는 제3 단계와, 사용자 단말에 표시되는 제r 뷰잉 맵 상의 표시 좌표에 상기 사용자 위치에 대응하는 지정된 표지를 표시하도록 처리하는 제4 단계를 포함할 수 있다. 본 발명에 따르면, 상기 뷰잉 맵은, 지정된 지리적 위치나 구조에 대하여 사용자의 맵 인지율을 최적화하기 위 해 설정된 특유의 맵 표시 방식에 대응하는 지정된 왜곡이 포함된 맵을 포함할 수 있다. 본 발명에 따르면, 상기 뷰잉 맵은, 지정된 맵 표시 방식에 대응하는 약도, 3D구조 맵, 간략 맵, 버드뷰 맵, VR(Virtual Reality) 맵 중 적어도 하나의 맵을 포함할 수 있다. 본 발명에 따르면, 지정된 R(R≥1)개의 맵 영역에 대응하는 학습 대상 실축척 맵 상에 존재하는 i(i≥1)개의 위 치 좌표 정보를 입력 정보에 포함하고 상기 학습 대상 실축척 맵의 맵 영역과 매칭된 맵 영역을 포함하여 지정 된 맵 표시 방식으로 구성된 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력 정보로 포함하는 복수의 학습 데이터를 지정된 인공지능모듈에 대입하여 학습시키는 단계를 포함하며, 상기 제3 단계는, 상기 제r 뷰잉 맵의 맵 표시 방식과 매칭된 맵 표시 방식으로 구성된 학습 대상 뷰 잉 맵에 대응하는 복수의 학습 데이터를 학습한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정 보를 포함하는 고유 위치 정보를 대입하여 상기 제r 뷰잉 맵 상의 표시 좌표 정보를 확인하는 단계를 포함할 수 있다. 본 발명에 따르면, 상기 제r 실축척 맵을 포함하는 학습 대상 실축척 맵 상에 존재하는 i(i≥1)개의 위치 좌표 정보를 입력 정보에 포함하고 상기 제r 뷰잉 맵을 포함하는 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정 보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력 정보로 포함하는 복수의 학습 데이터를 지정된 인공지능모듈에 대입하여 학습시키는 단계를 포함하며, 상기 제3 단계는, 상기 학습된 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 뷰잉 맵 상의 표시 좌표 정보를 확인 하는 단계를 포함할 수 있다. 본 발명에 따르면, 상기 입력 정보는, 상기 학습 대상 뷰잉 맵의 종류를 식별 가능한 뷰잉 맵 종류 정보, 상기 학습 대상 뷰잉 맵의 맵 표시 방식을 식별 가능한 뷰잉 맵 고유 정보 중 적어도 하나의 정보를 더 포함할 수 있 다. 본 발명에 따르면, 상기 입력 정보는, 상기 R개의 맵 영역을 식별 가능한 맵 영역 정보, 상기 R개의 맵 영역 중 상기 i개의 위치 좌표 정보에 대응하는 적어도 하나의 맵 영역을 식별하는 맵 영역 정보 중 적어도 하나의 정보 를 더 포함할 수 있다. 본 발명에 따르면, 상기 입력 정보는, 상기 학습 대상 뷰잉 맵 상에 존재하는 M(M≥2)개의 랜드마크 중 지정된 m(1≤m≤M)개의 랜드마크를 관측한 특징에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보와, 상기 학습 대상 실축 척 맵 상의 지정된 지리적 위치나 구조에 대응하는 N(N≥2)개의 객체 중 상기 학습 대상 뷰잉 맵 상의 지정된 m 개의 랜드마크와 일대일 매칭된 n(1≤n≤N, n=m)개의 객체를 관측한 특징에 대응하는 실축척 맵 기반 n개의 객 체 정보를 더 포함할 수 있다. 본 발명에 따르면, 상기 고유 위치 정보는, 상기 제r 뷰잉 맵의 종류를 식별 가능한 뷰잉 맵 종류 정보, 상기 제r 뷰잉 맵의 맵 표시 방식을 식별 가능한 뷰잉 맵 고유 정보 중 적어도 하나의 정보를 더 포함할 수 있다. 본 발명에 따르면, 상기 고유 위치 정보는, 상기 제r 맵 영역을 식별 가능한 맵 영역 정보를 더 포함할 수 있다. 본 발명에 따르면, 상기 고유 위치 정보는, 상기 제r 뷰잉 맵 상에 존재하는 M(M≥2)개의 랜드마크 중 지정된 m(1≤m≤M)개의 랜드마크를 관측한 특징에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보와, 상기 제r 실축척 맵 상의 지정된 지리적 위치나 구조에 대응하는 N(N≥2)개의 객체 중 상기 제r 뷰잉 맵 상의 지정된 m개의 랜드마 크와 일대일 매칭된 n(1≤n≤N, n=m)개의 객체를 관측한 특징에 대응하는 실축척 맵 기반 n개의 객체 정보를 더 포함할 수 있다. 본 발명에 따르면, 상기 뷰잉 맵 데이터는, 비트맵 구조의 맵 데이터를 포함하며, 상기 뷰잉 맵 기반 표시 좌표 정보는, 상기 비트맵 구조 상의 픽셀 위치에 대응하는 픽셀 좌표계를 포함하는 화면 표시 좌표계 기반의 좌표 정보를 포함할 수 있다. 본 발명에 따르면, 상기 뷰잉 맵 데이터는, 벡터 드로잉 구조의 맵 데이터를 포함하며, 상기 뷰잉 맵 기반 표시 좌표 정보는, 상기 벡터 드로잉 구조의 크기와 방향을 해석 가능한 벡터 드로잉 좌표계를 포함하는 화면 표시 좌표계 기반의 좌표 정보를 포함할 수 있다."}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사용자가 사이트 맵 또는 본인이 그린 맵 등의 뷰잉 맵 데이터를 업로드하는 것만으로, 실축 척 맵 상에 존재하는 다양한 위치정보를 입력정보로 포함하고 이와 일대일 매칭시켜 뷰잉 맵 상에 특정된 위치 정보를 출력정보로 포함하는 복수의 학습데이터를 구성하여 인공지능모듈을 학습시켜, 사용자의 실축척 맵 상의 위치 좌표가 확인되면 인공지능모듈에 실축적 맵 상의 추적 위치좌표를 대입하여 뷰잉 맵 상의 출력 위치좌표를 산출하여 사용자의 위치를 표시할 수 있는 이점이 있다. 또한, 본 발명에 따르면, 페스티벌 등 복잡한 행사 장에서 사용자 개인 또는 특정 집단 만을 위한 맵 제작이 손 쉽게 가능하게 되는 이점이 있다."}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면과 설명을 참조하여 본 발명의 바람직한 실시예에 대한 동작 원리를 상세히 설명한다. 다만, 하기에 도시되는 도면과 후술되는 설명은 본 발명의 특징을 효과적으로 설명하기 위한 여러 가지 방법 중에서바람직한 실시 방법에 대한 것이며, 본 발명이 하기의 도면과 설명만으로 한정되는 것은 아니다. 즉, 하기의 실시예는 본 발명의 수 많은 실시예 중에 바람직한 합집합 형태의 실시예에 해당하며, 하기의 실시 예에서 특정 구성(또는 단계)을 생략하는 실시예, 또는 특정 구성(또는 단계)에 구현된 기능을 특정 구성(또는 단계)으로 분할하는 실시예, 또는 둘 이상의 구성(또는 단계)에 구현된 기능을 어느 하나의 구성(또는 단계)에 통합하는 실시예, 특정 구성(또는 단계)의 동작 순서를 교체하는 실시예 등은, 하기의 실시예에서 별도로 언급 하지 않더라도 모두 본 발명의 권리범위에 속함을 명백하게 밝혀두는 바이다. 따라서 하기의 실시예를 기준으로 부분집합 또는 여집합에 해당하는 다양한 실시예들이 본 발명의 출원일을 소급받아 분할될 수 있음을 분명하게 명기하는 바이다. 또한, 하기에서 본 발명을 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지 를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서, 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 발명에서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 결과적으로, 본 발명의 기술적 사상은 청구범위에 의해 결정되며, 이하 실시예는 진보적인 본 발명의 기술적 사"}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상을 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 효율적으로 설명하기 위한 일 수단일 뿐이다. 도면1는 본 발명의 실시 방법에 따른 뷰잉 맵을 이용한 인공지능 기반 위치 표시 시스템의 구성을 도시한 도면 이다. 보다 상세하게 본 도면1는 지정된 제r(r≥1) 맵 영역에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 매칭되게 구성된 제r 뷰잉 맵(Viewing Map) 데이터를 등록받고, 지정된 실측 기반 측위 기술에 근거한 T(T≥1)개의 위치 추적 시스템에 대응하는 T개의 위치 추적 기반 좌표계와 매칭되거나 지정된 좌 표계 변환을 통해 매칭 가능하면서 실제 현실공간과 지정된 축척 관계를 지닌 고유 좌표계를 포함하는 실축척 맵(Actual Scale Map) 중 상기 제r 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하는 제r 실축척 맵 데이터를 확인하여, 지정된 t(1≤t≤T)개의 위치 추적 시스템을 통해 추적된 사용자 위치에 대응하는 제r 실축척 맵 상의 고유 좌표계 기반 위치 좌표 정보를 확인한 경우, 지정된 학습 대상 실축척 맵 상의 고유 좌표계에 대응하는 i(i≥1)개의 위치 좌표 정보를 입력 정보에 포함하고 상기 학습 대상 실축척 맵의 맵 영역과 매칭된 맵 영역을 지정된 맵 표시 방식으로 구성한 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력 정보로 포함하는 복수의 학습 데이터를 학습한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 실축척 맵 상의 위치 좌표 정보와 매 칭된 제r 뷰잉 맵 상의 표시 좌표 정보를 확인한 후, 사용자 단말에 표시되는 제r 뷰잉 맵 상의 표시 좌표에 상 기 사용자 위치에 대응하는 지정된 표지를 표시하도록 처리하는 시스템 구성을 도시한 것으로서, 본 발명이 속"}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "한 기술분야에서 통상의 지식을 가진 자라면, 본 도면1를 참조 및/또는 변형하여 상기 시스템에 대한 다양한 실 시 방법(예컨대, 일부 구성부가 생략되거나, 또는 세분화되거나, 또는 합쳐진 실시 방법)을 유추할 수 있을 것 이나, 본 발명은 상기 유추되는 모든 실시 방법을 포함하여 이루어지며, 본 도면1에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 본 발명의 시스템은, 뷰잉 맵을 통해 사용자의 위치에 대응하는 지정된 표지하는 사용자 단말과, 운영서버 를 운영하는 운영자가 이용하는 운영자 단말과, 뷰잉 맵 상의 표시 좌표 정보를 확인하여, 상기 사용 자 단말에 표시되는 뷰잉 맵 상의 표시 좌표에 상기 사용자 위치에 대응하는 지정된 표지를 표시하도록 처 리하는 운영서버를 포함한다. 한편 상기 운영서버는 독립된 서버 형태, 둘 이상의 서버 조합 형태, 기 구비된 서버에 설치 구동되는 서버 프로그램 형태 중 적어도 하나 또는 둘 이상의 조합 형태로 구현될 수 있 으며, 상기 운영서버를 구현하는 방식에 의해 본 발명이 한정되지 아니한다. 또한, 상기 운영서버는 지정된 위치 추적 시스템과 연동하거나, 상기 위치 추적 시스템을 구비 할 수 있으며, 상기 운영서버를 구현하는 방식에 의해 본 발명이 한정되지 아니한다. 예컨대, 상기 위치 추적 시스템은, GPS(Global Positioning System) 기반 위치 추적 시스템, 기지국 기반 위치 추적 시스템, 근거리 무선 신호 기반 위치 추적 시스템, 음파 신호 기반 위치 추적 시스템, 광 신호 기반 위치 추적 시스템 중 적어도 하나의 위치 추적 시스템 포함할 수 있다. 상기 사용자 단말은 뷰잉 맵을 통해 위치를 확인하고자 하는 사용자가 이용하는 컴퓨터 장치의 총칭으로서, 유선망에 연결된 컴퓨터, 노트북 등의 유선단말과, 무선망에 연결된 휴대폰, 스마트폰, 태블릿PC, 노트북 등의 무선단말을 중 적어도 하나를 포함할 수 있다. 바람직하게, 상기 사용자 단말은 운영서버와 연동하여 사용자 위치에 대응하는 지정된 표지를 뷰잉 맵 상의 표시 좌표에 표시하는 기능과, 지정된 실제 현실공간에 대응하는 제r 맵 영역을 포함하는 제r 뷰잉 맵 데이터를 상기 운영서버로 전송하는 기능을 위해 지정된 적어도 하나 이상의 절차를 수행하는 앱 (Application)이나 프로그램이 설치되어 구동되는 것이 바람직하다. 상기 운영자 단말은 운영자가 이용하는 컴퓨터 장치의 총칭으로서, 유선망에 연결된 컴퓨터, 노트북 등의 유선단말과, 무선망에 연결된 휴대폰, 스마트폰, 태블릿PC, 노트북 등의 무선단말을 중 적어도 하나를 포함할 수 있으며, 바람직하게, 상기 운영자 단말은 상기 운영서버가 본 발명에 따른 뷰잉 맵을 이용한 인공 지능 기반 위치를 표시하는 기능을 위해 지정된 적어도 하나 이상의 절차를 수행하는 앱(Application)이나 프로 그램이 설치되어 구동되는 것이 바람직하다. 한편, 도면1를 참조하면, 상기 운영서버는, 제r(r≥1) 뷰잉 맵(Viewing Map) 데이터를 등록받는 맵데이터 등록부와, 제r 실축척 맵(Actual Scale Map) 데이터를 확인하는 맵데이터 확인부와, 복수의 학습 데 이터를 학습한 인공지능모듈에 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 제r 실축척 맵 상의 위치 좌표 정보와 매칭된 제r 뷰잉 맵 상의 표시 좌표 정보를 확인하는 좌표정보 확인부와, 사용자 단말에 표시되는 뷰잉 맵 상의 표시 좌표에 상기 사용자 위치에 대응하는 지정된 표지를 표시하는 좌표정보 처리부를 포함하여 구성될 수 있다. 도면1에 따르면, 상기 맵데이터 등록부는, 지정된 제r(r≥1) 맵 영역에 대하여 사용자의 맵 인지율을 최적 화하기 위해 설정된 특유의 맵 표시 방식에 매칭되게 구성된 제r 뷰잉 맵(Viewing Map) 데이터를 데이터를 등록 받는다. 여기서, 상기 뷰잉 맵은, 지정된 지리적 위치나 구조에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 대응하는 지정된 왜곡이 포함된 맵을 포함할 수 있다. 또한, 상기 뷰잉 맵은, 지정된 지리적 위치나 구조에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특 유의 맵 표시 방식에 대응하는 선택적 강조, 확대, 축소, 변형, 생략 중 적어도 하나의 왜곡이 포함된 맵을 포 함할 수 있다. 또한, 상기 뷰잉 맵은, 실제 현실공간과 지정된 축척 관계를 유지하되 지정된 지리적 위치나 구조에 대하여 사 용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 대응하는 선택적 강조나 생략 중 적어도 하나의 왜곡이 포함된 실축척 기반 맵을 포함하거나, 실제 현실공간과의 축척 관계와 무관하게 지정된 지리적 위 치나 구조에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 대응하는 선택적 강 조, 확대, 축소, 변형, 생략 중 적어도 하나의 왜곡이 포함된 비실축척 기반 맵을 포함할 수 있다. 또한, 상기 뷰잉 맵은, 지정된 맵 표시 방식에 대응하는 약도, 3D구조 맵, 간략 맵, 버드뷰 맵, VR(Virtual Reality) 맵 중 적어도 하나의 맵을 포함할 수 있다. 한편, 상기 맵 표시 방식은, 약도 표시 방식, 3D구조 맵 표시 방식, 간략 맵 표시 방식, 버드뷰 맵 표시 방식, VR 맵 표시 방식 중 적어도 하나의 방식을 포함할 수 있다. 한편, 상기 뷰잉 맵 데이터는, 비트맵 구조의 맵 데이터, 벡터 드로잉 구조의 맵 데이터, 비트맵 구조와 벡터 드로잉 구조를 조합한 맵 데이터 중 어느 하나 이상을 포함할 수 있다. 또한, 상기 뷰잉 맵 데이터는, 맵 상에 표시된 적어도 하나의 지리적 위치나 구조에 대한 설명을 포함하는 메타 정보를 더 포함할 수 있다. 한편, 상기 맵데이터 등록부는, 사용자 단말과 연동하여 지정된 실제 현실공간에 대응하는 제r 맵 영 역을 포함하는 제r 뷰잉 맵 데이터를 수신할 수 있다. 또한, 상기 맵데이터 등록부는, 상기 제r 뷰잉 맵 데이터와 사용자 식별 정보를 매칭하여 운영DB에 저장할 수 있다. 도면1에 따르면, 상기 맵데이터 확인부는, 상기 맵데이터 등록부를 통해 제r 뷰잉 맵 데이터가 등록 되면, 지정된 실측 기반 측위 기술에 근거한 T(T≥1)개의 위치 추적 시스템에 대응하는 T개의 위치 추적 기반 좌표계와 매칭되거나 지정된 좌표계 변환을 통해 매칭 가능하면서 실제 현실공간과 지정된 축척 관계를 지닌 고 유 좌표계를 포함하는 실축척 맵(Actual Scale Map) 중 상기 제r 맵 영역과 허용 범위 내 매칭된 맵 영역을 포 함하는 제r 실축척 맵 데이터를 확인한다. 여기서, 상기 실축척 맵 데이터는, 비트맵 구조의 맵 데이터, 벡터 드로잉 구조의 맵 데이터, 비트맵 구조와 벡 터 드로잉 구조를 조합한 맵 데이터 중 어느 하나 이상을 포함할 수 있다. 또한, 상기 실축척 맵 데이터는, 맵에 대한 설명 또는 맵 상에 표시된 적어도 하나의 지리적 위치나 구조에 대 한 설명을 포함할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 맵데이터 확인부는, 지정된 실측 기반 측위 기술에 근거한 T개 의 위치 추적 시스템에 대응하는 T개의 위치 추적 기반 좌표계와 매칭되거나 지정된 좌표계 변환을 통해 매칭 가능하면서 실제 현실공간과 지정된 축척 관계를 지닌 고유 좌표계를 포함하는 제r 실축척 맵 데이터를 지 정된 관리DB에 저장할 수 있으며, 이 경우 상기 관리DB에 저장된 제r 실축척 맵 데이터 중 상기 제r 뷰잉 맵의 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하는 제r 실축척 맵 데이터를 확인할 수 있다. 도면1에 따르면, 상기 좌표정보 확인부는, 상기 맵데이터 확인부를 통해 지정된 t(1≤t≤T)개의 위치 추적 시스템을 통해 추적된 사용자 위치에 대응하는 제r 실축척 맵 상의 고유 좌표계 기반 위치 좌표 정보를 확인한 경우, 지정된 학습 대상 실축척 맵 상의 고유 좌표계에 대응하는 i(i≥1)개의 위치 좌표 정보를 입력 정보에 포함하고 상기 학습 대상 실축척 맵의 맵 영역과 매칭된 맵 영역을 지정된 맵 표시 방식으로 구성한 학 습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력 정보로 포함 하는 복수의 학습 데이터를 학습한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 실축척 맵 상의 위치 좌표 정보와 매칭된 제r 뷰잉 맵 상의 표시 좌표 정 보를 확인한다. 여기서, 상기 좌표정보 확인부는, 지정된 위치 추적 시스템을 통해 추적된 사용자 위치에 대응하는 제r 실축척 맵 상의 고유 좌표계 기반 위치 좌표 정보를 확인할 수 있다. 한편, 본 발명의 제r 뷰잉 맵 상의 표시 좌표 정보를 확인하는 제1 실시예에 따르면, 상기 좌표정보 확인부 는, 지정된 R(R≥1)개의 맵 영역에 대응하는 학습 대상 실축척 맵 상에 존재하는 i(i≥1)개의 위치 좌표 정보를 입력 정보에 포함하고 상기 학습 대상 실축척 맵의 맵 영역과 매칭된 맵 영역을 포함하여 지정된 맵 표 시 방식으로 구성된 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정 보를 출력 정보로 포함하는 복수의 학습 데이터를 지정된 인공지능모듈에 대입하여 학습시킬 수 있으며, 상기 제r 뷰잉 맵의 맵 표시 방식과 매칭된 맵 표시 방식으로 구성된 학습 대상 뷰잉 맵에 대응하는 복수의 학습 데 이터를 학습한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 뷰잉 맵 상의 표시 좌표 정보를 확인할 수 있다. 예컨대, 미리 지정된 맵 표시 방식으로 구 성된 학습 대상 뷰잉 맵과 학습 대상 실축척 맵에 대응하는 복수의 학습 데이터를 인공지능모듈에 학습시켜 이 용할 수 있다. 여기서, 학습 대상 뷰잉 맵과 학습 대상 실축척 맵에 대응하는 R개의 맵 영역은 사용자 위치에 대응하는 제r 맵 영역을 포함하도록 미리 설정하여 인공지능모듈을 학습시킬 수 있으나, 반드시 그렇지 않아도 무방하다. 만약 학습 대상 뷰잉 맵에 적용된 맵 표시 방식의 종류가 제r 뷰잉 맵에 적용된 맵 표시 방식 종류와 동일(또는 동등)하고, 학습 대상 뷰잉 맵에 적용된 맵 표시 방식에 대응하는 왜곡의 종류나 왜곡된 비율이 제r 뷰잉 맵에 적용된 맵 표시 방식에 대응하는 왜곡의 종류나 왜곡된 비율과 허용 범위 내 매칭된 경우, 학습 대상 뷰잉 맵과 학습 대상 실축척 맵에 대응하는 R개의 맵 영역은 제r 맵 영역을 반드시 포함하지 않더라도 무방하다. 예컨대, 학습 대상 뷰잉 맵이 3D구조 맵, 간략 맵, 버드뷰 맵, VR 맵 중 어느 하나이고, 제r 뷰잉 맵도 학습 대 상 뷰잉 맵과 일대일 매칭된 3D구조 맵, 간략 맵, 버드뷰 맵, VR 맵 중 어느 하나로서, 학습 대상 뷰잉 맵에 적 용된 맵 표시 방식의 종류 및 맵 표시 방식에 대응하는 왜곡의 종류나 왜곡된 비율이 제r 뷰잉 맵에 적용된 맵 표시 방식의 종류 및 맵 표시 방식에 대응하는 왜곡의 종류나 왜곡된 비율과 매칭(또는 허용 범위 내 매칭)된 경우, 학습 대상 뷰잉 맵과 학습 대상 실축척 맵에 대응하는 R개의 맵 영역은 제r 맵 영역을 반드시 포함하지 않더라도 무방하다. 또한, 학습 대상 뷰잉 맵이 약도인 경우라도 학습 대상 약도에 적용된 맵 표시 방식의 종류 및 맵 표시 방식에 대응하는 왜곡의 종류나 왜곡된 비율이 제r 뷰잉 맵에 적용된 맵 표시 방식의 종류 및 맵 표시 방식에 대응하는 왜곡의 종류나 왜곡된 비율이 매칭(또는 허용 범위 내 매칭)된다면, 학습 대상 뷰잉 맵과 학습 대상 실축척 맵 에 대응하는 R개의 맵 영역은 제r 맵 영역을 포함하지 않더라도 무방하다. 통상적으로 약도는 제각각의 맵 표시 방식으로 구성되는 것이 일반적이나, 이런 약도에 대응하는 학습 대상 뷰 잉 맵에 적용된 맵 표시 방식의 종류 및 맵 표시 방식에 대응하는 왜곡의 종류나 왜곡된 비율 중 어느 하나가 약도에 대응하는 제r 뷰잉 맵에 적용된 맵 표시 방식의 종류 및 맵 표시 방식에 대응하는 왜곡의 종류나 왜곡된 비율 중 어느 하나와 매칭(또는 허용 범위 내 매칭)되지 않는다면, 이런 학습 데이터를 학습한 인공지능모듈을 통해 약도에 대응하는 제r 뷰잉 맵 상의 표시 좌표 정보를 확인하기 난해할 수 있으며, 이 경우 학습 대상 뷰잉 맵과 제r 뷰잉 맵이 동일한(또는 동등한) 맵 표시 방식으로 구성된 약도인 경우에만 해당 인공지능모듈을 통해제r 뷰잉 맵 상의 표시 좌표 정보를 확인 가능하다. 본 발명의 제r 뷰잉 맵 상의 표시 좌표 정보를 확인하는 제2 실시예에 따르면, 상기 좌표정보 확인부는, 상기 제r 실축척 맵을 포함하는 학습 대상 실축척 맵 상에 존재하는 i(i≥1)개의 위치 좌표 정보를 입력 정보에 포함하고 상기 제r 뷰잉 맵을 포함하는 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥ 1)개의 표시 좌표 정보를 출력 정보로 포함하는 복수의 학습 데이터를 지정된 인공지능모듈에 대입하여 학습시 킬 수 있으며, 상기 학습된 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 뷰잉 맵 상의 표시 좌표 정보를 확인할 수 있다. 예컨대, 상기 맵데이터 등록부 를 통해 제r 뷰잉 맵이 확인되고 상기 맵데이터 확인부를 통해 제r 실축척 맵이 확인된 후, 상기 확 인된 제r 뷰잉 맵과 제r 실축척 맵에 대응하는 복수의 학습 데이터를 인공지능모듈에 학습시켜 이용할 수 있다. 즉 현재 확인된 제r 뷰잉 맵과 제r 실축척 맵에 대응하는 복수의 학습 데이터를 인공지능모듈에 학습시키므로, 제r 뷰잉 맵과 제r 실축척 맵을 확인할 때마다 인공지능모듈을 학습시켜야 하지만, 복잡한 경우의 수를 따질 필 요 없이 용이하게 구현할 수 있다. 한편, 상기 입력 정보는, 상기 학습 대상 뷰잉 맵의 종류를 식별 가능한 뷰잉 맵 종류 정보, 상기 학습 대상 뷰 잉 맵의 맵 표시 방식을 식별 가능한 뷰잉 맵 고유 정보 중 적어도 하나의 정보를 더 포함할 수 있다. 또한, 상기 입력 정보는, 상기 R개의 맵 영역을 식별 가능한 맵 영역 정보, 상기 R개의 맵 영역 중 상기 i개의 위치 좌표 정보에 대응하는 적어도 하나의 맵 영역을 식별하는 맵 영역 정보 중 적어도 하나의 정보를 더 포함 할 수 있다. 또한, 상기 입력 정보는, 상기 학습 대상 뷰잉 맵 상에 존재하는 M(M≥2)개의 랜드마크 중 지정된 m(1≤m≤M)개 의 랜드마크를 관측한 특징에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보와, 상기 학습 대상 실축척 맵 상의 지정된 지리적 위치나 구조에 대응하는 N(N≥2)개의 객체 중 상기 학습 대상 뷰잉 맵 상의 지정된 m개의 랜드마 크와 일대일 매칭된 n(1≤n≤N, n=m)개의 객체를 관측한 특징에 대응하는 실축척 맵 기반 n개의 객체 정보를 더 포함할 수 있다. 여기서, 상기 랜드마크는, 상기 학습 대상 뷰잉 맵 상의 지리적 위치나 구조 중 지정된 문자 표시나 기호 표시 와 연계된 지리적 위치나 구조를 포함할 수 있다. 예컨대, 학습 대상 뷰잉 맵 상의 지리적 위치나 구조 중 문자 나 기호가 붙은 것은 랜드마크로 인식/확인할 수 있다. 또한, 상기 랜드마크는, 상기 학습 대상 뷰잉 맵 상의 지리적 위치나 구조 중 강조 표시 또는 확대 표시된 지리 적 위치나 구조를 포함할 수 있다. 예컨대, 하습 대상 뷰잉 맵 상의 지리적 위치나 구조 중 두껍거나 진하게 강 조 표시되거나 다른 것보다 크게 확대 표시된 지리적 위치나 구조를 랜드마크로 인식/확인할 수 있다. 또한, 상기 랜드마크는, 상기 학습 대상 뷰잉 맵 상의 지리적 위치나 구조 중 비음영 처리되거나 활성화 표시된 지리적 위치나 구조를 포함할 수 있다. 예컨대, 학습 대상 뷰잉 맵 상에서 중요하지 않은 지리적 위치나 구조를 음영 처리하는 경우 비음영 처리되거나 활성화 표시된 지리적 위치나 구조를 랜드마크로 인식/확인할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 좌표정보 확인부는, 상기 학습 대상 뷰잉 맵 상에 존재하는 M 개의 랜드마크에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보를 확인하고, 상기 학습 대상 실축척 맵 상의 지정 된 지리적 위치나 구조에 대응하는 N개의 객체 중 상기 학습 대상 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n개의 객체에 대응하는 실축척 맵 기반 n개의 객체 정보를 확인할 수 있다. 상기 학습 대상 실축척 맵 기반 n개의 객체 정보를 확인하는 과정에서, 상기 좌표정보 확인부는, 상기 뷰 잉 맵을 패턴 인식하여 상기 뷰잉 맵 상에 존재하는 지정된 지리적 위치나 구조에 대응하는 M개의 랜드마크를 인식할 수 있다. 또한, 상기 학습 대상 실축척 맵 기반 n개의 객체 정보를 확인하는 과정에서, 상기 좌표정보 확인부는, 상 기 학습 대상 뷰잉 맵 데이터에 맵 상에 표시된 적어도 하나의 지리적 위치나 구조에 대한 설명을 포함하는 메 타 정보를 포함한 경우 상기 메타 정보를 근거로 상기 학습 대상 뷰잉 맵 상에 존재하는 지정된 지리적 위치나 구조에 대응하는 M개의 랜드마크를 확인할 수 있다. 한편, 상기 학습 대상 실축척 맵 상의 지정된 지리적 위치는, 인간 생활과 관련하여 나타낸 맵 상의 위치를 포 함할 수 있다. 또한, 상기 학습 대상 실축척 맵 상의 지정된 지리적 구조는, 일정한 설계에 따라 여러 가지 재료를 이용해 만 들어진 현실세계의 물건이나 상기 물건의 적어도 일부 영역을 맵 상에 표시하는 요소를 포함할 수 있다. 여기서 상기 지리적 구조는 일정한 설계에 따라 여러 가지 재료를 이용해 만들어진 현실세계의 건물, 다리, 축대, 터널 중 적어도 하나 또는 적어도 일부 영역을 맵 상에 표시하는 요소를 포함할 수 있다. 한편, 상기 학습 대상 실축척 맵 기반 n개의 객체 정보를 확인하는 과정에서, 상기 좌표정보 확인부는, 상 기 학습 대상 실축척 맵을 패턴 인식하여 상기 학습 대상 실축척 맵 상에 존재하는 지정된 지리적 위치나 구조 에 대응하는 N개의 객체를 인식할 수 있다. 또한, 상기 학습 대상 실축척 맵 기반 n개의 객체 정보를 확인하는 과정에서, 상기 좌표정보 확인부는, 상 기 학습 대상 실축척 맵 데이터에 맵 상에 표시된 적어도 하나의 지리적 위치나 구조에 대한 설명을 포함하는 메타 정보를 포함한 경우 상기 메타 정보를 근거로 상기 학습 대상 실축척 맵 상에 존재하는 지정된 지리적 위 치나 구조에 대응하는 N개의 객체를 확인할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 좌표정보 확인부는, 상기 학습 대상 실축척 맵 상에서 인식 또 는 확인된 N개의 객체 별 지리적 특성이나 N개의 객체 간 상관 관계와 상기 학습 대상 뷰잉 맵 상에서 인식 또 는 확인된 M개의 랜드마크 별 지리적 특성이나 M개의 랜드마크 간 상관 관계를 매칭 분석하여 상기 학습 대상 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n개의 객체를 인식할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 좌표정보 확인부는, 상기 학습 대상 실축척 맵 데이터에 맵 상 에 표시된 적어도 하나의 지리적 위치나 구조에 대한 설명을 포함하는 메타 정보를 포함한 경우 상기 메타 정보 를 근거로 상기 N개의 객체 중 상기 학습 대상 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n개의 객 체를 인식할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 좌표정보 확인부는, 상기 학습 대상 뷰잉 맵 데이터에 맵 상에 표시된 적어도 하나의 지리적 위치나 구조에 대한 설명을 포함하는 메타 정보를 포함하고 상기 학습 대상 실축 척 맵 데이터에 맵 상에 표시된 적어도 하나의 지리적 위치나 구조에 대한 설명을 포함하는 메타 정보를 포함한 경우 상기 학습 대상 뷰잉 맵 데이터의 메타 정보와 상기 학습 대상 실축척 맵 데이터의 메타 정보를 근거로 상 기 N개의 객체 중 상기 학습 대상 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n개의 객체를 인식할수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 좌표정보 확인부는, 지정된 학습 대상 뷰잉 맵 상의 지정된 랜 드마크에 대응하는 지정된 지리적 위치나 구조의 관측된 특징을 포함하고 상기 학습 대상 뷰잉 맵의 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하는 학습 대상 실축척 맵 상의 지정된 객체에 대응하는 지정된 지리적 위 치나 구조의 관측된 특징을 포함하는 입력 정보와 상기 학습 대상 실축척 맵 상의 객체 중 상기 학습 대상 뷰잉 맵 상의 랜드마크와 매칭된 객체를 관측한 결과에 대응하는 출력 정보를 포함하는 복수의 맵 별 복수의 학습 데 이터를 지정된 인공지능모듈에 대입하여 학습시킬 수 있으며, 상기 학습 대상 뷰잉 맵과 학습 대상 실축척 맵을 상기 인공지능모듈에 대입하여 학습 대상 실축척 맵 상의 객체 중 상기 학습 대상 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n개의 객체를 인식할 수 있다. 예컨대, 뷰잉 맵과 실축척 맵을 동시에 AI에 대입해 n 개의 객체를 일괄 확인할 수 있다. 한편, 본 발명의 실시 방법에 따른 상기 고유 위치 정보는, 상기 제r 뷰잉 맵의 종류를 식별 가능한 뷰잉 맵 종 류 정보, 상기 제r 뷰잉 맵의 맵 표시 방식을 식별 가능한 뷰잉 맵 고유 정보 중 적어도 하나의 정보를 더 포함 할 수 있다. 또한, 상기 고유 위치 정보는, 상기 제r 맵 영역을 식별 가능한 맵 영역 정보를 더 포함할 수 있다. 또한, 상기 고유 위치 정보는, 상기 제r 뷰잉 맵 상에 존재하는 M(M≥2)개의 랜드마크 중 지정된 m(1≤m≤M)개 의 랜드마크를 관측한 특징에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보와, 상기 제r 실축척 맵 상의 지정된 지리적 위치나 구조에 대응하는 N(N≥2)개의 객체 중 상기 제r 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n(1≤n≤N, n=m)개의 객체를 관측한 특징에 대응하는 실축척 맵 기반 n개의 객체 정보를 더 포함할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 랜드마크는, 상기 제r 뷰잉 맵 상의 지리적 위치나 구조 중 지정된 문자 표시나 기호 표시와 연계된 지리적 위치나 구조를 포함할 수 있다. 예컨대, 제r 뷰잉 맵 상의 지리적 위치 나 구조 중 문자나 기호가 붙은 것은 랜드마크로 인식/확인할 수 있다. 또한, 상기 랜드마크는, 상기 제r 뷰잉 맵 상의 지리적 위치나 구조 중 강조 표시 또는 확대 표시된 지리적 위 치나 구조를 포함할 수 있다. 예컨대, 제r 뷰잉 맵 상의 지리적 위치나 구조 중 두껍거나 진하게 강조 표시되거 나 다른 것보다 크게 확대 표시된 지리적 위치나 구조를 랜드마크로 인식/확인할 수 있다. 또한, 상기 랜드마크는, 상기 제r 뷰잉 맵 상의 지리적 위치나 구조 중 비음영 처리되거나 활성화 표시된 지리 적 위치나 구조를 포함할 수 있으며, 제r 뷰잉 맵 상에서 중요하지 않은 지리적 위치나 구조를 음영 처리하는 경우 비음영 처리되거나 활성화 표시된 지리적 위치나 구조를 랜드마크로 인식/확인할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 좌표정보 확인부는, 상기 제r 뷰잉 맵 상에 존재하는 M개의 랜 드마크에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보를 확인하고, 상기 제r 실축척 맵 상의 지정된 지리적 위 치나 구조에 대응하는 N개의 객체 중 상기 제r 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n개의 객 체에 대응하는 실축척 맵 기반 n개의 객체 정보를 확인할 수 있다. 여기서, 상기 좌표정보 확인부는, 상기 제r 뷰잉 맵을 패턴 인식하여 상기 제r 뷰잉 맵 상에 존재하는 지 정된 지리적 위치나 구조에 대응하는 M개의 랜드마크를 인식할 수 있다.또한, 상기 좌표정보 확인부는, 상기 제r 뷰잉 맵 데이터에 맵 상에 표시된 적어도 하나의 지리적 위치나 구조에 대한 설명을 포함하는 메타 정보를 포함한 경우 상기 메타 정보를 근거로 상기 제r 뷰잉 맵 상에 존재하 는 지정된 지리적 위치나 구조에 대응하는 M개의 랜드마크를 확인할 수 있다. 또한, 상기 좌표정보 확인부는, 상기 제r 실축척 맵을 패턴 인식하여 상기 제r 실축척 맵 상에 존재하는 지정된 지리적 위치나 구조에 대응하는 N개의 객체를 인식할 수 있다. 또한, 상기 좌표정보 확인부는, 상기 제r 실축척 맵 데이터에 맵 상에 표시된 적어도 하나의 지리적 위치 나 구조에 대한 설명을 포함하는 메타 정보를 포함한 경우 상기 메타 정보를 근거로 상기 제r 실축척 맵 상에 존재하는 지정된 지리적 위치나 구조에 대응하는 N개의 객체를 확인할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 좌표정보 확인부는, 상기 제r 실축척 맵 상에서 인식 또는 확 인된 N개의 객체 별 지리적 특성이나 N개의 객체 간 상관 관계와 상기 제r 뷰잉 맵 상에서 인식 또는 확인된 M 개의 랜드마크 별 지리적 특성이나 M개의 랜드마크 간 상관 관계를 매칭 분석하여 상기 제r 뷰잉 맵 상의 지정 된 m개의 랜드마크와 일대일 매칭된 n개의 객체를 인식할 수 있다. 또한, 상기 좌표정보 확인부는, 상기 제r 실축척 맵 데이터에 맵 상에 표시된 적어도 하나의 지리적 위치 나 구조에 대한 설명을 포함하는 메타 정보를 포함한 경우 상기 메타 정보를 근거로 상기 N개의 객체 중 상기 제r 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n개의 객체를 인식할 수 있다. 또한, 상기 좌표정보 확인부는, 상기 제r 뷰잉 맵 데이터에 맵 상에 표시된 적어도 하나의 지리적 위치나 구조에 대한 설명을 포함하는 메타 정보를 포함하고 상기 제r 실축척 맵 데이터에 맵 상에 표시된 적어도 하나 의 지리적 위치나 구조에 대한 설명을 포함하는 메타 정보를 포함한 경우 상기 제r 뷰잉 맵 데이터의 메타 정보 와 상기 제r 실축척 맵 데이터의 메타 정보를 근거로 상기 N개의 객체 중 상기 제r 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n개의 객체를 인식할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 좌표정보 확인부는, 지정된 제r 뷰잉 맵 상의 지정된 랜드마크 에 대응하는 지정된 지리적 위치나 구조의 관측된 특징을 포함하고 상기 제r 뷰잉 맵의 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하는 제r 실축척 맵 상의 지정된 객체에 대응하는 지정된 지리적 위치나 구조의 관측된 특징을 포함하는 입력 정보와 상기 제r 실축척 맵 상의 객체 중 상기 제r 뷰잉 맵 상의 랜드마크와 매칭된 객체 를 관측한 결과에 대응하는 출력 정보를 포함하는 복수의 맵 별 복수의 학습 데이터를 지정된 인공지능모듈에 대입하여 학습시킬 수 있으며, 상기 제r 뷰잉 맵과 제r 실축척 맵을 상기 인공지능모듈에 대입하여 제r 실축척 맵 상의 객체 중 상기 제r 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n개의 객체를 인식할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 뷰잉 맵 데이터는, 비트맵 구조의 맵 데이터를 포함할 수 있으며, 상기 뷰잉 맵 기반 표시 좌표 정보는, 상기 비트맵 구조 상의 픽셀 위치에 대응하는 픽셀 좌표계를 포함하는 화 면 표시 좌표계 기반의 좌표 정보를 포함할 수 있다. 여기서 뷰잉 맵 기반 표시 좌표 정보는, 맵 상의 위치 좌 표 정보와 다르게 비트맵 데이터(예컨대, 이미지 컨텐츠)를 통해 화면에 표시되는 픽셀에 대응하는 좌표를 의미 한다. 또한, 본 발명의 실시 방법에 따르면, 상기 뷰잉 맵 데이터는, 벡터 드로잉 구조의 맵 데이터를 포함할 수 있으 며, 상기 뷰잉 맵 기반 표시 좌표 정보는, 상기 벡터 드로잉 구조의 크기와 방향을 해석 가능한 벡터 드로잉 좌표계를 포함하는 화면 표시 좌표계 기반의 좌표 정보를 포함할 수 있다. 여기서 뷰잉 맵 기반 표시 좌표 정보는, 맵 상의 위치 좌표 정보와 다르게 벡터 드로잉 데이터에 의해 화면에 표시되는 점, 선, 면 등에 대응하 는 좌표를 의미한다. 도면1에 따르면, 상기 좌표정보 처리부는, 상기 좌표정보 확인부를 통해 복수의 학습 데이터를 학습 한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상 기 제r 실축척 맵 상의 위치 좌표 정보와 매칭된 제r 뷰잉 맵 상의 표시 좌표 정보가 확인되면, 사용자 단말 에 표시되는 뷰잉 맵 상의 표시 좌표에 상기 사용자 위치에 대응하는 지정된 표지를 표시하도록 처리한다. 여기서, 상기 표지는, 사용자의 위치에 대응하는 그림, 도형, 기호, 문자 중 적어도 하나를 포함할 수 있다. 도면2는 본 발명의 실시 방법에 따라 실축척 맵 중 제r 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하는 제r 실축척 맵 데이터를 확인하는 과정을 도시한 흐름도이다. 보다 상세하게 본 도면2는 운영서버에서 지정된 제r(r≥1) 맵 영역에 대하여 제r 뷰잉 맵(Viewing Map) 데 이터를 등록받고, 실축척 맵(Actual Scale Map) 중 상기 제r 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하"}
{"patent_id": "10-2022-0054277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "는 제r 실축척 맵 데이터를 확인하는 과정을 도시한 것으로서, 본 발명이 속한 기술분야에서 통상의 지식을 가 진 자라면, 본 도면2를 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방법(예컨대, 일부 단계가 생략되 거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방법을 포 함하여 이루어지며, 본 도면2에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 도면2를 참조하면, 운영서버는 지정된 제r(r≥1) 맵 영역에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 매칭되게 구성된 제r 뷰잉 맵(Viewing Map) 데이터를 등록받는데, 사용자 단말 과 연동하여 지정된 실제 현실공간에 대해 제작된 제r 뷰잉 맵 데이터를 수신한다. 상기 지정된 실제 현실공간에 대해 제작된 제r 뷰잉 맵 데이터가 수신되면, 상기 운영서버는 상기 제r 뷰 잉 맵 데이터와 사용자 식별 정보를 매칭하여 운영DB에 저장한다. 여기서, 상기 뷰잉 맵은, 지정된 지리적 위치나 구조에 대하여 사용자의 맵 인지율을 최적화하기 위해 설정된 특유의 맵 표시 방식에 대응하는 지정된 왜곡이 포함된 맵을 포함할 수 있다. 또한, 상기 뷰잉 맵은, 지정된 맵 표시 방식에 대응하는 약도, 3D구조 맵, 간략 맵, 버드뷰 맵, VR(Virtual Reality) 맵 중 적어도 하나의 맵을 포함할 수 있다. 상기 뷰잉 맵 데이터가 등록되면, 상기 운영서버는 지정된 실측 기반 측위 기술에 근거한 T(T≥1)개의 위 치 추적 시스템에 대응하는 T개의 위치 추적 기반 좌표계와 매칭되거나 지정된 좌표계 변환을 통해 매칭 가능하 면서 실제 현실공간과 지정된 축척 관계를 지닌 고유 좌표계를 포함하는 제r 실축척 맵 데이터를 지정된 관리DB 에 저장한다. 상기 제r 실축척 맵 데이터가 저장되면, 상기 운영서버는 상기 관리DB에 저장된 제r 실축척 맵 데이터 중 상기 제r 뷰잉 맵의 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하는 제r 실축척 맵 데이터를 확인한다 .도면3은 본 발명의 실시 방법에 따라 사용자 단말에 표시되는 뷰잉 맵 상의 표시 좌표에 상기 사용자 위치에 대 응하는 지정된 표지를 표시하는 과정을 도시한 흐름도이다. 보다 상세하게 본 도면3은 상기 도면2의 과정 이후, 복수의 학습 데이터를 학습한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 실축척 맵 상의 위치 좌표 정보와 매칭된 제r 뷰잉 맵 상의 표시 좌표 정보를 확인한 후, 사용자 단말에 표시되는 뷰잉 맵 상의 표시 좌표에 상기 사용자 위치에 대응하는 지정된 표지를 표시하는 과정을 도시한 것으로서, 본 발명이 속한 기술분 야에서 통상의 지식을 가진 자라면, 본 도면3을 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방법(예 컨대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추 되는 모든 실시 방법을 포함하여 이루어지며, 본 도면3에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 도면3을 참조하면, 운영서버는 상기 도면2의 과정을 통해 지정된 t(1≤t≤T)개의 위치 추적 시스템을 통해 추적된 사용자 위치에 대응하는 제r 실축척 맵 상의 고유 좌표계 기반 위치 좌표 정보를 확인한다. 그리고, 상기 운영서버는 지정된 학습 대상 실축척 맵 상의 고유 좌표계에 대응하는 i(i≥1)개의 위치 좌 표 정보를 입력 정보에 포함하고 상기 학습 대상 실축척 맵의 맵 영역과 매칭된 맵 영역을 지정된 맵 표시 방식 으로 학습 대상 뷰잉 맵을 구성한다. 상기 학습 대상 뷰잉 맵이 구성되면, 상기 운영서버는 상기 구성한 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력 정보로 포함하는 복수의 학습 데이터를 학습한 인 공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입한다. 그리고, 상기 운영서버는 상기 제r 실축척 맵 상의 위치 좌표 정보와 매칭된 제r 뷰잉 맵 상의 표시 좌표 정보를 확인한다. 본 발명의 실시 방법에 따르면, 상기 운영서버는 지정된 R(R≥1)개의 맵 영역에 대응하는 학습 대상 실축 척 맵 상에 존재하는 i(i≥1)개의 위치 좌표 정보를 입력 정보에 포함하고 상기 학습 대상 실축척 맵의 맵 영역 과 매칭된 맵 영역을 포함하여 지정된 맵 표시 방식으로 구성된 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌 표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력 정보로 포함하는 복수의 학습 데이터를 지정된 인공지능 모듈에 대입하여 학습시킬 수 있으며, 상기 제r 뷰잉 맵의 맵 표시 방식과 매칭된 맵 표시 방식으로 구성된 학 습 대상 뷰잉 맵에 대응하는 복수의 학습 데이터를 학습한 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위 치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 뷰잉 맵 상의 표시 좌표 정보를 확인할 수 있다. 또한, 본 발명의 다른 실시 방법에 따르면, 상기 운영서버는 상기 제r 실축척 맵을 포함하는 학습 대상 실 축척 맵 상에 존재하는 i(i≥1)개의 위치 좌표 정보를 입력 정보에 포함하고 상기 제r 뷰잉 맵을 포함하는 학습 대상 뷰잉 맵 상에서 상기 i개의 위치 좌표 정보와 매칭된 j(j≥1)개의 표시 좌표 정보를 출력 정보로 포함하는 복수의 학습 데이터를 지정된 인공지능모듈에 대입하여 학습시킬 수 있으며, 상기 학습된 인공지능모듈에 상기 확인된 제r 실축척 맵 상의 위치 좌표 정보를 포함하는 고유 위치 정보를 대입하여 상기 제r 뷰잉 맵 상의 표시 좌표 정보를 확인할 수 있다. 예컨대, 상기 맵데이터 등록부를 통해 제r 뷰잉 맵이 확인되고 상기 맵데이 터 확인부를 통해 제r 실축척 맵이 확인된 후, 상기 확인된 제r 뷰잉 맵과 제r 실축척 맵에 대응하는 복수 의 학습 데이터를 인공지능모듈에 학습시켜 이용할 수 있다.여기서, 상기 인공지능모듈에 대입되는 상기 입력 정보는, 상기 학습 대상 뷰잉 맵의 종류를 식별 가능한 뷰잉 맵 종류 정보, 상기 학습 대상 뷰잉 맵의 맵 표시 방식을 식별 가능한 뷰잉 맵 고유 정보 중 적어도 하나의 정 보를 더 포함할 수 있다. 또한, 상기 입력 정보는, 상기 R개의 맵 영역을 식별 가능한 맵 영역 정보, 상기 R개의 맵 영역 중 상기 i개의 위치 좌표 정보에 대응하는 적어도 하나의 맵 영역을 식별하는 맵 영역 정보 중 적어도 하나의 정보를 더 포함 할 수 있다. 또한, 상기 입력 정보는, 상기 학습 대상 뷰잉 맵 상에 존재하는 M(M≥2)개의 랜드마크 중 지정된 m(1≤m≤M)개 의 랜드마크를 관측한 특징에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보와, 상기 학습 대상 실축척 맵 상의 지정된 지리적 위치나 구조에 대응하는 N(N≥2)개의 객체 중 상기 학습 대상 뷰잉 맵 상의 지정된 m개의 랜드마 크와 일대일 매칭된 n(1≤n≤N, n=m)개의 객체를 관측한 특징에 대응하는 실축척 맵 기반 n개의 객체 정보를 더 포함할 수 있다. 또한, 본 발명의 실시 방법에 따른 상기 고유 위치 정보는, 상기 제r 뷰잉 맵의 종류를 식별 가능한 뷰잉 맵 종 류 정보, 상기 제r 뷰잉 맵의 맵 표시 방식을 식별 가능한 뷰잉 맵 고유 정보 중 적어도 하나의 정보를 더 포함 할 수 있다. 또한, 상기 고유 위치 정보는, 상기 제r 맵 영역을 식별 가능한 맵 영역 정보를 더 포함할 수 있다. 또한, 상기 고유 위치 정보는, 상기 제r 뷰잉 맵 상에 존재하는 M(M≥2)개의 랜드마크 중 지정된 m(1≤m≤M)개 의 랜드마크를 관측한 특징에 대응하는 뷰잉 맵 기반 m개의 랜드마크 정보와, 상기 제r 실축척 맵 상의 지정된 지리적 위치나 구조에 대응하는 N(N≥2)개의 객체 중 상기 제r 뷰잉 맵 상의 지정된 m개의 랜드마크와 일대일 매칭된 n(1≤n≤N, n=m)개의 객체를 관측한 특징에 대응하는 실축척 맵 기반 n개의 객체 정보를 더 포함할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 뷰잉 맵 데이터는, 비트맵 구조의 맵 데이터를 포함할 수 있으며, 상기 뷰잉 맵 기반 표시 좌표 정보는, 상기 비트맵 구조 상의 픽셀 위치에 대응하는 픽셀 좌표계를 포함하는 화 면 표시 좌표계 기반의 좌표 정보를 포함할 수 있다. 여기서 뷰잉 맵 기반 표시 좌표 정보는, 맵 상의 위치 좌 표 정보와 다르게 비트맵 데이터(예컨대, 이미지 컨텐츠)를 통해 화면에 표시되는 픽셀에 대응하는 좌표를 의미 한다. 또한, 본 발명의 다른 실시 방법에 따르면, 상기 뷰잉 맵 데이터는, 벡터 드로잉 구조의 맵 데이터를 포함할 수 있으며, 상기 뷰잉 맵 기반 표시 좌표 정보는, 상기 벡터 드로잉 구조의 크기와 방향을 해석 가능한 벡터 드로 잉 좌표계를 포함하는 화면 표시 좌표계 기반의 좌표 정보를 포함할 수 있다. 여기서 뷰잉 맵 기반 표시 좌표 정보는, 맵 상의 위치 좌표 정보와 다르게 벡터 드로잉 데이터에 의해 화면에 표시되는 점, 선, 면 등에 대응하 는 좌표를 의미한다. 상기와 같이 사용자 위치에 대응하는 실축척 맵 상의 고유 좌표계 기반 위치 좌표 정보가 확인되면, 상기 운영 서버는 상기 실축척 맵 상의 위치 좌표 정보를 상기 고유 변환 규칙에 대입하여 상기 뷰잉 맵 상의 표시 좌표 정보를 확인한다. 그리고, 상기 운영서버는 사용자 단말에 표시되는 뷰잉 맵 상의 표시 좌표에 상기 사용자 위치에 대 응하는 지정된 표지를 표시한다."}
{"patent_id": "10-2022-0054277", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 방법에 따른 뷰잉 맵을 이용한 인공지능 기반 위치 표시 시스템의 구성을 도시한 도면이 다. 도 2는 본 발명의 실시 방법에 따라 실축척 맵 중 제r 맵 영역과 허용 범위 내 매칭된 맵 영역을 포함하는 제r 실축척 맵 데이터를 확인하는 과정을 도시한 흐름도이다. 도 3은 본 발명의 실시 방법에 따라 사용자 단말에 표시되는 뷰잉 맵 상의 표시 좌표에 상기 사용자 위치에 대 응하는 지정된 표지를 표시하는 과정을 도시한 흐름도이다."}
