{"patent_id": "10-2023-0153927", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0020265", "출원번호": "10-2023-0153927", "발명의 명칭": "예약 확률 기반의 판매가 조정 장치 및 그 제어 방법", "출원인": "주식회사 야놀자", "발명자": "박이레"}}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "객실 판매가 조정과 관련된 기계 학습(Machine learning) 모델을 학습시키기 위한 객실 데이터를 수신하는 통신부;상기 객실 데이터를 저장하는 메모리; 및상기 객실 데이터에서 객실 판매가 조정을 위한 특징(feature)을 추출하여 전처리 데이터를 생성하고,상기 전처리 데이터를 학습 데이터로 사용하는 객실 예약 확률 결정 모델 및 객실 판매가 조정 모델을생성하고,상기 객실 예약 확률 결정 모델에 상기 객실 데이터를 입력하여 객실 예약 확률을 출력값으로 도출하고, 도출된상기 객실 예약 확률을 상기 객실 판매가 조정 모델에 입력하여, 객실 판매가 조정 데이터를 출력값으로 도출하는 제어부;를 포함하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제어부는상기 객실 예약 확률에 기초하여 상품 수요 지표 및 지역 수요 지표를 결정하고, 상기 상품 수요 지표 및 상기지역 수요 지표를 상기 객실 판매가 조정 모델에 입력하여 상기 객실 판매가 조정 데이터를 출력값으로 도출하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 제어부는,객실 예측 예약율(sale rate) 및 객실 픽업률(pickup rate)을 포함하는 업체 수요 지표와 객실 수요 지표의 평균값을 상기 상품 수요 지표로 결정하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 객실 예약 확률 결정 모델은,객실별로 특정 투숙일에 예약이 발생할 확률을 예측하는 예약 발생 확률 예측 모델과 업체별로 특정 투숙일에예약이 발생하는 건수를 예측하는 예약 발생 건수 예측 모델을 포함하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 제어부는,상기 객실 데이터를 상기 예약 발생 건수 예측 모델에 입력하여 객실의 예측 예약 건수를 출력하고, 상기 객실의 예측 예약 건수를 잔여 객실수로 나누어 상기 객실 예측 예약율을 결정하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서,상기 제어부는,공개특허 10-2025-0020265-3-상기 객실 데이터에서 실제 판매된 객실수를 총 객실수로 나누어 상기 객실 픽업률을 결정하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 4에 있어서,상기 제어부는,상기 객실 데이터를 상기 예약 발생 확률 예측 모델에 입력하여 객실의 예약 확률을 출력하고, 상기 객실의 예약 확률을 상기 객실 수요 지표로 결정하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 2에 있어서,상기 객실 판매가 조정 모델은,상기 상품 수요 지표 및 상기 지역 수요 지표를 변수로 가지는 AEEF (Asymmetric Exponent-Exponential Form)모델을 포함하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 제어부는,상기 통신부를 통해 객실 최저 가격선 및 객실 간 가격 우선 순위 중 적어도 하나를 수신한 것에 기초하여, 상기 객실 판매가 조정 데이터를 수정하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 제어부는,상기 객실 판매가 조정 데이터에서 사용자의 쿠폰 사용액을 제외한 금액에 기초하여 상기 객실 판매가 조정 데이터를 수정하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서,상기 제어부는,상기 객실 판매가 조정 데이터를 외부 장치로 전송하는 서버 장치."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "에 있어서,상기 객실 판매가 조정 데이터에서 사용자의 쿠폰 사용액을 제외한 금액에 기초하여 상기 객실 판매가 조정 데이터를 인하하는 것;을 더 포함하는 서버 장치의 제어 방법."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,상기 객실 판매가 조정 데이터를 출력값으로 도출하는 것은,공개특허 10-2025-0020265-4-상기 객실 예약 확률에 기초하여 상품 수요 지표 및 지역 수요 지표를 결정하고, 상기 상품 수요 지표 및 상기지역 수요 지표를 상기 객실 판매가 조정 모델에 입력하여 상기 객실 판매가 조정 데이터를 출력값으로 도출하는 서버 장치의 제어 방법."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,상기 상품 수요 지표를 결정하는 것은,객실 예측 예약율(sale rate) 및 객실 픽업률(pickup rate)을 포함하는 업체 수요 지표와 객실 수요 지표의 평균값을 상기 상품 수요 지표로 결정하는 서버 장치의 제어 방법."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서,상기 객실 예약 확률 결정 모델은,객실별로 특정 투숙일에 예약이 발생할 확률을 예측하는 예약 발생 확률 예측 모델과 업체별로 특정 투숙일에예약이 발생하는 건수를 예측하는 예약 발생 건수 예측 모델을 포함하는 서버 장치의 제어 방법."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서,상기 객실 예측 예약율을 예측하는 것은,상기 객실 데이터를 상기 예약 발생 건수 예측 모델에 입력하여 객실의 예측 예약 건수를 출력하고, 상기 객실의 예측 예약 건수를 잔여 객실수로 나누어 상기 객실 예측 예약율을 결정하는 서버 장치의 제어 방법."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 15에 있어서,상기 객실 픽업률을 결정하는 것은,상기 객실 데이터에서 실제 판매된 객실수를 총 객실수로 나누어 상기 객실 픽업률을 결정하는 서버 장치의 제어 방법."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 15에 있어서,상기 객실 수요 지표를 결정하는 것은,상기 객실 데이터를 상기 예약 발생 확률 예측 모델에 입력하여 객실의 예약 확률을 출력하고, 상기 객실의 예약 확률을 상기 객실 수요 지표로 결정하는 서버 장치의 제어 방법."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 13에 있어서,상기 객실 판매가 조정 모델은,상기 상품 수요 지표 및 상기 지역 수요 지표를 변수로 가지는 AEEF (Asymmetric Exponent-Exponential Form)모델을 포함하는 서버 장치의 제어 방법."}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 12에 있어서,통신부를 통해 객실 최저 가격선 및 객실 간 가격 우선 순위 중 적어도 하나를 수신한 것에 기초하여, 상기 객실 판매가 조정 데이터를 수정하는 것;을 더 포함하는 서버 장치의 제어 방법.공개특허 10-2025-0020265-5-청구항 21"}
{"patent_id": "10-2023-0153927", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 12에 있어서,상기 객실 판매가 조정 데이터를 외부 장치로 전송하는 것;을 더 포함하는 서버 장치의 제어 방법."}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시된 서버 장치는, 객실 판매가 조정과 관련된 기계 학습(Machine learning) 모델을 학습시키기 위 한 객실 데이터를 수신하는 통신부 상기 객실 데이터를 저장하는 메모리, 상기 객실 데이터에서 객실 판매가 조 정을 위한 특징(feature)을 추출하여 전처리 데이터를 생성하고, 상기 전처리 데이터를 학습 데이터로 사용하는 객실 예약 확률 결정 모델 및 객실 판매가 조정 모델을 생성하고, 상기 객실 예약 확률 결정 모델에 상기 객실 데이터를 입력하여 객실 예약 확률을 출력값으로 도출하고, 상기 객실 예약 확률을 상기 객실 판매가 조정 모델 에 입력하여, 객실 판매가 조정 데이터를 출력값으로 도출하고, 상기 객실 판매가 조정 데이터를 외부 장치로 전 송하는 제어부를 포함한다."}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 실시예들은 객실 판매가를 동적으로 조정하기 위한 서버 장치 및 서버 장치의 제어 방법에 관 한 것이다."}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "숙박 상품은 단기적으로 공급량을 늘리거나 줄일 수 없고 판매 마감 시간이 정해져 있는 특징이 있으며, 숙박 상품을 판매하는 판매자들은 판매가를 최적화하여 수익을 극대화하는 것을 목표로 한다. 특히, 숙박 상품 중에 서 날짜나 시간에 따라 수요의 변동이 큰 숙박 상품일수록 이에 대응하여 판매가를 조정할 수 있어야 더 높은 매출을 올릴 수 있다. 예를 들면, 수요가 낮은 시간대에는 판매가를 인하해야 판매 확률이 증가되며, 수요가 높은 시간대에는 판매가 를 인상해도 판매 확률이 떨어지지 않는다. 하지만 일반적인 판매가 제안 시스템은 급변하는 수요를 정확히 측 정하거나 예측하지 못하여 최적의 판매가를 책정하는데 한계점이 있다. 또한, 숙박 상품의 가격을 동적으로 조정하는 경쟁 객실 모델의 경우, 제안 가격이 실제 판매 가격과 많은 차이 를 보이며 모델의 성능을 높이는 고도화 작업에도 한계가 있으므로, 새로운 모델의 도입이 필요하다."}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 문서에 개시된 일 실시예에 따르면, 객실 데이터에 기초하여 머신 러닝 알고리즘으로 객실의 판매가를 동적 으로 조정하는 서버 장치 및 서버 장치의 제어 방법을 제공한다. 본 문서에 개시된 실시예들의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않 은 또 다른 기술적 과제들은 아래의 기재들로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 서버 장치는, 객실 판매가 조정과 관련된 기계 학습(Machine learning) 모델을 학습시키기 위 한 객실 데이터를 수신하는 통신부, 상기 객실 데이터를 저장하는 메모리, 상기 객실 데이터에서 객실 판매가 조정을 위한 특징(feature)을 추출하여 전처리 데이터를 생성하고, 상기 전처리 데이터를 학습 데이터로 사용하 는 객실 예약 확률 결정 모델 및 객실 판매가 조정 모델을 생성하고, 상기 객실 예약 확률 결정 모델에 상기 객 실 데이터를 입력하여 객실 예약 확률을 출력값으로 도출하고, 도출된 상기 객실 예약 확률을 상기 객실 판매가 조정 모델에 입력하여, 객실 판매가 조정 데이터를 출력값으로 도출하는 제어부를 포함한다. 상기 제어부는 상기 객실 예약 확률에 기초하여 상품 수요 지표 및 지역 수요 지표를 결정하고, 상기 상품 수요 지표 및 상기 지역 수요 지표를 상기 객실 판매가 조정 모델에 입력하여 상기 객실 판매가 조정 데이터를 출력 값으로 도출할 수 있다. 상기 제어부는, 객실 예측 예약율(sale rate) 및 객실 픽업률(pickup rate)을 포함하는 업체 수요 지표와 객실 수요 지표의 평균값을 상기 상품 수요 지표로 결정할 수 있다.상기 객실 예약 확률 결정 모델은, 객실별로 특정 투숙일에 예약이 발생할 확률을 예측하는 예약 발생 확률 예 측 모델과 업체별로 특정 투숙일에 예약이 발생하는 건수를 예측하는 예약 발생 건수 예측 모델을 포함할 수 있 다. 상기 제어부는, 상기 객실 데이터를 상기 예약 발생 건수 예측 모델에 입력하여 객실의 예측 예약 건수를 출력 하고, 상기 객실의 예측 예약 건수를 잔여 객실수로 나누어 상기 객실 예측 예약율을 결정할 수 있다. 상기 제어부는, 상기 객실 데이터에서 실제 판매된 객실수를 총 객실수로 나누어 상기 객실 픽업률을 결정할 수 있다. 상기 제어부는, 상기 객실 데이터를 상기 예약 발생 확률 예측 모델에 입력하여 객실의 예약 확률을 출력하고, 상기 객실의 예약 확률을 상기 객실 수요 지표로 결정할 수 있다. 상기 객실 판매가 조정 모델은, 상기 상품 수요 지표 및 상기 지역 수요 지표를 변수로 가지는 AEEF (Asymmetric Exponent-Exponential Form) 모델을 포함할 수 있다. 상기 제어부는, 상기 통신부를 통해 객실 최저 가격선 및 객실 간 가격 우선 순위 중 적어도 하나를 수신한 것 에 기초하여, 상기 객실 판매가 조정 데이터를 수정할 수 있다. 상기 제어부는, 상기 객실 판매가 조정 데이터에서 사용자의 쿠폰 사용액을 제외한 금액에 기초하여 상기 객실 판매가 조정 데이터를 수정할 수 있다. 상기 제어부는, 상기 객실 판매가 조정 데이터를 외부 장치로 전송할 수 있다. 일 실시예에 따른 서버 장치의 제어 방법은, 객실 판매가 조정과 관련된 기계 학습(Machine learning) 모델을 학습시키기 위한 객실 데이터를 수신하고, 상기 객실 데이터에서 객실 판매가 조정을 위한 특징(feature)을 추 출하여 전처리 데이터를 생성하고, 상기 전처리 데이터를 학습 데이터로 사용하는 객실 예약 확률 결정 모델 및 객실 판매가 조정 모델을 생성하고, 상기 객실 예약 확률 결정 모델에 상기 객실 데이터를 입력하여 객실 예약 확률을 출력값으로 도출하고, 상기 객실 예약 확률을 상기 객실 판매가 조정 모델에 입력하여, 객실 판매가 조 정 데이터를 출력값으로 도출하고, 상기 객실 판매가 조정 데이터를 외부 장치로 전송하는 것을 포함할 수 있다. 상기 객실 판매가 조정 데이터를 출력값으로 도출하는 것은, 상기 객실 예약 확률에 기초하여 상품 수요 지표 및 지역 수요 지표를 결정하고, 상기 상품 수요 지표 및 상기 지역 수요 지표를 상기 객실 판매가 조정 모델에 입력하여 상기 객실 판매가 조정 데이터를 출력값으로 도출할 수 있다. 상기 상품 수요 지표를 결정하는 것은, 객실 예측 예약율(sale rate) 및 객실 픽업률(pickup rate)을 포함하는 업체 수요 지표와 객실 수요 지표의 평균값을 상기 상품 수요 지표로 결정할 수 있다. 상기 객실 예약 확률 결정 모델은, 객실별로 특정 투숙일에 예약이 발생할 확률을 예측하는 예약 발생 확률 예 측 모델과 업체별로 특정 투숙일에 예약이 발생하는 건수를 예측하는 예약 발생 건수 예측 모델을 포함할 수 있 다. 상기 객실 예측 예약율을 예측하는 것은, 상기 객실 데이터를 상기 예약 발생 건수 예측 모델에 입력하여 객실 의 예측 예약 건수를 출력하고, 상기 객실의 예측 예약 건수를 잔여 객실수로 나누어 상기 객실 예측 예약율을 결정할 수 있다. 상기 객실 픽업률을 결정하는 것은, 상기 객실 데이터에서 실제 판매된 객실수를 총 객실수로 나누어 상기 객실 픽업률을 결정할 수 있다. 상기 객실 수요 지표를 결정하는 것은, 상기 객실 데이터를 상기 예약 발생 확률 예측 모델에 입력하여 객실의 예약 확률을 출력하고, 상기 객실의 예약 확률을 상기 객실 수요 지표로 결정할 수 있다. 상기 객실 판매가 조정 모델은, 상기 상품 수요 지표 및 상기 지역 수요 지표를 변수로 가지는 AEEF (Asymmetric Exponent-Exponential Form) 모델을 포함할 수 있다. 일 실시예에 따른 서버 장치의 제어 방법은, 통신부를 통해 객실 최저 가격선 및 객실 간 가격 우선 순위 중 적 어도 하나를 수신한 것에 기초하여, 상기 객실 판매가 조정 데이터를 수정하는 것을 더 포함할 수 있다. 일 실시예에 따른 서버 장치의 제어 방법은, 상기 객실 판매가 조정 데이터에서 사용자의 쿠폰 사용액을 제외한 금액에 기초하여 상기 객실 판매가 조정 데이터를 인하하는 것을 더 포함할 수 있다. 일 실시예에 따른 서버 장치의 제어 방법은, 상기 객실 판매가 조정 데이터를 외부 장치로 전송할 수 있다."}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따른 서버 장치에 의하면, 상권 수요의 변화에 맞춘 판매가 조정 자동화를 통해 판매자의 인적 리 소스에 대한 비용을 감소시키고, 매출액을 극대화할 수 있다."}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 문서에 개시된 다양한 실시 예들에 대해 상세히 설명하고자 한다. 본 문서에 서 도면상의 동일한 구성 요소에 대해서는 동일한 참조 부호를 사용하고 동일한 구성요소에 대해서 중복된 설명 은 생략한다. 본 문서에 개시되어 있는 다양한 실시 예들에 대해서, 특정한 구조적 내지 기능적 설명들은 단지 실시 예들을 설명하기 위한 목적으로 예시된 것으로, 본 문서에 개시된 다양한 실시 예들은 여러 가지 형태로 실시될 수 있 으며 본 문서에 설명된 실시 예들에 한정되는 것으로 해석되어서는 아니 된다. 다양한 실시 예에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/ 또는 중요도에 상관없이 수식할 수 있고, 해당 구성 요소들을 한정하지 않는다. 예를 들면, 본 문서에 개시된 실시예의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성 요소로 명명될 수 있고, 유사하게 제2 구성 요소도 제1 구성 요소로 바꾸어 명명될 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 문서에 개시된 실시예들의 기술 분 야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용 되는 사전에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석 될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는 다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서에 개시된 실시 예들을 배제하도록 해석될 수 없 다. 이하 첨부된 도면들을 참고하여 본 발명의 작용 원리 및 실시예에 대해 설명한다. 도 1은 일 실시예에 따른 서버 장치의 제어 블록도를 도시한다. 도 1을 참조하면, 일 실시예에 따른 서버 장치는 적어도 하나의 프로세서와 메모리를 포함하는 제 어부 및 통신부를 포함하고, 통신부를 통해 외부 장치와 통신하여 객실 가격을 동적으로 조 정할 수 있다. 일 실시예에 따른 서버 장치는 워크스테이션(workstation), 클라우드(cloud), 데이터 드라이브(data drive), 데이터 스테이션(data station) 등 다양한 컴퓨팅 디바이스로 구현될 수 있다. 또한, 서버 장치는 기능, 기능의 세부 구성 또는 데이터 등을 기준으로 물리적 또는 논리적으로 구분된 하나 이상의 서버 장치 로 구현될 수 있으며, 각 서버 장치 간의 통신을 통해 데이터를 송수신하고 송수신된 데이터를 처리할 수 있 다. 서버 장치와 통신하는 외부 장치는 서버 장치에 의해 조정된 객실 가격을 송신하는 사용자 단말 및 외 부 서버 장치를 포함할 수 있다. 구체적으로, 외부 장치가 사용자 단말인 경우, 서버 장치의 제어부는 객실 가격의 조정 결과를 사용 자가 확인할 수 있도록 사용자 단말로 송신할 수 있다. 이때, 사용자 단말은 퍼스널 컴퓨터(personal computer), 단말기(terminal), 휴대폰(portable telephone), 스마트 폰(smart phone), 휴대 장치(handheld device), 착용 장치(wearable device) 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 또한, 외부 장치가 외부 서버 장치인 경우, 외부 서버 장치는 다양한 컴퓨팅 디바이스로 구현될 수 있고, 외 부 서버 장치는 하나 이상의 외부 서버 장치로 구현될 수 있으며, 각 외부 서버 장치 간의 통신을 통해 데이터 를 송수신하고 송수신된 데이터를 처리할 수 있다. 일 실시예에 따른 서버 장치는 프로세서와 메모리가 포함된 모든 전자 장치를 의미할 수 있으며. 이 하 서버 장치의 각 구성요소를 상세히 설명한다. 통신부는 외부 장치와 통신하기 위해 무선 통신부와 유선 통신부를 포함할 수 있다. 통신부 는 별도로 마련된 외부 장치로부터 학습 데이터로 활용하기 위한 객실 데이터를 수신하거나, 머신 러닝 (Machine Learning)을 위한 프로그램 및 각종 데이터를 송수신할 수 있다. 무선 통신부는 근거리 통신 모듈과 원거리 통신 모듈 중 적어도 하나를 포함할 수 있다. 근거리 통신 모듈은, 근거리 통신 방법을 이용하여 서버 장치와 인접한 외부 장치와 통신할 수 있다. 여기서, 근거리 통신 모듈은 블루투스(bluetooth), 블루투스 저 에너지(bluetooth low energy), 적외선 통신 (IrDA, infrared data association), 지그비(Zigbee), 와이파이(Wi-Fi), 와이파이 다이렉트(Wi-Fi direct), UWB(Ultra Wideband), 또는 근접장 통신(NFC, near field communication)을 중 하나의 통신 방법을 활용할 수 있다. 원거리 통신 모듈은, 다양한 종류의 원거리 통신을 수행하는 통신 모듈을 포함할 수 있으며, 이동 통신부를 포 함할 수 있다. 이동 통신부는 이동 통신망 상에서 기지국, 외부의 단말, 외부 장치 중 적어도 하나와 무선 신호를 송수신할 수 있다. 또한, 원거리 통신 모듈은 주변의 접속 중계기(AP: Access point)를 통해 외부 장치 또는 다른 전자 장치 등의 외부 장치와 통신할 수 있다. 접속 중계기(AP)는 서버 장치가 연결된 지역 네 트워크(LAN)를 통신 서버가 연결된 광역 네트워크(WAN)에 연결시킬 수 있다. 이에 따라 서버 장치는 외부 장치 와 광역 네트워크(WAN)를 통해 통신 서버에 연결되어 서로 통신할 수 있다. 유선 통신부는 유선 통신망에 접속하고 유선 통신망을 통하여 외부 장치와 통신할 수 있다. 예를 들어, 유선 통신부는 이더넷(Ethernet, IEEE 802.3 기술 표준)을 통하여 유선 통신망에 접속하거나, 캔(CAN)통신 을 통하여 유선 통신망에 접속하고, 유선 통신망을 통하여 외부 장치들과 데이터를 송수신할 수 있다. 일 실시예에 따른 서버 장치는 입출력 인터페이스(미도시)를 포함할 수 있다. 키보드, 마우스, 터치 패널 등의 입력 장치(미도시)와 디스플레이(미도시) 등의 출력 장치와 프로세서 사이를 연결하여 데이터를 송수신할 수 있도록 하는 인터페이스를 제공할 수 있다. 메모리는 서버 장치의 구동에 필요한 각종 정보를 저장할 수 있다. 구체적으로, 메모리는 서버 장치 의 구동에 필요한 운영체제 및 프로그램을 저장하거나, 서버 장치의 구동에 필요한 데이터를 저장할 수 있다. 구체적으로, 메모리는 객실 데이터 전처리, 객실 판매가 조정 및 머신 러닝 알고리즘에 관한 각종 프로그 램을 저장할 수 있다. 또한, 메모리는 머신 러닝에 활용되는 특징(feature) 데이터를 저장할 수 있다. 메모리는 데이터를 일시적으로 기억하기 위한 S-램(Static Random Access Memory, S-RAM), D-램(Dynamic Random Access Memory)과 같은 휘발성 메모리를 포함할 수 있다. 또한, 메모리는 데이터를 장기간 저장하기 위한 롬(Read Only Memory), 이피롬(Erasable Programmable Read Only Memory: EPROM), 이이피롬 (Electrically Erasable Programmable Read Only Memory: EEPROM)과 같은 비휘발성 메모리를 포함할 수 있다. 프로세서는 제어 신호를 출력하여 서버 장치를 전반적으로 제어한다. 프로세서는 하나 또는 복수 개 의 CPU(central processing unit) 및 GPU(Graphics Processing Unit)를 포함할 수 있다. 이때, 프로세서 는 다수의 논리 게이트들의 어레이로 구현될 수도 있고, 범용적인 마이크로 프로세서와 마이크로 프로세서 에서 실행될 수 있는 프로그램이 저장된 메모리의 조합으로 구현될 수도 있다. 전술한 메모리와 프로세서는 제어부에 포함될 수 있으며, 제어부는 전술한 구성요소를 제 어하여 객실 판매가의 인상 또는 인하 여부를 결정할 수 있다. 구체적으로, 제어부는 객실 데이터에서 객실 판매가 조정을 위한 특징(feature)을 추출하여 전처리 데이터 를 생성하고, 전처리 데이터를 학습 데이터로 사용하는 객실 예약 확률 결정 모델 및 객실 판매가 조정 모델을 생성할 수 있다. 즉, 일 실시예에 따른 서버 장치는 객실 판매가를 동적으로 조정하기 위해 객실의 예약 확 률을 결정하고, 예약 확률을 객실 판매가 조정 모델에 별도로 입력하여 객실 판매가를 조정할 수 있다. 즉, 제어부는 객실 예약 확률 결정 모델에 객실 데이터를 입력하여 객실 예약 확률을 출력값으로 도출하고, 도출된 객실 예약 확률을 객실 판매가 조정 모델에 입력하여, 객실 판매가 조정 데이터를 출력값으로 도출할 수 있다. 이후, 제어부는 도출된 객실 판매가 조정 데이터를 외부 장치로 전송할 수 있으며, 사용자는 동적으로 조정된 객실 판매가를 온라인으로 확인할 수 있다. 제어부는 객실 예약 확률에 기초하여 상품 수요 지표 및 지역 수요 지표를 결정하고, 상품 수요 지표 및 지역 수요 지표를 객실 판매가 조정 모델에 입력하여 객실 판매가 조정 데이터를 출력값으로 도출할 수 있다. 또한, 제어부는 객실 예측 예약율(sale rate) 및 객실 픽업률(pickup rate)을 포함하는 업체 수요 지표와 객실 수요 지표의 평균값을 상품 수요 지표로 결정할 수 있으며, 평균값은 산술 평균, 기하 평균 및 조화 평균 을 포함할 수 있다. 이때, 객실 예약 확률 결정 모델은 객실별로 특정 투숙일에 예약이 발생할 확률을 예측하는 예약 발생 확률 예 측 모델과 업체별로 특정 투숙일에 예약이 발생하는 건수를 예측하는 예약 발생 건수 예측 모델을 포함할 수 있 으며, 제어부는 객실 데이터를 예약 발생 건수 예측 모델에 입력하여 객실의 예측 예약 건수를 출력하고, 객실의 예측 예약 건수를 잔여 객실수로 나누어 객실 예측 예약율을 결정할 수 있다. 또한, 제어부는 객실 데이터에서 실제 판매된 객실수를 총 객실수로 나누어 객실 픽업률을 결정할 수 있고, 객실 데이터를 예약 발생 확률 예측 모델에 입력하여 객실의 예약 확률을 출력하고, 객실의 예약 확률을 객실 수요 지표로 결정할 수 있다. 즉, 제어부는 AEEF (Asymmetric Exponent-Exponential Form) 모델을 포함하는 객실 판매가 조정 모델에 상품 수요 지표를 입력값으로 입력하기 위해, 업체 수요 지표와 객실 수요 지표에 기초하여 상품 수요 지표를 결정할 수 있다. 또한, 제어부는 통신부를 통해 객실 최저 가격선 및 객실 간 가격 우선 순위 중 적어도 하나를 수신 한 것에 기초하여, 객실 판매가 조정 데이터를 수정하거나, 객실 판매가 조정 데이터에서 사용자의 쿠폰 사용액 을 제외한 금액에 기초하여 객실 판매가 조정 데이터를 수정할 수 있다. 이에 따르면, 서버 장치는 머신 러닝 모델을 활용하여 객실 판매가를 동적으로 제안할 수 있으므로, 객실 판 매자의 판매 이익을 극대화하는 효과가 있다. 도 2는 일 실시예에 따른 서버 장치에서 활용되는 머신 러닝 모델의 입력값과 출력값을 도시한다. 제어부는 객실의 잠재적 수요 데이터, 예약 정보 데이터 및 계절성 데이터를 훈련 데이터(a)로 사용하여 인공 신경망을 학습시킬 수 있다. 제어부가 인공 신경망을 학습시키기 위한 인공지능 전용 프로세서(예: NPU)를 포함하는 경우, 프로세 서는 메모리에 저장된 가중치 데이터를 인공 신경망의 훈련 데이터로 활용하여 인공 신경망을 학습시 킬 수 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도 형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공 신경망은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네 트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 제어부는 선택된 인공지능 모델에 기초하여 객실의 잠재적 수요 데이터, 예약 정보 데이터 및 계절성 데이 터와 판매가 인상 및 인하 데이터와의 연관 관계를 학습할 수 있다. 구체적으로, 제어부는 객실의 잠재적 수요 데이터, 예약 정보 데이터 및 계절성 데이터를 입력값으로 하는 분류 및 회귀 학습 모델에 기초하여 판매가 인상 데이터 및 판매가 인하 데이터를 포함하는 객실 판매가 조정 데이터(b)를 출력할 수 있다. 도 3 및 도 4는 일 실시예에 따른 서버 장치가 객실 판매가를 조정하는 개략적인 흐름도를 도시한다. 도 3 및 도 4에서의 101 내지 108 구성들은 소프트웨어 블록 형태로 구현되며, 메모리에 저장되어 프로세 서에 의해 실행될 수 있다. 먼저 도 3을 참조하면, 제어부는 통신부를 통해 객실 데이터를 수신할 수 있고, 수신된 객실 데이터 를 원시 데이터 DB에 저장할 수 있다. 이때, 객실 데이터는 기본 정보, 가격 정보, 예약 정보, 객실 위치 정보, 투숙객 피드백 정보, 서비스 정보, 시간대별 예약 정보 및 가용성 정보를 포함할 수 있다. 구체적으로, 기본 정보는 객실 번호 또는 이름, 객실 유형 (예: 표준, 스위트, 디럭스), 객실 크기 및 용량 (예: 싱글 베드, 퀸 베드, 트윈 베드)를 포함할 수 있고, 가격 정보는 일일 또는 시간별 가격 정보, 계절적 가 격 변동 정보, 할인 정보 및 프로모션 정보를 포함할 수 있고, 예약 정보는 예약 상태 정보, 예약 일자 정보, 예약 시간 정보, 예약한 고객 정보 (예: 이름, 연락처, 이메일 등) 및 이전 예약 이력(선호도) 정보가 포함될 수 있다. 또한, 객실 위치 정보는, 숙박 업체의 이름 정보, 위치 정보(도시, 지역 등), 근처 관광 명소 및 시설 정보를 포함할 수 있고, 투숙객 피드백 정보는 이전 고객 리뷰 정보, 평가 정보 및 피드백과 리뷰를 통한 개선 사항 정 보를 포함할 수 있다. 또한, 서비스 정보는 객실 내 시설 정보(무선 인터넷, TV, 냉장고, 욕실 등), 숙박 업체 내 시설 정보(레스토랑, 수영장, 피트니스 센터 등), 객실 서비스 및 부대 시설 정보를 포함할 수 있고, 및 시간대별 예 약 정보 및 가용성 정보는 특정 시간대에 객실의 가용성 정보, 예약된 시간대 및 날짜 정보를 포함할 수 있다. 제어부는 통신부를 통해 수신된 객실 데이터를 학습 데이터로 가공하기 위해 피처 엔지니어링 수행부 에서 피처 엔지니어링(feature engineering)을 수행할 수 있다. 피처 엔지니어링은 머신러닝 및 데이터 분 석에서 데이터의 특성 또는 피처를 적절하게 변형, 선택 또는 생성하여 모델의 성능을 개선하고 예측 정확도를 향상시키는 작업을 의미할 수 있다. 제어부는 피처 엔지니어링에 의해 생성된 피처를 피처 데이터 DB에 저장할 수 있으며, 피처 데이터 DB에서 피처 셀렉션을 수행할 수 있다. 일 실시예에 따른 서버 장치에서는 피쳐 셀렉션을 수행하기 위해 사이킷 런(Scikit-learn)의 모형 기반 변수 선택(SelectFromModel) 알고리즘을 사용할 수 있다. 구체적으로, 제어부의 피처 셀렉션 수행부에서는 객실의 동적 판매가를 제안하기 위해 적합한 피처를 선택할 수 있다. 피처 샐렉션은 머신 러닝 및 데이터 분석에서 사용되는 데이터 전처리 과정 중 하나로, 모델을 학습시키는 데 가장 중요한 피처(특성)를 선택하고 불필요한 피처를 제거하는 작업을 의미할 수 있다. 제어부는 객실의 동적 판매가를 제안하기 위해 적합한 피처를 선택하기 위해, 원시 데이터 DB로부터 추출한 전체 피처 목록을 확인하고, 피처 중요도 평가를 평가할 수 있다. 즉, 제어부는 객실 판매가 조정 에 관련된 다양한 피처 중에서 어떤 피처가 예약 예측 및 판매가 조정에 가장 중요한 역할을 하는지 결정하기 위해 피처 중요도를 평가할 수 있다. 제어부는 피처 중요도를 평가하기 위해 랜덤 포레스트, XGBoost, 또는 기타 트리 기반 알고리즘을 사용할 수 있다. 이후, 제어부는 예약율 예측에 미치는 영향이 낮은 피처를 제거할 수 있고, 피처 간의 상관 관계를 분석하 여 상호 의존성이 높은 피처를 식별하고 제거할 수 있다. 제어부는 피처 셀렉션 수행 후에 모델을 학습하 고 평가하여 성능을 평가할 수 있고, 이에 따라 피처 셀렉션이 모델 성능에 미치는 영향을 결정할 수 있다. 제어부는 피처 셀렉션이 수행되어 선택된 피처들을 머신 러닝 메타데이터 DB에 저장할 수 있으며, 머 신 러닝 메타데이터 DB는 머신 러닝 모델 및 프로젝트와 관련된 메타 데이터를 저장하고 관리하는 데이터 베이스를 의미할 수 있다. 이후 제어부의 하이퍼 파라미터 튜닝부에서는 하이퍼 파라미터를 튜닝할 수 있으며 하이퍼 파라미터 는 머신러닝 모델의 학습 과정 및 구조를 제어하는 설정 값을 의미할 수 있고, 예를 들어, 학습률, 트리의 깊이, 규제 강도를 포함할 수 있다. 제어부는 하이퍼 파라미터 튜닝을 통해 모델의 성능을 최적화하고, 과적합을 방지하며, 모델이 데이터에 더 잘 일반화될 수 있도록 하기 위한 최적의 하이퍼 파라미터 값을 찾을 수 있다. 일 실시예에 따른 서버 장치에서는 하이퍼 파라미터를 튜닝하기 위한 알고리즘으로 사이킷 런(Scikit- learn)의 그리드 서치 CV(GridSearchCV)를 사용할 수 있다. 그리드 서치는 가능한 모든 하이퍼 파라미터 조합을 시도하여 최적의 조합을 찾는 방법 중 하나로, 그리드 서치 CV(GridSearchCV)는 교차 검증을 사용하여 각 조합 의 성능을 평가하므로 모델의 일반화 성능을 신뢰성 있게 측정할 수 있다. 마찬가지로 제어부는 튜닝이 수행된 하이퍼 파라미터들을 머신 러닝 메타데이터 DB에 저장할 수 있다. 이후 제어부의 머신 러닝 모델 학습부에서는 결정된 하이퍼 파라미터와 선택된 피처에 기초하여 모델 을 학습할 수 있다. 구체적으로 제어부는 객실 판매가를 조정하기 위해 선택된 피처를 입력 데이터로 사용 하여 모델의 파라미터를 학습할 수 있다. 일 실시예에 따른 서버 장치는 객실 판매가 예측을 위해 랜덤 포레스트(Random forest) 모델을 사용할 수 있 으며, 주어진 피처로 객실의 판매가를 예측하는 회귀 문제에 적용할 수 있다. 구체적으로, 제어부는 주어 진 피처와 객실 판매 가격 사이의 관계를 학습시킬 수 있다. 여기에서 랜덤 포레스트 모델은 여러 개의 결정 트리를 조합하여 예측을 수행하는 앙상블(Ensemble) 학습 모델 중 하나를 의미할 수 있다. 구체적으로, 랜덤 포레스트 모델은 부트스트랩 샘플링, 랜덤한 피처 선택, 앙상블 예측 및 하이퍼 파라미터 조정의 단계를 거쳐 피처와 객실 판매 가격 사이의 관계를 학습할 수 있다. 이후 제어부는 머신러닝 학습 모델 DB에 학습된 머신러닝 모델을 저장할 수 있다. 이어서 도 4를 참조하면, 제어부의 사전 구축 데이터(prebuilt data) 생성부에서는 모델 학습과 테스 트를 위한 사전 구축 데이터를 생성할 수 있으며, 사전 구축 데이터는 모델의 학습 및 평가, 피처 엔지니어링, 하이퍼 파라미터 튜닝, 데이터 시각화 및 탐색에서 사용될 수 있다. 이후 제어부는 생성된 사전 구축 데이 터를 사전 구축 데이터 DB에 저장할 수 있다. 제어부의 파라미터 피팅부에서는 학습 모델의 성능을 최적화하고 최상의 예측 결과를 얻기 위해 파라 미터를 피팅할 수 있다. 일 실시예에 따른 서버 장치는 객실 판매가 조정 모델로 AEEF (Asymmetric Exponent-Exponential Form) 모 델을 활용할 수 있으며, 제어부는 AEEF 모델이 객실 판매가를 적절하게 제안할 수 있도록 하이퍼 파라미터 를 조정할 수 있다. 예를 들어, 제어부는 회귀 모델의 학습률(learning rate), 트리의 개수 및 깊이 등을 조정할 수 있다. 이후 제어부는 피팅 된 하이퍼 파라미터를 머신 러닝 학습 모델 DB에 저장할 수 있다. 제어부의 API(Application Programming Interface) 전개부에서는 개발된 API를 실제 운영 환경에서 사용할 수 있도록 서버 또는 호스팅 환경에 배포(설치 및 실행)하는 과정이 수행될 수 있다. 즉, 제어부는 개발된 객실 가격 조정 서비스를 다른 애플리케이션과 통합하거나 외부 개발자 또는 사용자가 사용할 수 있도록 제공할 수 있다. 제어부의 API 제공부에서는 개발된 객실 가격 조정 서비스가 사용자와 상호작용 할 수 있도록, 서빙 레이어(Serving Layer)에 객실 가격 조정 서비스를 제공할 수 있다. 이에 따라, 사용자는 서빙 레이어에서 래퍼 API(Wrapper API)를 통해 객실 가격을 요청하는 명령을 모델 API에 전송할 수 있고, 모델 API는 최적 가격을 래퍼 API(Wrapper API)를 통해 사용자의 외부 장치에 전송할 수 있 다. 도 3과 도 4에서 전술한 각 단계는 순차적으로 도시되어 있으나, CPU 및 GPU에 의해 각 단계가 병렬적으로 수행 될 수도 있다. 도 5는 일 실시예에 따른 서버 장치에서 활용되는 특징(feature)을 도시한다. 도 5를 참조하면, 제어부의 피처 엔지니어링 수행부에서는 피처 엔지니어링 기법에 기초하여 피처 엔 지니어링을 수행할 수 있으며, 구체적으로 제어부는 로그 변환 (Log Transformation)과 원핫 인코딩 (One Hot Encoding) 알고리즘을 사용할 수 있다. 로그 변환 (Log Transformation) 알고리즘은 정규 분포를 따르지 않는 데이터나 데이터의 스케일이 크게 차이나 는 경우에 사용되며, 제어부는 객실 데이터가 일방으로 치우친 분포를 가질 때 객실 데이터를 정규 분포에 가깝게 변형하여 전처리 데이터를 생성 수 있다. 원핫 인코딩 (One Hot Encoding) 알고리즘은 객실 데이터 중에서 범주형 데이터를 머신 러닝 모델에 입력하기 위해 사용되며, 제어부는 학습 모델이 범주형 데이터를 이해하고 활용할 수 있도록 범주형 변수를 0과 1로 이루어진 이진 벡터로 변환할 수 있다. 전술한 알고리즘에 따라, 제어부는 도 5와 같이 피처를 선택할 수 있으며, 피처의 속성은 변수명(a), 시간 _차원(b), 공간 차원(c), 설명(d) 및 변수 타입(e)으로 구별할 수 있다. 구체적으로, 변수명(a)은 1번 변수의 day_of_week, 2번 변수의 week_of_year 및 3번 변수의 month 등과 같이 카테고리를 나타내는 날짜 개념을 포함할 수 있다. 또한, 시간_차원(b)은 각 변수가 투숙일과 연관된 피처로부터 비롯된 것인지, 예약일과 연관된 피처로부터 비롯 된 것인지 또는 투숙일과 예약일 모두에 연관된 피처로부터 비롯된 것인지를 나타내며, 투숙일 또는 예약일이 객실 판매가 예측에 미치는 영향을 결정할 수 있다. 또한, 공간_차원(c)은 각 변수가 객실 또는 업체과 관련된 피처로부터 비롯된 것인지 여부를 결정할 수 있으며, 8번 변수의 roomprice부터 14번 변수의 revenue_weekday_365day는 객실의 특성과 관련된 것이므로, 객실 차원 을 가지는 변수로 결정할 수 있다. 이에 따라, 제어부는 객실 또는 업체와의 관련성에 따라 각 피처가 객 실 판매가 예측에 미치는 영향을 결정할 수 있다. 또한, 설명(d)은 각 변수의 구체적인 설명을 포함하며, 변수 타입(e)은 각 변수들이 카테고리형(categorical) 변수인지, 바이너리형(binary) 변수인지 및 연속형(continuous) 변수인지를 결정하여, 각 피처에 의해 도출된 변수 타입에 따라 각 피처가 객실 판매가 예측에 미치는 영향을 결정할 수 있다. 일 실시예에 따른 서버 장치는 제어부의 피처 엔지니어링부와 피처 선택부에서 피처를 결정하여 도 5에 서와 같이 활용할 수 있다. 도 6은 일 실시예에 따른 서버 장치의 제어부가 객실 판매가를 조정하기 위해 활용하는 팩터들을 도시 한다. 도 6을 참조하면, 제어부는 객실 판매가 조정 모델의 입력값으로 활용되는 상품 수요 지표를 결정하기 위 해 업체 수요 지표와 객실 수요 지표를 결정할 수 있고, 업체 수요 지표를 결정하기 위해 객실 예측 예약율 (sale rate)과 객실 픽업률(pickup rate)을 결정할 수 있다. 구체적으로, 업체 수요 지표는 객실 예측 예약율(sale rate)과 객실 픽업률(pickup rate)을 포함하며, 제어부 는 예측 예약 건수 (c)를 잔여 객실수(b)로 나누어 객실 예측 예약율(sale rate)을 계산할 수 있다. 또한,제어부는 실제 판매된 객실수(d)를 총 객실수(a)로 나누어 객실 픽업률(pickup rate)을 계산할 수 있다. 또한, 제어부는 객실 데이터를 예약 발생 확률 예측 모델에 입력하여 객실의 예약 확률을 출력하고, 객실 의 예약 확률을 객실 수요 지표로 결정할 수 있다. 이후 제어부는 결정된 업체 수요 지표와 객실 수요 지표의 평균값을 상품 수요 지표로 계산하고, 계산된 상품 수요 지표를 AEEF 모델에 입력하여 객실 판매가 조정 데이터를 출력할 수 있다. 이때, 업체 수요 지표와 객실 수요 지표의 평균값은 산술 평균, 기하 평균 및 조화 평균을 포함할 수 있으며, 기하 평균과 조화 평균은 상대적으로 보수적인 객실 판매가 제안이 필요한 경우에 활용될 수 있다. 도 7은 일 실시예에 따른 서버 장치의 객실 판매가 조정 모델의 성능을 도시한다. 도 7을 참조하면, 제어부는 객실 판매가 조정 모델에 상품 수요 지표 및 지역 수요 지표를 입력하여 객실 판매가 조정 데이터를 획득할 수 있고, 객실 판매가 조정 모델은 상품 수요 지표 및 상기 지역 수요 지표를 변 수로 가지는 AEEF (Asymmetric Exponent-Exponential Form) 모델을 포함할 수 있다. 제어부는 AEEF (Asymmetric Exponent-Exponential Form) 모델에 기초하여 가격을 변경할 수 있고, 구체적 으로 예측된 예약 확률에 기초하여 가격을 결정할 수 있다. 즉, 제어부는 도 7의 (a)에서와 같이 예측된 예약 확률이 증가할수록 객실 판매가를 증가시킬 수 있다. AEEF (Asymmetric Exponent-Exponential Form) 모델은 아래의 수학식 1과 수학식 2로 구성되며, 예약확률(q)로 도출되는 상품 수요 지표와 과 지역 수요 지표(D)를 변수로 하여 제안가격(Psug)을 산출할 수 있다. 수학식 1"}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 2"}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "각 파라미터의 경우, 은 가격 변동 비율의 최소 범위와 최대 범위를 결정하고, 는 그 크기에 따라 가격 인하 편향과 가격 인상 평향으로 그래프를 이동시키며, 과 는 가격 인상의 기준이 되는 예약 확률을 결정할 수 있고, 구체적으로 가 커지면 가격 인상 기준이 되는 예약 확률인 기준값이 낮아 질 수 있고, 가 커지면 가격 인상 기준이 되는 예약 확률인 기준값이 높아질 수 있다. 일 실시예에 따른 서버 장치는 AEEF 모델에 기초하여 객실 판매가 조정 데이터를 획득할 수 있으며, 전술한 알고리즘으로 상품 수요 지표 및 지역 수요 지표를 계산하여 AEEF 모델에 입력하고 적절한 판매가를 제안할 수 있다. 도 8은 일 실시예에 따른 서버 장치에서 객실의 판매가가 조정되는 예시를 도시한다. 도 8은 서버 장치의 학습 모델에서 활용되는 데이터셋의 예시를 나타내며, 서버 장치는 전술한 알고리즘 에 기초하여 추천 가격(e)을 결정하고, 사용자에게 제안할 수 있다. 구체적으로, 제어부는 객실 데이터를 분리한 기준 시점인 파티션(partition) 시점(a)의 하루 전 실제 가격 (d)을 기준으로 목표 시점까지의 예약률을 예측 예약율(c)로 결정할 수 있다. 제어부는 예측 예약 건수를 잔여 객실수로 나누어 객실 예측 예약율(c)을 계산할 수 있고, 제어부는 실제 판매된 객실수를 총 객실수 로 나누어 실제 예약율(b)을 계산할 수 있다.제어부는 계산된 예측 예약율(c)과 실제 예약율(b)에 기초하여 추천 가격(e)을 계산할 수 있으며, 예측 예 약율(c)과 실제 예약율(b)을 포함하는 업체 수요 지표와 객실 수요 지표의 조화 평균값을 상품 수요 지표로 결 정하여, 객실 판매가 조정 모델이 입력할 수 있다. 또한, 제어부는 객실 가격을 인상 또는 인하하는 기준값에 따라 객실 가격을 인상 또는 인하할 수 있고, 도 8에서와 같이 기준값을 예측 예약율(c) 45%로 가정하면, 파티션(partition) 시점(a)이 20230312 및 20230313인 경우에는 예측 예약율(c)이 45% 미만이므로 실제 가격을 인하하여 추천 가격을 결정하고, 나머지 파 티션 시점(a)에 대해서는 예측 예약율(c)이 45% 이상이므로 실제 가격을 인상하여 추천 가격을 결정할 수 있다. 도 9는 일 실시예에 따른 서버 장치에서 객실 판매가 조정 결과를 검증하는 방법을 도시하고, 도 10은 일 실 시예에 따른 서버 장치에서 객실 판매가 조정 결과를 기존 모델과 비교한 그래프를 도시한다. 먼저, 도 9를 참조하면, 제어부는 객실 판매가 조정 결과를 검증하기 위해 분류 문제에서 활용되는 혼동 행렬(Confusion Matrix)을 변형하여 모델을 검증하고 평가할 수 있다. 구체적으로, 제어부는 모델 제안 가격과 실제 판매 가격을 비교하고, 판매여부에 따라 Good / Bad 케이스 를 구분하여 검증에 활용할 수 있다. 도 9의 (A)의 경우 판매된 객실에 대해 가격 인상이 제안되었다면 가격을 높일 경우 단가를 높게 받을 수 있으 므로 Good 케이스로 구분될 수 있고, 도 9의 (B)의 경우 판매된 객실에 대해 가격 인하가 제안되었다면 가격을 낮출 경우 그 차이만큼 손실이 발생할 수 있으므로 Bad 케이스로 구분될 수 있다. 또한, 도 9의 (C)의 경우 판매되지 않은 객실에 대해 가격 인상이 제안되었다면 가격을 높였더라면 예약이 일어 나지 않았을 것이므로 Bad 케이스로 구분될 수 있고, 도 9의 (D)의 경우 판매되지 않은 객실에 대해 가격 인하 가 제안되었다면 가격을 낮출 경우 그 차이만큼 손실이 발생할 수 있으므로 Bad 케이스로 구분될 수 있다. 제어부는 위 지표에 기초하여 가격 인하 재현율인 PDR(Price Decrease Recall), 가격 인하 정밀도인 PDP(Price Decrease Precision), 가격 인상 재현율인 PIR(Price Increase Recall) 및 가격 인상 정밀도인 PIP(Price Increase Precision)를 아래 수학식과 같이 결정할 수 있다. 수학식 3"}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 4"}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 5"}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 6"}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "또한, 제어부는 예약가격 오차율인 BR(Booking Regret)을 A와 B 케이스 중 제안가격과 실제 예약가격의 오 차율의 중위값(median)으로 결정할 수 있다. 일 실시예에 따른 서버 장치는 학습 모델을 검증하는 과정에서 수학식 3에 대응되는 PDR과 수학식 6에 대응 되는 PIP에 가중치를 높게 적용하여 모델을 평가할 수 있다.즉, 제어부는 가격 인하 재현율과 가격 인상 정밀도에 높은 가중치를 두고 모델을 평가하여 가격 인상이 제안되었음에도 판매가 되지 않는 Bad Price Increase 케이스를 감소시킬 수 있다. 이에 따르면 가격 인상이 제 안되었음에도 판매가 되지 않을 경우에 발생할 리스크를 최소화 할 수 있으므로, 사용자의 이익을 최대화하는 효과가 있다. 이어서 도 10을 참조하면, 도 10의 위쪽 그래프는 가격 인하 재현율인 PDR(Price Decrease Recall)를 리드타임 별로 도식화한 결과이고, 아래쪽 그래프는 가격 인상 정밀도인 PIP(Price Increase Precision)를 리드타임 별로 도식환 결과를 의미할 수 있다. 먼저, 도 10의 위쪽 그래프를 참조하면 (a)는 일 실시예에 따른 서버 장치가 객실의 판매가를 동적으로 제안 한 경우의 가격 인하 재현율을 의미하고, (b)는 종래 기술인 경쟁 객실 모델이 객실의 판매가를 동적으로 제안 한 경우의 가격 인하 재현율을 의미할 수 있다. 즉, 판매되지 않은 객실에 대하여 가격 인하를 제안한 가격 인하 재현율의 경우, 일 실시예에 따른 서버 장치 에 의한 동적 판매가 제안의 성능이 기존의 경쟁 객실 모델보다 약 두배 개선된 것을 확인할 수 있다. 다음으로, 도 10의 아래쪽 그래프를 참조하면 (c)는 일 실시예에 따른 서버 장치가 객실의 판매가를 동적으 로 제안한 경우의 가격 인상 정밀도를 의미하고, (d)는 종래 기술인 경쟁 객실 모델이 객실의 판매가를 동적으 로 제안한 경우의 가격 인상 정밀도를 의미할 수 있다. 즉, 가격 인상을 제안한 객실 중에서 실제로 판매된 비율을 나타내는 가격 인상 정밀도의 경우, 일 실시예에 따 른 서버 장치에 의한 동적 판매가 제안의 성능이 기존의 경쟁 객실 모델보다 약 두배 이상 개선된 것을 확인 할 수 있다. 이처럼, 일 실시예에 따른 서버 장치는 혼동 행렬(Confusion Matrix)을 변형하여 객실 판매가를 제안하는 학 습 모델을 검증 및 평가할 수 있으므로 검증 데이터에 기초하여 학습 모델의 전체적인 성능을 용이하게 확인할 수 있고 개선할 수 있다. 도 11은 일 실시예에 따른 서버 장치의 제어 방법에 관한 흐름도이고, 도 12는 도 11에 이어서 일 실시예에 따른 서버 장치의 제어 방법에 관한 흐름도를 계속 나타낸 도면이다. 도 11을 참조하면, 제어부는 통신부로부터 객실 데이터를 수신할 수 있다. 이후 제어부는 객실 데이터에서 객실 판매가 조정을 위한 특징을 추출하여 전처리 데이터를 생성할 수 있다. 이때 전처 리 데이터는 객실 데이터에 대하여 피처 엔지니어링과 피처 셀렉션을 수행한 후의 결과 데이터를 의미할 수 있 다. 제어부는 전처리 데이터를 학습 데이터로 사용하는 객실 예약 확률 결정 모델과 객실 판매가 조정 모델을 학습하여 생성할 수 있다. 제어부는 객실 예약 확률 결정 모델에 전처리 데이터를 입력하여 객실 예 약 확률을 출력값으로 도출할 수 있다. 이후 제어부는 객실 예약 확률을 객실 판매가 조정 모델에 입력하여 객실 판매가 조정 데이터를 출력값으 로 도출할 수 있으며, 구체적으로 객실 예약 확률에 기초하여 상품 수요 지표를 결정하고, 상품 수요 지 표와 지역 수요 지표를 객실 판매가 조정 모델에 입력할 수 있다. 이어서 도 12를 참조하면, 제어부는 통신부를 통해 객실 최저 가격선 및 객실 간 가격 우선 순위 중 적어도 하나를 수신하였는지 판단할 수 있다. 구체적으로, 사용자는 사용자 단말에 객실 최저 가격선을 입력할 수 있으며, 객실 최저 가격선은 사용자의 영업 이익에 기초하여 객실 판매가를 조정할 수 있는 최저가를 의미할 수 있다. 제어부는 객실 최저 가격선이 수신되면(1200의 예), 사용자에 의해 입력된 객실 최저 가격선을 고려하여 객실 판매가 조정 데이터를 수정할 수 있다. 예를 들어 객실 판매가 조정 데이터에 의해 조정된 객실 가 격이 80000원인 경우, 입력된 객실 최저 가격선이 81000원이면, 객실 판매가 조정 데이터에 의해 조정된 객실 가격을 81000원으로 수정할 수 있다. 또한, 제어부는 사용자로부터 객실 간 가격 우선 순위를 수신할 수 있고, 객실 간 가격 우선 순위는 유사 한 조건에 해당하는 복수의 객실에 대해 먼저 판매가 되기를 희망하는 우선 순위를 의미할 수 있다. 제어부 는 사용자로부터 입력된 객실 간 가격 우선 순위에 기초하여 객실 판매가 조정 데이터를 수정할 수 있으며, 예를 들어 동일한 객실 판매가로 제안된 두 개의 객실에 대하여 판매 우선순위가 높은 객실의 판매가를나머지 객실에 비해 낮게 객실 판매가 조정 데이터를 수정할 수 있다. 또한, 제어부는 쿠폰 사용으로 객실 판매가 조정 데이터에서 사용자의 쿠폰 사용액을 제외한 금액이 발생 하였는지 판단할 수 있다. 제어부는 쿠폰 사용으로 객실 판매가 조정 데이터에서 사용자의 쿠폰 사용액을 제외한 금액이 발생한 것으 로 판단되면(1210의 예), 쿠폰 사용액에 기초하여 객실 판매가 조정 데이터를 수정할 수 있다. 예를 들어, 제어부는 객실에 대한 최대 금액 쿠폰이 소진될 경우, 쿠폰 적용 판매가를 유지하기 위해 객실 판매 가를 인하하도록 객실 판매가 조정 데이터를 수정할 수 있다. 이후, 제어부는 사용자 단말과 외부 서버 장치를 포함하는 외부 장치로 객실 판매가 조정 데이터를 전송할 수 있고, 사용자는 판매 이익이 최대가 되는 객실 판매가를 반영하여 판매 이익을 최대화할 수 있 다. 이와 같이 일 실시예에 따른 서버 장치에 의하면 다양한 상권 수요의 변화를 고려하여 판매 이익을 최대화하 도록 객실 판매가를 동적으로 조정할 수 있으므로, 객실 판매가를 조정하기 위한 노력 및 비용을 감소시키고 영 업 이익을 최대화하는 효과가 있다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(read only memory), RAM(random access memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다. 또한, 컴퓨터가 읽을 수 있는 기록매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기 서, ‘비일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우 를 구분하지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 기록 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리(와 같은 기기로 읽을 수 있는 기록 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 이상에서는 특정의 실시예에 대하여 도시하고 설명하였다. 그러나, 상기한 실시예에만 한정되지 않으며, 발명이"}
{"patent_id": "10-2023-0153927", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "속하는 기술분야에서 통상의 지식을 가진 자라면 이하의 청구범위에 기재된 발명의 기술적 사상의 요지를 벗어 남이 없이 다양하게 변경 실시할 수 있을 것이다."}
{"patent_id": "10-2023-0153927", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 서버 장치의 제어 블록도를 도시한다. 도 2는 일 실시예에 따른 서버 장치에서 활용되는 머신 러닝 모델의 입력값과 출력값을 도시한다. 도 3 및 도 4는 일 실시예에 따른 서버 장치가 객실 판매가를 조정하는 개략적인 흐름도를 도시한다. 도 5는 일 실시예에 따른 서버 장치에서 활용되는 특징(feature)을 도시한다. 도 6은 일 실시예에 따른 서버 장치의 제어부가 객실 판매가를 조정하기 위해 활용하는 팩터들을 도시한다. 도 7은 일 실시예에 따른 서버 장치의 객실 판매가 조정 모델의 성능을 도시한다. 도 8은 일 실시예에 따른 서버 장치에서 객실의 판매가가 조정되는 예시를 도시한다. 도 9는 일 실시예에 따른 서버 장치에서 객실 판매가 조정 결과를 검증하는 방법을 도시한다. 도 10은 일 실시예에 따른 서버 장치에서 객실 판매가 조정 결과를 기존 모델과 비교한 그래프를 도시한다. 도 11은 일 실시예에 따른 서버 장치의 제어 방법에 관한 흐름도이다. 도 12는 도 11에 이어서 일 실시예에 따른 서버 장치의 제어 방법에 관한 흐름도를 계속 나타낸 도면이다."}
