{"patent_id": "10-2023-0111186", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0074639", "출원번호": "10-2023-0111186", "발명의 명칭": "청각 자극을 이용한 기상 유도 시스템 및 방법", "출원인": "고려대학교 산학협력단", "발명자": "이성환"}}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 수면 중 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 뇌 신호를 측정하는 뇌 신호측정부;상기 뇌 신호 측정부가 측정한 상기 뇌 신호에서 특정 주파수 대역을 필터링하고, 상기 뇌 신호에서 노이즈를제거하는 전처리부;상기 전처리부가 필터링하고, 노이즈를 제거한 특정 주파수 대역의 뇌 신호(이하, 특정 주파수 뇌 신호)에서 특정 주파수 뇌 신호의 특징을 추출하는 특징 추출부;상기 특징 추출부가 추출한 상기 특정 주파수 뇌 신호의 특징을 이용하여 상기 사용자의 수면 상태를 판단하는수면 상태 판단부;및상기 수면 상태 판단부가 판단한 상기 사용자의 수면 상태에 대응하는 청각 자극을 상기 사용자에게 제공하는청각 자극 제공부;를 포함하는,청각 자극 이용 기상 유도 시스템."}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 청각 자극 제공부는사용자가 설정한 기준 수면 시간을 기준으로 하여, 상기 기준 수면 시간 및 상기 사용자의 실제 수면 시간을 비교하고, 비교 결과 기 설정한 시간 범위 이내인 경우에는 상기 사용자에게 청각 자극을 제공하는,청각 자극 이용 기상 유도 시스템."}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 뇌 신호 측정부는상기 사용자의 두피에 부착된 뇌 신호 전극을 통해 사용자의 뇌 신호를 측정하고, 상기 뇌 신호 전극은 1개의레퍼런스 전극 및 1개의 그라운드 전극을 포함하는,청각 자극 이용 기상 유도 시스템."}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 특징 추출부는상기 특정 주파수 뇌 신호에서 주파수 파워 및 스펙트로그램 중 적어도 하나를 통해 상기 특정 주파수 뇌 신호의 특징을 추출하는,청각 자극 이용 기상 유도 시스템."}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2024-0074639-3-상기 수면 상태 판단부는상기 특정 주파수 뇌 신호의 특징을 이용하여 상기 사용자의 수면 상태를 비 수면, 렘수면, 비 렘수면 1단계,비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 하나로 판단하는,청각 자극 이용 기상 유도 시스템."}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 청각 자극 제공부는청각 자극 미제공, 알파파 및 베타파 중 적어도 하나를 상기 사용자의 수면 상태에 대응하여 선택하고, 알파파및 베타파 중 적어도 하나를 선택한 경우에는 선택한 청각 자극을 상기 사용자에게 제공하며, 청각 자극 미제공을 선택한 경우에는 사용자에게 청각 자극을 제공하지 않는,청각 자극 이용 기상 유도 시스템."}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 수면 상태 판단부는기 설정된 단위 시간 간격으로 반복하여 상기 사용자의 수면 상태를 판단하는,청각 자극 이용 기상 유도 시스템."}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,상기 청각 자극 제공부는상기 기준 수면 시간 및 상기 사용자의 실제 수면 시간 비교 결과, 상기 기준 수면 시간 및 상기 사용자의 실제수면 시간이 일치할 경우,사용자 단말은 기상 알람을 출력하는,청각 자극 이용 기상 유도 시스템."}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제4항에 있어서,상기 특징 추출부는상기 특정 주파수 뇌 신호에서 주파수 파워를 이용해 상기 특정 주파수 뇌 신호의 특징을 추출하는 경우, 알파파, 베타파, 델타파, 감마파 및 세타파로 구분하여 상기 특정 주파수 뇌 신호의 특징을 추출하고,상기 수면 상태 판단부는상기 특징 추출부의 상기 특정 주파수 뇌 신호의 특징 추출 결과를 이용하여 상기 사용자의 수면 상태를 판단하는,청각 자극 이용 기상 유도 시스템."}
{"patent_id": "10-2023-0111186", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "뇌 신호 측정부가 사용자의 수면 중 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 뇌 신호를측정하는 단계;전처리부가 상기 뇌 신호 측정부가 측정한 상기 뇌 신호에서 특정 주파수 대역을 필터링하는 단계;상기 전처리부가 필터링된 특정 주파수 대역의 상기 뇌 신호에서 노이즈를 제거하는 단계;공개특허 10-2024-0074639-4-특징 추출부가 상기 전처리부가 필터링하고, 노이즈를 제거한 특정 주파수 대역의 뇌 신호(이하, 특정 주파수뇌 신호)에서 특정 주파수 뇌 신호의 특징을 추출하는 단계;수면 상태 판단부가 상기 특징 추출부가 추출한 상기 특정 주파수 뇌 신호의 특징을 이용하여 상기 사용자의 수면 상태를 판단하는 단계;및청각 자극 제공부가 상기 수면 상태 판단부가 판단한 상기 사용자의 수면 상태에 대응하는 청각 자극을 상기 사용자에게 제공하는 단계;를 포함하는,청각 자극 이용 기상 유도 방법."}
{"patent_id": "10-2023-0111186", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 청각 자극을 이용한 기상 유도 시스템은 사용자의 수면 중 사용자의 뇌 및 눈의 움 직임 중 적어도 하나를 통해서 발생하는 뇌 신호를 측정하는 뇌 신호 측정부, 상기 뇌 신호 측정부가 측정한 상 기 뇌 신호에서 주파수 대역을 필터링하고, 상기 뇌 신호에서 노이즈를 제거하는 전처리부, 상기 전처리부가 필 터링하고, 노이즈를 제거한 특정 주파수 대역의 뇌 신호(이하, 특정 주파수 뇌 신호)에서 특정 주파수 뇌 신호의 특징을 추출하는 특징 추출부, 상기 특징 추출부가 추출한 상기 특정 주파수 뇌 신호의 특징을 이용하여 상기 사 용자의 수면 상태를 판단하는 수면 상태 판단부 및 상기 수면 상태 판단부가 판단한 상기 사용자의 수면 상태에 대응하는 청각 자극을 상기 사용자에게 제공하는 청각 자극 제공부를 포함한다."}
{"patent_id": "10-2023-0111186", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 청각 자극을 이용한 기상 유도 시스템 및 방법 에 관한 것이다. 보다 자세하게는 사용자의 수면 상태 를 판단하여 최적의 기상 유도 자극을 제공하는 청각 자극을 이용한 기상 유도 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0111186", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "수면은 몸의 회복과 에너지 보존, 기억력, 면역력, 감정 조절 등의 역할을 하는 중요한 활동이다. 수면이 부족 하거나 질이 낮을 경우에는 피곤하고, 기억력 및 면역력이 떨어지며, 감정 기복이 심하고 식욕이 증가하여 체중 증가가 일어난다. 이처럼 수면은 건강하고 안정적인 삶을 유지하기 위해서 매우 중요한 활동이다. 이 같은 점에서 수면이 부족하 거나 수면의 질이 좋지 않을 경우 수면 장애로 이어지기 쉽다. 수면 장애의 종류로는 불면증, 수면 과다증, 기면증, 수면 무호흡증 등이 있다. 국민건강보험공단에서 조사한 바에 따르면 2020년 수면 장애 진료 인원은 67만 1,307명으로 전년 대비 약 4.5% 증가했다. 또한 수면 장애 진 료 인원은 최근 5년 간 꾸준히 오름세를 보이고 있다. 2016년에는 49만 5,506명으로 50만명에도 미치지 못했으 나 이후 5년간 연평균 7.9% 증가했다. 그 중에서 불면증 진료 인원의 경우에는 최근 5년간(2015~2019) 24% 늘었 다. 앞서 언급한 수면 장애를 치료하기 위한 방법으로는 약물과 자극 치료가 있다. 약물 치료는 직접적인 효과를 보 기까지 걸리는 시간이 사람마다 크게 다르며, 지속적인 병원 방문이 필수적이다. 또한 내성이 생길 수 있고, 기 억력, 감정 조절, 식욕 등에 부작용이 생길 수 있다는 점이 한계점이다. 자극 치료는 세부적으로 직접적 자극과 간접적 자극으로 나뉜다. 직접적 자극은 경두개 자기 자극(Transcranial Magnetic Stimulation)과 경두개 전류 자극(Transcranial direct current stimulation)을 포함하며, 뇌 표면에 자기장 파동 혹은 약한 직류자극을 보내 신경 세포의 자발적인 활성을 일으켜 뇌 기능을 정상화하고 증상을 완 화하는 치료 방법이다. 그러나 일반인이 쉽게 접할 수 없으며, 부작용 발생 우려가 있다. 간접적 뇌 자극 치료 에는 청각, 후각, 시작 자극 등의 감각 자극이 포함되며, 앞선 치료 방법들과 비교했을 때, 일반인이 실생활에 서 쉽게 사용할 수 있다. 또한 청각, 시작 자극의 경우 기상 유도에 영향을 끼칠 수 있다고 알려져 있다. 상쾌한 기상 유도를 위해 감각 자극을 활용하기 위해서는 사용자의 수면 상태를 파악하는 것이 필요하다. 기상 에 최적화되지 않은 수면 상태에서 무리하게 기상을 하면 인지능력 감소로 인한 사고, 업무능력 저하, 불쾌한 감정, 피로감 등이 수반된다. 일반적으로 수면 상태를 파악할 때는 뇌전도(Electroencephalography)를 측정한다. 간접적인 방법으로 호흡, 뒤척임, 안전도(Electrooculography)를 측정하기도 하나, 뇌전도와 비교하 여 낮은 정확도를 보이고 있다. 뇌전도는 사용자의 이마와 머리에 전극을 부착하여 측정하며, 전극과 두피 사이 에 겔을 추가하여 임피던스를 낮추기 때문에 높은 신호 품질을 유지할 수 있다. 미국 수면 의학회(AASM)에 따르면 수면 상태는 수면의 깊이에 따라 렘수면(Rapid eye movement sleep)과 3가지 비 렘수면(Non-rapid eye movement sleep)으로 나뉜다. 렘수면은 동공 운동이 활발한 상태로, 일반적으로 꿈을 꾸고 있는 단계이다. 비 렘수면 1단계는 수면과 각성의 사이에 있는 단계이며, 이 단계에서는 주파수 대역이 8~12Hz에 해당하는 알파파의 비중이 커진다. 비 렘수면 2 단계는 얕은 잠, 비 렘수면 3단계는 깊은 잠을 자는 단계이다. 수면의 깊이가 깊어질수록 숙면과 관련된 주파수인 1~4Hz의 델타파가 커진다고 알려져 있다. 여기서 수면 관성이란 짧게는 수초, 길게는 수분까지 잠에서 쉽게 깨지 못하는 현상을 의미하며, 이 때의 뇌 신 호는 델타파가 크게 나타나고 그에 비해 베타파는 감소하는 형태로 나타나는 것이 특징으로 알려져 있다. 예를 들어 비 렘수면 2 또는 3단계와 같이 델타파가 크게 나타날 때 기상을 하게 되면 렘수면이나 비 렘수면 1단계에 서 기상했을 때보다 수면 관성이 크게 나타날 확률이 있다. 따라서 최적의 수면을 유도하기 위해서는 수면 관성을 줄여야 하고 이는 기상 직전의 뇌 신호의 주파수를 조정 하는 과정을 거쳐야 할 것이다. 하지만 종래의 방식에서는 기상을 유도하고자 청각, 시각 등의 감각자극을 이용하였으나, 이는 실시간 사용자의 수면 상태를 고려하지 않았고, 적절한 수면 상태를 유도하지 못한다는 한계점을 지니고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제 10-2023-0113165호(2023.07.28)"}
{"patent_id": "10-2023-0111186", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 문제점을 해결하기 위하여 본 발명은 사용자의 현재 수면 상태를 고려하여, 사용자의 수면 상태에 적합 한 청각 자극을 제공함으로써, 수면 관성을 줄일 수 있고, 사용자의 기상이 편안하도록 만드는 다양한 주파수 별 청각 자극을 제공하는 청각 자극을 이용한 기상 유도 시스템 및 방법을 제공하는 것이다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0111186", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위한 본 발명의 일 실시 예에 따른 청각 자극을 이용한 기상 유도 시스템은 사용 자의 수면 중 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 뇌 신호를 측정하는 뇌 신호 측정 부, 상기 뇌 신호 측정부가 측정한 상기 뇌 신호에서 특정 주파수 대역을 필터링하고, 상기 뇌 신호에서 노이즈 를 제거하는 전처리부, 상기 전처리부가 필터링하고, 노이즈를 제거한 특정 주파수 대역의 뇌 신호(이하, 특정 주파수 뇌 신호)에서 특정 주파수 뇌 신호의 특징을 추출하는 특징 추출부, 상기 특징 추출부가 추출한 상기 특 정 주파수 뇌 신호의 특징을 이용하여 상기 사용자의 수면 상태를 판단하는 수면 상태 판단부 및 상기 수면 상 태 판단부가 판단한 상기 사용자의 수면 상태에 대응하는 청각 자극을 상기 사용자에게 제공하는 청각 자극 제 공부를 포함한다. 일 실시 예에 따르면, 상기 청각 자극 제공부는 사용자가 설정한 기준 수면 시간을 기준으로 하여, 상기 기준 수면 시간 및 상기 사용자의 실제 수면 시간을 비교하고, 비교 결과 기 설정한 시간 범위 이내인 경우에는 상기 사용자에게 청각 자극을 제공할 수 있다. 일 실시 예에 따르면, 상기 뇌 신호 측정부는 상기 사용자의 두피에 부착된 뇌 신호 전극을 통해 사용자의 뇌 신호를 측정하고, 상기 뇌 신호 전극은 1개의 레퍼런스 전극 및 1개의 그라운드 전극을 포함할 수 있다. 일 실시 예에 따르면, 상기 특징 추출부는 상기 특정 주파수 뇌 신호에서 주파수 파워 및 스펙트로그램 중 적어 도 하나를 통해 상기 특정 주파수 뇌 신호의 특징을 추출할 수 있다. 일 실시 예에 따르면, 상기 수면 상태 판단부는 상기 특정 주파수 뇌 신호의 특징을 이용하여 상기 사용자의 수 면 상태를 비수면, 렘수면, 비 렘수면 1단계, 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 하나로 판단할 수 있다. 일 실시 예에 따르면, 상기 청각 자극 제공부는 청각 자극 미제공, 알파파 및 베타파 중 적어도 하나를 상기 사 용자의 수면 상태에 대응하여 선택하고, 알파파 및 베타파 중 적어도 하나를 선택한 경우에는 선택한 청각 자극을 상기 사용자에게 제공하며, 청각 자극 미제공을 선택한 경우에는 사용자에게 청각 자극을 제공하지 않을 수 있다. 일 실시 예에 따르면, 상기 수면 상태 판단부는 기 설정된 단위 시간 간격으로 반복하여 상기 사용자의 수면 상 태를 판단할 수 있다. 일 실시 예에 따르면, 상기 청각 자극 제공부는 상기 기준 수면 시간 및 상기 사용자의 실제 수면 시간 비교 결 과, 상기 기준 수면 시간 및 상기 사용자의 실제 수면 시간이 일치할 경우, 사용자 단말은 기상 알람을 출력할 수 있다. 일 실시 예에 따르면, 상기 특징 추출부는 상기 특정 주파수 뇌 신호에서 주파수 파워를 이용해 상기 특정 주파 수 뇌 신호의 특징을 추출하는 경우, 알파파, 베타파, 델타파, 감마파 및 세타파로 구분하여 상기 특정 주파수 뇌 신호의 특징을 추출하고, 상기 수면 상태 판단부는 상기 특징 추출부의 상기 특정 주파수 뇌 신호의 특징 추 출 결과를 이용하여 상기 사용자의 수면 상태를 판단할 수 있다. 상기 기술적 과제를 달성하기 위한 본 발명의 또 다른 실시 예에 따른 청각 자극 이용 기상 유도 방법은 뇌 신 호 측정부가 사용자의 수면 중 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 뇌 신호를 측정 하는 단계, 전처리부가 상기 뇌 신호 측정부가 측정한 상기 뇌 신호에서 특정 주파수 대역을 필터링하는 단계, 상기 전처리부가 필터링된 특정 주파수 대역의 상기 뇌 신호에서 노이즈를 제거하는 단계, 특징 추출부가 상기 전처리부가 필터링하고, 노이즈를 제거한 특정 주파수 대역의 뇌 신호(이하, 특정 주파수 뇌 신호)에서 특정 주 파수 뇌 신호의 특징을 추출하는 단계, 수면 상태 판단부가 상기 특징 추출부가 추출한 상기 특정 주파수 뇌 신 호의 특징을 이용하여 상기 사용자의 수면 상태를 판단하는 단계 및 청각 자극 제공부가 상기 수면 상태 판단부 가 판단한 상기 사용자의 수면 상태에 대응하는 청각 자극을 상기 사용자에게 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0111186", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따르면 사용자의 현재 수면 상태를 고려하여, 사용자의 수면 상태에 적합한 청각 자극을 제공함으로써, 수면 관성을 줄일 수 있고, 사용자의 기상이 편안하도록 만드는 다양한 주파수 별 청각 자극을 제공하는 효과가 있다."}
{"patent_id": "10-2023-0111186", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재 로부터 통상의 기술자에게 명확하게 이해 될 수 있을 것이다."}
{"patent_id": "10-2023-0111186", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적과 기술적 구성 및 그에 따른 작용 효과에 관한 자세한 사항은 본 발명의 명세서에 첨부된 도면 에 의거한 이하의 상세한 설명에 의해 보다 명확하게 이해될 것이다. 첨부된 도면을 참조하여 본 발명에 따른 실시 예를 상세하게 설명한다. 본 명세서에서 개시되는 실시 예들은 본 발명의 범위를 한정하는 것으로 해석되거나 이용되지 않아야 할 것이다. 이 분야의 통상의 기술자에게 본 명세서의 실시 예를 포함한 설명은 다양한 응용을 갖는다는 것이 당연 하다. 따라서, 본 발명의 상세한 설명에 기재된 임의의 실시 예들은 본 발명을 보다 잘 설명하기 위한 예시적인 것이며 본 발명의 범위가 실시 예들로 한정되는 것을 의도하지 않는다. 도면에 표시되고 아래에 설명되는 기능 블록들은 가능한 구현의 예들일 뿐이다. 다른 구현들에서는 상세한 설명 의 사상 및 범위를 벗어나지 않는 범위에서 다른 기능 블록들이 사용될 수 있다. 또한, 본 발명의 하나 이상의 기능 블록이 개별 블록들로 표시되지만, 본 발명의 기능 블록들 중 하나 이상은 동일 기능을 실행하는 다양한 하드웨어 및 소프트웨어 구성들의 조합일 수 있다.또한, 어떤 구성요소들을 포함한다는 표현은 \"개방형\"의 표현으로서 해당 구성요소들이 존재하는 것을 단순히 지칭할 뿐이며, 추가적인 구성요소들을 배제하는 것으로 이해되어서는 안 된다. 나아가 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급될 때에는, 그 다른 구성 요소에 직접적으로 연결 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되 어야 한다. 이하에서는 도면들을 참조하여 본 발명의 세부적인 실시 예들에 대해 살펴보도록 한다. 도 1은 본 발명의 제1 실시 예에 따른 청각 자극 이용 기상 유도 시스템의 구성을 개략적으로 도시한 도면이다. 그러나 이는 본 발명의 목적을 달성하기 위한 바람직한 실시 예일 뿐이며, 필요에 따라 일부 구성이 추가되거나 삭제될 수 있고, 어느 한 구성이 수행하는 역할을 다른 구성이 함께 수행할 수도 있음은 물론이다. 또한, 본 발명의 제1 실시 예에 따른 청각 자극 이용 기상 유도 시스템은 프로세서(미도시), 네트워크 인 터페이스(미도시), 메모리(미도시), 스토리지(미도시) 및 이들을 연결하는 데이터 버스(미도시)를 포함할 수 있 으며, 기타 본 발명의 목적을 달성함에 있어 요구되는 부가적인 구성들을 더 포함할 수 있음은 물론이라 할 것 이다. 프로세서(미도시)는 각 구성의 전반적인 동작을 제어한다. 프로세서(미도시)는 CPU(Central Processing Unit), MPU(Micro Processer Unit), MCU(Micro Controller Unit) 또는 본 발명이 속하는 기술 분야에서 널리 알려져 있는 형태의 인공지능 프로세서 중 어느 하나일 수 있다. 아울러, 프로세서(미도시)는 본 발명의 제1실시 예에 따른 청각 자극 이용 기상 유도 시스템에서 설명할 각각의 동작을 수행하기 위한 적어도 하나의 애플리케 이션 또는 프로그램에 대한 연산을 수행할 수 있다. 네트워크 인터페이스(미도시)는 본 발명의 제1 실시 예에 따른 청각 자극 이용 기상 유도 시스템의 유무선 인터넷 통신을 지원하며, 그 밖의 공지의 통신 방식을 지원할 수도 있다. 따라서 네트워크 인터페이스(미도시) 는 그에 따른 통신 모듈을 포함하여 구성될 수 있다. 메모리(미도시)는 각종 정보, 명령 및/또는 정보를 저장하며, 본 발명의 제2실시 예에 따른 청각 자극 이용 기 상 유도 방법을 수행하기 위해 스토리지(미도시)로부터 하나 이상의 컴퓨터 프로그램을 로드할 수 있다. 메모리(미도시)는 RAM으로 구성될 수 있으나, 이로 한정되지 않으며, 다양한 저장 매체를 메모리(미도시)로 이 용할 수 있음은 물론이다. 스토리지(미도시)는 하나 이상의 컴퓨터 프로그램 및 대용량 네트워크 정보를 비임시적으로 저장할 수 있다. 이 러한 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크(HDD), 보조 저장 매치(SSD), 착탈 형 디스크, 또는 본 발명이 속하는 기술 분야에서 널리 알려져 있는 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체 중 어느 하나일 수 있다. 그리고 데이터 버스(미도시)는 이상 설명한 프로세서(미도시), 네트워크 인터페이스(미도시), 메모리(미도시) 및 스토리지(미도시) 사이의 명령 및/또는 정보의 이동 경로가 된다. 이상 간단하게 설명한 본 발명의 제1 실시 예에 따른 청각 자극 이용 기상 유도 시스템은 독립된 디바이스 의 형태, 예를 들어 전자 기기나 서버(클라우드 포함)의 형태일 수 있으며, 여기서 전자 기기는 한 장소에 고정 설치되어 사용하는 데스크톱 PC, 서버 디바이스 등과 같은 기기 뿐만 아니라, 스마트폰, 태블릿 PC, 노트북 PC, PDA, PMP 등과 같이 휴대가 용이한 포터블 기기 등이라도 무방한바, 프로세서에 해당하는 CPU 등이 설치되고 네 트워크 기능만 보유하고 있는 전자 기기라면 어떠한 것이라도 무방하다 할 것이다. 도 1을 참고하면, 청각 자극 이용 기상 유도 시스템은 뇌 신호 측정부, 전처리부, 특징 추출부 , 수면 상태 판단부 및 청각 자극 제공부를 포함할 수 있다. 그리고 청각 자극 이용 기상 유도 시스템은 사용자 단말과 유무선으로 데이터를 송수신할 수 있으며, 유무선 데이터 송수신 방법은 특정 통신 방법으로 한정되지 않을 것이다. 또한, 청각 자극 이용 기상 유도 시스템은 통신부(미도시)를 포함할 수 있으며, 통신부(미도시)를 통해 사 용자 단말과 데이터 송수신을 할 수 있다. 그리고 명세서 전체에서 사용자 단말은 한 장소에 고정 설치되어 사용하는 데스크톱 PC, 서버 디바이스 등 과 같은 기기 뿐만 아니라, 스마트폰, 태블릿 PC, 노트북 PC, PDA, PMP 등과 같이 휴대가 용이한 포터블 기기 등이라도 무방한바, 프로세서에 해당하는 CPU 등이 설치되고 네트워크 기능만 보유하고 있는 전자 기기라면 어 떠한 것이라도 무방하다 할 것이다. 그리고 청각 자극 이용 기상 유도 시스템은 사용자 단말로부터 기준 수면 시간을 수신할 수 있다. 이러한 기준 수면 시간은 사용자가 설정한 기준 수면 시간을 의미할 수 있다. 또한, 청각 자극 이용 기상 유도 시스템은 사용자 단말로부터 수신한 기준 수면 시간을 기준으로 하여, 사용자의 실제 수면 시간과 기준 수면 시간을 비교할 수 있다. 그리고 사용자의 실제 수면 시간과 기준 수면 시간의 비교 결과, 기 설정한 시간 범위 이내인 경우에, 뇌 신호 측정부는 사용자의 뇌 신호를 측정할 수 있다. 여기서 기 설정한 시간 범위는 사용자가 자유롭게 설정할 수 있다. 보다 상세하게는 사용자의 실제 수면 시간과 기준 수면 시간의 비교 결과, 기 설정한 시간 범위 이내인 경우에, 뇌 신호 측정부는 사용자의 수면 중 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 뇌 신 호를 측정할 수 있다. 또한, 보다 상세하게는 사용자의 실제 수면 시간과 기준 수면 시간의 비교 결과, 기 설정한 시간 범위 이내인 경우에, 뇌 신호 측정부는 30초마다 반복적으로 사용자의 수면 중 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 뇌 신호를 측정할 수 있다. 여기서 상술한 30초는 수면 단계 분류를 진행할 때 일반적으로 인공지능을 학습시키기 위한 시간을 의미할 수 있다. 즉, 30초는 반복적으로 뇌 신호 측정부가 사용자의 수면 중 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 뇌 신호를 측정할 수 있다는 것을 설명하기 위한 것임과 동시에 수면 단계 분류를 진행할 때 일반적으로 인공지능을 학습시키기 위한 시간을 의미할 수 있는 것이다. 그리고 상술한 30초와 같이 반복적으로 뇌 신호 측정부가 사용자의 수면 중 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 뇌 신호를 측정하도록 하는 시간을 기 설정된 단위 시간으로 정의할 수 있을 것이다. 다만, 30초의 경우에는 변경이 가능할 수 있다. 또한, 해당 반복 기준 시간마다 뇌 신호 측정부가 측정한 뇌 신호를 전처리부는 특정 주파수 대역을 필터링할 수 있고, 필터링한 뇌 신호에서 노이즈를 제거할 수 있다. 또한, 해당 반복 기준 시간마다 특징 추출부는 전처리부가 필터링하고 노이즈를 제거한 특정 주파수 대역의 뇌 신호(이하, 특정 주파수 뇌 신호)에서 특정 주파수 뇌 신호의 특징을 추출할 수 있다. 그리고 해당 반복 기준 시간마다 수면 상태 판단부는 특징 추출부의 특정 주파수 뇌 신호의 특징 추 출 결과를 이용하여 사용자의 수면 상태를 판단할 수 있다. 즉, 뇌 신호 측정부는 사용자가 수면을 하기 위해 누워있는 상태에 있을 경우, 사용자의 뇌 및 눈의 움직 임 중 적어도 하나를 통해서 발생하는 뇌 신호를 측정할 수 있다. 그리고 뇌 신호 측정부는 사용자의 두피에 부착된 뇌 신호 전극을 통해 사용자의 뇌 신호를 측정할 수 있 고, 이러한 뇌 신호 전극은 1개의 레퍼런스 전극 및 1개의 그라운드 전극을 포함할 수 있다. 또한, 이러한 뇌 신호 측정부에 있어서 사용자의 두피에 부착된 뇌 신호 전극의 측정 전극 위치는 국제 표 준 10-20 전극 시스템을 따를 수 있다. 그리고 전처리부는 뇌 신호 측정부가 측정한 뇌 신호에서 특정 주파수 대역을 필터링할 수 있고, 필 터링한 뇌 신호에서 노이즈를 제거할 수 있다. 보다 상세하게는, 전처리부는 뇌 신호 측정부가 측정한 뇌 신호에서 필터링하는 사용자의 수면과 관 련된 특정 주파수 대역은 알파파, 베타파, 델타파, 감마파 및 세타파 대역을 포함할 수 있다. 그리고 전처리부는 필터링한 뇌 신호에서 사용자의 뒤척임, 사용자의 두피에 부착된 뇌 신호 전극 빠짐 등 에 의해 발생할 수 있는 노이즈를 다운샘플링, 밴드패스필터, 독립성분분석 등의 다양한 전처리 방법을 이용하 여 제거할 수 있다. 또한, 특징 추출부는 전처리부가 필터링하고 노이즈를 제거한 특정 주파수 대역의 뇌 신호(이하, 특 정 주파수 뇌 신호)에서 특정 주파수 뇌 신호의 특징을 추출할 수 있다. 그리고 특징 추출부는 뇌 신호에서 주파수 파워 및 스펙트로그램 중 적어도 하나를 이용하여 특정 주파수 뇌 신호의 특징을 추출할 수 있다. 여기서, 특징 추출부가 주파수 파워 및 스펙트로그램 중 적어도 하나를 이용하여 특정 주파수 뇌 신호의 특징을 추출할 수 있는 뇌 신호는 전처리부가 필터링하고 노이즈를 제거한 특정 주파수 대역의 뇌 신호로 서 특정 주파수 뇌 신호를 의미할 수 있다. 또한, 특징 추출부는 특정 주파수 뇌 신호에서 주파수 파워를 이용해 특정 주파수 뇌 신호의 특징을 추출 하는 경우, 특정 주파수 뇌 신호를 알파파, 베타파, 델타파, 감마파 및 세타파로 구분할 수 있고, 구분한 특정 주파수 뇌 신호의 특징을 추출할 수 있다. 즉, 특징 추출부는 특정 주파수 뇌 신호에 있어서 알파파, 베타파, 델타파, 감마파 및 세타파 각각의 진폭 을 확인할 수 있으며, 해당 주파수의 파워(진폭)을 통해 특정 주파수 뇌 신호의 특징을 추출할 수 있다. 또한, 수면 상태 판단부는 특징 추출부의 특정 주파수 뇌 신호의 특징 추출 결과를 이용하여 사용자 의 수면 상태를 판단할 수 있다. 그리고 수면 상태 판단부는 특징 추출부가 추출한 특정 주파수 뇌 신호의 특징을 이용하여 사용자의 수면 상태를 판단할 수 있다. 또한, 수면 상태 판단부는 특정 주파수 뇌 신호의 특징을 이용하여 사용자의 수면 상태를 비 수면, 렘수면, 비 렘수면 1단계, 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 하나로 판단할 수 있다. 보다 상세하게는 수면 상태 판단부는 수면 장애가 없는 건강한 성인들의 밤잠 동안 측정된 공개된 수면 데 이터 셋 3가지(Sleep-edf, SHHS, MASS)를 이용하여 수면 상태 판단을 위한 분류 모델을 학습할 수 있다. 그리고 수면 상태 판단을 위한 분류 모델은 빠른 예측을 위해 컨볼루션 뉴럴 네트워크(CNN) 기반의 모델로 구성 될 수 있다. 또한, 수면 상태 판단부의 수면 상태 판단을 위한 분류 모델은 컨볼루션 연산을 통해 특정 주파수 뇌 신호 의 특징으로서 신호의 시간, 주파수적 특징을 추출하고 라벨링된 수면 단계와 대조하는 과정을 수행할 수 있으 며, 이를 통해 수면 상태 판단부는 사용자의 수면 상태를 비 수면, 렘수면, 비 렘수면 1단계, 비 렘수면 2 단계 및 비 렘수면 3단계 중 적어도 하나로 판단할 수 있다. 그리고 수면 상태 판단부는 기 설정된 단위 시간 간격으로 반복하여 사용자의 수면 상태를 판단할 수 있다. 또한, 청각 자극 제공부는 수면 상태 판단부가 판단한 사용자의 수면 상태에 대응하는 청각 자극을 사용자에게 제공할 수 있다. 그리고 청각 자극 제공부는 사용자가 설정한 기준 수면 시간을 기준으로 하여, 기준 수면 시간 및 사용자 의 실제 수면 시간을 비교할 수 있고, 비교 결과 기 설정한 시간 범위 이내인 경우에는 사용자에게 청각 자극을 제공할 수 있다. 또한, 청각 자극 제공부는 청각 자극 미제공, 알파파 및 베타파 중 적어도 하나를 사용자의 수면 상태에 대응하여 선택할 수 있다. 그리고 청각 자극 제공부는 알파파 및 베타파 중 적어도 하나를 선택한 경우에는 선택한 청각 자극을 사용 자에게 제공할 수 있다. 또한, 청각 자극 제공부는 청각 자극 미제공을 선택한 경우에는 사용자에게 청각 자극을 제공하지 않을 수 있다. 그리고 청각 자극 제공부는 기준 수면 시간 및 사용자의 실제 수면 시간을 비교 결과, 기준 수면 시간 및 사용자의 실제 수면 시간이 일치할 경우, 사용자 단말은 기상 알람을 출력할 수 있다.또한, 청각 자극 제공부는 수면 상태 판단부가 판단한 사용자의 수면 상태에 대응하여 사용자의 수면 상태가 비 렘수면 2단계 및 비 렘수면 3단계와 같이 깊은 수면 단계인 경우, 깊은 수면 단계에 대응하는 청각 자극을 제공할 수 있고, 렘수면 및 비 렘수면 1단계와 같이 얕은 수면 단계인 경우, 얕은 수면 단계에 대응하는 청각 자극을 제공할 수 있다. 수면 상태 판단부가 판단한 사용자의 수면 상태가 비 수면인 경우, 청각 자극 제공부는 사용자 단말 로 청각 자극을 제공하지 않을 수 있다. 이는 사용자가 수면 상태가 아니라 깨어있음을 의미하는 비 수면 상태로 수면 상태 판단부가 판단하였기 때문이다. 그리고 수면 상태 판단부가 판단한 사용자의 수면 상태가 렘수면 및 비 렘수면 1단계 중 적어도 하나인 경 우에는, 청각 자극 제공부는 사용자 단말로 알파파의 청각 자극을 제공할 수 있다. 또한, 수면 상태 판단부가 판단한 사용자의 수면 상태가 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 하나인 경우에는, 청각 자극 제공부는 사용자 단말로 베타파의 청각 자극을 제공할 수 있다. 이처럼 사용자의 수면 상태에 따라 상이한 주파수의 청각 자극을 제공함으로써, 수면 관성을 줄일 수 있고, 사 용자의 기상이 편안하도록 만들 수 있다. 보다 상세하게는 렘수면은 동공 운동이 활발한 상태로, 일반적으로 꿈을 꾸고 있는 단계이며, 비 렘수면 1단계 는 수면과 각성의 사이에 있는 단계이다. 그리고 사용자의 수면 상태가 렘수면 및 비 렘수면 1단계 중 적어도 어느 하나인 경우 해당 사용자의 뇌 신호는 주파수 대역이 8Hz 내지 12Hz에 해당하는 알파파가 높은 비중을 차지한다. 또한, 비 렘수면 2단계는 얕은 잠의 단계이고, 비 렘수면 3단계는 깊은 잠의 단계이다. 여기서, 비 렘수면 2단계가 얕은 잠의 단계라는 것은 깊은 수면 단계에 있어서 얕은 잠이라는 의미이며, 수면과 각성의 사이에 있는 단계로서 얕은 수면 단계를 의미하는 것은 아니다. 그리고 사용자의 수면 상태가 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 어느 하나인 경우 해당 사용자의 뇌 신호는 주파수 대역이 1Hz 내지 4Hz에 해당하는 델타파가 높은 비중을 차지한다. 또한, 사용자의 수면 상태가 비 수면인 경우에는 해당 사용자의 뇌 신호는 주파수 대역이 고주파에 해당하는 베 타파가 높은 비중을 차지한다. 여기서 베타파는 SMR(12Hz 내지 15Hz), mid-beta(15Hz 내지 18Hz) 및 high-beta(20Hz 이상)으로 구분될 수 있 다. 수면 관성이란 짧게는 수초, 길게는 수분까지 잠에서 쉽게 깨지 못하는 현상을 의미하며, 이 때의 뇌 신호는 주 파수 대역이 1Hz 내지 4Hz에 해당하는 델타파가 크게 나타나고 그에 비해 베타파는 감소하는 형태로 나타나는 것이 특징으로 알려져 있다. 따라서, 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 어느 하나의 경우와 같이 사용자의 뇌 신호에 있어서 델타파의 비중이 높은 경우에 기상하게 된다면, 렘수면 및 비 렘수면 1단계 중 적어도 하나인 경우에 사용자가 기상하는 경우보다 수면 관성이 강하게 나타날 확률이 매우 높다. 따라서, 수면 관성이 강하게 나타날 확률이 높은 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 어느 하나의 경우에 기상하는 것보다 렘수면 및 비 렘수면 1단계 중 적어도 하나인 경우에 기상하는 것이 수면 관성이 약하 게 나타날 것이고 이는 기상할 때 사용자가 상쾌한 감정을 느낄 수 있도록 해줄 것이다. 그러므로 수면 상태 판단부가 판단한 사용자의 수면 상태가 렘수면 및 비 렘수면 1단계 중 적어도 하나인 경우에는, 청각 자극 제공부는 사용자 단말로 상대적으로 저주파이자 기상과 인지능력에 도움을 주는 알파파의 청각 자극을 제공할 수 있다. 즉, 사용자의 수면 상태가 렘수면 및 비 렘수면 1단계 중 적어도 어느 하나인 경우 해당 사용자의 뇌 신호는 주 파수 대역이 8Hz 내지 12Hz에 해당하는 알파파가 높은 비중을 차지하는바, 해당 사용자의 뇌 신호에서 높은 비 중을 차지하는 알파파의 청각 자극을 청각 자극 제공부가 사용자에게 지속적으로 제공함으로써, 사용자가 얕은 수면 단계를 유지할 수 있도록 도와줄 수 있다.또한, 수면 상태 판단부가 판단한 사용자의 수면 상태가 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 하나인 경우에는, 청각 자극 제공부는 사용자 단말로 비 수면 상태에서의 사용자의 뇌 신호에서 높은 비중을 차지하는 베타파의 청각 자극을 제공할 수 있다. 즉, 사용자의 수면 상태가 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 어느 하나인 경우 사용자의 뇌 신호 는 주파수 대역이 1Hz 내지 4Hz에 해당하는 델타파가 높은 비중을 차지하는바, 비수면 상태에서 활성화되는 베 타파의 청각 자극을 해당 사용자에게 지속적으로 제공함으로써, 사용자의 수면 상태가 깊은 수면 단계인 비 렘 수면 2단계 및 비 렘수면 3단계 중 적어도 어느 하나에서 얕은 수면 단계인 렘수면 및 비 렘수면 1단계 중 적어 도 어느 하나로 사용자의 수면 상태를 바꿀 수 있을 것이다. 이를 통해 사용자가 기상함에 있어 강한 수면 관성을 가져오는 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 어느 하나에서 약한 수면 관성을 가져오는 렘수면 및 비 렘수면 1단계 중 적어도 어느 하나로 손쉽게 사용자의 수면 상태를 바꿀 수 있고, 이는 사용자가 기상하는 과정에서 보다 상쾌하고 가벼운 느낌을 받을 수 있도록 도 움을 줄 수 있다. 도 2는 본 발명의 제1 실시 예에 따른 청각 자극 이용 기상 유도 시스템을 통해 사용자 단말에서 확인할 수 있 는 내용을 예시적으로 도시한 도면이다. 도 2를 참고하면, 청각 자극 이용 기상 유도 시스템을 통해 사용자 단말은 사용자 단말 사용자의 수면 상태에 대한 수면 상태 판단부의 판단(도 2의 수면 단계 분류 결과), 청각 자극 제공부의 알파 파 및 베타파 중 적어도 하나의 청각 자극을 사용자에게 제공한 결과(도 2의 자극 제시 결과), 특징 추출부 가 추출한 특정 주파수 뇌 신호에 있어서 알파파, 베타파, 델타파, 감마파 및 세타파 각각의 진폭(파워) (도 2의 현재 상태) 및 사용자의 수면 상태에 대한 수면 상태 판단부의 판단에 대응하는 청각 자극 제공부 가 제공할 알파파 및 베타파 중 적어도 하나에 대한 추천 결과(도 2의 추천 정도)를 출력할 수 있다. 이를 통해 본 발명은 사용자의 상쾌한 기상을 유도하여 수면 도중의 질뿐만 아니라, 수면 이후의 질도 향상시키 는 서비스를 제공할 수 있으며, 수면의 질 향상을 위한 수면 보조 제품의 활용성이 개선 가능할 것으로 판단되 고, 수면 장애 치료 기기로 활용할 수 있을 것이며, 수면 전, 수면 중 뿐만 아닌 수면 이후에 느낄 수 있는 수 면의 질 향상에도 기여할 수 있는 효과가 있다. 또한, 본 발명의 또 다른 실시 예로 청각 자극 이용 기상 유도 시스템은 기상 유도 시스템이 아닌 수면 유 도 시스템으로 이용 가능할 것이다. 이하 청각 자극 이용 기상 유도 시스템을 이용한 수면 유도 시스템의 경우에는 상술한 청각 자극 이용 기 상 유도 시스템과 동일한 기능 및 동작을 수행할 수 있다. 이를 구체적으로 설명하자면, 사용자가 빠르게 수면 상태에 들어가기 위해, 사용자 단말이 청각 자극 이용 기상 유도 시스템에 수면 유도 모드를 송신할 수 있다. 이후, 뇌 신호 측정부는 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 현재 사용자의 뇌 신호(이하, 현재 사용자 뇌 신호)를 측정할 수 있다. 그리고 전처리부는 현재 사용자 뇌 신호에서 특정 주파수 대역을 필터링할 수 있고, 필터링된 현재 사용자 뇌 신호로부터 노이즈를 제거할 수 있다. 이를 통해 순수한 현재 사용자의 뇌 신호를 확인할 수 있다. 또한, 특징 추출부는 전처리부가 필터링하고, 노이즈를 제거한 특정 주파수 대역의 현재 사용자 뇌 신호에서 특정 주파수 대역의 현재 사용자 뇌 신호의 특징을 추출할 수 있다. 그리고 수면 상태 판단부는 특징 추출부가 추출한 특정 주파수 대역의 현재 사용자 뇌 신호의 특징을 이용하여 사용자의 수면 상태를 판단할 수 있다. 또한, 청각 자극 제공부는 수면 상태 판단부가 판단한 사용자의 수면 상태에 대응하는 청각 자극을 사용자에게 제공할 수 있다. 보다 상세하게는, 현재 사용자 단말을 통해 청각 자극 이용 기상 유도 시스템으로 수면 유도 모드를 송신한 사용자의 수면 상태를 수면 상태 판단부가 판단할 수 있다. 그리고 수면 상태 판단부의 판단 결과, 현재 사용자의 수면 상태가 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 어느 하나의 경우라면, 청각 자극 제공부는 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 어 느 하나의 경우는 주파수 대역이 1Hz 내지 4Hz에 해당하는 델타파가 높은 비중을 차지하는바, 이와 동일한 델타 파의 청각 자극을 사용자에게 제공할 수 있다. 또한, 수면 상태 판단부가 판단한 사용자의 수면 상태가 비 수면, 렘수면 및 비 렘수면 1단계 중 적어도 하나인 경우에는 깊은 수면 단계에 해당하는 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 어느 하나의 경우 에 높은 비중을 차지하는 델타파의 청각 자극을 사용자에게 제공할 수 있다. 이를 통해 본 발명을 실시한 사용자는 비 수면의 경우이거나, 렘수면 및 비 렘수면 1단계의 경우와 같이 얕은 수면 단계에서 깊은 수면 단계인 비 렘수면 2단계 및 비 렘수면 3단계로 진행될 수 있으며, 이를 통해 사용자는 수면 질환 또는 수면 장애가 있는 경우라고 하더라도 보다 편하게 숙면을 취할 수 있는 효과가 있다. 도 3은 본 발명의 제2 실시 예에 따른 청각 자극 이용 기상 유도 방법의 대표적인 단계를 나타낸 순서도이다. 도 3을 참고하면, 본 발명의 제2 실시 예에 따른 청각 자극 이용 기상 유도 방법은 뇌 신호 측정부가 사용 자의 수면 중 사용자의 뇌 및 눈의 움직임 중 적어도 하나를 통해서 발생하는 뇌 신호를 측정할 수 있다.(S330) 그리고 전처리부가 상기 뇌 신호 측정부가 측정한 상기 뇌 신호에서 특정 주파수 대역을 필터링할 수 있다.(S331) 또한, 전처리부가 필터링된 특정 주파수 대역의 뇌 신호에서 노이즈를 제거할 수 있다.(S332) 그리고 특징 추출부가 전처리부가 필터링하고, 노이즈를 제거한 특정 주파수 대역의 뇌 신호(이하, 특정 주파수 뇌 신호)에서 특정 주파수 뇌 신호의 특징을 추출할 수 있다.(S333) 또한, 수면 상태 판단부가 특징 추출부가 추출한 특정 주파수 뇌 신호의 특징을 이용하여 사용자의 수면 상태를 판단할 수 있다.(S334) 그리고 청각 자극 제공부가 수면 상태 판단부가 판단한 사용자의 수면 상태에 대응하는 청각 자극을 사용자에게 제공할 수 있다.(S335) 도 4는 본 발명의 제3 실시 예에 따른 청각 자극 이용 기상 유도 방법의 대표적인 단계를 나타낸 순서도이다. 도 4를 참고하면, 제3 실시 예에 따른 청각 자극 이용 기상 유도 방법은 청각 자극 이용 기상 유도 시스템(10 0)은 사용자 단말로부터 기준 수면 시간을 수신할 수 있다.(S430) 그리고 청각 자극 이용 기상 유도 시스템은 사용자 단말로부터 수신한 기준 수면 시간을 기준으로 하 여, 사용자의 실제 수면 시간과 기준 수면 시간을 비교할 수 있다.(S431) 여기서, 그리고 사용자의 실제 수면 시간과 기준 수면 시간의 비교 결과, 기 설정한 시간 범위 이내인 경우에는 S433단계를 수행할 수 있고, 사용자의 실제 수면 시간과 기준 수면 시간의 비교 결과, 기 설정한 시간 범위 이 내가 아니라면, S431단계를 수행할 수 있다. 사용자의 실제 수면 시간과 기준 수면 시간의 비교 결과, 기 설정한 시간 범위 이내인 경우에는 뇌 신호 측정부 는 사용자의 뇌 신호를 측정할 수 있다.(S433) 그리고 수면 상태 판단부는 특징 추출부의 특정 주파수 뇌 신호의 특징 추출 결과를 이용하여 사용자 의 수면 상태를 판단할 수 있다.(S434) 다만 여기서 S434 단계를 수행하기 위해 필요한 특정 주파수 뇌 신호의 특징 추출 결과와 관련한 내용은 본 명 세서에서 설명한 상술한 내용과 동일할 것이다. 즉, 전처리부가 뇌 신호 측정부가 측정한 뇌 신호에서 특정 주파수 대역을 필터링할 수 있고, 필터링 한 뇌 신호에서 노이즈를 제거할 수 있다. 그리고 특징 추출부는 전처리부가 필터링하고 노이즈를 제거한 특정 주파수 대역의 뇌 신호(이하, 특 정 주파수 뇌 신호)에서 특정 주파수 뇌 신호의 특징을 추출할 수 있다. 이후, 수면 상태 판단부는 특징 추출부의 특정 주파수 뇌 신호의 특징 추출 결과를 이용하여 사용자 의 수면 상태를 판단할 수 있다. 또한, 청각 자극 제공부는 수면 상태 판단부가 판단한 사용자의 수면 상태에 대응하는 청각 자극을 사용자에게 제공할 수 있다.(S435) 그리고 상술한 것과 마찬가지로 청각 자극 제공부는 수면 상태 판단부가 판단한 사용자의 수면 상태 에 대응하는 청각 자극을 사용자에게 제공하는 것은 본 명세서에서 설명한 상술한 내용과 동일할 것이다. 즉, 수면 상태 판단부는 사용자의 수면 상태를 비 수면, 렘수면, 비 렘수면 1단계, 비 렘수면 2단계 및 비 렘수면 3단계 중 적어도 하나로 판단할 수 있고, 청각 자극 제공부는 수면 상태 판단부가 판단한 사 용자의 수면 상태에 대응하여 사용자의 수면 상태가 비 렘수면 2단계 및 비 렘수면 3단계와 같이 깊은 수면 단 계인 경우, 깊은 수면 단계에 대응하는 청각 자극을 제공할 수 있고, 렘수면 및 비 렘수면 1단계와 같이 얕은 수면 단계인 경우, 얕은 수면 단계에 대응하는 청각 자극을 제공할 수 있다. 그리고 청각 자극 제공부는 사용자가 설정한 기준 수면 시간을 기준으로 하여, 기준 수면 시간 및 사용자 의 실제 수면 시간을 비교할 수 있다.(S436) 비교 결과, 기준 수면 시간 및 사용자의 실제 수면 시간이 일치하는 경우, S437 단계를 수행할 수 있고, 기준 수면 시간 및 사용자의 실제 수면 시간이 일치하지 않는 경우, S433단계를 수행할 수 있다. 청각 자극 제공부는 기준 수면 시간 및 사용자의 실제 수면 시간을 비교 결과, 기준 수면 시간 및 사용자 의 실제 수면 시간이 일치할 경우, 사용자 단말은 기상 알람을 출력할 수 있다.(S437) 이상 첨부된 도면을 참조하여 본 발명의 실시 예들을 설명하였지만, 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0111186", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 제1 실시 예에 따른 청각 자극 이용 기상 유도 시스템의 구성을 개략적으로 도시한 도면이다. 도 2는 본 발명의 제1 실시 예에 따른 청각 자극 이용 기상 유도 시스템을 통해 사용자 단말에서 확인할 수 있 는 내용을 예시적으로 도시한 도면이다. 도 3은 본 발명의 제2 실시 예에 따른 청각 자극 이용 기상 유도 방법의 대표적인 단계를 나타낸 순서도이다. 도 4는 본 발명의 제3 실시 예에 따른 청각 자극 이용 기상 유도 방법의 대표적인 단계를 나타낸 순서도이다."}
