{"patent_id": "10-2022-0028754", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0132005", "출원번호": "10-2022-0028754", "발명의 명칭": "승부결과를 예측하는 가상 골프 장치", "출원인": "주식회사 에스지엠", "발명자": "이의범"}}
{"patent_id": "10-2022-0028754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가상 골프코스와 가상 골프공을 보여주는 표시부; 사용자가 실제 골프공을 타격하면, 타격된 상기 실제 골프공의 상태에 근거하여 상기 가상 골프코스에서 상기가상 골프공의 움직임을 산출하는 산출부; 및복수의 사용자 사이에 플레이가 진행 중일 때에, 플레이가 진행되었을 때까지의 플레이 결과를 반영하여 복수의사용자 사이의 승부결과를 예측하는 예측부를;포함하는가상 골프 장치."}
{"patent_id": "10-2022-0028754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 예측부는, 플레이가 진행되었을 때까지의 플레이 결과 및 남아있는 플레이에 대한 예상 플레이 결과를 이용하여 상기 승부결과를 예측하는 가상 골프 장치."}
{"patent_id": "10-2022-0028754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 예측부는, 전체 플레이 중 적어도 일부의 플레이가 진행된 이후부터 상기 승부결과를 예측하는 가상 골프장치."}
{"patent_id": "10-2022-0028754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 승부결과는 확률값으로 예측되고,사용자가 상기 확률값과 관련된 소정의 조건을 충족시키는 경우, 해당 사용자에게 보상하거나 또는 페널티를 부여할 수 있는 가상 골프 장치."}
{"patent_id": "10-2022-0028754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,음성으로 플레이 정보를 제공하는 사운드부를 더 포함하고,상기 표시부 또는 상기 사운드부는 상기 예측부에서 예측한 승부결과를 사용자에게 제공하는 가상 골프 장치."}
{"patent_id": "10-2022-0028754", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 승부결과를 예측하는 가상 골프 장치를 제공한다. 상기 가상 골프 장치는 가상 골프코스와 가상 골프 공을 보여주는 표시부, 사용자가 실제 골프공을 타격하면, 타격된 상기 실제 골프공의 상태에 근거하여 상기 가 상 골프코스에서 상기 가상 골프공의 움직임을 산출하는 산출부, 및 복수의 사용자 사이에 플레이가 진행 중일 때에, 플레이가 진행되었을 때까지의 플레이 결과를 반영하여 복수의 사용자 사이의 승부결과를 예측하는 예측부 를 포함한다."}
{"patent_id": "10-2022-0028754", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가상 골프 장치에 관한 것으로, 보다 상세하게는 승부결과를 예측하여 사용자에게 제공하는 가상 골 프 장치에 관한 것이다."}
{"patent_id": "10-2022-0028754", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 골프의 인기가 높아지면서 골프를 즐기는 인구가 증가하고 있다. 골프는 실외 골프장에서의 골프뿐만 아니 라, 가상 골프 장치 등을 이용하여 골프를 플레이 할 수 있는 스크린 골프의 인기도 높아지고 있다. 스크린 골프에서는 스크린을 통하여 골프장의 영상이 표시되기 때문에 마치 야외에서 실제의 골프 경기를 하고 있는 듯한 인상을 줄 수 있다. 또한 야외의 골프장에서 경기하는 것에 비해 시간과 비용이 세이브되기 때문에, 스크린 골 프는 시간이나 경제적인 이유 등으로 야외 골프를 하기 어려운 바쁜 현대인들에게 대단히 인기가 높다. 하지만 스크린 골프를 이용하는 사람들이 점점 늘어나면서 스크린 골프에 대한 사용자의 기대치가 높아지고 있 다. 스크린 골프와 실제 골프를 비교하면, 스크린 골프는 밀폐된 실내 공간에서 서비스되는 특성상 오픈된 야외 공간에서 이루어지는 실제 골프에서 제공하기 어려운 기술적 서비스를 사용자에게 제공할 수 있는 장점이 있다. 따라서 이러한 장점을 활용함으로써 스크린 골프에서는 여러가지 기술을 통하여 스크린 골프 플레이에 대한 사 용자의 흥미를 고취시킬 필요가 있다."}
{"patent_id": "10-2022-0028754", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 사정을 감안하여 발명된 것으로, 플레이가 종료되기 전에 승부결과를 미리 예측할 수 있는 가 상 골프 장치를 제공하는 것을 그 목적으로 한다. 또한 본 발명의 다른 목적들은 이하의 설명과 첨부한 도면으로부터 명확하게 이해될 수 있다."}
{"patent_id": "10-2022-0028754", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 실시예에 따른 가상 골프 장치는 가상 골프코스와 가상 골프공을 보여 주는 표시부, 사용자가 실제 골프공을 타격하면, 타격된 상기 실제 골프공의 상태에 근거하여 상기 가상 골프코 스에서 상기 가상 골프공의 움직임을 산출하는 산출부, 및 복수의 사용자 사이에 플레이가 진행 중일 때에, 플 레이가 진행되었을 때까지의 플레이 결과를 반영하여 복수의 사용자 사이의 승부결과를 예측하는 예측부를 포함 한다. 상기 가상 골프 장치에 있어서, 상기 예측부는, 플레이가 진행되었을 때까지의 플레이 결과 및 남아있는 플레이 에 대한 예상 플레이 결과를 이용하여 상기 승부결과를 예측할 수 있다. 상기 가상 골프 장치에 있어서, 상기 예측부는, 전체 플레이 중 적어도 일부의 플레이가 진행된 이후부터 상기 승부결과를 예측할 수 있다. 상기 가상 골프 장치에 있어서, 상기 승부결과는 확률값으로 예측되고, 사용자가 상기 확률값과 관련된 소정의 조건을 충족시키는 경우, 해당 사용자에게 보상하거나 또는 페널티를 부여할 수 있다. 상기 가상 골프 장치는 음성으로 플레이 정보를 제공하는 사운드부를 더 포함하고, 상기 표시부 또는 상기 사운 드부는 상기 예측부에서 예측한 승부결과를 사용자에게 제공할 수 있다."}
{"patent_id": "10-2022-0028754", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 가상 골프 장치에 따르면, 플레이가 종료되기 전에 승부결과를 미리 예측하여 사용자에게 제공함으로 써 사용자의 흥미를 고취시킬 수 있는 효과가 있다."}
{"patent_id": "10-2022-0028754", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예들을 통하여 본 발명을 상세하게 설명한다. 본 발명의 목적, 특징, 장점은 이하의 실시예들을 통해 쉽게 이해될 것이다. 본 발명은 여기서 설명되는 실시예들에 한정되지 않고, 다른 형태로 구체화될 수도 있다. 여기서 소개되는 실시예들은 개시된 내용이 철저하고 완전해질 수 있도록 그리고 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 따라서, 이하의 실시예들에 의하여 본 발명이 제한되어서는 안 된다. 본 명세서에서 제1, 제2 등의 용어가 다양한 요소들(elements)을 기술하기 위해서 사용되었지만, 상기 요소들이 이 같은 용어들에 의해서 한정되어서는 안 된다. 이러한 용어들은 단지 상기 요소들을 서로 구별시키기 위해서 사용되었을 뿐이다. 또, 어떤 요소가 다른 요소 위에 있다고 언급되는 경우에 그것은 다른 요소 위에 직접 형성 될 수 있거나 또는 그들 사이에 제3의 요소가 개재될 수도 있다는 것을 의미한다. 도면들에서 요소의 크기, 또는 요소들 사이의 상대적인 크기는 본 발명에 대한 더욱 명확한 이해를 위해서 다소 과장되게 도시될 수 있다. 또, 도면들에 도시된 요소의 형상이 제조 공정상의 변이 등에 의해서 다소 변경될 수 있을 것이다. 따라서, 본 명세서에서 개시된 실시예들은 특별한 언급이 없는 한 도면에 도시된 형상으로 한정되 어서는 안 되며, 어느 정도의 변형을 포함하는 것으로 이해되어야 한다. 도 1은 본 발명의 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 가상 골프 장치는 타격플레이트, 제어부, 감지부, 입력 부, 사운드부 및 표시부를 포함한다. 타격 플레이트는 사용자가 골프공을 타격하기 위하여 위치하는 영역으로, 타격 플레이트에는 상하로 이 동가능한 구조의 오토 티가 설치되어 있어서, 오토 티를 통하여 사용자에게 타격용 골프공이 자동으로 제공될 수 있다. 제어부는 가상 골프 장치의 각 구성품 사이의 전반적인 동작을 컨트롤한다. 예를 들면, 제어부는 타격 플레이트에 설치되어 있는 상기 오토 티를 컨트롤하여, 사용자가 타격하는 시점에 맞추어 상기 오토 티에서 타격용 골프공이 제공되도록 할 수 있다. 또한 사용자가 특정 골프코스를 선택한 경우, 해당 골프코스에서 플레 이할 수 있도록 제어부는 관련 동작을 실행할 수 있다. 즉 제어부는 영상을 처리하는 영상처리수단을 통하여 사용자가 선택한 특정 골프코스의 영상을 형성한 후 이를 표시부로 전달하여 디스플레이되도록 할 수 있다. 또한 제어부는 산출부와 예측부와 저장부를 구비하고 있다. 산출부는 사용자가 타격한 골프공이 실제 골프장에서 타격되었다고 가정했을 때에 어떠한 궤적을 갖게 될 지를 산출하는 산출과정 을 수행한다. 예측부는 사용자간 플레이가 종료되기 이전에 승부의 결과를 예측하는 역할을 하는데, 이러한 승부예측의 상세내용은 후술한다. 저장부는 메모리나 하드 디스크 등과 같은 저장기기를 포함하며, 제어부 의 동작에 필요한 각종 데이터를 저장하고 있다. 감지부는 골프클럽의 움직임이나 사용자가 타격한 골프공의 움직임 등을 감지하여 타격된 골프공에 관한 물 리적 상태 정보를 파악하기 위한 것으로, 감지부로서 골프클럽이나 골프공의 움직임을 촬영할 수 있는 카메 라나 감지센서 등의 감지수단이 사용될 수 있다. 상기 감지수단에는 이미지 센싱, 발광/수광 센싱, 레이저 센싱 등 다양한 센싱 방식이 적용될 수 있고, 이러한 센싱 방식으로 골프클럽이나 사용자가 타격한 골프공의 상태 정 보를 파악할 수 있다. 상기 카메라나 감지센서 등은 단독으로 사용되거나 함께 사용될 수 있고, 또한 1대만 사 용되거나 여러 대가 사용될 수 있다. 감지부를 통하여 얻어진 정보는 제어부에 전달되어 산출과정에 사 용된다. 입력부는 사용자로부터 각종 정보를 입력받기 위한 것으로 키보드나 마우스 등이 사용될 수 있다. 스크린 골프에는 서비스를 제공하기 전에 사용자의 로그인을 요구하는 로그인 시스템이 적용될 수 있고, 로그인 시스템 이 적용되면 사용자가 자신의 아이디나 패스워드를 입력해야 하는데 이 때에 입력부가 사용될 수 있다. 또 한 스크린 골프에서 사용자가 플레이 하고자 하는 골프코스나 플레이 난이도 등과 같은 플레이 옵션을 선택하는 경우 등에도 입력부가 사용될 수 있다. 사운드부는 스피커 등과 같은 음향기기를 포함할 수 있고, 이를 통하여 사용자에게 게임의 진행 상황을 안 내하고 게임의 진행에 따른 각종 효과음을 재생한다. 표시부는 프로젝터와 스크린 등과 같은 기기를 포함한다. 프로젝터는 골프코스와 골프공이 스크린에 디스플 레이되도록 골프 관련 영상을 스크린에 투사하며, 스크린은 투사된 영상을 디스플레이하여 사용자에게 보여준다. 본 명세서에서는 스크린에 디스플레이되는 일부 대상에 대해 '가상'이라는 용어를 붙여서 표현하는 경우가 있는데, 이는 스크린 속 영상으로 디스플레이되는 것이라는 의미로 사용되는 것이며, 현실 세계에 존재 하는 대상물과의 혼동을 피하기 위하여 사용되는 것이다. 예를 들어 '가상의 골프공'이란 스크린에 디스플레이 되는 골프공이라는 의미이고, 이는 현실 세계에서 사용자가 타격하는 실제의 골프공과 혼동되지 않도록 '가상' 이라는 용어를 붙여서 표현한 것이다. 가상 골프 장치는 스크린 골프장에 설치되어 스크린 골프를 플레이할 수 있도록 하는 장치이며, 사용자가 스크 린 골프를 플레이할 때에 가상 골프 장치는 다음과 같이 동작한다. 사용자가 골프공을 타격하면 감지부에서 골프클럽의 움직임이나 사용자가 타격한 골프공의 이동속도나 이동방향 등과 같은 물리적 상태를 감지한다. 감 지부에 의하여 감지된 정보는 제어부에 전달되고, 제어부에 있어서 산출부는 전달된 정보에 의 거하여 골프공의 궤적을 산출하는 산출과정을 수행한다. 표시부에서는 산출과정에서 산출된 궤적대로 가상 의 골프공이 움직이는 영상을 표시하며, 이때에 가상의 골프공은 산출된 궤적으로 비행한 후 스크린 속 가상의 골프코스의 특정지점에 착지하게 되고, 사용자는 가상의 골프공이 착지된 지점에서 넥스트 타격을 이어가게 된 다. 상기한 스크린 골프 플레이 과정에 있어서, 예측부는 사용자 사이의 승부결과를 미리 에측하는 동작을 수행 하고, 상기한 동작에 의한 승부결과의 예측은 사운드부나 표시부 등을 통하여 경기 진행 중에 사용자에 게 제공될 수 있다. 이하에서는 승부예측 동작에 대해 도면을 참조하여 설명한다. 도 2는 도 1의 가상 골프 장치에서 승부결과를 예측하는 과정의 일예를 나타내는 순서도이고, 도 3은 인공지능 을 이용하여 승부결과를 예측하는 방법을 설명하기 위한 도면이며, 도 4 및 도 5는 승부결과 예측을 보여주는 스크린 화면의 예를 나타내는 도면이다. 도 2를 참조하면, 승부결과를 예측하는 동작과정은 제1 내지 제5 단계(S1, S2, S3, S4, S5)를 포함한다. 제1 단 계(S1)에서는 특정 시점까지 사용자 사이에 스크린 골프 플레이가 진행되고, 제2 단계(S2)에서는 상기 특정 시 점까지 진행된 플레이의 결과가 기록되며, 제3 단계(S3)에서는 상기 특정 시점 이후의 남아있는 플레이에 대한 결과가 예측되며, 제4 단계(S4)에서는 제2 및 제3 단계(S2, S3)에서 얻어진 결과물을 통하여 최종 승부의 결과 가 예측되고, 제5 단계(S5)에서는 예측된 결과가 사용자에게 제공된다. 제1 단계(S1)에서 사용자의 스크린 골프 플레이가 소정 시점까지 진행된다. 승부결과는 플레이가 시작되기 전에 사용자들의 과거 기록만으로 예측하는 것도 가능하지만, 플레이가 진행되는 당일 성적에 따라 승부의 결과가 달 라질 수 있으므로, 사용자들의 과거 기록과 함께 당일 성적을 반영하여 승부를 예측하는 것이 바람직하다. 따라 서 당일 성적을 반영하기 위해서 플레이가 어느 정도 진행된 이후에 승부예측을 실행하는 것이 좋다. 예를 들면 전체 플레이 중 적어도 20% 이상 진행된 이후에 승부예측을 실행하는 것이 바람직하다. 플레이가 어느 정도 진 행된 이후 제2 내지 제5 단계(S2-S5)에 따라 승부예측 과정을 실행하는데, 승부예측은 단수 또는 복수회 실행될 수 있다. 예를 들면, 18홀 플레이를 하는 경우 9홀(전체 플레이의 50%)까지 진행된 이후에 1회만 승부예측을 실 행하거나, 또는 9홀 플레이를 하는 경우 3홀(전체 플레이의 33%)까지 진행된 이후 4홀부터 매홀 플레이가 끝날 때마다 승부 예측을 실행할 수 있다. 또는 특정 홀 플레이가 끝났을 때마다 승부예측을 하는 대신에, 사용자가 골프공을 타격하고 그 결과가 나오면 상기 타격결과를 반영하여 승부예측을 실행함으로써, 골프공을 타격할 때 마다 수시로 승부예측을 실행할 수도 있다. 승부예측의 실제 과정은 제2 내지 제4 단계(S2-S4)에서 실행된다. 제2 단계(S2)에서는 승부예측을 하려고 하는 현재의 시점까지 사용자의 플레이 결과를 기록하고, 제3 단계(S3)에서는 현재 시점 이후의 남아있는 플레이에 대한 결과가 예측되며, 제4 단계(S4)에서는 제2 및 제3 단계(S2, S3)에서 얻어진 결과물을 통하여 최종 승부의 결과가 예측된다. 예를 들어, 사용자 A와 사용자 B가 함께 전체 9홀 플레이를 하고 있고, 현재까지 4홀까지 플레이를 진행하여 5 홀부터 9홀까지 5홀 플레이가 남아있는 경우를 가정한다. 4홀까지 사용자 A는 '-1타'를 기록 중이고 사용자 B는 '+1타'를 기록 중이라면, 제2 단계(S2)에서는 「사용자 A: -1/사용자 B: +1」의 기록이 저장된다. 제3 단계(S 3)에서는 5홀부터 9홀까지 플레이에서 사용자 A와 사용자 B가 각각 어떠한 성적을 낼 것인지에 대한 결과가 산 출된다. 남아있는 홀에서의 플레이 결과는 인공지능 등을 이용하여 산출되도록 할 수 있다. 인공지능을 이용하는 경우, 도 3에 도시되어 있는 바와 같이, 입력 데이터를 인공지능에 입력하여 인공지능에 의하여 출력 데이터가 얻어지 도록 할 수 있다. 여기에서 인공지능은 인간의 지적 능력을 인공적으로 구현한 프로그램이며, 인공지능에는 머 신러닝 기술 등이 적용된다. 머신러닝 기술 등을 적용함으로써 규칙에 의해 정해진 결과값을 도출하는 전통적인 프로그램과는 다르게 인공지능이 많은 수의 입력 데이터를 분석하여 스스로 결과값을 도출하도록 할 수 있다. 머신러닝 등의 인공지능 모델은 복수의 층과 각 층을 구성하는 복수의 노드로 이루어진 인공신경망을 포함하고, 상기 복수의 층은 입력층, 은닉층, 출력층을 포함할 수 있다. 입력층은 분석 대상 데이터를 입력 받는 층이고, 출력층은 결과값이 출력되는 층이며, 은닉층은 입력층과 출력층 사이의 중간층을 의미한다. 인공지능을 적용함에 있어서, 입력 데이터는 남아있는 플레이에 대한 예측결과를 얻는데 사용될 수 있는 근거자 료이다. 입력 데이터는 한 가지 종류가 아니라 다양한 종류의 복수 데이터가 될 수 있다. 예를 들면, 남아 있는 코스의 특징(코스 난이도, 코스 구성 등), 사용자의 플레이 유형(사용자가 퍼팅에 강점이 있는 유형이고 남아있 는 코스의 퍼팅 난이도가 높은 편이라면, 해당 사용자는 남아있는 코스에서 좋은 성적을 낼 가능성이 높을 것이 고, 따라서 플레이 유형이나 남아있는 코스의 특징 등은 남아있는 플레이 결과를 예측할 수 있는 중요한 자료가 될 수 있다), 사용자의 과거 플레이 기록, 사용자가 당일 현재까지 플레이한 기록 등이 입력 데이터로 사용될 수 있다. 출력 데이터는 인공지능에 의하여 산출되는 남아있는 플레이에 대한 예측결과가 된다. 상기 인공지능이 플레이 결과를 예측하기 전에 먼저 학습 데이터를 이용하여 인공지능에 학습이 이루어지도록 할 수 있다. 학습 데이터는 학습용 입력 데이터와 학습용 출력 데이터로 이루어진 것이거나 또는 학습용 입력 데이터만으로 이루어진 것일 수 있다. 학습용 입력 데이터를 ID(Input Data), 학습용 출력 데이터를 OD(Output Data)라고 하면, 복수의 학습용 입력 데이터에 대해 실제 승부결과가 어떻게 되었는지를 나타내는 학습용 출력 데이터를 입수한 후, 이를 [(ID1, OD1), (ID2, OD2), (ID3, OD3)....]과 같은 데이터의 세트로 만들어서 인공 지능에게 제공하여 학습시키면 학습이 완료된 인공지능을 얻을 수 있고, 학습이 완료된 인공지능에게 결과를 모 르는 입력 데이터를 입력하면 학습된 내용을 바탕으로 하여 출력 데이터 값을 도출해 낼 수 있다. 제4 단계(S4)에서는 승부예측의 결과가 산출되는데, 가령 9홀 플레이 중 4홀까지 플레이 한 결과 「사용자 A: -1/사용자 B: +1」의 기록이 나왔고, 나머지 5홀부터 9홀까지의 예상 플레이 결과가 「사용자 A: +1/사용자 B: -2」로 산출되었다면, 최종적으로 「사용자 A: 0/사용자 B: -1」이 되어 1타 차이로 사용자 B가 승리하는 승부 결과가 예측될 수 있다. 여기에서 제3 단계(S3)를 통하여 얻어지는 남아있는 플레이에 대한 결과 예측은 여러가 지 형태로 얻어질 수 있다. 예를 들면, 제3 단계(S3)에서 얻어지는 남아 있는 플레이에 대한 예측은, 하나의 결 과로 예측되지 않고 복수의 경우 및 각 경우가 나올 확률의 형태로 예측되도록 할 수 있다. 예를 들면, 사용자 A에 대해서 남아 있는 플레이 결과가 「+2: 20%, +1: 50%, 0: 15%, -1: 10%, -2: 5%」로 되고 사용자 B에 대해 서 「+2: 10%, +1: 15%, 0: 20%, -1: 25%, -2: 30%」로 되는 것과 같은 방식으로, 플레이 결과가 복수의 경우 와 각 경우에 대한 확률로 도출될 수 있다. 이와 같은 경우, 제3 단계(S3)의 결과가 확률로 산출되기 때문에 제 4 단계(S4)에서의 최종 승부결과도 사용자 A, B 중 누가 승리하고 패배한다는 방식으로 나오는 것이 아니고, 사 용자 A가 얼마의 확률로 패배하고 사용자 B가 얼마의 확률로 승리한다는 방식으로 승률로 표시될 수 있다. 제5 단계(S5)에서는 제4 단계(S4)에서 얻어진 승부예측의 결과를 사용자에게 전달한다. 승부예측의 결과는 사운 드부를 이용하여 음성으로 사용자에게 제공하거나 또는 표시부를 이용하여 시각적으로 사용자에게 제공 할 수 있다. 시각적으로 승부예측 정보를 제공하는 경우에는 스크린 화면의 일부에 승부예측의 결과가 표시되도 록 할 수 있다. 예를 들면, 도 4에 도시되어 있는 바와 같이, 3명의 사용자가 함께 플레이하고 있을 때에, 스크 린의 일측 모서리 부분에 현재 진행 중인 홀과 현재까지의 사용자들 성적이 표시되고 이와 함께 3명 사용자에 대한 최종 승부예측의 결과가 승률로서 표시될 수 있다. 또는 도 5에 도시되어 있는 바와 같이, 여러 명의 사용 자가 2개의 팀을 이루어서 함께 플레이하고 있을 때에, 스크린의 모서리 부분에 현재 진행 중인 홀과 현재까지 각 팀의 성적이 표시되고 이와 함께 각 팀의 최종 승부예측의 결과가 막대 그래프 형태로 표시될 수 있다 이상 특정시점 이후부터 플레이가 종료할 때까지의 남은 플레이에 대한 예상결과를 산출하고, 상기 산출결과를 특정시점까지의 플레이 결과에 더하여 최종 승부결과를 예측하는 방법을 설명하였는데, 이와 같은 방법은 승부 예측을 위한 여러가지 방법 중 하나의 예이며, 여기에서 설명하지 않은 다른 방법을 이용하여 승부예측을 실행 하는 것도 가능하다. 승부예측의 결과는 사용자의 흥미를 고취시킬 수 있는 플레이 정보로서 사용자에게 제공될 수 있다. 또한 단순 한 정보전달의 범주를 벗어나서 승부예측 결과는 다양한 방식으로 활용될 수 있는데, 이하에서는 승부예측 결과 를 활용하는 예를 도면을 참조하여 설명한다. 도 6은 승부예측의 결과를 활용할 수 있는 방법에 있어서의 과정을 나타내는 순서도이고, 도 7 및 도 8은 사용 자에게 보상하거나 페널티를 주는 예를 설명하기 위한 도면이다. 도 6을 참조하면, 승부예측 결과를 활용하는 과정에 있어서 제1 단계(S10)에서는 승부예측이 이루어진다. 제2 단계(S20)에서는 승부예측의 결과가 사용자에게 제공된다. 제3 단계(S30)에서는 승부예측 결과와 관련하여 특정 조건이 충족되는지를 체크하고, 제4 단계(S40)에서는 상기 조건 충족 여부에 따라 보상이나 페널티가 주어진다. 제1 및 제2 단계(S10, S20)에는 전술한 실시예의 승부예측 과정에서 설명한 내용이 적용될 수 있다. 제3 단계 (S30)에 있어서 승부예측 결과와 관련된 특정 조건으로는 다음과 같은 여러가지 예가 있을 수 있다. 특정 시점에서의 승부예측의 결과 특정 사용자(또는 사용자들이 팀을 이루어 플레이하는 경우에는 팀이 될 수 있으며, 이하의 다른 예에서도 사용자는 개인 사용자이거나 사용자들로 구성된 팀이 될 수 있다)의 승리 확 률이 매우 낮은 경우 특정 시점에서의 승부예측의 결과 승리 확률이 매우 낮게 나왔던 사용자가 이를 극복하고 승리하는 경우 제1 시점에서의 승부예측의 결과 승리 확률이 매우 낮게 나왔던 사용자가 제2 시점에서 승리 확률이 높아진 경우 특정 시점에서의 승부예측의 결과 특정 사용자의 승리 확률이 매우 높은 경우 특정 시점에서의 승부예측의 결과 승리 확률이 매우 높게 나왔던 사용자가 패배하는 경우 제1 시점에서의 승부예측의 결과 승리 확률이 매우 높게 나왔던 사용자가 제2 시점에서 승리 확률이 낮아진 경우 승부 예측과 관련하여 소정의 요건이 충족되는 경우에 제4 단계(S40)에서 요건을 충족한 사용자에게 보상이나 페널티가 주어질 수 있다. 예를 들면, 전술한 의 경우에는 특정 사용자가 패배할 가능성이 너무 높아서(예: 승리 확률 10% 이하) 경기 자체의 재미가 떨어진다고 판단되면, 해당 사용자의 성적을 올릴 수 있는 보상이나 어드밴티지가 주어지도록 할 수 있다. 전술한 의 경우에는 사용자가 낮은 승리 확률(예: 승리 확률 20% 이하)을 극복하고 역전승 했다는 점을 높이 평가하여 해당 사용자의 사기를 고취시키기 위한 보상이나 어드밴티 지가 주어지도록 할 수 있다. 은 와 비슷한 유형이지만, 는 역전승을 한 경우에 보상이 주어지는 것이 고 은 어려운 상황에서 이를 극복하고 승리할 수 있는 여건을 만든 상황에서 해당 사용자를 응원하기 위하여 보상이 주어지는 것이다. 예를 들면, 전체 18번홀 플레이에 있어서 5번홀까지 진행하였을 때에 승리 확률이 10% 이하였던 사용자가 10번홀까지 진행하였을 때에 승리 확률이 50% 까지 상승하였다면, 40%만큼의 승리확률을 높 이기 위하여 노력한 플레이어의 사기를 높이기 위해서 보상이나 어드밴티지가 주어지도록 할 수 있다. 어드밴티지가 주어지는 상황과 반대의 상황에서는 페널티가 주어지도록 할 수 있다. 예를 들면, 전술한 의 경우에는 특정 사용자가 승리할 가능성이 너무 높아서(예: 승리 확률 90% 이상) 경기 자체의 재미가 떨어진다고 판단되면, 해당 사용자의 성적을 내릴 수 있는 페널티가 주어지도록 할 수 있다. 전술한 의 경우에는 사용자 가 높은 승리 확률(예: 승리 확률 80% 이상)에도 불구하고 역전패 했다는 점을 감안하여 추후에는 해당 사용자 가 유리한 상황에서 방심하지 않도록 페널티가 주어지도록 할 수 있다. 은 와 비슷한 유형이지만, 는 역전패를 한 경우에 페널티가 주어지는 것이고 은 유리한 상황이었음에도 승리를 장담할 수 없는 여건을 만 들어버린 해당 사용자에게 더 이상 방심하지 않도록 경고하기 위하여 페널티가 주어지는 것이다. 예를 들면, 전 체 18번홀 플레이에 있어서 5번홀까지 진행하였을 때에 승리 확률이 90% 이상이었던 사용자가 10번홀까지 진행 하였을 때에 승리 확률이 50% 까지 떨어졌다면, 40%만큼의 승리확률이 떨어지도록 무성의한 플레이를 한 사용자 에게 주의를 촉구하기 위해서 페널티가 주어지도록 할 수 있다. 사용자에게 주어지는 보상이나 페널티는 여러가지가 있을 수 있다. 예를 들면, 사용자에게 제공되는 플레이 정 보에 차이를 줄 수 있다. 도 7을 참조하면, 스크린 골프에 있어서의 퍼팅 단계에서 사용자에게 여러가지 플레이 정보가 제공될 수 있는데, 이때에 어드밴티지를 주기 위해서 더 많은 정보를 제공하거나 페널티를 주기 위해서 더 적은 정보를 제공할 수 있다. 도 7에 도시되어 있는 바와 같이, 퍼팅 단계에서 스크린에는 골프공과 최종 목 표지점인 홀컵 사이의 거리 정보(I1), 퍼팅이 이루어지는 그린 영역의 지형 정보(I2, I3), 가상의 골프공과 최 종 목표지점인 홀컵 사이의 높낮이 차이 정보(I4)가 제공될 수 있다. 그린 영역의 지형 정보(I2, I3)로서, 복수 의 횡라인과 종라인으로 이루어진 그리드(I2)가 표시되고 또한 상기 횡라인과 종라인을 따라 이동하는 인디케이 터(I3)가 표시된다. 인디케이터(I3)는 그리드(I2)를 구성하는 횡라인과 종라인을 소정의 속도로 이동하는데, 인 디케이터(I3)의 이동방향은 그린 영역의 경사방향을 나타내고 이동속도는 경사도를 나타낸다. 즉 인디케이터 (I3)는 경사가 높은 곳에서 낮은 곳으로 이동하고, 경사가 크면 클수록 그 이동속도가 증가한다. 따라서 그리드(I2)와 인디케이터(I3)가 제공되는 경우, 사용자는 인디케이터(I3)의 이동방향과 이동속도를 통하여 그린 영역 에 있어서 경사 방향과 경사도를 파악할 수 있다. 사용자에게 페널티를 주고자 하는 경우, 골프공과 최종 목표지점인 홀컵 사이의 거리 정보(I1), 퍼팅이 이루어 지는 그린 영역의 지형 정보(I2, I3), 가상의 골프공과 최종 목표지점인 홀컵 사이의 높낮이 차이 정보(I4) 중 적어도 어느 하나가 제공되지 않도록 할 수 있다. 반대로 사용자에게 어드밴티지를 주고자 하는 경우에는 상기 한 정보에 더하여 추가정보가 제공될 수 있다. 상기 추가 정보로서 그린 영역에서의 퍼팅 라이 정보(I5), 캐디 의 권장 거리 정보(I6) 등이 있을 수 있다. 그린 영역에서의 퍼팅 라이 정보(I5)는 현재의 골프공의 위치에서 홀컵까지 그린 영역의 굴곡을 고려했을 때에, 퍼팅시 홀컵으로부터 수평으로 어느 정도 떨어진 지점을 타깃으로 삼아야 하는 지에 대한 정보를 나타낸다. 캐디의 권장 거리 정보(I6)는 홀인에 성공하기 위하여 골프공이 굴러 가야 할 거리의 정보를 나타낸다. 도 7에 있어서 골프공과 홀컵 사이의 거리는 8.87m 인데, 홀컵이 골프공보다 0.26m 높은 곳에 위치하고 있어서 오르막 경사를 나타내고 있다. 이 경우 8.87m 거리를 타깃으로 하여 퍼팅하는 경우에는 골프공이 오르막 경사를 오르면서 동력이 떨어지고 홀컵에 도달하지 못할 가능성이 있다. 이러한 경우 에는 홀컵의 위치보다 더 먼 위치를 타깃으로 하고 퍼팅할 필요가 있는데, 추가정보에 의하여 타깃으로 삼아야 할 거리를 11.6m 라는 구체적인 수치로서 제공할 수 있으며, 그 결과 사용자는 퍼팅에 대한 정확한 전략을 세워 서 퍼팅 성공 가능성을 높일 수 있다. 위와 같이 정보의 양에 차이를 주는 것 이외에도 다른 방식으로 사용자에게 어드밴티지나 페널티를 줄 수 있다. 예를 들면, 퍼팅에서 컨시드(concede)의 범위가 달라지도록 할 수 있다. 컨시드(concede)란 퍼팅한 골프공이 홀 컵에서 일정 거리 이내에 있으면 홀 인(hole in)으로 인정하는 것을 의미한다. 가령, 컨시드를 1m로 설정한 경 우, 홀컵으로부터 반경 1m 이내에 위치하는 골프공은 홀인으로 간주한다. 만약 컨시드의 범위가 넓어지면, 그만 큼 홀컵으로부터 떨어진 지점까지 골프공을 굴리더라도 홀인이 인정될 수 있어서 사용자에게 유리하고, 반대로 컨시드의 범위가 줄어들면 홀인으로 인정되는 범위가 줄어들어서 사용자에게 불리하다. 따라서 컨시드의 범위를 늘려서 사용자에게 어드밴티지를 주거나 컨시드의 범위를 줄여서 페널티를 줄 수 있다. 위에서는 사용자의 플레이 결과에 영향을 줄 수 있는 보상이나 페널티의 예를 설명하였지만, 사용자의 플레이 결과에 직접 영향을 주지 않도록 보상하거나 페널티를 줄 수도 있다. 예를 들면, 스크린 골프 서비스를 이용하 는 데에 소요되는 서비스 비용을 줄이거나 늘려줌으로써 사용자에게 어드밴티지나 페널티를 줄 수 있다. 또는 스크린에 표시되는 영상에 특별한 그래픽 이펙트를 부여함으로써 사용자에게 어드밴티지를 줄 수 있다. 사용자 가 이글(기준타수보다 2타 덜 쳐 골프공을 홀컵에 넣는 것)을 달성했을 때에, 도 8에 도시된 바와 같이 이글 (Eagle)의 사전적 의미인 '독수리'가 나타내는 새 이미지에 강렬한 인상을 줄 수 있는 불꽃 이미지를 추가한 불 새의 이미지를 표시함으로써, 사용자가 '이글'을 달성한 것에 대해서 강한 임팩트를 주고 사기를 진작시킬 수 있다. 도 9는 본 발명의 다른 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 9를 참조하면, 본 실시예에 따른 가상 골프 장치는 복수의 부스(101, 102, 103)를 포함한다. 각 부스(101, 102, 103)는 모두 동일하게 구성되어 있다. 예를 들면, 첫번째 부스는 타격 플레이트(101a), 키오스크 화 면이 구비된 시뮬레이터 기기(101b), 스크린(101c) 등을 가지고 있고, 다른 부스(102, 103)도 동일한 구성품을 가지고 있다. 도면에 도시되어 있지는 않지만, 각 부스(101, 102, 103)에는 타격시 골프클럽/골프공의 움직임을 나타내는 이미지를 얻기 위한 카메라 등의 다른 기기가 더 구비되어 있다. 각 부스(101, 102, 103)에서는 다수 의 사용자가 번갈아가면서 골프를 플레이할 수 있다. 또는 각 부스(101, 102, 103)에서는 사용자 혼자서 다른 부스의 사용자와 이격되어 있는 상태에서 솔로로 플레이할 수 있다. 본 실시예에 따른 가상 골프 장치의 시뮬레 이터 기기(101b)에는 전술한 바와 같은 승부결과 예측 기능을 가진 예측부가 구비될 수 있고, 이를 통하여 사용 자들 사이의 플레이가 종료되기 전에 승부결과를 예측하고 예측된 결과를 사용자에게 제공할 수 있다. 도 10은 복수의 가상 골프 장치가 네트워크로 연결되어 있는 시스템의 개략적인 구조를 나타내는 도면이다. 도 10을 참조하면, 가상 골프 장치가 네트워크로 연결된 시스템은 복수의 스크린 골프장 및 서버유닛을 포함한다. 스크린 골프장에는 스크린 골프 플레이를 즐길 수 있도록 도 1 내지 도 9 등에 도시되어 있는 것 과 같은 가상 골프 장치가 구비되어 있다. 스크린 골프장에 구비된 상기 가상 골프 장치는 서버유닛과 유 무선 통신망 등을 통하여 연결되어 있다. 각 스크린 골프장은 로그인이 이루어지면 사용자에게 스크린 골프 서비스를 제공하는 서비스 제공부의 역할을 한다. 서버유닛은 복수의 스크린 골프장을 운영하는 서비스 업자가 복수의 스크린 골프장에 구비되어 있는 가상 골프 장치를 관리하기 위하여 사용하는 중앙서버가 될 수 있다. 스크린 골프 서비스를 이용하고자 하는 사용자는 상기 서비스를 제공받기 위하여 먼저 로그인을 수행하는데, 서버유닛은 로그인을 할 때에 사용자의 신원을 확인하고 로그인의 승인 여부를 결정하는 역할을 할 수 있다. 이를 위해 서버유닛에는 사용자의 신원을 확인하는 데에 필요한 정보를 저장하고 있는 저장부가 구비되어 있다. 저장부에는 복수의 사용자에 대한 정보가 각 사용자별로 구분되어 저장된다. 각 사용자에 대 한 저장영역에는 신상정보, 플레이 정보, 설정정보 등이 저장되어 있을 수 있다. 상기 신상정보는 해당 사용자 의 신원을 확인하기 위한 것으로 로그인 과정 등에 사용될 수 있다. 상기 플레이 정보로는 해당 사용자의 과거 플레이 기록이나 과거 플레이 기록으로부터 얻을 수 있는 사용자의 개인기록(클럽별 평균비거리, 평균타수 등) 등이 있을 수 있다. 상기 설정정보는 사용자가 설정한 사항에 대한 정보 등을 포함한다. 예를 들면, 사용자가 과거 플레이 하였던 골프장, 플레이 난이도, 플레이 방식, 선호하는 동작조건 등을 설정정보로서 저장할 수 있 다. 사용자는 매번 플레이할 때마다 각종 선택사항을 입력하는 것을 번거롭게 생각할 수 있는데, 사용자가 상기 선택사항을 입력하지 않은 경우에는 상기 설정정보에 근거하여 선택사항을 자동으로 설정할 수 있다. 이와 같이 저장부에 다양한 사용자 정보가 저장됨으로써, 서버유닛에 유선 및/또는 무선상으로 연결되어 있는 스크 린 골프장의 가상 골프 장치들은 저장부에 저장되어 있는 정보를 이용할 수 있고, 스크린 골프장 각각 에서는 사용자의 정보를 별도로 저장할 필요가 없다. 스크린 골프장의 가상 골프 장치에는 전술한 바와 같은 승부결과 예측 기능을 가진 예측부가 구비될 수 있다. 또는 상기 예측부는 스크린 골프장의 각 가상 골프 장치마다 개별적으로 구비되는 대신에, 서버유닛 에 단독으로 구비되도록 구성될 수도 있다. 상기 예측부를 통하여 사용자들 사이의 플레이가 종료하기 전에 승부결과를 예측하고 예측된 결과를 사용자에게 제공할 수 있다. 위와 같이 본 발명의 구체적인 실시예들을 살펴보았지만, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점 은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0028754", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 2는 도 1의 가상 골프 장치에서 승부결과를 예측하는 과정의 일예를 나타내는 순서도이다. 도 3은 인공지능을 이용하여 승부결과를 예측하는 방법을 설명하기 위한 도면이다. 도 4 및 도 5는 승부결과 예측을 보여주는 스크린 화면의 예를 나타내는 도면이다. 도 6은 승부예측의 결과를 활용할 수 있는 방법에 있어서의 과정을 나타내는 순서도이다. 도 7 및 도 8은 사용자에게 보상하거나 페널티를 주는 예를 설명하기 위한 도면이다. 도 9는 본 발명의 다른 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 10은 복수의 가상 골프 장치가 네트워크로 연결되어 있는 시스템의 개략적인 구조를 나타내는 도면이다."}
