{"patent_id": "10-2021-0078319", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0168504", "출원번호": "10-2021-0078319", "발명의 명칭": "전자 장치 및 이의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "김은아"}}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,프로젝션부;적어도 하나의 인스트럭션을 저장하는 메모리;상기 메모리에 저장된 적어도 하나의 인스트럭션을 실행하여 상기 전자 장치를 제어하는 프로세서;를 포함하고,상기 프로세서는,투사 영상을 투사하기 위해 제1 밝기로 광을 투사하는 프로젝션 모드로 동작하도록 상기 프로젝션부를제어하고,상기 프로젝션 모드로 동작하는 동안, 조명 모드로 진입하기 위한 이벤트를 감지하고,상기 이벤트에 따라 조명 모드로 진입하면, 상기 제1 밝기보다 어두운 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 전자 장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 이벤트는, 상기 프로젝션부 상에 커버가 결합되는 이벤트인 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 전자 장치는 컬러 센서 또는 조도 센서를 포함하며,상기 프로세서는,상기 조도 센서를 통해 감지된 조도 정보 또는 상기 컬러 센서를 바탕으로 획득되는 색상 정보를 바탕으로 상기프로젝션부 상에 커버가 결합되는지 여부를 감지하는 전자 장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는, 상기 이벤트에 따라 조명 모드로 진입하면, 상기 조도 센서를 통해 댁내의 조도 정보를 획득하고,상기 획득된 조도 정보를 바탕으로, 상기 제2 밝기를 조절하도록 상기 프로젝션부를 제어하는 전자 장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,공개특허 10-2022-0168504-3-상기 커버는 복수개의 확산판을 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 프로세서는,상기 이벤트에 따라 조명 모드로 진입하면, 상기 커버에 대응되는 색상 정보를 획득하고,상기 획득된 색상 정보에 대응되는 색상의 광을 상기 제2 밝기로 투사하도록 상기 프로젝션부를 제어하는 전자장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는,상기 이벤트에 따라 조명 모드로 진입하면, 상기 프로젝션 모드로 동작하는 동안에 투사된 상기 투사 영상의 색상 정보를 획득하고,상기 획득된 색상 정보에 대응되는 색상의 광을 상기 제2 밝기로 투사하도록 상기 프로젝션부를 제어하는 전자장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 프로세서는,상기 이벤트에 따라 조명 모드로 진입하면, 상기 전자 장치와 연동하는 사용자 단말이 재생하는 음악 컨텐츠에대한 정보를 획득하고,상기 획득된 음악 컨텐츠에 대한 정보를 바탕으로, 상기 음악 컨텐츠에 대응되는 투사 영상을 상기 제2 밝기로투사하도록 상기 프로젝션부를 제어하는 전자 장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로젝션부는 복수의 LED 소자를 포함하고,상기 프로세서는,상기 복수의 LED 소자의 구동 개수를 제어하여 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는전자 장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 프로젝션부는 복수의 LED 소자를 포함하고,상기 프로세서는,상기 복수의 LED 소자의 구동 전류를 제어하여 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는공개특허 10-2022-0168504-4-전자 장치."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치의 제어 방법에 있어서,투사 영상을 투사하기 위해 제1 밝기로 광을 투사하는 프로젝션 모드로 동작하도록 프로젝션부를 제어하는단계;상기 프로젝션 모드로 동작하는 동안, 조명 모드로 진입하기 위한 이벤트를 감지하는 단계; 및상기 이벤트에 따라 조명 모드로 진입하면, 상기 제1 밝기보다 어두운 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 이벤트는, 상기 프로젝션부 상에 커버가 결합되는 이벤트인 것을 특징으로 하는 제어 방법."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,조도 센서를 통해 감지된 조도 변화 또는 컬러 센서를 바탕으로 획득되는 색상 정보를 바탕으로 상기 프로젝션부 상에 커버가 결합되는지 여부를 감지하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 이벤트에 따라 조명 모드로 진입하면, 상기 조도 센서를 통해 댁내의 조도 정보를 획득하는 단계; 및상기 획득된 조도 정보를 바탕으로, 상기 제2 밝기를 조절하도록 상기 프로젝션부를 제어하는 단계;를 포함하는제어 방법."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 커버는 복수개의 확산판을 포함하는 것을 특징으로 하는 제어 방법."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는,상기 이벤트에 따라 조명 모드로 진입하면, 상기 커버에 대응되는 색상 정보를 획득하는 단계; 및상기 획득된 색상 정보에 대응되는 색상의 광을 상기 제2 밝기로 투사하도록 상기 프로젝션부를 제어하는 단계;를 포함하는 제어 방법.공개특허 10-2022-0168504-5-청구항 17 제11항에 있어서,상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는,상기 이벤트에 따라 조명 모드로 진입하면, 상기 프로젝션 모드로 동작하는 동안에 투사된 상기 투사 영상의 색상 정보를 획득하는 단계; 및상기 획득된 색상 정보에 대응되는 광을 상기 제2 밝기로 투사하도록 상기 프로젝션부를 제어하는 단계;를 더포함하는 제어 방법."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는,상기 이벤트에 따라 조명 모드로 진입하면, 상기 전자 장치와 연동하는 사용자 단말이 재생하는 음악 컨텐츠에대한 정보를 획득하는 단계; 및상기 획득된 음악 컨텐츠에 대한 정보를 바탕으로, 상기 음악 컨텐츠에 대응되는 투사 영상을 상기 제2 밝기로투사하도록 상기 프로젝션부를 제어하는 단계;를 더 포함하는 제어 방법."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 프로젝션부는 복수의 LED 소자를 포함하고,상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는,상기 복수의 LED 소자의 구동 개수를 제어하여 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는단계인 제어 방법."}
{"patent_id": "10-2021-0078319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 프로젝션부는 복수의 LED 소자를 포함하고,상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는,상기 복수의 LED 소자의 구동 전류를 제어하여 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는단계인 제어 방법."}
{"patent_id": "10-2021-0078319", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치 및 이의 제어 방법이 개시된다. 본 개시에 따른 전자 장치의 제어 방법은 투사 영상을 투사하기 위해 제1 밝기로 광을 투사하는 프로젝션 모드로 동작하도록 프로젝션부를 제어하는 단계; 프로젝션 모드로 동작하는 동안, 조명 모드로 진입하기 위한 이벤트를 감지하는 단계; 및 이벤트에 따라 조명 모드로 진입하면, 제1 밝기보 다 어두운 제2 밝기로 광을 투사하도록 프로젝션부를 제어하는 단계;를 포함한다."}
{"patent_id": "10-2021-0078319", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 제어 방법에 관한 것으로, 보다 상세하게는, 투사 영상을 투사하는 전자 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2021-0078319", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기술 발전에 따라 다양한 광학 출력 기능을 갖춘 전자 장치가 개발되고 있으며, 예를 들면, 디스플레이 장치, 조명 장치, 휴대용 통신 장치, 프로젝터가 있을 수 있다. 그 중, 프로젝터는 광원으로부터 출력되는 출력광이프로젝션 렌즈를 통하여 벽 또는 스크린으로 확대하여 투사하는 전자 장치이다. 종래의 프로젝터 기능을 갖춘 전자 장치는 컨텐츠 송출을 목적으로 하여 영상 화면 출력 기능 및 음향 송출 기 능을 갖추었으며, 영상을 출력하지 않을 때에는 음향 출력 외에는 추가적인 사용성의 확장에 한계가 존재하였다. 그러므로, 사용자의 수요에 따라 프로젝터 기능을 갖춘 전자 장치의 사용성을 확장하기 위한 연구 가 진행되어 왔다."}
{"patent_id": "10-2021-0078319", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 한계를 해결하기 위해 안출된 것으로, 보다 상세하게는 투사하는 광을 조명으로 활용하는 전 자 장치 및 이의 제어 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2021-0078319", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 전자 장치는, 프로젝션부; 적어도 하나의 인스트럭션을 저장하는 메모리; 상기 메 모리에 저장된 적어도 하나의 인스트럭션을 실행하여 상기 전자 장치를 제어하는 프로세서;를 포함하고, 상기 프로세서는, 투사 영상을 투사하기 위해 제1 밝기로 광을 투사하는 프로젝션 모드로 동작하도록 상기 프로젝션 부를 제어하고, 상기 프로젝션 모드로 동작하는 동안, 조명 모드로 진입하기 위한 이벤트를 감지하고, 상기 이 벤트에 따라 조명 모드로 진입하면, 상기 제1 밝기보다 어두운 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어한다. 그리고, 상기 이벤트는, 상기 프로젝션부 상에 커버가 결합되는 이벤트인 것을 특징으로 할 수 있다. 그리고, 상기 전자 장치는 컬러 센서 또는 조도 센서를 포함하며, 상기 프로세서는, 상기 조도 센서를 통해 감 지된 조도 정보 또는 상기 컬러 센서를 바탕으로 획득되는 색상 정보를 바탕으로 상기 프로젝션부 상에 커버가 결합되는지 여부를 감지할 수 있다. 그리고, 상기 프로세서는, 상기 이벤트에 따라 조명 모드로 진입하면, 상기 조도 센서를 통해 댁내의 조도 정보 를 획득하고, 상기 획득된 조도 정보를 바탕으로, 상기 제2 밝기를 조절하도록 상기 프로젝션부를 제어할 수 있 다. 그리고, 상기 커버는 복수개의 확산판을 포함하는 것을 특징으로 할 수 있다. 그리고, 상기 프로세서는, 상기 이벤트에 따라 조명 모드로 진입하면, 상기 커버에 대응되는 색상 정보를 획득 하고, 상기 획득된 색상 정보에 대응되는 색상의 광을 상기 제2 밝기로 투사하도록 상기 프로젝션부를 제어할 수 있다. 그리고, 상기 프로세서는, 상기 이벤트에 따라 조명 모드로 진입하면, 상기 프로젝션 모드로 동작하는 동안에 투사된 상기 투사 영상의 색상 정보를 획득하고, 상기 획득된 색상 정보에 대응되는 색상의 광을 상기 제2 밝기 로 투사하도록 상기 프로젝션부를 제어할 수 있다. 그리고, 상기 프로세서는, 상기 이벤트에 따라 조명 모드로 진입하면, 상기 전자 장치와 연동하는 사용자 단말 이 재생하는 음악 컨텐츠에 대한 정보를 획득하고, 상기 획득된 음악 컨텐츠에 대한 정보를 바탕으로, 상기 음 악 컨텐츠에 대응되는 투사 영상을 상기 제2 밝기로 투사하도록 상기 프로젝션부를 제어할 수 있다. 그리고, 상기 프로젝션부는 복수의 LED 소자를 포함하고, 상기 프로세서는, 상기 복수의 LED 소자의 구동 개수 를 제어하여 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어할 수 있다. 그리고, 상기 프로젝션부는 복수의 LED 소자를 포함하고, 상기 프로세서는, 상기 복수의 LED 소자의 구동 전류 를 제어하여 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어할 수 있다. 한편, 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법은 투사 영상을 투사하기 위해 제1 밝기로 광을 투사 하는 프로젝션 모드로 동작하도록 프로젝션부를 제어하는 단계; 상기 프로젝션 모드로 동작하는 동안, 조명 모 드로 진입하기 위한 이벤트를 감지하는 단계; 및 상기 이벤트에 따라 조명 모드로 진입하면, 상기 제1 밝기보다 어두운 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계;를 포함한다. 그리고, 상기 이벤트는, 상기 프로젝션부 상에 커버가 결합되는 이벤트인 것을 특징으로 할 수 있다. 그리고, 조도 센서를 통해 감지된 조도 변화 또는 컬러 센서를 바탕으로 획득되는 색상 정보를 바탕으로 상기 프로젝션부 상에 커버가 결합되는지 여부를 감지하는 단계;를 더 포함할 수 있다. 그리고, 상기 이벤트에 따라 조명 모드로 진입하면, 상기 조도 센서를 통해 댁내의 조도 정보를 획득하는 단계; 및 상기 획득된 조도 정보를 바탕으로, 상기 제2 밝기를 조절하도록 상기 프로젝션부를 제어하는 단계;를 포함 할 수 있다. 그리고, 상기 커버는 복수개의 확산판을 포함하는 것을 특징으로 할 수 있다. 그리고, 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는, 상기 이벤트에 따라 조명 모드 로 진입하면, 상기 커버에 대응되는 색상 정보를 획득하는 단계; 및 상기 획득된 색상 정보에 대응되는 색상의 광을 상기 제2 밝기로 투사하도록 상기 프로젝션부를 제어하는 단계;를 포함할 수 있다. 그리고, 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는, 상기 이벤트에 따라 조명 모드 로 진입하면, 상기 프로젝션 모드로 동작하는 동안에 투사된 상기 투사 영상의 색상 정보를 획득하는 단계; 및 상기 획득된 색상 정보에 대응되는 광을 상기 제2 밝기로 투사하도록 상기 프로젝션부를 제어하는 단계;를 더 포함할 수 있다. 그리고, 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는, 상기 이벤트에 따라 조명 모드 로 진입하면, 상기 전자 장치와 연동하는 사용자 단말이 재생하는 음악 컨텐츠에 대한 정보를 획득하는 단계; 및 상기 획득된 음악 컨텐츠에 대한 정보를 바탕으로, 상기 음악 컨텐츠에 대응되는 투사 영상을 상기 제2 밝기 로 투사하도록 상기 프로젝션부를 제어하는 단계;를 더 포함할 수 있다. 그리고, 상기 프로젝션부는 복수의 LED 소자를 포함하고, 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는, 상기 복수의 LED 소자의 구동 개수를 제어하여 상기 제2 밝기로 광을 투사하도록 상기 프로젝 션부를 제어하는 단계일 수 있다. 그리고, 상기 프로젝션부는 복수의 LED 소자를 포함하고, 상기 제2 밝기로 광을 투사하도록 상기 프로젝션부를 제어하는 단계는, 상기 복수의 LED 소자의 구동 전류를 제어하여 상기 제2 밝기로 광을 투사하도록 상기 프로젝 션부를 제어할 수 있다."}
{"patent_id": "10-2021-0078319", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 다양한 실시 예들을 통해, 전자 장치는 투사하는 광을 조명으로 활용하여 전자 장치의 사용성이 확대될 수 있다."}
{"patent_id": "10-2021-0078319", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여, 본 개시에 대해 더욱 상세히 설명하도록 한다. 도 1은, 본 개시의 일 실시예들에 따른, 전자 장치의 외관을 도시한 사시도이다. 도 1을 참조하면, 전자 장치는 헤드, 본체, 프로젝션 렌즈, 커넥터 또는 하부 커버를 포함할 수 있다. 전자 장치는 다양한 형태의 장치가 될 수 있다. 특히, 전자 장치는 벽 또는 스크린으로 영상을 확대 하여 투사하는 프로젝터 장치일 수 있으며, 프로젝터 장치는 LCD 프로젝터 또는 DMD(digital micromirror device)를 사용하는 DLP(digital light processing) 방식 프로젝터일 수 있다. 또한, 전자 장치는 가정용 또는 산업용 디스플레이 장치일 수 있으며, 또는, 일상 생활에서 쓰이는 조명 장치일 수 있으며, 음향 모듈을 포함하는 음향 장치일 수 있으며, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장 치, 휴대용 멀티미디어 장치, 웨어러블 장치, 또는 가전 장치 등으로 구현될 수 있다. 한편, 본 개시의 일 실시 예에 따른 전자 장치는 상술한 기기에 한정되지 않으며, 전자 장치는 상술한 기기들의 둘 이상의 기 능을 갖춘 전자 장치로 구현될 수 있다. 예를 들면, 전자 장치는 프로세서의 조작에 따라 프로젝터 기능은 오프되고 조명 기능 또는 스피커 기능을 온되어 디스플레이 장치, 조명 장치 또는 음향 장치로 활용될 수 있으며, 마이크 또는 통신 장치를 포함하여 AI 스피커로 활용될 수 있다. 본체는 외관을 이루는 하우징으로, 본체 내부에 배치되는 전자 장치의 구성 부품(예를 들어, 도 2에 도시된 구성)을 지지하거나 보호할 수 있다. 본체의 형상은 도 1에 도시된 바와 같이 원통형에 가까운 구조를 가질 수 있다. 그러나, 본체의 형상은 이에 한정되지 아니하고, 본 개시의 다양한 실시예에 따르면, 본체는 다각형 단면을 갖는 기둥, 원뿔, 구와 같은 다양한 기하학적인 형상으로 구현될 수 있다. 본체의 크기는 사용자가 한 손으로 파지하거나 이동시킬 수 있는 크기일 수 있으며, 휴대가 용이하도록 초 소형으로 구현될 수 있고, 테이블에 거치하거나 조명 장치에 결합 가능한 사이즈로 구현될 수 있다. 본체의 재질은 사용자의 지문 또는 먼지가 묻지 않도록 무광의 금속 또는 합성 수지로 구현될 수 있으며, 또는, 본체의 외관은 매끈한 유광으로 이루어질 수 있다. 본체에는 사용자가 파지하고 옮길 수 있도록 마찰 영역이 본체의 외관의 일부 영역에 형성될 수 있다. 또는, 본체는 적어도 일부 영역에 사용자가 파지할 수 있는 절곡된 파지부 또는 지지대(108, 도 3 참조)가 마련될 수 있다. 프로젝션 렌즈는 본체의 일 면에 형성되어, 렌즈 어레이를 통과한 광을 본체 외부로 투사하도록 형성된다. 다양한 실시예의 프로젝션 렌즈는 색수차를 줄이기 위하여 저분산 코팅된 광학 렌즈일 수 있다. 프로젝션 렌즈는 볼록 렌즈 또는 집광 렌즈일 수 있으며, 일 실시예의 프로젝션 렌즈는 복수의 서브 렌즈의 위치를 조정하여 초점을 조절할 수 있다. 헤드는 본체의 일 면에 결합되도록 마련되어 프로젝션 렌즈를 지지하고 보호할 수 있다. 헤드 는 본체의 일 면을 기준으로 기설정된 각도 범위에서 스위블 가능하도록 본체와 결합될 수 있다. 헤드는 사용자 또는 프로세서에 의하여 자동 또는 수동으로 스위블되어 프로젝션 렌즈의 투사 각도를 자유롭게 조절할 수 있다. 또는, 도면에는 도시되지 않았으나, 헤드는 본체와 결합되며 본체로 부터 연장되는 넥을 포함하여, 헤드는 젖혀지거나 기울어지며 프로젝션 렌즈의 투사 각도를 조절할수 있다. 전자 장치는 본체의 위치 및 각도가 고정된 상태에서 헤드의 방향을 조정하며 프로젝션 렌즈 의 출사 각도를 조절함으로써, 원하는 위치로 광 또는 영상을 투사할 수 있다. 또한, 헤드는 사용자 가 원하는 방향으로 회전한 뒤 잡을 수 있는 손잡이를 포함할 수 있다. 본체 외주면에는 복수의 개구가 형성될 수 있다. 복수의 개구를 통하여 오디오 출력부로부터 출력되는 오 디오가 전자 장치의 본체 외부로 출력될 수 있다. 오디오 출력부는 스피커를 포함할 수 있고, 스피커 는 멀티미디어 재생 또는 녹음 재생, 음성 출력 등과 같이 일반적인 용도로 사용될 수 있다. 본 개시의 일 실시예에 따르면, 본체 내부에는 방열 팬(미도시)이 구비될 수 있으며, 방열 팬(미도시)이 구동되면 복수의 개구를 통하여 본체 내부의 공기 또는 열을 배출할 수 있다. 그러므로, 전자 장치는 전자 장치의 구동에 의하여 발생하는 열을 외부로 배출하고, 전자 장치가 과열되는 것을 방지할 수 있다. 커넥터는 전자 장치를 외부 장치와 연결하여 전기 신호를 송수신하거나, 외부로부터 전력을 공급받을 수 있다. 본 개시의 일 실시예에 따른, 커넥터는 외부 장치와 물리적으로 연결될 수 있다. 이때, 커넥터 에는 입출력 인터페이스를 포함할 수 있으며, 유선 또는 무선으로 외부 장치와 통신을 연결하거나 전력을 공급받을 수 있다. 예를 들어, 커넥터는 HDMI 연결 단자, USB 연결 단자, SD 카드 수용 홈, 오디오 연결 단자 또는 전력 콘센트를 포함할 수 있으며, 또는, 외부 장치와 무선으로 연결되는 블루투스, Wi-Fi 또는 무선 충전 연결 모듈을 포함할 수 있다. 또한, 커넥터는 외부 조명 장치에 연결되는 소켓 구조를 가질 수 있으며, 외부 조명 장치의 소켓 수용 홈 에 연결되어 전력을 공급받을 수 있다. 소켓 구조의 커넥터의 사이즈 및 규격은 결합 가능한 외부 장치의 수용 구조를 고려하여 다양하게 구현될 수 있다. 예를 들면, 국제 규격 E26에 따라, 커넥터의 접합 부위의 지름은 26 mm로 구현될 수 있고, 이 경우 전자 장치는 통상적으로 사용되는 전구를 대체하여 스탠드와 같 은 외부 조명 장치에 결합될 수 있다. 한편, 기존 천장에 위치한 소켓에 체결 시, 전자 장치는 위에서 아 래로 프로젝션되는 구조로서, 소켓 결합에 의해 전자 장치가 회전되지 않는 경우, 화면 역시 회전이 불가 능하다. 이에 따라 소켓 결합이 되어 전원 공급이 되는 경우라도 전자 장치가 회전 가능하도록, 전자 장치 는 천장의 스탠드에 소켓 결합된 상태로 헤드가 본체의 일 면에서 스위블되며 출사 각도를 조절 하여 원하는 위치로 화면을 출사하거나 화면을 회전시킬 수 있다. 커넥터는 결합 센서를 포함할 수 있고, 결합 센서는 커넥터와 외부 장치의 결합 여부, 결합 상태 또 는 결합 대상을 센싱하여 프로세서로 전달할 수 있으며, 프로세서는 전달받은 감지값에 기초하여 전자 장치 의 구동을 제어할 수 있다. 하부 커버는 본체에 결합 및 분리될 수 있으며, 커넥터가 상시 외부로 노출되지 않도록 커넥터 를 보호할 수 있다. 하부 커버의 형상은 도 1에 도시된 바와 같이 본체와 연속된 형상을 가질 수 있으며, 또는 커넥터의 형상에 대응되도록 구현될 수 있다. 하부 커버는 전자 장치를 지지할 수 있으며, 전자 장치는 하부 커버에 결합되어 외부 거치대에 결합되거나 거치되어 사용될 수 있다. 다양한 실시예의 전자 장치는 하부 커버 내부에 배터리가 마련될 수 있다. 배터리는, 예를 들면, 재 충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 도면에는 도시되지 않았으나, 전자 장치는 카메라 모듈을 포함할 수 있고, 카메라 모듈은 정지 영상 및 동 영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이상의 렌즈, 이미지 센서, 이미지 시그널 프 로세서, 또는 플래시를 포함할 수 있다. 도면에는 도시되지 않았으나, 전자 장치는 전자 장치를 보호하며 용이하게 운반할 수 있도록 보호 케 이스(미도시)를 포함할 수 있으며, 또는, 본체를 지지하거나 고정하는 스탠드(미도시), 벽면 또는 파티션 에 결합 가능한 브라켓(미도시)을 포함할 수 있다. 또한, 전자 장치는 소켓 구조를 이용하여 다양한 외부 장치와 연결되어 다양한 기능을 제공할 수 있다. 일 실시예로, 전자 장치는 소켓 구조를 이용하여 외부의 카메라 장치와 연결될 수 있다. 전자 장치는 연 결된 카메라 장치에 저장된 영상이나 현재 촬영 중인 영상을 프로젝션부를 이용하여 제공할 수 있다. 다른 실시예로, 전자 장치는 소켓 구조를 이용하여 배터리 모듈과 연결되어 전력을 공급받을 수 있다. 한편, 전 자 장치는 소켓 구조를 이용하여 외부 장치와 연결될 수 있으나, 이는 일 실시예에 불과할 뿐, 다른 인터페이스(예를 들어, USB 등)를 이용하여 외부 장치와 연결될 수 있다. 도 2는 본 개시의 일 실시예에 따른, 전자 장치의 구성을 도시한 블록도이다. 도 2에 도시된 바와 같이, 전자 장치는 프로젝션부, 메모리, 유저 인터페이스, 입출력 인터페이스, 오디오 출력부 , 전원부, 센서부 및 프로세서를 포함할 수 있다. 한편, 도 2에 도시된 구성은 일 실시예 에 불과할 뿐, 일부 구성이 생략될 수 있으며, 새로운 구성이 추가될 수 있다. 프로젝션부는 영상을 외부로 투사하는 구성이다. 본 개시의 일 실시예에 따른, 프로젝션부는 다양한 투사 방식(예를 들어, CRT(cathode-ray tube) 방식, LCD(Liquid Crystal Display) 방식, DLP(Digital Light Processing) 방식, 레이저 방식 등)으로 구현될 수 있다. 일 예로, CRT 방식은 기본적으로 CRT 모니터와 원리가 동일하다. CRT 방식은 브라운관(CRT) 앞의 렌즈로 상을 확대시켜서 스크린에 이미지를 표시한다. 브라운관의 개 수에 따라 1관식과 3관식으로 나뉘며, 3관식의 경우 Red, Green, Blue의 브라운관이 따로 분리되어 구현될 수 있다. 다른 예로, LCD 방식은 광원에서 나온 빛을 액정에 투과시켜 이미지를 표시하는 방식이다. LCD 방식은 단판식과 3판식으로 나뉘며, 3판식의 경우 광원에서 나온 빛이 다이크로익 미러(특정 색의 빛만 반사하고 나머지는 통과 시키는 거울)에서 Red, Green, Blue로 분리된 뒤 액정을 투과한 후 다시 한 곳으로 빛이 모일 수 있다. 또 다른 예로, DLP 방식은 DMD(Digital Micromirror Device) 칩을 이용하여 이미지를 표시하는 방식이다. DLP 방식의 프로젝션부는 광원, 컬러 휠, DMD 칩, 프로젝션 렌즈 등을 포함할 수 있다. 광원에서 출력된 빛은 회전 하는 컬러 휠을 통과하면서 색을 띌 수 있다. 컬러 휠을 통화한 빛은 DMD 칩으로 입력된다. DMD 칩은 수많은 미 세 거울을 포함하고, DMD 칩에 입력된 빛을 반사시킨다. 프로젝션 렌즈는 DMD 칩에서 반사된 빛을 영상 크기로 확대시키는 역할을 수행할 수 있다. 또 다른 예로, 레이저 방식은 DPSS(Diode Pumped Solid State) 레이저와 검류계를 포함한다. 다양한 색상을 출 력하는 레이저는 DPSS 레이저를 RGB 색상별로 3개를 설치한 후 특수 거울을 이용하여 광축을 중첩한 레이저를 이용한다. 검류계는 거울과 높은 출력의 모터를 포함하여 빠른 속도로 거울을 움직인다. 예를 들어, 검류계는 최대 40 KHz/sec로 거울을 회전시킬 수 있다. 검류계는 스캔 방향에 따라 마운트되는데 일반적으로 프로젝터는 평면 주사를 하므로 검류계도 x, y축으로 나뉘어 배치될 수 있다. 한편, 프로젝션부는 다양한 유형의 광원을 포함할 수 있다. 예를 들어, 프로젝션부는 램프, LED, 레 이저 중 적어도 하나의 광원을 포함할 수 있다. 일 예로, 프로젝션부의 광원이 LED로 구현되는 경우, 도 7c와 같이 프로젝션부는 복수의 LED 소자를 포함할 수 있다. 즉, 복수의 LED 소자에서 출력된 광이 프로젝션 렌즈를 통과하여 투사 영상이 투사될 수 있다. 또한, 프로젝션부는 복수의 LED 소자의 구동 전류를 제어하여 투사 영상의 밝기를 조절할 수 있다. 프로젝션부는 전자 장치의 용도 또는 사용자의 설정 등에 따라 4:3 화면비, 5:4 화면비, 16:9 와이드 화면비로 이미지를 출력할 수 있고, 화면비에 따라 WVGA(854*480), SVGA(800*600), XGA(1024*768), WXGA(1280*720), WXGA(1280*800), SXGA(1280*1024), UXGA(1600*2200), Full HD(1920*1080) 등의 다양한 해상 도로 이미지를 출력할 수 있다. 한편, 프로젝션부는 프로세서의 제어에 의해 출력 이미지를 조절하기 위한 다양한 기능을 수행할 수 있다. 예를 들어, 프로젝션부는 줌, 키스톤, 퀵코너(4코너)키스톤, 렌즈 시프트 등의 기능을 수행할 수 있 다. 구체적으로, 프로젝션부는 스크린과의 거리(투사거리)에 따라 이미지를 확대하거나 축소할 수 있다. 즉, 스크린과의 거리에 따라 줌 기능이 수행될 수 있다. 이때, 줌 기능은 렌즈를 이동시켜 화면의 크기를 조절하는 하드웨어 방식과 이미지를 크롭(crop) 등으로 화면의 크기를 조절하는 소프트웨어 방식을 포함할 수 있다. 한편, 줌 기능이 수행되면, 이미지의 초점의 조절이 필요하다. 예를 들어, 초점을 조절하는 방식은 수동 포커스 방식, 전동 방식 등을 포함한다. 수동 포커스 방식은 수동으로 초점을 맞추는 방식을 의미하고, 전동 방식은 줌 기능이 수행되면 프로젝터가 내장된 모터를 이용하여 자동으로 초점을 맞추는 방식을 의미한다. 줌기능을 수행 할 때, 프로젝션부는 소프트웨어를 통한 디지털 줌 기능을 제공할 수 있으며, 구동부를 통해 렌즈를 이동 하여 줌 기능을 수행하는 광학 줌 기능을 제공할 수 있다. 또한, 프로젝션부는 키스톤 기능을 수행할 수 있다. 정면 투사에 높이가 안 맞으면 위 혹은 아래로 화면이 왜곡될 수 있다. 키스톤 기능은 왜곡된 화면을 보정하는 기능을 의미한다. 예를 들어, 화면의 좌우 방향으로 왜 곡이 발생되면 수평 키스톤을 이용하여 보정할 수 있고, 상하 방향으로 왜곡이 발생되면 수직 키스톤을 이용하 여 보정할 수 있다. 퀵코너(4코너)키스톤 기능은 화면의 중앙 영역은 정상이지만 모서리 영역의 균형이 맞지 않 은 경우 화면을 보정하는 기능이다. 렌즈 시프트 기능은 화면이 스크린을 벗어난 경우 화면을 그대로 옮겨주는 기능이다. 한편, 프로젝션부는 사용자 입력없이 자동으로 주변 환경 및 프로젝션 환경을 분석하여 줌/키스톤/포커스 기능을 제공할 수 있다. 구체적으로, 프로젝션부는 센서(뎁스 카메라, 거리 센서, 적외선 센서, 조도 센서 등)를 통해 감지된 전자 장치와 스크린과의 거리, 현재 전자 장치가 위치하는 공간에 대한 정보, 주 변 광량에 대한 정보 등을 바탕으로 줌/키스톤/포커스 기능을 자동으로 제공할 수 있다. 또한, 프로젝션부는 광원을 이용하여 조명 기능을 제공할 수 있다. 특히, 프로젝션부는 LED를 이용하 여 광원을 출력함으로써 조명 기능을 제공할 수 있다. 일 실시 예에 따라 프로젝션부는 하나의 LED를 포함 할 수 있으며, 다른 실시 예에 따라 전자 장치는 복수의 LED를 포함할 수 있다. 한편, 프로젝션부는 구현 예에 따라 면발광 LED를 이용하여 광원을 출력할 수 있다. 여기서, 면발광 LED는 광원이 고르게 분산하여 출력 되도록 LED의 상측에 광학 시트가 배치되는 구조를 갖는 LED를 의미할 수 있다. 구체적으로, LED를 통해 광원이 출력되면 광원이 광학 시트를 거쳐 고르게 분산될 수 있고, 광학 시트를 통해 분산된 광원은 디스플레이 패널로 입사될 수 있다. 한편, 프로젝션부는 광원의 세기를 조절하기 위한 디밍 기능을 사용자에게 제공 할 수 있다. 구체적으로, 유저 인터페이스(예를 들어, 터치 디스플레이 버튼 또는 다이얼)를 통해 사용자로부터 광원의 세기를 조절 하기 위한 사용자 입력이 수신되면, 프로젝션부는 수신된 사용자 입력에 대응되는 광원의 세기를 출력하도 록 LED를 제어할 수 있다. 또한, 프로젝션부는 사용자 입력 없이 프로세서에 의해 분석된 컨텐츠를 바탕으로 디밍 기능을 제공 할 수 있다. 구체적으로, 프로젝션부는 현재 제공되는 컨텐츠에 대한 정보(예를 들어, 컨텐츠 유형, 컨텐 츠 밝기 등)를 바탕으로 광원의 세기를 출력하도록 LED를 제어할 수 있다. 한편, 프로젝션부는 프로세서의 제어에 의해 색온도를 제어할 수 있다. 여기서, 프로세서는 컨 텐츠에 기초하여 색온도를 제어할 수 있다. 구체적으로, 컨텐츠가 출력되기로 식별되면, 프로세서는 출력 이 결정된 컨텐츠의 프레임별 색상 정보를 획득할 수 있다. 그리고, 프로세서는 획득된 프레임별 색상 정 보에 기초하여 색온도를 제어할 수 있다. 여기서, 프로세서는 프레임별 색상 정보에 기초하여 프레임의 주 요 색상을 적어도 하나 이상 획득할 수 있다. 그리고, 프로세서는 획득된 적어도 하나 이상의 주요 색상에 기초하여 색온도를 조절할 수 있다. 예를 들어, 프로세서가 조절할 수 있는 색온도는 웜 타입(warm type) 또는 콜드 타입(cold type)으로 구분될 수 있다. 여기서, 출력될 프레임(이하 출력 프레임)이 화재가 일어난 장 면을 포함하고 있다고 가정한다. 프로세서는 현재 출력 프레임에 포함된 색상 정보에 기초하여 주요 색상 이 적색이라고 식별(또는 획득)할 수 있다. 그리고, 프로세서는 식별된 주요 색상(적색)에 대응되는 색온 도를 식별할 수 있다. 여기서, 적색에 대응되는 색온도는 웜 타입일 수 있다. 한편, 프로세서는 프레임의 색상 정보 또는 주요 색상을 획득하기 위하여 인공 지능 모델을 이용할 수 있다. 일 실시 예에 따라, 인공 지능 모델은 전자 장치(예를 들어, 메모리)에 저장될 수 있다. 다른 실시 예에 따라, 인공 지능 모델은 전 자 장치와 통신 가능한 외부 서버에 저장될 수 있다. 한편, 전자 장치는 외부 기기와 연동하여 조명 기능을 제어할 수 있다. 구체적으로, 전자 장치는 외 부 기기로부터 조명 정보를 수신할 수 있다. 여기서, 조명 정보는 외부 기기에서 설정된 밝기 정보 또는 색온도 정보 중 적어도 하나를 포함할 수 있다. 여기서, 외부 기기는 전자 장치와 동일한 네트워크에 연결된 기기 (예를 들어, 동일한 홈/회사 네트워크에 포함된 IoT 기기) 또는 전자 장치와 동일한 네트워크는 아니지만 전자 장치와 통신 가능한 기기(예를 들어, 원격 제어 서버)를 의미할 수 있다. 예를 들어, 전자 장치와 동 일한 네트워크에 포함된 외부 조명 기기(IoT 기기)가 붉은색 조명을 50의 밝기로 출력하고 있다고 가정한다. 외 부 조명 기기(IoT 기기)는 조명 정보(예를 들어, 붉은색 조명을 50의 밝기로 출력하고 있음을 나타내는 정보)를 전자 장치에 직접적으로 또는 간접적으로 전송할 수 있다. 여기서, 전자 장치는 외부 조명 기기로부 터 수신된 조명 정보에 기초하여 광원의 출력을 제어할 수 있다. 예를 들어, 외부 조명 기기로부터 수신된 조명 정보가 붉은색 조명을 50의 밝기로 출력하는 정보를 포함하면, 전자 장치는 붉은색 조명을 50의 밝기로 출 력할 수 있다. 한편, 전자 장치는 생체 정보에 기초하여 조명 기능을 제어할 수 있다. 구체적으로, 프로세서는 사용 자의 생체 정보를 획득할 수 있다. 여기서, 생체 정보는, 사용자의 체온, 심장 박동 수, 혈압, 호흡, 심전도 중 적어도 하나를 포함할 수 있다. 여기서, 생체 정보는 상술한 정보 이외에 다양한 정보가 포함될 수 있다. 일 예 로, 전자 장치는 생체 정보를 측정하기 위한 센서를 포함할 수 있다. 프로세서는 센서를 통해 사용자의 생 체 정보를 획득할 수 있고, 획득된 생체 정보에 기초하여 광원의 출력을 제어할 수 있다. 다른 예로, 프로세서 는 입출력 인터페이스를 통해 생체 정보를 외부 기기로부터 수신할 수 있다. 여기서, 외부 기기는 사 용자의 휴대용 통신 기기(예를 들어, 스마트폰 또는 웨어러블 디바이스)를 의미할 수 있다. 프로세서는 외 부 기기로부터 사용자의 생체 정보를 획득할 수 있고, 획득된 생체 정보에 기초하여 광원의 출력을 제어할 수 있다. 한편, 구현 예에 따라, 전자 장치는 사용자가 수면하고 있는지 여부를 식별할 수 있고, 사용자가 수면 중 (또는 수면 준비 중)인 것으로 식별되면 프로세서는 사용자의 생체 정보에 기초하여 광원의 출력을 제어할 수 있다. 메모리는 전자 장치에 관한 적어도 하나의 명령이 저장될 수 있다. 그리고, 메모리에는 전자 장 치를 구동시키기 위한 O/S(Operating System)가 저장될 수 있다. 또한, 메모리에는 본 개시의 다양한 실시 예들에 따라 전자 장치가 동작하기 위한 각종 소프트웨어 프로그램이나 애플리케이션이 저장될 수도 있다. 그리고, 메모리는 플래시 메모리 (Flash Memory) 등과 같은 반도체 메모리나 하드디스크(Hard Disk) 등과 같은 자기 저장 매체 등을 포함할 수 있다. 구체적으로, 메모리에는 본 개시의 다양한 실시 예에 따라 전자 장치가 동작하기 위한 각종 소프트웨 어 모듈이 저장될 수 있으며, 프로세서는 메모리에 저장된 각종 소프트웨어 모듈을 실행하여 전자 장 치의 동작을 제어할 수 있다. 즉, 메모리는 프로세서에 의해 액세스되며, 프로세서에 의한 데이터의 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 한편, 본 개시에서 메모리라는 용어는 메모리, 프로세서 내 롬(미도시), 램(미도시) 또는 전자 장치에 장착되는 메모리 카드(미도시)(예를 들어, micro SD 카드, 메모리 스틱)를 포함하는 의미로 사용될 수 있다. 유저 인터페이스는 다양한 유형의 입력 장치를 포함할 수 있다. 예를 들어, 유저 인터페이스는 물리 적 버튼을 포함할 수 있다. 이때, 물리적 버튼은 기능키(function key), 방향키(예를 들어, 4방향 키) 또는 다 이얼 버튼(dial button)을 포함할 수 있다. 일 실시 예에 따라, 물리적 버튼은 복수의 키로 구현될 수 있다. 다 른 실시 예에 따라, 물리적 버튼은 하나의 키(one key)로 구현될 수 있다. 여기서, 물리적 버튼이 하나의 키로 구현되는 경우, 전자 장치는 하나의 키가 임계 시간 이상 눌려지는 사용자 입력을 수신할 수 있다. 하나의 키가 임계 시간 이상 눌려지는 사용자 입력이 수신되면, 프로세서는 사용자 입력에 대응되는 기능을 수행 할 수 있다. 예를 들어, 프로세서는 사용자 입력에 기초하여 조명 기능을 제공할 수 있다. 또한, 유저 인터페이스는 비접촉 방식을 이용하여 사용자 입력을 수신할 수 있다. 접촉 방식을 통해서 사 용자 입력을 수신하는 경우 물리적인 힘이 전자 장치에 전달 되어야 한다. 따라서, 물리적인 힘에 관계 없이 전 자 장치를 제어하기 위한 방식이 필요할 수 있다. 구체적으로, 유저 인터페이스는 사용자 제스쳐를 수신할 수 있고, 수신된 사용자 제스쳐에 대응되는 동작을 수행할 수 있다. 여기서, 유저 인터페이스는 센서(예를 들어, 이미지 센서 또는 적외선 센서)를 통해 사용자의 제스쳐를 수신할 수 있다. 또한, 유저 인터페이스는 터치 방식을 이용하여 사용자 입력을 수신할 수 있다. 예를 들어, 유저 인터페이 스는 터치 센서를 통해 사용자 입력을 수신할 수 있다. 일 실시 예에 따라, 터치 방식은 비접촉 방식으로 구현될 수 있다. 예를 들어, 터치 센서는 임계 거리 이내로 사용자 신체가 접근했는지 여부를 판단할 수 있다. 여기서, 터치 센서는 사용자가 터치 센서를 접촉하지 않는 경우에도 사용자 입력을 식별할 수 있다. 한편, 다른 구현 예에 따라, 터치 센서는 사용자가 터치 센서를 접촉하는 사용자 입력을 식별할 수 있다. 한편, 전자 장치는 상술한 유저 인터페이스 외에 다양한 방법으로 사용자 입력을 수신할 수 있다. 일 실시 예로, 전자 장치는 외부 원격 제어 장치를 통해 사용자 입력을 수신할 수 있다. 여기서, 외부 원격 제어 장치는 전자 장치에 대응되는 원격 제어 장치(예를 들어, 전자 장치 전용 제어 기기) 또는 사용자의 휴대 용 통신 기기(예를 들어, 스마트폰 또는 웨어러블 디바이스)일 수 있다. 여기서, 사용자의 휴대용 통신 기기는 전자 장치를 제어하기 위한 어플리케이션이 저장될 수 있다. 휴대용 통신 기기는 저장된 어플리케이션을 통해 사용자 입력을 획득하고, 획득된 사용자 입력을 전자 장치에 전송할 수 있다. 전자 장치는 휴대용 통 신 기기로부터 사용자 입력을 수신하여 사용자의 제어 명령에 대응되는 동작을 수행할 수 있다. 한편, 전자 장치는 음성 인식을 이용하여 사용자 입력을 수신할 수 있다. 일 실시 예에 따라, 전자 장치 는 전자 장치에 포함된 마이크를 통해 사용자 음성을 수신할 수 있다. 다른 실시 예에 따라, 전자 장치 는 마이크 또는 외부 장치로부터 사용자 음성을 수신할 수 있다. 구체적으로, 외부 장치는 외부 장치의 마 이크를 통해 사용자 음성을 획득할 수 있고, 획득된 사용자 음성을 전자 장치에 전송할 수 있다. 외부 장 치로부터 전송되는 사용자 음성은 오디오 데이터 또는 오디오 데이터가 변환된 디지털 데이터(예를 들어, 주파 수 도메인으로 변환된 오디오 데이터 등)일 수 있다. 여기서, 전자 장치는 수신된 사용자 음성에 대응되는 동작을 수행할 수 있다. 구체적으로, 전자 장치는 마이크를 통해 사용자 음성에 대응되는 오디오 데이터를 수신할 수 있다. 그리고, 전자 장치는 수신된 오디오 데이터를 디지털 데이터로 변환할 수 있다. 그리고, 전자 장치는 STT(Speech To Text) 기능을 이용하여 변환된 디지털 데이터를 텍스트 데이터로 변환 할 수 있다. 일 실시 예에 따라, STT(Speech To Text) 기능은 전자 장치에서 직접 수행될 수 있으며, 다른 실시 예에 따라, STT(Speech To Text) 기능은 외부 서버에서 수행될 수 있다. 전자 장치는 디지털 데 이터를 외부 서버로 전송할 수 있다. 외부 서버는 디지털 데이터를 텍스트 데이터로 변환하고, 변환된 텍스트 데이터를 바탕으로 제어 명령 데이터를 획득할 수 있다. 외부 서버는 제어 명령 데이터(이때, 텍스트 데이터도 포함될 수 있음.)를 전자 장치에 전송할 수 있다. 전자 장치는 획득된 제어 명령 데이터를 바탕으로 사용자 음성에 대응되는 동작을 수행할 수 있다. 한편, 전자 장치는 하나의 어시스턴스(또는 인공지능 비서, 예로, 빅스비TM 등)를 이용하여 음성 인식 기 능을 제공할 수 있으나, 이는 일 실시예에 불과할 뿐 복수의 어시스턴스를 통해 음성 인식 기능을 제공할 수 있 다. 이때, 전자 장치는 어시스턴스에 대응되는 트리거 워드 또는 리모컨에 존재하는 특정 키를 바탕으로 복수의 어시스턴스 중 하나를 선택하여 음성 인식 기능을 제공할 수 있다. 한편, 전자 장치는 스크린 인터렉션을 이용하여 사용자 입력을 수신할 수 있다. 스크린 인터렉션이란, 전 자 장치가 스크린(또는 투사면)에 투사한 이미지를 통해 기 결정된 이벤트가 발생하는지 식별하고, 기 결정된 이벤트에 기초하여 사용자 입력을 획득하는 기능을 의미할 수 있다. 여기서, 기 결정된 이벤트는 특정 위치(예 를 들어, 사용자 입력을 수신하기 위한 UI가 투사된 위치)에 특정 위치에 기 결정된 오브젝트가 식별되는 이벤 트를 의미할 수 있다. 여기서, 기 결정된 오브젝트는 사용자의 신체 일부(예를 들어, 손가락), 지시봉 또는 레 이저 포인트 중 적어도 하나를 포함할 수 있다. 전자 장치는 투사된 UI에 대응되는 위치에 기 결정된 오브 젝트가 식별되면, 투사된 UI를 선택하는 사용자 입력이 수신된 것으로 식별할 수 있다. 예를 들어, 전자 장치 는 스크린에 UI를 표시하도록 가이드 이미지를 투사할 수 있다. 그리고, 전자 장치는 사용자가 투사 된 UI를 선택하는지 여부를 식별할 수 있다. 구체적으로, 전자 장치는 기 결정된 이벤트가 투사된 UI의 위 치에서 식별되면, 사용자가 투사된 UI를 선택한 것으로 식별할 수 있다. 여기서, 투사되는 UI는 적어도 하나 이 상의 항목(item)을 포함할 수 있다. 여기서, 전자 장치는 기 결정된 이벤트가 투사된 UI의 위치에 있는지 여부를 식별하기 위하여 공간 분석을 수행할 수 있다. 여기서, 전자 장치는 센서(예를 들어, 이미지 센서, 적외선 센서, 뎁스 카메라, 거리 센서 등)를 통해 공간 분석을 수행할 수 있다. 전자 장치는 공간 분석을 수행함으로써 특정 위치(UI가 투사된 위치)에서 기 결정된 이벤트가 발생하는지 여부를 식별할 수 있다. 그리고, 특정 위치(UI가 투사된 위치)에서 기 결정된 이벤트가 발생되는 것으로 식별되면, 전자 장치는 특 정 위치에 대응되는 UI를 선택하기 위한 사용자 입력이 수신된 것으로 식별할 수 있다. 입출력 인터페이스는 오디오 신호 및 영상 신호 중 적어도 하나를 입출력 하기 위한 구성이다. 입출력 인 터페이스는 외부 장치로부터 오디오 및 영상 신호 중 적어도 하나를 입력 받을 수 있으며, 외부 장치로 제 어 명령을 출력할 수 있다. 한편, 본 개시의 일 실시 예에 입출력 인터페이스는 HDMI(High Definition Multimedia Interface), MHL (Mobile High- Definition Link), USB (Universal Serial Bus), USB C-type, DP(Display Port), 썬더볼트 (Thunderbolt), VGA(Video Graphics Array)포트, RGB 포트, D-SUB(Dsubminiature) 및 DVI(Digital Visual Interface) 중 적어도 하나 이상의 유선 입출력 인터페이스로 구현될 수 있다. 일 실시예에 따라, 유선 입출력 인터페이스는 오디오 신호만을 입출력하는 인터페이스와 영상 신호만을 입출력하는 인터페이스로 구현되거나, 오디오 신호 및 영상 신호를 모두 입출력하는 하나의 인터페이스로 구현될 수 있다. 또한, 전자 장치는 유선 입출력 인터페이스를 통해 데이터를 수신할 수 있으나, 이는 일 실시예에 불과할 뿐, 유선 입출력 인터페이스를 통해 전력을 공급받을 수 있다. 예를 들어, 전자 장치는 USB C-type을 통해 외부 배터리에서 전력을 공급받거나 전원 어뎁터를 통해 콘센트에서 전력을 공급받을 수 있다. 또 다른 예로, 전자 장치는 DP를 통해 외부 장치(예를 들어, 노트북이나 모니터 등)로부터 전력을 공급받을 수 있다. 한편, 본 개시의 일 실시 예에 입출력 인터페이스는 Wi-Fi, Wi-Fi 다이렉트, 블루투스, 지그비, 3G(3rd Generation), 3GPP(3rd Generation Partnership Project) 및 LTE(Long Term Evoloution)의 통신 방식 중 적어 도 하나 이상의 통신 방식으로 통신을 수행하는 무선 입출력 인터페이스로 구현될 수 있다. 구현 예에 따라, 무 선 입출력 인터페이스는 오디오 신호만을 입출력하는 인터페이스와 영상 신호만을 입출력하는 인터페이스로 구 현되거나, 오디오 신호 및 영상 신호를 모두 입출력하는 하나의 인터페이스로 구현될 수 있다. 또한, 오디오 신호는 유선 입출력 인터페이스를 통해 입력받고, 영상 신호는 무선 입출력 인터페이스를 통해 입 력 받도록 구현될 수 있다. 또는, 오디오 신호는 무선 입출력 인터페이스를 통해 입력받고, 영상 신호는 유선 입출력 인터페이스를 통해 입력 받도록 구현될 수 있다. 오디오 출력부는 오디오 신호를 출력하는 구성이다. 특히, 오디오 출력부는 오디오 출력 믹서, 오디 오 신호 처리기, 음향 출력 모듈을 포함할 수 있다. 오디오 출력 믹서는 출력할 복수의 오디오 신호들을 적어도 하나의 오디오 신호로 합성할 수 있다. 예를 들면, 오디오 출력 믹서는 아날로그 오디오 신호 및 다른 아날로그 오디오 신호(예: 외부로부터 수신한 아날로그 오디오 신호)를 적어도 하나의 아날로그 오디오 신호로 합성할 수 있다. 음향 출력 모듈은, 스피커 또는 출력 단자를 포함할 수 있다. 일 실시예에 따르면 음향 출력 모듈은 복수 의 스피커들을 포함할 수 있고, 이 경우, 음향 출력 모듈은 본체 내부에 배치될 수 있고, 음향 출력 모듈의 진 동판의 적어도 일부를 가리고 방사되는 음향은 음도관(waveguide)을 통과하여 본체 외부로 전달할 수 있다. 음 향 출력 모듈은 복수의 음향 출력 유닛을 포함하고, 복수의 음향 출력 유닛이 본체의 외관에 대칭 배치됨으로써 모든 방향으로, 즉 360도 전 방향으로 음향을 방사할 수 있다. 전원부는 외부로부터 전력을 공급받아 전자 장치의 다양한 구성에 전력을 공급할 수 있다. 본 개시의 일 실시 예에 따른 전원부는 다양한 방식을 통해 전력을 공급받을 수 있다. 일 실시 예로, 전원부는 도 1에 도시된 바와 같은 커넥터를 이용하여 전력을 공급받을 수 있다. 또한, 전원부는 220V의 DC 전 원 코드를 이용하여 전력을 공급 받을 수 있다. 다만 이에 한정되지 않고, 전자 장치는 USB 전원 코드를 이용하 여 전력을 공급 받거나 무선 충전 방식을 이용하여 전력을 공급 받을 수 있다. 또한, 전원부는 내부 배터리 또는 외부 배터리를 이용하여 전력을 공급 받을 수 있다. 본 개시의 일 실시 예에 따른 전원부는 내부 배터리를 통해 전력을 공급 받을 수 있다. 일 예로, 전원부는 220V의 DC 전 원 코드, USB 전원 코드 및 USB C-Type 전원 코드 중 적어도 하나를 이용하여 내부 배터리의 전력을 충전하고, 충전된 내부 배터리를 통해 전력을 공급 받을 수 있다. 또한, 본 개시의 일 실시 예에 따른 전원부는 외부 배터리를 통해 전력을 공급 받을 수 있다. 일 예로, USB 전원 코드, USB C-Type 전원 코드, 소켓 홈 등 다양한 유선 통신 방식을 통하여 전자 장치와 외부 배터리의 연결이 수행되면, 전원부는 외부 배터리를 통해 전력 을 공급 받을 수 있다. 즉, 전원부는 외부 배터리로부터 바로 전력을 공급 받거나, 외부 배터리를 통해 내 부 배터리를 충전하고 충전된 내부 배터리로부터 전력을 공급 받을 수 있다. 본 개시에 따른 전원부는 상술한 복수의 전력 공급 방식 중 적어도 하나 이상을 이용하여 전력을 공급 받 을 수 있다. 한편, 소비 전력과 관련하여, 전자 장치는 소켓 형태 및 기타 표준 등을 이유로 기설정된 값(예로, 43W) 이하의 소비 전력을 가질 수 있다. 이때, 전자 장치는 배터리 이용 시에 소비 전력을 줄일 수 있도록 소비 전력을 가변시킬 수 있다. 즉, 전자 장치는 전원 공급 방법 및 전원 사용량 등을 바탕으로 소비 전력을 가 변시킬 수 있다. 센서부는 전자 장치의 구동 환경, 예를 들면 전자 장치 주변의 밝기, 색상 정보, 온습도 및 다 른 조명의 동작을 감지하거나, 사용자의 위치, 제스쳐 및 동작을 인식하기 위한 구성이다. 센서부는 작동 방식에 따라 스위치 센서, 이미지 센서, 컬러 센서, 거리 센서, 조도 센서를 포함할 수 있 다. 다만, 이에 한정되지 않고, 다양한 종류의 센서를 포함할 수 있다. 일 실시 예로, 센서부는 컬러 센서를 포함할 수 있다. 컬러 센서는 도 7a 및 도 7b에 도시된 바 와 같이, 전자 장치의 헤드 내에 위치할 수 있으며, 헤드 주변의 색상 정보를 획득하기 위한 구 성이다. 또한, 일 실시 예로, 센서부는 조도 센서를 포함할 수 있다. 조도 센서는 도 7a 및 도 7b에 도 시된 바와 같이, 전자 장치의 헤드 내에 위치할 수 있으며, 헤드 주변의 밝기 정보를 획득하여 조도 변화를 감지할 수 있다. 프로세서는 메모리와 전기적으로 연결되어 전자 장치의 동작을 전반적으로 제어할 수 있다. 구 체적으로, 프로세서는 메모리에 저장된 적어도 하나의 명령어를 실행하여 전자 장치를 제어할 수 있다. 구체적으로, 프로세서는 투사 영상을 투사하기 위해 제1 밝기로 광을 투사하는 프로젝션 모드로 동작하도 록 프로젝션부를 제어할 수 있다. 도 5a는 본 개시에 따른 프로젝션 모드를 설명하기 위한 도면이다. 본 개시에 따른 프로젝션 모드는 투사 영상 이 투사 영역 상에 표시되어 영상을 제공하기 위한 모드일 수 있다. 즉, 프로젝션 모드로 동작 중인 경우, 도 5a와 같이 전자 장치의 헤드가 투사 영역을 향하도록 위치되어, 투사 영역 상에 투사 영상이 표시될 수 있다. 즉, 전자 장치가 프로젝션 모드로 진입하면, 프로세서는 제1 밝기로 투사 영상을 투사하도록 프로젝 션부를 제어할 수 있다. 본 개시에 따른 제1 밝기는 프로젝션 모드로 동작하는 도중 투사 영상을 투사하는 밝기로, 일 예로, 프로젝션부 가 출력할 수 있는 최대 밝기일 수 있다. 다만, 이에 한정되지 않고 센서부를 통해 감지되는 주변의 밝기에 따라 제1 밝기가 조절될 수 있다. 그리고, 일 예로, 프로젝션부의 광원이 LED로 구현되는 경우, 프 로세서는 프로젝션 모드로 동작하는 동안에는 프로젝션부에 포함된 복수의 LED 소자 전부가 광을 출 력하도록 프로젝션부를 제어할 수 있다. 그리고, 프로세서는 프로젝션 모드로 동작하는 동안, 조명 모드로 진입하기 위한 이벤트를 감지할 수 있다. 도 5b는 본 개시에 따른 조명 모드를 설명하기 위한 도면이다. 본 개시에 따른 조명 모드는, 전자 장치 주 변에 조명을 제공하기 위한 모드일 수 있다. 즉, 도 5b와 같이 광원을 출사되는 프로젝션부 상에 광을 확 산시키는 확산판을 포함하는 커버가 결합되면, 프로세서는 프로젝션부에서 출력되는 광원을 제어하여 조명이 제공될 수 있다. 일 실시 예로, 조명 모드에서는 단일 색상의 광이 발광 되거나, 조명 모드에 대응되는 이미지가 투사될 수 있다. 이에 대한 자세한 내용은 이하의 도면을 통해 후술하도록 한다. 제1 실시 예로, 조명 모드로 진입하기 위한 이벤트는, 프로젝션부 상에 커버가 결합되는 이벤트를 포함할 수 있다. 커버는 프로젝션부에서 출력되는 광을 확산시키기 위한 구성으로 커버에 대한 자세한 내용은 도 6a 및 도 6b를 통해 설명하도록 한다. 구체적으로, 전자 장치의 프로젝션부 상에 커버가 결합되면, 프로세서는 조명 모드로 진입하기 위한 이벤트를 감지하고, 조명 모드로 진입할 수 있다. 즉, 커버가 프로젝션부 상에 근접하게 위치하면, 이를 감지하는 센서부의 일 구성인 컬러 센서 또는 조도 센서는 커버의 근접 또는 결합 여부를 센싱하여 프로세서로 제공하고, 프로세서는 커버의 근접 또는 결합 여부에 기초하여 전자 장치 를 조명 모드로 동작하도록 제어 프로젝션부를 제어할 수 있다. 본 개시에 따른, 프로세서는 조도 센서를 통해 감지된 조도 정보를 통해 프로젝션부 상의 조도 변화가 감지되면, 프로젝션부 상에 커버가 결합되는 이벤트가 발생된 것으로 식별할 수 있다. 본 개시에 따른 프로세서는 컬러 센서를 통해 감지된 색상 정보를 통해 프로젝션부 상의 색상 변화가 감지되면, 프로젝션부 상에 커버가 결합되는 이벤트가 발생된 것으로 식별할 수 있다. 제2 실시 예로, 조명 모드로 진입하기 위한 이벤트는, 프로젝션부 상에 커버가 결합된 후, 조명 모드 진입 을 위한 사용자의 명령이 수신되는 이벤트를 포함할 수 있다. 일 예로, 프로젝션부상에 커버가 결합되어 있는 도중, 프로세서는 조명 모드 진입을 위한 사용자의 음성 명령을 수신하여 조명 모드로 진입할 수 있 다. 일 예로, 프로젝션부상에 커버가 결합되어 있는 도중, 프로세서는 전자 장치와 연결된 외부 디스플레이 장치로부터 조명 모드 진입을 위한 사용자의 명령을 수신하여 조명 모드로 진입할 수 있다. 제3 실시 예로, 조명 모드로 진입하기 위한 이벤트는, 프로젝션부 상에 커버가 결합된 후, 댁내 조명 장치 를 관리하는 마스터 장치로부터 조명 모드 진입을 위한 명령이 수신되는 이벤트를 포함할 수 있다. 일 예로, 마 스터 장치가 전자 장치를 통해 조명을 제공하여야하는 것으로 식별하면, 마스터 장치는 전자 장치로 조명 모드 진입을 위한 명령 전송할 수 있다. 그리고, 프로세서는 마스터 장치로부터 조명 모드 진입을 위 한 명령을 수신하여 조명 모드로 동작하도록 프로젝션부를 제어할 수 있다. 조명 모드로 진입하기 위한 이벤트는 상술한 실시 예에 한정되지 않고 다양한 실시 예를 더 포함할 수 있다. 조명 모드로 진입하기 위한 이벤트에 따라 전자 장치가 조명 모드로 진입하면, 프로세서는 제1 밝기 보다 어두운 제2 밝기로 광을 투사하도록 프로젝션부를 제어할 수 있다. 본 개시에 따른 제2 밝기는 조명 모드로 동작하는 도중 광이 투사되는 밝기로, 일 예로, 프로젝션부가 출 력할 수 있는 최대 밝기 보다 기 설정 비율(예로, 50%) 이하일 수 있다. 다만, 이에 한정되지 않고 센서부(27 0)를 통해 감지되는 주변의 밝기에 따라 제2 밝기가 조절될 수 있다. 일 실시 예로, 프로젝션부의 광원이 LED로 구현되는 경우, 조명 모드로 동작하는 동안, 프로세서는 프로젝션부에 포함된 복수의 LED 소자의 구동 개수를 제어하여 제2 밝기로 광을 출력하도록 프로젝션부 를 제어할 수 있다. 즉, 프로세서는 프로젝션부에 포함된 복수의 LED 소자 중 광을 출력하는 LED 소자의 개수 비율을 기 설정 비율(예로, 50%) 이하로 제어하여 광을 출력하도록 프로젝션부를 제어할 수 있다. 일 실시 예로, 프로젝션부의 광원이 LED로 구현되는 경우, 조명 모드로 동작하는 동안, 프로세서는 프로젝션부에 포함된 복수의 LED 소자의 구동 전류를 제어하여 제2 밝기로 광을 출력하도록 프로젝션부 를 제어할 수 있다. 즉, 프로세서는 복수의 LED 소자의 구동 전류가 제어되어, 제1 밝기보다 어두운 제2 밝기로 광을 출력하도록 프로젝션부를 제어할 수 있다. 그리고, 제2 밝기로 광이 출력되는 조명 모드로 동작하는 동안, 프로세서는 조도 센서를 통해 댁내의 조도 정보를 획득할 수 있다. 그리고, 프로세서는 획득된 조도 정보를 바탕으로, 제2 밝기를 조절하도록 프로젝션부를 제어할 수 있다. 구체적으로, 프로세서는 획득된 조도 정보를 통해 댁내 조도 변화를 식별할 수 있다. 그리고, 프로세서는 식별된 조도 변화에 따라 제2 밝기를 조절하도록 프로젝션부를 제어할 수 있다. 일 예로, 획득된 조도 정보를 통해 댁내가 어두워진 것으로 식별되면, 프로세서는 기존 제2 밝기보다 더 밝은 밝기로 광을 출력하도록 프로젝션부를 제어할 수 있다. 일 예로, 획득된 조도 정보를 통해 댁내가 밝 아진 것으로 식별되면, 프로세서는 기존 제2 밝기보다 더 어두운 밝기로 광을 출력하거나, 광을 출력하지 않도록 프로젝션부를 제어할 수 있다. 그리고, 본 개시에 따른 조명 모드는 다양한 조명을 제공할 수 있다. 일 실시 예로, 전자 장치가 조명 모드로 진입하면, 프로세서는 커버에 대응되는 색상 정보를 획득할 수 있다. 일 예로, 프로세서는 컬러 센서를 통해 커버에 대응되는 색상 정보를 획득할 수 있다. 그리 고, 프로세서는 획득된 색상 정보에 대응되는 색상의 광을 제2 밝기로 투사하도록 프로젝션부를 제어 할 수 있다. 이에 대한 구체적인 내용에 대해서는 도 11a 내지 도 11c를 통해 후술하도록 한다. 일 실시 예로, 전자 장치가 프로젝션 모드로 동작 중 조명 모드로 진입하면, 프로세서는 프로젝션 모 드로 동작하는 동안에 투사된 투사 영상의 색상 정보를 획득할 수 있다. 그리고, 프로세서는 획득된 색상 정보에 대응되는 색상의 광을 제2 밝기로 투사하도록 프로젝션부를 제어할 수 있다. 이에 대한 구체적인 내용에 대해서는 도 12를 통해 후술하도록 한다. 일 실시 예로, 전자 장치가 조명 모드로 진입하면, 프로세서는 전자 장치와 연동하는 사용자 단말이 재생하는 음악 컨텐츠에 대한 정보를 획득할 수 있다. 그리고, 프로세서는 획득된 음악 컨텐츠에 대한 정 보를 바탕으로, 음악 컨텐츠에 대응되는 투사 영상을 제2 밝기로 투사하도록 프로젝션부를 제어할 수 있다. 이에 대한 구체적인 내용에 대해서는 도 13a를 통해 후술하도록 한다. 한편, 본 개시의 일 실시예에 따른 전자 장치는 다양한 스마트 기능을 제공할 수 있다. 구체적으로, 전자 장치는 전자 장치를 제어하기 위한 휴대 단말 장치와 연결되어 휴대 단말 장치에서 입력되는 사용자 입력을 통해 전자 장치에서 출력되는 화면이 제어될 수 있다. 일 예로, 휴대 단말 장치는 터치 디스플레이를 포함하는 스마트폰으로 구현될 수 있으며, 전자 장치는 휴대 단말 장치에서 제공하는 화면 데이터를 휴대 단말 장치로부터 수신하여 출력하고, 휴대 단말 장치에서 입력되는 사용자 입력에 따라 전 자 장치에서 출력되는 화면이 제어될 수 있다. 전자 장치는 미라캐스트(Miracast), Airplay, 무선 DEX, Remote PC 방식 등 다양한 통신 방식을 통해 휴 대 단말 장치와 연결을 수행하여 휴대 단말 장치에서 제공하는 컨텐츠 또는 음악을 공유할 수 있다. 그리고, 휴대 단말 장치와 전자 장치는 다양한 연결 방식으로 연결이 수행될 수 있다. 일 실시 예로, 휴대 단말 장치에서 전자 장치를 검색하여 무선 연결을 수행하거나, 전자 장치에서 휴대 단말 장치를 검색 하여 무선 연결을 수행할 수 있다. 그리고, 전자 장치는 휴대 단말 장치에서 제공하는 컨텐츠를 출력할 수 있다. 일 실시 예로, 휴대 단말 장치에서 특정 컨텐츠 또는 음악이 출력 중인 상태에서 휴대 단말 장치를 전자 장치 근처에 위치시킨 후 휴대 단말 장치의 디스플레이를 통해 기 설정된 제스처가 감지되면(예로, 모션 탭뷰), 전자 장치는 휴대 단말 장치에서 출력 중인 컨텐츠 또는 음악을 출력할 수 있다. 일 실시 예로, 휴대 단말 장치에서 특정 컨텐츠 또는 음악이 출력 중인 상태에서 휴대 단말 장치가 전자 장치 와 기 설정 거리 이하로 가까워지거나(예로, 비접촉 탭뷰) 휴대 단말 장치가 전자 장치와 짧은 간격 으로 두 번 접촉되면(예로, 접촉 탭뷰), 전자 장치는 휴대 단말 장치에서 출력 중인 컨텐츠 또는 음악을 출력할 수 있다. 상술한 실시 예에서는 휴대 단말 장치에서 제공되고 있는 화면과 동일한 화면이 전자 장치에서 제공되는 것으로 설명하였으나, 본 개시는 이에 한정되지 않는다. 즉, 휴대 단말 장치와 전자 장치 간 연결이 구축 되면, 휴대 단말 장치에서는 휴대 단말 장치에서 제공되는 제1 화면이 출력되고, 전자 장치에서는 제1 화 면과 상이한 휴대 단말 장치에서 제공되는 제2 화면이 출력될 수 있다. 일 예로, 제1 화면은 휴대 단말 장치에 설치된 제1 어플리케이션이 제공하는 화면이며, 제2 화면은 휴대 단말 장치에 설치된 제2 어플리케이션이 제공 하는 화면일 수 있다. 일 예로, 제1 화면과 제2 화면은 휴대 단말 장치에 설치된 하나의 어플리케이션에서 제공 하는 서로 상이한 화면일 수 있다. 또한, 일 예로, 제1 화면은 제2 화면을 제어하기 위한 리모컨 형식의 UI를 포함하는 화면일 수 있다. 본 개시에 따른 전자 장치는 대기 화면을 출력할 수 있다. 일 예로, 전자 장치가 외부 장치와 연결이 수행되지 않은 경우 또는 외부 장치로부터 기 설정된 시간 동안 수신되는 입력이 없는 경우 전자 장치는 대기 화면을 출력할 수 있다. 전자 장치가 대기 화면을 출력하기 위한 조건은 상술한 예에 한정되지 않고 다양한 조건들에 의해 대기 화면이 출력될 수 있다. 전자 장치는 블루 스크린 형태의 대기 화면을 출력할 수 있으나, 본 개시는 이에 한정되지 않는다. 일 예 로, 전자 장치는 외부 장치로부터 수신되는 데이터에서 특정 오브젝트의 형태만을 추출하여 비정형 오브젝 트를 획득하고, 획득된 비정형 오브젝트를 포함하는 대기 화면을 출력할 수 있다. 도 3은 본 개시의 다른 실시예들에 따른, 전자 장치의 외관을 도시한 사시도이다. 도 3을 참조하면, 전자 장치는 지지대(또는 “손잡이”라는 함.)를 포함할 수 있다. 다양한 실시예의 지지대는 사용자가 전자 장치를 파지하거나 이동시키기 위하여 마련되는 손잡이 또 는 고리일 수 있으며, 또는 지지대는 본체가 측면 방향으로 눕혀진 상태에서 본체를 지지하는 스탠드일 수 있다. 지지대는 도 3에 도시된 바와 같이 본체의 외주면에 결합 또는 분리되도록 힌지 구조로 연결될 수 있 으며, 사용자의 필요에 따라 선택적으로 본체 외주면에서 분리 및 고정될 수 있다. 지지대의 개수, 형상 또는 배치 구조는 제약이 없이 다양하게 구현될 수 있다. 도면에는 도시되지 않았으나, 지지대는 본 체 내부에 내장되어 필요에 따라 사용자가 꺼내서 사용할 수 있으며, 또는 지지대는 별도의 액세서리 로 구현되어 전자 장치에 탈부착 가능할 수 있다. 지지대는 제1 지지면(108-1)과 제2 지지면(108-2)을 포함할 수 있다. 제1 지지면(108-1)은 지지대가 본체 외주면으로부터 분리된 상태에서 본체 바깥 방향을 마주보는 일 면일 수 있고, 제2 지지면(108- 2)은 지지대가 본체 외주면으로부터 분리된 상태에서 본체 내부 방향을 마주보는 일 면일 수 있 다. 제1 지지면(108-1)은 본체 하부로부터 본체 상부로 전개되며 본체로부터 멀어질 수 있으며, 제1 지지면(108-1)은 평탄하거나 균일하게 굴곡진 형상을 가질 수 있다. 제1 지지면(108-1)은 전자 장치가 본 체의 외측면이 바닥면에 닿도록 거치 되는 경우, 즉 프로젝션 렌즈가 전면 방향을 향하도록 배치되는 경우 본체를 지지할 수 있다. 2개 이상의 지지대를 포함하는 실시예에 있어서는, 2개의 지지대 의 간격 또는 힌지 개방된 각도를 조절하여 헤드와 프로젝션 렌즈의 출사 각도를 조절할 수 있다. 제2 지지면(108-2)은 지지대가 사용자 또는 외부 거치 구조에 의하여 지지가 될 때 사용자 또는 외부 거치 구조에 맞닿는 면으로, 전자 장치를 지지하거나 이동시키는 경우 미끄러지지 않도록 사용자의 손의 파지 구조 또는 외부 거치 구조에 대응되는 형상을 가질 수 있다. 사용자는 프로젝션 렌즈를 전면 방향으로 향 하게 하여 헤드를 고정하고 지지대를 잡고 전자 장치를 이동시키며, 손전등과 같이 전자 장치 를 이용할 수 있다. 지지대 홈은 본체에 마련되어 지지대가 사용되지 않을 때 수용 가능한 홈 구조로, 도 3에 도시 된 바와 같이 본체의 외주면에 지지대의 형상에 대응되는 홈 구조로 구현될 수 있다. 지지대 홈(10 4)을 통하여 지지대가 사용되지 않을 때 본체의 외주면에 지지대가 보관될 수 있으며, 본체 외주면은 매끄럽게 유지될 수 있다. 또는, 지지대가 본체 내부에 보관되고 지지대가 필요한 상황에서 지지대를 본체 외부 로 빼내는 구조를 가질 수 있다. 이 경우, 지지대 홈은 지지대를 수용하도록 본체 내부로 인입 된 구조일 수 있으며, 제2 지지면(108-2)이 본체 외주면에 밀착되거나 별도의 지지대 홈을 개폐하는 도어(미도시)를 포함할 수 있다. 도면에는 도시되지 않았으나, 전자 장치는 전자 장치의 이용 또는 보관에 도움을 주는 다양한 종류의 액세서리를 포함할 수 있으며, 예를 들면, 전자 장치는 전자 장치를 보호하며 용이하게 운반할 수 있 도록 보호 케이스(미도시)를 포함할 수 있으며, 또는, 본체를 지지하거나 고정하는 삼각대(미도시) 또는 외부 면에 결합되어 전자 장치를 고정 가능한 브라켓(미도시)을 포함할 수 있다. 도 4는 본 개시의 또 다른 실시예들에 따른, 전자 장치의 외관을 도시한 사시도이다. 도 4를 참조하면, 전 자 장치는 지지대(또는 “손잡이”라는 함.)를 포함할 수 있다. 다양한 실시예의 지지대는 사용자가 전자 장치를 파지하거나 이동시키기 위하여 마련되는 손잡이 또 는 고리일 수 있으며, 또는 지지대는 본체가 측면 방향으로 눕혀진 상태에서 본체가 임의의 각 도로 향할 수 있도록 지지하는 스탠드일 수 있다. 구체적으로, 지지대는 도 4에 도시된 바와 같이, 본체의 기설정된 지점(예를 들어, 2/3~ 3/4 지점)에 서 본체와 연결될 수 있다. 지지대가 본체 방향으로 회전되면, 본체가 측면 방향으로 눕혀진 상 태에서 본체가 임의의 각도로 향할 수 있도록 지지할 수 있다. 한편, 도 3 및 도 4에 도시된 지지대는 일 실시예에 불과할 뿐, 전자 장치는 다양한 위치나 형태로 지지대를 구비할 수 있음은 물론이다. 도 6a는 본 개시의 일 실시 예에 따른 전자 장치와 결합되는 커버를 설명하기 위한 도면이다. 도 6b는 본 개시 의 일 실시 예에 따른 전자 장치와 커버가 결합된 예시를 나타내는 도면이다. 커버는 프로젝션 렌즈와 선택적으로 근접 또는 이격되도록 위치하며, 프로젝션 렌즈를 개폐할 수 있다. 보다 상세하게는, 커버는 프로젝션 렌즈와 밀접하게 위치하여 적어도 일부 영역이 접하거나 이격되도록 위치할 수 있으며, 또는, 커버는 기설정된 간격 범위에서 프로젝션 렌즈로부터 이격되어 프로젝션 렌즈로부터 멀어지거나 가까워지도록 위치할 수 있다. 일 예로, 커버는 리드(lid) 또는 캡(cap) 의 형태로 구현될 수 있다. 일 실시 예로, 커버는 헤드에 결합될 수 있으나, 이에 한정되지 않고 본체 또는 본체의 케 이스에 선택적으로 결합될 수 있다. 커버가 헤드와 결합되며 프로젝션 렌즈와 근접해지고, 커버 가 헤드와 분리되며 프로젝션 렌즈와 이격될 수 있다. 커버가 헤드에 밀착 결합되면, 또는 커버와 프로젝션 렌즈가 근접하게 배치되면, 커버 는 프로젝션 렌즈에서 출력되는 광을 전달받아 확산시키며 커버 외부로 방출할 수 있다. 커버 의 확산 방향 및 방출 방향은 제한이 없으며, 무지향성으로 전 영역으로 출사광을 확산시킬 수 있고, 또는, 기설정된 방향으로 출사광을 가이드하며 확산시킬 수 있다. 일 실시 예로, 커버는 프로젝션 렌즈에서 출력되는 광을 확산시키기 위한 복수의 확산판을 포함할 수 있다. 이러한 확산판을 통해 전자 장치에서 투사되는 광이 일반 조명 광과 같이 확산되는 효과를 볼 수 있 다. 도 6b를 참조하면, 본 개시의 일 실시 예에 따른 커버는 3개의 확산판(610, 620, 630)을 포함할 수 있다. 구체적으로, 커버의 제1 확산판은 헤드와 결합되는 커버의 하부 면에 위치할 수 있다. 그 리고, 커버의 제2 확산판은 커버가 헤드와 결합되면, 헤드에서 프로젝션 렌즈가 위치되는 영역 상에 위치할 수 있다. 그리고, 커버의 제3 확산판은 커버의 상부 면에 위치할 수 있다. 또한, 일 실시 예로, 커버의 높이(a)는 20mm이하로 구현될 수 있다. 그리고, 커버가 헤드와 결합되면, 프로젝션부에서 출사된 광이 프로젝션 렌즈를 통과하고, 프로젝션 렌즈를 통과한 광이 제1 확산판, 제2 확산판 및 제3 확산판을 순차적으로 통과되 어, 프로젝션부에서 출사된 광을 통해 조명 기능이 제공될 수 있다. 다만, 본 개시에 따른 커버는 상술한 예시에 한정되지 않으며, 3개가 아닌 하나의 확산판을 포함하거나, 2 개 또는 4개 이상의 확산판을 포함할 수 있다. 도 7a는 본 개시의 일 실시 예에 따른, 전자 장치가 프로젝션 모드로 동작되는 실시 예를 도시한 도면이다. 도 7b는 본 개시의 일 실시 예에 따른, 전자 장치가 조명 모드로 동작되는 실시 예를 도시한 도면이다. 도 7c는 광을 출력하는 복수의 LED 소자를 도시한 도면이다. 전자 장치와 커버가 결합되지 않은 경우, 전자 장치는 프로젝션 모드로 동작될 수 있다. 즉, 도 7a를 참조하면, 전자 장치는 커버가 결합되지 않은 채로, 프로젝션부를 통해 제1 밝기(예로, 100% 밝기)로 투사 영상을 투사할 수 있다. 그리고, 전자 장치와 커버가 결합된 경우, 전자 장치는 조명 모드로 동작될 수 있다. 즉, 도 7b 를 참조하면, 전자 장치는 커버와 결합된 채로, 프로젝션부를 통해 제2 밝기(예로, 50% 밝기)로 광을 투사할 수 있다. 본 개시에 따른 일 실시 예로, 전자 장치는 컬러 센서 또는 조도 센서를 통해, 커버와 결 합되었는지 여부를 식별할 수 있다. 구체적으로, 컬러 센서 및 조도 센서는 헤드 내 위치되며, 광이 투사되는 방향의 색상 정보 또는 조도 정보를 감지하도록 위치할 수 있다. 일 실시 예로, 도 7a와 같이, 프로젝션 모드로 동작 도중에 커버가 헤드에 결합되면, 전자 장치(10 0)는 조도 센서를 통해 감지되는 조도 정보를 바탕으로 조도 변화를 식별할 수 있다. 즉, 커버가 헤 드에 결합되는 경우, 전자 장치는 조도 센서를 통해 조도가 어두워지는 것으로 식별할 수 있다. 그리고, 이러한 조도 변화를 바탕으로, 전자 장치는 커버가 헤드에 결합된 것으로 식별할 수 있 다. 그리고 도 7b와 같이, 전자 장치는 조명 모드로 동작하도록 프로젝션부를 제어할 수 있다. 일 실시 예로, 도 7a와 같이, 프로젝션 모드로 동작 도중에 커버가 헤드에 결합되면, 전자 장치(10 0)는 컬러 센서를 통해 감지되는 컬러 정보를 바탕으로 색상 변화를 식별할 수 있다. 컬러 센서를 통 해 식별되는 색상 변화를 통해 조명을 제공하는 실시 예에 대해서는 도 11a 내지 도 11b를 통해 후술하도록 한 다. 그리고, 조명 모드로 진입하면, 전자 장치는 광을 출력하는 LED 소자의 구동 개수를 제어하여 제2 밝기로 광을 출력할 수 있다. 도 7c은 프로젝션 렌즈를 광이 투사되는 방향에서 바라본 00도이다. 전자 장치에서 투사 영상을 투사하는 광원이 LED로 구현되는 경우, 프로젝션부는 복수의 LED 소자를 바탕으로 광을 출력할 수 있다. 구체적으로, 복수의 LED 소자에서 출력된 광이 프로젝션 렌즈를 통과하여 투사 영상이 투사될 수 있다. 일 실시 예로, 프로젝션 모드로 동작되는 동안에는 복수의 LED 소자 전부(A 및 B)에서 광이 출력될 수 있다. 그 리고, 조명 모드로 동작되는 동안에는 복수의 LED 소자 중 일부 LED 소자에서 광이 출력될 수 있다. 즉, 도 7c 를 참조하면, 전자 장치는 조명 모드로 동작되는 동안에는 복수의 LED 소자 각각이 교번적으로 광을 출력 하도록 제어할 수 있다. 즉, 전자 장치는 복수의 LED 소자 중 복수의 제1 LED 소자(A)에서 광이 출력되면, 복수의 LED 소자 중 복수의 제2 LED 소자(B)는 광이 출력되지 않도록 복수의 LED 소자를 제어할 수 있다. 일 실시 예로, 조명 모드로 진입하면, 전자 장치는 복수의 제1 LED 소자(A)에서 광이 출력되도록 복수의 LED 소자를 제어하고, 복수의 LED 소자 중 복수의 제2 LED 소자(B)는 광이 출력되지 않도록 복수의 LED 소자를제어할 수 있다. 그리고, 조명 모드로 동작 중 기설정 시간이 결과되면, 전자 장치는 복수의 LED 소자 중 복수의 제1 LED 소자(A)에서 광이 출력되지 않도록 복수의 LED 소자를 제어하고, 복수의 LED 소자 중 복수의 제 2 LED 소자(B)는 광이 출력되도록 복수의 LED 소자를 제어할 수 있다. 도 7c에서는 복수의 LED 소자 중 절반의 LED 소자들이 교번적으로 광을 출력하는 것으로 설명하였지만, 본 개시 는 이에 한정되지 않고, 복수의 LED 소자 중 기 설정 비율의 소자들이 교번적으로 광을 출력하도록 제어될 수 도 있다. 도 8은 본 개시에 따른, 프로젝션 모드를 설명하기 위한 도면이다. 도 8을 참조하면, 전자 장치는 프로젝션 모드로 동작되는 동안, 주변의 조도 변화에 따라 출력되는 광의 밝기를 제어할 수 있다. 도 8의 제1 실시 예(800-1)를 참조하면, 전자 장치는 조도 센서를 통해 획득한 조도 정보를 통해 전 자 장치의 주변 밝기가 어두운 것으로 식별할 수 있다. 전자 장치의 주변 밝기가 어두운 것으로 식별 되면, 전자 장치는 100%의 밝기로 광을 출력하도록 프로젝션부를 제어할 수 있다. 그리고, 도 8의 제2 실시 예(800-2)에 따라, 전자 장치 주변 밝기가 제1 실시 예(800-1) 보다 상대적으로 밝아지면(기 설정 비율 이상 밝아지면), 전자 장치는 50%의 밝기로 광을 출력하도록 프로젝션부를 제 어할 수 있다. 그리고, 도 8의 제3 실시 예(800-3)에 따라, 전자 장치 주변 밝기가 제2 실시 예(800-2) 보다 상대적으로 밝아지면(기 설정 비율 이상 밝아지면), 전자 장치는 광을 출력하지 않도록 프로젝션부를 제어할 수 있다. 도 8의 실시 예에 따라, 전자 장치는 조도 센서를 이용하여 획득된 조도 변화에 따라 주변이 밝아지면, 전 자 장치가 프로젝션 모드로 동작하지 않도록 제어할 수 있다. 도 9는 본 개시에 따른, 조명 모드를 설명하기 위한 도면이다. 도 9을 참조하면, 전자 장치는 조명 모드로 동작되는 동안, 주변의 조도 변화에 따라 출력되는 광의 밝기 를 제어할 수 있다. 도 9의 제1 실시 예(900-1)를 참조하면, 전자 장치는 커버와 결합되어 조명 모드로 동작되는 동안, 조도 센서를 통해 획득한 조도 정보를 통해 전자 장치의 주변 밝기가 어두운 것으로 식별할 수 있다. 전자 장치의 주변 밝기가 어두운 것으로 식별되면, 전자 장치는 50%의 밝기로 광을 출력하도록 프로 젝션부를 제어할 수 있다. 그리고, 도 9의 제2 실시 예(900-2)에 따라, 전자 장치 주변 밝기가 제1 실시 예(900-1) 보다 상대적으로 밝아지면(기 설정 비율 이상 밝아지면), 전자 장치는 20%의 밝기로 광을 출력하도록 프로젝션부를 제 어할 수 있다. 그리고, 도 9의 제3 실시 예(900-3)에 따라, 전자 장치 주변 밝기가 제2 실시 예(900-2) 보다 상대적으로 밝아지면(기 설정 비율 이상 밝아지면), 전자 장치는 광을 출력하지 않도록 프로젝션부를 제어할 수 있다. 도 9의 실시 예에 따라, 전자 장치는 조도 센서를 이용하여 획득된 조도 변화에 따라 주변 밝기에 대응되 는 조명을 제공할 수 있다. 도 10은 본 개시에 따른, 조명 모드가 제공하는 알람 기능을 설명하기 위한 도면이다. 본 개시에 따른 일 실시 예로, 조명 모드는 알람 기능을 제공할 수 있다. 구체적으로, 사용자 단말 장치에 의해 알람이 설정되면, 사용자 단말 장치와 연결된 전자 장치는 알람에 대응되는 시간에 조명을 제공하도록 광 을 출력할 수 있다. 즉, 도 10의 제1 실시 예(1000-1)와 같이 주변이 어두운 경우, 전자 장치는 광을 출력 하지 않도록 프로젝션부부를 제어할 수 있다. 그리고, 도 10의 제2 실시 예(1000-2)와 같이 기설정된 알람에 대응되는 시간이 도래하면, 전자 장치는 20%의 밝기로 광을 출력하도록 프로젝션부를 제어할 수 있다. 도 8 내지 도 10의 실시 예에서 설명한 밝기(100% 밝기, 50% 밝기, 20% 밝기)는 상술한 예에 한정되지 않으며, 다양한 밝기로 제어될 수 있다. 도 11은 본 개시에 따른 커버의 색상 별 제공되는 조명의 색상 및 영상이 상이한 실시 예를 설명하기 위한 도면 이다. 본 개시에 따른 커버는 특정 색상을 포함할 수 있다. 구체적으로, 도 11의 제1 커버(600-1)는 빨강 색상을 포함할 수 있다. 그리고, 전자 장치는 제1 커버(600- 1)가 결합되면, 컬러 센서를 통해 빨강 색상에 대응되는 컬러 정보를 수신할 수 있다. 그리고, 일 실시 예 로, 전자 장치는 빨강 색상에 대응되는 영상을 투사하도록 프로젝션부를 제어할 수 있다. 또 다른 실시 예로, 전자 장치는 빨강 색상에 대응되는 복수의 단색의 광을 순차적으로 또는 기 설정된 순서로 투사하도록 프로젝션부를 제어할 수 있다. 빨강 색상에 대응되는 복수의 단색은 빨강 계열의 색상일 수 있다. 또한, 도 11의 제2 커버(600-2)는 주황 색상을 포함할 수 있다. 그리고, 전자 장치는 제2 커버(600-2)가 결합되면, 컬러 센서를 통해 주황 색상에 대응되는 컬러 정보를 수신할 수 있다. 그리고, 일 실시 예로, 전자 장치는 주황 색상에 대응되는 영상을 투사하도록 프로젝션부를 제어할 수 있다. 또 다른 실시 예로, 전자 장치는 주황 색상에 대응되는 복수의 단색의 광을 순차적으로 또는 기 설정된 순서 로 투사하도록 프로젝션부를 제어할 수 있다. 주황 색상에 대응되는 복수의 단색은 주황 계열의 색 상일 수 있다. 또한, 도 11의 제3 커버(600-3)는 파랑 색상을 포함할 수 있다. 그리고, 전자 장치는 제3 커버(600-3)가 결합되면, 컬러 센서를 통해 파랑 색상에 대응되는 컬러 정보를 수신할 수 있다. 그리고, 일 실시 예로, 전자 장치는 파랑 색상에 대응되는 영상을 투사하도록 프로젝션부를 제어할 수 있다. 또 다른 실시 예로, 전자 장치는 파랑 색상에 대응되는 복수의 단색의 광을 순차적으로 또는 기 설정된 순서 로 투사하도록 프로젝션부를 제어할 수 있다. 파랑 색상에 대응되는 복수의 단색은 파랑 계열의 색 상일 수 있다. 도 12는 프로젝션 모드에서 제공된 영상에 대응되는 색상으로 조명 모드가 제공되는 실시 예를 설명하기 위한 도면이다. 도 12를 참조하면, 전자 장치는 프로젝션 모드로 동작 도중 이미지 영상을 투사할 수 있다. 그리고, 이미지 영상이 투사되는 도중, 전자 장치와 커버가 결합되어 조명 모드로 진입되면, 전자 장치 는 이미지 영상에 대응되는 복수의 단색(1200-1)의 광을 순차적으로 또는 기설정된 순서로 투사할 수 있다. 일 실시 예로, 이미지 영상은 단일 프레임의 정지 영상일 수 있으나, 이에 한정되지 않고, 복수의 프레임 으로 구성된 동영상일 수 있으며, 이 경우, 전자 장치는 복수의 프레임 각각에 대응되는 색상을 식별하고, 식별된 색상을 바탕으로 광을 투사할 수 있다. 즉, 도 12의 실시 예와 같이, 전자 장치는 투사 영상에 투사되는 영상의 대표 색상을 식별하고, 투사 영상 이 투사되는 도중 조명 모드로 진입 되면, 대표 색상에 대응되는 광을 투사할 수 있다. 도 13a은 본 개시에 따른, 조명 모드에서 출력되는 광의 색상 및 영상을 제어하기 위한 UI를 도시한 도면이다. 도 13b은 본 개시에 따른, 조명 모드에서 출력되는 광의 색상 및 영상을 제어하기 위한 UI를 도시한 도면이다. 도 11 및 도 12와 같이, 본 개시에 따른 전자 장치는 커버의 색상 또는 프로젝션 모드로 동작 중 투 사된 영상의 대표 색상을 바탕으로 조명을 제공할 수 있으나, 본 개시는 이에 한정되지 않고 사용자에 의해 조 명 모드에서 제공되는 색상이 설정될 수 있다.일 예로, 전자 장치와 연결된 사용자 단말 장치에서 음악이 재생 중인 경우, 도 13a와 같이 전자 장치 에서 제공되는 조명을 제어하기 위한 UI(1310, 1315)가 사용자 단말 장치의 디스플레이 상에 표시될 수 있 다. 구체적으로, 제1 UI는 전자 장치가 제공할 복수의 조명 모드 각각에 대응되는 아이콘을 포함할 수 있으며, 제2 UI은 현재 전자 장치가 동작되고 있는 조명 모드에 대응되는 이미지를 포함할 수 있 다. 일 실시 예로, 제1 UI 중 “party” 조명 모드에 대응되는 아이콘(1310-1)이 선택되면, 제2 UI에 는 “party” 조명 모드에 대응되는 이미지가 표시되며, 전자 장치는 “party” 조명 모드에 따라 광을 출 력할 수 있다. 또한 일 실시 예로, 전자 장치는 사용자 단말 장치에서 재생 중인 음악 컨텐츠에 대한 정보를 획득하고, 음악 컨텐츠에 대응되는 정보에 대응되는 투사 영상을 투사할 수 있다. 즉, 도 13a와 같이, 전자 장치(10 0)는 사용자 단말 장치에서 재생 중인 음악 컨텐츠에 대한 정보에 따라 “party” 조명 모드에 대응되는 투사 영상을 투사하고, 사용자 단말 장치에는 음악 컨텐츠에 대응되는 정보를 바탕으로, 제2 UI에는 “party” 조명 모드에 대응되는 이미지가 표시될 수 있다. 그리고, 도 13b와 같이, 제1 UI 중 “My Style” 조명 모드에 대응되는 아이콘(1320-1)이 선택되면, 제2 UI에는 사용자에 의해 조명을 조절할 수 있는 설정 UI들이 표시될 수 있다. 도 14는 본 개시에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 14를 참조하면, 전자 장치는 투사 영상을 투사하기 위해 제1 밝기로 광을 투사하는 프로젝션 모드로 동 작하도록 프로젝션부를 제어할 수 있다(S1410) 그리고, 전자 장치는 프로젝션 모드로 동작하는 동안, 조명 모드로 진입하기 위한 이벤트를 감지할 수 있 다(S1420). 조명 모드로 진입하기 위한 이벤트는 일 실시 예로, 프로젝션부 상에 커버가 결합되는 이벤트일 수 있다. 그리고, 전자 장치는 조도 센서를 통해 감지된 조도 변화 또는 컬러 센서를 바탕으로 획득되는 색상 정보를 바탕으로 프로젝션부 상에 커버가 결합되는지 여부를 감지할 수 있다. 그리고, 이벤트에 따라 조명 모드로 진입하면, 전자 장치는 제1 밝기보다 어두운 제2 밝기로 광을 투사하 도록 상기 프로젝션부를 제어할 수 있다(S1420). 일 실시 예로, 이벤트에 따라 조명 모드로 진입하면, 전자 장치는 조도 센서를 통해 댁내의 조도 정보를 획득하고, 획득된 조도 정보를 바탕으로 제2 밝기를 조절하도록 프로젝션부를 제어할 수 있다. 일 실시 예로, 이벤트에 따라 조명 모드로 진입하면, 전자 장치는 프로젝션 모드로 동작하는 동안에 투사 된 투사 영상의 색상 정보를 획득하고, 획득된 색상 정보에 대응되는 광을 제2 밝기로 투사하도록 프로젝션부를 제어할 수 있다. 일 실시 예로, 이벤트에 따라 조명 모드로 진입하면, 전자 장치는 전자 장치와 연동하는 사용자 단말이 재 생하는 음악 컨텐츠에 대한 정보를 획득하고, 획득된 음악 컨텐츠에 대한 정보를 바탕으로, 음악 컨텐츠에 대응 되는 투사 영상을 제2 밝기로 투사하도록 프로젝션부를 제어할 수 있다. 일 실시 예로, 프로젝션부는 복수의 LED 소자를 포함하고, 전자 장치는 복수의 LED 소자의 구동 개수를 제 어하여 제2 밝기로 광을 투사하도록 프로젝션부를 제어할 수 있다. 일 실시 예로, 프로젝션부는 복수의 LED 소자를 포함하고, 전자 장치는 복수의 LED 소자의 구동 전류를 제 어하여 제2 밝기로 광을 투사하도록 프로젝션부를 제어 할 수 있다. 본 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도면에 예 시하고 상세한 설명에 상세하게 설명하였다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하려는 것이 아 니며, 본 개시의 실시 예의 다양한 변경(modifications), 균등물(equivalents), 및/또는 대체물(alternative s)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부 호가 사용될 수 있다. 본 개시를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그에 대한 상세한 설명은 생략한다. 덧붙여, 상술한 실시 예들은 여러 가지 다른 형태로 변형될 수 있으며, 본 개시의 기술적 사상의 범위가 하기 실시 예에 한정되는 것은 아니다. 오히려, 이들 실시 예는 본 개시를 더욱 충실하고 완전하게 하고, 당업자에게 본 개시의 기술적 사상을 완전하게 전달하기 위하여 제공되는 것이다. 본 개시에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 권리범위를 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 개시에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 개시에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직 접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 개시에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트 웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 실시 예에 있어서 '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 '모듈' 혹은 복수의 '부'는 특정 한 하드웨어로 구현될 필요가 있는 '모듈' 혹은 '부'를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하 나의 프로세서로 구현될 수 있다. 한편, 도면에서의 다양한 요소와 영역은 개략적으로 그려진 것이다. 따라서, 본 발명의 기술적 사상은 첨부한 도면에 그려진 상대적인 크기나 간격에 의해 제한되지 않는다. 한편, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합된 것 을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 하드 웨어적인 구현에 의하면, 본 개시에서 설명되는 실시 예들은 ASICs(Application Specific Integrated Circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기 (controllers), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행 을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 명세서에서 설명되 는 실시 예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 상기 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 작동을 수행할 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 방법은 비일시적 판독 가능 매체(non-transitory readable medium)에 저장될 수 있다. 이러한 비일시적 판독 가능 매체는 다양한 장치에 탑재되어 사용될 수 있다. 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 방법을 수행하기 위한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD- ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있다. 온라인 배 포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시"}
{"patent_id": "10-2021-0078319", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시가 속하는 기술분야 에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2021-0078319", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 본 개시의 일 실시예들에 따른, 전자 장치의 외관을 도시한 사시도이다. 도 2는 본 개시의 일 실시예에 따른, 전자 장치의 구성을 도시한 블록도이다. 도 3은 본 개시의 다른 실시예들에 따른, 전자 장치의 외관을 도시한 사시도이다. 도 4는 본 개시의 또 다른 실시예들에 따른, 전자 장치의 외관을 도시한 사시도이다. 도 5a는 본 개시에 따른 프로젝션 모드를 설명하기 위한 도면이다. 도 5b는 본 개시에 따른 조명 모드를 설명하기 위한 도면이다. 도 6a는 본 개시의 일 실시 예에 따른 전자 장치와 결합되는 커버를 설명하기 위한 도면이다. 도 6b는 본 개시의 일 실시 예에 따른 전자 장치와 커버가 결합된 예시를 나타내는 도면이다. 도 7a는 본 개시의 일 실시 예에 따른, 전자 장치가 프로젝션 모드로 동작되는 실시 예를 도시한 도면이다. 도 7b는 본 개시의 일 실시 예에 따른, 전자 장치가 조명 모드로 동작되는 실시 예를 도시한 도면이다. 도 7c는 광을 출력하는 복수의 LED 소자를 도시한 도면이다. 도 8은 본 개시에 따른, 프로젝션 모드를 설명하기 위한 도면이다. 도 9는 본 개시에 따른, 조명 모드를 설명하기 위한 도면이다.도 10은 본 개시에 따른, 조명 모드가 제공하는 알람 기능을 설명하기 위한 도면이다. 도 11은 본 개시에 따른 커버의 색상 별 제공되는 조명의 색상 및 영상이 상이한 실시 예를 설명하기 위한 도면 이다. 도 12는 프로젝션 모드에서 제공된 영상에 대응되는 색상으로 조명 모드가 제공되는 실시 예를 설명하기 위한 도면이다. 도 13a은 본 개시에 따른, 조명 모드에서 출력되는 광의 색상 및 영상을 제어하기 위한 UI를 도시한 도면이다. 도 13b은 본 개시에 따른, 조명 모드에서 출력되는 광의 색상 및 영상을 제어하기 위한 UI를 도시한 도면이다. 도 14는 본 개시에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
