{"patent_id": "10-2022-0123857", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0044620", "출원번호": "10-2022-0123857", "발명의 명칭": "시각지능 모델의 추론결과 설명 도출 방법 및 시스템", "출원인": "한국전자기술연구원", "발명자": "조충상"}}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시각지능 모델 및 시각지능 모델에 입력할 시각 데이터를 입력받는 제1 입력부;시각지능 모델에 대한 정보인 모델정보 및 시각지능 모델의 추론결과에 대한 설명 도출 방법에 대한 정보인 방법정보를 입력받는 제2 입력부; 및모델정보와 방법정보를 기초로, 시각 데이터가 입력된 시각지능 모델의 추론결과에 대한 설명을 도출하는 도출부;를 포함하는 것을 특징으로 하는 시각지능 모델 추론결과 설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,방법정보는,설명 도출 방법, 시각지능 모델의 입력 데이터에 대한 전처리 조건, 시각지능 모델의 중간정보 추출 가능 여부,중간정보를 추출할 타겟 레이어 및 설명 도출 도구 중 적어도 하나에 대한 정보를 포함하는 것을 특징으로 하는시각지능 모델 추론결과 설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,설명 도출 방법은,Perturbation 기반 설명 도출 방법 및 시각지능 모델의 중간정보를 활용한 설명 도출 방법을 포함하는 것을 특징으로 하는 시각지능 모델 추론결과 설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,Perturbation 기반 설명 도출 방법은,시각지능 모델에 입력할 시각 데이터를 랜덤 마스킹하여 다수의 마스킹된 시각 데이터들을 생성하고,생성한 마스킹된 시각 데이터들을 시각지능 모델에 각각 입력하여 추론결과들을 생성하며,생성된 추론결과들을 기초로 랜덤 마스킹에 활용된 마스크들의 가중치들을 설정하고,설정된 가중치들을 랜덤 마스크들에 적용하여 융합함으로써, 추론결과에 대한 설명을 도출하는 방법인 것을 특징으로 하는 시각지능 모델 추론결과 설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서,시각지능 모델의 중간정보를 활용한 설명 도출 방법은,시각 데이터를 시각지능 모델에 입력하여 추론결과가 생성되는 과정에서 중간정보를 추출하고,공개특허 10-2024-0044620-3-제2 입력부를 통해 지정한 설명 도출 도구를 이용하여, 추출된 중간 정보로부터 추론결과에 대한 설명을 도출하는 방법인 것을 특징으로 하는 시각지능 모델 추론결과 설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,시각지능 모델의 중간정보를 활용한 설명 도출 방법은,시각지능 모델의 중간정보 추출 가능 여부가 가능으로 지정되어 있고, 중간정보를 추출할 타겟 레이어가 지정되어 있으면, 지정된 타겟 레이어로부터 중간정보를 추출하는 방법인 것을 특징으로 하는 시각지능 모델 추론결과설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 5에 있어서,시각지능 모델의 중간정보를 활용한 설명 도출 방법은,시각지능 모델의 중간정보 추출 가능 여부가 불가능으로 지정되어 있으면, 모델정보를 기초로 타겟 레이어를 예측하고, 예측된 타겟 레이어로부터 중간정보를 추출하며, 시각지능 모델의 최종단에서 추론결과와 함께 출력되는 정확도 정보도 중간정보로 추출하는 방법인 것을 특징으로 하는 시각지능 모델 추론결과 설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,중간정보는,Activation 정보 및 Gradient 정보 중 적어도 하나를 포함하고,모델정보는,시각지능 모델의 입력 데이터, 목적, 명칭, 목적의 대상, 시각지능 모델의 구조 변경 여부에 대한 정보들 중 적어도 하나를 포함하는 것을 특징으로 하는 시각지능 모델 추론결과 설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,도출부에 의해 도출된 설명을 기초로 시각 데이터를 가공하는 가공부;를 더 포함하는 것을 특징으로 하는 시각지능 모델 추론결과 설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "시각지능 모델 및 시각지능 모델에 입력할 시각 데이터를 입력받는 단계;시각지능 모델에 대한 정보인 모델정보 및 시각지능 모델의 추론결과에 대한 설명 도출 방법에 대한 정보인 방법정보를 입력받는 단계; 및모델정보와 방법정보를 기초로, 시각 데이터가 입력된 시각지능 모델의 추론결과에 대한 설명을 도출하는 단계;를 포함하는 것을 특징으로 하는 시각지능 모델 추론결과 설명 도출 방법.공개특허 10-2024-0044620-4-청구항 11 시각지능 모델에 대한 정보인 모델정보 및 시각지능 모델의 추론결과에 대한 설명 도출 방법에 대한 정보인 방법정보를 입력받는 입력부;모델정보와 방법정보를 기초로, 시각 데이터가 입력된 시각지능 모델의 추론결과에 대한 설명을 도출하는 도출부; 및도출부에 의해 도출된 설명을 기초로 시각 데이터를 가공하는 가공부;를 포함하는 것을 특징으로 하는 시각지능모델 추론결과 설명 도출 시스템."}
{"patent_id": "10-2022-0123857", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "시각지능 모델에 대한 정보인 모델정보를 입력받는 단계;시각지능 모델의 추론결과에 대한 설명 도출 방법에 대한 정보인 방법정보를 입력받는 단계;모델정보와 방법정보를 기초로, 시각 데이터가 입력된 시각지능 모델의 추론결과에 대한 설명을 도출하는 단계;및도출된 설명을 기초로 시각 데이터를 가공하는 단계;를 포함하는 것을 특징으로 하는 시각지능 모델 추론결과설명 도출 방법."}
{"patent_id": "10-2022-0123857", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "시각지능 모델의 추론결과 설명 도출 방법 및 시스템이 제공된다. 본 발명의 실시예에 따른 시각지능 모델 추론 결과 설명 도출 시스템은, 시각지능 모델 및 시각지능 모델에 입력할 시각 데이터를 입력받고, 시각지능 모델에 대한 정보인 모델정보 및 시각지능 모델의 추론결과에 대한 설명 도출 방법에 대한 정보인 방법정보를 입력받으 며, 모델정보와 방법정보를 기초로 시각 데이터가 입력된 시각지능 모델의 추론결과에 대한 설명을 도출한다. 이 에 의해, 사용자가 손쉽게 추론결과에 대한 설명을 제공받을 수 있게 되고, 이를 기반으로 시각지능 모델의 신뢰 도를 향상시킬 수 있게 되며, 나아가 시각 지능모델의 개선/고도화 방향 설정에 도움을 줄 수 있게 된다"}
{"patent_id": "10-2022-0123857", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 관련 기술에 관한 것으로, 더욱 상세하게는 시각지능 모델의 추론결과에 대한 설명을 도출 하여 주는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0123857", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 모델은 서로 복잡하게 연결된 수백만개 이상의 파라미터들이 비선형으로 상호작용하는 구조로, 어떤 분야에서는 그 추론능력이 사람보다도 정확하다. 사람의 인지 영역을 넘어선 내부 구조 탓에 인공지능 모델이 왜 그런 결과를 도출했는지는 개발자도 알 수 없지 만, 최근 들어 인공지능 모델의 추론결과를 설명하기 위한 기법들이 등장하고 있다. 하지만 이 기법들을 활용하 는 것은 개발자도 어려운 수준이다. 특히 인공지능 모델의 가장 대표적인 사례인 시각지능 모델은 객체 인식, 분류, 회귀, 분할, 추적 등의 많은 활 용 분야에 활용되고 있으며, 모델의 종류 역시 매우 다양하다. 이로 인해 시각지능 모델의 경우 추론결과에 대 한 설명 도출은 더욱 어려운 실정이다."}
{"patent_id": "10-2022-0123857", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로서, 본 발명의 목적은, 다양한 시각지능 모델에 대해 사용자가 손쉽게 추론결과에 대한 설명을 도출할 수 있도록 하여 주는 방법 및 시스템을 제공함에 있다."}
{"patent_id": "10-2022-0123857", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 시각지능 모델 추론결과 설명 도출 시스템은, 시각지능 모델 및 시각지능 모델에 입력할 시각 데이터를 입력받는 제1 입력부; 시각지능 모델에 대한 정보인 모델정보 및 시각지능 모델의 추론결과에 대한 설명 도출 방법에 대한 정보인 방법정보를 입력받는 제2 입력부; 및 모델 정보와 방법정보를 기초로, 시각 데이터가 입력된 시각지능 모델의 추론결과에 대한 설명을 도출하는 도출부;를 포함한다. 방법정보는, 설명 도출 방법, 시각지능 모델의 입력 데이터에 대한 전처리 조건, 시각지능 모델의 중간정보 추 출 가능 여부, 중간정보를 추출할 타겟 레이어 및 설명 도출 도구 중 적어도 하나에 대한 정보를 포함할 수 있 다. 설명 도출 방법은, Perturbation 기반 설명 도출 방법 및 시각지능 모델의 중간정보를 활용한 설명 도출 방법을 포함할 수 있다. Perturbation 기반 설명 도출 방법은, 시각지능 모델에 입력할 시각 데이터를 랜덤 마스킹하여 다수의 마스킹된 시각 데이터들을 생성하고, 생성한 마스킹된 시각 데이터들을 시각지능 모델에 각각 입력하여 추론결과들을 생 성하며, 생성된 추론결과들을 기초로 랜덤 마스킹에 활용된 마스크들의 가중치들을 설정하고, 설정된 가중치들 을 랜덤 마스크들에 적용하여 융합함으로써, 추론결과에 대한 설명을 도출하는 방법일 수 있다. 시각지능 모델의 중간정보를 활용한 설명 도출 방법은, 시각 데이터를 시각지능 모델에 입력하여 추론결과가 생 성되는 과정에서 중간정보를 추출하고, 제2 입력부를 통해 지정한 설명 도출 도구를 이용하여, 추출된 중간 정 보로부터 추론결과에 대한 설명을 도출하는 방법일 수 있다. 시각지능 모델의 중간정보를 활용한 설명 도출 방법은, 시각지능 모델의 중간정보 추출 가능 여부가 가능으로 지정되어 있고, 중간정보를 추출할 타겟 레이어가 지정되어 있으면, 지정된 타겟 레이어로부터 중간정보를 추출 하는 방법일 수 있다. 시각지능 모델의 중간정보를 활용한 설명 도출 방법은, 시각지능 모델의 중간정보 추출 가능 여부가 불가능으로 지정되어 있으면, 모델정보를 기초로 타겟 레이어를 예측하고, 예측된 타겟 레이어로부터 중간정보를 추출하며, 시각지능 모델의 최종단에서 추론결과와 함께 출력되는 정확도 정보도 중간정보로 추출하는 방법일 수 있다. 중간정보는, Activation 정보 및 Gradient 정보 중 적어도 하나를 포함하고, 모델정보는, 시각지능 모델의 입력 데이터, 목적, 명칭, 목적의 대상, 시각지능 모델의 구조 변경 여부에 대한 정보들 중 적어도 하나를 포함할 수 있다. 도출부에 의해 도출된 설명을 기초로 시각 데이터를 가공하는 가공부;를 더 포함할 수 있다. 본 발명의 실시예에 따른 시각지능 모델 추론결과 설명 도출 방법은, 시각지능 모델 및 시각지능 모델에 입력할 시각 데이터를 입력받는 단계; 시각지능 모델에 대한 정보인 모델정보 및 시각지능 모델의 추론결과에 대한 설 명 도출 방법에 대한 정보인 방법정보를 입력받는 단계; 및 모델정보와 방법정보를 기초로, 시각 데이터가 입력 된 시각지능 모델의 추론결과에 대한 설명을 도출하는 단계;를 포함한다. 본 발명의 일 실시예에 따른 시각지능 모델 추론결과 설명 도출 시스템은, 시각지능 모델에 대한 정보인 모델정 보 및 시각지능 모델의 추론결과에 대한 설명 도출 방법에 대한 정보인 방법정보를 입력받는 입력부; 모델정보 와 방법정보를 기초로, 시각 데이터가 입력된 시각지능 모델의 추론결과에 대한 설명을 도출하는 도출부; 및 도 출부에 의해 도출된 설명을 기초로 시각 데이터를 가공하는 가공부;를 포함한다. 본 발명의 일 실시예에 따른 시각지능 모델 추론결과 설명 도출 방법은, 시각지능 모델에 대한 정보인 모델정보 를 입력받는 단계; 시각지능 모델의 추론결과에 대한 설명 도출 방법에 대한 정보인 방법정보를 입력받는 단계; 모델정보와 방법정보를 기초로, 시각 데이터가 입력된 시각지능 모델의 추론결과에 대한 설명을 도출하는 단계; 및 도출된 설명을 기초로 시각 데이터를 가공하는 단계;를 포함한다."}
{"patent_id": "10-2022-0123857", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상 설명한 바와 같이, 본 발명의 실시예들에 따르면, 시각지능 모델에 대한 정보와 시각지능 모델의 추론결과 에 대한 설명 도출 방법을 사용자로부터 입력받아 이로부터 다양한 시각지능 모델의 추론결과에 대한 설명을 자 동으로 도출할 수 있게 된다.또한 본 발명의 실시예들에 따르면, 사용자가 손쉽게 추론결과에 대한 설명을 제공받을 수 있게 되고, 이를 기 반으로 시각지능 모델의 신뢰도를 향상시킬 수 있게 되며, 나아가 시각 지능모델의 개선/고도화 방향 설정에 도 움을 줄 수 있게 된다."}
{"patent_id": "10-2022-0123857", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명을 보다 상세하게 설명한다. 본 발명의 실시예에서는 다양한 시각지능 모델에 대해 추론결과에 관한 설명을 도출할 수 있는 방법 및 시스템 을 제시한다. 본 발명의 실시예에서 사용자는 추론결과에 대한 설명 도출 방법을 알고 있지 못하여도 된다. 단 사용자는 시각지능 모델에 대한 정보와 추론결과에 대한 설명 도출 방법에 대한 정보만을 입력하여 주면 되 는데, 나아가 관련된 일부 내용을 알고 있지 못해 입력하지 못해도 무방하다. 이를 통해 사용자가 전문 지식이 없어도 다양한 시각지능 모델에 대해 추론결과에 대한 설명을 제공받을 수 있 게 된다. 1. 시각지능 모델 추론결과 설명 도출 시스템 도 1은 본 발명의 일 실시예에 따른 시각지능 모델 추론결과 설명 도출 시스템의 구성을 도시한 도면이다. 본 발명의 실시예에 따른 시각지능 모델 추론결과 설명 도출 시스템은, 도시된 바와 같이 모델/데이터 입력부 , 모델정보/방법정보 입력부, 추론결과 설명 도출부 및 데이터 가공부 및 저장부를 포함하여 구성된다. 모델/데이터 입력부는 시각지능 모델과 시각 데이터를 입력받는다. 엄밀하게 모델/데이터 입력부로 입력되는 시각지능 모델은 시각지능 모델의 구조와 파라미터를 의미하는데, 편의상 이와 같이 표기하기로 한다. 시각지능 모델에 대해서는 어떠한 제한 없어, 모든 시각지능 모델이 대상이 될 수 있다. 시각 데이터에 대해서 도 제한 없이 이미지, 비디오 모두 대상이 될 수 있다. 모델정보/방법정보 입력부는 모델정보과 방법정보를 사용자로부터 입력받는 사용자 인터페이스 수단이다. 모델정보는 모델/데이터 입력부를 통해 입력되는 시각지능 모델에 관한 정보이다. 방법정보는 시각지능 모 델의 추론결과에 대한 설명을 도출하는 방법에 관한 정보이다. 추론결과 설명 도출부는 모델/데이터 입력부를 통해 입력되는 시각 데이터에 대한 시각지능 모델의 추론결과, 즉 시각 데이터가 시각지능 모델로 입력되는 경우에 시각지능 모델에서 출력되는 추론결과에 대한 설 명을 도출한다. 추론결과에 대한 설명이란 시각지능 모델에서 왜 그러한 추론결과가 출력되었는지를 사용자가 유추할 수 있도록 하여 주는 근거가 되는 정보를 말한다. 추론결과 설명 도출부에 의한 추론결과에 대한 설명 도출은 모델정보/방법정보 입력부에 의해 사용자 가 입력한 모델정보과 방법정보를 기초로 이루어진다. 데이터 가공부는 추론결과 설명 도출부에 의해 도출된 설명을 기초로 모델/데이터 입력부를 통 해 입력되는 시각 데이터를 가공한다. 가공된 시각 데이터는 저장부에 저장되어 학습 데이터나 다른 용도로 이용될 수 있다. 2. 모델정보/방법정보 모델정보/방법정보 입력부를 통해 사용자로부터 입력받는 모델정보는 다음과 같다. 11) 시각 데이터 : 이미지 데이터, 비디오 데이터, None 12) 시각지능 모델의 목적 : 인지, 검출, 추적, 분할, None 13) 시각지능 모델의 명칭 : Rsenet, VGG, EfficientNet, FasterRCNN, None 14) 시각지능 모델의 목적의 대상 : 목적의 대상에 대한 클래스 정보, ex) 157(dog), 293(person), None 15) 시각지능 모델의 구조 변경 여부 : Yes(변경한 경우), No(변경하지 않은 경우) → '13)'에서 주어진 명칭의 모델에 대해 사용자가 모델의 구조를 변경하였는지 여부 위에서 'None'은 사용자가 입력하지 않은 경우를 말한다. 사용자는 해당 정보를 모르는 경우에는 'None'을 입력 하면 된다. 모델정보/방법정보 입력부를 통해 사용자로부터 입력받는 방법정보는 다음과 같다. 21) 설명 도출 방법 : Perturbation 기반 설명 도출 방법, 시각지능 모델의 중간정보(Activation 정보, Gradient 정보)를 활용한 설명 도출 방법 22) 시각지능 모델의 입력 데이터에 대한 전처리 조건 : 시각 데이터에 대한 transformation 정보, None 23) 시각지능 모델의 중간정보 추출 가능 여부 : Yes(추출 가능한 경우), No(추출이 불가능한 경우) → '21)'에 서 중간정보를 활용한 설명 도출 방법이 선택된 경우, 시각지능 모델에서 중간정보 추출이 가능한지 여부를 나 타냄 24) 중간정보를 추출할 타겟 레이어 : conv4, None 25) 설명 도출 도구(tool) : gradcam, gradcam++, scorecam, eigencam, None 위에서도 'None'은 사용자가 입력하지 않은 경우를 말한다. 사용자는 해당 정보를 모르는 경우 'None'을 입력하 면 된다. 3. 추론결과 설명 도출 도 2는 추론결과 설명 도출부의 상세 블럭도이다. 도시된 바와 같이 추론결과 설명 도출부는 Perturbation 기반 설명 도출부 및 모델 중간정보 활용 설명 도출부를 포함하여 구성된다. 모델정보/방법정보 입력부를 통해 사용자가 '21) 설명 도출 방법'으로 'Perturbation 기반 설명 도출 방법'을 선택한 경우에는 Perturbation 기반 설명 도출부가 추론결과에 대한 설명을 도출한다. 반면 모델 정보/방법정보 입력부를 통해 사용자가 '21) 설명 도출 방법'으로 '시각지능 모델의 중간정보를 활용한 설 명 도출 방법'을 선택한 경우에는 모델 중간정보 활용 설명 도출부가 추론결과에 대한 설명을 도출한다. Perturbation 기반 설명 도출부에 의한 추론결과 설명 도출 과정을 도 3에 상세히 도시하였다. 추론결과에 대한 설명 도출을 위해, 도시된 바와 같이 먼저 Perturbation 기반 설명 도출부는 모델/데이터 입력부를 통해 입력되는 시각 데이터를 랜덤 마스킹하여 다수의 마스킹된 시각 데이터들을 생성한다 (S210). 도 3의 좌측 상부에 랜덤 마스킹 결과를 예시하였다. 랜덤 마스크 생성 방식에 대해서는 제한이 없다. 다음 Perturbation 기반 설명 도출부는 생성한 마스킹된 시각 데이터들을 시각지능 모델에 각각 입력하여 추론결과들을 생성한다(S220). S220단계에서 생성되는 추론결과들에는 추론결과들에 대한 정확도 정보가 포함된 다. 그리고 Perturbation 기반 설명 도출부는 생성된 추론결과들을 기초로 랜덤 마스킹에 활용된 마스크들의 가중치들을 설정한다(S230).구체적으로 Perturbation 기반 설명 도출부는 추론결과의 정확도가 낮게 나온 마스킹된 시각 데이터에 적 용된 마스크에 대해서는 가중치를 높게 설정한다. 추론결과의 정확도가 낮다면 마스크에 의해 가려진 부분이 추 론결과에 주요한 영향을 미치는 부분으로 볼 수 있기 때문이다. 반면 추론결과의 정확도가 높게 나온 마스킹된 시각 데이터에 적용된 마스크에 대해서는 가중치를 낮게 설정한 다. 추론결과의 정확도가 높다면 마스크에 의해 가려진 부분이 추론결과에 주요한 영향을 미치는 부분으로 볼 수 없기 때문이다. 한편 설정된 가중치들에 대해서는 사용자가 설정한 조건에 따라 변형이 가능하도록 구현할 수도 있다. 다음 Perturbation 기반 설명 도출부는 S230단계에서 설정된 가중치들을 랜덤 마스크들에 적용하여 융합함 으로써, 추론결과에 대한 설명을 도출한다(S240). 이 과정은 아래의 수식으로 나타낼 수 있다."}
{"patent_id": "10-2022-0123857", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "위 수식에서 S는 추론결과에 대한 설명, N은 랜덤 마스크의 총 개수, α'은 가중치, M은 랜덤 마스크이다. 이후 Perturbation 기반 설명 도출부는 S240단계의 도출 결과를 시각 데이터에 결합하여 사용자에게 제공 한다(S250). 도 3의 우측 하부에 도시된 바와 같이 추론결과에 대한 설명 정보는 saliency 정보로 제공할 수 있 다. 모델 중간정보 활용 설명 도출부에 의한 추론결과 설명 도출 과정을 도 4에 상세히 도시하였다. 추론결과에 대한 설명 도출을 위해, 도시된 바와 같이 먼저 모델 중간정보 활용 설명 도출부는 모델/데이 터 입력부를 통해 입력되는 시각 데이터를 시각지능 모델에 입력하여 추론결과가 생성되는 과정에서, 중간 정보를 추출한다(S310). 모델/데이터 입력부를 통해 사용자가 '23) 시각지능 모델의 중간정보 추출 가능 여부'를 'Yes'로 지정하고, '24) 중간정보를 추출할 타겟 레이어'를 지정(예를 들어, conv4)한 경우, S310단계에서 모델 중간정 보 활용 설명 도출부는 지정된 타겟 레이어에서 중간정보를 추출한다. 추출하는 중간정보는 타겟 레이어의 Activation 정보, Gradient 정보일 수 있다. 한편, '23) 시각지능 모델의 중간정보 추출 가능 여부'를 'Yes'로 지정하였지만, '24) 중간정보를 추출할 타겟 레이어'가 'None'으로 지정된 경우, '23) 시각지능 모델의 명칭'에 해당 시각지능 모델의 명칭(예를 들어, Rsenet)이 지정되어 있다면, 모델 중간정보 활용 설명 도출부는 지식 검색을 통해 해당 시각지능 모델의 타겟 레이어를 파악하는 것도 가능하다. 지식 검색은 지식 DB나 웹을 통해 가능하다. 만약 '23) 시각지능 모델의 중간정보 추출 가능 여부'가 'No'로 지정되어 있다면, 모델 중간정보 활용 설명 도 출부는 '11) 시각 데이터', '12) 시각지능 모델의 목적', '13) 시각지능 모델의 명칭', '14) 시각지능 모 델의 목적의 대상' 등을 기초로 타겟 레이어를 예측하고 그로부터 중간정보를 추출하며, 시각지능 모델의 최종 단에서 추론결과와 함께 출력되는 정확도 정보도 중간정보로 추출할 수 있다. 다음 모델 중간정보 활용 설명 도출부는 모델/데이터 입력부를 통해 입력되는 '25) 설명 도출 도구 (예를 들면, gradcam++)'를 이용하여 S310단계에서 추출된 중간 정보로부터 추론결과에 대한 설명을 도출한다 (S320). 이후 모델 중간정보 활용 설명 도출부는 S320단계의 도출 결과를 시각 데이터에 결합하여 사용자에게 제공 한다(S330). 도 4의 우측 하부에 도시된 바와 같이 추론결과에 대한 설명 정보는 saliency 맵으로 제공할 수 있 다. 4. 데이터 가공 데이터 가공부는 추론결과 설명 도출부에서 도출된 추론결과에 대한 설명을 기초로 모델/데이터 입력 부를 통해 입력되는 시각 데이터를 가공한다. 데이터 가공부에 의한 시각 데이터의 가공 여부는 모델정보/방법정보 입력부를 통해 사용자가 설정할 수 있다. 즉 사용자가 설정한 경우에만, 데이터 가공부가 기능하도록 구현할 수 있다.데이터 가공부에 의한 시각 데이터 가공 과정을 도 5에 상세히 도시하였다. 도시된 바와 같이, 데이터 가공부는 추론결과에 대한 설명 정보로써 제공되는 saliency 맵을 기반으로 객 체 검출에 활용되는 BB(Bounding Box)를 객체별로 생성하여 시각 데이터에 부가함으로써 객체 검출 모델에 활용 가능한 학습 데이터를 생성할 수 있다. 또한 데이터 가공부는 saliency 맵을 기반으로 객체별/의미별로 영역 마스크를 도출하여, semantic segmentation 모델에 활용 가능한 학습 데이터를 생성할 수 있다. 5. 시각지능 모델 추론결과 설명 도출 방법 도 6은 본 발명의 다른 실시예에 따른 시각지능 모델 추론결과 설명 도출 방법의 설명에 제공되는 흐름도이다. 추론결과 설명 도출을 위해, 먼저 모델정보/방법정보 입력부는 사용자로부터, 시각지능 모델에 관한 정보 를 입력받고(S410), 시각지능 모델의 추론결과에 대한 설명을 도출하는 방법에 관한 정보를 입력받는다(S420). 그리고 모델/데이터 입력부는 시각지능 모델과 시각 데이터를 입력받는다(S430). 그러면 추론결과 설명 도출부는 S410단계와 S420단계를 통해 입력되는 모델정보와 방법정보를 기초로, S430단계를 통해 입력되는 시각 데이터에 대한 시각지능 모델의 추론결과에 대한 설명을 도출한다(S440 내지 S460). 구체적으로 S410단계에서 '21) 설명 도출 방법'이 'Perturbation 기반 설명 도출 방법'으로 설정된 경우(S440- Perturbation), 추론결과 설명 도출부는 해당 방법에 따라 시각지능 모델의 추론결과에 대한 설명을 도출 한다(S450). 반면 S410단계에서 '21) 설명 도출 방법'이 '시각지능 모델의 중간정보를 활용한 설명 도출 방법'으로 설정된 경우(S440-중간정보), 추론결과 설명 도출부는 해당 방법에 따라 시각지능 모델의 추론결과에 대한 설명을 도출한다(S460). 한편 데이터 가공부는 S450단계 또는 S460단계에서 도출된 설명을 기초로 S430단계를 통해 입력되는 시각 데이터를 가공한다(S470). S470단계는 사용자가 데이터 가공을 원하는 경우에만 선택적으로 수행된다. S470단계에서 가공된 시각 데이터는 저장부에 저장되어, 향후 다른 시각지능 모델의 학습 데이터로 활용된 다(S480). 6. 변형예 지금까지 시각지능 모델의 추론결과 설명 도출 방법 및 시스템에 대해 바람직한 실시예를 들어 상세히 설명하였 다. 본 발명의 실시예들에서는 시각지능 모델에 대한 정보와 시각지능 모델의 추론결과에 대한 설명 도출 방법을 사 용자로부터 입력받아, 이로부터 다양한 시각지능 모델의 추론결과에 대한 설명을 자동으로 도출하는 방법 및 시 스템을 제시하였다. 본 발명의 실시예들에 따르면, 사용자가 손쉽게 추론결과에 대한 설명을 제공받을 수 있게 되고, 이를 기반으로 시각지능 모델의 신뢰도를 향상시킬 수 있게 되며, 시각 지능모델의 개선/고도화 방향 설정에 도움을 줄 수 있 게 된다. 한편, 본 실시예에 따른 장치와 방법의 기능을 수행하게 하는 컴퓨터 프로그램을 수록한 컴퓨터로 읽을 수 있는 기록매체에도 본 발명의 기술적 사상이 적용될 수 있음은 물론이다. 또한, 본 발명의 다양한 실시예에 따른 기 술적 사상은 컴퓨터로 읽을 수 있는 기록매체에 기록된 컴퓨터로 읽을 수 있는 코드 형태로 구현될 수도 있다. 컴퓨터로 읽을 수 있는 기록매체는 컴퓨터에 의해 읽을 수 있고 데이터를 저장할 수 있는 어떤 데이터 저장 장 치이더라도 가능하다. 예를 들어, 컴퓨터로 읽을 수 있는 기록매체는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광디스크, 하드 디스크 드라이브, 등이 될 수 있음은 물론이다. 또한, 컴퓨터로 읽을 수 있는 기록매체 에 저장된 컴퓨터로 읽을 수 있는 코드 또는 프로그램은 컴퓨터간에 연결된 네트워크를 통해 전송될 수도 있다."}
{"patent_id": "10-2022-0123857", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "또한, 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2022-0123857", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 시각지능 모델 추론결과 설명 도출 시스템의 구성을 도시한 도면, 도 2는 추론결과 설명 도출부의 상세 블럭도, 도 3은 Perturbation 기반 설명 도출 과정의 설명에 제공되는 흐름도, 도 4는 시각지능 모델의 중간정보를 활용한 설명 도출 과정의 설명에 제공되는 흐름도, 도 5는 시각 데이터 가공 과정의 설명에 제공되는 도면, 도 6은 본 발명의 다른 실시예에 따른 시각지능 모델 추론결과 설명 도출 방법의 설명에 제공되는 흐름도이다."}
