{"patent_id": "10-2017-0111740", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0025278", "출원번호": "10-2017-0111740", "발명의 명칭": "전자 커버, 이를 포함하는 전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "이나경"}}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 커버에 있어서,광 투과성 제 1 전극 레이어;상기 제 1 전극 레이어 아래에 배치되는 광 투과성 제 2 전극 레이어;상기 제 1 전극 레이어 및 제 2 전극 레이어 사이에 배치되고, 상기 제 1 전극 레이어 및 제 2 전극 레이어에전력이 제공될 때 발생된 전기장에 반응하는 액정을 포함하는 액정 레이어;상기 제 2 전극 레이어 아래에 배치되고, 광 투과성 색상 물질을 포함하는 색상 레이어; 및상기 색상 레이어 아래에 배치되고, 광 반사 물질을 포함하는 반사 레이어를 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 색상 레이어는,줄 구조(striped structure)로 배치되는 다수의 색상 필터들을 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 다수의 색상 필터들은,동일한 색상의 광 투과성 물질을 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 색상 레이어는,서로 다른 색상의 적어도 둘 이상의 색상 필터들을 포함하는 일련의 세트가 반복 배열되는 구조를 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 제 2 전극 레이어는,상기 다수의 색상 필터들에 정렬되고, 상기 줄 구조로 배치되는 다수의 전극들을 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2019-0025278-3-제 5 항에 있어서,상기 제 1 전극 레이어는,상기 다수의 전극들을 커버하도록 연장된 공통 전극(common electrode)을 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 공통 전극 및 다수의 전극들에 전기적으로 연결되고, 상기 공통 전극 및 다수의 전극들에 제공되는 전력의세기를 조절하기 위한 다수의 스위치들을 더 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 스위치들은,TFTs(thin film transistors)을 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 5 항에 있어서,상기 액정은,상기 다수의 전극들에 정렬된 다수의 부분들로 분리되어 있는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 제 2 전극 레이어 및 색상 레이어 사이에 배치되는 광 투과성 레이어를 더 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 제 1 전극 레이어 위에 배치되는 광 투과성 레이어를 더 포함하는 전자 커버."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전자 장치에 있어서,제 1 방향으로 향하는 제 1 면, 제 1 방향의 반대인 제 2 방향으로 향하는 제 2 면, 및 상기 제 1 면 및 제 2면을 연결하는 제 3 면을 포함하는 하우징;상기 하우징 내부에 배치되고, 상기 제 1 면 및 제 3 면의 적어도 일부를 따라 배치되는 디스플레이;상기 하우징 내부에 배치되고, 상기 제 2 면의 적어도 일부를 따라 배치되는 전자 커버; 및상기 디스플레이 및 전자 커버에 전기적으로 연결되는 전력 관리 모듈을 포함하고,상기 전자 커버는,공개특허 10-2019-0025278-4-상기 제 1 면 및 제 2 면 사이에 배치되는 광 투과성 제 1 전극 레이어;상기 제 1 면 및 제 1 전극 레이어 사이에 배치되는 광 투과성 제 2 전극 레이어;상기 제 1 전극 레이어 및 제 2 전극 레이어 사이에 배치되고, 상기 전력 관리 모듈이 상기 제 1 전극 레이어및 제 2 전극 레이어로 전력을 공급할 때 발생된 전기장에 반응하는 액정을 포함하는 액정 레이어;상기 제 1 면 및 제 2 전극 레이어 사이에 배치되고, 광 투과성 색상 물질을 포함하는 색상 레이어; 및상기 제 1 면 및 색상 레이어 사이에 배치되고, 광 반사 물질을 포함하는 반사 레이어를 포함하는 전자 장치."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 색상 레이어는,줄 구조(striped structure)로 배치되는 다수의 색상 필터들을 포함하는 전자 장치."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 제 2 전극 레이어는, 상기 다수의 색상 필터들에 정렬되고, 상기 줄 구조로 배치되는 다수의 전극들을 포함하고,상기 제 1 전극 레이어는, 상기 다수의 전극들을 커버하도록 연장된 공통 전극인 전자 장치."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 공통 전극 및 다수의 전극들에 전기적으로 연결되고, 상기 공통 전극 및 다수의 전극들에 제공되는 전력을조절하기 위한 다수의 스위치들을 더 포함하고,상기 스위치들은,상기 전력 관리 모듈에 포함되거나, 상기 전자 커버에 포함되는 전자 장치."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 스위치들은,상기 전자 커버에 포함되는 TFTs(thin film transistors)인 전자 장치."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15 항에 있어서,상기 액정은,상기 다수의 전극들에 정렬된 다수의 부분들로 분리되어 있는 전자 장치.공개특허 10-2019-0025278-5-청구항 18 제 14 항에 있어서,상기 디스플레이, 전자 커버 및 전력 관리 모듈에 전기적으로 연결되는 프로세서를 더 포함하고,상기 프로세서는,사용자 입력, 어플리케이션의 실행, 또는 설정된 트리거에 적어도 일부 기반하여, 상기 다수의 전극들 중 적어도 일부에 공급하는 전력을 조절하도록 상기 전력 관리 모듈을 제어하는 전자 장치."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "다수의 영역들 가지는 전자 커버를 포함하는 전자 장치의 동작 방법에 있어서,사용자 입력, 어플리케이션의 실행, 또는 설정된 트리거에 적어도 일부 기반하여 표현 모드를 선택하는 동작;및상기 선택된 표현 모드에 따라 상기 다수의 영역들 중 적어도 일부 영역에 대한 광 투과율을 조절하는 동작을포함하는 방법."}
{"patent_id": "10-2017-0111740", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서,상기 적어도 일부 영역에 대한 광 투과율을 조절하는 동작은,상기 적어도 일부 영역에서 발생되는 전기장 세기를 조절하는 동작을 포함하는 방법."}
{"patent_id": "10-2017-0111740", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 전자 커버는, 광 투과성 제 1 전극 레이어와, 상기 제 1 전극 레이어 아래에 배치 되는 광 투과성 제 2 전극 레이어와, 상기 제 1 전극 레이어 및 제 2 전극 레이어 사이에 배치되고, 상기 제 1 전극 레이어 및 제 2 전극 레이어에 전력이 제공될 때 발생된 전기장에 반응하는 액정을 포함하는 액정 레이어와, 상기 제 2 전극 레이어 아래에 배치되고, 광 투과성 색상 물질을 포함하는 색상 레이어, 및 상기 색상 레이어 아래에 배치되고, 광 반사 물질을 포함하는 반사 레이어를 포함할 수 있다. 이외에도 다양한 다른 실시 예들이 가능하다."}
{"patent_id": "10-2017-0111740", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 전자 장치 외관을 형성하는 전자 커버, 이를 포함하는 전자 장치 및 그 제어 방 법에 관한 것이다."}
{"patent_id": "10-2017-0111740", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 디지털 기술의 발달과 함께 스마트 폰(smart phone), 태블릿 PC(tablet personal computer), PDA(personal digital assistant) 등과 같은 다양한 형태로 제공되고 있다. 전자 장치는 이동성(portability) 및 사용자의 접근성(accessibility)을 향상시킬 수 있도록 사용자에 착용할 수 있는 형태로도 개발되고 있다. 전자 장치는 외관을 형성하는 커버를 포함할 수 있다. 전자 장치는 서로 다른 표현(예: 색상)을 나타내는 커버 로 구분되는 다양한 모델로 제공될 수 있다."}
{"patent_id": "10-2017-0111740", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "사용자는 취향에 따른 커버를 가지는 전자 장치를 선택적으로 구매할 수 있다. 하지만, 해당 모델의 전자 장치 를 사용하는 동안, 사용자는 커버를 통하여 정해진 표현만을 경험할 수 있을 뿐이다. 또한, 제조사는 서로 다른 커버로 구분되는 다양한 모델의 전자 장치를 제공하여야 하는 부담을 가질 수 있다. 본 발명의 다양한 실시 예는 색상, 농도, 깊이감, 패턴 등의 다양한 표현이 가능한 전자 커버 및 이를 포함하는 전자 장치를 제공할 수 있다.본 발명의 다양한 실시 예는 전자 커버를 포함하는 전자 장치에서 사용자의 선호도에 따라 상기 전자 커버를 통 한 표현을 제어하는 방법을 제공할 수 있다."}
{"patent_id": "10-2017-0111740", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 전자 커버는, 광 투과성 제 1 전극 레이어와, 상기 제 1 전극 레이어 아래에 배치 되는 광 투과성 제 2 전극 레이어와, 상기 제 1 전극 레이어 및 제 2 전극 레이어 사이에 배치되고, 상기 제 1 전극 레이어 및 제 2 전극 레이어에 전력이 제공될 때 발생된 전기장에 반응하는 액정을 포함하는 액정 레이어 와, 상기 제 2 전극 레이어 아래에 배치되고, 광 투과성 색상 물질을 포함하는 색상 레이어, 및 상기 색상 레이 어 아래에 배치되고, 광 반사 물질을 포함하는 반사 레이어를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는, 제 1 방향으로 향하는 제 1 면, 제 1 방향의 반대인 제 2 방 향으로 향하는 제 2 면, 및 상기 제 1 면 및 제 2 면을 연결하는 제 3 면을 포함하는 하우징과, 상기 하우징 내 부에 배치되고, 상기 제 1 면 및 제 3 면의 적어도 일부를 따라 배치되는 디스플레이와, 상기 하우징 내부에 배 치되고, 상기 제 2 면의 적어도 일부를 따라 배치되는 전자 커버, 및 상기 디스플레이 및 전자 커버에 전기적으 로 연결되는 전력 관리 모듈을 포함하고, 상기 전자 커버는 상기 제 1 면 및 제 2 면 사이에 배치되는 광 투과 성 제 1 전극 레이어와,상기 제 1 면 및 제 1 전극 레이어 사이에 배치되는 광 투과성 제 2 전극 레이어와, 상 기 제 1 전극 레이어 및 제 2 전극 레이어 사이에 배치되고, 상기 전력 관리 모듈이 상기 제 1 전극 레이어 및 제 2 전극 레이어로 전력을 공급할 때 발생된 전기장에 반응하는 액정을 포함하는 액정 레이어와, 상기 제 1 면 및 제 2 전극 레이어 사이에 배치되고, 광 투과성 색상 물질을 포함하는 색상 레이어, 및 상기 제 1 면 및 색상 레이어 사이에 배치되고, 광 반사 물질을 포함하는 반사 레이어를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 다수의 영역들 가지는 전자 커버를 포함하는 전자 장치의 동작 방법은, 사 용자 입력, 어플리케이션의 실행, 또는 설정된 트리거에 적어도 일부 기반하여 표현 모드를 선택하는 동작, 및 상기 선택된 표현 모드에 따라 상기 다수의 영역들 중 적어도 일부 영역에 대한 광 투과율을 조절하는 동작을 포함할 수 있다."}
{"patent_id": "10-2017-0111740", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 전자 장치는 전자 커버를 통하여 다양한 표현을 사용자가 경험하도록 하여 전자 장치에 대한 만족도 및 사용성을 개선할 수 있다. 또한, 본 발명의 일 실시 예에 따른 전자 장치는 사용자 선호 도에 따른 표현을 전자 커버를 통하여 제공할 수 있으므로, 커버로 구분되는 다양한 모델로 제공되는 종래와 비 교하여, 그 제작 비용을 절감할 수 있다."}
{"patent_id": "10-2017-0111740", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예들이 첨부된 도면을 참조하여 기재된다. 실시 예 및 이에 사용된 용어들은 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 및/또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성 요소에 대해서는 유 사한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함 할 수 있다. 본 문서에서, \"A 또는 B\" 또는 \"A 및/또는 B 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 해당 구성 요소들을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성 요소를 다른 구성 요소와 구분하기 위해 사용될 뿐 해당 구성 요소들을 한정하지 않는다. 어떤(예: 제 1) 구성 요소가 다른(예: 제 2) 구성 요소에 \"(기능적으로 또는 통신적으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요소가 상기 다른 구성 요 소에 직접적으로 연결되거나, 다른 구성 요소(예: 제 3 구성 요소)를 통하여 연결될 수 있다. 본 문서에서, \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, 하드웨어적 또는 소프 트웨어적으로 \"~에 적합한,\" \"~하는 능력을 가지는,\" \"~하도록 변경된,\" \"~하도록 만들어진,\" \"~를 할 수 있 는,\" 또는 \"~하도록 설계된\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로 세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형의 장치가 될 수 있다. 전자 장치는, 예를 들 면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어 러블 장치, 또는 가전 장치 중 적어도 하나를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 다양한 실시 예에서, 웨어러블 전자 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌 즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형 (예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전 자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코 더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는, 각종 의료 기기(예: 각종 휴대용 의료 측정 기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도 조절 기, 가로등, 토스터, 운동 기구, 온수 탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예 에 따르면, 전자 장치는 가구, 건물/구조물 또는 자동차의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터, 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예들에서, 전자 장치는 플렉서블(flexibl e)하거나, 또는 전술한 다양한 장치들 중 둘 이상의 조합일 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전 술한 기기들에 한정되지 않는다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다.일 실시 예에 따르면, 전자 장치는 외관의 적어도 일부를 형성하는 전자 커버(electronic cover)(또는, 디지털 커버(digital cover))를 포함할 수 있다. 외부 광이 전자 커버에 반사되어 사용자의 눈에 들어올 때, 전자 커버 에 의한 표현(representation)이 사용자에게 보일 수 있다. 일 실시 예에 따르면, 전자 커버는 적어도 하나의 색상을 가지는 하위 레이어(bottom layer)를 포함하고, 외부 광은 하위 레이어에서 반사되어 외부로 방출될 수 있다. 일 실시 예에 따르면, 하위 레이어는 다수의 영역들을 포함하고, 영역별로 색상을 가질 수 있다. 일 실시 예에 따르면, 전자 커버는, 반사 광이 외부로 통과되는 양을 조절하기 위한 상위 레이어(top layer)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치가 전자 커버를 전기적으로 제어하면, 상위 레이어의 다수의 영역들에 대한 광 투과율이 선택적으로 조절될 수 있다. 상위 레이어의 영역들에 대한 광 투과율이 개별적으로 조절됨으로써, 전자 커버의 다양한 표현(예: 색상, 농도, 깊이감, 패턴 등)이 사용자에게 보일 수 있다. 도 1a 및 1b는 일 실시 예에 따른 전자 장치에 포함된 전자 커버의 단면도를 도시한다. 도 1c는 다양한 실시 예 에 따른 전자 커버의 일부 레이어를 도시한다. 도 1a 및 1b를 참조하면, 전자 커버는 양쪽 면들(예: 제 1 면 및 제 2 면)을 포함하는 플레이 트 형태일 수 있다. 일 실시 예에 따르면, 제 1 면 및 제 2 면은 실질적으로 평행일 수 있고, 전자 커버는 대체적으로 일정한 두께를 가질 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 전자 커버 의 적어도 일 부분은 다른 부분과 다른 두께를 가지도록 설계될 수도 있다. 도시하지 않았으나, 전자 장치 의 외관 설계에 따라, 전자 커버는 곡형 등의 다양한 형태로 형성될 수 있다. 일 실시 예에 따르면, 전자 커버가 전자 장치에 결합되면, 제 1 면은 전자 장치의 외면을 형성하고, 제 2 면은 전자 장치의 내부에 배치될 수 있다. 전자 커버는 제 1 면 및 제 2 면 사이 에 배치되는 다수의 레어어들을 포함할 수 있다. 이하, 도 1a 및 1b에서, 예를 들어, A 요소, B 요소 및 C 요소 가 제 1 면에서 제 2 면으로 향하는 방향(이하, 내부 방향)으로 순서대로 배치될 때, 'A 요 소는 B 요소의 위에 배치되고, C 요소는 B 요소의 아래에 배치된다'고 정의할 수 있다. 일 실시 예에 따르면, 전자 커버는 전기적 제어에 의해 광 투과율을 조절하도록 설계된 제 1 레이어 를 포함할 수 있다. 제 1 레이어는, 전자 커버의 각 영역에 대하여, 외부 광이 전자 커버로 유 입되는 양 또는 전자 커버로부터 반사된 광이 외부로 방출되는 양을 조절할 수 있다. 일 실시 예에 따르면, 제 1 레이어는 제 1 전극 레이어(electrode layer), 제 2 전극 레이어 및 액정 레이어를 포함할 수 있다. 제 1 전극 레이어는 제 2 전극 레이어 위에 배치되고, 액정 레이어는 제 1 전극 레이어 및 제 2 전극 레이어 사이에 배치될 수 있다. 제 1 전극 레이어 또는 제 2 전극 레이어는 광 투과성(예: 약 30 % 이상의 광 투과율) 금속 물질을 포함할 수 있다. 일 실시 예에 따르면, 제 1 전극 레이어 또는 제 2 전극 레이어는 ITO(indium tin oxide), ATO(antimony tin oxide) 등일 수 있다. 액정 레이어는, 전기적 제어에 의하여 광 투과율이 조절되는 액정 (liquid crystal)(113a)을 포함할 수 있다. 액정(113a)은 유전율 이방성 및 굴절률 이방성을 가지는 다양한 물 질을 포함할 수 있다. 일 실시 예에 따르면, 액정 레이어는 폴리머(113b)에 액정(113a)이 배열된 액정 폴 리머(LCP(liquid crystal polymer))일 수 있다. 다양한 실시 예에 따르면, 제 1 전극 레이어 또는 제 2 전극 레이어는 증착 등의 다양한 방식으로 액정 레이어에 결합될 수 있다. 도시하지 않았으나, 제 1 레이어는 전자 커버를 전기적으로 제어하기 위한 회로(이하, 커버 제어 회 로)에 전기적으로 연결될 수 있다. 커버 제어 회로는 제 1 및 2 전극 레이어들(111, 112)에 전기적으로 연결되 고, 제 1 및 2 전극 레이어들(111, 112)로 공급되는 전력(예: 전압 또는 전류)을 조절할 수 있다. 예를 들어, 도 1a은 제 1 및 2 전극 레이어들(111, 112)에 전압을 인가하지 않은 상태를 도시한다. 제 1 및 2 전극 레이어 들(111, 112)에 전압이 인가되지 않으면, 액정(113a)은 그 자리에 고정되어 있지만, 자유롭게 배열되는 상태에 있을 수 있다. 도 1b는 제 1 및 2 전극 레이어들(111, 112)에 전압이 인가된 상태를 도시한다. 제 1 및 2 전극 레이어들(111, 112)에 전압이 인가되면, 전기장(electrical field)이 발생될 수 있다. 제 1 및 2 전극 레이어들 (111, 112)에 의한 전기장으로 인하여, 액정(113a)의 분자(유전체)는 전기장의 방향에 따라 규칙적으로 정렬 및 배열될 수 있다 (예: 유전 분극). 액정(113a)의 유전 분극으로 인하여, 액정 레이어의 광 투과율은 도 1a 의 상태와 비교하여 증가될 수 있다. 예를 들어, 도 1a의 액정 레이어는 대체적으로 불투명한(opaque) 상 태에 있다고 정의될 수 있다. 액정 레이어의 광 투과율은, 제 1 및 2 전극 레이어들(111, 112)에 공급되는 전압의 세기(또는, 제 1 및 2 전극 레이어들(111, 112) 사이에 발생된 전기장의 세기)에 따라 변경될 수 있다. 일 실시 예에 따르면, 제 1 레이어는 PDLC(polymer-dispersed liquid crystal)를 포함할 수 있다.다양한 실시 예에 따르면, 도시하지 않았으나, 제 1 레이어는 분극입자배향 원리를 기초로 하는 분극입자 (suspended particle)를 포함하는 구조로 대체될 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 1 레이어는 전하 이동 원리를 기초로 하는 일렉트로크로믹(electrohromic) 요소를 포함하는 구조로 대체될 수 있다. 이 밖에, 제 1 레이어는 전기적 제어에 의해 광 투과율을 조절 가능한 다양한 구조로 설계될 수 있다. 일 실시 예에 따르면, 커버 제어 회로의 적어도 일부는 전자 커버에 포함될 수 있다. 다양한 실시 예에 따 르면, 커버 제어 회로의 적어도 일부는, 전자 커버가 결합되는 전자 장치에 포함될 수도 있다. 전자 커버는 제 1 레이어 아래에 배치되는 제 2 레이어를 포함할 수 있다. 일 실시 예에 따르면, 제 2 레이어는 색상 레이어를 포함할 수 있다. 색상 레이어는 색상(예: red, green, blue 등)을 포함하는 광 투과성 물질을 포함할 수 있다. 일 실시 예에 따르면, 제 2 레이어는 색상 레이어 (또는, 색상 필터) 아래에 배치되는 반사 레이어(또는, 반사 필름)를 포함할 수 있다. 외부 광은 반 사 레이어에 반사되고, 반사된 광은 색상 레이어 및 제 1 레이어를 거쳐 외부로 방출될 수 있다. 일 실시 예에 따르면, 제 1 레이어의 적어도 일부분의 광 투과율이 조절될 때, 전자 커버를 통 한 색상, 농도, 깊이감, 패턴 등의 표현이 사용자에게 보일 수 있다. 일 실시 예에 따르면, 색상 레이어는 다수의 영역들을 포함할 수 있다. 일 실시 예에 따르면, 다수의 영역 들은 줄 구조(striped structure)로 배치될 수 있다. 각 영역은 색상 필터를 포함할 수 있다. 예를 들어, 색상 레이어는 전자 커버의 너비 방향으로 배열되는 다수의 색상 필터들을 포함할 수 있다. 도 1c는 일 실시 예에 따른 제 2 레이어를 도시한다. 도 1c를 참조하면, 너비 방향(도 1a의 1008)은 서로 직교하는 제 1 너비 방향 및 제 2 너비 방향을 포함할 수 있다. 일 실시 예에 따르면, 도시하지 않았으나, 전자 커버가 결합되는 전자 장치는 장방형일 수 있다. 전자 커버가 전자 장치에 결합될 때, 제 1 너비 방향은 전자 장치의 가로 방향이고, 제 2 너비 방향은 전자 장치의 세로 방향일 수 있다. 다른 실시 예에 따르면, 전자 커버가 전자 장치에 결합될 때, 제 1 너비 방향은 전자 장 치의 세로 방향이고, 제 2 너비 방향은 전자 장치의 가로 방향일 수도 있다. 도 1a, 1b 및 1\\c를 참조하 면, 색상 레이어는 제 2 너비 방향으로 배열되는 다수의 색상 필터들을 포함할 수 있다. 색 상 필터(1211-N)는 제 1 너비 방향으로 길게 연장된 라인 형태일 수 있다. 도 1c에서와 같이 색상 필터 들이 설계되는 구조는 줄 구조라고 정의될 수 있다. 일 실시 예에서, 도 1a 및 1b를 참조하면, 단면으로 볼 때, 색상 필터(1211-N)는 대체적으로 직사각형일 수 있다. 도 1a, 1b 및 1c를 참조하면, 색상 필터(1211- N)의 너비(W) 또는 두께(T)는 다양하게 설계될 수 있다. 예를 들어, 색상 필터들의 두께(T) 또는 너비 (W)는 대체적으로 일정할 수 있다. 색상 필터(1211-N)의 색상, 형태(예: 두께(T), 너비(W) 등) 또는 그 재질 등 은 광 투과율과 상관 관계에 있고, 이는 그 설계에 따라 다양할 수 있다. 예를 들어, 색상 필터들(1211-N)은 대 체적으로 동일한 광 투과율을 가지도록 설계될 수 있다. 다른 예를 들어, 제 1 색상의 색상 필터들은 제 2 색상 의 색상 필터들과는 다른 두께를 가지도록 설계될 수도 있다. 도 1a, 1b 및 1c를 참조하면, 색상 필터들 간의 간극(G)은 다양하게 설계될 수 있다. 일 실시 예에 따르면, 색상 필터들 간의 간극(G)은 일정할 수 있다. 다른 실시 예에 따르면, 도시하지 않았으나, 색상 필터들 간의 간극(G)은 0 또는 0에 가깝게 설계될 수도 있다. 도 1a, 1b 및 2를 참조하면, 색상 필터(1211-N)는 red 색상, green 색상 또는 blue 색상 등을 포함하는 광 투 과성 물질을 포함할 수 있다. 일 실시 예에 따르면, 색상 필터들은 서로 다른 색상의 적어도 두 개의 색 상 필터들을 포함하는 일련의 세트(set)가 반복 배열되는 구조로 설계될 수 있다. 예를 들어, 색상 필터들 은 red 색상의 색상 필터, green 색상의 색상 필터 및 blue 색상의 색상 필터를 포함하는 일련의 세트가 반복 배열되는 구조일 수 있다. 다른 예를 들어, 색상 필터들은 red 색상의 색상 필터 및 blue 색상의 색 상 필터를 포함하는 일련의 세트가 반복 배열되는 구조일 수 있다. 다양한 실시 예에 따르면, 색상 필터(1211- N)는 red 색상, green 색상 또는 blue 색상에 국한되지 않는 다양한 다른 색상을 가지도록 설계될 수도 있다. 다양한 실시 예에 따르면, 색상 필터들은 서로 동일하거나 또는 서로 유사한 계열의 색상(또는, 색상 코 드)을 가지도록 설계될 수도 있다. 일 실시 예에 따르면, 색상 필터들이 서로 동일하거나 또는 서로 유사 한 계열의 색상으로 형성되는 경우, 색상 필터들 간의 간극(G)은 0 또는 0에 가깝게 설계될 수 있다. 다 양한 실시 예에 따르면, 색상 필터들이 서로 동일한 색상(예: red)으로 형성되는 경우, 색상 필터들 을 대신하여 제 1 레이어를 따라 배치되는 하나의 단색 필터 레이어로 설계될 수도 있다. 다양한 실시 예에 따르면, 색상 레이어는 제 1 레이어 및 반사 레이어 사이에 배치되는 물질 을 포함할 수 있다. 물질은 색상 필터들의 배열을 유지시킬 수 있다. 물질은 색상 필 터들 사이에 배치되는 부분들을 포함할 수 있다. 다양한 실시 예에 따르면, 이 부분들은 광 차단 물질(예: 블랙 색상을 가지는 물질)로 형성될 수도 있다. 도 1a 및 1b를 참조하면, 제 1 전극 레이어는 공통 전극(common electrode)으로 설계될 수 있다. 일 실시 예에 따르면, 제 2 전극 레이어는 다수의 영역들을 포함할 수 있다. 일 실시 예에 따르면, 다수의 영역들 은 줄 구조로 배치될 수 있다. 각 영역은 전극을 포함할 수 있다. 일 실시 예에 따르면, 제 2 전극 레이어(11 2)는 색상 필터들에 대체적으로 정렬되는 제 2 전극들을 포함할 수 있다. 제 2 전극들은, 예 를 들어, 도 1c의 색상 필터들과 같이 제 2 너비 방향으로 배열되는 줄 구조로 설계될 수 있다. 내부 방향으로 볼 때, 제 2 전극(1121-N)은 색상 필터(1211-N)를 커버하는 너비(W2)를 가질 수 있다. 도 1a 및 1b에서 제 2 전극들을 개략적으로 도시하였을 뿐, 제 2 전극들는 다양한 형태로 설계될 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 하나의 제 2 전극(1121-N)에 둘 이상의 색상 필터들이 커버되는 구조로 설계될 수도 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 1 전극 레이어는 제 2 전극들에 정렬된 다수의 전 극들을 포함하도록 설계될 수도 있다. 일 실시 예에 따르면, 제 2 전극 레이어는 액정 레이어 및 제 3 레이어 사이에 배치되는 물질 을 포함할 수 있다. 물질은 제 2 전극들의 배열을 유지시킬 수 있다. 일 실시 예에 따르면, 물질은 설정된 광 투과성(예: 약 50 % 이상의 광 투과율) 비금속 물질을 포함할 수 있다. 다양한 실시 예에 따르면, 액정(113a)은 제 2 전극들 또는 색상 필터들에 정렬된 부분들(이하, 서 브 액정들)(113c)을 포함하도록 설계될 수 있다. 일 실시 예에 따르면, 서브 액정들(113c)은 줄 구조로 배치될 수 있다. 서브 액정들(113c)은 서로 분리되어 있고, 서브 액정들(113c) 사이에는 폴리머(113b)가 배치되도록 설 계될 수 있다. 일 실시 예에 따르면, 제 2 전극들 중 어느 하나가 선택되고, 제 1 전극 레이어 및 선택된 제 2 전극(1121-N)에 전력이 공급될 수 있다. 제 1 전극 레이어 및 상기 선택된 제 2 전극(1121- N)에 전력이 공급되면, 제 1 전극 레이어 및 상기 선택된 제 2 전극(1121-N) 사이에 전기장이 발생될 수 있다. 전기장은 상기 선택된 제 2 전극(1121-N)에 정렬된 해당 서브 액정(113c-N)을 반응시킬 수 있다. 해당 서 브 액정(113c-N)의 반응에 의하여, 반사 레이어에서 반사된 광은 상기 서브 액정(113c-N)에 정렬된 해당 색상 필터(1211-N)를 통과할 수 있다. 해당 색상 필터(1211-N)를 통과한 광은 상기 서브 액정(113c-N)을 통과하 여 외부로 방출될 수 있다. 다양한 실시 예에 따르면, 제 1 전극 레이어 및 어느 하나의 제 2 전극(1121- N)에 공급되는 전력이 조절되면, 해당 서브 액정(113c-N)의 광 투과율은 조절될 수 있다. 서브 액정(113c-N)의 광 투과율이 조절되면, 전자 커버에서 반사되어 외부로 방출되는 광의 색상 농도가 조절될 수 있다. 다양한 실시 예에 따르면, 색상 필터들 간의 간극(G)이 0 또는 0에 가깝게 설계되는 경우, 서브 액정들 (113c) 간의 간극(미도시)은 0 또는 0에 가깝게 설계될 수 있다. 다양한 실시 예에 따르면, 색상 필터들 간의 간극(G)이 0 또는 0에 가깝게 설계되는 경우, 도 1a 및 1b에 도시된 바와 같이 전체 영역에 걸쳐 액정 (113a)이 배치되도록 설계될 수 있다. 일 실시 예에 따르면, 커버 제어 회로는 제 1 전극 레이어 및 제 2 전극들에 전압을 순차적으로 제 공하는 방식으로 전자 커버를 구동시킬 수 있다. 예를 들어, 설정된 시간(예: 사용자의 눈이 인지하지 못 하는 시간) 동안, 또는 주기적으로, 커버 제어 회로는 순차적으로 제 1 전극 레이어 및 제 2 전극들(112 1)에 관한 전압을 제어할 수 있다. 예를 들어, 순차적으로 제 1 전극 레이어 및 제 2 전극들에 관한 전압을 온 또는 오프할 때, 전자 커버를 통한 색상, 농도, 깊이감, 패턴 등의 표현이 사용자에게 보일 수 있다. 다른 실시 예에 따르면, 커버 제어 회로는 제 1 레이어에 전기적으로 연결되는 스위치들(예: 트랜지스터들 (transistors))을 포함할 수 있다. 일 실시 예에 따르면, 커버 제어 회로는 제 2 전극(1121-N)에 개별적으로 연 결되는 스위치를 포함할 수 있다. 커버 제어 회로는 스위치들을 개별적으로 제어할 수 있다. 스위치들이 커버 제어 회로에 의하여 개별적으로 제어될 때, 제 1 전극 레이어 및 제 2 전극들 사이에 배치된 해당 서브 액정(113c-N) 또한 개별적으로 반응할 수 있다. 일 실시 예에 따르면, 트랜지스터로 설계된 스위치는 소스 전극(source electrode), 드레인 전극(drain electrode), 게이트 전극(gate electrode) 및 반도체 레이어 (semiconductor layer)를 포함할 수 있다. 소스 전극은 전자를 공급하는 전극일 수 있다. 드레인 전극은 전자를공급받는 전극일 수 있다. 소스 전극 또는 드레인 전극은 제 2 전극(1121-N)에 전기적으로 연결될 수 있다. 게 이트 전극은 소스 전극에서 드레인 전극으로의 전자 이동을 스위칭(switching)하기 위한 전극일 수 있다. 반도 체 레이어는 게이트 전극이 일정 이상 전압을 가할 경우, 전자가 이동하는 패스(path)가 될 수 있다. 반도체 레 이어는 스위치를 온 상태로 전환하는 요소로서 스위치의 '액티브 레이어(active layer)' 또는 '액티브 영역 (active area)'으로 정의될 수 있다. 게이트 전극에 임계 이상의 신호(예: 전압)가 가해지면, 반도체 레이어(예: 실리콘(silicon))는 도체와 같이 전자를 이동 가능하게 되고, 전자는 반도체 레이어를 통해 소스 전 극에서 드레인 전극으로 이동될 수 있다. 전자의 이동으로 인해, 제 1 전극 레이어 및 제 2 전극(1121- N)에 전압이 가해질 수 있다. 일 실시 예에 따르면, 스위치는 TFT(thin film transistor)로 설계될 수 있다. 일 실시 예에 따르면, TFT는 제 1 레이어 또는 제 2 레이어에 포함되도록 설계될 수 있다. 예를 들어, 도시하지 않았으나, TFT는 제 2 전극 레이어에 포함되도록 설계될 수 있다. 다른 예를 들어, 도시하지 않았으나, TFT는 제 1 레이어 및 제 2 레이어 사이에 배치되도록 설계될 수 있다. 또 다른 예를 들어, 도시하지 않았으나, TFT는 반사 레이어의 아래에 배치되는 레이어로 설계될 수도 있다. 이 밖에, TFT는 다양한 구조로 전자 커버 에 설계될 수 있다. 일 실시 예에 따르면, 반사 레이어는 내부 방향으로 향하는 색상 레이어의 면을 커버하 도록 설계될 수 있다. 반사 레이어는 설정된 반사율(예: 약 50 % 이상의 반사율)을 가지는 물질을 포함할 수 있다. 다양한 실시 예에 따르면, 반사 레이어는, 도시하지 않았으나, 기판 및 기판에 결합된 반사 물질 을 포함하도록 설계될 수 있다. 예를 들어, 반사 레이어는 기판에 반사 물질을 도포하는 방식으로 형성될 수 있다. 예를 들어, 반사 레이어는 기판에 반사 물질의 필름을 결합하는 방식으로 형성될 수도 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 전자 커버는 반사 레이어를 대신하여 내부 방향(100 9)으로 향하는 색상 필터들의 면을 커버하는 물질로 설계될 수도 있다. 다양한 실시 예에 따르면, 색상 필터들은 설정된 광 반사율(예: 약 30 % 이상의 광 반사율)을 가지는 광 투과성 색상 물질을 포함하도록 설계될 수도 있다. 이 경우 반사 레이어는 생략되거나, 반사 레이어 를 대신하여 광을 차단하는 레이어가 배치되도록 설계될 수도 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 2 레이어는 색상 필터들 및 반사 레이어를 대신하여 색상을 가지는 반사 필름들을 포함하는 형태로 설계될 수도 있다. 일 실시 예에서, 반사 필름들은 제 2 전극들에 정렬되는 줄 구조로 설계될 수 있다. 일 실시 예에 따르면, 반사 레이어는 전자 커버의 제 2 면을 형성할 수 있다. 다양한 실시 예 에 따르면, 도시하지 않았으나, 반사 레이어 아래에 배치되는 추가적인 레이어(예: 리지드 플레이트(rigid plate))가 설계되는 경우, 전자 커버의 제 2 면은 추가적인 레이어에 의해 형성될 수 있다. 일 실시 예에 따르면, 전자 커버는 제 1 레이어 및 제 2 레이어 사이에 배치되는 제 3 레이어 를 포함할 수 있다. 제 3 레이어는 제 1 레이어 및 제 2 레이어에 결합되는 다양한 물질을 포함할 수 있다. 제 3 레이어는 설정된 광 투과율(예: 약 30 % 이상의 광 투과율)을 가지는 물질을 포함할 수 있다. 일 실시 예에 따르면, 제 3 레이어는 OCA(optical clear adhesive) 또는 OCR(optical clear resin) 등을 포함할 수 있다. 일 실시 예에 따르면, 전자 커버는 제 1 레이어 위에 배치되는 제 4 레이어를 포함할 수 있다. 제 4 레이어는 전자 커버의 제 1 면을 형성할 수 있다. 제 4 레이어는 설정된 광 투과율 (예: 약 30 % 이상의 광 투과율)을 가지는 물질을 포함할 수 있다. 일 실시 예에 따르면, 전자 커버가 전자 장치에 결합될 때, 제 4 레이어는 전자 장치의 외면의 일부 를 형성할 수 있다. 일 실시 예에 따르면, 제 4 레이어는 전자 장치의 외면을 형성하는 플레이트(예: 광 투과성 유리 또는 플라스틱 플레이트)일 수 있다. 일 실시 예에 따르면, 전자 커버는 제 1 레이어 및 제 4 레이어 사이에 배치되는 제 5 레이어 를 포함할 수 있다. 제 5 레이어는 제 1 레이어 및 제 4 레이어를 결합하는 다양한 물질을 포함할 수 있다. 제 5 레이어는 설정된 광 투과율(예: 약 50 % 이상의 광 투과율)을 가지는 물질을 포함할 수 있다. 일 실시 예에 따르면, 제 5 레이어는 OCA 또는 OCR 등을 포함할 수 있다. 일 실시 예에 따르면, 전자 커버의 제 1 레이어, 제 2 레이어, 제 3 레이어는 가요성을 가 지도록 설계될 수 있다. 예를 들어, 제 4 레이어는 전자 장치의 외관을 형성하는 요소로 이용되고, 곡형 등으로 다양한 형태로 설계될 수 있다. 제 1 레이어, 제 2 레이어 및 제 3 레이어는 제 4 레이 어를 따르는 형태로 제 4 레이어에 결합될 수 있다. 다양한 실시 예에 따르면, 전자 커버는 제 4 레이어 및 제 5 레이어를 제외한 제 1 레이어 , 제 2 레이어 및 제 3 레이어로 정의될 수 있다. 일 실시 예에 따르면, 제 4 레이어가 전 자 장치의 외관을 형성하는 요소로 이용될 때, 제 1 레이어, 제 2 레이어 및 제 3 레이어로 정 의된 전자 커버는 제 4 레이어의 전체 또는 일부를 따라 배치되도록 설계될 수 있다. 다양한 실시 예 에 따르면, 제 1 레이어 및 제 2 레이어가 제 3 레이어 없이 결합되도록 설계된다면, 전자 커버 는 제 1 레이어 및 제 2 레이어로 정의될 수도 있다. 다양한 실시 예에 따르면, 전자 커버는 도시하지 않은 다양한 다른 레이어를 더 포함하도록 설계될 수 있 다. 예를 들어, 도시하지 않았으나, 전자 커버는 편광(polarizing) 레이어, 복굴절 보상 레이어, 눈부심 방지 레이어, 휘도 개선 레이어, 또는 비주얼 보상 레이어 등의 다양한 광학 레이어를 더 포함하도록 설계될 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 전자 커버는 제 1 도전성 패턴을 포함하는 레이어를 포함할 수 있다. 일 실시 예에 따르면, 제 1 도전성 패턴은 안테나로 이용될 수 있다. 예를 들어, 전자 커버가 전 자 장치에 결합되면, 제 1 도전성 패턴은 전자 장치의 무선 통신 회로(또는, 통신 모듈)에 전기적으로 연결될 수 있다. 예를 들어, 무선 통신 회로는 제어 회로(예: 프로세서)로부터의 신호를 기초로 제 1 도전성 패턴의 적 어도 일부를 활성화할 수 있다. 예를 들어, 무선 통신 회로는 제어 회로로부터의 신호를 제 1 도전성 패턴을 이 용하여 무선으로 외부로 전송할 수 있다. 예를 들어, 무선 통신 회로는 외부로부터 무선 신호를 제 1 도전성 패 턴을 이용하여 수신하고, 이를 제어 회로로 제공할 수 있다. 일 실시 예에 따르면, 제 1 도전성 패턴을 포함하 는 레이어는 제 2 레이어 아래에 배치될 수 있다. 다양한 실시 예에 따르면, 제 1 도전성 패턴을 포함하는 레이어는 제 2 면 위에 배치될 수도 있다. 예를 들어, 제 1 도전성 패턴은 메쉬 구조(mesh structure)의 전극 패턴을 포함할 수 있다. 메쉬 구조의 전극 패턴을 '메탈 메쉬 패턴'이라고 정의할 수 있다. 메탈 메쉬 패 턴은 개구들(openings)을 포함할 수 있다. 반사 레이어에서 반사된 광은 메탈 메쉬 패턴의 개구들을 통하 여 외부로 방출될 수 있다. 다양한 실시 예에 따르면, 메탈 메쉬 패턴의 메쉬 형상(mesh shape)은 다양할 수 있 다. 메쉬 형상은, 예를 들어, 사각형, 육각형 등일 수 있다. 다양한 실시 예에 따르면, 메탈 메쉬 패턴의 메쉬 형상은 전체적으로 일정하거나, 또는 부분적으로 다르게 설계될 수 있다. 다양한 실시 예에 따르면, 메탈 메쉬 패턴의 메쉬 크기(mesh size)는 전체적으로 일정하거나, 또는 부분적으로 다르게 설계될 수 있다. 다양한 실시 예에 따르면, 메탈 메쉬 패턴의 굵기(thickness)는 전체적으로 일정하거나, 또는 부분적으로 다르게 설계될 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 전자 커버는 제 2 도전성 패턴을 포함하는 레이어를 포함할 수 있다. 제 2 도전성 패턴은 전자 커버의 적어도 일부를 따라 배치될 수 있다. 전자 커버가 전자 장 치에 결합되면, 제 2 도전성 패턴은 전자 장치의 압력 감지 회로에 전기적으로 연결될 수 있다. 예를 들어, 압 력 감지 회로는 제어 회로(예: 프로세서)로부터의 신호를 기초로 제 2 도전성 패턴의 적어도 일부를 활성화할 수 있다. 예를 들어, 압력 감지 회로는 제 2 도전성 패턴을 통하여 압력에 관한 신호를 감지하고, 이를 제어 회 로(예:프로세서)로 제공할 수 있다. 예를 들어, 제 2 도전성 패턴은 다수의 제 1 전극들 및 다수의 제 2 전극들 을 포함할 수 있다. 다수의 제 1 전극들은 하나의 레이어 상에 배열되고, 다수의 제 2 전극들은 다른 레이어 상 에 배열될 수 있다. 압력 감지 회로는 제 1 전극 및 제 2 전극에 전압을 가하고, 이로 인해 제 1 전극 및 제 2 전극 사이에는 커패시턴스가 발생할 수 있다. 예를 들어, 전자 장치의 외면에 압력이 가해지면, 제 1 전극 및 제 2 전극 사이의 거리는 가까워지고, 커패시턴스는 변할 수 있다 (예: 커패시턴스 증가). 압력 감지 회로는 이러한 커패시턴스의 변화에 따른 신호를 제어 회로로 제공할 수 있다. 제어 회로는 압력 감지 회로로부터 획득 한 신호를 기초로 압력이 발생한 위치 및 그 크기를 감지할 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 전자 커버는 제 3 도전성 패턴을 포함하는 레이어를 포함할 수 있다. 제 3 도전성 패턴은 터치 입력 또는 호버링 입력을 감지하는데 이용될 수 있다. 제 3 도전성 패턴은 전자 커버의 적어도 일부를 따라 배치될 수 있다. 전자 커버가 전자 장치에 결합되면, 제 3 도전성 패턴은 전자 장치의 터치/호버링 입력 감지 회로에 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제 3 도 전성 패턴을 포함하는 레이어는 제 2 레이어 아래에 배치될 수 있다. 다양한 실시 예에 따르면, 제 3 도전 성 패턴을 포함하는 레이어는 제 2 면 위에 배치될 수도 있다. 예를 들어, 제 3 도전성 패턴을 포함하는레이어는 ITO(indium tin oxide), ATO(antimony tin oxide) 등을 포함할 수 있다. 도 2는 다양한 실시 예에 따른 전자 장치에 포함된 전자 커버의 단면도를 도시한다. 전자 커버는 도 1a의 전자 커버의 적어도 일부를 포함할 수 있다. 일 실시 예에 따르면, 전자 커버 는 제 1 레이어, 제 2 레이어, 제 3 레이어, 제 4 레이어 및 제 5 레이어를 포 함할 수 있다. 제 1 레이어, 제 2 레이어, 제 3 레이어, 제 4 레이어 및 제 5 레이어 는 도 1a의 제 1 레이어, 제 2 레이어, 제 3 레이어, 제 4 레이어 및 제 5 레이어 각각과 유사하거나 동일할 수 있다. 일 실시 예에 따르면, 전자 커버는 제 2 레이어에서 제 1 레이어로 향하는 방향으로 파 인 형태의 홈을 포함할 수 있다. 일 실시 예에 따르면, 홈은 제 2 레이어에 형성된 개구 (opening)(또는, 관통 홀)에 의해 형성될 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 홈은 제 3 레이어의 적어도 일부를 상기 방향으로 더 파인 형태의 홈일 수도 있다. 일 실시 예에 따르면, 전자 장치의 발광부(또는, 광원) 또는 수광부를 포함하는 요소는 홈에 결합될 수 있다. 예를 들어, 발광부는 카메라를 위한 플래시 등의 광원일 수 있다. 예를 들어, 발광부는 광 센서(예: 심박 측정 센서)를 위한 광원일 수 있다. 예를 들어, 수광부는 광 센서(예: 생체 센서, 카메라의 이미지 센서 등)에 포함된 요소일 수 있다. 일 실시 예에 따르면, 제 1 레이어의 광 투과율이 조절될 때, 요소의 발광부로부터 생성된 광이 외부로 방출되는 양은 조절될 수 있다. 일 실시 예에 따르면, 제 1 레이어의 광 투과율이 조절될 때, 외부 광이 요소의 수광부로 유입되는 양은 조절될 수 있다. 도 3a 및 3b는 일 실시 예에 따른 전자 커버를 포함하는 전자 장치를 도시한다. 도 4a, 4b, 4c, 4d 및 4e는 다 양한 실시 예에서 전자 커버를 통한 표현을 설명하기 위한 도면들이다. 도 3a 및 3b를 참조하면, 일 실시 예에서, 전자 장치는, 전자 장치의 외관의 전부 또는 적어도 일부 분을 형성하는 하우징을 포함할 수 있다. 다양한 실시 예에 따르면, 하우징은 비금속 물질 및/또는 금속 물질을 포함할 수 있다. 예를 들어, 하우징은 플라스틱, 금속, 탄소 섬유 및 다른 섬유 복합체들, 세 라믹, 유리, 목재와 같은 물질 또는 이 물질들의 조합으로 형성될 수 있다. 다양한 실시 예에 따르면, 하우징 은 전체적으로 하나의 물질 또는 다수의 물질들의 조합으로 형성될 수 있다. 다양한 실시 예에 따르면, 하 우징은 부분적으로 물성이 다른 물질들로 형성될 수도 있다. 일 실시 예에 따르면, 하우징은 제 1 면, 제 2 면 및 제 3 면을 포함하는 외관을 형성 할 수 있다. 제 1 면은 대체적으로 제 1 방향으로 향할 수 있다. 제 2 면은 대체적으로 제 1 방향과 반대인 제 2 방향으로 향할 수 있다. 제 3 면은 제 1 면 및 제 2 면 사이의 공간을 둘러싸는 면(예: 측면)일 수 있다. 일 실시 예에 따르면, 하우징은 제 1 면을 형성하는 제 1 커버(또는, 제 1 플레이트)(310-1)를 포함 할 수 있다. 하우징은 제 2 면을 형성하는 제 2 커버(또는, 제 2 플레이트)(310-2)를 포함할 수 있 다. 하우징은 제 1 커버(310-1) 및 제 2 커버(310-2) 사이의 공간을 둘러싸는 사이드 부재(side member)(310-3)를 포함할 수 있다. 사이드 부재(310-3)는 제 3 면을 형성할 수 있다. 일 실시 예에 따르면, 제 1 커버(310-1)는 제 1 엣지(edge)(315-1), 제 2 엣지(315-2), 제 3 엣지(315-3) 및 제 4 엣지(315-4)를 포함하는 대체적으로 직사각형일 수 있다. 예를 들어, 제 1 엣지(315-1) 및 제 2 엣지(315- 2)는 서로 마주하고 평행일 수 있다. 제 3 엣지(415-3) 및 제 4 엣지(315-4)는 서로 마주하고 평행일 수 있다. 다양한 실시 예에 따르면, 제 1 엣지(315-1) 및 제 2 엣지(315-2) 사이의 거리는, 제 3 엣지(315-3) 및 제 4 엣지(315-4) 사이의 거리보다 클 수 있다. 다양한 실시 예에 따르면, 도시하지 않았지만, 제 1 엣지(315-1) 및 제 3 엣지(315-3)의 연결부, 제 1 엣지(315-1) 및 제 4 엣지(315-4)의 연결부, 제 2 엣지(315-1) 및 제 3 엣지 (315-3)의 연결부, 또는 제 2 엣지(315-2) 및 제 4 엣지(315-4)의 연결부는 둥근 형태일 수 있다. 다양한 실시 예에 따르면, 제 1 엣지(315-1), 제 2 엣지(315-2), 제 3 엣지(315-3) 또는 제 4 엣지(315-4)에 인접한(예: 약 10 mm 이하) 제 1 커버(310-1)의 영역(또는 엣지 영역)(미도시)은 곡형으로 설계될 수 있다. 예 를 들어, 제 3 엣지(315-3)에 인접한 엣지 영역은 제 3 방향을 따라 증가된 좌표에 대하여 제 2 방향 으로 내려가는 형태의 곡면을 포함할 수 있다. 제 3 방향은 사이드 부재(310-3)의 제 4 프레임 (310-34)에서 제 3 프레임(310-33)으로 향하는 방향일 수 있다. 예를 들어, 제 4 엣지(315-4)에 인접한 엣지 영 역은 제 4 방향을 따라 증가된 좌표에 대하여 제 2 방향으로 내려가는 형태의 곡면을 포함할 수 있다. 제 4 방향은 사이드 부재(310-3)의 제 3 프레임(310-33)에서 제 4 프레임(310-34)으로 향하는 방향일 수 있다. 제 2 커버(310-2)는 제 1 커버(310-1)의 반대 편에 배치될 수 있다. 일 실시 예에 따르면 제 2 커버(310-2)는 제 1 엣지(315-1)에 대응되는 제 5 엣지(315-5), 제 2 엣지(315-2)에 대응되는 제 6 엣지(315-6), 제 3 엣지 (315-3)에 대응되는 제 7 엣지(315-7) 및 제 4 엣지(315-4)에 대응되는 제 8 엣지(315-8)를 포함하는 대체적으 로 직사각형일 수 있다. 일 실시 예에 따르면, 제 2 커버(310-2)는 도 1a 및 1b의 전자 커버를 포함할 수 있다. 이하, 제 2 커버 (310-2)를 설명함에 있어서, 도 1a, 1b 및 2를 다시 참조하여 설명하겠다. 일 실시 예에 따르면, 제 2 커버(310-2)는 제 2 면을 형성하는 제 4 레이어를 포함할 수 있다. 예를 들어, 제 4 레이어는 전자 장치의 외면을 형성하는 플레이트이고, 광 투과성을 가지는 플라스틱, 유 리, 탄소 섬유 및 다른 섬유 복합체와 같은 물질 또는 이 물질들의 조합으로 형성될 수 있다. 일 실시 예에 따르면, 제 2 커버(310-2)는 전기적 제어에 의해 광 투과율을 조절하도록 설계된 제 1 레이어 를 포함할 수 있다. 제 1 레이어에 의해, 외부 광이 제 2 커버(310-2)의 내부로 유입되는 양 또는 제 2 커버(310-2)의 내부로부터 반사된 광이 외부로 방출되는 양이 조절될 수 있다. 제 2 커버(310-2)는 색상 필터 들 및 반사 레이어를 포함하는 제 2 레이어를 포함할 수 있다. 일 실시 예에 따르면, 외부 광 은 반사 레이어에 반사되고, 반사된 광은 색상 레이어 및 제 1 레이어를 거쳐 외부로 방출될 수 있다. 전자 장치의 제어 회로(예: 프로세서)는 제 1 레이어에 대한 전력을 제어할 수 있다. 제 1 레 이어에 대한 전력이 제어될 때, 제 1 레이어의 적어도 일부 영역에 대한 광 투과율은 조절되고, 제 2 커버(310-2)를 통한 색상, 농도, 깊이감, 패턴 등의 표현이 사용자에게 보일 수 있다. 도 4a는 일 실시 예에서 제 1 레이어로 전력이 공급되지 않을 때 전자 장치의 제 2 커버(310-2)를 도 시한다. 제 1 레이어로 전력이 공급되지 않게 되면, 제 1 레이어는 외부 광을 제 2 레이어로 이 동되기 어렵게 하는 광 투과율을 가질 수 있다. 이 경우, 외부 광은 대체적으로 제 1 레이어에서 반사되어 제 4 레이어를 통과하여 외부로 방출될 수 있다. 도 4a를 참조하면, 예를 들어, 제 1 레이어로 전력 이 공급되지 않을 때, 제 2 커버(310-2)는 어두운 계통의 색상(예: black)으로 사용자에게 보일 수 있다. 도 4a 의 예시에서, 제 2 커버(310-2)를 통해 보이는 색상의 깊이감은 제 4 레이어의 두께로 제한될 수 있다. 도 4b는 일 실시 예에 따라 제 1 레이어로 전력이 공급될 때 전자 장치의 제 2 커버(310-2)를 도시한 다. 일 실시 예에 따르면, 제 1 레이어의 제 2 전극들 전체에 일정한 전력이 공급될 수 있다. 제 1 레이어의 제 2 전극들로 일정한 전력이 공급되면, 제 1 레이어는 광을 제 2 레이어로 이 동시킬 수 있는 광 투과율을 가질 수 있다. 일 실시 예에서, 제 1 레이어의 제 2 전극들로 일정한 전력이 공급될 때, 제 1 레이어는 전체에 걸쳐 대체적으로 일정한 광 투과율을 가지도록 설계될 수 있다. 외부 광은 제 1 레이어를 통과하여 제 2 레이어의 반사 레이어에 도달할 수 있다. 외부 광은 반 사 레이어에서 반사되고, 반사된 광은 제 2 레이어의 색상 필터들을 거쳐 외부로 방출될 수 있 다. 일 실시 예에 따르면, 색상 필터들은 서로 동일하거나 또는 서로 유사한 계열의 색상(예: RGB 색상 코드, HSB 색상 코드 또는 CMYK 색상 코드)을 가지도록 설계될 수 있다. 도 4b는, 서로 동일하거나, 또는 서로 유사한 계열의 색상을 가지는 색상 필터들을 거쳐 외부로 방출되는 광에 의하여, 제 2 커버(310-2)가 전 체 영역에 걸쳐 대체적으로 일정한 색상으로 사용자에게 보이는 예시일 수 있다. 다른 실시 예에 따르면, 색상 필터들은 서로 다른 색상을 가지도록 설계될 수 있다. 도 4b는, 서로 다른 색상의 색상 필터들을 거쳐 외부로 방출되는 광들이 혼합(또는 합성)되어, 제 2 커버(310-2)가 전체 영역에 걸쳐 대체적으로 일정한 색상으로 사용자에게 보이는 예시일 수도 있다. 다양한 실시 예에 따르면, 제 1 레이어로 공급되는 전력의 세기가 클수록, 제 1 레이어의 광 투과율은 증가될 수 있다. 제 1 레이어의 광 투과율이 증가되면, 제 2 커버(310-2)에서 표현되는 색상의 농도는 증가되어 사용자에게 보일 수 있다. 도 4b의 예시에서, 제 2 커 버(310-2)을 통해 사용자에게 보이는 표현이 가지는 깊이감은 도 4a의 예시와 비교하여 개선될 수 있다. 도 3b를 참조하면, 일 실시 예에서, 제 1 레이어의 제 2 전극들은 제 5 방향으로 배열되는 줄 구조(striped structure)로 설계될 수 있다. 제 5 방향은 사이드 부재(310-3)의 제 1 프레임(310- 31) 및 제 2 프레임(310-32) 사이의 방향일 수 있다. 일 실시 예에 따르면, 제 2 레이어의 색상 패턴들 또한 제 5 방향으로 배열되는 줄 구조로 설계될 수 있다. 색상 패턴들은 제 2 전극들 에 정렬될 수 있다. 일 실시 예에서, 도 4c는 제 1 레이어의 제 2 전극들에 대한 전력이 제어 될 때 전자 장치의 제 2 커버(310-2)를 도시한다. 제 1 레이어의 제 2 전극들에 대한 전력이 제어될 때, 도 4c에서와 같이, 제 5 방향으로 제 1 부분(401c)의 제 1 색상 및 제 2 부분(402c)의 제 2색상이 반복되는 줄무늬 형태의 표현이 제 2 커버(310-2)를 통해 사용자에게 보일 수 있다. 일 실시 예에서, 도 4c는, 제 1 부분(401c)에 해당하는 적어도 하나의 제 2 전극(1121-N)에 대한 전력을 차단하고, 제 2 부분(402 c)에 해당하는 적어도 하나의 제 2 전극(1121-N)에 대한 전력을 공급할 때의 예시일 수 있다. 다른 실시 예에서, 도 4c는, 제 1 부분(401c)에 해당하는 적어도 하나의 제 2 전극(1121-N) 및 제 2 부분(402c)에 해당하 는 적어도 하나의 제 2 전극(1121-N)에 공급하는 전력의 세기를 달리할 때의 예시일 수도 있다. 도 4d는 다양한 실시 예에서 제 1 레이어의 제 2 전극들에 대한 전력이 제어될 때 전자 장치의 제 2 커버(310- 2)를 도시한다. 도 4d를 참조하면, 제 1 레이어의 제 2 전극들에 대한 전력이 제어될 때, 제 5 방향 으로의 그라데이션(gradation) 표현이 제 2 커버(310-2)를 통해 사용자에게 보일 수 있다. 도 3b를 참조하면, 다른 실시 예에서, 제 1 레이어의 제 2 전극들은 제 3 방향(또는, 제 4 방향)으로 배열되는 줄 구조로 설계될 수 있다. 일 실시 예에 따르면, 제 2 레이어의 색상 패턴들 또한 제 3 방향(또는, 제 4 방향)으로 배열되는 줄 구조로 설계될 수 있다. 색상 패턴들 은 제 2 전극들에 정렬될 수 있다. 일 실시 예에서, 도 4e는 제 1 레이어의 제 2 전극들 에 대한 전력이 제어될 때 전자 장치의 제 2 커버(310-2)를 도시한다. 도 4e를 참조하면, 제 1 레이 어의 제 2 전극들에 대한 전력이 제어될 때, 제 3 방향(또는, 제 4 방향)으로 제 1 부분(401e)의 제 1 색상 및 제 2 부분(402e)의 제 2 색상이 반복되는 줄무늬 형태의 표현이 제 2 커버(310-2)를 통해 사용자에게 보일 수 있다. 일 실시 예에서, 도 4e는, 제 1 부분(401e)에 해당하는 적어도 하나의 제 2 전 극(1121-N)에 대한 전력을 차단하고, 제 2 부분(402e)에 해당하는 적어도 하나의 제 2 전극(1121-N)에 대한 전 력을 공급할 때의 예시일 수 있다. 다른 실시 예에서, 도 4e는, 제 1 부분(401e)에 해당하는 적어도 하나의 제 2 전극(1121-N) 및 제 2 부분(402e)에 해당하는 적어도 하나의 제 2 전극(1121-N)에 공급하는 전력의 세기를 달 리할 때의 예시일 수도 있다. 다양한 실시 예에서, 도시하지 않았지만, 제 1 레이어의 제 2 전극들 에 대한 전력이 제어될 때 제 3 방향(또는, 제 4 방향)으로의 그라데이션 표현이 제 2 커버(310- 2)를 통해 사용자에게 보일 수도 있다. 다양한 실시 예에 따르면, 제 2 커버(310-2)의 요소들이 다양하게 설계되고, 제 1 레이어에 대한 전기적 제어가 다양하게 실시될 때, 이 밖의 다양한 표현들이 제 2 커버(310-2)를 통해 사용자에게 보일 수 있다. 다양 한 실시 예에 따르면, 전자 장치는 제 2 커버(310-2)를 통한 전기적 제어들을 순차적으로 변경하여, 제 2 커버(310-2)를 통해 사용자에게 보이는 표현들은 변경될 수도 있다. 도 3a 및 3b를 참조하면, 사이드 부재(310-3)는 제 1 엣지(315-1) 및 제 5 엣지(315-5) 사이에 결합되는 제 1 프레임(310-31)을 포함할 수 있다. 사이드 부재(310-3)는 제 2 엣지(315-2) 및 제 6 엣지(315-6) 사이에 결합 되는 제 2 프레임(310-32)을 포함할 수 있다. 사이드 부재(310-3)는 제 3 엣지(315-3) 및 제 7 엣지(315-7) 사 이에 결합되는 제 3 프레임(310-33)을 포함할 수 있다. 사이드 부재(310-3)는 제 4 엣지(315-4) 및 제 8 엣지 (315-8) 사이에 결합되는 제 4 프레임(310-34)을 포함할 수 있다. 다양한 실시 예에 따르면, 제 1 프레임(310- 31) 및 제 3 프레임(310-33)의 연결부, 제 1 프레임(310-31) 및 제 4 프레임(310-34)의 연결부, 제 2 프레임 (310-32) 및 제 3 프레임(310-33)의 연결부, 또는 제 2 프레임(310-32) 및 제 4 프레임(310-34)의 연결부는 둥 근 형태일 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 전자 장치는 사이드 부재(310-3)로부터 제 1 커버(310-1) 및 제 2 커버(310-2) 사이의 공간(미도시)으로 연장된 연장부(예: 미드 플레이트(mid-plate))를 포함할 수 있다. 다양한 실시 예에 따르면, 사이드 부재(310-3)의 적어도 일부는 도전성 물질을 포함할 수 있다. 다양한 실시 예 에 따르면, 사이드 부재(310-3)의 제 1, 2, 3 및 4 프레임들(310-31, 310-32, 310-33, 310-34) 중 적어도 하나 는 서로 물리적으로 분리된 다수의 금속 부분들을 포함할 수 있다. 일 실시 예에 따르면, 다수의 금속 부분들 사이에는 비도전성 부재(341, 342, 343, 344)가 배치될 수 있다. 다양한 실시 예에 따르면, 비도전성 부재(341, 342, 343 또는 344)는 전자 장치의 내부에 배치된 부재(예: 미드 플레이트)로부터 연장된 것일 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 2 커버(310-2)는 사이드 부재(310-3)의 제 3 면을 적어 도 일부 커버하거나 차지하도록 확장시켜 설계될 수 있다. 전자 장치는 제 1 커버(310-1) 및 제 2 커버(310-2) 사이에 배치되는 다양한 요소들을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제 1 커버(310-1) 및 제 2 커버(310-2) 사이에 배치되는 도시하지 않은 디 스플레이를 포함할 수 있다. 디스플레이는 다수의 픽셀들을 포함하는 발광부들(예: OLED)을 포함하고, 제 1 커 버(310-1)를 통하여 외부로 노출될 수 있다.디스플레이는 제 1 커버(310-1)의 적어도 일부를 따라 배치될 수 있다. 제 1 커버(310-1)는 디스플레이를 커버 하는 영역인 제 1 영역과, 디스플레이를 커버하지 않는 영역인 제 2 영역을 포함할 수 있다. 제 1 영 역은 디스플레이로부터 발생된 광이 통과되는 영역일 수 있다. 일 실시 예에 따르면, 제 1 영역은 a 엣지(360-1), b 엣지(360-2), c 엣지(360-3) 및 제 4 엣지(360-4)를 포함하는 대체적으로 직사각형일 수 있다. a 엣지(360-1)는 제 1 엣지(315-1)에 인접할 수 있다 (예: 약 10 mm 이하). b 엣지(360-2)는 제 2 엣지(315-2)에 인접할 수 있다. c 엣지(360-3)는 제 3 엣지(315-3)에 인접할 수 있다. d 엣지(360-4)는 제 4 엣지(315-4)에 인접할 수 있다. 제 2 영역(이하, 베젤 영역)은 제 1 영역 을 에워싸는 직사각 고리 형태일 수 있다. 베젤 영역은 제 1 엣지(315-1) 및 a 엣지(360-1) 사이의 제 1 베젤 영역(370-1)을 포함할 수 있다. 베젤 영역은 제 2 엣지(315-2) 및 b 엣지(360-2) 사이의 제 2 베젤 영역(370-2)을 포함할 수 있다. 베젤 영역은 제 3 엣지(315-3) 및 c 엣지(360-3) 사이의 제 3 베젤 영역(370-3)을 포함할 수 있다. 베젤 영역은 제 4 엣지(315-4) 및 d 엣지(360-4) 사이의 제 4 베젤 영역 (370-4)을 포함할 수 있다. 다양한 실시 예에 따르면, 베젤 영역은 색상을 가지도록 설계될 수 있고, 제 1 영역과는 구별될 수 있다. 예를 들면, 베젤 영역은 어두운 계통의 검정색, 또는 사이드 부재(310-3)의 색상과 유사하거나 또는 동일한 색상을 가질 수 있다. 일 실시 예에 따르면, 베젤 영역은 검정색 인쇄 층을 포함할 수 있다. 다양한 실시 예에 따르면, 디스플레이는 제 1 면을 이용한 터치 입력 또는 호버링 입력을 위한 터치 패널 을 포함할 수 있다. 다양한 실시 예에 따르면, 이러한 터치 패널은 스타일러스를 이용한 터치 입력 또는 호버링 입력을 지원하는 디지타이저 패널일 수도 있다. 다양한 실시 예에 따르면, 전자 장치는 제 2 커버(310-2)의 설정에 관한 화면(또는, GUI(graphical user interface))을 디스플레이에 표시할 수 있다. 예를 들어, 전자 장치는 다양한 표현 모드에 관한 리스트를 포함하는 화면을 디스플레이를 통해 표시할 수 있다. 다양한 표현 모드에 관한 리스트는 GUI 엘리먼트로 표시될 수 있다. 리스트에서 하나의 리스트 엔트리가 사용자 입력(예: 터치 입력)에 의하여 선택되면, 전자 장치 는 선택된 리스트 엔트리에 따른 표현 모드에 따라 제 2 커버(310-2)를 전기적으로 제어할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 제 1 베젤 영역(370-1)에 정렬된 위치에 실장되는 다양한 다른 전 자 부품들(이하, '제 1 부품')을 포함할 수 있다. 다양한 실시 예에 따르면, 제 1 부품은 전자 장치의 다양한 상태를 가리키는 발광 요소(예: LED)(미도시) 를 포함할 수 있다. 예를 들어, 배터리 잔량이 부족할 때, 전자 장치는 발광 요소를 통하여 해당 색상을 표시할 수 있다. 예를 들어, 화면이 꺼져 있을 때, 전자 장치는 발광 요소를 통하여 해당 색상을 표시할 수 있다. 예를 들어, 전자 장치가 유선 충전기 또는 무선 충전기에 연결되면, 전자 장치는 발광 요소 를 통하여 해당 색상을 표시할 수 있다. 일 실시 예에 따르면, 제 1 커버(310-1)는 발광 요소에 정렬된 위치에 형성된 광 투과 영역 또는 관통 홀을 포함할 수 있다. 다양한 실시 예에 따르면, 디스플레이를 통하여 전 자 장치의 다양한 상태를 표시하도록 설계된 경우, 발광 요소 및 이에 관한 광 투과 영역 또는 관통 홀 은 전자 장치에서 생략될 수 있다. 다양한 실시 예에 따르면, 제 1 부품은 통화 중 상대 기기로부터 수신된 음성 신호를 소리로 출력하기 위한 리 시버(receiver)를 포함할 수 있다. 제 1 커버(310-1)는 리시버에 정렬된 위치에 형성된 관통 홀 을 포함할 수 있다. 리시버는 관통 홀에 결합될 수 있다. 다양한 실시 예에 따르면, 제 1 부품은 적어도 하나의 카메라(예: 전방 카메라(front facing camera))(미도시) 를 포함할 수 있다. 제 1 커버(310-1)는 적어도 하나의 카메라에 정렬된 위치에 형성된 광 투과 영역 또는 관통 홀을 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 적어도 하나의 카메라를 통한 이미지 데이터를 기초로 제 2 커버(310-2)를 전기적으로 제어하도록 설계될 수 있다. 다양한 실시 예에 따르면, 제 1 부품은 적어도 하나의 광 센서(미도시)를 포함할 수 있다. 제 1 커버(310-1)는 적어도 하나의 광 센서에 정렬된 위치에 형성된 광 투과 영역 또는 관통 홀(393, 394)을 포함할 수 있다. 다양 한 실시 예에 따르면, 전자 장치는 적어도 하나의 광 센서로부터 정보를 기초로 제 2 커버(310-2)를 전기 적으로 제어하도록 설계될 수 있다. 다양한 실시 예에서, 제 2 방향으로 볼 때, 리시버를 위한 관통 홀은 적어도 하나의 광 센서 를 위한 광 투과 영역(393, 394) 및 카메라를 위한 광 투과 영역 또는 관통 홀 사이에 배치될 수 있다. 다양한 실시 예에 따르면, 제 2 방향으로 볼 때, 적어도 하나의 센서를 위한 광 투과 영역(393, 394)은 발 광 요소를 위한 광 투과 영역 및 리시버를 위한 관통 홀 사이에 배치될 수 있다. 다양한 실시 예에 따르면, 전자 장치는 소프트웨어 홈 버튼을 디스플레이를 통해 표시할 수 있다. 제 어 회로(예: 프로세서)는 제 2 베젤 영역(370-2) 근처(예: 약 20 mm 이내)에 소프트웨어 홈 버튼을 표시할 수 있다. 소프트웨어 홈 버튼은 제 1 영역의 c 엣지(360-3) 및 d 엣지(360-4) 가운데에 표시될 수 있 다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제어 회로는 다양한 다른 위치에 소프트웨어 홈 버튼을 표시할 수도 있다. 다양한 실시 예에 따르면, 제어 회로는 사용자 환경 설정(user preference), 실행된 어플리 케이션(또는, 모드) 등에 따라 소프트웨어 홈 버튼의 표시 위치를 결정할 수 있다. 소프트웨어 홈 버튼이 터치 입력 또는 호버링 입력에 의해 선택되면, 제어 회로(예: 프로세서)는 메인 홈 화면(main home screen)을 디스플레이를 통하여 표시할 수 있다. 메인 홈 화면은 전자 장치의 전원을 켰을 때 디스플레이에 표시되는 첫 화면일 수 있다. 다수의 홈 화면들이 전환 가능한 페이지 형태로 제공될 때, 메인 홈 화면은 어플리케이션들을 실행하기 위한 아이콘들, 시간, 날짜 등을 포함할 수 있다. 다양한 실시 예에 따르 면, 홈 화면은 배터리 충전 상태, 수신 신호의 세기, 또는 현재 시간과 같은 전자 장치의 상태를 표시할 수 있다. 다른 실시 예에 따르면, 소프트웨어 홈 버튼이 선택되면, 제어 회로는 전자 장치를 슬립 모 드(sleep mode) 또는 저 전력 모드로 진입시킬 수 있다. 슬립 모드 또는 저 전력 모드에서, 제어 회로는 외부로 부터 무선 신호에 대한 청취를 주기적으로 실행하는 등의 설정된 기본적인 동작들만을 이행할 수 있다. 슬립 모 드 또는 저 전력 모드에서, 제어 회로는 적어도 하나의 요소(예: 디스플레이)를 비활성하는 동작을 포함할 수 있다. 슬립 모드 또는 저 전력 모드는 제어 회로의 적어도 일부를 비활성화하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 소프트웨어 홈 버튼이 선택되면, 제어 회로는 슬립 모드 또는 저 전력 모드에서 웨이크 업 모드(wake-up-mode)로 전환할 수 있다. 예를 들어, 웨이크 업 모드에서, 제어 회로는 디스플레이를 활성화활 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 2 베젤 영역(370-2)을 확장시켜 설계하는 경우, 전자 장치 는 제 2 베젤 영역(370-2)에 정렬된 위치에 실장되는 다양한 전자 부품들(이하, '제 2 부품')을 포함할 수 도 있다. 일 실시 예에 따르면, 제 2 부품은 도시하지 않은 하드웨어 홈 버튼을 포함할 수 있다. 하드웨어 홈 버튼은 소프트웨어 홈 버튼을 대체할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 홈 버튼을 통한 입 력에 따라 제 2 커버(310-2)를 전기적으로 제어하도록 설계될 수 있다. 다양한 실시 예에 따르면, 사이드 부재(310-3)는 다양한 전자 부품들을 위한 관통 홀들을 포함할 수 있다. 예를 들어, 사이드 부재(310-3)은 스피커에 정렬된 관통 홀을 포함할 수 있다. 사이드 부재(310-3)는 마이크로 폰에 정렬된 관통 홀을 포함할 수 있다. 사이드 부재(310-3)는 커넥터에 정렬된 관통 홀들(예: USB 커넥터 를 위한 관통 홀, 이어 플러그를 위한 관통 홀)을 포함할 수 있다. 사이드 부재(310-3)는 스타일러스 의 삽입을 위한 관통 홀을 포함할 수 있다. 사이드 부재(310-3)는 버튼들(3861, 3871)의 설치를 위한 관통 홀(386, 387) 등을 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 스타일러스의 탈착, 버튼들 (3861, 3871)을 통한 입력 등에 따라 제 2 커버(310-2)를 전기적으로 제어하도록 설계될 수 있다. 다양한 실시 예에 따르면, 제 2 커버(310-2)는 다양한 전자 부품들을 위한 관통 홀들을 포함할 수 있다. 예를 들어, 제 2 커버(310-2)는 카메라(또는, 후방 카메라(rear facing camera)가 결합되는 관통 홀을 포함할 수 있다. 제 2 커버(310-2)는 플래시 및 광 센서(예: 심박 측정 센서)가 결합되는 관통 홀 를 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 카메라로부터의 이미지 데이터 또 는 광 센서를 통한 검출 값을 기초로 제 2 커버(310-2)를 전기적으로 제어하도록 설계될 수 있다. 다양한 실시 예에 따르면, 전자 장치(3000는 광 센서로부터의 검출 값을 기초로 제 2 커버(310-2)를 전기적으로 제어 하도록 설계될 수도 있다. 다양한 실시 예에 따르면, 전자 장치는 그 제공 형태에 따라 다양한 요소들(또는 모듈들)을 더 포함할 수 있다. 이러한 구성 요소들은 디지털 기기의 컨버전스(convergence) 추세에 따라 변형이 매우 다양하여 모두 열 거할 수는 없으나, 상기 언급된 구성 요소들과 동등한 수준의 구성 요소가 전자 장치에 추가로 더 포함될 수 있다. 다양한 실시 예에 따른 전자 장치는 그 제공 형태에 따라 상기한 구성 요소에서 특정 구성 요소 들이 제외되거나 다른 구성 요소로 대체될 수도 있음은 물론이다. 도 5는 다양한 실시 예에 따른 전자 커버를 포함하는 전자 장치의 단면도를 도시한다. 도 5를 참조하면, 전자 장치는 제 1 커버(510-1), 제 2 커버(510-2), 지지 구조물(510-3), 디스플레이 , PCB(printed circuit board) 및 배터리를 포함할 수 있다. 단면에서 볼 때, 제 1 커버(510-1)는 제 12 방향으로 양쪽 단부들이 휘어진 형태의 곡형부들(510-12a, 510-12b)을 포함하는 플레이트일 수 있다. 제 1 커버(510-1)는 양쪽 곡형부들(510-12a, 510-12b) 사이의 부분 (이하, 중간부(510-11))은 대체적으로 평평할 수 있다. 제 1 커버(510-1)의 양쪽 곡형부들(510-12a, 510- 12b)은 서로 대칭적인 형태일 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 1 커버(510-1)의 양쪽 곡형부들(510-12a, 510-12b)은 서로 다른 형태로 설계될 수도 있다. 중간부(510-11)는 제 11 방향(예: 제 12 방향의 반대 방향)으로 향하는 전자 장치의 외면(예: 도 3a의 제 1 면)을 형성 할 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 1 커버(510-1)는 한쪽에만 곡형부를 가지도록 설 계될 수도 있다. 디스플레이는 제 1 커버(510-1)의 적어도 일부를 따라 배치될 수 있다. 일 실시 예에 따르면, 디스플레이 는 제 12 방향으로 양끝이 휘어진 형태의 곡형부들(530a, 530b)을 포함할 수 있다. 제 1 커버 (510-1)가 전자 장치에 결합되면, 제 1 커버(510-1)는 전자 장치의 외면을 형성하는 바깥 면(510- 13a)과, 그 반대 편의 안쪽 면(510-13b)을 포함할 수 있다. 일 실시 예에 따르면, 디스플레이는 OCA(optical clear adhesive)) 등을 이용하여 제 1 커버(510-1)의 안쪽 면(510-13b)에 결합될 수 있다. 다양한 실시 예에 따르면, 디스플레이는 가요성을 가질 수 있다. 일 실시 예에 따르면, 디스플레이는 터치 입력 또는 호버링 입력을 위한 도전성 패턴을 포함할 수 있 다. 예를 들어, 도전성 패턴은 알루미늄(Al), 구리(Cu), 은(Ag), 그래핀(grapheme), ITO(indium tin oxide) 또는 IZO(indium zinc oxide) 등을 포함할 수 있다. 다양한 실시 예에 따르면, 디스플레이는 도전 성 패턴을 포함하는 OCTA(on-cell TSP(touch screen panel) AMOLED)) 패널일 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 디스플레이는 전자 펜을 위한 도전성 패턴(예: 펜 센서 또는 디지타이저)를 포함할 수도 있다. 제 2 커버(510-2)는 제 1 커버(510-1)의 반대 편에 배치되고, 제 12 방향으로 향하는 전자 장치의 외면(예: 도 3b의 제 2 면)을 형성할 수 있다. 일 실시 예에 따르면, 제 2 커버(510-2)는 대체적으 로 평평한 플레이트일 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 1 커버(510-2)는 한쪽 또는 양쪽이 제 11 방향으로 휘어진 형태의 곡형부를 포함하는 형태로 설계될 수도 있다. 지지 구조물(예: 브래킷(bracket))(510-3)은 제 1 커버(510-1), 제 2 커버(510-2), 디스플레이, PCB(printed circuit board) 및 배터리 등의 요소들이 결합되는 부분일 수 있다. 지지 구조물(510- 3)은 요소들과의 결합을 위하여 형태로 설계되고, 금속 또는 비금속 등의 다양한 물질을 포함할 수 있다. 도시 하지 않았으나, 요소들은 지지 구조물(510-3)에 볼트 체결, 본딩(bonding), 스냅 핏(snap-fits) 등의 다양한 수 단을 이용하여 지지 구조물(510-3)에 결합될 수 있다. 요소들이 지지 구조물(510-3)에 결합되면, 전자 장치 의 내구성(예: 비틀림 강성(torisonal rigidity))은 개선될 수 있다. 일 실시 예에 따르면, 지지 구조물 (510-3)의 일부(510-3a, 510-3b)는 외부로 노출되고, 제 1 커버(510-1) 및 제 2 커버(510-2) 사이를 매끄럽게 연결하는 외면을 제공할 수 있다. 일 실시 예에 따르면, 지지 구조물(510-3) 및 제 2 커버(510-2) 사이에는 공간이 있고, PCB 및 배 터리(또는, 배터리 팩)는 이 공간에 배치될 수 있다. PCB는 전자 장지의 다양한 동작에 관한 다수의 부품들 및 이들을 전기적으로 연결하는 신호선들 또는 패드(pads) 등을 포함하는 기판을 포함할 수 있다. 다양한 실시 예에 따르면, PCB는 하나 이상의 프로세서(예: AP(application processor) 등), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터 또는 모터 등에 전기적으로 연결되거나, 이들 중 적어도 일부 를 포함할 수 있다. 일 실시 예에 따르면, 제 2 커버(510-2)(예: 도 3b의 제 2 커버(310-2))는 도 1a 및 1b의 전자 커버를 포 함할 수 있고, 이에 대한 자세한 설명은 생략한다. 제 2 커버(510-2)는 PCB에 전기적으로 연결될 수 있다. 제 2 커버(510-2)가 전자 장치에 결합되면, 제 2 커버(510-2)는 전자 장치의 외면을 형성하는 바깥 면(510-23a)과, 그 반대 편의 안쪽 면(510-23b)을 포함할 수 있다. 일 실시 예에 따르면, 제 2 커버(510- 2)는 안쪽 면(510-23b)에 배치되는 적어도 하나의 컨택(contact)(510-2d)을 포함할 수 있다. 제 2 커버(510- 2)의 적어도 하나의 컨택(510-2d)은 PCB에 형성된 적어도 하나의 컨택(540-2d)에 전기적으로 연결될 수 있 다. 일 실시 예에 따르면, 전자 장치는 컨택들(510-2d, 540-2d) 사이를 전기적으로 연결하는 도전 부재 (예: FPCB(flexible printed circuit board))를 포함할 수 있다. 다양한 실시 예에 따르면, 제 2 커버(510-2)가 전자 장치에 결합될 때, 도전 부재는 컨택들(510-2d, 540-2d) 사이를 전기적으로 연결하는 가요성 도전 부재(flexible conductive member)(또는, 탄성을 가지는 도전성 연결 부재)를 포함할 수 있다. 예 를 들어, 가요성 도전 부재는 C 클립(clip), 포고 핀(pogo-pin), 스프링, 도전성 포론 및 러버, 도전성 테이프 또는 쿠퍼(cooper) 커넥터 등을 포함할 수 있다. 가요성 도전 부재는 컨택들(510-2d, 540-2d) 간의 전기적 연결 을 개선할 수 있다. 다양한 실시 예에 따르면, 가요성 도전 부재는 PCB의 적어도 하나의 컨택(540-2d)에 설치되거나, 또는 제 2 커버(510-2)의 적어도 하나의 컨택(510-2d)에 설치될 수 있다. 다른 실시 예로, 도시하지 않았으나, 전자 장치는 지지 구조물(510-3) 및 제 2 커버(510-3)의 결합부 로 연장된 FPCB를 포함할 수 있다. FPCB의 일단부는 PCB에 전기적으로 연결되고, FPCB의 타단부는 컨택 형태로 지지 구조물(510-3)에 배치될 수 있다. 제 2 커버(510-2)가 전자 장치에 결합될 때, 제 2 커 버(510-2)의 컨택과 FPCB의 컨택이 전기적으로 연결될 수 있다. 다양한 실시 예에 따르면, 제 2 커버(510-2)의 컨택과 FPCB의 컨택 사이에는 가요성 도전 부재가 배치될 수도 있다. 일 실시 예에 따르면, 제 2 커버(510-2)는 다수의 영역들을 포함할 수 있다. 일 실시 예에 따르면, 다수의 영역 들은 줄 구조(striped structure)로 배치될 수 있다. 도 1a, 1b 및 1c를 다시 참조하면, 제 2 커버(510-2)는 적어도 하나의 색상을 가지는 제 2 레이어를 포함하고, 외부 광은 제 2 레이어에서 반사되어 외부로 방출될 수 있다. 일 실시 예에 따르면, 제 2 레이어는 다수의 영역들을 포함하고, 영역별로 색상을 가질 수 있다. 일 실시 예에 따르면, 제 2 레이어의 다수의 영역들은 줄 구조로 배치될 수 있다. 일 실시 예에 따르면, 제 2 커버(510-2)는 반사 광이 외부로 통과되는 양을 조절하기 위한 제 1 레이어를 포함할 수 있 다. 일 실시 예에 따르면, PCB에 포함된 제어 회로(예: 프로세서)가 제 2 커버(510-2)를 전기적으로 제어 하면, 제 1 레이어의 영역들에 대한 광 투과율이 선택적으로 조절될 수 있다. 일 실시 예에 따르면, 제 1 레이어의 다수의 영역들은 줄 구조로 배치될 수 있다. 제 1 레이어의 다수의 영역들에 대한 광 투과 율이 개별적으로 조절됨으로써, 제 2 커버(510-2)의 다양한 표현(예: 색상, 농도, 깊이감, 패턴 등)이 사용자에 게 보일 수 있다. 도 6은 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블럭도이다. 도 6을 참조하면, 네트워크 환경 에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신)를 통하여 전자 장치 또는 서버와 통신 할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 도 3a 및 3b의 전자 장치 또는 도 5의 전자 장치일 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 입력 장치, 음향 출력 장치, 표시 장치, 오디오 모듈, 센서 모듈, 인터페이스, 햅틱 모듈, 카메라 모듈, 전 력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 및 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치에는, 이 구성 요소들 중 적어도 하나(예: 표시 장치 또는 카메 라 모듈)가 생략되거나 다른 구성 요소가 추가될 수 있다. 어떤 실시 예에서는, 예를 들면, 표시 장치 (예: 디스플레이)에 임베디드된(embedded) 센서 모듈(예: 지문 센서, 홍채 센서, 또는 조도 센서)의 경우와 같이, 일부의 구성 요소들이 통합되어 구현될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 구동하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성 요소(예: 하드웨어 또는 소프트웨어 구성 요소)을 제어할 수 있고, 다양한 데 이터 처리 및 연산을 수행할 수 있다. 프로세서는 다른 구성 요소(예: 센서 모듈 또는 통신 모듈 )로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드하여 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서), 및 이와는 독립적으로 운영되고, 추가적으로 또는 대체적으로, 메인 프로세서 보다 저전력을 사용하거나, 또는 지정된 기능에 특화된 보조 프로세서(예: 그래픽 처리 장치, 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 여기서, 보조 프로세서 는 메인 프로세서와 별개로 또는 임베디드되어 운영될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(inactive)(예: 슬립) 상태에 있는 동안 메 인 프로세서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 수행) 상태에 있는 동안 메 인 프로세서와 함께, 전자 장치의 구성 요소들 중 적어도 하나의 구성 요소(예: 표시 장치, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성 요소(예: 카메라 모듈 또는 통신 모듈)의 일부 구성 요소로서 구현될 수 있다. 메모 리는, 전자 장치의 적어도 하나의 구성 요소(예: 프로세서 또는 센서 모듈)에 의해 사용되 는 다양한 데이터, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 저장할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있 다. 프로그램은 메모리에 저장되는 소프트웨어로서, 예를 들면, 운영 체제, 미들웨어 또는 어 플리케이션을 포함할 수 있다. 다양한 실시 예에 따르면, 프로그램은 전자 커버를 전기적으로 제어하 기 위한 다양한 동작 흐름 또는 인스트럭션들을 저장하도록 설계될 수 있다. 다양한 실시 예에 따르면, 전자 커 버는 도 1a 및 1b의 전자 커버, 도 3의 제 2 커버(310-2) 또는 도 5의 제 2 커버(510-2)를 포함할 수 있 다. 입력 장치는, 전자 장치의 구성 요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신하기 위한 장치로서, 예를 들면, 마이크, 마우스, 또는 키보드를 포함할 수 있다. 음향 출력 장치는 음향 신호를 전자 장치의 외부로 출력하기 위한 장치로서, 예를 들면, 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용되는 스피커와 전화 수신 전용으로 사용되는 리시버를 포함할 수 있다. 일 실시 예에 따르면, 리시버는 스피커와 일체 또는 별도로 형성될 수 있다. 표시 장치는 전자 장치의 사용자에게 정보를 시각적으로 제공하기 위한 장치로서, 예를 들면, 디스플 레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일 실시 예에 따르면, 표시 장치는 터치 회로(touch circuitry) 또는 터치에 대한 압력의 세기를 측정할 수 있는 압력 센서를 포함할 수 있다. 일 실시 예에 따르면, 표시 장치는 도 5의 디스플레이를 포함할 수 있다. 일 실시 예에 따르면, 표시 장치는 전자 장치의 외관 적어도 일부를 형성하는 전자 커버(또는, 디지 털 커버)(예: 도 3b의 제 2 커버(310-2) 또는 도 5의 제 2 커버(510-2))를 포함할 수 있다. 일 실시 예에 따르 면, 전자 커버는 도 1a 및 1b의 전자 커버의 적어도 일부를 포함할 수 있다. 외부 광이 전자 커버에 반사 되어 사용자의 눈에 들어올 때, 전자 커버에 의한 표현이 사용자에게 보일 수 있다. 일 실시 예에 따르면, 전자 커버는 적어도 하나의 색상을 가지는 하위 레이어를 포함하고, 외부 광은 하위 레이어에서 반사되어 외부로 방 출될 수 있다. 일 실시 예에 따르면, 하위 레이어는 다수의 영역들을 포함하고, 영역별로 색상을 가질 수 있다. 일 실시 예에 따르면, 전자 커버는, 반사 광이 외부로 통과되는 양을 조절하기 위한 상위 레이어를 포함할 수 있다. 일 실시 예에 따르면, 프로세서가 전자 커버를 전기적으로 제어하면, 상위 레이어의 다수의 영역들 에 대한 광 투과율이 선택적으로 조절될 수 있다. 다양한 실시 예에 따르면, 프로세서는 메모리에 저 장된 프로그램을 기초로 전자 커버를 전기적으로 제어할 수 있다. 상위 레이어의 다수의 영역들에 대한 광 투과율이 개별적으로 조절됨으로써, 전자 커버의 다양한 표현(예: 색상, 농도, 깊이감, 패턴 등)이 사용자에게 보일 수 있다. 오디오 모듈은 소리와 전기 신호를 쌍방향으로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈(67 0)은, 입력 장치를 통해 소리를 획득하거나, 음향 출력 장치, 또는 전자 장치와 유선 또는 무선 으로 연결된 외부 전자 장치(예: 전자 장치(예: 스피커 또는 헤드폰))를 통해 소리를 출력할 수 있다. 다 양한 실시 예에 따르면, 프로세서가 전자 커버(예: 도 1a 및 1b의 100)를 전기적으로 제어할 때, 오디오 모듈은 프로세서의 제어 하에 다양한 음향 신호를 음향 출력 장치로 출력하도록 설계될 수 있다. 다양한 실시 예에 따르면, 오디오 모듈은 전자 커버에 대한 전기적 제어를 유발하기 위한 다양한 소 리 입력을 수집할 수 있다. 센서 모듈은 전자 장치의 내부의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 색상 센서(예: RGB(red, green, blue) 센서), IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 조도 센서, 또는 UV(ultra violet) 센서 중 적어도 하 나를 포함할 수 있다. 다양한 실시 예에 따르면, 센서 모듈은, 예를 들면, 후각(e-nose) 센서, 일렉트로마 이오그라피(EMG) 센서, 일렉트로엔씨팔로그램(EEG) 센서, 일렉트로카디오그램(ECG) 센서, IR(infrared) 센서, 홍채 센서 또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있 는 동안, 센서 모듈을 제어할 수도 있다. 다양한 실시 예에 따르면, 센서 모듈은 전자 커버(예: 도 1a 및 1b의 100)에 대한 전기적 제어를 유발하기 위한 다양한 검출 값을 획득할 수 있다. 인터페이스는 외부 전자 장치(예: 전자 장치)와 유선 또는 무선으로 연결할 수 있는 지정된 프로토콜 을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는 HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 다양한 실시 예에 따르면, 인터페이스는 전자 커버(예: 도 1a 및 1b의 100) 및 요소들(예: 프로세서) 간의 신호 흐름에 관한 전자 커버 인터페이스를 포함할 수 있다. 연결 단자는 전자 장치와 외부 전자 장치(예: 전자 장치)를 물리적으로 연결시킬 수 있는 커넥 터, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 다양한 실시 에에 따르면, 연결 단자는 전자 커버(예: 도 1a 및 1b의 100)가 전자 장치에 결합될 때, 요소들(예: 프로세서, 전력 관리 모듈 등) 및 전자 커버 간의 전기적 연결을 위한 요소들(예: 컨택들)을 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또 는 전기 자극 장치를 포함할 수 있다. 다양한 실시 예에 따르면, 프로세서가 전자 커버(예: 도 1a 및 1b의 100)를 전기적으로 제어할 때, 햅틱 모듈은 프로세서의 제어 하에 다양한 햅틱 효과에 출력하도록 설 계될 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈, 이미지 센서, 이미지 시그널 프로세서, 또는 플래시를 포함할 수 있다. 다양한 실시 예에 따르면, 카메라 모듈의 동작을 기초로, 프로세서는 설정된 프로그램을 기초로 전자 커버(예: 도 1a 및 1b의 100)를 전기적으로 제어할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리하기 위한 모듈로서, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구성될 수 있다. 다양한 실시 예에 따르면, 전력 관리 모듈 은 프로세서의 제어 하에 전자 커버(예: 도 1a 및 1b의 100)에 대한 전력을 관리할 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충 전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 전력 관리 모듈은 배터 리의 전력을 이용하여 요소들(예: 전자 커버)에 대한 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모듈은 전자 커버(예: 도 1a 및 1b의 100)를 전기적으로 제어하기 위한 회로(이하, 커버 제어 회로)에 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 커버 제어 회로의 적어도 일 부는 전자 커버에 포함될 수 있다. 다양한 실시 예에 따르면, 커버 제어 회로의 적어도 일부는 전자 장치 에 포함될 수도 있다. 예를 들어, 커버 제어 회로의 적어도 일부는 전력 관리 모듈에 포함될 수 있다. 예를 들어 커버 제어 회로의 적어도 일부는 프로세서에 포함될 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버)간의 유선 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되는, 유선 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통신 모듈은 무선 통신 모듈 또는 유선 통신 모듈을 포함하고, 그 중 해당하는 통신 모듈을 이용하여 제 1 네트워크(예: 블루투스, WiFi direct 또는 IrDA(infrared data association) 같은 근거리 통신 네트워크) 또는 제 2 네트워 크(예: 셀룰러 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워 크)를 통하여 외부 전자 장치와 통신할 수 있다. 상술한 여러 종류의 통신 모듈은 하나의 칩으로 구현되거 나 또는 각각 별도의 칩으로 구현될 수 있다. 다양한 실시 예에 따르면, 무선 통신 모듈는 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈 등을 포함할 수 있다. 예를 들어, 셀룰러 통신 모듈은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for MobileCommunications) 등 중 적어도 하나일 수 있다. 예를 들어, 근거리 무선 통신 모듈은, WiFi(wireless fidelity), LiFi(light fidelity), 블루투스, 블루투스 저전력(BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에 어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 예를 들어, GNSS 통신 모듈은 GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System (이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system일 수 있다. 다양한 실시 예에 따르면, 유선 통신 모듈은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨 터 네트워크(예: LAN(local area network) 또는 WAN(wide area network), 인터넷, 또는 텔레폰 네트워크 중 적 어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 가입자 식별 모듈에 저장된 사용자 정보를 이용하여 통신 네 트워크 내에서 전자 장치를 구별 및 인증할 수 있다. 다양한 실시 예에 따르면, 무선 통신 모듈의 동작을 기초로, 프로세서는 전자 커버(예: 도 1a 및 1b 의 100)를 전기적으로 제어할 수 있다. 안테나 모듈은 신호 또는 전력을 외부로 송신하거나 외부로부터 수신하기 위한 하나 이상의 안테나들을 포 함할 수 있다. 일 실시 예에 따르면, 통신 모듈(예: 무선 통신 모듈)은 통신 방식에 적합한 안테나를 통하여 신호를 외부 전자 장치로 송신하거나, 외부 전자 장치로부터 수신할 수 있다. 상기 구성 요소들 중 일부 구성 요소들은 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input/output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))를 통 해 서로 연결되어 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 전자 장치(602, 604) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일 부는 다른 하나 또는 복수의 외부 전자 장치에서 실행될 수 있다. 일 실시 예에 따르면, 전자 장치가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자 체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 외부 전자 장치에게 요청할 수 있다. 상기 요청을 수신한 외부 전자 장치는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치 로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨 팅 기술이 이용될 수 있다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 모듈은 ASIC(application-specific integrated circuit)으로 구성될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)(예: 내장 메모리 또는 외장 메모리)에 저장된 명령어를 포함하는 소프트웨어(예: 프 로그램)로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동 작이 가능한 장치로서, 개시된 실시 예들에 따른 전자 장치(예: 전자 장치)를 포함할 수 있다. 상기 명령 이 프로세서(예: 프로세서)에 의해 실행될 경우, 프로세서가 직접, 또는 상기 프로세서의 제어 하에 다른 구성 요소들을 이용하여 상기 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의 해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장매체가 신호(signal)를 포함하지 않으며 실재 (tangible)한다는 것을 의미할 뿐 데이터가 저장 매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 일시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있다. 온라인 배포의 경 우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구성될 수 있으 며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로그램)은 하나 의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행 할 수 있다. 다양한 실시 예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 도 7은 일 실시 예에 따른 전자 커버를 포함하는 전자 장치의 블록도이다. 도 7을 참조하면, 전자 장치는 전자 커버 및 이에 전기적으로 연결되는 회로를 포함할 수 있다. 전자 커버는 전자 장치의 외관의 적어도 일부를 형성할 수 있다. 다양한 실시 예에 따르면, 전자 장 치는 도 3a 및 3b의 전자 장치, 도 5의 전자 장치 또는 도 6의 전자 장치일 수 있다. 전 자 커버는 도 3b의 제 2 커버(310-2) 또는 도 5의 제 2 커버(510-2)일 수 있다. 일 실시 예에 따르면, 전 자 커버는 도 1a 및 1b의 전자 커버일 수 있다. 예를 들어, 외부 광이 전자 커버에 반사되어 사용자 의 눈에 들어올 때, 전자 커버에 의한 표현(representation)이 사용자에게 보일 수 있다. 일 실시 예에 따르면, 전자 커버는 적어도 하나의 색상을 가지는 하위 레이어(예: 도 1a의 제 2 레이어)를 포함하고, 외부 광은 하위 레이어에서 반사되어 외부로 방출될 수 있다. 일 실시 예에 따르면, 하위 레이어는 다수의 영역들을 포함하고, 영역별로 색상을 가질 수 있다. 일 실시 예에 따르면, 전자 커버는, 반사 광이 외부로 통과되는 양을 조절하기 위한 상위 레이어(예: 도 1a의 제 1 레이어)를 포함할 수 있다. 일 실시 예에 따 르면, 제어부가 전자 커버를 전기적으로 제어하면, 상위 레이어의 다수의 영역들에 대한 광 투 과율이 선택적으로 조절될 수 있다. 상위 레이어의 다수의 영역들에 대한 광 투과율이 개별적으로 조절됨 으로써, 전자 커버의 다양한 표현(예: 색상, 농도, 깊이감, 패턴 등)이 사용자에게 보일 수 있다. 일 실시 예에 따르면, 회로는 저장부, 배터리 및 제어부를 포함할 수 있다. 저장부는 전자 장치를 운용하는데 필요한 다양한 기본 운용 체제 및 다양한 사용자 기능에 해당하는 데이터, 응용 프로그램 또는 알고리즘 등을 저장할 수 있다. 다양한 실시 예에 따르면, 저장부는 도 6의 메모리의 적어도 일부를 포함할 수 있다. 일 실시 예에 따르면, 제어부(예: 도 6의 프로세서)는 저장부에 전기적으로 연결되고, 저장부에 포함된 인스트럭션들에 따라 전자 커버에 관련한 다양한 동작을 이행 할 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 전자 장치는 도 6의 표시 장치, 센서 모 듈, 카메라 모듈, 또는 통신 모듈 등의 요소들을 더 포함하도록 설계될 수 있고, 저장부는 이 요소들에 관한 다양한 동작 관련 인스트럭션들을 포함할 수 있다. 일 실시 예에 따르면, 저장부는 표현 선택 인스트럭션을 저장할 수 있다. 표현 선택 인스트럭션 은 사용자 입력을 기초로 전자 커버를 통하여 사용자에게 보이고자 하는 표현(이하, 커버 표현 또는 표현 모드)을 선택하는 루틴을 포함할 수 있다. 다양한 실시 예에 따르면, 표현 모드의 선택에 관한 사용자 입력은 입력 장치(예: 도 6의 650)에서 생성된 것일 수 있다. 입력은 표시 장치(예: 도 6의 660)에서 생성된 터치 입력, 호버링 입력, 압력 입력 등을 포함할 수 있 다. 예를 들어, 제어부는 전자 장치의 화면을 통하여 표현 모드에 관한 리스트(예: 색상 리스트, 투 명도 리스트, 패턴 리스트 등)를 표시할 수 있다. 리스트 중 사용자 입력에 의해 적어도 하나의 리스트 엔트리 가 선택될 수 있다. 제어부는 사용자 입력에 의하여 선택된 리스트 엔트리에 해당하는 표현 모드를 선택할 수 있다. 다양한 실시 예에 따르면, 표현 모드의 선택에 관한 사용자 입력은 오디오 모듈(예: 도 6의 670)을 통하여 획득 한 소리에 관련한 입력을 포함할 수 있다. 예를 들어, 제어부는 오디오 모듈로부터 음성 입력을 감지하고, 감지한 음성 입력에 따른 해당 표현 모드를 선택할 수 있다. 다양한 실시 예에 따르면, 표현 선택 인스트럭션은, 실행된 어플리케이션(예: 도 6의 어플리케이션(64 6))을 기초로 표현 모드를 선택하는 루틴을 포함할 수 있다. 예를 들어, 멀티미디어 재생 어플리케이션을 통하 여 컨텐트(content)(예: 음악)가 재생될 때, 제어부는 해당 표현 모드를 선택할 수 있다. 예를 들어, 카메라(예: 도 3b의 3881)를 이용하는 카메라 어플리케이션이 실행되면, 제어부는 해당 표현 모드를 선택할 수 도 있다. 다양한 실시 예에 따르면, 표현 선택 인스트럭션은, 트리거에 따라, 미리 정해 놓은 조건(condition)을 만족하거나 어떤 동작이 수행되면 자동적으로 표현 모드를 선택하는 루틴을 포함할 수 있다. 다양한 실시 예에 따르면, 표현 모드의 선택에 관한 트리거는 통신 모듈(예: 도 6의 690)을 통한 신호에 관련하 는 것일 수 있다. 일 실시 예에 따르면, 표현 모드의 선택에 관한 트리거는 외부 장치(예: 도 6의 602, 604 또 는 608)로부터 수신되는 입력에 관한 것일 수 있다. 예를 들어, 호 또는 메시지가 수신될 때, 제어부는 해 당 표현 모드를 선택할 수 있다. 다른 실시 예에 따르면, 표현 모드의 선택에 관한 트리거는 통신 모듈(예: GPS)을 통하여 획득한 위치 정보(예: 장소)에 관한 것일 수 있다. 예를 들어, 제어부는 통신 모듈을 통하 여 현재의 위치 정보를 획득하고, 획득한 위치 정보에 따른 표현 모드를 선택할 수 있다. 다양한 실시 예에 따 르면, 표현 모드의 선택에 관한 트리거는 통신 모듈을 통하여 획득하는 날씨 정보에 관한 것일 수 있다. 예를 들어, 제어부는 통신 모듈을 통하여 현재의 날씨 정보를 획득하고, 획득한 날씨 정보에 따른 표현 모드를 선택할 수 있다. 다양한 실시 예에 따르면, 표현 모드의 선택에 관한 트리거는 시간(예: hour, day, month, year)에 관한 것일 수 있다. 예를 들어, 현재의 시간이 설정된 시간(예: 오전, 오후, 또는 사용자 설정 시간)에 포함되면, 제어부 는 해당 표현 모드를 선택할 수 있다. 예를 들어, 현재의 시간이 일정에 포함된 시간에 도래할 때 제어부 는 해당 표현 모드를 선택할 수 있다. 예를 들어, 현재의 시간이 알람에 포함된 시간에 도래할 때 제어부 는 해당 표현 모드를 선택할 수 있다. 예를 들어, 현재 시간이 미리 알림에 포함된 시간에 도래할 때 제어 부는 해당 표현 모드를 선택할 수 있다. 다양한 실시 예에 따르면, 표현 모드의 선택에 관한 트리거는 센서 모듈(예: 도 6의 676)로부터 획득한 검출 값 을 기반으로 할 수 있다. 예를 들어, 제어부는 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가 속도 센서, 그립 센서, 근접 센서, 색상 센서(예: RGB(red, green, blue) 센서), IR(infrared) 센서, 생체 센 서, 온도 센서, 습도 센서, 조도 센서, 또는 UV(ultra violet) 센서로부터 획득한 검출 값을 기초로 해당 표현 모드를 선택할 수 있다. 예를 들어, 제어부는 후각(e-nose) 센서, 일렉트로마이오그라피(EMG) 센서, 일렉 트로엔씨팔로그램(EEG) 센서, 일렉트로카디오그램(ECG) 센서, IR(infrared) 센서, 홍채 센서 또는 지문 센서 등 으로부터 획득한 검출 값을 기초로 해당 표현 모드를 선택할 수도 있다. 예를 들어, 제어부는 조도 센서로 부터 획득한 조도 값에 따라 해당 표현 모드를 선택할 수 있다. 일 실시 예에 따르면, 저장부는 표현 모드 정보를 저장할 수 있다. 일 실시 예에 따르면, 표현 모드 정보는 색상 표현, 투명도 표현, 패턴 표현 등으로 조합된 다양한 표현 모드들에 관한 정보를 포함할 수 있다. 일 실시 예에 따르면, 표현 선택 인스트럭션에 따라 제어부가 선택하는 표현 모드는 다양한 표현 모드들 중 적어도 일부일 수 있다. 일 실시 예에 따르면, 저장부는 커버 구동 정보를 저장할 수 있다. 커버 구동 정보는 다양한 표현 모드를 위한 전자 커버의 설정들(이하, 커버 설정)을 포함할 수 있다. 표현 선택 인스트럭션에 따라, 제어부는 선택된 표현 모드에 따른 해당 커버 설정을 선택할 수 있다. 일 실시 예에 따르면, 저장부는 영역 선택 인스트럭션을 저장할 수 있다. 영역 선택 인스트럭션 은 선택된 커버 설정을 기초로 전자 커버의 다수의 영역들 중 적어도 하나를 선택하는 루틴을 포함 할 수 있다. 일 실시 예에서, 도 1a 및 1b를 참조하면, 각 영역은 색상 필터(1211-N)에 정렬된 제 2 전극(1121- N))을 포함할 수 있다. 영역 선택 인스트럭션에 따라, 제어부는 선택된 영역에 해당하는 제 2 전극 (1121-N)을 선택할 수 있다. 일 실시 예에 따르면, 저장부는 전력 제어 인스트럭션을 저장할 수 있다. 전력 제어 인스트럭션 은 선택된 적어도 하나의 영역에 대한 전력을 제어하는 루틴을 포함할 수 있다. 선택된 커버 설정을 기초 로, 제어부는 선택된 적어도 하나의 제 2 전극(1121-N) 및 제 1 전극 레이어에 대한 전력을 제어할 수 있다. 다양한 실시 예에 따르면, 해당 표현 모드에 따라, 적어도 하나의 영역에 대한 전기장의 세기는 조절 될 수 있다. 배터리는 제어부에 전기적으로 연결되고, 제어부는 배터리를 이용하여 전자 커버로 전력을 공급할 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제어부는 표현 선택 인스트럭션을 이행하는 파트, 영 역 선택 인스트럭션을 이행하는 파트, 또는 전력 제어 인스트럭션을 이행하는 파트로 구분될 수도 있다. 다양한 실시 예에 따르면, 제어부은 표현 선택 인스트럭션, 영역 선택 인스트럭션, 전 력 제어 인스트럭션, 표현 모드 정보 또는 커버 구동 정보 중 적어도 하나를 포함하도록 설 계될 수도 있다. 다양한 실시 예에 따르면, 전자 커버는, 예를 들어, 각 영역에 전기적으로 연결된 스위치들(예: 트랜지스 터들 또는 TFTs)을 가지는 커버 제어 회로를 포함하도록 설계될 수 있다. 커버 제어 회로는 제어부에 전기 적으로 연결되고, 제어부는 영역 선택 인스트럭션 및 전력 제어 인스트럭션에 따라 커버 제어 회로를 제어할 수 있다. 다른 실시 예에 따르면, 커버 제어 회로는 제어부에 포함되도록 설계될 수도 있다. 다양한 실시 예에 따르면, 커버 제어 회로는 회로에 포함되고, 제어부와는 분리된 요소로 설계 될 수도 있다(예: 도 6의 전력 관리 모듈). 다양한 실시 예에 따르면, 전자 장치는 그 제공 형태에 따라 다양한 요소들(또는 모듈들)을 더 포함할 수 있다. 이러한 구성 요소들은 디지털 기기의 컨버전스(convergence) 추세에 따라 변형이 매우 다양하여 모두 열 거할 수는 없으나, 상기 언급된 구성 요소들과 동등한 수준의 구성 요소가 전자 장치에 추가로 더 포함될 수 있다. 이는 본 기술 분야의 통상의 지식을 가진 자에겐 쉽게 이해될 수 있을 것이다. 본 발명의 일 실시 예에 따르면, 전자 커버(예: 도 1a의 100)는, 광 투과성 제 1 전극 레이어와, 상기 제 1 전극 레이어 아래에 배치되는 광 투과성 제 2 전극 레이어를 포함할 수 있다. 상기 전자 커버는 상 기 제 1 전극 레이어 및 제 2 전극 레이어 사이에 배치되고, 상기 제 1 전극 레이어 및 제 2 전 극 레이어에 전력이 제공될 때 발생된 전기장에 반응하는 액정을 포함하는 액정 레이어를 포함할 수 있다. 상기 전자 커버는 상기 제 2 전극 레이어 아래에 배치되고, 광 투과성 색상 물질을 포함하는 색상 레이어를 포함할 수 있다. 상기 전자 커버는 상기 색상 레이어 아래에 배치되고, 광 반사 물질을 포함하는 반사 레이어를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 색상 레이어(예: 도 1a의 121)는 줄 구조(striped structure)로 배치되는 다수의 색상 필터들(예: 도 1a의 1211)을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 다수의 색상 필터들(예: 도 1a의 1211)은 동일한 색상의 광 투과성 물질 을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 색상 레이어(예: 도 1a의 121)는 서로 다른 색상의 적어도 둘 이상의 색 상 필터들을 포함하는 일련의 세트가 반복 배열되는 구조를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 제 2 전극 레이어(예: 도 1a의 112)는 상기 다수의 색상 필터들에 정렬되고, 상기 줄 구조로 배치되는 다수의 전극들(예: 도 1a의 1121)을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 제 1 전극 레이어(예: 도 1a의 111)는 상기 다수의 전극들을 커버 하도록 연장된 공통 전극(common electrode)을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 전자 커버(예: 도 1의 100)는 상기 공통 전극 및 다수의 전극들(예: 도 1a의 1121)에 전기적으로 연결되고, 상기 공통 전극 및 다수의 전극들에 제공되는 전력의 세기를 조절하기 위한 다수의 스위치들을 더 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 스위치들은 TFTs(thin film transistors)을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 액정(예: 도 1a의 113a)은 상기 다수의 전극들(예: 도 1a의 1121)에 정렬 된 다수의 부분들(예: 도 1a의 113c)로 분리되어 있을 수 있다. 본 발명의 일 실시 예에 따르면, 상기 전자 커버(예: 도 1a의 100)는 상기 제 2 전극 레이어(예: 도 1a의 112) 및 색상 레이어(예: 도 1a의 121) 사이에 배치되는 광 투과성 레이어(예: 제 3 레이어)를 더 포함할 수 있 다. 본 발명의 일 실시 예에 따르면, 상기 전자 커버(예: 도 1a의 100)는 상기 제 1 전극 레이어(예: 도 1a의 111) 위에 배치되는 광 투과성 레이어(예: 도 1a의 제 4 레이어 또는 제 5 레이어)를 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치(예: 도 3a의 300, 도 5의 500, 도 6의 601 또는 도 7의 700)는, 제 1 방향(예: 도 3a의 30011)으로 향하는 제 1 면, 제 1 방향의 반대인 제 2 방향(예: 도 3b의 30021) 으로 향하는 제 2 면, 및 상기 제 1 면 및 제 2 면 사이를 둘러싸는 측면(예: 도 3a의3003)을 포함하는 하우징(예: 도 3a의 310)을 포함할 수 있다. 상기 전자 장치는 상기 하우징 내부에 배치 되고, 상기 제 1 면 및 측면의 적어도 일부를 따라 배치되는 디스플레이(예: 도 5의 530)를 포함할 수 있다. 상기 전자 장치는 상기 하우징 내부에 배치되고, 상기 제 2 면의 적어도 일부를 따라 배치 되는 전자 커버(예: 도 3b의 제 2 커버(310-2) 또는 도 5의 제 2 커버(510-2))를 포함할 수 있다. 상기 전자 장 치는 상기 디스플레이 및 전자 커버(310-2 또는 510-2)에 전기적으로 연결되는 전력 관리 모듈(예: 도 6의 688)을 포함할 수 있다. 상기 전자 커버(310-1 또는 510-2)는 상기 제 1 면 및 제 2 면 사이에 배 치되는 광 투과성 제 1 전극 레이어(예: 도 1a의 111)를 포함할 수 있다. 상기 전자 커버(310-1 또는 510-2)는 상기 제 1 면 및 제 1 전극 레이어 사이에 배치되는 광 투과성 제 2 전극 레이어(예: 도 1a의 112) 를 포함할 수 있다. 상기 전자 커버(310-1 또는 510-2)는 액정(예: 도 1a의 113a)을 포함하는 액정 레이어(예: 도 1a의 113)을 포함할 수 있다. 상기 액정 레이어는 상기 제 1 전극 레이어 및 제 2 전극 레이어 사이에 배치될 수 있다. 상기 액정 레이어의 액정(113a)은, 상기 전력 관리 모듈이 상기 제 1 전극 레이어 및 제 2 전극 레이어로 전력을 공급할 때 발생된 전기장에 반응할 수 있다. 상기 전자 커버는 상기 제 1 면 및 제 2 전극 레이어 사이에 배치되는 색상 레이어(예: 도 1a의 121)를 포함할 수 있다. 상기 색상 레이어는 광 투과성 색상 물질을 포함할 수 있다. 상기 전자 커버는 상기 제 1 면 및 색상 레이어 사이에 배치되는 반사 레이어(예: 도 1a의 122)를 포함할 수 있다. 상기 반 사 레이어는 광 반사 물질을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 색상 레이어(예: 도 1a의 121)는 줄 구조(striped structure)로 배치 되는 다수의 색상 필터들(예: 도 1a의 1211)을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 제 2 전극 레이어(예: 도 1a의 112)는, 상기 다수의 색상 필터들 에 정렬되는 다수의 전극들(예: 도 1a의 1211)을 포함할 수 있다. 상기 다수의 전극들은 상기 줄 구조로 배치될 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 제 1 전극 레이어(예: 도 1a의 111)는, 상기 다수의 전극들을 커버하도록 연장된 공통 전극을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 전자 장치는, 상기 공통 전극(예: 도 1a의 제 1 전극 레이어) 및 다수의 전극들(예: 도 1a의 1121)에 전기적으로 연결되는 스위치들을 포함할 수 있다. 상기 스위치들은, 상 기 공통 전극 및 다수의 전극들에 제공되는 전력을 조절할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 스위치들은 상기 전력 관리 모듈(예: 도 6의 688)에 포함되거나, 상 기 전자 커버(예: 도 3b의 제 2 커버(310-2) 또는 도 5의 제 2 커버(510-2))에 포함될 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 스위치들은 상기 전자 커버(예: 도 1a의 100)에 포함되는 TFTs(thin film transistors)일 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 액정(예: 도 1a의 113a)은, 상기 다수의 전극들(예: 도 1a의 1121)에 정렬된 다수의 부분들(예: 도 1a의 113c)로 분리되어 있을 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 상기 디스플레이(예: 도 5의 530), 전자 커버(예: 도 3b의 제 2 커버(310-2) 또는 도 5의 제 2 커버(510-2)) 및 전력 관리 모듈(예: 도 6의 688)에 전기적으로 연결되는 프로 세서(예: 도 6의 620 또는 도 7의 제어부)를 포함할 수 있다. 상기 프로세서는, 사용자 입력, 어플리케이 션의 실행, 또는 설정된 트리거에 적어도 일부 기반하여, 상기 다수의 전극들(예: 도 1a의 1121) 중 적어도 일 부에 공급하는 전력을 조절하도록 상기 전력 관리 모듈을 제어할 수 있다. 도 8은 일 실시 예에 따른 전자 커버를 포함하는 전자 장치에서 커버에 관한 동작 흐름을 도시한다. 다양한 실 시 예에 따르면, 전자 장치는 도 3a 및 3b의 전자 장치, 도 5의 전자 장치, 도 6의 전자 장치 또는 도 7의 전자 장치의 적어도 일부를 포함할 수 있다. 도 9a, 9b, 10, 11a, 11b, 11c, 11d, 12a, 12b, 12c, 13a, 13b, 13c, 14a, 14b, 15a, 15b 및 15c는 다양한 실시 예에 따른 도 8의 동작 흐름을 설명하기 위한 예시 도들이다. 도 8을 참조하면, 801 동작에서, 제어부(예: 도 7의 제어부 또는 도 6의 프로세서)(이하, 제어부 )는 사용자 입력 및/또는 어플리케이션의 실행에 적어도 일부 기반하여 표현 모드를 선택할 수 있다. 803 동작에서, 제어부는 선택된 표현 모드에 기반하여 전자 커버(예: 도 1a 및 1b의 100, 도 3b의 제 2 커 버(310-2) 또는 도 5의 제 2 커버(510-2))를 전기적으로 제어할 수 있다.일 실시 예에 따르면, 전자 장치는 다양한 표현 모드를 위한 커버 설정들(예: 도 7의 커버 구동 정보)을 포함할 수 있다. 제어부는 사용자 입력 및/또는 어플리케이션의 실행에 적어도 일부 기반하여 다수 개의 커버 설정들 중 해당 커버 설정을 선택할 수 있다. 일 실시 예에 따르면, 제어부는 선택된 커버 설정을 기 초로 전자 커버의 다수의 영역들 중 적어도 하나를 선택할 수 있다. 일 실시 예에서, 도 1a 및 1b를 참조하면, 각 영역은 색상 필터(1211-N)에 정렬된 제 2 전극(1121-N)을 포함할 수 있다. 제어부는 선택된 커버 설정 에 따라 해당 영역에 해당하는 제 2 전극(1121-N)을 선택할 수 있다. 제어부는, 선택된 커버 설정을 기초 로, 선택된 적어도 하나의 영역에 대한 전력을 제어할 수 있다. 전자 커버의 적어도 일부 영역에 대한 전력을 제어하는 803 동작은 전자 커버의 적어도 일부 영역에 대한 전기장을 제어하는 동작으로 정의될 수도 있다. 전 자 커버의 적어도 일부 영역에 대한 전력을 제어하는 803 동작은 전자 커버의 적어도 일부 영역에 대한 광 투과 율을 조절하는 동작으로도 정의될 수 있다. 일 실시 예에 따르면, 제어부는 사용자 입력을 기초로 표현 모드를 선택하고, 선택된 표현 모드에 따라 전 자 커버를 제어할 수 있다. 도 9a 및 9b는 다양한 실시 예에 따른 도 8의 동작 흐름을 설명하기 위한 예시 도이 다. 도 9a 및 9b의 전자 장치는 도 3a 및 3b의 전자 장치, 도 5의 전자 장치, 도 6의 전자 장 치 또는 도 7의 전자 장치의 적어도 일부를 포함할 수 있다. 도 9a를 참조하면, 전자 장치는 제 1 화면을 제공할 수 있다. 일 실시 예에 따르면, 제 1 화면은 'Digital CMF를 설정하시겠습니까'라는 안내 문구와, 'Digital CMF 설정'으로 표시되는 버튼을 포함할 수 있다. 'CMF' 단어는 'color material finishing'를 의미하는 것으로, 전자 커버의 표현 모드를 가리킬 수 있다. 제 1 화면은 전자 커 버의 설정을 위한 모드(이하, 커버 설정 모드)로 진입할 때 사용자를 안내하는 프롬프트 화면이라고 할 수 있다. 버튼이 터치에 의해 선택되면, 제어부는 커버 설정 모드로 진입하고, 도 9b의 제 2 화면(90 2)으로 전환할 수 있다. 도 9b를 참조하면, 제 2 화면은 장방향으로(예: 도 3b의 제 5 방향 ) 배열되는 제 1 영역, 제 2 영역, 제 3 영역, 제 4 영역 및 제 5 영역(902 5)을 포함할 수 있다. 일 실시 예에 따르면, 커버 설정 모드는 전자 장치를 최초로 파워 온 후 이행되는 초기 설정 프로세스에 해당할 수 있다. 다양한 실시 예에 따르면, 커버 설정 모드는 초기 설정 프로세스를 이후 사용자가 원할 때 이행되는 사용자 환경 설정 프로세스에 해당할 수 있다. 제 1 영역은 상태 표시줄 (status bar)이고, 예를 들어, 전자 커버 설정 모드를 가리키는 'Digital DMF settings' 문구를 표시할 수 있 다. 제 2 영역은 색상 리스트를 표시하는 영역일 수 있다. 색상 리스트는 다양한 색상을 가리키는 색상 리스트 엔트리들을 포함할 수 있다. 색상 리스트 엔트리들은 도 9b에 국한되지 않고, 다양한 형태의 GUI(graphical user interface) 엘리먼트(element)로 표시될 수 있다. 다양한 실시 예에 따르면, 스크롤을 통 해 표시 가능한 다른 색상 리스트 엔트리들이 존재하는 경우, 제어부는 제 2 영역을 스크롤 가능한 영역으로 설정할 수 있다. 예를 들어, 제 2 영역 상에서 설정된 제스처 입력(예: 플리킹(flicking), 스와 이핑(swiping) 또는 드래깅(dragging) 등)이 감지될 때, 제어부는 다른 색상 리스트 엔트리들이 표시되도 록 스크롤할 수 있다. 제 3 영역은 투명도(transparency)를 조절하기 위한 컨트롤 영역일 수 있다. 일 실 시 예에 따르면, 제어부는 제 3 영역을 통하여 0 ~ 100 % 범위의 투명도에 관한 조절 바, 및 조절 바 상에서 이동시킬 수 있는 컨트롤을 포함할 수 있다. 투명도를 조절하기 위한 GUI 엘리먼 트들은 도 9b에 국한되지 않고, 다른 형태의 GUI 엘리먼트로 표시될 수도 있다. 제 4 영역은 패턴 (pattern) 리스트를 표시하는 영역일 수 있다. 패턴 리스트는 다양한 패턴을 가리키는 패턴 리스트 엔트리들을 포함할 수 있다. 패턴 리스트 엔트리들은 도 9b에 국한되지 않고, 다양한 형태의 GUI 엘리먼트로 표시될 수 있 다. 다양한 실시 예에 따르면, 스크롤을 통해 표시 가능한 다른 패턴 리스트 엔트리들이 존재하는 경우, 제어부 는 제 4 영역을 스크롤 가능한 영역으로 설정할 수 있다. 제 5 영역은 효과(effect) 리스트를 표시하는 영역일 수 있다. 효과 리스트는 다양한 효과(예: 깜빡임, 흐리기 등)를 가리키는 효과 리스트 엔트리 들을 포함할 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 2 영역, 제 3 영역, 제 4 영역 및 제 5 영역은 다른 배열로 설계될 수도 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 2 화면은 다른 표현에 관한 리스트를 제공하는 다른 영역을 더 포함하도록 설계될 수도 있다. 제 2 영역에서 해당 색상 리스트 엔트리가 터치될 때, 제어부는 터치된 색상 리스트 엔트리에 해당 하는 색상을 전자 커버의 색상 표현으로 결정할 수 있다. 제 3 영역에서 컨트롤을 조절 바(9023 1)를 따라 이동시키는 터치 입력(예: 드래깅)이 감지될 때, 제어부는 컨트롤의 위치에 따른 투명도 를 전자 커버의 투명도 표현으로 결정할 수 있다. 제 4 영역에서 해당 패턴 리스트 엔트리가 터치될 때, 제어부는 터치된 패턴 리스트 엔트리에 해당하는 패턴을 전자 커버의 패턴 표현으로 결정할 수 있다. 제 5 영역에서 해당 효과 리스트 엔트리가 터치될 때, 제어부는 터치된 효과 리스트 엔트리에 해당하는효과를 전자 커버의 효과 표현으로 결정할 수 있다. 해당 색상 표현, 투명도 표현, 패턴 표현 또는 효과 표현 등이 결정된 후 전자 커버 설정 모드가 종료되면, 제어부는 이러한 표현들을 포함하는 표현 모드를 기초로 전자 커버를 전기적으로 제어할 수 있다. 도 10은 사용자 입력을 기초로 표현 모드를 선택하고, 선택된 표현 모드를 기초로 전자 커버를 전기적으로 제어 하는 다른 예시 도이다. 일 실시 예에 따르면, 전자 장치는 도 5의 전자 장치를 포함할 수 있다. 도 10을 참조하면, 전자 장치는 양쪽 부분들이 휘어진 형태의 곡형부들(1010-12a, 1010-12b)을 포함하는 전 자 커버(1010-1)(예: 도 5의 제 2 커버(510-1))를 포함할 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으 나, 전자 커버(1010-1)는 한쪽에만 곡형부(1010-12b)를 가지도록 설계될 수도 있다. 전자 장치는 제 1 커 버(1010-1)의 적어도 일부를 따라 배치되는 디스플레이(예: 도 5의 530)를 포함할 수 있다. 일 실시 예에 따르 면, 디스플레이의 일부는 곡형부(1010-12b)를 따라 배치될 수 있다. 일 실시 예에 따르면, 커버 설정 모드 에서, 전자 장치는 곡형부(1010-12b)에 의해 커버되는 디스플레이의 일 영역을 통해 색상 리스트를 표시할 수 있다. 일 실시 예에 따르면, 커버 설정 모드에서, 전자 장치는 곡형부(1010-12b)에 의해 커버 되는 디스플레이의 일 영역을 통해 투명도(transparency)를 조절하기 위한 GUI 엘리먼트들(예: 도 9b의 90231, 90232)을 표시할 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 전자 장치는 곡형부 (1010-12b)에 의해 커버되는 디스플레이의 일 영역을 통해 패턴 리스트를 표시할 수도 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제어부는 곡형부(1010-12b)에 의해 커버되는 디스플레이의 일 영역을 통하여 패턴 리스트 또는 효과 리스트 등을 더 표시하도록 설계될 수도 있다. 제어부는 곡형부(1010-12b)에 의해 커버되는 디스플레이의 일 영역에서의 터치 입력을 감지하고, 전자 커버를 통하여 사용자에게 보이고자 하는 색 상 표현 또는 투명도 표현을 결정할 수 있다. 해당 색상 표현 및 투명도 표현이 결정된 후 전자 커버 설정 모드 가 종료되면, 제어부는 선택된 색상 표현, 투명도 표현, 패턴 표현 또는 효과 표현 등에 해당하는 커버 설 정을 기초로 전자 커버를 전기적으로 제어할 수 있다. 다양한 실시 예에 따르면, 제어부는 실행된 어플리케이션(예: 도 6의 어플리케이션)을 기초로 표현 모드를 선택하고, 선택된 표현 모드에 따라 전자 커버를 제어할 수 있다. 도 11a 및 11b는 다양한 실시 예에 따 른 도 8의 동작 흐름을 설명하기 위한 예시 도이다. 다양한 실시 예에 따르면, 전자 장치는 도 3a 및 3b 의 전자 장치, 도 5의 전자 장치, 도 6의 전자 장치 또는 도 7의 전자 장치의 적어도 일부 를 포함할 수 있다. 도 11a, 11b, 11c 및 11d를 참조하면, 전자 장치가 멀티미디어 재생 어플리케이션을 통하여 음악, 동영상 등의 컨텐트를 재생할 때, 제어부는 해당 표현 모드에 따라 전자 커버를 제어할 수 있다. 일 실시 예에 따르면, 제어부는 컨텐트를 재생하는 비트에 따라 표현 모드를 달리 할 수 있다. 예를 들어, 도 11a를 참조하면, 컨텐트가 설정된 비트 이상 빠르게 재생될 때, 제어부는 제 1 장방향 (110051a) 또는 제 2 장방향(110051b)으로 제 1 색상 및 제 2 색상이 반복되는 줄무늬 형태의 표현이 전자 커버 를 통해 사용자에게 보이도록 전자 커버를 제어할 수 있다. 다양한 실시 예에 따르면, 도 11a를 참조하면, 컨텐 트가 설정된 비트 이상 빠르게 재생될 때, 제어부는 제 1 색상 및 제 2 색상이 반복되는 줄무늬가 제 1 장 방향(110051a) 또는 제 2 장방향(110051b)으로 이동하는 표현이 사용자에게 보이도록 전자 커버를 제어할 수도 있다. 다른 예를 들어, 도 11b를 참조하면, 컨텐트가 설정된 비트 이상 빠르게 재생될 때, 제어부는 제 1 단방향 (110051c) 또는 제 2 단방향(110051d)으로 제 1 색상 및 제 2 색상이 반복되는 줄무늬 형태의 표현이 전자 커버 를 통해 사용자에게 보이도록 전자 커버를 제어할 수 있다. 다양한 실시 예에 따르면, 도 11b를 참조하면, 컨텐 트가 설정된 비트 이상 빠르게 재생될 때, 제어부는 제 1 색상 및 제 2 색상이 반복되는 줄무늬가 제 1 단 방향(110051c) 또는 제 2 단방향(110051d)으로 이동하는 표현이 사용자에게 보이도록 전자 커버를 제어할 수도 있다. 다양한 실시 예에 따르면, 컨텐트가 설정된 비트 이상 빠르게 재생될 때, 도 11a의 표현 및 도 11b의 표현이 반 복되어 사용자에게 보이도록 전자 커버가 제어될 수도 있다. 예를 들어, 도 11c를 참조하면, 컨텐트가 설정된 비트 보다 느리게 재생될 때, 제어부는 제 1 장방향 (110051a)으로 해당 색상이 옅어지는 표현이 사용자에게 보이도록 전자 커버를 제어할 수 있다. 예를 들어, 도 11d를 참조하면, 컨텐트가 설정된 비트 보다 느리게 재생될 때, 제어부는 제 2 장방향(110051b)으로 해당 색상이 옅어지는 표현이 사용자에게 보이도록 전자 커버를 제어할 수 있다. 다양한 실시 예에 따르면, 컨텐트가 설정된 비트 보다 느리게 재생될 때, 제어부는 도 11c의 표현 및 도 11d의 표현이 반복되어 사용자에게 보이도록 전자 커버를 제어할 수 있다.다양한 실시 예에 따르면, 도시하지 않았으나, 컨텐트가 설정된 비트 보다 느리게 재생될 때, 제어부는 단 방향(예: 도 11b의 110051a 또는 110051b)으로 해당 색상이 옅어지는 표현이 사용자에게 보이도록 전자 커버를 제어할 수도 있다. 도 12a, 12b 및 12c는 실행된 어플리케이션을 기초로 표현 모드를 선택하고, 선택된 표현 모드에 따라 전자 커 버를 전기적으로 제어하는 다른 예시 도이다. 다양한 실시 예에 따르면, 전자 장치는 도 3a 및 3b의 전자 장치, 도 5의 전자 장치, 도 6의 전자 장치 또는 도 7의 전자 장치의 적어도 일부를 포함 할 수 있다. 일 실시 예에서, 전자 장치가 카메라(예: 도 3b의 후방 카메라)를 이용하여 객 체(object)를 촬영하는 카메라 어플리케이션(예: 스틸 이미지 캡쳐 어플리케이션 또는 동영상 촬영 어플리케이 션)을 실행할 수 있다. 도 12a, 12b 및 12c에서, 카메라 어플리케이션이 실행되면, 제어부는 설정된 시간 (예: 1 초)의 경과에 따라 로마 숫자 기호와 유사한 표현(1201, 1202, 1203)이 사용자에게 보이도록 전자 커버 를 제어할 수 있다. 도 12a, 12b 및 12c에서의 표현은 타이머 기능에 관한 것일 수 있다. 예를 들어, 도 12a, 12b 및 12c에서의 표현은 사용자가 촬영 시작 시간을 인지하는데 이용될 수 있다. 제어부는 도 12c의 표현 이 사용자에게 보이도록 전자 커버를 제어한 후, 카메라를 통하여 객체를 촬영할 수 있다. 도 13a, 13b 및 13c는 실행된 어플리케이션을 기초로 표현 모드를 선택하고, 선택된 표현 모드에 따라 전자 커 버를 전기적으로 제어하는 다른 예시 도이다. 다양한 실시 예에 따르면, 전자 장치는 도 3a 및 3b의 전자 장치, 도 5의 전자 장치, 도 6의 전자 장치 또는 도 7의 전자 장치의 적어도 일부를 포함 할 수 있다. 일 실시 예에서, 전자 장치가 카메라(예: 도 3b의 후방 카메라)를 이용하여 객 체를 촬영하는 카메라 어플리케이션을 실행할 수 있다. 도 13a, 13b 및 13c에서, 카메라 어플리케이션이 실행되 면, 제어부는 설정된 시간(예: 1 초)의 경과에 따라 숫자를 나타내는 표현(1301, 1302, 1303)이 사용자에 게 보이도록 전자 커버를 제어할 수 있다. 예를 들어, 도 13a, 13b 및 13c에서의 표현은 도 12a, 12b 및 12c에 서와 같이 카메라 타이머 기능에 관한 것일 수 있다. 도 14a 및 14b는 실행된 어플리케이션을 기초로 표현 모드를 선택하고, 선택된 표현 모드에 따라 전자 커버를 전기적으로 제어하는 다른 예시 도이다. 다양한 실시 예에 따르면, 전자 장치는 도 3a 및 3b의 전자 장치 , 도 5의 전자 장치, 도 6의 전자 장치 또는 도 7의 전자 장치의 적어도 일부를 포함할 수 있다. 일 실시 예에서, 전자 장치가 카메라(예: 도 3b의 후방 카메라)를 이용하여 동영상 촬 영하는 카메라 어플리케이션을 실행할 수 있다. 도 14a에서, 동영상 촬영 중일 때, 제어부는 이를 가리키 는 인디케이터 관련 표현이 사용자에게 보이도록 전자 커버를 제어할 수 있다. 도 14b에서, 동영상 촬영 이 일시 중지 중일 때, 제어부는 이를 가리키는 인디케이터 관련 표현이 사용자에게 보이도록 전자 커버를 제어할 수 있다. 다양한 실시 예에 따르면, 제어부는 인디케이터 관련 표현(1401 또는 1402)을 점 멸하는 효과로 사용자에게 보이도록 전자 커버를 제어할 수도 있다. 도 15a, 15b 및 15c는 실행된 어플리케이션을 기초로 표현 모드를 선택하고, 선택된 표현 모드에 따라 전자 커 버를 전기적으로 제어하는 다른 예시 도이다. 다양한 실시 예에 따르면, 전자 장치는 도 3a 및 3b의 전자 장치, 도 5의 전자 장치, 도 6의 전자 장치 또는 도 7의 전자 장치의 적어도 일부를 포함 할 수 있다. 일 실시 예에 따르면, 전자 장치에 포함된 전자 커버는 도 2의 전자 커버를 포함 할 수 있다. 일 실시 예에 따르면, 전자 커버는 홈(예: 도 2의 201)을 포함하고, 카메라를 위한 플 래시(미도시)는 이 홈에 결합될 수 있다. 일 실시 예에 따르면, 전자 커버의 제 1 레이어(예: 도 2의 210)의 일부(이하, 플래시 커버 영역)는 플래시를 커버할 수 있다. 일 실시 예에 따르면, 플래시 커버 영 역의 광 투과율이 조절될 때, 플래시로부터 발생된 광이 외부로 방출되는 양은 조절될 수 있다. 도 15a를 참조하면, 카메라 어플리케이션이 실행되지 않았을 때, 제어부는 플래시 커버 영역이 대체 적으로 주변 영역과 같이 어두운 계통의 색상으로 사용자에게 보이도록 전자 커버를 제어할 수 있다. 일 실시 예에 따르면, 도 15a에서, 제어부는 전자 커버의 플래시 커버 영역, 또는 전체 영역에 대한 전력을 차단할 수 있다. 플래시는 어두운 계통의 색상으로 표현되는 플래시 커버 영역에 의해 외부로 노출 되지 않을 수 있다. 도 15b 및 15c는 카메라 어플리케이션이 실행된 상태를 도시한다. 카메라를 이용하여 객체를 촬영할 때, 제어부는 센서 모듈(예: 도 6의 676)로부터 획득한 외부 조도 값에 따라 플래시를 활성화 또는 비활성화할 수 있다. 일 실시 예에 따르면, 제어부는 센서 모듈로부터 획득한 외부 조도 값에 따라 플래시 커버 영역 의 광 투과율을 조절할 수 있다. 예를 들어, 외부 조도 값이 낮을수록 제어부는 플래시 커버 영역 의 광 투과율을 높게 설정할 수 있다. 예를 들어, 외부 조도 값이 높을수록 제어부는 플래시 커버영역의 광 투과율을 낮게 설정할 수 있다. 도 16은 일 실시 예에 따른 전자 커버를 포함하는 전자 장치에서 커버에 관한 동작 흐름을 도시한다. 도 17a, 17b, 18 및 19는 다양한 실시 예에 따른 도 16의 동작 흐름을 설명하기 위한 예시 도들이다. 다양한 실시 예에 따르면, 전자 장치는 도 3a 및 3b의 전자 장치, 도 5의 전자 장치 또는 도 7의 전자 장치의 적 어도 일부를 포함할 수 있다. 도 16을 참조하면, 1601 동작에서, 제어부는 사용자 입력을 기초로 트리거 조건을 생성할 수 있다. 1603 동작에서, 제어부는 사용자 입력을 기초로 트리거 조건에 대응되는 표현 모드를 생성할 수 있다. 1605 동 작에서, 제어부는 트리거 조건 및 표현 모드를 포함하는 트리거를 생성하여 저장할 수 있다. 도 7을 참조 하면, 다양한 실시 예에서, 생성된 트리거는 저장부(예: 도 6의 메모리)의 표현 선택 인스트럭션 , 영역 선택 인스트럭션 및 전력 제어 인스트럭션 형태로 저장될 수 있다. 도 17a 및 17b는 도 16의 1601 동작, 1603 동작 및 1605 동작을 설명하기 위한 예시 도이다. 도 17a 및 17b의 전자 장치는 도 3a 및 3b의 전자 장치, 도 5의 전자 장치 또는 도 7의 전자 장치의 적어 도 일부를 포함할 수 있다. 도 17a를 참조하면, 전자 장치는 사용자 입력을 기초로 트리거 조건을 생성하 기 위한 제 1 화면을 제공할 수 있다. 일 실시 예에 따르면, 제 1 화면은 커버 설정 모드에서 트리 거 생성 모드(또는, 자동 설정 모드)로 진입함을 가리키는 문구를 표시하는 상태 표시줄을 제공할 수 있 다. 일 실시 예에 따르면, 제 1 화면은 날(date), 시간(time), 날씨(weather), 조도(ambient) 등의 일반 정보(public information)에 관한 항목들을 제공할 수 있다. 제 1 화면은 일정(schedule), 알람 (alarm), 호 알림(call alert), 특정 이벤트(special event) 등의 개인 정보(private information)에 관한 항 목들을 제공할 수 있다. 일 실시 예에 따르면, 제 1 화면은 각 항목들(1703, 1704)에 대한 컨트롤 을 제공할 수 있다. 예를 들어, 컨트롤은 터치될 때마다 왼쪽 또는 오른쪽으로 이동될 수 있다. 일 실시 예에 따르면, 컨트롤이 왼쪽에 위치할 때, 항목에 대한 트리거는 비활성화됨(on)을 의미할 수 있다. 컨트롤이 오른쪽에 위치할 때, 항목에 대한 트리거는 활성화됨(off)을 의미할 수 있다. 일 실시 예에서, 호 알림(call alert) 항목에 대한 트리거가 활성화되면, 제어부는 호 수신 시 전자 커버를 통한 표현 모드 를 사용자가 설정할 수 있는 제 2 화면로 전환한다 (도 17b 참조). 도 17b를 참조하면, 제 2 화면 은 커버 설정 모드에서 호 알림에 관한 트리거 생성 모드로 진입함을 가리키는 문구를 표시하는 상태 표시줄 을 제공할 수 있다. 일 실시 예에 따르면, 제 2 화면은 도 9b의 제 2 화면와 같이 색상 리스 트를 제공하는 영역, 투명도 조절을 위한 컨트롤 영역, 패턴 리스트를 제공하는 영역 또는 효과 리스트를 제공하는 영역을 제공할 수 있다. 제어부는 제 2 화면 상에서의 터치 입력을 기초로 색상 표현, 투명도 표현, 패턴 표현 또는 효과 표현 등으로 정의되는 표현 모드를 선택할 수 있다. 제어 부는 호 수신으로 정의되는 트리거 조건에 선택한 표현 모드를 대응시켜, 트리거로 저장할 수 있다. 다양한 실시 예에 따르면, 도시하지 않았으나, 제 2 화면은 이전 사용된 색상 표현, 투명도 표현, 패턴 표 현 또는 효과 표현 등을 기초로 해당 표현 모드를 자동으로 선택하거나 또는 사용자에게 추천하기 위한 컨트롤 (control)을 포함하도록 설계될 수도 있다. 예를 들어, 컨트롤이 터치 입력으로 선택될 때, 제어부는 메모 리(예: 도 6의 630)에 저장된 히스토리를 기초로, 자주 사용된 색상 표현, 투명도 표현, 패턴 표현 또는 효과 표현 등을 선택할 수 있다. 제어부는 선택된 색상 표현, 투명도 표현, 패턴 표현 또는 효과 표현 등을 기 초로 사용자 선호도가 높은 표현 모드를 생성하고, 이를 사용자에게 추천하거나, 또는 자동으로 선택하는 동작 을 이행할 수 있다. 다양한 실시 예에 따르면, 컨트롤이 터치 입력으로 선택될 때, 제어부는 TBD(track before detect) 알고리즘을 기초로 하는 다이내믹 프로그래밍(dynamic programming)을 이행하여, 해당 표현 모 드를 추천 또는 자동으로 선택할 수 있다. 도 17a 및 17b의 예시에 따른 트리거 생성에 국한되지 않고, 다양한 다른 방식으로 설계될 수 있다. 다양한 실 시 예에 따르면, 사용자 입력을 기초로 트리거 조건은 다양하게 설정될 수 있다. 트리거 조건이 발생할 때, 제어부는 1607 동작에서 이를 감지할 수 있다. 1609 동작에서, 제어부는 발생된 트리거 조건에 해당하는 표현 모드를 선택할 수 있다. 1611 동작에서, 제어부는 선택된 표현 모드 에 기반하여 전자 커버를 전기적으로 제어할 수 있다. 일 실시 예에 따르면, 제어부는 다수 개의 커버 설정들 중 선택된 표현 모드에 해당하는 커버 설정을 선택 할 수 있다. 일 실시 예에 따르면, 전자 커버는 다수의 영역들을 포함할 수 있다. 일 실시 예에 따르면, 다수의 영역들은 줄 구조(striped structure)로 배치될 수 있다. 일 실시 예에 따르면, 제어부는 선택된 커버 설 정을 기초로 전자 커버의 다수의 영역들 중 적어도 하나를 선택할 수 있다. 일 실시 예에서, 도 1a 및 1b를 참조하면, 각 영역은 색상 필터(1211-N)에 정렬된 제 2 전극(1121-N))을 포함할 수 있다. 제어부는 선택된 커버 설정에 따라 해당 영역에 해당하는 제 2 전극(1121-N)을 선택할 수 있다. 제어부는, 선택된 커버 설 정을 기초로, 적어도 하나의 영역에 대한 전력을 제어할 수 있다. 전자 커버의 적어도 일부 영역에 대한 전력을 제어하는 1611 동작은 전자 커버의 적어도 일부 영역에 대한 전기장을 제어하는 동작으로 정의될 수도 있다. 전 자 커버의 적어도 일부 영역에 대한 전력을 제어하는 1611 동작은 전자 커버의 적어도 일부 영역에 대한 광 투 과율을 조절하는 동작으로도 정의될 수 있다. 일 실시 예에 따르면, 맑은 날씨 또는 햇빛이 강한 날씨를 포함하는 날씨 정보가 획득될 때, 제어부는 도 11c 또는 11d과 같이 장방향(110051a 또는 110051b)으로 해당 색상이 옅어지는 형태의 표현 모드(그라데이션 표 현 모드)를 선택하고, 선택된 표현 모드를 기반하여 전자 커버를 전기적으로 제어할 수 있다. 그라데이션 표현 은 마치 햇빛이 비추는 듯한 느낌을 사용자에게 제공할 수 있다. 다양한 실시 예에서, 도 18을 참조하면, 제 1 레이어(예: 도 1a 및 1b의 110)의 제 2 전극들(예: 도 1a 및 1b의 1121)은 전자 장치의 세로 방향 으로 배열되는 줄 구조로 설계될 수 있다. 도 18을 참조하면, 맑은 날씨 또는 햇빛이 강한 날씨를 포함 하는 날씨 정보가 획득될 때, 제어부는 제 2 전극들을 세로 방향으로 순차적으로 전력을 차 단하여 전자 커버를 통한 표현을 형성할 수도 있다. 예를 들어, 흐린 날씨 또는 비 오는 날씨를 포함하는 날씨 정보가 획득될 때, 제어부는 도 11b와 같이 단 방향(110051c 또는 110051d)으로 제 1 색상 및 제 2 색상이 반복되는 줄무늬 형태의 표현 모드를 선택하고, 선 택된 표현 모드를 기반하여 전자 커버를 전기적으로 제어할 수 있다. 도 11b에서, 줄무늬 형태의 표현은 마치 빗방울이 떨어지는 듯한 느낌을 사용자에게 제공할 수 있다. 다양한 실시 예에 따르면, 제어부는 주변 조도 값에 따라 해당 표현 모드를 선택하고, 선택된 표현 모드를 기반하여 전자 커버를 전기적으로 제어할 수 있다. 예를 들어, 주변 조도 값이 설정된 값 이상일 때, 제어부 는 도 4b와 같이 전자 커버(310-2)를 제어할 수 있다. 예를 들어, 주변 조도 값이 설정된 값보다 작을 때, 제어부는 도 4a와 같이 전자 커버(310-2)를 제어할 수 있다. 다양한 실시 예에 따르면, 사용자 정보를 기초로 제어부는 전자 커버를 전기적으로 제어할 수 있다. 예를 들어, 현재의 시간이 일정에 포함된 시간에 도래할 때, 제어부는 해당 표현 모드를 선택하고, 선택된 표현 모드를 기반하여 전자 커버를 전기적으로 제어할 수 있다. 예를 들어, 현재의 시간이 알람에 포함된 시간에 도 래할 때, 제어부는 해당 표현 모드를 선택하고, 선택된 표현 모드를 기반하여 전자 커버를 제어할 수 있다. 예를 들어, 현재 시간이 미리 알림에 포함된 시간에 도래할 때, 제어부는 해당 표현 모드를 선택하 고, 선택된 표현 모드를 기반하여 전자 커버를 제어할 수 있다. 예를 들어, 현재의 날짜가 사용자 생일 또는 기 념일일 때, 제어부는 해당 표현 모드를 선택하고, 선택된 표현 모드를 기반하여 전자 커버를 제어할 수 있 다. 다양한 실시 예에 따르면, 센서 모듈(예: 자이로 센서)로부터 획득한 정보를 기초로, 제어부는 전자 커버 가 위로 향하고 화면이 아래로 향하도록 전자 장치가 배치된 제 1 상태를 감지할 수 있다. 센서 모듈로부터 획 득한 정보를 기초로, 제어부는 전자 커버가 아래로 향하고 화면이 위로 향하도록 전자 장치가 배치된 제 2 상태를 감지할 수 있다. 제어부는 제 1 상태 또는 제 2 상태에 따라 전자 커버의 표현 모드를 선택하고, 선택된 표현 모드를 기반하여 전자 커버를 제어할 수 있다. 일 실시 예에서, 제 2 상태일 때, 제어부는 전자 커버의 전체 영역이 대체적으로 어두운 색상으로 보이도 록 하는 표현 모드를 선택하고, 선택된 표현 모드를 기초로 전자 커버를 전기적으로 제어할 수 있다. 예를 들어, 제 2 상태일 때, 제어부는 전자 커버의 전체 영역에 대하여 전력을 차단할 수 있다. 다양한 실시 예에서, 제 1 상태일 때, 제어부는 사용자 입력, 어플리케이션의 실행 또는 트리거를 기초로 전자 커버의 다양한 표현 모드를 선택하고, 선택된 표현 모드를 기초로 전자 커버를 제어할 수 있다. 도 19를 참조하면, 제 1 상태에서 호가 수신되면, 제어부는 제 1 표현 모드 및 제 2 표현 모드를 번갈 아 선택하고, 이에 따라 전자 커버를 전기적으로 제어할 수 있다. 예를 들어, 제 1 표현 모드 및 제 2 표현 모드는 세로 방향으로의 서로 다른 줄무늬 표현들일 수 있다. 다양한 실시 예에 따르 면, 제어부는, 제 1 표현 모드를 기초로, 전자 커버의 N 번째 전극(1901-N)(예: 도 1a의 제 2 전극(1121-N))으로의 전력을 오프하고, N+1 번째 전극(1901-N+1)으로의 전력을 인가할 수 있다. 제어부 는 제 2 표현 모드를 기초로, 전자 커버의 N 번째 전극(1901-N)으로의 전력을 인가하고, N+1 번째 전극(1901-N+1)으로의 전력을 오프할 수 있다.다양한 실시 예에서, 도 19를 참조하면, 호가 수신되고, 수신된 호에 접속하기 위한 사용자 입력이 있기 전까지, 제어부는 제 1 표현 모드 및 제 2 표현 모드의 전환을 초당 설정된 수(예: 5회)만큼 이행할 수 있다. 다양한 실시 예에 따르면, 제어부는 설정된 시간 (예: 2 초) 동안 제 1 표현 모드 및 제 2 표현 모드의 전환을 이행하고, 일정 시간(예: 1 초) 동안 상기 전환을 멈추는 동작을 반복할 수 있다. 다양한 실시 예에서, 도 19를 참조하면, 제 1 상태에서 메시지(예: SNS(social network service) 메시지)가 수 신될 때, 제어부는 제 1 표현 모드 및 제 2 표현 모드를 설정된 시간 동안 전환하고, 이에 따 라 전자 커버를 전기적으로 제어할 수 있다. 본 발명의 일 실시 예에 따르면, 다수의 영역들 가지는 전자 커버를 포함하는 전자 장치의 동작 방법은, 사용자 입력, 어플리케이션의 실행, 또는 설정된 트리거에 적어도 일부 기반하여 표현 모드를 선택하는 동작과, 상기 선택된 표현 모드에 따라 상기 다수의 영역들 중 적어도 일부 영역에 대한 광 투과율을 조절하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 다수의 영역들은, 줄 구조(striped structure)로 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 적어도 일부 영역에 대한 광 투과율을 조절하는 동작은, 상기 적어도 일 부 영역에서 발생되는 전기장 세기를 조절하는 동작을 포함할 수 있다. 한편, 상술한 본 발명의 실시 예들은 컴퓨터에서 실행될 수 있는 프로그램으로 작성 가능하고, 컴퓨터로 읽을 수 있는 기록 매체를 이용하여 상기 프로그램을 동작시키는 범용 디지털 컴퓨터에서 구현될 수 있다. 또한, 상 술한 본 발명의 실시 예에서 사용된 데이터의 구조는 컴퓨터로 읽을 수 있는 기록 매체에 여러 수단을 통하여 기록될 수 있다. 상기 컴퓨터로 읽을 수 있는 기록 매체는 마그네틱 저장 매체(예를 들면, 롬, 플로피 디스크, 하드 디스크 등), 광학적 판독 매체(예를 들면, CD-ROM, DVD 등)와 같은 저장 매체를 포함한다. 이제까지 본 발명에 대하여 그 바람직한 일 실시 예들을 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현 될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시 예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허 청구 범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2017-0111740", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a 및 1b는 일 실시 예에 따른 전자 장치에 포함된 전자 커버의 단면도를 도시한다. 도 1c는 다양한 실시 예에 따른 전자 커버의 일부 레이어를 도시한다. 도 2는 다양한 실시 예에 따른 전자 장치에 포함된 전자 커버의 단면도를 도시한다. 도 3a 및 3b는 일 실시 예에 따른 전자 커버를 포함하는 전자 장치를 도시한다. 도 4a, 4b, 4c, 4d 및 4e는 다양한 실시 예에서 전자 커버를 통한 표현을 설명하기 위한 도면들이다. 도 5는 다양한 실시 예에 따른 전자 커버를 포함하는 전자 장치의 단면도를 도시한다. 도 6은 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블럭도이다. 도 7은 일 실시 예에 따른 전자 커버를 포함하는 전자 장치의 블록도이다. 도 8은 일 실시 예에 따른 전자 커버를 포함하는 전자 장치에서 커버에 관한 동작 흐름을 도시한다. 도 9a, 9b, 10, 11a, 11b, 11c, 11d, 12a, 12b, 12c, 13a, 13b, 13c, 14a, 14b, 15a, 15b 및 15c는 다양한 실시 예에 따른 도 8의 동작 흐름을 설명하기 위한 예시 도들이다. 도 16은 일 실시 예에 따른 전자 커버를 포함하는 전자 장치에서 커버에 관한 동작 흐름을 도시한다. 도 17a, 17b, 18 및 19는 다양한 실시 예에 따른 도 16의 동작 흐름을 설명하기 위한 예시 도들이다."}
