{"patent_id": "10-2018-0077911", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0004708", "출원번호": "10-2018-0077911", "발명의 명칭": "인공지능 제어 이러닝 서비스 제공 장치 및 방법", "출원인": "한진승", "발명자": "한진승"}}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버의 인공지능 제어 이러닝 서비스 제공 방법에 있어서,(a) 단말의 정보를 수신하여 분석하고 저장하는 단계;(b) 학습효능심리평가(SELF)와 학습능력진단평가(SAE)에 대한 제1 데이터를 수신하는 단계;(c) 개별맞춤 교과과정(PCT)에 대한 제2 데이터를 수신하는 단계;(d) 상기 제1 데이터와 제2 데이터의 분석하고, 상기 분석 내용에 따라 학습진행평가(LPE) 데이터를 수신하는단계;(e) 상기 학습진행평가(LPE) 데이터를 분석하고, 상기 분석 내용에 따라 상기 단말의 교과과정 제어 신호를 전송하는 단계; 및 (f) 학습결과평가(SRA) 수행을 제어하고 관련 데이터를 수신/분석하여 학습 레벨을 제어하는 단계;를 포함하여 이루어지는 인공지능 제어 이러닝 서비스 제공 방법."}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 (a) 단계와 (b) 단계는,지능형 이러닝 학습 시작 전에 수행되고 이후에는 수행되지 않는 것을 특징으로 하되,상기 (a) 단계는 상기 단말 정보의 업데이트 시에는 수행되는 것을 특징으로 하는 인공지능 제어 이러닝 서비스제공 방법."}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 (b) 단계에서,어휘기억력 측정검사(VMAT: Vocabulary Memorization Ability Test)와, 영어능력진단평가(EFE: EnglishFluency Evaluation) 중 적어도 하나의 데이터를 더 수신하는 것을 특징으로 하는 인공지능 제어 이러닝 서비스제공 방법."}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 (c) 내지 (f) 단계는,상기 서버에서 미리 설정된 매 학습 레벨마다 수행되는 것을 특징으로 하는 인공지능 제어 이러닝 서비스 제공방법."}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2020-0004708-3-제1항에 있어서,상기 (c) 내지 (f) 단계 사이에는,레슨 데이터 수신하는 단계;강좌 데이터 수신하는 단계; 또는상기 단계별 학습진행평가(LPE) 이후 단계별 학습 완료 후 결과 평가(LCA: Level Competency Assessment) 데이터를 수신하는 단계;중 적어도 하나를 더 수행하는 것을 특징으로 하는 인공지능 제어 이러닝 서비스 제공 방법."}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 학습효능심리평가(SELF)는,학습자의 자기 자신에 관한 주관적 신뢰도에 관한 것으로, 일반적 학습 방식을 통해 새로운 지식과 기술을 성공적으로 획득하기 위해 학습내용의 이해, 분석 및 기억에 관한 주관적인 믿음을 측정하는 것을 특징으로 하는 인공지능 제어 이러닝 서비스 제공 방법."}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 학습능력진단평가(SAE)는,문법(grammar), 어휘(vocabulary), 독해 이해도(reading comprehension), 쓰기(writing), 듣기(listening), 및말하기(speacking)에 관한 현재 언어 숙련도를 평가하기 위한 항목을 포함하여, 언어 학습에 대한 서브젝트들에대한 복수의 문항으로 구성된 것을 특징으로 하는 인공지능 제어 이러닝 서비스 제공 방법."}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 개별맞춤교과과정(PCT)는,학습자의 특성, 학습 컨텐츠 선호도, 및 학습 효능감에 기초하여 개발된 학습 서브젝트를 위한 다양한 템플릿들을 통해 이루어지는 것을 특징으로 하는 인공지능 제어 이러닝 서비스 제공 방법."}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 학습진행평가(LPE)는 학습자의 특정 서브젝트에 대한 학습 진도를 평가하며, 상기 학습결과평가(SRA)는 각 숙련도 레벨이 완료될 때 제공될 수 있는 쓰기 또는/및 구술 테스트로서, 상기 결과는 학습자의 다음 레벨로의 레벨업 여부를 판단하는데 이용하는 것을 특징으로 하는 인공지능 제어 이러닝 서비스 제공 방법."}
{"patent_id": "10-2018-0077911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "인공지능 제어 이러닝 서비스 제공 시스템에 있어서,공개특허 10-2020-0004708-4-단말; 및(a) 상기 단말의 정보를 수신하여 분석하고 저장하고, (b) 학습효능심리평가(SELF)와 학습능력진단평가(SAE)에대한 제1 데이터를 수신하고, (c) 개별맞춤 교과과정(PCT)에 대한 제2 데이터를 수신하고, (d) 상기 제1 데이터와 제2 데이터의 분석하고, 상기 분석 내용에 따라 학습진행평가(LPE) 데이터를 수신하고, (e) 상기 학습진행평가(LPE) 데이터를 분석하고, 상기 분석 내용에 따라 상기 단말의 교과과정 제어 신호를 전송하며, 그리고 (f)학습결과평가(SRA) 수행을 제어하고 관련 데이터를 수신/분석하여 학습 레벨을 제어하는 서비스 서버;를 포함하는 것을 특징으로 하는 인공지능 제어 이러닝 서비스 제공 시스템."}
{"patent_id": "10-2018-0077911", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, (a) 단말의 정보를 수신하여 분석 하고 저장하는 단계; (b) 학습효능심리평가(SELF)와 학습능력진단평가(SAE)에 대한 제1 데이터를 수신하는 단계; (c) 개별맞춤 교과과정(PCT)에 대한 제2 데이터를 수신하는 단계; (d) 상기 제1 데이터와 제2 데이터의 분석하고, 상기 분석 내용에 따라 학습진행평가(LPE) 데이터를 수신하는 단계; (e) 상기 학습진행평가(LPE) 데이 터를 분석하고, 상기 분석 내용에 따라 상기 단말의 교과과정 제어 신호를 전송하는 단계; 및 (f) 학습결과평가 (SRA) 수행을 제어하고 관련 데이터를 수신/분석하여 학습 레벨을 제어하는 단계;를 포함하여 이루어지는 것을 특징으로 한다."}
{"patent_id": "10-2018-0077911", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 제어 이러닝 서비스 제공에 관한 것으로 특히, 인공지능(AI: Artificial Intelligence)에 기초하여 어린아이부터 성인까지 다양한 연령층에 개인별 맞춤형 즉, 인공지능 제어 이러닝 서비스(AICeL: Artificial Intelligence Controlled eLearning) 제공 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2018-0077911", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "네트워크 기술이 발전함에 따라 온라인을 통한 이러닝 서비스 시장이 활성화되고 있다. 종래 이러닝 서비스는 강사가 교육한 내용을 단지 온라인 매체를 통하여 학습 수요자에게 제공하는 것이 일반적이었다. 이러한 초기 이러닝 서비스는 시간, 지역 등의 제한이 없는 장점이 있는 반면 오프라인 교육과 달리 일방적인 정보 전달에 그치고 강사-학생 간의 상호 커뮤니케이션은 지연이 존재하였다. 최근에는 상기 온라인 매체를 활용한 실시간 이러닝 서비스가 점차 증가하고 있으나 이 역시 실시간으로 상호 커뮤니케이션이 가능한 반면 학습자 개인별 학 습 능력, 학습 능률 등의 평가가 어렵고 그에 따른 맞춤형 학습 과정을 통한 개인별 최적화된 이러닝 서비스 제 공에는 여전히 문제가 있어 이러닝 서비스 이용에 불편함이 있었다."}
{"patent_id": "10-2018-0077911", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 과제는, 인공지능 제어 이러닝 서비스(AICeL: Artificial Intelligence Controlled e- Learning)를 지원하는 서비스 플랫폼을 제안하는데 있다. 본 발명의 다른 과제는, 인공지능 제어 이러닝 서비스를 위한 과정들을 수행하는 방법을 제안하는데 있다. 본 발명의 또 다른 과제는, 상기 인공지능 제어 이러닝 서비스를 위하여 다양한 형태로 개인별 상태 데이터를 수집하는 방법을 제안하는데 있다. 본 발명의 또 다른 과제는, 인공지능 제어로 향상된 개별맞춤형 자기주도학습 결과를 향상시키는 방법을 제안하 는데 있다. 본 발명의 또 다른 과제는, 위와 같은 방법을 구현하기 위한 장치를 제안하는데 있다. 본 발명에서 이루고자 하는 기술적 과제들은 상기 기술적 과제로 제한되지 않으며, 언급하지 않은 또 다른 기술"}
{"patent_id": "10-2018-0077911", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0077911", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, (a) 단말의 정보를 수신하여 분 석하고 저장하는 단계; (b) 학습효능심리평가(SELF)와 학습능력진단평가(SAE)에 대한 제1 데이터를 수신하는 단 계; (c) 개별맞춤 교과과정(PCT)에 대한 제2 데이터를 수신하는 단계; (d) 상기 제1 데이터와 제2 데이터의 분 석하고, 상기 분석 내용에 따라 학습진행평가(LPE) 데이터를 수신하는 단계; (e) 상기 학습진행평가(LPE) 데이 터를 분석하고, 상기 분석 내용에 따라 상기 단말의 교과과정 제어 신호를 전송하는 단계; 및 (f) 학습결과평가 (SRA) 수행을 제어하고 관련 데이터를 수신/분석하여 학습 레벨을 제어하는 단계;를 포함하여 이루어지는 것을특징으로 한다. 본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, 상기 (a) 단계와 (b) 단계는, 지 능형 이러닝 학습 시작 전에 수행되고 이후에는 수행되지 않는 것을 특징으로 하되, 상기 (a) 단계는 상기 단말 정보의 업데이트 시에는 수행되는 것을 특징으로 한다. 본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, 상기 (b) 단계에서, 어휘기억력 측정검사(VMAT: Vocabulary Memorization Ability Test)와, 영어능력진단평가(EFE: English Fluency Evaluation) 중 적어도 하나의 데이터를 더 수신하는 것을 특징으로 한다. 본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, 상기 (c) 내지 (f) 단계는, 상기 서버에서 미리 설정된 매 학습 레벨마다 수행되는 것을 특징으로 한다. 본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, 상기 (c) 내지 (f) 단계 사이에 는, 레슨 데이터 수신하는 단계; 강좌 데이터 수신하는 단계; 또는 상기 단계별 학습진행평가(LPE) 이후 단계별 학습 완료 후 결과 평가(LCA: Level Competency Assessment) 데이터를 수신하는 단계; 중 적어도 하나를 더 수 행하는 것을 특징으로 한다. 본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, 상기 학습효능심리평가(SELF)는, 학습자의 자기 자신에 관한 주관적 신뢰도에 관한 것으로, 일반적 학습 방식을 통해 새로운 지식과 기술을 성공 적으로 획득하기 위해 학습내용의 이해, 분석 및 기억에 관한 주관적인 믿음을 측정하는 것을 특징으로 한다. 본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, 상기 학습능력진단평가(SAE)는, 문법(grammar), 어휘(vocabulary), 독해 이해도(reading comprehension), 쓰기(writing), 듣기(listening), 및 말하기(speacking)에 관한 현재 언어 숙련도를 평가하기 위한 항목을 포함하여, 언어 학습에 대한 서브젝트들에 대한 복수의 문항으로 구성된 것을 특징으로 한다. 본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, 상기 개별맞춤교과과정(PCT)는, 학습자의 특성, 학습 컨텐츠 선호도, 및 학습 효능감에 기초하여 개발된 학습 서브젝트를 위한 다양한 템플릿들 을 통해 이루어지는 것을 특징으로 한다. 본 발명의 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, 상기 학습진행평가(LPE)는 학습 자의 특정 서브젝트에 대한 학습 진도를 평가하며, 상기 학습결과평가(SRA)는 각 숙련도 레벨이 완료될 때 제공 될 수 있는 쓰기 또는/및 구술 테스트로서, 상기 결과는 학습자의 다음 레벨로의 레벨업 여부를 판단하는데 이 용하는 것을 특징으로 한다. 본 발명의 다른 일실시예에 따른 인공지능 제어 이러닝 서비스 제공 시스템은, 단말; 및 (a) 상기 단말의 정보 를 수신하여 분석하고 저장하고, (b) 학습효능심리평가(SELF)와 학습능력진단평가(SAE)에 대한 제1 데이터를 수 신하고, (c) 개별맞춤 교과과정(PCT)에 대한 제2 데이터를 수신하고, (d) 상기 제1 데이터와 제2 데이터의 분석 하고, 상기 분석 내용에 따라 학습진행평가(LPE) 데이터를 수신하고, (e) 상기 학습진행평가(LPE) 데이터를 분 석하고, 상기 분석 내용에 따라 상기 단말의 교과과정 제어 신호를 전송하며, 그리고 (f) 학습결과평가(SRA) 수 행을 제어하고 관련 데이터를 수신/분석하여 학습 레벨을 제어하는 서비스 서버;를 포함하는 것을 특징으로 한 다."}
{"patent_id": "10-2018-0077911", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따르면 아래에 기재된 효과를 얻을 수 있다. 다만, 본 발명을 통해 얻을 수 있는 효과는 이에 제한되지 않는다. 첫째, 본 발명에 따르면, 지능형 또는 맞춤형(이하 지능형) 이러닝 서비스를 지원하는 서비스 플랫폼을 제안할 수 있는 효과가 있다. 둘째, 본 발명에 따르면, 인공지능(AI: Artificial Intelligence) 등에 기반으로 상기 인공지능 제어 이러닝 서 비스를 위한 과정들을 수행하는 방법을 제안할 수 있는 효과가 있다. 셋째, 본 발명에 따르면, 상기 인공지능 제어 이러닝 서비스를 위하여 다양한 형태로 개인별 상태 데이터를 수 집하는 방법을 제안할 수 있는 효과가 있다. 넷째, 본 발명에 따르면, 인공지능 제어로 향상된 개별맞춤형 자기주도학습 결과를 향상시키는 방법을 제안할 수 있는 효과가 있다. 다섯째, 본 발명에 따르면, 위와 같은 방법을 구현하기 위한 장치를 제안할 수 있는 효과가 있다."}
{"patent_id": "10-2018-0077911", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다."}
{"patent_id": "10-2018-0077911", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "단지 본 실시예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 에게 발명의 범주를 완전히 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 몇몇의 경우, 본 발명의 개념이 모호해지는 것을 피하기 위하여 공지의 구조 및 장치는 생략되거나, 각 구조 및 장치의 핵심기능을 중심으로 한 블록도 형식으로 도시될 수 있다. 또한, 본 명세서 전체에서 동일한 구성요소에 대해서는 동일한 도면 부호를 사용하여 설명한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함(comprising 또는 including)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미 한다. 또한, 명세서에 기재된 \"…부\" 의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드 웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 나아가, \"일(a 또는 an)\", \"하나 (one)\", 및 유사 관련어는 본 발명을 기술하는 문맥에 있어서 본 명세서에 달리 지시되거나 문맥에 의해 분명하 게 반박되지 않는 한, 단수 및 복수 모두를 포함하는 의미로 사용될 수 있다. 아울러, 본 발명의 실시예들에서 사용되는 특정(特定) 용어들은 본 발명의 이해를 돕기 위해서 제공된 것이며, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 이 러한 특정 용어의 사용은 본 발명의 기술적 사상을 벗어나지 않는 범위에서 다른 형태로 변경될 수 있다. 이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다. 도 1은 본 발명이 적용될 수 있는 인공지능 제어 이러닝 서비스 시스템(AICeL: Artificial Intelligent e- Learning service system)을 설명하기 위해 도시한 도면이다. 도 1을 참고하면, 인공지능 제어 이러닝 시스템은, 적어도 하나의 단말(102,104)과, 인공지능 제어 이러닝 서비스 서버를 포함하여 구성된다. 여기서, 상기 인공지능 제어 이러닝 서비스 네트워크 환경에 속한 장치 들 사이의 통신 내지 데이터 커뮤니케이션(이하 데이터 커뮤니케이션)은 유/무선 통신 네트워크를 통하여 이루 어진다. 한편, 이하에서 언급되는 인공지능 제어 이러닝 서비스 시스템은 도 1에 도시되진 않았으나 데이터베이스 (DB: Database), 결제 서버(PG: Payment server) 등 중 적어도 하나를 더 포함할 수 있다. 상기에서 데이터베 이스(DB), 결제 서버(PG) 등은 상기 도 1에 도시된 인공지능 제어 이러닝 서비스 서버와 별개의 구성요소 로 구현될 수도 있고 상기 인공지능 제어 이러닝 서비스 서버의 내부 일구성요소일 수도 있다. 한편, 상기인공지능 제어 이러닝 서비스 서버는 서비스를 위하여 복수 개로 구현될 수 있으며, 클라우드 서버 형태일 수도 있다. 도시되진 않았으나, 단말간, 단말과 지능형 서비스 서버간 등의 데이터 커뮤니케이션은 동일 또는 상이한 통신 네트워크를 통해 이루어질 수 있다. 본 발명에서, 상기 단말(102,104)은 이러닝 서비스를 요청하고 수신되는 이러닝 서비스 데이터를 스트리밍 등의 방식으로 제공하는 장치로서, 상기 인공지능 제어 이러닝 서비스 시스템을 위한 인공지능 제어 이러닝 서 비스 서버를 포함하여 다양한 다른 장치들과 데이터 커뮤니케이션을 수행할 수 있는 장치로 이해할 수 있 으며, 관련된 모든 장치가 포함될 수 있다. 이 때, 상기 단말(102,104)은 본 발명과 관련하여, 인공지능 제어 이러닝 서비스 서버에서 제공하는 인공 지능 제어 이러닝 서비스 어플리케이션을 미리 다운로드받아 설치된 것을 일실시예로 한다. 이와 관련하여, 본 명세서에서 단지 단말이라고만 정의하는 경우에는 편의상 단수의 의미로 사용하나 하나의 인 공지능 제어 이러닝 서비스를 위하여 복수 개의 단말들이 이용될 수 있는바 그 경우도 포함하는 의미로 이해할 수 있으며, 그러한 단말은 본 발명에 따른 인공지능 제어 이러닝 서비스 어플리케이션 또는 그 이용과 관련된 API(Application Program Interface) 또는 임베디드 소프트웨어(Embaded Software)를 포함할 수 있다. 다시 말해, 이하에서 설명되는 본 발명에 따른 인공지능 제어 이러닝 서비스 제공 방법은, 상기 단말에 미리 설 치된 API 또는 임베디드 소프트웨어를 포함하는 어플리케이션을 통해 이루어지는 것을 일실시예로 하나, 이에 한정되는 것은 아니며 웹사이트(WEBSITE) 등을 통해 인공지능 제어 이러닝 서비스가 제공될 수도 있다. 도 1에서는 설명의 편의상 단말은 편의상 2개만 예시하였으나, 이에 한정되는 것은 아니다. 다시 말해, 인공지능 제어 이러닝 서비스에 이용되는 단말은 1개 또는 복수 개일 수 있다. 이러한 본 발명에 따 른 인공지능 제어 이러닝 서비스에 이용되는 단말(102,104)은 자체적으로 상기 인공지능 제어 이러닝 서비스 서 버로 데이터 또는 (그를 포함한) 신호를 송수신할 수 있으며, 상기 기설치된 인공지능 제어 이러닝 서비스 어플리케이션을 통하여 상기 인공지능 제어 이러닝 서비스 서버로 데이터 또는 신호를 전송하거나 수신할 수 있다. 이 때, 상기 인공지능 제어 이러닝 서비스 서버로 전송되거나 수신되는 데이터 또는 신호는, 본 발명의 일 실시예에 따라 인공지능 제어 이러닝 서비스를 위한 상기 단말에 기설치된 어플리케이션의 컨텐츠와 관련될 수 있으나, 반드시 이에 한정되는 것은 아니다. 한편, 이러한 상기 단말로는, 단말 장치, 터미널(Terminal), MS(Mobile Station), MSS(Mobile Subscriber Station), SS(Subscriber Station), AMS(Advanced Mobile Station), WT(Wireless terminal), MTC(Machine- Type Communication) 장치, M2M(Machine-to-Machine) 장치, D2D 장치(Device-to-Device) 장치 중 적어도 하나 를 일실시예로 할 수 있다. 물론, 어디까지나 이는 예시에 불과할 뿐이며, 본 발명에서의 단말은 상술한 예시들 이외에도 현재 개발되어 상 용화되었거나 또는 향후 개발될 데이터 또는 신호 전송이 가능한 모든 장치를 포함하는 개념으로 해석되어야 한 다. 그 밖에, 상기 인공지능 제어 이러닝 서비스 시스템 내 단말들(102,104)은 반드시 동일한 타입, 종류, 장 치 등이거나 동일한 통신 네트워크를 사용하지 않아도 상관없다. 즉, 상기 단말(102,104)은 각자의 통신 네트워 크를 통하여 상기 인공지능 제어 이러닝 서비스 서버 및 상기 인공지능 제어 이러닝 서비스 서버를 통하여 상호 간에 데이터 커뮤니케이션을 수행할 수 있는 장치이면 족하다. 또는, 상기 단말(102,104)은 본 발명에 일실시예에 따른 인공지능 제어 이러닝 서비스를 위하여 상기 인공지능 제어 이러닝 서비스 서버와만의 데이터 커뮤니케이션을 위한 전용 장치(dedicated apparatus)일 수도 있다. 다음으로, 인공지능 제어 이러닝 서비스 서버는, 유/무선 통신 네트워크를 통하여 적어도 하나 이상의 다 른 장치와 데이터 커뮤니케이션을 수행할 수 있는 개체(entity)로, 본 발명에서 상기 인공지능 제어 이러닝 서 비스 서버는 복수 개일 수 있으며 인공지능 제어 이러닝 서비스를 위하여 결제 서버(미도시), 클라이언트 서버 등 하나 또는 그 이상의 서버들을 더 포함할 수도 있다. 한편, 본 발명에 따른 인공지능 제어 이러닝 서비스 서버는 단말(102,104)에 관한 데이터 등 상기 인공지 능 제어 이러닝 서비스를 위하여 필요한 데이터/빅데이터를 수집, 처리, 저장 등을 수행하는 적어도 하나 이상 의 데이터베이스(DB: database)를 내장 또는 외장할 수 있다. 상기에서 결제 서버는, 인공지능 제어 이러닝 서비스 서버의 일 구성요소가 아니라 외부의 결제 서버 또는 결제 서비스 플랫폼과 연동될 수 있다. 또한, 상기 인공지능 제어 이러닝 서비스 서버는, 클라우드(Cloud) 서버, IMS(IP Multimedia Subsystem) 서버, 텔레포니 어플리케이션(Telephony Application) 서버, IM(Instant Messaging) 서버, MGCF(Media Gateway Control Function) 서버, MSG(Messaging Gateway) 서버, CSCF(Call Session Control Function) 서버 등 중 적 어도 하나를 일실시예로 할 수 있으며, 상기 지식재산 거래 서비스 서버는 PC(Personal Computer), 노트북 컴퓨터, 태블릿 PC(Tablet Personal Computer) 등 데이터 커뮤니케이션이 가능한 개체를 지칭하는 장치로 구현 될 수도 있다. 한편, 유/무선 통신 네트워크는 상기 단말(들)(102,104)과 상기 인공지능 제어 이러닝 서비스 서버 간의 텍스트(Text), 디지털 이미지, 디지털 영상, 디지털 음성 정보 등 다양한 포맷의 데이터 커뮤니케이션을 지원하 는 데이터 통신망을 의미하며, 그 종류가 특별히 제한되지 않는다. 예를 들어, 인터넷 프로토콜을 통하여 대용 량 데이터 커뮤니케이션을 지원하는 아이피(IP: Internet Protocol)망 또는 서로 다른 IP 망을 통합한 올 아이 피(All IP) 망일 수 있다. 또한, 상기 유/무선 통신 네트워크는 유선망, Wibro(Wireless Broadband)망, WCDMA를 포함하는 이동 통신망, HSDPA(High Speed Downlink Packet Access)망 및 LTE(Long Term Evolution) 망을 포함하는 이동 통신망, LTE advanced(LTE-A)를 포함하는 이동 통신망, 위성 통신망 및 와이파이(Wi-Fi)망 중 하나이거나 또는 이들 중 적어 도 하나 이상의 결합에 의하여 형성될 수도 있다. 도 2는 본 발명의 일실시예에 따른 지능형 이러닝서비스 서버의 구성 블록도이다. 도 2를 참조하면, 본 발명의 일실시예에 따른 인공지능 제어 이러닝 서비스를 위한 인공지능 제어 이러닝 서비 스 서버는 단말(들)(102,104)로부터 데이터를 송/수신하는 데이터 통신부, 음성인식 모듈, 언어 처리 모듈, 학습자 데이터 처리 모듈, 빅데이터 처리 모듈, 인공지능(AI) 모듈, 그 밖에 인공지능 제어 이러닝 서비스에 관련된 서비스 제어 수단 등 중 적어도 하나 이상을 포함하여 구현될 수 있다. 이때, 상기 인공지능 제어 이러닝 서비스 서버는 전술한 각종 데이터를 저장하는 데이터베이스(DB), 지능형 이러닝에 따른 결제 서버(미도시) 등 중 적어도 하나를 더 포함할 수도 있다. 상기 데이터베이스(DB)는 편의상 상기 인공지능 제어 이러닝 서비스 서버의 일 구성요소로 도시하고 설명하나, 반드시 이에 한정되는 것은 아니며, 전술한 바와 같이 상기 인공지능 제어 이러닝 서비스 서버 와는 별개 구성이나 상기 인공지능 제어 이러닝 서비스 서버로부터 인공지능 제어 이러닝 서비스 데이터를 포함한 다양한 데이터를 수신하여 저장하거나 상기 인공지능 제어 이러닝 서비스 서버의 저장된 데이터 독 출 요청에 따라 데이터를 상기 인공지능 제어 이러닝 서비스 서버로 전송 가능한 모든 외부 (저장) 장치를 포함할 수 있다. 상기 데이터 통신부는 전용선 또는 유/무선 인터넷(IP)망 등을 통하여 단말(102,104)과 데이터를 송/수신 한다. 인터넷(IP)망을 통하여 입력되는 데이터들은 지능형 이러닝 단말 식별 정보 또는/및 단말 사용자 즉, 학 습자의 개인 정보, 지능형 이러닝 학습 정보, 인공지능 제어 이러닝 서비스 어플리케이션 실행 정보, 상기 인공 지능 제어 이러닝 서비스 어플리케이션의 각종 이용 정보, 인공지능 제어 이러닝 서비스 어플리케이션을 통한 서비스 요청 및 이용 정보, 인공지능 제어 이러닝 서비스 이용 언어 정보, 실시간 인공지능 제어 이러닝 서비스 이용 시간, 기 이용 히스토리 등에 관한 정보, 지능형 이러닝 학습 레벨 정보 등 중 적어도 하나 이상이 포함될 수 있다. 상술한 입력 데이터는 데이터베이스(DB)에 단말 단위 또는 학습자 단위 등으로 개별 저장될 수 있다. 음성인식 모듈은, 인공지능 제어 이러닝 서비스 서버에서 제공하는 인공지능 제어 이러닝 서비스 플 랫폼을 이용하여 인공지능 제어 이러닝 서비스의 단말(102,104)의 입력 데이터 특히, 음성 데이터를 인식하고 이를 적절히 처리하는 수단으로서, 상기 처리 과정에서 STT(Speech To Text) 등의 방식이 이용될 수 있다. 본 명세서에서 음성인식 모듈의 구체적인 구성, 기능 등과 관련하여 필요한 내용은 기 공지된 음성인식 기술을 참조하고 별도 상세 설명은 생략함을 미리 밝혀 둔다.단말(102,104)로부터 입력되는 데이터에 음성 데이터가 포함되면, 음성인식 모듈은 활성화되어 상기 입력 데이터 내 음성 데이터를 인식하고 인식된 음성 데이터의 언어 종류를 식별하고, 인식 및 식별된 음성 데이터를 텍스트 등의 형태로 가공하여 제공할 수 있다. 이를 통해, 예컨대, 신체적인 장애가 있는 사용자(handicapped user)의 경우에도 본 발명에 따르면 지식재산 거래 서비스를 이용할 수 있다. 상기에서, 음성 데이터의 언어 종 류라 함은, 예컨대 한국어, 영어, 중국어, 일본어 등을 의미한다. 한편, 본 발명에서 비록 음성인식 모듈로 도시하고 설명하나, 이는 반드시 음성 데이터에 한정한다는 의미 는 아니며, 상기 데이터 통신부를 통해 단말(102,104)로부터 입력되는 데이터의 인식/처리부의 기능을 수 행한다. 따라서, 상기 음성인식 모듈은 상기 데이터 통신부를 통해 입력되는 단말(102,104)의 입력 정보 식별을 위한 터치 모듈(touch module), 제스처 인식 모듈(gesture recognition module) 등과 조합되거나 대체될 수도 있다. 예컨대, 단말(102,104)로부터 입력되는 데이터에 텍스트, 이미지, 비디오, 음성 등이 섞여 있는 경우에, 상기 모듈은 각 데이터에 해당하는 처리를 담당하는 모듈로서 기능할 수 있다. 다시 말해, 본 명세서에서는 본 발명의 이해를 돕고 설명의 편의를 위하여 음성인식 모듈을 예시한 것일 뿐, 본 발명이 이에 한정되는 것은 아 님을 미리 밝혀 둔다. 상기에서는 편의상 입력 데이터로 또는 그 중 음성 데이터를 인식 및 처리하여 텍스트 형태로 가공하는 일실시 예를 설명하였으나, 그 반대의 경우 TTS(Text to Speech)를 통해 이를 가공 처리하는 것도 본 발명의 권리범위 에 포함된다 할 것이다. 언어 처리 모듈은 전술한 바와 같이, 인식된 단말(102,104)의 입력 데이터(음성 데이터)로부터 언어 종류 를 먼저 식별하고, 식별된 언어 종류에 기초하여 인공지능 제어 이러닝 서비스를 지원한다. 상기 언어 처리 모 듈은 각 단말(102,104)의 입력 데이터로부터 해당 단말의 입력 언어의 종류를 식별하여 그에 관한 정보를 학습 데이터 처리 모듈, 빅데이터 처리 모듈, 및 인공지능 모듈 중 적어도 하나에 직접 제공하 거나 서비스 제어수단의 제어에 따라 해당 모듈로 전달하여 인공지능 제어 이러닝 서비스를 지원할 수 있 다. 학습 데이터 처리 모듈은 인공지능 제어 이러닝 서비스를 위한 다양한 학습 데이터를 생성하여 전송하거나 반대로 상기 생성 전송된 학습 데이터에 따른 단말(102,104)의 입력 데이터 즉, 응답 데이터를 처리한다. 상기 학습 데이터 처리 모듈의 기능은 빅데이터 처리 모듈, 인공지능 모듈, 서비스 제어수단 등 중 적어도 하나와 데이터 커뮤니케이션을 하여 저장되거나 제어될 수 있다. 빅데이터 처리 모듈은 음성인식 모듈, 언어 처리 모듈 등에 의해 처리된 데이터에 기초하여 빅 데이터(big data)를 수집하고, 이를 인공지능 모듈, 서비스 제어 수단, 데이터베이스(DB) 등 중 적어도 하나로 전달할 수 있다. 인공지능 모듈은, 빅데이터에 기반한 또는 머신 러닝 내지 딥 러닝(machine learning or deep learning) 에 기반한 인공지능 프로세서(AI processor)를 이용하여 음성인식 모듈과 언어 처리 모듈에서 처리된 각 단말의 입력 데이터를 지능형 이러닝 서비스를 위하여 분류, 가공, 처리 등 중 적어도 하나를 수행한다. 여기서, 상기 인공지능 모듈은 지능형 이러닝 서비스 서버에서 제공하는 인공지능 제어 이러닝 서비 스 플랫폼을 이용한 인공지능 제어 이러닝 서비스 어플리케이션을 통하여 제공되는 인공지능 제어 이러닝 서비 스의 과정들 중 적어도 하나 이상에 관여 또는 기여하여 인공지능 제어 이러닝 서비스의 이용 편의와 제어를 수 행할 수 있는 모든 수단을 의미한다. 한편, 본 발명에서 상기 인공지능 모듈은, 기공지된 내용과 향후 개발될 다양한 인공지능 기술을 참조하여 그를 그대로 이용하거나 조합하여 이용할 수 있다. 따라서, 본 명세서에서 상기 인공지능 모듈에 대하여 별도 상세 설명은 생략한다. 그 밖에, 상기 인공지능 모듈의 구체적인 동작 등에 대해서는 해당 부분에서 상세히 설명한다. 서비스 제어 수단은, 전술한 각 인공지능 제어 이러닝 서비스 서버의 구성요소들을 관리 및 제어하여 인공지능 제어 이러닝 서비스 플랫폼의 기능을 관리 제어하기 위한 수단이다. 그 밖에, 데이터베이스(DB)는 전술한 구성들 중 적어도 하나와 데이터 커뮤니케이션하여 단말(102,104)의 입력 데이터, 인공지능 제어 이러닝 서비스 데이터 등을 포함한 다양한 데이터를 수집, 저장, 추출, 전달 등 중 적어도 하나를 수행한다. 상기 데이터베이스(DB)는 본 발명과 관련하여 필요한 경우에는 추가로 더 포함될수 있다. 한편, 전술한 도 1과 2의 각 구성요소 및 그들 간의 상호 연동 등 인공지능 제어 이러닝 서비스에 대하여, 도 3 이하를 참조하여 더욱 상세하게 설명한다. 도 3은 본 발명의 일실시예에 따른 인공지능 제어 이러닝 서비스 제공 방법을 설명하기 위한 도면, 도 4 내지 7 은 본 발명의 일실시예에 따른 학습효능심리평가(SELF)를 설명하기 위해 도시한 도면, 그리고 도 8은 본 발명의 일실시예에 따른 학습능력진단평가(SAE)를 설명하기 위해 도시한 도면이다. 이하에서 도 3에서 후술하는 각 과정은 인공지능 제어 이러닝 서비스 서버 의 관점에서 기술한다. 다만, 이에 한정되는 것은 아니며, 도 3으로부터 단말 또는/및 인공지능 제어 이러닝 서비스 시스템의 관점 및 내용도 도출 가능함은 당업자에게 자명하다 할 것이다. 도 3을 참고하면, 본 발명에 따른 인공지능 제어 이러닝 서비스는 편의상 단말을 통해 이루어지며 이러한 서비 스를 위하여 사전 등록을 예로 한다. 관련하여, 인공지능 제어 이러닝 서비스 서버는 단말(102,104)로부터 상기 등록을 위하여 개인 정보를 수 신한다(S301). 여기서, 상기 개인 정보라 함은, 단말을 통해 지능형 서비스를 이용하는 개인의 성별, 나이, 주 거지, 교육 정도 등 다양한 정보가 포함된다. 또한, 상기 개인 정보는 상기 등록 이후에 업데이트되거나 변경 등이 되는 경우에는 재전송되어 인공지능 제어 이러닝 서비스 서버의 데이터베이스(DB)에 저장될 수 있다. 상기 업데이트나 변경되는 정보에는 예를 들어, 서비스 등록 이후에 학습자의 현재 레벨, 레벨 추천뿐만 아니라 기타 상기 인공지능 제어 이러닝 서비스 이용 과정에서 발생되는 다양한 학습자 정보가 포함될 수 있다. 또한, 상기 개인 정보에는 상기 단말(102,104)에 대한 식별 정보 등이 포함될 수 있다. 인공지능 제어 이러닝 서비스 서버는 상기 단말(102,104)의 수신된 개인 정보에 기초하여 학습자에 대한 개인 정보를 분석한다(S302). 이렇게 분석된 데이터는 데이터베이스(DB)에 저장될 수 있다. 인공지능 제어 이러닝 서비스 서버는 단말(102,104)에서 관련 인공지능 제어 이러닝 서비스 어플리케이션 이 실행되거나 관련 웹사이트 방문 등 인공지능 제어 이러닝 서비스 요청이 있으면, 상기 S302 단계에서 분석한 해당 학습 단말(102,104)의 개인 정보에 기초하여 학습효능심리평가(SELF: Self-efficacy for Learning Form) 와 학습능력진단평가(SAE: Studying Ability Evaluation) 데이터를 상기 학습 단말(102,104)로 전송하고, 상기 학습 단말(102,104)에서 상기 학습효능심리평가(SELF)와 학습능력진단평가(SAE: Studying Ability Evaluation) 수행 데이터를 리턴한다(S303). 상기 학습효능심리평가(SELF) 또는/및 학습능력진단평가(SAE)는 본 발명의 일 실시예에 따르면, 학습 시작시 학 습 능력에 따른 교과과정(VCT: Variable Curriculum Template) 설정을 위한 한 방법일 수 있다. 상기 학습효능심리평가(SELF)는 일실시예에 따르면, 학습자의 자기 자신에 관한 주관적 신뢰도이며, 일반적 학 습 방식을 통해 새로운 지식과 기술을 성공적으로 획득하기 위해 학습내용을 이해하고, 분석하며, 기억할 수 있 는지에 관한 주관적인 믿음 측정에 관한 것으로, 이를 위해 총 19개의 질문으로 구성되는데, 이는 노트 테이킹 (note taking), 독해(reading), 쓰기(writing), 테스트-테이킹(test-taking), 학습과 같은 학습자의 다양한 러 닝 메쏘드를 측정을 위한 이전 리서치(Zimmerman & Kitsantas, 2007)에 의해 개발된 것일 수 있다. 학습자는 도 4 내지 7에 도시된 것과 같은 질문들에 대하여 0에서 100퍼센트 범위의 스케일링 값을 응답으로 전송하면 된다. 이때, 높은 스코어 값일수록 효능감이 커지는데 이는 즉, 학습에 관한 자신감이 높고 자신감이 높을수록 학습 성실도와 성공확률이 높아짐을 의미한다. 다만, 도 4 내지 7과 이러한 정의는 본 발명의 이해를 돕고 설명의 편 의를 위한 일실시예로서, 본 발명이 이에 한정되는 것은 아니다. 다음으로, 학습능력진단평가(SAE: Studying Ability Evaluation)는 언어 러닝에 대한 서브젝트들에 대한 복수의 문항으로 구성될 수 있다. 여기서, 상기 문항들은 문법(grammar), 어휘(vocabulary), 독해 이해도(reading comprehension), 쓰기(writing), 듣기(listening), 및 말하기(speacking)에 관한 현재 언어 숙련도를 평가하기 위한 항목을 일 실시예로 한다. 관련하여, 도 8에서는 본 발명의 일실시예에 따른 학습능력진단평가(SAE) 항목 을 설명하기 위해 예시하였다. 도 8을 참조하면, 상기 스코어가 높을수록 학습능력이 우수하고 더 나은 학습효 과를 기대할 수 있고 상기 스코어 결과를 교과 과정 채택에 반영할 수 있다. 전술한 바와 같이, 학습효능심리평가(SELF)와 학습능력진단평가(SAE)의 결과는 인공지능 제어 이러닝 서비스 서 버에 전송이 되고, 상기 인공지능 제어 이러닝 서비스 서버는 그에 대한 응답을 피드백할 수 있다. 상기 인공지능 제어 이러닝 서비스 서버는 상기 피드백과 함께 또는 별도로 상기 학습자의 개별맞춤교과과정(PCT: Personalized Curriculum Template)을 제공하고 수행하도록 제어한다(S304). 상기 개별맞춤교과과정(PCT)는 학습자의 특성, 학습 컨텐츠 선호도, 학습 효능감 등에 기초하여 특별히 개발된 학습 서브젝트를 위한 다양한 템플릿들일 수 있다. 이를 위하여, 상기 개별맞춤교과과정(PCT)은 레슨(Lesson), 렉쳐(Lecture), VoD(인강) 등의 형태로 수행되며 그로부터 학습자의 숙련도 레벨, 학습 텍스트북, 비디오 파일 들, 오디오 파일들을 추출하여 분석할 수 있다. 이는 상기 서브젝트에 대한 특정 강사에 의해 사용될 수 있다. 상기와 같이, 단말(102,104)의 개별맞춤 교과과정(PCT)의 결과는 인공지능 제어 이러닝 서비스 서버에 전 달되고 분석되어 데이터베이스(DB)에 저장되어 추후 이용된다. 상기 인공지능 제어 이러닝 서비스 서버는 상기 개별맞춤 교과과정(PCT) 수행 후에 학습진행평가(LPE: Learning Progress Evaluation)을 수행하도록 제어하고, 단말(102,104)은 상기 학습진행평가(LPE)의 결과를 전 달한다(S305). 상기 학습진행평가(LPE)는 복수의 항목으로 구성된 쓰기 및 구술 테스트로서, 상기 학습자의 특정 서브젝트에 대한 학습 진도를 평가하는 점에서 상기 학습능력진단평가(SAE)와 유사하다. 인공지능 제어 이러닝 서비스 서버는 상기 단말(102,104)의 학습진행평가(LPE) 결과를 수신하여 분석하고 데이터베이스(DB)에 저장한다. 이러한 학습진행평가(LPE)는, 주단위 또는 월단위로 수행될 수 있으며, 상 기 개별맞춤교과과정(PCT) 다를 수 있다. 다만, 본 발명은 이에 한정되는 것은 아니다. 한편, 상기 평가 주기는 임의 설정 가능하며, 학습자의 스케줄 진도 등에 따라 다양하게 정의 가능하다. 상기 인공지능 제어 이러닝 서비스 서버는 전술한 과정들 중 적어도 하나에 기초하여 즉, 데이터를 계산, 분석, 추출 등을 하여 교과 과정에 대한 제어 신호(제1 제어 커맨드 포함)를 단말(102,104)로 전달하고, 상기 단말(102,104)에서는 상기 인공지능 제어 이러닝 서비스 서버의 제어 신호에 대응되는 동작을 수행 즉, 교 과 과정을 조정할 수 있다(S306,S307). 여기서, 상기 교과 과정을 조정한다 함은, 기 제공된 즉, 학습자에 대해 제공되고 있는 현재의 교과 과정에 기 초하여 적어도 하나 이상을 변경 처리함을 의미하는데 여기서 조정되는 내용과 정도는 상기 인공지능 제어 이러 닝 서비스 서버에 의해 결정될 수 있다. 인공지능 제어 이러닝 서비스 서버는 이와 같이, 현재 교과 과정을 조정하도록 하여 상기 조정된 교과 과 정이 현재 학습자에게 어떠한 영향을 주는지를 판단하기 위하여 학습결과평가(SRA: Study Result Assessment)를 수행하도록 제어하고, 상기 단말(102,104)은 상기 제어에 따른 학습결과평가(SRA) 데이터를 상기 인공지능 제어 이러닝 서비스 서버로 리턴한다(S308). 상기 학습결과평가(SRA)는 역시 각 숙련도 레벨이 완료될 때 제공될 수 있는 쓰기 또는/및 구술 테스트로서, 상 기 결과는 학습자의 다음 레벨로의 레벨업 여부를 판단하는데 이용될 수 있다. 상기 인공지능 제어 이러닝 서비스 서버는 상기 S308 과정을 통해 조정 변경된 교과과정에 대한 학습결과 평가(SRA)에 기초하여 학습자 개인에 대한 빅데이터를 분석하여 저장하고, 제2 제어 커맨드를 상기 단말 (102,104)로 전송할 수 있다(S309,S310). 여기서, 상기 제2 제어 커맨드는 다양하게 정의할 수 있다. 예를 들어, 상기 제2 제어 커맨드는 전술한 S303 내 지 S308 과정 중 적어도 하나 이상을 다시 수행하거나 전체 과정을 수행하라거나 일부 또는 전체 과정을 소정 횟수 이상 또는 소정 응답 결과가 수신될 때까지 수행하도록 제어하는 신호일 수 있다. 한편, 상기 S301 내지 S310 과정은 본 발명의 일 실시예에 따르면, 인공지능 제어 이러닝 서비스 서버가 제공 가능한 다양한 학습 레벨이나 프로그램 중 하나의 학습 레벨이나 프로그램에 대한 것일 수 있다. 따라서, 예컨대, 상기 제2 제어 커맨드는 상기 학습 레벨에 대한 학습 완료에 따라 레벨업 추천에 대한 제어 신 호일 수도 있다. 비록 도시되진 않았으나, 학습 시작시에 참조되는 내용으로, 전술한 학습효능심리평가(SELF)와 학습능력진단평 가(SAE) 이외에 어휘기억력 측정검사(VMAT: Vocabulary Memorization Ability Test), 영어능력진단평가(EFE: English Fluency Evaluation) 등 중 적어도 하나 이상이 더 이용될 수 있다. 상기 어휘기억력 측정검사(VMAT)는 영어 단어 학습 후 기억하는 단어를 답안에 작성하는 방식으로 이루어지는데, 이를 위해 영어 수준에 따라 영어단어 10개 선정, 단어의 스펠링, 발음 관련 그림 3장, 한국어번역 해설로 20분간 학습, 60분간 다른 설문 검사 실시, 학습한 영어단어 중 기억하는 단어를 답안에 작성, 정 답 갯수에 따라 A(9-10), B(8-7), C(5-6), D(3-4), E(1-2) 5 단계 군 분류하고 결과를 바탕으로 차별된 학습 방법 제시할 수 있는 방법이다. 한편, 상기 영어능력진단평가(EFE)는, 영어학습자의 현재 영어 능력을 평가하는 방식으로, 평가 영역에는 독해, 듣기, 말하기, 작문이 존재하고, 상기 독해(Reading Comprehension, 25문항)는 지문을 읽고 내용의 파악 정도를 평가하는 질문으로 구성되고, 상기 듣기(Listening Comprehension, 25문항)는, 다양한 영어 파일을 듣고 내용에 대해 묻는 질문으로 구성되고, 상기 말하기(Speaking)는 5개의 질문에 대해 학습자의 생각을 답하는 형식(30 분)이고, 상기 작문(Writing)은 주어진 주제에 대한 에세이 작문(40분간)으로 구성되어, 각 영역 25점씩 평점, 총 100점으로 학습자의 각 영역별 강점과 약점을 파악 개선 학습 방안 추천할 수 있다. 한편, 전술한 학습 시작 전과 달리, 학습 시작 후에는 레슨 데이터, 강좌 데이터, 단계별 진도 평가(LPE), 단 계별 학습 완료 후 결과 평가(LCA: Level Competency Assessment)로 이루어질 수 있다. 상기 레슨 데이터와 강 좌 데이터는 개인맞춤교과과정(PCT) 데이터일 수 있다. 먼저, 레슨 데이터와 관련하여, 지능형 이러닝 강사와 학습자 간의 레슨 비디오를 레슨 번호와 일자 등의 인식 데이터와 함께 서버 아카이브에 저장하고, 상기 레슨 비디오 데이터에서 오디오 데이터 추출하여, 추출한 오디 오 데이터를 텍스트로 변환하여 파일로 저장한다. 그리고 저장된 텍스트를 검색하여 학습자의 학습 이해 정도 파악 및 분석한다. 이때, 더 참조되는 것은 주제별 지도를 받는 시간, 지도 시작 후 이해했다는 음성 반응(네 알겠습니다 등) 까지의 소요시간, 지도 중 또는 완료 후 이해 못하는 부분에 대한 질문 개수와 횟수, 동일 질문 의 반복 횟수 등이 포함될 수 있다. 다음으로, 강좌 데이터와 관련하여, 실시간 중계 강좌(LiVib)와 강좌 VoD를 시청하고 주제별 평가 질문에 대한 평가 점수, 주제별 10-20점, 동일한 비디오 컨텐츠VOD 총 학습 시간, 동일한 비디오 반복 시청 횟수 등이 참조 될 수 있다. 또한, 전술한 단계별 진도 평가(LPE)는 영어능력진단평가 (EFE) 동일한 방식으로 월 1회 실시 후 학습자의 점수 를 저장하고, 월별 점수를 평균으로 환산 각 단계 학습 정도 판단 근거 자료로 활용할 수 있다. 다음으로, 단계별 학습 완료 후 결과 평가(LCA: Level Competency Assessment)는 영어능력진단평가(EFE)와 동 일한 방식으로 각 영역별 학습 결과를 측정 데이터로 저장한다. 그리고 월별진도평가(LPE) 점수와 합산 평균하 여 70점 이상 획득시 다음 단계로 진행 추천 등을 할 수 있을 것이다. 상기 인공지능 제어 이러닝 서비스 서버는 전술한 모든 데이터 중 적어도 하나 이상을 저장하고 분석하여 학습자의 각 영역별 강점과 취약점을 파악한 후 가변 교과과정을 학습자에 맞게 변경하고 더 효과적인 학습 방 안을 제시할 수 있다. 이때, 다음 사항들 중 적어도 하나 이상 또는 전부가 참조될 수 있는데, 레슨 학습 이해 능력 측정, 자기 주도학습 데이터를 분석하여 학습 경향 파악, 연습 데이터 분석을 통한 연습 시간과 언어 능력 향상 정도 기록, 각 학습자별 각 영역 점수 및 향상 또는 저하 기록, 각 주제별 단계별 학습 기간 시간 등을 기 록 분석, 학습 중 또는 완료시 영역별 강점과 취약점을 점수로 기록(각 영역 100점) , 학습자의 연령, 성별, 교 육정도,성향에 따라 작성된 가변 교과과정을 월별, 단계별로 학습자에 맞게 추천 조정, 새롭게 추천된 교과과정 에 따른 결과를 기록하고 재검토, 결과에 따른 교과과정 재조정, 데이터 분석으로 개별 맞춤형 교과과정 추천, 데이터 분석에 따라 교과과정 완료 시간 예상, 모든 데이터 분석으로 개별 또는 전체 매출 예상 등이 포함될 수 있다. 상술한 도 4 내지 8 즉, 학습효능심리평가(SELF), 학습능력진단평가(SAE), 어휘기억력측정검사(VMAT), 영어능력 진단평가(EFE) 등은 지능형 이러닝 학습 시작시에 학습 능력에 맞춘 교과과정(VCT) 설정을 위한 학습 능력 평가 참조 데이터인 것을 일 실시예로 한다. 또한, 본 명세서에서 인공지능 제어 이러닝 서비스 서버라고 명명한 경우에 그것은 오롯이 인공지능 모듈 에 의해 수행될 수도 있고, 도 2의 구성요소 중 적어도 하나 이상이 관여하여 수행될 수도 있다. 한편, 단말은 본 발명에 따른 인공지능 제어 이러닝 서비스를 위하여 디스플레이, 스피커, 마이크 중 적어도 하 나 이상을 포함하거나 외부의 그러한 디바이스(들)과 연동되어 이용 가능한 것이 바람직하다 할 것이다. 이상 상술한 본 발명에 따르면, 인공지능 제어 이러닝 서비스 시스템에 기초하여 서버단에는 학습자의 개인 정 보에 기초하여 적정한 학과과정 제공으로 인해 학습자의 학업 효율, 흥미 등을 떨어뜨리지 않고 레벨을 이끌 수 있으며, 학습자 역시 자기 주도 학습을 수행하고 서비스 서버의 각종 피드백 데이터에 기초함으로써 학습레벨,학습 등에 대한 다양한 정보를 접하고 학습 효율을 높여 실력을 업그레이드할 수 있으며, 다양한 연습을 한 번 에 수행할 수 있다. 또한, 비록 도시되진 않았으나, 전술한 내용 및 과정들은 학습자의 개인 정보 특히, 나이, 성별, 등에 따라 서 로 다른 가중치를 두어 서로 다르게 제어할 수 있다. 또한, 상기 제어는 시기 예를 들어, 일 기준으로 오전, 오 후, 저녁, 밤, 식사 후 등과 같이, 종래 학습자에 대한 전술한 데이터 외에 인공지능 제어 이러닝 서비스 서버 에서 제공 가능한 다양한 정보를 조합 이용함으로써 더욱 효용성을 높일 수 있다. 또한, 인공지능 제어 이러닝 서비스 서버는 학습 레벨에 따라 매 학습 레벨에서의 제어를 다르게 할 수도 있다. 예컨대, 학습자가 레벨을 업할수록 해당 학습자에 대한 데이터(빅 데이터)는 많아지고 이로부터 서비스 제어를 더욱 디테일하고 정확하고 다양하게 할 수 있을 것이다. 이러한 제어에는 해당 학습 레벨의 교과과정의 길이, 순서, 내용 등의 다양한 제어가 포함될 수 있다. 본 발명은 인공지능 제어 이러닝 서비스에 관한 것으로 학습자의 연령 등에 따라 동화책을 학습 자료나 상기 판 단을 위한 자료로 이용한다거나 저명한 신문이나 기출문제 등 객관적인 자료를 이용함으로써 신뢰도를 높이고 효율을 높일 수도 있다. 이는 단지 언어 학습만을 위한 것은 아니며 다양한 분야에 이용 가능하다. 본 발명의 다른 일실시예에 따른 서버의 인공지능 제어 이러닝 서비스 제공 방법은, (a) 단말의 정보를 수신하 여 분석하고 저장하는 단계; (b) 학습효능심리평가(SELF)와 학습능력진단평가(SAE)에 대한 제1 데이터를 수신하 는 단계; (c) 개별맞춤 교과과정(PCT)에 대한 제2 데이터를 수신하는 단계; (d) 상기 제1 데이터와 제2 데이터 의 분석하고, 상기 분석 내용에 따라 학습진행평가(LPE) 데이터를 수신하는 단계; (e) 상기 학습진행평가(LPE) 데이터를 분석하고, 상기 분석 내용에 따라 상기 단말의 교과과정 제어 신호를 전송하는 단계; 및 (f) 학습결과 평가(SRA) 수행을 제어하고 관련 데이터를 수신/분석하여 학습 레벨을 제어하는 단계;를 포함하여 이루어지되, 상기 (a) 단계와 (b) 단계는, 지능형 이러닝 학습 시작 전에 수행되고 이후에는 수행되지 않는 것을 특징으로 하되, 상기 (a) 단계는 상기 단말 정보의 업데이트 시에는 수행되고, 상기 (b) 단계에서, 어휘기억력 측정검사 (VMAT: Vocabulary Memorization Ability Test)와, 영어능력진단평가(EFE: English Fluency Evaluation) 중 적 어도 하나의 데이터를 더 수신하고, 상기 (c) 내지 (f) 단계는, 상기 서버에서 미리 설정된 매 학습 레벨마다 수행되고, 상기 (c) 내지 (f) 단계 사이에는, 레슨 데이터 수신하는 단계; 강좌 데이터 수신하는 단계; 또는 상 기 단계별 학습진행평가(LPE) 이후 단계별 학습 완료 후 결과 평가(LCA: Level Competency Assessment) 데이터 를 수신하는 단계; 중 적어도 하나를 더 수행하고, 상기 학습효능심리평가(SELF)는, 학습자의 자기 자신에 관한 주관적 신뢰도에 관한 것으로, 일반적 학습 방식을 통해 새로운 지식과 기술을 성공적으로 획득하기 위해 학습 내용의 이해, 분석 및 기억에 관한 주관적인 믿음을 측정과 관련하여 개발된 데이터를 이용하여 수행되고, 상기 학습능력진단평가(SAE)는, 문법(grammar), 어휘(vocabulary), 독해 이해도(reading comprehension), 쓰기 (writing), 듣기(listening), 및 말하기(speacking)에 관한 현재 언어 숙련도를 평가하기 위한 항목을 포함하여, 언어 학습에 대한 서브젝트들에 대한 복수의 문항으로 구성되며, 상기 개별맞춤교과과정(PCT)는, 학 습자의 특성, 학습 컨텐츠 선호도, 및 학습 효능감에 기초하여 개발된 학습 서브젝트를 위한 다양한 템플릿들을 통해 이루어지고, 상기 학습진행평가(LPE)는 학습자의 특정 서브젝트에 대한 학습 진도를 평가하며, 상기 학습 결과평가(SRA)는 각 숙련도 레벨이 완료될 때 제공될 수 있는 쓰기 또는/및 구술 테스트로서, 상기 결과는 학습 자의 다음 레벨로의 레벨업 여부를 판단하는데 이용하는 것을 특징으로 한다. 한편, 상술한 방법은, 컴퓨터에서 실행될 수 있는 프로그램으로 작성 가능하고, 컴퓨터 판독 가능 매체를 이용 하여 상기 프로그램을 동작시키는 범용 디지털 컴퓨터에서 구현될 수 있다. 또한, 상술한 방법에서 사용된 데이 터의 구조는 컴퓨터 판독 가능 매체에 여러 수단을 통하여 기록될 수 있다. 본 발명의 다양한 방법들을 수행하 기 위한 실행 가능한 컴퓨터 코드를 저장하는 컴퓨터 판독 가능 매체는 마그네틱 저장매체(예를 들면, 롬, 플로 피 디스크, 하드 디스크 등), 광학적 판독 매체(예를 들면, 시디롬, DVD 등)와 같은 저장 매체를 포함한다. 본원 발명의 실시예들과 관련된 기술 분야에서 통상의 지식을 가진 자는 상기 기재의 본질적인 특성에서 벗어나 지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로, 개시된 방법들은 한정적 인 관점이 아닌 설명적 관점에서 고려되어야 한다. 본 발명의 범위는 발명의 상세한 설명이 아닌 특허청구 범위 에 나타나며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명의 범위에 포함되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2018-0077911", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명이 적용될 수 있는 인공지능 제어 이러닝 서비스 네트워크 환경을 설명하기 위해 도시한 도면이 다. 도 2는 본 발명의 일실시예에 따른 인공지능 제어 이러닝 서비스 서버의 구성 블록도이다. 도 3은 본 발명의 일실시예에 따른 인공지능 제어 이러닝 서비스 제공 방법을 설명하기 위해 도시한 도면이다. 도 4 내지 7은 본 발명의 일실시예에 따른 학습효능심리평가(SELF)를 설명하기 위해 도시한 도면이다. 도 8은 본 발명의 일실시예에 따른 학습능력진단평가(SAE)를 설명하기 위해 도시한 도면이다."}
