{"patent_id": "10-2023-0120837", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0038296", "출원번호": "10-2023-0120837", "발명의 명칭": "인공지능을 이용한 맞춤형 생활 큐레이팅 장치 및 그 장치의 구동방법", "출원인": "(주)코리얼에셋", "발명자": "채우석"}}
{"patent_id": "10-2023-0120837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "신체 정보, 체중 목표, 평소 활동량, 영양 목표 및 건강 목표 중 적어도 하나와 관련한 기본정보 데이터 및 상기 기본정보 데이터를 근거로 제공 가능한 생활 서비스에 관련되는 생활 서비스 데이터를 저장하는 저장부; 및상기 저장한 기본정보 데이터 및 상기 생활 서비스 데이터를 분석하여 분석 결과를 학습하며, 사용자의 사용자단말장치에서 상기 기본정보 데이터와 관계되는 사용자별 기본정보를 제공한 후 인공지능(AI) 기반의 챗봇 서비스를 이용하여 건강, 식이, 운동 또는 영양과 관련해 질문할 때 상기 학습 결과를 근거로 사용자별로 개인화된맞춤형 생활 솔루션을 제공하는 제어부;를포함하는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치."}
{"patent_id": "10-2023-0120837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 챗봇 서비스를 제공할 때 화면상에 사용자가 이용가능한 서비스 메뉴항목을 표시하고, 사용자에 의해 지정 메뉴항목이 선택되면 상기 선택한 메뉴항목과 관련한 질문의 예시문을 화면상에 제시하여 사용자가 상기 예시문을 참조해 질문하도록 유도하는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치."}
{"patent_id": "10-2023-0120837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는, 상기 메뉴항목으로서 식단추천, 식당추천, 식당검색, 식품검색 및 음식추천 중 복수의 메뉴항목을 제공하는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치."}
{"patent_id": "10-2023-0120837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어부는, 상기 사용자가 상기 식당추천의 항목을 선택할 때 과거에 사용자의 위치, 음식 선호도 및 목표에 따라 식단을 제안해 거절되었던 음식을 판매하는 식당은 제외하여 제안하며, 상기 제안한 식당에 만족할 때상기 만족하는 식당에 예약을 자동으로 진행시키는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치."}
{"patent_id": "10-2023-0120837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 제어부는 상기 사용자가 상기 식품검색의 항목을 선택할 때 사용자가 검색하는 음식 또는 식품을 판매하는웹사이트를 찾아내어 상기 찾아낸 웹사이트의 목록을 제공하는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치."}
{"patent_id": "10-2023-0120837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "저장부가 신체 정보, 체중 목표, 평소 활동량, 영양 목표 및 건강 목표 중 적어도 하나와 관련한 기본정보 데이터 및 상기 기본정보 데이터를 근거로 제공 가능한 생활 서비스에 관련되는 생활 서비스 데이터를 저장하는 단계; 및제어부가 상기 저장한 기본정보 데이터 및 상기 생활 서비스 데이터를 분석하여 분석 결과를 학습하며, 사용자의 사용자 단말장치에서 상기 기본정보 데이터와 관계되는 사용자별 기본정보를 제공한 후 인공지능 기반의 챗봇 서비스를 이용하여 건강, 식이, 운동 또는 영양과 관련해 질문할 때 상기 학습 결과를 근거로 사용자별로 개인화된 맞춤형 생활 솔루션을 제공하는 단계;를포함하는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치의 구동방법.공개특허 10-2025-0038296-3-청구항 7 제6항에 있어서,상기 맞춤형 생활 솔루션을 제공하는 단계는,상기 챗봇 서비스를 제공할 때 화면상에 사용자가 이용가능한 서비스 메뉴항목을 표시하는 단계; 및사용자에 의해 지정 메뉴항목이 선택되면 상기 선택한 메뉴항목과 관련한 질문의 예시문을 화면상에 제시하여사용자가 상기 예시문을 참조해 질문하도록 유도하는 단계;를포함하는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치의 구동방법."}
{"patent_id": "10-2023-0120837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 맞춤형 생활 솔루션을 제공하는 단계는,상기 메뉴항목으로서 식단추천, 식당추천, 식당검색, 식품검색 및 음식추천 중 복수의 메뉴항목을 제공하는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치의 구동방법."}
{"patent_id": "10-2023-0120837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 맞춤형 생활 솔루션을 제공하는 단계는,상기 사용자가 상기 식당추천의 항목을 선택할 때 과거에 사용자의 위치, 음식 선호도 및 목표에 따라 식단을제안해 거절되었던 음식을 판매하는 식당은 제외하여 제안하는 단계; 및상기 제안한 식당에 만족할 때 상기 만족하는 식당에 예약을 자동으로 진행시키는 단계;를더 포함하는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치의 구동방법."}
{"patent_id": "10-2023-0120837", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 상기 맞춤형 생활 솔루션을 제공하는 단계는,상기 사용자가 상기 식품검색의 항목을 선택할 때 사용자가 검색하는 음식 또는 식품을 판매하는 웹사이트를 찾아내어 상기 찾아낸 웹사이트의 목록을 제공하는 단계;를 더 포함하는, 인공지능을 이용한 맞춤형 생활 큐레이팅 장치의 구동방법."}
{"patent_id": "10-2023-0120837", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능을 이용한 맞춤형 생활 큐레이팅 장치 및 그 장치의 구동방법이 개시된다. 본 발명의 일 실시예에 따른 인공지능을 이용한 맞춤형 생활 큐레이팅 장치는 신체 정보, 체중 목표, 평소 활동량, 영양 목표 및 건강 목표 중 적어도 하나와 관련한 기본정보 데이터 및 기본정보 데이터를 근거로 제공 가능한 생활 서비스에 관련되는 생 활 서비스 데이터를 저장하는 저장부, 및 기저장한 기본정보 데이터 및 생활 서비스 데이터를 분석하여 분석 결 과를 학습하며, 사용자의 사용자 단말장치에서 기본정보 데이터와 관계되는 사용자별 기본정보를 제공한 후 인공 지능 기반의 챗봇 서비스를 이용하여 건강, 식이, 운동 또는 영양과 관련해 질문할 때 학습 결과를 근거로 사용 자별로 개인화된 맞춤형 생활 솔루션을 제공하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2023-0120837", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 이용한 맞춤형 생활 큐레이팅 장치 및 그 장치의 구동방법에 관한 것으로서, 더 상세하게 는 가령 어플리케이션(이하, 앱) 로그인 시 최초 1회만 이용자에게 데이터를 제공받고, 그 제공받은 데이터를 분석하여 이용자에게 필요한 요소, 부족한 요소가 무엇인지 판단하고, 이를 가공하여 인공지능(AI) 챗봇을 통해 이용자에게 개인화된 솔루션을 제공하는 인공지능을 이용한 맞춤형 생활 큐레이팅 장치 및 그 장치의 구동방법 에 관한 것이다."}
{"patent_id": "10-2023-0120837", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통상적으로 큐레이팅(Curating)이라 할 때 과거에는 전문 지식을 가지고 미술관 컬렉션을 관리하는 일을 의미했 다. 그렇지만 큐레토리얼 실천과 담론의 진화를 통해 큐레이터는 예술 활동과 유사한 창조적 활동을 하는 집단 으로 이해되기 시작했다. 이에 큐레이팅은 여러 정보를 수집, 선별하고 이에 새로운 가치를 부여해 전파하는 것 을 말하는 큐레이션에 큐레이터의 활동을 포함하여 정보를 수집, 종합하고 정보가 필요한 사람들에게 안내해주 는 활동을 의미하는 것으로 진화되었다.이러한 큐레이션의 일환으로서 최근에는 현대인들의 복잡다난한 생활을 큐레이션하는 가령 MZ세대를 위한 여가 생활을 큐레이팅하는 등의 서비스가 일부 선보이고 있으며, 세상의 다양한 여가생활과 라이프스타일을 담은 뉴 스레터 서비스 등을 통해 여가생활을 큐레이팅하는 서비스를 제공하고 있다. 그런데 많은 사용자들에게는 자신의 생활과 관련한 부분을 큐레이팅한다는 것이 생소할 뿐 아니라 아직까지 대 중적인 서비스가 없어 많은 사용자들이 가장 관심을 가지는 건강이나 습관 등과 관련한 서비스를 통해 자신의 생활 패턴을 큐레이션하여 건강한 생활을 영위할 수 있도록 하는 서비스 개발이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-2467340호(2022.11.10) (특허문헌 0002) 한국등록특허공보 제10-2560486호(2023.07.24) (특허문헌 0003) 한국등록특허공보 제10-2538759호(2023.05.26) (특허문헌 0004) 한국등록특허공보 제10-2544986호(2023.06.14) (특허문헌 0005) 한국등록특허공보 제10-2218326호(2021.02.16)"}
{"patent_id": "10-2023-0120837", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 가령 앱 로그인 시 최초 1회만 이용자에게 데이터를 제공받고, 그 제공받은 데이터를 분석하여 이용자에게 필요한 요소, 부족한 요소가 무엇인지 판단하고, 이를 가공하여 인공지능(AI) 챗 봇을 통해 이용자에게 개인화된 솔루션을 제공하는 인공지능을 이용한 맞춤형 생활 큐레이팅 장치 및 그 장치의 구동방법을 제공하는 것이다. 본 발명의 과제들은 이상에서 언급한 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0120837", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 본 발명의 일 실시예에 따른 인공지능을 이용한 맞춤형 생활 큐레이팅 장치는 신체 정보, 체중 목표, 평소 활동량, 영양 목표 및 건강 목표 중 적어도 하나와 관련한 기본정보 데이터 및 상기 기 본정보 데이터를 근거로 제공 가능한 생활 서비스에 관련되는 생활 서비스 데이터를 저장하는 저장부, 및 상기 저장한 기본정보 데이터 및 상기 생활 서비스 데이터를 분석하여 분석 결과를 학습하며, 사용자의 사용자 단말 장치에서 상기 기본정보 데이터와 관계되는 사용자별 기본정보를 제공한 후 인공지능 기반의 챗봇 서비스를 이 용하여 건강, 식이, 운동 또는 영양과 관련해 질문할 때 상기 학습 결과를 근거로 사용자별로 개인화된 맞춤형 생활 솔루션을 제공하는 제어부를 포함한다. 상기 제어부는, 상기 챗봇 서비스를 제공할 때 화면상에 사용자가 이용가능한 서비스 메뉴항목을 표시하고, 사 용자에 의해 지정 메뉴항목이 선택되면 상기 선택한 메뉴항목과 관련한 질문의 예시문을 화면상에 제시하여 사 용자가 상기 예시문을 참조해 질문하도록 유도할 수 있다. 상기 제어부는, 상기 메뉴항목으로서 식단추천, 식당추천, 식당검색, 식품검색 및 음식추천 중 복수의 메뉴항목 을 제공할 수 있다. 상기 제어부는, 상기 사용자가 상기 식당추천의 항목을 선택할 때 과거에 사용자의 위치, 음식 선호도 및 목표 에 따라 식단을 제안해 거절되었던 음식을 판매하는 식당은 제외하여 제안하며, 상기 제안한 식당에 만족할 때 상기 만족하는 식당에 예약을 자동으로 진행시킬 수 있다. 상기 제어부는 상기 사용자가 상기 식품검색의 항목을 선택할 때 사용자가 검색하는 음식 또는 식품을 판매하는 웹사이트를 찾아내어 상기 찾아낸 웹사이트의 목록을 제공할 수 있다.상기 과제를 해결하기 위한 본 발명의 일 실시예에 따른 인공지능을 이용한 맞춤형 생활 큐레이팅 장치의 구동 방법은 저장부가 신체 정보, 체중 목표, 평소 활동량, 영양 목표 및 건강 목표 중 적어도 하나와 관련한 기본정 보 데이터 및 상기 기본정보 데이터를 근거로 제공 가능한 생활 서비스에 관련되는 생활 서비스 데이터를 저장 하는 단계, 및 제어부가 상기 저장한 기본정보 데이터 및 상기 생활 서비스 데이터를 분석하여 분석 결과를 학 습하며, 사용자의 사용자 단말장치에서 상기 기본정보 데이터와 관계되는 사용자별 기본정보를 제공한 후 인공 지능 기반의 챗봇 서비스를 이용하여 건강, 식이, 운동 또는 영양과 관련해 질문할 때 상기 학습 결과를 근거로 사용자별로 개인화된 맞춤형 생활 솔루션을 제공하는 단계를 포함한다. 상기 맞춤형 생활 솔루션을 제공하는 단계는, 상기 챗봇 서비스를 제공할 때 화면상에 사용자가 이용가능한 서 비스 메뉴항목을 표시하는 단계, 및 사용자에 의해 지정 메뉴항목이 선택되면 상기 선택한 메뉴항목과 관련한 질문의 예시문을 화면상에 제시하여 사용자가 상기 예시문을 참조해 질문하도록 유도하는 단계를 포함할 수 있 다. 상기 맞춤형 생활 솔루션을 제공하는 단계는, 상기 메뉴항목으로서 식단추천, 식당추천, 식당검색, 식품검색 및 음식추천 중 복수의 메뉴항목을 제공할 수 있다. 상기 맞춤형 생활 솔루션을 제공하는 단계는, 상기 사용자가 상기 식당추천의 항목을 선택할 때 과거에 사용자 의 위치, 음식 선호도 및 목표에 따라 식단을 제안해 거절되었던 음식을 판매하는 식당은 제외하여 제안하는 단 계, 및 상기 제안한 식당에 만족할 때 상기 만족하는 식당에 예약을 자동으로 진행시키는 단계를 더 포함할 수 있다. 상기 맞춤형 생활 솔루션을 제공하는 단계는, 상기 사용자가 상기 식품검색의 항목을 선택할 때 사용자가 검색 하는 음식 또는 식품을 판매하는 웹사이트를 찾아내어 상기 찾아낸 웹사이트의 목록을 제공하는 단계를 더 포함 할 수 있다."}
{"patent_id": "10-2023-0120837", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 서비스를 이용하는 이용자는 매번 정보를 재입력해야 하는 번거로운 과정을 생략하 여 건강, 식이, 운동, 영양 등을 한번에 관리할 수 있을 것이다. 또한 본 발명의 실시예에 따르면 AI는 이미 서비스를 이용하는 이용자의 데이터를 분석, 가공, 학습한 상태이기 때문에 이용자는 매 질문마다 본인의 정보를 제공하지 않고 간단한 질문을 하여 맞춤형 솔루션을 제공받을 수 있고, 나아가 이용자는 제안된 솔루션에 대해 실시간으로 피드백을 할 수 있으며, 이용자의 피드백을 통해 이용 자의 식이 습관, 취향, 생활 습관까지 분석, 예측이 가능하여 실시간으로 개선된 솔루션을 제공할 수 있다. 실시예들에 따른 효과는 이상에서 예시된 내용에 의해 제한되지 않으며, 더욱 다양한 효과들이 본 명세서 내에 포함되어 있다."}
{"patent_id": "10-2023-0120837", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는"}
{"patent_id": "10-2023-0120837", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 이하 도면을 참조하여 본 발명의 실시예에 대하여 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 인공지능을 이용한 맞춤형 생활 큐레이팅 시스템을 나타내는 도면이며, 도 2a 내지 도 2c는 챗봇 서비스 화면의 예시도이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 인공지능을 이용한 맞춤형 생활 큐레이팅 시스템(이하, 맞 춤형 생활 큐레이팅 시스템)은 사용자 단말장치, 통신망, 맞춤형 생활 큐레이팅 장치 및 서 드파티장치의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 서드파티장치와 같은 일부 구성요소가 생략되어 맞춤형 생활 큐레이팅 시스템이 구성되거나, 맞춤형 생활 큐레이팅 장치를 구성하는 구성요소의 일부 또는 전부가 통신망을 구성하는 네트워크장치(예: 무선교환장치 등)에 통합되어 구성될 수 있는 것 등을 의미하는 것으 로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 사용자 단말장치는 도 1의 맞춤형 생활 큐레이팅 장치에 접속하여 웹(web) 서비스나 앱(app.) 서비스 를 이용해 본 발명의 실시예에 따른 서비스를 이용하는 사용자들의 단말장치를 포함할 수 있다. 사용자 단말장 치은 데스크탑컴퓨터, 랩탑컴퓨터 등 PC 기반의 단말장치뿐 아니라 스마트폰, 태블릿PC, 그리고 사용자들 이 손목 등에 착용하는 웨어러블장치 등 모바일 기반의 단말장치를 포함할 수 있다. PC 기반의 단말장치를 통해 서는 웹 서비스를 이용할 수 있으며, 모바일 기반의 단말장치를 통해서는 앱 서비스를 이용할 수 있다. 사용자 단말장치의 사용자들은 맞춤형 생활 큐레이팅 장치의 서비스에 접속하여 회원가입을 위한 동 작을 먼저 수행할 수 있다. 회원가입을 하는 과정에서 또는 최초 로그인시에 자신에게 개인화된 맞춤형 생활 큐 레이팅 서비스를 제공받기 위하여 서비스 이용자의 기본정보를 제공할 수 있다. 여기서 기본정보란 성별, 신장, 체중, 나이 등의 신체 정보, 그리고 체중 관련 정보(혹은 체중 목표), 평소 활동량, 영양 목표 및 건강 목표 중 적어도 하나와 관련한 정보를 포함할 수 있다. 체중 관련 정보는 감량인지, 유지인지, 증량인지의 체중 목표(정 보), 또 구체적인 목표 체중, 나아가 가령 1주일에 몇 kg을 증/감하고 싶은지 등의 목표 체중 감량/증량 속도, 근육량을 늘리고 싶은지 등의 근력보강 의지 유무 등과 관련한 정보를 포함할 수 있다. 해당 기본정보를 제공하 기 위하여 사용자 인터페이스(UI) 화면은 다양하게 제공될 수 있으므로, 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 사용자 단말장치의 사용자는 자신의 기본정보를 제공한 이후에 맞춤형 생활 큐레이팅과 관련한 다양한 서 비스를 제공받을 수 있다. 여기서, 맞춤형 생활 큐레이팅은 다양한 서비스를 포함할 수 있다. 물론 본 발명의 실시예에 따라 사용자 단말장치는 메신저 기반의 인공지능 챗봇 서비스를 통해 인공지능 챗봇과의 인터랙 션을 통해 맞춤형 생활 서비스를 제공받을 수 있다. 맞춤형 생활 서비스에는 1) 식단 제안, 2) 식당 제안/택시 호출/식당 예약, 3) 영양성분표 스캔 & 맞춤형 영양정보 변환, 4) 체성분 검사지 스캔 & 정보 자동 입력, 5) 기 본정보 변경, 6) 앱 설정 변경, 7) 최저가 식품 구매, 8) 맞춤형 운동 추천 & 근거 제시, 9) 주변 헬스장 검색 과 가격 비교, 10) 영양제 Q & A와 큐레이팅 서비스, 11) 피드백을 통한 실시간 학습 등의 서비스가 포함될 수 있다. 본 발명의 실시예에서는 총 11가지의 서비스를 제공하는 것으로 열거하였지만, 그 이외에도 많은 서비스 들이 추가될 수 있다. 해당 서비스들과 관련한 자세한 내용은 이후에 맞춤형 생활 큐레이팅 장치를 설명하 면서 좀더 자세히 설명하기로 한다. 그 가운데 대표적으로 사용자 단말장치에서 이루어지는 서비스를 하나만 간략하게 설명해 보면, 사용자 단 말장치는 가령 앱을 실행하여 도 1의 맞춤형 생활 큐레이팅 장치의 서비스에 접속한 후 도 2a 내지 도 2c에서와 같은 형태의 챗봇 서비스를 제공받을 수 있다. 물론 해당 화면들은 실제로는 채팅 과정에서 서로 이어지는 화면이다. 사용자 단말장치의 사용자는 기설치되는 'mealscan' 서비스의 아이콘을 선택하여 본 발명의 실시예에 따른 앱을 실행시킬 수 있다. 이의 경우 화면상에는 인공지능 챗봇이 서비스를 안내하는 화면 이 제공될 수 있다. 이와 같이 안내 화면을 제공하면서 화면상에는 이용가능한 서비스 항목들이 표시될 수 있다. 이는 사용자들의 서비스 이용을 편리하게 하기 위해서라고 볼 수 있다. 도 2a에서 볼 수 있는 바와 같이, 식단추천, 식당추천, 식당검색, 음식추천, 영양질문 등의 항목이 표시되며, 이 중에서 사용자는 자신이 원하는 특정 항목을 선택할 수 있다. 예를 들어 도 2a에서와 같이 식단추천 항목이 선택될 수 있다. 이어 사용자 단말장치의 사용자는 자신이 선택한 식단추천 항목과 관련한 질문 유형을 안내받을 수 있다. 다시 말해, 도 1의 맞춤형 생활 큐레이팅 장치는 사용자들이 선택할 수 있는 질문의 유형을 예시하여 보여 주고 그와 유사한 형태로 질문하도록 유도함으로써 챗봇 서비스를 이용하는 사용자들의 불편함이 없도록 할 수 있다. 질문 유형의 예시에 따라 사용자는 도 2a에서와 같이 영양목표에 맞는 아침, 점심, 저녁의 식단을 추천해 달라고 인공지능 챗봇에 요청할 수 있다. 이어서 사용자 단말장치의 사용자는 인공지능 챗봇으로부터 다시 말해 챗봇 서비스를 통해 도 2b 및 도 2c에서와 같이 요청한 영양목표에 맞는 식단을 추천받을 수 있다. 인공지 능 챗봇은 이미 맞춤형 생활 큐레이팅 서비스를 제공하기 위하여 신체정보, 체중 목표, 평소 활동량, 건강 목표등과 관련한 기초대사량, BMI, 일일권장 섭취 칼로리 등 서비스 제공에 필요한 생활 서비스 데이터를 이미 학습 한 상태이므로 해당 학습 데이터와 사용자들이 제공한 기본정보를 근거로 그에 부합하는 식단추천, 식당추천 등 과 관련한 생활 큐레이팅 서비스를 제공할 수 있다. 도 2b 및 도 2c에서 볼 수 있는 바와 같이, 사용자 단말장치의 사용자는 자신이 사전에 제공한 기본정보를 근거로 아침식단으로서 가능한 다양한 식품정보를 제공받을 수 있으며, \"그릭요거트 오늘의 식단에 추가해줘\"와 같은 불명확한 요청에 대하여 \"아침,점식,저녁, 간식 중 어디에 추가해 드릴까요?\"와 같이 답변을 제공받으면서 단순히 사용자가 선택할 수 있도록 해당 항목들을 화면상에 표시해 줄 수 있다. 이에 따라 사용자들은 단순히 챗봇 서비스 화면상에서 선택하는 과정을 통해 자신이 원하는 정보를 얻을 수 있다. 물론 이후에도 사용자와 인 공지능 챗봇은 지속적인 대화를 진행할 수 있으며, 이러한 대화 과정의 이력(history)과 구체적인 대화 내용은 도 1의 맞춤형 생활 큐레이팅 장치로 제공되어 데이터 수집이 이루어질 수 있다. 인공지능 챗봇은 사용자 별 수집된 데이터를 지속적으로 분석 및 학습하면서 다음 대화시에도 사용자에게 필요한 요소, 부족한 요소가 무엇인지 판단하고 이를 가공하여 인공지능 챗봇을 통해 서비스 이용자에게 개인화된 솔루션을 제공할 수 있다. 통신망은 다양한 형태로 구성될 수 있다. 통신망은 유무선 통신망을 모두 포함할 수 있다. 가령 통신 망으로서 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서 유선망은 케이블망이나 공중 전화망 (PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함하는 의미이다. 물론 본 발명의 실시예에 따른 통신망 은 이에 한정되는 것이 아니며, 향후 구현될 차세대 이동 통신 시스템의 접속망으로서 가령 클라우드 컴퓨 팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있다. 가령, 통신망이 유선 통신망인 경우 통신망 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지만, 무선 통신망인 경우에는 통신사에서 운용하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속하여 데이터를 처리하거나, BTS(Base Transceiver Station), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터를 처리할 수 있다. 통신망은 액세스포인트를 포함할 수도 있다. 액세스포인트는 건물 내에 많이 설치되는 펨토(femto) 또는 피코(pico) 기지국과 같은 소형 기지국을 포함할 수 있다. 여기서, 펨토 또는 피코 기지국은 소형 기지국의 분 류상 사용자 단말장치 등을 최대 몇 대까지 접속할 수 있느냐에 따라 구분될 수 있다. 물론 펨토 또는 피 코 기지국은 사용자 단말장치 등과 지그비 및 와이파이(Wi-Fi) 등의 근거리 통신을 수행하기 위한 근거리 통신 모듈을 포함할 수 있다. 액세스포인트는 무선통신을 위하여 TCP/IP 혹은 RTSP(Real-Time Streaming Protocol)를 이용할 수 있다. 여기서, 근거리 통신은 와이파이 이외에 블루투스, 지그비, 적외선(IrDA), UHF(Ultra High Frequency) 및 VHF(Very High Frequency)와 같은 RF(Radio Frequency) 및 초광대역 통신(UWB) 등의 다양한 규격으로 수행될 수 있다. 이에 따라 액세스포인트는 데이터 패킷의 위치를 추출하고, 추출된 위치 에 대한 최상의 통신 경로를 지정하며, 지정된 통신 경로를 따라 데이터 패킷을 다음 장치, 예컨대 맞춤형 생활 큐레이팅 장치로 전달할 수 있다. 액세스포인트는 일반적인 네트워크 환경에서 여러 회선을 공유할 수 있 으며, 예컨대 라우터(router), 리피터(repeater) 및 중계기 등이 포함될 수 있다. 맞춤형 생활 큐레이팅 장치는 메신저 기반의 인공지능 챗봇 서비스를 통해 사용자들 개개인에게 맞춤화된 생활 큐레이팅 서비스를 제공한다. 다시 말해, 맞춤형 생활 큐레이팅 장치는 인공지능 챗봇을 통해 사용자 들이 일상 생활 속에서도 궁금해하고 불편해 하는 부분들에 대하여 조언을 하는 일종의 멘토의 역할을 수행할 수 있으며, 인공지능 챗봇은 이러한 큐레이팅을 위한 학습 데이터를 사전에 학습하고 그 객관적인 데이터에 근 거하여 큐레이팅을 수행한다고 볼 수 있다. 다시 말해, 인공지능 챗봇은 사용자들 각자에 맞춤화된 다양한 선택 가능한 정보를 제공할 수 있으며, 그 선택지 중에서 사용자가 선택하도록 함으로써 사용자가 원하는 방향으로 유용한 정보를 제공해 준다고 볼 수 있다. 예를 들어, 사용자가 음식추천을 요청하고, 또 그 요청한 음식을 판 매하는 식당추천을 요청했을 때 과거에 이루어진 사용자의 생활 패턴과 관련한 분석 데이터를 근거로 식당예약 을 진행하도록 함으로써 일종의 사용자의 온라인 개인비서로서 동작한다고 볼 수 있다. 맞춤형 생활 큐레이팅 장치는 메신저 기반의 인공지능 챗봇 서비스를 통해 사용자들에게 개인 비서를 제공해 준다고도 볼 수 있 을 것이다. 맞춤형 생활 큐레이팅 장치는 기초대사량, 체질량지수(BMI), 일일권장 섭취 칼로리, 일일 권장 탄수화물, 단백질, 지방 섭취량, 일일 권장 트랜스지방, 포화지방 섭취량, 일일 권장 나트륨, 당류, 콜레스테롤 섭취량 등 맞춤형 생활 큐레이팅 서비스를 제공하기 위한 무수히 많은 데이터를 학습할 수 있다. 더 정확하게는 신체정보, 사용자들의 평소활동량, 체중 목표, 영양 목표 및 건강 목표 등과 연계하여 데이터를 학습한다고 볼 수 있다. 그리고, 도 1의 사용자 단말장치에서 제공하는 기본정보를 분석하여 그에 부합하는 큐레이팅 정보를 제공 한다고 볼 수 있다. 대표적으로 가령 사용자별 건강을 고려해 식단 등과 관련한 큐레이팅 정보를 제공할 수 있는 것과 관련해서는 도 2a 내지 도 2c를 통해 살펴본 바 있다. 사용자별 건강을 고려하는 것이므로, 사용자가 가지고 있는 고혈압이나 당뇨 등의 지병을 고려하여 식단 정보를 제공하는 것도 얼마든지 가능할 것이다. 맞춤형 생활 큐레이팅 장치에서 제공하는 챗봇 서비스는 다양하게 제공될 수 있지만, 챗봇은 기본적으로 무료로 제공될 수 있으며 질문 횟수와 답변 생성 속도에 제한이 있을 수도 있다. 예를 들어 하루에 10개의 질문 이 가능하고, 답변 길이에 따라 상이하지만 무료 이용자들에게는 5초 이내에 답변을 생성하여 제공할 수 있다. 만약 유료 결제 시, 질문 횟수와 답변 생성 속도의 제한이 해제될 수 있다. 하루에 횟수의 제한 없이 질문이 가 능하고, 3초 이내에 답변을 생성하여 제공할 수 있다. 본 발명의 실시예에 따른 맞춤형 생활 큐레이팅 장치 는 앱 로그인 시 최초 1회만 이용자에게 데이터를 제공받고, 제공받은 데이터를 분석하여 이용자에게 필요 한 요소, 부족한 요소가 무엇인지 판단하고, 이를 가공하여 인공지능 챗봇을 통해 이용자에게 개인화된 솔루션 을 제공하는 것에 중점을 두어 동작할 수 있다. 인공지능 챗봇은 이미 이용자의 데이터를 분석, 가공, 학습한 상태이기 때문에 이용자는 매 질문마다 본인의 정보를 제공하지 않고 간단한 질문을 하여 맞춤형 솔루션을 제공 받을 수 있다. 나아가 이용자는 제안된 솔루션에 대해 실시간으로 피드백을 할 수 있다. 이용자의 피드백을 통 해 이용자의 식이 습관, 취향, 생활 습관까지 분석, 예측이 가능하여 실시간으로 개선된 솔루션을 제공할 수 있 다. 상기의 결과 이용자는 매번 정보를 재입력해야 하는 번거로운 과정을 생략할 수 있고 건강, 식이, 운동, 영 양 등을 한번에 관리할 수 있다. 도 1의 맞춤형 생활 큐레이팅 장치에서 제공할 수 있는 다양한 서비스들에 대하여 좀더 살펴보기로 한다. 물론 이러한 다양한 서비스를 제공하기 위하여 맞춤형 생활 큐레이팅 장치는 그에 관련되는 데이터를 사전 에 학습이 이루어져야 하는 것은 분명하다. 맞춤형 생활 큐레이팅 장치는 챗봇 서비스를 통해 맞춤형 식단 제안과 관련한 큐레이팅 서비스를 사용자 단말장치로 제공할 수 있다. 서비스 이용자가 식단을 추천해달라는 명령어를 입력하였을 경우, 개인의 섭 취 목표를 학습했기 때문에, 이용자에게 부족한 영양소, 과다한 영양소가 현재 무엇인지 판단하여 이용자가 목 표 체중에 도달할 수 있도록 최적화된 식단을 제안할 수 있다. 이 과정에서, 제안된 식단을 이용자가 거부하였 을 경우, 해당 식단은 이용자가 선호하지 않는 식단으로 판단하여 실시간으로 학습하고, 이후 새로운 식단을 제 안할 때에 낮은 비율로 제안되도록 동작할 수 있다. 특정 음식을 제외한 식단을 제안해 달라는 명령어를 입력했 을 때는, 실시간으로 해당 이용자가 특정 음식을 선호하지 않는 것으로 판단하여 이후 제안될 식단에는 해당 음 식이 제안되지 않을 수 있다. 제안된 음식은 이용자의 선택에 따라 바로 앱 내의 식단 기록 기능인 '오늘의 식 단'에 추가하여 기록할 수 있다. 맞춤형 생활 큐레이팅 장치는 식단 또는 음식과 관련하여 사용자의 과거 행위 패턴 또는 행위 내용을 학습하여 이를 근거로 음식 추천시 특정 음식을 배제하거나 특정 식당을 배제시킬 수 있다. 또한 맞춤형 생활 큐레이팅 장치는 생활 맞춤형 큐레이팅 서비스로서 식당 제안/택시 호출/식당 예약 등의 일종의 원스탑 서비스를 제공할 수 있다. 이용자의 위치, 음식 선호도, 목표에 따라 알맞은 식단을 제안할 수 있다. 맞춤형 식단 제안에서 거절된 음식을 판매하는 식당은 낮은 빈도로 제안할 수 있다. 자주 섭취한 음식은 높은 빈도로 제안되고, 특정 음식을 맞춤형 식단 제안에서 자주 제외했다면 해당 음식을 판매하는 식당은 제안 하지 않을 수 있다. 이용자가 제안된 식당에 만족할 경우 맞춤형 생활 큐레이팅 장치는 식당 예약, 택시 호출 등의 부가 서비스를 제공할 수 있다. 사용자가 사용자 단말장치의 챗봇 서비스 화면상에서 또는 사용 자가 음성을 발화하여 식당 예약 명령어를 입력하면 해당 식당의 예약 가능한 시간을 알아보고, 예약을 진행 서 비스를 제공할 수 있다. 물론 이를 위하여 예약하고자 하는 식당의 예약 관련 데이터를 학습하거나 분석하는 것 은 분명하다. 이어 사용자가 택시 호출 명령어를 입력하면, 현재 위치에서 해당 식당까지의 거리, 예상 요금에 대한 정보를 제공하고, 바로 호출 혹은 예약 호출 기능을 제공할 수 있다. 영양성분표 스캔 & 맞춤형 영양정보 변환 서비스와 관련하여 도 1의 맞춤형 생활 큐레이팅 장치는 이용자 를 통해 영양성분표 이미지를 제공받은 후, OCR 기술을 통해 영양성분표 내의 칼로리, 탄수화물, 단백질, 지방, 트랜스지방, 포화지방, 나트륨, 당류, 콜레스테롤의 1일 영양성분 기준치에 대한 비율을 확인 후 학습할 수 있 다. 이후, 사용자가 제공한 기본정보, 그리고 기초대사량, BMI, 일일 권장 섭취 칼로리 등의 학습한 정보를 토 대로 비율을 변환하여 개인화된 1일 영양성분 기준치에 대한 비율을 제공할 수 있다. 변환이 필요한 이유는, 개 인마다 하루에 필요한 영양성분이 각각 다른데, 영양성분표에는 2000kcal 기준으로 표기되어 있기 때문이다. 해 당 기능을 제공하는 이유는, 2000kcal인 사람을 기준으로 표기되어 있는 1일 영양성분 기준치에 대한 비율을, 이용자의 일일 권장 섭취 칼로리를 기반한 1일 영양성분 기준치에 대한 비율로 변환해주는 것이다. 이를 통해 일일 권장 섭취 칼로리가 2000kcal 미만 또는 초과인 이용자 모두에게 보다 정확한 정보를 제공할 수 있다.체성분 검사지 스캔 & 정보 자동 입력 서비스와 관련해 보면, 맞춤형 생활 큐레이팅 장치는 사용자 단말장 치를 소지하는 이용자를 통해 체성분검사지 이미지를 제공받은 후, 가령 앱을 통해 제공받은 후 체중, 골 격근량, 체지방량, 체지방률을 OCR 기술을 통해 확인 후 학습할 수 있다. 이용자가 스캔된 결과를 변화된 체중 으로 업데이트하면, 따로 입력할 필요없이 앱 내 이용자의 현재 체중, 골격근량, 체지방량, 체지방률이 자동으 로 변환될 수 있다. 맞춤형 생활 큐레이팅 장치는 이러한 변환 동작을 수행할 수 있다. 이외에도 맞춤형 생활 큐레이팅 장치는 최저가 식품 구매와 관련한 생활 큐레이팅 동작을 수행할 수 있다. 맞춤형 생활 큐레이팅 장치는 명령어를 통해, 이용자가 구매하고자 하는 음식 또는 식품을 검색하고자 하 는 수요가 있을 시, 챗봇이 해당 음식 또는 식품을 판매하는 웹사이트를 찾아내어 리스트를 제공할 수 있다. 최 저가순, 내 영양목표에 부합하는 음식순, 낮은 가격순 등 다양한 필터를 통해 리스트 세분화가 가능할 수 있다. 이용자가 리스트에서 상품을 선택하면 바로 주문이 가능하고, 앱은 이 과정에서 수수료를 통한 수익을 올릴 수 있다. 맞춤형 생활 큐레이팅 장치는 맞춤형 운동 추천 & 근거 제시와 관련한 큐레이팅 서비스를 통해 사용자가 제공한 기본정보, 그리고 기초대사량, BMI, 일일 권장 섭취 칼로리 등의 데이터 학습을 통해 이용자에게 입력받 은 데이터와 그것을 분석하여 가공한 데이터를 통해, 이용자가 운동 초급자인지, 중급자인지, 고급자인지를 판 단할 수 있다. 이에 따라, 이용자가 운동 추천에 대한 수요가 있을 시 이용자의 현재 상태, 목표에 근거하여 목 표에 도달하기에 최적화된 운동 루틴과, 추천된 근거를 제시할 수 있다. 주변 헬스장 검색, 가격 비교와 관련 큐레이팅 서비스를 살펴보면, 명령어를 통해 이용자가 헬스장 검색에 대한 수요가 있을 시, 챗봇이 이용자의 위 치에 기반해 주변 헬스장을 찾아내어 리스트를 제공할 수 있다. 각 헬스장의 거리, 가격을 비교하여 제시하며, 해당 업체의 전화번호 제공을 통해 유선상담을 용이하게 하며, 편하게 방문할 수 있도록 내비게이션 기능을 제 공할 수도 있다. 예를 들어, 사용자 단말장치의 사용자들은 본 발명의 실시예에 따른 챗봇 서비스를 이용 할 때 현재의 위치정보가 수집되도록 동의하여 이를 통해 GPS 모듈 등을 동작시켜 현재 위치정보를 취득해 제공 할 수 있을 것이다. 도 1의 맞춤형 생활 큐레이팅 장치는 영양제 Q&A, 큐레이팅 서비스와 관련하여 이용자가 명령어를 통해 영 양제에 대한 질문을 할 경우, 영양제에 대한 기본적인 정보를 제공할 수 있다. 나아가 앱이 보관하고 있는 이용 자의 영양, 건강 목표 데이터를 분석하여 이용자에게 필요한 영양제가 어떤 것인지 분석하여, 리스트를 제공할 수 있다. 이용자는 리스트 교체를 요청할 수 있고, 제공된 리스트에서 영양제를 선택하여 바로 결제할 수 있다. 이 과정에서 앱은 수수료를 통한 수익을 올릴 수 있다. 또한 피드백을 통한 실시간 학습과 관련한 큐레이팅 서 비스를 살펴보면 맞춤형 생활 큐레이팅 장치의 인공지능 챗봇이 제공하는 솔루션에 대해 사용자가 평가를 수행할 수 있다. 아이콘 클릭을 통해 제공받은 솔루션이 도움이 되었는지, 그렇지 않은지를 각 답변마다 평가가 가능하며, 사용자에게 적합한 솔루션이 제공되고 있는지 사용자의 평가를 통해 재학습된 솔루션이 제공될 수 있 다. 추가로, 아이콘 클릭이 아닌 자연어로 인공지능과 대화를 하는 중에도 평가부분은 학습될 수 있다. 사용자 가 제공된 솔루션에 대해 부정적인 반응을 보일 시, 이는 부정적 평가로 학습되어 이후 더욱 개선된 솔루션이 제공될 수 있을 것이다. 평가의 경우에는 Thumbs up, Thumbs down 아이콘으로 사용자 평가가 가능할 수 있다. 이러한 사용자 평가는 도 2a 및 도 2c에서 잘 보여주고 있다. 한편 도 1의 맞춤형 생활 큐레이팅 장치는 기본 정보 변경이나 앱 설정 변경과 관련해서도 생활 큐레이팅 서비스를 제공할 수 있다. 기본 정보 변경과 관련해서는 이용자가 기존에 입력한 정보를 변경하고자 하는 수요 가 있을 경우, 챗봇을 통해 쉽고 간편하게 변경하는 서비스를 제공할 수 있다. 이용자가 명령어를 입력하여 변 경하고자 하는 정보를 챗봇에 제공하면 챗봇은 실시간으로 이를 새로이 학습하여 변경된 정보를 제공할 수 있다. 또한 앱 설정 변경과 관련해서도 앱의 설정을 변경하고자 하는 수요가 있을 경우, 챗봇을 통해 쉽고 간편 하게 변경하는 서비스를 제공할 수 있다. 앱 내 설정페이지로 이동하여 변경하는 것이 아닌, 명령어 입력을 통 해 실시간으로 이용자의 앱 설정을 변경할 수 있다. 예를 들어 다크모드로 변경해줘의 명령어가 있는 경우 다크 모드로 자동 변경하고, 식단 알림 꺼줘의 명령어가 있으면 식단 알림을 자동으로 해제하며, 흔들기 기능 꺼줘와 같은 명령어가 있는 경우 흔들기 기능 해제 등의 동작을 자동 수행할 수 있다. 서드파티장치는 도 1의 맞춤형 생활 큐레이팅 장치와 연계하여 동작할 수 있는 다양한 유형의 장치를 포함할 수 있다. 예를 들어, 맞춤형 생활 큐레이팅 장치에서 식당 예약을 진행하는 경우 서드파티장치 는 식당 관계자의 스마트폰이나 POS 단말기 등을 포함할 수 있으며, 택시호출이 있는 경우에는 택시 기사 나 관계자의 단말장치를 포함할 수 있다. 물론 이외에도 서드파티장치는 맞춤형 생활 큐레이팅 장치 로 객관성 있는 또는 전문가의 데이터를 제공하는 전문가 장치(예: 영양학 교수나 체육학 박사 등의 단말장치) 를 포함할 수 있으며, 나아가 맞춤형 생활 큐레이팅 장치의 서비스를 제공하는 관리자의 관리자 장치(예:컴퓨터 등)를 포함할 수 있다. 뿐만 아니라, 서드파티장치는 맞춤형 큐레이팅 서비스를 위해 결제가 진행 되는 경우 결제 진행을 위한 PG사 등의 금융사 장치를 포함할 수 있다. 물론 금융사 장치는 금융사에서 운영하 는 서버나 금융 관계자의 컴퓨터 등 단말장치를 포함할 수 있다. 상기한 내용 이외에도 도 1의 사용자 단말장치, 통신망 및 맞춤형 생활 큐레이팅 장치는 다양한 동작을 수행할 수 있으며, 관련 내용은 이후에도 계속해서 다루어질 수 있으므로, 자세한 내용은 그 내용들로 대신하고자 한다. 도 3은 도 1의 맞춤형 생활 큐레이팅 장치의 세부구조를 예시한 블록다이어그램이다. 도 3에 도시된 바와 같이, 본 발명의 실시예에 따른 도 1의 맞춤형 생활 큐레이팅 장치는 통신 인터페이스 부, 제어부, 맞춤형 생활 큐레이팅부 및 저장부의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 저장부와 같은 일부 구성요소가 생략되어 도 1의 맞춤형 생 활 큐레이팅 장치가 구성되거나 맞춤형 생활 큐레이팅부와 같은 일부 구성요소가 제어부와 같은 다른 구성요소에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 통신 인터페이스부는 도 1의 통신망을 경유하여 사용자들이 소지하는 사용자 단말장치와 각각 통신한다. 통신을 수행하는 과정에서 통신 인터페이스부는 변/복조, 먹싱/디먹싱, 인코딩/디코딩, 해상도 를 변환하는 스케일링 등의 동작을 수행할 수 있으며, 이는 당업자에게 자명하므로 더 이상의 설명은 생략한다. 예를 들어, 통신 인터페이스부는 통신을 수행하는 과정에서 사용자 단말장치의 식별정보를 제공받을 수 있으며, 이에 따라 제어부의 제어하에 웹 서비스를 제공하거나, 앱 서비스를 제공할 수 있다. 다시 말 해, 웹 서비스를 제공하기 위한 그래픽 처리 모듈을 실행하거나, 앱 서비스를 제공하기 위한 그래픽 처리 모듈 을 실행할 수 있다. 물론 여기서, 그래픽 처리 모듈은 그래픽 카드와 같은 하드웨어 모듈이나 프로그램 형태의 소프트웨어 모듈, 또는 그 조합에 의해 구성될 수 있을 것이다. 통신 인터페이스부는 도 1의 사용자 단말장치에서 본 발명의 실시예에 따른 맞춤형 생활 큐레이팅 서 비스를 위한 앱이 실행될 때, 도 2a에서와 같은 채팅 화면을 제공할 수 있으며, 인공지능 챗봇과 메신저 기반의 채팅 서비스를 통해 사용자들은 온라인상에서 일종의 개인 비서를 만나볼 수 있다. 다시 말해, 자신의 생활과 관련하여 건강, 식단, 식당, 운동, 학습 등 다양한 분야에 걸쳐 큐레이팅 서비스를 제공받을 수 있다. 통신 인 터페이스부는 이러한 동작에 관여할 수 있다. 물론 통신 인터페이스부는 이러한 서비스 과정에서 사 용자 단말장치에서 앱을 통해 제공하는 데이터를 수신하여 제어부에 제공할 수도 있다. 제어부는 도 3의 통신 인터페이스부, 맞춤형 생활 큐레이팅부 및 저장부의 전반적인 제어 동작을 수행할 수 있다. 예를 들어, 도 1의 사용자 단말장치에서 앱을 실행할 때 제어부는 사용자 단 말장치의 식별정보를 근거로 웹 서비스와 앱 서비스를 구분하여 서비스를 제공할 수 있으며, 가령 앱 서비 스의 경우 맞춤형 생활 큐레이팅부에 탑재된 앱 서비스 제공을 위한 프로그램을 실행할 수 있다. 이를 통 해 제어부는 모바일 기반의 앱 서비스를 제공할 수 있다. 물론 제어부는 모바일 기반의 앱 서비스를 제공하기 위하여 맞춤형 생활 큐레이팅부에 탑재되는 메신저 기반의 인공지능 모듈을 실행시킬 수 있다. 이를 통해 메신저 기반의 인공지능 챗봇 서비스를 제공할 수 있다. 물론 챗봇 서비스를 위해 사용자 단말장치 로 제공되는 UI 화면들은 그래픽 처리 모듈에서 그래픽 처리되어 제공될 수 있으며, 제어부는 맞춤형 생활 큐레이팅부에서 그래픽 처리되어 제공되는 데이터를 도 1의 사용자 단말장치로 제공하기 위해 통신 인터페이스부의 통신을 제어할 수 있다. 또한 제어부는 도 1의 사용자 단말장치를 소지하는 사용자들이 서비스를 이용할 때 데이터를 수집하 여 저장부에 임시 저장한 후 데이터 분석을 위해 해당 데이터를 맞춤형 생활 큐레이팅부에 제공할 수 있으며, 맞춤형 생활 큐레이팅부에서 데이터 분석 결과를 지정 포맷으로 제공할 때 해당 분석 데이터를 도 1의 DB(120a)에 체계적으로 분류하여 저장시킬 수 있다. 제어부는 인트라넷과 같은 사내 전용망을 통해 DB(120a)에 접속하여 인코딩과 같은 별도의 추가 동작없이 데이터를 빠르게 저장시킬 수도 있다. 제어부는 이를 위해 통신 인터페이스부의 통신을 제어할 수 있다. 예를 들어, 통신 인터페이스부는 도 1의 통 신망과 통신하기 위한 통신 포트와 DB(120a)와 통신하기 위한 통신 포트를 구성할 수 있으며, 제어부(31 0)는 포트를 구별하여 통신을 수행하도록 제어할 수 있다. 맞춤형 생활 큐레이팅부는 내부적으로 다양한 모듈을 포함할 수 있다. 대표적으로 인공지능 챗봇 서비스 제공을 위한 인공지능 모듈을 포함할 수 있으며, UI 화면과 같은 화면의 그래픽 처리를 위한 그래픽 처리 모듈을 포함할 수도 있다. 이러한 SW 모듈은 해당 모듈들을 제어하는 매니저(manager)라는 또 다른 SW 모듈에 의해 제어 동작이 이루어질 수 있다. 다시 말해, 매니저는 제어부를 구성하는 CPU, MPU 등의 하드웨어 모듈과 통신하여 명령어에 따른 동작을 수행할 수 있다. 예를 들어, 맞춤형 생활 큐레이팅부는 제어부에서 모바일 기반으로 맞춤형 생활 큐레이팅 서비스를 제공해야 하는 경우 모바일 기반의 인공지능 챗봇 모듈을 실행 시킬 수 있으며, 사용자 단말장치는 챗봇 모듈의 실행에 따른 그래픽 데이터를 처리해야 하는 경우 그래픽 처리 모듈을 통해 데이터를 처리할 수 있다. 물론 맞춤형 생활 큐레이팅부의 내부를 구성하는 모듈들은 다 양한 형태로 구성될 수 있으므로 본 발명의 실시예에서는 어느 하나의 구성에 특별히 한정하지는 않을 것이다. 본 발명의 실시예에 따라 메신저 기반으로 인공지능 챗봇을 실행해 사용자들에게 개인화된 맞춤형 생활 큐레이 팅 서비스를 제공할 수 있어야 하는 것은 분명하다. 맞춤형 생활 큐레이팅부는 인공지능 챗봇 기반으로 개인화된 맞춤형 생활 큐레이팅 서비스를 제공하기 위 하여 건강, 교육, 식단, 식당, 운동 등 생활 전반에 걸쳐 데이터를 수집하고 이를 가공하여 학습 데이터를 생성 해 학습을 수행할 수 있다. 또는 특정 업체로부터 기가공된 데이터를 제공받아 이를 학습할 수도 있다. 물론 데 이터는 식단이나 건강 등과 관련해서 전문가들로부터 제공되는 객관성을 담보하는 전문 데이터를 제공받아 학습 하는 것도 얼마든지 가능할 수 있다. 인공지능 모듈의 학습 방법에 있어서, 지도 학습, 비지도 학습, 그리고 이 를 병합하는 준지도 학습 방식 등 다양하게 이루어질 수 있으며, 학습 방식에 있어서 어느 하나의 형태에 특별 히 한정하지는 않을 것이다. 예를 들어, 초기 서비스를 제공할 경우에는 지도 학습 방식으로 생활 데이터를 학 습하는 것이 바람직하다. 그리고, 이후 빅데이터가 형성되면 이를 분석하여 스스로 학습해 가는 비지도 학습 방 식의 동작이 이루어질 수 있다. 이와 같이 다양한 방식의 학습이 가능할 수 있다. 맞춤형 생활 큐레이팅부에서 제공하는 생활 맞춤형 서비스와 관련해서는 앞서 충분히 설명한 바 있다. 예 를 들어 맞춤형 식단, 식단제안/택시호출/식당예약, 최저가 식품 구매, 맞춤형 운동 추천 & 근거제시 등의 서비 스가 대표적일 수 있다. 그러나 무엇보다 맞춤형 생활 큐레이팅부는 사용자 단말장치의 사용자들과 대화를 수행하는 과정에서 인공지능 챗봇은 사용자들이 화면상에서 질문과 관련한 항목을 선택할 수 있도록 유 도하거나, 질문유형을 예시해 주어 이를 참조해 질문을 할 수 있도록 한다는 것이다. 이와 같은 서비스를 통해 사용자들의 서비스 이용을 편리하게 할 수 있고, 또 서비스의 신속한 처리가 이루어질 수 있다. 맞춤형 생활 큐 레이팅부에서 제공하는 큐레이팅 서비스와 관련해서는 앞서 충분히 설명하였으므로 그 내용들로 대신하고 자 한다. 저장부는 제어부의 제어하에 처리되는 다양한 유형의 데이터 및 정보를 임시 저장할 수 있다. 예를 들어, 사용자 단말장치에서 초기에 서비스 이용시 신체정보 등과 관련한 기본정보를 제공할 수 있다. 저장 부는 해당 정보를 임시 저장한 후 맞춤형 생활 큐레이팅부에 제공하여 사용자별로 기본정보를 관리하 도록 지정 포맷으로 데이터 가공이 이루어질 수 있다. 그리고 해당 기본정보는 도 1의 DB(120a)로 제공되어 사 용자별로 관리되고 또 그에 따른 맞춤형 생활 큐레이팅 서비스가 제공될 수 있다. 예를 들어, 시중에 판매되는 식품들은 2000kcal를 소비하는 사용자를 기준으로 영양성분표가 구성될 수 있다. 따라서 개인마다 하루에 필요 한 영양성분이 서로 다르기 때문에 기본정보를 근거로 해당 영상성분표의 데이터를 재구성하여 사용자마다 개인 화된 맞춤 식단정보를 제공할 수 있는데, 저장부나 도 1의 DB(120a)에는 이와 같이 사용자별로 맞춤형 생 활 큐레이팅을 위한 데이터가 임시 저장되거나 체계적으로 분류되어 저장될 수 있다. 상기한 내용 이외에도 도 3의 통신 인터페이스부, 제어부, 맞춤형 생활 큐레이팅부 및 저장부 는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하 고자 한다. 본 발명의 실시예에 따른 도 3의 통신 인터페이스부, 제어부, 맞춤형 생활 큐레이팅부 및 저장 부는 서로 물리적으로 분리된 하드웨어 모듈로 구성되지만, 각 모듈은 내부에 상기의 동작을 수행하기 위 한 소프트웨어를 저장하고 이를 실행할 수 있을 것이다. 다만, 해당 소프트웨어는 소프트웨어 모듈의 집합이고, 각 모듈은 하드웨어로 형성되는 것이 얼마든지 가능하므로 소프트웨어니 하드웨어니 하는 구성에 특별히 한정하 지 않을 것이다. 예를 들어 저장부는 하드웨어인 스토리지(storage) 또는 메모리(memory)일 수 있다. 하지 만, 소프트웨어적으로 정보를 저장(repository)하는 것도 얼마든지 가능하므로 위의 내용에 특별히 한정하지는 않을 것이다. 한편, 본 발명의 다른 실시예로서 제어부는 CPU 및 메모리를 포함할 수 있으며, 원칩화하여 형성될 수 있 다. CPU는 제어회로, 연산부(ALU), 명령어해석부 및 레지스트리 등을 포함하며, 메모리는 램을 포함할 수 있다. 제어회로는 제어동작을, 그리고 연산부는 2진비트 정보의 연산동작을, 그리고 명령어해석부는 인터프리터나 컴파일러 등을 포함하여 고급언어를 기계어로, 또 기계어를 고급언어로 변환하는 동작을 수행할 수 있으며, 레지 스트리는 소프트웨어적인 데이터 저장에 관여할 수 있다. 상기의 구성에 따라, 가령 맞춤형 생활 큐레이팅 장치 의 동작 초기에 맞춤형 생활 큐레이팅에 저장되어 있는 프로그램을 복사하여 메모리 즉 램(RAM)에 로 딩한 후 이를 실행시킴으로써 데이터 연산 처리 속도를 빠르게 증가시킬 수 있다. 딥러닝 모델 같은 경우 램 (RAM)이 아닌 GPU 메모리에 올라가 GPU를 이용하여 수행 속도를 가속화하여 실행될 수도 있다. 도 4는 도 1의 맞춤형 생활 큐레이팅 장치의 구동 과정을 나타내는 흐름도이다. 설명의 편의상 도 4를 도 1과 함께 참조하면, 본 발명의 실시예에 따른 맞춤형 생활 큐레이팅 장치는 신체 정보, 체중 목표, 평소 활동량, 영양 목표 및 건강 목표 중 적어도 하나와 관련한 기본정보 데이터 및 기본정보 데이터를 근거로 제공 가능한 생활 서비스에 관련되는 생활 서비스 데이터를 저장할 수 있다(S400). 여기서 기본정보 데이터를 체중 목표의 데이터는 감량인지 유지인지 중량인지의 체중 목표, 또 구체적인 목표 체중, 나아가 1주일에 몇 kg을 증/감량하고 싶은지의 목표 체중 감량/증량 속도, 근육량을 늘리고 싶은지의 근 력 보강 의지 유무 등의 정보를 포함할 수 있다. 또한 생활 서비스 데이터는 생활 큐레이팅 서비스로서 식단제 안이나 영상성분표 등의 분석에 따른 맞춤형 영양정보를 제공하기 위한 기초 대사량, BMI, 일일권장 섭취 칼로 리, 일일 권장 탄수화물, 단백질, 지방 섭취량, 일일 권장 트랜스지방, 포화지방 섭취량, 일일 권장 나트륨, 당 류, 콜레스테롤 섭취량 등의 데이터뿐 아니라, 식당추천, 최저가 식품구매, 맞춤형 운동 추천 & 근거제시, 그리 고 주변 헬스장 검색이나 가격 비교 등의 생활 큐레이팅 서비스를 제공하기 위한 다양한 유형의 생활 데이터를 포함할 수 있다. 도 1의 맞춤형 생활 큐레이팅 장치는 저장한 기본정보 데이터 및 생활 서비스 데이터를 분석하여 분석 결 과를 학습하며, 사용자의 사용자 단말장치에서 기본정보 데이터와 관계되는 사용자별 기본정보를 제공한 후 인 공지능 기반의 챗봇 서비스를 이용하여 건강, 식이, 운동 또는 영양과 관련해 질문할 때 상기 학습 결과를 근거 로 사용자별로 개인화된 맞춤형 생활 솔루션을 제공할 수 있다(S410). 여기서, 개인화된 맞춤형 생활 솔루션은 앞서 언급한 바 있는 다양한 생활 큐레이팅 서비스를 포함할 수 있으며, 맞춤형 식당 제안, 식당제안/택시호출/식당예약, 영양성분표 스캔 & 맞춤형 영상정보 변환, 체성분 검 사지 스캔 & 정보 자동 입력, 최저가 식품 구매, 기본 정보 변경, 앱 설정 변경, 맞춤형 운동 추천 & 근거 제시, 주변 헬스장 검색 및 가격 비교, 그리고 영양제 Q&A 및 큐레이팅 서비스, 피드백을 통한 실시간 학습 등 의 서비스를 포함할 수 있다. 상기한 내용 이외에도 도 1의 맞춤형 생활 큐레이팅 장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모 든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각각 하 나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램 으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일시적 저 장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발 명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다."}
{"patent_id": "10-2023-0120837", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상 첨부된 자료를 참조하여 본 발명을 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 는 본 발명의 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것 을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 부호의 설명100: 사용자 단말장치 110: 통신망 120: 맞춤형 생활 큐레이팅 장치 300: 통신 인터페이스부 310: 제어부 320: 맞춤형 생활 큐레이팅부 330: 저장부"}
{"patent_id": "10-2023-0120837", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 인공지능을 이용한 맞춤형 생활 큐레이팅 시스템을 나타내는 도면이다. 도 2a 내지 도 2c는 챗봇 서비스 화면의 예시도이다. 도 3은 도 1의 맞춤형 생활 큐레이팅 장치의 세부구조를 예시한 블록다이어그램이다. 도 4는 도 1의 맞춤형 생활 큐레이팅 장치의 구동 과정을 나타내는 흐름도이다."}
