{"patent_id": "10-2022-0007091", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0111355", "출원번호": "10-2022-0007091", "발명의 명칭": "강의 커리큘럼 추천 정보를 제공하는 교육 서비스의 제공 방법", "출원인": "김명은", "발명자": "김명은"}}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버를 통한 강의 커리큘럼 추천 정보를 제공하는 교육 서비스의 제공 방법에 있어서,적어도 하나의 사용자 및 적어도 하나의 강의 각각에 대한 특징 데이터를 추출하는 단계;상기 적어도 하나의 사용자 중 제1 사용자에 대한 제1 특징 데이터 및 상기 적어도 하나의 강의에 대한 특징 데이터에 기초하여, 추천 강의 정보를 상기 제1 사용자의 제1 단말 장치로 전송하는 단계;상기 적어도 하나의 사용자 중 상기 제1 사용자를 트래킹(tracking)하는 제2 사용자의 제2 단말 장치로, 상기제1 사용자가 수강한 하나 이상의 강의에 기초하여 생성된 제1 강의 커리큘럼 정보를 전송하는 단계;상기 제2 사용자가 상기 제1 강의 커리큘럼 정보에 기초하여 수강한 강의에 따라 제2 강의 커리큘럼 정보를 생성하는 단계; 및상기 적어도 하나의 사용자 중 상기 제2 사용자를 트래킹하는 다른 사용자의 단말 장치로, 상기 제2 강의 커리큘럼 정보를 전송하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적어도 하나의 사용자에 대한 특징 데이터는,상기 적어도 하나의 사용자의 적성 검사 결과 데이터, 선호하는 강의와 관련된 키워드에 대해 워드 임베딩(wordembedding)을 수행한 데이터, 또는 관심사 데이터 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 강의 커리큘럼 정보는, 상기 제1 사용자가 수강한 하나 이상의 강의를 수강 순서에 따라 배열한 정보이고,상기 제2 강의 커리큘럼 정보는,상기 제1 강의 커리큘럼 정보 및 상기 제1 사용자가 수강한 하나 이상의 강의 이외에 상기 제2 사용자가 수강한강의의 수강 순서에 기초하여 생성되는, 방법."}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1 사용자 또는 상기 제2 사용자를 트래킹하는 사용자의 수가 증가됨에 기초하여, 상기 제1 강의 커리큘럼 정보 또는 상기 제2 강의 커리큘럼 정보에 대한 가중치를 증가시킴으로써, 상기 제1 강의 커리큘럼 정보 또는 상기 제2 강의 커리큘럼 정보의 추천 순위를 증가시키는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,제3 사용자가 새롭게 등록되면, 상기 제3 사용자에 대한 제3 특징 데이터를 추출하는 단계;기 등록된 상기 적어도 하나의 사용자 각각에 대한 데이터 및 상기 제3 특징 데이터 간의 유사도를 산출하는 단계; 및상기 산출된 유사도에 기초하여 상기 적어도 하나의 사용자 중 상기 제3 사용자가 트래킹할 사용자를 식별하는공개특허 10-2023-0111355-3-단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 산출된 유사도 중 상기 제2 사용자에 대한 제2 특징 데이터와 상기 제3 특징 데이터 간의 유사도가 가장높은 경우, 상기 제2 사용자를 상기 제3 사용자가 트래킹할 사용자로 식별하는 단계; 및상기 제2 강의 커리큘럼 정보를 상기 제3 사용자의 단말 장치로 전송하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제2 강의 커리큘럼 정보, 및 상기 제1 사용자와 상기 제2 사용자가 수강한 강의 이외에 상기 제3 사용자가수강한 강의의 수강 순서에 기초하여 제3 강의 커리큘럼 정보를 생성하는 단계를 더 포함하고,상기 제1 강의 커리큘럼 정보, 상기 제2 강의 커리큘럼 정보, 및 상기 제3 강의 커리큘럼 정보는, 트리(tree)구조로 형성되는, 방법."}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 적어도 하나의 사용자 중 분야 별로 취업에 성공한 사용자를 추적 및 식별하는 단계; 및상기 식별된 사용자가 수강한 강의에 기초하여 생성된 특정 강의 커리큘럼 정보의 가중치를 증가시킴으로써, 상기 특정 강의 커리큘럼 정보의 추천 순위를 증가시키는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,특정 회사가 이용하는 단말 장치로부터 특정 직군의 사용자 추천을 요청하는 신호가 수신되면, 상기 적어도 하나의 사용자 중 상기 특정 직군과 관련된 강의 커리큘럼 또는 개별 강의를 수강한 특정 사용자를 식별하는단계; 및상기 식별된 특정 사용자를 추천하는 정보를 상기 특정 회사가 이용하는 단말 장치로 전송하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0007091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어인 서버와 결합되어, 제1항 내지 제9항 중 어느 한 항의 강의 커리큘럼 추천 정보를 제공하는 교육 서비스의 제공 방법을 수행하기 위해 컴퓨터 판독 가능한 기록매체에 저장된, 컴퓨터 프로그램."}
{"patent_id": "10-2022-0007091", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "서버를 통한 강의 커리큘럼 추천 정보를 제공하는 교육 서비스의 제공 방법이 개시된다. 상기 제공 방법은, 적어 도 하나의 사용자 및 적어도 하나의 강의 각각에 대한 특징 데이터를 추출하는 단계, 적어도 하나의 사용자 중 제1 사용자에 대한 제1 특징 데이터 및 적어도 하나의 강의에 대한 특징 데이터에 기초하여, 추천 강의 정보를 상기 제1 사용자의 제1 단말 장치로 전송하는 단계, 적어도 하나의 사용자 중 제1 사용자를 트래킹하는 제2 사용 자의 제2 단말 장치로, 제1 사용자가 수강한 하나 이상의 강의에 기초하여 생성된 제1 강의 커리큘럼 정보를 전 송하는 단계, 제2 사용자가 제1 강의 커리큘럼 정보에 기초하여 수강한 강의에 따라 제2 강의 커리큘럼 정보를 생성하는 단계 및 적어도 하나의 사용자 중 제2 사용자를 트래킹하는 다른 사용자의 단말 장치로, 제2 강의 커리 큘럼 정보를 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0007091", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 교육 서비스 제공 방법에 관한 것으로서, 더욱 상세하게는, 인공 지능 기반의 강의 커리큘럼 추천 정 보를 제공하는 교육 서비스의 제공 방법에 관한 것이다."}
{"patent_id": "10-2022-0007091", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보 통신 기술 및 인공 지능 기술이 발전됨에 따라, 다양한 분야에 해당 기술이 적용되고 있다. 특히, 교육 분 야에서 해당 기술이 적용됨에 따라, 방대한 양의 온라인 교육 컨텐츠(예를 들어, 인터넷 강의 등)가 등장하고 있으며, 관련 시장의 규모 역시 커지고 있다. 한편, 방대한 양의 온라인 교육 컨텐츠를 효율적으로 활용하기 위해서는 전략적인 커리큘럼 설계 및 강의 선택 능력을 필요로 한다. 온라인 교육 컨텐츠에 대한 정보를 쉽게 획득 및 교환할 수 있는 사용자의 경우, 전략적인 커리큘럼 설계 및 강의 선택 능력을 비교적 쉽게 획득할 수 있다. 다만, 해당 정보를 쉽게 얻을 수 없는 환경에 있는 사용자의 경우, 해당 능력을 쉽게 얻을 수 없다. 이에 따라, 해당 사용자는 자신의 특성에 맞는 최적화된 온라인 교육 컨텐츠를 비교적 쉽게 검색 및 활용할 수 없다는 문제 점이 존재한다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허공보 10-2322213호, (2021.11.01)"}
{"patent_id": "10-2022-0007091", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술된 문제점을 해결하기 위해 안출된 것으로서, 본 개시의 기술적 과제는 인공 지능 기반의 강의 커리큘럼 추천 정보를 제공하는 교육 서비스의 제공 방법을 제공함에 있다. 본 개시의 추가적인 기술적 과제는 사용자 간의 연결 관계에 기초하여 강의 커리큘럼 추천 정보의 제공 방법을 제공함에 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0007091", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예로, 서버를 통한 강의 커리큘럼 추천 정보를 제공하는 교육 서비스의 제공 방법은, 적어도 하나의 사용자 및 적어도 하나의 강의 각각에 대한 특징 데이터를 추출하는 단계; 상기 적어도 하나의 사용자 중 제1 사용자에 대한 제1 특징 데이터 및 상기 적어도 하나의 강의에 대한 특징 데이터에 기초하여, 추천 강의 정보를 상기 제1 사용자의 제1 단말 장치로 전송하는 단계; 상기 적어도 하나의 사용자 중 상기 제1 사용자를 트래킹(tracking)하는 제2 사용자의 제2 단말 장치로, 상기 제1 사용자가 수강한 하나 이상의 강의에 기초하여 생성된 제1 강의 커리큘럼 정보를 전송하는 단계; 상기 제2 사용자가 상기 제1 강의 커리큘럼 정보에 기초하여 수강한 강의에 따라 제2 강의 커리큘럼 정보를 생성하는 단계; 및 상기 적어도 하나의 사용자 중 상기 제2 사용 자를 트래킹하는 다른 사용자의 단말 장치로, 상기 제2 강의 커리큘럼 정보를 전송하는 단계를 포함할 수 있다. 그리고, 상기 적어도 하나의 사용자에 대한 특징 데이터는, 상기 적어도 하나의 사용자의 적성 검사 결과 데이 터, 선호하는 강의와 관련된 키워드에 대해 워드 임베딩(word embedding)을 수행한 데이터, 또는 관심사 데이터 중 적어도 하나를 포함할 수 있다. 그리고, 상기 제1 강의 커리큘럼 정보는, 상기 제1 사용자가 수강한 하나 이상의 강의를 수강 순서에 따라 배열 한 정보이고, 상기 제2 강의 커리큘럼 정보는, 상기 제1 강의 커리큘럼 정보 및 상기 제1 사용자가 수강한 하나 이상의 강의 이외에 상기 제2 사용자가 수강한 강의의 수강 순서에 기초하여 생성될 수 있다. 그리고, 상기 제1 사용자 또는 상기 제2 사용자를 트래킹하는 사용자의 수가 증가됨에 기초하여, 서버는 상기 제1 강의 커리큘럼 정보 또는 상기 제2 강의 커리큘럼 정보에 대한 가중치를 증가시킴으로써, 상기 제1 강의 커 리큘럼 정보 또는 상기 제2 강의 커리큘럼 정보의 추천 순위를 증가시킬 수 있다. 그리고, 상기 방법은, 제3 사용자가 새롭게 등록되면, 상기 제3 사용자에 대한 제3 특징 데이터를 추출하는 단 계, 기 등록된 상기 적어도 하나의 사용자 각각에 대한 데이터 및 상기 제3 특징 데이터 간의 유사도를 산출하 는 단계 및 상기 산출된 유사도에 기초하여 상기 적어도 하나의 사용자 중 상기 제3 사용자가 트래킹할 사용자 를 식별하는 단계를 더 포함할 수 있다. 그리고, 상기 방법은, 상기 산출된 유사도 중 상기 제2 사용자에 대한 제2 특징 데이터와 상기 제3 특징 데이터 간의 유사도가 가장 높은 경우, 상기 제2 사용자를 상기 제3 사용자가 트래킹할 사용자로 식별하는 단계; 및 상 기 제2 강의 커리큘럼 정보를 상기 제3 사용자의 단말 장치로 전송하는 단계를 더 포함할 수 있다. 그리고, 상기 방법은, 상기 제2 강의 커리큘럼 정보, 및 상기 제1 사용자와 상기 제2 사용자가 수강한 강의 이 외에 상기 제3 사용자가 수강한 강의의 수강 순서에 기초하여 제3 강의 커리큘럼 정보를 생성하는 단계를 더 포함하고, 상기 제1 강의 커리큘럼 정보, 상기 제2 강의 커리큘럼 정보, 및 상기 제3 강의 커리큘럼 정보는, 트리 (tree) 구조로 형성될 수 있다. 그리고, 상기 방법은, 상기 적어도 하나의 사용자 중 분야 별로 취업에 성공한 사용자를 추적 및 식별하는 단계; 및 상기 식별된 사용자가 수강한 강의에 기초하여 생성된 특정 강의 커리큘럼 정보의 가중치를 증가시킴 으로써, 상기 특정 강의 커리큘럼 정보의 추천 순위를 증가시키는 단계를 더 포함할 수 있다. 그리고, 상기 방법은, 특정 회사가 이용하는 단말 장치로부터 특정 직군의 사용자 추천을 요청하는 신호가 수신 되면, 상기 적어도 하나의 사용자 중 상기 특정 직군과 관련된 강의 커리큘럼 또는 개별 강의를 수강한 특정 사 용자를 식별하는 단계; 및 상기 식별된 특정 사용자를 추천하는 정보를 상기 특정 회사가 이용하는 단말 장치로 전송하는 단계를 더 포함할 수 있다. 그리고, 하드웨어인 서버와 결합되어, 상술된 강의 커리큘럼 추천 정보를 제공하는 교육 서비스의 제공 방법을 수행하기 위해 컴퓨터 판독 가능한 기록매체에 저장된 컴퓨터 프로그램이 추가적으로 개시될 수 있다. 본 개시의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2022-0007091", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예에 의해, 인공 지능 기반의 강의 커리큘럼 추천 정보를 제공하는 교육 서비스의 제공 방법이 제공될 수 있다. 또한, 본 개시의 다양한 실시예에 의해, 사용자간의 연결 관계에 기초하여 강의 커리큘럼 추천 정보의 제공 방 법이 제공될 수 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0007091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시의 개시가 완전하도록 하고, 본 개시가 속하는 기술 분야의 통상의 기술자에게 본 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 개시를 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요 소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성요소는 본 개시의기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 개시가 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소과의 상관관계를 용이하게 기술하기 위해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작 시 구성요 소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤집 을 경우, 다른 구성요소의 \"아래(below)\"또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성 요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있 다. 이하, 첨부된 도면을 참조하여 본 개시의 실시예를 상세하게 설명한다. 도 1은 본 개시의 일 실시예에 따른, 강의 커리큘럼 추천 정보를 제공하는 교육 서비스를 제공하기 위한 시스템 의 개략도이다. 도 1에 도시된 바와 같이, 본 개시의 일 실시예에 따른, 강의 커리큘럼 추천 정보를 제공하는 교육 서비스를 제 공하기 위한 시스템은, 서버, 복수의 사용자가 이용하는 단말 장치(200-1, 200-2 … 200-N (N은 2 이상의 자연수)) 및 서버를 관리하기 위한 관리 장치를 포함할 수 있다. 서버, 복수의 사용자 각각이 이용하는 단말 장치(200-1, 200-2 … 200-N), 및 관리 장치는 네트워크 (W)를 이용하여 서로 통신을 수행할 수 있다. 여기서, 네트워크(W)는 유선 네트워크와 무선 네트워크를 포함할 수 있다. 예를 들어, 무선 네트워크는 근거리 네트워크(LAN: Local Area Network), 도시권 네트워크(MAN: Metropolitan Area Network), 광역 네트워크(WAN: Wide Area Network) 등의 다양한 네트워크를 포함할 수 있다. 다만, 본 개시의 실시예에 따른 네트워크는 상기 열거된 네트워크에 국한되지 않고, 공지의 무선 데이터 네트워 크나 공지의 전화 네트워크, 공지의 유무선 텔레비전 네트워크를 적어도 일부로 포함할 수도 있다. 도 1에는, 복수의 사용자 각각이 이용하는 단말 장치(200-1, 200-2, … 200-N)가 스마트폰인 경우를 도시하고 있으며, 서버를 관리하는 단말 장치는 데스크 탑으로 구현된 경우를 도시하고 있으나, 이에 국한되는 것은 아니다. 각 사용자가 이용하는 단말 장치(200-1, 200-2, … 200-N) 및 서버를 관리하는 단말 장치는, 서버 와 각종 데이터를 교환할 수 있는 모든 기기(예를 들어, 데스크탑 PC, 태블릿 PC, 노트북, 웨어러블 기기 등)로 구현될 수 있음은 물론이다. 복수의 사용자(또는, 복수의 사용자가 이용하는 단말 장치) 각각은 서로를 트래킹(또는, 팔로우 업(follow u p))할 수 있다. 여기서, 복수의 사용자 각각이 서로를 트래킹한다는 것은, 복수의 사용자 각각의 강의 커리큘럼 정보를 공유한다는 것 또는 복수의 사용자 각각에 대한 특징 데이터의 유사도가 임계값을 초과한다는 것을 의미 할 수 있다. 예를 들어, 제2 사용자가 제1 사용자를 트래킹한다는 것은, 제1 사용자가 수강한 하나 이상의 강의에 기초하여 생성된 제1 강의 커리큘럼 정보를 제2 사용자가 공유 받을 수 있다는 것을 의미할 수 있다. 또 다른 예로, 제2 사용자가 제1 사용자를 트래킹한다는 것은, 제1 사용자와 제2 사용자 각각에 대한 특징 데이터의 유사도가 임계 값을 초과한다는 것을 의미할 수 있다. 이와 관련된 설명은 후술하는 부분에서 구체화하도록 한다. 서버는 복수의 사용자 각각에 대한 특징 데이터 및 복수의 강의에 대한 특징 데이터를 획득할 수 있다. 그 리고, 서버는 획득된 특징 데이터에 기초하여 특정 사용자에게 최적화된 강의를 추천하고, 특정 사용자가 수강한 강의에 기초하여 생성된 강의 커리큘럼 정보를 특정 사용자를 트래킹하는 다른 사용자(또는, 다른 사용 자가 이용하는 단말 장치)에게 제공할 수 있다. 이와 관련된 실시예는 후술하는 부분에서 설명하도록 한다.도 2는 본 개시의 일 실시예에 따른, 강의 커리큘럼 추천 정보를 제공하는 교육 서비스를 제공하는 방법을 설명 하기 위한 순서도이다. 서버는 적어도 하나의 사용자 및 적어도 하나의 강의 각각에 대한 특징 데이터를 추출할 수 있다(S210). 여기서, 적어도 하나의 사용자에 대한 특징 데이터(또는, 특징 벡터)는, 적어도 하나의 사용자의 적성 검사 결 과 데이터, 선호하는 강의와 관련된 키워드에 대해 워드 임베딩(word embedding)을 수행한 데이터, 또는 관심사 데이터 중 적어도 하나를 포함할 수 있다. 구체적으로, 서버는 사용자의 단말 장치로, 적성 검사를 수행할 수 있는 UI, 선호하는 강의를 입력할 수 있는 UI, 또는 관심사를 입력할 수 있는 UI를 전송할 수 있다. 서버는 상기 UI를 통해 입력된 데이터에 기초하여 사 용자에 대한 특징 데이터를 추출할 수 있다 예로, 서버는 UI를 통해 입력된 사용자가 선호하는 강의와 관련된 키워드에 대해 워드 임베딩 동작을 수행할 수 있다. 구체적으로, 서버는 사용자가 선호하는 강의의 제목들 간의 공통된 단어를 통해 키워드를 추출할 수 있다. 이 때, 추출된 키워드를 라고 가정한다. 서버는 워드 임베딩을 활용하여 유사한 단어끼리 그룹핑(grouping)할 수 있다. 의 워드 임베딩 값을 , 임베딩된 값 사이의 거리 함수 거리 라고 정의할 수 있다. 그리고, 에 가까운 t개까지 단어들의 인덱스를 포함하는 집합을 라고 정의할 수 있다. 또 다른 예로, 서버는 상기 UI를 통해 입력된 적성 검사 문답지에 기초하여 사용자의 적성 검사 결과 데이터(예 로, 사용자의 학업 수준, 학습 목적, 학습(또는, 취업)하고자 하는 분야/언어, 목표 달성 기간, 지출 비용 등) 를 추출할 수 있다. 여기서, 적성 검사는 학습 목적에 따라 문항 개수가 구성될 수 있으며, 학업 수준은 별도로 마련된 테스트(예로, 코딩 테스트 등)를 통해 획득될 수 있다. 다만, 이는 일 실시예에 불과하며, 적성 검사는 서버에 의해 다양하게 수정/추가/삭제될 수 있다. 강의에 대한 특징 데이터는, 해당 강의와 관련된 키워드에 대해 워드 임베딩을 수행한 데이터, 해당 강의의 유 형 등을 포함할 수 있다. 서버는 적어도 하나의 사용자 중 제1 사용자에 대한 제1 특징 데이터 및 적어도 하나의 강의에 대한 특징 데이 터에 기초하여, 추천 강의 정보를 제1 사용자의 제1 단말 장치로 전송할 수 있다(S220). 구체적으로, 서버는, 적어도 하나의 강의에 대한 특징 데이터 중 제1 특징 데이터와 가장 유사한(즉, 유사도가 가장 큰) 특징 데이터에 대응되는 특정 강의를 제1 사용자에게 최적화된 강의로 판단할 수 있다. 서버는 상기 특정 강의에 대한 정보(즉, 추천 강의 정보)를 제1 단말 장치로 전송할 수 있다. 여기서, 특징 데이터 간의 유사도가 가장 크다는 것은, 각 특징 데이터에 대응되는 워드 임베딩 값 간의 차이가 가장 작다는 것을 의미할 수 있다. 다만, 이는 일 실시예에 불과하며, 각 특징 데이터 간의 유사도를 산출하는 방식은 다양하게 구현될 수 있다. 서버는, 적어도 하나의 사용자 중 제1 사용자를 트래킹하는 제2 사용자의 제2 단말 장치로, 제1 사용자가 수강 하는 하나 이상의 강의에 기초하여 생성된 제1 강의 커리큘럼 정보를 전송할 수 있다(S230). 여기서, 제2 사용자가 제1 사용자를 트래킹(또는, 팔로우 업(follow up))한다는 것은, 제2 사용자에 대한 특징 데이터는 복수의 사용자 중 제1 사용자의 특징 데이터와 가장 유사하다는 것을 의미할 수 있다. 예를 들어, 복수의 사용자(제1 사용자 내지 제n 사용자)가 적성 검사 결과에 따라 특성 데이터(예로, 특징 벡터) f_i를 부여받는 경우(이 때, 제i 사용자의 특성 벡터는 f_i)를 가정한다. 제i+1 사용자는 제1 사용자 내 지 제i 사용자 중에 가장 유사한 사용자(즉, 제1 사용자 내지 제i 사용자 중 제i+1 사용자에 대한 특징 데이터 와 가장 유사한 특징 데이터를 가지는 사용자)를 트래킹하게 된다. 본 개시의 일 실시예로, 도 3의 (a)에 도시된 바와 같이, 사용자 간의 연결 관계가 형성될 수 있다. 도 3의 (a)에 도시된 연결 관계는, 제2 사용자(user 2) 및 제3 사용자(user 3)가 제1 사용자(user 1)를 트래킹하고, 제4 사용자(user 4) 및 제 7 사용자(user 7)는 제2 사용자를 트래킹하고, 제8 사용자(user 8)가 제3 사용자(user 3)를 트래킹하고, 제5 사용자 및 제6 사용자는 제4 사용자를 트래킹한 경우를 도시하고 있다. 그리고, 제1 강의 커리큘럼 정보는, 제1 사용자가 수강한 하나 이상의 강의를 수강 순서에 따라 배열한 정보를 의미한다. 예로, 제1 강의 커리큘럼 정보는 트리(tree) 구조의 형태로 구현될 수 있다. 본 개시의 일 실시예로, 도 3의(b)를 참조하면, 제1 사용자(user 1)가 수강한 하나 이상의 강의(강의(lecture, lec) 5, lec 3 및 lec 1)에 기초하여 제1 강의 커리큘럼 정보가 생성될 수 있다. 여기서, 제1 사용자가 수강한 강의 순서는, lec 5, lec 3, lec 1 순일 수 있다. 그리고, 제1 강의 커리큘럼 정 보에 포함된 개별 강의는, 서버가 제1 사용자에게 추천한 강의를 포함할 수 있으나, 이에 한정되는 것은 아니다. 서버는 제2 사용자가 제1 강의 커리큘럼 정보에 기초하여 수강한 강의에 따라 제2 강의 커리큘럼 정보를 생성할 수 있다(S240). 즉, 제2 사용자는 자신이 트래킹하는 제1 사용자에 대응되는 제1 강의 커리큘럼 정보에 기초하 여 특정 강의를 수강할 수 있으며, 서버는 특정 강의에 기초하여 제2 강의 커리큘럼 정보를 생성할 수 있다. 여기서, 제2 강의 커리큘럼 정보는, 제1 강의 커리큘럼 정보 및 제1 사용자가 수강한 하나 이상의 강의 이외에 제2 사용자가 수강한 강의의 수강 순서에 기초하여 생성될 수 있다. 예를 들어, 제2 사용자가 제1 강의 커리큘럼 순서대로 강의를 수강하다가 중간(즉, 특정 강의)에 다른 강의를 수강할 경우, 서버는 커리큘럼 내에서 특정 강의에서 다른 강의 가지(branch)가 분기된 것으로 판단할 수 있다. 예로, 도 3의 (b)를 참조하면, 제2 사용자(user 2)는 제1 강의 커리큘럼 순서대로 lec 5 및 lec 3을 수강한 뒤, lec 1이 아닌 lec30을 수강할 수 있다. 서버는 커리큘럼 내의 강의 중 lec 3에서 별도의 강의 가지가 분기된 것으로 판단할 수 있다. 그 이후, 서버는 제2 사용자가 수강한 강의(lec 21, lec 9)의 순서에 기초하여 제2 강의 커리큘럼 정보를 생성할 수 있다. 서버는 적어도 하나의 사용자 중 제2 사용자를 트래킹하는 다른 사용자의 단말 장치로 제2 강의 커리큘럼 정보 를 전송할 수 있다(S250). 예를 들어, 도 3의 (a)에 도시된 바와 같이, 제4 사용자(user 4) 및 제7 사용자(user 7)은 제2 사용자를 트래킹 하고, 제5 사용자(user 5) 및 제6 사용자(user 6)는 제4 사용자를 트래킹하는 경우를 가정한다. 서버는 제4 사 용자 및 제7 사용자가 이용하는 단말 장치에 제2 강의 커리큘럼 정보를 전송할 수 있다. 그리고, 제2 사용자를 트래킹하는 제4 사용자(user 4)가 수강한 강의에 기초하여 생성된 강의 커리큘럼 정보, 및 제4 사용자를 트래킹하는 제6 사용자(user 6)가 수강한 강의에 기초하여 생성된 커리큘럼 정보(330,340)는 상술된 방식으로 도 3의 (b)에 도시된 바와 같이 구현될 수 있다. 본 개시의 또 다른 실시예로, 제3 사용자가 새롭게 등록(예로, 서버가 관리하는 교육 서비스를 제공받을 수 있 는 시스템에 등록)되면, 서버는 새로 등록된 사용자에 대한 제3 특징 데이터를 추출할 수 있다. 사용자에 대한 특징 데이터를 추출하는 방식은 상술하였으므로 중복되는 설명은 생략하도록 한다. 서버는 기 등록된 적어도 하나의 사용자 각각에 대한 데이터 및 제3 특징 데이터 간의 유사도를 산출할 수 있다. 서버는 산출된 유사도에 기초하여 적어도 하나의 사용자 중 제3 사용자가 트래킹할 사용자를 식별할 수 있다. 예를 들어, 산출된 유사도 중 제2 사용자에 대한 제2 특징 데이터와 제3 특징 데이터 간의 유사도가 가장 높은 경우, 서버는 제2 사용자를 제3 사용자가 트래킹할 사용자로 식별할 수 있다. 서버는 제2 사용자가 수강한 하나 이상의 강의에 기초하여 생성된 제2 강의 커리큘럼 정보를 제3 사용자의 단말 장치로 전송할 수 있다. 그리고, 서버는 제2 강의 커리큘럼 정보, 및 상기 제1 사용자와 상기 제2 사용자가 수강한 강의 이외에 상기 제 3 사용자가 수강한 강의의 수강 순서에 기초하여 제3 강의 커리큘럼 정보를 생성할 수 있다. 이 때, 제3 강의 커리큘럼 정보는 트리 구조로 형성될 수 있다. 본 개시의 또 다른 실시예로, 제1 사용자 또는 제2 사용자를 트래킹하는 사용자의 수가 증가됨에 기초하여, 서 버는 제1 강의 커리큘럼 정보 또는 제2 강의 커리큘럼 정보에 대한 가중치를 증가시킴으로써, 제1 강의 커리큘 럼 정보 또는 제2 강의 커리큘럼 정보의 추천 순위를 증가시킬 수 있다. 제1 사용자 또는 제2 사용자를 트래킹하는 사용자의 수가 증가된다는 것은, 제1 사용자 또는 제2 사용자의 특징 데이터와 유사한 특징 데이터를 가지는 사용자의 수가 증가된다는 것을 의미할 수 있다. 서버는 제1 및 제2 사용자 각각에 대응되는 제1 및 제2 강의 커리큘럼 정보에 대한 가중치를 증가시킬 수 있다. 특정 강의 커리큘럼 정보에 대한 가중치가 증가된다는 것은, 특정 강의 커리큘럼 정보에 대한 추천 순위가 증가 된다는 것을 의미할 수 있다. 본 개시의 또 다른 실시예로, 서버는 적어도 하나의 사용자 중 분야 별로 취업에 성공한 사용자를 추적 및 식별 할 수 있다. 예를 들어, 서버는 취업에 성공한 사용자의 단말 장치로부터 취업 정보를 수신할 수 있다. 여기서, 취업 정보는, 취업한 회사의 유형 또는 분야, 취업한 날짜, 취업을 위해 수강한 강의에 대한 정보 중 적어도 하 나를 포함할 수 있다. 서버는 식별된 사용자가 수강한 강의에 기초하여 생성된 특정 강의 커리큘럼 정보의 가중치를 증가시킴으로써, 특정 강의 커리큘럼 정보의 추천 순위를 증가시킬 수 있다. 본 개시의 또 다른 실시예로, 특정 회사가 이용하는 단말 장치로부터 특정 직군의 사용자 추천을 요청하는 신호 가 수신되면, 서버는 적어도 하나의 사용자 중 특정 직군과 관련된 강의 커리큘럼 또는 개별 강의를 수강한 특 정 사용자를 식별할 수 있다. 그리고, 서버는 식별 특정 사용자를 추천하는 정보를 특정 회시가 이용하는 단말 장치로 전송할 수 있다. 예를 들어, 특정 회사(또는, 특정 회시가 이용하는 단말 장치)로부터 전기/전자 계열의 직군과 관련된 사용자 추천을 요청하는 신호가 수신되면, 서버는 등록된 하나 이상의 사용자 중 전기/전자 계열의 직군과 관련된 강의 커리큘럼 또는 개별 강의를 수강한 특정 사용자를 식별할 수 있다. 그리고, 서버는 식별된 특정 사용자를 추천 하는 정보를 특정 회사가 이용하는 단말 장치로 전송할 수 있다. 도 4는 본 개시의 일 실시예에 따른, 강의 커리큘럼 추천 정보를 제공하는 교육 서비스를 제공하는 방법을 설명 하기 위한 도면이다. 서버는 복수의 사용자 및 강의 각각에 대한 특징 데이터를 추출할 수 있다. 서버는 도 2를 참조하여 설명 한 방식에 따라 특징 데이터를 추출할 수 있으며, 별도의 인공 지능 모델에 기초하여 특징 데이터를 추출할 수 있다. 예를 들어, 서버는 사용자에 대한 특징 데이터 또는 강의에 대한 특징 데이터를 추출하도록 특정 인공 지능 모 델을 학습시킬 수 있다. 또 다른 예로, 서버는 상기 특정 인공 지능 모델을 구비한 클라우드 서버에 기반하여 복수의 사용자 및 강의에 대한 특징 데이터를 획득할 수 있다. 인공 지능 모델의 학습 방식은 지도 학습 (supervised learning)일 수 있으나, 이에 한정되는 것은 아니다. 서버는 사용자 각각에 대한 특징 데이터 간의 유사도를 산출함으로써 사용자 연결 관계도를 형성할 수 있 다. 예를 들어, 새로 등록된 사용자에 대한 특징 데이터와 제1 사용자에 대한 특징 데이터 간의 유사도가 가장 높은 것으로 식별되면, 서버는 새로 등록된 사용자가 제1 사용자를 트래킹하는 것으로 판단할 수 있다. 그리고, 서버 는 판단 결과에 기초하여 연결 관계도를 형성할 수 있다. 서버는 사용자에 대한 특징 데이터 및 강의에 대한 특징 데이터 간의 유사도에 기초하여 사용자에 대한 강의 추 천 시스템을 구축할 수 있다. 예를 들어, 제1 사용자에 대한 특징 데이터와 제1 강의 및 제2 강의에 대한 특징 데이터 간의 유사도가 임계값 을 초과하는 경우(또는, 가장 높은 값을 가지는 경우), 서버는 제1 사용자가 이용하는 단말 장치에 제1 강의 및 제2 강의를 추천하는 시스템을 구축할 수 있다. 서버는 사용자가 수강한 강의에 기초하여 강의 커리큘럼 정보를 생성할 수 있다. 구체적으로, 서버는 사용 자가 수강한 강의의 순서에 따라 트리 구조 형태의 강의 커리큘럼 정보를 생성할 수 있다. 그리고, 서버는, 구 축된 추천 시스템을 통해, 사용자에게 특정 강의 커리큘럼 또는 특정 강의를 추천하는 정보를 사용자에게 제공할 수 있다. 서버는, 사용자가 실제로 수강한 강의 기록 및 검색 기록에 기초하여, 협력적(collaborative) 필터링 알고리즘 을 이용하여 강의 커리큘럼 정보를 관리/추가/갱신/삭제할 수 있다.도 5는 본 개시의 일 실시예에 따른, 서버의 구성을 설명하기 위한 블록도이다. 도 5에 도시된 바와 같이, 서버는 메모리, 통신부 및 프로세서가 포함될 수 있다. 다만, 이에 국한되는 것은 아니며, 서버는 필요한 동작에 따라 당업자 관점에서 자명한 범위 내에서 소프트웨어 및 하드웨어 구성이 포함될 수 있다. 메모리는 복수의 사용자가 이용하는 단말 장치로 특징 데이터를 추출하기 위해 필요한 UI를 저장할 수 있 다. 메모리는 복수의 사용자에 대한 특징 데이터 및 복수의 강의에 대한 특징 데이터를 저장할 수 있다. 또한, 메모리는 특징 데이터를 추출하기 위한 인공 지능 모델을 활용하기 위한 데이터를 저장할 수 있다. 다만, 이는 일 실시예에 불과하며, 메모리는 서버가 각종 동작을 수행하기 위한 하나 이상의 인스트 럭션(instruction)을 저장할 수 있다. 통신부는 복수의 사용자가 이용하는 단말 장치 또는 서버를 관리하는 단말 장치와 네트워크를 통해 각종 데이터 및 메시지 등을 교환할 수 있다. 통신부는 통신 동작을 수행하기 위한 하나 이상의 유선 통신 모듈 또는 무선 통신 모듈을 포함할 수 있다. 프로세서는 하나 이상의 인스트럭션을 저장하는 메모리와 전기적으로 연결되어 서버의 전반적 인 동작 및 기능을 제어할 수 있다. 도 1 내지 도 4를 참조하며 설명한 서버의 전반적인 동작 및 기능은 프로세서에 의해 구현될 수 있다. 예를 들어, 프로세서는 하나 이상의 프로세서로 구성될 수 있다. 이 때, 하나 이상의 프로세서는 CPU(Central Processing Unit), AP(Application Processor), DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU(Graphic Processing Unit), VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU(Neural Processing Unit)와 같은 인공지능 전용 프로세서 등으로 구현될 수 있다. 인공지능 전용 프로세서 는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계된 프로세서를 의미할 수 있다."}
{"patent_id": "10-2022-0007091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한편, 상술한 본 개시의 실시예들은 컴퓨터에서 실행될 수 있는 프로그램으로 작성가능하고, 작성된 프로그램은 매체에 저장될 수 있다. 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드를 위해 임시 저장하는 것일 수 도 있다. 또한, 매체는 단일 또는 수개 하드웨어가 결합된 형태의 다양한 기록수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워크 상에 분산 존재하는 것일 수도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체의 예시로, 어 플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어를 공급 내지 유통하는 사이트, 서버 등에서 관리하 는 기록매체 내지 저장매체도 들 수 있다. 이상, 본 개시에서 설명되는 실시예와 첨부된 도면은 본 개시에 포함되는 기술적 사상의 일부를 예시적으로 설 명하는 것에 불과하다. 따라서, 본 명세서에 개시된 실시예들은 본 개시의 기술적 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이므로, 이러한 실시예에 의하여 본 개시의 기술 사상의 범위가 한정되는 것은 아님은 자명하다. 본 개시의 명세서 및 도면에 포함된 기술적 사상의 범위 내에서 당업자가 용이하게 유추할 수 있는 변형예와 구 체적인 실시 예는 모두 본 개시의 권리범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2022-0007091", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른, 강의 커리큘럼 추천 정보를 제공하는 교육 서비스를 제공하기 위한 시스템 의 개략도이다. 도 2는 본 개시의 일 실시예에 따른, 강의 커리큘럼 추천 정보를 제공하는 교육 서비스를 제공하는 방법을 설명 하기 위한 순서도이다. 도 3은 본 개시의 일 실시예에 따른, 사용자 간의 관계도 및 커리큘럼 정보를 설명하기 위한 도면, 도 4는 본 개시의 일 실시예에 따른, 강의 커리큘럼 추천 정보를 제공하는 교육 서비스를 제공하는 방법을 설명 하기 위한 도면이다. 도 5는 본 개시의 일 실시예에 따른, 서버의 구성을 설명하기 위한 블록도이다."}
