{"patent_id": "10-2015-0113427", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0019257", "출원번호": "10-2015-0113427", "발명의 명칭": "음향 데이터의 적응적 처리", "출원인": "삼성전자주식회사", "발명자": "이남일"}}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스피커;외부 전자 장치와 통신하기 위한 통신 모듈; 및상기 통신 모듈과 기능적으로 연결된 프로세서를 포함하고, 상기 프로세서는,상기 통신 모듈을 이용하여, 상기 외부 전자 장치로부터 데이터를 수신하고; 상기 데이터가 음성에 대응하면, 상기 데이터를 제1 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제1 신호 처리 방식을 이용하여 변경하고;상기 데이터가 음악에 대응하면, 상기 데이터를 제2 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제2 신호 처리 방식을 이용하여 변경하고; 및상기 제1 신호 처리 방식 및 상기 제2 신호 처리 방식 중 대응하는 신호 처리 방식을 이용하여 변경된 상기 데이터에 대응하는 오디오 신호를 상기 스피커를 통하여 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 프로세서는, 상기 데이터의 적어도 일부 속성에 기반하여, 상기 데이터가 상기 음성 또는 상기 음악에 대응하는지를 판단하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 프로세서는, 상기 데이터를 분석하여 상기 데이터가 상기 음성 또는 상기 음악에 대응하는지를 판단하도록 설정된 전자장치."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 프로세서는,상기 데이터와 연관되어 상기 외부 전자 장치로부터 수신된 인식 정보 데이터에 기반하여 상기 데이터가 상기음성 또는 상기 음악에 대응하는지를 판단하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 프로세서는,상기 외부 장치와 통화 연결 중에 상기 데이터를 수신하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "외부 전자 장치로부터 데이터를 수신하는 동작;상기 데이터가 음성에 대응하면, 상기 데이터를 제1 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제1 신호 처리 방법을 이용하여 변경하는 동작;상기 데이터가 음악에 대응하면, 상기 데이터를 제2 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제2 신호 처리 방법을 이용하여 변경하는 동작; 및상기 제1 신호 처리 방법 및 상기 제2 신호 처리 방법 중 대응하는 신호 처리 방법을 이용하여 변경된 상기 데이터에 대응하는 오디오 신호를 출력 장치를 통하여 출력하는 동작을 포함하는 방법.공개특허 10-2017-0019257-3-청구항 7 제6항에 있어서, 상기 데이터의 적어도 일부 속성에 기반하여, 상기 데이터가 상기 음성 또는 상기 음악에 대응하는지를 판단하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 판단하는 동작은,상기 데이터를 분석하여 상기 데이터가 상기 음성 또는 상기 음악에 대응하는지를 판단하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 판단하는 동작은, 상기 데이터와 연관되어 상기 외부 전자 장치로부터 수신된 인식 정보 데이터에 기반하여 상기 데이터가 상기음성 또는 상기 음악에 대응하는지를 판단하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서, 상기 외부 장치로부터 상기 데이터를 수신하는 동작은,상기 외부 장치와 통화 연결 중에 상기 데이터를 수신하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "마이크;외부 전자 장치와 통신하기 위한 통신 모듈; 및상기 통신 모듈과 기능적으로 연결된 프로세서를 포함하고, 상기 프로세서는,상기 마이크를 통해 오디오 신호를 수신하고;상기 오디오 신호에 대응하는 데이터를 생성하고;상기 데이터에 적어도 기반하여 상기 오디오 신호의 속성을 판단하고;상기 오디오 신호가 음성에 대응하면, 제1 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제1 부호화 방식을 이용하여 부호화하고;상기 오디오 신호가 음악에 대응하면, 제2 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제2 부호화 방식을 이용하여 부호화하고; 및상기 오디오 신호를 상기 제1 부호화 방식 및 제2 부호화 방식 중 대응하는 부호화 방식을 이용하여 부호화된채로 상기 통신 모듈을 통하여 상기 외부 전자 장치로 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서, 상기 프로세서는,상기 판단된 속성을 나타내는 인식 정보 데이터를 상기 오디오 신호와 연관시키도록 설정된 전자 장치."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 프로세서는,상기 외부 전자 장치와 통화 연결 중에 상기 오디오 신호와 연관된 인식 정보 데이터를 전송하도록 설정된 전자장치."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 프로세서는,공개특허 10-2017-0019257-4-상기 외부 전자 장치와 통화 연결 중에 상기 데이터를 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "입력 장치로부터 오디오 신호를 수신하는 동작;상기 오디오 신호에 대응하는 데이터를 생성하는 동작;상기 데이터에 적어도 기반하여 상기 오디오 신호의 속성을 판단하는 동작;상기 오디오 신호가 음성에 대응하면, 상기 제1 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제1 부호화 방식을 이용하여 부호화하는 동작;상기 오디오 신호가 음악에 대응하면, 상기 제2 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제2 부호화 방식을 이용하여 부호화하는 동작; 및상기 오디오 신호를 상기 제1 부호화 방식 및 상기 제2 부호화 방식 중 대응하는 부호화 방식을 이용하여 부호화된 채로 통신 모듈을 통하여 상기 외부 전자 장치로 전송하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 판단된 속성을 나타내는 인식 정보 데이터를 상기 오디오 신호와 연관시키도록 설정하는 동작을 포함하는방법."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 통신 모듈을 통하여 상기 외부 전자 장치로 전송하는 동작은,상기 외부 전자 장치와 통화 연결 중에 상기 오디오 신호와 연관된 인식 정보 데이터를 전송하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서, 상기 통신 모듈을 통하여 상기 외부 전자 장치로 전송하는 동작은,상기 외부 전자 장치와 통화 연결 중에 상기 데이터를 전송하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "컴퓨터로 판독 가능한, 명령어들을 저장하고 있는 기록 매체에 있어서,외부 전자 장치로부터 데이터를 수신하는 동작;상기 데이터가 음성에 대응하면, 상기 데이터를 제1 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제1 신호 처리 방법을 이용하여 변경하는 동작;상기 데이터가 음악에 대응하면, 상기 데이터를 제2 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제2 신호 처리 방법을 이용하여 변경하는 동작; 및상기 제1 신호 처리 방법 및 상기 제2 신호 처리 방법 중 대응하는 신호 처리 방법을 이용하여 변경된 상기 데이터에 대응하는 오디오 신호를 출력 장치를 통하여 출력하는 동작을 실행시키기 위한 프로그램으로 기록한 컴퓨터 판독 가능한 기록 매체."}
{"patent_id": "10-2015-0113427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "컴퓨터로 판독 가능한, 명령어들을 저장하고 있는 기록 매체에 있어서,입력 장치로부터 오디오 신호를 수신하는 동작;상기 오디오 신호에 대응하는 데이터를 생성하는 동작;상기 데이터에 적어도 기반하여 상기 오디오 신호의 속성을 판단하는 동작;공개특허 10-2017-0019257-5-상기 오디오 신호가 음성에 대응하면, 상기 제1 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제1 부호화 방식을 이용하여 부호화하는 동작;상기 오디오 신호가 음악에 대응하면, 상기 제2 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제2 부호화 방식을 이용하여 부호화하는 동작; 및상기 오디오 신호를 상기 제1 부호화 방식 및 상기 제2 부호화 방식 중 대응하는 부호화 방식을 이용하여 부호화된 채로 통신 모듈을 통하여 상기 외부 전자 장치로 전송하는 동작을 실행시키기 위한 프로그램으로 기록한컴퓨터 판독 가능한 기록 매체."}
{"patent_id": "10-2015-0113427", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 음향 데이터의 적응적 처리를 위한 것이다. 다양한 실시 예에 따른 전자 장치는, 스피커; 외부 전자 장치와 통신하기 위한 통신 모듈; 및 상기 통신 모듈과 기능적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 통신 모듈을 이용하여, 상기 외부 전자 장치로 (뒷면에 계속)"}
{"patent_id": "10-2015-0113427", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 음향 데이터의 적응적 처리를 위한 것이다."}
{"patent_id": "10-2015-0113427", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 휴대폰이 발전함에 따라 이동 통신 시스템이 함께 발전하면서 이동 통신 시스템은 내부적으로 제2, 3, 4세 대 기술이 혼재되어 구성되고, 각각의 기술들이 다른 속도와 주기로 발전되었다. 제2 세대 GSM(global system for mobile communications) 기술은 4kHz(narrow band)의 통화 주파수 대역을 이 용하였고, 그 후 WCDMA(wideband code division multiple access) 기술은 8kHz(wide band)로 확장된 통화 주파 수 대역을 이용하였다. 최근에는 EVS(enhanced voice services) 기술을 이용하여 통화 주파수 대역이 기존 세대 의 음성대역(~8kHz)에서 16kHz(superwideband), 24kHz(fullband)까지 확장되어 오디오 대역까지 포함된 통화 품질에 대한 많은 기술과 처리방법이 필요하게 되었다."}
{"patent_id": "10-2015-0113427", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같이 종래에는 EVS 기술을 기반으로 고음역대의 통화 주파수 대역을 이용한 오디오 신호에 대한 신호처 리를 수행할 수 있다. 하지만 종래에는 통화 시 오디오 신호가 음성 또는 음악인지 구분 없이 신호 처리를 수행하기 때문에 오디오 신 호가 음성 대역 이상의 고음을 가지는 음악을 포함하는 경우 고음이 과도하게 필터 처리 되어 음질 열화가 발생 될 수 있다."}
{"patent_id": "10-2015-0113427", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에서는 음향 데이터의 적응적 처리에 관한 오디오 신호 처리를 위한 전자 장치 및 그 방법을 제공한다. 상술한 바를 달성하기 위해 본 발명의 다양한 실시 예에 따르면 전자장치는 스피커; 외부 전자 장치와 통신하기 위한 통신 모듈; 및 상기 통신 모듈과 기능적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 통신 모 듈을 이용하여, 상기 외부 전자 장치로부터 데이터를 수신하고; 상기 데이터가 음성에 대응하면, 상기 데이터를 제1 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제1 신호 처리 방식을 이용하여 변경하고; 상기 데이터가 음악에 대응하면, 상기 데이터를 제2 복호화 방식을 이용하여 복호화하고, 상기 복호 화된 데이터의 음성 품질을 제2 신호 처리 방식을 이용하여 변경하고; 및 상기 제1 신호 처리 방식 및 상기 제2 신호 처리 방식 중 대응하는 신호 처리 방식을 이용하여 변경된 상기 데이터에 대응하는 오디오 신호를 상기 스 피커를 통해서 출력하도록 설정될 수 있다. 본 발명의 다양한 실시 예들에 따르면 전자 장치에서 수행되는 방법은, 외부 전자 장치로부터 데이터를 수신하 는 동작; 상기 데이터가 음성에 대응하면, 상기 데이터를 제1 복호화 방식을 이용하여 복호화하고, 상기 복호화 된 데이터의 음성 품질을 제1 신호 처리 방법을 이용하여 변경하는 동작; 상기 데이터가 음악에 대응하면, 상기 데이터를 제2 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제2 신호 처리 방법을 이용하여 변경하는 동작; 및 상기 제1 신호 처리 방법 및 상기 제2 신호 처리 방법 중 대응하는 신호 처리 방법 을 이용하여 변경된 상기 데이터에 대응하는 오디오 신호를 출력 장치를 통하여 출력하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면 전자 장치는 마이크; 외부 전자 장치와 통신하기 위한 통신 모듈; 및 상 기 통신 모듈과 기능적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 마이크를 통해 오디오 신호를 수신하고; 상기 오디오 신호에 대응하는 데이터를 생성하고; 상기 데이터에 적어도 기반하여 상기 오디오 신호 의 속성을 판단하고; 상기 오디오 신호가 음성에 대응하면, 제1 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제 1 부호화 방식을 이용하여 부호화하고; 상기 오디오 신호가 음악에 대응하면, 제 2 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제2 부 호화 방식을 이용하여 부호화하고; 및 상기 오디오 신호를 상기 제1 부호화 방식 및 제2 부호화 방식 중 대응하 는 부호화 방식을 이용하여 부호화된 채로 상기 통신 모듈을 통하여 상기 외부 전자 장치로 전송하도록 설정될 수 있다. 본 발명의 다양한 실시 예들에 따르면 전자 장치에 수행되는 방법은, 입력 장치로부터 오디오 신호를 수신하는 동작; 상기 오디오 신호에 대응하는 데이터를 생성하는 동작; 상기 데이터에 적어도 기반하여 상기 오디오 신호 의 속성을 판단하는 동작; 상기 오디오 신호가 음성에 대응하면, 상기 제1 신호 처리 방법을 이용하여 상기 데 이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제1 부호화 방식을 이용하여 부호화하는 동작; 상기 오디 오 신호가 음악에 대응하면, 상기 제2 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제2 부호화 방식을 이용하여 부호화하는 동작; 및 상기 오디오 신호를 상기 제1 부호화 방식 및 상기 제2 부호화 방식 중 대응하는 부호화 방식을 이용하여 부호화된 채로 통신 모듈을 통하여 상기 외부 전 자 장치로 전송하는 동작을 포함할 수 있다."}
{"patent_id": "10-2015-0113427", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 명세서의 다양한 실시 예에서는 오디오 신호가 음성 또는 음악인지를 분석하여 음성 또는 음악에 따라 적절 한 처리를 수행함으로써 오디오 신호의 명료도를 향상시키고, 오디오 신호의 전 대역에 대한 고른 재생이 가능 하다."}
{"patent_id": "10-2015-0113427", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시 예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B 를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 예를 들면, 제1 사용자기기와 제2 사용자기기는, 순서 또는 중요도와 무관하게, 서로 다른 사 용자기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~ 를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할"}
{"patent_id": "10-2015-0113427", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술분야에서 통 상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경 우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따른 전자장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동전화기(mobile phone), 영상전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션 (workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)중 적어도 하나를 포함할 수 있다. 다 양한 실시 예에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자의복), 신체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자장치는 가전제품(home appliance)일 수 있다. 가전제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기청정기, 셋톱박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임콘솔(예: XboxTM, PlayStationTM), 전자사전, 전자키, 캠코더(camcorder), 또는 전자액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기,또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment)장치, 선박용 전자장비(예: 선박용 항법장치, 자이로콤파스 등), 항공전자기기 (avionics), 보안기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물인터넷 장치(internet of things)(예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터 (toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자장치 는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시 예에 따른 전자장치는 전술한 기기들에 한정되지 않으며, 기술 발 전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부도면을 참조하여, 다양한 실시 예에 따른 전자장치가 설명된다. 본 문서에서, 사용자라는 용어는 전 자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1을 참조하여, 다양한 실시 예에서의, 네트워크환경 내의 전자 장치가 기재된다. 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 및 통신 인터페이스 를 포함할 수 있다. 어떤 실시 예에서는, 전자장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(110-170)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/또 는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치(central processing unit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신 에 관한 연산이나 데이터 처리를 실행할 수 있다. 상기 프로세서는 제어부(controller)라고 칭하거나, 상 기 제어부를 그 일부로서 포함하거나, 상기 제어부를 구성할 수도 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자장치 의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시 예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨 어, 어플리케이션 프로그래밍 인터페이스(application programming interface(API)), 및/또는 어플 리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API(14 5)의 적어도 일부는, 운영 시스템(operating system(OS))으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로 그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다.미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선순위에 따 라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이션 프로그램 중 적어도 하나에 전자 장치(10 1)의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선순위를 부여할 수 있다. 예컨대, 미들웨어는 상기 적어도 하나에 부여된 우선순위에 따라 상기 하나 이상의 작업 요청들 을 처리함으로써, 상기 하나 이상의 작업 요청들에 대한 스케쥴링 또는 로드 밸런싱 등을 수행할 수 있다. API는, 예를 들면, 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위 한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페 이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력인터페이스(15 0)는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출 력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(liquid crystal display(LCD)), 발광 다이오드(light- emitting diode(LED)) 디스플레이, 유기 발광 다이오드(organic light-emitting diode(OLED)) 디스플레이, 또 는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이 미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제1 외부 전자 장치, 제2 외부 전자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제2 외부 전자장치 또는 서버)와 통신 할 수 있다. 한 실시 예에 따르면 통신 인터페이스는 외부 장치(예: 제1 외부 전자 장치, 제2 외부 전자 장치 , 또는 서버)로부터 개인 프로파일 또는/및 그룹 프로파일을 수신하거나 외부 장치로 개인 프로파일 또는/및 그룹 프로파일을 전달할 수 있다. 무선 통신은, 예를 들면, 셀룰러 통신 프로토콜로서, 예를 들면, LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications)등 중 적어도 하나를 사용할 수 있다. 또한, 무선 통신은, 예를 들면, 근거리 통신을 포함 할 수 있다. 근거리 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스(Bluetooth), NFC(near field communication), 또는GNSS(global navigation satellite system)등 중 적어도 하나를 포함할 수 있다. GNSS는 사용 지역 또는 대역폭 등에 따라, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system 중 적어도 하나를 포함할 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\" 와 혼용되어 사용(interchangeably used)될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 통신 네트워크(telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화망(telephone network) 중 적어도 하나를 포함할 수 있다. 제1 및 제2 외부 전자 장치(102,104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 한 실시 예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시 예에 따르면, 전자장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자장치(102,104), 또는 서버)에서 실행될 수 있다. 한 실시 예에 따르면, 전자 장치가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경 우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어 도 일부 기능을 다른 장치(예: 전자 장치(102,104), 또는 서버)에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(102,104), 또는 서버)는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 2는 다양한 실시 예에 따른 전자 장치의 블록도이다. 전자 장치는, 예를 들면, 도 1에 도시된 전자 장 치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP(application processor)), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력관리 모듈, 배터리, 인디케이터, 및 모터를 포함할 수 있다. 프로세서는, 예를 들면, 운영체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드웨 어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서(21 0)는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 프로세서는 GPU(graphic processing unit) 및 /또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서는 도 2에 도시된 구 성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프로세서는 다른 구성요소들(예: 비 휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 한 실시 예에 따르면, 프로세서는 마이크를 통해 입력된 오디오 신호를 오디오 데이터로 변환하고, 오디오 데이터를 분석하여 음성 또는 음악에 대응하는지를 결정하여 결정된 결과에 따라 음성 또는 음악에 대응 하는 전처리 및 부호화를 수행한 후 부호화된 오디오 데이터를 출력하도록 오디오 모듈을 제어할 수 있다. 또한 프로세서는 통신 모듈을 통해서 수신된 부호화된 오디오 데이터를 분석하여 음성 또는 음악에 대응하는지를 결정하여 결정된 결과에 따라 음성 또는 음악에 대응하는 복호화 및 후처리를 수행한 후 스피커 를 통해서 오디오 신호를 출력하도록 오디오 모듈을 제어할 수 있다. 통신모듈은, 도 1의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신모듈은, 예 를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모 듈, Beidou 모듈, 또는 Galileo 모듈), NFC 모듈 및 RF(radio frequency) 모듈를 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하 여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈 은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 각각은, 예를 들면, 해당하는 모듈 을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시 예에 따르면, 셀룰러 모 듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜시 버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또는 안테나 등을 포함할 수 있다. 다른 실시 예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포 함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM),PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱(memory stick) 등을 더 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하 여 전자 장치와 기능적으로 및/또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(240A), 자이로 센서(240B), 기 압 센서(240C), 마그네틱 센서(240D), 가속도 센서(240E), 그립 센서(240F), 근접 센서(240G), 컬러(color) 센 서(240H)(예: RGB(red, green, blue) 센서), 생체 센서(240I), 온/습도 센서(240J), 조도 센서(240K), 또는 UV(ultra violet) 센서(240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로(additionally or alternatively), 센서 모듈은, 예를 들면, 후각 센서(E-nose sensor), EMG 센서(electromyography sensor), EEG 센서(electroencephalogram sensor), ECG 센서(electrocardiogram sensor), IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로 서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep)상 태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정전 식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마 이크(예: 마이크)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이 터를 확인할 수 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 또는 프로젝터를 포함할 수 있 다. 패널은, 도 1의 디스플레이와 동일 또는 유사한 구성을 포함할 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널 은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예 를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 디스플레이는 패널 , 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 인 터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적 으로(additionally and alternatively), 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인 터페이스, SD(secure digital) 카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈 은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 한 실시 예에 따르면, 오디오 모듈은 마이크를 통해 입력된 오디오 신 호를 분석하여 음성 신호인지 또는 음악 신호인지에 따라 적합한 전처리 및 인코딩을 수행한 후 인코딩된 오디 오 신호를 출력할 수 있다. 또한 오디오 모듈은 수신된 오디오 신호를 디코딩하고, 디코딩된 오디오 신호 를 분석하여 음성 신호인지 또는 음악 신호인지에 따라 적합한 후처리를 수행한 후 스피커를 통해서 출력 할 수 있다.카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터 리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무 선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터 리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리 는, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터는 전자 장치또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시 지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있고, 진 동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치는 모바 일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(mediaFloTM) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자장치의 종류에 따라서 달라질 수 있다. 다양한 실시 예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시 예에 따른 전자 장치의 구성요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 도 3은 다양한 실시 예에 따른 프로그램 모듈의 블록도이다. 한 실시 예에 따르면, 프로그램 모듈(예: 프 로그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영체제(operating system(OS)) 및 /또는 운영체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프로그램)을 포함할 수 있다. 운 영체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈(windows), 심비안(symbian), 타이젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface (API)), 및/또는 어플리케이션을 포함할 수 있다. 프로그램 모듈의 적 어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 전자장치(102,104), 서버 등)로부터 다운로드(download) 가능하다. 커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저및/또는 디바이스 드라이버를 포함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시 예에 따르면, 시스템 리소스 매니저는 프로세스관리부, 메모리관리부, 또는 파일시스템관리부 등을 포함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 또는 IPC(inter- process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API를 통해 다양한 기능들 을 어플리케이션으로 제공할 수 있다. 한 실시 예에 따르면, 미들웨어(예: 미들웨어)는 런타임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀 티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매 니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입출력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명주기(life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미디어 매 니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하 여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어플리케 이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리할 수 있 다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 (battery) 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매 니저는 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저는, 예를 들면, WiFi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도 착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할 수 있 다. 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는 사용자에게 제공될 그 래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용 자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 전자 장치) 가 전화 기능을 포함한 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매 니저(telephony manager)를 더 포함할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들웨 어는 차별화된 기능을 제공하기 위해 운영체제의 종류별로 특화된 모듈을 제공할 수 있다. 또한, 미들웨어 는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영체제에 따라 다른 구성으로 제 공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼별로 하나의 API 셋을 제공할 수 있으며, 타이젠 (tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일 , 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리(health care)(예: 운동량 또 는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 전자 장치 (102,104)) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의상, \"정보 교환 어플리케이션\")을 포 함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달 (notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어 플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 (예: 전자 장치(102,104))로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외 부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치(102,104))의 적어 도 하나의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비 스(예: 통화 서비스 또는 메시지 서비스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시 예에 따르면, 어플리케이션은 외부 전자 장치(예: 전자 장치(102,104))의 속성(에 따라 지정된 어 플리케이션(예: 모바일 의료 기기의 건강 관리 어플리케이션 등)을 포함할 수 있다. 한 실시 예에 따르면, 어플 리케이션은 외부 전자 장치(예: 서버 또는 전자 장치(102,104))로부터 수신된 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 프리로드 어플리케이션(preloaded application) 또는 서버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시 예에 따 른 프로그램 모듈의 구성요소들의 명칭은 운영체제의 종류에 따라서 달라질 수 있다. 다양한 실시 예에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세서(예: 프 로세서)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등을 포함할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리블 록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프 로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서 가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리 가 될 수 있다. 컴퓨터로 판독 가능한 기록매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이 프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digital versatile disc), 자기-광매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리등) 등을 포함할 수 있다. 또한, 프로 그램명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터 에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 문서에 서 기재된 기술의 범위를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 문서의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다. 도 4는 다양한 실시 예에 따라 송신 장치에서 오디오 신호를 처리하는 오디오 모듈의 구성도를 도시한다. 도 4에 따르면 전자 장치가 오디오 데이터를 출력하는 송신 장치인 경우 오디오 모듈은 A/D 변환부 (280-1), 전처리부(280-2), EVS 인코더(enhanced voice services encoder)(280-3)를 포함할 수 있다. A/D 변환부(280-1)는, 예를 들면, 마이크를 통해서 입력된 오디오 신호에 대응하는 오디오 데이터를 생성 하여 출력할 수 있다. 전처리부(280-2)는, 예를 들면, A/D 변환부(280-1)에서 출력된 오디오 데이터를 EVS 인코더(280-3)로 전달하고, 오디오 데이터의 속성을 판단하여 판단 결과에 따라 전처리를 수행할 수 있다. 한 실시 예에 따르면, 전처리부 (280-2)는 오디오 데이터가 음성(speech)에 관련된 오디오 데이터인지 또는 음악(music)에 관련된 오디오 데이 터인지를 판단하고, 판단결과에 따라 음성에 대응하는 신호 처리 방법 또는 음악에 대응하는 신호 처리 방법 중 대응하는 신호 처리 방법을 이용하여 오디오 데이터의 음성 품질을 변경할 수 있다. 한 실시 예에 따르면 전처리부(280-2)는, 예를 들면, EVS 인코더(280-3)로부터 전달된 오디오 데이터가 음성 또 는 음악에 대응하는지 결정한 결과에 따른 인식 정보 데이터를 기반으로 음성에 관련된 오디오 데이터인 경우 음성에 관련된 전처리 방식을 이용하여 오디오 데이터에 대한 음성 품질을 변경하고, 음악에 관련된 오디오 데이터인 경우 음악에 관련된 전처리 방식을 이용하여 오디오 데이터에 대한 음성 품질을 변경할 수 있다. 예를 들어, 음성 신호에 관련된 전처리 방식은 주변 노이즈 제거를 위한 NS(noise suppressor) 강화, 명료도 향 상을 위한 필터, 잔여 노이즈 제거를 위한 익스펜더, 클리핑(clipping) 방지를 위한 컴프레싱(compressing)을 적용한 AGC(automatic gain control) 등에 대한 방식을 포함할 수 있고, 음악 신호에 관련된 전처리 방식은 NS 기능 완화, 전 대역의 고름 음역 확보를 위한 풀-밴드 필터(full-band filter), 다이나믹 레인지(dynamic range) 확보를 위한 AGC 등에 대한 방식들을 포함할 수 있다. EVS 인코더(280-3)는, 예를 들면, 전처리부(280-2)로부터 수신된 오디오 데이터가 음성 또는 음악에 대응하는지 판단하고, 판단된 결과에 따른 인식 정보 데이터를 생성하여 전처리부(280-2)로 전달할 수 있다. 예를 들어, 인 식 정보 데이터는 판단된 오디오 데이터의 속성을 나타내는 데이터일 수 있다. 이러한 인식 정보 데이터는 오디 오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 나타내는 플래그 값을 포함할 수 있다. 여기서, EVS 인코더(280-3)는 음성과 음악이 함께 포함된 오디오 데이터인 경우 음악에 대응하는 오디오 데이터로 판단할 수 있다. 예를 들어, EVS 인코더(280-3)는 GMM(gaussian mixture model)을 기반으로 오디오에서 음성에 대한 구별을 수행하고, 배경 소음 결정 동작을 수행하여 음악 또는 음성 또는 배경 소음을 결정할 수 있다. 이러한 동작은 EVS 코덱에 대한 일반적인 동작이기 때문에 구체적인 설명을 생략한다. 전처리부(280-2)로부터 전처리된 오디오 데이터가 수신되면 EVS 인코더(280-3)는, 예를 들면, 전처리된 오디오 데이터를 부호화하고, 부호화된 오디오 데이터를 출력할 수 있다. 한 실시 예에 따르면 EVS 인코더(280-3)는 오디오 데이터가 음성에 대응하는 오디오 데이터인 경우 음성에 대응 하는 오디오 데이터를 부호화하기 위한 제1 부호화 방식을 결정하여 전처리된 오디오 데이터에 대한 부호화를 수행하고, 오디오 데이터가 음악에 대응하는 오디오 데이터인 경우 음악 신호를 부호화하기 위한 제2 부호화 방 식을 결정하여 전처리된 오디오 데이터에 대한 부호화를 수행할 수 있다. 예를 들어, 제1 부호화 방식은 CELP 부호화(code excited linear prediction encoding) 방식 등을 포함할 수 있고, 제2 부호화 방식은 MDCT 부호화(modified discrete cosine transform encoding) 방식 등을 포함할 수 있 다. 다양한 실시 예에 따르면 EVS 인코더(280-3)는 오디오 신호를 제1 부호화 방식 및 제2 부호화 방식 중 대응하는 부호화 방식을 이용하여 부호화된 채로 RF 모듈로 전달하고, RF 모듈이 부호화된 오디오 데이터를 수 신 장치로 전송할 수 있다. 다양한 실시 예에 따르면 EVS 인코더(280-3)는 제1 부호화 방식 및 제2 부호화 방식 중 대응하는 부호화 방식을 이용하여 부호화된 오디오 데이터를 RF 모듈로 전달하고, 부호화된 오디오 데이터와 함께 또는 별개로 (distinct) 인식 정보 데이터를 RF 모듈로 전달하여 RF 모듈이 부호화된 오디오 데이터 및 인식 정보 데이터를 수신 장치로 함께 또는 별개로 전송할 수도 있다. 예를 들어, EVS 인코더(280-3)는 상기에서 생성된 인식 정보 데이터를 오디오 데이터와 연관시키고, 오디오 데이터와 함께 또는 별개로 상기 오디오 데이터와 연 관된 인식 정보 데이터를 RF 모듈로 전달할 수 있다. 도 5는 다양한 실시 예에 따라 수신 장치에서 오디오 신호를 처리하는 오디오 모듈의 구성도를 도시한다. 도 5에 따르면 전자 장치가 오디오 데이터를 수신하는 수신 장치인 경우 오디오 모듈는 EVS 디코더 (enhanced voise services decoder)(280-4), 후처리부(280-5), D/A 변환부(280-6)를 포함할 수 있다. EVS 디코더(280-4)는, 예를 들면, 통신 모듈을 통해서 수신된 부호화된 오디오 데이터의 적어도 일부 속성 에 기반으로 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 판단하고, 판단 결 과에 따라 부호화된 오디오 데이터를 복호화하여 출력할 수 있다. 한 실시 예에 따르면 수신된 부호화된 오디오 데이터에 연관된 인식 정보 데이터가 수신된 경우 EVS 디코더 (280-4)는 수신된 인식 정보 데이터를 기반으로 부호화된 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 판단할 수 있다. 한 실시 예에 따르면 수신된 부호화된 오디오 데이터에 연관되어 인식 정보 데이터가 수신되지 않은 경우 EVS 디코더(280-4)는 수신된 오디오 데이터를 분석하여 수신된 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 판단하고, 판단 결과에 따라 부호화된 오디오 데이터를 복호화하여 출력할 수 있다. EVS 디코더(280-4)는, 예를 들면, 판단 결과에 따라 음성에 대응하는 오디오 데이터인 경우 음 성에 대응하는 오디오 데이터를 복호화하기 위한 제1 복호화 방식을 결정하여 부호화된 오디오 데이터에 대한복호화를 수행하며, 음악에 대응하는 오디오 데이터인 경우 음악에 대응하는 오디오 데이터를 복호화하기 위한 제2 복호화 방식을 결정하여 부호화된 오디오 데이터에 대한 복호화를 수행할 수 있다. 예를 들어, 제1 복호화 방식은 CELP 복호화(code excited linear prediction decoding) 방식 등을 포함할 수 있고, 제2 복호화 방식은 MDCT 복호화(modified discrete cosine transform decoding) 방식 등을 포함할 수 있 다. 복호화된 오디오 데이터를 출력할 시 EVS 디코더(280-4)는, 예를 들면, 복호화된 오디오 데이터와 함께 인식 정 보 데이터를 후처리부(280-5)로 전달할 수 있다. 한 실시 예에 따르면, 복호화된 오디오 데이터를 출력할 시 EVS 디코더(280-4)는, 예를 들면, 오디오 데이터가 음성 또는 음악에 대응하는 오디오 데이터인지를 나타내는 인식 정보 데이터를 생성하고, 생성된 인식 정보 데 이터를 복호화된 오디오 데이터와 함께 후처리부(280-5)로 전달할 수 있다. 후처리부(280-5)는, 예를 들면, EVS 디코더(280-4)로부터 전달된 복호화된 오디오 데이터가 음성에 대응하는 오 디오 데이터인 경우 음성에 관련된 후처리 방식을 이용하여 후처리를 수행하고, 복호화된 오디오 데이터가 음악 에 대응하는 오디오 데이터인 경우 음악에 관련된 후처리 방식을 이용하여 후처리를 수행하며, 후처리된 오디오 데이터를 출력할 수 있다. 한 실시 예에 따르면 후처리부(280-5)는 EVS 디코더(280-4)로부터 전달된 복호화된 오디오 데이터와 함께 전달 된 인식 정보 데이터를 기반으로 복호화된 오디오 데이터가 음성에 대응하는 오디오 데이터인지 음악에 대응하 는 오디오 데이터인지를 판단하여 판단 결과에 따라 복호화된 오디오 데이터가 음성에 대응하는 오디오 데이터 인 경우 음성에 관련된 후처리 방식을 이용하여 복호화된 오디오 데이터의 음성 품질을 변환하고, 복호화된 오 디오 데이터가 음악에 대응하는 오디오 데이터인 경우 음악에 관련된 후처리 방식을 이용하여 복호화된 오디오 데이터의 음성 품질을 변환하여 출력할 수 있다. 예를 들어, 음성에 관련된 후처리 방식은 주변 노이즈 제거를 위한 NS 강화, 명료도 향상을 위한 필터, 잔여 노이즈 제거를 위한 익스펜더, 클리핑 방지를 위한 컴프레싱을 적용한 AGC 등에 대한 방식을 포함할 수 있고, 음악에 관련된 후처리 방식은 NS 기능 완화, 전 대역의 고른 음 역 확보를 위한 풀-밴드 필터, 다이나믹 레인지 확보를 위한 AGC 등에 대한 방식을 포함할 수 있다. D/A 변환부(280-6)는, 예를 들면, 후처리된 오디오 데이터에 대응하는 오디오 신호를 스피커로 출력할 수 있다. 한 실시 예에 따르면, D/A 변환부(280-6)는 음성에 대응하는 신호 처리 방법 및 음악에 대응하는 신호 처리 방 법 중 대응하는 신호 처리 방법을 이용하여 변경된 오디오 데이터에 대응하는 오디오 신호를 생성하고, 생성된 오디오 신호를 스피커로 출력할 수 있다. 상기에서 본 발명의 실시 예에 따른 오디오 모듈은 프로세서의 제어에 의해서 오디오 데이터에 대한 전처리 및 인코딩을 수행하거나 오디오 데이터에 대한 디코딩 및 후처리를 수행하지만, 다양한 실시 예에 따라 프로세서가 상기에서 설명한 오디오 모듈의 동작을 수행하거나 프로세서 내에 A/D 변환부, D/A 변환부, 전처리부, EVS 인코더, 후처리부, EVS 디코더가 포함될 수도 있다. 다양한 실시 예에 따르면 본 발명은 EVS 인코더 및 EVS 디코더를 이용하여 오디오 데이터를 처리하는 것을 설명 하였으나, 이에 한정되지 않으며, 오디오 데이터가 음성 또는 음악에 대응하는지 결정하고, 음성 또는 음악에 대응하는 부호화 방식을 이용하여 부호화를 수행하거나 음성 또는 음악에 대응하는 복호화 방식을 이용하여 복 호화를 수행하는 다양한 인코더 또는 디코더를 이용할 수 있다. 도 6은 다양한 실시 예에 따라 오디오 신호를 송신하는 송신 장치와 오디오 신호를 수신하는 수신 장치에 대한 구성도를 도시한다. 도 6에 따르면 송신 장치는 입력된 외부 소리를 오디오 신호로 변환하여 출력하는 마이크, 오디오 신 호를 소리로 변환하여 출력하는 스피커, 오디오 신호에 대응하는 오디오 데이터를 생성하여 출력하는 A/D 변환부, 오디오 데이터를 전처리하는 전처리부, 전처리된 오디오 데이터를 부호화하는 EVS 인코더 , 부호화된 오디오 데이터를 수신 장치로 전달하는 RF 모듈을 포함할 수 있다. 한 실시 예에 따르면, 송신 장치의 전처리부는 오디오 데이터를 전처리하기 전에 EVS 인코더로 전달하고, EVS 인코더를 통해서 전달된 인식 정보 데이터를 기반으로 오디오 데이터가 음성에 대응하는 오 디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지 판단하여 판단 결과에 따라 전처리를 수행할 수 있다. 예를 들어, 전처리부는 인식 정보 데이터를 기반으로 오디오 데이터가 음성에 대응하는 오디오 데이터로 판단되면 음성에 대응하는 전처리 방식을 이용하여 오디오 데이터의 음성 품질을 변경하여 변경된 오디오 데이터를 생성할 수 있다. 오디오 데이터가 음악에 대응하는 오디오 데이터로 판단되면 전처리부는 음악에 대응하는 전처리 방식을 이용하여 오디오 데이터의 음성 품질을 변경하여 변경된 오디오 데이터를 생성할 수 있 다. 한 실시 예에 따르면, EVS 인코더는 전처리부를 통해서 전달된 오디오 데이터를 분석하여 음성에 대 응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지 결정하여 결정 결과에 따라 오디오 데이터 가 음성 또는 음악에 대응하는지를 나타내는 인식 정보 데이터를 생성하고, 생성된 인식 정보 데이터를 전처리 부로 전달할 수 있다. 전처리부로부터 전처리된 오디오 데이터가 수신되면 EVS 인코더는, 예를 들면, 오디오 데이터가 음성 에 대응하는 오디오 데이터인 경우 변경된 오디오 데이터를 음성에 대응하는 제1 부호화 방식을 이용하여 부호 화할 수 있다. 예를 들면, 제1 부호화 방식은 CELP 부호화 방식을 포함할 수 있다. 오디오 데이터가 음악에 대응하는 오디오 데이터인 경우 EVS 인코더는, 예를 들면, 변경된 오디오 데이터 를 음악에 대응하는 제2 부호화 방식을 이용하여 부호화할 수 있다. 예를 들면, 제2 부호화 방식은 MDCT 부호화 방식을 포함할 수 있다. EVS 인코더는, 예를 들면, 부호화된 오디오 데이터를 RF 모듈로 전달할 수 있다. 한 실시 예에 따르 면 EVS 인코더는 부호화된 오디오 데이터와 함께 또는 별개로 인식 정보 데이터를 RF 모듈로 전달할 수도 있다. RF 모듈은, 예를 들면, 부호화된 오디오 데이터를 수신 장치로 전송할 수 있다. 한 실시 예에 따르면 RF 모듈은 부호화된 오디오 데이터와 함께 또는 별개로 인식 정보 데이터를 수신 장치로 전송할 수도 있다. 수신 장치는 송신 장치로부터 부호화된 오디오 데이터를 수신하는 RF 모듈, 부호화된 오디오 데 이터를 복호화하는 EVS 디코더, 복호화된 오디오 데이터를 후처리하는 후처리부, 후처리된 오디오 데 이터에 대응하는 오디오 신호를 생성하여 출력하는 D/A 변환부, 오디오 신호를 소리로 변환하여 출력하는 스피커, 외부 소리를 전자 신호로 변환하여 출력하는 마이크를 포함할 수 있다. 한 실시 예에 따르면, 인식 정보 데이터가 수신된 경우 수신 장치의 EVS 디코더는 수신된 인식 정보 데이터를 기반으로 부호화된 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 판단하고, 판단 결과에 따라 음성에 대응하는 제1 복호화 방식을 이용하여 부호화된 오디오 데이 터를 복호화하거나 음악에 대응하는 제2 복호화 방식을 이용하여 부호화된 오디오 데이터를 복호화할 수 있다. 예를 들면, 제1 복호화 방식은 CELP 복호화 방식을 포함하고, 제2 복호화 방식은 MDCT 복호화 방식을 포함할 수 있다. EVS 디코더는, 예를 들면, 복호화된 오디오 데이터와 함께 인식 정보 데이터를 후처리부로 전달할 수 있다. 한 실시 예에 따르면 인식 정보 데이터가 수신되지 않은 경우 EVS 디코더는 부호화된 오디오 데이터의 적 어도 일부 속성에 기반하여 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 판단하고, 판단 결과에 따라 음성에 대응하는 제1 복호화 방식을 이용하여 부호화된 오디오 데이 터를 복호화하거나 음악에 대응하는 제2 복호화 방식을 이용하여 부호화된 오디오 데이터를 복호화할 수 있다. 여기서, EVS 디코더는 부호화된 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하 는 오디오 데이터인지를 나타내는 인식 정보 데이터를 생성하고, 생성된 인식 정보 데이터를 복호화된 오디오 데이터와 함께 후처리부로 전달할 수 있다. 후처리부는, 예를 들면, 인식 정보 데이터를 기반으로 복호화된 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 판단하고, 판단 결과에 따라 음성에 대응하는 후처리 방 식을 이용하거나 음악에 대응하는 후처리 방식을 이용하여 복호화된 오디오 데이터에 대한 후처리를 수행하여 후처리된 오디오 데이터를 출력할 수 있다. 도 7은 다양한 실시 예에 따라 송신 장치에 포함된 EVS 인코더에 대한 구성도를 도시한다. 도 7에 따르면 EVS 인코더는 오디오 분석부(605-1), 음성 처리부(605-2), 무음 처리부(605-3), 음악 처리 부(605-4), 비트 스트림 생성부(605-5)를 포함할 수 있다. 오디오 분석부(605-1)는, 예를 들면, 전처리부를 통해서 전달된 오디오 데이터를 분석하여 오디오 데이터 가 음성, 무음, 음악 중 어느 하나에 대응하는 오디오 데이터인지를 판단할 수 있다. 판단 결과에 따라 오디오 데이터가 음성에 대응하는 경우 오디오 분석부(605-1)는 오디오 데이터를 음성 처리부(605-2)로 전달하고, 오디 오 데이터가 무음에 대응하는 경우 오디오 데이터를 무음 처리부(605-3)로 전달하며, 오디오 데이터가 음악에 대응하는 경우 오디오 데이터를 음악 처리부(605-4)로 전달할 수 있다. 한 실시 예에 따르면 오디오 분석부(605-1)는 판단 결과를 나타내는 인식 정보 데이터를 생성하여 전처리부 로 전달할 수 있다. 음성 처리부(605-2)는, 예를 들면, 오디오 데이터를 음성에 대응하는 CELP 부호화 방식과 같은 제1 부호화 방식 을 이용하여 부호화를 수행할 수 있다. 무음 처리부(605-3)는, 예를 들면, 오디오 데이터에 노이즈가 발생되도록 부호화를 수행할 수 있다. 예를 들어, 무음 처리부(605-3)는 CNG(Comfort Noise Generation) 방식을 이용하여 노이즈가 발생되도록 부호화를 수행할 수 있다. 음악 처리부(605-4)는, 예를 들면, 오디오 데이터를 음악에 대응하는 MDCT 부호화 방식과 같은 제2 부호화 방식 을 이용하여 부호화를 수행할 수 있다. 오디오 분석부(605-1)는, 예를 들면, 판단 결과를 포함하는 인식 정보 데이터를 생성하고, 생성된 인식 정보 데 이터와 부호화된 오디오 데이터를 결합(MUX)하여 비트스트림 생성부(605-5)로 전달할 수 있다. 비트스트림 생성부(605-5)는, 예를 들면, 결합된 데이터를 비트스트림으로 출력할 수 있다. 도 8은 다양한 실시 예에 따라 수신 장치에 포함된 EVS 디코더 및 후처리부에 대한 구성도를 도시한다. 도 8에 따르면 EVS 디코더는 오디오 분석부(615-1), 디코딩부(615-2)를 포함하고, 후처리부는 음성 후처리부(614-1), 음악 후처리부(614-2)를 포함할 수 있다. EVS 디코더의 오디오 분석부(615-1)는, 예를 들면, 수신된 오디오 데이터를 분석하여 수신된 오디오 데이 터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 판단할 수 있다. 한 실시 예에 따르면 송신 장치로부터 인식 정보 데이터를 수신하면 오디오 분석부(615-1)는 수신된 인식 정보 데이터를 기반으로 부호화된 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 판단할 수 있다. 한 실시 예에 따르면 송신 장치로부터 인식 정보 데이터를 수신하지 않으면 오디오 분석부(615-1)는 오디 오 데이터를 분석하여 수신된 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디 오 데이터인지를 판단하고, 판단 결과를 나타내는 인식 정보 데이터를 생성할 수 있다. 디코딩부(615-2)는, 예를 들면, 오디오 분석부(615-1)에서 판단된 결과에 따라 음성에 대응하는 복호화 방식을 이용하거나 음악에 대응하는 복호화 방식을 이용하여 부호화된 오디오 데이터에 대한 복호화를 수행할 수 있다. 이와 같이 복호화된 오디오 데이터는 인식 정보 데이터와 함께 후처리부로 전달될 수 있다. 후처리부는, 예를 들면, EVS 디코더로부터 전달된 인식 정보 데이터를 기반으로 오디오 데이터가 음 성 또는 음악에 대응되는지를 판단하고, 판단 결과에 따라 음성 또는 음악에 대응하는 후처리 방식을 이용하여 오디오 데이터에 대한 후처리를 수행할 수 있다. 음성 후처리부(614-1)는, 예를 들면, 음성에 대응하는 후처리 방식을 이용하여 복호화된 오디오 데이터에 대한 후처리를 수행할 수 있다. 예를 들어, 음성에 대응하는 후처리 방식은 수신측의 오디오 신호에서 노이즈를 저감 또는 제거하는 FENS(far-end noise suppression) 방식, 오디오 신호의 주파수 영역에서 저대역 부분을 제거하는 Cut off 방식, 오디오 신호의 다이나믹을 일정하게 조절하는 AGC 방식 등을 포함할 수 있다. 음악 후처리부(614-2)는, 예를 들면, 음악에 대응하는 후처리 방식을 이용하여 복호화된 오디오 데이터에 대한 후처리를 수행할 수 있다. 예를 들어, 음악에 대응하는 후처리 방식은 오디오 신호가 음악에 대응하는 경우 노 이즈를 제거하지 않거나 낮추는 FENS 미사용 방식, 오디오 신호가 음악에 대응하는 경우 컷 오프를 낮추는 컷 오프 다운(Cut off down) 방식, 오디오 신호가 음악에 대응하는 경우 음악에 맞춰서 AGC 어택/릴리즈 시간(AGCattack/release time)을 조절하는 조절 방식 등을 포함할 수 있다. 도 9는 다양한 실시 예에 따라 전처리부 및 EVS 디코더를 포함하는 송신 장치에 대한 구성도를 도시한다. 전처리부는 전처리 제어부(604-1), 음성 전처리부(604-2), 음악 전처리부(604-3)를 포함하고, EVS 인코더 는 오디오 분석부(605-1), 음성 처리부(605-2), 무음 처리부(605-3), 음악 처리부(605-4), 비트 스트림 생성부(605-5)을 포함할 수 있다. EVS 인코더의 오디오 분석부(605-1)는, 예를 들면, 전처리부의 음악 전처리부(604-3)를 통해서 오디 오 데이터를 수신할 수 있다. 다양한 실시 예에 따르면 전처리부는 오디오 데이터의 손실을 줄이기 위해 오디오 데이터에 대한 전처리를 수행하기 전에 음악 전처리부(604-3)를 통해서 EVS 인코더로 오디오 데이 터를 전달할 수 있다. 오디오 분석부(605-1)는, 예를 들면, 음악 전처리부(604-3)를 통해서 전달된 오디오 데이터를 분석하여 오디오 데이터의 적어도 일부가 음성 또는 음악으로 판단되면 판단 결과를 포함하는 인식 정보 데이터를 전처리 제어부 (604-1)로 전달할 수 있다. 전처리 제어부(604-1)는, 예를 들면, 오디오 분석부(605-1)로부터 전달된 인식 정보 데이터를 기반으로 음성 전 처리부(604-2) 또는 음악 전처리부(604-3)가 오디오 데이터에 대한 전처리를 수행하도록 제어할 수 있다. 예를 들어, 판단 결과에 따라 오디오 데이터의 적어도 일부가 음성으로 판단되면 전처리 제어부(604-1)는 음성 전처 리부(604-2)를 통해서 오디오 데이터에 대한 전처리를 수행하고, 오디오 데이터의 적어도 일부가 음악으로 판단 되면 음악 전처리부(604-3)를 통해서 오디오 데이터에 대한 전처리를 수행할 수 있다. 상기에서 설명한 본 발명의 실시 예에서 오디오 분석부(605-1)는 EVS 인코더에 포함되도록 구성되었지만, EVS 인코더와 별도로 구성될 수도 있다. 도 10은 다양한 실시 예에 따라 오디오 분석부가 EVS 인코더와 별도로 구성된 송신 장치에 대한 구성도를 도시 한다. 도 10에 따르면 오디오 분석부(605-1)는 EVS 인코더와 별도로 구성되고, 오디오 데이터가 수신되면 전처리 부에서 오디오 데이터에 대한 전처리를 수행하기 전에 오디오 데이터를 분석하여 오디오 데이터가 음성 또 는 음악인지를 결정하고, 결정 결과를 포함하는 인식 정보 데이터를 생성하여 전처리부로 전달할 수 있다. 전처리부는, 예를 들면, 인식 정보 데이터를 기반으로 오디오 데이터가 음성에 대응하는 경우 음성 전처리 부(604-2)를 통해서 음성에 대응하는 전처리 방식을 이용하여 오디오 데이터에 대한 전처리를 수행하고, 오디오 데이터가 음악에 대응하는 경우 음악 전처리부(604-3)를 통해서 음악에 대응하는 전처리 방식을 이용하여 오디 오 데이터에 대한 전처리를 수행할 수 있다. 예를 들어, 음성에 대응하는 전처리 방식은 주변 노이즈 제거를 위 한 NS 강화, 명료도 향상을 위한 필터, 잔여 노이즈 제거를 위한 익스펜더 및 클리핑 방지를 위한 컴프레싱을 적용한 AGC 등의 방식을 포함할 수 있다. 또한 음악에 대응하는 전처리 방식은 NS 완화 또는 최소화, 전 대역의 고른 음역 확보를 위한 풀-밴드 필터, 다이나믹 레인지 확보를 위한 AGC 등의 방식을 포함할 수 있다. 도 11은 다양한 실시 예에 따라 전처리부의 구성도를 도시한다. 도 11에 따르면 전처리부는 음성 전처리부(604-2)와 음악 전처리부(604-3)를 포함할 수 있다. 음성 전처리부(604-2)는, 예를 들면, 음성에 대응하는 전처리 방식을 이용하여 오디오 데이터에 대한 전처리를 수행할 수 있다. 예를 들어, 음성 전처리부(604-2)는 반향(echo) 제거를 수행하는 제1 음성 전처리 모듈(604- 2a), 주변 노이즈 제거를 수행하는 제2 음성 전처리 모듈(604-2b), 명확성 향상을 위한 필터링을 수행하는 제3 음성 전처리 모듈(604-2c), 클리핑 방지를 위한 AGC를 수행하는 제4 음성 전처리 모듈(604-2d) 중 적어도 하나 를 포함할 수 있다. 음악 전처리부(604-3)는, 예를 들면, 음악에 대응하는 전처리 방식으로 이용하여 오디오 데이터에 대한 전처리 를 수행할 수 있다. 예를 들어, 음악 전처리부(604-3)는 반향 제거를 수행하는 제1 음악 전처리 모듈(604-3a), 주변 노이즈 제거를 최소한으로 수행하는 제2 음악 전처리 모듈(604-3b), 풀-밴드 필터링을 수행하는 제3 음악 전처리 모듈(604-3c), 다이나믹 레인지 확보를 위한 AGC를 수행하는 제4 음악 전처리 모듈(604-3d) 중 적어도 하나를 포함할 수 있다. 도 12는 다양한 실시 예에 따라 후처리부의 구성도를 도시한다. 도 12에 따르면 후처리부는 음성 후처리부(614-1)와 음악 후처리부(614-2)를 포함할 수 있다. 음성 후처리부(614-1)는, 예를 들면, 음성에 대응하는 후처리 방식을 이용하여 오디오 데이터에 대한 후처리를 수행할 수 있다. 예를 들어, 음성 후처리부(614-1)는 노이즈 저감 또는 제거를 수행하는 제1 음성 후처리 모듈 (614-1a), 주변 노이즈 제거를 수행하는 제2 음성 후처리 모듈(614-1b), 명확성 향상을 위한 필터링을 수행하는 제3 음성 후처리 모듈(614-1c), 클리핑 방지를 위한 AGC를 수행하는 제4 음성 후처리 모듈(614-1d) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면, 음성 후처리 모듈들은 컷오프 방식을 수행하는 모듈, 신호의 다이나믹을 일정하게 조절하는 모듈 등을 더 포함할 수 있다. 음악 후처리부(614-2)는, 예를 들면, 음악에 대응하는 후처리 방식으로 이용하여 오디오 데이터에 대한 후처리 를 수행할 수 있다. 예를 들어, 음악 후처리부(614-2)는 노이즈 저감 또는 제거를 수행하는 제1 음악 후처리 모 듈(614-2a), 주변 노이즈 제거를 최소한으로 수행하는 제2 음악 후처리 모듈(614-2b), 풀-밴드 필터링을 수행하 는 제3 음악 후처리 모듈(614-2c), 다이나믹 레인지 확보를 위한 AGC를 수행하는 제4 음악 후처리 모듈(614-2d) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면, 음악 후처리 모듈들은 컷 오프 다운 방식을 수행 하는 모듈, AGC 어택/릴리스 시간을 조절하는 방식을 수행하는 모듈 등을 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면 전자장치는 스피커; 외부 전자 장치와 통신하기 위한 통신 모듈; 및 상기 통신 모듈과 기능적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 통신 모듈을 이용하여, 상기 외부 전자 장치로부터 데이터를 수신하고; 상기 데이터가 음성에 대응하면, 상기 데이터를 제1 복호화 방식을 이용하 여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제1 신호 처리 방식을 이용하여 변경하고; 상기 데이터가 음악에 대응하면, 상기 데이터를 제2 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제2 신호 처리 방식을 이용하여 변경하고; 및 상기 제1 신호 처리 방식 및 상기 제2 신호 처리 방식 중 대응하 는 신호 처리 방식을 이용하여 변경된 상기 데이터에 대응하는 오디오 신호를 상기 스피커를 통해서 출력하도록 설정될 수 있다. 본 발명의 다양한 실시 예들에 따르면 전자 장치는 마이크; 외부 전자 장치와 통신하기 위한 통신 모듈; 및 상 기 통신 모듈과 기능적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 마이크를 통해 오디오 신호를 수신하고; 상기 오디오 신호에 대응하는 데이터를 생성하고; 상기 데이터에 적어도 기반하여 상기 오디오 신호 의 속성을 판단하고; 상기 오디오 신호가 음성에 대응하면, 제1 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제 1 부호화 방식을 이용하여 부호화하고; 상기 오디오 신호가 음악에 대응하면, 제 2 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제2 부 호화 방식을 이용하여 부호화하고; 및 상기 오디오 신호를 상기 제1 부호화 방식 및 제2 부호화 방식 중 대응하 는 부호화 방식을 이용하여 부호화된 채로 상기 통신 모듈을 통하여 상기 외부 전자 장치로 전송하도록 설정될 수 있다. 도 13은 다양한 실시 예에 따라 송신 장치에서 오디오 데이터를 처리하는 과정을 나타내는 흐름도를 도시한다. 한 실시 예에 따르면, 전자 장치가 송신 장치의 동작을 수행하는 경우, 도 13의 1300 동작에서 전자 장치(예: 프로세서)는 오디오 신호를 수신하여 대응하는 오디오 데이터를 생성하고, 1310 동작에서 오디오 데이터에 적어도 기반하여 오디오 데이터의 속성을 판단할 수 있다. 한 실시 예에 따르면 전자 장치는 수신된 오디오 신호에 대응하는 오디오 데이터를 생성하여 EVS 인코더 (280-3)로 전달할 수 있다. 전자 장치(예: 프로세서)는, 예를 들면, 오디오 데이터에 대한 전처리를 수행하기 전에 오디오 데이 터를 분석하여 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응하는 오디오 데이터인지를 판단할 수 있다. 1320 동작에서 전자 장치(예: 프로세서)는 판단 결과에 따라 오디오 데이터에 대한 전처리를 수행할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 프로세서)는 오디오 데이터가 음성에 대응하는 오디오 데이터로 판단되면 음성에 대응하는 전처리 방식을 이용하여 전처리를 수행하고, 오디오 데이터가 음악에 대응하는 오디 오 데이터로 결정되면 음악에 대응하는 전처리 방식을 이용하여 전처리를 수행할 수 있다. 1330 동작에서 전자 장치(예: 프로세서)는 전처리된 오디오 데이터를 부호화하여 출력할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 프로세서)는 오디오 데이터가 음성에 대응하는 오디오 데이터인 경우 음성에 대응하는 부호화 방식을 이용하여 전처리된 오디오 데이터를 부호화하고, 오디오 데이터가 음악에 대응하는 오디오 데이터인 경우 음악에 대응하는 부호화 방식을 이용하여 전처리된 오디오 데이터를 부호화할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 프로세서)는 오디오 데이터가 음성 또는 음악에 대응하는 오디 오 데이터인지를 나타내는 인식 정보 데이터를 생성하고, 부호화된 오디오 데이터와 인식 정보 데이터를 수신 장치로 전송할 수 있다. 도 14는 다양한 실시 예에 따라 송신 장치에서 오디오 데이터를 처리하는 과정을 나타내는 상세 흐름도를 도시 한다. 한 실시 예에 따르면, 전자 장치가 송신 장치의 동작을 수행하는 경우, 도 14의 1400 동작에서 전자 장치(예: 프로세서)는 오디오 데이터를 수신하여 수신된 오디오 데이터에 대응하는 오디오 신호를 생 성하고, 1410 동작에서 오디오 데이터에 적어도 기반하여 음성 또는 음악에 대응하는지 판단할 수 있다. 1420 동작에서 전자 장치(예: 프로세서)는 판단 결과, 오디오 데이터가 음성에 대응하는 오디오 데이 터이면 1430 동작으로 진행하고, 오디오 데이터가 음악에 대응하는 오디오 데이터이면 1450 동작으로 진행할 수 있다. 1430 동작에서 전자 장치(예: 프로세서)는 음성에 대응하는 전처리 방식을 이용하여 오디오 데이터의 음성 품질을 변경할 수 있다. 1440 동작에서 전자 장치(예: 프로세서)는 음성에 대응하는 제1 부호화 방식을 이용하여 변경된 오디 오 데이터에 대한 부호화를 수행할 수 있다. 1450 동작에서 전자 장치(예: 프로세서)는 음악에 대응하는 전처리 방식을 이용하여 오디오 데이터의 음성 품질을 변경할 수 있다. 1460 동작에서 전자 장치(예: 프로세서)는 음악에 대응하는 제2 부호화 방식을 이용하여 변경된 오디 오 데이터에 대한 부호화를 수행할 수 있다. 1470 동작에서 전자 장치(예: 프로세서)는 부호화된 오디오 데이터를 수신 장치로 전송할 수 있 다. 도 15는 다양한 실시 예에 따라 수신 장치에서 오디오 데이터를 처리하는 과정을 나타내는 흐름도를 도시한다. 한 실시 예에 따르면, 전자 장치가 수신 장치의 동작을 수행하는 경우, 1500 동작에서 전자 장치 (예: 프로세서)는 오디오 데이터를 수신하고, 1510 동작에서 오디오 데이터의 적어도 일부 속성에 기 반하여 음성 또는 음악에 대응하는지 판단할 수 있다. 한 실시 예에 따르면, 송신 장치로부터 인식 정보 데이터가 수신된 경우 전자 장치(예: 프로세서 )는 수신된 인식 정보 데이터를 확인하여 오디오 데이터가 음성에 대응하는지 또는 음악에 대응하는지 판 단할 수 있다. 한 실시 예에 따르면, 송신 장치로부터 인식 정보 데이터가 수신되지 않은 경우 전자 장치(예: 프로 세서)는 오디오 데이터를 분석하여 오디오 데이터가 음성에 대응하는 오디오 데이터인지 또는 음악에 대응 하는 오디오 데이터인지를 판단할 수 있다. 1520 동작에서 전자 장치(예: 프로세서)는 판단 결과에 따라 오디오 데이터에 대한 복호화를 수행할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 프로세서)는 오디오 데이터가 음성에 대응하는 오디오 데이터인 경우 음성에 대응하는 제1 복호화 방식을 이용하여 오디오 데이터에 대한 복호화를 수행하고, 오디오 데이터가 음악에 대응하는 오디오 데이터인 경우 음악에 대응하는 제2 복호화 방식을 이용하여 오디오 데이터에 대한 복 호화를 수행할 수 있다. 1530 동작에서 전자 장치(예: 프로세서)는 복호화된 오디오 데이터를 후처리하여 출력할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 프로세서)는 오디오 데이터가 음성에 대응하는 오디오 데이터인 경우 음성에 대응하는 후처리 방식을 이용하여 오디오 데이터에 대한 후처리를 수행하고, 오디오 데이터가 음악 에 대응하는 오디오 데이터인 경우 음악에 대응하는 후처리 방식을 이용하여 오디오 데이터에 대한 후처리를 수행할 수 있다. 도 16은 다양한 실시 예에 따라 수신 장치에서 오디오 데이터를 처리하는 과정을 나타내는 상세 흐름도를 도시 한다. 한 실시 예에 따르면, 전자 장치가 수신 장치의 동작을 수행하는 경우, 도 16의 1600 동작에서 전자 장치(예: 프로세서)는 부호화된 오디오 데이터를 수신하고, 1610 동작에서 수신된 오디오 데이터의 적어도 일부 속성을 기반하여 음성 또는 음악에 대응하는지 판단할 수 있다. 1620 동작에서 전자 장치(예: 프로세서)는 판단 결과, 오디오 데이터가 음성에 대응하는 오디오 데이 터이면 1630 동작으로 진행하고, 오디오 데이터가 음악에 대응하는 오디오 데이터이면 1650 동작으로 진행할 수 있다. 1630 동작에서 전자 장치(예: 프로세서)는 음성에 대응하는 제1 복호화 방식을 이용하여 오디오 데이 터에 대한 복호화를 수행할 수 있다. 1640 동작에서 전자 장치(예: 프로세서)는 복호화된 오디오 데이터를 음성에 대응하는 후처리 방식을 이용하여 오디오 데이터의 음성 품질을 변경할 수 있다. 1650 동작에서 전자 장치(예: 프로세서)는 음악에 대응하는 제2 복호화 방식을 이용하여 오디오 데이 터에 대한 복호화를 수행할 수 있다. 1660 동작에서 전자 장치(예: 프로세서)는 복호화된 오디오 데이터를 음악에 대응하는 후처리 방식을 이용하여 오디오 데이터의 음성 품질을 변경할 수 있다. 1670 동작에서 전자 장치(예: 프로세서)는 변경된 오디오 데이터에 대응하는 오디오 신호를 출력할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 프로세서)는 음성에 대응하는 신호 처리 방식 및 음악에 대응하 는 신호 처리 방식 중 대응하는 신호 처리 방식을 이용하여 변경된 오디오 데이터에 대응하는 오디오 신호로 변 환하여 출력할 수 있다. 본 발명의 다양한 실시 예들에 따르면 전자 장치에서 수행되는 방법은, 외부 전자 장치로부터 데이터를 수신하 는 동작; 상기 데이터가 음성에 대응하면, 상기 데이터를 제1 복호화 방식을 이용하여 복호화하고, 상기 복호화 된 데이터의 음성 품질을 제1 신호 처리 방법을 이용하여 변경하는 동작; 상기 데이터가 음악에 대응하면, 상기 데이터를 제2 복호화 방식을 이용하여 복호화하고, 상기 복호화된 데이터의 음성 품질을 제2 신호 처리 방법을 이용하여 변경하는 동작; 및 상기 제1 신호 처리 방법 및 상기 제2 신호 처리 방법 중 대응하는 신호 처리 방법 을 이용하여 변경된 상기 데이터에 대응하는 오디오 신호를 출력 장치를 통하여 출력하는 동작을 포함할 수 있 다. 본 발명의 다양한 실시 예들에 따르면 전자 장치에 수행되는 방법은, 입력 장치로부터 오디오 신호를 수신하는 동작; 상기 오디오 신호에 대응하는 데이터를 생성하는 동작; 상기 데이터에 적어도 기반하여 상기 오디오 신호 의 속성을 판단하는 동작; 상기 오디오 신호가 음성에 대응하면, 상기 제1 신호 처리 방법을 이용하여 상기 데 이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제1 부호화 방식을 이용하여 부호화하는 동작; 상기 오디 오 신호가 음악에 대응하면, 상기 제2 신호 처리 방법을 이용하여 상기 데이터의 음성 품질을 변경하고, 상기 변경된 데이터를 제2 부호화 방식을 이용하여 부호화하는 동작; 및 상기 오디오 신호를 상기 제1 부호화 방식 및 상기 제2 부호화 방식 중 대응하는 부호화 방식을 이용하여 부호화된 채로 통신 모듈을 통하여 상기 외부 전 자 장치로 전송하는 동작을 포함할 수 있다. 이와 같이 본 발명의 다양한 실시 예에서는 오디오 신호가 음성 또는 음악인지를 분석하여 음성 또는 음악에 따 라 적절한 처리를 수행함으로써 오디오 신호의 명료도를 향상시키고, 오디오 신호의 전 대역에 대한 고른 재생 이 가능하다."}
{"patent_id": "10-2015-0113427", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예에 따른, 전자 장치를 포함하는 네트워크 환경을 도시한다. 도 2는 다양한 실시 예에 따른 전자 장치의 블록도를 도시한다. 도 3은 다양한 실시 예에 따른 프로그램 모듈의 블록도를 도시한다. 도 4는 다양한 실시 예에 따라 송신 장치에서 오디오 신호를 처리하는 오디오 모듈의 구성도를 도시한다. 도 5는 다양한 실시 예에 따라 수신 장치에서 오디오 신호를 처리하는 오디오 모듈의 구성도를 도시한다. 도 6은 다양한 실시 예에 따라 오디오 신호를 송신하는 송신 장치와 오디오 신호를 수신하는 수신 장치에 대한 구성도를 도시한다. 도 7은 다양한 실시 예에 따라 송신 장치에 포함된 EVS 인코더에 대한 구성도를 도시한다. 도 8은 다양한 실시 예에 따라 수신 장치에 포함된 EVS 디코더 및 후처리부에 대한 구성도를 도시한다. 도 9는 다양한 실시 예에 따라 전처리부 및 EVS 디코더를 포함하는 송신 장치에 대한 구성도를 도시한다. 도 10은 다양한 실시 예에 따라 오디오 분석부가 EVS 인코더와 별도로 구성된 송신 장치에 대한 구성도를 도시 한다. 도 11은 다양한 실시 예에 따라 전처리부의 구성도를 도시한다. 도 12는 다양한 실시 예에 따라 후처리부의 구성도를 도시한다. 도 13은 다양한 실시 예에 따라 송신 장치에서 오디오 데이터를 처리하는 과정을 나타내는 흐름도를 도시한다. 도 14는 다양한 실시 예에 따라 송신 장치에서 오디오 데이터를 처리하는 과정을 나타내는 상세 흐름도를 도시 한다. 도 15는 다양한 실시 예에 따라 수신 장치에서 오디오 데이터를 처리하는 과정을 나타내는 흐름도를 도시한다.도 16은 다양한 실시 예에 따라 수신 장치에서 오디오 데이터를 처리하는 과정을 나타내는 상세 흐름도를 도시 한다."}
