{"patent_id": "10-2022-0002807", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0106985", "출원번호": "10-2022-0002807", "발명의 명칭": "불법 통신장비 탐지 장치 및 방법", "출원인": "주식회사 케이티", "발명자": "강명진"}}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "불법 통신장비 탐지 장치에 있어서,불법호 신고 전화번호를 수집하는 수집부;상기 신고 전화번호에 대한 테스트 호 패킷을 발생시키는 테스트 호 발생부; 및인터넷에서 수집되는 패킷 중 상기 테스트 호 패킷에 대응하는 패킷에서 IP 주소를 추출하고, 추출된 IP 주소에대응하는 패킷들의 특성이 임계 조건을 만족할 경우 해당 추출된 IP 주소를 불법 통신장비의 IP 주소로 판단하는 검출부를 포함하는 불법 통신장비 탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 테스트 호 발생부는,상기 테스트 호 패킷에 테스트 호임을 식별할 수 있는 식별정보를 설정하는 것을 특징으로 하는 불법 통신장비탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 테스트 호 발생부는,상기 식별정보로서 SIP(Session Initiation Protocol) 헤더(Header)의 사용 가능한 정보를 특정 패턴 및 특정값으로 설정하는 것을 특징으로 하는 불법 통신장비 탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 테스트 호 발생부는,상기 식별정보로서 SDP(Session Description Protocol) 속성(Attribute)의 사용 가능한 정보를 특정 패턴 및특정 값으로 설정하는 것을 특징으로 하는 불법 통신장비 탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 테스트 호 발생부는,상기 식별정보로서 SIP(Session Initiation Protocol) 헤더(Header)의 사용 가능한 정보와 SDP(SessionDescription Protocol) 속성(Attribute)의 사용 가능한 정보를 조합하여 설정하는 것을 특징으로 하는 불법 통신장비 탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 검출부는,인터넷에서 수집되는 패킷 중 상기 식별정보에 매칭되고 국내에서 해외로 전송되는 패킷에서 소스 IP 주소 및목적지 IP 주소를 추출하고, 각 IP 주소별로 수집되는 패킷들의 특성이 임계 조건을 만족할 경우, 상기 소스 IP주소는 국내측 불법 통신장비의 IP 주소로, 상기 목적지 IP 주소는 해외측 불법 통신장비의 IP 주소로 판단하는공개특허 10-2023-0106985-3-것을 특징으로 하는 불법 통신장비 탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 검출부는,상기 목적지 IP 주소의 위치가 미리 설정된 위험 지역의 IP 주소인 경우, 상기 임계 조건에 가중치를 적용하는것을 특징으로 하는 불법 통신장비 탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 신고 전화번호가 테스트 대상 전화번호인지 여부를 판단하는 판단부를 더 포함하는 것을 특징으로 하는 불법 통신장비 탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 판단부는,상기 신고 전화번호가 블랙리스트에 등록되어 있고 상기 신고 전화번호에 대응하는 단말 유형이 자급 단말인 경우 테스트 대상 전화번호로 결정하는 것을 특징으로 하는 불법 통신장비 탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,불법 통신장비의 IP 주소에 대한 패킷을 차단하고 그 IP 주소에 대응하는 신고 전화번호의 통신가입을 이용 정지키시는 차단부를 더 포함하는 것을 특징으로 하는 불법 통신장비 탐지 장치."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "불법 통신장비를 탐지하는 방법에 있어서,불법호 신고 전화번호를 수집하는 단계;상기 신고 전화번호에 대한 테스트 호 패킷을 발생시키는 단계; 및인터넷에서 수집되는 패킷 중 상기 테스트 호 패킷에 대응하는 패킷에서 IP 주소를 추출하고, 추출된 IP 주소에대응하는 패킷들의 특성이 임계 조건을 만족할 경우 해당 추출된 IP 주소를 불법 통신장비의 IP 주소로 판단하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 발생시키는 단계는,상기 테스트 호 패킷에 테스트 호임을 식별할 수 있는 식별정보를 설정하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 발생시키는 단계는,상기 식별정보로서 SIP(Session Initiation Protocol) 헤더(Header)의 사용 가능한 정보를 특정 패턴 및 특정값으로 설정하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2023-0106985-4-제12항에 있어서,상기 발생시키는 단계는,상기 식별정보로서 SDP(Session Description Protocol) 속성(Attribute)의 사용 가능한 정보를 특정 패턴 및특정 값으로 설정하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 발생시는 단계는,상기 식별정보로서 SIP(Session Initiation Protocol) 헤더(Header)의 사용 가능한 정보와 SDP(SessionDescription Protocol) 속성(Attribute)의 사용 가능한 정보를 조합하여 설정하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 판단하는 단계는,인터넷에서 수집되는 패킷 중 상기 식별정보에 매칭되고 국내에서 해외로 전송되는 패킷에서 소스 IP 주소 및목적지 IP 주소를 추출하는 단계; 및각 IP 주소별로 수집되는 패킷들의 특성이 임계 조건을 만족할 경우, 상기 소스 IP 주소는 국내측 불법 통신장비의 IP 주소로, 상기 목적지 IP 주소는 해외측 불법 통신장비의 IP 주소로 판단하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 목적지 IP 주소의 위치가 미리 설정된 위험 지역의 IP 주소인 경우, 상기 임계 조건에 가중치를 적용하는것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 신고 전화번호가 테스트 대상 전화번호인지 여부를 판단하는 단계를 더 포함하는 것을 특징으로 하는방법."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 테스트 대상 전화번호인지 여부를 판단하는 단계는상기 신고 전화번호가 블랙리스트에 등록되어 있고 상기 신고 전화번호에 대응하는 단말 유형이 자급 단말인 경우 테스트 대상 전화번호로 결정하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0002807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항 내지 제19항 중 어느 한 항에 있어서,불법 통신장비의 IP 주소에 대한 패킷을 차단하고 그 IP 주소에 대응하는 신고 전화번호의 통신가입을 이용 정지키시는 단계를 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "국내 백본망 또는 국제 연동 구간에서 VoIP 패킷을 수집 및 분석하여 발신번호 변작에 사용되는 국내외 불법 통 신장비를 탐지하기 위한 불법 통신장비 탐지 장치 및 방법이 개시된다. 일 측면에 따른 불법 통신장비 탐지 장치 는, 불법호 신고 전화번호를 수집하는 수집부; 상기 신고 전화번호에 대한 테스트 호 패킷을 발생시키는 테스트 호 발생부; 및 인터넷에서 수집되는 패킷 중 상기 테스트 호 패킷에 대응하는 패킷에서 IP 주소를 추출하고, 추 출된 IP 주소에 대응하는 패킷들의 특성이 임계 조건을 만족할 경우 해당 추출된 IP 주소를 불법 통신장비의 IP 주소로 판단하는 검출부를 포함한다."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 불법 통신장비 탐지 장치 및 방법에 관한 것으로, 보다 구체적으로 발신번호 변작하여 호를 발신하 는 불법 통신장비를 탐지하기 위한 불법 통신장비 탐지 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, VoIP(Voice over IP) 서비스는 인터넷 프로토콜을 이용한 서비스로서, 공중교환전화망(PSTN)과 같 은 서킷(Circuit) 망에서 제공하던 음성 통신 서비스를 패킷(packet)망에서 제공할 수 있도록 하는 서비스이다. 이러한 VoIP 기술이 보급되면서 다양한 불법 호가 발생하고 있다. 대표적인 VoIP 기술을 이용한 불법 호는 불법 우회 과금(Toll Bypass Fraud)과 보이스피싱이다. 불법 우회 과금은 VoIP 통신 장비를 경유해 장거리 통화를 발 생시키고 과금을 회피하여 과금 손실을 발생시키는 불법 호이다. 보이스피싱은 은행 또는 금융 기관으로 사칭하 여 금전적 요구를 하는 불법 호이다. 이 중 보이스피싱의 피해는 매년 증가하고 있다. 단순히 해외에서 국내로 VoIP 호를 발신하는 방법에서, 해외에 서 국내로 발신한 VoIP 호의 발신번호를 국내에서 국내 이동통신 번호로 변작하여 전화를 받도록 유도하는 방법 으로 진화하고 있다. 즉, 해외에서 VoIP 단말로 VoIP 호 처리 장치로 호를 발신하면, VoIP 호 처리 장치는 국내 에 설치된 불법 통신장비로 세션 개시 프로토콜인 SIP(Session Initiation Protocol) 신호를 전송하고, 불법 통 신장비는 착신 단말로 전송하는 발신 호의 발신번호를 국내 이동통신 번호로 변작함으로써, 착신자 측에서 국내 발신 호 같이 보이게끔 만든다. 이러한 불법 통신장비는, 국내에서 이동통신 개통이 완료되어 국내 이동통신 번호를 부여받은 상태로, 최대 수 십 개의 USIM이 삽입되어, 동시에 많은 사용자들에게 보이스피싱 불법 호를 발신한다. 보이스피싱 조직은 해외 에 콜센터를 두고 불법 통신장비를 국내 여러 지역에 설치하여 범행을 벌이고 있기 때문에, 조직원들을 검거하 기가 쉽지 않다. 따라서, 불법 통신장비를 찾아내 통신을 차단하는 것이 중요하다."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 국내 백본망 또는 국제 연동 구간에서 VoIP 패킷을 수집 및 분석하여 발신번호 변작에 사용되는 국 내외 불법 통신장비를 탐지하기 위한 불법 통신장비 탐지 장치 및 방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측면에 따른 불법 통신장비 탐지 장치는, 불법호 신고 전화번호를 수집하는 수집부; 상기 신고 전화번호에 대한 테스트 호 패킷을 발생시키는 테스트 호 발생부; 및 인터넷에서 수집되는 패킷 중 상기 테스트 호 패킷에 대응하는 패킷에서 IP 주소를 추출하고, 추출된 IP 주소에 대응하는 패킷들의 특성이 임계 조건을 만족할 경우 해당 추출된 IP 주소를 불법 통신장비의 IP 주소로 판단하는 검출부를 포함한다. 상기 테스트 호 발생부는, 상기 테스트 호 패킷에 테스트 호임을 식별할 수 있는 식별정보를 설정할 수 있다. 상기 테스트 호 발생부는, 상기 식별정보로서, SIP(Session Initiation Protocol) 헤더(Header)의 사용 가능한 정보를 특정 패턴 및 특정 값으로 설정하거나, SDP(Session Description Protocol) 속성(Attribute)의 사용 가 능한 정보를 특정 패턴 및 특정 값으로 설정하거나, 또는 SIP 헤더의 사용 가능한 정보와 SDP 속성의 사용 가능 한 정보를 조합하여 설정할 수 있다. 상기 검출부는, 인터넷에서 수집되는 패킷 중 상기 식별정보에 매칭되고 국내에서 해외로 전송되는 패킷에서 소 스 IP 주소 및 목적지 IP 주소를 추출하고, 각 IP 주소별로 수집되는 패킷들의 특성이 임계 조건을 만족할 경우, 상기 소스 IP 주소는 국내측 불법 통신장비의 IP 주소로, 상기 목적지 IP 주소는 해외측 불법 통신장비의 IP 주소로 판단할 수 있다. 상기 검출부는, 상기 목적지 IP 주소의 위치가 미리 설정된 위험 지역의 IP 주소인 경우, 상기 임계 조건에 가 중치를 적용할 수 있다. 상기 불법 통신장비 탐지 장치는, 상기 신고 전화번호가 테스트 대상 전화번호인지 여부를 판단하는 판단부를 더 포함할 수 있다. 상기 판단부는, 상기 신고 전화번호가 블랙리스트에 등록되어 있고 상기 신고 전화번호에 대응하는 단말 유형이 자급 단말인 경우 테스트 대상 전화번호로 결정할 수 있다. 상기 불법 통신장비 탐지 장치는, 불법 통신장비의 IP 주소에 대한 패킷을 차단하고 그 IP 주소에 대응하는 신 고 전화번호의 통신가입을 이용 정지키시는 차단부를 더 포함할 수 있다. 다른 측면에 따른 불법 통신장비를 탐지하는 방법은, 불법호 신고 전화번호를 수집하는 단계; 상기 신고 전화번 호에 대한 테스트 호 패킷을 발생시키는 단계; 및 인터넷에서 수집되는 패킷 중 상기 테스트 호 패킷에 대응하 는 패킷에서 IP 주소를 추출하고, 추출된 IP 주소에 대응하는 패킷들의 특성이 임계 조건을 만족할 경우 해당 추출된 IP 주소를 불법 통신장비의 IP 주소로 판단하는 단계를 포함한다. 상기 발생시키는 단계는, 상기 테스트 호 패킷에 테스트 호임을 식별할 수 있는 식별정보를 설정할 수 있다. 상기 발생시키는 단계는, 상기 식별정보로서, SIP(Session Initiation Protocol) 헤더(Header)의 사용 가능한 정보를 특정 패턴 및 특정 값으로 설정하거나, SDP(Session Description Protocol) 속성(Attribute)의 사용 가 능한 정보를 특정 패턴 및 특정 값으로 설정하거나, 또는 SIP 헤더의 사용 가능한 정보와 SDP 속성의 사용 가능 한 정보를 조합하여 설정할 수 있다. 상기 판단하는 단계는, 인터넷에서 수집되는 패킷 중 상기 식별정보에 매칭되고 국내에서 해외로 전송되는 패킷 에서 소스 IP 주소 및 목적지 IP 주소를 추출하는 단계; 및 각 IP 주소별로 수집되는 패킷들의 특성이 임계 조 건을 만족할 경우, 상기 소스 IP 주소는 국내측 불법 통신장비의 IP 주소로, 상기 목적지 IP 주소는 해외측 불 법 통신장비의 IP 주소로 판단하는 단계를 포함할 수 있다. 상기 목적지 IP 주소의 위치가 미리 설정된 위험 지역의 IP 주소인 경우, 상기 임계 조건에 가중치를 적용할 수 있다. 상기 방법은, 상기 신고 전화번호가 테스트 대상 전화번호인지 여부를 판단하는 단계를 더 포함할 수 있다. 상기 테스트 대상 전화번호인지 여부를 판단하는 단계는 상기 신고 전화번호가 블랙리스트에 등록되어 있고 상 기 신고 전화번호에 대응하는 단말 유형이 자급 단말인 경우 테스트 대상 전화번호로 결정할 수 있다. 상기 방법은, 불법 통신장비의 IP 주소에 대한 패킷을 차단하고 그 IP 주소에 대응하는 신고 전화번호의 통신가 입을 이용 정지키시는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은, 테스트 호 패킷을 이용하여 국내외 불법 통신장비의 IP 주소를 정확하게 탐지함으로써, 국내외 불법 통신장비를 통한 범죄 행위를 신속하게 차단할 수 있다. 또한, 본 발명은 국내 불법 통신장비의 명의자가 개통한 다른 전화번호들도 이용을 정지시킴으로써 보이스피싱 범죄를 미연에 방지할 수 있다."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용되는 것으로 서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시예를 설명함 에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시예의 요지를 흐릴 수 있다고 판단 되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시예를 쉽게 이해할 수 있도 록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사 상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다.단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또 는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명을 구현함에 있어서 설명의 편의를 위하여 구성요소를 세분화하여 설명할 수 있으나, 이들 구성요소가 하나의 장치 또는 모듈 내에 구현될 수도 있고, 혹은 하나의 구성요소가 다수의 장치 또는 모듈들에 나뉘어져서 구현될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 불법 통신장비 및 탐지 장치를 포함하는 통신 시스템을 나타낸 도면이다. 도 1을 참조하면, 보이스피싱 조직은 국내와 해외에 각각 불법 통신장비를 설치하고 해외에서 VoIP를 통해 국내 로 호를 발생시킨다. 해외의 보이스피싱 발신 단말이 해외측 불법 통신장치인 호 처리 서버를 통해 발신 호를 발생시키면, 해당 발신 호는 인터넷을 경유하여 국내에 설치된 불법 통신장비로 유입되고, 국내측 불법 통신장비는 발신 호의 발신번호를 국내 이동통신 번호로 변작한 후 국내 이동통신망을 통해 피해자들의 단말, 즉 착신 단말로 전송한다. 따라서, 피해자들은 해외에서 발신된 호로 인지하지 못 하고 국내에서 발신된 정상 호로 인식하게 된다. 본 발명에 따른 탐지 장치는, 보이스피싱으로 의심되는 전화번호로 테스트 패킷을 발생시키고 인터넷을 통해 송수신되는 테스트 패킷을 수집 및 분석하여 이러한 보이스피싱에 이용되는 국내외 불법 통신장비(120, 140)를 탐지한다. 해외에는 보이스피싱 불법 호를 발신하는 범죄 조직이 설치한 발신 단말과 호 처리 서버가 위치한다. 발신 단말은, 스마트폰이나 태블릿 PC, 또는 랩탑 컴퓨터 등의 VoIP 서비스를 이용할 수 있는 단말이다. 발신 단말은 사용자의 조작에 따라 발신 호를 호 처리 서버로 전송한다. 본 실시예에서 발신 단말 은 불법 호를 발신하는 범죄자가 이용하는 통화 단말이다. 호 처리 서버는, 해외측 불법 통신장비로서, VoIP(Voice over IP) 서비스를 제공한다. 호 처리 서버 는, 예를 들어, SIP(Session Initiation Protocol) 서버, PBX 서버이다. SIP는 IETF에서 정의한 음성과 화상 통화 같은 멀티미디어 세션을 제어하기 위한 시그널링 프로토콜이다. 호 처리 서버는, 발신 단말로부 터 발신 호로서 SIP INVITE 패킷을 수신할 수 있다. 호 처리 서버는, 발신 단말로부터 발신 호가 수신되면, 발신 호를 인터넷을 통해 국내에 설치된 불법 통신장비로 전송한다. 인터넷은, 국제 연동 구간, 국내 백본망 및 국내 유무선망을 포함할 수 있다. 호 처리 서버는, 발신 호의 목적지 IP 주소 및 포트 정보로서, 불법 통신장비의 IP 주소 및 포 트 정보를 설정하고, 또한 발신 호에 발신번호와 착신번호를 설정한다. 여기서 착신번호는 국내에 위치한 피해 자들의 전화번호이다. 또한 호 처리 서버는, 발신 호에 호 처리 서버의 고유 특성 정보(예, User agent)를 설정할 수 있다. 발신 단말, 호 처리 서버, 불법 통신장비 간에는 상호 식별이 가능한 내선번호(예, 2222, 2442 등)를 사용할 수 있다. 불법 통신장비는, 불법 호를 발신하는 범죄 조직이 국내에 설치한 장비로서, 인터넷에 연결되고, 또 한 국내에 개통된 복수의 가입자 식별 모듈, 즉 USIM을 실장하여, 국내 이동통신망을 통해 호를 발신한다. 즉, 불법 통신장비는, USIM의 개수만큼 국내 이동통신 번호를 보유하여, 각 이동통신 번호로 호를 발신할 수 있다. 구체적으로, 불법 통신장비는, 상기 호 처리 서버로부터 인터넷을 통해 발신 호가 수 신되면, 발신 호를 국내 이동통신 번호로 변작한 후 국내 이동통신망을 통해 피해자들의 단말, 즉 착신 단 말로 전송한다. 불법 통신장비는, 복수의 국내 이동통신 번호를 보유하는데, 각 국내 이동통신 번호별로 ID를 매칭하여 저 장 및 관리할 수 있다. 예를 들어, 010-1111-1111은 ID 1, 010-1111-1112는 ID 2와 같은 방식으로 저장 및 관 리한다. 범죄 조직은, 해외에서 발신 단말로 불법 호를 발신할 때, 발신번호로서 전화번호 형식이 아닌, 불법 통신장비에서 국내 이동통신 번호별로 매칭되어 관리되는 ID를 설정할 수 있다. 즉, 발신 단말 로부터 호 처리 서버로, 그리고 호 처리 서버에서 불법 통신장비로 전송되는 발신 호에는, 발신 번호로서 전화번호 형식이 아닌 숫자, 문자, 특수문자 등으로 구성된 ID가 포함될 수 있다. 불법 통신장비는, 복수의 국내 이동통신 번호를 보유하고, 따라서 동시에 복수의 발신 호를 서로 다른 국 내 이동통신 번호로 처리할 수 있다. 따라서, 범죄 조직은 여러 명의 조직원이 동시에 하나의 불법 통신장비 을 통해 여러 피해자들의 착신 단말들로 불법 호를 발생시킨다. 즉, 소정 시간 이내에 출발지 IP 주 소와 목적지 IP 주소가 동일하고 착신번호가 상이한 복수의 발신 호, 예를 들어, SIP INVITE 패킷이 소정 개수이상 다량 발생하는 것이 일반적이다. 한편, 불법 통신장비는, 발신 호에 대한 응답 패킷을 인터넷을 통해 호 처리 서버로 전송한다. 여기서 응답 패킷은, 예를 들어, SIP Response 패킷으로서, SIP 100 Trying, 180 Ringing, 183 Session Progress, 200 OK 등이다. SIP 표준 규격에 따르면, SIP INVITE 패킷에 후속하는 패킷들은, SIP INVITE 패킷과 동일한 발신번호, 착신번호, 출발지 IP 주소/포트 정보, 목적지 IP 주소/포트 정보를 포함한다. 즉, 응답 패킷 에, 전화번호 형식이 아닌 숫자, 문자, 특수문자 등으로 구성된 ID가 발신번호로서 포함된다. 그리고 발신 호와 마찬가지로, 소정 시간 이내에 출발지 IP 주소와 목적지 IP 주소가 동일하고 착신번호가 상이한 복수의 응답 패 킷이 소정 개수 이상 다량 발생하게 된다. 불법 통신장비 탐지 장치(이하에서, 탐지 장치라 함)는, 국내측 불법 통신장비와 해외측 불법 통신장 비를 탐지한다. 구체적으로, 탐지 장치는, 경찰청 등으로부터 신고 전화번호를 수집하여 블랙리스트 와 비교하고, 신고 전화번호가 블랙리스트에 등록되지 않은 신규 전화번호인 경우, 테스트 호를 생성하여 해당 신고 전화번호로 해당 테스트 호를 발신한다. 이때, 탐지 장치는, 테스트 호에 테스트 호임을 식별할 수 있는 식별정보를 설정한다. 탐지 장치는, 인터넷에 설치된 트래픽 수집기를 통해 VoIP 패킷을 수집하 고 그 수집된 VoIP 패킷 중 상기 식별정보가 일치하는 VoIP 패킷을 필터링하며, 필터링된 VoIP 패킷에서 IP 주 소가 일정한 조건을 만족할 경우 불법 통신장비(120, 140)의 IP 주소로 판단할 수 있다. 탐지 장치에 관해 서는 이하에서 도 2를 참조하여 구체적으로 설명한다. 도 2는 본 발명의 일 실시예에 따른 탐지 장치의 구성을 나타낸 도면이다. 도 2를 참조하면, 탐지 장치은, 신고 정보 수집부, 판단부, 테스트 호 발생부, 검출부 및 차단부를 포함한다. 탐지 장치은, 메모리, 하나 이상의 프로세서(CPU), 주변 인터페이스, 입출력(I/O) 서브시스템, 디스플레이 장치, 입력 장치 및 통신 회로를 포함할 수 있다. 메모리는 고속 랜덤 액세스 메모리를 포함할 수 있고, 또한 하나 이상의 자기 디스크 저장 장치, 플래시 메모리 장치와 같은 불휘발성 메모리, 또는 다른 불휘발성 반도체 메모리 장치를 포함할 수 있다. 메모리는 각종 정보 와 프로그램 명령어를 저장할 수 있고, 프로그램은 프로세서에 의해 실행된다. 주변 인터페이스는 입출력 주변 장치를 프로세서 및 메모리와 연결한다. 하나 이상의 프로세서는 다양한 소프트 웨어 프로그램 및/또는 메모리에 저장되어 있는 명령어 세트를 실행하여 시스템을 위한 여러 기능을 수행하고 데이터를 처리한다. I/O 서브시스템은 디스플레이 장치, 입력 장치와 같은 입출력 주변장치와 주변 인터페이스 사이에 인터페이스를 제공한다. 통신 회로는 외부 포트를 통한 통신 또는 RF 신호에 의한 통신을 수행한다. 통신 회로는 전기 신호를 RF 신호로 또는 그 반대로 변환하며 이 RF 신호를 통하여 통신 네트워크, 다른 이동형 게이트웨이 장치 및 통신 장치와 통신할 수 있다. 신고 정보 수집부, 판단부, 테스트 호 발생부, 검출부 및 차단부는, 프로그램으로 구 현되어 메모리에 저장되고 적어도 하나의 프로세서에 의해 실행될 수 있고, 하드웨어와 소프트웨어의 조합으로 구현되어 동작할 수 있다. 신고 정보 수집부는, 경찰청, 금감원 등으로부터 보이스피싱 등의 불법호 신고 전화번호를 수집한다. 판단부는, 상기 수집된 신고 전화번호가 테스트 대상 전화번호인지 여부를 판단한다. 구체적으로, 판단부 는, 상기 수집된 신고 전화번호가 블랙리스트에 등록되어 있는지 여부, 블랙리스트에 등록되어 있다면 유 효한지 등을 확인한다. 블랙리스트는 보이스피싱에 사용된 전화번호를 기록한 것으로, 검출일, 차단적용, 차단 해제 상태 등의 정보도 포함한다. 따라서, 블랙리스트에 등록되어 있다고 하여 모두 차단 대상인 것은 아니며 차단 해제된 전화번호도 블랙리스트에 등록될 수 있으므로, 판단부는, 신고 전화번호가 블랙리스트에 등록 되어 있지 않은 신규 전화번호이거나, 블랙리스트에 등록되어 있지만 차단 해제되어 유효한 전화번호인 경우, 테스트 대상 전화번호로 결정할 수 있다. 일 실시예에서, 판단부는, 신고 전화번호에 대한 단말 정보를 확인하고, 신고 전화번호에 대응하는 단말 유형이 자급 단말(OMD: Open Market Device)인 경우에만 최종 테스트 대상 전화번호 결정할 수 있다. 신고 전화 번호가 블랙리스트에 등록되어 있지 않은 신규 전화번호라 하더라도 단말 유형이 사급 단말인 경우 통신사 대리 점을 통해 개통한 단말이므로 다른 용도로 사용되더라도 본 실시예에서 설명하는 불법 통신장비로 사용될 가능성이 낮기 때문이다. 블랙리스트 및 단말 정보는 별도의 저장장치에 저장되어 이용될 수 있다.테스트 호 발생부는, 상기 판단부에서 테스트 대상 전화번호로 결정된 신고 전화번호로 테스트 호를 발생시킨다. 즉 신고 전화번호를 착신 전화번호로 설정하여 테스트 호 패킷을 인터넷을 경유하여 발신한다. 이때, 테스트 호 발생부는, 테스트 호에 테스트 호임을 식별할 수 있는 식별정보를 설정한다. 식별정보는 SIP 헤더(Header)의 사용 가능한 정보(User Agent, Call-ID 등)와 SDP(Session Description Protocol) 속성(Attribute)의 사용 가능한 정보(Owner Username, Session Name emd)를 조합한 다중 정보일 수 있다. VoIP 패킷의 정보(Source IP 주소, SIP Header 정보 등)는 SBC(Session Border Controller)나 SIP Gateway 등 을 통과하면서 변경될 수 있다. 테스트 호에 단일 형태로 식별정보를 설정할 경우 식별정보가 SBC나 SIP Gatewar 등에서 변경되어 추후 식별이 불가능할 수 있는 반면, 상기와 같이 다중 형태로 식별정보를 설정할 경 우, 식별정보가 SBC나 SIP Gatewar 등에서 변경되더라도 일부 정보만 변경되어, 추후 식별이 가능하게 되므로, 위와 같이 다중 형태로 식별정보를 설정하는 것이 바람직하다. 아래는 식별정보로서 SIP Header 정보 중 Call-ID와 User Agent를 특정 패턴 및 특정 값으로 정의한 예이다. 이 예는 하나의 예로서 다른 패턴 및 값 등이 정의될 수 있음을 분명히 한다."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "아래는 식별정보로서 SDP Attribute 정보 중 Owner Username과 Session Name을 특정 값으로 정의한 예이다. 이 예는 하나의 예로서 다른 패턴 및 값 등이 정의될 수 있음을 분명히 한다."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이와 같이 발신된 테스트 호 패킷은 불법 통신장비로 착신되고 불법 통신장비는 인터넷을 경유 하여 해외측 불법 통신장비인 호 처리 서버로 전송한다. 그리고 호 처리 서버는 호 응답 패킷을 국내 측 불법 통신장비로 회신한다. 이와 같이 테스트 호에 따라 국내측 불법 통신장비와 해외측 불법 통 신장비는 호 시그널링을 위한 VoIP 패킷을 송수신하게 되고, 이 과정에서 VoIP 패킷에는 테스트 호 패킷에 설정되었던 식별정보가 유지된다. 따라서, 인터넷을 통해 송수신되는 패킷에서 테스트 호에 대응하는 VoIP 패킷을 식별할 수 있다. 검출부는, 인터넷에 설치된 트래픽 수집기를 통해 수집된 VoIP 패킷 중 상기 테스트 호 발생부 에서 테스트 호에 설정한 식별정보가 일치하는 VoIP 패킷을 필터링하며, 필터링된 VoIP 패킷에서 IP 주소를 추 출하고, 추출된 IP 주소에 대응하는 패킷들의 특성이 임계 조건을 만족할 경우 해당 추출된 IP 주소를 불법 통신장비(120, 140)의 IP 주소로 판단할 수 있다. 일단, 검출부는 필터링된 VoIP 패킷 중 국내에서 해외로 전송되는 패킷에서 소스 IP 주소와 목적지 IP 주 소를 추출하고, 각 IP 주소별로 상기 트래픽 수집기에서 수집된 VoIP 패킷을 분류한다. 검출부는, 분류된 각 IP 주소별 VoIP 패킷의 특성을 분석하여 임계 조건을 만족하는지를 판단하고, 임계 조건을 만족하는 패킷의 특성을 갖는 IP 주소를 불법 통신장비(120, 140)의 IP 주소로 판단한다. 이때, 검출부는, 상기 추출된 소스 IP 주소와 목적지 IP 주소를 블랙리스트와 비교하여 블랙리스트에 등록 되지 않은 신규 IP 주소인 경우 각 IP 주소별로 상기 트래픽 수집기에서 수집된 VoIP 패킷을 분류하고, 분류된 각 IP 주소별 VoIP 패킷의 특성을 분석하여 임계 조건을 만족하는지를 판단할 수 있다. 일 실시예에서, 검출부는, 상기 소스 IP 주소에 대해 상기 트래픽 수집기에서 수집된 VoIP 패킷을 분류하 고, 해당 VoIP 패킷들의 특성, 예를 들어 To Number(여기서 Number는 국내 피해자들의 전화번호)의 개수, 단위 시간 In/out 호 수, 단위 시간 In/out 호 취소 수 등을 분석하여 임계치를 초과하는 경우, 해당 소스 IP 주소는 국내측 불법 통신장비의 IP 주소로 판단한다. 국내측 불법 통신장비는, 일반적으로 짧은 시간안에 국 내 이동통신망으로 다량의 호를 발신하고, 은행 업무 시간에만 호를 발신하는 등의 특성이 있다. 또한 특 정 착신번호로 짧은 시간 이내에 다량의 호를 발신하고, 이에 따라 짧은 시간 이내에 다량의 호 취소가 발생하 기도 한다. 또한, 다량의 호를 발생시키기 때문에, 임계치 이상의 통화 시간, 요금이 발생하기도 한다. 이러한 특성을 기초로, 상기 소스 IP 주소가 국내측 불법 통신장비의 IP 주소인지를 판단할 수 있다. 일 실시예에서, 검출부는, 상기 목적지 IP 주소에 대해 상기 트래픽 수집기에서 수집된 VoIP 패킷을 분류 하고, 해당 VoIP 패킷들의 특성, 예를 들어 소스 IP 주소의 개수, 단위 시간 In/out 호 수, 단위시간 In/out 호 취소 수 등을 분석하여 임계치를 초과하는 경우, 해당 목적지 IP 주소는 해외측 불법 통신장비의 IP 주소 로 판단한다. 해외측 불법 통신장비는 국내의 여러 대의 불법 통신장비와 통신한다. 따라서, 해외측 불법 통신장비로는 서로 다른 여러 소스 IP 주소의 패킷이 수신된다. 그리고 국내측 불법 통신장비와 마찬가로 짧은 시간안에 다량의 호가 발신되기도 하고 호 취소가 발생하기도 한다. 이러한 특성을 기초로, 상기 목적지 IP 주소가 해외측 불법 통신장비의 IP 주소인지를 판단할 수 있다. 이때, 검출부는 상기 목적지 IP 주소의 위치 정보를 분석하여 해당 목적지 IP 주소의 위치가 미리 설정된 위험 지역의 IP 주소인 경우, 임계 조건에 가중치를 적용하여, 해외측 불법 통신장비의 IP 주소로 판단될 가능성을 더 높일 수 있다. 상기 예에서 위험 지역의 IP 주소에 대한 가중치를 두어 임계치를 다르게 적용할 수 있다. 예를 들어 단위 시간 in/out 호 수가 작은 값이라도 목적지 IP 주소의 가중치가 높으면 해외측 불법 통신 장비의 IP 주소로 판단될 수 있도록 할 수 있다. 차단부는, 상기 검출부에서 판단된 국내외 불법 통신장비(120, 140)의 IP 주소와 그 IP 주소에 대응 하는 신고 전화번호를 블랙리스트에 등록할 수 있다. 또한 차단부는, 국내외 불법 통신장비(120, 140)의 IP 주소 및 이에 대응하는 신고 전화번호에서 발생한 패킷 또는 이동통신 호가 국내 피해자에게 전송되지 않도 록 인터넷 및/또는 국내 이동통신망에 관련 정보를 설정하여 차단할 수 있다. 해외 불법 통신장비 의 IP 주소를 차단할 경우, 보이스피싱 조직이 국내에 새로운 불법 통신장비를 설치하더라도 해외 불 법 통신장비와 통신이 불가하여 새로운 불법 통신장비에 의한 피해를 줄일 수 있다. 또한 차단부 는 신고 전화번호에 대해서는 이동통신가입을 이용 정지시키고, 해당 신고 전화번호의 명의로 개통된 다른 전화번호들에 대해서도 이용 정지시킬 수 있다. 도 3은 본 발명의 일 실시예에 따른 불법 통신장비를 탐지하는 방법을 설명하는 흐름도이다. 도 3을 참조하면, 단계 S301에서, 탐지 장치는, 경찰청, 금감원 등으로부터 보이스피싱 등의 불법호 신고 전화번호를 수집한다. 단계 S302에서, 탐지 장치는, 상기 수집된 신고 전화번호가 테스트 대상 전화번호인지 여부를 판단한다. 구체적으로, 탐지 장치는, 상기 수집된 신고 전화번호가 블랙리스트에 등록되어 있는지 여부, 블랙리스트 에 등록되어 있다면 유효한지 등을 확인한다. 탐지 장치는, 신고 전화번호가 블랙리스트에 등록되어 있지 않은 신규 전화번호이거나, 블랙리스트에 등록되어 있지만 차단 해제되어 유효한 전화번호인 경우, 테스트 대상 전화번호로 결정할 수 있다. 일 실시예에서, 탐지 장치는, 신고 전화번호에 대한 단말 정보를 확인하고, 신고 전화번호에 대응하는 단말 유형이 자급 단말(OMD: Open Market Device)인 경우에만 최종 테스트 대상 전화 번호 결정할 수 있다. 단계 S303에서, 탐지 장치는, 테스트 대상 전화번호로 결정된 신고 전화번호로 테스트 호를 발생시킨다. 즉 탐지 장치는, 신고 전화번호를 착신 전화번호로 설정하여 테스트 호 패킷을 인터넷을 경유하여 발 신한다. 이때, 탐지 장치는, 테스트 호에 테스트 호임을 식별할 수 있는 식별정보를 설정한다. 식별정보는 SIP 헤더(Header)의 사용 가능한 정보(User Agent, Call-ID 등)와 SDP(Session Description Protocol) 속성 (Attribute)의 사용 가능한 정보(Owner Username, Session Name emd)를 조합한 다중 정보일 수 있다. 이와 같이 발신된 테스트 호 패킷은 불법 통신장비로 착신되고 불법 통신장비는 인터넷을 경유 하여 해외측 불법 통신장비인 호 처리 서버로 전송한다. 그리고 호 처리 서버는 호 응답 패킷을 국내 측 불법 통신장비로 회신한다. 이와 같이 테스트 호에 따라 국내측 불법 통신장비와 해외측 불법 통 신장비는 호 시그널링을 위한 VoIP 패킷을 송수신하게 되고, 이 과정에서 VoIP 패킷에는 테스트 호 패킷에 설정되었던 식별정보가 유지된다. 따라서, 인터넷을 통해 송수신되는 패킷에서 테스트 호에 대응하는 VoIP 패킷을 식별할 수 있다. 단계 S304에서, 탐지 장치는, 인터넷에 설치된 트래픽 수집기를 통해 VoIP 패킷을 수집한다. 단계 S305에서, 탐지 장치는, 수집된 VoIP 패킷 중 상기 단계 S303에서 테스트 호에 설정한 식별정보에 매칭되 는 VoIP 패킷을 필터링한다. 단계 S306에서, 탐지 장치는, 필터링된 VoIP 패킷 중 국내에서 해외로 전송되는 패킷에서 소스 IP 주소와 목적지 IP 주소를 추출한다. 단계 S307에서, 탐지 장치는, 각 IP 주소별로 상기 트래픽 수집기에서 수집된 VoIP 패킷을 분류한다. 단계 S308에서, 탐지 장치는, 분류된 각 IP 주소별 VoIP 패킷의 특성을 분석하여 임계 조건을 만족하는지 를 판단한다. 이때, 탐지 장치는, 상기 추출된 소스 IP 주소와 목적지 IP 주소를 블랙리스트와 비교하여 블랙리스트에 등록되지 않은 신규 IP 주소인 경우에만 각 IP 주소별로 상기 트래픽 수집기에서 수집된 VoIP 패 킷을 분류할 수 있다. 일 실시예에서, 탐지 장치는, 상기 소스 IP 주소에 대해 상기 트래픽 수집기에서 수집된 VoIP 패킷을 분류 하고, 해당 VoIP 패킷들의 특성, 예를 들어 To Number(여기서 Number는 국내 피해자들의 전화번호)의 개수, 단 위 시간 In/out 호 수, 단위 시간 In/out 호 취소 수 등을 분석하여 임계치를 초과하는지 확인한다. 일 실시예에서, 탐지 장치는, 상기 목적지 IP 주소에 대해 상기 트래픽 수집기에서 수집된 VoIP 패킷을 분 류하고, 해당 VoIP 패킷들의 특성, 예를 들어 소스 IP 주소의 개수, 단위 시간 In/out 호 수, 단위시간 In/out 호 취소 수 등을 분석하여 임계치를 초과하는지 확인한다. 일 실시예에서, 탐지 장치는, 상기 목적지 IP 주소의 위치 정보를 분석하여 해당 목적지 IP 주소의 위치가 위험 지역의 IP 주소인 경우, 임계 조건에 가중치를 적용할 수 있다. 상기 예에서 위험 지역의 IP 주소에 대한 임계치를 낮게 설정하거나 인공지능 모델을 적용할 경우 가중치 자체를 분석 파라미터로 사용할 수 있다. 단계 S309에서, 탐지 장치는, 분류된 각 IP 주소별 VoIP 패킷의 특성이 임계 조건을 만족하는 경우, 해당 IP 주소를 불법 통신장비(120, 140)의 IP 주소로 판정한다. 소스 IP 주소의 VoIP 패킷의 특성이 임계 조건을 만 족하는 경우, 해당 소스 IP 주소는 국내측 불법 통신장비의 IP 주소로 판정하고, 목적지 IP 주소의 VoIP 패킷의 특성이 임계 조건을 만족하는 경우, 해당 목적지 IP 주소는 해외측 불법 통신장비의 IP 주소로 판 정한다. 단계 S310에서, 탐지 장치는, 국내외 불법 통신장비(120, 140)의 IP 주소 및 이에 대응하는 신고 전화번호 에서 발생한 패킷 또는 이동통신 호가 국내 피해자에게 전송되지 않도록 인터넷 및/또는 국내 이동통신망 에 관련 정보를 설정하여 차단할 수 있다. 또한, 탐지 장치는, 국내외 불법 통신장비(120, 140)의 IP 주소와 그 IP 주소에 대응하는 신고 전화번호를 블랙리스트에 등록할 수 있다. 또한 탐지 장치는, 신고 전 화번호에 대해서는 이동통신가입을 이용 정지시키고, 해당 신고 전화번호의 명의로 개통된 다른 전화번호들에 대해서도 이용 정지시킬 수 있다. 본 명세서는 많은 특징을 포함하는 반면, 그러한 특징은 본 발명의 범위 또는 특허청구범위를 제한하는 것으로 해석되어서는 안 된다. 또한, 본 명세서에서 개별적인 실시예에서 설명된 특징들은 단일 실시예에서 결합되어 구현될 수 있다. 반대로, 본 명세서에서 단일 실시예에서 설명된 다양한 특징들은 개별적으로 다양한 실시예에 서 구현되거나, 적절히 결합되어 구현될 수 있다. 도면에서 동작들이 특정한 순서로 설명되었으나, 그러한 동작들이 도시된 바와 같은 특정한 순서로 수행되는 것으로, 또는 일련의 연속된 순서, 또는 원하는 결과를 얻기 위해 모든 설명된 동작이 수행되는 것으로 이해되어서는 안 된다. 특정 환경에서 멀티태스킹 및 병렬 프로세싱이 유리할 수 있다. 아울러, 상술한 실시예에서 다양 한 시스템 구성요소의 구분은 모든 실시예에서 그러한 구분을 요구하지 않는 것으로 이해되어야 한다. 상술한 프로그램 구성요소 및 시스템은 일반적으로 단일 소프트웨어 제품 또는 멀티플 소프트웨어 제품에 패키지로 구 현될 수 있다. 상술한 바와 같은 본 발명의 방법은 프로그램으로 구현되어 컴퓨터로 읽을 수 있는 형태로 기록매체(시디롬, 램, 롬, 플로피 디스크, 하드 디스크, 광자기 디스크 등)에 저장될 수 있다. 이러한 과정은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있으므로 더 이상 상세히 설명하지 않기로 한다."}
{"patent_id": "10-2022-0002807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상에서 설명한 본 발명은, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 있어 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 여러 가지 치환, 변형 및 변경이 가능하므로 전술한 실시예 및 첨부된 도면 에 의해 한정되는 것이 아니다."}
{"patent_id": "10-2022-0002807", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 불법 통신장비 및 탐지 장치를 포함하는 통신 시스템을 나타낸 도면이다. 도 2는 본 발명의 일 실시예에 따른 탐지 장치의 구성을 나타낸 도면이다. 도 3은 본 발명의 일 실시예에 따른 불법 통신장비를 탐지하는 방법을 설명하는 흐름도이다."}
