{"patent_id": "10-2025-0050338", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0056875", "출원번호": "10-2025-0050338", "발명의 명칭": "사료 관리 서비스 제공 장치 및 방법", "출원인": "주식회사 에임비랩", "발명자": "고병수"}}
{"patent_id": "10-2025-0050338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "농가의 사료빈 내부에 설치된 측정 장치와 연계하여 사료 관리 서비스를 제공하는 사료 관리 서비스 제공 장치에 있어서,상기 측정 장치로부터 상기 측정 장치에서 사료까지의 거리를 나타내는 사료 측정 거리 값 및 상기 사료빈 내부의 환경 데이터를 수신하는 통신부;복수의 사료빈들로부터 수집된 복수의 학습용 사료 측정 거리 값들, 복수의 학습용 환경 데이터들 및 상기 복수의 학습용 사료 측정 거리 값들에 대응되는 복수의 실제 사료 거리 값들을 포함하는 복수의 학습 데이터들을 이용하여 저장된 가중치에 따른 출력 거리 값을 출력하고, 상기 출력 거리 값과 상기 실제 사료 거리 값을 비교한결과를 통해 가중치를 업데이트 하도록 오차 보정 모델을 학습시키는 오차 보정 모델 학습부;상기 학습된 오차 보정 모델을 이용하여 상기 통신부에 의해 수신된 상기 사료 측정 거리 값 및 상기 환경 데이터로부터 오차가 보정된 사료 측정 거리 값을 산출하는 오차 보정부;상기 오차가 보정된 사료 측정 거리 값 및 상기 사료빈과 관련된 정보를 기초로 상기 사료의 잔여량을 산출하는사료 잔여량 산출부; 상기 사료의 잔여량을 기초로 일별 사료 변화량을 산출하고, 가스 농도, 온도, 습도 및 일별 사료 변화량을 기초로 사료의 부패 정도를 판단하는 사료 부패 판단부; 및상기 사료의 잔여량을 기초로 사용자 장치에 사료 관리 서비스를 제공하는 사료 관리 서비스 제공부;를 포함하되,상기 사료 부패 정도 판단부는, 상기 온도 및 상기 습도가 각각 설정된 온도 및 습도보다 높게 측정되는 고온 다습 기간을 산출하고, 상기 고온다습 기간이 기 설정된 기간을 초과하면, 상기 가스 농도 및 상기 일별 사료 변화량의 가중치 합을 통해 상기사료의 부패 정도를 판단하고, 상기 고온 다습 기간이 기 설정된 기간을 초과하지 않으면, 상기 고온 다습기간, 상기 가스 농도 및 상기 일별 사료 변화량의 가중치 합을 통해 상기 사료의 부패 정도를 판단하는 것을특징으로 하는 사료 관리 서비스 제공 장치."}
{"patent_id": "10-2025-0050338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 오차 보정 모델 학습부는,상기 복수의 학습용 사료 측정 거리 값들 및 상기 복수의 학습용 환경 데이터들을 입력 받아 상기 복수의 실제사료 거리 값들에 대응되는 상기 측정 장치에서부터 실제 사료까지의 거리 값들을 출력하도록 상기 오차 보정모델을 학습시키는 사료 관리 서비스 제공 장치."}
{"patent_id": "10-2025-0050338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서, 상기 오차 보정 모델은,학습용 사료 측정 거리 값 및 학습용 환경 데이터를 입력 받아 거리 값을 출력하고, 상기 출력된 거리 값과 실제 사료 거리 값을 비교한 결과를 기초로 가중치를 업데이트하는 방식으로 학습하는 사료 관리 서비스 제공 장치.공개특허 10-2025-0056875-3-청구항 4 제 1항에 있어서, 상기 환경 데이터는,상기 사료빈 내부의 상기 가스 농도, 상기 온도 및 상기 습도 중 적어도 하나 이상을 포함하는 사료 관리 서비스 제공 장치."}
{"patent_id": "10-2025-0050338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서, 상기 사료 관리 서비스 제공부는,상기 사료의 잔여량이 제1 임계 값 미만이거나 상기 사료의 부패 정도가 제2 임계 값을 초과하면, 상기 사용자장치에 사료 보충 알림 정보 및 사료 업체 리스트를 제공하는 사료 관리 서비스 제공 장치."}
{"patent_id": "10-2025-0050338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서, 상기 사료 관리 서비스 제공부는,상기 사료의 부패 정도에 따라 상기 사용자 장치에 상기 사료의 보충 빈도, 상기 사료의 보충량 및 사료 첨가제중 적어도 하나 이상을 추천하는 사료 관리 서비스 제공 장치."}
{"patent_id": "10-2025-0050338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "농가의 사료빈 내부에 설치된 측정 장치와 연계하여 사료 관리 서비스를 제공하는 사료 관리 서비스 제공 방법에 있어서,상기 측정 장치로부터 상기 측정 장치에서 사료까지의 거리를 나타내는 사료 측정 거리 값 및 상기 사료빈 내부의 환경 데이터를 수신하는 단계;복수의 사료빈들로부터 수집된 복수의 학습용 사료 측정 거리 값들, 복수의 학습용 환경 데이터들 및 상기 복수의 학습용 사료 측정 거리 값들에 대응되는 복수의 실제 사료 거리 값들을 포함하는 복수의 학습 데이터들을 이용하여 저장된 가중치에 따른 출력 거리 값을 출력하고, 상기 출력 거리 값과 상기 실제 사료 거리 값을 비교한결과를 통해 가중치를 업데이트하도록 오차 보정 모델을 학습시키는 단계;상기 학습된 오차 보정 모델을 이용하여 상기 측정 장치로부터 수신된 상기 사료 측정 거리 값 및 상기 환경 데이터로부터 오차가 보정된 사료 측정 거리 값을 산출하는 단계;상기 오차가 보정된 사료 측정 거리 값, 상기 사료빈의 부피 및 상기 사료빈의 높이를 기초로 상기 사료의 잔여량을 산출하는 단계;상기 사료의 잔여량을 기초로 일별 사료 변화량을 산출하고, 가스 농도, 온도, 습도 및 일별 사료 변화량을 기초로 사료 부패 정도 판단부에서 사료의 부패 정도를 판단하는 단계; 및상기 사료의 잔여량을 기초로 사용자 장치에 사료 관리 서비스를 제공하는 단계;를 포함하되,상기 사료 부패 정도 판단부는,상기 온도 및 상기 습도가 각각 설정된 온도 및 습도보다 높게 측정되는 고온 다습 기간을 산출하고, 상기 고온다습 기간이 기 설정된 기간을 초과하면, 상기 가스 농도 및 상기 일별 사료 변화량의 가중치 합을 통해 상기사료의 부패 정도를 판단하고, 상기 고온 다습 기간이 기 설정된 기간을 초과하지 않으면, 상기 고온 다습기간, 상기 가스 농도 및 상기 일별 사료 변화량의 가중치 합을 통해 상기 사료의 부패 정도를 판단하는 것을특징으로 하는 사료 관리 서비스 제공 방법."}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사료 관리 서비스 제공 장치 및 방법이 개시된다. 본 발명의 일 실시 예에 따른 농가의 사료빈 내부에 설치된 측 정 장치와 연계하여 사료 관리 서비스를 제공하는 사료 관리 서비스 제공 장치는 상기 측정 장치로부터 상기 측 정 장치에서 사료까지의 거리를 나타내는 사료 측정 거리 값 및 상기 사료빈 내부의 환경 데이터를 수신하는 통 (뒷면에 계속)"}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사료 관리 서비스 제공 기술과 관련된다."}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사료를 관리하는 기술에는 사료빈의 무게를 측정하는 로드셀 방식과 사료빈 내부에서 사료까지의 거리를 측정하 는 레이저 방식이 있다. 로드셀 방식은 사료빈의 하중이 과하게 적용되어 잦은 고장이 문제되고 있다. 레이저 방식은 각종 설비가 필요하며 주기적으로 수평을 점검해야 하며, 레이저가 산란시 정보가 부정확하다는 문제가 있었다. 따라서, 일반 농가에서 사료빈 내 사료의 잔여량을 정확하게 측정하고, 사료를 효율적으로 관리하기 위한 기술 이 필요로 하게 되었다."}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시 예들은 사료의 잔여량 및 사료의 부패 정도를 고려하여 사료 관리 서비스를 제공하는 장치 및 방법을 제공하기 위한 것이다."}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 농가의 사료빈 내부에 설치된 측정 장치와 연계하여 사료 관리 서비스를 제공하는 사료 관리 서비스 제공 장치는, 상기 측정 장치로부터 상기 측정 장치에서 사료까지의 거리를 나타내는 사료 측 정 거리 값 및 상기 사료빈 내부의 환경 데이터를 수신하는 통신부, 복수의 사료빈들로부터 수집된 복수의 학습 용 사료 측정 거리 값들, 복수의 학습용 환경 데이터들 및 상기 복수의 학습용 사료 측정 거리 값들에 대응되는 복수의 실제 사료 거리 값들을 포함하는 복수의 학습 데이터들을 이용하여 저장된 가중치에 따른 출력 거리 값 을 출력하고, 상기 출력 거리 값과 상기 실제 사료 거리 값을 비교한 결과를 통해 가중치를 업데이트하도록 오 차 보정 모델을 학습시키는 오차 보정 모델 학습부, 상기 학습된 오차 보정 모델을 이용하여 상기 통신부에 의 해 수신된 상기 사료 측정 거리 값 및 상기 환경 데이터로부터 오차가 보정된 사료 측정 거리 값을 산출하는 오 차 보정부, 상기 오차가 보정된 사료 측정 거리 값 및 상기 사료빈과 관련된 정보를 기초로 상기 사료의 잔여량 을 산출하는 사료 잔여량 산출부, 상기 사료의 잔여량을 기초로 일별 사료 변화량을 산출하고, 가스 농도, 온도, 습도 및 일별 사료 변화량을 기초로 사료의 부패 정도를 판단하는 사료 부패 정도 판단부 및 상기 사료의 잔여량을 기초로 사용자 장치에 사료 관리 서비스를 제공하는 사료 관리 서비스 제공부를 포함하되, 상기 사료 부패 정도 판단부는, 상기 온도 및 상기 습도가 각각 설정된 온도 및 습도보다 높게 측정되는 고온 다습 기간을 산출하고, 상기 고온 다습 기간이 기 설정된 기간을 초과하면, 상기 가스 농도 및 상기 일별 사료 변화량의 가 중치 합을 통해 상기 사료의 부패 정도를 판단하고, 상기 고온 다습 기간이 기 설정된 기간을 초과하지 않으면, 상기 고온 다습 기간, 상기 가스 농도 및 상기 일별 사료 변화량의 가중치 합을 통해 상기 사료의 부패 정도를 판단하는 것을 특징으로 할 수 있다. 상기 오차 보정 모델 학습부는, 상기 복수의 학습용 사료 측정 거리 값들 및 상기 복수의 학습용 환경 데이터들 을 입력받아 상기 복수의 실제 사료 거리 값들에 대응되는 상기 측정 장치에서부터 사료까지의 거리 값들을 출 력하도록 상기 오차 보정 모델을 학습시킬 수 있다. 상기 오차 보정 모델은, 학습용 사료 측정 거리 값 및 학습용 환경 데이터를 입력받아 거리 값을 출력하고, 상 기 출력된 거리 값과 실제 사료 거리 값을 비교한 결과를 기초로 가중치를 업데이트하는 방식으로 학습할 수 있 다. 상기 환경 데이터는, 상기 사료빈 내부의 상기 가스 농도, 상기 온도 및 상기 습도 중 적어도 하나 이상을 포함 할 수 있다. 상기 사료 관리 서비스 제공부는, 상기 사료의 잔여량이 제1 임계 값 미만이거나 상기 사료의 부패 정도가 제2 임계 값을 초과하면, 상기 사용자 장치에 사료 보충 알림 정보 및 사료 업체 리스트를 제공할 수 있다. 상기 사료 관리 서비스 제공부는, 상기 사료의 부패 정도에 따라 상기 사용자 장치에 상기 사료의 보충 빈도, 상기 사료의 보충량 및 사료 첨가제 중 적어도 하나 이상을 추천할 수 있다.본 발명의 일 실시 예에 따른 농가의 사료빈 내부에 설치된 측정 장치와 연계하여 사료 관리 서비스를 제공하는 사료 관리 서비스 제공 방법은, 상기 측정 장치로부터 상기 측정 장치에서 사료까지의 거리를 나타내는 사료 측 정 거리 값 및 상기 사료빈 내부의 환경 데이터를 수신하는 단계, 복수의 사료빈들로부터 수집된 복수의 학습용 사료 측정 거리 값들, 복수의 학습용 환경 데이터들 및 상기 복수의 학습용 사료 측정 거리 값들에 대응되는 복 수의 실제 사료 거리 값들을 포함하는 복수의 학습 데이터들을 이용하여 저장된 가중치에 따른 출력 거리 값을 출력하고, 상기 출력 거리 값과 상기 실제 사료 거리 값을 비교한 결과를 통해 가중치를 업데이트하도록 오차 보정 모델을 학습시키는 단계, 상기 학습된 오차 보정 모델을 이용하여 상기 측정 장치로부터 수신된 상기 사료 측정 거리 값 및 상기 환경 데이터로부터 오차가 보정된 사료 측정 거리 값을 산출하는 단계, 상기 오차가 보정 된 사료 측정 거리 값, 상기 사료빈의 부피 및 상기 사료빈의 높이를 기초로 상기 사료의 잔여량을 산출하는 단 계, 상기 사료의 잔여량을 기초로 일별 사료 변화량을 산출하고, 가스 농도, 온도, 습도 및 일별 사료 변화량을 기초로 사료 부패 정도 판단부에서 사료의 부패 정도를 판단하는 단계 및 상기 사료의 잔여량을 기초로 사용자 장치에 사료 관리 서비스를 제공하는 단계를 포함하되, 상기 사료 부패 정도 판단부는, 상기 온도 및 상기 습도 가 각각 설정된 온도 및 습도보다 높게 측정되는 고온 다습 기간을 산출하고, 상기 고온 다습 기간이 기 설정된 기간을 초과하면, 상기 가스 농도 및 상기 일별 사료 변화량의 가중치의 합을 통해 상기 사료의 부패 정도를 판 단하고, 상기 고온 다습 기간이 기 설정된 기간을 초과하지 않으면, 상기 고온 다습 기간, 상기 가스 농도 및 상기 일별 사료 변화량의 가중치 합을 통해 상기 사료의 부패 정도를 판단하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예들에 따르면, 복수의 농가들로부터 수집된 측정 거리 값 및 환경 데이터를 학습하여 사료까지 의 거리 값의 오차를 보정함으로써, 사료의 잔여량에 대한 예측 정확도를 높여 사료 관리 서비스의 품질을 높일 수 있다. 또한, 본 발명의 실시 예들에 따르면, 사료빈 내부의 환경과 관련된 다양한 데이터들을 이용하여 사료의 부패 정도를 판단함으로써, 사료의 부패 정도에 대한 판단 정확도를 높여 사료 관리 서비스의 품질을 높일 수 있다."}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 구체적인 실시형태를 설명하기로 한다. 이하의 상세한 설명은 본 명세서에서 기술된 방법, 장치 및/또는 시스템에 대한 포괄적인 이해를 돕기 위해 제공된다. 그러나 이는 예시에 불과하며 본 발명은 이에 제한되지 않는다. 본 발명의 실시예들을 설명함에 있어서, 본 발명과 관련된 공지기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 그리고, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 상세한 설명에서 사용되 는 용어는 단지 본 발명의 실시예들을 기술하기 위한 것이며, 결코 제한적이어서는 안 된다. 명확하게 달리 사 용되지 않는 한, 단수 형태의 표현은 복수 형태의 의미를 포함한다. 본 설명에서, \"포함\" 또는 \"구비\"와 같은 표현은 어떤 특성들, 숫자들, 단계들, 동작들, 요소들, 이들의 일부 또는 조합을 가리키기 위한 것이며, 기술된 것 이외에 하나 또는 그 이상의 다른 특성, 숫자, 단계, 동작, 요소, 이들의 일부 또는 조합의 존재 또는 가능 성을 배제하도록 해석되어서는 안 된다.도 1은 본 발명의 일 실시 예에 따른 사료 관리 서비스 제공 시스템의 구성도이다. 도 1을 참조하면, 사료 관리 서비스 제공 시스템은 사료빈, 측정 장치, 사용자 장치 및 사료 관리 서비스 제공 장치를 포함한다. 사료빈은 사료를 저장하는 탱크이다. 사료빈의 종류는 농가에 따라 달라질 수 있다. 사료빈의 형상 및 크기는 달라질 수 있으며, 사료빈의 모델정보는 사료 관리 서비스 제공 장치에서 관리될 수 있다. 사료빈은 상부에 뚜껑이 형성되어 내부를 밀폐시킬 수 있다. 이 경우, 사료빈의 뚜껑의 내측에는 측정 장치가 설치될 수 있다. 이는 사료빈의 내부 중앙에서 사료까지의 거리를 측정하도록 하기 위함이다. 측정 장치는 사료빈 내부에 설치되는 무선통신단말이다. 일 실시 예에서, 측정 장치는 측정 장치 에서부터 사료빈 내부의 사료까지의 거리를 측정한다. 이를 위해, 측정 장치는 레이저 신호를 이용 하여 물체와의 거리를 측정하는 라이다(Lidar) 센서를 이용할 수 있으나, 반드시 이에 한정하는 것은 아니다. 측정 장치는 초음파 센서를 이용하여 사료까지의 거리를 측정하는 것도 가능하다. 한편, 본 명세서에서 측정 장치에서부터 사료까지의 거리는 사료 측정 거리 값으로 지칭될 수 있다. 일 실시 예에서, 측정 장치는 사료빈 내부의 환경 데이터를 주기적으로 측정할 수 있다. 이때, 환경 데 이터는 가스 농도, 온도, 습도 등을 포함할 수 있다. 예를 들어, 측정 장치는 온도 센서 및 습도 센서를 이 용하여 사료빈 내부의 온도 및 습도를 측정할 수 있다. 또한, 측정 장치는 가스감지센서를 이용하여 사 료빈 내부의 가스 농도를 측정할 수 있다. 이때, 가스 농도는 암모니아 및 이산화탄소의 농도를 나타낼 수 있다. 일 실시 예에서, 측정 장치는 무선통신망을 이용하여 사료 관리 서비스 제공 장치와 통신할 수 있다. 예를 들어, 측정 장치는 LoRa(Long Range) 통신망을 이용하여 사료 관리 서비스 제공 장치와 통신할 수 있다. 일 실시 예에서, 측정 장치는 태양광을 이용하여 전원을 이용하는 것도 가능하다. 이 경우, 측정 장치 는 사료빈의 외측에 형성된 태양광패널과 전기적으로 연결될 수 있다. 이는 측정 장치가 사료 관리 서 비스 제공 장치와 무선통신을 함에 있어서 외부로부터 별도의 상시전원 없이도 태양광을 통해 충전되도록 하기 위함이다. 이 경우, 측정 장치는 저전력으로 구동됨으로 태양광을 이용한 전기 충전시에도 상당한 시 간 동안 구동될 수 있다. 일 실시 예에서, 측정 장치는 몸체의 기울기를 감지할 수 있다. 측정 장치는 사료빈의 중앙에서 기 울어지게 레이저신호를 출력하지 않도록 기울기를 감지한다. 이 경우, 측정 장치의 라이다 센서는 기울기를 조절할 수 있는 구조로 설계되는 것이 바람직하다. 측정 장치는 수평센서를 통해 몸체의 기울기가 기 설정 치를 초과한 경우, 라이다 센서의 기울기를 가변시킬 수 있다. 측정 장치는 몸체의 기울기가 기 설정치 이 내인 경우에만 레이저신호를 출력하도록 할 수 있다. 이에 따라, 사료 측정 거리 값이 부정확하게 수집되는 것 을 방지할 수 있다. 사료 관리 서비스 제공 장치는 측정 장치와 연계하여 사용자에게 사료 관리 서비스를 제공한다. 일 실시 예에서, 사료 관리 서비스 제공 장치는 농가와 관련된 정보, 사료빈과 관련된 정보, 사료빈 에 저장된 사료와 관련된 정보, 사료빈 내부의 환경과 관련된 정보, 사료 업체와 관련된 정보 등을 포 함하는 빅데이터를 기반으로 사료 관리 서비스를 제공할 수 있다. 사료빈과 관련된 정보는 사료빈의 모 델정보, 사료빈의 부피, 사료빈의 높이 등을 포함할 수 있다. 사료와 관련된 정보는 사료 측정 거리 값, 사료의 잔여량, 일별 사료 변화량, 기 결정된 일일 사료 급여량, 사료의 보충 시기, 사료의 보충량, 사료의 제조 업체에 대한 정보, 사료 첨가제의 종류 등을 관리할 수 있다. 일 실시 예에서, 사료 관리 서비스 제공 장치는 측정 장치와 통신하여 사료 측정 거리 값 및 환경 데 이터를 수신한다. 사료 관리 서비스 제공 장치는 복수의 사료빈들에 설치된 복수의 측정 장치들과 통신하 여 복수의 학습용 사료 측정 거리 값 및 복수의 학습용 환경 데이터들을 수집하여 관리할 수 있다. 이때, 복수 의 사료빈들은 복수의 농가들에 구비된 것일 수 있다. 일 실시 예에서, 사료 관리 서비스 제공 장치는 사료 측정 거리 값 및 환경 데이터를 기초로 사료빈 내부에 저장된 사료의 잔여량을 예측할 수 있다. 예를 들어, 사료 관리 서비스 제공 장치는 오차 보정 모 델을 이용하여 사료 측정 거리 값의 오차를 보정하고, 오차가 보정된 사료 측정 거리 값을 기초로 사료의 잔여량을 산출할 수 있다. 이때, 오차 보정 모델은 사료 측정 거리 값 및 환경 데이터를 입력받아 오차가 보정된 사료 측정 거리 값을 출 력하는 인공지능 기반의 학습 모델일 수 있다. 예를 들어, 오차 보정 모델은 사료빈 내부의 가스 농도, 온 도, 습도 등과 같은 환경에 따라 측정 장치에 의해 측정되는 거리 값에 발생될 수 있는 오차를 보정하기 위 한 모델일 수 있다. 오차 보정 모델은 기계 학습 기반 또는 딥러닝 기반의 학습 모델일 수 있으나, 반드시 이에 한정되는 것은 아니다. 일 실시 예에서, 사료 관리 서비스 제공 장치는 환경 데이터를 기초로 사료의 부패 정보를 판단할 수 있다. 예를 들어, 사료 관리 서비스 제공 장치는 온도 및 습도가 각각 설정된 온도 및 습도보다 높게 측정 되는 고온 다습 기간, 가스 농도 및 일별 사료 변화량을 기초로 사료의 부패 정도를 판단할 수 있다. 일 실시 예에서, 사료 관리 서비스 제공 장치는 사료의 잔여량 및 사료의 부패 정도에 따라 사용자 장치 에 사료 관리 서비스를 제공할 수 있다. 사료 관리 서비스는 사료 관리와 관련된 다양한 기능들을 포함할 수 있다. 예를 들어, 사료 관리 서비스 제공 장치는 사료의 잔여량을 기초로 사용자 장치에 사료 보충 을 알리거나 사료 보충을 위한 사료 업체 리스트를 제공할 수 있다. 또한, 사료 관리 서비스 제공 장치는 사료의 부패 정도를 고려하여 사용자 장치에 사료의 보충 빈도, 사료의 보충량, 사료 첨가제 등을 추천할 수 있다. 한편, 사료 관리 서비스는 상술한 예시들 이외에도 사료 관리와 관련된 다양한 서비스들을 포함할 수 있다. 이하에서는 도 2 내지 도 5를 참조하여 사료 관리 서비스 제공 장치를 구체적으로 설명하도록 한다. 도 2는 본 발명의 일 실시 예에 따른 사료 관리 서비스 제공 장치의 구성도이다. 도 3은 본 발명의 일 실 시 예에 따른 사료 측정 거리 값을 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시 예에 따른 오차 보정 모 델의 학습 과정을 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시 예에 따른 사료 관리 서비스를 제공하는 예를 설명하기 위한 도면이다. 도 2를 참조하면, 사료 관리 서비스 제공 장치는 통신부, 오차 보정 모델 학습부, 오차 보정부 , 사료 잔여량 산출부, 사료 부패 정도 판단부 및 사료 관리 서비스 제공부를 포함할 수 있다. 통신부는 외부의 측정 장치와 통신한다. 예를 들어, 통신부는 LoRa 통신과 같이 무선으로 통신할 수 있으나, 반드시 이에 한정하는 것은 아니다. 통신부는 기 설정된 시간 주기마다 측정 장치로부터 측정 장치에서 사료까지의 거리를 나타내는 사료 측정 거리 값 및 사료빈 내부의 환경 데이터를 수신할 수 있다. 도 3을 참조하면, 측정 장치는 측정 장치에서부터 사료까지의 거리를 나타내는 사료 측정 거리 값 을 측정할 수 있다. 예를 들어, 측정 장치는 라이다 센서를 통해 레이저신호를 송출하고, 사료 표 면에 반사되어 돌아오는 레이저신호를 수신하여 사료 측정 거리 값을 측정할 수 있다. 이후, 통신부 는 측정 장치로부터 사료 측정 거리 값을 수신할 수 있다. 또한, 통신부는 측정 장치로부터 주기 적으로 사료빈 내부의 가스 농도, 온도, 습도 등을 수신할 수 있다. 다시 도 2를 참조하면, 오차 보정 모델 학습부는 복수의 학습 데이터들을 이용하여 오차 보정 모델을 학습 시킬 수 있다. 이때, 복수의 학습 데이터들은 복수의 사료빈들로부터 수집된 복수의 학습용 사료 측정 거리 값 들, 복수의 학습용 환경 데이터들 및 복수의 학습용 사료 측정 거리 값들에 대응되는 복수의 실제 사료 거리 값 들을 포함할 수 있다. 실제 사료 거리 값은 측정 장치에서부터 사료까지의 실제 거리를 나타낼 수 있다. 일 실시 예에서, 실제 사 료 거리 값은 사료가 사료빈 내 1/4 지점, 1/2 지점 등과 같이 특정 높이에 이르렀을 때의 거리일 수 있다. 또한, 실제 사료 거리 값은 해당 농가의 사용자에 의해 직접 측정된 거리일 수 있다. 이 경우, 학습용 사료 측 정 거리 값은 대응되는 실제 사료 거리 값을 획득한 시점에 측정 장치에 의해 측정된 거리일 수 있다. 한편, 실제 사료 거리 값을 획득하는 방식은 상술한 예에 한정되는 것은 아니며, 다양한 방식을 통해 실제 사료 거리 값을 획득할 수 있다. 일 실시 예에서, 오차 보정 모델 학습부는 복수의 학습용 사료 측정 거리 값들 및 복수의 학습용 환경 데 이터들을 입력받아 복수의 실제 사료 거리 값들에 근접한 거리 값들을 출력하도록 오차 보정 모델을 학습시킬수 있다. 예를 들어, 오차 보정 모델은 학습용 사료 측정 거리 값 및 학습용 환경 데이터를 입력받아 거리 값을 출력하고, 출력된 거리 값과 실제 사료 거리 값을 비교한 결과를 기초로 가중치를 업데이트하는 방식으로 학습 할 수 있다. 일 실시 예에서, 오차 보정 모델은 복수의 층(layer)들을 포함하는 신경망(neural network)으로 구성될 수 있다. 신경망은 생물학적인 뉴런의 기능을 단순화시킨 인공 뉴런들이 이용되고, 인공 뉴런들은 연결 가중치 (connection weight)를 가지는 연결선을 통해 상호 연결될 수 있다. 신경망의 파라미터인 연결 가중치는 연결선 이 갖는 특정한 값으로서 연결 강도라고도 나타낼 수 있다. 신경망은 인공 뉴런들을 통해 인간의 인지 작용이나 학습 과정을 수행할 수 있다. 인공 뉴런은 노드(node)라고도 지칭할 수 있다. 신경망은 복수의 층들을 포함할 수 있다. 예를 들어, 신경망은 입력 층(input layer), 은닉 층(hidden layer), 출력 층(output layer)를 포함할 수 있다. 입력 층은 학습을 수행하기 위한 입력을 수신하여 은닉 층에 전달할 수 있고, 출력 층은 은닉 층의 노드들로부터 수신한 신호에 기초하여 신경망의 출력을 생성할 수 있다. 은닉 층 은 입력 층과 출력 층 사이에 위치하고, 입력 층을 통해 전달된 학습 데이터를 예측하기 쉬운 값으로 변화시킬 수 있다. 입력 층과 은닉 층에 포함된 노드들은 연결 가중치를 가지는 연결선을 통해 서로 연결되고, 은닉 층과 출력 층에 포함된 노드들에서도 연결 가중치를 가지는 연결선을 통해 서로 연결될 수 있다. 입력 층, 은닉 층 및 출력 층은 복수의 노드들을 포함할 수 있다. 이하, 신경망을 학습시킨다는 것은 신경망의 파라미터를 학습시킨다는 것으로 이해될 수 있다. 또한, 학습된 신 경망은 학습된 파라미터가 적용된 신경망으로 이해될 수 있다. 신경망은 기 설정된 손실 함수(loss function)를 지표로 삼아 학습될 수 있다. 손실 함수는 신경망이 학습을 통해 최적의 가중치 매개변수를 결정하기 위한 지표 일 수 있다. 신경망은 설정된 손실 함수의 결과 값을 가장 작게 만드는 것을 목표로 학습될 수 있다. 도 4를 참조하면, 오차 보정 모델은 학습용 사료 측정 거리 값 및 학습용 환경 데이터를 입력 데이터로 이용하 고 학습용 사료 측정 거리 값에 대응되는 실제 사료 거리 값을 타겟 데이터로 이용하여 학습할 수 있다. 이때, 한번의 학습 사이클에서 이용되는 학습용 사료 측정 거리 값, 학습용 환경 데이터 및 실제 사료 거리 값은 동일 한 사료빈에서 동일한 시점에 측정된 데이터일 수 있다. 구체적으로, 오차 보정 모델은 학습용 사료 측정 거리 값 및 학습용 환경 데이터를 입력받고, 저장된 가중치에 따라 출력 거리 값을 출력할 수 있다. 이후, 오차 보정 모델은 출력 거리 값과 실제 사료 거리 값을 비교한 결 과를 통해 가중치를 업데이트할 수 있다. 예를 들어, 오차 보정 모델은 출력 거리 값 및 실제 사료 거리 값에 대한 손실 함수의 결과 값이 작아지도록 가중치를 업데이트할 수 있다. 다시 도 2를 참조하면, 오차 보정부는 학습된 오차 보정 모델을 이용하여 통신부에 의해 수신된 사료 측정 거리 값 및 환경 데이터로부터 오차가 보정된 사료 측정 거리 값을 산출할 수 있다. 사료 잔여량 산출부는 오차가 보정된 사료 측정 거리 값 및 사료빈과 관련된 정보를 기초로 사료의 잔 여량을 산출할 수 있다. 예를 들어, 사료 잔여량 산출부는 오차가 보정된 사료 측정 거리 값 및 사료빈 의 높이를 기초로 사료의 높이를 산출할 수 있다. 이때, 사료의 높이는 사료빈의 바닥에서부터 사료 표 면까지의 길이를 나타낼 수 있다. 사료 잔여량 산출부는 사료빈의 부피 및 사료의 높이를 기초로 사료 의 잔여량을 산출할 수 있다. 따라서, 본 발명의 실시 예들에 따르면, 복수의 농가들로부터 수집된 학습 데이터를 이용하여 학습된 모델을 통 해 사료 측정 거리 값의 오차를 보정함으로써, 사료의 잔여량을 정확하게 산출할 수 있다. 한편, 사료 부패 정도 판단부는 사료의 잔여량을 기초로 일별 사료 변화량을 산출하고, 사료빈 내부의 가스 농도, 온도, 습도 및 일별 사료 변화량을 기초로 사료의 부패 정도를 판단할 수 있다. 일 실시 예에서, 사료 부패 정도 판단부는 매일 측정되는 사료의 잔여량을 기초로 일별 사료 변화량을 산 출할 수 있다. 이때, 일별 사료 변화량은 농가의 가축이 섭취하는 일별 사료 섭취량에 대응되는 정보로서, 사료 의 부패 정도를 판단하는데 이용되는 정보일 수 있다. 가축이 섭취하는 사료량은 사료의 신선도에 따라 달라질 수 있다. 예를 들어, 사료의 신선도가 높다면, 가축의 일별 사료 섭취량은 가축의 성장 시기에 따라 기 결정된 일일 사료 급여량에 대응될 수 있다. 하지만, 사료의 부패 정도가 높아질수록 사료의 신선도도 떨어지고, 가축 의 일별 사료 섭취량은 기 결정된 일일 사료 급여량보다 적어질 수 있다. 따라서, 일별 사료 변화량이 줄어들거 나 기 결정된 일일 사료 급여량보다 적어진다면, 사료가 부패한 것으로 판단할 수 있다. 일 실시 예에서, 사료 부패 정도 판단부는 사료빈 내부의 온도 및 습도가 각각 설정된 온도 및 습도보 다 높게 측정되는 고온 다습 기간을 산출할 수 있다. 예를 들어, 사료 부패 정도 판단부는 사료빈 내 부의 온도가 30도 이상이고, 습도가 70%이상인 기간을 고온 다습 기간으로 산출할 수 있다. 다만, 상술한 설정 된 온도 및 습도는 일 예시에 불과하며, 반드시 이에 한정되는 것은 아니다. 일 실시 예에서, 사료 부패 정도 판단부는 고온 다습 기간이 기 설정된 기간을 초과하면, 사료가 부패한 것으로 판단할 수 있다. 이때, 기 설정된 기간은 2주로 설정될 수 있으나, 반드시 이에 한정되는 것은 아니다. 또한, 고온 다습 기간이 기 설정된 기간을 초과하면, 사료 부패 정도 판단부는 기 결정된 일일 사료 급여 량과 일별 사료 변화량 간의 차이 값 및 가스 농도의 가중치 합을 통해 사료의 부패 정도를 판단할 수 있다. 이 때, 사료의 부패 정도는 아래의 수학식 1을 통해 산출될 수 있다. [수학식 1]"}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 수학식 1에서, C는 사료의 부패 정도, G는 가스 농도, F1은 기 결정된 일일 사료 급여량, F2는 일별 사료 변화량, k1은 가스 농도에 적용되는 가중치 상수 및 k2는 기 결정된 일일 사료 급여량과 일별 사료 변화량의 차 이 값에 적용되는 가중치 상수일 수 있다. 일 실시 예에서, 사료 부패 정도 판단부는 고온 다습 기간이 기 설정된 기간을 초과하지 않으면, 기 결정 된 일일 사료 급여량과 일별 사료 변화량 간의 차이 값, 고온 다습 기간 및 가스 농도의 가중치 합을 통해 사료 의 부패 정도를 판단할 수 있다. 이 경우, 사료의 부패 정도는 아래의 수학식 2를 통해 산출될 수 있다. [수학식 2]"}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 수학식 2에서, P는 고온 다습 기간에 적용되는 가중치 상수, k3은 고온 다습 기간에 적용되는 가중치 상수, k4는 가스 농도에 적용되는 가중치 상수 및 k5는 기 결정된 일일 사료 급여량과 일별 사료 변화량 간의 차이 값에 적용되는 가중치 상수일 수 있다. 구체적으로, 고온 다습 기간이 길어지거나 가스 농도가 높아질수록 사료의 부패 정도는 높아질 수 있다. 또한, 일별 사료 변화량과 기 결정된 일일 사료 급여량의 차이 값이 커질 수록 사료의 부패 정도는 높아질 수 있다. 따라서, 본 발명의 실시 예들에 따르면, 사료빈 내부의 환경과 관련된 다양한 정보들을 복합적으로 고려하 여 사료의 부패 정도를 판단함으로써, 부패 정도에 대한 판단 정확도를 높일 수 있다. 한편, 사료 관리 서비스 제공부는 사료의 잔여량 및 사료의 부패 정도 중 적어도 하나 이상을 기초로 사용 자 장치에 사료 관리 서비스를 제공할 수 있다. 일 실시 예에서, 사료 관리 서비스 제공부는 사료의 잔여량이 제1 임계 값 미만이거나 사료의 부패 정도가 제2 임계 값을 초과하면, 사용자 장치에 사료 보충 알림 정보 및 사료 업체 리스트를 제공할 수 있다. 도 5를 참조하면, (a)는 사료 보충 알림 정보의 일 예를 도시하고, (b)는 사료 업체 리스트의 일 예를 도시한다. 사료 보충 알림 정보는 사료의 잔여량과 사료의 부패 정도를 포함할 수 있다. 사료 업체 리스트는 각 사료 업체가 제공하는 사료의 종류, 사료 첨가제, 주소, 연락처 등과 같이 사료 업체와 관련된 정보들을 포함할 수 있다. 사용자는 사료 보충 알림 정보 및 사료 업체 리스트를 고려하여 사용자 장치를 통해 사료를 보충 할 수 있다. 일 실시 예에서, 사료 관리 서비스 제공부는 사료의 부패 정도에 따라 사용자 장치에 사료의 보충 빈 도, 사료의 보충량 및 사료 첨가제 중 적어도 하나 이상을 추천할 수 있다. 예를 들어, 사료 관리 서비스 제공부는 사료빈에 사료가 보충된 시점을 기준으로 사료의 부패 정도가 높으면 사료의 부패 속도가 빠른 것으로 판단할 수 있다. 이 경우, 사료 관리 서비스 제공부는 사용자 장 치에 사료의 보충 빈도를 늘리고 사료의 보충량을 줄이도록 추천할 수 있다. 즉, 부패 속도가 빠른 환경에 서 사용자에게 적은 양의 사료를 짧은 주기마다 보충하도록 추천함으로써, 가축에게 신선도가 높은 사료가 제공 될 수 있다. 또한, 사료 관리 서비스 제공부는 사용자 장치에 사료의 부패 속도를 늦춰주고 신선도 유 지 효과가 높은 사료 첨가제를 추천할 수 있다. 다른 예로, 사료 관리 서비스 제공부는 사료빈에 사료가 보충된 시점을 기준으로 사료의 부패 정도가 낮으면 사료의 부패 속도가 느린 것으로 판단할 수 있다. 이 경우, 사료 관리 서비스 제공부는 사용자 장치에 사료의 보충 빈도를 줄이고 사료의 보충량을 늘리도록 추천할 수 있다. 즉, 부패 속도가 느린 환경에 서 사용자에게 많은 양의 사료를 긴 주기마다 보충하도록 추천함으로써, 사료를 보충할 때마다 소요되는 비용을 감소시킬 수 있다. 도 6은 본 발명의 일 실시 예에 따른 사료 관리 서비스 제공 방법을 설명하기 위한 순서도이다. 도 6에 도시된 방법은 예를 들어, 도 1에 도시된 사료 관리 서비스 제공 장치에 의해 수행될 수 있다. 도 6을 참조하면, 단계 S601에서, 사료 관리 서비스 제공 장치는 측정 장치로부터 사료 측정 거리 값 및 사료빈 내부의 환경 데이터를 수신할 수 있다. 단계 S603에서, 사료 관리 서비스 제공 장치는 복수의 학습 데이터들을 이용하여 오차 보정 모델을 학습시 킬 수 있다. 이때, 복수의 학습 데이터들은 복수의 사료빈들로부터 수집된 복수의 사료 측정 거리 값들, 복수의 환경 데이터들 및 복수의 사료 측정 거리 값들에 대응되는 복수의 실제 사료 거리 값들을 포함할 수 있다. 단계 S605에서, 사료 관리 서비스 제공 장치는 학습된 오차 보정 모델을 이용하여 사료 측정 거리 값 및 환경 데이터로부터 오차가 보정된 사료 측정 거리 값을 산출할 수 있다. 단계 S607에서, 사료 관리 서비스 제공 장치는 오차가 보정된 사료 측정 거리 값 및 사료빈과 관련된 정보를 기초로 사료의 잔여량을 산출할 수 있다. 단계 S609에서, 사료 관리 서비스 제공 장치는 사료의 잔여량을 기초로 사용자 장치에 사료 관리 서비 스를 제공할 수 있다."}
{"patent_id": "10-2025-0050338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상에서 본 발명의 대표적인 실시예들을 상세하게 설명하였으나, 본 발명이 속하는 기술분야에서 통상의 지식 을 가진 자는 상술한 실시예에 대하여 본 발명의 범주에서 벗어나지 않는 한도 내에서 다양한 변형이 가능함을 이해할 것이다. 그러므로 본 발명의 권리범위는 설명된 실시예에 국한되어 정해져서는 안 되며, 후술하는 특허 청구범위뿐만 아니라 이 특허청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2025-0050338", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 사료 관리 서비스 제공 시스템의 구성도이다. 도 2는 본 발명의 일 실시 예에 따른 사료 관리 서비스 제공 장치의 구성도이다. 도 3은 본 발명의 일 실시 예에 따른 사료 측정 거리 값을 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시 예에 따른 오차 보정 모델의 학습 과정을 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시 예에 따른 사료 관리 서비스를 제공하는 예를 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시 예에 따른 사료 관리 서비스 제공 방법을 설명하기 위한 순서도이다."}
