{"patent_id": "10-2023-0070165", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0171788", "출원번호": "10-2023-0070165", "발명의 명칭": "작업자 출입관리장치 및 출입관리시스템", "출원인": "유강훈", "발명자": "유강훈"}}
{"patent_id": "10-2023-0070165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "작업자단말 또는 출입관리서버와 통신하는 통신부;주변의 온도, 습도, 소리, 조도 및 가스농도 중 적어도 하나 이상을 포함하는 환경정보를 감지하는 환경정보관리부;작업자의 식별정보를 감지하는 식별정보감지부; 및상기 환경정보를 기 설정된 시간주기로 상기 출입관리서버로 전송하고, 상기 작업자의 식별정보를 기 저장된 건강정보와 비교하여 일치하지 않는 경우 상기 작업자단말 또는 상기 출입관리서버로 경고신호를 출력하는 제어부를 포함하는 작업자 출입관리장치."}
{"patent_id": "10-2023-0070165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,작업자가 착용한 의복, 장갑 및 장화 중 적어도 하나 이상을 포함하는 착용품에 형성된 식별태그를 인식하여 획득한 제1 식별정보와, 상기 작업자단말에서 출력되는 제2 식별정보를 비교하여 동일한지 여부를 판단하는 작업자 출입관리장치."}
{"patent_id": "10-2023-0070165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,진동소자 또는 팬을 이용하여 주변의 이물질을 제거하는 이물질제거부를 더 포함하는 작업자 출입관리장치."}
{"patent_id": "10-2023-0070165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 또는 제2항에 있어서,상기 시설 내의 영상정보를 획득하는 영상획득부를 더 포함하고,상기 제어부는,상기 환경정보 중 소리정보의 세기나 주파수가 기 설정된 정상범위를 초과하는 경우 상기 영상정보를 획득하도록 하여 상기 출입관리서버로 전송하는 작업자 출입관리장치."}
{"patent_id": "10-2023-0070165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "작업자가 사용하는 작업자단말;상기 작업자단말과 통신하는 출입관리서버; 및상기 작업자단말 또는 상기 출입관리서버와 통신하는 통신부와, 주변의 온도, 습도, 소리, 조도 및 가스농도 중적어도 하나 이상을 포함하는 환경정보를 감지하는 환경정보관리부와, 작업자의 식별정보를 감지하는 식별정보감지부와, 상기 환경정보를 기 설정된 시간주기로 상기 출입관리서버로 전송하고, 상기 작업자의 식별정보를 기저장된 건강정보와 비교하여 일치하지 않는 경우 상기 작업자단말 또는 상기 출입관리서버로 경고신호를 출력하는 제어부로 구성되는 출입관리장치를 포함하는 출입관리시스템."}
{"patent_id": "10-2023-0070165", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 작업자 출입관리장치 및 출입관리시스템에 관한 것으로, 본 발명의 실시예에 따른 작업자 출입관리장 치는, 작업자단말 또는 출입관리서버와 통신하는 통신부와, 주변의 온도, 습도, 소리, 조도 및 가스농도 중 적어 도 하나 이상을 포함하는 환경정보를 감지하는 환경정보감지부와, 작업자의 식별정보를 감지하는 식별정보감지부 와, 상기 환경정보를 기 설정된 시간주기로 상기 출입관리서버로 전송하고, 상기 작업자의 식별정보를 기 저장된 건강정보와 비교하여 일치하지 않는 경우 상기 작업자단말 또는 상기 출입관리서버로 경고신호를 출력하는 제어 부를 포함한다."}
{"patent_id": "10-2023-0070165", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 작업자 출입관리장치 및 출입관리시스템에 관한 것으로, 더욱 상세하게는 축사나 공장 등의 제한구역 에 출입하는 출입자를 관리하는 기술이 개시된다."}
{"patent_id": "10-2023-0070165", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "축산농가나 양돈장에서는 차단방역이 매우 중요하다. 차단방역을 철저하게 지켜지지 않는 경우 질병이 유입되어 가축이 집단 감염되어 폐사하는 경우가 발생한다. 이러한 차단방역은 외부인의 출입이 가장 위험하며, 축사 내 에서도 구역에 따라 작업자의 출입의 제한이 필요하다. 어느 한 구역에서 작업하는 작업자가 착용한 장화나 장 갑 등에 가축으로부터 분비된 분비물이 묻은 상태에서 다른 구역으로 이동하는 경우 해당 분비물에 포함된 질병 이 자연스럽게 다른 구역으로 이동하기 때문이다. 또한, 공장생산설비에서도 작업자의 이동관리가 중요하다. 특히 반도체 등 정밀공정을 수행하는 경우 각 구역 에 따라 엄격한 출입통제가 필요하다. 그러나, 내부의 작업자 간에 서로 다른 구역을 교차하여 이동하는 경우 가 빈번하게 있어 문제가 발생하고 있다. 특히, 작업자를 통해 이물질이 유입되거나, 다른 구역의 작업자로 인 해 기술이 유출되는 등의 문제점을 해결하기 위해서는 구열별로 허가된 작업자만 이용할 수 있도록 통제가 필요 하다. 종래의 기술 중 대한민국 공개특허 제10-2021-0091005호(2021년 7월 21일 공개)는 가축 전염병 전파 예방을 위 한 출입자 관리 시스템 및 방법에 관한 것으로, 가축의 구제역 예방 및 구제역 발생시 초동 대응을 위해 Beacon(Bluetooth Low Energy: BLE)과 다양한 센서, UWB(Ultra Wide Band; UWB), 그리고 RF 식별 정보 기술을 융합한 농장 출입자 관리 시스템과 그 운용방법에 대한 것으로서, 농장으로 출입하는 방문자와 작업자들을 실시 간으로 관리함으로써, 인근 축사에서의 구제역 발생이 발생했을 때 확산을 막기 위한 기술이 개시된다. 그러나, 상기 종래의 기술은 비콘을 이용하여 출입을 관리하다가 비콘이 분실되거나, 타인의 비콘을 이용하는 경우 등 부정사용으로 인한 출입자 관리가 어려워지는 한계가 있다."}
{"patent_id": "10-2023-0070165", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 해결하고자 하는 기술적 과제는 시설 내부의 환경정보를 실시간으로 감지하면서, 작업자의 식별정보 를 획득하여 출입자를 관리할 수 있는 작업자 출입관리장치 및 출입관리시스템을 제공하기 위함이다. 또한, 시설 내부에서 발생하는 이물질로 오염되는 경우 진동소자나 팬을 이용하여 이물질을 제거할 수 있는 작 업자 출입관리장치 및 출입관리시스템을 제공하기 위함이다. 또한, 시설 내부의 환경정보를 감시하여 이벤트가 발생한 경우 영상정보를 획득하여 출입관리서버로 전송할 수 있는 작업자 출입관리장치 및 출입관리시스템을 제공하기 위함이다. 또한, 시설 내에 작업하는 작업자의 건강상태를 분석하여 건강위험을 조기에 경고할 수 있는 작업자 출입관리장 치 및 출입관리시스템을 제공하기 위함이다."}
{"patent_id": "10-2023-0070165", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 작업자 출입관리장치는, 작업자단말 또는 출입관리서버와 통신하는 통신부와, 주변의 온도, 습도, 소리, 조도 및 가스농도 중 적어도 하나 이상을 포함하는 환경정보를 감지하는 환경정보감지부와, 작업자의 식별정보를 감지하는 식별정보감지부와, 상기 환경정보를 기 설정된 시간주기로 상기 출입관리서버로 전송하고, 상기 작업자의 식별정보를 기 저장된 건강정보와 비교하여 일치하지 않는 경우 상기 작업자단말 또는 상기 출입관리서버로 경고신호를 출력하는 제어부를 포함한다. 또한, 상기 제어부는 작업자가 착용한 의복, 장갑 및 장화 중 적어도 하나 이상을 포함하는 착용품에 형성된 식 별태그를 인식하여 획득한 제1 식별정보와, 상기 작업자단말에서 출력되는 제2 식별정보를 비교하여 동일한지 여부를 판단할 수 있다. 또한, 진동소자 또는 팬을 이용하여 주변의 이물질을 제거하는 이물질제거부를 더 포함할 수 있다. 또한, 상기 시설 내의 영상정보를 획득하는 영상획득부를 더 포함하고, 상기 제어부는 상기 환경정보 중 소리정 보의 세기나 주파수가 기 설정된 정상범위를 초과하는 경우 상기 영상정보를 획득하도록 하여 상기 출입관리서 버로 전송할 수 있다.한편, 본 발명의 또 다른 실시예에 따른 출입관리시스템은 작업자가 사용하는 작업자단말과, 상기 작업자단말과 통신하는 출입관리서버와, 상기 작업자단말 또는 상기 출입관리서버와 통신하는 통신부와, 주변의 온도, 습도, 소리, 조도 및 가스농도 중 적어도 하나 이상을 포함하는 환경정보를 감지하는 환경정보감지부와, 작업자의 식 별정보를 감지하는 식별정보감지부와, 상기 환경정보를 기 설정된 시간주기로 상기 출입관리서버로 전송하고, 상기 작업자의 식별정보를 기 저장된 건강정보와 비교하여 일치하지 않는 경우 상기 작업자단말 또는 상기 출입 관리서버로 경고신호를 출력하는 제어부로 구성되는 출입관리장치를 포함한다."}
{"patent_id": "10-2023-0070165", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이에 따라, 시설 내부의 환경정보를 실시간으로 감지하면서, 작업자의 식별정보를 획득하여 출입자를 관리할 수 있다. 또한, 시설 내부에서 발생하는 이물질로 오염되는 경우 진동소자나 팬을 이용하여 이물질을 제거할 수 있다. 또한, 시설 내부의 환경정보를 감시하여 이벤트가 발생한 경우 영상정보를 획득하여 출입관리서버로 전송할 수 있다. 또한, 시설 내에 작업하는 작업자의 건강상태를 분석하여 건강위험을 조기에 경고할 수 있다."}
{"patent_id": "10-2023-0070165", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명의 실시예를 상세하게 설명한다. 사용되는 용어들은 실시예에서의 기 능을 고려하여 선택된 용어들로서, 그 용어의 의미는 사용자, 운용자의 의도 또는 판례 등에 따라 달라질 수 있 다. 그러므로 후술하는 실시예들에서 사용된 용어의 의미는, 본 명세서에 구체적으로 정의된 경우에는 그 정의 에 따르며, 구체적인 정의가 없는 경우는 당업자들이 일반적으로 인식하는 의미로 해석되어야 할 것이다. 도 1은 본 발명의 실시예에 따른 출입관리시스템의 구성도이다. 도 1을 참조하면, 본 발명의 실시예에 따른 출입관리시스템은 작업자단말, 출입관리서버 및 출입관리장 치를 포함한다. 작업자단말은 작업자가 사용하는 단말이다. 작업자단말은 출입관리서버나 출입관리장치와 통 신이 가능하다. 이 경우, 블루투스, 와이파이와 같은 근거리통신이나 LTE, LoRa와 같은 장거리통신이 가능할 수 있다. 작업자단말은 NFC통신 방식으로 출입관리장치와 통신하는 것도 가능하다. 작업자단말 은 디스플레이트를 통해 식별정보를 표시하는 것도 가능하다. 여기서, 식별정보는 바코드, 큐알코드와 같은 형 태일 수 있으나, 반드시 이에 한정하는 것은 아니다. 또한, 작업자단말은 웨어러블 형태로 작업자가 손목이나 목 등에 착용하는 형태로도 구현이 가능하다. 작 업자단말에는 체온, 심박수, 걸음수, 산소포화도, 홍채인식 등 건강정보를 획득할 수 있는 것이 바람직하다. 이는 시설 내에서 작업하는 작업자의 건강상태를 모니터링하기 위함이다. 작업자단말은 출입 관리장치나 출입관리서버로 건강정보를 전송할 수 있다. 이에 따라, 원격에서 작업자의 건강정보를 확인하고, 위험을 조기에 발견하여 경고할 수 있다. 출입관리서버는 원격에서 출입관리장치를 통해 작업자의 근무위치나 건강상태를 관리한다. 출입관리 서버는 작업자단말이나 출입관리장치와 통신한다. 출입관리서버는 시설 내에 설치된 출입관 리장치로부터 시설 내부의 환경정보를 수집할 수 있다. 여기서, 환경정보는 온도, 습도, 조도, 가스농도 등을 포함할 수 있다. 출입관리서버는 시설 내의 환경정보가 위험범위에 해당하면 이를 작업자나 관리자에 게 경고할 수 있다. 출입관리서버는 작업자의 건강정보를 작업자단말이나 출입관리장치를 통해 수신하고, 작업자의 건강정보가 건강위험영역에 해당하면 이를 해당 작업자나 관리자에게 경고할 수 있다. 출입관리장치는 시설 내에 설치되어 시설 내부의 환경정보를 수집하고, 작업자의 출입을 관리한다. 출입 관리장치는 작업자단말이나 출입관리서버와 통신할 수 있다. 출입관리장치는 작업자가 착용 한 의복, 신발, 장갑, 안전모 등의 착용품에 형성된 식별태그를 인식할 수 있다. 출입관리장치는 식별태그에 저장된 식별정보를 통해 작업자를 인증하여 출입을 관리할 수 있다. 이 경우, 출입관리장치 는 착용품에 형성된 RFID 태그나 큐알코드 등의 식별태그를 스캔하여 획득할 수 있다. 식별정보 에는 작업자의 이름, 연락처, 고유번호 등 작업자를 식별할 수 있는 정보를 포함할 수 있다. 또한, 출입관리장치는 작업자단말로부터 식별정보를 획득하는 것도 가능하다. 작업자단말을 출입 관리장치에 접촉 또는 비접촉 형태로 근접시켜 식별정보가 식별되도록 할 수 있다. 출입관리장치는 이동통신서비스를 통해 작업자의 주민번호나 이통통신번호를 인증하도록 한 후 작업자단말에 식별정보가 저 장되도록 할 수 있다. 출입관리장치는 작업자의 착용품으로부터 제1 식별정보와, 작업자단말로부 터 제2 식별정보를 획득하여 서로 비교함으로써 작업자를 인증하는 것도 가능하다. 출입관리장치는 식별 정보를 통해 작업자가 인증되지 않는 경우 경고신호를 출력하고, 출입관리서버 등으로 경고신호를 전송할 수 있다. 이하, 출입관리장치에 대해 구체적으로 설명하도록 한다. 도 2는 본 발명의 실시예에 따른 작업자 출입관리장치의 구성도이고, 도 3은 도 2에 따른 작업자 출입관리장치 에서 환경정보르 수집하여 제공하는 것을 설명하기 위한 예시도이고, 도 4는 도 2에 따른 작업자 출입관리장치 가 작업자의 착용품에 형성된 식별태그를 인식하는 출입자를 관리하는 것을 설명하기 위한 예시도이고, 도 5는 도 2에 따른 작업자 출입관리장치에서 작업자단말로 식별정보링크를 전송하고, 작업자의 생체정보를 입력받도록 하는 것을 설명하기 위한 예시도이고, 도 6은 도 2에 따른 작업자 출입관리장치에서 작업자의 건강정보를 관리 하여 작업자단말로 전송하는 것을 설명하기 위한 예시도이다. 도 2 내지 도 6을 참조하면, 본 발명의 실시예에 따른 작업자 출입관리장치는 통신부, 환경정보감지 부, 식별정보감지부 및 제어부를 포함한다. 통신부는 작업자단말 또는 출입관리서버와 통신한다. 예를 들어, 통신부는 블루투스, 지그 비, 와이파이(WIFI), LTE 중 적어도 하나 이상의 통신모듈로 구현할 수 있다. 통신부는 작업자단말과 는 근거리통신을 하고, 출입관리서버와는 장거리통신을 하도록 설정되는 것도 가능하다. 통신부는 작 업자단말과 통신하여 작업자의 출입정보를 전송하거나, 환경정보를 출입관리서버로 전송할 수 있다. 통신부는 출입관리서버로부터 경고신호를 수신하여 작업자단말에 전송하는 것도 가능하다. 또한, 통신부는 작업자단말이 작업자가 착용하는 웨어러블 형태인 경우 상기 작업자단말로부터 작 업자의 온도, 심박수, 산호포화도 및 걸음수 중 적어도 하나 이상을 포함하는 건강정보를 수신할 수 있다. 통 신부는 이러한 건강정보를 제어부로 출력한다. 건강정보는 작업자의 건강상태를 관리하기 위해 사용 된다. 이 경우, 통신부는 외부의 출입관리서버로 건강정보를 전송하는 것도 가능하다. 이러한 건강 정보는 작업자가 어느 구역에서 위치하면서 건강상태를 파악하여 위험시 이를 경고할 수 있다. 환경정보감지부는 시설 내부의 온도, 습도, 소리, 조도 및 가스농도 중 적어도 하나 이상을 포함하는 환경 정보를 감지한다. 예를 들어, 환경정보관리부는 온도센서, 습도센서, 소리센서, 조도센서 및 가스센서 중 적어도 하나 이상으로 구현할 수 있다. 환경정보관리부는 시설 내부의 환경정보를 실시간으로 감지한다. 이러한 환경정보는 출입관리서버로 전송되어 시설 내부의 환경정보를 외부의 관리자가 확인할 수 있도록 한다. 환경정보관리부는 제어부로 환경정보를 출력하고, 제어부는 이를 기초로 시설 내 환경의 위험 여부를 판단할 수 있다. 환경정보관리부는 환경정보에 위치정보 및 시간정보를 함께 포함하여 관리 할 수 있다. 식별정보감지부는 작업자의 식별정보를 감지한다. 여기서 식별정보는 작업자의 의복 등의 착용품이나 작업자단말에 표시되는 RFID, 큐알코드 등의 식별태그에 저장된 작업자의 고유정보를 의미한다. 이러 한 식별정보는 고유한 정보로 작업자가 착용한 의복, 신발, 모자 등에 큐알코드 같은 형태로 표시될 수도 있다. 예를 들어, 식별정보감지부는 RFID리더기나 큐알코드 스캐너와 같은 형태로 구현할 수 있다. 식별정보감 지부는 작업자의 이동경로를 파악하기 위해 사용된다. 예를 들어, 특정 작업자만 출입할 수 있는 구역에 허가되지 않은 작업자가 진입하는지 여부를 확인할 수 있다. 식별정보감지부는 작업자의 식별정보를 제어 부로 출력한다. 제어부는 작업자 출입관리장치를 제어하는 MCU(Micro Control Unit)이다. 제어부는 환경정보 를 기 설정된 시간주기로 출입관리서버로 전송한다. 제어부는 환경정보를 기 설정된 위험정보와 비교 하여 경고신호를 생성하는 것도 가능하다. 여기서, 위험정보는 시설 내에서 유지되어야 하는 환경정보를 초과 한 경우에 해당하는 정보이다. 제어부는 경광등이나 싸이렌을 이용하여 경고신호를 출력하는 것도 가능하 다. 이 경우, 해당 구역의 작업자는 시설 내 환경정보의 이상을 판단하여 필요한 조치를 신속하게 처리할 수 있다. 또한, 제어부는 작업자의 식별정보를 기 저장된 건강정보와 비교하여 일치 여부를 판단할 수 있다. 예를 들어, 제어부는 작업자의 식별정보와 건강정보가 일치하지 않는 경우 작업자단말 또는 출입관리서버 로 경고신호를 출력한다. 이는 외부의 관리자나 해당 작업자에게 허가되지 않은 구역의 출입을 인지시켜 해당 구역에서 벗어나도록 하기 위함이다. 제어부는 경광등이나 싸이렌을 이용하여 허가되지 않은 작업자 가 시설 내 특정 구역으로 진입시 이를 작업자에게 경고하는 것도 가능하다. 또한, 제어부는 작업자로부터 복수의 식별정보를 획득하여 비교하는 것도 가능하다. 예를 들어, 제어부 는 작업자가 착용한 의복이나 신발 등에 형성된 제1 식별정보를 인식하고, 작업자단말로부터 제2 식별 정보를 인식하여 서로 비교할 수 있다. 예를 들어, 작업자의 의복이나 장화에는 RFID태그가 제1 식별정보로 형 성되고, 작업자단말에는 큐알코드가 제2 식별정보로 표시될 수 있다. 이러한 제1 식별정보와 제2 식별정보 는 작업자가 동일인인지 여부를 판단하기 위해 사용된다. 제어부는 제1 식별정보와 제2 식별정보가 일치 하지 않는 경우 출입관리서버를 통해 경고신호를 출력하거나, 자체적으로 경광등이나 싸이렌을 이용하여 경 고신호를 출력할 수 있다. 또한, 제어부는 작업자단말로 제2 식별정보를 생성할 수 있는 기 설정된 식별링크를 전송할 수 있다. 이 경우, 통신부를 통해 작업자단말로 식별링크가 전송된다. 예를 들어, 작업자단말에는 출입관 리장치와 통신할 수 있는 전용 어플리케이션이 설치될 수 있다. 작업자는 작업자단말을 통해 해당 식 별링크를 확인하고 이를 자신의 생체정보와 결합하여 제2 식별정보를 생성하도록 할 수 있다. 이는 작업자의 생체정보를 추가하여 강화된 제2 식별정보를 생성하도록 하기 위함이다. 이 경우, 타인이 작업자단말을 대 신 이용하는 경우에도 생체정보가 일치하지 않아 인증이 이뤄지지 않게 된다. 여기서, 생체정보로 지문정보, 얼굴정보, 홍채정보 및 목소리정보 중 적어도 하나 이상이 사용될 수 있다. 또한, 제어부는 작업자의 건강상태를 관리하는 것도 가능하다. 제어부는 작업자의 온도, 심박수, 산 호포화도 및 걸음수 중 적어도 하나 이상을 포함하는 건강정보를 분석할 수 있다. 이러한 건강정보는 앞서 설 명한 바와 같이 웨어러블 형태의 작업자단말로부터 획득하는 것이 가능하다. 제어부는 작업자의 건강 상태가 기 설정된 건강위험범위인 경우 경고신호를 생성한다. 제어부는 경고신호를 작업자단말이나 출입관리서버로 전송할 수 있다. 제어부는 경광등이나 싸이렌을 통해 직접 경고신호를 출력하는 것도 가능하다. 이에 따라, 시설 내에 작업하는 작업자의 건강상태를 분석하여 건강위험을 조기에 경고할 수 있다. 또한, 제어부는 작업자의 이동패턴을 분석하여 건강상태를 관리하는 것도 가능하다. 예를 들어, 제어부 는 작업자의 출입기록의 패턴을 인공지능 알고리즘을 이용하여 기계적으로 학습할 수 있다. 제어부 는 작업자의 출입패턴이 인공지능으로 학습된 정상패턴 범위를 초과하는 경우 경고신호를 작업자단말이나 외부의 출입관리서버로 전송할 수 있다. 이에 따라, 자동적으로 작업자의 이동패턴이 비정상적인 경우 조 기에 이를 경고하고 사고를 방지할 수 있다. 또한, 제어부는 시설 내부의 출입문의 도어락과 연결되어 이를 제어하는 것도 가능하다. 예를 들어, 제어 부는 평상시에 출입문을 폐쇄상태로 유지하고, 작업자의 식별정보를 획득하여 인증되면 출입문을 개방시킬 수 있다. 이는 인증된 작업자만 출입이 가능하도록 하기 위함이다. 제어부는 출입문의 개폐정보를 출입 관리서버로 전송할 수 있다. 이는 원격의 관리자가 시설 내부의 출입문의 개폐상황을 확인할 수 있도록 하 기 위함이다. 도 7은 도 2에 따른 작업자 출입관리장치에 이물질제거부가 추가되는 것을 설명하기 위한 예시도이다. 도 7을 참조하면, 본 발명의 실시예에 따른 작업자 출입관리장치는 이물질제거부를 더 포함할 수 있다. 이물질제거부는 진동소자와 팬(FAN)을 이용하여 출입관리장치의 이물질을 제거할 수 있다. 이물질제 거부의 진동소자는 본체 내부나 각종 센서에 먼지 등의 이물질이 쌓이는 것을 털어내는 역할을 한다. 이 물질제거부의 팬은 이물질을 외부로 불어내는 역할을 한다. 이는 시설 내에 설치되는 출입관리장치 가 각종 분진 등의 이물질에 의해 오염되어 환경정보를 수집하는 센서들이 성능이 저하되는 것을 방지하기 위함 이다. 이물질제거부는 기 설정된 시간주기로 진동소자나 팬을 이용하여 이물질을 자체적으로 제거할 수 있다. 이 경우, 제어부는 기 설정된 시간주기로 이물질제거부를 구동하도록 제어할 수 있다. 제어부(14 0)는 환경정보수집부를 통해 출입관리장치 내부의 온도를 측정하여 기 설정치를 초과하는 경우 이물질제거 부를 구동시켜 이물질을 제거하도록 할 수도 있다. 이는 이물질에 의해 제어부의 회로가 과열되거나, 환경정보를 수집하는 센서들이 성능이 떨어지는 것을 방지하기 위함이다. 이에 따라, 출입관리장 치의 오염이나 이물질에 의해 과열로 인한 화재의 위험성을 줄일 수 있다. 도 8은 도 2에 따른 작업자 출입관리장치에 영상획득부, 방역부 및 발전부 중 적어도 하나 이상 이 추가되는 것을 설명하기 위한 예시도이다. 한편, 본 발명의 실시예에 따른 작업자 출입관리장치는 영상획득부를 더 포함할 수 있다. 영상획득 부는 카메라를 이용하여 시설 내부의 영상을 획득할 수 있다. 이 경우, 영상획득부는 적외선 카메라 를 추가로 탑재하여 야간에도 영상을 획득할 수 있다. 영상획득부는 시설 내부의 상황을 감시하거나, 작 업자를 식별하기 위해 영상정보를 획득할 수 있다. 영상획득부는 작업자의 식별정보를 획득하면서 출입하 는 작업자의 영상을 획득하는 것도 가능하다. 영상획득부는 획득된 영상정보를 제어부로 출력한다. 이 경우, 제어부는 영상정보를 외부의 출입관리서버로 전송한다. 영상정보는 일정기간 출입관리장치 의 내부 메모리를 통해 저장될 수 있다. 제어부는 외부의 출입관리서버로 영상정보획득요청이 있는 경우 영상획득부를 구동시킬 수 있다. 제어부는 시설 내부의 환경정보에 따라 영상획득부(16 0)를 구동시키는 것도 가능하다. 예를 들어, 환경정보 중 소리정보의 세기나 주파수가 기 설정된 정상범위를 초과하는 경우 영상획득부를 자동으로 구동시킬 수 있다. 이는 시설 내의 이벤트를 감지하여 자동으로 영 상으로 획득하여 출입관리서버로 전송하기 위함이다. 한편, 본 발명의 실시예에 따른 작업자 출입관리장치는 방역부를 더 포함할 수 있다. 방역부는 시설에 접근하는 작업자을 방역하는 역할을 한다. 예를 들어, 방역부는 작업자에게 소독액 을 분사하거나, 자외선을 조사할 수 있다. 바람직하게는 작업자의 손이나 발에 소독액이나 자외선을 출력한다. 방역부는 시설 내 전염병의 유입을 차단하기 위해 방열을 처리한다. 방역부는 작업자가 인증되는 경 우 방역을 처리하는 것이 바람직하다. 이에 따라, 작업자의 이동시 소독액이나 자외선을 이용하여 전염병의 유 입을 최소화시킬 수 있다. 이 경우, 제어부는 방역부의 기능을 제어한다. 제어부는 작업자의 식별정보가 기 저장된 작업 자정보와 일치하는 경우 방역부를 구동시킬 수 있다. 이 경우, 방역부의 구동시간은 사용자의 설정 에 의해 가변될 수 있다. 제어부는 방역부에 저장된 소독액이 소진되는 경우 통신부를 통해 작 업자단말이나 출입관리서버로 경고신호를 전송할 수 있다. 이에 따라, 작업자에 대한 방역을 진행하여 전염병 위험을 낮출 수 있으며, 소독액 등의 소진시 신속하게 이를 조치할 수 있다. 또한, 제어부는 작업자별 방역 여부를 기록할 수 있다. 이는 어떤 작업자에게 방역을 실시하였는지 관리 하기 위함이다. 예를 들어, 전염병이 발생한 경우 어느 작업자의 출입이 있었는지, 해당 작업자의 방역이 이뤄 졌는지 추적조사가 가능하다. 제어부는 전염병 발병 지역의 작업자의 방역기록을 외부의 출입관리서버 로 전송할 수 있다. 이에 따라, 여러 시설에 출입하는 작업자의 경우 그 이동동선과 작업패턴을 정확하게 확인할 수 있다. 전염병이 발병된 시설을 방문한 작업자가 사후에 어느 시설을 방문하였는지, 방역이 이뤄졌는 지 여부를 확인함으로써 추가적인 방역확산 조치를 취할 수 있다. 한편, 본 발명의 실시예에 따른 작업자 출입관리장치는 발전부를 더 포함할 수 있다. 발전부는 압전소자를 이용하여 전기를 생산할 수 있다. 발전부는 발판에 형성되어 작업자가 발판을 밟는 경우 압전소자를 통해 전기를 생산하도록 한다. 발전부는 생산된 전기를 이용하여 통신부, 제 어부 등 전체적으로 전기를 공급할수 있다. 이는 이동이 많은 시설 내에 설치하는 것이 효과적이다. 발 전부는 작업자들이 이동하면서 자연스럽게 전기를 발생하도록 함으로써 전기사용을 최소화할 수 있으며, 친환경 방법으로 출입자를 관리할 수 있다. 이 경우, 제어부는 발전부에서 생산된 전기를 이용하여 전원으로 이용할 수 있다. 제어부는 발 전부의 전기저장용량이 기 설정치를 초과하는 경우 이를 방전시켜 통신부 등의 내부 전력원을 사용할 수 있다. 이에 따라, 정전시와 같이 전력공급의 차질이 발생하는 등 사고가 발생하면 신속히 이를 대체할 수 있다. 또한, 발전부는 외부의 태양전지판(도시하지 않음)과 연결되어 전력을 공급하는 것도 가능하다. 이상에서 본 발명은 도면을 참조하면서 기술되는 바람직한 실시예를 중심으로 설명되었지만 이에 한정되는 것은 아니다. 따라서 본 발명은 기재된 실시예로부터 도출 가능한 자명한 변형예를 포괄하도록 의도된 특허청구범위 의 기재에 의해 해석되어져야 한다."}
{"patent_id": "10-2023-0070165", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 출입관리시스템의 구성도이다. 도 2는 본 발명의 실시예에 따른 작업자 출입관리장치의 구성도이다. 도 3은 도 2에 따른 작업자 출입관리장치에서 환경정보르 수집하여 제공하는 것을 설명하기 위한 예시도이다. 도 4는 도 2에 따른 작업자 출입관리장치가 작업자의 착용품에 형성된 식별태그를 인식하는 출입자를 관리하는 것을 설명하기 위한 예시도이다. 도 5는 도 2에 따른 작업자 출입관리장치에서 작업자단말로 식별정보링크를 전송하고, 작업자의 생체정보를 입 력받도록 하는 것을 설명하기 위한 예시도이다. 도 6은 도 2에 따른 작업자 출입관리장치에서 작업자의 건강정보를 관리하여 작업자단말로 전송하는 것을 설명 하기 위한 예시도이다. 도 7은 도 2에 따른 작업자 출입관리장치에 이물질제거부가 추가되는 것을 설명하기 위한 예시도이다. 도 8은 도 2에 따른 작업자 출입관리장치에 영상획득부, 방역부 및 발전부 중 적어도 하나 이상이 추가되는 것 을 설명하기 위한 예시도이다."}
