{"patent_id": "10-2021-0167694", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0080197", "출원번호": "10-2021-0167694", "발명의 명칭": "인공지능 기반 정보 추출 및 활용 시스템", "출원인": "양승찬", "발명자": "양승찬"}}
{"patent_id": "10-2021-0167694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대상 상품과 관련된 정보를 포함하는 홈페이지의 URL(Uniform Resource Locator)을 수집하는 URL 수집부;수집된 URL을 갖는 상기 홈페이지 내의 웹페이지들 중 상기 대상 상품의 상세 정보를 포함하는 웹페이지를 분류하는 웹페이지 분류부; 및인공지능 모델을 기반으로, 분류된 상기 대상 상품의 상세 정보를 포함하는 웹페이지에서 상기 대상 상품에 대해 요구되는 정보의 카테고리 및/또는 밸류를 추출하고, 추출된 데이터를 기반으로 상기 인공지능 모델을 학습시키는 정보 추출부;을 포함하는 인공지능 기반 정보 추출 및 활용 시스템."}
{"patent_id": "10-2021-0167694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 인공지능 모델은, 이미지, 단어(text) 및 단어 뭉치, 문장, 문단을 포함하는 문구(text phrase)가 상기 대상 상품에 대해 요구되는 정보에 해당하는지 판별하도록 학습된 것을 특징으로 하는 인공지능 기반 정보 추출 및 활용 시스템."}
{"patent_id": "10-2021-0167694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 인공지능 모델은,이미지, 단어(text) 및 단어 뭉치, 문장, 문단을 포함하는 문구(text phrase)의 카테고리와 밸류 및 그에 대한xpath를 판별하도록 학습된 것을 특징으로 하는 인공지능 기반 정보 추출 및 활용 시스템."}
{"patent_id": "10-2021-0167694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 정보 추출부는,상기 인공지능 모델의 추출 결과를 기반으로, DOM 트리에서 밸류를 갖는 리프 노드(leaf node)로부터 바텀-업(bottom-up) 방식으로 상향식 판단을 수행하여 상기 대상 상품에 대해 요구되는 정보를 추출하는 것을 특징으로하는 인공지능 기반 정보 추출 및 활용 시스템."}
{"patent_id": "10-2021-0167694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 정보 추출부는,상기 인공지능 모델의 추출 결과를 기반으로, DOM 트리에서 임의의 노드에 대한 밸류 또는 카테고리의 판단 결과에 따라 타 노드의 밸류 또는 카테고리의 판단을 수행하는 것을 특징으로 하는 인공지능 기반 정보 추출 및활용 시스템."}
{"patent_id": "10-2021-0167694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 상기 정보 추출부는,DOM 트리에서 임의의 노드가 헤더, 푸터를 포함하는 보일러플레이트(boilerplate)로 판단되지 않고 상기 대상상품에 대해 요구되는 정보로 판단된 노드와의 거리가 사전 설정된 임계값 보다 작은 경우, 해당 노드를 상기대상 상품에 대해 요구되는 정보인 것으로 판단하는 것을 특징으로 하는 인공지능 기반 정보 추출 및 활용 시스템."}
{"patent_id": "10-2021-0167694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서, 상기 웹페이지 분류부는,공개특허 10-2023-0080197-3-상기 웹페이지의 DOM(Document Object Model) 트리(tree), 상기 웹페이지별로 사용하는 CSS(Cascading StyleSheets) 및 스타일 태그, 상기 웹페이지의 구조-템플릿, 상기 웹페이지의 구조-보일러플레이트(structure-boilerplate) 및 상기 웹페이지에 존재하는 이미지, 단어, 문구 및 테이블을 포함하는 요소들 중 적어도 하나를기반으로 상기 웹페이지를 분류하는 것을 특징으로 하는 인공지능 기반 정보 추출 및 활용 시스템."}
{"patent_id": "10-2021-0167694", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "대상 상품과 관련된 정보를 포함하는 홈페이지의 URL(Uniform Resource Locator)을 수집하는 URL 수집부; 수집 된 URL을 갖는 상기 홈페이지 내의 웹페이지들 중 상기 대상 상품의 상세 정보를 포함하는 웹페이지를 분류하는 웹페이지 분류부; 및 인공지능 모델을 기반으로, 분류된 상기 대상 상품의 상세 정보를 포함하는 웹페이지에서 상기 대상 상품에 대해 요구되는 정보의 카테고리 및/또는 밸류를 추출하고, 추출된 데이터를 기반으로 상기 인 공지능 모델을 학습시키는 정보 추출부를 포함하는 인공지능 기반 정보 추출 및 활용 시스템이 개시된다."}
{"patent_id": "10-2021-0167694", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 정보 추출 및 활용 시스템에 관한 것으로, 더욱 상세하게는 인터넷 기반의 방대한 정 보 바다에서 원하는 상품에 대해 필요한 정보를 용이하게 추출하고 추출된 정보를 활용하여 해당 상품에 대한 다양한 컨텐츠를 제작 및 서비스할 수 있는 인공지능 기반 정보 추출 및 활용 시스템에 관한 것이다."}
{"patent_id": "10-2021-0167694", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보의 바다라 불리는 인터넷은 매우 다양하고 방대한 정보가 곳곳에 산재하여 원하는 정보를 획득하고자 할 때 많은 시간과 노력이 요구된다. 예를 들어, 특정 상품에 대해 원하는 정보를 얻고자 하는 경우, 해당 상품의 생산하는 생산자나 해당 상품의 판 매자가 운영하는 홈페이지에 일일이 접속하여야 하며, 홈페이지에 접속한 이후에도 해당 홈페이지 내에서 원하 는 정보를 얻기 위해서는 홈페이지에 마련된 여러 웹페이지들을 확인하여 원하는 정보가 있는지 확인하여야 한 다. 따라서, 인터넷 환경에서 원하는 정보를 획득하기 위해서는 많은 시간과 노력이 소요되는 문제가 발생한다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2021-0042271호 (특허문헌 0002) 한국공개특허 제10-2021-0092979호 (특허문헌 0003) 한국등록특허 제10-2198904호"}
{"patent_id": "10-2021-0167694", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에, 본 발명은 인터넷 기반의 방대한 정보 바다에서 원하는 상품에 대해 필요한 정보를 용이하게 추출하고 추 출된 정보를 활용하여 해당 상품에 대한 다양한 컨텐츠를 제작 및 서비스할 수 있는 인공지능 기반 정보 추출 및 활용 시스템을 제공하는 것을 해결하고자 하는 기술적 과제로 한다."}
{"patent_id": "10-2021-0167694", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 대상 상품과 관련된 정보를 포함하는 홈페이지의 URL(Uniform Resource Locator)을 수집하는 URL 수집부; 수집된 URL을 갖는 상기 홈페이지 내의 웹페이지들 중 상기 대상 상품의 상세 정보를 포함하는 웹페이지를 분류 하는 웹페이지 분류부; 및 인공지능 모델을 기반으로, 분류된 상기 대상 상품의 상세 정보를 포함하는 웹페이지에서 상기 대상 상품에 대 해 요구되는 정보의 카테고리 및/또는 밸류를 추출하고, 추출된 데이터를 기반으로 상기 인공지능 모델을 학습 시키는 정보 추출부; 을 포함하는 인공지능 기반 정보 추출 및 활용 시스템이 제공된다. 상기 인공지능 모델은, 이미지, 단어(text) 및 단어 뭉치, 문장, 문단을 포함하는 문구(text phrase)가 상기 대 상 상품에 대해 요구되는 정보에 해당하는지 판별하도록 학습될 수 있다. 상기 인공지능 모델은, 이미지, 단어(text) 및 단어 뭉치, 문장, 문단을 포함하는 문구(text phrase)의 카테고 리와 밸류 및 그에 대한 xpath를 판별하도록 학습될 수 있다. 상기 정보 추출부는, 상기 인공지능 모델의 추출 결과를 기반으로, DOM 트리에서 밸류를 갖는 리프 노드(leaf node)로부터 바텀-업(bottom-up) 방식으로 상향식 판단을 수행하여 상기 대상 상품에 대해 요구되는 정보를 추 출할 수 있다. 상기 정보 추출부는, 상기 인공지능 모델의 추출 결과를 기반으로, DOM 트리에서 임의의 노드에 대한 밸류 또는 카테고리의 판단 결과에 따라 타 노드의 밸류 또는 카테고리의 판단을 수행할 수 있다. 상기 정보 추출부는, DOM 트리에서 임의의 노드가 헤더, 푸터를 포함하는 보일러플레이트(boilerplate)로 판단 되지 않고 상기 대상 상품에 대해 요구되는 정보로 판단된 노드와의 거리가 사전 설정된 임계값 보다 작은 경우, 해당 노드를 상기 대상 상품에 대해 요구되는 정보인 것으로 판단할 수 있다. 상기 웹페이지 분류부는, 상기 웹페이지의 DOM(Document Object Model) 트리(tree), 상기 웹페이지별로 사용하 는 CSS(Cascading Style Sheets) 및 스타일 태그, 상기 웹페이지의 구조-템플릿, 상기 웹페이지의 구조-보일러 플레이트(structure-boilerplate) 및 상기 웹페이지에 존재하는 이미지, 단어, 문구 및 테이블을 포함하는 요소 들 중 적어도 하나를 기반으로 상기 웹페이지를 분류할 수 있다."}
{"patent_id": "10-2021-0167694", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 인공지능 기반 정보 추출 및 활용 시스템은, 인터넷 기반의 방대한 정보 바다에서 학 습 가능한 인공지능을 활용하여 원하는 상품에 대한 필요 정보를 신속하고 정확하게 추출하여 제공할 수 있다. 또한, 본 발명의 실시예에 따른 인공지능 기반 정보 추출 및 활용 시스템은, 추출된 정보를 활용하여 대상 상품 에 대한 응용 컨텐츠를 제공하여 대상 상품에 대한 관심도 및 호감도를 증대 시키고 나아가 해당 상품의 매출 향상에 기여할 수 있다."}
{"patent_id": "10-2021-0167694", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 본 발명을 설명함에 있어서, 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 본 명세서의 설명 과정에서 이용되는 숫자(예를 들어, 제1, 제2 등)는 하나의 구성요소를 다른 구성요소와 구분하기 위한 식별기호에 불과하다. 또한, 명세서 전체에서, 일 구성요소가 다른 구성요소와 \"연결된다\" 거나 \"접속된다\" 등으로 언급된 때에는, 상 기 일 구성요소가 상기 다른 구성요소와 직접 연결되거나 또는 직접 접속될 수도 있지만, 특별히 반대되는 기재 가 존재하지 않는 이상, 중간에 또 다른 구성요소를 매개하여 연결되거나 또는 접속될 수도 있다고 이해되어야 할 것이다. 또한, 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또 한, 명세서에 기재된 \"부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이 는 하나 이상의 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 조합으로 구현될 수 있음을 의미한다. 이하, 첨부된 도면들을 참조하여 본 발명의 실시예를 상세히 설명한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반 정보 추출 및 활용 시스템의 블록 구성도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 인공지능 기반 정보 추출 및 활용 시스템은, 대상 상품과 관 련된 정보를 포함하는 홈페이지의 URL(Uniform Resource Locator)을 수집하는 URL 수집부와, 수집된 URL을 갖는 홈페이지 내의 웹페이지들 중 대상 상품의 상세 정보를 포함하는 웹페이지를 분류하는 웹페이지 분류부 와, 인공지능 모델을 기반으로, 분류된 대상 상품의 상세 정보를 포함하는 웹페이지에서 대상 상품에 대해 요구되는 정보의 카테고리 및/또는 밸류를 추출하고, 추출된 데이터를 기반으로 인공지능 모델을 학습시키는 정 보 추출부를 포함하여 구성될 수 있다. URL 수집부는 대상 상품에 관련된 키워드 및/또는 이미지 등을 입력 받고 입력 받은 키워드 및/또는 이미지 등을 포털 사이트나 소셜 네트워크 서비스 사이트에 검색어로 입력하여 해당 포털 사이트나 소셜 네트워크 서비 스 사이트의 데이터베이스를 검색하여 대상 상품 정보를 보유한 홈페이지의 URL을 수집할 수 있다. 다른 예로, URL 수집부는 대상 상품에 관련된 연합체(상품 협회, 지역 협회 등)에서 운영하는 홈페이지의 데이터베이스를 통해 대상 상품의 정보를 보유한 홈페이지의 URL을 수집할 수 있다. 예를 들어, 대상 상품이 와 인인 경우, URL 수집부는 지역별 와인 생산자 협회에서 운영하는 홈페이지에서 와인에 대한 정보를 포함하 는 홈페이지(예를 들어, 특정 생산자의 홈페이지)의 URL을 수집할 수 있다. 또 다른 예로, URL 수집부는 사용자가 직접 제공하는 URL을 입력 받는 방식으로 URL을 수집할 수도 있다. 웹페이지 분류부는, 수집된 URL을 갖는 홈페이지 내의 웹페이지들 중 대상 상품의 상세 정보를 포함하는 웹 페이지를 분류할 수 있다. 수집된 URL을 갖는 홈페이지는 다수의 웹페이지들로 구성될 수 있으며, 다수의 웹페이지들 중에는 대상 상품의 상세 정보를 포함하는 웹페이지와 그 외 다른 용도로 이용하기 위해 대상 상품의 상세 정보와는 관련을 갖지 않 는 웹페이지가 존재할 수 있다. 웹페이지 분류부는 수집된 URL을 갖는 홈페이지를 구성하는 다수의 웹페이 지들 중 요구되는 정보를 포함할 것으로 예상되는 웹페이지를 분류할 수 있다. 웹페이지 분류부는 다양한 방식으로 수집된 URL을 갖는 홈페이지 내에서 대상 상품의 상세 정보를 포함하는 웹페이지를 분류할 수 있다. 첫 번째 예로, 웹페이지 분류부는 구조 태그(structure-tag) 기반, 즉 DOM(Document Object Model) 트리 (tree) 기반으로 웹페이지를 분류할 수 있다. 웹페이지 분류부는 웹페이지 별 DOM 트리 요소 및 형상(폭, 깊이, 전체 노드의 수, 이너 노드의 수, 리프 노드의 수), 리프 노드의 깊이, 트리 에디트 거리 등을 파악하고, 파악된 결과에 따라 서로 유사한 형상을 갖는 웹페이지를 분류함으로써, 서로 유사한 형상을 갖는 웹페이지 들 중 하나를 제품의 상세 정보를 갖는 웹페이지로 분류할 수 있다. 두 번째 예로, 웹페이지 분류부는 구조 형상(structure-looking) 기반, 즉 웹페이지별로 사용하는 CSS(Cascading Style Sheets) 및 스타일 태그를 기반으로 웹페이지를 분류할 수 있다. 웹페이지 분류부는 웹페이지 별로 사용하는 CSS의 종류, 사용된 CSS의 개수, DOM 트리에서의 위치를 파악하고, 웹페이지 별로 사용 하는 스타일 태그(<style> tag)의 종류, 사용된 스타일 태그의 개수 및 DOM 트리에서의 위치를 파악하며, 파악 된 결과에 따라 서로 유사한 CSS/스타일 태그가 사용된 웹페이지들을 분류함으로써, 서로 유사한 형상을 갖는 웹페이지 들 중 하나를 제품의 상세 정보를 갖는 웹페이지로 분류할 수 있다. 세 번째 예로, 웹페이지 분류부는 구조-템플릿(프레임워크) 기반으로 웹페이지를 분류할 수 있다. 웹페이지 분류부는 웹페이지들의 프레임워크(예를 들어, Typo3, Bootstrap, Wordpress 등) 사용 여부를 판단하여 웹 페이지를 분류할 수 있다. 일반적으로, 어떠한 프레임워크를 사용하는 지에 따라 웹페이지가 갖는 레이아웃 및 용도 등을 파악할 수 있으므로, 웹페이지 분류부는 이와 같이 웹페이지 사용된 프레임워크를 기반으로 제품 의 상세 정보를 갖는 웹페이지를 분류할 수 있다. 네 번째 예로, 웹페이지 분류부는 구조-보일러플레이트(structure-boilerplate 프레임워크) 기반으로 웹페 이지를 분류할 수 있다. 웹페이지 분류부는 웹페이지들의 보일러플레이트(중복 사용하는 소스 코드, 예를 들어, head/footer, 고정된 위치의 광고 등)를 제거하여 보일러플레이트가 제거된 웹페이지 남겨진 내용을 파악 함으로써 제품의 상세 정보를 갖는 웹페이지를 분류할 수 있다. 다섯 번째 예로, 웹페이지 분류부는 웹페이지에 존재하는 이미지를 추출하고 이미지의 해상도나 사이즈 또 는 위치 등을 기반으로 웹페이지를 분류할 수 있다. 웹페이지 분류부는 웹페이지에 사용된 태그를 통해 이 미지를 추출할 수 있으며, 이미지 중 해당 상품의 이미지를 판단하고 상품 이미지의 화면 해상도, 파일 해상도,파일 위치, DOM 트리에서 상품 이미지를 표시하는 노드의 속성 등을 기반으로 제품의 상세 정보를 갖는 웹페이 지를 분류할 수 있다. 여기에서 상품 이미지를 판단하는 기법은 후술하는 인공지능 모델을 통해 수행될 수 있으 므로 추후 상세하게 설명하기로 한다. 예를 들어, 웹페이지 분류부는 추출된 이미지 중 상품 이미지가 없는 경우 해당 웹페이지가 상품의 상세 정보를 갖는 웹페이지가 아닌 것으로 판단할 수 있으며, 상품 이미지가 존재 하는 것으로 판단된 웹페이지 중 가장 큰 화면 해상도를 갖는 페이지를 상품 상세 정보를 갖는 웹페이지로 판단 할 수 있다. 여섯 번째 예로, 웹페이지 분류부는 웹페이지에 존재하는 단어(text)를 기반으로 웹페이지를 분류할 수 있 다. 웹페이지 분류부는 웹페이지의 코드에서 <>태그들을 모두 삭제하고 화면에 표시되는 단어만 남겨둔 상 태에서, DOM 트리의 각 노드의 단어에 대해 후술하는 인공지능 모델을 활용하여 상품 정보에 해당하는지 판단함 으로써 상품 상세 정보를 갖는 웹페이지를 추출할 수 있다. 즉, 웹페이지 분류부는 상품 정보로 판별된 단 어가 존재하지 않는 경우 대상 상품에 대한 상세 정보가 존재하지 않는 웹페이지로 판단할 수 있고, 단어들 중 '카테고리'-'상품 정보'(예를 들어, '가격'-'100원')의 관계가 존재하거나 카테고리가 존재하지 않는 '상품 정 보'(예를 들어, '오늘 한정')에 해당하는 단어가 존재하는 경우 대상 상품에 대한 상세 정보를 갖는 웹페이지인 것으로 판단할 수 있다. 일곱 번째 예로, 웹페이지 분류부는 웹페이지에 존재하는 문구(text phrase)를 기반으로 웹페이지를 분류할 수 있다. 여기서, 문구(text phrase)는 단어를 합성이나 조합으로 구성된 단어 뭉치 또는 문장 또는 하나 이상 의 문장으로 구성된 문단이 될 수 있다. 웹페이지 분류부는 웹페이지의 코드에서 <>태그들을 모두 삭제하고 화면에 표시되는 문구만 남겨둔 상태에서, DOM 트리의 각 노드의 문구에 대해 후술하는 인공지능 모델을 활용하 여 상품 정보에 해당하는지 판단함으로써 상품 상세 정보를 갖는 웹페이지를 추출할 수 있다. 즉, 웹페이지 분 류부는 상품 정보로 판별된 문구가 존재하지 않는 경우 대상 상품에 대한 상세 정보가 존재하지 않는 웹페 이지로 판단할 수 있고, 텍스트 내에 '카테고리'-'상품 정보'(예를 들어, '사용법'-'물에 타서 충분히 섞어 음 용합니다')의 관계가 존재하거나 카테고리가 존재하지 않는 '상품 정보'(예를 들어, '어린이 손에 닿지 않게 높 은 곳에 보관하세요')에 해당하는 텍스트가 존재하는 경우 대상 상품에 대한 상세 정보를 갖는 웹페이지인 것으 로 판단할 수 있다. 여덟 번째 예로, 웹페이지 분류부는 웹페이지에 테이블(text phrase)의 존재 여부 등에 기반하여 웹페이지 를 분류할 수 있다. 웹페이지에서 상품의 상세 정보는 테이블 내에 존재할 가능성이 높기 때문에, 웹페이지 분 류부는 테이블 관련 태그(예를 들어, <table>, <div>, <ul>, <li>, <grid>, …)를 확인하고 테이블 내 기 재된 단어나 문구를 확인하여 대상 상품에 대한 상세 정보를 갖는 웹페이지인 것으로 판단할 수 있다. 아홉 번째 예로, 웹페이지 분류부는 이미지 파일만 존재하는 웹페이지의 경우 후술하는 인공지능 모델을 이 용하여 이미지를 통해 추출한 정보를 기반으로 대상 상품에 대한 상세 정보를 갖는 웹페이지인지 판단할 수 있 다. 웹페이지 분류부는, 전술한 것과 같은 대상 상품에 대한 상세 정보를 갖는 웹페이지를 추출하기 위한 다양 한 기법 중 하나만 적용하거나 둘 이상을 서로 조합하여 적용함으로써 웹페이지 추출의 정확도를 높일 수 있다. 정보 추출부는, 인공지능 모델을 기반으로, 웹페이지 분류부에 의해 분류된 대상 상품의 상세 정보를 포함하는 웹페이지에서 대상 상품에 대해 요구되는 정보의 카테고리 및/또는 밸류를 추출하고, 추출된 데이터를 기반으로 인공지능 모델을 학습시킬 수 있다. 정보 추출부는 대상 상품의 상세 정보를 갖는 웹페이지에서 대상 상품에 대해 요구되는 정보를 추출하기 위 한 요소로서, 상품에 대해 요구되는 정보를 추출하기 위한 학습 가능한 인공지능 모델을 포함할 수 있다. 인공지능 모델에 의해 추출되는 상품에 대해 요구되는 정보는 정량적 정보 또는 정성적 정보 중 하나로 분류될 수 있으며, 속하는 카테고리를 가질 수 있다. 즉, 인공지능 모델은 분류된 웹페이지에서 대상 상품에 대해 요구 되는 정보(대상 상품 정보)로서 대상 상품의 정량적 정보, 정성적 정보, 이 정보가 속하는 카테고리를 추출하도 록 학습될 수 있다. 예를 들어, 대상 상품 정보 중 정량적 정보로는 상품의 가격, 성분, 용량, 생산자, 판매자, 생산국 등을 명시하 는 정보일 수 있다. 대상 상품 정보 중 정성적 정보로는 상품에 대한 생산자의 설명, 상품에 대한 전문가 평가 등이 될 수 있다. 이들 대상 성품 정보가 속하는 카테고리는 가격, 사용법, 조리법, 이미지, 동영상, 역사, 판 매자 연락처 등일 수 있다. 웹페이지의 웹 코드 내에서 대상 상품 정보는 DOM 트리 내에서 상품 정보가 가지는 값의 형태로 나타날 수 있으 며 주로 2 개의 노드가 하나의 대상 상품 정보를 구성할 수 있다. 대상 상품 정보는 웹 코드 내에서 \"xpath, 카 테고리\", \"xpath, 해당 카테고리의 밸류\"의 형태로 나타나며, 예를 들어, \"가격\": \"100원\"과 같이 나타날 수 있 다. 2 개의 노드 대신 하나의 노드가 카테고리 없이 존재할 수도 있다. 즉, 대상 상품 정보는 단순히 웹 코드 내에서 \"xpath, 밸류\"의 형태로 나타날 수 있으며, 예를 들어, \"오늘만 이 가격에 팔아요\"와 같은 문구가 이에 해당할 수 있다. 정보 추출부에 구비된 인공지능 모델은 웹페이지에 포함된 이미지, 단어(text), 문구(text phrase: 단어 뭉 치, 문장, 문단)가 대상 상품 정보에 해당하는지 판단하고 이를 추출하도록 학습될 수 있다. 예를 들어, '100원'이라는 단어가 '가격'이라는 카테고리의 대상 상품 정보에 해당하는지 여부(또는 확률), '너무 맛있네요'라는 단어 뭉치가 대상 상품의 맛을 설명하는 카테고리에 해당되는지, '100년 전부터 생산해 온 … .'이라는 문단이 대상 상품의 생산자의 역사 카테고리에 해당되는지 등을 판단할 수 있다. 정보 추출부에 구비된 인공지능 모델은, 초기 사용자가 임의로 입력하는 학습 데이터를 이용하여 학습될 수 있으며, 도 1에 도시된 것과 같은 시스템이 구성된 이후에는 웹페이지 분류부에서 분류된 웹페이지에서 입 력되는 이미지, 단어, 문구 등을 통해 반복적인 학습을 수행하고 업데이트 될 수 있다. 도 2 내지 도 4는 본 발명의 일 실시예에 따른 인공지능 기반 정보 추출 및 활용 시스템의 정보 추출부 내 인공 지능 모델의 학습에 대한 예시를 설명하기 위한 도면이다. 특히, 도 2 및 도 3은 이미지에 대한 인공지능 모델 학습의 예시를 설명하기 위한 것이다. 예를 들어, 인공지능 모델은 도 2에 도시된 것과 같이 와인의 정면 이미지 또는 와인의 레이블을 확인할 수 있는 이미지를 학습 데이터로 입력 받아 학습을 수행할 수 있다. 여기서 '정면 이미지', '레이블 이미지'은 카테고리에 해당할 수 있고, 인공지능 모델은 입력되는 학습 데 이터 중 '정면 이미지', '레이블 이미지'이라는 카테고리에 해당하는 이미지를 대상 상품 이미지로 구분하고 각 각의 카테고리로 분류하며 대상 상품 이미지가 아닌 이미지를 구분 하도록 학습될 수 있다. 즉, 인공지능 모델은 도 3에 도시된 것과 같이, 원하는 상품 이미지에 해당하는 이미지를 대상 상품인 와 인 상품의 이미지로 구분하고 나머지 이미지를 와인 상품 이미지가 아닌 것으로 구분할 수 있다. 도 4는 인공지능 모델의 단어 또는 문구에 대한 학습의 예시를 설명하는 것으로, 전술한 이미지의 학습과 유사 하게, 인공지능 모델은 와인과 관련된 단어 또는 문구를 입력 받아 학습을 수행할 수 있다. 예를 들어, 인 공지능 모델은, '이름', '가격', '날짜', '성분' 등과 같은 단어에 해당하는 카테고리에 포함되는 와인 관 련 단어를 학습 데이터로 입력 받고 대응 카테고리로 분류하도록 학습될 수 있다. 또한, 인공지능 모델은 '사용법', '주의사항', '맛표현' 등과 같은 문구에 해당하는 카테고리에 포함되는 와인 관련 문구를 학습 데이 터로 입력 받고 대응 카테고리로 분류하도록 학습될 수 있다. 이에 의해, 인공지능 모델은 단어 또는 문구에 대해 와인이라는 대상 상품에 관련된 단어 또는 문구와 그 렇지 않은 단어 또는 문구를 분류할 수 있으며, 대상 상품에 관련된 단어는 적절한 카테고리로 분류할 수 있다. 나아가, 인공지능 모델은 카테고리와 밸류에 대한 xpath를 학습할 수 있다. 예를 들어, 카테고리로서 '가 격'이라는 단어와 그에 대응되는 밸류로서 '100원'이라는 단어가 각각 갖는 xpath를 확인하여 해당 카테고리와 밸류에 대응되는 xpath를 판별할 수 있도록 학습될 수 있다. 또한, 인공지능 모델은 카테고리를 갖지 않는 밸류에 대해서도 xpath를 확인하여 카테고리가 없는 해당 밸류에 대응되는 xpath를 판별할 수 있도록 학습될 수 있다. 이와 같이 학습된 인공지능 모델은 시스템 내에서 웹페이지 분류부가 제공하는 웹페이지로부터 대상 상품 정보에 해당하는 이미지, 단어, 문구를 추출하고 분류할 수 있다. 인공지능 모델을 포함하는 정보 추출부는 인공지능 모델 및 웹페이지 분류부에서 확보된 정 보를 활용하여 다음과 같은 방식으로 상품 정보를 추출할 수 있다. 정보 추출부는, DOM 트리에서 밸류를 갖는 리프 노드(leaf node)로부터 바텀-업(bottom-up) 방식으로 상향 식 판단을 수행할 수 있다. 정보 추출부는 특정 노드의 밸류(이미지, 단어 또는 문구)가 카테고리 인지, 특정 카테고리에 대한 밸류 인 지 또는 카테고리가 없는 밸류인지에 대한 판단을 수행한 후 판단된 결과를 기반으로 그 상향 노드에 대해 판단 된 노드와의 관계를 판단하는 방식이 적용될 수 있다. 또한, 정보 추출부는 노드 A에 대한 판단 결과를 기반으로 다른 노드와의 관계를 판단할 수 있다. 예를 들어, 정보 추출부는, 노드 A가 단어이고 노드 A가 밸류에 해당한다고 하면 노드 B는 노드 A에 대응되 는 카테고리인지 판단하거나, 노드 A가 단어이고 노드 A가 카테고리에 해당한다고 하면 노드 B는 노드 A에 대응 되는 밸류인지 판단하거나, 노드 A가 단어이고 노드 A가 카테고리에 해당한다고 하면 노드 B, 노드 C, 노드 D는 노드 A에 모두 대응되는 밸류인지 판단할 수 있다. 또한, 정보 추출부는, 노드 A가 상품 이미지이고 노드 A가 밸류에 해당한다고 하면 노드 B는 노드 A에 대응 되는 카테고리인지 판단할 수 있다. 또한, 정보 추출부는, 노드 A가 문구이고 노드 A가 밸류에 해당한다고 하면 노드 B는 노드 A에 대응되는 카 테고리인지 판단할 수 있다. 또한, 정보 추출부는, 노드 A가 단어이고 노드 B가 이미지, 텍스트 또는 문구인 경우에도 두 노드 간의 관 계를 판단할 수 있다. 정보 추출부는 단어인 노드 A가 카테고리인 경우 이미지 또는 단어구인 노드 B가 노 드 에에 해당되는 밸류인지 판단할 수 있다. 한편, 정보 추출부는 상품 정보 판단의 보정을 수행할 수 있다. 정보 추출부 서로 매칭된 노드 간의 관계가 DOM 트리에서 같은 부모(parent) 노드를 가지고 있는지, 같은 부모 노드는 루트 노드인지, 노드 A의 바로 위 부모 노드인 노드 A'와 노드 B의 바로 위 부모 노드인 노드 B'가 다른 노드인 경우 노드 A'와 노드 B'의 트리 거리(tree distance)는 얼마인지 트리 거리가 기설정된 임계값 보 다 작은 지 노드 A와 노드 B의 부모 노드들은 가까운지 등을 판단함으로써, 노드 A와 노드 B의 거리가 얼마나 가까운지 판단할 수 있다. DOM 트리 내에서 상품 정보는 형상적으로 서로 매우 가까이 존재할 확률이 높으며 멀리 떨어져 분리되지 않을 것이다. 이에 따라, 대상 상품 정보(카테고리, 밸류)로 판별된 노드들의 집합에서 하나의 노드는 다른 노드와의 최단 거리가 기설정된 특정 임계값 이하인 것이 바람직하다. 또한, 상품 정보는 DOM 트리의 양쪽 가장 자리에 해당하는 노드 보다는 내부에 위치한 노드에 있을 가능성이 높 으며, DOM 트리의 양쪽 끝은 헤더(header)와 푸터(footer)가 차지할 것이다. 더하여, 대상 상품의 상세 정보를 포함하는 웹페이지는 홈페이지에서 1개만 존재하지 않을 가능성이 높으며, 카 테고리가 명시되지 않은 밸류만 표시된 노드의 경우 상품의 상세 정보를 포함하는 하나의 웹페이지만으로 판단 하는 경우 추출하고자 하는 상품 정보인지 판단하기 어렵지만, 상세 정보를 갖는 웹페이지들이 여러 개 있으면 해당 xpath가 반복되어 존재하게 되어 이를 통해 상품 정보 여부를 판단할 수 있다. 즉, DOM tree에서 헤더, 푸터 등의 보일러플레이트(boilerplate)로 판단되지 않고 대상 상품의 정보로 판단된 노드 들과 거리가 가까우면(기 설정된 임계값 이내이면) 로컬 관점에서는 상품 정보로 판단되지 않았을 정보를 글로벌(global) 관점에서 상품 정보로 보정 가능하다. 이와 같이, 정보 추출부는 특정 노드가 헤더, 푸터 등의 보일러플레이트(boilerplate)로 판단되지 않고 대 상 상품의 정보로 판단된 노드 들과 거리가 가까운 경우 해당 노드를 상품 정보로 판단할 수 있다. 한편, 정보 추출부는 추출된 대상 상품 정보를 이용하여 대상 상품 정보를 추출하기 위한 인공지능 모델 을 추가 학습시켜 업데이트할 뿐만 아니라, 추가의 인공지능 모델을 이용하여 응용 컨텐츠 또는 서비스를 생성 제공할 수 있다. 예를 들어, 정보 추출부 내에 마련된 추가의 인공지능 모델은, 상품 설명 표현의 핵심 요소를 추출하고 그"}
{"patent_id": "10-2021-0167694", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "에 관련된 컨텐츠를 제작할 수 있다. 인공지능 모델은, 문자로 나열된 표현 중 요약/축약할 수 있는 일부 단어"}
{"patent_id": "10-2021-0167694", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "를 추출하거나 그림, 영상 등의 시각 표현 중 요약/축약할 수 있는 일부 표현 추출하도록 학습될 수 있다. 또한, 인공지능 모델은, 상품 표현에 연관된 컨텐츠를 자동 생성할 수 있다. 예를 들어, 인공지능 모델은, 문자 로 나열된 상품 표현 중에 핵심 단어를 삭제하고 괄호 처리하여, 해당 칸에 들어갈 단어의 주관식/객관식 혹은 O/X 선택 퀴즈를 만들 수 있다. 또한 만들어진 퀴즈와 그에 대한 답을 바탕으로 비슷한 형식과 설명의 가상 퀴 즈와 답을 생성 가능하다. 또한, 인공지능 모델은 상품 표현에 대한 점수 매칭을 수행하도록 학습될 수 있다. 예를 들어, 인공지능 모델은, 평론가 A의 상품 표현과 채점값 1000개를 학습하고, 새로운 상품 표현을 입력하면 채점값을 산정하도록구현될 수 있다. 또한, 인공지능 모델은, 개개인의 상품 설명 방식을 학습하여 새로운 상품에 대한 설명 표현하도록 학습될 수 있다. 예를 들어, 인공지능 모델은, 평론가 A의 상품 표현 자료 1000개를 학습하여 모델을 생성하면, 새로운 물 질에 대해 평론가 A가 작성한 것 같은 상품 표현을 생성하도록 구현될 수 있다. 또한, 인공지능 모델은 상품 A의 설명과 비슷한 표현을 가진 상품 B를 찾거나, 상품 A의 설명에 어울리는 표현 을 가진 상품 C를 찾을 수 있다. 또한, 인공지능 모델은 상품 A와 상품 B가 비슷한 이유 및 상품 A와 상품 C가 어울리는 이유를 문장과 문단으로 생성하도록 구현될 수 있다. 이상에서 설명한 바와 같이, 본 발명의 여러 실시예에 따른 인공지능 기반 정보 추출 및 활용 시스템은, 인터넷 기반의 방대한 정보 바다에서 학습 가능한 인공지능을 활용하여 원하는 상품에 대한 필요 정보를 신속하고 정확 하게 추출하여 제공할 수 있다. 또한, 본 발명의 여러 실시예에 따른 인공지능 기반 정보 추출 및 활용 시스템 은, 추출된 정보를 활용하여 대상 상품에 대한 응용 컨텐츠를 제공하여 대상 상품에 대한 관심도 및 호감도를 증대시키고 나아가 해당 상품의 매출 향상에 기여할 수 있다. 이상에서는 본 발명의 실시예를 참조하여 설명하였지만, 해당 기술 분야에서 통상의 지식을 가진 자라면 하기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수 정 및 변경시킬 수 있음을 쉽게 이해할 수 있을 것이다."}
{"patent_id": "10-2021-0167694", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기반 정보 추출 및 활용 시스템의 블록 구성도이다. 도 2 내지 도 4는 본 발명의 일 실시예에 따른 인공지능 기반 정보 추출 및 활용 시스템의 정보 추출부 내 인공 지능 모델의 학습에 대한 예시를 설명하기 위한 도면이다."}
