{"patent_id": "10-2023-0139731", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0055957", "출원번호": "10-2023-0139731", "발명의 명칭": "카메라 내장 단말기 및 영상 이미지 내에 워터마크 삽입 방법", "출원인": "삼성중공업 주식회사", "발명자": "이준탁"}}
{"patent_id": "10-2023-0139731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "카메라 내장 단말기에 있어서,외부 피사체에 상응하는 실시간 영상을 생성하여 표시부에 표시되도록 하거나, 촬영 명령에 상응하여 외부 피사체에 상응하는 영상 이미지를 생성하여 저장부에 저장하는 카메라부;상기 카메라 내장 단말기의 현재 위치 정보를 생성하는 GPS부; 및미리 기계 학습된 인식 모델을 이용하여 상기 실시간 영상 또는 상기 영상 이미지에 포함된 촬영 대상물이 미리설정된 보안 물체인지 여부를 인식하고, 미리 지정된 보안 조건이 만족되면 상기 영상 이미지에 미리 지정된 규칙의 워터마크가 삽입되도록 하는 보안 유닛을 포함하는 카메라 내장 단말기."}
{"patent_id": "10-2023-0139731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 보안 유닛은, 상기 보안 조건이 만족되면 상기 촬영 명령이 입력되기 이전에도 상기 표시부에 표시되는 실시간 영상이 상기 워터마크와 중첩되어 표시되도록 처리하는, 카메라 내장 단말기."}
{"patent_id": "10-2023-0139731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 보안 조건은, 상기 촬영 대상물이 상기 보안 물체이고, 상기 실시간 영상 또는 상기 영상 이미지가 생성되는 시점에서의 상기 카메라 내장 단말기의 현재 위치가 미리 지정된 보안 구역 내에 해당되는 경우에 만족되는것으로 미리 설정되는, 카메라 내장 단말기."}
{"patent_id": "10-2023-0139731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "영상 이미지 내에 워터마크 삽입 방법을 수행하도록 하기 위해 컴퓨터-판독 가능 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 컴퓨터로 하여금 이하의 단계들을 수행하도록 하며, 상기 단계들은,카메라부에서 생성된 외부 피사체에 상응하는 실시간 영상이 표시부에 표시되도록 하는 단계;미리 기계 학습된 인식 모델을 이용하여, 상기 실시간 영상에 포함된 촬영 대상물이 미리 설정된 보안 물체인지여부를 인식하는 단계;상기 실시간 영상이 생성되는 각 시점에서 GPS부에서 생성된 현재 위치 정보가 미리 지정된 보안 구역 내에 해당되는지 여부를 판단하는 단계; 및상기 촬영 대상물이 상기 보안 물체이고, 상기 현재 위치 정보가 상기 보안 구역 내에 해당되면, 상기 표시부에표시되는 상기 실시간 영상이 워터마크와 중첩되어 표시되도록 처리하는 단계를 포함하는, 컴퓨터-판독 가능 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0139731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "영상 이미지 내에 워터마크 삽입 방법을 수행하도록 하기 위해 컴퓨터-판독 가능 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 컴퓨터로 하여금 이하의 단계들을 수행하도록 하며, 상기 단계들은,사용자의 촬영 명령에 따라 카메라부에서 생성된 영상 이미지가 저장부에 저장되는 단계;미리 기계 학습된 인식 모델을 이용하여, 상기 영상 이미지에 포함된 촬영 대상물이 미리 설정된 보안 물체인지여부를 판단하는 단계;상기 영상 이미지가 생성되는 시점에서 GPS부에서 생성된 현재 위치 정보가 미리 지정된 보안 구역 내에 해당되공개특허 10-2025-0055957-3-는지 여부를 판단하는 단계; 및상기 촬영 대상물이 상기 보안 물체이고, 상기 현재 위치 정보가 상기 보안 구역 내에 해당되면, 상기 저장부에저장된 상기 영상 이미지에 워터마크가 삽입되도록 갱신하는 단계를 포함하는, 컴퓨터-판독 가능 매체에 저장된컴퓨터 프로그램."}
{"patent_id": "10-2023-0139731", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "카메라 내장 단말기 및 영상 이미지 내에 워터마크 삽입 방법이 개시된다. 카메라 내장 단말기는, 외부 피사체에 상응하는 실시간 영상을 생성하여 표시부에 표시되도록 하거나, 촬영 명령에 상응하여 외부 피사체에 상응하는 영상 이미지를 생성하여 저장부에 저장하는 카메라부; 상기 카메라 내장 단말기의 현재 위치 정보를 생성하는 GPS부; 및 미리 기계 학습된 인식 모델을 이용하여 상기 실시간 영상 또는 상기 영상 이미지에 포함된 촬영 대상 물이 미리 설정된 보안 물체인지 여부를 인식하고, 미리 지정된 보안 조건이 만족되면 상기 영상 이미지에 미리 지정된 규칙의 워터마크가 삽입되도록 하는 보안 유닛을 포함한다."}
{"patent_id": "10-2023-0139731", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 카메라 내장 단말기 및 영상 이미지 내에 워터마크 삽입 방법에 관한 것이다."}
{"patent_id": "10-2023-0139731", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트폰이나 태블릿 피씨와 같은 휴대용 기기에는 통신 기능, 카메라 기능 등과 같이 다양한 기능이 구비되고 있다. 최근에는 휴대용 기기(즉, 카메라 내장 단말기)에 탑재되는 카메라의 성능이 향상되어 일반 카메라 장치 를 대체하는 수준에 이르고 있다. 그러나, 카메라 내장 단말기에 탑재된 카메라 기능은 무분별한 사진 촬영으로 인해, 보안을 요하는 산업 현장 등에서는 오히려 보안을 위협하는 요인이 되고 있다. 따라서, 보안을 요하는 산업 현장에서는 허가된 임직원만이 카메라 기능을 활용할 수 있도록 제한하고, 외부 방 문자는 휴대한 카메라 내장 단말기에 렌즈를 가리도록 보안 스티커를 부착한 후 산업 현장에 입장하도록 하는 등의 보안 조치를 취하고 있다. 그러나, 보안 구역 내에서 허가받지 않은 사람의 카메라 내장 단말기를 이용한 사진 촬영을 제한할지라도, 허가 된 임직원에 의해 촬영된 사진이나 외부 방문자가 임의로 촬영한 사진에 포함된 보안 정보(예를 들어, 도면, 회 의 내용 등)가 외부로 유출될 위험성은 여전히 존재한다."}
{"patent_id": "10-2023-0139731", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "전술한 배경기술과 관련 도면을 참조하여 후술될 종래기술은 고안자가 본 고안의 도출을 위해 보유하고 있었거 나, 본 고안의 도출 과정에서 습득한 기술 정보로서, 반드시 본 고안의 출원 전에 일반 공중에게 공개된 공지기 술이라 할 수는 없다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2003-0081563호 (특허문헌 0002) 한국공개특허 제10-2005-0028538호 (특허문헌 0003) 한국등록특허 제10-1522088호"}
{"patent_id": "10-2023-0139731", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 보안 구역 내에서 촬영된 사진에 워터마크가 삽입되도록 함으로써, 사진 촬영자 스스로 경각심을 가 지고 촬영한 보안 정보를 외부 유출하지 않도록 유도할 수 있고, 보안 정보가 외부 유출된 경우에도 유출자의 용이한 색출이 가능한, 카메라 내장 단말기 및 영상 이미지 내에 워터마크 삽입 방법을 제공하기 위한 것이다. 본 발명은 보안 구역 내에서 미리 특정된 보안 물체가 촬영되는 경우에만 촬영된 사진에 워터마크가 삽입되도록 한정함으로써, 보안이 요구되지 않는 피사체가 촬영된 사진의 품질은 훼손하지 않는, 카메라 내장 단말기 및 영 상 이미지 내에 워터마크 삽입 방법을 제공하기 위한 것이다. 본 발명의 이외의 해결하고자 하는 과제들은 하기의 설명을 통해 쉽게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0139731", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 카메라 내장 단말기에 있어서, 외부 피사체에 상응하는 실시간 영상을 생성하여 표시부에 표시되도록 하거나, 촬영 명령에 상응하여 외부 피사체에 상응하는 영상 이미지를 생성하여 저장부에 저장하는 카메라부; 상기 카메라 내장 단말기의 현재 위치 정보를 생성하는 GPS부; 및 미리 기계 학습된 인식 모델을 이용하여 상기 실시간 영상 또는 상기 영상 이미지에 포함된 촬영 대상물이 미리 설정된 보안 물체인지 여부를 인식하고, 미리 지정된 보안 조건이 만족되면 상기 영상 이미지에 미리 지정된 규칙의 워터마크가 삽입 되도록 하는 보안 유닛을 포함하는 카메라 내장 단말기가 제공된다. 상기 보안 유닛은, 상기 보안 조건이 만족되면 상기 촬영 명령이 입력되기 이전에도 상기 표시부에 표시되는 실 시간 영상이 상기 워터마크와 중첩되어 표시되도록 처리할 수도 있다. 상기 보안 조건은, 상기 촬영 대상물이 상기 보안 물체이고, 상기 실시간 영상 또는 상기 영상 이미지가 생성되 는 시점에서의 상기 카메라 내장 단말기의 현재 위치가 미리 지정된 보안 구역 내에 해당되는 경우에 만족되는 것으로 미리 설정될 수 있다. 본 발명의 다른 측면에 따르면, 영상 이미지 내에 워터마크 삽입 방법을 수행하도록 하기 위해 컴퓨터-판독 가 능 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 컴퓨터로 하여금 이하의 단계들을 수행하도 록 하며, 상기 단계들은, 카메라부에서 생성된 외부 피사체에 상응하는 실시간 영상이 표시부에 표시되도록 하 는 단계; 미리 기계 학습된 인식 모델을 이용하여, 상기 실시간 영상에 포함된 촬영 대상물이 미리 설정된 보안 물체인지 여부를 인식하는 단계; 상기 실시간 영상이 생성되는 각 시점에서 GPS부에서 생성된 현재 위치 정보가 미리 지정된 보안 구역 내에 해당되는지 여부를 판단하는 단계; 및 상기 촬영 대상물이 상기 보안 물체이고, 상 기 현재 위치 정보가 상기 보안 구역 내에 해당되면, 상기 표시부에 표시되는 상기 실시간 영상이 워터마크와 중첩되어 표시되도록 처리하는 단계를 포함하는, 컴퓨터-판독 가능 매체에 저장된 컴퓨터 프로그램이 제공된다. 본 발명의 또 다른 측면에 따르면, 영상 이미지 내에 워터마크 삽입 방법을 수행하도록 하기 위해 컴퓨터-판독 가능 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 컴퓨터로 하여금 이하의 단계들을 수행하 도록 하며, 상기 단계들은, 사용자의 촬영 명령에 따라 카메라부에서 생성된 영상 이미지가 저장부에 저장되는 단계; 미리 기계 학습된 인식 모델을 이용하여, 상기 영상 이미지에 포함된 촬영 대상물이 미리 설정된 보안 물 체인지 여부를 판단하는 단계; 상기 영상 이미지가 생성되는 시점에서 GPS부에서 생성된 현재 위치 정보가 미리 지정된 보안 구역 내에 해당되는지 여부를 판단하는 단계; 및 상기 촬영 대상물이 상기 보안 물체이고, 상기 현 재 위치 정보가 상기 보안 구역 내에 해당되면, 상기 저장부에 저장된 상기 영상 이미지에 워터마크가 삽입되도 록 갱신하는 단계를 포함하는, 컴퓨터-판독 가능 매체에 저장된 컴퓨터 프로그램이 제공된다. 전술한 것 외의 다른 측면, 특징, 이점이 이하의 도면, 청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2023-0139731", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 보안 구역 내에서 촬영된 사진에 워터마크가 삽입되도록 함으로써, 사진 촬영자 스 스로 경각심을 가지고 촬영한 보안 정보를 외부 유출하지 않도록 유도하고, 보안 정보가 외부 유출된 경우에도 유출자의 용이한 색출이 가능해지는 효과가 있다. 또한, 보안 구역 내에서 미리 특정된 보안 물체가 촬영되는 경우에만 촬영된 사진에 워터마크가 삽입되도록 한 정함으로써, 보안이 요구되지 않는 피사체가 촬영된 사진의 품질이 훼손되지 않도록 하는 효과도 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2023-0139731", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0139731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아 니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도 1은 본 발명의 일 실시예에 따른 카메라 내장 단말기의 블록 구성도이고, 도 2는 본 발명의 일 실시예에 따 른 보안 처리부의 동작을 설명하기 위한 도면이다. 도 1을 참조하면, 카메라 내장 단말기는 카메라부, GPS부, 표시부 및 보안 유닛을 포 함할 수 있다. 도시되지는 않았으나, 카메라 내장 단말기에는 예를 들어 전화번호, 사용자 정보(예를 들어, 이름, 소속, 사번 등), 보안 구역의 위치 좌표 정보, 카메라부에 의해 촬영된 영상 이미지, 영상 이 미지에 상응하는 위치 정보 등이 저장되는 저장부가 더 포함될 수 있다. 카메라부는 사용자의 촬영 명령에 따라 외부 피사체에 상응하는 영상 이미지를 생성한다. 영상 이미지는 예를 들어 정지 영상 이미지이거나, 동영상 이미지일 수 있다. 카메라부에 의해 생성된 영상 이미지는 저 장부에 저장될 수 있다. GPS부는 카메라 내장 단말기의 위치 정보를 생성한다. 표시부는 카메라 내장 단말기의 동작 상태에 관한 정보, 카메라부의 동작 개시에 의한 프리뷰 (preview) 기능에 따른 실시간 영상, 촬영 명령에 따라 생성된 영상 이미지 등을 표시한다. 표시부는 터치 방식으로 사용자 명령 입력이 가능한 터치 스크린으로 구현될 수 있으며, 사용자 명령의 입 력이 가능하도록 표시부에는 촬영 명령 입력을 위한 셔터 이미지, 카메라 내장 단말기의 구동 조작을 위한 아이콘 등이 더 표시될 수 있다. 보안 유닛은 대상 인식부 및 보안 처리부를 포함할 수 있다. 여기서, 보안 유닛의 하나 이상의 구성 요소(예를 들어, 대상 인식부, 보안 처리부등)는 지정된 역할을 수행하는 일종의 모듈로 구성될 수 있다. 여기서, 모듈은 소프트웨어 형태로 구현되거나, FPGA(Field Programmable Gate Array) 또는 주문형 반도체(ASIC, Application Specific Integrated Circuit) 등과 같은 하 드웨어 구성으로 구현되거나, 이들의 조합으로 구현될 수 있다. 물론, 모듈은 소프트웨어 또는 하드웨어에 한정 되지 않고, 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고, 하나 또는 그 이상의 프로세서들을 실행 시키도록 구성될 수도 있다. 구성요소들과 모듈들에서 제공되는 기능은 더 적은 수의 구성요소들 및 모듈들로 결합되거나 추가적인 구성요소들과 모듈들로 더 분리될 수도 있다. 대상 인식부는 카메라부에서 프리뷰 기능으로 생성하여 표시부에 표시되는 실시간 영상 또는 촬 영 명령에 의해 생성되어 저장부에 저장되는 영상 이미지를 미리 기계학습된 인식 모델에 적용하여, 실시 간 영상 또는 영상 이미지가 미리 지정된 보안 물체를 촬영한 것인지 여부에 관한 촬영 대상물 정보를 생성한다. 여기서, 보안 물체는 보안 정보가 일반적으로 기재되거나, 보안 정보 자체로 분류되는 예를 들어 종이, 컴퓨터 모니터, 회의실 스크린, 회의실 칠판, 선박 블록 등으로 미리 지정될 수 있다. 인식 모델은 다양하게 미리 지정된 보안 물체(예를 들어, 종이, 컴퓨터 모니터 등)들과 비보안 물체(예를 들어, 인물, 건물, 나무 등)들을 다양한 조명 환경에서 촬영한 영상 이미지들을 학습 데이터로 하여 기계 학습 한 후, 카메라부에서 생성하여 표시부에 프리뷰 기능으로 표시하는 실시간 영상 또는 촬영 명령에 의 해 생성되어 저장부에 저장되는 영상 이미지가 보안 물체를 포함하는지 여부에 대한 인식 결과를 제공하도록, 인공지능 기반의 내장형 AI 모듈로 구현될 수 있다. 인식 모델이 학습하는 학습 데이터에는 보안 물체 또는 비보안 물체가 단독으로 촬영된 영상 이미지도 포 함되지만, 보안 물체와 비보안 물체가 함께 포함되도록 촬영된 영상 이미지(예를 들어, 보안 내용을 담은 문서 가 놓여진 책상 등)도 포함될 수 있다. 인식 모델은 카메라부에서 생성한 실시간 영상 또는 영상 이 미지 내에 보안 물체와 비보안 물체가 모두 포함되는 경우에는 보안 물체가 촬영된 것이라는 인식 결과를 제공 하도록 미리 설정될 수 있음은 당연하다. 인식 모델은 예를 들어 완전 합성곱 신경망(Fully Convolutional Neural network), 합성곱 신경망 (Convolutional Neural Network), 순환 신경망(Recurrent Neural Network), 제한 볼츠만 머신(Restricted Boltzmann Machine), 심층 신뢰 신경망(Deep Belief neural Network) 등 중 하나 이상의 딥러닝 기반의 모델로 생성될 수도 있다. 물론, 딥러닝 기법 이외의 머신 러닝 기법으로 구현되거나, 딥러닝 기법과 머신 러닝 기법이 결합된 하이브리드 형태의 모델로 생성될 수도 있다. 또한, 인식 모델을 학습하는 방법도 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning) 등으로 다양할 수 있다. 보안 처리부는 미리 설정된 보안 조건이 만족되는 경우, 카메라부에서 생성되는 영상 이미지에 워터 마크(160, 도 2 참조)를 삽입되도록 처리한다. 또한, 보안 처리부는 미리 설정된 보안 조건이 만족되면, 촬영 명령이 입력되기 이전일지라도 프리뷰 기능 으로 표시부를 통해 표시되는 실시간 영상에 워터마크가 삽입되어 표시되도록 처리할 수도 있다. 사용자는 표시부에 표시되는 워터마크가 삽입된 실시간 영상을 참조하여 렌즈가 비추고 있는 피사체 가 보안 물체에 해당함을 미리 인식할 수 있다. 실시간 영상에 워터마크가 삽입되어 표시되는 상태에서, 촬영 명령이 입력되면 보안 처리부는 카메라부에 의해 생성되어 저장부에 저장되는 영상 이미지에 워 터마크가 삽입되도록 할 수 있다. 보안 정보의 외부 유출을 방지하고, 외부 유출 발생시 유출자의 용이한 색출이 가능해지도록, 영상 이미지에 삽 입되는 워터마크에는 예를 들어 사용자의 이름, 소속, 사번, 전화번호 등이 포함되도록 할 수 있다. 여기서, 보안 조건은 예를 들어 카메라부에 의해 생성된 실시간 영상 또는 영상 이미지가 미리 지정된 보 안 물체를 촬영한 것이고, 또한 해당 실시간 영상 또는 영상 이미지를 생성할 때의 카메라 내장 단말기의 위치가 미리 설정된 보안 구역의 위치 좌표 정보에 부합하는 경우에 만족되도록 미리 설정될 수 있다. 보안 조건의 만족 여부를 판단하기 위해, 보안 처리부는 대상 인식부에 의해 생성된 촬영 대상물 정 보를 참조하여, 해당 실시간 영상 또는 영상 이미지가 보안 물체를 촬영한 것인지 여부를 인식할 수 있다. 또한, 보안 처리부는 실시간 영상이 생성되는 각 시점 또는 촬영 명령이 입력된 시점에서 GPS부가 생 성한 카메라 내장 단말기의 위치 정보를 저장부에 미리 저장된 보안 구역의 위치 좌표 정보와 대비하여 해 당 실시간 영상 또는 영상 이미지가 보안 구역 내에서 생성되었는지를 인식할 수 있다. 일 예로, 사용자의 촬영 명령에 의해 도 2의 (a)에 예시된 영상 이미지가 생성되는 경우를 가정한다. 이 경우, 보안 처리부는 대상 인식부에 의해 생성된 촬영 대상물 정보를 참조하여 촬영된 대상 물체가 보안 물 체인 종이인 것을 인식하고, 또한 해당 영상 이미지의 촬영 위치가 미리 지정된 보안 구역에 해당하는 것으로 판단함으로써, 생성되는 영상 이미지에 워터마크가 삽입되도록 처리할 수 있다. 이와 달리, 사용자의 촬영 명령에 의해 도 2의 (b)에 예시된 영상 이미지가 생성되는 경우를 가정하면, 보안 처 리부는 대상 인식부에 의해 생성된 촬영 대상물 정보를 참조하여 촬영된 대상 물체가 비보안 물체인 나무와 인물인 것을 인식하고, 일반 촬영 모드로 사진 촬영이 이루어지도록 할 수 있다. 즉, 보안 조건이 만족되지 않는 경우에는, 보안 구역 내에서 사진 촬영이 이루어졌을지라도 카메라부에서 생성하는 영상 이미지에 워터마크가 삽입되지 않는다. 전술한 바와 같이, 본 실시예에 따른 카메라 내장 단말기는 보안 구역 내에서 촬영된 사진에 워터마크가 삽입되 도록 하여, 사진 촬영자 스스로 보안 구역에서 촬영한 보안 정보를 외부 유출하지 않도록 유도하고, 보안 정보 의 외부 유출시 유출자의 용이한 색출이 가능해지도록 하는 특징이 있다. 또한, 보안 구역 내에서 보안 물체나 텍스트를 촬영한 경우에만 촬영된 사진에 워터마크가 삽입되도록 한정함으 로써, 보안이 요구되지 않는 피사체가 촬영된 사진의 품질이 훼손되지 않는 특징도 있다. 도 3은 본 발명의 일 실시예에 따른 영상 이미지 내에 워터마크를 삽입하는 방법을 나타낸 순서도이다. 도 3을 참조하면, 단계 310에서, 카메라 내장 단말기는 사용자의 조작에 의해 카메라부가 동작 개시 되고, 프리뷰 기능으로 표시부에는 렌즈를 통해 입력되는 외부 피사체에 상응하는 실시간 영상(프리뷰 화 면)이 표시된다. 단계 320에서, 카메라 내장 단말기는 표시부에 실시간 영상이 표시되는 상태에서, GPS부에서 현 재 생성되는 카메라 내장 단말기의 위치 정보와 저장부에 미리 저장된 보안 구역의 위치 좌표 정보를 대비 하여, 카메라 내장 단말기가 현재 보안 구역 내에 위치하였는지 여부를 판단한다. 만일 카메라 내장 단말기의 현재 위치가 보안 구역 내부가 아닌 경우라면, 카메라 내장 단말기는 일 반 촬영 모드로 영상 이미지가 생성되도록 처리한다(단계 330). 일반 촬영 모드에서 촬영 명령이 입력되는 경우 에는, 통상의 사진 촬영 방식이 적용되며, 생성되는 영상 이미지에 워터마크가 삽입되지 않는다. 그러나 만일 카메라 내장 단말기가 보안 구역 내에 위치하였다면, 단계 340에서, 카메라 내장 단말기(10 0)는 미리 기계 학습된 인식 모델을 이용하여, 카메라부에서 촬영하여 표시부에 프리뷰 화면으 로 표시되는 실시간 영상에 포함된 촬영 물체를 인식한다. 여기서, 인식 모델은 다양한 보안 물체(예를 들어, 종이, 컴퓨터 모니터 등)들과 비보안 물체(예를 들어, 인물, 건물, 나무 등)들을 다양한 조명 환경에서 촬영한 영상 이미지들을 학습 데이터로 하여 기계 학습한 후, 카메라부에서 생성하여 표시부에 프리뷰 화면으로 표시되는 실시간 영상에 보안 물체가 포함되었는지 에 관한 인식 결과를 제공하도록, 인공지능 기반의 내장형 AI 모듈로 구현될 수 있다. 단계 350에서, 카메라 내장 단말기는 해당 실시간 영상에서 인식된 촬영 물체가 미리 설정된 보안 물체인 지 여부를 판단한다. 여기서, 보안 물체는 보안 정보가 일반적으로 기재되거나, 보안 정보 자체로 분류되는 예 를 들어 종이, 컴퓨터 모니터, 회의실 스크린, 회의실 칠판, 선박 블록 등으로 미리 지정될 수 있다. 만일 해당 실시간 영상에서 인식된 촬영 물체에 보안 물체가 아닌 경우에는 단계 330으로 진행하여, 일반 촬영 모드로 동작한다. 그러나 만일, 해당 실시간 영상에서 인식된 촬영 물체가 보안 물체라면, 단계 360에서, 카메라 내장 단말기 는 프리뷰 기능으로 표시부를 통해 표시되는 실시간 영상에 워터마크가 삽입되어 표시되도록 처 리한다. 이를 통해, 사용자는 표시부에 표시되는 워터마크가 삽입된 실시간 영상을 참조하여 렌즈가 비추고 있는 피사체가 보안 물체에 해당함을 미리 인식할 수 있다. 이후, 사용자에 의해 촬영 명령이 입력(예를 들어, 표시부에 표시된 셔터 이미지를 클릭)되면, 단계 370에 서, 카메라 내장 단말기는 해당 시점의 프리뷰 화면으로 표시된 실시간 영상에 상응하는 영상 이미지를 워 터마크가 삽입된 형태로 생성하여 저장부에 저장한다. 도 4는 본 발명의 다른 실시예에 따른 영상 이미지 내에 워터마크를 삽입하는 방법을 나타낸 순서도이다. 도 4를 참조하면, 단계 410에서, 카메라 내장 단말기는 카메라부가 동작 개시된 상태에서 사용자의 촬영 명령에 따라 외부 피사체를 촬영한 영상 이미지를 생성하여 저장부에 저장한다. 단계 410에서 생성된 영상 이미지는 일반 촬영 모드에서 생성된 영상 이미지일 수 있다. 단계 420에서, 카메라 내장 단말기는 미리 기계 학습된 인식 모델을 이용하여 영상 이미지에 포함된 촬영 물체가 미리 지정된 보안 물체에 해당하는지 여부를 판단하고, 해당 영상 이미지가 생성된 시점에서의 카 메라 내장 단말기의 위치 정보가 저장부에 미리 저장된 보안 구역의 위치 좌표 정보에 부합하는지 여부를 판단한다. 만일 영상 이미지가 보안 물체를 촬영한 것이 아니거나, 영상 이미지가 보안 구역 이외의 영역에서 촬영되었다 면, 카메라 내장 단말기는 저장부에 저장된 영상 이미지를 일반 촬영 모드에서 생성된 상태대로 유지한다 (단계 440). 그러나 만일 영상 이미지에 보안 물체가 포함되어 있고, 영상 이미지가 보안 구역 내에서 촬영되었다면, 카메라 내장 단말기는 단계 430으로 진행하여, 저장부에 저장된 영상 이미지를 미리 설정된 워터마크가 삽입 된 영상 이미지로 갱신하여 저장한다. 즉, 일반 촬영 모드에서 생성된 영상 이미지는 워터마크를 삽입하도 록 보안 촬영 모드에서 생성된 영상 이미지로 갱신되어 저장부에 저장된다. 상기에서는 본 발명의 실시예를 참조하여 설명하였지만, 해당 기술 분야에서 통상의 지식을 가진 자라면 하기의 청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변 경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0139731", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 카메라 내장 단말기의 블록 구성도. 도 2는 본 발명의 일 실시예에 따른 보안 처리부의 동작을 설명하기 위한 도면. 도 3은 본 발명의 일 실시예에 따른 영상 이미지 내에 워터마크를 삽입하는 방법을 나타낸 순서도. 도 4는 본 발명의 다른 실시예에 따른 영상 이미지 내에 워터마크를 삽입하는 방법을 나타낸 순서도."}
