{"patent_id": "10-2022-0141256", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0062219", "출원번호": "10-2022-0141256", "발명의 명칭": "인공지능 기반의 IOT 통합 처리 장치, 이를 포함하는 AI 머신 사회관계망 시스템과 그 방법", "출원인": "주식회사 안지온", "발명자": "홍충기"}}
{"patent_id": "10-2022-0141256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 기반의 IOT 통합 처리 방법으로서, 적어도 하나의 IOT 디바이스로부터 이벤트 발생에 따른 IOT 정보를 수집하는 단계; 이벤트 처리규칙 DB에 기-정의된 이벤트 처리규칙에 기초하여 상기 수집된 IOT 정보를 분석하는 단계; 및상기 IOT 정보를 분석한 결과에 기초하여, 상기 IOT 디바이스와의 대화가 요구되는지 또는 사용자 단말과의 대화가 요구되는지를 판단하는 단계를 포함하는, 인공지능 기반의 IOT 통합 처리 방법."}
{"patent_id": "10-2022-0141256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 판단의 결과 상기 IOT 디바이스와의 대화가 요구되는 경우, 상기 분석된 IOT 정보를 활용하여 상기 IOT 디바이스와의 대화를 개시하는 단계를 더 포함하는, 인공지능 기반의 IOT 통합 처리 방법."}
{"patent_id": "10-2022-0141256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 판단의 결과 사용자 단말과의 대화가 요구되는 경우, 상기 분석된 IOT 정보를 활용하여 상기 사용자 단말과의 대화를 개시하는 단계를 더 포함하는, 인공지능 기반의 IOT 통합 처리 방법."}
{"patent_id": "10-2022-0141256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서, 상기 IOT 디바이스와의 대화를 개시하는 단계는, 상기 수집된 IOT 정보가 상기 이벤트 처리규칙에 따라 특정 동작이 필요하다고 판단되는 경우 상기 특정 동작에 상응하는 명령을 생성하여 상기 IOT 디바이스로 전송하는 단계를 포함하는, 인공지능 기반의 IOT 통합 처리 방법."}
{"patent_id": "10-2022-0141256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 사용자의 음성을 인식 및 분석하고, 상기 분석된 사용자의 음성에 기초하여 상기 사용자와의 대화를 개시하는단계를 더 포함하는, 인공지능 기반의 IOT 통합 처리 방법."}
{"patent_id": "10-2022-0141256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 사용자와의 대화를 개시하는 단계는, 상기 사용자로부터 특정 동작을 수행하라는 지시를 수신하고 상기 특정 동작에 상응하는 명령을 생성하여 상기 IOT 디바이스로 전송하는 단계를 포함하는, 인공지능 기반의 IOT 통합 처리 방법.공개특허 10-2024-0062219-3-청구항 7 하드웨어인 컴퓨터와 결합되어, 제 1 항 내지 제 6 항 중 어느 한 항에 따른 방법을 수행할 수 있도록 컴퓨터판독 가능한 기록 매체에 저장되는, 컴퓨터 프로그램."}
{"patent_id": "10-2022-0141256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "인공지능 기반의 IOT 통합 처리 장치(100)로서, 적어도 하나의 IOT 디바이스(200)로부터 이벤트 발생에 따른 IOT 정보를 수집하도록 구성되는 IOT 정보 수집부(110); 이벤트 처리규칙 DB(125)에 기-정의된 이벤트 처리규칙에 기초하여 상기 수집된 IOT 정보를 분석하도록 구성되는 이벤트 분석부(120); 및상기 IOT 정보를 분석한 결과에 기초하여, 상기 IOT 디바이스(200)와의 대화가 요구되는지 또는 사용자 단말(300)과의 대화가 요구되는지를 판단하도록 구성되는 제어부(190)를 포함하는, 인공지능 기반의 IOT 통합 처리 장치(100)."}
{"patent_id": "10-2022-0141256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 판단의 결과 상기 IOT 디바이스(200)와의 대화가 요구되는 경우, 상기 분석된 IOT 정보를 활용하여 상기IOT 디바이스(200)와의 대화를 개시하고, 상기 판단의 결과 사용자 단말(300)과의 대화가 요구되는 경우, 상기 분석된 IOT 정보를 활용하여 상기 사용자단말(300)과의 대화를 개시하도록 구성되는 동작 처리부(130)를 더 포함하는, 인공지능 기반의 IOT 통합 처리 장치(100)."}
{"patent_id": "10-2022-0141256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "AI 머신 사회관계망 시스템(1000)으로서, 제 8 항에 따른 인공지능 기반의 IOT 통합 처리 장치(100); 상기 인공지능 기반의 IOT 통합 처리 장치(100)와 통신 가능하게 결합되는 적어도 하나의 IOT 디바이스(200);및상기 인공지능 기반의 IOT 통합 처리 장치(100)와 통신 가능하게 결합되는 적어도 하나의 사용자 단말(300)을포함하는,AI 머신 사회관계망 시스템(1000)."}
{"patent_id": "10-2022-0141256", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기반의 IOT 통합 처리 방법이 제공된다. 상기 인공지능 기반의 IOT 통합 처리 방법은, 적어도 하나의 IOT 디바이스로부터 이벤트 발생에 따른 IOT 정보를 수집하는 단계; 이벤트 처리규칙 DB에 기-정의된 이벤트 처 리규칙에 기초하여 상기 수집된 IOT 정보를 분석하는 단계; 및 상기 IOT 정보를 분석한 결과에 기초하여, 상기 IOT 디바이스와의 대화가 요구되는지 또는 사용자 단말과의 대화가 요구되는지를 판단하는 단계를 포함할 수 있 다."}
{"patent_id": "10-2022-0141256", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반의 IOT 통합 처리 장치, 이를 포함하는 AI 머신 사회관계망 시스템과 그 방법에 관한 발명으로서, 보다 구체적으로 인공지능(AI; Artificial Intelligence)과 머신러닝(ML; Machine Learning)에 기 초하여 주변 IOT 디바이스와 근거리 통신으로 대화를 수행하고, 다양한 상황에 맞는 적절한 제어 명령을 IOT 디 바이스에 전송하며, 나아가 사용자의 개입이 필요한 경우 사용자 단말과의 대화를 수행하도록 함으로써 IOT 통 합 처리 장치와 IOT 디바이스와 사용자 단말의 3자 대화를 가능하게 하는 인공지능 기반의 IOT 통합 처리 장치, 이를 포함하는 AI 머신 사회관계망 시스템과 그 방법에 관한 발명이다."}
{"patent_id": "10-2022-0141256", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사물 인터넷(IOT; Internet of Things)은 사물에 센서를 부착하여 실시간으로 데이터를 인터넷을 통해 주고받는 기술이나 환경을 의미하고, 블루투스(Bluetooth), 근거리무선통신(NFC), 센서 데이터, 네트워크 등이 이러한 사 물 간의 소통을 가능하게 한다. 사물 인터넷에서는 모든 물리적 센서 정보, 예를 들어 온도, 습도, 열, 가스, 조도, 초음파 센서에 의한 원격 감지, SAR, 레이더, 위치, 모션, 영상 등 유형의 사물과 주위 환경으로부터의 정보에 기초하여 사물 간의 통신 이 이루어질 수 있다. 이에 IOT 디바이스가 서로 자율적으로 정보를 주고 받으며 통신을 수행할 뿐만 아니라 나아가 특정 상황에서 스스로 동작을 제어할 수 있는 기술의 필요성이 점점 커지고 있다. 한편, 많은 IOT 센서나 디바이스에서 많은 정보들이 교환되고 있고 이러한 정보 교환에 인간이 효과적으로 조작 개입을 할 수 있도록 모바일 단말과 IOT 디바이스 사이의 필수적인 정보통신에 대해서 인간의 자연어로 변환될 필요가 있는데, 이에 IOT 디바이스로부터 필수적인 정보를 전달받거나 또는 IOT 디바이스와 직접 대화를 수행함 으로써 인간이 효율적으로 IOT 디바이스들을 제어할 수 있는 새로운 기술이 필요하다. 또한, 사회안전관리를 위해 많은 인프라가 구축되어 있지만 이들이 유기적으로 연결되어 있지 않아 그 효과가 매우 미비하다. 예를 들어, 화재가 발생할 경우 집안에 화재 감지기가 작동하여 알람이 울리지만, 만약 집안에 사람이 없다면 그 알람을 듣고 대응할 객체가 없어 무용지물이 되고 만다. 따라서, 어느 정도는 사물이 스스로 판단, 대응, 연락 및 대처할 수 있고, 사물과 사물이 서로 통신할 수 있는 플랫폼을 형성하여 머신 간의 관계망을 구축하고 그러한 플랫폼을 통해 머신 상호 간에 그리고 머신과 사용자 간에 사회적인 관계를 형성하여 확장할 수 있도록 하는 새로운 타입의 플랫폼에 대한 요구가 당업계에서 점차 증가하고 있는 상황이다."}
{"patent_id": "10-2022-0141256", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기의 문제점들을 해결하고자 안출된 것으로서, 본 발명은 인공지능 기반의 IOT 통합 처리 장치와 IOT 디바이스와 사용자 단말 간에 네트워크를 형성하고 이를 확장함으로써 인공지능 기반의 IOT 통합 처리 장치 와 IOT 디바이스와 사용자 단말이 자율적으로 대화를 수행할 수 있도록 하는 인공지능 기반의 IOT 통합 처리 장 치, 이를 포함하는 AI 머신 사회관계망 시스템과 그 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 이벤트(event)를 텍스트로 자동 표현 처리하는 이벤트 처리규칙(또는 프로토콜 관계망 처리규 칙) DB에 따라 특정 처리 동작이 필요한 경우 자동으로 또는 사용자의 개입으로 특정 IOT 디바이스에 대한 특정 한 동작 명령을 생성하여 해당 IOT 디바이스로 전송함으로써 환경이나 상황에 맞는 동작을 효율적으로 수행할 수 있도록 하는 인공지능 기반의 IOT 통합 처리 장치, 이를 포함하는 AI 머신 사회관계망 시스템과 그 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0141256", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 해결하기 위한 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 방법은, 적어 도 하나의 IOT 디바이스로부터 이벤트 발생에 따른 IOT 정보를 수집하는 단계; 이벤트 처리규칙 DB에 기-정의된 이벤트 처리규칙에 기초하여 상기 수집된 IOT 정보를 분석하는 단계; 및 상기 IOT 정보를 분석한 결과에 기초하 여, 상기 IOT 디바이스와의 대화가 요구되는지 또는 사용자 단말과의 대화가 요구되는지를 판단하는 단계를 포 함할 수 있다. 또한, 상기 인공지능 기반의 IOT 통합 처리 방법은, 상기 판단의 결과 상기 IOT 디바이스와의 대화가 요구되는 경우, 상기 분석된 IOT 정보를 활용하여 상기 IOT 디바이스와의 대화를 개시하는 단계를 더 포함할 수 있다. 또한, 상기 인공지능 기반의 IOT 통합 처리 방법은, 상기 판단의 결과 사용자 단말과의 대화가 요구되는 경우, 상기 분석된 IOT 정보를 활용하여 상기 사용자 단말과의 대화를 개시하는 단계를 더 포함할 수 있다. 또한, 상기 IOT 디바이스와의 대화를 개시하는 단계는, 상기 수집된 IOT 정보가 상기 이벤트 처리규칙에 따라 특정 동작이 필요하다고 판단되는 경우 상기 특정 동작에 상응하는 명령을 생성하여 상기 IOT 디바이스로 전송 하는 단계를 포함할 수 있다. 또한, 상기 인공지능 기반의 IOT 통합 처리 방법은, 사용자의 음성을 인식 및 분석하고, 상기 분석된 사용자의 음성에 기초하여 상기 사용자와의 대화를 개시하는 단계를 더 포함할 수 있다. 또한, 상기 사용자와의 대화를 개시하는 단계는, 상기 사용자로부터 특정 동작을 수행하라는 지시를 수신하고 상기 특정 동작에 상응하는 명령을 생성하여 상기 IOT 디바이스로 전송하는 단계를 포함할 수 있다. 또한, 상기의 기술적 과제를 해결하기 위한 본 발명의 다른 실시예에 따른 컴퓨터 프로그램은, 하드웨어인 컴퓨 터와 결합되어, 상기 인공지능 기반의 IOT 통합 처리 방법을 수행할 수 있도록 컴퓨터 판독 가능한 기록 매체에 저장될 수 있다. 또한, 상기의 기술적 과제를 해결하기 위한 본 발명의 또 다른 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는, 적어도 하나의 IOT 디바이스로부터 이벤트 발생에 따른 IOT 정보를 수집하도록 구성되는 IOT 정보 수집 부; 이벤트 처리규칙 DB에 기-정의된 이벤트 처리규칙에 기초하여 상기 수집된 IOT 정보를 분석하도록 구성되는 이벤트 분석부; 및 상기 IOT 정보를 분석한 결과에 기초하여, 상기 IOT 디바이스와의 대화가 요구되는지 또는 사용자 단말과의 대화가 요구되는지를 판단하도록 구성되는 제어부를 포함할 수 있다. 또한, 상기 인공지능 기반의 IOT 통합 처리 장치는, 상기 판단의 결과 상기 IOT 디바이스와의 대화가 요구되는 경우, 상기 분석된 IOT 정보를 활용하여 상기 IOT 디바이스와의 대화를 개시하고, 상기 판단의 결과 사용자 단 말과의 대화가 요구되는 경우, 상기 분석된 IOT 정보를 활용하여 상기 사용자 단말과의 대화를 개시하도록 구성 되는 동작 처리부를 더 포함할 수 있다. 또한, 상기의 기술적 과제를 해결하기 위한 본 발명의 추가 실시예에 따른 AI 머신 사회관계망 시스템은, 상기 인공지능 기반의 IOT 통합 처리 장치; 상기 인공지능 기반의 IOT 통합 처리 장치와 통신 가능하게 결합되는 적 어도 하나의 IOT 디바이스; 및 상기 인공지능 기반의 IOT 통합 처리 장치와 통신 가능하게 결합되는 적어도 하 나의 사용자 단말을 포함할 수 있다."}
{"patent_id": "10-2022-0141256", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치, 이를 포함하는 AI 머신 사회관계망 시스템과 그 방법에 의하면, 인공지능 기반의 IOT 통합 처리 장치와 IOT 디바이스와 사용자 단말 간에 네트워크를 형성하 고 이를 확장함으로써 인공지능 기반의 IOT 통합 처리 장치와 IOT 디바이스와 사용자 단말이 자율적으로 대화를 수행하도록 할 수 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치, 이를 포함하는 AI 머신 사회관계망 시 스템과 그 방법에 의하면, 이벤트를 텍스트로 자동 표현 처리하는 이벤트 처리규칙(또는 프로토콜 관계망 처리 규칙) DB에 따라 특정 처리 동작이 필요한 경우 자동으로 또는 사용자의 개입으로 특정 IOT 디바이스에 대한 특 정한 동작 명령을 생성하여 해당 IOT 디바이스로 전송함으로써 환경이나 상황에 맞는 동작을 효율적으로 수행하 도록 할 수 있다."}
{"patent_id": "10-2022-0141256", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 실시예들은 첨부된 도면들을 참조하여 설명한다. 각 도면의 구성요소들에 참조 부호를 부 가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면 상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한 다. 또한, 이하에서 본 발명의 실시예들을 설명할 것이나, 본 발명의 기술적 사상은 이에 한정되거나 제한되지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외 하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 본 발명의 실시예의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다 른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정 되지 않는다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치 및 이를 포함하는 AI 머신 사회 관계망 시스템의 블록도이다. 참고로, SNS(Social Network Service; 소셜 네트워크 서비스)는 인터넷 등 통신망을 통해 특정한 관심이나 활동 을 공유하는 사람들 사이의 관계망을 구축하는 온라인 서비스 또는 플랫폼을 의미하는데, 이러한 SNS의 개념으 로부터 머신(machine) 간의 관계망을 구축하는 서비스가 도출될 수 있다. 이하의 본 명세서에서 용어 “MSNS”(또는 “M-SNS”, “m-SNS”)(Machine Social Network Service)는 본 발명 에 따른 인공지능 기반의 IOT 통합 처리 장치를 통해 연결되는 IOT 디바이스와 사용자 단말 간 의 관계망을 구축하는 온라인 서비스 또는 플랫폼을 지칭할 수 있다. SNS가 플랫폼을 통해서 사용자 각 개인의 사회적 네트워크를 형성하여 확장하는 것과 마찬가지로, m-SNS도 플랫 폼을 통해 머신 상호 간에 그리고 머신과 사용자 간에 사회적인 관계를 형성하고 확장시킬 수 있으며, 따라서 본 발명의 일 실시예에 따른 시스템을 'AI 머신 사회관계망 시스템'(1000, 도 1)의 용어로 지칭할 수 있다. 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 근거리에 위치한 IOT 디바이스 또는 사용자 단말과 로컬 와이파이 네트워크, 근거리무선통신 등을 통해 연결될 수 있고, 외부의 사용자 단말과는 인터넷, 무선 통신망 등을 통해 연결될 수 있다. 한편, 본 발명의 일 실시예에 따른 AI 머신 사회관계망 시스템 내에서 인공지능 기반의 IOT 통합 처리 장 치가 복수로 구현되는 경우, 복수의 인공지능 기반의 IOT 통합 처리 장치는 상호 간에 인터넷을 통해 연결됨으로써 인공지능 기반의 IOT 통합 처리 장치와 IOT 디바이스와 사용자 단말 사이에 각각 m-SNS를 형성하여 그 관계를 확장할 수 있다. 다시 말하면, 본 발명의 일 실시예에 따른 AI 머신 사회관계망 시스템은 인공지능 기반의 IOT 통합 처리 장치와 IOT 디바이스와 사용자 단말 간에 m-SNS를 구축함으로써, 인공지능 기반의 IOT 통합 처 리 장치와 IOT 디바이스와 사용자 단말끼리 서로 자율적인 대화를 가능하게 함과 동시에, 이벤 트 처리규칙 DB에 따라 특정 처리 동작이 필요한 경우에는 자동으로 또는 사용자의 개입으로 특정 IOT 디바이스 에 대한 특정 동작 명령을 생성하여 해당 IOT 디바이스에 전송함으로써 주어진 환경, 상황 등에 최적 인 동작이 수행되도록 할 수 있다. 이와 같이, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 IOT 디바이스와 대화 를 수행하고 IOT 디바이스로부터 수집한 중요한 환경 정보를 실시간으로 분석하여 처리함으로써 에지 컴퓨 팅(edge computing)을 구현할 수 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 블루투스, NFC, 와이파이 등 오 직 근거리무선통신망을 통해서만 IOT 디바이스와 m-SNS를 구축함으로써 외부 공격에 보다 강건한 m-SNS를 구축할 수 있고, 사용자의 사용자 단말과는 근거리무선통신뿐 아니라 인터넷 등을 통해 연결됨으로써 사용 자와는 인공지능 기반의 IOT 통합 처리 장치가 설치된 장소(예를 들어, 거실 벽, 사무실 벽 등) 부근은 물 론이고 외부에서도 사용자 단말과는 자유롭게 대화를 수행할 수 있다. 게다가, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 민감한 개인비밀정보, 예를 들어 사용자의 인적 정보, 금융 정보 등을 사용자 단말로부터 수신하여 이를 저장하는 디지털 세이프(전자금고) 또는 전자 지갑의 기능을 수행할 수도 있다. 그에 따라, 사용자는 자신의 중요한 개인 정보, 특정 사이 트의 아이디와 비밀번호, 금융 계좌와 관련된 정보, 전자화폐정보, NFT 예술품 등 다양한 중요 정보를 본 발명 의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치에 보다 안전하게 저장할 수 있다. 다시 도 1로 돌아와서, 본 발명의 일 실시예에 따른 AI 머신 사회관계망 시스템은 인공지능 기반의 IOT 통합 처리 장치와, 적어도 하나의 IOT 디바이스(200; 200-1, … , 200-N, 여기서 N은 자연수)와, 사용자 단말 등을 포함할 수 있다. 참고로, 도 1에서는 단일의 사용자 단말이 예시적으로 도시되어 있으나, 복수의 사용자 단말이 본 발명에 따른 인공지능 기반의 IOT 통합 처리 장치에 통신 가능하게 결합될 수 있음은 명백하다. 본 발명의 일 실시예에 따른 IOT 디바이스는 온도, 습도, 열, 가스, 조도 등 주변 환경에 대한 정보를 수 집 및 계측하는 IOT 센서뿐만 아니라 냉장고, 청소기, 에어컨, 로봇 등 다양한 가전 장치를 모두 포함할 수 있 다. 또한, 본 발명에 따른 IOT 디바이스는 블루투스, NFC 통신, 와이파이 등의 다양한 근거리무선통신을 통해 서로 정보를 주고 받을 수 있는 모든 장치를 포함할 수 있다. 여기서, IOT 디바이스에 의해 활용되는 근거리무선통신은, 예를 들어 적외선 통신, RF 통신, 블루투스, NFC, 무선랜, 와이파이, 지그비 등 현재의 근거리무선통신이나, 향후에 개발되는 모든 타입의 근거리무선통신방 식 중 임의의 근거리무선통신방식이 활용될 수 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 IOT 정보 수집부와, 이벤 트 분석부와, 동작 처리부와, 음성 처리부와, AI 학습부와, 통신부와, 저장부 와, 디스플레이부와, 제어부를 포함할 수 있다. 참고로, 도 1에 도시되는 인공지능 기반의 IOT 통합 처리 장치의 구성요소들(110, 120, 130, 140, 150, 160, 170, 180, 190)은 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치의 동작, 기능 등 을 설명하기 위한 예시적인 구성요소들에 불과하고, 따라서 본 발명에 따른 인공지능 기반의 IOT 통합 처리 장 치가 도시된 구성요소들(110, 120, 130, 140, 150, 160, 170, 180, 190) 이외의 다른 구성요소들(예를 들 어, 전원부, 모니터링부, 조명부 등)을 추가로 포함할 수 있음은 명백하다. 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 블루투스, NFC, 와이파이 등의 근거리 무선통신망을 통해 적어도 하나의 IOT 디바이스와 통신 가능하게 연결될 수 있다. 그에 따라, 구축된 m- SNS에 소속되지 않은 외부의 다른 IOT 디바이스가 본 인공지능 기반의 IOT 통합 처리 장치에 접근하는 것 을 사전에 차단함으로써 본 시스템에 대한 보안을 더욱 안전하게 형성할 수 있다. IOT 디바이스는, 상기한 바와 같이, 주변 환경에 대한 정보를 수집 및 계측하는 IOT 센서뿐 아니라 냉장고, 청소기, 에어컨, 로봇 등 다양한 가전 장치에 내장되어 가전 장치를 제어할 수 있는 제어 장치를 모두 포함할 수 있다. 또한, 인공지능 기반의 IOT 통합 처리 장치는 사용자 단말과 근거리무선통신뿐 아니라 이동통신(2G, 3G, 4G, 5G, 6G 등)과 유선통신(이더넷, BcN 등) 등의 다양한 유무선 통신망을 통해 연결될 수 있다. 따라서, 사용자 단말은 인공지능 기반의 IOT 통합 처리 장치와 유무선 통신망을 통해 연결됨으로써 인공지능 기반의 IOT 통합 처리 장치가 설치된 장소뿐 아니라 외부 어디에서도 자유롭게 IOT 디바이스와 대화 를 수행하거나 또는 IOT 디바이스를 제어할 수 있다. 여기서, 인공지능 기반의 IOT 통합 처리 장치 에는 보안 솔루션이 탑재될 수 있고, 그에 따라 허가된 IOT 디바이스와 허가된 사용자 단말의 액세스 만이 허용될 수 있다. 한편, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치의 음성 처리부에는 마이크 와 스피커가 구비될 수 있고, 이를 활용하여 사용자와 직접 음성으로 대화를 수행할 수 있을 뿐만 아 니라 사용자의 음성 요청에 적절하게 대응할 수 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 디스플레이부를 포함할 수 있고, 디스플레이부를 통해 사용자에게 다양한 영상 정보를 제공할 수 있다(예를 들어, 시계 표시 기능, 캘린더 일정 관리 기능, 영상 출력 기능 등). 예를 들어, 인공지능 기반의 IOT 통합 처리 장치는 평상시 에는 시계 화면을 표시하는 벽걸이 시계로서 기능할 수 있고, 사용자의 음성 입력 또는 사용자 단말을 통 한 요청을 수신하는 경우, 또는 IOT 디바이스의 특정 이벤트가 발생하는 경우, 해당 이벤트에 대응하는 동 작을 수행하기 위해 사용자가 인공지능 기반의 IOT 통합 처리 장치 앞에 위치하게 되면 그에 대응하는 영상을 출력할 수 있다. IOT 정보 수집부는 근거리무선통신을 통해 주변에 연결된 적어도 하나의 IOT 디바이스로부터 IOT 정 보를 수집할 수 있다. 여기서, 수집되는 IOT 정보는 이벤트 발생에 따른 IOT 정보일 수 있거나, 또는 IOT 센서 에 따른 환경 변수의 계측 값일 수도 있다. 예를 들어, IOT 정보 수집부는 온도 센서로부터 해당 장소의 온도 값을 주기적으로 수집할 수 있고, 에어컨으로부터 어떠한 목표 온도로 얼마만큼의 풍량으로 동작하고 있는 지에 관한 이벤트 정보를 주기적으로 수집할 수 있고, 냉장고로부터 내부 온도 및 냉장고 문 열림에 관한 이벤 트 정보를 주기적으로 수집할 수 있다. 이렇게 IOT 정보 수집부에 의해 수집되는 주변 IOT 디바이스(20 0)의 이벤트 정보는 저장부에 저장될 수 있다. 이벤트 분석부는 이벤트 처리규칙 DB에 기-정의된 이벤트 처리규칙에 기초하여, 즉 이벤트 처리규칙 DB를 참고하여 수집된 IOT 정보를 분석하도록 구성될 수 있다. 보다 구체적으로, 이벤트 분석부는 수집된 각각의 IOT 정보가 의미하는 값을 분석하고, 해당 IOT 정보가 이벤트 처리규칙 DB에 따라 후속 동 작이나 대화가 필요한 것으로 판단되는 경우 다음 프로세스에서 후속 동작이나 대화가 개시되도록 할 수 있다. 이를 위해, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치의 제어부는 IOT 정보를 분석한 결과에 기초하여 IOT 디바이스와의 대화가 요구되는지 또는 사용자 단말과의 대화가 요구되는 지를 판단할 수 있고, IOT 디바이스와의 대화가 필요하면 분석된 IOT 정보를 활용하여 IOT 디바이스 와의 대화를 개시하며, 사용자 단말과의 대화가 필요하면 분석된 IOT 정보를 활용하여 사용자 단말과 의 대화를 개시할 수 있다. 또한, 이벤트 처리규칙 DB에는 특정 IOT 정보에 대응하는 후속 동작이나 대화 개시 등을 지시하는 내용이 데이터베이스화되어 저장될 수 있다. 이벤트 분석부에 IOT 정보를 분석하는 것, 그리고 통일된(unified) IOT 정보통신 프로토콜을 처리하는 것에 대해서는 이하의 도 6을 통해 보다 상세하게 기술하기로 한다. 동작 처리부는 대화 수행 유닛과 동작 명령 유닛을 포함할 수 있다. 대화 수행 유닛은 IOT 정보의 분석 결과 대화가 필요하다고 판단되는 경우 IOT 디바이스 및/또는 사용자 단말과의 대화 를 개시하여 수행하도록 구성될 수 있다. 예를 들어, 대화 수행 유닛은 IOT 정보의 분석에 따라 IOT 디바 이스와의 대화가 요구되는 경우에 분석된 IOT 정보를 활용하여 IOT 디바이스와의 대화를 개시하고, 마찬가지로 IOT 정보의 분석에 따라 사용자 단말과의 대화가 요구되는 경우에 분석된 IOT 정보를 활용하여 사용자 단말과의 대화를 개시할 수 있다. 동작 명령 유닛은 IOT 정보의 분석 결과 후속 동작이 필요하다고 판단되는 경우 후속 동작에 대한 명령을 생성하여 그 명령을 IOT 디바이스로 송신할 수 있고, 이러한 후속 동작과 관련하여 이벤트 처리규칙 DB에 대응 저장되어 있는 명령이 자동으로 추출되어 해당 IOT 디바이스로 송신될 수 있거나, 또는 사 용자 단말 또는 사용자의 음성 등 사용자의 개입에 의해 입력된 명령이 해당 IOT 디바이스로 송신될 수 있다. 음성 처리부는 사용자와 직접 음성을 통해 대화를 수행하거나, 또는 사용자에게 소정의 정보를 제공하거나, 또는 사용자로부터 정보를 수신하도록 구성될 수 있다. 이를 위해, 본 발명에 따른 음성 처리부 는 마이크와, 스피커와, 음성 분석 유닛과, 자연어 처리 유닛을 포함할 수 있다. 마이크는 사용자의 음성을 입력 받을 수 있고, 스피커는 사용자에게 음성을 출력할 수 있으며, 음성 분석 유닛은 마이크를 통해 입력 받은 사용자의 음성을 분석할 수 있고, 자연어 처리 유닛은 사 용자의 언어를 탐지하고 음성 분석 유닛의 분석에 따라 사람이 이해할 수 있는 자연어로 변환하여 출력할 수 있다. AI 학습부는 머신러닝, 즉 기계 학습을 수행하도록 구성될 수 있다. 예를 들어, 이벤트 분석부, 대 화 수행 유닛, 음성 분석 유닛, 자연어 처리 유닛 등은 인공지능의 기계 학습을 통해서 이벤트 분석 능력, 대화 수행 능력, 음성 분석 능력, 자연어 처리 능력 등을 향상시킬 수 있다. 통신부는 적어도 하나의 IOT 디바이스 및 적어도 하나의 사용자 단말과, 그리고 외부 기관 서버 (예를 들어, 소방서 서버 등)와 통신하도록 구성될 수 있다. 이미 기술한 바와 같이, 통신부는 IOT 디바 이스와 통신함에 있어 소정의 근거리무선통신망을 활용할 수 있고, 사용자 단말과 통신함에 있어 근 거리무선통신망에 더하여 인터넷 또는 무선통신망을 활용할 수 있다. 저장부는 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치의 동작, 기능, 역할 등에 관련된 임의의 정보, 데이터 등을 저장할 수 있다. 예를 들어, 저장부에는 IOT 디바이스에 관한 정 보, 이벤트에 관한 정보, 수집된 IOT 정보에 관한 정보, 사용자 단말에 관한 정보, MSNS 플랫폼에 관한 정 보, MSNS 플랫폼을 통해 수행되는 대화의 정보, 인공지능에 관한 정보, 기계 학습에 관한 정보, 통일된 (unified) IOT 정보통신 프로토콜에 관한 정보, 프로토콜 수정/교정에 관한 정보, 등이 저장될 수 있다. 참고로, 저장부는 통상의 기술자에게 알려진 바와 같이, HDD(Hard Disk Drive), ROM(Read Only Memory), RAM(Random Access Memory), EEPROM(Electrically Erasable and Programmable Read Only Memory), 플래시 메 모리(flash memory), CF(Compact Flash) 카드, SD(Secure Digital) 카드, SM(Smart Media) 카드, MMC(Multimedia) 카드 또는 메모리 스틱(Memory Stick) 등 정보의 입출력이 가능한 다양한 형태의 저장 장치로 구현될 수 있으며, 도 1에 도시된 바와 같이 인공지능 기반의 IOT 통합 처리 장치의 내부에 구비될 수 있 거나 또는 별도의 외부 장치에 구비될 수 있다. 또는, 저장부가 인터넷 상에서 저장 기능을 수행하는 웹 스토리지(web storage)로 대체될 수도 있다. 또한, 도 1에서는 IOT 이벤트 분석에 활용되는 이벤트 처리규칙 DB가 저장부와 별개의 블록으로 도시 되어 있지만, 저장부 내 일부 영역을 통해 이벤트 처리규칙 DB에 관한 정보가 저장되어 활용될 수도 있다. 디스플레이부는 사용자에게 다양한 영상 정보를 제공할 수 있고, 예를 들어 시계 표시 기능, 캘린더 일정 관리 기능, 영상 출력 기능 등을 제공할 수 있다. 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 평상시에는 시계 화면을 표시하는 벽걸이 시계로서 기능할 수 있고, 사용자의 음성 입력 또는 사용 자 단말을 통한 요청을 수신하는 경우, 또는 IOT 디바이스의 특정 이벤트가 발생하는 경우, 해당 이 벤트에 대응하는 동작을 수행하기 위해 사용자가 인공지능 기반의 IOT 통합 처리 장치 앞에 위치하게 되면 디스플레이부가 그에 대응하는 영상을 출력할 수 있다. 참고로, 디스플레이부는 액정 디스플레이(Liquid Crystal Display, LCD), 박막 트랜지스터 액정 디스플레 이(Thin Film Transistor-Liquid Crystal Display, TFT LCD), 유기 발광 다이오드(Organic Light-Emitting Diode, OLED), 플렉시블 디스플레이(Flexible Display), 3차원 디스플레이(3D Display) 등으로 구현될 수 있다. 제어부는 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치의 동작, 기능, 작동 등을 전반적으로 제어할 수 있다. 예를 들어, 제어부는 프로세서(processor), 컨트롤러(controller), 마이크로 -프로세서(micro-processor), 마이크로-컨트롤러(micro controller), 등으로 구현될 수 있고, 제어부는 응용 프로그램의 구동을 위하여, 인공지능 기반의 IOT 통합 처리 장치에 포함된 구성요소들(110, 120, 130, 140, 150, 160, 170, 180) 중 적어도 둘 이상을 서로 조합하여 작동시킬 수도 있다. 사용자 단말은 인공지능 기반의 IOT 통합 처리 장치와 통신 가능하게 결합될 수 있고, 단일 또는 복 수로 구비될 수 있다. 사용자 단말에는 IOT 디바이스 사이에서 수행되는 대화가 실시간으로 공유 및 전달될 수 있고, 적절하게 사용자 단말이 특정 동작에 대해 개입할 수 있다. 참고로, 사용자 단말은 가입자 유닛, 가입자국, 이동국, 모바일 단말, 원격국, 원격 단말, 모바일 디바이 스, 액세스 단말, 단말, 무선 통신 디바이스, 사용자 에이전트, 사용자 디바이스 또는 사용자 장비(UE)라고 지 칭될 수도 있다. 액세스 단말은 셀룰러 전화, 코드리스 전화, 세션 개시 프로토콜(SIP) 전화, 무선 로컬 루프 (WLL) 스테이션, 개인용 디지털 보조기(PDA), 무선 접속 능력을 구비한 핸드헬드 디바이스, 컴퓨팅 디바이스 또 는 무선 모뎀에 접속되는 다른 프로세싱 디바이스일수 있다. 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 유무선 통신망, 클라우드 등을 통해 다른 IOT 통합 처리 장치와 연결될 수 있거나, 또는 비상응급상황을 위한 소방서, 경찰서 등의 기관 서버와 연 결되어 m-SNS를 구축함으로써 다른 IOT 통합 처리 장치 및 외부 서버와 자유롭게 대화할 수 있다. 예를 들어, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치가 IOT 디바이스 및 다른 기관과 구 축할 수 있는 MSNS를 설명하기 위한 예시도가 도 2에 도시되고, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치의 구현 및 배치에 관한 예시도가 도 3에 도시되며, 본 발명의 일 실시예에 따른 인공 지능 기반의 IOT 통합 처리 장치가 IOT 디바이스 및/또는 사용자 단말과 대화하는 대화 플랫폼 의 예시도가 도 4 및 도 5에 도시된다. 도 3에 도시되는 바와 같이, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 통신에 보다 유리한 위치인 벽에 거치하도록 구성되는 벽걸이형 컴퓨터 등으로 구현될 수 있고, 그 외형은 원형, 정사 각형, 삼각형 등 다양한 형태를 가질 수 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치는 평상시에는 스마트 벽시계의 기능을 수행할 수 있고, IOT 통신은 상기대기모드로 있으므로 MSNS 기능을 수행할 때에 컴퓨팅 파워를 제공할 수 있다. 도 6a 및 도 6b는 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치에서 수행되는 통일된 (unified) IOT 정보통신 프로토콜 처리 방법을 나타내는 개념도이다. 먼저, IOT 디바이스로부터의 IOT 정보(또는 IOT 데이터)가 수집될 수 있다. 도 6a의 좌측 상단에 도시되 는 IOT 디바이스 A는 이벤트를 단순히 감지하는 IOT 디바이스에 해당하고, 예를 들어 스모크 디텍터(smoke detector)와 같이 연기를 감지하면 소정의 사운드를 출력하는 IOT 디바이스를 포함하며, 이 IOT 디바이스 A에서 발생한 이벤트 DB가 을 통하여 S2-1로 송출될 수 있다. 또한, 도 6a의 우측 상단에 도시되는 IOT 디바이스 B는 로봇 청소기 등과 같이 작업을 수행하면서 발생하는 돌 발 상황(예들 들어, '필터에 먼지가 많으니 교체해주세요', '물통에 물이 부족하니 보충해 주세요' 등)에서 이 어지는 후속 작업을 하기 이전에 사용자에게 대처 방안을 문의하기 위해 현재 상황 DB 데이터를 송출하여 사용 자로부터 명령을 받아 수행하는 디바이스에 해당하고, 이 IOT 디바이스 B에서 발생한 이벤트 DB가 을 통하 여 S2-1로 송출될 수 있다. 이벤트 DB 처리규칙을 취급하는 S2-1은 벽걸이 허브 컴퓨터(또는 허브 컴퓨터)의 처리 영역에 해당할 수 있고, 에서 딥 러닝을 통해 어셈블리 언어를 판독할 수 있다. 예를 들어, S2-2에서는 인공지능에 의해 C언어, 포틀란, 자바 등의 어셈블리 언어가 판독될 수 있고, 또한 어셈블리어의 명령어 체계가 2진수인지, 8진수인지, 16진수인지 등이 판단될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 이벤트 처리규칙에 따르면, m-SNS 플랫폼(예를 들어, IOT 디바이 스와 IOT 디바이스 사이의 오픈 채팅 또는 비공개 대화하는 대화창)을 통해 이벤트를 처리하기 위해 서 IOT 디바이스 간 통신 시에 사용되는 통신 신호를 영문 텍스트와 약 20개의 언어 텍스트 형태로 변경할 수 있도록 2000개 이상의 통일된(unified) 프로토콜(즉, 규약) 스택(stack)을 통해 IOT 디바이스의 제조사 가 사용할 수 있도록 하는 라이브러리가 제공될 수 있고, 그에 따라 IOT 디바이스와 IOT 디바이스 사 이에 전달되는 신호를 사람이 인지하고 간섭하여 수정할 수 있도록 한다. 물론, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치 및 이를 포함하는 AI 머신 사회관계망 시스템의 m-SNS 네트워 크가 확장함에 따라, 그에 대응하여 기계어와 자연어의 통일된(unified) 프로토콜 스택의 개수 또한 계속해서 증가하게 된다. 참고로, 본 명세서에서 용어 “NPUTER”는 뉴럴 컴퓨터(neural computer)의 줄임말로서, 벽걸이 허브 인공지능 컴퓨터로 구현될 수 있는 인공지능 기반의 IOT 통합 처리 장치를 지칭한다. S3-1에서는 인공지능을 통해 해당 어셈블리어를 기계어로 변환하고 이를 미리 구성된 2000개 이상의 프로토콜 기계어 부분과 프로토콜 자연어와 일치한 부분만으로 자동으로 통일된(unified) 프로토콜을 구성할 수 있다. 예를 들어, S3-1에서 해당 어셈블리어를 2진수 기계어로 변환할 수 있고, 이를 다시 16진수 기계어로 통일 변환 할 수 있다. 해당 어셈블리어를 처음부터 16진수 기계어로 변환하지 않고 2진수 기계어로 먼저 변환한 다음에 16진수 기계어로 통일 변환함으로써, 추후 기계어를 자연어로 변환 시 발생하는 오류를 최소화할 수 있다. 여기서, 16진수를 미리 구성된 2000개 이상의 프로토콜 기계어 부분과 프로토콜 자연어와 일치한 부분만으로 자 동으로 통일된(unified) 프로토콜을 구성할 수 있다. 참고로, 2000개 이상의 프로토콜을 정의한 이유는 본 발 명자들이 다양한 실험을 통해서 많은 언어 영역 중에서 인간이 삶을 영위하는 데에 약 2000개 단어가 필수적이 라는 것을 확인하였고, 이로부터 어셈블리어 -> 기계어 -> 자연어 단어로 변경되는 기본적인 과정과 틀을 명확 하게 제공하고자 한다. S4-1에서는 S3-1에서 일치하지 않는 기계어 부분을 분류할 수 있고, S4-2에서는 S3-1에서 일치하는 기계어 부분 을 분류할 수 있다. S5-1에서는 IOT 디바이스에 프로그래밍된 어셈블리어가 자연어로 쉽고 정확하게 표현될 수 있도록 2000개 의 프로토콜과 IOT 신호가 일치하지 않은 부분을 오픈 라이브러리(open library)를 제공하여 수동 교정할 수 있 도록 하고, S5-2에서는 S4-2에서 일치하여 잘 만들어진 통일된(unified) 프로토콜(또는 '통합 프로토콜'로 지칭 할 수 있음)을 묶음 파일로 처리할 수 있다. S6-1에서는 S5-1에서 처리된 교정 파일을 묶음 파일로 변환할 수 있고, S6-2에서는 묶음 통합 프로토콜을 자연 어 영문 텍스트로 변환할 수 있으며, S6-3에서는 이 영문 텍스트를 외부 API와 연동하여 약 20개국의 언어로 컨 버팅할 수 있다. S7-1에서는 S6-3에서 만들어진 자연어를 m-SNS 플랫폼 API로 송출하여 표출할 수 있다. 예를 들어, 어셈블리어 -> 기계어 -> 자연어로 및 를 통해 에 표기할 수 있다. 여기서, IOT 디바이스 A는 대화자로서 대화방으로 m-SNS 대화 플랫폼에 표기될 수 있고, IOT 디바이스 B는 대화자로서 대화방으로 m-SNS 대화 플랫폼에 표기될 수 있으며, 만약 제3의 다른 허브 컴퓨터가 대화방에 참여하고자 신청하면 대화자 또는 대화자의 수락에 따라 대화방에 참여할 수 있거나 또는 대화자 또는 대화자가 제3의 다른 허브 컴퓨터를 초대하고 이를 수락함으로써 대화방에 참여할 수 있다. S7-1에서 자연어 대화자(901, 902)가 IOT 디바이스 A 및 IOT 디바이스 B와 대화를 시작하면, S7-2에서 자연어로 들어온 DB가 역순으로 처리되어 m-SMS 대화 플랫폼 API로 송출되어 표출될 수 있고 대화방은 m-SMS 대화 플 랫폼에서 로 표기될 수 있다(즉, 자연어 -> 기계어 -> 어셈블리어). 이후, S8-1에서는 이러한 소프트 웨어 알고리즘을 NPUTER의 하드웨어 제어 시스템과 연동시킬 수 있다. 상술한 바와 같이, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치, 이를 포함하는 AI 머신 사회관계망 시스템과 그 방법에 의하면, 인공지능 기반의 IOT 통합 처리 장치와 IOT 디바이스와 사용자 단말 간 에 네트워크를 형성하고 이를 확장함으로써 인공지능 기반의 IOT 통합 처리 장치와 IOT 디바이스와 사용자 단말 이 자율적으로 대화를 수행하도록 할 수 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치, 이를 포함하는 AI 머신 사회관계망 시 스템과 그 방법에 의하면, 이벤트를 텍스트로 자동 표현 처리하는 이벤트 처리규칙(또는 프로토콜 관계망 처리 규칙) DB에 따라 특정 처리 동작이 필요한 경우 자동으로 또는 사용자의 개입으로 특정 IOT 디바이스에 대한 특 정한 동작 명령을 생성하여 해당 IOT 디바이스로 전송함으로써 환경이나 상황에 맞는 동작을 효율적으로 수행하 도록 할 수 있다. 한편, 본 명세서에 기재된 다양한 실시예들은 하드웨어, 미들웨어, 마이크로코드, 소프트웨어 및/또는 이들의 조합에 의해 구현될 수 있다. 예를 들어, 다양한 실시예들은 하나 이상의 주문형 반도체(ASIC)들, 디지털 신호 프로세서(DSP)들, 디지털 신호 프로세싱 디바이스(DSPD)들, 프로그램어블 논리 디바이스(PLD)들, 필드 프로그램 어블 게이트 어레이(FPGA)들, 프로세서들, 컨트롤러들, 마이크로컨트롤러들, 마이크로프로세서들, 여기서 제시 되는 기능들을 수행하도록 설계되는 다른 전자 유닛들 또는 이들의 조합 내에서 구현될 수 있다. 또한, 예를 들어, 다양한 실시예들은 명령들을 포함하는 컴퓨터-판독가능한 매체에 수록되거나 인코딩될 수 있 다. 컴퓨터-판독가능한 매체에 수록 또는 인코딩된 명령들은 프로그램 가능한 프로세서 또는 다른 프로세서로 하여금 예컨대, 명령들이 실행될 때 방법을 수행하게끔 할 수 있다. 컴퓨터-판독가능한 매체는 컴퓨터 저장 매 체를 포함하며, 컴퓨터 저장 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수도 있다. 예를 들어, 이러한 컴퓨터-판독가능한 매체는 RAM, ROM, EEPROM, CD-ROM 또는 기타 광학 디스크 저장 매체, 자기 디 스크 저장 매체 또는 기타 자기 저장 디바이스를 포함할 수 있다. 이러한 하드웨어, 소프트웨어, 펌웨어 등은 본 명세서에 기술된 다양한 동작들 및 기능들을 지원하도록 동일한 디바이스 내에서 또는 개별 디바이스들 내에서 구현될 수 있다. 추가적으로, 본 발명에서 \"~부\"로 기재된 구성 요소들, 유닛들, 모듈들, 컴포넌트들 등은 함께 또는 개별적이지만 상호 운용 가능한 로직 디바이스들로서 개별 적으로 구현될 수 있다. 모듈들, 유닛들 등에 대한 서로 다른 특징들의 묘사는 서로 다른 기능적 실시예들을 강 조하기 위해 의도된 것이며, 이들이 개별 하드웨어 또는 소프트웨어 컴포넌트들에 의해 실현되어야만 함을 필수 적으로 의미하지 않는다. 오히려, 하나 이상의 모듈들 또는 유닛들과 관련된 기능은 개별 하드웨어 또는 소프트 웨어 컴포넌트들에 의해 수행되거나 또는 공통의 또는 개별의 하드웨어 또는 소프트웨어 컴포넌트들 내에 통합 될 수 있다. 이상에서와 같이 도면과 명세서에서 최적 실시예가 개시되었다. 여기서 특정한 용어들이 사용되었으나, 이는 단 지 본 발명을 설명하기 위한 목적에서 사용된 것이지 의미한정이나 특허청구범위에 기재된 본 발명의 범위를 제한하기 위하여 사용된 것은 아니다. 그러므로 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호범위는 첨부된 특 허청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2022-0141256", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위하여 각 도면의 간단한 설명이 제공된다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치 및 이를 포함하는 AI 머신 사회 관계망 시스템의 블록도이다. 도 2는 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치가 IOT 디바이스 및 다른 기 관과 구축할 수 있는 MSNS를 설명하기 위한 예시도이다. 도 3은 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치의 구현 및 배치에 관한 예시도이 다. 도 4 및 도 5는 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치가 IOT 디바이스 및 /또는 사용자 단말과 대화하는 대화 플랫폼의 예시도이다. 도 6a 및 도 6b는 본 발명의 일 실시예에 따른 인공지능 기반의 IOT 통합 처리 장치에서 수행되는 통일된 (unified) IOT 정보통신 프로토콜 처리 방법을 나타내는 개념도이다."}
