{"patent_id": "10-2023-0079185", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0177618", "출원번호": "10-2023-0079185", "발명의 명칭": "사운드 마스킹 장치 및 방법", "출원인": "현대자동차주식회사", "발명자": "김기창"}}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량 내 탑승자의 영상 정보 및 생체 정보를 측정하는 센싱부; 및상기 센싱부와 연결되는 제어부를 포함하고,상기 제어부는,상기 생체 정보에 기반하여 상기 탑승자의 수면 상태를 판단하고,상기 탑승자의 수면 상태에서 상기 영상 정보를 토대로 상기 탑승자가 수면 방해를 받고 있는지를 결정하고,상기 탑승자가 수면 방해를 받고 있다고 결정되는 경우 상기 차량 내부의 소음을 측정하고,측정된 소음에 기반하여 사운드 마스킹이 필요한지를 결정하고,상기 사운드 마스킹이 필요하다고 결정되는 경우 상기 수면 상태에 기반하여 사운드 마스킹을 수행하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제어부는,뇌파 측정 장치에 의해 측정되는 뇌파 신호의 패턴을 분석하여 상기 탑승자의 수면 상태를 결정하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 제어부는,상기 영상 정보를 분석하여 상기 탑승자의 신체기관 변화 및 신체 움직임을 모니터링하고,상기 탑승자의 신체기관 변화, 신체 움직임 패턴, 또는 이들의 어느 조합 중 적어도 하나에 기반하여 상기 탑승자가 수면 방해를 받고 있는지를 결정하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 제어부는,상기 탑승자의 눈 깜박임 지속 시간이 기정해진 기준 시간 이하인 경우, 신체 움직임 패턴이 렘 수면 행동 장애패턴인 경우, 또는 이들의 어느 조합 중 적어도 하나에 해당하는 경우 상기 탑승자가 수면 방해를 받고 있다고결정하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,공개특허 10-2024-0177618-3-상기 제어부는,상기 측정된 소음의 크기를 기정해진 기준치와 비교하고,상기 측정된 소음의 크기가 상기 기정해진 기준치 이상인 경우 사운드 마스킹이 필요하다고 결정하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 제어부는,상기 수면 상태가 수면 경계 단계에서 수면 단계로 전환되는 상태인 경우 마스킹 음원으로 백색 소음을 선택하고,선택된 백색 소음을 재생하여 출력하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 제어부는,상기 선택된 백색 소음을 랜덤하게 재생하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 제어부는,상기 수면 상태가 수면 단계에서 숙면 단계로 전환되는 상태인 경우 마스킹 음원으로 핑크 소음을 선택하고,선택된 핑크 소음을 재생하여 출력하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 제어부는,상기 측정된 소음의 크기에 기반하여 상기 핑크 소음의 크기를 제어하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 제어부는,사운드 마스킹의 사용 목적에 따라 마스킹 음원을 선택하여 재생하는 것을 특징으로 하는 사운드 마스킹 장치."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2024-0177618-4-센싱부에 의해 측정되는 차량 내 탑승자의 생체 정보에 기반하여 상기 탑승자의 수면 상태를 판단하는 단계;상기 탑승자의 수면 상태에서 상기 센싱부에 의해 획득되는 탑승자의 영상 정보를 토대로 상기 탑승자가 수면방해를 받고 있는지를 결정하는 단계;상기 탑승자가 수면 방해를 받고 있다고 결정되는 경우 상기 차량 내부의 소음을 측정하는 단계;측정된 소음에 기반하여 사운드 마스킹이 필요한지를 결정하는 단계; 및상기 사운드 마스킹이 필요하다고 결정되는 경우 상기 수면 상태에 기반하여 사운드 마스킹을 수행하는 단계를포함하는 것을 특징으로 하는 사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 탑승자의 수면 상태를 판단하는 단계는,뇌파 측정 장치에 의해 측정되는 뇌파 신호의 패턴을 분석하는 단계; 및분석된 뇌파 신호의 패턴에 기반하여 상기 탑승자의 수면 상태를 결정하는 단계를 포함하는 것을 특징으로 하는사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서,상기 탑승자가 수면 방해를 받고 있는지를 결정하는 단계는,상기 영상 정보를 분석하여 상기 탑승자의 신체기관 변화 및 신체 움직임을 모니터링하는 단계; 및상기 탑승자의 신체기관 변화, 신체 움직임 패턴, 또는 이들의 어느 조합 중 적어도 하나에 기반하여 상기 탑승자가 수면 방해를 받고 있는지를 결정하는 단계를 포함하는 것을 특징으로 하는 사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 11에 있어서,상기 탑승자가 수면 방해를 받고 있는지를 결정하는 단계는,상기 탑승자의 눈 깜박임 지속 시간이 기정해진 기준 시간 이하인 경우, 신체 움직임 패턴이 렘 수면 행동 장애패턴인 경우, 또는 이들의 어느 조합 중 적어도 하나에 해당하는 경우 상기 탑승자가 수면 방해를 받고 있다고결정하는 단계를 포함하는 것을 특징으로 하는 사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 11에 있어서,상기 사운드 마스킹이 필요한지를 결정하는 단계는,상기 측정된 소음의 크기를 기정해진 기준치와 비교하는 단계; 및상기 측정된 소음의 크기가 상기 기정해진 기준치 이상인 경우 사운드 마스킹이 필요하다고 결정하는 단계를 포함하는 것을 특징으로 하는 사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2024-0177618-5-청구항 11에 있어서,상기 사운드 마스킹을 수행하는 단계는,상기 수면 상태가 수면 경계 단계에서 수면 단계로 전환되는 상태인 경우 마스킹 음원으로 백색 소음을 선택하는 단계; 및선택된 백색 소음을 재생하여 출력하는 단계를 포함하는 것을 특징으로 하는 사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 선택된 백색 소음을 재생하여 출력하는 단계는,상기 선택된 백색 소음을 랜덤하게 재생하는 단계를 포함하는 것을 특징으로 하는 사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 11에 있어서,상기 사운드 마스킹을 수행하는 단계는,상기 수면 상태가 수면 단계에서 숙면 단계로 전환되는 상태인 경우 마스킹 음원으로 핑크 소음을 선택하는 단계; 및선택된 핑크 소음을 재생하여 출력하는 단계를 포함하는 것을 특징으로 하는 사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 18에 있어서,상기 선택된 핑크 소음을 재생하여 출력하는 단계는,상기 측정된 소음의 크기에 기반하여 상기 핑크 소음의 크기를 제어하는 단계를 포함하는 것을 특징으로 하는사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 11에 있어서,상기 사운드 마스킹을 수행하는 단계는,사운드 마스킹의 사용 목적에 따라 마스킹 음원을 선택하여 재생하는 단계를 포함하는 것을 특징으로 하는 사운드 마스킹 방법."}
{"patent_id": "10-2023-0079185", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사운드 마스킹 장치 및 방법에 관한 것으로, 차량 내 탑승자의 영상 정보 및 생체 정보를 측정하는 센 싱부, 및 상기 센싱부와 연결되는 제어부를 포함하고, 상기 제어부는, 상기 생체 정보에 기반하여 상기 탑승자의 수면 상태를 판단하고, 상기 탑승자의 수면 상태에서 상기 영상 정보를 토대로 상기 탑승자가 수면 방해를 받고 있는지를 결정하고, 상기 탑승자가 수면 방해를 받고 있다고 결정되는 경우 상기 차량 내부의 소음을 측정하고, 측정된 소음에 기반하여 사운드 마스킹이 필요한지를 결정하고, 상기 사운드 마스킹이 필요하다고 결정되는 경우 상기 수면 상태에 기반하여 사운드 마스킹을 수행할 수 있다."}
{"patent_id": "10-2023-0079185", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사운드 마스킹 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0079185", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율주행 차량에는 안전과 주행 성능뿐만 아니라 차량의 안락함과 편안함을 제공하기 위해 다양한 기술이 적용 되고 있다. 이러한 기술 중 하나로 소음 저감 장치를 들 수 있다. 소음 저감 장치는 주행 시 발생되는 소음을실시간으로 분석하여 이를 상쇄시키는 반대 위상 음파를 발생시켜 소음을 저감할 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2022-0010089 A (특허문헌 0002) KR 10-2021-0136817 A (특허문헌 0003) KR 10-2021-0130325 A"}
{"patent_id": "10-2023-0079185", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 사용자의 수면 상태를 판단하여 수면을 유도하며 수면 방해 사운드를 마스킹하는 사운드 마스킹 장치 및 방법을 제공하고자 한다. 또한, 본 발명은 영상 정보 및/또는 생체 정보에 기반하여 수면 단계 및 수면질을 판단하고, 판단된 수면 단계 및/또는 수면질에 기반하여 마스킹 사운드(또는 마스킹 음원)를 재생하는 사운드 마스킹 장치 및 방법을 제공하 고자 한다."}
{"patent_id": "10-2023-0079185", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예들에 따른 사운드 마스킹 장치는 차량 내 탑승자의 영상 정보 및 생체 정보를 측정하는 센싱 부, 및 상기 센싱부와 연결되는 제어부를 포함하고, 상기 제어부는, 상기 생체 정보에 기반하여 상기 탑승자의 수면 상태를 판단하고, 상기 탑승자의 수면 상태에서 상기 영상 정보를 토대로 상기 탑승자가 수면 방해를 받고 있는지를 결정하고, 상기 탑승자가 수면 방해를 받고 있다고 결정되는 경우 상기 차량 내부의 소음을 측정하고, 측정된 소음에 기반하여 사운드 마스킹이 필요한지를 결정하고, 상기 사운드 마스킹이 필요하다고 결정되는 경 우 상기 수면 상태에 기반하여 사운드 마스킹을 수행할 수 있다. 상기 제어부는, 뇌파 측정 장치에 의해 측정되는 뇌파 신호의 패턴을 분석하여 상기 탑승자의 수면 상태를 결정 할 수 있다. 상기 제어부는, 상기 영상 정보를 분석하여 상기 탑승자의 신체기관 변화 및 신체 움직임을 모니터링하고, 상기 탑승자의 신체기관 변화, 신체 움직임 패턴, 또는 이들의 어느 조합 중 적어도 하나에 기반하여 상기 탑승자가 수면 방해를 받고 있는지를 결정할 수 있다. 상기 제어부는, 상기 탑승자의 눈 깜박임 지속 시간이 기정해진 기준 시간 이하인 경우, 신체 움직임 패턴이 렘 수면 행동 장애 패턴인 경우, 또는 이들의 어느 조합 중 적어도 하나에 해당하는 경우 상기 탑승자가 수면 방해 를 받고 있다고 결정할 수 있다. 상기 제어부는, 상기 측정된 소음의 크기를 기정해진 기준치와 비교하고, 상기 측정된 소음의 크기가 상기 기정 해진 기준치 이상인 경우 사운드 마스킹이 필요하다고 결정할 수 있다. 상기 제어부는, 상기 수면 상태가 수면 경계 단계에서 수면 단계로 전환되는 상태인 경우 마스킹 음원으로 백색 소음을 선택하고, 선택된 백색 소음을 재생하여 출력할 수 있다. 상기 제어부는, 상기 선택된 백색 소음을 랜덤하게 재생할 수 있다. 상기 제어부는, 상기 수면 상태가 수면 단계에서 숙면 단계로 전환되는 상태인 경우 마스킹 음원으로 핑크 소음 을 선택하고, 선택된 핑크 소음을 재생하여 출력할 수 있다. 상기 제어부는, 상기 측정된 소음의 크기에 기반하여 상기 핑크 소음의 크기를 제어할 수 있다. 상기 제어부는, 사운드 마스킹의 사용 목적에 따라 마스킹 음원을 선택하여 재생할 수 있다. 본 발명의 실시 예들에 따른 사운드 마스킹 방법은 센싱부에 의해 측정되는 차량 내 탑승자의 생체 정보에 기반 하여 상기 탑승자의 수면 상태를 판단하는 단계, 상기 탑승자의 수면 상태에서 상기 센싱부에 의해 획득되는 탑승자의 영상 정보를 토대로 상기 탑승자가 수면 방해를 받고 있는지를 결정하는 단계, 상기 탑승자가 수면 방해 를 받고 있다고 결정되는 경우 상기 차량 내부의 소음을 측정하는 단계, 측정된 소음에 기반하여 사운드 마스킹 이 필요한지를 결정하는 단계, 및 상기 사운드 마스킹이 필요하다고 결정되는 경우 상기 수면 상태에 기반하여 사운드 마스킹을 수행하는 단계를 포함할 수 있다. 상기 탑승자의 수면 상태를 판단하는 단계는, 뇌파 측정 장치에 의해 측정되는 뇌파 신호의 패턴을 분석하는 단 계, 및 분석된 뇌파 신호의 패턴에 기반하여 상기 탑승자의 수면 상태를 결정하는 단계를 포함할 수 있다. 상기 탑승자가 수면 방해를 받고 있는지를 결정하는 단계는, 상기 영상 정보를 분석하여 상기 탑승자의 신체기 관 변화 및 신체 움직임을 모니터링하는 단계, 및 상기 탑승자의 신체기관 변화, 신체 움직임 패턴, 또는 이들 의 어느 조합 중 적어도 하나에 기반하여 상기 탑승자가 수면 방해를 받고 있는지를 결정하는 단계를 포함할 수 있다. 상기 탑승자가 수면 방해를 받고 있는지를 결정하는 단계는, 상기 탑승자의 눈 깜박임 지속 시간이 기정해진 기 준 시간 이하인 경우, 신체 움직임 패턴이 렘 수면 행동 장애 패턴인 경우, 또는 이들의 어느 조합 중 적어도 하나에 해당하는 경우 상기 탑승자가 수면 방해를 받고 있다고 결정하는 단계를 포함할 수 있다. 상기 사운드 마스킹이 필요한지를 결정하는 단계는, 상기 측정된 소음의 크기를 기정해진 기준치와 비교하는 단 계, 및 상기 측정된 소음의 크기가 상기 기정해진 기준치 이상인 경우 사운드 마스킹이 필요하다고 결정하는 단 계를 포함할 수 있다. 상기 사운드 마스킹을 수행하는 단계는, 상기 수면 상태가 수면 경계 단계에서 수면 단계로 전환되는 상태인 경 우 마스킹 음원으로 백색 소음을 선택하는 단계, 및 선택된 백색 소음을 재생하여 출력하는 단계를 포함할 수 있다. 상기 선택된 백색 소음을 재생하여 출력하는 단계는, 상기 선택된 백색 소음을 랜덤하게 재생하는 단계를 포함 할 수 있다. 상기 사운드 마스킹을 수행하는 단계는, 상기 수면 상태가 수면 단계에서 숙면 단계로 전환되는 상태인 경우 마 스킹 음원으로 핑크 소음을 선택하는 단계, 및 선택된 핑크 소음을 재생하여 출력하는 단계를 포함할 수 있다. 상기 선택된 핑크 소음을 재생하여 출력하는 단계는, 상기 측정된 소음의 크기에 기반하여 상기 핑크 소음의 크 기를 제어하는 단계를 포함할 수 있다. 상기 사운드 마스킹을 수행하는 단계는, 사운드 마스킹의 사용 목적에 따라 마스킹 음원을 선택하여 재생하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0079185", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 사용자의 수면 상태를 판단하여 수면을 유도하며 수면 방해 사운드를 마스킹하므로, 사용자의 숙면을 유도할 수 있다. 또한, 본 발명은 영상 정보 및/또는 생체 정보에 기반하여 수면 단계 및 수면질을 판단하고, 판단된 수면 단계 및/또는 수면질에 기반하여 마스킹 사운드를 재생하므로, 사용자의 수면을 유도할 수 있다."}
{"patent_id": "10-2023-0079185", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시 예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시 예를 설명함에 있어, 관련된 공지 구성 또는 기능 에 대한 구체적인 설명이 본 발명의 실시 예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생 략한다. 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있 다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 또한, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어 를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일 반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의 하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 도 1은 본 발명의 실시 예들에 따른 사운드 마스킹 장치를 도시한 블록구성도이다. 사운드 마스킹 장치는 SAE(Society of Automotive Engineers)에서 정의한 자동화 레벨 0 내지 5 중 레벨 3 이상의 자율주행 기능이 탑재된 차량에 장착될 수 있다. 레벨 3(partial automation)은 고속도로와 같은 특정 조건의 구간에서 시스템이 주행을 담당하며 위험 시에만 운전자가 개입하는 레벨이다. 도 1을 참조하면, 사운드 마스킹 장치는 차량 내 네트워크를 통해 연결되는 사용자 인터페이스부(human interface device), 통신부, 센싱부, 시트 제어부(seat controller) 및 제어부를 포 함할 수 있다. 차량 내 네트워크는 CAN(Controller Area Network), MOST(Media Oriented Systems Transport) 네트워크, LIN(Local Interconnect Network), 이더넷(ethernet) 및/또는 X-by-Wire(Flexray) 등으로 구현될 수 있다. 사용자 인터페이스부는 사운드 마스킹 장치와 사용자(예: 운전자, 탑승자) 간의 상호 작용을 도와주 는 장치일 수 있다. 사용자 인터페이스부는 사용자의 조작에 따른 데이터를 발생시키는 입력 장치(예: 키 보드, 터치 패드, 마이크 및/또는 터치 스크린 등) 및/또는 사운드 마스킹 장치의 동작에 따른 정보를 출 력하는 출력 장치(예: 디스플레이, 스피커 및/또는 진동 발생 장치 등) 등을 포함할 수 있다. 이러한 사용자 인 터페이스부는 AVN(Audio, Video, Navigation) 단말, 인포테인먼트(in-vehicle infortainment) 단말, 텔레 매틱스(telematics) 단말, 및/또는 포터블 스피커 등으로 구현될 수 있다. 사용자 인터페이스부는 수면 테라피 기능을 온(on) 또는 오프(off)할 수 있는 기능 온/오프 버튼 및 사운 드 마스킹 기능을 온 또는 오프할 수 있는 기능 온/오프 버튼을 포함할 수 있다. 기능 온/오프 버튼들은 하드웨 어적 버튼 및/또는 소프트웨어적 버튼으로 구현될 수 있다. 통신부는 사운드 마스킹 장치와 외부 전자 장치(예: 서버, 전자제어장치(Electronic Control Unit, ECU), 사용자 장치, 스마트폰 등) 간의 통신 수행을 지원할 수 있다. 통신부는 무선 통신 회로(예: 셀룰러 통신 회로, 와이파이 통신 회로, 근거리 무선 통신 회로 또는 GNSS(global navigation satellite system) 통신 회로) 및/또는 유선 통신 회로(예: LAN(local area network) 통신 회로, 또는 전력선 통신 회로)를 포함할 수 있다. 통신부는 외부 전자 장치로부터 전송되는 마스킹 음원을 수신할 수 있다. 센싱부는 카메라 및/또는 생체 신호 측정 장치(예: 뇌파 측정 장치, 심전도 측정 장치) 등을 이용하여 차 량 내 탑승자의 영상 정보 및 생체 정보를 측정할 수 있다. 생체 정보는 뇌파 및/또는 심박수 등을 포함할 수있다. 센싱부는 마이크로폰을 이용하여 차량 내부 소음을 측정할 수 있다. 마이크로폰은 차량 내 적어도 하나 이 상이 설치될 수 있다. 예를 들어, 마이크로폰은 대시보드 및 후석 실내등 주변에 각각 설치될 수 있다. 센싱부는 차량에 장착된 센서들 및/또는 전자제어장치 등을 이용하여 주행 정보를 획득할 수 있다. 센서들 은 휠속 센서, IMU(Inertial Measurement Unit), 이미지 센서, 레이더(Radio Detecting And Ranging, RADAR), 라이다(Light Detection And Ranging, LiDAR) 및/또는 조향각 센서 등을 포함할 수 있다. 주행 정보는 차량 속 도, 도로 곡률, 차선 이탈 여부 및/또는 조향각 등을 포함할 수 있다. 시트 제어부는 차량 시트 내부에 장착된 복수 개의 진동자들을 제어할 수 있다. 시트 제어부는 숙면 테라피 기능이 온 되면 기정해진 진동 주파수, 진동 패턴 및/또는 진동 파형 등에 기반하여 복수 개의 진동자들 을 제어할 수 있다. 다시 말해서, 시트 제어부는 복수 개의 진동자들을 제어하여 시트 진동을 발생시킬 수 있다. 제어부는 사운드 마스킹 장치의 전반적인 동작을 제어할 수 있다. 제어부는 프로세서 및 메모리를 포함할 수 있다. 프로세서는 ASIC(Application Specific Integrated Circuit), DSP(Digital Signal Processor), PLD(Programmable Logic Device), FPGA(Field Programmable Gate Array), CPU(Central Processing unit), 마이크로컨트롤러(microcontroller), 마이크로프로세서(microprocessor) 또는 이들의 어느 조합 중 적어도 하나로 구현될 수 있다. 메모리는 프로세서에 의해 실행되는 명령어들 (instructions)을 저장하는 저장매체(non-transitory storage medium)일 수 있다. 메모리는 플래시 메모 리(flash memory), 하드디스크(hard disk), SSD(Solid State Disk), RAM(Random Access Memory), SRAM(Static Random Access Memory), ROM(Read Only Memory), PROM(Programmable Read Only Memory), EEPROM(Electrically Erasable and Programmable ROM), EPROM(Erasable and Programmable ROM) 또는 이들의 어느 조합 중 적어도 하 나로 구현될 수 있다. 메모리에는 사운드 마스킹 알고리즘 및/또는 사운드 마스킹 제어 로직 등이 저장될 수 있다. 제어부는 사용자 인터페이스부로부터 숙면 테라피 기능 온 명령을 수신하면 숙면 테라피 기능을 실행 할 수 있다. 제어부는 숙면 테라피 기능이 실행되면 시트 제어부를 제어하여 숙면을 유도하는 진동을 시트에 발생시킬 수 있다. 또한, 제어부는 수면 유도 음원을 재생하여 사용자 인터페이스부를 통해 외부로 출력할 수 있다. 제어부는 센싱부를 이용하여 탑승자의 얼굴 표정 및/또는 착좌 자세, 및/또는 뇌파(또는 뇌파 신호) 를 모니터링할 수 있다. 제어부는 카메라 및/또는 생체 신호 측정 장치를 통해 탑승자의 얼굴 표정 및/또 는 착좌 자세(또는 뒤척임, 신체움직임), 및/또는 뇌파 패턴을 모니터링할 수 있다. 제어부는 탑승자의 시 선 및/또는 눈 깜박임 등과 같은 신체기관(예: 눈)의 변화를 모니터링할 수 있다. 제어부는 탑승자의 눈 깜박임 지속시간이 800ms 이상이면 수면 상태를 수면 단계라고 판단하고, 탑승자의 눈 깜박임 지속 시간이 400 초과 800ms 미만이면 수면 상태를 수면 경계 단계라고 판단할 수 있다. 또한, 제어부는 탑승자의 눈 깜박 임 지속 시간이 400ms 이하이면 수면 상태가 수면 방해 단계(또는 수면 방해 상태)라고 판단할 수 있다. 제어부 는 탑승자의 착좌 자세 변화(예: 거동량)를 모니터링할 수 있다. 제어부는 탑승자의 주기적인 움직임 이 인식되는 경우 정상 수면이라고 판단할 수 있고, 탑승자가 움찔하면서 큰 움직임의 램 수면 행동 장애(예: 꿈 행동) 패턴이 인식되는 경우 탑승자가 수면 방해를 받고 있다고 판단할 수 있다. 제어부는 뇌파 측정을 통해 수면 주기(sleep cycle) 분석이 가능하고, 수면 주기 분석 결과에 근거하여 정상 수면 또는 수면 방해라고 판단할 수 있다. 제어부는 카메라에 의해 획득된 영상 정보 및/또는 생체 신호 측정 장치에 의해 측정된 생체 신호에 기반 하여 탑승자가 수면 방해를 받고 있는지를 판단할 수 있다. 제어부는 탑승자가 수면 방해를 받고 있다고 판단되는 경우 마이크로폰을 이용하여 차량 내부의 소음을 측 정할 수 있다. 한편, 제어부는 탑승자가 수면 방해를 받고 있지 않다고 판단되는 경우 수면 상태가 정상 수면(또는 정상 수면 상태)이라고 결정(판단)할 수 있다. 제어부는 마이크로폰에 의해 측정된 소음의 크기에 기반하여 사운드 마스킹이 필요한지 여부를 결정할 수 있다. 제어부는 측정된 소음의 크기를 기정해진 기준치와 비교하고 그 비교결과에 기반하여 사운드 마스킹 필요 여부를 결정할 수 있다. 제어부는 사운드 마스킹이 필요하다고 결정되는 경우 사운드 마스킹을 수행할 수 있다. 제어부는 수 면 상태 및/또는 사용 목적(예: 층간 소음 저감, 스트레스 해소, 업무 집중 등)에 기반하여 마스킹 사운드(또는 마스킹 음원)을 결정할 수 있다. 마스킹 사운드로는 백색 소음(White Noise), 핑크 소음(Pink Noise), 브라운 소음 (Brown Noise) 또는 이들의 어느 조합 중 적어도 하나가 사용될 수 있다. 백색 소음은 전자 자유 운동으로 전자 장비의 잡음이며, 주파수에 대해 균일한 스펙트럼을 가진다. 백색 소음에는 빗소리, 파도 소리, 산사 종소 리, 새소리 등이 있다. 핑크 소음은 매 옥타브 동일한 에너지량을 가지는 잡음이며, 음향 특성 측정 시험용 음 원으로 사용된다. 핑크 소음에는 숲 소리, 시냇물 소리, 바람 소리, 풀벌레 소리 등이 있다. 브라운 소음은 백 색 소음에서 고주파 영역을 완전 제거한 음향으로 좀 더 낮은 음역에서 편안한 소리를 낸다. 브라운 소음에는 멀리서 들리는 급류 흐르는 소리, 천둥 소리 등이 있다. 제어부는 사운드 마스킹이 필요하지 않다고 결정되는 경우 측정된 소음을 수용 가능한 소음으로 판단할 수 있다. 다시 말해서, 제어부는 사운드 마스킹이 불필요하다고 결정되는 경우 측정된 소음이 수용 가능하다 고 결정할 수 있다. 도 2는 본 발명의 실시 예들과 관련된 수면 상태 판단 과정을 설명하기 위한 도면이다. 도 2를 참조하면, 사운드 마스킹 장치의 제어부는 뇌파 측정 장치를 이용하여 뇌파 신호(또는 뇌파) 를 측정할 수 있다. 제어부는 측정되는 뇌파 신호의 패턴을 분석하여 사용자(예: 탑승자, 운전자 등)의 수 면 상태를 판단할 수 있다. 제어부는 측정되는 뇌파 신호가 세타파인 경우 수면 상태(또는 수면 단계)를 수면 경계 단계(또는 제1 수 면 단계, 입면 단계)로 판단할 수 있다. 제어부는 측정되는 뇌파 신호가 델타파인 경우 수면 상태를 수면 단계(또는 제2 수면 단계, 얕은 수면 단계)로 판단하고, 측정되는 뇌파 신호가 베타파인 경우 수면 상태를 숙면 단계(또는 제3 수면 단계, 깊은 수면 단계)로 판단할 수 있다. 도 3은 본 발명의 실시 예들과 관련된 수면 단계 판단 과정을 설명하기 위한 도면이다. 도 3을 참조하면, 사운드 마스킹 장치의 제어부는 카메라를 통해 탑승자의 신체 움직임 모니터링 을 수행할 수 있다. 예컨대, 제어부는 카메라에 의해 획득된 영상 정보를 분석하여 탑승자의 뒤척임 및/또는 착좌 자세 변화 등을 감지할 수 있다. 제어부는 카메라를 통해 탑승자의 신체기관의 변화 모니터링을 수행할 수 있다. 제어부는 카메 라에 의해 획득되는 영상 정보로부터 탑승자의 눈 깜박임 및/또는 시선 변화 등을 감지할 수 있다. 제어부는 생체 신호 측정 장치를 이용하여 생체 신호 패턴 분석을 수행할 수 있다. 제어부는 뇌 파 측정 장치를 이용하여 뇌파 신호를 측정하고, 측정된 뇌파 신호의 패턴을 분석할 수 있다. 또한, 제어부는 차량이 주행하는 중 차선 이탈 경보 시스템을 통해 차선 이탈 여부 모니터링을 수행 할 수 있다. 제어부는 탑승자의 신체 움직임 및/또는 신체기관의 변화를 모니터링한 결과, 생체 신호 패턴 분석 결과 및/또는 차선 이탈 여부 등에 기반하여 수면 단계를 결정(인식)할 수 있다. 수면 단계는 3단계 또는 4단계로 구 분될 수 있다. 제어부는 수면 단계에 따른 수면 유도 방식을 적용할 수 있다. 제어부는 수면 단계가 1단계로 결정되는 경우 음성 인터랙션 기술을 활용하여 수면 필요성을 알리는 알림 을 디스플레이 및/또는 스피커 등을 통해 지속적으로 출력할 수 있다. 제어부는 수면 단계가 2단계로 결정되는 경우 내비게이션 단말과 연계하여 휴게소 및/또는 졸음 쉼터 등을 안내하며 졸음 운전 가능성이 있음을 나타내는 경고를 출력할 수 있다. 제어부는 수면 단계가 3단계로 결정되는 경우, 수면 유도 기술을 활용하여 시동 오프 시 시트에 숙면 진동 을 발생시킬 수 있다. 제어부는 수면 단계가 4단계로 결정되는 경우, 기분 좋게 잠에서 깨우는 주파수와 시트 진동 패턴에 기반 한 알람 진동을 시트에 발생시킬 수 있다. 일 예로, 제어부는 뇌파가 베타파와 감마파인 경우 각성 음악과 진동을 연계하여 출력할 수 있다. 다른 일 예로, 제어부는 수면 및 숙면 주기를 고려하여 수면 5단 계에 진동 가진을 출력할 수 있다. 또 다른 일 예로, 제어부는 각성 진동 가진 주파수가 65~85Hz이고 각성 진동 가진 패턴을 비트성 진동으로 출력할 수 있다.도 4는 본 발명의 실시 예들과 관련된 수면 방해 판단 방법을 설명하기 위한 도면이다. 도 4를 참조하면, 사운드 마스킹 장치의 제어부는 센싱부를 통해 뇌파 신호를 측정할 수 있다 (S100). 다시 말해서, 제어부는 뇌파 측정 장치를 이용하여 탑승자의 뇌파 신호를 측정할 수 있다. 제어부는 측정되는 뇌파 신호에 기반하여 수면 주기(sleep cycle)를 분석할 수 있다(S110). 제어부는 측정되는 뇌파 신호를 분석하여 렘(rapid eye movement, REM) 수면과 논렘(non-REM) 수면으로 구성되는 1회의 수면 주기(예: 90분)를 판단할 수 있다. 제어부는 분석된 수면 주기가 정상 수면 주기(또는 기분 좋은 수면 주기)인 경우 정상 수면이라고 판단할 수 있다(S120). 제어부는 수면 주기가 90분인 경우 수면 주기가 정상 수면 주기라고 결정할 수 있다. 제어부는 분석된 수면 주기가 불면 주기(또는 잠을 깊이 못 자는 불면 주기)인 경우 수면 방해라고 판단할 수 있다(S130). 예를 들어, 제어부는 수면 주기가 30분인 경우 수면 주기가 불면 주기라고 판단할 수 있다. 도 5는 본 발명의 실시 예들과 관련된 사운드 마스킹 필요 판단 과정을 설명하기 위한 도면이다. 사운드 마스킹 장치의 제어부는 센싱부를 통해 수면 방해를 감지할 수 있다(S200). 제어부(15 0)는 카메라로부터 수신되는 영상 정보를 분석하여 수면 방해 여부를 인식할 수 있다. 예를 들어, 제어부 는 탑승자의 눈 깜박임 지속 시간이 400ms 이하인 경우 및/또는 렘 수면 행동장애 패턴(예: 뒤척임)이 감지되는 경우 탑승자가 수면 방해를 받고 있는 상태(즉, 수면 방해 상태)라고 결정할 수 있다. 제어부는 수면 방해가 감지되는 경우 마이크로폰을 이용하여 차량 내부의 소음을 측정할 수 있다(S210). 제어부는 탑승자의 수면을 방해하는 소음의 크기를 측정할 수 있다. 제어부는 측정된 소음의 크기에 기반하여 사운드 마스킹이 필요한지를 결정할 수 있다(S220). 제어부(15 0)는 측정된 소음의 크기가 기정해진 기준치(예: 66dB) 이상인지를 확인할 수 있다. 제어부는 측정된 소음 의 크기가 기정해진 기준치 이상인 경우 사운드 마스킹이 필요하다고 결정할 수 있다. 한편, 제어부는 측 정된 소음의 크기가 기정해진 기준치 미만인 경우 사운드 마스킹이 불필요하다고 결정할 수 있다. 제어부는 사운드 마스킹이 필요하다고 결정되는 경우 사운드 마스킹을 수행할 수 있다(S230). 제어부(15 0)는 저주파에 특화된 사운드 마스킹 알고리즘을 이용하여 백색 소음 또는 핑크 노이즈를 출력할 수 있다. 제어 부는 수면 구간에서는 랜덤 노이즈 기반 백색 소음을 재생하고, 숙면 구간에서는 중저음을 강조하는 핑크 소음을 재생할 수 있다. 재생되는 소음은 스피커를 통해 외부로 출력될 수 있다. 제어부는 뇌와 귀에 익숙 하지 않게 마스킹 사운드를 랜덤으로 재생하여 칵테일 파티 효과를 구현할 수 있다. 또한, 제어부는 차량 과 사무실 주변 소음과 연계하여 액티브 사운드 마스킹(active sound masking)을 수행할 수 있다. 제어부는 사운드 마스킹이 불필요하다고 결정되는 경우 차량 내부의 소음이 수용 가능한 정도라고 판단할 수 있다(S240). 도 6은 본 발명의 실시 예들과 관련된 백색 소음 기여도 분석 결과를 도시한 도면이다. 사운드 마스킹 장치는 수면 경계 단계에서 수면 단계로 전환되는 상황에서 백색 소음 유무에 따른 수면질 (Sleep Quality)을 분석할 수 있다. 사운드 마스킹 장치는 카메라를 통해 탑승자의 눈 깜박임을 모니터링할 수 있다. 제어부는 탑승자의 눈 깜박임 지속 시간이 400m 초과 800ms 미만인 경우 수면 상태를 수면 경계 단계로 결정할 수 있다. 제어부 는 눈 깜박임 지속 시간이 800ms 이상인 경우 수면 상태를 수면 단계로 결정할 수 있다. 제어부는 눈 깜박임 지속 시간이 400ms 이하인 경우 수면 상태를 수면 방해 단계로 결정할 수 있다. 제어부는 카메라를 통해 탑승자가 몸을 뒤척인 횟수와 패턴을 모니터링할 수 있다. 제어부는 몸을 뒤 척인 횟수가 2회 이하이며 주기적 움직임인 경우 수면 상태를 정상 수면으로 결정할 수 있다. 제어부는 몸 을 뒤척인 횟수가 3회 이상이며 몸을 뒤척인 패턴이 움찔하는 렘 수면 행동 장애 패턴인 경우 수면 상태를 수면 방해로 결정할 수 있다. 제어부는 생체 신호 측정 장치를 이용하여 탑승자의 생체 신호(예: 뇌파 신호)를 모니터링할 수 있다. 제 어부는 탑승자의 생체 신호를 통해 수면 주기를 분석할 수 있다. 제어부는 수면 주기가 기분 좋은 수 면 주기인 경우 정상 수면이라고 판단할 수 있다. 제어부는 수면 주기가 잠을 깊이 못 자는 불면 주기인경우 수면 방해라고 판단할 수 있다. 제어부는 수면 상태가 수면 방해라고 판단되는 경우 백색 소음 음원을 재생하여 출력할 수 있다. 백색 소 음 음원으로는 파도 소리, 빗소리, 물 흐르는 소리 등과 같은 음원이 사용될 수 있다. 제어부는 백색 소음 을 기정해진 시간(예: 15분)씩 랜덤으로 재생할 수 있다. 수면질 분석을 위해서는 수면 경계 단계에서 수면 단계로 전환되는 데까지 소요되는 시간(또는 수면의 지연 (delay), 수면잠복기)를 측정할 수 있다. 백색 소음을 적용하기 전에는 수면 지연이 6.5 min ± 1.8이나, 백색 소음을 적용한 후에는 수면 지연이 3.6 min ± 0.9로 감소한 것을 확인할 수 있다. 다시 말해서, 수면 경계 단 계에서 수면 단계로 전환되는 상황에서 백색 소음을 재생하는 것이 수면 지연을 줄이는데 효과가 있음을 확인할 수 있다. 또한, 수면질 분석을 위해서는 잠에 들었다가 깨는 횟수(number of awakening, NWAK)(또는 몸을 뒤척인 횟수)를 측정할 수 있다. 백색 소음을 적용하기 전에는 잠에 들었다가 깨는 횟수 NWAK가 3.0 number ± 1.2이나, 백색 소음을 적용한 후에는 1.2 number ± 0.6로 감소하는 것을 확인할 수 있다. 이와 같이, 수면 경계 단계에서 수면 단계로 전환되는 상황에서 백색 소음을 재생하는 경우, 수면 경계 단계에 서 수면 단계로 전환되는데 소용되는 시간이 감소하고, 탑승자가 몸을 뒤척이는 횟수도 감소하므로, 백색 소음 을 재생하는 것이 수면질을 향상시킨다는 것을 알 수 있다. 도 7은 본 발명의 실시 예들과 관련된 핑크 소음 기여도 분석 결과를 도시한 도면이다. 사운드 마스킹 장치의 제어부는 수면 단계에서 숙면 단계로 전환되는 상황에서 수면 방해가 감지되는 경우 마이크로폰을 이용하여 차량 내부의 소음을 측정할 수 있다(S300). 제어부는 눈 깜박임 지속 시간이 400ms 이하인 경우 및/또는 탑승자가 뒤척임 패턴이 램 수면 행동 장애 패턴인 경우 탑승자가 수면 방해를 받고 있다고 판단할 수 있다. 제어부는 탑승자가 수면 방해를 받고 있다고 판단되는 경우 탑승자의 수면을 방해 하는 차량 내부의 소음을 측정할 수 있다. 제어부는 측정된 소음의 크기가 기정해진 기준치 이상인지를 판단할 수 있다(S310). 예컨대, 제어부 는 측정된 소음의 크기가 66dB 이상인지를 확인할 수 있다. 제어부는 측정된 소음의 크기가 기정해진 기준치 이상인 경우 핑크 소음을 이용하여 사운드 마스킹을 수행 할 수 있다(S320). 제어부는 사운드 마스킹 제어 로직에 따라 핑크 소음을 재생하여 출력할 수 있다. 제어부는 사운드 마스킹을 수행하는 동안 핑크 소음 기여도를 분석할 수 있다(S330). 다시 말해서, 제어부 는 핑크 소음을 적용한 수면 주기에서 핑크 소음이 숙면에 미치는 효과를 정량적으로 분석할 수 있다. 구체적으로, 제어부는 수면 단계에서 숙면 단계로 전환되는 상황에서 핑크 소음 적용 유무에 따른 불면 주 기 지속 시간(Time of RestLess, TRL), 불면 주기 발생 횟수(Number of RestLess, NRL) 및/또는 수면 깊이(또 는 숙면 정도, depth)를 분석할 수 있다. 여기서, 수면 깊이는 수면 주기의 세로축(또는 y축)의 최대치와 최소 치의 차이라고 정의할 수 있다. 수면 단계에서 숙면 단계로 전환되는 상황에서 핑크 소음 적용 유무에 따른 불면 주기 지속 시간, 불면 주기 발 생 횟수 및 수면 깊이를 정량적으로 분석한 결과는 [표 1]과 같다. 표 1 핑크 소음 적용 전 핑크 소음 적용 후 TRL 120 min ± 60 40 min ± 20 NRL 10 number ± 8 5 number ± 3 depth 8 ± 4 16 ± 4 [표 1]을 참조하면, 수면 단계에서 숙면 단계로 전환되는 상황에서 핑크 소음을 적용함에 따라 불면 시간을 줄 이고, 불면 발생 횟수를 줄이며 숙면(deep sleep)을 유도할 수 있다.제어부는 측정된 소음의 크기가 기정 해진 기준치 이상이 아니라고 판단되는 경우, 숙면 진동 패턴에 기반하여 시트 진동을 생성하도록 시트 제어부 를 제어할 수 있다(S340). 도 8은 본 발명의 실시 예들과 관련된 칵테일 효과 적용 과정을 설명하기 위한 도면이다. 사운드 마스킹 장치의 제어부는 카메라에 의해 획득된 영상 정보를 분석하여 탑승자가 수면을 방해받 는 상태(즉, 수면 방해)를 인식할 수 있다(S400). 제어부는 수면 방해가 인식되는 경우, 차량 내부의 소음을 측정할 수 있다(S410). 이때, 제어부는 차 량 내부에 설치된 마이크로폰을 이용하여 소음을 측정할 수 있다. 제어부는 측정된 소음의 크기가 기정해진 기준치 이상인지를 확인할 수 있다(S420). 제어부는 측정된 소음의 크기가 기정해진 기준치 이상인 경우 사운드 마스킹이 필요하다고 판단할 수 있다. 한편, 제어부는 측정된 소음의 크기가 기정해진 기준치 이상이 아닌 경우 즉, 측정된 소음의 크기가 기정해진 기준치 미만인 경 우 사운드 마스킹이 불필요하다고 판단할 수 있다. 제어부는 측정된 소음의 크기가 기정해진 기준치 이상이라고 확인되는 경우 사운드 마스킹을 수행할 수 있 다(S430). 이때, 제어부는 수면 상태에 따라 마스킹 음원(또는 마스킹 사운드)을 선택할 수 있다. 제어부 는 수면 상태가 수면 경계 단계에서 수면 단계로 전환되는 상태인 경우 랜덤 노이즈 기반 백색 소음을 마 스킹 음원으로 선택할 수 있다. 제어부는 수면 상태가 수면 단계에서 숙면 단계로 전환되는 상태인 경우 동일한 에너지로 보정 및/또는 필터링한 핑크 소음을 마스킹 음원으로 선택할 수 있다. 제어부는 선택된 마스킹 음원을 재생하여 스피커를 통해 출력할 수 있다. 제어부는 백색 소음(예: 물 흐르는 소리, 웅성거리는 소리)을 재생할 때 랜덤하게 재생하여 패시브 사운드 마스킹을 수행할 수 있다. 패시브 사운드 마스킹을 통해 칵테일 파티 효과를 구현할 수 있다. 제어부는 핑크 소음(예: 파도가 부서지는 소리, 빗방울 떨어지는 소리 등)을 재생할 때 핑크 소음이 차량 내부의 소음을 덮는 담요 역할을 하도록 액티브 사운드 마스킹을 수행할 수 있다. 제어부는 측정된 소음의 크기가 기정해진 기준치 이상이 아닌 경우 차량 내부의 소음이 수용 가능하다고 판단할 수 있다(S440). 도 9는 본 발명의 실시 예들과 관련된 사운드 마스킹 컨셉을 설명하기 위한 도면이다. 사운드 마스킹은 어떤 소리에 다른 소리가 파묻혀 들리지 않는 현상을 말한다. 이때, 방해되는 큰 음을 마스커 (masker), 파묻히는 작은 음을 마스키(maskee)라고 한다. 사운드 마스킹에 사용되는 마스킹 음원으로는 백색 소 음, 핑크 소음, 브라운 소음 또는 이들의 어느 조합 중 적어도 하나가 사용될 수 있다. 사운드 마스킹 장치는 저주파에 특화된 사운드 마스킹 알고리즘을 이용하여 수면 구간에서는 랜덤 노이즈 기반 백색 소음을 재생하고, 숙면 구간에서는 중저음을 강조한 핑크 소음을 재생할 수 있다. 또한, 사운드 마스킹 장치는 뇌와 귀에 익숙하지 않게 마스킹 음원을 랜덤하게 재생하여 칵테일 파티 효과 를 구현할 수 있다. 또한, 사운드 마스킹 장치는 차량과 사무실 주변 소음을 연계하여 액티브 사운드 마스킹을 수행할 수 있다. 도 10은 본 발명의 실시 예들에 따른 사운드 마스킹 알고리즘을 설명하기 위한 도면이다. 사운드 마스킹 알고리즘은 차량 또는 차박 환경에서의 공간 음향 노이즈를 분석하여 자동으로 음향을 조절할 수 있다. 액티브 사운드 제어를 통해 소리가 너무 커지거나 작아지는 것을 방지하고 가변적으로 저주파 특화 사운 드 마스킹을 구현할 수 있다. 사운드 마스킹 장치의 제어부는 차량 내부의 소음을 측정하여 스펙트럼 분석을 수행할 수 있다 (S500). 제어부는 스펙트럼 분석을 통해 마스커 존재 시 지각된 음을 추출할 수 있다(S510). 제어부는 추출된 음의 음압 레벨과 마스킹 한계선 간의 차이 레벨을 분석할 수 있다(S520). 제어부는 분석된 차이 레벨에 기반한 액티브 사운드 제어식을 적용할 수 있다(S530). 액티브 사운드 제어 식 ASC(n)은 [수식 1]과 같이 나타낼 수 있다. [수식 1] ASC(n)=Noise(n)-Mask(n)+margin 제어부는 ASC(n)을 이용하여 마스킹 사운드의 소리가 너무 크거나 작지 않도록 마스킹 사운드의 최대값(또 는 최대 음압 레벨)과 최소값(또는 최소 음압 레벨)을 설정할 수 있다. 마스킹 사운드의 소리가 커지고 작아질 때 마스킹 한계선을 가변적으로 적용하기 위하여 마진(margin)을 반영할 수 있다. 제어부는 수면 단계, 렘 수면 주기 정보, 경계 및/또는 위급 상황 정보에 근거하여 필터를 적용하여 마스 킹 사운드를 제어할 수 있다(S540). 제어부는 [수식 2]에서와 같이 필터를 적용하여 마스킹 사운드의 소리 가 급격하게 변화하는 것을 방지할 수 있다. 이로써, 마스킹 사운드의 급격한 음압 레벨 변화로 인한 이질감을 방지할 수 있다. [수식 2] sound(n)=sound(n-1)+Filter×ASC(n) 상기한 사운드 마스킹 알고리즘을 이용하여 칵테일 파티 효과 (Cocktail Party Effect)를 구현할 수 있다. 칵테 일 파티 효과는 파티의 참석자들이 시끄러운 주변 소음이 있는 방에 있음에도 불구하고 대화자와의 이야기를 선 택적으로 집중하여 잘 받아들이는 현상에서 유래했다. 이와 같이 주변 환경에 개의치 않고 자신에게 의미 있는 정보만을 선택적으로 받아들이는 것을 '선택적 지각(selective perception)' 또는 '선택적 주의'라고 하는데, 이런 선택적 지각이나 주의가 나타나는 심리적 현상을 말한다. '칵테일 파티 효과'가 일어나는 이유는 아무리 다양한 목소리가 귀로 들어와도 사람의 뇌는 그중 한 목소리만 골라서 처리하기 때문이다. 도 11은 본 발명의 실시 예들에 따른 패시브 사운드 마스킹을 설명하기 위한 도면이다. 패시브 사운드 마스킹은 뇌와 귀에 익숙하지 않게 랜덤 재생하는 칵테일 파티 효과를 반영한 사운드 마스킹 기 술이다. 이 사운드 마스킹 기술의 사운드 마스킹 알고리즘 컨셉에 따르면, 수면 구간에서는 랜덤 노이즈 기반 백색 소음을 재생하고, 숙면 구간에서는 중저음을 강조한 핑크 소음을 재생할 수 있다. 백색 소음 또는 핑크 소음과 같은 마스킹 사운드를 이용하여 숙면 테라피 솔루션을 구현하기 위해서는 해당 마 스킹 사운드를 랜덤하게 재생해야 한다. 이를 위해, 사운드 마스킹 알고리즘은 소리의 변화를 작게 하는 필터 기능과 랜덤 음질 보정 기능을 포함할 수 있다. 도 12는 본 발명의 실시 예들에 따른 액티브 사운드 마스킹을 설명하기 위한 도면이다. 사운드 마스킹 장치는 특정 공간(예: 차량, 사무실, 교실, 캠핑장 등)의 주변 소음에 대한 정량적 분석을 수행할 수 있다(S600). 예컨대, 사운드 마스킹 장치는 주변 소음에 대한 정량적 수치(예: 소음 스트레스 지수)를 분석할 수 있다. 또한, 사운드 마스킹 장치는 주변 소음에 대한 정성적 분석을 수행할 수 있다(S610). 예를 들어, 사운드 마스킹 장치는 생체 신호인 뇌파를 측정하여 뇌파 패턴을 분석할 수 있다. 사운드 마스킹 장치는 주변 소음에 대한 정량적 분석 결과 및/또는 정성적 분석 결과에 기반하여 액티브 사운드 마스킹을 수행할 수 있다(S620). 도 13은 본 발명의 실시 예들에 따른 사운드 마스킹 방법을 도시한 흐름도이다. 사운드 마스킹 장치의 제어부는 숙면 테라피 기능을 실행할 수 있다(S700). 제어부는 사용자 인 터페이스부로부터 수신되는 탑승자의 입력 데이터에 따라 숙면 테라피 기능을 실행할 수 있다. 제어부는 숙면 테라피 기능이 실행되면 시트에 숙면 진동 발생 및/또는 수면 유도 음원을 재생할 수 있다 (S710). 제어부는 시트 제어부를 제어하여 숙면을 유도하기 위한 진동 주파수 및/또는 진동 패턴을 가지는 진동을 시트에 발생시킬 수 있다. 또한, 제어부는 음원 재생기를 이용하여 수면 유도 음원을 재생 하여 스피커를 통해 출력할 수 있다. 제어부는 센싱부를 통해 수면 단계를 판단할 수 있다(S720). 제어부는 생체 신호 측정 장치를 이용하여 생체 신호를 측정하고, 측정된 생체 신호의 패턴을 분석하여 수면 단계를 결정할 수 있다. 일 예로, 제어부는 뇌파 측정 장치를 이용하여 뇌파 신호를 측정하고, 측정된 뇌파 신호의 패턴을 분석하여 수면 단 계를 결정할 수 있다. 수면 단계는 제1 수면 단계(또는 수면 경계 단계), 제2 수면 단계(또는 얕은 수면 단계) 및 제3 수면 단계(또는 깊은 수면 단계)로 구분할 수 있다. 제어부는 센싱부를 이용하여 탑승자의 신체기관 변화 및 신체 움직임을 모니터링할 수 있다(S730). 제어부는 카메라를 통해 영상 정보를 획득하고, 획득된 영상 정보를 분석하여 탑승자의 눈 깜박임 지속 시간 및/또는 신체 움직임 패턴 등을 감지할 수 있다. 제어부는 탑승자의 신체기관 변화 및 신체 움직임에 기반하여 수면 방해 여부를 결정할 수 있다(S740). 제 어부는 탑승자의 눈 깜박임 지속 시간이 기정해진 기준치(또는 기준 시간)(예: 400ms) 이하인 경우 및/또 는 신체 움직임 패턴이 렘 수면 행동 장애 패턴인 경우 수면 방해라고 판단할 수 있다. 제어부는 수면 방해라고 결정되는 경우 마이크로폰을 이용하여 차량 내부의 소음을 측정할 수 있다(S750). 제어부는 측정된 소음에 기반하여 사운드 마스킹이 필요한지를 결정할 수 있다(S760). 제어부는 측정 된 소음의 크기와 기정해진 기준치를 비교하고, 비교결과 측정된 소음의 크기가 기정해진 기준치 이상인 경우 사운드 마스킹이 필요하다고 판단할 수 있다. 제어부는 측정된 소음의 크기가 기정해진 기준치 이상이 아 닌 경우 사운드 마스킹이 불필요하다고 판단할 수 있다. 제어부는 사운드 마스킹이 필요하다고 결정되는 경우 사운드 마스킹을 수행할 수 있다(S770). 제어부(15 0)는 수면 단계, 소음 크기, 렘 수면 주기 정보 및/또는 위급 상황 정보 등에 기반하여 마스킹 사운드를 결정할 수 있다. 또한, 제어부는 공간 음향 소음 분석을 통해 자동으로 음향을 조절할 수도 있다. 제어부는 사운드 마스킹이 불필요하다고 결정되는 경우 차량 내부의 소음이 수용 가능하다고 결정할 수 있 다(S780). 제어부는 수면 방해가 아니라고 결정되는 경우 탑승자의 수면 상태를 정상 수면이라고 결정할 수 있다 (S790). 도 14는 본 발명의 실시 예들에 따른 사운드 마스킹 시스템을 도시한 블록구성도이다. 도 14를 참조하면, 사운드 마스킹 시스템은 유선 및/또는 무선 통신망을 통해 연결되는 마스터 단말, 사용자 단말 및 스마트 스피커를 포함할 수 있다. 마스터 단말, 사용자 단말 및 스마트 스 피커 각각은 통신 회로, 프로세서 및 메모리를 포함할 수 있다. 마스터 단말은 특정 공간(예: 차량 또는 사무실 등)에 설치될 수 있다. 마스터 단말은 네트워크 관리, 네트워크 환경에서 스피커 개별 제어, 공간 음향 환경 모니터링 등을 수행할 수 있다. 마스터 단말은 생체 신호 측정 장치를 이용하여 사용자의 수면 단계를 분석할 수 있다. 마스터 단말 은 특정 공간에 설치된 카메라를 이용하여 사용자의 신체기관 변화 및/또는 신체 움직임 패턴 등을 분석하여 수 면 방해 여부를 판단할 수 있다. 마스터 단말은 수면 방해가 인식되는 경우 숙면 테라피 컨텐츠 실행을 지시하는 제어 명령을 사용자 단말 에 전송할 수 있다. 이때, 마스터 단말은 제어 명령과 함께 사용자의 수면 단계 정보를 전송할 수 있 다. 사용자 단말에는 숙면 테라피 콘텐츠가 앱(application) 형태로 사전에 설치될 수 있다. 사용자 단말(42 0)은 마스터 단말의 제어 명령에 따라 숙면 테라피 콘텐츠을 온 또는 오프할 수 있다. 사용자 단말은 숙면 테라피 콘텐츠가 온되면 마이크로폰을 이용하여 공간 음향 환경 내 소음(또는 주 변 소음)을 측정할 수 있다. 사용자 단말은 사용자의 수면 단계 및 측정된 소음에 기반하여 마스킹 음원을 선택할 수 있다. 사용자 단말은 선택된 마스킹 음원을 스마트 스피커에 전송할 수 있다. 사용자 단말은 선택된 마스킹 음원을 재생하여 사운드 출력부를 통해 출력할 수도 있다. 사운드 출력 부는 스마트 스피커의 작동 여부 인지 기능을 포함할 수 있다. 스마트 스피커는 고주파 전용 트위터, 하이브리드형 우퍼, 마이크로폰, 소형 DC 모터 , 제어기 커넥터, 감성 발광 LED, 배터리, 와이파이 칩 및 블루투스 칩을 포함 할 수 있다. 스마트 스피커는 와이파이 칩 및/또는 블루투스 칩을 통해 사용자 단말로부터 전송되는 마 스킹 음원을 수신할 수 있다. 스마트 스피커는 수신된 마스킹 음원을 재생하여 고주파 전용 트위터 및/또는 하이브리드형 우퍼를 통해 외부로 출력할 수 있다. 스마트 스피커는 포터블 타입의 스피커로, 컵 홀더형 스마트 스피커 및 손잡이 거는 타입 스마트 스피커 등이 있다.스마트 스피커는 내장된 마이크로폰을 이용하여 주변 소음을 측정할 수도 있다. UX(User Experience) 기반 스마트 스피커를 이용하는 경우 사용자 인근 근거리 마이크로폰 사용으로 개인간 마스킹 음원을 재생할 수 있다. 또한, 마스킹 음원으로 자연음과 음악을 합성한 음원을 사용하여 이질감을 최소화시킬 수 있다. 다른 일 예로, 스마트 스피커는 인공지능 서버(또는 AI 서버)를 이용하여 측정된 소음의 유형을 분석한 후 소음 유형에 최적화된 마스킹 음원을 재생할 수 있다. 스마트 스피커는 수음된 소음을 인공지능 서버에 전 송할 수 있다. 또 다른 일 예로, 스마트 스피커는 인공지능 서버를 이용하여 사용자 경험을 분석한 후 사용자에게 최적화 된 마스킹 음원을 재생할 수 있다. 인공지능 서버는 마스킹 음원을 제공할 수 있다. 스마트 스피커는 무지향성 스피커를 내장하여 사운드 스케이프 스피커 사용 반경을 극대화시킬 수 있다. 또한, 스마트 스피커는 에코 캔슬러를 내장하여 재생 음이 마이크로폰으로 다시 유입되는 것을 방지할 수 있다. 또 다른 일 예로, 스마트 스피커는 마이크로폰에 의해 측정된 소음의 크기 및 주파수 특성을 분석하 고, 메모리에 저장된 마스킹 음원 중 분석결과에 매칭되는 마스킹 음원을 선정하여 재생할 수 있다. 이때, 스마 트 스피커는 실시간으로 마스킹 음원의 레벨 및 음색을 조절할 수 있다. 스마트 스피커에는 액티브 방식에서 소음 유형 분석과 사용자 사용성 분석 기능이 추가 적용될 수 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보 호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명 의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0079185", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예들에 따른 사운드 마스킹 장치를 도시한 블록구성도이다. 도 2는 본 발명의 실시 예들과 관련된 수면 상태 판단 과정을 설명하기 위한 도면이다. 도 3은 본 발명의 실시 예들과 관련된 수면 단계 판단 과정을 설명하기 위한 도면이다. 도 4는 본 발명의 실시 예들과 관련된 수면 방해 판단 방법을 설명하기 위한 도면이다. 도 5는 본 발명의 실시 예들과 관련된 사운드 마스킹 필요 판단 과정을 설명하기 위한 도면이다. 도 6은 본 발명의 실시 예들과 관련된 백색 소음 기여도 분석 결과를 도시한 도면이다. 도 7은 본 발명의 실시 예들과 관련된 핑크 소음 기여도 분석 결과를 도시한 도면이다. 도 8은 본 발명의 실시 예들과 관련된 칵테일 효과 적용 과정을 설명하기 위한 도면이다.도 9는 본 발명의 실시 예들과 관련된 사운드 마스킹 컨셉을 설명하기 위한 도면이다. 도 10은 본 발명의 실시 예들에 따른 사운드 마스킹 알고리즘을 설명하기 위한 도면이다. 도 11은 본 발명의 실시 예들에 따른 패시브 사운드 마스킹을 설명하기 위한 도면이다. 도 12는 본 발명의 실시 예들에 따른 액티브 사운드 마스킹을 설명하기 위한 도면이다. 도 13은 본 발명의 실시 예들에 따른 사운드 마스킹 방법을 도시한 흐름도이다. 도 14는 본 발명의 실시 예들에 따른 사운드 마스킹 시스템을 도시한 블록구성도이다."}
