{"patent_id": "10-2023-0138775", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0055661", "출원번호": "10-2023-0138775", "발명의 명칭": "스마트 물류 플랫폼 서비스 제공 시스템", "출원인": "다몬기술 주식회사", "발명자": "정영선"}}
{"patent_id": "10-2023-0138775", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기 설정된 기간 동안 제조 및 납품된 주문 데이터를 제공하는 적어도 하나의 제조사 서버;상기 적어도 하나의 제조사 서버의 주문 데이터에 기반하여 상기 적어도 하나의 제조사 서버에서 발주될 수요예측에 따른 주문 데이터를 출력하는 사용자 단말; 및상기 적어도 하나의 제조사 서버로부터 기 설정된 기간 동안의 주문 데이터를 수집하는 수집부, 상기 기 설정된기간 동안의 주문 데이터의 이상치(Outlier)를 제거하고 패킹유형, 주문량, 이벤트, 요일 및 명절을 포함한 예측마트(Mart)를 생성하는 생성부, 상기 패킹유형별 수요를 예측할 때 ML(Machine Learning) 모델, 회귀 모델 및이동평균 모델을 이용하여 수요를 예측하도록 학습, 검증 및 테스트하는 모델링부, 상기 테스트의 결과 가장 높은 예측률을 가지는 수요예측모델을 세팅하고, 상기 적어도 하나의 제조사 서버에서 발주될 주문 데이터를 실시간으로 예측하는 수요예측부를 포함하는 플랫폼 서비스 제공 서버;를 포함하는 스마트 물류 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0138775", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 적어도 하나의 제조사 서버로부터 실시간으로 수집되는 주문 데이터인 실시간 데이터와, 상기 수요예측부에서 예측한 주문 데이터를 비교한 후 예측정확도를 산출하는 결과저장부;를 더 포함하는 것을 특징으로 하는 스마트 물류 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0138775", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말에서 등록한 풀필먼트 센터 내 복수의 자율주행로봇이 상호 간 충돌을 최소화하면서 각각의 목적지까지 최단경로로 이동하도록 중앙집중형 DQN(Centralized Deep Q-Network)을 기반으로 이동경로를 제어하는최적경로제공부;를 더 포함하는 것을 특징으로 하는 스마트 물류 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0138775", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말에서 등록한 풀필먼트 센터에서 출발하는 적어도 하나의 화물차에 첨단 운전자 보조 시스템(Advanced Driver Assistance Systems)을 등록한 후 상기 화물차의 화물차 단말과 연결하고, 상기 화물차의 실시간 관제를 위한 모니터링을 실시하는 화물관제부;를 더 포함하고,상기 첨단 운전자 보조 시스템은, Fast R-CNN(Fast Region-based Convolutional Neural Network)를 기반으로공개특허 10-2025-0055661-3-상기 화물차의 이동방향에 위치한 객체 및 위치를 인식한 후 상기 객체 및 위치를 문장으로 형성하여 출력하는시스템인 것을 특징으로 하는 스마트 물류 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0138775", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 플랫폼 서비스 제공 서버는,상기 사용자 단말에 등록된 물류창고에 위치한 재고를 파악하기 위하여, 각 구역 및 위치에 적재된 적어도 하나의 재고를 고유식별코드의 스캔 또는 리딩을 통하여 적어도 하나의 드론이 파악하도록 하는 재고파악부;를 더 포함하는 것을 특징으로 하는 스마트 물류 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "스마트 물류 플랫폼 서비스 제공 시스템이 제공되며, 기 설정된 기간 동안 제조 및 납품된 주문 데이터를 제공하 는 적어도 하나의 제조사 서버, 적어도 하나의 제조사 서버의 주문 데이터에 기반하여 적어도 하나의 제조사 서 버에서 발주될 수요예측에 따른 주문 데이터를 출력하는 사용자 단말 및 적어도 하나의 제조사 서버로부터 기 설 (뒷면에 계속)"}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 물류 플랫폼 서비스 제공 시스템에 관한 것으로, 수요예측, 자율주행로봇, ADAS 및 풀필먼트 를 통하여 차세대 물류 서비스를 구현할 수 있는 시스템을 제공한다."}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 인공지능(AI), 빅데이터 및 사물인터넷(IoT), 자동화 등 여러 기술이 발전함에 따라 산업 간 경계가 사라 지고 기술의 한계를 극복하기 위한 동종 및 이종 기술을 융합하는 혁신이 일어나고 있다. 물류는 대표적인 기 술 융합의 흐름을 보이는 산업인데, 고객의 주문에서부터 피킹, 패킹, 배송에 이르는 과정(Fulfillment)을 다루 는 산업으로 IT, 산업 자동화, 수요예측, 운송 수단, 창고, 저장 방법 등 다양한 분야의 기술들이 상호 보안 또 는 융합기술의 관계로 발전하거나 적용된다. 최근, 아마존은 결제예측배송, 아마존대시, 키바(AGV물류로봇), 아마존프라임에어(드론), 아마존에코와 같이 주문, 물류 처리, 배송 등 다양한 영역에서의 물류 기술 융합전략 을 추진하고 있고, 삼성SDS는 빅데이터, AI, AR, 블록체인 기반의 물류관리 플랫폼인 첼로 서비스를 활용하여 수요와 공급을 통합 관리하는 효과적인 공급망관리 기능을 제공하고 있다. 이때, 스마트 물류 시스템의 구축을 위하여 풀필먼트 서비스를 제공하거나 오더 기반으로 3PL 재고 및 기사를 매칭시키는 방법이 연구 및 개발되었는데, 이와 관련하여, 선행기술인 한국등록특허 제2021-0031072호(2021년03 월19일 공개) 및 한국등록특허 제10-2551754호(2023년07월05일 공고)에는, 고객사로부터 바코드 스캔을 통하여 위치를 자동등록하여 제품을 입고처리하고, 주문서와 입고등록된 제품을 매칭하며, 합포장 또는 분할포장을 결 정하고, 합포장 또는 분할포장에 대해 하나의 송장을 부여하고 자동출고시키는 구성과, 소비자 오더정보를 기반 으로 발주정보를 처리하여 배송 스케줄 정보를 생성하고, 배송 스케줄 정보를 주문 단말 및 배송 단말로 전송하 며, 상품의 출고, 운송 및 설치에 대한 배송완료정보를 생성하고, 배송정산을 실시하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 합포장을 할 것인지 또는 분할포장을 할 것인지를 주소지를 기준으로 결정하는 구성만이 개 시될 뿐이고, 후자의 경우에도 배송 스케줄을 생성하기 위하여 재고와 기사를 매칭하는 구성만이 개시될 뿐이다. 스마트 물류를 위해서는 수요예측을 수행하여 재고관리를 할 뿐만 아니라 리드타임을 줄일 수 있도록 해야 하고, 풀필먼트에 인력을 최소화할 수 있도록 자율주행로봇으로 피킹 및 로딩을 할 수 있어야 하며, ICT 기반으로 화물차량을 모니터링할 뿐만 아니라 화물차량의 사고방지를 수행할 수 있어야 한다. 이에 따라, 스마 트 물류를 위한 물류 서비스를 위한 플랫폼의 연구 및 개발이 요구된다."}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 스마트 물류를 위하여 수요예측을 수행하여 재고관리를 할 뿐만 아니라 리드타임을 줄 일 수 있도록 하고, 풀필먼트에 인력을 최소화할 수 있도록 자율주행로봇으로 피킹 및 로딩을 수행하며, ICT 기 반으로 화물차량을 모니터링할 뿐만 아니라 ADAS(Advanced Driver Assistance Systems) 기반으로 사고를 방지 할 수 있도록 하고, 재고파악을 무인으로 진행할 수 있도록 드론 및 고유식별코드를 이용함으로써, 차세대 물류서비스를 조기에 구축할 수 있도록 하는, 스마트 물류 플랫폼 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제 들이 존재할 수 있다."}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 기 설정된 기간 동안 제조 및 납품된 주문 데이터를 제공하는 적어도 하나의 제조사 서버, 적어도 하나의 제조사 서버의 주문 데이터에 기반 하여 적어도 하나의 제조사 서버에서 발주될 수요예측에 따른 주문 데이터를 출력하는 사용자 단말 및 적어도 하나의 제조사 서버로부터 기 설정된 기간 동안의 주문 데이터를 수집하는 수집부, 기 설정된 기간 동안의 주문 데이터의 이상치(Outlier)를 제거하고 패킹유형, 주문량, 이벤트, 요일 및 명절을 포함한 예측마트(Mart)를 생 성하는 생성부, 패킹유형별 수요를 예측할 때 ML(Machine Learning) 모델, 회귀 모델 및 이동평균 모델을 이용 하여 수요를 예측하도록 학습, 검증 및 테스트하는 모델링부, 테스트의 결과 가장 높은 예측률을 가지는 수요예 측모델을 세팅하고, 적어도 하나의 제조사 서버에서 발주될 주문 데이터를 실시간으로 예측하는 수요예측부를 포함하는 플랫폼 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 스마트 물류를 위하여 수요예측을 수행하여 재고관리 를 할 뿐만 아니라 리드타임을 줄일 수 있도록 하고, 풀필먼트에 인력을 최소화할 수 있도록 자율주행로봇으로 피킹 및 로딩을 수행하며, ICT 기반으로 화물차량을 모니터링할 뿐만 아니라 ADAS 기반으로 사고를 방지할 수 있도록 하고, 재고파악을 무인으로 진행할 수 있도록 드론 및 고유식별코드를 이용함으로써, 차세대 물류 서비 스를 조기에 구축할 수 있도록 한다."}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 스마트 물류 플랫폼 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1 을 참조하면, 스마트 물류 플랫폼 서비스 제공 시스템은, 적어도 하나의 사용자 단말, 플랫폼 서비스 제공 서버, 적어도 하나의 자율주행로봇, 적어도 하나의 화물차 단말 및 드론을 포함할 수 있다. 다만, 이러한 도 1의 스마트 물류 플랫폼 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 사용자 단말은 네트워크를 통하여 플랫폼 서비스 제공 서버와 연 결될 수 있다. 그리고, 플랫폼 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 사용자 단말 , 적어도 하나의 자율주행로봇, 적어도 하나의 화물차 단말 및 드론과 연결될 수 있다. 또한, 적어도 하나의 자율주행로봇은, 네트워크를 통하여 플랫폼 서비스 제공 서버와 연결될 수 있다. 그리고, 적어도 하나의 화물차 단말은, 네트워크를 통하여 적어도 하나의 사용자 단말, 플랫폼 서비스 제공 서버 및 적어도 하나의 자율주행로봇과 연결될 수 있다. 마지막으로, 드론(60 0)은, 네트워크를 통하여 사용자 단말, 자율주행로봇, 플랫폼 서비스 제공 서버, 적어도 하나의 화물차 단말와 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), 5G NR(New Radio), 6G(6th Generation of Cellular Networks), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷 (Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스(Bluetooth) 네트워크, NFC(Near- Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 사용자 단말은, 스마트 물류 플랫폼 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 이용하여 스마트 물류 플랫폼을 관리하는 관리자 또는 담당자의 단말일 수 있다. 여기서, 적어도 하나의 사용자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 사용자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 사용자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 플랫폼 서비스 제공 서버는, 스마트 물류 플랫폼 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이 션을 제공하는 서버일 수 있다. 그리고, 플랫폼 서비스 제공 서버는, 수요예측을 위한 예측모델을 선정하 고, 학습, 검증 및 테스트를 통하여 가장 정확도가 높은 예측모델을 세팅한 후, 수요예측을 수행함으로써 전국 당일배송이 가능하도록 하는 서버일 수 있다. 또한, 플랫폼 서비스 제공 서버는, 물류창고 내 자율주행로 봇이 서로 충돌하지 않으면서도 최단경로를 이동할 수 있도록 경로를 최적화하는 서버일 수 있다. 그리고, 플랫폼 서비스 제공 서버는, 화물차 단말과 ADAS(Advanced Driver Assistance Systems)를 연동시켜 사고를 최소화하고 운전자를 보조하도록 하는 서버일 수 있다. 또한, 플랫폼 서비스 제공 서버 는 재고파악을 수행하고, 화물차의 위치를 실시간 관제 및 모니터링하며, 풀필먼트 서비스를 제공하고 제조업에 특화된 SCM(Supply Chain Management)를 수행하는 서버일 수 있다. 여기서, 플랫폼 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 자율주행로봇은, 스마트 물류 플랫폼 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 이용하여 각 물품을 피킹(Picking) 및 로딩(Loading)하는 로봇암(Arm)을 보유한 자율주행로봇일 수 있다. 이때, 자율주행로봇은, 충돌을 최소화하면서도 최단거리로 이동하도록 최적경로를 플랫폼 서비 스 제공 서버로부터 수신하거나 스스로 계산한 후 이동하는 로봇일 수 있다. 여기서, 적어도 하나의 자율주행로봇은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨 터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 자율주행로봇은, 네트워크 를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 자율주행로봇은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 적어도 하나의 화물차 단말은, 스마트 물류 플랫폼 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 이용하여 플랫폼 서비스 제공 서버와 연동되고, ADAS에서 객체를 탐지한 결과를 TTS(Text To Speech)로 안내하고, ADAS와 연동되어 제동장치를 구동하도록 제동장치와 연결된 단말일 수 있다. 또, 화물차 단말은, 플랫폼 서비스 제공 서버와 연결되어 화물차의 위치를 제공하는 단말일 수 있다. 여기서, 적어도 하나의 화물차 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 화물차 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 화물차 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 드론은, 스마트 물류 플랫폼 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 [물류창고-영역-선반-위치]를 저장하고, 각 위치에 적재된 고유식별코드를 스캔함으로써 재고를 파악하도록 구 비된 비행장치일 수 있다. 드론은, 파악된 재고정보를 플랫폼 서비스 제공 서버로 제공하는 장치일 수 있다. 여기서, 드론은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(Desktop), 랩 톱(Laptop) 등을 포함할 수 있다. 이때, 드론은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있 는 단말로 구현될 수 있다. 드론은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게 이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 플랫폼 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 스마트 물류 플랫폼 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 플랫폼 서비스 제공 서버는, 수집부, 생성부, 모델링부, 수요예측부 , 결과저장부, 최적경로부, 화물관제부, 재고파악부를 포함할 수 있다. 본 발명의 일 실시예에 따른 플랫폼 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하나의 사용자 단말, 적어도 하나의 자율주행로봇, 적어도 하나의 화물차 단말 및 적어도 하나 의 드론으로 스마트 물류 플랫폼 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 전송하는 경 우, 적어도 하나의 사용자 단말, 적어도 하나의 자율주행로봇, 적어도 하나의 화물차 단말 및 적어도 하나의 드론은, 스마트 물류 플랫폼 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크립트를 이용하여 서비스 프로그램이 적어도 하나 의 사용자 단말, 적어도 하나의 자율주행로봇, 적어도 하나의 화물차 단말 및 적어도 하나의 드 론에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하 는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받아서 보여주는 프로그램을 의 미하며, 예를 들어 크롬(Chrome), 에지(Microsoft Edge), 사파리(Safari), 파이어폭스(FireFox), 웨일(Whale), UC 브라우저 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그램(Application)을 의미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 수집부는, 적어도 하나의 제조사 서버(미도시)로부터 기 설정된 기간 동안의 주문 데이 터를 수집할 수 있다. 이때, 적어도 하나의 제조사 서버는, 기 설정된 기간 동안 제조 및 납품된 주문 데이터 를 제공할 수 있다. 풀필먼트 비즈니스는 기존 비즈니스와는 전혀 다른 특징을 가지는데 기존 물류에서는 국내 를 기준으로 고객이 주문을 한 시점에서 2∼3일내 배송을 완료해야 했다면, 풀필먼트 비즈니스에서는 6∼8시간 내 배송을 완료해야 한다는 특성이 있다. 이러한 비즈니스 특성에서 수요예측은 매우 중요한데 고객의 온라인 주문정보를 바탕으로 풀필먼트 센터 내에서의 적정 피킹, 패킹 인력과 배송을 위한 차량의 적정규모도 산정하여 관련 비용 및 자원들 관리에 반드시 동반되어야 한다. 특히 예측결과에 따라 인력운영비용 및 배송에도 영향을 미치기 때문에 그 중요성이 날이 갈수록 커지고 있는 상황이다. 이런 이유로 풀필먼트 비즈니스에 활용하기 위 한 특화된 수요예측 방법이 필요하다. 이에 따라, 풀필먼트 비즈니스에 활용할 수 있는 수요예측모델을 이용할 수 있다. 전통적인 수요예측모델들은 선형 패턴을 보이는 데이터들을 바탕으로는 균일한 품질 결과를 보여주지 만 다양한 판매채널을 통한 주문 유입, 수익증대를 위한 수시 이벤트 발생으로 인한 주문 변화 등이 심해 비선 형 데이터 형태를 띄는 풀필먼트 비즈니스에는 적합하지 않다. 이에 따라, 머신러닝 기반의 멀티 조합 수요예 측모델을 이용할 수 있다. <DNN> DNN(Deep Neural Network)는 연속형, 범주형 변수에 상관없이 모두 분석 가능하며 입력 변수들 간의 비선형 조 합이 가능하다. 또한 Data 양이 많아지면 성능이 계속 좋아진다는 특징이 있다. RNN(Recurrent Neural Networks)는 입력 변수에 순서나 시간 정보가 내재되어 있을 때 강점을 보이며 입력과 출력의 길이를 다양하게적용할 수 있다. <수요예측 변수> 전자상거래 수요예측에 가장 큰 영향을 주는 변수는 제조사 또는 전자상거래 플랫폼사가 판매수익을 높이고자 실시하는 할인쿠폰발행, 할인판매 이벤트와 같은 이벤트 변수로 이는 예측 결과를 크게 좌우할 만큼의 영향력을 가지고 있다. 이런 이유로 본 발명의 일 실시예에서는 이벤트 대응을 위해 전자상거래 플랫폼, 공공데이터 포 털 등의 외부 사이트에서 다양한 이벤트 데이터를 더 수집할 수 있다. 예를 들어 한국은행에서 수집하는 소비 지출전망조사, 소비자심리지수, 쇼핑 플랫폼 내 할인행사 정보 등일 수 있다. 다양한 이벤트 데이터들은 주, 월, 분기 등의 형태로 분류하여 예측 가능한 패턴이 있는 이벤트와 그렇지 않은 단발성 이벤트 등으로 분류하여 예측에 이용할 수 있다. 전자상거래 플랫폼 내 대표적 패턴이 있는 이벤트 정보 업데이트 주기에 따라 일 2회 수집하고 이를 머신러닝 모델 기반으로 수요예측에 이용할 수 있고, 플래시세일(Flash sale)과 같은 패턴이 없 는 이벤트 행사에 대해서는 딥러닝 모델 기반으로 수요예측에 이용할 수 있다. 생성부는, 기 설정된 기간 동안의 주문 데이터의 이상치(Outlier)를 제거하고 패킹유형, 주문량, 이벤트, 요일 및 명절을 포함한 예측마트(Mart)를 생성할 수 있다. 이때, 패킹유형은 단수인지, 단포/동종 합포인지, 이종합포인지의 여부를 파악하는 것인데, 패킹유형별로 수요예측을 수행하기 위함이다. 또, 주문량, 이벤트, 요일 및 명절은 변수인데, 패킹유형과 각종 변수는 예측마트에 포함된다. 여기서, 마트라는 것은 단일 주제에 중점을 둔 단순한 형태의 데이터 웨어하우스(Warehouse)이다. 이에 따라, 마트는 웨어하우스보다는 적은 소스 로부터 데이터를 수집하게 된다. 마트의 소스에는 내부 운영체제, 중앙 데이터웨어하우스, 외부 데이터가 포함 될 수 있다. <베이스라인 모델 및 베스트 모델 선정> 일반적인 시계열 데이터에 유효한 다수의 예측 알고리즘을 대상으로 Baseline 모델과 Best모델 선정 프로세스를 만들 수 있다. 이는, 기존에 학습 데이터가 풍부한 고객과 신규 입점하여 데이터가 부족한 고객의 수요예측을 구분하여 결과를 산정하기 위한 것이다. 그 다음에는, 이벤트 변수 비교를 통한 보정 모델을 구현해야 하는데, 수요예측 결과에 영향을 주는 고객별 주요 이벤트를 별도 구분할 수 있다. 예를 들어 A 제조사의 이벤트가 기 존 주문과 이벤트 분석 패턴과는 다른 양상을 보일 경우에 현재 기준 과거 동일 요일 8주간의 평균 주문량과 이 벤트들을 비교 분석하고 현재 시점의 주문에 이벤트가 어떤 영향을 줄 것인지에 대한 분석 예측을 하게 된다. 이렇게 생성된 A 제조사의 예측결과를 보정하여 결과의 오차를 최소화 할 수 있다. <멀티 컴비네이션 수요예측모델> 풀필먼트 센터에서는 하루 2회 수요예측을 진행할 수 있다. 예를 들어, 전자상거래 플랫폼을 통해 주문이 들어 오고 해당제품을 6∼8시간 내 배송하기 위해서는 자체적으로 해당 제품이 언제 팔릴지를 예측해서 해당 물건의 재고를 준비하고 피킹(picking), 패킹(packing), 출고, 배송 프로세스를 수행해야 하는데, 이를 위해서는 수요 예측 기술이 반드시 바탕이 되어야 한다. 본 발명의 일 실시예에서는, 전자상거래 주문에 대한 예측과 전자상 거래 플랫폼사의 할인행사 이벤트, 제조사 수행 이벤트들을 고려한 예측을 할 수 있도록 멀티 컴비네이션 수요 예측모델을 이용할 수 있는데, 예를 들어, 이동평균모델인 MA(Moving Average Model), ML 계열 모델인 Random Forest, Lasso, Xgboost 등의 분석 알고리즘, 회귀(Regression) 계열을 바탕으로 과거 N 일간의 주문 데이터를 바탕으로 고객사 특성, 물성, 이벤트 등의 다양한 변수를 반영해 정확도가 가장 높은 알고리즘을 선택하게 된다. 이때, 멀티 컴비네이션 수요예측모델은 이하 표 1과 같이 조합될 수 있다. 이때, SVM은 서포트벡터머신 이고, RFM은 Recency, Frequency, Monetary이고, XGB는 상술한 Xgboost이고, LAS는 상술한 Lasso의 줄임말이며, RID는 회귀 모델의 Ridge Regression의 줄임말이고, REG는 Regression의 줄임말이며, ELA는 Elastic Net의 줄임말이다. 표 1 모델 SVM RFM XGB LAS RID REG ELA MA SVM SVM SVM-RFMSVM-XGBSVM-LASSVM-RIDSVM-REGSVM-ELASVM-MA RFM RFM-SVMRFM RFM-XGBRFM-LASRFM-RIDRFM-REGRFM-ELARFM-MA XGB XGB-SVMXGB-RFMXGB XGB-LASXGB-RIDXGB-REGXGB-ELAXGB-MA LAS LAS-SVMLAS-RFMLAS-XGBLAS LAS-RIDLAS-REGLAS-ELALAS-MA RID RID-SVMRID-RFMRID-XGBRID-LASRID RID-REGRID-ELARID-MA REG REG-SVMREG-RFMREG-XGBREG-LASREG-RIDREG REG-ELAREG-MA ELA ELA-SVMELA-RFMELA-XGBELA-LASELA-RIDELA-REGELA ELA-MAMA MA-SVMMA-RFMMA-XGBMA-LASMA-RIDMA-REGMA-ELAMA 이때, 주문 데이터 특성상 시계열 데이터 특성을 반영해 변수들이 생성되고 선택되어지는데, 예를 들어 예측시 간 기준 및 일자별 변화가 예측에 미치는 영향들이나 시스템 내 데이터 분석을 통해 파악된 소비자 구매 유형도 중요 변수를 생성해 선택할 수 있다. 여기서, 상술한 변수 외에도 날씨, 제조사의 원재료 수입상황, 달러 환율 변동, 국제 정세 등의 변수도 포함될 수 있으며 나열된 것들로 한정되지 않고 열거되지 않은 이유로 배제되지 않는다.모델링부는, 패킹유형별 수요를 예측할 때 ML(Machine Learning) 모델, 회귀 모델 및 이동평균 모 델을 이용하여 수요를 예측하도록 학습, 검증 및 테스트할 수 있다. 여기서 ML 모델은 수요 패턴이 일정하면서 변동성이 적은 주문 데이터를 처리할 때 이용할 수 있다. 예를 들어 RF, Xgboost, LGBM(Light Gradient Boosting Model) 등일 수 있다. 또, 회귀 모델은 수요 패턴이 일정하면서 변동성이 적인 주문 데이터를 처리할 때 이용할 수 있다. 예를 들어, LR, Ridge, Lasso 등일 수 있다. 또 이동평균모델은 수요는 적고 변동성이 큰, 상술한 이벤트와 같은 주문 데이터에 이용될 수 있다. 이때 예측 정확도의 평가기준은 가장 보편적으로 사 용되는 정확도 평균 절대 백분율 오차(MAPE)를 이용할 수 있다. 수요예측부는, 테스트의 결과 가장 높은 예측률을 가지는 수요예측모델을 세팅하고, 적어도 하나의 제조사 서버에서 발주될 주문 데이터를 실시간으로 예측할 수 있다. 사용자 단말은, 적어도 하나의 제조사 서버 의 주문 데이터에 기반하여 적어도 하나의 제조사 서버에서 발주될 수요예측에 따른 주문 데이터를 출력할 수 있다. 결과저장부는, 적어도 하나의 제조사 서버로부터 실시간으로 수집되는 주문 데이터인 실시간 데이터와, 수 요예측부에서 예측한 주문 데이터를 비교한 후 예측정확도를 산출할 수 있다. 이렇게 저장된 결과는 수요예측 모델을 수정하거나 재학습시키는데 이용될 수 있다. 최적경로제공부는, 사용자 단말에서 등록한 풀필먼트 센터 내 복수의 자율주행로봇이 상호 간 충돌을 최소화하면서 각각의 목적지까지 최단경로로 이동하도록 중앙집중형 DQN(Centralized Deep Q-Network)을 기반으로 이동경로를 제어할 수 있다. 풀필먼트 센터 내에 복수의 자율주행로봇이 존재하는 경우 또 사람 도 복잡하게 이동하는 경우 사람이나 로봇 간 충돌을 피하면서 최단경로로 이동함으로써 복수의 자율주행로봇 이 목적지까지 이동할 수 있어야 한다. 이를 위하여 자율주행로봇은 최적이동경로 제어를 위하여 DQN의 학습, 검증 및 테스트를 진행할 수 있다. 예를 들어, 풀필먼트 센터에 설치된 카메라(미도시)는 촬영된 사진을 최적경로제공부로 전송하고, 최적경로제공부는 영상처리를 통해 촬영된 사진으로부터 각 자율 주행로봇의 현재상태 S(t)를 파한다. 그 후 사전에 학습된 심층 신경망(Deep Neural Network) 모델에 S(t)를 입력하여 모든 행동에 대한 Q-value를 반환받으며, Epsilon-Greedy 정책에 의해 각 자율주행로봇에 대한 행동 A(t)를 결정한다. 최적경로제공부는 DNN 모델로부터 도출한 A(t)를 자율주행로봇에게 전 달한다. 이후, 최적경로제공부는 데이터를 수신한 자율주행로봇들은 A(t)에 따라 S(t+1)로 움직이 며, 이러한 동작은 에피소드가 끝날 때까지 반복된다. 이때, 카메라-최적경로제공부 간 통신은 정적인 환 경에서 이루어지므로 통신속도가 더 빠른 유선통신을 이용할 수 있고, 이동성으로 인해 동적환경에서 작동하는 자율주행로봇과 최적경로제공부 간의 통신은 Wi-Fi 기반 무선통신을 이용할 수 있다. <이동경로제어> 본 발명의 일 실시예에서 풀려는 문제를 MDP(Markov Decision Process)로 정의하며, 자율주행로봇은 최적 경로제공부가 에이전트로서 역할을 수행한다. 본 발명의 일 실시예에 따른 상태는 X×Y 그리드 환경에서 N 개 자율주행로봇의 정규화된 2차원 좌표로 정의된다. 타임스텝 t에서, 상태 S(t)는 다음과 같이 정의된 다. 수학식 1"}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1의 하단에서 si는 에이전트 i의 2차원 위치 정보를 나타내며, xi, yi는 각각 si의 x축 좌표와 y축 좌표 를 나타낸다. 또한, Z는 정수 집합을 나타낸다.에이전트는 각 자율주행로봇의 이동성을 제어하기 때문에 타임스텝 t에서, 에이전트가 선택한 행동 A(t)은 다음과 같이 정의된다. 이때, 수학식 2의 하단에서 △xi, -△xi, △yi와, -△yi는 각각 자율주행로봇 i의 우측 이동, 좌측 이동, 상향 이동, 하향 이동을 나타낸다. 수학식 2"}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이때, 상태(State)와 행동(Action)이 정의되었으니 보상(Reward)를 고려해야 한다. 이때, 두 가지의 목표를 고 려해야 하는데, 하나는 각 자율주행로봇들이 각자의 목적지까지 최단경로로 이동해야 하고, 다른 하나는 목적지까지 이동하는 동안 다른 자율주행로봇과의 충돌이 없도록 해야 한다. 따라서, 각 에이전트 i의 현 재 위치(xi(t), yi(t))에서 각자의 목적지(xigoal, yigoal)까지 맨해튼 거리(di(t))를 계산하고, di(t)와 di(t-1)를 비교하여 현재 타입스탭 t에서 목적지까지의 거리가 감소한 자율주행로봇의 개수를 ni(t)라 정 의한다. ni(t)를 이용하여 이하 수학식 3과 같은 보상을 정의할 수 있다. 수학식 3"}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3에서, 모든 에이전트가 목적지까지의 거리가 감소하도록 이동하는 경우에 가장 좋은 보상인 1의 값을 받으며, 서로 간의 충돌이 발생하였을 때 가장 나쁜 보상인 C의 값을 받도록 설정한다. 이때, C는 충돌이 발생 하였을 때의 보상이며, 에이전트가 충돌 회피를 잘 학습하도록 충돌이 일어나지 않았을 경우의 최소 보상인 -1 보다 작은 값으로 C를 설정한다. 이러한 보상의 설정은 모든 에이전트가 서로 간의 충돌을 최소화하며 목적지 까지 최소한의 타임스텝으로 이동할 수 있도록 한다. 화물관제부는, 사용자 단말에서 등록한 풀필먼트 센터에서 출발하는 적어도 하나의 화물차에 첨단 운 전자 보조 시스템(Advanced Driver Assistance Systems)을 등록한 후 화물차의 화물차 단말과 연결하고, 화물차의 실시간 관제를 위한 모니터링을 실시할 수 있다. 이때, 첨단 운전자 보조 시스템은, Fast R-CNN(Fast Region-based Convolutional Neural Network)를 기반으로 화물차의 이동방향에 위치한 객체 및 위치를 인식한 후 객체 및 위치를 문장으로 형성하여 출력할 수 있다. 최근 OECD 국가 중 인구 10만명당 교통사고건수의 1위 를 한국이 차지했는데, 특히 초등학생이나 노인 등 교통약자에 따른 교통사고가 많다. 화물차 운전자의 실수이 거나, 시야각이 확보되지 않은 것인데, 이를 줄이면서도 화물차의 위치를 확보하면서 관제센터에서 이를 모니터 링할 수 있도록 ADAS를 각 화물차 단말에 연결할 수 있다. Fast R-CNN은 단일단계 객체검출기법으로 두단 계 객체검출기법보다 빠른 시간 내에 객체를 식별할 수 있다. 다만, 두단계 객체검출기법보다 정확도가 낮은 것이 단점인데, 사고를 줄일 수 있도록 빠르게 검출하는 것을 우선순위로 두고 단일단계 검출기법을 이용할 수 있다. Fast R-CNN 또는 Faster R-CNN은 앵커박스로 객체인지 아닌지 분간을 하는 것이 아니라 물체 카테고리 중 객체가 어떠한 카테고리에 속하는지를 바로 분류결정을 내리게 된다. 이에 따라 두단계 객체검출기법보다 빠른 탐지가 가능하다. 본 발명의 일 실시예는 딥러닝 프레임워크인 카페(Caffe)와 텐서플로우(Tensorflow)를 이용하여 비정형 이미지 데이터를 CNN(Convolutional Neural Network)으로 학습한 후 생성된 모델을 활용하여 카메라로부터 입력받은 이 미지에 대한 정보를 문장으로 출력해주는 웹 서비스를 이용할 수 있다. 학습을 위해 딥러닝 라이브러리인 텐서 플로우(Tensorflow)를 통하여 배경 정보를 추출하고 카페(caffe)를 통하여 객체 위치 정보를 추출한 후 이미지 를 묘사하는 적합한 문장을 태깅(Tagging)하여 입력 데이터셋을 구성할 수 있다. 생성된 데이터셋을 입력으로 레이어들을 거쳐 이미지 분류 후 추론 값과 정답의 비교를 통해 파라미터를 수정하여 학습할 수 있고, 학습에는 아마존 웹 서비스(AWS)를 통해 GPU를 가속한 학습을 진행할 수 있다. 인식된 이미지를 바탕으로 문장을 생성하 는 언어처리는 먼저 입력 데이터 형식을 이미지 인식 모델을 통해 얻은 이미지 배경 정보와 객체 위치 정보 그리고 이미지를 묘사하는 문장을 결합하는 형태로 정한 후 입력 데이터셋을 C5.0 알고리즘에 적용할 수 있고, 이 미지의 2개 이상의 객체 간의 위치 정보를 토대로 특징점을 추출하여 의사결정 트리(Decision Tree) 문장을 생 성할 수 있다. 알고리즘에 적용할 입력 데이터 형식은 이미지에서 추출할 수 있는 이미지 정보(배경 정보, 객 체의 위치 정보)와 이미지를 묘사한 문장을 결합한 형태이며 이미지를 입력으로 Auto Description 시스템이 문 장을 생성하여 음성으로 변환한 후 운전자에게 알려줄 수 있도록 구성할 수 있다. 재고파악부는, 사용자 단말에 등록된 물류창고에 위치한 재고를 파악하기 위하여, 각 구역 및 위치에 적재된 적어도 하나의 재고를 고유식별코드의 스캔 또는 리딩을 통하여 적어도 하나의 드론이 파악하도록 할 수 있다. 드론은 각 물류창고의 위치, 각 물류창고 내의 구역(영역)의 위치, 구역 내 랙(Rack)의 위치 및 구분코드를 모두 저장했다고 가정한다. 이때 랙은 Z 축으로도 물품을 쌓게 되므로, 구역 내 위치를 표시할 때에는 XY 좌표 뿐만 아니라 Z 좌표도 함께 표시되어야 한다. 이때 Z 좌표는 몇 번째 칸인지에 대한 숫자에 대응할 수도 있다. 드론은 물류창고의 각 구역을 구분하고, 각 구역 내 랙을 구분하며, 각 랙의 XYZ 좌표 를 각 랙에 부착된 위치식별코드로 구분할 수 있다. 드론은 각 물품의 포장에 부착된 QR 코드나 바코드 등을 스캔 또는 리딩하고, 위치식별코드를 함께 리딩함으로써 재고가 어디에 있는지 또 얼마나 있는지를 파악할 수 있게 된다. 이하, 상술한 도 2의 플랫폼 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설 명하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하다 할 것이다. 도 3을 참조하면, (a) 플랫폼 서비스 제공 서버는 수요예측을 위해 주문 데이터를 수집 및 전처리 한 후 각 변수에 따라 예측마트를 생성하고, 수요예측모델을 설정한 후 학습-검증-테스트의 과정을 거쳐 가장 정확도 가 높은 수요예측모델을 세팅할 수 있다. 그리고, 풀필먼트 센터 또는 물류창고에서 하루 2 회씩 예측을 하면 서 예측값과 실제값의 차이가 얼마나 나는지를 파악한 후 이를 재학습을 위한 데이터로 이용할 수 있다. 플랫 폼 서비스 제공 서버는 (b)와 같이 자율주행로봇을 이용하여 피킹, 소팅(Sorting), 패킹, 로딩 등의 작업을 수행할 때에는 자율주행로봇 간 충돌회피를 하면서도 최단경로로 이동할 수 있도록 DQN 모델을 이 용할 수 있다. 또, 플랫폼 서비스 제공 서버는 (c) 화물차에 ADAS를 장착하고 화물차 운전자에게 객체를 이미지 분석으로 파악한 후 스크립트를 제작하여 음성으로 안내해줄 수 있다. 여기서 더 나아가 플랫폼 서비스 제공 서버는 브레이크 제동력 분배를 이용하여 ADAS로 객체가 발견된 경우 제동거리를 고려하여 자동으로 브레이크를 구동하도록 설정할 수도 있다. 이때, 자동긴급제동장치인 AEB(Autonomous Emergency Braking), 적응 순항 제어(Adaptive Cruise Control)인 ACC, 차선 유지 보조 시스템인 LKAS(Lane Keeping Assistance System)은, 국제표준인 ISO-15622 및 ISO-11270에 대응하므로 상세한 설명을 생략한다. 이 외에도 전방충돌회 피시스템인 FVCMS(Forward Vehicle Collision Mitigation System)의 국제표준은 ISO-22839, 보행자탐지 및 충 돌 완화 시스템인 PDCMS( Pedestrian Detection and Collison Mitigation System)의 국제표준은 ISO 19237인데, 이를 ADAS에 적용하여 자동으로 추돌을 방지할 수 있도록 설정할 수 있다. 브레이크 동작 후 잔여거리는 제동 후 바퀴의 이동거리로 환산할 수 있다. 잔여거리는 분당회전수(RPM, Revolution Per Minute)에 기어비와 바퀴의 직경을 나눈 값에 제동시간을 곱하여 계산한다. ACC의 동작은 카메 라 센서와 레이더 센서로부터 영상 및 주행상황 수신 후 충돌회피거리(Collision Avoid Distance, CAD), 최종충 돌회피거리(Final Collision Avoid Distance, FCAD), 상대거리(Relative Distance, RD)의 값을 산출 및 비교분 석하여 안전, 경고, 위험 등의 단계로 구분한다. 안전상황은 운전자의 개입 없이 주행이 가능한 상황이며, 경 고단계는 전방충돌경고시스템(Foward Collision Warnig System, FCWS)이 작동하며 전방의 목표차량의 존재를 확 인하여 충돌위험 가능성을 알려준다. 위험단계는 목표차량의 감속도가 제어차량의 감속도 보다 큰 경우 제어차 량이 목표차량과 충돌이 일어나지 않도록 편제동(Partial Braking) 제어를 수행한다. LKAS는 제어차량의 차선추종 제어를 위해 카메라 센서의 차선 인식 알고리즘으로 산출되는 차선중심과 차량중심 간 거리, 차선중심과 차량 간 각도, 도로반경, 차선인식 여부 등의 신호를 이용한다. 차선이 인식된 상태에서 제어차량이 차선 이탈을 감지한 경우 제어차량에 1 초간 0.3g의 제동력을 인가하여 운전자가 조향을 하기 조금 더 용이하게 수행한다. LKAS 동작시 전제동(Full Braking)으로 인한 뒷차와의 사고를 예방하기 위해 편제동 제 어를 수행하도록 알고리즘을 구현할 수 있다. AEB는 일반적으로 주행중 전방의 차량 및 보행자에 대한 위험 상 황 판단하기 위해 상대거리에 따른 충돌소요시간(Time to Collision, TTC)을 이용한다. 이때, AEB에 의해 위험 상황이 판단되면 제어차량과 위험 물체간의 상대거리를 계산하고 브레이크 제동력 인가 여부를 결정할 수도 있 다. 긴급제동을 수행할 경우 제어차량은 제동을 위한 전방 장애물의 상대거리와 충돌회피거리를 비교하여 보다 안전한 방법으로 수행할 수 있다. 제동전 순서는 FCWS 동작 후 제동시 전제동제어를 수행하도록 제어알고리즘을 구성할 수 있다. 물론 상술한 방법 외에도 다양한 방법을 이용할 수 있음은 물론이라 할 것이다. 또, 도 4의 (a)와 같이 플랫폼 서비스 제공 서버는 드론을 이용하여 재고를 파악할 수 있고, (b)와 같이 화물자의 실시간 관제를 사용자 단말에서 수행할 수 있도록 연결되도록 할 수 있다. 그리고, (c)와 같이 풀필먼트 서비스를 제공하고, (d)와 같이 제조업에 특화된 SCM(Supply Chain Managment)를 제공하기 위해 상술한 수요예측을 수행할 수 있다. 이와 같은 도 2 내지 도 4의 스마트 물류 플랫폼 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 을 통해 스마트 물류 플랫폼 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하 게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 스마트 물류 플랫폼 서비스 제공 시스템에 포함된 각 구성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터가 송수신되 는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설명한 다양한"}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 플랫폼 서비스 제공 서버는, 적어도 하나의 제조사 서버로부터 기 설정된 기간 동안의 주문 데이터를 수집한다(S5100). 그리고, 플랫폼 서비스 제공 서버는, 기 설정된 기간 동안의 주문 데이터의 이상치(Outlier)를 제거하고 패킹유 형, 주문량, 이벤트, 요일 및 명절을 포함한 예측마트(Mart)를 생성하고(S5200), 패킹유형별 수요를 예측할 때 ML(Machine Learning) 모델, 회귀 모델 및 이동평균 모델을 이용하여 수요를 예측하도록 학습, 검증 및 테스트 한다(S5300). 그리고, 플랫폼 서비스 제공 서버는, 테스트의 결과 가장 높은 예측률을 가지는 수요예측모델을 세팅하고, 적어 도 하나의 제조사 서버에서 발주될 주문 데이터를 실시간으로 예측한다(S5400). 상술한 단계들(S5100~S5400)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5400)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 스마트 물류 플랫폼 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4 를 통해 스마트 물류 플랫폼 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하 게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 스마트 물류 플랫폼 서비스 제공 방법은, 컴퓨터에 의해 실행되는 애플리 케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데 이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매 체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 스마트 물류 플랫폼 서비스 제공 방법은, 단말기에 기본적으로 설치된 애플 리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의 해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등 의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수 도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 스마트 물류 플랫폼 서비스 제공 방법은 단말 기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기에 등 의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2023-0138775", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2023-0138775", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 스마트 물류 플랫폼 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 도 1의 시스템에 포함된 플랫폼 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 스마트 물류 플랫폼 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 스마트 물류 플랫폼 서비스 제공 방법을 설명하기 위한 동작 흐름도이다."}
