{"patent_id": "10-2023-0139211", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0055717", "출원번호": "10-2023-0139211", "발명의 명칭": "외상매출금 한도 산정 서비스 제공 시스템", "출원인": "(주)모든솔루션", "발명자": "오익환"}}
{"patent_id": "10-2023-0139211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외상거래로 상품 또는 용역을 납품 또는 제공하기 이전에 상기 외상거래에 따른 외상매출금 한도의 산정을 요청하고, 요청의 결과로 외상매출금의 한도를 수신하여 출력하는 공급사 단말;상기 공급사 단말과 외상거래를 진행하기 위하여 신용정보조회에 동의하는 거래처 단말; 및상기 공급사 단말로부터 외상거래에 대한 외상매출금 한도의 산정을 요청받는 접수부, 상기 거래처 단말의 거래처에 대한 신용정보조회를 수행한 후 신용평가 데이터를 수집하는 신용평가부, 상기 공급사 단말 및 거래처 단말 간 거래내역이 존재하는 경우 거래내역 데이터를 추출하는 거래내역부, 상기 공급사 단말의 공급사의 외상거래 내규 데이터를 수집하는 내규수집부, 상기 신용평가 데이터, 거래내역 데이터 및 내규 데이터에 기반하여 외상매출금 한도를 산정하는 산정부를 포함하는 산정 서비스 제공 서버;를 포함하는 외상매출금 한도 산정 서비스 제공 시스템."}
{"patent_id": "10-2023-0139211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서상기 산정 서비스 제공 서버는,상기 외상매출금을 관리하기 위하여 기준정보, 한도 및 회수를 관리하는 관리부;를 더 포함하고,상기 기준정보를 관리하는 기준정보관리는, 상기 외상매출금의 약정관리, 상기 외상매출금의 약정이율관리 및상기 외상매출금의 담보관리를 포함하고,상기 한도를 관리하는 한도관리는, 상기 신용평가 데이터의 신용평가정보, 외상거래의 과거이력정보 및 한도산정관리를 포함하고,상기 회수를 관리하는 회수관리는, 외상매출금에 대한 외상매출채권의 채권회수관리, 채권원장관리 및 채권현황관리를 포함하는 것을 특징으로 하는 외상매출금 한도 산정 서비스 제공 시스템."}
{"patent_id": "10-2023-0139211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서상기 거래내역 데이터는,일반거래기간, 외상거래기간, 연간일반거래금액, 연간외상거래금액, 약정기간 내 상환내역, 약정기간 내 연체거래내역 및 외상거래를 위한 담보제공내역을 포함하는 것을 특징으로 하는 외상매출금 한도 산정 서비스 제공 시스템."}
{"patent_id": "10-2023-0139211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서상기 산정 서비스 제공 서버는,상기 거래처 단말에 설정된 외상매출금 한도에 대하여 상기 거래처 단말의 연체 또는 결제 여부에 따라 상기 외상매출금 한도를 증감시키는 업데이트부;공개특허 10-2025-0055717-3-를 더 포함하는 것을 특징으로 하는 외상매출금 한도 산정 서비스 제공 시스템."}
{"patent_id": "10-2023-0139211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서상기 산정 서비스 제공 서버는,상기 거래처 단말의 매출 데이터 및 비용 데이터를 실시간으로 수집 및 누적하고, 상기 외상매출금의 한도를 산정할 때 이용하는 자금모니터링부;를 더 포함하는 것을 특징으로 하는 외상매출금 한도 산정 서비스 제공 시스템."}
{"patent_id": "10-2023-0139211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서상기 산정 서비스 제공 서버는,상기 거래처 단말에서 외상매출금의 청구에 기하여 파산 또는 회생을 신청하고, 상기 파산 또는 회생을 신청한횟수가 기 설정된 횟수를 초과하는 경우 거래회피리스트에 포함시켜 공유하는 공유부;를 더 포함하는 것을 특징으로 하는 외상매출금 한도 산정 서비스 제공 시스템."}
{"patent_id": "10-2023-0139211", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "외상매출금 한도 산정 서비스 제공 시스템이 제공되며, 외상거래로 상품 또는 용역을 납품 또는 제공하기 이전에 외상거래에 따른 외상매출금 한도의 산정을 요청하고, 요청의 결과로 외상매출금의 한도를 수신하여 출력하는 공 급사 단말, 공급사 단말과 외상거래를 진행하기 위하여 신용정보조회에 동의하는 거래처 단말 및 공급사 단말로 부터 외상거래에 대한 외상매출금 한도의 산정을 요청받는 접수부, 거래처 단말의 거래처에 대한 신용정보조회를 수행한 후 신용평가 데이터를 수집하는 신용평가부, 공급사 단말 및 거래처 단말 간 거래내역이 존재하는 경우 거래내역 데이터를 추출하는 거래내역부, 공급사 단말의 공급사의 외상거래 내규 데이터를 수집하는 내규수집부, 신용평가 데이터, 거래내역 데이터 및 내규 데이터에 기반하여 외상매출금 한도를 산정하는 산정부를 포함하는 산정 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2023-0139211", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 외상매출금 한도 산정 서비스 제공 시스템에 관한 것으로, 공급사에서 거래처에 상품 또는 용역을 공 급 또는 제공할 때 외상거래에서 외상매출금 한도를 산정해줌으로써 채권 건정성을 확보할 수 있는 시스템을 제 공한다."}
{"patent_id": "10-2023-0139211", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "외상거래는 거래에서 매매계약이 성립되어 상품이 인도되었지만 그에 대한 대금은 일정기간이 지난 후에 결제되 는 거래를 말하며, 외상매매 또는 신용거래(信用去來)라 한다. 이러한 신용거래는 신용을 믿음으로써 장래 채 무를 지급하는 대차관계가 발생한다. 이렇게 외상으로 물품의 매각, 용역의 제공 등이 일어날 때 이에 대한 대 가를 외상매출채권 및 받을어음 이라는 용어로 사용하고 있다. 이때 외상매출채권을 발생시키는 외상매출금은 상품·제품의 판매 또는 용역의 제공에 의하여 발생한 것으로서 비교적 단기간에 회수가능한 채권을 총칭한다. 각 은행권 등 금융기관에서는 개인 및 기업의 대출한도를 산정하기 위한 시스템을 보유하고 있으나, 상품이나 용역 거래시 거래방법 중 하나인 외상거래에 있어서 적절한 외상매출금 한도금액을 산정할 수 있는 시스템이 존 재하지 않는다. 이때, 외상거래를 할 때 외상결제한도를 설정하거나 외상매출금을 기반으로 대출을 하는 방법이 연구 및 개발되 었는데, 이와 관련하여, 선행기술인 한국공개특허 제2020-0122550호(2020년10월28일 공개) 및 한국공개특허 제 2014-0070279호(2014년06월10일 공개)에는, 사용자 단말로부터 담보자산을 제공받아 가치를 평가하고, 담보자산 의 가치에 기초하여 외상결제한도를 결정하며, 외상결제한도 내에서 외상결제를 승인하고, 기 설정된 기간의 경 과 후 외상결제대금을 합산하여 청구하는 구성과, 판매자 단말로부터 외상매출금에 기반한 대출신청을 받고, 은 행 서버는 대출신청에 기초하여 외상매출금을 파악하기 위하여 쇼핑몰에 정보를 요청하며, 판매자 단말의 외상 매출금에 기초하여 대출신청을 승인하고, 쇼핑몰 서버로부터 지급되는 외상매출금을 회수하여 대출금액을 정산 하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 담보자산의 가치에만 기초하여 외상결제한도를 결정하기 때문에 담보를 넘는 외상결제한도를 설정할 수 없고, 후자의 경우에는 외상매출금이 확정된 후 대출을 받는 구성이지 적정한 외상매출금을 산정하는 구성이 아니다. 대기업 등 규모가 큰 기업은 자체적인 외상매출금 한도 산정기준을 정하여 담보를 제공하거나 보증서 제출 등의 방법으로 외상매출금 한도를 활용하고 있으나 객관적 데이터에 의한 기준은 아니다. 또, 중견, 중소 및 영세기업은 이러한 담보를 제공하는 방법을 활용하기가 어려운 것이 현실이다. 이에, 외상거래에 대한 채권 건정성을 확보할 수 있는 외상매출금 한도 산정 방법의 연구 및 개발이 요구된다."}
{"patent_id": "10-2023-0139211", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 거래처에 대한 신용평가 데이터를 수집하고, 거래처와 공급사 간 거래내역이 존재하는 경우 거래내역 데이터를 수집하며, 공급사의 공급사 단말로부터 외상거래 내규 데이터를 수집한 후, 신용평가 데이터, 거래내역 데이터 및 내규 데이터에 기반하여 외상매출금을 산정하도록 하고, 산정된 외상매출금을 공급 사 단말로 전달함으로써, 공급사 단말에서 거래처 단말의 거래처로 상품이나 용역을 납품할 때 납품되는 상품이 나 용역의 가액을 가늠할 수 있도록 하고, 외상거래에 대한 채권 건정성을 확보할 수 있는, 외상매출금 한도 산 정 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0139211", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 외상거래로 상품 또는 용역을 납품 또는 제공하기 이전에 외상거래에 따른 외상매출금 한도의 산정을 요청하고, 요청의 결과로 외상매출금의 한도를 수신하여 출력하는 공급사 단말, 공급사 단말과 외상거래를 진행하기 위하여 신용정보조회에 동의하는 거래처 단말 및 공급사 단말로부터 외상거래에 대한 외상매출금 한도의 산정을 요청받는 접수부, 거래처 단말의 거래처에 대한 신용정보조회를 수행한 후 신용평가 데이터를 수집하는 신용평가부, 공급사 단말 및 거래처 단말 간 거래내역이 존재하는 경우 거래내역 데이터를 추출하는 거래내역부, 공급사 단말의 공급사의 외상거래 내규 데이터를 수집하는 내규수집부, 신용평가 데이터, 거래내역 데이터 및 내규 데이터에 기반하여 외상매출금 한도 를 산정하는 산정부를 포함하는 산정 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2023-0139211", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 거래처에 대한 신용평가 데이터를 수집하고, 거래처 와 공급사 간 거래내역이 존재하는 경우 거래내역 데이터를 수집하며, 공급사의 공급사 단말로부터 외상거래 내 규 데이터를 수집한 후, 신용평가 데이터, 거래내역 데이터 및 내규 데이터에 기반하여 외상매출금을 산정하도 록 하고, 산정된 외상매출금을 공급사 단말로 전달함으로써, 공급사 단말에서 거래처 단말의 거래처로 상품이나 용역을 납품할 때 납품되는 상품이나 용역의 가액을 가늠할 수 있도록 하고, 외상거래에 대한 채권 건정성을 확 보할 수 있다."}
{"patent_id": "10-2023-0139211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계,동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 외상매출금 한도 산정 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1을 참조하면, 외상매출금 한도 산정 서비스 제공 시스템은, 적어도 하나의 공급사 단말, 산정 서비스 제공 서버, 적어도 하나의 거래처 단말을 포함할 수 있다. 다만, 이러한 도 1의 외상매출금 한도 산 정 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 공급사 단말은 네트워크를 통하여 산정 서비스 제공 서버와 연결 될 수 있다. 그리고, 산정 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 공급사 단말 , 적어도 하나의 거래처 단말과 연결될 수 있다. 또한, 적어도 하나의 거래처 단말은, 네트워 크를 통하여 산정 서비스 제공 서버와 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), 5G NR(New Radio), 6G(6th Generation of Cellular Networks), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷 (Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스(Bluetooth) 네트워크, NFC(Near- Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 공급사 단말은, 외상매출금 한도 산정 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 거래처에 상품 또는 용역을 공급하는 공급사의 단말일 수 있다. 이때, 공급사 단말 은 거래처 단말의 거래처에서 외상거래를 요청하는 경우, 외상매출금 한도의 산정을 산정 서비스 제 공 서버로 요청하는 단말일 수 있다. 그리고, 공급사 단말은, 외상매출금 한도를 산정 서비스 제공 서버로부터 수신하여 출력하는 단말일 수 있다. 여기서, 적어도 하나의 공급사 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 공급사 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 공급사 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 산정 서비스 제공 서버는, 외상매출금 한도 산정 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이 션을 제공하는 서버일 수 있다. 그리고, 산정 서비스 제공 서버는, 공급사 단말로부터 외상거래에 대한 외상매출금 한도의 산정을 요청받고, 거래처 단말의 거래처에 대한 신용정보조회를 수행한 후 신용평 가 데이터를 수집하는 서버일 수 있다. 그리고, 산정 서비스 제공 서버는, 공급사 단말 및 거래처 단말 간 거래내역이 존재하는 경우 거래내역 데이터를 추출하고, 공급사 단말의 공급사의 외상거래 내규 데이터를 수집하는 서버일 수 있다. 또한, 산정 서비스 제공 서버는, 신용평가 데이터, 거래내역 데 이터 및 내규 데이터에 기반하여 외상매출금 한도를 산정하는 서버일 수 있다. 여기서, 산정 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 거래처 단말은, 외상매출금 한도 산정 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 외상거래로 상품 또는 용역을 공급받는 거래처의 단말일 수 있다. 이때, 거래처 단말 은 외상거래를 공급사 단말로 요청할 때, 신용정보조회에 동의를 하는 단말일 수 있다. 여기서, 적어도 하나의 거래처 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 거래처 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 거래처 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 산정 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 외상매출금 한도 산정 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 산정 서비스 제공 서버는, 접수부, 신용평가부, 거래내역부, 내규수집부 , 산정부, 관리부, 업데이트부, 자금모니터링부 및 공유부를 포함할 수 있다. 본 발명의 일 실시예에 따른 산정 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하 나의 공급사 단말 및 적어도 하나의 거래처 단말로 외상매출금 한도 산정 서비스 애플리케이션, 프로 그램, 앱 페이지, 웹 페이지 등을 전송하는 경우, 적어도 하나의 공급사 단말 및 적어도 하나의 거래처 단말은, 외상매출금 한도 산정 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크립트를 이용하여 서비스 프로그램이 적어도 하나의 공급사 단말 및 적어도 하나의 거래처 단말에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트 를 받아서 보여주는 프로그램을 의미하며, 예를 들어 크롬(Chrome), 에지(Microsoft Edge), 사파리(Safari), 파이어폭스(FireFox), 웨일(Whale), UC 브라우저 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그 램(Application)을 의미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 접수부는, 공급사 단말로부터 외상거래에 대한 외상매출금 한도의 산정을 요청받을 수 있다. 공급사 단말은, 외상거래로 상품 또는 용역을 납품 또는 제공하기 이전에 외상거래에 따른 외상 매출금 한도의 산정을 요청할 수 있다. 이때, 매출채권관리는 기업의 경영성과를 높이기 위해 매출채권을 어떻 게 효율적으로 관리할 것인가에 관한 것으로, 채무의 이행과 채권부실화 발생가능성을 최소화할 목적으로 한 예 방적 관리를 하는 일련의 과정과 조치인 사전적 매출채권관리와, 부실화된 채권을 신속하게 회수하기 위한 사후 적 매출채권관리로 나눌 수 있다. 사전적 매출채권관리는 거래처의 재정상태, 경영능력 등에 대한 조사와 거래 개시 후 매출금이 회수될 때까지 거래처의 영업상황을 파악하여 거래 확대 또는 축소 여부를 판단하기 위한 것으로, 거래처에 대한 신용조사와 분석 및 평가가 핵심요인이라고 할 수 있으며, 대손을 최소화하기 위해 담보활 용, 팩토링, 신용보험 가입, 기업구매자금대출, 대손충당금 설정, 아웃소싱 등을 활용하는 신용통제관리방법을 포함한다. 기업은 다른 기업과 제품 또는 서비스를 신용으로 거래하면서 신용제공 여부, 신용한도, 신용조건 등에 대한 신 용정책 내지 신용기준에 대한 의사결정과, 거래처의 신용상태, 재무상태, 신용기간 등을 고려한 신용판매에 대 한 의사결정을 하게 된다. 이러한 신용거래의사결정은 성장에 초점을 두고 있는 기업, 시장지배력을 갖고 있는 기업, 안정성에 중점을 두고 사업을 영위하는 기업 등 기업이 처한 위치나 전략에 따라 달라질 수 있으며, 기업 가치에 중요한 영향을 미치게 된다. 신용판매의사결정은 거래처의 미결제위험과 같은 미래예측의 영역이고, 의 사결정을 위한 객관적인 지표가 부족하며, 의사결정자들의 경험과 직관에 의존하는 경향성이 있어 의사결정의 모호함과 불확실성이 존재한다. 역으로 거래처의 정보들을 취득하여 데이터가 충분하고, 내부시스템이 갖추어 지면 생산비용, 원가, 판매가격 등의 내부 회계정보를 함께 반영하여 최적의 신용판매의사결정에 적용될 수 있 음을 의미한다. 이를 위해 중소기업들은 거래처와 경쟁업체 및 시장 환경에 대한 정보를 체계적으로 수집하고 관리할 필요성이 점점 더 커지고 있다. 신용판매의사결정은 고객 접점에서 수시로 그리고 신속하게 이루어지며, 거래처와 지속적인 거래관계를 유지하 면서 거래처의 경영상황 변화와 거래조건에 맞추어 적정하게 신용을 부여하여야 한다. 이를 위해 매출채권 지 급을 면밀히 모니터링하여 결제가 지연되는 잠재적인 문제를 알아차리고 이상징후를 감지하여 신용제공 및 신용 기간 등을 합리적으로 조정하는 것이 필요하다. 한편, 고객과의 접점에서 많은 소통과 매출채권의 거래규모 추 세, 결제지연 여부 등을 파악하는 등 시시각각 변화하는 거래처의 신용도와 정보를 파악하기 위해서는 영업담당 자의 판단에 의존할 수밖에 없고 영업담당자에게 상당부분 위임하는 것이 불가피하다. 이에 본 발명의 일 실시 예에서는 이하의 3 가지 요인에 기반하여 각 거래처별 외상매출금의 한도를 산정하기로 한다. 즉, 신용으로, 즉 외상으로 거래를 할 수 있는 금액이 얼마인지를 산정하는 것이다. 이때, 하나의 거래처에서 상품이나 용역 을 공급받는 공급사가 복수, 즉 N 개라고 가정하면, N 개의 지출비 및 지출금액을 함께 수집할 수 있는 경우 이 에 대한 정보도 함께 수집하여 금액을 산정할 수 있다. 신용평가부는, 거래처 단말의 거래처에 대한 신용정보조회를 수행한 후 신용평가 데이터를 수집할 수 있다. 거래처 단말은, 공급사 단말과 외상거래를 진행하기 위하여 신용정보조회에 동의할 수 있다. 만약, 신용정보를 조회할 대상, 즉 거래처가 중소기업이라면, 기업의 회계 투명성과 신뢰성이 낮은 중소기업 특 성상 발생할 수 있는 재무지표에 대해서 이상치와 결측치가 발생하는 경우를 따로 분류하여 통계 분석 결과에 영향을 미치지 않게 변형하고, 본 발명의 일 실시예에 따른 데이터에 포함하여 중소기업 전용의 심층신경망 기 반의 신용평가 모형을 이용할 수 있다. 또한, 설명 가능한 AI(XAI) 알고리즘을 통해 인공지능 모형이 도출한 신용평가 결과에 대해 요인들을 도출해 내고, 그 이상치와 특이값에 대한 의미를 해석하고 반영할 수 있다. 일반적으로 중소기업의 재무제표에 대한 신뢰성 문제는 오랫동안 제기되어 왔으며 이에 따라 결측치 및 이상치 비중이 상대적으로 높을 뿐만 아니라 오류에 의한 값인지 실제 값인지 명확하게 확인하기 어렵다. 이러한 이유 로 일반적으로 신용평가 모형 구축 시 결측치와 이상치 값을 모두 제거하기 때문에 정보의 활용성이 낮을 뿐만 아니라 정확하고 고도화된 모형 구축에 어려움이 있다. 이에 따라, 상술한 바와 같이 본 발명의 일 실시예에서 는 중소기업 신용평가의 비정형화된 정보의 활용가능성에 주목하여 결측치와 이상치를 고려한 신용평가모형을구축할 수 있다. 이를 위한 분석자료는 중소기업통합시스템(SIMS)에 해당하는 기업을 선별할 수 있고, 알고리 즘은 로지스틱 회귀모형과 심층신경망을 이용할 수 있다. 이렇게 구축된 신용평가모형을 이용하여 신용평가를 시행할 수 있다. 거래내역부는, 공급사 단말 및 거래처 단말 간 거래내역이 존재하는 경우 거래내역 데이터를 추 출할 수 있다. 예를 들어, 공급사가 거래처에 납품했던 이력이 존재했다면 이 이력을 추출할 수 있다. 거래내 역 데이터는, 일반거래기간, 외상거래기간, 연간일반거래금액, 연간외상거래금액, 약정기간 내 상환내역, 약정 기간 내 연체거래내역 및 외상거래를 위한 담보제공내역을 포함할 수 있다. 만약 거래내역이 없고 첫 거래인 경우에는 공급사로부터 담보를 설정받는 것으로 갈음할 수 있다. 또는, 담보를 설정해주지 않는 경우에는 앞으 로 발생할 매출채권에 대하여 질권을 설정할 수도 있다. 예를 들어, 거래처가 쇼핑몰인 경우, 쇼핑몰에서 발생 및 지급될 매출에 대한 정산금액을 직접 공급사 단말에서 받도록 설정할 수도 있다. 내규수집부는, 공급사 단말의 공급사의 외상거래 내규 데이터를 수집할 수 있다. 만약 외상거래 내 규 데이터에 기재된 기준 또는 퍼센트를 초과하는지의 여부를 파악하거나, 조건을 만족하는지 등을 파악함으로 써 외상매출금의 한도를 설정할 수 있다. 산정부는, 신용평가 데이터, 거래내역 데이터 및 내규 데이터에 기반하여 외상매출금 한도를 산정할 수 있 다. 공급사 단말은, 요청의 결과로 외상매출금의 한도를 수신하여 출력할 수 있다. 외상매출금의 한도 내에서 상품 또는 용역을 공급할 수 있으며, 외상매출금에 대한 채권회수가 되지 않는 경우 상품 또는 용역의 공급을 거부할 수 있다. 관리부는, 외상매출금을 관리하기 위하여 기준정보, 한도 및 회수를 관리할 수 있다. 이때, 도 4를 참조 하면, 기준정보를 관리하는 기준정보관리는, 외상매출금의 약정관리, 외상매출금의 약정이율관리 및 외상매출금 의 담보관리를 포함하고, 한도를 관리하는 한도관리는, 신용평가 데이터의 신용평가정보, 외상거래의 과거이력 정보 및 한도산정관리를 포함하고, 회수를 관리하는 회수관리는, 외상매출금에 대한 외상매출채권의 채권회수관 리, 채권원장관리 및 채권현황관리를 포함할 수 있다. 상술한 3 가지의 주요 관리 포인트 외에도, 거래처의 매 출을 예측함으로써 매출회수가능성을 예측하고, 매출회수가능성에 따라 금액을 증감하거나 이율을 증감하는 등 의 방법을 더 이용할 수도 있다. 이를 위하여, 본 발명의 일 실시예에서는, 결측치 알고리즘과 그래디언트 부스팅 알고리즘을 적용해 기업별 매 출 예측을 진행할 수 있다. 이를 통해 결측치 알고리즘과 머신러닝 기법에 따른 예측 정확도를 비교할 수 있다. 기업 매출 데이터에 평균 대체법, 중앙값 대체법, 선형 보간법, 곡선 보간법을 적용해 총 5 가지 데이터 셋을 생성할 수 있다. 이 5 가지 데이터셋과 XGBoost, LightGBM, CatBoost 모델을 이용해 예측을 진행한 결과, 각각 차례로 중앙값 대체 기법을 이용한 데이터셋, 결측치가 보존된 데이터셋, 평균값 대체기법 그래디언트 부 스팅 모델을 활용한 기업 매출 예측을 이용한 데이터셋과의 조합에서 좋은 성능을 보인 모델을 본 발명의 예측 모델로 선정한다. 이때, 데이터셋에 결측치 대체 알고리즘 중 단일대체법을 적용할 수 있다. 또는 결측치 보 간법 알고리즘을 사용해 결측치를 대체할 수도 있다. 업데이트부는, 거래처 단말에 설정된 외상매출금 한도에 대하여 거래처 단말의 연체 또는 결제 여부에 따라 외상매출금 한도를 증감시킬 수 있다. 자금모니터링부는, 거래처 단말의 매출 데이터 및 비용 데이터를 실시간으로 수집 및 누적하고, 외상 매출금의 한도를 산정할 때 이용할 수 있다. 이때, 기업 입장에서 앞으로 있을 현금흐름에 대한 예측이란, 향 후 발생할 수 있는 유동성(현금부족) 위험을 미리 파악할 수 있다는 점과 미래의 투자계획을 세우는데 중요한 자료가 될 수 있다는 점에서 중요한 의의를 지닌다. 그러나 기업 간 거래에서 매출채권 형태로 발생하는 거래 유형은 다른 유형의 거래와는 달리 채무 이행 불확실성이 존재하며, 이로 인해 정확한 현금흐름 예측을 어렵게 한다. 본 발명의 일 실시예에서는 추계적 분석 기법의 하나인 가변 마코프 기법(Variable Order Markov Model, 이하 VOM)을 활용하여 기업 간에 발생 할 수 있는 매출채권과 관련한 현금흐름 동향을 예측할 수 있다. 구체적 으로는, PST(Probabilistic Suffix Tree)라는 가변 마코프 기법을 활용하여, 지난 과거의 매출채권 발행 및 수 금 내역을 바탕으로 해당 매출채권들의 기대연령을 예측할 수 있다. 기업 간에 일어나는 현금흐름은 내재되어 있는 특유의 불확실성으로 인해 사전에 제대로 파악되지 못할 수 있으 며, 현금흐름 예측의 실패로 인해 예기치 못한 현금 유동성 위기를 겪을 위험성이 항상 존재하고 있다. 이러한 관점에서 매출채권 연령 예측 분야(Forecasting Accounts Receivable Aging)는 고객 회사의 채무 이행 지연 혹 은 불이행과 같은, 이른 바 악성 채무 가능성을 사전에 파악할 수 있다는 점에서 주목을 받아 왔다. 매출채권이란 기업이 상품을 판매하는 과정에서 발행한 채권으로, 아직 회수가 되지 않은 매출채권의 발행 이후 기간(즉, 채권 연령) 정보를 포함하 고 있다. 만약 사전에 해당 채권의 향후 회수 가능성을 가늠할 수 있다면, 해당 정보를 활용하여 회사의 현금흐름 유동성 위험에 선제적으로 대응할 수 있을 것이다. 한편, 현금의 흐름은 거시경제적 요인, 고객의 지불 행위, 특정 공급 사슬망의 고유 특성 등 다양하고 복합적이 며 불확실성을 갖는 요인들에 의해 영향을 받을 수 있으며, 이러한 이유로 현금흐름은 일반적으로 추계적 과정 (Stochastic Process)으로 간주된다. 현금흐름 분석과 밀접한 연관을 갖고 있는 매출채권 연령 예측 분야에서 는 이와 같은 추계적 과정 이론들을 적극적으로 분석에 활용하고 있다. 매출채권 연령을 예측하기 위해 사용되 어 온 대표적인 알고리즘으로, Corcoran이 제안한 모델과 Pate-Cornel이 제안한 모델 두 가지를 꼽을 수 있다. Corcoran 모델은 채권 연령(Account Receivable 연령, 이하 AR 연령)에서 현금흐름을 예측하기 위해 지수 평활 접근법의 개념을 사용한다. 반면 Pate-Cornell은 추계적 과정(Stochastic Process)을 활용하여 단기 현금 유동 예측을 수행한다. 최근에는 지수 평활 접근법(즉, Corcoran 모델) 과 추계적 과정(즉, Pate-Cornell 모델)을 통합하여 현금흐름을 예측하는 시도(SFA 모델)가 있었다. SFA(Stochastic Financial Analytics)에서는 마코프 모델(Markov Model)을 이용하여 모든 고객들의 지불 행위를 표현하고, 여기에 베이즈 기법(Bayes’Rule)을 적용 하여 개별적인 송장 수준에서 고객의 각 지불 행위 패턴을 파악하는 방식으로 AR 연령을 예측하였다. 특히, 이 모델은 기존의 두 모델이 갖고 있는 장점만을 취합하여 통합한 모델로 기존의 모델과 비교하여 상대적으로 높은 수준의 정확도를 갖고 있다. 현금흐름을 예측한다는 것은 시계열 상에서 나타날 수 있는 앞으로의 현금유입값을 예측하는 것과 같다고 볼 수 있다. 미래의 현금 유입 값들이 과거에 연속적으로 있어왔던 현금유입 값들과 관계가 있다고 가정한다면, 기존 의 마코프 모델은 예측을 하는 시점의 바로 직전 시점의 상태(즉, First-Order 마코프 모델)에 의해서만 상태값, 즉 앞으로의 현금유입값을 예측하는 경우라 볼 수 있다. 실제로 마코프 성질(Markov Property)라 불리 우는 이 특성은 예측바로 이전의 값이 결국 기존의 History 정보를 함축적으로 대표할 수 있는 값이라는 가정을 전제로 두고 있다. 본 발명의 일 실시예에서는 상술한 바와 같이 기존의 마코프 모델 가정에서, 바로 이전의 상태 값만이 아닌 더 이전 차수의 정보까지 활용하는 고 차수(Hi gh-Order) 마코프 모델 개념을 활용하게 되면 기존의 방법론들보다 더 높은 예측 정확도를 가질 것이라는 가정에서 시작한다. 고 차수 마코프 모델을 사용한 다는 의미는 이전에 발생했던 정보뿐만이 아니라 각 과거 정보 간에 내재되어 있을 수 있는 특정 시퀀스 패턴을 추가로 활용한다는 의미를 내포하고 있다. 다만, 상태의 개수 및 차수가 증가함에 따라 소요되는 계산복잡도 (Computational Complexity)가 지수적으로 증가하기 때문에, 순수한 고 차수 마코프 모델이 실질적으로 활용되 기 어려운 측면이 존재한다. 이러한 문제를 해결하기 위해 상술한 바와 같이 가변 차수 마코프 모델(VOM)을 이 용할 수 있다. VOM은 고 차수 마코프 모델의 일종이나 다른 순수한 의미에서의 고 차수 마코프 모델과는 달리, 다음 상태를 예 측하는데 필요한 과거 상태의 개수가 일정하지 않으며 상태의 특성 및 기존정보의 흐름 패턴에 따라 각기 다른 차수를 가질 수 있다. 만약 예전 정보를 구체적으로 활용할 필요가 있을 경우에만 차수를 증가시키고 그렇지 않은 경우에는 차수를 감소시킬 수 있다면, 전체 소요되는 계산 복잡도를 줄일 수 있고 실질적인 활용성을 높이 는데 장점을 가져다 줄 것이다. VOM은 일반적으로 데이터 기반 학습을 통해 구성된다. VOM 모델은 탈출과 배 제 알고리즘을 사용하는 Prediction by Partial Match, 이진화 변수를 이용하는 Context Tree Weighting Method, 각 접미사(Suffix)들의 확률을 계산하는 Probabilistic Suffix Tree(이하, PST) 등이 있다. 이들 중 PST는 가변 차수 마코프 모델을 풀기 위해 가장 널리 알려진 알고리즘 중 하나로 문서에서 생략된 문장들을 예 측하거나, 생물학 분야의 DNA 서열 분석 등 주로 주어진 서열정보를 통해 앞으로 나타날 서열을 예측하는데 주 로 사용되어 왔으며, 기존의 은닉 마코프 모델(Hidden Markov Model) 보다 일반적으로 우수한 성능을 보여준다 고 알려져 있다. 특히, 적은 데이터만으로도 PST 모델 생성이 가능한 점이 장점이며, 이는 많은 양의 데이터를 필요로 하는 최근의 딥러닝 모델(예를 들면 RNN)과 대비되는 특징이라 할 수 있다. 본 발명의 일 실시예에서는 VOM 알고리즘 중 하나인 PST 알고리즘이 기존에 주로 적용되어 왔던 생물학 분야를 넘어 현금흐름을 예측하도록 적용할 수 있다. <현금흐름 예측을 위한 PST 모델> <상태 정의> 고객의 지불 행위는 현재 시점에서 채권의 연령 기간에 따라 분류할 수 있다. 일반적으로, 기업 회계 관점에서 는 30일(약 1개월) 기준으로 채권의 연령을 분류하므로, 30일 단위로 기준 상태를 구분하는 게 자연스러운 가정 이라 볼 수 있다. 만약 현재 시점에서 30일이 아직 지나지 않은 채권이 지불 완료 될 경우 s0 상태로간주한다. 그리고 만기 후 120일이 지난 채권(s5)은 모두 악성채무(Bad Debt)로 분류할 수 있다. 표 1 요소 설명 s0 기한 전 결제 s1 기한 후 1 내지 30일에 결제 s2 기한 후 31 내지 60일에 결제 s3 기한 후 61 내지 90일에 결제 s4 기한 후 91 내지 120일에 결제 s5 기한 후 121일에 결제 또는 미불 이 상태 정의의 목적은 현재 채권의 연령을 근거로 다음 시점에서 채권의 상태를 예측하여 이를 토대로 현금흐 름을 예측하고자 하는 것이다. 문제는 한 기업 입장에서 현재 유동중인 채권들은 복수개가 될 수 있으며, 심지 어 한 기업으로부터도 동시에 여러 개의 채권을 발행 중에 있을 수 있다. 즉, 현재 시점에서 분석해야 하는 채 권 연령값들은 다수로 이루어진 집합으로 구성될 수 있으며 이를 하나의 마코프 모델 상태값으로 표현하기 위해 서는 마코프 모델 상태 값이 상술한 표 1에서 정의한 단일상태값들이 복합적으로 표현되어야 한다. 이 경우 복 수개의 단일 상태값들은 중복을 허용하는 다중집합(Multi-Set) 개념을 활용하여 표현할 수 있다. 예를 들어, 현재 시점에서 채권 연령 현황 상태가 만기 전 지불 완료인 경우 2 건, 만기 후 1일 내지 30일 이내 1 건, 그리 고 만기 후 30 내지 60일 이내 1 건일 경우가 발생할 수 있으며, 이 경우 다중집합 개념을 활용한다면 {s0, s0, s1, s2}로 표현된다. 상태 순서의 경우, 다중집합 개념을 사용하여 t시점에 {s0, s0, s1, s2}, t+1시점에는 {s1, s2, s3}로 상태값들을 표현할 수 있다.<상태 간 전이 모델> 본 발명의 일 실시예에서 각 고객의 지불패턴은 이전의 지불패턴과 완전히 독립적이지 않고 어느 정도 서로 연 관성을 가지고 있다고 가정한다. 이 가정하에서는 미래의 현금 유입 패턴을 분석하기 위해서 과거에 나타났던 매출채권 연령 패턴 분석이 필요할 수 있다. 일반적인 마르코프 특성에 의하면 현재 상태는 직전의 상태에만 영향을 받는다. 그러나, 본 발명의 일 실시예에서 고려하는 문제는 현재 상태에 영향을 주는 과거 패턴들을 직 전의 상태 하나만 고려하는 게 아닌, 여러 개의 과거 기록과 그들 간의 패턴정보를 활용하기를 원한다. 현금흐 름 예측 관점에서 볼 때, 이는 다음과 같이 설명될 수 있다. 만약 고객이 그리 오래되지 않은 과거에 한 번이 라도 악성채무였던 적이 있었다면(즉, 지불 시점이 아주 늦은 적이 있거나 지불불이행이 있었다면), 비록 바로 직전에 채권 지불이 일찍 이루어졌다 하더라도, 그 고객은 상대적으로 [성실한] 다른 고객과 비교했을 때 [악성 채무] 상황에 다시 직면할 가능성이 더 높다고 볼 수 있다는 것이 본 발명의 핵심 가정이다. 문제는 정의한 상태가 MultiSet 속성을 지니고 있으며, 해당 상태에 속한 각각의 단일 요소 상태가 전 시점의 어떤 개별 요소 상태와 연결되어 있었는지 추적할 방법이 없다는 것이다. 이러한 문제로 인해, 다중집합의 상 태 값 간의 전이(Transition) 형태를 파악하는 게 어려워진다. 따라서, 각 다중집합 요소들 사이에 있을 수 있 는 모든 경우의 수(즉, Cartesian Product)를 고려하고 각 경우의 수는 동일한 가중치로 발생할 수 있다고 가정 하는 게 자연스럽다. 이는 불확실성이 있는 경우에 각각의 대안을 동일한 가중치를 주어 평가하는 라플라스 기 법과 원리가 유사하다. 하지만 Cartesian Product 연산 특성으로 인해 고려하고자 하는 기간(즉, PST의 최대 확장 가능 차수)이 길어질수록 전체 집합 크기가 기하급수적으로 증가한다. 이를 방지하기 위해 본 발명의 일 실시예에서는 PST의 최대 차수를 합리적인 수준에서 제한하는 방식을 이용할 수 있다. <PST 모델> 데이터가 주어졌을 때 PST 모델은 해당 데이터로부터 학습을 통해 구축된다. 학습 절차는 다음과 같다. 우선 학습에 필요한 파라미터를 세팅한다. 파라미터는 첫째, Pmin은 데이터에서 해당 문자열을 PST에 포함시키기 위 한 최소 확률을 일컫는다. 다음으로 h는 해당 문자 하나를 PST 노드에 추가시키기 위해 사용되는 임계값이다. L은 PST 노드 중 가장 긴 문자열의 길이를 뜻한다. 마지막으로 d는 노드로 성립될 수 있는 최소 확률 값을 나 타낸다. 학습 알고리즘은 다음과 같이 주어진다. 먼저 PST 초기화 및 위에서 주어진 주요 파라미터들을 적절 히 세팅한다. 다음으로 MultiSet M을 정의하고 여기에 데이터에서 나타나는 상태들의 Cartesian Product 연산 결과를 저장한다. 이때, M에 포함된 중복 값을 모두 소거하고 유일한 값으로만 이루어진 집합을 S로 정의한다. 이후 S에 있는 모든 요소가 제거될 때까지 다음 알고리즘을 반복한다. 제 1 단계는, 집합 S에서 요소 s(즉, 샘 플 문자열)를 추출한다. 제 2 단계에서, k는 문자열 s에서 가장 첫 번째 문자를 제외한 문자열로 정의한다. 제 3 단계에서 만약 다음 세 가지 조건을 모두 만족하면, 현재 PST에 해당 s를 s가 속할 수 있는 가장 긴 문자열 노드에 연결되는 새로운 노드로 추가한다. 제 1 조건은 P(w|s)≥d, 제 2 조건은 P(w|s)/P(w|k) 값이 h보다 크거나 1/h보다 작은 경우, 제 3 조건은, 후보노드 ws의 길이가 L보다 작은 경우이다. 추가로 위 알고리즘에서 원활한 학습이 일어날 수 있도록 매 반복시마다 이뤄지는 확률 계산에서 평활지수(Smoothing Factor)를 반영하 여 노드가 갑자기 늘어나는 현상을 방지할 수도 있다. 물론 상술한 방법 외에도 다양한 방법으로 외상매출금의 한도를 산정하거나 업데이트할 수 있음은 자명하다 할 것이다. 공유부는, 거래처 단말에서 외상매출금의 청구에 기하여 파산 또는 회생을 신청하고, 파산 또는 회생 을 신청한 횟수가 기 설정된 횟수를 초과하는 경우 거래회피리스트에 포함시켜 공유할 수 있다. 최근 파산 또 는 회생 절차를 악용하여 상품이나 용역은 공급받아 매출을 올리면서도 대금결제의 요청을 받는 경우 악의적으 로 파산 또는 회생 절차를 진행하여 외상매출금을 지급하지 않는 경우가 빈번하게 발생하고 있다. 이에 따라, 청구에 기하여 파산 또는 회생을 신청하는 기록이 기 설정된 횟수 또는 빈도로 존재하는 경우, 이 리스트를 공 유함으로써 피해를 막을 수 있다. 이하, 상술한 도 2의 산정 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설명 하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하다 할 것이다. 도 3을 참조하면, (a) 공급사 단말은 거래처 단말에서 외상거래로 상품 또는 용역의 제공을 요청하는 경우, 산정 서비스 제공 서버로 외상매출금 한도의 산정을 요청한다. 이때, 산정 서비스 제공 서버 는 (b)와 같이 신용평가 데이터, 거래내역 데이터 및 내규 데이터에 기반하여 외상매출금의 한도를 산정한 후 공급사 단말로 전송하고, (c)와 같이 각종 한도 증감요인에 따라 실시간 또는 주기적으로 외상매출금의 한 도를 증감시킬 수 있다. 그리고, 산정 서비스 제공 서버는, (d) 고의적으로 파상 또는 회생을 신청하는 거래처가 존재하는 경우 이 리스트를 공유하도록 할 수 있다. 이렇게 외상거래가 이루어졌다면 또는 이루어지 기 전에 도 4와 같이 외상매출금을 관리할 수 있는데, 담보에 따라 약정과 약정이율은 어떻게 할 것인지, 외상 매출금 한도는 신용평가, 과거이력 및 한도산정에 따라 어떻게 관리할 것인지, 또 외상매출이 발생했다면 매출 채권은 어떻게 회수하고 원장은 어떻게 관리하며 현황관리는 어떻게 할 것인지 등을 설정하고 관리할 수 있다. 외상매출금 한도는 도 4와 같이 이율내역, 담보내역, 신용평가내역, 채권원장 등에 따라 산출될 수 있고 이렇게 산출된 약정에 따라 외상매출약정을 맺을 수 있다. 이와 같은 도 2 내지 도 4의 외상매출금 한도 산정 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1을 통해 외상매출금 한도 산정 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용 이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 외상매출금 한도 산정 서비스 제공 시스템에 포함된 각 구성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터가 송수신되 는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설명한 다양한"}
{"patent_id": "10-2023-0139211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 산정 서비스 제공 서버는, 공급사 단말로부터 외상거래에 대한 외상매출금 한도의 산정을 요 청받는다(S5100). 그리고, 산정 서비스 제공 서버는, 거래처 단말의 거래처에 대한 신용정보조회를 수행한 후 신용평가 데이터를 수집하고(S5200), 공급사 단말 및 거래처 단말 간 거래내역이 존재하는 경우 거래내역 데이터를 추출한다 (S5300). 또, 산정 서비스 제공 서버는, 공급사 단말의 공급사의 외상거래 내규 데이터를 수집하고(S5400), 신용평가 데 이터, 거래내역 데이터 및 내규 데이터에 기반하여 외상매출금 한도를 산정한다(S5500). 상술한 단계들(S5100~S5500)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5500)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 외상매출금 한도 산정 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4를 통해 외상매출금 한도 산정 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용 이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 외상매출금 한도 산정 서비스 제공 방법은, 컴퓨터에 의해 실행되는 애플 리케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데 이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매 체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 외상매출금 한도 산정 서비스 제공 방법은, 단말기에 기본적으로 설치된 애 플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 외상매출금 한도 산정 서비스 제공 방법은 단말기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기 에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2023-0139211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2023-0139211", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 외상매출금 한도 산정 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 도 1의 시스템에 포함된 산정 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 외상매출금 한도 산정 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 외상매출금 한도 산정 서비스 제공 방법을 설명하기 위한 동작 흐름도이다."}
