{"patent_id": "10-2018-0098694", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0022718", "출원번호": "10-2018-0098694", "발명의 명칭": "배전반의 2-채널 회로 차단 시스템", "출원인": "(주)서전기전", "발명자": "홍춘근"}}
{"patent_id": "10-2018-0098694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "부하에 연결된 선로의 과전류를 센싱하여 외부사고를 감지하는 CT센서와, 배전반 내부의 아크 발생을 센싱하여내부사고를 감지하는 아크센서를 포함하는 센서부;CT센서의 외부사고 감지시 동작신호를 출력하는 사고전류 계전기와, 아크센서의 내부사고 감지시 동작신호를 출력하는 아크 계전기를 포함하는 회로차단 제어부; 및상기 아크 계전기의 동작신호로 차단 구동되는 오픈동작회로와, 상기 사고전류 계전기의 동작신호를 소정의 시간만큼 지연하여 차단 구동시간을 늦추는 동작지연회로의 2-채널로 구성된 회로차단기를 포함하여,내부사고에 따른 회로 차단 시간보다 외부사고에 따른 회로 차단 시간이 지연된 것을 특징으로 하는 배전반의2-채널 회로 차단 시스템."}
{"patent_id": "10-2018-0098694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 아크센서는,중파장의 적외선 영상으로 배전반의 아크 방전을 감지하고, 측정한 적외선 영상의 휘도 값을 설정된 제1 기준값과 비교하고, 상기 제1 기준값을 초과한 휘도 값을 카운트하여 설정된 제2 기준값을 비교하여 배전반의 아크 발생 여부를 판단하는 것을 특징으로 하는 배전반의 2-채널 회로 차단 시스템."}
{"patent_id": "10-2018-0098694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 아크센서는,적외선 영상 센서이고 영상 촬영 속도가 1000 프레임 이상 2000 프레임 이하로 설정되어, 아크 발생 판단의 속도가 0 초과 [상기 제1 기준값을 초과한 휘도 값의 카운트]/1000 sec 미만인 것을 특징으로하는 배전반의 2-채널 회로 차단 시스템."}
{"patent_id": "10-2018-0098694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 회로차단 제어부는,상기 아크 계전기가 동작시 상기 사고전류 계전기를 인터로크(interlock)하는 것을 특징으로 하는 배전반의 2-채널 회로 차단 시스템."}
{"patent_id": "10-2018-0098694", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 회로차단기는,공개특허 10-2020-0022718-3-상기 동작지연회로가 상기 사고전류 계전기의 동작신호를 사고전류의 3~5 사이클 범위로 지연하고, 상기 오픈동작회로는 상기 아크 계전기의 동작시 사고전류의 1 사이클 이내에서 차단 구동되어, 상기 오픈동작회로 또는 상기 동작지연회로의 2-채널 제어로 사고전류의 차단 구동 영역이 상이한 것을 특징으로 하는 배전반의 2-채널 회로 차단 시스템."}
{"patent_id": "10-2018-0098694", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 배전반의 2-채널 회로 차단 시스템에 있어서, 부하에 연결된 선로의 과전류를 센싱하여 외부사고를 감지하는 CT센서와, 배전반 내부의 아크 발생을 센싱하여 내부사고를 감지하는 아크센서를 포함하는 센서부; CT 센서의 외부사고 감지시 동작신호를 출력하는 사고전류 계전기와, 아크센서의 내부사고 감지시 동작신호를 출력 하는 아크 계전기를 포함하는 회로차단 제어부; 및 상기 아크 계전기의 동작신호로 차단 구동되는 오픈동작회로 와, 상기 사고전류 계전기의 동작신호를 소정의 시간만큼 지연하여 차단 구동시간을 늦추는 동작지연회로의 2-채 널로 구성된 회로차단기를 포함하여, 내부사고에 따른 회로 차단 시간보다 외부사고에 따른 회로 차단 시간이 지 연된 것을 특징으로 한다."}
{"patent_id": "10-2018-0098694", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 배전반의 2-채널 회로 차단 시스템에 관한 것으로서, 사고전류의 종류에 따라 선택적 차단 기능이 수 행될 수 있는 배전반의 2-채널 회로 차단 시스템에 관한 것이다."}
{"patent_id": "10-2018-0098694", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "배전반은 발전소나 변전소 등의 운전이나 제어, 전동기의 운전 등을 위해 스위치, 계기, 릴레이(계전기) 등이 일정하게 넣어 관리하는 장치로서, 각각의 분전반들로 전원을 분배한다. 분전반은 간선을 통해 배전반으로부터 전력을 공급 받아 말단 부하, 전기사용설비 등으로 전력을 공급한다. 일반적으로, 배전반은 한전측으로부터 22.9KV의 특고압을 수전받아 변전실에서 3.3KV 또는 6.6KV의 고압으로 강압하여 전원을 공급받으며, 변압기에서 3상 4선으로 강압하여 부하에 690V, 440V, 380V 또는 220V의 전원을 공급한다. 배전반은 발전소, 변전소, 개폐소 또는 이에 준하는 곳에 고압용 또는 특별고압용 전기의 수전이나 배전을 위하 여 설치된다. 일 예시로, 배전반은 병원 등 주요 시설에 정전을 대비하여 변전실에서 서로 다른 변전소에서 각 각 수전 받아 서로 다른 선로를 통해 전원을 공급받으며, 배전반은 고장 등에 대비하여 2개의 변압기를 통해 수 전 받아 전압을 강압하여 전원을 공급하는 2회로 수전 방식으로 운영되기도 하며, 비상발전기를 추가로 설치하 여 운영하는 시공예가 다수 있어 왔다. 배전반이 다수 설치되는 병원, 발전소, 변전소 그 밖의 전력을 사용하는 공장과 같은 설비는 비상시조차 전력이 안정적으로 공급될 수 있는 것이 무엇보다 중요하다. 특히, 전력을 분배하는 배전반에서는 열화에 따른 누전, 방전, 화재, 결로 등 자연적인 요소로 발생되는 수많은 사고의 위험성이 존재한다. 배전반으로부터 발생되는 전 기안전 사고는 단순히 배전반 기기 자체의 고장 뿐만 아니라, 현장의 수많은 전기전자 장치들의 오작동과, 화재 에 따른 공장의 소실 등 천문학적인 피해를 야기시킬 수 있다. 따라서, 배전반은 전력 계통의 전기 고장 발생시 그 고장 구간을 전기 계통에서 신속하게 분리해야 하는데, 이를 위하여 전기적 고장이 발생한 선로를 검출하고, 전기적 고장이 발생한 선로를 신속하게 차단하는 것이 필수적이다. 과전류, 과부하, 단락 등으로 사고가 발생되기 전 부하로 유입되는 전류를 차단하기 위해 차단기가 건물내의 배 전반, 분전반 등에 설비된다. 이러한 차단기의 가장 큰 능력은 안전하게 고속으로 전기를 차단할 수 있는 점에 있다. 현재, 국내외 차단기의 차단시간은 평균 10ms±2ms정도이며, 최근에든 사고전류의 1-사이클(cycle)내의 차단이 가능한 초고속 차단기가 개발되고 있다. 이를 계통에 적용시 빠른 차단으로 계통의 부담을 줄일 수 있다. 하지만, 이러한 빠른 차단시간(1-cycle clearing)은 사고전류가 비대칭일 경우 DC분의 상승으로 실제 차단기가 차단하는 정격 차단전류보다 상위의 사고전류를 차단할 수 밖에 없도록 한다. 따라서, 종래의 초고속 차단 시스 템은 차단기 접점의 전기적 내구성을 떨어뜨리는 부작용을 발생시킨다. 한편, 차단기가 배전반 및 계통에 적용된 상태에서 배전반의 기기 내부에 아크 발생 등으로 사고가 일어난 경우 에는 급격한 열과 압력을 유발시키기 전 최대한 빠른 사고전류의 차단이 요구된다. 헤아려보면, 배전반 내부의 아크 사고시에는 종래의 초고속 차단 동작이 바람직하고, 배전반 외부의 부하 선로 등의 과전류시에는 오히려 초고속 차단이 차단기의 내구성을 악화시키므로 어느 정도 지연된 차단 동작이 바람직한 것이다. 종래기술로서, 한국공개특허 제10-2010-0138004호(이하, 선행특허 1이라 약칭한다)는 순시전류 발생시에 차단기 의 차단시간을 개선한 회로차단기를 개시한다. 한국공개특허 제10-2004-0067473호(이하, 선행특허 2라 약칭한다)는 한시 지연형 자동 트립 회로를 개시한다. 선행특허 1은 부하전원의 차단시 차단 속도를 개선한 초 고속 차단기에 관한 발명으로 볼 수 있다. 선행특허 2는 순간적인 정전이나 순간적인 전압강하와 같이 순간적으 로 일어나는 이상 전압에 대해서 트립 동작이 일어나지 않도록 제어하여 트립 동작의 신뢰성을 향상시키고자 한시 지연형 자동 트립 회로를 제안한다. 선행특허 2는 차단기에 지연형 트립 회로를 적용하는 목적이 순간적으로 일어나는 전압에 대하여 차단 동작이 일어나지 않도록 하기 위한 것으로, 오히려 순간적인 아크 발생이나 순간적인 과전류가 트립 동작의 오동작으로 판단되지 않아야 하는 배전반 시스템에 적용하기에는 무리가 있다. 정리하면, 사고전류에 대한 차단기능과 기기내부에서 아크 상태시 기기를 보호하기 위한 선택적 차단 기능이 필 요하며, 이를 위하여 배전반에 발생하는 사고의 종류 별로 차단 동작을 선택적으로 수행할 수 있는 배전반의 차 단 시스템이 요구되는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2010-0138004호 (특허문헌 0002) 공개특허공보 제10-2004-0067473호"}
{"patent_id": "10-2018-0098694", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명은 기기내부의 아크발생과 같이 급격한 열과 압력을 유발시키는 배전반의 내부사고시에는 초고속 차단을 수행하고, 배전반 외부의 부하 선로에서 발생되는 외부사고시에는 상대적으로 지연된 차단을 수행하여 전력계통의 안전과 차단기의 내구성을 보존할 수 있는 배전반의 2-채널 회로 차단 시스템을 제공하고자 한다."}
{"patent_id": "10-2018-0098694", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여 본 발명은, 배전반의 2-채널 회로 차단 시스템에 있어서, 부하에 연결된 선로의 과전류를 센싱하여 외부사고를 감지하는 CT센서와, 배전반 내부의 아크 발생을 센싱하여 내부사고를 감지하는 아크센서를 포함하는 센서부; CT센서의 외부사고 감지시 동작신호를 출력하는 사고전류 계전기와, 아크센서의 내부사고 감지시 동작신호를 출력하는 아크 계전기를 포함하는 회로차단 제어부; 및 상기 아크 계전기의 동작신 호로 차단 구동되는 오픈동작회로와, 상기 사고전류 계전기의 동작신호를 소정의 시간만큼 지연하여 차단 구동 시간을 늦추는 동작지연회로의 2-채널로 구성된 회로차단기를 포함하여, 내부사고에 따른 회로 차단 시간보다 외부사고에 따른 회로 차단 시간이 지연된 것을 특징으로 한다. 바람직하게, 상기 아크센서는 중파장의 적외선 영상으로 배전반의 아크 방전을 감지하고, 측정한 적외선 영상의 휘도 값을 설정된 제1 기준값과 비교하고, 상기 제1 기준값을 초과한 휘도 값을 카운트하여 설정된 제2 기준값 을 비교하여 배전반의 아크 발생 여부를 판단한다. 바람직하게, 상기 아크센서는 적외선 영상 센서이고 영상 촬영 속도가 1000 프레임 이상 2000 프레임 이하로 설 정되어, 아크 발생 판단의 속도가 0 초과 [상기 제1 기준값을 초과한 휘도 값의 카운트]/1000 sec 미만일 수 있 다. 바람직하게, 상기 회로차단 제어부는 상기 아크 계전기가 동작시 상기 사고전류 계전기를 인터로크(interlock) 한다. 바람직하게, 상기 회로차단기는 상기 동작지연회로가 상기 사고전류 계전기의 동작신호를 사고전류의 3~5 사이 클 범위로 지연하고, 상기 오픈동작회로는 상기 아크 계전기의 동작시 사고전류의 1 사이클 이내에서 차단 구동 되어, 상기 오픈동작회로 또는 상기 동작지연회로의 2-채널 제어로 사고전류의 차단 구동 영역이 상이하게 한다."}
{"patent_id": "10-2018-0098694", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 내부사고와 외부사고를 감지하는 센서의 구성과 감지된 사고의 종류별로 회로차단 제어부에 서 각 사고에 해당하는 계전기가 동작된다. 회로차단기는 각 사고루트에 따라 차동 차단 시간을 갖는 2-채널로 구성되어 내부사고시에는 신속한 차단을 수행하고, 외부사고시에는 지연된 차단을 수행하여 계통의 안전성과 차 단기의 내구성에 우수한 배전반 시스템이 제공될 수 있다."}
{"patent_id": "10-2018-0098694", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들에 기재된 내용들을 참조하여 본 발명을 상세히 설명한다. 다만, 본 발명이 예시적 실시 예 들에 의해 제한되거나 한정되는 것은 아니다. 각 도면에 제시된 동일 참조부호는 실질적으로 동일한 기능을 수 행하는 부재를 나타낸다. 본 발명의 목적 및 효과는 하기의 설명에 의해서 자연스럽게 이해되거나 보다 분명해 질 수 있으며, 하기의 기 재만으로 본 발명의 목적 및 효과가 제한되는 것은 아니다. 또한, 본 발명을 설명함에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이, 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 도 1은 본 발명의 실시예에 따른 배전반의 2-채널 회로 차단 시스템의 구성도를 나타낸다. 도 1을 참조하면, 배전반의 2-채널 회로 차단 시스템은 센서부, 스마트 제어부, 관리 제어부, 회로차단 제어부 , 및 회로차단기를 포함할 수 있다. 센서부는 CT센서와 아크센서를 포함할 수 있다. 센서부는 부하에 연결된 선로의 과전류를 센싱하여 외부사고를 감지하고, 배전반 내부의 아크 발생을 센싱하여 내부사고를 감지할 수 있다. 센서부의 외부사고 감지는 CT센서를 통해 수행될 수 있고, 센서부의 내부사고 감지는 아크센서를 통해 수행될 수 있다. CT센서는 CURRENT TRANSFORMER로서, 과전류를 감지한다. CT센서는 부하 선로의 과전류를 감지할 수 있다. CT센서의 측정값은 사고전류 계전기가 수신할 수 있다. 아크센서는 배전반 내부의 격납기기의 아크 발생을 감지한다. 아크센서는 격납기기의 단선부나 케 이블 연결부 등 전기적 접점 영역을 감시하여 배전반 내부에서 발생되는 아크를 사전에 감지할 수 있다. 도 2는 아크센서와 연계되는 배전반의 2-채널 회로 차단 시스템을 도시한 것이다. 본 실시예에서는, 아크 센서로 복수개의 센서를 사용하지 않고, 적외선 영상 센서를 아크센서로 이용하여 배전반의 아크 발생을 사전 감지한다. 도 2를 참조하면, 아크를 감지하는 구성은 아크센서, 보정 전압 발생기, 스마트 제어부 및 관 리 제어부가 될 수 있다. 아크 센서는 중파장의 적외선 영상으로 배전반의 아크 방전을 감지할 수 있 다. 아크 센서는 적외선 영상 센서이고 영상 촬영 속도가 1000 프레임 이상 2000 프레임 이하로 설정되어, 스마트 제어부의 아크 발생 판단의 속도가 0 초과 [제1 기준값을 초과한 휘도 값의 카운트]/1000 sec 미만일 수 있다. 이하, 아크 센서는 적외선 영상 센서로 구현된 실시예로서, 아크 센서와 적외선 영 상 센서의 도면 번호는 1033으로 총칭될 수 있다. 본 실시예에서, 아크 센서로서 적외선 센서가 아닌 적외선 영상 센서가 사용되는 것에 주목한다. 적외선 센서는 센서가 부착된 위치에서의 적외선 감지 기능을 갖는다. 헤아려보면, 배전반은 상당한 내부 공간을 갖고, 내부에 전력을 분배하는 기계기구가 다수 격납된다. 따라서, 적외선 센서로 아크 발생을 감지하고자 할 경우,아크 발생을 감지해야하는 다수의 기계기구 모두에 센서를 배치해야 한다. 다수의 적외선 센서를 설치해야 하는 모니터링 시스템은 높은 비용과 데이터 처리에 상당한 부담을 야기할 수 있다. 따라서, 본 실시예에서는 영상 (image) 센싱 방식으로 아크를 감지한다. 한편, 일반 비주얼 카메라는 1/30초, 또는 1/60초의 감지 속도를 갖는 것이 일반적이다. 이러한 일반 비주얼 카 메라는 순간적으로 발생하는 아크 발생을 프레임으로 획득하지 못하는 문제가 있다. 따라서, 본 실시예에서는 영상 센싱을 위해 중파장의 적외선 영상 센서를 사용하며 프레임 속도를 1000 프레임 이상 2000 프레임 이하로 설정한다. 본 실시예에 따른 적외선 영상 센서가 상기의 프레임 속도 범위로 설정될 경우, 아크의 순간 발생을 프레임으로 획득할 수 있다. 적외선 영상 센서가 1000프레임의 속도로 아크 발생을 감지한 경우, 경보를 발생하는 시간은 (카운트 수)/1000 [초] 이내가 될 수 있다. 카운트 과정은 후술하게 될 스마트 제어부의 휘도 분석에서 설명하며, 본 실시예에서 바람직하게 약 0.001초 정도의 짧은 반응 시간으로 아크 를 감지할 수 있게 된다. 적외선 영상 센서는 80x80 픽셀의 해상도로 배전반의 내부에 마련된다. 보다 상세하게, 적외선 영상 센서 는 배전반의 후면 중앙에 배치되어 배전반 내부 격납기계들을 모니터링 할 수 있다. 한편, 본 실시예에 따라 아크 센서를 적외선 영상 센서로 구현할 경우, 모니터링시 획득되는 정보는 아크 크기 및 영상 데이터가 될 수 있다. 이 때, 영상 데이터로부터 색온도의 인식이 가능하다. 즉, 영상 데이터로부 터 색온도를 획득할 수 있음에 따라 아크 발생 외에 아크 발생 부위의 열화 상태를 함께 감지할 수 있게 된다. 일반적인 열화 센서는 부착된 주위의 열을 감지하는 반면, 본 실시예에 따른 적외선 영상 센서는 영상의 색온도로부터 열화를 감지함에 따라 온도의 변위 부위를 영상으로부터 정확하게 확인할 수 있는 장점이 있다. 보정 전압 발생기는 적외선 영상 센서로 음 전압을 인가할 수 있다. 보정 전압 발생기는 적 외선 영상 센서의 픽셀 노이즈 값을 저감하여 노이즈 레벨을 0으로 오프셋 시킬 수 있다. 음 전압의 초기값은 메인 프로세서에서 입력될 수 있으며, 초기값은 관리 제어부의 빅 데이터 분석에 따라 보정될 수 있다. 보정 전압 발생기는 전체적인 신호의 레벨을 저감시키는 것으로 기본 노이즈 레벨을 오프셋 시키고, 후술하게 될 FPGA에서는 영상의 픽셀 값을 오프셋 시킴으로써 노이즈와 픽셀 각각을 초기값으로 세팅한다. 스마트 제어부는 아크 센서에서 측정한 적외선 영상의 휘도 값을 설정된 제1 기준값과 비교하고, 제1 기준값을 초과한 휘도 값을 카운트하여 설정된 제2 기준값을 비교하여 배전반의 아크 발생 여부를 판단할 수 있 다. 제1 기준값은 아크 센서가 측정한 적외선 영상에서 휘도값이 일정치 이상 초과한 픽셀을 검출하기 위 한 것이다. 제2 기준값은 휘도값이 일정치 이상 초과한 픽셀의 개수를 체크하기 위한 것이다. 제1 기준값과 제2 기준값은 사용자로부터 입력받을 수 있다. 본 실시예에 따른 관리 제어부는 스마트 제어부의 모니터링 정보로서 휘도 값, 노이즈 레벨을 저감시키 는 초기 음 전압 값, 제1 기준값 및 제2 기준값을 지속적으로 모니터링 데이터로 축적한다. 축적된 빅 데이터는 배전반의 운전정보를 고려하여, 배전반이 운전중일 때의 온도 변화에 따른 적외선 픽셀의 휘도로 오차 범위를 파악하여 기준값을 보정하는데 이용될 수 있다. 스마트 제어부는 FPGA, 비교기, 카운터, 메모리, 메인 프로세서, 기준값 레지스 터 및 신호 생성기를 포함할 수 있다. FPGA는 아크 센서가 촬영한 적외선 영상의 픽셀 값을 프레임 단위로 배열하여 픽셀 단위로 휘도 값 을 출력할 수 있다. FPGA는 적외선 영상 센서로부터 각 픽셀 값을 읽어내고 다시 초기치를 설정한다. FPGA는 읽어 낸 픽셀 값을 프레임 단위로 재 배열하고 픽셀 단위로 휘도 값을 출력한다. 출력된 정보는 메모리에 저장될 수 있다. 메모리는 적외선 영상 센서로부터 읽혀진 데이터를 임시 저 장할 수 있다. 본 실시예에 따른 메모리는 임시 저장 뿐만 아니라 적외선 영상 센서가 촬영한 영상 자료를 저장하는 데이터베이스를 포함할 수 있다. 영상자료저장장치로서, 실시간 영상 정보를 소정의 기간 동안 저장하는 메모리는 스마트 제어부 또는 관리 제어부 내에 구비될 수 있다. FPGA는 아크 센서가 차단된 상태의 영상 픽셀 값을 수신하여 상기 스마트 제어부로 전송하고, 이 때 스마트 제어부는 아크 센서가 차단된 상태의 영상 픽셀 값을 0 으로 만들기 위한 오차 값 테이블을 메모리에 저장하고 각 픽셀에 오차 값을 입력하여 기준 상태를 0으로 오프셋 할 수 있다. 오프셋 조정 과 정에서 적외선 영상 센서는 fish eye 렌즈 앞 부분의 셔터를 닫아 무 신호 입력 상태로 제어된다. 적외선 영상 센서의 무 신호 입력 상태에서의 각 픽셀 값을 FPGA가 수신한다. 메모리는 적외선 영상 센서의 무 신호 입력 상태에서 FPGA가 수신한 픽셀 값을 저장할 수 있다. 메모리에는 차단된 상태의 영상 픽셀 값과, 각 픽셀 값을 0으로 만들기 위한 오차 값 테이블이 저장 될 수 있다. 메모리에 저장된 오차 값 테이블을 참조하여 FPGA는 오차값을 입력하여 초기 상태의 픽 셀 기준 상태를 0 레벨로 오프셋 한다. 비교기는 Magnitude comparator로서, FPGA에서 출력된 휘도 값을 상기 제1 기준값과 비교할 수 있다. 메인 프로세서는 스마트 제어부의 각 블록을 전체적으로 제어하는 중앙 제어 장치로 이해될 수 있다. 메인 프로세서에는 제1 기준값, 제2 기준값이 설정될 수 있다. 제1 기준값과 제2 기준값은 기준값 레지스터에 등록되며, 등록 데이터 정보는 관리 제어부를 통해 빅 데이터로 축적 및 보정될 수 있다. 비교기는 메인 프로세서에서 설정된 제1 기준값과 FPGA가 출력한 휘도 값의 크고 작음을 비교한 다. 또한, 비교기는 제1 기준값을 초과한 카운트 수와 제2 기준값을 비교할 수 있다. 카운터는 비교기에서 제1 기준값을 초과하는 휘도 값을 카운팅할 수 있다. 신호 생성기는 비교 기에서 제1 기준값을 초과하는 카운트 수가 제2 기준값 이상일 때 아크 발생 위험 신호를 생성하여 관리 제어부로 전달한다. 본 실시예에 따른 스마트 제어부는 적외선 영상 센서의 영상을 저장하고 아크 감지의 프로세스를 수 행하는 기능을 표현하기 위한 구성으로 정의된 것으로, 스마트 제어부가 마련되는 위치가 한정되는 것은 아 니다. 스마트 제어부의 FPGA, 비교기, 카운터, 메모리, 메인 프로세서, 기준값 레지스터 또는 신호 생성기는 적외선 영상 센서 상에 모듈화 되어 배치되거나, 적외선 영상 센 서와 구분되어 서버 상에 마련될 수도 있다. 관리 제어부는 메인관리센터(SCADA), 지능형 전자 디바이스(IED), 또는 관리자의 스마트폰 중 적어도 어느 하나와 통신하여 스마트 제어부의 아크 발생 정보를 전달할 수 있다. 스마트 제어부는 적외선 영상의 데이터만으로 열 발생이 없는 아크의 발생을 감지할 수 있다. 관리 제어부는 스마트 제어부의 휘도 값과 배전반의 운전 정보를 빅 데이터로 취합하며, 인공지능 기반 기계학습 알고리즘이 내장되어 빅 데이터의 정보 분류, 분석 및 처리를 수행하여 상기 제1 기준값과 상기 제2 기준값을 보정할 수 있다. 도 3은 아크센서 및 배전반의 2-채널 회로 차단 시스템의 아크 감지 프로세스를 도시한 것이다. 도 3을 참조하면, 아크 센서가 감지한 신호의 스마트 제어부 처리 프로세스는 오프셋을 설정하는 단계(S10), 제1 기준값 비교 단계(S30), 카운트 단계(S40), 제2 기준값 비교 단계(S50), 및 경보 신호 생성 단계(S60)를 포 함할 수 있다. 오프셋을 설정하는 단계(S10)는 보정 전압 발생기로부터 음 전압을 인가 받아 노이즈 레벨을 저감시키는 단계(S101), 픽셀의 초기값을 보정하는 단계(S103) 및 FPGA가 오프셋 된 픽셀 값을 로드하는 단계(S105)를 포함할 수 있다. 오프셋을 설정하는 단계(S10)는 FPGA에서 수행될 수 있으며, 관련 내용은 전술한 바 원용 은 생략한다. 제1 기준값 비교 단계(S30)는 픽셀의 휘도 값과 제1 기준값(threshold)의 크고 작음을 비교하는 단계로서 전술 한 비교기에서 수행된다. 카운트 단계(S40)는 제1 기준값 비교 단계(S30)에서 픽셀의 휘도 값이 제1 기준값(threshold)을 초과하는 경우, 카운트 값을 +1 한다. 카운트 단계(S40)는 전술한 카운터에서 수행된다. 제2 기준값 비교 단계(S50)는 카운트 단계(S40)에서 카운팅 된 카운트 값이 제2 기준값(reference value)을 초 과하는지 비교하는 단계이다. 제2 기준값 비교 단계(S50)는 전술한 비교기에서 수행될 수 있다. 경보 신호 생성 단계(S60)는 제2 기준값 비교 단계(S50)에서 카운팅된 카운트 값이 제2 기준값(reference value)을 초과할 경우 경보 출력신호를 생성하는 단계이다. 경보 신호 생성 단계(S60)는 전술한 신호 생성기 에서 수행될 수 있다. 본 발명의 또 다른 실시예로, 아크 센서는 아크의 감지 기능 뿐만 아니라 시각적 모니터링 영상이 겸용된 영상 센서로 제공될 수 있다. 보다 상세하게, 본 실시예에서, 아크 센서는 배전반의 내부 격납 기계들의 실시간 영상 모니터링을 위해 어안 렌즈가 사용된 영상 센서로 제공될 수 있다. 도 4는 사고 전류의 사이클과 회로차단기의 차단 구동 영역을 도시한 것이다. 도 4를 참조하면, 배전반 내 부의 아크 발생 사고시 DC성분이 급격히 증가된 후, 시간이 지남에 따라 정상상태로 돌아가는 모습을 볼 수 있 다. 여기서, 본 실시예에 따른 배전반의 2-채널 회로 차단 시스템은 사고전류의 사이클(cycle) 기준으로 회로차 단기의 구동영역이 구분된다. P1구간은 센서부로부터 내부사고로 판단된 경우, 회로차단기가 동작 되어야 하는 차단 영역이 될 수 있다. P2구간은 센서부로부터 외부사고로 판단된 경우, 회로차단기가 동작되어야 하는 차단 영역이 될 수 있다. 내부사고와 외부사고의 사고 종류의 판단에 따른 회로차단기 동 작은 회로차단 제어부를 통해 수행될 수 있다. 회로차단 제어부는 사고전류 계전기와 아크 계전기를 포함할 수 있다. 사고전류 계전기는 CT센서의 외부사고 감지시 동작신호를 출력한다. 아크 계전기는 아크센서의 내부사고 감지시 동작신호를 출력한다. 도 1 내지 3의 실시예에서, 센서부는 사고전류를 감지하되 내부사고와 외부사고로 구 분하여 감지함을 전술하였다. 특히 내부사고의 경우 아크 발생이 신속한 차단동작이 필요한 경우라 하겠다. 이 에, 본 실시예에 따른 배전반의 2-채널 회로 차단 시스템은 내부사고의 경우 회로차단기를 동작하기 위한 아크 계전기 채널과, 외부사고의 경우 회로차단기를 동작하기 위한 사고전류 계전기의 채널로 구 성된다. 또한, 회로차단기도 회로차단 제어부의 2-채널에 연계되어 내부사고시 차단 구동되는 오픈동작회로 와 외부사고시 차단시간을 지연하는 동작지연회로의 2-채널로 구성될 수 있다. 오픈동작회로는 아크 계전기의 동작신호로 차단 구동된다. 동작지연회로는 사고전류 계전기의 동작신호를 소정의 시간만큼 지연하여 오픈동작회로의 차단 구동시간을 늦춘다. 이 경우, 회로차단 제어부 는 아크 계전기가 동작시 사고전류 계전기를 인터로크(interlock)할 수 있다. 이에 따라, 내부 아크 발생시 동작지연회로를 거치지 않고, 바로 회로차단기가 구동되는 채널을 형성한다. 한편, 부하 선로의 사고전류 발생시 초고속 차단은 오히려 차단기의 내구성을 급격히 소모시키는 점을 전술한 바 있다. 상 기의 문제점을 개선하고자, 회로차단 제어부는 외부사고 발생시 사고전류 계전기를 통해 동작지연회로 를 거쳐서 차단기의 오픈동작회로로 구동 제어한다. 사고전류 계전기와 아크 계전기는 별도 및 단독으로 구성될 수 있다. 아크 계전기가 단독으로 구성되는 경우, 일반 사고전류 계전기에 인터로크를 하여 회로를 구성할 수도 있다. 회로차단기의 동작지연회로는 사고전류 계전기의 동작신호를 사고전류의 3~5 사이클 범위로 지연 한다. 도 4를 참조하면 동작지연회로에 의한 차단 구동 영역은 P2가 될 수 있다. 초고속 차단이 요구되지 않는 부하 선로의 차단일지라도, 사고전류 발생시 차단기는 100ms 이내로 동작되어야 한다. 따라서, 동작지연회 로는 일반적인 사고의 클리어링 구간을 3 내지 4 사이클 범위로 하여 계통의 안전성을 고려하되 차단기의 내구성에 무리가 가지 않도록 한다. 반면, 오픈동작회로는 아크 계전기의 동작시 사고전류의 1 사이 클 이내에서 차단 구동된다. 도 4를 참조하면, 오픈동작회로에 의한 차단 구동 영역은 P1이 될 수 있다. 이상에서 대표적인 실시예를 통하여 본 발명을 상세하게 설명하였으나, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 상술한 실시예에 대하여 본 발명의 범주에서 벗어나지 않는 한도 내에서 다양한 변형이 가능 함을 이해할 것이다. 그러므로 본 발명의 권리 범위는 설명한 실시예에 국한되어 정해져서는 안 되며, 후술하는 특허청구범위뿐만 아니라 특허청구범위와 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태에 의하여 정 해져야 한다."}
{"patent_id": "10-2018-0098694", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 배전반의 2-채널 회로 차단 시스템의 구성도를 나타낸다. 도 2는 아크센서와 연계되는 배전반의 2-채널 회로 차단 시스템을 도시한 것이다. 도 3은 아크센서 및 배전반의 2-채널 회로 차단 시스템의 아크 감지 프로세스를 도시한 것이다. 도 4는 사고 전류의 사이클과 회로차단기의 차단 구동 영역을 도시한 것이다."}
