{"patent_id": "10-2019-0011398", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0012248", "출원번호": "10-2019-0011398", "발명의 명칭": "사물중계기능을 갖는 조명장치 및 이를 포함하는 IoT 시스템", "출원인": "김성용", "발명자": "김성용"}}
{"patent_id": "10-2019-0011398", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 무선신호에 의해 제어되는 하나 이상의 전자장치; 및식별코드에 따라 분류된 전자장치에 대한 리스트를 생성 및 저장하고, 사용자의 조작에 의해 선택된 전자장치의제어를 위해, 전체 조명장치에 대하여 제2 무선신호를 송출하는 스마트 단말기; 및상기 스마트 단말기로부터 상기 전자장치를 가리키는 식별코드를 포함하는 상기 제2 무선신호를 수신하고, 상기식별코드에 대응하여 식별된 전자장치에 상기 제1 무선신호를 송출하여 온 또는 오프하는 실내의 각 영역에 설치되는 복수의 조명장치를 포함하고,상기 복수의 조명장치는,전구가 결합되는 소켓부;상기 제2 무선신호를 수신하는 수신부;상기 식별코드에 대응하여 상기 전자장치를 식별하고, 식별된 전자장치의 온 또는 오프 명령에 대응하는 불린타입 데이터 및 둘 이상의 상태 제어를 위한 정수타입 데이터를 포함하는 제어신호를 생성하고, 온도센서, 대기측정센서, 동작감지 센서 중 적어도 하나의 센서의 감지결과에 대응하며 상기 스마트 단말기에 제공되는 감지신호를 더 생성하는 제어신호 생성부;상기 제어신호를 변환하여 상기 제1 무선신호를 생성 및 송출하는 송신부;상기 소켓부에 전원을 공급하는 전원부;상부로 상기 소켓부가 결합되는 소켓홈이 형성되고, 내부에 상기 수신부, 제어신호 생성부 및 송신부가 실장되는 회로모듈이 배치되는 원통형의 외관 프레임;상기 외관 프레임의 내부에 배치 또는 하부로 결합되고, 내부에 상기 전원부가 실장되는 하부 전극부;상기 송신부와 연결되고, 상기 외관 프레임의 외측면으로 노출되어 전방향으로 주변의 모든 전자장치를 향해 상기 제1 무선신호로서 IR신호를 송출하는 복수개의 IR 발광부; 및상기 소켓부의 전극으로부터 연장되는 배선과 연결되어, 상기 제2 무선신호에 대응하여 상기 전원부로부터 상기소켓부에 공급되는 전원을 도통 또는 차단하는 스위칭부를 포함하는 IoT 시스템."}
{"patent_id": "10-2019-0011398", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 IoT 시스템을 개시한다. 보다 상세하게는, 본 발명은 가정 또는 사무실 등에 설치되는 소켓을 구비한 조명기구를 활용하여 사물의 제어를 수행하는 사물중계기능을 갖는 조명장치 및 이를 포함하는 IoT 시스템에 관 한 것이다. 본 발명의 실시예에 따르면, 각 가정 및 사무실 등에 설치된 소켓부를 탑재한 조명기구내 전자장치를 제어하는 IR 신호를 생성 및 송출하는 수단을 구비함으로써, 종래 IR 신호에 의해 제어되는 다수의 전자장치를 중계 및 제 어할 수 있다."}
{"patent_id": "10-2019-0011398", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 IoT 시스템에 관한 것으로, 특히 가정 또는 사무실 등에 설치되는 소켓을 구비한 조명기구를 활용하 여 사물의 제어를 수행하는 사물중계기능을 갖는 조명장치 및 이를 포함하는 IoT 시스템에 관한 것이다."}
{"patent_id": "10-2019-0011398", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재, 소위 4차 산업 시대를 앞두고 다양한 형태의 홈 오토메이션 시스템(home automation system) 및 사물인터 넷 기술(Internet Of Things technology)에 대한 관심이 증대되고 있으며, 실제 가정 및 사무실 등에 설치되는 IoT 기술이 적용된 다양한 형태의 전자장치가 지속적으로 개발되고 있다. 일예로서, 가정 등에 설치되는 IoT 기술이 적용된 하나 이상의 가전, 전자장치들은 스마트 홈 허브 장치(smart home HUB device) 등을 통해 소규모 무선망 또는 유선망으로 서로 연결됨에 따라 하나의 제어수단을 통해 모든 전자장치가 제어될 수 있어 사용자의 편의성을 극대화할 수 있는 장점이 있다. 그러나, 현재 시판중인 IoT 기술이 적용된 전자장치들은 기존의 이전 세대에 구입한 전자장치와는 연동하여 사 용하지 못하며, 새로운 IoT 기능이 내장된 신제품을 구입해야 하는 한계가 있다. 예를 들면, 종래의 스마트 홈 허브 장치는 구동을 위해 전원이 지속적으로 공급되어야 하며, 이를 위해 별도의 전력 아울렛(power outlet)을 설치해야 하는 제약이 존재하게 된다. 또한, 스마트 홈 허브 장치에 연결되는 전자장치들은 통상적으로 IR 리모트 콘트롤러를 통해 적외선(IR) 통신으 로 제어되는데, 각 전자장치마다 제조사 또는 플랫폼이 상이함에 따라 전용의 리모트 콘트롤러가 요구된다. 이 러한 한계를 극복하기 위해, 하나의 범용 리모트 콘트롤러(universal remote controller)를 이용하여 다수의 전 자장치를 제어하는 방식이 제안되었으나, 범용 리모트 콘트롤러 라 할지라도 사용자가 제어하고자 해당 전자장 치에 대하여 IR 수광부에 대향하도록 IR 빔을 직접 조사해야 하는 번거로움이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제20-2012-0008980호(공개일자: 2012.12.28.) (특허문헌 0002) 공개특허공보 제10-2015-0030948호(공개일자: 2015.03.23.)"}
{"patent_id": "10-2019-0011398", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위해 안출된 것으로, 본 발명은 각 가정 또는 사무실 등에 설치된 다양한 전자장치들에 대하여 각 장치간 제어신호의 중계를 통해 언제 어디서나 장치들을 제어할 수 있도록 하는 사물중 계기능을 갖는 조명장치 및 이를 포함하는 IoT 시스템을 제공하는데 과제가 있다."}
{"patent_id": "10-2019-0011398", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 과제를 해결하기 위해, 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치는, 전구와 결합되는 소 켓부; 외부장치로부터 제1 무선신호에 의해 제어되는 하나 이상의 전자장치를 가리키는 식별코드를 포함하는 제 2 무선신호를 수신하는 수신부; 상기 식별코드에 대응하여 상기 전자장치를 식별하고, 식별된 전자장치의 온 또 는 오프 명령을 포함하는 제어신호를 생성하는 제어신호 생성부; 상기 제어신호를 변환하여 상기 제1 무선신호 를 생성 및 송출하는 송신부; 및 상기 소켓부에 전원을 공급하는 전원부를 포함할 수 있다. 또한, 전술한 과제를 해결하기 위해, 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 IoT 시스템은, 제1 무선신호에 의해 제어되는 하나 이상의 전자장치; 및 외부장치로부터 각 전자장치를 가리키는 식 별코드를 포함하는 제2 무선신호를 수신하고, 상기 식별코드에 대응하여 식별된 전자장치에 제1 무선신호를 송 출하여 온 또는 오프하는 하나 이상의 조명장치를 포함하고, 상기 조명장치는, 전구가 결합되는 소켓부; 상기 제2 무선신호를 수신하는 수신부; 상기 식별코드에 대응하여 상기 전자장치를 식별하고, 식별된 전자장치의 온 또는 오프 명령을 포함하는 제어신호를 생성하는 제어신호 생성부; 상기 제어신호를 변환하여 상기 제1 무선신 호를 생성 및 송출하는 송신부; 및 상기 소켓부에 전원을 공급하는 전원부를 포함할 수 있다."}
{"patent_id": "10-2019-0011398", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 각 가정 및 사무실 등에 설치된 소켓부를 탑재한 조명기구내 전자장치를 제어하는 IR 신호를 생성 및 송출하는 수단을 구비함으로써, 종래 IR 신호 및 기타 무선신호에 의해 제어되는 다수의 전 자장치를 중계 및 제어할 수 있는 효과가 있다."}
{"patent_id": "10-2019-0011398", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "설명에 앞서, 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"구비\" 또는 \"포함\" 한다고 할 때, 이는 특별히 반 대되는 기재가 없는 한, 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미 한다. 또한, 명세서에 기재된 \"...모듈(module)\", \"...부(unit)\" 및 \"...시스템(system)\" 등의 용어는 하나 또 는 둘 이상의 기능이 조합된 동작을 처리하는 단위를 의미하며, 이는 하드웨어, 소프트웨어 또는, 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 본 명세서에서 \"실시예\"라는 용어는 예시, 사례 또는 도해의 역할을 하는 것을 의미하나, 발명의 대상은 그러한 예에 의해 제한되지 않는다. 또한, \"포함하는\", \"구비하는\", \"갖는\" 및 다른 유사한 용어가 사용되고 있 으나, 청구범위에서 사용되는 경우 임의의 추가적인 또는 다른 구성요소를 배제하지 않는 개방적인 전환어 (Transition word)로서 \"포함하는(Comprising)\"이라는 용어와 유사한 방식으로 포괄적으로 사용된다. 이하, 도면을 참조하여 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치 및 이를 포함하는 IoT 시스템을 설명한다. 도 1은 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 IoT 시스템을 나타낸 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 IoT 시스템은 제1 무선신호에 의해 제어되는 하나 이상의 전자장치 및, 외부장치로부터 각 전자장치를 가리키는 식별코드를 포함하는 제2 무선신호를 수신하고, 상 기 식별코드에 대응하여 식별된 전자장치에 제1 무선신호를 송출하여 온(on) 또는 오프(off)하는 하나 이상 의 조명장치를 포함할 수 있다. 또한, 본 발명의 IoT 시스템은 외부장치가 무선 액세스 포인터 장치일 경우 복수의 전자장치를 서로 연결하는 스마트 홈 허브 장치와 연동할 수 있고, 외부장치가 스마트 단말기일 경우, 식별코드 에 따라 분류된 전자장치에 대한 리스트를 생성 및 저장하며, 상기 리스트상에서 사용자의 조작에 의해 선 택된 전자장치에 대한 제1 무선신호를 생성 및 송출하는 어플리케이션 프로그램이 기록된 기록매체가 탑재 될 수 있다. 전자장치는 가정 또는 사무실 등에 설치되어 제어에 따라 구동하는 하나 이상의 장치로서, 라디오, 온도계, IP 카메라, TV/셋탑박스, 전등 및 에어콘, 도어장치 등이 이용될 수 있다. 특히, 본 발명의 실시예에서는 그 종류에 제약은 없으나, 소정의 무선신호를 수신하여 온(on) 또는 오프(off) 되는 전자장치들이 이용되며, 특히, 그 제1 무선신호로서 IR 신호가 적용되는 전자장치들이 대상이 된 다. 그리고, 각 전자장치는 IR 신호를 수광하는 수신부가 조명장치의 송신부에 대응하도록 배치될 수 있다. 또한, 전자장치가 IR 신호를 이용하는 것이 아닌, WiFi 또는 타 무선통신 프로토콜로 제어되는 장치인 경우 에도 본 발명의 기술적 사상이 적용될 수 있으며, 이러한 경우 조명장치에는 해당 무선신호의 송출용 수신 부가 탑재될 수 있다. 조명장치는 소정의 발광체인 전구가 결합되어 온 됨에 따라 조명을 제공하는 역할 뿐만 아니라, 하나 이상 의 외부장치로부터 송출되는 제2 무선신호를 수신하고, 이에 대응하여 해당 전자장치의 구동을 제어하 는 역할을 한다. 상세하게는, 조명장치는 외관을 이루는 외관 프레임 내부로 신호처리를 위한 회로모듈(미도시)이 배치되고, 회로모듈에 실장되는 제어신호 생성부를 통해 수신한 제2 무선신호로부터 제어대상이 되는 전자장치 를 식별하며 그 전자장치에 대응하는 제어하는 제어신호를 생성한다. 이를 위해, 제2 무선신호에는 각 전자장치마다 부여되는 유일한 식별코드가 포함될 수 있으며, 제어신호 생성부는 그 식별코드에 따라 해당 전자장치의 제어신호를 생성하게 된다. 그리고, 제어신호 생성부는 생성한 제어신호를 송신부에 전달하고, 수신부는 제1 무선신호로 변환하여 전자장치 에 송출하게 된다, 즉, 본 발명의 실시예에 따른 조명장치는 일반적인 조명수단과 같이 가정 또는 사무실 등에 설치되는 조명 을 제공하는 것으로서, 조명장치상에 광원인 필라멘트, 형광체 또는 LED와 같은 광원을 구비하는 전구가 결합되는 소켓부를 탑재하고 있으며, 소켓부에 결합되는 전구에 의해 통상적인 조명을 위한 장치로서 구동될 수 있고, 외부장치로부터 제2 무선신호를 수신하여 전구를 제어할 수 있다. 또한, 본 발명의 조명장치는 전구에 전원을 공급하기 위해 소켓부와 전기적으로 연결되는 전원부와 회로모 듈이 연결됨에 따라 대기상태 및 구동시 전원을 안정적으로 공급받게 된다. 외부장치는 사용자의 조작에 대응하여 조명장치에 대하여 소정의 무선신호를 송출하여 각 전자장치 를 제어하는 역할을 한다. 이러한 외부장치는 하나 이상이 이용될 수 있으며, 그 통신 프로토콜로는 WiFi, 지그비(Zigbee) 및 블루투스(bluetooth) 등이 이용될 수 있다. 이러한 외부장치로는 무선 액세스 포인터(wireless access point; AP) 장치, 스마트 단말기 및 리모 트 콘트롤러 중, 어느 하나일 수 있다. 특히 무선 액세스 포인터는 사용자의 조작을 직접 입력받을 수 없 으므로, 복수의 전자장치들을 서로 연결하는 스마트 홈 허브 장치 등으로부터 제어를 위한 신호를 수신하 여 전달하는 형태로 구성될 수 있다. 또한, 외부장치는 스마트 폰 및 태블릿PC 등의 스마트 단말기일 수 있고, 스마트 단말기일 경우 식별코드에 따라 분류된 전자장치에 대한 리스트를 생성 및 저장하고, 그 리스트상에서 사용자의 조작에 의해 선택된 전자장치에 대한 제2 무선신호를 생성하여 조명장치에 송출하는 어플리케이션 프로그램이 기 록된 기록매체가 탑재될 수 있다. 특히, 본 발명의 실시예에 따른 조명장치는 외부장치가 스마트 단말기일 경우, 각 전자장치(1 0)의 리모트 콘트롤러에 대한 정보를 등록 한 후 어플리케이션 프로그램 통하여 각 전자장치를 제어할 수 있을 뿐만 아니라, 별도의 서버장치(미도시)를 통하여 데이터를 가져 올 수 있고, 조명장치에 스마트 홈 구현에 필요한 온도 센서, 대기 중 오염 측정센서, 동작 감지 센서 등이 추가 될 수 있다. 또한, 인공지능(AI)형 음성인식 비서장치(미도시)를 탑재한 스마트 홈 허브 장치와의 연결을 통하여 큰 비 용 부담없이 대부분의 가정에서 손쉽게 IoT 시스템을 구현할 수 있게 된다. 단, 조명장치에 의한 송출신호 인 IR 신호가 통상적으로 10m 이하임에 따라, 조명장치를 여러곳에 설치하고, 하나의 어플리케이션 프로그 램을 통하여 연결을 관리하게 된다. 즉, 무선 액세스 포인터 장치는 마이크를 탑재한 음성입력장치를 탑재한 스마트 홈 허브 장치와 연결 되고, 음성입력장치 또는 스마트 단말기는 입력되는 음성에 대응하여 상기 제1 무선신호를 생성할 수 있다. 그리고, 스마트 단말기의 어플리케이션 프로그램 이외에 별도의 범용 리모트 콘트롤러을 구성하 여 스마트 기기를 이용하지 않더라도 각 기능을 제어하도록 구성될 수 있다. 전술한 구조에 따라, 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 IoT 시스템은 조명수 단으로서의 기능을 수행함은 물론, 적외선 통신으로 구동하는 다양한 전자장치에 대하여 중계역할을 하는 조명 장치를 제공함으로써, 종래 전자장치를 그대로 활용하면서도 스마트 홈 또는 스마트 오피스와 같은 IoT 환경을 구축할 수 있다. 이하, 도면을 참조하여 본 발명의 실시예에 따른 IoT 시스템에 포함되는 사물중계기능을 갖는 조명장치의 구조 를 상세히 설명한다. 도 2는 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치의 구조를 나타낸 도면이다. 도 2를 참조하면, 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치는, 전구와 결합되는 소켓부, 외 부장치로부터 제1 무선신호에 의해 제어되는 하나 이상의 전자장치를 가리키는 식별코드를 포함하는 제2 무선신호를 수신하는 수신부, 식별코드에 대응하여 전자장치를 식별하고, 식별된 전자장치의 온 또는 오프 명령을 포함하는 제어신호를 생성하는 제어신호 생성부, 제어신호를 변환하여 제1 무선신호 를 생성 및 송출하는 송신부 및 상기 소켓부에 전원을 공급하는 전원부를 포함할 수 있다. 또한, 본 발명의 조명장치는 제2 무선신호에 대응하여 상기 전원부로부터 상기 소켓부에 공급되는 전원을 도통 또는 차단하는 스위칭부를 포함할 수 있다.또한, 제1 및 제2 무선신호는 IR, WiFi, 블루투스 및 지그비 중, 어느 하나일 수 있고, 제2 무선신호를 제공하 는 외부장치는 무선 액세스 포인터 장치, 스마트 단말기 및 리모트 콘트롤러 중, 어느 하나일 수 있다. 뿐만 아니라, 본 발명의 조명장치는 온도센서, 대기 측정센서, 동작감지 센서 중, 적어도 하나의 센서를 포함하며, 제어신호 생성부는 센서의 감지결과에 대응하는 감지신호를 더 생성하고, 송신부는 스마트 단말기에 감지신호를 송출하는 포함할 수 있다. 상세하게는, 소켓부는 광원인 전구가 결합되고, 구비된 전극이 전원부와 전기적으로 연결됨에 따라 제어신호에 따라 전구를 온하여 조명수단으로서의 역할을 한다. 수신부는 외부장치로부터 송출되는 제2 무선신호를 수신하는 역할을 한다. 제2 무선신호로는 WiFi 뿐 만 아니라 지그비, 블루투스 등 다양한 신호가 사용될 수 있으며, 수신부는 외부장치와 동일한 통신 프로토콜을 사용하여 제2 무선신호를 수신하게 되며, 내부의 데이터 버스에 대응되도록 변환하여 제어신호 생성 부에 전달하게 된다. 제어신호 생성부는 수신한 전자장치에 대한 제어신호를 생성하는 역할을 한다. 제2 무선신호는 다수의 전자장치에 대한 식별코드 및 제어명령을 포함할 수 있고, 제어신호 생성부는 식별코드를 이용하여 해 당 전자장치를 판단하고, 제어명령을 포함하는 제어신호를 생성하게 된다. 여기서, 제어명령은 단순히 전자 장치의 온 또는 오프를 제어하는 불린타입(boolean type) 데이터 및, TV 채널선택 또는 에어컨의 단계별 온 도조절 등과 같이 둘 이상의 상태제어를 위한 정수타입(integer type) 데이터로 이루어질 수 있다. 생성된 제어 신호는 송신부에 전달된다. 송신부는 하나 이상이 구비되어 각 전자장치를 향해 제1 무선신호를 송출하는 역할을 한다. 각 전자장 치는 대개의 경우 적외선 통신을 수행함에 따라, 송신부는 제어신호를 해당 통신 프로토콜에 따라 변 환하여 전자장치로 송출하게 된다. 이에 따라, 전자장치는 송출된 제어신호에 포함된 식별코드를 통해 자신에 해당되면 제어명령에 대응하여 적절한 동작을 수행하게 된다. 전술한 수신부, 제어신호 생성부 및 송신부는 하나의 인쇄회로기판(PCB)에 실장될 수 있고, 기 판상의 배선을 통해 전기적으로 연결될 수 있다. 전원부는 소켓부 및 구성부(120 ~ 140)에 구동을 위한 전원을 공급하는 역할을 하며, 스위칭부 는 소켓부 및 전원부를 서로 연결하는 역할을 한다. 이러한 스위칭부는 제어신호에 의해 활성화 될 수 있음에 따라, 외부장치가 전자장치만을 제어하는 것이 아닌, 조명장치 자체의 광원도 제어 할 수 있다. 또한, 스위치는 조명장치의 물리적 스위치로서, 사용자의 직접 조작에 따라 전원을 온 또는 오프하여 소켓 부에 결합된 전구를 온 또는 오프하는 구조로 이루어질 수 있다. 한편, 전술한 제1 및 제2 무선신호는 IR, WiFi, 블루투스 및 지그비 중, 어느 하나이며, 제2 무선신호를 제공하 는 외부장치는 무선 액세스 포인터 장치, 스마트 단말기 및 리모트 콘트롤러 중, 어느 하나일 수 있다. 뿐만 아니라, 본 발명의 조명장치는 온도센서, 대기 측정센서, 동작감지 센서 중, 적어도 하나의 센서를 포함하며, 제어신호 생성부는 센서의 감지결과에 대응하는 감지신호를 더 생성하고, 송신부는 스마트 단말기에 감지신호를 송출하는 포함할 수 있다. 전술한 구조에 따라, 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치는 외부장치에 의한 제 어명령에 따라, 일정거리 이격되어 설치된 하나 이상의 전자장치를 제어할 수 있다. 이하, 도면을 참조하며 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치의 외관 및 기구적 구조를 설명 한다. 도 3a 및 도 3b는 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치의 모식화된 구조를 나타낸 도면이다. 도 3a를 참조하면, 본 발명의 실시예에 따른 조명장치는 전구, 소켓홈, 외관 프레임, 회로 모듈, IR 발광부, 전극부, 전원모듈 및 배선을 포함할 수 있다. 전구는 조명장치의 광원으로서, 백열전구 및 형광등 등이 이용될 수 있고, 하부에 나선형의 전극이 형성되어 있다.소켓홈은 전구의 전극이 결합되는 것으로, 내측면에 그 전극에 대응하는 나선형상이 형성되어 있고, 그 하부로는 회로모듈이 배치된다. 특히, 소켓홈은 회로모듈과 직접 연결되는 것이 아닌, 별도 의 배선을 통해 전원모듈이 연결되게 된다. 외관 프레임은 조명장치의 외관을 이루며, 플라스틱 재질의 원통형 구조일 수 있고, 내부로 회로모듈 이 삽입되는 공간이 형성되어 있다. 상부로는 소켓홈이 배치되고, 하부로는 전원모듈이 내장된 하부 전극부가 결합되어 있다. 그리고, 둘레면으로는 복수의 IR 발광부가 배치되어 있다. 회로모듈은 무선신호를 송신 및 수신하고 제어신호를 생성하는 구성부가 칩셋형태로 기판상에 탑재되어 구 성된다. IR 발광부는 송신부와 연결되어 적외선 광 형태의 제1 무선신호를 송출하는 역할을 한다. 특히, IR 발광부 는 제1 무선신호의 송출시 주변의 모든 전자장치를 향해 적외선 신호를 송출하여야 함에 따라, 원통형의 외주면을 따라 암영지역이 최소화되도록 복수의 IR 발광부가 나란히 배치될 수 있으며, 360°전 방향으로 IR 광이 조사되도록 한다. 만약, 제어하고자 하는 전자장치가 IR 신호가 아닌 WiFi 또는 블루투스 등, 적외선이 아닌 다른 통신 프로토콜 을 이용하는 장치라면, 상기 IR 발광부는 해당 무선신호를 송출할 수 있는 송신수단을 더 포함하거나, 그 송신수단으로 대체될 수 있다. 하부 전극부는 외관 프레임의 하부에 결합되어 외부방향으로 돌출되고 외표면이 전극역할을 하며 나 선형상이 형성되어 있어 외부지지수단에 결합될 수 있다. 그리고, 내부로는 전원모듈이 배치되어 있다. 전원모듈은 전원부 및 스위칭부로 구성되며, 하부 전극부로부터 인가되는 전원을 변환하여 각 구성부 에 공급하게 된다. 특히 배선은 소켓부의 전극로부터 연장되어 전원모듈의 스위칭부와 연결됨에 따라, 스위칭부의 조작 또는 제어신호에 따라 전구를 온 또는 오프하게 된다. 도 3b는 본 발명의 다른 형태의 실시예에 따른 조명장치를 나타내고 있다. 도 3b를 참조하면, 바(bar)형 조명장치로서, 전구가 일방향으로 긴 형태로 이루어지며, 소켓부와 일체형으로 구성되는 전극이 외관 프레임의 일측에 삽입되어 결합되게 된다. 외관 프레임은 상기의 실시예와 같이, 내부공간을 갖는 원통형의 플라스틱 재질로 이루어질 수 있고, 내부 로 회로모듈 및 전원모듈이 배치되게 된다. 또한, 외관 프레임의 외측면으로는 복수의 IR 발광 부가 나란히 배치될 수 있다. 그리고, 배선은 전극에서 일정높이로 연장되는 부분과 전원모듈을 서로 연결하게 된다. 전술한 구조에 따라, 본 발명의 조명장치는 조명수단으로서, 가정 또는 사무실 등에 설치되며, 특히 IR 발광부 를 통해 주변에 배치된 다수의 전자장치에 제어신호가 변환된 제1 무선신호를 송출하게 된다. 이하, 도면을 참조하여 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 IoT 시스템의 구동 방법을 설명한다. 도 4는 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 IoT 시스템의 구동방법을 나타낸 도 면이다. 이하의 설명에서는 별다른 지시가 없다면, 각 단계에서의 실행주체는 조명장치 및 이를 구성하는 각 구 성부가 된다. 도 4를 참조하면, 본 발명의 실시예에 따른 IoT 시스템의 구동방법은, 먼저 조명장치가 외부장치로서 사용자의 스마트 단말기 또는 범용 리모트 콘트롤러 조작에 따라 생성된 제2 무선신호를 수신하면(S100), 조명장치는 수 신한 제2 무선신호에 포함된 식별코드를 통해 그 제어대상이 되는 전자장치를 식별한다(S110). 식별결과에 따라(S120), 제어대상이 자신, 즉 조명을 제어하는 신호인 경우에는 제어신호 생성부는 스위칭부를 제어하는 신호를 생성하여 스위칭부를 제어하여(S130), 전구를 온 또는 오프하게 된다. 또한, 제어대상이 타 전자장치인 경우, 유효범위 내 제어대상이 존재하는지 여부에 따라(S140), 존재하지 않는 경우에는 제2 무선신호를 수신한 타 조명장치에 의해 제1 무선신호가 송출되거나, 예외상황이 발생한 것으로 절 차가 종료된다. 그리고, 제어대상이 타 전자장치이며, 유효범위내 제어대상이 존재하면, 생성된 제어신호를 IR 신호형태의 제1 무선신호로 변환하고 송출함으로써 식별된 전자장치가 제1 무선신호를 수신하도록 함으로써 그 전자장치를 온또는 오프하거나, 기타 제어를 수행하도록 한다(S150). 특히, IR 신호는 WiFi와 같은 무선통신 프로토콜에 비해 상대적으로 그 송수신 범위가 제한적이며, 가정 또는 사무실 등에 설치된 다수의 전자장치들이 여러 영역에 설치되는 경우에는 하나의 사물중계기능을 갖는 조명장치 로부터 송출되는 제2 무선신호가 정상적으로 전자장치에 의해 수신되지 않을 수 있다. 이에, 본 발명의 다른 실시예에서는 하나가 아닌 복수의 사물중계기능을 갖는 조명장치를 추가하여 모든 전자장 치들에 대한 제어가 가능하도록 한다. 도 5는 본 발명의 다른 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 확장된 IoT 시스템의 구성을 개략적으로 나타낸 도면이고, 도 6은 도 5의 IoT 시스템의 가정에서의 적용 형태를 예시화한 도면이다. 도 5를 참조하면, 다수의 전자장치를 제어하기 위한 본 발명의 다른 실시예에 따른 복수의 사물중계기능을 갖는 조명장치를 포함하는 IoT 시스템은 조명장치가 제2 무선신호에 따라 각각 제1 무선신호를 출력하는 복수의 조명장치(100.1 ~ 100.4)로 구성될 수 있다. 여기서, 제2 무선신호는 외부장치로서 범용 리모트 콘트롤러의 제어 또는 스마트 단말기에 설치된 어 플리케이션 프로그램의 제어에 따라 무선 액세스 포인터 장치가 각 조명장치(100.1 ~ 100.4)의 전체 에 대하여 동일한 제1 무선신호를 송출하게 된다. 여기서, 제2 무선신호는 WiFi, 블루투스 및 지그비 중 어느 하나일 수 있고, 조명장치(100.1 ~ 100.4)들은 제2 무선신호를 수신하면, 이를 IR 신호(IR1 ~ IR4)인 제1 무선신호로 변환하여 모든 전자장치에 송출하게 되며, 각 조명장치(100.1 ~ 100.4)는 서로 다른 무선신호를 송수신하는 것이 아닌, 동일한 제2 무선신호를 수신하고 동일 한 제1 무선신호를 송출하게 된다. 특히, 일반적인 스마트 단말기는 WiFi 프로토콜에 따른 신호를 자체적으로 송출할 수 있는 기능을 탑재하 고 있으므로, 제2 무선신호를 액세스 포인터 장치를 거치지 않고 직접 조명장치에 송출할 수 있다. 도 6을 참조하면, 본 발명의 다른 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 IoT 시스템은 일반 가정에서 거실뿐만 아니라, 주방 및 침실 등에 본 발명의 제1 내지 제6 조명장치(100.1 ~ 100.6)가 배치되는 일 예를 나타내고 있다. 이러한 구조에서, 거실의 TV 또는 에어컨(11, 12)은 제3 또는 제4 조명장치(100.3, 100.4)에 의해 제어가 가능 하나, 침실2의 온도계 및 도어장치 등은 제3 또는 제4 조명장치(100.3, 100.4)에 의해서는 제1 무선신 호가 침실의 벽을 통과하지 못함에 따라, 제어가 불가능하게 된다. 여기서, 무선 액세스 포인터 장치가 송출하는 제2 무선신호는 WiFi 등의 비교적 장애물에 영향을 덜 받는 신호이므로 조명장치(100.1 ~ 100.6)가 각 침실내 설치된다 하더라도 신호 송수신에는 어려움이 발생하지 않으 며, 이에 따라 타 침실에 있는 온도계, TV 등을 각각 제어하기 위해 거실 뿐만 아니라 각 침실 및 주방마다 조 명장치(100.1 ~ 100.6)을 설치하여 각각 제어를 수행할 수 있도록 구성될 수 있다. 상기한 설명에 많은 사항이 구체적으로 기재되어 있으나 이것은 발명의 범위를 한정하는 것이라기보다 바람직한 실시예의 예시로서 해석되어야 한다. 따라서, 발명은 설명된 실시예에 의하여 정할 것이 아니고 특허청구범위와 특허청구범위에 균등한 것에 의하여 정하여져야 한다."}
{"patent_id": "10-2019-0011398", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 IoT 시스템을 나타낸 도면이다. 도 2는 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치의 구조를 나타낸 도면이다. 도 3a 및 도 3b는 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치의 모식화된 구조를 나타낸 도면이다. 도 4는 본 발명의 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 IoT 시스템의 구동방법을 나타낸 도면이다. 도 5는 본 발명의 다른 실시예에 따른 사물중계기능을 갖는 조명장치를 포함하는 확장된 IoT 시스템의 구성을 개략적으로 나타낸 도면이다. 도 6은 도 5의 IoT 시스템의 가정에서의 적용 형태를 예시화한 도면이다."}
