{"patent_id": "10-2023-7035692", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0004317", "출원번호": "10-2023-7035692", "발명의 명칭": "핸드오버를 지원하는 방법 및 디바이스", "출원인": "삼성전자주식회사", "발명자": "쉬 리시앙"}}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 네트워크에서 제1 노드에 의해 수행되는 방법에 있어서,코어 네트워크 노드로부터 핸드오버 요청 메시지를 수신하는 단계;직접 데이터 포워딩을 나타내는 표시를 포함하는 제1 메시지를 제2 노드로 전송하는 단계; 및 상기 제2 노드로부터, 상기 제2 노드에 의해 할당된 데이터 포워딩 터널에 대한 정보를 포함하는 제2 메시지를수신하는 단계를 포함하는, 제1 노드에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 제1 메시지는, 시스템 간 핸드오버에 대한 정보, 상기 시스템 간 핸드오버를 위한 상기 직접 데이터 포워딩에 대한 정보, EPS(evolved packet system)에서 5세대 시스템(5GS)으로의 상기 시스템 간 핸드오버를 위한 상기 직접 데이터 포워딩에 대한 정보 중 하나를 포함하는, 제1 노드에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 제1 메시지는 상기 직접 데이터 포워딩이 인에이블되는지 간접 데이터 포워딩이 인에이블되는지 여부를 나타내는 표시를 포함하는, 제1 노드에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "무선 통신 네트워크에서 제2 노드에 의해 수행되는 방법에 있어서,제1 노드로부터, 직접 데이터 포워딩을 나타내는 표시를 포함하는 제1 메시지를 수신하는 단계; 및상기 제2 노드에 의해 할당된 데이터 포워딩 터널에 대한 정보를 포함하는 제2 메시지를 상기 제1 노드로 전송하는 단계를 포함하는, 제2 노드에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 제1 노드로부터, 데이터 터널의 주소를 포함하는 상기 제1 메시지를 수신하고 상기 데이터 터널의 주소에기반하여 IP(Internet Protocol) 버전에 대한 정보를 결정하는 단계;로컬 구성에 기반하여, 상기 데이터 포워딩 터널 주소의 상기 IP 버전에 대한 정보를 획득하는 단계; 또는 소스 기지국의 유형에 기반하여, 상기 데이터 포워딩 터널 주소의 상기 IP 버전에 대한 정보를 획득하는 단계를더 포함하는, 제2 노드에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "무선 통신 네트워크에서 제1 노드에 의해 수행되는 방법에 있어서,코어 네트워크 노드로부터 핸드오버 요청 메시지를 수신하는 단계;데이터 무선 베어러를 수립하기 위한 정보를 포함하는 제1 메시지를 제2 노드로 전송하는 단계; 및 상기 제2 노드로부터, 상기 제1 메시지를 전송하는 것에 대한 응답으로 제2 메시지를 수신하는 단계를포함하고, 공개특허 10-2024-0004317-3-상기 제2 메시지는 수립된 데이터 무선 베어러에 대한 정보를 포함하는, 제1 노드에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 데이터 무선 베어러에 대한 정보는: 데이터 무선 베어러 식별자, 또는 소스 기지국의 상기 데이터 무선 베어러의 데이터 포워딩 요청 목록 중 적어도 하나를 포함하고; 상기 데이터 무선 베어러의 상기 데이터 포워딩 요청 목록은 상기 소스 기지국의 하나 이상의 데이터 무선 베어러에 대한 데이터 포워딩 요청 정보에 사용되고;상기 데이터 무선 베어러의 상기 데이터 포워딩 요청 목록은: 상기 데이터 무선 베어러 식별자, 데이터 포워딩 요청, 또는서비스 품질(QoS) 데이터 흐름에 대한 정보 목록 중 적어도 하나를 포함하는, 제1 노드에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6 항에 있어서,상기 제1 메시지에 기반하여, 소스 기지국의 하나 이상의 데이터 무선 베어러가 타겟 기지국의 단일 데이터 무선 베어러에 매핑되는 것을 식별하는 단계; 및 상기 소스 기지국의 상기 하나 이상의 데이터 무선 베어러 중 각각의 데이터 무선 베어러에 대한 데이터 포워딩터널 주소를 생성하는 단계를 더 포함하는, 제1 노드에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "무선 통신 네트워크에서 제2 노드에 의해 수행되는 방법에 있어서,제1 노드로부터, 데이터 무선 베어러를 수립하기 위한 정보를 포함하는 제1 메시지를 수신하는 단계; 및 수립된 데이터 무선 베어러에 대한 정보를 포함하는 상기 제1 메시지를 수신하는 것에 응답하여 제2 메시지를상기 제1 노드에 전송하는 단계를 포함하는, 제2 노드에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "무선 통신 네트워크에서 제1 기지국에 의해 수행되는 방법에 있어서,타겟 기지국으로부터 데이터 포워딩 터널에 대한 정보를 수신하는 단계; 상기 제2 기지국으로 포워딩될 서비스 품질(QoS) 흐름에 대한 정보를 제2 기지국으로 전송하는 단계; 및 상기 제2 기지국과 상기 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능한지 여부의 결정에 기반하여상기 제2 기지국에 대한 상기 데이터 포워딩 터널에 대한 정보를 상기 제2 기지국으로 전송하는 단계를 포함하는, 제1 기지국에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 데이터 포워딩 터널에 대한 정보는, 상기 타겟 기지국에 의해 E-RAB(evolved-Radio Access Bearer)에 할당된 상기 데이터 포워딩 터널에 대한 정보를 포함하는, 제1 기지국에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10 항에 있어서,상기 제2 기지국으로 포워딩될 상기 QoS flow에 대한 정보는 상기 QoS flow이 매핑되는 E-RAB 식별자 또는 QoS공개특허 10-2024-0004317-4-flow 식별자 중 적어도 하나를 포함하는, 제1 기지국에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "무선 통신 네트워크에서 제2 기지국에 의해 수행되는 방법에 있어서, 제1 기지국으로부터, 제2 기지국으로 포워딩될 서비스 품질(QoS) 흐름에 대한 정보를 수신하는 단계;상기 제1 기지국으로부터, 제2 기지국에 의해 데이터를 포워딩하기 위한 데이터 포워딩 터널에 대한 정보를 수신하는 단계; 및 상기 제2 기지국으로 포워딩될 상기 QoS flow에 대한 정보와 상기 제2 기지국에 대한 상기 데이터 포워딩 터널에 대한 정보에 기반하여 상기 QoS flow의 데이터를 포워딩하는 단계를 포함하는, 제2 기지국에 의해 수행되는방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 제2 기지국과 상기 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능한 경우, 상기 제2 기지국에 대한 상기 데이터 포워딩 터널에 대한 정보는 상기 제1 기지국에 의해 상기 타겟 기지국으로부터 수신된 데이터포워딩 터널 정보를 포함하는, 제2 기지국에 의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서,상기 타겟 기지국으로부터 수신된 상기 데이터 포워딩 터널에 관한 정보는 상기 타겟 기지국에 의해 E-RAB(evolved-radio access bearer)에 할당된 상기 데이터 포워딩 터널에 대한 정보를 포함하는, 제2 기지국에의해 수행되는 방법."}
{"patent_id": "10-2023-7035692", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 본 개시내용은 핸드오버를 지원하기 위한 방법 및 장비를 제공하고, 본 개시내용은 무선 통신 네트워크에서 제1 노드에 의해 수 행되는 방법을 개시하고, 상기 방법은: 코어 네트워크 노드로부터 핸드오버 요청 메시지를 수신하는 단계; 직접 데이터 포워딩의 표시를 포함하는 제1 메시지를 제2 노드로 전송하는 단계; 및 제2 노드로부터 제2 노드에 의해 할당된 데이터 포워딩 터널에 대한 정보를 포함하는 제2 메시지를 수신하는 단계를 포함한다."}
{"patent_id": "10-2023-7035692", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 무선 통신 기술, 특히 핸드오버를 지원하는 방법 및 디바이스에 관한 것이다."}
{"patent_id": "10-2023-7035692", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신은 현대 역사상 가장 성공적인 혁신 중 하나이다. 최근에, 무선 통신 서비스 가입자 수는 50억 명을 넘어섰고, 계속해서 빠르게 증가하고 있다. 소비자와 기업에서 스마트폰과 다른 모바일 데이터 디바이스(예를 들어, 태블릿 컴퓨터, 노트북 컴퓨터, 넷북, e-북 리더, 기계형 디바이스들)의 인기가 증가함에 따라, 무선 데 이터 서비스에 대한 수요가 빠르게 증가하고 있다. 모바일 데이터 서비스의 빠른 성장을 충족하고 새로운 애플 리케이션과 배포를 지원하기 위해, 무선 인터페이스의 효율과 커버리지를 향상시키는 것이 매우 중요하다. 5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part)의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다."}
{"patent_id": "10-2023-7035692", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "다음과 같은 문제가 핸드오버 절차 동안 발생한다: 데이터 포워딩 터널 주소가 올바르게 생성되지 않을 수 있고, 데이터 포워딩 터널이 적절하게 작동하지 않을 수 있다."}
{"patent_id": "10-2023-7035692", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시내용의 실시예의 양태에 따르면, 무선 통신 네트워크에서 제1 노드에 의해 수행되는 방법이 제공되고, 방법은: 코어 네트워크 노드로부터 핸드오버 요청 메시지를 수신하는 단계; 직접 데이터 포워딩의 표시를 포함 하는 제1 메시지를 제2 노드로 전송하는 단계; 및 제2 노드로부터 제2 노드에 의해 할당된 데이터 포워딩 터널 에 대한 정보를 포함하는 제2 메시지를 수신하는 단계를 포함한다. 본 개시내용의 실시예에 따르면, 제1 메시지는 시스템 간 핸드오버에 대한 정보, 시스템 간 핸드오버를 위한 직 접 데이터 포워딩에 대한 정보, 또는 EPS에서 5GS로 시스템 간 핸드오버를 위한 직접 데이터 포워딩에 대한 정보 중 하나의 정보를 포함한다. 본 개시내용의 실시예에 따르면, 시스템 간 핸드오버를 위해, 제1 메시지는 직접 데이터 포워딩인지 간접 데이 터 포워딩인지에 대한 표시를 포함한다. 본 개시내용의 실시예에 따르면, 시스템 간 핸드오버 및 직접 데이터 포워딩을 위해, 제1 메시지는 직접 포워딩 경로 가용성을 포함한다. 본 개시내용의 실시예에 따르면, 제1 메시지는 시스템 간 핸드오버에 대한 정보 및 직접 포워딩 경로 가용성에 대한 정보를 포함한다. 본 개시내용의 실시예에 따르면, 제1 메시지는 데이터 터널의 주소를 포함한다. 본 개시내용의 실시예에 따르면, 제2 메시지는 매칭된 IP 버전의 데이터 포워딩 터널의 주소를 포함한다. 본 개시내용의 실시예의 다른 양태에 따르면, 무선 통신 네트워크에서 제2 노드에 의해 수행되는 방법이 제공되 고, 방법은: 제1 노드로부터 직접 데이터 포워딩의 표시를 포함하는 제1 메시지를 수신하는 단계; 및 제2 노드 에 의해 할당된 데이터 포워딩 터널에 대한 정보를 포함하는 제2 메시지를 제1 노드로 전송하는 단계를 포함한 다. 본 개시내용의 실시예에 따르면, 방법은: 제1 노드로부터 데이터 터널의 주소를 포함하는 제1 메시지를 수신하 고 데이터 터널의 주소에 기반하여 IP 버전에 대한 정보를 결정하는 단계; 또는 로컬 설정을 통해 데이터 포워 딩 터널 주소의 IP 버전에 관한 정보를 획득하는 단계; 또는 소스 기지국의 유형을 통해 데이터 포워딩 터널 주 소의 IP 버전에 관한 정보를 획득하는 단계를 포함한다. 본 개시내용의 실시예에 따르면, 제2 메시지는 매칭된 IP 버전의 데이터 포워딩 터널의 주소를 포함한다. 본 개시내용의 실시예에 따르면, 무선 통신 네트워크에서 제1 노드에 의해 수행되는 방법이 제공되고, 방법은: 코어 네트워크 노드로부터 핸드오버 요청 메시지를 수신하는 단계; 셋업될 데이터 무선 베어러에 대한 정보를 포함하는 제1 메시지를 제2 노드로 전송하는 단계; 및 제1 메시지에 응답하여, 제2 노드로부터 셋업 데이터 무 선 베어러에 대한 정보를 포함하는 제2 메시지를 수신하는 단계를 포함한다. 본 개시내용의 실시예에 따르면, 셋업될 데이터 무선 베어러에 대한 정보는: 데이터 무선 베어러 식별자, 소스 기지국에 대한 데이터 무선 베어러의 데이터 포워딩 요청 목록 중 적어도 하나를 포함하고, 데이터 무선 베어러 의 데이터 포워딩 요청 목록은 소스 기지국 상의 하나 이상의 데이터 무선 베어러에 대한 데이터 포워딩 요청 정보에 사용되고, 데이터 무선 베어러의 데이터 포워딩 요청 목록은: 데이터 무선 베어러 식별자, 데이터 포워 딩 요청 및 QoS 데이터 흐름 정보 목록 중 적어도 하나를 포함한다. 본 개시내용의 실시예에 따르면, 방법은: 제1 메시지에 기반하여, 소스 기지국 상의 하나 이상의 데이터 무선 베어러가 타겟 기지국 상의 하나의 데이터 무선 베어러에 매핑됨을 식별하는 단계, 및 소스 기지국 상의 각각의 데이터 무선 베어러에 대한 포워딩 터널 주소를 생성하는 단계를 더 포함한다. 본 개시내용의 실시예에 따르면, 제2 메시지는: 데이터 무선 베어러 식별자, 소스 기지국에 대한 데이터 무선 베어러의 데이터 포워딩 응답 목록 중 적어도 하나를 포함하고, 데이터 무선 베어러의 데이터 포워딩 응답 목록 은 하나 이상의 소스 기지국 상의 데이터 무선 베어러에 대한 데이터 포워딩 응답 정보에 사용되고, 데이터 무 선 베어러의 데이터 포워딩 응답 목록은: 데이터 무선 베어러 식별자, 업링크 데이터 포워딩 터널의 주소 및 다 운링크 데이터 포워딩 터널의 주소 중 적어도 하나를 포함한다. 본 개시내용의 실시예에 따르면, 제2 메시지는: 데이터 무선 베어러 식별자 및 데이터 무선 베어러에 대한 데이 터 포워딩 정보 응답 중 적어도 하나를 포함하고, 데이터 무선 베어러의 데이터 포워딩 정보 응답은 업링크 데 이터 포워딩 터널의 주소 및/또는 다운링크 데이터 포워딩 터널의 주소를 포함한다. 본 개시내용의 실시예에 따르면, 방법은: 소스 기지국 상의 데이터 무선 베어러에 대한 데이터 포워딩 터널의 동일한 주소를 생성하는 단계를 더 포함한다. 본 개시내용의 실시예에 따르면, 방법은: 소스 기지국 상의 데이터 무선 베어러에 대해 수립된 데이터 포워딩 터널의 동일한 주소를 코어 네트워크 노드로 전송하는 단계를 더 포함한다. 본 개시내용의 실시예의 다른 양태에 따르면, 무선 통신 네트워크에서 제2 노드에 의해 수행되는 방법이 제공되 고, 방법은: 제1 노드로부터 셋업될 데이터 무선 베어러에 대한 정보를 포함하는 제1 메시지를 수신하는 단계;및 제1 메시지에 응답하여 셋업 데이터 무선 베어러에 대한 정보를 포함하는 제2 메시지를 제1 노드로 전송하는 단계를 포함한다. 본 개시내용의 실시예의 다른 양태에 따르면, 신호를 수신 및 송신하도록 설정된 트랜시버; 및 트랜시버와 결합 되어 본 개시내용의 실시예 중 어느 하나의 실시예의 방법을 수행하게 제어하도록 설정되는 제어기를 포함하는 제1 노드가 무선 통신 네트워크에 제공된다. 본 개시내용의 실시예의 다른 양태에 따르면, 신호를 수신 및 송신하도록 설정된 트랜시버; 및 트랜시버와 결합 되어 본 개시내용의 실시예 중 어느 하나의 실시예의 방법을 수행하게 제어하도록 설정되는 제어기를 포함하는 제2 노드가 무선 통신 네트워크에 제공된다. 본 개시내용의 실시예의 다른 양태에 따르면, 무선 통신 네트워크에서 제1 기지국이 수행되는 방법이 제공되고, 방법은: 타겟 기지국으로부터 데이터 포워딩 터널에 관한 정보를 수신하는 단계; 제2 기지국으로 포워딩될 QoS flow에 대한 정보를 전송하는 단계; 및 제2 기지국과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능한 지 여부에 따라 제2 기지국에 대한 데이터 포워딩 터널에 대한 정보를 제2 기지국으로 전송하는 단계를 포함한 다. 본 개시내용의 실시예에 따르면, 제2 기지국과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능한 경우, 제2 기지국에 대한 데이터 포워딩 터널에 대한 정보는 제1 기지국에 의해 수신된 데이터 포워딩 터널 정보를 포 함한다. 본 개시내용의 일 실시예에 따르면, 제2 기지국과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하지 않은 경우, 제2 기지국에 대한 데이터 포워딩 터널에 대한 정보는 제1 기지국과 제1 기지국에 의해 제2 기지국 에 할당된 제2 기지국 간의 데이터 포워딩 터널에 관한 정보를 포함한다. 본 개시내용의 실시예에 따르면, 데이터 포워딩 터널에 대한 정보는 타겟 기지국에 의해 E-RAB(Evolved Radio Access Bearer)에 할당된 데이터 포워딩 터널에 대한 정보를 포함한다. 본 개시내용의 실시예에 따르면, 포워딩되는 QoS flow들에 대한 정보는 QoS flow 식별자 및 QoS flow이 매핑되 는 E-RAB 아이덴티티 중 적어도 하나를 포함한다. 본 개시내용의 일 실시예에 따르면, QoS flow 포워딩에 대한 정보는 데이터 포워딩 터널에서 포워딩되는 QoS flow에 대한 정보를 포함한다. 본 개시내용의 실시예에 따르면, 방법은: 핸드오버 유형에 관한 정보를 제2 기지국으로 전송하는 단계를 더 포 함한다. 본 개시내용의 실시예에 따르면, 방법은: 제1 기지국의 데이터 및/또는 제2 기지국으로부터 수신된 데이터를 타 겟 기지국으로 전송하는 단계를 더 포함한다. 본 개시내용의 실시예의 다른 양태에 따르면, 무선 통신 네트워크에서 제2 기지국에 의해 수행되는 방법이 제공 되고, 방법은: 제1 기지국으로부터 포워딩될 QoS flow에 대한 정보를 수신하는 단계; 제1 기지국으로부터 제2 기지국에 의해 데이터를 포워딩하기 위한 데이터 포워딩 터널에 대한 정보를 수신하는 단계; 및 포워딩될 QoS flow에 대한 정보와 제2 기지국에 대한 데이터 포워딩 터널에 대한 정보에 기반하여 QoS flow의 데이터를 포워 딩하는 단계를 포함한다. 본 개시내용의 실시예에 따르면, 제2 기지국과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능한 경우, 제2 기지국에 대한 데이터 포워딩 터널에 대한 정보는 타겟 기지국으로부터 제1 기지국에 의해 수신된 데이터 포워딩 터널 정보를 포함한다. 본 개시내용의 일 실시예에 따르면, 제2 기지국과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하지 않은 경우, 제2 기지국에 대한 데이터 포워딩 터널에 대한 정보는 제1 기지국과 제1 기지국에 의해 제2 기지국 에 할당된 제2 기지국 간의 데이터 포워딩 터널에 관한 정보를 포함한다. 본 개시내용의 실시예에 따르면, 타겟 기지국으로부터 수신된 데이터 포워딩 터널에 관한 정보는 타겟 기지국에 의해 E-RAB에 할당된 데이터 포워딩 터널에 대한 정보를 포함한다. 본 개시내용의 실시예에 따르면, 포워딩되는 QoS flow들에 대한 정보는 QoS flow 식별자 및 QoS flow이 매핑되 는 E-RAB 식별자 중 적어도 하나를 포함한다.본 개시내용의 실시예에 따르면, 포워딩될 QoS flow에 대한 정보는 데이터 포워딩 터널에서 포워딩될 QoS flow 에 대한 정보를 포함한다. 본 개시내용의 실시예에 따르면, 방법은: 제1 기지국으로부터 핸드오버 유형에 대한 정보를 수신하는 단계를 더 포함한다. 본 개시내용의 실시예에 따르면, 방법은: 제2 기지국의 데이터를 타겟 기지국 또는 제1 기지국으로 전송하는 단 계를 더 포함한다. 아래의 상세한 설명을 착수하기 전에, 본 특허 문서 전반에 걸쳐 사용되는 소정 단어 및 문구의 정의를 설명하 는 것이 유리할 수 있고: \"포함하다(include 및 comprise)\"라는 용어 및 그 파생어는 제한 없는 포함을 의미하 고; \"또는\"이라는 용어는 및/또는을 의미하는 포함이고; \"~와 연관된(associated with 및 associated therewith)\"이라는 용어 및 이의 파생어는 포함하다(include, contain), 포함되다(included within, contained within), ~와 상호연결하다, ~에 또는 ~와 연결하다, ~에 또는 ~와 결합하다, ~와 통신하다, ~와 협력하다, 교 차 배치하다, 병치하다, 근접하다, ~에 또는 ~와 경계를 이루다, 소유하다, 등을 의미할 수 있고; \"제어기\"라는 용어는 적어도 하나의 동작을 제어하는 임의의 디바이스, 시스템 또는 그 일부를 의미하고, 이러한 디바이스는 하드웨어, 펌웨어 또는 소프트웨어, 또는 이들 중 적어도 2개의 일부 조합으로 구현될 수 있다. 임의의 특정 제 어기와 연관된 기능이 로컬이든 원격이든 중앙 집중화되거나 분산되는 것이 유의되어야 한다. 게다가, 이하에서 설명되는 다양한 기능은 하나 이상의 컴퓨터 프로그램에 의해 구현 또는 지원될 수 있고, 하 나 이상의 컴퓨터 프로그램 각각은 컴퓨터 판독가능 프로그램 코드로 형성되고 컴퓨터 판독가능 매체에 구현된 다. \"애플리케이션\" 및 \"프로그램\"이라는 용어는 하나 이상의 컴퓨터 프로그램, 소프트웨어 구성요소, 명령의 세트, 절차, 기능, 객체, 클래스, 인스턴스, 관련 데이터 또는 적합한 컴퓨터 판독가능 프로그램 코드로 구현하 기 위해 적응된 그 일부를 지칭한다. \"컴퓨터 판독가능 프로그램 코드\"라는 문구는 소스 코드, 객체 코드 및 실 행 가능한 코드를 포함한 임의의 유형의 컴퓨터 코드를 포함한다. \"컴퓨터 판독가능 매체\"라는 문구는 ROM(read only memory), RAM(Random Access Memory), 하드 디스크 드라이브, CD(Compact Disc), DVD(Digital Video Disc) 또는 임의의 다른 유형의 메모리와 같이 컴퓨터에서 액세스될 수 있는 임의의 유형의 매체를 포함한다. \"비일시적\" 컴퓨터 판독가능 매체는 일시적인 전기 또는 다른 신호를 전송하는 유선, 무선, 광학 또는 다른 통 신 링크를 제외한다. 비일시적 컴퓨터 판독가능 매체는 데이터를 영구적으로 저장할 수 있는 매체와 재기록 가 능한 광 디스크 또는 소거 가능한 메모리 디바이스와 같이 데이터를 저장하고 나중에 겹쳐쓸 수 있는 매체를 포 함한다. 소정 단어 또는 문구에 대한 정의는 본 특허 문서를 통해 제공되고, 통상의 기술자는 대부분은 아니지만 많은 경우에, 그러한 정의가 그러한 정의된 단어 및 문구의 이전 사용뿐만 아니라 미래 사용에도 적용됨을 이해해야 한다."}
{"patent_id": "10-2023-7035692", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시내용은 핸드오버를 지원하는 방법 및 장비를 제공한다. 이 방법으로, 타겟 기지국은 데이터 포워딩 터널 에 적절한 주소를 생성할 수 있다."}
{"patent_id": "10-2023-7035692", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1 내지 도 19 및 본 특허 문헌에서 본 개시내용의 원리를 설명하기 위한 다양한 실시예는 단지 예시를 위한 것이고 어떠한 방식으로든 본 개시내용의 범위를 제한하는 것으로 해석되어서는 안 된다. 통상의 기술자는 본 개시내용의 원리가 임의의 적합하게 배열된 임의의 시스템 또는 디바이스에서 구현될 수 있음을 이해할 것이다. 도 1은 SAE(system architecture evolution)의 예시적인 시스템 아키텍처를 예시한다. 사용자 장비 (UE)는 데이터를 수신하기 위한 단말 디바이스이다. E-UTRAN(Evolved Universal Terrestrial Radio Access Network)은 UE에게 무선 네트워크에 액세스하기 위한 인터페이스를 제공하는 매크로 기지국 (eNodeB/NodeB)을 포함하는 무선 액세스 네트워크이다. MME(Mobility Management Entity)는 UE의 이동성 컨텍스트, 세션 컨텍스트 및 보안 정보의 관리를 담당한다. 서빙 게이트웨이(SGW)는 주로 사용자 평면의 기능을 제공하고, MME와 SGW는 동일한 물리적 엔티티에 있을 수 있다. 패킷 데이터 네트워크 게이트 웨이(PGW)는 과금, 합법적인 차단 등의 기능을 담당하고, SGW와 동일한 물리적 엔티티에 있을 수 있 다. 정책 및 과금 규칙 기능 엔티티(PCRF)는 서비스 품질(QoS) 정책 및 과금 기준을 제공한다. 일반 패킷 무선 서비스 지원 노드(SGSN)는 UMTS(Universal Mobile Telecommunications System)에서 데이터 전송을 위한 라우팅을 제공하는 네트워크 노드 디바이스이다. 홈 가입자 서버(HSS)는 UE의 홈 서브 시스템이고 사 용자 장비의 현재 위치, 서빙 노드의 주소, 사용자 보안 정보, 사용자의 장비의 패킷 데이터 컨텍스트 등을 포 함한 사용자 정보를 보호하는 것을 담당한다. 도 2는 본 개시내용의 다양한 실시예에 따른 예시적인 시스템 아키텍처를 예시한다. 시스템 아키텍처(20 0)의 다른 실시예는 본 개시내용의 범위를 벗어나지 않고 사용될 수 있다. 사용자 장비(UE)는 데이터를 수신하기 위한 단말 디바이스이다. NG-RAN(Next Generation Radio Access Network)은 UE에게 무선 네트워크에 액세스하기 위한 인터페이스를 제공하는 기지국(5G 코어 네트워크 (5GC)에 연결된 gNB 또는 eNB, 5GC에 연결된 eNB는 또한 ng-gNB로 칭해짐)을 포함하는 무선 액세스 네트워크이 다. 액세스 제어 및 이동성 관리 기능 엔티티(AMF)는 UE의 이동성 컨텍스트 및 보안 정보를 관리하는 역할 을 담당한다. 사용자 평면 기능 엔티티(UPF)는 주로 사용자 평면의 기능을 제공한다. 세션 관리 기능 엔티 티 SMF는 세션 관리를 담당한다. 데이터 네트워크(DN)은 예를 들어 오퍼레이터의 서비스, 인터넷 액 세스 및 제3자의 서비스를 포함한다. 본 개시내용의 예시적인 실시예는 이하 첨부된 도면을 참조하여 더 설명된다. 본문과 도면은 단지 본 개시내용의 이해를 돕기 위한 예로서만 제공된다. 이는 어떤 식으로든 본 개시내용의 범 위를 제한하는 것으로 해석되지 않아야 한다. 소정 실시예 및 예가 제공되었지만, 본원의 개시내용에 기반하여, 변화가 본 개시내용의 범위를 벗어나지 않고 예시된 실시예 및 예에 대해 이루어질 수 있음이 통상의 기술자에 게 명백할 것이다.5G 시스템에서, 사용자 장비(UE)는 데이터를 수신하는 데 사용되는 단말 디바이스이다. 기지국은 UE가 무선 네 트워크에 액세스하는 인터페이스를 제공한다. 액세스 및 이동성 관리 기능(AMF)은 UE의 이동성 컨텍스트 및 보 안 정보를 관리하는 것을 담당한다. 사용자 평면 기능 엔티티(UPF)는 주로 사용자 평면 기능을 제공한다. 세션 관리 기능 엔티티(SMF)는 세션 관리를 담당한다. 기지국은 기지국 중앙부(CU: Centralized Unit) 및 기지국 분배부(DU: Distributed Unit)를 포함할 수 있다. 기지국 중앙부는 기지국 중앙부-제어 평면 엔티티(CU-CP) 및 기지국 중앙부-사용자 평면 엔티티(CU-UP)를 포함 할 수 있다. UE가 2개의 기지국 간을 이동할 때, 서비스의 연속성을 보장하기 위해, gNB와 gNB 간 핸드오버, gNB와 5GC에 연 결된 eNB 간 핸드오버와 같은 시스템 내 핸드오버; 및 5G 시스템(5GS)과 EPS(Evolved Packet System) 간의 시 스템 간 핸드오버를 포함한 핸드오버 절차를 정의해야 한다. 시스템 간 핸드오버에서, 사용자 평면 기능 엔티티는 EPS 시스템의 UPF 및 PGW 기능의 일부 기능을 포함할 수 있다. 핸드오버 절차는 시스템 내 핸드오버와 시스템 간 핸드오버를 포함한다. 시스템 내 핸드오버와 시스템 간 핸드 오버의 경우, 데이터 손실을 방지하고 서비스의 연속성을 보장하기 위해, 소스 기지국에서 타겟 기지국으로의 데이터 포워딩이 핸드오버 동안 수행되어야 한다. 데이터 포워딩은 직접 데이터 포워딩과 간접 데이터 포워딩으 로 분류된다. 직접 데이터 포워딩은 소스 기지국이 포워딩된 데이터를 타겟 기지국으로 직접 전송하는 것을 의 미한다. 간접 데이터 포워딩은 소스 기지국이 포워딩된 데이터를 코어 네트워크로 전송하고 데이터가 코어 네트 워크에 의해 타겟 기지국으로 전송되는 것을 의미한다. EPS에서 5GS로의 시스템 간 핸드오버의 경우, 간접 데이 터 포워딩은 소스 기지국에서 서비스 게이트웨이(SGW)로 이루어지고, SGW는 데이터를 UPF로 전송하고, UPF는 그 데이터를 타겟 기지국으로 전송한다. 데이터 포워딩을 지원하기 위해, 타겟 기지국은 데이터 포워딩을 위해 하 나 이상의 터널을 할당해야 한다. 데이터 포워딩 터널은 터널 종점 식별자(TEID: tunnel endpoint identifie r)와 전송 계층 주소를 포함한다. TEID는 일반 패킷 무선 서비스(GPRS: General Packet Radio Service) 터널 프로토콜(GTP)의 터널 종점 식별자일 수 있다. 문제 1 시스템 내(5G 시스템) 핸드오버의 경우, 소스 기지국은 NG-RAN 노드이고, 직접 데이터 포워딩이 사용되는 경우, 타겟 기지국에 의해 할당된 전송 계층 주소는 소스 NG-RAN 노드에 의해 지원되어야 한다. EPS에서 5GS로의 시스 템 간 핸드오버를 위해, 그리고 직접 데이터 포워딩이 사용되는 경우, 타겟 기지국에 의해 할당된 전송 계층 주 소는 소스 eNB에 의해 지원되어야 한다. 시스템 내 핸드오버 및 시스템 간 핸드오버 동안 간접 데이터 포워딩을 위해, 타겟 기지국에 의해 할당된 전송 계층 주소는 코어 네트워크 사용자 평면 엔티티에 의해 지원되어야 한다. 예를 들어, EPS에서 5GS로 시스템 간 핸드오버를 위해, 타겟 NG-RAN 노드에 의해 할당된 전송 계층 주소 는 UPF에 의해 지원되어야 한다. 실제 네트워크에서, 오퍼레이터는 eNB와 NG-RAN 노드에 상이한 IP 주소 공간을 할당할 수 있거나, X2-U와 XN-U에 상이한 IP 주소 공간을 할당할 수 있다. eNB는 X2 인터페이스를 지원한다. NG-RAN 노드는 Xn 인터페이스를 지원한다. 전송 계층 주소를 할당할 때, 타겟 기지국은 다음을 고려해야 함을 알 수 있다: 직접 데이터 포워딩인지 간접 데이터 포워딩인지 여부에 대한 정보; 및 시스템 내 핸드오버인지 시 스템 간 핸드오버인지 여부에 대한 정보. 타겟 기지국이, 사용자 평면과 제어 평면이 분리된 아키텍처이고 타겟 기지국의 중앙부 사용자 평면 엔티티가 위 정보를 모르는 경우, 할당된 전송 계층 주소 버전이 적절하지 않으면, 데이터 포워딩이 수행될 수 없어서, 데이터 손실 및 서비스 중단을 초래하는 것이 야기될 수 있다. 타겟 기지국이 이중 연결 모드이고 세컨더리 기지국이 위의 정보를 알지 못하는 경우, 할당된 전송 계층 주소 버전이 적절하지 않으면, 데이터 포워딩이 수행될 수 없어서, 데이터 손실 및 서비스 중단을 초래하는 것이 야 기될 수 있다. 문제 2 EPS(Evolved Packet System)에서 5G 시스템(5GS)으로 핸드오버하는 절차 동안, 직접 데이터 포워딩을 위해, 데 이터 포워딩 터널 정보는 각각의 E-RAB(Radio Access Bearer)별로 있다. 타겟 기지국은 하나의 E-RAB 터널에서 상이한 QoS flow의 데이터를 상이한 데이터 무선 베어러(DRB: Data Radio Bearer)에 매핑할 수 있다. 타겟 기지 국이, 사용자 평면과 제어 평면이 분리된 아키텍처인 경우, 하나의 DRB에 다수의 데이터 포워딩 터널을 할당하는 방법은 현재 해결되지 않은 문제이다. 문제 3 5GC에 연결된 MR-DC(Multi-Radio Dual Connectivity)에서 E-UTRAN으로의 시스템 간 핸드오버의 경우, 현재 소 스 세컨더리 기지국(SN)에서 타겟 기지국으로 직접 데이터 포워딩을 지원하는 방법에 대한 해결책이 없다. 구체 적으로, 타겟 기지국에 의해 할당되는 것은 E-RAB 별로 데이터 포워딩 터널이고, 소스 SN에 의해 설정되는 것은 QoS flow이 매핑되는 DRB이다. 소스 측의 QoS flow(들)에서 DRB(들)로의 매핑은 타겟 측의 QoS flow(들)에서 E-RAB(들)로의 매핑과 상이할 수 있고, 소스 SN은, QoS flow의 데이터가 타겟 기지국에 의해 할당된 데이터 포 워딩 터널의 어느 주소로 포워딩될 수 있는지 알지 못하고, 즉 소스 SN은, QoS flow이 매핑되는 E-RAB 아이덴티 티를 알지 못한다. 게다가, 소스 SN에서 종료되는 베어러의 경우, 시스템간 핸드오버(예를 들어, NG-RAN에서 E- UTRAN으로의 핸드오버)와 직접 데이터 포워딩을 위해, 소스 SN은 그 데이터를 타겟 기지국으로 포워딩하고 소스 SN에 의해 포워딩한 데이터는 PDCP 일련 번호(SN) 및 QoS flow 식별자(QFI: Flow Identifier)에 대한 정보를 포함하지 않거나, 소스 SN에 의해 포워딩된 데이터는 PDCP SN 및 SDAP(service data adaptation protocol) 헤 더에 대한 정보를 포함하지 않고; 그러나, 시스템 내 핸드오버의 경우, 데이터 무선 베어러(DRB) 터널에서 포워 딩되는 데이터는 PDCP SN 및 QFI에 대한 정보를 반송할 수 있다. 현재, SN은 시스템 내 핸드오버인지 시스템 간 핸드오버인지 알지 못한다. 문제 4 단일 연결에서 이중 연결로의 핸드오버를 위해, 소스 기지국과 타겟 마스터 기지국 간의 직접 데이터 포워딩 경 로는 이용 가능하지 않고, 소스 기지국과 타겟 세컨더리 기지국 간의 직접 데이터 포워딩 경로가 가능하다. 현 재, NG-RAN 노드에서 5GC에 연결된 MR-DC로의 시스템 간 핸드오버 및 NG-RAN 노드에서 E-UTRA(Evolved Universal Terrestrial Radio Access)와 NR(new radio)의 이중 연결(EN-DC)로의 시스템 간 핸드오버를 포함하 는, 소스 기지국에서 타겟 세컨더리 기지국으로 또는 소스 기지국에서 타겟 마스터 기지국으로의 직접 데이터 포워딩을 지원하는 방법에 대한 해결책이 없다. 본 개시내용은 핸드오버를 지원하는 방법을 제공한다. 이 방법을 사용하면, 시스템 내 핸드오버 및 시스템 간 핸드오버 동안 데이터 포워딩 문제가 해결되어, 데이터 손실을 방지할 수 있다. 추가로, 데이터 포워딩 터널 할 당 문제는 해결되어, 타겟 기지국은 적절한 데이터 포워딩 터널을 할당할 수 있고, 따라서 소스 기지국은 타겟 기지국에 의해 할당된 터널을 통해 QoS flow이 포워딩되는 데이터를 알 수 있고, 이에 의해 핸드오버 절차 동안 서비스의 연속성을 보장한다. 문제 1A: EPS(Evolved Packet System)에서 5G 시스템(5GS)으로의 핸드오버 절차에서, 소스 기지국은 eNB이고 타겟 기지 국은 gNB이다. 소스 기지국과 타겟 기지국 간의 데이터 포워딩은 직접 포워딩 또는 간접 포워딩으로 설정될 수 있다. 직접 포워딩으로 설정된 경우, 타겟 기지국은 소스 기지국과 연결된 하나 이상의 데이터 포워딩 터널 주 소를 생성해야 한다. 소스 기지국으로 전송된 데이터는 데이터 포워딩 터널을 통해 타겟 기지국으로 포워딩된다. 간접 포워딩으로 설정되는 경우, 타겟 기지국은 사용자 평면 기능 엔티티에 연결된 하나 이상의 데 이터 포워딩 터널 주소를 생성해야 한다. 소스 기지국으로 전송된 데이터는 소스 기지국과 사용자 평면 기능 엔 티티 사이의 데이터 포워딩 터널, 및 사용자 평면 기능 엔티티와 타겟 기지국 사이의 데이터 포워딩 터널을 통 해 타겟 기지국으로 포워딩된다. 소스 기지국 또는 사용자 평면 기능 엔티티는 IPv4 주소만, 또는 IPv6 주소만 또는 IPv4와 IPv6 주소 둘 모두를 지원할 수 있다. 타겟 기지국은 소스 기지국 또는 사용자 평면 기능 엔티티와 매칭하는 주소를 생성해야 한다. 타겟 기지국에서, IP 주소를 생성하는 기능은 CU-UP에 의해 수행된다. 그러나, 현재, CU-UP가 피어 노드에 의해 사용될 데이터 포워딩 터널의 IP 주소 버전을 알 수 있도록 하는 메커니즘이 없어서, CU-UP는 적절한 데이터 포 워딩 터널 주소를 생성할 수 없다. 핸드오버를 지원하는 방법은 하기 방법을 포함한다. 간접 포워딩으로 설정된 경우, 노드 1이 노드 간 인터페이스 메시지 1을 노드 2로 전송하고, 메시지가 하나의 피스의 정보를 포함한다. 이 정 보는 데이터 포워딩이 직접 포워딩으로 설정됨을 나타낸다. 메시지가 상기 정보를 포함하지 않으면, 데이터 포 워딩이 간접 포워딩으로 설정됨을 의미한다.또한, 이는, 그 정보가, 데이터 포워딩이 간접 포워딩으로 설정됨을 나타낼 수 있다. 메시지가 상기 정보를 포 함하지 않으면, 데이터 포워딩이 직접 포워딩으로 설정됨을 의미한다. 또한, 이는, 그 정보가, 데이터 포워딩이 간접 포워딩 또는 간접 포워딩으로 설정됨을 나타낼 수 있다. 노드 1은 노드 간 인터페이스 메시지 2를 노드 2로 전송하고 메시지는 업링크를 위한 데이터 터널 주소일 수 있 는 데이터 터널 주소를 포함한다. 메시지 2와 메시지 1은 동일하거나 상이할 수 있다. 메시지 2는 메시지 1 이 전 또는 이후에 전송될 수 있다. 노드 2가 메시지 1을 수신한 후, 노드 2는 데이터 포워딩이 직접 포워딩인지 간접 포워딩인지 여부를 결정할 수 있다. 노드 2가 메시지 2를 수신한 후, 데이터 터널 주소에 따라, 노드 2는 그 주소에 의해 사용된 IP 버전을 결정할 수 있다. 노드 2는 이 IP 버전과 매칭하는 데이터 포워딩 터널 주소를 생성할 수 있다. 노드 2는 노드 간 메시지 3을 노드 1에 전송하고, 이 메시지는 간접 포워딩을 위해 생성된 데이터 포워딩 터널 의 주소를 포함하고, 하나 이상의 주소가 있을 수 있다. 직접 포워딩으로 설정된 경우, 노드 2는 로컬 설정(예를 들어, O&M 설정)을 통해 피어 노드에 의해 사용하도록 셋업될 데이터 포워딩 터널의 IP 주소 버전을 알 수 있고, 이 정보에 따라 직접 포워딩을 위한 데이터 포워딩 터널 주소를 생성할 수 있다. 또는 노드 2는 다른 정보에 따라 자신의 재량에 따라 직접 포워딩을 위한 데이터 포워딩 터널 주소를 생성할 수 있다. 예를 들어, EPS에서 5GS로 핸드오버하는 시나리오에서, 소스 기지국은 4G에 속한 기지국인 eNB이고, 노드 2는 타겟 기지국의 CU-UP이고, 노드 2는 소스 기지국이 IPv4를 지원할 수 있어서, 노드 2에 의해 생성된 직접 포워딩을 위한 데이터 포워딩 터널 주소가 IPv4 주소라고 생각할 수 있다. 이 방법에서, 노드 1은 CU-CP이고 노드 2는 CU-UP일 수 있다. 노드 간 인터페이스는 E1 인터페이스일 수 있다. 노드 간 인터페이스가 E1 인터페이스인 경우, 노드 간 인터페이스 메시지는 다음 메시지 중 적어도 하나를 포함 하지만 이에 제한되지 않는다: 베어러 컨텍스트 셋업 요청, 베어러 컨텍스트 셋업 응답, 베어러 컨텍스트 수정 요청, 베어러 컨텍스트 수정 응답 및 새로 정의된 E1 인터페이스 메시지. 방법에 따르면, 노드 2는 피어 노드와 매칭하는 셋업될 데이터 포워딩 터널의 데이터 포워딩 터널 주소를 생성 하여, 데이터 포워딩이 적절히 작동할 수 있도록 보장할 수 있다. 문제 2A: EPS(Evolved Packet System)에서 5G 시스템(5GS)으로의 핸드오버 절차 동안, 소스 기지국은 eNB이고 타겟 기지 국은 gNB이다. 소스 기지국과 타겟 기지국 간의 데이터 포워딩은 직접 포워딩 또는 간접 포워딩으로 설정될 수 있다. 직접 포워딩으로 설정된 경우, 타겟 기지국은 소스 기지국과 연결된 하나 이상의 데이터 포워딩 터널 주 소를 생성해야 한다. 타겟 기지국은 소스 기지국의 다수의 데이터 무선 베어러(DRB)의 데이터를 타겟 기지국의 데이터 무선 베어러에 매핑하기로 정할 수 있다. 직접 포워딩으로 설정된 경우, 기존 메커니즘은 CU-UP을 인에이블하여 다수의 데이터 포워딩 터널에 사용될 수 있는 데이터 포워딩 터널 주소를 생성하는 방법의 문제를 해결할 수 없다. 핸드오버 지원을 위한 2개의 옵션이 있다. 옵션 1 노드 1은 노드 간 인터페이스 메시지 1을 노드 2로 전송하고, 메시지는 셋업에 필요한 데이터 무선 베어러(DRB) 목록을 포함한다. 목록은 셋업에 필요한 하나 이상의 DRB 정보를 포함한다. DRB 정보는 다음 정보 중 적어도 하 나를 포함하지만 이에 제한되지 않는다: - 예를 들어 DRB ID일 수 있는 데이터 무선 베어러 식별자, 또는 - 현재 DRB에 매핑되는 소스 기지국에 대한 DRB 데이터 포워딩 요청 목록. DRB 데이터 포워딩 요청 목록은 소스 기지국에 대한 하나 이상의 DRB 데이터 포워딩 요청 정보를 포함한다. DRB 데이터 포워딩 요청 정보는 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다:- 예를 들어 DRB ID일 수 있는 데이터 무선 베어러 식별자; - 데이터 포워딩이 업링크 데이터 포워딩, 다운링크 데이터 포워딩 또는 업링크 및 다운링크 데이터 포워딩에 적용됨을 나타내는 데이터 포워딩 요청; 또는 - 포워딩될 QoS 데이터 흐름에 대한 정보 목록. 포워딩될 QoS 데이터 흐름에 대한 정보 목록은 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다: - 예를 들어 QoS flow ID일 수 있는 QoS 데이터 흐름 식별자; 또는 - 데이터 흐름의 업링크 데이터, 다운링크 데이터 또는 업링크 및 다운링크 데이터가 현재 데이터 무선 베어러 에 매핑된다는 것을 나타내는 QoS 데이터 흐름 매핑 표시. 메시지 1에 따르면, 노드 2는 소스 기지국의 하나 이상의 DRB가 타겟 기지국의 하나의 DRB에 매핑되고, 데이터 포워딩이 필요함을 결정할 수 있다. 노드 2는 이러한 결정에 따라 타겟 기지국의 DRB에 대한 하나 이상의 데이 터 포워딩 터널 주소를 생성한다. 노드 2는 노드 간 인터페이스 메시지 2를 노드 1로 전송하고, 메시지는 성공적으로 셋업된 DRB 목록을 포함하고, 목록은 성공적으로 셋업된 하나 이상의 DRB에 대한 정보를 포함한다. 성공적으로 셋업된 DRB에 대한 정보는 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다: - 예를 들어 DRB ID일 수 있는 데이터 무선 베어러 식별자; 또는 - 현재 DRB에 매핑되는 소스 기지국에 대한 DRB 데이터 포워딩 응답 목록. 데이터 포워딩 응답 목록은 소스 기지국에 대한 하나 이상의 DRB 데이터 포워딩 응답에 대한 정보를 포함한다. DRB 데이터 포워딩 응답에 대한 정보는 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다: - 예를 들어 DRB ID일 수 있는 데이터 무선 베어러 식별자; - 업링크 데이터 포워딩 터널 주소; 또는 - 다운링크 데이터 포워딩 터널 주소. 터널 주소는 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다: - 전송 계층 주소, 예를 들어, IPv4 주소 또는 IPv6 주소; 또는 - 터널의 종점을 식별하기 위한 터널 종점 식별자. 이러한 방식으로, 노드 1은 타겟 기지국의 DRB에 매핑된 소스 기지국의 DRB의 하나 이상의 데이터 포워딩 터널 주소를 획득한다. 옵션 1의 장점은 소스 기지국의 각각의 DRB가 고유한 데이터 포워딩 터널 주소를 가지며, 이 는 타겟 기지국이 프로세싱하기에 편리하다는 것이다. 옵션 2 노드 1은 노드 간 인터페이스 메시지 1을 노드 2로 전송하고, 메시지는 셋업될 DRB 목록을 포함한다. 목록은 셋 업될 하나 이상의 DRB에 대한 정보를 포함한다. DRB에 대한 정보는 다음 정보 중 적어도 하나를 포함하지만 이 에 제한되지 않는다: - 예를 들어 DRB ID일 수 있는 데이터 무선 베어러 식별자; 또는 - DRB 데이터 포워딩 정보 요청. 데이터 포워딩 정보 요청은 데이터 포워딩 요청을 포함하고, 이는 데이터 포워딩이 업링크 데이터 포워딩, 다운 링크 데이터 포워딩 또는 업링크 및 다운링크 데이터 포워딩에 적용됨을 나타내고; 선택적으로, 이는 포워딩될 QoS 데이터 흐름에 대한 정보 목록을 또한 포함한다. 노드 2는 노드 간 인터페이스 메시지 2를 노드 1로 전송하고, 메시지는 성공적으로 셋업된 DRB 목록을 포함하고, 목록은 성공적으로 셋업된 DRB에 대한 하나 이상의 피스의 정보를 포함한다. 성공적으로 셋업된 DRB 에 대한 정보는 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다: - 예를 들어 DRB ID일 수 있는 데이터 무선 베어러 식별자; 또는 - DRB 데이터 포워딩 정보 응답. DRB 데이터 포워딩 정보 응답은 업링크 데이터 포워딩 터널 주소 및/또는 다운링크 데이터 포워딩 터널 주소를 포함한다. 노드 1이 CU-CP이고 노드 2가 CU-UP이면, CU-CP의 거동이 변경된다. CU-CP는 소스 기지국의 DRB와 타겟 기지국 의 DRB 간의 매핑 관계를 유지한다. CU-CP가, 예를 들어 EPS 시스템에서 5G 시스템으로 핸드오버의 절차 동안, 소스 기지국의 DRB와 대응 데이터 포워딩 터널을 다른 노드에게 알려야 할 때, CU-CP는 데이터 포워딩을 수락하 는 소스 기지국의 DRB와 대응 데이터 포워딩 터널에 대한 정보를 AMF에 전송하고, 소스 기지국의 다수의 DRB가 타겟 기지국의 하나의 DRB에 매핑되는 경우, CU-CP는 AMF로 전송되는 메시지에 소스 기지국의 다수의 DRB에 대 한 동일한 데이터 포워딩 터널 주소를 세팅해야 한다. 기존 메커니즘에서, 소스 기지국의 각각의 DRB는 고유한 데이터 포워딩 터널 주소를 가질 수 있다. 그러므로, 옵션 2는 CU-CP에 새로운 거동을 추가한다. 옵션 2는 CU- UP의 거동에 영향을 주지 않고, CU-CP와 CU-UP 간의 E1 기술 사양에도 영향을 주지 않는다는 장점을 갖는다. 이 방법에서, 노드 1은 CU-CP이고 노드 2는 CU-UP일 수 있다. 노드 간 인터페이스는 E1 인터페이스일 수 있다. 노드 간 인터페이스가 E1 인터페이스인 경우, 노드 간 인터페이스 메시지는 다음 메시지 중 적어도 하나를 포함 하지만 이에 제한되지 않는다: 베어러 컨텍스트 셋업 요청, 베어러 컨텍스트 셋업 응답, 베어러 컨텍스트 수정 요청, 베어러 컨텍스트 수정 응답 및 새로 정의된 E1 인터페이스 메시지. 이 방법에 따르면, 노드 2는 소스 기지국의 다수의 DRB에 대해 동일한 데이터 포워딩 터널 주소를 생성할 수 있 고, 노드 1은 소스 기지국의 다수의 DRB에 대해 동일한 데이터 포워딩 터널 주소를 셋업하고 이 정보를 다른 노 드에게 알릴 수 있고, 이에 의해 소스 기지국의 다수의 DRB가 타겟 기지국의 하나의 DRB에 매핑된 후 데이터 포 워딩이 적절하게 작동할 수 있는 것을 보장한다. 애플리케이션은 핸드오버를 지원하는 방법을 제공한다. 본 출원의 목적, 기술적 해결책 및 장점을 더 명확하게 하기 위해, 본 출원은 첨부된 도면과 실시예를 참조하여 더 상세히 설명될 것이다. 코어 네트워크 노드 간의 상 호작용 프로세스 같은 본 출원과 관련 없는 단계의 상세한 설명은 여기서 생략된다. 도 3은 본 개시내용의 제1 실시예의 개략도를 예시하고, 이는 주로 타겟 기지국의 관점에서 설명된다. 이는 다 음 단계를 포함한다. 단계에서, 타겟 기지국 중앙부-제어 평면 엔티티(CU-CP)는 코어 네트워크로부터 핸드오버 요청 메시지를 수신한다. 핸드오버 요청 메시지는 핸드오버 유형을 포함한다. 핸드오버 유형은 5G 시스템 내(Intra5GS) 핸드오 버, 5GS에서 EPS로의 핸드오버, EPS에서 5GS로의 핸드오버, 5GS에서 UTRA(Universal Terrestrial Radio Access)로의 핸드오버 등일 수 있다. 메시지는 데이터 포워딩이 가능하지 않다는 내용을 포함한다. 메시지는 또 한 직접 포워딩 경로 가용성에 대한 정보를 포함할 수 있다. EPS에서 5GS로의 핸드오버의 경우, 데이터 포워딩 이 가능한 경우(예를 들어 데이터 포워딩이 불가능하다는 정보 요소가 존재하지 않음), 직접 포워딩 경로 가용 성에 대한 정보의 부재는 간접 데이터 포워딩이 가능함을 의미한다. 메시지는 업링크 사용자 평면 전송 계층 주 소를 포함한다. 단계에서, 타겟 CU-CP는 메시지를 타겟 기지국 중앙부-사용자 평면 엔티티(CU-UP)에 전송한다. 메시지는 직접 데이터 포워딩에 대한 정보를 포함한다. 메시지는 또한 시스템 간 핸드오버에 대한 정보를 포함할 수 있다. 메시지는 또한 시스템 간 핸드오버 직접 데이터 포워딩에 대한 정보를 포함할 수 있다. 메시지는 또한 EPS에서 5GS로의 시스템 간 핸드오버의 직접 데이터 포워딩에 대한 정보를 포함할 수 있다. 타겟 CU-CP는 다음 을 포함하여 다양한 특정 방식으로 시스템 간 핸드오버 및/또는 직접 데이터 포워딩에 대한 정보를 타겟 CU- UP에 알릴 수 있다. - 방식 1: 시스템 간 핸드오버의 경우, 메시지는 직접 데이터 포워딩인지 간접 데이터 포워딩인지 여부의 표시 를 포함한다. 직접 데이터 포워딩인지 간접 데이터 포워딩인지 여부의 표시는 직접 데이터 포워딩 또는 간접 데 이터 포워딩일 수 있다. 시스템 내 핸드오버의 경우, 표시는 존재하지 않고; - 방식 2: 시스템 간 핸드오버 및 직접 데이터 포워딩의 경우, 메시지는 직접 포워딩 경로 가용성을 포함한다. 시스템 내 핸드오버 또는 시스템 간 핸드오버 및 간접 데이터 포워딩의 경우, 표시는 존재하지 않고; 및/또는 - 방식 3: 메시지는 시스템 간 핸드오버에 대한 정보와 직접 포워딩 경로 가용성에 대한 정보를 포함한다. 타겟 CU-UP이 시스템 간 핸드오버에 대한 정보와 직접 포워딩 경로 가용성에 대한 정보를 수신하면, CU-UP는 시스템 간 핸드오버를 위한 직접 데이터 포워딩임을 안다. 타겟 CU-UP이 시스템 간 핸드오버에 대한 정보를 수신하지만 직접 포워딩 경로 가용성에 대한 정보를 수신하지 못한 경우, CU-UP은 시스템 간 핸드오버를 위한 간접 데이터 포워딩임을 한다. 시스템 간 핸드오버에 대한 정보는 명시적이거나 암시적일 수 있다. 암시적인 방식은: CU- UP이, PDCP(Packet Data Convergence Protocol) SN(일련 번호)이 CU-CP로부터 폐기된다는 표시 정보를 수신할 때, 이것이 시스템 간 핸드오버를 의미하거나; 또는 CU-CP가 CU-UP으로부터 시스템 간 핸드오버를 위한 데이터 포워딩에 대한 정보를 요청하거나; 또는 CU-CP가 CU-UP로부터 E-UTRAN의 DRB로부터 데이터 포워딩 정보를 요청 하는 것을 포함한다. 본 개시내용의 주요 내용에 영향을 미치지 않는 다른 구체적인 방법이 있을 수 있다. 메시지는 베어러 컨텍스트 셋업 요청 메시지일 수 있거나 베어러 컨텍스트 수정 요청 메시지일 수 있다. 메시지 는 데이터 포워딩 정보 요청을 포함한다. 메시지는 업링크 사용자 평면 전송 계층 주소를 포함한다. 단계에서, 타겟 CU-UP은 단계의 메시지를 수신한다. 타겟 CU-CP가 데이터 포워딩 터널 정보를 요청하 면, 타겟 CU-UP은 요청에 따라 대응 데이터 포워딩 터널 정보를 할당한다. 데이터 포워딩 터널 정보는 TEID와 전송 계층 주소를 포함한다. 타겟 CU-UP이 시스템 간 핸드오버 또는 EPS에서 5GS로의 핸드오버 및 직접 데이터 포워딩에 대한 정보를 수신하면, 타겟 CU-UP은 대응 소스 기지국에 의해 지원되는 전송 계층 주소 버전을 할당 하거나 소스 기지국을 위해 예약된 전송 계층 주소 공간으로부터 전송 계층 주소를 할당한다. 예를 들어, EPS에서 5GS로의 시스템 간 핸드오버와 직접 데이터 포워딩을 위해, 타겟 CU-UP은 전송 계층 주소 버전이나 eNB 또는 X2-U에 대한 주소 공간을 할당한다. 타겟 CU-UP은 O&M(Operation and Maintenance) 설정에 따라 소스 기지국이나 소스 eNB 또는 X2-U에 의해 지원되는 전송 계층 주소 버전을 알거나; 또는 타겟 CU-UP은 O&M 설정에 따라 소스 기지국이나 소스 eNB 또는 X2-U를 위해 예약된 전송 계층 주소 공간을 안다. 시스템 간 핸드오버를 위한 간접 데이터 포워딩을 위해, 타겟 CU-UP은 수신된 NG 업링크(UL) 사용자 평면(UP)의 전송 계층 주소에 대한 정보에 따라 UPF에 의해 지원되는 전송 계층 주소 버전을 알고, 이어서 대응 버전에 전송 계층 주 소를 할당한다. 타겟 CU-UP에 의해 수신된 NG UL UP의 전송 계층 주소가 IPv4 및 IPv6의 주소를 포함하는 경우, 타겟 CU-UP은 타겟 CU-UP 자체에 의해 지원되는 전송 계층 주소 버전에 따라 대응 버전의 사용자 데이터 포워딩 의 전송 계층 주소를 할당한다. 시스템 내 핸드오버를 위해, 타겟 CU-UP은 시스템에서 지원되는 전송 계층 주소 버전에 따라 데이터 포워딩을 위한 전송 계층 주소를 할당한다. 타겟 CU-UP은 O&M 설정에 따라 시스템에서 지원되는 전송 계층 주소 버전을 안다. 타겟 CU-CP가 시스템 간 핸드오버 및/또는 직접 데이터 포워딩에 대한 정보를 타겟 CU-UP에게 알릴 수 있는 방 식 2에 대응하여, 시스템 간 핸드오버 및 직접 데이터 포워딩의 경우, 타겟 CU-UP은 대응 소스 기지국에 의해 지원되는 전송 계층 주소 버전을 할당하거나 소스 기지국을 위해 예약된 전송 계층 주소 공간에서 전송 계층 주 소를 할당하고, 이는 위와 동일하므로 여기서 반복되지 않을 것이다. 시스템 간 핸드오버 또는 시스템 내 핸드 오버를 위한 간접 데이터 포워딩에 대응하여, 타겟 CU-UP은 기존 방식으로 데이터 포워딩을 위한 전송 계층 주 소를 할당한다. 타겟 CU-UP은 시스템에서 지원되는 전송 계층 주소 버전에 따라 데이터 포워딩을 위한 전송 계 층 주소를 할당한다. 타겟 CU-UP은 O&M 설정에 따라 시스템에서 지원되는 전송 계층 주소 버전을 안다. 단계에서, 타겟 CU-UP은 할당된 데이터 포워딩 터널에 대한 정보를 타겟 CU-CP로 전송한다. 메시지는 베어 러 컨텍스트 셋업 응답 메시지일 수 있거나 베어러 컨텍스트 수정 응답 메시지일 수 있다. 타겟 CU-CP는 데이터 포워딩 터널 정보를 코어 네트워크 또는 소스 기지국으로 전송한다. 시스템 간 핸드오버를 위해, 타겟 CU-CP는 데이터 포워딩 터널 정보를 포함하는 핸드오버 요청 확인응답 메시지를 코어 네트워크로 전 송한다. 타겟 CU-CP는 코어 네트워크를 통해 데이터 포워딩 터널 정보를 소스 기지국으로 전송한다. 시스템 내 핸드오버를 위해, 타겟 CU-CP는 기지국 간 인터페이스(예를 들어, Xn)를 통해 소스 기지국으로 데이터 포워딩 터널 정보를 전송할 수 있다. 소스 기지국은 수신된 데이터 포워딩 터널 정보에 따라 타겟 CU-UP으로 데이터를 포워딩한다. 데이터 포워딩 터 널 정보의 전송 계층 주소가 소스 기지국에 의해 사용되는 전송 계층 주소 버전과 매칭하므로, 데이터 포워딩은 적절하게 수행될 수 있다. 따라서, 사용자 데이터가 손실되지 않고 사용자 경험이 손상되지 않는 것이 보장된다. 지금까지, 본 개시내용의 제1 실시예의 설명이 완료되었다. 이 방법으로, 타겟 기지국이 적절한 데이터 포워딩 터널 정보를 할당하여, 데이터 포워딩이 적절하게 수행되는 것을 보장하고, 핸드오버 절차 동안 데이터 손실을 줄이고, 핸드오버 성능을 향상시킨다. 제2 실시예는 핸드오버가 EPS 시스템에서 5G 시스템으로 이루어지고 소스 기지국에서 타겟 기지국으로의 데이터 포워딩이 직접 포워딩으로 설정된 경우를 설명한다. 도 4는 다음 단계를 포함하는 제2 실시예의 개략도를 예시한다. 단계에서, eNB는 S1 메시지(Handover Required)를 MME로 전송한다. 메시지는 핸드오버 유형에 대한 정보를 포함하고, 이는 이 핸드오버가 EPS 시스템에서 5G 시스템(EPSto5GS)으로의 핸드오버임을 나타낸다. MME는 재배 치 요청 메시지를 AMF에게 전송한다. 단계에서, AMF는 Ng 메시지(Handover Request)를 gNB-CU-CP로 전송한다. 메시지는 핸드오버 유형에 대한 정보와 셋업이 필요한 PDU 세션에 대한 정보 목록을 포함하고, 목록은 PDU 세션에 대한 하나 이상의 피스의 정 보를 포함한다. PDU 세션에 대한 정보는 업링크 데이터 터널의 주소와 셋업에 필요한 QoS flow에 대한 정보 목 록을 포함한다. 단계에서, gNB-CU-CP는 E1 메시지(BEARER CONTEXT SETUP REQUEST)를 gNB-CU-UP으로 전송한다. 메시지는 gNB-CU-CP가 gNB-CU-UP을 셋업하는 데 필요한 PDU 세션에 대한 정보 목록을 포함하고, 목록은 하나 이상의 PDU 세션에 대한 정보를 포함한다. PDU 세션에 대한 정보는 단계에서 반송되는 업링크 데이터 터널의 주소와 gNB-CU-CP가 gNB-CU-UP을 셋업하기 위해 요구하는 DRB에 대한 정보 목록을 포함한다. PDU 세션에 대한 정보는 또한 직접 포워딩 경로 가용성에 대한 정보를 포함한다. DRB 정보 목록은 하나 이상의 DRB에 대한 정보를 포함 하고, 이는 DRB 데이터 포워딩 정보 요청을 포함한다. gNB-CU-UP은 데이터 포워딩 터널 주소가 DRB 데이터 포워딩 정보 요청에 대한 정보에 따라 DRB에 대해 생성되어 야 함을 결정하고 데이터 포워딩이 직접 포워딩 경로 가용성에 대한 정보에 따라 직접 포워딩임을 결정한다. gNB -CU-UP은 IPv4나 IPv6 같은 O&M 설정을 통해 데이터 포워딩 터널 주소의 IP 주소 버전을 정하고, 이어서 eNB에 의해 사용되는 IP 버전과 매칭하는 데이터 포워딩 터널 주소를 생성한다. 단계에서, gNB-CU-UP은 E1 메시지(BEARER CONTEXT SETUP RESPONSE)를 gNB-CU-CP로 전송한다. 메시지는 성 공적으로 셋업된 PDU 세션에 대한 정보 목록을 포함하고, 목록은 하나 이상의 PDU 세션에 대한 정보를 포함한다. PDU 세션 정보는 성공적으로 셋업된 DRB에 대한 정보 목록을 포함한다. DRB에 대한 정보 목록은 하나 이상의 DRB에 대한 정보를 포함하고, 정보는 다운링크 데이터를 포워딩하기 위한 데이터 포워딩 터널 주소를 포 함한다. 단계에서, gNB-CU-CP는 메시지 Ng(HANDOVER REQUEST ACKNOWLEDGE)를 AMF로 전송한다. 메시지는 gNB-CU-CP 에 의해 수락된 PDU 세션 정보 목록을 포함하고, 목록은 gNB-CU-CP에 의해 수락된 하나 이상의 PDU 세션에 대한 정보를 포함한다. PDU 세션에 대한 정보는 gNB-CU-CP가 데이터 포워딩을 수락하는 하나 이상의 E-RAB에 대한 정 보를 포함하는 데이터 포워딩 응답 E-RAB 목록을 포함한다. E-RAB에 대한 정보는 E-RAB ID와 대응 E-RAB에 대응 하는 다운링크 데이터를 포워딩하는 데이터 포워딩 터널 주소를 포함한다. AMF는 재배치 응답 메시지를 MME에게 전송한다. 단계에서, MME는 S1 메시지(HANDOVER COMMAND)를 eNB에 전송한다. 메시지는 데이터를 포워딩하는 E-RAB에 대한 정보 목록을 포함하고, 정보는 E-RAB ID와 E-RAB에 대응하는 다운링크 데이터를 포워딩하는 데이터 포워딩 터널 주소를 포함한다. 이런 방식으로, eNB는 단계에서 표시된 데이터 포워딩 터널 주소에 따라 gNB-CU-UP으로 데이터를 포워딩한 다. 데이터 포워딩 터널 주소가 eNB에 의해 사용되는 IP 버전과 매칭하므로, 데이터 포워딩은 적절하게 수행될 수 있다. 따라서, 사용자 데이터가 손실되지 않고 사용자 경험이 손상되지 않는 것이 보장된다. 제3 실시예는 핸드오버가 EPS 시스템에서 5G 시스템으로 이루어지고 소스 기지국에서 타겟 기지국으로의 데이터 포워딩이 간접 포워딩으로 설정된 경우를 설명한다. 도 5는 다음 단계를 포함하는 제3 실시예의 개략도를 예시한다. 단계에서, eNB는 S1 메시지(Handover Required)를 MME로 전송한다. 메시지는 핸드오버 유형에 대한 정보를 포함하고, 이는 이 핸드오버가 EPS 시스템에서 5G 시스템(EPSto5GS)으로의 핸드오버임을 나타낸다. MME는 재배 치 요청 메시지를 AMF에게 전송한다.단계에서, AMF는 Ng 메시지(Handover Request)를 gNB-CU-CP로 전송한다. 메시지는 핸드오버 유형에 대한 정보와 셋업을 요청한 PDU 세션에 대한 자원 정보 목록을 포함하고, 목록은 하나 이상의 PDU 세션에 대한 자원 정보를 포함한다. PDU 세션에 대한 자원 정보는 업링크 데이터 터널 주소와 셋업을 요청한 QoS flow에 대한 정 보 목록을 포함한다. 단계에서, gNB-CU-CP는 BEARER CONTEXT SETUP REQUEST를 gNB-CU-UP으로 전송한다. 메시지는 gNB-CU-CP가 gNB-CU-UP을 셋업하는 데 필요한 PDU 세션에 대한 정보 목록을 포함하고, 목록은 하나 이상의 PDU 세션에 대한 정보를 포함한다. PDU 세션에 대한 정보는 이전 단계에서 반송되는 업링크 데이터 터널 주소와 gNB-CU-CP가 gNB-CU-UP을 셋업하기 위해 요청하는 DRB에 대한 정보 목록을 포함한다. 셋업될 DRB에 대한 정보 목록은 DRB 데 이터 포워딩 정보 요청을 포함한다. gNB-CU-UP은 데이터 포워딩 터널 주소가 DRB 데이터 포워딩 정보 요청 정보에 따라 이 DRB에 대해 생성되어야 하는 것을 결정한다. 그러나, PDU 세션에 대한 정보는 직접 포워딩 경로 가용성 정보를 포함하지 않고, 이에 기 반하여, gNB-CU-UP은 데이터 포워딩이 간접 포워딩으로 설정되어 있다고 결정하여, 데이터는 UPF+PGW-U 노드를 통해 gNB-CU-UP로 포워딩되어야 한다. gNB-CU-UP은 업링크 데이터 터널 주소에 따라 IPv4 또는 IPv6 같은 UPF+PGW-U 노드에 의해 지원되는 IP 버전을 결정하고, 이어서 데이터 gNB-CU-UP 노드에 의해 사용되는 IP 버전 과 매칭하는 데이터 포워딩 터널 주소를 생성할 수 있다. 단계에서, gNB-CU-UP은 E1 메시지(BEARER CONTEXT SETUP RESPONSE)를 gNB-CU-CP로 전송한다. 메시지는 성 공적으로 셋업된 PDU 세션에 대한 정보 목록을 포함하고, 목록은 하나 이상의 PDU 세션에 대한 정보를 포함한다. PDU 세션에 대한 정보는 성공적으로 셋업된 DRB에 대한 정보 목록을 포함한다. DRB에 대한 정보 목록 은 다운링크 데이터를 포워딩하기 위한 데이터 포워딩 터널 주소를 포함한다. 단계에서, gNB-CU-CP는 Ng 메시지(HANDOVER REQUEST ACKNOWLEDGE)를 AMF로 전송한다. 메시지는 gNB-CU-CP 에 의해 수락된 PDU 세션에 대한 정보 목록을 포함하고, 목록은 gNB-CU-CP에 의해 수락된 하나 이상의 PDU 세션 에 대한 정보를 포함한다. PDU 세션에 대한 정보는 gNB-CU-CP가 데이터 포워딩을 수락하는 하나 이상의 E-RAB에 대한 정보를 포함하는 데이터 포워딩 응답 E-RAB 목록을 포함한다. E-RAB에 대한 정보는 E-RAB ID와 대응 E-RAB 에 대응하는 다운링크 데이터를 포워딩하는 데이터 포워딩 터널 주소를 포함한다. AMF는 재배치 응답 메시지를 MME에게 전송한다. 단계에서, MME는 S1 메시지(HANDOVER COMMAND)를 eNB에 전송한다. 메시지는 데이터를 포워딩하는 E-RAB에 대한 정보 목록을 포함하고, 정보는 E-RAB ID와 E-RAB에 대응하는 다운링크 데이터를 포워딩하는 데이터 포워딩 터널 주소를 포함한다. 이런 방식으로, eNB는 UPF+PGW-U 노드로 데이터를 포워딩하고, 이어서 UPF+PGW-U 노드는 gNB-CU-UP으로 데이터 를 포워딩한다. gNB-CU-UP의 데이터 포워딩 터널 주소가 UPF+PGW-U 노드에 의해 사용되는 IP 버전과 매칭하므로, 데이터 포워딩은 적절하게 수행될 수 있다. 따라서, 사용자 데이터가 손실되지 않고 사용자 경험이 손상되지 않는 것이 보장된다. 제4 실시예는 핸드오버가 EPS 시스템에서 5G 시스템으로 이루어지고, 소스 기지국에서 타겟 기지국으로의 데이 터 포워딩이 직접 포워딩이고, 소스 기지국의 다수의 DRB가 타겟 기지국의 하나의 DRB에 매핑되는 경우를 설명 한다. 도 6은 본 개시내용의 제4 실시예의 개략도를 예시하고, 이는 주로 타겟 기지국의 관점에서 설명된다. 이는 다 음 단계를 포함한다. 단계에서, 타겟 기지국 중앙부-제어 평면 엔티티(CU-CP)는 코어 네트워크로부터 핸드오버 요청 메시지를 수신한다. 핸드오버 요청 메시지는 핸드오버 유형을 포함한다. 핸드오버 유형은 5G 시스템 내(Intra5GS) 핸드오 버, 5GS에서 EPS로의 핸드오버, EPS에서 5GS로의 핸드오버, 5GS에서 UTRA(Universal Terrestrial Radio Access)로의 핸드오버 등일 수 있다. 메시지는 데이터 포워딩이 불가능하다는 내용을 포함한다. 메시지는 또한 직접 포워딩 경로 가용성에 대한 정보를 포함할 수 있다. EPS에서 5GS로의 핸드오버의 경우, 데이터 포워딩이 가능한 경우(예를 들어 데이터 포워딩이 불가능하다는 정보 요소가 존재하지 않음), 직접 포워딩 경로 가용성에 대한 정보의 부재는 간접 데이터 포워딩이 가능함을 의미한다. 메시지는 PDU 세션 자원 셋업 목록을 포함한다. PDU 세션 자원 셋업 정보에 포함된 PDU 세션 자원 셋업 요청 전 송은 셋업될 QoS flow 목록을 포함한다. 셋업될 QoS flow은 QoS flow 식별자와 QoS flow에 대응하는 E-RAB(Enhanced Access Bearer) 식별자를 포함한다. 메시지는 E-RAB 정보 목록을 포함한다. E-RAB 정보는 E-RAB 식별자와 다운링크 포워딩을 포함하고, 다운링크 포 워딩은 소스 기지국에 의해 제공되는 E-RAB에 대한 다운링크 데이터 포워딩을 의미한다. 단계에서, 타겟 CU-CP는 타겟 기지국 중앙부-사용자 평면 엔티티(CU-UP)에 메시지를 전송한다. 메시지는 베어러 컨텍스트 셋업 요청 메시지일 수 있다. CU-CP는 PDU 세션의 QoS flow에서 DRB로의 매핑을 정한다. 메시 지는 셋업될 DRB 목록을 포함한다. 셋업될 DRB 목록은 DRB 식별자와 타겟 측 DRB에 매핑되는 QoS flow에 대한 정보를 포함한다. 소스 기지국이 E-RAB의 다운링크 데이터 포워딩을 요청하는 경우, 셋업될 DRB에 대한 정보는 E-UTRAN으로부터 DRB 데이터 포워딩 정보 요청에 대한 정보 목록을 포함한다. E-UTRAN으로부터의 DRB 데이터 포 워딩 정보 요청에 대한 정보는 데이터 포워딩 요청과 포워딩 터널에서 포워딩되는 QoS flow 목록을 포함한다. 데이터 포워딩 요청은 업링크, 다운링크 또는 업링크 및 다운링크일 수 있다. 시스템 간 핸드오버의 경우, 데이 터 포워딩은 다운링크이다. E-UTRAN으로부터의 DRB 데이터 포워딩 정보 요청은 각각의 터널에 매핑된 하나 이상 의 QoS flow을 포함하여, 하나의 DRB에 대해 요청된 다수의 데이터 포워딩 터널에 대한 정보를 포함하고, 이는 본 개시내용의 주요 내용에 영향을 주지 않고 다른 이름이 될 수 있다. 셋업될 DRB 정보에 E-UTRAN으로부터의 DRB 데이터 포워딩 정보 요청 정보 목록의 포함은, 소스 측에서 상이한 E-RAB에 매핑된 다수의 QoS flow이 타겟 측에서 동일한 DRB에 매핑되는 경우, E1 인터페이스에서 E-RAB별로 데 이터 포워딩 터널을 할당하는 방법의 문제를 해결할 수 있다. 문제를 해결하면서, 셋업될 DRB와 병렬로 목록을 재정의하고, 2개의 목록을 연관시키는 복잡성을 줄이는 것을 방지하여, CU-UP 측의 프로세싱을 단순화하고 구현 의 복잡성을 줄일 수 있다. 단계에서, 타겟 CU-UP은 단계의 메시지를 수신한다. 타겟 CU-CP가 E-UTRAN으로부터 DRB 데이터 포워 딩 터널 정보를 요청하면, 타겟 CU-UP은 요청에 따라 대응 데이터 포워딩 터널 정보를 할당한다. 타겟 CU-UP은 수신된 정보에 따라 데이터 포워딩 터널 정보를 할당한다. 데이터 포워딩 터널 정보는 TEID와 전송 계층 주소를 포함한다. 데이터 포워딩 터널 정보는 E-RAB에 따른다. 단계에서, 타겟 CU-UP은 할당된 데이터 포워딩 터널에 대한 정보를 타겟 CU-CP로 전송한다. 메시지는 베어 러 컨텍스트 셋업 응답 메시지일 수 있거나 베어러 컨텍스트 수정 요청 메시지일 수 있다. 메시지는 PDU 세션 자원 셋업 응답 목록을 포함한다. PDU 세션 자원 셋업 정보는 셋업될 DRB 목록을 포함한다. 셋업될 DRB에 대한 정보는 DRB 식별자를 포함한다. 셋업될 DRB에 대한 정보는 또한 E-UTRAN으로부터의 DRB 데이 터 포워딩 응답에 대한 정보 목록을 포함할 수 있다. E-UTRAN으로부터의 DRB 데이터 포워딩 응답에 대한 정보는 데이터 포워딩 정보를 포함한다. 데이터 포워딩 정보는 TEID와 전송 계층 주소를 포함한다. E-UTRAN으로부터의 DRB 데이터 포워딩 응답에 대한 정보는 하나의 DRB에 할당된 다수의 데이터 포워딩 터널에 대한 정보를 포함하 고, 이는 본 개시내용의 주요 내용에 영향을 주지 않고 다른 명칭이 될 수 있다. 셋업될 DRB 정보에 E-UTRAN으로부터의 DRB 데이터 포워딩 응답에 대한 정보 목록의 포함은, 소스 측에서 상이한 E-RAB에 매핑된 다수의 QoS flow이 타겟 측에서 동일한 DRB에 매핑되는 경우, E1 인터페이스에서 E-RAB별로 데 이터 포워딩 터널을 할당하는 방법의 문제를 해결할 수 있다. 문제를 해결하면서, 셋업될 DRB와 병렬로 목록을 재정의하고, 2개의 목록을 연관시키는 복잡성을 줄이는 것을 방지하여, CU-UP 측의 프로세싱을 단순화하고 구현 의 복잡성을 줄일 수 있다. 타겟 CU-CP는 데이터 포워딩 터널 정보를 코어 네트워크 또는 소스 기지국으로 전송한다. 시스템 간 핸드오버를 위해, 타겟 CU-CP는 핸드오버 요청 확인응답 메시지를 코어 네트워크로 전송하고, 메시지는 데이터 포워딩 터널 정보를 포함한다. 타겟 CU-CP는 코어 네트워크를 통해 데이터 포워딩 터널 정보를 소스 기지국으로 전송한다. 시스템 내 핸드오버를 위해, 타겟 CU-CP는 기지국 간 인터페이스(예를 들어, Xn)를 통해 소스 기지국으로 데이 터 포워딩 터널 정보를 전송할 수 있다. 소스 기지국은 수신된 데이터 포워딩 터널 정보에 따라 타겟 CU-UP으로 데이터를 포워딩한다. 소스 기지국은 기 존 방식으로 데이터를 포워딩한다. 지금까지, 본 개시내용의 제4 실시예의 설명이 완료되었다. 이 방법으로, 타겟 기지국이 적절한 데이터 포워딩 터널 정보를 할당하고, 이는 데이터 포워딩이 적절하게 수행되는 것을 보장하고, 핸드오버 절차 동안 데이터 손 실을 줄이고, 핸드오버 성능을 향상시키고, eNB에 대한 영향을 줄이고, CU-CP 및 CU-UP의 프로세싱 복잡성을 줄 인다.도 7은 다음 단계를 포함하는 제5 실시예의 개략도를 예시한다. 단계에서, eNB는 S1 메시지(Handover Required)를 MME로 전송한다. 메시지는 핸드오버 유형에 대한 정보를 포함하고, 이는 이 핸드오버가 EPS 시스템에서 5G 시스템(EPSto5GS)으로의 핸드오버임을 나타낸다. MME는 재배 치 요청 메시지를 AMF에게 전송한다. 단계에서, AMF는 Ng 메시지(Handover Request)를 gNB-CU-CP로 전송한다. 메시지는 핸드오버 유형에 대한 정보와 셋업을 요청한 PDU 세션에 대한 정보 목록을 포함하고, 목록은 하나 이상의 PDU 세션에 대한 정보를 포 함한다. PDU 세션에 대한 정보는 업링크 데이터 터널 주소와 셋업을 요구한 QoS flow에 대한 정보 목록을 포함 한다. 단계에서, 하나 이상의 PDU 세션의 경우, gNB-CU-CP는 소스 기지국의 다수의 DRB를 타겟 측의 하나의 DRB 에 매핑하기로 정한다. gNB-CU-CP는 E1 메시지(BEARER CONTEXT SETUP REQUEST)를 gNB-CU-UP으로 전송한다. 메시지는 gNB-CU-CP가 gNB- CU-UP을 셋업하는 데 필요한 PDU 세션에 대한 정보 목록을 포함하고, 목록은 하나 이상의 PDU 세션에 대한 정보 를 포함한다. PDU 세션에 대한 정보는 이전 단계에서 반송되는 업링크 데이터 터널 주소와 gNB-CU-CP가 gNB-CU- UP을 셋업하기 위해 요청하는 DRB에 대한 정보 목록을 포함한다. PDU 세션에 대한 정보는 또한 직접 포워딩 경 로 가용성인 하나의 정보 요소를 포함한다. DRB에 대한 정보 목록은 하나 이상의 DRB에 대한 정보를 포함하고, 이는 DRB 데이터 포워딩 요청을 포함한다. DRB 데이터 포워딩 요청 목록은 소스 기지국에 대한 하나 이상의 DRB 데이터 포워딩 요청에 대한 정보를 포함한 다. DRB 데이터 포워딩 요청에 대한 정보는 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다: 예를 들어 소스 기지국의 DRB의 DRB ID일 수 있는 무선 베어러 식별자; 데이터 포워딩이 업링크 데이터 포워딩, 다운링크 데이터 포워딩 또는 업링크 및 다운링크 데이터 포워딩에 적 용됨을 나타내는 데이터 포워딩 요청; 또는 포워딩될 QoS 데이터 흐름에 대한 정보 목록. 포워딩될 QoS 데이터 흐름에 대한 정보 목록은 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다: 예를 들어 QoS flow ID일 수 있는 QoS 데이터 흐름 식별자; 또는 데이터 흐름의 업링크 데이터, 다운링크 데이터 또는 업링크 및 다운링크 데이터가 현재 데이터 무선 베어러에 매핑된다는 것을 나타내는 QoS 데이터 흐름 매핑 표시. 단계에서, gNB-CU-UP은 다수의 데이터 포워딩 터널 주소가 DRB에 대한 정보에, DRB 데이터 포워딩 요청 목 록에 대한 요청 정보에 따라 DRB에 대해 생성되어야 함을 결정하고, 데이터 포워딩이 직접 포워딩 경로 가용성 정보에 따라 직접 포워딩으로 설정됨을 결정한다. gNB-CU-UP은 E1 메시지(BEARER CONTEXT SETUP RESPONSE)를 gNB-CU-CP로 전송한다. 메시지는 성공적으로 셋업된 PDU 세션에 대한 정보 목록을 포함하고, 목록은 하나 이상의 PDU 세션에 대한 정보를 포함한다. PDU 세션에 대 한 정보는 성공적으로 셋업된 DRB에 대한 정보 목록을 포함한다. DRB에 대한 정보 목록은 하나 이상의 DRB에 대 한 정보를 포함하고, DRB에 대한 정보는 DRB 데이터 포워딩 응답 목록을 포함한다. DRB 데이터 포워딩 응답 목록은 소스 기지국에 대한 하나 이상의 DRB 데이터 포워딩 응답에 대한 정보를 포함한 다. DRB 데이터 포워딩 응답에 대한 정보는 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다: - 예를 들어 소스 기지국의 DRB의 DRB ID일 수 있는 무선 베어러 식별자; - 업링크 데이터 포워딩 터널 주소; 또는 - 다운링크 데이터 포워딩 터널 주소. 터널 주소는 다음 정보 중 적어도 하나를 포함하지만 이에 제한되지 않는다: - 전송 계층 주소, 예를 들어, IPv4 주소 또는 IPv6 주소; 또는 - 터널의 종점을 식별하기 위한 터널 종점 식별자. 단계에서, gNB-CU-CP는 메시지 Ng(HANDOVER REQUEST ACKNOWLEDGE)를 AMF로 전송한다. 메시지는 gNB-CU-CP 에 의해 수락된 PDU 세션에 대한 정보 목록을 포함하고, 목록은 gNB-CU-CP에 의해 수락된 하나 이상의 PDU 세션 에 대한 정보를 포함한다. PDU 세션에 대한 정보는 gNB-CU-CP가 데이터 포워딩을 수락하는 하나 이상의 E-RAB에 대한 정보를 포함하는 데이터 포워딩 응답 E-RAB 목록을 포함한다. E-RAB에 대한 정보는 E-RAB ID와 대응 E-RAB 에 대응하는 다운링크 데이터를 포워딩하는 데이터 포워딩 터널 주소를 포함한다. 여기서 E-RAB는 소스 기지국 에 대한 DRB이다. AMF는 재배치 응답 메시지를 MME에게 전송한다. 단계에서, MME는 S1 메시지(HANDOVER COMMAND)를 eNB에 전송한다. 메시지는 데이터를 포워딩하는 E-RAB에 대한 정보 목록을 포함하고, 정보는 E-RAB ID와 E-RAB에 대응하는 다운링크 데이터를 포워딩하는 데이터 포워딩 터널 주소를 포함한다. 이런 방식으로, eNB는 단계에서 표시된 데이터 포워딩 터널 주소에 따라 gNB-CU-UP으로 데이터를 포워딩한 다. gNB-CU-UP은 데이터 포워딩이 적절하게 수행될 수 있는 것을 보장하기 위해, 상이한 데이터 포워딩 터널에 따라 데이터를 대응 DRB에 매핑한다. 따라서, 사용자 데이터가 손실되지 않고 사용자 경험이 손상되지 않는 것 이 보장된다. 제6 실시예는 핸드오버가 EPS 시스템에서 5G 시스템으로 이루어지고, 소스 기지국에서 타겟 기지국으로의 데이 터 포워딩이 직접 포워딩이고, 소스 기지국의 다수의 DRB가 타겟 기지국의 하나의 DRB에 매핑되는 다른 경우를 설명한다. 도 8은 다음 단계를 포함하는 제6 실시예의 개략도를 예시한다. 단계에서, eNB는 S1 메시지(Handover Required)를 MME로 전송한다. 메시지는 핸드오버 유형에 대한 정보를 포함하고, 이는 이 핸드오버가 EPS 시스템에서 5G 시스템(EPSto5GS)으로의 핸드오버임을 나타낸다. MME는 재배 치 요청 메시지를 AMF에게 전송한다. 단계에서, AMF는 Ng 메시지(Handover Request)를 gNB-CU-CP로 전송한다. 핸드오버 요청 메시지는 핸드오 버 유형을 포함한다. 핸드오버 유형은 5G 시스템 내(Intra5GS) 핸드오버, 5GS에서 EPS로의 핸드오버, EPS에서 5GS로의 핸드오버, 5GS에서 UTRA(Universal Terrestrial Radio Access)로의 핸드오버 등일 수 있다. 메시지는 데이터 포워딩이 불가능하다는 내용을 포함한다. 메시지는 또한 정보 직접 포워딩 경로 가용성을 포함할 수 있 다. EPS에서 5GS로의 핸드오버의 경우, 데이터 포워딩이 가능한 경우(예를 들어, 데이터 포워딩이 가능하지 않 다는 정보 요소가 존재하지 않음), 정보 직접 포워딩 경로 가용성의 부재는 간접 데이터 포워딩이 가능함을 의 미한다. 메시지는 PDU 세션 자원 셋업 목록을 포함한다. PDU 세션 자원 셋업 정보에 포함된 PDU 세션 자원 셋업 요청 전 송은 셋업될 QoS flow 목록을 포함한다. 셋업될 QoS flow은 QoS flow 식별자와 QoS flow에 대응하는 E- RAB(Enhanced Access Bearer) 식별자를 포함한다. 메시지는 E-RAB 정보 목록을 포함한다. E-RAB 정보는 E-RAB 식별자와 다운링크 포워딩을 포함하고, 다운링크 포 워딩은 소스 기지국에 의해 제공되는 E-RAB에 대한 다운링크 데이터 포워딩을 의미한다. 단계에서, 타겟 CU-CP는 메시지를 타겟 기지국 중앙부-사용자 평면 엔티티(CU-UP)에 전송한다. 메시지는 베어러 컨텍스트 셋업 요청 메시지일 수 있다. CU-CP는 PDU 세션의 QoS flow에서 DRB로의 매핑을 정한다. 메시 지는 셋업될 DRB 목록을 포함한다. 셋업될 DRB 목록은 DRB 식별자와 타겟 측 DRB에 매핑되는 QoS flow(들)에 대 한 정보를 포함한다. 소스 기지국이 E-RAB에 대한 다운링크 데이터 포워딩을 요청하는 경우, 셋업될 DRB에 대한 정보는 DRB 데이터 포워딩 정보 요청에 대한 정보를 포함한다. DRB 데이터 포워딩 정보 요청에 대한 정보는 데 이터 포워딩 요청과 포워딩 터널에서 포워딩되는 QoS flow 목록을 포함한다. 소스 측에서 상이한 E-RAB에 매핑 되는 다수의 QoS flow이 타겟 측의 동일한 DRB에 매핑되면, QoS flow 목록은 DRB에 매핑되는 모든 QoS flow에 대한 정보를 포함한다. 데이터 포워딩 요청은 업링크, 다운링크 또는 업링크 및 다운링크일 수 있다. 시스템 간 핸드오버의 경우, 데이터 포워딩은 다운링크이다. 단계에서, 타겟 CU-UP은 할당된 데이터 포워딩 터널에 대한 정보를 타겟 CU-CP로 전송한다. 메시지는 베어 러 컨텍스트 셋업 응답 메시지일 수 있거나 베어러 컨텍스트 수정 응답 메시지일 수 있다. 메시지는 PDU 세션 자원 셋업 응답 목록을 포함한다. PDU 세션 자원 셋업 정보는 셋업될 DRB 목록을 포함한다. 셋업될 DRB에 대한 정보는 DRB 식별자를 포함한다. 셋업될 DRB에 대한 정보는 또한 DRB 데이터 포워딩 응답에 대한 정보를 포함할 수 있다. DRB 데이터 포워딩 응답에 대한 정보는 데이터 포워딩 정보를 포함한다. 데이터 포워딩 정보는 TEID와 전송 계층 주소를 포함한다.단계에서, gNB-CU-CP는 Ng 메시지(HANDOVER REQUEST ACKNOWLEDGE)를 AMF로 전송한다. 메시지는 gNB-CU-CP 에 의해 수락된 PDU 세션에 대한 정보 목록을 포함하고, 목록은 gNB-CU-CP에 의해 수락된 하나 이상의 PDU 세션 에 대한 정보를 포함한다. PDU 세션에 대한 정보는 타겟 기지국이 데이터 포워딩을 수락하는 하나 이상의 E-RAB 에 대한 정보를 포함하는 데이터 포워딩 응답 E-RAB 목록을 포함한다. E-RAB에 대한 정보는 E-RAB ID와 E-RAB와 대응하는 데이터 포워딩 터널에 대한 정보를 포함한다. 소스 측에서 상이한 E-RAB에 매핑되는 다수의 QoS flow이 타겟 측의 동일한 DRB에 매핑되면, 타겟 CU-CP는 타겟 CU-UP로부터 DRB에 대한 데이터 포워딩 터널 정보를 수신한다. CU-CP는 DRB에 매핑된 QoS flow이 소스 측에서 매핑되는 다수의 E-RAB에 대한 데이터 포워딩 응답 E-RAB 정보에 데이터 포워딩 터널 정보를 포함한다. 예를 들 어, QoS flow1은 소스 측 E-RAB1에 매핑되고, QoS flow2는 소스 측 E-RAB2에 매핑되고, QoS flow1과 QoS flow2 는 타겟 측의 하나의 DRB에 매핑된다. CU-CP가 CU-UP으로부터 DRB의 데이터 포워딩 터널 정보를 수신하면, CU- CP는 E-RAB1 및 E-RAB2의 데이터 포워딩 응답 E-RAB 정보에 DRB의 데이터 포워딩 터널 정보를 포함한다. 이것은 E1 인터페이스에서 E-RAB별로 데이터 포워딩 터널을 할당하는 방법의 문제를 해결할 수 있다. 문제를 해 결하면서, E1 및 NG 인터페이스 사양에 영향을 주지 않고, CU-UP에 영향을 주지 않고, 다양한 상황에서 데이터 포워딩을 지원하고, 데이터 손실을 줄일 수 있다. AMF는 재배치 응답 메시지를 MME에게 전송한다. 단계에서, MME는 S1 메시지(HANDOVER COMMAND)를 eNB에 전송한다. 메시지는 데이터를 포워딩하는 E-RAB 요청에 대한 정보 목록을 포함하고, 정보는 E-RAB ID와 E-RAB에 대응하는 다운링크 데이터를 포워딩하는 데이터 포워딩 터널 주소를 포함한다. 소스 기지국은 수신된 데이터 포워딩 터널 정보에 따라 타겟 CU-UP으로 데이터를 포워딩한다. 소스 기지국은 기 존 방식으로 데이터를 포워딩한다. 소스 측에서 상이한 E-RAB에 매핑되는 다수의 QoS flow이 타겟 측에서 동일 한 DRB에 매핑되는 경우, 소스 기지국은 상이한 E-RAB에 매핑된 QoS flow의 데이터를 타겟 CU-UP의 동일한 DRB 의 저장장치에 전송하고, 데이터는 동일한 DRB를 프로세싱하여 분배부(DU)를 통해 데이터를 UE에 전송된다. 이는, 소스 측에서 상이한 E-RAB에 매핑된 다수의 QoS flow이 타겟 측에서 동일한 DRB에 매핑되는 경우, E1 인 터페이스에서 E-RAB별로 데이터 포워딩 터널을 할당하는 방법의 문제를 해결할 수 있다. 문제를 해결하면서, E1 및 NG 인터페이스 사양에 영향을 주지 않고, CU-UP에 영향을 주지 않고, 다양한 상황에서 데이터 포워딩을 지원 하고, 데이터 손실을 줄일 수 있다. 지금까지, 본 개시내용의 제6 실시예의 설명이 완료되었다. 이 방법으로, 데이터 포워딩 터널 정보는 정확하게 할당 및 송신될 수 있고, 이는 데이터 포워딩이 적절하게 수행되는 것을 보장하고, 핸드오버 절차 동안 데이터 손실을 줄이고, 핸드오버 성능을 향상시키고, eNB에 대한 영향을 줄이고, CU-CP 및 CU-UP의 프로세싱 복잡성을 줄인다. 도 9는 제7 실시예의 개략도를 예시한다. 이 실시예에서, 소스 마스터 기지국은 QoS flow에 대응하는 E-RAB 아 이덴티티, 데이터 포워딩을 위해 수락된 QoS flow 목록, 데이터 포워딩 터널 정보 및 핸드오버 유형 중 적어도 하나를 소스 세컨더리 기지국에 전송하고; 소스 세컨더리 기지국은 데이터 포워딩을 위해 수락된 QoS flow 목록 및 QoS flow에 대응하는 E-RAB 아이덴티티 중 적어도 하나에 따라 데이터 포워딩 터널에서 데이터를 포워딩해야 하는 QoS flow을 안다. 핸드오버 유형이 시스템 간 핸드오버인지 5G 시스템(5GS)에서 EPS(Evolved Packet System)로의 핸드오버인지 여부에 따라, 소스 세컨더리 기지국은 시스템 간 핸드오버임을 알고, 따라서 포워딩 되는 PDCP SDU(service data unit) 데이터 패킷에, PDCP SN 및 QFI 정보를 포함하지 않거나, PDCP SN 및 SDAP 헤더 정보를 포함하지 않는다. QFI 정보가 데이터 패킷에 포함되어 있지 않다는 것은 SDAP 헤더 정보가 포함되 지 않는다는 것을 의미하는 데, 그 이유는 QFI가 있는 경우에만, SDAP 헤더에 다른 정보가 존재해야 하기 때문 이고; 아래에도 동일하게 적용된다. 실시예는 다음 단계를 포함한다. 단계에서, 마스터 기지국(MN)은 PDU(protocol data unit) 세션 자원 셋업 요청에 대한 정보를 수신한다. 마스터 기지국은 코어 네트워크로부터 PDU 세션 자원 셋업 요청에 대한 정보를 수신한다. PDU 세션 자원 셋업 요청에 대한 정보는 초기 컨텍스트 셋업 요청 메시지, PDU 세션 자원 셋업 요청 메시지, 핸드오버 요청 메시지 또는 다른 메시지를 통해 수신될 수 있다. PDU 세션 자원 셋업 요청에 대한 정보는 PDU 세션 식별자 및 셋업될 QoS flow에 대한 정보 목록 중 적어도 하나를 포함한다. 셋업될 QoS flow에 대한 정보는 QoS flow 식별자(QFI) 및 QoS flow이 매핑되는 E-RAB 아이덴티티 중 적어도 하나를 포함한다. 단계에서, 마스터 기지국은 PDU 세션에서 셋업될 QoS flow이 매핑된 E-RAB 아이덴티티를 세컨더리 기지국 (SN)으로 전송한다. 마스터 기지국은 셋업될 QoS flow이 매핑된 E-RAB 아이덴티티를 SN 추가 요청, SN 수정 요청 또는 다른 메시지를 통해 SN에 전송할 수 있다. SN은 셋업될 QoS flow이 매핑되는 E-RAB 아이덴티티를 포함 하여, 셋업될 QoS flow에 대한 정보를 저장한다. 본 실시예의 방법에서, 마스터 기지국은 PDU 세션 자원 셋업 절차 동안 QoS flow이 매핑된 E-RAB 아이덴티티를 세컨더리 기지국으로 전송할 수 있거나; 또는 마스터 기지국이 핸드오버 절차 동안 데이터 포워딩을 위해 수락 된 QoS flow 목록과 데이터 포워딩 터널 정보를 세컨더리 기지국으로 전송할 때 QoS flow이 매핑되는 E-RAB 아 이덴티티를 포함하고(단계); 마스터 기지국은 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보에 QoS flow에 대응하는 QoS flow 식별자 및 E-RAB 아이덴티티를 포함할 수 있다. 마스터 기지국이 핸드오버 절차에서 QoS flow이 매핑된 E-RAB 아이덴티티를 세컨더리 기지국으로 전송하는 방법에 대응하여, 단계는 필요하지 않다. 단계에서, 마스터 기지국은 UE에 대한 핸드오버를 개시한다. 마스터 기지국은 데이터 포워딩 터널 정보를 수신한다. 직접 데이터 포워딩의 경우, 데이터 포워딩 터널 정보는 타겟 기지국에 의해 할당된 E-RAB별 데이터 포워딩 터널에 대한 정보이다. 마스터 기지국은 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보 목록을 수 신하고, 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보는 QoS flow 식별자를 포함한다. 마스터 기지국은 데이터 포워딩 터널 정보와 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보 목록을 SN으로 전송한다. QoS flow에 대한 정보는 QoS flow 식별자를 포함한다. QoS flow에 대한 정보는 또한 QoS flow이 매핑되는 E-RAB 아 이덴티티를 포함할 수 있고, 마스터 기지국은 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보에 QoS flow에 대응하는 E-RAB 아이덴티티 및 QoS flow 식별자를 포함할 수 있다. 마스터 기지국은 핸드오버 유형을 SN으로 전송한다. 핸드오버 유형은 시스템 간 핸드오버 또는 시스템 내 핸드 오버, 또는 5GS에서 EPS로의 핸드오버 또는 시스템 내(5GS) 핸드오버일 수도 있다. 마스터 기지국과 타겟 기지 국 간 및/또는 세컨더리 기지국과 타겟 기지국 간 직접 데이터 포워딩인 경우, 마스터 기지국은 핸드오버 유형 을 SN으로 전송한다. SN과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능한 경우, 마스터 기지국은 수 신된 데이터 포워딩 터널 정보, QoS flow에 대응하는 E-RAB 아이덴티티 및/또는 핸드오버 유형을 SN으로 전송한 다. SN과 타겟 기지국 간 직접 데이터 포워딩 경로가 이용 가능하지 않은 경우, 마스터 기지국은 마스터 기지국 과 SN 간 데이터 포워딩 터널에 대한 정보를 할당하고, 마스터 기지국에 의해 할당된 데이터 포워딩 터널에 대 한 정보를 SN에 전송한다. 단계에서, SN은 대응 데이터 포워딩 터널로 데이터를 포워딩한다. SN에서 종료된 베어러에 대응하여, SN은 데이터를 타겟 기지국으로 직접 포워딩한다. SN과 타겟 기지국 사이의 직접 데이터 포워딩 경로가 이용 가능한 경우, SN은 데이터를 타겟 기지국으로 직접 포워딩한다. QoS flow이 매핑된 E-RAB 아이덴티티에 따라, SN은 QoS flow의 데이터를 대응 E-RAB 터널로 전송하기 위해, 각각의 QoS flow의 데이터를 어떤 E-RAB 터널로 포워딩해야 하는지를 안다. 시스템 간 핸드오버를 위해, SN은 포워딩되는 데이터 패킷에 PDCP SN 및 QFI 정보를 포함하지 않거나, PDCP SN 및 SDAP 헤더 정보를 포함하지 않는다. 핸드오버 유형의 수신 또는 데이터 포워딩을 위해 수락 된 QoS flow에 대응하는 E-RAB 아이덴티티의 수신에 따라, SN은 시스템 간 핸드오버임을 안다. 이러한 데이터 송신 방법은 SN이 직접 타겟 기지국으로 데이터를 포워딩하는 방식 또는 SN이 마스터 기지국을 통해 타겟 기지 국으로 데이터를 포워딩하는 방식에 적합하다. SN과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하지 않은 경우, SN은 마스터 기지국을 통해 타겟 기지국으로 데이터를 포워딩한다. SN이 마스터 기지국으로 데이터를 포워딩하고, 이어서 데이터가 마스터 기지국에 의해 타겟 기지국으로 포워딩 되는 데이터 포워딩 방법에 대해, 본 개시내용의 다른 구현은: SN이 시스템 내 핸드오버 및 시스템 간 핸드오버 사이를 구별하지 못하고; SN이 데이터를 마스터 기지국으로 포워딩하고; 데이터 패킷이 PDCP SN 및 QFI 정보 또 는 PDCP SN 및 SDAP 헤더 정보를 포함할 수 있고; 마스터 기지국이 시스템 간 핸드오버임을 알고; SN으로부터 포워딩된 데이터를 수신한 후, 마스터 기지국이 데이터 패킷에서 PDCP SN 및 QFI 정보 또는 PDCP SN 및 SDAP 헤 더 정보를 제거하고; 이어서 데이터 패킷을 타겟 기지국으로 전송하는 것이다. 이 데이터 포워딩 방법에 대응하 여, SN과 타겟 기지국 간의 직접 포워딩 경로가 이용 가능하지 않은 경우, 마스터 기지국은 핸드오버 유형을 S- SN으로 전송할 필요가 없다. 지금까지, 본 개시내용의 제7 실시예의 설명이 완료되었다. 이 방법으로, MR-DC에서 EPC로의 핸드오버 절차 동 안 SN에서 타겟 기지국으로의 직접적인 데이터 포워딩은 지원될 수 있고, 데이터는 대응 데이터 포워딩 터널로 올바르게 포워딩될 수 있고, 이는 데이터 포워딩이 적절하게 수행되고, 핸드오버 절차 동안 데이터 손실을 줄이 고 핸드오버 성능을 향상시키는 것을 보장한다.도 10은 제8 실시예의 개략도를 예시한다. 이 실시예에서, 소스 마스터 기지국(S-MN)은 QoS flow에 대응하는 E- RAB 아이덴티티, 데이터 포워딩을 위해 수락된 QoS flow 목록, 데이터 포워딩 터널 정보 및 핸드오버 유형 중 적어도 하나를 소스 세컨더리 기지국에 전송하고; 소스 세컨더리 기지국은 데이터 포워딩을 위해 수락된 QoS flow 목록 및 QoS flow에 대응하는 E-RAB 아이덴티티 중 적어도 하나에 따라 데이터 포워딩 터널에서 데이터를 포워딩해야 하는 QoS flow을 안다. 핸드오버 유형이 시스템 간 핸드오버인지 5G 시스템(5GS)에서 EPS(Evolved Packet System)로의 핸드오버인지 여부에 따라, 소스 세컨더리 기지국은 시스템 간 핸드오버임을 알고, 따라서 포워딩되는 PDCP SDU 데이터 패킷에 PDCP SN 및 QFI 정보를 포함하지 않거나, PDCP SN 및 SDAP 헤더 정보를 포 함하지 않는다. 본 개시내용과 관련 없는 단계의 설명은 여기서 생략된다. 이 실시예는 다음 단계를 포함한다. 단계에서, 마스터 기지국은 PDU(protocol data unit) 세션 자원 셋업 요청에 대한 정보를 수신한다. 마스 터 기지국은 코어 네트워크로부터 PDU 세션 자원 셋업 요청에 대한 정보를 수신한다. PDU 세션 자원 셋업 요청 에 대한 정보는 초기 컨텍스트 셋업 요청 메시지, PDU 세션 자원 셋업 요청 메시지, 핸드오버 요청 메시지 또는 다른 메시지를 통해 수신될 수 있다. PDU 세션 자원 셋업 요청에 대한 정보는 AMF에 의해 전송된 메시지에서 수 신된다. 정보는 SMF에 의해 AMF를 통해 마스터 기지국으로 투명하게 전송된다. PDU 세션 자원 셋업 요청에 대한 정보는 PDU 세션 식별자 및 셋업될 QoS flow에 대한 정보 목록을 포함한다. 셋업될 QoS flow에 대한 정보는 QoS flow 식별자(QFI) 및 QoS flow이 매핑되는 E-RAB 아이덴티티를 포함한다. 도면에서, 마스터 기지국은, 마스터 기지국이 후속 핸드오버 절차와 관련하여 UE에 대한 소스 마스터 기지국의 기능을 수행하는 것을 예시하기 위해, 소스 마스터 기지국(S-MN)으로서 설명된다. 단계에서, 마스터 기지국은 PDU 세션에서 셋업될 QoS flow이 매핑된 E-RAB 아이덴티티를 세컨더리 기지국 (SN)으로 전송한다. 도면에서, 세컨더리 기지국은 소스 세컨더리 기지국(S-SN)으로 설명되어, 세컨더리 기지국 이 후속 핸드오버 절차와 관련하여 UE에 대한 소스 세컨더리 기지국의 기능을 수행하는 것을 예시한다. 마스터 기지국은 셋업될 QoS flow이 매핑된 E-RAB 아이덴티티를 SN 추가 요청, SN 수정 요청 또는 다른 메시지를 통해 SN에 전송할 수 있다. SN은 셋업될 QoS flow이 매핑되는 E-RAB 아이덴티티를 포함하여, 셋업될 QoS flow에 대한 정보를 저장한다. 본 실시예의 방법에서, 마스터 기지국은 PDU 세션 자원 셋업 절차 동안 QoS flow이 매핑된 E-RAB 아이덴티티를 세컨더리 기지국으로 전송할 수 있거나; 또는 마스터 기지국이 핸드오버 절차 동안 데이터 포워딩을 위해 수락 된 QoS flow 목록과 데이터 포워딩 터널 정보를 세컨더리 기지국으로 전송할 때 QoS flow이 매핑되는 E-RAB 아 이덴티티를 포함할 수 있다(단계). 마스터 기지국은 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보 에 QoS flow 식별자 및 QoS flow에 대응하는 E-RAB 아이덴티티를 포함할 수 있다. 마스터 기지국이 핸드오버 절 차에서 QoS flow이 매핑된 E-RAB 아이덴티티를 세컨더리 기지국으로 전송하는 방법에 대응하여, 단계는 필요하지 않다. 단계에서, S-MN은 UE에 대한 핸드오버를 개시한다. S-MN은 핸드오버 요구 메시지를 AMF에게 전송한다. 메 시지는 S-SN의 식별자를 포함한다. S-SN의 식별자는 핸드오버 요구 메시지 내 소스-대-타겟 투명 컨테이너에 포 함될 수 있다. 단계에서, AMF는 재배치 요청 메시지를 MME에게 전송한다. 단계에서, MME는 핸드오버 요청 메시지를 타겟 기지국 eNB로 전송한다. 단계에서, E-RAB가 다운링크 데이터 포워딩을 위해 수락되는 경우, eNB는 다운링크 데이터 포워딩 터널에 대한 정보를 할당한다. 다운링크 데이터 포워딩 터널에 대한 정보는 E-RAB에 따른다. 다운링크 데이터 포워딩 터널에 대한 정보는 전송 계층 주소와 터널 종점 식별자(예를 들어, TEID)를 포함한다. eNB가 S-SN의 식별자를 수신하면, eNB는 eNB와 S-SN 간의 직접 포워딩 경로가 이용 가능한지 여부를 결정한다. eNB는 핸드오버 요청 확인응답 메시지를 MME에게 전송한다. 메시지는 다운링크 데이터 포워딩을 위해 eNB에 의 해 할당된 데이터 포워딩 터널에 대한 정보를 포함한다. 메시지에는 eNB와 S-SN 간의 직접 포워딩 경로가 이용 가능하다는 정보를 포함한다. eNB와 S-SN 간 직접 포워딩 경로가 이용 가능하다는 정보는 타겟-대-소스 투명 컨 테이너에 포함될 수 있다. 단계에서, MME는 재배치 응답 메시지를 AMF에게 전송한다. 메시지는 데이터 포워딩 터널 정보를 포함한다. 직접 데이터 포워딩을 위해, 데이터 포워딩 터널 정보는 다운링크 데이터 포워딩을 위해 eNB에 의해 할당된 데이터 포워딩 터널에 대한 정보를 포함한다. 간접 데이터 포워딩을 위해, MME는 UPF와 SGW 간에 사용되 는 데이터 포워딩 터널에 대한 정보를 할당하도록 SGW에 요청하고, 데이터 포워딩 터널에 대한 정보는 SGW에 의해 할당되는 SGW와 UPF 간에 사용되는 데이터 포워딩 터널 정보를 포함한다. 단계에서, AMF는 핸드오버 커맨드 메시지를 S-MN으로 전송한다. 메시지는 데이터 포워딩 터널 정보와 데 이터 포워딩을 위해 수락되는 QoS flow에 대한 정보 목록을 포함한다. 직접 데이터 포워딩을 위해, 데이터 포워 딩 터널 정보는 MME로부터 AMF에 의해 수신된 다운링크 데이터 포워딩을 위한 데이터 포워딩 터널에 대한 정보 이고, 다운링크 데이터 포워딩을 위한 데이터 포워딩 터널에 대한 정보는 타겟 eNB에 의해 할당된다. 간접 데이 터 포워딩을 위해, 터널에 대한 정보는 소스 기지국으로부터 SMF 또는 UPF에 의해 할당된 UPF로 데이터를 포워 딩하기 위한 데이터 포워딩 터널에 대한 정보이다. 단계에서, S-MN은 데이터 포워딩 터널 정보를 수신한다. 직접 데이터 포워딩의 경우, 데이터 포워딩 터널 정보는 타겟 기지국에 의해 할당된 E-RAB별 데이터 포워딩 터널에 대한 정보이다. 간접 데이터 포워딩을 위해, 터널에 대한 정보는 소스 기지국으로부터 SMF 또는 UPF에 의해 할당된 UPF로 데이터를 포워딩하기 위한 데이터 포워딩 터널에 대한 정보이다. S-MN은 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보 목록을 수신하고, 데 이터 포워딩을 위해 수락된 QoS flow에 대한 정보는 QoS flow 식별자를 포함한다. S-MN에서 종료된 베어러의 경우, S-MN은 데이터를 포워딩한다. 직접 데이터 포워딩을 위해, S-MN은 QoS flow이 매핑된 E-RAB 아이덴티티에 따라 QoS flow의 데이터를 대응 E-RAB 데이터 포워딩 터널로 포워딩한다. 간접 데이 터 포워딩의 경우, S-MN은 수신된 데이터 포워딩 터널 정보에 따라 데이터를 포워딩하고, 예를 들어 S-MN은 수 신된 PDU 세션 데이터 포워딩 터널 또는 DRB 데이터 포워딩 터널에 따라 데이터를 포워딩한다. S-SN에서 종료되는 베어러의 경우, 마스터 기지국은 데이터 포워딩 터널 정보와 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보 목록을 SN으로 전송한다. QoS flow에 대한 정보는 QoS flow 식별자를 포함한다. QoS flow에 대한 정보는 또한 QoS flow이 매핑되는 E-RAB 아이덴티티를 포함할 수 있고, 마스터 기지국은 데이터 포 워딩을 위해 수락된 QoS flow에 대한 정보에 QoS flow에 대응하는 E-RAB 아이덴티티 및 QoS flow 식별자를 포함 할 수 있다. 마스터 기지국은 또한 핸드오버 유형을 S-SN으로 전송할 수 있고, 핸드오버 유형에 대한 구체적인 정보는 단계의 정보와 동일하고, 여기서 반복되지 않을 것이다. 마스터 기지국과 타겟 기지국 간 및/또는 세컨더리 기지국과 타겟 기지국 간 직접 데이터 포워딩인 경우, 마스 터 기지국은 핸드오버 유형을 SN으로 전송한다. S-SN과 eNB 간의 직접 데이터 포워딩 경로가 이용 가능한 경우, S-MN은 수신된 데이터 포워딩 터널 정보, QoS flow에 대응하는 E-RAB 아이덴티티 및/또는 핸드오버 유형을 S-SN 으로 전송한다. S-MN은 S-SN과 eNB 간의 직접 데이터 포워딩 경로가 O&M(운영 및 유지 관리) 설정에 따라 이용 가능한지 여부를 알거나; 또는 S-MN이 eNB와 S-SN 가용성 사이의 직접 데이터 포워딩 경로에 대한 정보를 수신 하면, S-SN과 eNB 사이의 직접 데이터 포워딩 경로는 이용 가능하고; S-MN은 또한 S-SN과 eNB 사이의 직접 데이 터 포워딩 경로가 본 개시내용의 주요 내용에 영향을 주지 않고 다른 방식에 따라 이용 가능한지 여부를 알 수 있다. S-SN은 데이터를 eNB로 직접 포워딩한다. S-SN은 QoS flow의 데이터를 대응 E-RAB 데이터 포워딩 터널로 포워딩 한다. QoS flow이 매핑된 E-RAB 아이덴티티에 따라, SN은 QoS flow의 데이터를 대응 E-RAB 터널로 전송하기 위 해, 각각의 QoS flow의 데이터를 어떤 E-RAB 터널로 포워딩해야 하는지를 안다. 시스템 간 핸드오버를 위해, SN 은 포워딩되는 데이터 패킷에 PDCP SN 및 QFI 정보를 포함하지 않거나, PDCP SN 및 SDAP 헤더 정보를 포함하지 않는다. 핸드오버 유형의 수신 또는 데이터 포워딩을 위해 수락된 QoS flow에 대응하는 E-RAB 아이덴티티의 수신에 따라, SN은 시스템 간 핸드오버임을 안다. 데이터 전송 방법은 S-SN이 직접 타겟 기지국으로 데이터를 포워딩하 는 방식 또는 S-SN이 S-MN을 통해 타겟 기지국으로 데이터를 포워딩하는 방식에 적합하다. S-SN이 S-MN에 데이터를 포워딩하고 이어서 데이터가 S-MN에 의해 eNB에 포워딩되는 데이터 포워딩 방법에 관해, 본 개시내용의 다른 구현은: S-SN이 시스템 내 핸드오버 및 시스템 간 핸드오버 사이를 구별하지 못하고; S-SN이 데이터를 S-MN으로 포워딩하고; 데이터 패킷이 PDCP SN 및 QFI 정보 또는 PDCP SN 및 SDAP 헤더 정보를 포함할 수 있고; S-MN이 그것이 시스템 간 핸드오버임을 알고; S-SN으로부터 포워딩된 데이터를 수신한 후, S- MN이 데이터 패킷으로부터 PDCP SN과 QFI 정보 또는 PDCP SN과 SDAP 헤더 정보를 제거하고, 이어서 데이터 패킷 을 타겟 기지국으로 전송하는 것이다. 이 데이터 포워딩 방법에 대응하여, S-SN과 타겟 기지국 간의 직접 포워 딩 경로가 이용 가능하지 않은 경우, S-MN은 핸드오버 유형을 S-SN으로 전송할 필요가 없다. S-SN과 eNB 사이의 직접 데이터 포워딩 경로가 이용 가능하지 않은 경우, S-MN은 S-MN과 S-SN 사이에 사용되는 데이터 포워딩 터널을 할당하고, S-MN은 S-MN에 의해 할당된 데이터 포워딩 터널에 대한 정보를 S-SN으로 전송한다. S-SN은 S-MN으로 데이터를 포워딩하고, 데이터는 S-MN을 통해 eNB로 포워딩된다. 지금까지, 본 개시내용의 제8 실시예의 설명이 완료되었다. 이 방법으로, MR-DC에서 EPC로의 핸드오버 절차 동 안 SN에서 타겟 기지국으로의 직접적인 데이터 포워딩은 지원될 수 있고, 데이터는 대응 데이터 포워딩 터널로 올바르게 포워딩될 수 있고, 이는 데이터 포워딩이 적절하게 수행되고, 핸드오버 절차 동안 데이터 손실을 줄이 고 핸드오버 성능을 향상시키는 것을 보장한다. 도 11은 제9 실시예의 개략도를 예시한다. 이 실시예에서, 소스 마스터 기지국은 데이터 포워딩을 위해 수락된 QoS flow의 목록 및 QoS flow에 대응하는 E-RAB 아이덴티티에 따라 각각의 데이터 포워딩 터널에 대한 데이터를 포워딩해야 하는 하나 이상의 QoS flow을 알고; 소스 마스터 기지국은 데이터 포워딩 터널에서 포워딩되어야 하 는 하나 이상의 QoS flow 및 데이터 포워딩 터널 정보를 세컨더리 기지국으로 전송한다. 이 실시예는 다음 단계 를 포함한다. 단계에서, 마스터 기지국은 UE에 대한 핸드오버를 개시한다. 마스터 기지국은 데이터 포워딩 터널 정보를 수신한다. 직접 데이터 포워딩의 경우, 데이터 포워딩 터널 정보는 타겟 기지국에 의해 할당된 E-RAB별 데이터 포워딩 터널에 대한 정보이다. 마스터 기지국은 데이터 포워딩을 위 해 수락된 QoS flow에 대한 정보 목록을 수신하고, 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보는 QoS flow 식별자를 포함한다. 마스터 기지국은 핸드오버 커맨드 메시지 또는 다른 메시지를 통해 코어 네트워크로부 터 데이터 포워딩 터널 정보 및 데이터 포워딩을 위해 수락된 QoS flow 정보 목록을 수신할 수 있다. 마스터 기지국은 데이터 포워딩 터널 정보와 터널에서 포워딩된 하나 이상의 QoS flow을 SN으로 전송한다. 마스 터 기지국은 또한 핸드오버 유형을 SN으로 전송할 수 있고, 핸드오버 유형에 대한 구체적인 정보는 단계의 정보와 동일하고, 여기서 반복되지 않을 것이다. 마스터 기지국과 타겟 기지국 간 및/또는 세컨더리 기지국과 타겟 기지국 간 직접 데이터 포워딩인 경우, 마스터 기지국은 핸드오버 유형을 SN으로 전송한다. PDU 세션 셋업 절차 동안, 마스터 기지국은 코어 네트워크로부터 셋업될 QoS flow에 대응하는 E-RAB 식별자를 수신하고, 구체적인 방법은 단계와 동일하고, 여기서 반복되지 않을 것이다. 마스터 기지국은 데이터 포워 딩을 위해 수락된 QoS flow 목록과 각각의 QoS flow에 대응하는 E-RAB 아이덴티티에 따라 각각의 E-RAB의 데이 터 포워딩 터널에서 데이터를 포워딩해야 하는 하나 이상의 QoS flow을 안다. SN과 타겟 기지국 사이의 직접 데이터 포워딩 경로가 이용 가능한 경우, 마스터 기지국은 수신된 데이터 포워딩 터널 정보를 SN으로 전송한다. SN과 타겟 기지국 간 직접 데이터 포워딩 경로가 이용 가능하지 않은 경우, 마스 터 기지국은 마스터 기지국과 SN 간에 사용된 데이터 포워딩 터널에 대한 정보를 할당하고, 마스터 기지국에 의 해 할당된 데이터 포워딩 터널에 대한 정보를 SN에 전송한다. 단계에서, SN은 대응 데이터 포워딩 터널로 데이터를 포워딩한다. SN에서 종료되는 베어러의 경우, SN과 타겟 기지국 사이의 직접 데이터 포워딩 경로가 이용 가능하면, SN은 데이터를 타겟 기지국으로 직접 포워딩한 다. 단계에서 마스터 기지국으로부터 수신된 정보에 따라, SN은 각각의 QoS flow의 데이터를 어느 E-RAB 터널로 포워딩해야 하는지를 알고, QoS flow의 데이터를 대응 E-RAB 채널로 전송한다. SN과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하지 않은 경우, SN은 마스터 기지국을 통해 타겟 기지국으로 데이터를 포 워딩한다. 시스템 간 핸드오버를 위해, SN은 포워딩되는 데이터 패킷에 PDCP SN 및 QFI 정보를 포함하지 않거나, PDCP SN 및 SDAP 헤더 정보를 포함하지 않는다. 핸드오버 유형의 수신에 따라, SN은 핸드오버가 시스템 간 핸드오버임을 알거나; 또는 데이터 포워딩 터널에서 데이터를 포워딩해야 하는 하나 이상의 QoS flow에 대한 정보의 수신에 따라, SN은 핸드오버가 시스템 간 핸드오버임을 안다. 이러한 데이터 송신 방법은 SN이 직접 타 겟 기지국으로 데이터를 포워딩하는 방식 또는 SN이 마스터 기지국을 통해 타겟 기지국으로 데이터를 포워딩하 는 방식에 적합하다. SN이 마스터 기지국으로 데이터를 포워딩하고, 이어서 데이터가 마스터 기지국에 의해 타겟 기지국으로 포워딩 되는 데이터 포워딩 방법에 대해, 본 개시내용의 다른 구현은: SN이 시스템 내 핸드오버 및 시스템 간 핸드오버 사이를 구별하지 못하고; SN이 데이터를 마스터 기지국으로 포워딩하고; 데이터 패킷이 PDCP SN 및 QFI 정보 또 는 PDCP SN 및 SDAP 헤더 정보를 포함할 수 있고; 마스터 기지국이 시스템 간 핸드오버임을 알고; SN으로부터 포워딩된 데이터를 수신한 후, 마스터 기지국이 데이터 패킷에서 PDCP SN 및 QFI 정보 또는 PDCP SN 및 SDAP 헤 더 정보를 제거하고; 이어서 데이터 패킷을 타겟 기지국으로 전송하는 것이다. 이 데이터 포워딩 방법에 대응하 여, SN과 타겟 기지국 간의 직접 포워딩 경로가 이용 가능하지 않은 경우, 마스터 기지국은 핸드오버 유형을 S- SN으로 전송할 필요가 없다.지금까지, 본 개시내용의 제9 실시예의 설명이 완료되었다. 이 방법으로, MR-DC에서 EPC로의 핸드오버 절차 동 안 SN에서 타겟 기지국으로의 직접적인 데이터 포워딩은 지원될 수 있고, 데이터는 대응 데이터 포워딩 터널로 올바르게 포워딩될 수 있고, 이는 데이터 포워딩이 적절하게 수행되고, 핸드오버 절차 동안 데이터 손실을 줄이 고 핸드오버 성능을 향상시키는 것을 보장한다. 도 12는 제10 실시예의 개략도를 예시한다. 이 실시예에서, 소스 마스터 기지국은 데이터 포워딩을 위해 수락된 QoS flow의 목록 및 QoS flow에 대응하는 E-RAB의 식별자에 따라 각각의 데이터 포워딩 터널에 대한 데이터를 포워딩해야 하는 하나 이상의 QoS flow을 알고; 소스 마스터 기지국은 데이터 포워딩 터널에서 포워딩되어야 하 는 하나 이상의 QoS flow 및 데이터 포워딩 터널 정보를 세컨더리 기지국으로 전송한다. 본 개시내용과 관련 없 는 단계의 설명은 여기서 생략된다. 이 실시예는 다음 단계를 포함한다. 단계는 단계과 동일하고, 여기서 반복되지 않을 것이다. 단계(1202 내지 1207)는 단계(1003 내지 1008)와 동일하고, 여기서 반복되지 않을 것이다. 단계에서, S-MN은 데이터 포워딩 터널 정보를 수신한다. 직접 데이터 포워딩의 경우, 데이터 포워딩 터널 정보는 타겟 기지국에 의해 할당된 E-RAB별 데이터 포워딩 터널에 대한 정보이다. 간접 데이터 포워딩을 위해, 터널에 대한 정보는 소스 기지국으로부터 SMF 또는 UPF에 의해 할당된 UPF로 데이터를 포워딩하기 위한 데이터 포워딩 터널에 대한 정보이다. S-MN은 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보 목록을 수신하고, 데 이터 포워딩을 위해 수락된 QoS flow에 대한 정보는 QoS flow 식별자를 포함한다. S-MN은 단계의 핸드오 버 커맨드 메시지를 통해 코어 네트워크로부터 데이터 포워딩 터널 정보 및 데이터 포워딩을 위해 수락된 QoS flow 정보 목록을 수신할 수 있다. S-MN에서 종료된 베어러의 경우, S-MN은 데이터를 포워딩한다. 직접 데이터 포워딩을 위해, S-MN은 QoS flow이 매핑된 E-RAB 아이덴티티에 따라 QoS flow의 데이터를 대응 E-RAB 데이터 포워딩 터널로 포워딩한다. 간접 데이 터 포워딩의 경우, S-MN은 수신된 데이터 포워딩 터널 정보에 따라 데이터를 포워딩하고, 예를 들어 S-MN은 수 신된 PDU 세션 데이터 포워딩 터널 또는 DRB 데이터 포워딩 터널에 따라 데이터를 포워딩한다. S-SN에서 종료되는 베어러의 경우, S-MN은 데이터 포워딩 터널 정보와 터널에서 포워딩되는 하나 이상의 QoS flow에 대한 정보를 SN으로 전송한다. 터널에서 포워딩되는 QoS flow에 대한 정보는 QoS flow 식별자를 포함한 다. S-MN은 S-SN과 eNB 간의 직접 데이터 포워딩 경로가 이용 가능한 경우 수신된 데이터 포워딩 터널 정보를 S-SN으로 전송한다. S-MN은 S-SN과 eNB 간의 직접 데이터 포워딩 경로가 O&M(운영 및 유지 관리) 설정에 따라 이용 가능한지 여부를 알거나; 또는 S-MN이 eNB와 S-SN 가용성 사이의 직접 데이터 포워딩 경로가 이용 가능하 다는 정보를 수신하면, S-SN과 eNB 사이의 직접 데이터 포워딩 경로는 이용 가능하고; S-MN은 또한 S-SN과 eNB 사이의 직접 데이터 포워딩 경로가 본 개시내용의 주요 내용에 영향을 주지 않고 다른 방식에 따라 이용 가능한 지 여부를 알 수 있다. S-SN은 데이터를 eNB로 직접 포워딩한다. S-SN은 QoS flow의 데이터를 대응 E-RAB 데이터 포워딩 터널로 포워딩 한다. 데이터 포워딩을 위해 수락된 QoS flow 목록과 각각의 QoS flow에 대응하는 E-RAB 아이덴티티에 따라, S- MN은 하나 이상의 QoS flow이 E-RAB별로 데이터 포워딩 터널에서 데이터를 포워딩해야 하는 것을 알아서, 데이 터 포워딩 터널 정보와 터널에서 포워딩된 하나 이상의 QoS flow을 S-SN으로 전송한다. S-MN은 또한 핸드오버 유형을 S-SN으로 전송할 수 있고, 핸드오버 유형에 대한 구체적인 정보는 단계의 정보와 동일하고, 여기서 반복되지 않을 것이다. 마스터 기지국과 타겟 기지국 간 및/또는 세컨더리 기지국과 타겟 기지국 간 직접 데이 터 포워딩인 경우, 마스터 기지국은 핸드오버 유형을 SN으로 전송한다. S-SN과 eNB 사이의 직접 데이터 포워딩 경로가 이용 가능하지 않은 경우, S-MN은 S-MN과 S-SN 사이에 사용되는 데이터 포워딩 터널을 할당하고, S-MN은 S-MN에 의해 할당된 데이터 포워딩 터널에 대한 정보를 S-SN으로 전송 한다. S-SN은 S-MN으로 데이터를 포워딩하고, 데이터는 S-MN을 통해 eNB로 포워딩된다. 시스템 간 핸드오버를 위해, SN은 포워딩되는 데이터 패킷에 PDCP SN 및 QFI 정보 또는 PDCP SN 및 SDAP 헤더 정보를 포함하지 않는다. 핸드오버 유형의 수신에 따라, SN은 핸드오버가 시스템 간 핸드오버임을 알거나; 또는 데이터 포워딩 터널에서 데이터를 포워딩해야 하는 하나 이상의 QoS flow에 대한 정보의 수신에 따라, SN은 간 접적으로 핸드오버가 시스템 간 핸드오버임을 안다. 데이터 전송 방법은 S-SN이 직접 타겟 기지국으로 데이터를 포워딩하는 방식 또는 S-SN이 S-MN을 통해 타겟 기지국으로 데이터를 포워딩하는 방식에 적합하다. S-SN이 S-MN에 데이터를 포워딩하고 이어서 데이터가 S-MN에 의해 eNB에 포워딩되는 데이터 포워딩 방법에 관해, 본 개시내용의 다른 구현은: S-SN이 시스템 내 핸드오버 및 시스템 간 핸드오버 사이를 구별하지 못하고; S-SN이 데이터를 S-MN으로 포워딩하고; 데이터 패킷이 PDCP SN 및 QFI 정보 또는 PDCP SN 및 SDAP 헤더 정보를 포함할 수 있고; S-MN이 그것이 시스템 간 핸드오버임을 알고; S-SN으로부터 포워딩된 데이터를 수신한 후, S- MN이 데이터 패킷으로부터 PDCP SN과 QFI 정보 또는 PDCP SN과 SDAP 헤더 정보를 제거하고, 이어서 데이터 패킷 을 타겟 기지국으로 전송하는 것이다. 이 데이터 포워딩 방법에 대응하여, S-SN과 타겟 기지국 간의 직접 포워 딩 경로가 이용 가능하지 않은 경우, S-MN은 핸드오버 유형을 S-SN으로 전송할 필요가 없다. 지금까지, 본 개시내용의 제10 실시예의 설명이 완료되었다. 이 방법으로, MR-DC에서 EPC로의 핸드오버 절차 동 안 SN에서 타겟 기지국으로의 직접적인 데이터 포워딩은 지원될 수 있고, 데이터는 대응 데이터 포워딩 터널로 올바르게 포워딩될 수 있고, 이는 데이터 포워딩이 적절하게 수행되고, 핸드오버 절차 동안 데이터 손실을 줄이 고 핸드오버 성능을 향상시키는 것을 보장한다. 도 13은 제11 실시예의 개략도를 예시한다. 이 실시예에서, 소스 마스터 기지국은 데이터 포워딩을 위해 수락된 QoS flow의 목록 및 QoS flow의 매핑된 E-RAB 아이덴티티에 따라 각각의 데이터 포워딩 터널에 대한 데이터를 포워딩해야 하는 하나 이상의 QoS flow을 알고; 소스 마스터 기지국은 데이터 포워딩에 대한 정보를 타겟 E- UTRAN에서 소스 SN(S-SN)으로 전송한다. 본 개시내용과 관련 없는 단계의 설명은 여기서 생략된다. 이 실시예는 다음 단계를 포함한다. 단계는 단계과 동일하고, 여기서 반복되지 않을 것이다. 단계(1302 내지 1307)는 단계(1003 내지 1008)와 동일하고, 여기서 반복되지 않을 것이다. 단계에서, S-MN은 데이터 포워딩 터널 정보를 수신한다. 직접 데이터 포워딩의 경우, 데이터 포워딩 터널 정보는 타겟 기지국에 의해 할당된 E-RAB별 데이터 포워딩 터널에 대한 정보이다. 간접 데이터 포워딩을 위해, 터널에 대한 정보는 소스 기지국으로부터 SMF 또는 UPF에 의해 할당된 UPF로 데이터를 포워딩하기 위한 데이터 포워딩 터널에 대한 정보이다. 데이터 포워딩 터널 정보는 전송 계층 주소 및 터널 종료 식별자(TEID)를 포함한 다. S-MN은 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보 목록을 수신하고, 데이터 포워딩을 위해 수락된 QoS flow에 대한 정보는 QoS flow 식별자를 포함한다. S-MN은 단계의 핸드오버 커맨드 메시지를 통해 코 어 네트워크로부터 데이터 포워딩 터널 정보 및 데이터 포워딩을 위해 수락된 QoS flow 정보 목록을 수신할 수 있다. S-MN에서 종료된 베어러의 경우, S-MN은 데이터를 포워딩한다. 직접 데이터 포워딩을 위해, S-MN은 QoS flow이 매핑된 E-RAB 아이덴티티에 따라 QoS flow의 데이터를 대응 E-RAB 데이터 포워딩 터널로 포워딩한다. 간접 데이 터 포워딩의 경우, S-MN은 수신된 데이터 포워딩 터널 정보에 따라 데이터를 포워딩하고, 예를 들어 S-MN은 수 신된 PDU 세션 데이터 포워딩 터널 또는 DRB 데이터 포워딩 터널에 따라 데이터를 포워딩한다. S-SN에서 종료되는 베어러의 경우, S-MN은 데이터 포워딩에 대한 정보를 타겟 E-UTRAN에서 소스 SN(S-SN)으로 전송한다. 타겟 E-UTRAN으로부터의 데이터 포워딩에 대한 정보는 하나 이상의 피스가 있을 수 있다. 타겟 E- UTRAN으로부터의 데이터 포워딩에 대한 정보는 데이터 포워딩 터널 정보와 터널에서 포워딩될 하나 이상의 QoS flow에 대한 정보를 포함한다. 터널에서 포워딩되는 QoS flow에 대한 정보는 QoS flow 식별자를 포함한다. 타겟 E-UTRAN으로부터의 데이터 포워딩에 대한 정보는 또한 DRB 식별자 또는 E-RAB 식별자를 포함할 수 있다. DRB 식 별자는 타겟 시스템의 E-RAB 식별자이고, DRB 식별자는 E-RAB 식별자, 즉 QoS flow에 대응하는 E-RAB 아이덴티 티를 나타내기 위해 사용된다. 데이터 포워딩 터널 정보는 다운링크 데이터 포워딩 터널 정보이다. 데이터 포워 딩 터널 정보는 전송 계층 주소와 TEID를 포함한다. S-MN은 S-SN과 eNB 간의 직접 데이터 포워딩 경로가 이용 가능한 경우 수신된 데이터 포워딩 터널 정보를 S- SN으로 전송한다. S-MN은 S-SN과 eNB 간의 직접 데이터 포워딩 경로가 O&M(운영 및 유지 관리) 설정에 따라 이 용 가능한지 여부를 알거나; 또는 S-MN이 eNB와 S-SN 가용성 사이의 직접 데이터 포워딩 경로가 이용 가능하다 는 정보를 수신하면, S-SN과 eNB 사이의 직접 데이터 포워딩 경로는 이용 가능하고; S-MN은 또한 S-SN과 eNB 사 이의 직접 데이터 포워딩 경로가 본 개시내용의 주요 내용에 영향을 주지 않고 다른 방식에 따라 이용 가능한지 여부를 알 수 있다. 데이터 포워딩을 위해 수락된 QoS flow 목록과 각각의 QoS flow에 대응하는 E-RAB 아이덴티티에 따라, S-MN은 E-RAB별로 데이터 포워딩 터널에서 데이터를 포워딩해야 하는 하나 이상의 QoS flow을 알아서, 데이터 포워딩 터널 정보, 터널에서 포워딩될 하나 이상의 QoS flow, 및/또는 E-RAN 식별자 또는 DRB 식별자를 S-SN으로 전송 한다. S-SN은 데이터를 eNB로 직접 포워딩한다. S-SN은 QoS flow의 데이터를 대응 E-RAB 데이터 포워딩 터널로포워딩한다. S-SN과 eNB 사이의 직접 데이터 포워딩 경로가 이용 가능하지 않은 경우, S-MN은 S-MN과 S-SN 사이에 사용되는 데이터 포워딩 터널을 할당하고, S-MN은 S-MN에 의해 할당된 데이터 포워딩 터널에 대한 정보를 S-SN으로 전송 한다. S-SN은 S-MN으로 데이터를 포워딩하고, 데이터는 S-MN을 통해 eNB로 포워딩된다. 시스템 간 핸드오버를 위해, S-SN은 포워딩되는 데이터 패킷에 PDCP SN 및 QFI 정보 또는 PDCP SN 및 SDAP 헤더 정보를 포함하지 않는다. 타겟 E-UTRAN으로부터 데이터 포워딩에 대한 정보의 수신에 따라, SN은 시스템 간 핸 드오버임을 안다. 타겟 E-UTRAN으로부터의 데이터 포워딩에 대한 정보에 포함되는 정보는 위에서 설명한 것과 동일하고, 여기서 반복되지 않을 것이다. 이 데이터 전송 방법은 S-SN이 직접 타겟 기지국으로 데이터를 포워딩 하는 방식 또는 S-SN이 S-MN을 통해 타겟 기지국으로 데이터를 포워딩하는 방식에 적합하다. S-SN이 S-MN에 데이터를 포워딩하고 이어서 데이터가 S-MN에 의해 eNB에 포워딩되는 데이터 포워딩 방법에 관해, 본 개시내용의 다른 구현은: S-SN이 시스템 내 핸드오버 및 시스템 간 핸드오버 사이를 구별하지 못하고; S-SN이 데이터를 S-MN으로 포워딩하고; 데이터 패킷이 PDCP SN 및 QFI 정보 또는 PDCP SN 및 SDAP 헤더 정보를 포함할 수 있고; S-MN이 그것이 시스템 간 핸드오버임을 알고; S-SN으로부터 포워딩된 데이터를 수신한 후, S- MN이 데이터 패킷으로부터 PDCP SN과 QFI 정보 또는 PDCP SN과 SDAP 헤더 정보를 제거하고, 이어서 데이터 패킷 을 타겟 기지국으로 전송하는 것이다. 지금까지, 본 개시내용의 제11 실시예의 설명이 완료되었다. 이 방법으로, MR-DC에서 EPC로의 핸드오버 절차 동 안 SN에서 타겟 기지국으로의 직접적인 데이터 포워딩은 지원될 수 있고, 데이터는 대응 데이터 포워딩 터널로 올바르게 포워딩될 수 있고, 이는 데이터 포워딩이 적절하게 수행되고, 핸드오버 절차 동안 데이터 손실을 줄이 고 핸드오버 성능을 향상시키는 것을 보장한다. 도 14는 제12 실시예의 개략도를 예시한다. 이 실시예는 예로서 5G에서 EN-DC로의 핸드오버를 취하여 예시되고, 이는 또한 다른 시스템 간 핸드오버 또는 시스템 내 핸드오버 상황에 적용 가능하다. 본 개시내용과 관련 없는 단계의 설명은 여기서 생략된다. 이 실시예는 다음 단계를 포함한다. 단계에서, 소스 기지국은 핸드오버 요구 메시지를 액세스 및 이동성 관리 엔티티로 전송한다. 액세스 및 이동성 관리 엔티티는 소스 액세스 및 이동성 관리 엔티티로 또한 알려진 소스 기지국에서 UE에 서빙하는 액세 스 및 이동성 관리 엔티티이다. 5G 시스템의 액세스 및 이동성 관리 엔티티는 AMF이다. 소스 기지국과 타겟 기 지국 간의 직접 포워딩 경로가 이용 가능한 경우, 핸드오버 요구 메시지는 직접 포워딩 경로 가용성에 대한 정 보를 포함한다. 타겟 기지국은 타겟 마스터 기지국이다. 메시지는 소스 기지국에 대한 식별 정보를 포함한다. 소스 기지국에 대한 식별 정보는 소스-대-타겟 투명 컨테이너에 포함될 수 있다. 메시지는 소스 기지국에 의한 데이터 포워딩을 위해 제공된 E-RAB(Evolved Radio Access Bearer)에 대한 정보를 포함한다. 소스 기지국에 의 한 데이터 포워딩을 위해 제공되는 E-RAB에 대한 정보는 소스-대-타겟 투명 컨테이너에 포함될 수 있다. 단계에서, 액세스 및 이동성 관리 엔티티는 PDU 세션 컨텍스트 요청 메시지를 세션 관리 엔티티로 전송한 다. 5G 시스템의 세션 관리 엔티티는 SMF이다. SMF는 또한 PGW 제어 평면의 기능을 가진다. AMF가 직접 포워딩 경로 가용성에 대한 정보를 수신한 경우, PDU 세션 컨텍스트 요청 메시지는 직접 포워딩 경로 가용성에 대한 정 보를 포함한다. 단계에서, 세션 관리 엔티티는 사용자 평면 엔티티와의 세션 수정 절차를 개시한다. 5G 시스템의 사용자 평면 엔티티는 UPF이다. UPF는 또한 PGW 사용자 평면의 기능을 가진다. 단계에서, 세션 관리 엔티티는 PDU 세션 컨텍스트 응답 메시지를 액세스 및 이동성 관리 엔티티로 전송한 다. 단계에서, 소스 액세스 및 이동성 관리 엔티티는 재배치 요청 메시지를 타겟 이동성 관리 엔티티로 전송 한다. 4G 시스템의 이동성 관리 엔티티는 MME이다. 메시지는 직접 포워딩 표시 또는 직접 포워딩 경로 가용성에 대한 정보를 포함한다. 단계에서, 타겟 이동성 관리 엔티티는 핸드오버 요청 메시지를 타겟 기지국으로 전송한다. 타겟 기지국은 타겟 마스터 기지국이다. 메시지는 소스 기지국의 식별자를 포함한다. 단계에서, 타겟 기지국은 세컨더리 기지국 추가 여부를 정한다. 세컨더리 기지국을 추가하는 것이 정해진 경우, 타겟 마스터 기지국은 세컨더리 기지국 추가 요청 메시지를 세컨더리 기지국으로 전송한다. 메시지는 소 스 기지국의 식별자를 포함한다. 세컨더리 기지국에서 종료되는 베어러의 경우, 메시지는 다운링크 데이터 포워딩에 대한 정보를 포함한다. 세컨더리 기지국은 또한 타겟 세컨더리 기지국으로 말해질 수 있다. 베어러는 E- RAB, EPS 베어러, 데이터 무선 베어러 또는 다른 베어러일 수 있고; 아래에도 동일하게 적용된다. 세컨더리 기지국은 소스 기지국과 세컨더리 기지국 사이의 직접 포워딩 경로가 이용 가능한지 여부를 결정한다. 단계에서, 세컨더리 기지국은 세컨더리 기지국 추가 응답 메시지를 타겟 마스터 기지국으로 전송한다. 메 시지에는 직접 포워딩 경로 가용성을 포함하고, 직접 포워딩 경로 가용성은 세컨더리 기지국과 소스 기지국 간 의 직접 포워딩 경로가 이용 가능함을 의미한다. 세컨더리 기지국에 의해 셋업되도록 수락된 세컨더리 기지국에 서 종료되는 베어러, 및 다운링크 데이터 포워딩이 세컨더리 기지국에 의해 수락된 베어러의 경우, 메시지는 세 컨더리 기지국에 의해 할당된 데이터 포워딩 터널에 대한 정보를 포함한다. 단계에서, 타겟 마스터 기지국은 핸드오버 요청 확인응답 메시지를 타겟 이동성 관리 엔티티로 전송한다. 메시지는 직접 포워딩 경로 가용성을 포함하고, 이는 세컨더리 기지국과 소스 기지국 간의 직접 포워딩 경로가 이용 가능함을 의미한다. 데이터 포워딩 터널이 타겟 측에 의해 할당된 베어러(타겟 마스터 기지국 및 타겟 세 컨더리 기지국에서 종료되는 베어러를 포함함)에 대해, 타겟 마스터 기지국은 베어러가 마스터 기지국에서 종료 되었는지 세컨더리 기지국에서 종료되었는지 여부를 타겟 모바일 관리 엔티티에게 알린다. 타겟 기지국은 베어 러가 마스터 기지국에서 종료되거나 세컨더리 기지국에서 종료된다는 표시 정보를 베어러 정보에 포함할 수 있 다. 단계에서, 타겟 이동성 관리 엔티티는 타겟 기지국으로부터 하나 이상의 베어러의 데이터 포워딩 터널 정 보와 베어러가 마스터 기지국에서 종료되거나 세컨더리 기지국에서 종료된다는 정보를 수신한다. 마스터 기지국에서 종료된 베어러의 경우, 단계에서, 타겟 이동성 관리 엔티티가 직접 포워딩 표시 또는 직접 포워딩 경로 가용성에 대한 정보를 수신하면, 이는 직접 데이터 포워딩이고; 단계에서, 타겟 이동성 관리 엔티티가 직접 포워딩 표시 또는 직접 포워딩 경로 가용성에 대한 정보를 수신하지 않으면, 이는 간접 데 이터 포워딩이다. 세컨더리 기지국에서 종료된 베어러의 경우, 타겟 이동성 관리 엔티티가 타겟 기지국으로부터 직접 데이터 포워 딩 경로 가용성을 수신하면, 이는 직접 데이터 포워딩이고, 그렇지 않으면 간접 데이터 포워딩이다. 간접 데이터 포워딩의 베어러의 경우, 타겟 모바일 관리 엔티티는 간접 데이터 포워딩 터널을 셋업하기 위한 요 청 메시지를 서비스 게이트웨이로 전송한다. 서비스 게이트웨이는 간접 데이터 포워딩 터널을 셋업하기 위한 응 답 메시지를 타겟 모바일 관리 엔티티로 전송한다. 응답 메시지는 서비스 게이트웨이에 의한 요청 메시지에서 각각의 베어러에 대해 할당된 간접 데이터 포워딩 터널에 대한 정보를 포함한다. 타겟 이동성 관리 엔티티는 재배치 응답 메시지를 소스 액세스 및 이동성 관리 엔티티로 전송한다. 데이터 포워 딩 터널 정보를 포함하는 베어러의 경우, 메시지는 직접 데이터 포워딩 또는 간접 데이터 포워딩에 대한 표시 정보를 포함한다. 단계(1412a)에서, 데이터 포워딩의 경우, 소스 액세스 및 이동성 관리 엔티티는 PDU 세션 업데이트 세션 관리 컨텍스트 요청 메시지를 세션 관리 엔티티로 전송한다. 메시지는 소스 액세스 및 이동성 관리 엔티티에 의해 수 신된 데이터 포워딩 터널 정보와 직접 데이터 포워딩 또는 간접 데이터 포워딩에 대한 표시 정보를 포함한다. 단계(1412b)에서, 간접 데이터 포워딩의 베어러의 경우, 세션 관리 엔티티는 N4 세션 수정 메시지를 사용자 평 면 엔티티로 전송한다. 세션 관리 엔티티는 수신된 데이터 포워딩 터널 정보를 UPF로 전송한다. 세션 관리 엔티 티는 또한 간접 데이터 포워딩 터널을 할당하도록 UPF에 요청할 수 있다. UPF는 UPF에 의해 할당된 간접 데이터 포워딩 터널에 대한 정보를 포함하는 응답 메시지를 세션 관리 엔티티로 전송한다. 간접 데이터 포워딩 터널에 대한 정보는 PDU 세션에 대한 것이다. 직접 데이터 포워딩을 위한 베어러의 경우, 세션 관리 엔티티는 N4 세션 수정 메시지에 베어러를 포함하지 않을 수 있다. 단계(1412c)에서, 세션 관리 엔티티는 PDU 세션 업데이트 세션 관리 컨텍스트 응답 메시지를 소스 액세스 및 이 동성 관리 엔티티로 전송한다. 메시지는 데이터 포워딩 터널 정보를 포함한다. 데이터 포워딩 터널 정보는 직접 데이터 포워딩 터널에 대한 정보 및/또는 간접 데이터 포워딩 터널에 대한 정보를 포함한다. 직접 데이터 포워 딩 터널에 대한 정보는 E-RAB에 따른다. 간접 데이터 포워딩 터널에 대한 정보는 PDU 세션에 따른다. 단계에서, 소스 액세스 및 이동성 관리 엔티티는 핸드오버 커맨드 메시지를 소스 기지국으로 전송한다. 메시지는 소스 액세스 및 이동성 관리 엔티티에 의해 수신된 데이터 포워딩 터널 정보를 포함한다. 데이터 포워딩 터널 정보는 단계(1412c)에서 설명한 것과 동일하고, 여기서 반복되지 않을 것이다. 소스 기지국은 수신된 데이터 포워딩 터널 정보에 따라 데이터를 포워딩한다. 소스 기지국이 E-RAB의 데이터 포 워딩 터널과 PDU 세션의 데이터 포워딩 터널을 동시에 수신한 경우, 소스 기지국은 QoS flow이 매핑되는 E-RAB 아이덴티티에 따라 E-RAB 터널로 데이터를 포워딩한다. 소스 기지국은 QoS flow이 속한 PDU 세션 터널에서 데이 터를 포워딩한다. 지금까지, 본 개시내용의 제12 실시예의 설명이 완료되었다. 이 방법으로, 소스 기지국과 타겟 마스터 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하지 않고 소스 기지국과 타겟 세컨더리 기지국 간의 직접 데이터 포 워딩 경로가 이용 가능한 경우, 소스 기지국에서 타겟 세컨더리 기지국으로의 직접 데이터 포워딩은 여전히 지 원될 수 있고, 데이터는 대응 데이터 포워딩 터널로 올바르게 포워딩될 수 있으므로, 데이터 포워딩 효율성이 향상되고, 핸드오버 절차 동안 데이터 손실이 감소하고 핸드오버 성능이 향상된다. 도 15는 제13 실시예의 개략도를 예시한다. 이 실시예는 예로서 5G에서 EN-DC로의 핸드오버를 취하여 예시되고, 이는 또한 다른 시스템 간 핸드오버 또는 시스템 내 핸드오버 상황에 적용 가능하다. 본 개시내용과 관련 없는 단계의 설명은 여기서 생략된다. 이 실시예는 다음 단계를 포함한다. 단계에서, 소스 기지국은 핸드오버 요구 메시지를 액세스 및 이동성 관리 엔티티로 전송한다. 액세스 및 이동성 관리 엔티티는 소스 액세스 및 이동성 관리 엔티티로 또한 알려진 소스 기지국에서 UE에 서빙하는 액세 스 및 이동성 관리 엔티티이다. 5G 시스템의 액세스 및 이동성 관리 엔티티는 AMF이다. 소스 기지국과 타겟 기 지국 간의 직접 포워딩 경로가 이용 가능한 경우, 핸드오버 요구 메시지는 직접 포워딩 경로 가용성에 대한 정 보를 포함하고, 핸드오버 요구 메시지 내 소스-대-타겟 투명 컨테이너는 또한 직접 포워딩 경로 가용성에 대한 정보를 동시에 포함할 수 있다. 타겟 기지국은 타겟 마스터 기지국이다. 메시지는 소스 기지국에 대한 식별 정 보를 포함한다. 소스 기지국에 대한 식별 정보는 소스-대-타겟 투명 컨테이너에 포함될 수 있다. 메시지는 소스 기지국에 의한 데이터 포워딩을 위해 제공된 E-RAB(Evolved Radio Access Bearer) 정보를 포함한다. 소스 기지 국에 의한 데이터 포워딩을 위해 제공되는 E-RAB 정보는 소스-대-타겟 투명 컨테이너에 포함될 수 있다. 단계(1502 내지 1505)는 단계(1402 내지 1405)와 동일하고, 여기서 반복되지 않을 것이다. 단계에서, 타겟 이동성 관리 엔티티는 핸드오버 요청 메시지를 타겟 기지국으로 전송한다. 타겟 기지국은 타겟 마스터 기지국이다. 메시지는 소스 기지국의 식별자를 포함한다. 메시지는 직접 포워딩 경로 가용성에 대 한 정보를 포함한다. 직접 포워딩 경로 가용성에 대한 정보는 소스 기지국에 의해 소스-대-타겟 투명 컨테이너 에 포함될 수 있거나 타겟 코어 네트워크 엔티티에 의해 핸드오버 요청 메시지에 직접 포함될 수 있다. 직접 포 워딩 경로 가용성에 대한 정보는 소스 기지국과 타겟 기지국 간의 직접 포워딩 경로가 이용 가능함을 의미한다. 단계에서, 타겟 기지국은 세컨더리 기지국 추가 여부를 결정한다. 세컨더리 기지국을 추가하는 것이 결정 된 경우, 타겟 마스터 기지국은 세컨더리 기지국 추가 요청 메시지를 세컨더리 기지국으로 전송한다. 메시지는 소스 기지국의 식별자를 포함한다. 세컨더리 기지국에서 종료되는 베어러의 경우, 메시지는 다운링크 데이터 포 워딩 정보를 포함한다. 세컨더리 기지국은 또한 타겟 세컨더리 기지국으로 말해질 수 있다. 베어러는 E-RAB, EPS 베어러, 데이터 무선 베어러 또는 다른 베어러로 말해질 수 있고; 아래에도 동일하게 적용된다. 세컨더리 기지국은 소스 기지국과 세컨더리 기지국 사이의 직접 포워딩 경로가 이용 가능한지 여부를 결정한다. 본 실시예에 의해 달성될 기술적 효과는: 소스 기지국과 타겟 마스터 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하지 않고 소스 기지국과 타겟 세컨더리 기지국 간의 직접 데이터 포워딩 경로가 이용 가능한 경우, 소스 기지국에서 타겟 세컨더리 기지국으로의 직접 데이터 포워딩이 지원될 수 있고; 타겟 마스터 기지국에서 종료되는 베어러의 경우, 소스 기지국에서 타겟 세컨더리 기지국으로 이어서 타겟 마스터 기지국으로의 데이터 포워딩은 지원될 수 있어서, 데이터는 대응 데이터 포워딩 터널로 올바르게 포워딩되고, 따라서 데이터 포워딩 효율성을 향상시킬 수 있다. 타겟 마스터 기지국은 직접 포워딩 경로 가용성에 대한 정보가 핸드오버 요청 메시지에서 수신되었는지 여부에 따라 소스 기지국과 타겟 마스터 기지국 간의 직접 포워딩 경로가 이용 가능한지 여부를 안다. 타겟 마스터 기 지국이 핸드오버 요청 메시지에서 직접 포워딩 경로 가용성에 대한 정보를 수신하지 못한 경우, 소스 기지국과 타겟 마스터 기지국 간의 직접 포워딩 경로는 이용 가능하지 않다. 데이터 포워딩 방법을 지원하기 위해, 본 실 시예에서, 타겟 마스터 기지국에서 종료되는 베어러에 대해 타겟 마스터 기지국과 타겟 세컨더리 기지국 사이의 데이터 포워딩 터널에 대한 정보를 할당하는 2개의 방식이 있다.방법 1의 일 실시예에서, 이는 세컨더리 기지국 추가 요청 절차를 통해 수행된다. 데이터 포워딩이 타겟 마스터 기지국에 의해 수락되는 타겟 마스터 기지국에서 종료되는 베어러의 경우, 타겟 마스터 기지국은 타겟 세컨더리 기지국으로부터의 데이터 포워딩 터널 정보를 타겟 마스터 기지국으로 할당하고, 타겟 마스터 기지국은 세컨더 리 기지국 추가 요청 메시지에 할당된 터널 정보를 포함시킨다. 타겟 기지국은 대응 베어러에 대해 소스 기지국 으로부터의 데이터 포워딩 터널 정보를 타겟 세컨더리 기지국에 할당하도록 타겟 세컨더리 기지국에 요청한다. 이 방법에 대응하여, 세컨더리 기지국이 소스 기지국과 세컨더리 기지국 간의 직접 포워딩 경로가 이용 가능하 다고 결정한 경우, 타겟 세컨더리 기지국에 의해 할당된, 소스 기지국에서 타겟 세컨더리 기지국으로의 데이터 포워딩 터널에 대한 정보는 단계에서 응답 메시지에 포함된다. 방법 2의 일 실시예에서, 이는 단계(1507a) 및 단계(1508a)에 의해 완료된다. 상세한 설명은 다음과 같다. 단계에서, 세컨더리 기지국은 세컨더리 기지국 추가 응답 메시지를 타겟 마스터 기지국으로 전송한다. 메 시지에는 직접 포워딩 경로 가용성을 포함하고, 직접 포워딩 경로 가용성은 세컨더리 기지국과 소스 기지국 간 의 직접 포워딩 경로가 이용 가능함을 의미한다. 세컨더리 기지국에 의해 셋업되도록 수락된 세컨더리 기지국에 서 종료되는 베어러, 및 다운링크 데이터 포워딩이 세컨더리 기지국에 의해 수락된 베어러의 경우, 메시지는 세 컨더리 기지국에 의해 할당된 데이터 포워딩 터널에 대한 정보를 포함한다. 단계의 방법 1에 대응하여, 세컨더리 기지국이 소스 기지국과 세컨더리 기지국 간의 직접 포워딩 경로가 이용 가능하다고 결정한 경우, 타 겟 세컨더리 기지국에 의해 할당된, 소스 기지국에서 타겟 세컨더리 기지국으로의 데이터 포워딩 터널에 대한 정보는 응답 메시지에 포함된다. 단계(1507a)에서, 타겟 마스터 기지국은 소스 기지국과 세컨더리 기지국 간의 직접 포워딩 경로가 세컨더리 기 지국으로부터 이용 가능하다는 정보를 수신한다. 데이터 포워딩이 타겟 마스터 기지국에 의해 수락된 타겟 마스 터 기지국에서 종료된 베어러의 경우, 타겟 마스터 기지국은 타겟 세컨더리 기지국으로부터 타겟 마스터 기지국 으로 데이터 포워딩 터널에 대한 정보를 할당한다. 타겟 마스터 기지국은 세컨더리 기지국으로 메시지를 전송하 고, 메시지는 타겟 세컨더리 기지국에 의해 할당된, 타겟 세컨더리 기지국으로부터 타겟 마스터 기지국으로의 데이터 포워딩 터널에 대한 정보를 포함한다. 타겟 마스터 기지국은 대응 베어러에 대해 소스 기지국으로부터 타겟 세컨더리 기지국으로의 데이터 포워딩 터널에 대한 정보를 할당하도록 타겟 세컨더리 기지국에 요청한다. 단계(1508a)에서, 세컨더리 기지국은 요청 메시지를 수신한다. 세컨더리 기지국은 수신된 데이터 포워딩 터널 정보를 저장한다. 세컨더리 기지국은 소스 기지국에서 타겟 세컨더리 기지국으로 데이터 포워딩 터널에 대한 정 보를 할당한다. 세컨더리 기지국은 응답 메시지를 타겟 마스터 기지국으로 전송한다. 메시지는 세컨더리 기지국 에 의해 할당된, 소스 기지국에서 타겟 세컨더리 기지국으로의 데이터 포워딩 터널에 대한 정보를 포함한다. 단계에서, 타겟 마스터 기지국은 핸드오버 요청 확인응답 메시지를 타겟 이동성 관리 엔티티로 전송한다. 메시지는 직접 포워딩 경로 가용성을 포함하고, 이는 세컨더리 기지국과 소스 기지국 간의 직접 포워딩 경로가 이용 가능함을 의미한다. 단계에서, 타겟 이동성 관리 엔티티는 타겟 기지국으로부터 하나 이상의 베어러의 데이터 포워딩 터널 정 보를 수신한다. 타겟 이동성 관리 엔티티가, 단계에서, 직접 포워딩 표시 또는 직접 포워딩 경로 가용성에 대한 정보를 수신하거나 타겟 기지국으로부터 직접 데이터 포워딩 경로 가용성을 수신하면, 이는 직접 데이터 포워딩이고, 그렇지 않으면 간접 데이터 포워딩이다. 간접 데이터 포워딩의 경우, 타겟 모바일 관리 엔티티는 간접 데이터 포워딩 터널을 셋업하기 위한 요청 메시지 를 서비스 게이트웨이로 전송한다. 서비스 게이트웨이는 간접 데이터 포워딩 터널을 셋업하기 위한 응답 메시지 를 타겟 모바일 관리 엔티티로 전송한다. 응답 메시지는 요청 메시지의 각각의 베어러에 대한 서비스 게이트웨 이에 의해 할당된 간접 데이터 포워딩 터널에 대한 정보를 포함한다. 단계에서, 타겟 이동성 관리 엔티티는 재배치 응답 메시지를 소스 액세스 및 이동성 관리 엔티티로 전송 한다. 메시지는 직접 데이터 포워딩 또는 간접 데이터 포워딩에 대한 표시 정보, 또는 직접 데이터 포워딩 경로 가용성에 대한 정보를 포함한다. 단계(1512a)에서, 데이터 포워딩의 경우, 소스 액세스 및 이동성 관리 엔티티는 PDU 세션 업데이트 세션 관리 컨텍스트 요청 메시지를 세션 관리 엔티티로 전송한다. 메시지는 데이터 포워딩 터널 정보와 직접 데이터 포워 딩 또는 간접 데이터 포워딩에 대한 표시 정보 또는 소스 액세스 및 이동성 관리 엔티티에 의해 수신된 직접 데이터 포워딩 경로 가용성에 대한 정보를 포함한다. 단계(1512b)에서, 간접 데이터 포워딩의 경우, 세션 관리 엔티티는 N4 세션 수정 메시지를 사용자 평면 엔티티 로 전송한다. 세션 관리 엔티티는 수신된 데이터 포워딩 터널 정보를 UPF로 전송한다. 세션 관리 엔티티는 또한 간접 데이터 포워딩 터널을 할당하도록 UPF에 요청할 수 있다. UPF는 UPF에 의해 할당된 간접 데이터 포워딩 터 널에 대한 정보를 포함하는 응답 메시지를 세션 관리 엔티티로 전송한다. 간접 데이터 포워딩 터널에 대한 정보 는 PDU 세션에 대한 것이다. 단계(1512c)에서, 세션 관리 엔티티는 PDU 세션 업데이트 세션 관리 컨텍스트 응답 메시지를 소스 액세스 및 이 동성 관리 엔티티로 전송한다. 메시지는 데이터 포워딩 터널 정보를 포함한다. 데이터 포워딩 터널 정보는 직접 데이터 포워딩 터널에 대한 정보 또는 간접 데이터 포워딩 터널에 대한 정보를 포함한다. 직접 데이터 포워딩 터널에 대한 정보는 E-RAB에 따른다. 간접 데이터 포워딩 터널에 대한 정보는 PDU 세션에 따른다. 단계에서, 소스 액세스 및 이동성 관리 엔티티는 핸드오버 커맨드 메시지를 소스 기지국으로 전송한다. 메시지는 소스 액세스 및 이동성 관리 엔티티에 의해 수신된 데이터 포워딩 터널 정보를 포함한다. 데이터 포워 딩 터널 정보는 단계(1512c)에서 설명한 것과 동일하고, 여기서 반복되지 않을 것이다. 소스 기지국은 수신된 데이터 포워딩 터널 정보에 따라 데이터를 포워딩한다. 직접 데이터 포워딩에 대응하여, 소스 기지국은 QoS flow이 매핑된 E-RAB 아이덴티티에 따라 E-RAB 채널에 데이터를 포워딩한다. 타겟 세컨더리 기지국은 소스 기지국으로부터 포워딩된 데이터를 수신하고, 타겟 마스터 기지국에서 종료된 베어러의 경우, 타 겟 세컨더리 기지국은 그 데이터를 타겟 마스터 기지국으로 포워딩한다. 간접 데이터 포워딩에 대응하여, 소스 기지국은 QoS flow이 속한 PDU 세션 터널에서 데이터를 포워딩한다. 지금까지, 본 개시내용의 제13 실시예의 설명이 완료되었다. 이 방법으로, 소스 기지국과 타겟 마스터 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하지 않고 소스 기지국과 타겟 세컨더리 기지국 간의 직접 데이터 포 워딩 경로가 이용 가능한 경우, 소스 기지국에서 타겟 세컨더리 기지국으로의 직접 데이터 포워딩이 지원될 수 있고; 타겟 마스터 기지국에서 종료되는 베어러의 경우, 소스 기지국에서 타겟 세컨더리 기지국으로 이어서 타 겟 마스터 기지국으로의 데이터 포워딩은 지원될 수 있어서, 데이터는 대응 데이터 포워딩 터널로 올바르게 포 워딩되고, 따라서 데이터 포워딩 효율성을 향상시키고 핸드오버 성능을 향상시킬 수 있다. 도 16은 제14 실시예의 개략도를 예시한다. 이 실시예는 예로서 5G 시스템 내에서 핸드오버를 취하여 예시되고, 이는 또한 다른 시스템 내 핸드오버의 경우에 적용 가능하다. 본 개시내용과 관련 없는 단계의 설명은 여기서 생략된다. 이 실시예는 다음 단계를 포함한다. 단계에서, 소스 기지국은 핸드오버 요구 메시지를 소스 액세스 및 이동성 관리 엔티티로 전송한다. 5G 시 스템의 액세스 및 이동성 관리 엔티티는 AMF이다. 소스 기지국과 타겟 기지국 간의 직접 포워딩 경로가 이용 가 능한 경우, 핸드오버 요구 메시지는 직접 포워딩 경로 가용성에 대한 정보를 포함한다. 타겟 기지국은 타겟 마 스터 기지국이다. 메시지는 소스 기지국에 대한 식별 정보를 포함한다. 소스 기지국의 식별 정보는 소스-대-타 겟 투명 컨테이너에 포함될 수 있다. 메시지는 소스 기지국에 의한 데이터 포워딩을 위해 제공되는 QoS flow 및 /또는 데이터 포워딩을 위해 제공되는 데이터 무선 베어러(DRB)에 대한 정보를 포함한다. 데이터 포워딩을 위해 제공되는 DRB에 대한 정보는 DRB에 매핑된 하나 이상의 QoS flow을 포함한다. 소스 기지국에 의한 데이터 포워 딩을 위해 제공되는 QoS flow 및/또는 데이터 포워딩을 위해 제공되는 DRB에 대한 정보는 소스-대-타겟 투명 컨 테이너에 포함될 수 있다. 단계에서, 소스 액세스 및 이동성 관리 엔티티는 UE 컨텍스트 셋업 요청 메시지를 타겟 액세스 및 이동성 관리 엔티티로 전송한다. 메시지는 직접 경로 포워딩 가용성에 대한 정보를 포함한다. 단계에서, 타겟 액세스 및 이동성 관리 엔티티는 PDU 세션 업데이트 세션 관리 컨텍스트 요청 메시지를 세션 관리 엔티티로 전송한다. 5G 시스템의 세션 관리 엔티티는 SMF이다. 타겟 AMF가 직접 포워딩 경로 가용성 에 대한 정보를 수신하면, 메시지는 직접 포워딩 경로 가용성에 대한 정보를 포함한다. SMF와 UPF 간의 절차의 설명은 여기서 생략된다. 단계에서, 세션 관리 엔티티는 PDU 세션 업데이트 세션 관리 컨텍스트 응답 메시지를 타겟 액세스 및 이 동성 관리 엔티티로 전송한다. 단계에서, 타겟 액세스 및 이동성 관리 엔티티는 핸드오버 요청 메시지를 타겟 기지국으로 전송한다. 타 겟 기지국은 타겟 마스터 기지국이다. 메시지는 소스 기지국의 식별자를 포함한다. 단계에서, 타겟 기지국은 세컨더리 기지국 추가 여부를 정한다. 세컨더리 기지국을 추가하는 것이 정해진 경우, 타겟 마스터 기지국은 세컨더리 기지국 추가 요청 메시지를 세컨더리 기지국으로 전송한다. 메시지는 소 스 기지국의 식별자를 포함한다. 세컨더리 기지국에서 종료되는 베어러의 경우, 메시지는 다운링크 데이터 포워 딩 정보를 포함한다. 세컨더리 기지국은 또한 타겟 세컨더리 기지국으로 말해질 수 있다. 세컨더리 기지국에서 종료되는 베어러는 QoS flow이나 PDU 세션의 데이터가 코어 네트워크에서 세컨더리 기지국으로 직접 전송되는 것을 의미한다. 세컨더리 기지국에서 종료되는 베어러는 또한 5G 시스템의 세컨더리 기지국에서 종료되는 QoS flow 또는 PDU 세션으로 말해질 수 있고; 아래에도 동일하게 적용된다. 세컨더리 기지국은 소스 기지국과 세컨더리 기지국 사이의 직접 포워딩 경로가 이용 가능한지 여부를 결정한다. 단계에서, 세컨더리 기지국은 세컨더리 기지국 추가 응답 메시지를 타겟 마스터 기지국으로 전송한다. 메 시지에는 직접 포워딩 경로 가용성을 포함하고, 직접 포워딩 경로 가용성은 세컨더리 기지국과 소스 기지국 간 의 직접 포워딩 경로가 이용 가능함을 의미한다. 세컨더리 기지국에 의해 셋업이 수락된 세컨더리 기지국에서 종료된 베어러의 경우, 다운링크 데이터 포워딩이 세컨더리 기지국에 의해 수락된 QoS flow 또는 PDU 세션에 대 해, 메시지는 세컨더리 기지국에 의해 할당된 데이터 포워딩 터널에 대한 정보를 포함한다. 데이터 포워딩 터널 에 대한 정보는 DRB 또는 PDU 세션에 대한 것이다. 단계에서, 타겟 마스터 기지국은 핸드오버 요청 확인응답 메시지를 타겟 액세스 및 이동성 관리 엔티티로 전송한다. 메시지는 직접 포워딩 경로 가용성을 포함하고, 이는 세컨더리 기지국과 소스 기지국 간의 직접 포워 딩 경로가 이용 가능함을 의미한다. 데이터 포워딩 터널이 타겟 측에 의해 할당된 베어러(타겟 마스터 기지국 및 타겟 세컨더리 기지국에서 종료되는 베어러를 포함함)에 대해, 타겟 마스터 기지국은 베어러가 마스터 기지 국에서 종료되었는지 세컨더리 기지국에서 종료되었는지 여부를 타겟 모바일 관리 엔티티에게 알린다. 타겟 마 스터 기지국은 베어러가 베어러 정보에 마스터 기지국에서 종료되거나 세컨더리 기지국에서 종료된다는 표시 정 보를 포함할 수 있거나, 타겟 마스터 기지국은 베어러가 DRB 또는 PDU 세션에 관한 정보에 마스터 기지국에서 종료되거나 세컨더리 기지국에서 종료된다는 표시 정보를 포함하거나, 또는 타겟 마스터 기지국은 DRB 터널 또 는 PDU 세션 터널이 마스터 기지국에서 종료되는지 세컨더리 기지국에서 종료되는지 여부의 표시 정보를 나타낸 다. 단계에서, 타겟 액세스 및 이동성 관리 엔티티는 PDU 세션 업데이트 세션 관리 컨텍스트 요청 메시지를 세션 관리 엔티티로 전송한다. 타겟 AMF가 타겟 기지국으로부터 직접 포워딩 경로 가용성에 대한 정보를 수신하 면, 메시지는 직접 포워딩 경로 가용성에 대한 정보를 포함한다. 메시지는 타겟 기지국으로부터 타겟 AMF에 의 해 수신된 세션 관리 컨테이너 정보를 포함한다. 세션 관리 엔티티는 하나 이상의 DRB 또는 PDU 세션의 데이터 포워딩 터널 정보, 및 하나 이상의 DRB 또는 PDU 세션이 마스터 기지국 또는 세컨더리 기지국에서 종료된다는 정보를 수신한다. 마스터 기지국에서 종료된 베어러의 경우, 단계에서, SMF가 직접 포워딩 표시 또는 직접 포워딩 경로 가 용성에 대한 정보를 수신하면, 이는 직접 데이터 포워딩이고; 단계에서, SMF가 직접 포워딩 표시 또는 직 접 포워딩 경로 가용성에 대한 정보를 수신하지 않으면, 이는 간접 데이터 포워딩이다. 세컨더리 기지국에서 종료된 베어러의 경우, SMF가 타겟 기지국으로부터 직접 데이터 포워딩 경로 가용성을 수 신하면, 이는 직접 데이터 포워딩이고, 그렇지 않으면 간접 데이터 포워딩이다. 간접 데이터 포워딩의 베어러의 경우, SMF는 타겟 기지국으로부터 수신된 데이터 포워딩 터널 정보를 UPF에 전 송하고, 간접 데이터 포워딩 터널에 대한 정보를 UPF에게 요청한다. UPF는 할당된 데이터 포워딩 터널에 대한 정보를 SMF로 전송한다. 단계에서, 세션 관리 엔티티는 PDU 세션 업데이트 세션 관리 컨텍스트 응답 메시지를 타겟 액세스 및 이 동성 관리 엔티티로 전송한다. 메시지는 데이터 포워딩 터널 정보를 포함한다. 데이터 포워딩 터널 정보는 직접 데이터 포워딩 터널에 대한 정보 및/또는 간접 데이터 포워딩 터널에 대한 정보를 포함한다. 단계에서, 타겟 액세스 및 이동성 관리 엔티티는 UE 컨텍스트 셋업 응답 메시지를 소스 액세스 및 이동성 관리 엔티티로 전송한다. 메시지는 데이터 포워딩 터널 정보를 포함한다. 데이터 포워딩 터널 정보는 직접 데이 터 포워딩 터널에 대한 정보 및/또는 간접 데이터 포워딩 터널에 대한 정보를 포함한다. 단계에서, 소스 액세스 및 이동성 관리 엔티티는 핸드오버 커맨드 메시지를 소스 기지국으로 전송한다. 메시지는 소스 액세스 및 이동성 관리 엔티티에 의해 수신된 데이터 포워딩 터널 정보를 포함한다. 데이터 포워 딩 터널 정보는 단계에서 설명된 것과 동일하고, 여기서 반복되지 않을 것이다. 소스 기지국은 수신된 데이터 포워딩 터널 정보에 따라 데이터를 포워딩한다. 지금까지, 본 개시내용의 제14 실시예의 설명이 완료되었다. 이 방법으로, 소스 기지국과 타겟 마스터 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하지 않고 소스 기지국과 타겟 세컨더리 기지국 간의 직접 데이터 포 워딩 경로가 이용 가능한 경우, 소스 기지국에서 타겟 세컨더리 기지국으로의 직접 데이터 포워딩은 여전히 지 원될 수 있고, 데이터는 대응 데이터 포워딩 터널로 올바르게 포워딩될 수 있으므로, 데이터 포워딩 효율성이 향상되고, 핸드오버 절차 동안 데이터 손실이 감소하고 핸드오버 성능이 향상된다. 도 17은 본 개시내용에 따른 핸드오버를 지원하는 방법의 제15 실시예의 개략도를 예시한다. 실시예는 EN- DC(EUTRA-NR 이중 연결)에서 SA(standalone architecture)로의 핸드오버에 사용된다. 본 개시내용과 관련 없는 단계의 상세한 설명은 여기서 생략된다. 이 실시예는 다음 단계를 포함한다. 단계(1700a)에서, 소스 eNB(S-eNB)는 UE를 NG-RAN 노드로 핸드오버하기로 정한다. 여기서 NG-RAN 노드는 gNB, 5GC에 연결된 eNB, 또는 gNB 중앙부(CU)일 수 있다. 5GC에 연결된 eNB는 또한 ng- eNB로 칭해질 수 있다. 소스 eNB는 소스 SN과 타겟 기지국 간의 직접 포워딩 경로가 소스 SN으로부터 이용 가능한지 여부에 대한 정보 를 요청한다. 소스 eNB는 소스 SN으로 요청 메시지를 전송하고, 요청 메시지는 타겟 기지국의 식별자를 포함한 다. 요청 메시지는 세컨더리 기지국 수정 요청 메시지 또는 다른 메시지일 수 있다. 단계(1700b)에서, 소스 SN은 소스 SN과 타겟 기지국 간의 직접 포워딩 경로가 수신된 타겟 기지국의 식별자에 따라 이용 가능한지 여부를 정한다. 소스 SN은 응답 메시지를 소스 eNB로 전송한다. 응답 메시지는 직접 포워딩 경로 가용성에 대한 정보를 포함한다. 직접 포워딩 경로 가용성은 소스 SN과 타겟 기지국 간의 직접 포워딩 경 로가 이용 가능함을 의미한다. 메시지는 세컨더리 기지국 수정 응답 메시지 또는 다른 메시지일 수 있다. 단계에서, 소스 eNB는 핸드오버 요구 메시지를 MME로 전송한다. 메시지는 소스-대-타겟 투명 컨테이너를 포함한다. 메시지는 직접 데이터 포워딩 경로 가용성에 대한 정보를 포함한다. 메시지는 소스 eNB와 타겟 기지 국 간의 직접 데이터 포워딩 경로가 이용 가능한 경우 직접 데이터 포워딩 경로 가용성을 포함하거나, 메시지는 소스 SN과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능한 경우 직접 데이터 포워딩 경로 가용성을 포함한다. 소스 eNB와 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하거나 소스 SN과 타겟 기지국 간 의 직접 포워딩 경로가 이용 가능한 경우, 핸드오버 요구 메시지 내 소스-대-타겟 투명 컨테이너는 또한 직접 포워딩 경로 가용성에 대한 정보를 동시에 포함할 수 있다. 단계에서, MME는 포워드 재배치 요청 메시지를 AMF에 전송한다. MME는 직접 포워딩 표시를 AMF에게 전송한다. 직접 포워딩 표시는 직접 데이터 포워딩 또는 간접 데이터 포워딩 을 나타낼 수 있다. 직접 포워딩 표시는 또한 직접 포워딩 플래그로 말해질 수 있다. MME가 소스 eNB로부터 직 접 데이터 포워딩 경로 가용성을 수신하지 못한 경우, MME는 간접 데이터 포워딩이 가능한지 여부를 정한다. MME는 AMF에게 직접 데이터 포워딩인지 간접 데이터 포워딩인지에 대한 정보를 알린다. MME는 또한 AMF에게 데 이터 포워딩이 가능하지 않음을 알릴 수 있고, 이는 직접 데이터 포워딩도 간접 데이터 포워딩도 가능하지 않음 을 의미한다. 또는 MME는 또한 직접 데이터 포워딩 가용성에 대한 정보를 AMF에 알릴 수 있다. 단계(1703a)에서, AMF는 세션 수립(SM: session establishment) 컨텍스트 요청 메시지를 SMF로 전송한다. AMF는 UE를 서빙하는 각각의 SMF에 메시지를 전송한다. AMF는 SMF에게 직접 포워딩 표시를 전송하고, 직접 포워딩 표시는 직접 데이터 포워딩 또는 간접 데이터 포워딩 을 나타낼 수 있다. AMF는 SMF에게 직접 데이터 포워딩이 이용 가능한지 간접 데이터 포워딩이 이용 가능한지 여부에 대한 정보를 알린다. 단계에서, SMF는 SMF와 UPF 간의 N4 세션 수정 절차를 개시한다. 단계(1703b)에서, SMF는 세션 수립 컨텍스트 응답 메시지를 AMF로 전송한다. 메시지는 N2 세션 관리(SM) 정보 컨테이너를 포함한다. SMF가 직접 데이터 포워딩 가용성을 수신하면, SMF는 N2 SM 정보 컨테이너에 직접 데이터 포워딩 경로 가용성을 포함한다. 직접 데이터 포워딩도 간접 데이터 포워딩도 이용 가능하지 않은 경우, SMF는 N2 SM 정보 컨테이너에 포워딩 불가능 데이터를 포함한다. 단계에서, AMF는 핸드오버 요청 메시지를 NG-RAN으로 전송한다. 메시지는 소스-대-타겟 투명 컨테이너를 포함한다. 여기서 소스-대-타겟 투명 컨테이너는 소스 NG-RAN-타겟 NG-RAN 투명 컨테이너이다. 메시지는 직접 데이터 포워딩 경로 가용성 또는 데이터 포워딩 불가능에 대한 정보를 포함한다. 정보는 N2 SM 정보 컨테이너에 포함될 수 있다. 데이터 포워딩 불가능은 직접 또는 간접 데이터 포워딩이 가능하지 않음을 의 미한다. 직접 데이터 포워딩 경로 가용성에 대한 정보는 또한 소스-대-타겟 투명 컨테이너에 포함될 수 있다. 메시지는 또한 PDU 세션 내 QoS flow과 EPS 베어러의 매핑 관계, 즉 QoS flow이 매핑되는 E-RAB 아이덴티티 및/ 또는 매핑된 QoS 정보를 포함할 수 있다. 단계에서, NG-RAN은 핸드오버 요청 확인응답 메시지를 AMF로 전송한다. 메시지는 타겟-대-소스 투명 컨테이너를 포함한다. 타겟-대-소스 투명 컨테이너는 타겟 NG-RAN 노드-대-소스 NG-RAN 노드 투명 컨테이너이다. 타겟 NG-RAN 노드가 직접 데이터 포워딩 경로 가용성을 수신하면, 직접 데이터 포워딩이 사용될 수 있다. 직접 데이터 포워딩의 경우, 데이터 포워딩이 NG-RAN에 의해 수락된 QoS flow이나 데이터 포워딩이 수락된 E-RAB에 대해, NG-RAN은 대응 E-RAB에 대한 다운링크 데이터 포워딩 터널에 대한 정보를 할당하고, 핸드오버 요청 확인 응답 메시지에 E-RAB 식별자와 NG-RAN에 의해 할당된 E-RAB에 대응하는 다운링크 터널에 대한 정보를 포함한다. 간접 데이터 포워딩의 경우, 데이터 포워딩이 NG-RAN에 의해 수락된 QoS flow에 대해, NG-RAN은 QoS flow이 속 한 PDU 세션에 대한 다운링크 데이터 포워딩 터널에 대한 정보를 할당하고, 핸드오버 요청 확인응답 메시지에 PDU 세션 식별자와 NG-RAN에 의해 할당된 PDU 세션에 대응하는 다운링크 터널에 대한 정보를 포함하고, 또한 데 이터 포워딩을 위해 수락된 QoS flow 목록을 포함할 수 있다. 데이터 포워딩이 가능하지 않은 경우, NG-RAN은 데이터 포워딩 터널 정보를 할당할 필요가 없다. 타겟 NG-RAN이 직접 데이터 포워딩 경로 가용성을 수신하면, 타겟 NG-RAN은 데이터 포워딩을 위해 수락된 모든 E-RAB에 대한 다운링크 데이터 포워딩 터널에 대한 정보를 할당한다. 핸드오버 요청 확인 메시지는 타겟 NG-RAN에 의해 할당된 다운링크 데이터 포워딩 터널에 대한 정보를 포함한다. 다운링크 데이터 포워딩 터널에 대한 정보는 E-RAB 또는 PDU 세션에 따를 수 있다. 단계에서, AMF는 SM 컨텍스트 업데이트 요청 메시지를 SMF로 전송한다. 데이터 포워딩을 위한 터널 정보 가 NG-RAN으로부터 수신되면, AMF는 NG-RAN으로부터 수신된 데이터 포워딩 터널 정보를 SMF로 전송한다. AMF는 NG-RAN으로부터 수신된 데이터 포워딩을 위한 터널 정보를 SMF로 전송한다. 데이터 포워딩 터널 정보는 단계 의 정보와 동일하고, 여기서 반복되지 않을 것이다. SMF가 각각의 E-RAB에 대응하는 데이터 포워딩 터널에 대한 정보를 수신하면, 이는 직접 데이터 포워딩이고; 각 각의 PDU 세션에 대응하는 데이터 포워딩 터널에 대한 정보가 수신되면, 이는 간접 데이터 포워딩이고; 데이터 포워딩 터널에 대한 정보가 없으면, 데이터 포워딩은 가능하지 않거나 데이터 포워딩은 타겟 기지국에 의해 수 락되지 않는다. 단계에서, SMF는 UPF와의 세션 수정 절차를 개시한다. 단계에서, SMF는 SM 컨텍스트 업데이트 응답 메시지를 AMF로 전송한다. SMF는 데이터 포워딩을 위한 터널 정보를 AMF로 전송한다. 단계에서, AMF는 재배치 응답 메시지를 MME에게 전송한다. 메시지는 데이터 포워딩 터널 정보를 포함한다. 직접 데이터 포워딩을 위해, 데이터 포워딩 터널 정보는 타겟 NG-RAN에 의해 할당된다. 간접 데이터 포워딩의 경우, 데이터 포워딩 터널 정보는 SMF 또는 UPF에 의해 할당된 SGW와 UPF 간의 데이터 포워딩을 위한 터널에 대한 정보이다. 단계에서, MME가 데이터 포워딩에 대한 터널 정보를 수신한 경우, 간접 데이터 포워딩을 위해, MME는 간 접 데이터 포워딩 터널 셋업 요청 메시지를 SGW로 전송한다. 이 메시지는 SGW와 UPF 간의 데이터 포워딩에 대한 터널 정보를 SGW로 전송하는 데 사용된다. SGW는 간접 데이터 포워딩 터널 셋업 응답 메시지를 MME에게 전송한 다. 메시지는 SGW에 의해 할당된 S1 인터페이스 데이터 포워딩을 위한 업링크 터널에 대한 정보를 포함한다. 직 접 데이터 포워딩을 위해, 단계는 수행될 필요가 없다. MME는 소스 기지국으로부터 수신된 직접 데이터 포워딩경로 가용성에 대한 정보에 따라 직접 데이터 포워딩인지 간접 데이터 포워딩인지를 알고, 이의 세부사항은 단 계에서 설명된 바와 같다. 단계에서, MME는 핸드오버 커맨드 메시지를 소스 eNB로 전송한다. 메시지는 타겟-대-소스 투명 컨테이너 를 포함한다. 메시지는 데이터 포워딩 터널 정보를 포함한다. 간접 데이터 포워딩을 위해, 터널 정보는 SGW에 의해 할당된다. 직접 데이터 포워딩을 위해, 터널 정보는 타겟 NG-RAN에 의해 할당된다. 단계에서, 소스 eNB는 세컨더리 기지국 해제 요청 메시지를 소스 SN으로 전송한다. 소스 eNB와 타겟 기지국 간의 직접 포워딩 경로가 이용 가능하지 않고 소스 SN과 타겟 기지국 간의 직접 포워딩 경로가 이용 가능한 경우, 소스 마스터 기지국에서 종료되고 데이터 포워딩이 타겟 기지국에 의해 수락되는 베 어러에 대해, 소스 eNB는 소스 eNB에서 소스 SN으로 데이터 포워딩을 위한 데이터 포워딩 터널 정보를 할당해 줄 것을 소스 SN에 요청한다. 소스 SN에서 종료된 베어러의 경우, 소스 eNB는 수신된 데이터 포워딩 터널 정보 를 소스 SN으로 전송한다. 소스 eNB와 타겟 기지국 간의 직접 포워딩 경로가 이용 가능하고 소스 SN과 타겟 기지국 간의 직접 포워딩 경로 가 이용 가능하지 않은 경우, 소스 SN에서 종료되는 베어러에 대해, 소스 eNB는 소스 SN에서 소스 eNB로 데이터 를 포워딩하기 위한 데이터 포워딩 터널 정보를 할당하고, 이를 소스 SN으로 전송한다. 그렇지 않은 경우, 소스 eNB의 거동은 기존 eNB와 동일하다. 단계에서, 소스 SN은 세컨더리 기지국 해제 요청 확인응답 메시지를 소스 MN으로 전송한다. 소스 eNB가 소스 eNB에서 소스 SN으로 데이터 포워딩을 위한 데이터 포워딩 터널 정보를 할당할 것을 소스 SN에게 요청하면, 소스 SN은 베어러에 대한 데이터 포워딩 터널 정보를 할당하고, 할당된 데이터 포워딩 터널 정보를 세컨더리 기지국 해제 요청 확인응답 메시지에 포함한다. 단계에서, 소스 eNB는 UE로 핸드오버 커맨드 메시지를 전송한다. 소스 eNB는 데이터를 포워딩한다. 데이터 포워딩 터널이 수신된 E-RAB의 경우, 이는 타겟 기지국이 데이터 포워 딩을 수락하고, 소스 eNB가 대응 채널로 데이터를 포워딩하는 것을 의미한다. 소스 eNB와 타겟 기지국 간 직접 포워딩 경로가 이용 가능하지 않고 소스 SN과 타겟 기지국 간 직접 포워딩 경 로가 이용 가능한 경우, 소스 eNB는 소스 SN으로 데이터를 포워딩하고 데이터는 소스 SN에 의해 타겟 기지국으 로 포워딩된다. 단계에서, 소스 eNB는 소스 SN에 의해 할당된 데이터 포워딩 터널에 대한 정보를 수신한 다. 단계에서, UE는 핸드오버 완료 메시지를 NG-RAN으로 전송한다. 단계에서, NG-RAN은 핸드오버 통지 메시지를 AMF로 전송한다. 메시지는 NG-RAN에 의해 할당된 다운링크 데이터 전송을 위한 터널 정보를 포함한다. 단계에서, AMF는 SM 컨텍스트 업데이트 요청 메시지를 SMF로 전송한다. 단계에서, SMF는 N4 세션 수정 메시지를 UPF로 전송한다. UPF는 N4 세션 수정 응답 메시지를 SMF로 전송 한다. AMF는 NG-RAN에 의해 할당된 다운링크 데이터 전송에 대한 터널 정보를 SMF를 통해 UPF로 전송한다. 단계에서, SMF는 SMF 컨텍스트 업데이트 응답 메시지를 AMF로 전송한다. 지금까지, 본 개시내용의 제15 실시예의 설명이 완료되었다. 이 방법으로, 소스 마스터 기지국과 타겟 기지국 간의 직접 데이터 포워딩 경로가 이용 가능하지 않고 소스 세컨더리 기지국과 타겟 기지국 간의 직접 데이터 포 워딩 경로가 이용 가능한 경우, 소스 세컨더리 기지국에서 타겟 기지국으로의 직접 데이터 포워딩은 지원될 수 있다. 소스 마스터 기지국에서 종료된 베어러의 경우, 소스 마스터 기지국에서 소스 세컨더리 기지국으로 이어 서 타겟 기지국으로의 데이터 포워딩은 지원될 수 있어서, 데이터는 대응 데이터 포워딩 터널로 올바르게 포워 딩될 수 있고, 따라서 데이터 포워딩 효율성이 향상되고 핸드오버 성능이 향상된다. 도 18은 본 개시내용의 제16 실시예의 개략도를 예시하고, 이는 주로 타겟 기지국의 관점에서 설명된다. 이는 다음 단계를 포함한다.단계에서, 타겟 기지국은 코어 네트워크 또는 소스 기지국으로부터 핸드오버 요청 메시지를 수신한다. 핸드오버 요청 메시지에는 소스 기지국의 식별자를 포함한다. 코어 네트워크로부터 수신된 핸드오버 요청 메시 지에 대해, 소스 기지국의 식별자는 소스에서 타겟으로의 소스-대-타겟 투명 컨테이너에 포함될 수 있다. 시스템 내 핸드오버의 경우, 핸드오버 요청 메시지는 소스 기지국으로부터 직접 수신될 수 있다. 시스템 간 핸 드오버 또는 시스템 내 핸드오버의 경우, 핸드오버 요청 메시지는 코어 네트워크로부터 수신될 수 있다. 코어 네트워크로부터 수신된 핸드오버 요청 메시지는 핸드오버 유형을 포함한다. 핸드오버 유형은 5G 시스템 내 (Intra5GS) 핸드오버, 5GS에서 EPS로의 핸드오버, EPS에서 5GS로의 핸드오버, 5GS에서 UTRA(Universal Terrestrial Radio Access)로의 핸드오버 등일 수 있고, 핸드오버 유형은 여기에 제한되지 않는다. 메시지는 데 이터 포워딩이 가능하지 않다는 것을 포함한다. 타겟 기지국이 소스 기지국으로부터 직접 핸드오버 요청 메시지 를 수신하면, 타겟 기지국은 시스템 내 핸드오버임을 안다. 핸드오버 요청 메시지는 또한 직접 포워딩 경로 가용성에 대한 정보를 포함할 수 있다. 직접 포워딩 경로 가용 성에 대한 정보는 소스 기지국(예를 들어, 핸드오버 요청 메시지의 소스-대-타겟 투명 컨테이너) 또는 코어 네 트워크(직접 포워딩 경로 가용성에 대한 정보는 핸드오버 요청 메시지에 직접 포함됨)로부터 수신될 수 있다. EPS에서 5GS로의 핸드오버의 경우, 데이터 포워딩이 가능한 경우(예를 들어, 데이터 포워딩이 가능하지 않다는 정보 요소가 존재하지 않음), 직접 포워딩 경로 가용성에 대한 정보의 부재는 간접 데이터 포워딩이 가능함을 의미한다. 메시지는 업링크 사용자 평면 전송 계층 주소를 포함한다. 단계에서, 타겟 기지국은 세컨더리 기지국을 추가하도록 정한다. 이 경우, 타겟 기지국은 또한 타겟 마스 터 기지국으로 칭해질 수 있고, 세컨더리 기지국은 또한 타겟 세컨더리 기지국으로 칭해질 수 있고, 아래에도 동일하게 적용된다. 타겟 기지국은 메시지를 세컨더리 기지국으로 전송한다. 메시지는 세컨더리 기지국 추가 요 청 메시지일 수 있다. 메시지는 핸드오버 유형을 포함한다. 핸드오버 유형은 시스템 내 핸드오버 또는 시스템 간 핸드오버에 대한 정보이거나, 5GS 시스템 내 핸드오버, 5GS에서 EPS로 핸드오버, EPS에서 5GS로 핸드오버, 5GS에서 UTRA(Universal Terrestrial Radio Access)로의 핸드오버 등이고, 핸드오버 유형은 여기에 제한되지 않는다. 메시지는 소스 기지국의 식별자를 포함한다. 메시지는 다운링크 데이터 포워딩을 포함한다. 단계에서, 세컨더리 기지국은 단계의 메시지를 수신한다. 세컨더리 기지국은 세컨더리 기지국과 소 스 기지국 간의 직접 포워딩 경로가 이용 가능한지 여부를 정한다. 세컨더리 기지국은 세컨더리 기지국과 소스 기지국 간의 직접 포워딩 경로가 수신된 소스 기지국의 식별자에 따라 이용 가능한지 여부를 정한다. 세컨더리 기지국이 다운링크 데이터 포워딩을 수락한 경우, 세컨더리 기지국은 핸드오버 유형 및/또는 직접 데이터 포워 딩인지 간접 데이터 포워딩인지에 대한 정보에 따라 TEID 및 전송 계층 주소를 포함하는 데이터 포워딩 터널 정 보를 할당한다. 예를 들어, 5G 시스템 내 핸드오버 및 직접 데이터 포워딩을 위해, 세컨더리 기지국은 Xn-U에 의해 지원되는 전 송 계층 주소를 할당하거나 소스 기지국에 대해 예약된 전송 계층 주소 공간에서 전송 계층 주소를 할당하고; 5G 시스템 내 핸드오버 및 간접 데이터 포워딩을 위해, 세컨더리 기지국은 5G 코어 네트워크에 의해 지원되는 전송 계층 주소를 할당하고; 4G에서 5G로의 시스템 간 핸드오버와 직접 데이터 포워딩을 위해, 세컨더리 기지국 은 X2-U에 의해 지원되는 전송 계층 주소를 할당하거나 소스 eNB에 대해 예약된 전송 계층 주소 공간에서 전송 계층 주소를 할당하고; 4G에서 5G로의 시스템 간 핸드오버와 간접 데이터 포워딩을 위해, 세컨더리 기지국은 5G 코어 네트워크에 의해 지원되는 전송 계층 주소를 할당한다. 세컨더리 기지국은 운영 및 관리(O&M) 설정에 따라 소스 기지국 또는 소스 eNB 또는 X2-U 또는 Xn-U에 의해 지 원되는 전송 계층 주소 버전을 알거나; 또는 세컨더리 기지국은 O&M 설정에 따라 소스 기지국 또는 소스 eNB 또 는 X2-U 또는 Xn-U를 위해 예약된 전송 계층 주소 공간을 안다. 간접 데이터 포워딩의 경우, 세컨더리 기지국은 수신된 업링크(UL) 사용자 평면(UP) 전송 계층 주소 정보에 따라 코어 네트워크에 의해 지원되는 전송 계층 주 소 버전을 알아서, 대응 버전에 전송 계층 주소를 할당한다. 세컨더리 기지국에 의해 수신된 전송 계층 주소가 IPv4 및 IPv6를 포함하는 경우, 세컨더리 기지국은 자신에 의해 지원되는 전송 계층 주소의 버전에 따라 사용자 데이터 포워딩을 위한 대응 버전의 전송 계층 주소를 할당한다. 세컨더리 기지국은 확인응답 메시지를 타겟 기지국으로 전송한다. 메시지는 세컨더리 기지국 추가 요청 확인응 답 메시지일 수 있다. 메시지는 세컨더리 기지국에 의해 할당된 데이터 포워딩 터널에 대한 정보를 포함한다. 데이터 포워딩 터널 정보에 대한 정보는 TEID와 전송 계층 주소를 포함한다.타겟 마스터 기지국에서 종료된 베어러의 경우, 타겟 마스터 기지국이 다운링크 데이터 포워딩을 수락하면, 타 겟 마스터 기지국은 직접 포워딩 경로 가용성에 대한 정보 및 핸드오버 요청 메시지로부터 수신된 시스템 내 핸 드오버인지 시스템 간 핸드오버인지에 대한 정보에 따라 데이터 포워딩 터널 정보에 전송 계층 주소를 할당한다. 예를 들어, 5G 시스템 내 핸드오버 및 직접 데이터 포워딩을 위해, 타겟 마스터 기지국은 Xn-U에 의해 지원되는 전송 계층 주소를 할당하거나 소스 기지국에 대해 예약된 전송 계층 주소 공간에서 전송 계층 주소를 할당하고; 5G 시스템 내 핸드오버 및 간접 데이터 포워딩을 위해, 타겟 마스터 기지국은 5G 코어 네트워크에 의해 지원되 는 전송 계층 주소를 할당하고; 4G에서 5G로의 시스템 간 핸드오버와 직접 데이터 포워딩을 위해, 타겟 마스터 기지국은 X2-U에 의해 지원되는 전송 계층 주소를 할당하거나 소스 eNB에 대해 예약된 전송 계층 주소 공간에서 전송 계층 주소를 할당하고; 4G에서 5G로의 시스템 간 핸드오버와 간접 데이터 포워딩을 위해, 타겟 마스터 기 지국은 5G 코어 네트워크에 의해 지원되는 전송 계층 주소를 할당한다. 타겟 마스터 기지국은 운영 및 관리 (O&M) 설정에 따라 소스 기지국 또는 소스 eNB 또는 X2-U 또는 Xn-U에 의해 지원되는 전송 계층 주소 버전을 알 거나; 또는 타겟 마스터 기지국은 O&M 설정에 따라 소스 기지국 또는 소스 eNB 또는 X2-U 또는 Xn-U를 위해 예 약된 전송 계층 주소 공간을 안다. 간접 데이터 포워딩의 경우, 타겟 마스터 기지국은 수신된 업링크(UL) 사용 자 평면(UP) 전송 계층 주소 정보에 따라 코어 네트워크에 의해 지원되는 전송 계층 주소 버전을 알아서, 대응 버전에 전송 계층 주소를 할당한다. 세컨더리 기지국에 의해 수신된 전송 계층 주소가 IPv4 및 IPv6를 포함하는 경우, 타겟 마스터 기지국은 자신에 의해 지원되는 전송 계층 주소의 버전에 따라 사용자 데이터 포워딩을 위한 대응 버전의 전송 계층 주소를 할당한다. 타겟 기지국은 데이터 포워딩 터널 정보를 코어 네트워크 또는 소스 기지국으로 전송한다. 데이터 포워딩 터널 정보는 타겟 기지국에 의해 할당된 데이터 포워딩 터널에 대한 정보 및/또는 세컨더리 기지국에 의해 할당된 데 이터 포워딩 터널에 대한 정보를 포함한다. 시스템 간 핸드오버를 위해, 타겟 기지국은 핸드오버 요청 확인응답 메시지를 코어 네트워크로 전송하고, 메시지는 데이터 포워딩 터널 정보를 포함한다. 직접 데이터 포워딩을 위 해, 타겟 기지국은 코어 네트워크를 통해 데이터 포워딩 터널 정보를 소스 기지국으로 전송한다. 시스템 내 핸 드오버 및 직접 데이터 포워딩을 위해, 타겟 기지국은 기지국 간 인터페이스(예를 들어, Xn) 또는 코어 네트워 크를 통해 소스 기지국으로 데이터 포워딩 터널 정보를 전송할 수 있다. 시스템 내 핸드오버 및 간접 데이터 포 워딩을 위해, 타겟 기지국은 데이터 포워딩 터널 정보를 코어 네트워크로 전송할 수 있고, 코어 네트워크는 간 접 데이터 포워딩 터널에 대한 정보를 할당하고 이를 소스 기지국으로 전송한다. 소스 기지국은 수신된 데이터 포워딩 터널 정보에 따라 데이터를 포워딩한다. 데이터 포워딩 터널 정보의 전송 계층 주소가 소스 기지국에 의해 사용되는 전송 계층 주소 버전과 매칭하므로, 데이터 포워딩은 적절하게 수행 될 수 있다. 따라서, 사용자 데이터가 손실되지 않고 사용자 경험이 손상되지 않는 것이 보장된다. 지금까지, 본 개시내용의 제16 실시예의 설명이 완료되었다. 이 방법으로, 단일 연결에서 이중 연결로의 핸드오 버 절차에서, 타겟 마스터 기지국과 타겟 세컨더리 기지국은 데이터 포워딩이 적절하게 수행되는 것을 보장하기 위해 적절한 데이터 포워딩 터널 정보를 할당하고, 핸드오버 절차 동안 데이터 손실을 줄이고 핸드오버 성능을 향상시킨다. 도 19는 본 개시내용에 따른 네트워크 노드 디바이스의 블록도를 예시한다. 네트워크의 노드 디바이스는 본 개시내용의 DU, CU-UP, CU-CP, gNB, eNB 소스 기지국, 타겟 기지국, 소스 DU, 소스 CU-UP, 소스 CU-CP, 타겟 DU, 타겟 CU-UP, 타겟 CU-CP, 마스터 기지국, 세컨더리 기지국 등을 구현하는 데 사용될 수 있다. 도 19를 참조하면, 본 개시내용에 따른 네트워크 디바이스는 트랜시버, 제어기 및 메모리를 포함한다. 트랜시버, 제어기 및 메모리는 본 개시내용의 방법 및/또는 실시 예의 동작을 수행하도록 구성된다. 트랜시버, 제어기 및 메모리가 별개의 엔티티로 도시되었 지만, 이들은 단일 칩과 같은 단일 엔티티로 구현될 수 있다. 트랜시버, 제어기 및 메모리는 서로 전기적으로 연결되거나 결합될 수 있다. 트랜시버는 다른 네트워크 디바이스에 신호를 전송하고 UE, 기지국 또는 코어 네트워크 노드와 같은 다른 네트워크 엔티티로부터 신호를 수신할 수 있다. 제어기는 하나 이상의 프로세싱 유닛을 포함할 수 있고, 위의 실시예 중 하나에 따른 동작 및/또는 기능을 수행하도록 네 트워크 디바이스를 제어할 수 있다. 메모리는 위의 실시예 중 하나의 동작 및/또는 기능을 구현하기 위한 명령을 저장할 수 있다. 본 개시내용이 다양한 실시예로 설명되었지만, 다양한 변경 및 수정은 통상의 기술자에게 제안될 수 있다. 본 개시내용이 첨부된 청구범위 내에 속하는 그러한 변경 및 수정을 포함하는 것으로 의도된다. 산업상 이용가능성 본 개시내용은 무선 통신 시스템에서 핸드오버를 제공하는 데 사용될 수 있다."}
{"patent_id": "10-2023-7035692", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시내용의 소정 실시예의 상기 및 다른 양태, 특징 및 장점은 첨부 도면과 함께 취해진 다음의 설명으로부 터 더욱 명백해질 것이다. 도 1은 SAE(system architecture evolution)의 시스템 아키텍처 다이어그램을 예시한다. 도 2는 5G의 초기 전체 아키텍처의 개략도를 예시한다. 도 3은 본 개시내용의 실시예에 따른 제1 실시예의 개략도를 예시한다. 도 4는 본 개시내용의 실시예에 따른 제2 실시예의 개략도를 예시한다. 도 5는 본 개시내용의 실시예에 따른 제3 실시예의 개략도를 예시한다. 도 6은 본 개시내용의 실시예에 따른 제4 실시예의 개략도를 예시한다. 도 7은 본 개시내용의 실시예에 따른 제5 실시예의 개략도를 예시한다.도 8은 본 개시내용의 실시예에 따른 제6 실시예의 개략도를 예시한다. 도 9는 본 개시내용의 실시예에 따른 제7 실시예의 개략도를 예시한다. 도 10은 본 개시내용의 실시예에 따른 제8 실시예의 개략도를 예시한다. 도 11은 본 개시내용의 실시예에 따른 제9 실시예의 개략도를 예시한다. 도 12는 본 개시내용의 실시예에 따른 제10 실시예의 개략도를 예시한다. 도 13은 본 개시내용의 실시예에 따른 제11 실시예의 개략도를 예시한다. 도 14는 본 개시내용의 실시예에 따른 제12 실시예의 개략도를 예시한다. 도 15는 본 개시내용의 실시예에 따른 제13 실시예의 개략도를 예시한다. 도 16은 본 개시내용의 실시예에 따른 제14 실시예의 개략도를 예시한다. 도 17은 본 개시내용의 실시예에 따른 제15 실시예의 개략도를 예시한다. 도 18은 본 개시내용의 실시예에 따른 제16 실시예의 개략도를 예시한다. 도 19는 본 개시내용의 일 실시예에 따른 네트워크 노드 디바이스의 블록도를 예시한다."}
