{"patent_id": "10-2022-0136050", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0055582", "출원번호": "10-2022-0136050", "발명의 명칭": "멀미를 예방하는 가상현실 글래스 장치 및 가상현실 글래스 장치의 멀미 예방 방법", "출원인": "주식회사 피앤씨솔루션", "발명자": "최치원"}}
{"patent_id": "10-2022-0136050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가상현실 글래스 장치(100)로서,착용자의 시야(10)를 통해 가상현실 콘텐츠(20)를 제공하는 디스플레이부(110);상기 착용자의 움직임 정보를 수집하는 센서부(120);상기 센서부(120)에서 수집한 움직임 정보에 따른 영상이 상기 디스플레이부(110)로 출력되도록 상기 가상현실콘텐츠(20)를 제어하는 콘텐츠 제어부(130); 및상기 가상현실 콘텐츠(20)를 경험하는 착용자의 시야(10)의 일부에 멀미 예방 이미지(30)가 표시되도록 상기 디스플레이부(110)로 상기 멀미 예방 이미지(30)를 전달하고 출력을 제어하는 멀미 예방 제어부(150)를 포함하며,상기 멀미 예방 이미지(30)는,상기 센서부(120)에서 수집되는 움직임 정보 또는 상기 콘텐츠 제어부(130)의 가상현실 콘텐츠(20) 제어와 관계없이, 중력 방향을 기준으로 고정된 수평선 이미지를 포함하는 것을 특징으로 하는, 멀미를 예방하는 가상현실글래스 장치(100)."}
{"patent_id": "10-2022-0136050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,멀미 발생 신호를 생성해 상기 멀미 예방 제어부(150)에 전달하는 멀미 발생 신호부(140)를 더 포함하며,상기 멀미 예방 제어부(150)는,상기 멀미 발생 신호를 전달받으면 상기 멀미 예방 이미지(30)가 미리 정해진 시간 동안 출력되도록 제어하는것을 특징으로 하는, 멀미를 예방하는 가상현실 글래스 장치(100)."}
{"patent_id": "10-2022-0136050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 멀미 발생 신호부(140)는,상기 센서부(120)에서 수집하는 움직임 정보 및 상기 콘텐츠 제어부(130)에 의해 제어되는 가상현실 콘텐츠(20)의 화면 이동 정보를 분석해, 상기 멀미 발생 신호를 생성하는 것을 특징으로 하는, 멀미를 예방하는 가상현실 글래스 장치(100)."}
{"patent_id": "10-2022-0136050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 멀미 발생 신호부(140)는,착용자로부터 입력받은 멀미 신호에 따라 멀미 발생 신호를 생성하는 것을 특징으로 하는, 멀미를 예방하는 가상현실 글래스 장치(100)."}
{"patent_id": "10-2022-0136050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 멀미 예방 이미지(30)는,중력 방향을 기준으로 고정된 수평선 아래로 상기 착용자의 시야(10) 하단 영역을 차지하며, 상기 가상현실 콘공개특허 10-2024-0055582-3-텐츠(20)의 적어도 일부가 투과되는 것을 특징으로 하는, 멀미를 예방하는 가상현실 글래스 장치(100)."}
{"patent_id": "10-2022-0136050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 멀미 예방 이미지(30)는,중력 방향을 기준으로 고정된 미리 설정된 두께의 수평선이며, 상기 착용자의 시야(10) 중심을 지나는 것을 특징으로 하는, 멀미를 예방하는 가상현실 글래스 장치(100)."}
{"patent_id": "10-2022-0136050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "멀미 예방 방법으로서,착용자의 시야(10)를 통해 가상현실 콘텐츠(20)를 제공하는 디스플레이부(110);상기 착용자의 움직임 정보를 수집하는 센서부(120);상기 센서부(120)에서 수집한 움직임 정보에 따른 영상이 상기 디스플레이부(110)로 출력되도록 상기 가상현실콘텐츠(20)를 제어하는 콘텐츠 제어부(130)를 포함하는 가상현실 글래스 장치(100)에서 각 단계가 수행되는 멀미 예방 방법으로서,(1) 멀미 발생 신호를 생성하는 단계; 및(2) 상기 가상현실 콘텐츠(20)를 경험하는 착용자의 시야(10)의 일부에 멀미 예방 이미지(30)가 표시되도록 상기 디스플레이부(110)로 상기 멀미 예방 이미지(30)를 전달하고 출력을 제어하는 단계를 포함하며,상기 멀미 예방 이미지(30)는,상기 센서부(120)에서 수집되는 움직임 정보 또는 상기 콘텐츠 제어부(130)의 가상현실 콘텐츠(20) 제어와 관계없이, 중력 방향을 기준으로 고정된 수평선 이미지를 포함하는 것을 특징으로 하는, 가상현실 글래스 장치(100)의 멀미 예방 방법."}
{"patent_id": "10-2022-0136050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 단계 (2)에서는,상기 멀미 발생 신호를 전달받으면 상기 멀미 예방 이미지(30)가 미리 정해진 시간 동안 출력되도록 제어하는것을 특징으로 하는, 가상현실 글래스 장치(100)의 멀미 예방 방법."}
{"patent_id": "10-2022-0136050", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 멀미를 예방하는 가상현실 글래스 장치에 관한 것으로서, 보다 구체적으로는 가상현실 글래스 장치로 서, 착용자의 시야를 통해 가상현실 콘텐츠를 제공하는 디스플레이부; 상기 착용자의 움직임 정보를 수집하는 센 서부; 상기 센서부에서 수집한 움직임 정보에 따른 영상이 상기 디스플레이부로 출력되도록 상기 가상현실 콘텐 (뒷면에 계속)"}
{"patent_id": "10-2022-0136050", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 멀미 예방에 관한 것으로서, 보다 구체적으로는 멀미를 예방하는 가상현실 글래스 장치 및 가상현실 글래스 장치의 멀미 예방 방법에 관한 것이다."}
{"patent_id": "10-2022-0136050", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "디지털 디바이스의 경량화 및 소형화 추세에 따라 다양한 웨어러블 디바이스(wearable device)들이 개발되고 있 다. 이러한 웨어러블 디바이스의 일종인 헤드 마운티드 디스플레이(Head Mounted Display)는 사용자가 머리에 착용하여 멀티미디어 컨텐츠 등을 제공받을 수 있는 각종 디바이스를 의미한다. 여기서, 헤드 마운티드 디스플 레이(HMD)는 사용자의 신체에 착용 되어 사용자가 이동함에 따라서 다양한 환경에서 사용자에게 영상을 제공하 게 된다. 이러한 헤드 마운티드 디스플레이(HMD)는 투과(see-through)형과 밀폐(see-closed)형으로 구분되고 있으며, 투과형은 주로 증강현실(Augmented Reality, AR)용으로 사용되고, 밀폐형은 주로 가상현실(Virtual Reality, VR)용으로 사용되고 있다.VR HMD와 같은 가상현실 단말기들이 개발 및 보급됨에 따라 많은 가상현실 콘텐츠, 특히 가상현실 게임의 개발 이 가속화되고 있다. 이러한 가상현실 단말기의 사용에 따라 ‘3D 멀미’라는 새로운 단어가 함께 떠올랐다. 이는 시각의 활용 비중이 높은 3D HMD 기기를 착용하고 가상현실 콘텐츠를 이용하는 중에 멀미를 느끼는 사용자 가 많아졌음을 의미한다. 이러한 ‘3D 멀미’는 멀미의 일종이므로, 일반적인 멀미와 같이 시각과 다른 신체 평형감각의 차이가 클 때 발생한다. 가상현실 게임의 대부분은 몰입도를 높이기 위해 주로 1인칭 시점으로 구현하는 경향이 있으며, 1인칭 시점으로 3차원 공간 내에서 이동함으로써 현실감을 극대화할 수 있다. 그러나 대부분의 가상현실 콘텐츠의 이용은 제한 된 공간 내에서 이루어지므로, 실제 신체의 이동은 제한되어 있다. 따라서 가상현실 화면상에서는 진동 또는 움직임을 인식하지만 실제로는 진동이나 움직임이 없거나 시각적 자극과는 다르므로 3D 멀미가 유발되게 된다. 따라서 가상현실 콘텐츠의 이용 시 멀미를 예방하기 위한 기술의 개발이 필요한 실정이다. 전술한 배경 기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지 기술이라 할 수는 없다. 한편, 본 발명과 관련된 선행기술로 등록특허 제10-2403915호(발명의 명칭: 멀미를 겪지 않고 차량에서 디지털 콘텐츠 보기, 등록일자: 2022년 05월 26일) 등이 개시된 바 있다."}
{"patent_id": "10-2022-0136050", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존에 제안된 방법들의 상기와 같은 문제점들을 해결하기 위해 제안된 것으로서, 가상현실 글래스 장치를 착용한 착용자에게 가상현실 콘텐츠를 제공하되, 착용자의 움직임 또는 가상현실 콘텐츠 제어와 관계없 이 중력 방향을 기준으로 고정된 수평선을 포함하는 멀미 예방 이미지를 착용자의 시야의 일부에 표시함으로써, 시야를 통해 보이는 멀미 예방 이미지의 움직임을 귀의 평형감각 기관에서 느끼는 움직임과 일치시켜 멀미 증상 을 예방 및 완화할 수 있는, 멀미를 예방하는 가상현실 글래스 장치 및 가상현실 글래스 장치의 멀미 예방 방법 을 제공하는 것을 그 목적으로 한다."}
{"patent_id": "10-2022-0136050", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 특징에 따른 멀미를 예방하는 가상현실 글래스 장치는, 가상현실 글래스 장치로서, 착용자의 시야를 통해 가상현실 콘텐츠를 제공하는 디스플레이부; 상기 착용자의 움직임 정보를 수집하는 센서부; 상기 센서부에서 수집한 움직임 정보에 따른 영상이 상기 디스플레이부로 출력되도록 상기 가상현실 콘텐츠를 제어하는 콘텐츠 제어부; 및 상기 가상현실 콘텐츠를 경험하는 착용자의 시야의 일부에 멀미 예방 이미지가 표시되도록 상기 디스플레이부로 상기 멀미 예방 이미지를 전달하고 출력을 제어하는 멀미 예방 제어부를 포함하며, 상기 멀미 예방 이미지는, 상기 센서부에서 수집되는 움직임 정보 또는 상기 콘텐츠 제어부의 가상현실 콘텐츠 제어와 관계없이, 중력 방 향을 기준으로 고정된 수평선 이미지를 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 멀미 발생 신호를 생성해 상기 멀미 예방 제어부에 전달하는 멀미 발생 신호부를 더 포함하며, 상기 멀미 예방 제어부는, 상기 멀미 발생 신호를 전달받으면 상기 멀미 예방 이미지가 미리 정해진 시간 동안 출력되도록 제어할 수 있다. 더욱 바람직하게는, 상기 멀미 발생 신호부는, 상기 센서부에서 수집하는 움직임 정보 및 상기 콘텐츠 제어부에 의해 제어되는 가상현실 콘텐츠의 화면 이동 정보를 분석해, 상기 멀미 발생 신호를 생성할 수 있다. 더욱 바람직하게는, 상기 멀미 발생 신호부는, 착용자로부터 입력받은 멀미 신호에 따라 멀미 발생 신호를 생성할 수 있다. 바람직하게는, 상기 멀미 예방 이미지는, 중력 방향을 기준으로 고정된 수평선 아래로 상기 착용자의 시야 하단 영역을 차지하며, 상기 가상현실 콘텐츠 의 적어도 일부가 투과될 수 있다. 바람직하게는, 상기 멀미 예방 이미지는, 중력 방향을 기준으로 고정된 미리 설정된 두께의 수평선이며, 상기 착용자의 시야 중심을 지날 수 있다. 상기한 목적을 달성하기 위한 가상현실 글래스 장치의 멀미 예방 방법은, 멀미 예방 방법으로서, 착용자의 시야를 통해 가상현실 콘텐츠를 제공하는 디스플레이부; 상기 착용자의 움직임 정보를 수집하는 센서부; 상기 센서부에서 수집한 움직임 정보에 따른 영상이 상기 디스플레이부로 출력되도록 상기 가상현실 콘텐츠를 제어하는 콘텐츠 제어부를 포함하는 가상현실 글래스 장치에서 각 단계가 수행되는 멀미 예방 방법으로서, 멀미 발생 신호를 생성하는 단계; 및 상기 가상현실 콘텐츠를 경험하는 착용자의 시야의 일부에 멀미 예방 이미지가 표시되도록 상기 디스플레이 부로 상기 멀미 예방 이미지를 전달하고 출력을 제어하는 단계를 포함하며, 상기 멀미 예방 이미지는, 상기 센서부에서 수집되는 움직임 정보 또는 상기 콘텐츠 제어부의 가상현실 콘텐츠 제어와 관계없이, 중력 방 향을 기준으로 고정된 수평선 이미지를 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 단계 에서는, 상기 멀미 발생 신호를 전달받으면 상기 멀미 예방 이미지가 미리 정해진 시간 동안 출력되도록 제어할 수 있다."}
{"patent_id": "10-2022-0136050", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안하고 있는 멀미를 예방하는 가상현실 글래스 장치 및 가상현실 글래스 장치의 멀미 예방 방법 에 따르면, 가상현실 글래스 장치를 착용한 착용자에게 가상현실 콘텐츠를 제공하되, 착용자의 움직임 또는 가상현실 콘텐츠 제어와 관계없이 중력 방향을 기준으로 고정된 수평선을 포함하는 멀미 예방 이미지를 착용자의 시야의 일부에 표시함으로써, 시야를 통해 보이는 멀미 예방 이미지의 움직임을 귀의 평형감각 기관에서 느끼는 움직임과 일치시켜 멀미 증상을 예방 및 완화할 수 있다."}
{"patent_id": "10-2022-0136050", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단 되는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 ‘연결’ 되어 있다고 할 때, 이는 ‘직접적으로 연결’ 되 어 있는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 ‘간접적으로 연결’ 되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 ‘포함’ 한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제 외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 도 1은 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치의 구성을 도시한 도면이다. 도 1에 도시된 바와 같이, 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치는, 디스플레이 부, 센서부, 콘텐츠 제어부 및 멀미 예방 제어부를 포함하여 구성될 수 있으며, 멀미 발생 신호부를 더 포함하여 구성될 수 있다. 즉, 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치는 착용자에게 가상현실 콘텐츠를 제공하되, 착용자의 움직임 또는 가상현실 콘텐츠 제어와 관계없이 중력 방향을 기준으로 고정된 수평선을 포함 하는 멀미 예방 이미지를 착용자의 시야의 일부에 표시함으로써, 시야를 통해 보이는 멀미 예방 이미지의 움직 임을 귀의 평형감각 기관에서 느끼는 움직임과 일치시켜 멀미 증상을 예방 및 완화할 수 있다. 도 2 및 도 3은 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치에서, 반투명 면적의 멀 미 예방 이미지가 표시된 모습을 예를 들어 도시한 도면이다. 도 2 및 도 3의 (a)에는 착용자의 시야 부분이 흰색 사각형으로 표시된 가상현실 콘텐츠 전체 화면, 도 2 및 도 3의 (b)에는 착용자가 가상현실 글 래스 장치를 통해 바라보는 시야를 각각 도시하였다. 여기서, 멀미 예방 이미지는, 중력 방향을 기준으로 고정되어 된 수평선 아래로 착용자의 시야 하단 영역을 차지하며, 가상현실 콘텐츠의 적어도 일부가 투과될 수 있다. 즉, 도 2 및 도 3의 (a)에서 반투명한 직사각형으로 표시된 도형이 멀미 예방 이미지 이다. 도 2 및 도 3에 도시된 바와 같이, 착용자가 몸이나 얼굴을 움직임에 따라 가상현실 콘텐츠가 제어되어 착용자의 시야도 변화하게 되지만, 멀미 예방 이미지는 중력 방향을 기준으로 고정된 것을 확 인할 수 있다. 이와 같이, 가상현실 콘텐츠의 변화에도 불구하고 멀미 예방 이미지는 착용자 시야(1 0)의 수직 중심축의 미리 설정된 위치에 고정되어, 시야 하단에 물이 차 있는 것과 같은 방식으로 움직일 수 있다. 특히, 멀미 예방 이미지인 반투명한 직사각형의 윗변이 착용자의 시야를 가로지르도록 하여,중력 방향으로 고정된 수평선을 포함할 수 있다. 도 4 및 도 5는 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치에서, 시야의 중심 을 지나는 수평선의 멀미 예방 이미지가 표시된 모습을 예를 들어 도시한 도면이다. 도 4 및 도 5의 (a)에 는 착용자의 시야 부분이 흰색 사각형으로 표시된 가상현실 콘텐츠 전체 화면, 도 4 및 도 5의 (b)에는 착용자가 가상현실 글래스 장치를 통해 바라보는 시야를 각각 도시하였다. 여기서, 멀미 예방 이미지 는, 중력 방향을 기준으로 고정된 미리 설정된 두께의 수평선이며, 착용자의 시야 중심을 지날 수 있다. 즉, 도 4 및 도 5에서 붉은색 직선이 멀미 예방 이미지이다. 도 4 및 도 5에 도시된 바와 같이, 착 용자가 몸이나 얼굴을 움직이면 가상현실 콘텐츠가 제어되어 착용자의 시야도 변화하게 되지만, 멀미 예방 이미지는 중력 방향을 기준으로 고정된 것을 확인할 수 있다. 본 발명은 이동 중인 차량 등에 탑승했을 때 멀미 증상이 나타나면 원거리의 수평선을 응시하는 것으로 멀미를 완화할 수 있는 것에 착안한 것이다. 그러나 가상현실 콘텐츠 이용 중에는 외부를 볼 수 없으므로 중력 방 향을 기준으로 고정된 수평선 이미지를 포함하는 반투명 직사각형이나 직선 등의 멀미 예방 이미지를 사용 해 3차원 가상현실 환경에 수평선의 시각 효과를 줄 수 있다. 이러한 시각 효과를 통해, 시각(눈)과 전정감각 (귀)의 신체 평형감각 신호가 조화를 이루도록 하며, 이를 통해 신경계의 혼란을 완화해 95%의 확률로 멀미를 예방할 수 있다. 또한, 멀미 예방 이미지는 반투명 직사각형이나 직선 등의 형태로 가상현실 콘텐츠의 이용을 크게 방해하지 않으면서도, 착용자의 시야 전체에 영향을 주어 시선을 어디에 두더라도 뇌에서 안정 감을 느낄 수 있다. 이하에서는, 도 1 내지 도 5를 참조하여 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치 의 각 구성에 대해 상세히 설명하도록 한다. 디스플레이부는, 착용자의 시야를 통해 가상현실 콘텐츠를 제공할 수 있다. 즉, 디스플레이부 는 가상현실 콘텐츠의 영상 정보가 착용자에게 제공되도록 영상 광을 출력할 수 있다. 디스플레이부 는, 착용자가 시야를 통해 가상현실을 경험할 수 있도록 하는 구성으로, VR 글래스의 핵심적인 구성일 수 있다. 디스플레이부는, 양안 디스플레이를 위해 한 쌍의 디스플레이로 구성될 수 있으며, 디스플레이 는 OLED, LCoS(Liquid Crystal on Silicon) 등 다양하게 구성될 수 있다. 센서부는, 착용자의 움직임 정보를 수집할 수 있다. 여기서, 센서부는 가상현실 글래스 장치에 설치되며, 다양한 센서를 포함해 착용자의 머리, 눈 등의 움직임을 추적해 움직임 정보를 수집할 수 있다. 보 다 구체적으로, GPS 모듈, IMU 센서, 카메라 센서 등을 이용해 착용자의 신체 특히 머리 움직임을 추적할 수 있 고, 가상현실 글래스 장치의 안쪽에 착용자의 눈을 향하도록 배치된 아이트래킹 센서, 카메라 센서 등을 이용해 착용자의 눈 또는 동공 움직임을 추적할 수 있다. 콘텐츠 제어부는, 센서부에서 수집한 움직임 정보에 따른 영상이 디스플레이부로 출력되도록 가 상현실 콘텐츠를 제어할 수 있다. 즉, 가상현실 콘텐츠는 착용자의 움직임과 상호작용하여, 착용자에 게 최적화된 형태로 제공될 수 있다. 예를 들어, 도 2 내지 도 5에 도시된 바와 같이, 착용자의 머리 움직임 정보에 따라 가상현실 콘텐츠가 제어되어 착용자의 시야로 보이는 영상의 종류, 방향, 크기, 각도 등이 변경될 수 있다. 이와 같이 콘텐츠 제어부가 가상현실 콘텐츠를 제어함으로써, 착용자는 현장감과 몰 입감을 느낄 수 있게 된다. 멀미 발생 신호부는, 멀미 발생 신호를 생성해 멀미 예방 제어부에 전달할 수 있다. 이때, 멀미 발 생 신호부는, 착용자로부터 입력받은 멀미 신호에 따라 멀미 발생 신호를 생성할 수 있다. 멀미 신호는 가상현실 글래스 장치의 일측에 구비된 입력 장치나 컨트롤러의 조작, 착용자의 음성인식 등을 통해 입력받을 수 있다. 실시예에 따라서, 멀미 발생 신호부는, 센서부에서 수집하는 움직임 정보 및 콘텐츠 제어부에 의해 제어되는 가상현실 콘텐츠의 화면 이동 정보를 분석해, 멀미 발생 신호를 생성할 수 있다. 보다 구체 적으로, 멀미 발생 신호부는, 센서부에서 수집하는 머리 또는 동공의 움직임 정보로부터 실제 착용자 의 움직임 방향과 속도 등을 분석하고, 가상현실 콘텐츠의 화면 이동 정보로부터 시야를 통해 감각되는 움직임 방향과 속도 등을 분석할 수 있다. 실제 착용자의 움직임 방향과 속도, 시야를 통해 감각되는 움직 임 방향과 속도를 서로 비교하여, 불일치 정도가 미리 설정된 값을 초과하면 멀미 발생으로 추정하고 멀미 발생 신호를 생성할 수 있다. 이때, 실제 움직임과 시야에 의해 감각되는 움직임의 차이가 크고 경과 시간이 길 수록 불일치 정도는 클 수 있다. 또한, 멀미 발생 신호부는, 센서부에서 수집하는 움직임 정보와 가상현실 콘텐츠의 화면 이동 정 보를 입력 데이터로 하고, 멀미 발생을 출력 데이터로 하여 학습 완료된 인공지능 모델을 사용해 멀미 발생을 예측하고, 예측 결과에 따라 멀미 발생 신호를 생성할 수 있다. 실시예에 따라서, 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치의 멀미 발생 신호부 는, 전이 학습(Transfer learning)을 사용해 학습된 인공지능 모델을 사용할 수 있다. 전이 학습은 새로 운 문제에 대해 사전 훈련된 모델을 재사용하는 것이다. 이미 훈련된 모델을 사용하므로, 상대적으로 적은 데 이터로 깊은 신경망을 훈련시킬 수 있는 장점이 있다. 또한, 대부분의 실제 문제들은 일반적으로 복잡한 모델 을 훈련시키기 위해 수백만 개의 라벨이 붙은 데이터를 가지고 있지 않기 때문에 유용하게 사용될 수 있다. 멀미 발생은 개인차가 매우 크므로, 멀미 발생 신호부는 사전 학습된 인공지능 모델을 사용하되, 착용자로 부터 수집한 정보(움직임 정보와 화면 이동 정보, 멀미 발생 정보 등)를 이용해 전이 학습을 수행함으로써, 개 별 착용자에게 최적화된 멀미 예측 모델을 생성할 수 있다. 이러한 멀미 예측 모델은 착용자 개인의 특성을 효 과적으로 반영함으로써, 착용자의 멀미 발생을 높은 정확도로 예측할 수 있다. 멀미 예방 제어부는, 가상현실 콘텐츠를 경험하는 착용자의 시야의 일부에 멀미 예방 이미지 가 표시되도록 디스플레이부로 멀미 예방 이미지를 전달하고 출력을 제어할 수 있다. 보다 구체적으 로, 멀미 예방 제어부는, 멀미 발생 신호를 전달받으면 멀미 예방 이미지가 미리 정해진 시간 동안 출 력되도록 제어할 수 있다. 즉, 도 2 내지 도 5에 도시된 바와 같이, 멀미 예방 이미지는 반투명 직사각형이나 직선으로 구현하여 가상 현실 콘텐츠에 가능한 방해가 되지 않도록 함에도 불구하고, 멀미 예방 이미지가 표시되면 가상현실 몰 입에 방해가 될 수 있다. 따라서 멀미 예방 제어부는 멀미 발생 신호를 전달받으면 미리 정해진 시간 동 안만 멀미 예방 이미지를 출력하고 미리 정해진 시간이 경과하면 멀미 예방 이미지의 출력을 중단할 수 있다. 여기서, 미리 정해진 시간은 10분 이상 15분 이하일 수 있으나, 미리 설정된 시간은 착용자에 따라 상이 할 수 있다. 도 6은 본 발명의 일실시예에 따른 가상현실 글래스 장치의 멀미 예방 방법의 흐름을 도시한 도면이다. 도 6에 도시된 바와 같이, 본 발명의 일실시예에 따른 가상현실 글래스 장치의 멀미 예방 방법은, 본 발명 의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치에서 각 단계가 수행될 수 있으며, 멀미 발생 신호를 생성하는 단계(S100), 및 가상현실 콘텐츠를 경험하는 착용자의 시야의 일부에 멀미 예방 이미 지가 출력되도록 디스플레이부로 멀미 예방 이미지를 전달해 제어하는 단계(S200)를 포함하여 구 현될 수 있다.본 발명은 가상현실 글래스 장치의 멀미 예방 방법에 관한 것으로서, 본 발명의 특징에 따른 가상현실 글 래스 장치의 멀미 예방 방법은, 메모리 및 프로세서를 포함한 하드웨어에서 기록되는 소프트웨어로 구성될 수 있다. 각각의 단계들과 관련된 상세한 내용들은, 앞서 본 발명의 일실시예에 따른 멀미를 예방하는 가상현 실 글래스 장치와 관련하여 충분히 설명되었으므로 상세한 설명은 생략하기로 한다. 전술한 바와 같이, 본 발명에서 제안하고 있는 멀미를 예방하는 가상현실 글래스 장치 및 가상현실 글래스 장치의 멀미 예방 방법에 따르면, 가상현실 글래스 장치를 착용한 착용자에게 가상현실 콘텐츠를 제공하되, 착용자의 움직임 또는 가상현실 콘텐츠 제어와 관계없이 중력 방향을 기준으로 고정된 수평선을 포함하는 멀미 예방 이미지를 착용자의 시야의 일부에 표시함으로써, 시야를 통해 보이는 멀미 예 방 이미지의 움직임을 귀의 평형감각 기관에서 느끼는 움직임과 일치시켜 멀미 증상을 예방 및 완화할 수 있다. 한편, 본 발명은 다양한 통신 단말기로 구현되는 동작을 수행하기 위한 프로그램 명령을 포함하는 컴퓨터에서 판독 가능한 매체를 포함할 수 있다. 예를 들어, 컴퓨터에서 판독 가능한 매체는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD_ROM, DVD와 같은 광기록 매체(optical media), 플롭티 컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 이와 같은 컴퓨터에서 판독 가능한 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합 하여 포함할 수 있다. 이때, 컴퓨터에서 판독 가능한 매체에 기록되는 프로그램 명령은 본 발명을 구현하기 위 하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 예를 들어, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해 실행될 수 있는 고급 언어 코드를 포함할 수 있다."}
{"patent_id": "10-2022-0136050", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 설명한 본 발명은 본 발명이 속한 기술분야에서 통상의 지식을 가진 자에 의하여 다양한 변형이나 응용이 가능하며, 본 발명에 따른 기술적 사상의 범위는 아래의 특허청구범위에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2022-0136050", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치의 구성을 도시한 도면. 도 2 및 도 3은 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치에서, 반투명 면적의 멀미 예 방 이미지가 표시된 모습을 예를 들어 도시한 도면. 도 4 및 도 5는 본 발명의 일실시예에 따른 멀미를 예방하는 가상현실 글래스 장치에서, 시야의 중심을 지나는 수평선의 멀미 예방 이미지가 표시된 모습을 예를 들어 도시한 도면. 도 6은 본 발명의 일실시예에 따른 가상현실 글래스 장치의 멀미 예방 방법의 흐름을 도시한 도면."}
