{"patent_id": "10-2015-0092549", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0052309", "출원번호": "10-2015-0092549", "발명의 명칭": "전자 장치 및 전자 장치에서 얼굴 정보를 분석하는 방법", "출원인": "삼성전자주식회사", "발명자": "손주영"}}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에서 얼굴 정보를 분석하는 방법에 있어서,카메라 모듈을 통해 촬영중인 이미지에서 적어도 하나의 얼굴 영역을 검출하는 동작과,상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하는 동작과,상기 세부 촬영된 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적어도 하나의 얼굴 영역은,눈, 코, 볼, 입 혹은 이마 중 적어도 하나의 주변 영역을 포함함을 특징으로 하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 적어도 하나의 분석 항목은,주름, 여드름, 색소 침착, 피부톤, 다크 서클 혹은 모공 중 적어도 하나를 포함함을 특징으로 하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 분석하는 동작은,상기 세부 촬영된 얼굴 영역에서 각 하나의 분석 항목에 대한 굵기, 크기, 개수, 넓이 혹은 색 중 적어도 하나를 분석하는 동작을 포함함을 특징으로 하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 이미지에서의 특정 영역에 대해 제스처가 입력되는 경우, 상기 제스처가 감지된 영역에 대해 세부 촬영된이미지를 디스플레이하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 이미지에서 미리 설정된 적어도 하나의 분석 항목에 대한 얼굴 영역을 검출하는 동작과,상기 검출된 얼굴 영역을 상기 미리 설정된 분석 항목에 따라 분석하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 적어도 하나의 얼굴 영역이 검출됨과 동시에 상기 검출된 얼굴 영역을 세부 촬영한 화면을 디스플레이하는동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2016-0052309-3-제1항에 있어서,미리 설정된 동작이 감지되는 경우, 상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하는 동작을 더 포함하는방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 미리 설정된 동작은,상기 카메라 모듈이 활성화되는 애플리케이션을 실행하는 동작, 잠금 상태의 상기 전자 장치를 활성화시키는 동작, 상기 전자 장치를 특정 각도 혹은 방향에 위치하는 동작 중 어느 하나를 포함함을 특징으로 하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,특정 얼굴 영역 혹은 분석 항목에 대하여, 미리 저장된 분석 결과를 확인하는 동작과,상기 확인된 미리 저장된 분석한 결과를 상기 분석의 결과와 비교하고, 상기 비교의 결과를 디스플레이하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에 있어서,카메라 모듈,상기 카메라 모듈을 통해 촬영중인 이미지를 디스플레이하는 표시부, 및상기 이미지에서 적어도 하나의 얼굴 영역을 검출하고, 상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하도록 상기 카메라 모듈을 제어하고, 상기 세부 촬영된 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석하는 제어부를 포함하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 적어도 하나의 얼굴 영역은,눈, 코, 볼, 입 혹은 이마 중 적어도 하나의 주변 영역을 포함함을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 적어도 하나의 분석 항목은,주름, 여드름, 색소 침착, 피부톤, 다크 서클 혹은 모공 중 적어도 하나를 포함함을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제어부는,상기 세부 촬영된 얼굴 영역에서 각 하나의 분석 항목에 대한 굵기, 크기, 개수, 넓이 혹은 색 중 적어도 하나를 분석함을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 제어부는,공개특허 10-2016-0052309-4-상기 이미지에서의 특정 영역에 대해 제스처가 입력됨을 감지하는 경우, 상기 제스처가 감지된 영역에 대해 세부 촬영된 이미지가 디스플레이되도록 상기 표시부를 제어함을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 제어부는,상기 이미지에서 미리 설정된 적어도 하나의 분석 항목에 대한 얼굴 영역을 검출하고, 상기 검출된 얼굴 영역을상기 미리 설정된 분석 항목에 따라 분석함을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 제어부는,상기 적어도 하나의 얼굴 영역이 검출됨과 동시에 상기 세부 촬영된 얼굴 영역에 대한 화면이 디스플레이되도록상기 표시부를 제어함을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 제어부는,미리 설정된 동작이 감지되는 경우, 상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하도록 상기 카메라 모듈을 제어함을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 미리 설정된 동작은,상기 카메라 모듈이 활성화되는 애플리케이션을 실행하는 동작, 잠금 상태의 상기 전자 장치를 활성화시키는 동작, 상기 전자 장치를 특정 각도 혹은 방향에 위치하는 동작 중 어느 하나를 포함함을 특징으로 하는 전자장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 제어부는,특정 얼굴 영역 혹은 분석 항목에 대하여, 미리 저장된 분석 결과를 확인하고, 상기 확인된 미리 저장된 분석한결과를 상기 분석의 결과와 비교하고, 상기 비교의 결과를 포함하는 화면이 디스플레이되도록 상기 표시부를 제어함을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "전자 장치에서 얼굴 정보를 분석하는 방법에 있어서,저장된 적어도 하나의 이미지에서 얼굴 영역을 검출하는 동작과, 상기 검출된 적어도 하나의 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서, 상기 저장된 적어도 하나의 이미지에 적어도 하나의 기준점을 설정하여 상기 적어도 하나의 얼굴 영역을 검출하는 동작을 더 포함하는 방법.공개특허 10-2016-0052309-5-청구항 23 제21항에 있어서, 이전에 분석된 이미지들을 분석된 시점에 따라 정렬하고, 사용자 입력에 따라 선택된 시점에서 분석된 이미지를표시하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서, 상기 표시된 이미지를 확대, 축소 혹은 이동시키는 사용자 입력이 입력되는지를 감지하는 동작과, 상기 감지된 사용자 입력에 대응하여 변경된 이미지에 대해 적어도 하나의 분석 항목에 따라 분석한 결과를 출력하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제21항에 있어서, 상기 전자 장치가 이미지를 촬영하기 위한 미리 설정된 상황인지를 판단하는 동작과, 상기 판단 결과에 따라, 이미지를 촬영하는 동작을 더 포함하며, 상기 미리 설정된 상황은 상기 전자 장치가 미리 설정된 각도에 위치한 경우 혹은 미리 설정된 사용자 입력이입력되는 경우를 포함하는 방법."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "전자 장치에 있어서, 이미지를 촬영하는 카메라 모듈; 및 상기 카메라 모듈을 통해 촬영되어 저장된 적어도 하나의 이미지에서 얼굴 영역을 검출하고, 상기 검출된 적어도 하나의 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석하는 제어부;를 포함하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서, 상기 제어부;는, 상기 저장된 적어도 하나의 이미지에 적어도 하나의 기준점을 설정하여 상기 적어도 하나의 얼굴 영역을 검출하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제26항에 있어서, 표시부;를 더 포함하며, 상기 제어부;는, 이전에 분석된 이미지들을 분석된 시점에 따라 정렬하고, 사용자 입력에 따라 선택된 시점에서 분석된 이미지를상기 표시부를 통해 표시되도록 제어하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제28항에 있어서, 상기 제어부;는, 상기 표시된 이미지를 확대, 축소 혹은 이동시키는 사용자 입력이 입력되는지를 감지하고, 상기 감지된 사용자입력에 대응하여 변경된 이미지에 대해 적어도 하나의 분석 항목에 따라 분석한 결과를 상기 표시부를 통해 표시되도록 제어하는 전자 장치. 공개특허 10-2016-0052309-6-청구항 30 제26항에 있어서, 상기 제어부;는, 상기 전자 장치가 이미지를 촬영하기 위한 미리 설정된 상황인지를 판단하고, 상기 판단 결과에 따라 이미지를촬영하도록 상기 카메라 모듈을 제어하며, 상기 미리 설정된 상황은 상기 전자 장치가 미리 설정된 각도에 위치한 경우 혹은 미리 설정된 사용자 입력이 입력되는 경우를 포함하는 전자 장치."}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전자 장치 및 전자 장치에서 얼굴 정보를 분석하는 방법에 관한 것으로, 카메라 모듈을 통해 촬영중인 이미지에서 적어도 하나의 얼굴 영역을 검출하고, 상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하고, 상기 세부 촬영된 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석할 수 있으며, 그 외 다양한 실시 예가 가능할 수 있다."}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 전자 장치 및 전자 장치에서 얼굴 정보를 분석하는 방법에 관한 것이다."}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 사용되는 다양한 전자 장치들에는 다양한 기능들이 사용되도록 개발되고 있다. 예컨대, 전자 장치(예, 스 마트폰)에서는 이미지를 촬영할 뿐만 아니라 촬영되는 객체를 인식하는 기능까지도 제공할 수 있게 되었다. 이러한 전자 장치에는 다양한 기능들을 보다 효과적으로 이용할 수 있도록 표시부가 제공된다. 예컨대, 최근의 스마트폰의 경우 장치의 전면부가 터치에 의해 감응하는 표시부(예컨대, 터치 스크린)가 제공되고 있다. 또한, 전자 장치에서는 다양한 애플리케이션(예컨대, '앱(App)'이라고도 한다)들이 설치되어 실행될 수 있다. 상기 애플리케이션들을 전자 장치상에서 실행시키고 제어하기 위해서는 다양한 입력 수단들(예컨대, 터치 스크 린, 버튼, 마우스, 키보드, 센서 등)이 사용될 수 있다."}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치에서는 촬영중인 객체(예, 얼굴 영역)을 분석하기 위하여, 해당 객체가 확대 혹은 세부적으로 촬영된 이미지를 획득할 수 있다. 한편, 상기 확대 혹은 상세하게 촬영되는 이미지를 획득하기 위하여, 사용자는 촬영 될 객체를 확인하고 각 객체의 세부 영역에 포커스(focus)가 맞춰졌는지를 확인하여 전자 장치의 촬영 기능을 작동시킬 수 있다. 본 발명의 다양한 실시 예에 따라, 얼굴 정보(예, 얼굴 영역)가 확인되면, 어떠한 사용자의 제어 동작 없이, 상 기 확인된 부분을 확대하거나 혹은 자동으로 해당 부분을 포커싱(focusing)시켜 촬영하는, 전자 장치 및 전자 장치에서 얼굴 정보를 분석하는 방법을 제공할 수 있다."}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따른 전자 장치에서 얼굴 정보를 분석하는 방법은, 카메라 모듈을 통해 촬영중인 이미지에서 적어도 하나의 얼굴 영역을 검출하는 동작과, 상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하 는 동작과, 상기 세부 촬영된 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치는, 카메라 모듈과, 상기 카메라 모듈을 통해 촬영중인 이미지에서 적어도 하나의 얼굴 영역을 검출하고, 상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하도록 상기 카메라 모 듈을 제어하고, 상기 세부 촬영된 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따른 전자 장치 및 전자 장치에서 얼굴 정보를 분석하는 방법에 따라, 사용자는 어 떠한 동작 없이, 전자 장치를 통해 얼굴 정보 중 일부가 확대되거나 세부 촬영된 이미지를 획득하고, 상기 획득 한 이미지가 분석된 결과를 확인할 수 있다."}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시 예는 다양한 변경 을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들이 도면에 예시되고 관련된 상세한 설명 이 기재되어 있다. 그러나, 이는 본 발명의 다양한 실시 예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 다양한 실시 예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다.본 발명의 다양한 실시 예에서 사용될 수 있는“포함한다” 또는 “포함할 수 있다” 등의 표현은 개시 (disclosure)된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 발명의 다양한 실시 예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것 이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존 재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시 예에서 “또는” 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한 다. 예를 들어, “A 또는 B”는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시 예에서 사용된 “제 1,”“제2,”“첫째,”또는“둘째,”등의 표현들은 다양한 실시 예 들의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시 예의 권리 범위를 벗어나지 않으면서 제1 구 성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소 가 상기 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시 예에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명의 다양한 실시 예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 다양한 실시 예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미 를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시 예에서 명백하게 정의되지 않 는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 다양한 실시 예에 따른 전자 장치는, 카메라 모듈이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자 북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷 북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플 레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head- mounted-device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마 트 와치(smart watch)중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 카메라 모듈을 포함한 스마트 가전 제품(smart home appliance)일 수 있 다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉 장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더 (camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 카메라 모듈을 포함하며, 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이 션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장 치 및 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller’s machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 더 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 카메라 모듈을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발 명의 다양한 실시 예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 발명의 다양한 실시 예에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 발명의 다양한 실시 예에 따 른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 본 발명의 다양한 실시 예에 따라, 전자 장치가 분석할 수 있는 얼굴 정보에는 눈, 코, 이마, 볼, 등과 같은 얼 굴 영역 주변의 피부 정보를 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치에서는 적어도 하나의 분석 항목에 따른 피부 정보를 분석할 수 있 다. 예컨대, 얼굴 정보를 분석하기 위한 항목에는, 모공, 여드름, 색소 침착, 피부톤(skin tone), 다크 서클 (dark circle), 주름 등 다양한 피부 상태를 측정하기 위한 항목들을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치가 세부 촬영하는 동작은, 특정 이미지에서 어느 한 영역을 세부적 으로 촬영하기 위하여, 해당 영역을 포커싱시키고 확대하여 촬영하는 동작을 포함할 수 있다. 이하, 첨부된 도면을 참조하여 다양한 실시 예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시 예에서 이용 되는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치) 를 지칭할 수 있다. 도 1은 본 발명의 다양한 실시 예에 따른, 전자 장치 구성의 일 예를 도시한 블록도이다. 도 1을 참조하면, 전 자 장치는 제어부, 카메라 모듈, 입력부, 표시부, 혹은 저장부 중 적어도 하나 를 포함할 수 있다. 상기 제어부는 항목 설정부, 촬영 제어부, 이미지 분석부, 영역 선택부 혹은 분석 결 과 생성부 중 적어도 하나를 포함할 수 있으며, 전반적인 전자 장치의 동작을 제어할 수 있다. 상기 항목 설정부는 촬영된 이미지에서 특정 얼굴 영역을 확인하고, 상기 확인한 얼굴 영역 주변의 피부를 분석할 적어도 하나의 항목을 선택할 수 있다. 예컨대, 촬영된 이미지에서 눈 주변 영역이 확인되는 경우, 상기 항목 설정부는 상기 눈 주변 영역의 피부 상태를 분석할 항목으로, 주름 혹은 다크 서클 등을 설정할 수 있다. 다른 예로써, 촬영된 이미지에서 볼 영역이 확인되는 경우, 상기 항목 설정부는 상기 볼 영역의 피 부 상태를 분석할 항목으로 색소 침착, 점, 기미, 피부톤 등을 설정할 수 있다. 상기 촬영 제어부는 촬영 모드 중에 특정 얼굴 영역을 확인하면, 상기 확인된 얼굴 영역이 확대되거나 세 부적으로 촬영되도록 카메라 모듈을 제어할 수 있다. 예컨대, 촬영 제어부는 카메라 모듈을 통 해 확인되는 촬영 이미지에서, 얼굴 영역으로 확인되는 적어도 하나의 영역에 포커싱(focusing)을 맞추거나 줌 (zoom)을 시켜 촬영하도록 카메라 모듈을 제어할 수 있다. 상기 이미지 분석부는 이미지에서의 특정 얼굴 영역에 대해 분석할 적어도 하나의 항목을 선택하고, 얼굴 영역을 상기 선택된 항목 별로 분석할 수 있다. 예컨대, 이미지 분석부는 촬영된 이미지에서 확인된 눈 주 변 영역을 선택된 항목(예, 주름 혹은 다크 서클)별로 분석할 수 있다. 예컨대, 상기 이미지 분석부는 확 인된 눈 주변 영역에서의 주름의 깊이나 개수 혹은 다크서클의 넓이나 색 등을 분석할 수 있다. 상기 영역 선택부는 특정 이미지에서 얼굴 영역이 확인되는지를 판단할 수 있다. 본 발명의 다양한 실시 예에 따라, 특정 얼굴 영역이 확인되면 영역 선택부는 해당 얼굴 영역에 포커싱을 맞추거나 줌을 시켜 촬 영하도록 카메라 모듈을 제어할 수 있다. 상기 분석 결과 생성부는 이미지 분석부에서 분석된 얼굴 정보의 결과를 확인하고, 확인된 결과를 포 함하는 화면을 생성하여 디스플레이되도록 제어할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 분석 결과 생성부는 각 얼굴 영역에 대한 분석 항목 혹은 분석 결 과를 다양한 방법으로 표현하여 분석된 얼굴 정보의 화면을 생성할 수 있다. 예컨대, 상기 분석 결과 생성부 는 여드름은 붉은색 혹은 색소 침착은 푸른색 등으로 각 분석 항목이 색으로 구분되어 디스플레이되도록 얼굴 정보의 화면을 생성할 수 있다. 또한, 상기 분석 결과 생성부는 이전의 분석 결과를 확인하여 개선된 부분의 영역을 녹색 혹은 파란색으로 표시하고 악화된 얼굴 영역을 붉은색으로 표시하여 얼굴 정보의 화면을 생 성할 수 있다. 본 발명의 다양한 실시 예에 따라, 촬영된 이미지에서 특정 얼굴 영역에 대응하는 영역 혹은 분석 항목이나 분 석 결과에 따라 색으로 구분된 영역이 선택되면, 분석 결과 생성부는 상기 선택된 얼굴 영역에 대해 세부 촬영 혹은 분석된 이미지를 제공할 수 있다. 예컨대, 분석 결과 생성부는 생성된 이미지가 디스플레이되도 록 상기 표시부를 제어할 수 있다. 상기 카메라 모듈은 이미지를 촬영할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 카메라 모듈 은 상기 제어부에 의해, 특정 얼굴 영역으로 확인되는 영역에 포커싱을 맞추고 확대하여 촬영하도록 제어 될 수 있다. 상기 표시부는 카메라 모듈을 통해 촬영중인 이미지를 디스플레이할 수 있다. 본 발명의 다양한 실시 예에 따라, 디스플레이된 이미지에서 특정 영역이 선택되는 경우, 상기 표시부는 해당 영역에 대해 확대 혹은 세부 촬영된 이미지를 디스플레이할 수 있다. 예컨대, 상기 확대된 이미지는 전자 장치가 특정 영역을 선택함에 따라, 상기 선택된 영역이 확대되어 촬영된 것일 수 있다. 상기 세부 촬영된 이미 지는 전자 장치가 특정 영역을 선택함에 따라, 상기 선택된 영역이 포커싱되고 확대되어 촬영된 것일 수 있다. 저장부는 피부 분석 정보 혹은 사용자 식별 정보를 포함할 수 있다. 상기 피부 분석 정보 는 분석 항목에 따른 특정 얼굴 영역의 피부 분석 정보를 포함할 수 있다. 상기 피부 분석 정보는 특정 영역 주위의 피부 상태를 각 항목 별로 분석한 정보를 포함할 수 있다. 예컨 대, 피부 분석 정보는 특정 얼굴 영역에서의 피부 침착, 피부톤, 점, 혹은 여드름의 유무가 분석된 정보, 이전에 분석된 각 항목별 정보 혹은 각 얼굴 영역에 대한 피부 분석 결과를 시간 순으로 보여주는 히스토리 정 보를 포함할 수 있다. 상기 사용자 식별 정보는 특정 사용자에 대한 얼굴 정보를 포함할 수 있다. 예컨대, 이미지 분석부는 사용자 식별 정보를 이용하여, 촬영된 이미지에서 확인된 ‘눈’영역을 이전에 저장된 다른 사용자의 ‘눈 ’과 비교할 수 있다. 사용자 식별 정보는 상기 이미지 분석부에서의 비교 결과에 기반하여, 촬영된 이미지에서 확인된 얼굴 영역에 대한 분석 결과를 동일한 얼굴 영역을 포함하는 사용자에 대한 얼굴 정보에 포 함시켜 저장할 수 있다. 예컨대, 본 발명의 다양한 실시 예에 따른 전자 장치는, 카메라 모듈, 상기 카메라 모듈을 통해 촬영중인 이미 지를 디스플레이하는 표시부, 및 상기 이미지에서 적어도 하나의 얼굴 영역을 검출하고, 상기 검출된 적어도 하 나의 얼굴 영역을 세부 촬영하도록 상기 카메라 모듈을 제어하고, 상기 세부 촬영된 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석하는 제어부를 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 적어도 하나의 얼굴 영역은, 눈, 코, 볼, 입 혹은 이마 중 적어도 하나 의 주변 영역을 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 적어도 하나의 분석 항목은, 주름, 여드름, 색소 침착, 피부톤, 다크 서 클 혹은 모공 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 제어부는, 상기 세부 촬영된 얼굴 영역에서 각 하나의 분석 항목에 대한 굵기, 크기, 개수, 넓이 혹은 색 중 적어도 하나를 분석할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 제어부는, 상기 이미지에서의 특정 영역에 대해 제스처가 입력됨을 감지 하는 경우, 상기 제스처가 감지된 영역에 대해 세부 촬영된 이미지가 디스플레이되도록 상기 표시부를 제어할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 제어부는, 상기 이미지에서 미리 설정된 적어도 하나의 분석 항목에 대 한 얼굴 영역을 검출하고, 상기 검출된 얼굴 영역을 상기 미리 설정된 분석 항목에 따라 분석할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 제어부는, 상기 적어도 하나의 얼굴 영역이 검출됨과 동시에 상기 세부 촬영된 얼굴 영역에 대한 화면이 디스플레이되도록 상기 표시부를 제어할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 제어부는, 미리 설정된 동작이 감지되는 경우, 상기 검출된 적어도 하나 의 얼굴 영역을 세부 촬영하도록 상기 카메라 모듈을 제어할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 미리 설정된 동작은, 카메라 모듈이 활성화되는 애플리케이션을 실행하 는 동작, 잠금 상태의 상기 전자 장치를 활성화시키는 동작, 상기 전자 장치를 특정 각도 혹은 방향에 위치하는 동작 중 어느 하나를 포함할 수 있다.본 발명의 다양한 실시 예에 따른 상기 제어부는, 특정 얼굴 영역 혹은 분석 항목에 대하여, 미리 저장된 분석 결과를 확인하고, 상기 확인된 미리 저장된 분석한 결과를 상기 분석의 결과와 비교하고, 상기 비교의 결과를 포함하는 화면이 디스플레이되도록 상기 표시부를 제어할 수 있다. 도 2는 본 발명의 다양한 실시 예에 따라, 전자 장치에서 피부 정보를 분석하는 동작의 일 예를 도시한 흐름도 이다. 도 2를 참조하면, 210 동작에서 전자 장치는 촬영된 이미지에서 얼굴 영역을 검출할 수 있다. 220 동작에서 전자 장치는 촬영된 얼굴 영역에서 분석 항목을 선택할 수 있다. 230 동작에서 전자 장치는 선택된 항목에 대하여 세부 촬영을 할 수 있다. 예컨대, 전자 장치는 선택된 항목을 포커싱시키고 확대하여 촬영할 수 있다. 240 동작에서 전자 장치는 세부 촬영한 이미지를 분석할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치 는 상기 세부 촬영한 이미지를 이전에 저장된 결과 값과 비교할 수 있다. 예컨대, 전자 장치는 이전에 저장된 결과 값과 비교하여, 상기 세부 촬영한 이미지에 대응하는 얼굴 영역을 분석할 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자가 얼굴 영역이 포함된 이미지를 촬영하면 상기 촬영에 따라 출력되는 이미지는, 상기 촬영한 이미지에 포함된 얼굴 영역 각각에 대해 확대 혹은 세부 촬영된 이미지를 포함하거나 상 기 확대 혹은 세부 촬영된 이미지에 대한 분석 결과가 포함된 이미지를 포함할 수 있다. 예컨대, 사용자는 얼굴 영역을 촬영함에 따라, 별도의 얼굴 분석을 위한 추가적인 동작을 수행하지 않고도, 각 얼굴 영역에 대한 확대 혹은 세부 촬영된 이미지와 더불어 상기 확대 혹은 세부 촬영된 이미지에 대한 분석 결과를 획득할 수 있다. 상기 도 2에 도시된 동작들 중 적어도 하나의 동작이 생략되어 실행될 수도 있으며, 적어도 하나의 다른 동작이 상기 동작들 사이에 추가될 수도 있다. 또한, 상기 도 2의 동작들은 도시된 순서로 처리될 수도 있으며, 적어도 하나의 동작에 대한 실행 순서가 다른 동작의 실행 순서와 변경되어 처리될 수도 있다. 예컨대, 본 발명의 다양한 실시 예에 따른 전자 장치에서 얼굴 정보를 분석하는 방법은, 카메라 모듈을 통해 촬 영중인 이미지에서 적어도 하나의 얼굴 영역을 검출하는 동작과, 상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하는 동작과, 상기 세부 촬영된 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석하는 동작을 포함할 수 있다. 상기 적어도 하나의 얼굴 영역은, 눈, 코, 볼, 입 혹은 이마 중 적어도 하나의 주변 영역을 포함할 수 있 다. 상기 적어도 하나의 분석 항목은, 주름, 여드름, 색소 침착, 피부톤, 다크 서클 혹은 모공 중 적어도 하나 를 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 분석하는 동작은, 상기 세부 촬영된 얼굴 영역에서 각 하나의 분석 항목 에 대한 굵기, 크기, 개수, 넓이 혹은 색 중 적어도 하나를 분석하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치에서 얼굴 정보를 분석하는 방법은, 상기 이미지에서의 특정 영역에 대해 제스처가 입력되는 경우, 상기 제스처가 감지된 영역에 대해 세부 촬영된 이미지를 디스플레이하는 동작을 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치에서 얼굴 정보를 분석하는 방법은, 상기 이미지에서 미리 설정된 적어도 하나의 분석 항목에 대한 얼굴 영역을 검출하는 동작과, 상기 검출된 얼굴 영역을 상기 미리 설정된 분 석 항목에 따라 분석하는 동작을 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치에서 얼굴 정보를 분석하는 방법은, 상기 적어도 하나의 얼굴 영역 이 검출됨과 동시에 상기 검출된 얼굴 영역을 세부 촬영한 화면을 디스플레이하는 동작을 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치에서 얼굴 정보를 분석하는 방법은, 미리 설정된 동작이 감지되는 경우, 상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하는 동작을 더 포함할 수 있다. 상기 미리 설정된 동 작은, 카메라 모듈이 활성화되는 애플리케이션을 실행하는 동작, 잠금 상태의 상기 전자 장치를 활성화시키는 동작, 상기 전자 장치를 특정 각도 혹은 방향에 위치하는 동작 중 어느 하나를 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치에서 얼굴 정보를 분석하는 방법은, 특정 얼굴 영역 혹은 분석 항목 에 대하여, 미리 저장된 분석 결과를 확인하는 동작과, 상기 확인된 미리 저장된 분석한 결과를 상기 분석의 결 과와 비교하고, 상기 비교의 결과를 디스플레이하는 동작을 더 포함할 수 있다. 도 3은 본 발명의 다양한 실시 예에 따라, 전자 장치에서 피부 정보를 분석하는 동작의 일 예를 도시한 흐름도 이다. 도 3을 참조하면, 310 동작에서 전자 장치는 촬영된 이미지에서 얼굴 영역을 검출할 수 있다. 320 동작에서 전자 장치는 촬영된 얼굴 영역에서 적어도 하나의 포커싱된 영역을 확인할 수 있다. 330 동작에서 전자 장치는 적어도 하나의 포커싱된 영역을 확대 혹은 세부 촬영하도록 제어할 수 있다. 예컨대, 상기 포커싱된 영역이 확대 혹은 세부 촬영됨에 따라, 출력되는 이미지는, 특정 영역이 확대되어 촬영되거나 특 정 영역이 포커싱되고 확대되어 촬영된 것일 수 있다. 본 발명의 다양한 실시 예에 따라, 320 동작을 통해, 전자 장치가 적어도 하나의 포커싱된 영역을 확인하는 동 작을 개시하였지만, 전자 장치는 상기 310 동작을 통해 촬영된 이미지에서 얼굴 영역을 검출하는 즉시, 상기 검 출된 얼굴 영역에 대한 확대 혹은 세부 촬영하도록 제어할 수도 있다. 이 경우, 상기 320 동작은 생략될 수 있 다. 상기 도 3에 도시된 동작들 중 적어도 하나의 동작이 생략되어 실행될 수도 있으며, 적어도 하나의 다른 동작이 상기 동작들 사이에 추가될 수도 있다. 또한, 상기 도 3의 동작들은 도시된 순서로 처리될 수도 있으며, 적어도 하나의 동작에 대한 실행 순서가 다른 동작의 실행 순서와 변경되어 처리될 수도 있다. 도 4는 본 발명의 다양한 실시 예에 따라, 전자 장치에서 피부 정보를 분석하는 동작의 일 예를 도시한 흐름도 이다. 도 4를 참조하면, 410 동작에서 전자 장치는 비 촬영 모드에서, 임의의 애플리케이션이 실행되었는지를 확인할 수 있다. 420 동작에서 전자 장치는 미리 설정된 사용자 입력이 감지되는지를 판단할 수 있다. 상기 판단 결과, 미리 설정된 사용자 입력이 감지되지 않은 경우, 전자 장치는 다시 410 동작을 수행할 수 있다. 상기 판단의 결과, 미리 설정된 사용자 입력이 감지되는 경우, 430 동작에서 전자 장치는 백그라운드 (background)로 카메라 모듈이 동작하도록 제어할 수 있다. 440 동작에서 전자 장치는 촬영된 이미지에서 얼굴 영역이 식별되는지 여부를 판단할 수 있다. 상기 판단 결과, 얼굴 영역이 식별되지 않은 경우, 전자 장치는 다시 410 동작을 수행할 수 있다. 상기 판단 결과, 얼굴 영역이 식별되는 경우, 450 동작에서 전자 장치는 식별된 이미지에 대한 적어도 하나의 분석 항목을 선택할 수 있다. 예컨대, 상기 이미지에의 적어도 하나의 분석 항목은, 모공, 여드름, 색소 침착, 피부톤(skin tone), 다크 서클(dark circle), 주름 등 다양한 피부 상태를 측정하기 위한 항목들 중 적어도 하 나를 포함할 수 있다. 460 동작에서 전자 장치는 선택된 항목을 확대 혹은 세부 촬영하도록 카메라 모듈을 제어할 수 있다. 470 동작에서 전자 장치는 세부 촬영한 이미지를 분석할 수 있다. 상기 도 4에 도시된 동작들 중 적어도 하나의 동작이 생략되어 실행될 수도 있으며, 적어도 하나의 다른 동작이 상기 동작들 사이에 추가될 수도 있다. 또한, 상기 도 4의 동작들은 도시된 순서로 처리될 수도 있으며, 적어도 하나의 동작에 대한 실행 순서가 다른 동작의 실행 순서와 변경되어 처리될 수도 있다. 도 5a 내지 도 5h는 본 발명의 다양한 실시 예에 따라, 얼굴 영역의 다양한 예 및 상기 얼굴 영역이 부분 확대 혹은 세부 촬영되는 상황의 다양한 예들을 도시한 도면들이다. 본 발명의 다양한 실시 예에 따라, 전자 장치에서는 전체 얼굴을 촬영 중인 상황을 가정한다. 전자 장치는 촬영 중인 이미지에서 적어도 하나의 얼굴 영역을 확인할 수 있다. 도 5a를 참조하면, 전자 장치는 상기 촬영 중인 이미지에서 이마, 오른쪽 눈, 왼쪽 눈, 코 , 입 주변, 볼 혹은 얼굴 중 적어도 하나를 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영 중인 이미지에서 적어도 하나의 얼굴 영역을 확인하 는 경우, 해당 영역을 줌시켜 해당 영역에 대한 부분 확대 혹은 세부 촬영된 이미지를 촬영할 수 있다. 도 5b를 참조하면, 전자 장치는 상기 촬영 중인 이미지에서 이마를 확인하고, 상기 이마 영역을 줌시켜 부분 확대 혹은 세부 촬영할 수 있다. 전자 장치는 상기 이마 영역을 부분 확대 촬영한 이미지에서 적어도 하나의 분석 항목에 기반한 피부 분석 정보를 획득할 수 있다. 예컨대, 상기 피부 분석 정보는 이마 영역에서의 주름(501a)에 대한 정보를 포함할 수 있다. 도 5c를 참조하면, 전자 장치는 상기 촬영 중인 이미지에서 오른쪽 눈을 확인하고, 상기 오른쪽 눈 영역을 줌시켜 부분 확대 혹은 세부 촬영할 수 있다. 전자 장치는 상기 오른쪽 눈 영역을 부분 확대 촬영한 이미지에서 적어도 하나의 분석 항목에 기반한 피부 분석 정보를 획득할 수 있다. 예컨대, 상기 피부 분 석 정보는 오른쪽 눈 영역에서의 주름(502a)에 대한 정보를 포함할 수 있다. 도 5d를 참조하면, 전자 장치는 상기 촬영 중인 이미지에서 코를 확인하고, 상기 코 영역을 줌 시켜 부분 확대 혹은 세부 촬영할 수 있다. 전자 장치는 상기 코 영역을 부분 확대 촬영한 이미지에서 적 어도 하나의 분석 항목에 기반한 피부 분석 정보를 획득할 수 있다. 예컨대, 상기 피부 분석 정보는 코 영 역에서의 모공(503a)에 대한 정보를 포함할 수 있다. 도 5e를 참조하면, 전자 장치는 상기 촬영 중인 이미지에서 입 주변을 확인하고, 상기 입 주변 영역을 줌시켜 부분 확대 혹은 세부 촬영할 수 있다. 전자 장치는 상기 입 주변 영역을 부분 확대 촬영한 이미지에서 적어도 하나의 분석 항목에 기반한 피부 분석 정보를 획득할 수 있다. 예컨대, 상기 피부 분석 정보 는 입 주변 영역에서의 피부 침착(504a)에 대한 정보를 포함할 수 있다. 도 5f를 참조하면, 전자 장치는 상기 촬영 중인 이미지에서 볼을 확인하고, 상기 볼 영역을 줌 시켜 부분 확대 혹은 세부 촬영할 수 있다. 전자 장치는 상기 볼 영역을 부분 확대 촬영한 이미지에서 적 어도 하나의 분석 항목에 기반한 피부 분석 정보를 획득할 수 있다. 예컨대, 상기 피부 분석 정보는 볼 영 역에서의 여드름(505a)에 대한 정보를 포함할 수 있다. 도 5g를 참조하면, 전자 장치는 상기 촬영 중인 이미지에서 왼쪽 눈을 확인하고, 상기 왼쪽 눈 영역을 줌시켜 부분 확대 혹은 세부 촬영할 수 있다. 전자 장치는 상기 왼쪽 눈 영역을 부분 확대 촬영한 이미지에서 적어도 하나의 분석 항목에 기반한 피부 분석 정보를 획득할 수 있다. 예컨대, 상기 피부 분석 정보 는 왼쪽 눈 영역에서의 다크 서클(506a)에 대한 정보를 포함할 수 있다. 도 5h를 참조하면, 전자 장치는 상기 촬영 중인 이미지에서 얼굴을 확인하고, 상기 얼굴 영역을 줌시켜 부분 확대 혹은 세부 촬영할 수 있다. 전자 장치는 상기 얼굴 영역을 부분 확대 촬영한 이미지에서 적어도 하나의 분석 항목에 기반한 피부 분석 정보를 획득할 수 있다. 예컨대, 상기 피부 분석 정보는 얼굴 영역에서의 피부톤(507a)에 대한 정보를 포함할 수 있다. 도 6은 본 발명의 다양한 실시 예에 따라, 얼굴 분석 항목의 다양한 예를 도시한 도면이다. 도 6을 참조하면, 전자 장치는 적어도 하나의 얼굴 영역을 포함하는 이미지를 촬영하였으며, 상기 촬영된 이미지에서 적어도 하나의 분석 항목을 확인할 수 있다. 예컨대, 전자 장치는 분석 항목으로 여드름, 주름 혹은 색소 침착을 확인할 수 있다. 도 7은 본 발명의 다양한 실시 예에 따라, 얼굴 분석 항목을 분석하는 동작의 일 예를 도시한 도면이다. 도 7을 참조하면, 전자 장치는 촬영된 이미지에서 분석 항목 중 색소 침착에 대한 분석을 할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영된 이미지에서 색소 침착된 부분의 색을 반전시킨 이미지 를 생성할 수 있다. 전자 장치는 상기 720 이미지에서 색이 반전된 영역을 확인하여, 적어도 하나의 색소 침착된 부분을 확인할 수 있다. 예컨대, 전자 장치는 상기 적어도 하나의 색소 침착된 부분의 개수에 따라, 색소 침착이 이전보다 악화 혹은 개선되었는지를 확인할 수 있다. 도 8은 본 발명의 다양한 실시 예에 따라, 얼굴 분석 항목을 분석하는 동작의 일 예를 도시한 도면이다. 도 8을 참조하면, 전자 장치는 촬영된 이미지에서 분석 항목 중 여드름에 대한 분석을 할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영된 이미지에서 여드름이 확인되는 부분의 색을 반전시킨 이 미지를 생성할 수 있다. 예컨대, 전자 장치는 상기 820 이미지에서 색이 반전된 영역을 확인하여, 적어도 하나의 여드름을 확인할 수 있다. 예컨대, 전자 장치는 상기 적어도 하나의 여드름의 개수에 따라, 여드름 이 이전보다 증가 혹은 감소하였는지를 확인할 수 있다. 도 9는 본 발명의 다양한 실시 예에 따라, 얼굴 분석 항목을 분석하는 동작의 일 예를 도시한 도면이다. 도 9를 참조하면, 전자 장치는 촬영된 이미지에서 분석 항목 중 모공에 대한 분석을 할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영된 이미지에서 모공으로 확인되는 부분의 색을 진하게 변환 한 이미지를 생성할 수 있다. 예컨대, 전자 장치는 상기 920 이미지에서 색이 진하게 변환된 영역을 확인하여, 적어도 하나의 모공을 확인할 수 있다. 예컨대, 전자 장치는 상기 적어도 하나의 모공의 개수에 따라, 모공이 이전보다 증가 혹은 감소하였는지를 확인할 수 있다.도 10은 본 발명의 다양한 실시 예에 따라, 얼굴 분석 항목을 분석하는 동작의 일 예를 도시한 도면이다. 도 10 을 참조하면, 전자 장치는 촬영된 이미지에서 분석 항목 중 주름에 대한 분석을 할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영된 이미지에서 주름으로 확인되는 부분에 주름 선 이 나타나도록 할 수 있다. 예컨대, 전자 장치는 상기 촬영된 이미지에서 적어도 하나의 주름 선 을 확인하여, 주름의 여부를 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영된 이미지에서 나타난 적어도 하나의 주름 선의 두께 혹은 개수를 확인할 수 있다. 예컨대, 전자 장치는 상기 적어도 하나의 주름 선의 두께에 따라 주름이 이전보다 깊어 졌는지 여부를 확인하고, 주름 선의 개수에 따라 주름이 이전보다 증가 혹은 감소하였는지를 확인할 수 있다. 도 11은 본 발명의 다양한 실시 예에 따라, 얼굴 분석 항목을 분석하는 동작의 일 예를 도시한 도면이다. 도 11 을 참조하면, 전자 장치는 촬영된 이미지에서 분석 항목 중 피부톤에 대한 분석을 할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영된 이미지에서 피부의 일부를 피부톤 분석 영역 으로 설정 할 수 있다. 예컨대, 전자 장치는 상기 촬영된 이미지에서 적어도 하나의 피부톤 분석 영역을 확인하여, 이전에 측정된 피부톤 값과 비교하거나 해당 피부톤 분석 영역에 대한 측정 값을 획득 할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영된 이미지에서 피부톤 분석 영역을 분석할 수 있다. 예컨대, 전자 장치는 해당 피부톤 분석 영역의 색, 명암, 밝기, 색 온도 등을 측정하여, 이전에 측정된 피부톤 보다 칙칙하거나 화사해보이는지 여부를 확인할 수 있다. 도 12는 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 일 예를 도시한 도면이다. 도 12를 참조하면, 전자 장치는 얼굴 분석을 위하여 얼굴 영역을 촬영하는 상황임을 가정한다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 현재 촬영중인 이미지의 특성(예, 해상도, 이미지 크기, 화이트 밸런스 등)을 확인할 수 있다. 전자 장치는 현재 촬영되는 이미지의 특성과 이전에 촬영된 이미지의 특성을 비 교할 수 있다. 예컨대, 이전에 촬영된 이미지와의 특성(예, 화이트 밸런스)이 유사하지 않은 경우, 전자 장치는 현재 촬영중인 이미지의 특성을 이전과 유사하게 동기화시킬 수 있다. 도 12를 참조하면, 전자 장치는 이전에 촬영된 이미지와 화이트 밸런스를 맞추는 중임을 알리는 화면을 디스플레이할 수 있다. 이후, 현재 촬영중인 이미지의 특성을 이전에 촬영된 이미지의 특성과 동기화된 경우, 전자 장치는 화이트 밸런스 동기화 완료되어 촬영이 가능함을 알리는 화면을 디스플레이할 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 상기 1220 화면을 통해, 현재 전자 장치에서의 촬영 상황과 이전에 얼굴 분석을 위한 이미지의 촬영 상황이 유사하게 설정되었음을 확인할 수 있다. 이와 같은 본 발명의 다양한 실시 예에 따라, 동일한 피부 상태임에도 불구하고 조명, 실내/외 여부, 날씨 등의 원인으로 얼굴 정보에 대한 분석 결과가 다르게 나올 수 있는 상황을 방지할 수 있다. 도 13a 내지 도 13c는 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 다양한 예들을 도 시한 도면들이다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영된 이미지에서 적어도 하나의 얼굴 영역이 확인되는 경우, 상기 적어도 하나의 얼굴 영역이 확대 혹은 세부 촬영되도록 제어할 수 있다. 예컨대, 전자 장치는 촬영된 이미 지에서 대응하는 해당 얼굴 영역에 상기 촬영된 확대 혹은 세부 촬영된 영역을 포함하는 분석 결과 화면 을 생성할 수 있다. 예컨대, 상기 분석 결과 화면은 적어도 하나의 얼굴 영역으로 확인된 눈, 코 , 볼 각각에 대한 확대 혹은 세부 촬영된 영역을 포함할 수 있다. 도 13a를 참조하면, 사용자는 상기 분석 결과 화면에서 눈을 선택할 수 있다. 본 발명의 다양한 실 시 예에 따라, 전자 장치는 상기 눈을 확대 혹은 세부 촬영한 이미지를 출력할 수 있다. 예컨대, 상기 눈 이 확대 혹은 세부 촬영된 이미지에서, 눈 주위의 적어도 하나의 주름을 가리키는 선이 표시될 수 있다. 도 13b를 참조하면, 사용자는 상기 분석 결과 화면에서 코를 선택할 수 있다. 본 발명의 다양한 실 시 예에 따라, 전자 장치는 상기 코를 확대 혹은 세부 촬영한 이미지를 출력할 수 있다. 예컨대, 상기 코 가 확대 혹은 세부 촬영된 이미지에서, 코 주위에서의 적어도 하나의 여드름이 표시될 수 있다. 도 13c를 참조하면, 사용자는 상기 분석 결과 화면에서 볼을 선택할 수 있다. 본 발명의 다양한 실 시 예에 따라, 전자 장치는 상기 볼을 확대 혹은 세부 촬영한 이미지를 출력할 수 있다. 예컨대, 상기 볼 이 확대 혹은 세부 촬영된 이미지에서, 볼 주위의 적어도 하나의 색소 침착된 부분의 색을 강조되 어 표시될 수 있다. 도 14는 본 발명의 다양한 실시 예에 따라, 피부 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 14를 참조하면, 분석 결과 화면은 각 분석 항목 별로 이전의 결과들을 비교하여 보여주는 피부 분석 히스 토리 보기선택 항목을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 피부 분석 히스토리 보기가 선택되는 경우, 전자 장치는 피부 분 석 히스토리 화면으로 전환할 수 있다. 본 발명의 다양한 실시 예에 따른 상기 피부 분석 히스토리 화면은, 특정 기간(예, 6월에서 8월 사이)에 측정된 피부 분석 항목(예, 피부톤, 여드름, 주름, 색소 침착, 모공 등) 각각에 대한 결과 값을 이전과 비교하 여 보여줄 수 있다. 예컨대, 피부톤 측정 결과는 이전과 비교하여 피부톤이 화사해졌음을 보여줄 수 있다. 여드름 측정 결과 는 이전에 비해 여드름이 증가하였음을 보여줄 수 있다. 주름 측정 결과는 이전과 주름의 개수가 비슷함을 보여줄 수 있다. 색소 침착 측정 결과는 이전과 비교하여 색소 침착된 부분의 색이 옅어졌음을 보여줄 수 있다. 모공 측정 결과는 이전과 비교하여 모공이 증가하였음을 보여줄 수 있다. 도 15는 본 발명의 다양한 실시 예에 따라, 피부 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 특정 얼굴 영역을 분석하고, 상기 분석한 결과에 따라 해당 얼 굴 영역을 개선할 수 있는 방법을 추천할 수 있다. 도 15를 참조하면, 전자 장치는 촬영된 이미지에서 눈 주위를 확인하고, 상기 눈 주위의 피부 상태를 분 석하여, 상기 분석한 결과를 표시할 수 있다. 예컨대, 상기 분석 결과, 전자 장치는 특정 사용자의 눈 주위에서 새로운 주름이 확인되거나, 이전보다 주름의 개수가 늘어난 것을 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 주름을 개선시킬 수 있는 방법을 포함하는 스킨케어 추천 화면 을 제공할 수 있다. 예컨대, 사용자가 촬영된 이미지에서 주름 표시를 선택하는 경우, 전자 장치는 촬영된 이미지를 표시하는 화면을 스킨케어 추천 화면으로 전환시킬 수 있다. 본 발명의 다양한 실시 예에 따른, 상기 스킨케어 추천 화면은 주름에 좋은 화장품, 더 많은 아이 크림을 검색하기 위한 실행 버튼 혹은 눈가 주름에 좋은 마사지 방법을 추천하기 위한 실행 버튼을 포함할 수 있다. 예컨대, 상기 주름에 좋은 화장품은, **아이크림(1521a), ##크림(1521b), 혹은 oo아이크 림(1521c)등을 포함할 수 있으며, 각 화장품에 대한 평점이나 특정 화장품을 주문할 수 있는 실행 버튼 등을 더 포함할 수 있다. 도 16은 본 발명의 다양한 실시 예에 따라, 피부 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 특정 얼굴 영역을 분석하고, 상기 분석한 결과에 따라 해당 얼 굴 영역을 개선할 수 있는 방법을 추천할 수 있다. 예컨대, 상기 분석 결과, 전자 장치는 특정 사용자의 볼 주 위에서 피부톤이 변화된 부분을 확인할 수 있다. 도 16을 참조하면, 전자 장치는 촬영된 이미지에서 볼 주위를 확인하고, 상기 볼에서의 특정 영역에 대한 피부톤이 분석된, 피부톤 분석 영역을 표시할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 피부 톤을 개선시킬 수 있는 방법을 포함하는 스킨케어 추천 화 면을 제공할 수 있다. 예컨대, 사용자가 촬영된 이미지에서 피부톤 분석 영역을 선택하는 경 우, 전자 장치는 촬영된 이미지를 표시하는 화면을 스킨케어 추천 화면으로 전환시킬 수 있다. 본 발명의 다양한 실시 예에 따른, 상기 스킨케어 추천 화면은 피부톤 개선에 좋은 마스크팩 혹은 더 많은 마스크팩을 검색하기 위한 실행 버튼을 포함할 수 있다. 예컨대, 상기 피부톤 개선에 좋은 마스 크팩은, **마스크팩(1621a) 혹은 ㅁㅁ마스크팩(1621b) 등을 포함할 수 있으며, 각 마스크팩에 대한 특징 을 보여주는 화면으로 이동시키거나 특정 마스크팩을 주문할 수 있는 실행 버튼 등을 더 포함할 수 있다. 도 17은 본 발명의 다양한 실시 예에 따라, 피부 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 특정 얼굴 영역을 분석하고, 상기 분석한 결과에 따라 해당 얼 굴 영역을 개선할 수 있는 제품의 광고화면을 제공할 수 있다. 도 17을 참조하면, 전자 장치는 촬영된 이미지에서 볼 주위 및 상기 볼 주위에서 적어도 하나의 여드름을 확인하고, 상기 확인된 여드름에 강조 표시를 할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 여드름을 개선시킬 수 있는 제품을 광고하는 광고 화면을 제공할 수 있다. 예컨대, 사용자가 촬영된 이미지에 표시된 여드름을 선택하는 경우, 전자 장치는 촬영된 이미지를 표시하는 화면을 광고 화면으로 전환시킬 수 있다. 본 발명의 다양한 실시 예에 따른, 상기 광고 화면은 여드름 치료제에 대한 광고 혹은 상기 여드름 치료 제에 대한 설명 화면으로 전환되는 자세히 보기 실행 버튼을 포함할 수 있다. 도 18은 본 발명의 다양한 실시 예에 따라, 피부 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 특정 얼굴 영역을 분석하고, 상기 분석한 결과에 따라 해당 얼 굴 영역을 개선할 수 있는 방법을 추천할 수 있다. 도 18을 참조하면, 전자 장치는 촬영된 이미지에서 코를 확인하고, 상기 코에서 모공의 개수가 분석된, 모공 분석 영역을 표시할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 모공의 개수를 줄일 수 있는 방법을 포함하는 스킨케어 추천 화 면을 제공할 수 있다. 예컨대, 사용자가 촬영된 이미지에서 모공 분석 영역을 선택하는 경우, 전자 장치는 촬영된 이미지를 보여주는 화면을 스킨케어 추천 화면으로 전환시킬 수 있다. 본 발명의 다양한 실시 예에 따른, 상기 스킨케어 추천 화면은 모공 치료에 유명한 피부과 병원의 정보 혹은 특정 피부과 병원의 광고를 포함할 수 있다. 예컨대, 상기 피부과 병원의 광고는 해당 피부과의 진료 과목을 표시하는 화면 혹은 해당 피부과 병원의 정보 화면으로 전환시키는 바로가기 실행 버튼을 포함할 수 있다. 도 19는 본 발명의 다양한 실시 예에 따른 네트워크 환경의 일 예를 도시한 도면이다. 도 19를 참조하면, 상기 네트워크 환경은 적어도 하나의 전자 장치(1901 혹은 1904) 혹은 서버를 포함할 수 있으며, 상기 적어도 하나의 전자 장치(1901 혹은 1904)와 상기 서버는 네트워크를 통해 연결될 수 있다. 상기 전자 장치는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이 , 통신 인터페이스 및 카메라 모듈을 포함할 수 있다. 상기 버스는 전술한 구성요소들을 서로 연결하고, 전술한 구성요소들 간의 통신(예: 제어 메시지)을 전달 하는 회로일 수 있다. 상기 프로세서는, 예를 들면, 상기 버스를 통해 전술한 다른 구성요소들(예: 상기 메모리, 상기 입출력 인터페이스, 상기 디스플레이, 상기 통신 인터페이스, 또는 상기 카메라 모듈 등)로부터 명령을 수신하여, 수신된 명령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실행 할 수 있다. 상기 프로세서는 전반적인 전자 장치의 동작을 제어할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 프로세서는 적어도 하나의 제어부(예, 제어부)를 포함할 수 있다. 상기 메모리는, 상기 프로세서 또는 다른 구성요소들(예: 상기 입출력 인터페이스, 상기 디 스플레이, 상기 통신 인터페이스, 또는 상기 카메라 모듈 등)로부터 수신되거나 상기 프로세 서 또는 다른 구성요소들에 의해 생성된 명령 또는 데이터를 저장할 수 있다. 상기 메모리는, 예를 들면, 커널, 미들웨어, 애플리케이션 프로그래밍 인터페이스(API: application programming interface) 또는 애플리케이션 등의 프로그래밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래 밍 모듈들은 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 상기 커널은 나머지 다른 프로그래밍 모듈들, 예를 들면, 상기 미들웨어, 상기 API 또는 상 기 애플리케이션에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 상기 버스 , 상기 프로세서 또는 상기 메모리 등)을 제어 또는 관리할 수 있다. 또한, 상기 커널(193 1)은 상기 미들웨어, 상기 API 또는 상기 애플리케이션에서 상기 전자 장치의 개별 구 성요소에 접근하여 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어는 상기 API 또는 상기 애플리케이션이 상기 커널과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어는 상기 애플리케이션으로부 터 수신된 작업 요청들과 관련하여, 예를 들면, 상기 애플리케이션 중 적어도 하나의 애플리케이션에 상 기 전자 장치의 시스템 리소스(예: 상기 버스, 상기 프로세서 또는 상기 메모리 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또는 로드 밸 런싱)을 수행할 수 있다. 상기 API는 상기 애플리케이션이 상기 커널 또는 상기 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하 나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 애플리케이션은 SMS/MMS 애플리케이션, 이메일 애플리케이션, 달력 애플 리케이션, 알람 애플리케이션, 건강 관리(health care) 애플리케이션(예: 운동량 또는 혈당 등을 측정하는 애플 리케이션) 또는 환경 정보 애플리케이션(예: 기압, 습도 또는 온도 정보 등을 제공하는 애플리케이션) 등을 포 함할 수 있다. 추가적으로 또는 대체적으로, 상기 애플리케이션은 상기 전자 장치와 외부 전자 장 치(예: 전자 장치) 사이의 정보 교환과 관련된 애플리케이션일 수 있다. 상기 정보 교환과 관련된 애플리 케이션은, 예를 들어, 상기 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달(notification relay) 애플 리케이션, 또는 상기 외부 전자 장치를 관리하기 위한 장치 관리(device management) 애플리케이션을 포함할 수 있다. 예를 들면, 상기 알림 전달 애플리케이션은 상기 전자 장치의 다른 애플리케이션(예: SMS/MMS 애플리케이 션, 이메일 애플리케이션, 건강 관리 애플리케이션 또는 환경 정보 애플리케이션 등)에서 발생한 알림 정보를 외부 전자 장치(예: 전자 장치)로 전달하는 기능을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 알림 전달 애플리케이션은, 예를 들면, 외부 전자 장치(예: 전자 장치)로부터 알림 정보를 수신하여 사용 자에게 제공할 수 있다. 상기 장치 관리 애플리케이션은, 예를 들면, 상기 전자 장치와 통신하는 외부 전 자 장치(예: 전자 장치)의 적어도 일부에 대한 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴온/턴오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 상기 외부 전자 장치에서 동작하는 애플리케이션 또 는 상기 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스)를 관리(예: 설치, 삭제 또 는 업데이트)할 수 있다. 다양한 실시 예에 따르면, 상기 애플리케이션은 상기 외부 전자 장치(예: 전자 장치)의 속성(예: 전자 장치의 종류)에 따라 지정된 애플리케이션을 포함할 수 있다. 예를 들어, 외부 전자 장치가 MP3 플레이어 인 경우, 상기 애플리케이션은 음악 재생과 관련된 애플리케이션을 포함할 수 있다. 유사하게, 외부 전자 장치가 모바일 의료기기인 경우, 상기 애플리케이션은 건강 관리와 관련된 애플리케이션을 포함할 수 있 다. 한 실시 예에 따르면, 상기 애플리케이션은 전자 장치에 지정된 애플리케이션 또는 외부 전자 장치(예: 서버 또는 전자 장치)로부터 수신된 애플리케이션 중 적어도 하나를 포함할 수 있다. 상기 입출력 인터페이스는, 입출력 장치(예: 센서, 키보드 또는 터치 스크린)를 통하여 사용자로부터 입 력된 명령 또는 데이터를, 예를 들면, 상기 버스를 통해 상기 프로세서, 상기 메모리, 상기 통신 인터페이스, 또는 상기 카메라 모듈에 전달할 수 있다. 예를 들면, 상기 입출력 인터페이스 는 터치 스크린을 통하여 입력된 사용자의 터치에 대한 데이터를 상기 프로세서로 제공할 수 있다. 또한, 상기 입출력 인터페이스는, 예를 들면, 상기 버스을 통해 상기 프로세서, 상기 메모리 , 상기 통신 인터페이스, 또는 상기 카메라 모듈로부터 수신된 명령 또는 데이터를 상기 입 출력 장치(예: 스피커 또는 디스플레이)를 통하여 출력할 수 있다. 예를 들면, 상기 입출력 인터페이스는 상기 프로세서를 통하여 처리된 음성 데이터를 스피커를 통하여 사용자에게 출력할 수 있다. 상기 디스플레이는 사용자에게 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)을 표시할 수 있 다. 상기 통신 인터페이스는 상기 전자 장치와 외부 장치(예: 전자 장치 또는 서버) 간의 통신을 연결할 수 있다. 예를 들면, 상기 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네트워 크에 연결되어 상기 외부 장치와 통신할 수 있다. 상기 무선 통신은, 예를 들어, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 상기 유선 통신은, 예를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 상기 카메라 모듈은, 다른 구성요소들(예: 상기 프로세서, 상기 메모리, 상기 입출력 인터페 이스, 또는 상기 통신 인터페이스 등)로부터 획득된 정보에 의해 제어됨에 따라, 촬영중인 이미지 를 줌시켜 특정 영역을 확대 혹은 세부 촬영할 수 있다. 한 실시 예에 따르면, 상기 네트워크는 통신 네트워크(telecommunications network)일 수 있다. 상기 통 신 네트워크는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전화망(telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 상기 전자 장치와 외부 장치 간의 통신을 위한 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol)은 애플리케이션, API, 상기 미들웨어, 커널 또는 통신 인 터페이스 중 적어도 하나에서 지원될 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 화이트 밸런스 자동 설정 기능(auto white balance)을 이용하여 촬영 중인 이미지의 조명 환경을 계산할 수 있다. 예컨대, 전자 장치는 상기 계산한 조명 환경을 이용하여 일괄 적인 화이트 밸런스가 설정되도록 이미지를 촬영할 수 있다. 또한, 외부 광원이 없는 촬영 환경에서도 전자 장 치 내에 포함된 광원(예, LED 광원)을 조정하여 일괄적인 화이트 밸런스가 설정되도록 이미지를 촬영할 수 있다. 한편, 상기한 화이트 밸런스 자동 설정 기능에 따라 화이트 밸런스를 설정하여 촬영하는 경우, 촬영된 이미지에 서의 얼굴 영역은 각 촬영된 이미지에 대응하여 설정된 화이트 밸런스에 따라 다른 색감으로 설정되어 촬영될 수 있다. 또한, 얼굴 영역의 색감을 여러 이미지에 대해 일괄적으로 설정하기 위하여, 외부 광원을 차단하고 전자 장치에 포함된 광원만을 이용할 수 있으나, 상기 방법을 구현하기 위한 광원을 포함하는 전자 장치는 휴대하기에 그 크 기가 크고 무거울 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 전면 카메라 또는 후면 카메라를 포함할 수 있다. 예컨대, 상기 전면 카메라를 이용하여 이미지를 촬영하는 경우 상기 후면 카메라는 촬영 환경을 계산하여 일정한 촬영 환경에 서 이미지가 촬영될 수 있도록 촬영될 이미지의 화이트 밸런스를 설정할 수 있다. 이에 대한 구체적인 설명은 이하, 도 20a 내지 도 21들을 참조하여 후술하도록 한다. 도 20a 내지 도 20c는 본 발명의 다양한 실시 예에 따라, 전자 장치에서 얼굴 분석하는 상황의 다양한 예들을 도시한 도면들이다. 도 20a 내지 도 20c를 참조하면, 전자 장치는 전면 카메라 혹은 후면 카메라를 포함할 수 있으며, 상기 후면 카메라는 컬러 밸런스 카드(color balance card)를 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 컬러 밸런스 카드를 통해 촬영 중인 주변 환경의 조명 성분을 검 출할 수 있다. 예컨대, 상기 컬러 밸런스 카드는 빛이 난 반사되는 성질을 이용하여 조명의 정확한 색을 촬영하기 위한 장비이거나, 색상 교정용으로 사용되는 장비일 수 있다. 예컨대, 상기 컬러 밸런스 카드는 후면 카메라에 포함되는 것으로 예시하였지만, 전자 장치와 연동되는 다양한 카메라 모듈에 포함될 수 있 다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 적어도 하나의 카메라 모듈(예, 전면 카메라 혹은 후면 카메라)을 통해 획득한 이미지의 밝기가 비정상인 것으로 판단할 수 있다. 예컨대, 상기 이미지의 밝기가 비정상인 것으로 판단되는 경우는 조명이 설정 값보다 밝거나 어두운 경우 혹은 얼굴 영역을 획득할 수 없는 경 우를 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 이미지의 밝기가 비정상인 것으로 판단하는 경우, 이미지를 획 득하기 어려운 것으로 판단하고 카메라 모듈(예, 전면 카메라 혹은 후면 카메라)을 통해 촬영 중인 이미지가 저장되지 않도록 제어할 수 있다. 또한, 본 발명의 다양한 실시 예에 따라, 전자 장치는 이미지의 밝기가 비정상인 것으로 판단하는 경우, 촬영 상황이 비정상임을 알리는 화면이 디스플레이되도록 제어하거나 소리 알림을 출력할 수 있다. 이에 따라, 사용 자는 전자 장치를 정상적인 촬영이 가능한 위치로 옮길 수 있으며, 이후 전자 장치는 정상적인 촬영이 가능한 것으로 판단되면, 다시 촬영이 가능함을 알리는 화면 혹은 소리를 출력하도록 제어할 수 있다. 도 20a를 참조하면, 전자 장치는 전면 카메라를 통해 얼굴 영역이 포함된 이미지를 획득하고, 후면 카메 라의 컬러 밸런스 카드를 통해 조명 성분을 계산할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 상기 얼굴 영역이 포함되어 획득된 이미지에 상기 계산된 조명 성분을 적용시킬 수 있다. 예컨대, 상기 계산된 조명 성분이 적용된 이미지는 촬영 주변의 조명 성분과 무관하 게 화이트 밸런스가 설정됨에 따라, 이전에 저장된 이미지의 얼굴 영역의 화이트 밸런스와 대응되도록 촬영될 수 있다. 도 20b를 참조하면, 전자 장치는 전면 카메라를 이용하여 이미지를 촬영 중인 상황을 가정한다. 예컨대, 전자 장치는 상기 전면 카메라를 통해 촬영 중인 이미지를 분석할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 상기 이미지를 분석한 결과에 따라, 촬영 중인 조명 환경이 극 단적인 조명 환경(예, 역광, 저조도, 너무 밝은 조명)인지를 판단할 수 있다. 예컨대, 상기 전면 카메라 를 통해 촬영 중인 상황이 극단적인 조명 환경인 것으로 판단되는 경우, 전자 장치는 상기 전면 카메라를 통해 촬영 중인 이미지를 저장하지 않거나 상기 전면 카메라를 제어하여 촬영 기능이 활성화되지 않도록 제어할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 전면 카메라를 통해 촬영 중인 상황이 비정상적인 조명 환경으로 판단되는 경우, 컬러 밸런스 카드를 통해 화이트 밸런스를 계산하고 상기 계산한 화이트 밸런스 값을 상 기 전면 카메라를 통해 촬영 중인 이미지에 적용시킬 수 있다. 도 20c를 참조하면, 전자 장치는 후면 카메라를 이용하여 이미지를 촬영 중인 상황을 가정한다. 예컨대, 전자 장치는 상기 후면 카메라를 통해 촬영 중인 이미지를 분석할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 상기 이미지를 분석한 결과에 따라, 촬영 중인 조명 환경이 극 단적인 조명 환경(예, 역광, 저조도, 너무 밝은 조명)인지를 판단할 수 있다. 예컨대, 상기 후면 카메라 를 통해 촬영 중인 상황이 극단적인 조명 환경인 것으로 판단되는 경우, 전자 장치는 상기 후면 카메라를 통해 촬영 중인 이미지를 저장하지 않거나 상기 후면 카메라를 제어하여 촬영 기능이 활성화되지 않도록 제어할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 후면 카메라를 통해 촬영 중인 상황이 비정상적인 조명 환경으로 판단되는 경우, 컬러 밸런스 카드를 통해 화이트 밸런스를 계산하고 상기 계산한 화이트 밸런스 값을 상 기 후면 카메라를 통해 촬영 중인 이미지에 적용시킬 수 있다. 도 21은 본 발명의 다양한 실시 예에 따라, 전자 장치에서 피부 정보를 분석하는 동작의 일 예를 도시한 흐름도 이다. 도 21을 참조하면, 2110 동작에서 전자 장치는 적어도 하나의 카메라로부터 영상을 획득할 수 있다. 2120 동작에서 전자 장치는 획득한 영상을 분석할 수 있다. 2130 동작에서 전자 장치는 획득한 영상의 밝기가 비정상인지 여부를 확인할 수 있다. 상기 2130 동작의 결과, 획득된 이미지의 밝기가 비정상으로 확인되지 않는 경우, 전자 장치는 다시 2110 동작 을 수행할 수 있다. 상기 2130 동작의 결과, 획득된 이미지의 밝기가 비정상으로 확인되는 경우, 2140 동작에서 전자 장치는 획득된 이미지를 촬영한 카메라가 전자 장치의 전면에 위치하는지 여부를 확인할 수 있다. 상기 2140 동작의 결과, 카메라가 전면에 위치하지 않은 것으로 확인되는 경우 2150 동작에서 전자 장치는 화이 트 밸런스를 계산할 수 있다. 예컨대, 상기 계산되는 화이트 밸런스는 상기 전면에 위치하지 않은 카메라에 포 함된 화이트 밸런스를 계산할 수 있는 모듈(예, 컬러 밸런스 카드)를 통해 계산될 수 있다. 상기 2150 동작에서 계산된 화이트 밸런스를 이용하여, 2160 동작에서 전자 장치는 촬영된 이미지의 화이트 밸런스를 상기 계산된 화이트 밸런스로 적용시킬 수 있다. 또한, 2140 동작의 결과, 카메라가 전면에 위치하는 것으로 확인되는 경우 전자 장치는 상기 2160 동작에서 화 이트 밸런스를 촬영된 이미지에 적용시킬 수 있다. 예컨대, 상기 2140 동작의 결과에 따라 상기 2160 동작에서 화이트 밸런스가 적용된 이미지는, 상기 전면에 위치한 카메라에 컬러 밸런스 카드가 포함되어 있지 않아 미리 저장된 화이트 밸런스의 값이 적용된 이미지일 수 있다. 2170 동작에서 전자 장치는 이미지를 저장할 수 있다. 예컨대, 상기 저장되는 이미지는 화이트 밸런스가 적용된 이미지일 수 있다. 상기 도 21에 도시된 동작들 중 적어도 하나의 동작이 생략되어 실행될 수도 있으며, 적어도 하나의 다른 동작 이 상기 동작들 사이에 추가될 수도 있다. 또한, 상기 도 21의 동작들은 도시된 순서로 처리될 수도 있으며, 적 어도 하나의 동작에 대한 실행 순서가 다른 동작의 실행 순서와 변경되어 처리될 수도 있다. 도 22a 및 도 22b는 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 다양한 예들을 도 시한 도면들이다. 본 발명의 다양한 실시 예에 따라, 전자 장치에서는 촬영 중인 얼굴 영역에서 액세서리(accessory)가 착용되어 있는지를 확인할 수 있다. 도 22a를 참조하면, 얼굴 영역 촬영 대상인 여고생이 안경을 착용하고 있는 상황을 가정한다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영 중인 얼굴 영역에서 안경 테에 해당하는 선 혹은 유 리에 빛이 반사되는 부분이 포함되었는지 여부에 따라 얼굴 영역에 안경이 착용되어 있는지를 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영 중인 얼굴 영역에서 안경이 착용되어 있는 것으로 판단 되 는 경우, 안경을 벗을 것을 지시할 수 있다. 예컨대, 촬영 중인 이미지에서는 ‘안경을 벗고 촬영해주세 요’등의 문구가 디스플레이될 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치의 사용자는 상기 문구를 확인하고, 안경을 벗을 수 있다. 전자 장 치는 사용자가 안경을 벗었음을 확인하는 경우, 촬영 중인 이미지에서 ‘촬영해도 좋습니다’ 등의 문구 를 디스플레이할 수 있다. 도 22b를 참조하면, 얼굴 영역 촬영 대상인 여고생이 모자를 착용하고 있는 상황을 가정한다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영 중인 얼굴 영역에서 모자의 형태에 해당하는 선이 포함되었는지 여부에 따라 얼굴 영역에 모자가 착용되어 있는지를 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영 중인 얼굴 영역에서 모자 착용되어 있는 것으로 판단 되는 경우, 모자를 벗을 것을 지시할 수 있다. 예컨대, 촬영 중인 이미지에서 ‘모자를 벗고 촬영해주세요’등 의 문구가 디스플레이될 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치의 사용자는 상기 문구를 확인하고, 모자를 벗을 수 있다. 전자 장 치는 사용자가 모자를 벗었음을 확인하는 경우, 촬영 중인 이미지에서 ‘촬영해도 좋습니다’ 등의 문구 를 디스플레이할 수 있다. 도 23a 및 도 23b는 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 다양한 예들을 도 시한 도면들이다. 본 발명의 다양한 실시 예에 따라, 전자 장치에서는 사용자가 촬영 중인 얼굴 영역의 방향 혹은 크기를 확인할 수 있도록 얼굴 영역에 대응하는 선이 디스플레이될 수 있다. 도 23a를 참조하면, 얼굴 영역 촬영 대상인 여고생이 얼굴을 비스듬히 촬영하고 있는 상황을 가정한다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 상기 선에서 촬영 중인 얼굴 영역이 벗어났는지 여부에 따라 얼굴 영역이 정면으로 촬영되고 있는지를 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영 중인 얼굴 영역이 상기 선에서 벗어난 것으로 판단 되는 경우, 얼굴을 정면으로 위치할 것을 지시할 수 있다. 예컨대, 촬영 중인 이미지에서는 ‘얼굴을 정 면에 위치해 주세요’등의 문구가 디스플레이될 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치의 사용자는 상기 문구를 확인하고, 얼굴을 선에 맞게 위치할 수 있다. 전자 장치는 사용자가 얼굴을 정면으로 위치하였음을 확인하는 경우, 촬영 중인 이미지에서 ‘ 촬영해도 좋습니다’ 등의 문구를 디스플레이할 수 있다. 도 23b를 참조하면, 얼굴 영역 촬영 대상인 여고생이 얼굴을 멀리서 촬영하고 있는 상황을 가정한다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영 중인 얼굴 영역의 크기가 상기 선의 크기에 맞게 위 치였는지 여부에 따라 얼굴 영역이 멀리서 혹은 가까이에서 촬영되고 있는지를 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영 중인 얼굴 영역이 상기 선 영역의 크기보다 작아 멀 리서 촬영되고 있는 것으로 판단 되는 경우, 얼굴을 가까이 위치할 것을 지시할 수 있다. 예컨대, 촬영 중인 이 미지에서는 ‘얼굴을 좀 더 가까이 위치해 주세요’등의 문구가 디스플레이될 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치의 사용자는 상기 문구를 확인하고, 얼굴을 선에 맞게 위치할 수 있다. 전자 장치는 사용자가 얼굴을 가까이위치하였음을 확인하는 경우, 촬영 중인 이미지에서 ‘촬영 해도 좋습니다’ 등의 문구를 디스플레이할 수 있다. 도 24는 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 일 예를 도시한 도면이다. 도 24를 참조하면, 전자 장치에서는 이미지가 흔들리게 촬영된 상황을 가정한다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영 중인 이미지에서 얼굴 영역의 형태를 확인할 수 없거나 센 서 등을 통해 전자 장치가 흔들리고 있음을 확인하는 경우, 손떨림 보정 기능을 동작시킬 수 있다. 예컨대, 상 기 손떨림 보정 기능은 이미지의 촬영 시 셔터 스피트 혹은 조리개 등을 조절하여, 이미지가 흔들리게 촬영되지 않도록 제어하는 기능을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 손떨림 보정 기능이 설정된 이후, 전자 장치에서는 촬영 중인 이미지 에 ‘촬영해도 좋습니다’등의 문구를 디스플레이할 수 있다. 예컨대, 사용자는 전자 장치에서 촬영 중인 이미지가 흔들리지 않게 촬영될 수 있음을 확인하고 촬영할 수 있다. 도 25는 본 발명의 다양한 실시 예에 따른 전자 장치 구성의 일 예를 도시한 블록도이다. 상기 전자 장치(250 1)는, 예를 들면, 도 1 혹은 도 19에 도시된 전자 장치(100 혹은 1901)의 전체 또는 일부를 구성할 수 있다. 도 25를 참조하면, 상기 전자 장치는 하나 이상의 프로세서(예: 애플리케이션 프로세서(AP: application processor)), 통신 모듈, SIM(subscriber identification module) 카드, 메모리, 센 서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈 , 전력관리 모듈, 배터리, 인디케이터 및 모터를 포함할 수 있다. 상기 AP는 운영체제 또는 응용 프로그램을 구동하여 상기 AP에 연결된 다수의 하드웨어 또는 소프 트웨어 구성요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 상기 AP는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시 예에 따르면, 상기 AP는 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 상기 통신 모듈(예: 상기 통신 인터페이스)는 상기 전자 장치(예: 전자 장치 혹은 전자 장치)와 네트워크를 통해 연결된 다른 전자 장치들(예: 전자 장치 또는 서버) 간의 통신에서 데이터 송수신을 수행할 수 있다. 한 실시 예에 따르면, 상기 통신 모듈은 셀룰러 모듈, Wifi 모듈 , BT 모듈, GPS 모듈, NFC 모듈 및 RF(radio frequency) 모듈를 포함할 수 있 다. 상기 셀룰러 모듈은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통 화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈은, 예를 들면, 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수 행할 수 있다. 한 실시 예에 따르면, 상기 셀룰러 모듈은 상기 AP가 제공할 수 있는 기능 중 적어 도 일부 기능을 수행할 수 있다. 예를 들면, 상기 셀룰러 모듈은 멀티 미디어 제어 기능의 적어도 일부를 수행할 수 있다. 한 실시 예에 따르면, 상기 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함 할 수 있다. 또한, 상기 셀룰러 모듈은, 예를 들면, SoC로 구현될 수 있다. 도 25에서는 상기 셀룰러 모 듈(예: 커뮤니케이션 프로세서), 상기 메모리 또는 상기 전력관리 모듈 등의 구성요소들이 상기 AP와 별개의 구성요소로 도시되어 있으나, 한 실시 예에 따르면, 상기 AP가 전술한 구성요소 들의 적어도 일부(예: 셀룰러 모듈)를 포함하도록 구현될 수 있다. 한 실시 예에 따르면, 상기 AP 또는 상기 셀룰러 모듈(예: 커뮤니케이션 프로세서)은 각각에 연결 된 비휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로 드(load)하여 처리할 수 있다. 또한, 상기 AP 또는 상기 셀룰러 모듈은 다른 구성요소 중 적어도 하나로부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장(store) 할 수 있다. 상기 Wifi 모듈, 상기 BT 모듈, 상기 GPS 모듈 또는 상기 NFC 모듈 각각은, 예를 들 면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 25에서는 셀룰 러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈이 각각 별개의 블록으 로 도시되었으나, 한 실시 예에 따르면, 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포 함될 수 있다. 예를 들면, 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모 듈 각각에 대응하는 프로세서들 중 적어도 일부(예: 셀룰러 모듈에 대응하는 커뮤니케이션 프로세 서 및 Wifi 모듈에 대응하는 Wifi 프로세서)는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈는, 도 시되지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈는 무선 통신에서 자 유 공간상의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 25에서는 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 및 NFC 모듈이 하나의 RF 모듈 을 서로 공유하는 것으로 도시되어 있으나, 한 실시 예에 따르면, 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송 수신을 수행할 수 있다. 상기 SIM 카드는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯 에 삽입될 수 있다. 상기 SIM 카드는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리(예: 저장부 혹은 메모리)는 내장 메모리 또는 외장 메모리를 포함할 수 있다. 상기 내장 메모리는, 예를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM) 등) 또는 비휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 상기 내장 메모리는 Solid State Drive(SSD)일 수 있다. 상기 외장 메모리 는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital) 또는 Memory Stick 등을 더 포함할 수 있다. 상기 외장 메모리는 다양한 인터페이스를 통하여 상기 전자 장치과 기능적으로 연결될 수 있다. 한 실시 예에 따르면, 상기 전자 장치는 하드 드라이브와 같은 저장 장치(또는 저장 매체)를 더 포함할 수 있다. 상기 센서 모듈은 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보 를 전기 신호로 변환할 수 있다. 상기 센서 모듈은, 예를 들면, 제스처 센서(2540A), 자이로 센서 (2540B), 기압 센서(2540C), 마그네틱 센서(2540D), 가속도 센서(2540E), 그립 센서(2540F), 근접 센서 (2540G), color 센서(예: RGB(red, green, blue) 센서(2540H)), 생체 센서(2540I), 온/습도 센서(2540J), 조도 센서(2540K) 또는 UV(ultra violet) 센서(2540M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적 으로, 상기 센서 모듈은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서(electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도 시), IR(infra red) 센서(미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 입력 장치는 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키(key) 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 상기 터치 패널은, 예를 들면, 정전식, 감 압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널은 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터치 패널은 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널은 사 용자에게 촉각 반응을 제공할 수 있다. 상기(디지털) 펜 센서는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도 의 인식용 쉬트(sheet)를 이용하여 구현될 수 있다. 상기 키는, 예를 들면, 물리적인 버튼, 광학식 키 또 는 키패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치는 초음파 신호를 발생하는 입력 도구를 통해, 전자 장치에서 마이크(예: 마이크)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서,무선 인식이 가능하다. 한 실시 예에 따르면, 상기 전자 장치는 상기 통신 모듈를 이용하여 이와 연결된 외부 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 상기 디스플레이(예: 표시부 혹은 디스플레이)는 패널, 홀로그램 장치 또는 프로 젝터을 포함할 수 있다. 상기 패널은, 예를 들면, LCD(liquid-crystal display) 또는 AM- OLED(active-matrix organic light-emitting diode) 등일 수 있다. 상기 패널은, 예를 들면, 유연하게 (flexible), 투명하게(transparent) 또는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널은 상기 터치 패널과 하나의 모듈로 구성될 수도 있다. 상기 홀로그램 장치은 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 상기 디스플레이는 상기 패널, 상기 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface) 또는 D-sub(D-subminiature)를 포함할 수 있다. 상기 인터페이스는, 예를 들면, 도 19에 도시된 통신 인터페이스에 포함될 수 있다. 추가적 으로 또는 대체적으로, 상기 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터 페이스를 포함할 수 있다. 상기 오디오 모듈은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 상기 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰 또는 마이크 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 상기 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래 쉬(flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈은 상기 전자 장치의 전력을 관리할 수 있다. 도시하지는 않았으나, 상기 전력 관리 모듈은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분될 수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시 예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등 이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가 될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 상기 배터리는 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치에 전원을 공급할 수 있다. 상기 배터리는, 예를 들면, 충전식 전지(rechargeable battery) 또는 태양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터는 상기 전자 장치 혹은 그 일부(예: 상기 AP)의 특정 상태, 예를 들면, 부 팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터는 전기적 신호를 기계적 진동으로 변환할 수 있다. 도시되지는 않았으나, 상기 전자 장치는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 상기 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(componen t)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다 양한 실시 예에 따른 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요 소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시 예에 따른전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 본 발명의 다양한 실시 예에 사용된 용어 “모듈”은, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. “모듈”은 예를 들어, 유닛(unit), 로 직(logic), 논리 블록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용 (interchangeably use)될 수 있다. “모듈”은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. “모듈”은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. “모듈”은 기계적 으로 또는 전자적으로 구현될 수 있다. 예를 들면, 본 발명의 다양한 실시 예에 따른 “모듈”은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field- programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함 할 수 있다. 다양한 실시 예에 따르면, 본 발명의 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로그래밍 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer- readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어는, 하나 이상의 프로세서(예: 제어부 혹은 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 저장부 혹은 메모리가 될 수 있다. 상기 프로그래밍 모듈의 적어도 일부는, 예를 들면, 상기 제어부 혹은 프로세서에 의해 구현 (implement)(예: 실행)될 수 있다. 상기 프로그래밍 모듈 의 적어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등을 포함할 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체에는 하드디스크, 플로피디스크 및 자기 테이프와 같은 마그네틱 매체 (Magnetic Media)와, CD-ROM(Compact Disc Read Only Memory), DVD(Digital Versatile Disc)와 같은 광기록 매체(Optical Media)와, 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media)와, 그 리고 ROM(Read Only Memory), RAM(Random Access Memory), 플래시 메모리 등과 같은 프로그램 명령(예: 프로그 래밍 모듈)을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함될 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실 행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 본 발명의 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 본 발명의 다양한 실시 예에 따른 모듈 또는 프로그래밍 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함 하거나, 일부가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 모듈, 프로그래밍 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리 스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다 른 동작이 추가될 수 있다. 본 발명의 다양한 실시 예에 따르면, 명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나 의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설 정된 것으로서, 상기 적어도 하나의 동작은, 카메라 모듈을 통해 촬영중인 이미지에서 적어도 하나의 얼굴 영역 을 검출하는 동작과, 상기 검출된 적어도 하나의 얼굴 영역을 세부 촬영하는 동작과, 상기 세부 촬영된 얼굴 영 역을 적어도 하나의 분석 항목에 따라 분석하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 적어도 하나의 동작은, 저장된 적어도 하나의 이미지에서 얼굴 영역을 검출하는 동작과, 상기 검출된 적어도 하나의 얼굴 영역을 적어도 하나의 분석 항목에 따라 분석하는 동작을 포 함할 수 있다. 본 발명의 다양한 실시 예에 따라, 얼굴 정보를 분석하는 동작은 이전에 저장된 이미지를 기반으로 수행될 수 있다. 예컨대, 상기 저장된 이미지는 미리 설정된 고정 포커스 값에 따라, 미리 설정된 거리 혹은 각도에 따라 촬영된 것일 수 있다. 전자 장치에서는 사용자의 얼굴이 상기 설정된 거리 혹은 각도에 대응하는 위치에 있는 경우, 얼굴 이미지를 촬영하거나, 사용자에게 거리 혹은 각도에 대응하게 촬영할 것을 요청하는 화면을 표시할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 저장된 이미지는 사용자가 촬영 동작을 실행시키지 않고도 미리 설정된 상황에서 촬영되어 저장될 수 있다. 예컨대, 사용자가 전자 장치를 미리 설정된 시간 이상으로 주시하는 상황(예, 웹 브라우저를 확인하거나, 미디어 파일(예, 동영상)을 시청하는 경우 등) 혹은 전자 장치가 사용자의 얼 굴 이미지를 촬영할 수 있는 각도(예, 전면 카메라의 각도에 따라 사용자의 얼굴을 정면 방향으로 촬영할 수 있 는 상황)에 위치한 경우 등에서 전자 장치는 카메라 모듈을 백 그라운드로 실행시켜 사용자의 얼굴 이미지를 촬 영할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 저장된 이미지를 확인하고, 상기 이미지에서 분석이 불필요한 부분(예, 그림자 혹은 털)을 제거하고, 상기 불필요한 부분이 제거된 영역에서 적어도 하나의 기준점을 설정하 여 얼굴 영역을 판단할 수 있다. 예컨대, 상기 기준점은 이미지에서 전체 얼굴 영역에 설정되고, 미리 분석된 데이터 베이스 혹은 이전에 분석된 특정 사용자의 얼굴 이미지에 기반하여, 각 얼굴 영역(예, C존, M존, U존, 눈, 코, 볼 혹은 입 등)을 구분하도록 설정될 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 이전에 저장된 이미지에서 얼굴 영역이 판단되면, 각 영역에 대 한 피부 상태를 분석한 결과를 분석 결과 화면을 통해 출력할 수 있다. 본 발명의 다양한 실시 예에 따라, 얼굴 정보를 분석하는 동작은 이전에 저장된 이미지를 기반으로 수행될 수 있다. 예컨대, 전자 장치는 이미지에서 적어도 하나의 기준점을 설정하고, 상기 설정된 기준점에 근거하여 얼굴 영역을 판단할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 이전에 저장된 이미지에서 얼굴 영역이 판단되면, 각 영역에 대 한 피부 상태를 분석한 결과를 분석 결과 화면을 통해 출력할 수 있다. 도 26은 본 발명의 다양한 실시 예에 따라, 저장된 이미지를 기반으로 얼굴 정보를 분석하는 어플리케이션 화면 의 일 예를 도시한 도면이다. 도 26을 참조하면, 얼굴 정보를 분석하는 어플리케이션이 실행되면, 실행 화면은 전자 장치에 저장된 이 미지들을 표시하는 갤러리를 실행하는 갤러리 버튼 혹은 카메라 모듈을 활성화시켜 이미지를 촬영하는 화 면으로 전환하는 카메라 버튼을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 갤러리 버튼이 선택됨에 따라 표시되는 이미지들은 사용자가 선 택할 수 있도록 선택 항목을 포함하거나, 전자 장치에 저장된 이미지들 중 얼굴 정보가 분석 가능한 이미지들로 걸러진 것일 수 있다. 상기 얼굴 정보가 분석 가능한 이미지는 이미지에서 얼굴 영역이, 미리 설정된 각도 혹은 크기에 대응하게 촬영된 이미지일 수 있다. 본 발명의 다양한 실시 예에 따라, 갤러리 버튼이 선택되면, 얼굴 정보를 분석할 적어도 하나의 이미지를 선택할 수 있는 이미지 선택 화면이 표시될 수 있다. 예컨대, 이미지 선택 화면에 표시되는 이미지 들은 최근에 촬영되거나 저장된 순으로 정렬되어 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자가 상기 이미지 선택 화면에 포함된 이미지 중 적어도 하나를 얼굴 정보를 분석할 이미지로 선택하면, 상기 선택된 이미지들을 분석한 결과를 표시하는 분석 결과 화면(263 0)이 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 분석 결과 화면은 얼굴 정보를 분석한 결과를 이미지로 표시하는 영역 , 얼굴 정보를 분석한 결과를 수치 혹은 그래프로 표시하는 영역 혹은 각 분석 항목에 대한 분석 결과를 선택할 수 있는 버튼들을 포함할 수 있으며, 그 외 얼굴 분석과 관련된 다양한 항목들을 포함할 수 있다. 예컨대, 상기 각 분석 항목 별 분석 결과를 선택할 수 있는 버튼들은 전체 얼굴 영역에 대한 분석 결과를"}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "표시하는 요약 버튼(2633a), 주름에 관한 분석 결과를 표시하는 주름 버튼(2633b), 트러블에 관한 분석 결과를 표시하는 트러블 버튼(2633c) 혹은 색소침착에 관한 분석 결과를 표시하는 색소침착 버튼(2633d)을 포함할 수 있으며, 그 외 다양한 분석 항목에 대한 분석 결과를 표시하기 위한 선택 항목들을 포함할 수 있다. 도 27은 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 27을 참조하면, 분석 결과 화면은 분석된 얼굴 영역을 표시하는 이미지 영역, 분석 결과를 표시 하는 분석 결과 영역 혹은 각 세부 분석 항목 별 분석 결과를 선택하기 위한 분석 항목 선택 영역 을 포함할 수 있다. 상기 이미지 영역에서는 전자 장치에 저장된 이미지에서 얼굴 영역을 검출하고, 상기 검출된 얼굴 영역에 적어도 하나의 기준점이 설정될 수 있다. 상기 적어도 하나의 기준점을 기반으로, 적어도 하나의 분석 항목에 따라 분석될 얼굴 영역(예, 2711, 2712, 2713, 2714, 2715 혹은 2716)이 설정될 수 있다. 상기2712 영역은 C 존으로서, 양쪽 눈 바깥 부분의 영역을, 상기 2713은 코 영역을, 상기 2714는 볼 영역을, 상기 2715는 코 옆 영역을, 상기 2716은 입 주변 영역을 각각 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 각 얼굴 영역은 사용자 입력(예, 터치 제스처)이 입력됨에 따라 선택될 수 있으며, 선택된 얼굴 영역에 대하여 해당 얼굴 영역에 대해 분석된 화면이 확대되어 표시될 수 있다. 상기 분석 결과 영역에서는 피부 상태를 분석한 결과가 수치(예, 점수)화 혹은 그래프화되어 표시될 수 있다. 예컨대, 상기 그래프는 특정 얼굴 영역을 분석 항목 별로 분석하여 각 분석 항목 별 피 부 상태에 대한 점수를 나타낼 수 있다. 상기 점수는 특정 얼굴 영역에 대한 분석 항목 별 점수를 평균 적으로 계산한 것으로 높은 점수일수록 좋은 피부 상태임을 나타낼 수 있다. 상기 분석 항목 선택 영역은 각 분석 항목 별 분석 결과를 표시하기 위한 적어도 하나의 버튼을 포함할 수 있으며, 선택된 버튼에 따라 특정 얼굴 영역에 대한 분석 결과가 상기 이미지 혹은 상기 분석 결과 영"}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "역을 통해 표시될 수 있다. 예컨대, ‘요약’ 버튼이 선택되면, 얼굴 영역 중 전체 얼굴 영역이 상기 이 미지를 통해 표시되며, 전체 얼굴 영역에 대한 분석 결과가 상기 분석 결과 영역을 통해 표시될 수 있다. 도 28은 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 28을 참조하면, 분석 결과 화면은 분석된 얼굴 영역 중 적어도 하나를 선택할 수 있는 이미지 영역 , 분석 결과 영역 혹은 분석 항목 선택 영역을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 분석 항목 선택 영역에서 주름(Wrinkle) 버튼이 선택되었 으며, 다양한 분석 항목 중 주름에 대해 분석된 결과가 상기 이미지 영역 혹은 분석 결과 영역을 통해 표시될 수 있다. 상기 이미지 영역에서는 전자 장치에 저장된 이미지들을 기반으로, 주름에 대해 분석된 적어도 하나의 얼 굴 영역(예, C존 혹은 U존 영역)이 분석된 결과가 이미지로 표시될 수 있다. 예컨대, 각 얼굴 영역의 색깔은 피 부 상태에 따라 다르게 표시됨으로써 사용자는 표시된 색깔로 피부 상태를 확인할 수 있다. 상기 분석 결과 영역에서는 주름에 대해 분석한 결과를 C존 혹은 M존 각각에 대해 평균 점수와 비교한 그 래프 혹은 주름에 대한 전체 얼굴 영역에 대한 점수가 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자가 확대 혹은 세부적인 분석 결과를 확인하고자 사용자 입력을 특정 영역(예, 왼쪽 C존 영역)으로 입력하면, 상기 사용자 입력이 입력된 영역(예, 왼쪽 C존 영역)이 상세하게 분석된 확대 화면이 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 분석 결과 영역은 전체 얼굴 영역에 대한 주름 변화의 히스토리 를 제공할 수 있다. 예컨대, 상기 분석 결과 영역은 한달 전 주름 상태와 현재 측정된 주름 상태를 비교 한 그래프 혹은 각 C존 혹은 M존의 주름 상태가 이전보다 얼마만큼 향상되었는지를 나타내는 그래프 를 포함할 수 있다. 도 29는 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 29를 참조하면, 사용자는 분석 항목 선택 영역에서 주름 버튼을 선택하였으며, 이에 따라 분석 결과 화면은 주름에 대해 분석한 이미지 혹은 분석 결과 영역을 포함할 수 있다. 상기 분석 결과 영역에서는 세부 영역(예, C존의 왼쪽(CL)/오른쪽(CR) 혹은 M존의 왼쪽(ML)/오른쪽(MR)) 각각에 대한 주름 상태의 점수 혹은 전체 얼굴 영역에서의 주름 상태가 점수로 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 분석된 얼굴 영역 중 확대 혹은 세부 화면을 확인하고자 하는 영역 을 선택할 수 있다. 예컨대, 사용자 입력을 통해 “왼쪽 C존 영역”이 선택되면, 얼굴에서 C존의 왼쪽 영 역이 확대된 화면이 표시될 수 있다. 사용자 입력을 통해 코 왼쪽 영역이 선택되면, 얼굴에서 코의 왼쪽 영역이 확대된 화면이 표시될 수 있다. 도 30은 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 30을 참조하면, 사용자가 분석 결과 화면의 분석 항목 선택 영역에서 트러블(trouble) 버튼 을 선택한 경우, 상기 분석 결과 화면은 다양한 분석 항목 중 트러블에 대해 분석된 결과가 상기 이미지 영역 혹은 분석 결과 영역을 통해 표시될 수 있다. 상기 이미지 영역에서는 전자 장치에 저장된 이미지들을 기반으로, 트러블에 대해 분석된 적어도 하나의 얼굴 영역(예, 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽(B) 영역)이 분석된 결과가 이미지로 표시될 수 있다. 예컨대, 각 얼굴 영역의 색깔은 피부 상태에 따라 다르게 표시됨으로써 사용자는 표시된 색깔로 해당 얼굴 영역 의 피부 상태를 확인할 수 있다. 상기 분석 결과 영역에서는 트러블에 대해 분석한 결과를 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽(B) 영역 각각에 대해 평균 점수와 비교한 그래프 혹은 트러블에 대한 전체 얼굴 영역에 대한 점수가 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자 입력을 통해 얼굴의 아래쪽이 선택되면, 상기 아래쪽 영역이 상세하게 분석된 확대 화면이 표시될 수 있다. 예컨대, 상기 사용자는 확대 화면을 통해, 상기 아 래쪽 영역에서 구체적으로 어디에 트러블이 있는지 트러블의 크기는 어떠한지를 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 분석 결과 영역은 전체 얼굴영역에 대한 트러블 변화의 히스토리 를 제공할 수 있다. 예컨대, 상기 분석 결과 영역은 한달 전 트러블 상태와 현재 측정된 트러블 상태를 비교한 그래프 혹은 각 영역(예, 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽(B) 영역)의 트러블 상태가 이 전보다 얼마만큼 향상되었는지를 나타내는 그래프를 포함할 수 있다. 도 31은 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 31을 참조하면, 사용자는 분석 항목 선택 영역에서 트러블 버튼을 선택하였으며, 이에 따라 분석 결과 화면은 트러블에 대해 분석한 이미지 혹은 분석 결과 영역을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 분석된 얼굴 영역 중 확대 혹은 세부 화면을 확인하고자 하는 영역 을 선택할 수 있다. 예컨대, 사용자 입력을 통해 왼쪽 볼 영역이 선택되면, 얼굴의 볼 왼쪽이 확대된 화 면이 표시될 수 있다. 사용자 입력을 통해 아래쪽이 선택되면, 얼굴의 아래쪽이 확대된 화면(312 0)이 표시될 수 있다. 도 32는 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 32를 참조하면, 사용자가 분석 결과 화면의 분석 항목 선택 영역에서 색소 침착(pigmentation) 버튼을 선택한 경우, 상기 분석 결과 화면은 다양한 분석 항목 중 색소 침착에 대해 분석된 결과가 상기 이미지 영역 혹은 분석 결과 영역을 통해 표시될 수 있다. 상기 이미지 영역에서는 전자 장치에 저장된 이미지들을 기반으로, 색소 침착에 대해 분석된 적어도 하나 의 얼굴 영역(예, 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽(B) 영역)이 분석된 결과가 이미지로 표시될 수 있 다. 예컨대, 각 얼굴 영역의 색깔은 피부 상태에 따라 다르게 표시됨으로써 사용자는 표시된 색깔로 해당 얼굴 영역의 피부 상태를 확인할 수 있다. 상기 분석 결과 영역에서는 색소 침착에 대해 분석한 결과를 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽 (B) 영역 각각에 대해 평균 점수와 비교한 그래프 혹은 색소 침착에 대한 전체 얼굴 영역에 대한 점수 가 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자 입력을 통해 왼쪽 볼이 선택되면, 상기 왼쪽 영역이 상세하게 분석된 확대 화면이 표시될 수 있다. 예컨대, 상기 사용자는 확대 화면을 통해, 상기 왼쪽 영역 에서 구체적으로 어디에 색소 침착이 생성되었는지 색소 침착된 부위의 크기는 어떠한지를 확인할 수 있 다. 본 발명의 다양한 실시 예에 따라, 상기 분석 결과 영역은 전체 얼굴 영역에 대한 색소 침착 변화의 히스 토리를 제공할 수 있다. 예컨대, 상기 분석 결과 영역은 한달 전 색소 침착 상태와 현재 측정된 색소 침 착 상태를 비교한 그래프 혹은 각 영역(예, 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽(B) 영역)의 색소 침착의 상태가 이전보다 얼마만큼 향상되었는지를 나타내는 그래프를 포함할 수 있다. 도 33은 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 33을 참조하면, 사용자는 분석 항목 선택 영역에서 색소 침착 버튼을 선택하였으며, 이에 따라 분석 결과 화면은 색소 침착에 대해 분석한 이미지 혹은 분석 결과 영역을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 분석된 얼굴 영역 중 확대 혹은 세부 화면을 확인하고자 하는 영역 을 선택할 수 있다. 예컨대, 사용자 입력을 통해 왼쪽 볼이 선택되면, 얼굴의 왼쪽(L)이 확대된 화면 이 표시될 수 있다. 사용자 입력을 통해 코가 선택되면, 위쪽(T) 영역이 확대된 화면이 표시 될 수 있다. 도 34는 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 34를 참조하면, 사용자가 분석 결과 화면의 분석 항목 선택 영역에서 모공(pore) 버튼을 선택한 경우, 상기 분석 결과 화면은 다양한 분석 항목 중 모공에 대해 분석된 결과가 상기 이미지 영역 혹은 분석 결과 영역을 통해 표시될 수 있다. 상기 이미지 영역에서는 전자 장치에 저장된 이미지들을 기반으로, 모공에 대해 분석된 적어도 하나의 얼 굴 영역(예, 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽(B) 영역)이 분석된 결과가 이미지로 표시될 수 있다. 예 컨대, 각 얼굴 영역의 색깔은 피부 상태에 따라 다르게 표시됨으로써 사용자는 표시된 색깔로 해당 얼굴 영역의 피부 상태를 확인할 수 있다. 상기 분석 결과 영역에서는 모공에 대해 분석한 결과를 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽(B) 영 역 각각에 대해 평균 점수와 비교한 그래프 혹은 모공에 대한 전체 얼굴 영역에 대한 점수가 표시 될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자 입력을 통해 오른쪽 볼이 선택되면, 얼굴의 오른쪽 영역이 상 세하게 분석된 확대 화면이 표시될 수 있다. 예컨대, 상기 사용자는 확대 화면을 통해, 상기 오른 쪽 영역에서 구체적으로 어디에 모공이 생성되었는지 생성된 모공의 크기는 어떠한지를 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 분석 결과 영역은 전체 얼굴영역에 대한 모공 변화의 히스토리를 제공할 수 있다. 예컨대, 상기 분석 결과 영역은 한달 전 모공 상태와 현재 측정된 모공 상태를 비교한 그래프 혹은 전체 얼굴 영역의 모공 상태가 이전보다 얼마만큼 향상되었는지를 나타내는 그래프를 포함할 수 있다. 도 35는 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 일 예를 도시한 도면이다. 도 35를 참조하면, 사용자가 분석 결과 화면의 분석 항목 선택 영역에서 피부톤(tone) 버튼 을 선택한 경우, 상기 분석 결과 화면은 다양한 분석 항목 중 피부톤에 대해 분석된 결과가 상기 이미지 영역 혹은 분석 결과 영역을 통해 표시될 수 있다. 상기 이미지 영역에서는 전자 장치에 저장된 이미지들을 기반으로, 피부톤에 대해 분석된 적어도 하나의 얼굴 영역(예, 이마(L), 볼(A) 혹은 턱(B) 영역)이 분석된 결과가 이미지로 표시될 수 있다. 예컨대, 각 얼굴 영역의 색깔은 피부 상태에 따라 다르게 표시됨으로써 사용자는 표시된 색깔로 해당 얼굴 영역의 피부 상태를 확인할 수 있다. 상기 분석 결과 영역에서는 피부톤의 균일도에 대해 분석한 결과를 이마(L), 볼(A) 혹은 턱(B) 영역 각각 에 대해 평균 점수와 비교한 그래프 혹은 전체 얼굴 영역에서 피부톤 균일도에 대한 점수가 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자가 점수를 선택한 경우, 상기 분석 결과 영역은 전체 얼 굴영역에 대한 피부톤 변화에 대한 세부 분석한 결과를 제공할 수 있다. 예컨대, 상기 분석 결과 영역은 각 얼굴 영역(예, 이마(L), 볼(A) 혹은 턱(B) 영역)에 대해 한달 전 피부톤 상태와 현재 측정된 피부톤 균일도 상태를 비교한 그래프 혹은 각 얼굴 영역의 피부톤의 균일도 상태가 이전보다 얼마만큼 향상되었는지를 나타내는 그래프를 포함할 수 있다. 도 36은 본 발명의 다양한 실시 예에 따라, 저장된 이미지를 기반으로 분석한 얼굴 정보의 히스토리를 보여주는 어플리케이션 화면의 일 예를 도시한 도면이다. 도 36을 참조하면, 얼굴 정보를 분석하는 어플리케이션을 통해 얼굴 정보를 분석한 결과를 포함하는 분석 결과 화면이 표시되면, 상기 분석된 얼굴 정보와 관련된 기능을 포함하는 메뉴가 표시될 수 있다. 예컨 대, 상기 메뉴가 선택되면, 적어도 하나의 선택된 이미지를 시범적으로 분석하기 위한 영상 전체 분석, 상기 분석한 얼굴 정보의 히스토리를 표시하는 변화 관리 혹은 이전에 분석한 얼굴 정보의 데이터를 초기 화 시키는 DB 초기화 기능을 선택할 수 있는 선택 항목들이 표시될 수 있으며, 그 외 얼굴 정보의 분석과 관련 된 다양한 기능들이 상기 메뉴에 포함될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자가 상기 변화 관리를 선택한 경우, 이전에 분석된 얼굴 정보의 변화가 분석 결과 화면의 이미지 영역 혹은 분석 결과 영역을 통해 표시될 수 있다. 예컨대, 상기 분석 결과 영역은 얼굴 정보가 분석된 시간 구간 동안 각 분석 항목에 따른 얼굴 분석의 결과를 그래프 로 표시할 수 있으며, 상기 이미지 영역에서는 상기 그래프에서 사용자 입력이 입력된 특정 시점에서 얼굴 정보를 분석한 이미지가 표시될 수 있다. 도 37은 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 일 예를 도시한 도 면이다. 도 37을 참조하면, 사용자는 분석 결과 화면에서 분석 결과의 변화를 확인하고자 하는 분석 항목 혹은 이 미지 영역을 선택할 수 있다. 예컨대, 상기 사용자는 색소 침착에 대한 분석 결과의 변화를 확인하고자, 분석"}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "항목(예, 요약, 주름, 트러블 혹은 색소 침착) 중 요약 버튼을 선택할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 사용자는 사용자 입력(예, 핀치 인/아웃 혹은 탭 앤 드래그)을 입력하여, 이미지 영역에 표시된 이미지의 크기를 확대하거나 위치를 이동시켜 분석 결과의 변화를 확인하고자 하는 이미지 영역을 설정할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 분석 결과 화면은 설정된 이미지 영역을 표시하고, 상기 표시된 이미지 영역에 대해 적어도 하나의 분석 항목(예, 색소 침착, 트러블 혹은 주름)에 따라 분석한 결과의 변화를 그래프로 표시할 수 있다. 예컨대, 상기 그래프는 얼굴 정보가 분석된 시간 및 상기 시간에 해당하는 분석 결과 를 도시한 것으로, 사용자 입력이 특정 시간으로 입력되면 해당 시점에서 얼굴 정보가 분석된 이미지가 표시될 수 있다. 도 38은 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 일 예를 도시한 도 면이다. 도 38을 참조하면, 분석 결과 화면은 이미지 영역 혹은 분석 결과 영역을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 주름에 관한 분석 결과의 변화를 확인하기 위하여, 분석"}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "항목들(예, 요약, 주름, 트러블 혹은 색소 침착) 중 주름을 선택할 수 있다. 상기 이미지 영역에서는 이미지의 얼굴 영역 중 주름에 대해 분석한 결과가 표시될 수 있다. 예컨대, 주 름에 대해 분석한 결과는 선의 형태로 표시되며, 선의 굵기 혹은 길이에 따라 주름의 깊이 혹은 길이를 나타낼 수 있다. 상기 분석 결과 영역은 상기 주름에 대해 분석된 결과를 이전에 분석된 시간에 따른 각 얼굴 영역(예, C 존의 오른쪽(CR) 혹은 왼쪽(CL), M존의 오른쪽(MR) 혹은 왼쪽(ML) 영역) 별 주름 상태를 그래프로 나타낼 수 있 다. 본 발명의 다양한 실시 예에 따라, 사용자가 상기 그래프에서 특정 시간으로 사용자 입력(예, 탭 혹은 스와이프)을 입력하면, 해당 시점에서 주름을 분석하기 위해 사용된 이미지가 상기 이미지 영역을 통해 표시되며, 상기 표시된 이미지에는 해당 시점에서 주름이 분석된 결과가 표시될 수 있다. 도 39는 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 일 예를 도시한 도 면이다. 도 39를 참조하면, 분석 결과 화면은 이미지 영역 혹은 분석 결과 영역을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 트러블에 관한 분석 결과의 변화를 확인하기 위하여, 분석 항목들"}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "(예, 요약, 주름, 트러블 혹은 색소 침착) 중 트러블을 선택할 수 있다. 상기 이미지 영역에서는 이미지의 얼굴 영역 중 트러블에 대해 분석한 결과가 표시될 수 있다. 예컨대, 트러블에 대해 분석한 결과는 해당 트러블에 대응하는 형태로 표시되며, 형태의 크기 혹은 색깔에 따라 트러블 의 크기 혹은 상태를 나타낼 수 있다. 상기 분석 결과 영역은 상기 트러블에 대해 분석된 결과를 이전에 분석된 시간에 따른 각 얼굴 영역(예, 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽(B) 영역) 별 트러블 상태를 그래프로 나타낼 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자가 상기 그래프에서 특정 시간으로 사용자 입력(예, 탭 혹은 스와이프)을 입력하면, 해당 시점에서 트러블을 분석하기 위해 사용된 이미지가 상기 이미지 영역을 통해표시되며, 상기 표시된 이미지에는 해당 시점에서 트러블이 분석된 결과가 표시될 수 있다. 도 40은 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 일 예를 도시한 도 면이다. 도 40을 참조하면, 분석 결과 화면은 이미지 영역 혹은 분석 결과 영역을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 색소 침착에 관한 분석 결과의 변화를 확인하기 위하여, 분석 항목"}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "들(예, 요약, 주름, 트러블 혹은 색소 침착) 중 색소 침착을 선택할 수 있다. 상기 이미지 영역에서는 이미지의 얼굴 영역 중 색소 침착에 대해 분석한 결과가 표시될 수 있다. 예컨대, 색소 침착에 대해 분석한 결과는 해당 색소 침착에 대응하는 형태로 표시되며, 형태의 크기 혹은 색깔 에 따라 색소 침착의 크기 혹은 상태를 나타낼 수 있다. 상기 분석 결과 영역은 상기 색소 침착에 대해 분석된 결과를 이전에 분석된 시간에 따른 각 얼굴 영역 (예, 오른쪽(R), 왼쪽(L), 위쪽(T) 혹은 아래쪽(B) 영역) 별 색소 침착 상태를 그래프로 나타낼 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자가 상기 그래프에서 특정 시간으로 사용자 입력(예, 탭 혹은 스와이프)을 입력하면, 해당 시점에서 색소 침착을 분석하기 위해 사용된 이미지가 상기 이미지 영역을 통해 표시되며, 상기 표시된 이미지에는 해당 시점에서 색소 침착이 분석된 결과가 표시될 수 있다. 도 41은 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 일 예를 도시한 도 면이다. 도 41을 참조하면, 얼굴 정보를 분석하는 어플리케이션의 메뉴(예, 3601)에서 변화 관리(예, 3602)가 선택되면, 분석 결과 화면은 다양한 분석 항목에 따른 분석 결과의 히스토리를 표시할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 분석 결과 화면은 선택된 분석 항목에 대해 특정 시점에서 얼굴 정보가 분석된 이미지를 포함하는 이미지 영역 혹은 이전에 분석된 결과를 각 분석 항목(예, (색소)침착, 트러블 혹은 에 대해 분석된 시점 대 피부 상태 점수로 나타낸 그래프를 포함하는 분석 결과 영역을 포함 할 수 있다."}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "본 발명의 다양한 실시 예에 따라, 사용자가 분석 항목(예, 요약, 주름, 트러블 혹은 색소 침착) 중 요약 을 선택한 경우, 얼굴 정보가 분석된 이미지 중 제1시점에서 분석된 이미지가 상기 이미지 영역을 통해 표시될 수 있다. 상기 이미지에 대해 얼굴 정보를 분석한 결과는 상기 분석 결과 영역 을 통해 그래프로 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자 입력이 상기 그래프의 특정 분석 시점에 해당하는 위치로 입력 되면, 상기 이미지 영역에서는 상기 사용자 입력이 입력된 시점에서 분석된 이미지가 표시될 수 있다. 예 컨대, 상기 이미지 영역에서는, 사용자 입력이 제2시점에 해당하는 위치로 입력되면 상기 제 2시점에서 얼굴 정보가 분석된 이미지가 표시되며, 제3시점에 해당하는 위치로 입력되면 상 기 제3시점에서 얼굴 정보가 분석된 이미지가 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 표시되는 이미지(4111, 4112 혹은 4113)는 사용자 입력이 입력된 시점 (예, 제1시점, 제2시점 혹은 제3시점)에서 얼굴 정보를 분석하기 위하여 사용된 것이며, 해 당 시점에서 각 분석 항목에 대해 분석한 결과가 상기 표시된 이미지에 중첩되어 표시됨으로써 사용자는 해당 분석 항목에 대한 피부 상태를 확인할 수 있다. 도 42는 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 일 예를 도시한 도 면이다. 도 42를 참조하면, 얼굴 정보를 분석하는 어플리케이션의 메뉴(예, 3601)에서 변화 관리(예, 3602)가 선택되면, 분석 결과 화면에서는 분석 항목(예, 주름)에 따른 분석 결과의 히스토리가 표시될 수 있다. 예컨 대, 상기 분석 결과 화면은 이미지 영역 혹은 분석 결과 영역을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 이미지 영역에 표시된 이미지는 제1시점에서 얼굴 정보가 분석된 이미지이며, 상기 이미지는 사용자 입력(예, 핀치 인/아웃)에 따라 크기가 변경(예, 확대) 될 수 있다. 예컨대, 사용자는 상기 크기가 변경된 이미지를 통해, 특정 시점에서 분석된 이미지에서의 피부 상 태를 자세하게 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 이미지 영역에서 사용자 입력에 따라 크기 혹은 위치가 변경된 이미지의 설정은 다른 시점에서도 유지될 수 있다. 예컨대, 4211 이미지에 사용자 입력이 입력됨에 따라 이미지 가 확대되면, 상기 확대의 설정이 제2시점에서 분석된 이미지에도 적용되어 표시될 수 있다. 상기 제2시점에서 분석된 이미지는 이전에 이미지가 확대된 영역과 대응하게 표시될 수 있다. 도 43은 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 일 예를 도시한 도 면이다. 도 43을 참조하면, 분석 결과 화면은 다양한 분석 항목 중 하나가 선택되면, 상기 선택된 분석 항목에 따 른 결과를 이미지 영역 혹은 분석 결과 영역을 통해 표시할 수 있다."}
{"patent_id": "10-2015-0092549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "본 발명의 다양한 실시 예에 따라, 사용자가 분석 항목(예, 요약, 주름, 트러블 혹은 색소 침착) 중 트러 블을 선택한 경우, 트러블에 대해 분석된 이미지가 상기 이미지 영역을 통해 표시될 수 있다. 상기 이미지에 대해 트러블을 분석한 결과는 상기 분석 결과 영역을 통해 그래프로 표 시될 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 표시되는 이미지는 사용자 입력이 입력된 시점에서 얼굴 정보를 분석하기 위하여 사용된 것이며, 분석된 트러블에 대응하는 도형이 상기 표시된 이미지에 중첩되어 표시됨으로 써 사용자는 트러블의 위치 혹은 상태를 확인할 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 사용자 입력(예, 탭 앤 드래그)를 입력하여, 이미지에서 확 인하고자 하는 영역을 상기 이미지 영역으로 이동시킬 수 있다. 예컨대, 상기 이동된 이미지 영역 에서 트러블을 분석한 결과가 상기 분석 결과 영역을 통해 그래프로 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 이미지 영역에 표시되는 이미지는 사용자 입력이 입력됨에 따라 표시되는 크기 혹은 위치의 설정이 유지될 수 있으며, 특정 시점이 선택되더라도 해당 시점에서 분석된 이미지 는 상기 변경된 크기 혹은 위치의 설정에 따라 표시될 수 있다. 도 44는 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 일 예를 도시한 도 면이다. 도 44를 참조하면, 분석 결과 화면은 다양한 분석 항목 중 하나(예, 트러블)가 선택되면, 상기 선 택된 분석 항목에 따른 얼굴 정보의 히스토리를 이미지 영역 혹은 분석 결과 영역을 통해 표시할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 이미지 영역은 특정 이미지에서 이동 혹은 확대될 수 있으며, 상 기 이동 혹은 확대된 위치는 다른 시점에서 분석된 이미지를 표시하는 경우에도 유지될 수 있다. 예컨대, 사용 자는 상기 이미지 영역을 사용자 입력(예, 터치 제스처)을 입력하여, 확인하고자 하는 영역으로 상기 이 미지 영역을 이동시키거나 이동된 영역을 확대시킬 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 분석 항목들 중 트러블을 선택하고 이미지 영역의 위 치를 왼쪽 볼 영역에 위치 혹은 확대시킬 수 있다. 여기서 상기 이미지 영역에서는 상기 트러블에 대해 분석된 이미지들 중 가장 먼저 분석된 시점에서의 이미지가 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 제1시점으로 사용자 입력을 입력함에 따라, 상기 이미 지 영역에서는 상기 제1시점에서 분석된 제1이미지가 표시될 수 있다. 예컨대, 사용자가 이 미지 영역을 이동 혹은 확대시킨 것과 대응하여, 상기 제1이미지 중 상기 대응되는 이동 혹은 확대 된 위치에서의 영역이 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자 입력이 제2시점으로 입력되는 경우, 상기 제2시점(442 2)에서 분석된 제2이미지가 상기 이미지 영역을 통해 표시될 수 있다. 예컨대, 사용자가 이미지 영 역을 이동 혹은 확대시킨 것과 대응하여, 상기 제2이미지 중 상기 대응되는 이동 혹은 확대된 위치 에서의 영역이 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자 입력이 제3시점으로 입력되는 경우, 상기 제3시점(442 3)에서 분석된 제3이미지가 상기 이미지 영역을 통해 표시될 수 있다. 예컨대, 사용자가 이미지 영 역을 이동 혹은 확대시킨 것과 대응하여, 상기 제3이미지 중 상기 대응되는 이동 혹은 확대된 위치 에서의 영역이 표시될 수 있다. 도 45는 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 일 예를 도시한 도 면이다. 도 45를 참조하면, 분석 결과 화면은 다양한 분석 항목 중 하나(예, 색소 침착)가 선택되면, 상기 선택된 분석 항목에 따른 얼굴 정보의 히스토리를 이미지 영역 혹은 분석 결과 영역을 통해 표시할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 이미지 영역은 특정 이미지에서 이동 혹은 확대될 수 있으며, 상 기 이동 혹은 확대된 위치는 다른 시점에서 분석된 이미지를 표시하는 경우에도 유지될 수 있다. 예컨대, 사용 자는 상기 이미지 영역을 사용자 입력(예, 터치 제스처)을 입력하여, 확인하고자 하는 영역으로 상기 이 미지 영역을 이동시키거나 이동된 영역을 확대시킬 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 분석 항목들 중 색소 침착을 선택하고 이미지 영역의 위치를 왼쪽 볼 영역에 위치 혹은 확대시킬 수 있다. 여기서 상기 이미지 영역에서는 상기 색소 침착 에 대해 분석된 이미지들 중 가장 먼저 분석된 시점에서의 이미지가 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 제1시점으로 사용자 입력을 입력함에 따라, 상기 이미 지 영역에서는 상기 제1시점에서 분석된 제1이미지가 표시될 수 있다. 예컨대, 사용자가 이 미지 영역을 이동 혹은 확대시킨 것과 대응하여, 상기 제1이미지 중 상기 대응되는 이동 혹은 확대 된 위치에서의 영역이 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자 입력이 제2시점으로 입력되는 경우, 상기 제2시점(452 2)에서 분석된 제2이미지가 상기 이미지 영역을 통해 표시될 수 있다. 예컨대, 사용자가 이미지 영 역을 이동 혹은 확대시킨 것과 대응하여, 상기 제2이미지 중 상기 대응되는 이동 혹은 확대된 위치 에서의 영역이 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자 입력이 제3시점으로 입력되는 경우, 상기 제3시점(452 3)에서 분석된 제3이미지가 상기 이미지 영역을 통해 표시될 수 있다. 예컨대, 사용자가 이미지 영 역을 이동 혹은 확대시킨 것과 대응하여, 상기 제3이미지 중 상기 대응되는 이동 혹은 확대된 위치 에서의 영역이 표시될 수 있다. 도 46은 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 일 예를 도시한 도면이다. 도 46을 참조하면, 전자 장치에서는 상기 전자 장치의 전면부에 위치한 카메라 모듈을 활성화시켜, 사용자의 얼 굴 이미지를 획득할 수 있다. 예컨대, 전자 장치는 미리 설정된 주기마다, 특정 각도로 사용자의 얼굴이 촬영되 는 경우, 상기 전자 장치가 특정 각도로 기울여진 경우 등 다양한 상황에서 이미지를 획득할 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자는 전자 장치를 이용하여 웹 브라우저 화면을 보고 있는 상황인 경우, 상기 전자 장치는 카메라 모듈을 백 그라운드로 실행시켜, 웹 브라우저 화면과는 상관 없이 사용자의 얼굴 이미 지를 촬영할 수 있다. 본 발명의 다양한 실시 예에 따라, 전자 장치는 촬영된 얼굴 이미지에서 적어도 하나의 기준점을 확인하고 상기 기준점을 이용하여 얼굴 영역을 확인하여 얼굴 정보를 분석할 수 있다. 도 47a 및 도 47b는 피부 분석의 결과를 보여주는 화면의 다양한 예들을 도시한 도면들이다. 본 발명의 다양한 실시 예에 따라, 분석 결과 화면은 디스플레이의 크기 혹은 회전 방향에 따라 다양한 레이아웃으로 구성될 수 있다. 도 47a 및 도 47b를 참조하면, 디스플레이가 가로로 위치하거나 전자 장치가 태블릿 PC인 경우, 상기 분석 결과 화면에서는 이미지 영역과 분석 항목 영역을 가로로 배치될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자가 분석 항목 영역에서 색소 침착(pigmentation)을 선택 한 경우, 적어도 하나의 얼굴 영역에서 색소 침착에 대해 분석한 결과가 이미지 영역 혹은 분석 결과 영 역을 통해 표시될 수 있다. 상기 이미지 영역에서는 사용자 입력이 특정 얼굴 영역(예, 볼 영역)으로 입력됨에 따라, 상기 사 용자 입력이 입력된 얼굴 영역에 대한 분석 결과가 확대되어 별도의 창을 통해 표시될 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 분석 항목 영역에서 특정 분석 항목이 선택됨에 따라, 얼굴 정보 에 대한 분석 결과는 분석 결과 영역을 통해 표시될 수 있다. 예컨대, 분석 결과 영역에서는 선택 된 색소 침착에 대한 분석 결과를 이모티콘, 각 항목 별 점수를 나타낸 그래프 혹은 이전 대비 색소 침착 의 향상도가 포함될 수 있다. 본 발명의 다양한 실시 예에 따라, 사용자가 분석 항목 영역에서 종합(total)을 선택한 경우, 적어 도 하나의 얼굴 영역에서 다양한 분석 항목에 대해 분석한 결과가 이미지 영역 혹은 분석 결과 영역 을 통해 표시될 수 있다. 상기 이미지 영역에서는 다양한 분석 항목에 따라 분석된 적어도 하나의 얼굴 영역이 표시되고, 각 얼굴 영역의 색에 대응하는 피부 상태를 나타낸 범례가 포함될 수 있다. 예컨대, 사용자는 각 얼굴 영역 의 색을 확인하여 해당 부분의 피부 상태를 판단할 수 있다. 본 발명의 다양한 실시 예에 따라, 분석 결과 영역에서는 다양한 분석 항목(예, 모공, 주름, 색소 침착 혹은 트러블)에 대한 분석 결과를 이전 분석 결과와 대비하여 점수를 나타낸 그래프가 포함될 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시 예들은 본 발명의 실시 예에 따른 발명의 기술 내용을 쉽게 설명하고 본 발명의 실시 예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시 예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시 예의 범위는 여기에 개시된 실시 예들 이외에도 본 발명의 다양한 실시 예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시 예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2015-0092549", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시 예에 따른, 전자 장치 구성의 일 예를 도시한 블록도이다. 도 2 내지 도 4는 본 발명의 다양한 실시 예에 따라, 전자 장치에서 피부 정보를 분석하는 동작의 다양한 예들 을 도시한 흐름도들이다. 도 5a 내지 도 5h는 본 발명의 다양한 실시 예에 따라, 얼굴 영역의 다양한 예 및 상기 얼굴 영역이 부분 확대 혹은 세부 촬영되는 상황의 다양한 예들을 도시한 도면들이다. 도 6은 본 발명의 다양한 실시 예에 따라, 얼굴 분석 항목의 다양한 예를 도시한 도면이다. 도 7 내지 도 11은 본 발명의 다양한 실시 예에 따라, 얼굴 분석 항목을 분석하는 동작의 다양한 예들을 도시한 도면들이다. 도 12는 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 일 예를 도시한 도면이다. 도 13a 내지 도 13c는 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 다양한 예들을 도 시한 도면들이다. 도 14 내지 도 18은 본 발명의 다양한 실시 예에 따라, 피부 분석의 결과를 보여주는 화면의 다양한 예들을 도 시한 도면들이다. 도 19는 본 발명의 다양한 실시 예에 따른 네트워크 환경의 일 예를 도시한 도면이다. 도 20a 내지 도 20c는 본 발명의 다양한 실시 예에 따라, 전자 장치에서 얼굴 분석하는 상황의 다양한 예들을 도시한 도면들이다. 도 21은 본 발명의 다양한 실시 예에 따라, 전자 장치에서 피부 정보를 분석하는 동작의 일 예를 도시한 흐름도 이다. 도 22a 및 도 22b는 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 다양한 예들을 도 시한 도면들이다. 도 23a 및 도 23b는 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 다양한 예들을 도 시한 도면들이다. 도 24는 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 일 예를 도시한 도면이다. 도 25는 본 발명의 다양한 실시 예에 따른 전자 장치 구성의 일 예를 도시한 블록도이다. 도 26은 본 발명의 다양한 실시 예에 따라, 저장된 이미지를 기반으로 얼굴 정보를 분석하는 어플리케이션 화면 의 일 예를 도시한 도면이다. 도 27 내지 도 35는 본 발명의 다양한 실시 예에 따른 얼굴 분석의 결과를 보여주는 화면의 다양한 예를 도시한 도면들이다. 도 36은 본 발명의 다양한 실시 예에 따라, 저장된 이미지를 기반으로 분석한 얼굴 정보의 히스토리를 보여주는 어플리케이션 화면의 일 예를 도시한 도면이다. 도 37은 내지 도 45는 본 발명의 다양한 실시 예에 따라, 분석된 얼굴 정보의 히스토리를 보여주는 화면의 다양 한 예를 도시한 도면들이다. 도 46은 본 발명의 다양한 실시 예에 따라, 얼굴 분석을 위하여 촬영하는 동작의 일 예를 도시한 도면이다. 도 47a 및 도 47b는 피부 분석의 결과를 보여주는 화면의 다양한 예들을 도시한 도면들이다."}
