{"patent_id": "10-2022-0122488", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0043418", "출원번호": "10-2022-0122488", "발명의 명칭": "액정 기반 투과형 재구성 가능한 지능형 표면", "출원인": "삼성전자주식회사", "발명자": "오준화"}}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 액정 기반 투과형 재구성 가능한 지능형 표면(reconfigurable intelligent surface :RIS) 장치에 있어서,제어 전압 인가 선로들;상기 제어 전압 인가 선로들을 통해 제어 전압이 인가되는 다수의 액정 기반 투과형 RIS 단위 셀들; 및상기 제어 전압 인가 선로들을 통해 상기 제어 전압을 상기 다수의 액정 기반 투과형 RIS 단위 셀들로 인가하여상기 다수의 액정 기반 투과형 RIS 단위 셀들 내 공진기들이 공진 주파수에서 동작하도록 제어하는 RIS 제어기를 포함하며,상기 다수의 액정 기반 투과형 RIS 단위 셀들의 각각은 제1 공진기로 동작하는 제1 금속 패턴과 제2 공진기로동작하는 제2 금속 패턴을 포함하며, 상기 제1 금속 패턴과 상기 제2 금속 패턴의 적어도 일부는 물리적으로 이격된 것인 액정 기반 투과형 RIS 장치."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 다수의 액정 기반 투과형 RIS 단위 셀들의 각각은 액정 층을 포함하며,상기 액정 층의 두께는, 상기 액정 층의 유효 유전율과 상기 제어 전압을 근거로 임계 두께 이하로 제한되며, 상기 제1 금속 패턴과 상기 제2 금속 패턴의 이격 방향과 이격 거리 중 적어도 하나는 상기 제1 금속 패턴과 상기 제2 금속 패턴에 의한 상호 인덕턴스를 감소시키도록 결정되는 것인 액정 기반 투과형 RIS 장치."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,각 액정 기반 투과형 RIS 단위 셀에서 상기 제1 금속 패턴과 상기 제2 금속 패턴의 전체가 이격되는 액정 기반투과형 RIS 장치."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,각 액정 기반 투과형 RIS 단위 셀에서 상기 제1 금속 패턴과 상기 제2 금속 패턴에서 각각 주 전류 원을 형성하는 막대 구조들이 이격되는 액정 기반 투과형 RIS 장치."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 제1 금속 패턴과 상기 제2 금속 패턴의 이격 거리는 상기 제1 금속 패턴과 상기 제2 금속 패턴의 끝(edge)에 위치하는 금속 선로의 두께를 근거로 결정되는 액정 기반 투과형 RIS 장치.공개특허 10-2024-0043418-3-청구항 6 제 1 항에 있어서,상기 다수의 액정 기반 투과형 RIS 단위 셀들의 각각은,금속 배선인 비아(Via)가 형성된 제1 기판;상기 제1 기판의 하면에 배치되며 상기 비아를 통해 상기 제어 전압이 인가되는 제1 전극; 상기 제2 기판의 상면에 배치된 제2 전극; 및 상기 제1 전극과 상기 제2 전극 사이에 배치된 액정 층을 포함하며,상기 제1 전극과 상기 제2 전극에는 각각 상기 제1 공진기로 동작하는 상기 제1 금속 패턴과 상기 제2 공진기로동작하는 상기 제2 금속 패턴이 형성되어 상기 공진 주파수에서 공진을 발생시키는 액정 기반 투과형 RIS 장치."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 제1 금속 패턴과 상기 제2 금속 패턴 간의 이격 거리는 상기 제1 기판과 상기 제2 기판의 유전율과 반비례관계인 액정 기반 투과형 RIS 장치."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 제1 금속 패턴과 상기 제2 금속 패턴 간의 이격 거리는 상기 공진 주파수와 반비례 관계인 액정 기반 투과형 RIS 장치."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "액정 기반 투과형 재구성 가능한 지능형 표면(reconfigurable intelligent surface : RIS) 단위 셀에 있어서,제1 기판;상기 제1 기판의 하면에 배치되고 상기 제1 기판을 통해 제어 전압이 인가되는 제1 공진기로 동작하는 제1 금속패턴이 형성된 제1 전극;상기 제2 기판의 상면에 배치되며 제2 공진기로 동작하는 제2 금속 패턴이 형성된 제2 전극; 및 상기 제1 전극과 상기 제2 전극 사이에 배치된 액정 층을 포함하며,상기 제1 금속 패턴과 상기 제2 금속 패턴의 적어도 일부는 물리적으로 이격되며, 상기 제1 금속 패턴과 상기제2 금속 패턴은 공진 주파수에서 공진을 발생시키는 액정 기반 투과형 RIS 단위 셀."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 액정 층의 두께는, 상기 액정 층의 유효 유전율과 상기 제어 전압을 근거로 임계 두께 이하로 제한되며, 상기 제1 금속 패턴과 상기 제2 금속 패턴의 이격 방향과 이격 거리 중 적어도 하나는 상기 제1 금속 패턴과 상기 제2 금속 패턴에 의한 상호 인덕턴스를 감소시키도록 결정되는 것인 액정 기반 투과형 RIS 단위 셀.공개특허 10-2024-0043418-4-청구항 11 제 9 항에 있어서,상기 제1 금속 패턴과 상기 제2 금속 패턴의 전체가 이격되는 액정 기반 투과형 RIS 단위 셀."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 9 항에 있어서,상기 제1 금속 패턴과 상기 제2 금속 패턴에서 각각 주 전류 원을 형성하는 막대 구조들이 이격되는 액정 기반투과형 RIS 단위 셀."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9 항에 있어서,상기 제1 금속 패턴과 상기 제2 금속 패턴의 이격 거리는 상기 제1 금속 패턴과 상기 제2 금속 패턴의 끝(edge)에 위치하는 금속 선로의 두께를 근거로 결정되는 액정 기반 투과형 RIS 단위 셀."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 9 항에 있어서,상기 제1 금속 패턴과 상기 제2 금속 패턴 간의 이격 거리는 상기 제1 기판과 상기 제2 기판의 유전율과 반비례관계인 액정 기반 투과형 RIS 단위 셀."}
{"patent_id": "10-2022-0122488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 9 항에 있어서,상기 제1 금속 패턴과 상기 제2 금속 패턴 간의 이격 거리는 상기 공진 주파수와 반비례 관계인 액정 기반 투과형 RIS 단위 셀."}
{"patent_id": "10-2022-0122488", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 액정(LC) 기반 투과형 RIS 장치와 이를 위한 액정 기반 RIS 단위 셀 구조에 대 한 것으로서, 본 개시의 실시 예에 따른 무선 통신 시스템에서 액정 기반 투과형 재구성 가능한 지능형 표면 (RIS) 장치는, 제어 전압 인가 선로들과, 상기 제어 전압 인가 선로들을 통해 제어 전압이 인가되는 다수의 액정 기반 투과형 RIS 단위 셀들과, 상기 제어 전압 인가 선로들을 통해 상기 제어 전압을 상기 다수의 액정 기반 투 과형 RIS 단위 셀들로 인가하여 상기 다수의 액정 기반 투과형 RIS 단위 셀들 내 공진기들이 공진 주파수에서 동 작하도록 제어하는 RIS 제어기를 포함하며, 상기 다수의 액정 기반 투과형 RIS 단위 셀들의 각각은 제1 공진기로 동작하는 제1 금속 패턴과 제2 공진기로 동작하는 제2 금속 패턴을 포함하며, 상기 제1 금속 패턴과 상기 제2 금 속 패턴의 적어도 일부는 물리적으로 이격된다."}
{"patent_id": "10-2022-0122488", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 안테나 기술에 대한 것으로서, 건물, 차량 등의 유리 등에 부착/설치하여 통신 품질을 향상시킬 수 있는 액정 기반 투과형 재구성 가능한 지능형 표면(RIS) 장치에 대한 것이다."}
{"patent_id": "10-2022-0122488", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(MassiveMIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 동작 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 동작에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. 또한 차세대 통신 기술 중 하나로 RIS 기술이 연구되고 있다. RIS는 RIS에 포함된 각 RE(reflecting element) 들의 위상 및/또는 진폭의 조합으로 반사 패턴을 형성하고 반사 패턴에 따라 RIS에 입사되는 기지국의 송신 빔 을 원하는 방향으로 반사시킬 수 있다. 상기 RIS를 이용하면, 기지국으로부터 송신 빔이 도달할 수 없는 음영 지역에 위치한 단말에게 RIS에 입사된 송신 빔을 반사시켜 음영 지역 내 단말에게 전달할 수 있다. 상기 RIS 기술의 다른 예로 투과형 RIS가 있다. 투과형 RIS는 건물, 차량 등의 유리벽, 유리창 등에 설치되어/ 부착되어 입사된 기지국의 송신 빔의 이득을 향상시키거나 혹은 입사된 송신 빔의 방향을 조향하여 송신 빔의 신호 감쇄 혹은 커버리지를 개선할 수 있다. 도 1은 무선 통신 시스템에서 투과형 RIS 장치가 사용되는 일 예를 설명하기 위한 도면이다. 도 1의 (a)는 RIS 장치가 설치되지 않은 경우 기지국으로부터 방사된 송신 빔(혹은 source 빔)이 전파되는 일 예를 나타낸 것으로서, 송신 빔은 건물 등의 실내에 위치한 유리벽, 유리창 등을 투과하면서 신호 세기 가 감쇄되거나 커버리지에 제한이 발생될 수 있다. 도 1의 (b)는 건물 등의 실내에 위치한 유리벽, 유리창 등에투과형 RIS 장치가 설치된 경우 기지국으로부터 방사된 송신 빔이 전파되는 일 예를 나타낸 것이다. 도 1 의 (b)를 참조하면, 송신 빔의 전파는 음영 지역 혹은 건물, 차량 등의 유리벽, 유리창 등에 부착된/설치 된 투과형 RIS 장치에서 투과(혹은 반사)되고, RIS 장치는 입사된 송신 빔에 대해 빔 이득 향상 과 빔 조향 조절을 수행할 수 있다. 투과형 RIS 장치의 경우 실외에서 실내로(outdoor-to-indoor : O2I) 환경에서 실내 통신 성능 및 커버리지 개선의 목적으로 활용될 수 있다. 투과형 RIS 장치을 이용하면 송신 빔의 전파가 건물 등의 외벽 혹은 유리벽, 유리창 등을 투과할 때 송신 빔의 이득 향상과 빔 조 향 조절을 수행하고, 그 결과 투과된 빔은 신호 감쇄가 최소화되거나 커버리지 제한이 개선될 수 있다."}
{"patent_id": "10-2022-0122488", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 액정(liquid crystal : LC) 기반 투과형 RIS 장치와 이를 위한 액정 기반 RIS 단위 셀 구조를 제공한다. 본 개시는 LC 층의 두께를 증가시키지 않고도 성능을 향상시킬 수 있는 LC 기반 RIS 단위 셀 구조를 제안한다."}
{"patent_id": "10-2022-0122488", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시 예에 따른 무선 통신 시스템에서 액정 기반 투과형 재구성 가능한 지능형 표면(RIS) 장치는, 제 어 전압 인가 선로들과, 상기 제어 전압 인가 선로들을 통해 제어 전압이 인가되는 다수의 액정 기반 투과형 RIS 단위 셀들과, 상기 제어 전압 인가 선로들을 통해 상기 제어 전압을 상기 다수의 액정 기반 투과형 RIS 단 위 셀들로 인가하여 상기 다수의 액정 기반 투과형 RIS 단위 셀들 내 공진기들이 공진 주파수에서 동작하도록 제어하는 RIS 제어기를 포함하며, 상기 다수의 액정 기반 투과형 RIS 단위 셀들의 각각은 제1 공진기로 동작하 는 제1 금속 패턴과 제2 공진기로 동작하는 제2 금속 패턴을 포함하며, 상기 제1 금속 패턴과 상기 제2 금속 패 턴의 적어도 일부는 물리적으로 이격된다. 또한 본 개시의 실시 예에 따른 액정 기반 투과형 재구성 가능한 지능형 표면(RIS) 단위 셀은, 제1 기판과, 상 기 제1 기판의 하면에 배치되고 상기 제1 기판을 통해 제어 전압이 인가되는 제1 공진기로 동작하는 제1 금속 패턴이 형성된 제1 전극과, 상기 제2 기판의 상면에 배치되며 제2 공진기로 동작하는 제2 금속 패턴이 형성된 제2 전극과, 상기 제1 전극과 상기 제2 전극 사이에 배치된 액정 층을 포함하며, 상기 제1 금속 패턴과 상기 제 2 금속 패턴의 적어도 일부는 물리적으로 이격되며, 상기 제1 금속 패턴과 상기 제2 금속 패턴은 공진 주파수에 서 공진을 발생시킨다."}
{"patent_id": "10-2022-0122488", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 개시의 동작 원리를 상세히 설명한다. 하기에서 본 개시를 설명하기에 있어 관 련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어 들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반 에 걸친 내용을 토대로 내려져야 할 것이다. 본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시의 개시가 완전하도록 하고, 본 개시가 속하"}
{"patent_id": "10-2022-0122488", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시 는 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이때, 본 실시예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들 을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~ 부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들 은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또 한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 본 개시에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\" 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또 는 \"둘째\"와 같은 용어들은 단순히 해당 구성 요소를 다른 해당 구성 요소와 구분하기 위해 사용될 수 있으며, 해당 구성 요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 이하 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 망 객체들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시가 후술되는 용어들에 한정되는 것은 아니며, 동등한 기 술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 본 개시에서 기지국(base station : BS)은 단말의 자원 할당을 수행하며 단말과 무선 네트워크를 통해 통신을 수행할 수 있는 네트워크 엔터티로서, eNode B, Node B, gNB, RAN(Radio Access Network), AN(Access Network), RAN node, IAB(Integrated Access/Backhaul) node, 무선 접속 유닛, 기지국 제어기, 네트워크 상의 노드, 또는 TRP(transmission reception point) 중 적어도 하나일 수 있다. 단말(user equipment : UE)은 terminal, MS(Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기능을 수행할 수 있는 멀티미디어시스 템 중 적어도 하나일 수 있다. 이하 설명의 편의를 위하여, 본 개시는 현재 존재하는 통신표준 가운데 3GPP (The 3rd Generation Partnership Project) 단체에서 정의하는 가장 최신의 표준인 5GS 및 NR 규격에서 정의하고 있는 용어 및 명칭들을 사용한다. 하지만, 본 개시가 상기 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격에 따르는 무선통신 망에도 동일하게 적용될 수 있다. 특히 본 개시는 5G 시스템은 물론 5G 시스템 이상의 시스템(예를 들어 6G 시 스템)에도 적용될 수 있다. RIS 장치는 다수의 RIS 단위 셀들을 포함하여 구성될 수 있으며, RIS 단위 셀은 위상 분포 변경을 위하여 다양 한 능동 소자 및/또는 가변 물질을 이용하여 구현될 수 있다. 다양한 능동 소자의 예로는 PIN diode, Varactor, MEMS(Micro Electro Mechanical Systems) switch 등을 이용할 수 있다. 또한 투과형 RIS 단위 셀은 액정(LC)을 포함할 수 있으며, 액정을 이용하는 투과형 RIS 단위 셀(이하 LC 기반 RIS 단위 셀) 내 액정(LC)으로 인가되는 인가 전압에 따라 유전율을 제어함으로써 LC 기반 RIS 단위 셀의 특성을 변경할 수 있으며, 다른 능동 소자에 비하여 액정(LC)은 넓은 주파수 대역에서 활용될 수 있다(예를 들어 GHz 내지 THz 대역). 도 2는 LC 기반 RIS 단위 셀에서 인가 전압에 따라 재구성되는 LC 층의 분자 배열을 설명하기 위한 도면이다. LC 기반 RIS 단위 셀을 설계하기 위해서는 인가 전압에 따라 액정(LC) 층의 유전율이 가변되는 특성이 활용된다. 도 2를 참조하면, LC 층은 상단 전극과 하단 전극 사이에 배치된다. 도 2에서 타원 형태로 도시된 영역은 LC 층의 분자 배열을 나타낸 것이다. 각각 금속 패턴이 형성된 상단 전극(20 2)과 하단 전극에 전압을 인가하게 되면, 상단 전극과 하단 전극 사이에 전기장(electric-field : E-field)이 형성되어 E-field의 세기에 따라 LC 층의 분자 배열이 재구성될 수 있다. 도 2의 (a), (b), (c)에서 순차로 예시된 것처럼, E-field가 커질수록 분극 현상에 의해 LC 층의 분 자가 E-field의 방향과 평행하도록 재배열된다. 이러한 LC 층의 분자 배열은 \"Wittek, Michael, Carsten Fritzsch, and Dieter Schroth. \"Employing Liquid CrystalBased Smart Antennas for Satellite and Terrestrial Communication.\" Information Display 37.1 : 17-22.\"의 문헌을 참조할 수 있다. 도 3은 LC 기반 RIS 단위 셀에서 인가 전압에 따라 재구성되는 LC 층의 유전율 변화를 설명하기 위한 도면이다. LC 기반 RIS 단위 셀에서는 인가 전압에 따라 유효(effective) 유전율을 가변적으로 제어하는 것이 가능하다. 도 3의 예와 같이, 상기 인가 전압이 Threshold 값 이하일 때는 참조 번호 302와 같이, 일정한 유효 유전 율 값을 유지하다가, Threshold 이상의(>Vth) 전압이 인가되면 참조 번호 303과 같이, 유효 유전율이 변하기 시 작한다. 따라서 LC 기반 RIS 단위 셀에서 인가 전압이 커지면 유효 유전율 값도 점차 커진다. 이러한 LC 층의 유전율 변화는 J. \"Kim and J. Oh, \"Liquid-Crystal-Embedded Aperture-Coupled Microstrip Antenna for 5G Applications,\" in IEEE Antennas and Wireless Propagation Letters, vol. 19, no. 11, pp. 1958-1962, Nov. 2020, doi: 10.1109/LAWP.2020.3014715.\"의 문헌을 참조할 수 있다. 상기한 도 2 및 도 3의 예들을 참조하면, LC 기반 RIS 단위 셀에서 LC 층의 두께에 따라 인가 전압과 유효 유전율 변화 관계가 달라지게 되는데, LC 층이 두꺼워 질수록 LC 기반 RIS 단위 셀의 상단 전극과 하 단 전극 간의 거리가 멀어지게 된다. 따라서 LC 층의 두께에 비례하여 LC 층의 분자 배열을 재 구성하기 위해 더 강한 E-field가 필요하며 인가 전압의 Threshold 값인 Vth도 커지게 된다. 또한 LC 층의 유효 유전율의 가변 범위를 원하는 범위에서 얻기 위한 인가 전압의 제어 범위도 더 커지게 된다. 결과적으로 LC 기반 RIS 단위 셀의 인가 전압의 최대 값인 Vmax도 커지게 되는데 일 예로 수백 볼트(V)의 고전 압을 사용하는 경우 안정성에 큰 문제가 생기게 된다. 따라서 LC 기반 RIS 단위 셀이 실질적으로 제어 가능한 전압 범위 내에서 동작하기 위해서는 LC 층의 두께가 제한되어야 한다. 도 4는 LC 기반 RIS 단위 셀의 일 구성 예를 나타낸 도면이다. 도 4의 예에서 LC 기반 RIS 단위 셀은 제1 기판의 하면에 배치된 제1 전극와, 제2 기판의 상면에 배치된 제2 전극와, 제1 전극과 제2 전극 사이에 배치된 LC 층을 포함한다. 제1 전 극은 LC 층의 상단 전극으로 이용되고, 제2 전극은 LC 층의 하단 전극으로 이용된다. 제1 전극과 제2 전극에는 각각 제1 금속 패턴과 제2 금속 패턴이 형성되어 공진 주파수에서 공진 (resonance)을 발생시킬 수 있다. 제1 전극에 형성된/포함된 제1 금속 패턴은 제1 공진기로 동작하고, 제2 전극에 형성된/포함된 제2 금속 패턴은 제2 공진기로 공작한다. 여기서 상기 제1 금속 패턴과 제2 금속 패 턴은 동일한 패턴을 가질 수 있다. 이러한 구조를 갖는 LC 기반 RIS 단위 셀이 투과형 RIS 장치에 사용되 면, 투과형 RIS 장치는 공진 주파수에서 투과 특성과 위상 가변 특성을 얻을 수 있다. LC 층의 원하는 유효 유전율의 가변 범위를 2.5 내지 3.5로 가정하고, LC 기반 RIS 단위 셀에서 제어 가능한 인가 전압의 전압 범위(0 내지 20V)를 고려하면, LC 층의 두께는 200 ㎛ 이하로 제한될 수 있 다. 그러나 전술한 것처럼 LC 층의 두께가 두꺼워질수록 원하는 유효 유전율의 가변 범위를 얻지 못 하거나 제어 가능한 인가 전압 범위를 벗어나게 된다. 도 5는 도 4의 구조를 갖는 LC 기반 RIS 단위 셀에서 제1 공진기와 제2 공진기의 표면 전류 분포와 자기장 (magnetic field : H-field)의 일 예를 나타낸 것이다. 도 5를 참조하면, 제1 전극과 제2 전극에 각각 형성된/포함된 제1 공진기와 제2 공진기의 표면 전류 분포를 도시하며, 제1 공진기와 제2 공진기에서 전류로 인해 강한 H-field가 발생하는 것을 확인할 수 있다. 상기 제1 공진기의 제1 금속 패턴에서 발생되는 H-field와 상기 제2 공진기의 제2 금속 패턴에서 발생 되는 H-field가 중첩되어 상호 인덕턴스(mutual inductance)가 발생될 수 있다. 도 6은 도 4의 구조를 갖는 LC 기반 RIS 단위 셀에서 제1 공진기와 제2 공진기의 등가 회로(equivalent circuit)와 공진 주파수를 설명하기 위한 도면이다. 도 6에서 참조 부호 L, C는 각각 제1 및 제2 공진기의 제1 및 제2 금속 패턴에 의한 인덕턴스(inductance)와 커 패시턴스(capacitance)를 나타낸 것이고, 참조 부호 Lm은 상기 제1 및 제2 금속 패턴에 의한 상호 인덕턴스 (mutual inductance)를 나타낸 것이다. I1, I2는 전류, V1, V2는 각각 T1-T'1 사이의 전압과 T2-T'2 사이의 전압 을 나타낸 것이다. 도 6의 등가 회로에서 상호 인덕턴스 Lm이 커질수록 공진 주파수인 fe와 fm 값의 차이는 점차 커지게 된다. 도 7은 도 4의 구조를 갖는 LC 기반 RIS 단위 셀에서 상호 인덕턴스로 인한 성능 열화를 설명하기 위한 도면이 다. 도 7을 참조하면, 도 4의 구조를 갖는 LC 기반 RIS 단위 셀에서 제1 및 제2 공진기의 제1 및 제2 금속 패턴에서 발생되는 상호 인덕턴스(Lm)로 인해, 도 7의 (a)와 같이 통과 대역(passband)의 손실이 증가하고, 도 7의 (b)와 같이 위상 가변 범위가 감소하는 성능 열화가 발생된다. 이는 LC 기반 RIS 단위 셀의 성능을 저하시 키게 된다. 도 8은 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀의 일 구성 예를 나타낸 도면이다. 도 8의 예에서 LC 기반 RIS 단위 셀은 제1 기판의 하면에 배치된 제1 전극와, 제2 기판의 상면에 배치된 제2 전극와, 제1 전극과 제2 전극 사이에 배치된 LC 층을 포함한다. 제1 전 극은 LC 층의 상단 전극으로 이용되고, 제2 전극은 LC 층의 하단 전극으로 이용된다. 제1 기판과 제2 기판는 유전체를 포함할 수 있다. 제1 전극과 제2 전극에는 각각 제1 금속 패 턴과 제2 금속 패턴이 형성되어 공진 주파수에서 공진을 발생시킬 수 있다. 제1 전극에 형성된/포함된 제1 금속 패턴은 제1 공진기로 동작하고, 제2 전극에 형성된/포함된 제2 금속 패턴은 제2 공진기로 공작한다. 여기서 제1 금속 패턴과 제2 금속 패턴은 본 개시의 실시 예에 따라 중심부로부터 이격된 패턴을 갖는다. 상기 제1 금속 패턴과 제2 금속 패턴이 중심부로부터 이격되는 방향, 이격되는 거리 중 적어도 하나를 조정하여 LC 기반 RIS 단위 셀의 passband 손실, passband 내의 위상 가변 범위 및 위상 선형성을 개선할 수 있다. 또한 상 기 제1 금속 패턴과 제2 금속 패턴은 동일한 패턴을 가지거나 혹은 서로 다른 패턴을 가질 수도 있다. 또한 다 른 실시 예로 LC 기반 RIS 단위 셀의 하지 않고, 상기 제1 금속 패턴과 제2 금속 패턴에서 각각 주 전류 원을 형성하는 막대 구조들만을 이격시켜 passband 손실, passband 내의 위상 가변 범위 및 위상 선형성을 개선할 수 도 있다.상기한 구조를 갖는 LC 기반 RIS 단위 셀이 투과형 RIS 장치에 사용되면, LC 층의 두께를 증가시키지 않고도 제1 및 제2 공진기의 제1 및 제2 금속 패턴에서 발생되는 상호 인덕턴스(Lm)(상호 커플링)을 감소시킬 수 있으며, 공진 주파수에서 보다 우수한 투과 특성과 위상 가변 특성을 얻을 수 있다. LC 기반 RIS 단위 셀 은 LC 층의 원하는 유효 유전율의 가변 범위를 2.5 내지 3.5로 가정하고, 제어 가능한 인가 전압의 전압 범위(0 내지 20V)을 가정하면, LC 층의 두께는 예컨대, 임계 두께인 200 ㎛ 이하로 제한될 수 있다. 본 개시의 실시 예에서 유효 유전율의 가변 범위, 인가 전압의 전압 범위 및 LC 층의 두께의 범위는 일 예를 든 것이고, 본 개시가 이러한 범위에 한정되는 것은 아니다. 도 8의 실시 예에서 LC 기반 RIS 단위 셀는 사각형의 형태로 예시되어 있으나, 이는 일 예를 나타낸 것이 고, LC 기반 RIS 단위 셀은 다각형, 원형 혹은 타원형 등 다양한 형태로 구현될 수 있다. 마찬가지로 공진 기로 동작하는 상기 제1 금속 패턴과 제2 금속 패턴 또한 주 전류 원을 형성하는 막대 구조를 포함하는 다양한 형태의 패턴으로 설계될 수 있다. 도 9는 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀에서 이격된 금속 패턴들에 의해 inductive coupling을 감소시키는 구조를 나타낸 도면이다. 도 9의 실시 예를 도 8을 참조하여 설명하기로 한다. 도 9의 (a)에서 제1 전극의 제1 금속 패턴은 제1 공진기로 동작하고, 도 9의 (b)에서 제2 전극 의 제2 금속 패턴은 제2 공진기로 동작한다. 도 5의 예에서 설명한 공진기의 표면 전류 분포를 참조하면, 공진기의 전류는 금속 패턴의 중심부의 막대 구조에서 가장 강하게 흐른다. 따라서 제1 공진기의 표면 전류는 제1 금속 패턴의 중심부의 막대 구조에서 가장 강하게 흐르고, 제1 공진기의 표면 전류는 제2 금속 패턴의 중심부의 막대 구조에서 가장 강하게 흐른다. 따라서 제1 공진기에서 H-field는 막대 구조 의 길이 방향(y-axis)에 수직한 방향(z-axis)으로 형성되며 인접한 제2 공진기의 막대 구조와 inductive coupling을 형성한다. 도 9의 실시 예는 LC 층의 두께는 유지한 채 제1 금속 패턴과 제2 금속 패턴의 막대 구조들(902, 904) 사이의 물리적 거리를 이격시켜 inductive coupling(예를 들어 상호 인덕턴스(Lm))을 감소시키는 구조를 제안한 것이다. 상기 제1 금속 패턴과 제2 금속 패턴이 이격되는 거리는 일 예로 제1 금속 패턴과 제2 금속 패턴에서 끝(edge)에 위치하는 금속 선로의 두께(d) 를 고려하여 결정될 수 있다. 도 10은 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀에서 이격된 금속 패턴들의 다양한 구조를 나타낸 도면 이다. 도 10의 실시 예를 도 8을 참조하여 설명하기로 한다. 도 10의 (a)는 안테나에서 수직 편파(polarization)(V-pol)의 방향을 나타낸 점선을 기준으로 제1 전극 의 제1 금속 패턴과 제2 전극의 제2 금속 패턴을 중심부로부터 물리적으로 이격시키는 구조의 일 예 를 나타낸 것이고, 도 10의 (b)는 안테나에서 수평 편파(H-pol)의 방향을 나타낸 점선을 기준으로 제1 전 극의 제1 금속 패턴과 제2 전극의 제2 금속 패턴을 중심부로부터 물리적으로 이격시키는 구조의 일 예를 나타낸 것이다. 도 10의 (a), (b)의 예에서 이격의 정도는 공진기의 동작 주파수에 따라 수십 ㎛ 내지 수 천 ㎛의 범위에서 상이할 수 있다. 또한 제1 전극의 제1 금속 패턴과 제2 전극의 제2 금속 패턴이 서 로 이격됨에 따라 이격되는 방향(1003a, 1003b, 1003c, 1003d)의 끝에 위치하는 금속 선로의 두께(d)가 PCB 최소 공정 요건에 위배될 수 있으므로 이격 정도의 최대값은 공정 가능 범위에 따라 결정될 수 있다. 도 10의 (a), (b)의 예에서 상호 인덕턴스(Lm)를 줄이기 위해 제1 및 제2 공진기로 동작하는 제1 및 제2 금속 패턴의 중심부로부터 이격 방향은 제1 및 제2 금속 패턴에서 표면 전류의 방향과 상관 관계가 있다. 상기 표면 전류의 세기와 방향은 안테나의 편파와 공진기의 구조에 따라 결정될 수 있으며, 도 10의 (a), (b)의 예와 같이 V-pol과 H-pol에 대해 제1 및 제2 공진기에서 표면 전류의 방향이 서로 멀어지는 형태로 제1 및 제2 금속 패턴 의 중심부를 이격시키면 상호 인덕턴스(Lm)(상호 커플링)을 줄일 수 있다. 도 11은 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀에서 상호 인덕턴스(Lm)(상호 커플링)를 감소시켜 개선 된 성능을 나타낸 도면이다. 도 7과 도 11의 시뮬레이션 결과는 LC 기반 RIS 단위 셀에서 LC 층의 두께가 동일 한 조건에서 나온 것이다. 도 11을 참조하면, 도 8의 구조를 갖는 LC 기반 RIS 단위 셀에서 제1 및 제2 공진기로 동작하는 제1 및 제2 금 속 패턴을 이격시켜 상호 인덕턴스(Lm)(상호 커플링)을 감소시킬 수 있으며, 도 11의 (a)와 같이 통과 대역 (passband)의 손실이 개선되고, 도 11의 (b)와 같이 위상 선형성이 개선되어, LC 기반 RIS 단위 셀 의 성능을 향상시키게 된다.상기한 본 개시의 실시 예들에 의하면, LC 기반 RIS 단위 셀에서 LC 층의 두께를 증가시키지 않고 제1 및 제2 금속 패턴에서 주 전류 원(main current source)들 간의 물리적 거리를 증가시켜 상호 인덕턴스(Lm)을 감소시킴 으로써 성능 저하를 유발하는 상호 커플링을 감소시킬 수 있다. 이로 인해 LC 기반 RIS 단위 셀에서 통과 대역 손실 및 통과 대역 내의 위상 가변 범위 및 위상 선형성을 개선할 수 있다. 도 12는 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀에서 주 전류 원을 형성하는 막대 구조들이 이격된 금속 패턴들의 구조를 나타낸 도면이다. 도 10의 실시 예를 도 8을 참조하여 설명하기로 한다. 도 12를 참조하면, 제1 전극과 제2 전극에는 각각 제1 금속 패턴과 제2 금속 패턴이 형성되어 공진 주파수에서 공진을 발생시킬 수 있다. 제1 전극에 형성된/포함된 제1 금속 패턴은 제1 공진기로 동작하고, 제2 전극에 형성된/포함된 제2 금속 패턴은 제2 공진기로 공작한다. 여기서 제1 금속 패턴과 제2 금속 패 턴은 공진기 패턴 전체를 이격시키는 것이 아닌 제1 금속 패턴과 제2 금속 패턴에서 각각 주 전류 원을 형성하 는 막대 구조들(1202, 1204)이 물리적으로 멀어지는 방향으로 이격된 구조를 갖는다. 막대 구조들(1202, 1204) 이 이격되는 정도에 따라 도 6에서 설명한 등가 회로의 L, C 파라미터가 변화되어 공진 주파수가 변화할 수 있 으나, 도 9의 구조와 비교하여 공진 주파수의 변화가 미미한 설계적 허용 범위 내에서 막대 구조들(1202, 120 4)의 이격만으로 LC 기반 RIS 단위 셀에서 실질적으로 동일한 성능 개선 효과를 제공할 수 있다. 도 13은 본 개시의 실시 예에 따라 도 12의 예가 적용된 LC 기반 RIS 단위 셀에서 상호 인덕턴스(Lm)를 제어하 여 통과 대역 특성이 개선되는 성능을 나타낸 도면이다. 도 13에서 참조 번호 1301은 개선된 통과 대역 특성을 나타낸 것으로서, 이와 같이 공진기 패턴 전체를 이격시 키는 것이 아닌 제1 금속 패턴과 제2 금속 패턴에서 각각 주 전류 원을 형성하는 막대 구조들(1202, 1204)을 이 격시켜 실질적으로 동일한 성능 개선 효과를 제공할 수 있다. 상기한 도 8의 LC 기반 RIS 단위 셀 구조에서 도 9의 실시 예 또는 도 12의 실시 예에 따라 공진기 패턴(즉 제1 및 제2 금속 패턴)이 이격되는 정도는 LC 기반 RIS 단위 셀의 상부 기판인 제1 기판과 하부 기판인 제2 기판의 물성 및 내부 LC 층의 물성에 따라 상이하다. 제1 기판과 제2 기판의 유전율이 상승하면 LC 기반 RIS 단위 셀 내부의 guided-wavelength가 감소하여 동일한 물리적 이격 거리에 대한 전기적 길이(electrical length)가 증가한다. 따라서 제1 기판의 유전율과 제1 전극에 형성된/포함된 제1 금속 패턴의 이격되는 정도(이격 거리)는 반비례한다. 동일한 원리로 제1 금속 패턴과 밀착된 LC 층의 유전율과 제1 금속 패턴의 이격되는 정도는 반비례한다. 제2 기판은 제2 전극에 형성된/포함된 제2 금속 패턴와 밀착하며, 제2 금속 패턴의 이격 되는 정도는 제2 기판의 유전율에 반비례한다. 마찬가지로 제2 금속 패턴은 LC 층과도 밀착되어 있으 므로 제2 금속 패턴의 이격 정도는 LC 층의 유전율과도 반비례한다. 즉 상기 제1 금속 패턴과 상기 제2 금 속 패턴 간의 이격 거리는 상기 제1 기판과 상기 제2 기판의 유전율과 반비례 관계를 갖는다. 상기 제1 금속 패턴과 제2 금속 패턴의 이격 정도는 공진 주파수에도 영향을 받는다. 상기 공진주파수가 증가할 수록 전기적 길이가 감소하여 LC 기반 RIS 단위 셀 및 상기 제1 금속 패턴과 제2 금속 패턴의 물리적 크기도 작 아지므로 상기 제1 금속 패턴과 제2 금속 패턴의 이격되는 정도는 작아진다. 따라서 상기 공진 주파수와 제1 금 속 패턴과 제2 금속 패턴의 이격 정도는 반비례한다. 도 14는 본 개시의 실시 예에 따라 다수의 LC 기반 RIS 단위 셀들을 포함하는 투과형 RIS 장치의 일 구성 예를 나타낸 도면이다. 도 14의 투과형 RIS 장치은 제어 전압 인가 선로들, 제1 기판 층, 제1 전극 층, 액정 (LC) 층, 제2 전극 층, 제2 기판 층 및 RIS 제어기를 포함한다. 상기 액정(LC) 층 과 상기 제2 전극 층의 사이에는 상기 액정 층의 고정을 위한 제3 기판 층(1404a)이 배치될 수 있다. 상기 제1 기판 층, 제2 기판 층 및 제3 기판 층(1404a)는 유전체를 포함할 수 있다. 제3 기판 층(1404a)은 선택적으로 포함될 수 있다. 상기 RIS 제어기는 제어 전압 인가 선로들을 통해 제1 전극 층으로 액정(LC) 층을 제 어하기 위한 제어 전압을 인가한다. 제2 전극 층은 전기적으로 접지되어 있다. 투과형 RIS 장치는 다수의 LC 기반 RIS 단위 셀들을 포함하며, 다수의 LC 기반 RIS 단위 셀들은 배열(array) 형태로 배 치될 수 있다. 예를 들어 도 14에 도시된 제1 전극 층과 제2 전극 층 내 다수의 사각형들은 각각 LC 기반 RIS 단위 셀의 구조에서 제1 공진기와 제2 공진기로 동작하는 제1 금속 패턴과 제2 금속 패턴이형성된 제1 전극과 제2 전극에 해당되며, 다수의 제1 및 제2 금속 패턴들이 제1 및 제2 전극 층들 (1403, 1405)에 배열 형태로 배치될 수 있다. 도 8의 LC 기반 RIS 단위 셀에서 제1 기판과 제2 기판 은 각각 제1 기판 층과 제2 전극 층의 일부에 해당된다. 상기 제어 전압 인가 선로들의 각 선로는 전기적으로 도통되지 않고 독립적으로 위치할 수 있으며, 제1 기판 층에 형성된 금속 배선인 비아(Via)들을 통해 각 LC 기반 RIS 단위 셀에 전기적으로 연결된다. 제1 기판 층의 상단에는 제어 전압 인가 선로들이 배치되고 제1 기판 층의 하단에는 제1 전 극 층이 배치되어 제어 전압 인가 선로들과, 제1 전극 층에 배열 형태로 형성된 다수의 제1 금속 패턴들이 고정되도록 지지하며, 액정(LC) 층 내 액정이 유출되지 않도록 한다. 제2 기판 층의 상단에는 제2 전극 층이 배치되고 제2 전극 층에 배열 형태로 형성된 다수의 제2 금속 패턴들이 고 정되도록 지지하며, 액정(LC) 층 내 액정이 유출되지 않도록 한다. 상기 다수의 제2 금속 패턴들은 전기 적으로 도통되어 있으며, 상기 제어 전압에 대한 직류 접지(DC GND) 전위를 갖는다. 상기 제1 전극 층과 상기 제2 전극 층 사이에는 액정(LC) 층이 배치될 만큼의 공간부가 형성된다. 상술한 본 개시의 구체적인 실시 예들에서, 발명에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라하더라도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2022-0122488", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 무선 통신 시스템에서 투과형 RIS 장치가 사용되는 일 예를 설명하기 위한 도면, 도 2는 LC 기반 RIS 단위 셀에서 인가 전압에 따라 재구성되는 LC 층의 분자 배열을 설명하기 위한 도면, 도 3은 LC 기반 RIS 단위 셀에서 인가 전압에 따라 재구성되는 LC 층의 유전율 변화를 설명하기 위한 도면, 도 4는 LC 기반 RIS 단위 셀의 일 구성 예를 나타낸 도면, 도 5는 도 4의 구조를 갖는 LC 기반 RIS 단위 셀에서 제1 공진기와 제2 공진기의 표면 전류 분포와 자기장(H- field)의 일 예를 나타낸 도면, 도 6은 도 4의 구조를 갖는 LC 기반 RIS 단위 셀에서 제1 공진기와 제2 공진기의 등가 회로와 공진 주파수를 설 명하기 위한 도면, 도 7은 도 4의 구조를 갖는 LC 기반 RIS 단위 셀에서 상호 인덕턴스로 인한 성능 열화를 설명하기 위한 도면, 도 8은 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀의 일 구성 예를 나타낸 도면, 도 9는 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀에서 이격된 금속 패턴들에 의해 inductive coupling을 감소시키는 구조를 나타낸 도면,도 10은 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀에서 이격된 금속 패턴들의 다양한 구조를 나타낸 도면, 도 11은 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀에서 상호 인덕턴스(상호 커플링)를 감소시켜 개선된 성 능을 나타낸 도면, 도 12는 본 개시의 실시 예에 따른 LC 기반 RIS 단위 셀에서 주 전류 원을 형성하는 막대 구조들이 이격된 금속 패턴들의 구조를 나타낸 도면, 및 도 13은 본 개시의 실시 예에 따라 도 12의 예가 적용된 LC 기반 RIS 단위 셀에서 상호 인덕턴스를 제어하여 통 과 대역 특성이 개선되는 성능을 나타낸 도면, 및 도 14는 본 개시의 실시 예에 따라 다수의 LC 기반 RIS 단위 셀들을 포함하는 투과형 RIS 장치의 일 구성 예를 나타낸 도면."}
