{"patent_id": "10-2023-0103485", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0022442", "출원번호": "10-2023-0103485", "발명의 명칭": "저온창고의 스마트 화재 조기탐지 시스템 및 방법", "출원인": "(주)오에스엘이엔지", "발명자": "한수진"}}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "설정된 온도 이하로 유지되는 저온창고의 스마트 화재 조기탐지 시스템으로서, 상기 저온창고의 내부에 설치되어 상기 저온창고 내의 공기를 흡입하고, 흡입된 상기 공기로부터 설정된 농도이하의 미세연기를 감지하여 미세연기 감지 데이터를 획득하는 공기흡입형 감지기;상기 저온창고의 내부에 설치되어 상기 저온창고 내의 영상 데이터, 온도 데이터 및 화염 데이터 중 적어도 하나를 포함하는 열화상 감지 데이터를 획득하고, 상기 열화상 감지 데이터로부터 상기 저온창고의 화재를 예지하는 열화상 카메라;상기 공기흡입형 감지기 및 상기 열화상 카메라로부터 상기 미세연기 감지 데이터 및 상기 열화상 감지 데이터를 각각 수신하고, 상기 미세연기 감지 데이터와 상기 열화상 감지 데이터를 이용하여 화재 발생여부 및 화재발생위치를 결정하는 서버를 포함하는, 저온창고의 스마트 화재 조기탐지 시스템."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 서버는, 상기 미세연기 감지기 데이터로부터 시간 흐름에 따른 상기 미세연기의 농도 패턴을 획득하고, 상기 미세연기의 농도 패턴으로부터 상기 화재 발생여부를 결정하는, 저온창고의 스마트 화재 조기탐지 시스템."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 서버는, 상기 영상 데이터에 포함된 연기의 색상, 밀도, 형태 및 움직임 중 적어도 하나와 제1 학습 데이터를 비교하거나, 상기 온도 데이터에 포함된 온도의 변화량, 분포도 및 지속시간 중 적어도 하나와 제2 학습데이터를 비교하거나, 상기 화염 데이터에 포함된 화염의 색상, 밝기, 형태, 크기 및 움직임 중 적어도 하나와제3 학습 데이터를 비교하여 상기 저온창고 내의 화재발생 가능성을 판단하는, 저온창고의 스마트 화재 조기탐지 시스템."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 서버는, 상기 화재발생 가능성이 기준치를 초과한 것으로 판단되는 경우 상기 영상 데이터, 상기 온도 데이터 및 상기 화염 데이터 중 적어도 하나를 이용하여 상기 화재 발생위치를 결정하는, 저온창고의 스마트 화재조기탐지 시스템."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "에 있어서,상기 저온창고의 내부 환경조건은, 상기 저온창고 내의 공기 순환속도, 상기 저온창고 내의 습도, 및 상기 열화상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙(rack)이 차지하는 영역의 크기 중 적어도 하나를 포함하는, 저온창고의 스마트 화재 조기탐지 시스템."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 서버는, 상기 저온창고 내의 공기 순환속도가 임계치 이하인 경우 상기 공기흡입형 감지기의 공기 흡입속도를 증가시키는, 저온창고의 스마트 화재 조기탐지 시스템."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서,상기 서버는, 상기 저온창고 내의 습도가 임계치를 초과하는 경우 상기 공기흡입형 감지기의 감도를감소시키는, 저온창고의 스마트 화재 조기탐지 시스템."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 6에 있어서,상기 서버는, 상기 화염 데이터에 포함된 화염의 크기 대비 상기 열화상 카메라가 향하고 있는 방향에 위치하는물품 또는 랙이 차지하는 영역의 크기가 임계치를 초과하는 경우 상기 열화상 카메라의 감지영역 범위를 확대시키는, 저온창고의 스마트 화재 조기탐지 시스템."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "설정된 온도 이하로 유지되는 저온창고의 스마트 화재 조기탐지 방법으로서,상기 저온창고의 내부에 설치된 공기흡입형 감지기에서, 상기 저온창고 내의 공기를 흡입하는 단계;상기 공기흡입형 감지기에서, 흡입된 상기 공기로부터 설정된 농도 이하의 미세연기를 감지하여 미세연기 감지데이터를 획득하는 단계;상기 저온창고의 내부에 설치된 열화상 카메라에서, 상기 저온창고의 내부에 설치되어 상기 저온창고 내의 영상데이터, 온도 데이터 및 화염 데이터 중 적어도 하나를 포함하는 열화상 감지 데이터를 획득하는 단계;상기 열화상 카메라에서, 상기 열화상 감지 데이터로부터 상기 저온창고의 화재를 예지하는 단계;서버에서, 상기 공기흡입형 감지기 및 상기 열화상 카메라로부터 상기 미세연기 감지 데이터 및 상기 열화상 감지 데이터를 각각 수신하는 단계; 및상기 서버에서, 상기 미세연기 감지 데이터와 상기 열화상 감지 데이터를 이용하여 화재 발생여부 및 화재 발생위치를 결정하는 단계를 포함하는, 저온창고의 스마트 화재 조기탐지 방법."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 화재 발생여부 및 화재 발생위치를 결정하는 단계는, 상기 미세연기 감지기 데이터로부터 시간 흐름에 따공개특허 10-2025-0022442-4-른 상기 미세연기의 농도 패턴을 획득하고, 상기 미세연기의 농도 패턴으로부터 상기 화재 발생여부를결정하는, 저온창고의 스마트 화재 조기탐지 방법."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서,상기 화재 발생여부 및 화재 발생위치를 결정하는 단계는, 상기 영상 데이터에 포함된 연기의 색상, 밀도, 형태및 움직임 중 적어도 하나와 제1 학습 데이터를 비교하거나, 상기 온도 데이터에 포함된 온도의 변화량, 분포도및 지속시간 중 적어도 하나와 제2 학습 데이터를 비교하거나, 상기 화염 데이터에 포함된 화염의 색상, 밝기,형태, 크기 및 움직임 중 적어도 하나와 제3 학습 데이터를 비교하여 상기 저온창고 내의 화재발생 가능성을 판단하는, 저온창고의 스마트 화재 조기탐지 방법."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,상기 화재 발생여부 및 화재 발생위치를 결정하는 단계는, 상기 화재발생 가능성이 기준치를 초과한 것으로 판단되는 경우 상기 영상 데이터, 상기 온도 데이터 및 상기 화염 데이터 중 적어도 하나를 이용하여 상기 화재발생위치를 결정하는, 저온창고의 스마트 화재 조기탐지 방법."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 10에 있어서,상기 서버에서, 상기 저온창고의 내부 환경조건을 이용하여 상기 공기흡입형 감지기 및 상기 열화상 카메라 중적어도 하나의 동작을 제어하는 단계를 더 포함하는, 저온창고의 스마트 화재 조기탐지 방법."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "에 있어서,상기 공기흡입형 감지기 및 상기 열화상 카메라의 동작을 제어하는 단계는, 상기 화염 데이터에 포함된 화염의크기 대비 상기 열화상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기가 임계치를 초과하는 경우 상기 열화상 카메라의 감지영역 범위를 확대시키는, 저온창고의 스마트 화재 조기탐지 방법."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서,상기 공기흡입형 감지기 및 상기 열화상 카메라의 동작을 제어하는 단계는, 상기 저온창고 내의 공기 순환속도가 임계치 이하인 경우 상기 공기흡입형 감지기의 공기 흡입속도를 증가시키는, 저온창고의 스마트 화재 조기탐지 방법."}
{"patent_id": "10-2023-0103485", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 15에 있어서,상기 공기흡입형 감지기 및 상기 열화상 카메라의 동작을 제어하는 단계는, 상기 저온창고 내의 습도가 임계치를 초과하는 경우 상기 공기흡입형 감지기의 감도를 감소시키는, 저온창고의 스마트 화재 조기탐지 방법.공개특허 10-2025-0022442-5-청구항 18"}
{"patent_id": "10-2023-0103485", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "저온창고의 스마트 화재 조기탐지 시스템 및 방법이 제공된다. 본 발명의 일 실시예에 따른 저온창고의 스마트 화재 조기탐지 시스템은, 설정된 온도 이하로 유지되는 저온창고의 스마트 화재 조기탐지 시스템으로서, 상기 저 온창고의 내부에 설치되어 상기 저온창고 내의 공기를 흡입하고, 흡입된 상기 공기로부터 설정된 농도 이하의 미 (뒷면에 계속)"}
{"patent_id": "10-2023-0103485", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예들은 공기흡입형 감지기와 열화상 카메라를 이용하여 저온창고에서의 화재를 조기에 탐지하고 예지하는 기술과 관련된다."}
{"patent_id": "10-2023-0103485", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 저온창고는 식품, 의약품, 화학물질 등의 보관을 위해 약 -60℃ 내지 0℃ 의 저온으로 유지된다. 이러한 저온창고는 화재발생의 위험이 있으며, 이에 따라 화재발생시 신속한 대응이 필요하다. 그러나, 종래의 화재탐지 설비는 화염, 연기, 열 등을 감지하여 화재를 탐지하는 방식으로 구성되어 있으며, 저 온창고의 특수한 환경과 화재발생 유형에 따른 신속한 대응에 어려움이 있다. 구체적으로, 종래의 화재탐지 설비는 일정 농도 이상의 연기를 감지하도록 구성되나 저온창고에서는 연기가 미 세하게 생성되어 화재의 조기감지에 어려움이 있다. 또한, 저온창고의 경우 내부온도가 매우 낮기 때문에 종래 의 화재탐지 설비의 작동이 어렵고, 냉각효과로 인해 화재탐지 설비의 감지범위와 감지 정확도에 있어 한계가 있다. 나아가, 종래의 화재탐지 설비는 화염, 연기, 열 등을 이용하여 화재를 감지하고 경고를 발생시키도록 구 성되나 화재발생의 위험 및 화재 발생위치를 사전에 예지할 수 없는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-2468046호(2022.11.14)"}
{"patent_id": "10-2023-0103485", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 인공지능 모델을 기반으로 저온창고에서의 화재를 조기에 감지하여 보다 신속하게 대응하 기 위한 것이다."}
{"patent_id": "10-2023-0103485", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "예시적인 실시예에 따르면, 설정된 온도 이하로 유지되는 저온창고의 스마트 화재 조기탐지 시스템으로서, 상기 저온창고의 내부에 설치되어 상기 저온창고 내의 공기를 흡입하고, 흡입된 상기 공기로부터 설정된 농도 이하의 미세연기를 감지하여 미세연기 감지 데이터를 획득하는 공기흡입형 감지기; 상기 저온창고의 내부에 설치되어 상기 저온창고 내의 영상 데이터, 온도 데이터 및 화염 데이터 중 적어도 하나를 포함하는 열화상 감지 데이터 를 획득하고, 상기 열화상 감지 데이터로부터 상기 저온창고의 화재를 예지하는 열화상 카메라; 상기 공기흡입 형 감지기 및 상기 열화상 카메라로부터 상기 미세연기 감지 데이터 및 상기 열화상 감지 데이터를 각각 수신하고, 상기 미세연기 감지 데이터와 상기 열화상 감지 데이터를 이용하여 화재 발생여부 및 화재 발생위치를 결정 하는 서버를 포함하는, 저온창고의 스마트 화재 조기탐지 시스템이 제공된다. 상기 서버는, 상기 미세연기 감지기 데이터로부터 시간 흐름에 따른 상기 미세연기의 농도 패턴을 획득하고, 상 기 미세연기의 농도 패턴으로부터 상기 화재 발생여부를 결정할 수 있다. 상기 서버는, 상기 영상 데이터에 포함된 연기의 색상, 밀도, 형태 및 움직임 중 적어도 하나와 제1 학습 데이 터를 비교하거나, 상기 온도 데이터에 포함된 온도의 변화량, 분포도 및 지속시간 중 적어도 하나와 제2 학습 데이터를 비교하거나, 상기 화염 데이터에 포함된 화염의 색상, 밝기, 형태, 크기 및 움직임 중 적어도 하나와 제3 학습 데이터를 비교하여 상기 저온창고 내의 화재발생 가능성을 판단할 수 있다. 상기 서버는, 상기 화재발생 가능성이 기준치를 초과한 것으로 판단되는 경우 상기 영상 데이터, 상기 온도 데 이터 및 상기 화염 데이터 중 적어도 하나를 이용하여 상기 화재 발생위치를 결정할 수 있다. 상기 서버는, 상기 저온창고의 내부 환경조건을 이용하여 상기 공기흡입형 감지기 및 상기 열화상 카메라 중 적 어도 하나의 동작을 제어할 수 있다. 상기 저온창고의 내부 환경조건은, 상기 저온창고 내의 공기 순환속도, 상기 저온창고 내의 습도, 및 상기 열화 상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙(rack)이 차지하는 영역의 크기 중 적어도 하나를 포함 할 수 있다. 상기 서버는, 상기 저온창고 내의 공기 순환속도가 임계치 이하인 경우 상기 공기흡입형 감지기의 공기 흡입속 도를 증가시킬 수 있다. 상기 서버는, 상기 저온창고 내의 습도가 임계치를 초과하는 경우 상기 공기흡입형 감지기의 감도를 감소시킬 수 있다. 상기 서버는, 상기 화염 데이터에 포함된 화염의 크기 대비 상기 열화상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기가 임계치를 초과하는 경우 상기 열화상 카메라의 감지영역 범위를 확대시 킬 수 있다. 다른 예시적인 실시예에 따르면, 설정된 온도 이하로 유지되는 저온창고의 스마트 화재 조기탐지 방법으로서, 상기 저온창고의 내부에 설치된 공기흡입형 감지기에서, 상기 저온창고 내의 공기를 흡입하는 단계; 상기 공기 흡입형 감지기에서, 흡입된 상기 공기로부터 설정된 농도 이하의 미세연기를 감지하여 미세연기 감지 데이터를 획득하는 단계; 상기 저온창고의 내부에 설치된 열화상 카메라에서, 상기 저온창고의 내부에 설치되어 상기 저 온창고 내의 영상 데이터, 온도 데이터 및 화염 데이터 중 적어도 하나를 포함하는 열화상 감지 데이터를 획득 하는 단계; 상기 열화상 카메라에서, 상기 열화상 감지 데이터로부터 상기 저온창고의 화재를 예지하는 단계; 서버에서, 상기 공기흡입형 감지기 및 상기 열화상 카메라로부터 상기 미세연기 감지 데이터 및 상기 열화상 감 지 데이터를 각각 수신하는 단계; 및 상기 서버에서, 상기 미세연기 감지 데이터와 상기 열화상 감지 데이터를 이용하여 화재 발생여부 및 화재 발생위치를 결정하는 단계를 포함하는, 저온창고의 스마트 화재 조기탐지 방법 이 제공된다. 상기 화재 발생여부 및 화재 발생위치를 결정하는 단계는, 상기 미세연기 감지기 데이터로부터 시간 흐름에 따 른 상기 미세연기의 농도 패턴을 획득하고, 상기 미세연기의 농도 패턴으로부터 상기 화재 발생여부를 결정할 수 있다. 상기 화재 발생여부 및 화재 발생위치를 결정하는 단계는, 상기 영상 데이터에 포함된 연기의 색상, 밀도, 형태 및 움직임 중 적어도 하나와 제1 학습 데이터를 비교하거나, 상기 온도 데이터에 포함된 온도의 변화량, 분포도 및 지속시간 중 적어도 하나와 제2 학습 데이터를 비교하거나, 상기 화염 데이터에 포함된 화염의 색상, 밝기, 형태, 크기 및 움직임 중 적어도 하나와 제3 학습 데이터를 비교하여 상기 저온창고 내의 화재발생 가능성을 판 단할 수 있다. 상기 화재 발생여부 및 화재 발생위치를 결정하는 단계는, 상기 화재발생 가능성이 기준치를 초과한 것으로 판 단되는 경우 상기 영상 데이터, 상기 온도 데이터 및 상기 화염 데이터 중 적어도 하나를 이용하여 상기 화재 발생위치를 결정할 수 있다. 상기 저온창고의 스마트 화재 조기탐지 방법은, 상기 서버에서, 상기 저온창고의 내부 환경조건을 이용하여 상 기 공기흡입형 감지기 및 상기 열화상 카메라 중 적어도 하나의 동작을 제어하는 단계를 더 포함할 수 있다. 상기 저온창고의 내부 환경조건은, 상기 저온창고 내의 공기 순환속도, 상기 저온창고 내의 습도, 및 상기 열화 상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙(rack)이 차지하는 영역의 크기 중 적어도 하나를 포함 할 수 있다. 상기 공기흡입형 감지기 및 상기 열화상 카메라의 동작을 제어하는 단계는, 상기 저온창고 내의 공기 순환속도 가 임계치 이하인 경우 상기 공기흡입형 감지기의 공기 흡입속도를 증가시킬 수 있다. 상기 공기흡입형 감지기 및 상기 열화상 카메라의 동작을 제어하는 단계는, 상기 저온창고 내의 습도가 임계치 를 초과하는 경우 상기 공기흡입형 감지기의 감도를 감소시킬 수 있다. 상기 공기흡입형 감지기 및 상기 열화상 카메라의 동작을 제어하는 단계는, 상기 화염 데이터에 포함된 화염의 크기 대비 상기 열화상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기가 임계치 를 초과하는 경우 상기 열화상 카메라의 감지영역 범위를 확대시킬 수 있다."}
{"patent_id": "10-2023-0103485", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 공기흡입형 감지기와 열화상 카메라를 이용하여 저온창고에서의 화재를 조기에 탐지하고 화재 발생 가능성 및 화재 발생위치를 보다 정확하게 예지할 수 있다. 특히, 본 발명의 실시예들에 따 르면, 저온창고의 내부 환경조건에 따라 공기흡입형 감지기와 열화상 카메라의 동작을 동적으로 제어하도록 함 으로써, 저온창고의 특성(저온 및 고습 환경)에 따른 효율적인 화재 탐지가 가능해진다. 나아가, 본 발명의 경 우 공기흡입형 감지기와 열화상 카메라의 설치만으로 저온창고에서의 화재 조기 탐지가 가능하며, 시스템 설치, 사용 및 유지 관리 또한 용이하다."}
{"patent_id": "10-2023-0103485", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 구체적인 실시형태를 설명하기로 한다. 이하의 상세한 설명은 본 명세서에서 기술된 방법, 장치 및/또는 시스템에 대한 포괄적인 이해를 돕기 위해 제공된다. 그러나 이는 예시에 불과하며 본 발명은 이에 제한되지 않는다. 본 발명의 실시예들을 설명함에 있어서, 본 발명과 관련된 공지기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 그리고, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 상세한 설명에서 사용되 는 용어는 단지 본 발명의 실시예들을 기술하기 위한 것이며, 결코 제한적이어서는 안 된다. 명확하게 달리 사 용되지 않는 한, 단수 형태의 표현은 복수 형태의 의미를 포함한다. 본 설명에서, \"포함\" 또는 \"구비\"와 같은 표현은 어떤 특성들, 숫자들, 단계들, 동작들, 요소들, 이들의 일부 또는 조합을 가리키기 위한 것이며, 기술된 것 이외에 하나 또는 그 이상의 다른 특성, 숫자, 단계, 동작, 요소, 이들의 일부 또는 조합의 존재 또는 가능 성을 배제하도록 해석되어서는 안 된다. 도 1은 본 발명의 일 실시예에 따른 저온창고의 스마트 화재 조기탐지 시스템의 상세 구성을 나타낸 블록 도이다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 저온창고의 스마트 화재 조기탐지 시스템은 공기흡입형 감지기, 열화상 카메라, 서버, 공공기관 단말 및 관리자 단말을 포함 한다. 여기서, 공기흡입형 감지기 및 열화상 카메라는 저온창고의 내부에 설치되며, 저온창고의 스마 트 화재 조기탐지 시스템 내의 각 구성들은 네트워크(미도시)를 통해 상호 연결될 수 있다. 본 실시예들에 있어서, 저온창고는 식품, 의약품, 화학물질 등의 보관을 위해 설정된 온도 이하로 유지되는 창 고를 의미한다. 여기서, 설정된 온도는 예를 들어, 0℃ 가 될 수 있다. 또한, 네트워크는 예를 들어, 인터넷, 와이파이 네트워크(wifi network), 3G 네트워크, LTE 네트워크 등과 같은 모바일 네트워크(mobile network), 광역 네트워크(wire area networks), RS-485, RS-232C, TTL(Transistor-Transistor Logic) 등을 모두 포함하는 넓은 의미로 사용된다. 공기흡입형 감지기는 저온창고의 내부에 설치되어 상기 저온창고 내의 공기를 흡입하고, 흡입된 공기로부 터 설정된 농도 이하의 미세연기를 감지하여 미세연기 감지 데이터를 획득한다. 공기흡입형 감지기는 공기 흡입을 위한 하나 이상의 흡입관(미도시)과 연결되며, 상기 흡입관을 통해 상기 저온창고 내의 공기를 흡입할 수 있다. 또한, 공기흡입형 감지기는 흡입된 공기를 저장하기 위한 소정 크기의 챔버(미도시)를 구비할 수 있다. 일반적으로, 저온창고의 경우 내부온도가 매우 낮기 때문에 공기의 대류, 순환이 원활하지 않다. 이에 따라, 본 발명에서는 공기흡입형 감지기가 저온창고 내의 공기를 흡입한 후 흡입된 공기에 포함된 특정 입자 또는 물질을 통해 설정된 농도 이하의 미세연기를 감지할 수 있도록 하였다. 이를 위해, 공기흡입형 감지기는 연기농도의 측정, 특정 입자 또는 물질의 감지를 위한 다양한 센서들을 구비할 수 있다. 공기흡입형 감지기 는 예를 들어, 0.03% 농도 이하의 미세연기를 감지하여 미세연기 데이터를 획득할 수 있다. 미세연기 데이 터는 감지 시간대별 미세연기의 농도, 시간 흐름에 따른 미세연기의 농도 패턴에 관한 정보를 포함할 수 있다. 이와 같이, 공기흡입형 감지기는 다양하고 정교한 센서를 통해 미세연기를 실시간으로 감지할 수 있으며, 측정된 상기 미세연기 데이터를 통해 화재 발생 전 화재의 조기감지가 가능해진다. 후술할 바와 같이, 서버 는 공기흡입형 감지기로부터 미세연기 감지 데이터를 수신하고, 이를 이용하여 화재 발생여부를 조기 에 감지할 수 있다. 열화상 카메라는 저온창고의 내부에 설치되어 상기 저온창고 내의 영상 데이터, 온도 데이터 및 화염 데이 터 중 적어도 하나를 포함하는 열화상 감지 데이터를 획득하고, 상기 열화상 감지 데이터로부터 저온창고의 화 재를 예지한다. 열화상 카메라는 저온창고의 내부에서 서로 다른 위치에 복수 개 설치될 수 있다. 열화상 카메라는 저온창고 내의 설정된 지점을 향하도록 설치될 수 있으며, 상기 지점에서의 영상 데이터, 온도 데이터 및 화염 데이터 등을 분석하여 저온창고의 화재를 예지할 수 있다. 여기서, 영상 데이터는 예를 들어, 저온창고 내의 설정된 지점에서 발생된 연기의 색상, 밀도, 형태 및 움직임 중 적어도 하나를 포함할 수 있다. 또한, 온도 데이터는 예를 들어, 저온창고 내의 설정된 지점에서의 온도 변화량, 온도 분포도 및 온도 지속시간 중 적어도 하나를 포함할 수 있다. 또한, 화염 데이터는 예를 들어, 저온창고 내의 설정된 지점에서 발생된 화 염의 색상, 밝기, 형태, 크기 및 움직임 중 적어도 하나를 포함할 수 있다. 열화상 카메라는 상기 열화상 감지 데이터로부터 온도가 비정상적으로 높은 지점을 식별하고, 식별된 지점 의 화재레벨을 결정(즉, 화재를 예지)할 수 있다. 구체적으로, 열화상 카메라는 화재 발생 전 저온창고의 이상적인 온도(즉, 기준온도)를 관리자로부터 입력 받고, 상기 기준온도와 상기 열화상 감지 데이터에 포함된 온도를 비교하여 저온창고의 화재레벨을 결정할 수 있다. 일 예시로서, 상기 기준온도와 상기 열화상 감지 데이 터에 포함된 온도 간의 차이가 5℃ 내지 10℃ 인 경우, 열화상 카메라는 저온창고의 화재레벨을 제1 단계 로 결정할 수 있다. 다른 예시로서, 상기 기준온도와 상기 열화상 감지 데이터에 포함된 온도 간의 차이가 10℃ 이상인 경우, 열화상 카메라는 저온창고의 화재레벨을 제2 단계로 결정할 수 있다. 열화상 카메라는 상기 열화상 감지 데이터, 저온창고의 화재레벨에 관한 정보를 서버로 전달할 수 있다. 후술할 바와 같이, 서버는 상기 열화상 감지 데이터, 저온창고의 화재레벨에 관한 정보를 이용하여 화재발생 가능성을 판단하 고, 화재 발생위치를 식별할 수 있다. 또한, 열화상 카메라는 광학 카메라(미도시)와 결합하여 저온창고의 화재를 예지할 수도 있다. 이 경우, 열화상 카메라는 광학 카메라와 연결되고, 멀티 스펙트럼 영상분석을 통해 열화상과 광학 영상의 정보를 동시에 분석하여 저온창고의 화재를 예지할 수 있다. 일반적으로, 열화상 카메라는 광학 카메라에 비해 해 상도가 낮기 때문에, 열화상 카메라에서 화재가 감지된 영역을 광학 카메라로 촬영하여 화재의 정확한 위 치를 보다 용이하게 탐지할 수 있다. 서버는 공기흡입형 감지기 및 열화상 카메라로부터 미세연기 감지 데이터 및 열화상 감지 데이 터를 각각 수신하고, 미세연기 감지 데이터와 열화상 감지 데이터를 이용하여 화재 발생여부 및 화재 발생위치 를 결정한다. 이때, 서버는 저온창고 내부에 위치한 중계기(미도시), 수신기(미도시) 등을 통해 미세연기 감지 데이터 및 열화상 감지 데이터를 각각 수신할 수 있다. 또한, 서버는 인공지능 모델을 이용하여 화재 발생여부 및 화재 발생위치를 결정할 수 있다. 구체적으로, 서버는 미세연기 감지기 데이터로부터 시간 흐름에 따른 미세연기의 농도 패턴을 획득하고, 상기 미세연기 의 농도 패턴으로부터 화재 발생여부를 결정할 수 있다. 인공지능 모델은 미세연기 농도 패턴과 화재 발생여부 에 관한 데이터를 사전에 학습하고, 공기흡입형 감지기로부터 수신된 미세연기의 농도 패턴으로부터 화재 발생여부를 결정할 수 있다. 일 예시로서, 인공지능 모델은 설정된 시간 동안 미세연기의 농도가 기준치 이상 증가하는 것으로 판단되는 경우 화재가 발생한 것으로 판단할 수 있다. 이때, 서버는 저온창고의 크기, 면 적, 형태, 온도, 습도, 공기 순환속도 등에 따라 화재 발생여부를 판단하는 기준치를 동적으로 달리할 수 있다. 서버는 미세연기의 농도 패턴으로부터 화재 발생여부를 조기에 탐지하고, 화재 발생여부에 관한 정보를 공 공기관 단말 또는 관리자 단말에 전달할 수 있다. 여기서, 화재 발생여부에 관한 정보는 화재 발생시 각, 화재 발생위치, 미세연기 농도 패턴 등에 관한 정보를 포함할 수 있다. 또한, 서버는 열화상 감지 데이터를 이용하여 저온창고 내의 화재발생 가능성을 판단할 수 있다. 이를 위 해, 인공지능 모델은 저온창고에서 발생된 연기의 색상, 밀도, 형태 및 움직임 등에 관한 특징(feature)을 제1 학습 데이터로서 학습할 수 있다. 또한, 인공지능 모델은 저온창고 내의 화재 발생지점에서의 온도 변화량, 온 도 분포도, 온도 지속시간 등에 관한 특징을 제2 학습 데이터로서 학습할 수 있다. 또한, 인공지능 모델은 저온 창고에서 발생된 화염의 색상, 밝기, 형태, 크기 및 움직임 등에 관한 특징을 제3 학습 데이터로서 학습할 수 있다. 서버는 열화상 감지 데이터 내 영상 데이터에 포함된 연기의 색상, 밀도, 형태 및 움직임 중 적어도 하나와 제1 학습 데이터를 비교하거나, 열화상 감지 데이터 내 온도 데이터에 포함된 온도의 변화량, 분포도 및 지속시간 중 적어도 하나와 제2 학습 데이터를 비교하거나, 열화상 감지 데이터 내 화염 데이터에 포함된 화염 의 색상, 밝기, 형태, 크기 및 움직임 중 적어도 하나와 제3 학습 데이터를 비교하여 저온창고 내의 화재발생 가능성을 판단할 수 있다. 서버는 열화상 감지 데이터 내 영상 데이터에 포함된 연기의 색상, 밀도, 형태 및 움직임 중 적어도 하나와 제1 학습 데이터 간의 유사도, 열화상 감지 데이터 내 온도 데이터에 포함된 온도 의 변화량, 분포도 및 지속시간 중 적어도 하나와 제2 학습 데이터 간의 유사도, 열화상 감지 데이터 내 화염 데이터에 포함된 화염의 색상, 밝기, 형태, 크기 및 움직임 중 적어도 하나와 제3 학습 데이터 간의 유사도에 따라 저온창고 내의 화재발생 가능성을 판단할 수 있다. 즉, 서버는 열화상 카메라로부터 수신된 영 상 데이터, 온도 데이터 및 화염 데이터와 인공지능 모델에서 학습된 학습 데이터 간의 유사도를 계산하고, 상 기 유사도에 따라 저온창고 내의 화재발생 가능성을 판단할 수 있다. 만약, 상기 화재발생 가능성이 기준치를 초과한 것으로 판단되는 경우, 서버는 상기 영상 데이터, 상기 온 도 데이터 및 상기 화염 데이터 중 적어도 하나를 이용하여 화재 발생위치를 결정할 수 있다. 일 예시로서, 서 버는 영상 데이터, 온도 데이터 및 화염 데이터로부터 제1 학습 데이터 내지 제3 학습 데이터와 일정 수준 이상의 유사도를 보이는 저온창고 내 지점을 특정하고, 특정된 지점을 화재 발생위치로 결정할 수 있다. 한편, 서버는 상술한 화재 발생여부 및 화재 발생위치를 결정하는 과정에서 저온창고의 내부 환경조건이 설정된 조건을 만족하는지 여부를 판별하고, 저온창고의 내부 환경조건이 설정된 조건을 만족하는 경우 공기흡 입형 감지기 및 열화상 카메라 중 적어도 하나의 동작을 제어할 수 있다. 여기서, 저온창고의 내부 환경조건은 예를 들어, 저온창고 내의 공기 순환속도, 저온창고 내의 습도, 열화상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙(rack)이 차지하는 영역의 크기 등이 될 수 있다. 일반적으로, 저온창고의 경우 공기의 대류, 순환이 원활하지 않고 내부온도가 매우 낮아 공기흡입형 감지기 에서 미세연기를 정상적으로 감지하지 못하거나 수분을 연기로 오감지하는 경우가 발생할 수 있다. 또한, 열화상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기가 상대적으로 큰 경 우, 저온창고에서 발생되는 화염이 상기 물품 또는 랙에 의해 가려져 정상적으로 감지하지 못하는 경우가 발생 할 수 있다. 이에 따라, 본 발명에서는 서버가 저온창고의 내부 환경조건을 이용하여 공기흡입형 감지기 및 열화상 카메라 중 적어도 하나의 동작을 동적으로 제어할 수 있도록 하였다. 일 예시로서, 서버는 저온창고 내의 공기 순환속도가 임계치 이하인 경우 공기흡입형 감지기의 공기 흡입속도를 증가시킬 수 있다. 예를 들어, 저온창고 내의 공기 순환속도가 0.5m/s 이하인 경우, 서버는 공 기흡입형 감지기의 공기 흡입속도를 1.5배 증가시킬 수 있다. 즉, 서버는 저온창고 내의 공기 순환속 도가 임계치 이하인 경우 저온창고 내의 공기 순환속도에 반비례하도록 공기흡입형 감지기의 공기 흡입속도를 증가시킬 수 있다. 이 경우, 저온창고 내의 공기 순환속도가 작을수록 공기흡입형 감지기의 공기 흡 입속도가 증가할 수 있다. 이를 위해, 서버는 공기흡입형 감지기 또는 별도의 다른 센서로부터 저온 창고 내의 공기 순환속도에 관한 정보를 실시간으로 수집할 수 있으며, 저온창고 내의 공기 순환속도에 따라 공 기흡입형 감지기의 공기 흡입속도를 동적으로 제어할 수 있다. 이때, 서버는 저온창고의 크기 및 면 적에 따라 공기 흡입속도의 증가폭을 동적으로 달리할 수 있다. 예를 들어, 서버는 저온창고의 크기 및 면 적이 클수록 공기 흡입속도의 증가폭을 더 크게 제어할 수 있다. 저온창고의 크기 및 면적이 클수록 미세연기의 감지에 필요한 공기의 양이 더욱 커지므로, 서버는 크기 및 면적이 작은 저온창고보다 크기 및 면적이 큰 저온창고에서 공기흡입형 감지기의 공기 흡입속도가 더 빠르게 증가할 수 있도록 공기흡입형 감지기 의 동작을 제어할 수 있다. 다른 예시로서, 서버는 저온창고 내의 습도가 임계치를 초과하는 경우 공기흡입형 감지기의 감도 (sensitivity)를 감소시킬 수 있다. 예를 들어, 저온창고 내의 습도가 80%를 초과하는 경우, 서버는 공기 흡입형 감지기의 감도를 0.8배로 감소시킬 수 있다. 저온창고 내의 습도가 임계치를 초과하는 경우 공기흡 입형 감지기에서 수분을 연기로 오감지하는 경우가 발생할 수 있으므로, 서버는 저온창고 내의 습도 가 임계치를 초과하는 경우 저온창고 내의 습도에 반비례하도록 공기흡입형 감지기의 감도를 감소시킬 수 있다. 이 경우, 저온창고 내의 습도가 클수록 기흡입형 감지기의 감도가 작아질 수 있다. 다른 예시로서, 서버는 화염 데이터에 포함된 화염의 크기 대비 열화상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기가 임계치를 초과하는 경우 열화상 카메라의 감지영역 범위 를 확대시킬 수 있다. 예를 들어, 화염 데이터에 포함된 화염의 크기 대비 열화상 카메라가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기가 10%를 초과하는 경우, 서버는 열화상 카메라 의 감지영역 범위를 1.2배로 확대시킬 수 있다. 화염 데이터에 포함된 화염의 크기 대비 열화상 카메라 가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기가 임계치를 초과하는 경우, 물품 또는 랙에 의해 화염이 가려져서 열화상 카메라가 화염을 정상적으로 감지할 수 없게 된다. 이에 따라, 서 버는 화염 데이터에 포함된 화염의 크기 대비 열화상 카메라가 향하고 있는 방향에 위치하는 물품 또 는 랙이 차지하는 영역의 크기가 임계치를 초과하는 경우 화염 데이터에 포함된 화염의 크기 대비 열화상 카메 라가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기에 반비례하도록 열화상 카메라 의 감지영역 범위를 확대시킬 수 있다. 이 경우, 화염 데이터에 포함된 화염의 크기 대비 열화상 카메라 가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기가 클수록 열화상 카메라의 감 지영역 범위가 커질 수 있다. 만약, 열화상 카메라의 감지영역 범위를 확대시키는 과정에서 열화상 카메라 의 감지영역 범위가 최대치에 도달하는 경우, 서버는 열화상 카메라가 감지된 화염을 향하도록 열화상 카메라의 방향을 자동으로 조정할 수 있다. 이와 같이, 저온창고의 내부 환경조건, 즉 저온창고 내의 공기 순환속도, 저온창고 내의 습도, 및 열화상 카메 라가 향하고 있는 방향에 위치하는 물품 또는 랙이 차지하는 영역의 크기가 설정된 조건을 만족하는 경우, 서버는 저온창고 내 미세연기의 조기탐지 및 화재의 정확한 예지를 위해 공기흡입형 감지기 및 열화 상 카메라의 동작을 동적으로 제어할 수 있다. 이때, 서버는 공기흡입형 감지기 및 열화상 카메 라의 동작(또는 설정 조건), 예를 들어 공기흡입형 감지기의 공기 흡입속도, 감도, 열화상 카메라 의 감지영역 범위를 제어할 때마다 해당 저온창고의 내부 환경조건과 변경된 공기흡입형 감지기 및 열화상 카메라의 동작을 인공지능 모델에 입력할 수 있다. 이에 따라, 서버는 추후 유사한 내부 환경 조건을 갖는 다른 저온창고에서 인공지능 모델을 이용하여 공기흡입형 감지기 및 열화상 카메라의 동 작을 자동으로 제어할 수 있다. 즉, 서버는 저온창고의 내부 환경조건이 설정된 조건을 만족하는 경우 인 공지능 모델을 이용하여 유사도가 설정된 값 이상인 학습 데이터를 선별하고, 선별된 학습 데이터를 이용하여 공기흡입형 감지기 및 열화상 카메라의 동작을 자동으로 제어할 수도 있다. 공공기관 단말은 저온창고에서의 화재 발생시 이를 조기 진압하기 위한 공공기관에서 소지하는 단말로서, 예를 들어 소방서의 소방대원 단말일 수 있다. 공공기관 단말은 서버로부터 화재 발생여부에 관한 정 보, 화재 경보 메시지 등을 수신할 수 있다. 관리자 단말은 저온창고를 관리하는 관리자가 소지하는 단말, 저온창고 근처의 공통주택을 관리하는 관리 자가 소지하는 단말 등이 될 수 있다. 관리자 단말은 예를 들어, 스마트폰, 노트북, 태블릿 PC 등이 될 수 있다. 관리자 단말은 공공기관 단말과 마찬가지로 서버로부터 화재 발생여부에 관한 정보, 화재 경보 메시지 등을 수신할 수 있다.도 2는 본 발명의 일 실시예에 따른 저온창고의 예시이다. 도 2를 참조하면, 저온창고의 내부에는 하나 이상의 공기흡입형 감지기 및 하나 이상의 열화상 카메라 가 설치될 수 있다. 또한, 저온창고의 내부온도는 약 -60℃ 내지 0℃ 로 유지될 수 있다. 도 3은 본 발명의 제1 실시예에 따른 저온창고의 스마트 화재 조기탐지 방법을 설명하기 위한 흐름도이다. 도시 된 흐름도에서는 상기 방법을 복수 개의 단계로 나누어 기재하였으나, 적어도 일부의 단계들은 순서를 바꾸어 수행되거나, 다른 단계와 결합되어 함께 수행되거나, 생략되거나, 세부 단계들로 나뉘어 수행되거나, 또는 도시 되지 않은 하나 이상의 단계가 부가되어 수행될 수 있다. S102 단계에서, 공기흡입형 감지기는 저온창고의 내부에 설치되어 상기 저온창고 내의 공기를 흡입하고, 흡입된 공기로부터 설정된 농도 이하의 미세연기를 감지하여 미세연기 감지 데이터를 획득한다. S104 단계에서, 열화상 카메라는 저온창고의 내부에 설치되어 상기 저온창고 내의 영상 데이터, 온도 데이 터 및 화염 데이터 중 적어도 하나를 포함하는 열화상 감지 데이터를 획득한다. S102 단계 및 S104 단계는 병렬 적으로 수행될 수 있으며, 어느 한 단계가 다른 단계의 선후에 수행되어도 무방하다. S106 단계에서, 서버는 공기흡입형 감지기 및 열화상 카메라로부터 미세연기 감지 데이터 및 열 화상 감지 데이터를 각각 수신하고, 상기 미세연기 감지 데이터와 상기 열화상 감지 데이터를 이용하여 화재 발 생여부 및 화재 발생위치를 결정한다. 도 4는 본 발명의 제2 실시예에 따른 저온창고의 스마트 화재 조기탐지 방법을 설명하기 위한 흐름도이다. S202 단계에서, 공기흡입형 감지기는 저온창고의 내부에 설치되어 상기 저온창고 내의 공기를 흡입하고, 흡입된 공기로부터 설정된 농도 이하의 미세연기를 감지하여 미세연기 감지 데이터를 획득한다. S204 단계에서, 열화상 카메라는 저온창고의 내부에 설치되어 상기 저온창고 내의 영상 데이터, 온도 데이 터 및 화염 데이터 중 적어도 하나를 포함하는 열화상 감지 데이터를 획득한다. S202 단계 및 S204 단계는 병렬 적으로 수행될 수 있으며, 어느 한 단계가 다른 단계의 선후에 수행되어도 무방하다. S206 단계에서, 서버는 저온창고의 내부 환경조건이 설정된 조건을 만족하는지 여부를 판단한다. 이를 위 해, 서버는 공기흡입형 감지기, 열화상 카메라 또는 다른 별도의 센서로부터 저온창고의 내부 환경조건에 관한 정보를 수집할 수 있다. 만약, 저온창고의 내부 환경조건이 설정된 조건을 만족하는 경우, S208 단계에서 서버는 공기흡입형 감지 기 및 열화상 카메라 중 적어도 하나의 동작을 제어한다. 이후, S202 단계 및 S204 단계가 다시 수행 된다. 즉, S208 단계에 의해 공기흡입형 감지기 및 열화상 카메라 중 적어도 하나의 동작이 변경되는 경우, S202 단계 및 S204 단계가 다시 수행된 후 S210 단계가 수행된다. 만약, 저온창고의 내부 환경조건이 설정된 조건을 만족하지 않는 경우, S210 단계에서 서버는 공기흡입형 감지기 및 열화상 카메라로부터 수신된 미세연기 감지 데이터와 열화상 감지 데이터를 이용하여 화재 발생여부 및 화재 발생위치를 결정한다. 도 5는 예시적인 실시예들에서 사용되기에 적합한 컴퓨팅 장치를 포함하는 컴퓨팅 환경을 예시하여 설명하기 위 한 블록도이다. 도시된 실시예에서, 각 컴포넌트들은 이하에 기술된 것 이외에 상이한 기능 및 능력을 가질 수 있고, 이하에 기술되지 않은 것 이외에도 추가적인 컴포넌트를 포함할 수 있다. 도시된 컴퓨팅 환경은 컴퓨팅 장치를 포함한다. 일 실시예에서, 컴퓨팅 장치는 저온창고의 스마트 화재 조기탐지 시스템, 또는 악 저온창고의 스마트 화재 조기탐지 시스템에 포함되는 하나 이상의 컴 포넌트일 수 있다. 컴퓨팅 장치는 적어도 하나의 프로세서, 컴퓨터 판독 가능 저장 매체 및 통신 버스를 포함한다. 프로세서는 컴퓨팅 장치로 하여금 앞서 언급된 예시적인 실시예에 따라 동작하도록 할 수 있다. 예컨대, 프로세서는 컴퓨터 판독 가능 저장 매체에 저장된 하나 이상의 프로그램들을 실행할 수 있 다. 상기 하나 이상의 프로그램들은 하나 이상의 컴퓨터 실행 가능 명령어를 포함할 수 있으며, 상기 컴퓨터 실 행 가능 명령어는 프로세서에 의해 실행되는 경우 컴퓨팅 장치로 하여금 예시적인 실시예에 따른 동작 들을 수행하도록 구성될 수 있다. 컴퓨터 판독 가능 저장 매체는 컴퓨터 실행 가능 명령어 내지 프로그램 코드, 프로그램 데이터 및/또는 다 른 적합한 형태의 정보를 저장하도록 구성된다. 컴퓨터 판독 가능 저장 매체에 저장된 프로그램은 프로 세서에 의해 실행 가능한 명령어의 집합을 포함한다. 일 실시예에서, 컴퓨터 판독 가능 저장 매체는 메 모리(랜덤 액세스 메모리와 같은 휘발성 메모리, 비휘발성 메모리, 또는 이들의 적절한 조합), 하나 이상의 자 기 디스크 저장 디바이스들, 광학 디스크 저장 디바이스들, 플래시 메모리 디바이스들, 그 밖에 컴퓨팅 장치 에 의해 액세스되고 원하는 정보를 저장할 수 있는 다른 형태의 저장 매체, 또는 이들의 적합한 조합일 수 있다. 통신 버스는 프로세서, 컴퓨터 판독 가능 저장 매체를 포함하여 컴퓨팅 장치의 다른 다양한 컴 포넌트들을 상호 연결한다. 컴퓨팅 장치는 또한 하나 이상의 입출력 장치를 위한 인터페이스를 제공하는 하나 이상의 입출력 인터 페이스 및 하나 이상의 네트워크 통신 인터페이스를 포함할 수 있다. 입출력 인터페이스 및 네트워 크 통신 인터페이스는 통신 버스에 연결된다. 입출력 장치는 입출력 인터페이스를 통해 컴퓨팅 장치의 다른 컴포넌트들에 연결될 수 있다. 예시적인 입출력 장치는 포인팅 장치(마우스 또는 트랙패드 등), 키보드, 터치 입력 장치(터치패드 또는 터치스크린 등), 음성 또는 소리 입력 장치, 다양한 종류의 센서 장치 및/또는 촬영 장치와 같은 입력 장치, 및/또는 디스플레이 장치, 프린터, 스피커 및/또는 네트워크 카드와 같은 출력 장치를 포함할 수 있다. 예시적인 입출력 장치는 컴퓨팅 장치를 구성하는 일 컴포넌트로서 컴퓨팅 장치의 내부에 포함될 수도 있고, 컴퓨팅 장치와는 구별되는 별개의 장치로 컴퓨팅 장치와 연결될 수도 있다."}
{"patent_id": "10-2023-0103485", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상에서 대표적인 실시예를 통하여 본 발명에 대하여 상세하게 설명하였으나, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 전술한 실시예에 대하여 본 발명의 범주에서 벗어나지 않는 한도 내에서 다양한 변형 이 가능함을 이해할 것이다. 그러므로 본 발명의 권리범위는 설명된 실시예에 국한되어 정해져서는 안 되며, 후 술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2023-0103485", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 저온창고의 스마트 화재 조기탐지 시스템의 상세 구성을 나타낸 블록도 도 2는 본 발명의 일 실시예에 따른 저온창고의 예시 도 3은 본 발명의 제1 실시예에 따른 저온창고의 스마트 화재 조기탐지 방법을 설명하기 위한 흐름도 도 4는 본 발명의 제2 실시예에 따른 저온창고의 스마트 화재 조기탐지 방법을 설명하기 위한 흐름도 도 5는 예시적인 실시예들에서 사용되기에 적합한 컴퓨팅 장치를 포함하는 컴퓨팅 환경을 예시하여 설명하기 위 한 블록도"}
