{"patent_id": "10-2019-0090793", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0012672", "출원번호": "10-2019-0090793", "발명의 명칭": "인공지능 기반 로봇 매니퓰레이터의 자동 제어 시스템 및 방법", "출원인": "한국생산기술연구원", "발명자": "이상형"}}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "로봇의 작업수행 과정을 자동 제어하기 위한 인공지능 기반의 모델을 생성하는 방법에 있어서, 작업자의 작업수행정보를 입력받아 초기 동작모델을 생성하는 단계와,상기 생성한 초기 동작모델에 따라 로봇의 작업수행 중에 획득한 작업수행 영상, 로봇 배치정보 및 상기 초기동작모델의 로봇 제어신호를 학습 데이터로 입력받아 심층신경망을 학습시키는 단계와, 상기 학습된 심층신경망으로부터 출력된 로봇 제어신호를 입력받아 새로운 동작모델을 생성하는 단계와,강화학습에 의해 상기 새로운 동작모델을 최적화하는 단계를 포함하는 인공지능 기반의 모델 생성 방법."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 최적화된 동작모델에 따라 로봇의 작업수행 중에 획득한 작업수행 영상, 로봇 배치정보 및 상기 최적화된동작모델의 로봇 제어신호를 학습 데이터로 입력받아 상기 학습된 심층신경망을 다시 학습시키는 단계를 더 포함하는 것을 특징으로 하는 인공지능 기반의 모델 생성 방법."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 작업자의 작업수행정보는 작업자가 로봇을 잡고 지도하는 과정에서 생성된 로봇의 배치정보(로봇 조인트정보, 로봇의 손끝의 위치/자세, 속도, 가속도, 힘, 토크 등)인 것을 특징으로 하는 인공지능 기반의 모델 생성방법."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 새로운 동작모델을 최적화하는 단계는 상기 새로운 동작모델로부터 초기 정책을 생성하여 초기 정책에서보상함수를 계산하고, 보상함수로 초기 정책을 개선하여 개선된 정책을 생성하는 것을 특징으로 하는 인공지능기반의 모델 생성 방법."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 보상함수는 작업자의 작업수행에 따라 획득한 이미지로부터 구한 공간 벡터 값과 이후 동작모델에 의한 작업수행에 따라 획득한 이미지로부터 구한 공간 벡터 값의 평균 제곱근 오차(RMSE)가 최소가 되도록 설계되는 것을 특징으로 하는 인공지능 기반의 모델 생성 방법."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "인공지능 기반으로 로봇의 작업수행을 자동 제어하는 방법에 있어서, 작업자의 작업수행정보에 근거해 생성한 초기 동작모델에 따라 로봇의 작업수행 중에 획득한 데이터를 이용해심층신경망을 학습시키고, 심층신경망으로부터 출력된 로봇 제어신호에 근거해 생성한 동작모델을 강화학습에의해 최적화하여 최적화된 동작모델에 따라 로봇의 작업수행 중에 획득한 데이터를 이용해 심층신경망을 다시학습시켜 이러한 심층신경망이 적용된 제어장치가 카메라 영상 및 로봇의 배치정보를 입력받아 로봇의 제어신호를 출력하는 것을 특징으로 하는 인공지능 기반 자동 제어 방법."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2021-0012672-3-제6항에 있어서, 상기 작업자의 작업수행정보는 작업자가 로봇을 잡고 지도하는 과정에서 생성된 로봇의 배치정보(로봇 조인트정보, 로봇의 손끝의 위치/자세, 속도, 가속도, 힘, 토크 등)인 것을 특징으로 하는 인공지능 기반 자동 제어방법."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 심층신경망으로부터 출력된 로봇 제어신호에 근거해 생성한 동작모델로부터 초기 정책을 생성하여 초기 정책에서 보상함수를 계산하고, 보상함수로 초기 정책을 개선하여 개선된 정책을 생성하여 동작모델을 최적화하는것을 특징으로 하는 인공지능 기반 자동 제어 방법."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 보상함수는 작업자의 작업수행에 따라 획득한 이미지로부터 구한 공간 벡터 값과 이후 동작모델에 의한 작업수행에 따라 획득한 이미지로부터 구한 공간 벡터 값의 평균 제곱근 오차(RMSE)가 최소가 되도록 설계되는 것을 특징으로 하는 인공지능 기반 자동 제어 방법."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "작업을 수행하면서 로봇 배치정보를 출력하는 로봇 매니퓰레이터와, 상기 로봇 매니퓰레이터와 주변 환경을 촬영하여 작업수행 영상을 획득하는 카메라 모듈과,상기 로봇 매니퓰레이터의 로봇 배치정보 및 상기 카메라 모듈의 작업수행 영상을 입력받아 인공지능 기반 모델을 통해 분석하여 로봇 매니퓰레이터의 동작제어를 위한 로봇 제어신호를 출력하는 제어장치를 포함하는 인공지능 기반 로봇 매니퓰레이터의 자동 제어 시스템."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 제어장치에 적용되는 인공지능 기반 모델은 작업자의 작업수행정보에 근거해 생성한 초기 동작모델에 따라로봇 매니퓰레이터의 작업수행 중에 획득한 데이터를 이용해 심층신경망을 학습시키고, 심층신경망으로부터 출력된 로봇 제어신호에 근거해 생성한 동작모델을 강화학습에 의해 최적화하여 최적화된 동작모델에 따라 로봇매니퓰레이터의 작업수행 중에 획득한 데이터를 이용해 심층신경망을 다시 학습시켜 생성하는 것을 특징으로 하는 인공지능 기반 로봇 매니퓰레이터의 자동 제어 시스템."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 작업자의 작업수행정보는 작업자가 로봇을 잡고 지도하는 과정에서 생성된 로봇의 배치정보(로봇 조인트정보, 로봇의 손끝의 위치/자세, 속도, 가속도, 힘, 토크 등)인 것을 특징으로 하는 인공지능 기반 로봇 매니퓰레이터의 자동 제어 시스템."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 심층신경망으로부터 출력된 로봇 제어신호에 근거해 생성한 동작모델로부터 초기 정책을 생성하여 초기 정책에서 보상함수를 계산하고, 보상함수로 초기 정책을 개선하여 개선된 정책을 생성하여 동작모델을 최적화하는것을 특징으로 하는 인공지능 기반 로봇 매니퓰레이터의 자동 제어 시스템."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,공개특허 10-2021-0012672-4-상기 보상함수는 작업자의 작업수행에 따라 획득한 이미지로부터 구한 공간 벡터 값과 이후 동작모델에 의한 작업수행에 따라 획득한 이미지로부터 구한 공간 벡터 값의 평균 제곱근 오차(RMSE)가 최소가 되도록 설계되는 것을 특징으로 하는 인공지능 기반 로봇 매니퓰레이터의 자동 제어 시스템."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "인공지능 기반으로 로봇의 작업수행을 자동 제어하는 제어장치에 있어서, 상기 제어장치는 로봇 매니퓰레이터의 로봇 배치정보 및 카메라 모듈의 작업수행 영상을 입력받아 인공지능 기반 모델을 통해 분석하여 로봇 매니퓰레이터의 동작제어를 위한 로봇 제어신호를 출력하며, 상기 인공지능 기반 모델은 작업자의 작업수행정보에 근거해 생성한 초기 동작모델에 따라 로봇의 작업수행 중에 획득한 데이터를 이용해 심층신경망을 학습시키고, 심층신경망으로부터 출력된 로봇 제어신호에 근거해 생성한 동작모델을 강화학습에 의해 최적화하여 최적화된 동작모델에 따라 로봇의 작업수행 중에 획득한 데이터를이용해 심층신경망을 다시 학습시켜 생성하는 것을 특징으로 하는 인공지능 기반 제어장치."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 작업자의 작업수행정보는 작업자가 로봇을 잡고 지도하는 과정에서 생성된 로봇의 배치정보(로봇 조인트정보, 로봇의 손끝의 위치/자세, 속도, 가속도, 힘, 토크 등)인 것을 특징으로 하는 인공지능 기반 제어장치."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서, 상기 심층신경망으로부터 출력된 로봇 제어신호에 근거해 생성한 동작모델로부터 초기 정책을 생성하여 초기 정책에서 보상함수를 계산하고, 보상함수로 초기 정책을 개선하여 개선된 정책을 생성하여 동작모델을 최적화하는것을 특징으로 하는 인공지능 기반 제어장치."}
{"patent_id": "10-2019-0090793", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 보상함수는 작업자의 작업수행에 따라 획득한 이미지로부터 구한 공간 벡터 값과 이후 동작모델에 의한 작업수행에 따라 획득한 이미지로부터 구한 공간 벡터 값의 평균 제곱근 오차(RMSE)가 최소가 되도록 설계되는 것을 특징으로 하는 인공지능 기반 제어장치."}
{"patent_id": "10-2019-0090793", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 로봇 매니퓰레이터의 자동 제어 기술에 관한 것으로서, 상세하게는 강화학습을 통해 최적화된 동작모 델에 근거해 인공신경망을 학습시켜 만든 인공지능 기반의 모델을 이용하여 로봇 매니퓰레이터의 작업수행 과정 을 자동 제어하는 시스템 및 방법에 관한 것이다. 이를 위해, 본 발명에 따른 인공지능 기반의 모델 생성 방법은, 로봇의 작업수행 과정을 자동 제어하기 위한 인공지능 기반의 모델을 생성하는 방법으로서, 작업자의 작 업수행정보를 입력받아 초기 동작모델을 생성하는 단계와, 상기 생성한 초기 동작모델에 따라 로봇의 작업수행 중에 획득한 작업수행 영상, 로봇 배치정보 및 상기 초기 동작모델의 로봇 제어신호를 학습 데이터로 입력받아 심층신경망을 학습시키는 단계와, 상기 학습된 심층신경망으로부터 출력된 로봇 제어신호를 입력받아 새로운 동 작모델을 생성하는 단계와, 강화학습에 의해 상기 새로운 동작모델을 최적화하는 단계를 포함한다."}
{"patent_id": "10-2019-0090793", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 로봇 매니퓰레이터의 자동 제어 기술에 관한 것으로서, 상세하게는 강화학습을 통해 최적화된 동작모 델에 근거해 인공신경망을 학습시켜 만든 인공지능 기반의 모델을 이용하여 로봇 매니퓰레이터의 작업수행 과정 을 자동 제어하는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2019-0090793", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 공장이 확산 보급됨에 따라 로봇 매니퓰레이터의 필요성이 증가하고 있으나, 다품종 소량 생산 체제로 점차 변화되면서 로봇 매니퓰레이터의 활용에 있어서 문제가 발생하고 있다. 현재 로봇 전문가가 로봇 매니퓰레이터의 작업 프로그램을 생성하고 있는데, 로봇 작업에 변화가 생기면 다시 별도의 프로그램을 만들어야 하는 불편함이 있다. 종래 로봇 매니퓰레이터의 작업 소프트웨어를 제작하기 위해서는 먼저 로봇 전문가가 수행작업을 분석한 후, 로 봇 매니퓰레이터의 작업 수행을 위한 인식 프로그램 및 조작 제어 프로그램을 제작한다. 그리고 여기에서 끝나 는 것이 아니라 제작한 프로그램을 현장에 설치할 때 작업 수행을 위한 파라미터 튜닝 작업을 해야 한다. 특히 로봇 매니퓰레이터가 이종 작업을 수행하는 경우 상기 단계를 반복적으로 수행해야 하므로 막대한 시간과 비용이 소요되는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 미국등록특허 제10235192호"}
{"patent_id": "10-2019-0090793", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위해 창안된 것으로서, 본 발명의 목적은 로봇 매니퓰레이터의 작업 수행을 위한 소프트웨어를 적은 시간과 비용으로 제작하는 것이다. 본 발명의 다른 목적은 로봇 매니퓰레이터의 작업 프로그램을 현장에 설치할 때 파라미터 튜닝 등의 수작업을 해야 하는 번거로움 없이 간단하고 편리하게 로봇 매니퓰레이터의 작업 소프트웨어를 설치하는 것이다."}
{"patent_id": "10-2019-0090793", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이를 위해, 본 발명에 따른 인공지능 기반의 모델 생성 방법은, 로봇의 작업수행 과정을 자동 제어하기 위한 인 공지능 기반의 모델을 생성하는 방법으로서, 작업자의 작업수행정보를 입력받아 초기 동작모델을 생성하는 단계와, 상기 생성한 초기 동작모델에 따라 로봇의 작업수행 중에 획득한 작업수행 영상, 로봇 배치정보 및 상기 초기 동작모델의 로봇 제어신호를 학습 데이터로 입력받아 심층신경망을 학습시키는 단계와, 상기 학습된 심층신경망으로부터 출력된 로봇 제어신호를 입력받아 새로운 동작모델을 생성하는 단계와, 강화학습에 의해 상기 새로운 동작모델을 최적화하는 단계를 포함한다. 또한, 본 발명에 따른 인공지능 기반 자동 제어 방법은, 인공지능 기반으로 로봇의 작업수행을 자동 제어하는 방법으로서, 작업자의 작업수행정보에 근거해 생성한 초기 동작모델에 따라 로봇의 작업수행 중에 획득한 데이터를 이용해 심층신경망을 학습시키고, 심층신경망으로부터 출력된 로봇 제어신호에 근거해 생성한 동작모델을 강화학습에 의해 최적화하여 최적화된 동작모델에 따라 로봇의 작업수행 중에 획득한 데이터를 이용해 심층신경망을 다시 학습시켜 이러한 심층신경망이 적용된 제어장치가 카메라 영상 및 로봇의 배치정보를 입력받아 로봇의 제어신호 를 출력하는 것을 특징으로 한다. 또한, 본 발명에 따른 인공지능 기반 로봇 매니퓰레이터의 자동 제어 시스템은 작업을 수행하면서 로봇 배치정 보를 출력하는 로봇 매니퓰레이터와, 상기 로봇 매니퓰레이터와 주변 환경을 촬영하여 작업수행 영상을 획득하는 카메라 모듈과, 상기 로봇 매니퓰레이터의 로봇 배치정보 및 상기 카메라 모듈의 작업수행 영상을 입력받아 인공지능 기반 모델 을 통해 분석하여 로봇 매니퓰레이터의 동작제어를 위한 로봇 제어신호를 출력하는 제어장치를 포함한다. 또한, 본 발명에 따른 인공지능 기반 제어 장치는, 인공지능 기반으로 로봇의 작업수행을 자동 제어하는 제어장 치로서, 상기 제어장치는 로봇 매니퓰레이터의 로봇 배치정보 및 카메라 모듈의 작업수행 영상을 입력받아 인공지능 기 반 모델을 통해 분석하여 로봇 매니퓰레이터의 동작제어를 위한 로봇 제어신호를 출력하며, 상기 인공지능 기반 모델은 작업자의 작업수행정보에 근거해 생성한 초기 동작모델에 따라 로봇의 작업수행 중 에 획득한 데이터를 이용해 심층신경망을 학습시키고, 심층신경망으로부터 출력된 로봇 제어신호에 근거해 생성 한 동작모델을 강화학습에 의해 최적화하여 최적화된 동작모델에 따라 로봇의 작업수행 중에 획득한 데이터를 이용해 심층신경망을 다시 학습시켜 생성하는 것을 특징으로 한다."}
{"patent_id": "10-2019-0090793", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이, 본 발명은 인간 작업자의 수행작업을 모방학습을 통해 모델링한 후 인공신경망 학습 및 강화 학습을 이용함으로써 인공지능 기반의 로봇 매니퓰레이터의 동작 제어 소프트웨어를 제작할 수 있기 때문에, 종 래의 로봇 매니퓰레이터의 인식/조작 소프트웨어 제작 방식과 비교할 때 제작 시간과 비용을 상당히 감소시킬 수 있는 효과가 있다."}
{"patent_id": "10-2019-0090793", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명에 따른 실시예를 상세하게 설명한다. 본 발명의 구성 및 그에 따른 작용 효과는 이하의 상세한 설명을 통해 명확하게 이해될 것이다. 도 1은 본 발명에 따른 인공지능 기반 로봇 매니퓰레이터 제어 시스템의 개략적 구성을 나타낸 것이다. 도 1을 참조하면, 본 발명에 따른 인공지능 기반 로봇 매니퓰레이터 제어 시스템(이하, 로봇 제어 시스템)은 복 수의 카메라, 로봇 매니퓰레이터 및 제어장치로 구성된다. 복수의 카메라가 로봇 매니퓰레이터와 주변 환경을 촬영하여 작업수행 영상을 획득한다. 로봇 매니퓰레이터는 제어장치의 제어명령에 따라 작업을 수행하면서 로봇의 배치정보를 생성한다. 로 봇의 배치정보는 로봇 조인트 정보, 로봇의 손끝의 위치/자세, 속도, 가속도, 힘, 토크 등을 포함한다. 제어장치는 복수의 카메라로부터 입력받은 작업수행 영상과 로봇 매니퓰레이터로부터 입력받은 로 봇의 배치정보를 인공지능 기반으로 분석하여 로봇 매니퓰레이터의 동작 제어를 위한 제어신호를 출력한다. 제어장치는 하드웨어 및 소프트웨어로 구성되어 있으며, 로봇 매니퓰레이터의 동작 제어를 위한 소프트 웨어는 인공지능 기반으로 학습된 모델이다. 도 2는 본 발명에 따른 로봇 매니퓰레이터의 동작 제어를 위한 인공지능 기반 모델을 생성하는 과정을 나타낸 것이다. 도 2를 참조하면, 먼저 인간 작업자의 작업수행정보(human demonstration)를 입력받아 초기 동작모델을 생성한 다(S10). 인간 작업자의 작업수행정보는 작업자가 로봇을 잡고 지도(시연)하는 과정에서 생성된 로봇의 배치정보(로봇 조 인트 정보, 로봇의 손끝의 위치/자세, 속도, 가속도, 힘, 토크 등)를 말한다. 다음, 상기 생성한 초기 동작모델에 따라 로봇이 작업을 수행하게 되고(S12), 로봇의 작업 수행이 완료되면 초 기 동작모델에 따라 로봇의 작업수행 중에 획득한 작업수행 영상, 로봇 배치정보 및 초기 동작모델의 로봇 제어 신호를 학습 데이터로 입력받아 심층신경망을 학습시킨다(S14). 다음, 상기 학습된 심층신경망으로부터 출력된 로봇 제어신호(로봇 경로)를 입력받아 새로운 동작모델을 생성한 다(S16) 이후 강화학습(reinforcement learning)에 의해 상기 새로운 동작모델을 최적화하는 단계를 수행한다(S18). 최적화 단계에서는 새로운 동작모델로부터 초기 정책을 생성하고 초기 정책에서 보상함수를 계산하고, 보상함수 로 초기 정책을 개선하여 개선된 정책을 생성하고 개선된 정책에서 다시 보상함수를 계산하여 정책을 개선하는과정을 반복함으로써 동작모델의 정책을 최적화한다. 이와 같은 방법으로 동작모델이 최적화되면 최적화된 동작모델에 따라 로봇을 동작시키고(S20), 로봇의 작업 수행이 완료되면 최적화된 동작모델에 따라 로봇의 작업수행 중에 획득한 작업수행 영상, 로봇 배치정보 및 최 적화된 동작모델의 로봇 제어신호(로봇 경로)를 학습 데이터로 입력받아 학습된 심층신경망을 다시 학습시킨다 (S22). 이렇게 심층신경망의 학습이 종료되면 최종 학습된 심층신경망을 로봇 매니퓰레이터의 제어장치에 적용한다. 제어장치는 로봇 매니퓰레이터의 로봇 배치정보 및 카메라 모듈의 작업수행 영상을 입력받고 심 층신경망의 인공지능 기반 모델을 통해 이를 분석하여 로봇 매니퓰레이터의 동작제어를 위한 로봇 제어신호를 출력한다. 도 3은 본 발명에 따른 강화학습을 통해 동작모델을 최적화하는 것을 나타내고, 도 4는 강화학습에서 보상함수 로 정책을 개선하는 과정을 나타내고 있다. 도 2에서 설명한 바와 같이, 심층신경망의 로봇 제어신호를 이용해 동작모델이 생성되면 이 동작모델을 최적화 하게 된다. 동작모델은 강화학습을 통해 최적화되는데, 강화학습의 보상함수를 사용해 지속적으로 동작모델의 정책이 개선 되면서 최적화된다. 도 3을 참조하면, 동작모델의 초기 정책 파라미터로부터 보상함수를 계산하고, 보상함수가 최대화되는 정책 파 라미터를 결정하여 정책 파라미터를 개선하면, 이 개선된 정책 파라미터로부터 다시 보상함수를 계산하고 다시 계산된 보상함수로 정책 파라미터를 개선하는 과정을 반복하게 된다. 도 4를 참조하면, 초기 정책 π0에서 보상함수 r0을 계산한다. 다음, 보상함수 r0으로 π0을 개선하여 π1을 생성 한다. rt로 πt를 개선하여 πt+1이라고 한다. 각 단계에서 개선된 양이 ㅿ라고 하면, ㅿ이 임계치 ε 이하가 될 때까지 정책 개선을 반복한 후, ㅿ이 ε 이하가 되면 정책 개선을 중단하여 그 때의 정책이 최적의 정책(^π)이 된다. 강화학습에 사용되는 보상함수는 처음 인간 작업자의 작업수행(로봇 시연)에 따라 획득한 이미지로부터 구한 공 간 벡터 값과 이후 동작모델에 의한 작업수행에 따라 획득한 이미지로부터 구한 공간 벡터 값의 평균 제곱근 오 차(RMSE)가 최소가 되도록 설계된다. 이를 구체적으로 설명하면, 먼저 작업자의 작업수행으로부터 정답이 되는 상황의 이미지를 획득한다. 강화학습 에 의해 동작모델을 최적화시키기 위해서는 가장 빠른 시간 안에 정답 이미지와 동일한 상황의 이미지를 얻을 수 있도록 보상함수가 디자인되어야 한다. 보상함수는 두 개의 항목으로 구성된다. 두 개의 항목은 각각 로봇이 정답 이미지에 도달하는 스텝을 측정하는 항목(즉, 빨리 도착하면 보상을 크게 받음)과 정답 이미지에 도달했는지를 측정하는 항목(즉, 정답 이미지와 유 사하면 보상을 크게 받음)이다. 정답 이미지에 도달했는지를 평가할 때 이미지의 각 픽셀을 비교하는 것은 적합한 방법이 아니다. 왜냐하면, 이 미지의 각 픽셀을 비교하는 것은 계산하는 차원이 매우 높고, 로봇이 원하는 일을 완수한 정답의 상황에 도달했 다고 하더라도 주변 배경이 달라지는 경우 그것이 정답인지 측정하기 어렵기 때문이다. 따라서 본 발명에서는 정답 이미지를 VAE(Variational AutoEncoder)를 사용하여 VAE 공간(latent space) 벡 터로 변환시킨다. 즉, 본 발명의 실시예에서는 정답 이미지를 1024 차원의 VAE 공간 벡터로 인코딩(encoding) 하였다. 동작모델에 의한 작업수행 이미지로부터 얻은 VAE 공간 벡터와 정답 이미지의 VAE 공간 벡터의 RMSE(Root Means Square Error) 값이 줄어들면 동작모델 이미지가 정답 이미지와 유사해지는 것이라고 볼 수 있다. 이와 같이, VAE 공간 벡터를 상호 비교하는 것은 각 픽셀을 비교해야 하는 고차원의 계산 문제를 해결하지만, 주변 배경이 달라져 정답 여부를 측정하기 어려운 문제는 해결하기 어렵다. 따라서, 특정 벡터만을 추출한 후 그 특정 벡터만 비교하는 것이 필요하다. 이 벡터들은 전체 이미지에서 로봇 이 수행하는 태스크와 관련된 부분을 나타내는 벡터와 그와 관련없는 배경이 되는 부분을 나타내는 벡터로 나눌수 있다. 본 발명에서는 이 특정 벡터를 추출하기 위해 VAE의 평균(mean)과 표준편차(standard deviation)을 사용한다. 이를 위해 우선 정답이 되는 이미지들(로봇이 수행하는 태스크와 관련된 이미지들)을 모아 벡터를 계 산하고, 각 벡터들의 표준편차를 계산한다. 그 다음 정답이 아닌 이미지들(배경과 관련된 이미지들)을 모아 벡 터를 계산하고, 각 벡터들의 표준편차를 계산한다. 그리고 이 두 개 부류 벡터들 사이의 평균 값이 멀고 편차가 겹치지 않는 벡터들만 사용하여 보상함수 계산에 이용한다."}
{"patent_id": "10-2019-0090793", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상의 설명은 본 발명을 예시적으로 설명한 것에 불과하며, 본 발명이 속하는 기술 분야에서 통상의 지식을 가 진 자에 의해 본 발명의 기술적 사상에서 벗어나지 않는 범위에서 다양한 변형이 가능할 것이다. 따라서 본 발명의 명세서에 개시된 실시예들은 본 발명을 한정하는 것이 아니다. 본 발명의 범위는 아래의 특허 청구범위에 의해 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술도 본 발명의 범위에 포함되는 것으로 해석해야 할 것이다."}
{"patent_id": "10-2019-0090793", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 인공지능 기반 로봇 매니퓰레이터의 동작 제어 시스템의 개략적인 구성도. 도 2는 본 발명에 따른 로봇 매니퓰레이터의 동작 제어를 위한 인공지능 기반 모델을 생성하는 과정을 나타낸 순서도. 도 3은 본 발명에 따른 강화학습을 통해 동작모델을 최적화하는 것을 나타낸 도면. 도 4는 본 발명에 따른 강화학습에서 보상함수로 정책을 개선하는 과정을 나타낸 도면."}
