{"patent_id": "10-2020-0149315", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0063453", "출원번호": "10-2020-0149315", "발명의 명칭": "지능형 자동차의 양방향 직류/직류 전력 변환 장치를 포함하는 전력 변환 시스템 및 그 방열", "출원인": "대영전자 주식회사", "발명자": "김남주"}}
{"patent_id": "10-2020-0149315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "12V와 48V 배터리 사이를 양방향으로 직류/직류 전력 변환하는 것이 가능한 지능형 자동차의 양방향 직류/직류전력 변환장치를 포함하는 전력 변환 시스템으로서, 상기 전력 변환장치는, 복수 개의 단일 모듈 및 상기 복수 개의 단일 모듈을 전력제어하고, 자체 진단 및 보호하는 기능을 가지며, 상기 단일 모듈은, 상기 지능형 자동차 내에 오디오, 헤드램프, 및 소형 모터류를 포함한 전장 부품에 전력을공급하는 12V의 제 1 배터리부; 보조 전기동력 시스템에 전력을 공급하는 48V의 제 2 배터리부; 상기 제 1 배터리부 및 상기 제 2 배터리부 사이에 위치하여 양방향으로 직류/직류 전력 변환하는 양방향 직류/직류 전력 변환부; 및 상기 단일 모듈의 방열을 돕는 복수 개의 단일모듈용 방열 케이스부를 포함하고, 상기 복수 개의 단일모듈용 방열 케이스는, 인접한 단일모듈용 방열 케이스를 연결하여 상기 단일 모듈 간에 물리적으로, 그리고 전기적으로 결합될 수 있도록 하며, 각각의 단일모듈용 방열 케이스가 전체 방열 케이스부를만드는 것을 특징으로 하는, 지능형 자동차의 양방향 직류/직류 전력 변환 장치를 포함하는 전력 변환 시스템."}
{"patent_id": "10-2020-0149315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 방열 케이스는 인접한 단일 모듈 간에 슬라이딩 결합되면서 물리적으로 그리고 전기적으로 결합되어 다중방열 케이스를 형성하는 것을 특징으로 하는, 지능형 자동차의 양방향 직류/직류 전력 변환 장치를 포함하는 전력 변환 시스템."}
{"patent_id": "10-2020-0149315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항 또는 제 2 항에 기재된 지능형 자동차의 양방향 직류/직류 전력 변환장치를 포함하는 전력 변환 시스템의 다중 방열 케이스로서, 상기 단일모듈용 방열 케이스의 일측에는 제 1 슬라이딩 구조가 있고, 상기 단일모듈용 방열 케이스의 타측에는제 2 슬라이딩 구조를 포함하여, 상기 제 1 슬라이딩 구조 및 상기 제 2 슬라이딩 구조는 서로 슬라이딩 결합되면서 물리적으로 서로 결합되는 동시에, 완전히 슬라이딩 결합이 완료되면 상기 단일모듈용 방열 케이스 내에지지되고 있는 상기 인접하는 단일모듈도 전기적으로도 서로 접속이 되는 구조인 것을 특징으로 하는, 지능형 자동차의 양방향 직류/직류 전력 변환장치를 포함하는 전력 변환 시스템의 다중 방열 케이스."}
{"patent_id": "10-2020-0149315", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 12V와 48V 배터리 사이를 양방향으로 직류/직류 전력 변환하는 것이 가능한 지능형 자동차의 양방향 직류/직류 전력 변환장치를 포함하는 전력 변환 시스템으로서, 상기 전력 변환장치는, 복수 개의 단일 모듈 및 상기 복수 개의 단일 모듈을 전력제어하고, 자체 진단 및 보호하는 기능을 가지며, 상기 단일 모듈은, 상기 지능 (뒷면에 계속)"}
{"patent_id": "10-2020-0149315", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지능형 자동차의 양방향 직류 및 직류 전력변환기를 포함하는 전력 변환 시스템, 및 그 방열 케이스 에 관한 것으로, 좀 더 구체적으로는, 전력 변환장치는, 복수 개의 단일 모듈 및 상기 복수 개의 단일 모듈을 전력제어하고, 자체 진단 및 보호하는 기능을 가지며, 단일 모듈은, 지능형 자동차 내에 오디오, 헤드램프, 및 소형 모터류를 포함한 전장 부품에 전력을 공급하는 12V의 제 1 배터리부; 보조 전기동력 시스템에 전력을 공급하는 48V의 제 2 배터리부; 상기 제 1 배터리부 및 상기 제 2 배터리부 사이에 위치하여 양방향으로 직류/직류 전력 변환하는 양방향 직류/직류 전력 변환부; 및 상기 단일 모듈의 방열을 돕는 복수 개의 단일모듈용 방열 케 이스부를 포함하고, 복수 개의 단일모듈용 방열 케이스는, 인접한 단일모듈용 방열 케이스를 연결하여 상기 단 일 모듈 간에 물리적으로, 그리고 전기적으로 결합될 수 있도록 하며, 각각의 단일모듈용 방열 케이스가 전체 방열 케이스부를 만드는, 지능형 자동차의 양방향 직류/직류 전력 변환 장치를 포함하는 전력 변환 시스템 및 그 방열 케이스에 관한 것이다."}
{"patent_id": "10-2020-0149315", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전기차(Electric Vehicle)는 동력원으로서 화석연료를 이용하는 자동차와는 달리 동력원으로서 전기를 이용하기 때문에 환경 오염과 에너지 절약 등과 같은 장점을 가지고 있으며, 그래서, 최근에 이슈가 되고 있다. 바야흐로 내연기관의 시대는 저물고, 급격히 전기차 또는 수소차의 시장이 열리고 있는 상황이다. 미국 전기차 업체 테슬라의 창업자이자 최고경영자인 일론 머스크는 2020년 50만대 수준이었던 테슬라의 전기차 생산량을 10 년 뒤에는 연간 2000만대 수준으로 늘어날 것으로 예측하고 있다. 종래 전장부품의 배터리 시스템과 관련한 특허문헌으로서는, 대한민국 등록특허 제10-1864483호(2018.05.29. 등 록, 발명의 명칭 : 전기차 배터리 교환시스템 및 방법)에서 \"전기차 배터리 충전소에 구비되며, 교체형 전기차 배터리를 충전하고 상기 교체형 전기차 배터리의 배터리 정보를 상기 교체형 전기차 배터리에 구비된 NFC(near field communication) 메모리로부터 독출하여 송신하는 전기차 배터리 충전 장치; 전기차에 구비되며, 상기 전 기차 배터리 충전 장치에 의해 충전된 교체형 전기차 배터리가 장착되며, 상기 전기차의 차량 정보를 상기 NFC 메모리에 자동 저장하는 전기차 배터리 랙(rack); 상기 전기차 배터리 충전 장치로부터 상기 교체형 전기차 배 터리의 배터리 정보를 수신하고, 수신된 배터리 정보를 이용하여 상기 교체형 전기차 배터리의 관리 정보를 생 성하는 전기차 배터리 관리 서버를 구성한다. 상술한 전기차 배터리 교환 시스템 및 방법에 의하면, 교체형 전 기차 배터리를 이용하여 별도의 충전 시간을 소모하지 않고 간단하게 배터리 교체만으로 쉽게 전기차를 운행시 킬 수 있는 효과가 있다. 더군다나 교체형 전기차 배터리와 이를 장착한 전기차를 NFC 메모리를 이용하여 교체 형 전기차 배터리 관리 서버에서 관리할 수 있도록 구성됨으로써, 교체형 전기차 배터리의 수명과 그 사용 이력 을 관리하여 배터리를 안전하게 사용하고 수명이 된 적시에 폐기시킬 수 있는 효과가 있다\"고 하는 전기차 배터 리 시스템에 대해서 개시되어 있다. 또 다른 배터리 시스템과 관련한 특허문헌으로서는, 대한민국 공개특허 제10-2019-060367호(2019.06.03. 공개, 발명의 명칭 : 전기차 배터리 충전 상태 모니터링 장치)에서 \"본 발명은 전기차 배터리의 충전 상태를 실시간 모니터링할 수 있음으로 인해 전기차 운전자가 차량 옆에서 대기해야 하는 비효율적 문제를 해소할 수 있는 전 기차 배터리 충전 상태 모니터링 장치를 개시한다. 개시된 본 발명의 실시 예에 따른 전기차 배터리 충전 상태 모니터링 장치는, 전기차 배터리 충전 상태를 모니터링 하기 위한 프로그램이 탑재되며 배터리 충전 상태를 실 시간으로 표시하는 사용자 단말기와, 전기차에 설치되며 입력된 배터리 정보를 연산하여 전기차 배터리 충 전 상태를 저장하는 전자제어기기(Electronic Control Unit; 20)와, 사용자 단말기 및 전자제어기기와 통신망으로 연결되며 배터리의 정보를 수집하여 전자제어기기에 입력하고 사용자 단말기에 배터리의 충 전 상태가 실시간 표시되도록 전자제어기기로부터 전기차 배터리의 충전 상태를 제공받아 사용자 단말기 에 전송하는 배터리 정보 수집기를 포함할 수 있다\"고 하는 전기차 배터리 시스템에 대해서 개시되어 있다. 하지만, 상술한 바와 같이 최근 전기차 시장의 성장에도 불구하고, 전기자동차 등의 자동차 내 전장품의 증가로 인한 전력 부족으로 인해 단일모듈의 베터리 시스템에는 여러 가지 문제가 지적되고 있는 실정이다. 나아가, 전압 레벨이 다른 두 배터리 사이에서 양방향으로 전력을 전송할 수 있으며, 강압기능, 양방향 전력전 송, 전력제어 기능, 자체 진단 및 보호 기능을 갖는 고효율, 고전력 밀도가 갖는 다모듈 배터리 시스템에 대해 서는 전혀 개시된 바가 없었다. 선행기술문헌 특허문헌(특허문헌 0001) 대한민국 등록특허 제10-1864483호(2018.05.29. 등록, 발명의 명칭 : 전기차 배터리 교환시스 템 및 방법) (특허문헌 0002) 대한민국 공개특허 제10-2019-060367호(2019.06.03. 공개, 발명의 명칭 : 전기차 배터리 충전 상태 모니터링 장치)"}
{"patent_id": "10-2020-0149315", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위하여 창출된 것으로, 본 발명의 목적은, 본 발명은 전압 레벨이 다른 두 배터리 사이에서 양방향으로 전력을 전송할 수 있으며, 강압기능, 양방향 전력전송, 전력제어 기능, 자체 진단 및 보호 기능을 갖는 고효율, 고전력 밀도가 갖는 다모듈 배터리 시스템을 제공하는 것을 목적으로 한다. 구체적으로, 지능형 자동차 내에 오디오, 헤드램프, 및 소형 모터류 등을 포함한 전장 부품에 전력을 공급하는 12V의 제 1 배터리부, 보조 전기동력 시스템에 전력을 공급하는 48V의 제 2 배터리부, 이와 같은 제 1 배터리부 및 제 2 배터리부 사이에 위치하여 양방향으로 직류/직류 전력 변환하는 양방향 직류/직류 전력 변환부와, 단일 모듈의 방열을 돕는 방열 케이스부를 포함하는, 지능형 자동차의 양방향 직류/직류 전력 변환 장치를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2020-0149315", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위한 본 발명의 일 실시예에 따른 지능형 자동차의 양방향 직류/직류 전력 변환 장치를 포함하는 전력 변환 시스템은, 12V와 48V 배터리 사이를 양방향으로 직류/직류 전력 변환하는 것이 가능한 지능 형 자동차의 양방향 직류/직류 전력 변환장치를 포함하는 전력 변환 시스템으로서, 상기 전력 변환장치는, 복수 개의 단일 모듈 및 상기 복수 개의 단일 모듈을 전력제어하고, 자체 진단 및 보호하는 기능을 가지며, 상기 단 일 모듈은, 상기 지능형 자동차 내에 오디오, 헤드램프, 및 소형 모터류를 포함한 전장 부품에 전력을 공급하는 12V의 제 1 배터리부; 보조 전기동력 시스템에 전력을 공급하는 48V의 제 2 배터리부; 상기 제 1 배터리부 및 상기 제 2 배터리부 사이에 위치하여 양방향으로 직류/직류 전력 변환하는 양방향 직류/직류 전력 변환부; 및 상기 단일 모듈의 방열을 돕는 복수 개의 단일모듈용 방열 케이스부를 포함하고, 상기 복수 개의 단일모듈용 방 열 케이스는, 인접한 단일모듈용 방열 케이스를 연결하여 상기 단일 모듈 간에 물리적으로, 그리고 전기적으로 결합될 수 있도록 하며, 각각의 단일모듈용 방열 케이스가 전체 방열 케이스부를 만든다. 또한, 상기 방열 케이스는 인접한 단일 모듈 간에 슬라이딩 결합되면서 서로 물리적으로 그리고 전기적으로 결 합되어 다중 방열 케이스를 형성한다. 한편, 본 발명의 또 다른 실시예에 따른, 상술한 지능형 자동차의 양방향 직류/직류 전력 변환장치를 포함하는 전력 변환 시스템의 다중 방열 케이스는, 상기 단일모듈용 방열 케이스의 일측에는 제 1 슬라이딩 구조가 있고, 상기 단일모듈용 방열 케이스의 타측에는 제 2 슬라이딩 구조를 포함하여, 상기 제 1 슬라이딩 구조 및 상기 제 2 슬라이딩 구조는 서로 슬라이딩 결합되면서 물리적으로 서로 결합되는 동시에, 완전히 슬라이딩 결합이 완료 되면 상기 단일모듈용 방열 케이스 내에 지지되고 있는 상기 인접하는 단일모듈도 전기적으로도 서로 접속이 되 는 구조이다."}
{"patent_id": "10-2020-0149315", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 지능형 자동차의 양방향 직류/직류 전력 변환장치에 의하면, 첫째, 12V와 48V 배터리 사이를 양방향으로 직류/직류 전력 변환하는 것이 가능하다. 둘째, 전력변환장치는, 복수 개의 단일 모듈 및 이 복수 개의 단일 모듈을 전력제어하고, 자체 진단 및 보호하 는 기능을 갖는다. 셋째, 각 단일 모듈의 방열을 돕는 방열 케이스를 포함하고, 복수 개의 단일 모듈은, 인접한 단일 모듈 간에 물 리적으로, 그리고 전기적으로 결합되어 전체 방열 케이스를 만드는 구성으로, 방열도 하면서, 단일 모듈의 전기 적, 물리적 결합을 도와준다."}
{"patent_id": "10-2020-0149315", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하면서 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 이에 앞서, 본 명 세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 아니 되며, 발 명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙 에 입각하여, 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서, 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시예에 불과할 뿐이 고 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양 한 균등물과 변형예들이 있을 수 있음을 이해하여야 한다. 최근 정부의 4차 산업기술 활성화 전략으로 인해 국내 산업 및 시장은 크게 변화하고 있으며 인공지능, 빅데이 터, 5G, 스마트 가전, 지능형 자동차 등에 대한 기술은 큰 관심사가 되고 있다. 자동차 산업분야는 환경문제로 인해 친환경 자동차인 PHEV, EV, FCEV에 대한 기술개발 및 개발된 자동차를 시장 에서 선보이고 있으며, 기존의 전력 기반 자동차 통신을 기반으로 ICT를 통합한 커넥티드 자동차(connected vehicle), 인공지능 알고리즘을 적용한 자율주행 자동차(self driving EV) 시장이 성장하고 있다. 이러한 국내 기술 및 시장 동향으로 인해 차량의 전장품화는 갈수록 가속화되고 있으며, 차량에 요구되는 전력 의 증가로 인해 12V 배터리 시스템의 한계에 도달하고 있어 48V 배터리 시스템으로 변화하는 추세이다. 도 2는 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기가 실제로 사용되는 적용 예시를 나타낸 도 면이다. 도 2에 도시된 것처럼, 48V와 12V사이를 연결하여 전력변환한다. 본 발명에서는, 48V 배터리 시스템으로의 전환은 많은 개발 비용과 시간 요구되므로, 12V 배터리와 48V 배터리 를 모두 적용한 듀얼 배터리 시스템에 대한 것이다. 도 1에 도시된 것처럼, 양방향 직류 및 직류 전력변환기 적용 다모듈 방열 케이스를 제공한다. 즉, 도 1에는, 12V와 48V 배터리 사이를 양방향으로 직류/직류 전력 변환하는 것이 가능한 지능형 자동차의 양방향 직류/직류 전력 변환장치가 도시되어 있다. 전력 변환장치는, 복수 개의 단일 모듈과, 이와 같은 복수 개의 단일 모듈을 전력제어하고, 자체 진단 및 보호 하는 기능을 가진다. 도 1에 도시된 것처럼, 단일 모듈은, 지능형 자동차 내에 오디오, 헤드램프, 및 소형 모터류를 포함한 전장 부 품에 전력을 공급하는 12V의 제 1 배터리부와, 보조 전기동력 시스템에 전력을 공급하는 48V의 제 2 배터리부와, 이 제 1 배터리부 및 제 2 배터리부 사이에 위치하여 양방향으로 직류/직류 전력 변환하는 양방향 직류/직류 전력 변환부를 포함한다. 또한, 이와 같은 단일 모듈의 방열을 돕는 방열 케이스부를 포함하는데, 복수 개의 단일 모듈의 방열 케이스부 는, 인접한 단일 모듈 간에 물리적으로, 그리고 전기적으로 결합될 수 있도록 단일 모듈의 각각의 방열 케이스 부가 연결되어 구조를 형성하여 제공하다. 즉, 지능형 자동차의 양방향 직류/직류 전력 변환장치를 포함하는 전력 변환 시스템의 다중 방열 케이스는, 상 기 단일모듈용 방열 케이스의 일측에는 제 1 슬라이딩 구조가 있고, 상기 단일모듈용 방열 케이스의 타측에는 제 2 슬라이딩 구조를 포함하여, 상기 제 1 슬라이딩 구조 및 상기 제 2 슬라이딩 구조는 서로 슬라이딩 결합되 면서 물리적으로 서로 결합되는 동시에, 완전히 슬라이딩 결합이 완료되면 상기 단일모듈용 방열 케이스 내에 지지되고 있는 상기 인접하는 단일모듈도 전기적으로도 서로 접속이 되는 구조이다. 참고로, 도 3은 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기에서 단일모듈을 나타낸 도면이고, 도 4 내지 도 6은 도 3에서 도시된 단일모듈 4개를 서로 슬라이딩 결합한 것을 나타낸 도면으로, 도 4는 사시도 이고, 도 5는 정면도이고, 도 6은 저면도이다. 도 8은 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기에서 단일 모듈을 결합한 경우 회로도를 나 타낸 도면이다. 즉, 서로 인접하는 단일모듈이 각각 결합되어, 4개의 단일 모듈이 결합할 경우, 전체 회로도를 나타낸 것이다. 종래 양방향 전력변환 시스템은 비절연형의 다상 인터리브드 방식의 회로 방식을 채택하였다. 이 때, 1개 상의 회로 이상이 발생한 경우 전력변환 시스템 전체가 동작에 문제가 발생하는 단점을 가진다. 또한 전력이 다른 전 력변환시스템을 적용할 경우 매번 새로운 전력변환기를 개발하거나 유지/보수 관점에서 불리한 단점을 가지는데 반해서, 본 발명은 모듈화 및 자체 진단 보정이 가능한 지능형 제어를 사용한 양방향 전력변환 시스템을 개발하 였다. 도 7은 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기의 구조 해석 및 열해석을 나타낸 도면으로 방열 효과를 설명한다. 이상과 같이, 본 발명은 비록 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 이것에 의해 한정되지 않"}
{"patent_id": "10-2020-0149315", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "으며 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 본 발명의 기술 사상과 아래에 기재될 청구 범위의 균등 범위 내에서 다양한 수정 및 변형이 가능함은 물론이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2020-0149315", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기 적용 다모듈 방열 케이스를 개략적으로 나 타낸 도면이다. 도 2는 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기가 실제로 사용되는 적용 예시를 나타낸 도 면이다. 도 3은 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기에서 단일모듈을 나타낸 도면이다. 도 4는 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기에서 단일모듈을 슬라이딩 결합한 것이다. 도 5는 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기에서 단일모듈을 슬라이딩 결합한 것이다. 도 6은 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기에서 단일모듈을 슬라이딩 결합한 것이다. 도 7은 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기의 구조 해석 및 열해석을 나타낸 도면이다. 도 8은 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기에서 단일 모듈을 결합한 경우 회로도를 나 타낸 도면이다. 도 9는 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기에서 사용될 수 있는 디지털 제어기 제어 블록다이어그램의 일례이다. 도 10은 본 발명의 일 실시예에 따른 양방향 직류 및 직류 전력변환기에서 사용될 수 있는 디지털 제어기의 일 례이다."}
