{"patent_id": "10-2017-0132758", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0057507", "출원번호": "10-2017-0132758", "발명의 명칭": "음성을 이용하여 송금하는 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "유승학"}}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로그램이 저장되는 메모리; 음성을 수신하는 마이크로폰; 및 상기 적어도 하나의 프로그램을 실행함으로써 상기 음성에 따라 수신인에게 송금하는 적어도 하나의 프로세서를포함하고,상기 프로세서는,상기 수신된 음성을 분석하여 사용자의 송금 의도를 판단하는 단계;연락처 리스트에서 상기 수신인의 이름으로 저장된 연락처를 검색하는 단계;상기 수신인의 상기 이름, 상기 연락처를 상기 음성에 포함된 금액과 함께 은행 서버로 전송하는 단계;상기 은행 서버로부터 송금 내역을 수신하는 단계: 및상기 송금 내역을 승인하는 단계;를 실행하는 것을 특징으로 하는, 디바이스."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 사용자의 송금 의도를 판단하는 단계는,상기 사용자가 송금을 할 때 입력되는 음성을 통해 패턴을 학습하는 단계를 포함하는 것을 특징으로 하는, 디바이스."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 프로세서는,상기 마이크로폰에 입력된 음성이 상기 디바이스의 사용자인지 인증하는 단계를 더 실행하고,상기 마이크로폰에 입력된 음성이 상기 디바이스의 사용자일 때, 상기 사용자의 송금 의도를 판단하는 것을 특징으로 하는, 디바이스."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 프로세서는,상기 수신인의 계좌번호를 포함하는 상기 송금 내역을 표시하는 단계를 더 실행하는 것을 특징으로 하는, 디바이스."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 송금 내역을 승인하는 단계는,상기 사용자의 지문, 홍채 또는 음성을 이용하여 상기 송금 내역을 승인하는 것을 특징으로 하는, 디바이스.공개특허 10-2018-0057507-3-청구항 6 제1항에 있어서, 상기 송금 내역을 승인하는 단계는,상기 사용자가 착용하고 있는 웨어러블 디바이스로부터 수신된 정맥 패턴을 이용하여 상기 송금 내역을 승인하는 것을 특징으로 하는, 디바이스."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 사용자의 송금 의도를 판단하는 단계는,상기 수신된 음성을, 사용자의 송금 의도를 추정하도록 설정된 데이터 인식 모델에 적용하여 상기 사용자의 송금 의도를 판단하는 단계를 포함하는, 디바이스."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 데이터 인식 모델은,인공 지능 알고리즘에 기반하여, 학습 데이터로서 음성 또는 문자, 및 학습 엔티티를 이용하여 학습된모델이며,상기 학습 엔티티는 사용자 정보, 수신인 정보, 송금 금액 및 송금 명령어 중 적어도 하나를 포함하는 것을 특징으로 하는, 디바이스."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 사용자의 송금 의도를 판단하는 단계는,상기 수신된 음성을 상기 데이터 인식 모델의 적용한 결과로서 획득된 인식 엔티티에 기초하여 상기 사용자의송금 의도를 판단하는 단계를 포함하고,상기 인식 엔티티는 사용자 정보, 수신인 정보, 송금 금액 및 송금 명령어 중 적어도 하나를 포함하는, 디바이스."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "사용자의 음성을 수신하는 단계;상기 수신된 음성을 분석하여 사용자의 송금 의도를 판단하는 단계;연락처 리스트에서 상기 음성에 포함된 수신인의 이름으로 저장된 연락처를 검색하는 단계;상기 수신인의 상기 이름, 상기 연락처를 상기 음성에 포함된 금액과 함께 은행 서버로 전송하는 단계;상기 은행 서버로부터 송금 내역을 수신하는 단계: 및상기 송금 내역을 승인하는 단계;를 포함하는 송금 방법."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 사용자의 송금 의도를 판단하는 단계는,상기 사용자가 송금을 할 때 입력되는 음성을 통해 패턴을 학습하는 단계를 포함하는 것을 특징으로 하는, 송금공개특허 10-2018-0057507-4-방법."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 음성이 디바이스의 사용자인지 인증하는 단계를 더 포함하고,상기 음성이 상기 디바이스의 사용자일 때, 상기 사용자의 송금 의도를 판단하는 것을 특징으로 하는, 송금 방법."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 수신인의 계좌번호를 포함하는 상기 송금 내역을 표시하는 단계를 더 포함하는, 송금 방법."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서, 상기 송금 내역을 승인하는 단계는,상기 사용자의 지문, 홍채 또는 음성을 이용하여 상기 송금 내역을 승인하는 것을 특징으로 하는, 송금 방법."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서, 상기 송금 내역을 승인하는 단계는,상기 사용자가 착용하고 있는 웨어러블 디바이스로부터 수신된 정맥 패턴을 이용하여 상기 송금 내역을 승인하는 것을 특징으로 하는, 송금 방법."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서, 상기 사용자의 송금 의도를 판단하는 단계는,상기 수신된 음성을, 사용자의 송금 의도를 추정하도록 설정된 데이터 인식 모델에 적용하여 상기 사용자의 송금 의도를 판단하는 단계를 포함하는, 송금 방법."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 데이터 인식 모델은,인공 지능 알고리즘에 기반하여, 학습 데이터로서 음성 또는 문자, 및 학습 엔티티를 이용하여 학습된모델이며,상기 학습 엔티티는 사용자 정보, 수신인 정보, 송금 금액 및 송금 명령어 중 적어도 하나를 포함하는 것을 특징으로 하는, 송금 방법."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 사용자의 송금 의도를 판단하는 단계는,공개특허 10-2018-0057507-5-상기 수신된 음성을 상기 데이터 인식 모델의 적용한 결과로서 획득된 인식 엔티티에 기초하여 상기 사용자의송금 의도를 판단하는 단계를 포함하고,상기 인식 엔티티는 사용자 정보, 수신인 정보, 송금 금액 및 송금 명령어 중 적어도 하나를 포함하는, 송금 방법."}
{"patent_id": "10-2017-0132758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "사용자의 음성을 분석하여 사용자의 송금 의도를 판단하는 단계;연락처 리스트에서 상기 음성에 포함된 수신인의 이름으로 저장된 연락처를 검색하는 단계;상기 수신인의 상기 이름, 상기 연락처를 상기 음성에 포함된 금액과 함께 은행 서버로 전송하는 단계;상기 은행 서버로부터 송금 내역을 수신하는 단계: 및상기 송금 내역을 승인하는 단계;를 디바이스가 실행하도록 설정된 명령어들을 포함하는 컴퓨터 프로그램 제품."}
{"patent_id": "10-2017-0132758", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시 예에 따른 디바이스는, 적어도 하나의 프로그램이 저장되는 메모리; 음성을 수신하는 마이크로폰; 및 상 기 적어도 하나의 프로그램을 실행함으로써 상기 음성에 따라 수신인에게 송금하는 적어도 하나의 프로세서를 포 함하고, 상기 프로세서는, 상기 수신된 음성을 분석하여 사용자의 송금 의도를 판단하는 단계; 연락처 리스트에 서 상기 수신인의 이름으로 저장된 연락처를 검색하는 단계; 상기 수신인의 상기 이름, 상기 연락처를 상기 음성 에 포함된 금액과 함께 은행 서버로 전송하는 단계; 상기 은행 서버로부터 송금 내역을 수신하는 단계: 및 상기 송금 내역을 승인하는 단계;를 실행한다. 상기 디바이스는 음성을 이용하여 송금하는 경우, 규칙 기반 또는 인공 지능 알고리즘을 이용하여 수신된 음성을 분석할 수 있다. 인공 지능 알고리즘을 이용하여 음성을 분석하는 경우, 디바이스는 기계 학습, 신경망 또는 딥러닝 알고리즘을 이용하여 음성을 분석할 수 있다."}
{"patent_id": "10-2017-0132758", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "음성을 이용하여 송금하는 방법 및 장치에 관한 것이다. 또한, 본 개시는 기계 학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 인공 지능 (Artificial Intelligence, AI) 시스템 및 그 응용에 관한 것이다."}
{"patent_id": "10-2017-0132758", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "멀티 미디어 기술 및 네트워크 기술이 발전함에 따라, 사용자는 디바이스를 이용하여 다양한 서비스를 제공받을 수 있게 되었다. 특히, 음성 인식 기술이 발전함에 따라, 사용자는 디바이스에 음성을 입력하고, 디바이스는 사 용자의 음성에 따라 동작을 실행할 수 있다. 사용자는 은행에서 제공하는 어플리케이션을 이용하여 금융 서비스를 이용할 수 있다. 예를 들어, 사용자는 디 바이스를 이용하여 수신인의 계좌로 송금할 수 있다. 사용자는 어플리케이션을 실행하여, 계좌번호, 비밀번호 등을 입력하여 수신인의 계좌로 송금할 수 있다. 또한, 근래에는 인간 수준의 지능을 구현하는 인공 지능 시스템이 다양한 분야에서 이용되고 있다. 인공 지능 시스템은 기존의 룰(rule) 기반 스마트 시스템과 달리 기계가 스스로 학습하고 판단하며 똑똑해지는 시스템이다. 인공 지능 시스템은 사용할수록 인식률이 향상되고 사용자 취향을 보다 정확하게 이해할 수 있게 되어, 기존 룰 기반 스마트 시스템은 점차 딥러닝 기반 인공 지능 시스템으로 대체되고 있다. 인공 지능 기술은 기계학습(예로, 딥러닝) 및 기계학습을 활용한 요소 기술들로 구성된다. 기계학습은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘 기술이며, 요소기술은 딥러닝 등의 기계학 습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 기술로서, 언어적 이해, 시각적 이해, 추론/예측, 지식 표현, 동작 제어 등의 기술 분야로 구성된다. 인공 지능 기술이 응용되는 다양한 분야는 다음과 같다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리 하는 기술로서, 자연어 처리, 기계 번역, 대화시스템, 질의 응답, 음성 인식/합성 등을 포함한다. 시각적 이해 는 사물을 인간의 시각처럼 인식하여 처리하는 기술로서, 객체 인식, 객체 추적, 영상 검색, 사람 인식, 장면 이해, 공간 이해, 영상 개선 등을 포함한다. 추론 예측은 정보를 판단하여 논리적으로 추론하고 예측하는 기술 로서, 지식/확률 기반 추론, 최적화 예측, 선호 기반 계획, 추천 등을 포함한다. 지식 표현은 인간의 경험정보 를 지식데이터로 자동화 처리하는 기술로서, 지식 구축(데이터 생성/분류), 지식 관리(데이터 활용) 등을 포함 한다. 동작 제어는 차량의 자율 주행, 로봇의 움직임을 제어하는 기술로서, 움직임 제어(항법, 충돌, 주행), 조 작 제어(행동 제어) 등을 포함한다."}
{"patent_id": "10-2017-0132758", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2017-0132758", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "음성을 이용하여 수신인의 계좌로 송금하는 디바이스 및 방법을 제공한다."}
{"patent_id": "10-2017-0132758", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시 예에 따른 디바이스는, 적어도 하나의 프로그램이 저장되는 메모리; 음성을 수신하는 마이크로폰; 및 상기 적어도 하나의 프로그램을 실행함으로써 상기 음성에 따라 수신인에게 송금하는 적어도 하나의 프로세서를 포함하고, 상기 프로세서는, 상기 수신된 음성을 분석하여 사용자의 송금 의도를 판단하는 단계; 연락처 리스트 에서 상기 수신인의 이름으로 저장된 연락처를 검색하는 단계; 상기 수신인의 상기 이름, 상기 연락처를 상기 음성에 포함된 금액과 함께 은행 서버로 전송하는 단계; 상기 은행 서버로부터 송금 내역을 수신하는 단계: 및 상기 송금 내역을 승인하는 단계;를 실행한다. 일 실시 예에 따른 송금 방법은, 사용자의 음성을 수신하는 단계; 상기 수신된 음성을 분석하여 사용자의 송금 의도를 판단하는 단계; 연락처 리스트에서 상기 수신인의 이름으로 저장된 연락처를 검색하는 단계; 상기 수신 인의 상기 이름, 상기 연락처를 상기 음성에 포함된 금액과 함께 은행 서버로 전송하는 단계; 상기 은행 서버로 부터 송금 내역을 수신하는 단계: 및 상기 송금 내역을 승인하는 단계;를 포함한다."}
{"patent_id": "10-2017-0132758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 일 실시예에 따라, 사용자가 음성을 이용하여 송금하는 방법을 설명하기 위한 도면이다. 도 1을 참조하 면, 사용자는 디바이스에 음성을 입력하여 수신인에게 송금할 수 있다. 특히, 사용자는 수신인의 계좌번호 를 입력하지 않아도, 수신인의 이름만으로 수신인에게 송금할 수 있다. 디바이스는 사용자로부터 음성을 수신할 수 있다. 디바이스는 마이크로폰을 포함할 수 있으며, 마이크 로폰은 사용자의 음성을 수신한다. 디바이스는 사용자의 음성 입력을 수신할 수 있다. 디바이스는, 예를 들어, “S 보이스”와 같은 보이 스 어시스턴트 애플리케이션 (Voice Assistant Application)을 실행하고, 실행된 애플리케이션을 제어함으로써 마이크로폰을 통하여 입력되는 사용자의 음성 입력을 수신할 수 있다. 디바이스는 사용자의 음성을 인식한다. 디바이스는 음성을 분석하여 사용자의 의도를 판단할 수 있다. 예를 들어, 사용자로부터 '삼성에 1억 송금해'라는 음성이 수신되면, 디바이스는 사용자의 음성으로부터 사 용자가 송금을 하려고 하는지를 판단할 수 있다. 디바이스는 사용자가 송금할 때 입력되는 음성을 메모리에 모두 저장하여, 송금할 때 입력되는 음성의 패턴을 학습할 수 있다. 디바이스는 학습을 통해 보다 정확하게 사용자의 의도를 판단할 수 있다. 학습 초기에, 디바이스는 사용자의 음성이 입력되면, 송금할 것인지 여부 를 확인할 수 있다. 디바이스는 반복된 학습을 통해 사용자의 송금 의도를 더 정확하게 판단할 수 있다. 일 예로서, 디바이스는 저장된 음성의 패턴과 입력된 음성의 패턴을 비교하여 사용자의 의도를 판단할 수 있다. 저장된 음성의 패턴은 사용자가 송금할 의도가 있는 경우 입력된 음성의 패턴을 의미한다. 디바이스 는 저장된 음성의 패턴과 입력된 음성의 패턴이 유사 또는 일치하면 사용자가 송금할 의도가 있다고 판단할 수 있다. 저장된 음성의 패턴은 학습을 통해 업데이트 또는 추가될 수 있다. 디바이스는 수신인의 이름 또는 명칭 등을 확인하고, 연락처 리스트에 저장된 이름 또는 명칭을 검색한다. 예를 들어, 사용자가 수신인을 '삼성'으로 입력한 경우, 디바이스는 연락처 리스트에서 '삼성'을 검색한다. 디바이스는 연락처 리스트에서 '삼성'의 전화번호를 확인한다. 디바이스는 사용자 정보, 수신인 정보 및 금액을 은행 서버로 전송한다. 사용자 정보는 사용자의 이름, 계좌번호 등을 포함한다. 수신인 정보는 수신인의 이름, 전화번호 등을 포함한다. 수신인 정보에는 수신인의 계 좌번호가 포함되지 않을 수 있다. 금액은 사용자의 음성에 포함된 금액을 나타내며, 사용자가 수신인에게 송금 할 금액이다. 디바이스는, 스마트폰, 태블릿 PC, PC, 스마트 TV, 휴대폰, PDA(personal digital assistant), 랩톱, 미디 어 플레이어, 마이크로 서버, GPS(global positioning system) 장치, 전자책 단말기, 디지털방송용 단말기, 네 비게이션, 키오스크, MP3 플레이어, 디지털 카메라, 가전기기 및 기타 모바일 또는 비모바일 컴퓨팅 장치일 수 있으나, 이에 제한되지 않는다. 또한, 디바이스는 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 디바이스일 수 있다. 그러나, 이에 제한되지 않으며, 디바이스는 사용자의 음성 입력을 수신하고, 사용자에게 답변 메시지를 제공할 수 있는 모든 종류의 기기를 포함할 수 있다. 또한, 디바이스는 다양한 컨텍스트 정보를 이용하기 위하여, 네트워크를 통하여 다른 장치(미도시)와 통신 할 수 있다. 네트워크는 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN), 부 가가치 통신망(Value Added Network; VAN), 이동 통신망(mobile radio communication network), 위성 통신망 및 이들의 상호 조합을 포함하며, 각 네트워크 구성 주체가 서로 원활하게 통신을 할 수 있도록 하는 포괄적인 의미의 데이터 통신망이며, 유선 인터넷, 무선 인터넷 및 모바일 무선 통신망을 포함할 수 있다. 무선 통신은 예를 들어, 무선 랜(Wi-Fi), 블루투스, 블루투스 저 에너지(Bluetooth low energy), 지그비, WFD(Wi-Fi Direct), UWB(ultra wideband), 적외선 통신(IrDA, infrared Data Association), NFC(Near Field Communication) 등이 있을 수 있으나, 이에 한정되는 것은 아니다. 은행 서버는 사용자 정보 및 수신인 정보를 수신한다. 은행 서버는 사용자 정보와 매칭되는 계좌번호를 검색한다. 은행 서버는 사용자의 이름 및 전화번호를 이용하여 사용자의 계좌번호를 검색할 수 있다. 또한, 은행 서버는 디바이스의 고유의 식별 정보에 지정(또는 매칭)된 계좌번호를 검색할 수 있다. 디바이스 는 고유의 식별 정보를 포함할 수 있고, 은행 서버는 디바이스의 고유의 식별 정보를 이용하여 디 바이스의 사용자의 계좌번호를 검색할 수 있다. 은행 서버는 수신인 정보와 매칭되는 계좌번호를 검색 한다. 은행 서버는 수신인의 이름 및 전화번호와 매칭되는 계좌번호를 검색한다.은행 서버는 송금 내역을 생성한다. 은행 서버는 사용자의 계좌번호, 수신인의 이름, 수신인의 계좌번 호, 금액을 포함하는 송금 내역을 생성할 수 있다. 예를 들어, 은행 서버는 'A은행, 11-1111(계좌번호), AAA(사용자 이름)에서 B은행, 22-2222(계좌번호), BBB(수신인 이름)으로 1만원을 송금하라'라는 송금 내역을 생 성할 수 있다. 은행 서버는 송금 내역을 디바이스로 송신한다. 디바이스는 송금 내역을 표시할 수 있다. 디바이스는 사용자가 음성으로 입력한 의도와 송금 내역이 일 치하는지를 사용자로부터 확인 받기 위해 송금 내역을 표시할 수 있다. 사용자는 송금 내역을 승인한다. 사용자는 송금 내역에 따라 송금을 하고자 할 경우, 음성, 지문, 홍채, 정맥 또는 비밀번호 등을 입력할 수 있다. 디바이스는 입력된 음성, 지문, 홍채, 정맥 또는 비밀번호 등이 사용 자의 개인 정보와 일치하는지를 판단하여 인증을 수행할 수 있다. 디바이스는 인증 결과를 은행 서버로 전송한다. 은행 서버는 인증 결과에 따라 수신인에게 송금한다. 은행 서버는 정당한 사용자로 인증된 경우에 수신 인에게 송금하고, 그렇지 않으면 송금하지 않고, 디바이스로 에러 메시지를 전송한다. 도 2는 일 실시 예에 따른 디바이스를 설명하기 위한 구성도이다. 도 2를 참조하면, 디바이스는 프로세서 , 메모리, 디스플레이 및 마이크로폰를 포함한다. 프로세서는 메모리, 디스플레이 및 마이크로폰을 제어할 수 있다. 프로세서는 메모리 에 데이터를 저장하거나 독출(read)할 수 있다. 프로세서는 디스플레이에 표시될 이미지를 결정하고, 디스플레이가 이미지를 표시하도록 디스플레이를 제어할 수 있다. 프로세서는 마이크로폰의 온 /오프를 제어하고, 마이크로폰을 통해 입력된 음성을 분석한다. 메모리는 사용자의 개인 정보, 생채 정보 등을 저장할 수 있다. 예를 들어, 메모리는 사용자의 음성, 지문, 홍채, 정맥 및 비밀번호 등을 저장할 수 있다. 메모리는 사용자의 음성 패턴을 분석하기 위한 사용자 의 음성을 저장할 수도 있다. 디스플레이는 프로세서의 제어에 따라 이미지를 표시하거나 비디오를 재생할 수 있다. 마이크로폰은 음성을 수신한다. 마이크로폰은 디바이스의 주변에서 발생하는 소리를 전기 신호로 변환하고, 전기 신호를 프로세서로 출력한다. 도 3은 일 실시 예에 따른 디바이스가 패턴을 학습하는 것을 설명하기 위한 도면이다. 도 3을 참조하면, 디바이 스는 다양한 형태의 문장을 분석하여, 패턴을 학습할 수 있다. 사용자는 송금을 하기 위해 다양한 형태의 문장을 말할 수 있다. 예를 들어, 사용자의 A은행 계좌에서 삼성(수 신인)으로 1억원을 송금하기 위해, 사용자는 다음과 같은 형태의 문장을 말할 수 있다. 1. A은행 계좌에서 삼성으로 1억 송금해 2. 삼성으로 1억 송금해 3. 1억 삼성으로 송금해 디바이스는 사용자가 말하는 음성의 패턴을 분석 및 학습하여 사용자가 송금하려는 의도가 포함된 문장을 식별할 수 있다. 사용자의 계좌가 복수개 인 경우, 디바이스는 사용자에게 어느 계좌에서 출금할 것인지를 확인할 수 있다. 계좌가 지정되면, 사용자의 별도의 지시가 없으면, 다음부터 디바이스는 지정된 계좌에서 출금을 할 수 있 다. 도 4는 일 실시 예에 따라 송금 내역을 승인하는 방법을 설명하기 위한 도면이다. 사용자는 음성, 지문, 정맥 또는 홍채 등을 이용하여 송금 내역을 승인할 수 있다. 디바이스는 은행 서버로부터 송금 내역을 수신하고, 송금 내역을 표시한다. 송금 내역은 사용자의 계좌 번호, 수신인의 계좌번호 및 금액 등을 포함할 수 있다. 사용자는 송금 내역을 확인한 후에 송금 내역을 승인할 수 있다. 사용자가 송금 내역을 승인할 때, 사용자는 음 성, 지문, 정맥 또는 홍채 등을 이용할 수 있다. 디바이스는 입력된 음성, 지문 또는 홍채가 사용자의 음성, 지문, 정맥 또는 홍채와 일치하면 은행 서버로 승인되었음을 나타내는 메시지를 전송한다. 도 5는 일 실시 예에 따라 복수의 수신인들 중에서 어느 한명을 선택하는 방법을 설명하기 위한 도면이다. 사용 자는 음성을 통해 복수의 수신인들 중에서 어느 한명을 선택할 수 있다. 디바이스는 수신인으로 식별된 이름을 연락처 리스트에서 검색한다. 연락처 리스트에 식별된 이름을 포함하 는 복수의 수신인들이 검색된 경우, 디바이스는 검색된 복수의 수신인들의 이름을 표시한다. 사용자는 음성 으로 표시된 이름들 중에서 어느 하나를 선택할 수 있다. 삼성이라는 이름으로 다음의 2명의 수신인들이 검색된 경우를 예를 들어 설명한다. 1. 삼성전자 2. 삼성회사 디바이스는 2명의 수신인들을 디스플레이에 표시한다. 사용자는 음성으로 1번, 또는 2번 중 어느 한명 의 수신인을 선택할 수 있다. 예를 들어, 사용자는 '1번으로 송금해' 또는 '삼성전자로 송금해' 등의 음성을 입 력하여 수신인을 선택할 수 있다. 도 6은 일 실시 예에 따라 복수의 은행들 중에서 어느 하나의 은행을 선택하는 방법을 설명하기 위한 도면이다. 사용자는 음성을 통해 복수의 은행들(또는 계좌번호들) 중에서 어느 하나의 은행(또는 계좌번호)을 선택할 수 있다. 은행 서버는 송금 내역을 디바이스로 전송할 때, 수신인의 이름으로 등록된 복수의 은행들(또는 계좌번 호들)을 전송할 수 있다. 예를 들어, 수신인의 이름으로 등록된 계좌번호가 복수인 경우, 디바이스는 어느 계좌번호로 송금할지를 결정하기 위해 사용자에게 계좌번호들을 표시할 수 있다. 사용자는 음성으로 표시된 계 좌번호들 중에서 어느 하나의 계좌번호를 선택할 수 있다. 삼성이라는 이름으로 다음의 2개의 계좌번호들이 검색된 경우를 예를 들어 설명한다. 1. A은행(33-3333) 2. B은행(55-5555) 디바이스는 2개의 계좌번호들을 디스플레이에 표시한다. 사용자는 음성으로 1번, 또는 2번 중 어느 하 나의 계좌번호를 선택할 수 있다. 예를 들어, 사용자는 'A은행으로 송금해', '1번으로 송금해' 또는 '55-5555 계좌로 송금해' 등의 음성을 입력하여 은행 또는 계좌번호를 선택할 수 있다. 도 7은 일 실시 예에 따른 음성을 이용하여 송금하는 방법을 설명하기 위한 순서도이다. 도 7을 참조하면, 사용 자는 수신인의 이름 및 금액을 음성으로 입력하여 수신인에게 송금할 수 있다. 단계 710에서, 디바이스는 사용자의 음성을 수신한다. 단계 720에서, 디바이스는 수신된 음성을 분석하여 사용자의 송금 의도를 판단한다. 수신된 음성을 분석한 결과, 송금 의도가 없다고 판단되면, 디바이스는 송금을 위한 프로세스를 수행하지 않는다. 음성은 수신인 의 이름, 금액 등을 포함할 수 있다. 예를 들어, 디바이스는 음성을 분석하여, 명령어, 이름, 금액 등이 포 함되어 있으면, 사용자의 음성에 송금 의도가 있음을 판단할 수 있다. 단계 730에서, 디바이스는 연락처 리스트에서 수신인의 이름으로 저장된 연락처를 검색한다. 수신인의 이름 을 포함하는 연락처가 검색되지 않는 경우, 디바이스는 연락처가 없음을 나타내는 문구를 디스플레이에 표시할 수 있다. 사용자는 수신인의 이름과 함께 연락처를 음성으로 입력할 수 있다. 디바이스는 입력된 음 성에 따라 수신인의 이름과 연락처를 연락처 리스트에 저장한다. 단계 740에서, 디바이스는 수신인의 이름, 연락처를 음성에 포함된 금액과 함께 은행 서버로 전송한다. 연락처는 수신인의 이름으로 검색되거나, 사용자의 음성을 통해 입력될 수 있다. 단계 750에서, 디바이스는 은행 서버로부터 송금 내역을 수신한다. 은행 서버는 수신인의 이름 및 연락처를 이용하여 수신인의 계좌번호를 검색하고, 수신인의 이름 계좌번호 및 금액 등을 포함하는 송금 내역을 디바이스로 전송한다. 단계 760에서, 디바이스는 송금 내역을 승인한다. 디바이스는 사용자의 음성, 지문, 홍채, 정맥 또는 비밀번호 등을 이용하여 송금 내역을 승인할 수 있다. 사용자는 송금 내역을 확인하고, 승인하는 음성을 디바이 스에 입력하거나, 홍채, 지문 등을 디바이스가 인식하도록 할 수 있다. 또한, 사용자가 스마트 워치와 같은 웨어러블 디바이스를 착용하고 있는 경우, 사용자는 스마트 워치를 이용하여 손등의 정맥을 이용하여 인증 을 수행할 수도 있다. 예를 들어, 사용자는 송금 내역을 승인하기 위해, 스마트 워치를 조작하여, 손등의 정맥 을 식별하여 인증을 수행할 수 있다. 도 8은 또 다른 실시 예에 따라 음성으로 결제하는 방법을 설명하기 위한 도면이다. 도 8을 참조하면, 사용자는 음성을 이용하여 결제할 수 있다. 디바이스는 사용자가 인터넷에서 구매한 물건 또는 서비스를 결제하기 위한 화면을 표시한다. 예를 들어, 사용자가 갤럭시 노트7을 구매하는 경우, 디바이스는 '갤럭시 노트7을 구매하시겠습니까' 라는 문구를 표시 할 수 있다. 사용자는 결제 내역을 확인한 후에 음성을 입력하여 결제할 수 있다. 예를 들어, 사용자는 '삼성카드로 결제해' 라고 입력하면, 디바이스는 사용자의 음성을 인식한다. 사용자는 단순히 '결제해' 라고 입력할 수 있으며, 디바이스는 이전에 사용자가 결제한 카드를 이용하여 결제를 진행할 수 있다. 디바이스는 사용자의 카드 정보 및 결제 정보를 카드사 서버로 전송한다. 사용자의 카드 정보는 카드 번호, 카드의 유효 일자, 비밀 번호 등을 포함할 수 있다. 결제 정보는 결제하고자 하는 물건 또는 서비스, 판 매자 정도 등을 포함할 수 있다. 카드사 서버는 카드 정보를 확인하고, 결제를 진행할 수 있다. 카드사 서버는 결제가 완료되면 디바이 스로 결제 완료 메시지를 전송할 수 있다. 디바이스는 결제 완료 메시지를 표시하여, 사용자에게 결제 가 정상적으로 되었음을 알릴 수 있다. 일 예로서, 사용자가 스마트 워치를 착용하고 있고, 사용자가 물건 또는 서비스를 결제하는 경우, 스마트 워치 는 자동으로 사용자의 생체 인증을 수행할 수 있다. 예를 들어, 사용자가 스마트 워치를 착용하고 있으면, 스마 트 워치는 사용자의 손목의 정맥을 촬영할 수 있고, 촬영된 정맥 패턴을 통해 정맥 인증을 수행할 수 있다. 따 라서, 사용자는 음성, 비밀번호 등의 입력을 별도로 입력하지 않아도, 스마트 워치를 통해 자동으로 결제할 수 있다. 자세히 설명하면, 디바이스는 사용자가 인터넷을 통해 결제 버튼을 터치하면, 사용자가 스마트 워치 를 착용하고 있는지 여부를 판단한다. 사용자가 스마트 워치를 착용하고 있으면, 디바이스는 스마트 워치에 정맥 인증을 수행하도록 신호를 전송한다. 스마트 워치는 디바이스의 제어에 따라 사용자의 정맥을 촬영하 고, 정맥 인증을 수행한 결과를 디바이스로 전송할 수 있다. 또한, 스마트 워치는 촬영된 정맥 이미지를 디 바이스로 전송하고, 디바이스가 정맥 인증을 수행할 수도 있다. 정맥 인증은 등록된 정맥 이미지(또는 정맥 패턴)과 촬영된 정맥 이미지(또는 정맾 패턴)을 비교하는 것일 수 있다. 사용자가 웨어러블 디바이스를 착 용하고 있는 경우, 디바이스는 사용자로부터 별도의 입력을 수신하지 않고도, 결제를 진행할 수 있다. 도 9는 일 실시 예에 따른 디바이스가 결제 패턴을 학습하는 것을 설명하기 위한 도면이다. 도 9를 참조하면, 디바이스는 다양한 형태의 문장을 분석하여 결제 패턴을 학습할 수 있다. 결제 패턴을 학습한다는 것은 사 용자가 결제할 때 입력하는 음성의 형태를 식별하고 기록하는 것을 의미할 수 있다. 사용자는 결제하기 위해 다양한 형태의 문장을 말할 수 있다. 예를 들어, 사용자는 다음과 같은 형태의 문장을 말할 수 있다. 1. 삼성카드로 결제해 2. 삼성카드로 결제해줘 3. 내 카드로 결제해 4. 결제 진행해 디바이스는 사용자가 결제할 때 주로 말하는 문장을 저장하고, 사용자가 저장된 문장과 동일 또는 유사한 문장을 말하는지를 판단하여 결제를 진행할 수 있다. 디바이스는 학습 초기에 사용자의 카드 정보를 등록하거나, 사용자가 주로 사용하는 카드 정보를 획득하기 위해 사용자에게 카드 정보를 요청할 수 있다. 사용자의 카드 정보가 등록되면, 사용자가 단순히 '내 카드로 결 제해' 라는 문장을 말하더라도, 디바이스는 기존에 등록된 사용자의 카드 정보를 이용하여 결제를 진행할 수 있다.도 10은 일 실시 예에 따라 음성으로 결제하는 방법을 설명하기 위한 순서도이다. 도 10을 참조하면, 사용자는 음성을 이용하여 물건 또는 서비스를 결제할 수 있다. 단계 1010에서, 디바이스는 결제 내역을 표시한다. 단계 1020에서, 디바이스는 사용자의 음성을 수신한다. 사용자는 결제 내역을 확인하고, 결제를 할지 또는 결제를 하지 않을지 여부를 음성으로 표현할 수 있다. 예를 들어, 사용자는 결제할 때 '결제해' 라고 말할 수 있고, 결제하지 않을 때 '결제 하지마' 라고 말할 수 있다. 단계 1030에서, 디바이스는 수신된 음성을 분석하여 사용자의 의도를 판단한다. 디바이스는 음성을 분 석하여 사용자가 표시된 결제 내역을 승인하고자 하는지를 판단할 수 있다. 단계 1040에서, 디바이스는 음성을 통한 사용자 인증을 수행한다. 디바이스는 음성이 사용자의 음성과 일치하는지 판단하여 사용자 인증을 수행할 수 있다. 디바이스는 등록된 음성과 입력된 음성의 일치 여부를 판단하여 결제를 진행할 수 있다. 디바이스는 음성뿐만 아니라, 지문, 홍채, 정맥 또는 비밀번호 등을 통해 사용자 인증을 수행할 수도 있다. 단계 1050에서, 디바이스는 결제 정보를 카드사로 전송한다. 인증이 성공되면, 디바이스는 결제 정보 및 카드 정보를 카드사로 전송한다. 결제 정보는 물건, 판매자 정보, 금액 등을 포함할 수 있다. 카드 정보는 사용자의 카드번호, 비밀번호, 유효 일자 등을 포함할 수 있다. 디바이스는 결제가 완료되면 결제 완료 메시지를 표시할 수 있다. 상기와 같이, 사용자가 인터넷을 통해 물건 또는 서비스를 구매할 때, 사용자는 음성을 통해서 물건 또는 서비 스를 구매할 수 있다. 도 11은 일부 실시예에 따른 프로세서의 블록도이다. 도 11을 참조하면, 일부 실시예에 따른 프로세서는 데이터 학습부 및 데이터 인식부를 포함 할 수 있다. 데이터 학습부는 상황 판단을 위한 기준을 학습할 수 있다. 데이터 학습부는 소정의 상황을 판단하 기 위하여 어떤 데이터를 이용할 지, 데이터를 이용하여 상황을 어떻게 판단할 지에 관한 기준을 학습할 수 있 다. 데이터 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적 용함으로써, 상황 판단을 위한 기준을 학습할 수 있다. 데이터 학습부는 음성 또는 문장을 이용하여 데이터 인식 모델을 학습시켜서, 사용자의 의도를 추정하도 록 설정된 데이터 인식 모델을 생성할 수 있다. 이 때, 음성 또는 문장은 디바이스의 사용자가 발화한 음성 또는 사용자의 음성이 인식된 문장을 포함할 수 있다. 또는, 음성 또는 문장은 제3자가 발화한 음성 또는 제3자 의 음성이 인식된 문장을 포함할 수 있다. 데이터 학습부는 학습 데이터로서, 음성 또는 문장, 및 학습 엔티티를 이용하는 지도 학습 방식을 이용하 여 데이터 인식 모델을 학습시킬 수 있다. 일 실시예로, 데이터 인식 모델은 사용자의 송금 의도를 추정하기 위하여 설정된 모델일 수 있다. 이 경우, 학 습 엔티티는 사용자 정보, 수신인 정보, 송금 금액 및 송금 의도 중 적어도 하나를 포함할 수 있다. 사용자 정 보는, 사용자의 식별 정보(예로, 이름 또는 별칭) 또는 사용자 계좌의 식별 정보(예로, 계좌 은행, 계좌 명칭, 계좌 별칭 또는 계좌 번호) 등을 포함할 수 있으며, 수신인 정보는 수신인의 식별 정보(예로, 이름, 별칭 또는 전화번호) 또는 수신인 계좌의 식별 정보(예로, 계좌 은행, 계좌 명칭, 계좌 별칭 또는 계좌 번호)를 포함할 수 있다. 송금 의도는 사용자가 송금할 것인지 여부 등을 포함할 수 있다. 예로, 송금 의도는, 송금 진행, 송금 예 약, 예약 취소, 송금 보류 또는 송금 확인 등을 포함할 수 있다. 한편, 학습 엔티티 값들 중 적어도 하나는 'NULL' 값을 가질 수도 있다. 이 경우, 'NULL' 값은 학습 데이터로서 이용되는 음성 또는 문장에 대하여 해당 엔티티 값에 대한 정보가 없음을 나타낼 수 있다. 구체적으로, 학습을 위한 음성 또는 문장이 'A은행 계좌에서 삼성으로 1억 송금해'인 경우, 학습 엔티티는 {사 용자 정보: A은행, 수신인 정보: 삼성, 이체 금액: 1억, 송금 명령어: 송금 진행}로 구성될 수 있다. 다른 예로, 학습을 위한 음성 또는 문장이 '삼성에 1억 송금해'인 경우, 학습 엔티티는 {사용자 정보: NULL, 수신인 정보: 삼성, 이체 금액: 1억, 송금 명령어: 송금 진행}로 구성될 수 있다. 또 다른 예로, 학습을 위한 음성 또는 문장이 '삼성에 1억 송금한 것 맞지'인 경우, 학습 엔티티는 {사용자 정보: NULL, 수신인 정보: 삼성, 이체 금액: 1억, 송금 명령어: 송금 확인}로 구성될 수 있다. 또 다른 예로, 음성 또는 문장이 '삼성에 1억 송금할 예약 취소해'인 경우, 학습 엔티티는 {사용자 정보: NULL, 수신인 정보: 삼성, 이체 금액: 1억, 송금 명령어: 예약 취소}로 구성될 수 있다. 다른 실시예로, 데이터 인식 모델은 사용자의 결제 의도를 추정하기 위하여 설정된 모델일 수 있다. 이 경우, 학습 엔티티는 결제 카드, 결제 품목, 결제 방식 및 결제 의도 중 적어도 하나를 포함할 수 있다. 결제 방식은, 예로, 일시불 또는 할부 개월 수 등을 포함할 수 있다. 결제 의도는 사용자가 결제할 것인지 여부 등을 포함할 수 있다. 예로, 결제 의도는 결제 진행, 결제 취소, 결제 보류, 결제 방식 변경 또는 결제 확인 등을 포함할 수 있다. 구체적으로, 학습을 위한 음성 또는 문장이 '삼성 카드로 일시불 결제해'인 경우, 학습 엔티티는 {결제 수단: 삼성 카드, 결제 품목: NULL, 결제 방식: 일시불, 결제 명령어: 결재 진행}으로 구성될 수 있다. 다른 예로, 학 습을 위한 음성 또는 문장이 '10개월 할부로 결제해'인 경우, 학습 엔티티는 {결제 수단: NULL, 결제 품목: NULL, 결제 방식: 10개월 할부, 결제 명령어: 결제 진행}으로 구성될 수 있다. 다른 예로, 학습을 위한 음성 또 는 문장이 '조금 전 결제 취소해'인 경우, 학습 엔티티는 {결제 수단: NULL, 결제 품목: NULL, 결제 방식: NULL, 결제 명령어: 결제 취소}로 구성될 수 있다. 전술한 사용자의 송금 의도를 판단하도록 설정된 데이터 인식 모델 및, 사용자의 결제 의도를 판단하도록 설정 된 데이터 인식 모델은 동일한 인식 모델일 수도 있고, 또는 서로 다른 인식 모델일 수도 있다. 또는, 상기 각 각의 데이터 인식 모델은 복수의 데이터 인식 모델들로 구성될 수도 있다. 예로, 사용자의 이용 환경(예로, 이 용 시간 또는 이용 장소)를 고려하여, 각각의 환경에 맞춤화된 복수의 데이터 인식 모델들을 이용하여 사용자의 의도가 판단될 수도 있다. 데이터 인식부는 데이터에 기초한 상황을 판단할 수 있다. 데이터 인식부는 학습된 데이터 인식 모 델을 이용하여, 소정의 데이터로부터 상황을 인식할 수 있다. 데이터 인식부는 학습에 의한 기 설정된 기 준에 따라 소정의 데이터를 획득하고, 획득된 데이터를 입력 값으로 하여 데이터 인식 모델을 이용함으로써, 소 정의 데이터에 기초한 소정의 상황을 판단할 수 있다. 또한, 획득된 데이터를 입력 값으로 하여 데이터 인식 모 델에 의해 출력된 결과 값은, 데이터 인식 모델을 갱신하는데 이용될 수 있다. 데이터 인식부는 사용자의 음성 또는 음성이 인식된 문장을 데이터 인식 모델에 적용하여 사용자의 의도 를 추정할 수 있다. 예로, 데이터 인식부는 사용자의 음성 또는 음성이 인식된 문장을 데이터 인식 모델 에 적용하여 인식 엔티티를 획득하고, 이를 디바이스의 프로세서(예로, 도 2의 디바이스의 프로세서)에 게 제공할 수 있다. 프로세서는 획득된 인식 엔티티에 사용자의 의도를 판단할 수 있다. 일 실시예로, 데이터 인식 모델은 사용자의 송금 의도를 추정하기 위하여 설정된 모델일 수 있다. 이 경우, 데 이터 인식부는 사용자의 음성 또는 음성이 인식된 문장을 데이터 인식 모델에 적용하여 사용자의 송금 의 도를 추정할 수 있다. 예로, 데이터 인식부는 사용자의 음성 또는 음성이 인식된 문장으로부터 인식 엔티 티를 획득할 수 있다. 인식 엔티티는, 예로, 사용자 정보, 수신인 정보, 송금 금액 및 송금 명령어 중 적어도 하나를 포함할 수 있다. 데이터 인식부는 획득된 인식 엔티티를 프로세서에게 제공할 수 있다. 프로 세서(또는, 프로세서의 다이얼로그 매니징 모듈(dialog management))은 인식 엔티티에 기초하여 사용자 의도를 판단할 수 있다. 인식 엔티티에 기초하여 사용자의 의도가 송금 의도가 없다고 판단되면, 프로세서는 송금을 위한 프로세스 를 수행하지 않을 수 있다. 반면에, 인식 엔티티에 기초하여 사용자의 의도가 송금 의도가 있다고 판단되면, 프 로세서는 송금을 위한 프로세스를 수행할 수 있다. 이 때, 인식 엔티티의 값들 중 적어도 하나의 값이 'NULL'인 경우, 프로세서는 사용자의 이력 정보 또는 기 설정된 정보를 이용하여 'NULL' 값에 대응하는 값을 결정할 수 있다. 예로, 프로세서는 최근의 송금 이력을 참조하여, 'NULL' 값에 대응하는 값을 결정할 수 있다. 또는, 프로세서는 사용자가 환경 설정에서 기 설정 한 정보(예로, 계좌 번호, 계좌 은행 등)를 참조하여, 'NULL' 값에 대응하는 값을 결정할 수 있다. 인식 엔티티의 값들 중 적어도 하나의 값이 'NULL'인 경우, 프로세서는 'NULL' 값에 대응하는 값을 사용자 에게 요청할 수도 있다. 예로, 프로세서는 사용자 정보, 수신인 정보, 송금 금액 또는 송금 명령어 중 적어 도 하나에 대한 정보가 없음을 나타내는 문구를 표시할 수 있다. 사용자가 상기 정보들 중 적어도 하나의 정보 를 음성 또는 문자로 입력하면, 프로세서는 데이터 인식부로부터 획득된 인식 엔티티 값 및 사용자입력 정보를 이용하여, 송금을 위한 프로세서를 수행할 수 있다. 다른 실시예로, 데이터 인식 모델은 사용자의 결제 의도를 추정하기 위하여 설정된 모델일 수 있다. 이 경우, 데이터 인식부는 사용자의 음성 또는 음성이 인식된 문장을 데이터 인식 모델에 적용하여 사용자의 결제 의도를 추정할 수 있다. 예로, 데이터 인식부는 사용자의 음성 또는 음성이 인식된 문장으로부터 인식 엔 티티를 획득할 수 있다. 인식 엔티티는, 예로, 결제 수단, 결제 품목, 결제 방식 및 결제 명령어 중 적어도 하 나를 포함할 수 있다. 데이터 인식부는 획득된 인식 엔티티를 프로세서에게 제공할 수 있다. 프로세 서(또는, 프로세서는 인식 엔티티에 기초하여 사용자 의도를 판단할 수 있다. 인식 엔티티에 기초하여 사용자의 의도가 결제 의도가 없다고 판단되면, 프로세서는 결제를 위한 프로세스 를 수행하지 않을 수 있다. 반면에, 인식 엔티티에 기초하여 사용자의 의도가 결제 의도가 있다고 판단되면, 프 로세서는 결제를 위한 프로세스를 수행할 수 있다. 한편, 인식 엔티티의 값들 중 적어도 하나의 값이 'NULL'인 경우, 프로세서는 사용자의 이력 정보 또는 기 설정된 정보를 이용하여 'NULL' 값에 대응하는 값을 결정할 수 있다. 또는, 프로세서는 'NULL' 값에 대응하 는 값을 사용자에게 요청할 수도 있다. 데이터 학습부 및 데이터 인식부 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 학습부 및 데이터 인식부 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로 세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각 종 전자 장치에 탑재될 수도 있다. 이 때, 인공 지능을 위한 전용 하드웨어 칩은 확률 연산에 특화된 전용 프로 세서로서, 기존의 범용 프로세서보다 병렬처리 성능이 높아 기계 학습과 같은 인공 지능 분야의 연산 작업을 빠 르게 처리할 수 있다. 이 경우, 데이터 학습부 및 데이터 인식부는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 학습부 및 데이터 인식부 중 하나는 전 자 장치에 포함되고, 나머지 하나는 서버에 포함될 수 있다. 또한, 데이터 학습부 및 데이터 인식부 는 유선 또는 무선으로 통하여, 데이터 학습부가 구축한 모델 정보를 데이터 인식부로 제공 할 수도 있고, 데이터 인식부로 입력된 데이터가 추가 학습 데이터로서 데이터 학습부로 제공될 수 도 있다. 한편, 데이터 학습부 및 데이터 인식부 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이 터 학습부 및 데이터 인식부 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포 함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소 프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플 리케이션에 의해 제공될 수 있다. 도 12는 일부 실시예에 따른 데이터 학습부의 블록도이다. 도 12를 참조하면, 일부 실시예에 따른 데이터 학습부는 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5)를 포함할 수 있다. 일부 실시예로, 데이 터 학습부는 데이터 획득부(1310-1) 및 모델 학습부(1310-4)를 필수적으로 포함하고, 전처리부(1310-2), 학습 데이터 선택부(1310-3) 및 모델 평가부(1310-5) 중 적어도 하나를 선택적으로 더 포함하거나, 모두 포함하 지 않을 수도 있다. 데이터 획득부(1310-1)는 상황 판단을 위한 학습을 위하여 필요한 데이터를 획득할 수 있다. 예컨대, 데이터 획득부(1310-1)는 음성 데이터, 영상 데이터, 텍스트 데이터 또는 생체신호 데이터 등을 획득할 수 있다. 구체적으로, 데이터 획득부(1310-1)는 송금 또는 결제를 수행하기 위한 음성 또는 문장을 획득할 수 있다. 또는, 상기 데이터 획득부(1310-1)는 송금 또는 결제를 수행하기 위한 음성 또는 문장이 포함된 음성 데 이터 또는 텍스트 데이터를 획득할 수 있다. 데이터 획득부(1310-1)는 전자 장치의 입력 기기(예: 마이크로폰, 카메라 또는 센서 등)를 통해 데이터를 입력 받을 수 있다. 또는, 데이터 획득부(1310-1)는 디바이스와 통신하는 외부 장치(예로, 서버)를 통해 데이터를 획득할 수 있다. 전처리부(1310-2)는 상황 판단을 위한 학습에 획득된 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1310-2)는 후술할 모델 학습부(1310-4)가 상황 판단을 위한 학습을 위하여 획득된 데이터를 이 용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 예로, 전처리부(1310-2)는 음성 데이터 로부터 기 설정된 포맷에 따라 학습 엔티티 값들을 추출할 수 있다. 예로, 기 설정된 포맷이 {사용자 정보, 수 신인 정보, 이체 금액, 송금 명령어}로 구성되거나, 또는 기 설정된 포맷이 {결제 수단, 결제 품목, 결제 방식, 결제 명령어}로 구성된 경우, 전처리부(1310-2)는 음성 데이터로부터 상기 포맷에 따른 학습 엔티티 값을 추출 할 수 있다. 이 때, 학습 엔티티 값이 추출되지 않는 경우, 전처리부(1310-2)는 특정 엔티티 값을 'NULL'로 표 시할 수 있다. 학습 데이터 선택부(1310-3)는 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 선택된 데이터 는 모델 학습부(1310-4)에게 제공될 수 있다. 이 경우, 데이터 획득부(1310-1)가 획득한 데이터 또는 전처리부 (1310-2)가 가공한 데이터가 학습 데이터로서 모델 학습부(1310-4)에게 제공될 수도 있다. 학습 데이터 선택부 (1310-3)는 상황 판단을 위한 기 설정된 기준에 따라, 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 기 설정된 기준은 예로, 데이터의 속성, 데이터의 생성 시간, 데이터의 생성자, 데이터의 신뢰도, 데 이터의 대상, 데이터의 생성 지역 및 데이터의 크기 중 적어도 하나를 고려하여 결정될 수 있다. 또는, 학습 데 이터 선택부(1310-3)는 후술할 모델 학습부(1310-4)에 의한 학습에 의해 기 설정된 기준에 따라 데이터를 선택 할 수도 있다. 모델 학습부(1310-4)는 학습 데이터에 기초하여 상황을 어떻게 판단할 지에 관한 기준을 학습할 수 있다. 또한, 모델 학습부(1310-4)는 상황 판단을 위하여 어떤 학습 데이터를 이용해야 하는 지에 대한 기준을 학습할 수도 있다. 예로, 모델 학습부(1310-4)는 지도 학습 방식 또는 비지도 학습 방식에 따라 판단 모델을 학습시켜서, 예 측, 결정 또는 추정을 이끌어내기 위한 데이터 인식 모델을 생성할 수 있다. 데이터 인식 모델은, 예로, 사용자 의 송금 의도를 추정하기 위하여 설정된 모델이거나, 사용자의 결제 의도를 추정하기 위하여 설정된 모델일 수 있다. 또한, 모델 학습부(1310-4)는 상황 판단에 이용되는 데이터 인식 모델을 학습 데이터를 이용하여 학습시킬 수 있다. 데이터 인식 모델은 미리 구축된 모델일 수도 있다. 예를 들어, 데이터 인식 모델은 기본 학습 데이터(예 를 들어, 샘플 데이터 등)을 입력 받아 미리 구축된 모델일 수 있다. 데이터 인식 모델은, 인식 모델의 적용 분야, 학습의 목적 또는 장치의 컴퓨터 성능 등을 고려하여 구축될 수 있다. 데이터 인식 모델은, 예를 들어, 신경망(Neural Network)을 기반으로 하는 모델일 수 있다. 데이터 인식 모델은 인간의 뇌 구조를 컴퓨터 상에서 모의하도록 설계될 수 있다. 데이터 인식 모델은 인간의 신경망의 뉴런 (neuron)을 모의하는, 가중치를 가지는 복수의 네트워크 노드들을 포함할 수 있다. 복수의 네트워크 노드들은 시냅스(synapse)를 통하여 신호를 주고 받는 뉴런의 시냅틱(synaptic) 활동을 모의하도록 각각 연결 관계를 형 성할 수 있다. 데이터 인식 모델은, 일 예로, 신경망 모델, 또는 신경망 모델에서 발전한 딥 러닝 모델을 포함 할 수 있다. 딥 러닝 모델에서 복수의 네트워크 노드들은 서로 다른 깊이(또는, 레이어)에 위치하면서 컨볼루션 (convolution) 연결 관계에 따라 데이터를 주고 받을 수 있다. 예컨대, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network)과 같은 모델이 데이터 인식 모델로서 사용될 수 있으나, 이에 한정되지 않는다. 다양한 실시예에 따르면, 모델 학습부(1310-4)는 미리 구축된 데이터 인식 모델이 복수 개가 존재하는 경우, 입 력된 학습 데이터와 기본 학습 데이터의 관련성이 큰 데이터 인식 모델을 학습할 데이터 인식 모델로 결정할 수 있다. 이 경우, 기본 학습 데이터는 데이터의 타입 별로 기 분류되어 있을 수 있으며, 데이터 인식 모델은 데이 터의 타입 별로 미리 구축되어 있을 수 있다. 예를 들어, 기본 학습 데이터는 학습 데이터가 생성된 지역, 학습 데이터가 생성된 시간, 학습 데이터의 크기, 학습 데이터의 장르, 학습 데이터의 생성자, 학습 데이터 내의 오 브젝트의 종류 등과 같은 다양한 기준으로 기 분류되어 있을 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient descent)을 포함하는 학습 알고리즘 등을 이용하여 데이터 인식 모델을 학습시킬 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 학습 데이터를 입력 값으로 하는 지도 학습(supervised learning) 을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 별다른 지도없이 상 황 판단을 위해 필요한 데이터의 종류를 스스로 학습함으로써, 상황 판단을 위한 기준을 발견하는 비지도 학습(unsupervised learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또한, 모델 학습부(1310-4)는, 예 를 들어, 학습에 따른 상황 판단의 결과가 올바른 지에 대한 피드백을 이용하는 강화 학습(reinforcement learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 학습 데이터는, 사용자 또는 제 3자의 음성, 사용자 또는 제 3자의 음성이 인식된 문장, 사용자 또는 제 3자가 입력한 문장 등을 포함할 수 있다. 또한, 학습 데이터는 상기 음성 또는 문장과 관련된 학습 엔티티를 포함할 수도 있다. 학습 엔티티의 다양한 예는 도 11을 대상으로 상세히 전술하여 중복되는 설명은 생략한다. 또한, 데이터 인식 모델이 학습되면, 모델 학습부(1310-4)는 학습된 데이터 인식 모델을 저장할 수 있다. 이 경 우, 모델 학습부(1310-4)는 학습된 데이터 인식 모델을 데이터 인식부를 포함하는 전자 장치(예로, 전술 한 디바이스)의 메모리에 저장할 수 있다. 또는, 모델 학습부(1310-4)는 학습된 데이터 인식 모델을 후술할 데이터 인식부를 포함하는 전자 장치의 메모리에 저장할 수 있다. 또는, 모델 학습부(1310-4)는 학습된 데이터 인식 모델을 전자 장치(예로, 전술한 디바이스)와 유선 또는 무선 네트워크로 연결되는 서버의 메모 리에 저장할 수도 있다. 이 경우, 학습된 데이터 인식 모델이 저장되는 메모리는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소 에 관계된 명령 또는 데이터를 함께 저장할 수도 있다. 또한, 메모리는 소프트웨어 및/또는 프로그램을 저장할 수도 있다. 프로그램은, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API) 및/또는 어플리 케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 모델 평가부(1310-5)는 데이터 인식 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 인식 결과가 소정 기준을 만족하지 못하는 경우, 모델 학습부(1310-4)로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터는 데이터 인식 모델을 평가하기 위한 기 설정된 데이터일 수 있다. 예를 들어, 모델 평가부(1310-5)는 평가 데이터에 대한 학습된 데이터 인식 모델의 인식 결과 중에서, 인식 결 과가 정확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정된 임계치를 초과하는 경우 소정 기준을 만족하 지 못한 것으로 평가할 수 있다. 예컨대, 소정 기준이 비율 2%로 정의되는 경우, 학습된 데이터 인식 모델이 총 1000개의 평가 데이터 중의 20개를 초과하는 평가 데이터에 대하여 잘못된 인식 결과를 출력하는 경우, 모델 평 가부(1310-5)는 학습된 데이터 인식 모델이 적합하지 않은 것으로 평가할 수 있다. 한편, 학습된 데이터 인식 모델이 복수 개가 존재하는 경우, 모델 평가부(1310-5)는 각각의 학습된 데이터 인식 모델에 대하여 소정 기준을 만족하는지를 평가하고, 소정 기준을 만족하는 모델을 최종 데이터 인식 모델로서 결정할 수 있다. 이 경우, 소정 기준을 만족하는 모델이 복수 개인 경우, 모델 평가부(1310-5)는 평가 점수가 높은 순으로 미리 설정된 어느 하나 또는 소정 개수의 모델을 최종 데이터 인식 모델로서 결정할 수 있다. 한편, 데이터 학습부 내의 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위 한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각종 전자 장치에 탑재될 수도 있다. 또한, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5)는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 일부는 전자 장치에 포함되고, 나머지 일부는 서버에 포함될 수 있다. 또한, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(1310-1), 전처리부(1310- 2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다.도 13은 일부 실시예에 따른 데이터 인식부의 블록도이다. 도 13을 참조하면, 일부 실시예에 따른 데이터 인식부는 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5)를 포함할 수 있다. 일부 실시예로, 데이터 인식부는 데이터 획득부(1320-1) 및 인식 결과 제공부(1320-4)를 필수적으로 포함하고, 전처리부 (1320-2), 인식 데이터 선택부(1320-3) 및 모델 갱신부(1320-5) 중 적어도 하나를 선택적으로 더 포함할 수 있 다. 데이터 획득부(1320-1)는 상황 판단에 필요한 데이터를 획득할 수 있다. 예로, 데이터 획득부(1320-1)는 사용자 의 음성 또는 음성이 인식된 문장을 획득할 수 있다. 구체적으로, 데이터 획득부(1320-1)는 송금 또는 결제를 수행하기 위한 사용자의 음성 또는 문장을 획득할 수 있다. 또는, 상기 데이터 획득부(1320-1)는 송금 또는 결 제를 수행하기 위한 사용자의 음성 또는 문장이 포함된 음성 데이터 또는 텍스트 데이터를 획득할 수 있다. 전처리부(1320-2)는 상황 판단을 위해 획득된 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1320-2)는 후술할 인식 결과 제공부(1320-4)가 상황 판단을 위하여 획득된 데이터를 이용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 예로, 전처리부(1320-2)는 음성 데이터로부터 기 설정된 포맷에 따라 학습 엔티티 값들을 추출할 수 있다. 예로, 전처리부(1320-2)는 {사용자 정보, 수신인 정보, 이체 금액, 송금 명령어} 또는 {결제 수단, 결제 품목, 결제 방식, 결제 명령어}의 포맷에 따라 학습 엔 티티 값을 추출할 수 있다."}
{"patent_id": "10-2017-0132758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "인식 데이터 선택부(1320-3)는 전처리된 데이터 중에서 상황 판단에 필요한 데이터를 선택할 수 있다. 선택된 데이터는 인식 결과 제공부(1320-4)에게 제공될 수 있다. 인식 데이터 선택부(1320-3)는 상황 판단을 위한 기 설정된 기준에 따라, 전처리된 데이터 중에서 일부 또는 전부를 선택할 수 있다. 기 설정된 기준은 예로, 데이 터의 속성, 데이터의 생성 시간, 데이터의 생성자, 데이터의 신뢰도, 데이터의 대상, 데이터의 생성 지역 및 데 이터의 크기 중 적어도 하나를 고려하여 결정될 수 있다. 또는, 인식 데이터 선택부(1320-3)는 모델 학습부 (1310-4)에 의한 학습에 의해 기 설정된 기준에 따라 데이터를 선택할 수도 있다. 인식 결과 제공부(1320-4)는 선택된 데이터를 데이터 인식 모델에 적용하여 상황을 판단할 수 있다. 인식 결과 제공부(1320-4)는 데이터의 인식 목적에 따른 인식 결과를 제공할 수 있다. 인식 결과 제공부(1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 입력 값으로 이용함으로써, 선택된 데이터를 데이터 인식 모델 에 적용할 수 있다. 또한, 인식 결과는 데이터 인식 모델에 의해 결정될 수 있다. 예로, 데이터 인식 모델이 사용자의 송금 의도를 추정하기 위하여 설정된 모델인 경우, 인식 결과 제공부(1320- 4)는 사용자의 음성 또는 음성이 인식된 문장을 상기 데이터 인식 모델에 적용하여 사용자의 송금 의도를 추정, 추론 또는 예측할 수 있다. 또는, 데이터 인식 모델이 사용자의 결제 의도를 추정하기 위하여 설정된 모델인 경 우, 인식 결과 제공부(1320-4)는 사용자의 음성 또는 음성이 인식된 문장을 상기 데이터 인식 모델에 적용하여 사용자의 결제 의도를 추정(또는, 추론 또는 예측)할 수 있다. 인식 결과 제공부(1320-4)는 사용자 의도를 추정한 결과로서 인식 엔티티를 획득할 수 있다. 인식 결과 제공부 (1320-4)는 획득된 인식 엔티티를 프로세서(예로, 도 2의 디바이스의 프로세서)에게 제공할 수 있다. 프로세서는 인식 엔티티에 기초하여 사용자의 의도를 판단하고, 송금 또는 결제를 위한 프로세스를 진행할 수 있다. 모델 갱신부(1320-5)는 인식 결과 제공부(1320-4)에 의해 제공되는 인식 결과에 대한 평가에 기초하여, 데이터 인식 모델이 갱신되도록 할 수 있다. 예를 들어, 모델 갱신부(1320-5)는 인식 결과 제공부(1320-4)에 의해 제공 되는 인식 결과를 모델 학습부(1310-4)에게 제공함으로써, 모델 학습부(1310-4)가 데이터 인식 모델을 갱신하도 록 할 수 있다. 또는, 모델 갱신부(1320-5)는 프로세서(예로, 도 2의 디바이스의 프로세서)로부터 인식 결과에 대한 평 가(또는, 피드백)을 수신할 수 있다. 예로, 디바이스는 사용자가 입력한 음성을 데이터 인식 모델에 적용하 여 사용자의 송금 의도에 따른 송금 내역을 표시할 수 있다. 사용자는 송금 내용을 승인하거나 또는 승인을 거절할 수 있다. 예로, 사용자가 송금 내역을 승인하는 경우, 사 용자는 음성, 지문, 홍채, 정맥 또는 비밀번호 등을 입력할 수 있다. 반면에, 사용자가 송금 내역의 승인을 거 절하는 경우, 사용자는 취소 버튼을 선택하거나, 취소를 요청하는 음성을 입력하거나, 일정 시간 이상 동안 별도의 입력을 수행하지 않을 수 있다. 이 경우, 사용자의 승인 또는 승인 거절에 따른, 사용자 피드백은 인식 결과에 대한 평가로서 모델 갱신부 (1320-5)에게 제공될 수 있다. 즉, 사용자 피드백은 데이터 인식부의 판단 결과가 틀림(false)을 나타내 는 정보 또는 판단 결과가 맞음(true)을 나타내는 정보를 포함할 수 있다. 모델 갱신부(1320-5)는 획득된 사용 자 피드백을 이용하여 판단 모델을 갱신할 수 있다. 한편, 데이터 인식부 내의 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320- 3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각종 전자 장치에 탑재 될 수도 있다. 또한, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5)는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부 (1320-4) 및 모델 갱신부(1320-5) 중 일부는 전자 장치에 포함되고, 나머지 일부는 서버에 포함될 수 있다. 또한, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(1320-1), 전처리부 (1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 도 14는 일부 실시예에 따른 디바이스 및 서버가 서로 연동함으로써 데이터를 학습하고 인식하는 예시를 나타내는 도면이다. 디바이스는, 예로, 도 2의 디바이스에 대응될 수 있다. 또한, 디바이스의 데이터 인식부(132 0)의 구성 요소인 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부 (1320-4) 및 모델 갱신부(1320-5) 각각은, 도 13의 데이터 인식부의 데이터 획득부(1320-1), 전처리부 (1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5)에 대응될 수 있다. 또한, 서버의 데이터 학습부의 구성 요소인 데이터 획득부, 전처리부, 학습 데이터 선 택부, 모델 학습부 및 모델 평가부 각각은, 도 12의 데이터 학습부의 데이터 획득부 (1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4), 모델 평가부(1310-5)에 대응 될 수 있다. 디바이스는 근거리 또는 원거리 통신을 통하여 서버와 서로 연동할 수 있다. 디바이스 및 서 버가 서로 연결된다는 것은 디바이스와 서버가 직접 연결되거나, 또는 다른 구성 요소(예로, 제3 구성요소로서, AP(access point), 허브(hub), 중계기기, 기지국, 공유기 및 게이트웨이(gateway) 중 적어 도 하나)를 통하여 연결되는 것을 포함할 수 있다. 도 14를 참조하면, 서버는 상황 판단을 위한 기준을 학습할 수 있으며, 디바이스는 서버에 의한 학습 결과에 기초하여 상황을 판단할 수 있다. 이 경우, 서버의 모델 학습부는 도 12에 도시된 데이터 학습부의 기능을 수행할 수 있다. 서 버의 모델 학습부는 소정의 상황을 판단하기 위하여 어떤 데이터를 이용할 지, 데이터를 이용하여 상황을 어떻게 판단할 지에 관한 기준을 학습할 수 있다. 모델 학습부는 학습에 이용될 데이터를 획득하 고, 획득된 데이터를 데이터 인식 모델에 적용함으로써, 상황 판단을 위한 기준을 학습할 수 있다. 예로, 모델 학습부는 음성 또는 문장을 이용하여 데이터 인식 모델을 학습시켜서, 사용자의 의도를 추정하도록 설정 된 데이터 인식 모델을 생성할 수 있다. 생성된 데이터 인식 모델은, 예로, 사용자의 송금 의도 및 결제 의도 중 적어도 하나를 추정하기 위하여 설정된 모델일 수 있다. 디바이스의 인식 결과 제공부(1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 서버(200 0)에 의해 생성된 데이터 인식 모델에 적용하여 상황을 판단할 수 있다. 예를 들어, 인식 결과 제공부(1320- 4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 서버에게 전송하고, 서버가 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 데이터 인식 모델에 적용하여 상황을 판단할 것을 요청할 수 있다. 또 한, 인식 결과 제공부(1320-4)는 서버에 의해 판단된 상황에 관한 정보를 서버로부터 수신할 수 있 다. 예로, 선택된 데이터가 사용자의 음성 또는 음성이 인식된 문장을 포함하는 경우, 서버는 선택된 데 이터를 사용자의 의도를 추정하도록 설정된 데이터 인식 모델에 적용하여, 사용자의 의도를 포함하는 인식 엔티 티를 획득할 수 있다. 그리고, 서버는 획득된 엔티티를 판단된 상황에 대한 정보로서 인식 결과 제공부 (1320-4)에게 제공할 수 있다. 다른 예로, 디바이스의 인식 결과 제공부(1320-4)는 서버에 의해 생성된 인식 모델을 서버로 부터 수신하고, 수신된 인식 모델을 이용하여 상황을 판단할 수 있다. 이 경우, 디바이스의 인식 결과 제 공부(1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 서버로부터 수신된 데이터 인식 모 델에 적용하여 상황을 판단할 수 있다. 예로, 선택된 데이터가 사용자의 음성 또는 음성이 인식된 문장을 포함 하는 경우, 디바이스의 인식 결과 제공부(1320-4)는 상기 선택된 데이터를 서버로부터 수신된 사용 자의 의도를 추정하도록 설정된 데이터 인식 모델에 적용하여, 사용자의 의도를 포함하는 인식 엔티티를 획득할 수 있다. 그리고, 디바이스는 획득된 엔티티를 판단된 상황에 대한 정보로서 프로세서(예로, 도 2의 프로 세서)에게 제공할 수 있다. 프로세서는 인식 엔티티에 기초하여, 사용자의 송금 의도 또는 결제 의도를 판단하고, 송금 또는 결제를 위 한 프로세스를 수행할 수 있다. 일 실시 예에 따른 디바이스는 음성 입력만으로 수신인에게 송금할 수 있다. 일 실시 예에 따른 디바이스는 수신인의 계좌번호 없이도, 수신인의 이름, 연락처 및 금액을 은행 서버(2 0)로 전송하여 수신인에게 송금할 수 있다. 일 실시 예에 따른 디바이스는 음성 입력만으로 결제를 할 수 있다. 도 15 및 도 16은 일부 실시예에 따른 데이터 인식 모델을 이용하는 네트워크 시스템의 흐름도들이다. 도 15 및 도 16에서, 네트워크 시스템은 제1 구성 요소(1501,1601) 및 제2 구성 요소(1502, 1602)를 포함할 수 있다. 여기서, 제1 구성 요소(1501,1601)는 디바이스이고, 제2 구성 요소(1502, 1602)는 데이터 분석 모 델이 저장된 서버가 될 수 있다. 또는, 제1 구성 요소(1501,1601)는 범용 프로세서이고, 제2 구성 요소 (1502, 1602)는 인공 지능 전용 프로세서가 될 수 있다. 또는, 제1 구성 요소(1501,1601)는 적어도 하나의 어플 리케이션이 될 수 있고, 제2 구성 요소(1502, 1602)는 운영 체제(operating system, OS)가 될 수 있다. 즉, 제 2 구성 요소(1502, 1602)는 제1 구성 요소(1501,1601)보다 더 집적화되거나, 전용화되거나, 딜레이(delay)가 작 거나, 성능이 우세하거나 또는 많은 리소스를 가진 구성 요소로서, 데이터 인식 모델의 생성, 갱신 또는 적용 시에 요구되는 많은 연산을 제1 구성 요소(1501,1601)보다 신속하고 효과적으로 처리할 수 있는 구성 요소가 될 수 있다. 이 경우, 제1 구성 요소(1501,1601) 및 제2 구성 요소(1502, 1602) 간에 데이터를 송/수신하기 위한 인터페이스 가 정의될 수 있다. 예로, 데이터 인식 모델에 적용할 학습 데이터를 인자 값(또는, 매개 값 또는 전달 값)으로 갖는 API(application program interface)가 정의될 수 있다. API는 어느 하나의 프로토콜(예로, 디바이스에 서 정의된 프로토콜)에서 다른 프로토콜(예로, 서버에서 정의된 프로토콜)의 어떤 처리를 위해 호출할 수 있는 서브 루틴 또는 함수의 집합으로 정의될 수 있다. 즉, API를 통하여 어느 하나의 프로토콜에서 다른 프로 토콜의 동작이 수행될 수 있는 환경이 제공될 수 있다. 도 15에서, 제1 구성 요소는 데이터 인식 모델을 이용하여 사용자의 송금 의도를 분석할 수 있다. 단계 1511에서, 제1 구성 요소는 송금 의도를 가지고 발화하는 사용자의 음성을 수신할 수 있다. 단계 1513에서, 제1 구성 요소는 수신된 음성 또는 음성을 인식한 문장을 제2 구성 요소에게 전송 할 수 있다. 예로, 제1 구성 요소는 데이터 인식 모델의 이용을 위하여 제공되는 API 함수의 인자 값으로 음성 또는 문장을 적용할 수 있다. 이 경우, API 함수는 음성 또는 문장을 데이터 인식 모델에 적용할 인식 데 이터로서 제2 구성 요소에게 전송할 수 있다. 이 때, 음성 또는 문장은 약속된 통신 포맷에 따라 변경되어 전송될 수 있다. 단계 1515에서, 제2 구성 요소는 수신된 음성 또는 문장을 사용자의 송금 의도를 추정하도록 설정된 데이 터 인식 모델에 적용할 수 있다. 적용 결과로서, 단계 1517에서, 제2 구성 요소는 인식 엔티티를 획득할 수 있다. 예로, 인식 엔티티는 사 용자 정보, 수신인 정보(예로, 수신인의 이름), 송금 금액 및 송금 명령어 중 적어도 하나를 포함할 수 있다. 단계 1519에서, 제2 구성 요소는 인식 엔티티를 제1 구성 요소로 전송할 수 있다. 이 때, 인식 엔 티티는 약속된 통신 포맷에 따라 변경되어 전송될 수 있다. 단계 1521에서, 제1 구성 요소는 인식 엔티티에 기초하여, 사용자의 음성에 송금 의도가 있음을 판단할 수 있다. 예로, 제1 구성 요소는 인식 엔티티의 송금 명령어 값으로 '송금 진행', 수신인의 이름 및 송금 금액이 포함되어 있으면, 사용자의 음성에 송금 의도가 있음을 판단할 수 있다. 여기서, 단계 1513 내지 단계 1521는, 전술한 도 2의 단계 720에서, 디바이스가 수신된 음성을 분석하여 사 용자의 송금 의도를 판단하는 과정의 일 실시예에 대응될 수 있다. 사용자의 음성에 송금 의도가 있는 것으로 판단되면, 단계 1523에서, 제1 구성요소는 연락처 리스트에서 인식 엔티티에 포함된 수신인의 이름으로 저장된 연락처를 검색할 수 있다. 단계 1525 내지 단계 1529에서, 제1 구성요소는 검색된 수신인의 연락처에 기초하여 수신인의 계좌 번호 로 송금하는 내역을 승인할 수 있다. 이에 대응하는 과정은, 도 7의 단계 740 내지 단계 760에 대응되어 중복되 는 설명은 생략한다. 도 16에서, 제1 구성 요소는 데이터 인식 모델을 이용하여 사용자의 결제 의도를 분석할 수 있다. 단계 1611에서, 제1 구성 요소는 결제 내역을 제공할 수 있다. 예로, 제1 구성 요소는 결제 내역을 화면에 표시하거나, 결제 내역을 음성으로 출력할 수 있다. 사용자는 화면에 표시된 결제 내역을 확인하고, 결제를 할지 또는 결제를 하지 않을지 여부를 음성으로 표현할 수 있다. 단계 1613에서, 제1 구성 요소는 사용자의 음성을 수신할 수 있다. 단계 1615에서, 제1 구성 요소는 수신된 음성 또는 음성을 인식한 문장을 제2 구성 요소에게 전송 할 수 있다. 예로, 제1 구성 요소는 데이터 인식 모델의 이용을 위하여 제공되는 API 함수의 인자 값으로 음성 또는 문장을 적용할 수 있다. 이 경우, API 함수는 음성 또는 문장을 데이터 인식 모델에 적용할 인식 데 이터로서 제2 구성 요소에게 전송할 수 있다. 이 때, 음성 또는 문장은 약속된 통신 포맷에 따라 변경되 어 전송될 수 있다. 단계 1617에서, 제2 구성 요소는 수신된 음성 또는 문장을 사용자의 결제 의도를 추정하도록 설정된 데이 터 인식 모델에 적용할 수 있다. 적용 결과로서, 단계 1619에서, 제2 구성 요소는 인식 엔티티를 획득할 수 있다. 예로, 인식 엔티티는 결 제 수단, 결제 품목, 결제 방식 및 결제 명령어 중 적어도 하나를 포함할 수 있다. 단계 1621에서, 제2 구성 요소는 인식 엔티티를 제1 구성 요소로 전송할 수 있다. 이 때, 인식 엔 티티는 약속된 통신 포맷에 따라 변경되어 전송될 수 있다. 단계 1623에서, 제1 구성 요소는 인식 엔티티에 기초하여, 사용자의 음성에 결제 의도가 있음을 판단할 수 있다. 예로, 결제 엔티티의 결제 명령어 값으로 '결제 취소'가 포함되어 있으면, 제1 구성 요소는 사 용자의 음성에 결제를 진행하지 않을 의도가 있는 것으로 판단할 수 있다. 반면에, 결제 엔티티의 결제 명령어 값으로 '결제 진행'이 포함되어 있으면, 제1 구성 요소는 사용자의 음성에 결제를 진행할 의도가 있는 것으로 판단할 수 있다. 여기서, 단계 1615 내지 단계 1623은, 전술한 도 10의 단계 1030에서, 디바이스가 수신된 음성을 분석하여 사용자의 결제 의도를 판단하는 과정의 일 실시예에 대응될 수 있다. 사용자의 음성에 결제 의도가 있는 것으로 판단되면, 단계 1625 내지 단계 1627에서, 제1 구성 요소는 음 성을 통한 사용자 인증이 성공되면, 결제 정보를 카드사로 전송할 수 있다. 이에 대응하는 과정은, 도 10의 단계 1040 내지 1050에 대응되어 중복되는 설명은 생략한다. 일부 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행 가능한 명령어를 포함하는 기 록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매 체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매 체는 컴퓨터 저장 매체 및 통신 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데 이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발 성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 통신 매체는 전형적으로 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈, 또는 반송파와 같은 변조된 데이터 신호의 기타 데이터, 또는 기타 전송 메커니즘 을 포함하며, 임의의 정보 전달 매체를 포함한다. 또한, 개시된 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)으로 제공될 수 있다. 컴퓨터 프로그램 제품은 S/W 프로그램, S/W 프로그램이 저장된 컴퓨터로 읽을 수 있는 저장 매체 또는 판매자 및 구매자 간에 거래되는 상품을 포함할 수 있다. 예를 들어, 컴퓨터 프로그램 제품은 디바이스 또는 디바이스의 제조사 또는 전자 마켓(예, 구글 플레이 스토어, 앱 스토어)을 통해 전자적으로 배포되는 S/W 프로그램 형태의 상품(예, 다운로더블 앱)을 포함할 수 있 다. 전자적 배포를 위하여, S/W 프로그램의 적어도 일부는 저장 매체에 저장되거나, 임시적으로 생성될 수 있다. 이 경우, 저장 매체는 제조사 또는 전자 마켓의 서버, 또는 중계 서버의 저장매체가 될 수 있다. 또한, 본 명세서에서, “부”는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로 세서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다."}
{"patent_id": "10-2017-0132758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2017-0132758", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따라, 사용자가 음성을 이용하여 송금하는 방법을 설명하기 위한 도면이다. 도 2는 일 실시 예에 따른 디바이스를 설명하기 위한 구성도이다. 도 3은 일 실시 예에 따른 디바이스가 패턴을 학습하는 것을 설명하기 위한 도면이다. 도 4는 일 실시 예에 따라 송금 내역을 승인하는 방법을 설명하기 위한 도면이다. 도 5는 일 실시 예에 따라 복수의 수신인들 중에서 어느 한명을 선택하는 방법을 설명하기 위한 도면이다. 도 6은 일 실시 예에 따라 복수의 은행들 중에서 어느 하나의 은행을 선택하는 방법을 설명하기 위한 도면이다. 도 7은 일 실시 예에 따른 음성을 이용하여 송금하는 방법을 설명하기 위한 순서도이다. 도 8은 또 다른 실시 예에 따라 음성으로 결제하는 방법을 설명하기 위한 도면이다. 도 9는 일 실시 예에 따른 디바이스가 결제 패턴을 학습하는 것을 설명하기 위한 도면이다. 도 10은 일 실시 예에 따라 음성으로 결제하는 방법을 설명하기 위한 순서도이다. 도 11은 일 실시예에 따른 프로세서의 블록도이다. 도 12는 일 실시예에 따른 데이터 학습부의 블록도이다. 도 13 및 도 14는 일 실시예에 따른 디바이스 및 서버가 서로 연동함으로써 데이터를 학습하고 인식하는 예시를 나타내는 도면이다. 도 15 및 도 16은 일부 실시예에 따른 데이터 인식 모델을 이용하는 네트워크 시스템의 흐름도들이다."}
