{"patent_id": "10-2023-0071970", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0173101", "출원번호": "10-2023-0071970", "발명의 명칭": "캐릭터를 이용한 동영상 콘텐츠 제작방법", "출원인": "오로라월드 주식회사", "발명자": "노재연"}}
{"patent_id": "10-2023-0071970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "동영상 콘텐츠 제작방법에 있어서,디스플레이를 포함하는 단말기, 통신 모듈을 포함하는 스테이지 보드 및 상기 스테이지 보드와 상호 반응하는캐릭터를 제공하는 단계;상기 단말기를 통해 사전 질문을 제시하는 단계;상기 스테이지 보드는 상기 캐릭터의 식별 정보, 위치 및 자세 중 적어도 하나의 변화를 감지하는 단계;상기 스테이지 보드가 상기 캐릭터의 식별 정보, 위치 및 자세 중 적어도 하나의 변화를 상기 단말기로 송신하는 단계;상기 단말기의 상기 캐릭터의 변화를 반영하여 디스플레이 하는 단계;상기 캐릭터의 변화에 대응하여 상기 단말기를 통해 사후 질문을 제시하는 단계;상기 단말기를 통해 상기 사후 질문에 대한 사용자의 답변을 저장하는 단계;를 포함하며,상기 사전 질문, 상기 캐릭터의 변화, 상기 사후 질문 및 상기 사후 질문에 대한 사용자의 답변을 이용하여 동영상을 구성하는 것을 특징으로 하는 동영상 콘텐츠 제작방법."}
{"patent_id": "10-2023-0071970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,이전의 상기 사후 질문 또는 상기 사후 질문에 대한 사용자의 답변과 연관된 주제를 검색하고, 검색된 주제에따른 사전 질문의 제시, 캐릭터의 변화의 감지와 디스플레이, 사후 질문의 제시 및 사후 지물에 대한 사용자의답변 저장을 반복하여 동영상의 콘텐츠에 추가하는 것을 특징으로 하는 동영상 콘텐츠 제작방법."}
{"patent_id": "10-2023-0071970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 스테이지 보드는 카드 리더부를 더 포함하며, 상기 캐릭터의 변화와 함께 상기 스테이지 보드에 배치된 카드에 대한 정보를 읽어 상기 단말기로 전달하고,상기 단말기는 상기 캐릭터의 변화와 상기 카드의 정보를 조합하여 디스플레이하는 것을 특징으로 하는 동영상콘텐츠 제작방법."}
{"patent_id": "10-2023-0071970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 카드는 배경카드, 상황카드, 사물카드 중 적어도 하나를 포함하며, 디스플레이되는 배경, 상황 또는 사물에 대한 정보를 포함하는 것을 특징으로 하는 동영상 콘텐츠 제작방법."}
{"patent_id": "10-2023-0071970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0173101-3-제1항에 있어서,상기 질문에 대한 상기 답변을 저장하는 단계에서 영상 녹화 또는 음성 녹음을 이용하는 것을 특징으로 하는 동영상 콘텐츠 제작방법."}
{"patent_id": "10-2023-0071970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 스테이지 보드는 복수의 위치 영역을 포함하고, 상기 캐릭터가 상기 복수의 위치 영역 중 하나에 결속됨에따라 상기 캐릭터의 위치 외에도 식별 정보와 자세에 관한 정보를 읽고, 상기 단말기로 상기 캐릭터의 식별 정보, 위치 및 자세에 관한 정보를 전달하는 것을 특징으로 하는 동영상 콘텐츠 제작방법."}
{"patent_id": "10-2023-0071970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 캐릭터는 고유의 내부 저항을 포함하며, 상기 스테이지 보드는 상기 캐릭터가 결속될 때의 상기 내부 저항의 저항값을 읽어 상기 캐릭터의 식별 정보를 확인하는 것을 특징으로 하는 동영상 콘텐츠 제작방법."}
{"patent_id": "10-2023-0071970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 스테이지 보드는 상기 캐릭터의 하부와 결합 가능한 복수의 회전 베이스 및 상기 회전 베이스와 연동하는기어를 포함하는 인코더를 포함하며, 상기 인코더는 상기 스테이지 보드 상에서 상기 캐릭터의 방향을 특정할 수 있는 자세 정보를 생성하는 것을 특징으로 하는 동영상 콘텐츠 제작방법."}
{"patent_id": "10-2023-0071970", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "동영상 콘텐츠 제작방법은, 디스플레이를 포함하는 단말기, 통신 모듈을 포함하는 스테이지 보드 및 스테이지 보 드와 상호 반응하는 캐릭터를 제공하는 단계, 단말기를 통해 사전 질문을 제시하는 단계, 스테이지 보드는 캐릭 터의 식별 정보, 위치 및 자세 중 적어도 하나의 변화를 감지하는 단계, 스테이지 보드가 캐릭터의 식별 정보, 위치 및 자세 중 적어도 하나의 변화를 단말기로 송신하는 단계, 단말기의 캐릭터의 변화를 반영하여 디스플레이 하는 단계, 캐릭터의 변화에 대응하여 단말기를 통해 사후 질문을 제시하는 단계, 및 단말기를 통해 사후 질문에 대한 사용자의 답변을 저장하는 단계를 포함하며, 저장된 사전 질문, 캐릭터의 변화, 사후 질문 및 사후 질문에 대한 사용자의 답변을 이용하여 동영상을 구성할 수 있다."}
{"patent_id": "10-2023-0071970", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 동영상 콘텐츠의 제작에 관한 것으로서, 보다 자세하게는, 실제 캐릭터를 이용하여 사용자가 동영상 콘텐츠를 직관적으로 제작할 수 있는 동영상 콘텐츠 제작방법에 관한 것이다."}
{"patent_id": "10-2023-0071970", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "창의적인 사람은 주어진 문제를 해결하는 인지적 특성과 이러한 인지적 특성과 보완적인 관계를 갖는 성향적인 특성, 그리고 몰입, 열정으로 표현되는 동기적 특성이 적절히 조화된 사람이라고 보고 있다. 창의적인 사람을 위한 창의성 교육은 인지적 요소, 성향적 요소, 동기적 요소를 구분하여 진행된다. 특히, 유아기에는 창의성 교육이 중요하다고 한다. 유아기는 창의적인 사고의 밑바탕이 되는 상상력이 매우 뛰 어난 시기이고, 다양한 감각을 통해 여러 가지 정보를 민감하게 수용하면서 일정한 사고의 틀을 만들어가는 시 기이기 때문이다. 유아들이 신나게 놀이하는 동안 다양한 놀이방법을 생각해 보는 확산적인 사고과정과 적당한 것을 선택하여 적용해 보는 수렴적인 사고 과정이 반복해서 일어난다. 창의성 교육의 방향은 사고의 확장, 수렴, 문제 해결력 등의 인지적 요소와 독립성, 개방성 등의 성향적 요소, 호기심, 흥미 등의 동기적 요소를 통합적으로 고려하고 있다. 창의성에서 인지적 요소에는 사고의 확장과 수렴 과정을 통한 문제해결 과정 등이 포함될 수 있으며, 성향적 요 소에는 한 가지 과제의 모호함에 대한 참을성, 인내, 성장하려는 욕구, 기꺼이 모험을 하려는 정신, 새로운 경 험에 대한 개방성 등이 포함될 수 있고, 동기적 요소에는 하고 싶은 마음이 있을 때 하기, 한 가지 과제에 대한흥미와 호기심, 만족 및 도전 하는 마음 등이 포함될 수 있다. 창의성을 평가하는 방법 중 하나로 토란스 창의력 검사(Torrance Tests of Creative Thinking)가 있다. 토란스 창의력 검사는 E. P. Torrance가 만들고 현재 세계적으로 광범위하게 사용되고 있는 '창의력 검사'를 한국 표준 화한 것이다. 토란스 창의력 검사에는 유창성, 독창성, 융통성, 정교성, 민감성 등을 평가 요소로 포함하고 있다. 유창성이란 '사고의 유창성'을 의미하며, 아이디어의 양적인 풍부성을 대상으로 하고, 아이디어의 질보다 양을 강조. 어휘, 개념, 표현, 연상의 유창성으로 세분될 수 있다. 독창성이란 '사고의 재구성 능력'을 의미하며, 이미 알고 있는 사물을 새로운 방법을 사용하기 위해 그 사물에 대한 기존의 해석을 버리고 새로운 해석을 하는 능력일 수 있다. 유통성은 '사고의 융통성 혹은 유연성'을 의미하며, 주어진 자극으로서의 사물의 형태나 개념에 대해 보 다 다각적, 다방면의 새로운 아이디어를 내는 능력이며, 개인이 생성해내는 아이디어가 담고 있는 범주의 수로 표현될 수도 있다. 정교성이란 '사고의 정교성'을 의미하며, 중심이 되는 생각이나 문제에 세부사항을 덧붙여 전개 시키거나 문제에 포함된 의미를 명확히 하고, 결핍을 보완할 수 있고, 사고가 피상적인 수준에 머물지 않 고 세부적으로 나갈 수 있는 능력일 수 있다. 민감성은 역동적인 개인과 집단 및 환경의 움직임과 현실을 있는 그대로 정확하게 느끼거나 읽어내는 감도 또는 능력일 수 있다. 한국등록특허 제10-2355026호에는 서적을 이용하여 창의력을 향상시키려는 학습놀이 등이 개시되어 있으며, 한 국공개특허 제10-2022-0142825호에는 예술작품 감상을 매개로 감수성 및 창의력을 향상시키려는 교육 시스템이 개시되어 있다. 이들은 한국공개특허 제10-2022-0142825호와 같이 인터넷이나 네트워크 등을 창의력 교육방법 등이다. 창의력을 향상시키기 위한 방법은 다양하며, 각각의 관점에서 다양한 교육방법이 제안될 수 있다. 유아기 등의 사용자는 동영상 콘텐츠를 제작하는데에 있어서 제한이 있다. 예를 들어, 실제 촬영 장비를 취급하 기에 부족함이 있으며, 고가의 장비를 사용하기에 불안한 부분이 있다. 하지만, 유아기라도 충분히 콘텐츠를 제 작할 수 있으며, 유아기 등의 사용자의 눈높이에 맞는 방법이 필요하다."}
{"patent_id": "10-2023-0071970", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 유아동 또는 기타 사용자를 대상으로 캐릭터를 선택하고, 선택된 캐릭터를 통해 동영상 콘텐츠를 연 계하여 창작할 수 있는 동영상 콘텐츠 제작 방법을 제공한다. 본 발명은 캐릭터의 실제 조작 및 그에 대응하는 단말기의 질문과 답변을 통해서 자연스럽게 사용자가 동영상 콘텐츠의 스토리를 생성할 수 있는 동영상 콘텐츠 제작 방법을 제공한다."}
{"patent_id": "10-2023-0071970", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 본 발명의 목적들을 달성하기 위한 본 발명의 예시적인 일 실시예에 따르면, 동영상 콘텐츠 제작방법은, 디스플레이를 포함하는 단말기, 통신 모듈을 포함하는 스테이지 보드 및 스테이지 보드와 상호 반응하는 캐릭터 를 제공하는 단계, 단말기를 통해 사전 질문을 제시하는 단계, 스테이지 보드는 캐릭터의 식별 정보, 위치 및 자세 중 적어도 하나의 변화를 감지하는 단계, 스테이지 보드가 캐릭터의 식별 정보, 위치 및 자세 중 적어도 하나의 변화를 단말기로 송신하는 단계, 단말기의 캐릭터의 변화를 반영하여 디스플레이 하는 단계, 캐릭터의 변화에 대응하여 단말기를 통해 사후 질문을 제시하는 단계, 및 단말기를 통해 사후 질문에 대한 사용자의 답변 을 저장하는 단계를 포함하며, 저장된 사전 질문, 캐릭터의 변화, 사후 질문 및 사후 질문에 대한 사용자의 답 변을 이용하여 동영상을 구성할 수 있다. 단말기는 상황 또는 질문에 대한 데이터베이스를 포함하거나 접속할 수 있으며, 이전의 사후 질문 또는 사후 질 문에 대한 사용자의 답변과 연관된 주제를 검색하거나 연관도가 높은 주제를 선택할 수 있다. 그리고 선택된 주 제에 따른 다른 사전 질문의 제시, 그에 따른 캐릭터의 변화의 감지와 디스플레이, 연관된 사후 질문의 제시 및 사후 지물에 대한 사용자의 답변 저장을 반복하여 동영상의 콘텐츠에 스토리를 추가할 수 있다. 스테이지 보드는 카드 리더부를 더 포함할 수 있으며, 사용자에 의해서 선택된 캐릭터, 캐릭터의 위치 변화, 캐 릭터의 자세 변화 등의 정보와 함께 스테이지 보드에 배치된 카드에 대한 정보를 읽어 단말기로 전달할 수 있다. 단말기 또는 서버는 캐릭터의 변화와 카드의 정보를 조합하여 단말기에 다른 화면을 디스플레이할 수 있 다.카드는 배경카드, 상황카드, 사물카드 중 적어도 하나를 포함할 수 있으며, 디스플레이되는 배경, 상황 또는 사 물에 대한 정보를 포함할 수 있다. 단말기는 카드에서 제시되는 배경, 사물, 상황 등을 반영하여 단말기의 디스 플레이에 캐릭터 및 그에 따른 배경, 사물, 상황 등을 제시할 수 있다. 단말기 등은 캐릭터의 변화나 배경의 변화 등을 제시하고, 그에 따른 사후 질문 등을 제시할 수 있다. 이에 사 용자는 사후 질문에 대한 답변을 제공하며, 단말기 또는 기타 장비는 사용자의 답변을 영상 녹화 또는 음성 녹 음을 할 수 있다. 저장된 영상이나 녹음은 사용자의 창의력 평가에 이용될 수 있다. 예를 들어, 창의력이 유창성, 독창성, 융통성 등으로 구분될 수 있다고 할 때, 유아동이 상황을 잘 표현하는지 여부, 상황 표현의 명확성, 상황을 표현하는 단어의 개수나 연관성 등을 고려하여 '유창성'을 평가할 수 있으며, 상황을 표현하는 방식이 흔한 방식인지 독 특한 방식인지에 따라 '독창성'을 판단할 수 있다. 그리고 유아동이 사물이나 미래 일어날 수 있는 일 등을 표 현하는 가능성의 개수 등에 따라 '융통성'을 판단할 수 있다. 이런 유창성, 독창성, 융통성 등은 전문가의 평가 를 통해 평가될 수 있지만, 인공지능 학습을 통해서 기존 다른 유아동의 창의력 평가 결과를 반영하여 자동으로 평가하는 것도 가능하다. 스테이지 보드는 복수의 위치 영역을 포함하고, 캐릭터의 변화는 새롭게 선택된 캐릭터의 식별 정보나 위치 변 화, 자세 변화 등을 포함할 수 있다. 일 실시예에 따르면 스테이지 보드에는 복수의 회전 베이스가 장착될 수 있으며, 회전 베이스에는 캐릭터의 하부가 결합 가능하다. 캐릭터에는 캐릭터를 특정할 수 있는 저항을 내장할 수 있으며, 스테이지 보드는 회전 베이스에 장착된 캐릭터의 저항을 측정하여 어떤 캐릭터가 배치되었는지 특정 할 수 있다. 회전 베이스의 하부에는 기어를 포함하는 인코더가 장착될 수 있으며, 인코더는 캐릭터의 방향을 특정할 수 있 는 각도 정보를 생성할 수 있다. 스테이지 보드는 캐릭터의 위치 및 각도를 특정할 수 있는 정보를 단말기로 전 달할 수 있으며, 단말기는 캐릭터를 특정하고, 그 위치 및 각도를 반영하여 디스플레이에 표시할 수 있다."}
{"patent_id": "10-2023-0071970", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 동영상 콘텐츠 제작방법은 유아동과 같이 미숙한 사용자도 실제로 캐릭터를 선택하고, 그 캐릭터에 대한 상황을 설명하면서 스토리를 형성하게 할 수 있다. 그리고 연관된 질문의 제시를 통해서 동영상 콘텐츠를 추가적으로 연계하여 창작할 수 있다. 본 발명의 동영상 콘텐츠 제작방법은 캐릭터의 실제 조작 및 그에 대응하는 단말기의 질문과 답변을 통해서 자 연스럽게 사용자가 동영상 콘텐츠의 스토리를 생성할 수 있기 때문에, 실제 촬영을 하지 않더라도 유아동과 같 은 사용자가 동영상 구성을 진행할 수 있다. 본 발명의 동영상 콘텐츠 제작방법은 연동된 스테이지 보드와 캐릭터를 통해 콘텐츠를 생성 또는 창작할 수 있 고, 캐릭터를 활용하여 다양한 유형, 예를 들어 영상 등의 콘텐츠를 무궁무진하게 창작할 수 있다. 3세 정도의 유아동의 인지발달과 문제해결 능력을 고려할 때, 유아동의 관심과 흥미를 적절히 참여시키면서, 부 모나 교사의 도움 없이 창작 활동을 진행할 수 있다."}
{"patent_id": "10-2023-0071970", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면들을 참조하여 본 발명의 바람직한 실시예를 상세하게 설명하지만, 본 발명이 실시예에 의해 제한되거나 한정되는 것은 아니다. 참고로, 본 설명에서 동일한 번호는 실질적으로 동일한 요소를 지칭하며, 상기 규칙 하에서 다른 도면에 기재된 내용을 인용하여 설명할 수 있고, 당업자에게 자명하다고 판단되거나 반 복되는 내용은 생략될 수 있다. 도 1은 본 발명의 일 실시예에 따른 동영상 콘텐츠 제작방법을 구현할 수 있는 시스템을 설명하기 위한 도면이 고, 도 2는 본 발명의 일 실시예에 따른 동영상 콘텐츠 제작방법을 설명하기 위한 도면이고, 도 3은 본 발명의 일 실시예에 따른 동영상 콘텐츠 제작방법 중 사전 안내 조건을 제시하는 과정을 설명하기 위한 도면이고, 도 4 는 도 1의 스테이지 보드의 내부를 설명하기 위한 도면이고, 도 5 및 도 6은 본 발명의 일 실시예에 따른 동영 상 콘텐츠 제작방법 중 사후 질문과 새로운 사전 질문을 제시하는 과정을 설명하기 위한 도면이다. 도 1 내지 도 6을 참조하면, 본 실시예에 따른 사용자 생성 콘텐츠 제작시스템은 디스플레이를 포함하는 단말기, 통신 모듈을 포함하는 스테이지 보드, 스테이지 보드와 상호 반응하는 캐릭터(A, B, C) 및 카드를 포함할 수 있다. 스테이지 보드는 다수의 회전 베이스가 장착되어 있으며, 회전 베이스의 상부에는 오각형의 홈 이 형성될 수 있다. 오각형 홈에 대응하여 캐릭터(A, B, C)의 하부도 오각형으로 형성되며, 캐릭터(A, B, C)의 하부가 장착되면서, 회전 베이스와는 전기적으로 연결되는 동시에, 회전 베이스와 함께 회 전 및 정지하여 바라보는 방향을 바꿀 수 있다. 스테이지 보드의 내부에는 PCB 회로기판이 제공될 수 있으며, 회전 베이스에 있는 베이스 자석 이 회전 베이스의 오각형 홈에 노출될 수 있다. 캐릭터(A, B, C)의 하부에도 베이스 자석 에 대응하는 자석 단자가 제공될 수 있으며, 캐릭터(A, B, C)가 회전 베이스에 일시 고정되는 동시에, 베이스 자석을 통해서 PCB 회로기판과 연결될 수 있다. 캐릭터(A, B, C)의 하부에는 고유의 저항값을 갖는 저항이 제공될 수 있다. 따라서, 스테이지 보드 는 캐릭터(A, B, C)가 회전 베이스에 결합되면서, 그 위치 및 캐릭터의 종류를 특정할 수 있다. 본 실시예에서는 캐릭터의 내부 저항을 이용하여 캐릭터의 식별 정보를 파악하지만, 경우에 따라서는 RFID나 카 메라 등을 이용하는 것도 가능하다. 도 4를 보면, 회전 베이스의 하부에는 기어를 포함하는 인코더가 PCB 회로기판에 장착될 수 있으며, 인코더는 기어의 회전 각도를 계산하여, 회전 베이스에 장착된 캐릭터(A, B, C)가 어느 방향을 향하는지 각도 정보를 생성할 수 있다. 회전 베이스는 스테이지 보드의 상면에 회전 가능하게 장착되며 그 이음새에는 링형 커버가 있 어 회전 베이스의 이탈을 방지할 수 있다. 도 2를 보면, 동영상 콘텐츠 제작방법은 유아동과 같은 사용자가 부모나 교사의 도움을 받아 진행할 수 있다. 단말기를 통해 어플리케이션이나 서버에 접속하면, 단말기를 통해서 사전 질문을 제시할 수 있다. 예를 들어, 유아동에게 캐릭터를 소개하고, 캐릭터의 특성을 간단히 설명할 수 있다. 그리고 유아동에게 캐릭터 하나를 선택하여 스테이지 보드에 위치시키도록 안내할 수 있다. 유아동은 도 1의 실제 캐릭터(A, B, C) 중 하나를 선택하여 스테이지 보드의 원하는 위치의 회전 베이스 에 캐릭터(A, B, C)를 위치시킬 수 있다. 상술한 바와 같이, 캐릭터(A, B, C)의 하부에 있는 저항 에 따라 어느 캐릭터가 선택되었는지를 확인할 수 있으며, 스테이지 보드는 선택된 캐릭터(A) 및 위 치, 자세에 대한 정보를 단말기로 제공할 수 있다. 주어진 조건에 따라, 캐릭터의 선택에 대한 단서를 제공할 수 있다. 예를 들어, 단말기나 부모, 교사 등은 카드 등의 사용을 제안할 수 있다. 카드는 배경카드, 상황카드, 사물카드 등이 있을 수 있다. 예를 들어, 배경카드로서 바다, 산, 들판, 도시, 동물원 등의 정보가 표시될 수 있으며, 상황카드로는 축구시합, 소풍, 식 사 등의 정보가 표시될 수 있고, 사물카드에는 축구공, 장난감, 블록, 악기 등의 사물의 정보가 표시될 수 있다. 단말기 등은 바다 배경카드가 카드 리더기에 올려지면, \"바다에 가고 싶어?\", \"어떤 캐릭터와 놀고 싶어해?\", \"여행을 간다면 누구와 같이 가고 싶니?\" 등의 질문을 제시할 수 있다. 질문과 답변은 영상 녹화나 음성 녹음을 통해 저장될 수 있으며, 질문과 답변은 사용자 생성 콘텐츠를 구성하는 데에 있어서, 상황, 단어, 캐릭터 등을 추출하는데에 사용될 수 있다. 스테이지 보드를 통해 선택된 캐릭터(A, B, C)의 정보, 위치, 자세 등이 수신되면, 도 5와 같이, 단말기 는 선택된 캐릭터, 상황, 배경, 사물 등의 정보를 디스플레이할 수 있다. 캐릭터, 상황, 배경, 사물 등을 제시하고, 단말기 등은 현재 상황이 어떤지 질문할 수 있으며, 질문에 따 른 유아동의 답변을 녹화, 녹음 또는 기록할 수 있다. 그 다음 카드를 교체하여, 배경 등을 변경할 수 있으며, 그전에 배경카드를 카드 리더기에 올림으로 써 배경을 교체할 수 있다는 힌트를 제공할 수 있다. 이렇게 다양한 캐릭터(A, B, C) 및 스테이지 보드를 이용하여 유아동이 직관적으로 놀이를 즐길 수 있으며, 능동적인 활동을 통해서 사용자 생성 콘텐츠를 창의적인 과정으로 제작할 수 있다. 저장된 영상이나 녹음은 사용자의 동영상 콘텐츠 제작에 사용될 수 있다. 예를 들어, 도 5와 같이, 캐릭터(A)와 축구공 카드가 선택된 경우, 단말기는 캐릭터 A와 축구공 그리고 캐릭터와 축구공이 어울리는 축구장을 배 경으로 하는 화면을 제시할 수 있다. 그리고 사후 질문으로 \"상황을 설명해주세요\"라는 안내를 제공할 수 있다. 만약, 사용자가 \"알파가 축구공을 골 대에 넣으려 한다\"라고 하면, 단말기는 사후 질문에 대한 답변을 저장할 수 있다. 그 다음 단말기는, 도 6과 같이, 연관된 화면을 제시하고, 그에 따른 새로운 사전 질문, 예를 들어 \"상황을 설 명해 주세요\"를 제공할 수 있다. 이 과정에서 브라보와 같은 새로운 캐릭터가 등장하는 것도 가능하다. 이에 따라, 사용자는 \"알파가 브라보와 골을 넣어 좋아하고 있다\", \"브라보가 뛰어와 알파를 넘어뜨렸다\" 등의 다양한 답변을 제공할 수 있고, 그에 따른 새로운 사전 질문 또는 새로운 캐릭터 변화 등을 수신하면서 스토리 를 구성할 수 있다. 매 질문마다 \"이야기를 계속할까?\"라는 질문을 제공하여, 만약 계속하기를 원하면 다른 질문이나 상황을 유도하 고, 중지를 원하면 지금까지 저장된 사전 질문, 캐릭터 변화, 카드 변화, 사후 질문, 사후 질문에 대한 답변 등 을 조합하여 동영상을 구성할 수 있다. 동영상은 특정 장면만 스냅 사진과 같이 연결하여 제공될 수 있으며, 전 체 캐릭터 등의 변화를 자연스럽게 반영하여 실제 캐릭터가 움직이는 영상을 구성하는 것도 가능하다. 이러한 동영상 제작과정은 사용자의 창의력 평가에 이용될 수 있다. 예를 들어, 창의력이 유창성, 독창성, 융통 성 등으로 구분될 수 있다고 할 때, 유아동이 상황을 잘 표현하는지 여부, 상황 표현의 명확성, 상황을 표현하 는 단어의 개수나 연관성 등을 고려하여 '유창성'을 평가할 수 있으며, 상황을 표현하는 방식이 흔한 방식인지 독특한 방식인지에 따라 '독창성'을 판단할 수 있다. 그리고 유아동이 사물이나 미래 일어날 수 있는 일 등을 표현하는 가능성의 개수 등에 따라 '융통성'을 판단할 수 있다. 이런 유창성, 독창성, 융통성 등은 전문가의 평가를 통해 평가될 수 있지만, 인공지능 학습을 통해서 기존 다른 유아동의 창의력 평가 결과를 반영하여 자동으로 평가하는 것도 가능하다. 스테이지 보드는 복수의 위치 영역을 포함하고, 캐릭터의 정보는 캐릭터가 배치된 위치 정보를 포함할 수 있다. 일 실시예에 따르면 스테이지 보드에는 복수의 회전 베이스가 장착될 수 있으며, 회전 베이스에는 캐릭터의 하 부가 결합 가능하다. 캐릭터에는 캐릭터를 특정할 수 있는 저항을 내장할 수 있으며, 스테이지 보드는 회전 베 이스에 장착된 캐릭터의 저항을 측정하여 어떤 캐릭터가 배치되었는지 특정할 수 있다."}
{"patent_id": "10-2023-0071970", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상술한 바와 같이, 본 발명의 바람직한 실시예를 참조하여 설명하였지만 해당 기술분야의 숙련된 당업자라면 하 기의 청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0071970", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 동영상 콘텐츠 제작방법을 구현할 수 있는 시스템을 설명하기 위한 도면이 다. 도 2는 본 발명의 일 실시예에 따른 동영상 콘텐츠 제작방법을 설명하기 위한 도면이다. 도 3은 본 발명의 일 실시예에 따른 동영상 콘텐츠 제작방법 중 사전 질문을 제시하는 과정을 설명하기 위한 도 면이다. 도 4는 도 1의 스테이지 보드의 내부를 설명하기 위한 도면이다. 도 5 및 도 6은 본 발명의 일 실시예에 따른 동영상 콘텐츠 제작방법 중 사후 질문과 새로운 사전 질문을 제시 하는 과정을 설명하기 위한 도면이다."}
