{"patent_id": "10-2023-0067701", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0169907", "출원번호": "10-2023-0067701", "발명의 명칭": "인공지능 군집 드론을 활용한 인공강우 구름 상태 관측 및 실험 자동화 시스템 및 방법", "출원인": "대한민국", "발명자": "구해정"}}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공강우 구름상태 관측 및 실험 자동화 시스템에 있어서,2기이상의 드론들을 포함하는 군집 드론;상기 군집 드론 내에 포함되며 인공강우 구름상태 관측 및 실험 자동화 장치; 및상기 군집 드론과 무선 데이터 통신을 수행하며, 상기 군집 드론에게 인공강우 실험 및 관측을 지시하는 지상종합운영시스템을 포함하며, 상기 인공강우 구름상태 관측 및 실험 자동화 장치는수액량, 온도, 습도, 기압 및 풍향을 포함하는 기상 정보를 관측 및 수집하는 기상상태 정보 수집 모듈;대기 입자 농도를 포함하는 에어로졸 정보를 실시간 수집하는 대기 에어로졸 정보 수집 모듈;상기 기상 정보 및 에어로졸 정보를 이용하여 머신러닝 기반으로 실시간 구름상태를 판단하고, 상기 실시간 구름상태에 기초하여 인공강우 실험 가능 여부를 결정하고 시딩 작업을 자동화하는 인공지능 자료처리 및 판단 모듈; 및상기 인공지능 자료처리 및 판단 모듈이 상기 인공강우 실험이 가능하다고 판단하면, 인공강우를 위한 시딩을실행하는 시딩물질 자동 시딩 모듈을 포함하는 것을 특징으로 하는 인공강우 구름상태 관측 및 실험 자동화 시스템."}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 자동화는 기상조건 별 미리 입력해둔 시나리오별 고도, 경로, 시점, 살포방법, 시딩량 결정을 포함하는 인공강우 구름상태 관측 및 실험 자동화 시스템."}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 기상상태 정보 수집 모듈은 구름 상태를 3차원적으로 확인 또는 촬영할 수 있는 LWC관측 센서 또는 촬영할수 있는 카메라를 포함하는 것을 특징으로 하는 인공강우 구름상태 관측 및 실험 자동화 시스템."}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 군집 드론에 포함된 각 드론은 최대 이륙 중량은 25 kg 이하이며, 비행 고도는 1 km 이내 범위 내에서 작동되는 것을 특징으로 하는 인공강우 구름상태 관측 및 실험 자동화 시스템."}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 시딩물질 자동 시딩 모듈은 실험물질 점화 또는 분사장치를 작동시키고, 상기 시딩물질의 양을 제어하는공개특허 10-2024-0169907-3-것을 특징으로 하는 인공강우 구름상태 관측 및 실험 자동화 시스템."}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 기상정보 관측 및 상기 인공강우 실험 결과를 저장하고, 상기 기상정보 및 실험 결과를 분석하여 기상 예측 및 감지 모델을 구축하는 데이터 저장 및 분석 모듈을 더 포함하는 것을 특징으로 하는 인공강우 구름상태관측 및 실험 자동화 시스템"}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "에 있어서, 상기 사후 관측 및 실험 결과 분석을 수행하는 단계는상기 시딩 실험 후 풍하측의 반응시간 및 반응거리를 고려하여 시딩 실험 사후 관측을 실시하는 단계, 및 상기 지상종합운영시스템에 상기 군집 드론의 각 드론별 관측 및 실험 결과를 전송하는 단계를 포함하는 것을특징으로 하는 인공강우 구름상태 관측 및 실험 자동화 방법."}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서, 상기 인공지능 모델은 트리 기반, 벡터 기반, 뉴럴 기반의 머신러닝 방법들의 각각의 결과를 보트(vote)하여 이진분류기법을 통해 결정 가능한 것을 특징으로 하는 인공강우 구름상태 관측 및 실험 자동화 방법."}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7에 있어서, 상기 시딩 실험을 실행하는 단계는 상기 시딩 지점과 시점이 결정되면 시딩 연소탄 또는 분사장치를 상기 군집드론에 장착하는 단계를 포함하는 것을 특징으로 하는 인공강우 구름상태 관측 및 실험 자동화 방법."}
{"patent_id": "10-2023-0067701", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7에 있어서,상기 시딩 실험을 실행하는 단계는 시딩 재료의 양과 높이 등을 고려하여 적절한 군집드론 모델과 장착 방식을선택하는 단계를 더 포함하는 것을 특징으로 하는 인공강우 구름상태 관측 및 실험 자동화 방법.공개특허 10-2024-0169907-4-청구항 11"}
{"patent_id": "10-2023-0067701", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공강우 구름상태 관측 및 실험 자동화 시스템은 2기이상의 드론들을 포함하는 군집 드론, 상기 군집 드론 내에 포함되며 인공강우 구름상태 관측 및 실험 자동화 장치, 및 상기 군집 드론과 무선 데이터 통신을 수행하며 상기 군집 드론에게 인공강우 실험 및 관측을 지시하는 지상종합운영시스템을 포함한다. 상기 인공강우 구름상태 관측 (뒷면에 계속)"}
{"patent_id": "10-2023-0067701", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 군집 드론을 활용한 안개 및 하층운 등 구름 발생시 인공강우 실험에 적합한 구름 상태 관 측과 실험 자동화 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0067701", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공강우(또는 인공 강설)은 강수를 내릴 만큼 발달하지 못한 구름에 인위적으로 구름씨 역할을 하는 응결핵 또 는 빙정핵을 뿌려 구름의 발달과 강수 응결을 더욱 활성화해 더 많은 강수를 내리게 하는 기술이다. 일반적으로 인공강우 실험 시 사용되는 인공적인 구름씨를 시딩물질이라고 하고, 구름씨를 뿌리는 것을 시딩(seeding)이라 고 한다. 구름 온도에 따라 강수발달 과정이 다르므로 냉구름(0℃이하의 구름)에는 빙정핵 역할을 하는 요오드 화 은(AgI) 등을 시딩하여 냉구름 속 과냉각 물 입자를 얼음으로 바꿔 빙정을 생산하거나 강화시켜 강수를 유발 한다. 온구름(0℃이상의 구름)에는 흡습성물질인 염화칼슘(CaCl2) 등을 시딩하여 병합과정을 촉진시켜 강수를 유발한다. 시딩물질 살포는 항공 실험을 통해 이루어질 수 있으며, 이는 비행체에 시딩물질 살포 장비를 탑재하여 과냉각 구름물방울이 있는 구름층을 찾아 직접 뿌려주는 방식이다. 최근 무인기 시스템인 드론을 이용한 안개저감 및 인공강우 기술 개발에 대한 시도가 계속되고 있으며, 이를 위 한 다양한 방법을 찾고자 연구가 추진되고 있다. 또한, 드론 및 관련 기술의 진보에 따라서 항공기 접근이 어려 운 지역을 대상으로 안개 및 하층운 발생 시 무인기 활용 기술과 실험효과 지속성을 위해 군집드론을 활용하는 방법이 고려되고 있다. 도 1은 종래 무인기를 이용한 시딩을 설명하기 위한 도면이다. 도 1을 참조하면, 아래 가로축은 거리를 나타내고, 세로축은 고도를 나타내며, 위 가로축은 시간을 나타낸다. 무인기는 연소탄 거치대 및 점화장치를 탑재할 수 있고, 유인기는 구름물리 관측 장비를 탑재할 수 있 다. 도 1에 도시된 예에서, 서풍이 불 경우, 거리상으로는 바람의 방향(또는 이동)을 고려하여 풍상측에서 무인기 가 시딩(seeding)(또는 시딩 실험)을 수행할 수 있고, 풍하측에서 유인기가 시딩에 의한 기상현상(예를 들어, 구름)에 대한 관측을 수행할 수 있다. 지상에서 기상장비를 이용한 관측이 수행될 수 있다. 고도상으로는 비행체들(10 및 20) 각각의 특성에 따라 저층(또는 저고도)에서 무인기가 시딩(또는 시딩실험)을 수행할 수 있고, 고층(또는 고고도)에서 유인기가 관측을 수행할 수 있다. 시간상으로는 비행체들(10 및 20) 간의 충돌 등 위험 요소를 배제하기 위하여 비행체들(10 및 20) 각각은 서로 다른 시간에 실험을 수행할 수 있다. 일례로, 무인기는 T2 동안에 시딩(또는 시딩 실험)을 수행할 수 있고, 유인기는 T3 동안에 관측을 수행할 수 있다. 유인기는 무인기보다 상대적으로 고층 비행이 가능하고 다양한 구름물리 관측 장비들을 탑재할 수 있어, 구름 상부에서의 실험과 관측에 적합할 수 있다. 하지만, 유인기는 약 1km 고도 이하의 저층 비행이 불가능하고, 높은 운용비용과 전문인력이 필요하다. 무인기는 유인기보다 상대적으로 저렴한 운용비용이 필요하고 약 4.5km 이하 고도에서 저층 비행이 가 능하여 상대적으로 저층에 분포한 구름 실험에 적합하다. 하지만, 무인기는 고층 비행과 강한 풍속의 경우 비행이 불가능하고, 무게 제한으로 인한 다양한 실험 장비 탑재가 어려워 일부 장비(예를 들어, 연소탄 거치대 및 점화장치 등)를 탑재할 수 있다. 이와 같이, 기존 안개저감 관련 특허기술은 단일 드론을 활용하여 배터리 충전 등 반복하여 실험을 수행하였으 나, 목표 구름의 관측, 시딩 적정성 판단 자동화, 그리고 연속적인 실험 수행의 활용은 현실적으로 한계가 있다. 이러한 실제적 활용을 위해 2기 이상의 군집 드론의 활용하여 인공강우 실험에 적합한 구름상태 관측과 그 실험 자동화 방안에 대한 기술개발이 필요하다."}
{"patent_id": "10-2023-0067701", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 점을 감안하여, 2기 이상 군집 드론을 활용하여, 안개 및 하층운 대상 인공강우 실험조 건 결정에 관한 구름 관측과 실험 자동화 방법 등 기술을 제공하는 데 그 목적이 있다."}
{"patent_id": "10-2023-0067701", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따라, 인공강우 구름상태 관측 및 실험 자동화 시스템은 2기이상의 드론들을 포함하는 군 집 드론, 상기 군집 드론 내에 포함되며 인공강우 구름상태 관측 및 실험 자동화 장치, 및 상기 군집 드론과 무 선 데이터 통신을 수행하며, 상기 군집 드론에게 인공강우 실험 및 관측을 지시하는 지상종합운영시스템을 포함 하며, 상기 인공강우 구름상태 관측 및 실험 자동화 장치는 수액량, 온도, 습도, 기압 및 풍향을 포함하는 기상 정보를 관측 및 수집하는 기상상태 정보 수집 모듈, 대기 입자 농도를 포함하는 에어로졸 정보를 실시간 수집하 는 대기 에어로졸 정보 수집 모듈, 상기 기상 정보 및 에어로졸 정보를 이용하여 머신러닝 기반으로 실시간 구 름상태를 판단하고, 상기 실시간 구름상태에 기초하여 인공강우 실험 가능 여부를 결정하고 시딩 작업을 자동화 하는 인공지능 자료처리 및 판단 모듈, 및 상기 인공지능 자료처리 및 판단 모듈이 상기 인공강우 실험이 가능 하다고 판단하면, 인공강우를 위한 시딩을 실행하는 시딩물질 자동 시딩 모듈을 포함한다. 상기 자동화는 기상조건별 미리 입력해둔 시나리오별 고도, 경로, 시점, 살포방법, 시딩량 결정을 포함할 수 있 다. 상기 기상상태 정보 수집 모듈은 구름 상태를 3차원적으로 확인 또는 촬영할 수 있는 LWC관측 센서 또는 촬영할 수 있는 카메라를 포함할 수 있다. 상기 군집 드론에 포함된 각 드론은 최대 이륙 중량은 25 kg 이하이며, 비행 고도는 1 km 이내 범위 내에서 작 동될 수 있다. 상기 시딩물질 자동 시딩 모듈은 실험물질 점화 또는 분사장치를 작동시키고, 상기 시딩물질의 양을 제어할 수 있다. 상기 인공강우 구름상태 관측 및 실험 자동화 시스템은 상기 기상정보 관측 및 상기 인공강우 실험 결과를 저장 하고, 상기 기상정보 및 실험 결과를 분석하여 기상 예측 및 감지 모델을 구축하는 데이터 저장 및 분석 모듈을 더 포함할 수 있다. 본 발명의 일 측면에 따라, 인공강우 구름상태 관측 및 실험 자동화 방법은 지상종합운영시스템이 2기 이상의 드론들을 포함하는 군집 드론에 인공강우 실험 및 관측을 위한 비행을 지시하는 단계; 대상 지역의 기상 상태 및 대기 상태를 관측하는 단계; 상기 수집한 기상 상태 정보 및 대기 상태 정보를 인공지능 기반 실험 실시 판 단 예측자료로서 기상 상태 정보 및 대기 상태 정보에 기반으로 작동하는 인공지능 모델에 입력하는 단계; 상기 인공지능 모델에 기초하여 상기 기상 상태 정보 및 상기 대기 상태 정보를 분석하여 실시간 구름상태를 판단하 고 상기 실시간 구름상태에 기초하여 인공강우 실험이 가능한 지의 여부를 판단하는 단계; 상기 실시간 구름상태에 기초하여 구름의 온도, 유형, 높이, 주풍향, 상승속도, 및 수액량을 포함하여 실험 가능성을 최종 판단하 는 단계; 상기 인공강우 실험이 가능하다고 판단되면 적절한 시딩 지점과 시점, 연소탄 종류 및 양을 결정하는 단계; 상기 시딩 지점과 시점이 결정되면 상기 결정된 시딩 지점과 시점에서 시딩 실험을 실행하는 단계; 및 사 후 관측 및 실험 결과 분석을 수행하는 단계를 포함한다. 상기 인공지능 모델은 트리 기반, 벡터 기반, 뉴럴 기반의 머신러닝 방법들의 각각의 결과를 보트(vote)하여 이 진분류기법을 통해 결정할 수 있다. 상기 시딩 실험을 실행하는 단계는 상기 시딩 지점과 시점이 결정되면 시딩 연소탄 또는 분사장치를 상기 군집 드론에 장착하는 단계를 포함할 수 있다. 상기 시딩 실험을 실행하는 단계는 시딩 재료의 양과 높이 등을 고려하여 적절한 군집드론 모델과 장착 방식을 선택하는 단계를 더 포함할 수 있다. 상기 사후 관측 및 실험 결과 분석을 수행하는 단계는 상기 시딩 실험 후 풍하측의 반응시간 및 반응거리를 고 려하여 시딩 실험 사후 관측을 실시하는 단계, 및 상기 지상종합운영시스템에 상기 군집 드론의 각 드론별 관측 및 실험 결과를 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0067701", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 군집 드론과 인공지능 모델을 결합하여 구름상태 관측 및 시딩 실험을 자동화할 수 있는 방법을 제공 하는데 의의를 두고 있다. 이를 통해 기상 예측 및 감지 모델의 개선을 위한 연구를 진행할 수 있을 뿐 아니라, 항공기 및 지상연소기를 활용하기 어려운 지역에서도 원격제어를 통해 시딩 실험을 위한 실험 판단 및 효율적으 로 관리 할 수 있다. 향후, 인공강우 실험이 실용화 단계로 진입할 시 항공기 운영 보다 저가의 복수 드론 사용 을 통해 비용을 절약하면서도 보다 정확하고 효율적인 작업 수행을 가능케 할 수 있을 것으로 예상된다."}
{"patent_id": "10-2023-0067701", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야한다. 각 도면 을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 제1, 제2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어 들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있 고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항 목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 아니하는 것으로 이해되어야 할 것이다.본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서,\" 포함한다\", \"가진다\" 등과 관련된 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 명세서에서 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들 은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 포 함한다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 의미와 일치하는 의미로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명은 2기 이상 군집 드론을 활용하여, 안개 및 하층운 대상 인공강우 실험조건 결정에 관한 구름 관측과 실험 자동화 시스템 및 방법을 제공하는 데 그 목적이 있다. 이하 본 발명의 바람직한 실시예를 첨부된 도면을 참조하여 상세히 설명한다. 도 2은 본 발명의 일실시예에 따른 인공지능 군집 드론을 활용한 인공강우 구름상태 관측 및 실험 자동화 시스 템을 설명하기 위한 도면이다. 도 3은 본 발명의 일실시예에 따른 구름상태 관측 및 실험 자동화 장치의 블록도 이다. 도 2를 참조하면, 인공강우 구름상태 관측 및 실험 자동화 시스템은 지상종합운영시스템, 군집 드론 , 및 구름상태 관측 및 실험 자동화 장치를 포함한다. 군집 드론은 적어도 2기 이상의 드론을 포함할 수 있다. 도 2의 실시예에서 군집 드론은 3기 이상의 드론(210, 220, 230)을 포함하는 것으로 도시되어 있지만, 본 발명은 이에 한정되지 않는다. 군집 드론은 구름상태를 측정하고 인공강우를 시도하기 위해 사용될 수 있다. 군집 드론에 포함된 드 론 각각은 최대 이륙 중량은 25 kg 이하이며, 비행 고도는 1 km 이내 범위 내에서 작동된다. 여기서, 비행 공역 확보 및 운영의 편의를 위해 최대 이륙 중량과 비행고도를 제한하면 실험의 효율성을 높일 수 있다. 또한, 군집 드론에 포함된 드론 각각은 GPS 위치 추적 시스템 장착 등 충돌 방지와 안전한 비행 을 위한 거리 센서 및 안전 장치를 포함할 수 있다. 지상종합운영시스템은 초경량 비행장치 항공운항 관련법에 근거하여 인공강우 실험관측 자동비행임무 명령 개시 및 종료에 관한 군집드론 운영체제를 제어관리하며, 대기상태 모니터링 수신 상태, 실험과정, 사후자료 전 송확인 등을 종합적으로 관리감독한다. 지상종합운영시스템은 군집 드론과 무선 데이터 통신을 수행할 수 있다. 무선 데이터 통신은 무선 통 신을 위한 기술 표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTEA(Long Term Evolution-Advanced) 등)에 따라 수행될 수 있다. 상기 무선 데이터 통신을 통해 지상종합운영시스템은 인공강우 실험 및 관측을 지시하고 그에 따른 비행을 군집 드론의 각 드론(210, 220, 230)에 지시할 수 있다. 이를 위해 군집 드론은 구름상태 관측 및 실험 자동화 장치를 포함할 수 있다. 즉, 군집 드론은 인공 강우 실험 및 관측을 위한 구름상태 관측 및 실험 자동화 장치의 기능들을 수행하는 복수개의 모듈들 을 포함할 수 있다. 일 실시예에 따라, 군집 드론에 포함된 일부 드론이 복수개의 모듈들 중 일부를 포함 할 수 있으며, 다른 일부 드론이 복수개의 모듈중 나머지를 포함할 수 있다. 다른 실시예에 따라, 군집 드론 이 각 드론은 구름상태 관측 및 실험 자동화 장치의 복수개의 모듈들 모두를 포함할 수도 있다. 구름상태 관측 및 실험 자동화 장치는 기상상태 정보 수집 모듈, 대기 에어로졸 정보 수집 모듈 , 인공지능 자료처리 및 판단 모듈, 시딩물질 자동 시딩 모듈, 및 데이터 저장 및 분석 모듈 을 포함한다. 기상상태 정보 수집 모듈은 군집 드론이 구름상태 및 실험조건을 측정할 수 있도록 돕는 기상 정보 수집 모듈로, 수액량, 온도, 습도, 기압, 풍향 등의 기상 정보를 3차원적으로 수집할 수 있다. 또한, 군집 드론 에 장착된 카메라를 통해 구름의 상태를 3차원적으로 확인 및 촬영할 수 있다. 이를 위해, 기상상태 정보 수집 모듈은 기상 정보를 수집할 수 있는 LWC 관측센서, 온도 센서, 습도 센서, 기압 센서, 풍향 센서, 카 메라 등을 포함할 수 있다. 상기 LWC 관측 센서는 구름 상태를 3차원적으로 확인 또는 촬영할 수 있다. 기상상 태 정보 수집 모듈은 기상 정보를 수집한 후 인공지능 자료처리 및 판단 모듈에 제공할 수 있다. 대기 에어로졸 정보 수집 모듈은 군집 드론이 구름응결핵 조건을 측정할 수 있도록 돕는 기상 정보 수집 모듈로, 대기 입자 농도 등 에어로졸 정보를 실시간 수집할 수 있다. 이를 위해 대기 에어로졸 정보 수집 모듈 대기에어로졸 센서를 포함할 수 있다. 대기 에어로졸 정보 수집 모듈은 수집한 에어로졸 정보를 인공지능 자료처리 및 판단 모듈에 제공할 수 있다. 인공지능 자료처리 및 판단 모듈은 실시간 기상 정보 수집 모듈 및 대기 에어로졸 수집 모듈에 서 수집한 기상 정보 및 에어로졸 정보에 기반으로 작동하는 인공지능 모델을 포함할 수 있다. 인공지능 자료처리 및 판단 모듈은 수집한 기상 정보 및 에어로졸 정보를 기반으로 머신러닝 기반 기상 예 측 및 감지 정확도를 향상시킨다. 구체적으로, 인공지능 자료처리 및 판단 모듈은 수집한 기상 정보 및 에 어로졸 정보를 이용하여 인공지능 모델에 따라 실시간 구름상태 및 실험실시 조건을 판단하고, 실시간 구름상태 에 기초하여 인공강우 실험 가능 여부를 결정하여 시딩 작업을 자동화한다. 상기 자동화는 기상조건별 미리 입 력해둔 시나리오별 고도, 경로, 시점, 살포방법, 시딩량 결정을 포함할 수 있다. 예컨대, 인공지능 자료처리 및 판단 모듈은 실시간 구름상태에 기반으로 인공강우 실험이 가능하다고 판단 할 수 있다. 이 경우, 인공지능 자료처리 및 판단 모듈은 시딩 작업을 수행하도록 시딩물질 자동 시딩 모 듈에 지시할 수 있다. 또한, 인공지능 자료처리 및 판단 모듈은 실시간 구름상태에 기반하여 인공강 우 실험이 불가능하다고 판단할 수 있다. 이 경우, 인공지능 자료처리 및 판단 모듈은 시딩물질 자동 시딩 모듈에게 시딩 작업을 지시하지 않는다. 이와 같이, 인공지능 자료처리 및 판단 모듈이 구름상태에 따라 인공강우 실험 여부를 결정하면, 시딩물질 자동 시딩 모듈은 인공강우 실험을 수행하는 결정에 따라 인공강우를 위한 시딩을 실행한다. 시딩물질 자 동 시딩 모듈은 군집 드론에 장착된 실험물질 점화 또는 분사장치를 작동시키고, 그 양을 제어할 수 있다. 데이터 저장 및 분석 모듈은 자동화된 기상관측 및 인공강우 실험 결과를 저장하고, 분석을 통해 보다 정 확한 기상 예측 및 감지 모델을 구축한다. 데이터 저장 및 분석 모듈은 군집 드론에서 수집한 기상 정보 및 실험 결과를 저장하고, 이를 분석하여 기상 예측 및 감지 모델을 개선한다. 도 4는 본 발명의 일실시예에 따른 인공지능 군집 드론을 활용한 인공강우 구름상태 관측 및 실험 자동화 시스 템의 동작을 설명하기 위한 흐름도이다. 먼저, S410에서 지상종합운영시스템이 인공 강우 실험 및 관측을 위한 비행을 군집 드론의 각 드론 (210, 220, 230)에 지시할 수 있다. S420에서, 군집 드론의 구름상태 관측 및 실험 자동화 장치은 기상 상태 및 대기 상태를 관측한다. 구체적으로, 군집 드론의 구름상태 관측 및 실험 자동화 장치는 대상 지역의 기상 상태 및 대기상태 를 관측한다. 이 때, 군집 드론은 안정적인 비행을 위해 적절한 속도와 고도를 유지해야 한다. 구름상태 관측 및 실험 자동화 장치는 기상 관련 센서들 및 대기에어로졸 센서를 이용하여 대기상태 정보를 수집할 수 있다. S430에서, 구름상태 관측 및 실험 자동화 장치는 상기 수집한 기상 상태 정보 및 대기 상태 정보를 인공지 능 기반 실험 실시 판단 예측자료로서 기상 상태 정보 및 대기 상태 정보에 기반으로 작동하는 인공지능 모델에 입력할 수 있다. S440에서, 구름상태 관측 및 실험 자동화 장치는 상기 인공지능 모델에 기초하여 대기 상태 정보 분석 및 인공강우 실행 가능성을 판단한다. 다시 말해, 구름상태 관측 및 실험 자동화 장치은 머신러닝 기반 인공 지능 모델을 포함하고 있다. 상기 머신러닝 기반 인공지능 모델은 기상 상태 정보(예컨대, 수액량, 온도, 습도, 기압, 풍향 등) 및 대기 상 태 정보 (예컨대, 에어로졸 정보)에 기초하여 실시간 구름상태를 판단하고 실시간 구름상태에 기초하여 인공강 우 실험 가능 여부를 결정하는 모델이다. 즉, 상기 머신러닝 기반 인공지능 모델은 기상 상태 정보 및 대기 상태 정보를 입력받으면, 실시간 구름상태를 판단하고 상기 실시간 구름상태에 기초하여 인공강우 실험이 가능한 지의 여부를 출력할 수 있다. 이러한 인공지능 모델은 트리 기반, 벡터 기반, 뉴럴 기반의 머신러닝 방법들의 각각의 결과를 보트(vote)하여 이진분류기법(예 또는 아니오)을 통해 결정 가능할 수 있다. 즉, 구름상태 관측 및 실험 자동화 장치는 상기 실시간 구름상태에 기초하여 구름의 온도, 유형, 높이, 주 풍향, 상승속도, 수액량 등을 포함하여 실험 가능성을 최종 판단한다. S450에서, 인공지능 자료처리 및 판단 모듈은 구름상태 관측 결과 및 기상 예측 결과를 분석하여 인공강우 실험이 가능성이 있다고 판단되면 적절한 시딩 지점(고도 포함), 시점, 군집비행경로, 연소탄 종류 및 양을 결 정한다. S460에서, 시딩 지점과 시점이 결정되면 시딩 연소탄 또는 분사장치가 군집 드론에 장착된다. 이 때, 시딩 재료의 양과 높이 등을 고려하여 적절한 군집드론 모델과 장착 방식을 선택한다. S470에서, 실험 조건이 결정되면 시딩 시나리오별 비행 방법이 자동 결정되며, 각 개체별 드론은 이용하여 안정 적 비행을 유지하며 결정된 시딩 지점과 시점에서 시딩 실험을 실행한다. 즉, S470에서, 군집드론 시딩을 수행 한다. 시딩 실행 후, 군집 드론은 지정된 이착륙 지점으로 복귀한다. 이 때, 시딩량, 시딩 시간, 그리고 배터리 정보 등에 따라 풍하측 방향으로 충돌 방지거리를 확보하면서 동시 시딩 또는 1대씩 번갈아 가면서 자동 시딩 실험을 수행할 수 있다. S480 및 S490에서, 사후 관측 및 실험 결과 분석이 수행된다. 시딩 실험 후 풍하측의 반응시간 및 반응거리를 고려하여 시딩 실험 사후 관측을 실시하며, 지상종합운영시스템에 각 군집 드론 개체별 관측 및 실험 결과 를 전송한다. 수집된 결과는 재분석하여, 해당 실험에 대한 실험 시딩 전후 인공증우량 또는 시정 개선 효과 여 부 등을 평가한다. 이와 같이, 본 발명은 군집 드론과 인공지능 모델을 결합하여 구름상태 관측 및 시딩 실험을 자동화할 수 있는 시스템 및 방법을 제공할 수 있다. 이를 통해 기상 예측 및 감지 모델의 개선을 위한 연구를 진행할 수 있을 뿐 아니라, 항공기 및 지상연소기를 활용하기 어려운 지역에서도 원격제어를 통해 시딩 실험을 위한 실험 판단 및 효율적으로 관리 할 수 있다. 향후, 인공강우 실험이 실용화 단계로 진입할 시 항공기 운영 보다 저가의 복수 드론 사용을 통해 비용을 절약하면서도 보다 정확하고 효율적인 작업 수행을 가능케 할 수 있을 것으로 예상된 다. 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 아니 되 며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시예에 불과할 뿐이 고 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양 한 균등물과 변형예들이 있을 수 있음을 이해하여야 한다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2023-0067701", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 무인기를 이용한 시딩을 설명하기 위한 도면이다. 도 2은 본 발명의 일실시예에 따른 인공지능 군집 드론을 활용한 인공강우 구름상태 관측 및 실험 자동화 시스 템을 설명하기 위한 도면이다. 도 3은 본 발명의 일실시예에 따른 구름상태 관측 및 실험 자동화 장치의 블록도이다. 도 4는 본 발명의 일실시예에 따른 인공지능 군집 드론을 활용한 인공강우 구름상태 관측 및 실험 자동화 시스 템의 동작을 설명하기 위한 흐름도이다."}
