{"patent_id": "10-2024-7011744", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0067915", "출원번호": "10-2024-7011744", "발명의 명칭": "천연, 비천연 및 인공 형태로 폴리펩타이드 사슬의 접힘을 촉진하고 접힘 궤적을 수정하는 시", "출원인": "스트레닉 엘엘씨", "발명자": "소로키나, 이리나, 니코라에브나"}}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "폴리펩타이드 사슬의 천연, 비천연 또는 인공 형태로의 접힘 궤적(folding trajectory)을 수정하고 접힘을 촉진하기 위한 시스템으로, 상기 시스템은 적어도 하나의 컴퓨팅 프로세서;및적어도 하나의 컴퓨팅 프로세서에 의해 실행될 때 컴퓨팅 시스템이 다음을 수행할 수 있게 하는 명령을 포함하는 메모리를 포함하는 시스템;- 펩타이드 백본의 적어도 하나의 제1부분의 회전을 방지하는 적어도 하나의 제1움직임 제한(movementrestriction)을 적용하는 단계;- 펩타이드 백본의 적어도 하나의 제2부분에 적어도 하나의 제1방향 회전을 적용하는 단계, 여기서 제1방향 회전 및 제1움직임 제한은 동시에 적용됨;- 적용된 제1움직임 제한 및 제1방향 회전을 제거하는 단계;- 펩타이드 백본의 적어도 하나의 제3부분의 회전을 방지하는 적어도 하나의 제2움직임 제한을 적용하는 단계;및- 펩타이드 백본의 적어도 하나의 제4부분에 적어도 하나의 제2방향 회전을 적용하는 단계, 여기서, 제2방향 회전 및 제2움직임 제한은 동시에 적용됨."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 적용된 움직임 제한 및 방향 회전은 펩타이드 백본의 비틀림 및 폴리펩타이드 사슬의 형태 변화 중 적어도하나를 유발하는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 적어도 하나의 제1움직임 제한을 적용하는 단계는 펩타이드 백본을 따른 제1위치에 힘과 토크 중 적어도 하나를적용하는 단계를 포함하는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,적어도 하나의 제1방향 회전을 적용하는 단계는 펩타이드 백본을 따른 제2위치에 힘과 토크 중 적어도 하나를적용하는 단계를 포함하는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,방향 회전 및 움직임 제한을 적용하는 단계는 컴퓨터 시뮬레이션의 일부로서 인실리코(in silico)로 수행되는공개특허 10-2024-0067915-3-시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,방향 회전 및 움직임 제한을 적용하는 단계는 시험관 내에서 수행되는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,방향 회전을 적용하는 단계는 기계적 회전력을 추가하여 설정된 역장을 증가시키는 단계를 포함하는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,방향 회전은 펩타이드 백본의 N-말단 아미노산, C-말단 아미노산, 및 임의의 다른 아미노산 중 적어도 하나에적용되는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,움직임 제한은 펩타이드 백본의 N-말단 아미노산, C-말단 아미노산 및 임의의 다른 아미노산 중 적어도 하나에적용되는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,방향 회전을 적용하는 단계는 전기력, 자기력, 기계적 힘 및 기타 힘 중 적어도 하나를 적용하는 단계를 포함하는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 움직임 제한을 적용하는 단계는 펩타이드 백본 내의 아미노산, 펩타이드 백본 내의 원자, 펩타이드 측쇄내의 원자, 및 펩타이드에 단단히 결합된 독립체(entity) 내의 원자 중 적어도 하나에 공유 및 비공유 결합 특성 중 적어도 하나를 적용하는 단계를 포함하는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 움직임 제한을 적용하는 단계는 상기 펩타이드가 위치하는 용매의 온도, 화학적 조성, 점도 중 적어도 하나를 변경하는 단계를 포함하는 것인 시스템.공개특허 10-2024-0067915-4-청구항 13 폴리펩타이드 사슬의 천연, 비천연 또는 인공 형태로의 접힘 궤적(folding trajectory)을 수정하고 접힘을 촉진하기 위한 시스템으로, 상기 시스템은상기 폴리펩타이드 사슬을 물리적으로 조작하도록 구성된 적어도 하나의 펩타이드 조작기를 포함하고, 상기 펩타이드 조작기는 다음과 같이 구성된 시스템;- 펩타이드 백본의 적어도 하나의 제1부분의 회전 또는 기타 움직임 중 적어도 하나를 방지하는 적어도 하나의제1움직임 제한을 적용하는 단계;- 펩타이드 백본의 적어도 하나의 제2부분에 적어도 하나의 제1방향 회전 또는 기타 움직임을 적용하는 단계,여기서 제1방향 회전 또는 기타 움직임과 제1움직임 제한은 동시에 적용됨;- 적용된 제1움직임 제한과 제1방향 회전 또는 기타 움직임을 제거하는 단계;- 펩타이드 백본의 적어도 하나의 제3부분의 회전 또는 기타 움직임을 방지하는 적어도 하나의 제2움직임 제한을 적용하는 단계; 및- 펩타이드 백본의 적어도 하나의 제4부분에 적어도 하나의 제2방향 회전 또는 기타 움직임을 적용하는 단계,여기서 제2방향 회전 또는 기타 움직임과 제2움직임 제한은 동시에 적용됨."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 폴리펩타이드 조작기는 광학 핀셋, 자기 핀셋, 자기 비드, 전자석, 압전 장치 및 압전 음향 장치 중 적어도 하나를 사용하여 움직임 제한 및 방향 회전 또는 기타 움직임을 적용하도록 구성되는 시스템."}
{"patent_id": "10-2024-7011744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "다음의 단계를 포함하는 폴리펩타이드 사슬의 천연, 비천연 또는 인공 형태로의 접힘 궤적(folding trajectory)을 수정하고 접힘을 촉진하는 방법:- 펩타이드 백본의 적어도 하나의 제1부분의 회전 또는 기타 움직임을 방지하는 적어도 하나의 제1움직임 제한을 적용하는 단계;- 펩타이드 백본의 적어도 하나의 제2부분에 적어도 하나의 제1방향 회전을 적용하는 단계, 여기서, 제1방향 회전 또는 기타 움직임 및 제1움직임 제한은 동시에 적용됨;- 적용된 제1움직임 제한 및 제1방향 회전 또는 기타 움직임을 제거하는 단계;- 펩타이드 백본의 적어도 하나의 제3부분의 회전 또는 기타 움직임을 방지하는 적어도 하나의 제2움직임 제한을 적용하는 단계; 및- 펩타이드 백본의 적어도 하나의 제4부분에 적어도 하나의 제2방향 회전을 적용하는 단계, 여기서 제2방향 회전 또는 기타 움직임 및 제2움직임 제한이 동시에 적용됨."}
{"patent_id": "10-2024-7011744", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 폴리펩타이드 사슬의 천연, 비천연 또는 인공 형태로의 접힘 궤적(folding trajectory)을 수정하고 접 힘을 촉진하기 위한 펩타이드 조작 시스템 및 방법에 관한 것이다. 본 발명은 펩타이드 백본을 따라 다수의 위치 에 움직임 제한(들) 및/또는 방향 회전(들)을 적용하는 것을 포함한다. 적용된 움직임 제한(들) 및/또는 방향 회 전(들)은 펩타이드 백본의 서로 다른 부분의 비틀림 또는 기타 형태 변화를 달성하여 펩타이드 접힘 궤적을 수정 하고 펩타이드 접힘을 촉진하는 데 충분하다."}
{"patent_id": "10-2024-7011744", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 \"SYSTEM AND PROCESS FOR FACILITATED FOLDING OF POLYPEPTIDE CHAINS\"라는 명칭으로 2021년 9월 15 일에 출원된 미국 가출원 제63/244,262호의 이익을 주장하며, 이는 그 전체 내용이 참조로 본 명세서에 포함된 다."}
{"patent_id": "10-2024-7011744", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "단백질은 생체 내에서 강력하고 재현성 있게 접히지만, 많은 단백질은 세포 성분과 분리되어 시험관 내에서 접 힐 수 없다. 시험관 내에서든 생체 내에서든 단백질의 기본 형태에 대한 경로는 아직 대부분 알려지지 않았다. 생체 내에서 단백질 접힘에 대해 가장 일반적으로 받아들여지는 메커니즘은 접힘이 열역학, 특히 깁스 자유 에 너지의 감소에 의해서만 발생한다는 것이다. 그러나 시험관 내 및 인실리코에서 단백질 접힘을 시뮬레이션하기 위해 보조되지 않은 자발적인 단백질 접힘 모델을 기반으로 한 접근법을 적용하려는 시도는 대부분의 단백질 또 는 폴리펩타이드 사슬에 대해 정확하고 신뢰할 수 있으며 재현 가능한 접힘 결과를 가져오지 못했다. 현재 직접적인 기계적 조작을 통해 단백질 폴딩을 촉진 및/또는 시뮬레이션하는 알려진 시스템 및 방법은 없다. 오히려 위에서 논의한 것처럼 기존 모델은 접힘을 돕는 외부 에너지원 없이 접힘이 자발적으로 발생한다는 원리 에 의존한다. 많은 접근법은 또한 폴리펩타이드 백본이 자유롭게 연결된 사슬처럼 행동한다는 근본적인 가정에 의존한다. 접힘 궤적을 증가시키고 폴리펩타이드 사슬 접힘을 천연, 비천연 및/또는 인공적으로 안정한 접힌 형태로 촉진 할 수 있는 시험관 내 및 인실리코에서 단백질 접힘을 촉진하는 개선된 접근법이 필요하다. 또한 단백질 접힘이 자발적인 외부 에너지 독립적 과정이 아닐 수 있고, 외부 힘이 단백질 접힘에 역할을 할 수 있으며, 접힘 과정 에서 단백질이 자유롭게 연결된 사슬처럼 행동하지 않을 수 있다는 문제를 해결하는 접근 방식이 필요하다. 본 발명은 생체 내 및/또는 시험관 내 단백질 접힘을 모델링 및/또는 촉진하기 위해 시험관 내 및 실리코 내에 서 펩타이드 백본의 직접적인 조작에 의존하는 단백질 접힘 시스템 및 방법을 생성함으로써 이러한 한계를 극복 한다. 본 발명은 폴리펩타이드 백본의 전부 또는 적어도 일부가 자유롭게 연결된 사슬로 거동하는 것이 방지되 도록, 폴리펩타이드 백본을 조작할 수 있는 방식으로 적용할 수 있는 폴리펩타이드 사슬에 구속력(restraining force) 및 회전력(rotating force)과 같은 외부 힘을 적용함으로써 실제적인 단백질 폴딩 경로를 달성할 수 있 는 개선된 단백질 폴딩 시뮬레이션 및 시험관 내 폴딩 프로토콜을 제공한다."}
{"patent_id": "10-2024-7011744", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에 기술된 본 발명의 시스템 및 방법(이하 때때로 보다 간단히 \"시스템\" 또는 \"방법\"으로 지칭함)은 직접적인 조작을 통해 폴리펩타이드 사슬을 조작함으로써 단백질 폴딩 결과를 상당히 개선한다. 구체적으로, 본 발명의 시스템은 폴리펩타이드 사슬의 비틀림(twisting) 또는 다른 구조(conformation) 변화 중 적어도 하나를 생성하기 위해 폴리펩타이드 백본을 따라 다양한 위치에 구속력 및/또는 회전력을 적용하고, 시간이 지남에 따 라 다양한 비틀림 반복이나 기타 구조 변화를 수행하고 폴리펩타이드 사슬을 조절하여 천연, 비천연 및/또는 인 공 형태로 접을 수 있게 한다. 본 명세서에 기술된 독창적인 시스템은 이전에 단백질 폴딩 시뮬레이션 또는 시 험관 내 단백질 폴딩 프로토콜로 구현되지 않았던 새로운 인자를 단백질 폴딩 메커니즘에 통합하는 접근 방식을 제공한다. 하나 이상의 다른 실시예가 본 출원에 설명될 수 있다. 본 발명은 각 실시예를 개별적으로 또는 개시된 실시예 의 임의의 조합으로 구현될 수 있다. 더 나아가, 본 명세서에 설명된 하나 이상의 실시예에 대해 다양한 대안적 인 배열이 설명될 수 있다; 이는 단지 설명의 목적으로 제시된 것이며 여기에 포함된 실시예 또는 여기에 제시 된 청구범위를 어떤 방식으로든 제한하지 않는다는 점을 이해해야 한다. 개시 내용으로부터 쉽게 명백할 수 있 는 바와 같이, 배열 중 하나 이상은 수많은 실시예에 널리 적용될 수 있다. 일반적으로, 장치(arrangement)는 당업자가 하나 이상의 실시예를 실시할 수 있도록 충분히 자세하게 설명되어 있으며, 다른 장치가 활용될 수 있 고 구조적, 논리적, 소프트웨어, 물리적 및 기타 변경이 실시예의 범위를 벗어나지 않고 이루어질 수 있다는 것 이 이해되어야 한다. 본 명세서에 설명된 하나 이상의 실시예의 특별한 특징은 본 개시의 일부를 형성하는 하나 이상의 특정 실시예 또는 도면을 참조하여 설명될 수 있으며, 여기에는 예시로서 하나 이상의 특정 배열이 도시 되어 있다. 그러나, 이러한 특징은 설명되는 하나 이상의 특정 실시예 또는 도면에서의 사용으로 제한되지 않는 다는 것이 인식되어야 한다. 본 개시 내용은 하나 이상의 실시예의 모든 장치에 대한 문자 그대로의 설명도 아 니고, 모든 장치에 존재해야 하는 하나 이상의 실시예의 특징의 목록도 아니다. 본 특허 출원에 제공된 섹션의 제목과 본 특허 출원의 제목은 단지 편의를 위한 것이며 어떤 방식으로든 공개를 제한하는 것으로 간주되어서는 안 된다. 서로 통신하는 장치는 달리 명시적으로 지정되지 않는 한 서로 지속적으로 통신할 필요가 없다. 또한, 서로 통 신하는 장치는 논리적 또는 물리적인 하나 이상의 통신 수단이나 매개체를 통해 직접적으로 또는 간접적으로 통 신할 수 있다. 서로 통신하는 여러 구성 요소가 있는 측면에 대한 설명은 이러한 구성 요소가 모두 필요하다는 것을 의미하지 않는다. 반대로, 매우 다양한 가능한 실시예를 예시하고 하나 이상의 실시예를 더 완전하게 예시하기 위해 다양 한 선택적인 구성요소가 설명될 수 있다. 유사하게, 프로세스 단계, 방법 단계, 알고리즘 등이 순차적 순서로 설명될 수 있지만, 그러한 프로세스, 방법 및 알고리즘은 달리 구체적으로 언급되지 않는 한 일반적으로 대체 순서로 작동하도록 구성될 수 있다. 즉, 본 특허 출원에 설명된 단계의 서열이나 순서는 그 자체로 단계가 해당 순서로 수행되어야 한다는 요구 사항을 나타내지는 않는다. 설명된 프로세스의 단계는 실제적으로 임의의 순서 로 수행될 수 있다. 또한, 일부 단계는 비동시적으로 발생하는 것으로 설명되거나 암시됨에도 불구하고(예를 들 어, 한 단계가 다른 단계 다음에 설명되기 때문에) 동시에 수행될 수 있다. 게다가, 도면에 묘사된 프로세스의 예시는 예시된 프로세스가 그에 대한 다른 변형 및 수정을 배제한다는 것을 의미하지 않으며, 예시된 프로세스 또는 그 단계 중 임의의 것이 하나 이상의 실시예에 필요하다는 것을 의미하지 않으며, 설명된 프로세스가 선호 된다는 의미는 아니다. 또한 단계는 일반적으로 측면당 한 번 설명되지만 이는 해당 단계가 한 번 발생해야 하 거나 프로세스, 방법 또는 알고리즘이 수행되거나 실행될 때마다 한 번만 발생할 수 있다는 의미는 아니다. 일 부 단계는 일부 실시예 또는 일부 발생에서 생략될 수 있거나, 일부 단계는 주어진 측면 또는 발생에서 두 번 이상 실행될 수 있다. 단일 디바이스 또는 물품이 본 명세서에서 설명될 때, 하나 초과의 디바이스 또는 물품이 단일 디바이스 또는 물품 대신에 사용될 수도 있다는 것이 즉시 명백할 것이다. 유사하게, 하나 초과의 디바이스 또는 물품이 본 명 세서에 설명되는 경우, 단일 디바이스 또는 물품이 하나 초과의 디바이스 또는 물품 대신에 사용될 수도 있다는것이 즉시 명백할 것이다. 디바이스의 기능 또는 특징은 이러한 기능 또는 특징을 갖는 것으로서 명시적으로 설명되지 않은 하나 이상의 다른 디바이스에 의해 대안적으로 구현될 수도 있다. 따라서, 다른 양태는 디바이스 자체를 포함할 필요는 없다. 본 명세서에 설명되거나 참조된 기술 및 메커니즘은 때때로 명확성을 위해 단수 형태로 설명될 것이다. 그러나, 특정 양태는 달리 언급되지 않으면, 기술의 다중 반복 또는 메커니즘의 다중 인스턴스화를 포함할 수도 있다는 것이 이해되어야 한다. 도면의 프로세스 설명 또는 블록은 프로세스의 특정 논리적 기능 또는 단계를 구현하기 위한 하나 이상의 실행 가능 명령을 포함하는 코드의 모듈, 세그먼트 또는 부분을 나타내는 것으로서 이해되어 야 한다. 하지만, 시험관 내 적용(in vitro application)에는 프로세스 설명이나 그림의 블록에 따른 수동 조작, 컴퓨터 실행 가능 지시(예를 들어 로봇 조작기를 제어하기 위한 지지)를 통한 컴퓨터 구현 또는 보조 조 작 또는 수동 조작과 컴퓨터 구현 조작의 조합을 포함할 수 있다. 예를 들어, 통상의 기술자들에 의해 이해될 수 있는 바와 같이, 수반된 기능에 따라, 실질적으로 동시에 또는 역순을 포함하여, 도시되거나 설명된 것으로 부터 다른 순서로 기능들이 실행될 수도 있는 대안 구현예가 다양한 양태의 범주 내에 포함된다. 첨부된 도면과 관련하여 아래에 설명된 상세한 설명은 다양한 구성에 대한 설명으로 의도되었으며, 여기에 설명 된 개념이 실행될 수 있는 유일한 구성을 나타내려는 의도는 아니다. 자세한 설명에는 다양한 개념에 대한 철저 한 이해를 제공할 목적으로 구체적인 내용이 포함되어 있다. 그러나 이러한 개념은 이러한 특정 세부 사항 없이 도 실행될 수 있다는 것이 해당 기술 분야의 숙련자에게 명백할 것이다. 어떤 경우에는 개념이 모호해지는 것을 피하기 위해 잘 알려진 구조와 구성 요소가 블록 다이어그램 형식으로 표시된다. 도 1은 일 실시예에 따른 폴리펩타이드 조작 시스템(polypeptide manipulation system)의 예시적인 실시 예를 도시한다. 상기 시스템은 사용자 장치(들), 폴리펩타이드 조작 및 데이터 처리 시스템, 데이터 저장소, 데이터 획득 시스템, 폴리펩타이드 데이터베이스 및 다양한 시스템이 통신하고 상호 작 용하는 네트워크를 포함한다. 본 명세서에 기술된 다양한 구성요소는 예시적이며 단지 설명의 목적을 위한 것이며, 다양한 구성요소의 임의의 조합 또는 하위 조합이 당업자에게 명백한 바와 같이 사용될 수 있다. 본 발 명의 범위를 벗어나지 않고 당업자가 쉽게 이해할 수 있는 바와 같이 다른 시스템, 인터페이스, 모듈, 엔진, 데 이터베이스 등이 사용될 수 있다. 임의의 시스템, 인터페이스, 모듈, 엔진, 데이터베이스 등은 본 발명의 범위 를 벗어나지 않고 동일한 기능을 달성하기 위해 복수의 요소로 분할될 수 있다. 임의의 시스템, 인터페이스, 모 듈, 엔진, 데이터베이스 등은 본 발명의 범위를 벗어나지 않고 동일한 기능을 달성하기 위해 더 적은 수의 요소 로 결합되거나 통합될 수 있다. 본 문서에 설명된 구성 요소의 모든 기능은 수동으로 시작될 수도 있고 작업을 트리거하는 데 필요한 기준이 충족되면 자동으로 시작될 수도 있다. 사용자 장치(들)는 네트워크를 통해 폴리펩타이드 조작 및 데이터 처리 시스템 및 데이터 저장 소와 통신하는 데 사용될 수 있다. 사용자 장치(들)는 사용자가 조작될 하나 이상의 폴리펩타이드 사 슬을 지정하거나 선택할 수 있도록 기능할 수 있다. 일 실시예에서, 이는 하나 이상의 폴리펩타이드 서열을 입 력하기 위해 사용자 장치(들)을 사용하고 그러한 서열을 폴리펩타이드 조작 및 데이터 처리 시스템으 로 전송하는 것을 포함할 수 있다. 일 실시예에서, 사용자 장치(들)는 데이터 저장소에 저장되거나 폴리펩타이드 조작 및 데이터 처리 시스템에 저장된 폴리펩타이드 사슬의 목록으로부터 하나 이상의 폴리 펩타이드 사슬을 선택하는 데 사용될 수 있다. 폴리펩타이드 사슬의 목록에는 일반적인 천연 단백질 서열 및/또 는 인공 서열, 및/또는 일반적으로 더 큰 폴리펩타이드 사슬을 구성하는 폴리펩타이드 사슬과 같은 더 작은 폴 리펩타이드 사슬이 포함될 수 있다. 사용자 장치(들)은 또한 폴리펩타이드 조작으로 인한 표적 중간체 또 는 최종 형태와 같은 폴리펩타이드 조작에 대한 설정 및 선호도, 폴리펩타이드 조작에 사용되는 힘과 같은 조작 매개변수 및 도 2와 관련하여 아래에 논의된 것과 같은 다른 매개변수를 전달하는 데 사용될 수 있다. 일 실시 예에서, 사용자 장치(들)는 맞춤 설정 및 매개변수를 전달할 수 있다. 일 실시예에서, 사용자 장치 (들)는 데이터 저장소에 저장되거나 폴리펩타이드 조작 및 데이터 처리 시스템에 저장된 설정 및 매개변수 목록으로부터 설정 및 매개변수를 선택하는 데 사용될 수 있다. 폴리펩타이드 조작 및 데이터 처리 시스템은 일련의 설정 및 매개변수에 기초하여 하나 이상의 폴리펩타이 드 서열을 조작한다. 이러한 설정 및 매개변수는 폴리펩타이드 조작 및 데이터 처리 시스템 내에 정의된 사전 설정 설정 및 매개변수, 사용자 장치(들)로부터 수신된 설정 및 매개변수, 및/또는 데이터 저장소 로부터 수신된 설정 및 매개변수일 수 있다. 폴리펩타이드 조작 및 데이터 처리 시스템은 또한 조작 될 하나 이상의 폴리펩타이드 사슬을 지정하는 입력을 수신할 수도 있다. 이는 맞춤형 서열의 형태로 사용자 장치(들)로부터 하나 이상의 특정 폴리펩타이드 서열을 수신하는 것 및/또는 위에서 설명한 바와 같이 목록 으로부터 하나 이상의 폴리펩타이드 서열을 선택하는 것을 포함할 수 있다. 일 실시형태에서, 폴리펩타이드 조 작 및 데이터 처리 시스템은 수신된 아미노산 서열과 같은 수신된 입력에 기초하여 폴리펩타이드 사슬을 생성한다. 일 실시예에서, 폴리펩타이드 조작 및 데이터 처리 시스템은 인실리코(in silico)에서 폴리펩타이드 조작 을 수행하기 위한 서버 또는 클라우드 기반 소프트웨어 애플리케이션일 수 있다. 일 실시예에서, 폴리펩타이드 조작 및 데이터 처리 시스템은 사용자 장치에 설치되어 실행되는 로컬 애플리케이션의 형태를 취할 수 있다. 일 실시예에서, 폴리펩타이드 조작 및 데이터 처리 시스템은 시험관 내에서 폴리펩타이드를 조작 하기 위한 다양한 구성요소를 포함할 수 있다. 이러한 구성요소는 기계적 힘, 전기적 힘, 및/또는 자기력을 적 용하기 위한 조작기를 포함할 수 있다. 일부 예시적인 구성요소에는 하나 이상의 로봇 팔 및 엔드 이펙터, 공유, 비공유 및/또는 친화성 단백질 고정화를 위한 다양한 고체상, 분자 핀셋, 레이저, 나노장치, 미세유체 장 치, 전자기장 발생기, 별도로 사용될 수도 있고 로봇 팔에 하나 이상의 엔드 이펙터로 사용될 수 있는 것과 같 은 구성 요소를 포함할 수 있다. 데이터저장소는 주어진 폴리펩타이드 조작(polypeptide manipulation)에 사용되는 조작 설정 및 매개변수를 저장할 수 있다. 데이터저장소는 결과적인 형태와 같은 조작의 결과, 조작 및 형태 변화의 비디오를 저장할 수 있다. 예를 들어, 아래의 도 2에서 설명되는 것과 같은(이에 제한되지 않음) 다른 매개변수 중에서 적용된 힘 및 그 타이밍 이 데이터 저장소에 저장될 수 있다. 추가적으로 또는 대안적으로, 특정 조작의 결과는 결과적인 폴리펩타 이드 조작 및 결과적인 접힘의 비디오와 같이 저장될 수도 있다. 일 실시예에서, 데이터저장소는 또한 사 용자 장치 또는 폴리펩타이드 조작 및 데이터 처리 시스템에 통합될 수 있다. 데이터 저장소는 조작 할 수 있는 더 큰 폴리펩타이드 사슬을 구축하는 데 사용되거나 조작될 수 있는 펩타이드 사슬 목록을 저장할 수도 있다. 데이터저장소는 또한 폴리펩타이드 사슬 조작을 수행하기 위해 사용자가 선택할 수 있는 설정 및 매개변수의 목록을 저장할 수도 있다. 여기에는 일반적인 조작 설정 및 매개변수의 사전 설정 목록이 포함될 수도 있고 사용자 정의 사전 설정 목록이 포함될 수도 있다. 일 실시예에서, 데이터저장소는 인실리코(in silico)에서 폴리펩타이드 조작을 시뮬레이션하기 위한 설정 및 매개변수를 저장할 수 있다. 일 실시예에서, 데 이터저장소는 시험관내 폴리펩타이드 조작을 수행하기 위한 설정 및 매개변수, 예를 들어 폴리펩타이드 사 슬을 조작하기 위해 로봇 장치 및 엔드 이펙터를 제어하기 위한 설정 및 매개변수, 및/또는 폴리펩타이드 구조 의 변화를 실시간으로 모니터링하기 위한 설정 및 매개변수를 저장할 수 있다. 데이터저장소는 또한 시험 관 내에서 폴딩되는 폴리펩타이드 형태의 변화를 모니터링하기 위해 수집된 실시간 데이터를 저장할 수 있다. 이러한 실시간 모니터링의 예에는 형광, 원형 이색성(circular dichroism) 및 핵자기 공명 스펙트럼이 포함되지 만 이에 국한되지는 않는다. 폴리펩타이드 데이터베이스는 복수의 폴리펩타이드 및/또는 단백질 구조, 접힘 형태 및/또는 접힘 궤적과 연관된 데이터를 포함할 수 있다. 폴리펩타이드 데이터베이스는 다수의 공지된 단백질 및/또는 폴리펩타이 드 사슬과 연관된 데이터를 포함할 수 있다. 폴리펩타이드 데이터베이스는 자연 발생 단백질, 인공 단백질, 잘못 접힌 단백질 형태 등을 포함하지만 이에 제한되지 않는 단백질 및/또는 폴리펩타이드와 관련된 새 로운 데이터가 이용 가능해짐에 따라 시간이 지남에 따라 업데이트될 수 있다. 일 측면에서, 폴리펩타이드 데이 터베이스로부터의 데이터는 아래에 더 자세히 설명되는 바와 같이 펩타이드 백본 조작과 관련된 결과 측정 을 계산하는 데 사용하기 위해 폴리펩타이드 조작 및 데이터 처리 시스템에 제공된다. 사용자 장치(들)는 일반적으로 네트워크를 통해 (예를 들어, 원격으로) 통신하기 위한 기능을 포함하 는 컴퓨터 또는 컴퓨팅 장치를 포함한다. 데이터는 클라이언트 장치로부터 수집될 수 있고, 데이터 요청은 각 클라이언트 장치로부터 개시될 수 있다. 클라이언트 장치(들)은 다른 적합한 컴퓨팅 장치 중에서 서버, 데스크톱 컴퓨터, 랩톱 컴퓨터, PDA(Personal Digital Assistant), 차량 내부 또는 외부 내비게이션 시 스템, 스마트폰 또는 기타 휴대폰 또는 모바일 전화, 모바일게임 장치일 수 있다. 클라이언트 장치는 사용 자 데이터를 제출하거나 네트워크를 통해 예측 쿼리를 작성하기 위해 웹 브라우저(예를 들어, Microsoft Windows Internet Explorer, Mozilla Firefox, Apple Safari, Google Chrome 및 Opera 등) 또는 전용 애플리 케이션과 같은 하나 이상의 클라이언트 애플리케이션을 실행할 수 있다. 특정 실시예에서, 각 사용자 장치는 하드웨어, 소프트웨어 또는 내장된 논리 구성 요소 또는 둘 이상의 이 러한 구성 요소의 조합을 포함하고 사용자 장치에 의해 구현되거나 지원되는 적절한 기능을 수행할 수 있 는 전자 장치일 수 있다. 예를 들어 제한 없이, 사용자 장치는 데스크톱 컴퓨터 시스템, 노트북 컴퓨터 시 스템, 넷북 컴퓨터 시스템, 휴대용 전자 장치 또는 휴대폰일 수 있다. 본 개시물은 임의의 사용자 장치를고려한다. 사용자 장치는 사용자 장치의 네트워크 사용자가 네트워크에 액세스하는 것을 가능하 게 할 수 있다. 사용자 장치는 그 사용자가 다른 사용자 장치에서 다른 사용자들과 통신하는 것을 가 능하게 할 수 있다. 사용자 장치는 MICROSOFT INTERNET EXPLORER, GOOGLE CHROME 또는 MOZILLA FIREFOX와 같은 웹 브라우저를 포함할 수 있고, TOOLBAR 또는 YAHOO TOOLBAR와 같은 하나 이상의 추가 기능, 플러그인 또는 기타 확장을 포함 할 수 있다. 사용자 장치는 사용자가 URL(Uniform Resource Locator) 또는 웹 브라우저를 서버로 안내하 는 다른 주소를 입력할 수 있게 하고, 웹 브라우저는 HTTP(Hyper Text Transfer Protocol) 요청을 생성하고 HTTP 요청을 서버에 전달할 수 있다. 서버는 HTTP 요청을 수락하고 HTTP 요청에 응답하여 하나 이상의 HTML(Hyper Text Markup Language) 파일을 사용자 장치에 전달할 수 있다. 사용자 장치는 사용자에 게 표시하기 위해 서버로부터의 HTML 파일에 기초하여 웹 페이지를 렌더링할 수 있다. 본 개시물은 임의의 적합 한 웹 페이지 파일을 고려한다. 예를 들어 제한 없이 웹 페이지는 특정 요구 사항에 따라 HTML 파일, XHTML(Extensible Hyper Text Markup Language) 파일 또는 XML(Extensible Markup Language) 파일에서 렌더링 할 수 있다. 이러한 페이지는 예를 들어 제한 없이 JAVASCRIPT, JAVA, MICROSOFT SILVERLIGHT, AJAX(Asynchronous JAVASCRIPT 및 XML)와 같은 마크업 언어와 스크립트의 조합 등으로 작성된 스크립트를 실행 할 수도 있다. 본 명세서에서, 웹 페이지에 대한 참조는 하나 이상의 해당 웹 페이지 파일(브라우저가 웹 페이 지를 렌더링하는 데 사용할 수 있음)을 포함하며, 그 반대의 경우도 마찬가지이다. 사용자 장치는 또한 사용자 장치에 로드되는 애플리케이션을 포함할 수 있다. 애플리케이션은 네트워 크로부터 데이터를 획득하고 이를 애플리케이션 인터페이스 내에서 사용자에게 표시한다. 예시적인 사용자 장치는 여기에 제공된 후속 도면 중 일부에 예시되어 있다. 본 개시 내용은 임의의 적절한 물 리적 형태를 취하는 컴퓨팅 시스템을 포함하여 임의의 적절한 수의 사용자 장치를 고려한다. 제한이 아닌 예로 서, 컴퓨팅 시스템은 임베디드 컴퓨터 시스템, 시스템-온-칩(system-on-chip)(SOC), (예컨대, 컴퓨터-온-모듈 (computer-on-module)(COM) 또는 시스템-온-모듈(system-on-module)(SOM)과 같은) 단일 보드 컴퓨터(SBC) 시스 템, 데스크톱 컴퓨터 시스템, 랩톱 또는 노트북 컴퓨터 시스템, 대화형 키오스크, 메인프레임, 컴퓨터 시스템들 의 메쉬, 모바일 전화, 개인 휴대 정보 단말기(PDA), 서버, 또는 이들 중 2개 이상의 조합일 수 있다. 적절한 경우, 컴퓨터 시스템은, 하나 이상의 컴퓨터시스템을 포함할 수 있고; 일체형 또는 분산형일 수 있고; 다수의 위치들에 걸쳐 있을 수 있고; 다수의 기계들에 걸쳐 있을 수 있고/거나; 하나 이상의 네트워크 내의 하나 이상 의 클라우드 구성요소를 포함할 수 있는 클라우드에 상주할 수 있다. 적절한 경우, 하나 이상의 컴퓨터 시스템 은, 본원에 설명되거나 예시된 하나 이상의 방법의 하나 이상의 단계를 실질적인 공간적 또는 시간적 제한 없이 수행할 수 있다. 제한이 아닌 예로서, 하나 이상의 컴퓨터 시스템은, 본원에 설명되거나 예시된 하나 이상의 방 법의 하나 이상의 단계를 실시간으로 또는 배치 모드로 수행할 수 있다. 하나 이상의 컴퓨터 시스템은, 적절한 경우, 본원에 설명되거나 예시된 하나 이상의 방법의 하나 이상의 단계를 상이한 시간들에 또는 상이한 위치들 에서 수행할 수 있다. 네트워크 클라우드는 일반적으로 (당업자가 쉽게 이해할 수 있는 바와 같이, 본 명세서에 설명된 시스템을 실행하는 데 필요할 수 있는 다른 구성요소를 포함하는) 도 1에 예시된 다양한 구성요소가 존재하는 네트워크 또는 네트워크의 집합(예를 들어 인터넷이나 기업 인트라넷, 또는 둘의 조합)을 나타낸다. 특정 실시예에서, 네 트워크는 인트라넷, 엑스트라넷, VPN(Virtual Private Network), LAN(Local Area Network), WLAN(Wireless LAN), WAN(Wide Area Network), MAN(Metropolitan Area Network) 인터넷의 일부, 또는 다른 네 트워크 또는 이러한 네트워크 둘 이상의 조합이다. 하나 이상의 링크는 본 문서에 설명된 시스템과 데이터베이스를 네트워크에 연결한다. 특정 실시예에서, 하나 이상의 링크 각각은 하나 이상의 유선, 무선 또는 광학 링크를 포함한다. 특정 실시예에서, 하나 이상의 링크 각각은 인트라넷, 엑스트라넷, VPN, LAN, WLAN, WAN, MAN, 인터넷의 일부, 또 다른 링크 또는 2개 이상의 이러한 링크의 조합을 포함한다. 본 개시 내용 은 임의의 적합한 네트워크, 및 본 명세서에 설명된 다양한 시스템 및 데이터베이스를 연결하기 위한 임의 의 적합한 링크를 고려한다. 네트워크는 본 명세서에 기술되거나 참조된 다양한 시스템 및 컴퓨팅 장치를 연결한다. 특정 실시예에서, 네트워크는 인트라넷, 엑스트라넷, VPN(Virtual Private Network), LAN(Local Area Network), WLAN(Wireless LAN), WAN(Wide Area Network), MAN(Metropolitan Area Network) 인터넷의 일부, 또는 다른 네 트워크 또는 이러한 네트워크 둘 이상의 조합이다. 본 개시는 임의의 적합한 네트워크를 고려한 다.하나 이상의 링크는 하나 이상의 시스템, 엔진 또는 장치를 네트워크에 연결한다. 특정 실시예에서, 하나 이상의 링크 각각은 하나 이상의 유선, 무선 또는 광학 링크를 포함한다. 특정 실시예에서, 하나 이상의 링크 각각은 인트라넷, 엑스트라넷, VPN, LAN, WLAN, WAN, MAN, 인터넷의 일부, 또 다른 링크 또는 2개 이상의 이러 한 링크의 조합을 포함한다. 본 개시는 하나 이상의 시스템, 엔진 또는 장치를 네트워크에 연결하는 임의 의 적절한 링크를 고려한다. 특정 실시예에서, 각각의 시스템 또는 엔진은 단일 서버(unitary server)일 수 있거나 다수의 컴퓨터 또는 다수 의 데이터 센터에 걸쳐 있는 분산형 서버(distributed server)일 수 있다. 시스템, 엔진 또는 모듈은 예를 들어, 그러나 제한되지 않는 웹 서버, 뉴스 서버, 메일 서버, 메시지 서버, 광고 서버, 파일 서버, 응용 프로그 램 서버, 교환 서버, 데이터베이스 서버 또는 프록시 서버와 같은 다양한 유형일 수 있다. 특정 실시예에서, 각 각의 시스템, 엔진 또는 모듈은 하드웨어, 소프트웨어 또는 내장된 논리 구성요소 또는 각각의 서버에 의해 구 현되거나 지원되는 적절한 기능을 수행하기 위한 둘 이상의 이러한 구성요소의 조합을 포함할 수 있다. 예를 들 어, 웹 서버는 일반적으로 웹 페이지나 웹 페이지의 특정 요소가 포함된 웹 사이트를 호스팅할 수 있다. 보다 구체적으로, 웹 서버는 HTML 파일 또는 기타 파일 유형을 호스팅할 수 있거나 요청 시 파일을 동적으로 생성 또 는 구성할 수 있으며 HTTP 또는 클라이언트 장치 또는 기타 장치의 기타 요청에 응답하여 이를 클라이언트 장치 또는 기타 장치에 전달할 수 있다. 메일 서버는 일반적으로 다양한 클라이언트 장치나 기타 장치에 전자 메일 서비스를 제공할 수 있다. 데이터베이스 서버는 일반적으로 하나 이상의 데이터 저장소에 저장된 데이터를 관리 하기 위한 인터페이스를 제공할 수 있다. 특정 실시예로, 하나 이상의 데이터 저장소는 하나 이상의 링크를 통해 하나 이상의 서버에 통신 가능하게 연결 될 수 있다. 특정 실시예에서, 데이터 저장소는 다양한 유형의 정보를 저장하는 데 사용될 수 있다. 특정 실시 예에서, 데이터 저장소에 저장된 정보는 특정 데이터 구조에 따라 구성될 수 있다. 특정 실시예로, 각각의 데이 터 저장소는 관계형 데이터베이스일 수 있다. 특정 실시예는 서버 또는 클라이언트가 데이터 저장소에 저장된 정보를 관리(예를 들어 검색, 수정, 추가 또는 삭제)할 수 있게 하는 인터페이스를 제공할 수 있다. 시스템은 또한 도 1에 도시되지 않았지만 당업자에게는 쉽게 명백할 다른 서브시스템 및 데이터베이스를 포함할 수 있다. 예를 들어, 시스템은 데이터 저장, 특징 저장, 결과(훈련 세트) 저장 및 모델 저장을 위한 데이터베이 스를 포함할 수 있다. 본 발명의 범위를 벗어나지 않고 당업자가 쉽게 이해할 수 있는 바와 같이 다른 데이터베 이스 및 시스템이 추가되거나 제외될 수 있다. 도 2는 폴리펩타이드 조작 및 데이터 처리 시스템의 예시적인 실시예를 도시한다. 시스템은 사용자 입력 인터페이스, 시뮬레이션 엔진, 출력 제어 인터페이스, 데이터 획득 인터페이스, 폴리 펩타이드 데이터베이스 인터페이스 및 결과 측정 엔진을 포함한다. 본 명세서에 기술된 다양한 구성 요소는 예시적이며 단지 설명의 목적을 위한 것이며, 다양한 구성요소의 임의의 조합 또는 하위 조합이 당업자 에게 명백한 바와 같이 사용될 수 있다. 본 발명의 범위를 벗어나지 않고 당업자가 쉽게 이해할 수 있는 바와 같이 다른 시스템, 인터페이스, 모듈, 엔진, 데이터베이스 등이 사용될 수 있다. 임의의 시스템, 인터페이스, 모듈, 엔진, 데이터베이스 등은 본 발명의 범위를 벗어나지 않고 동일한 기능을 달성하기 위해 복수의 요소로 분할될 수 있다. 임의의 시스템, 인터페이스, 모듈, 엔진, 데이터베이스 등은 본 발명의 범위를 벗어나지 않고 동일한 기능을 달성하기 위해 더 적은 수의 요소로 결합되거나 통합될 수 있다. 본 문서에 설명된 구성 요소의 모든 기능은 수동으로 시작될 수도 있고 작업을 트리거하는 데 필요한 기준이 충족되면 자동으로 시작될 수도 있다. 일 측면에서, 도 2의 시스템은 도 3과 관련하여 설명된 예시적인 프로세스를 수행하도록 작동이 가 능하다. 사용자 입력 인터페이스는 펩타이드 조작과 관련된 사용자 입력을 얻도록 작동 가능하다. 일 측면에서 사 용자 입력은 펩타이드 조작에 사용되는 일련의 매개변수/설정을 포함한다. 예시적인 사용자 입력은 펩타이드 백 본에 적용될 적어도 하나의 움직임 제한(movement restriction) 및/또는 적어도 하나의 방향 회전(directional rotation)과 관련된 표시 및/또는 설정 또는 매개변수를 포함할 수 있다. 일 측면에서, 사용자 입력은 적용할 힘 (사용할 힘 유형(예를 들어 기계적, 전기적, 자기적 등), 힘 상수 및 힘 크기 중 하나 이상을 포함하되 이에 국한되지 않음), 적용할 방향 회전 속도, 적용할 회전 방향(예를 들어 펩타이드 백본의 세로 축을 기준으로 시 계 방향 또는 시계 반대 방향) 중 적어도 하나, 움직임 제한(들) 및 방향 회전(들) 중 적어도 하나의 적용 기간 중 적어도 하나, 각 조작이 적용될 하나 이상의 위치 를 포함한다. 당업자에게 명백한 바와 같이, 특히 도 3과 관련하여 아래에 설명된 것과 같은 추가 설정/매개변수가 사용자 입력으로부터 지정되거나 결정될 수 있다. 시뮬레이션 엔진은 획득된 사용자 입력과 관련된 움직임 제한(들) 및/또는 방향 회전(들)을 적용하기 위해 컴퓨터 시뮬레이션을 실행하도록 작동 가능하다. 알 측면에서, 시뮬레이션 엔진은 사용자 입력에 기초하여 설정된 설정/매개변수와 연관하여 분자 역학 시뮬레이션을 수행한다. 시뮬레이션 엔진은 아래의 도 3에 설 명된 것과 같은 움직임 제한(들) 및/또는 방향 회전(들) 중 적어도 하나를 적용하는 것과 관련된 복수의 시뮬레 이션 프로세스를 실행할 수 있다. 일 측면에서, 시뮬레이션 엔진을 통해 구현된 적용된 움직임 제한(들) 및/또는 방향 회전(들)은 접힘 궤적을 증대시키고 펩타이드 사슬이 고유 형태, 비-고유 형태 및 인공 형태 중 적어도 하나로 접히는 것을 촉진한다. 출력 제어 인터페이스는 물리적 펩타이드 조작 구성요소에 제어 신호를 출력하도록 작동 가능하다. 일 측 면에서, 제어 신호는 시험관 내 펩타이드 조작을 수행하도록 구성된 구성요소에 제공된다. 예시적인 구성 요소 에는 하나 이상의 로봇 팔 및 엔드 이펙터, 공유, 비공유 및/또는 친화성 단백질 고정을 위한 다양한 고체상, 분자 핀셋(molecular tweezers), 레이저, 광학 핀셋, 자기 핀셋, 자기 비드, 전자석, 압전 장치, 압전 음향 장 치, 나노 장치, 미세 유체 장치, 전자기장 발생기 등과 같은 구성 요소가 포함되지만 이에 국한되지는 않는다. 데이터 획득 인터페이스는 펩타이드 조작과 관련된 데이터를 캡처하도록 작동 가능하다. 일 측면에서, 데 이터 획득 인터페이스는 시험관 내 펩타이드 조작과 관련된 데이터를 획득하는 외부 시스템 또는 구성요소 로부터 데이터를 획득하도록 작동 가능하다. 일 측면에서, 데이터 획득 인터페이스는 단독으로 또는 시뮬 레이션 엔진과 결합/협력하여 조작 프로세스 전반에 걸쳐 펩타이드 조작의 스냅샷 또는 스크린샷을 얻도록 작동 가능하다. 일 측면에서, 데이터 획득 인터페이스는 펩타이드에 적용된 움직임 제한(들) 및/또는 방향 회전 (들)의 적용 및/또는 제거 전, 도중 및 후 중 적어도 하나에서 펩타이드 조작 데이터를 획득한다. 폴리펩타이드 데이터베이스 인터페이스는 폴리펩타이드 데이터베이스로부터 정보를 얻는 것과 폴리펩타이 드 데이터베이스에 정보를 제공하는 것 중 적어도 하나를 수행하도록 작동 가능하다. 일 측면에서, 폴리펩타이 드 데이터베이스 인터페이스는 공지된 및/또는 예상되는 접힘 궤적 및/또는 공지된 펩타이드 서열(예를 들 어 공지된 단백질)과 연관된 형태와 연관된 정보를 획득한다. 일 측면에서, 폴리펩타이드 데이터베이스 인터페 이스는 인공 펩타이드 서열(예를 들어 인공 단백질)과 연관된 공지 및/또는 예상 접힘 궤적 및/또는 입체 구조와 연관된 정보를 획득한다. 일 측면에서, 폴리펩타이드 데이터베이스 인터페이스는 알려진 펩타이드 사슬과 알려지지 않은 펩타이드 사슬 중 적어도 하나와 관련된 속도 또는 접힘 기간과 관련된 정보를 획득한다. 결과 측정 엔진은 데이터 획득 인터페이스 및 폴리펩타이드 데이터베이스 인터페이스 중 적어도 하나와 관련하여 획득된 데이터에 기초하여 적어도 하나의 결과 측정을 계산하도록 작동 가능하다. 일 측면에서, 결과 측정 엔진은 폴리펩타이드 사슬의 접힘 궤적, 결과적인 접힌 형태, 접는 정확도, 아미노산에 의 해 형성된 천연 접촉의 수 또는 비율, 그리고 결과적인 접힌 형태를 달성하는 시간 중 적어도 하나를 계산하도 록 작동 가능하다. 일 측면에서, 결과 측정 엔진은 예상되는 접힘 궤적과 비교하여 계산된 접힘 궤적 중 적어도 하나와 예상되는 결과 접힌 형태와 비교하여 계산된 결과 접힌 형태 사이의 유사성의 측정 및 차이의 측 정 중 적어도 하나를 계산한다. 일 양태에서, 결과 측정 엔진은 예상되는 접힘 궤적과 비교하여 계산된 접 힘 궤적 중 적어도 하나와 예상되는 결과 접힌 형태와 비교하여 계산된 결과 접힌 형태 사이의 유사성의 측정 및 차이의 측정 중 적어도 하나를 계산한다. 일 측면에서, 결과 측정 엔진은 관찰된 접힘 궤적과 예상된 접힘 궤적 사이의 유사성 측정 및 차이 측정 중 적어도 하나를 계산한다. 일 측면에서, 계산되거나 관찰된 접힘 궤적과 예상되는 접힘 궤적의 비교를 사용하여 펩타이드 사슬이 잘못 접힌 형태를 달성하거나 진행하는지 여부 와 시기를 식별할 수 있다. 일 측면에서, 결과 측정 엔진은 적용된 펩타이드 조작으로 인한 증가 정도를 결정하기 위해 계산된 접는 시간과 예상되는 접는 시간 중 적어도 하나 사이의 유사성 측정 및 차이 측정 중 적 어도 하나를 계산한다. 도 3은 폴리펩타이드 사슬을 천연, 비천연 또는 인공의 안정한 접힌 형태로 접는 것을 촉진하기 위해 폴리펩타 이드 사슬을 조작하는 과정의 예시적 실시양태를 예시한다. 프로세스는 펩타이드 백본에 제1움직임 제한을 적용하는 단계, 펩타이드 백본에 제1방향 회전을 적용하는 단계, 적용된 제1움직임 제한 및 방향 회전 을 제거하는 단계, 펩타이드 백본에 제2움직임 제한을 적용하는 단계, 펩타이드 백본에 제2방향 회전을 적용는 단계를 포함한다. 본 방법은 당업자에게 명백한 바와 같이 본 발명의 범위를 벗어나지 않으면서 추가 단계, 더 적은 단계 및/또는 다른 순서의 단계를 포함할 수 있다. 단계 301에서, 프로세스는 펩타이드 백본에 적어도 하나의 제1움직임 제한(movement restriction)을 적용 하는 단계를 포함한다. 상기 움직임 제한은 힘과 토크 중 적어도 하나를 펩타이드 백본에 적용하는 것을 포함할 수 있다. 일 측면에서, 적어도 하나의 제1움직임 제한을 적용하는 단계는 펩타이드 백본을 따라 하나 이상의 위 치에 복수의 움직임 제한을 적용하는 것을 포함할 수 있다. 상기 움직임 제한은 펩타이드 백본의 회전 방지 및펩타이드 백본의 회전 제한 중 적어도 하나에 대한 제한을 포함할 수 있다. 일 측면에서, 회전을 제한하는 것은 펩타이드 백본의 회전 양 및 회전 속도 중 적어도 하나를 제한하는 것을 포함할 수 있다. 일 측면에서, 움직임 제한(들)은 확립된 역장(force field), 전기적 힘(들), 자기적 힘(들), 기계적 힘(들), 공유 및/또는 비공유 결 합력 또는 특성, 기타 힘 중 적어도 하나를 통해 적용된다. 일 측면에서, 적어도 하나의 제1움직임 제한을 적용 하는 단계는 아미노산에 적어도 하나의 힘을 적용하는 것을 포함할 수 있으며, 여기서 적어도 하나의 힘은 아미 노산에 근접한 아미노산 및 펩타이드 백본 부분 중 적어도 하나의 움직임을 제한하기에 충분한 크기이다. 일 측 면에서, 적어도 하나의 제1움직임 제한을 적용하는 단계는 복수의 아미노산에 적어도 하나의 힘을 적용하는 것 을 포함할 수 있으며, 여기서 적어도 하나의 힘은 적어도 다수의 아미노산 및 다수의 아미노산에 근접한 펩타이 드 백본 부분의 움직임을 제한하기에 충분한 크기이다. 일 측면에서, 움직임 제한(들)은 N-말단 아미노산, C-말 단 아미노산, 및 펩타이드 백본의 임의의 다른 아미노산 중 적어도 하나에 적용된다. 일 측면에서, 움직임 제한 (들)을 적용하는 것은 온도, 화학적 조성, 및 펩타이드가 위치한 용매의 점도 중 적어도 하나를 변형하는 것을 포함한다. 단계 302에서, 프로세스는 펩타이드 백본에 적어도 하나의 제1방향 회전을 적용하는 단계를 포함한다. 일 측면 에서, 회전 방향은 펩타이드 백본의 종축을 중심으로 한 시계 방향 또는 반시계 방향 회전 중 적어도 하나를 포 함한다. 방향 회전은 힘과 토크 중 적어도 하나를 펩타이드 백본에 적용하는 것을 포함할 수 있다. 일 측면에서, 적어도 하나의 제1방향 회전을 적용하는 것은 펩타이드 백본을 따라 하나 이상의 위치에서 복수의 방 향 회전을 적용하는 것을 포함할 수 있다. 일 측면에서, 방향 회전(들)은 확립된 역장(force field), 전기적 힘 (들), 자기적 힘(들), 기계적 힘(들), 공유 및/또는 비공유 결합력 또는 특성, 기타 힘 중 적어도 하나를 통해 적용된다. 일 측면에서, 적어도 하나의 제1방향 회전을 적용하는 단계는 아미노산에 적어도 하나의 힘을 적용하 는 것을 포함할 수 있으며, 여기서 적어도 하나의 힘은 아미노산 및 펩타이드 백본의 일부 중 적어도 하나를 아 미노산에 근접하게 회전시키기에 충분한 크기이다. 일 측면에서, 적어도 하나의 제1방향 회전을 적용하는 단계 는 복수의 아미노산에 적어도 하나의 힘을 적용하는 것을 포함할 수 있으며, 여기서 적어도 하나의 힘은 적어도 다수의 아미노산 및 다수의 아미노산에 근접한 펩타이드 백본의 부분을 회전시키기에 충분한 크기이다. 일 측면 에서, 방향성 회전(들)은 N-말단 아미노산, C-말단 아미노산, 및 펩타이드 백본의 임의의 다른 아미노산 중 적 어도 하나에 적용된다. 일 측면에서, 방향 회전(들)은 강제 회전 방법을 사용하여 적용된다. 일 양태에서, 방향 회전(들)은 임계 시간 기간에 걸쳐 적용된다. 일 측면에서, 방향 회전(들)은 정의된 기준 회전율을 갖는 유연한 축 접근법을 사용하여 적용된다. 단계 303에서, 프로세스는 적용된 제1움직임 제한(들) 및 방향 회전(들)을 제거하는 단계를 포함한다. 한 양태 에서, 제한 및/또는 회전을 제거하는 단계는 적용된 모든 조작을 동시에 제거하는 것을 포함할 수 있다. 일 측 면에서, 제거는 적용된 조작을 특정 순서로 제거하는 것을 포함할 수 있다. 일 측면에서, 제거는 적용된 개별 조작을 한 번에 하나씩 제거하는 것, 적용된 조작 그룹을 한 번에 하나씩 제거하는 것 중 적어도 하나를 포함할 수 있다. 일 측면에서, 적용된 움직임 제한(들) 및 방향 회전(들)을 제거하는 단계는 제한 및/또는 회전을 부과 하기 위해 적용되는 힘의 점진적 또는 단계적 감소와 같은 펩타이드 백본에 대한 제한의 제어된 해제 (controlled release)를 포함한다. 일 측면에서, 제어된 해제는 이전에 적용된 힘과 동일한 위치 중 하나 이상 에서 조작을 추가로 적용하고/하거나 이전에 적용된 제약과 같이 하나 이상의 다른 위치에서 힘을 추가로 적용 하여 적용된 조작 전체 또는 일부를 제거하는 것을 수반할 수 있다. 일 실시예에서, 제어된 방출은 이 단계의 끝에서 하나 이상의 적용된 조작을 유지하는 것을 포함할 수 있다. 단계 304에서, 프로세스는 펩타이드 백본에 적어도 하나의 제2움직임 제한을 적용하는 것을 포함한다. 이는 위 의 단계 301에서 설명한 바와 같이 제1움직임 제한을 적용하는 것과 동일한 방식으로 수행될 수 있다. 제2움직 임 제한(들)은 단계 301에서 적용된 적어도 하나의 제1움직임 제한(들)과 동일한 및/또는 다른 위치에 적용될 수 있다. 단계 305에서, 프로세스는 펩타이드 백본에 적어도 하나의 제2방향 회전을 적용하는 것을 포함한다. 이는 위의 단계에서 설명된 바와 같이 제1방향 회전을 적용하는 것과 동일한 방식으로 수행될 수 있다. 제2방향 회전 (들)은 단계에서 적용된 적어도 하나의 제1방향 회전(들)과 동일 및/또는 다른 위치에 적용될 수 있다. 일 측면에서, 움직임 제한(들) 및 방향 회전(들)의 조합 적용은 펩타이드 백본의 비틀림 및 펩타이드 백본의 형 태 변화 중 적어도 하나를 유도하는 방식으로 수행된다. 일 측면에서, 펩타이드 백본의 비틀림 또는 다른 형태 의 변화는 접힘 궤적을 수정하고 폴리펩타이드 사슬을 천연, 비천연 및/또는 인공 형태로 접는 것을 촉진하는 역할을 한다. 일 측면에서, 움직임 제한 및 방향 회전의 적용은 정의된 요인에 따라 접힘을 가속화하여 펩타이 드 접힘을 증가시킨다(예를 들어 접혀 있고 안정적인 형태를 얻는 데 필요한 시간을 줄인다). 일 측면에서, 움직임 제한(들) 및/또는 방향 회전(들)의 적용은 원하는 또는 미리 정의된 비틀림 또는 펩타이드 백본의 다른 형 태 변화를 달성하기 위해 필요에 따라 조정 및/또는 변형된다. 일 측면에서, 움직임 제한(들) 및 방향 회전(들)의 상기 적용은 컴퓨터 시뮬레이션의 일부로서 인실리코(in silico) 적용을 수행하는 것을 포함할 수 있다. 예를 들어, 분자 역학 시뮬레이션 소프트웨어를 사용하여 움직 임 제한 및 방향 회전을 적용할 수 있다. 일 측면에서, 컴퓨터 시뮬레이션은 일정한 온도, 일정한 압력 및 정의 된 힘 상수 중 적어도 하나를 사용하여 수행된다. 일 측면에서, 움직임 제한(들) 및 방향 회전(들)은 시험관 내 에서 적용된다. 일 측면에서, 움직임 제한(들) 및 방향 회전(들)의 시험관내 적용은 광학 핀셋, 자기 핀셋, 자 기 비드, 전자석, 압전 장치 및 압전음향 장치 중 적어도 하나를 사용하여 수행된다. 일 측면에서, 본 방법은 천연 및 비-천연 접힘 형태 중 적어도 하나를 갖는 적어도 하나의 인공 단백질을 생산하는 데 사용된다. 일 측면에서, 프로세스는 움직임 제한(들) 및 방향 회전(들)의 적용 및 제거 중 적어도 하나 전, 도중 및/또는 후에 이미지를 캡처하는 단계를 추가로 포함할 수 있다. 일 측면에서, 이미지를 캡처하는 것은 컴퓨터 시뮬레이 션 기반 애플리케이션을 통해 스냅샷 또는 스크린샷을 얻는 것과 움직임 제한(들) 및 방향 회전(들)을 제거하는 것을 포함한다. 일 측면에서, 프로세스는 펩타이드 조작과 관련된 적어도 하나의 결과 측정값을 계산하는 단계를 추가로 포함할 수 있다. 일 측면에서, 결과 측정(들)은 접힘 궤적, 결과적으로 발생하는 접힌 형태, 접힘 정확도, 기본 접촉의 수 또는 비율, 결과적으로 발생하는 접힘 형태를 달성하는 시간 중 적어도 하나와 연관된다. 일 측면에서, 접힘 정확도는 예상되는 접힘 궤적과 비교하여 계산된 접힘 궤적 및 예상되는 결과적인 접힌 형태와 비교하여 계산된 결과적인 접힌 형태 중 적어도 하나 사이의 유사성 척도 및 차이의 척도 중 적어도 하나를 포함한다. 일 측면에 서, 프로세스는 달성된 적어도 하나의 고유 접힘 확인(native folding confirmation), 달성된 적어도 하나의 비 -천연 접힘 형태, 달성된 적어도 하나의 안정한 접힘 형태, 달성된 적어도 하나의 비안정적인 접힘 형태, 달성 된 적어도 하나의 기능적 형태, 달성된 적어도 하나의 중간 확인(예를 들어 알파나선), 및 달성된 적어도 하나 의 잘못 접힌 형태를 확인하는 것을 추가로 포함할 수 있다. 일반적으로, 여기에 개시된 기술은 하드웨어 또는 소프트웨어와 하드웨어의 조합으로 구현될 수 있다. 예를 들 어, 운영 시스템 커널(operating system kernel), 별도의 사용자 프로세스, 네트워크 애플리케이션에 바인딩된 라이브러리 패키지, 특별히 구성된 시스템, ASIC(Application-Specific Integrated Circuit) 또는 네트워크 인 터페이스 카드에서 구현될 수 있다. 본 명세서에 개시된 실시 예의 적어도 일부의 소프트웨어/하드웨어 하이브리드 구현은 메모리 내에 저장된 컴퓨 터 프로그램에 의해 선택적으로 활성화 또는 재구성되는 프로그래밍 가능한 네트워크-레지던트 머신(간헐적으로 연결된 네트워크 인식 시스템을 포함하는 것으로 이해되어야 함) 상에서 구현될 수 있다. 그러한 네트워크 장치 들은 상이한 유형의 네트워크 통신 프로토콜들을 이용하도록 구성 또는 설계될 수 있는 다수의 네트워크 인터페 이스를 가질 수 있다. 소정의 기능 유닛이 구현될 수 있는 하나 이상의 예시적인 수단을 도시하기 위해 이러한 머신들 중 일부를 위한 일반적인 아키텍처가 여기에 개시된 설명에 나타날 수 있다. 구체적인 실시 예에 따르면, 본 명세서에 개시되는 다양한 실시 예의 특징들 및/또는 기능성들 중 적어도 일부는 최종 사용자 컴퓨 터 시스템, 클라이언트 컴퓨터, 네트워크 서버 또는 기타 서버 시스템, 모바일 컴퓨팅 장치(예를 들어, 태블릿 컴퓨터 장치, 모바일 전화기, 스마트폰, 랩탑, 또는 다른 적절한 컴퓨팅 장치), 소비자 전자 장치, 뮤직 플레이 어, 또는 임의의 다른 적합한 전자 장치, 라우터, 스위치 또는 다른 적합한 장치, 또는 그들의 임의의 조합과 같은 하나 이상의 네트워크와 관련된 하나 이상의 범용 컴퓨터에서 구현될 수 있다. 적어도 일부 실시예들에서, 본 명세서에 개시된 다양한 실시 예의 특징들 또는 기능의 적어도 일부는 하나 이상의 가상화된 컴퓨팅 환경(예 를 들어 네트워크 컴퓨팅 클라우드, 하나 이상의 물리적 컴퓨팅 머신에서 호스팅되는 가상머신 또는 기타 적절 한 가상 환경)에서 구현될 수 있다. 위에 언급된 시스템, 유닛, 모듈, 엔진, 컨트롤러, 구성 요소 등은 여기에 설명된 하드웨어 및/또는 소프트웨어일 수 있으며/또는 이를 포함할 수 있다. 예를 들어, 폴리펩타이드 조작 및 데이터 처리 시스템 및 그 하위 구성요소는 도 4-7과 관련하여 본 명세서에 설명된 컴퓨팅 하드웨어 및/또 는 소프트웨어이거나 이를 포함할 수 있다. 또한, 위에 언급된 시스템, 유닛, 모듈, 엔진, 컨트롤러, 구성요소, 인터페이스 등 중 임의의 것은 데이터나 정보를 획득 및/또는 제공하기 위해 다른 시스템 장치, 모듈, 엔진, 컨 트롤러, 구성 요소, 인터페이스 등과 통신하기 위한 애플리케이션 프로그래밍 인터페이스(API)를 사용 및/또는 포함할 수 있다. 이제 도 4를 참조하면, 여기에 개시된 특징 또는 기능 중 적어도 일부를 구현하는 데 적합한 예시적인 컴퓨팅 장치를 도시하는 블록도가 도시되어 있다. 상기 컴퓨팅 장치는 예를 들어 이전 단락에 나열된 컴퓨팅기계 중 어느 하나일 수 있거나 실제로 메모리에 저장된 하나 이상의 프로그램에 따라 소프트웨어 기반 또는 하 드웨어 기반 명령을 실행할 수 있는 다른 전자 장치일 수 있다. 컴퓨팅 장치는 광역 네트워크, 대도시 지역 네트워크, 근거리 네트워크, 무선 네트워크, 인터넷 또는 무선이든 유선이든 그러한 통신을 위해 알려진 프로토 콜을 사용하는 기타 네트워크와 같은 통신 네트워크를 통해 클라이언트 또는 서버와 같은 복수의 다른 컴퓨팅 장치와 통신하도록 구성될 수 있다. 일 측면에서, 컴퓨팅 장치는 하나 이상의 중앙 처리 장치(CPU), 하나 이상의 인터페이스, 및 (PCI(Peripheral Component Interconnect) 버스와 같은) 하나 이상의 버스 를 포함한다. 적절한 소프트웨 어 또는 펌웨어의 제어에 따라 작동할 때 CPU는 특별히 구성된 컴퓨팅 장치 또는 기계의 기능과 관련된 특 정 기능을 구현하는 일을 담당할 수 있다. 예를 들어, 적어도 하나의 측면에서, 컴퓨팅 장치는 CPU, 로 컬 메모리 및/또는 원격 메모리, 및 인터페이스(들)를 활용하는 서버 시스템으로서 기능하도록 구 성되거나 설계될 수 있다. 적어도 하나의 측면에서, CPU는 예를 들어 운영 체제 및 임의의 적절한 애플리케 이션 소프트웨어, 드라이버 등을 포함할 수 있는 소프트웨어 모듈 또는 구성요소의 제어 하에 하나 이상의 다양 한 유형의 기능 및/또는 동작을 수행하게 될 수 있다. CPU는 예를 들어 Intel, ARM, Qualcomm 및 AMD 마이크로프로세서 제품군 중 하나의 프로세서와 같은 하나 이상의 프로세서를 포함할 수 있다. 일부 실시예에서, 프로세서는 컴퓨팅 장치의 동작을 제어하기 위해 ASIC(Application-Specific Integrated Circuit), EEPROM(Electrically Eraseable Programmable Read- Only Memory), FPGA(Field Programmable Gate Array) 등과 같은 특별히 설계된 하드웨어를 포함할 수 있다. 특 정 측면에서, 로컬 메모리(예를 들어 하나 이상의 캐시된 메모리 레벨을 포함하는 비휘발성 랜덤 액세스 메 모리(RAM) 및/또는 읽기 전용 메모리(ROM)와 같은)도 CPU의 일부를 형성할 수 있다. 그러나 메모리를 시스 템에 연결하는 방법에는 여러 가지가 있다. 메모리는 예를 들어 데이터 캐싱 및/또는 저장, 프로그래밍 명령 등과 같은 다양한 목적을 위해 사용될 수 있다. CPU는 예를 들어 모바일 장치 또는 통합 장치에 사용 하기 위해 해당 기술 분야에서 점점 일반화되고 있는 QUALCOMM SNAPDRAGON™ 또는 SAMSUNG EXYNOS™ CPU와 같 은 메모리나 그래픽 처리 칩과 같은 추가 하드웨어를 포함할 수 있는 다양한 SOC(system-on-a-chip) 유형 하드 웨어 중 하나일 수 있다. 본 명세서에 사용된 바와 같이, \"프로세서\"라는 용어는 해당 기술 분야에서 프로세서, 모바일 프로세서 또는 마 이크로프로세서로 언급되는 집적 회로에만 국한되지 않고 마이크로컨트롤러, 마이크로컴퓨터, 프로그래밍 가능 논리 컨트롤러, 애플리케이션별 집적 회로 및 기타 프로그래밍 가능 회로를 광범위하게 의미한다. 일 측면에서, 인터페이스는 네트워크 인터페이스 카드(NIC)로서 제공된다. 일반적으로 NIC는 컴퓨터 네트워 크를 통한 데이터 패킷의 전송 및 수신을 제어한다; 다른 유형의 인터페이스는 예를 들어 컴퓨팅 장치 와 함께 사용되는 다른 주변 장치를 지원할 수 있다. 제공될 수 있는 인터페이스 중에는 이더넷 인터페이스, 프 레임 릴레이 인터페이스, 케이블 인터페이스, DSL 인터페이스, 토큰 링 인터페이스, 그래픽 인터페이스 등이 있 다. 이 밖에도 USB(Universal Serial Bus), 시리얼(Serial), USB(Universal Serial Bus), Ethernet, FIREWIRE ™, THUNDERBOLT™, PCI, 병렬, 무선 주파수(RF), BLUETOOTH™, 근거리 통신(예를 들어 근거리 자기장 사용), 802.11(WiFi), 프레임 릴레이, TCP/IP, ISDN, 고속 이더넷 인터페이스, Gigabit Ethernet 인터페이스, Serial ATA(SATA) 또는 외부 SATA(ESATA) 인터페이스, HDMI(high-definition multimedia interface), DVI(digital visual interface), 아날로그 또는 디지털 오디오 인터페이스, ATM(asynchronous transfer mode) 인터페이스, HSSI(high-speed serial interface) 인터페이스, POS(Point of Sale) 인터페이스, FDDI(fiber data distributed interfaces) 등 다양한 형태의 인터페이스가 제공될 수 있다. 일반적으로, 이러한 인터페이스 는 적절한 매체와의 통신에 적합한 물리적 포트를 포함할 수 있다. 일부 경우에, 또한 독립 프로세서(high- fidelity A/V 하드웨어 인터페이스에 대한 기술 분야에서 일반적으로 사용되는 전용 오디오 또는 비디오 프로세 서 등) 및 경우에 따라 휘발성 및/또는 비휘발성 메모리(예를 들어 RAM)를 포함할 수도 있다. 도 4에 도시된 시스템은 본 명세서에 설명된 하나 이상의 실시예를 구현하기 위한 컴퓨팅 장치에 대한 하나 의 특정 아키텍처를 예시하지만, 이는 결코 여기에 설명된 특징 및 기술의 적어도 일부가 구현될 수 있는 유일 한 장치 아키텍처가 아니다. 예를 들어, 하나 또는 임의의 수의 프로세서를 갖는 아키텍처가 사용될 수 있 고, 그러한 프로세서는 단일 장치에 존재할 수도 있고 임의의 수의 장치 중에 분산될 수도 있다. 일 측면에 서, 단일 프로세서는 통신 및 라우팅 계산을 처리하는 반면, 다른 실시예에서는 별도의 전용 통신 프로세서 가 제공될 수 있다. 다양한 실시예에서, (클라이언트 소프트웨어를 실행하는 태블릿 장치 또는 스마트폰과 같은) 클라이언트 장치와 (아래에 더 자세히 설명되는 서버 시스템과 같은) 서버 시스템을 포함하는 측면에 따른 시스템에서 다양한 유형의 특징 또는 기능이 구현될 수 있다. 네트워크 장치 구성에 관계없이, 일 측면의 시스템은 데이터, 범용 네트워크 동작을 위한 프로그램 명령, 또는 여기에 설명된 실시예(또는 위의 임의의 조합)의 기능과 관련된 기타 정보를 저장하도록 구성된 하나 이상의 메 모리 또는 메모리 모듈 (예를 들어 원격 메모리 블록 및 로컬 메모리)을 사용할 수 있다. 프로그램 명 령은 예를 들어 운영 체제 및/또는 하나 이상의 애플리케이션의 실행을 제어하거나 이를 포함할 수 있다. 메모 리 또는 메모리(11, 16)는 또한 데이터 구조, 구성 데이터, 암호화 데이터, 과거 시스템 작동 정보, 또는 여기에 설명된 임의의 다른 특정 또는 일반 비프로그램 정보를 저장하도록 구성될 수 있다. 이러한 정보 및 프로그램 명령어들이 본 명세서에 기술된 시스템들/방법들을 구현하기 위해 이용될 수 있기 때 문에, 적어도 일부 네트워크 디바이스 실시예들은, 예를 들어, 본 명세서에 기술된 다양한 동작들을 수행하기 위한 프로그램 명령어들, 상태 정보 등을 저장하도록 구성되거나 설계될 수 있는 비일시적 기계 판독 가능 저장 매체를 포함할 수 있다. 이러한 비일시적 기계 판독 가능 저장 매체의 예들은 하드 디스크, 플로피 디스크, 및 자기 테이프와 같은 자기 매체; CD-ROM 디스크와 같은 광 매체; 광 디스크(optical disk)와 같은 광자기 매체, 그리고 읽기 전용 메모리 장치(ROM), 플래시 메모리(모바일 장치 및 통합 시스템에서 일반적으로 사용됨), 솔리 드 스테이트 드라이브(SSD) 및 솔리드 스테이트와 SSD의 물리적 구성 요소를 결합할 수 있는 \"하이브리드 SSD\" 스토리지 드라이브 및 단일 하드웨어 장치의 하드 디스크 드라이브(개인용 컴퓨터와 관련하여 해당 기술 분야에 서 점점 일반화되고 있음), 멤리스터 메모리, RAM(Random Access Memory) 등과 같은 프로그램 명령어들을 저장 하고 수행하도록 특별히 구성되어 있는 하드웨어 디바이스들을 포함하지만, 이들로 제한되지 않는다. 그러한 저 장 수단은 일체형이고 제거 불가능(예를 들어 마더보드에 납땜되거나 전자 장치에 통합될 수 있는 RAM 하드웨어 모듈)할 수 있거나, 이들은 스왑 가능한 플래시 메모리 모듈 (예를 들어 물리적 저장 장치를 빠르게 교환하도록 설계된 \"썸 드라이브\" 또는 기타 이동식 미디어), \"핫 스왑 가능한\" 하드 디스크 드라이브 또는 솔리드 스테이 트 드라이브, 착탈식 광학 저장 디스크 또는 기타 착탈식 미디어와 같이 착탈식일 수 있으며, 이러한 일체형 및 착탈식 저장 매체는 상호 교환적으로 활용될 수 있다. 프로그램 명령어의 예에는 컴파일러에 의해 생성될 수 있 는 객체 코드(object code), 어셈블러 또는 링커에 의해 생성될 수 있는 기계 코드(machine code), 예를 들어 JAVA™ 컴파일러에 의해 생성될 수 있고 Java 가상 머신 또는 이와 동등한 것을 사용하여 실행될 수 있는 것, 또는 인터프리터(예를 들어 Python, Perl, Ruby, Groovy 또는 기타 스크립트 언어로 작성된 스크립트)를 사용하 여 컴퓨터에 의해 실행될 수 있는 상위 레벨 코드를 포함하는 파일이 모두 포함된다. 일부 실시예에서, 시스템은 독립형 컴퓨팅 시스템에서 구현될 수 있다. 이제 도 5를 참조하면, 독립형 컴퓨팅 시스템 상의 하나 이상의 실시예 또는 그 구성요소의 전형적인 예시적 아키텍처를 묘사하는 블록도가 도시되어 있다. 컴퓨팅 장치는 예를 들어 클라이언트 애플리케이션과 같은 실시예의 하나 이상의 기능 또는 애플리케 이션을 수행하는 소프트웨어를 실행할 수 있는 프로세서를 포함한다. 프로세서는 예를 들어 MICROSOFT WINDOWS™ 운영 체제, APPLE macOS™ 또는 iOS™ 운영 체제, 일부 다양한 Linux 운영 체제, ANDROID™ 운영 체 제 등과 같은 운영 체제의 제어 하에 컴퓨팅 명령을 수행할 수 있다. 많은 경우에, 하나 이상의 공유 서비 스는 시스템에서 작동 가능하며, 클라이언트 애플리케이션에 공통 서비스를 제공하는 데 유용할 수 있 다. 서비스는 예를 들어 WINDOWS™ 서비스, Linux 환경의 사용자 공간 공통 서비스, 또는 운영 체제와 함께 사용되는 임의의 다른 유형의 공통 서비스 아키텍처일 수 있다. 입력 장치는 예를 들어 키보드, 터치 스크린, 마이크(예를 들어 음성 입력용), 마우스, 터치패드, 트랙볼, 또는 이들의 임의의 조합을 포함하여 사용 자 입력을 수신하기에 적합한 임의의 유형일 수 있다. 출력 장치는 시스템에 대해 원격이든 로컬이든 상관없이 한 명 이상의 사용자에게 출력을 제공하기에 적합한 임의의 유형일 수 있으며, 예를 들어 시각적 출력 을 위한 하나 이상의 스크린, 스피커, 프린터 또는 이들의 임의의 조합을 포함할 수 있다. 메모리는 예를 들어 소프트웨어를 실행하기 위해 프로세서에 의해 사용되는, 당업계에 알려진 임의의 구조 및 아키텍처를 갖는 랜덤 액세스 메모리일 수 있다. 저장 장치는 디지털 형태의 데이터 저장을 위한 임의의 자기, 광학, 기계적, 멤리스터 또는 전기 저장 장치(도 4를 참조하여 위에서 설명한 것과 같은)일 수 있다. 저장 장치의 예는 플래시 메모리, 자기 하드 드라이브, CD-ROM 등을 포함한다. 일부 실시예에서 시스템은 임의 수의 클라이언트 및/또는 서버를 갖는 분산 컴퓨팅 네트워크에서 구현될 수 있 다. 이제 도 6을 참조하면, 분산 컴퓨팅 네트워크의 일 측면에 따른 시스템의 적어도 일부를 구현하기 위한 예 시적인 아키텍처를 도시하는 블록도가 도시되어 있다. 이 측면에 따르면, 임의 개수의 클라이언트가 제 공될 수 있다. 각 클라이언트는 시스템의 클라이언트측 부분을 구현하기 위한 소프트웨어를 실행할 수 있다. 클라이언트는 도 5에 도시된 것과 같은 시스템을 포함할 수 있다. 또한, 하나 이상의 클라이언트(3 3)로부터 수신된 요청을 처리하기 위해 임의 개수의 서버가 제공될 수 있다. 클라이언트와 서버는하나 이상의 전자 네트워크를 통해 서로 통신할 수 있으며, 이는 다양한 실시예에서 인터넷, 광역 네트워크, 이동 전화 네트워크(CDMA 또는 GSM 셀룰러 네트워크와 같은), 임의의 무선 네트워크(WiFi, WiMAX, LTE 등과 같은) 또는 근거리 통신망(또는 실제로 해당 기술 분야에 알려진 임의의 네트워크 토폴로지)일 수 있 다; 측면은 다른 네트워크 토폴로지보다 특정 네트워크 토폴로지를 선호하지 않는다. 네트워크는 예를 들어 유선 및/또는 무선 프로토콜을 포함하는 임의의 공지된 네트워크 프로토콜을 사용하여 구현될 수 있다. 또한, 일부 실시예에서, 서버는 추가 정보를 얻거나 특정 호출에 관한 추가 데이터를 참조하기 위해 필요할 때 외부 서비스를 호출할 수 있다. 외부 서비스와의 통신은 예를 들어 하나 이상의 네트워크를 통 해 이루어질 수 있다. 다양한 실시예에서, 외부 서비스는 하드웨어 장치 자체에 관련되거나 하드웨어 장치 자체에 설치된 웹 기반 서비스 또는 기능을 포함할 수 있다. 예를 들어, 클라이언트 애플리케이션이 스마트폰이 나 다른 전자 장치에 구현되는 일 측면에서, 클라이언트 애플리케이션은 클라우드의 서버 시스템이나 특정 기업이나 사용자의 건물 중 하나 이상에 배포된 외부 서비스에 저장된 정보를 얻을 수 있다. 일부 실시예에서, 클라이언트 또는 서버(또는 둘 다)는 하나 이상의 네트워크를 통해 로컬로 또는 원격으로 배치될 수 있는 하나 이상의 특수 서비스 또는 기기를 사용할 수 있다. 예를 들어, 하나 이상의 데이 터베이스는 하나 이상의 실시예에 의해 사용되거나 참조될 수 있다. 당업자는 데이터베이스가 다양한 아키텍처로 그리고 다양한 데이터 액세스 및 조작 수단을 사용하여 배열될 수 있다는 것을 이해해야 한다. 예를 들어, 다양한 실시예에서 하나 이상의 데이터베이스는 구조화된 쿼리 언어(SQL)를 사용하는 관계형 데이터 베이스 시스템을 포함할 수 있는 반면, 다른 것들은 당업계에서 \"NoSQL\"(예를 들어, HADOOP CASSANDRA™, GOOGLE BIGTABLE™ 등)로 지칭되는 것과 같은 대체 데이터 저장 기술을 포함할 수 있다. 일부 실시예에서, 열 지향 데이터베이스, 인메모리 데이터베이스, 클러스터형 데이터베이스, 분산 데이터베이스 또는 플랫 파일 데이 터 저장소와 같은 다양한 데이터베이스 아키텍처가 해당 측면에 따라 사용될 수 있다. 특정 데이터베이스 기술 또는 구성 요소의 특정 배열이 여기에 설명된 특정 측면에 대해 지정되지 않는 한, 알려진 또는 미래의 데이터 베이스 기술의 임의의 조합이 적절하게 사용될 수 있다는 것이 해당 분야의 통상의 기술자에 의해 인식될 것이다. 더욱이, 본 명세서에 사용된 \"데이터베이스\"라는 용어는 물리적 데이터베이스 머신, 단일 데이터베이스 시 스템으로 작동하는 머신들의 클러스터, 또는 전체 데이터베이스 관리 시스템 내의 논리적 데이터베이스를 지칭 할 수 있다는 것을 이해해야 한다. \"데이터베이스\"라는 용어의 특정 사용에 대해 특정 의미가 지정되지 않는 한, 이는 단어의 이러한 의미 중 임의의 의미를 의미하는 것으로 해석되어야 하며, 이 모든 의미는 당업자에 의 해 \"데이터베이스\"라는 용어의 단순한 의미로 이해된다. 마찬가지로, 일부 실시예에서는 하나 이상의 보안 시스템 및 구성 시스템을 사용할 수 있다. 보안 및 구성 관리는 일반적인 정보 기술(IT) 및 웹 기능이며, 각각의 일부는 일반적으로 IT 또는 웹 시스템과 연관되어 있다. 특정 보안 또는 구성 시스템 또는 접근법이 임의의 특정 측면의 설명에 의해 특별히 요구되지 않 는 한, 현재 또는 미래에 기술 분야에 알려진 임의의 구성 또는 보안 서브시스템이 제한 없이 실시예와 함께 사 용될 수 있음을 당업자는 이해해야 한다. 도 7은 시스템 전체의 다양한 위치 중 임의의 위치에서 사용될 수 있는 컴퓨터 시스템의 예시적인 개요를 도시한다. 이는 데이터를 처리하기 위해 코드를 실행할 수 있는 모든 컴퓨터의 예이다. 본 명세서에 개시된 시 스템 및 방법의 더 넓은 범위를 벗어나지 않고 컴퓨터 시스템에 다양한 수정 및 변경이 이루어질 수 있다. 중앙 처리 장치(CPU)는 버스에 연결되고, 버스에는 메모리, 비휘발성 메모리, 디스플레이, 입력/출력(I/O) 장치 및 네트워크 인터페이스 카드(NIC)도 연결된다. I/O 장치는 일반적으로 키보 드, 포인팅 장치, 하드 디스크 및 실시간 클록에 연결될 수 있다. NIC는 인터넷 또는 로컬 네트워크일 수 있는 네트워크에 연결되며, 로컬 네트워크는 인터넷에 연결되거나 연결되지 않을 수 있다. 또한 시스템의 일부로서 도시된 것은 이 예에서는 주 교류(AC) 공급 장치에 연결된 전원 장치이다. 존재할 수 있는 배터리, 그리고 잘 알려져 있지만 여기에 개시된 현재 시스템 및 방법의 특정 신규 기능에 적용 할 수 없는 많은 다른 장치 및 변형은 도시되어 있지 않다. 예시된 일부 또는 모든 구성요소는 여러 기능을 단 일 하드웨어 장치(예를 들어, 스마트폰, 비디오 게임 콘솔과 같은 모바일 장치, 자동차의 내비게이션이나 멀티 미디어 시스템과 같은 차량 내 컴퓨터 시스템 또는 기타 통합 하드웨어 장치에서)로 결합하는 것이 적절할 때마 다 예를 들어 Qualcomm 또는 Samsung 시스템 온 칩(SOC) 장치와 같은 다양한 통합 애플리케이션에서 결합될 수 있음을 이해해야 한다. 컴퓨팅 시스템 또는 컴퓨팅 시스템으로부터의 출력은 참조 번호 60으로 나타낸 바와 같은 실험실 환경에서와 같이 시험관 내 펩타이드 조작 및 단백질 형성을 수행하는 데 적용될 수 있다. 일 측면 에서, 컴퓨터 시스템은 시험관 내 조작을 적어도 부분적으로 제어하는 데 사용될 수 있다. 일 측면에서, 컴 퓨터 시스템은 시험관 내 조작을 수행하는데 있어서 다른 컴퓨터 시스템을 보완할 수 있다. 일 측면에서,컴퓨터 시스템은 제2컴퓨터 시스템에 의해 사용하기 위한 출력(예를 들어, 시뮬레이션 특성/결과)을 제공할 수 있으며, 여기서 제2컴퓨터 시스템은 컴퓨터 시스템에 의해 제공된 출력에 적어도 부분적으로 기초하여 시험관 내 조작을 수행한다. 일 측면에서, 시험관내 조작은 컴퓨터 시뮬레이션 정보 및/또는 컴퓨터 시스템(4 0)으로부터의 출력의 적어도 일부를 사용하는 기계적 조작에 의해 수행될 수 있다. 다양한 실시예에서, 다양한 실시예의 시스템 또는 방법을 구현하기 위한 기능은 임의의 수의 클라이언트 및/또 는 서버 구성요소에 분산될 수 있다. 예를 들어, 임의의 특정 측면의 시스템과 관련하여 다양한 기능을 수행하 기 위해 다양한 소프트웨어 모듈이 구현될 수 있으며, 이러한 모듈은 서버 및/또는 클라이언트 구성 요소에서 실행되도록 다양하게 구현될 수 있다. 당업자는 위에서 설명한 다양한 실시예의 가능한 수정 범위를 알 수 있을 것이다. 따라서, 본 발명은 청구범위 및 그 균등물에 의해 정의된다. 위의 본 발명 개념의 첫 번째 예시 구현 및 해당 결과가 아래에 포함되어 있다. 일단 살아있는 세포에서 합성되면, 대부분의 단백질은 고유 형태라고 불리는 독특한 생물학적 활성 3차원 구조 를 빠르게 얻는다. 이러한 형태는 분자 샤페론 및 기타 성숙 인자와 접는 사슬의 상호 작용을 포함하는 접는 과 정을 통해 생체 내에서 강력하게 달성된다. 많은 단백질의 기본 형태는 현대 인공지능 방법을 사용하여 예측할 수 있지만, 이러한 기본 형태로 이어지는 접힘 과정은 상대적으로 짧은 몇몇 폴리펩타이드의 경우를 제외하고는 일반적으로 in silico나 in vitro에서 재현할 수 없다. 접힘 경로의 중간체와 이를 가능하게 하는 메커니즘에 대한 지식은 접힘 및 잘못 접힘 과정이 변경될 수 있는 개입 지점을 결정하는 데 필수적이다. 현재 지배적인 단백질 접힘 모델은 일부 작은 단백질이 다른 단백질이나 세포 성분과 분리되어 시험관 내에서 자발적으로 원래의 형태로 접힐 수 있다는 초기 관찰에 의해 촉발되었다. 이러한 관찰은 단백질 접힘에 대한 열 역학적 가설을 낳았고, 이는 열역학적으로 유리한 비보조 과정으로 단백질 접힘을 설명하는 물리적 모델의 개발 로 이어졌다. 보다 최근의 세련된 형태로 이 모델에는 깔때기의 높은 자유 에너지 가장자리(high-free-energy brim of the funnel)를 차지하는 다양한 펼쳐진 구조화되지 않은 형태가 있는 견고한 깔때기 모양의 에너지 환 경(rugged funnel-shaped energy landscape)에 대한 설명이 포함되어 있다. 폴리펩타이드 사슬이 접히면서, 그 들은 깔때기 바닥에서 전체 열역학적 최소값을 차지하는 것으로 추정되는 기본 형태에 도달할 때까지 점진적으 로 감소하는 Gibbs 자유 에너지로 형태를 샘플링한다. 접힘 과정에서 형태의 샘플링은 무작위 열 운동을 통해 발생하는 것으로 가정된다. 단백질 접힘의 원동력은 자유 에너지가 전체 최소값으로 감소하는 것으로 가정된다."}
{"patent_id": "10-2024-7011744", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하면, 단백질 접힘의 현재 일반 물리적 모델은 외부 에너지원이 없는 폐쇄 시스템에서 발생하는 과정을 설 명한다. 이는 접힘이 무작위적이고 구조화되지 않은 형태에서 시작하여 도움 없이 진행되며 접힘 사슬이 다른 단백질이나 거대분자 세포 구성 요소와 상호 작용해야 한다는 명백한 요구 사항이 없다고 가정한다. 펩타이드 백본의 기계적 조작을 통해 기본 구조의 획즉을 촉진할 수 있는 단백질 폴딩 기계의 타당성을 탐색하 는 첫 번째 단계로, 우리는 펩타이드 백본에 비틀림을 적용하여 강화된 분자 역학 시뮬레이션을 수행했다. 시뮬 레이션 동안 다양한 폴리펩타이드의 C-말단은 시계 방향이나 반시계 방향으로 기계적으로 회전하는 반면 N-말단 의 움직임은 제한되었다. 우리는 두 가지 유형의 시뮬레이션의 궤적을 토크를 적용하지 않고 동일한 펩타이드를 접는 방식으로 비교했다. 우리의 실험에서 N 말단의 움직임을 동시에 제한하면서 C 말단 아미노산의 방향 회전 은 실제로 5개의 다양한 알파-나선형 펩타이드에서 기본 구조의 형성을 촉진했다. ICM 소프트웨어를 사용하여 펩타이드의 초기 신장된 구조(도 8에 나타냄)를 생성했다. 우리는 X축을 따라 펩타 이드를 정렬하고 펩타이드와 시뮬레이션 상자 사이의 최소 거리가 1.5 nm인 다른 모든 경우에 보조되지 않은 접 힘 및 삼사정 상자(triclinic box) 시뮬레이션의 경우 12면체 상자에서 이를 용해시켰다. 칼륨 및 나트륨 이온 을 첨가하여 시스템의 전하를 중화시켰다. 그런 다음 시스템은 가장 가파른 하강 알고리즘(steepest descent algorithm)을 사용하여 최소화되었으며 온도 결합을 위해 V-rescale 온도 조절 장치를 사용하여 NVT 앙상블에서 100ps 동안 평형을 이루고 V-rescale 온도 조절 장치 및 Berendsen barostat를 사용하여 1ns 동안 NPT 앙상블 에서 계속되었다. 평형 후 Nose-Hoover 온도 조절 장치와 등방성 Parinello-Rahman 기압 조절 장치를 사용하여 온도와 압력을 각각 300K와 1bar로 일정하게 유지했다. 모든 시뮬레이션에서 우리는 TIP3P water model 및 Joung 및 Cheatham이 수정한 이온 매개변수와 함께 ff14SB 역장(force field)을 사용했다. 정전기 상호작용은 0.135nm의 푸리에 그리드 간격을 갖는 PME(particle-mesh Ewald) 합산을 사용하여 계산되었다. 비결합 쿨롱 및 Lennard-Jones 상호작용의 경우 1nm 컷오프가 사용되었다. 우리는 LINCS 알고리즘으로 수소 결합을 제한하고 2-fs 통합 시간 단계를 사용했다.펩타이드의 C 말단에 외부 기계적 토크를 가하기 위해 강제 회전을 적용했다. 이를 위해 우리는 회전이 적용된 X축과 정렬된 상태를 유지하기 위해 C 말단 알라닌의 O 및 N 원자 위치를 제한했다. 10000 kJ/mol*nm2의 힘 상 수를 갖는 제한은 YZ 평면에만 적용되어 C 말단 아미노산은 X 축을 따라 이동할 수 있었다. 또한 우리는 C-말단 아미노산의 O 원자를 5 kJ/mol*nm2의 힘 상수로 X 방향으로 구속했고, 모든 방향에서 10000 kJ/mol*nm2의 힘 상 수로 N 말단 알라닌의 N 및 Cα 원자를 구속했다. C 말단 아미노산은 기준 회전 속도가 60 degrees/ps이고 힘 상수가 1500kJ/mol*nm2인 유연한 축 접근법(Vflex2)을 사용하여 회전되었다. 모든 시뮬레이션 및 궤적 분석에는 GROMACS 패키지 버전 2020.236이 사용되었다. 시뮬레이션은 Ubuntu 18.04를 실행하는 Turing 아키텍처를 갖춘 CUDA 지원 GPU에서 수행되었다. 단백질 구조 및 궤적의 시각화를 위해 ICM- Pro 3.924 및 VMD 1.9.337 프로그램이 사용되었다. 도 9는 본 연구에 사용된 에너지 의존성 펩타이드 폴딩 프로토콜의 도식적 표현을 예시한다. 시뮬레이션 상자에 서 펩타이드의 C- 및 N-말단에 적용된 힘 벡터는 화살표로 표시된다. 모든 힘 값은 kJ/mol*nm2 단위이다. 구부 러진 화살표는 모든 펩타이드의 나선형 형태로의 생산적인 접힘을 가속화하는 펩타이드의 시계 방향 회전 방향 을 나타낸다. 제한된 그룹은 녹색 윤곽선으로 표시된다. 우리는 C-말단 아미노산을 두 가지 가능한 방향(도 9와 같이 시계 방향 또는 시계 반대 방향) 중 하나로 회전시키기 위해 기계적 힘이 가해진 펩타이드의 접힘 궤적을 움직임 제한이나 기계적 힘의 적용 없이 접힐 수 있는 동일한 펩타이드의 궤적(아래에서는 \"보조되지 않은 접기 (unassisted folding)\"라고 함).과 비교했다. 추가 제어로서 우리는 각 펩타이드의 양쪽 끝에 동작 제한을 적용 했지만 토크는 생략한 네 번째 유형의 시뮬레이션을 실행했다. 4가지 유형의 시뮬레이션을 각각 3회 반복하여 각 펩타이드에 대해 12개의 시뮬레이션을 제공했다. 실험은 접힌 형태로 α-나선 형태를 채택하는 것으로 알려진 5개의 펩타이드에 대해 수행되었다(도 8). 이들 중 2개는 새로 설계되었으며 나머지 3개는 자연 발생 단백질의 일부이다. X-선 결정학에 의해 결정된 동일한 단편 의 천연 구조로부터 펩타이드 백본의 RMSD(평균 제곱근 편차) 거리를 계산하거나(펩타이드 P2-P5) ab initio를 계산하여(펩타이드 P1) 펩타이드의 접힘을 모니터링했다. 표준 역장에서 보조 없이 접힌 경우와 장에 외부 토크 힘을 가한 경우의 각 펩타이드에 대한 시뮬레이션 결과를 도 10 및 도 11에 나타내었다. 시뮬레이션 기간 내에 서 우리는 빌린 헤드피스 도메인(villin headpiece domain) HP35의 세 번째 나선과 이전 루프를 나타내는 하나 의 펩타이드 P4에 대한 일부 실행에서만 기본형 α-나선 구조로 보조되지 않은 접힘(unassisted folding)이 완 료되는 것을 관찰했다. 다른 펩타이드는 500~1500나노초 실행 동안 본질적으로 펼쳐진 상태로 유지되었다. 펩타 이드는 또한 말단의 이동성이 제한되었지만 토크가 적용되지 않은 경우에도 접히지 못했다(도 10). 대조적으로, 방법에 설명되어 있고 그림 1에 설명된 대로 시계 방향으로 외부 비틀림 힘이 펩타이드의 C-말단에 가해졌을 때, 펩타이드 P1-P4는 모두 α-나선형 구조로 접혀 있으며 모든 실행에서 기본 구조로부터 0.2 nm RMSD 이내로, 일반적으로 시뮬레이션의 처음 100-200 ns 이내에 가져왔다. 이 펩타이드는 나머지 실험 동안 기본 또는 거의 기본 형태로 유지되었다. 펩타이드 P5는 특별한 경우였다. P1-P4와 유사하게 실험 초기에 컴팩트한 형태를 채택 했지만 모든 실행 기간 동안 부분적으로만 접힌 상태로 유지되었다(도 11). 5개 펩타이드 모두 C말단 아미노산에 시계방향으로 회전력을 가했을 때 접힘 현상이 관찰되었다(도 9). 대조적 으로, 동일한 힘 상수로 C-말단에 반시계 방향으로 가해진 토크는 P1-P3 및 P5의 접힘을 촉진하지 못하고, P4의 접힘을 억제했을 수 있다(도 11). 따라서 N 말단 아미노산의 움직임을 동시에 제한하면서 C 말단 아미노산의 방향 회전은 5개의 다양한 α-나선형 펩타이드에서 고유 구조의 형성을 촉진하여 이러한 제약이 접힘 역학에 중요한 결과를 가져올 수 있음을 확인했 다. 놀랍게도 기계적 힘을 가하면 알려진 가장 빠르게 접히는 단백질 도메인 중 하나인 잘 연구된 빌린 헤드피 스 도메인 HP35의 경로 접힘 중간체의 단편인 P4의 접힘이 가속화되었다. 우리 실험에서 달성된 P4 접힘 속도의 몇 배 증가는 전체적으로 HP35의 가정된 \"접힘의 물리적 한계\"가 단백질 접는 기계에 의해 극복될 수 있음을 시 사하는 것으로 보인다. 비록 우리가 외부 힘의 적용을 포함하는 시뮬레이션보다 약 10배 더 긴 시간 동안 제어 비보조 시뮬레이션(unassisted simulations)을 실행했음에도 불구하고, 우리 실험의 다른 4개 펩타이드도 마찬 가지로 회전력이 있을 때 α-나선 구조를 얻었지만 도움 없이 접힐 때 원래의 형태에 도달하지 못했다. 이러한 펩타이드 중 일부는 외부 힘을 가하지 않고도 원래의 형태에 도달하는 데 매우 오랜 시간이 걸릴 수 있는 반면, 펼쳐진 상태가 접힌 형태보다 더 안정적인 경우 다른 펩타이드는 도움 없이는 절대로 접힐 수 없다. 위의 본 발명 개념의 두 번째 예시 구현 및 해당 결과가 아래에 포함되어 있다. 다음으로 우리는 3개의 작은 단백질 도메인에 대한 전체 원자 분자 역학 시뮬레이션을 수행했고, N 말단 아미노 산의 움직임은 억제되는 반면 C 말단 아미노산에 회전력을 가함으로써 확장된 상태로부터의 접힘이 강화되었다. 시뮬레이션 시작 시 제한된 시간 동안 백본 회전 및 움직임 제한을 적용하도록 시뮬레이션 프로토콜을 변경했다. 아래에서 볼 수 있듯이, 펩타이드에 기계적 힘을 일시적으로 적용하면 서로 다른 구조를 가진 3개의 단백질 도메인이 원래의 또는 거의 원래의 구조로 접히는 현상을 최소한 한 자릿수(Order of magnitude)만큼 가 속화하는 데 충분하다. 우리의 in silico 실험은 폴리펩타이드의 움직임이 외부 힘과 제약에 의해 편향될 때 기 본 또는 기본 유사 접힘이 더 쉽게 달성될 수 있음을 보여준다. 일 측면에서는 시뮬레이션 시작 시 정의된 시간 동안 백본 비틀림(또는 다른 형태 변경)이 적용된 다음 시뮬레 이션의 나머지 부분이 제한 없이 계속되었다. 힘은 시뮬레이션의 처음 250ns 동안 일시적으로 적용되었으며 기 준 속도는 0.36 degree/ps이고 힘 상수는 10000kJ mol-1nm-2이다. 이전 실험에서와 마찬가지로 α 나선 방향에 대해 회전을 적용했다. 제어 시뮬레이션은 회전 증가 실행에서와 거의 동일한 특성을 갖는 상자에서 수행되었지 만 어떤 지점에서도 폴리펩타이드를 제한하거나 조작하지 않았다. 단백질 접힘 과정을 모니터링하기 위해 시뮬 레이션 전반에 걸쳐 여러 측정항목을 사용하여 100ps마다 스냅샷을 수집했다. 전체 도메인 수준에서 우리는 접 힌 도메인의 알려진 기본 3차원 구조와 도메인 내의 모든 아미노산에 의해 형성된 기본 접촉의 비율로부터 RMSD 거리를 측정했다. 잔류물 수준에서 우리는 잔류물이 2차 구조의 올바른 요소에 통합되었는지 여부와 기본 접촉 을 형성했는지 여부를 테스트했다. 시뮬레이션을 위해 우리는 시험관 내 및 분자 역학 시뮬레이션에서 접힘이 광범위하게 연구된 단백질 도메인을 선택했다. 그 도메인 중 두 개는 빠른 접힘과 안정성을 위해 설계된 단백질이다. 이들은 나선형 코일 회전 모티 프와 나선형에 붙어 있는 짧은 프롤린 꼬리로 구성된 Tpr-cage 도메인(PDB ID 2jof, 20개 아미노산) 및 2개의 β-가닥과 그 뒤의 α-나선으로 구성된 금속이 없는 형태로 안정한 Zn 핑거의 유도체인 BBA 도메인(PDB ID 1fme, 28개 아미노산)이다. 두 펩타이드 모두 신장된 형태로 시뮬레이션 상자에 배치되었으며 두 펩타이드는 방 향 회전이 있을 때 기본 구조로 빠르게 접혔다. 접는 과정의 세부 사항은 도 12 및 13에 제시되어 있다. 분자 역학(MD) 시뮬레이션은 CHARMM36m 역장(2020년 7월 출시)이 포함된 GROMACS-2020.4 패키지를 사용하여 수 행되었다. 단백질의 신장된 구조는 ICM-Pro 프로그램을 사용하여 생산되었다. 단백질을 X축을 따라 정렬하고 TIP3P 물과 칼륨 및 염화물 이온이 포함된 삼사정계 상자에서 용매화했다. 그런 다음 시스템은 가장 가파른 하 강 알고리즘을 사용하여 최소화되었으며 각 평형 주기에서 1ns 동안 NVT/NPT 앙상블로 평형을 이루었다. MD 시 뮬레이션은 v-rescale 온도 조절 장치와 0.1ps의 시간 상수를 사용하여 300K의 일정한 온도에서 수행되었다. 압 력은 2 ps의 시간 상수를 사용하여 Parrinello-Rahman 기압 조절 장치와 1 bar에서 결합되었다. 정전기력은 푸 리에 그리드 간격이 0.16nm인 입자-메시 Ewald 방법을 사용하여 계산되었다. 단거리 Van der Waals 상호 작용은 0.8에서 1.2 nm로 강제 전환되었다. 수소 함유 결합은 LINCS 알고리즘을 사용하여 제한되었으며 2fs 적분 시간 단계가 사용되었다. 스냅샷은 100ps마다 수집되었다. C 말단 아미노산의 회전은 이전 연구에서와 마찬가지로 Gromacs에서 구현된 강제 회전 방법을 사용하여 수행되 었다. 회전은 기준 회전 속도 degree/ps (1ns당 1회전) 및 힘 상수 10000 kJ*mol-1*nm-2로 유연한 축 접근법 (Vflex2)을 사용하여 C 말단 아미노산에 처음 250ns 동안 적용되었으며 이후에는 제한 없이 계속 회전을 적용했 다. 대부분의 제어 시뮬레이션은 동일한 상자에서 동일한 매개변수를 사용하여 수행되었지만 초기 구속이나 회 전은 없었다; Trp 케이지 및 BBA 도메인에 대한 일부 제어 실행에 대한 자세한 설명은 텍스트를 참조한다. 데이터베이스에 보관된 기본 구조로부터의 RMS 거리는 Gromacs에서 계산되었다. VMD 소프트웨어를 사용하여 2차 구조 획득 및 기본 접촉 비율을 평가했다. VMD는 궤적 시각화에도 사용되었다. 해당 아미노산이 컷오프 8Å 내 에서 참조 X선 구조와 동일한 접촉을 갖는 경우 아미노산에 대한 기본 접촉이 형성되는 것으로 간주되었다. 기 본 접촉의 비율(Q)은 Q=N/Nall로 계산되었다. 여기서 N은 주어진 시간의 기본 접촉 수이고 Nall은 참조 X선 구 조의 접촉 수이다. 접힘 과정에 대한 보다 자세한 뷰는 잔류물 수준의 2차 구조 및 기본 접촉 분석을 통해 제공된다. Trp-케이지 도메인과 BBA 도메인은 각각 폴리펩타이드 사슬의 N 말단과 C 말단 영역에 각각 고유 구조의 나선형 세그먼트를 포함한다. 도 12(패널 C) 및 13(패널 C)에서 볼 수 있듯이, 이러한 나선형은 백본 비틀림이 적용된 시뮬레이션 의 초기 구속 단계에서 빠르게 형성되었다. 비보조 시뮬레이션(unassisted simulation)으로 전환한 후에도 나선 은 안정적으로 유지되었다. 이러한 도메인의 다른 부분, 즉 Trp-케이지의 C-말단 부분과 BBA 도메인의 N-말단 부분은 백본 회전 단계에서 나선을 형성하지 않았으며 제한된 회전 단계에서 해제된 후 기본 형태를 빠르게 획 득하여 전체 기본 구조가 올바르게 형성되고 패킹되었다.보조 제어 시뮬레이션에서 두 폴리펩타이드는 나선이나 2차 또는 3차 구조의 다른 요소를 형성하지 않았다. 나 선형 또는 가닥과 같은 특성을 갖는 짧은 하위 구조를 볼 수 있지만 이러한 상태는 일시적으로만 점유되었거나 단백질의 기본 형태에서 다른 유형의 구조를 갖는 영역에 위치했다(도 12, C 및 도 13, C)."}
{"patent_id": "10-2024-7011744", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "각 목표에 대해 독립적인 조종 시뮬레이션의 요약은 잔류물 수준에서 나란히 비교될 수 있으며 이는 접힘 경로 에 대한 귀중한 시각적 정보를 제공한다(도 12, D 및 도 13, D). Trp-cage 도메인의 경우 시뮬레이션의 후기 단 계는 세 가지 실행 모두에서 질적으로 매우 유사하며 동일한 잔기가 동일한 순서로 기본 접촉을 형성한다는 것 이 분명하다; 주요 차이점은 조향 회전 단계의 끝과 생산적인 폴딩 이벤트의 시작 사이의 시간과 접힘 속도에 있다(도 12, D). BBA 도메인도 마찬가지이다. 여기서도, 특정 잔기가 본래의 접촉을 형성하는 순서는 매번 거의 동일했고, 그 차이는 대부분 전체 사건 순서에서 시간 이동에 있었다(도 13, D). 따라서 이 두 단백질 분자는 우리 실험에서 대체 접힘 궤적을 탐색하지 않았니다; 이러한 다중 접는 경로가 존재하더라도 우리의 조정된 시 뮬레이션 접근 방식은 접는 과정을 각 영역의 특정 경로로 유도하는 것으로 보인다. 다음으로 우리는 Trp-cage 및 BBA 도메인보다 다소 긴 자연 발생 단백질 도메인의 접힘을 연구했다. Geobacillus stearothermophilus(NTL9-39; PDB ID 2hba, 39개 아미노산, K12M 돌연변이)의 리보솜 단백질 L9의 N 말단 도메인 단편은 3개의 역평행 β-가닥으로 형성된 β-시트와 펩타이드 사슬을 따라 가닥 2와 3 사이에 위 치하며 시트의 한쪽 가장자리에 밀착되어 있는 α-나선으로 구성된다. L9 단백질의 N-말단과 C-말단 도메인을 연결하는 긴 α-나선을 포함하지 않는 39-잔기 형태의 접힘은 이전에 시험관 내 및 실리코에서 연구되었다. 우 리는 시뮬레이션 상자가 X 축 방향으로 10.5 nm 길이이므로 시작 펩타이드가 완전히 늘어나지 않았다는 점을 제 외하고 다른 두 도메인과 동일한 방식으로 이 단백질의 접힘을 시뮬레이션했다. 이 영역에 대한 접힘 시뮬레이 션 결과가 도 14에 나와 있다. 회전 보조 시뮬레이션에서 NTL 9는 1~1.5μs 이내에 안정적이고 컴팩트한 형태로 빠르게 접혔다(도 14, 패널 A 및 B). 이는 문헌에서 동일한 도메인에 대해 보고된 29μs 접힘 속도보다 약 20배 빠르다. 아미노산 22-35가 나 선을 형성하는 주요 접힘 중간체는 일시적인 회전이 계속 적용되는 동안 세 번의 실행 모두에서 관찰되었다. 구 속과 외부 힘이 제거된 후, 두 번의 실행에서 나선의 C-말단(아미노산 30-35)은 루프로 이완되고 나선의 나머지 부분은 유지되었다. β-가닥은 분자의 다른 곳에서 형성되었고 NTL9는 컴팩트한 형태를 얻었다. 도움 없이 NTL9 는 시뮬레이션 기간 동안 접히지 않았다(도 14, A 및 B, 오른쪽 절반 패널). 회전 보조 실행에서 형성된 구조는 전체 시뮬레이션 시간 동안 안정적으로 유지되었지만 NTL9의 알려진 기본 형 태와 흥미로운 국부적 차이를 나타냈다. 런 2에 초점을 맞추면(Focusing on the run 2) 접힌 부분의 대부분, 즉 접힌 부분과 직접 상호 작용하는 나선과 가닥 1과 2가 모두 거의 완벽하게 형성되었다. 세 번째 베타 β-가닥도 관찰되었으며, 이는 야생형 접힘과 유사한 3가닥의 β-시트를 완성했다. 그러나 시뮬레이션 과정에서 스냅샷을 조사한 결과 두 가지 서로 다른 형태 사이의 동적 전환이 드러났다. 한 형태는 기본 구조(도 14, E, 왼쪽)와 거 의 동일했지만 회전 보조 시뮬레이션 전체에서 총 0.5μs 동안만 존재했다. 훨씬 더 긴 기간 동안 1.2μs, 접힌 부분 내의 세 번째 가닥의 방향은 역평행에서 평행으로 바뀌었고, 이로 인해 연결 루프가 접힌 영역의 가장자리 위로 늘어나 α 나선의 C 말단이 흐트러졌다(도 14, E, 오른쪽). 위에 적용된 조작의 결과는 펩타이드 조작에 대한 이 새로운 접근 방식이 단백질의 접힘 궤적을 성공적으로 수 정했음을 나타낸다. 일 측면에서, 접힘은 당업계에 공지된 것과 비교하여 약 10배 이상 가속화되었다. 본 발명 의 접근 방식은 또한 잘못된 폴딩 발생과 연관된 특징 및/또는 비원래이지만 안정적인 형태를 향한 접힘이 발생 하는 접힘 궤적 변곡점의 검출을 위한 수단을 제공한다. 추가 고려 사항 본 발명에서 \"일 실시예\" 또는 \"실시예”에 대한 언급은 실시예와 결합하여 설명된 특정 특징, 구조 또는 특성 이 본 발명의 적어도 하나의 실시예에 포함될 수 있음을 의미한다. 본 명세서의 여러 위치에 나타나는 \"일 실시 예에서\"라는 문구가 반드시 모두 동일한 실시예를 지칭하는 것은 아니다. 일부 실시예는 \"결합된\" 및 \"연결된\"이라는 표현과 그 파생어를 사용하여 설명될 수 있다. 예를 들어, 일부 실 시예는 2개 이상의 요소가 직접적인 물리적 또는 전기적 접촉에 있음을 나타내기 위해 \"결합된\"이라는 용어를 사용하여 설명될 수 있다. 그러나 \"결합된\"이라는 용어는 둘 이상의 요소가 서로 직접 접촉하지 않지만 여전히 서로 협력하거나 상호 작용한다는 것을 의미할 수도 있다. 실시예는 이러한 맥락으로 제한되지 않는다. 본원에서 사용된 바와 같이, \"포함한다\", \"포함하는\", \"구비한다\", \"구비하는\", \"갖는다\", \"가지는\" 또는 그 임 의의 다른 변형된 용어는 비-배타적인 포함을 포함하기 위한 것이다. 예를 들어, 특징의 목록을 포함하는 프로세스, 방법, 물품, 또는 장치는 단지 그러한 요소로 반드시 제한되지 않고, 그러한 프로세스, 방법, 물품, 또는 장치에 대해서 명백하게 나열되지 않은 또는 그에 내재된 다른 요소를 포함할 수 있다. 또한, 반대로 명백하게 기재되지 않는 한, \"또는\"은 '포괄적인 또는'을 지칭하는 것으로 그리고 '배타적인 또는'이 아닌 것을 지칭한다. 예를 들어, 조건 A 또는 B는 이하 중 어느 하나에 의해서 충족된다: A는 참이고(또는 존재하고) B는 거짓이고(또는 미존재이고), A는 거짓이고(또는 미존재이고) B는 참이고(또는 존재하고), 그리고 A 및 B 모두가 참이다(또는 존재한다). 부정관사(\"a\" 또는 \"an\")의 이용은 본원에서 설명된 요소 및 구성요소를 설명하기 위해서 이용된 것이다. 이는 단지 편의를 위한 것이고 본 발명의 범위의 일반적인 의미를 제공하기 위한 것이다. 다른 의미를 가지는 것이 명백하지 않는 한, 본 설명은 하나의 또는 적어도 하나를 포함하는 것으로 읽혀져야 하고, 단수형은 또한 복수 형을 포함하고, 복수형은 또한 단수형을 포함한다.본 개시 내용을 읽으면, 당업자는 여기에 개시된 원리를 통해 대화형 메시지를 생성하기 위한 시스템 및 프로세스에 대한 추가적인 대안적인 구조적 및 기능적 설계를 이해할 수 있을 것이다. 따라서, 특정 실시예 및 애플리케이션이 예시되고 설명되었지만, 개시된 실시예는 여기에 개시 된 정확한 구성 및 컴포넌트에 제한되지 않는다는 것이 이해되어야 한다. 첨부된 청구범위에 정의된 사상 및 범 위를 벗어나지 않고 본 명세서에 개시된 방법 및 장치의 배열, 작동 및 세부사항에 대해 당업자에게 명백한 다 양한 수정, 변경 및 변형이 이루어질 수 있다."}
{"patent_id": "10-2024-7011744", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부된 도면은 여러 실시예를 예시하고, 설명과 함께 실시예에 따른 본 발명의 원리를 설명하는 역할을 한다. 당업자는 도면에 도시된 특정 배열이 단지 예시일 뿐이며 어떤 방식으로든 본 발명의 범위 또는 본 명세서의 청 구범위를 제한하는 것으로 간주되어서는 안 된다는 것을 이해할 것이다. 도 1은 본 발명의 예시적인 실시형태에 따른 폴리펩타이드 사슬의 촉진된 접힘을 위한 시스템을 예시한다. 도 2는 본 발명의 예시적인 실시형태에 따른 폴리펩타이드 사슬의 촉진된 접힘을 위한 예시적인 과정을 예시한 다. 도 4는 본 발명의 실시예를 지원하는 컴퓨팅 아키텍처의 일 실시예를 도시한다. 도 5는 본 발명의 실시예를 지원하는 시스템 아키텍처의 구성요소를 도시한다. 도 6은 본 발명의 실시예를 지원하는 컴퓨팅 장치의 구성요소를 도시한다. 도 7은 본 발명의 실시예를 지원하는 컴퓨팅 장치의 구성요소를 도시한다. 도 8은 본 발명의 한 실시양태에 따른 분자 역학 시뮬레이션에 사용되는 예시적인 펩타이드 및 이들의 상응하는 특성을 도시한다. 도 9는 본 발명의 실시예에 따른 에너지 의존성 펩타이드 폴딩 프로토콜의 도식적 표현을 예시한다. 도 10은 본 발명의 한 실시양태에 따른 다양한 분자 역학 시뮬레이션과 관련된 예시적인 펩타이드의 접힘 속도 를 도시한다. 도 11은 본 발명의 한 실시양태에 따른 폴리펩타이드 백본의 상이한 방향 회전과 관련된 예시적인 펩타이드의 예시적인 접힘 특성을 도시한다. 도 12는 본 발명의 한 실시양태에 따른 적용된 움직임 제한(들) 및/또는 방향 회전(들)과 관련된 예시적인 펩타 이드의 예시적인 접힘 특성을 예시한다.도 13은 본 발명의 한 실시양태에 따른 적용된 움직임 제한(들) 및/또는 방향 회전(들)과 관련된 예시적인 펩타 이드의 예시적인 접힘 특성을 도시한다. 도 14는 본 발명의 한 실시양태에 따른 적용된 움직임 제한(들) 및/또는 방향 회전(들)과 관련된 예시적인 펩타 이드의 예시적인 접힘 특성을 도시한다."}
