{"patent_id": "10-2022-0065062", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0165959", "출원번호": "10-2022-0065062", "발명의 명칭": "차량의 서킷 모드 수행을 위한 시스템", "출원인": "현대자동차주식회사", "발명자": "전호균"}}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량 외부 장치와의 통신을 수행하도록 차량에 구비된 통신부;상기 차량 외부 장치 중 서킷 관련 정보를 제공하는 서비스 제공 서버;차량 위치에 관한 신호를 입력받아 차량의 현재 위치를 인식하고, 상기 인식된 차량의 현재 위치, 및 상기 통신부를 통해 서비스 제공 서버로부터 수신된 서킷 관련 정보를 기초로 차량이 서킷에 도착함을 판단하며, 서킷 모드의 진입시 서킷 모드 및 서킷 주행과 관련된 안내 정보를 제공하는 서킷 안내 기능을 위한 제어를 수행하는제어기; 및상기 제어기의 제어에 의해 상기 서킷 모드 및 서킷 주행과 관련된 안내 정보를 출력하여 운전자에게 제공하도록 작동되는 입출력부를 포함하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,GPS 신호를 수신하도록 차량에 구비된 GPS 수신부를 더 포함하고,상기 제어기는, 상기 차량 위치에 관한 신호로서, 상기 GPS 수신부를 통해 수신된 GPS 신호, 또는 상기 통신부를 통해 차량 외부 장치에서 수신된 신호를 입력받아 차량의 현재 위치를 인식하도록 구비된 것을특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "에 있어서,상기 차량 시스템은 차량을 구동하는 모터, 상기 모터를 구동 및 제어하기 위한 인버터, 상기 인버터를 통해 모터와 충, 방전 가능하게 연결된 배터리를 포함하고, 상기 차량 시스템의 제한값은 배터리 사용 제한값, 모터 사용량 제한값, 최고 차속, 및 모터 토크 제한값 중 적어도 하나를 포함하는 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 제어기는 상기 차량 시스템의 제한값을 해제함에 따라 차량 시스템의 장치 또는 부품에 대한 페일 세이프티 조건을 변경하도록 구비된 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서,상기 차량 시스템은 차량을 구동하는 구동장치를 포함하는 차량 구동 시스템인 것을 특징으로 하는 차량의 서킷모드 수행을 위한 시스템.공개특허 10-2023-0165959-3-청구항 6"}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서, 상기 제어기는, 상기 차량의 현재 위치와 서킷 관련 정보를 기초로 차량이 서킷에서 이탈한 것으로 판단한 경우, 상기 서킷 모드를 해제하고, 상기 차량 시스템을 평상시의 실생활 운전 모드인 일반 모드로 전환시키도록 구비된 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 차량 외부 장치는 상기 통신부와 통신 가능하도록 연결된 스마트 기기를 포함하고, 상기 제어기는,상기 통신부를 통해 상기 스마트 기기에서 수신된 차량 위치에 관한 신호로부터 차량의 현재 위치를 인식하도록구비되고,상기 스마트 기기에서도 상기 통신부를 통해 상기 서킷 관련 정보를 선택적으로 수신하도록 구비된 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,차량 운전 정보를 검출하기 위한 운전정보 검출부를 더 포함하고,상기 제어기는,상기 서비스 제공 서버로부터 수신된 서킷 관련 정보와 상기 운전정보 검출부를 통해 취득되는 실시간 차량 운전 정보를 이용하여 상기 서킷 안내 기능을 위한 제어를 수행하도록 구비된 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 입출력부는, 운전자가 서킷 모드 또는 서킷 주행과 관련하여 필요한 정보를 입력하거나 선택하기 위해 조작하는 입력장치;및공개특허 10-2023-0165959-4-상기 서킷 모드 및 서킷 주행과 관련된 안내 정보를 표시하여 출력하는 표시장치를 포함하는 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 입출력부는 상기 서킷 모드 및 서킷 주행과 관련된 안내 정보를 사운드로 출력하는 사운드 출력장치를 더포함하는 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서,상기 표시장치는 차량의 윈드쉴드 글라스(windshield glass)에 증강 현실 이미지로 정보를 표시하는 증강현실(Augmented Reality, AR) 헤드업 디스플레이를 포함하는 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 10에 있어서,상기 입력장치 및 표시장치를 통해 사용자 설정 모드로 이동하여 서킷 모드와 관련된 설정값들을 제어기에 입력및 설정할 수 있도록 구성되고, 상기 제어기는, 상기 사용자 설정 모드를 통해 서킷 모드의 온(on)이 설정된 상태에서, 차량이 서킷에 도착 및 진입한 경우, 서킷 모드의 진입이 가능하도록 된 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 10에 있어서, 상기 제어기는, 상기 서킷 모드 및 서킷 주행과 관련된 안내 정보와 함께, 차량에서 수집된 실시간 차량 운전 정보로서 차량 상태 정보나 운전자 운전 입력 정보, 또는 차량 성능 관련 정보를 더 표시하도록 상기 표시장치의 작동을 제어하는 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 10에 있어서, 상기 서킷 모드의 진입시, 상기 제어기에 의해 상기 표시장치에 표시되는 정보가 서킷 모드용으로 미리 설정된레이아웃으로 변경되어 표시되는 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 1에 있어서,상기 서킷 안내 기능은, 공개특허 10-2023-0165959-5-서킷 주행 전 서킷에 대한 설명 및 안내를 위한 정보를 출력하는 서킷 설명 기능; 및서킷 주행 동안 서킷 구간 정보를 포함한 서킷 관련 정보와 차량의 실시간 위치 정보를 기초로 차량의 서킷 구간별 진입 전, 후 상황을 출력하여 안내하고 서킷 구간별 기록을 기반으로 기록 개선을 위한 정보를 출력하여안내하는 인스트럭터 기능을 포함하는 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서, 상기 서킷 안내 기능은,서킷 주행 동안 차량의 실시간 위치 정보, 차량에서 수집되는 실시간 차량 상태 정보, 및 상기 서비스 제공 서버로부터 수신된 서킷 관련 정보, 가상의 경주 차량인 고스트카의 정보를 이용하여 차량과 고스트카의 상태를비교 표출하는 고스트카 기능을 더 포함하는 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 16에 있어서, 상기 서킷 안내 기능은서킷 주행 완료 후 서킷 전체 및 서킷 구간별 주행 결과 및 기록 분석, 서킷 전체 및 서킷 구간별 차량 이동 루트와 차량 상태 정보를 출력하여 안내하는 분석 기능을 더 포함하는 것을 특징으로 하는 차량의 서킷 모드 수행을 위한 시스템."}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 차량의 서킷 모드 수행을 위한 시스템에 관한 것으로서, 일반 운전자가 본인의 차량을 이용하여 더욱 편리하게 서킷 주행 및 체험을 할 수 있도록 해주는 차량의 서킷 모드 수행을 위한 시스템을 제공하는데 주된 목 적이 있는 것이다. 상기한 목적을 달성하기 위해, 차량 외부 장치와의 통신을 수행하도록 차량에 구비된 통신부; (뒷면에 계속)"}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량의 서킷 모드 수행을 위한 시스템에 관한 것으로서, 더욱 상세하게는 일반 운전자가 본인의 차량 을 이용하여 더욱 편리하게 서킷 주행 및 체험을 할 수 있도록 하기 위한 시스템에 관한 것이다."}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전통적으로 자동차를 이용한 타인과의 속도 경쟁은 자동차 경주를 통해서 이루어져왔다. 통상 자동차 경주는 자 동차 경기장에서 시합을 통해 이루어지고, 일반인들은 자동차 경기장 내에서 자동차 경주(racing)를 관전함으로 써 속도 경쟁 욕구 및 레이싱 욕구를 간접적으로 충족시켜왔다. 보통의 운전자가 자동차 경기장에서 자동차 경주를 할 수 있는 기회는 거의 없었으며, 주로 직업으로 선택한 레 이서들만이 자동차 경주에 참여할 수 있었다. 일반 운전자가 자동차 경주를 일반 도로에서 실시하기도 하지만, 일반 도로에서의 경주는 과속 등 위법의 문제가 있을 뿐 아니라 사고 위험이 매우 크기 때문에 법적으로 금지하 고 있다. 하지만, 최근 모터 스포츠의 저변이 확대되고 차량 성능이 점차 고성능화 됨에 따라 운전자의 속도 경쟁 욕구 및 레이싱 욕구가 더욱 증가하고 있는 것이 현실이다. 이에 차량 제조사별로 경주용 도로인 서킷(circuit) 내에서의 복합 문화 콘텐츠 등과 같은 다양한 행사를 개최 하여 일반인에게도 서킷 내 레이싱(자동차 경주)을 경험할 기회를 제공하고 있다. 더욱이 최근에는 전국 곳곳에 일반 운전자들이 레이싱을 체험할 수 있는 다수의 서킷들이 건설 및 구축되고 있 으며, 이러한 전국의 서킷들은 일반 운전자들도 간단한 절차를 거쳐 이용할 수 있다. 서킷을 이용하는 운전자는 해당 서킷에서의 자신의 랩 타임(lab time)을 확인하고, 자신의 랩 타임을 일행이나 해당 서킷을 이용한 다른 운전자들의 랩 타임과 비교할 수 있고, 이를 통해 고속 주행에 따른 쾌감과 더불어 자신의 운전 실력을 타인과 비교하는 재미를 즐길 수 있다. 이와 같이 서킷 주행 및 체험에 대한 관심과 속도 경쟁 욕구가 커짐에 따라 차량 및 서킷에 대한 이해도를 높이 고 자차를 이용하여 일상의 드라이빙 조건과 다른 환경에서의 펀 드라이빙(fun driving)을 즐기려는 운전자들이 늘고 있다."}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상기와 같은 점을 고려하여 창출한 것으로서, 일반 운전자가 본인의 차량을 이용하여 더욱 편리하게 서킷 주행 및 체험을 할 수 있도록 함으로써, 운전자의 속도 경쟁 욕구 및 펀 드라이빙 욕구를 충족시 킴과 더불어, 차량의 상품성을 향상시킬 수 있는 차량의 서킷 모드 수행을 위한 시스템을 제공하는데 그 목적이 있다. 본 발명의 목적은 이상에서 언급된 목적으로 제한되지 않으며, 언급되지 않은 다른 목적들은 아래의 기재로부터"}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "본 발명이 속하는 기술분야에서 통상의 지식을 가진 자(이하 '통상의 기술자')에게 명확하게 이해될 수 있을 것 이다."}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위하여, 본 발명의 실시예에 따르면, 차량 외부 장치와의 통신을 수행하도록 차량에 구 비된 통신부; 상기 차량 외부 장치 중 서킷 관련 정보를 제공하는 서비스 제공 서버; 차량 위치에 관한 신호를 입력받아 차량의 현재 위치를 인식하고, 상기 인식된 차량의 현재 위치, 및 상기 통신부를 통해 서비스 제공 서 버로부터 수신된 서킷 관련 정보를 기초로 차량이 서킷에 도착함을 판단하며, 서킷 모드의 진입시 서킷 모드 및 서킷 주행과 관련된 안내 정보를 제공하는 서킷 안내 기능을 위한 제어를 수행하는 제어기; 및 상기 제어기의 제어에 의해 상기 서킷 모드 및 서킷 주행과 관련된 안내 정보를 출력하여 운전자에게 제공하도록 작동되는 입 출력부를 포함하는 차량의 서킷 모드 수행을 위한 시스템을 제공한다."}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이로써 본 발명에 따른 차량의 서킷 모드 수행을 위한 시스템에 의하면, 서킷 주행시 운전자에게 필요하고 도움 이 되는 정보의 전달 및 서킷 안내 기능을 제공함으로써, 운전자의 차량 및 서킷에 대한 이해도를 높일 수 있고, 운전자의 속도 경쟁 욕구 및 펀 드라이빙 욕구를 충족시킬 수 있으며, 차량의 상품성을 더욱 향상시키는 효과가 있다."}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면을 참조하여 본 발명의 실시예에 대해 상세히 설명한다. 발명의 실시예에서 제시되는 특 정한 구조 내지 기능적 설명들은 단지 본 발명의 개념에 따른 실시예를 설명하기 위한 목적으로 예시된 것으로, 본 발명의 개념에 따른 실시예들은 다양한 형태로 실시될 수 있다. 또한, 본 명세서에 설명된 실시예들에 의해 발명이 한정되는 것으로 해석되어서는 아니 되며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경물, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 한편, 본 발명에서 제1 및/또는 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소들과 구별하 는 목적으로만, 예컨대 본 발명의 개념에 따른 권리 범위로부터 벗어나지 않는 범위 내에서, 제1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떠한 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소 에 직접적으로 연결되어 있거나 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해 되어야 할 것이다. 반면에, 어떠한 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 또는 \"직접 접촉되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성요 소들 간의 관계를 설명하기 위한 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 인접하는\"과 \"~에 직 접 인접하는\" 등의 표현도 마찬가지로 해석되어야 한다. 명세서 전체에 걸쳐서 동일한 참조번호들은 동일한 구성요소들을 나타낸다. 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며, 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서 단수형은 문구에서 특별 히 언급되지 않는 한 복수형도 포함된다. 명세서에서 사용되는 \"포함한다(comprises)\" 및/또는 \"포함하는 (comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자가 하나 이상의 다른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 도 1은 본 발명에 따른 차량의 서킷 모드 수행을 위한 시스템의 구성을 나타내는 블록도이다. 도시된 바와 같이, 본 발명에 따른 차량의 서킷 모드 수행을 위한 시스템은, 차량에 탑재된 차량 탑재 장치와, 차량 외부에 서 차량과 통신 가능하도록 구비된 차량 외부 장치를 포함한다. 여기서, 차량 탑재 장치는 제어기와 GPS 수신부, 통신부, 운전정보 검출부, 입출력부 및 차량 시스템을 포함할 수 있고, 차량 외부 장치는 서비스 제공 서버 및 애드-온 디바이스(ad-on device)를 포함할 수 있다. 상기한 구성 중 제어기는, 본 발명에 따른 서킷 모드 수행을 위한 제어 및 차량 제어를 수행하는 것으로, 외부에서 수신되는 차량 위치에 관한 신호(예, GPS 신호)를 기초로 차량의 현재 위치를 실시간으로 판단 및 결 정하는 차량 위치 인식부, 차량에서 수집된 정보를 기초로 차량 운전 상태 및 주행 상태를 판단하는 주행 상태 판단부, 서킷 모드와 관련된 다양한 정보를 수집하여 운전자에게 안내하기 위한 제어를 수행하는 가이 드 제어부, 및 차량의 서킷 내 진입시 차량 시스템에 대한 제어를 수행하는 시스템 제어부를 포함 하여 구성된다. 본 발명에서 상기와 같이 제어기를 구성하는 구성요소들, 즉 차량 위치 인식부와 주행 상태 판단부 , 가이드 제어부, 시스템 제어부는 서로 정보를 주고 받으면서 차량의 서킷 모드를 위한 협조 제어 를 수행할 수 있다. 그리고, GPS 수신부는 차량 외부로부터 차량의 현재 위치를 나타내는 GPS 신호를 수신하도록 구비된다. 또 한, GPS 수신부는 차량 위치에 관한 신호로서 수신되는 GPS 신호를 제어기의 차량 위치 인식부에 입력할 수 있도록 구비된다. 또한, 차량에서 통신부가 차량 외부 장치와의 통신을 통해 차량 위치에 관한 신호를 수신할 수도 있으며, 이때 통신부에 의해 수신된 신호는 제어기의 차량 위치 인식부에 입력된다. 여기서, 차량 외부 장치는 차량의 통신부와 통신 가능하도록 연결된 애드-온 디바이스 중 하나, 구체적 으로 GPS 센서가 내장된 스마트폰이나 태블릿(tablet) 등의 스마트 기기일 수 있고, 이때 통신부는 스마트 기기와의 통신을 수행하도록 구비되는 일종의 통신 인터페이스부일 수 있다. 이로써 제어기의 차량 위치 인식부는 GPS 수신부를 통해 수신되어 입력되는 GPS 신호 또는 통신부 를 통해 수신 및 입력되는 차량 위치에 관한 신호로부터 차량의 현재 위치를 판단 및 결정할 수 있게 된다. 다음으로, 운전정보 검출부는 차량의 실시간 운전 상태 및 주행 상태를 나타내는 정보, 즉 차량 운전 정보 를 검출하는 구성요소로서, 운전정보 검출부에 의해 검출되는 실시간 차량 운전 정보는 차량 상태 정보와 운전자 운전 입력 정보를 포함하는 것일 수 있다. 본 발명의 실시예에서, 운전정보 검출부는 운전자의 가속페달 조작에 따른 가속페달 입력 정보를 검출하는 가속페달 검출부, 및 운전자의 브레이크 페달 조작에 따른 브레이크 페달 입력 정보를 검출하는 가속페달 검출 부를 포함할 수 있다. 이에 더하여 운전정보 검출부는 운전자의 스티어링 휠(steering wheel) 조작에 따른 조향각을 검출하는 조 향각 검출부를 더 포함할 수 있다. 또한, 운전정보 검출부는 차량의 가속도를 검출하는 가속도 검출부를 더 포함할 수 있다. 여기서, 가속페달 검출부는 가속페달에 설치되어 운전자의 가속페달 조작 상태에 따른 전기적인 신호를 출력하 는 통상의 가속페달 센서(Accelerator Position Sensor, APS)일 수 있다. 브레이크 페달 검출부는 브레이크 페 달에 설치되어 운전자의 브레이크 페달 조작 상태에 따른 전기적인 신호를 출력하는 통상의 브레이크 페달 센서 (Brake Pedal Sensor, BPS)일 수 있다. 또한, 가속도 검출부는 통상의 G 센서일 수 있고, 조향각 검출부는 운전자의 스티어링 휠 조작에 따른 전기적인 신호를 출력하는 통상의 조향각 센서(Steering Angle Sensor, SAS)일 수 있다. 그리고, 운전정보 검출부는 휠속을 검출하는 휠속 검출부를 더 포함할 수 있고, 휠속 검출부는 통상의 휠속 센서일 수 있다. 또한, 제어기에서는 휠속 센서의 신호로부터 휠속과 더불어 차속 정보를 얻을 수 있다. 휠"}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속 센서의 신호로부터 차속 정보가 얻어질 수 있음은 당해 기술분야에서 잘 알려진 기술 사항이므로 그에 대한 상세한 설명은 생략하기로 한다. 그리고, 차속 정보를 취득하기 위해 휠속 검출부(휠속 센서)의 신호를 이용하는 대신, 운전정보 검출부가 차속을 검출하는 별도의 차속 검출부를 더 포함할 수도 있다. 또는 제어기에서 GPS 신호로부터 취득되는 차 량 위치 정보를 기초로 차속 정보를 실시간으로 취득할 수 있다. 이로써 차량 운전 정보는, 운전자의 가속페달 조작에 따른 운전 입력값으로서 가속페달 검출부에 의해 검출되는 가속페달 입력값(APS 값), 운전자의 브레이크 페달 조작에 따른 운전 입력값으로서 브레이크 페달 검출부에 의 해 검출되는 브레이크 페달 입력값(BPS 값)을 포함할 수 있다. 이에 더하여 차량 운전 정보는 가속도 검출부에 의해 검출되는 차량 가속도, 및 조향각 검출부에 의해 검출되는 조향각을 더 포함할 수 있고, 이에 더하여 차량 운전 정보는 휠속 검출부에 의해 검출되는 휠속을 더 포함할 수 있다. 또한, 차량 운전 정보는 휠속 검출부의 신호 또는 GPS 신호로부터 얻어지거나 차속 검출부에 의해 검출되 는 차속을 더 포함할 수 있다. 상기와 같이 차량의 현재 운전 상태 및 주행 상태를 나타내는 실시간 차량 운전 정보 중 페달 입력(가속 입력 및 제동 입력) 정보인 가속페달 입력값과 브레이크 페달 입력값, 그리고 조향 입력 정보인 조향각은 운전자 운 전 입력 정보가 되고, 차량 가속도와 휠속, 차속 등은 차량 상태 정보가 된다. 그 밖에 운전정보 검출부는 모터, 배터리와 같은 부품이나 엔진 오일, 냉각수의 온도를 검출하는 센서, 구 동장치(엔진, 모터)의 회전속도를 검출하는 센서, 브레이크액 압력이나 타이어 압력 등을 검출하는 센서 등을 선택적으로 더 포함할 수 있고, 이때 실시간 차량 운전 정보 중 차량 상태 정보는 이들 센서에 의해 검출되는 정보를 더 포함하는 것이 된다. 차량에서 운전정보 검출부를 통해 취득되는 실시간 차량 운전 정보는 제어기의 주행 상태 판단부로 입력되고, 주행 상태 판단부는 운전정보 검출부의 신호로부터 차량 운전 상태 및 주행 상태를 판단 및 인식할 수 있게 된다. 이와 같이 차량 운전 상태 및 주행 상태를 판단하게 되면, 주행 상태 판단부는 차량 운전 상태 및 주행 상태를 가이드 제어부로 전달할 수 있다. 상기 통신부는 차량 외부 장치와 유선 또는 무선 통신을 수행하도록 구비되는 것으로, 통신부를 통해 차량 외부 장치로부터 수신된 정보는 제어기의 차량 위치 인식부, 주행 상태 판단부나 가이드 제어 부, 시스템 제어부로 전달될 수 있다. 상기 통신부는 차량에 탑재되어 이동통신망 등을 통해 차량 외부 장치와 무선 통신을 수행할 수 있는 AVN(Audio, Video & Navigation) 시스템의 통신장치를 포함할 수 있다. 그 밖에 통신부는 차량에 구비되어 제어기와 차량 외부 장치 사이의 무선 통신을 수행할 수 있는 것이라면 제한 없이 채택 가능하다. 여기서, 차량 외부 장치는 서비스 제공 서버 및 애드-온 디바이스일 수 있고, 차량의 통신부와 통 신하는 애드-온 디바이스는 스마트폰이나 태블릿, 웨어러블 기기(wearable device) 등의 스마트 기기일 수있다. 또한, 통신부는 애드-온 디바이스를 유선 또는 무선으로 연결할 경우 제어기와 애드-온 디바이스 사이의 통신을 가능하게 하는 커넥터나 송수신기와 같은 통신 인터페이스부를 더 포함할 수 있다. 예컨대, 통신부는 애드-온 디바이스가 연결된 상태로 제어기와 애드-온 디바이스 사이의 통신 을 가능하게 하는 차량의 커넥터를 더 포함할 수 있고, 상기 커넥터는 진단 커넥터, 구체적으로 통상의 OBD(On- Board Diagnotics) 커넥터일 수 있다. 상기 입출력부는 제어기에 연결된 것으로, 운전자가 서킷 모드 또는 서킷 주행과 관련하여 필요한 정보 를 입력하거나 선택하기 위해 조작하는 입력장치, 및 정보를 출력하는 출력장치를 포함하고, 입출력부의 입 력장치는 차량에 구비되는 버튼이나 스위치일 수 있다. 또는 입출력부의 입력장치는 터치 스크린 등일 수 있다. 이로써 입출력부의 입력장치를 운전자가 조작하는 경우 조작에 따른 입력 정보 또는 선택 정보가 제 어기에 입력될 수 있게 된다. 또한, 입출력부의 출력장치는 차량에서 각종 정보를 표시하도록 구비되는 표시장치를 포함할 수 있고, 이에 더하여 차량 스피커를 통해 청각적인 정보를 사운드로 출력하도록 구비되는 사운드 출력장치를 더 포함할 수 있 다. 상기 입출력부의 입력장치와 출력장치는 AVN 시스템의 입력장치와 표시장치일 수 있고, 그 밖에 입출력부 의 출력장치 중 표시장치로서 클러스터나 헤드업 디스플레이(Head-up Display, HUD)가 이용될 수 있다. 상기 헤드업 디스플레이는 차량의 윈드쉴드 글라스(windshield glass)에 증강 현실 이미지로 정보를 표시하는 증강현실(Augmented Reality, AR) 헤드업 디스플레이일 수 있다. 그 밖에 통신 가능하게 연결된 스마트폰과 같은 애드-온 디바이스가 입출력부로 이용될 수도 있으며, 운전자가 응용 프로그램(application)이 설치된 스마트폰을 이용하여 차량 입출력부의 이용시와 동일하게 원하는 정보를 입력하거나 제공받을 수 있다. 상기 입출력부는 제어기의 구성요소 중에서도 가이드 제어부에 연결될 수 있는데, 가이드 제어부 가 입출력부의 입력장치를 통해 필요한 정보를 입력받도록 연결될 수 있고, 입출력부를 통해 가이 드 제어부에 입력된 정보는 주행 상태 판단부나 시스템 제어부로 전달될 수 있다. 또한, 가이드 제 어부는 서킷 모드와 관련된 정보 등 정해진 정보를 출력하여 안내하도록 입출력부 중 출력장치의 작동 을 제어할 수 있다. 그리고, 본 발명의 실시예에서 운전자는 입출력부의 입력장치 및 출력장치(표시장치, 예로서 클러스터)를 통해 사용자 설정 모드(User Setting Mode, USM)로 이동하여 서킷 모드와 관련된 설정값들을 제어기에 입력 및 설정할 수 있다. 예를 들어, 운전자가 사용자 설정 모드(USM)에서 서킷 모드의 온(on) 또는 오프(off) 설정을 할 수 있다. 만약, 서킷 모드의 온(on)이 설정된 상태라면 이후 차량이 서킷에 진입하였을 때 제어기에 의해 서킷 모드를 위한 제어가 수행될 수 있다. 반면, 서킷 모드의 오프(off)가 설정된 상태라면 서킷 모드의 제어가 수행되지 않는다."}
{"patent_id": "10-2022-0065062", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 발명의 실시예에서 가이드 제어부는 차량 위치 인식부로부터 입력되는 차량의 현재 위치 정보를 기 초로 AVN 시스템과 통신하여 차량이 서킷에 도착하였는지를 판단하고, 차량이 서킷에 도착하였다면 입출력부 의 출력장치(표시장치 또는 사운드 출력장치)를 통해 차량이 서킷에 도착하였음을 출력하여 운전자에게 알 릴 수 있다. 이때 AVN 시스템은 차량의 통신부 중 하나인 자체 통신장치를 통해 서비스 제공 서버 또는 애드-온 디 바이스로부터 서킷에 대한 각종 정보를 수신한 뒤 제어기의 가이드 제어부에 전달하는데, 예를 들 어 서킷 위치와 같은 서킷 관련 정보를 서비스 제공 서버 또는 애드-온 디바이스로부터 선택적으로 수 신한 뒤 제어기의 가이드 제어부에 전달할 수 있다. 이에 가이드 제어부는 차량 위치 인식부로부터 입력된 차량의 현재 위치 정보와, AVN 시스템에서 입력 된 서킷 관련 정보(서킷 위치 정보)를 기초로 차량이 현재 서킷 내에 도착하였는지를 판단할 수 있다. 그리고, 가이드 제어부는 통신부, 예컨대 AVN 시스템의 통신장치를 통해 서비스 제공 서버 또는 애 드-온 디바이스로부터 수신되는 정보를 입력받은 후 입력된 정보를 제어기 내 타 구성요소로 전달할 수있다. 예를 들어, 가이드 제어부는 AVN 시스템의 통신장치를 통해 서비스 제공 서버 또는 애드-온 디바이스 로부터 서킷 관련 정보나 운전자 정보를 입력받을 수 있고, 수신된 정보를 주행 상태 판단부나 시스템 제어부로 전달할 수 있다. 또한, 가이드 제어부는 차량이 서킷에 도착하여 서킷 모드로 진입한 경우 시 스템 제어부에 서킷 모드 진입을 알리는 신호를 전달할 수 있다. 이때 시스템 제어부는 가이드 제어부에서 입력된 서킷 모드 진입 신호를 기초로 차량의 서킷 모드 주행 을 위해 필요한 제어를 수행할 수 있다. 구체적으로 시스템 제어부는 가이드 제어부에서 입력된 서킷 모드 진입 신호로부터 차량이 서킷에 도착하여 서킷 모드로 진입함을 인식하게 되면, 차량 구동을 위한 차량 시 스템의 제한값을 해제할 수 있고, 차량 시스템의 제한값을 해제함에 따라 차량 시스템의 장치 또는 부품에 대한 페일 세이프티(fail safety) 조건을 변경할 수 있다. 여기서, 차량 구동을 위한 차량 시스템은 차량을 구동하는 구동장치(엔진, 모터, 또는 엔진 및 모터)를 포 함하는 차량 구동 시스템일 수 있고, 전기자동차인 경우 차량 시스템은 모터, 이 모터를 구동 및 제어하기 위한 인버터, 상기 인버터를 통해 모터에 충, 방전 가능하게 연결된 배터리를 포함하는 PE(Power Electronics) 시스템일 수 있다. 상기 차량 시스템의 제한값은 구동 시스템 관련 제한값 또는 PE 시스템 관련 제한값을 포함할 수 있다. 본 발명에서 PE 시스템 관련 제한값의 예로는 배터리 사용 범위를 규정하는 배터리 사용 제한값 또는 모터 사용 량 제한값 등을 들 수 있다. 그 밖에 구동 시스템 관련 제한값 또는 PE 시스템 관련 제한값은 최고 차속 또는 구동장치(엔진, 또는 모터, 또는 엔진 및 모터)의 토크 제한값 등을 포함할 수 있다. 즉, PE 시스템 관련 제한 값은 배터리 사용 제한값, 모터 사용량 제한값, 최고 차속, 모터 토크 제한값 중 적어도 하나를 포함하는 것이 될 수 있다. 또한, 가이드 제어부는 차량 위치 인식부에서 입력된 차량의 현재 위치 정보와, 주행 상태 판단부 에서 입력된 차량 운전 상태 및 주행 상태 정보를 기초로 차량의 현재 주행 상태에 적절한 서킷 관련 정보를 입 출력부의 출력장치를 통해 출력하여 운전자에게 안내하게 된다. 이상으로 도 1을 참조로 본 발명에 따른 서킷 모드 수행을 위한 시스템의 구성에 대해 상세히 설명하였으며, 이 하에서는 본 발명에 따른 서킷 모드 수행을 위한 방법에 대해 상세히 설명하기로 한다. 도 2는 본 발명에서 평상시의 일반 모드에서 서킷 진입시의 서킷 모드로 전환된 뒤 다시 일반 모드로 전환되는 과정을 설명하기 위한 도면이다. 또한, 도 3과 도 4는 본 발명의 실시예에 따른 서킷 모드 수행을 위한 과정을 나타내는 순서도로서, 도 3은 차량에서 서킷 모드를 인식하는 과정을 나타내고 있고, 도 4는 서킷 안내 기능이 수행되는 과정을 나타내고 있다. 본 발명에서 일반 모드는 평상시의 실생활 운전 모드를 의미하고, 이러한 일반 모드는 연비 최적화 제어가 수행 되는 통상의 연비 최적화 운전 모드일 수 있다. 반면, 서킷 모드는 차량이 서킷에 진입하였을 때의 운전 모드이 고, 이는 성능 최적화 제어가 수행되는 성능 최적화 운전 모드라 할 수 있다. 먼저, 도 3에 나타낸 바와 같이, 제어기의 차량 위치 인식부에서 통신부를 통해 수신 및 입력되는 신호를 기초로 차량의 현재 위치를 판단하고 인식한다(S10). 또한, 차량 위치 인식부는 모니터링되는 차량 의 현재 위치 정보를 제어기의 가이드 제어부에 실시간으로 전달한다. 그리고, 차량이 일반 도로를 주행한 뒤 지정된 경주용 도로인 서킷에 도착하게 되면, 차량의 제어기에서 서 킷 모드를 인식하게 된다. 즉, 제어기의 가이드 제어부에서 통신부(예, AVN 시스템의 통신장치)를 통해 차량 외부 장치인 서비스 제공 서버나 애드-온 디바이스로부터 수신 및 입력된 서킷 관련 정보를 기초로 현재 차량이 서킷 모드 기능을 제공하는 서킷 중 하나에 도착하였는지를 판단하게 된다(S11). 이때 가이드 제어부는, 전술한 바와 같이, 차량 위치 인식부에서 입력된 차량의 현재 위치 정보와, 서 비스 제공 서버나 애드-온 디바이스로부터 수신 및 입력된 서킷 관련 정보 중 서킷 위치 정보를 기초로 현재 도착해 있는 서킷이 서킷 모드 기능을 제공하는 서킷인지를 판단할 수 있다. 그리고, 가이드 제어부는 운전자가 사용자 설정 모드(USM)에서 서킷 모드를 온(on)으로 설정한 상태인지를 확인한다(S12). 만약, 차량이 서킷에 도착한 상태이고, 운전자가 서킷 모드의 온(on)을 설정한 상태라면, 제어 기의 가이드 제어부는, 운전자가 서킷 모드의 진입을 선택할 수 있도록, 서킷 모드의 진입을 선택 또는 입력할 수 있는 안내 메시지가 입출력부의 표시장치에 표시되도록 한다(S14). 이때 안내 메시지는 팝업(pop-up) 메시지의 형태로 표출될 수 있다. 반면, 서킷 모드의 온(on) 상태가 아니라면, 가이드 제어부는, 사용자 설정 모드(USM)에서 서킷 모드의 온 (on)을 설정할 것을 권장 및 안내하는 안내 메시지가 입출력부의 표시장치에 표시되도록 한다(S13). 이때 안내 메시지는 팝업 메시지의 형태로 표출될 수 있다. 이후 가이드 제어부는 운전자가 서킷 모드의 진입을 선택하였는지를 확인하는데(S15), 운전자에 의해 서킷 모드의 진입이 선택되었다면, 시스템 제어부를 통해 차량 시스템을 서킷 모드로 진입시킨다(S16). 이어 시스템 제어부는 서킷 모드의 진입을 확인한 후, PE 시스템의 사용 또는 구동 시스템의 작동을 극대화 하고 펀 드라이빙(fun driving)을 극대화할 수 있도록 차량 시스템의 제한을 해제한다(S17). 또한, 시스템 제어부는 상기와 같이 차량 시스템의 제한을 해제함에 따라 차량 시스템의 장치 또는 부품에 대한 페일 세이프티(fail safety) 조건 등을 변경한다. 아울러, 차량이 서킷 내에 진입한 상태에서 가이드 제어부는 입출력부의 출력장치를 통해 서킷 운전 중 필요한 실시간 차량 운전 정보가 출력되도록 할 수 있다(S18). 구체적으로 가이드 제어부는, 차량에서 수집된 차량 상태 정보나 운전자 운전 입력 정보, 또는 차량 성능 관련 정보 등이 클러스터나 AVN 시스템의 표시장치, 헤드업 디스플레이(HUD)를 통해 표시되도록 할 수 있다. 예로서, 엔진 오일 온도(내연기관 자동차), 배터리 온도(하이브리드 자동차, 순수 전기자동차), 모터 온도(하이 브리드 자동차, 순수 전기자동차), 부품별 냉각수 온도, 횡방향(lateral) 및 종방향(longitudinal) 포스(G- force) 중 적어도 하나가 표시되도록 할 수 있다. 그 밖에, 차속, 구동장치의 회전속도(엔진 RPM, 모터 RPM), 구동장치의 토크(지령 값일 수 있음), 터보 작동 상 태, 파워, 랩 타임(lap time) 정보, 기어 위치(gear position), 스로틀(throttle) 상태, 가속페달 입력값(APS 값), 브레이크 페달 입력값(BPS 값), 조향각, 브레이크 압력, 타이어 압력 등과 같이 공지된 서킷 주행시의 중 요 인자들 중 적어도 하나가 표시되도록 할 수 있다. 또한, 상기와 같은 정보를 표시함에 있어, 가이드 제어부는, 헤드업 디스플레이 등 입출력부의 표시장 치에 표시 정보를, 운전자가 운전에 집중할 수 있는 최적화된 서킷 모드의 설정된 레이아웃으로 변경하여 표출 할 수 있다(S19). 그리고, 제어기의 가이드 제어부는 제어기 내 타 구성요소들과 협조 제어하여 서킷 안내 기능을 수 행하는데, 서킷 안내 기능은, 서킷 주행 전과 주행 중, 그리고 주행 후에 차량의 서킷 주행 및 서킷 모드와 관 련된 정해진 안내 정보를 입출력부의 출력장치(표시장치와 사운드 출력장치 중 하나 또는 둘 모두)를 통해 출력하여 운전자에게 제공 및 안내하는 기능이라 할 수 있다. 본 발명에서 서킷 안내 기능은 서킷 설명 기능, 인스트럭터 기능, 고스트카(ghost car) 기능 및 분석 기능을 포 함할 수 있다. 먼저, 제어기의 가이드 제어부는 운전자가 서킷 설명 기능을 선택할 수 있는 안내 메시지를 입출력부 의 표시장치를 통해 표출하고, 운전자가 서킷 설명 기능을 선택하였는지를 확인한 뒤(S20), 서킷 설명 기능 을 선택하였다면 서킷 설명 기능을 수행한다(S21). 서킷 설명 기능에서는 서킷 주행 전에 서킷 관련 정보를 이용하여 해당 서킷에 대해 설명하고 안내하기 위한 정 보를 입출력부의 출력장치를 통해 출력할 수 있다. 만약, 운전자가 서킷 설명 기능을 선택하지 않았다면 서 킷 설명 기능을 생락하고, 인스트럭터 기능 또는 고스트카 기능이 수행될 수 있다. 이와 같이 서킷 설명 기능이 선택되지 않았거나, 서킷 설명 과정이 모두 종료되고 나면, 제어기의 가이드 제어부는 운전자가 인스트럭터 기능과 고스트카 기능 중 하나를 선택할 수 있는 안내 메시지를 입출력부 의 표시장치를 통해 표출한다. 이어 가이드 제어부는 운전자가 인스트럭터 기능을 선택하였는지, 아니면 고스트카 기능을 선택하였는지를 확인한 후(S22), 운전자가 인스트럭터 기능을 선택한 것으로 판단한 경우 인스트럭터 기능이 수행될 수 있도록 한다(S23). 상기 인스트럭터 기능에서는 입출력부의 출력장치 중 표시장치와 더불어 차량 스피커를 포함하 는 사운드 출력장치가 추가로 이용될 수 있다. 상기 인스트럭터 기능에서는 서킷 주행 동안 서킷 구간 정보를 포함한 서킷 관련 정보와 차량의 실시간 위치 정 보를 기초로 서킷 구간별 차량 진입 전, 후 상황을 알리는 음성 안내 기능이 수행될 수 있다. 또한, 서킷 주행 동안 서킷 구간별 기록을 기반으로 기록 개선을 위한 음성 정보를 제공하는 음성 안내 기능이 수행할 수 있다. 본 발명에서 각 서킷은 복수 개의 서킷 구간으로 미리 구획되는데, 이때 서킷 관련 정보는 각 서킷 구간의 시작 위치와 종료 위치 정보를 포함할 수 있다. 이에 본 발명에서는 해당 서킷을 구성하고 있는 서킷 구간별로 음성 정보를 출력 및 제공하는 음성 안내 기능이 수행될 수 있다. 이러한 인스트럭터 기능의 수행 동안 가이드 제어부는 서킷 주행을 완료했는지를 판단하고 (S24), 서킷 주행이 완료되었다면 가이드 제어부에 의해 분석 기능이 수행될 수 있다(S27). 그리고, 가이드 제어부는 운전자가 인스트럭터 기능이 아닌 고스트카 기능을 선택한 것으로 판단한 경우 고 스트카 기능이 수행될 수 있도록 한다(S25). 상기 고스트카 기능에서는 서킷 주행 동안 실제 자동차 경주를 하 고 있는 것과 같은 느낌을 운전자에게 제공할 수 있도록 고스트카를 헤드업 디스플레이(HUD)에 표출할 수 있다. 이때 헤드업 디스플레이로는 증강 현실 이미지로 각종 정보를 표시하는 증강현실 헤드업 디스플레이(AR HUD)가 사용될 수 있다. 고스트카는 운전자에게 레퍼런스(reference)가 되는 가상의 차량으로서, 고스트카 기능에서는 레퍼런스가 되는 가상의 차량을 표시장치, 예컨대 증강현실 헤드업 디스플레이를 이용하여 보여줄 수 있다. 이러한 고스트카 기 능에서 고스트카는 운전자의 운전에 방해가 되지 않도록 디스플레이상에서 투명도를 조절하여 고스트와 흡사한 느낌을 들게 설정된 차량이라 할 수 있다. 고스트카 기능에서는 고스트카의 차량 정보를 이용하여 고스트카를 표출할 수 있으며, 이때 차량 위치 인식부 에서 입력된 자기 차량의 실시간 위치 정보, 주행 상태 판단부에서 운전정보 검출부를 통해 취득된 후 입력된 자기 차량의 실시간 차량 상태 정보, 서비스 제공 서버로부터 수신된 서킷 관련 정보 등을 추가로 이 용하여 고스트카의 차량 정보와 비교한 후 상기 고스트카를 표출할 수 있다. 그 밖에 기록 단축에 도움을 줄 수 있는 레코드 라인(record line), 차량 상태 정보, 운전자 간 비교값 등 정보 를 표출할 수 있다. 또한, 운전자가 자신의 취향에 따라 입출력부의 입력장치를 통해 고스트카의 표출 상태 나 형태, 기타 고스트카 관련 설정값을 입력 및 변경하도록 할 수 있다. 이러한 고스트카 기능의 수행 동안 가이드 제어부는 서킷 주행을 완료했는지를 판단하고(S26), 서킷 주행이 완료되었다면 가이드 제어부에 의해 분석 기능이 수행될 수 있다(S27). 서킷 안내 기능 중 분석 기능은 서킷 주행 후 서킷 전체 기록(랩 타임) 및 서킷 구간별 기록(구간 타임)을 분석 하는 기능이다. 이때 차량에서 입출력부의 표시장치를 통해 전체 기록 및 구간별 기록을 표시하여 운전자에 게 보여주거나, 현재 기록을 해당 운전자의 이전 기록들과 비교하여 보여줄 수 있다. 또한, 서비스 제공 서버 에서 통신부를 통해 전달받은 다른 운전자들의 기록 등과 비교하여 보여주는 것 등이 가능하다. 또한, 분석 기능에서 서킷 전체 기록 및 서킷 구간별 기록 및 주행 결과, 기록 분석, 그리고 서킷 전체 및 서킷 구간별 차량 이동 루트와 차량 운전 정보(차량 상태 정보)를, 타 운전자의 기록, 타 운전자의 차량 이동 루트와 차량 운전 정보(차량 상태 정보)와 비교하고, 비교 결과를 입출력부의 표시장치에 표시해줄 수 있다. 또한, 분석 기능에서 서킷 구간별 정보를 전체적으로 종합하는 것과 더불어, 인공지능(Artificial Intelligence, AI) 기술을 이용하여 기록을 단축할 수 있는 최적의 루트 및 운전 스킬을 안내할 수 있다. 그리고, 제어기의 가이드 제어부에서는 차량 위치 인식부에서 입력된 차량의 현재 위치 정보와, 서 비스 제공 서버나 애드-온 디바이스로부터 통신부를 통해 수신 및 입력된 서킷 위치 정보를 기초로 차량이 서킷에서 이탈한 경우를 판단할 수 있다. 이와 같이 차량이 서킷을 이탈하였음을 판단한 경우, 가이드 제어부는 서킷 모드를 해제하고, 차량 시스템 을 평상시의 실생활 운전 모드인 일반 모드로 전환시킨다. 이와 같이 하여, 본 발명에 따른 차량의 서킷 모드 수행을 위한 시스템에 의하면, 서킷 주행시 운전자에게 필요 하고 도움이 되는 정보의 전달 및 서킷 안내 기능을 제공함으로써, 운전자의 차량 및 서킷에 대한 이해도를 높 일 수 있고, 운전자의 속도 경쟁 욕구 및 펀 드라이빙 욕구를 충족시킬 수 있으며, 차량의 상품성을 더욱 향상 시키는 효과가 있게 된다.이상으로 본 발명의 실시예에 대하여 상세하게 설명하였지만, 본 발명의 권리범위가 이에 한정되는 것은 아니며, 다음의 특허청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당 업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 포함된다."}
{"patent_id": "10-2022-0065062", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 차량의 서킷 모드 수행을 위한 시스템의 구성을 나타내는 블록도이다. 도 2는 본 발명에서 평상시의 일반 모드에서 서킷 진입시의 서킷 모드로 전환된 뒤 다시 일반 모드로 전환되는 과정을 설명하기 위한 도면이다. 도 3과 도 4는 본 발명의 실시예에 따른 서킷 모드 수행을 위한 과정을 나타내는 순서도이다."}
