{"patent_id": "10-2023-0097287", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0129551", "출원번호": "10-2023-0097287", "발명의 명칭": "최근접 이웃 정보를 활용한 의사 라벨링 기반 테스트 단계 적응 기법", "출원인": "한국과학기술원", "발명자": "정혜원"}}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "테스트 단계 적응 시스템에 있어서,선행 학습된 분류 모델의 테스트 단계에서 임베딩 공간 내 최근접 이웃 정보를 활용해 각 테스트 데이터의 의사라벨 분포를 생성하는 의사 라벨 분포 생성부; 및 상기 생성된 각 테스트 데이터의 의사 라벨 분포와 프로토타입 기반 라벨 분포가 일치되도록 상기 선행 학습된분류 모델을 미세조정하는 미세 조정부를 포함하는 테스트 단계 적응 시스템."}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 테스트 단계 적응 시스템은,특징 네트워크의 특징 위치에 적응 모듈을 구축하는 적응 모듈 구축부를 더 포함하는 테스트 단계 적응 시스템."}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 적응 모듈 구축부는,상기 선행 학습된 분류 모델의 테스트 단계 동안 상기 구축된 적응 모듈을 학습시키는 것을 특징으로 하는 테스트 단계 적응 시스템."}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 테스트 단계 적응 시스템은,분류 모델의 예측값을 갖는 테스트 데이터를 선별하여 신뢰할 수 있는 지원 데이터 셋을 구성하는 데이터 셋 생성부를 더 포함하는 테스트 단계 적응 시스템."}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 의사 라벨 분포 생성부는,데이터 셋 생성부에서 구성된 신뢰할 수 있는 지원 데이터 셋에서 각 테스트 데이터의 최근접 이웃을 선별하는 것을 특징으로 하는 테스트 단계 적응 시스템."}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 의사 라벨 분포 생성부는,적응 모듈의 임베딩 공간 내 각 클래스를 대표하는 프로토타입을 형성하는 것을 특징으로 하는 테스트 단계 적응 시스템."}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0129551-3-제5항에 있어서,상기 의사 라벨 분포 생성부는,상기 선별된 각 테스트 데이터의 최근접 이웃을 이용하여 프로토타입 기반 예측 라벨 분포를 집계하여 상기 각테스트 데이터의 의사 라벨 분포를 생성하는 것을 특징으로 하는 테스트 단계 적응 시스템."}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 테스트 단계 적응 시스템은,적응 모듈에서 계산된 최근접 이웃 정보를 이용하여 클래스 분포를 평균해 최종 라벨을 예측하는 라벨 예측부를 더 포함하는 테스트 단계 적응 시스템."}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "테스트 단계 적응 시스템에 의해 수행되는 의사 라벨링 기반 테스트 단계 적응 방법에 있어서,선행 학습된 분류 모델의 테스트 단계에서 임베딩 공간 내 최근접 이웃 정보를 활용해 각 테스트 데이터의 의사라벨 분포를 생성하는 단계; 및 상기 생성된 각 테스트 데이터의 의사 라벨 분포와 프로토타입 기반 라벨 분포가 일치되도록 상기 선행 학습된분류 모델을 미세조정하는 단계를 포함하는 의사 라벨링 기반 테스트 단계 적응 방법."}
{"patent_id": "10-2023-0097287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "테스트 단계 적응 시스템에 의해 수행되는 의사 라벨링 기반 테스트 단계 적응 방법을 실행시키기 위해 컴퓨터판독 가능한 저장매체에 저장된 컴퓨터 프로그램에 있어서,상기 의사 라벨링 기반 테스트 단계 적응 방법은, 선행 학습된 분류 모델의 테스트 단계에서 임베딩 공간 내 최근접 이웃 정보를 활용해 각 테스트 데이터의 의사라벨 분포를 생성하는 단계; 및 상기 생성된 각 테스트 데이터의 의사 라벨 분포와 프로토타입 기반 라벨 분포가 일치되도록 상기 선행 학습된분류 모델을 미세조정하는 단계를 포함하는 컴퓨터 판독 가능한 저장 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "최근접 이웃 정보를 활용한 의사 라벨링 기반 테스트 단계 적응 기법이 개시된다. 일 실시예에 따른 테스트 단 계 적응 시스템은, 선행 학습된 분류 모델의 테스트 단계에서 임베딩 공간 내 최근접 이웃 정보를 활용해 각 테 스트 데이터의 의사 라벨 분포를 생성하는 의사 라벨 분포 생성부; 및 상기 생성된 각 테스트 데이터의 의사 라 벨 분포와 프로토타입 기반 라벨 분포가 일치되도록 상기 선행 학습된 분류 모델을 미세조정하는 미세 조정부를 포함할 수 있다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명은 테스트 단계 적응 기술에 관한 것이다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 학습 모델은 이미지 분류, 강화 학습 등 다양한 분야에서 우수한 성능을 보이고 있지만 테스트 단계 도메인 변화에 종종 취약한 문제를 보인다. 보다 자세히는, 인공지능 학습 모델이 학습 데이터와 비슷한 테스 트 도메인의 태스크에서 좋은 성능을 보일 만큼 충분히 학습되었더라도 학습 과정에서 겪어보지 못한 테스트 도 메인의 태스크의 성능은 크게 떨어지는 문제를 종종 확인할 수 있다. 테스트 단계 도메인 변화에 의한 학습 모 델 성능 저하 개선 방법으로 변화하는 도메인에 강인한 학습 모델을 학습하는 도메인 적응(domain adaptation) 기법이 널리 활용되고 있다. 종래의 도메인 적응 기법은 모델 적응 학습을 위해 학습 데이터 셋이나 테스트 도메인의 라벨링 된 데이터를 필요로 한다. 그러나, 이는 데이터 보안과 라벨링 비용의 문제로 실생활 문제를 해 결하기에는 적합하지 않다. 따라서, 최근 학습 데이터나 라벨링 된 테스트 도메인의 데이터 없이 선행 학습된 모델을 테스트 도메인으로 적응시키는 테스트 단계 적응(test-time adaptation) 기법이 최근 학계에서 각광받고 있다. 종래의 의사 라벨링 기반 테스트 단계 적응 기법은 분류 모델의 예측을 테스트 데이터의 의사 라벨로 사 용하고, 생성된 의사 라벨에 맞도록 분류 모델을 미세조정한다. 하지만, 테스트 도메인 변화에 의해 발생한 부 정확한 의사 라벨이 분류 모델 미세조정에 악영향을 미친다는 것이 알려져 있다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "테스트 단계 시간 적응은 학습 절차와 관련된 정보없이 라벨이 지정되지 않은 테스트 데이터를 사용하여 학습된 분류 모델을 적응시키는 방법 및 시스템을 제공할 수 있다. 최근접 이웃 정보를 이용한 자기 학습을 통한 테스트 단계 시간 적응 방법 및 시스템을 제공할 수 있다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "테스트 단계 적응 시스템은, 선행 학습된 분류 모델의 테스트 단계에서 임베딩 공간 내 최근접 이웃 정보를 활 용해 각 테스트 데이터의 의사 라벨 분포를 생성하는 의사 라벨 분포 생성부; 및 상기 생성된 각 테스트 데이터 의 의사 라벨 분포와 프로토타입 기반 라벨 분포가 일치되도록 상기 선행 학습된 분류 모델을 미세조정하는 미 세 조정부를 포함할 수 있다. 상기 테스트 단계 적응 시스템은, 특징 네트워크의 특징 위치에 적응 모듈을 구축하는 적응 모듈 구축부를 더 포함할 수 있다. 상기 적응 모듈 구축부는, 상기 선행 학습된 분류 모델의 테스트 단계 동안 상기 구축된 적응 모듈을 학습시킬 수 있다. 상기 테스트 단계 적응 시스템은, 분류 모델의 예측값을 갖는 테스트 데이터를 선별하여 신뢰할 수 있는 지원 데이터 셋을 구성하는 데이터 셋 생성부를 더 포함할 수 있다. 상기 의사 라벨 분포 생성부는, 데이터 셋 생성부에서 구성된 신뢰할 수 있는 지원 데이터 셋에서 각 테스트 데 이터의 최근접 이웃을 선별할 수 있다. 상기 의사 라벨 분포 생성부는, 적응 모듈의 임베딩 공간 내 각 클래스를 대표하는 프로토타입을 형성할 수 있 다. 상기 의사 라벨 분포 생성부는, 상기 선별된 각 테스트 데이터의 최근접 이웃을 이용하여 프로토타입 기반 예측 라벨 분포를 집계하여 상기 각 테스트 데이터의 의사 라벨 분포를 생성할 수 있다. 상기 테스트 단계 적응 시스템은, 적응 모듈에서 계산된 최근접 이웃 정보를 이용하여 클래스 분포를 평균해 최 종 라벨을 예측하는 라벨 예측부를 더 포함할 수 있다. 테스트 단계 적응 시스템에 의해 수행되는 의사 라벨링 기반 테스트 단계 적응 방법은, 선행 학습된 분류 모델 의 테스트 단계에서 임베딩 공간 내 최근접 이웃 정보를 활용해 각 테스트 데이터의 의사 라벨 분포를 생성하는 단계; 및 상기 생성된 각 테스트 데이터의 의사 라벨 분포와 프로토타입 기반 라벨 분포가 일치되도록 상기 선 행 학습된 분류 모델을 미세조정하는 단계를 포함할 수 있다. 테스트 단계 적응 시스템에 의해 수행되는 의사 라벨링 기반 테스트 단계 적응 방법을 실행시키기 위해 컴퓨터 판독 가능한 저장매체에 저장된 컴퓨터 프로그램에 있어서, 상기 의사 라벨링 기반 테스트 단계 적응 방법은, 선행 학습된 분류 모델의 테스트 단계에서 임베딩 공간 내 최근접 이웃 정보를 활용해 각 테스트 데이터의 의사 라벨 분포를 생성하는 단계; 및 상기 생성된 각 테스트 데이터의 의사 라벨 분포와 프로토타입 기반 라벨 분포 가 일치되도록 상기 선행 학습된 분류 모델을 미세조정하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 도메인이 변하더라도 같은 클래스의 데이터끼리는 특징 네트워크의 임베딩 공간 내에서 군집화되어 있다는 가정 하에서 임베딩 공간 내 최근접 이웃 정보 기반 의사 라벨을 생성 및 미세조정에 사용함으로써 부정 확한 분류 예측을 활용할 때 발생할 수 있는 악영향을 방지하는 효과가 있다. 학습 데이터나 테스트 도메인의 라벨링 된 데이터 없이 선행 학습된 분류 모델의 변화하는 테스트 도메인에 대한 분류 성능을 개선함으로써 인 공지능 기술의 실생활로의 확장성을 높이는데 기여할 것으로 예상된다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예를 첨부한 도면을 참조하여 상세히 설명한다. 도 1및 도 2는 일 실시예에 있어서, 의사 라벨링 기반 테스트 단계 적응의 개괄적인 동작을 설명하기 위한 도면 이다. 테스트 단계 적응 시스템은 테스트 단계 동안 간단하게 학습할 수 있는 적응 모듈을 특징 추출기의 특정 위치에 추가하여 자기 학습의 확증 편향 문제를 완화하는데 간단하면서도 효과적인 테스트 시간 적응 방법을 제공할 수 있다. 테스트 단계 적응 시스템은 프로토타입 기반 분류기를 사용하지만, 원래의 특징 추출기의 임베딩 공간이 아니라 적응 모듈의 임베딩 공간에서 최근접 이웃 정보를 이용하여 학습하여 원래의 단순한 프로토타입 기반 분 류기 방법보다 더 높은 성능 이득을 달성할 수 있다. 테스트 단계 적응 시스템은 테스트 도메인의 변화함에서도 같은 클래스의 데이터끼리는 특징 모델(feature model)이 생성하는 임베딩 공간(embedding space) 내에서 군집화되어 있다라는 학계에 널리 알려진 가정하에서, 임베딩 공간 내 최근접 이웃 정보를 활용해 라벨링 되지 않은 테스트 데이터의 의사 라벨 분포를 생성하고, 임 베딩 공간 내 각 클래스를 대표하는 프로토타입과의 거리를 비교해 얻은 프로토타입 기반 라벨 분포와 생성한 의사 라벨 분포가 같아지도록 분류 모델을 미세조정해 테스트 단계 정확도를 개선하는 테스트 단계 적응 방법을 제공할 수 있다. 도 1을 참고하면, 테스트 단계 적응 시스템은 테스트 데이터 x의 최근접 이웃 이 동일한 라벨을 공유할 가능성이 있다는 점에 착안하여, 에서 지원 예제(지원 데이터 셋)에 대한 프로토타입 기반 예측 평균을 테스트 데이터 x의 의사 라벨로 사용할 수 있다. 테스트 단계 적응 시스템은 테스트 데이터 x가 공급될 때 의 사 라벨을 예측하도록 적응 모듈을 학습시킬 수 있다. 이때, 특징 추출기는 테스트 단계 동안 고정될 수 있다. 테스트 단계 적응 시스템은 테스트 단계가 시작될 때 특징 추출기 위에 임의로 초기화된 적응 모듈 을 추가할 수 있다. 이때, 학습 가능한 적응 모듈을 추가하여 테스트 도메인에서 분류에 유용한 새로운 특징 임베 딩을 획득할 수 있다. 적응 모듈은 최근접 이웃 정보를 이용하여 테스트 데이터에 대한 의사 레이블 분포를 생 성할 수 있다. 적응 모듈은 최근접 이웃 정보를 이용하여 테스트 데이터에 대한 의사 레이블 분포를 생성할 수 있다. 적응 모듈은 테스트 데이터와 가장 가까운 이웃이 동일한 라벨을 가질 가능성이 높다는 것에 기초하여 임베딩 공간에 있는 인근 예제의 라벨 평균을 테스트 데이터에 대한 의사 라벨 분포로 할당할 수 있다. 적응 모듈은 테스트 데이터에 대한 가장 가까운 이웃 기반 의사 레이블 분포와 프로토타입 기반 클래스 분포를 일치시키기 위해 테스트 단계 동안 몇 번 학습할 수 있다. 적응 모듈은 테스트 데이터가 공급될 때 의사 라벨 분포 를 출력하도록 학습될 수 있다. 적응 모듈은 평균 예측 클래스 분포를 사용하여 테스트 데이터의 라벨을 예측 할 수 있다. 적응 모듈은 테스트 데이터의 예측을 위해 적응 모듈에서 예측된 클래스 분포를 평균화할 수 있다. 도 2에서 점선 클래스는 실측 클래스를 나타낸다. 테스트 단계 적응 시스템은 특징 추출기 위에 임의로 초기 화된 적응 모듈 을 추가하고, 적응 모듈의 임베딩 공간에서 테스트 데이터 x의 가장 가까운 지원 예제의 의사 라벨을 집계하여 테스트 데이터 x의 추정된 클래스 분포를 계산할 수 있다. 도 3은 일 실시예에 있어서, 테스트 단계 적응 시스템의 구성을 설명하기 위한 블록도이다. 테스트 단계 적응 시스템은 의사 라벨링 기반 테스트 단계 적응을 위한 것으로, 데이터 셋 생성부, 의사 라벨 분포 생성부, 미세 조정부 및 라벨 예측부를 포함할 수 있다. 이때, 테스트 단계 적 응 시스템은 특징 추출기의 특정 위치에 적응 모듈을 구축하는 적응 모듈 구축부(미도시)를 더 포함할 수 있다. 다시 말해서, 적응 모듈은 특징 추출기의 특정 위치에 구축되어 의사 라벨링 기반 테스트 단계 적응 동 작을 수행할 수 있다. 도 3을 참고하여 도 5의 의사 라벨링 기반 테스트 단계 적응의 상세 동작을 설명하기로 한다. 적응 모듈 구축 동작에서 적응 모듈 구축부는 과적합 방지를 위해 분류 모델에서 미세조정 가능한 층을 구 축할 수 있다. 분류 모델의 모든 층을 미세조정하는 학습이 불안정하고 비효율적이라는 것이 알려져 있다. 따 라서, 테스트 단계 시작에 고정된 특징 네트워크(추출기) 뒤에 초기화된 적응 모듈 h을 붙이고, 테스트 단계 동 안 적응 모듈을 학습한다. 신뢰할 수 있는 데이터 셋 생성 동작에서 데이터 셋 생성부는 분류 모델의 예측값을 갖는 테스트 데 이터를 선별하여 신뢰할 수 있는 데이터 셋을 구성할 수 있다. 데이터 셋 생성부는 테스트 데이터에 대해 확실한 분류 모델 예측 값을 갖는 경우 이를 신뢰할 수 있는 예측으로 판단하는 종래 기술과 같이 높은 확실성 (confidence)를 갖는 예제로 신뢰할 수 있는 지원 데이터 셋을 구성할 수 있다. 상기 지원 데이터 셋은 임베딩 공간에서 각 클래스를 대표하는 프로토타입 형성뿐 아니라 테스트 데이터의 최근접 이웃 검색에 활용된다. 의사 라벨 분포 생성 동작에서 의사 라벨 분포 생성부는 선행 학습된 분류 모델의 테스트 단계 적응 과정에서 임베딩 공간 내 최근접 이웃 정보를 활용해 라벨링 되지 않은 각 테스트 데이터의 의사 라벨 분포를 생성할 수 있다. 의사 라벨 분포 생성부는 데이터 셋 생성부를 통해 생성된 지원 데이터 셋 에서 테스트 데이터(샘플) x의 최근접 이웃 을 선별할 수 있다. 의사 라벨 분포 생성 부는 적응 모듈 구축부에서 구축된 적응 모듈의 임베딩 공간 내 각 클래스를 대표하는 프로토타입 을 형성할 수 있다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "우선, 의 프로토타입 기반 예측 라벨 분포는 아래 식으로 계산될 수 있다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이때, d는 유클리드(Euclidean) 거리와 같은 거리 측정법이다. 의사 라벨 분포 생성부는 의 프 로토타입 기반 예측 라벨 분포를 집계하여 테스트 데이터 x의 의사 라벨 분포 를 생성한다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "예를 들면, 의사 라벨 분포 생성부는 의사 라벨 생성을 위해 원-핫 클래스 분포를 사용할 수 있다. 분류 모델 미세조정 동작에서 미세 조정부는 라벨링되지 않은 테스트 데이터의 의사 라벨 분포와 프 로토타입 기반 라벨 분포가 일치되도록 선행 학습된 분류 모델을 미세조정할 수 있다. 예를 들면, 미세 조정부 는 라벨링되지 않은 테스트 데이터의 의사 라벨 분포와 프로토타입 기반 라벨 분포 사이의 교차 엔트로피 손실을 최소화하여 분류 모듈을 미세조정할 수 있다. 학습 시 사용되는 손실 함수는 다음과 같다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이때, 는 (a)의 적응 모듈 h의 파라미터이고, x의 프로토타입 기반 라벨 분포 는 다음과 같이 의 임베딩 공간에서 계산된다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "테스트 단계 동안 각 테스트 데이터의 의사 라벨 분포와 프로토타입 기반 클래스 분포를 일치하도록 하는 적응 모듈을 적은 수의 훈련만으로 효과적인 분류 모델 적응이 이루어짐을 확인하였다. 앙상블 기반 라벨 예측 동작에서 라벨 예측부는 여러 적응 모듈에서 계산된 최근접 이웃 정보를 이용 하여 클래스 분포를 평균해 최종 라벨을 예측할 수 있다. 적응 모듈 구축부에서 구축된 적응 모듈은 테스트 단 계 시작에 새롭게 초기화되었기에 적응 모듈의 무작위 초기화가 분류 모델의 성능 저하를 종종 유발할 수 있다. 라벨 예측부는 앙상블 방식을 통해 적응 모듈의 무작위 초기화로 인한 악영향을 완화하여 견고하고 정확한 예측을 획득할 수 있다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서, Ne는 앙상블 멤버의 개수이다. 도 4는 일 실시예에 있어서, 의사 라벨링 기반 테스트 단계 적응 방법을 설명하기 위한 흐름도이다. 단계에서 테스트 단계 적응 시스템은 선행 학습된 분류 모델의 테스트 단계 적응 과정에서 임베딩 공간 내 최근접 이웃 정보를 활용해 각 테스트 데이터의 의사 라벨 분포를 생성할 수 있다. 단계에서 테스트 단계 적응 시스템은 생성된 각 테스트 데이터의 의사 라벨 분포와 프로토타입 기반 라벨 분포가 일치되도록 선행 학습된 분류 모델을 미세조정할 수 있다. 도 6은 일 실시예에 있어서, 의사 라벨링 기반 테스트 단계 적응의 기술적 효과를 설명하기 위한 도면이다. 실시예에서 제안되 의사 라벨링 기반 테스트 단계 적응의 기술적 효과를 설명하기로 한다. 두 가지 표준 벤치"}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "마크인 도메인 일반화 및 이미지 손상에 대해 실시예에서 제안된 발명의 효과를 조사했고 이를 통해 종래의 테 스트 단계 적응 기법 대비 우수한 성능을 보이는 것을 확인할 수 있다. 도메인 일반화 벤치마크는 학습 과정에 서 겪어보지 못한 스타일의 테스트 이미지의 분류 성능을 확인하는 벤치마크이며, 표 1을 통해 PACS, VLCS, OfficeHome, TerraIncognita의 4가지 벤치마크에서 종래 기술 대비 좋은 성능을 보이는 것을 확인할 수 있다.표 1: 도메인 일반화 벤치마크 성능"}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "이미지 손상 벤치마크는 손상되지 않은 이미지로 선행 학습된 분류 모델이 손상된 테스트 이미지에 대해 강인한 분류 성능을 보이는지에 확인하는 벤치마크이며, 표 2를 통해 CIFAR-10C/100C에서 종래 기술 대비 좋은 성능을 보이는 것을 확인할 수 있다. 표 2: 이미지 손상 벤치마크 성능"}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "절제 연구(ablation study)를 통해 도 1과 표 3에서 최근접 이웃 정보 반영한 의사 라벨링 기법과 적응 모듈 활 용법은 모두 성능 향상에 기여함을 확인했다. 표 3(T3A)는 종래 기술로서 신뢰할 수 있는 데이터 셋을 활용한 프로토타입 기반 분류 기법으로 본 발명과 달리 학습 모델을 미세조정하지 않는다. TAST-N은 본 발명(TAST)에 서 제안한 적응 모듈 없이 최근접 이웃의 평균 프로토 타입 기반 예측 클래스 분포를 이용해 테스트 데이터의 라벨을 예측하는 방법으로, 종래 기술인 T3A와 TAST-N의 비교를 통해 최근접 이웃 정보 반영한 의사 라벨링 및 예측의 효율성을 확인할 수 있고, TAST-N과 TAST의 비교를 통해 제안한 적응 모듈 활용법이 테스트 단계 적응에 효과적이었음을 확인할 수 있다. 표 3: 최근접 이웃 정보 반영 의사 라벨링과 적응 모듈 활용법의 기여도 확인을 위한 절제 연구"}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 11, "content": "도 6을 참고하면, 테스트 단계동안 적은 수의 훈련만으로 효과적인 분류 모델 적응을 나타낸 그래프이다. 테스 트 단계 동안 각 테스트 데이터의 의사 라벨 분포와 프로토타입 기반 클래스 분포를 일치하도록 하는 적응 모듈 을 적은 수의 훈련만으로 효과적인 분류 모델 적응이 이루어짐을 확인할 수 있다. 적응된 분류 모델의 성능이 적응되지 않은 (i.e. T=0)보다 성능이 우수하며, T의 변화에 크게 영향받지 않음을 확인할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터 는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다."}
{"patent_id": "10-2023-0097287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2023-0097287", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1및 도 2는 일 실시예에 있어서, 의사 라벨링 기반 테스트 단계 적응의 개괄적인 동작을 설명하기 위한 도면 이다. 도 3은 일 실시예에 있어서, 테스트 단계 적응 시스템의 구성을 설명하기 위한 블록도이다. 도 4는 일 실시예에 있어서, 의사 라벨링 기반 테스트 단계 적응 방법을 설명하기 위한 흐름도이다. 도 5는 일 실시예에 있어서, 의사 라벨링 기반 테스트 단계 적응의 상세 동작을 설명하기 위한 도면이다. 도 6은 일 실시예에 있어서, 의사 라벨링 기반 테스트 단계 적응의 기술적 효과를 설명하기 위한 도면이다."}
