{"patent_id": "10-1999-0002042", "section": "특허_기본정보", "subsection": "특허정보", "content": {"출원번호": "10-1999-0002042", "출원인": "김남영", "발명자": "김남영"}}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "진자가 왕복 운동을 하는 이치와 같이, 에너지역학 보존의법칙의 원리를 응용하고, 거기에 고감도 센서 인공지능의 사고로 작동되는 퍼지이론을[도 2] 결합시킨, 켤레 엘리베이터[도 1]에 관한 것으로,엘리베이터 BOX[카] 여러개를 상하로 연결하고, [도 4]와 같이 그들을 한묶음으로 결합시키는 골조형틀부,그 골조 형틀부 내부에 세로로 연결 된 엘리베이터 BOX 각각 마다 평면[도 3]과 같이 사방으로 통할수 있도록 출입문이 형성된 엘리베이터 BOX부,골조형틀부와 그 내부의 엘리베이터 BOX 들이 양쪽으로 서로 대칭되게 [도 1c]와 같이 나열시켜 균형을 이루게 하여, [도 2]와 같이 나란히 정지하는 순간 마다 각층에서 [도 7]과 같이, 서로 사방으로 옮겨 탈수 있도록 문을 내어, 전체가 한 켤레를 이루도록 조합한 켤레 엘리베이터부,좌우로 대칭되는 골조 형틀부의 상부 또는 하부에는, 로프나 체인 또는 유압배관[도 10]으로 서로 연결되며, 그 중간에서 전동기와 감속기, 태엽스프링[도 23]이 부착된 플라이휘일 등을 이용한 동력 전달 장치부,그리고, 스프링[도 12][도 23] 또는 유압[도 10] 또는 물의 부력[도 15]이나 전자기력[도 19]으로 켤레 엘레베이터의 전체 하중이 거의 모두 떠 받혀 지도록되어, 그 반력으로 진자의 왕복운동을 유도하도록 하는 진자의 왕복운동 유도장치부,전자기력을 이용하여 자기 부상력으로 켤레베이터를 왕복 운동[도 19] 하게 하거나, 순환식으로[도 20] 작동되게 하는 전자기 유도장치부,엘리베이터 BOX군의 사이 즉, 윗층과 아래층의 엘리베이터 BOX 중간에, 층고 조절 제어장치가 들어 있도록 하는 층고 조절 장치부,골조형틀부의 하중이 축을 통하여 로프로 전달되게 하는 하중 전달부,정지된 순간 위치에너지 보존을 위한 브레이크 제어장치 및 비상정지 장치부,출발과 정지, 문의 개폐 등 모든 동작 및 신호를 스스로 알아서 처리하는 인공지능의 퍼지이론을 그 기본으로 하는 자동제어 시스템 관리부,전체 하중과 각 부분의 동력 전달을 지지해 주는 하중 지지 및 고정 구조부,및 비상 예비 전력부로 구성되며,그 좌우의 엘리베이터 BOX군이 한개층 혹은 두개층 이상씩 서로 반대 방향으로 오르락 내리락 작동하며[도 2], 서로 나란히 마주보고 켤레를 이루며 정지하도록 하는 승강기계설비 장치로, 주로 건축물의 저층부나 지하철 등 에서 단거리 대량수송용으로 사용 되거나, 고층 빌딩의 고층부[스카이라운지]의 수송[도 26] 및 저층부와 고층부의 셔틀용으로 사용되는 켤레베이터[켤레 엘리베이터]"}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 골조형틀부 및 엘리베이터 BOX 부에서, 도면 [도 3] 과 같이 사방으로 통하도록 자동문을 형성하고,코너 부분에 코너부 외벽 지지 프레임[9], H형강 골조 형틀[11], 가이드 파이프[22], 파이프 아답터[23], 내부 코너 지지 프레임[24]을 형성하고,그들을 '×' 자로 교차되게 연결하는 '×' 자 골조형틀[11], '×'자 골조연결부[13], '×'자 프레임[19] 등이 형성되고,바닥에는 진동 및 충격을 흡수하는 바닥층[29]을 형성하고, 그 밑에 하중계산 센서가 부착된 하중분포 균등 분산 장치[86]를 장착한 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 골조형틀부에서, 도면 [도 4] 와 같이 '×' 자[11]로 교차되는 골조형틀부를 형성하고, 그 내부에는 베어링 및 오일링과 패킹이 들어있는파이프 아답터[23]와 연결된 엘리베이터 BOX[20]가 가이드 파이프[22]를 따라 상하로 움직일수 있도록 하고, 외부에는 가이드 레일[4]과 골조 형틀부의 상하 왕복운동을 원할하게 하기 위하여 도면 [도 3]과 같이, 코너부 H형강에 오일 댐퍼가 부착된 롤러 가64-13공개특허특2000-0051539이드[14]를 장착한 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 가이드 레일[4]과 골조 형틀부[11]의 상하 왕복운동을 원할하게 하기 위하여, 코너부 H형강[11] 및 파이프 아답터[23]에 슬라이드 방식의 가이드 슈를 장착한 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 엘리베이터 BOX 고정 방식에서, 도면 [도 10] 과 같이, 층고에 따라 골조형틀 내에서 위치변화가 없는 BOX는 골조 형틀에 고정시켜 층고조절 장치를 감소시킨 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 층고 조절 장치부에서, 도면 [도 11]과 같이 층고 변화에의한 유압 변화와 스프링과의 상호 작용에 의하여, 전체 켤레베이터의 왕복운동에 의한 위치에너지의 변화와 동시에, 층고 조절 장치 내부에서도 상호간에 에너지역학 보존의 법칙에 의하여 진자의 왕복 운동이 함께 이루어지도록 하는 층고조절장치를가진 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항 및 제 6 항에 있어서, 층고 조절 장치부 및 하중전달부 및 진자의 왕복운동 유도장치부에서, 도면 [도 11]과 같이, 유압잭과 스프링이 직접 조절하는방식[도 11a]과, 각도가 변하는 프레임[35]을 이용하여, [도 11b] 및 [도 11c]와 같이 유압 실린더와 스프링을 서로 직각 방향으로 작용하게 하여, 지하철[도 21]등에서 처럼 큰 층고 변위[도 11d][도 11e]가 생겨도 진자의 왕복 운동을 유도하게 하는 간접식 유압 층고 조절 장치."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서, 동력 전달 장치부에서, 도면 [도 12]와 같이 전동기[71]의 동력을 도르레[74]쉬브를 통해 동력 전달축으로 해서 프라이휘일[75]과 각 축마다 브레이크 드럼[61]이 연결 된 메인 쉬브[76]로 연결 되어, 로프[77]로 전달되도록하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서, 동력 전달 장치부 및 하중전달부 등이 하부에 몰려 있는경우, 골조 형틀부의 상부에 편심이 작용하여 흔들림이 발생할 수 있어, 무게 중심을 잡아주기 위한 로우프[99]를 상부에도 설치[도 10]하여, 보다 안정되게 운행할수 있도록 한 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서, 동력 전달 장치부 및 하중 전달부 및 진자의 왕복운동 유도장치부에서, 유압의 작용으로 유도되는 방식에 관한 것으로서, 로프를 사용하지않고 도면 [도 10]과 같이, 전동기[64]와, 연결된 펌프[78]로 오일이 압력배관[54]을 통해 일부 동력이 제어되어 전달되며, 대부분의 작동유는 밸브가 설치된 별도의 큰 유압배관[52]을 통해서, 태엽스프링[도 23]이 부착된 플라이휘일[63]이 달린 수차[66]의 관성에 의하여, 유압이 자연스럽게 이동하게 하여 진자의 왕복운동이 유도 되도록 하는 유압식 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항 및 제 10 항에 있어서, [도 10]의 유압 전달부에서, 층고 조절 장치[도 5],[도 11]에서와 같이, 하부에서 별도의 전동펌프를 통해 유압이 실린더[31]와 플런저[36]를 통해, 층고를 동시에 조절하여 전달 되도록 하며,그 유압 실린더에 스프링이 부착되는 방식으로는 [도 11f] 와 같이 플런저 외부설치 방식과 실린더 내부 설치 방식 또는 [도 11g]와 같이 플런저와 실린더 모두 설치방식으로 할수 있는 유압식 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항 및 제 10 항 및 11항에 있어서, VVVF 인버터 방식으로 속도가 제어되는 전동기와, 유압회로에 압력보상밸브를 설치하여 유량제어 밸브를 동작시켜 미세하게 속도와 층고를 조절 할 수 있게 하는 동력제어 방법."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서, 동력 및 하중 전달부에서, 로프나 체인을 도핑하는 방식을 2:1도핑[도 1c], 또는 4:1도핑[도 12] 그외 2:4 도핑 등을 적용하여 로프나 도르래 및 축과 지지옹벽 등에 무리하게 집중하중을 받지 않도록 하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서, 동력 전달 장치부 및 하중 전달부에서, 기어의 작용으로유도되는 방식에 관한 것으로서, 로프를 사용하지 않고 도면 [도 14]와 같이, 하중전달 기둥에 래크와 피니언 톱니바퀴로 연결되어 동력이 자연스럽게 이동하게 하여 진자의 왕복운동이 유도 되도록 하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항에 있어서, 동력 전달 장치부 및 하중 전달부에서, 물의 부력의 작용으로 유도되는 방식에 관한 64-14공개특허특2000-0051539것으로서, 스프링을 사용하지 않고 도면 [도 15]와 같이, 물의 부력으로 동력이 자연스럽게 이동하게 하여 진자의 왕복운동이 유도되도록 하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서, 동력 전달 장치부 및 하중 전달부에서, 로프를 상부에 설치하지 않고 도면 [도 15b]와 같이 중간 하부에 설치하며, 물이 얼지 않도록 부동액이나 점성유를 사용하고, 항상 일정한 수위를 유지하는 수위 조절 장치와, 출렁거림을 방지하는 방파장치가 설치되어 부력이 자연스럽게 이동하게 하여 진자의 왕복운동이 유도 되도록 하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 1 항에 있어서, 동력 전달 장치부 및 하중 전달부에서, 스프링 또는 유압실린더 등을 하나만 사용하지 않고, 도면 [도 12d]와 같이 하중 전달축 및 스프링 또는 유압실린더 등의 하중 전달축을 2개 이상 사용하여, 하중 축에 편심이 작용하는 것을 감소시켜 보다 안정되게 진자의 왕복운동이 유도 되도록 하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 1 항 및 제 17 항에 있어서, 하중 전달부에서, 도면 [도 12]와 같이 하중 전달축의 중심을 잡아주는 지지 파이프에서, 내부에 베어링 및 오일링과 패킹이 들어있는 중심축 지지 가이드 파이프[93]와 그를 바닥과 견고하게 지지 해주는 가이드 아답터 파이프[94]를 설치하여, 편심이 작용하더라도 견딜 수 있도록 하여 보다 안정되게 진자의 왕복운동이 유도 되도록 하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 1 항에 있어서, 고정 구조부에서, 가이드레일을 감싸는 코너부 외벽 지지프레임[9]과 콘크리트 슬래브 바닥[8]과의 긴결한 부착을 위해 [도 5]와 같이 'ㄷ' 자형 브라켓[15]이 슬라브[8]를 감싸게 하는데, 슬라브의 콘크리트 타설전에 미리 형성하여 놓은 세트로 연결된 안내파이프[17]를 묻고, 나중에 구멍에 볼트를 끼우거나 양끝이 나사로 된 앵커볼트를 관통하고 다시 그라우팅하여 고정하는 방법과, 또는 양끝이 나사로 된 앵커볼트 세트[16]를 엮어서 묻고 시공하여, 나중에 용접하거나 너트를 체결하여 고정하는 시공 방법 및 장치."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 1 항에 있어서, 인공지능의 퍼지이론을 그 기본으로 하는 자동제어 시스템관리부[대뇌]에서, 그 모든 작동을 스스로 알아서 자연스럽게 컨트롤 하기 위하여, 자기진단부 및 사람의 감각 기관에 해당하는, 눈,코,귀,입,촉각 등을 대신할 수 있도록 하는 각종 센서가 장착된 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 1 항 및 제 20 항에 있어서, 인공지능의 퍼지이론을 그 기본으로 하는 자동제어 시스템 관리부에 연계되어 장착되는 각종 센서로,근접센서 [반사형광전 센서, 반도체 홀 소자, 리드스위치, 자기식근접센서..등]접촉센서 [마이크로스위치, 테이프스위치, 매트스위치, 터치센서..등]계수센서 [GM계수관, 바코드센서, 인크리멘털식 로터리 인코더..등]위치센서 [리니어 인코더, 경사각센서, 공기압식 센서, 싱크로, 광파이버 자이로..등]거리센서 [공기 마이크로미터, 초음파센서, 레이저 간섭계, 레이저식 거리계..등]길이센서 [플로트식 레벨센서, 차동트랜스, 용적식 유량계..등]속도센서 [도플러식 센서, 초음파식 유속계..등]힘 센서 [변형게이지, 로드 셀, 토크미터, 점성도 센서..등]압력센서 [차압센서, 압각센서..등]온도센서 [바이메탈, 초전형 적외선 센서, 화재경보 센서, 적외선 방사온도계..등]시각센서 [CCD센서, 촬상관, 컬러센서..등]감성센서 [산소센서, 냄새센서, 이온센서..]등을 포함하여 작동 하도록 이루어진 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 1항 및 제 20 항 및 제 21항에 있어서, 인공지능의 퍼지이론을 그 기본으로 하는 자동제어 시스템 관리부에서, 그 모든 작동을 자연스럽게 컨트롤 하기 위하여, 각 센서가 이중 삼중으로 장착 되어, 그중 어느 하나가 고장나더라도 오작동 되지 않도록 대비하며, 그 작동되는 자동제어 시스템이 [도 2]와 같이,'문이 열린다 - 센서감지 - 문이 닫힌다 - 카 출발 - 센서감지 - 카정지' 의 패턴으로 구성된 켤레베이터.64-15공개특허특2000-0051539청구항 23 제 1 항에 있어서, 카 내부와 외부의 계기판 안내모니터[45]에서 정삼각형의 파란 신호는 위로 올라가는 신호를, 역삼각형의 붉은 신호는 아래로 내려가는 신호를 나타내도록 하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 1 항에 있어서, 카 내부 및 외부의 계기판 안내모니터[45]에서 스피커의 안내방송으로..'감사합니다. 1층입니다. 계속 내려가실 분은 옆의 카로 이동하여 주십시오''감사합니다. 2층입니다. 계속 올라가실 분은 옆의 카로 이동하여 주십시오''감사합니다. 갈아탈 때는 서로 좌측 통행으로 이동하여 주십시오' 라고안내 말소리로 알려주며,시간이 지체될 경우 경고음과 함께 안내방송으로..'꾸왁..꾸왁.. 시간이 지체 되오니 다음 카를 이용하여 주십시오. 삐∼ 삐∼ ..'라고 신호를 나타내도록 하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 1 항에 있어서, 엘리베이터 BOX 의 평면 모양이 [도 16]과 같이 다각형 또는 원형 또는 긴 직사각형으로 형성되며, 각 BOX 의 규격이 [도 17e]와 같이 다양하게 제작하도록 하는 켤레 엘리베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 1 항에 있어서, 켤레베이터의 평면이 [도 17]과 같이 1면 또는 2면 또는 3면이 벽에 연접하게 되어 출입구가 형성되며,[도 17d]와 같이 각 층마다 주변 여건이나 상황에 따라 문이 한 방향, 두 방향, 세 방향, 네 방향 등 으로 각각 다르게 개폐 되도록 작동되는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 1 항에 있어서, 엘리베이터 BOX 및 골조 섀시부를 감싸는 거의 모든재료를 유리 또는 투명한 재질로 하거나, [분위기상 또는 프라이버시를 위하여]부분적으로 반투명 재료를 사용하여, 모든 방향에서 내부와 외부가 서로 시각적으로 통할수 있도록 형성된 켤레 엘리베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 1 항 및 제 20 항에 있어서, 켤레베이터의 상부 좌우에 도르레와 편심 방지 로우프[99]로 서로 연결된 로우프 양끝 및 중간에 장력 조절 스프링을 달고, '×' 자 골조형틀[11] 각 부분에도 센서 가이드 브라켓을 설치하고, 플라이휘일 옆에도 원판 슬릿[107]을 부착하는 등, 로드셀이나 인코더 센서 시각센서[CCD센서..]등 각종 센서들을 장착하여, 다양한 자기진단 정보나 모든 동작 상태를 제어하고 인식 할 수 있도록 하며, 스스로 자기진단 결과, 각종 센서나 부속품의 이상유무 및 오작동 데이타를 회사로 전송하도록 작동 되는 인공지능 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 1 항에 있어서, 켤레베이터의 좌우를 분리하여 켤레를 이루지 않고, 사방으로 통할수는 있지만 동시에 옮겨 탈수 없는[도17c] 단일형[도 18]으로, 점유면적이 작고 단순하게 작동되게 하는 반쪽 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 1 항에 있어서, 전자기력을 이용하여 자기 부상력으로 켤레베이터를 왕복운동[도 19]하게 하는, 전자기력의 작용으로 유도되는 방식에 관한 것으로서, 로프나 스프링을 사용하지 않고, 도면 [도 19]와 같이 영구자석을 엘리베이터BOX에 부착시키고 리니어 모터용 코일을 외부 지지 프레임[9]에 부착시켜, 자기 부상력으로 동력이 자연스럽게 이동하게 하여 왕복 운동이 유도 되도록 하는 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 1 항에 있어서, 전자기력을 이용하여 자기 부상력으로 켤레베이터를 왕복및 순환운동[도 20]하게 하는, 전자기력의 작용으로 유도되는 방식에 관한 것으로서, 로프나 스프링을 사용하지 않고, 도면 [도 20]과 같이 영구자석을 엘리베이터 BOX에 부착시키고 리니어 모터용 코일을 외부 지지 프레임[9]에 부착시켜, 자기부상력으로 동력이 자연스럽게 이동하게 하여 왕복 및 순환 운동이 유도 되도록 하는 순환식 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제 1 항에 있어서, 지하철과 같이 한층의 층고가 아주 높은 경우에 적용할수 있도록, 그림[도 21]과 같이 켤레베이터의 골조형틀부[10]상하를 길게하거나, BOX[카] 상하를 로프로 연결[도26]하여, 층고가 높은 경우에도 단시간에 지상에서 타는 곳까지 이동 할 수 있도록 작동되게 하는 지하철용 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "64-16공개특허특2000-0051539제 1 항 및 제 22 항에 있어서, 인공지능의 퍼지이론을 그 기본으로 하는 자동제어 시스템 관리부에서, 문의 개폐를 자연스럽게 컨트롤 하고 갈아타는 데 필요이상으로 시간이 지체되는 현상을 방지하기 위하여, 문을 닫을 때 [도 22]와 같이이동이 완료된 문부터, 순차적으로 압박을 가하며 닫히도록 제어하는 방식의 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제 1 항 및 제 22 항 및 제 33 항에 있어서, 인공지능의 퍼지이론을 그 기본으로 하는 자동제어 시스템 관리부에서, 문을 닫을 때 [도 22]와 같이 마지막 부분에서 필요 이상으로 시간이 지체될 경우, 문이 조금씩 열렸다 닫혔다, 누름판[26]에 눌리는 압력에 따라 각종 센서들의 종합적인 정보를 인식하여, 사람이 다치지 않도록 누름판[26]이 부드럽게 요동을 하면서 압박을 가하며 닫히도록 하며, 그래도 지체될 경우, 안내방송과 함께 동물 울음소리나 경고부자음 또는 사이렌이 울리며, 동시에 번쩍 번쩍거리는 조명이 스파크를 일으키며,',,파팍,, 위험합니다...통과할 수 없습니다.,,파팍,,' 하는 '전기합선 효과' 로 더이상 진입을 할 수 없도록 하면서, 조금씩 압박을 가하면서 문을 닫도록 하는 제어방식의 압박 인공지능 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제 1 항에 있어서, 전동기와 감속기, 태엽스프링[100]이 부착된 플라이휘일등을 이용한 동력 전달 장치부 및 스프링[도 12][도 23] 으로 켤레 엘레베이터의 전체 하중이 거의 모두 떠 받혀 지도록 되어, 그 반력으로 진자의 왕복운동을 유도하도록 하는 진자의 왕복운동 유도장치부에서,태엽스프링[도 23]에 관한 것으로, 고정축에[101]에 시계방향의 태엽과 반시계방향의 태엽이 교대로 감겨져 있고 그 주위를 플라이휘일 감싸고 있다.플라이휘일이 회전할때, 그 관성력에 의하여 진행되는 운동에너지를 태엽이 점점 흡수하면서 정지시키게 하며, 그 머금은 위치에너지를 다시 반대 방향으로 태엽이 역방향의 운동에너지로 변환시키면, 다시 반대 방향의 태엽에 의해 진자의 왕복운동이 유도되는 방식으로, 그림[도 23]에서와 같이 태엽스프링을 이용하여 진자의 왕복운동이 유도되도록 하는 태엽스프링 방식의 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제 1 항에 있어서, 도면 [도 24] 에서와 같이 켤레 엘리베이터 '가나'와 '다라' 속에 켤레 엘리베이터 '가' 와 '나' 그리고 켤레 엘리베이터 '다' 와 '라' 를 이중으로 배치하여 보다 복합적으로 작동하는 멀티 켤레 엘리베이터(멀키베이터]."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제 1 항에 있어서, 일반적으로 켤레베이터가 둘이 한쌍을 이루는데 비하여,도면 [도 25] 에서와 같이 세개 이상의 골조형틀부가 조합을 이루도록 배치하여 보다 복합적으로 작동하는 조합식 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제 1 항에 있어서, 고층 빌딩의 저층부와 고층부[스카이라운지]의 수송 및 저층부와 고층부의 셔틀용으로 사용되는 켤레베이터에 관한 것으로,그림[도 26] 과 같이 켤레베이터를 저층부와 고층부에 설치하고 그 사이를 셔틀식으로 작동되는 띄엄 띄엄 연결된 켤레베이터[125]를 설치하여, 고층빌딩의 저층부와 고층부 및 중층[엘리베이터 교환층]부 등을 복합적으로 연계 되도록 하여, 빌딩 전체의 수직 동선을 활성화하고 빌딩 각 부분의 가치를 높이도록 구성한 그룹 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제 1 항 및 제 38 항에 있어서, 고층 빌딩의 저층부와 고층부[스카이라운지]의 수송 및 저층부와 고층부의 셔틀용으로 사용되는 켤레베이터에 관한 것으로, 그림[도 26]과 같이 띄엄 띄엄 연결된 켤레베이터[125] 및 셔틀식 켤레베이터[124]를 단일형식 및 더블덱 및 트리플덱 등으로 구성한 그룹 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "제 1 항 및 제 39 항에 있어서, 빌딩의 저층부와 고층부[스카이라운지]의 수송 및 저층부와 고층부의 셔틀용으로 사용되는 켤레베이터에 관한 것으로,그림[도 27]과 같이 중규모 빌딩[10층이하 빌딩이나 백화점등]의 경우, 켤레베이터를 저층부와 고층부에 설치하고, 그 두 끝 부분이 빌딩 중간부 교환층에서 겹쳐지도록 하여, 빌딩 전체의 수직동선을 활성화하고 빌딩 각 부분의 가치를 높이도록 구성한 그룹 켤레베이터."}
{"patent_id": "10-1999-0002042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "제 1 항 및 제 31 항에 있어서, 전자기력을 이용하여 자기 부상력으로 켤레베이터가 작동 유도되는 방식에 관한 것으로서, 도면 [도 28] 과 같이 리니어모터용 코일을 나선형으로 된 외부 지지 프레임[9]에 부착시켜, 자기부상력으로 동력이 자연스럽게 비틀리며 이동하게 하여, 셔틀 왕복 및 순환 운동이 유도 되도록 하는 나선형 켤레베이터.도면64-17공개특허특2000-0051539 도면1a 도면1b64-18공개특허특2000-0051539 도면1c 도면1d64-19공개특허특2000-0051539 도면1e64-20공개특허특2000-0051539 도면1f64-21공개특허특2000-0051539 도면264-22공개특허특2000-0051539"}
{"patent_id": "10-1999-0002042", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 진자가 왕복 운동을 하는 이치와 같이, 에너지역학 보존의 법칙의 원리를 응용하고, 거기에 고감도 센서 인공지능의 사고로 작동되는 퍼지이론을[도 2]결합시킨, 켤레 엘리베이터[도 1]에 관한 것으로, 엘리베이터 BOX[카] 여러개를 상하로 연결하고, [도 4]와 같이 그들을 한묶음으로 결합시키는 골조 형틀 부, 그 골조 형틀부 내부에 세로로 연결 된 엘리베이터 BOX 각각 마다 평면[도 3]과 같이 사방으로 통할수 있도록 출입문이 형성된 엘리베이터 BOX부, 골조형틀부와 그 내부의 엘리베이터 BOX 들이 [도 7]과 같이 서로 사방으로 옮겨 탈수 있도록 문을 내 어, 전체가 한 켤레를 이루도록 조합한 켤레 엘리베이터부, 및 동력 전달 장치부, 진자의 왕복운동 유도 장치부, 전자기력 유도장치부, 층고 조절장치부, 하중 전달부, 정지된 순간 위치에너지 보존을 위한 브 레이크 제어장치 및 비상정지 장치부, 출발과 정지, 문의 개폐 등 모든 동작 및 신호를 스스로 알아서 처리하는 인공지능의 퍼지이론을 그 기본으로 하는 자동제어 시스템 관리부, 하중지지 및 고정 구조부, 비상 예비 전력부로 구성되며, 그 좌우의 엘리베이터 BOX군이 한개층 혹은 두개층 이상씩 서로 반대 방 향으로 오르락 내리락 작동하며[도 2], 서로 나란히 마주보고 켤레를 이루며 정지하도록 하는 승강기계 설비 장치로, 건축물의 저층부 및 고층부 또는 지하철에서 단거리 대량 수송용으로 사용되는 켤레베이터[켤레 엘리베이터]에 관한 것이다. 켤레베이터는 주로 건축물의 저층부 수개층 내에서, 계속하여 오르락 내리락만을 왕복 반복하게 하여, 짧은 주기로 정지되는 순간마다 [도 7]과 같이 승객들이 서로 옮겨 타도록 함으로서, 별로 기다리는 시 간이 발생되지 않아, 그 특성상 저층부내에서의 단거리 대량 수송용으로 적합하다. 따라서, 본 발명은 특히 에스컬레이터에 비하여, 단위면적당 더 큰 수송능력을 가지면서도, 적은 설치 점유면적과 저렴한 설치비용, 그리고 적은량의 전력소모와 안전성, 이용상의 편리함 등에서 비교 우위를 가지는 효과를 제공한다."}
