{"patent_id": "10-2021-0132323", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0049793", "출원번호": "10-2021-0132323", "발명의 명칭": "인공지능 학습 기반의 문서 분류 장치 및 방법", "출원인": "유니원아이앤씨 주식회사", "발명자": "정재호"}}
{"patent_id": "10-2021-0132323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 학습 기반의 문서 분류 장치에 있어서,학습 전에 사용자 정의 분류 수에 대한 분류 정확도를 계산하여 최적의 분류 수를 설정하는 전처리부;상기 최적의 분류 수에 따라 학습 모델의 구성 및 모델의 수를 구성하는 모델 정의부; 및 학습 모델의 분류 학습을 실행하는 학습부를 포함하는인공지능 학습 기반의 문서 분류 장치."}
{"patent_id": "10-2021-0132323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "인공지능 학습 기반의 문서 분류 방법에 있어서,학습 전에 사용자 정의 분류 수에 대한 분류 정확도를 계산하여 최적의 분류 수를 설정하는 단계;상기 최적의 분류 수에 따라 학습 모델의 구성 및 모델의 수를 구성하는 단계; 및 학습 모델의 분류 학습을 실행하는 단계를 포함하는인공지능 학습 기반의 문서 분류 방법."}
{"patent_id": "10-2021-0132323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항의 인공지능 학습 기반의 분류 방법을 실행하는 컴퓨터 프로그램을 기록한 컴퓨터로 인식 가능한 전자 기록매체."}
{"patent_id": "10-2021-0132323", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 문서 분류 기술에 대한 것으로 더욱 상세하게는 인공지능 학습 기반의 문서 분류 장치 및 방법에 관한 것이다. 본 발명의 일 실시 예에 따르면, 학습문서에 표기된 사용자 정의 카테고리에 기초하여 딥러닝 기반 분류 학습을 실행하여 도출된 분류모델을 활용하여 문서를 카데고리별로 분류할 수 있다."}
{"patent_id": "10-2021-0132323", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 문서 분류 기술에 대한 것으로 더욱 상세하게는 인공지능 학습 기반의 문서 분류 장치 및 방법에 관 한 것이다."}
{"patent_id": "10-2021-0132323", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 컴퓨터가 널리 보급되고 인터넷 기술이 발전함에 따라 온라인 상에 전자문서들이 폭발적으로 증가하고 있 다. 이 급증하는 문서들 중에서 특정 목적에 적합한 문서들을 선별하기 위해서는 각 전자문서들을 분석하여 지 능적으로 자동 분류할 필요가 있다. 전자문서 자동분류기술은 수십 년 동안 발전해 왔는데, 초기에는 시그니처 분석, 블랙리스팅 등과 같은 비학습 기반의 분류기술을 중심으로 개발이 진행되다가 최근에는 통계적 방법, 수학적 접근방법 등을 적용한 학습기반 의 분류기술로 발전하고 있다. 전자문서 자동분류기술은 비정형화되어 있는 전자문서들을 분류하여 특정 분서를 선별할 수 있는 많은 분야에 활용되어, 문서의 유출입 경로 추적, 문서관리, 문서 검사, 문서 검색 등의 다양한 응용에 적용될 수 있다."}
{"patent_id": "10-2021-0132323", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 발명의 배경기술은 대한민국 등록특허 제 10-1983752호에 게시되어 있다. 발명의 내용"}
{"patent_id": "10-2021-0132323", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 문서분류모델 학습에 앞서 분류정확도를 높이는 인공지능 학습 기반의 문서 분류 장치 및 방법를 제 공한다. 본 발명이 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다 른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0132323", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 인공지능 학습 기반의 문서 분류 장치가 제공된다. 본 발명의 일 실시 예에 따른 인공지능 학습 기반의 문서 분류 장치는 학습 전에 사용자 정의 분류 수에 대한 분류 정확도를 계산하여 최적의 분류 수를 설정하는 전처리부, 최적의 분류 수에 따라 학습 모델의 구성 및 모 델의 수를 구성하는 모델 정의부 및 학습 모델의 분류 학습을 실행하는 학습부를 포함할 수 있다. 본 발명의 다른 일 측면에 따르면, 인공지능 학습 기반의 문서 분류 방법 및 이를 실행하는 컴퓨터 프로그램이 기록된 기록매체가 제공된다. 본 발명의 일 실시 예에 따른 인공지능 학습 기반의 문서 분류 방법 및 이를 실행하는 컴퓨터 프로그램이 기록 된 기록매체는 학습 전에 사용자 정의 분류 수에 대한 분류 정확도를 계산하여 최적의 분류 수를 설정하는 단계, 최적의 분류 수에 따라 학습 모델의 구성 및 모델의 수를 구성하는 단계 및 학습 모델의 분류 학습을 실 행하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0132323", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시 예에 따르면, 학습문서에 표기된 사용자 정의 카테고리에 기초하여 딥러닝 기반 분류학습을 실행하여 도출된 분류모델을 활용하여 문서를 카데고리별로 분류할 수 있다."}
{"patent_id": "10-2021-0132323", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 설명 또는 청구범위에 기재된 발명의 구성 으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2021-0132323", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명을 설명하기로 한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며, 따라서 여기에서 설명하는 실시예로 한정되는 것은 아니다. 그리고 도면에서 본 발명을 명확 하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유 사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결(접속, 접촉, 결합)\"되어 있다고 할 때, 이는 \"직접적으로 연 결\"되어 있는 경우 뿐 아니라, 그 중간에 다른 부재를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한 다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 구비할 수 있다는 것을 의미한다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 도 1 및 도 2는 본 발명의 일 실시 예에 따른 인공지능 학습 기반의 문서 분류 장치를 설명하기 위한 도면들이 다. 도 1을 참조하면, 본 발명에 따른 인공지능 학습 기반의 문서 분류 장치는 전처리부, 모델 정의부 및 학습부를 포함할 수 있다. 전처리부는 학습 전에 사용자 정의 분류 수에 대한 분류 정확도를 계산하여 최적의 분류 수를 설정할 수 있다. 전처리부는 사용자가 카테고리별 폴더(k개)에 저장한 학습문서를 통해 분류학습모델을 생성하기에 앞서 문서 군 집간 유사도와 분류 정확도에 대한 선행 분석을 통해 학습기반의 분류모델 생성 시 필요한 분류 개수(n)에 대한 최적 값을 탐색할 수 있다. 모델 정의부는 최적의 분류 수에 따라 학습 모델의 구성 및 모델의 수를 구성할 수 있다. 모델 정의부는 사용자 가 정의한 문서 종류 개수(k)와 최적 문서분류개수(n)와의 차이가 있을 경우, 분류모델 구조를 계층적 구조로 정의해주는 부분으로, 계층 수준(level)과 계층별 개수(n1, n2, ...)를 자동으로 계산하고, 계층별 분류학습모 델(CNN, LSTM, BERT 등)을 설정할 수 있다. 학습부는 학습 모델의 분류 학습을 실행할 수 있다. 학습부는 모델정의부에서 설정한 계층적 구조 설정값과 선 택한 분류학습모델의 학습을 실행하여 문서분류 모델을 도출할 수 있다. 문서분류부는 학습 모델에 따라 문서를 분류할 수 있다. 도 2를 참조하면, 인공지능 학습 기반의 문서 분류 장치는 사용자 정의문서 개수가 10이고, 1차 분류 모델에서 의 최적 분류 개수가 K=7인 경우에 2차 분류학습 모델, 3차 분류학습모델을 추가하여 문서를 더욱 정확하게 분 류할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 인공지능 학습 기반의 문서 분류 방법을 설명하기 위한 도면들이다. 도 3을 참조하면, 본 발명에 따른 인공지능 학습 기반의 문서 분류 장치는 단계 S310에서 학습 전에 사용자 정 의 분류 수에 대한 분류 정확도를 계산하여 최적의 분류 수를 설정한다. 단계 S320에서 인공지능 학습 기반의 문서 분류 장치는 최적의 분류 수에 따라 학습 모델의 구성 및 모델의 수 를 구성한다. 단계 S320에서 인공지능 학습 기반의 문서 분류 장치는 학습 모델의 분류 학습을 실행한다. 상술한 인공지능 학습 기반의 문서 분류 방법은 컴퓨터가 읽을 수 있는 매체 상에 컴퓨터가 읽을 수 있는 코드 로 구현될 수 있다. 상기 컴퓨터로 읽을 수 있는 기록 매체는, 예를 들어 이동형 기록 매체(CD, DVD, 블루레이 디스크, USB 저장 장치, 이동식 하드 디스크)이거나, 고정식 기록 매체(ROM, RAM, 컴퓨터 구비형 하드 디스크) 일 수 있다. 상기 컴퓨터로 읽을 수 있는 기록 매체에 기록된 상기 컴퓨터 프로그램은 인터넷 등의 네트워크를 통하여 다른 컴퓨팅 장치에 전송되어 상기 다른 컴퓨팅 장치에 설치될 수 있고, 이로써 상기 다른 컴퓨팅 장치 에서 사용될 수 있다. 이상에서, 본 발명의 실시 예를 구성하는 모든 구성 요소들이 하나로 결합되거나 결합되어 동작하는 것으로 설 명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위안에서라 면, 그 모든 구성요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다.도면에서 동작들이 특정한 순서로 도시되어 있지만, 반드시 동작들이 도시된 특정한 순서로 또는 순차적 순서로 실행되어야만 하거나 또는 모든 도시 된 동작들이 실행되어야만 원하는 결과를 얻을 수 있는 것으로 이해되어서 는 안 된다. 특정 상황에서는, 멀티태스킹 및 병렬 처리가 유리할 수도 있다. 더욱이, 위에 설명한 실시 예 들 에서 다양한 구성들의 분리는 그러한 분리가 반드시 필요한 것으로 이해되어서는 안 되고, 설명된 프로그램 컴 포넌트들 및 시스템들은 일반적으로 단일 소프트웨어 제품으로 함께 통합되거나 다수의 소프트웨어 제품으로 패 키지 될 수 있음을 이해하여야 한다. 이제까지 본 발명에 대하여 그 실시 예들을 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통상의 지식 을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시 예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모 든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0132323", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 도 2는 본 발명의 일 실시 예에 따른 인공지능 학습 기반의 문서 분류 장치를 설명하기 위한 도면들이 다. 도 3은 본 발명의 일 실시 예에 따른 인공지능 학습 기반의 문서 분류 방법을 설명하기 위한 도면들이다."}
