{"patent_id": "10-2016-0156171", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0057839", "출원번호": "10-2016-0156171", "발명의 명칭": "사람 인식이 가능한 지능형 로봇 및 그 동작방법", "출원인": "주식회사 호보트", "발명자": "이승욱"}}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "원거리의 객체를 감지하여 객체 감지 신호를 생성하는 객체 감지부;상기 감지된 객체에 근접하는 경우 상기 객체를 촬영하여 객체 이미지 정보를 생성하는 카메라부;상기 객체가 사람인 경우, 상기 사람의 생체신호를 감지하는 생체신호 감지부; 및상기 객체 감지부로부터 입력받은 상기 객체 감지 신호를 분석하여 상기 객체가 사람으로 추정되는 경우 상기객체의 위치로 이동하도록 로봇 이동장치를 제어하며, 상기 카메라부로부터 입력받은 상기 객체 이미지 정보를분석하여 상기 객체가 사람으로 판단되는 경우, 상기 생체신호 감지부를 상기 사람의 특정 부위로 이동시켜 상기 사람의 생체신호를 획득하고 상기 사람의 생체신호를 분석하여 상기 사람의 신원을 확인하는 제어부를 포함하는 것을 특징으로 하는 사람 인식이 가능한 지능형 로봇."}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 객체 감지부는,초음파를 외부로 송신하고, 상기 객체로부터 반사된 초음파를 수신하여 상기 객체의 위치를 인식하는 초음파센서를 구비하는 것을 특징으로 하는 사람 인식이 가능한 지능형 로봇."}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 생체신호 감지부는, 상기 사람의 지문을 인식하여 지문인식 정보를 생성하는 지문인식센서를 포함하고,상기 제어부는,상기 지문인식센서로부터 입력받은 지문인식 정보를 기저장된 적어도 하나의 지문 정보와 비교하여 상기 사람의신원을 확인하는 것을 특징으로 하는 사람 인식이 가능한 지능형 로봇."}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 생체신호 감지부는,상기 사람의 체온을 감지하는 체온감지센서; 및상기 사람의 심장 박동을 측정하는 심박센서 중 적어도 하나를 더 포함하고,상기 제어부는,상기 체온감지센서로부터 입력받은 상기 사람의 체온 정보 또는 상기 심박센서로부터 입력받은 상기 사람의 심장 박동 정보로부터 상기 사람의 생사 여부를 확인하는 것을 특징으로 하는 사람 인식이 가능한 지능형 로봇."}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 생체신호 감지부는,상기 사람의 음성을 인식하여 음성인식 정보를 생성하는 음성인식센서를 더 포함하고,상기 제어부는,상기 음성인식센서로부터 입력받은 음성인식 정보를 분석하여 상기 사람의 연령 및 성별 중 적어도 하나를 추정하는 것을 특징으로 하는 사람 인식이 가능한 지능형 로봇."}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2018-0057839-3-제4항에 있어서, 상기 지능형 로봇은,상기 생체신호 감지부가 장착되고, 상기 제어부의 제어에 따라 동작하여 상기 생체신호 감지부를 상기 사람의특정 부위로 이동시키는 로봇암 장치를 더 포함하는 것을 특징으로 하는 사람 인식이 가능한 지능형 로봇."}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서, 상기 카메라부는,상기 사람의 얼굴을 촬영하여 얼굴인식 정보를 상기 제어부로 출력하고,상기 제어부는, 상기 카메라부로부터 입력받은 얼굴인식 정보를 기저장된 적어도 하나의 얼굴정보와 비교하여 상기 사람의 신원을 확인하는 것을 특징으로 하는 사람 인식이 가능한 지능형 로봇."}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 지능형 로봇은,상기 지능형 로봇의 위치 정보를 측정하는 위치측정부;상기 위치측정부에서 측정된 위치 정보 및 상기 제어부에서 상기 사람의 지문인식 정보 및 얼굴인식 정보로부터판단한 상기 사람의 신원 정보를 외부로 전송하는 통신부를 더 포함하는 것을 특징으로 하는 사람 인식이 가능한 지능형 로봇."}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 지능형 로봇은, 화재시 발생하는 연기를 감지하여 상기 제어부로 연기 감지 신호를 출력하는 연기감지센서를 더 포함하는 사람인식이 가능한 지능형 로봇."}
{"patent_id": "10-2016-0156171", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "객체 감지부가 원거리의 객체를 감지하여 객체 감지 신호를 생성하는 단계;제어부가 상기 객체 감지부로부터 입력받은 상기 객체 감지 신호를 분석하여 상기 객체가 사람으로 추정되는 경우 상기 객체의 위치로 이동하도록 로봇 이동장치를 제어하는 단계;상기 감지된 객체에 근접하는 경우, 상기 카메라부가 상기 객체를 촬영하여 객체 이미지 정보를 생성하는 단계;및상기 제어부가 상기 카메라부로부터 입력받은 상기 객체 이미지 정보를 분석하여 상기 객체가 사람으로 판단되는 경우, 생체신호 감지부를 상기 사람의 특정 부위로 이동시켜 상기 사람의 생체신호를 획득하고 상기 사람의생체신호를 분석하여 상기 사람의 신원을 확인하는 단계를 포함하는 것을 특징으로 하는 사람 인식이 가능한 지능형 로봇의 동작방법."}
{"patent_id": "10-2016-0156171", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사람 인식이 가능한 지능형 로봇 및 그 동작방법이 개시된다. 상기 사람 인식이 가능한 지능형 로봇은, 원거리의 객체를 감지하여 객체 감지 신호를 생성하는 객체 감지부, 상기 감지된 객체에 근접하는 경우 상기 객체를 촬영 하여 객체 이미지 정보를 생성하는 카메라부, 상기 객체가 사람인 경우, 상기 사람의 생체신호를 감지하는 생체 신호 감지부, 및 상기 객체 감지부로부터 입력받은 상기 객체 감지 신호를 분석하여 상기 객체가 사람으로 추정 되는 경우 상기 객체의 위치로 이동하도록 로봇 이동장치를 제어하며, 상기 카메라부로부터 입력받은 상기 객체 이미지 정보를 분석하여 상기 객체가 사람으로 판단되는 경우, 상기 생체신호 감지부를 상기 사람의 특정 부위로 이동시켜 상기 사람의 생체신호를 획득하고 상기 사람의 생체신호를 분석하여 상기 사람의 신원을 확인하는 제어 부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2016-0156171", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사람 인식이 가능한 지능형 로봇 및 그 동작방법에 관한 것으로서, 특히 원거리의 객체를 감지하고 상기 객체에 접근하여 상기 객체가 사람으로 판단되는 경우, 지문정보, 얼굴정보 등을 통해 신원을 확인하고, 체온 정보, 심장 박동 정보를 통해 생사 여부를 확인하여 위치 정보와 함께 외부로 전송할 수 있는 사람 인식이 가능한 지능형 로봇 및 그 동작방법에 관한 것이다."}
{"patent_id": "10-2016-0156171", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇(Robot)은 스스로 보유한 능력에 의해 주어진 일을 자동으로 처리하거나 작동하는 기계를 의미한다. 이러한 로봇은 산업용, 의료용, 우주용, 해저용 등 사람이 반복적으로 수행하기 어려운 작업이나 사람이 견디기 어려운 극한 환경의 작업에 투입되어 많은 도움을 주고 있다. 최근에는 인공지능이 결합된 형태의 로봇 기술도 많은 연구가 되고 있다. 한편, 산속이나 해상에서 조난 사고가 발생한 경우 사람의 접근이 어려운 곳까지 신속하게 이동할 수 있는 구조 용 로봇에 대한 수요도 꾸준히 증가하고 있다. 이러한 구조용 로봇 장치의 예로서 대한민국 공개특허 제10- 2015-0119639호가 공개된 바 있다. 그러나 이러한 종래의 구조용 로봇 장치는 선체의 운항 안정성 및 물체 탐사 는 가능하나, 사람을 인식하여 신원을 확인하는 등의 기능을 갖추고 있지 않아 정확한 구조 작업에 어려움을 겪 는 문제점이 있었다."}
{"patent_id": "10-2016-0156171", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로서, 원거리의 객체를 감지하고 상기 객체에 접근하여 상 기 객체가 사람으로 판단되는 경우, 지문정보, 얼굴정보 등을 통해 신원을 확인하고, 체온 정보, 심장 박동 정 보 등을 통해 생사 여부를 확인하여 위치 정보와 함께 외부로 전송할 수 있는 사람 인식이 가능한 지능형 로봇 및 그 동작방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2016-0156171", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여, 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇은, 원거리의 객체를 감지하여 객체 감지 신호를 생성하는 객체 감지부, 상기 감지된 객체에 근접하는 경우 상기 객체를 촬영 하여 객체 이미지 정보를 생성하는 카메라부, 상기 객체가 사람인 경우, 상기 사람의 생체신호를 감지하는 생체 신호 감지부, 및 상기 객체 감지부로부터 입력받은 상기 객체 감지 신호를 분석하여 상기 객체가 사람으로 추정 되는 경우 상기 객체의 위치로 이동하도록 로봇 이동장치를 제어하며, 상기 카메라부로부터 입력받은 상기 객체 이미지 정보를 분석하여 상기 객체가 사람으로 판단되는 경우, 상기 생체신호 감지부를 상기 사람의 특정 부위 로 이동시켜 상기 사람의 생체신호를 획득하고 상기 사람의 생체신호를 분석하여 상기 사람의 신원을 확인하는 제어부를 포함하는 것을 특징으로 한다. 바람직하게는, 상기 객체 감지부는, 초음파를 외부로 송신하고, 상기 객체로부터 반사된 초음파를 수신하여 상 기 객체의 위치를 인식하는 초음파센서를 구비할 수 있다. 또한 바람직하게는, 상기 생체신호 감지부는, 상기 사람의 지문을 인식하여 지문인식 정보를 생성하는 지문인식 센서를 포함하고, 상기 제어부는, 상기 지문인식센서로부터 입력받은 지문인식 정보를 기저장된 적어도 하나의 지문 정보와 비교하여 상기 사람의 신원을 확인할 수 있다. 또한 바람직하게는, 상기 생체신호 감지부는, 상기 사람의 체온을 감지하는 체온감지센서, 및 상기 사람의 심장 박동을 측정하는 심박센서 중 적어도 하나를 더 포함하고, 상기 제어부는, 상기 체온감지센서로부터 입력받은 상기 사람의 체온 정보 또는 상기 심박센서로부터 입력받은 상기 사람의 심장 박동 정보로부터 상기 사람의 생 사 여부를 확인할 수 있다. 또한 바람직하게는, 상기 생체신호 감지부는, 상기 사람의 음성을 인식하여 음성인식 정보를 생성하는 음성인식 센서를 더 포함하고, 상기 제어부는, 상기 음성인식센서로부터 입력받은 음성인식 정보를 분석하여 상기 사람의 연령 및 성별 중 적어도 하나를 추정할 수 있다. 또한 바람직하게는, 상기 지능형 로봇은, 상기 생체신호 감지부가 장착되고, 상기 제어부의 제어에 따라 동작하 여 상기 생체신호 감지부를 상기 사람의 특정 부위로 이동시키는 로봇암 장치를 더 포함할 수 있다. 또한 바람직하게는, 상기 카메라부는, 상기 사람의 얼굴을 촬영하여 얼굴인식 정보를 상기 제어부로 출력하고, 상기 제어부는, 상기 카메라부로부터 입력받은 얼굴인식 정보를 기저장된 적어도 하나의 얼굴정보와 비교하여 상기 사람의 신원을 확인할 수 있다. 또한 바람직하게는, 상기 지능형 로봇은, 상기 지능형 로봇의 위치 정보를 측정하는 위치측정부, 상기 위치측정 부에서 측정된 위치 정보 및 상기 제어부에서 상기 사람의 지문인식 정보 및 얼굴인식 정보로부터 판단한 상기 사람의 신원 정보를 외부로 전송하는 통신부를 더 포함할 수 있다. 또한 바람직하게는, 상기 지능형 로봇은, 화재시 발생하는 연기를 감지하여 상기 제어부로 연기 감지 신호를 출 력하는 연기감지센서를 더 포함할 수 있다.상기와 같은 목적을 달성하기 위하여, 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법 은, 객체 감지부가 원거리의 객체를 감지하여 객체 감지 신호를 생성하는 단계, 제어부가 상기 객체 감지부로부 터 입력받은 상기 객체 감지 신호를 분석하여 상기 객체가 사람으로 추정되는 경우 상기 객체의 위치로 이동하 도록 로봇 이동장치를 제어하는 단계, 상기 감지된 객체에 근접하는 경우, 상기 카메라부가 상기 객체를 촬영하 여 객체 이미지 정보를 생성하는 단계, 및 상기 제어부가 상기 카메라부로부터 입력받은 상기 객체 이미지 정보 를 분석하여 상기 객체가 사람으로 판단되는 경우, 생체신호 감지부를 상기 사람의 특정 부위로 이동시켜 상기 사람의 생체신호를 획득하고 상기 사람의 생체신호를 분석하여 상기 사람의 신원을 확인하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2016-0156171", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따른 사람 인식이 가능한 지능형 로봇 및 그 동작방법은, 원거리의 객체를 감지하고 상 기 객체에 접근하여 상기 객체가 사람으로 판단되는 경우, 지문정보, 얼굴정보 등을 통해 신원을 확인하고, 체 온 정보, 심장 박동 정보를 통해 생사 여부를 확인하여 위치 정보와 함께 외부로 전송할 수 있는 효과가 있다."}
{"patent_id": "10-2016-0156171", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 실시예들은 첨부된 도면들을 참조하여 설명한다. 각 도면의 구성요소들에 참조부호를 부 가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지 도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대 한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 이하에서 본 발명의 실시예들을 설명할 것이나, 본 발명의 기술적 사상은 이에 한정되거나 제 한되지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외 하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 도 1은 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇 시스템을 나타내는 블록 다이어그램이다. 도 1을 참조하면, 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇 시스템은, 사람 인식이 가 능한 지능형 로봇, 사용자 단말기 및 로봇 관리 서버를 포함할 수 있다. 도 1에 도시된 바와 같 이, 사람 인식이 가능한 지능형 로봇, 사용자 단말기 및 로봇 관리 서버는 유무선 통신망 을 이용해 서로 유선 또는 무선으로 통신할 수 있다. 상기 유무선 통신망은, 유선 또는 무선으로 통신이 가능한 통신망(Communication Network)으로서 통신 양태를 특별하게 가리지 않고 구성될 수 있으며, 단거리 통 신망(PAN; Personal Area Network), 근거리 통신망(LAN; Local Area Network), 도시권 통신망(MAN; Metropolitan Area Network), 광역 통신망(WAN; Wide Area Network) 등 다양한 통신망으로 구성될 수 있다. 또 한, 상기 유무선 통신망은 공지의 월드와이드웹(WWW; World Wide Web)일 수 있으며, 적외선(IrDA; Infrared Data Association) 또는 블루투스(Bluetooth)와 같이 단거리 통신에 이용되는 무선 전송 기술을 이용 할 수도 있다. 상기 유무선 통신망은 통상의 기술자에게 널리 알려져 있으므로 자세한 설명은 생략한다. 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇은, 객체 감지부, 카메라부, 생체신 호 감지부 및 제어부를 포함할 수 있다. 또한 실시예에 따라, 상기 사람 인식이 가능한 지능형 로봇 은, 연기감지센서, 저장부, 위치측정부 및 통신부를 더 포함할 수 있다. 객체 감지부는, 원거리의 객체를 감지하여 객체 감지 신호를 생성할 수 있다. 일례로서, 상기 객체 감지부 는, 초음파를 외부로 송신하고, 상기 객체로부터 반사된 초음파를 수신하여 상기 객체의 위치를 인식하는 초음파센서를 구비할 수 있다. 상기 초음파센서는, 사람이 인지할 수 없는 약 20KHz 이상의 주파수를 갖는 초음 파를 이용한 센서로서, 초음파 센서에 이용되는 파장은 매체의 음속과 음파의 주파수에 따라 결정될 수 있다. 상기 초음파 센서는 초음파를 외부로 송신하는 발신소자와 객체로부터 반사된 초음파를 수신하는 수신소자를 구 비할 수 있다. 또한, 실시예에 따라, 상기 객체 감지부는 마이크로파(극초단파)와 같은 전자기파를 외부로 송신하고 객체로부터 반사된 전자기파를 수신하여 객체의 거리나 방향 등을 알 수 있는 레이더 장치를 구비할 수도 있다. 카메라부는, 지능형 로봇이 상기 감지된 객체에 근접하는 경우 객체를 촬영하여 객체 이미지 정보를 생성할 수 있다. 카메라부는 생성된 객체 이미지 정보를 제어부로 전송할 수 있다. 상기 카메라부 는 객체의 이미지를 촬영할 수 있는 다양한 영상 촬영 모듈로 구현될 수 있으며 다양하게 변경될 수 있다. 생체신호 감지부는, 상기 객체가 사람인 경우 상기 사람의 생체신호를 감지할 수 있다. 일례로서, 상기 생 체신호 감지부는, 지문인식센서, 체온감지센서, 심박센서 및 음성인식센서 중 적어도 하나를 포함할 수 있다. 제어부는, 객체 감지부로부터 입력받은 객체 감지 신호를 분석하여 상기 객체가 사람으로 추정되는 경우 상기 객체의 위치로 지능형 로봇이 이동하도록 로봇 이동장치(미도시)를 제어할 수 있다. 상기 로봇 이동장치는 지능형 로봇이 수상으로 이동하거나 공중으로 이동할 수 있는 다양한 형태의 추진 장치로 구현 될 수 있으며, 실시예에 따라 지능형 로봇에 드론이 결합될 수도 있다. 상기 제어부는, 지능형 로봇 의 다양한 구성요소를 제어하고 다양한 데이터를 처리하는 구성요소로서, CPU 프로세서와 같은 중앙처리장 치에 의해 구현될 수 있다. 지능형 로봇이 상기 객체에 근접하는 경우 카메라부가 상기 객체를 촬영하여 객체 이미지 정보를 생 성할 수 있다. 제어부는, 상기 카메라부로부터 입력받은 상기 객체 이미지 정보를 분석하여 상기 객 체가 사람으로 판단되는 경우, 상기 생체신호 감지부를 상기 사람의 특정 부위로 이동시켜 상기 사람의 생 체신호를 획득하고 상기 사람의 생체신호를 분석하여 상기 사람의 신원을 확인할 수 있다. 본 발명의 일실시예에 따른 지능형 로봇은, 상기 생체신호 감지부가 장착되고, 제어부의 제어에 따라 동작하여 생체신호 감지부를 상기 사람의 특정 부위로 이동시키는 로봇암 장치(미도시)를 더 포함할 수 있다. 일례로서, 사람의 특정 부위는 지문이 존재하는 손가락 부위일 수 있고, 제어부는 카메라부(12 0)로부터 입력받은 객체 이미지 정보를 통해 사람의 손 부위를 인식하여 로봇암 장치가 손 부위로 이동하도록 제어할 수 있다. 이에 따라, 로봇암 장치에 구비되는 지문인식센서, 체온감지센서, 심박센서 등 이 사용자의 손가락이나 다른 신체부위에 접촉되어 상기 사람의 지문인식 정보, 체온 정보, 심장 박동 정보 등 을 측정할 수 있게 된다. 일례로서, 상기 로봇암 장치는 로봇의 팔 형태로 제작될 수 있고, 제어부에 의해 제어될 수 있는 다양한 기계 장치로 구현될 수 있다. 상기 생체신호 감지부는, 사람의 지문을 인식하여 지문인식 정보를 생성하는 지문인식센서를 포함할 수 있다. 지문인식센서는 사람의 지문인식 정보를 제어부로 전송할 수 있고, 제어부는, 지문인 식센서로부터 입력받은 지문인식 정보를 기저장된 적어도 하나의 지문 정보와 비교하여 상기 사람의 신원 을 확인할 수 있다. 상기 지문인식센서는 CCD 카메라를 이용하는 광학 스캐너 방식 또는 CMOS 소자를 이용 하는 비광학 스캐너 방식 등으로 구현될 수 있다. 상기 적어도 하나의 지문정보는 다수의 사람의 지문정보를 포 함할 수 있으며 저장부에 저장될 수 있다. 제어부는, 지문인식센서로부터 입력받은 지문인식 정보를 분석하여 그래디언트 기반 지문 특징을 추 출할 수 있다. 또한, 제어부는, 지문인식 정보로부터 지문영역을 추출하고 지문의 융선과 골에 기초한 특 이점 정보를 추출할 수 있다. 제어부는 상기 그래디언트 기반 지문 특징 또는 상기 특이점 정보를 이용하 여 기저장된 적어도 하나의 지문정보 중에서 해당 지문인식 정보와 일치되는 지문정보를 검출할 수 있다. 또한, 실시예에 따라, 상기 적어도 하나의 지문정보는 로봇 관리 서버의 지문정보 데이터베이스(미도시)에 저장될 수도 있다. 이 경우, 상기 제어부는 지문인식센서로부터 입력받은 지문인식 정보를 통신부 를 통해 로봇 관리 서버로 전송할 수 있으며, 로봇 관리 서버는 지문정보 데이터베이스에 저장 된 적어도 하나의 지문정보 중에서 지능형 로봇으로부터 전송받은 지문인식 정보와 일치되는 지문정보를 검출할 수 있다. 로봇 관리 서버는 검출된 지문정보 및 상기 지문정보에 대응되는 신원 확인 정보를 지능 형 로봇 또는 사용자 단말기로 전송할 수 있다.실시예에 따라, 상기 생체신호 감지부는, 상기 사람의 체온을 감지하는 체온감지센서 및 상기 사람의 심장 박동을 측정하는 심박센서 중 적어도 하나를 더 포함할 수 있다. 체온감지센서는 사람의 체온 정보를 제어부로 전송할 수 있고, 심박센서는 사람의 심장 박동 정보를 제어부로 전송할 수 있 다. 제어부는, 상기 체온감지센서로부터 입력받은 상기 사람의 체온 정보 또는 상기 심박센서로 부터 입력받은 상기 사람의 심장 박동 정보로부터 상기 사람의 생사 여부를 확인할 수 있다. 실시예에 따라, 상기 생체신호 감지부는, 상기 사람의 음성을 인식하여 음성인식 정보를 생성하는 음성인 식센서를 더 포함할 수 있다. 음성인식센서는 사람의 음성인식 정보를 제어부로 전송할 수 있다. 제어부는 음성인식센서로부터 입력받은 음성인식 정보를 분석하여 상기 객체가 사람인지 여부 를 판단할 수 있고, 상기 음성인식 정보를 기저장된 연령 및 성별에 따른 음성 패턴들과 비교하여 상기 사람의 연령 및 성별 중 적어도 하나를 추정할 수 있다. 실시예에 따라, 상기 카메라부는 상기 사람의 얼굴을 촬영하여 얼굴인식 정보를 제어부로 출력할 수 있다. 제어부는 객체 이미지 정보에서 사람의 얼굴 부위를 검출할 수 있고 카메라부를 제어하여 상기 사람의 얼굴을 촬영하도록 할 수 있다. 제어부는, 상기 카메라부로부터 입력받은 얼굴인식 정보를 기 저장된 적어도 하나의 얼굴정보와 비교하여 상기 사람의 신원을 확인할 수 있다. 일례로서, 상기 제어부는 얼굴인식 정보에서 이미지 영역을 분할하여 눈썹과 입술 아래 사이의 영역을 인식할 수 있고, 눈, 코, 입, 이마 등의 특징점을 생성하고 각 특징점 간의 연계를 통해 깊이(Depth) 정보를 파악할 수 있다. 제어부는 상기 얼굴인식 정보에서 추출한 특징점을 이용하여 기저장된 적어도 하나의 얼굴정보 중에서 해당 얼굴인식 정보와 일치되는 얼굴정보를 검출할 수 있다. 상기 적어도 하나의 얼굴정보는 다수의 사람의 얼굴정보를 포함할 수 있 으며 저장부에 저장될 수 있다. 또한, 실시예에 따라, 상기 적어도 하나의 얼굴정보는 로봇 관리 서버의 얼굴정보 데이터베이스(미도시)에 저장될 수도 있다. 이 경우, 상기 제어부는 카메라부로부터 입력받은 얼굴인식 정보를 통신부를 통해 로봇 관리 서버로 전송할 수 있으며, 로봇 관리 서버는 얼굴정보 데이터베이스에 저장된 적어도 하나의 얼굴정보 중에서 지능형 로봇으로부터 전송받은 얼굴인식 정보와 일치되는 얼굴정보를 검출할 수 있다. 로봇 관리 서버는 검출된 얼굴정보 및 상기 얼굴정보에 대응되는 신원 확인 정보를 지능형 로봇 또는 사용자 단말기로 전송할 수 있다. 또한, 실시예에 따라, 상기 제어부는 카메라부로부터 입력받은 얼굴인식 정보로부터 상기 사람의 연 령을 추정할 수 있다. 즉, 제어부는, 연령별로 얼굴정보 패턴이 다르게 나타나는 점을 이용하여 상기 얼굴 인식 정보를 기저장된 연령별 얼굴정보 패턴들과 비교하여 상기 사람의 연령을 추정할 수 있다. 실시예에 따라, 상기 제어부는 카메라부로부터 입력받은 얼굴인식 정보에서 안구 이미지 정보를 추출 할 수 있다. 제어부는, 상기 안구 이미지 정보를 기저장된 적어도 하나의 홍채정보와 비교하여 상기 사람 의 신원을 확인할 수 있다. 제어부는 안구 이미지 정보에서 동공 영역을 추출한 후, 홍채의 경계, 홍채 외 부를 둘러싼 공막과의 경계 등을 데이터화하여 기저장된 적어도 하나의 홍채정보와 비교할 수 있다. 상기 적어 도 하나의 홍채정보는 다수의 사람의 홍채정보를 포함할 수 있으며 저장부에 저장될 수 있다. 또한, 실시 예에 따라, 상기 적어도 하나의 홍채정보는 로봇 관리 서버의 홍채정보 데이터베이스(미도시)에 저장될 수 도 있다. 연기감시센서는, 화재시 발생하는 연기를 감지하여 상기 제어부로 연기 감지 신호를 출력할 수 있다. 상기 연기감지센서는 화재 발생시 완전 연소되지 않은 가연물인 미세 입자가 공기 중에 떠다니는 것을 검 출하는 장치로서, 감광식, 광산란식, 이온화식 등의 방식으로 구현될 수 있다. 제어부는 연기감지센서 로부터 연기 감지 신호를 입력받는 경우, 위치측정부에서 측정된 지능형 로봇의 위치 정보와 함 께 화재 경보 신호를 생성하여 사용자 단말기 또는 로봇 관리 서버로 전송할 수 있다. 저장부는, 지능형 로봇을 구동하는 운영체제(OS), 프로그램이 저장될 수 있고, 실시예에 따라, 적어 도 하나의 지문정보, 적어도 하나의 얼굴정보 및 적어도 하나의 홍채정보 등을 저장할 수 있다. 저장부는, 통상의 기술자에게 알려진 바와 같이 ROM(Read Only Memory), RAM(Random Access Memory), EEPROM(Electrically Erasable and Programmable Read Only Memory) 등과 같은 다양한 형태의 메모리 저장장치 로 구현될 수 있다. 위치측정부는 지능형 로봇의 위치 정보를 측정하여 측정 결과를 제어부로 전송할 수 있다. 상기 위치측정부는 GPS(Global Positioning System) 위성에서 보내는 신호를 수신하여 현재 위치를 측정할 수있는 GPS모듈이나 WiFi 측위 장치 등 다양한 위치측정장치로 구현될 수 있다. 통신부는 유무선 통신망을 통해 사용자 단말기 및 로봇 관리 서버와 데이터를 주고 받을 수 있다. 통신부는, 상기 위치측정부에서 측정된 위치 정보 및 상기 제어부에서 상기 사람의 지 문인식 정보 및 얼굴인식 정보 등으로부터 판단한 상기 사람의 신원 정보를 외부로 전송할 수 있다. 일례로서, 각종 사고로 바다 등에 조난당한 사람을 지능형 로봇이 발견한 후 통신부를 통해 지능형 로봇의 위치 정보 및 사람의 신원 정보를 사용자 단말기 또는 로봇 관리 서버로 전송할 수 있다. 이에 따라, 상기 위치 정보 및 신원 정보를 이용하여 보다 신속하고 정확하게 구조 활동이 이루어질 수 있게 된다. 상기 통 신부는 WCDMA(Wideband Code Division Multiple Access), LTE(Long Term Evolution), WiBro(Wireless Broadband Internet) 및 WiFi(Wireless Fidelity) 등과 같은 다양한 무선통신방법 중 적어도 하나를 지원하는 통신모듈로 구현될 수 있다. 통신부는 상술한 바와 같은 다양한 통신방법 중 적어도 하나를 지원하는 통신 모듈로 구현될 수 있으며, 통상의 기술자에게 알려진 범위에서 다양하게 변경될 수 있다. 한편, 본 발명의 일실시예에 따른 지능형 로봇은, 지능형 로봇이 수중으로 잠수하는 경우 지능형 로 봇의 수심을 측정할 수 있는 수심측정센서(미도시)를 더 포함할 수 있다. 제어부는 수심측정센서로부 터 지능형 로봇의 수심을 입력받을 수 있고, 이를 지능형 로봇의 위치 정보와 함께 사용자 단말기 또는 로 봇 관리 서버로 전송할 수 있다. 이에 따라, 지능형 로봇이 수중에서 객체를 발견하는 경우에는 해당 객체의 위치 정보뿐만 아니라 수심 정보도 함께 외부로 전송할 수 있게 된다. 한편, 본 발명의 일실시예에 따른 지능형 로봇은, 지능형 로봇의 현재 자세를 판단하기 위한 모션센 서(미도시)를 더 구비할 수 있다. 상기 모션센서는 가속도 센서 및 자이로스코프 등을 포함할 수 있으며, 제어 부는 상기 모션센서에서 감지된 자세 정보를 이용하여 지능형 로봇의 자세를 제어할 수 있다. 사용자 단말기는 지능형 로봇으로부터 위치 정보 및 신원 확인 정보 등을 전송받을 수 있고, 사용자 의 입력에 따라 로봇 관리 서버에 접속하여 지능형 로봇의 위치 정보 및 신원 확인 정보를 확인할 수도 있 다. 또한, 실시예에 따라 상기 사용자 단말기는 지능형 로봇을 원격으로 제어하거나, 지능형 로봇 을 통해 조난자와 통신을 할 수도 있다. 사용자 단말기는, 사용자 컴퓨터(PC), 휴대폰, 스마트폰, 태 블릿 PC, 노트북 컴퓨터 등 유선 또는 무선으로 지능형 로봇 또는 로봇 관리 서버와 데이터 통신이 가능한 다양한 형태의 단말기 또는 전자 장비일 수 있고, 통상의 기술자에게 알려진 범위에서 다양하게 변경될 수 있다. 로봇 관리 서버는, 적어도 하나의 지문정보를 저장하는 지문정보 데이터베이스, 적어도 하나의 얼굴정보를 저장하는 얼굴정보 데이터베이스, 적어도 하나의 홍채정보를 저장하는 홍채정보 데이터베이스 등을 구비할 수 있다. 실시예에 따라, 상기 로봇 관리 서버는, 지능형 로봇으로부터 지문인식 정보, 얼굴인식 정보 및 홍채인식 정보 등을 전송받을 수 있다. 로봇 관리 서버는 데이터베이스에 저장된 적어도 하나의 지문정 보, 적어도 하나의 얼굴정보 및 적어도 하나의 홍채정보 중에서 지능형 로봇으로부터 전송받은 지문인식 정보, 얼굴인식 정보, 홍채인식 정보와 일치되는 지문정보, 얼굴정보, 홍채정보를 검출할 수 있다. 로봇 관리 서버는 검출된 지문정보, 얼굴정보, 홍채정보를 통해 상기 사람의 신원을 확인할 수 있고, 신원 확인 정보 를 지능형 로봇 또는 사용자 단말기로 전송할 수 있다. 상기 지문정보 데이터베이스, 얼굴정보 데이 터베이스, 홍채정보 데이터베이스 등은 통상의 기술자에게 알려진 다양한 데이터 저장 장치에 의해 구현될 수 있다. 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇은, 원거리의 객체를 감지하고 상기 객체에 접 근하여 상기 객체가 사람으로 판단되는 경우, 지문정보, 얼굴정보 등을 통해 신원을 확인하고, 체온 정보, 심장 박동 정보를 통해 생사 여부를 확인하여 위치 정보와 함께 사용자 단말기 또는 로봇 관리 서버로 알 릴 수 있는 효과가 있다. 이를 통해, 상기 사람 인식이 가능한 지능형 로봇은, 각종 사고로 바다 등에 조 난당한 사람을 탐색하고 확인할 수 있어 인명 구조용으로 사용될 수 있다. 또한, 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇은, 사람의 얼굴인식 정보, 음성인식 정 보 등을 통해 신원 및 연령 등을 판단하여 사람이 아이로 판단되는 경우 아이와 대화 등을 통해 놀아줄 수 있고, 사람이 치매환자인 경우에는 대화 등을 통해 치료를 도울 수도 있다. 즉, 본 발명의 일실시예에 따른 사 람 인식이 가능한 지능형 로봇은, 인공지능 감성 로봇 또는 사용자 맞춤형 인터랙티브 로봇으로 활용될 수 도 있다.도 2는 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법을 나타내는 순서도(Flowchart) 이다. 도 2에 도시된 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은 도 1을 참 조하여 상술한 사람 인식이 가능한 지능형 로봇에 의해 수행될 수 있다. 도 2를 참조하면, 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 객체 감지부 가 원거리의 객체를 감지하여 객체 감지 신호를 생성하는 단계(S21)를 포함할 수 있다. 객체 감지부 는 상기 객체 감지 신호를 제어부로 전송할 수 있다. 다음으로, 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 제어부가 상기 객체 감지부로부터 입력받은 상기 객체 감지 신호를 분석하여 상기 객체가 사람으로 추정되는 경우 상기 객체의 위치로 이동하도록 로봇 이동장치를 제어하는 단계(S22)를 포함할 수 있다. 제어부는 상기 객체 감 지 신호를 분석하여 객체의 움직임, 형태 등을 분석할 수 있고 이로부터 상기 객체가 사람인지 여부를 추정할 수 있다. 다음으로, 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 상기 감지된 객체에 근접하는 경우, 상기 카메라부가 상기 객체를 촬영하여 객체 이미지 정보를 생성하는 단계(S23)를 포함할 수 있다. 카메라부는 객체 이미지 정보를 제어부로 전송할 수 있다. 다음으로, 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 상기 제어부가 상기 카메라부로부터 입력받은 상기 객체 이미지 정보를 분석하여 상기 객체가 사람으로 판단되는 경우, 상기 생체신호 감지부를 상기 사람의 특정 부위로 이동시켜 상기 사람의 생체신호를 획득하고 상기 사람의 생체신호를 분석하여 상기 사람의 신원을 확인하는 단계(S24)를 포함할 수 있다. 일례로서, 상기 제어부는 카메라부로부터 입력받은 객체 이미지 정보에서 인체의 중요 관절 부위를 복수 개의 점으로 표시하고 상기 복수 개의 점들의 연결 관계 및 상대적인 위치 정보 등을 분석하여 상기 객체가 사람인지 여부를 판단할 수 있 다. 도 3은 본 발명의 다른 실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법을 나타내는 순서도이다. 도 3에 도시된 본 발명의 다른 실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은 도 1을 참조하여 상술한 사람 인식이 가능한 지능형 로봇에 의해 수행될 수 있다. 도 3을 참조하면, 본 발명의 다른 실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 객체 감 지부가 원거리의 객체를 감지하여 객체 감지 신호를 생성하는 단계(S31), 제어부가 객체 감지부(11 0)로부터 입력받은 상기 객체 감지 신호를 분석하여 상기 객체가 사람으로 추정되는 경우 상기 객체의 위치로 이동하도록 로봇 이동장치를 제어하는 단계(S32) 및 상기 감지된 객체에 근접하는 경우, 상기 카메라부가 상기 객체를 촬영하여 객체 이미지 정보를 생성하는 단계(S33)를 포함할 수 있다. 도 3에 도시된 S31, S32, S33 단계는 도 2를 참조하여 상술한 S21, S22, S23 단계와 유사하므로 자세한 설명은 생략한다. 다음으로, 본 발명의 다른 실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 제어부가 카메라부로부터 입력받은 상기 객체 이미지 정보 및 음성인식센서로부터 입력받은 음성인식 정보 중 적어도 하나를 분석하여 상기 객체가 사람인지 여부를 판단하는 단계(S34)를 포함할 수 있다. 다음으로, 본 발명의 다른 실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 상기 객체가 사 람으로 판단되는 경우, 제어부가 로봇암 장치를 제어하여 생체신호 감지부를 사람의 특정 부위로 이 동시켜 상기 사람의 지문인식 정보, 체온 정보 및 심장 박동 정보를 획득하고, 카메라부가 상기 사람의 얼 굴을 촬영하여 얼굴인식 정보 및 홍채인식 정보를 획득하는 단계(S35)를 포함할 수 있다. 다음으로, 본 발명의 다른 실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 제어부가 상기 지문인식 정보를 기저장된 적어도 하나의 지문 정보와 비교하고, 상기 얼굴인식 정보를 기저장된 적어도 하나의 얼굴정보와 비교하며, 상기 홍채인식 정보를 기저장된 적어도 하나의 홍채정보와 비교하여 상기 사람의 신원을 확인하는 단계(S36)를 포함할 수 있다. 다음으로, 본 발명의 다른 실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 제어부가 상기 사람의 체온 정보 또는 상기 사람의 심장 박동 정보로부터 상기 사람의 생사 여부를 확인하는 단계(S37)를 포함할 수 있다. 제어부는 상기 사람의 음성인식 정보를 이용하여 사람의 생사 여부를 판단할 수도 있다. 다음으로, 본 발명의 다른 실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 위치측정부(17 0)에서 측정된 위치 정보, 상기 사람의 신원 정보 및 상기 사람의 생사 여부를 통신부가 로봇 관리 서버 또는 사용자 단말기로 전송하는 단계(S38)를 포함할 수 있다. 한편, 본 발명에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은 도 2 내지 도 3을 참조하여 상술한 사람 인식이 가능한 지능형 로봇의 동작방법을 수행하는 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록매체에 의해 수행될 수 있다. 또한, 본 발명에 따른 사람 인식이 가능한 지능형 로봇의 동작방법은, 하드웨어와 결합되어 도 2 내지 도 3을 참조하여 상술한 사람 인식이 가능한 지능형 로봇의 동작방법을 실행시키기 위하여 매체에 저장 된 컴퓨터프로그램에 의해 수행될 수 있다. 본 발명에 따른 사람 인식이 가능한 지능형 로봇의 동작방법을 컴퓨 터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있 는 기록매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함하며, 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광데이터 저장장치 등이 있다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으 로 컴퓨터가 읽을 수 있는 코드로 저장되고 실행될 수도 있다."}
{"patent_id": "10-2016-0156171", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한편, 도 2 내지 도 3에 도시된 단계들의 순서는 예시적인 것으로서 본 발명의 효과를 상실하지 않는 범위에서 그 순서가 다양하게 변경되거나 조합될 수 있고, 실시예에 따라 특정 단계가 생략될 수도 있다. 본 명세서에 기재된 다양한 실시예들은 하드웨어, 미들웨어, 마이크로코드, 소프트웨어 및/또는 이들의 조합에 의해 구현될 수 있다. 예를 들어, 다양한 실시예들은 하나 이상의 주문형 반도체(ASIC)들, 디지털 신호 프로세 서(DSP)들, 디지털 신호 프로세싱 디바이스(DSPD)들, 프로그램어블 논리 디바이스(PLD)들, 필드 프로그램어블 게이트 어레이(FPGA)들, 프로세서들, 컨트롤러들, 마이크로컨트롤러들, 마이크로프로세서들, 여기서 제시되는 기능들을 수행하도록 설계되는 다른 전자 유닛들 또는 이들의 조합 내에서 구현될 수 있다. 또한, 예를 들어, 다양한 실시예들은 명령들을 포함하는 컴퓨터-판독가능한 매체에 수록되거나 인코딩될 수 있 다. 컴퓨터-판독가능한 매체에 수록 또는 인코딩된 명령들은 프로그램 가능한 프로세서 또는 다른 프로세서로 하여금 예컨대, 명령들이 실행될 때 방법을 수행하게끔 할 수 있다. 컴퓨터-판독가능한 매체는 컴퓨터 저장 매 체, 및 하나의 장소로부터 다른 장소로 컴퓨터 프로그램의 이송을 용이하게 하는 임의의 매체를 포함하는 통신 매체 모두를 포함한다. 저장 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수도 있다. 예를 들 어, 이러한 컴퓨터-판독가능한 매체는 RAM, ROM, EEPROM, CD-ROM 또는 기타 광학 디스크 저장 매체, 자기 디 스크 저장 매체 또는 기타 자기 저장 디바이스, 또는 원하는 프로그램 코드를 컴퓨터에 의해 액세스가능한 명 령들 또는 데이터 구조들의 형태로 반송하거나 저장하는데 이용될 수 있는 임의의 다른 매체를 포함할 수 있다. 이러한 하드웨어, 소프트웨어, 펌웨어 등은 본 명세서에 기술된 다양한 동작들 및 기능들을 지원하도록 동일한 디바이스 내에서 또는 개별 디바이스들 내에서 구현될 수 있다. 추가적으로, 본 발명에서 \"~부\"로 기재된 구성 요소들, 유닛들, 모듈들, 컴포넌트들 등은 함께 또는 개별적이지만 상호 운용가능한 로직 디바이스들로서 개별 적으로 구현될 수 있다. 모듈들, 유닛들 등에 대한 서로 다른 특징들의 묘사는 서로 다른 기능적 실시예들을 강 조하기 위해 의도된 것이며, 이들이 개별 하드웨어 또는 소프트웨어 컴포넌트들에 의해 실현되어야만 함을 필수 적으로 의미하지 않는다. 오히려, 하나 이상의 모듈들 또는 유닛들과 관련된 기능은 개별 하드웨어 또는 소프트 웨어 컴포넌트들에 의해 수행되거나 또는 공통의 또는 개별의 하드웨어 또는 소프트웨어 컴포넌트들 내에 통합 될 수 있다. 특정한 순서로 동작들이 도면에 도시되어 있지만, 이러한 동작들이 원하는 결과를 달성하기 위해 도시된 특정한 순서, 또는 순차적인 순서로 수행되거나, 또는 모든 도시된 동작이 수행되어야 할 필요가 있는 것으로 이해되지 말아야 한다. 임의의 환경에서는, 멀티태스킹 및 병렬 프로세싱이 유리할 수 있다. 더욱이, 상술한 실시예에서 다양한 구성요소들의 구분은 모든 실시예에서 이러한 구분을 필요로 하는 것으로 이해되어서는 안되며, 기술된 구성요소들이 일반적으로 단일 소프트웨어 제품으로 함께 통합되거나 다수의 소프트웨어 제품으로 패키징될 수 있다는 것이 이해되어야 한다. 본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 다른 실시 예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의해서 정해져야 할 것이다."}
{"patent_id": "10-2016-0156171", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇 시스템을 나타내는 블록 다이어그램이다. 도 2는 본 발명의 일실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법을 나타내는 순서도(Flowchart) 이다. 도 3은 본 발명의 다른 실시예에 따른 사람 인식이 가능한 지능형 로봇의 동작방법을 나타내는 순서도이다."}
