{"patent_id": "10-2022-0019430", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0122790", "출원번호": "10-2022-0019430", "발명의 명칭": "동작교정을 위한 인공지능 코칭 시스템", "출원인": "공은하", "발명자": "김태완"}}
{"patent_id": "10-2022-0019430", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "동작교정을 위한 코칭 시스템에 있어서,설정된 동작을 수행하는 대상자를 둘러 설치되는 레일부(11)와, 상기 레일부(11)를 따라 이동하며 복수의 거치부(161)를 구비한 거치구조체(16)가 상측으로 형성된 메인이동체(12)로 구성되는 프레임구조체(1);상기 거치부(161)에 장착되며 대상자를 촬영하는 카메라(21)를 구비하는 학습단말기(2);상기 메인이동체(12)의 움직임에 대응하여 상기 카메라(21)를 통해 수집된 영상을 수집하고 동작별로 정리하는영상분류부(31)와, 분류된 동작별 영상에서 관절부위를 기준으로 하는 제1동작데이터를 추출하는 제1속성추출부(32)와, 상기 제1동작데이터를 학습하며 기준정보를 생성하는 영상학습부(33)를 구비하는 학습모듈(3);카메라를 구비한 사용자단말기를 통해 촬영된 동작 영상을 분석하여 관절부위를 기준으로 하는 제2동작데이터를추출하는 제2속성추출부(41)와, 상기 제2동작데이터를 기준정보와 비교하여 보정정보를 생성하는 판단부(42)와,상기 보정정보를 영상 및 음성을 통해 출력하는 안내부(43)를 구비하는 코칭모듈(4); 로 이루어지는 것을 특징으로 하는 동작교정을 위한 인공지능 코칭 시스템."}
{"patent_id": "10-2022-0019430", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 레일부(11)는,길이방향을 따라 관통부(112)가 형성된 관체가 고리형상을 이루도록 구성되고,상기 메인이동체(12)는,상기 관통부(112)에 삽입되며 상기 관체 내벽에 접촉되는 지지롤러부(14)와, 바닥면에 접촉하되 일부가 구동수단(15)을 통해 회전하는 복수의 바퀴(W)를 구비하는 것을 특징으로 하는 동작교정을 위한 인공지능 코칭시스템."}
{"patent_id": "10-2022-0019430", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 거치구조체(16)는, 상기 메인이동체(12) 상측에 수직으로 형성된 기둥형태로 이루어지되 양 측면으로 하단에 바닥면에 지지되는 바퀴(W)가 형성된 복수의 보조지지체(162)를 포함하는 것을 특징으로 하는 동작교정을 위한 인공지능 코칭 시스템."}
{"patent_id": "10-2022-0019430", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 관통부(112)에 삽입되며 상기 관체 내벽에 접촉되는 지지롤러부(14)와, 바닥면에 접촉하는 복수의 바퀴(W)를 구비하되 고리형 레일부(11) 중심을 기준으로 상기 메인이동체(12)와 대칭되는 위치에 배치되는 보조이동체(13)를 더 포함하고,상기 거치구조체(16)는 상기 메인이동체(12) 및 보조이동체(13)에 각각 수직으로 형성된 기둥(163)을 연결하는지지바(164)로 구성되는 것을 특징으로 하는 동작교정을 위한 인공지능 코칭 시스템.공개특허 10-2023-0122790-3-"}
{"patent_id": "10-2022-0019430", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 동작교정 코칭 시스템에 관한 것으로, 자세하게는 가정 등에서 카메라 기능을 갖는 단말기를 통해 사 용자의 운동동작을 인식하고 음성 등을 통해 교정과 코칭이 이루어지도록 함에 있어 복수의 카메라 단말을 통한 데이터 수집과 딥러닝을 통해 인체 관절을 추적하여 동작인식 정확도를 향상시킬 수 있는 동작교정을 위한 인공 지능 코칭 시스템에 관한 것이다."}
{"patent_id": "10-2022-0019430", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 동작교정 코칭 시스템에 관한 것으로, 자세하게는 가정 등에서 카메라 기능을 갖는 단말기를 통해 사 용자의 운동동작을 인식하고 음성 등을 통해 교정과 코칭이 이루어지도록 함에 있어 복수의 카메라 단말을 통한 데이터 수집과 딥러닝을 통해 인체 관절을 추적하여 동작인식 정확도를 향상시킬 수 있는 동작교정을 위한 인공 지능 코칭 시스템에 관한 것이다."}
{"patent_id": "10-2022-0019430", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "뇌 손상 및 근육 손상을 비롯하여 다양한 원인으로 스스로 보행 및 거동이 불편한 환자의 재활치료에 있어, 약 화된 근육의 움직임을 위해 보호자나 치료사의 도움을 받게 된다. 이를 위해 환자가 병원이나 재활센터와 같은 의료기관을 주기적으로 방문하여야 하고, 지정된 공간에서 정해진 시간에 재활운동을 한 후 불편한 몸을 이끌고 집으로 돌아와야 하는 어려움이 있으며 특히, 보행능력이 떨어지 는 노약자나 신체 관절의 재활이 필요한 환자 등의 경우 이러한 어려움이 가중된다. 이에 근래 IT 기술의 비약적인 발전과 함께 환자가 시설로 이동하지 않고 집에서도 재활운동이 가능하도록 지원 하여 편의를 향상시키면서 건강 유지/증진에 도움을 줄 수 있는 다양한 방안이 연구되고 있다. 이들은 대부분 환자가 교수자의 모범적인 동작 및 자세를 보고 따라하는 단순한 기능만 제공되어 실질적으로 동 작의 정확성을 판단할 수 없으며 되려 잘못된 동작으로 인한 부작용을 초래할 수도 있어 사용자 편의나 건강의 유지 및 증진 측면에서 효율이 낮았다. 더불어 근래 COVID-19의 대유행으로 병원과 퍼스널 트레이닝, 필라테스 샵 등에서 지도를 받으며 했던 운동을 집에서 혼자서 하는 비율이 높아졌으며 대부분 영상을 따라하는 수준에 머물러 있다. 또한, 학교에서 교육하던 치료사와의 신체적 접촉이 많은 재활운동(물리치료, 작업치료) 또한 밀착지도하기 어 려워 코로나 대응을 위한 강력한 거리 두기 정책이 시행되는 시기에 재활운동을 취소하는 상황도 많이 발생하였 다. 이처럼 재활운동이 원활히 이루어지지 못함으로써 국민건강이 저하되고 이로 인한 국가의 건강보험 재정의 악화에도 영향 주게 되며, 대학교 등에서의 재활운동 관련 실습 또한 코로나 여파로 잘 이루어지지 못하고 교육 의 질 저하로 이어질 수밖에 없는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2013-0099321호 (2013.09.06)"}
{"patent_id": "10-2022-0019430", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제를 해결하기 위하여 창출된 것으로, 본 발명의 목적은 복수의 카메라 단말을 통한 데이터 수집과 딥러닝을 통해 인체 관절을 추적하여 동작인식 정확도를 향상시킬 수 있는 AI 코칭 알고리즘을 적용하여 가정 등 다양한 실내공간에서 카메라 기능을 갖는 단말기를 통해 사용자의 운동동작을 인식하고 음성 등을 통해 정확한 자세의 교정과 코칭이 이루어지도록 하는 동작교정을 위한 인공지능 코칭 시스템을 제공하는 것이다."}
{"patent_id": "10-2022-0019430", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 위해 본 발명은 동작교정을 위한 코칭 시스템에 있어서, 설정된 동작을 수행하는 대상자를 둘러 설치되는 레일부와, 상기 레일부를 따라 이동하며 복수의 거치부를 구비한 거치구조체가 상측으로 형성된 메인이동체로 구성되는 프레임구조체; 상기 거치부에 장착되며 대상자를 촬영하는 카메라를 구비하는 학습단말 기; 상기 메인이동체의 움직임에 대응하여 상기 카메라를 통해 수집된 영상을 수집하고 동작별로 정리하는 영상분류부와, 분류된 동작별 영상에서 관절부위를 기준으로 하는 제1동작데이터를 추출하는 제1속성추출부와, 상기 제1동작데이터를 학습하며 기준정보를 생성하는 영상학습부를 구비하는 학습모듈; 카메라를 구비한 사용자단말 기를 통해 촬영된 동작 영상을 분석하여 관절부위를 기준으로 하는 제2동작데이터를 추출하는 제2속성추출부와, 상기 제2동작데이터를 기준정보와 비교하여 보정정보를 생성하는 판단부와, 상기 보정정보를 영상 및 음성을 통 해 출력하는 안내부를 구비하는 코칭모듈; 로 이루어지는 것을 특징으로 한다. 이때 상기 레일부는, 길이방향을 따라 관통부가 형성된 관체가 고리형상을 이루도록 구성되고, 상기 메인이동체 는, 상기 관통부에 삽입되며 상기 관체 내벽에 접촉되는 지지롤러부와, 바닥면에 접촉하되 일부가 구동수단을 통해 회전하는 복수의 바퀴를 구비할 수 있다. 또한, 상기 거치구조체는, 상기 메인이동체 상측에 수직으로 형성된 기둥형태로 이루어지되 양 측면으로 하단에 바닥면에 지지되는 바퀴가 형성된 복수의 보조지지체를 포함할 수 있다. 또한, 상기 관통부에 삽입되며 상기 관체 내벽에 접촉되는 지지롤러부와, 바닥면에 접촉하는 복수의 바퀴를 구 비하되 고리형 레일부 중심을 기준으로 상기 메인이동체와 대칭되는 위치에 배치되는 보조이동체를 더 포함하고, 상기 거치구조체는 상기 메인이동체 및 보조이동체에 각각 수직으로 형성된 기둥을 연결하는 지지바 로 구성될 수 있다."}
{"patent_id": "10-2022-0019430", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 통해 재활훈련을 비롯하여 다양한 운동을 전문기관의 방문 및 전문가의 도움 없이도 가정 등에서 원 격에서 진행하며 정확한 자세 코칭이 이루어질 수 있다. 비교적 큰 공간이 요구되고 가격도 높은 기존의 키오스 크형 장비와 대비하여 스마트폰 및 거치대와 같은 간단한 준비만으로 실내 어디서든 AI의 코치를 받으며 운동 가능함에 따라 사용자의 편의를 크게 향상시킬 수 있으며, 화면을 보지 않더라도 자세를 인식하여 교정하도록 음성을 통해 코치를 함으로 운동에만 전념할 수 있고 땀 흘리는 운동 등에 매우 유용하다."}
{"patent_id": "10-2022-0019430", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하며 본 발명 동작교정을 위한 인공지능 코칭 시스템의 구성을 구체적으로 설명한다. 도 1은 본 발명의 개념도, 도 2는 본 발명의 실시예에 따른 구성 및 연결관계를 나타낸 블록도로서, 본 발명은 기존 원격 동작 코칭 프로그램에서 동작 인식 정확도가 낮고 운동 동작과 함께 화면을 보며 지도를 받기 어렵다 는 문제를 해결하고자 복수의 카메라를 통해 운동 동작을 취하는 신체 관절을 중심으로 동작을 학습한 데이터를 활용하여 인식 정확도를 크게 높이면서 음성을 통해 자세를 코칭하며 편의성을 높이게 된다. 이를 위한 주요구 성으로 본 발명은 프레임구조체와, 학습단말기와, 학습모듈 및 코칭모듈을 구비한다. 도 3은 본 발명의 1 실시예에 따른 프레임구조체의 모습을 나타낸 평면도로서, 앞서 언급한 바와 같이 다수의 카메라를 통해 운동 자세를 추출하여 학습함에 있어 정확한 동작 인식을 위한 2D(x, y)가 아닌 3D(x, y, z) 영 상 데이터를 취득하기 위해 복수의 카메라가 동작을 수행하는 대상자의 주변을 회전하여 촬영을 하기 위한 프레 임구조체가 마련된다. 이를 위해 상기 프레임구조체는 레일부와, 상기 레일부를 따라 이동하며 복수의 카메라가 설치 된 메인이동체로 이루어진다. 상기 레일부는 설정된 동작을 수행하는 대상자를 둘러 설치되는 구조체로, 쉽고 안정적인 설치를 위해 바닥 면에 설치가 이루어지되 중앙에 대상자가 위치하도록 환형, 즉 고리형태로 구성되는 것이 바람직하다. 또한, 다양한 형태로 단면을 구성될 수 있으나 원형의 관체로 구성하는 것이 바람직하며, 후술되는 바와 같이 메인 이동체뿐 아니라 경우에 따라서는 보조이동체가 상기 레일부를 따라 이동하게 되므로 이들의 이탈 을 방지할 수 있도록 측면, 바람직하게는 외측으로 길이방향을 따라 관통부가 형성된, 즉 'C' 자형 단면을 갖도록 구성하게 된다. 통상적으로 집에서 이루어지는 재활치료, 요가, 필라테스, 홈트레이닝과 같은 운동은 1인이 누울 수 있는 크기 의 매트 위에서 이뤄짐에 따라 매트보다 큰 안 지름을 갖도록 레일부가 구비되며, 공간의 효율적인 활용 및 보관의 편의를 위해 접거나 분리 및 조립 가능한 형태로 레일부를 구성하는 것이 바람직하다. 도 4는 본 발명의 1 실시예에 따른 프레임구조체의 결합구조를 나타낸 부분 사시도로서, 분리 및 조립이 가능항 형태의 레일부를 도시하고 있다. 즉 상기 레일부는 길이방향을 따라 관통부가 형성되며 원호를 이루는 관체가 다수 연결되어 고리 형태를 이루도록 구성되며, 각 관체의 한쪽 끝 부분의 바깥지름이 줄어드는 형태로 구성되어 다른 관체의 다른 쪽에 삽입되는 형태로 조립이 이루어지도록 구성될 수 있다. 이때 연결된 관체가 의도치 않게 분리되 지 않도록 연결부의 한쪽 관체에는 탄성 돌기를 구성하고 연결되는 연결부의 다른 쪽 관체에는 상기 탄성 돌기에 대응하는 위치에 관통구멍을 형성함으로 상기 탄성 돌기가 관통구멍에 끼워지며 견고한 조립상태가 유지될 수 있다. 본 발명의 실시예에서는 상기 레일부가 8 등분되어 분리 및 조립 가능한 형태를 제시하고 있으나 이에 한정 되지 않고 다양한 개수의 관체로 분할할 수 있으며 레일부를 이루는 관체의 재질을 일정 범위에서 플 렉서블한 특성의 재질로 구성하여 연결되는 관체의 숫자를 통해 레일부의 지름을 일정 범위에서 조절할 수 도 있다. 도 5는 본 발명의 1 실시예에 따른 프레임구조체의 구조를 나타낸 사시도이다. 상기 메인이동체는 복수의 카메라, 실질적으로 카메라가 내장된 학습단말기가 다수 설치된 상태로 상기 레일부를 따라 이동하며 전 방향에서의 촬영하며 3D 영상 데이터를 수집을 지원하는 구성으로, 학습단 말기의 설치가 이루어지는 복수의 거치부를 구비한 거치구조체가 상측으로 형성된다. 구체적으로 상기 메인이동체 측면으로는 상기 관통부에 삽입되며 상기 관체 내벽에 접촉되는 지 지롤러부가 형성되어 레일부를 따라 이동 중 이탈되지 않도록 구성되며, 바닥면에 접촉하되 일부가 구 동수단을 통해 회전하는 복수의 바퀴(W)가 구비된다. 상기 구동수단으로는 모터와 같은 전동방식의 구 동수단을 적용할 수도 있으나 본 발명에서는 장시간 구동이 이뤄지는 것이 아닌 특정 동작을 유지하는 동안 비 교적 짧은 시간에 촬영과 메인이동체의 이동이 이뤄짐에 따라 태엽을 통해 동작하는 구동수단을 적용함으로 별도의 전원이나 제어수단 없이 이동이 이뤄질 수 있다. 상기 거치부는 학습단말기를 임시로 잡아줄 수 있는 다양한 형태의 그립으로 이루어지게 되며, 본 발명 의 1 실시예에서는 메인이동체에 상측으로 수직으로 형성된 거치구조체에 세로방향으로 설정된 간격을 두고 거치부가 구비된다. 첨부된 도면에서는 3개의 거치부가 구비됨에 따라 3대의 카메라를 통해 중앙 대상자가 취하는 동작을 대상자 전체가 나오도록 메인이동체의 이동을 통해 주위를 돌아가며 촬영할 수 있는 형태를 도시하고 있으며 레일부의 크기에 따라 구비되는 거치부의 숫자는 적절하게 가감될 수 있다. 이때 다수의 학습단말기 설치에 따른 무게를 안정적으로 지탱하며 이동하기 위해 적절한 면적과 바퀴(W)를 갖도록 메인이동체를 구성하게 되며, 상기 거치구조체에는 양 측면으로 하단에 바닥면에 지지되는 바퀴 (W)가 형성된 복수의 보조지지체가 형성되어 이동 중 원심력에 의한 흔들림이나 쓰러짐을 방지할 수 있다. 이처럼 메인이동체를 대상자를 중심으로 360도 회전시키며 촬영함으로 실질적으로 필요한 3D 영상 데이터를 얻을 수 있으나 대상자의 측면과 상측에서 동시에 촬영하는 방식으로 영상 데이터를 얻을 수도 있다. 도 6은 본 발명의 2 실시예에 따른 메인이동체 및 보조이동체와 프레임구조체의 구조를 나타낸 사시도로서, 고 리형 레일부 중심을 기준으로 상기 메인이동체와 대칭되는 위치에 배치되는 보조이동체가 구비되고, 상기 거치구조체는 상기 메인이동체 및 보조이동체에 각각 수직으로 형성된 기둥을 연결해주는 지지바로 구성된 구조를 제시하고 있다. 상기 보조이동체는 실질적으로 메인이동체와 동일한 구조로 이루어져 레일부를 따라 이동하도록 구 성되나 별도의 구동수단이 장착되지 않고 외력에 의해 자유로운 움직임이 이루어지는 점에서 차이가 있다.이때 상기 레일부 내부를 따라 고리형태로 설치된 와이어와 같은 연동수단을 통해 메인이동체와 보조이동체를 연결하여 메인이동체의 이동과 함께 연동수단을 통해 연결된 보조이동체가 함께 이 동할 수 있도록 구성할 수 있다. 상기 거치구조체는 상기 메인이동체 및 보조이동체에 각각 수직으로 형성된 기둥을 서로 연결 하는 지지바로, 대상자 상측을 가로지르며 상기 메인이동체와 보조이동체를 연결하도록 구성되며 상기 기둥과 지지바를 따라 설정된 간격으로 거치부가 형성되어, 상기 거치부에 설치된 학 습단말기가 중앙의 대상자를 촬영하도록 한다. 첨부된 도면에서는 각 기둥에 2개의 거치부와 지지 바에 5개의 거치부가 간격을 두고 설치되어 총 9개의 학습단말기를 통해 대상자의 전신 촬영이 이 루어질 수 있는 구조를 도시하고 있으며 이에 한정되지 않고 거치부의 개수는 적절히 가감될 수 있다. 마찬가지로 각 기둥에는 바닥면에 지지되는 바퀴(W)가 형성된 복수의 보조지지체가 형성되어 이동 중 원심 력에 의한 흔들림이나 쓰러짐을 방지할 수 있다. 상기 학습단말기는 상기 거치부에 장착되며 대상자를 촬영하는 카메라를 구비하여 학습목적의 영상 을 취득하는 단말기로서, 촬영된 영상을 전송하는 통신부를 비롯하여 가속도센서 기반으로 상기 메인이동체 의 이동에 따른 움직임을 측정할 수 있는 센서부를 포함하여, 메인이동체 및 2 실시예와 같은 구조에서 는 보조이동체의 이동에 따른 움직임 위치정보를 반영하여 영상을 촬영 후 상기 학습모듈로 송출하게 된 다. 상기 학습모듈은 상기 학습단말기를 통해 송출된 영상을 수집하고 학습하기 위한 구성으로, 세부구성으로 영상분류부와, 제1속성추출부 및 영상학습부를 구비한다. 상기 영상분류부는 상기 메인이동체의 움직임에 대응하여 상기 카메라를 통해 수집된 영상을 수집 하고 동작별로 정리하는 구성이다. 기본적으로 동일한 동작을 취하는 영상을 촬영한 각도별로 그룹화하는 것으 로 동일한 동작 동일한 촬영각도로 분류되어 학습이 이루어질 수 있도록 한다. 상기 제1속성추출부는 상기 영상분류부를 통해 분류된 동작별 영상에서 관절부위를 기준으로 하는 제1 동작데이터를 추출하게 된다. 기본적으로 인체는 관절을 중심으로 움직임이 이루어지므로 목, 어깨, 팔, 손목, 허리, 고관절, 무릎, 발목과 같은 주요 관절을 추출하고 이들을 중심으로 xyz 축에 대한 3차원 움직임을 제1동 작데이터로 추출하게 된다. 상기 영상학습부는 상기 제1속성추출부를 통해 추출된 상기 제1동작데이터를 학습하는 구성으로, 추후 동작인식의 기준이 되는 기준정보를 생성하게 된다. 이 과정에서 각 동작의 특징에 맞도록 불필요한 동작과 자 세를 포함한 프레임의 제거가 이루어질 수 있으며 프레임 이미지를 분석하여 동작에서 중요한 관절을 중심으로 하는 움직임의 공통된 부분을 학습하여 기준정보를 생성하게 된다. 상기 코칭모듈은 앞서 학습된 데이터를 활용하여 사용자단말기를 활용하여 각 가정 등에서 재활치료, 요가, 필라테스 등의 동작을 촬영함에 따라 정확한 동작을 취할 수 있도록 코칭하기 위한 구성으로, 세부구성으로 제2 속성추출부와, 판단부 및 안내부를 구비한다. 상기 사용자단말기는 본 발명에 따른 코칭 서비스를 받고자 하는 사용자가 소지한 단말기로서, 동작 촬영을 위 한 카메라를 비롯하여 음성 안내를 위한 인터페이스가 구비된 스마트폰에 해당하는 구성이다. 상기 제2속성추출부는 상기 사용자단말기의 카메라를 통해 촬영된 동작 영상을 분석하여 관절부위를 기준으 로 하는 제2동작데이터를 추출하는 구성으로, 앞서 설명한 제1속성추출부와 동일하게 목, 어깨, 팔, 손목, 허리, 고관절, 무릎, 발목과 같은 주요 관절을 추출하고 이들을 중심으로 xyz 축에 대한 3차원 움직임을 제2동 작데이터로 추출하게 된다. 상기 판단부는 상기 제2속성추출부를 통해 추출된 상기 제2동작데이터를 상기 학습모듈에서 생성된 기준정보와 비교하여 보정정보를 생성하는 구성이다. 기본적으로 사용자가 취하는 동작과 동일한 동작에 대한 기준정보를 불러와 각 관절을 중심으로 한 움직임을 비교하여 이를 중심으로 올바른 각도나 움직임에 관련된 보 정정보를 생성하게 된다. 상기 안내부는 상기 판단부를 통해 생성된 상기 보정정보를 영상 및 음성을 통해 출력하는 구성이다. 앞서 언급한 바와 같이 인체의 각 관절을 중심으로 높이를 높이거나 낮추는 교정이나 좌우로 돌리거나 틀어주는 것을 지시하는 방식으로 보정정보를 영상과 함께 음성으로 출력하며, 굳이 영상을 보지 않더라도 음성을 통해 명확하게 파악할 수 있도록 구체적으로 설명을 하며 동작 특성상 영상을 볼 수 없는 상황에서도 쉽게 동작 코칭이 이뤄질 수 있도로 한다. 본 발명의 권리는 위에서 설명된 실시예에 한정되지 않고 청구범위에 기재된 바에 의해 정의되며, 본 발명의 분 야에서 통상의 지식을 가진 자가 청구범위에 기재된 권리범위 내에서 다양한 변형과 개작을 할 수 있다는 것은 자명하다."}
{"patent_id": "10-2022-0019430", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 개념도, 도 2는 본 발명의 실시예에 따른 구성 및 연결관계를 나타낸 블록도, 도 3은 본 발명의 1 실시예에 따른 프레임구조체의 모습을 나타낸 평면도, 도 4는 본 발명의 1 실시예에 따른 프레임구조체의 결합구조를 나타낸 부분 사시도, 도 5는 본 발명의 1 실시예에 따른 프레임구조체의 구조를 나타낸 사시도, 도 6은 본 발명의 2 실시예에 따른 메인이동체 및 보조이동체와 프레임구조체의 구조를 나타낸 사시도이다."}
