{"patent_id": "10-2006-0039778", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2007-0107373", "출원번호": "10-2006-0039778", "출원인": "정양권", "발명자": "정양권"}}
{"patent_id": "10-2006-0039778", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "운전자의 차량이 이동하고 있는지 정지하고 있는지 또는 차량 엔진을 끄고 차량을 운행하고 있는지 여부를 판단하기 위한 단계(A);에서 차량의 배터리(40-10) 단에 전원의 공급 여부를 이용하여 차량의 이동 및 시동 상태 등의 공회전 여부를 추후에 검사하기 위하여 기록하는 단계(A1);와 엔진부 ECU(40-20), 부란자의 타코 센서(40-22), 또는 차량 미션부의 크랭크 센서(40-24) 등으로부터 획득하는 RPM 수치와 내비게이션의 변화 값(위치, 시간, 주행거리 등)을 기반으로 차량의 이동 및 시동 상태 등의 공회전 여부를 추후에 검사하기 위하여 기록하는 단계(A2);와 상기의 위성 GPS(99) 시스템에서 수신한 정보와 내비게이션 칩(30-10)의 기능을 통하여 제공받은 정보를 기반으로 운행 과정에서 획득한 시간, 날짜, 주행거리, 평균속도, 최고속도, 차선변경 횟수, 휴식시간, 급브레이크 횟수 등의 정보를 획득하는 단계(B)로 구성하여 차량을 운행하는데 공회전 여부, 내리막길과 같은 위험지역에서의 안전운행 진단 여부(시동을 끄고 운전하는 등의 위험 행위)의 기록을 관리함과 동시에 내비게이션(30-10)의 정보를 기반으로 운전자의 과로 여부(주행거리, 주행시간, 평균속도, 최고속도, 급브레이크 횟수 등)와 얼굴 인식과 추적 알고리즘 모듈을 이용한 운전자의 평소의 습관(눈 깜박임, 틱 횟수 등) 및 운전자 얼굴 움직임(얼굴의 상하 좌우 동선 정보, 상기 정보에 따른 순간 속도, 평균속도 등의 상관정보)을 지속적으로 학습한 정보를 지식 베이스 모듈에서 가공하고 학습한 특징 정보를 저장하여 상기의 시스템(30)이 시설된 차량을 운전하는 운전자가 운전을 수행할 때, 즉, 졸음, 과로 등을 판단하여 휴식을 요구하거나 운전자의 안전 운전을 관리하는 단계(B,C,D,E,F)를 발명의 구성에서 기술한 내용을 특징으로 하는 운전자와 차량에 대한 안전운전 관리 방법."}
{"patent_id": "10-2006-0039778", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "내비게이션 또는 GPS 기능을 제공하면서 운전자가 차고지에서 출발하여 다시 차고지로 복귀하는 전 차량 운행과정에서 생성한 정보를 일정한 시간 단위마다 각각의 단계별(A,B,C,D,E,F)로 획득한 차량정보(그 실례로 과속, 공회전 여부, 내리막길에 엔진을 끄고 운행하였는지의 여부, 급브레이크 횟수 등)와 운전자 정보(얼굴 인식 및 추적에 의한 졸음, 피로, 평소의 운전자의 습관 중에 나타나는 특성(그 실례로 틱 등) 정보, 주행거리, 운행시간, 휴식시간, 최고속도, 시간, 날짜 정보를 운전자의 안전관리 시스템(30) 내부에 기록하는 단계(A, B, C, D, E, F)와, 상기 단계에서 기록된 정보를 상기의 두 시스템(30, 90) 사이의 무선 통신의 방법으로 차량 및 운전자의 운행에 따른 모든 기록을 관리 서버(90)에서 총괄적으로 유지 관리하는 것을 특징으로 하는 운전자와 차량에 대한 안전운전 관리 방법."}
{"patent_id": "10-2006-0039778", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "운전자의 차량이 이동하고 있는지 정지하고 있는지 또는 차량 엔진을 끄고 차량을 운행하고 있는지 여부를 판단하기 위하여 차량의 배터리(40-10) 단에 전원의 공급 여부를 이용하여 차량의 이동 및 시동 상태 등의 공회전 정보와 엔진부 ECU(40-20), 부란자의 타코 센서(40-22), 또는 차량 미션부의 크랭크 센서(40-24) 등으로부터 획득하는 RPM 수치와 내비게이션의 변화 값(위치, 시간, 주행거리 등)을 기반으로 차량의 이동 및 시동 상태 등의 공회전 여부 정보를 안전운전관리시스템(30)에 입력하기 위한 수단인 차량의 RPM 정보 인터페이스 유닛(40);과 상기의 위성 GPS(99) 시스템에서 수신한 정보와 내비게이션 칩(30-10)의 기능을 통하여 제공받는 정보를 기반으로 운행 과정에서 획득한 시간, 날짜, 주행거리, 평균속도, 최고속도, 차선변경 횟수, 휴식시간, 급브레이크 횟수 등의 정보를 획득하는 수단인 안전운전관리시스템(30);과 얼굴 인식과 추적 알고리즘 모듈을 이용한 운전자의 평소의 습관(눈 깜박임, 틱 횟수 등) 및 운전자 얼굴 움직임(얼굴의 상하 좌우 동선 정보, 상기 정보에 따른 순간 속도, 평균속도 등의 상관정보)을 지속적으로 학습한 정보를 지식 베이스 모듈에서 가공하고 학습한 특징 정보를 저장관리하는 수단인 카메라(30-60)와 지식베이스 모듈(30-30);과 동일인 여부를 판단하기 위하여 지문을 입력하기 위한 지문 인식 장치(30-55)와 운전자가 목적지까지의 정보를 입력하기 위한 수단인 터치 스크린 기능이 있는 영상 및 문자 표시장치(30-70)와 음성 출력을 위한 수단인 스피커(30-80); 관리 서버(90)와 안전운전관리시스템(30)이 상호 통신할 수 있는 수단인 무선 송수신 장치(30-40); 프로그램과 데이터를 기억하는 수단인 기억장치(30-30, 30-50); 상기의 제반 기능을 제어하고 총괄하는 수단인 중앙처리장치(30-20) 등으로 구성한 본 발명 시스템이 시설된 차량을 운행하는데 공회전 여부, 내리막길과 같은 위험지역에서의 안전운행 진단 여부(시동을 끄고 운전하는 등의 위험 행위)의 기록을 관리함과 동시에 내비게이션(30-10)의 정보를 기반으로 운전자의 과로 여부(주행거리, 주행시간, 최고속도, 시간, 날짜, 급브레이크 횟수, 휴식시간 등)와 얼굴 인식과 추적 알고리즘 모듈을 이용한 운전자의 평소의 습관(눈 깜박임, 틱 횟수 등) 및 운전자 얼굴 움직임(얼굴의 상하 - 3 -공개특허 10-2007-0107373좌우 동선 정보, 상기 정보에 따른 순간 속도, 평균속도 등의 상관정보)을 지속적으로 학습한 정보를 지식 베이스 모듈에서 가공하고 학습한 특징 정보를 저장하여 상기의 시스템(30)이 시설된 차량을 운전하는 운전자가 운전을 수행할 때, 즉, 졸음, 과로 등을 판단하여 휴식을 요구하거나 공회전 또는 위험 운행을 하는 차량과 운전자의 안전 운전을 관리하는 것을 특징으로 하는 지능형 안전운전 관리 시스템."}
{"patent_id": "10-2006-0039778", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "GPS 위성 시스템(99), 내비게이션 또는 GPS 기능을 제공하며, 상기의 제공한 정보를 기록 유지관리할 수 있는 시스템(30), 상기의 시스템에서 생성하여 기록한 정보를 장기간 유지가 필요하다고 고려하는 경우의 관리 서버(90)로 전송하여 유지관리할 수 있도록 구성하는(차량과 운전자의 관계가 1:1이면서 최근의 정보만 필요하여 관리 서버(90)가 요구하지 않는 경우는 본 발명 시스템의 구성에서 안전관리시스템(30) 단독으로 구성하는 것 포함) 것을 특징으로 하는 지능형 안전운전 관리 시스템. 명 세 서발명의 상세한 설명 발명의 목적 발명이 속하는 기술 및 그 분야의 종래기술본 발명은 운전자가 안전 운전을 수행할 수 있도록 지원해주는 시스템에 관한 것으로 위성 GPS 시스템(99)에서 <43>송신하는 신호를 수신할 수 있는 내비게이션의 기술에 해당하며 도면 1과 같다. 또한, 운전자의 평소 운전 습관 중 특이 행동, 눈 깜박임, 등 얼굴 부위를 중심으로 변화 또는 움직임의 영상 정보를 획득하여 졸음 운전 또는 운전 부 주위에 대한 경고 메시지를 알려주는데 요구되는 정보를 생성하는 영상인식 및 지식베이스 등의 인공지능 기술 분야에 해당한다. 더불어, 운전자가 장시간 휴식을 하는데 환경 오염원이 될 수 있는 기준인 공회전 여부를 확인할 수 있는 검사 분야이며, 내리막길에서 차량 시동을 OFF하고 운행하는 경향이 있는지, 급브레이크를 얼마나 자주 밟았는지, 평균속도, 주행거리, 방위 정보, 운전자의 헤드 제스처 정보 등의 다양한 엔터테인먼트 정보를 제공하기 위한 영상 인식 및 멀티미디어 영상 송수신 기술분야 해당한다. 발명이 이루고자 하는 기술적 과제본 발명은 상기 기술한 바와 같은 운전자로 하여금 안전 운전을 할 수 있도록 정확한 정보를 제공하기 <44>위함이다. 따라서, 운전자가 운전석에 승차를 하면 운전자의 지문과 영상을 획득하고 상기 운전자에 대한 사전 정보를 조회하여 안전 운전 수행에 따른 정보를 제공하고 지속적으로 학습할 수 있도록 구성하며, 사전 등록이 돼 있지 않을 경우에는 향후에 사용할 목적으로 학습 데이터베이스를 지속적으로 구축할 수 있도록 그 환경을 설정해 주는 기술이 요구된다. 실례로 운전자가 휴식하는 동안에 간단한 정보, 음악, 뉴스를 시청할 수 있도록 DMB 방송 수신 디코더(30-65) 기능 및 GPS와 관련한 시간, 날짜, 주행거리, 위치, 최고속도, 평균속도, 위성 상태, 지도, 카메라 정보, 주유소 정보 등의 기본적인 내비게이션 정보는 물론이며, 상기의 정보를 기반으로 운전자의 운전 습관을 판단할 수 있도록 학습 정보를 제공할 수 있어야 한다. 또한, 운전자가 운행 차량을 이동하지 않고 공회전 상태로 장시간 휴식을 한 경우, 내리막길과 같은 위험 지역에서 시동을 끄고 차량을 운행하였는지, 급브레이크를 얼마나 자주 수행하였는지의 관리와, 중간 휴식이 없이 무리한 운전을 수행하는 운전자에게는 휴식을 요구하는 등의 안전 운전수행관리 지침에 의거한 차량 및 운전자를 관리하여 최대한의 교통업무종사원의 과로를 방지하고 안전 정보를 제공하는데 그 목적이 있다. 발명의 구성 및 작용본 발명에 의해 구성된 방법과 시스템을 운행 차량에 시설하므로 운전자의 안전 운행과 차량을 실질적으로 관리 <45>하기 위한 방법과 시스템에 관한 것이다. 이에 대한 전체적인 도시는 도 2와 같다. 보다 구체적인 의미를 기술하자면 본 발명 시스템의 구성은 내비게이션과 GPS와 관련한 위성 GPS 시스템(99), 차량에서 RPM 정보와 배터리 정보, 그리고 내비게이션에서 획득한 정보, 카메라에서 획득한 얼굴 정보 등을 차량의 안전 관리 목적과 연관하기 위하여 기록함과 동시에 시간 대비 늘어나는 정보를 최적화하여 관리 서버(90)에 축적하여 필요 따라 관리 목적으로 사용 가능한 구성한 부분을 보여주고 있다. 상기의 목적을 달성하기 위한 본 발명은 크게 차량을 관리할 목적으로 차량이 이동, 정지, 공회전, 이동하면서 <46>- 4 -공개특허 10-2007-0107373엔진의 가동 및 정지에 대한 상태 정보가 요구된다. 따라서, 본 발명에서는 차량의 RPM 정보 인터페이스 유닛(40) 수단을 통하여 상기에서 기술한 차량의 엔진 상태 정보를 추출할 목적으로 구성하였다. 즉 차량에 대한 이동 및 정지 상태의 정보를 RPM(Revolutions Per Minute: 회전체가 1분 동안 회전하는 회전수를 나타내는 단위)이라는 단위 정보를 통하여 판단하고자 구성하였다. 통상적으로 RPM 정보를 획득하기 위해서는 엔진부 ECU(40-20), 부란자의 타코 센서(40-22), 또는 차량 미션부의 크랭크 센서(40-24) 등으로부터 출력하는 신호 값 즉 차량의 RPM 값을 획득하는데 본 발명에서 구성하고 있는 상기의 수단(40)은 RPM 정보를 표출하고 있는 방식에 있어서 아날로그 방식 또는 디지털 방식으로 구성하고 있는 문제점을 완전히 극복하고 상기의 이외의 단자에도 접속이 용이하게 구성하여 차량의 시동 상태 정보를 획득하는 인터페이스 기능을 수행할 수 있도록 구성하였으며, 또한 RPM 정보를 부득이 획득하지 못하는 경우를 대비하여 차량의 배터리(40-10)에 전력을 공급하는 상태를 통하여 차량의 시동 및 정지 정보를 추출할 수 있는 특징을 이용하여 배터리(40-10)에서도 용이하게 접속할 수 있도록 통합할 수 있는 수단을 이용하여 차량정보를 획득하는 단계(A);로 구성하였다. 즉, 차량의 배터리(40-10) 단에 전원의 공급 여부를 이용하여 차량을 관리하는데 있어서 차량의 이동 및 시동 상태 등의 공회전 여부를 검사하는 단계(A1);와 엔진부 ECU(40-20), 부란자의 타코 센서(40-22), 또는 차량 미션부의 크랭크 센서(40-24) 등을 포함하는 것을 물론 통상적으로 차량의 특성에 따라서 차량의 엔진부와 연결이 가능하여 RPM 수치를 획득함과 동시에, 내비게이션의 변화 값(위치, 시간, 주행거리 등)을 기반으로 차량의 이동 및 시동 상태 등의 공회전 여부를 검사하는 단계(A2);로 구성하여 차량의 정확한 이동 상태, 정지 상태, 정지중 시동의 여부를 판단 할 수 있는 수단을 수행할 수 있도록 구성하는 것을 특징으로 한다.위성 GPS 시스템(99)에서 송신하는 신호와 내비게이션 칩(30-10)과 관련하여 생성한 시간, 날짜, 주행거리, 위 <47>치, 최고속도, 평균 속도, 위성상태, 지도, 카메라 정보, 주유소 정보 등을 획득하는 단계(B);는 도 3과 같이 GPS 위성 시스템(99)에서 송신하는 시간, 거리, 위치, 속도, 주행거리, 날짜, 최고속도 등의 항법 정보를 제공받을 수 있는 내비게이션 칩(30-10) 수단; 상기의 장치(30-10)에서 획득한 정보를 기반으로 지식 베이스 처리를 담당하는 중앙처리장치(30-20) 수단; 상기의 정보를 기억한 후 운전자의 안전 운전을 위한 정보를 저장하는 기능을 수행하는 데이터 기억장치(30-30) 수단; 지식 베이스 생성하고 가공하고 저장하고 제공하는 총괄 처리를 수행하는 지식 베이스 모듈(30-35)의 수단; GPS(99), 관리 서버(90) 등의 내부 또는 외부 장치들과 정보를 교신하기 위한 유무선 송수신 장치(30-40) 수단; 얼굴인식, 지식 베이스 관리, 제반 정보를 관리하고 수행하는 내장형 프로그램을 기억하는 기능을 수행하는 프로그램 기억장치(30-50) 수단; 운전자의 얼굴 영상을 입력받기 위한 카메라(30-60) 수단; DMB 방송을 통하여 전송되는 정보를 수신하기 위한 DMB 디코더(30-65), 지도를 포함한 내비게이션 정보 및 지식베이스 정보를 영상 또는 문자를 표시하기 위한 영상 및 문자 표시장치(30-70) 수단; 음성을 표출하기 위한 스피커(30-80) 수단; 전원공급단자(93) 수단 등으로 구성하였다.영상 정보를 입력할 수 있는 수단인 카메라(30-60)를 이용하여 운전자의 얼굴 영상 정보를 획득하는 단계(C);로 <48>상기의 장치(30-60)에서는 획득한 운전자의 머리 부분의 이동 및 제스처에 따른 좌표값을 기반으로 평소 운전 습관 중 특이 행동, 눈 깜박임, 등 얼굴 부위를 중심으로 변화 또는 움직임의 영상 정보를 학습하여 운전자의 정보를 생성하는 단계(C1);와 생성한 상기의 정보를 기반으로 운전자의 과로 상태 여부, 또는 운전자의 습관적 행위의 결과 인지를 판단할 수 있는 수단 등으로 구성하여 활용하는 단계(C2)로 구성하였다.본 발명을 구성하고 있는 수단 중 운전자의 본인 여부를 확인하기 위하여 지문을 입력받는 수단인 생체 지문 정 <49>보 리더기(30-55)는 본 시스템 내부의 기억장치(30-30)에 먼저 지문을 등록한 후 등록된 지문과 비교하는 방식으로 본인 여부를 확인하고자 할 때 사용하는 수단으로 여러 명의 운전자가 한대의 차량을 운행할 때 운전자의 특징 정보를 정확하게 획득하여 축적하고 활용하는 과정에서 정확성을 유지하고자 구성한 수단으로 활용하고자 하였다. 상기의 구성은 비밀번호나 카드 또는 그 어떠한 방법으로 운전자를 확인하거나 인식하는 방법에 있어서 구성하는 것보다 운전자 정보를 획득하는데 용이한 이유에서 상기와 같이 구성을 하였으며, 본인 확인 여부 단계(D)에서는 사전에 지문을 등록하는 단계(D1);와 등록 후 동일인 의 지문인지 등의 여부를 매칭하는 단계(D2);로 구성한다.DMB 방송을 통한 교통정보의 실시간 수신이 가능하도록 구성한 수단인 디코더 장치(30-65)로부터 교통정보를 획 <50>득한 단계(E);에서는 차량을 운행하고 있는 운전자가 DMB 방송을 통하여 전송되고 있는 제반 교통정보를 수신하여 안전 운전을 수행하도록 하기 위하여 구성한 것이다.상기의 각각의 단계에서 획득한 정보를 메인 서버(90)에 저장관리 및 운영 활용하는 단계(F);에서는 운전자가 <51>차량을 차고지에서 출발하여 다시 차고지로 복귀하는 운행과정에서 생성한 모든 정보를 관리 서버(90)에 기록 저장하는 수단으로 구성하는 것을 특징으로 하는 지능형 운전자 안전 관리 방법에 관한 것이다.- 5 -공개특허 10-2007-0107373또한, 본 발명에서는 이상의 방법을 구현하기 위한 시스템을 구성하기 위한 내용을 상세하게 기술하면, 도 3은 <52>본 발명에 따른 지능형 안전 운전 관리시스템의 구성도이며, 내비게이션 기능과 얼굴인식 기능이 추가된 운전자 안전관리 시스템은 차량 내부에 설치되며, 차량이 출고 내거나 입고되는 과정에서 학습하여 생성한 정보는 관리 서버(90)와 통신을 통해 전송 기록하여 운전자에 따라 누적된 학습 정보는 향후 운전자의 안전 운전에 지원하는 기능을 수행한다. 이러한 지능형 안전 운전자 관리 시스템은 차량의 현재 위치정보를 수신하는 내비게이션 칩(30-10)이 내장되어, 갱신된 지도정보를 제공하는 지도정보 제공수단과, 이 지도정보 제공수단으로부터 지도정보를 수신하는 지능형 운전자 안전관리 시스템(30)으로부터 인가되는 지도정보 신호와 GPS 시스템(99)에서 인가되는 차량 위치정보 신호를 판독하는 중앙처리장치(30-20)와 이 중앙처리장치(30-20)에서 판독한 정보를 영상으로 표시하는 디스플레이(30-70)로 이루어진 지능형 운전자 안전 관리 시스템(30), GPS 시스템(99), 메인서버(90)와의 구성도를 도시하고 있다.도 3은 본 발명의 지능형 안전 운전자 관리 시스템에서 획득한 총체적인 내비게이션 정보 및 영상 정보를 기반 <53>으로 학습하고 안전 운전 관리를 수행하도록 구비된 시스템으로서 지도정보 제공수단은 GPS 시스템(99)으로부터 수신한 데이터를 이용하여 현재 차량의 위치 근방의 지도정보 데이터와 원하는 지역 또는 건물의 위치 데이터, 사용자가 원하는 최적 코스 등 지도 정보 기억장치(30-30)에 저장되어 있는 지도정보로부터 추출하고 운전자가 원하는 형태로 조합한 후 데이터를 전송해준다. 이때, 전송되는 데이터의 양은 데이터 전송에 걸리는 시간을 최소화하기 위해 목적지까지의 전체 지도 데이터를 전송하지 않고 진행방향 일정 거리만큼의 데이터만을 전송해준다. 사용자가 운전 중 목적지까지의 도로를 모르거나, 최적 코스 정보 등을 필요로 할 경우 디스플레이(30-70)를 이용하여 원하는 지역 또는 건물의 위치 및 현재 위치, 최적 경로 등의 원하는 사항을 선택하는 원래의 내비게이션 기능도 추가한다. 그리고 지능형 안전 운전자 관리 시스템(30)을 이용하여 지도정보 제공수단에 접속한 후, 접속이 성공되면 지도정보 제공수단으로부터 접속허용을 위한 접속허용 데이터를 지능형 안전 운전자 관리 시스템(30)으로 전송한다. 수신된 접속 허용 코드가 디스플레이(30-70) 화면에 전달되면 디스플레이(30-70) 화면상에 사용자가 선택한 지역이나 건물에 대한 데이터와 GPS 시스템(99)으로부터 수신한 자기 차량의 위치정보 데이터가 지능형 안전 운전자 관리 시스템(30)을 통해 지도정보 제공수단에 전송된다.이때, 지도정보 제공수단은 운전자로부터 수신된 데이터를 토대로 운전자가 원하는 정보를 지도 정보 데이터기 <54>억장치(30-30)에 저장된 지도정보로부터 추출한 후 운전자의 지능형 안전 운전자 관리 시스템(30)으로 전송해준다.지능형 운전자 안전관리 시스템(30)으로 수신된 데이터는 중앙처리장치(30-20)로 인가되어 제어기(30-20)에서 <55>수신된 정보를 판독하여 디스플레이(30-70) 화면에 표시되고, 차량의 현재 위치는 GPS(99)로부터 내비게이션 칩(30-10)으로 수신되어 중앙처리장치(30-20)에서 판독한 후 디스플레이(30-70) 화면의 지도 영상 위에 표시하는 내비게이션의 기능을 수행하도록 한다. 또한, 운전자의 본인 여부를 확인 과정에서 생체 정보를 이용할 수 있도록 지문인식 장치(3-55)를 구비하고, 카 <56>메라(30-60) 수단은 야간에도 얼굴 인식이 가능하도록 적외선 기능을 포함하고 있다. 따라서 본 발명에서의 특징으로는 생체 정보(지문과, 얼굴)를 최대한 활용할 수 있도록 구비하였으며, 이를 특징으로 하고 있다.상기의 구성은 지도를 판독하여 디스플레이(30-70)에 표시하고, 음성은 스피커(30-80)를 통해 표출하여 내비게 <57>이션 기능을 수행함과 동시에 운전자의 위치 추적을 통하여 생성된 날짜, 주행거리, 주행시간, 최고속도, 급브레이크 횟수, 위치, 최고속도, 평균 속도, 과속 속도 및 횟수 등을 기록함과 동시에 상기의 정보와 위성상태, 지도, 단속 카메라 정보, 사고다발지역 정보, 주유소 정보 등 다양한 서비스를 제공하도록 시스템이 구비됨과 더불어 카메라(30-60)를 통하여 운전자의 평소 운전 습관, 자세, 특이점을 지속적으로 학습하여 축적한 지식 베이스 자료와 일정한 시간 동안 주행한 거리 등을 실시간으로 확인하여 운전자가 안전 운전을 이행 여부를 자동으로 판단하고 제공할 수 있도록 구성하는 것을 특징으로 한다.도 4는 배터리(40-10)와 엔진부(40-20, 40-22, 40-24, 40-26) 및 RMP 정보를 용이하게 획득할 수 있도록 구성 <58>한 차량의 RPM 정보 인터페이스 유닛(40)와 지능형 운전자 안전관리 시스템(30)과 연동하여 유용한 RPM 및 배터리 충전 정보를 기록 및 관리하기 위한 시스템 구성도를 도시하고 있다.도 5는 관리 서버(90)에 대한 도면으로 운전자 안전관리 시스템이 차량에 시설 되고 상기 시스템에서 획득한 운 <59>행기록일지를 지속적으로 보관 관리하는 한계성으로 인하여 차량이 입고 또는 출고과정에서 운전자와 관련된 새로운 정보를 입력하거나 갱신할 필요에 따라 저장 및 관리 목적으로 구비한다. 상기의 관리 서버(90)와 지능형 운전자 안전관리 시스템(30)과의 통신은 무선으로 일정한 교신 반경에서 상호 통신을 통하여 인지될 때 자동으로 갱신할 수 있도록 구비하는 것을 특징으로 한다. 특히, 동일 차량을 지정한 운전자만 운전하는 경우 그 갱신- 6 -공개특허 10-2007-0107373의 경우는 운행일지만 요구되지만 동일한 차량에 대해 다수의 운전자가 운전하는 경우 해당 운전자의 정보를 새롭게 업로드 및 다운로드의 작업이 수시로 진행해야 하는데 있어서 상호 불편함이 없도록 원활한 통신 서비스 시스템이 이루어지도록 구성하여야하고, 관리 서버(90)는 다수의 차량과 다수의 운전자를 고용하여 운영하는 사업용 차량에 필수적이며, 갱신의 폭이 작은 개인용 차량의 경우는 특별한 관리 서버(90) 기능을 운전자 안전관리 시스템(30) 내의 데이터 기억장치에서 일정기간 동안을 대상으로 유지관리하는 방법으로 각각의 장치 부에서 획득한 정보를 최적화하여 기록 및 유지 관리할 수 있도록 구성하는 것을 특징으로 한다.도 6, 7, 8, 9는 본 발명의 안전운전 관리 시스템을 활용하고 운용하는 과정을 순서도로 도시하고 있다. 안전운 <60>전 관리시스템은 운전자가 운전석에 승차하고 차량 시동을 걸고 이동하기 시작할 때 외부에 있는 카메라가 운전자를 인식하고 인식한 운전자에 대해 저장된 학습데이터를 가지고 운전자와 비교를 한다. 비교 과정은 얼굴을 추적하는 과정에서 과도한 움직임 또는 눈 깜박임, 하품 등의 정보를 인식하고 차량 운행 시간 및 주행 거리 등을 관리하면서 운전자의 과로한 운전을 예방하여 미리 사고를 예방하는 효과를 거두고자 그 실시 예를 도시하고 있다.상기의 본 발명의 바람직한 실시 예에 따른 지능형 운전자 안전관리 시스템으로 내비게이션 기능과 상기의 내비 <61>게이션에서 획득한 정보를 단순히 제공하는 것으로 마무리가 되는 기존의 서비스를 넘어 실시간으로 주행시간, 주행거리, 과속정보, 최고속도, 급브레이크 횟수, 휴식횟수, 등의 안전 운전과 관련된 정보를 학습을 통하여 지식 베이스에 기록 유지 관리하고 실시간으로 운전자에게 안전 운전을 수행하도록 정보를 지원하며 부분적으로는 교통사고 원인 분석에 활용할 수 있도록 블랙박스 기능이 부가되었으며, 본 시스템의 실시 예에 한정하는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시 예는 본 발명의 개시가 완전하도록 통상의 지식을 가진자에게 발명의 범주를 완전하게 알려주기 위해 제공하는 것이다. 발명의 효과본 발명의 안전운전 관리 시스템을 활용하고 운용하는 과정을 순서도로 도시하고 있다. 안전운전 관리시스템은 <62>운전자가 운전석에 승차하고 차량 시동을 걸고 이동하기 시작할 때 외부에 있는 카메라가 운전자를 인식하고 인식한 운전자에 대해 저장된 학습데이터를 가지고 운전자와 비교를 한다. 비교 과정은 얼굴을 추적하는 과정에서 과도한 움직임 또는 눈 깜박임, 하품 등의 정보를 인식하고 차량 운행 시간 및 주행 거리 등을 관리하면서 운전자가 과로한 운전을 예방하여 미리 사고를 예방하는 효과와 운전자가 내리막길에서 시동을 끄고 차량을 운행하여 사고를 유발하는 경우가 종종 발생하는 문제점을 용이하게 파악하여 지도할 수 있는 효과와 운전자가 휴식하는 과정에서 공회전으로 인하여 환경오염과 연료 낭비의 원천적인 문제점 등의 제반 문제를 해결할 수 있는 효과가 기대된다. 도면의 간단한 설명도 1은 정보표시장치를 개략적으로 도시한 도면. <1>도 2는 본 발명의 지능형 운전자 안전관리 시스템을 이용한 구성도. <2>도 3은 안전운전 관리 시스템 블록도 <3>도 4은 차량의 RPM 정보 인터페이스 유닛 블록도 <4>도 5는 메인 서버 블록도 <5>도 6는 본 발명의 활용 실시 예의 순서도 <6>도 7는 본 발명의 활용 실시 예의 연결 순서도 <7>도 8는 본 발명의 활용 실시 예의 연결 순서도 <8>도 9는 본 발명의 활용 실시 예의 연결 순서도 <9>**도면의 주요 부분에 대한 부호의 설명** <10>2. GPS 수신기 <11>4. 휴대용 통신 단말기 <12>6. 제어기 <13>- 7 -공개특허 10-2007-01073738. 디스플레이 <14>10. GPS시스템 <15>30. 안전운전 관리 시스템 <16> 30-10. 내비게이션 칩 <17> 30-20. 중앙처리장치 <18> 30-30. 데이터 기억장치 <19> 30-35. 지식베이스 모듈 <20> 30-40. 무선 송수신 장치 <21> 30-50. 프로그램 기억장치 <22> 30-55. 지문인식 장치 <23> 30-60. 카메라 <24> 30-65. DMB 디코더 <25> 30-70. 영상 및 문자 표시장치 <26> 30-80. 음성 출력을 위한 스피커 <27> 30-93. 전원공급단자 <28>40. 차량의 RPM 정보 인터페이스 유닛 <29> 40-10. 배터리 <30> 40-20. 전자제어장치 <31> 40-22. 부란자 타코 센서 <32> 40-24. 미션 크랭크 센서 <33> 40-26. 인터페이스부 <34>90. 관리 서버 <35> 90-1. 중앙처리장치 <36> 90-10. 데이터베이스 <37> 90-20. 기억장치 <38> 90-40. 통신장치 <39> 90-50. 입출력장치 <40> 90-60. 위성수신장치 <41>99. 위성 GPS 시스템 <42>- 8 -공개특허 10-2007-0107373도면 도면1 도면2- 9 -공개특허 10-2007-0107373 도면3 도면4- 10 -공개특허 10-2007-0107373 도면5- 11 -공개특허 10-2007-0107373 도면6- 12 -공개특허 10-2007-0107373 도면7 도면8- 13 -공개특허 10-2007-0107373 도면9- 14 -공개특허 10-2007-0107373"}
{"patent_id": "10-2006-0039778", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 운전자 차량의 배터리(40-10)와 엔진부 ECU(40-20), 부란자의 타코 센서(40-22), 또는 차량 미션부의 크랭크 센서(40-24) 등으로부터 출력하는 신호 값 즉 자동차 RPM 값을 획득하는 단계(A);와 위성 GPS 시스템(9 9)에서 송신하는 신호와 내비게이션 칩(30-10)과 관련하여 생성한 시간, 날짜, 주행거리, 위치, 최고속도, 평균 속도, 위성상태, 지도, 카메라 정보, 주유소 정보 등을 획득하는 단계(B);와 영상 정보를 입력할 수 있는 수단인 카메라(30-60)를 이용하여 운전자의 얼굴 영상 정보를 획득하는 단계(C);와 운전자의 본인 여부를 확인하기 위하 여 지문을 입력받는 수단인 생체 지문 인식장치(30-55)로부터 지문 정보를 획득하는 단계(D);와 DMB 방송을 통한 교통정보의 실시간 수신이 가능하도록 구성한 수단인 디코더 장치(30-65)로부터 교통정보를 획득하는 단계(E);와 특히, 상기의 수단(30-60)에서 획득한 운전자의 평소 운전 습관 중 특이 행동, 눈 깜박임, 등 얼굴 부위를 중심 으로 변화 또는 움직임의 영상 정보를 학습하여 운전자에 대한 정보를 지식베이스로 생성하고 관리하는 단계 (C1);와 실시간으로 활용하는 단계(C2);와 차량의 배터리(40-10) 단에 전원의 공급 여부를 이용하여 차량을 관리 하는데 있어서 차량의 이동 및 시동 상태 등의 공회전 여부를 추후에 검사하기 위해 정보를 기록하는 단계(A 1);와 엔진부 ECU(40-20), 부란자의 타코 센서(40-22), 또는 차량 미션부의 크랭크 센서(40-24) 등으로부터 획 득하는 RPM 수치와 내비게이션의 변화 값(위치, 시간, 주행거리 등)을 기반으로 차량의 이동 및 시동 상태 등의 공회전 여부를 추후에 검사하기 위해 정보를 기록하는 단계(A2);와 상기의 각각의 단계에서 획득한 정보를 관리 서버에 저장관리 및 운영 활용하는 단계(F);를 기반으로 운전자의 본인 여부 확인, 및 차량의 공회전 여부, 이동 중 시동의 OFF 여부, 및 운전자가 주행 시작에서 10분 이상 이동하지 않는 경우 휴식으로 간주하고 상기의 휴식한 시간 동안 공회전 여부와, 주행 과정에서 운전자의 안전관리와 운전자에게 내비게이션 정보를 제공하는 것과 더불어 지속적으로 운전자에 대한 학습 정보를 기반으로 운전자가 안전 운전할 수 있도록 다양한 정보를 제 공하는 것을 특징으로 하는 지능형 운전자 안전관리 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2006-0039778", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 해당한다. 더불어, 운전자가 장시간 휴식을 하는데 환경 오염원이 될 수 있는 기준인 공회전 여 부를 확인할 수 있는 검사 분야이며, 내리막길에서 차량 시동을 OFF하고 운행하는 경향이 있는지, 급브레이크를 얼마나 자주 밟았는지, 평균속도, 주행거리, 방위 정보, 운전자의 헤드 제스처 정보 등의 다양한 엔터테인먼트"}
{"patent_id": "10-2006-0039778", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "정보를 제공하기 위한 영상 인식 및 멀티미디어 영상 송수신 기술분야 해당한다. 발명이 이루고자 하는 기술적 과제 본 발명은 상기 기술한 바와 같은 운전자로 하여금 안전 운전을 할 수 있도록 정확한 정보를 제공하기 <44> 위함이다. 따라서, 운전자가 운전석에 승차를 하면 운전자의 지문과 영상을 획득하고 상기 운전자에 대한 사전 정보를 조회하여 안전 운전 수행에 따른 정보를 제공하고 지속적으로 학습할 수 있도록 구성하며, 사전 등록이 돼 있지 않을 경우에는 향후에 사용할 목적으로 학습 데이터베이스를 지속적으로 구축할 수 있도록 그 환경을 설정해 주는 기술이 요구된다. 실례로 운전자가 휴식하는 동안에 간단한 정보, 음악, 뉴스를 시청할 수 있도록 DMB 방송 수신 디코더(30-65) 기능 및 GPS와 관련한 시간, 날짜, 주행거리, 위치, 최고속도, 평균속도, 위성 상 태, 지도, 카메라 정보, 주유소 정보 등의 기본적인 내비게이션 정보는 물론이며, 상기의 정보를 기반으로 운전 자의 운전 습관을 판단할 수 있도록 학습 정보를 제공할 수 있어야 한다. 또한, 운전자가 운행 차량을 이동하지 않고 공회전 상태로 장시간 휴식을 한 경우, 내리막길과 같은 위험 지역에서 시동을 끄고 차량을 운행하였는지, 급브레이크를 얼마나 자주 수행하였는지의 관리와, 중간 휴식이 없이 무리한 운전을 수행하는 운전자에게는 휴 식을 요구하는 등의 안전 운전수행관리 지침에 의거한 차량 및 운전자를 관리하여 최대한의 교통업무종사원의 과로를 방지하고 안전 정보를 제공하는데 그 목적이 있다. 발명의 구성 및 작용 본 발명에 의해 구성된 방법과 시스템을 운행 차량에 시설하므로 운전자의 안전 운행과 차량을 실질적으로 관리 <45> 하기 위한 방법과 시스템에 관한 것이다. 이에 대한 전체적인 도시는 도 2와 같다. 보다 구체적인 의미를 기술 하자면 본 발명 시스템의 구성은 내비게이션과 GPS와 관련한 위성 GPS 시스템, 차량에서 RPM 정보와 배터리 정보, 그리고 내비게이션에서 획득한 정보, 카메라에서 획득한 얼굴 정보 등을 차량의 안전 관리 목적과 연관하 기 위하여 기록함과 동시에 시간 대비 늘어나는 정보를 최적화하여 관리 서버에 축적하여 필요 따라 관리 목적으로 사용 가능한 구성한 부분을 보여주고 있다. 상기의 목적을 달성하기 위한 본 발명은 크게 차량을 관리할 목적으로 차량이 이동, 정지, 공회전, 이동하면서 <46> - 4 -공개특허 10-2007-0107373엔진의 가동 및 정지에 대한 상태 정보가 요구된다. 따라서, 본 발명에서는 차량의 RPM 정보 인터페이스 유닛 수단을 통하여 상기에서 기술한 차량의 엔진 상태 정보를 추출할 목적으로 구성하였다. 즉 차량에 대한 이 동 및 정지 상태의 정보를 RPM(Revolutions Per Minute: 회전체가 1분 동안 회전하는 회전수를 나타내는 단위) 이라는 단위 정보를 통하여 판단하고자 구성하였다. 통상적으로 RPM 정보를 획득하기 위해서는 엔진부 ECU(40- 20), 부란자의 타코 센서(40-22), 또는 차량 미션부의 크랭크 센서(40-24) 등으로부터 출력하는 신호 값 즉 차 량의 RPM 값을 획득하는데 본 발명에서 구성하고 있는 상기의 수단은 RPM 정보를 표출하고 있는 방식에 있 어서 아날로그 방식 또는 디지털 방식으로 구성하고 있는 문제점을 완전히 극복하고 상기의 이외의 단자에도 접 속이 용이하게 구성하여 차량의 시동 상태 정보를 획득하는 인터페이스 기능을 수행할 수 있도록 구성하였으며, 또한 RPM 정보를 부득이 획득하지 못하는 경우를 대비하여 차량의 배터리(40-10)에 전력을 공급하는 상태를 통 하여 차량의 시동 및 정지 정보를 추출할 수 있는 특징을 이용하여 배터리(40-10)에서도 용이하게 접속할 수 있 도록 통합할 수 있는 수단을 이용하여 차량정보를 획득하는 단계(A);로 구성하였다. 즉, 차량의 배터리(40-10) 단에 전원의 공급 여부를 이용하여 차량을 관리하는데 있어서 차량의 이동 및 시동 상태 등의 공회전 여부를 검 사하는 단계(A1);와 엔진부 ECU(40-20), 부란자의 타코 센서(40-22), 또는 차량 미션부의 크랭크 센서(40-24) 등을 포함하는 것을 물론 통상적으로 차량의 특성에 따라서 차량의 엔진부와 연결이 가능하여 RPM 수치를 획득 함과 동시에, 내비게이션의 변화 값(위치, 시간, 주행거리 등)을 기반으로 차량의 이동 및 시동 상태 등의 공회 전 여부를 검사하는 단계(A2);로 구성하여 차량의 정확한 이동 상태, 정지 상태, 정지중 시동의 여부를 판단 할 수 있는 수단을 수행할 수 있도록 구성하는 것을 특징으로 한다. 위성 GPS 시스템에서 송신하는 신호와 내비게이션 칩(30-10)과 관련하여 생성한 시간, 날짜, 주행거리, 위 <47> 치, 최고속도, 평균 속도, 위성상태, 지도, 카메라 정보, 주유소 정보 등을 획득하는 단계(B);는 도 3과 같이 GPS 위성 시스템에서 송신하는 시간, 거리, 위치, 속도, 주행거리, 날짜, 최고속도 등의 항법 정보를 제공 받을 수 있는 내비게이션 칩(30-10) 수단; 상기의 장치(30-10)에서 획득한 정보를 기반으로 지식 베이스 처리를 담당하는 중앙처리장치(30-20) 수단; 상기의 정보를 기억한 후 운전자의 안전 운전을 위한 정보를 저장하는 기 능을 수행하는 데이터 기억장치(30-30) 수단; 지식 베이스 생성하고 가공하고 저장하고 제공하는 총괄 처리를 수행하는 지식 베이스 모듈(30-35)의 수단; GPS, 관리 서버 등의 내부 또는 외부 장치들과 정보를 교신 하기 위한 유무선 송수신 장치(30-40) 수단; 얼굴인식, 지식 베이스 관리, 제반 정보를 관리하고 수행하는 내장 형 프로그램을 기억하는 기능을 수행하는 프로그램 기억장치(30-50) 수단; 운전자의 얼굴 영상을 입력받기 위한 카메라(30-60) 수단; DMB 방송을 통하여 전송되는 정보를 수신하기 위한 DMB 디코더(30-65), 지도를 포함한 내 비게이션 정보 및 지식베이스 정보를 영상 또는 문자를 표시하기 위한 영상 및 문자 표시장치(30-70) 수단; 음 성을 표출하기 위한 스피커(30-80) 수단; 전원공급단자 수단 등으로 구성하였다. 영상 정보를 입력할 수 있는 수단인 카메라(30-60)를 이용하여 운전자의 얼굴 영상 정보를 획득하는 단계(C);로 <48> 상기의 장치(30-60)에서는 획득한 운전자의 머리 부분의 이동 및 제스처에 따른 좌표값을 기반으로 평소 운전 습관 중 특이 행동, 눈 깜박임, 등 얼굴 부위를 중심으로 변화 또는 움직임의 영상 정보를 학습하여 운전자의 정보를 생성하는 단계(C1);와 생성한 상기의 정보를 기반으로 운전자의 과로 상태 여부, 또는 운전자의 습관적 행위의 결과 인지를 판단할 수 있는 수단 등으로 구성하여 활용하는 단계(C2)로 구성하였다. 본 발명을 구성하고 있는 수단 중 운전자의 본인 여부를 확인하기 위하여 지문을 입력받는 수단인 생체 지문 정 <49> 보 리더기(30-55)는 본 시스템 내부의 기억장치(30-30)에 먼저 지문을 등록한 후 등록된 지문과 비교하는 방식 으로 본인 여부를 확인하고자 할 때 사용하는 수단으로 여러 명의 운전자가 한대의 차량을 운행할 때 운전자의 특징 정보를 정확하게 획득하여 축적하고 활용하는 과정에서 정확성을 유지하고자 구성한 수단으로 활용하고자 하였다. 상기의 구성은 비밀번호나 카드 또는 그 어떠한 방법으로 운전자를 확인하거나 인식하는 방법에 있어서 구성하는 것보다 운전자 정보를 획득하는데 용이한 이유에서 상기와 같이 구성을 하였으며, 본인 확인 여부 단 계(D)에서는 사전에 지문을 등록하는 단계(D1);와 등록 후 동일인 의 지문인지 등의 여부를 매칭하는 단계(D 2);로 구성한다. DMB 방송을 통한 교통정보의 실시간 수신이 가능하도록 구성한 수단인 디코더 장치(30-65)로부터 교통정보를 획 <50> 득한 단계(E);에서는 차량을 운행하고 있는 운전자가 DMB 방송을 통하여 전송되고 있는 제반 교통정보를 수신하 여 안전 운전을 수행하도록 하기 위하여 구성한 것이다. 상기의 각각의 단계에서 획득한 정보를 메인 서버에 저장관리 및 운영 활용하는 단계(F);에서는 운전자가 <51> 차량을 차고지에서 출발하여 다시 차고지로 복귀하는 운행과정에서 생성한 모든 정보를 관리 서버에 기록 저장하는 수단으로 구성하는 것을 특징으로 하는 지능형 운전자 안전 관리 방법에 관한 것이다. - 5 -공개특허 10-2007-0107373또한, 본 발명에서는 이상의 방법을 구현하기 위한 시스템을 구성하기 위한 내용을 상세하게 기술하면, 도 3은 <52> 본 발명에 따른 지능형 안전 운전 관리시스템의 구성도이며, 내비게이션 기능과 얼굴인식 기능이 추가된 운전자 안전관리 시스템은 차량 내부에 설치되며, 차량이 출고 내거나 입고되는 과정에서 학습하여 생성한 정보는 관리 서버와 통신을 통해 전송 기록하여 운전자에 따라 누적된 학습 정보는 향후 운전자의 안전 운전에 지원하는 기능을 수행한다. 이러한 지능형 안전 운전자 관리 시스템은 차량의 현재 위치정보를 수신하는 내비게이션 칩 (30-10)이 내장되어, 갱신된 지도정보를 제공하는 지도정보 제공수단과, 이 지도정보 제공수단으로부터 지도정 보를 수신하는 지능형 운전자 안전관리 시스템으로부터 인가되는 지도정보 신호와 GPS 시스템에서 인가 되는 차량 위치정보 신호를 판독하는 중앙처리장치(30-20)와 이 중앙처리장치(30-20)에서 판독한 정보를 영상으 로 표시하는 디스플레이(30-70)로 이루어진 지능형 운전자 안전 관리 시스템, GPS 시스템, 메인서버 와의 구성도를 도시하고 있다. 도 3은 본 발명의 지능형 안전 운전자 관리 시스템에서 획득한 총체적인 내비게이션 정보 및 영상 정보를 기반 <53> 으로 학습하고 안전 운전 관리를 수행하도록 구비된 시스템으로서 지도정보 제공수단은 GPS 시스템으로부터 수신한 데이터를 이용하여 현재 차량의 위치 근방의 지도정보 데이터와 원하는 지역 또는 건물의 위치 데이터, 사용자가 원하는 최적 코스 등 지도 정보 기억장치(30-30)에 저장되어 있는 지도정보로부터 추출하고 운전자가 원하는 형태로 조합한 후 데이터를 전송해준다. 이때, 전송되는 데이터의 양은 데이터 전송에 걸리는 시간을 최 소화하기 위해 목적지까지의 전체 지도 데이터를 전송하지 않고 진행방향 일정 거리만큼의 데이터만을 전송해준 다. 사용자가 운전 중 목적지까지의 도로를 모르거나, 최적 코스 정보 등을 필요로 할 경우 디스플레이(30- 70)를 이용하여 원하는 지역 또는 건물의 위치 및 현재 위치, 최적 경로 등의 원하는 사항을 선택하는 원래의 내비게이션 기능도 추가한다. 그리고 지능형 안전 운전자 관리 시스템을 이용하여 지도정보 제공수단에 접 속한 후, 접속이 성공되면 지도정보 제공수단으로부터 접속허용을 위한 접속허용 데이터를 지능형 안전 운전자 관리 시스템으로 전송한다. 수신된 접속 허용 코드가 디스플레이(30-70) 화면에 전달되면 디스플레이(30- 70) 화면상에 사용자가 선택한 지역이나 건물에 대한 데이터와 GPS 시스템으로부터 수신한 자기 차량의 위 치정보 데이터가 지능형 안전 운전자 관리 시스템을 통해 지도정보 제공수단에 전송된다. 이때, 지도정보 제공수단은 운전자로부터 수신된 데이터를 토대로 운전자가 원하는 정보를 지도 정보 데이터기 <54> 억장치(30-30)에 저장된 지도정보로부터 추출한 후 운전자의 지능형 안전 운전자 관리 시스템으로 전송해준 다. 지능형 운전자 안전관리 시스템으로 수신된 데이터는 중앙처리장치(30-20)로 인가되어 제어기(30-20)에서 <55> 수신된 정보를 판독하여 디스플레이(30-70) 화면에 표시되고, 차량의 현재 위치는 GPS로부터 내비게이션 칩 (30-10)으로 수신되어 중앙처리장치(30-20)에서 판독한 후 디스플레이(30-70) 화면의 지도 영상 위에 표시하는 내비게이션의 기능을 수행하도록 한다. 또한, 운전자의 본인 여부를 확인 과정에서 생체 정보를 이용할 수 있도록 지문인식 장치(3-55)를 구비하고, 카 <56> 메라(30-60) 수단은 야간에도 얼굴 인식이 가능하도록 적외선 기능을 포함하고 있다. 따라서 본 발명에서의 특 징으로는 생체 정보(지문과, 얼굴)를 최대한 활용할 수 있도록 구비하였으며, 이를 특징으로 하고 있다. 상기의 구성은 지도를 판독하여 디스플레이(30-70)에 표시하고, 음성은 스피커(30-80)를 통해 표출하여 내비게 <57> 이션 기능을 수행함과 동시에 운전자의 위치 추적을 통하여 생성된 날짜, 주행거리, 주행시간, 최고속도, 급브 레이크 횟수, 위치, 최고속도, 평균 속도, 과속 속도 및 횟수 등을 기록함과 동시에 상기의 정보와 위성상태, 지도, 단속 카메라 정보, 사고다발지역 정보, 주유소 정보 등 다양한 서비스를 제공하도록 시스템이 구비됨과 더불어 카메라(30-60)를 통하여 운전자의 평소 운전 습관, 자세, 특이점을 지속적으로 학습하여 축적한 지식 베 이스 자료와 일정한 시간 동안 주행한 거리 등을 실시간으로 확인하여 운전자가 안전 운전을 이행 여부를 자동 으로 판단하고 제공할 수 있도록 구성하는 것을 특징으로 한다. 도 4는 배터리(40-10)와 엔진부(40-20, 40-22, 40-24, 40-26) 및 RMP 정보를 용이하게 획득할 수 있도록 구성 <58> 한 차량의 RPM 정보 인터페이스 유닛와 지능형 운전자 안전관리 시스템과 연동하여 유용한 RPM 및 배터 리 충전 정보를 기록 및 관리하기 위한 시스템 구성도를 도시하고 있다. 도 5는 관리 서버에 대한 도면으로 운전자 안전관리 시스템이 차량에 시설 되고 상기 시스템에서 획득한 운 <59> 행기록일지를 지속적으로 보관 관리하는 한계성으로 인하여 차량이 입고 또는 출고과정에서 운전자와 관련된 새 로운 정보를 입력하거나 갱신할 필요에 따라 저장 및 관리 목적으로 구비한다. 상기의 관리 서버와 지능형 운전자 안전관리 시스템과의 통신은 무선으로 일정한 교신 반경에서 상호 통신을 통하여 인지될 때 자동으 로 갱신할 수 있도록 구비하는 것을 특징으로 한다. 특히, 동일 차량을 지정한 운전자만 운전하는 경우 그 갱신 - 6 -공개특허 10-2007-0107373의 경우는 운행일지만 요구되지만 동일한 차량에 대해 다수의 운전자가 운전하는 경우 해당 운전자의 정보를 새 롭게 업로드 및 다운로드의 작업이 수시로 진행해야 하는데 있어서 상호 불편함이 없도록 원활한 통신 서비스 시스템이 이루어지도록 구성하여야하고, 관리 서버는 다수의 차량과 다수의 운전자를 고용하여 운영하는 사 업용 차량에 필수적이며, 갱신의 폭이 작은 개인용 차량의 경우는 특별한 관리 서버 기능을 운전자 안전관 리 시스템 내의 데이터 기억장치에서 일정기간 동안을 대상으로 유지관리하는 방법으로 각각의 장치 부에서 획득한 정보를 최적화하여 기록 및 유지 관리할 수 있도록 구성하는 것을 특징으로 한다. 도 6, 7, 8, 9는 본 발명의 안전운전 관리 시스템을 활용하고 운용하는 과정을 순서도로 도시하고 있다. 안전운 <60> 전 관리시스템은 운전자가 운전석에 승차하고 차량 시동을 걸고 이동하기 시작할 때 외부에 있는 카메라가 운전 자를 인식하고 인식한 운전자에 대해 저장된 학습데이터를 가지고 운전자와 비교를 한다. 비교 과정은 얼굴을 추적하는 과정에서 과도한 움직임 또는 눈 깜박임, 하품 등의 정보를 인식하고 차량 운행 시간 및 주행 거리 등 을 관리하면서 운전자의 과로한 운전을 예방하여 미리 사고를 예방하는 효과를 거두고자 그 실시 예를 도시하고 있다. 상기의 본 발명의 바람직한 실시 예에 따른 지능형 운전자 안전관리 시스템으로 내비게이션 기능과 상기의 내비 <61> 게이션에서 획득한 정보를 단순히 제공하는 것으로 마무리가 되는 기존의 서비스를 넘어 실시간으로 주행시간, 주행거리, 과속정보, 최고속도, 급브레이크 횟수, 휴식횟수, 등의 안전 운전과 관련된 정보를 학습을 통하여 지 식 베이스에 기록 유지 관리하고 실시간으로 운전자에게 안전 운전을 수행하도록 정보를 지원하며 부분적으로는 교통사고 원인 분석에 활용할 수 있도록 블랙박스 기능이 부가되었으며, 본 시스템의 실시 예에 한정하는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시 예는 본 발명의 개시가 완전하도록 통상의 지식 을 가진자에게 발명의 범주를 완전하게 알려주기 위해 제공하는 것이다."}
{"patent_id": "10-2006-0039778", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 안전운전 관리 시스템을 활용하고 운용하는 과정을 순서도로 도시하고 있다. 안전운전 관리시스템은 <62> 운전자가 운전석에 승차하고 차량 시동을 걸고 이동하기 시작할 때 외부에 있는 카메라가 운전자를 인식하고 인 식한 운전자에 대해 저장된 학습데이터를 가지고 운전자와 비교를 한다. 비교 과정은 얼굴을 추적하는 과정에서 과도한 움직임 또는 눈 깜박임, 하품 등의 정보를 인식하고 차량 운행 시간 및 주행 거리 등을 관리하면서 운전 자가 과로한 운전을 예방하여 미리 사고를 예방하는 효과와 운전자가 내리막길에서 시동을 끄고 차량을 운행하 여 사고를 유발하는 경우가 종종 발생하는 문제점을 용이하게 파악하여 지도할 수 있는 효과와 운전자가 휴식하 는 과정에서 공회전으로 인하여 환경오염과 연료 낭비의 원천적인 문제점 등의 제반 문제를 해결할 수 있는 효 과가 기대된다."}
