{"patent_id": "10-2023-0071636", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0172944", "출원번호": "10-2023-0071636", "발명의 명칭": "산소를 포함하는 수액을 공급하기 위한 산소 공급 장치 및 시스템", "출원인": "한림대학교 산학협력단", "발명자": "이윤재"}}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "산소 공급을 수행하기 위한 시스템에 있어서,환자에게 수액을 제공하기 위한 수액 공급 장치; 및상기 수액 공급 장치가 제공하는 수액에 산소를 공급하기 위한 산소 공급 장치;를 포함하는, 시스템."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 수액 공급 장치는,수액을 저장하기 위한 수액 저장 용기;수액을 이송하기 위한 수액 이송관; 및수액을 환자에게 주입하기 위한 수액 주입부;를 포함하고,상기 산소 공급 장치는,상기 수액 이송관을 통해 이송되는 수액에 산소를 공급하는, 시스템."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 산소 공급 장치는,상기 수액 이송관의 적어도 일부 구간에 해당하는 수액 영역;상기 수액 영역에 포함된 수액과 접촉하기 위한 분리막; 및상기 분리막을 기준으로 상기 수액 영역의 반대쪽에 형성되며, 일정 농도 이상의 산소를 포함하는, 기체 영역;을 포함하는, 시스템."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 산소 공급 장치는,환자의 혈액 내 이산화탄소의 농도를 측정하기 위한 센서; 및상기 기체 영역에 산소를 제공하기 위한 산소 공급부;를 포함하고,상기 산소 공급부는,상기 센서의 센싱 데이터에 따라 이산화탄소의 농도가 임계치 이상인 것으로 식별된 경우, 상기 기체 영역의 산소 농도를 감소시키는, 시스템."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 수액 이송관을 구성하는 복수의 구간 각각에 해당하는 복수의 수액 영역;상기 복수의 수액 영역 각각에 포함된 수액과 접촉하기 위한 복수의 분리막; 및상기 복수의 분리막 각각을 기준으로 상기 복수의 수액 영역 각각의 반대쪽에 형성되며, 일정 농도 이상의 산소공개특허 10-2024-0172944-3-를 포함하는, 복수의 기체 영역;을 포함하는, 시스템."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 산소 공급 장치는,환자의 혈액 내 이산화탄소의 농도를 측정하기 위한 센서; 및상기 기체 영역에 산소를 제공하기 위한 산소 공급부;를 포함하고,상기 산소 공급부는,상기 센서를 통해 측정된 이산화탄소의 농도를 바탕으로, 상기 복수의 기체 영역 각각의 산소 농도를 조정하는,시스템."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 산소 공급부는,환자의 혈액 내 이산화탄소의 농도가 임계치 이상인 경우, 이산화탄소의 농도가 높을수록 상기 복수의 기체 영역의 평균 산소 농도를 감소시키는, 시스템."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 산소 공급 장치는,상기 센서의 센싱 데이터를 바탕으로 상기 산소 공급부를 제어하기 위한 제어부;를 더 포함하고,상기 제어부는,환자의 혈액 내 이산화탄소의 농도가 임계치 이상으로 증가됨에 따라 제1 기체 영역의 산소 농도가 일정 농도만큼 감소된 경우, 환자의 혈액 내 이산화탄소의 농도의 제1 변화량을 식별하고,환자의 혈액 내 이산화탄소의 농도가 임계치 이상으로 증가됨에 따라 제2 기체 영역의 산소 농도가 일정 농도만큼 감소된 경우, 환자의 혈액 내 이산화탄소의 농도의 제2 변화량을 식별하고,상기 제1 변화량 및 상기 제2 변화량을 바탕으로, 상기 제1 기체 영역 및 상기 제2 기체 영역에 대하여 산소 농도의 조정을 위한 우선순위를 설정하는, 시스템."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "수액 공급 장치가 제공하는 수액에 산소를 공급하기 위한 산소 공급 장치에 있어서,상기 수액 공급 장치의 수액 이송관의 적어도 일부 구간에 해당하는 수액 영역;상기 수액 영역에 포함된 수액과 접촉하기 위한 분리막; 및상기 분리막을 기준으로 상기 수액 영역의 반대쪽에 형성되며, 일정 농도 이상의 산소를 포함하는, 기체 영역;을 포함하는, 산소 공급 장치."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "수액 공급 장치가 제공하는 수액에 산소를 공급하기 위한 상기 산소 공급 장치에 있어서,상기 수액 공급 장치의 수액 이송관의 적어도 일부 구간에 해당하는 수액 영역;상기 수액 영역에 포함된 수액과 접촉하기 위한 분리막;상기 분리막을 기준으로 상기 수액 영역의 반대쪽에 형성되며, 일정 농도 이상의 산소를 포함하는, 기체 영역;를 포함하고,공개특허 10-2024-0172944-4-상기 산소 공급 장치는,환자의 혈액 내 이산화탄소의 농도를 측정하기 위한 센서; 및상기 기체 영역에 산소를 제공하기 위한 산소 공급부;를 더 포함하는, 산소 공급 장치."}
{"patent_id": "10-2023-0071636", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "수액 이송관을 포함하는 수액 공급 장치; 및수액 공급 장치가 제공하는 수액에 산소를 공급하기 위한 상기 산소 공급 장치;를 포함하는 시스템에 있어서,상기 산소 공급 장치는,상기 수액 이송관의 적어도 일부 구간에 해당하는 수액 영역;상기 수액 영역에 포함된 수액과 접촉하기 위한 분리막; 및상기 분리막을 기준으로 상기 수액 영역의 반대쪽에 형성되며, 일정 농도 이상의 산소를 포함하는, 기체 영역;을 포함하는, 산소 공급 장치."}
{"patent_id": "10-2023-0071636", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "산소 공급을 수행하기 위한 시스템이 개시된다. 본 시스템은, 환자에게 수액을 제공하기 위한 수액 공급 장치, 수액 공급 장치가 제공하는 수액에 산소를 공급하기 위한 산소 공급 장치를 포함한다."}
{"patent_id": "10-2023-0071636", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 환자에게 산소를 공급하기 위한 산소 공급 장치에 관한 것으로, 보다 상세하게는, 환자에게 제공되는 수액을 통해 산소를 공급하는 산소 공급 장치 내지는 시스템에 관한 것이다."}
{"patent_id": "10-2023-0071636", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "심폐소생술, 패혈증, 중증외상 등을 치료하는데 있어 필수적인 부분들 중 하나는 바로 환자에게 산소를 적절하 게 공급하여 환자의 조직에 산소 공급이 적절히 유지되도록 하는 것이라고 할 수 있다. 이러한 치료 목적을 달성하기 위해 현재 기관 삽관을 통해 인공호흡을 유지시키는 방식, 산소마스크나 고유속 산소 공급 등을 적용하여 환자에게 산소를 공급하는 방식 등이 채택되고 있다. 그러나, 이러한 치료는 환자의 폐 상태와 전반적인 환자 상태에 따라서 많은 차이가 생길 수 있고 그 효과가 크지 않은 경우도 있어 이에 대한 대안으로 ECMO 등 더 침습적이고 위험한 치료 방법이 채택되기도 한다. 과거 고농도 산소 수액법에 대한 연구가 있었고, 관련 특허도 있었으나, 산소(기체)를 액체에 녹이는 방법으로 제안되었던 방식은 고압을 이용한 방법이었다. 이는, 산소를 녹일 수 있는 효과적인 방법일 수 있지만, 고압에 의해 산소가 농축된 수액이 환자의 혈관 내로 주입되게 되면 압력이 갑자기 떨어지게 되어 환자 혈관 내에서 기 체가 생성되면서 혈관의 폐쇄 등을 유발할 수 있어 위험이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-2476606호(의료용 혈액 및 액체 고압 산소 농축 제조장치)"}
{"patent_id": "10-2023-0071636", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 환자의 혈관을 통해 주입되는 수액이 통과하는 수액관에 산소를 녹여 산소 분압이 증가된 수액이 환 자의 혈관을 통해 주입되도록 하는 산소 공급 장치 및 시스템을 제공한다. 본 개시의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 개시의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 개시의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 개시의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을것이다."}
{"patent_id": "10-2023-0071636", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따라 산소 공급을 수행하기 위한 시스템은, 환자에게 수액을 제공하기 위한 수액 공급 장치, 상기 수액 공급 장치가 제공하는 수액에 산소를 공급하기 위한 산소 공급 장치를 포함한다. 상기 수액 공급 장치는, 수액을 저장하기 위한 수액 저장 용기, 수액을 이송하기 위한 수액 이송관, 수액을 환 자에게 주입하기 위한 수액 주입부를 포함할 수 있다. 상기 산소 공급 장치는, 상기 수액 이송관을 통해 이송되 는 수액에 산소를 공급할 수 있다. 여기서, 상기 산소 공급 장치는, 상기 수액 이송관의 적어도 일부 구간에 해당하는 수액 영역, 상기 수액 영역 에 포함된 수액과 접촉하기 위한 분리막, 상기 분리막을 기준으로 상기 수액 영역의 반대쪽에 형성되며, 일정 농도 이상의 산소를 포함하는, 기체 영역을 포함할 수 있다. 이때, 상기 산소 공급 장치는, 환자의 혈액 내 이산화탄소의 농도를 측정하기 위한 센서, 상기 기체 영역에 산 소를 제공하기 위한 산소 공급부를 포함할 수 있으며, 상기 산소 공급부는, 상기 센서의 센싱 데이터에 따라 이 산화탄소의 농도가 임계치 이상인 것으로 식별된 경우, 상기 기체 영역의 산소 농도를 감소시킬 수 있다. 한편, 상기 산소 공급 장치는, 상기 수액 이송관을 구성하는 복수의 구간 각각에 해당하는 복수의 수액 영역, 상기 복수의 수액 영역 각각에 포함된 수액과 접촉하기 위한 복수의 분리막, 상기 복수의 분리막 각각을 기준으 로 상기 복수의 수액 영역 각각의 반대쪽에 형성되며, 일정 농도 이상의 산소를 포함하는, 복수의 기체 영역을 포함할 수 있다. 여기서, 상기 산소 공급 장치는, 환자의 혈액 내 이산화탄소의 농도를 측정하기 위한 센서, 상기 기체 영역에 산소를 제공하기 위한 산소 공급부를 포함할 수 있으며, 상기 산소 공급부는, 상기 센서를 통해 측정된 이산화 탄소의 농도를 바탕으로, 상기 복수의 기체 영역 각각의 산소 농도를 조정할 수 있다. 이 경우, 상기 산소 공급부는, 환자의 혈액 내 이산화탄소의 농도가 임계치 이상인 경우, 이산화탄소의 농도가 높을수록 상기 복수의 기체 영역의 평균 산소 농도를 감소시킬 수 있다. 또한, 상기 산소 공급 장치는, 상기 센서의 센싱 데이터를 바탕으로 상기 산소 공급부를 제어하기 위한 제어부 를 더 포함할 수 있다. 상기 제어부는, 환자의 혈액 내 이산화탄소의 농도가 임계치 이상으로 증가됨에 따라 제 1 기체 영역의 산소 농도가 일정 농도만큼 감소된 경우, 환자의 혈액 내 이산화탄소의 농도의 제1 변화량을 식 별하고, 환자의 혈액 내 이산화탄소의 농도가 임계치 이상으로 증가됨에 따라 제2 기체 영역의 산소 농도가 일 정 농도만큼 감소된 경우, 환자의 혈액 내 이산화탄소의 농도의 제2 변화량을 식별하고, 상기 제1 변화량 및 상 기 제2 변화량을 바탕으로, 상기 제1 기체 영역 및 상기 제2 기체 영역에 대하여 산소 농도의 조정을 위한 우선 순위를 설정할 수 있다. 본 개시의 일 실시 예에 따라 수액 공급 장치가 제공하는 수액에 산소를 공급하기 위한 상기 산소 공급 장치는, 상기 수액 공급 장치의 수액 이송관의 적어도 일부 구간에 해당하는 수액 영역, 상기 수액 영역에 포함된 수액 과 접촉하기 위한 분리막, 상기 분리막을 기준으로 상기 수액 영역의 반대쪽에 형성되며, 일정 농도 이상의 산 소를 포함하는, 기체 영역을 포함한다. 본 개시의 일 실시 예에 따라 수액 공급 장치가 제공하는 수액에 산소를 공급하기 위한 상기 산소 공급 장치는, 상기 수액 공급 장치의 수액 이송관의 적어도 일부 구간에 해당하는 수액 영역, 상기 수액 영역에 포함된 수액 과 접촉하기 위한 분리막, 상기 분리막을 기준으로 상기 수액 영역의 반대쪽에 형성되며, 일정 농도 이상의 산 소를 포함하는, 기체 영역를 포함한다. 상기 산소 공급 장치는, 환자의 혈액 내 이산화탄소의 농도를 측정하기 위한 센서, 상기 기체 영역에 산소를 제공하기 위한 산소 공급부를 더 포함한다."}
{"patent_id": "10-2023-0071636", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 산소 공급 장치 내지 시스템은, 환자에 대한 침습 없이 수액을 통해 산소를 공급할 수 있다는 장점이 있다. 또한, 본 개시에 따른 산소 공급 장치 내지 시스템은, 산소 공급 과정에서 환자의 혈액 내 이산화탄소가 누적되 는 상황을 방지하기 위한 센싱 기반의 제어 동작을 수행할 수도 있다."}
{"patent_id": "10-2023-0071636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에 대하여 구체적으로 설명하기에 앞서, 본 명세서 및 도면의 기재 방법에 대하여 설명한다. 먼저, 본 명세서 및 청구범위에서 사용되는 용어는 본 개시의 다양한 실시 예들에서의 기능을 고려하여 일반적 인 용어들을 선택하였다. 하지만, 이러한 용어들은 당해 기술 분야에 종사하는 기술자의 의도나 법률적 또는 기 술적 해석 및 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 일부 용어는 출원인이 임의로 선정한 용어 도 있다. 이러한 용어에 대해서는 본 명세서에서 정의된 의미로 해석될 수 있으며, 구체적인 용어 정의가 없으 면 본 명세서의 전반적인 내용 및 당해 기술 분야의 통상적인 기술 상식을 토대로 해석될 수도 있다. 또한, 본 명세서에 첨부된 각 도면에 기재된 동일한 참조번호 또는 부호는 실질적으로 동일한 기능을 수행하는 부품 또는 구성요소를 나타낸다. 설명 및 이해의 편의를 위해서 서로 다른 실시 예들에서도 동일한 참조번호 또 는 부호를 사용하여 설명한다. 즉, 복수의 도면에서 동일한 참조 번호를 가지는 구성요소를 모두 도시되어 있다 고 하더라도, 복수의 도면들이 하나의 실시 예를 의미하는 것은 아니다. 또한, 본 명세서 및 청구범위에서는 구성요소들 간의 구별을 위하여 \"제1\", \"제2\" 등과 같이 서수를 포함하는 용어가 사용될 수 있다. 이러한 서수는 동일 또는 유사한 구성요소들을 서로 구별하기 위하여 사용하는 것이며 이러한 서수 사용으로 인하여 용어의 의미가 한정 해석되어서는 안 된다. 일 예로, 이러한 서수와 결합된 구성 요소는 그 숫자에 의해 사용 순서나 배치 순서 등이 제한되어서는 안 된다. 필요에 따라서는, 각 서수들은 서로 교체되어 사용될 수도 있다. 본 명세서에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 실시 예에서 \"모듈\", \"유닛\", \"부(part)\" 등과 같은 용어는 적어도 하나의 기능이나 동작을 수행하는 구성요소를 지칭하기 위한 용어이며, 이러한 구성요소는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\", \"유닛\", \"부(part)\" 등은 각각이 개별적인 특정 한 하드웨어로 구현될 필요가 있는 경우를 제외하고는, 적어도 하나의 모듈이나 칩으로 일체화되어 적어도 하나 의 프로세서로 구현될 수 있다. 또한, 본 개시의 실시 예에서, 어떤 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적인 연결뿐 아니라, 다른 매체를 통한 간접적인 연결의 경우도 포함한다. 또한, 어떤 부분이 어떤 구성요소를 포함한다는 의미는, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것 을 의미한다. 도 1은 본 개시의 일 실시 예에 따라 수액 공급 장치의 수액에 산소를 공급하는 산소 공급 장치의 동작을 설명 하기 위한 도면이다. 도 1을 참조하면, 산소 공급 장치는 환자에게 수액을 제공하기 위한 수액 공급 장치의 적어도 일부와 연결될 수 있다. 구체적으로, 산소 공급 장치는 수액 공급 장치가 제공하는 수액에 산소를 공급할 수있다. 구체적으로, 도 1을 참조하면, 수액 공급 장치는 수액을 저장하기 위한 수액 저장 용기, 수액을 이송하기 위한 수액 이송관, 수액을 환자에게 주입하기 위한 수액 주입부를 포함할 수 있다. 수액 공급 장치를 구성하는 수액 저장 용기, 수액 이송관, 수액 주입부는 각각 종래의 일반적인 구성에 해 당한다. 수액 저장 용기는 밀폐된 상태로 수액을 보관하기 위한 다양한 소재로 구성될 수 있으며, 수액 이송관 과 연결될 수 있다. 수액 이송관은 예를 들어 튜브 형태로 구성되어 수액을 수액 주입부로 전달할 수 있다. 이 를 위해, 수액 공급 시 수액 저장 용기는 수액 주입부보다 높은 곳에 위치하거나, 또는 위치와 관계없이 수액의 흐름을 조정하기 위한 펌프가 이용될 수 있다. 수액 주입부는 일반적으로 환자의 혈관에 침습하여 수액을 공급 하기 위한 주사침을 포함할 수 있다. 산소 공급 장치는 수액 이송관을 통해 이송되는 수액에 산소를 공급하거나 또는 수액 저장 용기에 포함된 수액에 산소를 공급할 수도 있다. 관련하여, 도 2는 본 개시의 일 실시 예에 따라 수액 공급 장치의 수액 이송관을 통해 산소를 공급하는 산소 공 급 장치의 구조를 설명하기 위한 도면이다. 도 2를 참조하면, 산소 공급 장치는 수액 이송관의 적어도 일부 구간에 해당하는 수액 영역, 수액 영 역에 포함된 수액과 접촉하기 위한 분리막, 분리막을 기준으로 수액 영역의 반대쪽에 형성되며, 일정 농도 이상의 산소를 포함하는, 기체 영역을 포함할 수 있다. 수액 영역은 수액이 지나가는 통로에 해당하는 수액 이송관의 일부에 해당할 수 있다. 수액 영역에 머무르는 수액은 분리막을 통해 기체 영역의 산소를 공급받을 수 있다. 구체적으로, 도 2와 같이 수액 영역과 기체 영역 사이를 분리막이 가로막고 있는 형상으로 구성될 수 있다. 이를 위해, 분리막은 산소 등 기체 분자가 통과 가능하지만 수액이 통과할 수 없는 반투과성 막으로 구현 될 수 있다. 예를 들어, 분리막은 폴리우레탄(polyurethane), 폴리아미드(polyamide), 폴리프로필렌 (polypropylene), 폴리테트라플루오로에틸렌(polytetrafluoroethylene, PTFE), 실리콘(silicone) 중 적어도 하 나로 구성될 수 있다. 기체 영역은 일정 농도 이상의 산소를 포함하는 공기를 포함하는 영역이다. 기체 영역은 후술할 산소 공급부로부터 산소를 포함하는 기체를 공급받을 수 있으며, 기체 영역 내 산소의 농도 역시 자동으로 변경 될 수 있다. 이때, 기체 영역 내 산소의 농도에 따라 수액에 주입되는 산소의 양이 변경될 수 있다. 예를 들어, 기체 영역 내 산소의 농도가 높을수록 분리막 양쪽의 산소 농도 차이가 커져 더 많은 산소가 수액으로 주 입될 수 있다. 한편, 비록 도 2는 수액 이송관의 적어도 일부가 수액 영역으로 구성된 경우만을 도시하지만, 수액 저장 용기의 적어도 일부가 수액 영역으로 구성되는 것도 가능하다. 즉, 수액 이송관으로 이송되기 전에, 수액 저장 용기에 포함된 수액에 산소가 공급되는 것도 가능하다. 도 3은 본 개시의 다양한 실시 예에 따라 수액에 산소를 주입하기 위한 산소 공급 장치의 전자적 구성을 설명하 기 위한 블록도이다. 도 3을 참조하면, 산소 공급 장치는 센서 및 산소 공급부를 포함할 수 있다. 센서는 환자의 혈액 내 이산화탄소의 농도를 측정하기 위한 구성이다. 센서는, 피부 표면의 혈액 내 이산화탄소 농도를 측정하기 위한 광학 센서를 포함할 수 있다. 또는, 센서 는 환자의 호기성 호흡을 통해 추출된 공기의 이산화탄소 농도를 측정하기 위한 적외선 센서, 가스 분광기 센서, 산화 측정 센서 등을 포함할 수 있다. 이때, 산소 공급 장치는 호흡 내 이산화탄소 농도를 기설정된 수학식에 적용함에 따라 혈액 내 이산화탄소 농도를 산출할 수 있다. 또는, 센서는 실제 환자의 혈액에서 추출된 혈액 내 이산화탄소 농도를 측정하기 위한 광전도 이산화탄소 센서 등으로 구현될 수도 있다. 이를 위해, 환자의 혈액을 추출하기 위한 주사침, 튜브 등이 센서와 연결될 수 있다.산소 공급부는 기체 영역에 산소를 공급하기 위한 구성이다. 산소 공급부는 일정 농도 이상의 산소가 기저장된 산소 저장 용기를 포함할 수 있다. 또한, 산소 공급부는 다양한 물리적/화학적 반응을 바 탕으로 고농도의 산소를 추출하기 위한 구성을 포함할 수 있다. 예를 들어, 산소 공급부는 대기 중 공기와 산소를 혼합하기 위한 블렌더를 포함할 수 있으며, 산소의 혼합 비율을 조정하기 위하여 전자적으로 제어 가능한 밸브를 포함할 수 있다. 예를 들어, 산소 공급부는 공기 를 압축 및 냉각하여 산소를 추출하기 위한 압축 수단 및 냉각 수단을 포함할 수 있다. 예를 들어, 산소 공급부 는 전기 분해를 수행하여 물 분자로부터 산소를 추출하기 위한 적어도 하나의 전극, 전원 등을 포함할 수 도 있다. 이 밖에도, 산소 공급부는 산소를 획득하기 위한 다양한 수단을 포함할 수 있다. 산소 공급부는 센서와 전기적으로 연결됨에 따라 센서의 센싱 데이터를 바탕으로 동작을 수행할 수 있다. 이때, 산소 공급부는 센서와 직접적으로 연결될 수도 있고, 후술할 제어부를 통해 간 접적으로 연동될 수도 있다. 예를 들어, 센서의 센싱 데이터에 따라 이산화탄소의 농도가 임계치 이상인 것으로 식별된 경우, 산소 공 급부는 기체 영역의 산소 농도를 감소시킬 수 있다. 이를 위해, 산소 공급부는 혼합되는 산소의 양을 감소시키거나(ex. 밸브 제어), 단위 시간당 생성되는 산소의 양을 감소시키거나, 산소 생성을 중단할 수 있다. 구체적으로, 환자의 혈액 내 이산화탄소의 농도가 임계치 이상인 경우, 산소 공급부는 이산화탄소의 농도 가 높을수록 기체 영역의 산소 농도를 감소시킬 수 있다. 관련하여, 도 3을 참조하면, 산소 공급 장치는 센서 및 산소 공급부와 연결된 제어부를 더 포함할 수 있다. 제어부는 다양한 연산 내지 제어를 수행하기 위한 구성으로, 센서의 센싱 데이터를 바탕으로 산소 공급부를 제어할 수 있다. 이를 위해, 제어부는 제어를 위한 전기적인 회로, 프로세서 중 적어도 하나를 포함할 수 있다. 프로세서는, CPU, AP, DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit) 등과 같은 그래픽 전용 프로세서 또는 NPU와 같은 인공지능 전용 프로세서 등을 포함할 수 있다. 도 4는 본 개시의 일 실시 예에 따른 산소 공급 장치가 환자의 혈액 내 이산화탄소의 농도에 따라 산소 농도를 조절하는 동작을 설명하기 위한 알고리즘이다. 도 4는 제어부의 동작에 대한 알고리즘에 해당할 수 있다. 도 4를 참조하면, 제어부는 센서를 통해 환자의 혈액 내 이산화탄소 농도를 측정할 수 있다(S410). 구체적으로, 제어부는 수액 공급 장치의 수액 공급이 시작됨에 따라 산소 공급부를 통해 산소 공급을 시작할 수 있으며, 산소 공급부를 통해 산소 공급이 진행되는 동안 환자의 혈액 내 이산화탄소 농 도를 측정할 수 있다. 이를 위해, 제어부는 (후술할 통신부를 통해) 수액 공급 장치와 전기적으로 연결되어 시작 신호를 수 신할 수도 있고, 수액 공급의 시작을 알리거나 또는 산소 공급을 요청하는 사용자 입력에 따라 산소 공급을 시 작할 수도 있다. 사용자 입력은, 산소 공급 장치에 구비된 버튼, 터치패드에 대한 사용자의 조작을 통해 수신될 수 있다. 또는, 사용자 입력은, 산소 공급 장치에 구비된 마이크를 통해 수신된 사용자의 음성에 따라 획득될 수도 있다. 또한, 산소 공급 장치는 수액 공급 장치의 수액 이송관 내 수액의 흐름을 감지하기 위한 적어도 하나 의 센서(ex. 광 센서, 유량 감지 센서, 무게 센서 등)를 포함할 수도 있으며, 이 경우, 제어부는 수액의 흐름이 감지됨에 따라 산소 공급을 자동으로 시작할 수도 있다. 산소 공급이 진행되는 동안, 제어부는 이산화탄소 농도가 임계치 이상인지 여부를 모니터링할 수 있다 (S420). 만약, 이산화탄소 농도가 임계치 이상인 경우(S420 - Y), 제어부는 산소 공급부의 산소 공급 을 감소시켜 기체 영역의 산소 농도를 감소시킬 수 있다(S430). 그 결과, 환자의 혈액 내 이산화탄소의 농 도 역시 감소되어 산소의 과도한 공급에 따른 위험한 상황이 방지될 수 있다. 환자의 혈액 내 이산화탄소의 농도가 임계치 이상인 경우, 제어부는 이산화탄소의 농도가 높을수록 기체 영역의 산소 농도를 감소시키도록 산소 공급부를 제어할 수 있다. 메모리는 센서를 통해 획득된 센싱 데이터, 센싱 데이터와 관련하여 산소 공급부를 제어하기 위 한 제어 데이터 등을 포함할 수 있다. 또한, 제어부의 프로세서의 제어 동작을 위한 적어도 하나의 인스트럭션 내지 데이터를 포함할 수 있다. 메모리는 ROM, 플래시 메모리 등의 비휘발성 메모리를 포함할 수 있으며, DRAM 등으로 구성된 휘발성 메모 리를 포함할 수 있다. 또한, 메모리는 하드 디스크, SSD(Solid state drive) 등을 포함할 수도 있다. 통신부는 적어도 하나의 외부 장치와 통신을 수행하기 위한 구성으로, 다양한 유무선 통신방식으로 적어도 하나의 외부 장치와 통신을 수행하기 위한 회로, 모듈, 칩 등을 포함할 수 있다. 구체적으로, 산소 공급 장치는 의료 전문가, 보호자, 환자 등의 사용자 단말(ex. 스마트폰, 데스크탑 PC, 태블릿 PC, 웨어러블 장치 등)과 통신을 수행할 수 있으며, 수액 공급 장치와 통신을 수행할 수도 있다. 또한, 그 밖에 환자의 생체 정보(ex. 체온, 혈중 산소 농도, 혈중 이산화탄소 농도 등)를 수집하기 위한 다양한 외부 센서 장치와 통신을 수행할 수도 있다. 네트워크는 영역 또는 규모에 따라 개인 통신망(PAN; Personal Area Network), 근거리 통신망(LAN; Local Area Network), 광역 통신망(WAN; Wide Area Network) 등일 수 있으며, 네트워크의 개방성에 따라 인트라넷 (Intranet), 엑스트라넷(Extranet), 또는 인터넷(Internet) 등일 수 있다. 통신부는 LTE(long-term evolution), LTE-A(LTE Advance), 5G(5th Generation) 이동통신, CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), GSM(Global System for Mobile Communications), DMA(Time Division Multiple Access), WiFi(Wi-Fi), WiFi Direct, Bluetooth, BLE(Bluetooth Low Energy), NFC(near field communication), Zigbee, LoRa 등 다양한 무선 통신 방식을 통해 외부 장치들과 연결될 수 있다. 또한, 통신부는 이더넷(Ethernet), 광 네트워크(optical network), USB(Universal Serial Bus), 선더볼트 (ThunderBolt) 등의 유선 통신 방식을 통해 외부 장치들과 연결될 수도 있다. 이 밖에도, 통신부는 향후 새롭게 고안되는 다양한 통신 방식/기술을 활용한 구성일 수 있다. 한편, 본 개시의 일 실시 예에 따른 산소 공급 장치는 서로 구분된 복수의 수액 영역을 포함할 수 있으며, 주입되는 산소의 양을 수액 영역 별로 제어할 수 있다. 관련하여, 도 5는 본 개시의 일 실시 예에 따른 산소 공급 장치가 서로 구분된 복수의 수액 영역에 대하여 산소 공급을 선택적으로 수행하는 동작을 설명하기 위한 도면이다. 도 5를 참조하면, 산소 공급 장치는 수액 이송관을 구성하는 복수의 구간 각각에 해당하는 복수의 수액 영 역(101-1, 2, 3)을 포함할 수 있다. 여기서, 복수의 수액 영역은 각각 서로 구분된 영역에 해당할 수 있다. 또한, 산소 공급 장치는 복수의 수액 영역(101-1, 2, 3) 각각에 포함된 수액과 접촉하기 위한 복수의 분리 막(102-1, 2, 3), 복수의 분리막(102-1, 2, 3) 각각을 기준으로 복수의 수액 영역(101-1, 2, 3) 각각의 반대쪽 에 형성되며, 일정 농도 이상의 산소를 포함하는, 복수의 기체 영역(103-1, 2, 3)을 포함할 수 있다. 여기서, 산소 공급 장치는 센서를 통해 측정된 이산화탄소의 농도를 바탕으로, 복수의 기체 영역 (103-1, 2, 3) 각각의 산소 농도를 조정할 수 있다. 구체적으로, 환자의 혈액 내 이산화탄소의 농도가 임계치 이상인 경우, 산소 공급 장치는 이산화탄소의 농도가 높을수록 복수의 기체 영역(103-1, 2, 3)의 평균 산 소 농도를 감소시킬 수 있다. 일 실시 예로, 제어부는 각 기체 영역(103-1, 2, 3)의 산소 농도의 증감에 따른 이산화탄소 농도의 변화 이력을 획득할 수 있다. 예를 들어, 제어부는, 환자의 이산화탄소 농도가 임계치 이상이 되는 이벤트가 발생할 때마다, 특정한 기 체 영역에 대해서만 산소 농도를 감소시키는 과정을 각 기체 영역에 대해 순차적으로 진행할 수 있다. 구체적인 예로, 해당 이벤트가 첫 번째로 발생했을 때, 제어부는 기체 영역(103-1)의 산소 농도를 일정 농 도만큼 감소시킬 수 있으며(ex. 기준 농도에서 일정 농도만큼 차감), 이때 기체 영역(103-1)의 산소 농도 변화 에 따른 환자의 이산화탄소 농도의 제1 변화량이 기록될 수 있다. 이후, 해당 이벤트가 두 번째로 발생한 경우, 제어부는 기체 영역(103-1)의 산소 농도를 일정 농도만큼 감 소시킬 수 있으며(ex. 기준 농도에서 일정 농도만큼 차감), 이때 기체 영역(103-1)의 산소 농도 변화에 따른 이 산화탄소 농도의 제2 변화량이 기록될 수 있다. 여기서, 제1 변화량 및 제2 변화량을 바탕으로, 제어부는 제1 기체 영역 및 제2 기체 영역에 대하여 산소 농도의 조정을 위한 우선순위를 설정할 수 있다. 예를 들어, (제1 변화량 및 제2 변화량이 모두 음수이고), 제1 변화량의 절대값이 제2 변화량의 절대값보다 큰 경우, 제1 기체 영역의 우선순위가 제2 기체 영역보다 더 클 수 있다. 즉, 이후 환자의 이산화탄소 농도가 임계치 이상이 되는 이벤트가 다시 발생하는 경우, 제1 기체 영역의 산소 농도가 우선적으로 감소될 수 있으며, 제1 기체 영역의 산소 농도가 일정 농도만큼 감소되었음에도 일정 시간 동안 이산화탄소 농도가 임계치 미만이 되지 않는 경우, 차선책으로 제2 기체 영역의 산소 농도가 감소될 수 있다. 한편, 환자의 이산화탄소 농도가 임계치 이상이 된 이후 기체 영역(103-3)의 산소 농도가 일정 농도만큼 감소된 경우, 이산화탄소 농도의 제3 변화량 역시 기록될 수 있음은 물론이다. 이 경우, 제1 내지 제3 변화량 간의 비 교에 따라, 산소 농도의 조정을 위한 제1 기체 영역, 제2 기체 영역, 제3 기체 영역 각각의 우선순위가 설정될 수 있다. 한편, 특정한 기체 영역의 산소 농도 조정에 따라 변경된 환자의 이산화탄소 농도의 변화량이 음수(: 이산화탄 소 농도의 감소)가 아니라 양수(: 이산화탄소 농도의 증가)이거나 0인 경우도 가능하다. 예를 들어, 특정한 기 체 영역의 산소 농도를 감소시켰음에도, 이산화탄소 농도의 증가 속도가 감소할 뿐 여전히 증가세가 유지되는 경우 등이 가능하다. 예를 들어, 기체 영역(103-1)과 관련된 제1 변화량이 음수이고, 기체 영역(103-2)과 관련된 제2 변화량이 음수 이지만, 기체 영역(103-3)과 관련된 제3 변화량이 양수인 경우를 가정한다. 또한, 제1 변화량의 절대값이 제2 변화량의 절대값보다 큰 경우를 가정한다. 이 경우, 제어부는, 기체 영역(103-1)의 산소 농도 감소는 제1 처리 전략으로 설정하고, 기체 영역(103- 2)의 산소 농도 감소는 제2 처리 전략으로 설정할 수 있다. 여기서, 변화량의 절대값이 더 큰 제1 처리 전략의 우선순위는 제2 처리 전략보다 높게 설정될 수도 있다. 처리 전략은, 환자의 혈액 내 이산화탄소 농도가 임계치 이상인 경우 제어부가 적어도 하나의 기체 영역의 산소 농도를 조정하기 위한 제어 과정을 의미한다. 다만, 환자의 혈액 내 이산화탄소 농도의 감소에 기여하지 못하는 기체 영역(103-3)의 산소 농도 감소는 처리 전략으로 설정되지 않을 수 있다. (만약, 제3 변화량 역시 음수인 경우라면 기체 영역(103-3)의 산소 농도 감소 는 제3 처리 전략으로 설정될 수 있었을 것이다) 이렇듯, 환자의 혈액 내 이산화탄소 농도의 감소에 기여하지 못하는(ex. 변화량이 양수) 기체 영역(103-3)이 존 재하는 경우, 제어부는 단독으로 처리 전략을 구성할 수 있는 기체 영역(ex. 103-1, 2) 각각과 기체 영역 (103-3)을 동시에 활용하여 변화량을 측정할 수 있다. 예를 들어, 환자의 혈액 내 이산화탄소 농도가 임계치 이상이 되는 경우, 제어부는 기체 영역(103-1)과 기 체 영역(103-3)의 산소 농도를 각각 일정 농도만큼 감소시킬 수 있으며, 이때 환자의 이산화탄소 농도의 제4 변 화량이 산출될 수 있다. 여기서, 제4 변화량이 음수이고 제4 변화량의 절대값이 제1 변화량(: 기체 영역(103-1) 단독으로 산소 농도 감소한 경우)의 절대값보다 큰 경우, 제어부는 기체 영역(103-1)과 기체 영역(103-3) 두 영역에 대한 산소 농도 감소를 제3 처리 전략으로 설정할 수 있다. 마찬가지로, 환자의 혈액 내 이산화탄소 농도가 임계치 이상이 되는 경우, 제어부는 기체 영역(103-2)과 기체 영역(103-3)의 산소 농도를 각각 일정 농도만큼 감소시킬 수 있으며, 이때 환자의 이산화탄소 농도의 제5 변화량이 산출될 수 있다. 여기서, 제5 변화량이 음수이고 제5 변화량의 절대값이 제2 변화량(: 기체 영역(103- 2) 단독으로 산소 농도 감소한 경우)의 절대값보다 큰 경우, 제어부는 기체 영역(103-2)과 기체 영역(103- 3) 두 영역에 대한 산소 농도 감소를 제4 처리 전략으로 설정할 수 있다. 제어부는 설정된 처리 전략(ex. 제1 내지 제4 처리 전략)에 대한 정보를 사용자에게 제공할 수 있다. 구체 적으로, 제어부는 통신부를 통해 사용자 단말(ex. 사용자의 스마트폰, 태블릿 PC, 데스크탑 PC 등)과 통신을 수행하여, 각 처리 전략에서 산소 농도 감소의 대상이 되는 기체 영역에 대한 정보, 각 처리 전략에 매 칭되는 이산화탄소 농도의 변화량을 제공할 수 있다. 이때, 사용자 단말을 통해 수신되는 사용자 입력에 따라 각 처리 전략의 우선순위가 설정될 수 있다. 이 경우, 사용자는 둘 이상의 기체 영역의 산소 농도를 동시에 감 소시키기 위한 에너지/로드 사용, 변화량 비교 등을 바탕으로 우선순위를 설정할 수 있게 된다. 또한, 제어부는 사용자 입력에 따라 우선순위를 설정하기 위한 조건을 획득할 수도 있다. 예를 들어, 산소 농도가 감소되는 기체 영역의 수(ex. 1순위 조건), 변화량(ex. 2순위 조건)이 각각 조건으로 선택된 경우를 가정한다. 이 경우, 제1 순위 조건에 따라, 먼저 제어부는 비교적 작은 수의 기체 영역의 산소 농도 제어만으로 가능 한 제1 내지 제2 처리 전략의 우선순위를 제3 내지 제4 처리 전략의 우선순위보다 더 높게 설정할 수 있다. 그리고, 제2 순위 조건에 따라, 제1 처리 전략과 제2 처리 전략 각각의 변화량을 비교하여 우선순위를 설정하고 (ex. 제1 처리 전략의 우선순위 > 제2 처리 전략의 우선순위), 제3 처리 전략과 제4 처리 전략 각각의 변화량을 비교하여 우선순위를 설정할 수 있다(ex. 제3 처리 전략의 우선순위 > 제4 처리 전략의 우선순위). 결과적으로, 제1 처리 전략, 제2 처리 전략, 제3 처리 전략, 제4 처리 전략의 순서로 우선순위가 설정될 수 있다. 이렇듯 우선순위가 설정된 이후, 환자의 이산화탄소 농도가 임계치 이상이 되면, 제1 처리 전략에 따라 기체 영 역(103-1)의 산소 농도가 일정 농도만큼 감소될 수 있다. 여기서, 제1 시간 동안 이산화탄소 농도가 임계치 미 만이 되지 않는 경우, 제2 처리 전략이 추가적으로 수행되어 따라 산소 농도가 제어될 수 있다. 다만, 제2 처리 전략 이후 제2 시간 동안 이산화탄소 농도가 임계치 미만이 되지 않는 경우, 다음 우선순위에 해당하는 제3 처리 전략이 선택되어 제어가 수행될 수 있다. 여기서, 제3 처리 전략에 따라, 이미 앞선 제1 처 리 전략에 따라 산소 농도가 감소된 기체 영역(103-1)의 산소 농도는 유지된 채로 기체 영역(103-3)의 산소 농 도만 일정 농도 감소될 수도 있고, 또는, 이미 감소된 기체 영역(103-1)의 산소 농도가 다시 한 번 일정 농도만 큼 감소되면서 기체 영역(103-3)의 산소 농도도 함께 감소되는 것일 수도 있다. 제3 처리 전략 이후 제3 시간 동안 이산화탄소 농도가 임계치 미만이 되지 않는 경우, 마찬가지로 다음 우선순 위에 해당하는 제4 처리 전략이 선택되어 제어가 수행될 수 있다. 상술한 제1 내지 제3 시간은 기설정된 것이거나 사용자 입력에 따라 설정될 수 있다. 여기서, 제1 시간은 제2 시간보다 크고, 제2 시간은 제3 시간보다 클 수 있으며, 그 결과 환자의 혈액 내 이산화탄소 농도가 높은 상태 가 오래 유지될수록 다음 순위의 처리 전략이 더 빠르게 추가 진행될 수 있다는 장점이 있다. 한편, 이상에서 설명된 다양한 실시 예들은 서로 저촉되거나 모순되지 않는 한 두 개 이상의 실시 예가 서로 결 합되어 구현될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0071636", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2023-0071636", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따라 수액 공급 장치의 수액에 산소를 공급하는 산소 공급 장치의 동작을 설명 하기 위한 도면, 도 2는 본 개시의 일 실시 예에 따라 수액 공급 장치의 수액 이송관을 통해 산소를 공급하는 산소 공급 장치의 구조를 설명하기 위한 도면, 도 3은 본 개시의 다양한 실시 예에 따라 수액에 산소를 주입하기 위한 산소 공급 장치의 전자적 구성을 설명하 기 위한 블록도, 도 4는 본 개시의 일 실시 예에 따른 산소 공급 장치가 환자의 혈액 내 이산화탄소의 농도에 따라 산소 농도를 조절하는 동작을 설명하기 위한 알고리즘, 그리고 도 5는 본 개시의 일 실시 예에 따른 산소 공급 장치가 서로 구분된 복수의 수액 영역에 대하여 산소 공급을 선 택적으로 수행하는 동작을 설명하기 위한 도면이다."}
