{"patent_id": "10-2018-0028169", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0036658", "출원번호": "10-2018-0028169", "발명의 명칭": "Drone의 다른 용도로 하기 위해 필요한 장비들", "출원인": "김용원", "발명자": "김용원"}}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "본 발명에서는 motor에 의해 구동되는 propeller와 propeller의 축과 inner turbine과 outer turbine에 압축공기의 흐름이 반대방향의 1fan들을 순차적으로 연결하고 outer turbine의 outer의 1fan 끝에 duct fan이 설치된36.공기터빈(inner,outer)과 덕트터빈을 합한 터빈10-2016-0071179의 3connected turbine(36)의 축이 연장 연결되고 3connected turbine (36)의 축이 다시 propeller가 설치된 1축에 연장되고 propeller에서 3connectedturbine(36)과 propeller가 연결된 propeller에서 아래propeller가 연결된 외부에 원통까지 axis flexibleshaft를 설치하는 것과; propeller에서 3connected turbine(36)과 propeller에서 아래propeller가 연결된 외부에 원통으로 연결되게 구성하고 그 아래에 공기유도판을 형성하고 공기유도판 아래에 outlet을 설치하여control하는 propeller에서 outlet을 형성한 전체를 propullor를 설치하는 것과;air filters를 propeller위와 propeller위 외부에 air filters ring을 설치하는 것을 특징으로 하는 Drone에필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구 1항에서, 공기유도판 중앙 위에서 아래에 원통구멍을 형성하고 공기유도판 원통구멍 위 안에 톱니ring과맞물리는 톱니가 있는 원통상단과 원통을 잊는 L보 pipe를 형성하되 │은 원통에서 원통으로 ― 는 원통에서 '아래에서 위의 긴 타원통0' 을 방향control outlet을 형성하는 것을 특징으로 하는 Drone에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "전동moter axis에서 Drone의 propeller axis로 연결되는 arm에는 fan을 설치할 때 바람의 방향과 흐름은 전동motor 외부로 빨리 지나가서 compress box안을 지나 control outlets으로 바로 내려가게 하고 fan들의 끝에는영구자석을 설치하는 것과 fan 외부pipe에는 권선을 감아 battery를 충전하는 generator를 형성하고 이 때 형성되는 권선에 각 1전자석을 형성하고 각 1전자석과 같은 극의 영구자석을 형성하여 (10,같은 극면의 반발력을 이용한 자석엔진10-2005-0128802, 21.같은 극면의 반발력을 이용한 자석엔진10-2007-0037260, 24.같은 극면의 반발력을 이용한 자석엔진10-2013-0046075을 베어링으로 인용) Taxi Drone의 Body branch legs frame들에 설치되는 arm에 전자베어링으로 설치하는 것과 propeller axis에도 같이 전자베어링으로 설치하고 propeller axispinion gears들과 arm pinion gears들의 교차하는 마름모 pinion gears들을 중 propeller axis쪽 아래 위 각pinion gears들을 마주보게 1체형으로 하고 propeller axis가 마주한 1체형 pinion gears들과는 각 1전자석과같은 극의 영구자석을 형성하고 pinion gears들 내부에 1부분구멍을 뚫고 propeller axis를 1방향 상단piniongear에 고정핀을 1방향 상단pinion gear 안 1부분구멍에 고정되게 하고 1방향으로 회전하는 propeller axis의pinion gears아래 바닥 테두리 면에 3개 이상의 각 1전자석과 같은 극의 영구자석을 정형된 도형을 형성하는 것과 1방향과 반대방향회전변속기 내부 바닥면에 3개 이상의 각 영구자석과 같은 극의 1전자석을 영구자석과 동일위치에 동일형태로 정형된 도형을 형성하여 propeller axis의 2방향 전환 작용하게 한 것과;propeller axis의 pinion gears아래 바닥 중앙에서 반대방향회전변속기 내부 바닥면 중앙까지 약한 인장spring을 설치하여 1전자석의 1극에 버튼을 연결하여 on, off작동이 단순 변속 작동되게 한 것을 특징으로 하는 Drone에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "Drone의 위로 cable과 공기가 들어가는 2air lines과 공기가 나오는 2air lines들과 전선을 1cloud line으로한 1cloud line을 3개 이상 정형되게 Drone의 위로 연결될 cloud wing에는 송수신인테나를 1비닐공간에 탑재하고 사방에 카메라를 각 1비닐공간에 탑재하고 generator, battery, air pipe, 3 connected turbine을 airlayer plate wing안에 탑재하고 air layer plate wing바닥에는 L보 outlets들을 설치하고 remote control에 의한 조정작용이 되게 하고 cloud wing 바닥 4군데에 Drone의 위 사방으로 비출 led light를 각 1비닐공간에 ledlight 판위에서 아래로 비추게 탑재하고 Drone 바닥아래 사방으로 비출 led light를 각 1비닐공간에 led light판위에서 아래로 비추게 탑재하여 Drone의 장비들과 연결될 cloud wing장비들을 방수처리된 1관으로 모두 연결공개특허 10-2018-0036658-3-하고 인공지능(CPU, GPU, TPU)과 연결하게 하는 것을 특징으로 하는 Drone에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "Drone의 승용공간에 필요한 장비들 air layer protective wing으로 측면사방에 공기 inlet을 설치한 air layerfloor wing, 측면사방에 공기 inlet을 설치한 air layer roof wing, 양 wall 아래, 위로 긴 측면을 공기 inlet으로 설치한 air layer wall wing, 원 주 벽면에 공기 inlet을 air layer ring wing을 설치하여 보호 작용하는것을 특징으로 하는 Drone에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "Drone의 장시간 비행에 필요한 arm이나 axis에 설치한 generator에서 발전한 전기를 battery에 저장하고generator에서 발전한 전기를 propeller의 motor에 공급을 직접할 때와 battery의 propeller의 motor에 공급하는 것과 전기를 전자석으로 작동하는 propeller의 axis flexible shaft(전자베어링)와 air layer protectivewings들에서 모인 압축공기를 모으는 air pipe와 propeller의 연장axis축에 3 connected turbine을 설치하고 3connected turbine axis아래에 연장axis 위의 긴 1fan(inner,outer,duct가 아님)들이 설치되고 긴 1fan여러 개의 끝에 영구자석과 원통 air pipe밖의 권선들을 이용한 발전하며 duct inlets과 원통air pipe의 긴 1fan에서나오는 압축공기의 추진력을 높이고 Drone body의 air layer floor wing, air layer roof wing, air layerwall wing들을 설치하고 Drone body에서 propeller까지의 legs들에 air layer protective wing들을 고속비행에사용하는 것을 특징으로 하는 Drone에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "propeller의 축에서 \"inner turbine과 outer turbine에 압축공기의 흐름이 반대방향의 1fan들을 순차적으로 연결하고 outer turbine의 outer1fan 끝에 duct fan이 설치된 3 connected turbine(36)\" 의 축으로 연장 연결되고 3 connected turbine(36)의 축이 다시 propeller가 설치된 1축에 연장되고 propeller에서 3connectedturbine(36)과 아래propeller가 연결된 외부에 원통으로 연결되게 구성하고 그 아래에 공기유도판을 형성하고공기유도판아래 L보 outlets들을 형성하여 control propullor를 형성하는 것을 특징으로 하는 Drone에 필요한장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "Drone의 승용공간의 air layer front, air layer 양 옆door, air layer rear가 Drone의 roof의 사방 테두리 아래로 각 선택적 air 주입으로 air layer front, air layer 양 옆문, air layer rear가 roof의 사방 테두리와평형을 이루게 하여 air layer protective wing으로 변환한 양 문과 지붕, 뒤로 탑승과 하승이 되게 한 것을 특징으로 하는 Drone에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공기 흡입기와 flexble pipe와 다중air filters설치 매연제거작용과 매연이 다중air filters에 채워진 무게에따라 Drone의 아래쪽 frame위의 air filters slug box로 떨어지고 air filters에서 air filters로 연결된 끈에따라 순차적으로 flexible pipe 끝에 장착되게 Drone의 위쪽 frame 위에 다중air filters 새box를 설치하고 다중air filters 새box 구멍에서 하나씩 다중air filter가 flexible pipe, 끝에 장착되는 것과;flexible pipe 끝에 flexible pipe 안 아래에 다중air filter 테두리 끈의 1부분에 걸리는 1고리는 매연이 다중air filters에 채워진 무게가 되면 1고리가 flexible pipe 밖의 아래로 내려져 다중air filter 테두리 끈에서 분리되는 것과 flexible pipe 끝에 flexible pipe 밖 위에 다중air filter 테두리 끈의 1부분에 걸리는 각1고리 2개의 2고리를 설치하고 매연이 다중air filters에 채워진 무게가 되면 각1고리 2개의 2고리가 flexiblepipe 밖의 Drone의 아래쪽 frame위로 내려져 다중air filter 테두리 끈에서 분리되는 것을 특징으로 하는 Drone에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "46.공기층을 이용한 보호장비들10-2017-0125853 -2중 완충 air pump, 47.날개를 단 배낭과 변형하는 외부Body(문, 지붕)프레임과 Body(문, 지붕)와 날개를 더 단 비행기구10-2017-0133894 -2중 완충 air pump 설치,48.신체프레임과 날개를 단 배낭과 변형하는 외부Body(문, 지붕, 바닥)프레임과 날개를 더 단 비행기구들의 장비를 이용하는 장치들10-2017-0137338 -2중 완충 air pump 설치, 49.공기 layer 이용한 보호장비10-2017-공개특허 10-2018-0036658-4-0149595 -3중 완충 air pump, 50.에어 레이어들의 세일날개들을 포함한 여러장비들10-2018-0010890 -3중 완충air pump 설치, 51.수상과 땅에서 동시에 탈 수 있는 발판보드10-2018-0023789 -3중 완충 air pump 설치, 52.에어 레이어들의 플레이트 날개들과 여러 타입의 날개들을 단 개인썰매10-2018-0024283 -2중 완충 air pump, 3중 완충 air pump 설치(2개의 2중 완충 air pump, 3중 완충 air pump 설치된 공기량의 차이로 효과 높임)출원한내용을 인용한 Drone이 착륙할 때 4개 이상의 2(cell)air pump,3(cell) air pump들의 수평을 이루어야 할 완충작용하는 legs에 붙이는 2(cell)air pump, 3(cell) air pump들의 하단 tube들을 Drone의 Body floor center에물Tank를 두고 Drone의 Body branch legs들 위에 tube들과 수평이 이루어지게 물pipe로 연결하고 Drone의 Bodybranch legs 내부에 설치하고 2(cell)air pump,3(cell) air pump들의 tube집들에 2(cell)air pump,3(cell) airpump들보다 길이가 1/2 더 긴cylinder를 형성하고 Drone의 Body floor center에 물Tank와 연결되며 Drone의Body branchlegs들 끝단 위의 2(cell)air pump, 3(cell) air pump들을 설치하는 것과;Drone의 Body branch legs의 상단tube들은 2(cell)air pump,3(cell) air pump들보다 길이가 1/2 더 긴cylinder를 형성하여 2(cell)air pump, 3(cell) air pump들의 tube내에서 이동하는 물 높이에 따라 이동하기 위해 물Tank의 높이는 2(cell)air pump, 3(cell) air pump들의 상단tube들과 2(cell)air pump, 3(cell) air pump들의상단tube들의 평지에서 높이가 같게 구성하고 Drone의 Body(6) branch legs들 위에 하단 tube들 내 긴cylinder의 물 수위를 그대로 완충작용으로 하며 2(cell)air pump,3(cell) air pump들 내의 air 완충작용을 연결하여 2중 완충 처리되는 것을 특징으로 하는 Drone에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "Drone의 다른 용도 중 taxi비행에 필요한 Drone의 장비들과 연결될 cloud wing장비들을 방수처리된 1관으로 모두 연결하고 인공지능(CPU, GPU, TPU)설치로 하는 자율조정과 지상에서 remote control로 2중 light로 비추는것과 2중 촬영으로 드론 주변 위험발생을 예방하게 하였으며 드론의 촬영내용도 개인의 소유가 되지 않게 하고공개, 공유가 되게하며 초점조절이 가정이나 타 건물감시에 대한 근거리화 국내법안과 국제법안마련 한 후cloud wing의 영상정보수집과 정보이용이 지상에서 원격조정하는 것과 인공지능 (CPU, GPU, TPU)의 자율조정하게 하는 것을 특징으로 하는 Drone에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 Drone에 필요한 장비들을 본 발명인이 특허출원한 여러 기능의 승용기구들의 장비들과 연결을 시도한 2.롤러 블레이드 출원번호;10-1999-0048488 axis flexible shaft, 3 connected turbine axis위의 긴 1fan이 설 치되고 긴 1fan의 여러 개의 끝에 영구자석과 air pipe밖의 권선들을 이용하여 발전하는 generator, battery, (뒷면에 계속)"}
{"patent_id": "10-2018-0028169", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "Drone에 필요한 장비들 Drone의 propeller에 필요한 장비들 Drone의 승용공간에 필요한 장비들 Drone의 착륙에 필요한 장비들 Drone의 다른 용도 중 자율비행에 필요한 장비들 Drone의 다른 용도 중 매연제거를 비행에 필요한 장비들 Drone의 다른 용도 중 taxi비행에 필요한 장비들 Drone의 장시간 비행에 필요한 장비들 Drone의 사고대비에 필요한 장비들 Drone의 승용공간의 문들에 필요 장비들 Drone의 다른 용도 날개들의 고속비행에 필요한 장비들"}
{"patent_id": "10-2018-0028169", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "Drone에 필요한 장비들 axis flexible shaft, generator, battery, air pipe Drone의 propeller에 필요한 장비들 axis flexible shaft, generator, battery, 3 connected turbine Drone의 승용공간에 필요한 장비들 air layer protective wing Drone의 착륙에 필요한 장비들 2(cell)air pump,3(cell)air pump다수작동 매카니즘 Drone의 다른 용도 중 자율비행에 필요한 장비들 cloud wing Drone의 다른 용도 중 매연제거를 비행에 필요한 장비들 air filters Drone의 다른 용도 중 taxi비행에 필요한 장비들 control propullor Drone의 장시간 비행에 필요한 장비들 axis flexible shaft, generator, battery, air pipe Drone의 사고대비에 필요한 장비들 cloud wing, air filters, air layer protective wing Drone의 승용공간의 문들에 필요한 장비들 air layer protective wing Drone의 다른 용도 날개들의 고속비행에 필요한 장비들 axis flexible shaft, generator, battery, 3 connected turbine, air pipe, control propullor, cloud wing, air layer protective wing 선행기술문헌 특허문헌 (특허문헌 0001) 본 발명인이 이미 출원한 특허문헌을 인용한 내용 : 1.롤러 블레이드 출원번호; 10-1998- 0048116 (특허문헌 0002) 2.롤러 블레이드 출원번호; 10-1999-0048488 (특허문헌 0003) 3.롤러 블레이드 출원번호; 10-2004-0113407 (특허문헌 0004) 4.수상보드 출원번호; 10-2005-0093462 (특허문헌 0005) 5.어깨끈을 벗지 않고 가방을 가슴으로 안았다가 다시 등에 지는 배낭 10-2005-0105375 (특허문헌 0006) 6.다용도 헬스 자전차. 10-2005-0115428 (특허문헌 0007) 7.차의 브레이크 장치에 더하여 전진을 후진으로 돌리는 보조다리와 보조바퀴에 난코스(설원과 사막), 물위를 가는 장치를 가지는 보조다리와 보조바퀴 10-2005-0117341 (특허문헌 0008) 8.탄성을 가진 공기주머니들을 연동상반운동으로 회전수단과 자가 공기 펌핑분출(에어 콘푸렌 스)수단으로 전환하는 장치10-2005-0117342 (특허문헌 0009) 9.회전연속격발공기발사기10-2005-0119308 (특허문헌 0010) 10.같은 극면의 반발력을 이용한 자석엔진10-2005-0128802 (특허문헌 0011) 11.태엽 봉 또는 태엽스틱10-2005-0128803 (특허문헌 0012) 12.(압력공기)터보엔진10-2005-0131732 (특허문헌 0013) 13.자가연속공기펌핑분출장치(I), 태엽(V), 회전연속격발공기발사기(II), 에어콘푸레서(III), 에어콘푸레서(IV), 자석엔진(VI)과 더불어 배터리(VII), 조절판(VIII)과 열선(IX)을 가지는 시스템10-2005- 0131733 (특허문헌 0014) 14.(압력공기)터빈10-2005-0133691 (특허문헌 0015) 15.다용도 헬스 자전차10-2006-0014027 (특허문헌 0016) 16.압축공기발사기10-2007-0017307 (특허문헌 0017) 17.에너지발생장치10-2007-0017308 (특허문헌 0018) 18.태엽케이스10-2007-0037257 (특허문헌 0019) 19.압력공기터빈엔진10-2007-0037258 (특허문헌 0020) 20.(압력공기)터보엔진10-2007-0037259 (특허문헌 0021) 21.같은 극면의 반발력을 이용한 자석엔진10-2007-0037260 (특허문헌 0022) 22.어깨끈이 있는 등판과 가방을 분리하는 배낭10-2008-0016259 (특허문헌 0023) 23.수상보드10-2008-0022573 (특허문헌 0024) 24.같은 극면의 반발력을 이용한 자석엔진10-2013-0046075 (특허문헌 0025) 25.공기터빈엔진, 자석엔진(베어링)과 압축공기발사기를 이용한 발전기10-2013-0049703 (특허문헌 0026) 26.압축공기터빈10-2013-0073137 (특허문헌 0027) 27.압축공기발사기10-2013-0135265 (특허문헌 0028) 28.기계회전축에 설치하여 공기Tank들에 내장된 Floor Board들을 연동반복운동을 시키는 Air Pumper와 공기Ring Tube와 압축공기가 필요한 곳에 연결하는 Pipe의 복합장치10-2014-0113976 (특허문헌 0029) 29.\"압축공기pumping장치\" 들과 \"압축Air발사기\" 들과 \"같은 극면의 반발력을 이용한 자석엔진\", 전기열선을 내장한 \"압축공기터빈\" 을 이용한 \"발전기\"와 \"태엽spring case\" 들을 Starter로 이용하 며, \"전기열선을 내장한 Steam탱크와 Steam터빈\" 을 응용한 water condition과 air condition과 Steam 기관의 복합장치10-2015-0002033 (특허문헌 0030) 30.발판보드10-2015-0002034 (특허문헌 0031) 31.어깨끈이 있는 등판과 가방을 분리하는 배낭10-2015-0016202 (특허문헌 0032) 32.수상보드10-2015-0016203 (특허문헌 0033) 33.기계회전축에 설치되어 회전축이 회전할 때 상기 기계회전축에 설치되는 Air Pumper와 Air Tank로 하는 Compressor로 압축공기발사기Cylinder들 내부에 Spring을 압축하는 것과 같은 극의 전자자석과 영 구자석으로 하는 압축공기생성장치가 내장된 압축공기발사기10-2015-0021433 (특허문헌 0034) 34.선박의 조향기구, 'Air, Steam Turbine Engine'과 'Water Tank & Boiler System', 'Air, Water, Steam Propulsor'를 가지는 System10-2015-0031408 (특허문헌 0035) 35.연과 낙하산, 날개들을 가지는 배낭10-2016-0071178 (특허문헌 0036) 36.공기터빈과 덕트터빈을 합한 터빈10-2016-0071179 (특허문헌 0037) 37.여러 종류의 공기터빈들의 조합으로 형성하는 공기추진기들로 비행하게 하는 여러 장치와 조정 장치를 가진 비행기구10-2016-0090125 (특허문헌 0038) 38.A prefabricated furnace에 설치한 a scaffolding과 an air furnace combined with 3 different air turbines들을 조합 이용하여 산사태지역,축대, 지진피해 저감과 중수 재활용과 눈, 빙판을 해결 한 길 (도로)10-2016-0121920 (특허문헌 0039) 39.삼중 공기완충 보호대10-2017-0007916 (특허문헌 0040) 40.삼중 공기완충 보호슈트10-2017-0012857 (특허문헌 0041) 41.공기완충 이중 보호장갑10-2017-0014210 (특허문헌 0042) 42.다중 공기완충 헬멧10-2017-0014211 (특허문헌 0043) 43.다중 공기완충 신발보호(덧신, 신 덮개, 신바닥)대10-2017-0015524 (특허문헌 0044) 44.다중 공기완충 보트10-2017-0015985 (특허문헌 0045) 45.설원에서 탈 수 있는 발판보드10-2017-0023691 (특허문헌 0046) 46.공기층을 이용한 보호장비들10-2017-0125853 (특허문헌 0047) 47.날개를 단 배낭과 변형하는 외부 Body(문, 지붕)프레임과 Body(문, 지붕)와 날개를 더 단 비행기구10-2017-0133894 (특허문헌 0048) 48.신체프레임과 날개를 단 배낭과 변형하는 외부Body(문, 지붕, 바닥)프레임과 날개를 더 단 비행기구들의 장비를 이용하는 장치들10-2017-0137338 (특허문헌 0049) 49.공기 layer 이용한 보호장비10-2017-0149595 (특허문헌 0050) 50.에어 레이어들의 세일날개들을 포함한 여러장비들10-2018-0010890 (특허문헌 0051) 51.수상과 땅에서 동시에 탈 수 있는 발판보드10-2018-0023789 (특허문헌 0052) 52.에어 레이어들의 플레이트 날개들과 여러 타입의 날개들을 단 개인썰매10-2018-0024283 비특허문헌 (비특허문헌 0001) JP2006141567 A*, KR1020040106204 A 배낭Back pack. (비특허문헌 0002) 실용실안이중 공기완충 보호대(PROTECTOR WITH DOUBLE AIR CUSHIONS) IPC : A63B 71/00 deposit No. 2019980022043 deposit day : 1998.11.13 Registration No. 2002118630000 Registration day : 2000.11.16 public No. 2020000009930 public day : 2000.06.05."}
{"patent_id": "10-2018-0028169", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "Drone propeller들의 문제를 해결해야 하는 과제 Drone의 작동 시간에 문제를 해결해야 하는 과제 Drone의 승용공간 문제를 해결해야 하는 과제 Drone의 착륙문제를 해결해야 하는 과제 Drone의 다른 용도 중 자율비행문제를 해결해야 하는 과제 Drone의 다른 용도 중 매연제거 문제를 해결해야 하는 과제 Drone의 다른 용도 중 taxi비행문제를 해결해야 하는 과제 Drone의 장시간 비행에 필요한 장비들 문제를 해결해야 하는 과제 Drone의 사고대비에 필요한 장비들 문제를 해결해야 하는 과제 Drone의 승용공간의 문들에 필요한 장비문제를 해결해야 하는 과제 Drone의 다른 용도 날개들의 고속비행에 필요한 장비들 문제를 해결해야 할 과제"}
{"patent_id": "10-2018-0028169", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "Drone에 필요한 장비들 axis flexible shaft, generator, battery, air pipe, propeller의 moters들의 흙먼지, 탑승자와 주변인들이 바람을 감수하는데 공기조절 수단과 공기활용수단으로 하는 것과; Drone의 propeller에 필요한 장비들 중 axis flexible shaft는 propeller의 변속기 없이 작동 중에 방향전환수 단으로 , generator, battery, 3 connected turbine, Drone의 propeller외부에 설치하는ring wing의 구동수단 과 energy 재생수단과; Drone의 승용공간에 필요한 장비들 air layer protective wing을 기둥과 문과, 지붕 바닥 등에 설치하는 보호수 단과, 공기inlets수단으로 하는 것과; Drone의 착륙에 필요한 장비들 2(cell)air pump,3(cell) air pump를 다수 작동 매카니즘으로 하는 운영수단과 수평유지에 필요한 water수평센서를 수평수단으로 하는 것과; Drone의 다른 용도 중 자율비행에 필요한 장비들 cloud wing으로 Drone의 주변(전,후,좌,우,아래,위)을 Drone 위에서 더 조종하는 영상정보수집과 정보이용수단과; Drone의 다른 용도 중 매연제거를 위한 장비 중 air filters를 이용한 정화수단과; Drone의 다른 용도 중 taxi비행에 필요한 장비들 control propullor와 remote control기를 이용한 조절조종수 단과; Drone의 장시간 비행에 필요한 장비들 axis flexible shaft, generator, battery, air pipe, 3 connected turbine axis위의 긴 1fan이 설치되고 긴 1fan여러 개의 끝에 영구자석과 air pipe밖의 권선들을 이용한 발전수 단과 Drone의 사고대비에 필요한 장비들 cloud wing의 영상정보수집과 정보이용수단과; air filters매연제거수단과: air layer protective wing보호수단과; Drone의 승용공간의 문들에 필요한 장비들 사방육방(전,후,좌,우,아래,위)air layer protective wing문과 지붕, 바닥, 벽으로 탑승수단과 하승수단이 되게 한 것과; Drone의 다른 용도 날개들의 고속비행에 필요한 장비들 axis flexible shaft, generator, battery, 3 connected turbine, air pipe, control propullor, cloud wing, air layer protective wing, floor wing, roof wing, wall wing들을 aircraft수단을 과제의 해결수단으로 하였다."}
{"patent_id": "10-2018-0028169", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "2017년 은행의 ATM기기의 해킹에 의한 ATM기기내 돈을 찾아간게 아닌 통장비밀번호와 개인정보들을 탈취해서 개 개인들의 통장내 돈들을 출력해 간 사이버테러와 IP카메라의 개인정보를 해킹해서 IP카메라(CCTV)조절촬영한 사건의 주범은 작년에도 같은 북한 소행으로 IP주소 추적할 통해 밝혀진 내용을 참조하여 국내의 고지서들에 기록되는 가상계좌들을 만든 기관, 기업들과 은행들, 개인정보수집·이용에 동의하게 하고 다른 곳에 개인정보수집·이용에 동의한 내용을 제공하는 것에도 동의하게 하는 많은 곳의 원격조정(RC, Wifi, 블루투스, GPS, 무전송신에 의한 조정)을 하는 앞으로의 무인 Taxi운영과 관련, 생산, 운영, 유통, 홍보, 제품관리, 기술 제휴할 수 있는 효과가 있다. 주민번호 보호를 하기위해 저지르 는 개인정보수집이용에 동의하게 하는 행위를 블록체인으로 공유 가상계좌의 계약당사자들과 법정대리인에 대한 공개하지 않는 것과 가상계좌의 '0'이라도 계좌공개 하지 않는 책임을 세계로 공유해야 이런 일련의 범죄를 막 아 택시드론이나 비행기구들의 안전을 아주 조금이라도 줄일 수 있는 효과가 있다. (2중 촬영으로 드론 주변 위 험발생 예방, 드론의 촬영내용도 개인의 소유가 되지 않게 하고 공개, 초점조절이 가정이나 타 건물감시에 대한 근거리화 국내법안과 국제법안마련(장시간 가능한 비행) 탑승자가 탈 수 있는 곳이 법적으로 허용하는 한 여러 장소에서 즐길 수 있게 하기 위한 것이라 기존의 drone에 서 나오는 바람문제와 흙먼지를 없앤 것이며, drone의 propeller axis에 3connected turbine axis 끝에 control air outlets을 연결한 propullor를 연결하여 고속 비행으로 접근시키려고 시도한 것이나, 다양한 승용 과 remote control에 의한 조정과 사고의 적은 위험에도 대처 내지 대비할 수 있는 자율비행과 결합하면 장시간 사용과 많은 공기 필터를 장착하여 일상 영업에서도 매연을 줄이고, 화석연료의 사용을 줄일 수 있고, 화재 또 는 공장의 매연이나 도심의 심한 스모그 등의 환경문제해결에도 사람의 희생 없이 할 수 있고 사람이 접근하지 못 하는 곳에서 여러 문제해결에도 사람의 희생 없이 할 수 있는 효과가 있다."}
{"patent_id": "10-2018-0028169", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 Drone에 필요한 장비들을 본 발명인이 특허출원한 여러 기능의 승용기구들의 장비들과 연결을 시도한 2.롤러 블레이드 출원번호;10-1999-0048488 axis flexible shaft, 3 connected turbine axis위의 긴 1fan이 설 치되고 긴 1fan여러 개의 끝에 영구자석과 air pipe밖의 권선들을 이용하여 발전하는 generator, battery, air pipe, propeller의 moters들의 흙먼지, 탑승자와 주변인들이 바람을 감수하는데 공기조절수단과 공기활용수단으 로 하는 것과; Drone의 propeller에 필요한 장비들 중 axis flexible shaft는 propeller의 변속기 없이 작동 중에 상하방향전 환수단으로 하고 generator, battery, 3 connected turbine, Drone의 propeller외부에 설치하는ring wing, Drone의 승용공간에 필요한 air layer protective wing을 기둥과 문과, 지붕바닥 등에 설치 보호수단과, 육방 (전,후,좌,우,아래,위)공기inlets과 Drone의 착륙에 필요한 2(cell)air pump, 3(cell)air pump를 다수 설치한 작동매카니즘 운영과 수평유지에 필요한 물수평센서를 구비한 것과 자율비행에 필요한 Drone의 주변(전,후,좌, 우,아래,위)영상정보수집과 정보이용을 위한 Drone 위에서 조종할 cloud wing과 Drone의 매연제거를 위한 air filters를 이용하는 것과 Drone의 taxi비행에 필요한 propullor와 remote control기를 이용한 조절조종과 Drone의 사고대비에 필요한 cloud wing의 영상정보수집과 정보이용과 air filters 매연제거와 Drone의 승용공간 의 문들에 필요한 장비들 사방육방(전,후,좌,우,아래,위)air layer protective wing문과 지붕, 바닥, 벽으로 탑 승과 하승이 되게 한 것과 Drone의 propeller외에 다른 날개들의 고속비행에 필요한 axis flexible shaft, generator, battery, 3 connected turbine, air pipe, control propullor, cloud wing, air layer protective wing, floor wing, roof wing, wall wing들을 aircraft하게 한 것이다. 아울러, 본 발명인이 특허출원한 여러 기능의 승용기구들과 연결을 시도할 프레임을 설치하여 문제 해결 수단으로 하였다. 이곳에서는 단순하게 배치로 설명하고 상세설명 은 앞서 특허 출원한 내용을 인용하기로 한다. 탑승장의 위치에 따른 변화를 줄 수 있는 propullor의 압축공기 배출 처리를 재생하는 파이프를 설치하고 35.연 과 낙하산, 날개들을 가지는 배낭10-2016-0071178의 frame과 탑승자와의 결착하는 외부Body(문, 지붕)에 추진기 (3합터빈)의 압축공기 배출 처리는 공기 덕트설치와 propullor외에 외부Body(문, 지붕)를 설치하고 35.연과 낙 하산, 날개들을 가지는 배낭10-2016-0071178의 frame과 외부 바디 조절 프레임들에 연결할 연결기구머리를 아래 로 하는 frame 힌지를 외부 바디 조절 프레임상단에 둔 이들 중 35.연과 낙하산, 날개들을 가지는 배낭10-2016- 0071178의 frame 과 외부 바디 조절 frame으로 동시에 연계된 2개의 조절기를 설치하여 하나일 때와 다른 안전한 문제 해결수단으로 힌다. 도 1은 본 발명의 Drone의 Body와 frame이 설치된 기본도 본 발명의 기본구조를 설명하기 위한 실시 례로 현실에서 실행을 하기 위한 것이 아니며 기존의 Drone의 다름을 설명하기 위한 동일형태로 나타내기 위한 실시 례이다. 도 2는 Drone의 Body와 frame에 filter들을 설치한 4개의 propeller에 대한 설명도 본 발명에서는 Propeller위 일정한 거리에 다수의 air filter틀을 두고 독수리나 새떼들의 피해를 줄이는 nano망사 아래 에 air filter(O)를 설치한다. 이 방법이 독수리나 새떼들의 피해와 Drone의 사고를 줄이는 방법 중 하나이다. 도 3은 도 2의 propellers들에 filter들을 설치하고 propellers들 아래에 공기유도판을 설치한 입체도 도 4는 도 3의 외부에 입체적인 filters를 설치한 입체도 도 3과 도 4는 Drone의 Body와 frame에 4개의 propellers들 위와 측면에 filters들을 설치한 것이다. 도 5는 Drone의 Body와 frame의 6개의 propellers들 위에 filters들을 설치한 것에 대한 설명도 Drone의 Body와 frame(B)의 6개 propellers들 위에 filters(F)들을 설치한 것이다. 도 6은 도 5에 공기유도판과 외부에 입체적인 filter를 설치한 입체도 각 propeller들 외부 filter(F)의 부피를 높이기 위해 원통이나 3각통 이상의 각통을 형성한 것이다. 도 7은 도 6에 Drone의 Body 상, 하 branch frame 사이 2중 6개의 propeller가 설치된 propeller 외부에 입체 적인 filter를 설치한 입체도 Drone의 Body 상, 하 branch frame(B,P) 사이 2중 6개의 propeller가 설치된 propeller 외부측면에 입체적인 filter(F)를 설치한 경우는 각 propeller들 외부 filter(F)의 부피를 높이기 위해 원통이나 3각통 이상의 각통을 형성한 것이다. 도 8은 도 7의 Drone의 Body 상, 하 branch frame 사이 2중 6개의 propeller 사이에 3 connected turbine과 원 통을 설치한 입체도 Drone의 Body 상, 하 branch frame(B,P) 사이 '2중 6개의 propeller' 사이에 3 connected turbine(3ct) 과 원통을 설치한 후 원통이나 3각통 이상의 각통을 내부에 형성한 3 connected turbine의 duct inlets들 앞에 공기흡입 공간부를 형성하고 공기흡입 공간부에서 흡입관을 통해 공기를 흡입할 때 propeller 외부에 입체적 인 filter(F)를 설치한 filter(F)에 공기흡입 공간부에서 흡입관을 설치하게 한 것이다. 도 9는 도 8 아래에 1개의 공기유도판을 설치한 입체도 1개의 공기유도판(U)을 설치한 것으로 공기유도판(U)이 크게 제작되면 1개의 조절기관과 1개의 L보 outlet으로 조정이 편하다. 도 10은 도 9 아래에 2개의 공기유도판과 2개의 조절air outlets을 설치한 입체도 2개의 공기유도판(U)을 설치한 것으로 공기유도판(U)이 크게 제작되면 2개의 조절기관과 2개의 L보 outlet(L)으 로 2개의 L보 outlet(L)의 균형적인 조절이 편하다. 도 11은 도 10 아래에 각개의 공기유도판과 각개의 조절air outlets들과 Drone의 Body branch legs들에 branch wings들을 설치한 입체도 도 2에서 도 11까지 4개의 propeller와 6개의 propeller를 도시한 것으로 단계적으로 설명한 것이다. 도 12는 도 10 아래에 각개의 공기유도판과 각개의 조절air outlets들과 Drone의 Body branch legs에 2(cell)air pump,3(cell) air pump를 다수 작동 매카니즘으로 하는 수평운영체계도 본 발명에서 Drone의 착륙할 때 4개 이상의 2(cell)air pump,3(cell) air pump(AP)들의 수평을 이루어야 할 완 충 작용하는 legs(g)에 붙이는 2(cell)air pump,3(cell) air pump(AP)들의 하단tube들을 Drone의 Body floor center에 물Tank를 두고 Drone의 Body6) branch frame(P) legs(g)들 위에 tube들과 수평이 이루어지게 물pipe로 연결하고 Drone의 Body branch frame(P) legs(g) 내부에 설치하고 2(cell)air pump, 3(cell) air pump(AP)들의 tube cylinder(APC)들에 2(cell)air pump, 3(cell) air pump(AP)들보다 길이가 1/2 더 긴cylinder(APC)를 형성하고 Drone의 Body floor center에 물Tank와 연결되며 Drone의 Body branch(P) legs(g)들 끝단 위의 2(cell)air pump, 3(cell) air pump(AP)들을 설치하는 것과; Drone의 Body branch frame(B) legs(g)의 상단tube들은 2(cell)air pump,3(cell) air pump(AP)들보다 길이 가 1/2 더 긴cylinder(APC)를 형성하여 2(cell)air pump, 3(cell) air pump(AP)들의 tube내에서 이동하는 물 높이에 따라 이동하기 위해 물Tank의 높이는 2(cell)air pump, 3(cell) air pump(AP)들의 상단 tube들과 2(cell)air pump, 3(cell) air pump(AP)들의 상단tube들의 평지에서 높이가 같게 구성하고 Drone Body branch frame(B) legs(g)들 위에 하단 tube들내 긴 cylinder(APC)의 물 수위를 그대로 완충작용으로 하며 2(cell)air pump, 3(cell) air pump(AP)들 내의 air 완충작용을 바로 연결하여 2중 완충 처리되는 것이다. 도 13는 Drone의 Body branch legs들에 branch wings들을 설치할 수 있는 면 표시도 Drone의 장시간 비행에 필요한 arm이나 axis에 설치한 generator에서 발전한 전기를 battery에 저장하고 generator에서 발전한 전기를 propeller의 motor에 공급을 직접할 때와 battery의 propeller의 motor에 공급하는 것과 전기를 전자석으로 작동하는 propeller의 axis flexible shaft(10.같은 극면의 반발력을 이용한 자석엔진10-2005-0128802, 21.같은 극면의 반발력을 이용한 자석엔진10-2007-0037260 24.같은 극면의 반발력을 이용한 자석엔진10-2013-0046075자석엔진을 베어링으로)와 air layer protective wings들에서 모인 압축공기를 모으는 air pipe와 propeller의 연장axis축에 3 connected turbine(3ct)을 설치하고 3 connected turbine(3ct) axis아래에 연장axis 위의 긴 1fan (inner,outer,duct가 아님)들이 설치되고 긴 1fan여러 개의 끝에 영구자석과 원통air pipe밖의 권선들을 이용한 발전하며 duct inlets과 원통air pipe(c)의 긴 1fan에 서 나오는 압축공기의 추진력을 높인 Drone body의 air layer floor wing, air layer roof wing, air layer wall wing들 을 설치하고 Drone body에서 propeller까지의 branch frame(B,P)들에 air layer protective wing(bw)들을 고속비행에 사용한다. 도 14는 공기유도판과 조절air outet에 대한 입체설명도 공기유도판(U) 중앙 위에서 아래에 원통(c)구멍을 형성하고 공기유도판(U) 원통(c) 구멍 위 안에 톱니ring과 맞 물리는 톱니가 있는 원통(c)상단과 원통(c)을 잊는 L보 pipe(L)를 형성하되 │은 원통(c)에서 원통(c)으로 ─ 는 원통(c)에서 '아래에서 위의 긴 타원통0' 을 방향control outlet(cp)을 형성하는 것을 특징으로 하는 Drone 에 필요한 장비들 도 15는 propeller와 3 connected turbine과 공기유도판과 조절air outlet합하여 Propullor로 명명하고 propeller아래 Ring wing을 설치한 입체와 pipe와 inlets기능을 하는 관을 설치한 설명 도 propeller의 축에서 \"inner turbine과 outer turbine에 압축공기의 흐름이 반대방향의 1fan들을 순차적으로 연 결하고 outer turbine의 outer1fan 끝에 duct fan이 설치된 3 connected turbine\" 의 축으로 연장 연결되 고 3 connected turbine의 축이 다시 propeller가 설치된 1축에 연장되고 propeller에서 3connected turbine과 propeller가 연결된 외부에 원통(c)으로 연결되게 구성하고 그 아래에 공기유도판(U)을 형성 하고 공기유도판(U)아래 L보 outlets(L)들을 형성하여 control propullor를 형성하는 것을 특징으로 하는 Drone에 필요한 장비들 도 16은 출입문을 전, 후, 좌, 우 설치하게 하기 위한 35.연과 낙하산, 날개들을 가지는 배낭10-2016-0071178 frame, 47.날개를 단 배낭과 변형하는 외부 Body(문, 지붕)프레임과 Body(문, 지붕)와 날개를 더 단 비행기구 10-2017-0133894 frame에 대한 설명도 Drone의 승용공간의 air layer front, air layer 양 옆door, air layer rear가 Drone의 roof의 사방 테두리 아 래로 각 선택적 air 주입으로 air layer front, air layer 양 옆문, air layer rear가 roof의 사방 테두리와 평형을 이루게 하여 air layer protective wing으로 변환한 양 문과 지붕, 뒤로 탑승과 하승이 되게 한 것이다. 도 17은 branch wings들과 Ring wing을 설치하기 위한 air pipe 2(cell)air pump,3(cell) air pump를 다수 작 동 매카니즘으로 하는 수평, 연결 완충 대에 대한 설명도 Drone의 착륙할 때 4개 이상의 2(cell)air pump,3(cell) air pump(AP)들의 수평을 이루어야 할 완충작용하는 다리에 붙이는 2(cell)air pump,3(cell) air pump(AP)들의 하단tube들을 Drone의 Body(B) floor center에 물 Tank를 두고 Drone의 Body branch frame(B,P) legs(g)들 위에 tube들과 수평이 이루어지게 물pipe로 연결하고Drone의 Body branch frame(B,P) legs(g)에 branch wings(bw)들을 설치한 것이다."}
{"patent_id": "10-2018-0028169", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 Drone의 Body와 frame이 설치된 기본도 도 2는 Drone의 Body와 frame에 filter들을 설치한 4개의 propeller에 대한 설명도 도 3은 도 2의 propellers들에 filter들을 설치하고 propellers들 아래에 공기유도판을 설치한 입체도 도 4는 도 3의 외부에 입체적인 filter를 설치한 입체도 도 5는 Drone의 Body와 frame에 filter들을 설치한 6개의 propeller에 대한 설명도 도 6은 도 5에 공기유도판과 외부에 입체적인 filter를 설치한 입체도 도 7은 도 6에 Drone의 Body 상, 하 frame 사이 2중 6개의 propeller설치된 외부에 입체적인 filter를 설치한 입체도 도 8은 도 7의 Drone의 Body 상, 하 frame 사이 2중 6개의 propeller 사이에 3 connected turbine과 원통을 설치한 입체도 도 9는 도 8 아래에 1개의 공기유도판을 설치한 입체도 도 10은 도 9 아래에 2개의 공기유도판과 2개의 조절air outlets을 설치한 입체도 도 11은 도 10 아래에 각개의 공기유도판과 각개의 조절air outlets들과 Drone의 Body branch legs들에 branch wings들을 설치한 입체도 도 12는 도 10 아래에 각개의 공기유도판과 각개의 조절air outlets들과 Drone의 Body branch legs에 2(cell)air pump,3(cell) air pump를 다수 작동 매카니즘으로 하는 수평운영체계도 도 13는 Drone의 Body branch legs들에 branch wings들을 설치할 수 있는 면 표시도 도 14는 공기유도판과 조절air outlet에 대한 입체설명도 도 15는 propeller와 3 connected turbine과 공기유도판과 조절air outlet합하여 Propullor로 명명하고 propeller아래 Ring wing을 설치한 입체와 pipe와 inlets기능을 하는 관을 설치한 설명도 도 16은 출입문을 전, 후, 좌, 우 설치하게 하기 읽힌 35.연과 낙하산, 날개들을 가지는 배낭10-2016-0071178 frame, 47.날개를 단 배낭과 변형하는 외부 Body(문, 지붕)프레임과 Body(문, 지붕)와 날개를 더 단 비행기구 10-2017-0133894 frame에 대한 설명도 도 17은 branch wings들과 Ring wing을 설치하기 위한 air pipe 2(cell)air pump,3(cell) air pump를 다수 작 동 매카니즘으로 하는 수평, 연결완충대에 대한 설명도"}
