{"patent_id": "10-2022-0049387", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0139734", "출원번호": "10-2022-0049387", "발명의 명칭": "안테나 부재를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "서민철"}}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제1 하우징;상기 제1 하우징에 대하여 슬라이딩 가능하게 결합되는 제2 하우징;통신 모듈이 배치되고, 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판;상기 제2 하우징에 배치되는 제2 인쇄 회로 기판;유연한 소재로 형성되어 상기 제1 인쇄 회로 기판과 상기 제2 인쇄 회로 기판을 전기적으로 연결하는 연결부재;상기 연결 부재에 고정되고, 비 도전성 소재로 형성된 지지 구조물; 및상기 지지 구조물의 적어도 일부를 감싸며 도전성 소재로 형성되어 상기 연결 부재와 전기적으로 연결되고 RF신호를 송신 또는 수신하는 안테나 부재;를 포함하는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 연결 부재는,상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩에 대응하여 구부러지는 제1 영역을 포함하고,상기 지지 구조물은,상기 연결 부재의 제1 영역에 고정되는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제2 하우징은,상기 지지 구조물의 움직임을 안내하는 가이드 홈을 포함하고,상기 지지 구조물은,상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩에 대응하여 상기 가이드 홈을 따라 이동하는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제2 하우징은,상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩 상태에 기반하여 상기 안테나 부재를 감싸는 격벽부를 포함하고,상기 격벽부는,공개특허 10-2023-0139734-3-적어도 일부가 비 도전성 소재로 형성된 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 지지 구조물은,단면이 원 형태인 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 연결 부재를 덮도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되고, 제1 개구와 상기 제1 개구에 대해 이격되어 위치하는 제2 개구를 포함하는 리어 브라켓;을 더 포함하고,상기 제1 개구는,상기 제1 하우징이 상기 제2 하우징에 대해 제1 방향으로 이동된 제1 상태에서 상기 안테나 부재의 위치와 대응되는 위치에 형성되고,상기 제2 개구는,상기 제1 하우징이 상기 제2 하우징에 대해 제1 방향의 반대 방향인 제2 방향으로 이동된 제2 상태에서 상기 안테나 부재의 위치와 대응되는 위치에 형성되는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서,상기 연결 부재를 덮도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되는 리어 브라켓;을 더포함하고,상기 리어 브라켓은,상기 제2 하우징의 가이드 홈과 대응되도록 형성된 개구를 포함하는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 연결 부재는,제1 연결 부재, 상기 지지 구조물 및 상기 안테나 부재가 배치되는 제2 연결 부재를 포함하는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 제1 연결 부재와 상기 제2 연결 부재는,서로 다른 전기적 신호가 통과하는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2023-0139734-4-제1항에 있어서,상기 안테나 부재는,상기 연결 부재와 일체로 형성되는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 지지 구조물은,탄성 소재로 형성된 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전자 장치에 있어서,제1 하우징;상기 제1 하우징에 대하여 슬라이딩 가능하게 결합되는 제2 하우징;통신 모듈이 배치되고, 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판;상기 제2 하우징에 배치되는 제2 인쇄 회로 기판;유연한 소재로 형성되어 상기 제1 인쇄 회로 기판과 상기 제2 인쇄 회로 기판을 전기적으로 연결하는 연결부재; 및도전성 소재로 형성되어 상기 연결 부재에 전기적으로 연결되고, RF 신호를 송신 또는 수신하는 안테나 부재;를포함하는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 연결 부재는,상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩에 대응하여 구부러지는 제1 영역과 상기 제1 영역을 제외한 제2 영역을 포함하고,상기 안테나 부재는,상기 제2 영역에 배치되는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 제2 하우징은,상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩 상태에 기반하여 상기 안테나 부재를 감싸는 격벽부를 포함하고,상기 격벽부는,적어도 일부가 비 도전성 소재로 형성된 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2023-0139734-5-제12항에 있어서,상기 연결 부재는,제1 연결 부재, 상기 안테나 부재가 배치되는 제2 연결 부재를 포함하는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제1 연결 부재와 상기 제2 연결 부재는,서로 다른 전기적 신호가 통과하는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서,상기 연결 부재를 덮도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되고, 제1 개구와 상기 제1 개구에 대해 이격되어 위치하는 제2 개구를 포함하는 리어 브라켓;을 더 포함하고,상기 제1 개구는,상기 제1 하우징이 상기 제2 하우징에 대해 제1 방향으로 이동된 제1 상태에서 상기 안테나 부재의 위치와 대응되는 위치에 형성되고,상기 제2 개구는,상기 제1 하우징이 상기 제2 하우징에 대해 제1 방향의 반대 방향인 제2 방향으로 이동된 제2 상태에서 상기 안테나 부재의 위치와 대응되는 위치에 형성되는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제12항에 있어서,상기 연결 부재를 덮도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되는 리어 브라켓;을 더포함하고,상기 리어 브라켓은,상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩에 대응하여 상기 안테나 부재가 이동하는 경로와 대응되는영역에 형성된 개구를 포함하는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12항에 있어서, 상기 안테나 부재는,상기 연결 부재와 일체로 형성된 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항에 있어서,상기 연결 부재는,공개특허 10-2023-0139734-6-상기 제2 영역에 형성된 홈을 포함하고,상기 안테나 부재는,상기 제2 영역에 형성된 홈에 배치되는 전자 장치."}
{"patent_id": "10-2022-0049387", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 슬라이딩 가능하 게 결합되는 제2 하우징, 통신 모듈이 배치되고, 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판, 상기 제2 하 우징에 배치되는 제2 인쇄 회로 기판, 유연한 소재로 형성되어 상기 제1 인쇄 회로 기판과 상기 제2 인쇄 회로 기판을 전기적으로 연결하는 연결 부재, 상기 연결 부재에 고정되고, 비 도전성 소재로 형성된 지지 구조물 및 상기 지지 구조물의 적어도 일부를 감싸며 도전성 소재로 형성되어 상기 연결 부재와 전기적으로 연결되고 RF 신 호를 송신 또는 수신하는 안테나 부재를 포함할 수 있다."}
{"patent_id": "10-2022-0049387", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들은, 안테나 부재를 포함하는 전자 장치에관한 것이다."}
{"patent_id": "10-2022-0049387", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "변형이 가능한 디스플레이가 개발됨에 따라, 기존 바(bar) 형태의 전자 장치 이외의 다양한 형태의 전자 장치가 등장하고 있다. 롤러블 전자 장치는 슬라이딩 가능한 하우징을 포함하고, 하우징의 슬라이딩에 따라 디스플레이의 표시 영역이 확장 또는 축소되는 형태의 전자 장치를 의미할 수 있다."}
{"patent_id": "10-2022-0049387", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "롤러블 전자 장치는 디스플레이의 일부가 전자 장치 내부에 수납되어야하는 특성상 전자 장치 내부에 전자 부품 배치를 위한 공간이 부족할 수 있다. 특히, 통신 서비스의 발달에 따라 안테나 개수의 증가가 불가피한 상황에 서 안테나 배치 공간 확보가 필요할 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 안테나가 배치되는 공간을 확보하는 방안을 제시할 수 있다."}
{"patent_id": "10-2022-0049387", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 슬라이딩 가능 하게 결합되는 제2 하우징, 통신 모듈이 배치되고, 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판, 상기 제2 하우징에 배치되는 제2 인쇄 회로 기판, 유연한 소재로 형성되어 상기 제1 인쇄 회로 기판과 상기 제2 인쇄 회 로 기판을 전기적으로 연결하는 연결 부재, 상기 연결 부재에 고정되고, 비 도전성 소재로 형성된 지지 구조물 및 상기 지지 구조물의 적어도 일부를 감싸며 도전성 소재로 형성되어 상기 연결 부재와 전기적으로 연결되고 RF 신호를 송신 또는 수신하는 안테나 부재를 포함할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 제1 하우징, 상기 제1 하우징에 대하여 슬라이딩 가능하 게 결합되는 제2 하우징, 통신 모듈이 배치되고, 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판, 상기 제2 하 우징에 배치되는 제2 인쇄 회로 기판, 유연한 소재로 형성되어 상기 제1 인쇄 회로 기판과 상기 제2 인쇄 회로 기판을 전기적으로 연결하는 연결 부재 및 도전성 소재로 형성되어 상기 연결 부재에 전기적으로 연결되고, RF 신호를 송신 또는 수신하는 안테나 부재를 포함할 수 있다."}
{"patent_id": "10-2022-0049387", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에서는, 복수의 전기물을 전기적으로 연결하는 연결 부재에 안테나를 배치할 수 있다. 따라서, 전자 장치 내부에 안테나를 위한 별도의 공간 형성 없이 안테나를 배치할 수 있다."}
{"patent_id": "10-2022-0049387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한 상기 아이템 한 개 또는 복수개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",“또는 B 중 적어도 하나,”\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,”및 “또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘 째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구 성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, “기능적으로” 또는 “통신적으로”라는 용어와 함께 또는 이런 용어 없이, “커플드” 또는 “커 넥티드”라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무 선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다.메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a 및 도 2b는 본 개시의 다양한 실시예에 따른 인입 상태(slide-in state)에서 전자 장치의 전면 및 후면을 도시한 도면이다. 도 3a 및 도 3b는 본 개시의 다양한 실시예에 따른 인출 상태(slide-out state)에서 전자 장 치의 전면 및 후면을 도시한 도면이다. 도 2a 내지 도 3b의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실 시예들을 더 포함할 수 있다. 도 2a 내지 도 3b를 참고하면, 전자 장치는 제1 하우징(예: 제1 하우징 구조, 이동부 또는 슬라이드 하우징), 제1 하우징과 지정된 방향(예: ①방향 또는 ②방향)(예: ± y축 방향)으로 슬라이딩 가능하게 결 합된 제2 하우징(예: 제2 하우징 구조, 고정부 또는 베이스 하우징) 및 제1 하우징과 제2 하우징 의 적어도 일부를 통해 지지받도록 배치된 플렉서블 디스플레이(flexible diaplay)(예: expandable display 또는 stretchable display)를 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 사용자에 의해 파지된 제2 하우징을 기준으로, 제1 하우징이 제1 방향(①방향)으로 인출되거나(slide-out), 제1 방 향(①방향)과 반대인, 제2 방향(②방향)으로 인입되도록(slide-in) 배치될 수 있다. 한 실시예에 따르면, 제1 공간을 포함하는 제1 하우징의 적어도 일부는 제2 하우징의 제2 공간에 수용됨으로써, 인입 상태(slide-in state)로 변경될 수 있다. 한 실시예에 따르면, 전자 장치는, 인출 상태(slide-out state)에서, 적어도 부분적으로 제1 하우징의 적어도 일부와 동일한 평면을 형성하고, 인입 상태(slide-in state)에서 적어도 부분적으로 제2 하우징의 제2 공간으로 수용되는 밴딩 지지부(bendable member 또는 bendable support member)(예: 도 4의 밴딩 지지부)(예: 다관절 힌지 모듈 또는 멀티 바(multi-bar) 조립체)를 포함할 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이의 적어도 일부는, 인입 상태에서, 밴딩 지지부(예: 도 4의 밴딩 지지부)의 지지를 받으면서 제2 하우징의 내부 공간으로 수용됨 으로써 외부로부터 보이지 않게 배치될 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이의 적어도 일부 는, 인출 상태에서, 제1 하우징과 적어도 부분적으로 동일한 평면을 형성하는 밴딩 지지부(예: 도 4의 밴 딩 지지부)의 지지를 받으면서, 외부로부터 보일 수 있게 배치될 수 있다. 플렉서블 디스플레이는, 제2 하우징에 대한 제1 하우징의 슬라이딩에 따라, 외부로 시인되는 부분(예: 표시 영역(예: 도 5a 및 도 5b의 표시 영역(230-1))이 증감할 수 있다. 또한, 제2 하우징에 대한 제1 하우징의 슬라이딩에 따라, 전자 장치 내부에 수납된 부분(예: 수납 영역(예: 도 5a의 수납 영역(230-2))이 증감할 수 있다. 다양한 실시예에 따르면, 전자 장치는 제1 측면 부재를 포함하는 제1 하우징 및 제2측면 부재 를 포함하는 제2 하우징을 포함할 수 있다. 한 실시예에 따르면, 제1 측면 부재는 제1 방향(예: y 축 방향)을 따라 연장된 제1 측면, 제1 측면으로부터 실질적으로 수직한 방향(예: x 축 방향)을 따라 제1 측면의 길이보다 짧은 길이를 갖도록 연장된 제2 측면 및 제2 측면으로부터 제1 측 면과 실질적으로 평행하게 연장되는 제3 측면을 포함할 수 있다. 한 실시예에 따르면, 제1 측면 부 재는 적어도 부분적으로 도전성 소재(예: 금속)로 형성될 수 있다. 어떤 실시예에서, 제1 측면 부재 는 도전성 소재 및 비도전성 소재(예: 폴리머)의 결합에 의해 형성될 수 있다. 한 실시예에 따르면, 제1 하우징 은 제1 측면 부재의 적어도 일부로부터 제1 공간의 적어도 일부까지 연장된 제1 지지 부재 를 포함할 수 있다. 한 실시예에 따르면 제1 지지 부재는 제1 측면 부재와 일체로 형성될 수 있 다. 어떤 실시예에서, 제1 지지 부재는 제1 측면 부재와 별개로 구성되고, 제1 측면 부재와 구 조적으로 결합될 수도 있다. 다양한 실시예에 따르면, 제2 측면 부재는 적어도 부분적으로 제1 측면과 대응되는 제4 측면, 제4 측면으로부터 제2 측면과 실질적으로 평행한 방향으로 연장되고, 제4 측면보다 짧은 제5 측면 및 제5 측면으로부터 제3 측면과 대응되도록 연장되는 제6 측면을 포함할 수 있 다. 한 실시예에 따르면, 제2 측면 부재는 적어도 부분적으로 도전성 소재(예: 금속)로 형성될 수 있다.어떤 실시예에서, 제2 측면 부재는 도전성 소재 및 비도전성 소재(예: 폴리머)의 결합에 의해 형성될 수 있다. 한 실시예에 따르면, 제2 측면 부재의 적어도 일부는 제2 하우징의 제2 공간의 적어도 일부까지 연장된 제2 지지 부재를 포함할 수 있다. 한 실시예에 따르면 제2 지지 부재는 제2 측면 부 재와 일체로 형성될 수 있다. 어떤 실시예에서, 제2 지지 부재는 제2 측면 부재와 별개로 구성 되고, 제2 측면 부재와 구조적으로 결합될 수도 있다. 다양한 실시예에 따르면, 제1 측면과 제4 측면은 서로에 대하여 슬라이딩 가능하게 결합될 수 있다. 한 실시예에 따르면, 제3 측면과 제6 측면은 서로에 대하여 슬라이딩 가능하게 결합될 수 있 다. 한 실시예에 따르면, 인입 상태에서, 제1 측면은 제4 측면과 중첩됨으로써, 실질적으로 외부로 부터 보이지 않게 배치될 수 있다. 한 실시예에 따르면, 인입 상태에서, 제3 측면은 제6 측면과 중 첩됨으로써, 실질적으로 외부로부터 보이지 않게 배치될 수 있다. 어떤 실시예에서, 제1 측면 및 제3 측 면의 적어도 일부는, 인입 상태에서, 적어도 부분적으로 외부로부터 보일 수 있게 배치될 수도 있다. 한 실시예에 따르면, 인입 상태에서, 제1 지지 부재는 제2 지지 부재와 중첩됨으로써, 실질적으로 외부 로부터 보이지 않게 배치될 수 있다. 어떤 실시예에에서, 제1 지지 부재의 일부는, 인입 상태에서, 제2 지 지 부재와 중첩됨으로써, 외부로부터 보이지 않게 배치되고, 제1 지지 부재의 나머지 일부는 외부로 부터 보일 수 있게 배치될 수도 있다. 다양한 실시예에 따르면, 전자 장치는 후면에서, 제1 하우징과 결합된 제1 후면 커버를 포함할 수 있다. 한 실시예에 따르면, 제1 후면 커버는 제1 지지 부재의 적어도 일부를 통해 배치될 수 있다. 어떤 실시예에서, 제1 후면 커버는 제1 측면 부재와 일체로 형성될 수도 있다. 한 실시예에 따 르면, 제1 후면 커버는 폴리머, 코팅 또는 착색된 유리, 세라믹, 금속(예: 알루미늄, 스테인레스 스틸 (STS), 또는 마그네슘), 또는 이러한 소재들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 어떤 실시예에서, 제1 후면 커버는 제1 측면 부재의 적어도 일부까지 연장될 수도 있다. 어떤 실시예에서, 제1 지지 부 재의 적어도 일부는 제1 후면 커버로 대체될 수도 있다. 다양한 실시예에 따르면, 전자 장치는 후면에서, 제2 하우징과 결합된 제2 후면 커버를 포함할 수 있다. 한 실시예에 따르면, 제2 후면 커버는 제2 지지 부재의 적어도 일부를 통해 배치될 수 있다. 어떤 실시예에서, 제2 후면 커버는 제2 측면 부재와 일체로 형성될 수도 있다. 한 실시예에 따 르면, 제2 후면 커버는 폴리머, 코팅 또는 착색된 유리, 세라믹, 금속(예: 알루미늄, 스테인레스 스틸 (STS), 또는 마그네슘), 또는 이러한 소재들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 어떤 실시예에서, 제2 후면 커버는 제2 측면 부재의 적어도 일부까지 연장될 수도 있다. 어떤 실시예에서, 제2 지지 부 재의 적어도 일부는 제2 후면 커버로 대체될 수도 있다. 다양한 실시예에 따르면, 전자 장치는 제1 하우징 및 제2 하우징의 적어도 일부의 지지를 받도 록 배치되는 플렉서블 디스플레이를 포함할 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이는 항 상 외부로부터 보여지는 제1 부분(230a)(예: 평면부) 및 제1 부분(230a)으로부터 연장되고, 인입 상태에서 외부 로부터 적어도 일부분이 보이지 않도록 제2 하우징의 제2 공간으로 적어도 부분적으로 수용되는 제2 부분(230b)(예: 굴곡 가능부)을 포함할 수 있다. 한 실시예에 따르면, 제1 부분(230a)은 제1 하우징의 지 지를 받도록 배치되고, 제2 부분(230b)은 적어도 부분적으로 밴딩 지지부(예: 도 4의 밴딩 지지부)의 지지 를 받도록 배치될 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이의 제2 부분(230b)은, 제1 하우징 이 제1 방향(①방향)을 따라 인출된 상태에서, 밴딩 지지부(예: 도 4의 밴딩 지지부)의 지지를 받으 면서 제1 부분(230a)으로부터 연장되고, 제1부분(230a)과 실질적으로 동일한 평면을 형성하고, 외부로부터 보일 수 있도록 배치될 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이의 제2 부분(230b)은, 제2 하우징 이 제2 방향(②방향)을 따라 인입된 상태에서, 제2 하우징의 제2 공간으로 수용되고, 외부로부 터 보이지 않도록 배치될 수 있다. 따라서, 전자 장치는 제2 하우징으로부터 지정된 방향(예: ±y 축 방향)을 따라 제1 하우징이 슬라이딩 방식으로 이동됨에 따라 플렉서블 디스플레이의 표시 면적이 가 변되도록 유도할 수 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이는 제2 하우징을 기준으로 이동되는 제1 하우징의 슬라이딩 이동에 따라, 제1 방향(①방향)으로의 길이가 가변될 수 있다. 예컨대, 플렉서블 디스플레이는, 인입 상태에서, 제1 길이(L1)에 대응하는 제1 표시 면적(예: 제1 부분(230a)과 대응하는 영역)을 가질 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이는, 인출 상태에서, 제2 하우징을 기준으로 추가적으로 제2 길이(L2) 만큼 이동된 제1 하우징의 슬라이딩 이동에 따라, 제1 길이(L1)보다 긴 제3 길이(L3)와 대응되고, 제1 표시 면적보다 큰 제3 표시 면적(예: 제1 부분(230a)과 제2 부분(230b))을 포함하는 영역)을 갖도록 확장될 수 있다. 다양한 실시예에 따르면, 전자 장치는, 제1 하우징의 제1 공간에 배치된 입력 장치(예: 마이크 (203-1)), 음향 출력 장치(예: 통화용 리시버 또는 스피커), 센서 모듈(204, 217), 카메라 모듈(예: 제1카메라 모듈 또는 제2카메라 모듈), 커넥터 포트, 키 입력 장치 또는 인디케이터(미도 시 됨) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제2 하우징에 배치된 또 다른 입력 장치(예: 마이크)을 포함할 수 있다. 다른 실시예로, 전자 장치는, 상술한 구성 요소들 중 적어도 하나가 생략되거나, 다른 구성 요소들이 추가적으로 포함되도록 구성될 수도 있다. 다른 실시예로, 상술 한 구성 요소들 중 적어도 하나는 제2 하우징의 제2 공간에 배치될 수도 있다. 다양한 실시예에 따르면, 입력 장치는, 마이크(203-1)를 포함할 수 있다. 어떤 실시예에서는, 입력 장치(예: 마 이크(203-1))는 소리의 방향을 감지할 수 있도록 배치되는 복수의 마이크들을 포함할 수도 있다. 음향 출력 장 치는, 예를 들어, 통화용 리시버 및 스피커를 포함할 수 있다. 한 실시예에 따르면, 스피커는, 인입/인출 상태에 관계없이, 항상 외부로 노출되는 위치(예: 제2측면)에서, 제1 하우징에 형성된 적 어도 하나의 스피커 홀을 통해 외부와 대응될 수 있다. 한 실시예에 따르면, 커넥터 포트는, 인출 상태에 서, 제1 하우징에 형성된 커넥터 포트 홀을 통해 외부와 대응될 수 있다. 어떤 실시예에서, 커넥터 포트 는 인입 상태에서, 제2 하우징에 형성되고, 커넥터 포트 홀과 대응하도록 형성된 오프닝을 통해 외부 와 대응될 수도 있다. 어떤 실시예에서, 통화용 리시버는 별도의 스피커 홀이 배제된 채, 동작되는 스피커 (예: 피에조 스피커)를 포함할 수도 있다. 다양한 실시예에 따르면, 센서 모듈(204, 217)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태 에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈(204, 217)은, 예를 들어, 전자 장치 의 전면에 배치된 제1 센서 모듈(예: 근접 센서 또는 조도 센서) 및/또는 전자 장치의 후면에 배치된 제2 센서 모듈(예: HRM(heart rate monitoring) 센서)을 포함할 수 있다. 한 실시예에 따르면, 제1 센서 모듈은 전자 장치의 전면에서, 플렉서블 디스플레이 아래에 배치될 수 있다. 한 실시예에 따르 면, 제1 센서 모듈 및/또는 제2 센서 모듈은 근접 센서, 조도 센서, TOF(time of flight) 센서, 초 음파 센서, 지문 인식 센서, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서 또는 습도 센서 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 카메라 모듈은, 전자 장치의 전면에 배치된 제1 카메라 모듈 및 전자 장치 의 후면에 배치된 제2 카메라 모듈을 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제2 카 메라 모듈 근처에 위치되는 플래시(미도시 됨)를 포함할 수도 있다. 한 실시예에 따르면, 카메라 모듈들 (205, 216)은, 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 한 실시예에 따르면, 제1 카메라 모듈은 플렉서블 디스플레이 아래에 배치되고, 플렉서블 디스플레이 의 활성화 영역(예: 표시 영역) 중 일부를 통해 피사체를 촬영하도록 구성될 수도 있다. 다양한 실시예에 따르면, 카메라 모듈들 중 제1 카메라 모듈, 센서 모듈(204, 217)들 중 일부 센서 모듈 은 플렉서블 디스플레이를 통해 외부 환경을 검출하도록 배치될 수 있다. 예컨대, 제1 카메라 모듈 또는 일부 센서 모듈은 제1 하우징의 제1 공간에서, 플렉서블 디스플레이에 형성된 투과 영역 또는 천공된 오프닝을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 한 실시예에 따르면, 플렉 서블 디스플레이의 제1 카메라 모듈과 대면하는 영역은 컨텐츠를 표시하는 표시 영역의 일부로써, 지 정된 투과율을 갖는 투과 영역으로 형성될 수도 있다. 한 실시예에 따르면, 투과 영역은 약 5% 내지 약 20% 범 위의 투과율을 갖도록 형성될 수 있다. 이러한 투과 영역은 이미지 센서로 결상되어 화상을 생성하기 위한 광이 통과하는, 제1 카메라 모듈의 유효 영역(예: 화각 영역)과 중첩되는 영역을 포함할 수 있다. 예를 들어, 플렉서블 디스플레이의 투과 영역은 주변보다 픽셀의 배치 밀도 및/또는 배선 밀도가 낮은 영역을 포함할 수 있다. 예를 들어, 투과 영역은 상술한 오프닝을 대체할 수 있다. 예를 들어, 일부 카메라 모듈은 언더 디스플레이 카메라(UDC, under display camera)를 포함할 수 있다. 어떤 실시예에서, 일부 센서 모듈은 전 자 장치의 내부 공간에서 플렉서블 디스플레이를 통해 시각적으로 노출되지 않고, 그 기능을 수행하 도록 배치될 수도 있다. 다양한 실시예에 따르면, 전자 장치는 제2 하우징에 배치된 무선 통신 회로(예: 도 1의 무선 통신 모 듈)와 전기적으로 연결된 적어도 하나의 안테나를 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제2 하우징의 도전성 제2측면 부재를 통해 배치된 베젤 안테나(A)를 포함할 수도 있다. 예컨대, 베젤 안테나(A)는 제2 측면 부재의 제5 측면 및 제6 측면의 적어도 일부에 배치되고, 비도전성 소재(예: 폴리머)로 형성된 적어도 하나의 분절부(2271, 2272)를 통해 전기적으로 분절된 도전성 부분을 포 함할 수 있다. 한 실시예에 따르면, 무선 통신 회로(예: 도 1의 무선 통신 모듈)는 도전성 부분을 통 해 지정된 적어도 하나의 주파수 대역(예: 약 800MHz ~ 6000MHz)(예: legacy 대역)에서 무선 신호를 송신 또는 수신하도록 설정될 수 있다. 한 실시예에 따르면, 전자 장치는 적어도 하나의 분절부의 적어도 일부 를 커버하기 위하여, 제5 측면에 배치된 측면 커버(2212a)를 포함할 수 있다. 어떤 실시예에서, 베젤 안 테나(A)는 제2 측면, 제4 측면, 제5 측면, 제6 측면 중 적어도 하나의 측면에 배치될 수도 있다. 어떤 실시예에서, 전자 장치는 내부 공간(예: 제1 공간 또는 제2 공간)에 배치되 고, 또 다른 무선 통신 회로(예: 도 1의 무선 통신 모듈)를 통해, 약 3GHz ~ 100GHz 범위의 주파수 대역에 서 무선 신호를 송신 또는 수신하도록 배치된 적어도 하나의 안테나 모듈(예: 5G 안테나 모듈 또는 안테나 구조 체)을 더 포함할 수도 있다. 다양한 실시예에 따르면, 전자 장치의 인입/인출 동작은 자동으로 수행될 수 있다. 예컨대, 전자 장치 의 인입/인출 동작은, 제1 하우징의 제1 공간에 배치된 피니언 기어(예: 도 4의 피니언 기어 )를 포함하는 구동 모터(예: 도 4의 구동 모터)와, 제2 하우징의 제2 공간에 배치되고, 피니언 기어와 치합된 랙 기어(예: 도 4의 랙 기어)의 기어링 동작을 통해 수행될 수 있다. 예컨대, 전자 장치의 프로세서(예: 도 1의 프로세서120))는, 인입 상태로부터 인출 상태로 변경되거나, 인출 상태 로부터 인입 상태로 변경되기 위한 트리거링 동작을 검출할 경우, 전자 장치의 내부에 배치된 구동 모터 (예: 도 4의 구동 모터)를 동작시킬 수 있다. 한 실시예에 따르면, 트리거링 동작은 플렉서블 디스플레이 에 표시된 객체(object)를 선택(예: 터치)하거나, 전자 장치에 포함된 물리적 버튼(예: 키 버튼)의 조작을 포함할 수 있다. 본 개시의 예시적인 실시예들에 따른 전자 장치는 제1 하우징의 제1 공간에서, 인입 방향(②방 향)으로의 단부(예: 인입 상태에서, 제1 하우징의 하단)에 구동 모터(예: 도 4의 구동 모터)가 배치 되고, 구동 모터의 피니언 기어가 제2 하우징의 제2 공간에 대응 배치된 랙 기어(예: 도 4의 랙 기어)를 타고 이동되는 설계 구조(예: 인입 상태에서, 구동 모터가 제1 하우징의 하단에 배 치되는 구조)를 가짐으로써, 확장된 슬라이딩 거리(stroke)를 제공할 수 있다. 또한, 전자 장치는, 제1 하 우징의 제1 공간에 구동 모터와 함께 배치된 전자 부품들(예: 기판 또는 배터리)을 포함함으로 써, 구동 모터와의 효율적인 전기적 연결 구조를 제공할 수 있다. 또한, 인출 상태(slide-out state)에서, 플렉서블 디스플레이의 적어도 일부를 지지하도록 제2 하우징의 제2 공간에 배치된 지지 구조 를 포함함으로써, 전자 장치의 작동 신뢰성 향상에 도움을 줄 수 있다. 이하, 상세한 설명은 하기에 기술될 것이다. 도 4는 본 개시의 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 4의 전자 장치를 설명함에 있어서, 도 2a 내지 도 3b의 전자 장치와 실질적으로 동일한 구성 요소 들에 대해서는 동일한 부호를 부여하였으며, 그 상세한 설명은 생략될 수 있다. 도 4를 참고하면, 전자 장치는 제1 공간을 포함하는 제1 하우징, 제1 하우징과 슬라이딩 가능하게 결합되고 제2 공간(예: 도 3a의 제2 공간)을 포함하는 제2 하우징, 제2 공간에서 적 어도 부분적으로 회동 가능하게 배치되는 밴딩 지지부, 밴딩 지지부의 적어도 일부와 제1 하우징 의 지지를 받도록 배치된 플렉서블 디스플레이 및 제1 하우징을 제2 하우징으로부터 인입 되려는 방향(예: -y 축 방향) 및/또는 인출되려는 방향(예: y축 방향)으로 구동시키는 이동부를 포함할 수 있다. 한 실시예에 따르면, 이동부는 제1 공간에 배치되고, 피니언 기어를 포함하는 구동 모터 및 제2 공간에서, 피니언 기어와 치합되도록 배치된 랙 기어를 포함할 수 있다. 한 실시예에 따 르면, 이동부는 구동 모터와 결합됨으로써, 회전 속도를 감속시키고, 구동력을 증가시키도록 배치된 감속 모듈을 더 포함할 수 있다. 한 실시예에 따르면, 구동 모터는 제1 하우징의 제1 공간에서, 제1 지지 부재의 적어도 일부를 통해 지지받도록 배치될 수 있다. 한 실시예에 따르면, 구동 모터는, 제1 공간에서, 인입 방향(예: -y 축 방향)으로, 제1 지지 부재의 단부(예: 에지)에 고정될 수 있다. 다양한 실시예에 따르면, 전자 장치는 제1 공간에 배치된 복수의 전자 부품들을 포함할 수 있다. 한 실시예에 따르면, 복수의 전자 부품들은 제1 기판(예: 메인 기판), 제1 기판의 주변에 배치된 카메라 모듈, 소켓 모듈(예: SIM 트레이), 스피커, 커넥터 포트 및 배터리(B)를 포함할 수 있다.한 실시예에 따르면, 복수의 전자 부품들은 구동 모터와 함께 제1 하우징의 제1 공간에서, 제1 기판 주변에 배치되기 때문에 효율적인 전기적 연결이 가능할 수 있다. 다양한 실시예에 따르면, 전자 장치는 제1 하우징의 제1 지지 부재와 제1 후면 커버 사이 에서, 복수의 전자 부품들 중 적어도 일부를 커버하도록 배치된 리어 브라켓을 포함할 수 있다. 한 실시예 에 따르면, 리어 브라켓은 제1 지지 부재의 적어도 일부와 구조적으로 결합될 수 있다. 어떤 실시예 에서, 리어 브라켓은 생략될 수도 있다. 한 실시예에 따르면, 리어 브라켓은 복수의 전자 부품들을 커버하고, 제1 후면 커버를 지지하도록 배치될 수 있다. 한 실시예에 따르면, 리어 브라켓은 카메라 모듈 및/또는 센서 모듈(예: 도 3b의 센서 모듈)과 대응하는 영역에 형성된 노치 영역(214a) 또는 오 프닝(214a)(예: 관통홀)을 포함할 수 있다. 한 실시예에 따르면, 카메라 모듈 및/또는 센서 모듈은 노치 영역(214a) 또는 오프닝(214a)을 통해 외부 환경을 검출하도록 배치될 수 있다. 한 실시예에 따르면, 제1 후면 커버는 적어도 카메라 모듈 및/또는 센서 모듈과 대응하는 영역이 투명하게 처리될 수 있 다. 어떤 실시예에서, 카메라 모듈 및/또는 센서 모듈은, 전자 장치가 인출 상태인 경우에만 동 작하도록 구성될 수도 있다. 다양한 실시예에 따르면, 전자 장치는 제2 하우징의 제2 공간에 배치되고, 제1 지지 부재(21 2)의 적어도 일부와 슬라이딩 가능하게 결합된 플레이트 타입의 지지 브라켓(예: DSB, display support bar)을 포함할 수 있다. 한 실시예에 따르면, 지지 브라켓은 지정된 크기의 오프닝(225a)을 포함할 수 있 다. 한 실시예에 따르면, 지지 브라켓은 일단에 배치되고, 슬라이딩 동작 중 굽어지는 밴딩 지지부의 배면을 지지하기 위하여 외면이 곡형으로 형성된 지지부를 포함할 수 있다. 한 실시예에 따르면, 지지 브 라켓은 지지부의 적어도 일부로부터 오프닝(225a)의 적어도 일부까지 연장됨으로써, 인출 상태에서, 밴딩 지지부의 배면을 지지하도록 형성된 지지 플레이트를 포함할 수 있다. 한 실시예에 따르면, 지 지 브라켓은 오프닝(225a)을 가로지르고, 슬라이딩 방향과 평행한 방향을 따라 길이를 갖도록 고정된 랙 기어를 포함할 수 있다. 어떤 실시예에서, 랙 기어는 지지 브라켓과 일체로 형성될 수도 있다. 한 실시예에 따르면, 전자 장치는 지지 브라켓의 양측면에 배치됨으로써, 밴딩 지지부의 양단을 슬라이딩 방향으로 가이드하기 위한 한 쌍의 가이드 레일을 포함할 수 있다. 다양한 실시예에서, 밴딩 지지부는, 전자 장치의 슬라이딩 과정에서밴딩되는 플렉서블 디스플레이 를 지지할 수 있도록 밴딩이 가능한 구조를 포함할 수 있다. 예를 들어, 밴딩 지지부는 서로 분절된 복수의 바(bar) 형상의 지지부를 포함할 수 있다. 밴딩 지지부에 포함된 지지부는 양 단이 한 쌍의 가이드 레일에 삽입될 수 있다. 가이드 레일을 따라 지지부가 움직이면서 슬라이딩 과정에서 이동하는 플렉 서블 디스플레이를 지지할 수 있다. 지지부가 서로 분절되어 있으므로, 플렉서블 디스플레이의 밴딩 영역(예: 도 5a 및 도 5b의 밴딩 영역(230-3))을 지지할 수 있다. 다양한 실시예에 따르면, 제2 하우징은 제2 지지 부재에서, 전자 장치가 인입 상태일 때, 제1 하우징에 배치된 카메라 모듈 및/또는 센서 모듈과 대응하는 영역에 배치된 오프닝(222a)(예: 관통홀)을 포함할 수 있다. 한 실시예에 따르면, 카메라 모듈 및/또는 센서 모듈은, 전자 장치 가 인입 상태일 때, 제2 하우징에 형성된 오프닝(222a)을 통해 외부 환경을 검출할 수 있다. 이러한 경우, 제2 후면 커버의, 적어도 카메라 모듈 및/또는 센서 모듈과 대응하는 영역은 투명하게 처리될 수 있다. 도 5a는 본 개시의 다양한 실시예에 따른 도 2a의 라인 5a-5a를 따라 바라본 전자 장치의 단면도이다. 도 5b는 본 개시의 다양한 실시예에 따른 도 3a의 라인 5b-5b를 따라 바라본 전자 장치의 단면도이다. 도 5a 및 도 5b의 전자 장치를 설명함에 있어서, 도 4의 전자 장치와 실질적으로 동일한 구성 요소들에 대해서 는 동일한 부호를 부여하였으며, 그 상세한 설명은 생략될 수 있다. 도 5a 및 도 5b를 참고하면, 전자 장치는 제1 공간을 갖는 제1 하우징, 제2 공간을 갖 는 제2 하우징, 제1 하우징과 연결되고, 인입 상태에서 적어도 부분적으로 제2 공간에 수용되 는 밴딩 지지부, 밴딩 지지부의 적어도 일부와 제1 하우징의 적어도 일부의 지지를 받도록 배치 되는 플렉서블 디스플레이 및 제1 공간에 배치되고, 제2 공간의 랙 기어와 치합된 피니언 기 어를 포함하는 구동 모터를 포함할 수 있다. 한 실시예에 따르면, 구동 모터는 제2 하우징을 기 준으로 제1 하우징을 인입 방향(②방향) 또는 인출 방향(①방향)으로 자동으로 이동시킬 수 있다.다양한 실시예에 따르면, 제1 하우징은, 전자 장치의 인입 상태에서, 적어도 일부가 제2 하우징(22 0)의 제2 공간에 수용될 수 있다. 한 실시예에 따르면, 제1 지지 부재는 슬라이딩 가능하게 결합되 고, 제2 공간에 배치된 지지 브라켓의 안내를 받을 수 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이는 표시 영역(230-1), 수납 영역(230-2), 밴딩 영역(230- 3)을 포함할 수 있다. 표시 영역(230-1), 수납 영역(230-2), 밴딩 영역(230-3)은 플렉서블 디스플레이의 각 영역을 설명의 편의를 위해 개념적으로 구분한 것이다. 따라서, 각 영역은 물리적으로 구분되거나 시각적으 로 구분되는 영역이 아닐 수 있다. 표시 영역(230-1)은 플렉서블 디스플레이가 전자 장치의 외부로 시인되는 영역일 수 있다. 표시 영역(230-1)을 통해 사용자는 플렉서블 디스플레이를 통해 표시되는 시각 적 정보를 확인할 수 있다. 수납 영역(230-2)은 플렉서블 디스플레이가 전자 장치의 내부로 수납된 영역일 수 있다. 수납 영역(230-2)은 다른 기구물(예: 제1 하우징, 제2 하우징, 제1 지지 부재, 및/또는 제2 지지 부재)에 의해 가려진 부분으로써, 전자 장치 외부에서 시인되지 않는 영역일 수 있 다. 밴딩 영역(230-3)은 표시 영역(230-1)과 수납 영역(230-2) 사이의 영역일 수 있다. 밴딩 영역(230-3)은 플 렉서블 디스플레이가 변형된 영역일 수 있다. 가이드 레일의 형상에 따라 절곡된 밴딩 지지부가 밴딩 영역(230-3)을 지지할 수 있다. 전자 장치의 슬라이딩 방향(예: 도 5a의 Y 방향)과 실질적으로 평행 한 표시 영역(230-1) 및 수납 영역(230-2)과 달리 밴딩 영역(230-3)은 플렉서블 디스플레이가 변형된 상태 로 유지되는 영역일 수 있다. 다양한 실시예에서, 제1 하우징이 제2 하우징에 대하여 제1 방향(①방향)으로 슬라이딩되면, 표시 영 역(230-1)은 증가하고, 수납 영역(230-2)은 감소할 수 있다. 반대로 제1 하우징이 제2 하우징에 대하 여 제2 방향(②방향)으로 슬라이딩되면, 표시 영역(230-1)은 감소하고, 수납 영역(230-2)은 증가할 수 있다. 상 술한 제1 하우징의 슬라이딩은 구동 모터에 의해 자동적으로 수행될 수 있다. 다양한 실시예에 따르면, 제1 하우징에 배치된 구동 모터 및 전자 부품들(예: 제1 기판 및 배터 리(B))는 제1 하우징의 인입/인출 동작에 따라 함께 이동됨으로써, 해당 구성 요소들이 제2 하우징에 배치되고, 제1 기판과 전기적 연결 부재를 통해 연결되는 배치 구조 대비, 전기적 연결 부재가 감소됨으로 써, 전자 장치의 작동 신뢰성 향상 및 전자 부품의 효율적 배치 설계에 도움을 줄 수 있다. 도 6a는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인출된 상태(slide-out state)에서 연결 부재와 지지 구조물을 나타낸 도면이다. 도 6b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인입된 상태 (slide-in state)에서 연결 부재와 지지 구조물을 나타낸 도면이다. 도 6c는 본 문서에 개시된 다양한 실시예에 따른 지지 구조물과 지지 구조물의 움직임을 안내하는 가이드 홈을 나타낸 도면이다. 이하에서는, 앞서 설명한 전자 장치(예: 도 1의 전자 장치)와 유사한 구성 요소를 포함하므로, 중복 되는 구성 요소에 대한 자세한 설명은 생략하고 필요한 경우가 아니라면 동일 또는 유사한 구성 요소에 대해서 는 동일한 부재 번호를 사용하여 설명하도록 한다. 다양한 실시예에 따르면, 도 6a에 도시된 것과 같이, 전자 장치에는 복수의 인쇄 회로 기판(301, 302)이 배치될 수 있다. 인쇄 회로 기판(301, 302)은 제1 인쇄 회로 기판(예: 도 4의 제1 기판(예: 메인 기 판))과 제2 인쇄 회로 기판(예: 도 4의 제2 기판(예: 서브 기판))을 포함할 수 있다. 일 실시예에서, 제1 인쇄 회로 기판은 제1 하우징에 배치될 수 있다. 제2 인쇄 회로 기판은 제2 하우징에 배치될 수 있다. 제1 인쇄 회로 기판은 제1 하우징에 배치되는 복수의 전자 부품들과 전기적으로 연 결될 수 있다. 예를 들어, 제1 인쇄 회로 기판은 통신 모듈(예: 도 1의 통신 모듈), 카메라 모 듈, 소켓 모듈(예: SIM 트레이), 스피커, 커넥터 포트 및 배터리(B)와 전기적으로 연결될 수 있다. 제2 인쇄 회로 기판은 제2 하우징에 배치되는 복수의 전자 부품들과 전기적으로 연결될 수 있다. 다양한 실시예에 따르면, 전자 장치는 제1 인쇄 회로 기판과 제2 인쇄 회로 기판을 전기적으로 연결하는 연결 부재를 포함할 수 있다. 연결 부재는 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판 에 각각 연결된 전자 부품 간의 전기적 신호를 전달할 수 있다. 일 실시예에서, 연결 부재는 후술할 연결 부재에 배치된 안테나 부재(예: 도 1의 안테나 모듈)와 제1 인쇄 회로 기판에 배치된 통신 모듈을 전기적으로 연결할 수 있다. 일 실시예에서, 연결 부재는 RF(radio frequency) 신호를 전달하는 구성 요소일 수 있다. 연결 부재는 전자 장치의 통신 모듈에서 처리된 RF 신호를 안테나 부재에 전달하거나, 안테나 부재에서 수신된 RF 신호를 통신 모듈에 전달할 수 있다. 일 실시예에서, 연결 부재의 일단에 위치한 커넥터 핀(미도시)은 제1 인쇄 회로 기판에 형성된 커넥 터 부(미도시)에 연결될 수 있다. 또한, 연결 부재의 타단에 위치한 커넥터 핀(미도시)은 제2 인쇄 회로 기판에 형성된 커넥터 부(미도시)에 연결될 수 있다. 따라서, 제1 인쇄 회로 기판과 제2 인쇄 회로 기판에 배치된 전자 부품들은 연결 부재를 통해 전기적으로 연결될 수 있다. 일 실시예에서, 연결 부 재의 일단에 위치한 커넥터 핀(미도시)은 연결 부재와 일체로 형성될 수 있다. 일 실시예에서, 연결 부재는 전자 장치의 슬라이딩 거리를 수용할 수 있는 길이 또는 형상을 갖도록 배치될 수 있다. 일 실시예에서, 연결 부재는 인출 상태(slide-out state)에서 확장되고, 인입 상태(slid- in state)에서 원래의 위치로 복원되는 탄성을 갖는 소재로 형성될 수 있다. 일 실시예에서, 연결 부재는 FRC(flexible printed circuit board radio frequency cable) 또는 FPCB(flexible printed circuit board)를 포함할 수 있다. 연결 부재는 유연 소재로 형성되고, 복수의 도전성 라인을 포함할 수 있다. 예를 들어, 연결 부재는 전원선, 신호선, 및/또는 접지선을 포함할 수 있다. 예를 들어, 연결 부재에 포함된 도 전성 라인 중 적어도 일부는 제1 하우징에 배치된 전자 부품 및/또는 제2 하우징에 배치된 전자 부품 과 전기적으로 연결될 수 있다. 다양한 실시예에 따르면, 연결 부재는 제2 하우징의 제1 하우징에 대한 슬라이딩(또는 제1 하우 징의 제2 하우징에 대한 슬라이딩)에 대응하여 구부러지는 제1 영역(310-1)(예: 밴딩 영역)과 제1 영 역(310-1)을 제외한 제2 영역(310-2)(예: 직선 영역)을 포함할 수 있다. 도 6b를 참조하면, 제1 하우징이 제2 하우징에 대해 제2 방향으로 인입된 상태(slide-in state)에서 연결 부재의 제1 영역(310-1)은 구부러질 수 있다. 이러한 경우, 연결 부재의 제1 영역(310-1)은 전자 장치가 인입된 상태에서 과도 하게 접히거나, 제1 영역(310-1)과 인접하게 위치하는 기구물과의 접촉을 통해 파손될 수 있다. 본 문서에 개시 된 다양한 실시예에 따르면, 도 6a 및 도 6b에 도시된 것과 같이, 연결 부재에는 연결 부재를 지지하 는 지지 구조물이 배치될 수 있다. 지지 구조물은 연결 부재가 구부러지는 영역(예: 제1 영역 (310-1))을 지지할 수 있다. 따라서, 연결 부재의 제1 영역(310-1)은 전자 장치가 인입되는 과정에서 과도하게 구부러지거나 주변 기구물과 접촉을 통해 손상되는 현상이 완화 또는 해소될 수 있다. 지지 구조물 에 대해서는 이하에서 자세히 설명하도록 한다. 다양한 실시예에 따르면, 도 6a 및 도 6b에 도시된 것과 같이, 연결 부재에는 연결 부재를 지지하는 지지 구조물이 배치될 수 있다. 일 실시예에서, 지지 구조물은 전자 장치의 인입(slide-in) 또 는 인출(slide-out)에 따라 구부러지는 연결 부재의 제1 영역(310-1)에 고정될 수 있다. 이에 따라, 연결 부재는 전자 장치가 인입된 상태에서 지지 구조물을 통해 일정한 형상을 유지할 수 있다. 예를 들어, 도 6b를 참조하면, 연결 부재의 제1 영역(310-1)은 지지 구조물을 통해 지지되어 일정 곡률을 가진 형상으로 구부러질 수 있다. 일 실시예에서, 지지 구조물은 러버, 우레탄, 폼(POM)과 같은 탄성 소재로 형성될 수 있다. 이에 따라 지 지 구조물은 연결 부재에 가해지는 외부 충격으로부터 연결 부재를 보호할 수 있다. 일 실시예 에서, 지지 구조물은 연결 부재를 가압하지 않도록 단면이 원형인 형태로 형성될 수 있다. 이러한 경 우, 지지 구조물은 모서리가 형성되지 않음에 따라 지지 구조물과 접촉되는 연결 부재를 가압하 지 않을 수 있다. 따라서, 연결 부재는 지지 구조물에 의해 손상되지 않을 수 있다. 또한, 전자 장치 가 인입된 상태에서 연결 부재의 제1 영역(310-1)은 지지 구조물의 형상과 대응되는 일정 곡률 을 가진 형상으로 구부러질 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 지지 구조물은 연결 부재의 제1 영역(310-1)에 고정되어 제1 영역(310-1)을 지지할 수 있다. 이에 따라, 연결 부재의 제1 영역(310-1)은 전자 장치가 인입되 는 과정에서 과도하게 구부러지지 않을 수 있으며, 지지 부재의 형상과 대응되는 일정 곡률을 가진 형상으로 구 부러질 수 있다. 또한, 지지 구조물은 탄성 소재로 형성될 수 있다. 이에 따라 지지 구조물은 연결 부재에 가해지는 외력으로부터 연결 부재를 보호할 수 있다. 따라서, 연결 부재는 전자 장치 가 인입 또는 인출되는 과정에서 주변 기구물과 접촉에 의해 손상되는 현상이 완화 또는 해소될 수 있다. 다양한 실시예에 따르면, 전자 장치 내부에는 지지 구조물의 움직임을 안내하는 가이드 홈이 형 성될 수 있다. 가이드 홈은 전자 장치의 인입 또는 인출 과정에서 연결 부재가 구부러지거나 펼 쳐지는 동작에 기반하여 설정된 연결 부재의 이동 경로일 수 있다. 지지 구조물은 연결 부재의 제1 영역(310-1)에 고정되어 전자 장치의 인입 또는 인출에 대응하여 가이드 홈을 따라 이동할 수 있다. 연결 부재는 전자 장치의 인입 또는 인출에 대응하여 구부러지거나 펼쳐지는 동작이 지지 구조물 과 가이드 홈을 통해 가이드될 수 있다. 일 실시예에서, 도 6c를 참조하면, 가이드 홈은 제2 하우징에 형성될 수 있다. 일 실시예에서, 가이 드 홈은 제2 하우징에 배치되는 지지 브라켓(예: 도 4의 지지 브라켓)에 형성될 수 있다. 지지 브러켓은 제1 하우징에 배치되는 제1 지지 부재와 슬라이딩 가능하게 결합된 기구물일 수 있다. 연결 부재와 지지 구조물은 지지 브라켓에 배치되며, 가이드 홈을 통해 움직임이 가이드될 수 있다. 다른 실시예에서, 가이드 홈은 제1 하우징에 형성될 수 있다. 일 실시예에서, 가이드 홈 은 제1 하우징에 배치되는 제1 지지 부재에 형성될 수 있다. 이하 설명에서는 설명의 편의상 가이드 홈은 제2 하우징(예: 지지 브라켓)에 형성됨을 전제로 설명하도록 한다. 마찬가지로 가이드 홈을 따라 이동하는 지지 구조물과 연결 부재는 제2 하우 징에 배치되는 것을 전제로 설명하도록 한다. 다만, 상술한 설명에서 가이드 홈이 지지 브라켓 에 형성되는 것으로 한정하는 것은 아니다. 가이드 홈은 연결 부재와 지지 구조물이 위치하는 다양한 기구물(예: 제1 지지 부재)에 형성될 수 있다. 또한, 지지 구조물과 연결 부재는 제1 하 우징에 배치되어 가이드 홈을 따라 이동할 수 있다. 일 실시예에서, 가이드 홈은 직선 및/또는 곡선으로 형성될 수 있다. 예를 들어, 가이드 홈은 지지 브라켓에 원호 형상(arc shape)으로 형성될 수 있다. 도 7a는 안테나 부재가 배치된 지지 구조물과 연결 부재의 단면도이다. 도 7b는 지지 구조물에 배치된 안테나 부재의 다양한 실시예에 대한 도면이다. 도 8a는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인출된 상태에서 지지 구조물에 배치된 안테나 부재의 성능을 나타낸 도면이다. 도 8b는 본 문서에 개시된 다양한 실시 예에 따른 전자 장치가 인입된 상태에서 지지 구조물에 배치된 안테나 부재의 성능을 나타낸 도면이다. 다양한 실시예에 따르면, 도 7a 및 도 7b에 도시된 것과 같이, 연결 부재에는 안테나 부재(예: 도 1 의 안테나 모듈)가 배치될 수 있다. 안테나 부재는 도전성 소재로 형성되어 외부 전자 장치와 통신을 수행할 수 있다. 일 실시예에서, 안테나 부재는 NFC(near field communication) 안테나, 무선 충전 안테 나, MST(magnetic secure transmission), 및/또는 고주파수(예: wifi, lte, 또는 mmwave) 안테나를 포함할 수 있다. 안테나 부재는, 예를 들어, 외부 전자 장치와 근거리 통신 또는 원거리 통신을 하거나, 충전에 필요 한 전력을 무선으로 송수신할 수 있다. 이 밖에도 안테나 부재는 다양한 대역폭에서 외부 전자 장치와 무 선으로 통신을 송신 또는 수신할 수 있다. 다양한 실시예에 따르면, 안테나 부재는 제1 인쇄 회로 기판(예: 도4의 제1 기판)에 배치된 통 신 모듈과 전기적으로 연결되어 통신 신호(예: RF 신호)를 외부 전자 장치로 전송하거나 송신 받을 수 있 다. 일 실시예에서, 안테나 부재는 연결 부재를 통해 통신 모듈과 전기적으로 연결될 수 있다. 상술한 바와 같이, 연결 부재는 RF(radio frequency) 신호를 전달하는 구성 요소일 수 있다. 연결 부재 는 전자 장치의 통신 모듈에서 처리된 RF 신호를 안테나 부재에 전달하거나, 안테나 부재 에서 수신된 RF 신호를 통신 모듈에 전달할 수 있다. 다양한 실시예에 따르면, 연결 부재는 복수의 회로부를 포함할 수 있다. 예를 들어, 연결 부재는 임 피던스 매칭을 위한 매칭 회로와 안테나가 광대역 특성에 대응하도록하는 스위칭 회로와 같은 다양한 안테나 관 련 회로를 포함할 수 있다. 일 실시예에서, 매칭 회로는 인덕터(inductor), 또는 캐패시터(capacitor)와 같은 소자를 포함하여 임피던스를 매칭하는 회로일 수 있다. 일 실시예에서, 스위칭 회로는 서로 전기적으로 오픈 (open)된 안테나 방사체를 단락(short)시켜 안테나 방사체(예: 안테나 부재)의 물리적인 길이를 증가시킬 수 있다. 이상 설명한 회로부의 매칭 회로 및 스위칭 회로는 그 명칭으로 한정 해석되지 않고, 해당 기능을 수 행할 수 있는 소자를 포함하는 회로로 이해되어야한다. 예를 들어, 스위칭 회로는 스위칭 회로부로 호칭될 수 있고, 매칭 회로는 가변 소자부로 호칭될 수 있다. 일 실시예에서, 안테나 관련 회로 중 매칭 회로 또는 스위칭 회로 중 일부는 생략될 수 있다. 다양한 실시예에 따르면, 안테나 부재는 연결 부재와 일체로 형성될 수 있다. 예를 들어, 안테나 부 재는 연결 부재에 포함된 서브스트레이트(330-3)(예: PCB) 위에 형성된 도전체(330-1) 또는 도전체 (330-1)와 절연체(330-2)로 이루어진 도전성 패턴을 포함하는 방사체일 수 있다. 일 실시예에서, 안테나 부재 는 연결 부재를 식각하여 도전체(330-1)와 절연체(330-2)로 이루어진 도전성 패턴을 포함하는 방사체일 수 있다. 예를 들어, 안테나 부재는 다층 구조(multi layer)로 형성될 수 있고, 비아(via)를 포함할 수 있다. 이 밖에도 안테나 부재는 다양한 방식으로 연결 부재와 일체로 형성될 수 있으며, 다른 실시예 에서, 안테나 부재는 별도의 모듈로 형성되 연결 부재와 연결될 수 있다. 다양한 실시예에 따르면, 도 6a 내지 도 7b에 도시된 것과 같이, 안테나 부재는 연결 부재의 제1 영역(310-1)에 고정된 지지 구조물의 적어도 일부를 감싸도록 배치될 수 있다. 일 실시예에서, 도 7a를 참조하면, 안테나 부재는 지지 구조물을 감싸도록 배치될 수 있다. 도 7a를 참조하면, 안테나 부재의 신호가 시작되는 급전부 는 연결 부재에서 안테나 부재가 지지 구조물을 따라 밴딩되는 지점에 형성될 수 있다. 일 실시예에서, 도 7b를 참조하면, 안테나 부재는 다양한 도전성 패턴으로 형성되어 원하는 대역의 통신을 수행할 수 있다. 일 실시예에서, 안테난 부재는 도전체(330-1)의 길이, 그라운드의 지점을 변화시켜 다양 한 형태의 안테나를 구현할 수 있다. 예를 들어, 안테나 부재는 도전체(330-1)와 절연체(330-2)로 이루어 진 도전성 패턴에 따라 슬릿 안테나(slit antenna)(예: 도 7b의 (a)), Dual - IFA(dual inverted f antenna) (예: 도 7b의 (b)), IFA(inverted f antenna)(예: 도 7b의 (c)), 모노 안테나(mono antenna)(예: 도 7b의 (d)), 루프 안테나(loop antenna)(예: 도 7b의 (e))와 같은 안테나를 구현할 수 있다. 안테나 부재는 상 술한 도 7b에 도시된 도전성 패턴 이외의 다양한 도전성 패턴을 통해 다양한 종류의 안테나를 구현할 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 도 7a 및 도 7b에 도시된 것과 같이 연결 부재에는 안테나 부 재가 배치될 수 있다. 안테나 부재는 연결 부재에 고정된 지지 구조물에 배치될 수 있다. 이러한 경우, 전자 장치 내부에 안테나 부재를 배치하기 위한 별도의 공간을 형성하지 않을 수 있다. 따라서, 안테나 부재는 전자 장치 내부에 별도의 배치 공간 없이 전자 장치 내부에 위치한 기구 물(예: 지지 구조물)에 배치되어 외부 전자 장치 통신을 수행할 수 있다. 일 실시예에서, 도 6b 및 도 7a를 참조하면, 연결 부재는 제1 연결 부재와 제2 연결 부재를 포 함할 수 있다. 제1 연결 부재와 제2 연결 부재는 제1 연결 부재와 제2 연결 부재 사이에 배치된 접착 부재를 통해 결합될 수 있다. 제1 연결 부재와 제2 연결 부재는 제1 인쇄 회로 기판 (예: 도 4의 제1 기판) 및 제2 인쇄 회로 기판(예: 도 4의 제2 기판)에 각각 연결된 전자 부품 간의 전기적 신호를 전달할 수 있다. 일 실시예에서, 제1 연결 부재와 제2 연결 부재에는 서로 다른 전기적 신호가 전달될 수 있다. 예를 들어, 제1 연결 부재에는 배터리(B)에서 발생된 전력에 대한 신 호가 전달될 수 있다. 제2 연결 부재에는 통신 모듈과 안테나 부재에서 발생된 신호가 전달될 수 있다. 일 실시예에서, 제2 연결 부재에는 지지 구조물과 안테나 부재가 배치될 수 있다. 지지 구조물 은 전자 장치의 인입 또는 인출에 따라 구부러지는 제2 연결 부재의 제1 영역(310-1)에 배치될 수 있다. 일 실시예에서, 도 6b를 참조하면, 안테나 부재는 제2 연결 부재에 포함된 서브스트레이트 (330-3)(예: PCB) 위에 형성된 도전체(330-1) 또는 도전체(330-1)와 절연체(330-2)로 이루어진 도전성 패턴을 포함하는 방사체일 수 있다. 안테나 부재는 제2 연결 부재와 일체로 형성되거나 별도 모듈로써 제2 연결 부재에 배치되어 지지 구조물을 둘러싸도록 배치될 수 있다. 다양한 실시예에 따르면, 지지 구조물은 비 도전성 소재로 형성될 수 있다. 일 실시예에서, 지지 구조물 은 상술한 바와 같이, 러버, 우레탄, 폼(POM)과 같은 탄성을 가지며, 비 도전성을 가지는 소재로 형성될 수 있다. 따라서, 지지 구조물에 배치된 안테나 부재는 지지 구조물이 비 도전성 소재로 형성됨 에 따라 지지 구조물에 의한 안테나 열화가 발생되지 않을 수 있다. 도 8a 및 도 8b를 참조하면, 안테나 부재가 지지 구조물에 배치된 상태에서 안테나 성능을 확인할 수 있다. 일 실시예에서, 도 8a를 참조하면, 안테나 부재는 전자 장치가 인출된 상태(slide-out state) 일 때, 2500Mhz~3000Mhz 대역에서 다른 대역대 보다 높은 안테나 성능이 확보됨을 확인할 수 있다. 예를 들어, 도 8a를 참조하면, 안테나 부재는 전자 장치가 인출된 상태일 때, 2660Mhz 대역에서 대략 -6.8db(decibel)를 가질 수 있다. 일 실시예에서, 안테나 부재는 전자 장치가 인입된 상태(slide- in)일 때 보다 인출된 상태에서 주변 전자 부품과 이격되어 안테나 열화가 상대적으로 덜 발생할 수 있다. 일 실시예에서, 도 8b를 참조하면, 전자 장치가 인입된 상태에서 2500Mhz~3500Mhz 대역에서 다른 대역대 보다 높은 안테나 성능이 확보됨을 확인할 수 있다. 예를 들어, 도 8b를 참조하면, 안테나 부재는 전자 장치 가 인입된 상태일 때, 2740Mhz 대역에서 대략 -4.1db를 가질 수 있다. 따라서, 도 8a 및 도 8b에 도시된 것과 같이, 안테나 부재는 지지 구조물에 배치된 상태에서도 특정 대역에서 안테나 성능이 확보될 수 있다.다양한 실시예에 따르면, 안테나 부재는 지지 구조물과 함께 전자 장치가 인입 또는 인출되는 과정에서 가이드 홈을 따라 이동할 수 있다. 일 실시예에서, 안테나 부재는 지지 구조물과 함께 가이드 홈을 따라 가이드 홈이 형성된 제2 하우징에 대해 이동할 수 있다. 일 실시예에서, 안테 나 부재는 전자 장치의 인입 또는 인출 상태에 기반하여 제2 하우징에 형성된 격벽부와 대 면할 수 있다. 예를 들어, 도 6b를 참조하면, 안테나 부재는 전자 장치가 인입된 상태에서 제2 하우 징의 격벽부와 대면할 수 있다. 일 실시예에서 제2 하우징은 일정 수준 이상의 강성 확보를 위 해 금속 소재로 형성될 수 있다. 예를 들어, 제2 하우징에서 가이드 홈이 형성되는 지지 브라켓 (예: 도 4의 지지 브라켓)은 금속 소재로 형성될 수 있다. 이러한 경우, 제2 하우징의 일부인 격벽부는 금속 소재로 형성됨에 따라 안테나 부재의 방사 성능을 열화시킬 수 있다. 본 문서에 개시 된 다양한 실시예에서, 격벽부는 안테나 부재와 대면하는 일 영역 중 적어도 일부가 비 도전성 소재 로 형성될 수 있다. 따라서, 안테나 부재는 전자 장치가 인입된 상태 또는 인출된 상태에서 격벽부 와 마주하더라도 안테나 방사 성능을 확보될 수 있다. 도 9a는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인출된 상태에서 리어 브라켓에 형성된 제1 개구 에 안테나 부재가 위치한 상태를 나타낸 도면이다. 도 9b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치 가 인입된 상태에서 리어 브라켓에 형성된 제2 개구에 안테나 부재가 위치한 상태를 나타낸 도면이다. 도 9c는 본 문서에 개시된 다양한 실시예에 따른 리어 브라켓에 가이드 홈과 대응되는 형상을 가진 개구가 형성된 상태 를 나타낸 도면이다. 다양한 실시예에 따르면, 전자 장치는 복수의 전자 부품들 중 적어도 일부를 커버하도록 제1 하우징 및 제2 하우징 중 적어도 하나에 배치될 수 있다. 일 실시에예서, 리어 브라켓(예: 도 4의 리어 브라 켓)은 제1 하우징에 배치된 제1 지지 부재(예: 도 4의 제1 지지 부재)의 적어도 일부와 구 조적으로 결합될 수 있다. 리어 브라켓은 복수의 전자 부품들을 커버하고 제1 후면 커버(예: 도 4의 제1 후면 커버)를 지지하도록 배치될 수 있다. 일 실시에에서, 리어 브라켓은 제2 하우징(예: 지지 브라켓)에 위치한 연결 부재, 지지 구조물 및 안테나 부재(예: 도 1의 안테나 모듈 )를 덮도록 제2 하우징에 배치될 수 있다. 일 실시예에서, 리어 브라켓은 일정 수준 이상의 강성 확보를 위해 금속 소재로 형성될 수 있다. 이러한 경우, 안테나 부재는 금속 소재로 형성된 리어 브라켓에 덮여짐에 따라 안테나 방사 성능이 열화될 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 도 9a 및 도 9b에 도시된 것과 같이, 리어 브라켓은 제1 개구와 제1 개구에 대해 이격되어 위치하는 제2 개구를 포함할 수 있다. 일 실시예에서, 도 9a를 참조하면, 제1 개구는 제1 하우징이 제2 하우징에 대해 제1 방향으로 이동된 전자 장치 의 인출 상태(slide-out0에서 지지 구조물에 배치된 안테나 부재의 위치와 대응되는 위치에 형 성될 수 있다. 또한, 도 9b를 참조하면, 제2 개구는 제1 하우징이 제2 하우징에 대해 제2 방향 으로 이동된 전자 장치의 인입 상태(slide-in)에서 지지 구조물에 배치된 안테나 부재의 위치와 대응되는 위치에 형성될 수 있다. 안테나 부재는 전자 장치의 인입 또는 인출 상태에 기반하여 리어 브라켓에 형성된 제1 개구 또는 제2 개구에 위치할 수 있다. 따라서, 리어 브라켓에 제1 개구 및 제2 개구가 형성됨에 따라 리어 브라켓을 통해 안테나 부재의 안테나 방사 성능이 열화되는 현상이 완화 또는 해소될 수 있다. 일 실시예에서, 도 9c를 참조하면, 리어 브라켓은 제2 하우징에 형성된 가이드 홈과 대응되는 형상으로 형성된 제3 개구를 포함할 수 있다. 제3 개구는 가이드 홈을 따라 이동하는 지지 구조 물과 안테나 부재의 이동 경로와 대응되는 방향으로 형성될 수 있다. 이러한 경우, 안테나 부재(33 0)는 전자 장치가 인입, 인출 상태 및 전자 장치가 슬라이딩 되는 중간 영역에서 리어 브라켓에 형성된 제3 개구와 마주할 수 있다. 따라서, 제3 개구가 형성됨에 따라 리어 브라켓을 통해 안 테나 부재의 안테나 방사 성능이 열화되는 현상이 완화 또는 해소될 수 있다. 도 10a는 다른 실시예에서 연결 부재에 안테나 부재가 배치된 상태를 나타내는 도면이다. 도 10b는 다른 실시예 에서 안테나 부재와 연결 부재의 단면도이다. 도 11a는 다른 실시예에서, 전자 장치가 인출된 상태에서 리어 브 라켓에 형성된 제1 개구에 안테나 부재가 위치한 상태를 나타낸 도면이다. 도 11b는 다른 실시예에서, 전자 장치가 인입된 상태에서 리어 브라켓에 형성된 제2 개구에 안테나 부재가 위치한 상태를 나타낸 도면이다. 이하에서는, 앞서 도 6a 내지 도 9c를 통해 설명한 안테나 부재(예: 도 1의 안테나 모듈)가 지지 구 조물이 아닌 연결 부재의 일 영역(예: 제2 영역(310-2))에 배치된 상태의 실시예이다. 또한, 이하에 서 설명되는 실시예에서 연결 부재에는 상술한 지지 구조물이 배치되지 않음을 전제로 설명하도록 한 다. 다만, 연결 부재에 지지 구조물이 배치되는 실시예를 제외한다는 의미는 아닐 수 있다. 일 실시 예에서, 연결 부재의 제1 영역(310-1)에는 지지 구조물이 배치될 수 있고, 제2 영역(310-2)에는 안테 나 부재가 배치될 수 있다. 이상에서 설명한 전자 장치와 유사한 구성 요소를 포함하므로, 중복되는 구성 요소에 대한 자세한 설명은 생략하고 필요한 경우가 아니라면 동일 또는 유사한 구성 요소에 대해서는 동일한 부재 번호를 사용하여 설명하 도록 한다. 다양한 실시에에 따르면, 도 10a 및 도 10b에 도시된 것과 같이, 안테나 부재는 연결 부재에 배치될 수 있다. 일 실시예에서, 도 10a에 도시된 (a) 및 (b) 도면을 참조하면, 연결 부재는 상술한 바와 같이, 제2 하우징의 제1 하우징에 대한 슬라이딩(또는 제1 하우징의 제2 하우징에 대한 슬라이딩)에 대응하여 구부러지는 제1 영역(310-1)(예: 밴딩 영역)과 제1 영역(310-1)을 제외한 제2 영역(310- 2)(예: 직선 영역)을 포함할 수 있다. 제2 영역(310-2)은 전자 장치의 인입 또는 인출에 따라 구부러지는 제1 영역(310-1)보다 상대적으로 구부러지지 않는 영역일 수 있다. 일 실시예에서, 안테나 부재는 연결 부 재에 배치되어 구부러지지 않도록 연결 부재의 제2 영역(310-2)에 배치될 수 있다. 일 실시예에서, 도 10a 내지 도 11b를 참조하면, 안테나 부재는 연결 부재와 일체로 형성될 수 있다. 예를 들어, 도 10a, 11a 및 도 11b를 참조하면, 안테나 부재는 연결 부재에 포함된 서브스트레이트 (330-3)(예: PCB) 위에 형성된 도전체(330-1) 또는 도전체(330-1)와 절연체(330-2)로 이루어진 도전성 패턴을 포함하는 방사체일 수 있다. 일 실시예에서, 안테나 부재는 연결 부재를 식각하여 도전체(330-1)와 절연체(330-2)로 이루어진 도전성 패턴을 포함하는 방사체일 수 있다. 이 밖에도 안테나 부재는 다양한 방 식으로 연결 부재와 일체로 형성될 수 있다. 일 실시에에서, 안테나 부재는 별도의 모듈로 형성되 연결 부재와 연결될 수 있다. 연결 부재는 제2 영역(310-2)에 안테나 부재가 배치될 수 있도록 형성된 홈(미도시)을 포함할 수 있다. 안테나 부재 는 연결 부재에 형성된 홈에 안착되어 연결 부재와 전기적으로 연결될 수 있다. 다양한 실시예에 따르면, 도 10b에 도시된 것과 같이, 연결 부재는 제1 연결 부재와 제2 연결 부재 를 포함할 수 있다. 상술한 바와 같이, 제1 연결 부재와 제2 연결 부재는 접착 부재를 통해 결 합될 수 있다. 일 실시예에서, 제2 연결 부재에는 안테나 부재가 배치될 수 있다. 안테나 부재 는 전자 장치의 인입 또는 인출에 따라 구부러지는 제1 영역(310-1)보다 변형되지 않는 제2 영역(310-2)에 배치될 수 있다. 일 실시예에서, 도 10b를 참조하면, 안테나 부재는 제2 연결 부재에 포함된 서브스 트레이트(330-3)(예: PCB) 위에 형성된 도전체(330-1) 또는 도전체(330-1)와 절연체(330-2)로 이루어진 도전성 패턴을 포함하는 방사체일 수 있다. 어떤 실시예에서, 안테나 부재는 별도의 모듈로 형성되어 제2 연결 부 재에 배치될 수 있다. 다양한 실시예에 따르면, 도 11a 및 도 11b에 도시된 것과 같이, 리어 브라켓(예: 도 4의 리어 브라켓 )은 제1 개구와 제1 개구에 대해 이격되어 위치하는 제2 개구를 포함할 수 있다. 일 실시 예에서, 도 11a를 참조하면, 제1 개구는 제1 하우징이 제2 하우징에 대해 제1 방향으로 이동된 전자 장치의 인출 상태(slide-out stae)에서 연결 부재의 제2 영역(310-2)에 배치된 안테나 부재 의 위치와 대응되는 위치에 형성될 수 있다. 또한, 도 11b를 참조하면, 제2 개구는 제1 하우징 이 제2 하우징에 대해 제2 방향으로 이동된 전자 장치의 인입 상태(slide-in state)에서 연결 부재 의 제2 영역(310-2)에 배치된 안테나 부재의 위치와 대응되는 위치에 형성될 수 있다. 안테나 부재 는 전자 장치의 인입 또는 인출 상태에 기반하여 리어 브라켓에 형성된 제1 개구 또는 제2 개구에 위치할 수 있다. 따라서, 제1 개구 및 제2 개구가 형성됨에 따라 리어 브라켓을 통 해 안테나 부재의 안테나 방사 성능이 열화되는 현상이 완화 또는 해소될 수 있다. 일 실시예에서, 도면에 도시되지 않았지만, 리어 브라켓은 제3 개구를 포함할 수 있다. 제3 개구 는 제1 하우징에 대한 제2 하우징의 슬라이딩에 대응하여 이동하는 연결 부재 및 안테나 부재의 이동 경로와 대응되는 리어 브라켓의 일 영역에 형성될 수 있다. 이러한 경우, 안테나 부재는 전자 장치가 인입, 인출 상태 및 전자 장치가 슬라이딩 되는 중간 영역에서 리어 브라켓 에 형성된 제3 개구와 마주할 수 있다. 따라서, 리어 브라켓에는 제3 개구가 형성됨에 따 라 리어 브라켓을 통해 안테나 부재의 안테나 방사 성능이 열화되는 현상이 완화 또는 해소될 수 있 다. 본 문서에 개시된 다양한 실시예에 따르면, 도 10a 내지 도 11b에 도시된 것과 같이, 안테나 부재는 연결 부재의 제2 영역(310-2)(예: 직선 영역)에 배치될 수 있다. 이러한 경우, 안테나 부재는 제1 영역 (310-1)(예: 밴딩 영역)보다 상대적으로 구부러지 않는 제2 영역(310-2)에 배치됨에 따라 전자 장치의 인 입 또는 인출 과정에서 연결 부재에 밴딩 스트레스(bending stress)를 가하지 않을 수 있다. 또한, 안테나 부재는 전자 장치가 인입 또는 인출되는 과정에서 연결 부재의 제1 영역(310-1)에 배치된 경우 보다 구부러지지 않아 밴딩 스트레스에 의한 손상이 발생되지 않을 수 있다. 한편, 전자 장치 내부에 안테나 부재를 배치하기 위한 별도의 공간을 형성하지 않을 수 있다. 따라서, 안테나 부재는 전자 장치 내부에 별도의 배치 공간 없이 전자 장치 내부에 위치한 연결 부재의 제2 영역(310-2)에 배치되어 외부 전자 장치 통신을 수행할 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 전자 장치(예: 도 1의 전자 장치)는, 제1 하우징, 상기 제1 하우징에 대하여 슬라이딩 가능하게 결합되는 제2 하우징, 통신 모듈(예: 도 1의 통신 모듈 )이 배치되고, 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판(예: 도 4의 제1 기판), 상기 제 2 하우징에 배치되는 제2 인쇄 회로 기판(예: 도 4의 제2 기판), 유연한 소재로 형성되어 상기 제1 인쇄 회로 기판과 상기 제2 인쇄 회로 기판을 전기적으로 연결하는 연결 부재, 상기 연결 부재에 고정되고, 비 도전성 소재로 형성된 지지 구조물 및 상기 지지 구조물의 적어도 일부를 감싸며 도전성 소 재로 형성되어 상기 연결 부재와 전기적으로 연결되고 RF 신호를 송신 또는 수신하는 안테나 부재(예: 도 1의 안테나 모듈)를 포함할 수 있다. 또한, 상기 연결 부재는, 상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩에 대응하여 구부러지는 제1 영역 (310-1)을 포함하고, 상기 지지 구조물은, 상기 연결 부재의 제1 영역에 고정될 수 있다. 또한, 상기 제2 하우징은, 상기 지지 구조물의 움직임을 안내하는 가이드 홈을 포함하고, 상기 지지 구조 물은, 상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩에 대응하여 상기 가이드 홈을 따라 이동할 수 있다. 또한, 상기 제2 하우징은, 상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩 상태에 기반하여 상기 안테나 부재를 감싸는 격벽부를 포함하고, 상기 격벽부는, 적어도 일부가 비 도전성 소재로 형성될 수 있다. 또한, 상기 지지 구조물은, 단면이 원 형태일 수 있다. 또한, 상기 연결 부재를 덮도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되고, 제1 개구 와 상기 제1 개구에 대해 이격되어 위치하는 제2 개구를 포함하는 리어 브라켓(예: 도 4의 리어 브라켓)을 더 포함하고, 상기 제1 개구는, 상기 제1 하우징이 상기 제2 하우징에 대해 제1 방향(예: 도 3b 를 기준으로 제1 방향))으로 이동된 제1 상태(예: 전자 장치의 인출 상태(slide-out state))에서 상기 안 테나 부재의 위치와 대응되는 위치에 형성되고, 상기 제2 개구는, 상기 제1 하우징이 상기 제2 하우징에 대해 제1 방향의 반대 방향인 제2 방향(예: 도 2a를 기준으로 제2 방향))으로 이동된 제2 상태(예: 전자 장치의 인입 상태(slide-in state))에서 상기 안테나 부재의 위치와 대응되는 위치에 형성될 수 있다. 또한, 상기 연결 부재를 덮도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되는 리어 브라켓 을 더 포함하고, 상기 리어 브라켓은, 상기 제2 하우징의 가이드 홈과 대응되도록 형성된 개구(예: 도 9c 의 제3 개구)를 포함할 수 있다. 또한, 상기 연결 부재는, 제1 연결 부재, 상기 지지 구조물 및 상기 안테나 부재가 배치되는 제2 연결 부 재를 포함할 수 있다. 또한, 상기 제1 연결 부재와 상기 제2 연결 부재는, 서로 다른 전기적 신호가 통과할 수 있다. 또한, 상기 안테나 부재는, 상기 연결 부재와 일체로 형성될 수 있다. 또한, 상기 지지 구조물은, 탄성 소재로 형성될 수 있다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치(예: 도 1의 전자 장치)는, 제1 하우징, 상기 제1 하우징에 대하여 슬라이딩 가능하게 결합되는 제2 하우징, 통신 모듈(예: 도 1의 통신 모듈)이 배치되고, 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판(예: 도 4의 제1 기판), 상기 제2 하우징 에 배치되는 제2 인쇄 회로 기판(예: 도 4의 제2 기판), 유연한 소재로 형성되어 상기 제1 인쇄 회로 기판과 상기 제2 인쇄 회로 기판을 전기적으로 연결하는 연결 부재 및 도전성 소재로 형성되어 상기 연결 부재에 전기적으로 연결되고, RF 신호를 송신 또는 수신하는 안테나 부재(예: 도 1의 안테나 모듈)를 포함할 수 있다. 또한, 상기 연결 부재는, 상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩에 대응하여 구부러지는 제1 영역 (310-1)과 상기 제1 영역을 제외한 제2 영역(310-2)을 포함하고, 상기 안테나 부재는, 상기 제2 영역에 배치될 수 있다. 또한, 상기 제2 하우징은, 상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩 상태에 기반하여 상기 안테나 부재를 감싸는 격벽부를 포함하고, 상기 격벽부는, 적어도 일부가 비 도전성 소재로 형성될 수 있다. 또한, 상기 연결 부재는, 제1 연결 부재, 상기 안테나 부재가 배치되는 제2 연결 부재를 포함할 수 있다. 또한, 상기 제1 연결 부재와 상기 제2 연결 부재는, 서로 다른 전기적 신호가 통과할 수 있다. 또한, 상기 연결 부재를 덮도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되고, 제1 개구 와 상기 제1 개구에 대해 이격되어 위치하는 제2 개구를 포함하는 리어 브라켓(예: 도 4의 리어 브라켓)을 더 포함하고, 상기 제1 개구는, 상기 제1 하우징이 상기 제2 하우징에 대해 제1 방향(예: 도 3b 를 기준으로 제1 방향)으로 이동된 제1 상태(예: 전자 장치의 인출 상태(slide-out state))에서 상기 안테 나 부재의 위치와 대응되는 위치에 형성되고, 상기 제2 개구는, 상기 제1 하우징이 상기 제2 하우징에 대해 제1 방향의 반대 방향인 제2 방향(예: 도 2a를 기준으로 제2 방향)으로 이동된 제2 상태(예: 전자 장치의 인입 상태(slide-in state))에서 상기 안테나 부재의 위치와 대응되는 위치에 형성될 수 있다. 또한, 상기 연결 부재를 덮도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되는 리어 브라켓 을 더 포함하고, 상기 리어 브라켓은, 상기 제1 하우징에 대한 상기 제2 하우징의 슬라이딩에 대응하여 상 기 안테나 부재가 이동하는 경로와 대응되는 영역에 형성된 개구(예: 도 9c의 제3 개구)를 포함할 수 있다. 또한, 상기 안테나 부재는, 상기 연결 부재와 일체로 형성될 수 있다. 또한, 상기 연결 부재는, 상기 제2 영역에 형성된 홈(미도시)을 포함하고, 상기 안테나 부재는, 상기 제2 영역 에 형성된 홈에 배치될 수 있다. 그리고 본 명세서와 도면에 개시된 본 문서에 개시된 실시예들은 본 문서에 개시된 실시예에 따른 기술 내용을 쉽게 설명하고 본 문서에 개시된 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 문서에 개시된 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 문서에 개시된 다양한 실시예의 범위는 여기에 개시 된 실시예들 이외에도 본 문서에 개시된 다양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변 형된 형태가 본 문서에 개시된 다양한 실시예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0049387", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다. 도 1은, 다양한 실시예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a 및 도 2b는 본 문서에 개시된 다양한 실시예에 따른 인입 상태(slide-in state)에서 전자 장치의 전면 및 후면을 도시한 도면이다. 도 3a 및 도 3b는 본 문서에 개시된 다양한 실시예에 따른 인출 상태(slide-out state)에서 전자 장치의 전면 및 후면을 도시한 도면이다. 도 4는 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 5a는 본 문서에 개시된 다양한 실시예에 따른 도 2a의 라인 5a-5a를 따라 바라본 전자 장치의 단면도이다. 도 5b는 본 문서에 개시된 다양한 실시예에 따른 도 3a의 라인 5b-5b를 따라 바라본 전자 장치의 단면도이다. 도 6a는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인출된 상태(slide-out state)에서 연결 부재와 지지 구조물을 나타낸 도면이다. 도 6b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인입된 상태(slide-in state)에서 연결 부재와 지 지 구조물을 나타낸 도면이다. 도 6c는 본 문서에 개시된 다양한 실시예에 따른 지지 구조물과 지지 구조물의 움직임을 안내하는 가이드 홈을 나타낸 도면이다. 도 7a는 안테나 부재가 배치된 지지 구조물과 연결 부재의 단면도이다. 도 7b는 지지 구조물에 배치된 안테나 부재의 다양한 실시예에 대한 도면이다. 도 8a는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인출된 상태에서 지지 구조물에 배치된 안테나 부 재의 성능을 나타낸 도면이다. 도 8b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인입된 상태에서 지지 구조물에 배치된 안테나 부 재의 성능을 나타낸 도면이다. 도 9a는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인출된 상태에서 리어 브라켓에 형성된 제1 개구 에 안테나 부재가 위치한 상태를 나타낸 도면이다. 도 9b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 인입된 상태에서 리어 브라켓에 형성된 제2 개구 에 안테나 부재가 위치한 상태를 나타낸 도면이다. 도 9c는 본 문서에 개시된 다양한 실시예에 따른 리어 브라켓에 가이드 홈과 대응되는 형상을 가진 개구가 형성 된 상태를 나타낸 도면이다. 도 10a는 다른 실시예에서 연결 부재에 안테나 부재가 배치된 상태를 나타내는 도면이다. 도 10b는 다른 실시예에서 안테나 부재와 연결 부재의 단면도이다. 도 11a는 다른 실시예에서, 전자 장치가 인출된 상태에서 리어 브라켓에 형성된 제1 개구에 안테나 부재가 위치 한 상태를 나타낸 도면이다. 도 11b는 다른 실시예에서, 전자 장치가 인입된 상태에서 리어 브라켓에 형성된 제2 개구에 안테나 부재가 위치 한 상태를 나타낸 도면이다."}
