{"patent_id": "10-2023-0079606", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0062907", "출원번호": "10-2023-0079606", "발명의 명칭": "인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법, 장치 및 컴퓨터프로그램", "출원인": "주식회사 아이메디신", "발명자": "강승완"}}
{"patent_id": "10-2023-0079606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 장치에 의해 수행되는 방법에 있어서,환자의 생체 데이터를 획득하는 단계;질병 진단 모델을 통해 상기 획득된 생체 데이터를 분석함에 따라 서로 다른 복수의 질병 각각을 보유할 가능성인 복수의 확률 값을 산출하는 단계; 및상기 복수의 질병 간의 연관관계에 기초하여 상기 산출된 복수의 확률 값을 분석함에 따라 상기 환자에 대한 다중 질병 진단을 수행하는 단계를 포함하는,인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법."}
{"patent_id": "10-2023-0079606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 환자에 대한 다중 질병 진단을 수행하는 단계는,상기 복수의 질병 간의 연관관계에 기초하여, 상기 산출된 복수의 확률 값 중 상호 연관관계를 가지는 질병들에대응되는 확률 값들을 분류 및 그룹화함에 따라 복수의 그룹을 생성하는 단계; 및상기 생성된 복수의 그룹 각각에 포함된 확률 값들과 기준 확률 값을 비교하여 상기 환자에 대한 다중 질병 진단을 수행하는 단계를 포함하는,인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법."}
{"patent_id": "10-2023-0079606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 생성된 복수의 그룹 각각에 포함된 확률 값들과 기준 확률 값을 비교하여 상기 환자에 대한 다중 질병 진단을 수행하는 단계는,상기 생성된 복수의 그룹 중 어느 하나의 그룹에 포함된, 제1 질병을 보유할 가능성인 제1 확률 값과 제2 질병을 보유할 가능성인 제2 확률 값에 대하여, 상기 제1 확률 값과 상기 제2 확률 값이 상기 기준 확률 값 이상인경우, 상기 환자가 상기 제1 질병과 상기 제2 질병을 보유한 것으로 판단하되, 상기 제1 확률 값과 상기 제2 확률 값 간의 대소 비교 결과 및 차이에 기초하여 상기 제1 질병과 상기 제2 질병 간의 우세성을 판단하고, 상기판단된 우세성에 기초하여 상기 환자에 대한 다중 질병 진단을 수행하는 단계를 포함하는,인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법."}
{"patent_id": "10-2023-0079606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 판단된 우세성에 기초하여 상기 환자에 대한 다중 질병 진단을 수행하는 단계는,상기 제1 확률 값이 상기 제2 확률 값보다 크고, 상기 제1 확률 값과 상기 제2 확률 값의 차이가 기 설정된 차이 값 이상인 경우, 상기 환자가 상기 제2 질병의 증상이 동반된 상기 제1 질병을 보유한 것으로 판단하는단계;상기 제1 확률 값과 상기 제2 확률 값의 차이의 크기가 상기 기 설정된 차이 값 미만인 경우, 상기 환자가 상기제1 질병과 상기 제2 질병을 모두 보유한 것으로 판단하는 단계; 및상기 제2 확률 값이 상기 제1 확률 값보다 크고, 상기 제2 확률 값과 상기 제1 확률 값의 차이가 기 설정된 차공개특허 10-2024-0062907-3-이 값 이상인 경우, 상기 환자를 상기 제1 질병의 증상이 동반된 상기 제2 질병을 보유한 환자인 것으로 판단하는 단계를 포함하는,인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법."}
{"patent_id": "10-2023-0079606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,서로 다른 종류의 질병을 보유한 복수의 환자 각각으로부터 복수의 생체 데이터를 획득하는 단계;환자의 속성 - 상기 환자의 속성은 상기 환자의 연령 및 성별을 포함함 - 에 기초하여 상기 획득된 복수의 생체데이터를 1차 분류하고, 질병의 종류에 따라 상기 1차 분류된 복수의 생체 데이터를 2차 분류하는 단계;상기 2차 분류된 복수의 생체 데이터를 학습 데이터로 하여 서로 다른 진단 모델을 학습시킴에 따라, 상기 질병진단 모델로서, 상기 서로 다른 복수의 질병 각각에 대한 진단을 독립적으로 수행하는 복수의 진단 모델을 생성하는 단계를 더 포함하는,인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법."}
{"patent_id": "10-2023-0079606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "프로세서;네트워크 인터페이스;메모리; 및상기 메모리에 로드(load) 되고, 상기 프로세서에 의해 실행되는 컴퓨터 프로그램을 포함하되,상기 컴퓨터 프로그램은,환자의 생체 데이터를 획득하는 인스트럭션(instruction);질병 진단 모델을 통해 상기 획득된 생체 데이터를 분석함에 따라 서로 다른 복수의 질병 각각을 보유할 가능성인 복수의 확률 값을 산출하는 인스트럭션; 및상기 복수의 질병 간의 연관관계에 기초하여 상기 산출된 복수의 확률 값을 분석함에 따라 상기 환자에 대한 다중 질병 진단을 수행하는 인스트럭션을 포함하는,인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법을 수행하는 컴퓨팅 장치."}
{"patent_id": "10-2023-0079606", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "컴퓨팅 장치와 결합되어,환자의 생체 데이터를 획득하는 단계;질병 진단 모델을 통해 상기 획득된 생체 데이터를 분석함에 따라 서로 다른 복수의 질병 각각을 보유할 가능성인 복수의 확률 값을 산출하는 단계;상기 복수의 질병 간의 연관관계에 기초하여 상기 산출된 복수의 확률 값을 분석함에 따라 상기 환자에 대한 다중 질병 진단을 수행하는 단계를 포함하는 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법을 실행시키기 위하여 컴퓨팅 장치로 판독 가능한 기록매체에 저장된, 컴퓨터프로그램."}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법, 장치 및 컴퓨터프로그램이 제공된다. 본 발명의 다 양한 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법은 컴퓨팅 장치에 의해 수행되는 방법에 있어서, 환자의 생체 데이터를 획득하는 단계 및 질병 진단 모델을 통해 상기 획득된 생체 데이터를 분석 함에 따라 상기 환자에 대한 다중 질병 진단을 수행하는 단계를 포함하되, 상기 질병 진단 모델은, 상기 획득된 생체 데이터를 기반으로 서로 다른 복수의 질병 각각에 대한 진단을 독립적으로 수행하는 복수의 진단 모델을 포 함한다."}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법, 장치 및 컴퓨터프로그 램에 관한 것이다."}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "치매(dementia)란, 뇌 질환으로 초래된 일련의 증세를 의미한다. 치매는 인식 능력의 저하로 일상적인 활동 능력 결여 상태가 되는 것으로, 치매가 진행되면, 사고력, 행동 및 일상 생활 수행에 영향을 미치게 된다. 의사들은 두 개 이상의 인식 기능(예: 기억력, 언어 기능, 정보 이해, 공간 기능, 판단력 및 주의력을 포함)이 현저하게 손상될 경우 치매로 진단한다. 치매 환자는 문제를 해결하고 감정을 통제하는데 어려움이 있을 수 있으며, 인격 변화를 겪을 수도 있다. 치매 환자가 겪는 정확한 증세는 치매를 일으킨 질환에 의해 손상된 뇌가 어떤 부위인가에 달려 있다. 치매의 여러 유형에서는 뇌의 신경 세포 일부가 기능을 멈추고 다른 세포들과의 연결이 사라져 죽게 된다. 치매는 대개 꾸준 히 진행된다. 즉, 치매는 점차적으로 뇌로 퍼지며 환자의 증세는 시간이 지나면서 악화된다. 우리나라의 경우, 65세 이상 노인 인구 중 약 9.5%인 29만명 정도가 노인성 치매로 고생하고 있으며, 이 중 73% 인 18만명은 습관적으로 거리를 배회하는 등 중증 환자이다. 이는 앞으로 인구의 노령화가 가속화됨에 따라 지 속적으로 증가할 것으로 예상된다. 알츠하이머 치매(Alzheimer disease dementia, ADD)는 가장 흔한 치매의 형태로 치매 환자 중 약 70% 이상이 알츠하이머 치매에 해당한다. 한편, 알츠하이머 치매 환자의 뇌를 사후에 병리적으로 해부해본 결과, 루이소체 (Lewybody)라는 세포를 가지는 환자가 발견되었으며, 이중 약 20%는 별도로 루이소체 치매(Lewybody dementia, LBD)라 명하기도 한다. 루이소체 치매가 동반된 알츠하이머 치매 환자의 경우, 루이소체 치매가 동반되지 않은 알츠하이머 치매 환자 대비 질병의 진행이 더 빠르고 인지 기능이 더 많이 떨어진다는 특성이 있다. 또한, 치매의 원인 단백질로 알려진 Amyloid-베타를 제거하는 기전을 가지는 아두카누맙(Aducanumab)이나 아두 카누맙의 부작용을 줄인 레카네맙(Lecanemab) 등이 알츠하이머 치매를 치료하기 위한 대표적인 치매 치료제로 사용되는데, 루이소체 치매가 동반된 알츠하이머 치매 환자의 경우, Amyloid-베타의 제거에도 인지 기능의 개선 이 없다는 특성이 있다. 즉, 치매 환자라 하더라도 순수 알츠하이머 치매를 보유한 환자인지 루이소체 치매의 증상을 동반한 환자인지에 따라 치매 치료제 및 치료 방법이 상이한 바, 치매 환자에 대한 정확한 치료 및 약 처방을 위해서는 치매 환자 가 단순히 알츠하이머 치매를 보유하고 있는지 또는 루이소체 치매가 동반된 알츠하이머 치매를 보유하고 있는 지를 정확하게 판단할 필요성이 있으나, 종래의 치매 환자 진단 방법은 치매 환자를 정확하게 분류하지 못한다 는 문제가 있다. 또한, 치매 치료제 개발 등 제약 개발 과정에서 루이소체 치매가 동반되지 않은 순수 알츠하이머 환자군만을 임 상 대상로 선정하고, 이에 따라 개발된 치매 치료에의 처방 또한 루이소체 치매가 동반되지 않은 순수 알츠하이 머 환자를 대상으로 내리기 위하여, 치매 환자가 보유한 치매의 종류를 정확하게 분류할 필요성이 있다."}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 상술된 종래의 치매 환자 진단 방식의 문제점을 해소하기 위한 목적으로, 환 자의 생체 데이터를 분석하여 환자의 알츠하이머 치매 보유 여부를 판단하되, 알츠하이머 치매를 보유하는지 여 부 뿐만 아니라 루이소체 치매의 동반 여부도 함께 판단함으로써, 치매 환자가 보유한 치매의 종류를 보다 정확 하게 분류할 수 있는 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법, 장치 및 컴퓨터프로그램을 제공하는 것이다. 본 발명이 해결하고자 하는 과제는 서로 다른 복수의 진단 모델을 통해 환자의 생체 데이터를 분석함으로써, 환 자의 치매 보유 여부 뿐만 아니라, 루이소체 치매, 파킨슨병(Parkinson), 혈관성 치매(Vascular dementia), 우 울증 및 불안 등 서로 다른 종류의 뇌 질환을 독립적으로 동시에 수행할 수 있는 인공지능 기반 생체 데이터 분 석을 통한 다중 질병 진단방법, 장치 및 컴퓨터프로그램을 제공하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법은 컴퓨팅 장치에 의해 수행되는 방법에 있어서, 환자의 생체 데이터를 획득하는 단계 및 질병 진단 모 델을 통해 상기 획득된 생체 데이터를 분석함에 따라 상기 환자에 대한 다중 질병 진단을 수행하는 단계를 포함 하되, 상기 질병 진단 모델은, 상기 획득된 생체 데이터를 기반으로 서로 다른 복수의 질병 각각에 대한 진단을 독립적으로 수행하는 복수의 진단 모델을 포함하는 것일 수 있다. 다양한 실시예에서, 서로 다른 종류의 뇌 질환을 보유한 복수의 환자의 생체 데이터로서, 상기 복수의 환자 각 각에 대한 복수의 뇌파 데이터를 획득하는 단계, 뇌 질환의 종류에 기초하여 상기 획득된 복수의 뇌파 데이터를 분류하는 단계 및 상기 분류된 복수의 뇌파 데이터를 학습 데이터로 하여 서로 다른 진단 모델을 학습시킴으로 써, 서로 다른 종류의 뇌질환의 보유 여부를 개별적으로 진단하는 복수의 진단 모델을 생성하는 단계를 더 포함 할 수 있다. 다양한 실시예에서, 상기 복수의 뇌파 데이터를 획득하는 단계는, 특정 뇌 질환을 보유한 환자가 타겟 약물을 복용하기 이전의 시점인 제1 시점에 상기 특정 뇌질환을 보유한 환자에 대한 제1 뇌파 데이터를 획득하는 단계 및 상기 특정 뇌질환을 보유한 환자가 상기 타겟 약물을 복용한 이후의 시점인 제2 시점에 상기 특정 뇌질환을 보유한 환자에 대한 제2 뇌파 데이터를 획득하는 단계를 포함하며, 상기 복수의 진단 모델을 생성하는 단계는, 상기 획득된 제1 뇌파 데이터와 상기 획득된 제2 뇌파 데이터를 비교하여 유효성 값을 산출하는 단계, 상기 산 출된 유효성 값이 기 설정된 유효 수치 이상인 경우, 상기 획득된 제1 뇌파 데이터를 유효 제1 뇌파 데이터로 분류하는 단계 및 상기 분류된 유효 제1 뇌파 데이터를 학습데이터로 하여, 상기 생성된 복수의 진단 모델 중 상기 특정 뇌질환의 보유 여부를 진단하는 진단 모델을 학습시키는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 복수의 진단 모델은, 제1 질병의 보유 여부를 진단하는 제1 진단 모델 및 상기 제1 질 병과 연관관계를 가지는 제2 질병의 보유 여부를 진단하는 제2 진단 모델을 포함하며, 상기 다중 질병 진단을 수행하는 단계는, 사용자로부터 상기 환자에 대한 제1 질병 진단 요청을 획득하는 경우, 상기 제1 진단 모델을 통해 상기 획득된 생체 데이터를 분석함에 따라 상기 환자가 상기 제1 질병을 보유할 가능성인 제1 확률 값을 산출하되, 상기 산출된 제1 확률 값이 기준 확률 값 이상인 경우, 상기 제2 진단 모델을 통해 상기 획득된 생체 데이터를 분석함에 따라 상기 환자가 상기 제2 질병을 보유할 가능성인 제2 확률 값을 산출하는 단계 및 상기 산출된 제1 확률 값과 상기 산출된 제2 확률 값에 기초하여, 상기 환자에 대한 상기 제1 질병의 보유 여부와 상 기 제2 질병의 보유 여부를 다중 진단하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 다중 진단하는 단계는, 상기 산출된 제2 확률 값이 상기 기준 확률 값 미만인 경우, 상기 환자가 상기 제1 질병만을 보유한 것으로 판단하는 단계 및 상기 산출된 제2 확률 값이 상기 기준 확률 값 이상인 경우, 상기 환자가 상기 제1 질병과 상기 제2 질병을 보유한 것으로 판단하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 제1 질병과 상기 제2 질병을 보유한 것으로 판단하는 단계는, 상기 산출된 제1 확률 값과 상기 산출된 제2 확률 값의 대소 비교 결과 및 상기 산출된 제1 확률 값과 상기 산출된 제2 확률 값의 차 이에 기초하여 상기 제1 질병과 상기 제2 질병 간의 우세성(Dominant)을 판단하는 단계, 상기 판단된 우세성에 기초하여, 상기 산출된 제1 확률 값이 상기 산출된 제2 확률 값보다 크고, 상기 산출된 제1 확률 값과 상기 산 출된 제2 확률 값의 차이가 기 설정된 차이 값 이상인 경우, 상기 환자가 상기 제2 질병의 증상이 동반된 상기 제1 질병을 보유한 것으로 판단하는 단계, 상기 판단된 우세성에 기초하여, 상기 산출된 제1 확률 값과 상기 산 출된 제2 확률 값의 차이의 크기가 상기 기 설정된 차이 값 미만인 경우, 상기 환자가 상기 제1 질병과 상기 제 2 질병을 모두 보유한 것으로 판단하는 단계 및 상기 판단된 우세성에 기초하여, 상기 산출된 제2 확률 값이 상 기 산출된 제1 확률 값보다 크고, 상기 산출된 제2 확률 값과 상기 산출된 제1 확률 값의 차이가 기 설정된 차 이 값 이상인 경우, 상기 환자를 상기 제1 질병의 증상이 동반된 상기 제2 질병을 보유한 환자인 것으로 판단하 는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 다중 질병 진단을 수행하는 단계는, 상기 획득된 생체 데이터를 상기 복수의 진단 모 델 각각에 입력함에 따라 상기 환자가 상기 서로 다른 복수의 질병 각각을 보유할 가능성에 대응하는 확률 값을 산출하는 단계 및 상기 서로 다른 복수의 질병 중 상기 산출된 확률 값이 기준 확률 값 이상인 적어도 하나의 질병을 선택하고, 상기 환자에 대한 다중 질병 진단의 결과로서, 상기 환자가 상기 선택된 적어도 하나의 질병 을 보유한 환자인 것으로 판단하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 다중 질병 진단을 수행하는 단계는, 사용자로부터 상기 환자에 대한 제1 질병 진단 요 청을 획득하는 경우, 사전에 정의된 복수의 질병 간 연관관계에 기초하여 상기 제1 질병과 연관관계를 가지는 하나 이상의 제2 질병을 선택하는 단계 및 상기 복수의 진단 모델 중 상기 제1 질병에 대한 진단을 수행하는 하나의 진단 모델과 상기 선택된 하나 이상의 제2 질병에 대한 진단을 수행하는 하나 이상의 진단 모델을 통해 상 기 획득된 생체 데이터를 분석함에 따라 상기 제1 질병을 보유할 가능성인 제1 확률 값과 상기 선택된 하나 이 상의 제2 질병을 보유할 가능성인 하나 이상의 제2 확률 값을 산출하는 단계를 포함할 수 있다. 다양한 실시예에서, 상기 다중 질병 진단을 수행하는 단계는, 상기 복수의 진단 모델을 통해 상기 획득된 생체 데이터를 분석함에 따라 상기 서로 다른 복수의 질병 각각을 보유할 가능성인 복수의 확률 값을 산출하는 단계, 사전에 정의된 복수의 질병 간 연관관계에 기초하여, 상기 산출된 복수의 확률 값을 연관관계에 따라 그룹화하 는 단계 및 상기 그룹화된 복수의 확률 값 각각과 기준 확률 값의 비교 결과, 상기 그룹화된 복수의 확률 값 간 의 대소 비교 결과 및 상기 그룹화된 복수의 확률 값 간의 차이에 기초하여 상기 환자에 대한 다중 질병 진단을 수행하는 단계를 포함할 수 있다. 상술한 과제를 해결하기 위한 본 발명의 다른 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법은 컴퓨팅 장치에 의해 수행되는 방법에 있어서, 환자가 타겟 약물을 복용하기 이전의 시점인 제1 시점 에 상기 환자의 제1 생체 데이터를 획득하는 단계, 상기 제1 시점 이후, 상기 환자가 상기 타겟 약물을 복용한 이후의 시점인 제2 시점에 상기 환자의 제2 생체 데이터를 획득하는 단계 및 질병 진단 모델을 통해 상기 획득 된 제1 생체 데이터들을 분석함에 따라 상기 환자에 대한 다중 질병 진단을 수행하는 단계를 포함하되, 상기 질 병 진단 모델은, 상기 획득된 제1 생체 데이터들을 기반으로 서로 다른 복수의 질병 각각에 대한 진단을 독립적 으로 수행하는 복수의 진단 모델을 포함하는 것일 수 있다. 다양한 실시예에서, 서로 다른 종류의 뇌 질환을 보유한 복수의 환자의 생체 데이터로서, 상기 복수의 환자 각 각에 대한 상기 제1 시점에 측정되는 제1 뇌파 데이터 및 상기 제2 시점에 측정되는 제2 뇌파 데이터를 획득하 는 단계, 뇌 질환의 종류에 기초하여 상기 획득된 제1 뇌파 데이터를 분류하는 단계 및 상기 분류된 제1 뇌파 데이터를 학습 데이터로 하여 서로 다른 진단 모델을 학습시킴으로써, 서로 다른 종류의 뇌질환의 보유 여부를 개별적으로 진단하는 복수의 진단 모델을 생성하는 단계를 더 포함할 수 있다. 다양한 실시예에서, 상기 획득된 제1 뇌파 데이터 및 제2 뇌파 데이터 간의 비교를 통해 유효성 값을 산출하는 단계, 상기 산출된 유효성 값이 기 설정된 유효 수치 이상인 경우, 상기 획득된 제1 뇌파 데이터를 유효 제1 뇌 파 데이터로 분류하는 단계 및 상기 유효 제1 뇌파 데이터를 학습 데이터로 하여 상기 복수의 진단 모델을 재생 성하는 단계를 더 포함할 수 있다. 상술한 과제를 해결하기 위한 본 발명의 또 다른 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단장치는 프로세서, 네트워크 인터페이스, 메모리 및 상기 메모리에 로드(load) 되고, 상기 프로세서에 의해 실행되는 컴퓨터 프로그램을 포함하되, 상기 컴퓨터 프로그램은, 환자의 생체 데이터를 획득하는 인스트럭 션(instruction) 및 질병 진단 모델을 통해 상기 획득된 생체 데이터를 분석함에 따라 상기 환자에 대한 다중 질병 진단을 수행하는 인스트럭션을 포함하되, 상기 질병 진단 모델은, 상기 획득된 생체 데이터를 기반으로 서 로 다른 복수의 질병 각각에 대한 진단을 독립적으로 수행하는 복수의 진단 모델을 포함하는 것일 수 있다. 상술한 과제를 해결하기 위한 본 발명의 또 다른 실시예에 따른 컴퓨터프로그램은 컴퓨팅 장치와 결합되어, 환 자의 생체 데이터를 획득하는 단계 및 질병 진단 모델 - 상기 질병 진단 모델은 상기 획득된 생체 데이터를 기 반으로 서로 다른 복수의 질병 각각에 대한 진단을 독립적으로 수행하는 복수의 진단 모델을 포함함 - 을 통해 상기 획득된 생체 데이터를 분석함에 따라 상기 환자에 대한 다중 질병 진단을 수행하는 단계를 포함하는 인공 지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법을 실행시키기 위하여 컴퓨팅 장치로 판독 가능한 기록 매체에 저장될 수 있다. 본 발명의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 환자의 생체 데이터를 분석하여 환자의 알츠하이머 치매 보유 여부를 판단 하되, 알츠하이머 치매를 보유하는지 여부 뿐만 아니라 루이소체 치매의 동반 여부도 함께 판단함으로써, 치매 환자가 보유한 치매의 종류를 보다 정확하게 분류할 수 있다는 이점이 있다. 또한, 서로 다른 복수의 진단 모델을 통해 환자의 생체 데이터를 분석함으로써, 환자의 치매 보유 여부 뿐만 아 니라, 루이소체 치매, 파킨슨병(Parkinson), 혈관성 치매(Vascular dementia), 우울증 및 불안 등 서로 다른 종류의 뇌 질환을 독립적으로 동시에 수행할 수 있다는 이점이 있다."}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 명세서에서 사용되는 \"부\" 또는 “모듈”이라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소 를 의미하며, \"부\" 또는 “모듈”은 어떤 역할들을 수행한다. 그렇지만 \"부\" 또는 “모듈”은 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. \"부\" 또는 “모듈”은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\" 또는 “모 듈”은 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라 이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\" 또는 “모듈”들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\" 또는 “모듈”들로 결합되거나 추가적인 구성요소들과 \"부\" 또는 “모듈”들로 더 분리될 수 있다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소들과의 상관관계를 용이하게 기술하기 위 해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작시 구성 요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤 집을 경우, 다른 구성요소의 \"아래(below)\"또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성 요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있 다. 본 명세서에서, 컴퓨터는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로서 이해될 수 있다. 예 를 들어, 컴퓨터는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애 플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 본 명세서에서 설명되는 각 단계들은 컴퓨터에 의하여 수행되는 것으로 설명되나, 각 단계의 주체는 이에 제한 되는 것은 아니며, 실시 예에 따라 각 단계들의 적어도 일부가 서로 다른 장치에서 수행될 수도 있다. 도 1 내지 도 3은 알츠하이머 치매 환자와 루이소체 치매 환자 간의 비교 실험 결과를 도시한 도면이다. 도 1 내지 도 3을 참조하면, 루이소체 치매 환자(Pure-LBD), 알츠하이머 치매 증상이 동반된 루이소체 치매 환 자(LBD dominant ADD mix) 및 알츠하이머 치매와 루이소체 치매를 모두 보유한 환자(ADD LBD Mixed)의 경우, 알츠하이머 치매 환자(Pure-ADD), 루이소체 치매 증상이 동반된 알츠하이머 치매 환자(ADD dominant LBD mix) 대비 질병의 진행이 더 빠르고 인지 기능이 더 많이 떨어진다는 특성이 있다. 또한, 알츠하이머 치매 환자(Pure-ADD)와 루이소체 치매 환자(Pure-LBD)의 뇌파 데이터를 비교한 결과, 알츠하 이머 치매 환자(Pure-ADD) 대비 루이소체 치매 환자(Pure-LBD)군의 알파 피크 주파수(Alpha Peak Frequency)가 낮고 델타 주파수(Delta Frequency), 쎄타 주파수(Theta Frequency)의 파워가 강한 경향을 보임을 알 수 있다. 여기서, 알파 피크(Alpha Peak)는 사람마다 개별적인 편차가 존재하나, 정상인의 경우 10Hz 이상에서 형성되는 것이 일반적인데, 인지 장애가 생김에 따라 알파 피크(Alpha Peak)가 느려지는 경향이 보인다. 또한, 델타 (Delta)와 세차(Theta)는 수면 중에 파워가 강해지는 영역으로, 인지 장애가 없는 정상인의 경우에는 델타파와 쎄타파는 크게 발생하지 않는다. 따라서, 알츠하이머 치매 환자(Pure-ADD) 대비 루이소체 치매 환자(Pure-LBD) 환자군의 인지 장애가 더 진행된 것을 알 수 있다. 한편, 대표적인 치매 치료제는 치매의 원인 단백질로 알려진 Amyloid-베타를 제거하는 기전을 가지는 아두카누 맙(Aducanumab)이나 아두카누맙의 부작용을 줄인 레카네맙(Lecanemab) 등이 있으나, 치매의 종류에 따라(예컨대, 알츠하이머 치매만을 보유하고 있는지 또는 루이소체 치매 증상이 동반되는지에 따라) Amyloid-베 타 단백질 제거에 따른 인지기능 호전의 효과가 다르게 나타날 수 있는 바, 단순히 환자가 치매를 보유하고 있 는지 뿐만 아니라 어떤 치매를 보유하고 있는지를 보다 구체적이고 정확하게 진단할 필요성이 있다. 이러한, 점을 고려하여, 본 발명의 다양한 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진 단방법, 장치 및 컴퓨터프로그램은 환자가 치매를 보유하고 있는지 뿐만 아니라, 어떤 종류의 치매를 보유하고 있는지, 다른 질병을 동반하고 있는지 등을 보다 정확하게 구체적으로 판단할 수 있도록 치매 환자를 대상으로 다수의 질병에 대한 동반 진단을 수행할 수 있다. 또한, 이러한 정확하고 구체적인 진단을 통해 치매 환자가 알츠하이머 치매 이외에 다른 질병을 동반하고 있는 지 여부를 판별하고, 제약 개발 과정에서 알츠하이머 치매 환자군만 임상 대상으로 선정하며, 약물의 처방 또한알츠하이머 치매 환자군 대해서만 내릴 수 있도록 할 수 있다. 이하, 도 4 내지 도 14를 참조하여 본 발명의 다 양한 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법, 장치 및 컴퓨터프로그램에 대 해 설명하도록 한다. 도 4는 본 발명의 일 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단시스템을 도시한 도 면이다. 도 4를 참조하면, 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단시스템은 다중 질병 진단장치, 사용자 단말, 외부 서버 및 네트워크를 포함할 수 있다. 여기서, 도 4에 도시된 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단시스템은 일 실시예에 따른 것이 고, 그 구성 요소가 도 4에 도시된 실시예에 한정되지 않으며, 필요에 따라 부가, 변경 또는 삭제될 수 있다. 일 실시예에서, 다중 질병 진단장치(이하, \"컴퓨팅 장치\")는 환자의 생체 데이터를 분석하여 서로 다 른 복수의 질병에 대한 다중 질병 진단을 수행할 수 있다. 여기서, 서로 다른 복수의 질병은 알츠하이머 치매, 루이소체 치매, 파킨슨병, 혈관성 치매, 우울증 및 불안과 같은 서로 다른 종류의 뇌 질환이고, 환자의 생체 데이터는 환자의 뇌 질환을 진단하기 위해 필요한 뇌파 데이 터일 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 컴퓨팅 장치는 질병 진단 모델을 이용하여 환자의 생체 데이터를 분석함으로써, 환자 에 대한 다중 질병 진단을 수행할 수 있다. 여기서, 질병 진단 모델은 복수의 환자 각각이 보유한 질병에 관한 정보(예컨대, 질병의 병명)가 레이블링된 생 체 데이터를 학습 데이터로 하여 학습된 모델일 수 있으며, 특정 환자의 생체 데이터를 입력 데이터로 하여 결 과 데이터로서 환자가 보유한 질병에 관한 정보 또는 특정 질병에 대한 보유 확률 값을 출력하는 모델일 수 있 다. 질병 진단 모델(예: 신경망)은 하나 이상의 네트워크 함수로 구성되며, 하나 이상의 네트워크 함수는 일반적으 로 ‘노드’라 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성될 수 있다. 이러한 ‘노드’들은 ‘뉴 런(neuron)’들로 지칭될 수도 있다. 하나 이상의 네트워크 함수는 적어도 하나 이상의 노드들을 포함하여 구성 된다. 하나 이상의 네트워크 함수를 구성하는 노드(또는 뉴런)들은 하나 이상의 ‘링크’에 의해 상호 연결될 수 있다. 질병 진단 모델 내에서, 링크를 통해 연결된 하나 이상의 노드들은 상대적으로 입력 노드 및 출력 노드의 관계 를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관 계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 전술한 바와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나 이상의 출력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서, 출력 노드는 입력 노드에 입력된 데이터에 기초 하여 그 값이 결정될 수 있다. 여기서 입력 노드와 출력 노드를 상호 연결하는 노드는 가중치(weight)를 가질 수 있다. 가중치는 가변적일 수 있으며, 질병 진단 모델이 원하는 기능을 수행하기 위해, 사용자 또는 알고리즘 에 의해 가변될 수 있다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연 결된 경우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하 는 링크에 설정된 가중치에 기초하여 출력 노드 값을 결정할 수 있다. 전술한 바와 같이, 질병 진단 모델은 하나 이상의 노드들이 하나 이상의 링크를 통해 상호연결 되어 질병 진단 모델 내에서 입력 노드 및 출력 노드 관계를 형성한다. 질병 진단 모델 내에서 노드들과 링크들의 개수 및 노드 들과 링크들 사이의 연관관계, 링크들 각각에 부여된 가중치의 값에 따라, 질병 진단 모델의 특성이 결정될 수 있다. 예를 들어, 동일한 개수의 노드 및 링크들이 존재하고, 링크들 사이의 가중치 값이 상이한 두 질병 진단 모델이 존재하는 경우, 두 개의 질병 진단 모델들은 서로 상이한 것으로 인식될 수 있다. 질병 진단 모델을 구성하는 노드들 중 일부는, 최초 입력 노드로부터의 거리들에 기초하여, 하나의 레이어 (layer)를 구성할 수 있다. 예를 들어, 최초 입력 노드로부터 거리가 n인 노드들의 집합은, n 레이어를 구성할 수 있다. 최초 입력 노드로부터 거리는, 최초 입력 노드로부터 해당 노드까지 도달하기 위해 거쳐야 하는 링크들의 최소 개수에 의해 정의될 수 있다. 그러나, 이러한 레이어의 정의는 설명을 위한 임의적인 것으로서, 질병 진단 모델 내에서 레이어의 차수는 전술한 것과 상이한 방법으로 정의될 수 있다. 예를 들어, 노드들의 레이어 는 최종 출력 노드로부터 거리에 의해 정의될 수도 있다. 최초 입력 노드는 질병 진단 모델 내의 노드들 중 다른 노드들과의 관계에서 링크를 거치지 않고 데이터가 직접 입력되는 하나 이상의 노드들을 의미할 수 있다. 또는, 질병 진단 모델 네트워크 내에서, 링크를 기준으로 한 노드 간의 관계에 있어서, 링크로 연결된 다른 입력 노드들 가지지 않는 노드들을 의미할 수 있다. 이와 유사하 게, 최종 출력 노드는 질병 진단 모델 내의 노드들 중 다른 노드들과의 관계에서, 출력 노드를 가지지 않는 하 나 이상의 노드들을 의미할 수 있다. 또한, 히든 노드는 최초 입력 노드 및 최후 출력 노드가 아닌 질병 진단 모델을 구성하는 노드들을 의미할 수 있다. 본 발명의 일 실시예에 따른 질병 진단 모델은 입력 레이어의 노드 가 출력 레이어에 가까운 히든 레이어의 노드보다 많을 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따 라 노드의 수가 감소하는 형태의 질병 진단 모델일 수 있다. 질병 진단 모델은 하나 이상의 히든 레이어를 포함할 수 있다. 히든 레이어의 히든 노드는 이전의 레이어의 출 력과 주변 히든 노드의 출력을 입력으로 할 수 있다. 각 히든 레이어 별 히든 노드의 수는 동일할 수도 있고 상 이할 수도 있다. 입력 레이어의 노드의 수는 입력 데이터의 데이터 필드의 수에 기초하여 결정될 수 있으며 히 든 노드의 수와 동일할 수도 있고 상이할 수도 있다. 입력 레이어에 입력된 입력 데이터는 히든 레이어의 히든 노드에 의하여 연산될 수 있고 출력 레이어인 완전 연결 레이어(FCL: fully connected layer)에 의해 출력될 수 있다. 다양한 실시예에서, 질병 진단 모델은 딥러닝(Deep learning) 모델일 수 있다. 딥러닝 모델(예: 딥 뉴럴 네트워크(DNN: deep neural network, 심층신경망)는 입력 레이어와 출력 레이어 외에 복수의 히든 레이어를 포함하는 질병 진단 모델을 의미할 수 있다. 딥 뉴럴 네트워크를 이용하면 데이터의 잠재 적인 구조(latent structures)를 파악할 수 있다. 즉, 사진, 글, 비디오, 음성, 음악의 잠재적인 구조(예를 들 어, 어떤 물체가 사진에 있는지, 글의 내용과 감정이 무엇인지, 음성의 내용과 감정이 무엇인지 등)를 파악할 수 있다. 딥 뉴럴 네트워크는 컨벌루셔널 뉴럴 네트워크(CNN: convolutional neural network), 리커런트 뉴럴 네트워크 (RNN: recurrent neural network), 오토 인코더(auto encoder), GAN(Generative Adversarial Networks), 제한 볼츠만 머신(RBM: restricted boltzmann machine), 심층 신뢰 네트워크(DBN: deep belief network), Q 네트워 크, U 네트워크, 샴 네트워크 등을 포함할 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 네트워크 함수는 오토 인코더를 포함할 수도 있다. 여기서, 오토 인코더는 입력 데이터와 유사한 출력 데이터를 출력하기 위한 인공 신경망의 일종일 수 있다. 오토 인코더는 적어도 하나의 히든 레이어를 포함할 수 있으며, 홀수 개의 히든 레이어가 입출력 레이어 사이에 배치될 수 있다. 각각의 레이어의 노드의 수는 입력 레이어의 노드의 수에서 병목 레이어(인코딩)라는 중간 레 이어로 축소되었다가, 병목 레이어에서 출력 레이어(입력 레이어와 대칭)로 축소와 대칭되어 확장될 수도 있다. 차원 감소 레이어와 차원 복원 레이어의 노드는 대칭일 수도 있고 아닐 수도 있다. 또한, 오토 인코더는 비선형 차원 감소를 수행할 수 있다. 입력 레이어 및 출력 레이어의 수는 입력 데이터의 전처리 이후에 남은 센서들의 수와 대응될 수 있다. 오토 인코더 구조에서 인코더에 포함된 히든 레이어의 노드의 수는 입력 레이어에서 멀어 질수록 감소하는 구조를 가질 수 있다. 병목 레이어(인코더와 디코더 사이에 위치하는 가장 적은 노드를 가진 레이어)의 노드의 수는 너무 작은 경우 충분한 양의 정보가 전달되지 않을 수 있으므로, 특정 수 이상(예를 들 어, 입력 레이어의 절반 이상 등)으로 유지될 수도 있다. 뉴럴 네트워크는 교사 학습(supervised learning), 비교사 학습(unsupervised learning), 및 반교사학습(semi supervised learning) 중 적어도 하나의 방식으로 학습될 수 있다. 뉴럴 네트워크의 학습은 출력의 오류를 최소 화하기 위한 것이다. 보다 구체적으로, 뉴럴 네트워크의 학습은 반복적으로 학습 데이터를 뉴럴 네트워크에 입 력시키고 학습 데이터에 대한 뉴럴 네트워크의 출력과 타겟의 에러를 계산하고, 에러를 줄이기 위한 방향으로 뉴럴 네트워크의 에러를 뉴럴 네트워크의 출력 레이어에서부터 입력 레이어 방향으로 역전파(backpropagation) 하여 뉴럴 네트워크의 각 노드의 가중치를 업데이트 하는 과정이다. 먼저, 교사 학습의 경우 각각의 학습 데이터에 정답이 레이블링 되어있는 학습 데이터를 사용하며(즉, 레이블링 된 학습 데이터), 비교사 학습의 경우는 각각의 학습 데이터에 정답이 레이블링 되어 있지 않을 수 있다. 즉, 예를 들어 데이터 분류에 관한 교사 학습의 경우의 학습 데이터는 학습 데이터 각각에 카테고리가 레이블링 된데이터 일 수 있다. 레이블링된 학습 데이터가 뉴럴 네트워크에 입력되고, 뉴럴 네트워크의 출력(카테고리)과 학습 데이터의 레이블을 비교함으로써 오류(error)가 계산될 수 있다. 다음으로, 데이터 분류에 관한 비교사 학습의 경우 입력인 학습 데이터가 뉴럴 네트워크 출력과 비교됨으로써 오류가 계산될 수 있다. 계산된 오류는 뉴럴 네트워크에서 역방향(즉, 출력 레이어에서 입력 레이어 방향)으로 역전파 되며, 역전파에 따라 뉴럴 네트워크의 각 레이어의 각 노드들의 연결 가중치가 업데이트 될 수 있다. 업 데이트 되는 각 노드의 연결 가중치는 학습률(learning rate)에 따라 변화량이 결정될 수 있다. 입력 데이터에 대한 뉴럴 네트워크의 계산과 에러의 역전파는 학습 사이클(epoch)을 구성할 수 있다. 학습률은 뉴럴 네트워크 의 학습 사이클의 반복 횟수에 따라 상이하게 적용될 수 있다. 예를 들어, 뉴럴 네트워크의 학습 초기에는 높은 학습률을 사용하여 뉴럴 네트워크가 빠르게 일정 수준의 성능을 확보하도록 하여 효율성을 높이고, 학습 후기에 는 낮은 학습률을 사용하여 정확도를 높일 수 있다. 뉴럴 네트워크의 학습에서 일반적으로 학습 데이터는 실제 데이터(즉, 학습된 뉴럴 네트워크를 이용하여 처리하 고자 하는 데이터)의 부분집합일 수 있으며, 따라서, 학습 데이터에 대한 오류는 감소하나 실제 데이터에 대해 서는 오류가 증가하는 학습 사이클이 존재할 수 있다. 과적합(overfitting)은 이와 같이 학습 데이터에 과하게 학습하여 실제 데이터에 대한 오류가 증가하는 현상이다. 예를 들어, 노란색 고양이를 보여 고양이를 학습한 뉴 럴 네트워크가 노란색 이외의 고양이를 보고는 고양이임을 인식하지 못하는 현상이 과적합의 일종일 수 있다. 과적합은 머신러닝 알고리즘의 오류를 증가시키는 원인으로 작용할 수 있다. 이러한 과적합을 막기 위하여 다양 한 최적화 방법이 사용될 수 있다. 과적합을 막기 위해서는 학습 데이터를 증가시키거나, 레귤라이제이션 (regularization), 학습의 과정에서 네트워크의 노드 일부를 생략하는 드롭아웃(dropout) 등의 방법이 적용될 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 네트워크를 통해 사용자 단말과 연결될 수 있으며, 사용자 단말을 통해 특정 환자에 대한 질병 진단 요청을 획득할 수 있고, 질병 진단 요청에 따라 환자의 생체 데 이터를 기반으로 다중 질병 진단을 수행함으로써 도출되는 결과 데이터를 사용자 단말로 제공할 수 있다. 여기서, 사용자 단말은, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 내비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 태블릿 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있으나, 이에 한 정되지 않는다. 또한, 여기서, 네트워크는 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미할 수 있다. 예를 들어, 네트워크는 근거리 통신망(LAN: Local Area Network), 광역 통신망 (WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통 신망 등을 포함할 수 있다. 또한, 여기서, 무선 데이터 통신망은 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스(Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등을 포함할 수 있으나, 이에 한정되지는 않는다. 일 실시예에서, 외부 서버는 네트워크를 통해 컴퓨팅 장치와 연결될 수 있으며, 컴퓨팅 장치 가 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법을 수행하기 위해 필요한 각종 정보 및 데 이터를 저장 및 관리하거나, 컴퓨팅 장치가 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법을 수행함에 따라 생성되는 각종 정보 및 데이터를 수집하여 저장 및 관리할 수 있다. 예컨대, 외부 서버는 컴퓨팅 장치의 외부에 별도로 구비되는 저장 서버일 수 있으나, 이에 한정되지 않는다. 이하, 도 5를 참조 하여 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법을 수행하는 컴퓨팅 장치의 하드웨어 구 성에 대해 설명하도록 한다.도 5는 본 발명의 다른 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단장치의 하드웨어 구성이다. 도 5를 참조하면, 컴퓨팅 장치는 하나 이상의 프로세서, 프로세서에 의하여 수행되는 컴퓨터 프 로그램을 로드(Load)하는 메모리, 버스, 통신 인터페이스 및 컴퓨터 프로그램을 저장 하는 스토리지를 포함할 수 있다. 여기서, 도 5에는 본 발명의 실시예와 관련 있는 구성요소들만 도시되어"}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "있다. 따라서, 본 발명이 속한 기술분야의 통상의 기술자라면 도 5에 도시된 구성요소들 외에 다른 범용적인 구 성 요소들이 더 포함될 수 있음을 알 수 있다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 발명의 기술 분야에 잘 알려진 임의의 형태의 프로세서를 포함하여 구성될 수 있다. 또한, 프로세서는 본 발명의 실시예들에 따른 방법을 실행하기 위한 적어도 하나의 애플리케이션 또는 프 로그램에 대한 연산을 수행할 수 있으며, 컴퓨팅 장치는 하나 이상의 프로세서를 구비할 수 있다. 다양한 실시예에서, 프로세서는 프로세서 내부에서 처리되는 신호(또는, 데이터)를 일시적 및/또는 영구적으로 저장하는 램(RAM: Random Access Memory, 미도시) 및 롬(ROM: Read-Only Memory, 미도시)을 더 포 함할 수 있다. 또한, 프로세서는 그래픽 처리부, 램 및 롬 중 적어도 하나를 포함하는 시스템온칩(SoC: system on chip) 형태로 구현될 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 발명의 다양한 실시예에 따른 방 법/동작을 실행하기 위하여 스토리지로부터 컴퓨터 프로그램을 로드할 수 있다. 메모리에 컴퓨 터 프로그램이 로드되면, 프로세서는 컴퓨터 프로그램을 구성하는 하나 이상의 인스트럭션들을 실행함으로써 상기 방법/동작을 수행할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있을 것 이나, 본 개시의 기술적 범위가 이에 한정되는 것은 아니다. 버스는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공한다. 버스는 주소 버스(address Bus), 데 이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스는 컴퓨팅 장치의 유무선 인터넷 통신을 지원한다. 또한, 통신 인터페이스는 인 터넷 통신 외의 다양한 통신 방식을 지원할 수도 있다. 이를 위해, 통신 인터페이스는 본 발명의 기술 분 야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 몇몇 실시예에서, 통신 인터페이스는 생략될 수도 있다. 스토리지는 컴퓨터 프로그램을 비 임시적으로 저장할 수 있다. 컴퓨팅 장치를 통해 인공지능 기 반 생체 데이터 분석을 통한 다중 질병 진단프로세스를 수행하는 경우, 스토리지는 인공지능 기반 생체 데 이터 분석을 통한 다중 질병 진단프로세스를 제공하기 위하여 필요한 각종 정보를 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 발명의 다양한 실시예에 따른 방 법/동작을 수행하도록 하는 하나 이상의 인스트럭션들을 포함할 수 있다. 즉, 프로세서는 상기 하나 이상 의 인스트럭션들을 실행함으로써, 본 발명의 다양한 실시예에 따른 상기 방법/동작을 수행할 수 있다. 일 실시예에서, 컴퓨터 프로그램은 환자의 생체 데이터를 획득하는 단계 및 질병 진단 모델을 통해 획득된 생체 데이터를 분석함에 따라 환자에 대한 다중 질병 진단을 수행하는 단계를 포함하는 인공지능 기반 생체 데 이터 분석을 통한 다중 질병 진단방법을 수행하도록 하는 하나 이상의 인스트럭션을 포함할 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다.본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조 합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 이하, 도 6 내지 도 14를 참조하여 컴퓨팅 장치에 의해 수행되는 인공지능 기반 생체 데 이터 분석을 통한 다중 질병 진단방법에 대해 설명하도록 한다. 도 6은 본 발명의 제1 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법의 순서도이다. 도 6을 참조하면, S110 단계에서, 컴퓨팅 장치는 환자의 생체 데이터를 수집할 수 있다. 여기서, 환자의 생체 데이터는 환자의 뇌파 데이터일 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 컴퓨팅 장치는 환자에 대한 뇌파 데이터를 수집하는 뇌파 수집 동작을 수행할 수 있다. 예를 들어, 컴퓨팅 장치는 뇌파 측정 장치(미도시)를 통해 실시간으로 측정된 환자에 대한 뇌파 데 이터를 수집할 수 있다. 그러나, 이에 한정되지 않고, 컴퓨팅 장치는 외부 서버에 기 저장된 환자에 대한 뇌파 데이터를 외부 서버로부터 제공받을 수 있다. 여기서, 뇌파 데이터는 사용자의 머리(두피)의 서로 다른 위치에 부착되는 복수의 뇌파 측정 채널(예: 총 19개 의 채널(예: Fp1, Fp2, F3, F4, C3, C4, P3, P4, O1, O2, F7, F8, T3, T4, T5, T6, Fz, Cz, Pz))을 포함하는 뇌파 측정 장치(미도시)를 통해 측정되는 복수의 단위 뇌파 데이터(예: 각 채널을 통해 측정되는 독립적인 뇌파 신호)를 의미할 수 있다. S120 단계에서, 컴퓨팅 장치는 S110 단계를 거쳐 획득된 환자의 생체 데이터(예: 환자의 뇌파 데이터)를 분석하여 환자에 대한 다중 질병 진단을 수행할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 질병 진단 모델을 통해 생체 데이터를 분석함에 따라 환자에 대한 다중 질병 진단을 수행할 수 있다. 예컨대, 컴퓨팅 장치는 생체 데이터를 기반으로 서로 다른 복수의 질병 각각 에 대한 진단을 독립적으로 수행하는 복수의 진단 모델을 포함하는 질병 진단 모델을 생성할 수 있으며, 질병 진단 모델에 포함된 복수의 진단 모델 각각에 환자에 대한 생체 데이터를 입력함에 따라 환자에 대한 서로 다른 복수의 질병 각각에 대한 보유 가능성인 확률 값을 도출할 수 있다. 예컨대, 도 7에 도시된 바와 같이, 컴퓨팅 장치는 환자의 생체 데이터를 질병 진단 모델에 포함된 복 수의 진단 모델(예: 제1 질병을 진단하는 제1 진단 모델, 제2 질병을 진단하는 제2 진단 모델 및 제3 질병 을 진단하는 제N 진단 모델(1N))에 각각 입력함에 따라 복수의 확률 값(예: 제1 질병을 보유한 가능성인 제1 확 률 값, 제2 질병을 보유할 가능성인 제2 확률 값 및 제N 질병을 보유할 가능성인 제N 확률 값)을 산출할 수 있 고, 결과 데이터로서, 산출된 복수의 확률 값들에 기초한 다중 질병 진단 결과를 도출할 수 있다. 여기서, 환자에 대한 다중 질병 진단 결과는 상기의 방법에 따라 산출된 복수의 확률 값에 기초하여 복수의 질 병 각각에 대한 보유 여부를 판단한 결과일 수 있으나, 이에 한정되지 않고, 환자에 대한 다중 질병 진단 결과 는 복수의 질병 각각에 대한 보유 가능성을 판단함에 따라 산출된 복수의 확률 값일 수 있다 예컨대, 컴퓨팅 장치는 복수의 진단 모델을 통해 환자의 생체 데이터를 분석함에 따라 제1 질병을 보유할 가능성인 제1 확률 값, 제2 질병을 보유할 가능성인 제2 확률 값 및 제3 질병을 보유할 가능성인 제3 확률 값이 산출된 경우, 제1 확률 값, 제2 확률 값 및 제3 확률 값과 기준 확률 값을 비교함으로써 제1 질병, 제2 질병 및 제3 질병의 보유 여부를 판단할 수 있고, 보유하고 있는 것으로 판단된 질병(확률 값이 기준 확률 값 이상인 질 병)에 관한 정보를 다중 질병 진단 결과로 제공할 수 있다. 또한, 컴퓨팅 장치는 복수의 진단 모델을 통해 환자의 생체 데이터를 분석함에 따라 제1 질병을 보유할 가 능성인 제1 확률 값, 제2 질병을 보유할 가능성인 제2 확률 값 및 제3 질병을 보유할 가능성인 제3 확률 값이 산출된 경우, 제1 확률 값, 제2 확률 값 및 제3 확률 값을 다중 질병 진단 결과로 제공할 수 있다. 이때, 컴퓨 팅 장치는 복수의 확률 값과 기준 확률 값을 비교하여 기준 확률 값 이상인 적어도 하나의 확률 값만을 다 중 질병 진단 결과로 제공할 수 있다. 이하, 도 8을 참조하여, 컴퓨팅 장치에 의해 수행되는 복수의 진단 모델 생성 방법에 대해 설명하도록 한다.도 8은 제1 실시예에서, 복수의 진단 모델을 생성하는 방법을 설명하기 위한 순서도이다. 도 8을 참조하면, S210 단계에서, 컴퓨팅 장치는 복수의 생체 데이터를 획득할 수 있다. 여기서, 복수의 생체 데이터는 서로 다른 종류의 뇌 질환을 보유한 복수의 환자 각각으로부터 수집되는 복수의 뇌파 데이터일 수 있으나, 이에 한정되지 않는다. 또한, 여기서, 컴퓨팅 장치가 수행하는 생체 데이터 획득 동작은 도 6의 S110 단계에서 수행되는 동작과 동일 또는 유사한 형태로 구현될 수 있으나, 이에 한정되지 않는다. S220 단계에서, 컴퓨팅 장치는 질병의 종류에 따라 S210 단계를 거쳐 획득된 복수의 생체 데이터를 분류할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 복수의 환자로부터 복수의 뇌파 데이터를 획득한 경우, 복수의 환자 각 각이 보유한 뇌 질환의 종류에 따라 복수의 뇌파 데이터를 분류할 수 있다. 예컨대, 컴퓨팅 장치는 복수의 뇌파 데이터를 알츠하이머 치매 환자의 뇌파 데이터, 루이소체 치매 환자의 뇌파 데이터, 파킨슨 병 환자의 뇌 파 데이터, 혈관성 치매 환자의 뇌파 데이터, 우울증 환자의 뇌파 데이터 등으로 분류할 수 있으나, 이에 한정 되지 않는다. 다양한 실시예에서, 컴퓨팅 장치는 환자의 속성(예컨대, 환자의 연령, 성별 등 기본적인 프로파일들)에 따 라 정규성이 뛰도록 복수의 뇌파 데이터를 환자의 속성에 따라 1차적으로 분류하고, 1차적으로 분류된 뇌파 데 이터를 질병의 종류에 따라 2차적으로 분류할 수 있다. S230 단계에서, 컴퓨팅 장치는 S220 단계를 거쳐 분류된 복수의 생체 데이터를 학습 데이터로 하여 서로 다른 진단 모델을 학습시킴으로써, 서로 다른 질병의 보유 여부를 개별적으로 진단하는 복수의 진단 모델을 생 성할 수 있다. 예컨대, 컴퓨팅 장치는 알츠하이머 치매, 루이소체 치매, 파킨슨병, 혈관성 치매, 우울증으 로 분류된 뇌파 데이터 각각을 학습 데이터로 하여 서로 다른 진단 모델을 학습시킴으로써, 알츠하이머 치매를 진단하는 진단 모델, 루이소체 치매를 진단하는 진단 모델, 파킨슨병을 진단하는 진단 모델, 혈관성 치매를 진 단하는 진단 모델 및 우울증을 진단하는 진단 모델을 생성할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 복수의 뇌파 데이터 각각에 복수의 환자가 보유한 질병에 관한 정보(예 컨대, 병명)을 레이블링(labeling)함에 따라 학습 데이터를 생성할 수 있고, 학습 데이터를 이용하여 지도학습 (Supervised Learning) 방법에 따라 진단 모델을 학습시킬 수 있으나, 이에 한정되지 않는다. 도 9은 본 발명의 제2 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법의 순서도이다. 도 9를 참조하면, S310 단계에서, 컴퓨팅 장치는 제1 시점에서의 환자의 제1 생체 데이터와 제2 시점에서 의 환자의 제2 생체 데이터를 획득할 수 있다. 여기서, 제1 시점은 환자가 타겟 약물을 복용하기 이전의 시점을 의미할 수 있고, 제2 시점은 환자가 타겟 약물 을 복용한 이후의 시점을 의미할 수 있다. 즉, 제1 시점에서의 환자의 제1 생체 데이터는 타겟 약물을 복용하지 않은 제1 시점에서의 환자의 생체 데이터를 의미할 수 있고, 제2 시점에서의 환자의 제2 생체 데이터는 제1 시 점 이후에 환자가 타겟 약물을 복용한 후, 일정 시간이 경과한 시점에 수집되는 생체 데이터를 의미하는 것일 수 있으나, 이에 한정되지 않는다. 예컨대, 컴퓨팅 장치는 t1 시점에 측정된 환자의 제1 생체 데이터를 획득하고, 이후 해당 환자가 타겟 약 물을 복용하고, t2 시점에 측정된 환자의 제2 생체 데이터를 획득할 수 있다. 여기서, 타겟 약물은 특정 질병을 치료하기 위한 약물이 될 수 있다. 예를 들어, 타겟 약물은 알츠하이머 치매용 약물, 루이소체 치매용 약물 또 는 우울증 약물 등이 될 수 있으며 이에 한정되지 아니한다. 다양한 실시예에서, 컴퓨팅 장치는 복수의 제1 생체 데이터와 복수의 제2 생체 데이터를 획득할 수 있다. 여기서, 복수의 제1 생체 데이터 및 복수의 제2 생체 데이터는 서로 다른 종류의 뇌 질환을 보유한 복수의 환자 각각으로부터 수집되는 복수의 뇌파 데이터일 수 있으나, 이에 한정되지 않는다. 또한, 여기서, 컴퓨팅 장치가 수행하는 생체 데이터 획득 동작은 도 6의 S110 단계에서 수행되는 동작과 동일 또는 유사한 형태로 구현될 수 있으나, 이에 한정되지 않는다. S320 단계에서, 컴퓨팅 장치는 질병 진단 모델을 통해 S310 단계를 거쳐 획득된 제1 생체 데이터들을 분석 함에 따라 환자에 대한 다중 질병 진단을 수행할 수 있다. 여기서, 컴퓨팅 장치가 수행하는 다중 질병 진 단 동작은 도 6의 S120 단계에서 수행되는 동작과 동일 또는 유사한 형태로 구현될 수 있으나, 이에 한정되지 않는다. 도 10은 제2 실시예에서, 복수의 진단 모델을 생성하는 방법을 설명하기 위한 순서도이다. 도 10을 참조하면, S410 단계에서, 컴퓨팅 장치는 서로 다른 종류의 뇌 질환을 보유한 복수의 환자의 생체 데이터로서, 복수의 환자 각각에 대한 제1 시점에 측정되는 제1 뇌파 데이터 및 제2 시점에 측정되는 제2 뇌파 데이터를 획득할 수 있다. 또한, 여기서, 컴퓨팅 장치가 수행하는 생체 데이터 획득 동작은 도 6의 S110 단계에서 수행되는 동작과 동일 또는 유사한 형태로 구현될 수 있으나, 이에 한정되지 않는다. S420 단계에서, 컴퓨팅 장치는 S410 단계를 거쳐 획득된 제1 뇌파 데이터를 분류할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 복수의 환자로부터 복수의 제1 뇌파 데이터를 획득한 경우, 복수의 환 자 각각이 보유한 뇌 질환의 종류에 따라 복수의 제1 뇌파 데이터를 분류할 수 있다. 예컨대, 컴퓨팅 장치(10 0)는 복수의 제1 뇌파 데이터를 알츠하이머 치매 환자의 뇌파 데이터, 루이소체 치매 환자의 뇌파 데이터, 파킨 슨 병 환자의 뇌파 데이터, 혈관성 치매 환자의 뇌파 데이터, 우울증 환자의 뇌파 데이터 등으로 분류할 수 있 으나, 이에 한정되지 않는다. S430 단계에서, 컴퓨팅 장치는 S420 단계를 거쳐 분류된 제1 뇌파 데이터를 학습 데이터로 하여 서로 다른 진단 모델을 학습시킴으로써, 서로 다른 종류의 뇌질환의 보유 여부를 개별적으로 진단하는 복수의 진단 모델을 생성할 수 있다. 예컨대, 컴퓨팅 장치는 알츠하이머 치매, 루이소체 치매, 파킨슨병, 혈관성 치매, 우울증 으로 분류된 뇌파 데이터 각각을 학습 데이터로 하여 서로 다른 진단 모델을 학습시킴으로써, 알츠하이머 치매 를 진단하는 진단 모델, 루이소체 치매를 진단하는 진단 모델, 파킨슨병을 진단하는 진단 모델, 혈관성 치매를 진단하는 진단 모델 및 우울증을 진단하는 진단 모델을 생성할 수 있다. S440 단계에서, 컴퓨팅 장치는 S430 단계를 거쳐 생성된 복수의 진단 모델을 재생성 할 수 있다. 이하, 도 11을 참조하여, 복수의 진단 모델을 재생성하는 방법에 대해 구체적으로 설명하도록 한다. 도 11은 제2 실시예에서, 복수의 진단 모델을 재생성하기 위한 순서를 설명하는 순서도이다. 도 11을 참조하면, S510 단계에서, 컴퓨팅 장치는 획득된 제1 뇌파 데이터 및 제2 뇌파 데이터 간의 비교 를 통해 유효성 값을 산출할 수 있다. 여기에서, 제2 뇌파 데이터는 환자의 제1 뇌파 데이터를 획득한 이후에 해당 환자의 타겟 약물에 대한 예후를 반영한 정보가 될 수 있다. 일례로, 컴퓨팅 장치는 제1 뇌파 데이터의 Alpha peak frequency 값과 제2 뇌파 데이터의 Alpha peak frequency 값을 비교하여 그 차이값을 유효성 값으로 산출할 수 있다. 다른 예로, 컴퓨팅 장치는 제1 뇌파 데이터 값과 제2 뇌파 데이터 값을 통계적으로 비교하여 p-value를 산 출할 수 있다. 여기에서, 제1 뇌파 데이터 및 제2 뇌파 데이터의 비교는 위 예에 한정되지 아니하고, 뇌파 데이 터로부터 획득된 모든 데이터 및 해당 뇌파 데이터를 분석하여 생성한 메타 데이터에 대한 비교를 포함할 수 있 다. S520 단계에서, 컴퓨팅 장치는 유효성 값이 기 설정된 유효 수치 이상인 경우 획득된 제1 뇌파 데이터를 유효 제1 뇌파 데이터로 분류할 수 있다. 예컨대, 컴퓨팅 장치는 S510 통해 산출된 유효성 값이 cut off value 이상인 경우, S510 단계를 거쳐 획득된 제1 뇌파 데이터를 유효 제1 뇌파 데이터로 분류할 수 있다. 예컨 대, 컴퓨팅 장치는 제1 뇌파 데이터 값과 제2 뇌파 데이터 값을 통계적으로 비교한 1/p-value 값이 33.3 이상인 경우, 해당 환자의 제1 뇌파 데이터를 유효 제1 뇌파 데이터로 분류할 수 있다. 그러나, 이는 유효 제1 뇌파 데이터를 분류하기 위한 하나의 예시일 뿐, 본 예에 한정되지 아니한다. S530 단계에서, 컴퓨팅 장치는 유효 제1 뇌파 데이터를 학습 데이터로 하여 복수의 진단 모델을 재생성할 수 있다. 예컨대, 컴퓨팅 장치는 기존에 제1 뇌파 데이터를 기초로 생성된 복수의 진단 모델을 대체할 수 있도록 유효 제1 뇌파 데이터를 기초로 복수의 진단 모델을 재생성할 수 있다. 또한, 컴퓨팅 장치는 질병을 보유한 환자의 생체 데이터와 더불어 질병을 보유하지 않은 정상인의 생체 데 이터를 학습 데이터로 하여 함께 진단 모델을 학습시킴으로써, 질병을 보유한 환자와 정상인을 분류하는 복수의 진단 모델을 생성할 수 있다. 이하, 도 12 내지 도 14를 참조하여, 복수의 진단 모델을 통해 수행되는 다양한 다중 질병 진단 방법들에 대해 구체적으로 설명하도록 한다. 도 12는 다양한 실시예에서, 상호 연관관계를 가지는 제1 질병 및 제2 질병에 대한 진단을 순차적으로 수행하는 방법을 설명하기 위한 순서도이다. 도 12를 참조하면, S601 단계에서, 컴퓨팅 장치는 사용자로부터 환자에 대한 제1 질병 진단 요청(예컨대, 알츠하이머 치매 진단 요청)을 획득하는 경우, 제1 질병을 진단하는 제1 진단 모델을 통해 환자의 생체 데이터 를 분석함으로써, 제1 질병에 대응하는 제1 확률 값 즉, 환자가 제1 질병을 보유할 가능성인 제1 확률 값을 산 출할 수 있다. 여기서, 사용자는 환자의 질병을 진단하고자 하는 의료인일 수 있으나, 이에 한정되지 않고, 사용자는 환자의 보호자나 환자 본인일 수 있다. S602 단계에서, 컴퓨팅 장치는 S601 단계를 거쳐 산출된 제1 확률 값과 기준 확률 값을 비교함으로써, 제1 확률 값이 기준 확률 값 이상인지 여부를 판단할 수 있다. 여기서, 기준 확률 값은 제1 질병의 보유 여부를 판단하기 위한 기준이 되는 확률 값으로, 사전에 설정되는 값 (예컨대, 0.5)일 수 있으나, 이에 한정되지 않는다. S603 단계에서, 컴퓨팅 장치는 S602 단계를 거쳐 제1 확률 값과 기준 확률 값을 비교한 결과, 제1 확률 값 이 기준 확률 값 미만인 것으로 판단되는 경우, 환자가 제1 질병을 보유하지 않은 것 즉, 환자를 제1 질병을 보 유하지 않은 정상인으로 판단할 수 있다. S604 단계에서, 컴퓨팅 장치는 S602 단계를 거쳐 제1 확률 값과 기준 확률 값을 비교한 결과, 제1 확률 값 이 기준 확률 값 이상인 것으로 판단되는 경우, 환자가 제1 질병을 보유한 것으로 판단함과 동시에 제2 질병을 진단하는 제2 진단 모델을 통해 환자의 생체 데이터를 분석함으로써, 제2 질병에 대응하는 제2 확률 값 즉, 환 자가 제2 질병을 보유할 가능성인 제2 확률 값을 산출할 수 있다. 여기서, 제2 질병은 제1 질병과 연관관계를 가지는 질병일 수 있다. 예컨대, 제1 질병이 알츠하이머 치매(ADD) 인 경우, 제2 질병은 알츠하이머 치매와 연관관계를 가지는 루이소체 치매(LBD)일 수 있으나, 이에 한정되지 않 는다. S605 단계에서, 컴퓨팅 장치는 S604 단계를 거쳐 산출된 제2 확률 값과 기준 확률 값을 비교함으로써, 제2 확률 값이 기준 확률 값 이상인지 여부를 판단할 수 있다. 여기서, 기준 확률 값은 제2 질병의 보유 여부를 판단하기 위한 기준으로, 사전에 설정되는 값이며, 제1 질병의 보유 여부를 판단하기 위한 기준 확률 값과 동일한 값(예컨대, 0.5)일 수 있으나, 이에 한정되지 않는다. S606 단계에서, 컴퓨팅 장치는 S605 단계를 거쳐 제2 확률 값과 기준 확률 값을 비교한 결과, 제2 확률 값 이 기준 확률 값 미만인 것으로 판단되는 경우 즉, 제1 확률 값은 기준 확률 값 이상이고 제2 확률 값은 기준 확률 값 미만인 경우, 환자가 제1 질병만을 보유한 환자인 것으로 판단할 수 있다. 예컨대, 제1 질병이 알츠하 이머 치매인 경우, 컴퓨팅 장치는 환자가 알츠하이머 치매만을 보유한 환자(예컨대, 순수 알츠하이머 (Pure-ADD) 환자)인 것으로 판단할 수 있다. 한편, 컴퓨팅 장치는 S605 단계를 거쳐 제2 확률 값과 기준 확률 값을 비교한 결과, 제2 확률 값이 기준 확률 값 이상인 것으로 판단되는 경우 즉, 제1 확률 값 및 제2 확률 값 모두 기준 확률 값 이상인 것으로 판단 되는 경우, 환자가 제1 질병과 제2 질병을 모두 보유한 것으로 판단할 수 있다. 예컨대, 제1 질병이 알츠하이머 치매이고, 제2 질병이 루이소체 치매인 경우, 환자가 알츠하이머 치매와 루이소체 치매를 모두 보유한 환자인 것으로 판단할 수 있다. 이때, 상술된 바와 같이, 루이소체 치매가 알츠하이머 치매 대비 질병의 진행이 더 빠르고 인지 기능이 더 많이 떨어진다는 특성을 가지며, 루이소체 치매 및 알츠하이머 치매 중 어느 종류의 치매의 비중이 더 높은지에 따라 그 특성이 상이한 바, 단순히 루이소체 치매와 알츠하이머 치매를 모두 보유한 것으로 판단하는 것에 그치지 않 고, 제1 확률 값과 제2 확률 값의 대소 비교 결과 및 차이에 기초하여 알츠하이머 치매와 루이소체 치매의 우세 성(Dominant)을 판단할 수 있고, 이에 따라 환자의 상태를 보다 구체적으로 진단할 수 있다(후술되는 S607 단계 내지 S612 단계). S607 단계에서, 컴퓨팅 장치는 S605 단계를 거쳐 제2 확률 값과 기준 확률 값을 비교한 결과, 제2 확률 값 이 기준 확률 값 이상인 것으로 판단되는 경우, 제1 질병과 제2 질병의 우세성을 판단하기 위한 목적으로 제1 확률 값과 제2 확률 값의 대소 비교를 수행할 수 있다. S608 단계에서, 컴퓨팅 장치는 S607 단계를 거쳐 제1 확률 값과 제2 확률 값의 대소 비교를 수행한 결과, 제1 확률 값이 제2 확률 값보다 큰 것으로 판단되는 경우, 제1 확률 값과 제2 확률 값의 차이가 기 설정된 차이 값 이상인지를 판단할 수 있다. 여기서, 기 설정된 차이 값은 제1 질병과 제2 질병 간의 우세성을 구분하기 위한 기준일 수 있으며, 사전에 설 정된 값(예컨대, 0.2)일 수 있으나, 이에 한정되지 않는다. S609 단계에서, 컴퓨팅 장치는 S608 단계를 거쳐 제1 확률 값과 제2 확률 값의 차이가 기 설정된 차이 값 이상인 것으로 판단되는 경우 즉, 제1 확률 값이 제2 확률 값보다 기 설정된 차이 값 이상 큰 것으로 판단되는 경우, 제1 질병이 제2 질병 대비 우세한 것으로 판단할 수 있고, 이에 따라 환자가 제2 질병의 증상이 동반된 제1 질병을 보유한 환자(예컨대, 루이소체 치매 증상을 가지는 알츠하이머 치매 환자(ADD dominant LBD mix))인 것으로 판단할 수 있다 S610 단계에서, 컴퓨팅 장치는 S608 단계를 거쳐 제1 확률 값과 제2 확률 값의 차이가 기 설정된 차이 값 미만인 것으로 판단되는 경우, 제1 질병 및 제2 질병 중 우세한 질병이 없는 것으로 판단하여 환자가 제1 질병 과 제2 질병을 모두 보유한 환자(예컨대, 루이소체 치매와 알츠하이머 치매를 모두 보유한 환자(ADD LBD mix)) 인 것으로 판단할 수 있다. S611 단계에서, 컴퓨팅 장치는 S607 단계를 거쳐 제1 확률 값과 제2 확률 값의 대소 비교를 수행한 결과, 제2 확률 값이 제1 확률 값보다 큰 것으로 판단되는 경우, 제2 확률 값과 제1 확률 값의 차이가 기 설정된 차이 값 이상인지를 판단할 수 있다. 이때, 컴퓨팅 장치는 제2 확률 값과 제1 확률 값의 차이가 기 설정된 차이 값 미만인 것으로 판단되는 경 우, S610 단계와 같이 제1 질병 및 제2 질병 중 우세한 질병이 없는 것으로 판단하여 환자가 제1 질병과 제2 질 병을 모두 보유한 환자(예컨대, 루이소체 치매와 알츠하이머 치매를 모두 보유한 환자(ADD LBD mix))인 것으로 판단할 수 있다. S612 단계에서, 컴퓨팅 장치는 S611 단계를 거쳐 제2 확률 값과 제1 확률 값의 차이가 기 설정된 차이 값 이상인 것으로 판단되는 경우, 제2 질병이 제1 질병 대비 우세한 것으로 판단할 수 있고, 이에 따라 환자가 제1 질병의 증상이 동반된 제2 질병을 보유한 환자(예컨대, 알츠하이머 치매 증상을 가지는 루이소체 치매 환자(LBD dominant ADD mix))인 것으로 판단할 수 있다 즉, 컴퓨팅 장치는 상술된 바와 같이 상호 연관된 둘 이상의 질병을 진단하는 둘 이상의 진단 모델을 통해 도출되는 둘 이상의 확률 값을 이용하여 둘 이상의 질병의 보유 여부를 동반 진단하되, 둘 이상의 질병에 대응 하는 둘 이상의 확률 값의 대소 비교, 차이 값에 따라 둘 이상의 질병에 대한 우세성을 판단하고, 이에 따라 환 자의 상태를 진단함으로써, 단순히 환자가 둘 이상의 질병을 보유하고 있는지 여부 뿐만 아니라, 어떤 질병이 더 우세하게 보유하고 있는지를 보다 구체적으로 진단할 수 있다. 도 13은 다양한 실시예에서, 상호 연관된 제1 질병 및 제2 질병에 대한 진단을 동시에 수행하는 방법을 설명하 기 위한 순서도이다. 도 13을 참조하면, S710 단계에서, 컴퓨팅 장치는 사용자로부터 환자에 대한 제1 질병 진단 요청을 획득할 수 있다. 예컨대, 컴퓨팅 장치는 네트워크를 통해 사용자 단말과 연결될 수 있으며, 사용자 단 말을 통해 환자의 생체 데이터를 획득함과 동시에 제1 질병 진단 요청을 획득할 수 있으나, 이에 한정되지 않는다.S720 단계에서, 컴퓨팅 장치는 제1 질병과 연관관계를 가지는 하나 이상의 제2 질병을 선택할 수 있다. 예 컨대, 컴퓨팅 장치는 사용자로부터 환자에 대한 알츠하이머 치매 진단 요청을 획득하는 경우, 알츠하이머 치매와 연관관계를 가지는 루이소체 치매를 선택할 수 있다. 반대로, 사용자로부터 환자에 대한 루이소체 치매 진단 요청을 획득하는 경우, 루이소체 치매와 연관관계를 가지는 알츠하이머 치매를 선택할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 복수의 질병 간의 연관관계를 사전에 정의할 수 있으며, 사용자로부터 특정 질병에 대한 진단 요청을 획득하는 경우, 사전에 정의된 복수의 질병 간 연관관계에 기초하여 특정 질병과 연관관계를 가지는 적어도 하나의 질병을 선택할 수 있다. S730 단계에서, 컴퓨팅 장치는 제1 질병을 보유할 가능성인 제1 확률 값과 하나 이상의 제2 질병을 보유할 가능성인 하나 이상의 제2 확률 값을 산출할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 복수의 진단 모델 중 제1 질병을 진단하는 하나의 진단 모델과 하나 이 상의 제2 질병을 진단하는 하나 이상의 진단 모델을 통해 환자의 생체 데이터를 분석함에 따라 제1 질병을 보유 할 가능성인 제1 확률 값과 하나 이상의 제2 질병을 보유할 가능성인 하나 이상의 제2 확률 값을 산출할 수 있 다. S740 단계에서, 컴퓨팅 장치는 S430 단계를 거쳐 산출된 확률 값(제1 확률 값 및 하나 이상의 제2 확률 값)을 기반으로, 환자에 대한 다중 질병 진단을 수행할 수 있다. 일례로, 컴퓨팅 장치는 제1 확률 값 및 하나 이상의 제2 확률 값이 기준 확률 값 이상인지를 판단함으로써, 환자가 제1 질병 및 하나 이상의 제2 질병을 보유한 환자인지를 판단할 수 있으며, 판단 결과를 포함하는 다중 질병 진단 결과를 도출할 수 있다. 또한, 컴퓨팅 장치는 제1 확률 값 및 하나 이상의 제2 확률 값이 기준 확률 값 이상인 것으로 판단되는 경 우, 제1 확률 값과 하나 이상의 제2 확률 값의 대소 비교 결과 및 제1 확률 값과 하나 이상의 제2 확률 값의 차 이에 기초하여 제1 질병과 하나 이상의 제2 질병 간의 우세성을 판단할 수 있고, 판단 결과에 따라 환자의 상태 를 진단할 수 있으며, 진단 결과를 포함하는 다중 질병 진단 결과를 도출할 수 있다. 다른 예로, 컴퓨팅 장치는 제1 확률 값 및 하나 이상의 제2 확률 값을 다중 질병 진단 결과로서 도출할 수 있다. 이때, 제1 확률 값 및 하나 이상의 제2 확률 값 중 기준 확률 값 이상인 확률 값들만 다중 질병 진단 결 과로서 도출할 수 있다. 도 14는 다양한 실시예에서, 복수의 질병에 대한 진단을 동시에 수행하는 방법을 설명하기 위한 순서도이다. 도 14를 참조하면, S810 단계에서, 컴퓨팅 장치는 환자의 생체 데이터를 분석하여 환자가 복수의 질병 각 각을 보유할 가능성인 복수의 확률 값을 산출할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 서로 다른 종류의 복수의 질병 각각을 개별적으로 진단하는 복수의 진 단 모델 각각을 통해 환자의 생체 데이터를 분석함으로써, 복수의 질병 각각을 보유할 가능성인 복수의 확률 값 을 산출할 수 있다. S820 단계에서, 컴퓨팅 장치는 복수의 질병 간의 연관관계를 사전에 정의할 수 있으며, 사전에 정의된 복 수의 질병 간 연관관계에 기초하여 복수의 확률 값을 질병들 간의 연관관계에 따라 분류 및 그룹화함으로써, 복 수의 그룹을 생성할 수 있다. 여기서, 복수의 그룹 각각에 포함된 확률 값들은 상호 연관관계를 가지는 질병들을 보유할 가능성인 확률 값들 을 포함하는 것 일 수 있다. 예컨대, 컴퓨팅 장치는 복수의 확률 값 중 알츠하이머 치매를 보유할 가능성 인 제1 확률 값과 알츠하이머 치매와 연관관계를 가지는 루이소체 치매를 보유할 가능성인 제2 확률 값을 그룹 화하여 하나의 그룹을 생성할 수 있으나, 이에 한정되지 않는다. S830 단계에서, 컴퓨팅 장치는 그룹화된 복수의 확률 값을 기반으로 질병 진단을 수행할 수 있다. 일례로, 컴퓨팅 장치는 알츠하이머 치매를 보유할 가능성인 제1 확률 값과 루이소체 치매를 보유할 가능성 인 제2 확률 값이 하나의 그룹에 포함되어 있는 경우, 제1 확률 값 및 제2 확률 값이 기준 확률 값 이상인지를 판단함으로써, 알츠하이머 치매 및 루이소체 치매의 보유 여부를 판단할 수 있으며, 판단 결과를 포함하는 다중 질병 진단 결과를 도출할 수 있다.또한, 컴퓨팅 장치는 제1 확률 값 및 하나 이상의 제2 확률 값이 기준 확률 값 이상인 것으로 판단되는 경 우, 제1 확률 값과 하나 이상의 제2 확률 값의 대소 비교 결과 및 제1 확률 값과 하나 이상의 제2 확률 값의 차 이에 기초하여 알츠하이머 치매와 루이소체 치매 간의 우세성을 판단할 수 있고, 판단 결과에 따라 환자의 상태 를 진단(예컨대, 루이소체 치매의 증상이 동반된 알츠하이머 치매를 보유한 환자, 알츠하이머 치매의 증상이 동 반된 루이소체 치매 환자, 알츠하이머 치매와 루이소체 치매를 모두 보유한 환자 등)할 수 있으며, 진단 결과를 포함하는 다중 질병 진단 결과를 도출할 수 있다. 다른 예로, 컴퓨팅 장치는 알츠하이머 치매를 보유할 가능성인 제1 확률 값과 루이소체 치매를 보유할 가 능성인 제2 확률 값을 다중 질병 진단 결과로서 도출할 수 있다. 이때, 제1 확률 값 및 제2 확률 값 중 기준 확 률 값 이상인 확률 값만 다중 질병 진단 결과로서 도출할 수 있다. 전술한 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법은 도면에 도시된 순서도를 참조하여 설명하 였다. 간단한 설명을 위해 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법은 일련의 블록들로 도시 하여 설명하였으나, 본 발명은 상기 블록들의 순서에 한정되지 않고, 몇몇 블록들은 본 명세서에 도시되고 시술 된 것과 상이한 순서로 수행되거나 또는 동시에 수행될 수 있다. 또한, 본 명세서 및 도면에 기재되지 않은 새 로운 블록이 추가되거나, 일부 블록이 삭제 또는 변경된 상태로 수행될 수 있다."}
{"patent_id": "10-2023-0079606", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0079606", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 내지 도 3은 알츠하이머 치매 환자와 루이소체 치매 환자 간의 비교 실험 결과를 도시한 도면이다. 도 4는 본 발명의 일 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단시스템을 도시한 도 면이다. 도 5는 본 발명의 다른 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단장치의 하드웨어 구성이다. 도 6은 본 발명의 제1 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법의 순서도이다. 도 7은 제1 실시예에서, 복수의 진단 모델을 포함하는 질병 진단 모델을 통해 다중 질병 진단을 수행하는 과정 을 도시한 도면이다. 도 8은 제1 실시예에서, 복수의 진단 모델을 생성하는 방법을 설명하기 위한 순서도이다. 도 9는 본 발명의 제2 실시예에 따른 인공지능 기반 생체 데이터 분석을 통한 다중 질병 진단방법의 순서도이다. 도 10은 제2 실시예에서, 복수의 진단 모델을 생성하는 방법을 설명하기 위한 순서도이다. 도 11은 제2 실시예에서, 복수의 진단 모델을 재생성하는 방법을 설명하기 위한 순서도이다. 도 12는 다양한 실시예에서, 상호 연관관계를 가지는 제1 질병 및 제2 질병에 대한 진단을 순차적으로 수행하는 방법을 설명하기 위한 순서도이다. 도 13은 다양한 실시예에서, 상호 연관된 제1 질병 및 제2 질병에 대한 진단을 동시에 수행하는 방법을 설명하 기 위한 순서도이다. 도 14는 다양한 실시예에서, 복수의 질병에 대한 진단을 동시에 수행하는 방법을 설명하기 위한 순서도이다."}
