{"patent_id": "10-2021-0187921", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0098937", "출원번호": "10-2021-0187921", "발명의 명칭": "기계학습을 이용한 수계 조류 발생량 예측방법", "출원인": "강원대학교산학협력단", "발명자": "안종화"}}
{"patent_id": "10-2021-0187921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기계학습을 이용한 수계 조류 발생량 예측방법으로, 상기 기계학습은 랜덤 포레스트 모델을 이용하는 것을 특징으로 하는 기계학습을 이용한 수계 조류 발생량 예측방법."}
{"patent_id": "10-2021-0187921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 수계 조류 발생량은 클로로필 a을 발생량인 것을 특징으로 하는 기계학습을 이용한 수계 조류 발생량 예측방법."}
{"patent_id": "10-2021-0187921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 랜덤 포레스트 모델의 학습, 테스트 자료는 각각 전체 자료의 70%, 30%인 것을 특징으로 하는 기계학습을이용한 수계 조류 발생량 예측방법."}
{"patent_id": "10-2021-0187921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 상기 랜덤 포레스트 모델의 트리 개수는 70 내지 80개인 것을 특징으로 하는 기계학습을 이용한 수계 조류 발생량 예측방법."}
{"patent_id": "10-2021-0187921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서, 상기 랜덤 포레스트 모델의 랜덤변수는 TOC, TN, pH, 수온, TP, 전기전도도, DO, 최저온도, 평균온도, 최고온도인 것을 특징으로 하는 기계학습을 이용한 수계 조류 발생량 예측방법."}
{"patent_id": "10-2021-0187921", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서, 상기 랜덤변수 중 가장 높은 중요도는 TOC인 것을 특징으로 하는 기계학습을 이용한 수계 조류 발생량예측방법."}
{"patent_id": "10-2021-0187921", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "기계학습을 이용한 수계 조류 발생량 예측방법으로, 상기 기계학습은 랜덤 포레스트 모델을 이용하는 것을 특징 으로 하는 기계학습을 이용한 수계 조류 발생량 예측방법이 제공된다."}
{"patent_id": "10-2021-0187921", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 기계학습을 이용한 수계 조류 발생량 예측방법에 관한 것이다."}
{"patent_id": "10-2021-0187921", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "조류 발생에 대한 예측은 환경모델링에 있어 주된 관심사 중 하나다. 하지만 시계열 자료를 이용한 합성곱 신경 망, 순환 신경망의 일종인 게이트 순환 유닛(gated recurrent unit)을 이용한 클로로필 a 예측 사례는 찾아보기 힘들다. 또한, 단일 측정소의 자료를 이용하여 예측한 사례는 있으나, 다수의 지점 자료를 이용한 수계의 클로로필 a 예"}
{"patent_id": "10-2021-0187921", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "측을 통한 조류 발생 평가 모델을 제시한 사례는 찾기 힘들다.발명의 내용"}
{"patent_id": "10-2021-0187921", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명이 해결하고자 하는 과제는 다수 측정소에서의 자료를 활용하여 기계학습 방법으로 클로로필 a 를 예측하는 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0187921", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따르면, 기계학습을 이용한 수계 조류 발생량 예측방법으로, 상기 기계학습은 랜덤 포레스트 모델을 이용하는 것을 특징으로 하는 기계학습을 이용한 수계 조류 발생량 예측방법을 제공한다. 본 발명의 일 실시예에서, 상기 수계 조류 발생량은 클로로필 a을 발생량이며, 상기 랜덤 포레스트 모델의 학습, 테스트 자료는 각각 전체 자료의 70%, 30%이다. 본 발명의 일 실시예에서, 상기 랜덤 포레스트 모델의 트리 개수는 70 내지 80개이며, 상기 랜덤 포레스트 모델 의 랜덤변수는 TOC, TN, pH, 수온, TP, 전기전도도, DO, 최저온도, 평균온도, 최고온도이며, 랜덤변수 중 가장 높은 중요도는 TOC이다."}
{"patent_id": "10-2021-0187921", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 랜덤 포레스트(random forest, RF) 모델을 통하여 다수의 측정소로부터의 측정데이터로부터 클로로필 a를 예측한다. 특히 최적 모델의 변수 중요도 분석 결과 TOC(27%), TN(19%), pH(13%), 수온(8%), TP(8%), 전기전도도(7%), DO(6%), 최저온도(4%), 평균온도(3%), 최고온도(3%) 순으로 나타나 수계 조류예측에서 가장 중요한 인자는 TOC임을 확인하였으며, 이로부터 보다 정확한 조류예측이 가능하다."}
{"patent_id": "10-2021-0187921", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명하도록 한다. 이에 앞서, 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 아니 되며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각 하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서, 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시예에 불과할 뿐이 고 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양 한 균등물과 변형 예들이 있을 수 있음을 이해하여야 한다. 본 발명은 한강 수계에 대한 클로로필 a 평가 모델에 대한 제시를 위하여 다수의 측정소 자료를 수집하여 기계 학습, 심층학습 기법을 적용, 클로로필 a 예측을 하였으며, 최적화된 모델 내 적용된 인자에 대한 고찰을 통하 여 클로로필 a와 적용 인자의 관계를 분석하였다. 도 1 및 2는 각각 본 발명의 일 실시예에 따른 클로로필 a 예측모델 블록도이고, 각 모델별 예측결과이다. 도 1 및 2를 참조하면, 랜덤 포레스트(RF) 모델이 0.7 수준의 높은 결정계수(R2)를 갖는 것을 알 수 있다. 따라 서, 여러 기계학습 모델 중 클로포릴 a 예측에 있어서는 랜덤 포레스트 모델이 클로로필 a 예측에 가장 적합하 다는 것을 알 수 있다. 이하 이를 보다 상세히 설명한다. 본 발명의 일 실시예에서 사용된 랜덤 포레스트는 기계학습 모델 중 하나인 결정 트리(decision tree)를 다중으 로 연결 한 앙상블(ensemble) 모델이다(Fig. 3.2). 하나의 트리만을 사용하는 결정 트리와는 다르게 bootstrapaggregating(bagging)을 통하여 전체 자료를 상관관계가 없는 독립적인 트리 구성에 무작위 복원 추출한 자료구 성을 분배하여 계산한 다음 종합한 결과를 다 수결 결정(majority voting)을 하여 최적 결과를 얻는다(Breiman, 2001). 이러한 방식은 모델 내 트리들이 독립적인 자료로 학습 과정을 거치며 다른 특성을 가져 하나의 결정 트리를 이 용하는 것보다 일반화(generalization) 성능이 향상되어 과적합(overfitting)을 방지하는 데 도움이 된다. 따라 서 트리 개수의 설정이 중요하며, 본 발명에선 최적의 트리 개수 설정을 통해 최적화를 진행하였다. 트리 당 최 소 자료 개수는 2로 설정하였으며, 분할에 고려할 최대 인자 개수는 자동으로 설정하였다. 트리 당 계산하는 깊 이는 예측값인 클로로필 a가 결정될 때까지 분할되도록 설정하였다. 랜덤 포레스트는 구성 과정에서 bootstrap을 통한 무작위 중복 추출에서 학습 자료에 들어가지 않은 OOB 자료 (out of bag data)를 통하여 학습 결과를 바탕으로 예측 후 발생하는 테스트 결과인 OOB-오차(out of bag error)를 얻을 수 있다. 이를 이용하여 변수의 중요도를 파악할 수 있다는 장점을 가지고 있다(Breiman, 2001). 본 발명에선 이를 이용하여 랜덤 포레스트 학습 및 테스트 결과를 바탕으로 변수 중요도를 분석하여 실제 모델 에서 입력변수의 기여도에 대한 분석을 수행하였다. 기여도 분석 결과를 바탕으로 입력변수와 예측 변수인 클로 로필 a의 관계를 문헌 발명를 통하여 환경적 측면에서 분석하였다. 도 3은 무작위추출 자료를 이용한 랜덤 포레스트 (a) 학습 및 (b) 테스트 결과이고, 도 4는 자료구성 및 학습, 테스트 비율에 따른 랜덤 포레스트 예측 결과를 나타낸다. 도 3 및 4를 참조하면, 랜덤 포레스트 최적화 결과 train R2=0.952, test R2=0.747, train RMSE=3.152, test RMSE=8.617, train MAE=1.539, test MAE=4.109를 얻었다. 무작위추출 자료를 이용한 모델(train R2=0.952, test R2=0.738, train RMSE=3.109, test RMSE=8.768, train MAE=1.547, test MAE=4.249)이 시계열 자료를 이 용한 모델보다 높은 예측 성능을 보였다(도 4 참조). 시계열 자료를 이용한 모델은 학습 과정에선 무작위추출 자료를 이용한 모델보다 좋은 결과를 냈지만, 테스트 과정에선 오차가 상대적으로 높게 나왔으며, 시계열 자료에서 학습 과정 중 지나친 학습으로 테스트 자료에 대 한 예측 성능이 감소하는 과적합이 발생했을 가능성이 있었다. 따라서, 전체 자료 중 학습 자료의 비율을 70%, 테스트 자료의 비율을 30%로 한 모델이 가장 높은 예측률을 보였다. 학습 자료를 80%, 테스트 자료를 20%로 하 여 예측을 시도한 경우 test R2가 감소 하였다. 학습, 테스트 자료의 비율을 60% 40%로 하여 예측을 시도한 결 과 학습, 테스트 자료를 70%, 30%로 설정한 결과보다 낮은 성능을 보였다. 모델의 하이퍼 파라미터 조정 결과 트리 개수를 78개로 하였을 경우 가장 높은 예측률을 보였다. 80개 이상으로 트리 개수를 설정할 경우 R2의 경 우 학습, 테스트 모두 변화가 없었으며, RMSE, MAE의 경우 오차가 감소하는 모습을 보였으나, 증가하는 트리 개 수에 비하여 적은 예측률 개선을 보였다. 따라서, 트리 개수는 80개 이하로 하는 것이 바람직하며, 보다 바람직 하게는 78개가 속하는 70 내지 80개 범위이다. 도 5는 본 발명에 따라 최적화된 랜덤 포레스트 모델을 적용한 경우 변수간 중요도를 분석한 결과이고, 도 6은 랜덤 포레스트 인자별 예측 결과이다. 도 5 및 6을 참조하면, 1% 중요도를 보인 강수량만을 제거했을 경우 예측 성능 에서 큰 차이를 보이지 않았다 (도 6 참조). TOC, TN, pH, 수온, TP, 전기전도도, DO를 이용한 경우 학습, 테스트 R2의 경우 차이가 크지 않았 으나, RMSE, MAE의 경우 학습, 테스트에서 낮아져 모델이 개선된 모습을 보였다(train R2=0.95, test R2=0.74, train RMSE=3.10, test RMSE=8.67, train MAE=1.49, test MAE=3.99). 이후 전기전도도, DO를 제외한 기여도 상 위 5개의 인자로 예측을 시도한 결과 모든 지표에서 예측 성능이 감소했으며, 기여도가 10% 이상인 TOC, TN, pH 만을 이용하여 예측을 시도한 결과 test R2가 0.2 낮아지는 모습을 보였다(train R2=0.92, test R2=0.54, train RMSE=4.01, test RMSE=11.57, train MAE=2.21, test MAE=6.07). 이 과정에서 TP를 제외한 모델보다 수온 을 제외한 모델의 test R2의 변화가 컸다. 이를 통해 본 모델에서 기여도 분석 결과가 비슷한 수온과 TP 중 모 델 내 클로로필 a에 더 큰 영향을 주는 것은 수온임을 알 수 있었다. 이는 상관관계 분석 결과 수온과 클로로필 a의 상관도 (0.32)가 TP와 클로로필 a와의 상관도(0.2)보다 높은 것과 유사하였다. pH의 경우 세 번째로 높은 기여도를 보였다. 선행문헌(Berenguel et al., 2004)에 의하면 조류 세포는 생장 중 광합성을 통해 CO2를 소비하며, pH에 변화를 줄 수 있다. 따라서 pH는 조류 성장에 간접적으로 영향을 줄 수 있 는 인자라 할 수 있다. 선행연구에 의하면 조류 성장에 대한 pH의 직접적인 영향은 pH가 5∼8.5일 때 여러 인자 에 따 라 제한될 수 있다(Shoener et al., 2019). 본 발명의 pH는 6.2∼9.7이며 평균 7.617이다. 이 중 8.5를 넘는 pH를 보유한 자료는 475개로 전체 자료의 약 3%만을 차 지하여 전체 자료의 97%가 5∼8.5 사이에 포함되었다. 따라서 본 발명에서 pH는 여러 인자의 작용에 따라 조류 성장에 대한 직접적인 영향을 주는데 제한이 되었 을 가능성이 있다. 또한, pH는 질소는 종류에 따라 영향을 받을 수 있는데 암모늄의 경우 동화 작용으로 양성자 를 방출하여 pH를 감소시키며, 반대로 질산염은 양성자를 소비하여 pH를 증가시킬 수 있다(Nguyen and Rittmann, 2015). 따라서 조류 세포에 대한 간접 적인 영향과 두 번째로 기여도가 높은 TN의 영향으로 다른 인 자들보다 모델 내 높은 기여도를 보였다고 할 수 있다. 수온은 조류 성장에 있어서 중요한 인자 중 하나로 수온의 상승은 조류의 성장을 촉진하며, 수생 생물의 화학적 조건에 많은 영향을 준다. 또한, 퇴적물에서 더 많은 양의 인의 방출을 유도하여 수중 인 농도를 상승시킨다 (Shi et al., 2020). 따라서 외부 온도의 상승에 의한 수온 상승은 수중 인 농도의 상승과 직접적인 연관성을 가지게 되며, 조류 발생량에 수온이 영향을 미침을 알 수 있다. 따라서 조류 발생량에 따라 직접적인 영향을 받 는 TOC, TN, pH와 달리 영향 인자로서 작용하는 수온은 상대적으로 중 요도가 떨어질 수 있다. 최저, 평균, 최 고온도는 수온에 비해 높은 중요도를 보이지 않았다. 또한, 저온, 고온에 따라 조류 세포에 미치는 영향이 다르 며(Shoener et al., 2019), 대부분의 미세 조류의 경우 14∼30℃에서 광합성, 세포 분열을 수행하며, 최적 온도 범위는 20∼25℃로 알려져 있다(Ras et al., 2013). 따라서 온도는 조류 세포의 생화학적 반응 속도에 영향을 미치는 요소로 본 발명에선 직접적인 클로로필 a 변동엔 큰 영향을 주지 못한 것으로 보인다. 인은 생명체의 성장에 있어 필수 요소로 수생 생태계에서 중요한 영양소다(Shi et al., 2020). 인 제한적 환경 에선 세포 내 질소의 흡수 효율이 감소한다는 연구 결과가 있으며(Bougaran et al., 2010), 조류 세포가 인 가 용성에 제한되지 않는 환경에선 인 관련 농도의 저감만으론 호수의 생태학적 상태가 개선되지 않을 수 있다는 결과가 있다(Spear et al., 2013). 따라서 조류 세포 작용에 있어 인은 질소 관련 인자의 변화에 간접적인 영향 을 준다는 것을 알 수 있으며, 조류 세포가 직접적인 영향을 주는 TN이 환경을 형성하여 간접적인 영향을 주는 TP보다 더 높은 기여도를 보였음을 알 수 있다. 또한, 여러 요인을 종합적으로 분석할 시 TP만으론 생태학적 상 태를 정확하게 판단하기 어렵다는 점도 TP의 낮은 중요도의 이유 중 하나인 것으로 보인다(Spear et al., 2013). 이상 살핀 바와 같이 본 발명은 다중 측정소에서 얻은 데이터를 통하여 클로로필 a 예측에 가장 최적화된 인공 지능 모델로서 랜던 포레스트 모델을 제공하며, 특히 학습, 테스트 자료는 전체 자료의 70%, 30%, 모델 내 트리 개수는 78에서 가장 높은 성능을 보였다. 따라서, 클로로필 a가 측정되지 않는 수계 내 관측소의 클로로필 a 예 측모델로 본 발명에서 제시한 수질, 기상인자를 대입한 최적 랜덤 포레스트 모델을 이용할 수 있을 것으로 예상 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2021-0187921", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 2는 각각 본 발명의 일 실시예에 따른 클로로필 a 예측모델 블록도이고, 각 모델별 예측결과이다. 도 3은 무작위추출 자료를 이용한 랜덤 포레스트 (a) 학습 및 (b) 테스트 결과이고, 도 4는 자료구성 및 학습, 테스트 비율에 따른 랜덤 포레스트 예측 결과를 나타낸다. 도 5는 본 발명에 따라 최적화된 랜덤 포레스트 모델을 적용한 경우 변수간 중요도를 분석한 결과이고, 도 6은 랜덤 포레스트 인자별 예측 결과이다."}
