{"patent_id": "10-2020-0081295", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0003725", "출원번호": "10-2020-0081295", "발명의 명칭": "소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법", "출원인": "한남대학교 산학협력단", "발명자": "김진일"}}
{"patent_id": "10-2020-0081295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "소비자의 식품 선호도와 동선을 이용하여, 상기 소비자의 동선 주변의 식품 매장들의 식품 종류와 유통기한 및할인 정보를 DB화하여 상기 소비자에게 식품 및 식품할인 정보를 제공하는 것을 특징으로 하는 소비자의 동선을고려한 시간대별 지능형 상품 추천 기법."}
{"patent_id": "10-2020-0081295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 동선은 소비자의 주중과 주말의 시간대별 이동을 누적하여 동선을 결정하는 것을 특징으로 하는 소비자의동선을 고려한 시간대별 지능형 상품 추천 기법."}
{"patent_id": "10-2020-0081295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 소비자는 식품 및 식품할인 정보를 제공받기 위하여 스마트폰과 같은 스마트단말기에 전용 프로그램을 설치하여 자주가는 편의점, 마트, 음식점과 같은 매장정보와 출근길 또는 통학길과 같은 동선정보를 입력하고, 매장을 선택하여 상기 매장에서 메시지 발송 또는 푸시알람 정보를 확인하여, 식품을 구매할 수 있는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법."}
{"patent_id": "10-2020-0081295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 식품 매장은 POS 또는 관리자 스마트폰 등을 통해 유통기한 임박한 상품을 입고 시 또는 시간대 별로 재고를 파악하여 식품과 유통기한 정보를 업데이트하여 저장하고, 식품을 선택하여 할인율, 할인시점과 같은 식품판매 정책을 등록 또는 업데이트하고, 상기 소비자가 설치한 전용 프로그램과 연동되도록 메시지 발송 또는 푸시알람을 통하여 상기 소비자에게 식품의 종류, 구입가능 량, 남은 유통기한 정보를 알리며,계절, 날씨. 시간대 별로 상기 소비자의 선호도 정보를 이용하여 다양한 식품 및 상품 정보를 제공하는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법."}
{"patent_id": "10-2020-0081295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,소비자 중심의 구매방법에 있어서, 상기 스마트폰과 같은 스마트단말기에 설치된 전용 프로그램에서 상기 소비자가 원하는 식품과 가격대 및 매장까지의 거리를 입력하면, 상기 소비자의 이동 중에 원하는 조건의 매장이 나타나면 푸시알람을 발생하는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법."}
{"patent_id": "10-2020-0081295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "생활패턴의 변화와 인건비의 상승으로 일반 식품매장의 오픈시간을 줄이는 것도 새로운 매장의 운영방법으로 이용될 수 있는 것이어서, 판매자의 매장에 위탁판매를 의뢰받은 식품을 입고하고, 식품별 유통기한을 등록하고,상기 위탁판매 식품의 정보를 상기 소비자가 설치한 전용 프로그램과 연동되도록 메시지 발송 또는 푸시알람을통하여 상기 소비자에게 식품의 종류, 구입가능 량, 남은 유통기한 정보를 알리는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법."}
{"patent_id": "10-2020-0081295", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 식품(신선 식품 또는 과일 또는 일반식품)의 진열 또는 판매방법에 있어서, 판매자는 일정 시간 간격 으로 상품 진열대를 관리하며, 상품의 유통기한을 점검한다. 그러나 중간에 판매자가 근무교대를 할 수도 있고, 매장의 다른 업무를 하느라 유통기한이 얼마 남지 않은 식품의 판매시기를 놓일 수 있다. 소비자 역시 식품의 유 (뒷면에 계속)"}
{"patent_id": "10-2020-0081295", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 식품의 유통기한 내에 물건을 팔 수 있도록 상품정보를 제공하는 방법에 관한 것이다. 더욱 자세하게 는 ICT 기술을 이용하여 유통기한 정보를 판매자가 제공하고, 소비자는 상기 정보를 제공받아 현명하게 소비할 수 있는 기술을 제공하는 것이다."}
{"patent_id": "10-2020-0081295", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명 출원 이전의 선행기술로는 냉장고에 수납되는 식품의 포장지에 기재된 인쇄영역을 카메라로 촬영한 영 상정보로부터 문자인식을 통해 유통기한을 검출하여 사용자에게 유통기한 정보를 알려줄 수 있고, 냉장고문을 열면 유통기한이 임박하거나 경과한 식품에 대해 알림메시지를 출력하여 사용자에게 알려줄 수 있으며, 원격의 스마트폰앱을 통해 유무선으로 접속하여 냉장고 보관식품을 확인할 수 있도록 하는 냉장고의 문자판독 인공지능 에 의한 보관식품 유통기한 알림 장치와 그 방법에 관한 기술이 개시되어 있다. 또 다른 선행기술로는 할인 정보 제공 시스템 및 이를 이용한 할인 정보 제공 방법에 관한 것으로, 구체적으로 는 매장에서 판매하고자 하는 할인 상품에 대한 정보를 소비자에게 보다 효율적으로 제공할 수 있는 할인 정보 제공 시스템 및 이를 이용한 할인 정보 제공 방법에 관한 것으로, 관리자 단말로부터 할인 정보를 수신하는 할 인 정보 수신부, 포스 시스템이 할인판매를 진행할 상품의 가격을 할인 가격으로 조정하게 하는 상품 가격 조정 부 및 할인 정보로부터 생성된 할인 알림 메시지를 사용자 단말 및 매장 단말 중 적어도 하나로 전송하는 할인 알림부를 구비하는 기술이 개시되어 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1756620 (특허문헌 0002) 공개특허공보 제10-2018-0004511"}
{"patent_id": "10-2020-0081295", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 식품(신선 식품 또는 과일 또는 일반식품)의 진열 또는 판매방법에 있어서, 판매자는 일정 시간 간격 으로 상품 진열대를 관리하며, 상품의 유통기한을 점검한다. 그러나, 중간에 판매자가 근무교대를 할 수도 있고, 매장의 다른 업무를 하느라 유통기한이 얼마 남지 않은 식품의 판매시기를 놓일 수 있다. 또한, 소비자는 식품의 유통기한이 얼마 남지 않은 식품은 더 저렴하게 구입할 수 있지만, 그 재고여부를 알 수 없어 저렴하게 식품을 구입할 수 있는 기회를 놓칠 수 있다. 본 발명은 상기와 같은 유통기한이 얼마 남지 않은 식품을 보유하고 있는, 매장과 식품을 저렴하게 구입하고자 하는 소비자에게 정보를 공유할 수 있는 편리한 방법을 제공하고자 한다."}
{"patent_id": "10-2020-0081295", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 상기와 같은 문제를 해결하기 위하여 하기의 과제해결 수단을 제공한다. 소비자의 식품 선호도와 동선을 이용하여, 상기 소비자의 동선 주변의 식품 매장들의 식품 종류와 유통기한 및 할인 정보를 DB화하여 상기 소비자에게 식품 및 식품할인 정보를 제공하는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다. 또한, 상기 동선은 소비자의 주중과 주말의 시간대별 이동을 누적하여 동선을 결정하는 것을 특징으로 하는 소 비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다. 또한, 상기 소비자는 식품 및 식품할인 정보를 제공받기 위하여 스마트폰과 같은 스마트단말기에 전용 프로그램 을 설치하여 자주가는 편의점, 마트, 음식점과 같은 매장정보와 출근길 또는 통학길과 같은 동선정보를 입력하 고, 매장을 선택하여 상기 매장에서 메시지 발송 또는 푸시알람 정보를 확인하여, 식품을 구매할 수 있는 것을특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다. 또한, 상기 식품 매장은 POS 또는 관리자 스마트폰 등을 통해 유통기한 임박한 상품을 입고 시 또는 시간대 별 로 재고를 파악하여 식품과 유통기한 정보를 업데이트하여 저장하고, 식품을 선택하여 할인율, 할인시점과 같은 식품 판매 정책을 등록 또는 업데이트하고, 상기 소비자가 설치한 전용 프로그램과 연동되도록 메시지 발송 또 는 푸시알람을 통하여 상기 소비자에게 식품의 종류, 구입가능 량, 남은 유통기한 정보를 알리며, 또한, 계절, 날씨. 시간대 별로 상기 소비자의 선호도 정보를 이용하여 다양한 식품 및 상품 정보를 제공하는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다. 또한, 소비자 중심의 구매방법에 있어서, 상기 스마트폰과 같은 스마트단말기에 설치된 전용 프로그램에서 상기 소비자가 원하는 식품과 가격대 및 매장까지의 거리를 입력하면, 상기 소비자의 이동 중에 원하는 조건의 매장 이 나타나면 푸시알람을 발생하는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법 을 제공한다. 또한, 생활패턴의 변화와 인건비의 상승으로 일반 식품매장의 오픈시간을 줄이는 것도 새로운 매장의 운영방법 으로 이용될 수 있는 것이어서, 판매자의 매장에 위탁판매를 의뢰받은 식품을 입고하고, 식품별 유통기한을 등 록하고, 상기 위탁판매 식품의 정보를 상기 소비자가 설치한 전용 프로그램과 연동되도록 메시지 발송 또는 푸 시알람을 통하여 상기 소비자에게 식품의 종류, 구입가능 량, 남은 유통기한 정보를 알리는 것을 특징으로 하 는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다."}
{"patent_id": "10-2020-0081295", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 상기와 같은 구성에 의하여, 식품의 유통기한 경과로 인한 판매자의 손해를 줄이고, 소비자는 식품을 저렴하게 구입할 수 있는 효과가 있다."}
{"patent_id": "10-2020-0081295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 김밥, 튀김 등과 같이 유통기한이 짧은 식품이 편의점, 대형마트의 푸드코트 등에서 많이 팔리고 있 다. 이는 1인 가구의 등장과 바쁜 현대인의 생활상이 반영되고 있는 듯하다. 그러나, 유통기한이 짧은 식품은 계절, 하루 중의 시간대, 요일별, 매장 주변의 소비자의 연령층에 따라 소비자의 선택이 다양하여 소비자의 선 호도를 못 맞추는 경우 그때그때 폐기되는 식품의 양이 많고, 다양하다. 한편 이러한 폐기되는 식품을 줄이기 위하여 식품의 입고를 줄이면, 소비자가 몇 번 방문하여 자신이 원하는 식품이 계속 없는 것을 확인하면 그 매 장을 찾지 않아 손님을 잃는 부작용이 생길 수 도 있어, 폐기가 되더라도 식품의 입고를 많이 줄일 수 없는 상 황이다. 이러한 이유로 현재 편의점, 수퍼마켓, 대형 마트 및 일반 음식점 등은 유통기한으로 인해 손실되는 식료품 및 음식품에 대한 처리 방안으로 지역별, 계절별, 요일별, 그날의 시간대별 소비자의 소비패턴을 빅데이터로 수집 하여 그날그날 공급하는 식품의 양과 종류를 달리하고 있다. 또 폐기량을 줄이는 방법으로 대형 마트, 편의점에서 유통기한이 임박한 식품을 사회복지 기관, 푸드 뱅크, 소 외계층 등으로 제공하기도 한다. 그러나, 이러한 제공은 제공받은 쪽에서 원하는 것이 아니라, 제공하는 쪽에서 제공할 수 있는 것을 제공하는 것이어서 바람직한 방법이 아닐 수도 있다. 본 발명은 이러한 신선식품 또는 조리 완료된 식품의 판매자는 폐기량을 줄이고, 소비자는 할인된 가격에 이용 할 수 있는 플레폼을 제공하여, 음식물 쓰레기를 줄이면서 판매자와 소비자 모두 혜택을 볼 수 있는 수단을 제공하고자 하였다. 본 발명의 핵심은 매장에서 유통기한이 임박할수록 할인율을 높여 판매를 유도하고, 매장에 없는 소비자도 이러 한 유통기한이 임박한 식품의 할인 구매 정보를 알 수 있는 수단을 제공하여, 판매자와 소비자 모두 이익을 볼 수 있을 것이다. 이를 위하여 소비자의 동선을 고려한 시간대별 지능형 식품 추천 서비스 솔루션이다. 유통기한이 임박한 식품의 정보를 소비자(주요 고객이나 매장 주변의 일반인들)에게 재고량과 판매가능 시간대별(예: 오전에는 빵, 유류, 김밥 저녁에는 간식 등)로 최적의 상품을 제공함으로써 유통기한 임박한 제품의 구매율을 높여 제고율을 낮추도 록 하는 것이다. 또한, 시간대별로 구입 가능한 예측 상품과 상점 위치정보도 함께 제공할 수 있다. 식품 판매 매장에서의 식품별 유통기한별 할인 서비스 제공방법은 POS(결제시스템) 또는 관리자 스마트폰 등을 통해 식품의 입고 시 또는 매장 정리 시 유통기한 임박한 상품을 확인하고, 이중 소비자에게 할인하여 판매할 식품을 자동 또는 수동으로 선정한다. 이러한 할인율은 미리 저장된 정보를 사용할 수도 있고, 재고량에 따라 할인율을 달리할 수도 있다. 이렇게 할인하여 팔기로한 식품은 상기 POS 또는 관리자 스마트폰 프로그램 또는 앱을 통하여 소비자가 사용하 는 앱을 통하여 소비자에게 문자 메시지나, 푸시알람을 통하여 전송된다. 상기 전송되는 정보는 식품의 수량, 구매가능 기한, 할인된 가격 등이다. 또한, 특정 계절 상품이나, 비가오거나 눈이 오는 경우 등 변화되는 날씨에 따라 소비자의 소비패턴이 변화되는 식품은 고객의 과거 구매 성향을 고려하여 소비자별로 다른 구매정보를 제공할 수 있음은 물론이다. 소비자는 소비자가 가지고 있는 스마트기기외 전용 프로그램을 이용하여 서비스 가입 또는 인터넷 연결 또는 앱 또는 전용 프로그램을 이용하여 상기 서비스를 이용할 수 있다. 소비자가 선호하는 편의점, 마트, 음식점 등 및 출근길/ 통학길 주변의 서비스 제공 매장 등을 소비자의 동선과 함께 저장한다. 상기 소비자의 동선은 전용 프로그램에서 누적하여 소비자의 이동경로를 저장하여 생성할 수 있 다. 상기 소비자가 선택한 매장에 상기와 같은 구매정보를 업데이트하면, 상기 선택된 매장에서 업데이트한 구매정 보를 소비자가 문자메시지 또는 앱의 푸시알람을 통하여 확인할 수 있다. 소비자는 이동 중 또는 필요에 의하여 매장을 방문함으로써 식품을 구매할 수 있음은 물론이다. 본 발명의 또 다른 특징은 위탁판매 수단을 제공하는 것이다. 1인 가구 수가늘어나고, 생활패턴도 다양하여 도 시에서는 소비와 판매가 24시간 이루어지고 있다. 이러한 생활상을 반영하여 24시간 운영하는 커피숍, 패스트푸 드점 등이 늘어나고 있다. 그러나, 이렇게 매장을 24시간 운영하는 것은 인건비 부담을 가중하는 것으로 판매가 야간에 많이 일어나지 않는 매장들은 오히러 손해가될 수 있다. 그러나, 주변에 24시간 운영하거나, 늦은 시간 까지 운영하는 편의점, 마트 등이 있다면, 중-소형의 식품매장을 운영하는 매장은 위탁판매를 의뢰할 수도 있다. 본 발명의 또 다른 구성은 상기과 같이 유통기한이 임박한 식품을 판매하는 플레폼에 위탁판매도 가능하 도록 함으로써 불필요하게 식품이 다 팔릴 때까지 영업을 하여야 하는 불편함을 해소할 수 있을 것이다. 또한, 본 발명의 식품 유통기한 플렛폼을 역으로 이용하여, 소비자가 미리결제하고, 픽업해 갈 수 있는 수단으 로 이용할 수 있음은 물론이다. 인기가 많으 식품의 경우 입고시기에 맞추어 매장에서 구매하여야하는 문제가 있어왔다. 본 발명의 소비자의 동선을 고려한 시간대별 지능형 상품 추천기법에서는 소비자가 구매하고자 하는 식품을 소 비자가 픽업할 수 있는 시간에 픽업을 할 수있도록 소비자의 선 결제 후 제품을 픽업하는 수단을 더 제공할 수 있다. 도 1은 본 발명의 소비자의 동선을 고려한 시간대별 지능형 상품 추천 서비스를 제공하는 전체 구성도를 도시하 고 있다. 소비자의 식품 선호도와 동선을 이용하여, 상기 소비자의 동선 주변의 식품 매장들의 식품 종류와 유 통기한 및 할인 정보를 DB화하여 상기 소비자에게 식품 및 식품할인 정보를 제공하는 것을 특징으로 하는 소비 자의 동선을 고려한 시간대별 지능형 상품 추천 기법를 시스템화한 도면이다. 도 2은 본 발명의 판매자 중심의 소비자의 서비스 이용 예시하고 있다. 판매자 중심이라 설명한 이유는 유통기 한이 임박한 식품을 할인할 것인지, 아닌지 판매자가 결정하는 것이기 때문이다. 도 3은 본 발명의 소비자 중심의 서비스이용 방법에 관한 것으로 할인율에 관계없이 소비자가 원하는 식품과 동 선 위주로 매장을 선택하기 때문이다. 도 4는 본 발명의 소비자의 동선을 고려한 시간대별 지능형 상품 추천 서비스에 신선식품 위탁 판매 서비스 예 시로 앞서 설명한 것과 같이 위탁판매업자는 매장을 열고 있는 시간을 줄임으로써 부수적인 혜택을 얻고, 판매 자는 판매에 대한 수수료를 받을 수 있는 판매방식이다. 상기와 같은 작용효과를 나타내기 위한 과제해결 수단은 하기와 같다. 소비자의 식품 선호도와 동선을 이용하여, 상기 소비자의 동선 주변의 식품 매장들의 식품 종류와 유통기한 및 할인 정보를 DB화하여 상기 소비자에게 식품 및 식품할인 정보를 제공하는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다. 또한, 상기 동선은 소비자의 주중과 주말의 시간대별 이동을 누적하여 동선을 결정하는 것을 특징으로 하는 소 비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다. 또한, 상기 소비자는 식품 및 식품할인 정보를 제공받기 위하여 스마트폰과 같은 스마트단말기에 전용 프로그램 을 설치하여 자주가는 편의점, 마트, 음식점과 같은 매장정보와 출근길 또는 통학길과 같은 동선정보를 입력하 고, 매장을 선택하여 상기 매장에서 메시지 발송 또는 푸시알람 정보를 확인하여, 식품을 구매할 수 있는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다. 또한, 상기 식품 매장은 POS 또는 관리자 스마트폰 등을 통해 유통기한 임박한 상품을 입고 시 또는 시간대 별 로 재고를 파악하여 식품과 유통기한 정보를 업데이트하여 저장하고, 식품을 선택하여 할인율, 할인시점과 같은 식품 판매 정책을 등록 또는 업데이트하고, 상기 소비자가 설치한 전용 프로그램과 연동되도록 메시지 발송 또 는 푸시알람을 통하여 상기 소비자에게 식품의 종류, 구입가능 량, 남은 유통기한 정보를 알리며, 또한, 계절, 날씨. 시간대 별로 상기 소비자의 선호도 정보를 이용하여 다양한 식품 및 상품 정보를 제공하는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다. 또한, 소비자 중심의 구매방법에 있어서, 상기 스마트폰과 같은 스마트단말기에 설치된 전용 프로그램에서 상기 소비자가 원하는 식품과 가격대 및 매장까지의 거리를 입력하면, 상기 소비자의 이동 중에 원하는 조건의 매장 이 나타나면 푸시알람을 발생하는 것을 특징으로 하는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법 을 제공한다. 또한, 생활패턴의 변화와 인건비의 상승으로 일반 식품매장의 오픈시간을 줄이는 것도 새로운 매장의 운영방법 으로 이용될 수 있는 것이어서, 판매자의 매장에 위탁판매를 의뢰받은 식품을 입고하고, 식품별 유통기한을 등 록하고, 상기 위탁판매 식품의 정보를 상기 소비자가 설치한 전용 프로그램과 연동되도록 메시지 발송 또는 푸 시알람을 통하여 상기 소비자에게 식품의 종류, 구입가능 량, 남은 유통기한 정보를 알리는 것을 특징으로 하 는 소비자의 동선을 고려한 시간대별 지능형 상품 추천 기법을 제공한다. 상기 유탕기한이 임박한 식품과 위탁 판매를 위한 식품의 경우 수량이 한정되고 조기 품절될 수 있어 실시간으로 남아 있는 식품의 종류와 개수를 알 수 있도록 별도의 IoT 기능이 있는 냉장고를 구비하여 소비자에 정보를 제공할 수 있다. 일일이 바코드 등을 스 캔하여 냉장고에 보관할 수도 있고, 냉장고 내부를 카메라 등으로 상시 외부에서 확인할 수 있도록 함으로써, 소비자가 입고 및 재고를 확인할 수 있도록 할 수 있다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2020-0081295", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 소비자의 동선을 고려한 시간대별 지능형 상품 추천 서비스 제공 도면 도 2은 본 발명의 판매자 중심의 소비자의 서비스 이용 예시 도 3은 본 발명의 소비자 중심의 서비스 이용 예시 도 4는 본 발명의 소비자의 동선을 고려한 시간대별 지능형 상품 추천 서비스에 신선식품 위탁 판매 서비스 예 시"}
