{"patent_id": "10-2022-0068512", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0112030", "출원번호": "10-2022-0068512", "발명의 명칭": "영상처리장치 및 그의 영상처리방법", "출원인": "한화비전 주식회사", "발명자": "윤성현"}}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "ROI검출부에 의해, 영상센서로부터 입력되는 영상프레임들 중 상기 영상센서의 프레임레이트보다 낮은 객체검출레이트에 따른 일정 간격의 제1영상프레임들로부터 객체데이터를 검출하는 단계;ROI추정부에 의해, 상기 제1영상프레임들의 객체데이터를 기초로 상기 영상프레임들 중 상기 제1영상프레임들외의 제2영상프레임들로부터 객체데이터를 추정하는 단계; 및인코더에 의해, 상기 객체데이터를 기초로 상기 영상센서의 프레임레이트와 동일한 인코딩 프레임레이트로 상기영상프레임들을 인코딩하는 단계;를 포함하는 영상처리장치의 영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 객체데이터는 객체를 포함하는 관심영역의 위치 및 관심영역의 사이즈를 포함하는, 영상처리장치의 영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 객체데이터 추정 단계는,현재 영상프레임의 타임스탬프가 상기 ROI검출부로부터 입력되는 객체데이터의 타임스탬프와 동일하지 않으면,상기 현재 영상프레임 이전에 상기 ROI검출부에 의해 검출된 적어도 하나의 이전 객체데이터를 기초로 상기 현재 영상프레임의 객체데이터를 추정하는 단계;를 포함하는 영상처리장치의 영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 객체데이터 추정 단계는,과거 객체 움직임 벡터가 존재하는 경우, 상기 객체 움직임 벡터와 가중치를 기초로 상기 현재 영상프레임의 객체데이터를 추정하는 단계;를 포함하고, 상기 과거 객체 움직임 벡터는, 상기 ROI검출부에 의해, 한 쌍의 이전 영상프레임들로부터 검출된 객체데이터를기초로 산출된 객체 움직임 벡터인, 영상처리장치의 영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 객체데이터 추정 단계는,과거 객체 움직임 벡터가 존재하지 않는 경우, 이전 객체데이터를 기초로 상기 현재 영상프레임의 객체데이터를추정하는 단계;를 포함하고, 상기 과거 객체 움직임 벡터는 상기 ROI검출부에 의해 한 쌍의 이전 영상프레임들로부터 검출된 객체데이터를기초로 산출된 객체 움직임 벡터이고,상기 이전 객체데이터는 상기 ROI검출부에 의해 검출된 최근의 객체데이터인, 영상처리장치의 영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 인코딩 단계는,양자화 파라미터 및 비트레이트를 제어하며 상기 영상프레임들을 인코딩하는 단계;를 포함하는 영상처리장치의영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0112030-3-제6항에 있어서, 상기 인코딩 단계는,상기 관심영역의 양자화 파라미터 값보다 상기 관심영역 외의 비관심영역의 양자화 파라미터 값을 높게 설정하는 단계; 영상프레임의 사이즈에 대한 상기 관심영역의 사이즈의 비율인 객체 비율을 기초로 산출된 제1비트레이트, 및비트레이트 증가량 또는 양자화 파라미터 증감량을 기초로 제2비트레이트를 결정하는 단계; 및상기 양자화 파라미터 값 및 상기 제2비트레이트 값에 따라 상기 영상프레임들을 압축하는 단계;를 포함하는 영상처리장치의 영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 제1비트레이트는, 상기 객체 비율에 따라, 사용자가 설정한 목표비트레이트의 소정 비율로 결정되는, 영상처리장치의 영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 비트레이트 증가량은, 상기 영상 품질 및 객체 이동도 중 적어도 하나에 따라, 사용자가 설정한 목표비트레이트의 소정 비율로 결정되는, 영상처리장치의 영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 객체 비율은 영상프레임의 사이즈에 대한 이동 객체의 관심영역의 사이즈의 비율인, 영상처리장치의 영상처리방법."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "영상센서로부터 입력되는 영상프레임들 중 상기 영상센서의 프레임레이트보다 낮은 객체검출 레이트에 따른 일정 간격의 제1영상프레임들로부터 객체데이터를 검출하는 ROI검출부;상기 제1영상프레임들의 객체데이터를 기초로 상기 영상프레임들 중 상기 제1영상프레임들 외의 제2영상프레임들로부터 객체데이터를 추정하는 ROI추정부; 및상기 객체데이터를 기초로 상기 영상센서의 프레임레이트와 동일한 인코딩 프레임레이트로 상기 영상프레임들을인코딩하는 인코더;를 포함하는 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 객체데이터는 객체를 포함하는 관심영역의 위치 및 관심영역의 사이즈를 포함하는, 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 ROI추정부는, 현재 영상프레임의 타임스탬프가 상기 ROI검출부로부터 입력되는 객체데이터의 타임스탬프와동일하지 않으면, 상기 현재 영상프레임 이전에 상기 ROI검출부에 의해 검출된 적어도 하나의 이전 객체데이터를 기초로 상기 현재 영상프레임의 객체데이터를 추정하는, 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 ROI추정부는, 과거 객체 움직임 벡터가 존재하는 경우, 상기 객체 움직임 벡터와 가중치를 기초로 상기 현재 영상프레임의 객체데이터를 추정하고, 공개특허 10-2023-0112030-4-상기 과거 객체 움직임 벡터는, 상기 ROI검출부에 의해, 한 쌍의 이전 영상프레임들로부터 검출된 객체데이터를기초로 산출된 객체 움직임 벡터인, 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서, 상기 ROI추정부는, 과거 객체 움직임 벡터가 존재하지 않는 경우, 이전 객체데이터를 기초로 상기 현재 영상프레임의 객체데이터를 추정하고, 상기 과거 객체 움직임 벡터는 상기 객체검출부에 의해 한 쌍의 이전 영상프레임들로부터 검출된 객체데이터를기초로 산출된 객체 움직임 벡터이고,상기 이전 객체데이터는 상기 객체검출부에 의해 검출된 최근의 객체데이터인, 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서, 상기 인코더는, 양자화 파라미터 및 비트레이트를 제어하며 상기 영상프레임들을 인코딩하는, 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 인코더는,상기 관심영역의 양자화 파라미터 값보다 상기 관심영역 외의 비관심영역의 양자화 파라미터 값을 높게 설정하고, 영상프레임의 사이즈에 대한 상기 관심영역의 사이즈의 비율인 객체 비율을 기초로 산출된 제1비트레이트, 및비트레이트 증가량 또는 양자화 파라미터 증감량을 기초로 제2비트레이트를 결정하고,상기 양자화 파라미터 값 및 상기 제2비트레이트 값에 따라 상기 영상프레임들을 압축하는, 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 제1비트레이트는, 상기 객체 비율에 따라, 사용자가 설정한 목표비트레이트의 소정 비율로 결정되는, 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서, 상기 비트레이트 증가량은, 상기 영상 품질 및 객체 이동도 중 적어도 하나에 따라, 사용자가 설정한 목표비트레이트의 소정 비율로 결정되는, 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제17항에 있어서,상기 객체 비율은 영상프레임의 사이즈에 대한 이동 객체의 관심영역의 사이즈의 비율인, 영상처리장치."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 영상처리장치는, 영상센서로부터 입력되는 영상프레임들 중 상기 영상센서의 프레임 레이트보다 낮은 객체검출 레이트에 따른 일정 간격의 제1영상프레임들로부터 객체데이터를 검출하는 ROI검출부; 상기 제1영상프레임들의 객체데이터를 기초로 상기 영상프레임들 중 상기 제1영상프레임들 외의 제2영상프레임들 로부터 객체데이터를 추정하는 ROI추정부; 및 상기 객체데이터를 기초로 상기 영상센서의 프레임레이트와 동일한 인코딩 프레임레이트로 상기 영상프레임들을 인코딩하는 인코더;를 포함한다."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 영상처리장치 및 그의 영상처리방법에 관한 것이다."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어, 방범, 보안, 매장 관리 등 다양한 목적으로 건물 내부나 외부, 길거리 등에 카메라를 설치하는 경우 가 증가하고 있다."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 이동 객체의 검출 정확도를 높이면서 주요 객체 영역의 화질은 유지하고 발생되는 부호화 양을 절감할 수 있는 영상처리장치 및 그의 영상처리방법을 제공한다."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 영상처리장치는, 영상센서로부터 입력되는 영상프레임들 중 상기 영상센서의 프레 임레이트보다 낮은 객체검출 레이트에 따른 일정 간격의 제1영상프레임들로부터 객체데이터를 검출하는 ROI검출 부; 상기 제1영상프레임들의 객체데이터를 기초로 상기 영상프레임들 중 상기 제1영상프레임들 외의 제2영상프 레임들로부터 객체데이터를 추정하는 ROI추정부; 및 상기 객체데이터를 기초로 상기 영상센서의 프레임레이트와 동일한 인코딩 프레임레이트로 상기 영상프레임들을 인코딩하는 인코더;를 포함한다. 상기 객체데이터는 객체를 포함하는 관심영역의 위치 및 관심영역의 사이즈를 포함할 수 있다. 상기 ROI추정부는, 현재 영상프레임의 타임스탬프가 상기 ROI검출부로부터 입력되는 객체데이터의 타임스탬프와 동일하지 않으면, 상기 현재 영상프레임 이전에 상기 ROI검출부에 의해 검출된 적어도 하나의 이전 객체데이터 를 기초로 상기 현재 영상프레임의 객체데이터를 추정할 수 있다. 상기 ROI추정부는, 과거 객체 움직임 벡터가 존재하는 경우, 상기 객체 움직임 벡터와 가중치를 기초로 상기 현 재 영상프레임의 객체데이터를 추정할 수 있다. 상기 과거 객체 움직임 벡터는, 상기 ROI검출부에 의해, 한 쌍 의 이전 영상프레임들로부터 검출된 객체데이터를 기초로 산출된 객체 움직임 벡터일 수 있다. 상기 ROI추정부는, 과거 객체 움직임 벡터가 존재하지 않는 경우, 이전 객체데이터를 기초로 상기 현재 영상프 레임의 객체데이터를 추정할 수 있다. 상기 과거 객체 움직임 벡터는 상기 객체검출부에 의해 한 쌍의 이전 영 상프레임들로부터 검출된 객체데이터를 기초로 산출된 객체 움직임 벡터이고, 상기 이전 객체데이터는 상기 객 체검출부에 의해 검출된 최근의 객체데이터일 수 있다. 상기 인코더는, 양자화 파라미터 및 비트레이트를 제어하며 상기 영상프레임들을 인코딩할 수 있다. 상기 인코더는, 상기 관심영역의 양자화 파라미터 값보다 상기 관심영역 외의 비관심영역의 양자화 파라미터 값 을 높게 설정하고, 영상프레임의 사이즈에 대한 상기 관심영역의 사이즈의 비율인 객체 비율을 기초로 산출된 제1비트레이트, 및 비트레이트 증가량 또는 양자화 파라미터 증감량을 기초로 제2비트레이트를 결정하고, 상기 양자화 파라미터 값 및 상기 제2비트레이트 값에 따라 상기 영상프레임들을 압축할 수 있다. 상기 제1비트레이트는, 상기 객체 비율에 따라, 사용자가 설정한 목표비트레이트의 소정 비율로 결정될 수 있다. 상기 비트레이트 증가량은, 상기 영상 품질 및 객체 이동도 중 적어도 하나에 따라, 사용자가 설정한 목표비트 레이트의 소정 비율로 결정될 수 있다. 상기 객체 비율은 영상프레임의 사이즈에 대한 이동 객체의 관심영역의 사이즈의 비율일 수 있다."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 영상처리장치는 주요 객체의 검출 정확도를 높이면서 주요 객체 영역의 화질은 유지하 고 발생되는 부호화(인코딩) 양을 절감할 수 있다. 또한 본 발명의 실시예에 따른 영상처리장치는 실시간 영상 처리 속도를 높일 수 있다."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 내용은 단지 본 발명의 원리를 예시한다. 그러므로 당업자는 비록 본 명세서에 명확히 설명되거나 도시 되지 않았지만 본 발명의 원리를 구현하고 본 발명의 개념과 범위에 포함된 다양한 장치를 발명할 수 있는 것이다. 또한, 본 명세서에 열거된 모든 조건부 용어 및 실시예들은 원칙적으로, 본 발명의 개념이 이해되도록 하기 위한 목적으로만 명백히 의도되고, 이와 같이 특별히 열거된 실시예들 및 상태들에 제한적이지 않는 것으로 이 해되어야 한다. 또한, 본 발명의 원리, 관점 및 실시예들 뿐만 아니라 특정 실시예를 열거하는 모든 상세한 설 명은 이러한 사항의 구조적 및 기능적 균등물을 포함하도록 의도되는 것으로 이해되어야 한다. 또한, 이러한 균 등물들은 현재 공지된 균등물뿐만 아니라 장래에 개발될 균등물 즉 구조와 무관하게 동일한 기능을 수행하도록 발명된 모든 소자를 포함하는 것으로 이해되어야 한다. 따라서, 프로세서 또는 이와 유사한 개념으로 표시된 기능 블록을 포함하는 도면에 도시된 다양한 소자의 기능 은 전용 하드웨어뿐만 아니라 적절한 소프트웨어와 관련하여 소프트웨어를 실행할 능력을 가진 하드웨어의 사용 으로 제공될 수 있다. 프로세서에 의해 제공될 때, 기능은 단일 전용 프로세서, 단일 공유 프로세서 또는 복수 의 개별적 프로세서에 의해 제공될 수 있고, 이들 중 일부는 공유될 수 있다. 또한, 프로세서, 제어 또는 이와 유사한 개념으로 제시되는 용어의 사용은 소프트웨어를 실행할 능력을 가진 하드웨어를 배타적으로 인용하여 해 석되어서는 아니 되고, 제한 없이 디지털 신호 프로세서(DSP) 하드웨어, 소프트웨어를 저장하기 위한 롬(ROM), 램(RAM) 및 비휘발성 메모리를 암시적으로 포함하는 것으로 이해되어야 한다. 주지 관용의 다른 하드웨어도 포 함될 수 있다. 상술한 목적, 특징 및 장점들은 첨부된 도면과 관련한 다음의 상세한 설명을 통하여 더욱 분명해 질 것이다. 본 발명을 설명함에 있어서, 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다 고 판단되는 경우 그 상세한 설명을 생략하거나 간략하게 설명하는 것으로 한다. 한편, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소 를 제외하는 것이 아니라, 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 발명의 실시예에 따른 '영상(image)'은 정지 영상이거나, 복수의 연속된 프레임들로 구성된 동영상을 포함할 수 있다. 이하, 첨부된 도면을 참조하여 바람직한 실시예에 따른 본 발명을 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 보안 시스템을 개략적으로 나타낸 도면이다. 도 1을 참조하면, 일 실시예에 따른 보안 시스템은 영상처리장치 및 사용자 장치를 포함할 수 있다. 영상처리장치 및 사용자 장치는 유선 및/또는 무선의 네트워크를 통해 연결될 수 있다. 네트워크는 LANs(Local Area Networks), WANs(Wide Area Networks), MANs(Metropolitan Area Networks), ISDNs(Integrated Service Digital Networks) 등의 유선 네트워크와, 3G, 4G(LTE), 5G, 와이파이(WiFi), 와이 브로(Wibro), 와이맥스(Wimax) 등과 같은 무선 인터넷 및 블루투스(Bluetooth), RFID(Radio Frequency Identification), 적외선 통신(IrDA, infrared Data Association), UWB(Ultra Wideband), 지그비(ZigBee), NFC(Near Field Communication) 등의 근거리 통신을 포함하는 무선 네트워크를 포함할 수 있다. 무선 이동 통신 의 경우, 통신 네트워크는 기지국(BTS), 이동교환국(MSC), 홈 위치 등록기(HLR), 무선 패킷 데이터의 송수신을 가능하게 하는 액세스 게이트웨이(Access Gateway), PDSN(Packet Data Serving Node) 등과 같은 구성 요소를 추가로 포함할 수 있다. 본 발명의 범위가 이에 한정되는 것은 아니다. 영상처리장치는 감시 영역을 촬영하여 감시 영역에 대한 영상을 획득하는 카메라일 수 있다. 카메라는 감시 또는 보안의 목적으로 감시 영역을 실시간으로 촬영할 수 있고, 하나 이상 구비될 수 있다. 카메라는 특정 장소 의 고정된 위치에 배치되고, 촬영 범위가 고정된 단일 고정식 카메라 또는 팬(Pan)/틸트(Tilt)/줌(Zoom) 기능을 갖는 PTZ 카메라일 수 있다. 카메라는 비쥬얼 카메라, 열상 카메라, 특수 목적 카메라 등을 포함하는 네트워크 카메라일 수 있다. 사용자 장치는 모니터 단말을 이용하여 영상처리장치로부터 수신한 정보를 모니터링할 수 있다. 사용자 장치는 DVR(Digital Video Recorder), NVR(Network Video Recorder), 서버 등과 같은 다양한 장치로 구성될 수 있다. 이 경우 사용자 장치는 관공서, 경찰서, 병원, 중앙관제소, 중앙통제소, 종합상황실 등에 구축 될 수 있다. 다른 실시예에서, 사용자 장치는 데스크탑 PC(desktop PC), 태블릿 PC(tablet PC), 슬레이트 PC(slate PC), 노트북 컴퓨터(notebook computer), 스마트폰과 같은 휴대용 단말기 등을 포함할 수 있다. 도 2 및 도 3은 일 실시예에 따른 영상처리장치의 구성을 개략적으로 나타낸 도면들이다. 도 4는 일 실시예에 따른 객체데이터의 검출을 설명하는 도면이다. 영상처리장치는 CCD(Charge Coupled Device)나 CMOS(Complementary Metal Oxide Semiconductor) 등의 영상 센서 및 프로세서를 포함할 수 있다. 프로세서는 특정 기능들을 실행하는 다양한 개수의 하드웨 어 또는/및 소프트웨어 구성들로 구현되는 정보처리수단일 수 있다. 예를 들어, 프로세서는 프로그램 내에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로써, 마이크로프 로세서(microprocessor), 중앙처리장치(central processing unit: CPU), 프로세서 코어(processor core), 멀티 프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 도 3을 참조하면, 프로세서는 객체데이터 획득부 및 인코더를 포함할 수 있다. 객체데이터 획득 부는 ROI검출부 및 ROI추정부를 포함할 수 있다. 도 4에 도시된 바와 같이, 프로세서는 영 상센서로부터 소정 프레임레이트(FR1)로 일련의 영상프레임(Frame)들을 수신할 수 있다. 프로세서는 영상프레임에 타임스탬프(TimeStamp)를 생성할 수 있다. 프로세서는 영상센서로부터 수신되는 영상프 레임들 중 객체 검출 레이트(FR2)에 따른 일정 간격의 영상프레임들로부터 객체데이터(Object Data)를 검출할 수 있다. 객체 검출 레이트(FR2)는 영상센서의 프레임레이트(FR1)보다 낮을 수 있다. 예를 들어, 영상센서 의 프레임레이트(FR1)는 30FPS이고, 객체 검출 레이트(FR2)는 10FPS일 수 있다. 객체데이터 획득부는 인코더에서 인코딩될 영상프레임들부터 객체데이터(OD)를 획득할 수 있다. ROI검출부는 영상센서로부터 입력되는 영상프레임들 중 객체 검출 레이트(FR2)에 따른 일정 간격의 영 상프레임들로부터 객체데이터를 검출할 수 있다. ROI검출부는 영상프레임에서 객체를 검출하고, 검출된 객 체를 포함하는 영역을 설정함으로써 관심영역((ROI, region of interest)을 검출할 수 있다. ROI검출부는 인공지능(AI) 기술을 이용하여 영상프레임으로부터 객체를 검출할 수 있다. 관심영역은 영상프레임의 적어도 일 부일 수 있다. ROI검출부는 영상프레임에서 하나 이상의 객체를 검출하고, 하나 이상의 관심영역을 설정할 수 있다. ROI검출부는 관심영역의 위치 및 관심영역의 사이즈를 객체의 객체데이터로서 검출할 수 있다. 이하, ROI검출부에서 객체 검출 알고리즘에 따라 영상프레임에서 검출된 객체의 객체데이터를 제1객체데이 터(ODd)라 한다. 제1객체데이터(ODd)는 관심영역(ROI)의 위치, 관심영역(ROI)의 사이즈, 객체의 유형, 타임스탬프를 포함할 수 있다. 관심영역(ROI)의 위치는 관심영역(ROI)의 좌측 상단 꼭지점 위치 및/또는 중심위치(center position)일 수 있다. 관심영역(ROI)의 사이즈는 관심영역(ROI)의 폭(width) 및 높이(height)를 포함할 수 있다. 객체의 유 형은 검출된 객체가 이동 객체인지 정지 객체인지를 나타내는 정보일 수 있다. 제1객체데이터(ODd)는 하나 이상 의 객체의 객체데이터를 포함할 수 있다. 제1객체데이터(ODd)는 객체의 개수를 포함할 수 있다. ROI검출부는 객체 검출 레이트에 따라 소정 시간 간격으로 입력된 한 쌍의 영상프레임들 각각에서 검출된 동일한 객체의 제1객체데이터로부터 객체 움직임 벡터(OMV: Object Move Vector)를 산출할 수 있다. ROI검출부 는 객체 움직임 벡터(OMV)와 객체 움직임 벡터(OMV)의 사이즈를 산출할 수 있다. 객체 움직임 벡터(OMV)는 한 쌍의 영상프레임들에서 검출된 관심영역들의 중심위치(P)들을 연결하는 벡터일 수 있다."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "OMVji Sizehorozontal = |xj - xi| OMVji Sizevertical = |yj - yi| ... 식 에서 i는 한 쌍의 영상프레임들 중 시간 상 앞선 영상프레임이고, j는 한 쌍의 영상프레임들 중 시간 상 늦은 영상프레임을 나타낼 수 있다. ROI검출부는 식 과 같이, i 영상프레임의 제1객체데이터와 j 영상 프레임의 제1객체데이터로부터 객체 움직임 벡터(OMV: Object Move Vector)를 산출할 수 있다. 여기서, 객체 움직임 벡터(OMV)의 사이즈는 수평방향 사이즈(Sizehorozontal)와 수직방향 사이즈(Sizevertical)를 포함할 수 있다. 수 평방향 사이즈(Sizehorozontal)는 관심영역의 중심위치(P)들의 x축 값들의 차이의 절대값일 수 있다. 수직방향 사이 즈(Sizevertical)는 관심영역의 중심위치(P)들의 y축 값들의 차이의 절대값일 수 있다. ROI검출부는 객체 움직임 벡터(OMV)의 사이즈가 임계값보다 크면 객체를 이동 객체(moving object)로 판단 할 수 있다. 임계값은 객체 움직임 벡터(OMV)의 산출에 이용된 한 쌍의 영상프레임들 중 시간 상 늦은 영상프레 임에서 검출된 관심영역의 사이즈의 소정 비율로 설정될 수 있다. 예를 들어, 임계값은 관심영역의 사이즈의 25%로 설정되고, ROI검출부는 i 영상프레임에서 검출된 관심영역의 중심위치와 j 영상프레임에서 검출된 관심영역의 중심위치로부터 산출된 객체 움직임 벡터(OMVji)의 수평방향 사이즈(Sizehorozontal)와 수직방향 사이즈 (Sizevertical)가 j 영상프레임으로부터 검출된 관심영역의 사이즈의 25%보다 크면, 객체를 이동 객체로 판단할 수 있다. 도 4에는 30FPS로 입력되는 영상프레임들(..., Fn-4, Fn-3, Fn-2, Fn-1, Fn, Fn+1, ...)의 타임스탬프들(..., tsn-4, tsn-3, tsn-2, tsn-1, tsn, tsn+1, ...) 및 10FPS에 따른 영상프레임들(..., Fn-4, Fn-1, ...)로부터 검출된 제1객체데이터(..., ODn-4, ODn-1, ...)를 예시하고 있다. 도 4에는 ROI검출부에 의해 객체데이터 가 검출된 프레임들과 객체데이터가 검출되지 않은 프레임들을 구분하여 도시하고 있다. ROI추정부는 영상센서로부터 영상프레임(Frame)들을 수신하고, ROI검출부로부터 제1객체데이터 (ODd)를 제공받을 수 있다. ROI추정부는 영상센서로부터 입력되는 영상프레임들 중 제1객체데이터가 검출된 영상프레임들 외의 영 상프레임들로부터 객체데이터를 추정할 수 있다. 예를 들어, ROI추정부는 도 4에 도시된 영상프레임들 (..., Fn-4, Fn-3, Fn-2, Fn-1, Fn, Fn+1, ...) 중 객체데이터(..., ODn-4, ODn-1, ...)가 검출되지 않은 영상 프레임들(..., Fn-3, Fn-2, Fn, Fn+1, ...)로부터 객체데이터를 추정할 수 있다. ROI추정부는 적어도 하나의 제1객체데이터를 기초로 영상프레임으로부터 객체데이터를 추정할 수 있다. ROI추정부는 현재 입력되는 영상프레임(이하, '현재 영상프레임'이라 함)의 타임스탬프와 제1객체데이터의 타임스탬프의 동일 여부를 판단할 수 있다. 일 실시예에서 ROI추정부는 현재 영상프레임의 타임스탬프와 ROI검출부로부터 입력되는 제1객체데이터의 타임스탬프를 비교하고, 타임스탬프가 동일하지 않으면 현재 영상프레임으로부터 객체데이터를 추정할 수 있다. ROI추정부는 현재 영상프레임 이전의 영상프레임(이전 영상프레임)들에서 검출된 적어도 하나의 제1객체데이터(이하, '이전 제1객체데이터'라 함)를 기초로 현재 영상 프레임으로부터 객체데이터를 추정할 수 있다. 이하, ROI추정부에서 추정된 객체데이터는 제1객체데이터 (ODd)와 구별하여 제2객체데이터(ODe)로 칭할 수 있다. ROI추정부는 과거 객체 움직임 벡터(Past OMV)가 존재하는 경우, 과거 객체 움직임 벡터(Past OMV)와 가중 치(TW)를 기초로 현재 영상프레임으로부터 객체데이터를 추정할 수 있다. 과거 객체 움직임 벡터(Past OMV)가 존재한다는 것은 현재 영상프레임 이전에 제1객체데이터가 검출된 한 쌍의 이전 영상프레임들이 존재하는 경우 를 의미할 수 있다. 과거 객체 움직임 벡터(Past OMV)는 현재 영상프레임과 가장 가까운 과거의 객체 움직임 벡 터(OMV)로 정의될 수 있다. 가중치(TW)는 현재 영상프레임과 이전 영상프레임들 간의 시간 차가 반영된 값일 수 있다."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "OMTsji = tsi, OMTeji = tsj TWk = (tsk - tsj) / (OMTeij - OMTsij) Pk(x,y) = (OMVij * TWk) + Pj(x,y) widthk = widthj heightk = heightj ... 식 에서, i는 한 쌍의 이전 영상프레임들 중 시간 상 앞선 제1 이전 영상프레임이고, j는 한 쌍의 이전 영상 프레임들 중 시간 상 늦은 제2 이전 영상프레임을 나타낼 수 있다. k는 현재 영상프레임을 나타낼 수 있다.OMVji는 현재 영상프레임에 대한 과거 객체 움직임 벡터(Past OMV)일 수 있다. OMTe와 OMTs는 각각 과거 객체 움직임 벡터(OMVji)의 시작 시간 및 종료 시간을 나타낼 수 있다. ROI추정부는 현재 영상프레임에 대해 과거 객체 움직임 벡터(Past OMV)가 존재하는 경우, 식 와 같이, 현재 영상프레임으로부터 객체데이터를 추정할 수 있다. 추정되는 객체데이터는 관심영역의 위치(Pk) 및 관심영 역의 사이즈인 폭/높이(widthk/heightk)일 수 있다. 관심영역의 위치(Pk)는 객체 움직임 벡터(OMVji)와 가중치 (TWk)의 곱을 제2 이전 영상프레임의 위치(Pj)에 가산한 값일 수 있다. 가중치(TWk)는 현재 영상프레임의 타임스 탬프(tsk)와 제1 이전 영상프레임의 타임스탬프(tsi)의 차를 과거 객체 움직임 벡터(OMVji)의 시작 시간((OMTeij) 및 종료 시간(OMTsij)의 차로 나눈 값일 수 있다. 관심영역의 폭(widthk)은 제2 이전 영상프레임의 폭(widthj)일 수 있다. 관심영역의 높이(heightk)는 제2 이전 영상프레임의 높이(widthj)일 수 있다. ROI추정부는 과거 객체 움직임 벡터(Past OMV)가 존재하지 않는 경우, 이전 제1객체데이터를 기초로 현재 영상프레임으로부터 객체데이터를 추정할 수 있다. 과거 객체 움직임 벡터(Past OMV)가 존재하지 않는다는 것은 하나의 이전 제1객체데이터만 존재하는 경우로서, 현재 영상프레임 이전에 제1객체데이터가 검출된 이전 영상프 레임이 하나 존재하는 경우를 의미할 수 있다. ROI추정부는 현재 영상프레임에 대해 과거 객체 움직임 벡터(Past OMV)가 존재하지 않는 경우, 하기 식 과 같이, 현재 영상프레임으로부터 객체데이터를 추정할 수 있다. 추정되는 객체데이터는 관심영역의 위치 (Pk) 및 관심영역의 사이즈인 폭/높이(widthk/heightk)일 수 있다. 현재 영상프레임의 관심영역의 위치(Pk) 및 폭/높이(widthk/heightk)는 제2 이전 영상프레임의 관심영역의 위치(Pj) 및 폭/높이(widthj/heightj)일 수 있다. Pk(x,y) = Pj(x,y) widthk = widthj heightk = heightj ... ROI추정부는 ROI검출부로부터의 제1객체데이터(ODd) 및 제2객체데이터(ODe)를 인코더로 제공할 수 있다. 인코더는 인코딩 프레임레이트에 따라 영상프레임들을 압축하여 인코딩할 수 있다. 인코딩 프레임레이트는 영상센서의 프레임레이트(FR1)와 동일할 수 있다. 인코더는 양자화 파라미터(quantization parameter, QP) 및/또는 비트레이트를 제어하며 영상프레임들을 인코딩함으로써 대역폭을 제어할 수 있다. 인코더는 영상프레임들의 객체데이터(ODd, ODe)를 기초로 QP 값을 설정할 수 있다. 인코더는 관심영 역과 비관심영역의 QP 값을 다르게 설정할 수 있다. 비관심영역은 관심영역 외의 영역일 수 있다. 인코더 는 관심영역의 상대적인 화질 개선을 위해 QP 값을 설정할 수 있다. 인코더는 비관심영역의 QP 값을 관심 영역의 QP 값보다 높게 설정하여 관심영역의 품질을 비관심영역의 품질보다 높게 설정할 수 있다. 일 실시예에서, 인코더는 관심영역의 QP 값을 사용자가 설정한 기준 QP 값으로 유지하고, 비관심영역의 QP 값을 기준 QP 값보다 소정 크기 증가된 값으로 설정할 수 있다. 예를 들어, 인코더는 관심영역의 QP 값을 기준 QP 값으로 유지하고, 비관심영역의 QP 값을 기준 QP 값보다 4만큼 큰 값으로 설정할 수 있다. 일 실시예에 서, QP 값의 증가량은 품질 정도에 따라 미리 결정된 고(H)/중(M)/저(L) 값들 중 하나로 선택될 수 있다. 비관 심영역의 QP 값을 관심영역의 QP 값보다 크게 설정함으로써 비관심영역의 압축률을 높여 대역폭을 줄일 수 있다. 다른 실시예에서, 인코더는 비관심영역의 QP 값을 사용자가 설정한 기준 QP 값으로 유지하고, 관심영역의 QP 값을 기준 QP 값보다 소정 크기 감소된 값으로 설정할 수 있다. 인코더는 객체데이터를 기초로 비트레이트를 제어할 수 있다. 일 실시예에서 인코더는 시간 단위로 비트레이트를 제어할 수 있다. 예를 들어, 인코더는 소정 기간 동안(예를 들어, 1초 동안)의 영상프레임들 의 객체데이터를 기초로 비트레이트를 제어할 수 있다. 다른 실시예에서 인코더는 영상프레임 단위로 비트 레이트를 제어할 수 있다. 예를 들어, 인코더는 영상프레임마다 객체데이터를 기초로 비트레이트를 제어할 수 있다. 인코더는 객체 비율을 기초로 목표비트레이트의 소정 비율(%)로 제1비트레이트를 산출할 수 있다. 객체 비 율(Ratio)은 영상프레임 사이즈 대비 관심영역 사이즈의 비율일 수 있다. 일 실시예에서, 관심영역의 사이즈는 이동 객체에 대한 관심영역의 사이즈일 수 있다. 이동 객체는 하나 이상일 수 있고, 객체 비율 산출을 위한 관 심영역의 사이즈는 모든 이동 객체의 관심영역들의 사이즈의 총합일 수 있다. 목표 비트레이트(Targetbps)는 사 용자 설정 값일 수 있다. 하기는 객체 비율(Ratio)에 따른 제1비트레이트(Targetbps')의 예시이다. 예를 들어, 영상프레임 사이즈 대비 관심영역 사이즈가 3% 미만이면, 제1비트레이트(Targetbps')는 목표 비트레이트 (Targetbps)의 20%로 결정될 수 있다. If Ratio < 3[%] then Targetbps' = 20[%] of Targetbps, Else if Ratio < 11[%] then Targetbps' = 30[%] of Targetbps, Else if Ratio < 21[%] then Targetbps' = 40[%] of Targetbps, Else if Ratio < 31[%] then Targetbps' = 50[%] of Targetbps, Else if Ratio < 41[%] then Targetbps' = 60[%] of Targetbps, Else if Ratio < 51[%] then Targetbps' = 70[%] of Targetbps, Else Targetbps' = 100[%] of Targetbps 인코더는 비트레이트 증가량 산출에 의한 목표 비트레이트 증가 방식으로 비트레이트를 제어할 수 있다. 인코더는 영상 품질 및 객체 이동도 중 적어도 하나를 기초로 비트레이트 증가량을 산출할 수 있다. 비트 레이트 증가량(AddBps)은 목표 비트레이트(Targetbps)의 소정 비율(%)로 결정될 수 있다. 일 실시예에서, 인코더는 영상 품질에 따라 비트레이트 증가량(AddBps)을 설정할 수 있다. 예를 들어, 비 트레이트 증가량(AddBps)은 품질 정도에 따라 목표 비트레이트(Targetbps)의 0%/10%/20%와 같이 미리 결정된 고 (H)/중(M)/저(L) 값들 중 하나로 선택될 수 있다. 다른 실시예에서, 비트레이트 증가량(AddBps)은 객체 이동도에 따라 비트레이트 증가량(AddBps)을 설정할 수 있 다. 객체 이동도는 하나의 영상프레임 또는 소정 기간 동안의 영상프레임들에서 전체 객체들 중 이동 객체의 비 율을 기초로 결정될 수 있다. 예를 들어, 비트레이트 증가량(AddBps)은 객체가 정지 객체(비이동체)이거나 정지 객체의 비율이 높으면, 목표 비트레이트(Target bps)의 0%로 결정되고, 객체가 이동 객체이거나 이동 객체의 비 율이 높으면 목표 비트레이트(Target bps)의 10%로 결정될 수 있다. 객체 이동도에 따라 비트레이트 증가량 (AddBps)을 설정함으로써 이동 객체에 의한 화질 열화를 방지할 수 있다. 일 실시예에서, 인코더는 영상 품질 및 객체 이동도 중 하나를 기초로 비트레이트 증가량을 산출할 수 있 다. 다른 실시예에서, 인코더는 영상 품질 및 객체 이동도 각각에 의해 산출된 비트레이트 증가량을 합산 할 수 있다. 다른 실시예에서, 인코더는 영상 품질 및 객체 이동도 각각에 의해 산출된 비트레이트 증가량 들 중 하나 또는 평균을 비트레이트 증가량으로 산출할 수 있다. 인코더는 QP 증감량에 의해 QP 값을 증감함으로써 비트레이트를 제어할 수 있다. 인코더는 영상 품질 및 객체 이동도 중 적어도 하나를 기초로 QP 증감량을 산출할 수 있다. QP 증감량은 최소 QP 값 내지 최대 QP 값 범위 내에서 설정될 수 있다. 비트레이트 증가량 및/또는 QP 증감량을 이용한 비트레이트 제어에 의해 영상 품질이 제어될 수 있다. 인코더는 제1비트레이트(Targetbps')와 비트레이트 증가량(AddBps)의 합인 제2비트레이트를 최종 비트레이 트로서 설정할 수 있다. 제1비트레이트(Targetbps')와 비트레이트 증가량(AddBps)은 목표 비트레이트를 기초로 산출될 수 있다. 인코더는 제1비트레이트(Targetbps')가 QP 증감량에 따라 증감된 제2비트레이트를 최종 비트레이트로서 설정할 수 있다. 인코더는 설정된 QP 값 및/또는 최종 비트레이트 값을 이용하여 영상프레임들을 압축하여 인코딩(부호화) 할 수 있다. 도 5는 일 실시예에 따른 영상처리장치의 객체데이터의 추정을 설명하는 도면이다. 도 5에 도시된 바와 같이, 영상센서로부터 프레임레이트(FR1)에 따라 순차적으로 제1 내지 제5영상프레임들 (Frame01, Frame02, Frame03, Frame04, Frame05)이 생성되어 프로세서로 입력될 수 있다. ROI검출부는 제1 내지 제5영상프레임들(Frame01, Frame02, Frame03, Frame04, Frame05) 중 객체 검출 레 이트(FR2)에 따른 일정 간격의 영상프레임들로부터 객체데이터를 검출할 수 있다. 예를 들어, ROI검출부는 제1영상프레임(Frame01)과 제4영상프레임(Frame04))으로부터 각각 객체데이터(OD01)와 객체데이터(OD04)를 검출 할 수 있다. 제1영상프레임(Frame01)의 객체데이터(OD01)는 관심영역(ROI)의 중심위치(P01), 사이즈 정보로서 폭/높이(width01/height01), 타임스탬프(ts01)를 포함할 수 있다. 제4영상프레임(Frame04)의 객체데이터(OD04)는 관심영역(ROI)의 중심위치(P04), 폭/높이(width04/height04), 타임스탬프(ts04)를 포함할 수 있다. ROI추정부는 ROI검출부가 생성한 제1영상프레임(Frame01)의 객체데이터(OD01)와 제4영상프레임 (Frame04)의 객체데이터(OD04)를 기초로 제2영상프레임(Frame02), 제3영상프레임(Frame03) 및 제5영상프레임 (Frame05)의 객체데이터를 추정할 수 있다. ROI추정부는 검출된 객체데이터(ODd)(제1객체데이터) 및 추정 된 객체데이터(ODe)(제2객체데이터)를 인코더로 제공할 수 있다. ROI추정부는 제1영상프레임(Frame01)이 현재 영상프레임으로 입력되면, 제1영상프레임(Frame01)의 타임스 탬프(ts01)를 ROI검출부로부터 제공되는 제1영상프레임(Frame01)의 객체데이터(OD01)의 타임스탬프(ts01)와 비교할 수 있다. ROI추정부는 타임스탬프(ts01)가 동일하므로, ROI검출부로부터의 제1영상프레임 (Frame01)의 객체데이터(OD01)를 인코더로 전달할 수 있다. ROI추정부는 제2영상프레임(Frame02)이 현재 영상프레임으로 입력되면, 제2영상프레임(Frame02)의 타임스 탬프(ts02)를 ROI검출부로부터 제공되는 제1영상프레임(Frame01)의 객체데이터(OD01)의 타임스탬프(ts01)와 비교할 수 있다. ROI추정부는 타임스탬프(ts02)와 타임스탬프(ts01)가 상이하므로, 제2영상프레임(Frame0 2)으로부터 객체데이터를 추정할 수 있다. ROI추정부는 제2영상프레임(Frame02) 이전에 제1영상프레임 (Frame01)의 객체데이터(OD01)만 존재하므로, 식 에 따라 제2영상프레임(Frame02)의 객체데이터(OD02)를 추 정할 수 있다. ROI추정부는 제2영상프레임(Frame02)과 유사하게 제3영상프레임(Frame03)의 객체데이터 (OD02)를 추정할 수 있다. 하기 식 는 식 에 따라 제2영상프레임(Frame02)의 객체데이터(OD02)와 제3영상 프레임(Frame03)의 객체데이터(OD03)를 추정한 결과이다. P02(x,y) = P03(x,y) = P01(x,y) width02 = width03 = width01 height02 = height03 = height01 ... ROI추정부는 제4영상프레임(Frame04)이 현재 영상프레임으로 입력되면, 제4영상프레임(Frame04)의 타임스 탬프(ts04)를 ROI검출부로부터 제공되는 제4영상프레임(Frame04)의 객체데이터(OD04)의 타임스탬프(ts04)와 비교할 수 있다. ROI추정부는 타임스탬프(ts04)가 동일하므로, ROI검출부로부터의 제4영상프레임 (Frame04)의 객체데이터(OD04)를 인코더로 전달할 수 있다. ROI추정부는 제5영상프레임(Frame05)이 현재 영상프레임으로 입력되면, 제5영상프레임(Frame05)의 타임스 탬프(ts05)를 제4영상프레임(Frame04)의 객체데이터(OD04)의 타임스탬프(ts04)와 비교할 수 있다. ROI추정부 는 타임스탬프(ts05)와 타임스탬프(ts04)가 상이하므로, 제5영상프레임(Frame05)으로부터 객체데이터를 추 정할 수 있다. ROI추정부는 제5영상프레임(Frame05) 이전에 제1영상프레임(Frame01)의 객체데이터(OD01)와 제4영상프레임(Frame04)의 객체데이터(OD04)를 기초로 생성된 과거 객체 움직임 벡터(OMV41)가 존재하므로, 식 에 따라 제5영상프레임(Frame05)의 객체데이터(OD05)를 추정할 수 있다. 도시되지 않았으나, ROI추정부(10 4)는 제5영상프레임(Frame05)과 유사하게 제6영상프레임(Frame06)의 객체데이터(OD06)를 추정할 수 있다. 하기 식 는 식 에 따라 제5영상프레임(Frame05)의 객체데이터(OD05)와 제6영상프레임(Frame06)의 객체데이터 (OD06)를 추정한 결과이다."}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "OMTs41 = ts01, OMTe41 = ts04 TW05 = (ts05- ts04) / (OMTe41 - OMTs41) TW06 = (ts06- ts04) / (OMTe41 - OMTs41) P05(x,y) = (OMV41 * TW05) + P04(x,y) P06(x,y) = (OMV41 * TW06) + P04(x,y) width05 = width06 = width04 height05 = height06 = height04 ... 도 6 및 도 7은 일 실시예에 따른 영상처리장치의 영상처리방법을 개략적으로 설명하는 흐름도들이다. 이하 도 1 내지 도 5를 참조하여 설명한 내용과 중복하는 내용의 상세한 설명은 생략한다. 영상처리장치는 영상센서로부터 영상센서의 프레임레이트에 따라 일련의 영상프레임들을 수신할 수 있다(S61). 영상처리장치는 영상프레임의 타임스탬프를 생성할 수 있다. 영상처리장치는 수신한 영상프레임들 중 객체 검출 레이트에 따른 일정 간격의 영상프레임들로부터 객체데 이터를 검출할 수 있다(S63). 객체 검출 레이트는 영상센서의 프레임레이트보다 낮을 수 있다. 영상처리장 치는 영상프레임으로부터 적어도 하나의 객체를 검출하고, 객체를 포함하는 관심영역((ROI)을 설정하고, 제 1객체데이터를 검출할 수 있다. 일 실시예에서, 영상처리장치는 인공지능(AI) 기술을 이용하여 영상프레임 으로부터 객체를 검출할 수 있다. 제1객체데이터는 관심영역(ROI)의 위치 및 관심영역의 사이즈를 포함할 수 있다. 관심영역(ROI)의 위치는 관심 영역(ROI)의 좌측 상단 꼭지점 위치 또는 중심 위치일 수 있다. 관심영역(ROI)의 사이즈는 관심영역(ROI)의 폭 및 높이를 포함할 수 있다. 제1객체데이터는 객체가 검출된 영상프레임의 타임스탬프, 객체의 움직임 정도, 객 체의 개수를 더 포함할 수 있다. 영상처리장치는 객체 움직임 벡터(OMV)를 기초로 객체가 이동 객체인지를 판단하여 객체의 움직임 정도를 검출할 수 있다. 영상처리장치는 수신한 영상프레임들 중 객체데이터가 검출되지 않은 영상프레임들로부터 객체데이터를 추 정할 수 있다(S65). 영상처리장치는 영상센서로부터 입력되는 현재 영상프레임의 타임스탬프가 제1객체 데이터의 타임스탬프와 상이하면, 적어도 하나의 이전 제1객체데이터를 기초로 현재 영상프레임으로부터 객체데 이터를 추정할 수 있다. 영상처리장치는 과거 객체 움직임 벡터(Past OMV)가 존재하는 경우, 과거 객체 움직임 벡터(Past OMV)와 가 중치(TW)를 기초로 현재 영상프레임으로부터 객체데이터를 추정할 수 있다(식 참조). 영상처리장치는 과거 객체 움직임 벡터(Past OMV)가 존재하지 않는 경우, 이전 제1객체데이터를 기초로 현재 영상프레임으로부 터 객체데이터를 추정할 수 있다. 영상처리장치는 제1객체데이터 및 추정된 객체데이터(제2객체데이터)를 기초로 영상센서로부터 입력되 는 영상프레임들을 인코딩 프레임레이트로 압축함으로써 인코딩할 수 있다(S67). 인코딩 프레임레이트는 영상센 서의 프레임레이트와 동일할 수 있다. 영상처리장치는 양자화 파라미터 및/또는 비트레이트를 제어하여 영상프레임들을 인코딩함으로써 대역폭을 제어할 수 있다. 영상처리장치는 객체데이터를 기초로 QP 값을 제어할 수 있다(S672). 영상처리장치는 관심영역의 양자화 파라미터 값보다 비관심영역의 양자화 파라미터 값을 높게 설정할 수 있다. 영상처리장치 는 객체데이터를 기초로 비트레이트 값을 제어할 수 있다(S674). 영상처리장치는 객체 비율을 기초로 제1비트레이트를 산출하고, 영상 품질 및 객체 이동도 중 적어도 하나를 기초로 비트레이트 증가량을 산출할 수 있다. 영상처리장치는 제1비트레이트와 비트레이트 증가량의 합인 제2비트레이트를 최종 비트레이트로서 설 정할 수 있다. 영상처리장치는 영상 품질 및 객체 이동도 중 적어도 하나를 기초로 QP 증감량을 산출할 수 있다. 영상처리장치는 제1비트레이트가 QP 증감량에 따라 증감된 제2비트레이트를 최종 비트레이트로서 설 정할 수 있다. 인코더는 설정된 QP 값 및/또는 최종 비트레이트 값을 이용하여 영상프레임들을 압축하여 인코딩할 수 있다. 본 발명의 실시예들에 따른 영상처리장치는 객체의 검출 정확도를 높이면서 실시간 영상처리 속도를 높일 수 있 다. 또한 본 발명의 실시예들에 따른 영상처리장치는 객체 및 관심영역을 이용한 양자화 파라미터 및 비트레이트를 제어하며 영상을 인코딩함으로써 대역폭을 효과적으로 제어할 수 있다. 본 발명에 따른 영상처리장치의 영상처리방법은 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드 로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의해 읽혀질 수 있는 데이터 가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광데이터 저장장치 등이 있다. 또한, 컴퓨터가 읽을 수 있는 기록매체는 네트워크 로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고, 본 발명을 구현하기 위한 기능적인(functional) 프로그램, 코드 및 코드 세그먼트들은 본 발명이 속하"}
{"patent_id": "10-2022-0068512", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 본 발명은 첨부된 도면에 도시된 일 실시예를 참고로 설명되었으나, 이는 예시적인 것에 불과하며, 당해 기술분 야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 수 있 을 것이다. 따라서, 본 발명의 진정한 보호 범위는 첨부된 청구 범위에 의해서만 정해져야 할 것이다."}
{"patent_id": "10-2022-0068512", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 보안 시스템을 개략적으로 나타낸 도면이다. 도 2 및 도 3은 일 실시예에 따른 영상처리장치의 구성을 개략적으로 나타낸 도면들이다. 도 4는 일 실시예에 따른 객체데이터의 검출을 설명하는 도면이다. 도 5는 일 실시예에 따른 영상처리장치의 객체데이터의 추정을 설명하는 도면이다. 도 6 및 도 7은 일 실시예에 따른 영상처리장치의 영상처리방법을 개략적으로 설명하는 흐름도들이다."}
