{"patent_id": "10-2011-0090331", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2013-0026886", "출원번호": "10-2011-0090331", "발명의 명칭": "컨설팅 서비스 제공 시스템 및 방법", "출원인": "연세대학교 산학협력단", "발명자": "임춘성"}}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "완성된 컨설팅을 제공하기 위한 컨설팅 방법론으로부터 분할되는 컨설팅 모듈들을 독립적으로 저장하는 컨설팅모듈 데이터베이스;사용자의 컨설팅 요청 정보에 매칭되는 컨설팅 모듈들을 상기 컨설팅 모듈 데이터베이스로부터 추출하는 매칭컨설팅 모듈 추출부; 상기 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 컨설팅 모듈들을 그룹핑한 클러스터를 형성하고상기 클러스터를 연결하며, 연결된 클러스터들에 속한 컨설팅 모듈들을 조합하여 컨설팅 방법론들을 생성하는컨설팅 방법론 생성부를 포함하는 것을 특징으로 하는 컨설팅 서비스 제공 시스템."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 컨설팅 모듈 데이터베이스에는 상기 컨설팅 모듈들과 관련하여 각 컨설팅 모듈의 목표와 연관된 제1 속성정보 및 각 컨설팅 모듈의 개별적 속성과 연관된 제2 속성 정보가 함께 저장되는 것을 특징으로 하는 컨설팅 서비스 제공 시스템."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 컨설팅 방법론 생성부는 상기 매칭 컨설팅 추출부로부터 추출된 컨설팅 모듈들을 같은 입력 및 출력을 가지는 컨설팅 모듈별로 그룹핑한 대모듈을 형성하는 것을 특징으로 하는 컨설팅 서비스 제공 시스템."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 컨설팅 방법론 생성부는 사용자의 컨설팅 목표와 매칭되는 출력을 가지는 대모듈들을 그룹핑하여 제1 클러스터를 형성하는 것을 특징으로 하는 컨설팅 서비스 제공 시스템."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 컨설팅 방법론 생성부는 상기 제1 클러스터의 입력들과 매칭되는 출력을 가진 대모듈들로 그룹핑되고 상기제1 클러스터와 연결되는 제2 클러스터를 형성하고 동일한 방식에 의해 매칭되는 출력을 가진 대모듈이 존재하지 않을 때까지 제N 클러스터를 형성 및 연결하는 것을 특징으로 하는 컨설팅 서비스 제공 시스템."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제1 내지 제N 클러스터로부터 서로 입출력이 연결관계에 있는 대모듈간 연결을 수행하고 연결 관계에 있는각 대모듈로부터 하나의 컨설팅 모듈을 선택하여 컨설팅 방법론들을 생성하는 것을 특징으로 하는 컨설팅 서비스 제공 시스템."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 컨설팅 방법론 생성부에 의해 생성된 컨설팅 방법론들과 상기 사용자의 요청 정보와의 유사도를 연산하는컨설팅 방법론 추출부를 더 포함하는 것을 특징으로 하는 컨설팅 서비스 제공 시스템.공개특허 10-2013-0026886-3-청구항 8 제7항에 있어서,상기 사용자의 요청 정보에는 사용자가 원하는 컨설팅에 대한 키워드 정보가 포함되며, 상기 컨설팅 방법론 추출부는 사용자에 의해 가중치가 조정된 상기 키워드 정보에 기초하여 상기 유사도를 연산하는 것을 특징으로 하는 컨설팅 서비스 제공 시스템."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "완성된 컨설팅을 제공하기 위한 컨설팅 방법론으로부터 분할되는 컨설팅 모듈들을 독립적으로 저장하는 컨설팅모듈 데이터베이스;사용자의 컨설팅 요청 정보에 매칭되는 컨설팅 모듈들을 상기 컨설팅 모듈 데이터베이스로부터 추출하는 매칭컨설팅 모듈 추출부; 상기 매칭 컨설팅 모듈 추출부에 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 상기 컨설팅 모듈들을 연결함으로써 컨설팅 방법론들을 생성하는 컨설팅 방법론 생성부를 포함하는 것을 특징으로 하는 컨설팅 서비스 제공 시스템."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "완성된 컨설팅을 제공하기 위한 컨설팅 방법론으로부터 분할되는 컨설팅 모듈들이 독립적으로 저장된 데이터베이스로부터 사용자의 컨설팅 요청 정보에 매칭되는 컨설팅 모듈들을 추출하는 단계(a);상기 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 컨설팅 모듈들을 그룹핑한 클러스터를 형성하고입출력 관계를 이용하여 클러스터를 연결하는 단계(b); 및상기 연결된 클러스터들에 속한 컨설팅 모듈들을 조합하여 컨설팅 방법론을 생성하는 단계(c)를 포함하는 것을특징으로 하는 컨설팅 서비스 제공 방법."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 단계(b)는 상기 추출된 컨설팅 모듈들을 같은 입력 및 출력을 가지는 컨설팅 모듈별로 그룹핑한 대모듈을형성하는 단계를 포함하는 것을 특징으로 하는 컨설팅 서비스 제공 방법."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 단계(b)는 사용자의 컨설팅 목표와 매칭되는 출력을 가지는 대모듈들을 그룹핑하여 제1 클러스터를 형성하는 단계를 더 포함하는 것을 특징으로 하는 컨설팅 서비스 제공 방법."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 단계(b)는 상기 제1 클러스터의 입력들과 매칭되는 출력을 가진 대모듈들로 그룹핑되고 상기 제1 클러스터와 연결되는 제2 클러스터를 형성하고 동일한 방식에 의해 매칭되는 출력을 가진 대모듈이 존재하지 않을 때까지 제N 클러스터를 형성 및 연결하는 단계를 더 포함하는 것을 특징으로 하는 컨설팅 서비스 제공 방법."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 단계(c)는 상기 제1 내지 제N 클러스터로부터 서로 입출력이 연결관계에 있는 대모듈간 연결을 수행하고연결 관계에 있는 각 대모듈로부터 하나의 컨설팅 모듈을 선택하여 컨설팅 방법론들을 생성하는 것을 특징으로공개특허 10-2013-0026886-4-하는 컨설팅 서비스 제공 방법."}
{"patent_id": "10-2011-0090331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항 내지 14항의 방법을 실행하기 위한 명령어들의 조합이 기록되어 있으며 디지털 데이터 처리 장치에 의해판독 가능한 프로그램을 기록한 기록 매체.명 세 서기 술 분 야본 발명의 실시예들은 컨설팅 서비스에 관한 것으로서, 더욱 상세하게는 융합 기술을 이용한 컨설팅 서비스 제 [0001]공 시스템 및 방법에 관한 것이다.배 경 기 술경영환경이 급변함에 따라 선진기업을 벤치마킹하고 경영문제 해결을 위한 지식 서비스를 제공하는 컨설팅에 대 [0002]한 수요가 지속적으로 증가하고 있다.컨설팅(consulting)이란 일정한 자격을 갖춘 전문가가 선진적인 방법론을 활용하여 기업이 당면한 문제를 진단 [0003]하고 분석하여 기업에 적합한 해결방안을 제시해주는 자문 서비스를 의미한다컨설팅 산업은 전문적인 지식과 경험을 제공하는 고도의 지식·정보 집약적 산업이라고 할 수 있다. 따라서 컨 [0004]설팅 산업에서는 다양한 의사결정문제에 적합한 컨설팅 방법론을 개발, 저장하고 재활용하는 것이 주요한 경쟁전략이 되고 있다.충분한 능력의 전문가 풀을 가진 대형 컨설팅 업체는 기업이 직면한 문제에 대해 해결 가능한 ‘컨설팅 방법론 [0005]’을 제공하는 것이 가능하나 중소 컨설팅 업체들은 규모의 영세성 및 전문성 부족 등으로 인해 경쟁력 있는 고유의 ‘컨설팅 방법론’을 제시하는 것이 실질적으로 어려운 환경에 있다. 이러한 한계점은 컨설팅 서비스 제공자의 지식 역량 수준 저하로 이어지며 연쇄적으로 시장에서의 경쟁력 또한 [0006]저하되고 있는 실정이다. 한편, 지식경영시스템(knowledge management systems, KMS) 분야에 인공지능 기법들을 응용하려는 시도들이 빈 [0007]번하게 이루어지고 있다. 이러한 인공지능 기법들이 많이 사용되는 원인으로 우선 지식 사용자들이 지식을 검색및 추출하기 위해 현존하는 모든 지식 자원을 확인하기가 어렵고, 설령 필요한 모든 자원들을 인지하더라도 시간적 제약 등을 이유로 해당 지식으로부터 필요한 지식을 찾아 맞춤화된 지식으로 생성하기란 매우 어렵다는 점을 들 수 있다이렇듯 최근 다양한 인공지능 기법들이 지식경영시스템에 접목되고 있는데, 그 중에서도 사례기반추론은 다른 [0008]기법에 비해 비교적 단순하게 맞춤화된 지식을 추출해 내기 때문에 최근 지식경영시스템에 사례기반추론을 도입한 연구가 많이 발표되고 있으며, 컨설팅 산업에서도 이러한 움직임이 많이 나타나고 있다그러나, 지금까지 연구된 사례기반추론기법은 컨설팅이 가지는 특성에 대한 고려가 미흡하였고 사용자의 선호체 [0009]계를 반영한 결과의 추출이 어려운 문제점이 있었다.발명의 내용해결하려는 과제상기한 바와 같은 종래 기술의 문제점을 해결하기 위해 본 발명에서는 중소 컨설팅 업체에서도 완성된 컨설팅 [0010]방법론의 제공이 가능하도록 컨설팅 방법론을 생성할 수 있는 컨설팅 서비스 제공 시스템 및 방법을 제안한다. 또한, 본 발명은 컨설팅 모듈들의 재조합을 통해 새로운 컨설팅 방법론의 생성이 가능한 컨설팅 서비스 제공 시 [0011]스템 및 방법을 제안한다. 아울러, 본 발명은 사례 기반 추론 기법을 적용하여 사용자에게 적합한 컨설팅 방법론을 제공할 수 있는 컨설팅 [0012]서비스 제공 시스템 및 방법을 제안한다.과제의 해결 수단공개특허 10-2013-0026886-5-상기한 목적을 달성하기 위해 본 발명의 바람직한 일실시예에 따르면, 완성된 컨설팅을 제공하기 위한 컨설팅 [0013]방법론으로부터 분할되는 컨설팅 모듈들을 독립적으로 저장하는 컨설팅 모듈 데이터베이스; 사용자의 컨설팅 요청 정보에 매칭되는 컨설팅 모듈들을 상기 컨설팅 모듈 데이터베이스로부터 추출하는 매칭 컨설팅 모듈 추출부;상기 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 컨설팅 모듈들을 그룹핑한 클러스터를 형성하고상기 클러스터를 연결하며, 연결된 클러스터들에 속한 컨설팅 모듈들을 조합하여 컨설팅 방법론들을 생성하는컨설팅 방법론 생성부를 포함하는 컨설팅 서비스 제공 시스템이 제공된다. 상기 컨설팅 모듈 데이터베이스에는 상기 컨설팅 모듈들과 관련하여 각 컨설팅 모듈의 목표와 연관된 제1 속성 [0014]정보 및 각 컨설팅 모듈의 개별적 속성과 연관된 제2 속성 정보가 함께 저장된다. 상기 컨설팅 방법론 생성부는 상기 매칭 컨설팅 추출부로부터 추출된 컨설팅 모듈들을 같은 입력 및 출력을 가 [0015]지는 컨설팅 모듈별로 그룹핑한 대모듈을 형성한다. 상기 컨설팅 방법론 생성부는 사용자의 컨설팅 목표와 매칭되는 출력을 가지는 대모듈들을 그룹핑하여 제1 클러 [0016]스터를 형성한다. 상기 컨설팅 방법론 생성부는 상기 제1 클러스터의 입력들과 매칭되는 출력을 가진 대모듈들로 그룹핑되고 상기 [0017]제1 클러스터와 연결되는 제2 클러스터를 형성하고 동일한 방식에 의해 매칭되는 출력을 가진 대모듈이 존재하지 않을 때까지 제N 클러스터를 형성 및 연결한다. 상기 제1 내지 제N 클러스터로부터 서로 입출력이 연결관계에 있는 대모듈간 연결을 수행하고 연결 관계에 있는 [0018]각 대모듈로부터 하나의 컨설팅 모듈을 선택하여 컨설팅 방법론들을 생성한다. 상기 컨설팅 제공 시스템은 상기 컨설팅 방법론 생성부에 의해 생성된 컨설팅 방법론들과 상기 사용자의 요청 [0019]정보와의 유사도를 연산하는 컨설팅 방법론 추출부를 더 포함할 수 있다. 상기 사용자의 요청 정보에는 사용자가 원하는 컨설팅에 대한 키워드 정보가 포함되며, 상기 컨설팅 방법론 추 [0020]출부는 사용자에 의해 가중치가 조정된 상기 키워드 정보에 기초하여 상기 유사도를 연산한다. 본 발명의 다른 측면에 따르면, 완성된 컨설팅을 제공하기 위한 컨설팅 방법론으로부터 분할되는 컨설팅 모듈들 [0021]을 독립적으로 저장하는 컨설팅 모듈 데이터베이스; 사용자의 컨설팅 요청 정보에 매칭되는 컨설팅 모듈들을 상기 컨설팅 모듈 데이터베이스로부터 추출하는 매칭 컨설팅 모듈 추출부; 상기 매칭 컨설팅 모듈 추출부에 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 상기 컨설팅 모듈들을 연결함으로써 컨설팅 방법론들을생성하는 컨설팅 방법론 생성부를 포함하는 컨설팅 서비스 제공 시스템이 제공된다. 본 발명의 또 다른 측면에 따르면, 완성된 컨설팅을 제공하기 위한 컨설팅 방법론으로부터 분할되는 컨설팅 모 [0022]듈들이 독립적으로 저장된 데이터베이스로부터 사용자의 컨설팅 요청 정보에 매칭되는 컨설팅 모듈들을 추출하는 단계(a); 상기 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 컨설팅 모듈들을 그룹핑한 클러스터를 형성하고 입출력 관계를 이용하여 클러스터를 연결하는 단계(b); 및 상기 연결된 클러스터들에 속한 컨설팅 모듈들을 조합하여 컨설팅 방법론을 생성하는 단계(c)를 포함하는 컨설팅 서비스 제공 방법이 제공된다.발명의 효과본 발명에 의하면, 중소 컨설팅 업체에서도 완성된 컨설팅 방법론의 제공이 가능하도록 컨설팅 방법론을 생성할 [0023]수 있는 장점이 있으며, 컨설팅 모듈들의 재조합을 통해 새로운 컨설팅 방법론의 생성이 가능한 장점이 있다.도면의 간단한 설명도 1은 본 발명의 일 실시예에 따른 컨설팅 방법론과 컨설팅 모듈과의 관계를 도시한 도면. [0024]도 2는 본 발명의 일 실시예에 따른 컨설팅 제공 시스템의 구성을 도시한 도면.도 3은 본 발명의 일 실시예에 따른 컨설팅 모둘 데이터베이스의 필드 구성을 도시한 도면.도 4는 본 발명의 일 실시예에 따라 추출된 컨설팅 모듈들을 대모듈 단위로 그룹핑하는 예를 도시한 도면.도 5는 본 발명의 일 실시예에 따라 컨설팅 목표 정보에 매칭되는 대모듈을 그룹핑하는 일례를 도시한 도면.도 6은 도 5의 제1 클러스터를 구성하는 대모듈들과 연결되는 대모듈들을 그룹핑하여 제2 클러스터를 형성하는예를 도시한 도면.공개특허 10-2013-0026886-6-도 7은 클러스터링 과정에서 발생할 수 있는 중복되는 대모듈을 제거하는 일례를 도시한 도면.도 8은 도 7의 제2 클러스터와 연결되는 제3 클러스터를 형성하는 일례를 도시한 도면.도 9는 사용자가 입력한 특정 키워드와 생성된 컨설팅 방법론들과의 유사도를 비교한 결과를 표로 도시한 도면.도 10은 사용자가 ‘대상 규모’에 대한 가중치를 0.25에서 0.6으로 변경하였을 경우의 유사도 연산 결과를 도시한 표로 도시한 도면. 도 11은 본 발명의 일 실시예에 따른 컨설팅 서비스 제공 방법의 전체적인 흐름을 도시한 도면.발명을 실시하기 위한 구체적인 내용본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 [0025]상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 이하에서, 본 발명에 따른 실시예들을 첨부된 도면을 참조하여 상세하게 설명한다. [0026]본 발명의 구성 및 동작을 설명하기에 앞서 본 명세서에서 사용할 용어에 대해 먼저 정의한다. 본 명세서에서는 [0027]‘컨설팅 방법론’과 ‘컨설팅 모듈’이라는 용어를 사용하게 되며, ‘컨설팅 방법론’은 기업이 당면한 문제를해결하기 위해 필요한 완전한 컨설팅을 의미하며, ‘컨설팅 모듈’은 컨설팅 방법론을 구성하는 다수의 컨설팅방법들 중 일부의 컨설팅 방법을 의미하는 것으로서 컨설팅 방법론은 다수의 컨설팅 모듈들로 이루어진다. 도 1은 본 발명의 일 실시예에 따른 컨설팅 방법론과 컨설팅 모듈과의 관계를 도시한 도면이다. [0028]도 1을 참조하면, 컨설팅 방법론(100)은 다수의 컨설팅 모듈들(110, 112, 114, 116, 118)로 이루어지게 되며, [0029]다수의 컨설팅 모듈들(110, 112, 114, 116, 118)은 순차적으로 조합되어 최종적인 컨설팅 방법론(100)이 완성되게 된다. 예를 들어, 기업이 현재 당면한 문제가 중장기 실행 계획의 수립이라고 할 경우 이를 해결하기 위한 완성된 방 [0030]법론이 컨설팅 방법론(100)이라고 할 수 있으며 중장기 실행 계획 수립을 위해 필요한 세부적인 컨설팅 방법들이 컨설팅 모듈에 해당된다. 일례로, 중장기 실행 계획의 수립을 위해 내부 자원 분석 및 목표 설정이 필요하다면 이를 위한 세부 컨설팅 방법이 컨설팅 모듈에 해당된다. 종래기술에서 살펴본 바와 같이, 충분한 능력을 갖춘 전문가 인력풀을 가지는 대형 컨설팅 업체가 아닌 이상 완 [0031]성된 컨설팅 방법론을 제공하는 것은 중소 컨설팅 업체에게는 매우 어려운 문제이며 본 발명에서는 이러한 중소컨설팅 업체들도 기업이 당면한 문제를 해결하도록 하는 컨설팅 방법론을 제공할 수 있는 시스템 및 방법이 제공된다. 도 2는 본 발명의 일 실시예에 따른 컨설팅 제공 시스템의 구성을 도시한 도면이다. [0032]도 2를 참조하면, 본 발명의 일 실시예에 따른 컨설팅 제공 시스템은 컨설팅 모듈 데이터베이스(200), 매칭 컨 [0033]설팅 모듈 추출부(202), 컨설팅 방법론 생성부(204), 컨설팅 방법론 추출부(206) 및 사용자 인터페이스부(208)를 포함할 수 있다. 도 2에 도시된 컨설팅 제공 시스템은 웹과 같은 오픈된 통신망을 통해 사용자가 접근할 수도 있으며, 사설망과 [0034]같은 폐쇄된 통신망을 통해 사용자가 접근할 수도 있다. 물론, 단일의 컴퓨팅 장치에 의해 구현될 수도 있을 것이다. 컨설팅 모듈 데이터베이스(200)에는 컨설팅 방법론을 구성하는 컨설팅 모듈들이 컨설팅 방법론으로부터 분리되 [0035]어 독립적으로 저장된다. 기존의 컨설팅 제공을 위한 데이터베이스에는 컨설팅 방법론 전체가 하나의 데이터로저장되는 것이 일반적이었으나, 본 발명의 컨설팅 모듈 데이터베이스(200)에는 컨설팅 방법론을 컨설팅 모듈 단위로 분할하고 분할된 컨설팅 모듈들이 독립적으로 저장된다. 컨설팅 데이터베이스(200)에는 다수의 컨설팅 방법론들로부터 분할된 다수의 컨설팅 모듈들이 저장되는 것이다. 컨설팅 방법론으로부터 컨설팅 모듈을 분할하는 작업은 운영자에 의해 수행될 수도 있으며, 각 컨설팅 방법론에 [0036]맞도록 만들어진 분할 알고리즘을 통해 자동적으로 수행될 수도 있을 것이다. 공개특허 10-2013-0026886-7-도 3은 본 발명의 일 실시예에 따른 컨설팅 모둘 데이터베이스의 필드 구성을 도시한 도면이다. [0037]도 3을 참조하면, 본 발명의 일 실시예에 따른 컨설팅 모듈 데이터베이스에는 컨설팅 모듈 코드 필드(300), 컨 [0038]설팅 모듈 데이터 필드(302), 제1 속성 정보 필드(304), 제2 속성 정보 필드(306) 및 입출력 정보 필드(308)가구비된다. 컨설팅 모듈 코드 필드(300)에는 컨설팅 모듈 데이터베이스(200)에 저장된 각 컨설팅 모듈에 대해 유일하게 부 [0039]여된 코드 정보가 기록된다. 컨설팅 모듈 데이터 필드(302)에는 다수의 컨설팅 방법론들로부터 분할된 컨설팅 모듈 데이터가 저장된다. [0040]컨설팅 방법론으로부터 분할되는 컨설팅 모듈에는 3종류의 부가 정보가 부여되며, 부여된 속성 정보 각각은 제1 [0041]속성 정보 필드(304), 제2 속성 정보 필드(306) 및 입출력 정보 필드(308)에 기록된다. 제1 속성 정보 필드(304)에는 각 컨설팅 모듈이 가지는 목표에 대한 속성 정보가 기록된다. 일례로, 컨설팅 모 [0042]듈이 중장기 실행 계획 수립을 위한 컨설팅 방법론에 포함된 것일 경우 제1 속성 정보로 중장기 실행 계획이 설정될 수 있는 것이다. 제1 속성 정보는 당면한 문제 해결을 위한 의사결정문제라고 표현할 수도 있을 것이다. 제2 속성 정보 필드(306)에는 각 컨설팅 모듈이 가지는 세부적이고 개별적인 속성 정보가 기록된다. 제2 속성 [0043]정보 필드(306)에 기록되는 제2 속성 정보는 컨설팅 모듈의 최종적인 목적이 아닌 단위 모듈이 가지는 세부적인속성 정보로서 일례로 컨설팅 모듈의 대상 산업, 대상 규모, 수행 기관과 같은 정보가 제2 속성 정보로 제2 속성 정보 필드(306)에 기록될 수 있다. 추후 설명하겠지만, 제2 속성 정보 필드(306)에 기록된 정보는 최종적으로 적합한 컨설팅 방법론을 추출하는 과정에서 유사도를 판단할 때 이용될 수 있다. 입출력 정보 필드(308)에는 각 컨설팅 모듈의 입력 정보 및 출력 정보가 기록된다. 추후 설명하겠지만, 입출력 [0044]정보 필드(308)에 기록되는 입력 및 출력 정보는 모듈간 관계를 정의하고 모듈을 조합하는 과정에 이용된다. 앞서 설명한 바와 같은 방법으로 컨설팅 모듈 데이터베이스를 이용하여 본 발명의 컨설팅 서비스가 제공되며 사 [0045]용자로부터 원하는 컨설팅 방법론에 대한 키워드 정보를 입력받고 입력받은 키워드 정보에 상응하는 컨설팅 방법론을 제공하는 서비스가 본 발명의 컨설팅 제공 시스템에 의해 이루어진다. 사용자 인터페이스부(208)는 사용자의 요청 정보를 입력받는 기능을 하는 모듈이며, 사용자 인터페이스부(208) [0046]를 통해 사용자가 원하는 컨설팅 방법론에 대한 키워드 정보가 입력된다. 사용자는 두 종류의 키워드 정보를 입력하게 되며, 제1 키워드 정보는 컨텐츠 모듈 데이터베이스의 제1 속성 정 [0047]보에 대응되는 키워드 정보로서 사용자가 원하는 컨설팅의 목표 정보이다. 제2 키워드 정보는 컨텐츠 모듈 데이터베이스의 제2 속성 정보에 대응되는 정보로서 컨설팅의 세부적인 속성 정보가 이에 포함된다. 사용자 인터페이스부(208)를 통해 사용자가 원하는 컨설팅 방법론에 대한 키워드가 입력되면, 입력된 키워드를 [0048]이용하여 매칭 컨설팅 모듈 추출부(202)에 의해 매칭되는 컨설팅 모듈을 추출하는 작업이 1차적으로이루어진다. 매칭 컨설팅 모듈 추출부(202)는 사용자로부터 입력된 키워드들 중 컨설팅 목표와 연관된 제1 키워드 정보와 매 [0049]칭되는 컨설팅 모듈들을 컨설팅 모듈 데이터베이스(200)로부터 추출하는 기능을 한다. 매칭 컨설팅 모듈 추출부(202)는 사용자의 컨설팅 목표와 연관된 키워드 정보와 컨설팅 모듈 데이터베이스(20 [0050]0)의제1 속성 정보를 이용하여 매칭되는 컨설팅 모듈들을 추출한다. 예를 들어, 사용자가 설정한 컨설팅 목표와연관된 키워드가 “중장기 실행 계획’일 경우 매칭 컨설팅 모듈 추출부(202)는 저장된 다수의 컨설팅 모듈들중 제1 속성 정보로 “중장기 실행 계획”이 설정된 컨설팅 모듈들을 추출하는 것이다. 매칭 컨설팅 모듈 추출부(202)에 의해 추출된 컨설팅 모듈들은 임시 저장소(미도시)에 저장될 수 있다. [0051]컨설팅 방법론 생성부(204)는 추출된 컨설팅 모듈들을 이용하여 사용자의 요청 정보에 상응하는 컨설팅 방법론 [0052]들을 생성하는 기능을 한다. 컨설팅 방법론 생성부(204)는 두 개의 단계에 의해 컨설팅 방법론을 생성한다. 첫번째 단계는 추출된 컨설팅 모듈들을 소정의 기준에 의해 그룹핑하는 단계이며, 두번째 단계는 그룹핑된 컨설 [0053]팅 모듈들을 조합하여 컨설팅 방법론을 생성하는 단계이다. 컨설팅 방법론 생성부(204)는 추출되어 임시 저장소(미도시)에 저장된 컨설팅 모듈들을 입출력 정보에 기초하여 [0054]그룹핑한다. 본 발명의 바람직한 실시예에 따르면, 컨설팅 방법론 생성부(204)는 추출된 컨설팅 모듈들 중 입력공개특허 10-2013-0026886-8-과 출력이 동일한 컨설팅 모듈들을 그룹핑한다. 이와 같이 입력 및 출력 정보가 동일하여 그룹핑된 컨설팅 모듈들의 집합을 본 명세서에서는 ‘대모듈’로 정의한다. 도 4는 본 발명의 일 실시예에 따라 추출된 컨설팅 모듈들을 대모듈 단위로 그룹핑하는 예를 도시한 도면이다. [0055]도 4에서, 왼쪽의 표는 매칭 컨설팅 모듈 추출부(202)에서 추출된 컨설팅 모듈들의 리스트 정보 및 각 컨설팅 [0056]모듈의 입력 및 출력 정보를 표시한 것이며, (b)는 입력 및 출력이 동일한 컨설팅 모듈들을 그룹핑하여 대모듈단위로 분류한 결과를 도시한 것이다. 도 4를 참조하면, 사용자의 제1 키워드 정보에 매칭되어 추출된 컨설팅 모듈 10개가 리스팅되어 있으며, 각 컨 [0057]설팅 모듈의 입력 및 출력 정보가 표시되어 있다. 이와 같은 10개의 컨설팅 모듈들을 입력 및 출력이 동일한 컨설팅 모듈별로 그룹핑하여 대모듈을 형성한 예가 오른쪽에 도시되어 있다. 도 4에 도시된 바와 같이, 입력 및 출력이 동일한 M_04 컨설팅 모듈 및 M_05 컨설팅 모듈이 하나의 대모듈로 그 [0058]룹핑되고, M_08, M_07, M_10 컨설팅 모듈이 다른 하나의 대모듈로 그룹핑되며, M_01, M_03 컨설팅 모듈이 또 다른 하나의 대모듈로 그룹핑되고, M_02, M_03 컨설팅 모듈이 또 다른 하나의 대모듈로 그룹핑된다. 앞서 설명한 바와 같이 대모듈 그룹핑이 이루어진 후 대모듈 단위로 컨설팅 모듈을 조합하는 과정이 수행된다. [0059]대모듈 단위의 컨설팅 모듈들의 조합은 각 대모듈의 입력 및 출력 정보를 이용하여 이루어지며 제1 대모듈의 입력과 동일한 출력을 가지는 제2 대모듈을 연결하는 방식으로 이루어진다. 대모듈 단위의 컨설팅 모듈들의 조합은 제1 키워드 정보인 컨설팅 목표 정보에 매칭되는 출력을 산출하는 대모 [0060]듈을 그룹핑하는 작업부터 시작된다. 도 5는 본 발명의 일 실시예에 따라 컨설팅 목표 정보에 매칭되는 대모듈을 그룹핑하는 일례를 도시한 [0061]도면이다. 도 5를 참조하면, 사용자의 컨설팅 목표 정보가 ‘중장기 실행 계획’ 및 ‘중장기 전략 방향’인 경우가 도시 [0062]되어 있으며, 출력이 ‘중장기 실행 계획’에 매칭되거나 ‘중장기 전략 방향’에 매칭되는 대모듈들(M1, M2)이그룹핑된다. ‘중장기 실행 계획’에 매칭되는 대모듈(M1)은 출력이 ‘중장기 실행 계획/이고 입력이 ‘내부지원 분석 결과 [0063]’ 또는 ‘중장기 재무 목표’인 대모듈이며, ‘중장기 전략 방향’에 매칭되는 대모듈(M2)은 출력이 ‘중장기전략 방향’이고 입력이 ‘중장기 재무목표’인 모듈이다. 도 5와 같이 그룹핑되는 대모듈을 본 명세서에서는 클러스터라고 정의하며, 사용자의 컨설팅 목표에 매칭되어 [0064]첫번째로 그룹핑되는 대모듈 집합은 제1 클러스터가 된다. 제1 클러스터의 형성이 완료되면, 제1 클러스터에 속한 대모듈들에 입력에 매칭되는 출력을 가진 대모듈들이 그 [0065]룹핑된다. 즉, 제1 클러스터에 속한 대모듈들의 입력과 동일한 출력을 가진 대모듈들이 그룹핑되는 것이다. 도 6은 도 5의 제1 클러스터를 구성하는 대모듈들과 연결되는 대모듈들을 그룹핑하여 제2 클러스터를 형성하는 [0066]예를 도시한 도면이다. 도 6을 참조하면, 도 5의 제1 클러스터의 입력인 ‘내부지원 분석결과’및 ‘중장기 재무목표’를 출력으로 가 [0067]지는 대모듈들(M3, M4)이 그룹핑되며, 그릅핑된 대모듈들(M3, M4)이 제2 클러스터로 설정된다. 제1 클러스터에서, 입력인 ‘중장기 재무목표’가 각각의 대도듈(M1, M2)의 입력으로 설정되어 있어 출력이 ‘ [0068]중장기 재무목표’인 대모듈(M4)이 중복으로 그룹핑되는 것을 도 6으로부터 확인할 수 있다. 도 7은 클러스터링 과정에서 발생할 수 있는 중복되는 대모듈을 제거하는 일례를 도시한 도면이다. [0069]도 7을 참조하면, 중복되는 대모듈인 M4가 제거되어 단일의 M3 및 M4로 제2 클러스터가 이루어지는 것을 확인할 [0070]수 있다. 제2 클러스터와 연결되는 제3 클러스터 역시 동일한 방식에 의해 형성될 수 있다. 즉, 제2 클러스터를 형성하는 [0071]대모듈들의 입력과 동일한 출력을 가지는 대모듈들이 그룹핑되어 제3 클러스터를 형성하는 것이다. 도 8은 도 7의 제2 클러스터와 연결되는 제3 클러스터를 형성하는 일례를 도시한 도면이다. [0072]도 8을 참조하면, 제2 클러스터의 입력 중 ‘기업내부자료’와 매칭되는 출력을 가지는 대모듈은 존재하지 않고 [0073]제2 클러스터의 입력 중 ‘전략방향 Pool’에 매칭되는 대모듈(M5)만이 제3 클러스터를 형성하는 것을 확인할공개특허 10-2013-0026886-9-수 있다. 연속되는 클러스터를 형성하는 작업은 제N 클러스터의 입력에 매칭되는 출력을 가진 대모듈이 더 이상 존재하지 [0074]않을 때까지 계속적으로 이루어진다. 예를 들어, 제N 클러스터에서 클러스터링 작업이 종료될 때 제N 클러스터를 시작 클러스터로 설정하고 제1 클러 [0075]스터를 종료 클러스터로 설정한다. 클러스터링 작업이 완료되면, 입출력이 연결 관계에 있는 대모듈들을 연결하며 연결된 각 대모듈에서 하나의 컨 [0076]설팅 모듈을 선택하고 이를 연결함으로써 컨설팅 방법론이 생성된다. 하나의 대모듈에 다수 개의 컨설팅 모듈들이 포함되어 있으며, 대모듈간의 연결 역시 다수개가 존재하므로 연결 [0077]된 대모듈에서 하나의 컨설팅 모듈을 선택하는 방식에 의해 다수의 컨설팅 방법론들이 생성될 수 있으며, 선택가능한 모든 경우의 수에 대해 컨설팅 방법론들이 생성된다. 컨설팅 방법론 추출부(206)는 컨설팅 방법론 생성부(204)에 의해 생성된 다수의 컨설팅 방법론들과 사용자의 요 [0078]구 정보와의 유사도를 연산하여 사용자가 원하는 컨설팅 방법론을 추출할 수 있도록 한다. 컨설팅 방법론 추출부(206)는 컨설팅 모듈 데이터베이스의 제2 속성 정보 및 사용자가 입력한 키워드 정보의 유 [0079]사도를 비교하여 사용자의 요구에 맞는 컨설팅 방법론들이 추출될 수 있도록 한다. 일례로, 사용자가 입력하는 키워드 정보는 ‘대상 산업’, ‘과제 규모’, ‘수행 시기’ 및 ‘수행 기관’에 [0080]대한 정보일 수 있으며, 각 입력된 정보와 컨설팅 모듈에 대해 설정된 제2 속성 정보의 유사도를 비교하는 작업이 이루어지는 것이다. 도 9는 사용자가 입력한 특정 키워드와 생성된 컨설팅 방법론들과의 유사도를 비교한 결과를 표로 도시한 도면 [0081]이다. 도 9를 참조하면, 입력한 키워드인 ‘대상 산업’, ‘대상 규모’, ‘수행 시기’ 및 ‘수행 기관’에 대한 정 [0082]보들과 생성된 컨설팅 방법론들에 포함된 각 모듈들에 대해 설정된 제2 속성 정보의 유사도를 비교하고 유사도에 따라 리스팅된 결과가 표를 통해 도시되어 있다. 도 9는 각 키워드에 대해 별도의 가중치를 부여하지 않은 경우의 결과를 표로 나타낸 것이며 사용자는 각 키워 [0083]드에 대해 가중치를 부여하여 유사도를 비교할 수도 있다. 위 4개의 키워드에 대해 별도의 가중치 부여가 없다면 각 키워드별로 0.25의 가중치가 설정되나 사용자는 적절 [0084]한 컨텐츠 방법론 추출을 위해 가중치를 변경할 수 있다. 일례로, ‘대상 규모’가 가장 중요하다고 판단될 경우 사용자는 ‘대상 규모’에 대한 가중치를 0.25에서 0.6으로 높일 수 있다. 도 10은 사용자가 ‘대상 규모’에 대한 가중치를 0.25에서 0.6으로 변경하였을 경우의 유사도 연산 결과를 도 [0085]시한 표이다. 도 10에 도시된 바와 같이, 도 9의 표와는 유사도가 다르게 계산되어 유사도가 높은 컨설팅 방법론 순위 정보 [0086]역시 바뀌게 되며, 사용자는 요청 정보에 합치하는 컨설팅 방법론을 우선적으로 확인할 수 있게 된다. 도 11은 본 발명의 일 실시예에 따른 컨설팅 서비스 제공 방법의 전체적인 흐름을 도시한 도면이다. [0087]도 11을 참조하면, 우선 컨설팅 방법론으로부터 분할되는 컨설팅 모듈들을 저장하는 컨설팅 모듈 데이터베이스 [0088]를 구축한다(단계 1100). 각 컨설팅 모듈에는 컨설팅 목표에 대한 제1 속성 정보, 컨설팅이 개별적 속성에 대한제2 속성 정보 및 컨설팅 모듈의 입출력 정보가 연관된다. 사용자로부터 원하는 컨설팅에 대한 요청 정보가 수신되며(단계 1102), 사용자는 키워드를 입력하는 방식으로 [0089]원하는 컨설팅에 대한 정보를 제공할 수 있다. 사용자의 요청 정보가 수신되면, 사용자가 입력한 키워드 중 컨설팅 목표에 대한 키워드에 기초하여 컨설팅 목 [0090]표에 매칭되는 컨설팅 모듈들을 추출한다(단계 1104). 컨설팅 모듈들이 추출되면, 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 그룹핑하는 작업을 수행 [0091]한다(단계 1106). 전술한 바와 같이, 입력 및 출력 정보가 동일한 컨설팅모듈끼리 그룹핑하며, 이와 같이 그룹핑된 컨설팅 모듈들은 대모듈로 정의된다. 각 대모듈의 입력 및 출력 정보를 이용하여 클러스터를 형성하고, 각 클러스터를 연결하며, 각 클러스터에 포함 [0092]공개특허 10-2013-0026886-10-된 컨설팅 모듈들을 조합하여 컨설팅 방법론들을 생성한다(단계 1108). 컨설팅 방법론들이 생성되면, 사용자가 입력한 키워드 정보와의 유사도가 계산되고 유사도 계산을 통해 사용자 [0093]의 요구 정보에 부합하는 컨설팅 방법론을 추출한다(단계 1110). 이상과 같이 본 발명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 의해 설명되 [0094]었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정되는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다.도면도면1도면2공개특허 10-2013-0026886-11-도면3도면4공개특허 10-2013-0026886-12-도면5공개특허 10-2013-0026886-13-도면6공개특허 10-2013-0026886-14-도면7공개특허 10-2013-0026886-15-도면8공개특허 10-2013-0026886-16-도면9도면10공개특허 10-2013-0026886-17-도면11공개특허 10-2013-0026886-18-"}
{"patent_id": "10-2011-0090331", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "컨설팅 서비스 제공 시스템 및 방법이 개시된다. 개시된 시스템은 완성된 컨설팅을 제공하기 위한 컨설팅 방법 론으로부터 분할되는 컨설팅 모듈들을 독립적으로 저장하는 컨설팅 모듈 데이터베이스; 사용자의 컨설팅 요청 정 보에 매칭되는 컨설팅 모듈들을 상기 컨설팅 모듈 데이터베이스로부터 추출하는 매칭 컨설팅 모듈 추출부; 상기 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 컨설팅 모듈들을 그룹핑한 클러스터를 형성하고 상기 클러스터를 연결하며, 연결된 클러스터들에 속한 컨설팅 모듈들을 조합하여 컨설팅 방법론들을 생성하는 컨설팅 방법론 생성부를 포함한다. 개시된 시스템에 의하면, 중소 컨설팅 업체에서도 완성된 컨설팅 방법론의 제공이 가 능하도록 컨설팅 방법론을 생성할 수 있는 장점이 있으며, 컨설팅 모듈들의 재조합을 통해 새로운 컨설팅 방법론 의 생성이 가능한 장점이 있다."}
{"patent_id": "10-2011-0090331", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예들은 컨설팅 서비스에 관한 것으로서, 더욱 상세하게는 융합 기술을 이용한 컨설팅 서비스 제 공 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2011-0090331", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "경영환경이 급변함에 따라 선진기업을 벤치마킹하고 경영문제 해결을 위한 지식 서비스를 제공하는 컨설팅에 대 한 수요가 지속적으로 증가하고 있다. 컨설팅(consulting)이란 일정한 자격을 갖춘 전문가가 선진적인 방법론을 활용하여 기업이 당면한 문제를 진단 하고 분석하여 기업에 적합한 해결방안을 제시해주는 자문 서비스를 의미한다 컨설팅 산업은 전문적인 지식과 경험을 제공하는 고도의 지식·정보 집약적 산업이라고 할 수 있다. 따라서 컨 설팅 산업에서는 다양한 의사결정문제에 적합한 컨설팅 방법론을 개발, 저장하고 재활용하는 것이 주요한 경쟁 전략이 되고 있다. 충분한 능력의 전문가 풀을 가진 대형 컨설팅 업체는 기업이 직면한 문제에 대해 해결 가능한 ‘컨설팅 방법론 ’을 제공하는 것이 가능하나 중소 컨설팅 업체들은 규모의 영세성 및 전문성 부족 등으로 인해 경쟁력 있는 고 유의 ‘컨설팅 방법론’을 제시하는 것이 실질적으로 어려운 환경에 있다. 이러한 한계점은 컨설팅 서비스 제공자의 지식 역량 수준 저하로 이어지며 연쇄적으로 시장에서의 경쟁력 또한 저하되고 있는 실정이다. 한편, 지식경영시스템(knowledge management systems, KMS) 분야에 인공지능 기법들을 응용하려는 시도들이 빈 번하게 이루어지고 있다. 이러한 인공지능 기법들이 많이 사용되는 원인으로 우선 지식 사용자들이 지식을 검색 및 추출하기 위해 현존하는 모든 지식 자원을 확인하기가 어렵고, 설령 필요한 모든 자원들을 인지하더라도 시 간적 제약 등을 이유로 해당 지식으로부터 필요한 지식을 찾아 맞춤화된 지식으로 생성하기란 매우 어렵다는 점 을 들 수 있다 이렇듯 최근 다양한 인공지능 기법들이 지식경영시스템에 접목되고 있는데, 그 중에서도 사례기반추론은 다른 기법에 비해 비교적 단순하게 맞춤화된 지식을 추출해 내기 때문에 최근 지식경영시스템에 사례기반추론을 도입 한 연구가 많이 발표되고 있으며, 컨설팅 산업에서도 이러한 움직임이 많이 나타나고 있다 그러나, 지금까지 연구된 사례기반추론기법은 컨설팅이 가지는 특성에 대한 고려가 미흡하였고 사용자의 선호체 계를 반영한 결과의 추출이 어려운 문제점이 있었다."}
{"patent_id": "10-2011-0090331", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기한 바와 같은 종래 기술의 문제점을 해결하기 위해 본 발명에서는 중소 컨설팅 업체에서도 완성된 컨설팅 방법론의 제공이 가능하도록 컨설팅 방법론을 생성할 수 있는 컨설팅 서비스 제공 시스템 및 방법을 제안한다. 또한, 본 발명은 컨설팅 모듈들의 재조합을 통해 새로운 컨설팅 방법론의 생성이 가능한 컨설팅 서비스 제공 시 스템 및 방법을 제안한다. 아울러, 본 발명은 사례 기반 추론 기법을 적용하여 사용자에게 적합한 컨설팅 방법론을 제공할 수 있는 컨설팅 서비스 제공 시스템 및 방법을 제안한다."}
{"patent_id": "10-2011-0090331", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위해 본 발명의 바람직한 일실시예에 따르면, 완성된 컨설팅을 제공하기 위한 컨설팅 방법론으로부터 분할되는 컨설팅 모듈들을 독립적으로 저장하는 컨설팅 모듈 데이터베이스; 사용자의 컨설팅 요 청 정보에 매칭되는 컨설팅 모듈들을 상기 컨설팅 모듈 데이터베이스로부터 추출하는 매칭 컨설팅 모듈 추출부; 상기 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 컨설팅 모듈들을 그룹핑한 클러스터를 형성하고 상기 클러스터를 연결하며, 연결된 클러스터들에 속한 컨설팅 모듈들을 조합하여 컨설팅 방법론들을 생성하는 컨설팅 방법론 생성부를 포함하는 컨설팅 서비스 제공 시스템이 제공된다. 상기 컨설팅 모듈 데이터베이스에는 상기 컨설팅 모듈들과 관련하여 각 컨설팅 모듈의 목표와 연관된 제1 속성 정보 및 각 컨설팅 모듈의 개별적 속성과 연관된 제2 속성 정보가 함께 저장된다. 상기 컨설팅 방법론 생성부는 상기 매칭 컨설팅 추출부로부터 추출된 컨설팅 모듈들을 같은 입력 및 출력을 가 지는 컨설팅 모듈별로 그룹핑한 대모듈을 형성한다. 상기 컨설팅 방법론 생성부는 사용자의 컨설팅 목표와 매칭되는 출력을 가지는 대모듈들을 그룹핑하여 제1 클러 스터를 형성한다. 상기 컨설팅 방법론 생성부는 상기 제1 클러스터의 입력들과 매칭되는 출력을 가진 대모듈들로 그룹핑되고 상기 제1 클러스터와 연결되는 제2 클러스터를 형성하고 동일한 방식에 의해 매칭되는 출력을 가진 대모듈이 존재하 지 않을 때까지 제N 클러스터를 형성 및 연결한다. 상기 제1 내지 제N 클러스터로부터 서로 입출력이 연결관계에 있는 대모듈간 연결을 수행하고 연결 관계에 있는 각 대모듈로부터 하나의 컨설팅 모듈을 선택하여 컨설팅 방법론들을 생성한다. 상기 컨설팅 제공 시스템은 상기 컨설팅 방법론 생성부에 의해 생성된 컨설팅 방법론들과 상기 사용자의 요청 정보와의 유사도를 연산하는 컨설팅 방법론 추출부를 더 포함할 수 있다. 상기 사용자의 요청 정보에는 사용자가 원하는 컨설팅에 대한 키워드 정보가 포함되며, 상기 컨설팅 방법론 추 출부는 사용자에 의해 가중치가 조정된 상기 키워드 정보에 기초하여 상기 유사도를 연산한다. 본 발명의 다른 측면에 따르면, 완성된 컨설팅을 제공하기 위한 컨설팅 방법론으로부터 분할되는 컨설팅 모듈들 을 독립적으로 저장하는 컨설팅 모듈 데이터베이스; 사용자의 컨설팅 요청 정보에 매칭되는 컨설팅 모듈들을 상 기 컨설팅 모듈 데이터베이스로부터 추출하는 매칭 컨설팅 모듈 추출부; 상기 매칭 컨설팅 모듈 추출부에 추출 된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 상기 컨설팅 모듈들을 연결함으로써 컨설팅 방법론들을 생성하는 컨설팅 방법론 생성부를 포함하는 컨설팅 서비스 제공 시스템이 제공된다. 본 발명의 또 다른 측면에 따르면, 완성된 컨설팅을 제공하기 위한 컨설팅 방법론으로부터 분할되는 컨설팅 모 듈들이 독립적으로 저장된 데이터베이스로부터 사용자의 컨설팅 요청 정보에 매칭되는 컨설팅 모듈들을 추출하 는 단계(a); 상기 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 컨설팅 모듈들을 그룹핑한 클러스 터를 형성하고 입출력 관계를 이용하여 클러스터를 연결하는 단계(b); 및 상기 연결된 클러스터들에 속한 컨설 팅 모듈들을 조합하여 컨설팅 방법론을 생성하는 단계(c)를 포함하는 컨설팅 서비스 제공 방법이 제공된다."}
{"patent_id": "10-2011-0090331", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 중소 컨설팅 업체에서도 완성된 컨설팅 방법론의 제공이 가능하도록 컨설팅 방법론을 생성할 수 있는 장점이 있으며, 컨설팅 모듈들의 재조합을 통해 새로운 컨설팅 방법론의 생성이 가능한 장점이 있다."}
{"patent_id": "10-2011-0090331", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 이하에서, 본 발명에 따른 실시예들을 첨부된 도면을 참조하여 상세하게 설명한다. 본 발명의 구성 및 동작을 설명하기에 앞서 본 명세서에서 사용할 용어에 대해 먼저 정의한다. 본 명세서에서는 ‘컨설팅 방법론’과 ‘컨설팅 모듈’이라는 용어를 사용하게 되며, ‘컨설팅 방법론’은 기업이 당면한 문제를 해결하기 위해 필요한 완전한 컨설팅을 의미하며, ‘컨설팅 모듈’은 컨설팅 방법론을 구성하는 다수의 컨설팅 방법들 중 일부의 컨설팅 방법을 의미하는 것으로서 컨설팅 방법론은 다수의 컨설팅 모듈들로 이루어진다. 도 1은 본 발명의 일 실시예에 따른 컨설팅 방법론과 컨설팅 모듈과의 관계를 도시한 도면이다. 도 1을 참조하면, 컨설팅 방법론은 다수의 컨설팅 모듈들(110, 112, 114, 116, 118)로 이루어지게 되며, 다수의 컨설팅 모듈들(110, 112, 114, 116, 118)은 순차적으로 조합되어 최종적인 컨설팅 방법론이 완성되 게 된다. 예를 들어, 기업이 현재 당면한 문제가 중장기 실행 계획의 수립이라고 할 경우 이를 해결하기 위한 완성된 방 법론이 컨설팅 방법론이라고 할 수 있으며 중장기 실행 계획 수립을 위해 필요한 세부적인 컨설팅 방법들 이 컨설팅 모듈에 해당된다. 일례로, 중장기 실행 계획의 수립을 위해 내부 자원 분석 및 목표 설정이 필요하다 면 이를 위한 세부 컨설팅 방법이 컨설팅 모듈에 해당된다. 종래기술에서 살펴본 바와 같이, 충분한 능력을 갖춘 전문가 인력풀을 가지는 대형 컨설팅 업체가 아닌 이상 완 성된 컨설팅 방법론을 제공하는 것은 중소 컨설팅 업체에게는 매우 어려운 문제이며 본 발명에서는 이러한 중소 컨설팅 업체들도 기업이 당면한 문제를 해결하도록 하는 컨설팅 방법론을 제공할 수 있는 시스템 및 방법이 제 공된다. 도 2는 본 발명의 일 실시예에 따른 컨설팅 제공 시스템의 구성을 도시한 도면이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 컨설팅 제공 시스템은 컨설팅 모듈 데이터베이스, 매칭 컨 설팅 모듈 추출부, 컨설팅 방법론 생성부, 컨설팅 방법론 추출부 및 사용자 인터페이스부 를 포함할 수 있다. 도 2에 도시된 컨설팅 제공 시스템은 웹과 같은 오픈된 통신망을 통해 사용자가 접근할 수도 있으며, 사설망과 같은 폐쇄된 통신망을 통해 사용자가 접근할 수도 있다. 물론, 단일의 컴퓨팅 장치에 의해 구현될 수도 있을 것 이다. 컨설팅 모듈 데이터베이스에는 컨설팅 방법론을 구성하는 컨설팅 모듈들이 컨설팅 방법론으로부터 분리되 어 독립적으로 저장된다. 기존의 컨설팅 제공을 위한 데이터베이스에는 컨설팅 방법론 전체가 하나의 데이터로 저장되는 것이 일반적이었으나, 본 발명의 컨설팅 모듈 데이터베이스에는 컨설팅 방법론을 컨설팅 모듈 단 위로 분할하고 분할된 컨설팅 모듈들이 독립적으로 저장된다. 컨설팅 데이터베이스에는 다수의 컨설팅 방 법론들로부터 분할된 다수의 컨설팅 모듈들이 저장되는 것이다. 컨설팅 방법론으로부터 컨설팅 모듈을 분할하는 작업은 운영자에 의해 수행될 수도 있으며, 각 컨설팅 방법론에 맞도록 만들어진 분할 알고리즘을 통해 자동적으로 수행될 수도 있을 것이다. 도 3은 본 발명의 일 실시예에 따른 컨설팅 모둘 데이터베이스의 필드 구성을 도시한 도면이다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 컨설팅 모듈 데이터베이스에는 컨설팅 모듈 코드 필드, 컨 설팅 모듈 데이터 필드, 제1 속성 정보 필드, 제2 속성 정보 필드 및 입출력 정보 필드가 구비된다. 컨설팅 모듈 코드 필드에는 컨설팅 모듈 데이터베이스에 저장된 각 컨설팅 모듈에 대해 유일하게 부 여된 코드 정보가 기록된다. 컨설팅 모듈 데이터 필드에는 다수의 컨설팅 방법론들로부터 분할된 컨설팅 모듈 데이터가 저장된다. 컨설팅 방법론으로부터 분할되는 컨설팅 모듈에는 3종류의 부가 정보가 부여되며, 부여된 속성 정보 각각은 제1 속성 정보 필드, 제2 속성 정보 필드 및 입출력 정보 필드에 기록된다. 제1 속성 정보 필드에는 각 컨설팅 모듈이 가지는 목표에 대한 속성 정보가 기록된다. 일례로, 컨설팅 모 듈이 중장기 실행 계획 수립을 위한 컨설팅 방법론에 포함된 것일 경우 제1 속성 정보로 중장기 실행 계획이 설 정될 수 있는 것이다. 제1 속성 정보는 당면한 문제 해결을 위한 의사결정문제라고 표현할 수도 있을 것이다. 제2 속성 정보 필드에는 각 컨설팅 모듈이 가지는 세부적이고 개별적인 속성 정보가 기록된다. 제2 속성 정보 필드에 기록되는 제2 속성 정보는 컨설팅 모듈의 최종적인 목적이 아닌 단위 모듈이 가지는 세부적인 속성 정보로서 일례로 컨설팅 모듈의 대상 산업, 대상 규모, 수행 기관과 같은 정보가 제2 속성 정보로 제2 속 성 정보 필드에 기록될 수 있다. 추후 설명하겠지만, 제2 속성 정보 필드에 기록된 정보는 최종적으 로 적합한 컨설팅 방법론을 추출하는 과정에서 유사도를 판단할 때 이용될 수 있다. 입출력 정보 필드에는 각 컨설팅 모듈의 입력 정보 및 출력 정보가 기록된다. 추후 설명하겠지만, 입출력 정보 필드에 기록되는 입력 및 출력 정보는 모듈간 관계를 정의하고 모듈을 조합하는 과정에 이용된다. 앞서 설명한 바와 같은 방법으로 컨설팅 모듈 데이터베이스를 이용하여 본 발명의 컨설팅 서비스가 제공되며 사 용자로부터 원하는 컨설팅 방법론에 대한 키워드 정보를 입력받고 입력받은 키워드 정보에 상응하는 컨설팅 방 법론을 제공하는 서비스가 본 발명의 컨설팅 제공 시스템에 의해 이루어진다. 사용자 인터페이스부는 사용자의 요청 정보를 입력받는 기능을 하는 모듈이며, 사용자 인터페이스부 를 통해 사용자가 원하는 컨설팅 방법론에 대한 키워드 정보가 입력된다. 사용자는 두 종류의 키워드 정보를 입력하게 되며, 제1 키워드 정보는 컨텐츠 모듈 데이터베이스의 제1 속성 정 보에 대응되는 키워드 정보로서 사용자가 원하는 컨설팅의 목표 정보이다. 제2 키워드 정보는 컨텐츠 모듈 데이 터베이스의 제2 속성 정보에 대응되는 정보로서 컨설팅의 세부적인 속성 정보가 이에 포함된다. 사용자 인터페이스부를 통해 사용자가 원하는 컨설팅 방법론에 대한 키워드가 입력되면, 입력된 키워드를 이용하여 매칭 컨설팅 모듈 추출부에 의해 매칭되는 컨설팅 모듈을 추출하는 작업이 1차적으로 이루어진다. 매칭 컨설팅 모듈 추출부는 사용자로부터 입력된 키워드들 중 컨설팅 목표와 연관된 제1 키워드 정보와 매 칭되는 컨설팅 모듈들을 컨설팅 모듈 데이터베이스로부터 추출하는 기능을 한다. 매칭 컨설팅 모듈 추출부는 사용자의 컨설팅 목표와 연관된 키워드 정보와 컨설팅 모듈 데이터베이스(20 0)의제1 속성 정보를 이용하여 매칭되는 컨설팅 모듈들을 추출한다. 예를 들어, 사용자가 설정한 컨설팅 목표와 연관된 키워드가 “중장기 실행 계획’일 경우 매칭 컨설팅 모듈 추출부는 저장된 다수의 컨설팅 모듈들 중 제1 속성 정보로 “중장기 실행 계획”이 설정된 컨설팅 모듈들을 추출하는 것이다. 매칭 컨설팅 모듈 추출부에 의해 추출된 컨설팅 모듈들은 임시 저장소(미도시)에 저장될 수 있다. 컨설팅 방법론 생성부는 추출된 컨설팅 모듈들을 이용하여 사용자의 요청 정보에 상응하는 컨설팅 방법론 들을 생성하는 기능을 한다. 컨설팅 방법론 생성부는 두 개의 단계에 의해 컨설팅 방법론을 생성한다. 첫번째 단계는 추출된 컨설팅 모듈들을 소정의 기준에 의해 그룹핑하는 단계이며, 두번째 단계는 그룹핑된 컨설 팅 모듈들을 조합하여 컨설팅 방법론을 생성하는 단계이다. 컨설팅 방법론 생성부는 추출되어 임시 저장소(미도시)에 저장된 컨설팅 모듈들을 입출력 정보에 기초하여 그룹핑한다. 본 발명의 바람직한 실시예에 따르면, 컨설팅 방법론 생성부는 추출된 컨설팅 모듈들 중 입력과 출력이 동일한 컨설팅 모듈들을 그룹핑한다. 이와 같이 입력 및 출력 정보가 동일하여 그룹핑된 컨설팅 모듈 들의 집합을 본 명세서에서는 ‘대모듈’로 정의한다. 도 4는 본 발명의 일 실시예에 따라 추출된 컨설팅 모듈들을 대모듈 단위로 그룹핑하는 예를 도시한 도면이다. 도 4에서, 왼쪽의 표는 매칭 컨설팅 모듈 추출부에서 추출된 컨설팅 모듈들의 리스트 정보 및 각 컨설팅 모듈의 입력 및 출력 정보를 표시한 것이며, (b)는 입력 및 출력이 동일한 컨설팅 모듈들을 그룹핑하여 대모듈 단위로 분류한 결과를 도시한 것이다. 도 4를 참조하면, 사용자의 제1 키워드 정보에 매칭되어 추출된 컨설팅 모듈 10개가 리스팅되어 있으며, 각 컨 설팅 모듈의 입력 및 출력 정보가 표시되어 있다. 이와 같은 10개의 컨설팅 모듈들을 입력 및 출력이 동일한 컨 설팅 모듈별로 그룹핑하여 대모듈을 형성한 예가 오른쪽에 도시되어 있다. 도 4에 도시된 바와 같이, 입력 및 출력이 동일한 M_04 컨설팅 모듈 및 M_05 컨설팅 모듈이 하나의 대모듈로 그 룹핑되고, M_08, M_07, M_10 컨설팅 모듈이 다른 하나의 대모듈로 그룹핑되며, M_01, M_03 컨설팅 모듈이 또 다 른 하나의 대모듈로 그룹핑되고, M_02, M_03 컨설팅 모듈이 또 다른 하나의 대모듈로 그룹핑된다. 앞서 설명한 바와 같이 대모듈 그룹핑이 이루어진 후 대모듈 단위로 컨설팅 모듈을 조합하는 과정이 수행된다. 대모듈 단위의 컨설팅 모듈들의 조합은 각 대모듈의 입력 및 출력 정보를 이용하여 이루어지며 제1 대모듈의 입 력과 동일한 출력을 가지는 제2 대모듈을 연결하는 방식으로 이루어진다. 대모듈 단위의 컨설팅 모듈들의 조합은 제1 키워드 정보인 컨설팅 목표 정보에 매칭되는 출력을 산출하는 대모 듈을 그룹핑하는 작업부터 시작된다. 도 5는 본 발명의 일 실시예에 따라 컨설팅 목표 정보에 매칭되는 대모듈을 그룹핑하는 일례를 도시한 도면이다. 도 5를 참조하면, 사용자의 컨설팅 목표 정보가 ‘중장기 실행 계획’ 및 ‘중장기 전략 방향’인 경우가 도시 되어 있으며, 출력이 ‘중장기 실행 계획’에 매칭되거나 ‘중장기 전략 방향’에 매칭되는 대모듈들(M1, M2)이 그룹핑된다. ‘중장기 실행 계획’에 매칭되는 대모듈(M1)은 출력이 ‘중장기 실행 계획/이고 입력이 ‘내부지원 분석 결과 ’ 또는 ‘중장기 재무 목표’인 대모듈이며, ‘중장기 전략 방향’에 매칭되는 대모듈(M2)은 출력이 ‘중장기 전략 방향’이고 입력이 ‘중장기 재무목표’인 모듈이다. 도 5와 같이 그룹핑되는 대모듈을 본 명세서에서는 클러스터라고 정의하며, 사용자의 컨설팅 목표에 매칭되어 첫번째로 그룹핑되는 대모듈 집합은 제1 클러스터가 된다. 제1 클러스터의 형성이 완료되면, 제1 클러스터에 속한 대모듈들에 입력에 매칭되는 출력을 가진 대모듈들이 그 룹핑된다. 즉, 제1 클러스터에 속한 대모듈들의 입력과 동일한 출력을 가진 대모듈들이 그룹핑되는 것이다. 도 6은 도 5의 제1 클러스터를 구성하는 대모듈들과 연결되는 대모듈들을 그룹핑하여 제2 클러스터를 형성하는 예를 도시한 도면이다. 도 6을 참조하면, 도 5의 제1 클러스터의 입력인 ‘내부지원 분석결과’및 ‘중장기 재무목표’를 출력으로 가 지는 대모듈들(M3, M4)이 그룹핑되며, 그릅핑된 대모듈들(M3, M4)이 제2 클러스터로 설정된다. 제1 클러스터에서, 입력인 ‘중장기 재무목표’가 각각의 대도듈(M1, M2)의 입력으로 설정되어 있어 출력이 ‘ 중장기 재무목표’인 대모듈(M4)이 중복으로 그룹핑되는 것을 도 6으로부터 확인할 수 있다. 도 7은 클러스터링 과정에서 발생할 수 있는 중복되는 대모듈을 제거하는 일례를 도시한 도면이다. 도 7을 참조하면, 중복되는 대모듈인 M4가 제거되어 단일의 M3 및 M4로 제2 클러스터가 이루어지는 것을 확인할 수 있다. 제2 클러스터와 연결되는 제3 클러스터 역시 동일한 방식에 의해 형성될 수 있다. 즉, 제2 클러스터를 형성하는 대모듈들의 입력과 동일한 출력을 가지는 대모듈들이 그룹핑되어 제3 클러스터를 형성하는 것이다. 도 8은 도 7의 제2 클러스터와 연결되는 제3 클러스터를 형성하는 일례를 도시한 도면이다. 도 8을 참조하면, 제2 클러스터의 입력 중 ‘기업내부자료’와 매칭되는 출력을 가지는 대모듈은 존재하지 않고 제2 클러스터의 입력 중 ‘전략방향 Pool’에 매칭되는 대모듈(M5)만이 제3 클러스터를 형성하는 것을 확인할수 있다. 연속되는 클러스터를 형성하는 작업은 제N 클러스터의 입력에 매칭되는 출력을 가진 대모듈이 더 이상 존재하지 않을 때까지 계속적으로 이루어진다. 예를 들어, 제N 클러스터에서 클러스터링 작업이 종료될 때 제N 클러스터를 시작 클러스터로 설정하고 제1 클러 스터를 종료 클러스터로 설정한다. 클러스터링 작업이 완료되면, 입출력이 연결 관계에 있는 대모듈들을 연결하며 연결된 각 대모듈에서 하나의 컨 설팅 모듈을 선택하고 이를 연결함으로써 컨설팅 방법론이 생성된다. 하나의 대모듈에 다수 개의 컨설팅 모듈들이 포함되어 있으며, 대모듈간의 연결 역시 다수개가 존재하므로 연결 된 대모듈에서 하나의 컨설팅 모듈을 선택하는 방식에 의해 다수의 컨설팅 방법론들이 생성될 수 있으며, 선택 가능한 모든 경우의 수에 대해 컨설팅 방법론들이 생성된다. 컨설팅 방법론 추출부는 컨설팅 방법론 생성부에 의해 생성된 다수의 컨설팅 방법론들과 사용자의 요 구 정보와의 유사도를 연산하여 사용자가 원하는 컨설팅 방법론을 추출할 수 있도록 한다. 컨설팅 방법론 추출부는 컨설팅 모듈 데이터베이스의 제2 속성 정보 및 사용자가 입력한 키워드 정보의 유 사도를 비교하여 사용자의 요구에 맞는 컨설팅 방법론들이 추출될 수 있도록 한다. 일례로, 사용자가 입력하는 키워드 정보는 ‘대상 산업’, ‘과제 규모’, ‘수행 시기’ 및 ‘수행 기관’에 대한 정보일 수 있으며, 각 입력된 정보와 컨설팅 모듈에 대해 설정된 제2 속성 정보의 유사도를 비교하는 작업 이 이루어지는 것이다. 도 9는 사용자가 입력한 특정 키워드와 생성된 컨설팅 방법론들과의 유사도를 비교한 결과를 표로 도시한 도면 이다. 도 9를 참조하면, 입력한 키워드인 ‘대상 산업’, ‘대상 규모’, ‘수행 시기’ 및 ‘수행 기관’에 대한 정 보들과 생성된 컨설팅 방법론들에 포함된 각 모듈들에 대해 설정된 제2 속성 정보의 유사도를 비교하고 유사도 에 따라 리스팅된 결과가 표를 통해 도시되어 있다. 도 9는 각 키워드에 대해 별도의 가중치를 부여하지 않은 경우의 결과를 표로 나타낸 것이며 사용자는 각 키워 드에 대해 가중치를 부여하여 유사도를 비교할 수도 있다. 위 4개의 키워드에 대해 별도의 가중치 부여가 없다면 각 키워드별로 0.25의 가중치가 설정되나 사용자는 적절 한 컨텐츠 방법론 추출을 위해 가중치를 변경할 수 있다. 일례로, ‘대상 규모’가 가장 중요하다고 판단될 경 우 사용자는 ‘대상 규모’에 대한 가중치를 0.25에서 0.6으로 높일 수 있다. 도 10은 사용자가 ‘대상 규모’에 대한 가중치를 0.25에서 0.6으로 변경하였을 경우의 유사도 연산 결과를 도 시한 표이다. 도 10에 도시된 바와 같이, 도 9의 표와는 유사도가 다르게 계산되어 유사도가 높은 컨설팅 방법론 순위 정보 역시 바뀌게 되며, 사용자는 요청 정보에 합치하는 컨설팅 방법론을 우선적으로 확인할 수 있게 된다. 도 11은 본 발명의 일 실시예에 따른 컨설팅 서비스 제공 방법의 전체적인 흐름을 도시한 도면이다. 도 11을 참조하면, 우선 컨설팅 방법론으로부터 분할되는 컨설팅 모듈들을 저장하는 컨설팅 모듈 데이터베이스 를 구축한다(단계 1100). 각 컨설팅 모듈에는 컨설팅 목표에 대한 제1 속성 정보, 컨설팅이 개별적 속성에 대한 제2 속성 정보 및 컨설팅 모듈의 입출력 정보가 연관된다. 사용자로부터 원하는 컨설팅에 대한 요청 정보가 수신되며(단계 1102), 사용자는 키워드를 입력하는 방식으로 원하는 컨설팅에 대한 정보를 제공할 수 있다. 사용자의 요청 정보가 수신되면, 사용자가 입력한 키워드 중 컨설팅 목표에 대한 키워드에 기초하여 컨설팅 목 표에 매칭되는 컨설팅 모듈들을 추출한다(단계 1104). 컨설팅 모듈들이 추출되면, 추출된 컨설팅 모듈들의 입력 및 출력 정보를 기초로 하여 그룹핑하는 작업을 수행 한다(단계 1106). 전술한 바와 같이, 입력 및 출력 정보가 동일한 컨설팅모듈끼리 그룹핑하며, 이와 같이 그룹 핑된 컨설팅 모듈들은 대모듈로 정의된다. 각 대모듈의 입력 및 출력 정보를 이용하여 클러스터를 형성하고, 각 클러스터를 연결하며, 각 클러스터에 포함 된 컨설팅 모듈들을 조합하여 컨설팅 방법론들을 생성한다(단계 1108). 컨설팅 방법론들이 생성되면, 사용자가 입력한 키워드 정보와의 유사도가 계산되고 유사도 계산을 통해 사용자 의 요구 정보에 부합하는 컨설팅 방법론을 추출한다(단계 1110). 이상과 같이 본 발명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 의해 설명되 었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정되 는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 특허청 구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다 고 할 것이다."}
{"patent_id": "10-2011-0090331", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 컨설팅 방법론과 컨설팅 모듈과의 관계를 도시한 도면. 도 2는 본 발명의 일 실시예에 따른 컨설팅 제공 시스템의 구성을 도시한 도면. 도 3은 본 발명의 일 실시예에 따른 컨설팅 모둘 데이터베이스의 필드 구성을 도시한 도면. 도 4는 본 발명의 일 실시예에 따라 추출된 컨설팅 모듈들을 대모듈 단위로 그룹핑하는 예를 도시한 도면. 도 5는 본 발명의 일 실시예에 따라 컨설팅 목표 정보에 매칭되는 대모듈을 그룹핑하는 일례를 도시한 도면. 도 6은 도 5의 제1 클러스터를 구성하는 대모듈들과 연결되는 대모듈들을 그룹핑하여 제2 클러스터를 형성하는 예를 도시한 도면.도 7은 클러스터링 과정에서 발생할 수 있는 중복되는 대모듈을 제거하는 일례를 도시한 도면. 도 8은 도 7의 제2 클러스터와 연결되는 제3 클러스터를 형성하는 일례를 도시한 도면. 도 9는 사용자가 입력한 특정 키워드와 생성된 컨설팅 방법론들과의 유사도를 비교한 결과를 표로 도시한 도면. 도 10은 사용자가 ‘대상 규모’에 대한 가중치를 0.25에서 0.6으로 변경하였을 경우의 유사도 연산 결과를 도 시한 표로 도시한 도면. 도 11은 본 발명의 일 실시예에 따른 컨설팅 서비스 제공 방법의 전체적인 흐름을 도시한 도면."}
