{"patent_id": "10-2021-0069217", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0160936", "출원번호": "10-2021-0069217", "발명의 명칭": "인공지능 기술을 활용한 목욕기", "출원인": "오성진", "발명자": "오성진"}}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "반려동물의 목욕을 위한 물을 공급받고, 물의 방출량과 온도 조절이 가능한 욕조;상기 반려동물의 건조를 위한 공기를 흡입하고, 공기의 방출량과 온도 조절이 가능한 건조기;사용자의 손에 착용되며, 상기 욕조와 상기 건조기 각각으로부터 물 또는 공기를 공급받도록 복수로 마련되고,일측부에 물 또는 공기가 외부로 방출되도록 하는 복수의 방출구와 상기 반려동물의 지압을 위한 복수의 돌기가형성되며, 상기 일측부와 타측부 각각에 복수의 위치표시 태그가 부착되는 실리콘 장갑;제스처 인터페이스가 구성되어 상기 복수의 위치표시 태그 각각에 고유번호를 부여하며, 렌즈와 마주보는 상기실리콘 장갑의 방향을 판단하고, 상기 실리콘 장갑으로부터 상기 사용자의 제스처를 인식하는 카메라 센서; 및음성 인터페이스가 구성되어 상기 사용자의 음성이 입력될 때 상기 사용자의 음성을 인식하는 단말;을 포함하는것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 카메라 센서는,상기 사용자의 제스처에 따라 상기 욕조의 동작과 물의 방출량 또는 온도를 제어하기 위한 신호를 상기 욕조에송신하는 제1 카메라 센서; 및상기 사용자의 제스처에 따라 상기 건조기의 동작과 공기의 방출량 또는 온도를 제어하기 위한 신호를 상기 건조기에 송신하는 제2 카메라 센서;를 포함하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제1 카메라 센서는,상기 실리콘 장갑의 일측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 주먹 펴기로 인식하는 경우, 상기 욕조의 전원이 켜지도록 하기 위한 전원신호를 상기 욕조에 송신하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 제1 카메라 센서는,상기 실리콘 장갑의 일측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 일부 손가락 펴기로 인식하는 경우, 손가락이 펼쳐지는 개수에 따라 물의 방출량이나 온도가 조절되도록 하기 위한 조절신호를상기 욕조에 송신하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 제1 카메라 센서는,상기 실리콘 장갑의 일측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 주먹 쥐기로 인식하는 경우, 물의 방출량 조절이 종료되고 물의 온도가 조절되도록 하거나 물의 온도 조절이 종료되고 물의 방출량이 조절되도록 하기 위한 동작 변환신호를 상기 욕조에 송신하는 것을 특징으로 하는 인공지능 기술을 활용공개특허 10-2022-0160936-3-한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2 항에 있어서,상기 제1 카메라 센서는,상기 실리콘 장갑의 일측부 또는 타측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 주먹 펴기 상태에서 2번 이상 좌우로 흔들기로 인식하는 경우, 상기 욕조의 전원이 꺼지도록 하기 위한 전원신호를 상기 욕조에 송신하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 2 항에 있어서,상기 제2 카메라 센서는,상기 실리콘 장갑의 일측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 주먹 펴기로 인식하는 경우, 상기 건조기의 전원이 켜지도록 하기 위한 전원신호를 상기 건조기에 송신하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 2 항에 있어서,상기 제2 카메라 센서는,상기 실리콘 장갑의 타측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 일부 손가락 펴기로 인식하는 경우, 손가락이 펼쳐지는 개수에 따라 공기의 방출량이나 온도가 조절되도록 하기 위한 조절신호를 상기 건조기에 송신하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 2 항에 있어서,상기 제2 카메라 센서는,상기 실리콘 장갑의 타측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 주먹 쥐기로 인식하는 경우, 공기의 방출량이 조절되도록 하기 위한 동작 변환신호를 상기 건조기에 송신하는 것을 특징으로하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 2 항에 있어서,상기 제2 카메라 센서는,상기 실리콘 장갑의 타측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 주먹 펴기로 인식하는 경우, 공기의 온도가 조절되도록 하기 위한 동작 변환신호를 상기 건조기에 송신하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 2 항에 있어서,상기 제2 카메라 센서는,상기 실리콘 장갑의 일측부 또는 타측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 주먹 펴기 상태에서 2번 이상 좌우로 흔들기로 인식하는 경우, 상기 건조기의 전원이 꺼지도록 하기 위한 전원신호를 상기 건조기에 송신하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2022-0160936-4-제 1 항에 있어서,상기 욕조 및 상기 건조기는,서로 간의 일측에 각각 구비된 결합부재를 통해 분리 또는 결합되는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 카메라 센서는,상기 렌즈와 마주보는 상기 실리콘 장갑의 방향을 판단하고, 상기 사용자의 제스처에 따라 상기 욕조 및 상기건조기 중 적어도 하나의 동작과 물 또는 공기의 방출량이나 온도를 제어하기 위한 신호를 상기 욕조 및 상기건조기 중 적어도 하나에 송신하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서,상기 실리콘 장갑은,상기 복수의 위치표시 태그가 상기 일측부에는 상기 복수의 방출구 각각의 사이 공간과 상기 복수의 돌기 각각의 사이 공간에 부착되는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항에 있어서,상기 욕조는,상기 반려동물을 수용하는 욕조 본체;상기 욕조 본체의 일측에 구비되고, 제1 방출호스를 통해 연결되는 상기 실리콘 장갑으로 방출될 물을 저장하는물탱크;상기 물탱크의 내부에 구비되어 상기 물탱크의 방출구를 개폐하고, 상기 방출구의 개폐 정도를 제어하여 상기물탱크에 저장된 물의 방출량을 조절하는 스로틀 밸브;상기 물탱크의 내부에 배선되어 상기 물탱크에 저장된 물을 가열하는 제1 니크롬선; 및상기 제1 방출호스의 권취가 이루어지도록 상기 욕조 본체로부터 돌출되는 복수의 제1 권취수단;을 포함하는 것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 1 항에 있어서,상기 건조기는,공기 흡입구가 형성되고, 제2 방출호스를 통해 상기 실리콘 장갑과 연결되는 건조기 본체;상기 건조기 본체의 내부에 구비되고, 전원을 공급받아 구동되는 모터;상기 모터가 구동될 때 회전되어 상기 공기 흡입구를 통해 상기 건조기 본체의 내부에 공기가 흡입되도록 하는팬;상기 건조기 본체의 내부에 배선되어 상기 건조기 본체의 내부로 흡입된 공기를 가열하는 제2 니크롬선; 및상기 제2 방출호스의 권취가 이루어지도록 상기 건조기 본체로부터 돌출되는 복수의 제2 권취수단;을 포함하는것을 특징으로 하는 인공지능 기술을 활용한 목욕기."}
{"patent_id": "10-2021-0069217", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능 기술을 활용한 목욕기는 반려동물의 목욕을 위한 물을 공급받고, 물의 방 출량과 온도 조절이 가능한 욕조; 상기 반려동물의 건조를 위한 공기를 흡입하고, 공기의 방출량과 온도 조절이 가능한 건조기; 사용자의 손에 착용되며, 상기 욕조와 상기 건조기 각각으로부터 물 또는 공기를 공급받도록 복 수로 마련되고, 일측부에 물 또는 공기가 외부로 방출되도록 하는 복수의 방출구와 상기 반려동물의 지압을 위한 복수의 돌기가 형성되며, 상기 일측부와 타측부 각각에 복수의 위치표시 태그가 부착되는 실리콘 장갑; 제스처 인터페이스가 구성되어 상기 복수의 위치표시 태그 각각에 고유번호를 부여하며, 렌즈와 마주보는 상기 실리콘 장갑의 방향을 판단하고, 상기 실리콘 장갑으로부터 상기 사용자의 제스처를 인식하는 카메라 센서; 및 음성 인 터페이스가 구성되어 상기 사용자의 음성이 입력될 때 상기 사용자의 음성을 인식하는 단말;을 포함할 수 있다."}
{"patent_id": "10-2021-0069217", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기술을 활용한 목욕기에 관한 것으로, 보다 상세하게는 사용자의 제스처 및/또는 음성에 따 라 반려동물을 목욕시킬 수 있는 인공지능 기술을 활용한 목욕기에 관한 것이다."}
{"patent_id": "10-2021-0069217", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "반려동물에 대한 관심과 수요가 늘어남에 따라, 사람들과 같은 공간에서 생활하는 반려동물의 청결에 대한 관심 도가 높아지고 있다. 가정에서 생활하는 반려동물에 대한 목욕은 주로 욕실에서 샤워기와 별도의 드라이기 등을 통해 이루어지고 있 으나, 욕실에서 반려동물의 목욕이 진행되는 경우 반려동물이 움직이거나 본능적으로 몸에 묻은 물을 털기 위한 동작을 하기 때문에 목욕시간이 길어지며, 주변환경이 오염되는 문제 및 물의 과다사용 문제 등이 발생할 수 있 다. 따라서, 최근에는 반려동물을 목욕시킬 수 있는 일정한 공간을 마련하고, 해당공간에서 세척수 또는 공기를 분 사하여 반려동물의 목욕을 수행할 수 있는 장치들이 개발되고 있다. 이러한 반려동물 목욕장치의 선행기술로서 대한민국 공개특허공보 제10-2003-0020892호와 대한민국 공개실용신 안공보 제20-2013-0004113호에서는 목욕과정에서 반려동물의 움직임을 제한할 수 있는 장치를 개시하고 있다. 그러나 상기 선행기술들은 목욕에 사용되는 물이 여전히 과다하게 사용될 뿐만 아니라, 워싱(washing)과 건조 (dry)를 함께 진행하는 경우 구조의 복잡성과 건조 유로 상의 전기장치로 물이 유입되어 전기장치의 고장이 우 려되는 문제점이 있었다. 또한, 상기 선행기술들은 사용자가 물 또는 공기의 방출량이나 온도를 반려동물의 목욕에 적합하도록 미세하게 제어하기가 어려움에 따라 반려동물의 목욕 효율이 떨어지는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2003-0020892호 (특허문헌 0002) 대한민국 공개실용신안공보 제20-2013-0004113호"}
{"patent_id": "10-2021-0069217", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 목적을 달성하기 위해 안출된 것으로서, 반려동물의 목욕 효율이 향상되도록 사용자의 제스처를 인식하는 카메라 인식장치와 사용자의 음성을 인식하는 단말을 구비하여 사용자의 제스처 및/또는 음 성에 따라 물 또는 공기의 방출량이나 온도를 제어할 수 있는 반려동물의 목욕이 용이한 인공지능 기술을 활용 한 목욕기를 제공하는데 목적이 있다. 다만, 본 발명에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지"}
{"patent_id": "10-2021-0069217", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0069217", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 인공지능 기술을 활용한 목욕기에 있어서, 반려동물의 목욕을 위한 물을 공 급받고, 물의 방출량과 온도 조절이 가능한 욕조; 상기 반려동물의 건조를 위한 공기를 흡입하고, 공기의 방출 량과 온도 조절이 가능한 건조기; 사용자의 손에 착용되며, 상기 욕조와 상기 건조기 각각으로부터 물 또는 공 기를 공급받도록 복수로 마련되고, 일측부에 물 또는 공기가 외부로 방출되도록 하는 복수의 방출구와 상기 반 려동물의 지압을 위한 복수의 돌기가 형성되며, 상기 일측부와 타측부 각각에 복수의 위치표시 태그가 부착되는 실리콘 장갑; 제스처 인터페이스가 구성되어 상기 복수의 위치표시 태그 각각에 고유번호를 부여하며, 렌즈와마주보는 상기 실리콘 장갑의 방향을 판단하고, 상기 실리콘 장갑으로부터 상기 사용자의 제스처를 인식하는 카 메라 센서; 및 음성 인터페이스가 구성되어 상기 사용자의 음성이 입력될 때 상기 사용자의 음성을 인식하는 단 말;을 포함할 수 있다. 그리고 상기 카메라 센서는, 상기 사용자의 제스처에 따라 상기 욕조의 동작과 물의 방출량 또는 온도를 제어하 기 위한 신호를 상기 욕조에 송신하는 제1 카메라 센서; 및 상기 사용자의 제스처에 따라 상기 건조기의 동작과 공기의 방출량 또는 온도를 제어하기 위한 신호를 상기 건조기에 송신하는 제2 카메라 센서;를 포함할 수 있다. 또한, 상기 제1 카메라 센서는, 상기 실리콘 장갑의 일측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사 용자의 제스처를 주먹 펴기로 인식하는 경우, 상기 욕조의 전원이 켜지도록 하기 위한 전원신호를 상기 욕조에 송신할 수 있다. 그리고 상기 제1 카메라 센서는, 상기 실리콘 장갑의 일측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사 용자의 제스처를 일부 손가락 펴기로 인식하는 경우, 손가락이 펼쳐지는 개수에 따라 물의 방출량이나 온도가 조절되도록 하기 위한 조절신호를 상기 욕조에 송신할 수 있다. 또한, 상기 제1 카메라 센서는, 상기 실리콘 장갑의 일측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사 용자의 제스처를 주먹 쥐기로 인식하는 경우, 물의 방출량 조절이 종료되고 물의 온도가 조절되도록 하거나 물 의 온도 조절이 종료되고 물의 방출량이 조절되도록 하기 위한 동작 변환신호를 상기 욕조에 송신할 수 있다. 그리고 상기 제1 카메라 센서는, 상기 실리콘 장갑의 일측부 또는 타측부와 상기 렌즈가 마주보는 것으로 판단 한 후 상기 사용자의 제스처를 주먹 펴기 상태에서 2번 이상 좌우로 흔들기로 인식하는 경우, 상기 욕조의 전원 이 꺼지도록 하기 위한 전원신호를 상기 욕조에 송신할 수 있다. 또한, 상기 제2 카메라 센서는, 상기 실리콘 장갑의 일측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사 용자의 제스처를 주먹 펴기로 인식하는 경우, 상기 건조기의 전원이 켜지도록 하기 위한 전원신호를 상기 건조 기에 송신할 수 있다. 그리고 상기 제2 카메라 센서는, 상기 실리콘 장갑의 타측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사 용자의 제스처를 일부 손가락 펴기로 인식하는 경우, 손가락이 펼쳐지는 개수에 따라 공기의 방출량이나 온도가 조절되도록 하기 위한 조절신호를 상기 건조기에 송신할 수 있다. 또한, 상기 제2 카메라 센서는, 상기 실리콘 장갑의 타측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사 용자의 제스처를 주먹 쥐기로 인식하는 경우, 공기의 방출량이 조절되도록 하기 위한 동작 변환신호를 상기 건 조기에 송신할 수 있다. 그리고 상기 제2 카메라 센서는, 상기 실리콘 장갑의 타측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사 용자의 제스처를 주먹 펴기로 인식하는 경우, 공기의 온도가 조절되도록 하기 위한 동작 변환신호를 상기 건조 기에 송신할 수 있다. 또한, 상기 제2 카메라 센서는, 상기 실리콘 장갑의 일측부 또는 타측부와 상기 렌즈가 마주보는 것으로 판단한 후 상기 사용자의 제스처를 주먹 펴기 상태에서 2번 이상 좌우로 흔들기로 인식하는 경우, 상기 건조기의 전원 이 꺼지도록 하기 위한 전원신호를 상기 건조기에 송신할 수 있다. 그리고 상기 욕조 및 상기 건조기는, 서로 간의 일측에 각각 구비된 결합부재를 통해 분리 또는 결합될 수 있다. 또한, 상기 카메라 센서는, 상기 렌즈와 마주보는 상기 실리콘 장갑의 방향을 판단하고, 상기 사용자의 제스처 에 따라 상기 욕조 및 상기 건조기 중 적어도 하나의 동작과 물 또는 공기의 방출량이나 온도를 제어하기 위한 신호를 상기 욕조 및 상기 건조기 중 적어도 하나에 송신할 수 있다. 그리고 상기 실리콘 장갑은, 상기 복수의 위치표시 태그가 상기 일측부에는 상기 복수의 방출구 각각의 사이 공 간과 상기 복수의 돌기 각각의 사이 공간에 부착될 수 있다. 또한, 상기 욕조는, 상기 반려동물을 수용하는 욕조 본체; 상기 욕조 본체의 일측에 구비되고, 제1 방출호스를 통해 연결되는 상기 실리콘 장갑으로 방출될 물을 저장하는 물탱크; 상기 물탱크의 내부에 구비되어 상기 물탱 크의 방출구를 개폐하고, 상기 방출구의 개폐 정도를 제어하여 상기 물탱크에 저장된 물의 방출량을 조절하는 스로틀 밸브; 상기 물탱크의 내부에 배선되어 상기 물탱크에 저장된 물을 가열하는 제1 니크롬선; 및 상기 제1 방출호스의 권취가 이루어지도록 상기 욕조 본체로부터 돌출되는 복수의 제1 권취수단;을 포함할 수 있다.그리고 상기 건조기는, 공기 흡입구가 형성되고, 제2 방출호스를 통해 상기 실리콘 장갑과 연결되는 건조기 본 체; 상기 건조기 본체의 내부에 구비되고, 전원을 공급받아 구동되는 모터; 상기 모터가 구동될 때 회전되어 상 기 공기 흡입구를 통해 상기 건조기 본체의 내부에 공기가 흡입되도록 하는 팬; 상기 건조기 본체의 내부에 배 선되어 상기 건조기 본체의 내부로 흡입된 공기를 가열하는 제2 니크롬선; 및 상기 제2 방출호스의 권취가 이루 어지도록 상기 건조기 본체로부터 돌출되는 복수의 제2 권취수단;을 포함할 수 있다."}
{"patent_id": "10-2021-0069217", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 사용자의 제스처 및/또는 음성을 통해 물 또는 공기의 방출량이나 온도를 제어할 수 있어 반려동물의 목욕 과정이 용이해지며, 이에 따라 사용자의 편의성이 향상될 수 있다. 또한, 본 발명은 물 또는 공기의 방출량이나 온도를 제어하기 위하여 목욕과정을 일시정지한 후 다시 목욕과정 을 수행하는 번거로움을 피할 수 있다. 그리고 본 발명은 물 또는 공기의 방출량이나 온도 제어를 통해 쾌적한 분위기 속에서 반려동물의 목욕이 이루 어지도록 하는 효과가 있다. 다만, 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효"}
{"patent_id": "10-2021-0069217", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0069217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명에 관한 설명은 구조적 내지 기능 적 설명을 위한 실시예에 불과하므로, 본 발명의 권리범위는 본문에 설명된 실시예에 의하여 제한되는 것으로 해석되어서는 아니 된다. 즉, 실시예는 다양한 변경이 가능하고 여러 가지 형태를 가질 수 있으므로 본 발명의 권리범위는 기술적 사상을 실현할 수 있는 균등물들을 포함하는 것으로 이해되어야 한다. 또한, 본 발명에서 제 시된 목적 또는 효과는 특정 실시예가 이를 전부 포함하여야 한다거나 그러한 효과만을 포함하여야 한다는 의미 는 아니므로, 본 발명의 권리범위는 이에 의하여 제한되는 것으로 이해되어서는 아니 될 것이다. 본 발명에서 서술되는 용어의 의미는 다음과 같이 이해되어야 할 것이다. \"제1\", \"제2\" 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위한 것으로, 이들 용어들에 의해 권리범위가 한정되어서는 아니 된다. 예를 들어, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결될 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어 야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다고 언급된 때에는 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 한편, 구성요소들 간의 관계를 설명하는 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 이웃하는\"과 \"~에 직접 이웃하는\" 등도 마찬가지로 해석되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, \"포함 하다\" 또는 \"가지다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 여기서 사용되는 모든 용어들은 다르게 정의되지 않는 한, 본 발명이 속하는 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 용어들은 관 련 기술의 문맥상 가지는 의미와 일치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한 이 상적이거나 과도하게 형식적인 의미를 지니는 것으로 해석될 수 없다. 본 발명의 일 실시예에 따른 인공지능 기술을 활용한 목욕기는 물 또는 공기의 방출량이나 온도를 제어하여 반 려동물의 세척 및 건조(이하에서는 '목욕'이라 함.)의 과정이 용이해지도록 하며, 이를 위해 욕조, 건조기 , 실리콘 장갑, 카메라 센서 및 단말이 구비된다. 이하에서는, 반려동물을 세척하기 위한 욕조에 대해 자세히 설명하도록 하겠다. 도 1은 반려동물 목욕 과정에서 사용되는 본 발명의 일 실시예에 따른 인공지능 기술을 활용한 목욕기를 나타내 는 개념도이다. 도 1을 참조하면, 욕조는 반려동물의 세척이 이루어지는 장치로서 욕조 본체, 물탱크 및 제1 권 취수단과 도면에 미도시된 스로틀 밸브 및 제1 니크롬선이 구비된다. 욕조 본체는 상측이 개방되어 반려동물의 수용이 가능하고, 물탱크가 측부의 일측에 결합되며, 제1 권취수단이 상부의 끝단이 만나는 지점으로부터 상측을 향해 돌출되는 형태로 구비된다. 상기 욕조 본체는 연결호스를 통해 정수지 등의 시설로부터 물을 수용하는 수도장치와 연결되고, 상기 연결호스를 따라 이동되는 물이 물탱크에 공급되도록 한다. 물탱크는 욕조 본체의 측부 일측에 결합되며, 상기 욕조 본체가 연결호스를 통해 공급받은 물을 저장하고, 실리콘 장갑으로 반려동물의 세척에 사용될 물을 공급한다. 상기 물탱크는 실리콘 장갑으로 물을 방출하기 위하여 제1 방출호스를 통해 상기 실리콘 장갑 과 연결된다. 이때, 상기 실리콘 장갑은 반려동물을 향해 물을 방출하기 위하여 제1 방출호스를 통해 상기 물탱크 와 연결되는 제1 실리콘 장갑일 수 있다. 상기 물탱크는 저장된 물의 방출량이 반려동물을 세척하는데 있어 적정한 방출량만큼 방출되도록, 스로틀 밸브가 내부에 구비된다. 상기 스로틀 밸브는 물탱크의 방출구를 개방 또는 폐쇄(이하에서는 '개폐'라 함.)하며, 상기 방출구의 개 폐 정도를 제어하여 상기 물탱크에 저장된 물의 방출량이 반려동물을 세척하는데 적정한 방출량이 되도록 조절한다. 상기 스로틀 밸브가 물탱크의 방출구를 개폐하는 방식은 통상적인 것이므로, 이에 대한 자세한 설명은 편 의상 생략하도록 하겠다. 상기 물탱크는 상기 스로틀 밸브 뿐만 아니라, 물의 온도가 반려동물을 세척하는데 있어 적정한 온도를 가 지도록, 제1 니크롬선이 내부에 구비된다. 상기 제1 니크롬선은 물탱크의 내부에 배선되고, 흐르는 전류에 따라 발열되어 상기 물탱크에 저장된 물을 가열한다. 상기 제1 니크롬선이 흐르는 전류에 따라 발열되는 것은 통상적인 것이므로, 이에 대한 자세한 설명은 편의상 생략하도록 하겠다. 도 2는 본 발명의 일 실시예에 따른 제1 방출호스의 보관 방식을 설명하기 위한 사시도이다. 도 2를 참조하면, 제1 권취수단은 욕조 본체의 상부로부터 돌출되는 4개의 권취수단(130a, 130b, 130c, 130d)으로 이루어지며, 반려동물의 목욕 과정이 종료되면 반려동물을 목욕시키는 사용자(이하, '사용자' 라 함.)에 의해 상기 권취수단(130a, 130b, 130c, 130d)을 축으로 제1 방출호스의 권취가 이루어짐으로써, 상기 제1 방출호스의 보관이 용이해지도록 한다. 이하에서는, 상기 욕조 및 상기 제1 실리콘 장갑을 통해 세척이 완료된 반려동물을 건조하기 위한 건 조기에 대해 자세히 설명하도록 하겠다. 도 3은 반려동물 건조 과정에서 사용되는 본 발명의 일 실시예에 따른 인공지능 기술을 활용한 목욕기를 나타내 는 개념도이다. 도 3을 참조하면, 건조기는 반려동물의 건조가 이루어지는 장치로서 건조기 본체, 공기 흡입구, 제2 방출호스, 제2 권취수단 및 손잡이와 도면에 미도시된 모터, 팬 및 제2 니크롬선이 상기 건 조기 본체의 내부에 구비된다. 건조기 본체는 공기 흡입구가 일측에 형성되고, 타측에 결합된 제2 방출호스를 통해 실리콘 장 갑과 연결되어 반려동물의 건조를 위한 공기가 상기 실리콘 장갑에 공급되도록 한다. 이때, 상기 실리콘 장갑은 반려동물을 향해 공기를 방출하기 위하여 제2 방출호스와 연결되는 제2 실 리콘 장갑일 수 있다. 상기 건조기 본체는 상부에 구비되는 손잡이를 통해 사용자에 의해 파지되어 상기 사용자가 원하는 위치로 용이하게 이동될 수 있다. 상기 건조기 본체는 공기흡입구를 통과하여 내부에 흡입되는 공기의 방출량이 반려동물을 건조하는데 있어 적정한 방출량만큼 방출되도록, 모터 및 팬이 내부에 구비된다. 상기 모터는 전원을 공급받아 구동되며, 상기 팬은 상기 모터와 연결됨으로써 상기 모터가 구동될 때 회전되어 반려동물을 건조하는데 있어 적정한 방출량만큼의 공기가 공기 흡입구를 통해 건조기 본체의 내부로 흡입되도록 한다. 상기 모터의 구동과 상기 팬의 회전은 통상적인 것이므로, 이에 대한 자세한 설명은 편의상 생략하도록 하겠다. 상기 건조기 본체는 상기 모터 및 팬 뿐만 아니라, 공기흡입구를 통과하여 내부에 흡입되는 공기의 온도가 반려동물을 건조하는데 있어 적정한 온도를 가지도록, 제2 니크롬선이 내부에 구비된다. 상기 제2 니크롬선은 건조기 본체의 내부에 배선되고, 흐르는 전류에 따라 발열되어 팬에 의해 공기 흡입 구를 통과하여 상기 건조기 본체의 내부로 흡입되는 공기를 반려동물을 건조하는데 있어 적정한 온도 가 되도록 가열한다. 상기 제2 니크롬선의 발열 방식은 통상적인 것이므로, 이에 대한 자세한 설명은 편의상 생략하도록 하겠다. 도 4는 본 발명의 일 실시예에 따른 제2 방출호스의 보관 방식을 설명하기 위한 사시도이다. 도 4를 참조하면, 제2 권취수단은 건조기 본체의 상부로부터 돌출되는 4개의 권취수단(213a, 213b, 213c, 213d)으로 이루어지며, 반려동물의 건조 과정이 종료되면 사용자에 의해 상기 권취수단(213a, 213b, 213c, 213d)을 축으로 제2 방출호스의 권취가 이루어짐으로써, 상기 제2 방출호스의 보관이 용이해지 도록 한다. 이하에서는, 반려동물의 목욕이 이루어지도록 하는 실리콘 장갑에 대해 자세히 설명하도록 하겠다. 도 5는 본 발명의 일 실시예에 따른 실리콘 장갑을 나타내는 평면도이고, 도 6은 본 발명의 일 실시예에 따른 실리콘 장갑을 나타내는 측면도이며, 도 7은 본 발명의 일 실시예에 따른 실리콘 장갑을 나타내는 저면도이다. 도 5 내지 도 7을 참조하면, 실리콘 장갑은 반려동물을 목욕시키는 사용자의 손에 착용되며, 욕조로 부터 물을 공급받는 제1 실리콘 장갑과 건조기로부터 공기를 공급받는 제2 실리콘 장갑으로 나 누어진다.이하에서는, 상기 제1 실리콘 장갑과 상기 제2 실리콘 장갑에 각각 구비되는 구성요소를 상기 제1 실 리콘 장갑을 기준으로 자세히 설명하도록 하겠다. 또한, 상기 제2 실리콘 장갑에 구비되는 구성요소는 상기 제1 실리콘 장갑에 구비되는 구성요소와 도 면부호를 달리하는 것이 바람직하나, 본 발명에서는 동일한 도면부호의 구성요소로 설명하도록 하겠다. 상기 제1 실리콘 장갑에는 복수의 방출구, 복수의 돌기 및 복수의 위치표시 태그가 구비된 다. 구체적인 일례로, 상기 제1 실리콘 장갑은 복수의 방출구, 복수의 돌기 및 복수의 위치표시 태 그(314a)가 도 5에 도시된 바와 같이 사용자의 손이 착용될 때를 기준으로 상기 사용자의 손바닥과 내면이 접하 게 되는 일측부(310a)에 각각 구비되고, 복수의 위치표시 태그(314b)가 도 7에 도시된 바와 같이 상기 사용자의 손등과 내면이 접하게 되는 타측부(310b)에 구비된다. 상기 복수의 방출구는 사용자의 손바닥과 맞닿는 일측부(310a)의 중심영역에 복수로 형성되며, 제1 실리콘 장갑으로 공급된 물이 방출되도록 한다. 이때, 상기 복수의 방출구로부터 방출된 물은 욕조 본체에 수용되는 반려동물을 향해 분사되어 반려 동물의 세척 과정이 이루어지도록 하는 것이 바람직하다. 이와 달리, 상기 복수의 방출구는 제2 실리콘 장갑에 구비될 때 반려동물의 건조 과정이 이루어지도 록, 제2 실리콘 장갑으로 공급된 공기가 방출되도록 한다. 상기 복수의 돌기는 반려동물의 목욕 과정동안 상기 반려동물을 지압하거나 반려동물의 목욕 과정에서 엉 킬 수 있는 반려동물의 털을 빗어주기 위해 일측부(310a)의 영역에 복수로 형성된다. 상기 복수의 돌기는 반려동물의 지압 또는 털을 빗어주는 과정에서 상기 반려동물에게 상처를 입히지 않도 록 실리콘, 고무 등의 유연한 재질로 이루어지는 것이 바람직하다. 상기 복수의 위치표시 태그는 복수의 방출구 각각의 사이 공간과 복수의 돌기 각각의 사이 공간 에 부착되어 카메라 센서가 제1 실리콘 장갑 또는 제2 실리콘 장갑을 통해 사용자의 제스처를 인식할 수 있도록 한다. 상기 복수의 위치표시 태그는 카메라 센서가 사용자의 제스처 인식 과정을 수행하도록 상기 카메라 센서의 제스처 인터페이스와 통신이 가능한 RFID(Radio-Frequency Identification) 태그일 수 있으나, 상 기 제스처 인터페이스와 통신 가능한 방식이라면 이를 한정하는 것은 아니다. 한편, 상기 실리콘 장갑은 장갑의 형태로 한정되는 것은 아니며, 도면에 미도시되었으나 사용자의 손가락 에 착용 가능한 반지 또는 팔목에 착용 가능한 팔찌 형태의 웨어러블 장치로 구현될 수 있다. 즉, 상기 실리콘 장갑은 장갑, 반지 및 팔찌 형태 중 적어도 하나로 구현되는 것으로 이해되는 것이 바람 직하다. 상기 실리콘 장갑은 반지 또는 팔찌 형태의 웨어러블 장치로 구현되어도 반려동물의 지압, 물 또는 공기의 방출이 가능할 수 있다. 다만, 사용자에게 쾌적한 착용감을 제공하기 위해 반려동물의 목욕과정에서 사용되는 복수의 방출구 및 복수의 돌기이 제거될 수 있으며, 이 경우 복수의 방출구 및 복수의 돌기 는 제1 방출호스 및/또는 제2 방출호스와 연결되는 목욕수단에 구비될 수 있다. 상기 실리콘 장갑은 반지 형태로 구현되면, 일측부(310a)는 손바닥과 이어지는 손가락 마디가 접촉되는 부 분이며, 타측부(310b)는 손등과 이어지는 손가락 마디가 접촉되는 부분일 수 있다. 이와 달리 만약에 팔찌 형태 로 구현된다면, 일측부(310a)는 손바닥과 이어지는 팔목이 접촉되는 부분이며, 타측부(310b)는 손등과 이어지는 팔목이 접촉되는 부분일 수 있다. 상기 실리콘 장갑은 카메라 센서와 통신되는 것으로 한정되는 것은 아니며, 반지 또는 팔찌 형태의 웨어러블 장치로 구현되는 경우에 단말과 통신의 통신을 통해 상기 단말이 사용자의 제스처를 인식할 수 있도록 한다. 이때, 상기 단말은 웨어러블 장치의 가속도 및 각속도계 데이터를 산출하여 사용자의 제스처를 인식하는 제스처 인터페이스가 구성될 수 있으며, 상기 단말에 제스처 인터페이스가 구비됨에 따라 카메라 센서 는 본 발명의 인공지능 기술을 활용한 목욕기로부터 생략될 수 있다.상기 단말에 구성된 제스처 인터페이스가 웨어러블 장치의 가속도 및 각속도계 데이터를 산출하여 사용자 의 제스처를 인식하는 과정은 통상적인 것이므로, 편의상 자세한 설명은 생략하도록 하겠다. 상기 실리콘 장갑은 상기 단말이 속도 및 각속도계 데이터를 산출하여 사용자의 제스처를 인식함에 따라, 사용자의 제스처를 인식할 수 있도록 하기 위한 복수의 위치표시 태그(314a, 314b)는 본 발명의 인공지능 기술을 활용한 목욕기로부터 생략될 수 있다. 다시 도 1 및 도 3을 참조하면, 카메라 센서는 제스처 인터페이스가 구성되어 복수의 위치표시 태그(314a, 314b) 각각에 고유번호를 부여하며, 렌즈(411, 421)와 마주보는 제1, 2 실리콘 장갑(310, 320)의 방향을 판단하 고, 상기 제1, 2 실리콘 장갑(310, 320)의 움직임에 따라 렌즈(411, 421)에 촬영되는 상기 복수의 위치표시 태 그(314a, 314b)의 개수 및 위치를 통해 사용자의 제스처를 인식한다. 상기 카메라 센서는 사용자의 제스처를 인식하는데 있어 빛에 민감하며, 사용자의 제스처를 인식하는 과정 동안 빛의 영향에 의해 사용자의 제스처를 정확하게 인식하지 못하는 것을 방지하기 위해 적외선센서로 구현될 수 있다. 상기 카메라 센서는 제1 실리콘 장갑을 통해 사용자의 제스처를 인식하여 욕조의 동작을 제어하 기 위한 제1 카메라 센서 및 제2 실리콘 장갑을 통해 사용자의 제스처를 인식하여 건조기의 동 작을 제어하기 위한 제2 카메라 센서로 나누어진다. 상기 제1 카메라 센서는 욕조의 동작을 제어하기 위해 상기 욕조와 통신 가능한 위치에 배치되 며, 케이블을 통해 전원을 공급받아 동작되어 렌즈와 마주보는 제1 실리콘 장갑의 방향, 복수의 위치표시 태그(314a, 314b)의 개수 및 위치를 통해 사용자의 제스처를 인식하고, 상기 사용자의 제스처에 따라 상기 욕조의 동작과 물의 방출량 또는 온도를 제어하기 위한 신호를 상기 욕조에 송신한다. 상기 제2 카메라 센서는 건조기의 동작을 제어하기 위해 상기 건조기와 통신 가능한 위치에 배 치되며, 케이블을 통해 전원을 공급받아 동작되어 렌즈와 마주보는 제2 실리콘 장갑의 방향, 복 수의 위치표시 태그(314a, 314b)의 개수 및 위치를 통해 사용자의 제스처를 인식하고, 상기 사용자의 제스처에 따라 상기 건조기의 동작과 공기의 방출량 또는 온도를 제어하기 위한 신호를 상기 건조기에 송신한 다. 이하에서는, 제1, 2 카메라 센서(410, 420)가 제1, 2 실리콘 장갑(310, 320)을 통해 인식할 수 있는 사용자의 제스처의 종류에 대해 자세히 설명하도록 하겠다. 도 8 내지 도 11은 사용자의 제스처에 따른 욕조 및 건조기의 동작과 물 또는 공기의 방출량이나 온도를 제어하 는 방식을 설명하기 위한 도면으로서, 사용자의 손모양으로 도시되었으나 실제로는 사용자의 손에 착용된 제1 실리콘 장갑 또는 제2 실리콘 장갑인 것이 바람직하다. 도 8의 (a)를 참조하면, 제1 카메라 센서는 제1 실리콘 장갑의 일측부(310a)와 렌즈가 마주보는 것으로 판단한 후 상기 렌즈에 촬영되는 복수의 위치표시 태그(314a)의 개수 및 위치를 통해 사용자의 제 스처를 주먹 펴기로 인식하는 경우, 욕조의 전원이 켜지도록 하기 위한 전원신호를 상기 욕조에 송신 한다. 또한, 제2 카메라 센서는 제2 실리콘 장갑의 일측부(310a)와 렌즈가 마주보는 것으로 판단한 후 상기 렌즈에 촬영되는 복수의 위치표시 태그(314a)의 개수 및 위치를 통해 사용자의 제스처를 주먹 펴기로 인식하는 경우, 건조기의 전원이 켜지도록 하기 위한 전원신호를 상기 건조기에 송신한다. 도 8의 (b) 내지 (d)를 참조하면, 제1 카메라 센서는 제1 실리콘 장갑의 일측부(310a)와 렌즈가 마주보는 것으로 판단한 후 상기 렌즈에 촬영되는 복수의 위치표시 태그(314a)의 개수 및 위치를 통해 사 용자의 제스처를 일부 손가락 펴기로 인식하는 경우, 손가락이 펼쳐지는 개수에 따라 물의 방출량이 조절되도록 하기 위한 조절신호를 욕조에 송신한다. 구체적인 일례로, 제1 카메라 센서는 물의 방출량이 조절되기 위한 조절신호를 욕조에 송신한 후, 사 용자의 제스처를 엄지손가락 펴기로 인식하는 경우, 물의 방출량이 1단계로 조절되도록 하기 위한 조절신호를 욕조에 송신하며, 사용자의 제스처를 엄지 및 집게손가락 펴기로 인식하는 경우, 물의 방출량이 상기 1단 계보다 상대적으로 많은 2단계로 조절되도록 하기 위한 조절신호를 상기 욕조에 송신하고, 사용자의 제스 처를 엄지, 집게 및 장지손가락 펴기로 인식하는 경우, 물의 방출량이 상기 2단계보다 상대적으로 많은 3단계로조절되도록 하기 위한 조절신호를 상기 욕조에 송신할 수 있다. 도 9의 (a)를 참조하면, 제1 카메라 센서는 제1 실리콘 장갑의 일측부(310a)와 렌즈가 마주보는 것으로 판단한 후 상기 렌즈에 촬영되는 복수의 위치표시 태그(314a)의 개수 및 위치를 통해 사용자의 제 스처를 주먹 쥐기로 인식하는 경우, 물의 방출량 조절이 종료되고 물의 온도가 조절되도록 하기 위한 동작 변환 신호를 욕조에 송신한다. 다만, 상기 욕조가 물의 방출량 조절이 아닌 물의 온도를 조절하는 상태인 경우, 제1 카메라 센서는 사용자의 제스처를 주먹 쥐기로 인식하면, 물의 온도 조절이 종료되고 물의 방출량이 조절되도록 하기 위한 동 작 변환신호를 상기 욕조에 송신할 수 있다. 도 9의 (b) 내지 (d)를 참조하면, 제1 카메라 센서는 욕조에 물의 온도가 조절되도록 하기 위한 동작 변환신호를 송신한 후 제1 실리콘 장갑의 일측부(310a)와 렌즈가 마주보는 것으로 판단하여 상기 렌 즈에 촬영되는 복수의 위치표시 태그(314a)의 개수 및 위치를 통해 사용자의 제스처를 일부 손가락 펴기로 인식하는 경우, 손가락이 펼쳐지는 개수에 따라 물의 온도가 조절되도록 하기 위한 조절신호를 상기 욕조 에 송신한다. 구체적인 일례로, 제1 카메라 센서는 물의 온도가 조절되도록 하기 위한 조절신호를 욕조에 송신한 후, 사용자의 제스처를 엄지손가락 펴기로 인식하는 경우, 물의 온도가 1단계로 조절되도록 하기 위한 조절신호 를 욕조에 송신하며, 사용자의 제스처를 엄지 및 집게손가락 펴기로 인식하는 경우, 물의 온도가 상기 1단 계보다 상대적으로 높은 2단계로 조절되도록 하기 위한 조절신호를 상기 욕조에 송신하고, 사용자의 제스 처를 엄지, 집게 및 장지손가락 펴기로 인식하는 경우, 물의 온도가 상기 2단계보다 상대적으로 높은 3단계로 조절되도록 하기 위한 조절신호를 상기 욕조에 송신할 수 있다. 도 10의 (a)를 참조하면, 제2 카메라 센서는 제2 실리콘 장갑의 타측부(310b)와 렌즈가 마주보 는 것으로 판단한 후 상기 렌즈에 촬영되는 복수의 위치표시 태그(314b)의 개수 및 위치를 통해 사용자의 제스처를 주먹 쥐기로 인식하는 경우, 공기의 방출량이 절되도록 하기 위한 동작 변환신호를 건조기에 송 신한다. 도 10의 (b) 내지 (d)를 참조하면, 제2 카메라 센서는 제2 실리콘 장갑의 타측부(310b)와 렌즈(42 1)가 마주보는 것으로 판단한 후 상기 렌즈에 촬영되는 복수의 위치표시 태그(314b)의 개수 및 위치를 통 해 사용자의 제스처를 일부 손가락 펴기로 인식하는 경우, 손가락이 펼쳐지는 개수에 따라 공기의 방출량이 조 절되도록 하기 위한 조절신호를 건조기에 송신한다. 구체적인 일례로, 제2 카메라 센서는 공기의 방출량이 조절되도록 하기 위한 조절신호를 건조기에 송 신한 후, 사용자의 제스처를 엄지손가락 펴기로 인식하는 경우, 공기의 방출량이 1단계로 조절되도록 하기 위한 조절신호를 건조기에 송신하며, 사용자의 제스처를 엄지 및 집게손가락 펴기로 인식하는 경우, 공기의 방 출량이 상기 1단계보다 상대적으로 많은 2단계로 조절되도록 하기 위한 조절신호를 상기 건조기에 송신하 고, 사용자의 제스처를 엄지, 집게 및 장지손가락 펴기로 인식하는 경우, 공기의 방출량이 상기 2단계보다 상대 적으로 많은 3단계로 조절되도록 하기 위한 조절신호를 상기 건조기에 송신할 수 있다. 도 11의 (a)를 참조하면, 제2 카메라 센서는 제2 실리콘 장갑의 타측부(310b)와 렌즈가 마주보 는 것으로 판단한 후 상기 렌즈에 촬영되는 복수의 위치표시 태그(314b)의 개수 및 위치를 통해 사용자의 제스처를 주먹 펴기로 인식하는 경우, 공기의 온도가 조절되도록 하기 위한 동작 변환신호를 건조기에 송 신한다. 도 11의 (b) 내지 (d)를 참조하면, 제2 카메라 센서는 제2 실리콘 장갑의 타측부(310b)와 렌즈(42 1)가 마주보는 것으로 판단한 후 상기 렌즈에 촬영되는 복수의 위치표시 태그(314b)의 개수 및 위치를 통 해 사용자의 제스처를 일부 손가락 펴기로 인식하는 경우, 손가락이 펼쳐지는 개수에 따라 공기의 온도가 조절 되도록 하기 위한 조절신호를 건조기에 송신한다. 구체적인 일례로, 제2 카메라 센서는 공기의 온도가 조절되도록 하기 위한 조절신호를 건조기에 송신 한 후, 사용자의 제스처를 엄지손가락 펴기로 인식하는 경우, 공기의 온도가 1단계로 조절되도록 하기 위한 조 절신호를 건조기에 송신하며, 사용자의 제스처를 엄지 및 집게손가락 펴기로 인식하는 경우, 공기의 온도 가 상기 1단계보다 상대적으로 높은 2단계로 조절되도록 하기 위한 조절신호를 상기 건조기에 송신하고, 사용자의 제스처를 엄지, 집게 및 장지손가락 펴기로 인식하는 경우, 공기의 온도가 상기 2단계보다 상대적으로높은 3단계로 조절되도록 하기 위한 조절신호를 상기 건조기에 송신할 수 있다. 도 11의 (e)를 참조하면, 제1 카메라 센서는 제1 실리콘 장갑의 일측부(310a) 또는 타측부(310b)와 렌즈가 마주보는 것으로 판단한 후, 상기 렌즈에 촬영되는 복수의 위치표시 태그(314a, 314b)의 개수 및 위치를 통해 사용자의 제스처를 주먹 펴기 상태에서 2번 이상 좌우로 흔들기로 인식하는 경우, 욕조의 전원이 꺼지도록 하기 위한 전원신호를 상기 욕조에 송신한다. 또한, 제2 카메라 센서는 제2 실리콘 장갑의 일측부(310a) 또는 타측부(310b)와 렌즈가 마주보 는 것으로 판단한 후, 상기 렌즈에 촬영되는 복수의 위치표시 태그(314a, 314b)의 개수 및 위치를 통해 사 용자의 제스처를 주먹 펴기 상태에서 2번 이상 좌우로 흔들기로 인식하는 경우, 건조기의 전원이 꺼지도록 하기 위한 전원신호를 상기 건조기에 송신한다. 상기 욕조 및 건조기를 제어하기 위한 사용자의 제스처 종류는 상기와 같이 한정되는 것은 아니며, 사용자 제스처 설정모드를 통해 설정 또는 변경될 수 있다. 구체적인 일례로, 사용자는 단말을 통해 제1 카메라 센서를 선택하고, 상기 제1 카메라 센서가 욕조의 전원을 켜지도록 하기 위한 전원신호를 상기 욕조에 송신하기 위한 사용자의 제스처를 변경하 기 위한 사용자 제스처 설정모드로 제어되는 경우, 상기 제1 카메라 센서는 렌즈에 촬영되는 복수의 위치표시 태그(314a, 314b)의 개수 및 위치를 통해 사용자의 제스처를 인식하며, 상기 사용자의 제스처를 전원 신호를 상기 욕조에 송신하기 위한 사용자의 제스처로 설정 또는 변경할 수 있다. 다시 도 1 및 도 3을 참조하면, 단말은 음성 인터페이스가 구성되어 사용자의 음성이 입력될 때 상기 사용 자의 음성을 인식하고, 상기 사용자의 음성을 통해 욕조 또는 건조기의 동작이 제어되도록 한다. 상기 단말은 사용자의 제스처를 인식하는 제1, 2 카메라 센서(410, 420)를 보조하여 욕조 또는 건조 기의 동작이 제어되도록 한다. 즉, 상기 본 발명의 일 실시예에 따른 인공지능 기술을 활용한 목욕기는 사용자의 제스처 및/또는 음성을 통해 반려동물의 목욕 과정이 이루어지도록 하는 것이다. 이하에서는, 상기 본 발명의 일 실시예와 다른 구성요소를 중심으로 본 발명의 다른 실시예에 따른 인공지능 기 술을 활용한 목욕기에 대해 자세히 설명하도록 하겠다. 도 12는 본 발명의 다른 실시예에 따른 인공지능 기술을 활용한 목욕기를 나타내는 개념도이다. 도 12를 참조하면, 건조기에는 카메라 센서가 내장되며, 제2 권취수단을 대신하여 거치 스탠드 가 상부에 구비되어 제2 방출호스가 거치되도록 한다. 상기 건조기에 내장된 카메라 센서는 건조기의 동작을 제어하기 위한 사용자의 제스처를 인식하 는 제2 카메라 센서인 것이 바람직하다. 상기 거치 스탠드는 제2 실리콘 장갑이 분리된 제2 방출호스를 거치시켜 제2 방출호스를 따라 방출되는 공기의 방출방향이 고정되도록 하고, 이를 통해 사용자는 양 손을 자유롭게 사용하면서 반려동물 의 건조 과정을 수행할 수 있게 된다. 이하에서는, 상기 본 발명의 일 실시예 및 다른 실시예와 다른 구성요소를 중심으로 본 발명의 또 다른 실시예 에 따른 인공지능 기술을 활용한 목욕기에 대해 자세히 설명하도록 하겠다. 도 13은 본 발명의 또 다른 실시예에 따른 인공지능 기술을 활용한 목욕기를 나타내는 개념도이다. 도 13을 참조하면, 욕조 및 건조기 각각의 일측에는 결합부재가 구비되고, 상기 욕조 및 건조기는 상기 결합부재를 통해 분리 또는 결합된다. 도면에는 미도시되었으나, 상기 욕조의 제1 권취수단 및 건조기의 제2 권취수단을 대신하 여 거치 스탠드가 상기 욕조 및 건조기에 각각 구비되어 제1 실리콘 장갑이 분리된 제1 방 출호스 및 제2 실리콘 장갑이 분리된 제2 방출호스를 거치시킴으로써, 제1 방출호스를 따 라 방출되는 물의 방출방향과 제2 방출호스를 따라 방출되는 공기의 방출방향이 고정되도록 하고, 이를 통 해 사용자는 양 손을 자유롭게 사용하면서 반려동물의 목욕 과정을 수행할 수 있게 된다.상술한 바와 같이 개시된 본 발명의 바람직한 실시예들에 대한 상세한 설명은 당업자가 본 발명을 구현하고 실 시할 수 있도록 제공되었다. 상기에서는 본 발명의 바람직한 실시예들을 참조하여 설명하였지만, 해당 기술 분 야의 숙련된 당업자는 본 발명의 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시 킬 수 있음을 이해할 수 있을 것이다. 예를 들어, 당업자는 상술한 실시예들에 기재된 각 구성을 서로 조합하는 방식으로 이용할 수 있다. 따라서, 본 발명은 여기에 나타난 실시형태들에 제한되려는 것이 아니라, 여기서 개 시된 원리들 및 신규한 특징들과 일치하는 최광의 범위를 부여하려는 것이다. 본 발명은 본 발명의 정신 및 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있다. 따 라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서 의 모든 변경은 본 발명의 범위에 포함된다. 본 발명은 여기에 나타난 실시형태들에 제한되려는 것이 아니라, 여기서 개시된 원리들 및 신규한 특징들과 일치하는 최광의 범위를 부여하려는 것이다. 또한, 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구 항으로 포함할 수 있다."}
{"patent_id": "10-2021-0069217", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 반려동물 목욕 과정에서 사용되는 본 발명의 일 실시예에 따른 인공지능 기술을 활용한 목욕기를 나타내 는 개념도이다. 도 2는 본 발명의 일 실시예에 따른 제1 방출호스의 보관 방식을 설명하기 위한 사시도이다. 도 3은 반려동물 건조 과정에서 사용되는 본 발명의 일 실시예에 따른 인공지능 기술을 활용한 목욕기를 나타내 는 개념도이다. 도 4는 본 발명의 일 실시예에 따른 제2 방출호스의 보관 방식을 설명하기 위한 사시도이다. 도 5는 본 발명의 일 실시예에 따른 실리콘 장갑을 나타내는 평면도이다. 도 6은 본 발명의 일 실시예에 따른 실리콘 장갑을 나타내는 측면도이다. 도 7은 본 발명의 일 실시예에 따른 실리콘 장갑을 나타내는 저면도이다. 도 8 내지 도 11은 사용자의 제스처에 따른 욕조 및 건조기의 동작과 물 또는 공기의 방출량이나 온도를 제어하 는 방식을 설명하기 위한 도면이다. 도 12는 본 발명의 다른 실시예에 따른 인공지능 기술을 활용한 목욕기를 나타내는 개념도이다. 도 13은 본 발명의 또 다른 실시예에 따른 인공지능 기술을 활용한 목욕기를 나타내는 개념도이다."}
