{"patent_id": "10-2013-0047459", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2014-0129445", "출원번호": "10-2013-0047459", "발명의 명칭": "지능로봇의 자율동작 제어 시스템", "출원인": "한성대학교 산학협력단", "발명자": "조혜경"}}
{"patent_id": "10-2013-0047459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지능로봇의 자율동작 제어 시스템에 있어서,지능로봇이 상황 인식에 따라 자율적으로 동작할 수 있도록 자율도를 설정해주고, 상기 지능로봇을 모니터링한결과에 따라, 상기 지능로봇이 수동 동작될 수 있도록 제어하는 사용자 조작 장치;상기 사용자 조작 장치에서 설정한 자율도에 따라 상기 상황 인식에 대응하는 자율 동작을 수행하고, 상기 사용자 조작 장치의 동작 제어 명령에 따라 수동 동작함과 동시에 수동 동작을 학습하는 지능로봇을 포함하여 이루어진 것을 특징으로 하는 지능로봇의 자율동작 제어 시스템."}
{"patent_id": "10-2013-0047459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 사용자 조작 장치는 상기 지능로봇이 수행할 자율동작의 레벨을 설정하는 자율도 설정부, 상기 지능로봇의동작 상태를 모니터링하는 모니터링부 및 상기 모니터링 결과에 따라, 사용자 조작에 의하여 상기 지능로봇을수동동작시키기 위한 제어명령을 출력하는 동작 지시부를 포함하여 이루어진 것을 특징으로 하는 지능로봇의 자율동작 제어 시스템."}
{"patent_id": "10-2013-0047459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 지능로봇은 주변 환경 및 자신에서 발생하는 상황을 인식하는 상황 인식부, 상기 지능로봇이 상기 인식된상황에 대응하는 동작을 자율적으로 수행할 수 있도록 처리하는 자율동작 처리부, 상기 동작 지시부의 제어명령에 따라 상기 지능로봇이 수동적으로 동작될 수 있도록 처리하는 수동동작 처리부 및 상기 수동동작 처리부에의하여 동작되는 상기 지능로봇의 동작 처리 과정을 학습한 후, 상기 인식된 상황에 대응하여 상기 동작처리에관련된 정보를 메모리에 저장하는 학습부를 포함하여 이루어진 것을 특징으로 하는 지능로봇의 자율동작 제어시스템."}
{"patent_id": "10-2013-0047459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 사용자는 상기 모니터링 결과, 상기 지능로봇이 자율동작을 수행하지 않는 것으로 인지한 경우에는, 상기자율도 설정부를 통하여 자율도를 조정하거나, 상기 동작 지시부를 통하여 상기 지능로봇이 수동 동작될 수 있도록 조작하는 것을 특징으로 하는 지능로봇의 자율동작 제어 시스템."}
{"patent_id": "10-2013-0047459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서,상기 사용자는 상기 모니터링 결과, 상기 지능로봇의 자율동작이 수정 또는 변경될 필요가 있다고 인지한 경우에는, 상기 동작 지시부를 통하여 상기 지능로봇이 수동 동작될 수 있도록 조작하는 것을 특징으로 하는 지능로봇의 자율동작 제어 시스템."}
{"patent_id": "10-2013-0047459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2014-0129445-3-청구항 3에 있어서,상기 자율동작 처리부는 사용자 조작에 의하여 제1 모드 또는 제2 모드로 설정될 수 있고, 상기 제1 모드로 설정된 경우, 상기 자율동작 처리부는 상기 설정된 자율도에 대응하는 상황이 인식되는 경우에만 상기 인식된 상황에 대응하는 동작을 자율적으로 수행하도록 처리하고, 상기 제2 모드로 설정된 경우, 상기 자율동작 처리부는상기 설정된 자율도 이하의 자율도에 대응하는 상황들 중, 어느 하나의 상황인 인식되는 경우에, 해당 인식된상황에 대응하는 동작을 자율적으로 수행하도록 처리하는 것을 특징으로 하는 지능로봇의 자율동작 제어시스템.명 세 서기 술 분 야본 발명은 지능로봇의 자율동작 제어 시스템에 관한 것으로, 특히 지능로봇이 자율적으로 동작할 수 있는 레벨 [0001]에 해당하는 자율도를 설정함으로써, 상기 지능로봇이 해당 자율도에 따라 상황 인지에 대응하는 자율동작을 수행할 수 있도록 함과 동시에, 상기 지능로봇이 자율동작을 수행할 수 없거나 또는 지능로봇의 자율동작의 수정또는 변경이 필요한 경우에, 사용자가 사용자 조작 장치를 이용하여 상기 지능로봇을 수동동작시킴으로써, 지능로봇의 자율동작을 보완하고 사용자와 지능로봇간의 협업 관계를 극대화시키며, 또한 상기 지능로봇의 수동 동작 과정을 학습할 수 있도록 함으로써, 상기 지능로봇의 자율동작 레벨을 업그레이드시킬 수 있는 지능로봇의자율동작 제어 시스템에 관한 것이다.배 경 기 술모든 로봇은 자신과 외부의 상태를 지각하고 이것을 기본으로 판단을 하는 인식과 지능이 결정하는 운동 기능 [0002]이 세가지 중요한 요소를 가지고 있다. 지능로봇이란 환경의 인식, 정보의 획득, 지능적 판단, 자율적인 행동등에 필요한 인공지능을 가지고 인간과 상호작용하고 인간에게 다양한 서비스를 제공하는 로봇이다.로봇의 지능 기능이 발전되면서, 감지 및 인지 기술, 인간 로봇 사용 작용, 자율 주행 및 조작 기술 등이 요소 [0003]기술로서 개발되고 있는데, 지능로봇은 기계, 전자, 유비쿼터스 네트웍 등의 IT 기술이 집적된 복합체라 할 수있다.그런데, 기존 일반적인 지능로봇은 특정 동작을 수행할 수 있는 정도의 자율도로 동작되는 수준이고, 다양한 자 [0004]율도로 조정되어 다양한 자율동작을 수행할 수 없으며, 더 나아가 학습을 통하여 자율도를 업그레이드시키는 동작을 할 수 없는 상황이다.따라서, 지능로봇이 다양한 자율동작을 수행할 수 있도록 함과 동시에, 사용자가 모니터링을 통하여 지능로봇이 [0005]자율동작을 할 수 없거나, 자율동작을 수정 또는 변경할 필요가 있다고 판단한 경우에는, 사용자가 지능로봇의동작에 개입하여 지능로봇의 자율동작을 보완하고, 학습을 통하여 지능로봇의 자율도를 업그레이드시킬 수 있는지능로봇의 자율동작 제어 시스템 기술이 요청되고 있는 실정이다.발명의 내용해결하려는 과제본 발명은 상기와 같은 종래 기술의 문제점을 해결하기 위하여 창안된 것으로, 지능로봇이 자율적으로 동작할 [0006]수 있는 레벨에 해당하는 자율도를 설정함으로써, 상기 지능로봇이 해당 자율도에 따라 상황 인지에 대응하는자율동작을 수행할 수 있도록 함과 동시에, 상기 지능로봇이 자율동작을 수행할 수 없거나 또는 지능로봇의 자율동작의 수정 또는 변경이 필요한 경우에, 사용자가 사용자 조작 장치를 이용하여 상기 지능로봇을 수동동작시킴으로써, 지능로봇의 자율동작을 보완하고 사용자와 지능로봇간의 협업 관계를 극대화시키며, 또한 상기 지능로봇의 수동 동작 과정을 학습할 수 있도록 함으로써, 상기 지능로봇의 자율동작 레벨을 업그레이드시킬 수 있는 지능로봇의 자율동작 제어 시스템을 제공하는 것을 그 목적으로 한다.공개특허 10-2014-0129445-4-과제의 해결 수단상기와 같은 기술적 과제를 해결하기 위하여 제안된 본 발명인 지능로봇의 자율동작 제어 시스템을 이루는 구성 [0007]수단은, 지능로봇이 상황 인식에 따라 자율적으로 동작할 수 있도록 자율도를 설정해주고, 상기 지능로봇을 모니터링한 결과에 따라, 상기 지능로봇이 수동 동작될 수 있도록 제어하는 사용자 조작 장치 및 상기 사용자 조작 장치에서 설정한 자율도에 따라 상기 상황 인식에 대응하는 자율 동작을 수행하고, 상기 사용자 조작 장치의동작 제어 명령에 따라 수동 동작함과 동시에 수동 동작을 학습하는 지능로봇을 포함하여 이루어진 것을 특징으로 한다.여기서, 기 사용자 조작 장치는 상기 지능로봇이 수행할 자율동작의 레벨을 설정하는 자율도 설정부, 상기 지능 [0008]로봇의 동작 상태를 모니터링하는 모니터링부 및 상기 모니터링 결과에 따라, 사용자 조작에 의하여 상기 지능로봇을 수동동작시키기 위한 제어명령을 출력하는 동작 지시부를 포함하여 이루어진 것을 특징으로 한다.여기서, 상기 지능로봇은 주변 환경 및 자신에서 발생하는 상황을 인식하는 상황 인식부, 상기 지능로봇이 상기 [0009]인식된 상황에 대응하는 동작을 자율적으로 수행할 수 있도록 처리하는 자율동작 처리부, 상기 동작 지시부의제어명령에 따라 상기 지능로봇이 수동적으로 동작될 수 있도록 처리하는 수동동작 처리부 및 상기 수동동작 처리부에 의하여 동작되는 상기 지능로봇의 동작 처리 과정을 학습한 후, 상기 인식된 상황에 대응하여 상기 동작처리에 관련된 정보를 메모리에 저장하는 학습부를 포함하여 이루어진 것을 특징으로 하다.여기서, 상기 사용자는 상기 모니터링 결과, 상기 지능로봇이 자율동작을 수행하지 않는 것으로 인지한 경우에 [0010]는, 상기 자율도 설정부를 통하여 자율도를 조정하거나, 상기 동작 지시부를 통하여 상기 지능로봇이 수동 동작될 수 있도록 조작하는 것을 특징으로 한다.또한, 상기 사용자는 상기 모니터링 결과, 상기 지능로봇의 자율동작이 수정 또는 변경될 필요가 있다고 인지한 [0011]경우에는, 상기 동작 지시부를 통하여 상기 지능로봇이 수동 동작될 수 있도록 조작하는 것을 특징으로 한다.또한, 상기 자율동작 처리부는 사용자 조작에 의하여 제1 모드 또는 제2 모드로 설정될 수 있고, 상기 제1 모드 [0012]로 설정된 경우, 상기 자율동작 처리부는 상기 설정된 자율도에 대응하는 상황이 인식되는 경우에만 상기 인식된 상황에 대응하는 동작을 자율적으로 수행하도록 처리하고, 상기 제2 모드로 설정된 경우, 상기 자율동작 처리부는 상기 설정된 자율도 이하의 자율도에 대응하는 상황들 중, 어느 하나의 상황인 인식되는 경우에, 해당인식된 상황에 대응하는 동작을 자율적으로 수행하도록 처리하는 것을 특징으로 한다.발명의 효과상기와 같은 과제 및 해결수단을 가지는 본 발명인 지능로봇의 자율동작 제어 시스템에 의하면, 지능로봇이 자 [0013]율적으로 동작할 수 있는 레벨에 해당하는 자율도를 설정할 수 있기 때문에, 상기 지능로봇이 해당 자율도에 따라 상황 인지에 대응하는 자율동작을 수행할 수 있도록 할 수 있고, 상기 지능로봇이 자율동작을 수행할 수 없거나 또는 지능로봇의 자율동작의 수정 또는 변경이 필요한 경우에, 사용자가 사용자 조작 장치를 이용하여 상기 지능로봇을 수동동작시킬 수 있기 때문에, 지능로봇의 자율동작을 보완하고 사용자와 지능로봇간의 협업 관계를 극대화시킬 수 있으며, 또한 상기 지능로봇의 수동 동작 과정을 학습할 수 있도록 구성하기 때문에, 상기지능로봇의 자율동작 레벨을 업그레이드시킬 수 있는 장점이 있다.도면의 간단한 설명도 1은 본 발명의 실시예에 따른 지능로봇의 자율동작 제어 시스템의 구성도이다. [0014]발명을 실시하기 위한 구체적인 내용이하, 첨부된 도면을 참조하여 상기와 같은 과제, 해결수단 및 효과를 가지는 본 발명인 지능로봇의 자율동작 [0015]제어 시스템에 관한 바람직한 실시예를 상세하게 설명한다.이 과정에서 도면에 도시된 구성요소의 크기나 형상 등은 설명의 명료성과 편의상 과장되게 도시될 수 있다. 또 [0016]한, 본 발명의 구성 및 작용을 고려하여 특별히 정의된 용어들은 사용자, 운용자의 의도 또는 관례에 따라 달라질 수 있다.공개특허 10-2014-0129445-5-도 1은 본 발명의 실시예에 따른 지능로봇의 자율동작 제어 시스템(100)의 구성도이다. [0017]도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 지능로봇의 자율동작 제어 시스템(100)은 사용자가 설정해 [0018]준 자율도에 따라 자율동작을 수행함과 동시에 사용자의 개입에 따라 수동동작을 수행하며, 수동동작 과정을 학습하여 자율도를 업그레이드시킬 수 있는 지능로봇(20)과, 상기 지능로봇(20)의 자율도를 설정 및 조정하여 상기 지능로봇이 해당 자율동작을 수행할 수 있도록 하고, 지능로봇(20)을 지속적으로 모니터링하여 필요에 따라직접 상기 지능로봇의 동작을 제어함으로써, 지능로봇의 자율동작을 보완하는 사용자 조작 장치(10)를 포함하여구성된다.여기서, 상기 자율도란 사용자 개입 없이 상기 지능로봇(20)이 스스로 자율동작을 수행할 수 있는 정도를 의미 [0019]한다. 예를 들어, 자율도는 0 ~ 1 범위로 조정될 수 있고, 자율도가 \"0\"인 경우에는 지능로봇이 스스로 자율동작을 수행할 수 없고 사용자의 개입에 의해서만 동작되는 것을 의미하고, 자율도가 \"1\"인 경우에는 지능로봇이사용자 개입 없이 자율동작을 모두 수행할 수 있는 것을 의미한다.또한, 상기 \"자율동작\"은 지능로봇이 사용자 개입 없이 자율적으로 동작하여 특정 임무 또는 특정 상황 대처를 [0020]수행하는 것을 의미하고, \"수동동작\"은 지능로봇이 사용자의 개입에 따라 상기 사용자 조작 장치에 의하여 동작제어되는 것을 의미한다.한편, 후술하는 지능로봇의 자율동작 제어 시스템의 구성 및 작용에 대한 설명을 돕기 위하여 자율도에 대한 지 [0021]능로봇이 수행하는 자율동작에 대하여 가정을 한다.즉, 상기 자율도는 0.2, 0.4 및 0.6으로 설정될 수 있고, 상기 자율도 0.2는 상기 지능로봇이 자신의 전방에 사 [0022]람이 출현한 경우에 손을 흔드는 동작을 자율적으로 수행할 수 있는 수준이고, 상기 자율도 0.4는 상기 지능로봇이 자신의 머리를 사람이 만지는 경우에 웃는 얼굴 또는 머리를 끄덕이는 동작을 자율적으로 수행할 수 있는수준이며, 상기 자율도 0.6은 상기 지능로봇이 자신의 신체를 사람이 타격한 경우에 머리를 젓는 동작을 자율적으로 수행할 수 있는 수준으로 가정한다.또한, 상기 자율도가 특정 자율도로 설정된 경우, 상기 지능로봇은 상기 설정된 자율도에 대응하는 자율동작만 [0023]을 수행할 수 있거나, 또는 상기 자율도 이하에 포함되는 모든 자율동작을 수행할 수도 있다. 이와 같이, 상기지능로봇에 의하여 설정된 자율도에 대응하는 자율동작만이 수행되도록 할 것인지, 또는 설정된 자율도 이하에포함되는 모든 자율동작들이 수행되도록 할 것인지는 사용자 설정에 의하여 이루어질 수 있다.예를 들어, 상기 자율도가 0.4로 설정된 경우, 상기 지능로봇은 자율도 0.4에 해당하는 자율동작, 즉 사람이 머 [0024]리를 만지는 경우 머리를 끄덕이는 동작만을 수행할 수 있거나 또는 이 자율도 0.4에 대응하는 자율동작뿐만 아니라, 자율도 0.4 이하에 포함되는 자율도 0.2에 대응하는 자율동작, 즉 사람이 출현한 경우 손을 흔드는 동작을 자율적으로 수행할 수 있다.상기 사용자 조작 장치(10)는 사용자가 조작하는 장치로서, 상기 지능로봇(20)이 상황 인식에 따라 자율적으로 [0025]동작할 수 있도록 자율도를 설정해준다. 그리고, 상기 지능로봇(20)을 지속적으로 모니터링하고, 그 결과에 따라, 상기 지능로봇(20)의 동작에 사용자가 개입할 필요성이 있는 경우에 상기 지능로봇(20)이 수동 동작될 수있도록 제어한다.구체적으로, 상기 사용자 조작 장치(10)는 상기 지능로봇(20)의 자율도를 설정하여 특정한 상황인 발생한 경우, [0026]상기 지능로봇(20)이 상기 특정한 상황을 인식한 후, 자율적으로 특정 동작을 수행할 수 있도록 한다. 예를 들어, 상기 사용자 조작 장치(10)가 상기 지능로봇(20)의 자율도를 0.4로 설정해 주면, 상기 지능로봇(2 [0027]0)은 특정한 상황을 인식하고, 즉 사람들이 자신의 머리를 만지면 고개를 끄덕이는 동작을 자율적으로 수행할수 있다. 또한, 사용자 설정에 따라, 상기 자율도 0.4 이하에 포함되는 자율도 0.2에 관련된 상황(사람이 자신의 앞에 출현한 상황)을 인식한 경우에도, 손을 흔드는 동작을 자율적으로 수행할 수도 있다.한편, 상기 사용자 조작 장치(10)는 상기 자율동작을 수행하는 상기 지능로봇(20)을 모니터링한다. 상기 지능로 [0028]봇(20)을 모니터링한 결과, 상기 지능로봇(20)이 정상적으로 자율동작을 수행할 수 없거나, 정상적인 자율동작을 수행하지만, 사용자의 의지에 따라 자율동작의 패턴을 수정 또는 변경하고자 하는 경우에 상기 지능로봇을직접 제어하여 수동으로 동작될 수 있도록 제어할 수 있다. 이에 대한 구체적인 설명은 후술하겠다.상기 사용자 조작 장치(10)에서 설정한 자율도에 따라 자율동작을 수행하거나, 상기 사용자 조작 장치(10)의 개 [0029]공개특허 10-2014-0129445-6-입에 의하여 수동동작을 수행하는 상기 지능로봇(20)은 주변 환경 또는 자신의 상황을 인식할 수 있는 기능을가진다. 즉, 상기 지능로봇(20)은 각 종 다양한 센서 및 카메라들을 장착하여 주변 환경을 인식할 수 있고, 자신에게 영향을 미치는 다양한 접촉 및 힘을 인식할 수 있으며, 이러한 상황을 인식한 후, 인식된 상황에 대응하는 동작을 자율적으로 수행할 수 있다.이와 같은 상기 지능로봇(20)은 상기 사용자 조작 장치(10)에서 설정한 자율도에 따라 상기 상황 인식에 대응하 [0030]는 자율동작을 수행할 수 있다. 즉, 상기 사용자 조작 장치(10)에 의하여 자율도 0.4로 설정된 경우, 상기 지능로봇(20)은 사람들이 자신의 머리를 만지면, 즉 머리를 만지는 상황을 인식하면, 이에 대응하는 자율동작 즉,머리를 끄덕이는 자율동작을 수행한다. 물론, 사용자가 상기 자율도를 0.4로 설정하면서 동시에 상기 지능로봇이 자율도 0.4 이하에 포함되는 모든 자 [0031]율동작을 수행할 수 있도록 설정한 경우, 상기 지능로봇은 자신의 전방에 사람이 출현한 경우에, 사람 출현이라는 상황을 인식하고, 이에 대응하는 자율동작, 즉 손을 흔드는 동작을 자율적으로 수행한다.한편, 상기 지능로봇(20)은 상기 사용자 조작 장치(10)의 동작 제어 명령에 따라 수동동작함과 동시에 수동동작 [0032]을 학습하는 기능을 가진다. 구체적으로, 상기 사용자가 모니터링을 통하여 상기 지능로봇(20)을 수동동작시킬필요가 있다고 판단한 경우, 상기 사용자 조작 장치를 이용하여 상기 지능로봇(20)의 동작을 직접적으로 개입하여 제어할 수 있다.이 경우, 상기 사용자 조작 장치(10)는 상기 지능로봇(20)에게 동작 제어 명령을 내리고, 상기 지능로봇은 이 [0033]동작 제어 명령에 따라 수동동작을 수행한다. 이와 같은 수동동작이 이루어지는 과정에서, 상기 지능로봇은 상기 수동동작 과정을 학습한다. 구체적으로, 상기 지능로봇은 상기 사용자 조작 장치(10)의 제어에 따라 수동동작되는 과정에 관련된 정보, 예를 들어 자신의 동작 패턴 정보, 이동 패턴 정보, 모터 구동 정보 등을 학습하여메모리에 저장하여 기억해둔다.이와 같이, 상기 지능로봇이 학습한 수동동작은 메모리에 저장되어 기억되고 있기 때문에, 상기 수동동작을 수 [0034]행하기 위한 특정 상황이 인식되면, 상기 지능로봇은 상기 학습하여 기억하고 있는 수동동작 과정을 자율적으로수행할 수 있다. 결과적으로 상기 지능로봇은 학습을 통하여 자신의 자율도를 업그레이드시킬 수 있다. 이에 대한 구체적인 설명은 후술한다.상술한 바와 같이, 상기 지능로봇(20)은 상기 사용자 조작 장치(10)에서 설정한 자율도에 따라 자율동작을 수행 [0035]할 수 있고, 자신을 모니터링하고 있는 사용자 조작 장치(10)의 개입에 따라 수동동작을 수행할 수 있으며, 수동동작 과정을 학습하여 자신이 자율적으로 동작할 수 있는 범위를 확대할 수 있어서, 자신의 자율도를 업그레이드시킬 수 있는 기능을 가진다.이와 같은 동작을 수행하는 상기 지능로봇의 자율동작 제어 시스템(100)을 구성하는 사용자 조작 장치(10) 및 [0036]지능로봇(20)에 대한 세부적인 구성과 이에 대한 동작을 설명하면 다음과 같다.도 1에 도시된 바와 같이, 상기 사용자 조작 장치(10)는 조작부(11), 자율도 설정부(13), 모니터링부(15) 및 동 [0037]작 지시부(17)를 포함하여 구성된다.상기 조작부(11)는 사용자에 의하여 조작되는 부분으로서, 사용자에 의하여 다양한 명령이 입력된다. 이와 같은 [0038]조작부(11)에 의한 입력은 상기 자율도 설정부(13), 모니터링부(15) 및 동작 지시부(17)로 출력된다.상기 자율도 설정부(13)는 상기 조작부(11)에서 지시한 자율도를 상기 지능로봇(20)으로 전송한다. 즉, 상기 자 [0039]율도 설정부(13)는 상기 지능로봇(20)이 수행할 자율동작의 레벨을 설정한다. 이 때, 상기 자율도 설정부(13)는사용자의 조작에 따라 상기 자율도를 상기 지능로봇(20)에 전송함과 동시에, 상기 지능로봇(20)이 상기 설정된자율도에 대응하는 자율동작만을 수행하도록 할 것인지, 상기 설정된 자율도 이하에 포함되는 모든 자율동작을수행할 수 있도록 할 것인지도 설정할 수 있다.이와 같이, 상기 자율도 설정부(13)에 의하여 자율도가 설정되면, 상기 지능로봇(20)은 특정 상황을 인식하고, [0040]이 인식된 상황에 대응하는 자율동작이 상기 자율도에 대응하는 자율동작이거나, 또는 상기 자율도 이하에 포함되는 자율도에 대응하는 자율동작인 경우에, 해당 자율동작을 수행한다.이와 같이 상기 자율도 설정부(13)가 상기 지능로봇(20)의 자율도를 설정하면, 상기 모니터링부(15)는 상기 지 [0041]능로봇의 동작, 상태 등을 모니터링한다. 즉, 상기 모니터링부(15)는 상기 지능로봇의 동작 상태를 모니터링한다. 이와 같은 모니터링 결과는 사용자에 의하여 인지될 수 있다.공개특허 10-2014-0129445-7-상기 사용자는 상기 모니터링부(15)에 의한 모니터링 결과, 상기 지능로봇(20)이 특정 상황을 인식한 후, 이 인 [0042]식된 상황에 대응하는 자율동작을 수행하지 않거나, 잘못된 자율동작을 수행하거나, 또는 필요에 따라 수행하는자율동작을 변경할 필요가 있는 경우, 상기 지능로봇(20)이 수동동작될 수 있도록 개입할 수 있다.따라서, 상기 사용자 조작 장치(10)의 동작 지시부(17)는 상기 모니터링 결과에 따라, 사용자 조작에 의하여 상 [0043]기 지능로봇(20)을 수동동작시키기 위한 제어명령을 출력한다. 그러면, 상기 지능로봇(20)은 상기 제어명령에따라 수동동작된다.이와 같은 사용자 조작 장치(10)에 의하여 자율동작을 수행하거나 수동동작을 수행하는 상기 지능로봇(20)은 도 [0044]1에 도시된 바와 같이, 상황 인식부(21), 자율동작 처리부(23), 수동동작 처리부(25), 학습부(27) 및 메모리(29)를 포함하여 구성된다.상기 상황 인식부(21)는 지능로봇의 주변 환경 및 자신에서 발생하는 상황을 인식한다. 예를 들어, 상기 상황 [0045]인식부(21)는 지능로봇의 전방에 사람들이 출현하고 자신을 보고 있는지, 사람들이 자신의 머리를 만지는지, 또는 사람들이 자신을 타격하는지 등에 대한 상황들을 인식한다. 이러한 상황 인식은 지능로봇에 구비되어 있는다양한 센서들 및 카메라 등의 입력 데이터를 이용하여 수행될 수 있다.상기 상황 인식부(21)에 의하여 상황이 인식되면, 상기 지능로봇은 설정된 자신의 자율도의 범위 내에서 상기 [0046]인식된 상황에 대응하는 자율동작을 수행할 수 있다. 이러한 자율동작은 상기 자율동작 처리부(23)에 의하여 수행된다. 즉, 상기 자율동작 처리부(23)는 인식된 상황을 인지하고, 행동 계획을 수립한 후, 수립된 행동 계획에따라 동작한다.구체적으로, 상기 자율동작 처리부(23)는 상기 인지된 상황에 대응하는 자율동작이 상기 설정된 자율도 범위 내 [0047]에서 처리할 수 있는 자율동작이면서, 동시에 상기 지능로봇이 자율적으로 처리할 수 있는 최대 자율도 이하에포함되는 자율동작들인 경우에만, 상기 지능로봇(20)이 상기 인식된 상황에 대응하는 동작을 자율적으로 수행할수 있도록 처리한다.따라서, 상기 인지된 상황에 대응하는 자율동작이 상기 설정된 자율도 이내에 포함되는 자율동작이 아니거나, [0048]또는 상기 지능로봇이 자율적으로 처리할 수 있는 최대 자율도 이내에 포함되는 자율동작이 아닌 경우에, 상기자율동작 처리부(23)는 자율동작을 수행할 수 없다. 따라서 상기 지능로봇은 자율동작을 수행하지 않은 상태로유지한다.여기서, 상기 지능로봇이 자율적으로 처리할 수 있는 최대 자율도는 상기 지능로봇이 자율적으로 처리할 수 있 [0049]는 최대 능력의 자율도를 의미한다. 예를 들어, 현재 지능로봇이 사람이 전방에 출현한 경우 손을 흔드는 동작과 사람이 머리를 만지는 경우 머리를 끄덕이는 동작을 자율적으로 수행할 수 있는 능력을 가지고 있다면, 상기지능로봇이 자율적으로 처리할 수 있는 최대 자율도는 0.4가 되는 것이다.예를 들어 설명하면, 상기 지능로봇이 자율적으로 처리할 수 있는 최대 자율도가 0.4라고 가정하자. 즉, 상기 [0050]지능로봇은 사람들이 머리를 만지는 경우, 이에 대한 응답으로 머리를 끄덕이는 동작을 자율적으로 수행할 수있거나, 이와 같은 동작과 함께 사람들의 출현에 대하여 손을 흔드는 동작을 수행할 수 있는 수준의 자율도를가진다고 가정하자. 물론 이와 같은 자율동작들에 관련된 정보(모터 구동 관련 정보, 움직임 패턴 정보, 이동패턴 정보 등)는 인식된 상황에 대응하여 메모리(29)에 저장되어 기억되고 있다.이와 같은 가정에서, 자율도가 0.4로 설정된 상태에서, 사람들이 지능로봇의 머리를 만지면, 지능로봇은 사람들 [0051]이 자신의 머리를 만지는 상황을 인식한다. 그러면, 상기 자율동작 처리부(23)는 상기 인식된 상황에 대응하는동작, 즉 머리를 끄덕이는 동작을 자율적으로 수행할 수 있고, 자율도 0.2에 대응하는 상황, 즉 사람이 전방에출현한 경우에도 손을 흔드는 동작을 자율적으로 수행할 수 있다.그러나, 최대 자율도가 0.4이고, 설정된 자율도가 0.6으로 설정된 상태에서, 사람이 상기 지능로봇을 타격하는 [0052]행동을 가한 경우에는 상기 자율동작 처리부(23)가 특정 자율동작을 수행하지 않는다.구체적으로, 상기 지능로봇의 상황 인식부(21)는 자신에게 타격을 가해진 상황은 인식한다. 그러나, 상기 자율 [0053]동작 처리부(23)는 상기 상황 인식부(21)로부터 인식된 상황 정보를 전달받더라도, 자신이 처리할 수 있는 최대자율도는 0.4에 해당되는 반면, 인식된 상황에 대응하는 자율동작은 0.6의 자율도에 관련되어 있기 때문에, 자율도 0.6에 대응하는 머리를 흔드는 동작을 자율적으로 수행할 수 없다.물론, 최대 자율도가 0.6이고, 설정된 자율도가 0.4인 상태에서, 자신을 타격하는 상황을 인식하더라도, 현재 [0054]공개특허 10-2014-0129445-8-설정된 자율도가 0.4이기 때문에, 0.6의 자율도에 대응하는 자율동작인 머리를 흔드는 동작을 수행할 수 없다.결과적으로, 상기 자율동작 처리부(23)는 지능로봇이 현재 가지고 있는 최대 능력에 해당하는 최대 자율도와 설 [0055]정된 자율도 이내에 포함되는 자율도에 대응되는 자율동작만을 수행할 수 있다.따라서, 상기 자율동작 처리부(23)는 현지 인식된 상황에 대응되는 자율동작이 설정된 자율도 이하에 포함되는 [0056]자율도에서 자율적으로 처리할 수 없는 자율동작이 아니거나, 지능로봇이 자율적으로 처리할 수 있는 최대 자율도 이하에 포함되는 자율도에서 자율적으로 처리할 수 없는 자율동작인 경우에는 동작을 수행하지 않고 정지된상태를 유지한다.이와 같은 동작 상태는 사용자 조작 장치(10)의 모니터링부(15)에 의하여 모니터링되고 있다. 상기 모니터링부 [0057](15)를 통하여 사용자는 지능로봇이 자율적으로 동작하지 않는다는 것을 인지할 수 있고, 이후 지능로봇의 동작에 개입하여 수동동작되도록 제어할 수 있다. 다만, 상기 사용자는 상기 모니터링 결과에 따라, 상기 지능로봇이 수동동작될 수 있도록 제어할 수도 있지만, [0058]경우에 따라서는 상기 자율도 설정부(13)를 통하여 자율도를 재설정할 수도 있다. 이에 대해서는 후술하겠다.상기 지능로봇을 수동동작시키기 위하여, 상기 사용자는 상기 사용자 조작 장치(10)의 동작지시부(17)를 통하여 [0059]상기 지능로봇(20)에게 동작제어 명령을 내린다. 그러면, 상기 지능로봇(20)의 수동동작 처리부(25)는 상기 동작제어 명령에 따라 상기 지능로봇을 수동동작시킨다.구체적으로, 상기 수동동작 처리부(25)는 상기 동작 지시부(17)의 제어명령에 따라 상기 지능로봇(20)이 수동적 [0060]으로 동작될 수 있도록 처리한다. 즉, 입력되는 동작 제어명령에 따라 지능로봇의 구동모터 등을 제어하여 수동동작이 될 수 있도록 처리한다.이 때, 상기 학습부(27)는 상기 수동동작 과정을 모니터링하면서 학습한다. 즉, 상기 학습부(27)는 상기 수동동 [0061]작 처리부(25)에 의하여 동작되는 상기 지능로봇의 동작 처리 과정을 모니터링하면서 학습한다. 예를 들어, 상기 학습부(27)는 상기 수동동작 처리 과정에서 지능로봇의 움직임 패턴 정보, 이동 패턴 정보, 모터 구동 정보등을 모니터링하면서 학습한다.그리고, 상기 학습부(27)는 상기 지능로봇의 동작 처리 과정을 학습한 후, 상기 인식된 상황에 대응하여 상기 [0062]동작처리에 관련된 정보를 상기 메모리(29)에 저장하여 기억한다.구체적으로 설명하면, 사람이 지능로봇을 타격하여 상기 상황 인식부(21)에 의하여 현재 상황이 인식되나, 상기 [0063]자율동작 처리부(23)에 의하여 자율도 0.6에 대응하는 자율동작을 수행할 수 없을 때, 모니터링 결과에 따라,사용자는 동작 지시부(17)를 통하여 상기 지능로봇이 자율도 0.6에 대응하는 자율동작, 즉 머리를 흔드는 동작을 수행하도록 수동동작시킨다. 이 과정에서 상기 학습부(27)는 상기 인식된 상황 즉, 자신이 타격이 되었다는 상황에 대응하여 상기 수동동작 [0064]처리에 관련된 정보를 메모리에 저장하여 기억한다. 결국, 상기 학습부(27)에 의하여 상기 지능로봇(20)은 향후자신이 타격되었을 때, 이에 대한 응답으로 머리를 흔드는 동작을 자율적으로 수행할 수 있다. 즉, 자신의 최대자율도를 업그레이드시킬 수 있다.구체적으로, 현재는 자율도 0.6에 대응하는 상황인 인식된 후, 이에 대한 응답으로 머리는 흔드는 자율동작을 [0065]수행할 수 없지만, 상기와 같은 학습부의 동작에 따라 \"타격 받음\"이라는 상황을 인식하고, 이 인식된 상황과수동동작 처리 과정에 대한 정보를 저장하여 기억하고 있기 때문에, 향후 \"타격 받음\"이라는 상황이 인식된 경우, 상기 자율동작 처리부(23)는 상기 저장되어 기억하고 있는 상기 메모리를 참조하여 머리를 흔드는 자율동작을 수행할 수 있게 된다. 이와 같은 방법으로 상기 지능로봇은 자신의 자율도를 업그레이드시킬 수 있다.이와 같이, 상기 지능로봇은 자율적으로 처리할 수 없는 동작에 대하여, 상기 사용자 조작 장치(10)의 제어를 [0066]받아 수동동작될 수 있고, 이 수동동작 과정을 모니터링하면서 학습함으로써, 자신의 자율도를 업그레이드시킬수 있다.한편, 상술한 바와 같이, 상기 모니터링 결과, 상기 지능로봇이 움직이지 않는 경우에, 상기 사용자는 상기 동 [0067]작지시부(17)를 통하여 상기 지능로봇을 수동동작시킬 수도 있지만, 상기 자율도 설정부(13)를 통해 상기 지능로봇(20)의 자율도를 재조정할 수도 있다.즉, 상기 사용자는 상기 모니터링 결과, 상기 지능로봇(20)이 자율동작을 수행하지 않는 것으로 인지한 경우에 [0068]는, 상기 자율도 설정부(13)를 통하여 자율도를 조정하거나, 상기 동작 지시부(17)를 통하여 상기 지능로봇(2공개특허 10-2014-0129445-9-0)이 수동 동작될 수 있도록 조작할 수 있다.구체적으로, 현재 지능로봇의 자율도가 0.2인 상태에서, 상기 상황 인지부(212)에 의하여 사람이 지능로봇의 머 [0069]리를 만지는 것으로 모니터링되고, 이에 대하여 자율동작 처리부(23)에서 자율동작을 처리할 수 없는 것으로 모니터링된 경우, 사용자는 상기 자율도 설정부(13)를 통하여 지능로봇의 자율도를 0.4로 재조정함으로써, 상기자율동작 처리부(23)에 의하여 상기 인식된 상황(머리를 만지는 상황)에 대응한 자율동작, 즉 머리를 끄덕이는동작이 수행되도록 할 수 있다.반면, 상기 자율도 설정부(13)를 통하여 지능로봇의 자율도를 재설정할 필요가 없는 경우(현재 자율도가 최대 [0070]자율도인 경우 등)에는 상기 동작 지시부(17)를 통하여 상기 지능로봇이 수동동작될 수 있도록 하고, 결과적으로 상기 지능로봇의 자율도를 업그레이드시킬 수 있도록 한다.한편, 상기 사용자는 상술한 바와 같이, 상기 자율동작 처리부(23)가 상기 인지된 상황에 대응한 자율동작을 수 [0071]행하지 않은 것으로 모니터링된 경우에, 상기 동작 지시부(17)를 통하여 상기 지능로봇을 수동동작시킬 수 있지만, 경우에 따라서는 상기 자율동작 처리부(23)가 상기 인지된 상황에 대응한 자율동작을 수행하더라도, 상기동작 지시부(17)를 통해 상기 지능로봇을 수동동작시킬 수도 있다.구체적으로, 상기 사용자는 상기 모니터링 결과, 상기 지능로봇의 자율동작이 수정 또는 변경될 필요가 있다고 [0072]인지한 경우에는, 상기 동작 지시부(17)를 통하여 상기 지능로봇(20)이 수동 동작될 수 있도록 조작할 수 있다. 즉, 상기 사용자는 인식된 상황에 대응한 자율동작을 새롭게 수정 또는 변경할 필요가 있거나, 자율동작이 의도 [0073]한 동작과 상이하여 수정 및 변경할 필요가 있는 것으로 판단한 경우에는, 상기 해당 상황에 대응한 응답으로행해지는 동작이 상기 지능로봇이 수행할 수 있도록, 상기 동작 지시부(17)를 통해 상기 지능로봇을 수동동작시킨다.그러면, 이 경우에도 상기 학습부(27)는 상기 해당 인식된 상황과, 이에 대응하는 상기 수동동작 처리 과정에 [0074]관련된 정보를 메모리(29)에 저장하여 기억한다. 그러면, 상기 자율동작 처리부(23)는 인식된 상황에 대응하여,새롭게 변경 또는 수정된 자율동작을 수행할 수 있다.한편, 상술한 바와 같이 상기 자율동작 처리부(23)는 상기 자율도 설정부(13)에 의하여 설정된 자율도에 대응된 [0075]자율동작만을 수행할 수 있도록 설정되거나, 상기 자율도 이하에 포함되는 자율도에 대응되는 모든 자율동작들을 수행할 수 있도록 설정될 수 있다.예를 들어, 상기 자율동작 처리부(23)는 사용자 조작에 의하여 제1 모드 또는 제2 모드로 설정될 수 있다. [0076]이때, 상기 제1 모드로 설정된 경우, 상기 자율동작 처리부는 상기 설정된 자율도에 대응하는 상황이 인식되는경우에만 상기 인식된 상황에 대응하는 동작을 자율적으로 수행하도록 처리할 수 있다.반면, 상기 제2 모드로 설정된 경우, 상기 자율동작 처리부는 상기 설정된 자율도 이하의 자율도에 대응하는 상 [0077]황들 중, 어느 하나의 상황인 인식되는 경우에, 해당 인식된 상황에 대응하는 동작을 자율적으로 수행하도록 처리할 수 있다.예를 들면, 상기 자율도 설정부(13)가 상기 자율동작 처리부(23)에게 자율도 0.4를 설정하여 전달하고, 제1 모 [0078]드로 설정하여 전달하면, 상기 자율동작 처리부(23)는 자율도 0.4에 대응하는 상황, 즉 머리를 만지는 상황이인식된 경우에만 머리를 흔드는 자율동작을 수행하고, 사람이 출현한 경우에는 자율도 0.2에 대응되는 상황으로인식되기 때문에, 자율동작을 수행하지 않는다.반면, 상기 자율도 설정부(13)가 상기 자율동작 처리부(23)에게 자율도 0.4를 설정하여 전달하고, 제2 모드로 [0079]설정하여 전달하면, 상기 자율동작 처리부(23)는 자율도 0.4에 대응하는 상황, 즉 머리를 만지는 상황이 인식된경우에는 머리를 흔드는 자율동작을 수행하고, 사람이 출현한 경우에는 자율도 0.2에 대응되는 상황으로 인식하고, 손을 흔드는 자율동작을 수행할 수 있다.이상에서 본 발명에 따른 실시예들이 설명되었으나, 이는 예시적인 것에 불과하며, 당해 분야에서 통상적 지식 [0080]을 가진 자라면 이로부터 다양한 변형 및 균등한 범위의 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본발명의 진정한 기술적 보호 범위는 다음의 특허청구범위에 의해서 정해져야 할 것이다.부호의 설명공개특허 10-2014-0129445-10-10 : 사용자 조작장치 11 : 조작부 [0081]13 : 자율도 설정부 15 : 모니터링부17 : 동작 지시부 20 : 지능 로봇21 : 상황 인식부 23 : 자율동작 처리부25 : 수동동작 처리부 27 : 학습부29 : 메모리 100 : 지능로봇 자율동작 제어 시스템도면도면1공개특허 10-2014-0129445-11-"}
{"patent_id": "10-2013-0047459", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 지능로봇의 자율동작 제어 시스템에 관한 것으로, 특히 지능로봇이 자율적으로 동작할 수 있는 레벨에 해당하는 자율도를 설정함으로써, 상기 지능로봇이 해당 자율도에 따라 상황 인지에 대응하는 자율동작을 수행할 수 있도록 함과 동시에, 상기 지능로봇이 자율동작을 수행할 수 없거나 또는 지능로봇의 자율동작의 수정 또는 (뒷면에 계속)"}
{"patent_id": "10-2013-0047459", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지능로봇의 자율동작 제어 시스템에 관한 것으로, 특히 지능로봇이 자율적으로 동작할 수 있는 레벨 에 해당하는 자율도를 설정함으로써, 상기 지능로봇이 해당 자율도에 따라 상황 인지에 대응하는 자율동작을 수 행할 수 있도록 함과 동시에, 상기 지능로봇이 자율동작을 수행할 수 없거나 또는 지능로봇의 자율동작의 수정 또는 변경이 필요한 경우에, 사용자가 사용자 조작 장치를 이용하여 상기 지능로봇을 수동동작시킴으로써, 지능 로봇의 자율동작을 보완하고 사용자와 지능로봇간의 협업 관계를 극대화시키며, 또한 상기 지능로봇의 수동 동 작 과정을 학습할 수 있도록 함으로써, 상기 지능로봇의 자율동작 레벨을 업그레이드시킬 수 있는 지능로봇의 자율동작 제어 시스템에 관한 것이다."}
{"patent_id": "10-2013-0047459", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "모든 로봇은 자신과 외부의 상태를 지각하고 이것을 기본으로 판단을 하는 인식과 지능이 결정하는 운동 기능 이 세가지 중요한 요소를 가지고 있다. 지능로봇이란 환경의 인식, 정보의 획득, 지능적 판단, 자율적인 행동 등에 필요한 인공지능을 가지고 인간과 상호작용하고 인간에게 다양한 서비스를 제공하는 로봇이다. 로봇의 지능 기능이 발전되면서, 감지 및 인지 기술, 인간 로봇 사용 작용, 자율 주행 및 조작 기술 등이 요소 기술로서 개발되고 있는데, 지능로봇은 기계, 전자, 유비쿼터스 네트웍 등의 IT 기술이 집적된 복합체라 할 수 있다. 그런데, 기존 일반적인 지능로봇은 특정 동작을 수행할 수 있는 정도의 자율도로 동작되는 수준이고, 다양한 자 율도로 조정되어 다양한 자율동작을 수행할 수 없으며, 더 나아가 학습을 통하여 자율도를 업그레이드시키는 동 작을 할 수 없는 상황이다. 따라서, 지능로봇이 다양한 자율동작을 수행할 수 있도록 함과 동시에, 사용자가 모니터링을 통하여 지능로봇이 자율동작을 할 수 없거나, 자율동작을 수정 또는 변경할 필요가 있다고 판단한 경우에는, 사용자가 지능로봇의 동작에 개입하여 지능로봇의 자율동작을 보완하고, 학습을 통하여 지능로봇의 자율도를 업그레이드시킬 수 있는 지능로봇의 자율동작 제어 시스템 기술이 요청되고 있는 실정이다."}
{"patent_id": "10-2013-0047459", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술의 문제점을 해결하기 위하여 창안된 것으로, 지능로봇이 자율적으로 동작할 수 있는 레벨에 해당하는 자율도를 설정함으로써, 상기 지능로봇이 해당 자율도에 따라 상황 인지에 대응하는 자율동작을 수행할 수 있도록 함과 동시에, 상기 지능로봇이 자율동작을 수행할 수 없거나 또는 지능로봇의 자 율동작의 수정 또는 변경이 필요한 경우에, 사용자가 사용자 조작 장치를 이용하여 상기 지능로봇을 수동동작시 킴으로써, 지능로봇의 자율동작을 보완하고 사용자와 지능로봇간의 협업 관계를 극대화시키며, 또한 상기 지능 로봇의 수동 동작 과정을 학습할 수 있도록 함으로써, 상기 지능로봇의 자율동작 레벨을 업그레이드시킬 수 있 는 지능로봇의 자율동작 제어 시스템을 제공하는 것을 그 목적으로 한다."}
{"patent_id": "10-2013-0047459", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 기술적 과제를 해결하기 위하여 제안된 본 발명인 지능로봇의 자율동작 제어 시스템을 이루는 구성 수단은, 지능로봇이 상황 인식에 따라 자율적으로 동작할 수 있도록 자율도를 설정해주고, 상기 지능로봇을 모 니터링한 결과에 따라, 상기 지능로봇이 수동 동작될 수 있도록 제어하는 사용자 조작 장치 및 상기 사용자 조 작 장치에서 설정한 자율도에 따라 상기 상황 인식에 대응하는 자율 동작을 수행하고, 상기 사용자 조작 장치의 동작 제어 명령에 따라 수동 동작함과 동시에 수동 동작을 학습하는 지능로봇을 포함하여 이루어진 것을 특징으 로 한다. 여기서, 기 사용자 조작 장치는 상기 지능로봇이 수행할 자율동작의 레벨을 설정하는 자율도 설정부, 상기 지능 로봇의 동작 상태를 모니터링하는 모니터링부 및 상기 모니터링 결과에 따라, 사용자 조작에 의하여 상기 지능 로봇을 수동동작시키기 위한 제어명령을 출력하는 동작 지시부를 포함하여 이루어진 것을 특징으로 한다. 여기서, 상기 지능로봇은 주변 환경 및 자신에서 발생하는 상황을 인식하는 상황 인식부, 상기 지능로봇이 상기 인식된 상황에 대응하는 동작을 자율적으로 수행할 수 있도록 처리하는 자율동작 처리부, 상기 동작 지시부의 제어명령에 따라 상기 지능로봇이 수동적으로 동작될 수 있도록 처리하는 수동동작 처리부 및 상기 수동동작 처 리부에 의하여 동작되는 상기 지능로봇의 동작 처리 과정을 학습한 후, 상기 인식된 상황에 대응하여 상기 동작 처리에 관련된 정보를 메모리에 저장하는 학습부를 포함하여 이루어진 것을 특징으로 하다. 여기서, 상기 사용자는 상기 모니터링 결과, 상기 지능로봇이 자율동작을 수행하지 않는 것으로 인지한 경우에 는, 상기 자율도 설정부를 통하여 자율도를 조정하거나, 상기 동작 지시부를 통하여 상기 지능로봇이 수동 동작 될 수 있도록 조작하는 것을 특징으로 한다. 또한, 상기 사용자는 상기 모니터링 결과, 상기 지능로봇의 자율동작이 수정 또는 변경될 필요가 있다고 인지한 경우에는, 상기 동작 지시부를 통하여 상기 지능로봇이 수동 동작될 수 있도록 조작하는 것을 특징으로 한다. 또한, 상기 자율동작 처리부는 사용자 조작에 의하여 제1 모드 또는 제2 모드로 설정될 수 있고, 상기 제1 모드 로 설정된 경우, 상기 자율동작 처리부는 상기 설정된 자율도에 대응하는 상황이 인식되는 경우에만 상기 인식 된 상황에 대응하는 동작을 자율적으로 수행하도록 처리하고, 상기 제2 모드로 설정된 경우, 상기 자율동작 처 리부는 상기 설정된 자율도 이하의 자율도에 대응하는 상황들 중, 어느 하나의 상황인 인식되는 경우에, 해당 인식된 상황에 대응하는 동작을 자율적으로 수행하도록 처리하는 것을 특징으로 한다."}
{"patent_id": "10-2013-0047459", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 과제 및 해결수단을 가지는 본 발명인 지능로봇의 자율동작 제어 시스템에 의하면, 지능로봇이 자 율적으로 동작할 수 있는 레벨에 해당하는 자율도를 설정할 수 있기 때문에, 상기 지능로봇이 해당 자율도에 따 라 상황 인지에 대응하는 자율동작을 수행할 수 있도록 할 수 있고, 상기 지능로봇이 자율동작을 수행할 수 없 거나 또는 지능로봇의 자율동작의 수정 또는 변경이 필요한 경우에, 사용자가 사용자 조작 장치를 이용하여 상 기 지능로봇을 수동동작시킬 수 있기 때문에, 지능로봇의 자율동작을 보완하고 사용자와 지능로봇간의 협업 관 계를 극대화시킬 수 있으며, 또한 상기 지능로봇의 수동 동작 과정을 학습할 수 있도록 구성하기 때문에, 상기 지능로봇의 자율동작 레벨을 업그레이드시킬 수 있는 장점이 있다."}
{"patent_id": "10-2013-0047459", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 상기와 같은 과제, 해결수단 및 효과를 가지는 본 발명인 지능로봇의 자율동작 제어 시스템에 관한 바람직한 실시예를 상세하게 설명한다. 이 과정에서 도면에 도시된 구성요소의 크기나 형상 등은 설명의 명료성과 편의상 과장되게 도시될 수 있다. 또 한, 본 발명의 구성 및 작용을 고려하여 특별히 정의된 용어들은 사용자, 운용자의 의도 또는 관례에 따라 달라 질 수 있다.도 1은 본 발명의 실시예에 따른 지능로봇의 자율동작 제어 시스템의 구성도이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 지능로봇의 자율동작 제어 시스템은 사용자가 설정해 준 자율도에 따라 자율동작을 수행함과 동시에 사용자의 개입에 따라 수동동작을 수행하며, 수동동작 과정을 학 습하여 자율도를 업그레이드시킬 수 있는 지능로봇과, 상기 지능로봇의 자율도를 설정 및 조정하여 상 기 지능로봇이 해당 자율동작을 수행할 수 있도록 하고, 지능로봇을 지속적으로 모니터링하여 필요에 따라 직접 상기 지능로봇의 동작을 제어함으로써, 지능로봇의 자율동작을 보완하는 사용자 조작 장치를 포함하여 구성된다. 여기서, 상기 자율도란 사용자 개입 없이 상기 지능로봇이 스스로 자율동작을 수행할 수 있는 정도를 의미 한다. 예를 들어, 자율도는 0 ~ 1 범위로 조정될 수 있고, 자율도가 \"0\"인 경우에는 지능로봇이 스스로 자율동 작을 수행할 수 없고 사용자의 개입에 의해서만 동작되는 것을 의미하고, 자율도가 \"1\"인 경우에는 지능로봇이 사용자 개입 없이 자율동작을 모두 수행할 수 있는 것을 의미한다. 또한, 상기 \"자율동작\"은 지능로봇이 사용자 개입 없이 자율적으로 동작하여 특정 임무 또는 특정 상황 대처를 수행하는 것을 의미하고, \"수동동작\"은 지능로봇이 사용자의 개입에 따라 상기 사용자 조작 장치에 의하여 동작 제어되는 것을 의미한다. 한편, 후술하는 지능로봇의 자율동작 제어 시스템의 구성 및 작용에 대한 설명을 돕기 위하여 자율도에 대한 지 능로봇이 수행하는 자율동작에 대하여 가정을 한다. 즉, 상기 자율도는 0.2, 0.4 및 0.6으로 설정될 수 있고, 상기 자율도 0.2는 상기 지능로봇이 자신의 전방에 사 람이 출현한 경우에 손을 흔드는 동작을 자율적으로 수행할 수 있는 수준이고, 상기 자율도 0.4는 상기 지능로 봇이 자신의 머리를 사람이 만지는 경우에 웃는 얼굴 또는 머리를 끄덕이는 동작을 자율적으로 수행할 수 있는 수준이며, 상기 자율도 0.6은 상기 지능로봇이 자신의 신체를 사람이 타격한 경우에 머리를 젓는 동작을 자율적 으로 수행할 수 있는 수준으로 가정한다. 또한, 상기 자율도가 특정 자율도로 설정된 경우, 상기 지능로봇은 상기 설정된 자율도에 대응하는 자율동작만 을 수행할 수 있거나, 또는 상기 자율도 이하에 포함되는 모든 자율동작을 수행할 수도 있다. 이와 같이, 상기 지능로봇에 의하여 설정된 자율도에 대응하는 자율동작만이 수행되도록 할 것인지, 또는 설정된 자율도 이하에 포함되는 모든 자율동작들이 수행되도록 할 것인지는 사용자 설정에 의하여 이루어질 수 있다. 예를 들어, 상기 자율도가 0.4로 설정된 경우, 상기 지능로봇은 자율도 0.4에 해당하는 자율동작, 즉 사람이 머 리를 만지는 경우 머리를 끄덕이는 동작만을 수행할 수 있거나 또는 이 자율도 0.4에 대응하는 자율동작뿐만 아 니라, 자율도 0.4 이하에 포함되는 자율도 0.2에 대응하는 자율동작, 즉 사람이 출현한 경우 손을 흔드는 동작 을 자율적으로 수행할 수 있다. 상기 사용자 조작 장치는 사용자가 조작하는 장치로서, 상기 지능로봇이 상황 인식에 따라 자율적으로 동작할 수 있도록 자율도를 설정해준다. 그리고, 상기 지능로봇을 지속적으로 모니터링하고, 그 결과에 따 라, 상기 지능로봇의 동작에 사용자가 개입할 필요성이 있는 경우에 상기 지능로봇이 수동 동작될 수 있도록 제어한다. 구체적으로, 상기 사용자 조작 장치는 상기 지능로봇의 자율도를 설정하여 특정한 상황인 발생한 경우, 상기 지능로봇이 상기 특정한 상황을 인식한 후, 자율적으로 특정 동작을 수행할 수 있도록 한다. 예를 들어, 상기 사용자 조작 장치가 상기 지능로봇의 자율도를 0.4로 설정해 주면, 상기 지능로봇(2 0)은 특정한 상황을 인식하고, 즉 사람들이 자신의 머리를 만지면 고개를 끄덕이는 동작을 자율적으로 수행할 수 있다. 또한, 사용자 설정에 따라, 상기 자율도 0.4 이하에 포함되는 자율도 0.2에 관련된 상황(사람이 자신 의 앞에 출현한 상황)을 인식한 경우에도, 손을 흔드는 동작을 자율적으로 수행할 수도 있다. 한편, 상기 사용자 조작 장치는 상기 자율동작을 수행하는 상기 지능로봇을 모니터링한다. 상기 지능로 봇을 모니터링한 결과, 상기 지능로봇이 정상적으로 자율동작을 수행할 수 없거나, 정상적인 자율동작 을 수행하지만, 사용자의 의지에 따라 자율동작의 패턴을 수정 또는 변경하고자 하는 경우에 상기 지능로봇을 직접 제어하여 수동으로 동작될 수 있도록 제어할 수 있다. 이에 대한 구체적인 설명은 후술하겠다. 상기 사용자 조작 장치에서 설정한 자율도에 따라 자율동작을 수행하거나, 상기 사용자 조작 장치의 개 입에 의하여 수동동작을 수행하는 상기 지능로봇은 주변 환경 또는 자신의 상황을 인식할 수 있는 기능을 가진다. 즉, 상기 지능로봇은 각 종 다양한 센서 및 카메라들을 장착하여 주변 환경을 인식할 수 있고, 자 신에게 영향을 미치는 다양한 접촉 및 힘을 인식할 수 있으며, 이러한 상황을 인식한 후, 인식된 상황에 대응하 는 동작을 자율적으로 수행할 수 있다. 이와 같은 상기 지능로봇은 상기 사용자 조작 장치에서 설정한 자율도에 따라 상기 상황 인식에 대응하 는 자율동작을 수행할 수 있다. 즉, 상기 사용자 조작 장치에 의하여 자율도 0.4로 설정된 경우, 상기 지능 로봇은 사람들이 자신의 머리를 만지면, 즉 머리를 만지는 상황을 인식하면, 이에 대응하는 자율동작 즉, 머리를 끄덕이는 자율동작을 수행한다. 물론, 사용자가 상기 자율도를 0.4로 설정하면서 동시에 상기 지능로봇이 자율도 0.4 이하에 포함되는 모든 자 율동작을 수행할 수 있도록 설정한 경우, 상기 지능로봇은 자신의 전방에 사람이 출현한 경우에, 사람 출현이라 는 상황을 인식하고, 이에 대응하는 자율동작, 즉 손을 흔드는 동작을 자율적으로 수행한다. 한편, 상기 지능로봇은 상기 사용자 조작 장치의 동작 제어 명령에 따라 수동동작함과 동시에 수동동작 을 학습하는 기능을 가진다. 구체적으로, 상기 사용자가 모니터링을 통하여 상기 지능로봇을 수동동작시킬 필요가 있다고 판단한 경우, 상기 사용자 조작 장치를 이용하여 상기 지능로봇의 동작을 직접적으로 개입하 여 제어할 수 있다. 이 경우, 상기 사용자 조작 장치는 상기 지능로봇에게 동작 제어 명령을 내리고, 상기 지능로봇은 이 동작 제어 명령에 따라 수동동작을 수행한다. 이와 같은 수동동작이 이루어지는 과정에서, 상기 지능로봇은 상 기 수동동작 과정을 학습한다. 구체적으로, 상기 지능로봇은 상기 사용자 조작 장치의 제어에 따라 수동동 작되는 과정에 관련된 정보, 예를 들어 자신의 동작 패턴 정보, 이동 패턴 정보, 모터 구동 정보 등을 학습하여 메모리에 저장하여 기억해둔다. 이와 같이, 상기 지능로봇이 학습한 수동동작은 메모리에 저장되어 기억되고 있기 때문에, 상기 수동동작을 수 행하기 위한 특정 상황이 인식되면, 상기 지능로봇은 상기 학습하여 기억하고 있는 수동동작 과정을 자율적으로 수행할 수 있다. 결과적으로 상기 지능로봇은 학습을 통하여 자신의 자율도를 업그레이드시킬 수 있다. 이에 대 한 구체적인 설명은 후술한다. 상술한 바와 같이, 상기 지능로봇은 상기 사용자 조작 장치에서 설정한 자율도에 따라 자율동작을 수행 할 수 있고, 자신을 모니터링하고 있는 사용자 조작 장치의 개입에 따라 수동동작을 수행할 수 있으며, 수 동동작 과정을 학습하여 자신이 자율적으로 동작할 수 있는 범위를 확대할 수 있어서, 자신의 자율도를 업그레 이드시킬 수 있는 기능을 가진다. 이와 같은 동작을 수행하는 상기 지능로봇의 자율동작 제어 시스템을 구성하는 사용자 조작 장치 및 지능로봇에 대한 세부적인 구성과 이에 대한 동작을 설명하면 다음과 같다. 도 1에 도시된 바와 같이, 상기 사용자 조작 장치는 조작부, 자율도 설정부, 모니터링부 및 동 작 지시부를 포함하여 구성된다. 상기 조작부는 사용자에 의하여 조작되는 부분으로서, 사용자에 의하여 다양한 명령이 입력된다. 이와 같은 조작부에 의한 입력은 상기 자율도 설정부, 모니터링부 및 동작 지시부로 출력된다. 상기 자율도 설정부는 상기 조작부에서 지시한 자율도를 상기 지능로봇으로 전송한다. 즉, 상기 자 율도 설정부는 상기 지능로봇이 수행할 자율동작의 레벨을 설정한다. 이 때, 상기 자율도 설정부는 사용자의 조작에 따라 상기 자율도를 상기 지능로봇에 전송함과 동시에, 상기 지능로봇이 상기 설정된 자율도에 대응하는 자율동작만을 수행하도록 할 것인지, 상기 설정된 자율도 이하에 포함되는 모든 자율동작을 수행할 수 있도록 할 것인지도 설정할 수 있다. 이와 같이, 상기 자율도 설정부에 의하여 자율도가 설정되면, 상기 지능로봇은 특정 상황을 인식하고, 이 인식된 상황에 대응하는 자율동작이 상기 자율도에 대응하는 자율동작이거나, 또는 상기 자율도 이하에 포함 되는 자율도에 대응하는 자율동작인 경우에, 해당 자율동작을 수행한다. 이와 같이 상기 자율도 설정부가 상기 지능로봇의 자율도를 설정하면, 상기 모니터링부는 상기 지 능로봇의 동작, 상태 등을 모니터링한다. 즉, 상기 모니터링부는 상기 지능로봇의 동작 상태를 모니터링한 다. 이와 같은 모니터링 결과는 사용자에 의하여 인지될 수 있다.상기 사용자는 상기 모니터링부에 의한 모니터링 결과, 상기 지능로봇이 특정 상황을 인식한 후, 이 인 식된 상황에 대응하는 자율동작을 수행하지 않거나, 잘못된 자율동작을 수행하거나, 또는 필요에 따라 수행하는 자율동작을 변경할 필요가 있는 경우, 상기 지능로봇이 수동동작될 수 있도록 개입할 수 있다. 따라서, 상기 사용자 조작 장치의 동작 지시부는 상기 모니터링 결과에 따라, 사용자 조작에 의하여 상 기 지능로봇을 수동동작시키기 위한 제어명령을 출력한다. 그러면, 상기 지능로봇은 상기 제어명령에 따라 수동동작된다. 이와 같은 사용자 조작 장치에 의하여 자율동작을 수행하거나 수동동작을 수행하는 상기 지능로봇은 도 1에 도시된 바와 같이, 상황 인식부, 자율동작 처리부, 수동동작 처리부, 학습부 및 메모리 를 포함하여 구성된다. 상기 상황 인식부는 지능로봇의 주변 환경 및 자신에서 발생하는 상황을 인식한다. 예를 들어, 상기 상황 인식부는 지능로봇의 전방에 사람들이 출현하고 자신을 보고 있는지, 사람들이 자신의 머리를 만지는지, 또 는 사람들이 자신을 타격하는지 등에 대한 상황들을 인식한다. 이러한 상황 인식은 지능로봇에 구비되어 있는 다양한 센서들 및 카메라 등의 입력 데이터를 이용하여 수행될 수 있다. 상기 상황 인식부에 의하여 상황이 인식되면, 상기 지능로봇은 설정된 자신의 자율도의 범위 내에서 상기 인식된 상황에 대응하는 자율동작을 수행할 수 있다. 이러한 자율동작은 상기 자율동작 처리부에 의하여 수 행된다. 즉, 상기 자율동작 처리부는 인식된 상황을 인지하고, 행동 계획을 수립한 후, 수립된 행동 계획에 따라 동작한다. 구체적으로, 상기 자율동작 처리부는 상기 인지된 상황에 대응하는 자율동작이 상기 설정된 자율도 범위 내 에서 처리할 수 있는 자율동작이면서, 동시에 상기 지능로봇이 자율적으로 처리할 수 있는 최대 자율도 이하에 포함되는 자율동작들인 경우에만, 상기 지능로봇이 상기 인식된 상황에 대응하는 동작을 자율적으로 수행할 수 있도록 처리한다. 따라서, 상기 인지된 상황에 대응하는 자율동작이 상기 설정된 자율도 이내에 포함되는 자율동작이 아니거나, 또는 상기 지능로봇이 자율적으로 처리할 수 있는 최대 자율도 이내에 포함되는 자율동작이 아닌 경우에, 상기 자율동작 처리부는 자율동작을 수행할 수 없다. 따라서 상기 지능로봇은 자율동작을 수행하지 않은 상태로 유지한다. 여기서, 상기 지능로봇이 자율적으로 처리할 수 있는 최대 자율도는 상기 지능로봇이 자율적으로 처리할 수 있 는 최대 능력의 자율도를 의미한다. 예를 들어, 현재 지능로봇이 사람이 전방에 출현한 경우 손을 흔드는 동작 과 사람이 머리를 만지는 경우 머리를 끄덕이는 동작을 자율적으로 수행할 수 있는 능력을 가지고 있다면, 상기 지능로봇이 자율적으로 처리할 수 있는 최대 자율도는 0.4가 되는 것이다. 예를 들어 설명하면, 상기 지능로봇이 자율적으로 처리할 수 있는 최대 자율도가 0.4라고 가정하자. 즉, 상기 지능로봇은 사람들이 머리를 만지는 경우, 이에 대한 응답으로 머리를 끄덕이는 동작을 자율적으로 수행할 수 있거나, 이와 같은 동작과 함께 사람들의 출현에 대하여 손을 흔드는 동작을 수행할 수 있는 수준의 자율도를 가진다고 가정하자. 물론 이와 같은 자율동작들에 관련된 정보(모터 구동 관련 정보, 움직임 패턴 정보, 이동 패턴 정보 등)는 인식된 상황에 대응하여 메모리에 저장되어 기억되고 있다. 이와 같은 가정에서, 자율도가 0.4로 설정된 상태에서, 사람들이 지능로봇의 머리를 만지면, 지능로봇은 사람들 이 자신의 머리를 만지는 상황을 인식한다. 그러면, 상기 자율동작 처리부는 상기 인식된 상황에 대응하는 동작, 즉 머리를 끄덕이는 동작을 자율적으로 수행할 수 있고, 자율도 0.2에 대응하는 상황, 즉 사람이 전방에 출현한 경우에도 손을 흔드는 동작을 자율적으로 수행할 수 있다. 그러나, 최대 자율도가 0.4이고, 설정된 자율도가 0.6으로 설정된 상태에서, 사람이 상기 지능로봇을 타격하는 행동을 가한 경우에는 상기 자율동작 처리부가 특정 자율동작을 수행하지 않는다. 구체적으로, 상기 지능로봇의 상황 인식부는 자신에게 타격을 가해진 상황은 인식한다. 그러나, 상기 자율 동작 처리부는 상기 상황 인식부로부터 인식된 상황 정보를 전달받더라도, 자신이 처리할 수 있는 최대 자율도는 0.4에 해당되는 반면, 인식된 상황에 대응하는 자율동작은 0.6의 자율도에 관련되어 있기 때문에, 자 율도 0.6에 대응하는 머리를 흔드는 동작을 자율적으로 수행할 수 없다. 물론, 최대 자율도가 0.6이고, 설정된 자율도가 0.4인 상태에서, 자신을 타격하는 상황을 인식하더라도, 현재 설정된 자율도가 0.4이기 때문에, 0.6의 자율도에 대응하는 자율동작인 머리를 흔드는 동작을 수행할 수 없다. 결과적으로, 상기 자율동작 처리부는 지능로봇이 현재 가지고 있는 최대 능력에 해당하는 최대 자율도와 설 정된 자율도 이내에 포함되는 자율도에 대응되는 자율동작만을 수행할 수 있다. 따라서, 상기 자율동작 처리부는 현지 인식된 상황에 대응되는 자율동작이 설정된 자율도 이하에 포함되는 자율도에서 자율적으로 처리할 수 없는 자율동작이 아니거나, 지능로봇이 자율적으로 처리할 수 있는 최대 자율 도 이하에 포함되는 자율도에서 자율적으로 처리할 수 없는 자율동작인 경우에는 동작을 수행하지 않고 정지된 상태를 유지한다. 이와 같은 동작 상태는 사용자 조작 장치의 모니터링부에 의하여 모니터링되고 있다. 상기 모니터링부 를 통하여 사용자는 지능로봇이 자율적으로 동작하지 않는다는 것을 인지할 수 있고, 이후 지능로봇의 동작 에 개입하여 수동동작되도록 제어할 수 있다. 다만, 상기 사용자는 상기 모니터링 결과에 따라, 상기 지능로봇이 수동동작될 수 있도록 제어할 수도 있지만, 경우에 따라서는 상기 자율도 설정부를 통하여 자율도를 재설정할 수도 있다. 이에 대해서는 후술하겠다. 상기 지능로봇을 수동동작시키기 위하여, 상기 사용자는 상기 사용자 조작 장치의 동작지시부를 통하여 상기 지능로봇에게 동작제어 명령을 내린다. 그러면, 상기 지능로봇의 수동동작 처리부는 상기 동 작제어 명령에 따라 상기 지능로봇을 수동동작시킨다. 구체적으로, 상기 수동동작 처리부는 상기 동작 지시부의 제어명령에 따라 상기 지능로봇이 수동적 으로 동작될 수 있도록 처리한다. 즉, 입력되는 동작 제어명령에 따라 지능로봇의 구동모터 등을 제어하여 수동 동작이 될 수 있도록 처리한다. 이 때, 상기 학습부는 상기 수동동작 과정을 모니터링하면서 학습한다. 즉, 상기 학습부는 상기 수동동 작 처리부에 의하여 동작되는 상기 지능로봇의 동작 처리 과정을 모니터링하면서 학습한다. 예를 들어, 상 기 학습부는 상기 수동동작 처리 과정에서 지능로봇의 움직임 패턴 정보, 이동 패턴 정보, 모터 구동 정보 등을 모니터링하면서 학습한다. 그리고, 상기 학습부는 상기 지능로봇의 동작 처리 과정을 학습한 후, 상기 인식된 상황에 대응하여 상기 동작처리에 관련된 정보를 상기 메모리에 저장하여 기억한다. 구체적으로 설명하면, 사람이 지능로봇을 타격하여 상기 상황 인식부에 의하여 현재 상황이 인식되나, 상기 자율동작 처리부에 의하여 자율도 0.6에 대응하는 자율동작을 수행할 수 없을 때, 모니터링 결과에 따라, 사용자는 동작 지시부를 통하여 상기 지능로봇이 자율도 0.6에 대응하는 자율동작, 즉 머리를 흔드는 동작 을 수행하도록 수동동작시킨다. 이 과정에서 상기 학습부는 상기 인식된 상황 즉, 자신이 타격이 되었다는 상황에 대응하여 상기 수동동작 처리에 관련된 정보를 메모리에 저장하여 기억한다. 결국, 상기 학습부에 의하여 상기 지능로봇은 향후 자신이 타격되었을 때, 이에 대한 응답으로 머리를 흔드는 동작을 자율적으로 수행할 수 있다. 즉, 자신의 최대 자율도를 업그레이드시킬 수 있다. 구체적으로, 현재는 자율도 0.6에 대응하는 상황인 인식된 후, 이에 대한 응답으로 머리는 흔드는 자율동작을 수행할 수 없지만, 상기와 같은 학습부의 동작에 따라 \"타격 받음\"이라는 상황을 인식하고, 이 인식된 상황과 수동동작 처리 과정에 대한 정보를 저장하여 기억하고 있기 때문에, 향후 \"타격 받음\"이라는 상황이 인식된 경 우, 상기 자율동작 처리부는 상기 저장되어 기억하고 있는 상기 메모리를 참조하여 머리를 흔드는 자율동작 을 수행할 수 있게 된다. 이와 같은 방법으로 상기 지능로봇은 자신의 자율도를 업그레이드시킬 수 있다. 이와 같이, 상기 지능로봇은 자율적으로 처리할 수 없는 동작에 대하여, 상기 사용자 조작 장치의 제어를 받아 수동동작될 수 있고, 이 수동동작 과정을 모니터링하면서 학습함으로써, 자신의 자율도를 업그레이드시킬 수 있다. 한편, 상술한 바와 같이, 상기 모니터링 결과, 상기 지능로봇이 움직이지 않는 경우에, 상기 사용자는 상기 동 작지시부를 통하여 상기 지능로봇을 수동동작시킬 수도 있지만, 상기 자율도 설정부를 통해 상기 지능 로봇의 자율도를 재조정할 수도 있다. 즉, 상기 사용자는 상기 모니터링 결과, 상기 지능로봇이 자율동작을 수행하지 않는 것으로 인지한 경우에 는, 상기 자율도 설정부를 통하여 자율도를 조정하거나, 상기 동작 지시부를 통하여 상기 지능로봇이 수동 동작될 수 있도록 조작할 수 있다. 구체적으로, 현재 지능로봇의 자율도가 0.2인 상태에서, 상기 상황 인지부에 의하여 사람이 지능로봇의 머 리를 만지는 것으로 모니터링되고, 이에 대하여 자율동작 처리부에서 자율동작을 처리할 수 없는 것으로 모 니터링된 경우, 사용자는 상기 자율도 설정부를 통하여 지능로봇의 자율도를 0.4로 재조정함으로써, 상기 자율동작 처리부에 의하여 상기 인식된 상황(머리를 만지는 상황)에 대응한 자율동작, 즉 머리를 끄덕이는 동작이 수행되도록 할 수 있다. 반면, 상기 자율도 설정부를 통하여 지능로봇의 자율도를 재설정할 필요가 없는 경우(현재 자율도가 최대 자율도인 경우 등)에는 상기 동작 지시부를 통하여 상기 지능로봇이 수동동작될 수 있도록 하고, 결과적으 로 상기 지능로봇의 자율도를 업그레이드시킬 수 있도록 한다. 한편, 상기 사용자는 상술한 바와 같이, 상기 자율동작 처리부가 상기 인지된 상황에 대응한 자율동작을 수 행하지 않은 것으로 모니터링된 경우에, 상기 동작 지시부를 통하여 상기 지능로봇을 수동동작시킬 수 있지 만, 경우에 따라서는 상기 자율동작 처리부가 상기 인지된 상황에 대응한 자율동작을 수행하더라도, 상기 동작 지시부를 통해 상기 지능로봇을 수동동작시킬 수도 있다. 구체적으로, 상기 사용자는 상기 모니터링 결과, 상기 지능로봇의 자율동작이 수정 또는 변경될 필요가 있다고 인지한 경우에는, 상기 동작 지시부를 통하여 상기 지능로봇이 수동 동작될 수 있도록 조작할 수 있다. 즉, 상기 사용자는 인식된 상황에 대응한 자율동작을 새롭게 수정 또는 변경할 필요가 있거나, 자율동작이 의도 한 동작과 상이하여 수정 및 변경할 필요가 있는 것으로 판단한 경우에는, 상기 해당 상황에 대응한 응답으로 행해지는 동작이 상기 지능로봇이 수행할 수 있도록, 상기 동작 지시부를 통해 상기 지능로봇을 수동동작시 킨다. 그러면, 이 경우에도 상기 학습부는 상기 해당 인식된 상황과, 이에 대응하는 상기 수동동작 처리 과정에 관련된 정보를 메모리에 저장하여 기억한다. 그러면, 상기 자율동작 처리부는 인식된 상황에 대응하여, 새롭게 변경 또는 수정된 자율동작을 수행할 수 있다. 한편, 상술한 바와 같이 상기 자율동작 처리부는 상기 자율도 설정부에 의하여 설정된 자율도에 대응된 자율동작만을 수행할 수 있도록 설정되거나, 상기 자율도 이하에 포함되는 자율도에 대응되는 모든 자율동작들 을 수행할 수 있도록 설정될 수 있다. 예를 들어, 상기 자율동작 처리부는 사용자 조작에 의하여 제1 모드 또는 제2 모드로 설정될 수 있다. 이때, 상기 제1 모드로 설정된 경우, 상기 자율동작 처리부는 상기 설정된 자율도에 대응하는 상황이 인식되는 경우에만 상기 인식된 상황에 대응하는 동작을 자율적으로 수행하도록 처리할 수 있다. 반면, 상기 제2 모드로 설정된 경우, 상기 자율동작 처리부는 상기 설정된 자율도 이하의 자율도에 대응하는 상 황들 중, 어느 하나의 상황인 인식되는 경우에, 해당 인식된 상황에 대응하는 동작을 자율적으로 수행하도록 처 리할 수 있다. 예를 들면, 상기 자율도 설정부가 상기 자율동작 처리부에게 자율도 0.4를 설정하여 전달하고, 제1 모 드로 설정하여 전달하면, 상기 자율동작 처리부는 자율도 0.4에 대응하는 상황, 즉 머리를 만지는 상황이 인식된 경우에만 머리를 흔드는 자율동작을 수행하고, 사람이 출현한 경우에는 자율도 0.2에 대응되는 상황으로 인식되기 때문에, 자율동작을 수행하지 않는다. 반면, 상기 자율도 설정부가 상기 자율동작 처리부에게 자율도 0.4를 설정하여 전달하고, 제2 모드로 설정하여 전달하면, 상기 자율동작 처리부는 자율도 0.4에 대응하는 상황, 즉 머리를 만지는 상황이 인식된 경우에는 머리를 흔드는 자율동작을 수행하고, 사람이 출현한 경우에는 자율도 0.2에 대응되는 상황으로 인식하 고, 손을 흔드는 자율동작을 수행할 수 있다. 이상에서 본 발명에 따른 실시예들이 설명되었으나, 이는 예시적인 것에 불과하며, 당해 분야에서 통상적 지식 을 가진 자라면 이로부터 다양한 변형 및 균등한 범위의 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 다음의 특허청구범위에 의해서 정해져야 할 것이다. 부호의 설명10 : 사용자 조작장치 11 : 조작부 13 : 자율도 설정부 15 : 모니터링부 17 : 동작 지시부 20 : 지능 로봇 21 : 상황 인식부 23 : 자율동작 처리부 25 : 수동동작 처리부 27 : 학습부 29 : 메모리 100 : 지능로봇 자율동작 제어 시스템"}
{"patent_id": "10-2013-0047459", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 지능로봇의 자율동작 제어 시스템의 구성도이다."}
