{"patent_id": "10-2024-0002000", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0035416", "출원번호": "10-2024-0002000", "발명의 명칭": "인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 시스템", "출원인": "한양대학교 산학협력단", "발명자": "여지영"}}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "VR 장치를 통해 사용자에게 가상현실 기반 간호사의 SBAR 의사소통 훈련을 위한 가상의 병원환경을 제공하고,사용자로부터 음성을 입력 받는 단계; 음성-텍스트 변환부를 통해 상기 입력 받은 음성을 텍스트로 변환하는 단계; 데이터 추출부를 통해 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하는 단계; 데이터 병합부를 통해 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데이터와 병합하는단계; 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대화를텍스트로 생성하는 단계; 음성-텍스트 변환부를 통해 상기 생성된 의사 응답 대화 텍스트에 대한 음성 변환을 요청하고, 변환된 음성 추출하는 단계; 및 VR 장치를 통해 사용자에게 의사 응답 대화를 음성으로 재생하는 단계를 포함하는 가상현실 의사소통 방법."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 데이터 추출부를 통해 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하는 단계는, 상기 음성-텍스트 변환부로부터 입력 받은 변환된 텍스트와 미리 저장된 이전 문맥 정보를 이용하여, 상기 텍스트에 포함된 정보와 사용자 음성의 의도를 추출 및 분류하는 가상현실 의사소통 방법."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 데이터 추출부를 통해 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하는 단계는, 상기 음성-텍스트 변환부로부터 상기 VR 장치의 식별번호와 시나리오 정보를 함께 입력 받아, 대화형 인공지능언어모델 기반으로 해당 시나리오에 맞춰 학습하는 가상현실 의사소통 방법."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 데이터 병합부를 통해 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데이터와 병합하는 단계는, 상기 텍스트에서 추출된 환자 및 상황관련 데이터에 관한 사용자 음성의 의도 정보와 슬롯 정보를 해당 시나리오 기반으로 미리 정해 놓은 형식에 따라 분류하여 데이터화하고, 사용자 음성으로부터 추출하여 미리 저장된이전 대화 분석 데이터와 병합하여 저장하는 가상현실 의사소통 방법. 공개특허 10-2025-0035416-3-청구항 5 제1항에 있어서, 상기 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대화를 텍스트로 생성하는 단계는, 가상현실 의사소통의 시작 지점부터 누적된 데이터와 시나리오 상 필요한 환자 및 상황관련 데이터를 비교하여,누락된 정보 중 현재 시점에서 필요로 하는 슬롯 정보를 분석하여 사용자에게 요청하기 위한 텍스트를 생성하는 가상현실 의사소통 방법."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대화를 텍스트로 생성하는 단계는, 미리 훈련된 대화형 인공지능 언어모델에 시나리오 정보를 입력하고 상황극을 사용자에게 요청하기 위해, 상기시나리오 상 필요한 환자 및 상황관련 데이터를 전달하기 위한 의사 응답 대화를 텍스트로 생성하며, 상기 요청에 따라 실시간으로 입력되는 사용자 입력 구문에 대해 대화형 인공지능 언어모델을 통해 분석하는 가상현실 의사소통 방법."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대화를 텍스트로 생성하는 단계는, 상기 시나리오 기반 의사 응답 대화를 텍스트로 생성하기 위해 상기 데이터 병합부로부터 미리 저장된 이전 대화 분석 데이터를 가져와 미리 훈련된 대화형 인공지능 언어모델을 통해 상기 이전 대화 분석 데이터와 현재 입력으로 들어온 텍스트에서 추출된 환자 및 상황관련 데이터를 이용하며, 상기 시나리오 기반 상황극 오류 발생시 상황극을 재설정하기 위해 상기 분석 결과에 따른 시나리오 기반 의사 응답 대화를 반복 생성하는 가상현실 의사소통 방법."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "사용자에게 가상현실 기반 간호사의 SBAR 의사소통 훈련을 위한 가상의 병원환경을 제공하고, 사용자로부터 음성을 입력 받으며, 음성-텍스트 변환부에서 변환되는 의사 응답 대화 텍스트에 대한 음성을 사용자에게 재생하는 VR 장치; 상기 입력 받은 음성을 텍스트로 변환하고, 대화 생성부대화 생성부 생성되는 의사 응답 대화 텍스트에 대한 음성 변환을 요청하고, 변환된 음성 추출하는 음성-텍스트 변환부; 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하는 데이터 추출부; 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데이터와 병합하는 데이터 병합부; 및 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대화를 텍스트로 생성하는 대화 생성부 를 포함하는 가상현실 의사소통 시스템."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 데이터 추출부는, 상기 음성-텍스트 변환부로부터 입력 받은 변환된 텍스트와 미리 저장된 이전 문맥 정보를 이용하여, 상기 텍스공개특허 10-2025-0035416-4-트에 포함된 정보와 사용자 음성의 의도를 추출 및 분류하는 가상현실 의사소통 시스템."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 데이터 추출부는, 상기 음성-텍스트 변환부로부터 상기 VR 장치의 식별번호와 시나리오 정보를 함께 입력 받아, 대화형 인공지능언어모델 기반으로 해당 시나리오에 맞춰 학습하는 가상현실 의사소통 시스템."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서, 상기 데이터 병합부는, 상기 텍스트에서 추출된 환자 및 상황관련 데이터에 관한 사용자 음성의 의도 정보와 슬롯 정보를 해당 시나리오 기반으로 미리 정해 놓은 형식에 따라 분류하여 데이터화하고, 사용자 음성으로부터 추출하여 미리 저장된이전 대화 분석 데이터와 병합하여 저장하는 가상현실 의사소통 시스템."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 대화 생성부는, 가상현실 의사소통의 시작 지점부터 누적된 데이터와 시나리오 상 필요한 환자 및 상황관련 데이터를 비교하여,누락된 정보 중 현재 시점에서 필요로 하는 슬롯 정보를 분석하여 사용자에게 요청하기 위한 텍스트를 생성하는 가상현실 의사소통 시스템."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 대화 생성부는, 미리 훈련된 대화형 인공지능 언어모델에 시나리오 정보를 입력하고 상황극을 사용자에게 요청하기 위해, 상기시나리오 상 필요한 환자 및 상황관련 데이터를 전달하기 위한 의사 응답 대화를 텍스트로 생성하며, 상기 요청에 따라 실시간으로 입력되는 사용자 입력 구문에 대해 대화형 인공지능 언어모델을 통해 분석하는 가상현실 의사소통 시스템."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 대화 생성부는, 상기 시나리오 기반 의사 응답 대화를 텍스트로 생성하기 위해 상기 데이터 병합부로부터 미리 저장된 이전 대화 분석 데이터를 가져와 미리 훈련된 대화형 인공지능 언어모델을 통해 상기 이전 대화 분석 데이터와 현재 입력으로 들어온 텍스트에서 추출된 환자 및 상황관련 데이터를 이용하며, 상기 시나리오 기반 상황극 오류 발생시 상황극을 재설정하기 위해 상기 분석 결과에 따른 시나리오 기반 의사 응답 대화를 반복 생성하는가상현실 의사소통 시스템."}
{"patent_id": "10-2024-0002000", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2025-0035416-5-인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법을 실행시키기 위해 컴퓨터 판독 가능한 저장 매체에 저장된 프로그램에 있어서,VR 장치를 통해 사용자에게 가상현실 기반 간호사의 SBAR 의사소통 훈련을 위한 가상의 병원환경을 제공하고,사용자로부터 음성을 입력 받는 단계; 음성-텍스트 변환부를 통해 상기 입력 받은 음성을 텍스트로 변환하는 단계; 데이터 추출부를 통해 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하는 단계; 데이터 병합부를 통해 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데이터와 병합하는단계; 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대화를텍스트로 생성하는 단계; 음성-텍스트 변환부를 통해 상기 생성된 의사 응답 대화 텍스트에 대한 음성 변환을 요청하고, 변환된 음성 추출하는 단계; 및 VR 장치를 통해 사용자에게 의사 응답 대화를 음성으로 재생하는 단계 를 포함하는 컴퓨터 판독 가능한 저장 매체에 저장된 프로그램."}
{"patent_id": "10-2024-0002000", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법 및 시스템이 제시된다. 본 발명에서 제안하는 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법은 VR 장치를 통해 사용자에 게 가상현실 기반 간호사의 SBAR 의사소통 훈련을 위한 가상의 병원환경을 제공하고, 사용자로부터 음성을 입력 (뒷면에 계속)"}
{"patent_id": "10-2024-0002000", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법 및 시스템에 관한 것으로, 더욱 상세하게는 가상현실 기반 간호사의 SBAR(Situation, Background, Assessment, Recommendation) 의사소통 훈련을 위한 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2024-0002000", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "국내 및 해외 SW(software) 산업의 매출 및 종사자 규모는 꾸준히 성장 중이다. SW 분야의 산업 기술 인력 부족 률 4.3%으로 인력 부족이 심화되는 상태이고, 인력 수요의 폭발적인 증가에 비해 인력 공급이 제한되어 있는 상 황이다. 또한, 비대면 근무, 디지털 전환 등 다양한 요인으로 인해 업무 협업 툴 수요가 증가하고 있고, 슬랙(slack), 노션(notion)과 같은 복수의 협업 툴이 도입되고 있다. 이뿐만 아니라, 전통적인 근무 환경이 사라지고 새로운 형태의 협업에 대한 니즈가 증가되고 조직 내부 구성원만이 아니라, 외부인과도 긴밀한 협력 관계가 이어지는 사례가 증가되고 있다. SW 개발은 업무 관련 지식 습득에 대한 부담이 크고, 복잡한 의사소통 과정이 반복되어 업무 효율성, 업무 생산 성의 유지가 어렵다. 또한, 개발 업무는 인력을 추가로 투입해도 기간이 줄지 않고, 신규 투입된 인원이 생산적 인 일을 할 때까지 시간이 필요하다. 이러한 문제는 소프트웨어 개발 업무뿐만 아니라 다른 다양한 업무에도 발생되고 있고, 업무를 보다 효율적으로 수행하기 위한 솔루션에 대한 연구가 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허 제10-2020-0092499호(2020.08.04)"}
{"patent_id": "10-2024-0002000", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적 과제는 간호사의 의사소통 능력을 향상시키기 위한 SBAR(Situation, Background, Assessment, Recommendation) 의사소통 훈련으로 의료진간 효과적인 소통 훈련이 가능하도록 돕는 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법 및 시스템을 제공하는데 있다. 본 발명의 실시예에 따르면, 가상현실 의사소통 시스템을 인공지능 언어모델에 기반한 소프트웨어 프로그램으로 대 체하여 자동화하고자 한다."}
{"patent_id": "10-2024-0002000", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측면에 있어서, 본 발명에서 제안하는 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법은 VR 장치를 통해 사용자에게 가상현실 기반 간호사의 SBAR 의사소통 훈련을 위한 가상의 병원환경을 제공 하고, 사용자로부터 음성을 입력 받는 단계, 음성-텍스트 변환부를 통해 상기 입력 받은 음성을 텍스트로 변환 하는 단계, 데이터 추출부를 통해 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하 는 단계, 데이터 병합부를 통해 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데이터와 병합하는 단계, 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의 사 응답 대화를 텍스트로 생성하는 단계, 음성-텍스트 변환부를 통해 상기 생성된 의사 응답 대화 텍스트에 대 한 음성 변환을 요청하고, 변환된 음성 추출하는 단계 및 VR 장치를 통해 사용자에게 의사 응답 대화를 음성으 로 재생하는 단계를 포함한다. 상기 데이터 추출부를 통해 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하는 단 계는 상기 음성-텍스트 변환부로부터 입력 받은 변환된 텍스트와 미리 저장된 이전 문맥 정보를 이용하여, 상기 텍스트에 포함된 정보와 사용자 음성의 의도를 추출 및 분류한다. 상기 데이터 추출부를 통해 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하는 단 계는 상기 음성-텍스트 변환부로부터 상기 VR 장치의 식별번호와 시나리오 정보를 함께 입력 받아, 대화형 인공 지능 언어모델 기반으로 해당 시나리오에 맞춰 학습한다. 상기 데이터 병합부를 통해 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데이터와 병합 하는 단계는 상기 텍스트에서 추출된 환자 및 상황관련 데이터에 관한 사용자 음성의 의도 정보와 슬롯 정보를 해당 시나리오 기반으로 미리 정해 놓은 형식에 따라 분류하여 데이터화하고, 사용자 음성으로부터 추출하여 미 리 저장된 이전 대화 분석 데이터와 병합하여 저장한다. 상기 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대 화를 텍스트로 생성하는 단계는 가상현실 의사소통의 시작 지점부터 누적된 데이터와 시나리오 상 필요한 환자 및 상황관련 데이터를 비교하여, 누락된 정보 중 현재 시점에서 필요로 하는 슬롯 정보를 분석하여 사용자에게 요청하기 위한 텍스트를 생성한다. 상기 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대 화를 텍스트로 생성하는 단계는 미리 훈련된 대화형 인공지능 언어모델에 시나리오 정보를 입력하고 상황극을 사용자에게 요청하기 위해, 상기 시나리오 상 필요한 환자 및 상황관련 데이터를 전달하기 위한 의사 응답 대화 를 텍스트로 생성하며, 상기 요청에 따라 실시간으로 입력되는 사용자 입력 구문에 대해 대화형 인공지능 언어 모델을 통해 분석한다. 상기 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대 화를 텍스트로 생성하는 단계는 상기 시나리오 기반 의사 응답 대화를 텍스트로 생성하기 위해 상기 데이터 병 합부로부터 미리 저장된 이전 대화 분석 데이터를 가져와 미리 훈련된 대화형 인공지능 언어모델을 통해 상기 이전 대화 분석 데이터와 현재 입력으로 들어온 텍스트에서 추출된 환자 및 상황관련 데이터를 이용하며, 상기 시나리오 기반 상황극 오류 발생 시 상황극을 재설정하기 위해 상기 분석 결과에 따른 시나리오 기반 의사 응답 대화를 반복 생성한다. 또 다른 일 측면에 있어서, 본 발명에서 제안하는 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 시스템은 사용자에게 가상현실 기반 간호사의 SBAR 의사소통 훈련을 위한 가상의 병원환경을 제공하고, 사용자로부터 음성을 입력 받으며, 음성-텍스트 변환부에서 변환되는 의사 응답 대화 텍스트에 대한 음성을 사용자에게 재생하는 VR 장치, 상기 입력 받은 음성을 텍스트로 변환하고, 대화 생성부대화 생성부 생성 되는 의사 응답 대화 텍스트에 대한 음성 변환을 요청하고, 변환된 음성 추출하는 음성-텍스트 변환부, 상기 변 환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하는 데이터 추출부, 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데이터와 병합하는 데이터 병합부 및 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대화를 텍스트로 생성하는 대화 생성부를 포함한다."}
{"patent_id": "10-2024-0002000", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따른 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 시스템을 통 해 간호사의 의사소통 능력을 향상시키기 위한 SBAR(Situation, Background, Assessment, Recommendation) 의 사소통 훈련이 비대면 방식으로 시간과 장소의 제약없이 가능하다. 본 발명의 실시예에 따르면, 가상현실 의사 소통 시스템을 인공지능 언어모델에 기반한 소프트웨어 프로그램으로 대체하여 자동화하려는 것으로, 기존의 대 면 훈련 방식에 비해서 접근성과 편의성이 높고, 학습 정확도가 높으며 일관된 개인별 맞춤형 훈련이 가능하여 기존의 훈련에 대한 대안을 제시할 수 있다."}
{"patent_id": "10-2024-0002000", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "간호사의 의사소통 능력을 향상시키기 위한 SBAR(Situation, Background, Assessment, Recommendation) 의사소 통 훈련 필요성이 제기됨에 따라 사람 간 의사소통 실습이 이루어져왔다. 본 발명은 이를 인공지능 언어모델에 기반한 소프트웨어 프로그램으로 대체하여 자동화하려는 것으로, 기존의 대면 훈련 방식에 비해서 접근성과 편 의성이 높고, 학습 정확도가 높으며 일관된 개인별 맞춤형 훈련이 가능하여 기존의 훈련에 대한 대안을 제시할 수 있다. 본 발명은 가상현실 기반 간호사의 SBAR(Situation, Background, Assessment, Recommendation) 의사소통 훈련 을 위한 시스템을 제안하며, 이를 위해 대화형 인공지능 언어모델(예를 들어, ChatGPT)를 활용한다. 본 발명의 실시예에 따르면, 실습생이 VR 고글을 착용하고 가상의 병원환경에서 ChatGPT와 대화 기반 역할극을 통해 의료 인 간 의사소통을 연습하며, GPT의 응답은 대형 언어 모델(Large Language Model; LLM)으로 분류 확인한다. 응 답에 오류가 발생할 경우, ChatGPT의 역할 설정을 재조정하여 훈련을 계속한다. 본 발명의 일 실시예에서는 ChatGPT를 예시로서 설명하지만, 이는 일 실시예일뿐 이외의 다양한 대화형 인공지능 언어모델을 사용할 수 있 다. 본 발명의 실시예에 따른 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법 및 시스템 을 통해 간호학생이 SBAR 의사소통 실습을 진행하기 위해, 실시간 음성으로 들어오는 입력 문장으로부터 SBAR 관련 정보를 추출하고, 상기 추출된 정보로부터 아직 들어오지 않은 필수 환자 정보를 인식하여, 해당 정보를 학생이 이후에 말할 수 있도록 유도하는 문장을 응답으로 내보낼 수 있다. 그러나, 실시간 자연어 입력 문장으로부터 특수 도메인의 정보만을 인식하고, 이 결과를 이용해서, 학습적으로 꼭 필요하지만 아직 입력되지 않은 정보를 상대로부터 이끌어내기 위한 대화를 생성하는 것은 정말 난해한 문제 이다. 그리고, 어떠한 목적을 갖고 정보를 요구하거나 질문하는 형태의 문장이 아닌, 의료 상황에서 특정 환자와 현재 간호 상황에 대한 정보를 단순 나열한 문장에 대해서 해당정보의 구성을 분석하여 이를 기반으로 역으로 누락된 정보에 대한 질문을 생성하는 기술은 아직 개시되지 않았다. 본 발명의 실시예에 따르면, 질의에 대한 단순한 응답이 아닌, 자연적인 문장에 대한 역 질문을 생성하는 인공 지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법 및 시스템을 제안한다. 이하, 본 발명의 실시 예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법 을 설명하기 위한 흐름도이다. 본 발명의 일 실시예에 따른 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법을 통해 상대 역할이 필요한 간호 교육을 가상 환경에서 다른 이의 도움 없이도 실습해 볼 수 있도록 VR(Virtual Reality) 환경에서 인공지능 기반의 음성 대화 시스템을 구축하였다. 본 발명의 일 실시예에 따른 VR 환경을 구 성하기 위해 유니티 프로그램과 자연어처리 API(Application Program Interface) 서버를 연결하고, 유니티로 제 작한 프로그램은 VR 장치와 연동된다. 본 발명의 실시예에 따른 유니티 프로그램은 음성-텍스트 변환부로서 설 명된다. 본 발명의 일 실시예에 따른 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법은 VR 장치를 통해 사용자에게 가상현실 기반 간호사의 SBAR 의사소통 훈련을 위한 가상의 병원환경을 제공하고, 사용 자로부터 음성을 입력 받는 단계, 음성-텍스트 변환부를 통해 상기 입력 받은 음성을 텍스트로 변환(다시 말해, 전사)하는 단계, 데이터 추출부를 통해 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추출하는 단계, 데이터 병합부를 통해 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데이터와 병합하는 단계, 대화 생성부를 통해 상기 병합된 데이터를 분석하여 누락된 정보를 확 인하고 시나리오 기반 의사 응답 대화를 텍스트로 생성하는 단계, 음성-텍스트 변환부를 통해 상기 생성된 의사 응답 대화 텍스트에 대한 음성 변환을 요청하고, 변환된 음성 추출하는 단계 및 VR 장치를 통해 사용자에게 의사 응답 대화를 음성으로 재생하는 단계를 포함한다. 본 발명의 일 실시예에 따르면, VR 장치를 통한 사용자(예를 들어, 간호 학생) 음성의 입력과 중단을 유니티 프 로그램(다시 말해, 음성-텍스트 변환부)에서 감지하여, VR 장치와 가상현실 의사소통 시스템을 연결하고, VR 장 치와 가상현실 의사소통 시스템 및 시나리오 정보를 초기화 한다. 단계에서, VR 장치를 통해 사용자(예를 들어, 간호 학생)에게 가상현실 기반 간호사의 SBAR 의사소통 훈련 을 위한 가상의 병원환경을 제공하고, 사용자로부터 음성을 입력 받는다. 단계에서, 음성-텍스트 변환부를 통해 상기 입력 받은 음성을 텍스트로 변환한다. 본 발명의 실시예에 따른 음성-텍스트 변환부가 감지한 사용자의 음성이 중단된 시점으로부터, 예를 들어 2초간 다음 입력이 없는지 기다린 후 상기 감지된 사용자 음성에 대한 변환된 텍스트를 서버로 전송한다. 단계에서, 데이터 추출부를 통해 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데이터를 추 출한다. 본 발명의 일 실시예에 따른 서버의 데이터 추출부를 통해 상기 변환된 텍스트와 미리 저장된 이전 문맥 정보를 받아, 해당 텍스트에 포함된 정보와 사용자 음성의 의도를 알맞게 추출 및 분류해내는 것이 목적이다. 본 발명의 일 실시예에 따르면, 대화형 인공지능 언어모델(예를 들어, ChatGPT)을 기반으로 간호 시나리오에 맞 춰 추가적으로 학습한 모델을 사용한다. 텍스트의 어느 부분에 집중해 정보를 추출해야 할지는 간호 시나리오에 따라 상이하므로, 본 발명의 실시예에 따른 음성-텍스트 변환부로부터 VR 장치의 식별번호와 사용 시나리오 정 보를 함께 입력 받아, 해당 시나리오에 맞게 학습한 모델을 선택하여 사용하도록 구성한다. 단계에서, 데이터 병합부를 통해 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데 이터와 병합한다. 본 발명의 실시예에 따르면, 사용자 음성 텍스트에서 추출한 의도 정보와 슬롯 정보는 시나리오 기반으로 미리 정해 놓은 형식에 따라 분류하여 데이터화하고, 과거 사용자 음성에서 추출하여 가상현실 의사소통 시스템에 기 록해 놓은 데이터에 추가로 저장하도록 한다. 단계에서, 대화 생성부를 통해 시나리오 기반 의사 응답 대화를 텍스트로 생성한다. 본 발명의 실시예에 따른 서버에서는 가상현실 의사소통 시스템 시작 지점부터 누적된 데이터와 시나리오 상 필 요한 환자 및 상황 정보 데이터를 비교하여, 누락된 정보 중 현재 시점에서 가장 필요한 슬롯 정보를 사용자에 게 요청하는 의사 응답 대화 텍스트를 생성한다. 본 발명의 실시예에 따르면, 미리 훈련된 대화형 인공지능 언어모델에 시나리오 정보를 입력하고 상황극을 사용 자에게 요청하기 위해, 상기 시나리오 상 필요한 환자 및 상황관련 데이터를 전달하기 위한 의사 응답 대화를 텍스트로 생성하며, 상기 요청에 따라 실시간으로 입력되는 사용자 입력 구문에 대해 대화형 인공지능 언어모델 을 통해 분석한다. 상기 시나리오 기반 의사 응답 대화를 텍스트로 생성하기 위해 상기 데이터 병합부로부터 미리 저장된 이전 대 화 분석 데이터를 가져와 미리 훈련된 대화형 인공지능 언어모델을 통해 상기 이전 대화 분석 데이터와 현재 입 력으로 들어온 텍스트에서 추출된 환자 및 상황관련 데이터를 이용하며, 상기 시나리오 기반 상황극 오류 발생 시 상황극을 재설정하기 위해 상기 분석 결과에 따른 시나리오 기반 의사 응답 대화를 반복 생성한다. 생성된 텍스트를 서버에서 음성-텍스트 변환부에 응답으로 전송하면, 음성-텍스트 변환부에서 웹 페이지에 텍스 트를 음성으로 변환하도록 요청하고, 변환 결과를 스크래핑하여 음성을 추출한다. 마지막으로, VR 장치를 통해 사용자에게 의사 응답 대화를 음성으로 재생한다. 도 2는 본 발명의 일 실시예에 따른 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 시스 템의 구성을 나타내는 도면이다. 본 실시예에 따른 가상현실 의사소통 시스템은 프로세서, 버스, 네트워크 인터페이스, 메 모리 및 데이터베이스를 포함할 수 있다. 메모리는 운영체제 및 인공지능 언어모델 기반 의 오류방지 기능을 포함한 가상현실 의사소통 루틴을 포함할 수 있다. 프로세서는 데이터 추출부 , 데이터 병합부, 대화 생성부, VR 장치 및 음성 텍스트 변환부를 포함할 수 있다. 다른 실시예들에서 가상현실 의사소통 시스템은 도 2의 구성요소들보다 더 많은 구성요소들을 포함할 수도 있다. 그러나, 대부분의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 예를 들어, 가상현실 의사 소통 시스템은 디스플레이나 트랜시버(transceiver)와 같은 다른 구성요소들을 포함할 수도 있다. 메모리는 컴퓨터에서 판독 가능한 기록 매체로서, RAM(random access memory), ROM(read only memory) 및 디스크 드라이브와 같은 비소멸성 대용량 기록장치(permanent mass storage device)를 포함할 수 있다. 또한, 메모리에는 운영체제와 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 루틴 을 위한 프로그램 코드가 저장될 수 있다. 이러한 소프트웨어 구성요소들은 드라이브 메커니즘(drive mechanism, 미도시)을 이용하여 메모리와는 별도의 컴퓨터에서 판독 가능한 기록 매체로부터 로딩될 수 있 다. 이러한 별도의 컴퓨터에서 판독 가능한 기록 매체는 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이 브, 메모리 카드 등의 컴퓨터에서 판독 가능한 기록 매체(미도시)를 포함할 수 있다. 다른 실시예에서 소프트 웨어 구성요소들은 컴퓨터에서 판독 가능한 기록 매체가 아닌 네트워크 인터페이스를 통해 메모리에 로딩될 수도 있다. 버스는 가상현실 의사소통 시스템의 구성요소들간의 통신 및 데이터 전송을 가능하게 할 수 있다. 버스는 고속 시리얼 버스(high-speed serial bus), 병렬 버스(parallel bus), SAN(Storage Area Network) 및/또는 다른 적절한 통신 기술을 이용하여 구성될 수 있다. 네트워크 인터페이스는 가상현실 의사소통 시스템을 컴퓨터 네트워크에 연결하기 위한 컴퓨터 하드웨 어 구성요소일 수 있다. 네트워크 인터페이스는 가상현실 의사소통 시스템을 무선 또는 유선 커넥션 을 통해 컴퓨터 네트워크에 연결시킬 수 있다. 데이터베이스는 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통을 위해 필요한 모든 정보를 저장 및 유지하는 역할을 할 수 있다. 도 2에서는 가상현실 의사소통 시스템의 내부에 데이터베이 스를 구축하여 포함하는 것으로 도시하고 있으나, 이에 한정되는 것은 아니며 시스템 구현 방식이나 환경 등에 따라 생략될 수 있고 혹은 전체 또는 일부의 데이터베이스가 별개의 다른 시스템 상에 구축된 외부 데이터 베이스로서 존재하는 것 또한 가능하다.프로세서는 기본적인 산술, 로직 및 가상현실 의사소통 시스템의 입출력 연산을 수행함으로써, 컴퓨 터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리 또는 네트워크 인터페이스에 의해, 그리고 버스를 통해 프로세서로 제공될 수 있다. 프로세서는 데이터 추출부, 데이 터 병합부, 대화 생성부, VR 장치 및 음성 텍스트 변환부를 위한 프로그램 코드를 실행하 도록 구성될 수 있다. 이러한 프로그램 코드는 메모리와 같은 기록 장치에 저장될 수 있다. 데이터 추출부, 데이터 병합부, 대화 생성부, VR 장치 및 음성 텍스트 변환부는 도 1 의 단계들(110~170)을 수행하기 위해 구성될 수 있다. 가상현실 의사소통 시스템은 데이터 추출부, 데이터 병합부, 대화 생성부, VR 장치 및 음성 텍스트 변환부를 포함할 수 있다. 본 발명의 실시예에 따른 VR 장치는 사용자에게 가상현실 기반 간호사의 SBAR 의사소통 훈련을 위한 가상 의 병원환경을 제공하고, 사용자로부터 음성을 입력 받으며, 음성-텍스트 변환부에서 변환되는 의사 응답 대화 텍스트에 대한 음성을 사용자에게 재생한다. 본 발명의 일 실시예에 따르면, VR 장치를 통한 사용자(예를 들어, 간호 학생) 음성의 입력과 중단을 유니티 프 로그램(다시 말해, 음성-텍스트 변환부)에서 감지하여, VR 장치와 가상현실 의사소통 시스템을 연결하고, VR 장치와 가상현실 의사소통 시스템 및 시나리오 정보를 초기화 한다. 본 발명의 실시예에 따른 음성 텍스트 변환부는 상기 입력 받은 음성을 텍스트로 변환한다. 본 발명의 실시예에 따른 음성 텍스트 변환부가 감지한 사용자의 음성이 중단된 시점으로부터, 예를 들어 2초간 다음 입력이 없는지 기다린 후 상기 감지된 사용자 음성에 대한 변환된 텍스트를 서버로 전송한다. 본 발명의 실시예에 따른 데이터 추출부는 상기 변환된 텍스트에서 SBAR를 인식하고, 환자 및 상황관련 데 이터를 추출한다. 본 발명의 실시예에 따른 데이터 추출부는 상기 음성-텍스트 변환부로부터 입력 받은 변환된 텍스트와 미 리 저장된 이전 문맥 정보를 이용하여, 상기 텍스트에 포함된 정보와 사용자 음성의 의도를 추출 및 분류한다. 본 발명의 실시예에 따른 데이터 추출부는 상기 변환된 텍스트와 미리 저장된 이전 문맥 정보를 받아, 해 당 텍스트에 포함된 정보와 사용자 음성의 의도를 알맞게 추출 및 분류해내는 것이 목적이다. 본 발명의 실시예에 따른 데이터 추출부는 대화형 인공지능 언어모델(예를 들어, ChatGPT)을 기반으로 간 호 시나리오에 맞춰 추가적으로 학습한 모델을 사용한다. 텍스트의 어느 부분에 집중해 정보를 추출해야 할지는 간호 시나리오에 따라 상이하므로, 본 발명의 실시예에 따른 음성-텍스트 변환부로부터 VR 장치의 식별번호와 사용 시나리오 정보를 함께 입력 받아, 해당 시나리오에 맞게 학습한 모델을 선택하여 사용하도록 구성한다. 본 발명의 실시예에 따른 데이터 병합부는 상기 추출된 환자 및 상황관련 데이터를 미리 저장된 이전 대화 분석 데이터와 병합한다. 본 발명의 실시예에 따른 데이터 병합부는 상기 텍스트에서 추출된 환자 및 상황관련 데이터에 관한 사용 자 음성의 의도 정보와 슬롯 정보를 해당 시나리오 기반으로 미리 정해 놓은 형식에 따라 분류하여 데이터화하 고, 사용자 음성으로부터 추출하여 미리 저장된 이전 대화 분석 데이터와 병합하여 저장한다. 본 발명의 실시예에 따른 대화 생성부는 상기 병합된 데이터를 분석하여 누락된 정보를 확인하고 시나리오 기반 의사 응답 대화를 텍스트로 생성한다. 본 발명의 실시예에 따른 대화 생성부는 가상현실 의사소통의 시작 지점부터 누적된 데이터와 시나리오 상 필요한 환자 및 상황관련 데이터를 비교하여, 누락된 정보 중 현재 시점에서 필요로 하는 슬롯 정보를 분석하여 사용자에게 요청하기 위한 텍스트를 생성한다. 본 발명의 실시예에 따른 대화 생성부는 미리 훈련된 대화형 인공지능 언어모델에 시나리오 정보를 입력하 고 상황극을 사용자에게 요청하기 위해, 상기 시나리오 상 필요한 환자 및 상황관련 데이터를 전달하기 위한 의 사 응답 대화를 텍스트로 생성하며, 상기 요청에 따라 실시간으로 입력되는 사용자 입력 구문에 대해 대화형 인 공지능 언어모델을 통해 분석한다. 본 발명의 실시예에 따른 대화 생성부는 상기 시나리오 기반 의사 응답 대화를 텍스트로 생성하기 위해 상 기 데이터 병합부로부터 미리 저장된 이전 대화 분석 데이터를 가져와 미리 훈련된 대화형 인공지능 언어모델을통해 상기 이전 대화 분석 데이터와 현재 입력으로 들어온 텍스트에서 추출된 환자 및 상황관련 데이터를 이용 하며, 상기 시나리오 기반 상황극 오류 발생 시 상황극을 재설정하기 위해 상기 분석 결과에 따른 시나리오 기 반 의사 응답 대화를 반복 생성한다. 대화 생성부를 통해 생성된 텍스트를 음성-텍스트 변환부에 응답으로 전송하면, 음성-텍스트 변환부 에서 웹 페이지에 텍스트를 음성으로 변환하도록 요청하고, 변환 결과를 스크래핑하여 음성을 추출한다. 마지막으로, VR 장치를 통해 사용자에게 의사 응답 대화를 음성으로 재생한다. 도 3은 본 발명의 일 실시예에 따른 음성-텍스트 변환부로부터 입력되는 시나리오 정보의 예시를 나타내는 도면 이다. 종래기술에 따르면, 목적 지향 가상 대화 환경에서 인공지능의 응답을 생성하는 연구는 여러 분야에서 수행되어 왔지만, 사용자 입력이 질문이나 명령의 형식을 갖지 않을뿐만아니라, 정보 요청의 목적이 아니라는 점에서 종 래기술들과 본 발명에서 다루는 대화 형식이 큰 차이를 보인다. 도 3(a)는 본 발명의 일 실시예에 따른 상황극을 위한 시나리오 정보의 예시를 나타내고, 도 3(b)는 본 발명의 일 실시예에 따른 대화형 인공지능 언어모델을 통해 생성된 상황극의 예시를 나타낸다. 도 3(a) 및 도 3(b)를 참조하면, 대형 언어 모델(Large Language Model; LLM)에 미세 튜닝(fine-tuning)과 예 외 처리 없이 역할극을 시도할 경우 문제점을 나타낸다. 후반부로 갈수록 간호사의 발화 중 누락된 정보를 짚어주지 않고, 간호사가 필요한 정보를 모두 언급했을 경우 의 대답만을 기계적으로 내뱉는 모습이 관찰된다. 도 4는 본 발명의 일 실시예에 따른 사용자 음성 텍스트에서 추출한 의도 정보와 슬롯 정보를 시나리오 기반으 로 분류하여 데이터화하는 과정을 설명하기 위한 도면이다. 도 4(a)는 본 발명의 일 실시예에 따른 사용자 음성의 텍스트 분석 결과의 예시를 나타내고, 도 4(b) 및 도 4(c)는 본 발명의 일 실시예에 따른 사용자 음성의 의도 정보와 슬롯 정보를 해당 시나리오 기반으로 미리 정해 놓은 형식에 따라 분류하여 데이터화한 결과의 예시를 나타낸다. VR 장치를 통해 사용자(예를 들어, 간호 학생)에게 가상현실 기반 간호사의 SBAR 의사소통 훈련을 위한 가상의 병원환경을 제공하고, 사용자로부터 음성을 입력 받는다. 본 발명의 실시예에 따른 음성-텍스트 변환부가 감지한 사용자의 음성이 중단된 시점으로부터, 예를 들어 2초간 다음 입력이 없는지 기다린 후 상기 감지된 사용자 음성에 대한 변환된 텍스트를 서버로 전송한다. 본 발명의 일 실시예에 따른 서버의 데이터 추출부를 통해 상기 변환된 텍스트와 미리 저장된 이전 문맥 정보를 받아, 해당 텍스트에 포함된 정보와 사용자 음성의 의도를 알맞게 추출 및 분류해내는 것이 목적이다. 도 5는 본 발명의 일 실시예에 따른 시나리오에 맞춰 학습을 수행하는 과정을 설명하기 위한 도면이다. 도 5(a)는 본 발명의 일 실시예에 따른 LLM 학습 과정을 설명하기 위한 예시도이다. 도 5(a)를 참조하면, 상황극을 위한 시나리오를 입력 받아, 예외 상황 대비를 위한 학습 데이터를 준비한다. 예 를 들어, 의사-간호사 대화 쌍이 주어졌을 때, 간호사의 발화 부분을 { \"상황1\": {\"카테고리1\": [정보1, 정보2, …], … }와 같이 분석할 수 있도록 LLM을 학습해야 한다. 도 5(b)는 본 발명의 일 실시예에 따른 학습 데이터의 예시도이다. 도 5(b)를 참조하면, SBAR 전달 상황에서 발생할 수 있는 대화 중 일부에 대해, 의사-간호사의 대화 쌍 (question)에 대한 분석 결과(answer)를 매핑하는 형식으로 학습 데이터를 생성한다. 사전에 많은 데이터로 학 습되어 있는 LLM에 학습 데이터를 넣고 미세 튜닝하여, 해당 시나리오 내의 대화를 알맞게 분석할 수 있도록 학 습한다. 도 6은 본 발명의 일 실시예에 따른 시나리오 정보를 추출하는 과정을 설명하기 위한 도면이다. 도 6(a) 및 도 6(b)는 본 발명의 일 실시예에 따른 시나리오 정보를 추출 결과를 나타내는 예시도이다. 도 6(a) 및 도 6(b)를 참조하면, LLM를 통한 실시간 추론(inference)을 통해 시나리오 정보를 자동으로 추출하 고, LLM에 해당 정보를 입력한 뒤 실시간 대화 분석을 요청할 수 있다. 도 5(a)의 시나리오 데이터를 .csv로 변환하여 저장 후 특정 스크립트를 실행하여 도 6(c)와 같이 json 형식으 로 데이터를 추출한다. 도 7은 본 발명의 일 실시예에 따른 분석 결과 내 SBAR 상황에 필요한 정보들을 분류하는 과정을 설명하기 위한 도면이다. 도 7(a)는 대화 시스템 로그를 나타내고, 도 7(b)는 대화 시스템 시작 시점에 발화 정보를 저장할 dialogue_state를 SBAR 항목에 대해 초기화 예시를 나타낸다. 도 7(a)에서와 같이 미세 튜닝된 LLM이 실시간으로 분석한 발화 내 SBAR 상황에 필요한 정보들을 위 dialogue_state에 누적하여 저장한다. 도 7(c)를 참조하면, SBAR 중 현재 단계를 progress로 표시하고, 현재 단계의 필요한 정보와 dialogue_state(LLM이 분석한 정보)를 비교하여, 누락된 정보가 있다면 그에 대해 되묻는 응답을 출력한다. 해 당 단계가 완료되면 다음단계로 넘어가도록 하여, SBAR의 순서에 맞춰 환자상태를 의사에게 보고하도록 유도하 는 교육적 효과가 있다. 도 8은 본 발명의 일 실시예에 따른 서버의 응답 데이터를 나타내는 도면이다. 도 8(a)와 같이, 필요한 정보를 모두 받았다면 다음단계로, 아니라면 도 8(b)와 같이, 누락된 정보를 되묻는 응 답을 출력한다. 본 발명의 일 실시예에 따르면, 간호학생이 의료진간 환자 정보를 공유하는 의사소통 실습을 진행할 때, 실제 의료 상황에서의 의사소통 훈련에 매우 가까운 환경에서 실습 가능하다. 의료 상황에서 누락된 정보는 중대한 문제를 야기할 수 있다. 상기 기술한 자연어 정보인식 수단에서 종래 기술 에서 포착하지 못하는 대화의 세세한 부분까지 잡아내어, 빠진 정보를 자동으로 탐지하고 실습 학생이 스스로 해당 정보를 보완할 수 있도록 유도하므로, 실제 의료 상황에서의 이러한 위험을 줄일 수 있다. 대부분의 질의응답 시스템은 사용자의 질문에 대한 답을 제공하는 것이 주목적이나, 본 발명이 목적으로 하는 특수 상황에서의 대화에는 적용이 힘들며, 본 발명은 사용자의 질문이나 발언에서 영역별로 요구되는 정보임에 도 누락된 정보를 파악함에 따라 그에 대한 역 질문을 생성하는 기술을 포함하므로, 종래보다 다양한 자연어와 대화 상황을 처리할 수 있다. 본 발명의 실시예에 따른 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 시스템은 다학 제 의료 분야의 교육 및 훈련을 위해 사용될 수 있다. 간호대학 또는 다른 의료 분야 학생들에게도 SBAR 의사소 통 기술을 교육하는 데 사용될 수 있다. 본 발명의 실시예에 따르면, 간호실습 교육 플랫폼에 사용될 수 있다. 교육용 소프트웨어나 웹 플랫폼에 본 발 명을 통합하여, SBAR 의사소통 실습에의 접근성을 제고할 수 있다. 본 발명의 또 다른 실시예에 따르면, 가상현실 의료 시뮬레이터에 사용될 수 있다. VR 헤드셋과 연동하여 ChatGPT를 활용한 더 실감나는 SBAR 훈련을 제공할 수 있다. 본 발명의 또 다른 실시예에 따르면, 의료 기관 인트라넷 에 사용될 수 있다. 의료기관의 기존 시스템에 통합하 여, SBAR에 익숙치 않은 신규 간호사를 포함하여 새로운 의료진이나 기존 의료진 또한 정해진 형식에 맞춰 훈련 받을 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로"}
{"patent_id": "10-2024-0002000", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크 로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이 터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다."}
{"patent_id": "10-2024-0002000", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형 태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성 될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3a 도면3b 도면4a 도면4b 도면4c 도면5a 도면5b 도면6a 도면6b 도면6c 도면7a 도면7b 도면7c 도면8a 도면8b"}
{"patent_id": "10-2024-0002000", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 방법 을 설명하기 위한 흐름도이다. 도 2는 본 발명의 일 실시예에 따른 인공지능 언어모델 기반의 오류방지 기능을 포함한 가상현실 의사소통 시스 템의 구성을 나타내는 도면이다. 도 3은 본 발명의 일 실시예에 따른 음성-텍스트 변환부로부터 입력되는 시나리오 정보의 예시를 나타내는 도면 이다. 도 4는 본 발명의 일 실시예에 따른 사용자 음성 텍스트에서 추출한 의도 정보와 슬롯 정보를 시나리오 기반으 로 분류하여 데이터화하는 과정을 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 시나리오에 맞춰 학습을 수행하는 과정을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에 따른 시나리오 정보를 추출하는 과정을 설명하기 위한 도면이다. 도 7은 본 발명의 일 실시예에 따른 분석 결과 내 SBAR 상황에 필요한 정보들을 분류하는 과정을 설명하기 위한 도면이다. 도 8은 본 발명의 일 실시예에 따른 서버의 응답 데이터를 나타내는 도면이다."}
