{"patent_id": "10-2020-0094945", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0014998", "출원번호": "10-2020-0094945", "발명의 명칭": "인공신경망을 이용하여 언코일 과정이 포함된 생산품에서 결함을 검출 및 분류하는 결함 검출", "출원인": "전남대학교산학협력단", "발명자": "정희택"}}
{"patent_id": "10-2020-0094945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "표본상의 결함을 검출하고 분류하도록 구성된 시스템에 있어서,적어도 하나의 컴퓨터 서브시스템 및 상기 적어도 하나의 컴퓨터 서브시스템에 의해 실행되는 적어도 하나이상의 컴포넌트를 포함하고,상기 적어도 하나의 컴포넌트는 표본상의 결함을 검출하고 상기 표본상에서 검출된 결함을 분류하도록 구성된인공신경망을 포함하고,상기 인공신경망은 영상 서브시스템에서 생성된 표본의 이미지 특징을 결정하도록 구성된 부분과 특징 추출 부분 및 상기 표본상의 결함을 검출하는 검출 인공신경망 및 상기 이미지의 결정된 특징에 기초하여 상기 표본상에서 검출된 결함을 분류하도록 하는 분류 인공신경망을 포함하고,상기 컴퓨터 서브시스템은 상기 검출 및 분류의 결과를 이용하여 결과보고서를 생성하도록 형성되는 것을 특징으로 하는 결함 검출 및 분류 장치."}
{"patent_id": "10-2020-0094945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 인공신경망은 딥러닝 네트워크로 구성되는 것을 특징으로 하는 결함 검출 및 분류 장치."}
{"patent_id": "10-2020-0094945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 이미지 특징을 결정하는 부분은 적어도 하나이상의 컨볼루션 레이어를 포함하는 것을 특징으로 하는 결함검출 및 분류 장치."}
{"patent_id": "10-2020-0094945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 표본은 인쇄물인 것을 특징으로 하는 결함 검출 및 분류 장치."}
{"patent_id": "10-2020-0094945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 표본은 금속 코일인 것을 특징으로 하는 결함 검출 및 분류 장치."}
{"patent_id": "10-2020-0094945", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 표본상의 결함을 검출하고 분류하도록 구성된 시스템에 있어서, 적어도 하나의 컴퓨터 서브시스템 및 상기 적어도 하나의 컴퓨터 서브시스템에 의해 실행되는 적어도 하나이상의 컴포넌트를 포함하고, 적어도 하나의 컴포넌트는 표본상의 결함을 검출하고 표본상에서 검출된 결함을 분류하도록 구성된 인공신경망을 포함하고, 인 공신경망은 영상 서브시스템에서 생성된 표본의 이미지 특징을 결정하도록 구성된 부분과 특징 추출 부분 및 표 본상의 결함을 검출하는 검출 인공신경망 및 이미지의 결정된 특징에 기초하여 표본상에서 검출된 결함을 분류하 도록 하는 분류 인공신경망을 포함하고, 컴퓨터 서브시스템은 검출 및 분류의 결과를 이용하여 결과 보고서를 생 성하도록 형성되는 결함 검출 및 분류 장치를 개시한다."}
{"patent_id": "10-2020-0094945", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 영상을 이용하여 제작하고자 하는 원래의 형태로부터 현격히 다른 형태의 결함을 검출하고 분류하는 결함 검출 및 분류 장치에 관한 것이다."}
{"patent_id": "10-2020-0094945", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "동일한 품질을 갖도록 대량 생산되는 제조물의 불량 여부를 검출하는 방식은 다양하게 시도되어 왔다. 종이, 비 닐, 섬유등의 재질에 원판의 디자인을 인쇄하는 것뿐만 아니라 냉연/열연 강판, 박판(foil)등 과 같은 인쇄 산 업/금속 산업의 생산 공정상의 중간/최종 생산물과 같이 동일한 형상을 갖도록 제작되는 제조물에 대해서는 불 량 검출에 소요되는 시간과 노력을 최소화하고 동시에 검출 품질을 높이기 위해 이미지를 사용하여 정보를 처리 하는 분석기술이 적극적으로 활용된다.검사공정은 인쇄 산업과 금속 산업에서 언코일(un-coil)과 재코일(re-coil)의 공정에서 다양한 단계에서 사용되 어 표면상의 결함을 검출하여 제조 공정에서 더 높은 수율을 달성하므로써 수익을 높일 수 있다. 결함 검토는 전형적으로 검사 공정에 의해 검출된 결함을 재검출하고, 고배율 광학 시스템 또는 X-ray를 사용하여 더 높은 해상도 또는 표면 안쪽의 크랙을 검출하여 결함에 관한 추가 정보를 생성하는 것을 포함한다. 따라서 결함검토 는 결함이 검사에 의해 검출된 표본상의 개별위치에서 수행된다. 결함 검토에 의해 생성된 결함에 대한 더 높은 해상도의 데이터는 프로파일, 거칠기, 보다 정확한 크기 정보등과 같은 결함의 속성을 결정하는 데 적합하다. 결함은 일반적인 검사에 비하여 결함 검토에 의해 결정된 정보에 기초하여 결함 유형을 특정하여 보다 정확하게 분류할 수 있다. 딥러닝 인공지능의 발전으로 딥러닝은 결함 검출 및 분류에 사용하기 위한 매력적인 엔진이 되었다. 결함 검출 및 분류를 위한 딥러닝 엔진을 사용하는 현재의 접근 방법은 결함의 검출 및 분류에서 발생하는 문제점을 각각 해결해 왔다. 예를 들어 학습을 위한 분류에서 사용자는 영상 레벨 레이블을 결함 이미지에 할당할 수 있다. 영 상 레벨 레이블 및 결함영상은 CNN(Convolutional Neural Network)을 학습시키는데 사용된다. 학습이 끝난 후 제품을 생산하는 공정에서 CNN처리 입력에 결함 영상을 추가하면 CNN은 영상의 분류 및 영상 분류와 연관된 신 뢰도 값(confidence)를 출력한다. 또한 결함 검출을 위해 사용자는 영상 화소(Pixel)수준의 레이블을 결함 영상 (전형적으로 결함 영상에 해당하는 다수의 클래스)에 할당할 수 있다. 화소 수준 레이블 및 결함 영상은 결함 분류를 위해 학습되는 CNN과는 서로 다른 검출용 CNN을 학습시키는데 사용된다. 다시 말하면 검출용 CNN과 분류 용 CNN은 상호 연관성이 없는 배타성을 가질 수 있다. 검출용 CNN의 학습후 제조 공정을 거쳐 생산하는 동안 결 함 영상은 검출 CNN에 입력되고 이에 의해 검출 CNN은 블롭(BLOB: Binary Large Object: 이진화된 데이터)을 출력하고, 분류 CNN은 블롭 분류 및 관련 신뢰도에 따라 분류등 평가 결과를 출력한다. 그러나 상기 방법 및 시스템에도 여러가지 단점이 있다. 특히 검출 네트워크가 학습되기 위해 화소 수준에서 결 함에 주석(Annotation)을 달아야 하는 부담이 사용자에게 매우 크기 때문이다. 또한 적어도 2개 이상의 인공신 경망(Neural Network)에서 결함 관련 학습 시간 및 결함 요건의 학습에 상당한 비용이 들어간다. 왜냐하면, 사 용자는 인공신경망에 사전 학습된 가중치를 얻기 위해 많은 양의 기존 데이터의 화소마다 주석을 달아야 할 필 요가 있다. 또한 분류와 검출의 상이한 네트워크에 대해 별도의 사전 학습된 가중치가 획득되어야 하는데 왜냐 하면 분류 CNN에서 최적화된 학습 정보를 가지고 있더라도 검출 CNN에서는 최대한의 검출율을 획득하지 못하기 때문이다."}
{"patent_id": "10-2020-0094945", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 검사 대상의 영상이미지를 이용하여 검사 대상에 포함된 결함을 검출함에 있어서 결함의 검출 성능을 향상시킬 수 있는 이미지 처리 방법을 이용하여 생산품의 이미지에서 결함을 검출 및 분류하는 결함 검출 및 분 류 장치를 제공하는데 그 목적이 있다."}
{"patent_id": "10-2020-0094945", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 결함을 검출 및 분류하는 결함 검출 및 분류 장치는 적어도 하나의 컴퓨터 서브시 스템 및 상기 컴퓨터 서브시스템에 의해 실행되는 적어도 하나의 컴포넌트를 포함하고, 상기 적어도 하나의 컴 포넌트는 표본상의 결함을 검출하고 상기 표본상에서 검출된 결함을 분류하도록 구성된 인공 신경망을 포함하고, 상기 인공 신경망은 영상 서브시스템에서 생성된 표본의 이미지 특징을 결정하도록 구성된 부분과 특 징 추출 부분 및 상기 표본상의 결함을 검출하는 검출 인공 신경망 및 상기 이미지의 결정된 특징에 기초하여 상기 표본상에서 검출된 결함을 분류하도록 하는 분류 인공 신경망을 포함하고, 상기 컴퓨터 서브시스템은 상기 검출 및 분류의 결과를 이용하여 결과 보고서를 생성하도록 구성되는 것을 특징으로 한다. 또한, 상기 인공신경망은 딥러닝 네트워크로 구성될 수 있다. 또한, 상기 이미지 특징을 결정하는 부분은 적어도 하나이상의 컨볼루션 레이어를 포함할 수 있다. 또한, 상기 표본은 인쇄물일 수 있다. 또한, 상기 표본은 금속 코일일 수 있다."}
{"patent_id": "10-2020-0094945", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 결함을 검출 및 분류하는 결함 검출 및 분류 장치는 검출 네트워크가 학습하기 위해 픽셀 레벨에서 결함에 주석을 다는 사용자 부담을 상당히 감소시킬 수 있다. 또한, 본 발명은 분류로부터의 학습을 더 어려운 검출 문제에 적용할 수 있다."}
{"patent_id": "10-2020-0094945", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 실시예에 따른 결함을 검출 및 분류하는 결함 검출 및 분류 장치에 대 하여 상세히 설명하기로 한다. 먼저 본 발명의 일 실시예에 따른 결함을 검출 및 분류하는 결함 검출 및 분류 장치에 대하여 설명한다. 도 1은 본 발명의 일 실시예에 따른 결함 검출 및 분류 장치의 개략적인 구성도이다. 도 2는 도 1의 결함 검출 및 분류 장치를 구성하는 인공신경망의 흐름도이다. 도 3은 적어도 하나이상의 컴퓨터 시스템에서 컴퓨터로 구 현되는 방법을 수행하기 위한 프로그램 명령어들의 일시적/비일시적 영상 판독 가능 매체의 실시예를 도시한 블 록도이다. 본 발명의 일 실시예에 따른 결함을 검출 및 분류하는 결함 검출 및 분류 장치는 표본상의 결함을 검출, 분류 및 결과보고를 하도록 구성된 시스템에 관한 것이다. 시스템은 적어도 하나의 컴퓨터 시스템 및 컴퓨터 서 브 시스템에서 실행되는 적어도 하나의 컴포넌트를 포함할 수 있다. 상기 컴포넌트는 표본상의 결함을 검출하고, 표본상에서 검출된 결함을 분류하도록 구성된 인공 신경망을 포함 한다. 상기 인공신경망은 영상 서브 시스템에서 생성된 표본 이미지의 특징(Feature)을 결정하도록 구성된 부분 을 포함한다. 또한, 상기 인공 신경망은 결함 영상의 결정된 특징에 기초하여 표본상의 결함을 검출하고 영상의 결정된 특징에 기초하여 표본상에서 검출된 결함을 분류하도록 구성된 부분을 포함할 수 있다. 또한, 상기 컴퓨 터 서브시스템은 검출 및 분류의 결과를 보고서 형태로 생성하도록 구성될 수 있다. 이하에서 상호 교환적으로 사용되는 용어인 디자인, 디자인 데이터 또는 데이터 정보는 일반적으로 기하학적인 디자인 또는 금속의 냉간/열간 압연 과정에서 일률적으로 성형된 패턴을 의미한다. 또한 여기에서 결함이라 함 은, 피인쇄되는 재질의 비일관성에서 발생하거나, 생산 과정에서 임의적으로 발생하는 결함은 물론 인쇄/코일링 /리코일링등 온도 및 주변 환경 변화에서 생성되는 패턴상의 결함을 의미한다. 상기 결함 검출 및 분류 장치가 대상으로 하는 표본은 종이, 비닐, 섬유등에 특정한 디자인이 인쇄된 인쇄 물이며, 혹은 열연/냉연을 통해서 생산된 금속 코일 일 수 있다. 또한 상기 표본은 인쇄된 디자인중 일부 결함 일 수 있으며, 금속 코일의 경우에는 생성된 영상에 표시되는 크랙 또는 X-ray에 의해 투시된 파티클일 수 있다. 상기 결함 검출 및 분류 장치는 표본상의 결함을 검출하고 분류하도록 구성된 시스템일 수 있다. 또한, 상 기 결함 검출 및 분류 장치는 검토 및 검사 (예를 들어 고배율 광학 카메라 및 X-ray영상)를 위한 결함의 검출과 분류에 있어서 하나의 통합된 딥러닝 인공신경망 엔진을 제공할 수 있다. 상기 결함 검출 및 분류 장치 에 의한 결함 검출 및 자동 결함 분류는 현재 산업 현장에서 아주 중요하다. 현재 제안된 일부 엣지 기반 또는 딥러닝 검출은 고배율 광학계를 이용하는 경우, 50마이크로미터 감도에 도달했으며 제안된 딥러닝 기반 분 류는 비교적 높은 수준의 사용 편의성과 함께 90% 정확도와 순도, 인쇄물, 금속, 호일의 Recoil과 동시 검출/분 류에서는 최대 분당 200미터의 처리 속도를 달성했다. 그러나, 상기 결함 검출 및 분류 장치에 의한 접근법은 기존에 사용되는 방법과 비교할 때 검출과 분류의 이슈에서 발생하는 문제를 독립적으로 해결하는데, 이러한 독립적인 접근 방식은 학습의 비용(cost)가 두 배가 될 수 있는 경우가 있다. 또한 각 부분은 다른 부분으로부터의 정보를 활용하기 어려워 성능에도 영향을미친다. 검출을 위한 주석비용 (학습을 위해 검출된 결함의 레이블링: annotation)은 비교적 높고, 이러한 주석 의 양을 감소시키는 것은 딥러닝 기반 검출 및 분류에서 큰 가치가 있다. 상기 결함 검출 및 분류 장치에 의한 표본상의 결함을 검출하고 분류하는 구성은 도 1에 도시되어 있다. 상기 결함 검출 및 분류 장치(즉, 컴퓨터 시스템)는 영상 서브 시스템과 적어도 하나 이상의 컴퓨터 서브시스템 및 적어도 하나 이상의 컴퓨터 서브시스템에 의해 실행된 적어도 하나 이상의 컴포넌트 을 포함한다. 상기 컴포넌트는 컴퓨터 서브 시스템과 연동될 수 있다. 또한, 상기 결함 검출 및 분류 장치는 표본 영상을 생성하도록 구성된 영상 시스템을 포함한다. 상기 결함 검출 및 분류 장치는, 도 1에서 보는 바와 같이 표본의 영상을 생성하도록 구성된 영상 서브 시스템을 포함한다. 상기 결함 검출 및 분류 장치는 표본상의 결함을 검출 및 분류하기 위한 컴퓨터 시스템일 수 있다. 상기 결함 검출 및 분류 장치는 영상 서브 시스템에 의해 생성된 표본의 이미지를 취득할 수 있다. 또한, 상기 결함 검출 및 분류 장치는 표본상의 결함을 검출하고, 분류하도록 구성된 인공신경망의 분류 인공신경망 부분내에 영상을 입력함으로써 영상의 결정된 특징에 의하여 표본에서 검출된 영상의 결함 부분을 분류할 수 있 다. 상기 결함 검출 및 분류 장치는 검출 및 분류의 결과를 결과 보고서로 생성할 수 있다. 또한, 상기 결함 검출 및 분류 장치는 표본상의 결함을 검출, 분류, 보고서 작성을 하기 위한 컴퓨터 구현 방법을 수행하기 위해 적어도 하나 이상의 컴퓨터 시스템 상에서 실행하는 프로그램 명령어들을 수행하는 일시 적/비일시적 영상 판독 가능 매체를 포함할 수 있다. 상기 일시적/비일시적 영상 판독 가능 매체는 컴퓨터 서브 시스템으로 추가로 구성될 수 있다. 상기 영상 서브시스템은 광학 기기를 기반으로 하는 영상 시스템으로 구성된다. 또한, 상기 영상 서브시스 템은 적어도 하나 이상의 조명 광원을 포함한다. 상기 영상 서브시스템은 적어도 하나 이상의 광원이 도 1에 표현되지 않은 입사각으로 광을 표본으로 지향시키도록 구성될 수 있다. 상기 영상 서브시스템 은 광원 광학 요소 및 렌즈 또는 표본을 이동시켜 최적의 영상 취득 조건을 유지할 수 있다. 상기 광원의 표본에 대한 입사각은 표본의 특성에 따라 변할 수 있는 임의의 적절한 경사 입사각을 포함할 수 있다. 상기 영상 서브시스템은 적어도 하나 이상의 검출 채널을 포함한다. 상기 검출 채널중 적어도 하나는 영상 서브시스템에 의한 표본의 조명광원으로 인해 표본으로부터 광을 검출하고 검출된 광에 응답하여 출력을 생성하도록 구성된 검출기를 포함한다. 상기 하나이상의 검출 채널은 업계에 공지된 임의의 적절한 검출기를 포함할 수 있다. 예를 들어, 상기 검출기는 CCD (Charged Coupled Device), CMOS(Complementary Metal Oxide Semiconductor) 카메라 및 업계에 알려진 다른 적절한 검출기를 포함할 수 있 다. 상기 영상 서브시스템의 각각의 검출 채널에 포함된 각각의 검출기에 의해 생성되는 출력은 영상 신호, 또는 영상 데이터를 기본으로 한다. 그렇지만, 이러한 영상 신호를 컴퓨터 서브시스템에서는 다른 형태의 데이터로 변경할 수 있다. 상기 컴퓨터 서브시스템은 검출 및 분류의 결과를 생성하여 결함을 보고하는 결과 보고서를 생 성하도록 구성될 수 있다. 검출 및 분류의 결과는 검출된 결함의 레이블 정보, 예를 들어 위치, 검출값, 분류 레이블 또는 ID와 같은 결함 분류에 관한 정보 및 업계에서 공지된 임의의 적절한 정보와 임의의 결과를 포함할 수 있다. 검출 및 분류의 결과에 따라 결과 보고서는 임의의 적절한 방식으로 생성될 수 있다. 검출 보고 서는 컴퓨터 표준파일 유형과 같은 임의의 적합한 형태 또는 양식을 가질 수 있다. 컴퓨터 서브 시스템 은 보고서를 생성하고, 표본 또는 동일한 유형의 다른 표본에 대한 하나 이상의 기능을 수행하기 위하여 컴퓨터 서브시스템 또는 여타의 시스템 또는 방법에 의해 보고서의 내용이 사용될 수 있도록 결과 보고서 를 저장할 수 있다. 이러한 기능은 피드백 방식으로 표본에 수행된 제조 공정 또는 단계와 같은 공정을 변 경하고 표본에 대해 수행될 제조 공정 또는 단계화 같은 공정을 피드포워드(Feed Forward)하는 방식을 포함한다. 상기 컴포넌트는 컴퓨터 서브 시스템과 연동되며, 인공신경망을 포함할 수 있다. 상기 인공신경망 (CNN 200)은, 도 1을 참조하면, 분류 인공신경망 및 검출 인공신경망을 포함할 수 있다. 상기 분류 인공신경망은 영상의 특정된 레이블에 기초하여 표본상의 결함을 검출하고 영상의 특정한 레이 블에 기초하여 표본상에서 검출된 결함을 분류하도록 한다. 예를 들어 분류인공신경망은 실시예에서 분류 레이어를 포함할 수 있다. 상기 검출 인공신경망은 영상 서브 시스템에 의해 생성된 표본의 영상특징을 결정하도록 구성될 수 있다. 예를 들어 상기 검출 인공신경망은 영상들의 특징(예를 들어 특징 맵)을 결정하는 컨벌루션 레이어들을 포함하고 이는 적어도 결함 영상, 가능하면 참조 영상 및 디자인을 포함한다. 상기 검출 인공신경망은, 검출 모델, 결함부분의 좌표를 포함할 수 있다. 상기 인공신경망은 딥러닝 네트워크로 구성된다. 일반적으로 \"딥러닝\"(구조가 깊은 학습, 계층적 학습 또는 딥 머신 러닝이라고 알려진)은 데이터의 높은 수준의 추상화를 모델링하려고 시도하는 알고리즘 세트를 기반으로 하는 기계학습의 한 분야이다. 간단한 경우를 예를 들면 두 개의 인공신경망 세트가 있을 수 있는데, 입력신호 를 수신하는 신경망 세트 및 출력신호를 내보내는 신경망 세트이다. 입력층(Layer)은 입력을 수신하고 수정된 입력을 다음 층으로 전달한다. 딥 네트워크에서는 입력과 출력사이에 많은 층이 있으며, 알고리즘이 다수의 선 형 및 비선형 변형으로 구성된 다수의 연산(프로세싱) 층을 사용할 수 있다. 상기 딥러닝은 데이터의 학습 표현을 기반으로 하는 기계학습 방법의 확장된 구성의 일부이다. 표본 영상 은 픽셀당 가중치 값의 벡터와 같은 많은 방식으로 표현될 수 있거나 엣지 및 엣지 영상의 조합, 특정 형상의 영역등 보다 추상적인 방식으로 표현될 수 있다. 일부 표현은 학습 작업을 단순화하는데 다른 표현보다 우수하 다. 딥러닝의 규약중 하나는 수작업으로 만들어진 특징(결함/비결함 영상의 특징 포함)을 비지도 학습 또는 준 지도 학습 및 계층적 특징 추출을 위한 효율적인 알고리즘으로 대체하는 것이다. 실시예에서, 하나 이상의 컴퓨터 서브시스템은 사용자에 의해 할당된 분류 레이블을 인공지능을 학습하는 결함 레이블 영상을 인공신경망에 입력함으로써 신공신경망을 학습하도록 구성될 수 있다. 예를 들어 학습하는 동안 사용자는 결함 영상 레이블별로 결함을 분류할 수 있다. 영상 레벨 레이블 및 결함 영상, 예를 들어 영상들은 분류 CNN을 학습하기 위한 입력으로서 사용된다. 이 경우 영상들은 인공신경망이 학습된 후 의 경우와 같이 결함이 검출되고 분류되는 영상이 아닌 학습용 결함 영상이다. 영상 레벨 레이블은 각각의 학습 결함 영상에 할당될 수 있고, 결함 ID1, 결함ID2쪋. 결함ID N, 패턴 결함등같은 레이블을 포함할 수 있다. 따라 서 영상 레벨 레이블이 각각의 학습 결함 영상 및/또는 각각의 학습 결함 영상내의 각각의 결함에 관련될 수 있 다. 도 3의 실시예는 표본상의 결함을 검출하고 분류하기 위한 컴퓨터 구현 방법을 수행하기 위해 하나이상의 컴퓨 터 시스템상에서 실행 가능한 프로그램 명령어들을 실행 또는 저장하는 일시적/비이리적 컴퓨터 판독기능 매체 에 관한 것이다. 도3과 같이 일시적/비일시적 컴퓨터 판독 가능 매채은 컴퓨터 시스템에서 실행 가능 한 프로그램 명령어들을 포함한다. 이상에서 설명한 것은 본 발명에 따른 검출 및 분류하는 결함 검출 및 분류 장치를 실시하기 위한 하나의 실시 예에 불과한 것으로서, 본 발명은 상기한 실시예에 한정되지 않고, 이하의 청구범위에서 청구하는 바와 같이 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변경 실시가 가능한 범위까지 본 발명의 기술적 정신이 있다고 할 것이다."}
{"patent_id": "10-2020-0094945", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 결함 검출 및 분류 장치의 개략적인 구성도이다. 도 2는 도 1의 결함 검출 및 분류 장치를 구성하는 인공신경망의 흐름도이다. 도 3은 적어도 하나이상의 컴퓨터 시스템에서 컴퓨터로 구현되는 방법을 수행하기 위한 프로그램 명령어들의 일 시적/비일시적 영상 판독 가능 매체의 실시예를 도시한 블록도이다."}
