{"patent_id": "10-2023-0056209", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0159211", "출원번호": "10-2023-0056209", "발명의 명칭": "인공지능 학습 모델을 이용한 가상 얼굴 편집 방법 및 장치", "출원인": "(주)디오비스튜디오", "발명자": "오제욱"}}
{"patent_id": "10-2023-0056209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "현실 장면에서의 실제 인간 얼굴을 인식하여, 가상 장면에서의 상기 실제 인간 얼굴의 제1 가상 얼굴 모델을 획득하는 단계;상기 실제 인간 얼굴에 작용하는 얼굴 핀치 조작에 응답하여, 상기 얼굴 핀치 조작을 인식하여, 상기 제1 가상얼굴 모델 중의 조정할 키포인트 및 상기 조정할 키포인트의 조정 방식을 결정하는 단계; 및상기 조정할 키포인트의 조정 방식에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴모델로 조정하는 단계를 포함하는, 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법."}
{"patent_id": "10-2023-0056209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 얼굴 핀치 조작을 인식하여, 상기 제1 가상 얼굴 모델 중의 상기 조정할 키포인트를 결정하는 단계는,상기 얼굴 핀치 조작을 인식하여, 상기 얼굴 핀치 조작의 작용 대상을 결정하되, 상기 작용 대상은 상기 실제인간 얼굴의 오관, 및 상기 실제 인간 얼굴의 얼굴형 중의 적어도 하나를 포함하는 단계; 및상기 작용 대상에 기반하여 상기 제1 가상 얼굴 모델에 포함된 복수개의 키포인트로부터 상기 조정할 키포인트를 선택하는 단계를 포함하는, 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법."}
{"patent_id": "10-2023-0056209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 얼굴 핀치 조작을 인식하여, 상기 조정할 키포인트의 조정 방식을 결정하는 단계는,상기 얼굴 핀치 조작을 인식하여, 상기 얼굴 핀치 조작으로 인한 작용 대상의 변형을 결정하는 단계; 및상기 작용 대상의 변형에 기반하여 상기 조정할 키포인트의 조정 방식을 결정하는 단계를 포함하는, 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법."}
{"patent_id": "10-2023-0056209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 작용 대상의 변형에 기반하여 상기 조정할 키포인트의 조정 방식을 결정하는 단계는,상기 작용 대상의 변형 방향에 기반하여 상기 조정할 키포인트의 이동 방향을 결정하되, 상기 변형 방향과 상기이동 방향은 거울 대칭인 단계; 및상기 작용 대상의 변형 정도에 기반하여 상기 조정할 키포인트의 이동 거리를 결정하는 단계를 포함하는, 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법."}
{"patent_id": "10-2023-0056209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 조정할 키포인트의 조정 방식에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴 모델로 조정하는 단계는,상기 제1 가상 얼굴 모델에서의 상기 조정할 키포인트의 초기 위치를 획득하는 단계;공개특허 10-2024-0159211-3-상기 초기 위치, 이동 방향 및 이동 거리를 이용하여 상기 조정할 키포인트의 타깃 위치를 결정하는 단계; 및상기 타깃 위치에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴 모델로 조정하는 단계를 포함하는, 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법."}
{"patent_id": "10-2023-0056209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,기 설정 표시 방식에 따라 상기 제1 가상 얼굴 모델에 상기 조정할 키포인트를 표시하는 단계를 더 포함하고,상기 기 설정 표시 방식은 표시 크기, 표시 색상, 표시 밝기, 표시 특수 효과 중 적어도 하나의 파라미터에 의해 결정되는, 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법."}
{"patent_id": "10-2023-0056209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "현실 장면에서의 실제 인간 얼굴을 인식하여, 가상 장면에서의 상기 실제 인간 얼굴의 제1 가상 얼굴 모델을 획득하기 위한 제1 인식 모듈;상기 실제 인간 얼굴에 작용하는 얼굴 핀치 조작에 응답하여, 상기 얼굴 핀치 조작을 인식하여, 상기 제1 가상얼굴 모델 중의 조정할 키포인트 및 상기 조정할 키포인트의 조정 방식을 결정하기 위한 제2 인식 모듈; 및상기 조정할 키포인트의 조정 방식에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴 모델로 조정하기 위한조정 모듈을 포함하는, 인공지능 학습 모델을 이용한 가상 얼굴 편집 장치."}
{"patent_id": "10-2023-0056209", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 학습 모델을 이용한 가상 얼굴 편집 방법 및 장치가 개시된다. 본 발명의 일 실시예에 따른 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법은 현실 장면에서의 실제 인간 얼굴을 인식하여, 가상 장면에서의 상기 실제 인간 얼굴의 제1 가상 얼굴 모델을 획득하는 단계, 상기 실제 인간 얼굴에 작용하는 얼굴 핀치 조작에 응답 하여, 상기 얼굴 핀치 조작을 인식하여, 상기 제1 가상 얼굴 모델 중의 조정할 키포인트 및 상기 조정할 키포인 트의 조정 방식을 결정하는 단계 및 상기 조정할 키포인트의 조정 방식에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴모델로 조정하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0056209", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 학습 모델을 이용한 가상 얼굴 편집 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0056209", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이하에 기술되는 내용은 단순히 본 발명에 따른 일 실시예와 관련되는 배경 정보만을 제공할 뿐 종래기술을 구 성하는 것은 아니다. 인터넷 프로세스의 가속 발전에 따라 이동 단말기의 성능이 빠르게 향상되어 점점 더 많은 애플리케이션의 생성 및 개발을 위한 강력한 기술 지원을 제공한다. 여기서 가상 이미지 소셜 애플리케이션은 인기 있는 커뮤니케이 션 및 엔터테인먼트 방식이 되고 있다. 현재 가상 이미지 소셜 애플리케이션은, 가상 인물 이미지 오관 및 얼굴형을 커스터마이즈 편집할 때, 종종 단 말기 인터페이스에서의 얼굴의 키포인트를 클릭하고, 상하좌우 방향으로 당기는 것을 통해 오관 및 얼굴형의 수 정 및 조정을 완료하는데, 전반 조작 단계가 복잡하고 번거로우므로 사용자의 사용 만족도에 영향을 미친다."}
{"patent_id": "10-2023-0056209", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0056209", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법은 현실 장면에서의 실제 인간 얼굴을 인식하여, 가상 장면에서의 상기 실제 인간 얼굴의 제1 가상 얼굴 모델을 획 득하는 단계, 상기 실제 인간 얼굴에 작용하는 얼굴 핀치 조작에 응답하여, 상기 얼굴 핀치 조작을 인식하여, 상기 제1 가상 얼굴 모델 중의 조정할 키포인트 및 상기 조정할 키포인트의 조정 방식을 결정하는 단계 및 상기 조정할 키포인트의 조정 방식에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴모델로 조정하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0056209", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법을 제공할 수 있다."}
{"patent_id": "10-2023-0056209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 여기서, 반복되는 설명, 본 발명의 요지를 불 필요하게 흐릴 수 있는 공지 기능, 및 구성에 대한 상세한 설명은 생략한다. 본 발명의 실시형태는 당 업계에서 평균적인 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위해서 제공되는 것이다. 따라서, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성 요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하, 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법을 나타낸 동작 흐름도이 다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법은 먼저, 현실 장면에서의 실제 인간 얼굴을 인식하여, 가상 장면에서의 상기 실제 인간 얼굴의 제1 가상 얼굴 모델을 획득할 수 있다(S110). 다음으로, 상기 실제 인간 얼굴에 작용하는 얼굴 핀치 조작에 응답하여, 상기 얼굴 핀치 조작을 인식하여, 상기 제1 가상 얼굴 모델 중의 조정할 키포인트 및 상기 조정할 키포인트의 조정 방식을 결정할 수 있다(S120). 다음으로, 상기 조정할 키포인트의 조정 방식에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴모델로 조정 할 수 있다(S130). 일 실시예에 따르면, 상기 얼굴 핀치 조작을 인식하여, 상기 제1 가상 얼굴 모델 중의 상기 조정할 키포인트를 결정하는 단계는 상기 얼굴 핀치 조작을 인식하여, 상기 얼굴 핀치 조작의 작용 대상을 결정하되, 상기 작용 대 상은 상기 실제 인간 얼굴의 오관, 및 상기 실제 인간 얼굴의 얼굴형 중의 적어도 하나를 포함하는 단계 및 상 기 작용 대상에 기반하여 상기 제1 가상 얼굴 모델에 포함된 복수개의 키포인트로부터 상기 조정할 키포인트를 선택하는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 얼굴 핀치 조작을 인식하여, 상기 조정할 키포인트의 조정 방식을 결정하는 단계는 상기 얼굴 핀치 조작을 인식하여, 상기 얼굴 핀치 조작으로 인한 작용 대상의 변형을 결정하는 단계 및 상기 작 용 대상의 변형에 기반하여 상기 조정할 키포인트의 조정 방식을 결정하는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 작용 대상의 변형에 기반하여 상기 조정할 키포인트의 조정 방식을 결정하는 단계는 상기 작용 대상의 변형 방향에 기반하여 상기 조정할 키포인트의 이동 방향을 결정하되, 상기 변형 방향과 상기 이동 방향은 거울 대칭인 단계 및 상기 작용 대상의 변형 정도에 기반하여 상기 조정할 키포인트의 이동 거리를 결정하는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 조정할 키포인트의 조정 방식에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴 모델로 조정하는 단계는 상기 제1 가상 얼굴 모델에서의 상기 조정할 키포인트의 초기 위치를 획득하는 단계, 상기 초기 위치, 이동 방향 및 이동 거리를 이용하여 상기 조정할 키포인트의 타깃 위치를 결정하는 단계 및 상 기 타깃 위치에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴 모델로 조정하는 단계를 포함할 수 있다. 일 실시예에 따르면, 기 설정 표시 방식에 따라 상기 제1 가상 얼굴 모델에 상기 조정할 키포인트를 표시하는 단계를 더 포함하고, 상기 기 설정 표시 방식은 표시 크기, 표시 색상, 표시 밝기, 표시 특수 효과 중 적어도 하나의 파라미터에 의해 결정될 수 있다.일 실시예에 따르면, 인공지능 학습 모델을 이용한 가상 얼굴 편집 장치는 현실 장면에서의 실제 인간 얼굴을 인식하여, 가상 장면에서의 상기 실제 인간 얼굴의 제1 가상 얼굴 모델을 획득하기 위한 제1 인식 모듈, 상기 실제 인간 얼굴에 작용하는 얼굴 핀치 조작에 응답하여, 상기 얼굴 핀치 조작을 인식하여, 상기 제1 가상 얼굴 모델 중의 조정할 키포인트 및 상기 조정할 키포인트의 조정 방식을 결정하기 위한 제2 인식 모듈 및 상기 조정 할 키포인트의 조정 방식에 기반하여 상기 제1 가상 얼굴 모델을 제2 가상 얼굴 모델로 조정하기 위한 조정 모 듈을 포함할 수 있다. 도 1에 도시된 바와 같이, 컴퓨터 단말기는 판독 전용 메모리(ROM)에 저장된 컴퓨터 프로그램 또는 저장 유닛으로부터 랜덤 액세스 메모리(RAM)에 로딩된 컴퓨터 프로그램에 따라 각 적절한 동작 및 처 리를 수행할 수 있는 컴퓨팅 유닛을 포함한다. RAM에서, 컴퓨터 단말기의 조작에 필요한 다양한 프로그램과 데이터를 더 저장할 수 있다. 컴퓨팅 유닛, ROM 및 RAM은 버스를 통해 서로 연 결된다. 입력/출력(I/O) 인터페이스도 버스에 연결된다. 키보드, 마우스 등과 같은 입력 유닛; 다양한 유형의 디스플레이, 스피커 등과 같은 출력 유닛; 자기 디스크, 광 디스크 등과 같은 저장 유닛; 및 네트워크 카드, 모뎀, 무선 통신 트랜시버 등과 같은 통신 유 닛을 포함하는 컴퓨터 단말기의 복수의 부재는 I/O 인터페이스에 연결된다. 통신 유닛은 컴퓨터 단말기가 인터넷과 같은 컴퓨터 네트워크 및/또는 다양한 통신 네트워크를 통해 다른 기기와 정보/ 데이터를 교환하도록 허용한다. 컴퓨팅 유닛은 처리 및 컴퓨팅 기능을 갖는 다양한 범용 및/또는 전용 처리 컴포넌트일 수 있다. 컴퓨팅 유닛의 일부 예시는 중앙 처리 유닛(CPU), 그래픽 처리 유닛(GPU), 다양한 전용 인공지능(AI) 컴퓨팅 칩, 기계 학습 모델 알고리즘을 실행하는 다양한 컴퓨팅 유닛, 디지털 신호 프로세서(DSP), 및 임의의 적절한 프로 세서, 컨트롤러, 마이크로 컨트롤러 등을 포함하지만 이에 제한되는 것은 아니다. 컴퓨팅 유닛은 본문에 설명된 가상 얼굴 모델의 조정 방법을 구현한다. 예를 들어, 일부 실시예에서, 가상 얼굴 모델의 조정 방법은 저장 유닛과 같은 기계 판독 가능 매체에 유형적으로 포함되는 컴퓨터 소프트웨어 프로그램으로 구현될 수 있다. 일부 실시예에서, 컴퓨터 프로그램의 일부 또는 전부는 ROM 및/또는 통신 유닛을 통해 컴퓨터 단말기에 로딩 및/또는 설치될 수 있다. 컴퓨터 프로그램이 RAM에 로딩되어 컴퓨팅 유닛에 의해 실행될 경우, 본문에 설명된 가상 얼굴 모델의 조정 방법의 하나 이상의 단계를 수행할 수 있다. 대안적으로, 다른 실시예에서, 컴퓨팅 유닛은 다른 임의의 적절한 방식을 통해(예를 들어, 펌웨어에 의해) 가상 얼굴 모델의 조정 방법을 구현하도록 구성될 수 있다. 본문에 설명된 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 필드 프로그 래머블 어레이(FPGA), 전용 집적 회로(ASIC), 전용 표준 제품(ASSP), 시스텝 온 칩(SOC), 복합 프로그램 가능 논리 소자(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다 양한 실시형태는, 하나 이상의 컴퓨터 프로그램에서 구현되는 것을 포함할 수 있고, 상기 하나 이상의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템에서 실행 및/또는 해석될 수 있으며, 상기 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가능 프로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치, 및 적어도 하나의 출력 장치로부터 데이터와 명령을 수신하며, 데이터와 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치, 및 상기 적어도 하나의 출력 장치로 전송할 수 있다. 여기서 설명해야 할 것은, 일부 바람직한 실시예에서, 도 1에 도시된 상기 전자 장치는 하드웨어 소자(회로를 포함함), 소프트웨어 소자(컴퓨터 판독 가능 매체에 저장된 컴퓨터 코드를 포함함), 또는 하드웨어 소자 및 소 프트웨어 소자의 조합을 포함할 수 있다. 도 1은 특정 구체적인 구현예의 하나의 구현예일 뿐이며, 상기 전자 기기에 존재할 수 있는 부재의 유형을 예시하기 위한 것이다. 상술한 실행 환경에서, 본 발명은 도 2에 도시된 가상 얼굴 모델의 조정 방법을 제공하고, 상기 방법은 도 1에 도시된 컴퓨터 단말기 또는 유사한 전자 기기에 의해 구현될 수 있다. 도 2는 본 발명의 실시예에 따라 제공되 는 가상 얼굴 모델의 조정 방법의 흐름도이다. 도 2에 도시된 바와 같이, 상기 방법은 다음과 같은 단계를 포함 한다. 단계 S21에서, 현실 장면에서의 실제 인간 얼굴을 인식하여, 가상 장면에서의 실제 인간 얼굴의 제1 가상 얼굴 모델을 획득한다. 상기 현실 장면은 사용자가 현재 위치한 실제 장면일 수 있다. 상기 가상 장면은 가상 이미지 애플리케이션 중의 장면일 수 있고, 애플리케이션 기본 크드에 의해 사전 설정될 수 있다. 바람직하게는, 사용자의 장면 선택 조작에 응답하여 가상 장면 전환을 수행하고, 예를 들어, 기설정된 가상 장 면은 해변 장면, 설산 장면, 사막 장면 및 도시 장면을 포함할 수 있으며, 사용자는 그래픽 사용자 인터페이스 에서의 장면 전환 컨트롤을 클릭하여 가상 장면 전환을 수행할 수 있고, 예를 들어 현재 가상 장면이 해변 장면 이고, 전환할 장면이 설산 장면이면, 설산 장면에 대응되는 장면 전환 컨트롤을 클릭하여 해변 장면을 설산 장 면으로 전환할 수 있다. 상기 제1 가상 얼굴 모델은 실제 인간 얼굴에 대응되는 얼굴 모델이고, 제1 가상 얼굴 모델은 2차원 모델 또는 3차원 모델일 수 있다. 구체적으로, 현실 장면에서의 실제 인간 얼굴을 인식하여, 가상 장면에서의 실제 인간 얼굴의 제1 가상 얼굴 모 델을 획득하는 구현 프로세스는 기존의 임의의 인간 얼굴 인식 모델링 해결 수단을 참조할 수 있고, 반복하여 설명하지 않는다. 단계 S22에서, 실제 인간 얼굴에 작용하는 얼굴 핀치 조작에 응답하여, 얼굴 핀치 조작을 인식하여, 제1 가상 얼굴 모델 중의 조정할 키포인트 및 조정할 키포인트의 조정 방식을 결정한다. 상기 실제 인간 얼굴에 작용하는 얼굴 핀치 조작은 실제 인간 얼굴의 키포인트에 대응되는 변형이 발생하도록 하여, 실제 인간 얼굴에 대응되는 제1 가상 얼굴 모델 중의 조정할 키포인트가 상응하게 변경될 수 있다. 바람직하게는, 얼굴 핀치 조작을 인식하는 것은 사용자의 얼굴 핀치 제스처를 인식하는 것 및 사용자의 실제 인 간 얼굴을 인식하는 것을 포함한다. 구체적으로, 얼굴 핀치 제스처가 실제 인간 얼굴에 작용하는 위치를 인식하 는 것을 통해 실제 인간 얼굴의 변형의 키포인트 및 이러한 키포인트에 대한 조정 방법을 결정하고, 실제 인간 얼굴을 추가로 인식하여 제1 가상 얼굴 모델 중의 조정할 키포인트 및 조정할 키포인트의 조정 방식을 결정한다. 구체적으로, 실제 인간 얼굴에 작용하는 얼굴 핀치 조작에 응답하여, 얼굴 핀치 조작을 인식하여, 제1 가상 얼 굴 모델 중의 조정할 키포인트 및 조정할 키포인트의 조정 방식을 결정하는 구현 프로세스는 본 발명의 실시예 에 대한 추가 소개를 참조할 수 있다. 단계 S23에서, 조정할 키포인트의 조정 방식에 기반하여 제1 가상 얼굴 모델을 제2 가상 얼굴 모델로 조정한다. 상기 제2 가상 얼굴 모델은 가상 장면 중 조정된 후의 가상 얼굴 모델로서, 사용자의 요구사항에 더 부합된다. 구체적으로, 조정할 키포인트의 조정 방식에 기반하여 제1 가상 얼굴 모델을 제2 가상 얼굴 모델로 조정하는 구 현 프로세스는 본 발명의 실시예에 대한 추가 소개를 참조할 수 있다. 본 발명의 상기 단계 S21 내지 단계 S23에 따르면, 현실 장면에서의 실제 인간 얼굴을 인식하여, 가상 장면에서 의 실제 인간 얼굴의 제1 가상 얼굴 모델을 획득하고; 실제 인간 얼굴에 작용하는 얼굴 핀치 조작에 응답하여, 얼굴 핀치 조작을 인식하여, 제1 가상 얼굴 모델 중의 조정할 키포인트 및 조정할 키포인트의 조정 방식을 결정 하며; 조정할 키포인트의 조정 방식에 기반하여 제1 가상 얼굴 모델을 제2 가상 얼굴 모델로 조정하는 것을 통 해, 가상 이미지를 지능적으로 조정하는 목적을 달성하고, 가상 이미지를 조정하는 조작 단계를 단순화하며, 사 용자 경험 효과를 향상시킴으로써, 종래의 해결 수단에서 가상 이미지를 조정하는 조작 단계가 번거롭고, 사용 만족도가 좋지 않은 기술적 과제를 해결한다. 본 발명에서 설명하는 특정 실행들은 일 실시예들로서, 어떠한 방법으로도 본 발명의 범위를 한정하는 것은 아 니다. 명세서의 간결함을 위하여, 종래 전자적인 구성들, 제어 시스템들, 소프트웨어, 상기 시스템들의 다른 기 능적인 측면들의 기재는 생략될 수 있다. 또한, 도면에 도시된 구성 요소들 간의 선들의 연결 또는 연결 부재들 은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것으로서, 실제 장치에서는 대체 가 능하거나 추가의 다양한 기능적인 연결, 물리적인 연결, 또는 회로 연결들로서 나타내어질 수 있다. 또한, \"필 수적인\", \"중요하게\" 등과 같이 구체적인 언급이 없다면 본 발명의 적용을 위하여 반드시 필요한 구성 요소가 아닐 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다.도면 도면1"}
{"patent_id": "10-2023-0056209", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 학습 모델을 이용한 가상 얼굴 편집 방법을 나타낸 동작 흐름도이 다."}
