{"patent_id": "10-2023-0106558", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0025559", "출원번호": "10-2023-0106558", "발명의 명칭": "인공지능 모델을 이용한 아르바이트 경력 기반 인재성 지표 제공 방법 및 장치", "출원인": "조용준", "발명자": "조용준"}}
{"patent_id": "10-2023-0106558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자장치가 인공지능 모델을 이용하여 아르바이트 경력 기반 인재성 지표 제공 방법에 있어서, 상기 방법은,사용자-입력 아르바이트 데이터를 획득하는 단계;사용자-평가 아르바이터 데이터를 획득하는 단계;직무 데이터를 획득하는 단계; 및인재성 지표를 출력하는 단계; 를 포함하는 방법."}
{"patent_id": "10-2023-0106558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,인재성 지표를 출력하는 단계는 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터가 입력되면 입력된 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터에 따른인재성 지표를 출력하는 인재성 지표 예측 인공지능 모델에, 상기 사용자-입력 아르바이트 데이터, 상기 사용자-평가 아르바이터 데이터, 및 상기 직무 데이터를 입력함으로써, 상기 인재성 지표 예측 인공지능 모델로부터인재성 지표를 출력하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0106558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 사용자-평가 아르바이터 데이터를 획득하는 단계는, 상기 사용자-평가 아르바이터 데이터가 주관형 평가데이터를 포함하는 경우,상기 주관형 평가 데이터로부터 키워드를 추출하는 단계; 상기 키워드를 인재성 지표 평가와 연관된 미리 결정된 평가요소와 매칭시키는 단계; 및매칭 결과에 기초하여 사용자-평가 아르바이터 데이터를 출력하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0106558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 제 1 인공지능 모델은 상기 사용자-입력 아르바이트 데이터와 상기 사용자-평가 아르바이터 데이터를 비교하여, 상기 사용자-입력 아르바이트 데이터와 상기 사용자-평가 아르바이터 데이터의 차이 정도에 따라 상기 인재성 지표 중 상기 근면성실 지표 및 상기 책임감 지표에 감산치를 적용하여 출력하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2023-0106558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,사용자 속성 데이터를 획득하는 단계; 및사용자 속성 데이터 및 인재성 지표가 입력되면 사용자에게 적합한 직군을 출력하는 직군 추천 인공지능 모델에제 1 상기 인재성 지표 및 상기 사용자 속성 데이터를 입력함으로써, 상기 직군 추천 인공지능 모델로부터 후보사용자 추천 직군들을 출력하는 단계; 를 더 포함하는, 방법."}
{"patent_id": "10-2023-0106558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "인공지능 모델을 이용하여 아르바이트 경력 기반 직무 평가 및 직군 추천을 제공하기 위한 전자장치에 있어서,공개특허 10-2025-0025559-3-하나 이상의 인스트럭션을 저장하는 메모리; 및상기 하나 이상의 인스트럭션을 실행하는 적어도 하나의 프로세서를 포함하고,상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써,사용자-입력 아르바이트 데이터를 획득하고;사용자-평가 아르바이터 데이터를 획득하고;직무 데이터를 획득하고; 그리고인재성 지표를 출력하는, 전자장치."}
{"patent_id": "10-2023-0106558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 인재성 지표를 출력함에 있어서, 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터가 입력되면 입력된 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터에 따른 인재성 지표를 출력하는 인재성지표 예측 인공지능 모델에 상기 사용자-입력 아르바이트 데이터, 상기 사용자-평가 아르바이터 데이터, 및 상기 직무 데이터를 입력함으로써, 상기 인재성 지표 예측 인공지능 모델로부터 인재성 지표를 출력하는, 전자장치."}
{"patent_id": "10-2023-0106558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 사용자-평가 아르바이터 데이터를 획득함에 있어서, 상기 사용자-평가 아르바이터 데이터가 주관형 평가 데이터를 포함하는 경우,상기 주관형 평가 데이터로부터 키워드를 추출하고;상기 키워드를 인재성 지표 평가와 연관된 미리 결정된 평가요소와 매칭시키고; 그리고매칭 결과에 기초하여 사용자-평가 아르바이터 데이터를 출력하는, 전자장치."}
{"patent_id": "10-2023-0106558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7 항에 있어서,상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써,사용자 속성 데이터를 획득하고; 그리고사용자 속성 데이터 및 인재성 지표가 입력되면 사용자에게 적합한 직군을 출력하는 직군 추천 인공지능 모델에상기 인재성 지표 및 상기 획득한 사용자 속성 데이터를 입력함으로써, 상기 직군 추천 인공지능 모델로부터 후보 사용자 추천 직군들을 출력하는, 전자장치."}
{"patent_id": "10-2023-0106558", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 모델을 이용하여 아르바이트 경력을 기반으로 인재성 지표를 제공하는 방법을 개시한다. 상 기 방법은, 사용자-입력 아르바이트 데이터를 획득하는 단계; 사용자-평가 아르바이터 데이터를 획득하는 단계; 직무 데이터를 획득하는 단계; 및 인재성 지표를 출력하는 단계; 를 포함할 수 있다."}
{"patent_id": "10-2023-0106558", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 모델을 이용하여, 아르바이트 경력을 기반으로 인재성 지표를 제공하는 및 장치에 관한 것 이다."}
{"patent_id": "10-2023-0106558", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "2022년 311만명의 대학생 중 90%는 아르바이트에 대한 경험을 보유하고 있으며, 실제 취업 현장에 있는 26세 내 지 35세의 취업준비생의 아르바이트 경험은 96%에 달한다고 한다. 그러나, 경험한 아르바이트가 희망 직종과 연계성을 가지고 있다고 하더라도, 실제 취업 과정에서는 인증서를 보유한 아르바이트나 협회·기관에서의 아르바이트 경력 등 수행 여부의 입증이 가능한 아르바이트 경력만이 인 정이되며, 기타 아르바이트의 경우 수행 여부를 입증해 줄 정부 기관 및 기업이 존재하지 않아 아르바이트 수행여부를 증명하기 힘든 실정이다. 또한, 채용 과정 중 제출하는 자기소개서나 면접 등에서 언급하는 아르바이트 경험 또는 경력은 그 사실 여하의 판별이 어려운 관계로 채용담당자 또는 인사 담당 기관은 이의 신뢰성에 의문을 품는 경우가 많다. 이에, 구직 자의 아르바이트 경험 또는 경력은 취업에 실질적으로 활용하기 어려운 실정이다. 이에 따라, 아르바이트 경력이 경력자의 인재성 지표로 활용되어 실제 취업 등에 활용 또는 도움이 될 수 있는 방법이 필요하다. 선행기술문헌 한국공개특허 10-2021-0059674 한국공개특허 10-2022-0095482"}
{"patent_id": "10-2023-0106558", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해결하기 위하여, 본 발명은 아르바이트 경력과 특정 직무를 입력하면 아르바이트 경력과 특정 직무와의 직무 수행 능력의 연계성을 나타낼 수 있는 인재성 지표를 도출할 수 있는 인공지능 모델을 제공하고 자 한다. 구체적으로, 인재성 지표를 도출할 때 아르바이트 업무의 고용주의 아르바이트 수행자에 대한 평가를 반영하며, 이 때 고용주의 객관적인 평가 뿐만 아니라 주관적인 평가 또한 고려하여, 도출된 인재성 지표의 객관성 및 사 실성을 보완하고자 한다. 나아가, 도출된 인재성 지표와 개인의 속성 데이터를 고려하여 직무를 추천함으로써, 각 개인의 실질적인 환경 에 더욱 적합한 직군을 탐색하는 기회를 제공하고자 한다."}
{"patent_id": "10-2023-0106558", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 바와 같은 과제를 해결하기 위하여, 본 개시의 일 실시예에 따르면, 전자장치가 인공지능 모델을 이용하 여 아르바이트 경력 기반 인재성 지표를 제공하는 방법이 제공될 수 있다. 상기 방법은 사용자-입력 아르바이트 데이터를 획득하는 단계; 사용자-평가 아르바이터 데이터를 획득하는 단계; 직무 데이터를 획득하는 단계; 및 인재성 지표를 출력하는 단계를 포함할 수 있다. 본 개시의 일 특징에 따르면, 인재성 지표를 출력는 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터 및 직무 데이터가 입력되면 입력된 사용자 아르바이트 데이터 및 직무 데이터에 따른 인재성 지표를 출 력하는 인재성 지표 예측 인공지능 모델에 획득한 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데 이터 및 직무 데이터를 입력함으로써, 인재성 지표 예측 인공지능 모델로부터 인재성 지표를 출력하는 단계; 를 포함할 수 있다. 본 개시의 일 특징에 따르면, 인재성 지표는 열정, 근면성실, 리더십, 책임감, 팀워크, 및 창의성 지표를 포함 한다. 본 개시의 일 특징에 따르면, 사용자-평가 아르바이터 데이터를 획득하는 단계는, 사용자-평가 아르바이터 데이 터가 주관형 평가 데이터를 포함하는 경우, 상기 주관형 평가 데이터로부터 키워드를 추출하는 단계; 키워드를 인재성 지표 가와 연관된 미리 결정된 평가요소와 매칭시키는 단계; 및 매칭 결과에 기초하여 사용자-평가 아르 바이터 데이터를 출력하는 단계; 를 포함한다. 본 개시의 일 특징에 따르면, 제 1 인공지능 모델은 사용자-입력 아르바이트 데이터와 사용자-평가 아르바이터 데이터를 비교하여, 사용자-입력 아르바이트 데이터와 사용자-평가 아르바이터 데이터의 차이 정도에 따라 인재 성 지표 중 근면성실 지표 및 책임감 지표에 감산치를 적용하여 출력하는 것을 특징으로 한다. 본 개시의 일 특징에 따르면, 상기 방법은 사용자 속성 데이터를 획득하는 단계; 및 사용자 속성 데이터 및 인 재성 지표가 입력되면 사용자에게 적합한 직군을 출력하는 직군 추천 인공지능 모델에 출력된 인재성 지표 및 획득한 사용자 속성 데이터를 입력함으로써, 상기 직군 추천 인공지능 모델로부터 후보 사용자 추천 직군을 출 력하는 단계를 더 포함할 수 있다본 개시의 일 특징에 따르면, 사용자 속성 데이터는 제 1 아르바이터 데이터 및 제 2 아르바이트 데이터와 상이 한 데이터만을 포함할 수 있다. 전술한 바와 같은 과제를 해결하기 위하여 본 개시의 다른 실시예에 따르면, 인공지능 모델을 이용하여 아르바 이트 경력 기반 직무 평가 및 직군 추천을 제공하기 위한 전자장치가 제공될 수 있다. 상기 전자장치는 하나 이 상의 인스트럭션을 저장하는 메모리; 및 하나 이상의 인스트럭션을 실행하는 적어도 하나의 프로세서를 포함하 고, 상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 사용자-입력 아르바이트 데이터를 획득하고, 사용자-평가 아르바이터 데이터를 획득하고, 직무 데이터를 획득하고, 그리고 인재성 지표를 출력할 수 있다. 본 개시의 일 특징에 따르면, 상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 인재성 지표를 출 력함에 있어서, 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터 및 직무 데이터가 입력되면 입 력된 사용자 아르바이트 데이터 및 직무 데이터에 따른 인재성 지표를 출력하는 인재성 지표 예측 인공지능 모 델에 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터 및 직무 데이터를 입력함으로써, 인재성 지표 예측 인공지능 모델로부터 인재성 지표를 출력할 수 있다. 본 개시의 일 특징에 따르면, 상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 사용자-평가 아르바이터 데이터를 획득함에 있어서, 상기 사용자-평가 아르바이터 데이터가 주관형 평가 데이터를 포함하는 경우, 상기 주관형 평가 데이터로부터 키워드를 추출하고; 상기 키워드를 인재성 지표 평가와 연관된 미리 결정 된 평가요소와 매칭시키고; 그리고 매칭 결과에 기초하여 사용자-평가 아르바이터 데이터를 출력할 수 있다. 본 개시의 일 특징에 따르면, 상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 사용자 속성 데이 터를 획득하고, 사용자 속성 데이터 및 인재성 지표가 입력되면 사용자에게 적합한 직군을 출력하는 직군 추천 인공지능 모델에 출력된 인재성 지표 및 사용자 속성 데이터를 입력함으로써, 직군 추천 인공지능 모델로부터 후보 사용자 추천 직군을 출력할 수 있다."}
{"patent_id": "10-2023-0106558", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 인재성 지표는 단순히 구직자의 아르바이트 경력만을 토대로 도출한 것이 아닌 구직자의 아르바이트 능력을 평가한 고용주들의 평가자료를 추가하여 도출되기에, 아르바이트생의 실질적인 역량을 기반으로 한 보다 객관적인 인재 검증 역량 지표로의 활용이 가능하다. 또한, 인재성 지표를 제공하는 데에 그치지 않고, 개개인의 속성 데이터와 인재성 지표를 함께 고려한 사용자 맞춤 분석 결과를 제공하여, 구직자로 하여금 취업 실패의 위험도와 투자 시간 등을 낮출 수 있도록 돕고, 기업 에게는 필요한 인재를 매칭하여 구인이 용이하게 함으로써, 구인구직률의 개선을 기대할 수 있다."}
{"patent_id": "10-2023-0106558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 및 청구범위에서 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정되어서는 안되며, 발명자 는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입 각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인 공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만 들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로 써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미 한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버 및/ 또는 시스템을 통해 이루어질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도 형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 노드들과 가중치들(weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스 트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 또한, 손실값 또는 코스트 값을 최 소화하기 위해, 손실값 또는 코스트값과 관련된 그래디언트를 최소화하는 방향으로 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 본 발명에 있어서, 전자장치는 다양한 형태로 구현될 수 있다. 일 실시예에 따른 전자장치는 다양한 형태 로 구현될 수 있다. 예를 들어, 본 명세서에서 기술되는 전자장치는 모바일 단말, 스마트 폰(smart phone), 노 트북 컴퓨터(laptop computer), 태블릿 PC, 전자북 단말기, 디지털방송용 단말기, PDA(Personal Digital Assistants) 등일 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에 따르면, 전자장치는 인재성 지표 예측 인공지능 모델 및 직군 추천 인공지능 모델 을 포함할 수 있다. 이하, 본 발명의 바람직한 실시예와 첨부도면을 참조하여 본 발명의 구성에 대하여 상세히 설명하기로 한다. 도 1은 일 실시예에 따라 인공지능 모델 기반으로 아르바이트 데이터 및 직무 데이터로부터 인재성 지표를 출력 하는 과정을 나타내는 도면이다. 도 1을 참조하면 인재성 지표는, 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데 이터가 입력되면, 입력된 사용자-입력 아르바이트 데이터, 제 2 아르바이트 데이터, 및 직무 데이터에 따른 인 재성 지표를 출력하는 인재성 지표 예측 인공지능 모델에 획득된 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터를 입력함으로써, 인재성 지표 예측 인공지능 모델로부터 출력할 수 있다. 본 명세서에 있어서, 인재성이라는 용어는 특정 직무에 대해 해당 직무를 수행할 수 있는 능력 정도를 의미하며, 인재성 지표란 인재성을 평가하기 위해 계산된 지표를 의미할 수 있다.상기 인재성 지표는 구직자에게는 아르바이트 경력이 어떠한 직무 역량으로 인정될 수 있는지 또는 해당 아르바 이트 경력이 어느 직무군에 보다 적합하거나 높은 가중치를 가지고 인정될 수 있는지를 확인하기 위한 지표로 활용될 수 있다. 상기 인재성 지표는 구인자에게는 구인 직무분야에 따라 해당 분야에 보다 적합한 인재를 확인 또는 검색하기 위한 지표로 활용될 수 있다. 일 실시예에 있어서, 인재성 지표는, 기업 인재 평가 데이터베이스를 종합하여 구인시 가장 많이 고려되는 인재 요소를 분석하여 선별한 지표로서, 열정, 근면성실, 리더십, 책임감, 팀워크, 및 창의성에 대한 6가지 핵심 지 표를 포함할 수 있다. 상기 인재성 지표는 다양한 방법으로 그 정도가 표현될 수 있으며, 그 정도를 표현하기 위하여 각 지표는 소정의 상한 및 하한 값을 가지면서, 막대형, 방사형, 꺾은선형 및 원형 등 다양한 표현 형태 로 출력될 수 있다. 본 개시에서, 열정 지표라는 용어는 아르바이트 데이터 및 직무 데이터에 기초하여, 해당 직무에 대해서 얼마나 집중력과 애정을 가지고 열중할 수 있을지를 예측 또는 분석하기 위한 지표이다. 본 개시에서, 근면성실 지표라는 용어는 아르바이트 데이터 및 직무 데이터에 기초하여, 해당 직무를 임할 때 성실한 근무 태도를 가질 수 있을지를 예측 또는 분석하기 위한 지표이다. 본 개시에서, 리더십 지표라는 용어는 아르바이트 데이터 및 직무 데이터에 기초하여, 해당 직무를 수행 시 구 성원간의 화합과 단결을 이끌어내어 구성원을 이끌어나갈 수 있는 자질이 있을지를 예측 또는 분석하기 위한 지 표이다. 본 개시에서, 책임감 지표라는 용어는 아르바이트 데이터 및 직무 데이터에 기초하여, 해당 직무에서 주어진 업 무나 지시 사항을 정확하게 수행할지를 예측 또는 분석하기 위한 지표이다. 본 개시에서, 팀워크 지표라는 용어는 아르바이트 데이터 및 직무 데이터에 기초하여, 해당 직무에서 팀워크가 필요한 경우, 즉 2 이상의 사람이 목표 달성을 위하여 협력해야 할 경우, 타 구성원과 얼마나 원활하게 협력할 수 있을지를 예측 또는 분석하기 위한 지표이다. 본 개시에서, 창의성 지표라는 용어는 아르바이트 데이터 및 직무 데이터에 기초하여, 해당 직무에 창의성이 요 구되는 경우에, 기존과 다른 방식으로 새로운 사물, 아이디어, 결과물 등을 업무적으로 만들어낼 수 있을지를 예측 또는 분석하기 위한 지표이다. 도 2는 일 실시예에 따라 전자장치가 인재성 지표 예측 인공지능 모델을 기반으로 인재성 지표를 출력하는 방법 을 나타내는 흐름도이다. 도 2의 단계 S210을 참조하면, 전자장치는 사용자-입력 아르바이트 데이터를 획득할 수 있다. 본 개시에서, 사용자-입력 아르바이트 데이터라는 용어는 아르바이트 경력을 가지는 사용자(제 1 사용자)로부터 획득된 아르바이트 경력에 관련된 데이터를 의미한다. 사용자-입력 아르바이트 데이터에 포함된 아르바이트 정 보는 2건 이상의 정보일 수 있다. 사용자-입력 아르바이트 데이터는 제 1 사용자의 전자장치 또는 제 1 사용자 의 전자장치와 연결된 서버로부터 획득될 수 있다. 일 실시예에 있어서, 제 1 사용자의 아르바이트 데이터는 아 르바이트 각 건에 대한 사용자의 업무 종류, 근로 시간(주당 근로 시간, 월간 근로 시간 등), 근로 업종, 근로 매장, 근로 장소, 성별, ID, 입증서류 등에 관련된 데이터를 포함할 수 있으며, 이에 한정되지 않는다. 도 2의 단계 S220을 참조하면, 전자장치는 사용자-평가 아르바이터 데이터를 획득할 수 있다. 본 개시에서, 사용자-평가 아르바이터 데이터라는 용어는, 사용자-입력 아르바이트 데이터에 대응하여, 제 1 사 용자의 아르바이트 고용주(제 2 사용자)가 피고용자인 제 1 사용자에 대해 평가한 정보를 포함하는 평가에 관련 된 데이터로, 해당 고용주로부터 획득될 수 있다. 사용자-입력 아르바이트 데이터가 포함하는 아르바이터 건이 2건 이상일 경우, 사용자-입력 아르바이트 데이터가 포함하는 각 아르바이트 건의 각각의 고용주로부터 사용자- 평가 아르바이터 데이터가 획득될 수 있다. 일 실시예에 따르면, 상기 사용자-평가 아르바이터 데이터는 객관형 평가 데이터 및 주관형 평가 데이터 중 적 어도 하나를 포함할 수 있다. 객관형 평가 데이터 및 주관형 평가 데이터는 텍스트, 이미지 등을 포함할 수 있 으며, 이에 한정되지 않는다. 객관형 평가 데이터라는 용어는 고용주 모두에게 공통으로 제공되는 서식에 의해 수집된 피고용주의 직무 또는 근무의 평가에 대한 데이터로, 고용주 모두가 공통된 질의 내용을 읽고 질의 내용에 대한 답변에 있어서 정도를 나타내는 항목에 선택적으로 체크하는 방식으로 수집된 평가에 대한 데이터를 의미할 수 있다. 예를 들어, 객관형 평가는 '시간 약속을 잘 지키는가?'라는 질문에 '상/중/하' 중 하나의 항목을 체크하는 방식일 수 있으며, 이에 한정되지 않는다. 일 실시예에 있어서, 객관형 평가의 항목은 열정, 근면성실, 리더십, 책임감, 팀워크, 및 창의성을 평가하기에 적합한 적어도 하나의 질문으로 구성될 수 있다. 반면, 주관적 평가 데이터라는 용어는 고용주가 직접 서술하여 피고용주의 직무 또는 근무의 평가에 대한 데이 터를 의미한다. 객관형 평가만을 통해서는 아르바이트 데이터로부터 보다 정확하게 인재성 지표를 도출하기 어 려운 한계가 있기 때문에, 이를 보완하기 위해서 주관적 평가가 활용될 수 있다. 본 발명에 따르면, 인재성 지표의 도출에 피고용자로부터 수집된 정보 뿐만 아니라 고용자로부터 수집된 평가 정보가 교차적으로 모두 반영될 수 있어, 도출된 인재성 지표는 실제 기업 인재 평가 또는 구직자 개인의 자기 평가에 있어서 보다 객관적인 지표로서 활용될 수 있다. 도 2의 단계 S230을 참조하면, 전자장치는 직무데이터를 획득할 수 있다. 본 개시에서, 직무 데이터라는 용어는 기 저장된 직무 분류표 상의 직군들 중에서 선택된 1 이상의 직군에 대한 데이터를 의미한다. 직무 분류표란 동일한 기초능력이나 적성을 요하는 직무를 하나의 무리로 묶어서 이를 직군 으로 분류한 분류표이다. 상기 직무 분류표는 NCS 국가직무능력표준 등 다양한 형태의 분류표가 사용될 수 있으 나, 이에 한정되지 않는다. 일 실시예에 있어서, 직무 데이터는 유사 직무를 하나의 소분류 직업군으로 엮은 직업군 중에 선택된 1 이상의 소분류 직무 데이터일 수 있다. 예를 들어, 서빙, 주방장, 조리사, 주방보조, 바리스타 등은 '외식·음료' 군으 로 묶일 수 있고, 경영지원, 사무담당자, 총무, 사무보조 등은 '법무·사무·총무' 군으로 묶일 수 있다. 사용 자가 자신의 아르바이트 경험이 주방장 직무에 대한 인재성 지표가 궁금하다면, '외식·음료' 군을 직무 데이터 에 포함하여 인재성 지표를 출력할 수 있다. 본 발명에 따르면, 전자장치는 인재성 지표를 도출하기 위해 직무 데이터를 활용함으로써, 특정 아르바이 트 경력이 해당 선택 직무 또는 직업군에 어느 정도 적합한 경력으로 작용할 수 있는지를 고려하여, 특정 직무 또는 직업군에 대한 보다 정교한 인재성 지표를 출력할 수 있다. 도 2를 참조하면, 단계 S240에서는 전자장치는 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터가 입력되면 입력된 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터에 따른 인재성 지표를 출력하는 인재성 지표 예측 인공지능 모델에 상기 사용자-입력 아 르바이트 데이터, 상기 사용자-평가 아르바이터 데이터, 및 상기 직무 데이터를 입력함으로써, 인재성 지표 예 측 인공지능 모델로부터 인재성 지표를 출력할 수 있다. 일 실시예에 따르면, 상기 출력된 인재성 지표는 사용자의 인재성 지표값(a1) 및 직무 데이터를 기초로 도출된 인재성 지표값(a2)을 포함할 수 있고,, 추가적으로 사용자의 인재성 지표값이 해당 직무상 요하는 인재성 지표 값에 얼마나 부합하는지 그 정도를 알려주는 직군적합도(a3)를 더 포함할 수 있다. 본 개시에서, 사용자의 인재성 지표값(a1)이라는 용어는 사용자-입력 아르바이트 데이터 및 사용자-평가 아르바 이터 데이터만을 고려하여 도출된 사용자의 인재성 지표를 의미하며, 사용자는 인재성 지표값(a1)을 통해 아르 바이트 경력 또는 아르바이트 경력의 평가로부터 어느 정도의 인재성을 객관적으로 평가받을 수 있는지를 확인 할 수 있다. 본 개시에서, 인재성 지표값(a2)이라는 용어는 특정 직무 또는 직군의 종사자에게 통상적으로 기대되거나 특정 직무 또는 직군의 종사자가 갖는 인재성 지표의 통계치를 의미할 수 있다. 예를 들어, 인재성 지표값(a2)은 특 정 직무 또는 직군의 종사자들의 인재성 지표의 평균값일 수 있다. 이때, 인재성 지표값(a2)는 해당 종사자들로 부터 수집된 인재성 지표로부터 계산되거나 해당 직무 또는 직군에서 구직에 성공한 사람들로부터 수집된 인재 성 지표로부터 계산될 수 있다. 본 개시에서, 직군적합도(a3)라는 용어는 사용자의 인재성 지표가 사용자가 선택한 직무에 대해서 어느 정도 부 합하는지를 나타내기 위한 상대적 지표를 의미할 수 있다. 예를 들어, 직군적합도(a3)는 인재성 지표를 구성하 는 다양한 지표들에 대하여 각각 a1/a2*100의 계산식으로 계산을 한 후 이를 평균내어 도출할 수 있다. 예를 들 어, 인재성 지표값(a1)이 '열정, 근면성실, 리더십, 책임감, 팀워크, 및 창의성'이고, 인재성 지표값(a2)이 '열정, 근면성실, 리더십, 책임감, 팀워크, 및 창 의성'인 경우, 직군적합도(a3)는 (25/40+35/50+45/60+55/70+65/80+75/90)*100/6으로 계산될 수 있다. 일 실시예에 따르면, 상기 인재성 지표 예측 인공지능 모델은 사용자-평가 아르바이터 데이터에 포함된 객관형 평가를 머신러닝 비지도 학습을 통해 인재성 지표 능력으로 치환하여 인재성 지표 계산에 반영할 수 있다. 보다 구체적으로는, 아르바이트 평가표 등의 저장된 이미지를 OCR(optical character reader) 판독하여 인재성 지표 평가에 활용 가능하다. 도 3은 일 실시예에 따라 전자장치가 사용자-평가 아르바이터 데이터에 주관형 평가가 포함된 경우, 사용자-평 가 아르바이터 데이터를 획득하는 과정을 구체적으로 도시한 것이다. 도 3을 참조하면, 사용자-평가 아르바이터 데이터를 획득하는 단계는, 상기 사용자-평가 아르바이터 데이터에 주관형 평가 데이터를 포함하는 경우, 상기 주관형 평가 데이터로부터 키워드를 추출하는 단계(S310); 상기 키 워드를 인재성 지표 평가와 연관된 미리 결정된 평가요소와 매칭시키는 단계(S320); 및 매칭 결과에 기초하여 상기 사용자-평가 아르바이터 데이터를 출력하는 단계(S330)를 포함한다. 도 3을 참조하면, 단계 S310에서 전자장치는 상기 주관형 평가 데이터로부터 인재성 평가를 위한 키워드 를 추출할 수 있다. 구체적으로 전자장치는 인재성 평가와 연관된 미리 결정된 평가요소와 매칭시킬 수 있는 키워드를 추출하도록 학습된 인공지능 모델을 이용하여 키워드를 추출할 수 있다. 일 실시예에 따르면, 주관형 평가 데이터가 '아르바이트 고용기간 동안 해당 알바생은 지각을 단 1회도 하지 않 았으며, 저희 매장 특성상 손님이 특정시간에만 많이 몰려서 힘든 편인데 힘듦에도 불구하고 주변 알바생 동료 들이랑 더 파이팅하여 업무를 했습니다.'라는 주관형 평가를 포함하는 경우, 전자장치는 해당 주관형 평 가로부터 '지각,' '동료,' '파이팅,' 및 '??듬에도 불구하고' 키워드를 추출할 수 있다. 도 3을 참조하면, 단계 S320에서 전자장치는 S310 단계에서 추출된 키워드를 인재성 평가와 연관된 미리 결정된 평가요소와 매칭시킬 수 있다. 일 실시예에 따르면, 인재성 지표가 성실, 팀워크, 및 열정 지표를 포함하는 경우, 단계 S320에서 전자장치 는 '지각' 키워드를 근면성실 지표와, '동료' 및 '파이팅' 키워드를 열정 및 팀워크 지표와, '힘듦에도 불구하고' 키워드를 열정 및 근면성실 지표와 매칭시킬 수 있다. 도 3을 참조하면, 단계 S330에서 전자장치는 매칭 결과에 기초하여 사용자-평가 아르바이터 데이터를 출 력할 수 있다. 이에 따라, 본 발명은, 주관형 평가 데이터에 포함된 주관적인 평가 또한 키워드 추출 방법을 통 하여 보다 객관화된 평가 요소를 인재성 지표의 계산에 활용함으로써 , 보다 객관적인 인재성 지표의 객관성을 보완할 수 있다.. 일 실시예에 따르면, 전자장치는 상기 제 1 인공지능 모델은 사용자-입력 아르바이트 데이터와 사용자-평 가 아르바이터 데이터를 비교하여, 사용자-입력 아르바이트 데이터와 사용자-평가 아르바이터 데이터의 차이 정 도에 따라 인재성 지표 중 근면성실 지표 및 책임감 지표에 감산치를 적용하여 출력할 수 있다. 일 실시예에 따르면, 전자장치 사용자-입력 아르바이트 데이터와 사용자-평가 아르바이터 데이터의 비교 결과 불일치 정도에 따라 0% 내지 100%로 감산치를 결정하여 인재성 지표에 적용할 수 있다. 예를 들어, 아르바 이트 기간과 관련하여, 제 1 아르바이트 데이터 상에서 아르바이트 기간이 10개월인 반면 제 2 아르바이트 데이 터 상에서 아르바이트 기간이 8개월인 경우, 전자장치는 인재성 지표 중 근면성실 지표 및 책임감 지표에 -25% 감산치를 적용하여 출력할 수 있다. 이에 따라, 전자장치는 제 1 아르바이트 데이터와 제 2 아르바 이트 데이터를 교차분석하여 보다 정확도 높은 인재성 지표의 출력이 가능하다. 일 실시예에 따르면, 사용자-입력 아르바이트 데이터와 사용자-평가 아르바이터 데이터의 비교 결과 불일치한 데이터가 존재할 경우, 불일치한 데이터가 있음을 표시할 수 있도록, 전자장치는 출력되는 인재성 지표 중 근면성실 지표 및 책임감 지표의 색, 글씨 등을 달리하는 등 근면성실 지표 및 책임감 지표의 출력 형태를 달리할 수 있으며, 나아가 근면성실 지표 및 책임감 지표의 감산치 또한 인재성 지표와 함께 출력할 수 있다. 도 4는 일 실시예에 따라 전자장치가 인공지능 모델 기반으로 후보 2D 의류 도면 템플릿들을 출력하는 단계를 구체적으로 나타내는 흐름도이다. 도 4를 참조하면, 전자장치는 사용자 속성 데이터를 획득하고; 그리고 사용자 속성 데이터 및 인재성 지 표가 입력되면 사용자에게 적합한 직군을 출력하는 직군 추천 인공지능 모델에 출력된 인재성 지표 및 상 기 사용자 속성 데이터를 입력함으로써, 상기 직군 추천 인공지능 모델로부터 후보 사용자 추천 직군을 출력할 수 있다. 단계 S410에서, 전자장치는 사용자 속성 데이터를 획득할 수 있다. 본 개시에서, 사용자 속성 데이터라는 용어는 사용자-입력 아르바이트 데이터와 같이 사용자의 아르바이트 경력 에 관련된 데이터를 제외한, 사용자의 속성에 관련된 데이터로를 의미할 수 있다. 사용자 속성 데이터는 교육 정도, 교육 상태, 종교, 경제 활동 상태, 혼인 상태, 의료 이력 등 직군 추천에 영향을 미칠 수 있는 다양한 데 이터를 포함할 수 있다. 이에 따라, 1차적으로 인재성 지표의 출력에 있어서는 사용자의 아르바이트 경력 관련 데이터만을 활용하여 블라인드 평가와 같이 다른 평가 요소를 배제함으로써 보다 객관적인 인재성 지표를 우선 적으로 출력하고, 2차적으로 인재성 지표 및 (사용자의 아르바이트 경력 관련 데이터와) 다른 평가 요소를 고려 하여 실질적으로 사용자 개개인의 구체적인 상황을 반영함으로써 보다 사용자에게 실질적으로 적합한 직군을 추 천할 수 있다. 일 실시예에 따르면, 사용자 속성 데이터는 제 1 아르바이터 데이터 및 제 2 아르바이트 데이터와 상이한 데이 터만을 포함할 수 있다. 일 실시예에 있어서, 상기 후보 사용자 추천 직군들은 2 이상의 직군들을 포함할 수 있다. 후보 사용자 추천 직 군들은 일반적인 후보 사용자 추천 직군(b1) 및 특정 직무와 관련된 후보 사용자 추천 직군(b2)을 포함할 수 있 다. 본 개시에서, 일반적인 후보 사용자 추천 직군(b1)이라는 용어는, 사용자의 인재성 지표값(a1)만을 고려하여, 인재성 지표값(a1)과 비교할 때 일정 유사도 범위 내의 지표값을 가지는 직군 또는 직군의 집합을 의미할 수 있 다. 사용자는 상기 일반적인 후보 사용자 추천 직군(b1)을 통하여, 입력된 아르바이트 경력이 어떠한 직군의 인 재성 또는 역량에 인정될 수 있을지를 간접적으로 확인할 수 있다. 본 개시에서, 특정 직무와 관련된 후보 사용자 추천 직군(b2)이라는 용어는 일반적인 후보 사용자 추천 직군 (b1) 중 직무 데이터에 포함되는 직군을 의미할 수 있다. 이에 따라, 전자장치는 후보 사용자 추천 직군 (b2)을 이용하여, 사용자의 아르바이트 경력 및 사용자 속성을 고려하여 사용자가 선택한 특정 직군 중 추천이 가능한 직군을 우선순위에 따라 출력할 수 있다. 일 실시예에 있어서, 사용자는 직군 추천 인공지능 모델에 사용자 속성 데이터 및 인재성 지표를 입력 시 추가적으로 유사도를 지정하여 입력할 수 있다. 전자장치는 직군 추천 인공지능 모델을 이용하여 사용자로부터 입력된 유사도 이상의 유사도를 갖는 추천 직군들을 출력할 수 있다. 이때, 유사도라는 용어는 후 보 사용자 추천 직군(b1)의 인재성 지표를 100이라 할 때, 사용자의 인재성 지표값(a1)의 인재성 지표는 그 중 몇이 되는가를 나타내는 수일 수 있다. 예를 들어, a1의 지표값이 '열정, 근면성실, 리더십, 책임 감, 팀워크, 및 창의성'이고, b1 직군의 지표값이 '열정, 근면성실, 리더십, 책임감 , 팀워크 및 창의성'이라면, 유사도는 (25/40+35/50+45/60+55/70+65/80+75/90)*100/6으로 표현될 수 있다. 일 실시예에 따르면, 전자장치는 사용자 속성 데이터 및 인재성 지표가 입력되면 사용자에게 적합한 직군 을 출력하는 직군 추천 인공지능 모델에 제 1 상기 인재성 지표 및 상기 사용자 속성 데이터를 입력함으로써, 상기 직군 추천 인공지능 모델로부터 후보 사용자 추천 직군들을 출력하는 단계(S420)에 있어서, 사용자에 의해 지정된 유사도를 고려하여 후보 사용자 직군들을 출력할 수 있다. 도 5는 일 실시예에 따라 인재성 지표 예측 인공지능 모델 및 직군 추천 인공지능 모델의 학습 과 정을 설명하는 흐름도이다. 도 5를 참조하면, 인재성 지표 예측 인공지능 모델은 제 1 사용자 아르바이트 학습데이터, 제 2 사용자 아르바이트 학습데이터, 및 직무 학습데이터를 기초로 학습될 수 있다. 구체적으로, 전자장치는 제 1 사 용자 아르바이트 학습데이터, 제 2 사용자 아르바이트 학습데이터, 및 직무 학습데이터를 매칭하고, 제 1 사용 자 아르바이트 학습데이터, 제 2 사용자 아르바이트 학습데이터, 및 직무 학습데이터가 모두 고려되어, 인재성 지표를 출력하도록 인재성 지표 예측 인공지능 모델을 학습시킬 수 있다. 일 실시예에 따르면, 전자장치는 단계 S210, S220, 및 S230에서 획득된 사용자-입력 아르바이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터를 인재성 지표 예측 인공지능 모델을 수정 및 갱신하기 위한 피드백 데이터로 제공할 수 있다. 한편, 인재성 지표 예측 인공지능 모델이 학습되는 과정은 인재성 지표 예측 인공지능 모델을 수정 및 갱신하는 과정에서도 동일하게 적용될 수 있다. 도 5를 참조하면, 직군 추천 인공지능 모델은 사용자 속성 학습데이터 및 인재성 지표 학습데이터를 기초 로 학습될 수 있다. 구체적으로 전자장치는 사용자 속성 학습데이터 및 인재성 지표 학습데이터를 매칭하고, 사용자 속성 학습데이터 및 인재성 지표 학습데이터가 모두 고려되어, 후보 사용자 추천 직군이 출력되도록 직군 추천 인공지능 모델을 학습시킬 수 있다. 일 실시예에 따르면, 전자장치는 단계 S240 및 S410에서 획득된 사용자 속성 데이터 및 인재성 지표 데이 터를 직군 추천 인공지능 모델을 수정 및 갱신하기 위한 피드백 데이터로 제공할 수 있다. 한편, 직군 추 천 인공지능 모델이 학습되는 과정은 직군 추천 인공지능 모델을 수정 및 갱신하는 과정에서도 동 일하게 적용될 수 있다. 도 6은 일 실시예에 따른 전자장치의 블록도이다. 도 6을 참조하면, 일 실시예에 따른 전자장치는 프로세서 및 메모리를 포함할 수 있다. 그러나 도시된 구성 요소가 모두 필수 구성 요소인 것은 아니다. 도시된 구성 요소보다 많은 구성 요소에 의해 전자장 치가 구현될 수도 있고, 그보다 적은 구성요소에 의해서도 전자장치는 구현될 수 있다. 예를 들어, 도 6에 도시된 바와 같이, 일 실시예에 따른 전자장치는 사용자 입력부, 통신부, 및 디스플레 이를 더 포함할 수도 있다. 프로세서는 메모리내 하나 이상의 인스트럭션을 실행함으로써 전자장치의 전반적인 동작을 제 어한다. 예를 들어, 프로세서는 메모리에 저장된 하나 이상의 인스트럭션을 실행함으로써 사용자 입 력부, 통신부, 디스플레이 등을 전반적으로 제어할 수 있다. 또한, 프로세서는 메모리 에 저장된 하나 이상의 인스트럭션을 실행함으로써 도 1 내지 도 5와 관련하여 기술된 전자장치의 동작 및 기능을 수행할 수 있다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있고, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인공지능(AI) 전용 프로세서일 수 있다. 일 실시예에 따르면, 프로세서가 복수의 프로세서 또는 그래픽 전용 프로세서 또는 NPU와 같은 인공 지능 전용 프로세서로 구현될 때, 복수의 프 로세서 또는 그래픽 전용 프로세서 또는 NPU와 같은 인공 지능 전용 프로세서 중 적어도 일부는 전자장치 및 전자장치와 연결된 다른 전자장치 또는 서버에 탑재될 수도 있다. 일 실시예에 따르면, 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 사용자-입력 아르바이트 데이터를 획득하고, 사용자-평가 아르바이터 데이터를 획득하고, 직무 데이터를 획득하고, 사용자-입력 아르바 이트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터가 입력되면 입력된 사용자 아르바이트 데이터, 및 직무 데이터에 따른 인재성 지표를 출력하는 인재성 지표 예측 인공지능 모델에 상기 사용자-입력 아르바이 트 데이터, 사용자-평가 아르바이터 데이터, 및 직무 데이터를 입력함으로써, 상기 인재성 지표 예측 인공지능 모델로부터 인재성 지표를 출력할 수 있다. 일 실시예에 따르면, 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 사용자-평가 아르바 이터 데이터를 획득함에 있어서, 상기 사용자-평가 아르바이터 데이터가 주관형 평가 데이터를 포함하는 경우, 상기 주관형 평가 데이터로부터 키워드를 추출하고; 상기 키워드를 인재성 지표 평가와 연관된 미리 결정된 평 가요소와 매칭시키고; 그리고 매칭 결과에 기초하여 사용자-평가 아르바이터 데이터를 출력할 수 있다. 일 실시예에 따르면, 프로세서는, 상기 인재성 지표 예측 인공지능 모델로부터 인재성 지표를 출력한 이후, 상기 하나 이상의 인스트럭션을 실행함으로써, 사용자 속성 데이터를 획득하고; 그리고 사용자 속성 데이 터 및 인재성 지표가 입력되면 사용자에게 적합한 직군을 출력하는 직군 추천 인공지능 모델에 상기 인재성 지 표 및 상기 획득한 사용자 속성 데이터를 입력함으로써, 상기 직군 추천 인공지능 모델로부터 후보 사용자 추천 직군들을 출력할 수 있다. 메모리는 전자장치의 동작을 제어하기 위한 하나 이상의 인스트럭션을 포함할 수 있다. 메모리(62 0)는 전자장치가 이용하는 인공지능 모델들, 예를 들어 인재성 지표 예측 인공지능 모델 및 직군 추천 인공지능 모델을 포함할 수 있다. 일 실시 예에 따르면, 메모리는 예를 들어, 플래시 메모리 타입(flash memory type), 하드디스크 타입 (hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들 어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있으나, 이에 제한되지 않는다. 사용자 입력부는 전자장치의 동작을 제어하기 위한 사용자 입력을 수신할 수 있다. 예를 들어, 사용 자 입력부는, 키 패드(key pad), 돔 스위치(dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항 막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 조그 휠, 조그 스위치 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 통신부는 서버와의 통신을 위한 하나 이상의 통신 모듈을 포함할 수 있다. 예를 들어, 통신부 는 근거리 통신부 또는 이동 통신부 중 적어도 하나를 포함할 수 있다. 근거리 통신부(short-range wireless communication unit)는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통 신부, 근거리 무선 통신부(Near Field Communication unit), WLAN(와이파이) 통신부, 지그비(Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(ultra wideband) 통신부, Ant+ 통신부 등을 포함할 수 있으나, 이에 제한되는 것은 아니다. 이동 통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 여 기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형 태의 데이터를 포함할 수 있다. 디스플레이는 전자장치에서 처리되는 정보를 표시 출력할 수 있다. 예를 들어, 디스플레이는 전자장치의 제어를 위한 인터페이스, 전자장치의 상태 표시를 위한 인터페이스 등을 디스플레이할 수 있다. 도 8은 일 실시예에 따른 서버의 블록도이다. 일 실시예에 따르면, 전자장치가 인공지능 모델을 이용하여 아르바이트 경력 기반 직무 평가 및 직군 추 천을 제공하는 방법은 전자장치에 연결되어 통신 가능한 서버에서 수행될 수 있다. 서버는 통신 인터페이스, 데이터 베이스, 및 프로세서를 포함할 수 있다. 예를 들어, 본 개시에 따른 서버의 통신 인터페이스는 전자장치의 통신부에 대응될 수 있고, 서버 의 데이터베이스는 전자장치의 메모리에 대응될 수 있고, 서버의 프로세서(530 0)는 전자장치의 프로세서에 대응될 수 있다. 또한, 서버의 프로세서는 도 1 내지 5와 관련하여 기술된 인공지능 모델을 이용하여 아르바이트 경력 기반 직무 평가 및 직군 추천을 제공하는 방법을 수행할 수 있다. 본 발명의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하며, 당업자 가 충분히 이해할 수 있듯이 기술적으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적 으로 실시 가능할 수도 있고 연관 관계로 함께 실시 가능할 수도 있다."}
{"patent_id": "10-2023-0106558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 본 발명의 기 술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 따라서 본 발명의 범위는 상기 발명의 설명보다는 후술하는 청구범위에 의하여 나타내어지며, 청 구범위의 의미, 범위 및 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함 되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2023-0106558", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따라 인공지능 모델 기반으로 아르바이트 데이터 및 직무 데이터로부터 인재성 지표를 출력 하는 과정을 나타내는 도면이다. 도 2는 일 실시예에 따라 전자장치가 인재성 지표 예측 인공지능 모델을 기반으로 인재성 지표를 출력하는 방법 을 나타내는 흐름도이다. 도 3은 일 실시예에 따라 전자장치가 사용자-평가 아르바이터 데이터에 주관형 평가가 포함된 경우, 사용자-평 가 아르바이터 데이터를 획득하는 과정을 설명하기 위한 도면이다. 도 4는 일 실시예에 따라 전자장치가 인공지능 모델 기반으로 후보 2D 의류 도면 템플릿들을 출력하는 단계를 구체적으로 나타내는 흐름도이다. 도 5는 일 실시예에 따라 인재성 지표 예측 인공지능 모델 및 직군 추천 인공지능 모델의 학습 과 정을 설명하기 위한 도면이다. 도 6은 일 실시예에 따른 전자장치의 블록도이다. 도 7은 일 실시예에 따른 전자장치의 블록도이다. 도 8은 일 실시예에 따른 서버의 블록도이다."}
