{"patent_id": "10-2022-0175198", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0092692", "출원번호": "10-2022-0175198", "발명의 명칭": "차량 제어 장치, 및 그 방법", "출원인": "현대자동차주식회사", "발명자": "김일환"}}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량의 변속을 위한 속도 제어 명령을 생성하는 센서부;상기 속도 제어 명령을 수행할 경우 상기 차량과의 거리가 짧아지는 타겟 차량을 검출하고, 상기 타겟 차량과의거리가 멀어지는 속도로 상기 차량이 주행 중일 경우 변속 기간 동안 상기 타겟 차량 속도와의 속도 차이가 미리 설정된 임계 속도 이하가 되는 타겟 속도에 도달하도록 상기 차량 속도를 변속하는 제어 신호를 생성하는 프로세서; 및상기 제어 신호를 바탕으로 상기 차량의 차속을 변속하는 주행 제어 장치;를 포함하는 차량 제어 장치."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 프로세서는급감속을 요청하는 속도 제어 명령에 응답하여, 상기 차량이 상기 타겟 차량에 해당하는 후방 차량 보다 빠를경우, 상기 차량과 상기 후방 차량 간의 상대 속도가 상기 임계 속도 이하가 되도록 상기 차량을 감속시키는 것을 특징으로 하는 차량 제어 장치."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 프로세서는충돌 발생 예상 시간을 바탕으로 상기 차량과 충돌 위험이 있는 전방 위험 차량을 검출될 경우, 상기 변속 기간이후의 상기 브레이크 페달 위치 센서 신호에 응답하여 상기 차량의 속도를 감속시키는 것을 특징으로 하는 차량 제어 장치."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 프로세서는급가속을 요청하는 상기 속도 제어 명령에 응답하여, 상기 차량이 상기 타겟 차량에 해당하는 전방 차량 보다느릴 경우, 상기 차량과 상기 전방 차량 간의 상대 속도가 상기 임계 속도 이하가 되도록 상기 차량을 가속시키는 것을 특징으로 하는 차량 제어 장치."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 프로세서는충돌 발생 예상 시간을 바탕으로 상기 차량과 충돌 위험이 있는 후방 위험 차량이 검출될 경우, 상기 변속 기간공개특허 10-2024-0092692-3-이후의 상기 가속 페달 위치 센서 신호에 응답하여 상기 차량의 속도를 가속시키는 것을 특징으로 하는 차량 제어 장치."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 차량의 운전자에게 상기 속도 제어 명령이 제한되는 사실을 알리도록 알람을 송출하는 알람부를 더 포함하고,상기 프로세서는,상기 알람을 송출한 이후 상기 속도 제어 명령이 다시 감지될 경우, 상기 차량의 제어권을 상기 운전자에게 전달하는 것을 특징으로 하는 차량 제어 장치."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "차량의 변속을 위한 속도 제어 명령을 감지하는 단계;상기 속도 제어 명령을 수행할 경우, 상기 차량과의 거리가 짧아지는 타겟 차량을 검출하는 단계; 상기 타겟 차량과의 거리가 멀어지는 속도로 상기 차량이 주행 중일 경우, 변속 기간 동안 상기 타겟 차량 속도와의 속도 차이가 미리 설정된 임계 속도 이하가 되는 타겟 속도에 도달하도록 상기 차량 속도를 변속하는단계; 및상기 변속 기간 이후, 상기 속도 제어 명령을 제한하여 상기 타겟 속도를 유지하는 단계;를 포함하는 차량 제어 방법."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 속도 제어 명령을 감지하는 단계는단위 시간 내에 상기 차량의 브레이크 페달 위치 센서 신호의 변화량이 제1 임계값 이상인 것을 확인하는 단계를 포함하는 것을 특징으로 하는 차량 제어 방법."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 차량 속도를 변속하는 단계는상기 차량이 상기 타겟 차량에 해당하는 후방 차량 보다 빠를 경우, 상기 차량과 상기 후방 차량 간의 상대 속도가 상기 임계 속도 이하가 되도록 상기 차량을 감속시키는 단계를 포함하는 것을 특징으로 하는 차량 제어 방법."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 타겟 차량을 검출하는 단계는, 충돌 발생 예상 시간을 바탕으로 상기 차량과 충돌 위험이 있는 전방 위험차량을 검출하는 단계를 더 포함하고, 상기 전방 위험 차량이 검출될 경우, 상기 변속 기간 이후의 상기 브레이크 페달 위치 센서 신호에 응답하여 상공개특허 10-2024-0092692-4-기 차량의 속도를 감속하는 단계를 더 포함하는 것을 특징으로 하는 차량 제어 방법."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7 항에 있어서,상기 속도 제어 명령을 감지하는 단계는단위 시간 내에 상기 차량의 가속 페달 위치 센서 신호의 변화량이 제2 임계값 이상인 것을 확인하는 단계를 포함하는 것을 특징으로 하는 차량 제어 방법."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 차량 속도를 변속하는 단계는상기 차량이 상기 타겟 차량에 해당하는 전방 차량 보다 느릴 경우, 상기 차량과 상기 전방 차량 간의 상대 속도가 상기 임계 속도 이하가 되도록 상기 차량을 가속시키는 단계를 포함하는 것을 특징으로 하는 차량 제어 방법."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 타겟 차량을 검출하는 단계는, 충돌 발생 예상 시간을 바탕으로 상기 차량과 충돌 위험이 있는 후방 위험차량을 검출하는 단계를 더 포함하고, 상기 후방 위험 차량이 검출될 경우, 상기 변속 기간 이후의 상기 가속 페달 위치 센서 신호에 응답하여 상기차량의 속도를 가속하는 단계를 더 포함하는 것을 특징으로 하는 차량 제어 방법."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 7 항에 있어서,상기 차량 속도를 변속하는 단계는상기 차량과 상기 타겟 차량 간의 차간 시간이 미리 설정된 임계 시간 이상인 경우에 수행되는 것을 특징으로하는 차량 제어 방법."}
{"patent_id": "10-2022-0175198", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 7 항에 있어서,상기 차량의 운전자에게 상기 속도 제어 명령이 제한되는 사실을 알리도록 알람을 송출하는 단계; 및상기 알람을 송출한 이후 상기 속도 제어 명령이 다시 감지될 경우, 상기 차량의 제어권을 상기 운전자에게 전달하는 단계를 더 포함하는 것을 특징으로 하는 차량 제어 방법."}
{"patent_id": "10-2022-0175198", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 의한 차량 제어 장치는 센서부, 프로세서 및 주행 제어 장치를 포함할 수 있다. 센서부는 차량의 변속을 위한 속도 제어 명령을 생성할 수 있다. 프로세서는 속도 제어 명령을 수행할 경우 차량과의 거리 가 짧아지는 타겟 차량을 검출하고, 타겟 차량과의 거리가 멀어지는 속도로 차량이 주행 중일 경우 변속 기간 동 안 타겟 차량 속도와의 속도 차이가 미리 설정된 임계 속도 이하가 되는 타겟 속도에 도달하도록 차량 속도를 변 속할 수 있다. 주행 제어 장치는 제어 신호를 바탕으로 차량의 차속을 변속할 수 있다."}
{"patent_id": "10-2022-0175198", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량 제어 장치 및 그 방법에 관한 것으로, 보다 상세하게는 자율주행 차량의 제어 기술에 관한 것이다."}
{"patent_id": "10-2022-0175198", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율주행 차량은 운전자가 직접 조작하지 않아도 주행 환경을 인식해 위험을 판단하고 주행 경로를 계획하여 운 전자 주행 조작을 최소화하며, 스스로 안전하게 운행하는 차량이다. 자율주행 차량은 수동 주행 모드 또는 자율 주행 모드에서 조향, 가속 및 제동 등의 차량 주행 제어가 수행될 수 있다. 예를 들어, 자동 차선 유지 시스템(Automated Lane Keeping System; ALKS)을 기반으로 차량이 주행 중인 상태에서, 운전자가 브레이크 페달을 밟거나 가속 페달을 밟을 경우 자율주행 차량은 차량의 제어권을 운 전자에게 전달한다. 즉, ALKS 기반으로 자율주행을 수행하는 상태에서 운전자로부터 감속 또는 가속의 요청이 있을 경우, 차량은 운전자의 제어에 의해서 감속하거나 가속을 한다. 이와 같이, 자율주행으로 운행을 하는 과정에서 운전자의 감속 또는 가속 요청을 즉시 수락할 경우, 인접하는 차량들과의 충돌 위험성이 발생할 수 있다. 특히, 자율주행 과정에서 운전자는 운행에 대해서 부주의할 수 있고, 브레이크 페달 및 가속 페달은 운전자의 의도와는 상관없이 운전자의 실수로 동작할 가능성도 있다. 따라서 자율주행 중인 차량에서 운전자의 제어가 있을 경우, 차량의 제어권을 부여하는 데에는 보다 신중한 방 안이 요구된다."}
{"patent_id": "10-2022-0175198", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 자율주행을 수행하는 차량의 제어권을 보다 효율적으로 조절할 수 있는 차량의 제어 장치 및 그 방법 을 제공하기 위한 것이다. 또한, 본 발명은 자율주행 중인 차량의 제어권을 이양하는 과정에서 충돌이 발생할 수 있는 가능성을 제거할 수 있는 차량의 제어 장치 및 그 방법을 제공하기 위한 것이다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재들로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0175198", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 의한 차량 제어 장치는 센서부, 프로세서 및 주행 제어 장치를 포함할 수 있다. 센서부는 차량의 변속을 위한 속도 제어 명령을 생성할 수 있다. 프로세서는 속도 제어 명령을 수행할 경우 차량과의 거 리가 짧아지는 타겟 차량을 검출하고, 타겟 차량과의 거리가 멀어지는 속도로 차량이 주행 중일 경우 변속 기간 동안 타겟 차량 속도와의 속도 차이가 미리 설정된 임계 속도 이하가 되는 타겟 속도에 도달하도록 차량 속도를 변속할 수 있다. 주행 제어 장치는 제어 신호를 바탕으로 차량의 차속을 변속할 수 있다. 실시 예에 의하면, 상기 프로세서는 급감속을 요청하는 속도 제어 명령에 응답하여, 상기 차량이 상기 타겟 차 량에 해당하는 후방 차량 보다 빠를 경우, 상기 차량과 상기 후방 차량 간의 상대 속도가 상기 임계 속도 이하 가 되도록 상기 차량을 감속시킬 수 있다. 실시 예에 의하면, 상기 프로세서는 충돌 발생 예상 시간을 바탕으로 상기 차량과 충돌 위험이 있는 전방 위험 차량을 검출될 경우, 상기 변속 기간 이후의 상기 브레이크 페달 위치 센서 신호에 응답하여 상기 차량의 속도 를 감속시킬 수 있다. 실시 예에 의하면, 상기 프로세서는 급가속을 요청하는 상기 속도 제어 명령에 응답하여, 상기 차량이 상기 타 겟 차량에 해당하는 전방 차량 보다 느릴 경우, 상기 차량과 상기 전방 차량 간의 상대 속도가 상기 임계 속도 이하가 되도록 상기 차량을 가속시킬 수 있다. 실시 예에 의하면, 상기 프로세서는 충돌 발생 예상 시간을 바탕으로 상기 차량과 충돌 위험이 있는 후방 위험 차량이 검출될 경우, 상기 변속 기간 이후의 상기 가속 페달 위치 센서 신호에 응답하여 상기 차량의 속도를 가속시킬 수 있다. 실시 예에 의하면, 상기 차량의 운전자에게 상기 속도 제어 명령이 제한되는 사실을 알리도록 알람을 송출하는 알람부를 더 포함하고, 상기 프로세서는 상기 알람을 송출한 이후 상기 속도 제어 명령이 다시 감지될 경우, 상 기 차량의 제어권을 상기 운전자에게 전달할 수 있다. 본 발명의 실시 예에 의한 차량 제어 방법은 차량의 변속을 위한 속도 제어 명령을 감지하는 단계, 상기 속도 제어 명령을 수행할 경우 상기 차량과의 거리가 짧아지는 타겟 차량을 검출하는 단계, 상기 타겟 차량과의 거리 가 멀어지는 속도로 상기 차량이 주행 중일 경우 변속 기간 동안 상기 타겟 차량 속도와의 속도 차이가 미리 설 정된 임계 속도 이하가 되는 타겟 속도에 도달하도록 상기 차량 속도를 변속하는 단계 및 상기 변속 기간 이후 상기 속도 제어 명령을 제한하여 상기 타겟 속도를 유지하는 단계를 포함할 수 있다. 실시 예에 의하면, 상기 속도 제어 명령을 감지하는 단계는 단위 시간 내에 상기 차량의 브레이크 페달 위치 센 서 신호의 변화량이 제1 임계값 이상인 것을 확인하는 단계를 포함할 수 있다. 실시 예에 의하면, 상기 차량 속도를 변속하는 단계는 상기 차량이 상기 타겟 차량에 해당하는 후방 차량 보다 빠를 경우, 상기 차량과 상기 후방 차량 간의 상대 속도가 상기 임계 속도 이하가 되도록 상기 차량을 감속시키 는 단계를 포함할 수 있다. 실시 예에 의하면, 상기 타겟 차량을 검출하는 단계는, 충돌 발생 예상 시간을 바탕으로 상기 차량과 충돌 위험 이 있는 전방 위험 차량을 검출하는 단계를 더 포함하고, 상기 전방 위험 차량이 검출될 경우 상기 변속 기간 이후의 상기 브레이크 페달 위치 센서 신호에 응답하여 상기 차량의 속도를 감속하는 단계를 더 포함할 수 있다. 실시 예에 의하면, 상기 속도 제어 명령을 감지하는 단계는 단위 시간 내에 상기 차량의 가속 페달 위치 센서 신호의 변화량이 제2 임계값 이상인 것을 확인하는 단계를 포함할 수 있다. 실시 예에 의하면, 상기 차량 속도를 변속하는 단계는 상기 차량이 상기 타겟 차량에 해당하는 전방 차량 보다 느릴 경우, 상기 차량과 상기 전방 차량 간의 상대 속도가 상기 임계 속도 이하가 되도록 상기 차량을 가속시키 는 단계를 포함할 수 있다. 실시 예에 의하면, 상기 타겟 차량을 검출하는 단계는 충돌 발생 예상 시간을 바탕으로 상기 차량과 충돌 위험 이 있는 후방 위험 차량을 검출하는 단계를 더 포함하고, 상기 후방 위험 차량이 검출될 경우 상기 변속 기간 이후의 상기 가속 페달 위치 센서 신호에 응답하여 상기 차량의 속도를 가속하는 단계를 더 포함할 수 있다. 실시 예에 의하면, 상기 차량 속도를 변속하는 단계는 상기 차량과 상기 타겟 차량 간의 차간 시간이 미리 설정 된 임계 시간 이상인 경우에 수행될 수 있다. 실시 예에 의하면, 상기 차량의 운전자에게 상기 속도 제어 명령이 제한되는 사실을 알리도록 알람을 송출하는 단계 및 상기 알람을 송출한 이후 상기 속도 제어 명령이 다시 감지될 경우 상기 차량의 제어권을 상기 운전자 에게 전달하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0175198", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 의하면, 주행 환경에 따라 차량의 제어권을 보다 효율적으로 조절할 수 있다. 또한, 본 발명의 실시 예에 의하면, 운전자의 동작에 의해서 차량을 제어할 경우 주변 차량과의 충돌 가능성이 있다고 판단되면, 차량의 가속 또는 감속을 제한하여 주변 차량들과의 충돌 가능성을 줄일 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2022-0175198", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한 다. 본 발명의 실시예의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소 의 본질이나 차례 또는 순서 등이 한정되지 않는다. 또한, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용 어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들 은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정 의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 도 1 내지 도 17을 참조하여, 본 발명의 실시예들을 구체적으로 설명하기로 한다. 도 1은 본 발명의 일 실시 예에 의한 차량 제어 장치의 구성을 나타내는 블록도이다. 본 발명의 일 실시 예에 의한 차량 제어 장치는 차량의 내부에 구현될 수 있다. 이때, 차량 제어 장치는 차량의 내부 제어 유닛 들과 일체로 형성될 수 있으며, 별도의 장치로 구현되어 별도의 연결 수단에 의해 차량의 제어 유닛들과 연결될 수도 있다. 도 1을 참조하면, 본 발명의 실시 예에 의한 차량 제어 장치는 센서부, 통신부, 저장부, 프로세서 , 주행 제어 장치, 및 알람부를 포함할 수 있다. 센서부는 차량의 변속을 위한 속도 제어 명령을 생성하는 브레이크 페달 위치 센서(Brake-pedal Position Sensor; BPS), 및 가속 페달 위치 센서(Accelerator Position Sensor; APS)를 포함할 수 있다. 브레이크 페달 위치 센서는 차량에 구비된 브레이크 페달의 눌림 정도에 따라 BPS 신호를 출력할 수 있다. 일례 로, BPS 신호는 브레이크 페달의 눌림에 따라 0~100의 데이터를 출력할 수 있고, 0의 값은 브레이크 페달의 눌 림이 없을 경우이며, 100의 값은 브레이크 페달의 눌림이 최대인 경우일 수 있다. 가속 페달 위치 센서는 차량에 구비된 가속 페달의 눌림 정도에 따라 APS 신호를 출력할 수 있다. 일례로, APS 신호는 가속 페달의 눌림에 따라 0~100의 데이터를 출력할 수 있고, 0의 값은 가속 페달의 눌림이 없을 경우이 며, 100의 값은 가속 페달의 눌림이 최대인 경우일 수 있다.또한, 센서부는 차량의 외부 객체, 특히 차량의 전방 또는 후방의 위치한 차량들을 검출하기 위한 카메라, 레이다(Radio Detection and Ranging; RADAR), 라이다(Light Imaging Detection and Ranging; LIDAR), 초음파 센서, 또는 적외선 센서 중에서 적어도 어느 하나 이상을 포함할 수 있다. 카메라는 차량 외부 이미지를 획득하기 위해, 차량의 외부의 적절한 곳, 예를 들면, 차량의 전방, 후방, 우측 사이드 미러, 좌측 사이드 미러에 위치할 수 있다. 카메라 모노 카메라, 스테레오 카메라, AVM(Around View Monitoring) 카메라 또는 360도 카메라일 수 있다. 카메라는 차량 전방의 이미지를 획득하기 위해, 차량의 실내에서, 프런트 윈드 쉴드에 근접하게 배치될 수 있고, 프런트 범퍼 또는 라디에이터 그릴 주변에 배치될 수 있다. 카메라는 차량 측방의 이미지를 획득하기 위해, 차량의 실내에서 사이드 윈도우 중 적어도 어느 하나에 근접하 게 배치될 수 있다. 또한, 카메라는 휀더 또는 도어 주변에 배치될 수 있다. 레이다는 전자파 송신 모듈, 수신 모듈을 포함할 수 있다. 레이다는 전파 발사 원리상 펄스 레이다(Pulse Radar) 방식 또는 연속파 레이다(Continuous Wave Radar) 방식으로 구현될 수 있다. 레이다는 연속파 레이다 방 식 중에서 신호 파형에 따라 FMCW(Frequency Modulated Continuous Wave)방식 또는 FSK(Frequency Shift Keyong) 방식으로 구현될 수 있다. 레이다는 전자파를 매개로, TOF(Time of Flight) 방식 또는 페이즈 쉬프트 (phase-shift) 방식에 기초하여, 객체를 검출하고, 검출된 객체의 위치, 검출된 객체와의 거리 및 상대 속도를 검출할 수 있다. 라이다는 레이저 송신 모듈, 수신 모듈을 포함할 수 있다. 라이다는, TOF(Time of Flight) 방식 또는 페이즈 쉬 프트(phase-shift) 방식으로 구현될 수 있다. 라이다는 차량의 전방, 후방 또는 측방에 위치하는 객체를 감지하 기 위해 차량의 외부에 노출될 수 있다. 초음파 센서는 초음파 송신 모듈, 수신 모듈을 포함할 수 있다. 초음파 센서는, 초음파를 기초로 객체를 검출하 고, 검출된 객체의 위치, 검출된 객체와의 거리 및 상대 속도를 검출할 수 있다. 초음파 센서는 차량의 전방, 후방 또는 측방에 위치하는 객체를 감지하기 위해 차량의 외부의 적절한 위치에 배치될 수 있다. 적외선 센서는 적외선 송신 모듈, 수신 모듈을 포함할 수 있다. 적외선 센서는, 적외선 광을 기초로 객체를 검 출하고, 검출된 객체의 위치, 검출된 객체와의 거리 및 상대 속도를 검출할 수 있다. 적외선 센서는 차량의 전 방, 후방 또는 측방에 위치하는 객체를 감지하기 위해 차량의 외부에 배치될 수 있다. 통신부는 사용자 단말기, 다른 차량 또는 외부 서버와 통신을 수행할 수 있다. 근거리 통신(Short range communication), GPS 신호 수신, V2X 통신, 광통신, 방송 송수신 및 ITS(Intelligent Transport Systems) 통신 기능을 수행할 수 있다. 통신부는 블루투스(Bluetooth), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless- Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근 거리 통신을 지원할 수 있다. 통신부는 위치 정보를 획득하기 위한 GPS(Global Positioning System) 모듈 또는 DGPS(Differential Global Positioning System) 모듈을 포함할 수 있다. 또한 통신부는 V2X 통신 모듈을 포함할 수 있다. V2X 통신 모듈은 서버(Vehicle to Infra; V2I), 타 차량 (Vehicle to Vehicle; V2V) 또는 보행자(Vehicle to Pedestrian; V2P)와의 무선 통신 프로토콜을 위한 RF 회로 를 포함할 수 있다. 통신부는 이동 통신을 위한 기술 표준들 또는 통신방식에 따라 구축된 이동 통신망 상에서 기지국, 외부의 단말, 센터 중 적어도 하나와 무선 신호를 송수신할 수 있다. 예를 들어, 통신부는 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE- A(Long Term Evolution-Advanced) 기반으로 통신을 수행할 수 있다. 무선 신호는 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태의 데이터를 포함할 수 있다. 저장부는 프로세서의 동작을 위한 알고리즘 및 AI 프로세서를 저장할 수 있다. 저장부는 하드 디 스크 드라이브, 플래시 메모리, EEPROM(Electrically erasable programmable read-only memory), SRAM(Static RAM), FRAM (Ferro-electric RAM), PRAM (Phase-change RAM), MRAM(Magnetic RAM), DRAM(Dynamic Random Access Memory), SDRAM(Synchronous Dynamic Random Access Memory), DDR-SDRAM(Double Date Rate-SDRAM) 등 을 이용할 수 있다. 프로세서는 속도 제어 명령을 감지할 수 있다. 속도 제어 명령은 차량의 변속을 위한 사용자 입력을 의미 하고, BPS 신호 및 APS 신호를 바탕으로 확인될 수 있다. 예를 들어, 프로세서는 단위 시간 내에 BPS 신호 의 변화량이 제1 임계값 이상인 경우 감속을 위한 속도 제어 명령이 입력된 것을 감지할 수 있다. 제1 임계값은 차량을 급제동 시킬 수 있는 제동량을 요청하는 BPS 신호의 크기로 설정될 수 있다. 또는, 프로세서는 단 위 시간 내에 APS 신호의 변화량이 제2 임계값 이상인 경우 가속을 위한 속도 제어 명령이 입력된 것을 감지할 수 있다. 제2 임계값은 차량을 급가속 시킬 수 있는 가속량을 요청하는 APS 신호의 크기로 설정될 수 있다. 프로세서는 속도 제어 명령에 의해서 차량과의 거리가 짧아지는 타겟 차량을 검출할 수 있다. 예를 들어, BPS 신호에 의해서 차량이 감속할 경우, 감속된 차량은 후방 차량과의 거리가 짧아지기 때문에, 후방 차량을 타 겟 차량으로 검출할 수 있다. 또는, APS 신호에 의해서 차량이 가속할 경우, 가속된 차량은 전방 차량과의 거리 가 짧아지기 때문에, 전방 차량을 타겟 차량으로 검출할 수 있다. 차량이 타겟 차량과의 거리가 멀어지는 속도로 주행 중일 경우, 프로세서는 변속 기간 동안, 차량이 타겟 속도에 도달하도록 차량의 속도를 변속할 수 있다. 타겟 속도는 타겟 차량의 속도에 대응하며, 예를 들어 타겟 차량의 속도와 미리 설정된 임계 속도 이하의 범위 내에서 설정될 수 있다. 프로세서는 차량 속도를 타겟 속도로 제어하여, 차량은 타겟 차량과 상대 속도가 임계 속도 이하가 될 수 있다. 임계 속도는 차량과 타겟 차 량의 속도가 비슷한 속도를 유지할 수 있는 수준으로 결정될 수 있으며, 예를 들어, 0에 가까운 수치로 결정될 수 있다. 변속 기간 이후, 프로세서는 타겟 속도를 유지하도록 속도 제어 명령을 제한할 수 있다. 즉, 차량이 타겟 속도가 된 이후의 속도 제어 명령은 무시될 수 있다. 프로세서는 변속 기간의 동작을 수행하기 위해서 차량과 타겟 차량 간의 차간 시간이 미리 설정된 임계 시 간 이상인지를 판단할 수 있다. 타겟 차량과의 차간 시간이 임계 시간 미만일 경우, 즉 타겟 차량과의 차간 시 간이 매우 짧아서 변속에 의해서 타겟 차량과의 충돌이 우려될 경우, 프로세서는 변속 기간의 동작을 수행 하지 않을 수 있다. 또한, 프로세서는 충돌 위험이 있는 위험 차량을 검출할 수 있다. 충돌 위험은 충돌 발생 예상 시간(Time To Collision; TTC)을 바탕으로 판단될 수 있다. TTC는 특정 시점에 위험 차량과 차량 간의 거리를 상대속도로 나누어서 구해지는 시간을 의미할 수 있다. 또는 충돌 위험을 판단하기 위해서 차간 시간(TimeGap)이 활용될 수 있다. 예를 들어, 프로세서는 차간 시 간이 일정 수준 이하이거나, 충돌 발생 예상 시간이 일정 수준 이하일 경우 위험 차량과의 충돌 위험이 있다고 판단할 수 있다. 프로세서는 BPS 신호를 바탕으로 후방 차량을 타겟 차량으로 검출할 경우, 전방의 차량들 중에서 충돌 위 험이 있는 전방 위험 차량을 검출할 수 있다. 또는 프로세서는 APS 신호를 바탕으로 전방 차량을 타겟 차 량으로 검출할 경우, 후방의 차량들 중에서 충돌 위험이 있는 후방 위험 차량을 검출할 수 있다. 프로세서는 위험 차량을 검출하였을 경우, 속도 제어 명령을 제한하지 않고, 속도 제어 명령에 대응하여 차량을 감속하거나 가속할 수 있다. 또한, 프로세서는 타겟 속도를 유지하는 단계 이후, 운전자에게 속도 제어 명령이 제한되는 사실을 알리도 록 알람부를 통해서 알람을 송출할 수 있다. 알람을 송출한 이후 일정 시간 내에 속도 제어 명령이 다시 감지될 경우, 프로세서는 차량의 제어권을 운전자에게 전달할 수 있다. 프로세서는 타겟 차량 및 위험 차량을 검출하기 위해서 센서부로부터 제공받은 데이터를 인공지능 학 습할 수 있다. 이를 위해서, 프로세서는 인공지능(artificial intelligence; 이하, AI) 프로세서를 포함 할 수 있다. AI 프로세서는 미리 저장된 프로그램을 이용하여 신경망을 학습할 수 있다. 타겟 차량 및 위험 차 량을 검출하기 위한 신경망은 인간의 뇌 구조를 컴퓨터 상에서 모의하도록 설계될 수 있으며, 인간의 신경망의 뉴런(neuron)을 모의하는, 가중치를 갖는 복수의 네트워크 노드들을 포함할 수 있다. 복수의 네트워크 모드들은 뉴런이 시냅스(synapse)를 통해 신호를 주고 받는 뉴런의 시냅틱 활동을 모의하도록 각각 연결 관계에 따라 데이터를 주고 받을 수 있다. 신경망은 신경망 모델에서 발전한 딥러닝 모델을 포함할 수 있다. 딥 러닝 모델에 서 복수의 네트워크 노드들은 서로 다른 레이어에 위치하면서 컨볼루션(convolution) 연결 관계에 따라 데이터 를 주고 받을 수 있다. 신경망 모델의 예는 심층 신경망(DNN, deep neural networks), 합성곱 신경망(CNN, convolutional deep neural networks), 순환 신경망(RNN, Recurrent Boltzmann Machine), 제한 볼츠만 머신 (RBM, Restricted Boltzmann Machine), 심층 신뢰 신경망(DBN, deep belief networks), 심층 Q-네트워크(Deep Q-Network)와 같은 다양한 딥 러닝 기법들을 포함할 수 있다. 주행 제어 장치는 프로세서로부터의 제어 신호에 응답하여 차량의 속도를 가변하기 위한 것으로, 엔 진 제어기, 제동 제어기 및 변속 제어기(Transmission Control Module)를 포함할 수 있다. 엔진 제어기는 차량의 엔진을 제어하는 액추에이터로, 차량의 가속을 제어한다. 엔진 제어기는 EMS(Engine Management System)으로 구현될 수 있다. 엔진 제어기는 가속 페달 위치 센서로부터 출력되는 가속 페달 위치 정보에 따라 엔진의 구동토크를 제어한다. 엔진 제어기는 자율주행시 프로세서로부터 요청받은 차량의 주행속도를 추종하기 위해 엔진 출력을 제어한다. 제동 제어기는 차량의 감속을 제어하는 액추에이터로, 전자식 주행 안정화 컨트롤(Electronic Stability Control, ESC)로 구현될 수 있다. 제동 제어기는 프로세서로부터 요청받은 목표 속도를 추종하기 위해 제동 압력을 제어한다. 즉, 제동 제어기는 차량의 감속을 제어한다. 변속 제어기는 차량의 변속기를 제어하기 위한 액추에이터로, 전기식 시프터(Shift By Wire, SBW)로 구현될 수 있다. 변속 제어기는 기어 위치 및 기어 상태 범위에 따라 차량의 변속을 제어한다. 알람부는 차량의 주행 상태를 운전자에게 알리기 위한 것으로, 디스플레이, 스피커 또는 스티어링 휠과 결 합된 햅틱 장치들 중에서 적어도 어느 하나를 이용할 수 있다. 도 2는 본 발명의 실시 예에 의한 차량 제어 방법을 설명하기 위한 순서도이다. 도 2를 참조하여 본 발명의 실 시 예에 의한 차량 제어 방법을 살펴보면 다음과 같다. S210에서, 프로세서는 차량의 변속을 위한 속도 제어 명령을 감지할 수 있다. 프로세서는 BPS 신호 및 APS 신호를 바탕으로, 속도 제어 명령을 감지할 수 있다. 예를 들어, 프로세서 는 단위 시간 내에 BPS 신호의 변화량이 제1 임계값 이상인 경우 감속을 위한 속도 제어 명령이 입력된 것 을 감지할 수 있다. 또한, 프로세서는 단위 시간 내에 APS 신호의 변화량이 제2 임계값 이상인 경우 가속 을 위한 속도 제어 명령이 입력된 것을 감지할 수 있다. S220에서, 프로세서는 속도 제어 명령을 수행할 경우, 차량과의 거리가 짧아지는 타겟 차량을 검출할 수 있다. 예를 들어, BPS 신호에 의해서 차량이 감속할 경우, 감속된 차량은 후방 차량과의 거리가 짧아지기 때문에, 후 방 차량을 타겟 차량으로 검출할 수 있다. 또는, APS 신호에 의해서 차량이 가속할 경우, 가속된 차량은 전방 차량과의 거리가 짧아지기 때문에, 전방 차량을 타겟 차량으로 검출할 수 있다. S230에서, 프로세서는 차량이 타겟 차량과의 거리가 멀어지는 속도로 주행 중일 경우, 변속 기간 동안 타 겟 속도에 도달하도록 차량 속도를 변속할 수 있다. 예를 들어, 타겟 차량이 후방 차량일 경우, 차량의 속도가 후방 차량 보다 빠를 경우, 프로세서는 차량이 타겟 차량과의 거리가 멀어지는 속도로 주행 중이라고 판단할 수 있다. 또는, 타겟 차량이 전방 차량일 경우, 차량의 속도가 전방 차량 보다 느릴 경우, 프로세서는 차량이 타겟 차량과의 거리가 멀어지는 속도로 주행 중이라고 판단할 수 있다. 타겟 속도는 타겟 차량의 속도에 대응하며, 예를 들어 타겟 차량의 속도와 미리 설정된 임계 속도 이하의 범위 내에서 설정될 수 있다. 프로세서는 차량 속도를 타겟 속도로 제어하여, 차량은 타겟 차량과 상대 속도가 임계 속도 이하가 될 수 있다. 임계 속도는 차량과 타겟 차량의 속도가 비슷한 속도를 유지할 수 있는 수준으로 결정될 수 있으며, 예를 들어, 0에 가까운 수치로 결정될 수 있다. 예를 들어, 타겟 차량이 후방 차량일 경우, 프로세서는 차량의 속도를 타겟 속도까지 감속할 수 있다. 또 는 타겟 차량이 전방 차량일 경우, 프로세서는 차량의 속도를 타겟 속도까지 가속할 수 있다. S240에서, 프로세서는 변속 기간 이후, 속도 제어 명령을 제한하여 타겟 속도를 유지할 수 있다. 예를 들어, BPS 신호가 차량을 타겟 속도 이하의 속도로 감속시키는 제동량을 요청하는 것일 경우에도, 프로세 서는 BPS 신호의 크기를 무시하고 타겟 속도를 유지할 수 있다. 또는 APS 신호가 차량을 타겟 속도 이상으로 가속시키는 가속량을 요청하는 것일 경우에도, 프로세서는 APS 신호의 크기를 무시하고 타겟 속도를 유지할 수 있다. 도 3은 본 발명의 다른 실시 예에 의한 차량 제어 방법을 설명하는 순서도이다. 도 3은 급감속 제어 명령에 대 응하여 차량을 제어하는 방법을 도시하고 있다. 도 4 내지 도 9는 도 3에 도시된 제어 방법을 설명하는 도면이다. 도 3 내지 도 9를 참조하여, 본 발명의 다른 실시 예에 의한 차량 제어 방법을 살펴보면 다음과 같다. S301에서, 프로세서는 자동 차선 유지 시스템(Automated Lane Keeping systems; ALKS)이 동작 중인지를 판단할 수 있다. ALKS 시스템이 동작하지 않는 경우, 차량은 운전자의 조작을 바탕으로 감속되거나 가속될 수 있다. S302 및 S303에서, 프로세서는 전방 차량 및 후방 차량을 검출할 수 있다. 도 4는 후방 차량 및 충돌 위험이 없는 전방 차량을 설명하는 도면이다. 도 4를 참조하면, 프로세서는 센서부를 통해서 획득된 데이터를 바탕으로 차량(VEH)의 후방 차량(RV) 을 검출할 수 있다. 도 4에 도시된 차량(VEH)은 본 발명의 실시 예에 의한 차량 제어를 수행하는 차량을 의미할 수 있다. 도 3에 도시된 급감속에 대응하는 실시 예에서, 후방 차량(RV)은 차량(VEH)이 타겟 속도로 제어되는 기준을 제공하는 타겟 차량일 수 있다. 또한, 프로세서는 센서부를 통해서 획득된 데이터를 바탕으로 전방 차량(FV)을 검출할 수 있다. 또한, 프로세서는 센서부를 통해서 획득된 데이터 또는 V2X 통신을 통해서 획득된 데이터등을 바탕으로 차량 (VEH)과 전방 차량(FV) 간의 차간 시간 및 TTC를 계산할 수 있다. 프로세서는 차량(VEH)과 전방 차량(FV) 간의 차간 시간이 일정 수준 이상이며, 차량(VEH)과 전방 차량(FV) 간의 차간 시간이 일정 수준 이상일 경우에, 차량(VEH)과 전방 차량(FV) 간의 충돌 위험이 없다고 판단할 수 있 다. 프로세서는 후방 차량이 존재하고, 전방 차량과의 충돌 위험이 없을 경우, 후술하는 S304 이후의 절차를 진행할 수 있다. 후방 차량이 없을 경우에는 BPS 신호를 바탕으로 급감속을 수행하여도 후방 차량과의 충돌 가능성이 없기 때문 에, 프로세서는 BPS 신호에 응답하여 차량을 감속시킬 수 있다. 또한, 전방 차량과의 충돌 위험이 있는 경 우, 급감속을 요청하는 BPS 신호는 운전자의 의도라고 판단될 수 있기 때문에, 프로세서는 BPS 신호에 응 답하여 차량을 감속시킬 수 있다. 즉, 후방 차량이 없거나, 전방 차량과의 충돌 위험이 있는 경우에는 운전자에 의한 급감속을 수행하여도 무방하기 때문에, 후술하는 절차를 진행하지 않을 수 있다. 따라서, S303 이후의 절차는 후방 차량이 존재하고, 전방 차량과의 충돌 위험이 없는 상태에서 급감속을 요구하 는 차속 제어 명령에 대응하는 절차들일 수 있다. 또한, S301 단계 내지 S303 단계는 후술하는 S304 단계 이후에 진행될 수도 있다. S304에서, 프로세서는 단위 시간 내에 BPS 신호의 변화량을 바탕으로, 급감속이 요청되는지를 판단할 수 있다. 도 5는 급감속을 요청하는 속도 제어 명령을 판단하는 방법을 설명하는 도면이다. 도 5를 참조하면, 프로세서는 단위 시간(d1) 내에 BPS 신호의 변화량이 제1 임계값(Th1) 이상이 되는 경우, 급감속을 요청하는 속도 제어 명령이 입력된 것으로 판단할 수 있다. S305에서, 프로세서는 알람부를 통해서 알람을 송출할 수 있다. S305 단계는 S309와 S311 단계 사이에서 진행될 수도 있다. 예를 들어, 프로세서는 디스플레이에 S309의 절차가 진행될 경우, BPS 신호에 의한 제동량이 제한된다는 안내 메시지를 표시할 수 있다. 또는, 프로세서는 스피커를 통해서 사운드를 출력하거나 햅틱 장치의 진동을 통해서 급제동이 인식되는 사 실 또는 급제동을 요청하는 제동량이 제한되는 사실을 알릴 수 있다. S306 및 S307에서, 프로세서는 차량 속도가 후방 차량의 속도 이상인 경우, 차량과 후방 차량 간의 상대 속도가 임계 속도 이하가 되도록 제어할 수 있다. S308 및 S309에서, 프로세서는 타겟 차량(VEH)을 기준으로 차량(VEH)의 상대 속도가 임계 속도 이하에 도 달하면, 차량(VEH)의 속도를 타겟 속도로 유지할 수 있다. S306 단계 내지 S309 단계를 도 6 및 도 7을 참조하여 설명하면 다음과 같다. 도 6은 후방 차량 보다 빠른 속도로 주행하는 차량을 도시한 도면이고, 도 7은 후방 차량 보다 빠른 차량의 속 도를 제어하는 방법을 설명하는 도면이다. 도 6을 참조하면, 차량(VEH)이 타겟 차량에 해당하는 후방 차량(RV) 보다 빠른 경우, 프로세서는 BPS 신호 에 응답하여 차량(VEH)의 속도를 타겟 속도까지 낮출 수 있다. 예를 들어, 도 7에서와 같이, 프로세서는 급감속을 판단한 제1 타이밍(t1)에서부터 제3 타이밍(t3)까지의 변속 기간 동안, 차량(VEH)의 속도를 타겟 속도에 도달하도록 제동량을 조절할 수 있다. 프로세서는 변속 기간 중에서 제2 타이밍(t2)까지는 제동량을 일정하게 증가시킬 수 있다. 그리고 프로세서는 제2 타이밍 (t2)부터 제3 타이밍(t3)까지는 제동량의 크기를 줄이면서 차량(VEH)을 타겟 속도로 제어하여, 급격한 속도 변 화로 운전자가 불편함을 느끼는 것을 줄일 수 있다. 또한, 제3 타이밍(t3)이후, BPS 신호가 0 이상의 값으로 출력되어도, 프로세서는 제동량을 제한할 수 있다. S306 단계는 차량(VEH)과 타겟 차량인 후방 차량(RV) 간의 차간 시간을 확인하는 절차를 포함할 수 있고, S307 단계 내지 S309 단계는 차량(VEH)과 후방 차량(RV) 간의 차간 시간이 임계 시간 이상인 경우에 진행될 수 있다. S310에서, 프로세서는 BPS 신호가 0인지를 판단할 수 있다. BPS 신호가 0이 아닐 경우, 프로세서는 S306의 절차로 되돌아갈 수 있다. 즉 브레이크 페달에 외력이 지속 적으로 가해질 경우, 프로세서는 제동량을 조절하여 차량(VEH)의 속도를 타겟 속도로 유지하는 절차를 반 복할 수 있다. BPS 신호가 0으로 출력된 이후, S311에서 프로세서는 일정 시간 내에서 BPS 신호가 다시 감지되는지를 모 니터링할 수 있다. 일정 시간 내에 BPS 신호가 다시 감지될 경우, 즉, 브레이크 페달에 외력이 다시 가해진 것으로 판단될 경우, S312에서 프로세서는 ALKS 동작 모드를 해제하고, 운전자에게 차량(VEH)의 제어권을 전달할 수 있다. S306 단계에서 차량(VEH)의 속도가 후방 차량(RV)의 속도 미만인 경우, S313 및 S314에서, 프로세서는 BPS 신호가 감지된 것을 무시하고, 주행 중인 차량(VEH)의 제어 상태를 유지할 수 있다. S313 및 S314 단계는 차량 (VEH)의 속도가 후방 차량(RV) 보다 느린 상태에서 제동이 수행되어 후방 차량(RV)과의 충돌 위험이 발생하는 것을 방지하기 위한 것이다. S313 단계 및 S314 단계를 도 8 및 도 9를 참조하여 설명하면 다음과 같다. 도 8은 후방 차량 보다 느린 속도로 주행하는 차량을 도시한 도면이고, 도 9는 후방 차량 보다 느린 차량의 속 도를 제어하는 방법을 설명하는 도면이다. 도 8을 참조하면, 차량(VEH)이 타겟 차량에 해당하는 후방 차량(RV) 보다 느리거나 동일한 속도일 경우, 프로세 서는 BPS 신호를 무시하여 차량(VEH)에 제동을 수행하지 않을 수 있다. 즉, 도 9에서와 같이, 프로세서는 제1 타이밍(t1)에서 급감속을 판단한 경우에도, 차량의 제동을 수행하지 않을 수 있다. S306 단계는 차량(VEH)과 타겟 차량인 후방 차량(RV) 간의 차간 시간을 확인하는 절차를 포함할 수 있고, S313 단계 내지 S314 단계는 차량(VEH)과 후방 차량(RV) 간의 차간 시간이 임계 시간 미만인 경우에 진행될 수 있다. 또한, 도 3의 순서도에는 도시되지 않았지만 S303 단계는 충돌 위험이 있는 전방 위험 차량을 검출하는 절차를 포함할 수 있다. 프로세서는 전방의 차량들 중에서 차간 시간이 임계 시간 이내이고, TTC가 다른 임계 시 간 이내인 차량을 전방 위험 차량으로 검출할 수 있다. 프로세서는 전방 위험 차량을 검출한 상태에서 차량의 급제동이 요청될 경우, S312의 절차를 수행하여 차 량(VEH)을 제동시킬 수 있다. 전방 위험 차량이 있는 상태에서 차량의 급제동이 요청되는 것은 전방 위험 차량 과의 충돌을 회피하기 위한 조작이라고 판단될 수 있기 때문이다. 도 10은 본 발명의 다른 실시 예에 의한 차량 제어 방법을 설명하는 순서도이다. 도 10은 급가속 제어 명령에 대응하여 차량을 제어하는 방법을 도시하고 있다. 도 11 내지 도 16는 도 10에 도시된 제어 방법을 설명하는 도면이다. 도 10 내지 도 16을 참조하여, 본 발명의 다른 실시 예에 의한 차량 제어 방법을 살펴보면 다음과 같다. S1001에서, 프로세서는 자동 차선 유지 시스템(Automated Lane Keeping systems; ALKS)이 동작 중인지를 판단할 수 있다. ALKS 시스템이 동작하지 않는 경우, 차량은 운전자의 조작을 바탕으로 감속되거나 가속될 수 있다. S1002 및 S1003에서, 프로세서는 전방 차량 및 후방 차량을 검출할 수 있다. 도 11은 전방 차량 및 충돌 위험이 없는 후방 차량을 설명하는 도면이다. 도 11을 참조하면, 프로세서는 센서부를 통해서 획득된 데이터를 바탕으로 차량(VEH)의 전방 차량(F V)을 검출할 수 있다. 도 11에 도시된 차량(VEH)은 본 발명의 실시 예에 의한 차량 제어를 수행하는 차량을 의 미할 수 있다. 도 11에 도시된 급가속에 대응하는 실시 예에서, 전방 차량(FV)은 차량(VEH)이 타겟 속도로 제어 되는 기준을 제공하는 타겟 차량일 수 있다. 또한, 프로세서는 센서부를 통해서 획득된 데이터를 바탕으로 후방 차량(RV)을 검출할 수 있다. 또한, 프로세서는 센서부를 통해서 획득된 데이터 또는 V2X 통신을 통해서 획득된 데이터 등을 바탕으로 차 량(VEH)과 후방 차량(RV) 간의 차간 시간 및 TTC를 계산할 수 있다. 프로세서는 차량(VEH)과 후방 차량(RV) 간의 차간 시간이 일정 수준 이상이며, 차량(VEH)과 후방 차량(RV) 간의 차간 시간이 일정 수준 이상일 경우에, 차량(VEH)과 전방 차량(FV) 간의 충돌 위험이 없다고 판단할 수 있 다. 프로세서는 전방 차량(FV)이 존재하고, 후방 차량(RV)과의 충돌 위험이 없을 경우, 후술하는 S1004 이후의 절차를 진행할 수 있다. 전방 차량이 없을 경우에는 APS 신호를 바탕으로 급가속을 수행하여도 전방 차량과의 충돌 가능성이 없기 때문 에, 프로세서는 APS 신호에 응답하여 차량을 가속시킬 수 있다. 또한, 후방 차량과의 충돌 위험이 있는 경 우, 급가속을 요청하는 APS 신호는 운전자의 의도라고 판단될 수 있기 때문에, 프로세서는 APS 신호에 응 답하여 차량을 가속시킬 수 있다. 즉, 전방 차량(FV)이 없거나, 후방 차량(RV)과의 충돌 위험이 있는 경우에는 운전자에 의한 급가속을 수행하여도 무방하기 때문에, 후술하는 절차를 진행하지 않을 수 있다. 따라서, S1003 이후의 절차는 전방 차량(FV)이 존재하고, 후방 차량(RV)과의 충돌 위험이 없는 상태에서 급가속 을 요구하는 차속 제어 명령에 대응하는 절차들일 수 있다. 또한, S1001 단계 내지 S1003 단계는 후술하는 S1004 단계 이후에 진행될 수도 있다. S1004에서, 프로세서는 APS 신호의 변화량을 바탕으로 급가속이 요청되는지를 판단할 수 있다. 도 12는 급가속을 요청하는 속도 제어 명령을 판단하는 방법을 설명하는 도면이다. 도 12를 참조하면, 프로세서는 단위 시간(d2) 내에 APS 신호의 변화량이 제2 임계값(Th2) 이상이 되는 경 우, 급가속을 요청하는 속도 제어 명령이 입력된 것으로 판단할 수 있다. S1005에서, 프로세서는 알람부를 통해서 알람을 송출할 수 있다. S1005 단계는 S1009와 S1011 단계 사이에서 진행될 수도 있다. 예를 들어, 프로세서는 디스플레이에 S1009 의 절차가 진행될 경우, APS 신호에 의한 가속량이 제한된다는 안내 메시지를 표시할 수 있다. 또는, 프로세서는 스피커를 통해서 사운드를 출력하거나 햅틱 장치의 진동을 통해서 급가속이 인식되는 사 실 또는 급가속을 요청하는 가속량이 제한되는 사실을 알릴 수 있다. S1006 및 S1007에서, 프로세서는 차량의 속도가 타겟 차량인 전방 차량의 속도 이상인 경우, 차량과 전방 차량 간의 상대 속도가 임계 속도 이하가 되도록 제어할 수 있다. S1008 및 S1009에서, 프로세서는 타겟 차량(VEH)을 기준으로 차량(VEH)의 상대 속도가 임계 속도 이하에 도달하면, 차량(VEH)의 속도를 타겟 속도로 유지할 수 있다. S1006 단계 내지 S1009 단계를 도 13 및 도 14를 참조하여 설명하면 다음과 같다. 도 13은 전방 차량 보다 느린 속도로 주행하는 차량을 도시한 도면이고, 도 14은 전방 차량 보다 느린 차량의 속도를 제어하는 방법을 설명하는 도면이다. 도 13을 참조하면, 차량(VEH)이 타겟 차량에 해당하는 전방 차량(FV) 보다 느릴 경우, 프로세서는 APS 신 호에 응답하여 차량(VEH)의 속도를 타겟 속도까지 가속할 수 있다. 예를 들어, 도 14에서와 같이, 프로세서는 급가속을 판단한 제1 타이밍(t1)에서부터 제3 타이밍(t3)까지의 변속 기간 동안, 차량(VEH)의 속도를 타겟 속도에 도달하도록 가속량을 조절할 수 있다. 프로세서는 변속 기간 중에서 제2 타이밍(t2)까지는 가속량을 일정하게 증가시킬 수 있다. 그리고 프로세서는 제2 타이밍 (t2)부터 제3 타이밍(t3)까지는 가속량의 크기를 줄이면서 차량(VEH)을 타겟 속도로 제어하여, 급격한 속도 변 화로 운전자가 불편함을 느끼는 것을 줄일 수 있다. 또한, 제3 타이밍(t3)이후, APS 신호가 0 이상의 값으로 출력되어도, 프로세서는 가속량을 제한할 수 있다. S1006 단계는 차량(VEH)과 타겟 차량인 전방 차량(FV) 간의 차간 시간을 확인하는 절차를 포함할 수 있고, S1007 단계 내지 S1009 단계는 차량(VEH)과 전방 차량(FV) 간의 차간 시간이 임계 시간 이상인 경우에 진행될 수 있다. S1010에서, 프로세서는 APS 신호가 0인지를 판단할 수 있다. APS 신호가 0이 아닐 경우, 프로세서는 S1006의 절차로 되돌아갈 수 있다. 즉 가속 페달에 외력이 지속적 으로 가해질 경우, 프로세서는 가속량을 조절하여 차량(VEH)의 속도를 타겟 속도로 유지하는 절차를 반복 할 수 있다. APS 신호가 0으로 출력된 이후, S1011에서 프로세서는 일정 시간 내에서 APS 신호가 다시 감지되는지를 모 니터링할 수 있다. 일정 시간 내에 APS 신호가 다시 감지될 경우, 즉, 가속 페달에 외력이 다시 가해진 것으로 판단될 경우, S1012 에서 프로세서는 ALKS 동작 모드를 해제하고, 운전자에게 차량(VEH)의 제어권을 전달할 수 있다. S1006 단계에서 차량(VEH)의 속도가 전방 차량(FV)의 속도 이상인 경우, S1013 및 S1014에서, 프로세서는 APS 신호가 감지된 것을 무시하고, 주행 중인 차량(VEH)의 제어 상태를 유지할 수 있다. S1013 및 S1014 단계는 차량(VEH)의 속도가 전방 차량(FV) 보다 빠른 상태에서 가속하여 전방 차량(FV)과의 충돌 위험이 발생하는 것을 방지하기 위한 것이다. S1013 단계 및 S1014 단계를 도 15 및 도 16을 참조하여 설명하면 다음과 같다. 도 15는 전방 차량 이상의 속도로 주행하는 차량을 도시한 도면이고, 도 16은 전방 차량 이상의 속도의 속도를 갖는 차량의 속도를 제어하는 방법을 설명하는 도면이다. 도 15를 참조하면, 차량(VEH)이 타겟 차량에 해당하는 전방 차량(FV)의 속도 이상일 경우, 프로세서는 APS 신호를 무시하여 차량(VEH)을 가속하지 않을 수 있다. 즉, 도 16에서와 같이, 프로세서는 제1 타이밍(t1)에서 급가속을 판단한 경우에도, 차량을 가속하지 않을 수 있다. S1006 단계는 차량(VEH)과 타겟 차량인 전방 차량(FV) 간의 차간 시간을 확인하는 절차를 포함할 수 있고, S1013 단계 내지 S1014 단계는 차량(VEH)과 전방 차량(FV) 간의 차간 시간이 임계 시간 미만인 경우에 진행될 수 있다. 또한, 도 10의 순서도에는 도시되지 않았지만 S1003 단계는 충돌 위험이 있는 후방 위험 차량을 검출하는 절차 를 포함할 수 있다. 프로세서는 후방의 차량들 중에서 차간 시간이 임계 시간 이내이고, TTC가 다른 임계 시간 이내인 차량을 후방 위험 차량으로 검출할 수 있다. 프로세서는 후방 위험 차량을 검출한 상태에서 차량의 급가속이 요청될 경우, S1012의 절차를 수행하여 차 량(VEH)을 가속시킬 수 있다. 후방 위험 차량이 있는 상태에서 차량의 급가속이 요청되는 것은 후방 위험 차량 과의 충돌을 회피하기 위한 조작이라고 판단될 수 있기 때문이다. 도 17은 본 발명의 일 실시 예에 따른 컴퓨팅 시스템을 도시한다. 도 17을 참조하면, 컴퓨팅 시스템은 버스를 통해 연결되는 적어도 하나의 프로세서, 메모리 , 사용자 인터페이스 입력 장치, 사용자 인터페이스 출력 장치, 스토리지, 및 네트워 크 인터페이스를 포함할 수 있다. 프로세서는 중앙 처리 장치(CPU) 또는 메모리 및/또는 스토리지에 저장된 명령어들에 대한 처리를 실행하는 반도체 장치일 수 있다. 프로세서는 도 1에 도시된 프로세서의 적어도 일부의 기능 을 포함할 수 있다. 메모리 및 스토리지는 다양한 종류의 휘발성 또는 불휘발성 저장 매체를 포함 할 수 있다. 예를 들어, 메모리는 ROM(Read Only Memory) 및 RAM(Random Access Memory)을 포함할 수 있 다. 따라서, 본 명세서에 개시된 실시예들과 관련하여 설명된 방법 또는 알고리즘의 단계는 프로세서에 의해 실행되는 하드웨어, 소프트웨어 모듈, 또는 그 2 개의 결합으로 직접 구현될 수 있다. 소프트웨어 모듈은 RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터, 하드 디스크, 착탈형 디스크, CD-ROM과 같은 저장 매체(즉, 메모리 및/또는 스토리지)에 상주할 수도 있다. 예시적인 저장 매체는 프로세서에 커플링되며, 그 프로세서는 저장 매체로부터 정보를 판독할 수 있고 저장 매체에 정보를 기입할 수 있다. 다른 방법으로, 저장 매체는 프로세서와 일체형일 수도 있다. 프로세서 및 저장 매체는 주문형 집적회로(ASIC) 내에 상주할 수도 있다. ASIC는 사용자 단말기 내에 상주할 수 도 있다. 다른 방법으로, 프로세서 및 저장 매체는 사용자 단말기 내에 개별 컴포넌트로서 상주할 수도 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위 에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0175198", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 의한 차량 제어 장치의 구성을 나타내는 블록도이다. 도 2는 본 발명의 실시 예에 의한 차량 제어 방법을 설명하기 위한 순서도이다. 도 3은 본 발명의 다른 실시 예에 의한 차량 제어 방법을 설명하는 순서도이다. 도 4는 후방 차량 및 충돌 위험이 없는 전방 차량을 설명하는 도면이다.도 5는 급감속을 요청하는 속도 제어 명령을 판단하는 방법을 설명하는 도면이다. 도 6은 후방 차량 보다 빠른 속도로 주행하는 차량을 도시한 도면이다. 도 7은 후방 차량 보다 빠른 차량의 속도를 제어하는 방법을 설명하는 도면이다. 도 8은 후방 차량 보다 느린 속도로 주행하는 차량을 도시한 도면이다. 도 9는 후방 차량 보다 느린 차량의 속도를 제어하는 방법을 설명하는 도면이다 도 10은 본 발명의 다른 실시 예에 의한 차량 제어 방법을 설명하는 순서도이다. 도 11은 전방 차량 및 충돌 위험이 없는 후방 차량을 설명하는 도면이다. 도 12는 급가속을 요청하는 속도 제어 명령을 판단하는 방법을 설명하는 도면이다. 도 13은 전방 차량 보다 느린 속도로 주행하는 차량을 도시한 도면이다. 도 14은 전방 차량 보다 느린 차량의 속도를 제어하는 방법을 설명하는 도면이다. 도 15는 전방 차량 이상의 속도로 주행하는 차량을 도시한 도면이다. 도 16은 전방 차량 이상의 속도의 속도를 갖는 차량의 속도를 제어하는 방법을 설명하는 도면이다. 도 17은 본 발명의 일 실시 예에 따른 컴퓨팅 시스템을 나타내는 도면이다."}
