{"patent_id": "10-2022-0079313", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0002096", "출원번호": "10-2022-0079313", "발명의 명칭": "모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치", "출원인": "계명대학교 산학협력단", "발명자": "이종하"}}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "욕창 진단 장치로서,산화 헤모글로빈과 헤모글로빈의 광 흡수 파장 차이를 이용하기 위해 서로 다른 2개의 파장을 갖는 광을 신체부위에 조사하는 광 조사부(100);상기 광 조사부(100)에서 조사된 광이 표피에서 반사되는 반사광을 측정하는 카메라부(200);상기 카메라부(200)에서 측정된 반사광을 이용해 상기 신체 부위의 산소포화도를 측정하고, 상기 신체 부위의산소포화도 분포도를 작성하는 산소포화도 분석부(300);상기 산소포화도 분포도를 기반으로 상기 신체 부위의 표피의 혈류량 맵을 작성하는 혈류량 분석부(400); 및학습 완료된 인공지능 모델을 사용해 상기 혈류량 맵으로부터 욕창을 진단하는 욕창 진단부(500)를 포함하는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단장치."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 광 조사부(100)는,서로 다른 파장의 광을 조사하는 2종류의 광원부(110);상기 2종류의 광원부(110)가 번갈아 배치되는 몸체부(120); 및상기 2종류의 광원부(110)의 광 조사를 제어하는 제어부(130)를 포함하는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 몸체부(120)는,둘 이상의 동심원상에 상기 2종류의 광원부(110)가 번갈아 배치되는 것을 특징으로 하는, 모바일 카메라(20)로혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 몸체부(120)는,상기 2종류의 광원부(110)가 배치된 동심원의 중심 부분에 상기 카메라부(200)의 렌즈가 위치하도록 홀이 형성된 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창진단 장치."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 광 조사부(100)는,상기 몸체부(120)에 형성된 홀에 상기 카메라부(200)의 렌즈가 위치하여 상기 신체 부위의 촬영이 가능하도록모바일 카메라(20)에 결합되는 결합부(140)를 더 포함하는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양공개특허 10-2024-0002096-3-을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 결합부(140)는,상기 모바일 카메라(20)에 탈착 가능하도록 탈착식으로 구성되는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서, 상기 산소포화도 분석부(300)는,상기 2종류의 광원부(110)에서 조사된 광이 표피에서 흡수 후 반사되는 반사광의 차이를 이용해 산소포화도를측정하는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 욕창 진단부(500)는,혈류량 맵을 입력 정보로 하고 욕창 진행 등급을 출력 정보로 하는 상기 학습 완료된 인공지능 모델을사용하며, 상기 혈류량 맵으로부터 상기 욕창 진행 등급을 판정하는 것을 특징으로 하는, 모바일 카메라(20)로혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "욕창 진단 시스템으로서,산화 헤모글로빈과 헤모글로빈의 광 흡수 파장 차이를 이용하기 위해 서로 다른 2개의 파장을 갖는 광을 신체부위에 조사하는 광 조사 장치(10);상기 광 조사 장치(10)에서 조사된 광이 표피에서 반사되는 반사광을 측정하는 모바일 카메라(20); 및상기 모바일 카메라(20)에서 측정된 반사광을 이용해 상기 신체 부위의 산소포화도 및 혈류량을 분석하고, 욕창을 진단하여 출력하는 사용자 장치(30)를 포함하며,상기 사용자 장치(30)는,상기 모바일 카메라(20)에서 측정된 반사광을 이용해 상기 신체 부위의 산소포화도를 측정하고, 상기 신체 부위의 산소포화도 분포도를 작성하는 산소포화도 분석부(300);상기 산소포화도 분포도를 기반으로 상기 신체 부위의 표피의 혈류량 맵을 작성하는 혈류량 분석부(400); 및학습 완료된 인공지능 모델을 사용해 상기 혈류량 맵으로부터 욕창 진행 등급을 판정하는 욕창 진단부(500)를포함하는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 광 조사 장치(10)는,서로 다른 파장의 광을 조사하는 2종류의 광원부(110);상기 2종류의 광원부(110)가 번갈아 배치되는 몸체부(120); 및공개특허 10-2024-0002096-4-상기 2종류의 광원부(110)의 광 조사를 제어하는 제어부(130)를 포함하는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 몸체부(120)는,둘 이상의 동심원상에 상기 2종류의 광원부(110)가 번갈아 배치되는 것을 특징으로 하는, 모바일 카메라(20)로혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 몸체부(120)는,상기 2종류의 광원부(110)가 배치된 동심원의 중심 부분에 상기 모바일 카메라(20)의 렌즈가 위치하도록 홀이형성된 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반욕창 진단 시스템."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 광 조사 장치(10)는,상기 몸체부(120)에 형성된 홀에 상기 모바일 카메라(20)의 렌즈가 위치하여 상기 신체 부위의 촬영이 가능하도록 결합되는 결합부(140)를 더 포함하는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 결합부(140)는,상기 모바일 카메라(20)에 탈착 가능하도록 탈착식으로 구성되는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서, 상기 산소포화도 분석부(300)는,상기 2종류의 광원부(110)에서 조사된 광이 표피에서 흡수 후 반사되는 반사광의 차이를 이용해 산소포화도를측정하는 것을 특징으로 하는, 모바일 카메라(20)로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템."}
{"patent_id": "10-2022-0079313", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항에 있어서, 상기 욕창 진단부(500)는,혈류량 맵을 입력 정보로 하고 욕창 진행 등급을 출력 정보로 하는 상기 학습 완료된 인공지능 모델을사용하며, 상기 혈류량 맵으로부터 상기 욕창 진행 등급을 판정하는 것을 특징으로 하는, 모바일 카메라(20)로혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템."}
{"patent_id": "10-2022-0079313", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치에 관한 것으로서, 보다 구체적으로는 욕창 진단 장치로서, 산화 헤모글로빈과 헤모글로빈의 광 흡수 파장 차이를 이용하 기 위해 서로 다른 2개의 파장을 갖는 광을 신체 부위에 조사하는 광 조사부; 상기 광 조사부에서 조사된 광이 (뒷면에 계속)"}
{"patent_id": "10-2022-0079313", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 욕창 진단 장치 및 시스템에 관한 것으로서, 보다 구체적으로는 모바일 카메라로 혈류의 양을 측정하 여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0079313", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "욕창(Pressure Ulcer, Pressure Sore, 압박궤양)이란, 오랫동안의 부동자세로 인해 신체 한 부위에 압력을 지속 해서 받으면 그 부위에 혈액순환 장애가 오고 산소와 영양공급이 부족하여 압력을 받는 부위의 피부, 피하지방, 근육의 허혈로 인하여 발생하는 피부 손상을 의미한다. 대개 중증 환자가 오래 병상에 누워있을 때 바닥에 직 접 닿는 부위에 생기는 압박 괴사이다. 오랫동안 움직임이 없는 경우, 뼈가 튀어나온 부위의 피부가 눌려 혈액 순환이 되지 않아 산소 부족으로 인해 피부가 죽고, 썩어서 욕창이 생기게 된다. 욕창은 어느 부위에서나 발생할 수 있으나 주로 엉치뼈, 넓적다리뼈의 큰 돌기, 무릎뼈, 발꿈치, 정강이뼈 등의 뼈 돌출부와 같이 압박이 많이 가해지는 부위에서 자주 발생한다. 욕창의 초기에는 압력을 받는 부위의 피부가 붉어지고, 이어서 그 부위의 피부에 오려낸 듯한 궤양이 생기며, 더 나아가 피부의 괴사가 진행되게 된다. 도 1은 단계별 분류에 따른 욕창을 도시한 도면이다. 도 1에 도시된 바와 같이 욕창은 4단계의 과정을 거친다. 욕창 1단계에서는, 피부 손상은 관찰되지 않으나 피부가 따듯하고 단단하다. 압력을 제거한 후 5분이 지나도 계속 피부가 붉은색을 띠게 된다. 압력이 완화되면 원래 상태로 회복되며 체위 변경으로 회복될 수 있다. 욕 창 2단계에서는, 피부가 파열되어 찰과상과 물집 등이 나타난다. 부종이 심하고 지방층까지 침범하면 통증이 발생한다. 이 경우 압력이 완화되면 1~2주 이내에 회복될 수 있다. 욕창 3단계에서는 피하조직까지 괴사가 일 어나 악취를 동반한 삼출물이 나타난다. 통증은 없으나 부종이 심하고 괴사조직이 관찰되며, 이 괴사조직을 제 거하고 회복하는 데 수개월이 걸리게 된다. 욕창 4단계에서는, 근육, 뼈, 지지조직(건, 관절) 등의 광범위한 조직 괴사가 일어난다. 괴사조직을 볼 수 있으며 수술적인 치료(피부이식, 피판술 등)가 필요하다. 욕창은 전체 환부가 일정한 손상을 입기보다는 부분적으로 욕창의 정도가 다르게 나타난다. 즉, 동일한 환부라 도 부위에 따라 1단계에서 4단계까지의 다양한 형태를 보인다. 따라서, 동일한 환부라도 적절한 처치와 치료 방법이 요구된다. 특히, 욕창은 환부의 크기와 정도가 다양하게 나타나므로, 이에 대한 정확한 진단과 그에 맞 는 치료의 적용이 필요하다. 이같이 욕창 단계의 진단에는 명확한 기준이 있지만, 진단의 대부분이 의사의 육안에 의한 위험평가시스템에 따 른 확인으로 결정되고 있다. 이는 경험에 의한 진단으로 진단자에 따라 상이한 진단 내용을 나타낼 수 있다. 진단자의 경험에 의존하는 종래의 방법은 오진의 확률을 가지고 있어 욕창의 등급에 대한 표준화된 데이터 기반 의 진단 시스템이 필요하다. 본 발명과 관련된 선행특허로, 공개특허 제10-2012-0072701호(발명의 명칭: 욕창 관리 장치 및 방법, 공개일자: 2012년 07월 04일) 등이 개시된 바 있다."}
{"patent_id": "10-2022-0079313", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존에 제안된 방법들의 상기와 같은 문제점들을 해결하기 위해 제안된 것으로서, 서로 다른 2개의 파장을 갖는 광을 신체 부위에 조사하고, 신체 부위에서 반사되는 광을 모바일 카메라로 촬영하여 산소포화도 분포도 및 혈류량 맵을 작성해 욕창을 진단함으로써, 산화 헤모글로빈과 헤모글로빈의 광 흡수 파장 차이를 이 용해 혈류를 시각화하여 욕창 발생으로 인한 피부 이상을 객관적으로 감지할 수 있으며, 표준화된 데이터를 기 반으로 욕창을 진단할 수 있는, 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반욕창 진단 장치 및 시스템을 제공하는 것을 그 목적으로 한다."}
{"patent_id": "10-2022-0079313", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 특징에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치는, 욕창 진단 장치로서, 산화 헤모글로빈과 헤모글로빈의 광 흡수 파장 차이를 이용하기 위해 서로 다른 2개의 파장을 갖는 광을 신체 부위에 조사하는 광 조사부; 상기 광 조사부에서 조사된 광이 표피에서 반사되는 반사광을 측정하는 카메라부; 상기 카메라부에서 측정된 반사광을 이용해 상기 신체 부위의 산소포화도를 측정하고, 상기 신체 부위의 산소포 화도 분포도를 작성하는 산소포화도 분석부; 상기 산소포화도 분포도를 기반으로 상기 신체 부위의 표피의 혈류량 맵을 작성하는 혈류량 분석부; 및 학습 완료된 인공지능 모델을 사용해 상기 혈류량 맵으로부터 욕창을 진단하는 욕창 진단부를 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 광 조사부는, 서로 다른 파장의 광을 조사하는 2종류의 광원부; 상기 2종류의 광원부가 번갈아 배치되는 몸체부; 및 상기 2종류의 광원부의 광 조사를 제어하는 제어부를 포함할 수 있다. 더욱 바람직하게는, 상기 몸체부는, 둘 이상의 동심원상에 상기 2종류의 광원부가 번갈아 배치될 수 있다. 더더욱 바람직하게는, 상기 몸체부는, 상기 2종류의 광원부가 배치된 동심원의 중심 부분에 상기 카메라부의 렌즈가 위치하도록 홀이 형성될 수 있다. 더더더욱 바람직하게는, 상기 광 조사부는, 상기 몸체부에 형성된 홀에 상기 카메라부의 렌즈가 위치하여 상기 신체 부위의 촬영이 가능하도록 모바일 카메 라에 결합되는 결합부를 더 포함할 수 있다. 더욱더 바람직하게는, 상기 결합부는, 상기 모바일 카메라에 탈착 가능하도록 탈착식으로 구성될 수 있다. 더욱 바람직하게는, 상기 산소포화도 분석부는, 상기 2종류의 광원부에서 조사된 광이 표피에서 흡수 후 반사되는 반사광의 차이를 이용해 산소포화도를 측정할 수 있다. 바람직하게는, 상기 욕창 진단부는, 혈류량 맵을 입력 정보로 하고 욕창 진행 등급을 출력 정보로 하는 상기 학습 완료된 인공지능 모델을 사용하며, 상기 혈류량 맵으로부터 상기 욕창 진행 등급을 판정할 수 있다. 상기한 목적을 달성하기 위한 본 발명의 특징에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템은, 욕창 진단 시스템으로서, 산화 헤모글로빈과 헤모글로빈의 광 흡수 파장 차이를 이용하기 위해 서로 다른 2개의 파장을 갖는 광을 신체 부위에 조사하는 광 조사 장치; 상기 광 조사 장치에서 조사된 광이 표피에서 반사되는 반사광을 측정하는 모바일 카메라; 및 상기 모바일 카메라에서 측정된 반사광을 이용해 상기 신체 부위의 산소포화도 및 혈류량을 분석하고, 욕창을 진단하여 출력하는 사용자 장치를 포함하며, 상기 사용자 장치는, 상기 모바일 카메라에서 측정된 반사광을 이용해 상기 신체 부위의 산소포화도를 측정하고, 상기 신체 부위의 산소포화도 분포도를 작성하는 산소포화도 분석부; 상기 산소포화도 분포도를 기반으로 상기 신체 부위의 표피의 혈류량 맵을 작성하는 혈류량 분석부; 및 학습 완료된 인공지능 모델을 사용해 상기 혈류량 맵으로부터 욕창 진행 등급을 판정하는 욕창 진단부를 포함하 는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 광 조사 장치는, 서로 다른 파장의 광을 조사하는 2종류의 광원부; 상기 2종류의 광원부가 번갈아 배치되는 몸체부; 및 상기 2종류의 광원부의 광 조사를 제어하는 제어부를 포함할 수 있다. 더욱 바람직하게는, 상기 몸체부는, 둘 이상의 동심원상에 상기 2종류의 광원부가 번갈아 배치될 수 있다. 더더욱 바람직하게는, 상기 몸체부는, 상기 2종류의 광원부가 배치된 동심원의 중심 부분에 상기 모바일 카메라의 렌즈가 위치하도록 홀이 형성될 수 있다. 더더더욱 바람직하게는, 상기 광 조사 장치는, 상기 몸체부에 형성된 홀에 상기 모바일 카메라의 렌즈가 위치하여 상기 신체 부위의 촬영이 가능하도록 결합되 는 결합부를 더 포함할 수 있다. 더욱더 바람직하게는, 상기 결합부는, 상기 모바일 카메라에 탈착 가능하도록 탈착식으로 구성될 수 있다. 더욱 바람직하게는, 상기 산소포화도 분석부는, 상기 2종류의 광원부에서 조사된 광이 표피에서 흡수 후 반사되는 반사광의 차이를 이용해 산소포화도를 측정할 수 있다. 바람직하게는, 상기 욕창 진단부는, 혈류량 맵을 입력 정보로 하고 욕창 진행 등급을 출력 정보로 하는 상기 학습 완료된 인공지능 모델을 사용하며, 상기 혈류량 맵으로부터 상기 욕창 진행 등급을 판정할 수 있다."}
{"patent_id": "10-2022-0079313", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안하고 있는 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치 및 시스템에 따르면, 서로 다른 2개의 파장을 갖는 광을 신체 부위에 조사하고, 신체 부위에서 반사 되는 광을 모바일 카메라로 촬영하여 산소포화도 분포도 및 혈류량 맵을 작성해 욕창을 진단함으로써, 산화 헤 모글로빈과 헤모글로빈의 광 흡수 파장 차이를 이용해 혈류를 시각화하여 욕창 발생으로 인한 피부 이상을 객관 적으로 감지할 수 있으며, 표준화된 데이터를 기반으로 욕창을 진단할 수 있다."}
{"patent_id": "10-2022-0079313", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단 되는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 ‘연결’ 되어 있다고 할 때, 이는 ‘직접적으로 연결’ 되 어 있는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 ‘간접적으로 연결’ 되어 있는 경우도포함한다. 또한, 어떤 구성요소를 ‘포함’ 한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제 외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 도 2는 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치의 구성을 도시한 도면이다. 도 2에 도시된 바와 같이, 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치는, 산화 헤모글로빈 과 헤모글로빈의 광 흡수 파장 차이를 이용하기 위해 서로 다른 2개의 파장을 갖는 광을 신체 부위에 조사하는 광 조사부, 광 조사부에서 조사된 광이 표피에서 반사되는 반사광을 측정하는 카메라부, 카메라 부에서 측정된 반사광을 이용해 신체 부위의 산소포화도를 측정하고, 신체 부위의 산소포화도 분포도를 작 성하는 산소포화도 분석부, 산소포화도 분포도를 기반으로 신체 부위의 표피의 혈류량 맵을 작성하는 혈류 량 분석부, 및 학습 완료된 인공지능 모델을 사용해 혈류량 맵으로부터 욕창을 진단하는 욕창 진단부(50 0)를 포함하여 구성될 수 있다. 도 3은 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템의 구성을 도시한 도면이다. 도 3에 도시된 바와 같이, 본 발명의 일실시예에 따른 모바 일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 시스템은, 산화 헤모글 로빈과 헤모글로빈의 광 흡수 파장 차이를 이용하기 위해 서로 다른 2개의 파장을 갖는 광을 신체 부위에 조사 하는 광 조사 장치; 광 조사 장치에서 조사된 광이 표피에서 반사되는 반사광을 측정하는 모바일 카메 라; 및 모바일 카메라에서 측정된 반사광을 이용해 신체 부위의 산소포화도 및 혈류량을 분석하고, 욕 창을 진단하여 출력하는 사용자 장치를 포함하여 구성될 수 있다. 즉, 광 조사 장치와 모바일 카메라가 결합하여 환자의 신체 부위에 광을 조사하고 반사광을 측정할 수 있으며, 모바일 카메라는 측정한 데이터를 사용자 장치와 네트워크를 통해 송신할 수 있다. 사용자 장 치는 수신한 데이터를 분석해 산소포화도 분포도 및 혈류량 맵을 작성하고, 학습 완료된 인공지능 모델을 사용해 욕창 진행 등급을 판정할 수 있다. 즉, 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 시스템의 광 조사 장치와 모바일 카메라는, 본 발명의 일실시예에 따른 모바일 카메라 로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치의 광 조사부 및 카메 라부의 기능을 할 수 있고, 사용자 장치는 산소포화도 분석부, 혈류량 분석부 및 욕창 진단 부의 기능을 할 수 있다. 여기서, 사용자 장치는 환자를 관리하고 욕창을 치료하는 의료진이 사용하는 전자 장치일 수 있다. 전자 장치는 스마트폰, 태블릿(tablet) PC(personal computer), 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 (desktop) PC, 랩탑(laptop) PC, 넷북(netbook) 컴퓨터, 워크스테이션(workstation), 서버(server), PDA(personal digital assistant), 미디어 박스, 게임 콘솔, 전자사전 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있으며, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트렌즈, 또는 머리착용형 장치(HMD, head-mounted-device), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형 회로(implantable circuit) 중 적어도 하나를 포함할 수 있다. 다양한 실시예들에서, 전자 장치는 전술한 기기들에 한정되지는 않으며, 전술한 다양한 장치 중 둘 이상의 조합일 수 있다. 이하에서는, 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인 공지능 기반 욕창 진단 장치의 세부적인 구성에 대해 상세히 살펴보도록 한다.광 조사부는, 산화 헤모글로빈과 헤모글로빈의 광 흡수 파장 차이를 이용하기 위해 서로 다른 2개의 파장 을 갖는 광을 신체 부위에 조사할 수 있다. 욕창이 발생하면 피부조직의 괴사가 일어나며, 이는 발생 부위뿐만 아니라 인근 분위의 혈류량과 산소포화도 이상을 야기한다. 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치는, 이러한 혈류량 및 산소포화도 이상을 관측하여 욕창 부위 및 욕창 진행 등급을 진단할 수 있다. 이를 위해 광 조사부는 산화 헤모글로 빈과 헤모글로빈의 광 흡수 파장 차이를 사용해 표피 내 혈류량을 측정하고 혈류량 이상을 감지하기 위해, 서로 다른 2개의 파장을 갖는 광을 조사하도록 구성될 수 있다. 도 4는 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치에서, 광 조사부의 세부적인 구성을 도시한 도면이고, 도 5는 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치에서, 광 조사부의 정면을 예를 들어 도시한 도면이고, 도 6은 본 발명의 일실시예에 따른 모바일 카메라로 혈 류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치에서, 광 조사부의 측면을 예를 들어 도시한 도면이다. 도 4 내지 도 6에 도시된 바와 같이, 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치의 광 조사부는, 광원부, 몸체부 및 제어부를 포함하여 구성될 수 있으며, 결합부를 더 포함하여 구성될 수 있다. 광원부는, 서로 다른 파장의 광을 조사하는 2종류의 광원으로 구성될 수 있다. 예를 들어, 광원부는 765㎚의 광과 880㎚의 광을 조사하는 2종류의 광원을 포함하며, 각 광원은 복수일 수 있다. 몸체부는, 2종류의 광원부가 번갈아 배치될 수 있다. 보다 구체적으로, 몸체부는, 둘 이상의 동심원상에 2종류의 광원부가 번갈아 배치될 수 있다. 즉, 도 5에 도시된 바와 같이, 몸체부 위의 지름이 서로 다른 두 개의 동심원상에 2종류의 광원부를 번갈아 배치하여, 신체 부위에 2종류의 광이 균일 하게 조사되도록 구성할 수 있다. 또한, 몸체부는, 2종류의 광원부가 배치된 동심원의 중심 부분에 카메라부의 렌즈가 위치하도록 홀이 형성될 수 있다. 중심의 홀로는 카메라부의 렌즈가 삽입되어 한 쪽으로 치우침 없이 반사광이 측정되도록 할 수 있다. 제어부는, 2종류의 광원부의 광 조사를 제어할 수 있다. 보다 구체적으로, 제어부는, 광원부 에서 조사되는 광의 전원, 파장, 세기 등을 제어할 수 있다. 여기서, 제어부는 광 조사 장치의 외면에 구비된 입력부(미도시)나 사용자 장치를 통해 사용자의 제어 신호를 수신하고, 제어 신호에 따라 2 종류의 광원부를 제어할 수 있다. 결합부는, 몸체부에 형성된 홀에 카메라부의 렌즈가 위치하여 신체 부위의 촬영이 가능하도록 모바일 카메라에 결합할 수 있다. 즉, 도 5 및 도 6에 도시된 바와 같이, 몸체부의 중심에 형성된 홀 안쪽으로 결합부가 구성되어, 홀 내부로 삽입된 모바일 카메라의 렌즈를 고정해 결합할 수 있다. 도 7은 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치에서, 광 조사부와 카메라부가 결합한 측면 모습을 예를 들어 도시한 도면이다. 도 7에 도시된 바와 같이, 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단 할 수 있는 인공지능 기반 욕창 진단 장치의 결합부는, 홀에 삽입된 카메라부가 고정되도록 잡아줄 수 있다. 이때, 결합부는, 모바일 카메라에 탈착 가능하도록 탈착식으로 구성될 수 있다. 예를 들어, 결합부는 몸체부의 내부로 스프링을 구비해 스프링의 힘에 의해 모바일 카메라가 고정되도 록 할 수 있다. 카메라부는, 광 조사부에서 조사된 광이 표피에서 반사되는 반사광을 측정할 수 있다. 카메라부 는 일반적인 가시광선 카메라 외에도, 열 영상 카메라, 뎁스 카메라, 적외선 카메라 등 다양한 종류의 카 메라로 구현될 수 있다. 또한, 카메라부는 모바일 카메라로 구현될 수 있으며, 모바일 카메라에 도 5 및 도 6에 도시된 바와 같은 광 조사 장치를 결합해, 간편하게 손에 들고 욕창 환자의 신체 부위에 광 을 조사하고 반사광을 측정함으로써, 움직임이 불편한 환자의 욕창을 진단할 수 있다. 도 8은 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치를 사용해 욕창을 진단하는 모습을 예를 들어 도시한 도면이다. 도 8에 도시된 바와 같이, 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치에서는, 광 조사부에서 조사된 2종류의 광이 신체 부위에서 각각 반사된 반사광을 광 조사 부의 중심에 삽입된 카메라부의 렌즈가 수광하여 측정할 수 있다. 산소포화도 분석부는, 카메라부에서 측정된 반사광을 이용해 신체 부위의 산소포화도를 측정하고, 신 체 부위의 산소포화도 분포도를 작성할 수 있다. 보다 구체적으로는, 산소포화도 분석부는, 2종류의 광원 부에서 조사된 광이 표피에서 흡수 후 반사되는 반사광의 차이를 이용해 산소포화도를 측정할 수 있다. 예를 들어, 도 8에 도시된 바와 같은 예에서, 765㎚ 파장의 광에서는 산화 헤모글로빈의 흡광도가 헤모글로빈의 흡광도보다 작고, 880㎚ 파장의 광에서는 산화 헤모글로빈의 흡광도가 헤모글로빈의 흡광도보다 크다. 산소포 화도 분석부는, 이러한 파장에 따른 흡광도 차이를 사용해 산소포화도를 측정하고, 카메라부에서 촬 영된 신체 부위의 표피에서의 산소포화도 분포도를 작성할 수 있다. 혈류량 분석부는, 산소포화도 분포도를 기반으로 신체 부위의 표피의 혈류량 맵을 작성할 수 있다. 욕창 이 발생하면 발생 부위와 인근 부위에서 혈류 이상을 야기되는데, 혈관 내 헤모글로빈과 산화 헤모글로빈에 의 해 측정된 산소포화도는 혈류에 의해 변화되므로, 신체 부위 표피의 산소포화도 분포도를 기반으로 혈류량 맵을 작성할 수 있다. 도 9는 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치의 혈류량 분석부에서 작성한 혈류량 맵을 예를 들어 도시한 도면이다. 도 9에 도시 된 바와 같이, 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기반 욕창 진단 장치의 혈류량 분석부는, 산소포화도 분포도로부터 2차원의 표피 혈류량 맵을 도 출할 수 있다. 욕창 진단부는, 학습 완료된 인공지능 모델을 사용해 혈류량 맵으로부터 욕창을 진단할 수 있다. 여기서, 학습 완료된 인공지능 모델은, 2차원 혈류량 맵을 입력 데이터로 하고 욕창 진행 등급을 출력 데이터로 하여 대 량의 학습 데이터로 인공지능 알고리즘을 학습하여 생성된 모델로, 혈류량 맵과 같은 2차원 이미지를 복수의 클 래스로 분류하는 분류기 모델일 수 있다. 예를 들어, CNN(Convolutional neural network), 랜덤 포레스트 (Random Forest), 비전 트랜스포머(Vision Transformer) 등의 인공지능 알고리즘을 혈류량 맵과 욕창 진행 등 급 데이터로 학습해 생성된 모델일 수 있다. 도 10은 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지 능 기반 욕창 진단 장치의 욕창 진단부의 진단 과정을 설명하기 위해 도시한 도면이다. 도 10에 도시된 바와 같이, 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공 지능 기반 욕창 진단 장치의 욕창 진단부는, 혈류량 맵을 입력 정보로 하고 욕창 진행 등급을 출력 정보로 하는 학습 완료된 인공지능 모델을 사용하며, 혈류량 맵으로부터 욕창 진행 등급을 판정할 수 있다. 이때, 욕 창 진행 등급은, 욕창 아님, 욕창 1단계, 2단계, 3단계 및 4단계의 총 5개의 클래스로 분류될 수 있다.한편, 욕창 진단부는, 혈류량 맵을 미리 정해진 개수로 분할하고, 분할된 맵 각각을 학습 완료된 인공지능 모델에 입력해 분할된 맵마다 욕창 등급을 출력할 수도 있다. 욕창 진단부는 각 분할된 맵별로 출력된 욕 창 등급을 혈류량 맵에 매핑하여 사용자 장치로 출력할 수 있다. 따라서, 전체 신체 부위 중에서도 개별 영역마다 서로 다를 수 있는 욕창 등급을 세밀하게 진단하고, 각 부분에 대해 적절한 치료가 이루어지도록 할 수 있다. 전술한 바와 같이, 본 발명에서 제안하고 있는 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있 는 인공지능 기반 욕창 진단 장치 및 시스템에 따르면, 서로 다른 2개의 파장을 갖는 광을 신체 부위에 조사하 고, 신체 부위에서 반사되는 광을 모바일 카메라로 촬영하여 산소포화도 분포도 및 혈류량 맵을 작성해 욕 창을 진단함으로써, 산화 헤모글로빈과 헤모글로빈의 광 흡수 파장 차이를 이용해 혈류를 시각화하여 욕창 발생 으로 인한 피부 이상을 객관적으로 감지할 수 있으며, 표준화된 데이터를 기반으로 욕창을 진단할 수 있다. 한편, 본 발명은 다양한 통신 단말기로 구현되는 동작을 수행하기 위한 프로그램 명령을 포함하는 컴퓨터에서 판독 가능한 매체를 포함할 수 있다. 예를 들어, 컴퓨터에서 판독 가능한 매체는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD_ROM, DVD와 같은 광기록 매체(optical media), 플롭티 컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 이와 같은 컴퓨터에서 판독 가능한 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합 하여 포함할 수 있다. 이때, 컴퓨터에서 판독 가능한 매체에 기록되는 프로그램 명령은 본 발명을 구현하기 위 하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 예를 들어, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해 실행될 수 있는 고급 언어 코드를 포함할 수 있다."}
{"patent_id": "10-2022-0079313", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 설명한 본 발명은 본 발명이 속한 기술분야에서 통상의 지식을 가진 자에 의하여 다양한 변형이나 응용이 가능하며, 본 발명에 따른 기술적 사상의 범위는 아래의 특허청구범위에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2022-0079313", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 단계별 분류에 따른 욕창을 도시한 도면. 도 2는 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 장치의 구성을 도시한 도면. 도 3은 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 시스템의 구성을 도시한 도면. 도 4는 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 장치에서, 광 조사부의 세부적인 구성을 도시한 도면. 도 5는 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 장치에서, 광 조사부의 정면을 예를 들어 도시한 도면. 도 6은 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 장치에서, 광 조사부의 측면을 예를 들어 도시한 도면. 도 7은 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 장치에서, 광 조사부와 카메라부가 결합한 측면 모습을 예를 들어 도시한 도면. 도 8은 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 장치를 사용해 욕창을 진단하는 모습을 예를 들어 도시한 도면. 도 9는 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 장치의 혈류량 분석부에서 작성한 혈류량 맵을 예를 들어 도시한 도면. 도 10은 본 발명의 일실시예에 따른 모바일 카메라로 혈류의 양을 측정하여 욕창을 진단할 수 있는 인공지능 기 반 욕창 진단 장치의 욕창 진단부의 진단 과정을 설명하기 위해 도시한 도면."}
