{"patent_id": "10-2018-0061533", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0136187", "출원번호": "10-2018-0061533", "발명의 명칭": "인공지능 기술을 탑재한 화재 경보 시스템 및 방법", "출원인": "인천대학교 산학협력단", "발명자": "김훈"}}
{"patent_id": "10-2018-0061533", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 센서의 센싱값과 제2 센서의 센싱값을 수신하여 인공신경망의 입력 노드들에 각각 입력하는 단계;상기 각각의 센싱값에 따라 미리 정해진 가중치를 적용하여 가중치를 갖는 채널로 연결된 망(Network)을 통해상기 인공신경망의 출력 노드인 특정 출력값을 계산하는 단계; 및상기 계산된 출력값을 기설정된 임계치와 비교하여 출력값이 임계치보다 크면 화재 경보를 나타내는 1을 출력하며, 출력값이 임계치보다 작으면 정상 상태를 나타내는 0을 출력하는 단계를 포함하며,상기 임계치는 계절, 낮밤, 기압의 환경적 조건에 따라 조정하는 단계를 더 포함하는 것을 특징으로 하는 화재경보 방법."}
{"patent_id": "10-2018-0061533", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 센서의 센싱값과 상기 제2 센서의 센싱값이 상기 인공신경망의 입력 노드들의 각각에 입력되고, 상기인공신경망의 출력 노드들의 출력값에 기초하여 복수의 화재 상태를 구성하며, 상기 각각의 출력값에 상기 각각의 화재 상태를 할당하는 단계를 포함하는 것을 특징으로 하는 화재 경보 방법."}
{"patent_id": "10-2018-0061533", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 센서의 센싱값과 상기 제2 센서의 센싱값에 대응되는 출력노드의 출력값이 결정되도록 가중치를 조정하도록 제어하는 단계를 포함하는 것을 특징으로 하는 화재 경보 방법."}
{"patent_id": "10-2018-0061533", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "측정 구간에서 온도와 연기를 감지하는 제1 센서의 센싱값과 제2 센서의 센싱값을 수신하여 데이터베이스부로전송하는 수신부;상기 데이터베이스부로부터 상기 제1 센서의 센싱값과 제2 센서의 센싱값을 수신하여 인공신경망의 입력 노드들에 각각 입력하고, 상기 각각의 센싱값에 따라 미리 정해진 가중치를 적용하여 가중치를 갖는 채널로 연결된 망(Network)을 통해 상기 인공신경망의 출력 노드인 특정 출력값을 계산하며, 상기 계산된 출력값을 기설정된 임계치와 비교하여 출력값이 임계치보다 크면 화재 경보를 나타내는 1을 출력하며, 출력값이 임계치보다 작으면정상 상태를 나타내는 0을 출력하는 인공지능 계산부; 및상기 인공지능 계산부로부터 수신한 화재 경보 신호를 무선 통신에 의해 인접한 모바일 엣지 서버로 전송하는알람 전송부를 포함하며,상기 임계치는 계절, 낮밤, 기압의 환경적 조건에 따라 조정하는 것을 특징으로 하는 화재 경보 시스템."}
{"patent_id": "10-2018-0061533", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 인공지능 계산부는 상기 제1 센서의 센싱값과 상기 제2 센서의 센싱값이 상기 인공신경망의 입력 노드들의각각에 입력되고, 상기 인공신경망의 출력 노드들의 출력값에 기초하여 복수의 화재 상태를 구성하며, 상기 각각의 출력값에 상기 각각의 화재 상태를 할당하는 것을 특징으로 하는 화재 경보 시스템."}
{"patent_id": "10-2018-0061533", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,공개특허 10-2019-0136187-3-상기 인공지능 계산부는 상기 제1 센서의 센싱값과 상기 제2 센서의 센싱값에 대응되는 출력노드의 출력값이 결정되도록 가중치를 조정하도록 제어하는 것을 특징으로 하는 화재 경보 시스템."}
{"patent_id": "10-2018-0061533", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 인공지능 계산부는 상기 제1 센서의 센싱값과 상기 제2 센서의 센싱값을 새로운 입력 노드로 생성하고, 생성한 새로운 입력 노드에 화재 상태의 출력값이 매칭되도록 가중치를 조절하여 상기 새로운 입력 노드에 적용하는 것을 특징으로 하는 화재 경보 시스템."}
{"patent_id": "10-2018-0061533", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 인공지능 계산부는 상기 새로운 입력 노드에 의해 기설정된 화재 상태를 결정하지 못하는 경우, 새로운 화재 상태를 생성하여 추가하고, 이에 대응하는 입력 노드의 센싱값을 구성한 후, 상기 새로운 입력 노드와 새롭게 구성된 출력 노드 간의 관계를 학습하도록 인공신경망의 가중치를 결정하여 상기 새로운 입력 노드에 적용하는 것을 특징으로 하는 화재 경보 시스템."}
{"patent_id": "10-2018-0061533", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제4항에 있어서,상기 인공지능 계산부는 센서 고장의 원인으로 상기 제1 센서의 센싱값 또는 상기 제2 센서의 센싱값 중 하나의센싱값을 수신하지 못하거나 센싱 조건에 만족하지 못하는 경우, 상기 출력값이 임계치보다 적더라도 예비 화재상태를 구성하여 새로운 출력 노드를 추가하도록 제어하는 것을 특징으로 하는 화재 경보 시스템."}
{"patent_id": "10-2018-0061533", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기술을 탑재한 화재 경보 시스템 및 방법은 화재 발생 영역의 온도와 연기 상태를 감지하고, 해당 화재 발생 영역의 환경적 조건을 고려하여 화재 수준을 판단하며, 실제적으로 초기 화재 발생을 정확하게 감지하여 잘 못된 화재 경보를 줄임으로써 화재 경보 시스템의 신뢰성과 안전성을 향상시키는 효과가 있다."}
{"patent_id": "10-2018-0061533", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 화재 경보 시스템에 관한 것으로서, 특히 화재 발생 영역의 온도와 연기 상태를 감지하고, 해당 화재 발생 영역의 환경적 조건을 고려하여 화재 수준을 판단하며, 실제적으로 초기 화재 발생을 정확하게 감지하여 잘못된 화재 경보를 줄이는 인공지능 기술을 탑재한 화재 경보 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2018-0061533", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "화재 사고는 많은 재산 피해와 인명 피해를 유발하기 때문에 화재에서 가장 중요한 것이 신속한 초기 대응이다. 작은 불이 큰 불로 확산되기까지는 긴 시간이 소요되지 않으므로 고층 빌딩과 같은 건물에서 화재를 초기에 진 압하지 못하는 경우, 대형 화재로 이어질 가능성이 높다. 화재 경보 및 탐지 시스템은 환경 요소를 액세스하고 초기 단계에서 화재 또는 심각한 상황을 예측할 수 있는 시스템이다. 최근 우리나에서 발생되는 대형 화재는 초기 화재 신호를 탐지하지 못하고, 이로 인하여 초기 화재 대응과 상황 판단이 신속하게 이루어지지 못하여 많은 인명, 재산 피해가 발생하였다. 화재 경보 및 탐지 시스템은 잘못된 경보 상황을 방지하기 위해서 소음과 실제 화재 신호를 구별해야 하며, 불 특정 다수인에게 화재 감지 여부를 전송하기 보다 관리자와, 소방서에 화재 발생 사실을 통지함으로써 실제적으 로 화재 경보가 초기 대응으로 이어질 수 있는 시스템이 필요한 실정이다. 선행기술문헌 특허문헌(특허문헌 0001) 한국 등록특허번호 제10-1803713호"}
{"patent_id": "10-2018-0061533", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이와 같은 문제점을 해결하기 위하여, 본 발명은 화재 발생 영역의 온도와 연기 상태를 감지하고, 해당 화재 발 생 영역의 환경적 조건을 고려하여 화재 수준을 판단하며, 실제적으로 초기 화재 발생을 정확하게 감지하여 잘 못된 화재 경보를 줄이는 인공지능 기술을 탑재한 화재 경보 시스템 및 방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2018-0061533", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 특징에 따른 인공지능 기술을 탑재한 화재 경보 시스템은, 측정 구간에서 온도와 연기를 감지하는 제1 센서의 센싱값과 제2 센서의 센싱값을 수신하여 데이터베이스부로 전송하는 수신부; 상기 데이터베이스부로부터 상기 제1 센서의 센싱값과 제2 센서의 센싱값을 수신하여 인공신경망의 입력 노드들 에 각각 입력하고, 상기 각각의 센싱값에 따라 미리 정해진 가중치를 적용하여 가중치를 갖는 채널로 연결된 망 (Network)을 통해 상기 인공신경망의 출력 노드인 특정 출력값을 계산하며, 상기 계산된 출력값을 기설정된 임 계치와 비교하여 출력값이 임계치보다 크면 화재 경보를 나타내는 1을 출력하며, 출력값이 임계치보다 작으면 정상 상태를 나타내는 0을 출력하는 인공지능 계산부; 및 상기 인공지능 계산부로부터 수신한 화재 경보 신호를 무선 통신에 의해 인접한 모바일 엣지 서버로 전송하는 알람 전송부를 포함하며, 상기 임계치는 계절, 낮밤, 기압의 환경적 조건에 따라 조정하는 것을 특징으로 한다. 본 발명의 특징에 따른 인공지능 기술을 탑재한 화재 경보 방법은, 제1 센서의 센싱값과 제2 센서의 센싱값을 수신하여 인공신경망의 입력 노드들에 각각 입력하는 단계; 상기 각각의 센싱값에 따라 미리 정해진 가중치를 적용하여 가중치를 갖는 채널로 연결된 망(Network)을 통해 상기 인공신경망의 출력 노드인 특정 출력값을 계산하는 단계; 및 상기 계산된 출력값을 기설정된 임계치와 비교하여 출력값이 임계치보다 크면 화재 경보를 나타내는 1을 출력하 며, 출력값이 임계치보다 작으면 정상 상태를 나타내는 0을 출력하는 단계를 포함하며, 상기 임계치는 계절, 낮밤, 기압의 환경적 조건에 따라 조정하는 단계를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2018-0061533", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 구성에 의하여, 본 발명은 화재 발생 영역의 온도와 연기 상태를 감지하고, 해당 화재 발생 영역의 환경 적 조건을 고려하여 화재 수준을 판단하며, 실제적으로 초기 화재 발생을 정확하게 감지하여 잘못된 화재 경보 를 줄임으로써 화재 경보 시스템의 신뢰성과 안전성을 향상시키는 효과가 있다."}
{"patent_id": "10-2018-0061533", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다.도 1은 본 발명의 실시예에 따른 인공지능 기술을 탑재한 화재 경보 시스템의 구성을 나타낸 도면이고, 도 2는 본 발명의 실시예에 따른 인공지능 기술을 탑재한 화재 경보 방법을 나타낸 도면이며, 도 3은 본 발명의 실시예 에 따른 인공신경망의 개념을 나타낸 도면이다. 본 발명의 실시예에 따른 인공지능 기술을 탑재한 화재 경보 시스템은 제1 센서, 제2 센서, 화 재 경보 장치 및 모바일 엣지 서버를 포함한다. 화재 경보 장치는 수신부, 데이터베이스부, 인공지능 계산부 및 알람 전송부를 포함 한다. 제1 센서는 온도 센서 또는 열 센서를 포함하고, 측정 구간에서 온도, 불꽃, 열을 감지하여 제1 센싱값을 전송한다. 본 발명의 제1 센서는 하나 이상의 센서노드로 구성할 수 있으며, 설명의 편의를 위해서 온도 센서로 예시한다. 제2 센서는 연기 센서 또는 가스 센서를 포함하고, 측정 구간에서 연기, 가스를 감지하여 제2 센싱값을 전 송한다. 본 발명의 제2 센서는 하나 이상의 센서노드로 구성할 수 있으며, 설명의 편의를 위해서 연기 센 서로 예시한다. 본 발명의 화재 경보 시스템은 온도 센서와 연기 센서의 센싱값을 융합하여 초기 화재 신호를 정확하게 판 단할 수 있게 된다. 수신부는 제1 센서와 제2 센서로부터 실시간으로 측정된 센싱값을 수신하여 데이터베이스부 로 저장한다. 인공지능 계산부는 데이터베이스부로부터 제1 센서의 센싱값과 제2 센서의 센싱값을 수신 하여 인공신경망의 입력 노드들에 각각 입력하고, 입력된 다중 센싱값에 따라 미리 정해진 가중치를 적용하여 가중치를 갖는 채널(데이터 통로)로 연결된 망(Network)을 통해 특정 출력값을 계산한다. 제1 센서와 제2 센서에서 측정된 센싱값은 고유의 가중치가 적용되어 다음 노드로 전달된다. 여기서, 가중치는 환경적, 계절적 원인, 낮밤, 기압 등에 의해 축적되어 도출된 데이터이다. 다시 말해, 가중치는 인공신경망의 학습을 통해 지속적으로 변경되어 도출될 수 있는 값이다. 인공지능 계산부는 산출된 특정 출력값에 기초하여 화재 상태를 판단하는데, 산출된 특정 출력값이 기설정 된 임계치를 넘는 경우, 화재 경보를 나타내는 1을 출력하며, 산출된 특정 출력값이 기설정된 임계치를 넘지 못 하는 경우, 정상 상태를 나타내는 0을 출력한다. 인공지능 계산부는 제1 센서의 센싱값과 제2 센서의 센싱값이 인공신경망의 입력 노드들의 각각 에 입력되고, 인공신경망의 출력 노드들의 출력값에 기초하여 다양한 화재 상태를 구성한다. 예를 들면, 온도 센서(제1 센서)의 센싱값은 100도 내지 150도이고, 연기 센서(제2 센서)의 센싱값이 5V 내지 8V일 때, 초기 화재 상태라고 가정하고, 온도 센서(제1 센서)의 센싱값은 200도 내지 250도이고, 연기 센서(제2 센서)의 센싱값이 8V 내지 15V일 때, 중기 화재 상태라고 가정하고, 온도 센서(제1 센서 )의 센싱값은 300도 이상이고, 연기 센서(제2 센서)의 센싱값이 15V 내지 20V일 때, 말기 화재 상태 라고 가정하자. 제2 센서의 센싱값은 연기의 농도에 따라 규칙적으로 비례되는 전압값을 출력한다. 인공지능 계산부는 제1 센서의 센싱값과 제2 센서의 센싱값이 인공신경망의 입력 노드들의 각각 에 입력되고(S100), 각각의 센싱값에 따라 미리 정해진 가중치를 적용하며(S102), 가중치를 갖는 채널(데이터 통로)로 연결된 망(Network)을 통해 특정 출력값을 계산한다(S104). 인공지능 계산부는 인공신경망의 출력 노드인 출력값에 기초하여 화재 상태(초기 화재, 중기 화재, 말기 화재)를 판별한다. 즉, 인공신경망의 출력에는 3개의 화재 상태 정보가 출력 노드들에 각각 할당된다. 온도 센서(제1 센서)의 센싱값은 90도이고, 연기 센서(제2 센서)의 센싱값이 9V일 때, 초기 화재 상 태로 가정된 센싱 조건과 다르다.이러한 경우, 인공지능 계산부는 제1 센서의 센싱값(90도)과 제2 센서의 센싱값(9V)을 새로운 입력 노드로 생성하여 초기 화재 상태의 출력값과 매칭되도록 가중치를 조절하여 상기 새로운 입력 노드에 적용 한다. 출력값은 초기 화재 상태, 중기 화재 상태, 말기 화재 상태의 출력 노드를 구성하고 있지만 이에 한정하지 않는 다. 즉, 인공지능 계산부는 새로운 입력 노드에 의해 초기 화재 상태, 중기 화재 상태, 말기 화재 상태로 화재 상태를 결정하지 못하는 경우, 새로운 화재 상태를 생성하여 추가하고, 이에 대응하는 입력 노드의 센싱값을 구 성한 후, 인공신경망에서 새로운 입력 노드와 새롭게 구성된 출력 노드 간의 관계를 학습하도록 인공신경망의 가중치를 결정하여 새로운 입력 노드에 적용할 수 있다. 인공지능 계산부는 센서 고장 등 기타 원인으로 제1 센서의 센싱값 또는 제2 센서의 센싱값 중 하나의 센싱값을 수신하지 못하거나 센싱 조건에 만족하지 못하는 경우, 예를 들어 제1 센서의 센싱값은 100도 내지 150도이고, 제2 센서의 센싱값이 3V일 때, 출력값이 임계치보다 적더라도 예비 초기 화재 상태 를 구성하여 새로운 출력 노드를 추가하도록 제어한다. 반대로 제2 센서의 센싱값이 만족되고, 제1 센서의 센싱 값이 90도인 경우에도 출력값이 임계치보다 적더라도 예비 초기 화재 상태를 구성하여 새로운 출력 노드를 추가 하도록 제어할 수 있다. 나머지 중기 화재 상태, 말기 화재 상태도 동일한 방식으로 예비 중기 화재 상태, 예비 말기 화재 상태를 적용 할 수 있다. 인공지능 계산부는 제1 센서의 센싱값과 제2 센서의 센싱값에 대응되는 출력노드의 출력값이 결 정되도록 즉, 센싱값들과 출력값인 화재 상태의 관계를 학습하도록 인공신경망의 가중치를 결정할 수 있다. 인공지능 계산부는 제1 센서의 센싱값과 제2 센서의 센싱값에 미리 정해진 가중치를 적용하여 출력값을 하기의 [수학식 1]에 의해 계산되고, 계산된 출력값을 기설정된 임계치와 비교하여 출력값이 임계치보 다 크면 화재 경보를 나타내는 1을 출력하며, 출력값이 임계치보다 작으면 정상 상태를 나타내는 0을 출력한다 (S106). 수학식 1"}
{"patent_id": "10-2018-0061533", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, a1, a2는 가중치이고, X1, X2는 제1 센서의 센싱값과 제2 센서의 센싱값이다. 인공지능 계산부는 유형화된 과거의 화재 자료를 기초로 가중치를 변경할 수 있다. 인공지능 계산부 는 계절, 낮밤, 기압 등의 환경적 조건에 따라 임계치를 조정하도록 제어한다. 가중치와 임계치를 변경 가능하도록 구성한 것은 잘못된 경보 상황을 방지하기 위하여 실제 화재 신호가 위협적 인 상황인지 위협적이지 않은 상황인지 구별하기 위함이다. 인공지능 계산부는 제1 센서의 센싱값과 제2 센서의 센싱값이 인공신경망의 입력 노드들의 각각 에 입력되고, 제1 센서의 센싱값과 제2 센서의 센싱값의 조합에 대응하는 출력값에 기초하여 다양한 화재 상태를 구성하고, 제1 센서의 센싱값과 제2 센서의 센싱값에 대응되는 출력노드의 출력값이 결 정되도록 가중치를 조정하며, 출력값과 비교할 임계치를 환경적 조건에 따라 변하는 값으로 정의한다. 이와 같이, 본 발명의 화재 경보 시스템은 제1 센서의 센싱값과 제2 센서의 센싱값에 따라 대응 되는 출력값(화재 상태)을 계산하고, 출력값을 환경적 조건에 따라 변하는 임계치와 비교하여 화재 상태를 판단 하게 된다. 따라서, 본 발명은 화재 발생 영역의 온도와 연기 상태를 감지하고, 해당 화재 발생 영역의 환경적 조건을 고려 하여 화재 수준을 판단하며, 실제적으로 초기 화재 발생을 정확하게 감지하여 잘못된 화재 경보를 줄임으로써 화재 경보 시스템의 신뢰성과 안전성을 향상시킬 수 있다. 인공지능 계산부는 화재 경보를 나타내는 1이 출력되는 경우, 화재 경보 신호를 생성하여 알람 전송부 로 전송한다. 알람 전송부는 인공지능 계산부로부터 수신한 화재 경보 신호를 무선 통신에 의해 인접한 모바일 엣 지 서버로 전송한다(S108). 모바일 엣지 서버는 화재 경보 신호를 수신할 수신 대상 단말로 화재 경보 신호를 전송한다. 여기서, 수신 대상 단말은 관리자 또는 소방서의 콜센터 등 화재가 발생한 위치에 직접적으로 초기 대응할 수 있는 사람, 기관이 속한 단말장치이다. 이상에서 본 발명의 실시예는 장치 및/또는 방법을 통해서만 구현이 되는 것은 아니며, 본 발명의 실시예의 구 성에 대응하는 기능을 실현하기 위한 프로그램, 그 프로그램이 기록된 기록 매체 등을 통해 구현될 수도"}
{"patent_id": "10-2018-0061533", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "있으며, 이러한 구현은 앞서 설명한 실시예의 기재로부터 본 발명이 속하는 기술분야의 전문가라면 쉽게 구현할 수 있는 것이다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2018-0061533", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 인공지능 기술을 탑재한 화재 경보 시스템의 구성을 나타낸 도면이다. 도 2는 본 발명의 실시예에 따른 인공지능 기술을 탑재한 화재 경보 방법을 나타낸 도면이다. 도 3은 본 발명의 실시예에 따른 인공신경망의 개념을 나타낸 도면이다."}
