{"patent_id": "10-2022-0087426", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0010198", "출원번호": "10-2022-0087426", "발명의 명칭": "관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서", "출원인": "박병훈", "발명자": "박병훈"}}
{"patent_id": "10-2022-0087426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자체적으로 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구성으로서 서버 자원을다수 포함하며, 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구성으로서 단말 자원을 다수 포함한 사용자 단말이 적어도 하나 이상 통신 네트워크를 통해 연결되어 접속 가능한 관리 서버;를 포함하며,상기 관리 서버는,상기 관리 서버에 접속된 상기 사용자 단말로부터 인공지능 서비스의 구동 요청신호를 수신할 시 인공지능 서비스의 구동을 요청하고, 요청에 따른 인공지능 서비스의 구동 결과값을 제공받아 웹을 통해 상기 사용자 단말에출력 가능한 응용 애플리케이션;상기 응용 애플리케이션을 통한 인공지능 서비스의 구동 요청에 따라 내부에 포함된 상기 서버 자원을 이용해인공지능 서비스의 구동을 위한 연산 처리를 수행하여 구동 결과값을 생성 가능한 인공지능 플랫폼; 및상기 인공지능 플랫폼 내 포함된 상기 서버 자원의 동작 상태 및 가용 수준을 모니터링 하는 자원제어 프레임워크;를 포함하는 것을 특징으로 하는관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 시스템."}
{"patent_id": "10-2022-0087426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제2항에 있어서,상기 사용자 단말은,상기 응용 애플리케이션과 통신 네트워크를 통해 연결되어 인공지능 서비스의 구동 요청신호를 전송하거나, 요청에 따른 인공지능 서비스의 구동 결과값을 수신하는 제1단말 통신부;상기 자원제어 프레임워크와 통신 네트워크를 통해 연결되는 제2단말 통신부;상기 사용자 단말 내 포함된 상기 단말 자원의 동작 상태 및 가용 수준을 모니터링 하여 모니터링 결과정보를상기 제2단말 통신부를 통해 상기 자원제어 프레임워크에 제공하는 자원 모니터링 결과 제공부; 및상기 단말 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행하여 구동 결과값을 생성 가능한 인공지능 구동부;를 포함하는 것을 특징으로 하는관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 시스템."}
{"patent_id": "10-2022-0087426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 자원제어 프레임워크는 상기 응용 애플리케이션을 통해 인공지능 서비스의 구동이 요청될 시 상기 인공지능 플랫폼 내 포함된 상기 서버 자원의 동작 상태 및 가용 수준을 모니터링하여 인공지능 서비스의 구동을 위한상기 서버 자원의 가용 여부를 판단하여, 상기 서버 자원의 가용이 가능할 경우 상기 인공지능 플랫폼이 구동 결과값을 생성하도록 동작시키고, 상기 서버 자원의 가용이 불가능할 경우 상기 제2단말 통신부를 통해 상기 자원 모니터링 결과 제공부에 모니터링 결과정보를 요청하는 것을 특징으로 하는공개특허 10-2024-0010198-3-관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 시스템."}
{"patent_id": "10-2022-0087426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 자원제어 프레임워크는 상기 자원 모니터링 결과 제공부에 요청하여 제공되는 모니터링 결과정보가 상기단말 자원의 가용이 가능함을 나타낼 경우, 상기 제2단말 통신부를 통해 상기 인공지능 구동부가 구동 결과값을생성하여 제공하도록 하고,상기 자원제어 프레임워크는 상기 자원 모니터링 결과 제공부에 요청하여 제공되는 모니터링 결과정보가 상기단말 자원의 가용이 불가능함을 나타낼 경우, 상기 인공지능 플랫폼이 구동 결과값을 생성하도록 동작시키는 요청신호를 순차적으로 대기열에 배치시키는 것을 특징으로 하는관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 시스템."}
{"patent_id": "10-2022-0087426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 자원제어 프레임워크는 상기 인공지능 플랫폼이 상기 서버 자원을 이용해 인공지능 서비스의 구동을 위한연산 처리를 수행하여 생성된 구동 결과값 또는 상기 인공지능 구동부가 상기 단말 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행하여 생성된 구동 결과값 중 하나를 제공받아 상기 응용 애플리케이션에전송하고,상기 자원제어 프레임워크로부터 구동 결과값을 제공받은 상기 응용 애플리케이션은 웹을 통해 구동 결과값이상기 사용자 단말에 시각적으로 출력되도록 하는 것을 특징으로 하는관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 시스템."}
{"patent_id": "10-2022-0087426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "자체적으로 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구성으로서 서버 자원을다수 포함하며, 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구성으로서 단말 자원을 다수 포함한 사용자 단말이 적어도 하나 이상 통신 네트워크를 통해 연결되어 접속 가능한 관리 서버;를 포함하며, 상기 관리 서버는, 상기 관리 서버에 접속된 상기 사용자 단말로부터 인공지능 서비스의 구동 요청신호를 수신할 시 인공지능 서비스의 구동을 요청하고, 요청에 따른 인공지능 서비스의 구동 결과값을 제공받아 웹을 통해상기 사용자 단말에 출력 가능한 응용 애플리케이션; 상기 응용 애플리케이션을 통한 인공기능 서비스의 구동요청에 따라 내부에 포함된 상기 서버 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행하여 구동 결과값을 생성 가능한 인공지능 플랫폼; 및 상기 인공지능 플랫폼 내 포함된 상기 서버 자원의 동작 상태 및가용 수준을 모니터링 하는 자원제어 프레임워크;를 포함하며,상기 사용자 단말은, 상기 응용 애플리케이션과 통신 네트워크를 통해 연결되어 인공지능 서비스의 구동 요청신호를 전송하거나, 요청에 따른 인공지능 서비스의 구동 결과값을 수신하는 제1단말 통신부; 상기 자원제어 프레임워크와 통신 네트워크를 통해 연결되는 제2단말 통신부; 상기 사용자 단말 내 포함된 상기 단말 자원의 동작상태 및 가용 수준을 모니터링 하여 모니터링 결과정보를 상기 제2단말 통신부를 통해 상기 자원제어 프레임워크에 제공하는 자원 모니터링 결과 제공부; 및 상기 단말 자원을 이용해 인공지능 서비스의 구동을 위한 연산처리를 수행하여 구동 결과값을 생성 가능한 인공지능 구동부;를 포함하는 인공지능 서비스 구동 시스템을 통한인공지능 서비스 구동 방법에 있어서,상기 관리 서버에 접속된 상기 사용자 단말의 상기 제1단말 통신부를 통해 인공지능 서비스의 구동 요청신호가상기 응용 애플리케이션에 전송되는 A단계;공개특허 10-2024-0010198-4-상기 A단계를 통해 인공지능 서비스의 구동 요청신호가 상기 응용 애플리케이션에 수신됨에 따라, 상기 자원제어 프레임워크가 상기 인공지능 플랫폼 내 포함된 상기 서버 자원의 동작 상태 및 가용 수준을 모니터링하여 인공지능 서비스의 구동을 위한 상기 서버 자원의 가용 여부를 판단하는 B단계;상기 B단계를 통한 판단 결과 상기 서버 자원의 가용이 가능할 경우, 상기 인공지능 플랫폼이 구동 결과값을 생성하도록 동작시키는 C-1단계;상기 C-1단계를 통해 상기 인공지능 플랫폼이 상기 서버 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행함으로서 생성된 구동 결과값이 상기 자원제어 프레임워크를 중계하여 상기 응용 애플리케이션에 전송되는 D-1단계; 및상기 D-1단계를 통해 프레임워크로부터 구동 결과값을 제공받은 상기 응용 애플리케이션이 웹을 통해 구동 결과값을 상기 사용자 단말에 시각적으로 출력시키는 E단계;를 포함하는 것을 특징으로 하는관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 방법."}
{"patent_id": "10-2022-0087426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 인공지능 서비스 구동 방법은,상기 B단계를 통한 판단 결과 상기 서버 자원의 가용이 불가능할 경우 상기 제2단말 통신부를 통해 상기 자원모니터링 결과 제공부에 모니터링 결과정보를 요청하는 C-2단계; 상기 C-2단계를 통해 상기 자원제어 프레임워크가 상기 자원 모니터링 결과 제공부에 요청하여 제공받은 모니터링 결과정보가 상기 단말 자원의 가용이 가능함을 나타낼 경우, 상기 인공지능 구동부가 구동 결과값을 생성하도록 동작시키는 C-3단계; 및상기 C-3단계를 통해 상기 인공지능 구동부가 상기 단말 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행함으로서 생성된 구동 결과값이 상기 자원제어 프레임워크를 중계하여 상기 응용 애플리케이션에 전송되는 D-2단계;를 더 포함하며,상기 E단계는 상기 D-2단계를 통해 프레임워크로부터 구동 결과값을 제공받은 상기 응용 애플리케이션이 웹을통해 구동 결과값을 상기 사용자 단말에 시각적으로 출력시키는 단계인 것을 특징으로 하는 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 방법."}
{"patent_id": "10-2022-0087426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 인공지능 서비스 구동 방법은,상기 C-2단계를 통해 상기 자원제어 프레임워크가 상기 자원 모니터링 결과 제공부에 요청하여 제공받은 모니터링 결과정보가 상기 단말 자원의 가용이 불가능함을 나타낼 경우, 상기 인공지능 플랫폼이 구동 결과값을 생성하도록 동작시키는 요청신호를 순차적으로 대기열에 배치시키는 C-4단계;를 더 포함하며,상기 대기열 순서에 따라 순차적으로 상기 C-4단계 후 C-1단계가 수행되는 것을 특징으로 하는 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 방법."}
{"patent_id": "10-2022-0087426", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 자체적으로 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구성으로서 서버 자원을 다수 포함하며, 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구성으로서 단 말 자원을 다수 포함한 사용자 단말이 적어도 하나 이상 통신 네트워크를 통해 연결되어 접속 가능한 관리 서 (뒷면에 계속)"}
{"patent_id": "10-2022-0087426", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구 동 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0087426", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷으로 제공되는 거의 모든 온라인 서비스는 메인 서버시스템에 서비스 운용을 위한 애플리케이션을 설치하 고, 네트워크를 통해서 접속한 사용 단말에서 특정 명령 정보를 보내어 서버의 애플리케이션을 실행시키고 그 결과값을 수신하여 표시해주는 방식으로 구성되어 있다. 여기서, 사용자가 작동시키는 컴퓨터, 노트북, 태블릿, 휴대폰 등의 단말은 서비스 애플리케이션의 구동에 로컬 자원을 제공하지도 않고 애플리케이션의 구동에 관여도 하지 않는 것이 일반적이다. 이러한 기존 형태의 서버시스템, 클라우드 시스템은 동시 사용자들이 증가할 경우, 모든 요청을 수용하기 위하 여 고성능, 고사양의 하드웨어 및 소프트웨어의 지속적인 증설을 필요로 하며 동시 사용자가 일시적으로 몰릴 경우에는 처리가 불가능하여 지연되는 시간이 길어지거나 심하면 서버가 다운되는 한계점이 있다. 이에 대한 극복을 위해 서버의 성능적 측면을 개선시키거나 사용자 단말의 접속 및 이용 방식을 별도의 제어를 통해 특정하게 변형시키는 등 다양한 기술적 시도가 이루어지고 있다. 이와 관련하여, 사용자가 하나 이상의 후보 서비스 구동 환경 중에서 사용자의 기준을 만족하는 최적 및 최선의 서비스 구동 환경을 용이하게 선택할 수 있도록 지원하기 위해 마련된 종래기술에 대한 선행문헌에는 대한민국 등록특허공보 제10-2081727호의 \"서비스 최적화 운영관리 및 의사결정 지원을 위한 서비스 제공 시스템 및 방법\"(이하, '종래기술'이라고 함)이 있다. 하지만 종래기술을 비롯한 기존의 사용자 단말과 관리 서버 간의 접속 부하를 분산시키기 위해 개발된 인공지능 서비스 구동 시스템들의 경우, 점점 고성능화 되어 가는 인공지능 서비스의 발전 속도에 발맞추어 원활한 서비 스를 제공할 수 있는 수준에 미치지 못하였으며, 무엇보다 단순히 서버 혹은 단말 자체의 단편적 측면에서의 기 술적 변화만을 고려하다 보니 해당 문제점의 개선 정도가 미미한 수준에 그치게 되는 문제점이 있었다."}
{"patent_id": "10-2022-0087426", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기 문제점을 해결하기 위해 창작된 것으로써, 본 발명의 목적은 서버와 단말 간의 연계적인 기술적 변화를 통해 고성능을 필요로 하는 서비스의 구동에도 전혀 불편함 없이 이용되는 자원의 분산이 효율적으로 이 루어져 서비스의 지연문제가 충분히 해소될 수 있는 인공지능 서비스 구동 시스템 및 방법을 제공하는데 있다."}
{"patent_id": "10-2022-0087426", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여 본 발명의 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 시스템은, 자체적으로 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구성으로서 서버 자원을 다수 포함하며, 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구성으로서 단말 자원을 다수 포함한 사용자 단말이 적어도 하나 이상 통신 네트워크를 통해 연결되어 접속 가능한 관리 서버;를 포함하며, 상기 관리 서버는, 상기 관리 서버에 접속된 상기 사용자 단말로 부터 인공지능 서비스의 구동 요청신호를 수신할 시 인공지능 서비스의 구동을 요청하고, 요청에 따른 인공지능 서비스의 구동 결과값을 제공받아 웹을 통해 상기 사용자 단말에 출력 가능한 응용 애플리케이션; 상기 응용 애 플리케이션을 통한 인공기능 서비스의 구동 요청에 따라 내부에 포함된 상기 서버 자원을 이용해 인공지능 서비 스의 구동을 위한 연산 처리를 수행하여 구동 결과값을 생성 가능한 인공지능 플랫폼; 및 상기 인공지능 플랫폼 내 포함된 상기 서버 자원의 동작 상태 및 가용 수준을 모니터링 하는 자원제어 프레임워크;를 포함한다. 여기서, 상기 사용자 단말은, 상기 응용 애플리케이션과 통신 네트워크를 통해 연결되어 인공지능 서비스의 구 동 요청신호를 전송하거나, 요청에 따른 인공지능 서비스의 구동 결과값을 수신하는 제1단말 통신부; 상기 자원 제어 프레임워크와 통신 네트워크를 통해 연결되는 제2단말 통신부; 상기 사용자 단말 내 포함된 상기 단말 자 원의 동작 상태 및 가용 수준을 모니터링 하여 모니터링 결과정보를 상기 제2단말 통신부를 통해 상기 자원제어 프레임워크에 제공하는 자원 모니터링 결과 제공부; 및 상기 단말 자원을 이용해 인공지능 서비스의 구동을 위 한 연산 처리를 수행하여 구동 결과값을 생성 가능한 인공지능 구동부;를 포함한다. 또한, 상기 자원제어 프레임워크는 상기 응용 애플리케이션을 통해 인공지능 서비스의 구동이 요청될 시 상기 인공지능 플랫폼 내 포함된 상기 서버 자원의 동작 상태 및 가용 수준을 모니터링하여 인공지능 서비스의 구동 을 위한 상기 서버 자원의 가용 여부를 판단하여, 상기 서버 자원의 가용이 가능할 경우 상기 인공지능 플랫폼이 구동 결과값을 생성하도록 동작시키고, 상기 서버 자원의 가용이 불가능할 경우 상기 제2단말 통신부를 통해 상기 자원 모니터링 결과 제공부에 모니터링 결과정보를 요청한다. 아울러, 상기 자원제어 프레임워크는 상기 자원 모니터링 결과 제공부에 요청하여 제공되는 모니터링 결과정보 가 상기 단말 자원의 가용이 가능함을 나타낼 경우, 상기 제2단말 통신부를 통해 상기 인공지능 구동부가 구동 결과값을 생성하여 제공하도록 하고, 상기 자원제어 프레임워크는 상기 자원 모니터링 결과 제공부에 요청하여 제공되는 모니터링 결과정보가 상기 단말 자원의 가용이 불가능함을 나타낼 경우, 상기 인공지능 플랫폼이 구동 결과값을 생성하도록 동작시키는 요청신호를 순차적으로 대기열에 배치시킨다. 아울러, 상기 자원제어 프레임워크는 상기 인공지능 플랫폼이 상기 서버 자원을 이용해 인공지능 서비스의 구동 을 위한 연산 처리를 수행하여 생성된 구동 결과값 또는 상기 인공지능 구동부가 상기 단말 자원을 이용해 인공 지능 서비스의 구동을 위한 연산 처리를 수행하여 생성된 구동 결과값 중 하나를 제공받아 상기 응용 애플리케 이션에 전송하고, 상기 자원제어 프레임워크로부터 구동 결과값을 제공받은 상기 응용 애플리케이션은 웹을 통 해 구동 결과값이 상기 사용자 단말에 시각적으로 출력되도록 한다. 한편, 상기 목적을 달성하기 위하여 본 발명의 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 방법은, 자체적으로 인공지능 서비스 기능의 구동에 이용 가능한 하드웨 어 및 소프트웨어적인 구성으로서 서버 자원을 다수 포함하며, 인공지능 서비스 기능의 구동에 이용 가능한 하 드웨어 및 소프트웨어적인 구성으로서 단말 자원을 다수 포함한 사용자 단말이 적어도 하나 이상 통신 네트워크 를 통해 연결되어 접속 가능한 관리 서버;를 포함하며, 상기 관리 서버는, 상기 관리 서버에 접속된 상기 사용 자 단말로부터 인공지능 서비스의 구동 요청신호를 수신할 시 인공지능 서비스의 구동을 요청하고, 요청에 따른 인공지능 서비스의 구동 결과값을 제공받아 웹을 통해 상기 사용자 단말에 출력 가능한 응용 애플리케이션; 상 기 응용 애플리케이션을 통한 인공지능 서비스의 구동 요청에 따라 내부에 포함된 상기 서버 자원을 이용해 인 공지능 서비스의 구동을 위한 연산 처리를 수행하여 구동 결과값을 생성 가능한 인공지능 플랫폼; 및 상기 인공 지능 플랫폼 내 포함된 상기 서버 자원의 동작 상태 및 가용 수준을 모니터링 하는 자원제어 프레임워크;를 포 함하며, 상기 사용자 단말은, 상기 응용 애플리케이션과 통신 네트워크를 통해 연결되어 인공지능 서비스의 구 동 요청신호를 전송하거나, 요청에 따른 인공지능 서비스의 구동 결과값을 수신하는 제1단말 통신부; 상기 자원 제어 프레임워크와 통신 네트워크를 통해 연결되는 제2단말 통신부; 상기 사용자 단말 내 포함된 상기 단말 자 원의 동작 상태 및 가용 수준을 모니터링 하여 모니터링 결과정보를 상기 제2단말 통신부를 통해 상기 자원제어 프레임워크에 제공하는 자원 모니터링 결과 제공부; 및 상기 단말 자원을 이용해 인공지능 서비스의 구동을 위 한 연산 처리를 수행하여 구동 결과값을 생성 가능한 인공지능 구동부;를 포함하는 인공지능 서비스 구동 시스 템을 통한 인공지능 서비스 구동 방법에 있어서, 상기 관리 서버에 접속된 상기 사용자 단말의 상기 제1단말 통 신부를 통해 인공지능 서비스의 구동 요청신호가 상기 응용 애플리케이션에 전송되는 A단계; 상기 A단계를 통해 인공지능 서비스의 구동 요청신호가 상기 응용 애플리케이션에 수신됨에 따라, 상기 자원제어 프레임워크가 상 기 인공지능 플랫폼 내 포함된 상기 서버 자원의 동작 상태 및 가용 수준을 모니터링하여 인공지능 서비스의 구 동을 위한 상기 서버 자원의 가용 여부를 판단하는 B단계; 상기 B단계를 통한 판단 결과 상기 서버 자원의 가용 이 가능할 경우, 상기 인공지능 플랫폼이 구동 결과값을 생성하도록 동작시키는 C-1단계; 상기 C-1단계를 통해 상기 인공지능 플랫폼이 상기 서버 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행함으로서 생 성된 구동 결과값이 상기 자원제어 프레임워크를 중계하여 상기 응용 애플리케이션에 전송되는 D-1단계; 및 상 기 D-1단계를 통해 프레임워크로부터 구동 결과값을 제공받은 상기 응용 애플리케이션이 웹을 통해 구동 결과값 을 상기 사용자 단말에 시각적으로 출력시키는 E단계;를 포함한다. 그리고 상기 인공지능 서비스 구동 방법은, 상기 B단계를 통한 판단 결과 상기 서버 자원의 가용이 불가능할 경 우 상기 제2단말 통신부를 통해 상기 자원 모니터링 결과 제공부에 모니터링 결과정보를 요청하는 C-2단계; 상 기 C-2단계를 통해 상기 자원제어 프레임워크가 상기 자원 모니터링 결과 제공부에 요청하여 제공받은 모니터링 결과정보가 상기 단말 자원의 가용이 가능함을 나타낼 경우, 상기 인공지능 구동부가 구동 결과값을 생성하도록 동작시키는 C-3단계; 및 상기 C-3단계를 통해 상기 인공지능 구동부가 상기 단말 자원을 이용해 인공지능 서비 스의 구동을 위한 연산 처리를 수행함으로서 생성된 구동 결과값이 상기 자원제어 프레임워크를 중계하여 상기 응용 애플리케이션에 전송되는 D-2단계;를 더 포함하며, 상기 E단계는 상기 D-2단계를 통해 프레임워크로부터 구동 결과값을 제공받은 상기 응용 애플리케이션이 웹을 통해 구동 결과값을 상기 사용자 단말에 시각적으로 출 력시키는 단계이다. 또한, 상기 인공지능 서비스 구동 방법은, 상기 C-2단계를 통해 상기 자원제어 프레임워크가 상기 자원 모니터 링 결과 제공부에 요청하여 제공받은 모니터링 결과정보가 상기 단말 자원의 가용이 불가능함을 나타낼 경우,상기 인공지능 플랫폼이 구동 결과값을 생성하도록 동작시키는 요청신호를 순차적으로 대기열에 배치시키는 C-4 단계;를 더 포함하며, 상기 대기열 순서에 따라 순차적으로 상기 C-4단계 후 C-1단계가 수행된다."}
{"patent_id": "10-2022-0087426", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면 다음과 같은 효과가 있다. 첫째, 인공지능 기능 수행에 필요한 자원의 일부를 사용자의 단말기에서 확보하고, 로컬 자원을 이용하여 인공 지능 기능을 실행함으로써 서버의 자원 부족현상을 감소시킬 수 있으므로 분산 처리에 따른 원활한 서비스 제공 과 서버 비용의 절감을 도모할 수 있다. 둘째, 관리 서버의 자원을 우선으로 하여 인공지능 서비스의 구동에 이용하되, 관리 서버의 자원의 사용이 불가 할 경우 사용자 단말이 기능적 분산을 받아 단말 내 자원을 인공지능 서비스의 구동에 이용 가능하다. 셋째, 관리 서버의 자원의 사용이 불가하고, 이에 이어 사용자 단말의 자원 사용 역시 불가할 경우 대기열을 순 차 배치하여 안정적인 서비스 운영이 가능하다."}
{"patent_id": "10-2022-0087426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 바람직한 실시예에 대하여 첨부된 도면을 참조하여 더 구체적으로 설명하되, 이미 주지된 기술적 부 분에 대해서는 설명의 간결함을 위해 생략하거나 압축하기로 한다. 1. 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 시스 템에 관한 설명 도1을 참조하여 설명하면, 본 발명의 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달 라지는 인공지능 서비스 구동 시스템은 관리 서버; 및 사용자 단말;를 포함한다. 관리 서버는 자체적으로 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구성으 로서 서버 자원을 다수 포함하며, 인공지능 서비스 기능의 구동에 이용 가능한 하드웨어 및 소프트웨어적인 구 성으로서 단말 자원을 다수 포함한 사용자 단말이 적어도 하나 이상 통신 네트워크를 통해 연결되어 접속 가능하다. 이를 위해, 관리 서버는 응용 애플리케이션, 인공지능 플랫폼 및 자원제어 프레임워크를 포함한다. 또한, 관리 서버는 물리적 서버 1대 또는 그 이상으로 구성, 연동되는 서버들의 구성 또는 서버의 요소들 을 포함하는 클라우드 시스템일 수 있다. 우선, 응용 애플리케이션은 관리 서버에 접속된 사용자 단말로부터 인공지능 서비스의 구동 요 청신호를 수신할 시 인공지능 서비스의 구동을 인공지능 플랫폼에 요청한다. 또한, 응용 애플리케이션은 인공지능 서비스의 구동 요청에 따른 인공지능 서비스의 구동 결과값을 자원제 어 프레임워크을 거쳐 인공지능 플랫폼 혹은 사용자 단말로부터 제공받아 웹을 통해 사용자 단 말에 출력 가능하다. 다음으로, 인공지능 플랫폼은 응용 애플리케이션을 통한 인공기능 서비스의 구동 요청에 따라 내부에 포함된 서버 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행하여 구동 결과값을 생성 가능하다. 여기서, 인공지능 플랫폼 내 마련된 서버 자원이라 함은 중앙연산장치 CPU, 메모리 RAM, 저장장치 SSD/HDD, 그래픽 처리장치 GPU 등 하드웨어를 포함하고 이들을 구동하는 OS 와 소프트웨어를 설치한 서버로 동 작하는 기계 장치 등이 해당되며, 결국'자원'이란 관리 서버 내의 하드웨어와 소프트웨어 전체 또는 일부를 의미한다. 마지막으로, 자원제어 프레임워크은 인공지능 플랫폼 내 포함된 서버 자원의 동작 상태 및 가용 수준 을 모니터링 하여 인공지능 기능을 구동하는 데 필요한 자원을 관리, 제어하는 오케스트레이션 기능을 갖추고 있다. 이와 연계되어 사용자 단말은 제1단말 통신부, 제2단말 통신부, 자원 모니터링 결과 제공부 , 인공지능 구동부를 포함하며, 이러한 구성들은 사용자 단말에 설치된 클라이언트 에이전트의 구성으로서 구현 가능하다. 우선, 제1단말 통신부는 응용 애플리케이션과 통신 네트워크를 통해 연결되어 인공지능 서비스의 구 동 요청신호를 전송하거나, 요청에 따른 인공지능 서비스의 구동 결과값을 수신한다. 다음으로, 제2단말 통신부는 제1단말 통신부와 구분되어 별개로 기능하기 위해 스레드(thread)를 달 리 구축하고 있으며, 자원제어 프레임워크와 통신 네트워크를 통해 연결되어 상호 신호, 정보의 송신 또는 수신 을 수행하게 된다. 또한, 자원 모니터링 결과 제공부는 사용자 단말 내 포함된 단말 자원의 동작 상태 및 가용 수준을 모니터링 하여 모니터링 결과정보를 제2단말 통신부를 통해 자원제어 프레임워크에 제공한다. 마지막으로, 인공지능 구동부는 단말 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행하여 구동 결과값을 생성 가능하다. 여기서, 단말 자원이라 함은 중앙연산장치 CPU, 메모리 RAM, 저장장치 SSD/HDD, 그래픽 처리장치 GPU 등 하드웨 어를 포함하고 이들을 구동하는 OS 와 소프트웨어를 설치한 사용자 단말로 동작하는 기계 장치 등이 해당 되며, 결국'자원'이란 사용자 단말 내의 하드웨어와 소프트웨어 전체 또는 일부를 의미한다. 2. 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지능 서비스 구동 방법 에 관한 설명 도2를 참조하여 본 발명의 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공 지능 서비스 구동 방법이 어떤 과정의 순서로 진행되는지 설명한다. 구동 요청단계(S110, A단계) 본 단계에서는 관리 서버에 접속된 사용자 단말의 제1단말 통신부를 통해 인공지능 서비스의 구 동 요청신호가 응용 애플리케이션에 전송되는 과정이 진행되며 인공지능 서비스의 구동을 위한 일련의 과 정이 시작된다. 이를 통해 인공지능 서비스의 구동이 시작되면 우선적으로 해당 서비스의 구동을 수행할 자원의 대상을 어디에 배정시켜 안정적인 오케스트레이션을 통해 접속 부하를 최소화할 것인지를 판단하는 과정이 이어지게 된다. 가용여부 판단단계(S120, B단계) 본 단계에서는 앞 서 진행된 구동 요청단계(S110)를 통해 인공지능 서비스의 구동 요청신호가 응용 애플리케이 션에 수신됨에 따라, 자원제어 프레임워크가 인공지능 플랫폼 내 포함된 서버 자원의 동작 상태 및 가용 수준을 모니터링하여 인공지능 서비스의 구동을 위한 서버 자원의 가용 여부를 판단하는 과정이 진행된 다. 이를 통해, 판단 결과 자원제어 프레임워크가 인공지능 플랫폼 내 포함된 서버 자원의 이용이 가능한 경우와 이용이 불가능한 경우로 구분하여 각각에 대응되는 구분되는 단계적 흐름을 보이게 된다. 제1구동결과값 생성단계(S130, C-1단계) 본 단계에서는 앞서 진행된 가용여부 판단단계(S120)를 통해 판단 결과 자원제어 프레임워크가 인공지능 플랫폼 내 포함된 서버 자원의 이용이 가능한 경우에 진행되는 과정으로, 인공지능 플랫폼이 내부에 포함된 서버 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행하여 구동 결과값을 생성하도록 동 작하는 과정이 진행된다. 모니터링 결과 요청단계(S125, C-2단계) 이와 비교해, 본 단계에서는 앞서 진행된 가용여부 판단단계(S120)를 통해 판단 결과 자원제어 프레임워크(11 3)가 인공지능 플랫폼 내 포함된 서버 자원의 이용이 불가능한 경우에 진행되는 과정으로, 자원제어 프레 임워크가 제2단말 통신부를 통해 자원 모니터링 결과 제공부에 모니터링 결과정보를 요청하는 과정이 진행된다. 해당 과정을 통해, 자원제어 프레임워크는 자원 모니터링 결과 제공부에 요청하여 제공받은 모니터링 결과정보를 기반으로 사용자 단말 내 구비된 단말 자원의 가용 여부를 판단하는 과정이 진행된다. 이를 통해, 판단 결과 자원제어 프레임워크가 사용자 단말 내 구비된 단말 자원의 이용이 가능한 경 우와 이용이 불가능한 경우로 구분하여 각각에 대응되는 구분되는 단계적 흐름을 보이게 된다. 제2구동결과값 생성단계(S135, C-3단계) 본 단계에서는 앞서 진행된 모니터링 결과 요청단계(S125)를 통해 판단 결과 자원제어 프레임워크가 사용 자 단말 내 구비된 단말 자원의 이용이 가능한 경우에 진행되는 과정으로, 인공지능 구동부가 단말 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행하여 구동 결과값을 생성하도록 동작하는 과정 이 진행된다. 모니터링 결과 요청단계(S125, C-2단계) 이와 비교해, 본 단계에서는 앞서 진행된 모니터링 결과 요청단계(S125)를 통해 판단 결과 자원제어 프레임워크 가 사용자 단말 내 구비된 단말 자원의 이용이 불가능한 경우에 진행되는 과정으로, 인공지능 플랫폼 이 내부에 포함된 서버 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행하여 구동 결과값 을 생성하도록 동작시키는 요청신호를 순차적으로 대기열에 배치시키는 과정이 진행된다. 이를 통해, 서버 자원과 단말 자원 모두 현재 가용이 불가할 경우 우선적으로 대기열을 만들어 순차 배치시킨 뒤 가용 가능 상태가 되면 차례로 제1구동결과값 생성단계(S130)로 이동되어 해당 과정이 수행될 수 있도록 한 다. 구동결과값 전송단계(S140, D-1단계 또는 D-2단계) 본 단계에서는 앞서 진행된 제1구동결과값 생성단계(S130)를 통해 인공지능 플랫폼이 서버 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행함으로서 생성된 구동 결과값이 자원제어 프레임워크를 중계하여 응용 애플리케이션에 전송하는 과정이 진행된다. 구체적으로, 인공지능 플랫폼이 서버 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행함으 로서 생성된 구동 결과값이 자원제어 프레임워크를 거쳐 응용 애플리케이션에 전송된다. 또한, 실시에 따라, 본 단계에서는 앞서 진행된 과정이 제2구동결과값 생성단계(S135)일 경우, 제2구동결과값 생성단계(S135)를 통해 인공지능 구동부가 단말 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리 를 수행함으로서 생성된 구동 결과값이 자원제어 프레임워크를 중계하여 응용 애플리케이션에 전송하 는 과정이 진행된다. 구체적으로, 인공지능 구동부가 단말 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행함으 로서 생성된 구동 결과값이 자원제어 프레임워크를 거쳐 응용 애플리케이션에 전송된다. 결과 출력단계(S150, E단계) 본 단계에서는 앞서 진행된 구동결과값 전송단계(S150)를 통해 인공지능 플랫폼이 서버 자원을 이용해 인 공지능 서비스의 구동을 위한 연산 처리를 수행함으로서 생성된 구동 결과값 또는 인공지능 구동부가 단말 자원을 이용해 인공지능 서비스의 구동을 위한 연산 처리를 수행함으로서 생성된 구동 결과값을 제공 받은 응용 애플리케이션이 웹을 통해 구동 결과값을 사용자 단말에 시각적으로 출력시켜 결과적으로 인공지능 서비스의 구동이 완료되도록 한다. 본 발명에 개시된 실시예는 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의해서 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 보호범위는 아래 청구범위에 의하여 해 석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리 범위에 포함되는 것으로 해석되 어야 할 것이다. 부호의 설명100 : 인공지능 서비스 구동 시스템 110 : 관리 서버 111 : 응용 애플리케이션 112 : 인공지능 플랫폼 113 : 자원제어 프레임워크 120 : 사용자 단말 121 : 제1단말 통신부 122 : 제2단말 통신부 123 : 자원 모니터링 결과 제공부 124 : 인공지능 구동부"}
{"patent_id": "10-2022-0087426", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명에 따른 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지 능 서비스 구동 시스템의 세부적 구성들을 조시한 블록도이다. 도2는 본 발명에 따른 관리 서버 및 사용자 단말의 자원 가용 여부에 따라 자원 이용 대상이 달라지는 인공지 능 서비스 구동 방법의 과정을 도시한 순서도이다."}
