{"patent_id": "10-2022-0186015", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0103653", "출원번호": "10-2022-0186015", "발명의 명칭": "디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법", "출원인": "광운대학교 산학협력단", "발명자": "정한울"}}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디지털 로직 회로의 회로지연 확률분포 추정 장치에 있어서,상기 회로지연 확률분포 추정 장치는, 상기 디지털 로직 회로의 회로지연 확률분포 추정 정보를 생성하기 위한하나 이상의 프로그램을 저장하는 메모리; 및 상기 하나 이상의 프로그램에 따라 상기 회로지연 확률분포 추정정보를 생성하기 위한 동작들을 수행하는 하나 이상의 프로세서;를 포함하고, 상기 프로세서에 의하여 수행되는동작들은,추정 대상 디지털 로직 회로로부터 회로지연 훈련 데이터 집합을 획득하고, 상기 회로지연 훈련 데이터 집합을이용하여 회로지연의 집합을 획득하는 단계;상기 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성하는 단계; 및상기 훈련 파라미터를 이용하여 단위 인버터의 지연 확률분포를 기반으로 생성한 회로지연 확률분포 추정 모델을 이용하여 상기 추정 대상 디지털 로직 회로의 회로지연 확률분포 추정 정보를 생성하는 단계;를 포함하는,디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 회로지연 훈련 데이터 집합을 이용하여 회로지연의 집합을 획득하는 것은,상기 회로지연 훈련 데이터 집합의 누적확률분포 역함수를 획득하고, 미리 결정된 시그마(sigma) 영역을 미리결정된 기준 개수로 나눈 시그마들의 집합을 획득하고, 상기 시그마들의 집합을 확률로 변환하여 상기 누적확률분포 역함수에 입력하여 획득하는 것을 특징으로 하는,디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 훈련 파라미터는,상기 단위 인버터의 상승(rising) 지연 비율을 결정하는데 이용되는 제1 파라미터; 및상기 단위 인버터의 하강(falling) 지연 비율을 결정하는데 이용되는 제2 파라미터;를 포함하는 것을 특징으로하는,디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 회로지연 확률분포 추정 모델은,상기 단위 인버터의 상승 지연 확률분포에 상기 제1 파라미터를 적용한 제1 확률분포와 상기 단위 인버터의 하강 지연 확률분포에 상기 제2 파라미터를 적용한 제2 확률분포를 합성곱(convolution)하여 생성한 제1 수학식을이용하는 것을 특징으로 하는,디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0103653-3-제4항에 있어서,상기 훈련 파라미터는,상기 제1 파라미터를 적용함에 따라 상기 제1 확률분포의 평균이 변화하는 것을 방지하거나,상기 제2 파라미터를 적용함에 따라 상기 제2 확률분포의 평균이 변화하는 것을 방지하는데 이용되는 제3 파라미터를 더 포함하는 것을 특징으로 하는,디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 회로지연 확률분포 추정 모델은,상기 제1 수학식에 상기 제3 파라미터와 상기 회로지연의 집합의 0 sigma에 해당하는 값을 적용하여 생성되는제2 수학식을 포함하는 것을 특징으로 하는,디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 회로지연 확률분포 추정 모델은,상기 제2 수학식의 누적확률분포함수인 제3 수학식; 및상기 제2 수학식의 누적확률분포 역함수인 제4 수학식;을 포함하는 것을 특징으로 하는,디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성하는 것은,상기 회로지연의 집합과 상기 수학식 5의 유사성을 수치화하고, 상기 유사성이 커지도록 하는 훈련 파라미터를결정하는 것을 특징으로 하는,디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 유사성은,상기 회로지연의 집합에서, 상기 수학식 5에 미리 결정된 시그마(sigma) 영역을 미리 결정된 기준 개수로 나눈시그마들의 집합을 대입한 값을 빼는 방식으로 생성된 제1 값에, 상기 시그마들의 집합을 곱한 제2 값으로 나타나는 손실함수인 것을 특징으로 하는,디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성하는 것은상기 손실함수에 베이지안 최적화(Bayesian Optimization)를 적용하여 상기 손실함수의 최솟값을 결정하고, 상기 손실함수의 최솟값에 대응하는 훈련 파라미터를 결정하는 것을 특징으로 하는,공개특허 10-2024-0103653-4-디지털 로직 회로의 회로지연 확률분포 추정 장치."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "디지털 로직 회로의 회로지연 확률분포 추정 장치에서 수행하는 디지털 로직 회로의 회로지연 확률분포 추정 방법에 있어서,추정 대상 디지털 로직 회로로부터 회로지연 훈련 데이터 집합을 획득하고, 상기 회로지연 훈련 데이터 집합을이용하여 회로지연의 집합을 획득하는 단계;상기 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성하는 단계; 및상기 훈련 파라미터를 이용하여 단위 인버터의 지연 확률분포를 기반으로 생성한 회로지연 확률분포 추정 모델을 이용하여 상기 추정 대상 디지털 로직 회로의 회로지연 확률분포 추정 정보를 생성하는 단계;를 포함하는,디지털 로직 회로의 회로지연 확률분포 추정 방법."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 회로지연 훈련 데이터 집합을 이용하여 회로지연의 집합을 획득하는 것은,상기 회로지연 훈련 데이터 집합의 누적확률분포 역함수를 획득하고, 미리 결정된 시그마(sigma) 영역을 미리결정된 기준 개수로 나눈 시그마들의 집합을 획득하고, 상기 시그마들의 집합을 확률로 변환하여 상기 누적확률분포 역함수에 입력하여 획득하는 것을 특징으로 하는,디지털 로직 회로의 회로지연 확률분포 추정 방법."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 훈련 파라미터는,상기 단위 인버터의 상승(rising) 지연 비율을 결정하는데 이용되는 제1 파라미터; 및상기 단위 인버터의 하강(falling) 지연 비율을 결정하는데 이용되는 제2 파라미터;를 포함하는 것을 특징으로하는,디지털 로직 회로의 회로지연 확률분포 추정 방법."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제3항에 있어서,상기 회로지연 확률분포 추정 모델은,상기 단위 인버터의 상승 지연 확률분포에 상기 제1 파라미터를 적용한 제1 확률분포와 상기 단위 인버터의 하강 지연 확률분포에 상기 제2 파라미터를 적용한 제2 확률분포를 합성곱(convolution)하여 생성한 제1 수학식을이용하는 것을 특징으로 하는,디지털 로직 회로의 회로지연 확률분포 추정 방법."}
{"patent_id": "10-2022-0186015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항 내지 제14항 중 어느 한 항에 기재된 디지털 로직 회로의 회로지연 확률분포 추정 방법을 컴퓨터에서 실행시키기 위하여 컴퓨터로 읽을 수 있는 기록 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법을 적용함으로써, 단위 인버터의 지연 확률분포와 머신러닝을 통하여 획득한 파라미터를 이용하여 복잡한 디지털 로직 회로의 회로 지연 확률분포를 신속하고 정확하게 획득할 수 있다."}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 회로지연 확률분포 추정 장치에 관한 것이다. 보다 상세하게는, 본 발명은 디지털 로직 회로의 회로 지연 확률분포 추정 장치에 관한 것이다. 본 발명의 연구는 삼성전자 미래기술육성센터의 재원으로 삼성전자 미 래육성사업부의 지원을 받아 수행된 삼성전자 미래기술육성사업인 '임베디드 메모리 성능 예측 및 최적 설계 자 동 생성 인공지능 개발(No. SRFC-IT2102-06)'과 관련된다."}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 부분에 기술된 내용은 단순히 본 실시예에 대한 배경 정보를 제공할 뿐 종래기술을 구성하는 것은 아니다. 최근 수 나노미터의 미세 공정을 활용한 휴대폰, 자율주행 자동차, IoT 가전제품 등 다양한 전자 제품들이 출시 되고 있다. 집적회로는 전자제품에 필수적으로 사용되는 구성요소이기 때문에, 집적회로의 성능이 전자제품의 성능을 결정한다. 수 나노미터의 매우 작은 트랜지스터까지 생산할 수 있게 되면서 집적도가 크게 향상되었지만, 공정 편차의 영 향 또한 크게 증가하여 집적회로의 성능이 공정 편차에 지대한 영향을 받게 되었다. 공정 편차의 영향을 예측하여 성능의 편차가 어느 정도 생길 것인지 설계 단계에서 정확하고 신속하게 예측할 수 있는 기술의 연구 개발이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-2023096호(2019.09.11.)"}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 목적은, 복잡한 디지털 로직 회로의 회로지연 확률분포를 단위 인버터의 지연 확률분 포와 머신러닝을 통하여 획득한 파라미터를 이용하여 신속하고 정확하게 획득할 수 있는 디지털 로직 회로의 회 로지연 확률분포 추정 장치 및 방법을 제공하는데 있다. 본 발명의 명시되지 않은 또 다른 목적들은 하기의 상세한 설명 및 그 효과로부터 용이하게 추론할 수 있는 범 위 내에서 추가적으로 고려될 수 있다."}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치는, 상기 디지털 로직 회로의 회로지연 확률분포 추정 정보를 생성하기 위한 하나 이상의 프로그램을 저장하는 메모 리; 및 상기 하나 이상의 프로그램에 따라 상기 회로지연 확률분포 추정 정보를 생성하기 위한 동작들을 수행하 는 하나 이상의 프로세서;를 포함하고, 상기 프로세서에 의하여 수행되는 동작들은, 추정 대상 디지털 로직 회 로로부터 회로지연 훈련 데이터 집합을 획득하고, 상기 회로지연 훈련 데이터 집합을 이용하여 회로지연의 집합 을 획득하는 단계; 상기 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성하는 단계; 및 상기 훈련 파라미터를 이용하여 단위 인버터의 지연 확률분포를 기반으로 생성한 회로지연 확률분포 추정 모델을 이용하여 상기 추정 대상 디지털 로직 회로의 회로지연 확률분포 추정 정보를 생성하는 단계;를 포 함한다. 여기서, 상기 회로지연 훈련 데이터 집합을 이용하여 회로지연의 집합을 획득하는 것은, 상기 회로지연 훈련 데 이터 집합의 누적확률분포 역함수를 획득하고, 미리 결정된 시그마(sigma) 영역을 미리 결정된 기준 개수로 나 눈 시그마들의 집합을 획득하고, 상기 시그마들의 집합을 확률로 변환하여 상기 누적확률분포 역함수에 입력하 여 획득하는 것을 특징으로 한다. 여기서, 상기 훈련 파라미터는, 상기 단위 인버터의 상승(rising) 지연 비율을 결정하는데 이용되는 제1 파라미 터; 및 상기 단위 인버터의 하강(falling) 지연 비율을 결정하는데 이용되는 제2 파라미터;를 포함한다. 여기서, 상기 회로지연 확률분포 추정 모델은, 상기 단위 인버터의 상승 지연 확률분포에 상기 제1 파라미터를 적용한 제1 확률분포와 상기 단위 인버터의 하강 지연 확률분포에 상기 제2 파라미터를 적용한 제2 확률분포를합성곱(convolution)하여 생성한 제1 수학식을 이용하는 것을 특징으로 한다. 여기서, 상기 훈련 파라미터는, 상기 제1 파라미터를 적용함에 따라 상기 제1 확률분포의 평균이 변화하는 것을 방지하거나, 상기 제2 파라미터를 적용함에 따라 상기 제2 확률분포의 평균이 변화하는 것을 방지하는데 이용되 는 제3 파라미터를 더 포함하는 것을 특징으로 한다. 여기서, 상기 회로지연 확률분포 추정 모델은, 상기 제1 수학식에 상기 제3 파라미터와 상기 회로지연의 집합의 0 sigma에 해당하는 값을 적용하여 생성되는 제2 수학식을 포함하는 것을 특징으로 한다. 여기서, 상기 회로지연 확률분포 추정 모델은, 상기 제2 수학식의 누적확률분포함수인 제3 수학식; 및 상기 제2 수학식의 누적확률분포 역함수인 제4 수학식;을 포함하는 것을 특징으로 한다. 여기서, 상기 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성하는 것은, 상기 회 로지연의 집합과 상기 수학식 5의 유사성을 수치화하고, 상기 유사성이 커지도록 하는 훈련 파라미터를 결정하 는 것을 특징으로 한다. 여기서, 상기 유사성은, 상기 회로지연의 집합에서, 상기 수학식 5에 미리 결정된 시그마(sigma) 영역을 미리 결정된 기준 개수로 나눈 시그마들의 집합을 대입한 값을 빼는 방식으로 생성된 제1 값에, 상기 시그마들의 집 합을 곱한 제2 값으로 나타나는 손실함수인 것을 특징으로 한다. 상기 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성하는 것은, 상기 손실함수에 베이지안 최적화(Bayesian Optimization)를 적용하여 상기 손실함수의 최솟값을 결정하고, 상기 손실함수의 최 솟값에 대응하는 훈련 파라미터를 결정하는 것을 특징으로 한다. 상술한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치에 서 수행하는 디지털 로직 회로의 회로지연 확률분포 추정 방법은, 추정 대상 디지털 로직 회로로부터 회로지연 훈련 데이터 집합을 획득하고, 상기 회로지연 훈련 데이터 집합을 이용하여 회로지연의 집합을 획득하는 단계; 상기 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성하는 단계; 및 상기 훈련 파 라미터를 이용하여 단위 인버터의 지연 확률분포를 기반으로 생성한 회로지연 확률분포 추정 모델을 이용하여 상기 추정 대상 디지털 로직 회로의 회로지연 확률분포 추정 정보를 생성하는 단계;를 포함한다. 여기서, 상기 회로지연 훈련 데이터 집합을 이용하여 회로지연의 집합을 획득하는 것은, 상기 회로지연 훈련 데 이터 집합의 누적확률분포 역함수를 획득하고, 미리 결정된 시그마(sigma) 영역을 미리 결정된 기준 개수로 나 눈 시그마들의 집합을 획득하고, 상기 시그마들의 집합을 확률로 변환하여 상기 누적확률분포 역함수에 입력하 여 획득하는 것을 특징으로 한다. 여기서, 상기 훈련 파라미터는, 상기 단위 인버터의 상승(rising) 지연 비율을 결정하는데 이용되는 제1 파라미 터; 및 상기 단위 인버터의 하강(falling) 지연 비율을 결정하는데 이용되는 제2 파라미터;를 포함하는 것을 특 징으로 한다. 여기서, 상기 회로지연 확률분포 추정 모델은, 상기 단위 인버터의 상승 지연 확률분포에 상기 제1 파라미터를 적용한 제1 확률분포와 상기 단위 인버터의 하강 지연 확률분포에 상기 제2 파라미터를 적용한 제2 확률분포를 합성곱(convolution)하여 생성한 제1 수학식을 이용하는 것을 특징으로 한다. 상술한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 컴퓨터 프로그램은 컴퓨터로 읽을 수 있는 기록 매체 에 저장되어 상기한 디지털 로직 회로의 회로지연 확률분포 추정 방법 중 어느 하나를 컴퓨터에서 실행시킨다."}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이 본 발명의 일 실시예에 따르면, 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법을 적용함으로써, 단위 인버터의 지연 확률분포와 머신러닝을 통하여 획득한 파라미터를 이용하여 복잡 한 디지털 로직 회로의 회로지연 확률분포를 신속하고 정확하게 획득할 수 있다. 여기에서 명시적으로 언급되지 않은 효과라 하더라도, 본 발명의 기술적 특징에 의해 기대되는 이하의 명세서에 서 기재된 효과 및 그 잠정적인 효과는 본 발명의 명세서에 기재된 것과 같이 취급된다."}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세히 설명한다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 게시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단"}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "지 본 실시예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, “가진 다”, “가질 수 있다”, “포함한다” 또는 “포함할 수 있다” 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제 하지 않는 것으로 이해되어야 한다. 제2, 제1 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는 데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제2 구성요소는 제1 구성요소로 명명될 수 있고, 유사하게 제1 구성요소도 제2 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서 각 단계들에 있어 식별부호(예를 들어, a, b, c 등)는 설명의 편의를 위하여 사용되는 것으로 식 별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수도 있고 실질적 으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 이하에서 첨부한 도면을 참조하여 본 발명에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법의 다양한 실시예에 대해 상세하게 설명한다. 본 명세서에 기재된 실시예들은 스태틱 랜덤 엑세스 메모리(SRAM), SoC(System-on-Chips)뿐만 아니라 다양한 종 류의 디지털 로직 회로의 회로지연 관련 정보를 획득하는데 적용될 수 있다. 도 1은 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치의 구성을 설명하기 위한 도면이다. 디지털 로직 회로의 회로지연 확률분포 추정 장치는 적어도 하나의 프로세서, 컴퓨터 판독 가능한 저 장매체 및 통신 버스를 포함한다. 프로세서는 디지털 로직 회로의 회로지연 확률분포 추정 장치로 동작하도록 제어할 수 있다. 예컨대, 프로세서는 컴퓨터 판독 가능한 저장 매체에 저장된 하나 이상의 프로그램들을 실행할 수 있다. 하나 이상의 프로그램들은 하나 이상의 컴퓨터 실행 가능 명령어를 포함할 수 있으며, 컴퓨터 실행 가능 명령어는 프로세서에 의해 실행되는 경우 디지털 로직 회로의 회로지연 확률분포 추정 장치로 하여금 예시적인 실시예에 따른 동작들을 수행하도록 구성될 수 있다. 컴퓨터 판독 가능한 저장 매체는 컴퓨터 실행 가능 명령어 내지 프로그램 코드, 프로그램 데이터 및/또는 다른 적합한 형태의 정보를 저장하도록 구성된다. 컴퓨터 실행 가능 명령어 내지 프로그램 코드, 프로그램 데이 터 및/또는 다른 적합한 형태의 정보는 입출력 인터페이스나 통신 인터페이스를 통해서도 주어질 수 있다. 컴퓨터 판독 가능한 저장 매체에 저장된 프로그램은 프로세서에 의해 실행 가능한 명령어 의 집합을 포함한다. 일 실시예에서, 컴퓨터 판독 가능한 저장 매체는 메모리(랜덤 액세스 메모리와 같은 휘발성 메모리, 비휘발성 메모리, 또는 이들의 적절한 조합), 하나 이상의 자기 디스크 저장 디바이스들, 광학 디스크 저장 디바이스들, 플래시 메모리 디바이스들, 그 밖에 디지털 로직 회로의 회로지연 확률분포 추정 장치 에 의해 액세스되고 원하는 정보를 저장할 수 있는 다른 형태의 저장 매체, 또는 이들의 적합한 조합일 수 있다. 통신 버스는 프로세서, 컴퓨터 판독 가능한 저장 매체를 포함하여 디지털 로직 회로의 회로지연 확률분포 추정 장치의 다른 다양한 컴포넌트들을 상호 연결한다. 디지털 로직 회로의 회로지연 확률분포 추정 장치는 또한 하나 이상의 입출력 장치를 위한 인터페이스를 제공하는 하나 이상의 입출력 인터페이스 및 하나 이상의 통신 인터페이스를 포함할 수 있다. 입출력 인터페이스 및 통신 인터페이스는 통신 버스에 연결된다. 입출력 장치(미도시)는 입출력 인터페 이스를 통해 디지털 로직 회로의 회로지연 확률분포 추정 장치의 다른 컴포넌트들에 연결될 수 있다. 프로세서는 추정 대상 디지털 로직 회로로부터 회로지연 훈련 데이터 집합을 획득하고, 회로지연 훈련 데 이터 집합을 이용하여 회로지연의 집합을 획득하고, 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈 련 파라미터를 생성하고, 훈련 파라미터를 이용하여 단위 인버터의 지연 확률분포를 기반으로 생성한 회로지연 확률분포 추정 모델을 이용하여 추정 대상 디지털 로직 회로의 회로지연 확률분포 추정 정보를 생성할 수 있다. 프로세서를 통하여 수행되는 디지털 로직 회로의 회로지연 확률분포 추정 방법에 대해서는 도 2 이하를 통 하여 보다 상세하게 설명한다. 도 2는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 방법을 설명하기 위한 흐름도 이다. S100 단계에서, 프로세서는 추정 대상 디지털 로직 회로로부터 회로지연 훈련 데이터 집합을 획득하고, 회 로지연 훈련 데이터 집합을 이용하여 회로지연의 집합을 획득할 수 있다. S200 단계에서, 프로세서는 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성 할 수 있다.S300 단계에서, 프로세서는 훈련 파라미터를 이용하여 단위 인버터의 지연 확률분포를 기반으로 생성한 회 로지연 확률분포 추정 모델을 이용하여 추정 대상 디지털 로직 회로의 회로지연 확률분포 추정 정보를 생성할 수 있다. 여기서, 프로세서는 회로지연 훈련 데이터 집합의 누적확률분포 역함수를 획득하고, 미리 결정된 시그마 (sigma) 영역을 미리 결정된 기준 개수로 나눈 시그마들의 집합을 획득하고, 시그마들의 집합을 확률로 변환하 여 누적확률분포 역함수에 입력하여 획득하는 방식으로 회로지연 훈련 데이터 집합을 이용하여 회로지연의 집합 을 획득할 수 있다. 훈련 파라미터는 제1 파라미터, 제2 파라미터 및 제3 파라미터를 포함할 수 있다. 제1 파라미터는 단위 인버터의 상승(rising) 지연 비율을 결정하는데 이용될 수 있다. 제2 파라미터는 단위 인버터의 하강(falling) 지연 비율을 결정하는데 이용될 수 있다. 프로세서가 이용하는 회로지연 확률분포 추정 모델은 단위 인버터의 상승 지연 확률분포에 제1 파라미터를 적용한 제1 확률분포와 단위 인버터의 하강 지연 확률분포에 제2 파라미터를 적용한 제2 확률분포를 합성곱 (convolution)하여 생성한 제1 수학식을 포함할 수 있다. 제3 파라미터는 제1 파라미터를 적용함에 따라 제1 확률분포의 평균이 변화하는 것을 방지하거나, 제2 파라미터 를 적용함에 따라 제2 확률분포의 평균이 변화하는 것을 방지하는데 이용될 수 있다. 회로지연 확률분포 추정 모델은 제1 수학식에 제3 파라미터와 회로지연의 집합의 0 sigma에 해당하는 값을 적용 하여 생성되는 제2 수학식을 포함할 수 있다. 회로지연 확률분포 추정 모델은 제2 수학식의 누적확률분포함수인 제3 수학식 및 제2 수학식의 누적확률분포 역 함수인 제4 수학식을 더 포함할 수 있다. 상술한 제1 수학식, 제2 수학식, 제3 수학식 및 제4 수학식에 대해서는 도 5 이하를 통하여 보다 상세하게 설명 한다. 프로세서는 회로지연의 집합과 수학식 5의 유사성을 수치화하고, 유사성이 커지도록 하는 방식으로 회로지 연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성할 수 있다. 여기서, 유사성은 회로지연의 집합에서, 수학식 5에 미리 결정된 시그마(sigma) 영역을 미리 결정된 기준 개수 로 나눈 시그마들의 집합을 대입한 값을 빼는 방식으로 생성된 제1 값에, 시그마들의 집합을 곱한 제2 값으로 나타나는 손실함수일 수 있다. 프로세서는 손실함수에 베이지안 최적화(Bayesian Optimization)를 적용하여 손실함수의 최솟값을 결정하 고, 손실함수의 최솟값에 대응하는 훈련 파라미터를 결정하는 방식으로 회로지연의 집합에 머신러닝을 적용하여 적어도 하나의 훈련 파라미터를 생성할 수 있다. 도 2에서는 각각의 과정을 순차적으로 실행하는 것으로 기재하고 있으나 이는 예시적으로 설명한 것에 불과하고, 이 분야의 기술자라면 본 발명의 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 도 2에 기재된 순서를 변경하여 실행하거나 또는 하나 이상의 과정을 병렬적으로 실행하거나 다른 과정을 추가하는 것으로 다 양하게 수정 및 변형하여 적용 가능할 것이다. 도 3은 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 방법의 개념을 설명하기 위하 여 예시적으로 나타내는 디지털 로직 회로이다. 도 4는 도 3의 예시적인 디지털 로직 회로의 동작 신호들을 나타내는 도면이다. 보다 상세하게는, 도 3은 에스램(Static Random Access Memory; SRAM)의 일반적인 읽기 엑세스 경로(read access path) 구조를 나타낸다. 도 4는 도 3의 예시적인 에스램의 읽기 엑세스 동작의 주요 신호들을 나타낸다. 본 발명은 복잡한 회로지연의 확률분포를 효율적이고 간단하게 추정할 수 있는 방법을 제공할 수 있다. 읽기 엑세스 동작(Read access operation)에서, 도 3의 구조에서 워드 라인(word-line; WL)의 인에이블 신호 (enable signal; WLEN)이 인가되면, row 디코딩 신호 XDEC[k]에 의하여 여러 row의 WL 중 하나의 WL이 선택된 다. 그 이후 선택된 WL에 있는 비트셀(bitcell)들이 저장하고 있던 '0'과 '1'의 데이터에 따라 한 쪽 비트라인 (bitline; BL)의 전압이 떨어지게 되고, BL끼리의 전압 차이가 발생한다. 충분히 양측 BL의 전압 차이가 만들어 지면 센스 앰프(Sense Amplifier; SA)는 센스 앰프 인에이블(sense amplifier enable; SAE) 신호가 인가되었을 때 BL 전압 차이를 증폭시켜 작은 아날로그 레벨(analog level)인 BL 차이 전압을 풀-스윙 디지털 레벨(full-swing digital level) 전압으로 증폭시킨다. 위 과정을 통해 비트셀이 저장하고 있던 데이터를 감지해낸다. 도 4는 WLEN이 인가되고 SA의 출력전압 DOUT이 나 올 때까지의 신호들의 흐름을 보여준다. 읽기 동작에서(Read Opeartion)에서 가장 핵심적인 신호는 TWL2SAE이다. 도 3을 참조하면, WL 신호와 SAE 신호가 만들어지는 경로(path)에는 공정 편차에 영향을 받는 수많은 회로가 있기 때문에, TWL2SAE를 디지털 로직 회로의 회로지연 확률변수로 생각할 수 있다. WL이 인가되면 비트라인 간의 전압 차이가 발생하는데, BL의 전압 차이가 충분히 크지 못하다면 비트셀에 저장 된 데이터를 잘못 감지하는 읽기 동작 실패(read operation fail)가 발생할 수 있다. 왜냐하면, SA 또한 공정 편차로 인해 입력이 최소한 offset voltage 만큼은 차이가 있어야 신호를 증폭해줄 수 있기 때문이다. 따라서, WL이 인가되면 BL전압 차이가 충분히 커진 후에 SAE 신호를 인가하여야 수율을 확보할 수 있는 것이다. 그래서 TWL2SAE가 어떻게 변할 지 예측하는 것이 수율 예측에 있어서 중요한데, 회로가 커지다 보면 시뮬레이션에 소요되는 시간이 상당하기 때문에 BMC(Brute force Monte carlo)로 TWL2SAE의 확률분포, fTWL2SAE(t)를 추정하는 것 은 불가능에 가깝다. 여기서, BMC는 미리 알려진 회로지연 확률분포 추정 방법 중 하나일 수 있다. 프로세서는 BMC를 이용하여 공정 편차를 모델링하여 시뮬레이션 툴에 인가하고, 시뮬레이션을 다수 시행하여 제대로 동작한 샘플과 제대로 동작하지 않은 샘플의 비율을 통해 수율을 분석할 수 있다. BMC는 Brute force Monte carlo 방법으로, 실제 양산시 공정의 영향을 분석하기 위해 랜덤한 변수를 발생시켜 시뮬레이션을 진행하고 수율을 측정하는 방법일 수 있다. 만약 시뮬레이션 상에서 공정편차가 존재하지 않는다면, 시뮬레이션을 복수회 반복하더라도 매번 같은 결과가 나오게 된다. 하지만 실제 공정의 과정을 반영하기 위해 공정편차를 랜덤변수로 가정하고, 이는 확률분포(예를 들어, 가우시안)로 모델링될 수 있다. PMOS와 NMOS 두 개로 이루어진 인버터로 예시를 들어보면, 먼저 PMOS와 NMOS에서 발생할 수 있는 공정편차가 각 각 확률분포로 모델링될 수 있다. 그 이후 여러 번의 Monte Carlo 시뮬레이션을 진행하게 되면 각각의 시뮬레이션 반복 마다 확률분포를 기반으로 한 공정편차가 발생하게 된다. 그 공정편차가 반영된 결과 각 시뮬레이션은 모두 다른 퍼포먼스(performance)(예를 들어, 회로의 지연)가 측정 될 수 있다. 만약 인버터의 스펙 요구사항이 \"delay가 10ps 보다 큰 시뮬레이션을 동작 실패, 10ps보다 작은 시뮬레이션을 동작성공\"으로 생각한다면, 수율(양품의 비율)은 \"동작성공 샘플개수/전체 시뮬레이션 횟수\"로 계산될 수 있고, 실패 확률은 \"동작실패 샘플개수/전체 시뮬레이션 횟수\"로 계산될 수 있다. 하지만, BMC는 만약 동작실패가 거의 발생하지 않는 경우에는 확률측정을 위해 굉장히 많은 시뮬레이션을 필요 로 한다는 문제점이 있다. 특히 에스램과 같은 회로는 동작실패가 극히 드물게 발생하기 때문에 BMC로 수율을 분석하는 것은 한계가 있다. 프로세서는 회로지연 확률분포 추정 대상 디지털 로직 회로로부터 BMC를 이용하여 회로지연 훈련 데이터 집합을 획득할 수 있다. 또한, Full-stage convolution을 사용하기 위해서는 WL과 SAE path에 있는 모든 stage의 회로지연 확률분포를 파악해야 하므로 굉장히 복잡하다. 따라서, 본 발명에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법은 1)회로지연 데이터 수집, 2) 회로지연 확률분포 추정 모델 정의, 머신러닝을 이용한 회로지연 추정 모델의 훈련 파라메터 결정과정을 통하여 회로지연 확률분포 정보를 추정한다. 본 발명에 따른 회로지연 확률분포 추정 정보는 TWL2SAE의 확률분포, fTWL2SAE(t)일 수 있다. 도 5의 (a)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에서 이용 되는 회로지연 훈련 데이터 집합의 누적확률분포 역함수를 나타내는 도면이다. 도 5의 (b)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에서 이용 되는 결정된 시그마(sigma) 영역에 해당하는 회로지연의 집합을 나타내는 도면이다. 프로세서는 회로지연 데이터 수집 단계에 있어서, 회로지연 훈련 데이터 집합(DMC)를 회로지연 확률분포 정 보를 획득하고자 하는 대상인 디지털 로직 회로로부터 BMC를 이용하여 획득할 수 있다. BMC의 횟수(NMC)는 사용자에 의하여 미리 결정된 횟수(예를 들어, 1800 ~ 2500회)로 설정될 수 있다. 이하에서, 도 5의 (a) 및 (b)를 참조하여, 프로세서가 획득한 회로지연 훈련 데이터 집합을 재정의하는 것 에 대하여 설명한다. 도 5의 (a)는 그래프 상에 나타낸, 회로지연 훈련 데이터 집합(DMC)의 누적확률분포 역함수를 나타내고, 도 5의 (b)는 회로지연 훈련 데이터 집합(DMC)의 누적확률분포 역함수로부터 새로운 영역에서 다시 정의된 회로지연의 집합(Dtrain)을 나타낸다. 여기서, Φ는 정규누적분포함수, Φ는 정규확률밀도함수일 수 있다. 도 5의 (a)는 수학식 1을 이용하여 나타낸 회로지연 훈련 데이터 집합(DMC)의 누적확률분포 역함수를 나타낸다. 수학식 1"}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "BMC는 데이터의 개수로 인해 누적확률분포의 역함수가 정의되는 sigma 영역이 달라지게 되는데, 도 5의 (a)에서 볼 수 있는 것처럼, sigma 축의 양 끝부분으로 갈수록 데이터의 개수가 적은 것을 알 수 있다. 본 발명은 이를 훈련 데이터로 사용할 것인데 소수의 불확실한 데이터에 오버피팅(overfitting) 되는 상황이 발 생할 수 있기 때문에, 도 5의 (b)와 같이 상대적으로 데이터가 많은 시그마 영역을 미리 결정하여 훈련 데이터 를 다시 정의한다. 미리 결정된 시그마 영역은 예를 들어, -1.645 ~ 1.645 sigma 영역일 수 있다. 시그마 영역이 -1.645 ~ 1.645 sigma가 바람직한 이유는 BMC의 횟수(NMC)가 2000인, 즉 2000개의 데이터는 -1.645, 1.645 sigma 영역에 있는 데이터의 90% confidence interval과 10% error rate를 보장할 수 있기 때문 이다. 다른 말로, 본 발명에서는 NMC개의 훈련 데이터 중 에서도 믿을 수 있는 데이터들을 다시 선별하여 사용하 였다. 도 5의 (b)의 x축에 나타나 있는 Ztrain은 미리 결정된 시그마 영역을 100개의 등간격으로 나눈 sigma들의 집합일 수 있다. Ztrain을 확률로 바꿔서 식(선1)로 구한 누적확률분포의 역함수에 입력으로 넣으면 회로지연의 집합 (Dtrain)을 정의할 수 있게 되고, 이렇게 얻은 Dtrain은 이후 확률분포 추정 모델을 훈련시키는데 사용될 수 있다. 이하에서, 프로세서가 이용하는 회로지연 확률분포 추정 모델에 대하여 설명한다. 프로세서는 S100 단계를 통하여, 훈련에 사용될 참조 데이터 집합(Dtrain)을 완성시켰고, 여기서는 확률분포 추정 모델을 정의한다. 회로지연 확률분포 추정에는 기본 모델을 훈련 파라메터로 변형시켜 사용하는데, 본 발명에서는 기본 모델을 집 적회로의 가장 기본적인 회로인 단위 인버터로 설정한다. 집적회로의 회로지연은 각 노드의 저항 및 커패시터에 의해 결정되기 때문에 기본 모델을 단위 인버터로 결정하 면, 회로 구조나 형태를 변형하더라도 회로의 지연과 관련된 특성을 반영할 수 있다. 단위 인버터의 지연 확률 분포는 공정 편차 스윕(sweep) 시뮬레이션을 통해 획득할 수 있다. 하기 수학식 2 내지 수학식 5는 본 발명에서 제안하는 회로지연 확률분포 추정 모델을 정의하는 식이다. 수학식 2"}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, fR(t)는 단위 인버터 지연의 상승 확률분포를 나타내고, fF(t)는 단위 인버터 지연의 하강 확률분포를 나타낼 수 있다. 따라서, 수학식 2은 단위 인버터 지연의 상승/하강 확률분포에 훈련 파라메터인 제1 파라미터(α), 제2 파라미 터(β)만큼 t에 곱하여 합성곱(convolution)한 것을 의미할 수 있다. 이렇게 두 개의 훈련 파라메터로 단위 인버터 지연의 상승/하강 확률분포에 특정 비율을 곱하여 컨볼루션된 형 태, fRF(t)를 획득할 수 있지만 문제점이 존재한다. 실제 회로지연의 확률분포는 신호 경로(path)에 있는 모든 회로의 확률분포를 합성곱한 것인데, 회로지연 확률 분포를 계속해서 합성곱하면 분포가 점점 더 펑퍼짐 해지는 현상이 존재한다. 한 번의 합성곱과 상승/하강의 비율을 결정하는 두 개의 훈련 파라미터만을 통해서 이를 추정해내기는 어렵다. 수학식 2을 참조하면, 제1 파라미터가 변하면 fR(t)의 평균과 편차가 모두 변하고, 제2 파라미터가 변하면 fF (t)의 평균과 편차가 모두 변한다. 즉, 하나의 파라미터가 확률분포의 평균과 편차 모두를 변화시키는 것이다. 수학식 3"}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "그래서, 수학식 3에서는 새로운 훈련 파라메터인 제3 파라미터(γ)를 추가하여 평균과 편차를 조절하는 파라메 터끼리 분리시켰다. 제3 파라미터는 평균을 고정시킨 채로 편차를 변화시키는 파라메터일 수 있다. 여기서, T0,WL2SAE는 Dtrain으로부터 얻을 수 있는 0 sigma에서의 값 즉, 공정 편차가 존재하지 않을 때의 TWL2SAE 값 이다. 그 결과로 회로지연 확률분포의 편차는 제3 파라미터로 조절한 후 T0,WL2SAE를 더하면 평균이 Dtrain과 같게 된다. 수학식 4 수학식 5"}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 4과 수학식 5는 각각 TWL2SAE의 누적확률분포함수와 누적확률분포 역함수로 정의할 수 있다. 프로세서는 머신러닝을 이용한 회로지연 추정 모델의 훈련 파라메터를 결정할 수 있다. 본 발명의 앞선 과정을 통해 복잡한 회로지연 확률분포를 추정하는 것은 적절한 세 개의 훈련 파라메터(α, β, γ)를 찾는 문제로 변화되었다. 적절한 훈련 파라메터를 찾기 위해 Dtrain과 수학식 5의 유사성을 수치화하고, 그 유사성이 커지도록 훈련 파라메 터를 머신러닝을 활용하여 결정하였다. 수학식 6는 Dtrain과 수학식 5의 유사성을 나타내는 식이다. 수학식 6"}
{"patent_id": "10-2022-0186015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 6는 Dtrain과 확률분포 추정 모델의 유사성을 나타내는 식일 수 있다. 수학식 6의 구조를 보면 일반적으로 많이 사용되는 Absolute error(AE)의 형태인데, Dtrain과 수학식 5의 차이로 구성되는 것을 알 수 있다. 여기서, Dtrain은 훈련 데이터셋으로 정의한 누적확률분포의 역함수에 Ztrain을 확률로 바꿔 입력으로 넣어 얻은 값 들의 집합이며, 뒤쪽 term은 제안된 확률분포 추정 모델 수학식 5에 Ztrain을 확률로 바꿔 입력으로 넣어 얻은 값 들의 집합이다. 여기서, 두 집합이 유사한 값을 가질수록 손실함수(Loss)가 작아지는 것을 알 수 있다. 본 발명은 일반적인 AE에 Ztrain을 곱하는 방식을 채택하였는데, 이는 중앙(0 sigma)에서의 값 보다는 미리 결정 된 시그마 범위의 끝단에 해당하는 부분에 더 큰 가중치를 두겠다는 의미이다. 본 발명의 목표는 적은 양의 데이터(NMC=2000)로 -6 ~ 6시그마 영역(BMC를 이용해 구하기 위해선 약 1011번의 시 뮬레이션이 필요한 구간)의 확률분포를 유추하는 것으로, BMC로 얻기 힘든 샘플인 더 높은 sigma 영역에 있는 데이터들이 중요하기 때문이다. 프로세서는 수학식 6를 최소화하는 훈련 파라미터(α, β, γ)를 찾을 수 있다. 수학식 6에서 α, β, γ가 변하면 달라지는 것은 오로지 제안된 확률분포 추정 모델뿐이며, Ztrain과 Dtrain은 달 라지지 않는다. 프로세서는 세개의 파라메터를 효율적으로 결정하기 위해, 머신러닝 기법 중 Black-box function의 최대/ 최소를 효율적으로 탐색할 수 있는 베이지안 최적화 방법을 사용할 수 있다. 베이지안 최적화는 목표함수에 대 한 형태를 모르는 상황에서, 입력을 통해 출력을 얻는 과정이 간단하지 않을 때 효과적인 방법이다. 현재 데이 터셋(dataset)을 바탕으로 데이터(data)가 없는 영역의 함수 값에 대해 평균과 편차를 정의하고, 정의된 평균과 편차를 보고 최적의 값이 있을 것으로 생각되는 다음 입력 조합을 내어준다. 그리고 그 입력에 대해 함수값을 얻으면, 데이터셋이 업데이트되고 이를 통해 정의되는 평균과 편차 또한 업데이트된다. 해당 과정을 반복하면서 함수의 최대/최소 값을 찾아가는 과정이 베이지안 최적화이다.도 6의 (a) 내지 (d)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법 에서 생성한 회로지연 확률분포 정보와 레퍼런스(Reference) 기능을 하는 회로지연의 집합을 비교한 것을 나타 내는 도면이다. 도 6의 (e)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에서 생성 한 회로지연 확률분포 정보와 종래기술을 통하여 획득한 회로지연 확률분포 정보를 비교한 것을 나타내는 도면 이다. 도 6의 (f)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에서 이용 하는 베이지안 최적화의 반복 횟수에 따른 회로지연 확률분포 추정 모델과 레퍼런스 모델의 유사성을 나타내는 도면이다. 도 6의 (a) 내지 (d)는 베이지안 최적화가 3, 10, 50, 100회 반복되었을 때의 Dtrain과 제안된 확률분포 추정 모 델의 형태를 나타낸다. 도 6의 (a) 내지 (d)를 참조하면, 베이지안 최적화가 진행되면서 적절한 α, β, γ가 찾아지며 제안된 확률분포 추정 모델이 Dtrain와 유사한 형태를 가지게 되는 것을 볼 수 있다. 도 6의 (e)는 베이지안 최적화 100회 반복 이후 BMC 500만회로 얻은 TWL2SAE의 비교를 나타낸다. 도 6의 (e)를 참 조하면, BMC 500만회로 구한 TWL2SAE의 Q-Q plot과 NMC=2000으로 훈련한 제안된 확률분포 추정모델이 굉장히 유사 한 것을 볼 수 있다. 도 6의 (f)는 각 베이지안 최적화 반복마다 관측된 수학식 6의 정규화된 최소값을 나타낸다. 도 6의 (f)를 참조 하면, 베이지안 최적화의 각 반복마다 관측된 수학식 6의 정규화된 최소값을 나타내며, 약 26회 반복 이후에 최 적의 α, β, γ에 도달하는 것을 확인할 수 있다. 도 7은 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에 따른 회로지연 확률분포 추정과 종래기술에 따른 회로지연 확률분포 추정을 이용한 수율 예측을 비교한 것을 나타내는 도면이 다. 도 7은 본 발명에서 제안된 회로지연 확률분포 추정방법을 이용해 측정한 도 3의 회로의 읽기 엑세스(read access) 수율과 다른 방법들을 이용해 측정한 수율의 비교한 것을 나타낸다. 보다 상세하게는, 도 3의 회로 읽 기 엑세스(read access) 수율의 3σ(Pfail~=0.001) 수준을 본 발명에서 제안된 회로지연 확률분포 추정방법을 사 용하여 예측한 것과 다른 방법으로 예측한 것을 비교한 것이다. 도 8은 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에 따른 회로지연 확률분포 추정과 종래기술에 따른 회로지연 확률분포 추정을 이용한 수율 예측을 시행 횟수에 따라 비교한 것을 나타내는 도면이다. 도 8은 각 방법을 30회씩 반복한 결과로 수율 예측의 수렴도를 나타낸다. 도 8의 (a)는 각 방법으로 예측한 수 율의 30회 평균값을 나타내고, 도 8의 (b)는 각 방법으로 예측한 수율의 편차를 평균으로 나눈 것을 나타낸다. 여기서 BMC는 충분한 양의 시뮬레이션을 통해 정확도 비교를 위한 참조 데이터(Reference)로 활용된다. 본 발명 은 기존 수율 추정 방법인 Importance Sampling Monte Carlo(ISMC), Most Probable Failure Point(MPFP), Compensated MPFP(C-MPFP) 세 가지에 적용되었다. 상대적으로 정확한 수율예측 방법인 ISMC와 C-MPFP는 BMC와 비교했을 때 오차가 1퍼센트 내외이며, 시뮬레이션 시간을 BMC대비 20배이상 단축시킬 수 있는 것을 볼 수 있다. 도 8은 각 수율 추정 방법으로 예측한 수율의 편차를 평균으로 나눈 값으로, 통상 0.0865에 도달했을 때 95%의 confidence interval을 보장한다. 본 발명의 방법을 통해 수율을 예측한 것이다른 방법을 통해 수율을 예측한 것 보다 오차가 크지 않으면서도 빠르게 수렴한다. 실험은 3σ수준 수율에서 검증된 것인데, 통상 목표 수율인 6σ(Pfail~=1e-9)에서 검증할 때 본 발명이 요구하는 시뮬레이션 시간 증가가 거의 없는 반면 BMC 및 다른 방법들의 시뮬레이션 시간은 기하급수적으로 증가하기 때 문에 본 발명의 효율성은 더욱 극대화된다. 본 발명은 단위 인버터의 회로지연 확률분포를 훈련 데이터와 몇 가지의 훈련 파라메터를 결합해 복잡한 회로지 연의 확률분포를 추정할 수 있도록 하는 방법을 개시한다.본 발명은 회로지연의 실제 형태가 각 회로 stage 확률분포들의 컨볼루션과 연관이 있다는 것에 착안하여 기본 모델을 단위 인버터로 설정했다. 그리고 회로지연 확률분포 추정 모델과 회로지연 훈련 데이터와의 차이를 수치 화하여 훈련 파라메터를 머신러닝으로 결정하는 구조이다. 따라서 선행기술들이 복잡한 회로의 확률분포를 얻기 위해 실현 불가능한 횟수의 시뮬레이션을 요구하거나 복잡한 과정을 거쳐야 하는 것을 훈련 파라메터를 결정하 는 간단한 문제로 변화시켰다. 이로 인해 제품 양산시 성능에 미칠 수 있는 공정 편차의 영향을 설계 단계에서 예측할 수 있으며, 제품양산의 수율향상에 기여할 수 있다. 본 출원은 컴퓨터 저장 매체도 제공한다. 컴퓨터 저장 매체에는 프로그램 명령이 저장되어 있고, 프로세서에 의 해 프로그램 명령이 실행되면, 상술한 디지털 로직 회로의 회로지연 확률분포 추정 방법이 실현된다. 본 발명의 일 실시예에 따른 컴퓨터 저장 매체는 U디스크, SD카드, PD광학 드라이브, 모바일 하드 디스크, 대용 량 플로피 드라이브, 플래시 메모리, 멀티미디어 메모리 카드, 서버 등일 수 있지만 반드시 이에 한정되는 것은 아니다. 이상에서 설명한 본 발명의 실시예를 구성하는 모든 구성요소들이 하나로 결합하거나 결합하여 동작하는 것으로 기재되어 있다고 해서, 본 발명이 반드시 이러한 실시예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안 에서라면, 그 모든 구성요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요 소들이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴 퓨터 프로그램으로서 구현될 수도 있다. 또한, 이와 같은 컴퓨터 프로그램은 USB 메모리, CD 디스크, 플래쉬 메 모리 등과 같은 컴퓨터가 읽을 수 있는 기록 매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽혀 지고 실행됨으로써, 본 발명의 실시예를 구현할 수 있다. 컴퓨터 프로그램의 기록 매체로서는 자기기록매체, 광 기록매체 등이 포함될 수 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위 내에서 다양한 수정, 변경 및 치환이 가능할 것이다. 따라서, 본 발명에 개시된 실시예 및 첨부된 도면들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예 및 첨부된 도면에 의하여 본 발명의 기술 사상의 범위 가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구 범위에 의하여 해석되어야 하며, 그와 동등한 범 위 내에 있는 모든 기술 사상은 본 발명의 권리 범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2022-0186015", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치의 구성을 설명하기 위한 도면이다. 도 2는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 방법을 설명하기 위한 흐름도 이다. 도 3은 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 방법의 개념을 설명하기 위하 여 예시적으로 나타내는 디지털 로직 회로이다. 도 4는 도 3의 예시적인 디지털 로직 회로의 동작 신호들을 나타내는 도면이다. 도 5의 (a)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에서 이용 되는 회로지연 훈련 데이터 집합의 누적확률분포 역함수를 나타내는 도면이다. 도 5의 (b)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에서 이용 되는 결정된 시그마(sigma) 영역에 해당하는 회로지연의 집합을 나타내는 도면이다. 도 6의 (a) 내지 (d)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법 에서 생성한 회로지연 확률분포 정보와 레퍼런스(Reference) 기능을 하는 회로지연의 집합을 비교한 것을 나타 내는 도면이다. 도 6의 (e)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에서 생성 한 회로지연 확률분포 정보와 종래기술을 통하여 획득한 회로지연 확률분포 정보를 비교한 것을 나타내는 도면 이다. 도 6의 (f)는 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에서 이용 하는 베이지안 최적화의 반복 횟수에 따른 회로지연 확률분포 추정 모델과 레퍼런스 모델의 유사성을 나타내는 도면이다. 도 7은 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에 따른 회로지연 확률분포 추정과 종래기술에 따른 회로지연 확률분포 추정을 이용한 수율 예측을 비교한 것을 나타내는 도면이 다. 도 8은 본 발명의 일 실시예에 따른 디지털 로직 회로의 회로지연 확률분포 추정 장치 및 방법에 따른 회로지연 확률분포 추정과 종래기술에 따른 회로지연 확률분포 추정을 이용한 수율 예측을 시행 횟수에 따라 비교한 것을 나타내는 도면이다."}
