{"patent_id": "10-2018-0131164", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0052449", "출원번호": "10-2018-0131164", "발명의 명칭": "인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템 및 이에 대한 제어방법", "출원인": "제노테크주식회사", "발명자": "차병래"}}
{"patent_id": "10-2018-0131164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "데이터를 수집하여 생성된 수집데이터를 저장하기 위한 데이터레이크(10)와, 상기 데이터레이크(10)로부터 수집데이터를 수신받아 전이학습하여 생성된 결과데이터를 상기 데이터레이크(10)로 공유하기 위한 데이터저장소(20)와, 상기 데이터레이크(10)로부터 수집데이터를 수신받아 전이학습하여 생성된 학습데이터를 상기 데이터레이크(10)로 전송하기 위한 클라우드 컴퓨팅(30)과, 상기 데이터레이크(10)를 통해 상기 학습데이터를 수신받아적용하거나 상기 결과데이터를 수신받아 사용하고 상기 데이터를 입력하기 위한 마이크로 스토리지(40)를 포함하고,상기 데이터레이크(10)는, 상기 데이터저장소(20)와 상기 클라우드 컴퓨팅(30)과 상기 마이크로 스토리지(40)와통신하기 위한 데이터레이크통신부(11)와, 상기 데이터레이크통신부(11)를 통해 상기 마이크로 스토리지(40)로부터 수신받은 데이터를 수집하여 수집데이터로 생성하기 위한 데이터수집부(12)와, 상기 데이터수집부(12)에생성된 수집데이터를 상기 데이터저장소(20)와 상기 클라우드 컴퓨팅(30) 중 어느 하나로 전송하기 위해 판단하여 학습요청하기 위한 학습요청부(13)와, 상기 학습요청부(13)를 통해 상기 데이터저장소(20)로부터 수신받은결과데이터나 상기 클라우드 컴퓨팅(30)으로부터 수신받은 학습데이터를 마이크로 스토리지(40)로 제공하기 위한 데이터제공부(14)를 포함하여 구성되는 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템."}
{"patent_id": "10-2018-0131164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 데이터저장소(20)는, 상기 데이터레이크(10)와 통신하기 위한 데이터저장소통신부(21)와, 상기 데이터저장소통신부(21)를 통해 상기 데이터레이크(10)로부터 수신받은 수집데이터를 전이학습하기 위한전이학습부(22)와, 상기 전이학습부(22)를 통해 전이학습되어 결과데이터를 생성하기 위한 학습완료부(23)와,상기 학습완료부(23)에서 생성된 결과데이터를 공유하기 위한 결과공유부(24)를 포함하여 구성되는 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템."}
{"patent_id": "10-2018-0131164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1 또는 청구항 2에 있어서,상기 클라우드 컴퓨팅(30)은, 상기 데이터레이크(10)와 통신하기 위한 클라우드통신부(31)와, 상기 클라우드통신부(31)를 통해 상기 데이터레이크(10)로부터 수신받은 수집데이터를 백업하기 위한 백업부(32)와, 상기 백업부(32)에 백업된 수집데이터를 전이학습하여 학습데이터를 생성하기 위한 AI학습부(33)와, 상기 AI학습부(33)를통해 생성된 학습데이터를 상기 데이터레이크(10)로 전달하기 위한 데이터전달부(34)를 포함하여 구성되는 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템."}
{"patent_id": "10-2018-0131164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 마이크로 스토리지(40)는, 식별하기 위한 식별정보를 저장하여 관리하기 위한 정보관리부(41)와, 상기 데이터레이크(10)와 통신하기 위한 마이크로스토리지통신부(42)와, 상기 마이크로스토리지통신부(42)를 통해 상기데이터레이크(10)로 전송하기 위한 데이터를 입력하기 위한 데이터입력부(43)와, 상기 데이터레이크(10)에서 수신받은 결과데이터나 학습데이터를 저장하기 위한 데이터저장부(44)와, 상기 데이터저장부(44)에 저장된 학습데이터를 적용시키기 위한 데이터적용부(45)와, 상기 데이터적용부(45)를 통해 적용된 학습데이터나 상기 데이터저장부(44)에 저장된 결과데이터를 사용하기 위한 데이터사용부(46)를 포함하여 구성되는 인공지능 서비스를 위공개특허 10-2020-0052449-3-한 연결된 데이터 아키텍처 시스템."}
{"patent_id": "10-2018-0131164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "데이터를 수집하기 위한 데이터레이크(10)에서 상기 데이터를 수집하고 누적저장하여 수집데이터를 생성하는 데이터수집단계와, 상기 데이터레이크(10)에서 상기 수집데이터의 전이학습을 병렬로 처리하기 위한 데이터저장소(20)와 상기 수집데이터를 백업하고 전이학습하기 위한 클라우드 컴퓨팅(30) 중 상기 수집데이터의 학습을 요청하기 위해 상기수집데이터의 용량과 미리 설정된 기준용량을 비교하여 판단하는 판단단계와,상기 데이터레이크(10)에서 상기 수집데이터의 용량이 미리 설정된 기준용량 이하일 경우에 상기 데이터저장소(20)로 상기 수집데이터를 전송하여 학습을 요청하고, 상기 데이터레이크(10)에서 상기 수집데이터의 용량이 미리 설정된 기준용량을 초과하였을 경우에 상기 클라우드 컴퓨팅(30)으로 상기 수집데이터를 전송하여 학습을 요청하는 학습요청단계와, 상기 데이터저장소(20)에서 상기 데이터레이크(10)로부터 수신받은 수집데이터를 전이학습하는 전이학습단계와,상기 데이터저장소(20)에서 전이학습된 결과에 대한 결과데이터를 생성한 후 상기 데이터레이크(10)로 공유하기위한 공유단계와, 상기 클라우드 컴퓨팅(30)에서 상기 데이터레이크(10)로부터 수신받은 수집데이터를 백업하는 백업단계와,상기 클라우드 컴퓨팅(30)에서 백업된 수집데이터를 전이학습하여 학습데이터를 생성하는 AI학습단계와,상기 클라우드 컴퓨팅(30)에서 생성된 학습데이터를 상기 데이터레이크(10)로 전달하기 위한 전달단계와,상기 데이터레이크(10)에서 상기 데이터저장소(20)의 결과데이터나 상기 클라우드 컴퓨팅(30)의 학습데이터를수신받아 마이크로 스토리지(40)로 제공하기 위한 제공단계와,상기 마이크로 스토리지(40)에서 상기 학습데이터를 수신받을 경우에 상기 학습데이터를 적용하는 적용단계와,상기 마이크로 스토리지(40)에서 상기 적용된 학습데이터를 사용하거나 상기 결과데이터를 수신받을 경우에 상기 결과데이터를 사용하는 사용단계를 포함하여 구성되는 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 제어방법."}
{"patent_id": "10-2018-0131164", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 데이터를 소프트웨어 정의 네트워크를 통해 구조적으로 관리하면서 안정적으로 인터페이스별로 딥 러 닝을 통해 학습된 데이터를 수신받아 사용자의 환경이나 상태에 따라 학습된 데이터를 제공할 수 있는 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템 및 이에 대한 제어방법에 관한 것이다. (뒷면에 계속)"}
{"patent_id": "10-2018-0131164", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템 및 이에 대한 제어방법에 관한 것으로, 보다 상세하게는 데이터를 소프트웨어 정의 네트워크를 통해 구조적으로 관리하면서 안정적으로 인터페이스별로 딥 러닝을 통해 학습된 데이터를 수신받아 사용자의 환경이나 상태에 따라 학습된 데이터를 제공할 수 있는 인공지 능 서비스를 위한 연결된 데이터 아키텍처 시스템 및 이에 대한 제어방법에 관한 것이다."}
{"patent_id": "10-2018-0131164", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능은 최근 클라우드 컴퓨팅 환경의 급속한 발전과 빅데이터가 뒷받침되어 딥러닝과 다양한 학습 정책 등 이 구현됨으로 인해 4차 산업혁명의 핵심 요소가 되었다. 이러한 인공지능은 인간의 학습능력과 추론능력, 지각능력, 자연언어의 이해능력 등을 컴퓨터 프로그램으로 실 현한 기술이다. 즉, 인공지능은 인간의 지능으로 할 수 있는 사고, 학습, 자기 개발 등을 컴퓨터가 할 수 있도 록 하는 방법을 연구하는 컴퓨터 공학 및 정보기술의 한 분야로서, 컴퓨터가 인간의 지능적인 행동을 모방할 수 있도록 하는 것이다. 인공지능의 한 분파로 신경망(Neural Network)이 존재하며, 신경망의 학습 정책으로는 지도학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforce Learning), 그리고 전이 학습(Transfer Learning) 등이 있다. 신경망의 학습법 중 인공지능의 학습법 중 머신러닝(Machine Learning)과 딥러닝(DeepLearning)이 있다. 머신러닝(Machine Learning)은 컴퓨터가 스스로 방대한 데이터를 분석해서 미래를 예측하는 기술로서, 방대한 양의 데이터 가운데 비슷한 것끼리 묶어내고 서로 관계있는 것들의 상하구조를 인식하여 이를 바탕으로 앞으로 의 행동을 예측하는 기술이다. 딥러닝(Deep Learning)은 컴퓨터가 여러 데이터를 이용해 마치 사람처럼 스스로 학습할 수 있게 하기 위해 인공 신경망(ANN: artificial neural network)을 기반으로 구축한 한 기계 학습 기술로서, 많은 데이터를 분류해서 같은 집합들끼리 묶고 상하의 관계를 파악하는 기술이다. 전이학습(Transfer learning)은 딥러닝을 특징 추출로만 사용하며, 추출된 피처를 이용하여 다른 모델을 학습하 는 것으로, 기존의 만들어진 모델을 이용하여 새로운 모델을 만들 경우에 학습을 빠르게 하며 예측을 높이는 방 법이다. 즉, 전이학습(Transfer learning)은 이미 학습이 완료된 모델을 가지고 원하는 학습에 미세조정을 이용 하여 학습시키는 것으로, 딥러닝을 적용할 수 있는 편리한 방법이다. 인공지능을 이용한 기술로는 공개특허 제10-2015-0047803호(공개일자: 2015년 05월 06일)에 기재된 바와 같이 인공지능 오디오 장치에 있어서, 상기 인공지능 오디오 장치가 현재 위치한 현재 장소의 위치를 탐지함과 함께 상기 현재 장소의 온도 및 습도 중의 적어도 하나와, 사람 유무를 감지하는 센싱부와, 네트워크를 통해 외부 서 버와 통신하는 제1 통신부와, 상황에 따른 복수의 인사말 음성과 복수의 인사말 텍스트 중의 적어도 하나를 포 함하는 인사말 데이터와, 복수 의 음악을 포함하는 음악 데이터를 저장하는 저장부와, 음성과 음악을 처리하여 출력하는 음성 처리부와, 텍스트를 처리하여 출력하는 표시 처리부와, 상기 센싱부에 의해 감지된 상기 현재 장 소의 위치 정보를 이용하여 상기 외부 서버로부터 상기 현재 장소의 날씨 정보를 수집하고, 상기 센싱부에 의해 상기 현재 장소에 사람이 감지되면 미리 정해진 인사말 출력시기인지를 판단하고, 판단결과 상기 미리 정해진 인사말 출력시기이면 상기 저장부에 저장된 인사말 데이터로부터, 현재 시간과, 상기 센싱부에 의해 감지된 온 도 및 습도 중의 적어도 하나와, 상기 외부 서버로부터 수집된 현재 장소의 날씨 정보에 부합하는 인사말 음성 과 인사말 텍스트 중의 적어도 하나를 추출하여 상기 음성 처리부와 상기 표시 처리부 중의 적어도 하나를 통해 출력하는 제어부를 포함하는 인공지능 오디오 장치가 있다. 상기 공개특허와 같이 인공지능을 이용한 기술로는 다양한 분야에서 사용되고 있지만, 대부분 고사양 하드웨어 및 대용량 스토리지, 클라우드에 의존하는 문제점이 있다. 이에 제한된 환경에서 클라우드의 도움없이 에지 디 바이스 독립적으로 혹은 클라우드 의존 및 인터넷 연결을 최소화할 필요가 있는 다양한 인공지능 응용이 요구되 고 있다."}
{"patent_id": "10-2018-0131164", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위해 제안된 것으로, 데이터를 소프트웨어 정의 네트워크를 통해 구조적으 로 관리하면서 안정적으로 인터페이스별로 딥 러닝을 포함한 다양한 학습 정책을 이용하여 데이터를 학습시켜 학습된 데이터를 수신받아 사용자의 환경이나 상태에 따라 학습된 데이터를 소프트웨어 정의 네트워크를 이용한 인공지능 서비스로 제공할 수 있는 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템 및 이에 대한 제어 방법을 제공하는 목적이 있다. 또한, 학습할 데이터에 대한 학습을 분산 및 병렬로 처리하여 저사양 저전력 디바이스에 적용할 수 있는 인공지 능 서비스를 위한 연결된 데이터 아키텍처 시스템 및 이에 대한 제어방법을 제공하는 목적이 있다. 또한, 대용량의 학습할 데이터를 클라우딩 컴퓨팅 또는 데이터레이크를 이용하여 학습할 수 있도록 하여 학습 계산량과 저장공간 및 학습시간을 단축시킬 수 있는 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템 및 이에 대한 제어방법을 제공하는 목적이 있다."}
{"patent_id": "10-2018-0131164", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "본 발명이 해결하려는 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0131164", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위한 본 발명에 의한 인공지능을 이용한 연결된 데이터 아키텍처 시스템 및 이에 대한 제어방법은, 데이터를 수집하여 생성된 수집데이터를 저장하기 위한 데이터레이크와, 상기 데이터레이크 로부터 수집데이터를 수신받아 전이학습하여 생성된 결과데이터를 상기 데이터레이크로 공유하기 위한 데이터저장소와, 상기 데이터레이크로부터 수집데이터를 수신받아 전이학습하여 생성된 학습데이터를 상기 데이터레이크로 전송하기 위한 클라우드 컴퓨팅과, 상기 데이터레이크를 통해 상기 학습데이 터를 수신받아 적용하거나 상기 결과데이터를 수신받아 사용하고 상기 데이터를 입력하기 위한 마이크로 스토리 지를 포함하고, 상기 데이터레이크는, 상기 데이터저장소와 상기 클라우드 컴퓨팅과 상기 마이 크로 스토리지와 통신하기 위한 데이터레이크통신부와, 상기 데이터레이크통신부를 통해 상기 마이 크로 스토리지로부터 수신받은 데이터를 수집하여 수집데이터로 생성하기 위한 데이터수집부와, 상기 데이터수집부에 생성된 수집데이터를 상기 데이터저장소와 상기 클라우드 컴퓨팅 중 어느 하나로 전송하기 위해 판단하여 학습요청하기 위한 학습요청부와, 상기 학습요청부를 통해 상기 데이터저장소 로부터 수신받은 결과데이터나 상기 클라우드 컴퓨팅으로부터 수신받은 학습데이터를 마이크로 스토리 지로 제공하기 위한 데이터제공부를 포함하여 구성된다. 또한, 상기 데이터저장소는, 상기 데이터레이크와 통신하기 위한 데이터저장소통신부와, 상기 데이 터저장소통신부를 통해 상기 데이터레이크로부터 수신받은 수집데이터를 전이학습하기 위한 전이학습부 와, 상기 전이학습부를 통해 전이학습되어 결과데이터를 생성하기 위한 학습완료부와, 상기 학습완 료부에서 생성된 결과데이터를 공유하기 위한 결과공유부를 포함하여 구성될 수 있다. 이때, 상기 클라우드 컴퓨팅은, 상기 데이터레이크와 통신하기 위한 클라우드통신부와, 상기 클라 우드통신부를 통해 상기 데이터레이크로부터 수신받은 수집데이터를 백업하기 위한 백업부와, 상기 백업부에 백업된 수집데이터를 전이학습하여 학습데이터를 생성하기 위한 AI학습부와, 상기 AI학습부 를 통해 생성된 학습데이터를 상기 데이터레이크로 전달하기 위한 데이터전달부를 포함하여 구성되 는 것이 바람직하다. 또한, 상기 마이크로 스토리지는, 식별하기 위한 식별정보를 저장하여 관리하기 위한 정보관리부와, 상 기 데이터레이크와 통신하기 위한 마이크로스토리지통신부와, 상기 마이크로스토리지통신부를 통해 상기 데이터레이크로 전송하기 위한 데이터를 입력하기 위한 데이터입력부와, 상기 데이터레이크에 서 수신받은 결과데이터나 학습데이터를 저장하기 위한 데이터저장부와, 상기 데이터저장부에 저장된 학습데이터를 적용시키기 위한 데이터적용부와, 상기 데이터적용부를 통해 적용된 학습데이터나 상기 데이터저장부에 저장된 결과데이터를 사용하기 위한 데이터사용부를 포함하여 구성될 수 있다. 본 발명에 있어서, 데이터를 수집하기 위한 데이터레이크에서 상기 데이터를 수집하고 누적저장하여 수집데 이터를 생성하는 데이터수집단계와, 상기 데이터레이크에서 상기 수집데이터의 전이학습을 병렬로 처리하기 위한 데이터저장소와 상기 수집데이터를 백업하고 전이학습하기 위한 클라우드 컴퓨팅 중 상기 수집데 이터의 학습을 요청하기 위해 상기 수집데이터의 용량과 미리 설정된 기준용량을 비교하여 판단하는 판단단계와, 상기 데이터레이크에서 상기 수집데이터의 용량이 미리 설정된 기준용량 이하일 경우에 상기 데이터저장소로 상기 수집데이터를 전송하여 학습을 요청하고, 상기 데이터레이크에서 상기 수집데이터 의 용량이 미리 설정된 기준용량을 초과하였을 경우에 상기 클라우드 컴퓨팅으로 상기 수집데이터를 전송하 여 학습을 요청하는 학습요청단계와, 상기 데이터저장소에서 상기 데이터레이크로부터 수신받은 수집데 이터를 전이학습하는 전이학습단계와, 상기 데이터저장소에서 전이학습된 결과에 대한 결과데이터를 생성한 후 상기 데이터레이크로 공유하기 위한 공유단계와, 상기 클라우드 컴퓨팅에서 상기 데이터레이크 로부터 수신받은 수집데이터를 백업하는 백업단계와, 상기 클라우드 컴퓨팅에서 백업된 수집데이터를 전이 학습하여 학습데이터를 생성하는 AI학습단계와, 상기 클라우드 컴퓨팅에서 생성된 학습데이터를 상기 데이 터레이크로 전달하기 위한 전달단계와, 상기 데이터레이크에서 상기 데이터저장소의 결과데이터나 상기 클라우드 컴퓨팅의 학습데이터를 수신받아 마이크로 스토리지로 제공하기 위한 제공단계와, 상기 마이크로 스토리지에서 상기 학습데이터를 수신받을 경우에 상기 학습데이터를 적용하는 적용단계와, 상기 마이크로 스토리지에서 상기 적용된 학습데이터를 사용하거나 상기 결과데이터를 수신받을 경우에 상기 결 과데이터를 사용하는 사용단계를 포함하여 구성된다."}
{"patent_id": "10-2018-0131164", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이 본 발명에 따르면, 데이터를 구조적으로 관리하면서 안정적으로 인터페이스별로 딥 러닝을 통 해 데이터를 학습시켜 학습된 데이터를 수신받아 사용자의 환경이나 상태에 따라 학습된 데이터를 제공할 수 있 어 헬스케어, 웨어러블 디바이스, IoT 디바이스 등과 같은 저사양 디바이스에서 독립적으로 인공지능이 동작할 수 있게 되며, 사용자 맞춤형으로 AI서비스를 제공할 수 있는 효과가 있다. 또한, 학습할 데이터를 수집한 데이터레이크와 데이터저장소 간의 인터페이스를 통해 학습할 데이터에 대한 학 습을 병렬로 처리할 수 있어 공유 및 확장성을 확보할 수 있어 어느 하나로 통합되는 데이터의 용량을 줄여 최 적의 학습 및 데이터 분류가 가능함으로 인해 효율적으로 AI서비스를 제공할 수 있는 효과가 있다. 또한, 학습할 데이터를 수집한 데이터레이크와 클라우딩 컴퓨팅 간의 인터페이스를 통해 확장성을 제공하기 때 문에 학습할 데이터가 대용량이더라도 학습 및 학습시간을 단축시킬 수 있는 효과가 있다."}
{"patent_id": "10-2018-0131164", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템 및 이에 대한 제어방법을 상세히 설명한다. 도 1은 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템이고, 도 2는 본 발 명의 일실시 예에 의한인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 데이터레이크이며, 도 3은 본 발명의 일실시 예에 의한인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 데이터저장소이다. 또한, 도 4는 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 클라우드 컴퓨팅이며, 도 5는 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 마 이크로 스토리지이고, 도 6은 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시 스템의 제어방법이다. 상기 도면의 구성 요소들에 인용부호를 부가함에 있어서, 동일한 구성 요소들에 한해서는 비록 다른 도면상에 표시되더라도 가능한 동일한 부호를 가지도록 하고 있으며, 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단 되는 공지 기능 및 구성에 대한 상세한 설명은 생략한다. 또한, '상부', '하부', '앞', '뒤', '선단', '전방', '후단' 등과 같은 방향성 용어는 개시된 도면(들)의 배향과 관련하여 사용된다. 본 발명의 실시 예의 구성요소 는 다양한 배향으로 위치설정될 수 있기 때문에 방향성 용어는 예시를 목적으로 사용되는 것이지 이를 제한하는 것은 아니다. 본 발명의 바람직한 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템은, 상기 도 1에 도시된 바와 같이, 데이터를 수집하여 생성된 수집데이터를 저장하기 위한 데이터레이크와, 상기 데이터레 이크로부터 수집데이터를 수신받아 전이학습하여 생성된 결과데이터를 상기 데이터레이크로 공유하기 위한 데이터저장소와, 상기 데이터레이크로부터 수집데이터를 수신받아 전이학습하여 생성된 학습데이 터를 상기 데이터레이크로 전송하기 위한 클라우드 컴퓨팅과, 상기 데이터레이크를 통해 상기 학습 데이터를 수신받아 적용하거나 상기 결과데이터를 수신받아 사용하기 위한 마이크로 스토리지를 포함하여 구성된다. 상기 데이터레이크는, 상기 도 2에 도시된 바와 같이, 상기 데이터저장소와 상기 클라우드 컴퓨팅 과 상기 마이크로 스토리지와 통신하기 위한 데이터레이크통신부와, 상기 데이터레이크통신부를 통 해 상기 마이크로 스토리지로부터 수신받은 데이터를 수집하여 수집데이터로 생성하기 위한 데이터수집부 와, 상기 데이터수집부에 생성된 수집데이터를 상기 데이터저장소와 상기 클라우드 컴퓨팅 중 어느 하나로 전송하기 위해 판단하여 학습요청하기 위한 학습요청부와, 상기 학습요청부를 통해 상기 데이터저장소로부터 수신받은 결과데이터나 상기 클라우드 컴퓨팅으로부터 수신받은 학습데이터를 마이 크로 스토리지로 제공하기 위한 데이터제공부를 포함하여 구성될 수 있다. 상기 데이터레이크는 대용량 데이터를 캡처링, 처리, 분석하여 사용자 또는 데이터를 소비하는 마이크로 스 토리지에 제공할 수 있도록 전사적 데이터 레이크를 구축하기 위해 물리적 계층(Physical Layer)과, 분산된 스토리지 계층(Distributed Storage Layer)과, 보안 계층(Security Layer)과, 데이터 수집 계층(Data Acquisition Layer)과, 메시징 계층(Messaging Layer)과, 유입 계층(Ingestion Layer)과, 람다 아키텍쳐 (Lambda Architecture)와, 서비스 계층(Serving Layer)을 포함하여 구성될 수 있다. 또한, 상기 데이터레이크는 상기 클라우드 컴퓨팅과 클라우드 버스팅을 제공하고, 상기 마이크로 스토 리지와 클라우드 스패닝을 제공하게 된다. 상기 클라우드 버스팅은 하이브리드 클라우드(혼합형 클라우드) 환경에서 사용되는 응용 프로그램 배포 모델이 며, 상기 데이터레이크의 용량을 초과하면 초과 수요로 인해 퍼블릭 클라우드로 자동 전송되어 응용 프로그 램이 계속 실행될 수 있도록 한다. 상기 클라우드 스패닝은 많은 컴퓨팅 자원들을 필요로 하는 응용 프로그램 구성 요소가 여러 클라우드 환경에서 동시에 배포되도록 하는 전달 모델이며, 여러 대의 컴퓨터를 연결하여 상호 협력하도록 할 수 있다. 상기 데이터레이크통신부는, 상기 데이터저장소와 상기 클라우드 컴퓨팅과 상기 마이크로 스토리지 와 무선 네트워크를 통해 통신한다. 상기 무선네트워크로는 와이파이, 인터넷 등을 사용할 수 있다. 상기 데이터수집부는, 상기 마이크로 스토리지로부터 데이터를 수신받아 누적저장하면서 수집하여 수집 데이터로 생성한다. 이때, 상기 데이터수집부는 주기적으로 상기 마이크로 스토리지의 데이터를 수신받을 수 있다. 상기 학습요청부는, 상기 데이터수집부에 생성된 수집데이터를 상기 데이터저장소와 상기 클라우드 컴퓨팅 중에서 어느 하나로 전송하여 학습요청하기 위한 것으로, 상기 수집데이터의 용량에 따라 판단할 수 있다. 즉, 상기 학습요청부는 상기 수집데이터의 용량에 따라 상기 데이터저장소와 상기 클라우드 컴퓨팅 중에서 학습요청을 하기 위한 대상이 판단되며, 판단된 상기 데이터저장소와 상기 클라우드 컴퓨팅 중 어느 하나로 전송되어 학습요청될 수 있다. 이때, 상기 학습요청부는 학습요청하기 위한 상기 데이터저장소와 상기 클라우드 컴퓨팅 중 어느 하나를 판단하기 위해 상기 수집데이터의 용량과 미리 설정된 기준용량을 비교한다. 상기 수집데이터의 용량이 미리 설정된 기준용량 이하일 경우에는 상기 데이터저장소로 상기 수집데이터를 전송하여 학습요청하며, 상기 수집데이터의 용량이 미리 설정된 기준용량을 초과할 경우에는 상기 클라우드 컴 퓨팅으로 상기 수집데이터를 전송하여 학습요청한다. 상기 학습요청부로 인해 상황에 따라 판단된 상기 데이터저장소와 상기 클라우드 컴퓨팅 중 어느 하나로 상기 수집데이터를 전송하여 학습요청함으로써 효율적으로 전이학습시켜 신속한 AI서비스를 제공할 수 있게 된다. 상기 데이터제공부는, 상기 학습요청부에 의해 수집데이터를 상기 데이터저장소로 전송한 경우에 상기 데이터저장소에서 결과데이터를 수신받고, 상기 학습요청부에 의해 수집데이터를 상기 클라우드 컴퓨팅으로 전송한 경우에 상기 클라우드 컴퓨팅에서 학습데이터를 수신받게 된다. 상기 데이터제공부는 상기 데이터저장소으로부터 수신받은 결과데이터나 상기 클라우드 컴퓨팅으로 부터 수신받은 학습데이터를 해당 마이크로 스토리지로 제공한다. 이때, 상기 데이터제공부는 상기 결과데이터나 학습데이터의 종류에 따라 마이크로 스토리지의 식별정 보가 미리 저장되어 있는 것이 바람직하며, 상기 결과데이터나 학습데이터의 종류에 대응되는 마이크로 스토리지를 추출하여 그에 해당되는 상기 결과데이터나 학습데이터를 제공할 수 있다. 또한, 상기 데이터제공부는 상기 결과데이터나 학습데이터를 요청한 마이크로 스토리지로 제공할 수도 있다. 상기 데이터저장소는, 상기 도 3에 도시된 바와 같이, 상기 데이터레이크와 통신하기 위한 데이터저장 소통신부와, 상기 데이터저장소통신부를 통해 상기 데이터레이크로부터 수신받은 수집데이터를 전 이학습하기 위한 전이학습부와, 상기 전이학습부를 통해 전이학습되어 결과데이터를 생성하기 위한 학 습완료부와, 상기 학습완료부에서 생성된 결과데이터를 공유하기 위한 결과공유부를 포함하여 구성 될 수 있다. 상기 데이터저장소통신부는, 상기 데이터레이크와 통신하기 위해 무선 네트워크를 사용할 수 있다. 다 시 말해, 상기 데이터저장소통신부는 상기 데이터레이크와 동일한 무선 네트워크를 사용하여 통신할 수 있다. 상기 전이학습부는, FPGA 또는 GPU 자원을 이용한 분산 AI 서비스를 제공하기 위해 전이학습을 지원한다. 상기 전이학습은 과도한 컴퓨팅 능력 없이 과거 모델을 새 도메인으로 전이하는 머신 학습의 부문이다. 또한, 상기 전이학습은 도메인의 임베딩 벡터(embedding vector)의 근본적인 분포가 원본 도메인과 다르며, 이를 통해 기존 모델 및 도메인 지식을 재사용할 수 있어 오랜 데이터 세트에 대한 반복 훈련을 피할 수 있다. 상기 전이학습부는 고정된 특징 추출기(fixed feature extractor), 미세조정(fine-tuning), 미리 학습된 모델(pretrained model) 등을 이용하여 상기 데이터레이크로부터 수신받은 수집데이터를 전이학습한다. 상기 학습완료부는, 상기 전이학습부에서 수집데이터가 전이학습되어 결과데이터를 생성하게 된다. 상기 결과데이터는 상기 수집데이터가 전이학습완료된 결과이며, AI 서비스인 것이 바람직하다. 이에, 상기 결 과데이터는 상기 마이크로 스토리지에서 바로 사용할 수도 있다. 상기 결과공유부는, 상기 데이터레이크로 상기 결과데이터를 공유하기 위한 것으로, 타 데이터레이크로 도 공유하여 사용할 수 있다. 상기 데이터저장소가 구성됨으로 인해 상기 데이터레이크와 동등한 수준의 협업 및 확장성을 제공할 수 있게 되며, AI서비스를 위하여 상기 데이터레이크와의 물리적 네트워크, 스토리지 및 컴퓨팅 자원들의 공유 를 통해 협업 및 확장성을 상속하게 되어 효율적으로 전이학습을 수행할 수 있게 된다. 한편, 상기 클라우드 컴퓨팅은, 상기 도 4에 도시된 바와 같이, 상기 데이터레이크와 통신하기 위한 클 라우드통신부와, 상기 클라우드통신부를 통해 상기 데이터레이크로부터 수신받은 수집데이터를 백 업하기 위한 백업부와, 상기 백업부에 백업된 수집데이터를 전이학습하여 학습데이터를 생성하기 위한 AI학습부와, 상기 AI학습부를 통해 생성된 학습데이터를 상기 데이터레이크로 전달하기 위한 데이 터전달부를 포함하여 구성되는 것이 바람직하다. 상기 클라우드통신부는, 와이파이, 인터넷 등과 같은 무선네트워크를 사용하여 상기 데이터레이크와 통 신한다. 상기 백업부는, 상기 클라우드통신부를 통해 상기 데이터레이크로부터 수집데이터를 수신받아 백업 한다. 상기 백업부로 인해 상기 데이터레이크의 수집데이터를 백업함으로써 상기 데이터레이크의 용량 부 족이나 오류 등에 의해 원본이 손상되거나 삭제되더라도 추후 AI학습에 영향을 미치는 것을 미연에 방지할 수 있게 된다. 상기 AI학습부는, 상기 백업된 수집데이터를 전이학습하여 학습데이터를 생성한다. 상기 학습데이터는 상기 수집데이터를 전이학습한 것으로, 추후 상기 마이크로 스토리지로 전달되었을 경우 에 적용시킨 다음에 사용할 수 있게 된다. 이때, 상기 AI학습부는 상기 수집데이터를 전이학습하기 위해 퍼블릭 클라우드의 컴퓨팅 자원과 GPU Cluster 또는 GPU Cloud를 이용한 AI로 대용량 학습 데이터를 기반으로 Fast Training을 지원하게 된다. 상기 AI학습부에서 Fast Training을 지원함으로써 상기 수집데이터의 전이학습을 신속하게 수행할 수 있으 며, 상기 수집데이터가 대용량이더라도 학습에 대한 오류가 발생하는 것을 최대한 방지할 수 있게 된다. 상기 데이터전달부는, 상기 AI학습부를 통해 생성된 학습데이터를 상기 데이터레이크로 전달한다. 상기 클라우드 컴퓨팅이 구성됨으로써 상기 데이터레이크의 물리적 자원의 한계성을 퍼블릭 클라우드를 통한 스토리지의 확장성을 확보할 수 있도록 하며, 퍼블릭 클라우드의 컴퓨팅 자원을 통해 상기 수집데이터의 학습 및 학습시간을 단축시킬 수 있게 된다. 한편, 상기 데이터저장소와 상기 클라우드 컴퓨팅에서 전이학습을 적용하기 위한 알고리즘은 개발자/사 용자 또는 서비스 제공자의 무작위나 직관적으로 적용하기 보다 이전에 학습된 수집데이터와 새로 수신한 수집 데이터의 상관관계를 측정함으로써 전이학습의 타당성과 전이학습을 위한 시간과 컴퓨팅 자원을 효율적으로 응 용이 가능하다. 상기 상관관계 측정은 모수적(Parametric) 방법과 비모수적 방법(Non-parametric) 방법으로 구분되며, 상기 모 수적 상관관계는 피어슨 적률 상관계수(Pearson product moment correlation coefficient) 기법을 사용하고, 상기 비모수적 상관관계는 켄달의 타우(Kendall's Tau) 기법이나 스피어만의 순위 상관계수(Spearman's rank order correlation coefficient) 기법을 사용할 수 있다. 상기 상관관계를 측정한 결과인 상관 계수는 -1과 +1 사이의 값을 가지게 되며, 0은 관련성이 없다는 것을 의미 한다. 이때, 상기 -1 또는 +1에 근접한 값은 관련성이 크다는 것을 의미하며, +는 관계의 양 방향성을 나타내고 -는 관계의 역 방향성을 나타낸다. 상기 마이크로 스토리지는, 상기 도 5에 도시된 바와 같이, 식별하기 위한 식별정보를 저장하여 관리하기 위한 정보관리부와, 상기 데이터레이크와 통신하기 위한 마이크로스토리지통신부와, 상기 마이크로 스토리지통신부를 통해 상기 데이터레이크로 전송하기 위한 데이터를 입력하기 위한 데이터입력부 와, 상기 데이터레이크에서 수신받은 결과데이터나 학습데이터를 저장하기 위한 데이터저장부와, 상기 데이터저장부에 저장된 학습데이터를 적용시키기 위한 데이터적용부와, 상기 데이터적용부를 통해 적용된 학습데이터나 상기 데이터저장부에 저장된 결과데이터를 사용하기 위한 데이터사용부를 포함하 여 구성될 수 있다. 상기 마이크로 스토리지는 헬스케어, 웨어러블 디바이스, IoT 디바이스 등과 같은 저사양 저전력 디바이스 이다. 상기 정보관리부는, 상기 마이크로 스토리지를 타 마이크로 스토리지와 식별가능하도록 식별정보를 생 성하여 저장하고 관리한다. 상기 식별정보에는 상기 마이크로 스토리지를 식별하기 위한 식별번호와 상기 마이크로 스토리지의 종 류 등이 포함될 수 있으며, 상기 마이크로 스토리지를 사용하는 사용자의 정보가 더 포함되어 생성될 수 있 다. 상기 마이크로스토리지통신부는, 상기 데이터레이크와 통신하기 위해 인터넷, 와이파이 등과 같은 무선 네트워크를 사용할 수 있다. 상기 데이터입력부는, 학습을 위한 데이터를 입력하여 상기 마이크로스토리지통신부를 통해 상기 데이 터레이크로 전송한다. 상기 학습을 위한 데이터는 사용자의 패턴분석을 통해 사용자 환경이나 상태 등을 포함할 수 있다. 상기 데이터는 추후 AI 서비스를 제공하기 위해 상기 데이터저장소나 상기 클라우드 컴퓨팅을 통해 학 습되는 초기 데이터로서, 사용자가 직접 입력하여 생성할 수 있다. 상기 데이터입력부는 상기 데이터를 미리 설정된 전송시각에 따라 상기 데이터레이크로 전송하는 것이 바람직하다. 상기 데이터저장부는 상기 데이터를 전송받은 데이터레이크에서 결과데이터나 학습데이터를 수신받고, 상기 수신받은 결과데이터나 학습데이터를 저장한다. 상기 데이터저장부에 학습데이터가 저장될 경우에는 상기 데이터적용부에서 상기 학습데이터를 적용시 킨다. 상기 데이터적용부는, 사용자가 AI서비스를 사용할 수 있도록 상기 학습데이터를 적용시키는 것으로, 상기 학습데이터의 결과를 적용시키게 된다. 상기 데이터사용부는, 상기 데이터적용부에 적용된 학습데이터를 사용하거나 상기 데이터저장부에 결과데이터가 저장될 경우에 상기 결과데이터를 사용한다. 즉, 상기 데이터사용부는 상기 데이터적용부(4 5)에 적용된 학습데이터나 상기 결과데이터를 상기 마이크로 스토리지를 사용하는 사용자의 환경이나 상태 등에 따라 사용하여 AI서비스를 제공할 수 있게 된다. 상기와 같이 구성된 마이크로 스토리지는 상기 데이터레이크를 통해 마이크로 스토리지의 특성과 저사 양 컴퓨팅의 단점을 극복하여 사용자에게 AI서비스를 제공할 수 있게 된다. 또한, 상기 마이크로 스토리지와 상기 데이터레이크 사이는 내장형 AI로 저사양의 임베디드 시스템에 적합하며, 독립적인 인공지능 시스템 혹은 클라우드 서비스의 연결을 최소화하는 인공지능 시스템이 될 수 있다. 이에, 실생활에 필요한 제품에 외부 통신 데이터 사용을 최소화시킨 학습기능을 이용할 수 있게 된다. 상기 내장형 AI는 스마트 오브젝트(Smart Objects), 자연어 처리(Natural Language Processing), 개인화 (Personalization) 등 개인맞춤형 서비스를 지원하게 된다. 상기와 같이 구성된 인공지능을 이용한 연결된 데이터 아키텍처 시스템의 제어방법은, 상기 도 6에 도시된 바와 같이, 먼저, 상기 데이터레이크에서 상기 데이터를 수집하고 누적저장하여 수집데이터를 생성한다(S10). 상기 데이터레이크에서 상기 데이터저장소나 상기 클라우드 컴퓨팅 중 어느 하나로 상기 수집데이 터를 전송하기 위해 상기 수집데이터의 용량과 미리 설정된 기준용량을 비교하여 판단한다(S20). 즉, 상기 데이터레이크에서는 상기 수집데이터의 용량을 측정하여 상기 수집데이터의 용량이 미리 설정된 기준용량을 초과하는 지 판단하게 된다. 상기 데이터레이크에서 상기 수집데이터의 용량이 미리 설정된 기준용량 이하로 판단된 경우에 상기 수집데 이터의 전이학습을 병렬로 처리하기 위해 데이터저장소로 상기 수집데이터를 전송하여 학습을 요청하게 된 다. 반면, 상기 데이터레이크에서 상기 수집데이터이 용량이 미리 설정된 기준용량을 초과하였다고 판단된 경우에 상기 수집데이터를 백업하고 전이학습하기 위해 클라우드 컴퓨팅으로 상기 수집데이터를 전송하여 학습을 요청하게 된다(S30). 상기 데이터레이크에서 상기 데이터저장소로 상기 수집데이터를 전송할 경우에는, 상기 데이터저장소 에서 상기 수집데이터를 전이학습하게 된다(S40). 상기 데이터저장소는 상기 수집데이터를 전이학습한 결과에 대한 결과데이터를 생성하고, 상기 결과데이터 를 상기 데이터레이크로 공유한다(S41). 상기와 같이 상기 데이터레이크를 중심으로 상기 데이터저장소와 협업함으로 인해 학습을 위한 데이터 를 수집하고, 전이학습하며, 학습결과를 적용하는 단계를 공유 및 확장성을 지원하게 된다. 상기 데이터저장소를 사용함으로써 데이터 수집에 대한 물리적 자원의 한계성을 SDI 기술에 의해 공유 및 확장성을 확보할 수 있으며, SDI기술과 가상화 기술에 의해 전이학습을 병렬로 처리할 수 있게 되고 학습된 결 과데이터를 공유 및 AI서비스를 제공할 수 있게 된다. 상기 데이터레이크에서 상기 클라우드 컴퓨팅으로 상기 수집데이터를 전송할 경우에는, 상기 클라우드 컴퓨팅에서 상기 수집데이터를 백업한다(S50). 상기 클라우드 컴퓨팅은 상기 백업된 수집데이터를 전이학습하여 학습데이터를 생성한다(S51). 상기 클라우드 컴퓨팅에서 생성된 학습데이터는 상기 데이터레이크로 전달된다(S52). 상기와 같이 상기 데이터레이크를 중심으로 상기 클라우드 컴퓨팅을 통해 AI학습함으로 인해 상기 클라 우드 컴퓨팅의 퍼블릭 클라우드를 통한 스토리지 및 컴퓨팅 자원의 확장성을 갖게 되어 데이터를 수집하고, 전이학습하는 단계의 확장성을 지원하게 된다. 다시 말해, 상기 데이터레이크의 물리적 자원에 대한 한계성 은 상기 클라우드 컴퓨팅의 퍼블릭 클라우드의 스토리지로 확장성을 확보하고, 상기 데이터레이크의 수 집데이터에 대한 전이학습은 상기 클라우드 컴퓨팅의 퍼블릭 클라우드의 컴퓨팅 자원을 통해 학습 및 학습 시간을 단축할 수 있게 된다. 상기 데이터저장소의 결과데이터나 상기 클라우드 컴퓨팅의 학습데이터를 수신받은 데이터레이크는 상기 결과데이터나 상기 학습데이터를 마이크로 스토리지로 제공한다(S60). 이때, 상기 데이터레이크에는 상기 마이크로 스토리지의 식별정보가 미리 저장되어 있어야 하며, 상기 결과데이터나 상기 학습데이터 에 대응되는 마이크로 스토리지를 추출하여 상기 결과데이터나 상기 학습데이터를 제공해야 한다. 상기 마이크로 스토리지에서 상기 학습데이터를 수신받을 경우에는 상기 마이크로 스토리지를 통해 AI 서비스를 사용할 수 있도록 상기 학습데이터의 결과를 적용할 수 있다(S70). 상기 마이크로 스토리지에서 상기 결과데이터를 수신받을 경우에는 상기 마이크로 스토리지에서 사용할 수 있다. 또한, 상기 마이크로 스토리지에서 상기 학습데이터가 적용될 경우에 상기 적용된 학습데이터를 사용할 수 있다(S80). 상기 마이크로 스토리지는 상기 데이터레이크를 통해 상기 학습데이터나 상기 결과데이터를 수신받음으 로써 데이터를 수집하고 전이학습하는 단계를 상기 데이터레이크를 통해 수행하기 때문에 저사양 컴퓨팅의 특성을 극복할 수 있게 된다. 상기와 같이 제어되는 인공지능을 이용한 연결된 데이터 아키텍처 시스템은, 데이터를 구조적으로 관리하면서 안정적으로 인터페이스별로 딥 러닝을 통해 데이터를 학습시켜 학습데이터나 결과데이터를 수신받아 사용자의 환경이나 상태에 따라 학습데이터나 결과데이터를 제공할 수 있어 헬스케어, 웨어러블 디바이스, IoT 디바이스 등과 같은 저사양 디바이스에서 독립적으로 인공지능이 동작할 수 있게 되며, 사용자 맞춤형으로 AI서비스를 제 공할 수 있는 효과가 있다. 또한, 학습할 데이터를 수집한 데이터레이크와 데이터저장소 간의 인터페이스를 통해 학습할 데이터에 대한 학습을 병렬로 처리할 수 있어 공유 및 확장성을 확보할 수 있어 어느 하나로 통합되는 데이터의 용량을 줄여 최적의 학습 및 데이터 분류가 가능함으로 인해 효율적으로 AI서비스를 제공할 수 있게 된다. 또한, 학습할 데이터를 수집한 데이터레이크와 클라우드 컴퓨팅 간의 인터페이스를 통해 확장성을 제공 하기 때문에 학습할 데이터가 대용량이더라도 학습 및 학습시간을 단축시킬 수 있는 효과가 있다. 앞에서 설명되고, 도면에 도시된 본 발명의 실시 예들은 본 발명의 기술적 사상을 한정하는 것으로 해석되어서"}
{"patent_id": "10-2018-0131164", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 안 된다. 본 발명의 보호범위는 청구범위에 기재된 사항에 의하여만 제한되고, 본 발명의 기술분야에서 통 상의 지식을 가진 자는 본 발명의 기술적 사상을 다양한 형태로 개량 변경하는 것이 가능하다. 따라서 이러한 개량 및 변경은 통상의 지식을 가진 자에게 자명한 것인 경우에는 본 발명의 보호범위에 속하게 될 것이다."}
{"patent_id": "10-2018-0131164", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템, 도 2는 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 데이터레이크, 도 3은 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 데이터저장소, 도 4는 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 클라우드 컴퓨팅, 도 5는 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 마이크로 스토리 지, 도 6은 본 발명의 일실시 예에 의한 인공지능 서비스를 위한 연결된 데이터 아키텍처 시스템의 제어방법."}
