{"patent_id": "10-2023-0138945", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0055302", "출원번호": "10-2023-0138945", "발명의 명칭": "전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "이기성"}}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,통신 인터페이스; 및적어도 하나의 프로세서;를 포함하고,상기 적어도 하나의 프로세서는,사운드 플레이를 위한 사용자 입력이 수신되면, 상기 사운드 플레이를 수행할 수 있는 타겟 디바이스를 식별하고,상기 타겟 디바이스의 전원 상태를 식별하고,상기 타겟 디바이스의 전원이 오프 상태인 것으로 식별되면, 상기 통신 인터페이스를 통해, 상기 타겟 디바이스에 포함된 스피커의 전원을 온 상태로 변경하기 위한 제1 웨이크업 신호를 상기 타겟 디바이스에 전송하고,상기 제1 웨이크업 신호에 대응되는 제1 응답 신호가 수신되면, 상기 통신 인터페이스를 통해, 상기 사운드 플레이를 위한 제1 제어 명령을 상기 타겟 디바이스에 전송하는, 전자 장치."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는,상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 전원 상태 정보를 요청하는 신호를 상기 타겟 디바이스에전송하고,상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 상기 전원 상태 정보가 수신되면, 상기 전원 상태 정보에기초하여 상기 타겟 디바이스의 전원이 오프 상태인지 여부를 판단하는, 전자 장치."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 적어도 하나의 프로세서는,상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 상기 전원 상태 정보가 임계 시간동안 수신되지 않으면,상기 통신 인터페이스를 통해, 상기 제1 웨이크업 신호를 상기 타겟 디바이스에 전송하는, 전자 장치."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 적어도 하나의 프로세서는,상기 제1 웨이크업 신호에 대응되는 상기 제1 응답 신호가 임계 시간 동안 수신되지 않으면, 상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 전원을 온 상태로 변경하기 위한 제2 웨이크업 신호를 상기 타겟 디바이스에 전송하고,상기 제2 웨이크업 신호에 대응되는 제2 응답 신호가 수신되면, 상기 통신 인터페이스를 통해, 상기 사운드 플레이를 위한 상기 제1 제어 명령을 상기 타겟 디바이스에 전송하는, 전자 장치."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,공개특허 10-2025-0055302-3-상기 적어도 하나의 프로세서는,상기 제2 웨이크업 신호에 대응되는 상기 제2 응답 신호가 임계 시간 동안 수신되지 않으면, 상기 타겟 디바이스의 전원 상태와 관련된 가이드 화면을 제공하는, 전자 장치."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 적어도 하나의 프로세서는,상기 통신 인터페이스의 제1 웨이크업 핀을 통해, 상기 제1 웨이크업 신호를 상기 타겟 디바이스에 전송하고,상기 통신 인터페이스의 제2 웨이크업 핀을 통해, 상기 제2 웨이크업 신호를 상기 타겟 디바이스에 전송하는,전자 장치."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는,상기 타겟 디바이스의 전원이 온 상태이면, 상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 상기 스피커에대한 권한을 요청하는 신호를 상기 타겟 디바이스에 전송하고,상기 권한을 요청하는 신호에 대응하는 응답 신호가 수신되면, 상기 통신 인터페이스를 통해, 상기 사운드 플레이를 위한 상기 제1 제어 명령을 상기 타겟 디바이스에 전송하는, 전자 장치."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 전자 장치는,마이크;를 더 포함하고,상기 적어도 하나의 프로세서는,상기 타겟 디바이스가 상기 사운드 플레이를 수행하는 동안, 상기 마이크를 통해, 오디오 데이터를 획득하고,상기 오디오 데이터에 기초하여 상기 사운드 플레이와 관련된 타겟 오디오 신호 및 노이즈 오디오 신호를 구분하고,상기 노이즈 오디오 신호의 제1 크기가 상기 타겟 오디오 신호의 제2 크기 이상이면, 상기 통신 인터페이스를통해, 상기 타겟 디바이스의 출력을 변경하기 위한 제2 제어 명령을 상기 타겟 디바이스에 전송하는, 전자장치."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 적어도 하나의 프로세서는,상기 통신 인터페이스를 통해, 상기 타겟 디바이스에 포함된 상기 스피커의 볼륨을 증가시키기 위한 상기 제2제어 명령을 상기 타겟 디바이스에 전송하는, 전자 장치."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 적어도 하나의 프로세서는,상기 통신 인터페이스를 통해, 상기 타겟 디바이스에서 출력되는 노이즈를 감소시키기 위한 상기 제2 제어 명령을 상기 타겟 디바이스에 전송하는, 전자 장치.공개특허 10-2025-0055302-4-청구항 11 전자 장치의 제어 방법에 있어서,사운드 플레이를 위한 사용자 입력이 수신되면, 상기 사운드 플레이를 수행할 수 있는 타겟 디바이스를 식별하는 단계;상기 타겟 디바이스의 전원 상태를 식별하는 단계;상기 타겟 디바이스의 전원이 오프 상태인 것으로 식별되면, 상기 타겟 디바이스에 포함된 스피커의 전원을 온상태로 변경하기 위한 제1 웨이크업 신호를 상기 타겟 디바이스에 전송하는 단계; 및상기 제1 웨이크업 신호에 대응되는 제1 응답 신호가 수신되면, 상기 사운드 플레이를 위한 제1 제어 명령을 상기 타겟 디바이스에 전송하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 타겟 디바이스의 전원 상태를 식별하는 단계는,상기 타겟 디바이스의 전원 상태 정보를 요청하는 신호를 상기 타겟 디바이스에 전송하고,상기 타겟 디바이스의 상기 전원 상태 정보가 수신되면, 상기 전원 상태 정보에 기초하여 상기 타겟 디바이스의전원이 오프 상태인지 여부를 판단하는, 제어 방법."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제1 웨이크업 신호를 전송하는 단계는,상기 타겟 디바이스의 상기 전원 상태 정보가 임계 시간동안 수신되지 않으면, 상기 제1 웨이크업 신호를 상기타겟 디바이스에 전송하는, 제어 방법."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제어 방법은,상기 제1 웨이크업 신호에 대응되는 상기 제1 응답 신호가 임계 시간 동안 수신되지 않으면, 상기 타겟 디바이스의 전원을 온 상태로 변경하기 위한 제2 웨이크업 신호를 상기 타겟 디바이스에 전송하는 단계; 및상기 제2 웨이크업 신호에 대응되는 제2 응답 신호가 수신되면, 상기 사운드 플레이를 위한 상기 제1 제어 명령을 상기 타겟 디바이스에 전송하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제어 방법은,상기 제2 웨이크업 신호에 대응되는 상기 제2 응답 신호가 임계 시간 동안 수신되지 않으면, 상기 타겟 디바이스의 전원 상태와 관련된 가이드 화면을 제공하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 제1 웨이크업 신호를 전송하는 단계는,상기 전자 장치에 포함된 통신 인터페이스의 제1 웨이크업 핀을 통해, 상기 제1 웨이크업 신호를 상기 타겟 디바이스에 전송하고,공개특허 10-2025-0055302-5-상기 제2 웨이크업 신호를 전송하는 단계는,상기 통신 인터페이스의 제2 웨이크업 핀을 통해, 상기 제2 웨이크업 신호를 상기 타겟 디바이스에 전송하는,제어 방법."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 제어 방법은,상기 타겟 디바이스의 전원이 온 상태이면, 상기 타겟 디바이스의 상기 스피커에 대한 권한을 요청하는 신호를상기 타겟 디바이스에 전송하는 단계; 및상기 권한을 요청하는 신호에 대응하는 응답 신호가 수신되면, 상기 사운드 플레이를 위한 상기 제1 제어 명령을 상기 타겟 디바이스에 전송하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제어 방법은,상기 타겟 디바이스가 상기 사운드 플레이를 수행하는 동안, 상기 전자 장치에 포함된 마이크를 통해 오디오 데이터를 획득하는 단계;상기 오디오 데이터에 기초하여 상기 사운드 플레이와 관련된 타겟 오디오 신호 및 노이즈 오디오 신호를 구분하는 단계; 및상기 노이즈 오디오 신호의 제1 크기가 상기 타겟 오디오 신호의 제2 크기 이상이면, 상기 타겟 디바이스의 출력을 변경하기 위한 제2 제어 명령을 상기 타겟 디바이스에 전송하는 단계; 를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 제2 제어 명령을 전송하는 단계는,상기 타겟 디바이스에 포함된 상기 스피커의 볼륨을 증가시키기 위한 상기 제2 제어 명령을 상기 타겟 디바이스에 전송하는, 제어 방법."}
{"patent_id": "10-2023-0138945", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서,상기 제2 제어 명령을 전송하는 단계는,상기 타겟 디바이스에서 출력되는 노이즈를 감소시키기 위한 상기 제2 제어 명령을 상기 타겟 디바이스에 전송하는, 제어 방법."}
{"patent_id": "10-2023-0138945", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치는 통신 인터페이스 및 적어도 하나의 프로세서를 포함하고, 적어도 하나의 프로세서는 사운드 플레이 를 위한 사용자 입력이 수신되면, 사운드 플레이를 수행할 수 있는 타겟 디바이스를 식별하고, 타겟 디바이스의 전원 상태를 식별하고, 타겟 디바이스의 전원이 오프 상태인 것으로 식별되면, 통신 인터페이스를 통해, 타겟 디 바이스에 포함된 스피커의 전원을 온 상태로 변경하기 위한 제1 웨이크업 신호를 타겟 디바이스에 전송하고, 제1 웨이크업 신호에 대응되는 제1 응답 신호가 수신되면, 통신 인터페이스를 통해, 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스에 전송한다."}
{"patent_id": "10-2023-0138945", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 제어방법에 관한 것으로, 더욱 상세하게는 타 디바이스의 스피커를 이용하여 오디오 컨텐츠를 재생하는 전자 장치 및 그 제어방법에 대한 것이다."}
{"patent_id": "10-2023-0138945", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스피커를 포함하는 서브 장치는 기본 기능에 따른 오디오 데이터를 출력할 수 있다. 호스트 장치는 서브 장치에 포함된 스피커를 제어할 수 있다. 호스트 장치는 서브 장치의 스피커를 이용하여 기본 기능과 별개로 새로운 오디오 데이터를 출력하도록 서브 장치를 제어할 수 있다. 호스트 장치는 서브 장치를 이용하기 위해 서브 장치의 전원 상태를 분석할 수 있다. 서브 장치의 전원이 꺼져 있는 경우, 호스트 장치는 서브 장치의 전원을 켜기 위해 웨이크업 신호(또는 부팅 신호)를 서브 장치에 전송할 수 있다. 서브 장치가 기본 기능을 수행하지 않음에도 불구하고 서브 장치의 스피커를 이용하기 위해 서브 장치의 전원이 모두 켜지는 경우, 불필요한 전력이 낭비되는 문제점이 있다."}
{"patent_id": "10-2023-0138945", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 상술한 문제를 개선하기 위해 고안된 것으로, 본 개시의 목적은 제어 대상 기기의 전원 상태를 고려 하여 제어 대상 기기의 스피커에만 전원을 공급하도록 제어하는 전자 장치 및 그의 제어 방법을 제공함에 있다. 일 실시 예에 따라, 전자 장치는 통신 인터페이스 및 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는 사운드 플레이를 위한 사용자 입력이 수신되면, 상기 사운드 플레이를 수행할 수 있는 타겟 디바이 스를 식별하고, 상기 타겟 디바이스의 전원 상태를 식별하고, 상기 타겟 디바이스의 전원이 오프 상태인 것으로 식별되면, 상기 통신 인터페이스를 통해, 상기 타겟 디바이스에 포함된 스피커의 전원을 온 상태로 변경하기 위 한 제1 웨이크업 신호를 상기 타겟 디바이스에 전송하고, 상기 제1 웨이크업 신호에 대응되는 제1 응답 신호가 수신되면, 상기 통신 인터페이스를 통해, 상기 사운드 플레이를 위한 제1 제어 명령을 상기 타겟 디바이스에 전 송한다. 상기 적어도 하나의 프로세서는 상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 전원 상태 정보를 요청하 는 신호를 상기 타겟 디바이스에 전송하고, 상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 상기 전원 상 태 정보가 수신되면, 상기 전원 상태 정보에 기초하여 상기 타겟 디바이스의 전원이 오프 상태인지 여부를 판단 할 수 있다. 상기 적어도 하나의 프로세서는 상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 상기 전원 상태 정보가 임 계 시간동안 수신되지 않으면, 상기 통신 인터페이스를 통해, 상기 제1 웨이크업 신호를 상기 타겟 디바이스에 전송할 수 있다. 상기 적어도 하나의 프로세서는 상기 제1 웨이크업 신호에 대응되는 상기 제1 응답 신호가 임계 시간 동안 수신 되지 않으면, 상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 전원을 온 상태로 변경하기 위한 제2 웨이크 업 신호를 상기 타겟 디바이스에 전송하고, 상기 제2 웨이크업 신호에 대응되는 제2 응답 신호가 수신되면, 상 기 통신 인터페이스를 통해, 상기 사운드 플레이를 위한 상기 제1 제어 명령을 상기 타겟 디바이스에 전송할 수 있다. 상기 적어도 하나의 프로세서는 상기 제2 웨이크업 신호에 대응되는 상기 제2 응답 신호가 임계 시간 동안 수신 되지 않으면, 상기 타겟 디바이스의 전원 상태와 관련된 가이드 화면을 제공할 수 있다. 상기 적어도 하나의 프로세서는 상기 통신 인터페이스의 제1 웨이크업 핀을 통해, 상기 제1 웨이크업 신호를 상 기 타겟 디바이스에 전송하고, 상기 통신 인터페이스의 제2 웨이크업 핀을 통해, 상기 제2 웨이크업 신호를 상 기 타겟 디바이스에 전송할 수 있다. 상기 적어도 하나의 프로세서는 상기 타겟 디바이스의 전원이 온 상태이면, 상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 상기 스피커에 대한 권한을 요청하는 신호를 상기 타겟 디바이스에 전송하고, 상기 권한을 요 청하는 신호에 대응하는 응답 신호가 수신되면, 상기 통신 인터페이스를 통해, 상기 사운드 플레이를 위한 상기 제1 제어 명령을 상기 타겟 디바이스에 전송할 수 있다. 상기 전자 장치는 마이크를 더 포함하고, 상기 적어도 하나의 프로세서는 상기 타겟 디바이스가 상기 사운드 플 레이를 수행하는 동안, 상기 마이크를 통해, 오디오 데이터를 획득하고, 상기 오디오 데이터에 기초하여 상기 사운드 플레이와 관련된 타겟 오디오 신호 및 노이즈 오디오 신호를 구분하고, 상기 노이즈 오디오 신호의 제1 크기가 상기 타겟 오디오 신호의 제2 크기 이상이면, 상기 통신 인터페이스를 통해, 상기 타겟 디바이스의 출력 을 변경하기 위한 제2 제어 명령을 상기 타겟 디바이스에 전송할 수 있다. 상기 적어도 하나의 프로세서는 상기 통신 인터페이스를 통해, 상기 타겟 디바이스에 포함된 상기 스피커의 볼 륨을 증가시키기 위한 상기 제2 제어 명령을 상기 타겟 디바이스에 전송할 수 있다. 상기 적어도 하나의 프로세서는 상기 통신 인터페이스를 통해, 상기 타겟 디바이스에서 출력되는 노이즈를 감소 시키기 위한 상기 제2 제어 명령을 상기 타겟 디바이스에 전송할 수 있다. 일 실시 예에 따라, 전자 장치의 제어 방법은 사운드 플레이를 위한 사용자 입력이 수신되면, 상기 사운드 플레 이를 수행할 수 있는 타겟 디바이스를 식별하는 단계, 상기 타겟 디바이스의 전원 상태를 식별하는 단계, 상기 타겟 디바이스의 전원이 오프 상태인 것으로 식별되면, 상기 타겟 디바이스에 포함된 스피커의 전원을 온 상태 로 변경하기 위한 제1 웨이크업 신호를 상기 타겟 디바이스에 전송하는 단계 및 상기 제1 웨이크업 신호에 대응 되는 제1 응답 신호가 수신되면, 상기 사운드 플레이를 위한 제1 제어 명령을 상기 타겟 디바이스에 전송하는 단계를 더 포함한다. 상기 타겟 디바이스의 전원 상태를 식별하는 단계는 상기 타겟 디바이스의 전원 상태 정보를 요청하는 신호를 상기 타겟 디바이스에 전송하고, 상기 타겟 디바이스의 상기 전원 상태 정보가 수신되면, 상기 전원 상태 정보 에 기초하여 상기 타겟 디바이스의 전원이 오프 상태인지 여부를 판단할 수 있다. 상기 제1 웨이크업 신호를 전송하는 단계는 상기 타겟 디바이스의 상기 전원 상태 정보가 임계 시간동안 수신되 지 않으면, 상기 제1 웨이크업 신호를 상기 타겟 디바이스에 전송할 수 있다. 상기 제어 방법은 상기 제1 웨이크업 신호에 대응되는 상기 제1 응답 신호가 임계 시간 동안 수신되지 않으면, 상기 타겟 디바이스의 전원을 온 상태로 변경하기 위한 제2 웨이크업 신호를 상기 타겟 디바이스에 전송하는 단 계 및 상기 제2 웨이크업 신호에 대응되는 제2 응답 신호가 수신되면, 상기 사운드 플레이를 위한 상기 제1 제 어 명령을 상기 타겟 디바이스에 전송하는 단계를 더 포함할 수 있다. 상기 제어 방법은 상기 제2 웨이크업 신호에 대응되는 상기 제2 응답 신호가 임계 시간 동안 수신되지 않으면, 상기 타겟 디바이스의 전원 상태와 관련된 가이드 화면을 제공하는 단계를 더 포함할 수 있다. 상기 제1 웨이크업 신호를 전송하는 단계는 상기 전자 장치에 포함된 통신 인터페이스의 제1 웨이크업 핀을 통 해, 상기 제1 웨이크업 신호를 상기 타겟 디바이스에 전송하고, 상기 제2 웨이크업 신호를 전송하는 단계는 상 기 통신 인터페이스의 제2 웨이크업 핀을 통해, 상기 제2 웨이크업 신호를 상기 타겟 디바이스에 전송할 수 있 다. 상기 제어 방법은 상기 타겟 디바이스의 전원이 온 상태이면, 상기 타겟 디바이스의 상기 스피커에 대한 권한을 요청하는 신호를 상기 타겟 디바이스에 전송하는 단계 및 상기 권한을 요청하는 신호에 대응하는 응답 신호가 수신되면, 상기 사운드 플레이를 위한 상기 제1 제어 명령을 상기 타겟 디바이스에 전송하는 단계를 더 포함할 수 있다. 상기 제어 방법은 상기 타겟 디바이스가 상기 사운드 플레이를 수행하는 동안, 상기 전자 장치에 포함된 마이크 를 통해 오디오 데이터를 획득하는 단계, 상기 오디오 데이터에 기초하여 상기 사운드 플레이와 관련된 타겟 오 디오 신호 및 노이즈 오디오 신호를 구분하는 단계 및 상기 노이즈 오디오 신호의 제1 크기가 상기 타겟 오디오 신호의 제2 크기 이상이면, 상기 타겟 디바이스의 출력을 변경하기 위한 제2 제어 명령을 상기 타겟 디바이스에 전송하는 단계, 를 더 포함할 수 있다. 상기 제2 제어 명령을 전송하는 단계는 상기 타겟 디바이스에 포함된 상기 스피커의 볼륨을 증가시키기 위한 상 기 제2 제어 명령을 상기 타겟 디바이스에 전송할 수 있다. 상기 제2 제어 명령을 전송하는 단계는 상기 타겟 디바이스에서 출력되는 노이즈를 감소시키기 위한 상기 제2 제어 명령을 상기 타겟 디바이스에 전송할 수 있다."}
{"patent_id": "10-2023-0138945", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수 치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다.본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다. 본 명세서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 이하 첨부된 도면들을 참조하여 본 개시의 일 실시 예를 보다 상세하게 설명한다. 도 1은 일 실시 예에 따라, 복수의 장치를 포함하는 네트워크를 설명하기 위한 도면이다. 도 1을 참조하면, 네트워크는 복수의 장치(100, 200-1, 200-2, 200-3)들이 연결된 네트워크일 수 있다. 네트워크는 IoT(Internet of Things) 네트워크일 수 있다. 사용자는 네트워크에 포함된 복수의 장치(100, 200-1, 200-2, 200-3) 중 적어도 하나의 장치를 제어 할 수 있다. 복수의 장치(100, 200-1, 200-2, 200-3)는 호스트 디바이스와 서브 디바이스로 구분될 수 있다. 호스트 디바이 스는 사용자의 제어 명령을 직접적으로 수신할 수 있다. 서브 디바이스는 호스트 디바이스로부터 사용자 의 제어 명령을 간접적으로 수신할 수 있다. 호스트 디바이스 및 서브 디바이스는 사용자의 설정에 따 라 변경될 수 있다. 일 예로, 전자 장치가 호스트 디바이스고, 장치들(200-1, 200-2, 200-3)은 서브 디바이스일 수 있다. 사용자는 복수의 장치(100, 200-1, 200-2, 200-3)를 동시에 제어할 수 있다. 복수의 장치(100, 200-1, 200-2, 200-3)는 사용자의 제어 명령에 대한 동작을 수행할 수 있다. 복수의 장치(100, 200-1, 200-2, 200-3)는 사용자의 공통 명령에 대한 제어 동작을 수행할 수 있다. 복수의 장치(100, 200-1, 200-2, 200-3)는 사용자의 제어 명령에 대응되는 하나의 동작을 동시에 수행할 수 있다. 예를 들어, 사용자의 음악 재생 명령이 입력되면, 복수의 장치(100, 200-1, 200-2, 200-3)는 동일한 음악을 재생할 수 있다. 사용자의 제어 명령에 대응되는 동작이 복수의 장치(100, 200-1, 200-2, 200-3) 각각마다 상이할 수 있다. 예를 들어, 사용자의 음악 재생 명령이 입력되면, 전자 장치는 음악의 제1 채널에 대한 부분을 재생하 고, 제1 타겟 디바이스(200-1)는 음악의 제2 채널에 대한 부분을 재생하고, 제2 타겟 디바이스(200-2)는 음악의 제3 채널에 대한 부분을 재생하고, 제3 타겟 디바이스(200-3)는 음악의 제4 채널에 대한 부분을 재생할 수 있다. 도 2는 일 실시 예에 따라, 전자 장치를 도시한 블록도이다. 도 2를 참조하면, 전자 장치는 적어도 하나의 프로세서 또는 통신 인터페이스 중 적어도 하나를 포함할 수 있다. 통신 인터페이스는 타겟 디바이스와 통신 연결을 수행할 수 있다. 적어도 하나의 프로세서는 통 신 인터페이스를 통해 통신 신호를 전송 및 수신할 수 있다. 적어도 하나의 프로세서는 전자 장치의 전반적인 제어 동작을 수행할 수 있다. 적어도 하나의 프로세 서는 전자 장치의 전반적인 동작을 제어하는 기능을 수행할 수 있다. 적어도 하나의 프로세서는 사운드 플레이를 위한 사용자 입력이 수신되면, 사운드 플레이를 수행할 수 있 는 타겟 디바이스를 식별하고, 타겟 디바이스의 전원 상태를 식별하고, 타겟 디바이스의 전원이 오프 상태인 것으로 식별되면, 통신 인터페이스를 통해, 타겟 디바이스에 포함된 스피커의 전원 을 온 상태로 변경하기 위한 제1 웨이크업 신호를 타겟 디바이스에 전송하고, 제1 웨이크업 신호에 대응되 는 제1 응답 신호가 수신되면, 통신 인터페이스를 통해, 사운드 플레이를 위한 제1 제어 명령을 타겟 디바 이스에 전송할 수 있다. 적어도 하나의 프로세서는 사운드 플레이를 위한 사용자 입력을 수신할 수 있다. 사운드 플레이는 오디오 신호를 출력(또는 재생)하는 기능을 포함할 수 있다. 사운드 플레이는 오디오 재생, 오디오 출력 등으로 기재될수 있다. 예를 들어, 사운드 플레이는 음악을 재생하는 명령을 포함할 수 있다. 사운드 플레이는 그룹 명령에 포함될 수 있다. 그룹 명령은 복수의 장치를 제어하기 위한 사용자 명령을 나타낼 수 있다. 그룹 명령은 네트워크에 포함된 복수의 장치 또는 호스트 장치가 연결 가능한 복수의 장치 중 적어도 하나의 장치들을 제어하기 위한 명령을 포함할 수 있다. 적어도 하나의 프로세서는 그룹 명령을 수 신하고, 수신된 그룹 명령에 기초하여 그룹 명령을 수행할 적어도 하나의 장치를 식별할 수 있다. 적어도 하나 의 프로세서는 식별된 적어도 하나의 장치에 그룹 명령(또는 그룹 명령에 대응되는 제어 신호)을 전송할 수 있다. 그룹 명령은 사용자 그룹 명령, 사용자 제어 명령, 사용자 동시 제어 명령, 사용자 입력, 사용자 명령 등으로 기재될 수 있다. 네트워크는 복수의 장치(또는 디바이스)를 포함할 수 있다. 적어도 하나의 프로세서는 네트워크 에 포함된 복수의 장치 중 사운드 플레이를 수행할 수 있는 타겟 디바이스를 식별할 수 있다. 타겟 디바이스는 적어도 하나의 장치를 포함할 수 있다. 적어도 하나의 프로세서는 도 6의 메타 데이터를 이용하여 사운드 플레이를 수행할 수 있는 타겟 디 바이스를 식별할 수 있다. 이와 관련된 설명은 도 5 및 도 6에서 기재한다. 타겟 디바이스가 식별된 후, 적어도 하나의 프로세서는 타겟 디바이스의 전원 상태를 식별할 수 있다. 적어도 하나의 프로세서는 타겟 디바이스의 전원이 현재 온(on) 상태인지 오프(off) 상태인지 여부를 식별할 수 있다. 적어도 하나의 프로세서는 통신 인터페이스를 통해, 타겟 디바이스의 전원 상태 정보를 요청하 는 신호를 타겟 디바이스에 전송할 수 있다. 통신 인터페이스를 통해 타겟 디바이스의 전원 상태 정보가 수신되면, 적어도 하나의 프로세서 는 타겟 디바이스의 전원 상태를 식별할 수 있다. 타겟 디바이스의 전원 상태 정보가 수신되면, 적어도 하나의 프로세서는 타겟 디바이스의 전원 이 온 상태인 것으로 판단할 수 있다. 적어도 하나의 프로세서는 전원 상태 정보에 기초하여 타겟 디바이스의 전원이 온/오프 상태인지 여 부를 판단할 수 있다. 적어도 하나의 프로세서는 통신 인터페이스를 통해 타겟 디바이스의 전원 상태 정보가 임계 시 간동안 수신되지 않으면, 통신 인터페이스를 통해, 제1 웨이크업 신호를 타겟 디바이스에 전송할 수 있다. 통신 인터페이스를 통해 타겟 디바이스의 전원 상태 정보가 임계 시간동안 수신되지 않으면, 적어도 하나의 프로세서는 타겟 디바이스의 전원이 오프 상태인 것으로 판단할 수 있다. 적어도 하나의 프로 세서는 타겟 디바이스의 전원이 오프 상태이면, 타겟 디바이스에서 사운드 플레이를 수행하기 위해 타겟 디바이스의 전원을 온 상태로 변경하도록 시도할 수 있다. 사운드 플레이를 수행하기 위해 타겟 디바이스의 모든 하드웨어 구성의 전원이 온 상태일 필요는 없다. 사 운드 플레이를 수행하기 위해 타겟 디바이스에 포함된 스피커만 전원이 온 상태이면 된다. 타겟 디바 이스의 전원이 오프 상태이면, 적어도 하나의 프로세서는 우선적으로 타겟 디바이스에 포함된 스피커의 전원을 온 상태로 변경하기 위한 제1 웨이크업 신호를 생성할 수 있다. 적어도 하나의 프로세서 는 제1 웨이크업 신호를 타겟 디바이스에 전송할 수 있다. 적어도 하나의 프로세서는 제1 웨이크업 신호에 대응되는 제1 응답 신호를 기다릴 수 있다. 제1 응답 신호 가 수신되면, 적어도 하나의 프로세서는 타겟 디바이스에 포함된 스피커의 전원이 온 상태로 변 경되었음을 인식(또는 식별)할 수 있다. 타겟 디바이스에 포함된 스피커의 전원이 온 상태로 변경되었음을 인식하면, 적어도 하나의 프로세서 는 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스에 전송할 수 있다. 적어도 하나의 프로세서는 제1 웨이크업 신호에 대응되는 제1 응답 신호가 임계 시간 동안 수신되지 않으 면, 통신 인터페이스를 통해, 타겟 디바이스의 전원을 온 상태로 변경하기 위한 제2 웨이크업 신호를타겟 디바이스에 전송하고, 제1 응답 신호가 수신되지 않으면, 적어도 하나의 프로세서는 타겟 디바이스에 포함된 스피커의 전원이 여전히 오프 상태인 것으로 인식할 수 있다. 제1 웨이크업 신호의 전송에도 불구하고 스피커의 전원이 오프 상태이므로, 적어도 하나의 프로세서 는 타겟 디바이스의 전체 전원을 온 상태로 변경하도록 시도할 수 있다. 타겟 디바이스가 타겟 디바 이스에 포함된 스피커의 전원만을 변경하는 기능을 포함하지 않을 수 있기 때문이다. 적어도 하나의 프로세서는 타겟 디바이스에 포함된 모든 하드웨어 구성을 제어하기 위해 타겟 디바이 스의 전체 전원을 공급하기 위한 제2 웨이크업 신호를 생성할 수 있다. 적어도 하나의 프로세서는 제 2 웨이크업 신호를 타겟 디바이스에 전송할 수 있다. 적어도 하나의 프로세서는 제2 웨이크업 신호에 대응되는 제2 응답 신호를 기다릴 수 있다. 제2 응답 신호가 수신되면, 적어도 하나의 프로세서는 타겟 디바이스의 전원이 온 상태로 변경되었음 을 인식(또는 식별)할 수 있다. 타겟 디바이스 의 전원이 온 상태로 변경되었음을 인식하면, 적어도 하나의 프로세서는 사운드 플레 이를 위한 제1 제어 명령을 타겟 디바이스에 전송할 수 있다. 제2 웨이크업 신호에 대응되는 제2 응답 신호가 수신되면, 통신 인터페이스를 통해, 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스에 전송할 수 있다. 적어도 하나의 프로세서는 제2 웨이크업 신호에 대응되는 제2 응답 신호가 임계 시간 동안 수신되지 않으 면, 타겟 디바이스의 전원 상태와 관련된 가이드 화면을 제공할 수 있다. 제1 웨이크업 신호에 대응되는 제1 응답 신호 및 제2 웨이크업 신호에 대응하는 제2 응답 신호가 모두 수신되지 않으면, 적어도 하나의 프로세서는 웨이크업 신호를 전송함으로써 타겟 디바이스의 전원을 온 상태로 변경하는 것이 불가능하다고 판단할 수 있다. 적어도 하나의 프로세서는 이와 관련된 가이드 화면을 제공 할 수 있다. 가이드 화면은 타겟 디바이스의 전원을 온 상태로 변경할 수 없음을 나타내는 정보, 사용자가 직접 타 겟 디바이스의 전원을 온 상태로 변경하도록 가이드하는 정보 중 적어도 하나를 포함할 수 있다. 이와 관 련된 구체적인 설명은 도 12에서 기재한다. 적어도 하나의 프로세서는 통신 인터페이스의 제1 웨이크업 핀을 통해, 제1 웨이크업 신호를 타 겟 디바이스에 전송하고, 통신 인터페이스의 제2 웨이크업 핀을 통해, 제2 웨이크업 신호를 타 겟 디바이스에 전송할 수 있다. 통신 인터페이스는 제1 웨이크업 핀, 제2 웨이크업 핀, 데이터 핀 중 적어도 하나를 포함 할 수 있다. 제1 웨이크업 핀은 타 디바이스의 스피커(또는 사운드 출력부)의 전원을 온 상태로 변경하기 위한 통신 서 브 핀을 포함할 수 있다. 제2 웨이크업 핀은 타 디바이스의 전체 전원을 온 상태로 변경하기 위한 통신 서브 핀을 포함할 수 있다. 데이터 핀은 타 디바이스에 제어 명령 또는 데이터를 전송(또는 수신)하기 위한 통신 서브 핀을 포함할 수 있다. 이와 관련된 구체적인 설명은 도 4에서 기재한다. 제1 웨이크업 핀은 제1 웨이크업 모듈로 기재될 수 있다. 제2 웨이크업 핀은 제2 웨이크업 모듈로 기 재될 수 있다. 데이터 핀은 데이터 모듈로 기재될 수 있다. 적어도 하나의 프로세서는 타겟 디바이스의 전원이 온 상태이면, 통신 인터페이스를 통해, 타겟 디바이스의 스피커에 대한 권한을 요청하는 신호를 타겟 디바이스에 전송하고, 권한을 요청하는 신호 에 대응하는 응답 신호가 수신되면, 통신 인터페이스를 통해, 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스에 전송할 수 있다. 이와 관련된 구체적인 설명은 도 8 및 도 20에서 기재한다. 전자 장치는 마이크를 더 포함하고, 적어도 하나의 프로세서는 타겟 디바이스가 사운드 플 레이를 수행하는 동안, 마이크를 통해, 오디오 데이터를 획득하고, 오디오 데이터에 기초하여 사운드 플레이와 관련된 타겟 오디오 신호 및 노이즈 오디오 신호를 구분하고, 노이즈 오디오 신호의 제1 크기가 타겟 오디오 신 호의 제2 크기 이상이면, 통신 인터페이스를 통해, 타겟 디바이스의 출력을 변경하기 위한 제2 제어 명령을 타겟 디바이스에 전송할 수 있다. 이와 관련된 구체적인 설명은 도 7 및 도 8에서 기재한다. 전자 장치는 오디오 특성 정보를 획득할 수 있다. 전자 장치는 오디오 특성 정보에 기초하여 타겟 오 디오 신호 및 노이즈 오디오 신호를 구분할 수 있다. 오디오 특성 정보는 주파수 스펙트럼, 주파수 밴드 에너지, 스펙트럼 평균, 스펙트럼 분석, 에너지 변화 정보, 진폭 변화 정보, 주기 변화 정보, 신호 대 잡음 비 (Signal-to-Noise Ratio, SNR) 중 적어도 하나를 포함할 수 있다. 전자 장치는 오디오 특성 정보에 기초 하여 오디오 데이터에 포함된 복수의 신호 중 타겟 오디오 신호 및 노이즈 신호를 구분할 수 있다. 타겟 디바이스의 전원이 온 상태이면 타겟 디바이스는 타겟 디바이스가 구동하는데 필요한 에너 지를 생성하기 위해 구동부가 제어하고 있는 상태일 수 있다. 에너지 생성 과정에서 노이즈(예를 들어, 모터 회 전 소리 또는 기계음)가 발생할 수 있다. 타겟 디바이스이 전원이 온 상태이면 노이즈로 인하여 사운드 재 생이 정상적으로 이루어지지 않을 수 있다. 타겟 디바이스의 전원이 온 상태이면, 적어도 하나의 프로세서는 타겟 디바이스의 노이즈를 측 정할 수 있다. 타겟 디바이스의 노이즈가 크다고 식별되면, 적어도 하나의 프로세서는 타겟 디바이스에 포함된 스피커의 볼륨을 증가하기 위한 제2 제어 명령을 타겟 디바이스에 전송할 수 있다. 적어도 하나의 프로세서는 통신 인터페이스를 통해, 타겟 디바이스에 포함된 스피커의 볼 륨을 증가시키기 위한 제2 제어 명령을 타겟 디바이스에 전송할 수 있다. 타겟 디바이스에 포함된 스피커의 볼륨이 증가되면, 사용자는 타겟 디바이스에서 발생하는 노이즈가 상대적으로 덜 들릴 수 있다. 볼륨은 스피커 출력 성능, 스피커 출력 크기로 기재될 수 있다. 타겟 디바이스의 노이즈가 크다고 식별되면, 적어도 하나의 프로세서는 노이즈 감소를 위한 제2 제어 명령을 타겟 디바이스에 전송할 수 있다. 적어도 하나의 프로세서는 통신 인터페이스를 통해, 타겟 디바이스에서 출력되는 노이즈를 감소 시키기 위한 제2 제어 명령을 타겟 디바이스에 전송할 수 있다. 타겟 디바이스는 복수의 모드로 동작할 수 있다. 타겟 디바이스는 일반적인 기본 기능만을 수행하는 제1 모드, 기본 기능 및 사운드 플레이를 동시에 수행 하는 제2 모드, 사운드 플레이만을 수행하는 제3 모드로 동작할 수 있다. 제1 모드 및 제2 모드로 동작하는 경우, 타겟 디바이스는 구동부 제어로 인한 노이즈가 발생할 수 있다. 구동부는 모터 제어와 관련된 하드웨어 구성을 포함할 수 있다. 타겟 디바이스가 제1 모드, 제2 모드로 동작하는 경우, 적어도 하나의 프로세서는 노이즈를 측정할 수 있다. 제3 모드로 동작하는 경우, 타겟 디바이스는 타겟 디바이스에 포함된 스피커만을 제어할 수 있 다. 노이즈가 상대적으로 크게 발생하지 않을 수 있다. 타겟 디바이스가 제3 모드로 동작하는 경우, 적어도 하나의 프로세서는 노이즈를 측정하지 않을 수 있다. 사운드 플레이를 수행하는 경우, 타겟 디바이스는 제2 모드 내지 제3 모드로 동작할 수 있다. 제2 모드로 동작하는 경우, 적어도 하나의 프로세서는 타겟 디바이스의 노이즈를 측정할 수 있다. 일 실시 예에 따라, 노이즈 오디오 신호의 제1 크기가 타겟 오디오 신호의 제2 크기 이상이면, 적어도 하나의 프로세서는 타겟 디바이스가 제2 모드에서 제3 모드로 변경하기 위한 제2 제어 명령을 타겟 디바이스 에 전송할 수 있다. 일 실시 예에 따라, 노이즈 오디오 신호의 제1 크기가 타겟 오디오 신호의 제2 크기 이상이면, 적어도 하나의 프로세서는 제2 모드의 성능을 감소시키기 위한 제2 제어 명령을 타겟 디바이스에 전송할 수 있다. 제2 모드의 성능을 감소시키기 위한 제2 제어 명령은 출력 성능을 낮추는 명령을 포함할 수 있다. 예를 들어, 제2 제어 명령은 바람의 세기를 줄이는 명령, 에어컨의 설정 온도를 낮추는 명령, 실시간 센싱 동작을 멈추는 명령, 자동 분석 기능을 멈추는 명령 중 적어도 하나를 포함할 수 있다. 제2 제어 명령에 따라 타겟 디바이스 는 성능을 낮추는 제어 동작을 수행할 수 있고, 발생되는 노이즈가 감소할 수 있다. 도 3은 일 실시 예에 따라, 도 2의 전자 장치의 구체적인 구성을 설명하기 위한 블록도이다. 도 3를 참조하면, 전자 장치는 메모리, 적어도 하나의 프로세서, 통신 인터페이스, 디스플 레이, 조작 인터페이스, 입출력 인터페이스, 스피커, 마이크, 카메라 중 적어도 하나를 포함할 수 있다. 메모리는 적어도 하나의 프로세서에 포함된 롬(ROM)(예를 들어, EEPROM(electrically erasable programmable read-only memory)), 램(RAM) 등의 내부 메모리로 구현되거나, 적어도 하나의 프로세서와 별도의 메모리로 구현될 수도 있다. 메모리는 데이터 저장 용도에 따라 전자 장치에 임베디드된 메모 리 형태로 구현되거나, 전자 장치에 탈부착이 가능한 메모리 형태로 구현될 수도 있다. 예를 들어, 전자 장치의 구동을 위한 데이터의 경우 전자 장치에 임베디드된 메모리에 저장되고, 전자 장치의 확 장 기능을 위한 데이터의 경우 전자 장치에 탈부착이 가능한 메모리에 저장될 수 있다. 전자 장치에 임베디드된 메모리의 경우 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나로 구현되고, 전자 장 치에 탈부착이 가능한 메모리의 경우 메모리 카드(예를 들어, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 등), USB 포트에 연결 가능한 외부 메모리(예를 들어, USB 메모리) 등과 같은 형태로 구현될 수 있다. 메모리는 적어도 하나의 인스트럭션(instruction)을 저장할 수 있다. 메모리에 저장된 인스트럭션에 기초하여 적어도 하나의 프로세서는 다양한 동작을 수행할 수 있다. 적어도 하나의 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), GPU(graphics- processing unit) 또는 커뮤니케이션 프로세서(communication processor(CP)), ARM(advanced reduced instruction set computer (RISC) machines) 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의 될 수 있다. 적어도 하나의 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 적 어도 하나의 프로세서는 메모리에 저장된 컴퓨터 실행가능 명령어(computer executable instructions)를 실행함으로써 다양한 기능을 수행할 수 있다. 통신 인터페이스는 다양한 유형의 통신 방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성이다. 통신 인터페이스는 무선 통신 모듈 또는 유선 통신 모듈을 포함할 수 있다. 각 통신 모듈은 적 어도 하나의 하드웨어 칩 형태로 구현될 수 있다. 무선 통신 모듈은 무선으로 외부 장치와 통신하는 모듈일 수 있다. 예를 들어, 무선 통신 모듈은 와이파이 모듈, 블루투스 모듈, 적외선 통신 모듈 또는 기타 통신 모듈 중 적어도 하나의 모듈을 포함할 수 있다. 와이파이 모듈, 블루투스 모듈은 각각 와이파이 방식, 블루투스 방식으로 통신을 수행할 수 있다. 와이파이 모 듈이나 블루투스 모듈을 이용하는 경우에는 SSID(service set identifier) 및 세션 키 등과 같은 각종 연결 정 보를 먼저 송수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 적외선 통신 모듈은 가시 광선과 밀리미터파 사이에 있는 적외선을 이용하여 근거리에 무선으로 데이터를 전송 하는 적외선 통신(IrDA, infrared Data Association)기술에 따라 통신을 수행한다. 기타 통신 모듈은 상술한 통신 방식 이외에 지그비(zigbee), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE-A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 통신을 수행하는 적어도 하나의 통신 칩을 포함할 수 있다. 유선 통신 모듈은 유선으로 외부 장치와 통신하는 모듈일 수 있다. 예를 들어, 유선 통신 모듈은 LAN(Local Area Network) 모듈, 이더넷 모듈, 페어 케이블, 동축 케이블, 광섬유 케이블 또는 UWB(Ultra Wide-Band) 모듈 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따라, 통신 인터페이스는 원격 제어 장치와 같은 외부 장치 및 외부 서버와 통신하기 위 해 동일한 통신 모듈(예를 들어, 와이파이 모듈)을 이용할 수 있다. 다양한 실시 예에 따라, 통신 인터페이스는 원격 제어 장치와 같은 외부 장치 및 외부 서버와 통신하기 위 해 상이한 통신 모듈을 이용할 수 있다. 예를 들어, 통신 인터페이스는 외부 서버와 통신하기 위해 이더넷 모듈 또는 와이파이 모듈 중 적어도 하나를 이용할 수 있고, 원격 제어 장치와 같은 외부 장치와 통신하기 위해 블루투스 모듈을 이용할 수도 있다. 다만 이는 일 실시 예에 불과하며 통신 인터페이스는 복수의 외부 장 치 또는 외부 서버와 통신하는 경우 다양한 통신 모듈 중 적어도 하나의 통신 모듈을 이용할 수 있다. 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플레이, PDP(Plasma Display Panel) 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 디스플레이내에는 a- si TFT(amorphous silicon thin film transistor), LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 디스플레이 는 터치 센서와 결합된 터치 스크린, 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display, three-dimensional dispaly) 등으로 구현될 수 있다. 본 개시의 일 실시 예에 따른, 디스플레이는 이미지 를 출력하는 디스플레이 패널뿐만 아니라, 디스플레이 패널을 하우징하는 베젤을 포함할 수 있다. 특히, 본 개 시의 일 실시 예에 따른, 베젤은 사용자 인터렉션을 감지하기 위한 터치 센서를 포함할 수 있다. 조작 인터페이스는 버튼, 터치 패드, 마우스 및 키보드와 같은 장치로 구현되거나, 상술한 디스플레이 기 능 및 조작 입력 기능도 함께 수행 가능한 터치 스크린으로도 구현될 수 있다. 버튼은 전자 장치의 본체 외관의 전면부나 측면부, 배면부 등의 임의의 영역에 형성된 기계적 버튼, 터치 패드, 휠 등과 같은 다양한 유 형의 버튼이 될 수 있다. 입출력 인터페이스는 HDMI(High Definition Multimedia Interface), MHL (Mobile High-Definition Link), USB (Universal Serial Bus), DP(Display Port), 썬더볼트(Thunderbolt), VGA(Video Graphics Array) 포트, RGB 포트, D-SUB(D-subminiature), DVI(Digital Visual Interface) 중 어느 하나의 인터페이스일 수 있 다. 입출력 인터페이스는 오디오 및 비디오 신호 중 적어도 하나를 입출력 할 수 있다. 구현 예에 따라, 입출력 인터페이스는 오디오 신호만을 입출력하는 포트와 비디오 신호만을 입출력하는 포트를 별개의 포트 로 포함하거나, 오디오 신호 및 비디오 신호를 모두 입출력하는 하나의 포트로 구현될 수 있다. 전자 장치(10 0)는 입출력 인터페이스를 통해 오디오 및 비디오 신호 중 적어도 하나를 외부 장치(예를 들어, 외부 디스 플레이 장치 또는 외부 스피커)에 전송할 수 있다. 입출력 인터페이스에 포함된 출력 포트가 외부 장치와 연결될 수 있으며, 전자 장치는 오디오 및 비디오 신호 중 적어도 하나를 출력 포트를 통해 외부 장치에 전송할 수 있다. 입출력 인터페이스는 통신 인터페이스와 연결될 수 있다. 입출력 인터페이스는 외부 기기로부터 수신 되는 정보를 통신 인터페이스에 전송하거나 통신 인터페이스를 통해 수신되는 정보를 외부 기기에 전송할 수 있 다. 스피커는 각종 오디오 데이터 뿐만 아니라 각종 알림 음이나 음성 메시지 등을 출력하는 구성요소일 수 있 다. 마이크는 사용자 음성이나 기타 소리를 입력 받아 오디오 데이터로 변환하기 위한 구성이다. 마이크 는 활성화 상태에서 사용자의 음성을 수신할 수 있다. 예를 들어, 마이크는 전자 장치의 상측이나 전 면 방향, 측면 방향 등에 일체형으로 형성될 수 있다. 마이크는 아날로그 형태의 사용자 음성을 수집하는 마이크, 수집된 사용자 음성을 증폭하는 앰프 회로, 증폭된 사용자 음성을 샘플링하여 디지털 신호로 변환하는 A/D 변환회로, 변환된 디지털 신호로부터 노이즈 성분을 제거하는 필터 회로 등과 같은 다양한 구성을 포함할 수 있다. 카메라는 피사체를 촬상하여 촬상 영상을 생성하기 위한 구성이며, 촬상 영상은 동영상과 정지 영상 모두 를 포함하는 개념이다. 카메라는 적어도 하나의 외부 기기에 대한 이미지를 획득할 수 있으며, 카메라, 렌 즈, 적외선 센서 등으로 구현될 수 있다. 카메라는 렌즈와 이미지 센서를 포함할 수 있다. 렌즈의 종류에는 일반적인 범용 렌즈, 광각 렌즈, 줌 렌 즈 등이 있으며, 전자 장치의 종류, 특성, 사용 환경 등에 따라 결정될 수 있다. 이미지 센서로는 상보성 금속 산화물 반도체(Complementary Metal Oxide Semiconductor: CMOS)와 전하결합소자(Charge Coupled Device: CCD) 등이 사용될 수 있다. 도 4는 일 실시 예에 따라, 메인 디바이스와 서브 디바이스를 설명하기 위한 도면이다. 도 4를 참조하면, 메인 디바이스가 전자 장치이고 서브 디바이스가 타겟 디바이스인 것으로 가정한다. 전자 장치는 적어도 하나의 프로세서, 통신 인터페이스 중 적어도 하나를 포함할 수 있다. 통신 인터페이스는 제1 웨이크업 핀, 제2 웨이크업 핀, 데이터 핀 중 적어도 하나를 포함 할 수 있다. 제1 웨이크업 핀은 타 디바이스에 포함된 복수의 하드웨어 구성 중 특정 하드웨어 구성의 전원을 제어하기 위한 핀일 수 있다. 예를 들어, 제1 웨이크업 핀은 타겟 디바이스에 포함된 스피커의 전원을 제 어하기 위한 핀일 수 있다. 제2 웨이크업 핀은 타 디바이스의 전원을 제어하기 위한 핀일 수 있다. 예를 들어, 제2 웨이크업 핀 은 타겟 디바이스의 전원을 제어하기 위한 핀일 수 있다. 데이터 핀은 제어 명령 또는 제어 명령에 대응되는 데이터(또는 신호)의 흐름을 제어하기 위한 핀일 수 있 다. 데이터 핀은 전송 핀(TX) 또는 수신 핀(RX) 중 적어도 하나를 포함할 수 있다. 타겟 디바이스는 적어도 하나의 프로세서, 통신 인터페이스, 기타 출력부, 스피커 중 적어도 하나를 포함할 수 있다. 통신 인터페이스는 제1 웨이크업 핀, 제2 웨이크업 핀, 데이터 핀 중 적어도 하나를 포함 할 수 있다. 제1 웨이크업 핀은 타 디바이스에 포함된 복수의 하드웨어 구성 중 특정 하드웨어 구성의 전원을 제어하기 위한 핀일 수 있다. 예를 들어, 제1 웨이크업 핀은 타겟 디바이스에 포함된 스피커의 전원을 제 어하기 위한 핀일 수 있다. 제2 웨이크업 핀은 타 디바이스의 전원을 제어하기 위한 핀일 수 있다. 예를 들어, 제2 웨이크업 핀 은 타겟 디바이스의 전원을 제어하기 위한 핀일 수 있다. 데이터 핀은 제어 명령 또는 제어 명령에 대응되는 데이터(또는 신호)의 흐름을 제어하기 위한 핀일 수 있 다. 데이터 핀은 전송 핀(TX) 또는 수신 핀(RX) 중 적어도 하나를 포함할 수 있다. 전자 장치는 제1 웨이크업 핀을 이용하여 제1 웨이크업 신호를 타겟 디바이스에 전송할 수 있다. 타겟 디바이스는 제1 웨이크업 핀을 이용하여 전자 장치의 제1 웨이크업 신호를 수신할 수 있다. 제1 웨이크업 신호를 수신하면, 타겟 디바이스는 스피커의 전원을 온 상태 로 제어할 수 있 다. 스피커의 전원이 오프 상태에서 제1 웨이크업 신호가 수신되면, 타겟 디바이스는 스피커의 전원을 온 상태로 변경할 수 있다. 전자 장치는 제2 웨이크업 핀을 이용하여 제2 웨이크업 신호를 타겟 디바이스에 전송할 수 있다. 타겟 디바이스는 제2 웨이크업 핀을 이용하여 전자 장치의 제2 웨이크업 신호를 수신할 수 있다. 제2 웨이크업 신호를 수신하면, 타겟 디바이스는 전체 전원을 온 상태 로 제어할 수 있다. 전원 이 오프 상태에서 제2 웨이크업 신호가 수신되면, 타겟 디바이스는 전체 전원을 온 상태로 변경할 수 있다. 전자 장치는 데이터 핀을 이용하여 제어 명령 또는 데이터 중 적어도 하나를 타겟 디바이스에 전송할 수 있다. 타겟 디바이스는 데이터 핀을 이용하여 전자 장치에서 전송한 제어 명령 또는 데이터 중 적어도 하나를 수신할 수 있다. 타겟 디바이스의 전체 전원이 온 상태인 상황에서 제어 명령이 수신되면, 타겟 디바이스는 제어 명령 에 기초하여 기타 출력부 및 스피커 중 적어도 하나를 제어할 수 있다. 타겟 디바이스의 스피커의 전원이 온 상태인 상황에서 제어 명령이 수신되면, 타겟 디바이스는 제어 명령에 기초하여 스피커만을 제어할 수 있다. 도 5는 일 실시 예에 따라, 전원 상태 정보에 기초하여 타겟 디바이스를 제어하는 동작을 설명하기 위한 도면이다. 전자 장치는 사운드 플레이를 위한 사용자 입력을 수신할 수 있다 (S510). 사운드 플레이는 그룹 사운드 플레이로 기재될 수 있다. 사운드 플레이는 그룹 제어 명령에 포함될 수 있다. 그룹 제어 명령은 네트워크에 포 함된 복수의 장치 중 그룹으로 제어하는 명령을 포함할 수 있다. 그룹은 적어도 하나의 장치를 포함할 수 있다. 기 설정된 조건(또는 기준)으로 구분된 그룹이 그룹 제어 명령에 기초하여 제어될 수 있다. 전자 장치는 사운드 플레이를 수행할 수 있는 타겟 디바이스를 식별할 수 있다 (S520). 전자 장치 는 사용자 입력에 기초하여 타겟 디바이스를 식별할 수 있다. 전자 장치는 사용자 입력을 분석 하여 제어 명령을 수행하는데 필요한 기능을 식별할 수 있다. 전자 장치는 식별된 기능을 수행할 수 있는 타겟 디바이스를 식별할 수 있다. 예를 들어, 식별된 기능이 음악 재생이면, 전자 장치는 음악 재생이 가능한 타겟 디바이스를 식별할 수 있다. 전자 장치는 음악 재생을 위한 스피커가 포함되어 있는 타겟 디바이스를 식별할 수 있다. 전자 장치는 식별된 타겟 디바이스의 전원 상태 정보를 획득할 수 있다 (S530). 전자 장치는 타 겟 디바이스에 전원 상태 정보를 요청할 수 있다. 전자 장치는 타겟 디바이스의 전원 상태를 요 청하는 신호를 전송할 수 있다. 타겟 디바이스는 전자 장치의 요청에 응답하여 전원 상태 정보를 전 송할 수 있다. 전자 장치는 타겟 디바이스로부터 전원 상태 정보를 수신할 수 있다. 전자 장치는 전원 상태 정보에 기초하여 사운드 플레이를 위한 제1 제어 명령을 생성할 수 있다 (S540). 전자 장치는 제1 제어 명령을 타겟 디바이스에 전송할 수 있다 (S550). 제1 제어 명령은 타겟 디바이스 에서 사운드 플레이를 위한 제어 동작과 관련된 명령어 및/또는 사운드 플레이에 대응하는 데이터(예를 들 어, 음악 데이터)를 포함할 수 있다. 도 6은 일 실시 예에 따라, 네트워크에 포함된 디바이스들의 메타 데이터를 설명하기 위한 도면이다. 도 6을 참조하면, 전자 장치는 네트워크에 포함된 복수의 장치들에 대한 메타 데이터를 포함할 수 있다. 메타 데이터는 복수의 장치들의 성능 또는 기능을 나타내는 정보를 포함할 수 있다. 메타 데이터 는 스피커의 포함 여부 또는 이동 부재의 포함 여부 중 적어도 하나를 포함할 수 있다. 전자 장치는 메타 데이터에 포함된 정보를 이용하여 특정 하드웨어를 포함하는 디바이스를 식별할 수 있다. 전자 장치는 메타 데이터에 포함된 정보를 이용하여 특정 기능을 수행할 수 있는 디바이스를 식별할 수 있다. 도 7은 일 실시 예에 따라, 타겟 디바이스의 전원 상태에 따라 상이한 제어 동작을 설명하기 위한 도면이 다. 도 7을 참조하면, 전자 장치는 식별된 타겟 디바이스의 전원 상태 정보를 획득할 수 있다 (S705). S705 단계는 도5의 S530 단계에 대응될 수 있다. 타겟 디바이스의 전원이 온(ON) 상태가 아니면 (S710-N), 전자 장치는 타겟 디바이스의 스피커 의 전원을 온 상태로 변경하기 위한 제1 웨이크업 신호를 생성할 수 있다 (S715). 전자 장치는 제1 웨이크업 신호를 타겟 디바이스에 전송할 수 있다 (S720). 전자 장치는 통신 인터페이스에 포함된 제1 웨이크업 핀을 통해 제1 웨이크업 신호를 타겟 디바이스에 전송할 수 있다. 전자 장치는 타겟 디바이스로부터 웨이크업 응답 신호를 수신할 수 있다. 웨이크업 응답 신호는 제1 웨이크업 신호에 기초하여 타겟 디바이스에 포함된 스피커의 전원이 온 상태로 변경되었음을 알리는 정보를 포함할 수 있다. 웨이크업 응답 신호가 수신되면, 전자 장치는 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스 에 전송할 수 있다 (S725). 전자 장치는 통신 인터페이스의 데이터 핀을 통해 제1 제어 명령을타겟 디바이스에 전송할 수 있다. 타겟 디바이스의 전원이 온(ON) 상태이면 (S710-Y), 전자 장치는 타겟 디바이스에 포함된 스피 커를 이용하기 위한 권한 요청 신호를 생성할 수 있다 (S730). 전자 장치는 권한 요청 신호를 타겟 디바이스에 전송할 수 있다 (S735). 전자 장치는 통신 인터 페이스에 포함된 데이터 핀을 이용하여 권한 요청 신호를 타겟 디바이스에 전송할 수 있다. 전자 장치는 타겟 디바이스로부터 권한 응답 신호를 수신할 수 있다. 권한 응답 신호는 권한 요청 신 호에 기초하여 타겟 디바이스에 포함된 스피커를 제어할 수 있는 권한을 부여함을 나타내는 정보를 포함할 수 있다. 권한 응답 신호가 수신되면, 전자 장치는 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스에 전 송할 수 있다 (S740). 전자 장치는 통신 인터페이스의 데이터 핀을 통해 제1 제어 명령을 타겟 디바이스에 전송할 수 있다. 도 8은 일 실시 예에 따라, 타겟 디바이스의 전원이 온 상태인 경우 수행되는 동작을 설명하기 위한 도면 이다. 도 8을 참조하면, 전자 장치는 권한 요청 신호를 타겟 디바이스에 전송할 수 있다 (S805). S805 단계 는 도 7의 S730, S735 단계에 대응될 수 있다. 전자 장치는 타겟 디바이스로부터 권한 응답 신호가 수신되었는지 여부를 판단할 수 있다 (S810). 권한 응답 신호가 수신되면 (S810-Y), 전자 장치는 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스 에 전송할 수 있다 (S815). 전자 장치는 타겟 디바이스에 출력된 오디오 데이터를 획득할 수 있다 (S820). 전자 장치는 마 이크를 통해 주변 환경에서 출력되는 오디오 신호를 녹음할 수 있다. 전자 장치는 마이크를 통 해 주변 환경에서 출력되는 오디오 신호를 포함하는 오디오 데이터를 획득할 수 있다. 전자 장치는 오디오 데이터에서 타겟 오디오 신호와 노이즈 오디오 신호를 구분(또는 분류 또는 식별)할 수 있다 (S825). 타겟 오디오 신호는 사용자가 듣기를 원하는 대상을 나타낼 수 있다. 예를 들어, 타겟 오디오 신호는 음악 오디오 신호를 포함할 수 있다. 전자 장치는 오디오 특성 정보를 획득할 수 있다. 전자 장치는 오디오 특성 정보에 기초하여 타겟 오 디오 신호 및 노이즈 오디오 신호를 구분할 수 있다. 오디오 특성 정보는 주파수 스펙트럼, 주파수 밴드 에너지, 스펙트럼 평균, 스펙트럼 분석, 에너지 변화 정보, 진폭 변화 정보, 주기 변화 정보, 신호 대 잡음 비 (Signal-to-Noise Ratio, SNR) 중 적어도 하나를 포함할 수 있다. 전자 장치는 오디오 특성 정보에 기초 하여 오디오 데이터에 포함된 복수의 신호 중 타겟 오디오 신호 및 노이즈 신호를 구분할 수 있다. 전자 장치는 타겟 오디오 신호의 크기를 획득할 수 있다. 전자 장치는 기 설정된 시간 동안 타겟 오 디오 신호의 평균 크기를 획득할 수 있다. 전자 장치는 노이즈 오디오 신호의 크기를 획득할 수 있다. 전자 장치는 기 설정된 시간 동안 노이즈 오디오 신호의 평균 크기를 획득할 수 있다. 크기는 크기값, 진폭값, 크기 정보 등으로 기재될 수 있다. 전자 장치는 노이즈 오디오 신호의 크기가 타겟 오디오 신호의 크기 이상인지 여부를 판단할 수 있다 (S830). 노이즈 오디오 신호의 크기가 타겟 오디오 신호의 크기 이상이 아니면 (S830-N), 전자 장치는 S815, S820, S825, S830 단계를 수행할 수 있다. 기 설정된 시간이 경과한 이후에도 노이즈 오디오 신호의 크기가 타겟 오디 오 신호의 크기 이상이 아니면, 전자 장치는 오디오 데이터를 더 이상 획득하지 않을 수 있다. 노이즈 오디오 신호의 크기가 타겟 오디오 신호의 크기 이상이면 (S830-Y), 전자 장치는 타겟 디바이스 의 출력을 제어하기 위한 제2 제어 명령을 생성할 수 있다 (S835). 전자 장치는 타겟 디바이스 에 제2 제어 명령을 전송할 수 있다. 전자 장치는 통신 인터페이스의 데이터 핀을 통해 제2 제 어 명령을 타겟 디바이스에 전송할 수 있다.일 실시 예에 따라, 전자 장치는 타겟 디바이스에 포함된 스피커의 출력을 제어할 수 있다. 전 자 장치는 스피커의 볼륨을 변경하기 위한 제2 제어 명령을 생성할 수 있다. 노이즈 신호가 크다고 판단되면, 전자 장치는 타겟 디바이스에 포함된 스피커의 볼륨을 증가시키기 위한 제2 제어 명 령을 생성할 수 있다. 일 실시 예에 따라, 전자 장치는 타겟 디바이스의 구동부의 출력을 제어할 수 있다. 전자 장치 는 타겟 디바이스의 구동부(예를 들어, 모터)의 성능을 낮추기 위한 제2 제어 명령을 생성할 수 있다. 전 자 장치는 타겟 디바이스의 구동부가 더 작은 노이즈(예를 들어, 모터 회전음)를 출력하기 위한 제2 제어 명령을 생성할 수 있다. 예를 들어, 전자 장치는 타겟 디바이스가 일반 모드에서 절전 모드로 변경하기 위한 제2 제어 명령을 생성할 수 있다. 전자 장치는 타겟 디바이스가 고성능 모드에서 일반 모드(또는 절전 모드)로 변경하기 위한 제2 제어 명령을 생성할 수 있다. 도 9는 일 실시 예에 따라, 타겟 디바이스의 전원이 온 상태인 경우 수행되는 동작을 설명하기 위한 도면 이다. 도 9의 S905, S910, S915, S920, S925, S935, S940 단계는 도 8의 S805, S810, S815, S820, S825, S835, S840 단계에 대응될 수 있다. 중복 설명을 생략한다. 전자 장치는 주변 환경에서 출력된 오디오 신호를 포함하는 오디오 데이터를 획득할 수 있다. 전자 장치 는 오디오 데이터에서 노이즈 오디오 신호를 추출할 수 있다. 전자 장치는 노이즈 오디오 신호의 크 기를 획득할 수 있다. 전자 장치는 기 설정된 시간 동안의 노이즈 오디오 신호의 평균 크기를 획득할 수 있다. 전자 장치는 노이즈 오디오 신호의 크기가 임계값 이상인지 여부를 판단할 수 있다 (S930). 임계값은 사용 자의 설정에 따라 변경될 수 있다. 노이즈 오디오 신호의 크기가 임계값 이상이 아니면 (S930-N), 전자 장치는 S915, S920, S925, S930 단계 를 수행할 수 있다. 기 설정된 시간이 경과한 이후에도 노이즈 오디오 신호의 크기가 임계값 이상이 아니면, 전 자 장치는 오디오 데이터를 더 이상 획득하지 않을 수 있다. 노이즈 오디오 신호의 크기가 임계값 이상이면 (S930-Y), 전자 장치는 S935, S940 단계를 수행할 수 있다. 도 10은 일 실시 예에 따라, 타겟 디바이스의 출력을 제어하기 위한 가이드 화면을 설명하기 위한 도면이 다. 도 10을 참조하면, 도 8 및 도9의 실시 예에서 제2 제어 명령을 생성하기 전에 전자 장치는 가이드 화면 을 제공(또는 출력 또는 표시)할 수 있다. 노이즈 오디오 신호의 크기가 타겟 오디오 신호의 크기 이상이면 (S830-Y), 전자 장치는 가이드 화면 을 제공할 수 있다. 노이즈 오디오 신호의 크기가 임계값 이상이면 (S930-Y), 전자 장치는 가이드 화면을 제공할 수 있 다. 가이드 화면은 특정 서브 디바이스(예를 들어, 타겟 디바이스)의 노이즈 크기가 크다는 것을 알리기 위한 UI, 제어 동작을 가이드하기 위한 UI 중 적어도 하나를 포함할 수 있다. UI는 타겟 디바이스에서 발생하는 노이즈를 감소시키기 위한 동작, 타겟 디바이스에서 출력하 는 사운드의 크기를 증가시키기 위한 동작, 현재 상태를 유지하기 위한 동작 중 적어도 하나를 포함할 수 있다. UI를 통해 사용자 입력이 수신되면, 전자 장치는 사용자 입력에 기초하여 제2 제어 명령을 생성할 수 있다. 도 11은 일 실시 예에 따라, 타겟 디바이스의 전원이 오프 상태인 경우 수행되는 동작 설명하기 위한 도면 이다. 도 11을 참조하면, 전자 장치는 제1 웨이크업 신호를 타겟 디바이스에 전송할 수 있다 (S1105). S1105 단계는 도 7의 S715 단계에 대응될 수 있다. 전자 장치는 타겟 디바이스로부터 웨이크업 응답 신호를 수신하였는지 여부를 판단할 수 있다 (S1110). 전자 장치는 웨이크업 응답 신호의 수신 여부에 따라 타겟 디바이스에 포함된 스피커 의 전원 상태가 온 상태로 변경되었는지 여부를 식별할 수 있다. 웨이크업 응답 신호가 수신되면, 전자 장치는 타겟 디바이스에 포함된 스피커의 전원이 온 상태 가 되었음을 인식할 수 있다. 웨이크업 응답 신호가 기 설정된 시간 동안 수신되지 않으면, 전자 장치는 타겟 디바이스에 포함된 스피커의 전원이 여전히 오프 상태인 것으로 인식할 수 있다. 웨이크업 응답 신호가 수신되면 (S1110-Y), 전자 장치는 사운드 플레이를 위한 제1 제어 명령을 타겟 디바 이스에 전송할 수 있다 (S1135). 웨이크업 응답 신호를 수신하지 않으면 (S1110-N), 전자 장치는 타겟 디바이스의 전원을 온 상태로 변경하기 위한 제2 웨이크업 신호를 생성할 수 있다 (S1115). 타겟 디바이스에 포함된 스피커의 전원 이 온 상태로 변경되지 않는 경우, 전자 장치는 타겟 디바이스의 전체 전원을 온 상태로 변경할 것을 시도할 수 있다. 디바이스 종류에 따라 스피커의 전원만을 개별적으로 온 상태로 변경하는 것이 불가능할 수 있 기 때문이다. 전자 장치는 제2 웨이크업 신호를 타겟 디바이스에 전송할 수 있다 (S1120). 전자 장치는 통신 인터페이스의 제2 웨이크업 핀을 통해 제2 웨이크업 신호를 타겟 디바이스에 전송할 수 있다. 전자 장치는 타겟 디바이스로부터 웨이크업 응답 신호를 수신하였는지 여부를 판단할 수 있다 (S1125). 전자 장치는 제2 웨이크업 신호에 대한 웨이크업 응답 신호를 수신할 수 있다. 전자 장치는 웨이크업 응답 신호의 수신 여부에 따라 타겟 디바이스의 전원 상태가 온 상태로 변경되 었는지 여부를 식별할 수 있다. 웨이크업 응답 신호가 수신되면, 전자 장치는 타겟 디바이스의 전원이 온 상태가 되었음을 인식할 수 있다. 웨이크업 응답 신호가 기 설정된 시간 동안 수신되지 않으면, 전자 장치는 타겟 디바이스의 전원이 여전히 오프 상태인 것으로 인식할 수 있다. 웨이크업 응답 신호가 수신되면 (S1125-Y), 전자 장치는 사운드 플레이를 위한 제1 제어 명령을 타겟 디바 이스에 전송할 수 있다 (S1135). 웨이크업 응답 신호가 수신되지 않으면 (S1125-N), 전자 장치는 타겟 디바이스에서 사운드 플레이가 불가능함을 나타내는 가이드 화면을 제공할 수 있다 (S1130). 가이드 화면과 관련된 설명은 도 12에서 기재한다. S1110 단계의 웨이크업 응답 신호는 제1 웨이크업 응답 신호로 기재될 수 있다. S1125 단계의 웨이크업 응답 신 호는 제2 웨이크업 응답 신호로 기재될 수 있다. 도 12는 일 실시 예에 따라, 타겟 디바이스의 전원을 제어하기 위한 가이드 화면을 설명하기 위한 도면이 다. 도 12를 참조하면, 전자 장치는 기 설정된 이벤트에 기초하여 가이드 화면을 제공(또는 출력 또는 표시)할 수 있다. 기 설정된 이벤트는 타겟 디바이스에 포함된 스피커의 전원 및 타겟 디바이스의 전원이 온 상태 로 변경되지 않음을 인식하는 이벤트를 포함할 수 있다. 가이드 화면은 사용자 명령(예를 들어, 사운드 플레이)이 특정 디바이스에서 수행될 수 없음을 나타내는 UI, 사용자 명령이 특정 디바이스에 수행될 수 없는 이유를 나타내는 UI, 가이드 동작을 나타내는 UI 중 적어도 하나를 포함할 수 있다. UI는 사용자가 직접 특정 디바이스의 전원을 온 상태로 변경할 것을 요청하는 정보를 포함할 수 있다. 도 13은 일 실시 예에 따라, 타겟 디바이스와 관련된 알림을 제공하는 동작을 설명하기 위한 도면이다. 도 13을 참조하면, 타겟 디바이스는 제1 제어 명령에 따라 사운드 플레이를 출력(또는 재생)하고 있음을 가정한다. 타겟 디바이스는 스피커를 통해 사운드 플레이를 재생할 수 있다. 타겟 디바이스는기본 기능이 아닌 외부 디바이스에 해당하는 전자 장치로부터 수신된 제1 제어 명령에 따라 스피커를 이용할 수 있다. 스피커를 통해 제1 제어 명령에 대응되는 사운드 플레이를 출력하는 중, 타겟 디바이스는 기 설정된 이벤트의 발생을 인식할 수 있다. 기 설정된 이벤트는 타겟 디바이스에서 수행하는 기본 기능에 대한 알림 이벤트를 포함할 수 있다. 알림 이벤트는 타겟 디바이스의 주요 기능의 시작을 나타내는 알림, 주요 기능의 종료를 나타내는 알림, 에러가 발생한 이벤트, 경고를 위한 이벤트, 주요 기능의 변경을 나타내는 알림 중 적어도 하나를 포함할 수 있다. 제1 제어 명령에 따라 사운드 플레이를 출력하지 않는 상황에서 기 설정된 이벤트가 발생하였다면, 타겟 디바이 스는 타겟 디바이스에 포함된 스피커를 통해 알림을 제공할 수 있다. 제1 제어 명령에 따라 사운드 플레이를 출력하는 상황에서 기 설정된 이벤트가 발생하였다면, 타겟 디바이스 는 타겟 디바이스에 포함된 스피커를 이용하기 어려울 수 있다. 스피커가 이미 사용 중이 기 때문이다. 제1 제어 명령에 따라 사운드 플레이를 출력하는 상황에서 기 설정된 이벤트가 발생하였다면, 타겟 디바이스 는 이벤트와 관련된 정보를 전자 장치에 전송할 수 있다. 이벤트와 관련된 정보는 이벤트 발생 사실을 나타내는 알림 정보와 이벤트 내용을 나타내는 이벤트 정보 중 적 어도 하나를 포함할 수 있다. 예를 들어, 알림 정보는 타겟 디바이스에서 스피커를 통해 알림을 제공 해야 하는 이벤트가 발생하였음을 나타내는 정보를 포함할 수 있다. 이벤트 정보는 타겟 디바이스에서 제 공하는 알림이 무엇인지를 나타내는 정보를 포함할 수 있다. 이벤트 정보는 기 설정된 이벤트의 내용을 포함할 수 있다. 이벤트와 관련된 정보를 알림 정보와 이벤트 정보로 구분하여 설명하였다. 다양한 실시 예에 따라, 알림 정보와 이벤트 정보는 하나의 알림 정보로 기재될 수 있다. 타겟 디바이스에서 스피커를 통해 오디오 데이터를 이용하여 출력해야 하는 알림을, 전자 장치 는 이미지 데이터를 이용하여 알림을 제공할 수 있다. 전자 장치는 타겟 디바이스로부터 수신된 이벤트와 관련된 정보를 수신할 수 있다. 전자 장치는 이벤트와 관련된 정보에 기초하여 알림 UI(User Interface)를 생성할 수 있다. 알림 UI는 타겟 디바이스를 나타내는 식별 정보, 타겟 디바이스를 나타내는 GUI(Graphic User Interface), 알림 종류를 나타내는 정보, 알림 내용을 나타내는 정보 중 적어도 하나를 포함할 수 있다. 실시 예에 따라, 전자 장치는 타겟 디바이스에서 발생한 기 설정된 이벤트와 관련된 알림 UI를 제공(또는 출력 또는 표시)할 수 있다. 예를 들어, UI는 타겟 디바이스가 에어컨임을 나 타내는 GUI, 에어컨이 제습 모드로 작동하고 있음을 나타내는 텍스트 정보를 포함할 수 있다. 실시 예에 따라, 전자 장치는 타겟 디바이스에서 발생한 기 설정된 이벤트와 관련된 알림 UI를 제공(또는 출력 또는 표시)할 수 있다. 예를 들어, UI는 타겟 디바이스가 선풍기임을 나 타내는 GUI, 선풍기가 1시간의 타이머 기능을 작동하고 있음을 나타내는 텍스트 정보를 포함할 수 있다. 타겟 디바이스로부터 이벤트와 관련된 정보를 수신하면, 전자 장치는 알림 UI(1311, 1321)를 생성하 고, 생성된 알림 UI(1311, 1321)를 기 설정된 시간 동안 제공할 수 있다. 기 설정된 시간은 사용자의 설정에 따 라 변경될 수 있다. 도 14는 일 실시 예에 따라, 사용자의 이동에 따라 타겟 디바이스를 이동하는 동작을 설명하기 위한 도면 이다. 도 14를 참조하면, 전자 장치는 사용자의 위치를 실시간으로 판단할 수 있다. 전자 장치는 센서 부를 포함할 수 있다. 전자 장치는 센서부를 통해 사용자의 위치를 판단하기 위한 센싱 데이터를 획득 할 수 있다. 예를 들어, 센서부는 이미지 센서를 포함할 수 있다. 전자 장치는 이미지 센서를 통해 획득한 센싱 데이터 에 기초하여 사용자의 위치를 판단(또는 측정)할 수 있다. 센싱 데이터는 촬영 데이터일 수 있다. 사용자가 이동하는 이벤트를 식별하면, 전자 장치는 네트워크에 포함된 복수의 장치 중 일부 장 치를 이동할 수 있다. 전자 장치는 사용자를 추적하여, 일부 장치가 사용자의 위치로 이동하기 위한 제어 명령을 생성할 수 있다. 네트워크에 포함된 장치는 이동이 가능한 장치와 이동이 불가능한 장치로 구분될 수 있다. 전자 장치는 도 6의 메타 데이터를 이용하여 이동 가능한 장치를 식별할 수 있다. 전자 장치는 센싱 데이터에 기초하여 사용자가 임계 거리 이상 이동했는지 여부를 식별할 수 있다. 사 용자가 임계 거리 이상 이동한 경우, 전자 장치는 일부 장치(200-3)가 사용자의 이동한 위치로 이 동하기 위한 제어 명령을 생성할 수 있다. 전자 장치는 생성된 제어 명령을 일부 장치(200-3)에 전송할 수 있다. 일부 장치(200-3)는 수신된 제어 명령에 따라 이동한 사용자의 위치로 이동할 수 있다. 도 15는 일 실시 예에 따라, 사용자의 이동에 따라 타겟 디바이스를 이동하는 동작을 설명하기 위한 도면 이다. 도 15를 참조하면, 전자 장치는 센서부를 통해 센싱 데이터를 획득할 수 있다 (S1505). 일 실시 예에 따라, 센서부는 사용자의 위치를 센싱하기 위한 이미지 센서를 포함할 수 있다. 전자 장치 는 이미지 센서를 통해 촬영 이미지를 획득할 수 있다. 전자 장치는 촬영 이미지에 기초하여 사용자 의 위치를 식별할 수 있다. 일 실시 예에 따라, 전자 장치는 사용자의 실시간 위치를 나타내는 위치 정보를 외부 장치로부터 수신 할 수 있다. 위치 정보는 GPS 정보를 포함할 수 있다. 외부 장치는 사용자의 단말 장치를 포함할 수 있다. 사용자의 단말 장치는 스마트폰 또는 웨어러블 디바이스 중 적어도 하나를 포함할 수 있다. 전자 장치는 센싱 데이터에 기초하여 사용자의 위치 정보를 획득할 수 있다 (S1510). 전자 장치 는 센싱 데이터에 기초하여 사용자의 실시간 위치를 판단할 수 있다. 전자 장치는 센싱 데이터에 기초하여 사용자가 임계 거리 이상 이동하였는지 여부를 판단할 수 있다 (S1515). 임계 거리는 사용자의 설정에 따라 변경될 수 있다. 사용자가 임계 거리 이상 이동하지 않은 경우 (S1515-N), 전자 장치는 S1505, S1510, S1515 단계를 수행할 수 있다. 사용자가 임계 거리 이상 이동한 경우 (S1515-Y), 전자 장치는 사용자의 위치 정보에 기초하여 이 동 가능한 타겟 디바이스를 식별할 수 있다 (S1520). 전자 장치는 이동 가능한 타겟 디바이스를 식별하기 위해 도 6의 메타 데이터를 이용할 수 있다. 전자 장치는 타겟 디바이스를 변경된 사용자의 위치 정보에 대응되는 타겟 위치로 이동하기 위한 제3 제어 명령을 생성할 수 있다 (S1525). 타겟 위치는 현재 사용자의 위치를 나타낼 수 있다. 전자 장치는 제3 제어 명령을 타겟 디바이스로 전송할 수 있다 (S1530). 전자 장치는 통신 인터 페이스의 데이터 핀을 이용하여 제3 제어 명령을 타겟 디바이스에 전송할 수 있다. 도 16은 일 실시 예에 따라, 사용자의 이동에 따라 타겟 디바이스를 제어하는 동작을 설명하기 위한 도면 이다. 도 16의 S1605, S1610, S1615 단계는 도 15의 S1505. S1510, S1515 단계에 대응될 수 있다. 중복 설명을 생략 한다. 사용자가 임계 거리 이상 이동한 경우 (S1615-Y), 전자 장치는 사운드를 플레이를 출력하고 있는 타겟 디바이스가 이동 가능한지 여부를 식별할 수 있다 (S1620). 전자 장치는 도 6의 메타 데이터를 이용하여 사운드 플레이를 출력하고 있는 타겟 디바이스가 사용자의 현재 위치(타겟 위치)로 이동할 수 있는지 여부를 판단할 수 있다. 사운드 플레이를 출력하고 있는 타겟 디바이스는 적어도 하나의 디바이스를 포함할 수 있다. 타겟 디바이스가 이동 가능하다고 식별되면 (S1620-Y), 전자 장치는 타겟 디바이스를 변경된 사 용자의 위치 정보에 대응되는 타겟 위치로 이동하기 위한 제3 제어 명령을 생성할 수 있다 (S1625). 전자 장치 는 제3 제어 명령을 타겟 디바이스에 전송할 수 있다 (S1630). 전자 장치는 통신 인터페이스 의 데이터 핀을 이용하여 제3 제어 명령을 타겟 디바이스에 전송할 수 있다.타겟 디바이스가 이동 가능하지 않다고 식별되면 (S1620-N), 전자 장치는 변경된 사용자의 위치 정보 에 기초하여 타겟 디바이스에 포함된 스피커의 출력을 제어하기 위한 제4 제어 명령을 생성할 수 있 다 (S1635). 전자 장치는 제4 제어 명령을 타겟 디바이스에 전송할 수 있다 (S1640). 전자 장치 는 통신 인터페이스의 데이터 핀을 이용하여 제4 제어 명령을 타겟 디바이스에 전송할 수 있다. 제4 제어 명령은 타겟 디바이스에 포함된 스피커의 볼륨을 증가시키기 위한 명령을 포함할 수 있다. 도 17은 일 실시 예에 따라, 복수의 타겟 디바이스를 이용하여 채널을 구성하는 동작을 설명하기 위한 도 면이다. 도 17을 참조하면, 전자 장치는 사운드 플레이를 수행할 수 있는 제1 타겟 디바이스 및 제2 타겟 디바이스 를 식별할 수 있다 (S1705). 전자 장치는 제1 타겟 디바이스의 제1 위치 정보 및 제2 타겟 디바이스의 제2 위치 정보를 획득할 수 있다 (S1710). 일 예로, 전자 장치는 위치 정보를 획득하기 위한 통신 패킷을 전송하고, 통신 패킷에 대한 응답 신호를 분석하여 제1 타겟 디바이스 및 제2 타겟 디바이스의 위치를 판단할 수 있다. 일 예로, 전자 장치는 제1 타겟 디바이스 및 제2 타겟 디바이스 각각으로부터 디바이스의 위치 정보를 수 신할 수 있다. 전자 장치는 사운드 플레이를 다채널 출력 방식으로 제공할 수 있다. 전자 장치는 타겟 디바이스들의 위치 정보를 고려하여 채널을 설정할 수 있다. 예를 들어, 2채널의 경우 좌측(L) 채널과 우측 채널(R)이 설정될 필요성이 있다. 전자 장치는 제1 위치 정보에 기초하여 제1 타겟 디바이스를 제1 채널로 설정할 수 있다 (S1715). 예를 들 어, 제1 채널은 좌측(L) 채널일 수 있다. 전자 장치는 제2 위치 정보에 기초하여 제2 타겟 디바이스를 제2 채널로 설정할 수 있다 (S1720). 예를 들 어, 제2 채널은 우측(R) 채널일 수 있다. 전자 장치는 제1 채널에 대응하는 오디오 신호를 제1 타겟 디바이스에 전송할 수 있다 (S1725). 전자 장치 는 제2 채널에 대응하는 오디오 신호를 제2 타겟 디바이스에 전송할 수 있다 (S1730). 다양한 실시 예에 따라, 전자 장치는 제1 타겟 디바이스의 제1 위치 정보, 제2 타겟 디바이스의 제2 위치 정보 및 사용자의 위치 정보에 기초하여 채널 설정 동작을 수행할 수 있다. 전자 장치는 사용자의 위치 정보를 추가적으로 고려하여 제1 타겟 디바이스 및 제2 타겟 디바이스의 채널 출력 방식을 결정할 수 있다. 전자 장치는 제1 타겟 디바이스에 제1 채널에 대응되는 오디오 신호를 전송하고, 제2 타겟 디바이스에 제2 채널에 대응되는 오디오 신호를 전송할 수 있다. 전자 장치는 다채널 출력 방식으로 사운드 플레이를 수행 할 수 있다. 도 18은 일 실시 예에 따라, 호스트 디바이스를 이용하는 동작을 설명하기 위한 도면이다. 도 18을 참조하면, 네트워크에 포함된 복수의 장치(100, 200-1, 200-2, 200-3)는 호스트 장치에 연 결될 수 있다. 호스트 장치는 복수의 장치(100, 200-1, 200-2, 200-3) 각각과 통신할 수 있다. 복수의 장 치(100, 200-1, 200-2, 200-3)는 서브 디바이스로 기재될 수 있다. 호스트 장치는 제1 웨이크업 신호, 제2 웨이크업 신호, 제어 명령, 데이터 등을 복수의 장치(100, 200-1, 200-2, 200-3) 각각에 전송할 수 있다. 호스트 장치는 복수의 장치(100, 200-1, 200-2, 200-3) 각각으로 부터 통신 신호를 수신할 수 있다. 도 19는 일 실시 예에 따라, 전자 장치와 타겟 디바이스의 관계를 설명하기 위한 도면이다. 도 19의 S1905, S1910 단계는 도 5의 S510, S520 단계에 대응될 수 있다. 도 19의 S1925, S1930, S1935, S1950 단계는 도 7의 S710, S715, S720, S725 단계에 대응될 수 있다. 중복 설명을 생략한다. 전자 장치는 사운드 플레이를 위한 사용자 입력을 수신할 수 있다 (S1905). 전자 장치는 사운드 플레 이를 수행할 수 있는 타겟 디바이스를 식별할 수 있다 (S1910). 전자 장치는 전원 상태 정보를 타겟 디바이스에 요청할 수 있다 (S1915). 타겟 디바이스는 전자 장치로부터 전원 상태 정보를 요청하는 신호를 수신할 수 있다. 타겟 디바이스 는 전원 상태 정보를 타겟 디바이스에 전송할 수 있다 (S1920). 다양한 실시 예에 따라, 타겟 디바이스의 전원이 오프 상태인 경우, 타겟 디바이스는 전원 상태 정보 를 전자 장치에 전송하지 않을 수 있다. 전자 장치는 타겟 디바이스로부터 전원 상태 정보를 수신할 수 있다. 전자 장치는 타겟 디바이 스로부터 전원 상태 정보를 기 설정된 시간 동안 수신하지 않을 수 있다. 전자 장치는 타겟 디바이스의 전원이 온 상태인지 여부를 판단할 수 있다 (S1925). 타겟 디바이스의 전원이 온 상태인 경우 (S1925-Y), 전자 장치는 도 20에서 기재하는 동작들을 수행 할 수 있다. 예를 들어, 전자 장치 및 타겟 디바이스는 도 20의 S2055 내지 S2091 단계를 수행할 수 있다. 타겟 디바이스의 전원이 오프 상태인 경우 (S1925-N), 전자 장치는 타겟 디바이스에 포함된 스 피커의 전원을 온 상태로 변경하기 위한 제1 웨이크업 신호를 생성할 수 있다 (S1930). 전자 장치는 제1 웨이크업 신호를 타겟 디바이스에 전송할 수 있다 (S1935). 타겟 디바이스는 제1 웨이크업 신호를 전자 장치로부터 수신할 수 있다. 타겟 디바이스는 제1 웨이크업 신호에 대한 응답 신호를 전자 장치에 전송할 수 있다 (S1940). 전자 장치는 타겟 디바이스로부터 제1 웨이크업 신호에 대응되는 응답 신호를 수신할 수 있다. 응답 신호가 수신되면, 전자 장치는 사운드 플레이를 위한 제1 제어 명령을 생성할 수 있다 (S1945). 전자 장치 는 제1 제어 명령을 타겟 디바이스에 전송할 수 있다 (S1950). 타겟 디바이스는 제1 제어 명령을 수신할 수 있다. 타겟 디바이스는 제1 제어 명령에 기초하여 사운 드 플레이를 수행할 수 있다 (S1955). 타겟 디바이스는 사운드 플레이에 대응되는 오디오 신호를 스피커 를 통해 출력할 수 있다. 도 20은 일 실시 예에 따라, 전자 장치와 타겟 디바이스의 관계를 설명하기 위한 도면이다. 도 20의 S2005, S2010, S2015, S2020, S2025 단계는 도 19의 S1905, S1910, S1915, S1920, S1925 단계에 대응 될 수 있다. 도 20의 S2055, S2070 단계는 도 7의 S735, S740 단계에 대응될 수 있다. 도 20의 S2075, S2080, S2085, S2090 단계는 도 8의 S820, S830, S835, S840 단계에 대응될 수 있다. 중복 설명을 생략한다. 타겟 디바이스의 전원이 온 상태인 경우 (S2025), 전자 장치는 타겟 디바이스에 포함된 스피커 에 대한 권한 요청을 타겟 디바이스에 전송할 수 있다 (S2055). 타겟 디바이스는 전자 장치로부터 권한 요청을 수신할 수 있다. 타겟 디바이스는 권한 요청에 대한 응답으로써 권한 부여를 나타내는 신호를 전자 장치에 전송할 수 있다 (S2060). 전자 장치는 타겟 디바이스로부터 권한 부여를 나타내는 신호를 수신할 수 있다. 권한 부여를 나타내 는 신호는 권한 승인 신호로 기재될 수 있다. 권한 부여를 나타내는 신호가 수신되면, 전자 장치는 사운드 플레이를 위한 제1 제어 명령을 생성할 수 있다 (S2065). 전자 장치는 제1 제어 명령을 타겟 디바이스 에 전송할 수 있다 (S2070). 타겟 디바이스는 제1 제어 명령을 수신할 수 있다. 타겟 디바이스는 제1 제어 명령에 기초하여 사운 드 플레이를 수행할 수 있다 (S2071). 타겟 디바이스는 사운드 플레이에 대응되는 오디오 신호를 스피커 를 통해 출력할 수 있다. 타겟 디바이스에서 제1 제어 명령에 따른 사운드 플레이를 수행하는 중, 전자 장치는 타겟 디바이스 에서 출력된 오디오 신호를 포함하는 오디오 데이터를 획득할 수 있다 (S2075). 전자 장치는 오디오 데이터에 기초하여 노이즈 오디오 신호의 크기 및 타겟 오디오 신호의 크기를 획득할 수 있다. 노이즈 오디오 신호의 크기가 타겟 오디오 신호의 크기 이상이 아니면 (S2080-N), 전자 장치는 S2065, S2070, S2075, S2080 단계를 수행할 수 있다.노이즈 오디오 신호의 크기가 타겟 오디오 신호의 크기 이상이면 (S2080-Y), 전자 장치는 타겟 디바이스 의 출력을 제어하기 위한 제2 제어 명령을 생성할 수 있다 (S2085). 전자 장치는 제2 제어 명령을 타 겟 디바이스에 전송할 수 있다 (S2090). 타겟 디바이스는 제2 제어 명령을 수신할 수 있다. 타겟 디바이스는 제2 제어 명령에 기초하여 사운 드 플레이를 수행할 수 있다 (S2091). 타겟 디바이스는 제2 제어 명령에 대응되는 동작을 수행한 후, 사운 드 플레이에 대응되는 오디오 신호를 스피커를 통해 출력할 수 있다. 도 21은 일 실시 예에 따라, 전자 장치의 제어 방법을 설명하기 위한 도면이다. 도 21을 참조하면, 전자 장치의 제어 방법은 사운드 플레이를 위한 사용자 입력이 수신되면, 사운드 플레 이를 수행할 수 있는 타겟 디바이스를 식별하는 단계 (S2105), 타겟 디바이스의 전원 상태를 식별하 는 단계 (S2110), 타겟 디바이스의 전원이 오프 상태인 것으로 식별되면, 타겟 디바이스에 포함된 스 피커의 전원을 온 상태로 변경하기 위한 제1 웨이크업 신호를 타겟 디바이스에 전송하는 단계 (S2115) 및 제1 웨이크업 신호에 대응되는 제1 응답 신호가 수신되면, 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스에 전송하는 단계 (S2120)를 더 포함한다. 타겟 디바이스의 전원 상태를 식별하는 단계 (S2110)는 타겟 디바이스의 전원 상태 정보를 요청하는 신호를 타겟 디바이스에 전송하고, 타겟 디바이스의 전원 상태 정보가 수신되면, 전원 상태 정보에 기초하여 타겟 디바이스의 전원이 오프 상태인지 여부를 판단할 수 있다. 제1 웨이크업 신호를 전송하는 단계 (S2115)는 타겟 디바이스의 전원 상태 정보가 임계 시간동안 수신되지 않으면, 제1 웨이크업 신호를 타겟 디바이스에 전송할 수 있다. 제어 방법은 제1 웨이크업 신호에 대응되는 제1 응답 신호가 임계 시간 동안 수신되지 않으면, 타겟 디바이스 의 전원을 온 상태로 변경하기 위한 제2 웨이크업 신호를 타겟 디바이스에 전송하는 단계 및 제2 웨 이크업 신호에 대응되는 제2 응답 신호가 수신되면, 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스(20 0)에 전송하는 단계를 더 포함할 수 있다. 제어 방법은 제2 웨이크업 신호에 대응되는 제2 응답 신호가 임계 시간 동안 수신되지 않으면, 타겟 디바이스 의 전원 상태와 관련된 가이드 화면을 제공하는 단계를 더 포함할 수 있다. 제1 웨이크업 신호를 전송하는 단계 (S2115)는 전자 장치에 포함된 통신 인터페이스의 제1 웨이크업 핀을 통해, 제1 웨이크업 신호를 타겟 디바이스에 전송하고, 제2 웨이크업 신호를 전송하는 단계는 통신 인터페 이스의 제2 웨이크업 핀을 통해, 제2 웨이크업 신호를 타겟 디바이스에 전송할 수 있다. 제어 방법은 타겟 디바이스의 전원이 온 상태이면, 타겟 디바이스의 스피커에 대한 권한을 요청 하는 신호를 타겟 디바이스에 전송하는 단계 및 권한을 요청하는 신호에 대응하는 응답 신호가 수신되면, 사운드 플레이를 위한 제1 제어 명령을 타겟 디바이스에 전송하는 단계를 더 포함할 수 있다. 제어 방법은 타겟 디바이스가 사운드 플레이를 수행하는 동안, 전자 장치에 포함된 마이크를 통해 오 디오 데이터를 획득하는 단계, 오디오 데이터에 기초하여 사운드 플레이와 관련된 타겟 오디오 신호 및 노이즈 오디오 신호를 구분하는 단계 및 노이즈 오디오 신호의 제1 크기가 타겟 오디오 신호의 제2 크기 이상이면, 타 겟 디바이스의 출력을 변경하기 위한 제2 제어 명령을 타겟 디바이스에 전송하는 단계, 를 더 포함할 수 있다. 제2 제어 명령을 전송하는 단계는 타겟 디바이스에 포함된 스피커의 볼륨을 증가시키기 위한 제2 제 어 명령을 타겟 디바이스에 전송할 수 있다. 제2 제어 명령을 전송하는 단계는 타겟 디바이스에서 출력되는 노이즈를 감소시키기 위한 제2 제어 명령을 타겟 디바이스에 전송할 수 있다. 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 전자 장치에 설치 가능한 어플리케이션 형태로 구현될 수 있다. 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 전자 장치에 대한 소프트웨어 업그레이드, 또 는 하드웨어 업그레이드 만으로도 구현될 수 있다. 상술한 본 개시의 다양한 실시 예들은 전자 장치에 구비된 임베디드 서버, 또는 전자 장치 및 디스플 레이 장치 중 적어도 하나의 외부 서버를 통해 수행되는 것도 가능하다. 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실 시 예들에 따른 전자 장치를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또 는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일 러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비 일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 신호(signal) 를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장 매체에 반영구적 또는 임시적으로 저 장됨을 구분하지 않는다. 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로그 램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유 사하게 수행할 수 있다. 다양한 실시 예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작 들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생 략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0138945", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2023-0138945", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따라, 복수의 장치를 포함하는 네트워크를 설명하기 위한 도면이다. 도 2는 일 실시 예에 따라, 전자 장치를 도시한 블록도이다. 도 3은 일 실시 예에 따라, 도 2의 전자 장치의 구체적인 구성을 설명하기 위한 블록도이다. 도 4는 일 실시 예에 따라, 메인 디바이스와 서브 디바이스를 설명하기 위한 도면이다. 도 5는 일 실시 예에 따라, 전원 상태 정보에 기초하여 타겟 디바이스를 제어하는 동작을 설명하기 위한 도면이다. 도 6은 일 실시 예에 따라, 네트워크에 포함된 디바이스들의 메타 데이터를 설명하기 위한 도면이다. 도 7은 일 실시 예에 따라, 타겟 디바이스의 전원 상태에 따라 상이한 제어 동작을 설명하기 위한 도면이다. 도 8은 일 실시 예에 따라, 타겟 디바이스의 전원이 온 상태인 경우 수행되는 동작을 설명하기 위한 도면이다. 도 9는 일 실시 예에 따라, 타겟 디바이스의 전원이 온 상태인 경우 수행되는 동작을 설명하기 위한 도면이다. 도 10은 일 실시 예에 따라, 타겟 디바이스의 출력을 제어하기 위한 가이드 화면을 설명하기 위한 도면이다. 도 11은 일 실시 예에 따라, 타겟 디바이스의 전원이 오프 상태인 경우 수행되는 동작 설명하기 위한 도면이다. 도 12는 일 실시 예에 따라, 타겟 디바이스의 전원을 제어하기 위한 가이드 화면을 설명하기 위한 도면이다. 도 13은 일 실시 예에 따라, 타겟 디바이스와 관련된 알림을 제공하는 동작을 설명하기 위한 도면이다. 도 14는 일 실시 예에 따라, 사용자의 이동에 따라 타겟 디바이스를 이동하는 동작을 설명하기 위한 도면이다. 도 15는 일 실시 예에 따라, 사용자의 이동에 따라 타겟 디바이스를 이동하는 동작을 설명하기 위한 도면이다. 도 16은 일 실시 예에 따라, 사용자의 이동에 따라 타겟 디바이스를 제어하는 동작을 설명하기 위한 도면이다. 도 17은 일 실시 예에 따라, 복수의 타겟 디바이스를 이용하여 채널을 구성하는 동작을 설명하기 위한 도면이다. 도 18은 일 실시 예에 따라, 호스트 장치를 이용하는 동작을 설명하기 위한 도면이다. 도 19는 일 실시 예에 따라, 전자 장치와 타겟 디바이스의 관계를 설명하기 위한 도면이다. 도 20은 일 실시 예에 따라, 전자 장치와 타겟 디바이스의 관계를 설명하기 위한 도면이다. 도 21은 일 실시 예에 따라, 전자 장치의 제어 방법을 설명하기 위한 도면이다."}
