{"patent_id": "10-2023-7031812", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0146086", "출원번호": "10-2023-7031812", "발명의 명칭": "지능형 셀룰러 채널 관리", "출원인": "디쉬 와이어리스 엘.엘.씨.", "발명자": "반살, 아시시"}}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지능형 셀룰러 채널 관리(intelligent cellular channel management)를 수행하는 셀룰러 네트워크 시스템으로서,셀룰러 코어(core) 네트워크;상기 셀룰러 코어 네트워크의 일부로서 기능하는 단문 메시지 서비스 센터(SMSC: short message servicecenter);상기 셀룰러 코어 네트워크와 통신하는 셀룰러 기지국 - 상기 셀룰러 기지국(BS: base station)은 셀룰러 무선액세스 기술(RAT: cellular radio access technology)을 사용하여 사용자 장비(UE: user equipment)와 무선으로 통신하고, 상기 셀룰러 BS는,상기 UE로부터의 셀룰러 서비스 요청에 응답하여 상기 SMSC를 통해 단문 메시지 서비스(SMS: short messageservice) 메시지를 보내기 위해 상기 UE와 상기 셀룰러 네트워크 시스템의 중앙집중형 유닛(CU: centralizedunit) 사이에 물리적 셀룰러 통신 채널을 확립하도록 구성됨 -; 및상기 CU와 통신하는 셀룰러 네트워크 메시징 컨트롤러를 포함하되, 상기 셀룰러 네트워크 메시징 컨트롤러는,상기 UE의 하나 이상의 사용 특성을 분석하도록; 그리고상기 UE의 상기 분석된 하나 이상의 사용 특성에 기반하여 상기 물리적 셀룰러 통신 채널이 활성으로 유지되는시간의 지속 기간을 결정하도록; 그리고상기 셀룰러 네트워크 메시징 컨트롤러가 상기 물리적 셀룰러 통신 채널이 활성 상태로 유지되는 시간의 지속기간을 조정하기로 결정하는 것에 기반하여 상기 물리적 셀룰러 통신 채널을 활성 상태로 유지하게 하는 채널유지 명령을 상기 CU에 전송하도록 구성되고,상기 채널 유지 명령에 응답하여, 상기 물리적 셀룰러 통신 채널이 활성 상태로 유지되는, 셀룰러 네트워크 시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 물리적 셀룰러 통신 채널을 통해 상기 SMS 메시지를 전송하도록; 그리고상기 UE의 상기 하나 이상의 사용 특성을 상기 셀룰러 BS로 보내도록 구성된 UE를 더 포함하는, 셀룰러 네트워크 시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 UE는 SMS 메시징 애플리케이션이 상기 UE 상에서 열린 상태인 것을 나타내는 제1 특성을전송하도록 구성된, 셀룰러 네트워크 시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 UE는 사용자가 상기 UE 상에서 타이핑하고 있다는 것을 나타내는 제2 특성을 전송하도록구성된, 셀룰러 네트워크 시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 SMSC는 상기 UE에 의해서 상기 물리적 셀룰러 통신 채널을 통해 보내진 상기 SMS 메시지를 수신하고 상기 SMS 메시지를 목적지에 주도록 구성된, 셀룰러 네트워크 시스템.공개특허 10-2023-0146086-3-청구항 6 제1항에 있어서, 상기 물리적 셀룰러 통신 채널은 활성인 동안, 상기 셀룰러 BS와 상기 UE 사이에서의 사용 전용인 무선 자원을 포함하는, 셀룰러 네트워크 시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 채널 유지 명령은 상기 셀룰러 코어 네트워크가 채널 타이머의 지속 기간을 증가시키게하고, 상기 채널 타이머가 만료되면, 상기 물리적 셀룰러 통신 채널은 유휴 상태로 설정되는, 셀룰러 네트워크시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 셀룰러 코어 네트워크는 상기 채널 유지 명령을 수신한 후 상기 물리적 셀룰러 통신 채널을 유휴 상태로 설정하는, 셀룰러 네트워크 시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 셀룰러 네트워크 메시징 컨트롤러는 상기 UE의 상기 하나 이상의 사용 특성을 분석하기위해 기계 학습 프로세스를 수행하고, 상기 UE의 상기 하나 이상의 사용 특성은 상기 UE에 의해서 보내지는 SMS메시지의 특성인, 셀룰러 네트워크 시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 기계 학습 프로세스는, 상기 SMS 메시지의 길이; 상기 SMS 메시지가 전송된 시간; 상기SMS 메시지를 전송한 상기 UE의 위치; 및 SMS 코드로 구성된 그룹으로부터 선택된 적어도 하나의 특성을 분석하는 것을 포함하는, 셀룰러 네트워크 시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 셀룰러 코어 네트워크는 네이티브 5G 엔알(NR: New Radio)이고, 상기 셀룰러 기지국은gNodeB인, 셀룰러 네트워크 시스템."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "지능형 셀룰러 채널 관리를 수행하는 방법으로서,사용자 장비(UE)로부터의 셀룰러 서비스 요청에 응답하여 단문 메시지 서비스(SMS) 메시지를 보내기 위해 상기UE와 셀룰러 네트워크의 중앙집중형 유닛(CU) 사이에 물리적 셀룰러 통신 채널을 확립하는 단계;상기 UE, 상기 SMS 메시지, 또는 둘 모두의 하나 이상의 특성을 분석하는 단계; 및상기 분석된 하나 이상의 사용 특성에 기반하여 상기 물리적 셀룰러 통신 채널이 활성으로 유지되는 시간의 지속 기간을 결정하는 단계; 및상기 셀룰러 네트워크 메시징 컨트롤러가 상기 물리적 셀룰러 통신 채널이 활성 상태로 유지되는 시간의 지속기간을 조정하기로 결정하는 것에 기반하여 상기 물리적 셀룰러 통신 채널을 활성 상태로 유지하게 하는 채널유지 명령을 상기 CU에 전송하는 단계를 포함하되,상기 채널 유지 명령에 응답하여, 상기 CU는 상기 물리적 셀룰러 통신 채널을 활성 상태로 유지하는, 방법."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 UE가 상기 물리적 셀룰러 통신 채널을 통해 상기 SMS 메시지를 전송하는 단계; 및상기 UE가 상기 UE의 사용 특성을 상기 셀룰러 BS로 보내는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 특성은 SMS 메시징 애플리케이션이 상기 UE 상에서 열린 상태인 것을 나타내는, 방법.공개특허 10-2023-0146086-4-청구항 15 제14항에 있어서,사용자가 상기 UE에 텍스트를 입력하고 있다는 것을 나타내는 제2 특성을 상기 UE가 전송하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 셀룰러 네트워크의 SMSC가 상기 UE에 의해서 보내진 상기 SMS 메시지를 상기 물리적 셀룰러 통신 채널을통해 수신하는 단계; 및상기 SMS 메시지가 목적지로 라우팅되게 하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서, 상기 물리적 셀룰러 통신 채널은 활성인 동안, 상기 셀룰러 BS와 상기 UE 사이에서의 사용 전용인 무선 자원을 포함하는, 방법."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제12항에 있어서,상기 방법은 상기 CU가 상기 채널 유지 명령에 응답하여 채널 타이머의 지속 기간을 증가시키는 단계를 더 포함하되, 상기 채널 타이머가 만료되면, 상기 물리적 셀룰러 통신 채널은 유휴 상태로 설정되는, 방법."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12항에 있어서,상기 CU가 상기 채널 유지 명령에 기반하여 상기 물리적 셀룰러 통신 채널을 유휴 상태로 설정하는 단계를 더포함하는 방법."}
{"patent_id": "10-2023-7031812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제12항에 있어서,상기 방법은 상기 셀룰러 네트워크 메시징 컨트롤러가 상기 UE의 상기 하나 이상의 사용 특성을 분석하기 위해기계 학습 프로세스를 수행하는 단계를 더 포함하되, 상기 UE의 상기 하나 이상의 사용 특성은 상기 UE에 의해서 보내지는 SMS 메시지의 특성인, 방법."}
{"patent_id": "10-2023-7031812", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "지능형 셀룰러 채널 관리를 수행하기 위한 다양한 배열체가 본원에서 제시된다. 물리적 셀룰러 통신 채널은 사용 자 장비(UE)로부터의 셀룰러 서비스 요청에 응답하여 단문 메시지 서비스(SMS) 메시지를 보내기 위해 UE와 셀룰 러 네트워크 사이에 확립될 수 있다. UE, SMS, 또는 둘 모두의 하나 이상의 특성이 분석될 수 있다. 물리적 셀룰 러 통신 채널이 활성으로 유지되는 시간의 지속 기간은 분석된 하나 이상의 사용 특성에 기반할 수 있다. 셀룰러 네트워크 메시징 컨트롤러가 물리적 셀룰러 통신 채널이 활성 상태로 유지되는 시간의 지속 기간을 조정하기로 결정하는 것에 기반하여 물리적 셀룰러 통신 채널을 활성 상태로 유지하게 하는 채널 유지 명령이 전송될 수 있 다."}
{"patent_id": "10-2023-7031812", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원의 교차 참조 본 출원은 \"INTELLIGENT CELLULAR CHANNEL MANAGEMENT\"라는 명칭으로 2021년 2월 22일에 출원된 미국 특허 출 원 제17/181,815호에 대한 우선권을 주장하며, 이 미국 특허 출원은 이로써 그 전체 내용이 참조에 의해서 통합 된다. 사용자 장비(UE: user equipment)와 셀룰러 네트워크(cellular network) 사이에서 데이터가 교환되기 위해서는, UE와 셀룰러 코어 네트워크 사이에 통신 채널이 확립될 필요가 있다. 이러한 통신 채널의 확립은 프 로세싱 및 시그널링 오버헤드(signaling overhead)를 관여시킨다. 일단 채널이 확립되면, 이 채널은 타이머에 기반하여 일정 시간 동안 유지될 수 있다. 타이머가 만료되기 전에 UE와 셀룰러 네트워크 사이에서 추가적인 데 이터를 교환할 필요가 있는 경우, 이 채널이 재사용될 수 있다. 그러나, 타이머가 만료된 이후 UE와 셀룰러 네 트워크 사이에서 추가적인 데이터를 교환할 필요가 있는 경우, 새로운 채널이 생성될 필요가 있을 수 있으며, 이는, 이전 채널이 \"철거(torn down)\"되었거나 유휴 상태로 설정되었거나, 타이머의 만료 시 닫힌 상태로 되었"}
{"patent_id": "10-2023-7031812", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "기 때문에, 필요조건인 오버헤드를 관여시킨다.발명의 내용 지능형 셀룰러 채널 관리를 수행하는 셀룰러 네트워크 시스템과 관련된 다양한 실시형태가 설명된다. 일부 실시 형태에서, 지능형 셀룰러 채널 관리를 수행하는 셀룰러 네트워크 시스템이 설명된다. 시스템은 셀룰러 코어 (core) 네트워크를 포함할 수 있다. 시스템은 셀룰러 코어 네트워크의 일부로서 기능하는 단문 메시지 서비스 센터(SMSC: short message service center)를 포함할 수 있다. 시스템은 셀룰러 코어 네트워크와 통신하는 셀 룰러 기지국을 포함할 수 있다. 셀룰러 기지국(BS: base station)은 셀룰러 무선 액세스 기술(RAT: cellular radio access technology)을 사용하여 사용자 장비(UE: user equipment)와 무선으로 통신할 수 있다. 셀룰러 BS는 UE로부터의 셀룰러 서비스 요청에 응답하여 SMSC를 통해 단문 메시지 서비스(SMS: short message service) 메시지를 보내기 위해 UE와 셀룰러 네트워크 시스템의 중앙집중형 유닛(CU: centralized unit) 사이에 물리적 셀룰러 통신 채널을 확립하도록 구성될 수 있다. 시스템은 CU와 통신하는 셀룰러 네트워크 메시징 컨트 롤러를 포함할 수 있다. 셀룰러 네트워크 메시징 컨트롤러는 UE의 하나 이상의 사용 특성을 분석하도록 구성될 수 있다. 셀룰러 네트워크 메시징 컨트롤러는 UE의 분석된 하나 이상의 사용 특성에 기반하여 물리적 셀룰러 통 신 채널이 활성으로 유지되는 시간의 지속 기간을 결정하도록 구성될 수 있다. 셀룰러 네트워크 메시징 컨트롤 러는, 셀룰러 네트워크 메시징 컨트롤러가 물리적 셀룰러 통신 채널이 활성 상태로 유지되는 시간의 지속 기간 을 조정하기로 결정하는 것에 기반하여 물리적 셀룰러 통신 채널을 활성 상태로 유지하게 하는 채널 유지 명령 을 CU에 전송하도록 구성될 수 있다. 채널 유지 명령에 응답하여, 물리적 셀룰러 통신 채널이 활성 상태로 유지 될 수 있다. 이러한 시스템의 실시형태는 다음 피처들 중 하나 이상을 포함할 수 있다: UE는 물리적 셀룰러 통신 채널을 통 해 SMS 메시지를 전송하도록 구성될 수 있다. UE는 UE의 하나 이상의 사용 특성을 셀룰러 BS로 보내도록 구성될 수 있다. UE는 SMS 메시징 애플리케이션이 UE 상에서 열린 상태인 것을 나타내는 제1 특성을 전송하도록 구성될 수 있다. UE는 사용자가 UE 상에서 타이핑하고 있을 수 있다는 것을 나타내는 제2 특성을 전송하도록 구성될 수 있다. SMSC는 UE에 의해서 물리적 셀룰러 통신 채널을 통해 보내진 SMS 메시지를 수신하고 SMS 메시지를 목적지 에 주도록 구성될 수 있다. 물리적 셀룰러 통신 채널은 활성인 동안, 셀룰러 BS와 UE 사이에서의 사용 전용인 무선 자원(radio resources)을 포함할 수 있다. 채널 유지 명령은 셀룰러 코어 네트워크가 채널 타이머의 지속 기간을 증가시키게 할 수 있다. 채널 타이머가 만료되면, 물리적 셀룰러 통신 채널은 유휴 상태로 설정될 수 있 다. 셀룰러 코어 네트워크는 채널 유지 명령을 수신한 후 물리적 셀룰러 통신 채널을 유휴 상태로 설정할 수 있 다. 셀룰러 네트워크 메시징 컨트롤러는 UE의 하나 이상의 사용 특성을 분석하도록 기계 학습 프로세스를 수행 할 수 있다. UE의 하나 이상의 사용 특성은 UE에 의해서 보내진 SMS 메시지의 특성일 수 있다. 기계 학습 프로 세스는, SMS 메시지의 길이; SMS 메시지가 전송된 시간; SMS 메시지를 전송한 UE의 위치; 및 SMS 코드로 구성된 그룹으로부터 선택된 적어도 하나의 특성을 분석하는 것을 포함할 수 있다. 셀룰러 코어 네트워크는 네이티브 5G 엔알(NR: New Radio)일 수 있고, 셀룰러 기지국은 gNodeB일 수 있다. 일부 실시형태에서, 지능형 셀룰러 채널 관리를 수행하는 방법이 설명된다. 방법은 사용자 장비(UE)로부터의 셀 룰러 서비스 요청에 응답하여 단문 메시지 서비스(SMS) 메시지를 보내기 위해 상기 UE와 셀룰러 네트워크의 중 앙집중형 유닛(CU) 사이에 물리적 셀룰러 통신 채널을 확립하는 단계를 포함할 수 있다. 방법은 UE, SMS 메시지, 또는 둘 모두의 하나 이상의 특성을 분석하는 단계를 포함할 수 있다. 방법은 분석된 하나 이상의 특성 에 기반하여 물리적 셀룰러 통신 채널이 활성 상태로 유지될 수 있는 시간의 지속 기간을 결정하는 단계를 포함 할 수 있다. 방법은 셀룰러 네트워크 메시징 컨트롤러가 물리적 셀룰러 통신 채널이 활성 상태로 유지되는 시간 의 지속 기간을 조정하기로 결정하는 것에 기반하여 물리적 셀룰러 통신 채널을 활성 상태로 유지하게 하는 채 널 유지 명령을 CU에 전송하는 단계를 포함할 수 있다. 채널 유지 명령에 응답하여, CU는 물리적 셀룰러 통신 채널을 활성 상태로 유지할 수 있다. 방법은 UE가 물리적 셀룰러 통신 채널을 통해 SMS 메시지를 전송하는 단계 를 더 포함할 수 있다. 방법은 UE가 UE의 사용 특성을 셀룰러 BS로 보내는 단계를 더 포함할 수 있다. 특성은 SMS 메시징 애플리케이션이 UE 상에서 열린 상태일 수 있다는 것을 나타낼 수 있다. 방법은 사용자가 UE에 텍스 트를 입력하고 있을 수 있다는 것을 나타내는 제2 특성을 UE가 전송하는 단계를 더 포함할 수 있다. 방법은 셀 룰러 네트워크의 SMSC가 UE에 의해서 보내진 SMS 메시지를 물리적 셀룰러 통신 채널을 통해 수신하는 단계를 더 포함할 수 있다. 방법은 SMS 메시지가 목적지로 라우팅되게 하는 단계를 더 포함할 수 있다. 물리적 셀룰러 통 신 채널은 활성인 동안, 셀룰러 BS와 UE 사이에서의 사용 전용인 무선 자원을 포함할 수 있다. 방법은 CU가 채 널 유지 명령에 응답하여 채널 타이머의 지속 기간을 증가시키는 단계를 더 포함할 수 있다. 채널 타이머가 만 료되면, 물리적 셀룰러 통신 채널은 유휴 상태로 설정될 수 있다. 방법은 CU가 채널 유지 명령에 기반하여 물리 적 셀룰러 통신 채널을 유휴 상태로 설정하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2023-7031812", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "여기에 설명된 실시형태는 UE와 기지국(BS) 사이의 통신을 위해 확립된 채널의 지속 기간이 전송된 메시지의 특 성, UE의 모니터링된 특성, 또는 둘 다에 기반하여 지능적으로 변경되게 한다. 고정된 지속 기간(예컨대, 셀룰 러 네트워크의 모든 사용자에 대해)을 사용하는 타이머가, 채널이 비활성으로 인해 유휴 상태로 설정되어야 하 는 시기를 결정하는 데 사용되는 대신, 채널의 지속 기간은 네트워크 메시징 컨트롤러 시스템(NMCS: network messaging controller system)에 의해서 변경되거나, 채널이 유휴 상태여야 한다고 NMCS가 결정할 때까지 채널 은 열린 상태로 유지된다. NMCS는 UE의 특성, 네트워크 특성, RF 특성, 및/또는 UE에 의해서(또는 UE로) 전송되는 메시지를 모니터링할 수 있다. 규칙에 기반하여, NMCS는 타이머가 채널을 열린 상태로 유지하도록 설정될 시간의 양을 결정하는 다양한 규칙을 적용할 수 있다. 타이머가 경과하기 시작한 후, 타이머의 지속 기간은 UE의 특성에 기반하여 조정될 수 있다. 다른 실시형태에서, 타이머가 없을 수도 있다. 오히려 NMCS는 특성을 분석하고, 규칙(또는 기계 학습 모 델)을 적용하고, 채널 상태를 제어하는 타이머를 설정/조정하거나 통신 채널 상태(예컨대, 유휴 상태로 설정되 는지 여부)를 제어하는 커맨드를 보낼 수 있다. 일부 실시형태에서, 한 세트의 규칙을 적용하는 대신, 인공 지능(AI) 배열체가 NMCS의 일부로서 통합된다. 예를 들어, NMCS는 동일한 채널을 사용하여 전송될 가능한 미래 메시지를 위해 채널이 얼마나 오랫동안 열린 상태로 유지되어야 하는지를 결정하기 위해 기계 학습을 채용할 수 있다. 기계 학습 모델은 초기 전송 메시지의 특성, UE의 특성, 또는 둘 다를 기반하여 훈련될 수 있다. 규칙 기반, 기계 학습 기반 또는 하이브리드 배열체 여부에 관계없이, 이러한 구현은 페이징(paging) 또는 통신 채널 셋업(setup) 동안 대기할 필요가 있는 메시지가 더 적기 때문에 UE와 셀룰러 네트워크 간의 저지연 통신을 허용할 수 있다. 이러한 구현은, 스케줄링 및 무선 채널 리소스가 사용자 행동 및 애플리케이션 상태 데이터와 같은 상위 레벨 데이터를 사용하여 관리되므로, 더 효율적인 무선 최적화(radio optimization)를 허용한다. 또 한, 통신 채널의 상태가 보다 효율적으로 관리되므로, 감소된 시그널링으로 인해 UE 배터리 수명이 향상될 수 있다. 이러한 실시형태 및 추가적인 실시형태에 관한 추가 세부사항은 도면들과 관련하여 제시된다. 도 1은 지능형 셀 룰러 채널 관리를 수행하는 셀룰러 네트워크 시스템의 일 실시형태를 예시한다. 셀룰러 네트워크 시스템 은 다음을 포함할 수 있다: UE(UE(110-1), UE(110-2), UE(110-3)); 기지국; 무선 유닛 (RU); 분산형 유닛(DU), 중앙집중형 유닛(CU) 및 국가 데이터 센터(NDC: national data center)를 포함할 수 있는 셀룰러 네트워크; NMCS; 데이터 애플리케이션; 및 오버-더-탑 (OTT: Over-the-Top) 메시징 앱. UE는 셀룰러 네트워크를 통해 통신하는 다양한 형태의 디바이스를 나타낼 수 있다. UE는 스마트폰; 셀룰러 폰; 셀룰러 모뎀; 셀룰러 액세스 포인트(AP: access point); 사물 인터넷(IoT: Internet of Things) 디 바이스; 고정형 무선 디바이스 등을 포함할 수 있다. 예시된 바와 같이, 세 개의 UE가 예시된다. 이러한 UE의 수는 단지 예시용이다. UE와 셀룰러 네트워크는 하나 이상의 무선 액세스 기술(RAT: Radio AccessTechnology)에 따라 기능할 수 있다. 예를 들어, UE와 기지국은 5G 엔알(NR: New Radio) 셀룰러 통신 프 로토콜에 따라 통신할 수 있다. 4G 엘티이(LTE: Long Term Evolution), GSM, 3G 등과 같은 다른 RAT가 가능하 다. 6G와 같이 아직 개발되거나 배포되지 않은 RAT가 또한 가능할 수 있다. UE는 기지국과 통신한다. 5G NR 셀룰러 네트워크의 경우, 기지국과 gNodeB라는 용어는 상호교환가능 하게 사용될 수 있다. 기지국은 하나 이상의 안테나 및 RU를 포함할 수 있다. RU는 무선 통신과 셀룰러 네트워크 사이의 인터페이스 역할을 한다. 셀룰러 네트워크는 네이티브 5G NR일 수 있다. 다 른 실시형태에서, 셀룰러 네트워크는 일부 다른 표준에 따라 기능할 수 있다. 셀룰러 네트워크는, 셀 룰러 네트워크 내의 구성요소의 기능이 특수 펌웨어 또는 소프트웨어를 실행하는 범용 컴퓨터 서버를 사용 하여 전체적으로 또는 주로 구현되도록, 개방형 무선 액세스 네트워크(O-RAN: open radio access network) 표준 에 따라 구현될 수 있다. 셀룰러 네트워크는 DU, CU, 하나 이상의 지역 데이터 센터(도시되지 않음), 및 NDC를 포함 할 수 있다. 단순화를 위해 RU, DU 및 CU의 단일 사례만 예시되고, 셀룰러 네트워크의 실제 구 현은 넓은 지리적 영역에 걸쳐 구현되는 많은 유사한 구성요소를 관여시킬 수 있다. 5G NR 기반 네트워크에서, gNodeB(gNB)는 하나 이상의 RU, 하나 이상의 DU 및 CU를 포함한다. 다양한 시스템 아키텍처에서, 특정 기능이 DU 또는 CU에 할당될 수 있다. NDC는 단문 메시지 서비스(SMS: short message service) 메시징과 같은 메 시징에 특유한 기능을 수행할 수 있다. 이 문서 내에서 자세히 설명된 실시형태는 SMS 메시징에 중점을 두나, 통신 채널이 SMS 메시징을 위해 열린 상태로 유지되어야 하는지 여부를 결정하는 데 적용되는 원칙은 UE와 RU 간의 다른 형태의 통신을 위해 통신 채널이 열린 상태로 유지되어야 하는지 여부를 결정하는 데 또한 적용될 수 있다. NDC는, 단문 메시지 서비스 기능(SMSF: short message service function), 단문 메시지 서비스 센터 (SMSC: short message service center), 인터넷 프로토콜-단문-메시지-게이트웨어(IP-SM-GW: Internet Protocol-Short Message-Gateway)/단문 메시지 서비스 게이트웨이(SMS-GW: Short Message Service Gateway)(이하 \"GW 136\"); IP 멀티미디어 서브시스템(IMS: IP Multimedia Subsystem); 및 5G C.의 기능을 수행할 수 있다. SMSF는 SMS 텍스트의 소스 및/또는 목적지와 연관된 구독(subscription) 또는 허 가를 분석하는 것을 포함하는 기능을 수행할 수 있다. SMSF는 전송 및/또는 수신 UE에 할당된 구독 또는 허가에 따른 경우에만 SMS가 완료되는 것을 허용할 수 있다. SMSF는 허용된 SMS 메시지를 SMSC로 포 워드(forward)하는 역할을 할 수 있다. GW는 셀룰러 네트워크 제공자들 사이 및 다른 형태의 네트워크들과 의 SMS 전송, 예를 들어 GW와 통신하기 위해 인터넷을 사용하는 컴퓨터 시스템으로부터의 SMS 메시지의 전 송을 용이하게 할 수 있다. SMSC는 셀룰러 네트워크에 대한 SMS 메시지를 저장, 포워드, 변환 및 전달하는 역할을 할 수 있다. IMS는 SMS 메시지가 IP를 통해 전달되는 것을 허용한다. IMS는 사용자 평면을 통 해 SMS 메시지를 라우팅하고, IMS를 사용하여 SMS를 SMSC로 보낸다. SMS가 IMS를 통해 라우팅되거나 제어 평면 및 SMSF를 통해 라우팅되는지 여부에 관계없이, 본 문서에 제시된 실시형태는 적용가능하다. 5G 코어(Core)는 다양한 기능을 수행할 수 있다. 5G 코어는 다음을 포함할 수 있다: 인증 서버 기능 (AUSF: authentication server function); 코어 액세스 및 이동성 관리 기능(AMF: core access and mobility management function); 다양한 다른 네트워크에 대한 액세스를 제공할 수 있는 데이터 네트워크(DN: data network); 구조화된 데이터 저장 네트워크 기능(SDSF: structured data storage network function); 및 비구조 화된 데이터 스토리지 네트워크 기능(UDSF: unstructured data storage network function). SMS 메시지가 UE, 예컨대, UE(110-1)로부터 SMSC 또는 IMS로 전송되거나, SMSC 또는 IMS 로부터 UE(110-1)로 전송되는 것일 때, 제어 평면 또는 사용자 평면에서 각각 UE(110-1)와 CU 사이에 통신 채널이 생성된다. 통신 채널은 UE(110-1)와 CU 사이의 통신 전용의 특정 주파수 및/또는 시간 기간과 같은 무선 자원을 관여시킬 수 있다. 셀룰러 통신 프로토콜 스택에서, 통신 채널은 스택의 물리적 레이어를 나타낼 수 있고, UE와 RU 사이의 무선 통신을 위한 시간 및/또는 주파수 자원의 예약을 관여시킨다. 통신 채널의 확립 은 UE(110-1), RU, DU, 및/또는 CU 사이에서 발생하는 시그널링의 양을 관여시킨다. 보다 구체 적으로, 이 통신 채널은 UE(110-1)와 셀룰러 네트워크의 gNB(DU 및 CU) 사이에 확립되는 무선 자원 제어(RRC: radio resource control) 연결의 형태일 수 있다. RRC 연결은, 유휴 모드(연결 없음); 전용 채널; 순방향 액세 스 채널(UE로부터 gNB로); 셀 페이징 채널; 및 URA 페이징 채널을 포함하여 여러 모드로 존재할 수 있다. 이러 한 상태들 각각은 UE와 gNB 사이의 상이한 양의 시그널링, gNB, RU 및 UE에 의해서 사용되고 있는 통신/프로세 싱 자원의 양, 및 UE에 의한 상이한 전력 소비량을 관여시킨다. 통신 채널의 확립, 상태, 및 폐쇄에 관한 정보 는, UE와 gNB 사이에 존재하는 셀룰러 무선 프로토콜 스택의 기능적 레이어인 논-액세스 계층(NAS: Non-AccessStratum)에 걸쳐 발생될 수 있다. UE(110-1)와 gNB 사이의 통신 채널이 활성 상태(즉, 유휴 상태 이외의 임의의 모드)일 때, 통신 채널이 유지되 어야 하는 상태를 결정하도록 gNB에 의해서 다수의 타이머가 유지될 수 있다. 예를 들어, 제1 타이머(T1)는 전 용 채널로부터 순방향 액세스 채널로의 전이가 발생되어야 하는 때를 결정할 수 있고; 제2 타이머(T2)는 순방향 액세스 채널로부터 페이징 채널로의 전이가 발생되어야 하는 때를 제어할 수 있고; 제3 타이머(T3)는 페이징 채 널로부터 유휴 상태로의 전이가 발생되어야 하는 때를 제어할 수 있다. 이러한 타이머의 지속 기간은 네트워크 운영자에 의해서 설정될 수 있다. 종래에, 타이머들은 모든 UE에 대해 정적이다. 타이머가 활성화된 상태에서 통신 채널이 활용되면, 시간이 재설정될 수 있다. 통신 채널이 다시 활용되기 전에 타이머가 만료되면, 전이가 발생될 수 있다. 셀룰러 네트워크 시스템은, NDC와 통신하거나 DU 및/또는 CU와 같은 하나 이상의 gNB 구성 요소와 직접적으로 통신할 수 있는 NMCS를 포함한다. NMCS는 gNB에 채널 유지 명령을 보냄으로써 UE 와 gNB 사이의 통신 채널의 상태를 제어할 수 있다. NMCS는 타이머 T300과 같은 타이머의 지속 기간을 설 정 또는 수정하기 위해서 채널 유지 명령을 사용하거나, 또는 NMCS로부터 gNB로 보내지고 있는 커맨드에 따라 통신 채널에 전이를 만듦으로써 이러한 타이머를 대신 또는 대체할 수 있다. NMCS는 통신 채널 타이머의 지속 기간 또는 통신 채널이 유지되어야 하는 상태를 다수의 정보 소스에 기반 하여 결정할 수 있다. 정보의 제1 소스는 UE에 의해서 gNB로 전송되는 특성일 수 있으며, 이는 셀룰러 네트워크 에 의해서 NMCS로 포워드될 수 있다. 이러한 특성에 대한 세부사항은 도 2와 관련하여 제공된다. 추 가적으로 또는 대안적으로, NMCS는 통신 채널 타이머의 지속 기간 또는 통신 채널이 유지되어야 하는 상태를 SMS 메시지 자체의 특성에 기반하여 결정할 수 있다. DU 및 CU를 포함할 수 있는 gNB 또는 SMSC는 SMS 메시지 자체를 NMCS에 보낼 수 있거나, 또는 SMS 메시지의 특성을 분석을 위해 NMCS에 보낼 수 있다. 이러한 특성은 다음을 포함할 수 있다: SMS가 보내진 시간; SMS 메시지가 보내진 날 짜; SMS 메시지가 보내진 곳의 지리적 위치; SMS 메시지의 소스의 아이덴티티(identity); SMS 메시지의 수신자 의 아이덴티티; 수취인이 위치된 곳의 지리적 위치; SMS 메시지를 보낸 애플리케이션; SMS 메시지의 길이; SMS 메시지 내에 존재하는 특정 문자 스트링; SMS 메시지가 기원된 UE의 유형 또는 클래스; 발신자에 의해서 사용되 는 셀룰러 네트워크 슬라이스; 수신자에 의해서 사용되는 셀룰러 네트워크 슬라이스; 정의된 기간 내에 UE에 의 해서 보내진 SMS 메시지의 수; 및/또는 사용된 SMS 코드(예컨대, GSM 코드, USC2 코드). SMS 메시지 및 UE의 특성에 추가로 또는 대안으로, NMCS는 셀룰러 네트워크의 특성을 분석할 수 있다. NMCS는 RU와 UE 사이의 무선 자원의 활용량의 특성을 수신할 수 있다. NMCS는 셀룰러 네 트워크의 특정 구성요소의 프로세싱 또는 통신 자원의 활용량과 같은 다른 네트워크 정보를 수신할 수 있 다. 분석된 특성은 추가적으로 또는 대안적으로 다음을 포함할 수 있다: UE의 RF 조건, UE의 전력 소비(예를 들 어, gNB로 보내지는 신호가 낮은 전력일 때 UE의 전력 소비가 더 낮음); 네트워크 부하, SINR, 간섭 조건, 시간, 요일 등. NMCS는 다양한 방식으로 기능할 수 있다. 일부 실시형태에서, NMCS는 UE의 특성, SMS 메시지의 특성, 및/또는 셀룰러 네트워크의 특성에 기반하여 수행되는 다양한 규칙을 갖는다. 이러한 규칙은 T300-클래스 타이 머와 같은 타이머의 지속 기간을 설정하거나 업데이트하는 데 사용될 수 있다. 대안적으로, 이러한 규칙은 통신 채널이 특정 활성 상태로 유지되어야 하거나 유휴 상태로 설정되어야 한다는 것을 나타내는 커맨드를 gNB에 보 내기 위해서 사용될 수 있다. 표 1은 타이머의 지속 기간을 조정하는 데 사용될 수 있는 가능한 규칙의 예를 나 타낸다. 표 1"}
{"patent_id": "10-2023-7031812", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "일부 실시형태에서, 정의된 규칙을 사용하는 대신, 기계 학습 모델을 사용하는 것과 같은 AI 기반 접근 방 식이 NMCS에 의해서 사용될 수 있다. 기계 학습은 사용되어야 하는 타이머의 지속 기간 및/또는 통신 채널 의 상태를 유휴 상태로 전환하는 커맨드가 보내져야 하는 때를 결정하도록 기계 학습 모델을 훈련시키는 것을 관여시킬 수 있다. 일 세트의 트레이닝 데이터는 다수의 SMS 메시지와 상기 SMS 메시지를 보내거나/수신한 UE에 대한 특성을, UE가 다음에 사용 가능한 통신 채널을 필요로 한 시점에 대한 데이터와 함께 포함할 수 있다. 예를 들어, 하나의 가능한 기계 학습 구현예는 이러한 특성들 중 일부 또는 전부에 기반하여 신경망이 훈 련되는 것을 관여시킬 수 있다. 이러한 특성은 신경망에 대한 입력 피처(feature)의 역할을 할 수 있다. 다음으 로 신경망은 미리 정의된 타이머 지속 기간 또는 시간 지속 기간 클래스를 선택하기 위해 피처에 기반하여 분류 를 수행할 수 있다. 다른 실시형태에서, 타이머를 설정하기 위해서, 그리고/또는 통신 채널의 상태를 변경하기 위한 커맨드가 전송되어야 하는 때를 결정하기 위해서 사용될 수 있는 특정 시간량을 계산하는 데 다른 형태의 기계 학습이 사용될 수 있다. 일부 실시형태에서, NMCS는 이전에 설정된 타이머를 수정할 수 있다. 예를 들어, 변경된 UE의 특성에 기반 하여, 타이머의 지속 기간을 변경하는 것이 효율적일 수 있다. 예를 들어, 타이머가 만료되도록 설정되어 통신 채널이 유휴 상태로 설정되지만, NMCS가 사용자가 SMS 애플리케이션을 열었다는 것을 나타내는 UE에 관한 특성 정보를 수신하는 경우, NMCS는 타이머의 지속 기간을 증가시킬 수 있다. 마찬가지로, 타이머가 일정 시간 동안 만료되지 않도록 설정되었으나 사용자가 SMS 애플리케이션을 닫았다는 것을 나타내는 UE에 관한 특성 정보를 NMCS가 수신한 경우, NMCS는 타이머의 지속 기간을 감소시킬 수 있거나, 통신 채널이 유휴 상 태로 설정되는 것을 나타내는 커맨드를 gNB에 보낼 수 있다. 이러한 수정은 NMCS가 규칙 또는 기계 학습 모델을 사용함으로써 관리될 수 있다. 일부 실시형태에서, UE 및/또는 SMS 메시지의 특성을 사용하는 것에 추가적으로 또는 대안적으로, 데이터는 하 나 이상의 다른 소스로부터 획득될 수 있다. 예를 들어, 별도의 데이터 애플리케이션은 통신 채널이 설정 되어야 하는 상태(또는 타이머가 어떻게 조정되어야 하는지)를 결정하는 데 사용될 수 있는 정보를 NMCS에 제공할 수 있다. 예를 들어, 스트리밍 비디오 카메라로부터 데이터를 수신하는 시스템은 사용자가 자신의 UE를 내려놓고 떠났고, 따라서 사용자가 가까운 미래에 SMS 문자 메시지를 보낼 가능성은 거의 없다고 판단할 수 있 다. 다른 예로서, OTT 메시징 애플리케이션은 또 다른 SMS 메시지가 보내질 가능성이 있는지에 대한 데이 터를 제공할 수 있는 제3자 메시징 애플리케이션일 수 있다. 예를 들어, OTT 메시징 애플리케이션은 OTT 메시징 애플리케이션이 특정 시간 기간 내에 SMS를 전송할 의도가 있다는 것, 또는 OTT 메시징 애플리케이 션이 UE가 특정 시간 기간 내에 응답할 것으로 예상한다는 것을 나타내는 정보를 NMCS에 제공할 수 있다. 이러한 정보는 타이머의 지속 기간이나 통신 채널이 설정되어야 하는 특정 상태를 결정하기 위해 NMCS에 의해서 사용될 수 있다. 도 2는 지능형 셀룰러 채널 관리를 수행하는 셀룰러 네트워크 시스템의 부분으로서 기능하는 UE의 일 실시 형태를 예시한다. UE는, 예를 들어, UE(110-1), UE(110-2), UE(110-3) 등으로서 기능할 수 있다. UE(20 0)는 프로세싱 시스템 및 무선 구성요소를 포함할 수 있다. 무선 구성요소는 UE가 5G NR 및 4G LTE와 같은 하나 이상의 RAT를 통해 통신하게 할 수 있다. 무선 구성요소는 프로세싱 시스템과 데이터를 교환할 수 있다.프로세싱 시스템은 하나 이상의 특수 목적 또는 범용 프로세서를 포함할 수 있다. 이러한 특수 목적 프로 세서는 본원에서 상세히 설명된 기능을 수행하도록 특별히 설계된 프로세서를 포함할 수 있다. 이러한 특수 목 적 프로세서는 본원에서 상세히 설명된 기능을 수행하도록 물리적으로 그리고 전기적으로 구성된 범용 구성 요 소인 ASIC 또는 FPGA일 수 있다. 이러한 범용 프로세서는 랜덤 액세스 메모리(RAM: Random Access Memory), 플 래시 메모리, 하드 디스크 드라이브(HDD: Hard Disk Drive), 또는 솔리드 스테이트 드라이브(SSD: Solid State Drive)와 같은 하나 이상의 비일시적 프로세서 판독 가능 매체를 사용하여 저장되는 특수 목적 소프트웨어를 실 행할 수 있다. 프로세싱 시스템은 펌웨어, 소프트웨어 또는 특수 목적 하드웨어의 형태인지 여부에 관계없 이 UE 운영 체제(OS), 메시징 애플리케이션; 애플리케이션; 및 채널 컨트롤러의 기능을 수 행할 수 있다. UE OS를 실행하는 것 외에도, 메시징 애플리케이션이 프로세싱 시스템에 의해서 실행될 수 있다. 메시징 애플리케이션은 SMS 문자 메시지를 보내고 받는 데 사용될 수 있다. 멀티미디어 메시징 서비 스(MMS) 메시지와 같은 다른 형태의 메시지 또한 메시징 애플리케이션을 통해 보내고 받을 수 있다. 채널 컨트롤러는 프로세싱 시스템에 의해서 실행될 수 있다. 채널 컨트롤러는 사용자가 직접적으로 상호작용하지 않는 백그라운드 프로세스일 수 있다. 오히려, 채널 컨트롤러는 메시징 애플리케이션, 애플리케이션에 의해 취해진 액션 및/또는 사용자가 UE와 상호작용하는 방식에 기반하여 UE의 특성을 모니터링할 수 있다. 채널 컨트롤러는 주기적으로 또는 때때로 UE의 특성이 NMCS로 전송되게 할 수 있다. 이러한 특성은 다음을 포함할 수 있다: 사용자가 UE 상에 타이핑 중인지(또는 음성 입력을 제공 중 인지) 여부; UE가 움직이는지 여부, 얼마나 빠른지 및 움직이는 방향; UE의 배향; 어떤 애플리케이션이 현재 활 성인지; 애플리케이션의 상태(예컨대, SMS 기반 인증 프로세스를 수행 중); SMS 애플리케이션이 활성인지 여부; 오디오/비디오가 UE에 의해서 출력되고 있는지 여부; 및 UE가 잠겨 있는지 여부. UE의 특성은 채널이 이미 열린 상태에 있는 동안 보내질 수 있고, 예측될 수 있고, 그리고/또는 패킷 연결부를 통해서와 같은 대체 경로를 통 해서 셀룰러 네트워크로 보내질 수 있다. 이러한 특성에 대한 표시는 때때로 셀룰러 네트워크로 전송되어 NMCS로 포워드될 수 있다. NMCS는 이 러한 데이터를 사용하여 채널의 상태가, 예컨대, 유휴 상태로 변경되어야 하는 시기에 대해 타이머를 설정할 수 있거나, 상태를 변경하는 커맨드가 gNB에 보내져야 하는 시기를 결정하기 위해서 사용될 수 있다. 도 3은 지능형 셀룰러 채널 관리를 수행하는 셀룰러 네트워크 시스템의 셀룰러 코어 네트워크와 UE 사이의 통신 의 스윔 다이어그램을 예시한다. 도 3에서, UE, gNB, AMF(5G 코어 액세스 및 이동성 기능(Core Access and Mobility Function)), SMSF, SMSC 간의 상호 작용이 예시된다. AMF는 셀룰러 네트워크의 NDC에 의해 서 수행되는 기능으로서 이해될 수 있다. AMF는 UE로부터 연결 및 세션 관련 정보를 수신하고, 연결 처리 및 이 동성 관리 관련 작업을 담당할 수 있다. 서비스 요청은 UE가 셀룰러 네트워크로 보내질 SMS 메시지를 가질 때 발생된다. 서비스 요청이 UE에 존재 하는 시각에, UE는 이의 통신 채널이 유휴 모드에 있을 수 있다. 유휴 모드로부터 통신 채널을 확립하기 위해, 2-단계 RACH(랜덤 액세스 채널) 프로세스(또는 3G에서와 같은 일부 다른 프로세스)가 UE에 의해서 개시될 수 있다. RACH는 gNB와 스케줄되지 않은 통신을 수행하기 위해 다수의 UE에 의해서 사용되는 공유 채널이다. RACH에 대해 사용되는 물리적 레이어 채널은 PRACH로서 지칭된다. 2-단계 RACH에서, RA(랜덤 액세스) 프리앰블 및 메시지를 포함하는 제1 전송이 UE로부터 gNB로 전송되며, 이는 전송될 제1 SMS 텍스트를 포함할 수 있다. 성 공적으로 수신된 제1 전송에 대한 응답으로, gNB는 RA 응답 및 메시지를 포함하는 제2 전송으로 UE에 응답한다. RA 응답은 제1 전송으로부터 검출된 프리앰블 ID, 타임 어드밴스 커맨드(time-advance command), 및 UE로부터 gNB로의 미래의 제3 전송을 스케줄링하기 위한 업링크 승인을 포함할 수 있다. 2-단계 RACH에 이어, UE에 대한 통신 채널(RRC 채널)이 확립되고, 통신 채널이 유휴 모드에 있지 않고, UE는 일 정 수의 전용 자원 블록(시간 슬롯 및 주파수)을 가지며, 여기에서 gNB에 메시지를 전송한다. 블록 330 및 블록 340에서, UE는 통신 채널이 활성(즉, 비유휴 상태)인 동안 이러한 전용 시간 슬롯을 사용하여 미래의 SMS 메시 지를 보낼 수 있다. 이러한 메시지는 gNB에 의해서 수신되어 블록 335 및 블록 345에서 프로세스될 수 있다. 이 시점에서, UE와 gNB 사이의 통신 채널은 비유휴 상태이다. NMCS는 UE 및/또는 SMS 메시지의 특성에 기반하여 분석을 수행하여, 타이머가 gNB에서 통신 채널이 유휴 상태로 되는 때를 지시하는 gNB에 대해 조정되어야 하는 (또는 커맨드가 전송되어야 하는) 방법을 결정한다. 유휴 상태로 되면, 2-단계 RACH 프로세스는 반복될 필요가 있을 수 있다. SMS가 유휴 상태의 UE로부터 기원되어 NAS를 통해 보내지면, UE는 도메인 선택을 수행하고, UE 및 네트워크는 AMF에 대한 NAS 시그널링 연결을 확립하기 위해 UE-트리거 서비스 요청 절차를 수행한다. UE는 보내질 SMS 메시 지를 빌드(build)할 수 있다. SMS 메시지는, NAS 메시지가 SMS 전송을 위한 것임을 나타내는 표시와 함께 NAS 메시지에 압축된다. UE는 블록 340의 일부로서 AMF에 NAS 메시지를 전송한다. AMF는 현재 UE 위치 정보 및 현지 시간대와 같은 정보를 추가할 수 있고, 블록 350에서 SMS 메시지 및 UE 아이덴티티를 UE를 서비스하는 SMSF로 포워드할 수 있다. SMSF는 SMS 수신확인 메시지를 AMF에 보낼 수 있다. AMF는 SMS 수신확인 메시지를 SMSF로부 터 UE로 다운링크 유닛 데이터 메시지를 사용하여 포워드한다. SMSF는 SMS 관리 구독 데이터를 체크할 수 있다. SMSF는 블록 355에서 SMS 메시지를 SMSC로 포워드할 수 있고, 다음으로 제출 리포트를 AMF에 포워드하며, 이는 블록 360 및 블록 365에서 다운링크 NAS 전송을 통해 UE에 포워드된다. 비유휴 모드에 있는 UE로부터 SMS가 기 원되는 경우에, 서비스 요청 프로세스가 수행될 필요가 없을 수 있다. SMS가 NAS를 통해 UE에서 기원되고 종료되고 UE가 유휴 모드에 있을 때, SMSC는 UE를 대상으로 하는 SMS 메시지 를 SMSF로 보낼 수 있다. SMSF는 SMS 관리 구독 데이터를 체크할 수 있다. SMS 전달이 허용되는 경우(예컨대, UE에 매핑된 구독에 따라), SMSF는 AMF에 접속할 수 있고, AMF는 UE를 페이징할 수 있다. 그러면 UE는 서비스 요청 절차로 페이지에 응답할 수 있다. SMSF는 AMF로 보내질 SMS 메시지를 포워드할 수 있다. AMF는 SMS 메시지 를 UE로 전달할 수 있다. UE는 SMS 메시지의 수신을 AMF를 통해 SMSF로 수신확인(acknowledge)할 수 있다. AMF 는 현재 UE 위치 정보 및 현지 시간대를 포함한 정보를 추가할 수 있다. UE는 전달 리포트를 반환할 수 있다. 전달 리포트는 NAS 메시지에 압축되어 AMF로 보내질 수 있으며, 이는 SMSF로 포워드될 수 있다. SMSF는 전달 리 포트의 수신을 UE에게 수신확인할 수 있다. AMF는 SMS 메시지를 NAS 메시지를 통해 UE에 압축한다. UE가 이미 비유휴 모드에 있는 경우, 프로세스는, AMF가 UE의 페이징을 수행할 필요가 없다는 점을 제외하고, 동일하게 유 지될 수 있고, SMSF가 SMS를 UE에게 보내는 것을 허용하도록 SMSF에 대한 메시지를 즉시 계속할 수 있다. 도 4는 지능형 셀룰러 채널 관리를 수행하기 위한 방법의 일 실시형태를 예시한다. 방법은 도 1 및 도 2와 관련하여 상세히 설명된 시스템 및 디바이스를 사용하여 수행될 수 있다. 블록 405에서, UE는 초기에 BS(예를 들어, gNB)와 활성인 활성 물리적 레이어 통신 채널(예컨대, RRC 통신 채널)을 갖지 않을 수 있다. 따 라서, BS, 좀 더 구체적으로, gNB로 데이터를 전송하기 위해, UE는 초기에 랜덤 액세스 채널을 사용하여 통신해 야 할 수 있으며, 이는 어느 정도의 시그널링 오버헤드(signaling overhead)를 관여시킬 수 있다. 블록 410에서, UE는 gNB로 전송할 데이터를 수신했다. 방법에서, 수신되는 데이터는 사용자로부터의 SMS 메시지 이다. 다른 실시형태에서, SMS 메시지 이외의 다른 데이터가 전송될 필요가 있을 수 있다. 예를 들어, 방법 은 MMS 메시지 또는 일부 다른 형태의 데이터 전송, 예를 들어, 셀룰러 네트워크와 IoT 디바이스 사이에 교환되는 데이터에 적용될 수 있다. 전송할 메시지를 수신하는 것에 응답하여, UE는 블록 415에서 BS와 랜덤 액세스 교환을 수행할 수 있다. 예를 들어, 도 3과 관련하여 상세히 설명된 바와 같이, 2-단계 RACH 프로세스가 수행될 수 있으며, 이는 SMS 메시지 의 제1 부분이 RA 교환의 일부로서 전송되는 것을 관여시킬 수 있다. 이러한 교환은, 적어도 하나의 RA 메시지 가 UE에 의해서 BS로 보내지는 것 및 BS가 충돌 해결의 역할을 할 수 있는 응답, 즉 RA 메시지가 성공적으로 수 신되는 것에 관한 확인을 보내고 UE를 위한 통신 채널을 전용화하는 것을 관여시킬 수 있다. 다른 실시형태에서, 4-단계 RACH 프로세스 또는 일부 다른 형태의 RA 프로세스가 수행될 수 있다. 블록 420에서, SMS의 길이가 충분하다면, SMS 메시지의 추가 부분이 전송 보류 상태로 남아 있을 수 있다. SMS 메시지의 추가 부분은 현재 활성화된 통신 채널을 사용하여 블록 425에서 보내질 수 있다. 블록 420 및 블록 425는 SMS 메시지의 전체가 전송될 때까지 반복될 수 있다. 블록 430에서, 초기 SMS 메시지가 전송되었다. SMS 메시지, UE 또는 제3자 소스로부터의 정보의 하나 이상의 속 성은 NMCS에 의해서 분석되어 다음을 결정할 수 있다: 타이머(예컨대, T300 클래스 타이머)의 초기값; 타이머에 대한 조정(증가 또는 감소) 값; 및/또는 통신 채널이 활성 상태로 유지되어야 하는지, 유휴 상태로 설정되어야 하는지, 또는 통신 채널이 유지되어야 하는 특정 모드로 설정되어야 하는지에 관해 gNB에 전송하도록 하는 커맨 드. 블록 435에서, 채널 유지 명령이 NMCS에 의해서 gNB로 전송될 수 있다. 채널 유지 명령은 gNB에 다음을 제 공할 수 있다: 타이머(예를 들어, T300 타이머)에 사용할 값; 타이머에 대한 디폴트 값의 조정; 또는 통신 채널 을 특정 모드로 설정하도록 하는 커맨드. 블록 440, 450, 및 455는 통신 채널이 여전히 활성 상태인 동안 발생될 수 있다. 블록 450에서 또 다른 SMS 메 시지가 보내지면, RA 프로세스는, 통신 채널이 UE와 BS 사이의 통신 전용의 물리적 통신 자원을 적어도 어느 정 도 관여시키기 때문에, 수행될 필요가 없다. 블록 450에서 수신된 다음번 SMS 메시지는 NMCS에 의해서 활성 상 태로 유지되었던 통신 채널을 사용하여 블록 455에서 전송된다. 방법은 블록 420으로 돌아갈 수 있고, SMS메시지의 전체는 전송될 수 있고, NMCS는 통신 채널이 유휴 상태로 설정되어야 하는 시기를 결정하기 위해 UE의 특성, SMS 메시지, 및 다른 특성의 소스를 계속 평가할 수 있다. 블록 440을 다시 참조하면, NMCS가, 평가된 특성에 기반하여, 통신 채널이 유휴 상태여야 한다고 결정하거나 다 음번 SMS 메시지가 전송되기 전에 통신 채널이 유휴 상태로 설정되는 것으로 귀결되는 값으로 T300 클래스 타이 머를 설정하는 경우, 방법은 블록 445로 진행할 수 있다. 블록 445에서, 통신 채널은 유휴 상태로 설정된 다. 이제 방법은 이제 블록 405로 돌아간다. UE는 UE와 BS 사이에서 일부 미래의 데이터 변경이 수행될 때 까지 유휴 모드에 남아 있을 수 있다. UE가 셀룰러 네트워크에 액세스해야 하는 경우, UE는, UE와 BS 사이의 통 신 전용의 물리적 자원이 현재 없기 때문에, 이제 RA 프로세스를 반복할 필요가 있을 수 있다. 위에서 논의된 방법, 시스템, 및 디바이스는 예들이다. 다양한 구성이 다양한 절차나 구성요소를 적절하게 생략, 대체 또는 추가할 수 있다. 예를 들어, 대안적인 구성에서, 방법은 설명된 것과 다른 순서로 수행될 수 있고/있거나, 다양한 단계가 추가, 생략 및/또는 결합될 수 있다. 또한, 특정 구성들과 관련하여 설명된 피처들 은 다양한 다른 구성으로 결합될 수 있다. 구성의 다양한 양태들 및 요소들은 유사한 방식으로 결합될 수 있다. 또한, 기술은 발전하므로, 많은 요소는 예일 뿐이고, 본 개시내용이나 청구 범위를 제한하지 않는다. 구체적인 세부 사항은 예시적 구성(구현예를 포함함)에 대한 철저한 이해를 돕기 위해 설명에 제공된다. 그러나, 구성은 이러한 특정 세부 사항 없이 실행될 수 있다. 예를 들어, 널리 공지된 회로, 프로세스, 알고리 즘, 구조체, 및 기술은 구성을 모호하게 하는 것을 회피하기 위해 불필요한 세부 사항 없이 도시되었다. 이러한 설명은 예시적인 구성만을 제공하고, 청구항의 범위, 적용 가능성 또는 구성을 제한하지 않는다. 오히려, 구성 에 대한 이전 설명은 설명된 기술을 구현하기 위한 가능한 설명을 당업자에게 제공할 것이다. 본 개시내용의 기 술적 사상 또는 범위를 벗어나지 않으면서 요소들의 기능 및 배열에 다양한 변경이 이루어질 수 있다. 또한, 구성은 프로세스로서 설명될 수 있으며, 이는 흐름도나 블록도로서 도시된다. 각각은 작동들을 순차적 프 로세스로서 설명할 수 있지만, 많은 작동들은 병렬로 또는 동시에 수행될 수 있다. 또한, 작동들의 순서가 재배 열될 수 있다. 프로세스는 도면에 포함되지 않은 추가 단계를 가질 수 있다. 더욱이, 방법의 실시예는 하드웨어, 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨어 설명 언어, 또는 이들의 임의의 조합에 의해 구현될 수 있다. 소프트웨어, 펌웨어, 미들웨어, 또는 마이크로코드로 구현되는 경우, 필요한 태스크를 수행하 기 위한 프로그램 코드 또는 코드 세그먼트는 저장 매체와 같은 비일시적 컴퓨터 판독 가능 매체에 저장될 수 있다. 프로세서는 설명된 태스크를 수행할 수 있다. 여러 가지 예시적인 구성을 설명하였지만, 본 개시내용의 기술적 사상으로부터 벗어나지 않으면서 다양한 수정, 대체 구성 및 등가물이 사용될 수 있다. 예를 들어, 위의 요소는 더 큰 시스템의 구성요소일 수 있으며, 여기서 다른 규칙이 본 발명의 적용보다 우선하거나 달리 수정할 수 있다. 또한, 다수의 단계들은 위의 요소들이 고려 되기 전, 고려되는 동안, 고려된 후에 착수될 수 있다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2023-7031812", "section": "도면", "subsection": "도면설명", "item": 1, "content": "다양한 실시형태의 특성과 장점에 대한 추가 이해는 다음 도면을 참조하여 실현될 수 있다. 첨부된 도면에서, 유사한 구성요소 또는 피처는 동일한 참조 라벨을 가질 수 있다. 또한, 동일한 유형의 다양한 구성요소들은 대 시(dash)를 통한 참조 라벨, 및 유사한 구성요소들을 구별하는 제2 라벨을 따라감으로써 구별될 수 있다. 명세 서에서 제1 참조 라벨만이 사용하는 경우, 설명은 제2 참조 라벨과 관계없이 동일한 제1 참조 라벨을 갖는 유사 구성요소들 중 어느 하나에 대하여 적용가능하다. 도 1은 지능형 셀룰러 채널 관리를 수행하는 셀룰러 네트워크 시스템의 일 실시형태를 예시한다. 도 2는 지능형 셀룰러 채널 관리를 수행하는 셀룰러 네트워크 시스템의 부분으로서 기능하는 사용자 장비의 일 실시형태를 예시한다. 도 3은 지능형 셀룰러 채널 관리를 수행하는 셀룰러 네트워크 시스템의 셀룰러 코어 네트워크와 UE 사이의 통신 의 스윔 다이어그램(swim diagram)을 예시한다. 도 4는 지능형 셀룰러 채널 관리를 수행하기 위한 방법의 일 실시형태를 예시한다."}
