{"patent_id": "10-2020-0060686", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0038288", "출원번호": "10-2020-0060686", "발명의 명칭": "인공지능 칩 테스트 방법, 장치, 기기 및 저장매체", "출원인": "베이징 바이두 넷컴 사이언스 테크놀로지 컴퍼니", "발명자": "구오, 지유"}}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "목표 인공지능 칩이 복수의 동일한 연산유닛을 구비하는 인공지능 칩 테스트 방법에 있어서,목표 인공지능 칩의 규모 정보를 획득하는 단계;상기 규모 정보에 따라 상기 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단하는 단계;연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정되면, 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하고, 각각의 상기 연산유닛 어레이에 대해 각각 테스트 가능성 설계(Design for Test, DFT) 테스트를 수행하는 단계;연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정되면, 각각의 상기 연산유닛에 대해 각각 DFT테스트를 수행하는 단계를 포함하는 것을 특징으로 하는 인공지능 칩 테스트 방법."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 규모 정보는 연산유닛 중의 트랜지스터 규모를 포함하고, 상기 규모 정보에 따라 상기 목표 인공지능 칩이연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단하는 단계는,상기 트랜지스터 규모가 소정 규모 임계값보다 작은지 여부를 판단하는 단계;상기 트랜지스터 규모가 소정 규모 임계값보다 작은 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을만족하는 것으로 결정하는 단계;상기 트랜지스터 규모가 상기 소정 규모 임계값 이상인 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하는 단계는,상기 트랜지스터 규모와 연산유닛의 총량에 따라 상기 연산유닛 어레이 중의 연산 유닛 수량을 결정하는 단계;상기 연산유닛 수량에 따라 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하는 단계를 포함하는 것을특징으로 하는 방법."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,각각의 상기 연산유닛 어레이에 각각 제1 테스트 논리 회로가 설치되어 있고;상기 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하는 단계는,상기 연산유닛 어레이에 대응되는 제1 테스트 벡터를 생성하되, 각각의 상기 연산유닛 어레이에 대응되는 제1테스트 벡터는 동일한 단계;공개특허 10-2021-0038288-3-상기 제1 테스트 벡터를 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 논리 회로에 각각 입력하여, 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하는 단계;각각의 상기 연산유닛 어레이에 대응되는 테스트 결과를 출력하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 제1 테스트 논리 회로는 제1 테스트 인터페이스를 포함하고;상기 제1 테스트 벡터를 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 논리 회로에 각각 입력하여, 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하는 단계는,상기 제1 테스트 벡터를 각각의 제1 테스트 인터페이스를 통해 대응되는 연산유닛 어레이의 제1 테스트 논리 회로로 브로드캐스트하여, 각각의 연산유닛 어레이에 대해 병행으로 DFT 테스트를 수행하는 단계를 포함하는 것을특징으로 하는 방법."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,각각의 상기 연산유닛에 제2 테스트 논리 회로가 각각 설치되어 있고;상기 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하는 단계는,상기 연산유닛에 대응되는 제2 테스트 벡터를 생성하되; 각각의 상기 연산유닛에 대응되는 제2 테스트 벡터는동일한 단계;상기 제2 테스트 벡터를 각각의 상기 연산유닛에 대응되는 제2 테스트 논리 회로에 각각 입력하여, 각각의 상기연산유닛에 대해 각각 DFT 테스트를 수행하는 단계;각각의 상기 연산유닛에 대응되는 테스트 결과를 출력하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 제2 테스트 논리 회로는 제2 테스트 인터페이스를 포함하고;상기 제2 테스트 벡터를 각각의 상기 연산유닛에 대응되는 제2 테스트 논리 회로에 각각 입력하여, 각각의 상기연산유닛에 대해 각각 DFT 테스트를 수행하는 단계는,상기 제2 테스트 벡터를 각각의 제2 테스트 인터페이스를 통해 대응되는 연산유닛의 제2 테스트 논리 회로로 브로드캐스트하여, 각각의 연산유닛에 대해 병행으로 DFT 테스트를 수행하는 단계를 포함하는 것을 특징으로 하는방법."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 4 항에 있어서,상기 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하는 단계 이전에,상기 목표 인공지능 칩의 레지스터 트랜시퍼 레벨(register-transfer level, RTL) 단계에서 상기 제1 테스트 논리 회로 중의 적어도 하나의 제1 소정 DFT 논리 회로에 대해 테스트를 수행하는 단계;상기 제1 소정 DFT 논리 회로가 테스트를 통과하지 못하면, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제1 소공개특허 10-2021-0038288-4-정 DFT 논리 회로에 대해 복구를 수행하는 단계를 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서,상기 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하는 단계 이전에,상기 목표 인공지능 칩의 RTL 단계에서 상기 제2 테스트 논리 회로 중의 적어도 하나의 제2 소정 DFT 논리 회로에 대해 테스트를 수행하는 단계;상기 제2 소정 DFT 논리 회로가 테스트를 통과하지 못하면, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제2 소정 DFT 논리 회로에 대해 복구를 수행하는 단계를 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "목표 인공지능 칩이 복수의 동일한 연산유닛을 구비하는 인공지능 칩 테스트 장치에 있어서,목표 인공지능 칩의 규모 정보를 획득하는 규모 정보 획득 모듈;상기 규모 정보에 따라 상기 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단하는 테스트 조건 판단 모듈;연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정되면, 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하고, 각각의 상기 연산유닛 어레이에 대해 각각 테스트 가능성 설계(Design for Test, DFT) 테스트를 수행하는 어레이 테스트 모듈;연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정되면, 각각의 상기 연산유닛에 대해 각각 DFT테스트를 수행하는 연산유닛 테스트 모듈을 포함하는 것을 특징으로 하는 인공지능 칩 테스트 장치."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 규모 정보는 연산유닛 중의 트랜지스터 규모를 포함하고, 상기 테스트 조건 판단 모듈은 구체적으로,상기 트랜지스터 규모가 소정 규모 임계값보다 작은지 여부를 판단하고; 상기 트랜지스터 규모가 소정 규모 임계값보다 작은 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정하고; 상기 트랜지스터 규모가 상기 소정 규모 임계값 이상인 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 어레이 테스트 모듈이 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할할 때 구체적으로,상기 트랜지스터 규모와 연산유닛의 총량에 따라 상기 연산유닛 어레이 중의 연산 유닛 수량을 결정하고; 상기연산유닛 수량에 따라 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 10 항에 있어서,공개특허 10-2021-0038288-5-각각의 상기 연산유닛 어레이에 각각 제1 테스트 논리 회로가 설치되어 있고;상기 어레이 테스트 모듈이 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 때 구체적으로,상기 연산유닛 어레이에 대응되는 제1 테스트 벡터를 생성하되; 각각의 상기 연산유닛 어레이에 대응되는 제1테스트 벡터는 동일하고; 상기 제1 테스트 벡터를 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 논리 회로에 각각 입력하여, 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하고; 각각의 상기 연산유닛어레이에 대응되는 테스트 결과를 출력하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 제1 테스트 논리 회로는 제1 테스트 인터페이스를 포함하고;상기 어레이 테스트 모듈이 상기 제1 테스트 벡터를 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 논리회로에 입력하여, 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 때 구체적으로,상기 제1 테스트 벡터를 각각의 제1 테스트 인터페이스를 통해 대응되는 연산유닛 어레이의 제1 테스트 논리 회로로 브로드캐스트하여, 각각의 연산유닛 어레이에 대해 병행으로 DFT 테스트를 수행하는 것을 특징으로 하는장치."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 10 항에 있어서,각각의 상기 연산유닛에 각각 제2 테스트 논리 회로가 설치되어 있고;상기 연산유닛 테스트 모듈이 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행할 때 구체적으로,상기 연산유닛에 대응되는 제2 테스트 벡터를 생성하되; 각각의 상기 연산유닛에 대응되는 제2 테스트 벡터는동일하고; 상기 제2 테스트 벡터를 각각의 상기 연산유닛에 대응되는 제2 테스트 논리 회로에 각각 입력하여,각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하고; 각각의 상기 연산유닛에 대응되는 테스트 결과를 출력하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 제2 테스트 논리 회로는 제2 테스트 인터페이스를 포함하고;상기 연산유닛 테스트 모듈이 상기 제2 테스트 벡터를 각각의 상기 연산유닛에 대응되는 제2 테스트 논리 회로에 각각 입력하여, 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행할 때 구체적으로,상기 제2 테스트 벡터를 각가의 제2 테스트 인터페이스를 통해 대응되는 연산유닛의 제2 테스트 논리 회로로 브로드캐스트하여, 각각의 연산유닛에 대해 병행으로 DFT 테스트를 수행하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 13 항에 있어서,상기 목표 인공지능 칩의 RTL 단계에서 상기 제1 테스트 논리 회로 중의 적어도 하나의 제1 소정 DFT 논리 회로에 대해 테스트를 수행하고; 만약 상기 제1 소정 DFT 논리 회로가 테스트를 통과하지 못하면, 상기 목표 인공지능 칩의 레지스터 트랜시퍼 레벨(register-transfer level, RTL) 단계에서 상기 제1 소정 DFT 논리 회로에 대해 복구를 수행하는 제1 회로 테스트 복구 모듈을 더 포함하는 것을 특징으로 하는 장치.공개특허 10-2021-0038288-6-청구항 18 제 15 항에 있어서,상기 목표 인공지능 칩의 RTL 단계에서 상기 제2 테스트 논리 회로 중의 적어도 하나의 제2 소정 DFT 논리 회로에 대해 테스트를 수행하고; 만약 상기 제2 소정 DFT 논리 회로가 테스트를 통과하지 못하면, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제2 소정 DFT 논리 회로에 복구를 수행하는 제2 회로 테스트 복구 모듈을 더 포함하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결된 메모리;를 포함하되,상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제9항 중 어느 한 항에 따른 방법을 수행할 수 있도록 하는 것을 특징으로 하는 전자기기."}
{"patent_id": "10-2020-0060686", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장매체에 있어서,상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제9중 어느 한 항에 따른 방법을 수행하도록 하는 것을 특징으로하는 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장매체."}
{"patent_id": "10-2020-0060686", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 인공지능 칩 테스트 방법, 장치, 기기 및 저장매체를 개시하며, 인공지능 분야에 관한 것이다. 구체적 인 구현형태에 따르면, 목표 인공지능 칩이 복수의 동일한 연산유닛을 구비하고, 상기 방법은, 목표 인공지능 칩 의 규모 정보를 획득하는 단계; 규모 정보에 따라 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 (뒷면에 계속)"}
{"patent_id": "10-2020-0060686", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 데이터 처리 기술분야에 관한 것으로서, 특히는 인공지능 기술에 관한 것이다."}
{"patent_id": "10-2020-0060686", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 기술이 성숙됨에 따라, 인공지능 칩(AI 칩으로 약칭)도 신속한 발전을 거두었다. 규모화 생산에서 불 합격 AI 칩을 어떻게 신속히 걸러내어, AI 칩의 테스트 주기 및 비용을 줄이는 것은 점점 중요해지고 있으며, 이러한 것들은 모두 테스트 가능성 설계（영어: Design for Test, DFT로 약칭）를 벗어날 수 없다. 종래기술에서, AI 칩에 대해 DFT 테스트를 수행할 때, 여전히 통상적인 칩의 테스트 방식을 사용하고 있으며, 통상적인 칩은 일반적으로 대형 이종 IP 코어를 구비하므로, 통상적인 칩의 DFT 테스트는 일반적으로 칩 레벨 또는 대형 이종 IP 코어 상에서 왼성되며, 이것도 역시 통상적인 칩의 테스트 시간을 증가시킨다. 반면, AI 칩 은 통상적인 칩과 서로 다른 구조를 구비한다. AI 칩에는 대량의 동일한 AI 연산유닛이 구비되어 AI 알고리즘을 처리하고, 대량의 동일한 AI 연산유닛은 전체 AI 칩의 핵심이며, 또한 AI 칩의 사이즈가 거대하다. 따라서, 종래기술에서 사용하는 통상적인 칩의 테스트 방식은, AI 칩에 적용될 수 없으며, 통상적인 칩의 테스 트 방식을 사용하여 AI 칩의 테스트를 수행할 경우, AI 칩의 테스트 시간, 비용과 테스트 전력 소모가 늘어나고, AI 칩의 테스트 효율이 떨어진다."}
{"patent_id": "10-2020-0060686", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원의 실시예는 종래기술에서 사용하는 통상적인 칩의 테스트 방식이 AI 칩에 적용될 수 없으며, 통상적인 칩의 테스트 방식을 사용하여 AI 칩의 테스트를 수행할 경우, AI 칩의 테스트 시간, 비용과 테스트 전력 소모가 늘어나고, AI 칩의 테스트 효율이 떨어지는 기술적 문제를 해결하기 위한 인공지능 칩 테스트 방법, 장치, 기기 및 저장매체를 제공한다."}
{"patent_id": "10-2020-0060686", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 실시예의 제1 측면에서 제공하는 목표 인공지능 칩이 복수의 동일한 연산유닛을 구비하는 인공지능 칩 테스트 방법에 있어서, 상기 방법은, 목표 인공지능 칩의 규모 정보를 획득하는 단계; 상기 규모 정보에 따라 상기 목표 인공지능 칩이 연산유닛 어 레이 레벨의 테스트 조건 만족 여부를 판단하는 단계; 만약 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정되면, 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하고, 각각의 상기 연산유닛 어레이에 대해 각각 테스트 가능성 설계(DFT) 테스트를 수행하는 단계; 만약 연산유닛 어레이 레벨의 테스트 조건을 만족 하지 않는 것으로 결정되면, 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하는 단계를 포함한다. 나아가, 상술한 방법에 따르면, 상기 규모 정보는 연산유닛 중의 트랜지스터 규모를 포함하고, 상기 규모 정보 에 따라 상기 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단하는 단계는, 상기 트랜지스터 규모가 소정 규모 임계값보다 작은지 여부를 판단하는 단계; 만약 상기 트랜지스터 규모가 소 정 규모 임계값보다 작은 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정하는 단계; 만약 상기 트랜지스터 규모가 상기 소정 규모 임계값 이상인 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정하는 단계를 포함한다. 나아가, 상술한 방법에 따르면, 상기 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하는 단계는, 상기 트랜지스터 규모와 연산유닛의 총량에 따라 상기 연산유닛 어레이 중의 연산 유닛 수량을 결정하는 단계; 상기 연산유닛 수량에 따라 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하는 단계를 포함한다. 나아가, 상술한 방법에 따르면, 각각의 상기 연산유닛 어레이에 각각 제1 테스트 논리 회로가 설치되어 있고; 상기 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하는 단계는, 상기 연산유닛 어레이에 대응되는 제1 테스트 벡터를 생성하되, 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 벡터는 동일한 단계; 상기 제1 테스트 벡터를 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 논리 회로에 각각 입력하여, 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하는 단계; 각각의 상기 연 산유닛 어레이에 대응되는 테스트 결과를 출력하는 단계를 포함한다. 나아가, 상술한 방법에 따르면, 상기 제1 테스트 논리 회로는 제1 테스트 인터페이스를 포함하고; 상기 제1 테스트 벡터를 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 논리 회로에 각각 입력하여, 각각 의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하는 단계는, 상기 제1 테스트 벡터를 각각의 제1 테스트 인터페이스를 통해 대응되는 연산유닛 어레이의 제1 테스트 논리 회 로로 브로드캐스트하여, 각각의 연산유닛 어레이에 대해 병행으로 DFT 테스트를 수행하는 단계를 포함한다. 나아가, 상술한 방법에 따르면, 각각의 상기 연산유닛에 제2 테스트 논리 회로가 각각 설치되어 있고; 상기 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하는 단계는, 상기 연산유닛에 대응되는 제2 테스트 벡터를 생성하되; 각각의 상기 연산유닛에 대응되는 제2 테스트 벡터는 동일한 단계; 상기 제2 테스트 벡터를 각각의 상기 연산유닛에 대응되는 제2 테스트 논리 회로에 각각 입력하여, 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하는 단계; 각각의 상기 연산유닛에 대응되는 테스트 결과를 출력하는 단계를 포함한다. 나아가, 상술한 방법에 따르면, 상기 제2 테스트 논리 회로는 제2 테스트 인터페이스를 포함하고; 상기 제2 테스트 벡터를 각각의 상기 연산유닛에 대응되는 제2 테스트 논리 회로에 각각 입력하여, 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하는 단계는,상기 제2 테스트 벡터를 각각의 제2 테스트 인터페이스를 통해 대응되는 연산유닛의 제2 테스트 논리 회로로 브 로드캐스트하여, 각각의 연산유닛에 대해 병행으로 DFT 테스트를 수행하는 단계를 포함한다. 나아가, 상술한 방법에 따르면, 상기 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하는 단계 이 전에, 상기 목표 인공지능 칩의 레지스터 트랜시퍼 레벨(register-transfer level, RTL) 단계에서 상기 제1 테스트 논 리 회로 중의 적어도 하나의 제1 소정 DFT 논리 회로에 대해 테스트를 수행하는 단계; 만약 상기 제1 소정 DFT 논리 회로가 테스트를 통과하지 못하면, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제1 소정 DFT 논리 회로에 대해 복구를 수행하는 단계를 더 포함한다. 나아가, 상술한 방법에 따르면, 상기 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하는 단계 이전에, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제2 테스트 논리 회로 중의 적어도 하나의 제2 소정 DFT 논리 회로 에 대해 테스트를 수행하는 단계; 만약 상기 제2 소정 DFT 논리 회로가 테스트를 통과하지 못하면, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제2 소정 DFT 논리 회로에 대해 복구를 수행하는 단계를 더 포함한다. 본 출원의 실시예의 제2 측면에서 제공하는 목표 인공지능 칩이 복수의 동일한 연산유닛을 구비하는 인공지능 칩 테스트 장치에 있어서, 상기 장치는, 목표 인공지능 칩의 규모 정보를 획득하는 규모 정보 획득 모듈; 상기 규모 정보에 따라 상기 목표 인공지능 칩 이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단하는 테스트 조건 판단 모듈; 만약 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정되면, 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하고, 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하는 어레이 테스트 모듈; 만약 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정되면, 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하 는 연산유닛 테스트 모듈을 포함한다. 나아가, 상술한 장치에 따르면, 상기 규모 정보는 연산유닛 중의 트랜지스터 규모를 포함하고, 상기 테스트 조건 판단 모듈은 구체적으로, 상기 트랜지스터 규모가 소정 규모 임계값보다 작은지 여부를 판단하고; 만약 상기 트랜지스터 규모가 소정 규 모 임계값보다 작은 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정하고; 만약 상기 트랜지스터 규모가 상기 소정 규모 임계값 이상인 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건 을 만족하지 않는 것으로 결정한다. 나아가, 상술한 장치에 따르면, 상기 어레이 테스트 모듈이 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할할 때 구체적으로, 상기 트랜지스터 규모와 연산유닛의 총량에 따라 상기 연산유닛 어레이 중의 연산 유닛 수량을 결정하고; 상기 연산유닛 수량에 따라 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할한다. 나아가, 상술한 방법에 따르면, 각각의 상기 연산유닛 어레이에 각각 제1 테스트 논리 회로가 설치되어 있고; 상기 어레이 테스트 모듈이 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 때 구체적으로, 상기 연산유닛 어레이에 대응되는 제1 테스트 벡터를 생성하되; 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 벡터는 동일하고; 상기 제1 테스트 벡터를 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 논리 회 로에 각각 입력하여, 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하고; 각각의 상기 연산유닛 어레이에 대응되는 테스트 결과를 출력한다. 나아가, 상술한 방법에 따르면, 상기 제1 테스트 논리 회로는 제1 테스트 인터페이스를 포함하고; 상기 어레이 테스트 모듈이 상기 제1 테스트 벡터를 각각의 상기 연산유닛 어레이에 대응되는 제1 테스트 논리 회로에 입력하여, 각각의 상기 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 때 구체적으로, 상기 제1 테스트 벡터를 각각의 제1 테스트 인터페이스를 통해 대응되는 연산유닛 어레이의 제1 테스트 논리 회 로로 브로드캐스트하여, 각각의 연산유닛 어레이에 대해 병행으로 DFT 테스트를 수행한다. 나아가, 상술한 방법에 따르면, 각각의 상기 연산유닛에 각각 제2 테스트 논리 회로가 설치되어 있고; 상기 연산유닛 테스트 모듈이 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행할 때 구체적으로, 상기 연산유닛에 대응되는 제2 테스트 벡터를 생성하되; 각각의 상기 연산유닛에 대응되는 제2 테스트 벡터는 동일하고; 상기 제2 테스트 벡터를 각각의 상기 연산유닛에 대응되는 제2 테스트 논리 회로에 각각 입력하여, 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행하고; 각각의 상기 연산유닛에 대응되는 테스트 결과를 출 력한다. 나아가, 상술한 방법에 따르면, 상기 제2 테스트 논리 회로는 제2 테스트 인터페이스를 포함하고; 상기 연산유닛 테스트 모듈이 상기 제2 테스트 벡터를 각각의 상기 연산유닛에 대응되는 제2 테스트 논리 회로 에 각각 입력하여, 각각의 상기 연산유닛에 대해 각각 DFT 테스트를 수행할 때 구체적으로, 상기 제2 테스트 벡터를 각가의 제2 테스트 인터페이스를 통해 대응되는 연산유닛의 제2 테스트 논리 회로로 브 로드캐스트하여, 각각의 연산유닛에 대해 병행으로 DFT 테스트를 수행한다. 나아가, 상술한 방법에 따르면, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제1 테스트 논리 회로 중의 적어도 하나의 제1 소정 DFT 논리 회로에 대해 테스트를 수행하고; 만약 상기 제1 소정 DFT 논리 회로가 테스트를 통과 하지 못하면, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제1 소정 DFT 논리 회로에 대해 복구를 수행하는 제1 회로 테스트 복구 모듈을 더 포함한다. 나아가, 상술한 방법에 따르면, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제2 테스트 논리 회로 중의 적어도 하나의 제2 소정 DFT 논리 회로에 대해 테스트를 수행하고; 만약 상기 제2 소정 DFT 논리 회로가 테스트를 통과 하지 못하면, 상기 목표 인공지능 칩의 RTL 단계에서 상기 제2 소정 DFT 논리 회로에 복구를 수행하는 제2 회로 테스트 복구 모듈을 더 포함한다. 본 출원의 실시예의 제3 측면에서 제공하는 전자기기는 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세 서와 통신 연결된 메모리;를 포함하되, 여기서, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어, 상기 명령이 상기 적어도 하 나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1측면의 어느 하나에 따른 방법을 수행할 수 있도록 한다. 본 출원의 실시예의 제4 측면에서 제공하는 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장매체에 있 어서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제9중 어느 한 항에 따른 방법을 수행하도록 한다. 본 출원의 실시예의 제5 측면에서 제공하는 컴퓨터 프로그램은 프로그램 코드를 포함하고, 컴퓨터가 상기 컴퓨 터 프로그램을 실행할 때, 상기 프로그램 코드는 제1 측면에 따른 방법을 수행한다."}
{"patent_id": "10-2020-0060686", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 실시예에 있어서, 인공지능 칩의 동일한 연산유닛 어레이 또는 연산유닛에 대해 각각 테스트를 수행 하므로, 각각의 연산유닛 어레이 또는 연산유닛의 테스트 논리 회로와 테스트 벡터는 완전히 동일하다. 테스트 비용을 절감시킨다. 또한 각각의 연산유닛 또는 연산유닛 어레이 중의 트랜지스터의 규모가 모두 매우 작으므로, 테스트 벡터의 규모도 매우 작으며, 이에 따라 테스트 시간을 대폭 줄이고, 테스트 효율을 향상시킨 다. 또한 각각의 연산유닛 또는 연산유닛 어레이의 DFT를 로딩하는데 필요한 메모리 컴퓨팅 저장 리소스도 대폭 감소되며, 테스트 전력 소모를 대폭 절감시킨다. 본 출원의 실시예에 있어서, 트랜지스터 규모가 소정 규모 임계값보다 작은지 여부를 판단하고, 만약 트랜지스 터 규모가 소정 규모 임계값보다 작은 것으로 결정되면, 각각의 연산유닛의 사이즈가 특별히 작은 것을 의미하 므로, 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정하고, 복수의 연산유닛을 모아 연산유닛 어 레이를 구성함으로써, 연산유닛 어레이 레벨의 테스트를 수행할 수 있다. 만약 트랜지스터 규모가 소정 규모 임 계값 이상인 것으로 결정되면, 각각의 연산유닛의 사이즈가 상대적으로 크다는 것을 의미하므로, 연산유닛 어레 이 레벨의 테스트 조건을 만족하지 않고, 연산유닛 레벨의 테스트 조건을 만족하는 것으로 결정하고, 연산유닛 레벨의 테스트를 수행한다. 연산유닛 어레이 또는 연산유닛의 사이즈가 모두 단독 테스트의 요구를 만족시키도 록 할 수 있으며, 테스트 시간을 더욱 감소시킨다. 본 출원의 실시예에 있어서, 트랜지스터 규모와 연산유닛의 총량에 따라 모든 연산유닛을 복수의 동일한 연산유 닛 어레이로 분할하여, 인공지능 칩 중의 연산유닛이 동일한 연산유닛 어레이로 균일하게 분할되도록 할 수 있 고, 또한 각각의 연산유닛 어레이의 사이즈가 지나치게 크지 않도록 할 수 있고, 단독 테스트의 요구를 만족시 킬 수 있으며, 이에 따라 테스트 시간을 줄일 수 있다. 본 출원의 실시예에 있어서, 각각의 연산유닛 어레이에 제1 테스트 논리 회로가 설치되어 있고, 동일한 제1 테 스트 벡터를 사용하여 각각의 연산유닛 어레이에 대해 각각 테스트를 수행하고, 테스트 결과를 출력하며, 각각 의 연산유닛 어레이의 제1 테스트 논리 회로와 제1 테스트 벡터가 완전히 동일하므로, 테스트 비용을 대폭 절감 시킨다. 본 출원의 실시예에 있어서, 제1 테스트 논리 회로는 제1 테스트 인터페이스를 포함하고, 전자기기는 각각의 제 1 테스트 인터페이스를 통해 제1 테스트 벡터를 대응되는 연산유닛 어레이의 제1 테스트 논리 회로로 브로드캐 스트한다. 동시에 병행으로 각각의 연산유닛 어레이에 대해 DFT 테스트를 수행할 수 있다. 상술한 내용의 기초 상에서, AI 칩에 대한 테스트 시간이 단일 연산유닛 어레이의 테스트 시간에 달하도록 하여, 테스트 시간을 더 욱 대폭 줄인다. 본 출원의 실시예에 있어서, 각각의 연산유닛에 제2 테스트 논리 회로가 설치되어 있고, 동일한 제2 테스트 벡 터를 사용하여 각각의 연산유닛 어레이에 대해 각각 테스트를 수행하고, 테스트 결과를 출력하며, 각각의 연산 유닛의 제2 테스트 논리 회로와 제2 테스트 벡터가 완전히 동일하므로, 테스트 비용을 대폭 절감시킨다. 본 출원의 실시예에 있어서, 제2 테스트 논리 회로는 제2 테스트 인터페이스를 포함하고, 전자기기는 각각의 제 2 테스트 인터페이스를 통해 제2 테스트 벡터를 대응되는 연산유닛의 제2 테스트 논리 회로로 브로드캐스트한다. 동시에 병행으로 각각의 연산유닛에 대해 DFT 테스트를 수행할 수 있다. 상술한 내용의 기초 상에서, AI 칩에 대한 테스트 시간이 단일 연산유닛의 테스트 시간에 달하도록 하여, 테스트 시간을 더욱 대폭 줄인다. 본 출원의 실시예에 있어서, 연산유닛 어레이의 DFT 중의 제1 테스트 논리 회로의 일부 제1 소정 DFT 논리 회로 는 목표 인공지능 칩의 RTL단계에서 설계 및 테스트하여, 보다 일찍 상응하는 테스트를 완성할 수 있으며, 전체 AI 칩이 완성될 때까지 대기한 후에 설계 및 테스트를 시작할 필요가 없다. 또한, 만약 제1 소정 DFT 논리 회로 가 테스트를 통과하지 못하여, 제1 소정 DFT 논리 회로에 대해 변경하고, 변경된 후의 제1 소정 DFT 논리 회로 의 테스트를 다시 수행할 때, 반복 과정이 DFT 배치 및 테스트 벡터 생성 사이에 지속적으로 수행될 필요 없이, 테스트 벡터를 수행하기 전에 계속하여 테스트를 수행할 수 있으므로, 이러한 지속적인 반복으로 인한 테스트 시간의 낭비를 방지한다. 제1 소정 DFT 논리 회로에 대한 테스트 및 복구 시간을 효과적으로 절감시킬 수 있다. 본 출원의 실시예에 있어서, 연산유닛의 DFT 중의 제2 테스트 논리 회로의 일부 제2 소정 DFT 논리 회로는 목표 인공지능 칩의 RTL단계에서 설계 및 테스트하여, 보다 일찍 상응하는 테스트를 완성할 수 있으며, 전체 AI 칩이 완성될 때까지 대기한 후에 설계 및 테스트를 시작할 필요가 없다. 또한, 만약 제2 소정 DFT 논리 회로가 테스 트를 통과하지 못하여, 제2 소정 DFT 논리 회로에 대해 변경하고, 변경된 후의 제2 소정 DFT 논리 회로의 테스 트를 다시 수행할 때, 반복 과정이 DFT 배치 및 테스트 벡터 생성 사이에 지속적으로 수행될 필요 없이, 테스트 벡터를 수행하기 전에 계속하여 테스트를 수행할 수 있으므로, 이러한 지속적인 반복으로 인한 테스트 시간의 낭비를 방지한다. 제2 소정 DFT 논리 회로에 대한 테스트 및 복구 시간을 효과적으로 절감시킬 수 있다."}
{"patent_id": "10-2020-0060686", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면을 참조하여 본 출원의 예시적인 실시예에 대해 설명한다. 여기서, 이해를 돕기 위해 본 출원의 실시예에 따른 여러 세부 내용을 포함하며, 이러한 것들은 단지 예시적인 것으로 간주되어야 한다. 따라 서, 본 분야의 당업자라면, 여기에 기재된 실시예에 대해 다양한 변경 및 변경을 진행할 수 있으며, 본 출원의 범위와 정신을 벗어나지 않는 것으로 이해하여야 한다. 마찬가지로, 명확성과 간략성을 위하여, 이하의 기재에 서 공지 기능 및 구조에 대한 설명을 생략한다. 본 출원의 기술적 해결수단을 명확하게 이해할 수 있도록, 이하에서는 종래기술 및 본 출원에 따른 용어에 대해 해석한다. 인공지능 칩: AI 가속기 또는 컴퓨팅 카드라고도 불리며, 즉 전문적으로 인공지능 응용에서의 대량의 계산 임무 를 처리하기 위한 모듈이다. 기타 비 컴퓨팅 임무는 여전히 CPU에 의해 완성되며, AI 칩은 주로 GPU, FPGA, ASIC 등으로 나뉜다. AI 칩에서 알고리즘 논리 유닛은 전체 AI 칩의 핵심으로서, 일반적으로 전체 AI 칩에서 매 우 높은 비율을 점용한다. 한편, AI 알고리즘 논리 유닛은 일반적으로 동일한 연산유닛으로 이루어진다. 또한, AI 칩은 사이즈가 거대하여, AI 칩에서 대량의 동일한 연산유닛을 구비한다. 통상적인 칩: 통상적인 칩은 일반적으로 복수의 대형 이종 IP 코어를 구비한다. 예컨대, 전력 소모 제어 모듈, 통신 인터페이스 모듈, 비디오 분석 모듈 등이 있다. 테스트 가능성 설계:（영어: Design for Test, DFT로 약칭）, 집적회로 설계기술로서, 주요 임무는 논리, 치환 소자를 증가하고 핀을 증가하는 등의 방법을 통해 특정 테스트 논리 회로를 설계하며, 동시에 테스트되는 회로 의 구조에 대해 조정하여, 회로의 테스트 가능성, 즉 제어 가능성과 관찰 가능성을 향상시키는 것이다. 설계 단 계에서 이러한 구조를 추가함으로써 비록 회로의 복잡 정도가 향상되지만, 비용이 증가되는 것 같지만, 일반적 으로 테스트 단계에서 더 많은 시간과 비용을 절약할 수 있다. 본 출원의 기술적 해결수단을 명확하게 이해할 수 있도록, 우선 종래기술에 따른 AI 칩 테스트 방법에 대해 상 세하게 설명한다. 종래기술에서 AI 칩에 대해 DFT 테스트를 수행할 때, 일반적으로 칩 레벨 테스트로서, 칩 레 벨 테스트를 수행할 때, 테스트 기기가 한꺼번에 얼마의 연산유닛이 직렬 연결되어 형성된 스캔 체인을 테스트 할지는 제한되어 있으므로, 우선 AI 칩의 연산유닛 사이에 하나 하나의 스캔 체인을 삽입하고, 각각의 스캔 체 인으로 연결된 연산유닛의 개수는 서로 다르다. 그 후에 각각의 스캔 체인 상에 테스트 논리 회로를 설치하고, 각각의 스캔 체인에 대응되는 테스트 벡터를 생성하며, 각각의 스캔 체인에 대응되는 테스트 논리 회로와 테스 트 벡터도 서로 다르다. 테스트 기기가 각각의 스캔 체인 상에 대응되는 테스트 벡터를 AI 칩으로 발송하여, 대 응되는 스캔 체인의 테스트 논리 회로로 입력함으로써, 해당 스캔 체인 상의 연산유닛 테스트를 완성한다. 각각 의 스캔 체인 상의 연산유닛이 많으므로, 테스트 벡터의 규모는 일반적으로 매우 크고, 테스트 시간이 매우 길 며, 또한 각각의 스캔 체인 상의 테스트 논리 회로가 모두 서로 다르며, 테스트 벡터도 서로 다르므로, 테스트비용이 증가된다. 전체 DFT를 로딩하는데 필요한 메모리 컴퓨팅 저장 리소스도 커지고, 테스트 전력 소모도 제 약을 받는다. AI 칩의 구조는 통상적인 칩과 다른 바, AI 칩은 사이즈가 거대하고, 또한 대량의 동일한 연산유닛을 포함한다. 대량의 동일한 연산유닛은 AI 칩의 주요 비율을 점용한다. 따라서, AI 칩의 구조적 특징을 이용하여, 종래기술 에서 AI 칩 테스트 방법에 대한 기술적 문제에 대하여, 본 출원의 실시예에 따른 AI 칩 테스트 방법을 개시한다. 이하, 본 출원의 실시예에 따른 인공지능 칩 테스트 방법의 응용 나리오에 대해 설명. 도1에 도시된 바와 같이, 본 출원의 실시예에 따른 인공지능 칩 테스트 방법에 대응되는 응용 나리오는 전자기기와 목표 인공지능 칩을 포함한다. 전자기기는 테스트 기기일 수 있다. 전자기기는 목표 인공지능 칩과 통신을 수행할 수 있다. 목표 인 공지능 칩의 규모 정보를 획득할 수 있다. 목표 인공지능 칩이 복수의 동일한 연산유닛을 구비하므로, 규모 정 보에 따라 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단할 수 있으며, 만약 연산 유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정되면, 모든 연산유닛을 복수의 동일한 연산유닛 어레이 로 분할하고, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행한다. 만약 연산유닛 어레이 레벨의 테스 트 조건을 만족하지 않는 것으로 결정되면, 각각의 연산유닛에 대해 각각 DFT 테스트를 수행한다. 인공지능 칩 의 DFT 테스트를 완성한다. 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행한 후, 연산유닛 어레이 각 각의 테스트 결과를 결정한다. 또는 각걱우ㅏ 연산유닛에 대해 각각 DFT 테스트를 수행한 후, 연산유닛 각각의 테스트 결과를 결정한다. 테스트를 통과되지 못한 연산유닛 어레이 또는 연산유닛에 대해 복구를 수행한다. 인 공지능 칩의 동일한 연산유닛 어레이 또는 연산유닛에 대해 각각 테스트를 수행하므로, 각각의 연산유닛 어레이 또는 연산유닛의 테스트 논리 회로와 테스트 벡터는 완전히 동일하다. 테스트 비용을 절감시킨다. 또한 각각의 연산유닛 또는 연산유닛 어레이 중의 트랜지스터의 규모가 모두 매우 작으므로, 테스트 벡터의 규모도 매우 작 으며, 이에 따라 테스트 시간을 대폭 줄이고, 테스트 효율을 향상시킨다. 또한 각각의 연산유닛 또는 연산유닛 어레이의 DFT를 로딩하는데 필요한 메모리 컴퓨팅 저장 리소스도 대폭 감소되며, 테스트 전력 소모를 대폭 절감 시킨다. 이하, 도면을 참조하여 본 출원의 실시예에 대해 구체적으로 설명한다. 실시예 1 도2는 본 출원의 제1 실시예에 따른 인공지능 칩 테스트 방법의 흐름도이다. 도2에 도시된 바와 같이, 본 출원 의 실시예에 따른 수행 주체는 인공지능 칩 테스트 장치이고, 상기 인공지능 칩 테스트 장치는 전자기기에 집적 될 수 있고, 전자기기는 테스트 기기일 수 있다. 본 실시예에 따른 인공지능 칩 테스트 방법은 아래의 몇몇 단 계를 포함한다. 단계 101, 목표 인공지능 칩의 규모 정보를 획득한다. 본 실시예에서, 목표 인공지능 칩은 테스트가 필요한 인공지능 칩이다. 목표 인공지능 칩은 복수의 동일한 연산 유닛을 포함한다. 본 실시예에서, 목표 인공지능 칩의 설계 초기에, 목표 인공지능 칩의 규모 정보를 저장장치에 저장할 수 있다. 상기 저장장치는 컴퓨터, USB 플래시 디스크, 자기 디스크 등의 장치일 수 있고, 저장장치에 액세스하여 목표 인공지능 칩의 규모 정보를 획득한다. 여기서, 규모 정보는 연산유닛의 총 수량, 각각의 연산유닛 중의 트랜지스터의 규모 등을 포함할 수 있다. 여기서, 연산유닛 중의 트랜지스터는 반도체 소자로서, 연산유닛의 기본 구성 블록이다. 단계 102, 규모 정보에 따라 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단한다. 일 선택 가능한 실시형태로서, 본 실시예에서, 연산유닛의 총 수량에 따라 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단할 수 있다. 만약 연산유닛의 총 수량이 보다 적으면, 각각의 연산유닛에 대해 각각 DFT 테스트를 수행할 수 있으며, 이에 따라 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정한다. 만약 연산유닛의 총 수량이 보다 많으면, 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으 로 결정한다. 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 수 있다. 여기서, 연산유닛 총 수량의 다소를 결정할 때, 연산유닛의 총 수량과 소정 개수 임계값을 비교하는 방식으로 결정할 수 있다. 만약 연산유닛의 총 수량이 소정 개수 임계값보다 작으면, 연산유닛의 총 수량이 보다 적은 것으로 결정한다. 만약 연산유닛의 총 수량이 소정 개수 임계값 이상이면, 연산유닛의 총 수량이 보다 많은 것으 로 결정한다. 다른 일 선택 가능한 실시형태로서, 본 실시예에서, 연산유닛 중의 트랜지스터 규모에 따라 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단할 수도 있다. 만약 트랜지스터 규모가 소정 규모 임계값 보다 작은 것으로 결정되면, 각각의 연산유닛의 사이즈가 작은 것을 의미하므로, 연산유닛 어레이 레벨의 테스 트 조건을 만족하는 것으로 결정하고, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 수 있다. 만약 트랜지스터 규모가 소정 규모 임계값 이상인 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정하고, 각각의 연산유닛에 대해 각각 DFT 테스트를 수행할 수 있다. 규모 정보에 따라 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단하는 것은 기타 방 식일 수도 있음을 이해할 수 있으며, 본 실시예에서는 이에 대해 한정하지 않는다. 단계 103, 만약 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정되면, 모든 연산유닛을 복수의 동 일한 연산유닛 어레이로 분할하고, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행한다. 본 실시예에서, 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할할 때, 연산유닛의 총 수량에 따라 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할할 수 있다. 즉, 각각의 연산유닛 어레이에 포함된 연산유닛 의 개수가 동일하다. 또는 기타 방식을 사용하여 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하며, 본 실시예에서는 이에 대해 한정하지 않는다. 도3에 도시된 바와 같이, 도3에서 64개의 연산유닛을 포함하고, 연산유닛을 16개의 연산유닛 어레이로 분할하였 으며, 각각의 연산유닛 어레이는 4개의 연산유닛을 포함한다. 도3에서 표기된 4개의 연산유닛은 하나의 연산유 닛 어레이이다. 본 실시예에서, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 때, 각각의 연산유닛 어레이에 테스 트 논리 회로를 설치하여야 하며, 테스트 논리 회로는 스캔 체인을 포함하고, 스캔 체인은 연산유닛 어레이에 삽입된다. 또한 연산유닛 어레이의 테스트 벡터를 생성하여, 각각의 연산유닛 어레이에 대한 DFT 테스트를 완성 할 수 있다. 각각의 연산유닛 어레이는 동일하므로, 설치된 테스트 논리 회로와 스캔 체인, 및 생성된 테스트 벡터는 모두 동일하다. 특별히 설명하면, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 때, 하나의 연산유닛 어레이가 DFT 테스트를 완성한 후에, 다른 하나의 연산유닛 어레이의 테스트를 수행할 수 있다. 또는 연산유닛 어레이를 서로 다른 그룹으로 나누어, 하나의 그룹의 연산유닛 어레이에서 병행으로 DFT 테스트를 완성한 후에, 다른 하나의 그룹의 연산유닛 어레이의 병행 DFT 테스트를 완성할 수 있다. 또는 모든 연산유닛 어레이가 동시에 병행으로 DFT 테스트를 수행하는 것도 가능하며, 본 실시예에서는 이에 대해 한정하지 않는다. 단계 104, 만약 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정되면, 각각의 연산유닛에 대 해 각각 DFT 테스트를 수행한다. 본 실시예에서, 만약 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정되면, 연산유닛 레벨의 테스트 조건을 만족하는 것을 의미하므로, 각각의 연산유닛에 대해 각각 DFT 테스트를 수행한다. 각각의 연산유닛에 대해 각각 DFT 테스트를 수행할 때, 각각의 연산유닛에 테스트 논리 회로를 설치하여야 하며, 테스트 논리 회로는 스캔 체인을 포함하고, 스캔 체인은 연산유닛에 삽입된다. 또한 연산유닛의 테스트 벡터를 생성하여, 각각의 연산유닛에 대한 DFT 테스트를 완성할 수 있다. 본 실시예에서, 각각의 연산유닛은 동일하므로, 연산유닛에 대해 설치한 테스트 논리 회로와 스캔 체인, 및 생 성된 테스트 벡터는 모두 동일하다. 마찬가지로, 각각의 연산유닛에 대해 각각 DFT 테스트를 수행할 때, 하나의 연산유닛에서 DFT 테스트를 완성한 후에, 다른 하나의 연산유닛의 테스트를 수행할 수 있다. 또는 모든 연산유닛에서 동시에 병행으로 DFT 테스트 를 수행할 수도 있으며, 본 실시예에서는 이에 대해 한정하지 않는다. 연산유닛 어레이에 대응되는 테스트 논리 회로와 연산유닛에 대응되는 테스트 논리 회로는 서로 다르다는 것을 이해할 수 있다. 연산유닛 어레이에 대응되는 테스트 벡터와 연산유닛에 대응되는 테스트 벡터도 서로 다르다.본 실시예에 따른 인공지능 칩 테스트 방법은, 목표 인공지능 칩의 규모 정보를 획득하고; 규모 정보에 따라 목 표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단하고; 만약 연산유닛 어레이 레벨의 테 스트 조건을 만족하는 것으로 결정되면, 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하고, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하고; 만약 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않 는 것으로 결정되면, 각각의 연산유닛에 대해 각각 DFT 테스트를 수행한다. 인공지능 칩의 동일한 연산유닛 어 레이 또는 연산유닛에 대해 각각 테스트를 수행하므로, 각각의 연산유닛 어레이 또는 연산유닛의 테스트 논리 회로와 테스트 벡터는 완전히 동일하다. 테스트 비용을 절감시킨다. 또한 각각의 연산유닛 또는 연산유닛 어레 이 중의 트랜지스터의 규모가 모두 매우 작으므로, 테스트 벡터의 규모도 매우 작으며, 이에 따라 테스트 시간 을 대폭 줄이고, 테스트 효율을 향상시킨다. 또한 각각의 연산유닛 또는 연산유닛 어레이의 DFT를 로딩하는데 필요한 메모리 컴퓨팅 저장 리소스도 대폭 감소되며, 테스트 전력 소모를 대폭 절감시킨다. 실시예 2 도4는 본 출원의 제2 실시예에 따른 인공지능 칩 테스트 방법의 흐름도이다. 도4에 도시된 바와 같이, 본 실시 예에 따른 인공지능 칩 테스트 방법은, 본 출원의 실시예 1에 따른 인공지능 칩 테스트 방법의 기초 상에서, 단 계 101-단계 104에 대해 보다 세분화한다. 본 실시예에 따른 인공지능 칩 테스트 방법은 아래의 단계를 포함한 다. 단계 201, 목표 인공지능 칩의 연산유닛 중의 트랜지스터 규모를 획득한다. 나아가, 본 실시예에서, 인공지능 칩 중의 연산유닛의 트랜지스터 규모를 직접 획득하여, 트랜지스터 규모에 따 라 연산유닛 어레이 레벨을 수행할지 연산유닛 레벨의 테스트를 수행할 지 결정한다. 단계 202, 트랜지스터 규모가 소정 규모 임계값보다 작은지 여부를 판단하고, 만약 작으면 단계 203를 수행하고, 아니면 단계 205를 수행한다. 여기서, 소정 규모 임계값의 수치에 대해 한정하지 않으며, 복수 회의 테스트를 통해 소정 규모 임계값을 결정 할 수 있다. 본 실시예에서, 트랜지스터 규모가 소정 규모 임계값보다 작은지 여부를 판단하고, 만약 트랜지스터 규모가 소 정 규모 임계값보다 작은 것으로 결정되면, 각각의 연산유닛의 사이즈가 특별히 작은 것을 의미하므로, 연산유 닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정하고, 복수의 연산유닛을 모아 연산유닛 어레이를 구성함 으로써, 연산유닛 어레이 레벨의 테스트를 수행할 수 있다. 만약 트랜지스터 규모가 소정 규모 임계값 이상인 것으로 결정되면, 각각의 연산유닛의 사이즈가 상대적으로 크다는 것을 의미하므로, 연산유닛 어레이 레벨의 테 스트 조건을 만족하지 않고, 연산유닛 레벨의 테스트 조건을 만족하는 것으로 결정하고, 연산유닛 레벨의 테스 트를 수행한다. 본 실시예에서, 연산유닛 중의 트랜지스터 규모가 소정 규모 임계값보다 작은지 여부의 방식을 사용하여 연산유 닛 어레이의 테스트 조건 만족 여부를 판단하여, 연산유닛 어레이 또는 연산유닛의 사이즈가 모두 단독 테스트 의 요구를 만족시키도록 할 수 있으며, 테스트 시간을 더욱 감소시킨다. 단계 203, 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할한다. 일 선택 가능한 실시형태로서, 도5에 도시된 바와 같이, 단계 203은 아래의 단계를 포함한다. 단계 2031, 트랜지스터 규모와 연산유닛의 총량에 따라 연산유닛 어레이 중의 연산 유닛 수량을 결정한다. 나아가, 본 실시예에서, 우선 연산유닛의 총량에 따라 모든 연산유닛이 분할되어 구성될 수 있는 연산유닛 어레 이의 후보 수량을 결정한다. 즉, 연산유닛 어레이의 후보 수량은 연산유닛의 수량으로 나누어 떨어진다. 그 후 에 연산유닛의 트랜지스터 규모에 따라 연산유닛 어레이의 후보 수량으로부터 최종적으로 연산유닛 어레이의 수 량을 결정한다. 연산유닛의 트랜지스터 규모에 따라 연산유닛 어레이의 후보 수량으로부터 최종적으로 연산유닛 어레이의 수량 을 결정할 때, 각각의 연산유닛 어레이 중의 총 트랜지스터 규모가 소정 최대 규모값보다 작도록 확보하여야 한 다. 각각의 연산유닛 어레이 중의 총 트랜지스터 규모가 지나치게 크지 않도록 한다. 여기서, 소정 최대 규모값이 소정 규모 임계값보다 크지만, 구체적인 수치에 대해 한정하지 않는다. 복수의 테 스트를 거쳐 설정할 수 있다. 단계 2032, 연산유닛 수량에 따라 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할한다. 본 실시예에서, 각각의 연산유닛 어레이에 포함된 연산유닛 수량에 따라 모든 연산유닛을 복수의 동일한 연산유 닛 어레이로 분할한다. 하나의 영역 부근의 복수의 연산유닛을 하나의 연산유닛 어레이로 분할할 수 있다. 본 실시예에서, 트랜지스터 규모와 연산유닛의 총량에 따라 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하여, 인공지능 칩 중의 연산유닛이 동일한 연산유닛 어레이로 균일하게 분할되도록 할 수 있고, 또한 각각 의 연산유닛 어레이의 사이즈가 지나치게 크지 않도록 할 수 있고, 단독 테스트의 요구를 만족시킬 수 있으며, 이에 따라 테스트 시간을 줄일 수 있다. 단계 204, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행한다. 여기서, 도6에 도시된 바와 같이, 각각의 연산유닛 어레이에 각각 제1 테스트 논리 회로가 설치되어 있다. 제1 테스트 논리 회로는 연산유닛 어레이에 대해 테스트를 수행하는 테스트 논리 회로이다. 제1 테스트 논리 회로는 제1 테스트 인터페이스, 제1 제어 논리 회로, 적어도 하나의 제1 레지스터, 제1 스캔 체인 등을 포함할 수 있다. 제1 테스트 논리 회로는 대응되는 연산유닛 어레이와 연결된다. 제1 스캔 체인은 연산유닛 어레이 중의 각각의 연산유닛을 연결시킬 수 있다. 일 선택 가능한 실시형태로서, 도7에 도시된 바와 같이, 본 실시예에서, 단계 204는 아래의 단계를 포함한다. 단계 2041, 연산유닛 어레이에 대응되는 제1 테스트 벡터를 생성한다. 여기서, 연산유닛 어레이에 대응되는 테스트 벡터는 제1 테스트 벡터이고, 각각의 연산유닛 어레이에 대응되는 제1 테스트 벡터는 동일하다. 본 실시예에서, 각각의 연산유닛 어레이가 완성해야 하는 각각의 기능과 제1 테스트 논리 회로에 따라 제1 테스 트 벡터를 생성할 수 있다. 제1 테스트 벡터가 각각의 연산유닛 어레이에 대해 전면적인 테스트를 수행할 수 있 도록 하여, 최적 테스트 커버율을 구현한다. 단계 2042, 제1 테스트 벡터를 각각의 연산유닛 어레이에 대응되는 제1 테스트 논리 회로에 각각 입력하여, 각 각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행한다. 일 선택 가능한 실시형태로서, 본 실시예에서, 단계 2042는 구체적으로, 제1 테스트 벡터를 각각의 제1 테스트 인터페이스를 통해 대응되는 연산유닛 어레이의 제1 테스트 논리 회로로 브로드캐스트하여, 각각의 연산유닛 어레이에 대해 병행으로 DFT 테스트를 수행한다. 본 실시예에서, 도8에 도시된 바와 같이, 전자기기와 AI 칩 사이에 공유 버스를 설치할 수 있으며, 공유 버스는 각각의 제1 테스트 인터페이스에 각각 연결된다. 구체적으로 각각의 연산유닛 어레이에 대해 DFT 테스트를 수행 할 때, 제1 클럭에서 공유 버스를 통해 정확한 데이터를 각각의 제1 테스트 인터페이스에 대응되는 연산유닛 어 레이 중의 제1 테스트 논리 회로의 제1 레지스터로 브로드캐스트할 수 있다. 제2 클럭에서 공유 버스를 통해 제 1 테스트 벡터를 공유 버스로 발송한 후에, 각각의 제1 테스트 인터페이스를 통해 대응되는 연산유닛 어레이의 제1 테스트 논리 회로로 브로드캐스트할 수 있으며, 각각의 연산유닛 어레이의 제1 테스트 논리 회로는 병행으 로 상기 제1 테스트 벡터에 대해 처리한 후, 각각의 테스트 데이터를 각각 획득하고, 각각의 테스트 데이터와 대응되는 정확한 데이터를 비교하며, 만약 테스트 데이터와 대응되는 정확한 데이터가 일치하면, 상기 연산유닛 어레이가 DFT 테스트를 통과한 것으로 결정하고, 아니면 상기 연산유닛 어레이가 DFT 테스트를 통과하지 못한 것으로 결정한다. 본 실시예에서, 제1 테스트 논리 회로는 제1 테스트 인터페이스를 포함하고, 전자기기는 각각의 제1 테스트 인 터페이스를 통해 제1 테스트 벡터를 대응되는 연산유닛 어레이의 제1 테스트 논리 회로로 브로드캐스트한다. 동 시에 병행으로 각각의 연산유닛 어레이에 대해 DFT 테스트를 수행할 수 있다. 상술한 내용의 기초 상에서, AI 칩에 대한 테스트 시간이 단일 연산유닛 어레이의 테스트 시간에 달하도록 하여, 테스트 시간을 더욱 대폭 줄인 다. 단계 2043, 각각의 연산유닛 어레이에 대응되는 테스트 결과를 출력한다. 본 실시예에서, 제1 테스트 논리 회로는 제1 출력 인터페이스를 더 포함하여, 대응되는 연산유닛 어레이에 대응 되는 테스트 결과를 출력할 수 있다. 테스트 결과는 테스트 통과 여부를 포함할 수 있으며, 만약 테스트를 통과하지 못하면, 테스트 데이터를 더 포함하여, 상기 연산유닛 어레이의 고장에 대해 진단을 수행할 수 있다. 단계 205, 각각의 연산유닛에 대해 각각 DFT 테스트를 수행한다. 여기서, 도9에 도시된 바와 같이, 각각의 연산유닛에 제2 테스트 논리 회로가 각각 설치되어 있다. 제2 테스트 논리 회로는 바로 연산유닛에 대해 테스트를 수행하는 테스트 논리 회로이다. 제2 테스트 논리 회로는 제2 테스 트 인터페이스, 제2 제어 논리 회로, 적어도 하나의 제2 레지스터, 제2 스캔 체인 등을 포함할 수 있다. 제2 테 스트 논리 회로는 대응되는 연산유닛에 연결된다. 제2 스캔 체인은 연산유닛 중의 트랜지스터를 연결시킬 수 있 다. 일 선택 가능한 실시형태로서, 도10에 도시된 바와 같이, 단계 205는 아래의 단계를 포함한다. 단계 2051, 연산유닛에 대응되는 제2 테스트 벡터를 생성한다. 여기서, 연산유닛에 대응되는 테스트 벡터는 제2 테스트 벡터이고, 각각의 연산유닛에 대응되는 제2 테스트 벡 터는 동일하다. 본 실시예에서, 각각의 연산유닛이 완성해야 할 각각의 기능과 제2 테스트 논리 회로에 따라 제2 테스트 벡터를 생성할 수 있다. 제2 테스트 벡터가 각각의 연산유닛에 대해 전면적인 테스트를 수행할 수 있도록 하여, 최적 테스트 커버율을 구현한다. 단계 2052, 제2 테스트 벡터를 각각의 연산유닛에 대응되는 제2 테스트 논리 회로로 각각 입력하여, 각각의 연 산유닛에 대해 각각 DFT 테스트를 수행한다. 일 선택 가능한 실시형태로서, 본 실시예에서, 단계 2052는 구체적으로, 제2 테스트 벡터를 각각의 제2 테스트 인터페이스를 통해 대응되는 연산유닛의 제2 테스트 논리 회로로 브로드 캐스트하여, 각각의 연산유닛에 대해 병행으로 DFT 테스트를 수행한다. 본 실시예에서, 도11에 도시된 바와 같이, 전자기기와 AI 칩 사이에 공유 버스를 설치할 수 있으며, 공유 버스 는 각각의 제2 테스트 인터페이스에 각각 연결된다. 구체적으로 각각의 연산유닛에 대해 DFT 테스트를 수행할 때, 제1 클럭에서 공유 버스를 통해 정확한 데이터를 각각의 제2 테스트 인터페이스에 대응되는 연산유닛 중의 제2 테스트 논리 회로의 제2 레지스터에 브로드캐스트할 수 있다. 제2 클럭에서 공유 버스를 통해 제2 테스트 벡터를 공유 버스에 발송한 후에, 각각의 제2 테스트 인터페이스를 통해 대응되는 연산유닛의 제2 테스트 논리 회로에 브로드캐스트할 수 있으며, 각각의 연산유닛의 제2 테스트 논리 회로는 상기 제2 테스트 벡터에 대해 병 행으로 처리한 후에, 각각의 테스트 데이터를 각각 획득하고, 각각의 테스트 데이터를 대응되는 정확한 데이터 와 비교하며, 만약 테스트 데이터가 대응되는 정확한 데이터와 일치하면, 상기 연산유닛이 DFT 테스트를 통과한 것으로 결정하고, 아니면 상기 연산유닛이 DFT 테스트를 통과하지 못한 것으로 결정한다. 본 실시예에서, 제2 테스트 논리 회로는 제2 테스트 인터페이스를 포함하고, 전자기기는 각각의 제2 테스트 인 터페이스를 통해 제2 테스트 벡터를 대응되는 연산유닛의 제2 테스트 논리 회로로 브로드캐스트한다. 동시에 각 각의 연산유닛에 대해 병행으로 DFT 테스트를 수행할 수 있다. 상술한 내용의 기초 상에서, AI 칩에 대한 테스 트 시간이 단일 연산유닛 어레이의 테스트 시간에 달하도록 하여, 테스트 시간을 더욱 대폭 줄인다. 단계 2053, 각각의 연산유닛에 대응되는 테스트 결과를 출력한다. 본 실시예에서, 제2 테스트 논리 회로는 제2 출력 인터페이스를 더 포함하여, 대응되는 연산유닛에 대응되는 테 스트 결과를 출력할 수 있다. 테스트 결과는 테스트 통과 여부를 포함할 수 있으며, 만약 테스트를 통과하지 못 하면, 테스트 데이터를 더 포함하여, 상기 연산유닛의 고장에 대해 진단을 수행할 수 있다. 도12의 윗 부분에 도시된 바와 같이, 종래기술에 따르면, AI 칩에 대해 DFT 테스트를 수행할 때, AI 칩이 설계 완료되고, AI 칩의 기능에 대해 검증 통과된 후, AI 칩의 종합 단계에서 수행된다. AI 칩에 대한 DFT 테스트는 전체 AI 칩이 완성된 후에 수행될 수 있으므로, AI 칩의 테스트는 AI 칩의 전체 과정의 보다 후에 수행되며, AI 칩에 대한 테스트 시간이 지연된다. 또한 만약 AI 칩에 대해 기능 업데이트를 수행하면, AI 칩에 대한 DFT 테스 트도 다시 수행되어야 한다. 따라서 DFT 테스트 주기는 전체 AI 칩 설계 개발 행정의 제약을 받게 된다. 또한 전체 AI 칩에 대해 DFT 설계를 수행할 때, DFT 배치 및 테스트 벡터 생성 사이는 지속적으로 반복되어야만, 최 적 테스트 커버율을 구현할 수 있다. 반복 과정은 전체 AI 칩 레벨에서 수행되어야 하므로, 이러한 반복은 대량 의 시간을 소모하게 된다.따라서 본 실시예에서, 도12에서 아래 부분에 도시된 바와 같이, 만약 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하면, 단계 204 이전에, 목표 인공지능 칩의 RTL 단계에서 제1 테스트 논리 회로 중의 적어도 하나의 제1 소정 DFT 논리 회로에 대해 테 스트를 수행하는 단계를 더 포함한다. 만약 제1 소정 DFT 논리 회로가 테스트를 통과하지 못하면, 목표 인공지 능 칩의 RTL 단계에서 상기 제1 소정 DFT 논리 회로에 대해 복구를 수행한다. 여기서, 제1 소정 DFT 논리 회로는 테스트 프로토콜 내부 공동 테스트 활동 그룹(Internal Joint Test Action Group, IJTAG) 논리 회로, 메모리 빌트인 셀프 테스트 회로 및 경계 스캔 스캔 회로, 클럭 온 칩 컨트롤러, 트 리거의 제어 불가 비동기 설치／리셋 회로, 트리거의 스캔 가능성을 위한 클럭 분석 회로, 메모리를 둘러싸고 테스트를 수행하는 제어 논리 회로, IJTAG 네트워크의 스캔 테스트를 위한 제어 논리 회로 등을 포함할 수 있다. 구체적으로, 본 실시예에서, 인공지능 칩 중의 연산유닛의 기능 설계는 일반적으로 칩 설계의 초기에 이미 안정 될 수 있으므로, 상응하는 연산유닛 어레이의 DFT 중의 제1 테스트 논리 회로의 일부 제1 소정 DFT 논리 회로는 목표 인공지능 칩의 RTL 단계에서 설계 및 테스트하여, 보다 일찍 상응하는 테스트를 완성할 수 있으며, 전체 AI 칩이 완성될 때까지 대기한 후에 설계 및 테스트를 시작할 필요가 없다. 본 실시예에서, 목표 인공지능 칩의 RTL 단계에서 각각의 제1 소정 DFT 논리 회로에 대해 테스트하는 방법이 종 래기술에 따른 종합 단계에서 각각의 제1 소정 DFT 논리 회로에 대해 테스트하는 방법과의 다른 점은, 만약 제1 소정 DFT 논리 회로가 테스트를 통과하지 못하여, 제1 소정 DFT 논리 회로에 대해 변경하고, 변경된 후의 제1 소정 DFT 논리 회로의 테스트를 다시 수행할 때, 반복 과정이 DFT 배치 및 테스트 벡터 생성 사이에 지속적으로 수행될 필요 없이, 테스트 벡터를 수행하기 전에 계속하여 테스트를 수행할 수 있으므로, 이러한 지속적인 반복 으로 인한 테스트 시간의 낭비를 방지한다. 도12 중의 상하 두 부분을 비교하면, 제1 소정 DFT 논리 회로에 대 한 테스트 및 복구 시간이 종래기술에 따른 테스트 및 복구 시간에 비해 현저히 작음을 확인할 수 있다. 마찬가지로, 만약 각각의 연산유닛에 대해 각각 DFT 테스트를 수행한다면, 단계 205 이전에, 목표 인공지능 칩의 RTL 단계에서 제2 테스트 논리 회로 중의 적어도 하나의 제2 소정 DFT 논리 회로에 대해 테 스트를 수행하는 단계를 더 포함한다. 제2 소정 DFT 논리 회로가 테스트를 통과하지 못하면, 목표 인공지능 칩 의 RTL 단계에서 상기 제2 소정 DFT 논리 회로에 대해 복구를 수행한다. 여기서, 제2 소정 DFT 논리 회로도 테스트 프로토콜 IJTAG 논리 회로, 메모리 빌트인 셀프 테스트 회로 및 경계 스캔 스캔 회로, 클럭 온 칩 컨트롤러, 트리거의 제어 불가 비동기 설치／리셋 회로, 트리거의 스캔 가능성을 위한 클럭 분석 회로, 메모리를 둘러싸고 테스트를 수행하는 제어 논리 회로, IJTAG 네트워크의 스캔 테스트를 위한 제어 논리 회로 등을 포함할 수 있다. 구체적으로, 본 실시예에서, 인공지능 칩 중의 연산유닛의 기능 설계는 일반적으로 칩 설계의 초기에 이미 안정 될 수 있으므로, 상응하는 연산유닛의 DFT 중의 제2 테스트 논리 회로의 일부 제2 소정 DFT 논리 회로는 목표 인공지능 칩의 RTL 단계에서 설계 및 테스트하여, 보다 일찍 상응하는 테스트를 완성할 수 있으며, 전체 AI 칩 이 완성될 때까지 대기한 후에 설계 및 테스트를 시작할 필요가 없다. 여기서, 제2 소정 DFT 논리 회로에 대한 테스트와 복구의 원리는 연산유닛 어레이 중의 제1 소정 DFT 논리 회로 에 대해 테스트 및 복구하는 원리와 유사하므로, 여기서 그 중복되는 설명을 생략한다. 본 실시예에서, 제1 소정 DFT 논리 회로와 제2 소정 DFT 논리 회로는 목표 인공지능 칩의 RTL 단계에서 설계 및 테스트하여, 보다 일찍 상응하는 테스트를 완성할 수 있으며, 전체 AI 칩이 완성될 때까지 대기한 후에 설계 및 테스트를 시작할 필요가 없다. 또한 만약 제1 소정 DFT 논리 회로 또는 제2 소정 DFT 논리 회로가 테스트를 통 과하지 못하면, 제1 소정 DFT 논리 회로 또는 제2 소정 DFT 논리 회로에 대해 변경하고, 변경된 후의 제1 소정 DFT 논리 회로 또는 제2 소정 DFT 논리 회로의 테스트를 다시 수행할 때, 반복 과정이 DFT 배치 및 테스트 벡터 생성 사이에 지속적으로 수행될 필요 없이, 테스트 벡터를 수행하기 전에 계속하여 테스트를 수행할 수 있으므 로, 이러한 지속적인 반복으로 인한 테스트 시간의 낭비를 방지한다. 제1 소정 DFT 논리 회로와 제2 소정 DFT 논리 회로의 테스트 및 복구 시간을 효과적으로 절감시킬 수 있다. 특별히 설명하면, 도1, 도3, 도6, 도8 - 도9 및 도11 중의 각각의 블랙 블록은 모두 연산유닛이다. 실시예 3 도13은 본 출원의 제3 실시예에 따른 인공지능 칩 테스트 장치의 구조를 나타내는 도면이다. 도13에 도시된 바 와 같이, 본 실시예에 따른 인공지능 칩 테스트 장치는 전자기기에 위치된다. 목표 인공지능 칩이 복수의 동일 한 연산유닛을 구비할 경우, 상기 인공지능 칩 테스트 장치는 규모 정보 획득 모듈, 테스트 조건 판단 모듈, 어레이 테스트 모듈 및 연산유닛 테스트 모듈을 포함한다. 여기서, 규모 정보 획득 모듈은 목표 인공지능 칩의 규모 정보를 획득한다. 테스트 조건 판단 모듈(130 2)은 규모 정보에 따라 목표 인공지능 칩이 연산유닛 어레이 레벨의 테스트 조건 만족 여부를 판단한다. 어레이 테스트 모듈은 만약 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정되면, 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할하고, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행한다. 연산 유닛 테스트 모듈은 만약 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으로 결정되면, 각각의 연산유닛에 대해 각각 DFT 테스트를 수행한다. 본 실시예에 따른 인공지능 칩 테스트 장치는 도2에 도시된 방법 실시예의 기술방안을 수행할 수 있으며, 그 구 현 원리와 기술적 효과는 도2에 도시된 방법 실시예와 유사하므로, 여기서는 그 중복되는 설명을 생략한다. 실시예 4 도14는 본 출원의 제4 실시예에 따른 인공지능 칩 테스트 장치의 구조를 나타내는 도면이다. 도14에 도시된 바 와 같이, 본 실시예에 따른 인공지능 칩 테스트 장치는 본 출원의 제3실시예에 따른 인공지능 칩 테스트 장치의 기초 상에서, 제1 회로 테스트 복구 모듈 및 제2 회로 테스트 복구 모듈을 더 포함한 다. 나아가, 규모 정보는 연산유닛 중의 트랜지스터 규모를 포함하고, 테스트 조건 판단 모듈은 구체적으로, 트랜지스터 규모가 소정 규모 임계값보다 작은지 여부를 판단하고; 만약 트랜지스터 규모가 소정 규모 임계값보 다 작은 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을 만족하는 것으로 결정하고; 만약 트랜지스터 규모가 소정 규모 임계값 이상인 것으로 결정되면, 연산유닛 어레이 레벨의 테스트 조건을 만족하지 않는 것으 로 결정한다. 나아가, 어레이 테스트 모듈은 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할할 때 구체적으로, 트랜지스터 규모와 연산유닛의 총량에 따라 연산유닛 어레이 중의 연산유닛 수량을 결정하고; 연산유닛 수량에 따라 모든 연산유닛을 복수의 동일한 연산유닛 어레이로 분할한다. 나아가, 각각의 연산유닛 어레이에 각각 제1 테스트 논리 회로가 설치되어 있다. 어레이 테스트 모듈은 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 때 구체적으로, 연산유닛 어레이에 대응되는 제1 테스트 벡터를 생성하되; 각각의 연산유닛 어레이에 대응되는 제1 테스트 벡터 는 동일하고; 제1 테스트 벡터를 각각의 연산유닛 어레이에 대응되는 제1 테스트 논리 회로에 각각 입력하여, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행하고; 각각의 연산유닛 어레이에 대응되는 테스트 결과 를 출력한다. 나아가, 제1 테스트 논리 회로는 제1 테스트 인터페이스를 포함한다. 어레이 테스트 모듈은 제1 테스트 벡터를 각각의 연산유닛 어레이에 대응되는 제1 테스트 논리 회로에 각 각 입력하여, 각각의 연산유닛 어레이에 대해 각각 DFT 테스트를 수행할 때 구체적으로, 제1 테스트 벡터를 각각의 제1 테스트 인터페이스를 통해 대응되는 연산유닛 어레이의 제1 테스트 논리 회로에 브로드캐스트하여, 각각의 연산유닛 어레이에 대해 병행으로 DFT 테스트를 수행한다. 나아가, 각각의 연산유닛에 제2 테스트 논리 회로가 각각 설치되어 있다. 연산유닛 테스트 모듈은 각각의 연산유닛에 대해 각각 DFT 테스트를 수행할 때 구체적으로, 연산유닛에 대응되는 제2 테스트 벡터를 생성하되; 각 연산유닛에 대응되는 제2 테스트 벡터는 동일하고; 제2 테스트 벡터를 각각의 연산유닛에 대응되는 제2 테스트 논리 회로에 각각 입력하여, 각각의 연산유닛에 대해 각 각 DFT 테스트를 수행하고; 각각의 연산유닛에 대응되는 테스트 결과를 출력한다. 나아가, 제2 테스트 논리 회로는 제2 테스트 인터페이스를 포함한다. 연산유닛 테스트 모듈은 제2 테스트 벡터를 각각의 연산유닛에 대응되는 제2 테스트 논리 회로에 각각 입 력하여, 각각의 연산유닛에 대해 각각 DFT 테스트를 수행할 때 구체적으로, 제2 테스트 벡터를 각 제2 테스트 인터페이스를 통해 대응되는 연산유닛의 제2 테스트 논리 회로로 브로드캐스 트하여, 각각의 연산유닛에 대해 병행으로 DFT 테스트를 수행한다. 나아가, 제1 회로 테스트 복구 모듈은 목표 인공지능 칩의RTL 단계에서 제1 테스트 논리 회로 중의 적어 도 하나의 제1 소정 DFT 논리 회로에 대해 테스트를 수행하고; 만약 제1 소정 DFT 논리 회로가 테스트를 통과하 지 못하면, 목표 인공지능 칩의 RTL 단계에서 상기 제1 소정 DFT 논리 회로에 대해 복구를 수행한다. 나아가, 제2 회로 테스트 복구 모듈은, 목표 인공지능 칩의RTL 단계에서 제2 테스트 논리 회로 중의 적어 도 하나의 제2 소정 DFT 논리 회로에 대해 테스트를 수행하고; 만약 제2 소정 DFT 논리 회로가 테스트를 통과하 지 못하면, 목표 인공지능 칩의 RTL 단계에서 상기 제2 소정 DFT 논리 회로에 대해 복구를 수행한다. 본 실시예에 따른 인공지능 칩 테스트 장치는 도4 - 도5, 도7, 도10에 도시된 방법 실시예의 기술적 해결수단을 수행할 수 있으며, 그 구현 원리와 기술적 효과는 도4 - 도5, 도7, 도10에 도시된 방법 실시예와 유사하므로, 여기서는 그 중복되는 설명을 생략한다. 본 출원의 실시예에 따르면, 본 출원은 전자기기와 판독 가능한 저장매체를 더 제공한다. 도15에 도시된 바와 같이, 본 출원의 실시예에 따른 인공지능 칩 테스트 방법의 전자기기의 블록도이다. 전자기 기는 다양한 형태의 디지털 컴퓨터, 예컨대, 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크벤치, 테스트 기기, 개인 휴대 단말, 서버, 블레이드 서버, 대형 컴퓨터, 및 기타 적합한 컴퓨터를 의미한다. 전자기기는 또한 다양한 형태의 모바일 장치, 예컨대, 개인 디지털 처리, 셀룰러 폰, 스마트폰, 웨어러블 기기와 기타 유사한 컴퓨팅 장치를 나 타낼 수 있다. 본 명세서에 개시된 부재, 이들의 연결과 관계, 및 이들의 기능은 예시적인 것일 뿐, 또한 본 명 세서에 기재된 및/또는 요구하는 본 출원의 구현을 한정하려는 의도는 아니다. 도15에 도시된 바와 같이, 상기 전자기기는 하나 또는 복수의 프로세서, 메모리, 및 각각의 부재를 연결하기 위한 인터페이스를 포함하되, 고속 인터페이스 및 저속 인터페이스를 포함한다. 각각의 부재는 서로 다른 버스를 사용하여 서로 연결되며, 공통 메인보드 상에 장착되거나 수요에 따라 기타 방식으로 장착될 수 있 다. 프로세서는 전자기기 내에서 실행되는 명령에 대해 처리할 수 있으며, 메모리 내부 또는 메모리 상에 저장 되어 외부 입력/출력 장치（예컨대, 인터페이스에 커플링되는 디스플레이 기기） 상에 GUI의 그래픽 정보를 표 시하는 명령을 포함한다. 기타 실시형태에서, 수요에 따라, 복수의 프로세서 및/또는 복수의 버스를 복수의 메 모리와 함께 사용할 수 있으며, 마찬가지로 복수의 전자기기를 연결하되, 각각의 기기가 부분 필요한 조작을 제 공할 수 있다（예를 들어, 서버 어레이, 한 세트의 블레이드 서버, 또는 멀티 프로세서 시스템으로서서）. 도15 는 하나의 프로세서를 예로 든다. 메모리는 바로 본 출원에서 제공하는 비일시적 컴퓨터 판독 가능한 저장매체이다. 여기서, 메모리에 적어 도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어, 적어도 하나의 프로세서가 본 출원에서 제공하는 인 공지능 칩 테스트 방법을 수행하도록 한다. 본 출원의 비일시적 컴퓨터 판독 가능한 저장매체는 컴퓨터 명령을 저장하고, 상기 컴퓨터 명령은 컴퓨터가 본 출원에서 제공하는 인공지능 칩 테스트 방법을 수행하도록 한다. 메모리는 비일시적 컴퓨터 판독 가능한 저장매체로서, 비일시적 소프트웨어 프로그램, 비일시적 컴퓨터 실행 가능 프로그램 및 모듈을 저장할 할 수 있으며, 예컨대 본 출원의 실시예에 따른 인공지능 칩 테스트 방법 에 대응되는 프로그램 명령/모듈（예를 들어, 도13에 도시된 규모 정보 획득 모듈, 테스트 조건 판단 모 듈, 어레이 테스트 모듈 및 연산유닛 테스트 모듈）을 들 수 있다. 프로세서는 메모리 에 저장된 비일시적 소프트웨어 프로그램, 명령 및 모듈을 실행하여, 서버의 다양한 기능 응용 및 데이터 처리를 수행하는 바, 즉 상술한 방법 실시예에 따른 인공지능 칩 테스트 방법을 구현한다. 메모리는 프로그램 저장 영역 및 데이터 저장 영역을 포함할 수 있다. 여기서, 프로그램 저장 영역은 운 영체제 적어도 하나의 기능에 필요한 응용 프로그램을 저장할 수 있고; 데이터 저장 영역은 도15에 따른 전자기 기의 사용에 따라 구성되는 데이터 등을 저장할 수 있다. 한편, 메모리는 고속 랜덤 액세스 메모리를 포 함할 수 있고, 비일시적 메모리도 포함할 수 있는 바, 예를 들어 적어도 하나의 자기 디스크 메모리 소자, 플래시 메모리 소자, 또는 기타 비일시적 솔리드 스테이트 메모리 소자를 들 수 있다. 일부 실시예에서, 메모리 는 선택적으로 프로세서에 대해 원격으로 설치된 메모리를 포함할 수 있으며, 이러한 원격 메모리 는 네트워크를 통해 도15의 전자기기에 연결될 수 있다. 상술한 네트워크의 실예는 인터넷, 인트라넷, 근거리 통신망, 이동 통신망 및 그 조합을 포함하지만 이에 한정되지 않는다. 도15의 전자기기는 입력장치와 출력장치를 더 포함할 수 있다. 프로세서, 메모리, 입 력장치 및 출력장치는 버스 또는 기타 방식을 통해 연결될 수 있으며, 도15는 버스를 통해 연결되 는 것을 예로 든다. 입력장치는 입력되는 음성, 숫자 또는 심볼 정보를 문자 부호 정보를 수신하고, 도15의 전자기기의 사용 자 설정 및 기능 제어와 관련된 키 신호 입력을 생성할 수 있으며, 예를 들어 터치 스크린, 키패드, 마우스, 트 랙패드, 터치패널, 지시레버, 하나 또는 복수의 마우스 버튼, 트랙볼, 조이스틱 등의 입력장치일 수 있다. 출력 장치는 음성 재생 장치, 디스플레이 장치, 보조 조명 장치（예를 들어, LED）와 촉각 패드백 장치（예를 들어, 진동 모터） 등을 포함할 수 있다. 상기 디스플레이 장치는 액정 디스플레이（LCD）, 발광 다이오드（LED ） 디스플레이 및 플라즈마 디스플레이를 포함할 수 있으나, 이에 한정되지 않는다. 일부 실시형태에서, 디스플 레이 장치는 터치 스크린일 수 있다. 여기에 기재된 시스템과 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 전용ASIC（전 용 집적 회로）, 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다양 한 실시형태는 하나 또는 복수의 컴퓨터 프로그램에서 실시되는 것을 포함할 수 있으며, 상기 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그래머블 프로세서를 포함하는 프로그래머블 시스템 상에서 실행 및/또는 해석될 수 있으며, 상기 프로그래머블 프로세서는 전용 또는 범용 프로그래머블 프로세서일 수 있고, 저장 시스 템, 적어도 하나의 입력장치, 및 적어도 하나의 출력장치로부터 데이터와 명령을 수신할 수 있으며, 또한 데이 터와 명령을 상기 저장 시스템, 상기 적어도 하나의 입력장치, 및 상기 적어도 하나의 출력장치로 전송한다. 이러한 컴퓨팅 프로그램（프로그램, 소프트웨어, 소프트웨어 애플레케이션, 또는 코드라고도 불림）은 프로그래 머블 프로세서의 기계 명령을 포함하고, 또한 고급 과정 및/또는 오브젝트에 대한 프로그래밍 언어, 및/또는 어 셈블리/기계 언어를 이용하여 이러한 컴퓨팅 프로그램을 실행할 수 있다. 본 명세섯에서 사용되는 용어 \"기계 판독 가능한 매체\" 및 \"컴퓨터 판독 가능한 매체\"는 기계 명령 및/또는 데이터를 프로그래머블 프로세서에 제공 하기 위한 임의의 컴퓨터 프로그램 제품, 기기, 및/또는 장치（예를 들어, 자기 디스크, 광 디스크, 메모리, 프 로그래머블 논리 장치（PLD））를 의미하며, 기계 판독 가능 신호인 기계 명령을 수신하는 기계 판독 가능한 매 체를 포함한다. 용어 \"기계 판독 가능한 신호\"는 기계 명령 및/또는 데이터를 프로그래머블 프로세서에 제공하 기 위한 임의의 신호를 의미한다. 사용자와의 인터랙션을 제공하기 위하여, 컴퓨터 상에서 여기에 기재된 시스템과 기술을 실시할 수 있으며, 상 기 컴퓨터는 사용자에게 정보를 표시하기 위한 표시 장치（예를 들어, CRT（음극선관） 또는 LCD（액정 디스플 레이） 모니터）; 및 키보드와 지향장치（예를 들어, 마우스 또는 트랙볼）를 포함할 수 있으며, 사용자는 상기 키보드와 상기 지향장치를 통해 입력을 컴퓨터에 제공할 수 있다. 기타 종류의 장치는 또한 사용자와의 인터랙 션을 제공할 수 있는 바; 예를 들어, 사용자에게 제공되는 피드백은 임의의 형태의 센싱 피드백（예를 들어, 시 각적 피백, 청각적 피드백, 또는 촉각적 피드백）일 수 있으며; 또한 임의의 형태（사운드 입력, 음성 입력 또 는, 촉각적 입력을 포함）로 사용자로부터의 입력을 수신할 수 있다. 여기에 기재된 시스템과 기술을 백그라운드 부재를 포함하는 컴퓨팅 시스템（예를 들어, 데이터 서버로서）, 또 는 중간 부재를 포함하는 컴퓨팅 시스템（예를 들어, 응용 서버）, 또는 프론트 엔드 부재를 포함하는 컴퓨팅 시스템（예를 들어, 그래픽 사용자 인터페이스 또는 네트워크 브라우저를 구비하는 사용자 컴퓨터, 사용자는 상 기 그래픽 사용자 인터페이스 또는 상기 네트워크 브라우저를 통해 여기에 기재된 시스템과 기술의 실시형태와 인터랙션할 수 있다）, 또는 이러한 백그라운드 부재, 중간 부재, 또는 프론트 엔드 부재를 포함하는 임의의 조 합의 컴퓨팅 시스템에서 실시할 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신（예를 들어, 통신 네트 워크）를 통해 시스템의 부재를 서로 연결시킬 수 있다. 통신 네트워크의 예시는 근거리 통신망（LAN）, 광역 통신망（WAN）과 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트와 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있으 며 또한 일반적으로 통신 네트워크를 통해 인터랙션을 수행한다. 상응하는 컴퓨터 상에서 실행되고 또한 서로 클라이언트 - 서버 관계를 구비하는 컴퓨터 프로그램을 통해 클라이언트와 서버의 관계를 생성한다.본 출원의 실시예에 따른 기술적 해결수단은, 인공지능 칩의 동일한 연산유닛 어레이 또는 연산유닛에 대해 각 각 테스트를 수행하고, 각각의 연산유닛 어레이 또는 연산유닛의 테스트 논리 회로와 테스트 벡터는 완전히 동 일하다. 테스트 비용을 절감시키고. 또한 각각의 연산유닛 또는 연산유닛 어레이 중의 트랜지스터의 규모가 모 두 매우 작고, 이에 따라 테스트 벡터의 규모도 매우 작으므로, 테스트 시간을 대폭 줄이며, 테스트 효율을 향 상시킨다. 또한 각각의 연산유닛 또는 연산유닛 어레이의 DFT를 로딩하는데 필요한 메모리 컴퓨팅 저장 리소스 도 대폭 감소되며, 테스트 전력 소모를 대폭 감소시킨다. 상술한 다양한 형태의 프로세스를 사용하여, 다시 순서를 배열, 단계를 추가 또는 삭제할 수 있는 것으로 이해 하여야 한다. 예를 들어, 본 출원에 기재된 각각의 단계는 병행으로 수행될 수 있고, 순차적으로 수행될 수도 있으며, 기타 순번으로 수행될 수 도 있으며, 본 출원에 개시된 기술적 해결수단에 원하는 결과를 구현할 수만 있다면, 본 명세서는 이에 대해 한정하지 않는다. 상술한 구체적인 실시형태는 본 출원의 보호범위에 대해 한정하지 않는다. 본 분야의 기술자는, 설계 요구와 기 타 요소에 따라 다양한 수정, 조합, 서브 조합 및 치환을 수행할 수 있다는 것을 이해하여야 한다. 임의의 본 출원의 정신 원칙 내에서 이루어진 수정, 동등한 치환 및 개선 등은 모두 본 출원의 보호 범위 내에 포함되어야 한다."}
{"patent_id": "10-2020-0060686", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부 도면은 본 해결수단을 보다 충분히 이해할 수 있도록 하기 위한 것으로, 본 출원에 대해 한정하지 않는다. 여기서, 도1은 본 출원의 실시예에 따른 인공지능 칩 테스트 방법을 구현할 수 있는 응용 시나리오를 나타내는 도면이다. 도2는 본 출원의 제1 실시예에 따른 인공지능 칩 테스트 방법의 흐름도이다. 도3은 본 출원의 제1 실시예에 따른 인공지능 칩 테스트 방법에서 분할된 연산유닛 어레이를 나타내는 도면이다. 도4는 본 출원의 제2 실시예에 따른 인공지능 칩 테스트 방법의 흐름도이다.도5는 본 출원의 제2 실시예에 따른 인공지능 칩 테스트 방법에서 단계의 흐름도이다. 도6은 본 출원의 제2 실시예에 따른 인공지능 칩 테스트 방법에서 연산유닛 어레이 테스트 구조를 나타내는 도 면이다. 도7은 본 출원의 제2 실시예에 따른 인공지능 칩 테스트 방법에서 단계의 흐름도이다. 도8은 본 출원의 제2 실시예에 따른 전자기기와 각 연산유닛 어레이 테스트 구조 사이의 구조를 나타내는 도면 이다. 도9는 본 출원의 제2 실시예에 따른 인공지능 칩 테스트 방법에서 연산유닛 테스트 구조를 나타내는 도면이다. 도10은 본 출원의 제2 실시예에 따른 인공지능 칩 테스트 방법에서 단계의 흐름도이다. 도11은 본 출원의 제2 실시예에 따른 전자기기와 각 연산유닛 테스트 구조 사이의 구조를 나타내는 도면이다. 도12는 종래기술 및 본 출원의 실시예에 따른 인공지능 칩 테스트 프로세스를 비교한 도면이다. 도13은 본 출원의 제3실시예에 따른 인공지능 칩 테스트 장치의 구조를 나타내는 도면이다. 도14는 본 출원의 제4 실시예에 따른 인공지능 칩 테스트 장치의 구조를 나타내는 도면이다. 도15는 본 출원의 실시예에 따른 인공지능 칩 테스트 방법을 구현하기 위한 전자기기를 나타내는 블록도이다."}
