{"patent_id": "10-2023-0004484", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0112466", "출원번호": "10-2023-0004484", "발명의 명칭": "스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템", "출원인": "농업회사법인 주식회사 솔오토메틱", "발명자": "감동규"}}
{"patent_id": "10-2023-0004484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "내부에 공간을 형성하는 거터본체부;상기 거터본체부의 상부에 구비되어, 작물의 성장을 지지하는 성장지지대부;상기 거터본체부의 상부에 구비되어, 상기 작물에 선택적으로 물을 공급하는 물배관부;상기 거터본체부의 상부에 구비되어, 상기 작물의 온도, 습도 데이터를 수집하는 데이터수집부;상기 물배관부의 일측에 구비되어, 상기 물배관부, 상기 데이터 수집부의 전원을 공급하는 전기배선관부;복수개의 긴 프레임으로 형성되어, 상기 거터본체부를 적층하는 거터지지용 프레임부;상기 거터지지용 프레임부의 일측에 구비되어, 상기 작물에 LED 빛을 조사하는 LED부;상기 작물의 성장환경에 따라 상기 물배관부, 상기 데이터 수집부, 상기 전기배선관부, 상기 LED부의 동작을 제어하는 제어부;상기 작물의 재배환경 및 성장 상태를 모니터링하는 모니터링부;를 포함하여 구성되는 것을 특징으로 하는 재배로봇용 적재형 행잉거터 시스템."}
{"patent_id": "10-2023-0004484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 성장지지대부는,메쉬망 구조로 형성되고,중심부를 기준으로 좌우 대칭을 이루면서, 일측이 기설정된 각도로 경사지도록 형성되어, 마름모꼴형을 형성하는 것을 특징으로 하는 재배로봇용 적재형 행잉거터 시스템."}
{"patent_id": "10-2023-0004484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 거터지지용 프레임부는,수직방향으로 복수개의 프레임이 직육면체 형상으로 구비되는 제 1지지프레임부;와 수평방향으로 상기 제 1지지프레임부의 길이방향을 따라 다수개 일정간격 이격설치되는 제 2지지프레임부;로 구성되어, 복수개의 상기 거터본체부를 상기 제 1지지프레임부의 길이방향을 따라 하나씩 적층하는 것을 특징으로하는 재배로봇용 적재형 행잉거터 시스템."}
{"patent_id": "10-2023-0004484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 거터지지용 프레임부로부터 일방향 돌출형성된 LED 지지대;가 더 구비되어, 상기 LED부를 견고하게 지지하는 것을 특징으로 하는 재배로봇용 적재형 행잉거터 시스템."}
{"patent_id": "10-2023-0004484", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2024-0112466-3-상기 모니터링부는,상기 데이터 수집부의 이상여부를 판단할 수 있는 고장진단부;를 더 포함하여 구성되고,상기 고장진단부는, 상기 데이터 수집부의 데이터를 분석하여 실시간 센서 데이터의 신뢰도를 판단하되, 하기[수학식 1]에 의해 산출되는 상기 데이터 수집부의 평균오차(Aerr)가 기설정된 한계오차(Serr)보다 큰 경우, 상기데이터 수집부가 고장난 것으로 판단하는 것을 특징으로 하는 재배로봇용 적재형 행잉거터 시스템.[수학식 1](여기서, Aerr은 평균오차, Taver는 상기 데이터 수집부 센서값의 전체평균, Paver는 상기 데이터 수집부 센서값 n개에 대한 일부평균, Tσ는 상기 데이터 수집부 센서값의 전체표준편차를 의미함)"}
{"patent_id": "10-2023-0004484", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시례에 따른 재배로봇용 적재형 행잉거터 시스템은, 내부에 공간을 형성하는 거터본체부, 상기 거터본체부의 상부에 구비되어, 작물의 성장을 지지하는 성장지지대부, 상기 거터본체부의 상부에 구비되어, 상 기 작물에 선택적으로 물을 공급하는 물배관부, 상기 거터본체부의 상부에 구비되어, 상기 작물의 온도, 습도 데 이터를 수집하는 데이터 수집부, 상기 물배관부의 일측에 구비되어, 상기 물배관부, 상기 데이터 수집부의 전원 을 공급하는 전기배선관부, 복수개의 긴 프레임으로 형성되어, 상기 거터본체부를 적층하는 거터지지용 프레임부, 상기 거터지지용 프레임부의 일측에 구비되어, 상기 작물에 LED 빛을 조사하는 LED부, 상기 작물의 성 장환경에 따라 상기 물배관부, 상기 데이터 수집부, 상기 전기배선관부, 상기 LED부의 동작을 제어하는 제어부, 상기 작물의 재배환경 및 성장 상태를 모니터링하는 모니터링부를 포함하여 구성되는 것을 특징으로 한다."}
{"patent_id": "10-2023-0004484", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 특용작물 분류상, 유료작물(油料作物)에 속하는 참깨, 들깨 등과 콩류 등을 스마트팜에서 로봇이 재 배할 수 있도록 고안된 행잉거터 시스템에 관한 것으로, 더욱 상세하게는 씨앗 곡물을 로봇으로 재배하기 위한 스마트팜용 행잉거터의 구조, 행잉거터의 적층형 프레임 구조, 수평형 구조, 그리고 스마트 관리를 위해 행잉거 터에 탑재되어 환경변수를 감지 및 제어하는 각종 센서, 비전으로 IoT 기반의 모니터링 시스템과 연동하여 배지 의 온도 및 습도 관리 및 제어, 양액기와 LED의 영양분을 공급, 작물의 생육과정을 자동화 및 실시간 모니터링, 그 주요자료의 D/B화로 곡물의 성장 발육 최적화를 구현 할 수 있는 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템에 관한 것이다."}
{"patent_id": "10-2023-0004484", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에는 기상이변에 영향을 받지 않고 지역적인 제한 없이 불모지 등에서도 연중 농산물 생산이 가능한 작물공 장이 개발되고 있는 실정이다. 일반적으로 작물 공장이라 함은 실내에서 작물의 생육환경(광, 온습도, 자양분)을 인위적으로 제어하여 계획생 산이 가능한 작물 재배시스템을 일컫는다. 종래에는 작물을 실내에서 자동으로 재배하는 기술이 발달되며, 노지보다 작물공장형태로 작물을 재배하는 작물 재배기가 공개되어 있다. 그러나 상기 종래기술들은 프레임에 거터를 설치하는 구성이 복잡하거나 변화시키는데 어려움이 많으며 비용이 고가여서 다양하게 거터의 형상을 변형시키지 못하는 단점이 있었다. 또한, 종래의 작물재배기는, 양액의 상태와, 온도, 습도 및 이산화탄소 등의 재배 환경 요소 및 작물의 성장 상 태 등을 각각 감지하는 수단이 구비되어 있지 않아, 작물의 생장환경을 명확하게 확인하기 어려우며, 이에 따라 작물 생장에 적합한 환경 조건을 만드는데 어려움이 따르는 문제점이 있었다. 즉, 사용자가 눈으로 직접 보고 작물을 관찰하지 않는 이상 작물의 생장 환경을 제대로 모니터링할 수 없으므 로 사용에 있어서 불편함이 따르고 작물의 생장도 원활하지 못하여 재배가 제대로 이루어지지 않는 문제점이 있 었다. 더욱이, 상기와 같은 종래의 작물재배기는 작물의 원격 재배가 불가능하고 작물의 단순 재배 기능만을 가짐으로 써 그 활용성을 높이는데 한계를 가지는 문제점을 가지고 있었다.선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10- 1251903호"}
{"patent_id": "10-2023-0004484", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은, 노지에서 재배되는 특용작물 중 유료작물(油料作物)로 분류되는 참깨 및 들깨를 스마트팜형 시설재배에서 로봇이 작물을 재배할 수 있는 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템 을 제공하는 것이다. 또한, 행잉거터는 작물을 심어 매달아 놓는 단순한 구조에서 탈피하여, 대상작물을 원하는 방향으로 성장하게 할 수 있는 기능을 보완함으로써 보다 더 편리한 방법으로 재배 및 관리할 수 있는 스마트팜에서 특용작물의 로 봇재배를 위한 적재형 행잉거터 시스템을 제공하는 것이다. 본 발명의 또 다른 목적은, 행잉거터를 적층형으로 구현함으로써, 단위면적당 재배량을 몇 배 이상 증산할 수 있는 재배혁신을 구현할 수 있는 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템을 제공하는 것이다. 본 발명의 또 다른 목적은, 행잉거터에 스마트 기술을 접목하여, 자동 물주기 및 온습도 조절하기, LED 빛 공급 하기 등의 스마트 재배 및 관리를 자동으로 처리 및 진행함으로써 작업시간 및 노동력 단축, 특히, 보다 과학적 이고 체계적인 생산환경 구현, 작업자가 작물의 성장과정 및 재배환경을 쉽게 인지하고 대응할 수 있도록 모니 터링을 통한 시각화 및 기록함하여 체계적인 재배관리환경을 구축할 수 있는 스마트팜에서 특용작물의 로봇재배 를 위한 적재형 행잉거터 시스템을 제공하는 것이다. 본 발명의 또 다른 목적은, 재배환경에서 발생 가능한 이상감지에 대응할 수 있는 경보신호를 자동출력하여, 신 속하고 체계적인 재배관리 환경을 구축할 수 있는 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템을 제공하는 것이다. 본 발명의 또 다른 목적은, 시간별 작물의 성장과정을 D/B화 및 빅데이터화 하여, 최적의 재배환경조건을 분석 하고, 이를 최적화하여 체계적인 재배환경을 개선해감으로써, 재배 기술 향상 및 재배 원가 절감을 기하고, 이 를 바탕으로 인공지능 재배시스템을 구축할 수 있는 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템을 제공하는 것이다. 본 발명의 또 다른 목적은, 재배로봇과 연동할 수 있는 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉 거터 시스템을 제공하는 것이다."}
{"patent_id": "10-2023-0004484", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시례에 따른 재배로봇용 적재형 행잉거터 시스템은, 내부에 공간을 형성하는 거터본체부, 상기 거터본체부의 상부에 구비되어, 작물의 성장을 지지하는 성장지지대부, 상기 거터본체부의 상부에 구비되어, 상 기 작물에 선택적으로 물을 공급하는 물배관부, 상기 거터본체부의 상부에 구비되어, 상기 작물의 온도, 습도 데이터를 수집하는 데이터 수집부, 상기 물배관부의 일측에 구비되어, 상기 물배관부, 상기 데이터 수집부의 전 원을 공급하는 전기배선관부, 복수개의 긴 프레임으로 형성되어, 상기 거터본체부를 적층하는 거터지지용 프레 임부, 상기 거터지지용 프레임부의 일측에 구비되어, 상기 작물에 LED 빛을 조사하는 LED부, 상기 작물의 성장 환경에 따라 상기 물배관부, 상기 데이터 수집부, 상기 전기배선관부, 상기 LED부의 동작을 제어하는 제어부, 상기 작물의 재배환경 및 성장 상태를 모니터링하는 모니터링부를 포함할 수 있다. 또한, 본 발명의 일 실시례에 따른 상기 성장지지대는, 메쉬망 구조로 형성되고, 중심부를 기준으로 좌우 대칭 을 이루면서, 일측이 기설정된 각도로 경사지도록 형성되어, 마름모꼴형을 형성할 수 있다. 또한, 본 발명의 일 실시례에 따른 상기 거터지지용 프레임부는, 수직방향으로 복수개의 프레임이 직육면체 형 상으로 구비되는 제 1지지프레임부와 수평방향으로 상기 제 1지지프레임부의 길이방향을 따라 다수개 일정간격 이격설치되는 제 2지지프레임부로 구성되어, 복수개의 상기 거터본체부를 상기 제 1지지프레임부의 길이방향을 따라 하나씩 적층할 수 있다. 또한, 상기 거터지지용 프레임부로부터 일방향 돌출형성된 LED 지지대가 더 구비되어, 상기 LED부를 견고하게 지지할 수 있다. 또한, 본 발명의 일 실시례에 따른 상기 모니터링부는, 상기 데이터 수집부의 이상여부를 판단할 수 있는 고장 진단부를 더 포함하여 구성되고, 상기 고장진단부는, 상기 데이터 수집부의 데이터를 분석하여 실시간 센서 데 이터의 신뢰도를 판단하되, 하기 [수학식 1]에 의해 산출되는 상기 데이터 수집부의 평균오차(Aerr)가 기설정된 한계오차(Serr)보다 큰 경우, 상기 데이터 수집부가 고장난 것으로 판단할 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0004484", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "(여기서, Aerr은 평균오차, Taver는 상기 데이터 수집부 센서값의 전체평균, Paver는 상기 데이터 수집부 센서값 n 개에 대한 일부평균, Tσ는 상기 데이터 수집부 센서값의 전체표준편차를 의미함)"}
{"patent_id": "10-2023-0004484", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템은, 스마트팜형 시설에서 사용되는 행잉거터를 단지 작물을 심어 매달아 놓는 단순한 구조에서 탈피하여, 대상작물을 원하는 방 향으로 성장하게 할 수 있는 기능을 보완함으로써 보다 더 편리한 방법으로 재배 및 관리할 수 있는 효과를 가 진다. 또한, 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템은, 행잉 거터를 적층형으로 구현함으로써, 단위면적당 재배량을 몇 배 이상 증산할 수 있는 재배혁신을 구현할 수 있는 효과를 가진다. 즉, 동일한 재배면적에서 행잉거터를 5층 구조로 적층할 경우, 단위면적당 5배의 재배면적확보 및 생산량을 증산할 수 있으며, 적층 높이는 시설의 고저 및 작물의 종류에 따라 달라질 수 있다. 참깨 및 들깨 의 줄기 성장 키를 150cm 로 계산할 경우, 750~850cm의 시설높이면, 5층의 행잉거터 적층이 가능하다. 또한, 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템은, 행잉 거터에 스마트 기술을 접목하여, 생육환경정보를 센싱하는 센서류(온습도, 빛, Co2, EC, pH등)와 카메라, 녹화 장치(DVR, NVR), 비전 등의 시스템과 연동되는 관리 및 제어반, 제어노드 등이 터미널 CPU와 통신모듈로 상호 정보교환, 분석, 출력, 저장되어 환경정보와 생육정보를 수집 및 최적화하며, 미리 설정된 기준값에 의해 시설 내의 자동 물주기 및 온습도 조절하기, LED 성장 빛 공급하기 등의 스마트 재배 및 관리를 자동으로 처리 및 진 행함으로써 작업 시간 및 노동력 단축, 특히, 보다 과학적이고 체계적인 재배생육환경 구현, 작물의 성장과정 및 생육환경의 인지와 대응 가능한 모니터링을 통한 시각화 및 기록화하여, 체계적인 생육관리환경 구축으로 생 산성 증대 및 생육비용 절감, 그리고 품질향상을 이룰 수 있는 효과를 가진다. 또한, 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템은, 재배 환경에서 발생 가능한 이상감지에 대응할 수 있는 경보신호를 자동출력하여, 신속하고 체계적인 재배관리 환경 을 구축할 수 있는 효과를 가진다. 또한, 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템은, 시간 별 작물의 성장과정을 D/B화 및 빅데이터화 하여, 최적의 재배환경조건을 분석하고, 이를 최적화하여 체계적인 재배환경을 개선해감으로써, 재배 기술 향상 및 재배 원가 절감을 기하고, 이를 바탕으로 인공지능 재배시스템 을 구축할 수 있는 효과를 가진다. 또한, 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템은, 재배 로봇과 연동할 수 있는 효과를 가진다."}
{"patent_id": "10-2023-0004484", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 구체적인 실시례를 상세하게 설명한다. 다만, 본 발명의 사상은 제시되 는 실시례에 제한되지 아니하고, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에서 다른 구성요 소를 추가, 변경, 삭제 등을 통하여, 퇴보적인 다른 발명이나 본 발명 사상의 범위 내에 포함되는 다른 실시례 를 용이하게 제안할 수 있을 것이나, 이 또한 본원 발명 사상 범위 내에 포함된다고 할 것이다. 이하, 본 발명인 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템은 첨부된 도 1 내지 도 3을 참고로 상세하게 설명한다. 도 1은 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템의 전체 적인 형상을 도시한 도면이고, 도 2는 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템의 거터본체부의 구체적인 형상을 도시한 도면이고, 도 3은 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템의 적층형 구조 형상을 도시한 도면이다. 도 1 내지 도 3을 참고하면, 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행 잉거터 시스템은, 거터본체부, 성장지지대부, 물배관부, 데이터 수집부, 전기배선관 부, 거터지지용 프레임부, LED부, 제어부, 모니터링부를 포함할 수 있다. 상기 거터본체부는 직육면체 형상으로 복수개 구비될 수 있다. 상기 거터본체부의 내부에 공간을 형 성하여, 작물 싹을 상기 거터본체부의 바닥 토양의 양쪽 가장자리에 3 내지 4뿌리 정도 심어둘 수 있다. 상기 성장지지대부는 상기 거터본체부의 상부에 구비될 수 있다. 상기 성장지지대부는 메쉬망 구조로 형성되고, 상기 성장지지대부의 중심부를 기준으로 좌우 대칭을 이루면서 일측이 기설정된 각도로 경사지도록 형성되어 마름모꼴형을 형성할 수 있다. 좀 더 구체적으로, 상기 성장지지대부는 메쉬망 구조로 형성되어 상기 거터본체부 내부의 배토에 통 풍과 햇빛투사를 시켜 배토의 미생물 생존환경을 돕고, 상기 성장지지대부 상부의 메쉬망 구조의 A형 지붕 은 중심부를 기준으로 마름모꼴의 좌우 대칭을 이루면서, 일측이 기설정된 각도로 경사지도록 형성되어 수확기 에 씨앗이 상기 거터본체부 내부의 배토에 낙하되지 않고 상기 성장지지대부 양쪽 공간으로 떨어지게 하여 청결한 씨앗 수거 및 생산량 증산에 기여할 수 있도록 한다. 상기 거터본체부에 심어둔 상기 작물 싹이 조금 자라면, 자연스럽게 상기 거터본체부의 양쪽 가장자 리의 비스듬한 메쉬망 구조의 상기 성장지지대부 하부와 본체 사이로 빠져나와 경사진 곳으로 기울어져 성 장하다가 상기 성장지지대부의 양쪽 끝지점에서 다시 위쪽방향으로 성장할 수 있다. 이는, 의도적으로 상기 작물을 일정한 목표방향으로 성장하게 하여 재배로봇이 보다 더 편리하고 신속하게 관리 및 작업을 할 수 있도록 하기 위함이다. 상기 물배관부는 상기 거터본체부의 상부에 구비될 수 있다. 상기 물배관부는 상기 거터본체부 의 길이방향을 따라 긴 호수관이 형성되어, 상기 작물에 물을 선택적으로 설정된 기준에 따라 자동으로 공 급할 수 있다. 상기 데이터수집부는 상기 거터본체부의 상부에 구비될 수 있다. 상기 데이터수집부는 온도센서, 습도센서, 이미지센서 등을 포함할 수 있다. 상기 데이터수집부는 배토 위와 배토 속에 설치 가능하며, IoT기반의 통신모듈과 연동되어 센서 데이터(온 도, 습도, 이미지)를 수집 및 D/B화 할 수 있다. 상기 데이터수집부의 구성은 다양하게 설계변경이 가능하 다. 상기 전기배선관부는 상기 물배관부의 일측에 구비될 수 있다. 상기 전기배선관부는 상기 거터 본체부의 길이방향을 따라 긴 배선관이 형성되어, 상기 물배관부, 상기 데이터수집부 등의 전원 을 공급할 수 있다. 상기 거터지지용 프레임부는 복수개의 긴 프레임으로 형성될 수 있으며, 적층고저에 따라 규격 최적화를 구현할 수 있다. 보다 상세하게는, 수직방향으로 복수개의 프레임이 직육면체 형상으로 구비되는 제 1지지프레임부와, 수평 방향으로 상기 제 1지지프레임부의 길이방향을 따라 다수개 일정간격 이격설치되는 제 2지지프레임부(16 2)로 구성될 수 있다. 상기 제 1지지프레임부는, 지면으로부터 지지하는 역할을 하며, 상기 제 2지지프레임부는, 상기 거터 본체부의 하면을 지지하는 역할을 한다. 상기 제1 및 2지지프레임부(161,162)는 수직 및 수평형의 컨베이 어 구조로 구현하여 행잉거터 적재자동화를 구축할 수 있다. 따라서, 복수개의 상기 거터본체부를 상기 제 1지지프레임부의 길이방향을 따라 하나씩 적층할 수 있 도록 함으로써, 단위면적당 재배량을 몇 배이상 증산할 수 있는 효과가 있다. 즉, 동일한 재배면적에서 상기 거터본체부를 5층 구조로 적층할 경우, 단위면적당 5배의 재배면적확보 및 생산량을 증산할 수 있으며, 적층 높이는 시설의 고저 및 작물의 종류에 따라 달라질 수 있다. 참깨 및 들깨의 줄기 성장 키를 150cm 로 계산할 경우, 750~850cm의 시설높이면, 5층의 행잉거터 적층이 가능하다. 상기 LED부는 상기 거터지지용 프레임부의 일측에 구비될 수 있다. 상기 LED부는 상기 작물에 LED 빛을 조사할 수 있다. 상기 거터지지용 프레임부로부터 일방향 돌출형성된 LED지지대가 더 구비 될 수 있다. 상기 LED지지대의 형상은 다양하게 설계변경이 가능하며, 상기 LED부의 일단부를 견고하 게 지지할 수 있다. 상기 제어부는 내부에 마련된 센서들의 데이터 신호를 수집하여 상기 작물의 성장환경에 따라 상기 물배관 부, 상기 데이터수집부, 상기 전기배선관부, 상기 LED부의 동작을 제어할 수 있다. 구체적으로, 상기 제어부에서 상기 물배관부를 제어하여, 상기 작물에 자동으로 물을 공급하고, 상기 데이터수집부를 제어하여 온·습도를 조절하고, LED 빛을 공급하는 등 스마트 재배 및 관리를 자동으로 처 리하여 생산성을 향상시킬 수 있다. 일례로, 생육환경정보를 센싱하는 센서류(온습도, 빛, Co2, EC, pH등)와 카메라, 녹화장치(DVR, NVR), 비전 등 의 시스템과 연동되는 관리 및 제어반, 제어노드 등이 터미널 CPU와 통신모듈로 상호 정보교환, 분석, 출력, 저장되어 환경정보와 생육정보를 수집 및 최적화하며, 미리 설정된 기준값에 의해 시설내의 자동 물주기 및 온 습도 조절하기, LED 성장 빛 공급하기 등의 스마트 재배 및 관리를 자동으로 처리할 수 있다. 상기 모니터링부는 외부에서 상기 작물의 재배환경 및 성장 상태를 모니터링할 수 있다. 작업자가 작물의 성장과정 및 재배환경을 쉽게 인지하고 대응할 수 있으며, 재배환경에서 발생 가능한 이상감지에 대응하여 경보 신호를 자동으로 출력하여, 신속하고 체계적으로 작물 재배가 가능하다. 그리고, 상기 모니터링부는, 상기 데이터수집부의 이상여부를 판단할 수 있는 고장진단부(미도시)를 더 포함할 수 있다. 상기 고장진단부(미도시)는, 상기 데이터수집부의 데이터를 분석하여 실시간 센서 데이터의 신뢰도를 판단 하되, 하기 [수학식 1]에 의해 산출되는 상기 데이터수집부의 평균오차(Aerr)가 기설정된 한계오차(Serr)보 다 큰 경우, 상기 데이터수집부가 고장난 것으로 판단할 수 있다.[수학식 1]"}
{"patent_id": "10-2023-0004484", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(여기서, Aerr은 평균오차, Taver는 상기 데이터수집부 센서값의 전체평균, Paver는 상기 데이터수집부 센서값 n개에 대한 일부평균, Tσ는 상기 데이터 수집부 센서값의 전체표준편차를 의미함) 보다 상세하게는, Taver는 상기 데이터수집부 센서값의 전체평균이며, 센서가 정상 동작하는 기설정된 기간 동안(ex. 한 달) 다수의 데이터를 수집하여 센싱되는 센서값들의 전체 평균을 산출한 값을 의미하고, Tσ는 상기 기설정된 기간동안(ex. 한 달) 다수의 데이터를 수집하여 센싱되는 센서값들의 전체표준편차를 산출한 값을 의 미한다. 또한, Paver는 상기 센서 센서값 n개에 대한 일부평균이며, 센서가 현장 설치되어 사용되는 과정에서 기설정된 수 (n개)의 센서값을 실시간으로 입력받고 상기 기설정된 수(n개)의 센서값에 대한 평균을 산출한 것으로서, 일부 센서값의 평균에 해당하므로 일부평균이라 지칭할 수 있다. 이 때, 일부평균을 이용하여 95%의 신뢰도로 추정평균값을 산출하면, 추정평균값(μ)은 범위를 갖게 된다. 따라서, 추정평균값(μ)의 상한 또는 하한과 전체평균(Taver)과의 차이값인 평균오차(Aerr)는, 상기 [수학식 1]과 같이 산출될 수 있다. 그러므로, 상기 [수학식 1]에 의해 산출되는 평균오차(Aerr)가 기설정된 한계오차(Serr)보다 크다는 것은 실시간 으로 입력받은 기설정된 수(n개)의 센서값이 센서의 고장으로 잘 못 입력되고 있을 가능성이 매우 높음을 의미 하므로, 고장진단부(미도시)는 상기 조건이 만족되면 센서가 고장난 것으로 판단할 수 있다. 한편, 상기 고장진단부(미도시)는 상기 실시간 센서 데이터에 오류가 있는지 판단하기 위해 상기 [수학식 1]에 의해 산출되는 평균값(Aerr)과 기설정된 한계값(Serr)을 비교하는 것과 동시에 상기 데이터수집부의 온도를 측정하여 측정된 온도가 기설정된 범위를 벗어나지 여부, 상기 실시간 센서 데이터가 기설정된 구간크기 내에서 주기적으로 반복되는 패턴을 보이는지 여부, 상기 데이터수집부의 주변의 습도를 측정하여 측정된 습도가 기설정된 범위를 벗어나지 여부, 센서의 동작시간과 비동작시간의 비율을 분석하여 상기 비율이 기설정된 비율 범위를 벗어나는지 여부 등을 판단하여, 상기 조건들이 적어도 하나 이상 만족되는 경우에 상기 실시간 센서 데 이터에 오류가 발생한 것으로 판단할 수도 있다. 이하에서는 상기 오류 판단방법들의 구체적 내용을 상세하게 설명한다. 우선, 상기 데이터수집부의 온도를 측정하여 측정된 온도가 기설정된 범위를 벗어나지 여부를 판단하기 위 해서는, 상기 데이터수집부와 기설정된 거리 내에 온도센서를 별도로 마련하고, 상기 온도센서를 통해 상 기 데이터수집부의 온도를 실시간 모니터링할 수 있다. 이는, 상기 데이터수집부가 정상동작하는 상 황이라면 허용되는 범위(기설정된 발열온도범위) 내에서의 발열 온도를 유지한다는 기술적 원리를 이용하는 것 이며, 발열이 지나치다거나 발열이 전혀 없는 경우라면 과부하가 걸렸거나 전혀 동작하지 않는 것으로 추측할 수 있으므로 그 경우는 상기 데이터수집부에 오류가 발생한 것으로 판단할 수 있고, 이는 곧 실시간 센서 데이터에 오류가 발생한 것으로 추정할 수 있다. 다음으로, 상기 실시간 센서 데이터에 오류가 있는지 판단하기 위해서는, 상기 실시간 센서 데이터가 기설정된 구간크기 내에서 주기적으로 반복되는 패턴을 보이는지 여부를 모니터링할 수 있는데, 이는 상기 데이터수집부 에 이물질이 유입된 경우, 유입된 이물질에 의해 기설정된 구간크기 내에서 센서 데이터값이 반복적으로 특정 패턴으로 출력될 수 있다는 기술적 원리를 이용한 것이다. 이때, 상기 기설정된 구간크기는, 아래 [수학식 2]에 따라 결정될 수 있다. [수학식 2] Arange = {(Taver + Dmax) - (Taver - Dmax)}*0.3 Arange는 기설정된 구간크기이고, Taver는 기설정된 기간동안의 전체 평균이며, Dmax 는 기설정된 기간동안의 최대 편차를 의미한다. 일례로, 기설정된 기간동안의 전체 평균이 70이고 최대편차가 20이라면 Arange는 12가 되므로, 최대값과 최소값의 차가 12를 넘지 않는 범위에서 주기적으로 반복되는 값이 출력(ex. 52, 62, 52, 62, 53, 62, 52, 63 등과 같은 유사한 값들이 반복 출력)된다면 이는 상기 데이터수집부에 이물질이 유입되어 실시간 센서 데이터에 오류 가 발생한 것으로 추정할 수 있다. 다음으로, 상기 데이터수집부의 습도를 측정하여 측정된 습도가 기설정된 값을 초과하였는지 여부를 판단 하기 위해서는, 상기 데이터수집부와 기설정된 거리 내에 습도센서를 별도로 마련하고, 상기 습도센서를 통해 데이터수집부의 습도를 실시간 모니터링할 수 있다. 이는, 상기 데이터수집부에 수분이 유입된 경우에는 비정상 동작한다는 기술적 원리를 이용하는 것이며, 습도가 기설정된 값을 초과했다면 상기 데이터수 집부에 수분이 유입된 것으로 추측할 수 있다. 따라서 이 경우는 상기 데이터수집부에 오류가 발생한 것으로 판단할 수 있고, 이는 곧 실시간 센서 데이터에 오류가 발생한 것으로 추정할 수 있다. 마지막으로, 상기 데이터수집부의 동작시간과 비동작시간의 비율을 분석하여 상기 비율이 기설정된 비율범 위를 벗어나는지 여부 등을 판단할 수 있으며, 그 결과에 따라 상기 실시간 센서 데이터에 오류가 발생한 것으 로 판단할 수 있다. 일례로, 현장에 설치된 상기 데이터수집부가 절전을 위해 매 1초마다 0.1초씩 센서 데이터를 수집하도록 설정되어 있다면, 동작시간과 비동작시간의 비율은 10 : 1이 되나, 실시간 모니터링을 통해 분석한 결과 그 비 율이 1 : 10으로 역전되거나 현저히 다른 비율(ex. 30% 이상의 비율변화)로 변화했다면 상기 데이터수집부(14 0)의 오동작 및 실시간 센서 데이터에 오류가 발생한 것으로 판단할 수 있는 것이다. 상기와 같이, 본 발명의 일실시례에서 고장진단부는 다수의 고장진단방법을 모두 고려하여 상기 실시간 센서 데 이터에 오류여부를 판단할 수 있으며, 아래 [수학식 3]과 같이 다수의 고장진단방법을 모두 반영한 Stotal 값으로 최종 판단될 수도 있다. [수학식 3] Stotal = W1*Raver + W2*Rtem + W3*Rrep + W4*Rhum + W5*Rrat 여기서, Stotal은 다수의 오류판단값의 합산값, Raver은 [수학식 1]에 의해 산출되는 평균값(Aerr)과 기설정된 한계 값(Serr)을 비교하여 도출한 오류판단값(오류 여부에 따라 0과 1중 하나의 값), Rtem은 온도가 기설정된 범위를 벗어나지 여부에 따라 오류여부를 판단한 값(오류 여부에 따라 0과 1중 하나의 값), Rrep은 반복 패턴이 나타나는 지 여부에 따라 오류여부를 판단한 값(오류 여부에 따라 0과 1중 하나의 값), Rhum은 습도가 기설정된 범위를 벗 어나지 여부에 따라 오류여부를 판단한 값(오류 여부에 따라 0과 1중 하나의 값), Rrat은 동작시간과 비동작시간 의 비율을 분석하여 오류여부를 판단한 값(오류 여부에 따라 0과 1중 하나의 값), W1은 Raver항목 가중치, W2는 Rtem항목 가중치, W3은 Rrep항목 가중치, W4는 Rhum항목 가중치, W5는 Rrat 항목 가중치를 각각 의미한다. 예를 들어, Stotal가 4 이상이라면 실시간 센서 데이터에 오류가 있는 것으로 사전 설정할 수 있고, 발열온도가 매우 중요한 파라미터인 경우이라면 W2를 3으로 사전 설정하고, W1, W3, W4, W5는 모두 1으로 사전 설정할 수 있다. 이러한 조건에서 상기 다수의 고장진단방법에 따라 오류여부를 모니터링한 결과, Raver는 1, Rtem은 1, Rrep 는 0, Rhum은 0, Rrat은 0으로 도출되었다면, Stotal는 4가 되므로, 상기 실시간 센서 데이터에는 오류가 있는 것으로 최 종 판단할 수 있다. 이상과 같이 본 발명의 일 실시례는 비록 한정된 실시례와 도면에 의해 설명되었으나, 본 발명의 일 실시례는 상기 설명된 실시례에 한정되는 것은 아니며, 이는 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러 한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서 본 발명의 일 실시례는 아래에 기재된 특허청구범위에의해서만 파악되어야 하고, 이의 균등 또는 등가적 변형 모두는 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2023-0004484", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템의 전체 적인 형상을 도시한 도면이다. 도 2는 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템의 거터 본체부의 구체적인 형상을 도시한 도면이다. 도 3은 본 발명의 일 실시례에 따른 스마트팜에서 특용작물의 로봇재배를 위한 적재형 행잉거터 시스템의 적층 형 구조 형상을 도시한 도면이다."}
