{"patent_id": "10-2021-0077117", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0167870", "출원번호": "10-2021-0077117", "발명의 명칭": "재활용품 수거 시스템 및 그 제공방법", "출원인": "주식회사 신엠", "발명자": "이재홍"}}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "투입된 재활용품을 센싱하기 위한 센싱부; 및제어부를 포함하며,상기 제어부는,상기 센싱부에 의해 센싱된 재활용품이 정해진 수거조건을 만족하는지 여부를 판단하며, 판단결과 상기 수거조건을 만족하는 경우에만 상기 재활용품에 대한 사용자 보상처리를 수행하는 것을 특징으로 하는 재활용품 수거시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 재활용품 수거 시스템은,상기 재활용품이 수거되는 수거부; 및상기 수거부로 수거되는 재활용품의 수량 또는 무게를 카운팅하기 위한 카운팅부를 더 포함하며,상기 제어부는,상기 카운팅부에 의해 수행되는 카운팅 결과를 업데이트하고, 업데이트된 카운팅 결과에 상응하는 사용자 보상처리를 수행하는 것을 특징으로 하는 재활용품 수거 시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 재활용품 수거 시스템은,상기 재활용품을 압축하기 위한 압축부를 더 포함하며,상기 제어부는,상기 재활용품이 상기 수거조건을 만족하는 경우에만 상기 재활용품이 상기 압축부에 의해 압축된 후 상기 수거부로 수거되도록 제어하는 것을 특징으로 하는 재활용품 수거 시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 수거부는,복수 개의 수거함들을 포함하며,상기 제어부는,상기 센싱부에 의해 센싱된 센싱결과를 분석하여 상기 재활용품의 종류 또는 착색 여부를 구분하고,구분된 상기 재활용품의 종류 또는 착색 여부에 따라 상기 재활용품이 각각 다른 수거함으로 수거되도록 제어하는 것을 특징으로 하는 재활용품 수거 시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 센싱부는,공개특허 10-2022-0167870-3-이미지 센서를 포함하며,상기 제어부는,상기 재활용품에 대한 수거조건별, 종류별, 및 착색 여부별로 미리 학습된 학습결과에 기초하여 상기 이미지 센서에 의해 센싱된 이미지를 분석하고, 분석결과에 기초하여 상기 수거조건의 만족 여부, 상기 재활용품의 종류또는 착색 여부를 판단하는 것을 특징으로 하는 재활용품 수거 시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 제어부는,상기 카운팅 결과를 포함하는 수거정보를 소정의 모니터링 시스템으로 전송하는 재활용품 수거 시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 재활용품 수거 시스템은,투입된 상기 재활용품의 움직임을 방지하기 위한 고정부;상기 고정부의 하단과 연통되어 상기 재활용품으로부터 배출되는 내용물이 이송되는 배출관; 및상기 배출관의 단부와 연통되어 상기 내용물이 수용되는 수용부를 더 포함하며,상기 고정부는,하단부가 소정 각도범위 내에서 V자 형상을 가지도록 형성되어, 상기 재활용품의 길이방향으로 입구측이 소정각도범위 내에서 지면을 향하도록 고정될 수 있는 것을 특징으로 하는 재활용품 수거 시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 수거조건은,이물질 포함 여부, 라벨 포함 여부, 또는 뚜껑 포함 여부 중 적어도 하나를 포함하는 재활용품 수거 시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "재활용품 수거 시스템이 투입된 재활용품을 센싱하는 단계;상기 재활용품 수거 시스템이 센싱된 상기 재활용품이 정해진 수거조건을 만족하는지 여부를 판단하는 단계; 및판단결과 상기 수거조건이 만족되는 경우, 상기 재활용품 수거 시스템이 상기 재활용품에 대한 사용자 보상처리를 수행하는 단계를 포함하는 재활용품 수거 시스템 제공방법."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 재활용품 수거 시스템 제공방법은,상기 재활용품 수거 시스템이 상기 재활용품을 수거하는 단계; 및상기 재활용품 수거 시스템이 수거되는 재활용품의 수량 또는 무게를 카운팅하는 단계를 더 포함하며,상기 재활용품 수거 시스템이 상기 재활용품에 대한 사용자 보상처리를 수행하는 단계는,상기 재활용품 수거 시스템이 카운팅 결과를 업데이트하는 단계; 및상기 재활용품 수거 시스템이 업데이트된 카운팅 결과에 상응하는 사용자 보상처리를 수행하는 단계를 포함하는공개특허 10-2022-0167870-4-재활용품 수거 시스템 제공방법."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 재활용품 수거 시스템이 상기 재활용품을 수거하는 단계는,판단결과 상기 수거조건이 만족되는 경우, 상기 재활용품 수거 시스템이 상기 재활용품을 압축하는 단계; 및상기 재활용품 수거 시스템이 상기 재활용품을 수거하는 단계를 포함하는 재활용품 수거 시스템 제공방법."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 재활용품 수거 시스템이 상기 재활용품을 수거하는 단계는,상기 재활용품 수거 시스템이 센싱결과를 분석하여 상기 재활용품의 종류 또는 착색 여부를 구분하는 단계; 및상기 재활용품 수거 시스템이 구분 결과에 따라 상기 재활용품을 각각 다른 수거함으로 수거하는 단계를 포함하는 재활용품 수거 시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 재활용품 수거 시스템 제공방법은,상기 재활용품 수거 시스템이 상기 재활용품에 대한 수거조건별, 종류별, 및 착색 여부별 이미지를 학습하는 단계;상기 재활용품 수거 시스템이 학습결과에 기초하여 센싱된 이미지를 분석하는 단계; 및상기 재활용품 수거 시스템이 분석결과에 기초하여 상기 수거조건의 만족 여부, 상기 재활용품의 종류 또는 착색 여부 중 적어도 하나를 판단하는 단계를 더 포함하는 재활용품 수거 시스템."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서, 상기 재활용품 수거 시스템 제공방법은,상기 재활용품 수거 시스템이 상기 카운팅 결과를 포함하는 수거정보를 소정의 모니터링 시스템으로 전송하는단계를 더 포함하는 재활용품 수거 시스템 제공방법."}
{"patent_id": "10-2021-0077117", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "데이터 처리장치에 설치되며 제9항 내지 제14항에 기재된 방법을 수행하기 위해 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "재활용품 수거 시스템 및 그 제공방법이 개시된다. 본 발명의 실시 예에 따른 재활용품 수거 시스템은, 투입된 재활용품을 센싱하기 위한 센싱부 및 제어부를 포함하며, 상기 제어부는 센싱부에 의해 센싱된 재활용품이 정해 진 수거조건을 만족하는지 여부를 판단하고, 판단결과 상기 수거조건을 만족하는 경우에만 상기 재활용품에 대한 사용자 보상처리를 수행하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 재활용품 수거 시스템 및 그 제공방법에 관한 것으로, 보다 상세하게는 재활용품을 배출하는 사용자 에게 보상을 제공하여, 가정이나 사무실 등과 같은 재활용품 배출지에서부터 재활용품의 이물질 제거, 종류별 분리가 확실하게 이루어질 수 있도록 함으로써, 재활용품이 수거된 이후 업체에서 재차 실시되는 분리 작업(예 를 들어, 재활용품의 재분리나 이물질 제거 등)으로 인한 비용 소모를 절감할 수 있도록 하는 기술적 사상에 관 한 것이다."}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 국내 재활용품 사용 비율은 높아지고 있지만 재활용품의 실제 재활용 비율은 높지 않은 것으로 나타난다. 이유는, 이물질이 포함된 재활용품은 수거가 되지 않고 폐기처분되는 재활용품이 많으며, 수거가 된다 하더라도 재활용품의 사용을 위해서는 재활용 업체 내에서 이물질을 제거하기 위한 분리 작업을 재차 실시할 필요가 있어 많은 비용과 시간이 소요되는 문제가 있다. 또한, 현재는 공공장소 및 특정장소에 자판기 형태를 띤 대형 회수기가 이용되는 경우가 있으나, 개인이 집안에 서 생기는 재활용품을 재활용을 목적으로 대형 회수기까지 재활용품을 가지고 이동하여 분리 배출을 실시하기에 는 불편함이 크다. 배출되는 재활용품의 회수 수량과 편의성을 높이기 위해서는 위치적, 공간적, 시간적 제약이 없는 것을 근본적 으로 대량의 깨끗한 재활용품을 회수하기 위해서는 처음 배출지인 가정이나 사무실 등에서부터 이물질 제거와 분리 배출을 실시함으로 재활용품의 수거비중과 재활용 비중을 높일 필요가 있다. 이를 위해, 사용자의 올바른 재활용품 배출을 유도할 수 있으면서, 사용자의 재활용품 배출을 편리하게 할 수 있는 기술적 사상이 요구된다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 10-2009-0119593"}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 재활용품의 처음 배출지인 가정 및/또는 사무실 등에서 재활용 가치가 높은 깨끗한 재활용품 을 회수할 수 있도록, 재활용품을 배출하는 사용자에게 회수된 재활용품에 대한 소정의 보상을 할 수 있는 방법 및 시스템을 제공하는 것이다. 이를 위해, 재활용품을 수거할 때 소정의 수거조건(예컨대, 이물질 포함 여부, 뚜껑 포함 여부, 라벨 포함 여부 등)을 설정하고, 수거조건이 만족되는 재활용품만을 수거함으로써, 추후 수거업체에서 수거된 재활용품의 재분 리로 인한 시간과 비용의 소모를 절감할 수 있도록 하는 기술적 사상을 제공하는 것이다. 또한, 상기 수거조건을 만족하는 재활용품을 배출하는 사용자에게는 소정의 기준에 따라 보상이 지급될 수 있도 록 하여, 사용자의 적극적인 참여를 유도하고 원활한 분리배출이 이루어질 수 있는 기술적 사상을 제공하는 것 이다."}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 발명의 실시 예에 따른 재활용품 수거 시스템은, 투입된 재활용품을 센싱하기 위한 센싱부 및 제어부를 포함하며, 상기 제어부는 센싱부에 의해 센싱된 재활용품이 정해진 수거조건을 만족하 는지 여부를 판단하고, 판단결과 상기 수거조건을 만족하는 경우에만 상기 재활용품에 대한 사용자 보상처리를 수행하는 것을 특징으로 할 수 있다. 또한, 상기 재활용품 수거 시스템은, 재활용품이 수거되는 수거부 및 수거부로 수거되는 재활용품의 수량 또는 무게를 카운팅하기 위한 카운팅부를 더 포함할 수 있다. 또한, 상기 제어부는 카운팅부에 의해 수행되는 카운팅 결과를 업데이트하고, 업데이트된 카운팅 결과에 상응하 는 사용자 보상처리를 수행하는 것을 특징으로 할 수 있다. 또한, 상기 재활용품 수거 시스템은, 투입된 상기 재활용품의 움직임을 방지하기 위한 고정부, 상기 고정부의 하단과 연통되어 상기 재활용품으로부터 배출되는 내용물이 이송되는 배출관, 및 상기 배출관의 단부와 연통되 어 상기 내용물이 수용되는 수용부를 더 포함하며, 상기 고정부는, 하단부가 소정 각도범위 내에서 V자 형상을 가지도록 형성되어, 상기 재활용품의 길이방향으로 입구측이 소정 각도범위 내에서 지면을 향하도록 고정될 수 있는 것을 특징으로 할 수 있다.또한, 상기 재활용품 수거 시스템은 재활용품을 압축하기 위한 압축부를 더 포함할 수 있다. 또한, 상기 제어부는 재활용품이 상기 수거조건을 만족하는 경우에만 재활용품이 상기 압축부에 의해 압축된 후 수거부로 수거되도록 제어하는 것을 특징으로 할 수 있다. 또한, 상기 수거부는 복수 개의 수거함들을 포함하며, 상기 제어부는 센싱부에 의해 센싱된 센싱결과를 분석하 여 재활용품의 종류 또는 착색 여부를 구분하고 구분된 재활용품의 종류 또는 착색 여부에 따라 상기 재활용품 이 각각 다른 수거함으로 수거되도록 제어하는 것을 특징으로 할 수 있다. 또한, 상기 센싱부는 이미지 센서를 포함하며, 상기 제어부는 재활용품에 대한 수거조건별, 종류별, 및 착색 여 부별로 미리 학습된 학습결과에 기초하여 상기 이미지 센서에 의해 센싱된 이미지를 분석하고, 분석결과에 기초 하여 수거조건의 만족 여부, 재활용품의 종류 또는 착색 여부를 판단하는 것을 특징으로 할 수 있다. 또한, 상기 제어부는 카운팅 결과를 포함하는 수거정보를 소정의 모니터링 시스템으로 전송할 수 있다. 또한, 상기 수거조건은 이물질 포함 여부, 라벨 포함 여부, 또는 뚜껑 포함 여부 중 적어도 하나를 포함할 수 있다. 상기 기술적 과제를 해결하기 위한 본 발명의 실시 예에 따른 재활용품 수거 시스템 제공방법은, 재활용품 수거 시스템이 투입된 재활용품을 센싱하는 단계 재활용품 수거 시스템이 센싱된 재활용품이 정해진 수거조건을 만족 하는지 여부를 판단하는 단계 및 판단결과 수거조건이 만족되는 경우, 재활용품 수거 시스템이 재활용품에 대한 사용자 보상처리를 수행하는 단계를 포함할 수 있다. 또한, 상기 재활용품 수거 시스템 제공방법은, 상기 재활용품 수거 시스템이 상기 재활용품을 수거하는 단계 및 재활용품 수거 시스템이 수거되는 재활용품의 수량 또는 무게를 카운팅하는 단계를 더 포함할 수 있다. 또한, 상기 재활용품 수거 시스템이 재활용품에 대한 사용자 보상처리를 수행하는 단계는, 재활용품 수거 시스 템이 카운팅 결과를 업데이트하는 단계 및 재활용품 수거 시스템이 업데이트된 카운팅 결과에 상응하는 사용자 보상처리를 수행하는 단계를 포함할 수 있다. 또한, 상기 재활용품 수거 시스템이 상기 재활용품을 수거하는 단계는, 판단결과 상기 수거조건이 만족되는 경 우, 상기 재활용품 수거 시스템이 상기 재활용품을 압축하는 단계 및 재활용품 수거 시스템이 상기 재활용품을 수거하는 단계를 포함할 수 있다. 또한, 상기 재활용품 수거 시스템이 상기 재활용품을 수거하는 단계는, 상기 재활용품 수거 시스템이 센싱결과 를 분석하여 재활용품의 종류 또는 착색 여부를 구분하는 단계, 및 상기 재활용품 수거 시스템이 구분 결과에 따라 상기 재활용품을 각각 다른 수거함으로 수거하는 단계를 포함할 수 있다. 또한, 상기 재활용품 수거 시스템 제공방법은, 상기 재활용품 수거 시스템이 상기 재활용품에 대한 수거조건별, 종류별, 및 착색 여부별 이미지를 학습하는 단계, 상기 재활용품 수거 시스템이 학습결과에 기초하여 센싱된 이 미지를 분석하는 단계, 및 재활용품 수거 시스템이 분석결과에 기초하여 상기 수거조건의 만족 여부, 상기 재활 용품의 종류 또는 착색 여부 중 적어도 하나를 판단하는 단계를 더 포함할 수 있다. 또한, 상기 재활용품 수거 시스템 제공방법은, 상기 재활용품 수거 시스템이 상기 카운팅 결과를 포함하는 수거 정보를 소정의 모니터링 시스템으로 전송하는 단계를 더 포함할 수 있다. 데이터 처리장치에 설치되며 상술한 재활용품 수거 시스템 제공방법을 수행하기 위해 기록매체에 저장된 컴퓨터 프로그램이 제공될 수 있다."}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 기술적 사상에 따르면 재활용품 수거 시스템은 처음 배출지인 가정 또는/및 사무실 등에서 시스템 내 에 정해진 수거조건을 만족한 재활용품만이 수거될 수 있어, 수거업체에서 재분리 작업 등으로 인한 시간, 비 용 소모를 절감할 수 있는 효과가 있다. 또한, 배출되는 재활용품들의 재활용 비중을 향상시킬 수 있는 효과가 있다. 또한, 수거조건을 만족하는 재활용품을 배출하는 사용자에게 소정의 보상을 제공하도록 함으로써, 사용자의 적 극적인 참여를 유도할 수 있는 효과가 있다."}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도면에 예시하 고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 발명을 설명함에 있어서 관련 된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에 있어서, “포함하다”또는“가지다”등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 또한, 본 명세서에 있어서는 어느 하나의 구성요소가 다른 구성요소로 데이터를 ‘전송’하는 경우에는 상기 구 성요소는 상기 다른 구성요소로 직접 상기 데이터를 전송할 수 있고, 적어도 하나의 또 다른 구성요소를 통하여 상기 데이터를 상기 다른 구성요소로 전송할 수도 있는 것을 의미한다. 반대로 어느 하나의 구성요소가 다른 구 성요소로 데이터를‘직접전송’하는 경우에는 상기 구성요소에서 다른 구성요소를 통하지 않고 상기 다른 구성 요소로 상기 데이터가 전송되는 것을 의미한다. 이하, 첨부된 도면들을 참조하여 본 발명의 실시 예들을 중심을 본 발명을 상세히 설명한다. 각 도면에 제시된 동일한 참조부호는 동일한 부재를 나타낸다. 도 1은 본 발명의 실시 예에 따른 재활용품 수거 시스템의 구현을 나타내는 도면이다. 도 1을 참조하면, 본 발명의 실시 예에 따른 재활용품 수거 시스템은 사용자에 의해 투입되는 재활용품 을 수거하며, 수거된 재활용품에 대한 수거정보를 소정의 모니터링 시스템으로 전송할 수 있다. 상기 수거정보는 상기 재활용품 수거 시스템이 설치된 위치에 대한 위치정보, 상기 재활용품 수거 시스템 에 의해 수거된 재활용품의 개수(수량) 및/또는 무게에 대한 정보를 포함하는 의미일 수 있다. 또한 상기 재활용품 수거 시스템은 상기 수거정보에 따라 상기 재활용품 수거 시스템에 상응하는 사 용자에게 소정의 사용자 보상처리를 수행할 수 있다. 본 발명의 기술적 사상에 의하면, 상기 재활용품 수거 시스템은 사용자가 투입하는 모든 재활용품을 수거하는 것이 아니라, 투입된 상기 재활용품이 미리 정해진 수거조건을 만족하는지 여부를 판단하여 판단 결과 수거조건을 만족하는 경우에만 재활용품의 수거를 진행하고, 수거된 재활용품에 대한 사용자 보상 처리를 수행할 수 있다. 이하, 본 명세서에서는 상기 재활용품이 페트병인 경우를 위주로 설명하지만 본 발명이 반드시 이에 한정되 는 것은 아니다. 상기 재활용품은 페트병 외에도 일반적으로 재활용품, 종이, 캔, 페트병 외에 다른 플라스 틱, 비닐 등을 더 포함하는 의미일 수도 있다. 본 발명의 기술적 사상에 의하면 상기 수거조건은 이물질 포함 여부, 라벨 포함여부, 또는 뚜껑 포함 여부 중 적어도 하나를 포함할 수 있다. 상기 재활용품 수거 시스템은 소정의 방식으로 투입된 재활용품의 수 거조건 만족 여부를 판단 할 수 있으며, 수거조건의 만족을 판단하기 위한 기준은 다양하게 설정될 수 있다. 예 컨대, 상기 수거조건이 전술한 바와 같이 투입된 재활용품의 이물질 포함 여부, 라벨 포함 여부, 및 뚜껑 포함 여부를 포함하는 경우, 상기 재활용품 수거 시스템은 어느 하나의 조건 또는 일부의 조건만 만족하더 라도 수거조건을 만족한 것으로 판단할 수도 있고, 모든 조건을 만족하는 경우에만 수거조건을 만족하였다고 판 단할 수도 있다. 예컨대 상기 재활용품 수거 시스템은 상기 재활용품에 이물질이 포함되지만 않으면 나머지 라벨, 뚜껑 등 다른 조건이 만족되지 않더라도 수거조건을 만족하였다고 판단할 수 있다. 또는, 상기 재활용품 수거 시스템 은 상기 재활용품에 이물질이 포함되지 않고, 라벨이 포함되지 않았다면, 뚜껑의 포함 여부와 상관없 이 수거조건을 만족했다고 판단할 수도 있다. 또는, 상기 재활용품 수거 시스템은 상기 재활용품이 이 물질, 라벨, 및 뚜껑 모두 포함되지 않았다고 판단되는 경우에만 수거조건을 만족하였다고 판단할 수도 있다. 한편 본 명세서에서 상기 사용자 보상처리는, 투입된 재활용품의 수거 및/또는 재활용품이 수거됨에 따 른 수거정보에 따라 사용자에게 소정의 보상을 제공하는 일련의 과정을 의미할 수 있다. 예컨대, 상기 사용자 보상처리는 상기 재활용품 수거 시스템이 투입된 재활용품의 수거를 진행한 후 사용자에게 소정의 보 상이 제공되기까지의 일련의 과정을 포함하는 의미일 수 있으며, 구현 예에 따라서는 사용자에게 소정의 보상이 제공되는 과정만을 포함하는 의미일 수도 있다. 어떠한 경우든, 상기 재활용품 수거 시스템은 상기 수거조건을 만족하는 재활용품을 투입한 사용자에 게 보상을 제공하여, 사용자의 올바른 재활용품 배출을 유도할 수 있다. 일 실시 예에 의하면, 사용자에게 제공되는 보상은 수거조건을 만족하는 재활용품이 수거될 때마다, 또는 후술할 본 발명의 기술적 사상에 따라 수거된 재활용품이 일정 수준 이상의 수량이나 무게에 도달할 때마다 해당 사용자에게 제공될 수 있다. 사용자에게 제공되는 보상은 다양한 형태로 구현될 수 있다. 일 실시 예에서, 상기 보상은 현금이나 포인트 등 의 형태로 구현되어 사용자에게 제공될 수 있다. 이러한 경우, 상기 보상은 상기 재활용품 수거 시스템에 미리 등록된 사용자의 계정에 적립되거나, 또는 별도의 사용자 단말기(예컨대, 스마트 폰 등)로 제공될 수 있다. 이를 위해, 상기 재활용품 수거 시스템 및/또는 상기 모니터링 시스템은 사용자 식별이나 보상 제공을 위해 필요한 소정의 사용자 정보(예컨대, 사용자 계정정보, 사용자 개인정보, 사용자 전화번호 등)를 미 리 저장하고 있을 수 있다. 상기 재활용품 수거 시스템은 설명한 바와 같이 수거조건을 만족하는 재활용품이 수거되면 정해진 사 용자 보상처리를 수행할 수 있으며, 사용자 보상처리가 수행됨에 따라 사용자에게 제공되는 보상은 상기 재활용 품 수거 시스템에 의해 수행될 수도 있고, 상기 모니터링 시스템에 의해 수행될 수도 있다. 전술한 바와 같이 상기 재활용품 수거 시스템은 상기 재활용품의 수거에 따른 수거정보를 소정의 모니 터링 시스템으로 전송할 수 있다. 상기 재활용품 수거 시스템과 상기 모니터링 시스템은 네트워크로 연결되어 본 발명의 기술적 사상을 구현하기 위해 필요한 정보를 송수신할 수 있다. 예를 들어, 상기 네트워크는 Wi-Fi 망, Lora 망, LTE-M 망, LTE 망 등 다양한 종류로 구현 될 수 있다. 구현 예에 따라, 상기 재활용품 수거 시스템 및/또는 상기 모 니터링 시스템은 소정의 사용자 단말기와도 네트워크를 통해 연결되어 통신을 수행할 수도 있다. 상기 모니터링 시스템은 상기 재활용품 수거 시스템을 제공하고 관리하며, 필요에 따라 상기 재활용 품 수거 시스템에 수거된 재활용품을 수거할 수 있는 소정의 관리주체에 의해 운용되는 시스템일 수 있다.상기 모니터링 시스템은 수신된 수거정보를 통해 각지에 설치된 재활용품 수거 시스템들의 수거현황 을 파악하고, 필요에 따라 상기 재활용품 수거 시스템이 설치된 위치 즉, 각 배출지(가정이나 사무실 등) 에서 배출된 재활용품을 수거하러 갈 수 있다. 또한 전술한 바와 같이, 상기 모니터링 시스템은 상기 재활용품 수거 시스템으로부터 수신된 수거정 보를 통해 수거된 재활용품 수량 또는 무게에 대한 정보를 확인하고, 상응하는 보상이 사용자에게 제공되도 록 할 수도 있다. 상술한 바와 같은 기술적 사상을 구현하기 위한 재활용품 수거 시스템의 개략적인 구성은 도 2에 도시된 바와 같을 수 있다. 도 2는 본 발명의 실시 예에 따른 재활용품 수거 시스템의 내에 있는 재활용 수거 시스템의 구성을 개략적으로 나타내는 도면이다. 도 2를 참조하면, 재활용품 수거 시스템은 센싱부, 압축부, 수거부 및 제어부를 포함 할 수 있다. 구현 예에 따라, 상기 재활용품 수거 시스템은 알림부 및/또는 카운팅부를 더 포함 할 수 있다. 상기 제어부는 본 발명의 기술적 사상을 구현하기 위한 연산 및 타 구성을 제어하는 기능을 수행할 수 있 다. 이를 위해, 상기 제어부는 프로세서, 저장장치, 및/또는 상기 저장장치에 저장되어 상기 프로세서에 의해 실행되는 프로그램을 포함할 수 있다. 상기 제어부는 본 발명의 기술적 사상을 구현하기 위한 연산 및 타 구성을 제어하는 기능을 수행할 수 있 다. 상기 제어부는 프로세서, 저장장치, 및 상기 저장장치에 저장되어 상기 프로세서에 의해 실행되는 프 로그램을 포함할 수 있다. 이하 본 명세서에서 재활용품 수거 시스템 및/또는 상기 제어부가 소정의 동작을 수행한다고 함은, 상기 프로세서가 상기 프로그램을 실행하여 수행하는 일련의 데이터 처리 및/또는 제"}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "어에 의해 수행될 수 있음을 본 발명의 기술분야의 평균적 전문가는 용이하게 추론할 수 있을 것이다. 본 발명의 실시 예에 따라서는, 상술한 구성요소들 중 일부 구성요소는 반드시 본 발명의 구현에 필수적으로 필 요한 구성요소에 해당하지 않을 수도 있으며, 또한 실시 예에 따라 상기 재활용품 수거 시스템은 이보다 더 많은 구성요소들을 포함할 수도 있음은 물론이다. 상기 재활용품 수거 시스템은 본 발명의 기술적 사상을 구현하기 위해 필요한 하드웨어 리소스(resource) 및/또는 소프트웨어를 구비할 수 있으며, 반드시 하나의 물리적인 구성요소를 의미하거나 하나의 장치를 의미하 는 것은 아니다. 즉, 상기 재활용품 수거 시스템은 본 발명의 기술적 사상을 구현하기 위해 구비되는 하드 웨어 및/또는 소프트웨어의 논리적인 결합을 의미할 수 있으며, 필요한 경우에는 서로 이격된 장치에 설치되어 각각의 기능을 수행함으로써 본 발명의 기술적 사상을 구현하기 위한 논리적인 구성들의 집합으로 구현될 수도 있다. 상기 센싱부는 적어도 하나의 센서를 포함할 수 있고, 재활용품이 투입되었는지 여부를 확인하고 투입된 재활용품을 센싱할 수 있다. 예를 들어, 상기 센싱부는 이미지 센서를 포함하여, 투입된 재활용품의 이미지 정보를 획득할 수 있다. 획 득된 이미지 정보는 제어부에 의해 AI(인공지능)기술을 활용하여 분석될 수 있으며 미리 학습된 기계학습 (딥러닝)을 통해 식별 될 수 있다. 최근 하드웨어의 발전과 함께 인공지능(Artificial Intelligence, A.I.) 분야에서도 머신 러닝을 기반으로 한 딥러닝이 매우 빨리 발전하고 있다. 딥러닝은 대량의 데이터로 심층 신경망(Deep Neual Network)을 학습하는 방 식이며, 심층 신경망은 입력층(Input Layer)과 출력층(Output layer) 사이에 여러 개의 은닉층(Hidden layer) 들로 이루어진 인공신경망(Artificial Neural Network)을 말한다. 이러한 딥러닝의 발전으로 인하여 이미지를 인식하거나 분류하는 등의 업무를 컴퓨터 시스템에 의해 자동화하고자 하는 시도가 활발히 이루어지고 있다. 예 컨대 기계학습의 일종인 뉴럴 네트워크(예를 들어, 컨벌루션 뉴럴 네트워크(COnvolution Neural Network, CNN) 를 이용한 딥러닝 방식)를 이용하여 사람이 수행하던 각종 분류나 판단을 자동화하기 위한 시도가 이루어지고 있으며, 뉴럴 네트워크(예컨대, CNN)를 이용한 딥러닝을 통해 이미지를 판독하고 분류하는 기술적 사상이 널리 알려지고 있다.상기 제어부는 센싱부의해 획득된 이미지를 분석하기 위해 재활용품에 대한 수거조건별, 종류별, 및 착색 여부별로 AI(인공지능)기술을 활용하여 미리 학습된 학습 결과에 기초하여 이미지 센서에 의해 센싱된 이 미지를 분석하고, 분석결과에 기초하여 수거조건의 만족 여부를 판단할 수 있다. 전술한 바와 같이 상기 수거조건은 상기 재활용품에 대한 이물질 포함 여부, 라벨 부착 여부, 뚜껑 포함 여부 중 적어도 하나를 포함할 수 있다. 상기 제어부는 필요에 따라 다양한 기준을 통해 상기 수거조건의 만족 여부를 판단할 수 있다. 예를 들어, 상기 이물질 포함 여부는 재활용품의 표면이나 내부에 이물질(예를 들어, 남은 음식물, 기타 오염물 질 등)이 존재하고 있는지 여부를 의미할 수 있다. 상기 제어부는 투입된 재활용품의 전체 표면적 중 이물 질이 일정 비율 이상 포함되어 있는 경우, 또는 이물질이 조금이라도 포함되어 있는 경우에는 상기 수거조건을 만족하지 못한다고 판단할 수 있다. 또한, 라벨의 포함 여부는 재활용품 특히, 페트병에 일반적으로 부착되어 있는 비닐재질의 라벨이 존재하는지 여부를 의미할 수 있다. 이처럼 페트병에 부착되어 있는 라벨은 추후 재활용 과정에서 반드시 분리가 이루어져 야 하는 것으로, 처음 배출지에서부터 확실한 분리, 제거가 이루어지는 것이 바람직할 수 있다. 상기 제어부 는 센싱된 페트병에 라벨이 전혀 포함되어 있지 않다고 판단되는 경우에만 수거조건이 만족되었다고 판단 할 수도 있고, 라벨이 상기 페트병에서 일정 수준 이하의 면적만 남아 있다고 판단되는 경우에도 수거조건을 만 족한다고 판단할 수도 있다. 이러한 기준은 전술한 바와 같이 필요에 따라 다양하게 설정될 수 있다. 또한, 뚜껑의 유무는 재활용품 특히, 페트병에 뚜껑이 결합되어 있는지 여부를 의미할 수 있다. 상기 제어 부는 다양한 페트병에 뚜껑이 결합되어 있는 경우와 뚜껑이 없는 경우에 대한 이미지를 미리 학습하고, 학 습결과에 기초하여 센싱된 이미지를 분석, 뚜껑의 유무를 판단할 수 있다. 다른 구현 예에 의하면, 상기 제어부 는 상기 센싱부의 센싱 결과, 페트병으로 파악되는 재활용품의 일 측(예컨대, 병 입구측)이 개방되어 있는지, 또는 폐쇄되어 있는지 여부를 파악하고, 개방된 부분 없이 모두 폐쇄되어 있다고 파악되는 경우 뚜껑이 결합되어 있는 것으로 판단할 수도 있다. 어떠한 경우든, 상기 제어부는 재활용품 중에서도 특히 페트병에 뚜껑이 결합되어 있는지 여부를 판단할 수 있으며, 투입된 재활용품의 수거를 위한 수거조건에 포함시킬 수 있 다. 또한 상기 제어부는 상기 수거조건뿐 아니라, 전술한 바와 같이 이미지를 분석한 분석결과를 통해 상기 재 활용품의 종류, 오염 여부 및/또는 착색 여부를 판단할 수도 있다. 예를 들어, 상기 제어부는 투입된 재활 용품이 플라스틱인지, 캔인지 등과 같은 재활용품의 종류를 구분하거나, 플라스틱 용기에 음식 찌꺼기 등으로 인한 오염이 되어 있는지 여부를 판단하거나, 또는 페트병이 투명한 페트병인지 착색된 상태의 유색 페 트병인지 여부를 판단할 수 있다. 이러한 상기 제어부의 판단은 전술한 바와 같이 미리 학습된 학습결과를 이용하여 수행될 수 있다. 본 명세서에서는 재활용품의 종류가 페트병일 경우를 가정 하였지만, 이에 한정되는 것은 아니다. 캔 또는 여러 종류의 플라스틱 재활용품, 종이, 등 다른 재활용품들을 수거 할 때에는 센싱부, 제어부에 해당하는 재활용품의 이미지를 추가하여 식별할 수 있으며, 그에 맞는 수거조건을 설정하여 수거 할 수 있다. 이 외에도 필요에 따라 재활용품 수거를 위한 다양한 수거조건이 설정될 수 있다. 한편, 상기 센싱부는 상기 이미지 센서 외에, 재활용품 투입 여부를 센싱하기 위한 별도의 센서를 더 포함 할 수도 있다. 예를 들면, 상기 센싱부는 광센서, 적외선 센서, 압력센서, 및/또는 레이다 센서 등 다양한 센서들을 포함 하여 상기 재활용품의 투입 여부를 센싱할 수 있으며, 이 외에도 재활용품의 투입 여부를 알 수 있으면 어떠한 종류의 센서든 사용될 수 있다. 한편 본 발명의 다른 실시 예에 의하면, 투입된 재활용품이 수거조건을 만족하지 않을 경우, 상기 제어부 는 상기 알림부가 소정의 알림정보를 출력하도록 제어함으로써 사용자에게 재활용품의 올바른 배출을 유도할 수 있다. 상기 알림정보는 만족하지 못하는 수거조건을 사용자에게 알려 줄 수 있는 내용이 포함될 수 있으며, 음성정보 및/또는 텍스트 정보, 이미지 정보를 포함하는 형태로 구현될 수 있다. 예를 들어, 투입된 재활용품에 이물질이 있다고 판단되는 경우 상기 제어부는 상기 알림부가 '이물질 을 제거하고 다시 투입해주세요'라는 내용의 음성정보를 출력하도록 제어할 수 있다. 또는 상기 재활용품 수거 시스템에 소정의 디스플레이 장치가 미리 구비되어 있는 경우, '이물질을 제거하 고 다시 투입해주세요'라는 내용이 텍스트 및/또는 이미지 형태로 상기 디스플레이 장치를 통해 출력될 수 있다. 구현 예에 따라, 상기 알림정보는 전술한 음성정보의 형태와 텍스트 및/또는 이미지 정보의 형태 모두로 출력될 수도 있다. 구현 예에 따라, 상기 알림부에 의해 출력되는 알림정보는 상기 수거조건에 대한 알림뿐 아니라, 재활용품 수거 시스템에 의해 수행되는 사용자 보상처리에 대한 정보를 더 포함할 수도 있다. 예컨대, 사용자가 수 거조건을 만족하는 재활용품을 투입하여 수거가 진행되면, 수거된 재활용품으로 인해 변경되는(또는 새로 제공 되는) 보상에 대한 정보가 상기 알림정보로 출력될 수도 있다. 한편, 상기 제어부가 수거조건을 만족한다고 판단한 경우, 상기 제어부는 상기 압축부가 투입된 재활 용품을 압축하도록 제어할 수 있다. 상기 압축부는 도 4를 참조하여 설명하도록 한다. 도 4는 본 발명의 실시예에 따른 압축부를 설명하기 위한 도면이다. 도 4를 참조하면, 상기 압축부는 위 아래 방향으로 각각 상판, 하판을 구비하여, 상판 및 하판이 서로 맞 닿는 방향으로 이동하며 재활용품을 압축하는 방식으로 구현될 수 있다. 하지만 압축부의 구현 방법은 이에 한정되는 것은 아니다. 상기 압축부는 전술한 상판 및 하판뿐 아니라 좌, 우 방향의 측판들, 또는 소정의 각도로 기울어진 측판들 을 포함할 수 있다. 이러한 상기 압축부의 구동은 상기 제어부에 의해서 수행될 수 있다. 한편 본 발명의 기술적 사상에 의하면, 상기 재활용품 수거 시스템은 재활용품에 대한 수거조건을 보 다 정확히 판단하기 위해, 투입된 재활용품의 움직임을 제한하거나 방지할 수 있는 고정부를 더 포함할 수 있다. 이처럼 투입된 재활용품의 고정을 위한 고정부의 역할은 상기 압축부의 상판과 하판에 의해 수행될 수 있으며, 구현 예에 따라서는 상기 압축부와는 별도로 투입된 재활용품의 고정을 위한 고정부가 형성될 수도 있다. 어떠한 경우든, 상기 고정부 및/또는 상기 압축부는 투입된 재활용품의 회전이나 이탈 등 의 불필요한 움직임을 방지하거나 제한하기 위해 상기 재활용품을 고정할 수 있다. 이러한 고정부에 대하여 도 9를 참조하여 설명하도록 한다. 도 9는 본 발명의 실시 예에 따른 재활용품 수거 시스템의 고정부를 설명하기 위한 도면이다. 도 9를 참조하면, 상기 재활용품 수거 시스템은 상기 재활용품이 투입될 때 상기 재활용품의 입 구측이 소정 각도범위 내에서 지면을 향할 수 있도록 형성되는 고정부를 포함할 수 있다. 본 발명의 실시 예에 의하면, 상기 재활용품 수거 시스템은 재활용품의 투입 시점부터 상기 재활용품 을 특정 방향으로만 투입이 가능하도록 하여, 사용자가 수거조건을 위해 투입된 재활용품을 다시 회수 한 후 재투입하지 않더라도 투입된 재활용품 내에 내용물이 남아 있는 잔여 내용물 특히, 물이나 음료와 같 은 액체 잔여 내용물이 자동으로 배출되도록 구현될 수 있다. 예를 들어, 상기 고정부는 단면이 V자 형상을 가지도록 형성될 수 있으며, V자 형상의 하단부는 개방되어 상기 재활용품으로부터 배출되는 내용물을 수용할 수 있는 수용부와 연통되는 배수관과 연결될 수 있다. 이때 상기 고정부는 깔때기 형상으로 형성될 수도 있고, 구현 예에 따라서는 두 개의 하판이 소정 간격만 큼 이격되도록 나란히 배치되되, 상기 두 개의 하판이 중심부를 향해 소정 각도만큼 기울어져 상기 두 개의 하 판이 서로 소정 각도를 이루도록 형성될 수도 있다. 또는, 상기 고정부는 하나의 하판이 소정 위치에서 V 자 형상으로 구부러지도록 형성되되, 구부러진 위치에 상기 배수관과 연결될 수 있는 배출홈(미도시)이 형 성되도록 구현될 수도 있다. 이러한 경우 상기 고정부는 입구측이 지면을 향하도록 투입된 상기 재활용품 이 전면 또는 후면 방향으로 넘어지지 않도록 전면부 및/또는 후면부에 투입된 상기 재활용품을 지지하 기 위한 지지대(미도시)를 포함할 수 있다. 어떠한 경우든 이처럼 상기 고정부가 V자 형상으로 형성되는 경우, 전술한 바와 같이 상기 재활용품은 입구측이 지면을 향하도록 고정되어 혹여 남아있는 잔여 내용물이 상기 배수관을 따라 상기 수용부에 수용될 수 있다. 그리고 이처럼 입구측이 지면을 향하도록 상기 재활용품이 상기 고정부에 의해 고정되면, 상기 압축부 는 상기 재활용품을 길이 방향으로 압축함으로써 상기 재활용품의 압축 효율을 향상시킬 수 있다. 예컨대, 상기 재활용품이 전술한 바와 같이 페트병인 경우를 가정하면, 페트병의 입구가 상기 고정부 를 향하도록 투입되어 남아있는 내용물이 배출되고, 상기 압축부의 상판 및 하판이 각각 상기 페트병의 하 단부와 상기 페트병의 입구로부터 압축을 수행할 수 있다. 상기 압축부에 의해 압축된 재활용품은 수거부에 수거될 수 있다. 상기 수거부는 도 5를 참조하 여 설명 할 수 있다. 도 5는 본 발명의 실시 예에 따른 재활용품 수거 시스템의 수거부를 설명하기 위한 도면이다. 도 5를 참조하면 수거부는 복수 개의 수거부(130-1, 130-2, 130-n)들로 구비할 수 있어 상기 수거조건을 만족한 재활용품들을 종류별로 수거할 수 있으며 이는 수거과정에서 종류가 분리 되지 않은 재활용품들을 재차 다시 분리하는 일이 없도록 할 수 있다. 상기 수거부는 상기 제어부를 통해 전술한 바와 같이 재활용품의 종류별, 착색여부를 구분하여 각각 지정된 수거부로 수거될 수 있도록 한다. 예를 들어, 수거부는 상기 제어부를 통해 전술한 바와 같이 착색여부인 유색페트병, 무색페트병으로 구분하거나 또는 종류별로 플라스틱이 아닌 전혀 다른 재활용품인지를 구분할 수 있다. 이렇게 구분된 재활용품 을 각자 정해진 수거부로 수거할 수 있도록 재활용품 종류, 착색여부에 따라 수거부를 지정하여 수행 될 수 있다. 따라서 상기 수거부는 압축부에서 소정의 크기로 압축된 재활용품들을 종류별로 지정된 복수 개의 수 거부(130-1, 130-2, 130-n)들을 통해 수거될 수 있으며, 필요에 따라 수거함의 개수를 추가 또는 제거 할 수 있 다. 한편, 상기 수거부를 통해 수거 된 재활용품은 카운팅부를 통해 수거정보를 획득할 수 있다. 상기 수거정보는 전술한 바와 같이 재활용품 수량, 무게, 재활용품 수거 시스템의 위치정보, 사용자 또는 재활 용품 수거 시스템의 식별정보 등을 포함할 수 있다. 또한, 상기 수거정보는 카운팅부를 통해 측정된 재활용품의 개수(수량) 및/또는 무게를 통해 사용자에 게 전술한 바와 같이 소정의 보상을 하는데 활용 할 수 있다. 구현의 예에 따라, 상기 카운팅부는 적어도 하나의 센서를 포함하여 재활용품이 상기 재활용품 수거 시스 템에 투입됐을 때나, 또는 상기 수거부에 재활용품이 수거 되었을 때의 수량을 확인 할 수 있다. 이를 위해, 상기 카운팅부는 카운터 센서, 이미지센서, 광센서, 적외선센서, 압력센서, 및/또는 레이다 센 서 등 재활용품의 수량을 확인 할 수 있는 다양한 형태의 센서를 포함할 수 있다. 본 발명의 또 다른 실시 예에 의하면, 상기 카운팅부는 수거된 재활용품의 무게를 측정할 수 있는 무 게센서를 포함하고 있을 수도 있다. 수거조건을 만족하여 수거된 재활용품의 무게는, 전술한 사용자 보상처 리를 위한 기준 및/또는 재활용품 수거 시스템에 수거된 재활용품의 회수 시점 판단의 기준이 될 수 있다. 어떠한 경우든, 상기 카운팅부는 수거부로 넘어오는 상기 수거조건을 만족하는 재활용품들의 개 수(수량) 및/또는 무게를 포함하는 수거정보를 저장하여 상기 제어부를 통해 소정의 모니터링 시스템(20 0)으로 송출할 수 있다. 상기 모니터링 시스템은 도 6의 예시를 참조하여 설명하도록 한다. 도 6은 본 발명의 실시 예에 따른 모니터링 시스템을 설명하기 위한 도면이다. 도 6을 참조하면, 상기 제어부는 상기 카운팅부에서 수거되는 재활용품의 상기 수거정보를 전술 한 바와 같이, 무선통신망을 이용하여 모니터링 시스템으로 송출할 수 있어 복수 개에 재활용품 수거 시스 템들의 수거정보를 한 번에 확인 할 수 있다. 한편, 상기 모니터링 시스템은 다수개의 재활용품 수거 시스템의 수거부에 채워진 정도를 파악 할 수 있어 수거부의 공간이 부족하다고 판단되면 주변에 있는 수거센터로 상기 수거부의 채워짐 정 도를 알려 수거부를 비울 수 있도록 안내할 수 있다. 상기 제어부는 전술한 센싱부, 압축부, 수거부 및 알림부, 카운팅부를 제어 할 수 있는 구성을 가지고 있다. 도 3은 제어부의 시스템 구성을 나타낸 도면이다. 도 3을 참조하면, 상기 제어부는 판단모듈, 구분모듈, 통신모듈, 및/또는 제어모듈을 포함할 수 있다. 또한, 상기 제어부는 본 발명의 기술적 사상을 구현하기 위한 각각의 기능 또는 역할별로 별도로 구현되는 구성들의 집합을 의미할 수도 있다. 예를 들면, 판단모듈, 구분모듈, 통신모듈, 제어모듈 은 서로 다른 물리적 장치에 위치할 수도 있고, 동일한 물리적 장치에 위치할 수도 있다. 또한, 구현 예에 따라 서는 상기 판단모듈, 구분모듈, 통신모듈, 제어모듈은 등 각각의 모듈 역시 서로 다른 물 리적 장치에 위치하고, 서로 다른 물리적 장치에 위치한 구성들이 서로 유기적으로 결합되어 각각의 모듈들이 수행하는 기능을 실현할 수도 있다. 또한, 본 명세서에 모듈이라 함은, 본 발명의 기술적 사상을 수행하기 위한 하드웨어 및 상기 하드웨어를 구동 하기 위한 소프트웨어의 기능적, 구조적 결합을 의미할 수 있다. 에를 들면, 상기 모듈은 소정의 코드와 상기 소정의 코드가 수행되기 위한 하드웨어 리소스의 논리적인 단위를 의미할 수 있으며, 반드시 물리적으로 연결된"}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "코드를 의미하거나, 한 종류의 하드웨어를 의미하는 것은 아니므로 본 발명의 기술분야의 평균적 전문가에게는 용이하게 추론될 수 있다. 도 3을 참조하면, 판단모듈은 전술한 바와 같이 센싱부에서 수거 조건인 재활용품의 종류, 이물질 포 함 여부, 라벨 포함 여부, 착색 여부 등을 만족하는지에 대한 판단을 할 수 있다. 또한, 판단모듈은 투입된 재활용품이 수거조건에 만족하는지 판단하고, 판단결과 수거조건이 만족되면, 제어모듈이 압축부에서 재활용품이 압축될 수 있도록 제어할 수 있다. 또한, 구분 모듈은 전술한 바와 같이 센싱부 및 수거부에서 재활용품의 종류를 구별할 때, 재활용품의 색상의 유무 또는 재질 등에 따라서 재활용품의 종류 등을 판단하여 구별 할 수 있다. 도 3에 도시된 통신모듈은 전술한 바와 같이 카운팅부에서 무선통신(Wi-Fi 망, Lora 망, LTE-M 망, LTE 망 등)을 이용하여 재활용품 수거 시스템의 수거정보 및 배출현황 등을 모니터링 시스템에서 알 수 있도록 송출 할 때 사용 될 수 있다. 한편 본 발명의 다른 실시 예에 의하면, 통신 모듈은 알림부에서 수거조건을 만족하지 못할 경우 나 오는 음성정보 및 또는 텍스트 정보를 송출 할 수 있도록 한다. 또한, 재활용품 수거 시스템에서 오류가 발생할 경우 오류에 대한 안내를 모니터링 시스템으로 전송 해 빠르게 조치 할 수 있도록 한다. 도 8은 본 발명의 실시 예에 따른 재활용품 수거 시스템의 구현 예를 나타내는 도면이다. 도 8을 참조하면, 재활용품 수거 시스템은 재활용품이 투입구로 투입 되면 재활용품의 수거 조건, 재활용품의 종류, 착색의 여부 등을 판단 할 수 있으며, 판단결과 수거조건을 만족하는 경우에만 재활용 품에 대한 사용자 보상처리를 수행할 수 있다. 상기 투입구를 통해 들어온 재활용품은 전술한 바와 같이, 센싱부를 통해 재활용품의 이미지 를 센싱할 수 있으며 센싱된 이미지는 제어부에서 AI(인공지능)기술을 활용하여 이미지를 분석할 수 있어 수거조건, 재활용품의 종류, 착색의 여부 등을 판단할 수 있다. 상기 재활용품은 상기 수거조건을 만족하면 압축부(예를 들어, 120-1, 120-2, 120-3, 120-4)를 통해 소정의 크기로 압축될 수 있다. 상기 압축부(예를 들어, 120-1, 120-2, 120-3, 120-4)는 전술한 바와 같이, 위, 아래, 좌, 우로 압축 가능하며 또는 재활용품이 들어오는 방향에 따라 압축을 실시 할 수 있다. 상기 압축부(예를 들어, 120-1, 120-2, 120-3, 120-4)에서 압축된 재활용품은 종류에 따라 배출할 수 있도 록 구비된 수거부(예를 들어 130-1, 130-2, 130-n)로 수거될 수 있다. 또한, 상기 압축부(예를 들어, 120-1, 120-2, 120-3, 120-4)는 좌, 우로 구비된 판은 재활용품을 상기 수 거부(예를 들어 130-1, 130-2, 130-n)으로 보낼 때 구동 될 수도 있다. 상기 수거부(예를 들어 130-1, 130-2, 130-n)는 도 8에 도시된 바와 같이 두개로 설치 될 수 있고 전술한 바와 같이, 재활용품의 종류가 더 다양할 경우, 종류에 따라 각각 구비될 수 있어 수거부(예를 들어 130-1, 130- 2, 130-n)의 개수는 한정 하지 않는다. 또한, 상기 수거부(예를 들어 130-1, 130-2, 130-n)로 배출되는 재활용품의 수거정보를 확인 할 수 있는 카 운팅부가 구비 될 수 있다. 전술에 바와 같이, 상기 카운팅부는 상기 재활용품 수거 시스템에 구비되어 있는 센서로 배출되는 상 기 재활용품의 수량을 체크하거나 상기 수거부(예를 들어 130-1, 130-2, 130-n)내에 설치되어 있는 무게센 서로 배출되는 상기 재활용품의 무게를 측정할 수 있어 확인되는 수량 및 무게를 포함하는 수거정보를 수집 할 수 있다. 또한, 제어부는 카운팅부에서 수집되는 수거정보를 모니터링 시스템으로 전송 할 수 있다. 도 8에 도시된 바와 같이, 카운팅부는 수거함으로 배출되는 재활용품의 수거정보를 수집하기 위해 배 출구가 구비되어 있는 부분 또는 재활용품 수거 시스템과 수거부(예를 들어 130-1, 130-2, 130-n)가 연결되어 재활용품의 배출을 확인 할 수 있는 부분에 설치가 가능할 수 있다. 상기 사용자 보상처리는 재활용품의 수거조건 만족여부가 판단되면 수거정보(예를 들어, 개수(수량) 및/또 는 무게)를 활용하여 소정의 보상할 수 있다. 구현의 예에 따라, 수거조건을 만족한 재활용품이 배출구를 통과하면 재활용품의 수거정보(예를 들어, 개수(수량) 및/또는 무게)를 카운팅부에서 수집하여 전술한 바와 같이 소정의 보상을 할 수 있다. 이를 위해, 상기 재활용품 수거 시스템을 구현하기 위해 도 8과 같이 구성하였지만, 도 8은 단지 예시일 뿐 모든 시스템과 구성은 이에 한정 되지 않는다. 구현 예에 따라서, 상기 재활용품 수거 시스템은 프로세서 및 상기 프로세서에 의해 실행되는 프로그램을 저장하는 메모리를 포함할 수 있다. 상기 프로세서는 싱글 코어 CPU혹은 멀티 코어 CPU를 포함할 수 있다. 메모 리는 고속 랜덤 액세스 메모리를 포함할 수 있고 하나 이상의 자기 디스크 저장 장치, 플래시 메모리 장치, 또 는 기타 비휘발성 고체상태 메모리 장치와 같은 비휘발성 메모리를 포함할 수도 있다. 프로세서 및 기타 구성 요소에 의한 메모리로의 액세스는 메모리 컨트롤러에 의해 제어될 수 있다. 여기서, 상기 프로그램은, 프로세서 에 의해 실행되는 경우, 본 실시예에 따른 재활용품 수거 시스템으로 하여금, 상술한 재활용품 수거 방법 을 수행하도록 할 수 있다. 이러한 재활용품 수거 시스템의 과정은 도 7을 참조하여 설명하도록 한다. 도 7은 본 발명의 실시 예에 따른 재활용품 수거 시스템의 과정을 나타내는 도면이다. 도 7을 참조하면, 상기 재활용품 수거 시스템은 투입된 재활용품을 센싱하여(S100) 재활용품의 수거 조건 만족 여부를 판단(S110)할 수 있다. 판단결과 수거조건을 만족하는 경우 재활용품은 수거부(13 0)에서 종류에 맞는 수거함으로 수거 될 수 있으며(S120), 수거가 완료되면 정해진 소정의 사용자 보상처리를 하여 사용자에게 보상을 할 수 있다.(S130) 상기 수거조건을 만족하지 않는 경우 알림모듈을 통해 수거조건에 해당하지 못하였다는 지정된 알림(예를 들어, 안내문구 및 안내멘트)을 출력하게 된다(S120). 그리고 상기 수거조건을 만족하는 경우 재활용품은 압축하여 수거부로 수거될 수 있다. 한편, 본 발명의 실시 예에 따른 재활용품 수거 시스템 제공방법은 컴퓨터가 읽을 수 있는 프로그램 명령 형태 로 구현되어 컴퓨터로 읽을 수 있는 기록 매체에 저장될 수 있으며, 본 발명의 실시 예에 따른 제어 프로그램 및 대상 프로그램도 컴퓨터로 판독 가능한 기록 매체에 저장될 수 있다. 컴퓨터가 읽을 수 있는 기록 매체는 컴 퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록 장치를 포함한다. 기록 매체에 기록 되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 소프트웨어 분야 당업자에게 공지 되어 사용 가능한 것일 수도 있다. 컴퓨터로 읽을 수 있는 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체 (magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용 해서 전자적으로 정보를 처리하는 장치, 예를 들어, 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한 다. 상술한 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2021-0077117", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타나며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2021-0077117", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위해서 각 도면의 간단한 설명이 제공된다. 도 1은 본 발명의 실시 예에 따른 재활용품 수거 시스템의 구현 방식을 설명하기 위한 도면이다. 도 2는 본 발명의 실시 예에 따른 재활용품 수거 시스템의 구성을 개략적으로 나타내는 도면이다. 도 3은 본 발명의 실시 예에 따른 재활용품 수거 시스템의 제어부의 구성을 개략적으로 나타내는 도면이다. 도 4는 본 발명의 실시 예에 따른 재활용품 수거 시스템의 압축부를 설명하기 위한 도면이다. 도 5는 본 발명의 실시 예에 따른 재활용품 수거 시스템의 수거부를 설명하기 위한 도면이다. 도 6은 본 발명의 실시 예에 따른 모니터링 시스템을 설명하기 위한 도면이다. 도 7은 본 발명의 실시 예에 따른 재활용품 수거 시스템 제공방법의 개략적인 흐름을 나타낸다. 도 8은 본 발명의 실시 예에 따른 재활용품 수거 시스템의 구현 예를 나타내는 도면이다. 도 9는 본 발명의 실시 예에 따른 재활용품 수거 시스템의 고정부를 설명하기 위한 도면이다."}
