{"patent_id": "10-2023-0138493", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0055087", "출원번호": "10-2023-0138493", "발명의 명칭": "다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템 및 그 방법", "출원인": "(주)유니스소프트", "발명자": "조은희"}}
{"patent_id": "10-2023-0138493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다중 도메인 스마트 공장의 IT(Information Technology) 네트워크 환경 및 OT(Operational Technology) 네트워크 환경에서 발생되는 패킷 데이터를 수집하는 데이터 수집부;수집한 패킷 데이터를 분류 및 분석하여, 내부 정보 및 외부 정보를 포함하는 가공 데이터를 생성하는 데이터생성부; 및생성한 가공 데이터를 이용하여, 기설정된 다수의 시각화 분석 기법을 적용하여, 입체 시각화 데이터를 생성하고, 이를 외부로 전송하는 시각화 처리부;를 포함하는, 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템."}
{"patent_id": "10-2023-0138493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 시각화 처리부는상기 가공 데이터에 포함되는 내부 정보를 세부 분석하여, 기설정된 구성 요소 별 발생한 위협을 해당하는 네트워크의 계층 기준으로 분류하여 위험도를 분석하거나 또는, 보유한 자산(asset)들의 위험도를 분석하여, 입체시각화 데이터로 생성하는 제1 시각화부;상기 가공 데이터에 포함되는 외부 정보를 세부 분석하여, 발생한 위협들 간의 인과 관계를 시나리오 분석하고,추후 발생한 위협을 예측하여, 입체 시각화 데이터로 생성하는 제2 시각화부; 및상기 가공 데이터에 포함되는 내부 정보 및 외부 정보를 통합 분석하여, 다중 도메인 스마트 공장에 특화되도록기설정된 토폴로지에 맞추어 입체 시각화 데이터로 생성하는 제3 시각화부;를 포함하는, 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템."}
{"patent_id": "10-2023-0138493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "연산 처리 수단에 의해 각 단계가 수행되는 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템을 이용한 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법으로서,데이터 수집부에서, 다중 도메인 스마트 공장의 IT(Information Technology) 네트워크 환경 및 OT(OperationalTechnology) 네트워크 환경에서 발생되는 패킷 데이터를 수집하는 데이터 수집 단계(S100);데이터 생성부에서, 상기 데이터 수집 단계(S100)에 의해 수집한 패킷 데이터를 분류 및 분석하여, 내부 정보및 외부 정보를 포함하는 가공 데이터를 생성하는 데이터 생성 단계(S200); 및시각화 처리부에서, 상기 데이터 생성 단계(S200)에 의해 생성한 가공 데이터를 이용하여, 기설정된 다수의 시각화 분석 기법을 적용하여, 입체 시각화 데이터를 생성하고, 이를 외부로 전송하는 시각화 처리 단계(S300);를 포함하는, 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법."}
{"patent_id": "10-2023-0138493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 시각화 처리 단계(S300)는공개특허 10-2025-0055087-3-상기 가공 데이터에 포함되는 내부 정보를 세부 분석하여, 기설정된 구성 요소 별 발생한 위협을 해당하는 네트워크의 계층 기준으로 분류하여 위험도를 분석하거나 또는, 보유한 자산(asset)들의 위험도를 분석하여, 입체시각화 데이터로 생성하는 제1 시각화 단계(S310);를 포함하는, 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법."}
{"patent_id": "10-2023-0138493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3항에 있어서,상기 시각화 처리 단계(S300)는상기 가공 데이터에 포함되는 외부 정보를 세부 분석하여, 발생한 위협들 간의 인과 관계를 시나리오 분석하고,추후 발생한 위협을 예측하여, 입체 시각화 데이터로 생성하는 제2 시각화 단계(S320);를 포함하는, 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법."}
{"patent_id": "10-2023-0138493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3항에 있어서,상기 시각화 처리 단계(S300)는상기 가공 데이터에 포함되는 내부 정보 및 외부 정보를 통합 분석하여, 다중 도메인 스마트 공장에 특화되도록기설정된 토폴로지에 맞추어 입체 시각화 데이터로 생성하는 제3 시각화 단계(S330);를 포함하는, 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법."}
{"patent_id": "10-2023-0138493", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템 및 그 방법에 관한 것이다. 상세하게는, 본 발명은 IT 네트워크 환경과 OT 네트워크 환경이 융합된 스마트 공장에서 발생한 보안 위협 데이터를 시각화하여 제공함으로써, 위협 예측을 수행할 수 있는 기술에 관한 것이다."}
{"patent_id": "10-2023-0138493", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템 및 그 방법에 관한 것으 로, 보다 상세하게는 IT/OT가 융합된 스마트 공장 내에서 발생하는 패킷 데이터를 수집, 분석하여, 내/외부 인 텔리전스 정보로 분류/분석한 후, 이를 보안 위협 예측을 위한 입체 시각화 정보로 생성할 수 있는 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0138493", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 공장(smart factory)은 IT(Information Technology) 영역과 OT(Operational Technology) 영역이 융합되 어 있다. 이에 따라, 기존의 IT 보안 위협과 이에 따라 야기된 OT 영역의 보안 위협, 그리고 외부 인터넷망과 직접 연결 되어 있기 때문에, 발생하는 OT 영역에 대한 다양한 보안 위협이 있을 수 있다. 즉, 폐쇄망 형태의 내부 공장망(OT 네트워크 영역)이 IT 네트워크와 통합/융합됨으로써, IT 네트워크를 이용하 여 외부에서 OT 네트워크 영역을 용이하게 모니터링할 수 있게 되므로, 이에 따른 다양한 보안 위협이 뒤따를 수 밖에 없다. IT 보안 위협은 오픈 네트워크인 만큼 기존에 알려진 정보가 풍부하나, 패쇄 네트워크인 OT 보안 위협은 외부 공격에 취약한 실정이다. 상세하게는, OT는 산업운영관리 컴퓨팅 시스템으로서, 산업 장비, 자산, 프로세스 및 이벤트를 직접 감시 또는 제어함으로써 변화를 감지하거나 이를 유발하는 하드웨어와 소프트웨어를 의미한다. 이러한 OT에는 산업 제어 시스템(ICS), 작업 공정 감시 제어 시스템(SCADA), 프로그램 가능한 논리 제어 장치 (PLC) 및 분산 제어 시스템(DCS) 등의 다양한 산업 기술 시스템이 포함되며, 특히, ICS는 산업 생산에서 사용되 는 SCADA, DCS 및 PLC와 각종 산업용 장치와 같은 시스템을 포함한 여러 종류의 제어 시스템을 통칭한다.ICS는 스마트 공장에서 매우 중요한 시스템으로서 한 개의 설비라도 문제가 발생하는 전체 공장의 작업이 중단 되는 등 사소한 문제라도 큰 피해 규모라 상당할 수 있다. 이에 따라, IT/OT가 융합된 스마트 공장에서 발생할 수 있는 보안 위협 예측을 위한 방안이 요구되고 있다. 이와 관련해서, 국내 공개 특허 제10-2023-0077073호(\"ICS/OT 네트워크에 대한 패시브 핑거프린트 및 보안위협 분석 시스템\")에서는 ICS/OT 네트워크 환경에서 패시브 모니터링을 통하여 산업용 기기 및 제어 프로토콜을 분 석하여 핑거프린트 정보를 추출하고 이와 연계하여 보안 위협을 분석하는 기술을 개시하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2023-0077073호(공개일자 2023.06.01.)"}
{"patent_id": "10-2023-0138493", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상기한 바와 같은 종래 기술의 문제점을 해결하기 위하여 안출된 것으로, 본 발명의 목적은 IT/OT가 융합 환경에서의 스마트 공장은 보안을 위협하는 공격의 경로 탐색만으로는 위협에 대한 정보가 불충분 하기 때문에, 위협받고 있는 자산들이 공장 구성도에서 어디에 위치하고 어떤 방향으로 진행하고 있는지에 대해 서 시각화 정보로 제공할 수 있는 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템 및 그 방법을 제공함에 있다."}
{"patent_id": "10-2023-0138493", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명의 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템은, 다중 도메인 스마트 공장의 IT(Information Technology) 네트워크 환경 및 OT(Operational Technology) 네트워크 환경에서 발생되는 패킷 데이터를 수집하는 데이터 수집부, 수집한 패킷 데이터를 분류 및 분석하여, 내부 정보 및 외부 정보를 포함하는 가공 데이터를 생성하는 데이터 생성부 및 생 성한 가공 데이터를 이용하여, 기설정된 다수의 시각화 분석 기법을 적용하여, 입체 시각화 데이터를 생성하고, 이를 외부로 전송하는 시각화 처리부를 포함하는 것이 바람직하다. 더 나아가, 상기 데이터 생성부는 수집한 패킷 데이터를 분류 및 분석하여, 상기 IT 네트워크 환경 또는, 상기 OT 네트워크 환경에 의해 기설정된 정보를 분류하여 내부 정보로 설정하는 내부 생성부를 포함하는 것이 바람직 하다. 더 나아가, 상기 데이터 생성부는 수집한 패킷 데이터를 분류 및 분석하여, 기설정된 복수의 위협 관련 정보를 분석하여 외부 정보로 설정하는 외부 생성부를 더 포함하되, 상기 복수의 위협 관련 정보는 화이트 리스트 기반 공격 정보, 기설정된 프레임워크 기반 공격 유형 정보, 기설정된 OT 프로토콜의 취약점 정보, 트래픽 정보 및 AI 기반 이상 탐지/예측 정보를 포함하는 것이 바람직하다. 더 나아가, 상기 시각화 처리부는 상기 가공 데이터에 포함되는 내부 정보를 세부 분석하여, 기설정된 구성 요 소 별 발생한 위협을 해당하는 네트워크의 계층 기준으로 분류하여 위험도를 분석하거나 또는, 보유한 자산 (asset)들의 위험도를 분석하여, 입체 시각화 데이터로 생성하는 제1 시각화부를 포함하는 것이 바람직하다. 더 나아가, 상기 시각화 처리부는 상기 가공 데이터에 포함되는 외부 정보를 세부 분석하여, 발생한 위협들 간 의 인과 관계를 시나리오 분석하고, 추후 발생한 위협을 예측하여, 입체 시각화 데이터로 생성하는 제2 시각화 부를 포함하는 것이 바람직하다. 더 나아가, 상기 시각화 처리부는 상기 가공 데이터에 포함되는 내부 정보 및 외부 정보를 통합 분석하여, 다중 도메인 스마트 공장에 특화되도록 기설정된 토폴로지에 맞추어 입체 시각화 데이터로 생성하는 제3 시각화부를 포함하는 것이 바람직하다. 상기한 바와 같은 목적을 달성하기 위한 연산 처리 수단에 의해 각 단계가 수행되는 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템을 이용한 다중 도메인 스마트 공장의 보안 위협 예측을 위한시각화 정보 제공 방법으로서, 데이터 수집부에서, 다중 도메인 스마트 공장의 IT(Information Technology) 네 트워크 환경 및 OT(Operational Technology) 네트워크 환경에서 발생되는 패킷 데이터를 수집하는 데이터 수집 단계(S100), 데이터 생성부에서, 상기 데이터 수집 단계(S100)에 의해 수집한 패킷 데이터를 분류 및 분석하여, 내부 정보 및 외부 정보를 포함하는 가공 데이터를 생성하는 데이터 생성 단계(S200) 및 시각화 처리부에서, 상 기 데이터 생성 단계(S200)에 의해 생성한 가공 데이터를 이용하여, 기설정된 다수의 시각화 분석 기법을 적용 하여, 입체 시각화 데이터를 생성하고, 이를 외부로 전송하는 시각화 처리 단계(S300)를 포함하는 것이 바람직 하다. 더 나아가, 상기 데이터 생성 단계(S200)는 수집한 패킷 데이터를 분류 및 분석하여, 상기 IT 네트워크 환경 또 는, 상기 OT 네트워크 환경에 의해 기설정된 정보를 분류하여 내부 정보로 설정하는 내부 생성 단계(S210) 및 수집한 패킷 데이터를 분류 및 분석하여, 기설정된 복수의 위협 관련 정보를 분석하여 외부 정보로 설정하는 외 부 생성 단계(S220)를 포함하며, 상기 복수의 위협 관련 정보는 화이트 리스트 기반 공격 정보, 기설정된 프레 임워크 기반 공격 유형 정보, 기설정된 OT 프로토콜의 취약점 정보, 트래픽 정보 및 AI 기반 이상 탐지/예측 정 보를 포함하는 것이 바람직하다. 더 나아가, 상기 시각화 처리 단계(S300)는 상기 가공 데이터에 포함되는 내부 정보를 세부 분석하여, 기설정된 구성 요소 별 발생한 위협을 해당하는 네트워크의 계층 기준으로 분류하여 위험도를 분석하거나 또는, 보유한 자산(asset)들의 위험도를 분석하여, 입체 시각화 데이터로 생성하는 제1 시각화 단계(S310)를 포함하는 것이 바람직하다. 더 나아가, 상기 시각화 처리 단계(S300)는 상기 가공 데이터에 포함되는 외부 정보를 세부 분석하여, 발생한 위협들 간의 인과 관계를 시나리오 분석하고, 추후 발생한 위협을 예측하여, 입체 시각화 데이터로 생성하는 제 2 시각화 단계(S320)를 포함하는 것이 바람직하다. 더 나아가, 상기 시각화 처리 단계(S300)는 상기 가공 데이터에 포함되는 내부 정보 및 외부 정보를 통합 분석 하여, 다중 도메인 스마트 공장에 특화되도록 기설정된 토폴로지에 맞추어 입체 시각화 데이터로 생성하는 제3 시각화 단계(S330)를 포함하는 것이 바람직하다."}
{"patent_id": "10-2023-0138493", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템 및 그 방법은 IT 네트워크 환경과 OT 네트워크 환경이 융합된 스마트 공장에서 발생한 보안 위협 데이터를 시각화하여 제공함 으로써, 위협 예측을 수행할 수 있는 장점이 있다. 이 때, 다중 도메인 스마트 공장의 경우, 위협을 빠르게 예측하고 대응하기 위해, 위협의 위치와 방향성이 중요 하기 때문에, 공격 경로 상의 자산들의 계층 정보와 공장 구성도를 기준으로 위협받고 있는 자산들이 어디에 위 치하고 어떤 방향으로 위협이 진행되고 있는지 입체 시각화 처리하여 제공함으로써, 더 정확하고 풍부한 위협 정보 분석에 이용되도록 하는 장점이 있다."}
{"patent_id": "10-2023-0138493", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 상기한 바와 같은 구성을 가지는 본 발명에 의한 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각 화 정보 제공 시스템 및 그 방법을 첨부된 도면을 참고하여 상세하게 설명한다. 다음에 소개되는 도면들은 당업 자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 예로서 제공되는 것이다. 따라서, 본 발명은 이하 제시되는 도면들에 한정되지 않고 다른 형태로 구체화될 수도 있다. 또한, 명세서 전반에 걸쳐서 동일한 참조번 호들은 동일한 구성요소들을 나타낸다.이때, 사용되는 기술 용어 및 과학 용어에 있어서 다른 정의가 없다면, 이 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 통상적으로 이해하고 있는 의미를 가지며, 하기의 설명 및 첨부 도면에서 본 발명의 요지를 불필요하게 흐릴 수 있는 공지 기능 및 구성에 대한 설명은 생략한다. 더불어, 시스템은 필요한 기능을 수행하기 위하여 조직화되고 규칙적으로 상호 작용하는 장치, 기구 및 수단 등 을 포함하는 구성 요소들의 집합을 의미한다. 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템 및 그 방법은, 스마트 공장에 포함되는 설비의 가용성을 보장하도록 발생할 보안 위협을 빠르게 예측하고 대응하기 위 해, 발생되는 패킷 데이터를 수집하여 입체 시각화 데이터를 생성하여 제공하는 기술에 관한 것이다. 스마트 공장에 포함되는 설비의 가용성을 보장하도록 보안 위협을 빠르게 예측하고 대응하기 위해서는, 예측되 는 보안 위협의 위치와 방향성이 중요하다. IT 네트워크 영역과 OT 네트워크 영역이 융합된 스마트 공장을 구성하는 계층 정보는 L0 ~ L5로 나뉘게 되며, 이는 OT 영역에서부터 IT 영역까지 구분시켜 표현할 수 있으며, IT/OT 융합 환경에서 더욱 중요한 요소에 해당 한다. 스마트 공장에서 위협 방향성은 공격의 경로 탐색만으로는 불충분하며, 공격 경로 상의 자산들의 계층(level) 정보, 즉, 자산들의 물리적 위치, 장비의 명칭, 장비의 용도 등을 포함하고 있어야 더 정확하고 풍부한 위협 정 보 분석이 가능하게 된다. 즉, 위협받고 있는 자산들이 공장 구성도에서 어디에 위치하고 있으며, 위협이 어떤 방향으로 진행되고 있는지 를 시각화하여 외부 관리자(사용자 등)에게 제공할 필요가 있다. 이에 따라, 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템 및 방법을 통해서, 단일 공격들이 서로 인과 관계를 가지고 연결될 때, 공격의 최종 목표 예측에 필요한 근거 자료들이 드러날 수 있다는 점을 기반으로, 공장 배치도(구성도)에 단일 공격들이 유기적으로 연결되고, 연결된 정보들을 표현함으로써, 외부 관리자는 이를 통해서 위협 대응을 위한 다양한 해석을 수행할 수 있는 장 점이 있다. 더불어, 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스 템 및 방법을 통해서, 매트릭스 TTPs 분류 기준 기반의 위협 행위를 표시하는 것에서 더 나아가, 공격들(위협 행위들) 간 유기적인 상관 관계를 분석하여, 공격 절차/공격 순서를 시각화하여 공격의 목적에 따른 방향(목적 적 의미)을 표현함으로써, 외부 관리자는 이를 통해서, 위협을 보다 정밀하게 위협을 예측하고 대응할 수 있는 장점이 있다. 도 1은 본 발명의 일 실시예에 따른 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템을 나타낸 구성 예시도이다. 도 1을 참조로 하여 본 발명의 일 실시예에 따른 다 중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템을 상세히 설명하고자 한다. 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템은 도 1에 도시된 바와 같이, 데이터 수집부, 데이터 생성부 및 시각화 처리부를 포함하게 된다. 각 구성들은 MCU를 포함하는 연산처리수단에 각각 또는 통합 구성되어 동작을 수행하는 것이 바람직하다. 각 구성에 대해서 자세히 알아보자면, 상기 데이터 수집부는 다중 도메인 스마트 공장의 IT(Information Technology) 네트워크 환경 및 OT(Operational Technology) 네트워크 환경에서 발생되는 패킷 데이터를 수집하는 것이 바람직하다. 여기서, 스마트 공장이란, 기획/설계, 생산, 유통/판매에 이르는 제조 과정의 전부 또는, 일부 과정에 사물 인 터넷(IoT), 인공지능(AI), 빅데이터와 같은 정보통신 기술을 적용하여 기업의 생산성과 생산 제품의 품질을 향 상시키는 지능형 공장을 의미한다. 또한, 도메인(Domain)이란, 해당 공장에서의 생산 제품의 분류에 따라 구분되는 것을 의미한다. 이에 따라, '다중 도메인 스마트 공장'이란, 하나 이상의 도메인(일 예를 들자면, '반도체 제조', '핸드폰 제조' 등)으로 구성되고, 한 도메인마다 다수의 공장을 보유한 스마트 공장을 의미한다. 또한, IT 네트워크 환경은 정보 기술을 의미하며, 컴퓨터와 관련된 하드웨어, 소프트웨어, 네트워크, 데이터베 이스 등을 포함하는 모든 기술을 의미한다. OT 네트워크 환경은 운영 기술을 의미하며, 이는 주로 산업용 기계나 공정의 운영을 위한 기술로 ICS를 비롯하 여 SCADA, PLC, DOC 등의 다양한 기술이 포함된다. ICS는 산업 생산에서 사용되는 SCADA, DCS 및 PLC와 Field Device와 같은 시스템을 포함한 여러 종류의 제어 시 스템을 의미한다. IT 네트워크 영역과 OT 네트워크 영역이 융합된 스마트 공장을 구성하는 각 계층 정보는 퍼듀 모델을 기초로 정 의되며, ICS 네트워크 분할을 위한 개념으로 사용되고 있으며, 일반적인 ICS의 모든 주요 구성 요소의 상호 연 결 및 상호 종속성을 보여주는 참조 모델이다. 레벨 0 ?? 3은 OT 시스템을 표시하며, 레벨 4 ?? 5는 IT 시스템 을 표시한다. 레벨 0은 프로세스(process) 레벨로, 프로세스를 수행하는 장비들이 위치하는 영역이다. 센서, 액추에이터, 펌 프, 밸브 등이 위치하며, 이곳의 장비들은 중단 없이 원활히 동작이 이루어져야 한다. 이 영역의 단일 장비에서 문제가 발생하면 전체 시설에 문제가 발생할 수 있다. 레벨 1 ?? 2는 통제(control) 레벨로, 모든 제어 장비가 모여 있는데 밸브를 열고 액추에이터를 움직이고 모터 를 가동시키는 등의 역할을 수행한다. PLC, 가변 주파수 드라이브, 전용 비례 적분 파생 컨트롤러 등이 위치하 고, 레벨 2의 PLC는 감독의 역할을 수행하고, 레벨 1의 PLC는 제어의 역할을 수행한다. 레벨 3은 운영(operations) 레벨로, 시설 전체의 제어 기능과 모니터링을 담당하는 시스템이 위치하게 된다. 운 영자는 이 레벨에서 전체 OT 시스템을 모니터링하고 관리하게 된다. 시설을 동작시키는 모든 시스템에 대한 개 요를 제공하는 HMI 및 운영 장비가 모여 있는 중앙 집중적 제어실의 역할을 수행하게 된다. 하위 레벨에서 바은 데이터들을 수집하는 시스템들이 위치해 있으며, 레벨 4에 위치한 IT 시스템에 이를 보고하고 쿼리를 보내게 된 다. 일반적으로 데이터베이스, 어플리케이션 서버(웹, 보고), 파일 서버, 마이크로소프트 도메인 컨트롤러, HMI 서버 엔지니어링 워크스테이션 등이 위치하게 된다. 레벨 4 ?? 5는 엔터프라이즈(enterprise) 레벨로, 일반적으로 ERP 및 SAP와 같은 비즈니스 시스템이 사용되는 구역이다. 보통 레벨 4는 모든 IT 시스템의 본거지로, 공장에서 생상하는 모든 프로세스를 지원하게 된다. 데이 터베이스 서버, 애플리케이션 서버(웹, MES), 파일 서버, 이메일 클라이언트 등의 시스템들이 속하게 된다. 레 벨 5는 기업 레벨에 위치하게 되며, 개별 공장의 서브 시스템 데이터를 수신받고, 누적된 데이터를 기반으로 전 반적인 공장 설비의 생산 상태, 재고 및 수요를 보고하는데 사용하게 된다. 이를 바탕으로, 상기 데이터 수집부는 다중 도메인 스마트 공장의 IT 네트워크 환경 및 OT 네트워크 환경 에서 발생되는, 다시 말하자면, 여러 계층으로 이루어지는 스마트 공장 환경에서 발생되는 패킷 데이터를 수집 하는 것이 바람직하다. IT 네트워크 환경에서의 사용되는 프로토콜 뿐 아니라, OT 네트워크 환경에서 발생하는 다양한 프로토콜 별로 패킷 데이터를 수집하게 된다. 상기 데이터 생성부는 수집한 패킷 데이터를 분류 및 분석하여, 내부 정보 및 외부 정보를 포함하는 가공 데이터를 생성하는 것이 바람직하다. 즉, 상기 데이터 생성부는 상기 데이터 수집부에 의해 수집한 패킷 데이터를 분류 및 분석하여, 내부 정보 및 외부 정보를 포함하는 가공 데이터로 저장 처리하게 된다. 이를 위해, 상기 데이터 생성부는 도 1에 도시된 바와 같이, 내부 생성부와 외부 생성부를 포함 하게 된다. 상기 내부 생성부는 수집한 패킷 데이터를 분류 및 분석하여, 상기 IT 네트워크 환경 또는, 상기 OT 네트 워크 환경에 의해 미리 설정된 정보를 분류하여 내부 정보로 설정하는 것이 바람직하다. 즉, 상기 미리 설정된 정보로 IT/OT 네트워크 환경에서 고정되어 제공되는 정보를 의미하며, 자산 정보(이름, 유형 등), 자산 위치(물리적 위치), IP, 도메인, 제공하는 서비스 포트 등을 포함하게 된다. 상기 외부 생성부는 수집한 패킷 데이터를 분류 및 분석하여, 미리 설정된 복수의 위협 관련 정보를 분석 하여 외부 정보로 설정하는 것이 바람직하다. 상기 외부 정보는 네트워크 및 공장 운영 중에 발생한 실시간 데이터를 이용해서 판단한 정보로, 상기 미리 설 정된 복수의 위협 관련 정보는 화이트 리스트 기반 공격 정보, 미리 설정된 프레임워크 기반 공격 유형 정보, 미리 설정된 OT 프로토콜의 취약점 정보, 트래픽 정보 및 AI 기반 이상 탐지/예측 정보를 포함하게 된다. 상세하게는, 화이트 리스트 기반 공격 정보는 화이트 리스트에 해당하는 정상적인 유형 이외의 비정상 유형을 판단하기 위함으로, 일 예를 들자면, 수집한 패킷 데이터를 이용하여, 비인가 IP에 접근하거나 또는, 비인가 서 비스 사용이 감지 여부를 분석하여, 해당하는 패킷 데이터를 분류하여 외부 정보로 설정하게 된다. 미리 설정된 프레임워크 기반 공격 유형 정보는 수집한 패킷 데이터를 이용하여, 미리 설정된 프레임워크인 MITRE ATT&CK에 맞추어 탐지 정책을 관리하고 구성하여 외부 정보로 설정하게 된다. 이를 통해서, 위협 요소 별 현황 파악을 용이하게 수행할 수 있다. 이 때, MITRE ATT&CK는 미국 연방 정부(NIST) 지원을 받아서 사이버 위협 공격에 대한 패턴을 항목 별로 분석 및 정리하여 효과적인 보안을 위한 단계별 매트릭스를 제공하게 된다. 미리 설정된 OT 프로토콜의 취약점 정보는 OT 프로토콜 별 보안 취약점에 따른 이상 판단을 위하여, 미리 설정 되게 된다. 이를 통해서 수집한 패킷 데이터를 이용하여, 미리 설정된 OT 프로토콜 별 보안 취약점에 대응하여, 해당하는 패킷 데이터를 분류하여, 외부 정보로 설정하게 된다. 일 예를 들자면, 특정 통제 레벨에서 사용 불가능 한 쓰기 권한의 명령이 발생할 경우, 또는, IoT 온도 센서 장 비에서 측정한 운영 데이터가 정상 범위를 벗어나는 경우가 OT 프로토콜 별 보안 취약점으로 설정될 경우, 수집 한 패킷 데이터가 해당하는지 판단하여 외부 정보로 설정하게 된다. 트래픽 정보는 수집한 패킷 데이터의 트래픽 트렌드 분석을 통한 이상 징후를 탐지하는 것을 의미한다. AI 기반 이상 탐지/예측 정보는 설비(자산) 운영 데이터와 수집한 패킷 데이터와 Rule 기반 비정상 판단 결과를 AI를 통해 학습하고, 학습 모델을 이용하여, 입력되는 패킷 데이터를 처리하여 이상 징후를 예측하고 그 결과에 따라 외부 정보로 설정하게 된다. 상기 시각화 처리부는 상기 데이터 생성부에 의해 생성한 가공 데이터를 이용하여, 미리 설정된 다수 의 시각화 분석 기법을 적용하여, 입체 시각화 데이터를 생성하는 것이 바람직하다. 상기 시각화 처리부는 생성한 상기 입체 시각화 데이터를 외부(관리자, 사용자 등)에게 전송하여, IT/OT 융합 환경에서의 스마트 공장 에 적합한 보안 위협 예측 시각화 프로세스를 제공하게 된다. 상기 시각화 처리부는 도 1에 도시된 바와 같이, 제1 시각화부, 제2 시각화부 및 제3 시각화부 를 포함하게 된다. 상기 제1 시각화부는 상기 가공 데이터에 포함되는 내부 정보를 세부 분석하여, 미리 설정된 구성 요소 별 발생한 위협을 해당하는 네트워크의 계층 기준으로 분류하여 위험도를 분석하거나 또는, 보유한 자산(asset)들 의 위험도를 분석하여, 입체 시각화 데이터로 생성하는 것이 바람직하다. 상세하게는, 상기 제1 시각화부는 상기 내부 정보 중 스마트 공장의 구성 요소 기준이 되고, 공장의 주요 한 모니터링 대상으로 분류될 수 있는 도메인, 공장, 계층, 자산 기준으로 발생한 위협들을 시각화하는 것이 바 람직하다. 상기 제1 시각화부의 일 예를 들자면, 도 2 및 도 3에 도시된 바와 같이, 전체 도메인을 기준으로 선택한 도메인/선택한 공장에서 발생한 위협을 계층(level)으로 분류하여 시각화 처리를 수행하게 된다. 이 때, 시간대 (timeline) 별 요소를 반영하여, 입체 시각화 데이터로 생성할 수 있으며, 도 2 및 도 3처럼, heatmap 등을 이 용하여 생성하는 것이 가장 바람직하다. 상기 제1 시각화부의 또다른 예를 들자면, 공장 기준으로 보유한 자산들의 위험도를 판단하고, 그 목록 (list)을 시각화하여 데이터로 생성하는 것이 바람직하다. 상기 제2 시각화부는 상기 가공 데이터에 포함되는 외부 정보를 세부 분석하여, 발생한 위협들 간의 인과 관계를 시나리오 분석하고, 추후 발생한 위협을 예측하여, 입체 시각화 데이터로 생성하는 것이 바람직하다. 상세하게는, 상기 데이터 수집부에 의해 수집한 패킷 데이터가 상기 데이터 생성부에 의해 MITRE ATT&CK의 프레임워크에 맞추어, 공격전술과 공격기술로 분류되어 외부 정보로 설정되게 된다. 상기 제2 시각화부는 이를 이용하여, 스마트 공장 환경인 IT/OT 융합 환경에서 발생한 위협 행위를 분류/ 분석하여, 이를 매트릭스 형태 정보로 표시되도록 입체 시각화 데이터를 생성하는 것이 바람직하다.상기 제2 시각화부에 의해 생성한 상기 입체 시각화 데이터는 발생한 위협행위들 간의 인과관계를 시나리 오 분석하고, 추후 발생 가능한 위협을 예측하게 된다. 이 때, 발생한 위협 행위들 간의 인과관계의 시나리오 분석은 선택한 임의의 위협 행위를 기준으로, 발생 시간, 출발지 IP, 도착지 IP, 포트, 공격 유형 등의 인과 관계를 분석하여, 해당하는 위협 행위의 공격 흐름도를 파악 하게 된다. 이를 통해서, 위협 행위의 최종 목표 및 위협 예측이 가능하게 된다. 더불어, 상기 제2 시각화부 는 선택한 임의의 위협 행위를 기준으로, 발생 시간, 출발지 IP, 도착지 IP, 포트, 공격 유형 등의 인과 관계를 분석하기 위하여, 각 변수들의 특성값(feature) 정보를 이용하는 것이 가장 바람직하다. 상기 제3 시각화부는 상기 가공 데이터에 포함되는 내부 정보 및 외부 정보를 통합 분석하여, 다중 도메인 스마트 공장에 특화되도록 미리 설정된 토폴로지에 맞추어 입체 시각화 데이터로 생성하는 것이 바람직하다. 상세하게는, 상기 제3 시각화부는 다중 도메인 스마트 공장의 내부 정보와 외부 정보를 결합하여, 스마트 공장 토폴로지에 상기 내부 정보와 외부 정보를 시각화 처리함으로써, 이상 징후가 탐지된 위협을 분석하고, 이 상 징후를 예측할 수 있는 입체 시각화 데이터를 생성하게 된다. 이 때, 도 4에 도시된 바와 같은, 다중 도메인 스마트 공장에 특화된 토폴로지를 설정하기 위하여, 사전에 데이 터 셋을 구성하게 된다. 도메인 노드와 링크 정보를 데이터 셋으로 구성한 후, 도메인 노드에 속하는 공장 노드가 존재하는지 판단하게 된다. 존재할 경우, 해당하는 공장 노드와 링크 정보를 데이터 셋에 추가하게 된다. 이 후, 해당하는 레벨 노드 와 링크 정보를 데이터 셋에 추가한 후, 레벨 노드에 속하는 자산 노드가 존재하는지 판단하게 된다. 존재할 경 우, 해당하는 자산 노드와 링크 정보를 데이터 셋에 추가하게 된다. 이 후, 자산 노드에서 발생한 위협 정보가 있는지 판단하여, 위협 정보가 있을 경우, 해당 자산 노드에서 발생한 위협 정보를 추출하여 데이터 셋에 삽입 하고, 해당 시간대에 발생한 동일 위협 유형을 모두 검색하여 데이터 셋에 삽입하게 된다. 이와 달리, 위협 정 보가 없을 경우, 추가하지 않은 도메인 노드가 있는지 판단하여, 있다면, 상술한 과정을 반복하게 된다. 없다면, 위협 정보의 출발지 또는 도착지 정보에 외부 노드가 존재하는지 판단하게 된다. 존재할 경우, 해당하 는 외부 노드와 링크 정보를 데이터 셋에 추가하게 된다. 이 후, 외부 노드에서 발생한 위협 정보가 있는지 판 단하여, 위협 정보가 있을 경우, 해당하는 외부 노드에서 발생한 위협 정보를 추출하여 데이터 셋에 삽입하고, 해당 시간대에 발생한 동일 위협 유형을 모두 검색하여 데이터 셋에 삽입하게 된다. 이를 기반으로, 상기 제3 시각화부는 다중 도메인 스마트 공장에 특화된 토폴로지를 구성/설정하게 된다. 상세하게는, 다중 도메인 스마트 공장에 특화된 도메인, 공장, 레벨 별 자산 노드와 외부 공격 노드 순으로 계 층 관계를 맵으로 시각화하여 분석이 용이하도록 표시하게 된다. 또한, 각 노드 별(도메인, 공장, 레벨, 자산, 외부)로 위험도 현황 상태가 구분되도록 각각의 색으로 처리하게 된다. 더불어, 공격 발생 시, 공격의 진행 방 향이 표시될 수 있도록 이 역시 각각의 색으로 처리하는 것이 바람직하며, 노드 간 트래픽 량에 대한 가시성이 확보될 수 있도록 선 굵기로 구분하여 입체 시각화 데이터로 생성하게 된다. 또다른 예를 들자면, 상기 제3 시각화부는 도 5에 도시된 바와 같이, 노드 별 내부 정보를 표시하여 입체 시각화 데이터를 생성하게 된다. 상세하게는, End 노드(자산 노드 또는, 외부 노드)의 내부 정보를 표시하는 것으로, 자산 노드의 경우, 자산명,"}
{"patent_id": "10-2023-0138493", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "IP정보를 표시하고, 외부 정보를 요약한 위험도 종합 점수가 표시되도록 입체 시각화 데이터를 생성하고, 외부 노드의 경우, IP, Port, 최근 로그 발생 시간 등의 정보가 표시되도록 입체 시각화 데이터를 생성하게 된다. 다른 예를 들자면, 상기 제3 시각화부는 스마트 공장의 자산 설비 운영의 이상 징후를 탐지하여, 입체 시 각화 데이터를 생성하게 된다. 스마트 공장 자신의 설비 운영 이상/이상 징후는 공장의 가용성에 큰 영향을 끼치게 된다. 그렇기 때문에, 이에 대한 현황 파악이 용이하도록, 상기 제3 시각화부는 공장 설비 운영 이상/이상 징후가 감지될 경우, 이를 토폴로지에서 별도의 특수 기능(일 예를 들자면, 깜박이는 형태)이 적용되도록 입체 시각화 데이터를 생성하게 된다. 이를 통해서, 도 4와 같이 다중 도메인 스마트 공장에 특화된 토폴로지에 맞추어 생성된 정보에서 이상 징후가 탐지된 노드 또는, 이상 탐지된 노드가 깜빡이는 형태로 나타나게 된다. 추가적으로, 상기 제3 시각화부는 도 6 및 7에 도시된 바와 같이, 하나의 자산 노드 대상으로 발생한 다수 위협을 분석하여 입체 시각화 데이터로 생성하게 된다.상세하게는, 하나의 자산 노드에서 발생한 다수의 보안 위협을 목록화하여 표시하게 된다. 이를 통해서 특정 보 안 위협 항목을 선택하여 해당 위협에 대한 상세한 토폴로지 화면이 제공되도록 입체 시각화 데이터를 생성할 수 있으며, 더 나아가 연관 노드 중심으로 공격 노드 정보와 공격 노드의 방향 정보를 표시하여 입체 시각화 데 이터로 제공하게 된다. 도 8은 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법 을 나타낸 순서 예시도이다. 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법은 연산 처리 수단에 의해 각 단계가 수행되는 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시 스템을 이용한 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법으로서, 도 8에 도시된 바와 같이, 데이터 수집 단계(S100), 데이터 생성 단계(S200) 및 시각화 처리 단계(S300)를 포함하게 된다. 각 단계에 대해서 자세히 알아보자면, 상기 데이터 수집 단계(S100)는 상기 데이터 수집부에서, 다중 도메인 스마트 공장의 IT(Information Technology) 네트워크 환경 및 OT(Operational Technology) 네트워크 환경에서 발생되는 패킷 데이터를 수집하 게 된다. 다시 말하자면, 여러 계층으로 이루어지는 스마트 공장 환경에서 발생되는 패킷 데이터를 수집하게 되며, IT 네 트워크 환경에서의 사용되는 프로토콜 뿐 아니라, OT 네트워크 환경에서 발생하는 다양한 프로토콜 별로 패킷 데이터를 수집하게 된다. 상기 데이터 생성 단계(S200)는 상기 데이터 생성부에서, 상기 데이터 수집 단계(S100)에 의해 수집한 패 킷 데이터를 분류 및 분석하여, 내부 정보 및 외부 정보를 포함하는 가공 데이터를 생성하게 된다. 상기 데이터 생성 단계(S200)는 도 8에 도시된 바와 같이, 내부 생성 단계(S210)와 외부 생성 단계(S220)를 포 함하게 된다. 상기 내부 생성 단계(S210)는 수집한 패킷 데이터를 분류 및 분석하여, 상기 IT 네트워크 환경 또는, 상기 OT 네트워크 환경에 의해 미리 설정된 정보를 분류하여 내부 정보로 설정하게 된다. 즉, 상기 미리 설정된 정보로 IT/OT 네트워크 환경에서 고정되어 제공되는 정보를 의미하며, 자산 정보(이름, 유형 등), 자산 위치(물리적 위치), IP, 도메인, 제공하는 서비스 포트 등을 포함하게 된다. 상기 외부 생성 단계(S220)는 수집한 패킷 데이터를 분류 및 분석하여, 미리 설정된 복수의 위협 관련 정보를 분석하여 외부 정보로 설정하게 된다. 상기 외부 정보는 네트워크 및 공장 운영 중에 발생한 실시간 데이터를 이용해서 판단한 정보로, 상기 미리 설 정된 복수의 위협 관련 정보는 화이트 리스트 기반 공격 정보, 미리 설정된 프레임워크 기반 공격 유형 정보, 미리 설정된 OT 프로토콜의 취약점 정보, 트래픽 정보 및 AI 기반 이상 탐지/예측 정보를 포함하게 된다. 상세하게는, 화이트 리스트 기반 공격 정보는 화이트 리스트에 해당하는 정상적인 유형 이외의 비정상 유형을 판단하기 위함으로, 일 예를 들자면, 수집한 패킷 데이터를 이용하여, 비인가 IP에 접근하거나 또는, 비인가 서 비스 사용이 감지 여부를 분석하여, 해당하는 패킷 데이터를 분류하여 외부 정보로 설정하게 된다. 미리 설정된 프레임워크 기반 공격 유형 정보는 수집한 패킷 데이터를 이용하여, 미리 설정된 프레임워크인 MITRE ATT&CK에 맞추어 탐지 정책을 관리하고 구성하여 외부 정보로 설정하게 된다. 이를 통해서, 위협 요소 별 현황 파악을 용이하게 수행할 수 있다. 이 때, MITRE ATT&CK는 미국 연방 정부(NIST) 지원을 받아서 사이버 위협 공격에 대한 패턴을 항목 별로 분석 및 정리하여 효과적인 보안을 위한 단계별 매트릭스를 제공하게 된다. 미리 설정된 OT 프로토콜의 취약점 정보는 OT 프로토콜 별 보안 취약점에 따른 이상 판단을 위하여, 미리 설정 되게 된다. 이를 통해서 수집한 패킷 데이터를 이용하여, 미리 설정된 OT 프로토콜 별 보안 취약점에 대응하여, 해당하는 패킷 데이터를 분류하여, 외부 정보로 설정하게 된다. 일 예를 들자면, 특정 통제 레벨에서 사용 불가능 한 쓰기 권한의 명령이 발생할 경우, 또는, IoT 온도 센서 장 비에서 측정한 운영 데이터가 정상 범위를 벗어나는 경우가 OT 프로토콜 별 보안 취약점으로 설정될 경우, 수집 한 패킷 데이터가 해당하는지 판단하여 외부 정보로 설정하게 된다.트래픽 정보는 수집한 패킷 데이터의 트래픽 트렌드 분석을 통한 이상 징후를 탐지하는 것을 의미한다. AI 기반 이상 탐지/예측 정보는 설비(자산) 운영 데이터와 수집한 패킷 데이터와 Rule 기반 비정상 판단 결과를 AI를 통해 학습하고, 학습 모델을 이용하여, 입력되는 패킷 데이터를 처리하여 이상 징후를 예측하고 그 결과에 따라 외부 정보로 설정하게 된다. 상기 시각화 처리 단계(S300)는 상기 시각화 처리부에서, 상기 데이터 생성 단계(S200)에 의해 생성한 가 공 데이터를 이용하여, 미리 설정된 다수의 시각화 분석 기법을 적용하여, 입체 시각화 데이터를 생성하고, 이 를 외부로 전송하게 된다. 상기 시각화 처리 단계(S300)는 도 8에 도시된 바와 같이, 제1 시각화 단계(S310), 제2 시각화 단계(S320) 및 제3 시각화 단계(S330)를 통해서, 다수의 시각화 분석 기법을 적용하여, 입체 시각화 데이터를 생성하게 된다. 상기 제1 시각화 단계(S310)는 상기 가공 데이터에 포함되는 내부 정보를 세부 분석하여, 미리 설정된 구성 요 소 별 발생한 위협을 해당하는 네트워크의 계층 기준으로 분류하여 위험도를 분석하거나 또는, 보유한 자산 (asset)들의 위험도를 분석하여, 입체 시각화 데이터로 생성하게 된다. 상세하게는, 상기 제1 시각화 단계(S310)는 상기 내부 정보 중 스마트 공장의 구성 요소 기준이 되고, 공장의 주요한 모니터링 대상으로 분류될 수 있는 도메인, 공장, 계층, 자산 기준으로 발생한 위협들을 시각화하하게 된다. 일 예를 들자면, 도 2 및 도 3에 도시된 바와 같이, 전체 도메인을 기준으로 선택한 도메인/선택한 공장에서 발 생한 위협을 계층(level)으로 분류하여 시각화 처리를 수행하게 된다. 이 때, 시간대(timeline) 별 요소를 반영 하여, 입체 시각화 데이터로 생성할 수 있으며, 도 2 및 도 3처럼, heatmap 등을 이용하여 생성하는 것이 가장 바람직하다. 또다른 예를 들자면, 공장 기준으로 보유한 자산들의 위험도를 판단하고, 그 목록(list)을 시각화하여 데이터로 생성하는 것이 바람직하다. 상기 제2 시각화 단계(S320)는 상기 가공 데이터에 포함되는 외부 정보를 세부 분석하여, 발생한 위협들 간의 인과 관계를 시나리오 분석하고, 추후 발생한 위협을 예측하여, 입체 시각화 데이터로 생성하게 된다. 상세하게는, 수집한 패킷 데이터는 MITRE ATT&CK의 프레임워크에 맞추어, 공격전술과 공격기술로 분류되어 외부 정보로 설정되게 된다. 상기 제2 시각화 단계(S320)는 이를 이용하여, 스마트 공장 환경인 IT/OT 융합 환경에서 발생한 위협 행위를 분 류/분석하여, 이를 매트릭스 형태 정보로 표시되도록 입체 시각화 데이터를 생성하게 된다. 상기 입체 시각화 데이터는 발생한 위협행위들 간의 인과관계를 시나리오 분석하고, 추후 발생 가능한 위협을 예측하게 된다. 이 때, 발생한 위협 행위들 간의 인과관계의 시나리오 분석은 선택한 임의의 위협 행위를 기준으로, 발생 시간, 출발지 IP, 도착지 IP, 포트, 공격 유형 등의 인과 관계를 분석하여, 해당하는 위협 행위의 공격 흐름도를 파악 하게 된다. 이를 통해서, 위협 행위의 최종 목표 및 위협 예측이 가능하게 된다. 더불어, 상기 제2 시각화 단계 (S320)는 선택한 임의의 위협 행위를 기준으로, 발생 시간, 출발지 IP, 도착지 IP, 포트, 공격 유형 등의 인과 관계를 분석하기 위하여, 각 변수들의 특성값(feature) 정보를 이용하는 것이 가장 바람직하다. 상기 제3 시각화 단계(S330)는 상기 가공 데이터에 포함되는 내부 정보 및 외부 정보를 통합 분석하여, 다중 도 메인 스마트 공장에 특화되도록 미리 설정된 토폴로지에 맞추어 입체 시각화 데이터로 생성하게 된다. 상세하게는, 상기 제3 시각화 단계(S330)는 다중 도메인 스마트 공장의 내부 정보와 외부 정보를 결합하여, 스 마트 공장 토폴로지에 상기 내부 정보와 외부 정보를 시각화 처리함으로써, 이상 징후가 탐지된 위협을 분석하 고, 이상 징후를 예측할 수 있는 입체 시각화 데이터를 생성하게 된다. 이 때, 도 4에 도시된 바와 같은, 다중 도메인 스마트 공장에 특화된 토폴로지를 설정하기 위하여, 사전에 데이 터 셋을 구성하게 된다. 도메인 노드와 링크 정보를 데이터 셋으로 구성한 후, 도메인 노드에 속하는 공장 노드가 존재하는지 판단하게 된다. 존재할 경우, 해당하는 공장 노드와 링크 정보를 데이터 셋에 추가하게 된다. 이 후, 해당하는 레벨 노드 와 링크 정보를 데이터 셋에 추가한 후, 레벨 노드에 속하는 자산 노드가 존재하는지 판단하게 된다. 존재할 경우, 해당하는 자산 노드와 링크 정보를 데이터 셋에 추가하게 된다. 이 후, 자산 노드에서 발생한 위협 정보가 있는지 판단하여, 위협 정보가 있을 경우, 해당 자산 노드에서 발생한 위협 정보를 추출하여 데이터 셋에 삽입 하고, 해당 시간대에 발생한 동일 위협 유형을 모두 검색하여 데이터 셋에 삽입하게 된다. 이와 달리, 위협 정 보가 없을 경우, 추가하지 않은 도메인 노드가 있는지 판단하여, 있다면, 상술한 과정을 반복하게 된다. 없다면, 위협 정보의 출발지 또는 도착지 정보에 외부 노드가 존재하는지 판단하게 된다. 존재할 경우, 해당하 는 외부 노드와 링크 정보를 데이터 셋에 추가하게 된다. 이 후, 외부 노드에서 발생한 위협 정보가 있는지 판 단하여, 위협 정보가 있을 경우, 해당하는 외부 노드에서 발생한 위협 정보를 추출하여 데이터 셋에 삽입하고, 해당 시간대에 발생한 동일 위협 유형을 모두 검색하여 데이터 셋에 삽입하게 된다. 이를 기반으로, 상기 제3 시각화 단계(S330)는 다중 도메인 스마트 공장에 특화된 토폴로지를 구성/설정하게 된 다. 상세하게는, 다중 도메인 스마트 공장에 특화된 도메인, 공장, 레벨 별 자산 노드와 외부 공격 노드 순으로 계 층 관계를 맵으로 시각화하여 분석이 용이하도록 표시하게 된다. 또한, 각 노드 별(도메인, 공장, 레벨, 자산, 외부)로 위험도 현황 상태가 구분되도록 각각의 색으로 처리하게 된다. 더불어, 공격 발생 시, 공격의 진행 방 향이 표시될 수 있도록 이 역시 각각의 색으로 처리하는 것이 바람직하며, 노드 간 트래픽 량에 대한 가시성이 확보될 수 있도록 선 굵기로 구분하여 입체 시각화 데이터로 생성하게 된다. 또다른 예를 들자면, 도 5에 도시된 바와 같이, 노드 별 내부 정보를 표시하여 입체 시각화 데이터를 생성하게 된다. 상세하게는, End 노드(자산 노드 또는, 외부 노드)의 내부 정보를 표시하는 것으로, 자산 노드의 경우, 자산명,"}
{"patent_id": "10-2023-0138493", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "IP정보를 표시하고, 외부 정보를 요약한 위험도 종합 점수가 표시되도록 입체 시각화 데이터를 생성하고, 외부 노드의 경우, IP, Port, 최근 로그 발생 시간 등의 정보가 표시되도록 입체 시각화 데이터를 생성하게 된다. 다른 예를 들자면, 스마트 공장의 자산 설비 운영의 이상 징후를 탐지하여, 입체 시각화 데이터를 생성하게 된 다. 스마트 공장 자신의 설비 운영 이상/이상 징후는 공장의 가용성에 큰 영향을 끼치게 된다. 그렇기 때문에, 이에 대한 현황 파악이 용이하도록, 상기 제3 시각화부는 공장 설비 운영 이상/이상 징후가 감지될 경우, 이를 토폴로지에서 별도의 특수 기능(일 예를 들자면, 깜박이는 형태)이 적용되도록 입체 시각화 데이터를 생성하게 된다. 이를 통해서, 도 4와 같이 다중 도메인 스마트 공장에 특화된 토폴로지에 맞추어 생성된 정보에서 이상 징후가 탐지된 노드 또는, 이상 탐지된 노드가 깜빡이는 형태로 나타나게 된다. 추가 예를 들자면, 도 6 및 7에 도시된 바와 같이, 하나의 자산 노드 대상으로 발생한 다수 위협을 분석하여 입 체 시각화 데이터로 생성하게 된다. 상세하게는, 하나의 자산 노드에서 발생한 다수의 보안 위협을 목록화하여 표시하게 된다. 이를 통해서 특정 보 안 위협 항목을 선택하여 해당 위협에 대한 상세한 토폴로지 화면이 제공되도록 입체 시각화 데이터를 생성할 수 있으며, 더 나아가 연관 노드 중심으로 공격 노드 정보와 공격 노드의 방향 정보를 표시하여 입체 시각화 데 이터로 제공하게 된다. 한편, 본 발명의 일 실시예에 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법은 다양 한 전자적으로 정보를 처리하는 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 저장 매체에 기 록될 수 있다. 저장 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 저장 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 소프트웨어 분야 당업자에게 공지되어 사용 가능한 것일 수도 있다. 저장 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테 이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같 은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴 파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 전자적으로 정보를 처 리하는 장치, 예를 들어, 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 이상과 같이 본 발명에서는 구체적인 구성 소자 등과 같은 특정 사항들과 한정된 실시예 도면에 의해 설명되었 으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것 일 뿐, 본 발명은 상기의 일 실시예에 한정되는 것이 아니며, 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허 청구 범위뿐 아니라 이 특허 청구 범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2023-0138493", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스 템을 나타낸 구성 예시도이다. 도 2 내지 도 7은 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 시스템 및 그 방법에 의해 생성한 입체 시각화 데이터를 나타낸 예시도이다. 도 8은 본 발명의 일 실시예에 따른 다중 도메인 스마트 공장의 보안 위협 예측을 위한 시각화 정보 제공 방법 을 나타낸 순서 예시도이다."}
