{"patent_id": "10-2022-0034272", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0097954", "출원번호": "10-2022-0034272", "발명의 명칭": "인공지능 기반의 무지외반증 진단방법 및 그 시스템", "출원인": "주식회사 베스트칩", "발명자": "채근식"}}
{"patent_id": "10-2022-0034272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무지외반증 진단시스템이 진단대상영상으로부터 딥러닝 모델을 통해 무지외반증 진단을 위한 대상골들 각각에상응하는 골영역을 특정하는 단계;상기 무지외반증 진단시스템이 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을 나타내는 제2기준라인을 설정하는 단계; 및상기 무지외반증 진단시스템이 상기 제1기준라인 및 상기 제2기준라인이 형성하는 각도에 기초하여 무지외반증의 진단결과를 출력하는 단계를 포함하는 인공지능 기반의 무지외반증 진단방법."}
{"patent_id": "10-2022-0034272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 딥러닝 모델은,대상골들 각각의 세그멘테이션 학습을 위해, 진단영상에 포함된 대상골 각각에 4개의 포인트를 포함하는 라벨링포인트가 라벨링된 학습 데이터를 다수 개 학습하여 대상골에 상응하는 골영역을 세그멘테이션한 결과를 출력하도록 학습된 딥러닝 모델이며,상기 무지외반증 진단시스템이 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을 나타내는 제2기준라인을 설정하는 단계는,상기 딥러닝 모델이 출력한 세그멘테이션된 상기 제1골영역과 상기 제1골영역을 포함하는 바운딩 박스에 기초하여 제1기준 포인트 세트를 특정하고, 특정된 제1기준 포인트 세트에 기초하여 제1기준라인을 설정하는 단계;상기 딥러닝 모델이 출력한 세그멘테이션된 상기 제2골영역과 상기 제2골영역을 포함하는 바운딩 박스에 기초하여 제2기준 포인트 세트를 특정하고, 특정된 제2기준 포인트 세트에 기초하여 제2기준라인을 설정하는 단계를포함하는 인공지능 기반의 무지외반증 진단방법."}
{"patent_id": "10-2022-0034272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 무지외반증 진단시스템이 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을나타내는 제2기준라인을 설정하는 단계는,바운딩 박스의 각 변과 세그멘테이션된 골영역의 접점을 기준 포인트 세트에 포함될 기준 포인트로 설정하되,바운딩 박스의 변과 세그멘테이션된 골영역과 접하지 않는 바운딩 박스의 변은 수직 또는 수평 이동을 하면서접점을 탐색하여 탐색된 접점을 기준 포인트로 설정하는 단계를 포함하는 인공지능 기반의 무지외반증진단방법."}
{"patent_id": "10-2022-0034272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 딥러닝 모델은,MASK RCNN 모델인 것을 특징으로 하는 인공지능 기반의 무지외반증 진단방법.공개특허 10-2023-0097954-3-청구항 5 시스템이 진단영상에 포함된 대상골 각각에 라벨링 포인트로 라벨링된 학습 데이터를 다수 개 학습하도록 딥러닝 모델을 학습시키는 단계;상기 시스템이 상기 딥러닝 모델을 통해 무지외반증 진단을 위한 대상골들 각각에 상응하는 골영역을 특정하는단계; 및상기 시스템이 특정한 상기 골영역을 디스플레이하는 단계를 포함하며,상기 특정한 골영역은,대상골들 각각의 일부이며 사각형으로 특정되는 것을 특징으로 하는 인공지능 기반의 무지외반증 진단방법."}
{"patent_id": "10-2022-0034272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "시스템이, 딥러닝 모델을 통해 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하는 단계; 및상기 시스템이 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을 나타내는 제2기준라인을 설정하는단계를 포함하며,상기 제1기준라인을 설정하는 단계는,상기 딥러닝 모델이 출력한 세그멘테이션된 상기 제1골영역과 상기 제1골영역을 포함하는 바운딩 박스에 기초하여 제1기준 포인트 세트를 특정하고, 특정된 제1기준 포인트 세트에 기초하여 제1기준라인을 설정하는 단계를포함하고,상기 제2기준라인을 설정하는 단계는,상기 딥러닝 모델이 출력한 세그멘테이션된 상기 제2골영역과 상기 제2골영역을 포함하는 바운딩 박스에 기초하여 제2기준 포인트 세트를 특정하고, 특정된 제2기준 포인트 세트에 기초하여 제2기준라인을 설정하는 단계를포함하는 인공지능 기반의 무지외반증 진단방법."}
{"patent_id": "10-2022-0034272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "데이터 처리장치에 설치되며 제1항 내지 제6항 중 어느 한 항에 기재된 방법을 수행하기 위한 컴퓨터 판독가능한 기록매체에 기록된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0034272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "프로세서;프로그램이 저장된 저장장치를 포함하며,상기 프로세서는 상기 프로그램을 구동하여,진단대상영상으로부터 딥러닝 모델을 통해 무지외반증 진단을 위한 대상골들 각각에 상응하는 골영역을 특정하고, 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을 나타내는 제2기준라인을 설정하며, 상기 제1기준라인 및 상기 제2기준라인이 형성하는 각도에 기초하여 무지외반증의 진단결과를 출력하는 인공지능 기반의무지외반증 진단시스템."}
{"patent_id": "10-2022-0034272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2023-0097954-4-프로세서;프로그램이 저장된 저장장치를 포함하며,상기 프로세서는 상기 프로그램을 구동하여,진단영상에 포함된 대상골 각각에 라벨링 포인트로 라벨링된 학습 데이터를 다수 개 학습하도록 딥러닝 모델을학습시키고, 상기 딥러닝 모델을 통해 무지외반증 진단을 위한 대상골들 각각에 상응하는 골영역을 특정하며,특정한 상기 골영역을 디스플레이하며, 상기 특정한 골영역은 대상골들 각각의 일부이며 사각형으로 특정되는 것을 특징으로 하는 인공지능 기반의 무지외반증 진단시스템."}
{"patent_id": "10-2022-0034272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "프로세서;프로그램이 저장된 저장장치를 포함하며,상기 프로세서는 상기 프로그램을 구동하여,딥러닝 모델을 통해 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을 나타내는 제2기준라인을 설정하되,상기 딥러닝 모델이 출력한 세그멘테이션된 상기 제1골영역과 상기 제1골영역을 포함하는 바운딩 박스에 기초하여 제1기준 포인트 세트를 특정하고, 특정된 제1기준 포인트 세트에 기초하여 제1기준라인을 설정하고,상기 딥러닝 모델이 출력한 세그멘테이션된 상기 제2골영역과 상기 제2골영역을 포함하는 바운딩 박스에 기초하여 제2기준 포인트 세트를 특정하고, 특정된 제2기준 포인트 세트에 기초하여 제2기준라인을 설정하는 인공지능기반의 무지외반증 진단시스템."}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기반의 무지외반증 진단방법 및 그 시스템이 개시된다. 상기 인공지능 기반의 무지외반증 진단방법은 무지외반증 진단시스템이 진단대상영상으로부터 딥러닝 모델을 통 해 무지외반증 진단을 위한 대상골들 각각에 상응하는 골영역을 특정하는 단계, 상기 무지외반증 진단시스템이 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골을 나타내는 제2기준라인을 설정하는 단계, 및 상기 무지 외반증 진단시스템이 상기 제1기준라인 및 상기 제2기준라인이 형성하는 각도에 기초하여 무지외반증의 진단결과 를 출력하는 단계를 포함한다."}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반의 컴퓨팅 시스템을 통해 무지외반증을 효과적으로 진단할 수 있는 방법 및 그 시스템 에 관한 것이다."}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무지외반증은 무지(엄지발가락)가 둘째발가락 쪽으로 심하게 휘어져서 엄지발가락 관절이 안쪽으로 돌출된 상태 를 의미할 수 있다. 무지외반증 환자는 연 평균 6만명에 달하며 매년 여름철인 7~8월 환자가 가장 많다. 특히 여성 환자의 비율이 85.6%로 무지외반증은 여성 환자 비율이 월등히 높지만 해당 질환을 가진 남성도 상당수이며, 증상이 심할 경우, 엄지발가락이 둘째발가락과 엇갈리는 정도까지 돌아가기도 할 수 있다. 특히 앞이 좁고 굽이 높은 신발을 자주 신는 여성에게 잘 발생하는 족부 질환이다. 이러한 무지외반증을 정밀하게 진단하기 위해서는 통상 엑스레이 등의 진단 영상을 통해 무지외반각 및/또는 종 족골간각을 측정하고, 측정된 각도에 따라 증상의 정도를 진단할 수 있다. 도 1은 종래의 무지외반증을 진단하는 방식을 설명하기 위한 도면이다. 도 1에 도시된 바와 같이, 무지외반증은 진단영상(예컨대, 엑스레이 영상)에서 무지(엄지발가락)의 중족골과 근 위 족지골의 해부학적 축이 이루는 각을 의미하는 무지외반각과 무지의 중족골 및 제2중족골의 해부학적 축이 이루는 각을 의미하는 종족골간각을 진단하고, 무지외반각과 종족골간각의 수치에 따라 경증, 중증도, 및 중증으로 진단될 수 있다. 이러한 진단을 위해 종래에는 진단 영상상에서 진단의가 임의로 도 1에 도시된 바와 같은 무지 종족골의 축을 나타내는 라인, 근위 족지골의 축을 의미하는 라인, 및/또는 제2중족골의 축을 나타내는 라인을 소정의 도구를 이용하여 수동으로 그린 후 그려진 라인들 간의 각을 측정하여 진단을 하는 방식이었다. 이러한 진단 방식은 목측으로 각 골(무지 종족골, 근위 족지골, 제2 종족골)의 축을 그려야 하므로 상대적으로 부정확할 뿐만 아니라, 오랜 시간이 소요되는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) -한국특허출원 출원번호(10-2021-0144474, \"인공지능을 이용한 근골격계 질환의 방사선학적 지 표 자동 측정 시스템\")"}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적인 과제는 인공지능 기반의 컴퓨팅 시스템을 이용하여 무지외반증을 상대적으로 정확하고 효과적으로 진단할 수 있는 기술적 사상을 제공하는 것이다."}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 기술적 사상에 따른 인공지능 기반의 무지외반증 진단방법은 무지외반증 진단시스템이 진단대상영상 으로부터 딥러닝 모델을 통해 무지외반증 진단을 위한 대상골들 각각에 상응하는 골영역을 특정하는 단계, 상기 무지외반증 진단시스템이 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을 나타내는 제2기준라인 을 설정하는 단계, 및 상기 무지외반증 진단시스템이 상기 제1기준라인 및 상기 제2기준라인이 형성하는 각도에 기초하여 무지외반증의 진단결과를 출력하는 단계를 포함한다. 상기 딥러닝 모델은, 대상골들 각각의 세그멘테이션 학습을 위해, 진단영상에 포함된 대상골 각각에 4개의 포인 트를 포함하는 라벨링 포인트가 라벨링된 학습 데이터를 다수 개 학습하여 대상골에 상응하는 골영역을 세그멘 테이션한 결과를 출력하도록 학습된 딥러닝 모델이며, 상기 무지외반증 진단시스템이 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2 골영역에 기초하여 제2대상골의 축을 나타내는 제2기준라인을 설정하는 단계는, 상기 딥러닝 모델이 출력한 세 그멘테이션된 상기 제1골영역과 상기 제1골영역을 포함하는 바운딩 박스에 기초하여 제1기준 포인트 세트를 특 정하고, 특정된 제1기준 포인트 세트에 기초하여 제1기준라인을 설정하는 단계, 상기 딥러닝 모델이 출력한 세 그멘테이션된 상기 제2골영역과 상기 제2골영역을 포함하는 바운딩 박스에 기초하여 제2기준 포인트 세트를 특 정하고, 특정된 제2기준 포인트 세트에 기초하여 제2기준라인을 설정하는 단계를 포함할 수 있다. 상기 무지외반증 진단시스템이 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타 내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을 나타내는 제2기준 라인을 설정하는 단계는, 바운딩 박스의 각 변과 세그멘테이션된 골영역의 접점을 기준 포인트 세트에 포함될 기준 포인트로 설정하되, 바운딩 박스의 변과 세그멘테이션된 골영역과 접하지 않는 바운딩 박스의 변은 수직 또는 수평 이동을 하면서 접점을 탐색하여 탐색된 접점을 기준 포인트로 설정하는 단계를 포함할 수 있다. 상기 딥러닝 모델은 MASK R-CNN 모델일 수 있다. 상기 방법은 컴퓨터 판독가능한 기록매체에 기록된 컴퓨터 프로그램에 의해 구현될 수 있다. 다른 일 측면에 의하면, 무지외반증 진단시스템은 프로세서, 프로그램이 저장된 저장장치를 포함하며, 상기 프 로세서는 상기 프로그램을 구동하여, 진단대상영상으로부터 딥러닝 모델을 통해 무지외반증 진단을 위한 대상골 들 각각에 상응하는 골영역을 특정하고, 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을 나타내 는 제2기준라인을 설정하며, 상기 제1기준라인 및 상기 제2기준라인이 형성하는 각도에 기초하여 무지외반증의 진단결과를 출력한다."}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 기술적 사상에 따르면 인공지능 즉 딥러닝 모델을 이용하여 무지외반증의 진단에 필요한 대상골(예컨 대, 무지 종족골, 근위 족지골, 제2종족골 등)의 축을 상대적으로 정확하게 자동으로 판단하고, 그에 따라 무지 외반증의 진단 정확도화 진단 효율을 높일 수 있는 효과가 있다. 특히 대상골 전체를 세그멘테이션하는 것이 아니라 필요한 부분만 세그멘테이션함으로써 보다 효과적인 축 라인 을 특정할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들을 도면에 예시하 고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다 고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 아니 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용 된다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에 있어서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 또한, 본 명세서에 있어서는 어느 하나의 구성요소가 다른 구성요소로 데이터를 '전송'하는 경우에는 상기 구성 요소는 상기 다른 구성요소로 직접 상기 데이터를 전송할 수도 있고, 적어도 하나의 또 다른 구성요소를 통하여상기 데이터를 상기 다른 구성요소로 전송할 수도 있는 것을 의미한다. 반대로 어느 하나의 구성요소가 다른 구 성요소로 데이터를 '직접 전송'하는 경우에는 상기 구성요소에서 다른 구성요소를 통하지 않고 상기 다른 구성 요소로 상기 데이터가 전송되는 것을 의미한다. 이하, 첨부된 도면들을 참조하여 본 발명의 실시 예들을 중심으로 본 발명을 상세히 설명한다. 각 도면에 제시 된 동일한 참조부호는 동일한 부재를 나타낸다. 도 2는 본 발명의 기술적 사상에 따른 시스템 구성들을 설명하기 위한 도면이다. 도 2를 참조하면, 본 발명의 기술적 사상에 따른 인공지능 기반의 무지외반증 진단방법을 구현하기 위해서는 무 지외반증 진단시스템이 구현될 수 있다. 상기 무지외반증 진단시스템은 진단의 대상이 되는 발에 상응하는 진단대상영상(예컨대, 엑스레이 영상)을 입력받고, 입력받은 진단대상 영상에 대해 무지외반증의 진단을 수행할 수 있다. 무지외반증의 진단을 수행한다고 함은, 무지외반각 및/또는 종족골간간을 측정하거나 측정한 각에 기초하여 무 증상, 경증, 중증도, 중증 등의 증상정도를 출력하는 것을 의미할 수 있다. 상기 무지외반증 진단시스템은 본 명세서에서 정의되는 기능을 수행하기 위한 데이터 처리장치로 구현될 수 있으며, 네트워크 상에 연결된 서버로 구현되거나 독립적인 진단 장비로 구현될 수도 있다. 하지만 필요에 따라 사용자가 이용하는 컴퓨터, 노트북, 셋탑박스, 태블릭 등, 본 명세서에서 정의되는 기능을 수행하기 위한"}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "데이터 프로세싱 능력을 갖춘 어떠한 형태의 장치로도 구현이 가능할 수 있음을 본 발명의 기술분야의 평균적 전문가는 용이하게 추론할 수 있을 것이다. 또한 도 2에서는 상기 무지외반증 진단시스템이 하나의 물리적인 장치로 구현되는 것처럼 도시하였지만, 필요에 따라 복수의 장치들이 유기적으로 결합되어 상기 무지외반증 진단시스템을 구현할 수도 있다. 상기 무지외반증 진단시스템은 진단대상영상을 입력받으면, 상기 무지외반증 진단시스템에 포함된 딥 러닝 모델을 통해 무지외반증 진단을 위한 대상골들 각각에 상응하는 골영역을 특정할 수 있다. 그리고 특정된 골영역은 소정의 디스플레이 시스템에 디스플레이할 수 있으며, 이처럼 특정한 골영역을 디스플 레이하는 것 자체가 무지외반증의 진단이라고 할 수도 있다. 대상골들은 무지외반증의 진단의 대상이 되는 무지 종족골, 근위 족지골, 제2종족골을 의미할 수 있다. 상기 골영역은 진단대상영상에서 무지 종족골, 근위 족지골, 제2종족골을 나타내는 영역 전부 또는 일부일 수 있다. 이를 위해 상기 무지외반증 진단시스템은 딥러닝 모델을 포함할 수 있으며, 상기 딥러닝 모델은 진단대상 영상에서 대상골을 세그멘테이션할 수 있도록 학습된 뉴럴 네트워크일 수 있다. 이하, 본 발명의 일 실시 예에 의하면, 상기 딥러닝 모델은 MASK R-CNN일 수 있지만 이에 국한되지는 않으며, 대상골을 디텍팅하고 세그멘테이션할 수 있는 적어도 하나의 딥러닝 모델로 본 발명의 기술적 사상이 구현될 수"}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "있음을 본 발명의 기술분야의 평균적 전문가는 용이하게 추론할 수 있을 것이다. 대상골들 각각의 골영역이 특정되면, 상기 무지외반증 진단시스템은 대상골들 각각의 축을 나타내는 기준 라인을 자동으로 설정할 수 있다. 이때 효율적으로 라인을 설정하기 위해, 상기 딥러닝 모델은 대상골들 각각의 전체 영역을 세그멘테이션하는 것 이 아니라 기준라인을 특정하기 용이하도록 일부의 영역만 세그멘테이션할 수도 있다. 대상골들 각각의 기준라인이 설정되면, 상기 무지외반증 진단시스템은 기준라인들이 이루는 각도에 기초하 여 무지외반증의 진단결과를 출력할 수 있다. 이를 위한 상기 무지외반증 진단시스템의 구성은 도 3 및 도 4를 참조하여 설명하도록 한다. 도 3은 본 발명의 실시 예에 따른 시스템의 개략적인 논리적 구성을 설명하기 위한 도면이다. 또한, 도 4는 본 발명의 실시 예에 따른 시스템의 개략적인 물리적 구성을 설명하기 위한 도면이다. 도 3 및 도 4를 참조하면, 본 발명의 기술적 사상에 따른 무지외반증 진단시스템은 제어모듈, 딥러닝 모델, 진단모듈을 포함할 수 있다. 상기 무지외반증 진단시스템은 본 발명의 기술적 사상을 구현하기 위해 필요한 하드웨어 리소스(resource) 및/또는 소프트웨어를 구비한 논리적인 구성을 의미할 수 있으며, 반드시 하나의 물리적인 구성요소를 의미하거 나 하나의 장치를 의미하는 것은 아니다. 즉, 상기 무지외반증 진단시스템은 본 발명의 기술적 사상을 구 현하기 위해 구비되는 하드웨어 및/또는 소프트웨어의 논리적인 결합을 의미할 수 있으며, 필요한 경우에는 서 로 이격된 장치에 설치되어 각각의 기능을 수행함으로써 본 발명의 기술적 사상을 구현하기 위한 논리적인 구성 들의 집합으로 구현될 수도 있다. 또한, 상기 무지외반증 진단시스템은 본 발명의 기술적 사상을 구현하기 위한 각각의 기능 또는 역할별로 별도로 구현되는 구성들의 집합을 의미할 수도 있다. 예컨대, 상기 제어모듈 , 딥러닝 모델, 및/또는 진단모듈 각각은 서로 다른 물리적 장치에 위치할 수도 있고, 동일한 물리적 장치에 위치할 수도 있다. 또한, 구현 예에 따라서는 상기 제어모듈, 딥러닝 모델, 및/또는 진단모듈 각각을 구성하는 소프트웨어 및/또는 하드웨어의 결합 역시 서로 다른 물리적 장치에 위치하고, 서로 다른 물리적 장치에 위치한 구성들이 서로 유기적으로 결합되어 각각의 상기 모듈들을 구현할 수도 있다. 또한, 본 명세서에서 모듈이라 함은, 본 발명의 기술적 사상을 수행하기 위한 하드웨어 및 상기 하드웨어를 구 동하기 위한 소프트웨어의 기능적, 구조적 결합을 의미할 수 있다. 예컨대, 상기 모듈은 소정의 코드와 상기 소 정의 코드가 수행되기 위한 하드웨어 리소스(resource)의 논리적인 단위를 의미할 수 있으며, 반드시 물리적으"}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "로 연결된 코드를 의미하거나, 한 종류의 하드웨어를 의미하는 것은 아님은 본 발명의 기술분야의 평균적 전문 가에게는 용이하게 추론될 수 있다. 한편, 상기 무지외반증 진단시스템은 물리적으로는 도3에 도시된 바와 같은 구성을 가질 수 있다. 상기 무 지외반증 진단시스템은 은 본 발명의 기술적 사상을 구현하기 위한 프로그램이 저장되는 메모리(저장장 치)(120-1), 및 상기 메모리에 저장된 프로그램을 실행하기 위한 프로세서(110-1)가 구비될 수 있다. 상기 프로세서(110-1)는 상기 시스템의 구현 예에 따라, CPU, 모바일 프로세서 등 다양한 명칭으로 명명될"}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수 있음을 본 발명의 기술분야의 평균적 전문가는 용이하게 추론할 수 있을 것이다. 또한, 도2에서 설명한 바와 같이 상기 시스템은 복수의 물리적 장치들이 유기적으로 결합되어 구현될 수도 있으며, 이러한 경우 상기 프로세서(110-1)는 물리적 장치별로 적어도 한 개 구비되어 본 발명의 시스템을 구현할 수 있음을 본 발명"}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "의 기술분야의 평균적 전문가는 용이하게 추론할 수 있을 것이다. 상기 메모리(120-1)는 상기 프로그램이 저장되며, 상기 프로그램을 구동시키기 위해 상기 프로세서가 접근할 수 있는 어떠한 형태의 저장장치로 구현되어도 무방하다. 또한 하드웨어적 구현 예에 따라 상기 메모리(120-1)는 어느 하나의 저장장치가 아니라 복수의 저장장치로 구현될 수도 있다. 또한 상기 메모리(120-1)는 주기억장치뿐 만 아니라, 임시기억장치를 포함할 수도 있다. 또한 휘발성 메모리 또는 비휘발성 메모리로 구현될 수도 있으며, 상기 프로그램이 저장되고 상기 프로세서에 의해 구동될 수 있도록 구현되는 모든 형태의 정보저장 수 단을 포함하는 의미로 정의될 수 있다. 상기 무지외반증 진단시스템은 실시 예에 따라 본 발명의 기술적 사상에 따라 무지외반증을 진단할 수 있 도록 구현되는 시스템을 의미할 수 있다. 예컨대, 웹 서버, 컴퓨터 등 다양한 방식으로 구현될 수 있으며, 본 명세서에서 정의되는 기능을 수행할 수 있는 어떠한 형태의 데이터 프로세싱 장치도 포함하는 의미로 정의될 수 있다. 또한 상기 무지외반증 진단시스템의 실시 예에 따라 다양한 주변장치들(주변장치 1 내지 주변장치 N, 130- 1, 131-1)이 더 구비될 수 있다. 예컨대, 키보드, 모니터, 그래픽 카드, 통신장치 등이 주변장치로써 상기 무지"}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "외반증 진단시스템에 더 포함될 수 있음을 본 발명의 기술분야의 평균적 전문가는 용이하게 추론할 수 있 을 것이다. 이하, 본 명세서에서 소정의 모듈이 어떤 기능을 수행한다고 함은 상기 프로세서(110-1)가 상기 메모리(120-"}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "1)에 구비된 프로그램을 구동하여 상기 기능을 수행하는 것을 의미함을 본 발명의 기술분야의 평균적 전문가는 용이하게 추론할 수 있을 것이다. 상기 제어모듈은 상기 무지외반증 진단시스템에 포함된 다른 구성(예컨대, 상기 딥러닝 모델, 진단모듈 등)의 기능 및/또는 리소스를 제어할 수 있다. 상기 제어모듈은 상기 딥러닝 모델의 학습을 수행할 수도 있고, 상기 딥러닝 모델의 출력결과를 이용하여 진단에 필요한 일련의 데이터 프로세싱을 수행할 수도 있다. 상기 딥러닝 모델은 진단대상영상이 입력되면, 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골) 각각에 상응하는 골영역을 특정할 수 있다. 즉, 골영역을 세그멘테이션할 수 있다. 상기 골영역은 전술한 바와 같이 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골)의 전체 영역일 수도 있지만, 후술하는 바와 같이 일부 영역일 수도 있다. 그러면 상기 제어모듈은 대상골들 중 제1대상골에 상응하는 제1골영역에 기초하여 제1대상골의 축을 나타 내는 제1기준라인을 설정하고, 제2대상골에 상응하는 제2골영역에 기초하여 제2대상골의 축을 나타내는 제2기준 라인을 설정할 수 있다. 예컨대, 제1대상골은 무지 종족골일 수 있다. 그러면 상기 제2대상골은 근위 족지골 및 /또는 제2종족골일 수 있다. 그러면 상기 진단모듈은 상기 제1기준라인 및 상기 제2기준라인이 형성하는 각도에 기초하여 무지외반증의 진단결과를 출력할 수 있다. 대상골의 골영역을 특정하기 위한 일 예는 도 5에 도시된 바와 같을 수 있다. 도 5는 본 발명의 실시 예에 따라 대상골을 세그멘테이션하는 일 예를 나타내는 도면이다. 상기 딥러닝 모델은 전술한 바와 같이 진단대상영상에서 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2 종족골) 각각을 세그멘테이션할 수 있는 뉴럴 네트워크일 수 있다. 이러한 딥러닝 모델을 학습시키기 위해, 도 5a에 도시된 바와 같이, 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골)이 촬영된 다수의 영상들에서 대상골들 각각의 전체 영역을 도 5a에 도시된 바와 같이 라벨 링할 수 있다. 그러면 학습된 딥러닝 모델은 도 5b에 도시된 바와 같이 대상골들 각각의 전체 영역을 세그멘테이션한 결 과를 출력할 수 있다. 실시 예에 따라 상기 딥러닝 모델이 MASK R-CNN인 경우에는 세그멘테이션과 디텍션 을 같이 수행하므로, 세그멘테이션 결과 및 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골) 각각의 바 운딩 박스까지 출력할 수 있다. 이러한 경우에는 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골) 각각에 상응하는 골영역들이 대상골 의 형상을 그대로 가지고 있게 되고, 이러한 경우 기준라인을 결정하기 위해 별도의 프로세스가 필요할 수 있다. 예컨대, 각 대상골들의 헤드부분의 하단 포인트 2개 및 베이스 부분의 상단 포인트 2개를 세그멘테이션된 골영역에서 다시 디텍팅하는 프로세스가 필요할 수 있다. 이러한 문제점을 해결하기 위해 본 발명의 다른 실시 예에 의하면, 상기 딥러닝 모델은 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골) 각각의 기준라인을 보다 효과적으로 설정하기 위해, 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골) 각각에 해당하는 전체 영역이 아닌 일부 영역만을 세그멘테이션한 골영 역을 출력하도록 학습될 수 있다. 이러한 일 예는 도 6 내지 도 7을 참조하여 설명하도록 한다. 도 6 내지 도7은 본 발명의 다른 실시 예에 따라 딥러닝 모델을 학습시키기 위한 학습 데이터 및 이에 따라 학 습된 대상골을 세그멘테이션한 결과를 나타내는 도면이다. 우선 도 6을 참조하면, 상기 딥러닝 모델은 도 6에 도시된 바와 같은 학습 데이터를 학습할 수 있다. 상기 학습 데이터는, 도 6에 도시된 바와 같은 진단영상에서 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2 종족골) 각각별로 4개의 포인트를 포함하는 라벨링 포인트(예컨대, 10 내지 13, 20 내지 23, 30 내지 33)가 라 벨링된 것일 수 있다. 즉, 도 5a와 같이 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골) 전체 영역을 구분할 수 있도록 라벨 링되는 것이 아니라, 각 대상골들의 헤드부분의 하단 포인트 2개 및 베이스 부분의 상단 포인트 2개를 이용하여 이들이 형성하는 4각형으로 라벨링이 수행될 수 있다. 예컨대, 도 6에서는 무지 종족골의 헤드부분의 하단 포인트 2개(30, 31) 및 베이스 부분의 상단 포인트 2개(32, 33)가 라벨링될 수 있다. 또한, 근위 족지골의 헤드 부분의 하단 포인트 2개(10, 11) 및 베이스 부분의 상단 포 인트 2개(12, 13)가 라벨링될 수 있다. 또한, 제2종족골의 헤드 부분의 하단 포인트 2개(20, 21) 및 베이스 부분의 상단 포인트 2개(22, 23)가 라벨링 될 수 있다. 이렇게 라벨링된 학습 데이터를 이용하여 학습을 수행하여, 상기 딥러닝 모델은 도 7에 도시된 바와 같이 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골) 각각의 전체 영역이 아니라 일부 영역만을 세그멘테이 션하여 출력하도록 학습될 수 있다. 그리고 도 7에 도시된 바와 같이 딥러닝 모델이 출력한 대상골들(예컨 대, 무지 종족골, 근위 족지골, 제2종족골) 각각의 세그멘테이션 영역 즉, 골영역이 대체로 4각형에 가깝고 각 4각형의 꼭지점은 기준라인을 결정하기 위한 기준 포인트들 즉, 헤드부분의 하단 포인트 2개 및 베이스 부분의 상단 포인트 2개에 상응하는 포인트일 수 있다. 즉, 본 발명의 기술적 사상에 의하면 대상골들의 일부만을 골영역으로 세그멘테이션할 수 있고, 상기 골영역을 4각형으로 특정하는 경우에 기준라인을 결정하는데 충분할 수 있다. 따라서 골 영역을 세그멘테이션하기 위한 라벨링 시에 4개의 포인트만 라벨링을 수행해도 골영역을 특정할 수 있는 효과가 있다. 또한 상기 딥러닝 모델이 MASK R-CNN인 경우에는 대상골들 각각의 디텍팅 결과로써 바운딩 박스도 출력될 수 있다. 그러면 상기 제어모듈은 제1대상골의 세그멘테이션된 제1골영역(예컨대, 무지 종족골의 골영역)과 상기 제 1골영역을 포함하는 바운딩 박스에 기초하여 제1기준 포인트 세트를 특정할 수 있다. 제1기준 포인트 세트는 후 술하는 바와 같이 기준라인을 특정하기 위한 포인트들을 포함할수 있고, 각각의 기준 포인트들은 각각 제1대상 골(예컨대, 무지 종족골)의 헤드부분의 하단 포인트 2개 및 베이스 부분의 상단 포인트 2개에 상응하는 위치일 수 있다. 그러면 상기 제어모듈은 특정된 제1기준 포인트 세트에 기초하여 제1기준라인을 설정할 수 있다. 기준라인은 헤드부분의 하단 포인트 2개에 상응하는 기준 포인트들의 중점 즉, 상측중점과 베이스 부분의 상단 포인트 2개에 상응하는 기준 포인트들의 중점 즉, 하측중점을 연결하는 라인일 수 있다. 상기 제어모듈은 제2대상골(예컨대, 근위 족지골 및/또는 제2종족골)에 대해서도 마찬가지로 제2골영역과 상기 제2골영역을 포함하는 바운딩 박스에 기초하여 제2기준 포인트 세트를 특정할 수 있다. 그리고 특정된 제2 기준 포인트 세트에 기초하여 제2기준라인을 설정할 수 있다. 각각의 대상골의 기준 포인트 세트를 특정하는 방식은 도 8 내지 도9 에 도시된 바와 같을 수 있다. 도 8 내지 도9는 본 발명의 실시 예에 따라 대상골의 축을 나타내는 기준라인을 설정하는 방식을 설명하기 위한 도면이다. 도 8a는 딥러닝 모델이 출력한 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골) 각각의 골영역 및 바운딩 박스를 도시하고 있다. 상기 딥러닝 모델은 도 6 내지 도 7에서 설명한 바와 같이 4개의 포인트를 이용하여 라벨링을 수행한 학습 데이터를 이용하여 학습된 딥러닝 모델일 수 있다. 그리고 각각의 골영역들만 별도로 도시하면 도 8b과 같을 수 있다. 그러면 각각의 골영역들의 기준라인을 설정하기 위한 기준 포인트 세트의 설정이 필요할 수 있다. 이때 상기 제어모듈은 바운딩 박스의 각 변과 세그멘테이션된 골영역의 접점을 기준 포인트 세트에 포함될 기준 포인트로 설정할 수 있다. 그런데 딥러닝 모델이 출력한 결과가 항상 바운딩 박스가 세그멘테이션된 골영역과 각 변에서 접하지 않을 수도 있다. 이러한 경우 즉, 바운딩 박스의 어느 한 변과 세그멘테이션된 골영역이 접하지 않는 경우, 해당 바 운딩 박스의 변은 수직 또는 수평 이동을 하면서 접점을 탐색하고 탐색된 탐색된 접점을 기준 포인트로 설정할 수 있다. 이러한 방식으로 기준 포인트 세트에 포함될 4개의 기준 포인트들이 각각 설정되면 도 8c에 도시된 바와 같을 수 있다. 그러면 상기 제어모듈은 도 8d에 도시된 바와 같이 4개의 기준 포인트들 중 상부의 2개 포인트 즉, 대상골 의 헤드의 하단 2개에 해당하는 포인트의 중점 즉, 상측중점을 특정할 수 있다. 또한, 4개의 기준 포인트들 중 하부의 2개 포인트 즉, 대상골의 베이스의 상단 2개에 해당하는 포인트의 중점 즉, 하측중점을 특정할 수 있다. 그러면 대상골 각각의 상측중점과 하측중점을 연결하는 라인이 해당 대상골의 기준라인이 될 수 있다. 각 대상골별로 이러한 방식으로 기준라인을 설정한 결과는 도 8e와 같을 수 있다. 그러면 상기 진단모듈은 진단결과 예컨대, 도 8e에 도시된 바와 같은 종족골간각(예컨대, 10.2)을 진단결 과로 출력할 수 있다. 이를 진단대상영상과 매핑해보면 도 8f와 같이 정확하게 진단이 된 것을 확인할 수 있다. 다시 대상골별 골영역과 바운딩 박스에 기초하여 기준 포인트 세트를 특정하는 방식을 도 9를 참조하여 설명하 면 다음과 같을 수 있다. 도 9에 도시된 바와 같이, 골영역은 기준 포인트들(50, 51, 52, 53)을 꼭지점으로 하는 사각형의 형상과 유사할 수 있다. 이러한 경우 기준 포인트 세트는를 특정하는 것은 상기 기준 포인트들(50, 51, 52, 53)의 위치를 특정 하는 것을 의미할 수 있다. 이때 이상적으로는 바운딩 박스 즉 4개의 변들(60, 61, 62, 63)이 형성하는 사각형과 상기 골영역은 1점에서 각 각 접하는 것이 바람직할 수 있다. 하지만 상기 딥러닝 모델이 출력하는 결과는 골영역과 바운딩 박스의 하나 이상의 변은 접하지 않고 이격되어 있을 수 있다. 실 시예에 따라서는 모든 변들이 골영역과 이격되어 있 을 수도 있다. 그러면 상기 제어모듈은 골영역과 바운딩 박스의 4변들 중 어느 하나의 변이 접해있는 경우에는 접한 점을 해당 변에 상응하는 기준 포인트로 특정할 수 있다. 만약 접해있지 않는 변(예컨대, 61)이 존재하는 경우에는, 해당 변을 골영역측으로 평행이동시키면서 가장 먼저 접하는 포인트를 기준 포인트로 특정할 수 있다. 이러한 방식으로 기준 포인트들(50, 51, 52, 53)이 특정되면, 각 기준 포인트들은 바운딩 박스의 변들 각각마다 1개씩 접할 수 있으며, 상기 기준 포인트들(50, 51, 52, 53) 중 상부의 2개(예컨대, 50, 51)는 대상골의 헤드의 하단 포인트 2개에 대응될 수 있고, 하부의 2개(예컨대, 52, 53)은 대상골의 베이스의 상단 포인트 2개에 대응 되는 포인트들일 수 있다. 그러면 상기 제어모듈은 상부의 2개(예컨대, 50, 51) 포인트의 중점을 상측중점으로 설정하고, 하부의 2개 (예컨대, 52, 53) 포인트의 중점을 하측 중점으로 설정할 수 있다. 그리고 상측중점과 하측중점을 연결하는 라 인을 기준라인으로 설정할 수 있다. 이렇게 각각의 대상골들(예컨대, 무지 종족골, 근위 족지골, 제2종족골)별로 기준라인을 설정할 수 있고, 그러 면 진단모듈은 기준라인들에 기초하여 무지외반증의 진단결과를 출력할 수 있다. 결국 본 발명의 기술적 사상에 의하면 대상골들을 효과적으로 세그멘테이션하여 상대적으로 정확하고 자동으로 대상골들 각각의 기준라인이 설정될 수 있고, 이를 이용하여 높은 정확도를 가지면서 무지외반증의 진단이 가능 한 효과가 있다. 본 발명의 실시 예에 따른 인공지능 기반의 무지외반증 진단방법은 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의하여 읽 혀질 수 있는 데이터가 저장되는 모든 종류의 기록 장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 하드 디스크, 플로피 디스크, 광 데이터 저장장치 등이 있다. 또한, 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고 본 발명을 구현하기 위한 기능적인(functional) 프로그램, 코드 및 코"}
{"patent_id": "10-2022-0034272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "드 세그먼트들은 본 발명이 속하는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 본 발명은 도면에 도시된 일 실시 예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통 상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시 예가 가능하다는 점을 이해할 것이다. 따라 서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범위의 기술적 사상에 의해 정해져야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5a 도면5b 도면5c 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2022-0034272", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위하여 각 도면의 간단한 설명이 제공된다. 도 1은 종래의 무지외반증을 진단하는 방식을 설명하기 위한 도면이다. 도 2는 본 발명의 기술적 사상에 따른 시스템 구성들을 설명하기 위한 도면이다. 도 3은 본 발명의 실시 예에 따른 시스템의 개략적인 논리적 구성을 설명하기 위한 도면이다. 도 4는 본 발명의 실시 예에 따른 시스템의 개략적인 물리적 구성을 설명하기 위한 도면이다. 도 5는 본 발명의 실시 예에 따라 대상골을 세그멘테이션하는 일 예를 나타내는 도면이다. 도 6 내지 도7은 본 발명의 다른 실시 예에 따라 딥러닝 모델을 학습시키기 위한 학습 데이터 및 이에 따라 학 습된 대상골을 세그멘테이션한 결과를 나타내는 도면이다. 도 8 내지 도9는 본 발명의 실시 예에 따라 대상골의 축을 나타내는 기준라인을 설정하는 방식을 설명하기 위한 도면이다."}
