{"patent_id": "10-2022-0173391", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0088046", "출원번호": "10-2022-0173391", "발명의 명칭": "승강기 통합 안전관리 서비스 제공 시스템", "출원인": "(주) 태화종합엘리베이터", "발명자": "이인미"}}
{"patent_id": "10-2022-0173391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정을 포함하는 메뉴를 구동하는 사용자 단말;상기 메뉴의 구동에 따라 상기 사용자 단말과 연결되는 관리처 단말; 및적어도 하나의 승강기의 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정의 메뉴를 생성하고, 각 메뉴의 프로세스를 구축하는 구축부, 상기 사용자 단말의 승강기를 ID를 부여하여 상기 사용자 단말과매핑되도록 저장하는 저장부, 상기 사용자 단말에서 메뉴를 구동하는 경우 각 메뉴의 프로세스에 따라 상기 관리처 단말과 연결되도록 하거나 기 저장된 데이터를 제공하는 관리부, 상기 사용자 단말의 승강기의 검사일정에따른 알림을 상기 사용자 단말로 전송하는 검사안내부를 포함하는 안전관리 서비스 제공 서버;를 포함하는 승강기 통합 안전관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0173391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 안전관리 서비스 제공 서버는,상기 사용자 단말에서 고장민원을 접수하는 경우 기 설정된 고장출동 프로세스에 따라 적어도 하나의 기사 단말을 배정하고, 진행상황보고를 위하여 기 사용자 단말로 단계별 안내를 제공하는 고장접수부;를 더 포함하는 것을 특징으로 하는 승강기 통합 안전관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0173391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 안전관리 서비스 제공 서버는,상기 사용자 단말에서 비상통화 메뉴를 선택한 경우, 상기 승강기에 부착된 QR 코드를 스캔하여 비상통화 이벤트를 발생시키도록 하고, 상기 비상통화 이벤트가 수신된 경우, 상기 QR 코드가 부착된 승강기 ID를 추출하고상기 승강기 ID와 기 매핑되어 저장된 제어반통신조회로 에러사항을 확인하며, 상기 에러사항이 확인된 경우 고장접수를 시행하고, 상기 에러사항이 없을 경우 상기 승강기 ID에 기 매핑되어 저장된 CCTV로부터 영상을 실시간으로 스트리밍받아 관리처 단말로 전송하며, 상기 관리처 단말에서 비상상황임을 컨펌한 경우 기사 단말을 할당하여 출동명령을 전송하는 비상통화부;를 더 포함하는 것을 특징으로 하는 승강기 통합 안전관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0173391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 안전관리 서비스 제공 서버는,상기 승강기 유지관리에 청구된 비용 중 결제가 되지 않은 미수금의 미수금내역조회, 상기 승강기 유지관리에따른 유지보수료조회 및 상기 승강기 유지관리에 사용된 부품교체내역조회를 포함하는 승강기 내역조회를 제공하는 승강기내역조회부;공개특허 10-2024-0088046-3-를 더 포함하는 것을 특징으로 하는 승강기 통합 안전관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0173391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 안전관리 서비스 제공 서버는,상기 승강기의 승강기 기본안전수칙, 승강기 고장시 대처법, 승강기 보험신청안내, 승강기 안전관리자 선임 및변경관련 안내를 포함하는 안전관리요령을 제공하는 안전관리부;를 더 포함하는 것을 특징으로 하는 승강기 통합 안전관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0173391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 안전관리 서비스 제공 서버는,상기 승강기 ID에 기 매핑된 스펙(Specification)을 포함한 승강기 제원을 기본정보로 제공하는 기본정보부;를 더 포함하는 것을 특징으로 하는 승강기 통합 안전관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0173391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 안전관리 서비스 제공 서버는,상기 승강기 ID의 마지막 검사일정을 체크하고, 승강기 검사일정만료일 확인, 승강기 검사신청안내, 승강기 검사일정조회 및 승강기 검사이력조회를 포함하는 검사일정의 메뉴를 제공하는 검사일정부;를 더 포함하는 것을 특징으로 하는 승강기 통합 안전관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0173391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 검사일정부는,기 설정된 검사일정에 따라 검사신청이 되지 않는 경우, 상기 사용자 단말의 적어도 하나의 메신저로 푸시(Push) 메시지를 전송하고, 상기 사용자 단말에서 푸시 메시지에서 날짜를 선택하는 경우 검사신청이 접수된 것으로 처리하는 것을 특징으로 하는 승강기 통합 안전관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0173391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 안전관리 서비스 제공 서버는,상기 승강기 검사일정에 상기 사용자 단말에서 기 저장한 공동현관 비밀번호를 포함한 엑세스 고유코드를 상기승강기의 검사업무를 할당받은 기사 단말로 전송하는 비대면검사부;를 더 포함하는 것을 특징으로 하는 승강기 통합 안전관리 서비스 제공 시스템.공개특허 10-2024-0088046-4-청구항 10 제 1 항에 있어서,상기 안전관리 서비스 제공 서버는,적어도 하나의 기사 단말을 등록하고, 상기 적어도 하나의 기사 단말에서 고장출동진행상황보고, 부품교체내역및 검사이력 중 어느 하나를 업로드하는 경우, 상기 승강기의 승강기 ID에 매핑되도록 저장하는 데이터베이스화부;를 더 포함하는 것을 특징으로 하는 승강기 통합 안전관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "승강기 통합 안전관리 서비스 제공 시스템이 제공되며, 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정 보 및 검사일정을 포함하는 메뉴를 구동하는 사용자 단말, 메뉴의 구동에 따라 사용자 단말과 연결되는 관리처 단말 및 적어도 하나의 승강기의 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정의 메뉴 를 생성하고, 각 메뉴의 프로세스를 구축하는 구축부, 사용자 단말의 승강기를 ID를 부여하여 사용자 단말과 매 핑되도록 저장하는 저장부, 사용자 단말에서 메뉴를 구동하는 경우 각 메뉴의 프로세스에 따라 관리처 단말과 연 결되도록 하거나 기 저장된 데이터를 제공하는 관리부, 사용자 단말의 승강기의 검사일정에 따른 알림을 사용자 단말로 전송하는 검사안내부를 포함하는 안전관리 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 승강기 통합 안전관리 서비스 제공 시스템에 관한 것으로, 사용자와 관리처 간 엑세스를 용이하게 하 고, 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정을 포함한 원스톱 안전관리 플랫폼 을 제공할 수 있는 시스템을 제공한다."}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "한국은 세계 7위의 승강기 보유국이자 매년 세계 3위의 승강기 신규 설치국이다. 승강기는 용도별로 구분하면 승객용이 전체의 대부분을 차지하고 있고, 나머지는 화물용, 에스컬레이터, 덤웨이터, 휠체어리프트로 구성된다. 급속한 경제성장과 도시화로 고층건물의 밀집도가 높고, 신축 건물이 많아 승강기의 설치 및 사용이 급증했는데, 승강기의 설치와 이용이 빈번해지는 만큼 승강기 안전관리의 중요성도 커지고 있다. 한국에서는 승강기 사고로 매년 사상자가 발생하고 있고, 특히 노인과 아동의 피해가 늘어나고 있다. 통계에 따르면 구조 대가 승강기 고장사고로 출동한 건수가 지속적으로 증가하고 있는데, 교통사고와 화재사고에 이어 3 번째를 차 지하고 있고, 사고별 구조 인원수는 교통사고 다음으로 2 번째를 차지하고 있다. 승강기 사고로부터 국민의 안 전을 보장하기 위해 효과적인 승강기 안전관리체계의 구축이 필요한 시점이다. 이때, 승강기 내 유선망 비상통화가 연결이 되지 않을 때 무선망으로 전환하여 연결되도록 하거나 승강기 안전 관리를 모바일 기반으로 수행할 수 있는 방법이 연구 및 개발되었는데, 이와 관련하여, 선행기술인 한국등록특 허 제10-1639710호(2016년07월15일 공고) 및 한국등록특허 제10-1584485호(2016년01월12일 공고)에는, 유선망 비상통화의 감도가 기 설정된 기준값 미만인 경우 광대역 무선통신 기반 무선망 비상통화로 자동전환시키고, 승 강기의 위치, 속도 및 상태를 포함하는 승강기 정보를 기 설정된 기관에 실시간으로 통보하는 구성과, 승강기 검사기준을 데이터베이스화하고, 승강기 검사기준에 대한 승강기 검사결과를 기사 단말로부터 입력받으면 사용 자 단말로 전송하여 승강기 검사결과를 받아볼 수 있도록 하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 승강기 내 비상통화 버튼이 작동하지 않거나 버튼 오류, 연결 불량, 고의 또는 과실로 버튼 을 작동시킨 경우 등을 구분할 수 없다. 후자의 경우에도 승강기 검사를 받은 것을 전제하는데, 승강기 검사를 받기 위해서는 승강기 관리업체에 연락을 한 후 검사 신청을 해야 한다. 승강기 관리주체가 개인인 경우 승강 기 유지보수를 위해 검사를 받아야 한다는 것조차 잊어버리는 경우가 많아 유지보수가 제대로 되지 않는 곳이 많다. 이에, 사용자와 관리주체 간을 연결할 수 있으면서도 엑세스가 용이한 매체를 선정하고, 고장접수, 비상 통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정을 포함한 원스톱 안전관리 플랫폼의 연구 및 개발이 요구된다."}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 사용자 단말과 관리처 단말 간을 연결하는 애플리케이션을 제공하고, 고장접수, 비상통 화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정을 포함한 원스톱 안전관리 플랫폼을 제공하면서, 고장민 원이 접수될 때에는 상담사 연결 또는 애플리케이션 등록되면, 고장출동 진행상황을 단계별로 안내하고, 고의 또는 과실로 인한 비상통화 작동을 방지하기 위해 QR 코드로 비상통화에 엑세스할 수 있도록 하며, 비상통화 이벤트가 출력된 경우 CCTV를 통하여 실제상황을 확인함으로써 고의, 과실 및 오류로 인한 출동을 배제할 수 있도 록 하고, 미수금, 유지보수료 및 부품교체를 포함한 승강기 내역조회가 가능하도록 하며, 검사일정만료안내, 검 사신청안내, 검사일정조회 및 검사이력조회를 포함하는 검사일정을 제공함으로써 사용자 및 관리자 간 업무효율 을 높일 수 있도록 하는, 승강기 통합 안전관리 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이 루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정을 포함하는 메뉴를 구동하는 사용자 단말, 메뉴의 구동에 따라 사용 자 단말과 연결되는 관리처 단말 및 적어도 하나의 승강기의 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정의 메뉴를 생성하고, 각 메뉴의 프로세스를 구축하는 구축부, 사용자 단말의 승강기를 ID 를 부여하여 사용자 단말과 매핑되도록 저장하는 저장부, 사용자 단말에서 메뉴를 구동하는 경우 각 메뉴의 프 로세스에 따라 관리처 단말과 연결되도록 하거나 기 저장된 데이터를 제공하는 관리부, 사용자 단말의 승강기의 검사일정에 따른 알림을 사용자 단말로 전송하는 검사안내부를 포함하는 안전관리 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 사용자 단말과 관리처 단말 간을 연결하는 애플리케 이션을 제공하고, 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정을 포함한 원스톱 안 전관리 플랫폼을 제공하면서, 고장민원이 접수될 때에는 상담사 연결 또는 애플리케이션 등록되면, 고장출동 진 행상황을 단계별로 안내하고, 고의 또는 과실로 인한 비상통화 작동을 방지하기 위해 QR 코드로 비상통화에 엑 세스할 수 있도록 하며, 비상통화 이벤트가 출력된 경우 CCTV를 통하여 실제상황을 확인함으로써 고의, 과실 및 오류로 인한 출동을 배제할 수 있도록 하고, 미수금, 유지보수료 및 부품교체를 포함한 승강기 내역조회가 가능 하도록 하며, 검사일정만료안내, 검사신청안내, 검사일정조회 및 검사이력조회를 포함하는 검사일정을 제공함으 로써 사용자 및 관리자 간 업무효율을 높일 수 있도록 한다."}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 승강기 통합 안전관리 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1을 참조하면, 승강기 통합 안전관리 서비스 제공 시스템은, 적어도 하나의 사용자 단말, 안전관리 서 비스 제공 서버, 적어도 하나의 관리처 단말을 포함할 수 있다. 다만, 이러한 도 1의 승강기 통합 안전관리 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되 는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 사용자 단말은 네트워크를 통하여 안전관리 서비스 제공 서버와 연결될 수 있다. 그리고, 안전관리 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 사용자 단말, 적어도 하나의 관리처 단말과 연결될 수 있다. 또한, 적어도 하나의 관리처 단말은, 네 트워크를 통하여 안전관리 서비스 제공 서버와 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스 (Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워 크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 사용자 단말은, 승강기 통합 안전관리 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정의 메뉴를 선 택 및 구동을 하고, 조회를 하거나 알림을 받는 고객의 단말일 수 있다. 여기서, 적어도 하나의 사용자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 사용자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 사용자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 안전관리 서비스 제공 서버는, 승강기 통합 안전관리 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애플리 케이션을 제공하는 서버일 수 있다. 그리고, 안전관리 서비스 제공 서버는, 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정의 메뉴를 제공하고, 각 메뉴별 프로세스를 구축하는 서버일 수 있다. 또한, 안전관리 서비스 제공 서버는, 사용자 단말을 승강기 ID와 매핑하여 저장하고, 사용자 단말에서 고장접수가 발생하거나 비상통화가 선택되는 경우 기사 단말(미도시)을 할당하거나, 에러확인을 한 후 관리처 단말에서 비상상황임을 파악하도록 하거나 고장접수를 수행하여 기사 단말이 할당되도록 하 는 서버일 수 있다. 그리고, 안전관리 서비스 제공 서버는, 기사 단말에서 고장수리, 정기점검, 유지보수 등을 수행한 경우 이에 대한 자료를 업로드받고, 사용자 단말에서 확인할 수 있도록 하는 서버일 수 있다. 또, 안전관리 서비스 제공 서버는, 미수금이 존재하는 경우 사용자 단말로 안내하여 결제를 유도하고, 점검일을 안내하거나 스케줄을 잡도록 하는 서버일 수 있다. 그리고, 안전관리 서비스 제공 서버 는, 루틴화된 프로세스의 경우 RPA(Robotic Process Automation)를 통하여 업무자동화가 이루어지도록 하 는 서버일 수 있다. 여기서, 안전관리 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 관리처 단말은, 승강기 통합 안전관리 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 사용자 단말과 비상통화시 연결되는 관리처의 단말일 수 있다. 이때, 관리처 단 말은 고장접수를 사용자 단말과의 호 연결로 유선상으로 받을 수도 있고, 비상통화 시 CCTV를 확인하 고 고장접수를 하는 관리처의 단말일 수 있다. 여기서, 적어도 하나의 관리처 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 관리처 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 관리처 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 관리처 단말는 도 1의 시스템에 포함된 안전관리 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 승강기 통합 안전관리 서비스가 구현된 일 실시예를 설명하기 위한 도 면이다. 관리처 단말를 참조하면, 안전관리 서비스 제공 서버는, 구축부, 저장부, 관리부, 검 사안내부, 고장접수부, 비상통화부, 승강기내역조회부, 안전관리부, 기본정보부 , 검사일정부, 비대면검사부 및 데이터베이스화부를 포함할 수 있다. 본 발명의 일 실시예에 따른 안전관리 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하나의 사용자 단말, 적어도 하나의 관리처 단말 및 적어도 하나의 정보제공 서버로 승강기 통 합 안전관리 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 전송하는 경우, 적어도 하나의 사용자 단말 및 적어도 하나의 관리처 단말은, 승강기 통합 안전관리 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크립트를 이용하여 서비스 프로그램이 적어도 하나의 사용자 단말 및 적어도 하나의 관리처 단말에서 구동될 수도 있다. 여기 서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 넷스케이프 (Netscape), 익스플로러(Explorer), 크롬(Chrome) 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로 그램(Application)을 의미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 구축부는, 적어도 하나의 승강기의 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기 본정보 및 검사일정의 메뉴를 생성하고, 각 메뉴의 프로세스를 구축할 수 있다. 이때, 각 메뉴의 프로세스를 진행할 때 단순반복되는 프로세스의 경우에는 RPA(Robotic Process Automation)를 적용할 수 있다. RPA는 사 람이 정보시스템을 이용해서 반복적으로 수행하는 규칙 기반의 단순업무를 소프트웨어를 통해 자동화하는 기술 이다. RPA 프로젝트는 프로세스 분석과 설계 단계에서 워크숍, 인터뷰, 관찰 등의 정성적인 방법을 통해 자동 화 대상 업무 프로세스를 분석하고, 프로세스 정의서(Process Design Documents)에 작성한다. 또, RPA가 사람 이 수행하는 단순반복적인 정형화된 업무를 대신 수행할 때, AI(Artificial Intelligence)와 OCR(Optical Character Recognition) 등 다양한 기술을 접목하여 적용범위와 효과를 더욱 높일 수도 있다. 저장부는, 사용자 단말의 승강기를 ID를 부여하여 사용자 단말과 매핑되도록 저장할 수 있다. 이때, 저장부는, 승강기의 제어반으로부터 수집되는 데이터를 실시간으로 모니터링함으로써, 오류발생을 예측할 수 있도록 데이터마이닝을 수행할 수도 있다. 예를 들어, 기계적 오류 및 자연적 현상에서 발생 가능한 인자를 수집하고 이들의 분석을 통해 오류 발생을 예측할 수 있도록 한다. 후술하는 예지보전도 유사한 맥락이 지만, 예지보전의 경우 현재의 데이터로 미래를 예측하는 것이라면, 데이터마이닝으로 출력하는 것은 현재의 데 이터로 현재 오류가 발생하는지 또는 안하는지이므로 예지보전은 미래를, 데이터마이닝을 현재를 모니터링하는 것으로 구분하기로 한다. 물론 데이터마이닝으로 미래를 예측하는 것도 가능하지만 본 발명의 일 실시예에서는 이 가정은 배제하기로 한다. <데이터마이닝> 승강기 안전관리 및 오류분석을 위한 데이터마이닝 기법으로 연관규칙을 통한 분석방법을 이용할 수 있다. 이 러한 연관규칙은 승강기에서 발생되는 다양한 사건유형들 간의 관계를 통해 연관규칙의 지지도(Support)와 신뢰 도(Confidence)를 발견하는데 있다. 연관규칙을 찾는 과정은 먼저 전체 데이터에서 후보 아이템 항목 집합을 검색하고, 이 후보 아이템 항목 집합으로부터 미리 제시된 최소 지지도 값을 넘는 빈발 항목 집합을 검색한다. 이렇게 검색된 아이템 집합으로부터 최소 신뢰도 값을 넘는 연관규칙을 찾아낸다. 지지도는 전체 사건 중에서 특정 아이템와 다른 아이템이 동시에 포함하는 사건의 값으로 표현된다. <데이터 분석항목> 승강기 시스템의 오류분석을 위한 분석항목들은 다음과 같은 경우를 대상으로 고려한다. 승강기 시스템에서 발 생 가능한 데이터 분석항목은 표 1에서 보여 주는 것처럼 다양한 오류를 발생시키며 이들은 서로 밀접한 연관관 계를 형성할 수 있다. 승강기 유지보수 과정에서 발생된 데이터는 승강기 기준으로 데이터베이스에 저장되며 이후 발생된 데이터들은 다른 승강기에서 발생되고 유지보수한 데이터베이스 정보들과 함께 분석되어 향후 발생 가능한 오류를 예측하고 비상상황에 따른 대처 방법을 얻을 수 있다. 표 1 항목 상세설명 항목상세설명 A1설치년수 B10ENCODER PULSE 값이 안들어 옴 A2정원수 B11최고 SPEED 틀림 A3화물/인승 B12SPEED PORT 설정 오류 B1인버터오류 B13SPEED 설정 오류 B2인버터 통신오류 B14감속거리가 없거나 잘못됨 B3긴급상황에 따른 비상호출 B15엘리베이터 층 잘못 인식 B4엘리베이터 미끄럼으로 인한 LU, LD신호 오류B16브레이크 마그네트 에러 B5Up Limit Switch신호 입력 B17브레이크 에러 B6시간안에 다른 층 도달 못함 B18층고측정 에러 B7Hole Door로부터 스위치 입력 신호 없음B19화재/침수 B8자동 운행 중 HOLE DOOR 입력 없음 B20OPEN/CLOSE END 신호 오류B9Leveling이 정상 동작하지 않음 ...... <승강기 안전관리> 승강기 안전관리를 위한 프로세스는 우선, 제어반에서 발생되는 운행 및 오류신호에 대한 상태정보를 수집한 후, 정상적인 상태정보는 승강기 운행 DB에 기록 후 운행정보를 표시한다. 만약 오류가 발생할 경우 오류 상태 정보를 데이터마이닝으로 분석하게 된다. 연관규칙 및 클러스터링 알고리즘으로부터 승강기 오류분석에 대한 마이닝 결과를 도출한다. 마이닝 결과는 알고리즘을 통해 생성된 모델로부터 출력된 데이터이고, 그 결과는 다 시 승강기 오류분석 정보에 추가되어 이후 발생될 사건에 대한 추가 정보로 활용될 수 있다. 분석된 데이터마 이닝 결과는 분석자료와 함께 관리처 단말에서 출력할 수 있다. 관리부는, 사용자 단말에서 메뉴를 구동하는 경우 각 메뉴의 프로세스에 따라 관리처 단말과 연 결되도록 하거나 기 저장된 데이터를 제공할 수 있다. 사용자 단말은, 고장접수, 비상통화, 승강기 내역 조회, 안전관리, 기본정보 및 검사일정을 포함하는 메뉴를 구동할 수 있다. 관리처 단말은, 메뉴의 구동 에 따라 사용자 단말과 연결될 수 있다. 검사안내부는, 사용자 단말의 승강기의 검사일정에 따른 알림을 사용자 단말로 전송할 수 있다. 각 승강기의 검사일정만료일이나, 검사신청 진행상황 또는 검사일정이 확정되었을 때 실시간으로 검사일정을 확 인할 수 있도록 함으로써, 만료일 이전에는 알람으로 사용자가 신청을 할 수 있도록 조치할 수 있다. 유지보수 업체에서 모든 현장을 관리할 수는 없으므로, RPA를 통하여 자동발신되도록 하거나 자동으로 신청되도록 할 수 있다. 또, 신청이 되는 경우 사용자 단말로 일정을 안내할 수 있다. 고장접수부는, 사용자 단말에서 고장민원을 접수하는 경우 기 설정된 고장출동 프로세스에 따라 적어 도 하나의 기사 단말을 배정하고, 진행상황보고를 위하여 기 사용자 단말로 단계별 안내를 제공할 수 있다. 또, 고장시 응급상황인 경우, 해당 건물 또는 빌딩 내 고장처리내역 중 가장 유사한 사례에 대한 처리방 법을 기사가 도착하기 이전에 미리 안내해줄 수도 있다. 비상통화부는, 사용자 단말에서 비상통화 메뉴를 선택한 경우, 승강기에 부착된 QR 코드를 스캔하여 비상통화 이벤트를 발생시키도록 하고, 비상통화 이벤트가 수신된 경우, QR 코드가 부착된 승강기 ID를 추출하 고 승강기 ID와 기 매핑되어 저장된 제어반통신조회로 에러사항을 확인하며, 에러사항이 확인된 경우 고장접수 를 시행하고, 에러사항이 없을 경우 승강기 ID에 기 매핑되어 저장된 CCTV로부터 영상을 실시간으로 스트리밍받 아 관리처 단말로 전송하며, 관리처 단말에서 비상상황임을 컨펌한 경우 기사 단말을 할당하여 출동 명령을 전송할 수 있다. 2012년 행정안전부는 국제표준 검사기준(EN)에 따른 정전 발생 시 승강기 내부에서 외 부로 구조요청을 할 수 있는 비상통화장치를 의무적으로 설치하는 승강기 검사기준을 전면 개정하였다. 승강기 용 비상통화장치 설치 의무화가 본격 시행되고 있음에도 불구하고, 승강기 CAR 내부에 설치된 비상통화 버튼에 즉시 응답하지 않는 사례가 빈번히 발생하고 있다. 이는 비상통화장치의 오작동이나 장난, 내부 선로 노후로 인한 잡음 같은 원인도 있으나, 비상통화장치 1 대당 전화 1 회선이 필요하며, 이로 인한 전화 요금 비용 등 운 영비용이 원인 중 하나이다. 이에, 본 발명의 일 실시예에서는 사용자 단말에서 QR 코드를 스캔하여 본 발명의 플랫폼으로 접속하도록 하고, QR 코드에는 각 승강기 ID를 함께 삽입하여 어느 승강기에서 비상통화가 시도되었는지를 확인하도록 하며, 승강기 ID에 기 매핑되어 저장된 제어반으로 신호를 전송하여 에러가 발생했는지를 파악하고, 에러가 발 생했다면, 바로 고장접수 및 기사 단말(미도시)로 출동을 요청하며, 에러가 발생하지 않았다면 CCTV의 영상을 실시간으로 관리처 단말로 전송함으로써 현장상황을 파악하도록 할 수 있다. 비상통화부는, 영상 데이터를 이루는 적어도 하나의 프레임(Frame) 중 키프레임을 자동으로 추출한 후, 키 프레임을 서술하는 서술자(Descriptor, 기술자)로 생성된 텍스트와 매핑하여 관리처 단말로 전송할 수 있 다. 관리처 단말에서 영상이 흐리거나 잘 보이지 않아서 또는 너무 확대되었거나 가까워서 파악하지 못하 는 경우가 많은데, 이때 서술자로 각 객체를 텍스트로 제공해주거나 음성을 STT(Speech to Text)로 함께 전달함 으로써 더욱 빠르고 정확한 상황파악이 가능하도록 할 수 있다. 이때, CCTV 화면이 실시간이므로 그 이전에 어 떠한 상황이 발생했는지를 모르기 때문에 고장접수 또는 비상통화가 발생한 시점을 기준으로 기 설정된 시점까"}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "지 CCTV의 프레임을 추출한 후, CCTV의 영상을 텍스트로 요약해주고, 요약된 텍스트와 키프레임을 매칭하여 관 리처 및 구조기관으로 전송할 수 있다. 예를 들어, 기 설정된 시점은 후술하는 CNN으로 진동이나 방향 가속도"}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "가 고장으로 판단된 시점이거나, 기 설정된 정상 패턴의 오차범위를 벗어나는 패턴이 감지된 시점까지로 설정할수 있다. 물론 고장이 발생한 시점까지만 요약하면 그 이전에는 어떠한 원인이나 상황이 발생했기에 고장이 발 생했는지를 파악할 수 없기 때문에 기 설정된 시간, 예를 들어 5 분 내지 10 분 정도 더 앞 시점부터 추출하여"}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "요약을 할 수도 있다. 이때, 회전, 크기, 어파인 변환에 대해 강인하면서 동시에 고속 처리가 가능한 기술자를 이용할 수 있다. 본 발명의 일 실시예에서는 CCTV로 전달되는 2차원 영상에서 물체 인식 및 포즈 추정을 위한 영상 표현 기술인 계 층적 구조 패턴에 기반한 새로운 이진 기술자(Binary Descriptor)를 이용할 수 있다. 본 발명의 일 실시예는, 객체 인식의 프레임워크를 기반으로 하는 계층적 구조 패턴 기반의 이진 기술자 생성 방법 및 변화에 강인한 주 방향을 추정하는 방법을 이용할 수 있다. <계층적 구조의 이진 기술자> 본 발명의 일 실시예에서 이용하는 기술자의 패턴 구조는, 다양한 크기의 원들이 서로 겹치는 형태로서 누적되 어 표현된다. 패턴 구조 내의 한 개의 원은 기술자 생성에서 사용되는 명암 비교 대상으로 노드라고 정의하고, 같은 원의 크기를 갖는 노드들을 동일 계층으로서 정의한다. 각 계층의 한 개의 노드는 부모노드들의 형태를 모방하는 자식노드들이 존재할 수 있으며, 여기서, 형태는 자식노드들이 부모노드로서 또 다른 자식노드들을 재 귀적으로 포함할 수 있음을 의미한다. 자식노드의 크기는 부모노드의 반지름을 지름으로 하는 크기를 갖는다. 여기서, 영역에 포함하고, 포함되는 관계에 따라 노드들을 부모노드와 자식노드로 각각 정의 할 수 있다. 노드 를 표현하는 색상에 따라 부모노드와 자식노드들을 외곽선 색상으로 구분하여 표현하는 경우, 포함하고, 포함되 는 관계에 따라 노드들을 부모노드와 자식노드로 각 정의된다. 한 개의 부모노드는 해당 노드의 영역 내에서 다수의 자식노드들의 영역들을 포함한다. 예를 들어 자식노드들을 갖는 패턴 구조로 부모노드와 자식노드의 계층적 관계를 가정하면, 각 노드의 영역의 크기는 반지름을 표준편차 로 하는 가우시안 스무딩된 중심 값으로 표현되거나 영역 내의 화소들의 평균값으로 표현될 수 있으며 본 발명 에서는 속도 향상을 위해 적분영상을 사용한 평균 명암 값을 노드의 대표 값으로 사용한다. <기술자 서술> 기술자 서술은 부모노드의 대표 값과 자식노드들의 대표 값의 비교를 통하여 기술자가 서술된다. 이에 대한 수 학식은 이하 수학식 1과 같다. 수학식 1"}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, N 은 기술자의 차원 수로 한 개의 기술자를 표현하기 위한 비트 수를 나타내고, xi 는 기술자의 i 비트 의 부호를 결정하는 위치를 나타낸다. P(xi)는 자식노드 xi 를 포함하는 한 단계 위 계층의 부모노드의 위치를 나타낸다. 수학식 1에서의 I(·)는 입력된 노드의 대표 값을 출력한다. 최종 출력인 T(xi)는 i 번째 부모노드 와 자식노드의 대표 값 비교로서 0과 1의 부호로 나타낸다. 기술자 생성 단계에서, 각 계층에서 내부가 색상으로 채워진 원들은 현재 계층에서의 명암 비교를 수행하기 위 한 부모노드와 자식노드들로서 한 개의 Pair로 볼 수 있다. 기술자의 크기는 계층의 깊이에 따라 수학식 2와 같이 정리된다. 수학식 2"}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서, N 은 총 비트수로 기술자의 크기를 나타내고, L 과 S 는 각각 계층의 깊이와 한 개의 부모가 갖는 자식 노드의 수를 나타낸다. 각 노드 간의 임의의 두 위치에 대한 대표 값 비교와는 달리 계층적 구조로서 부모와자식노드의 명암 비교에 따른 계층적 기술 방법으로 영역 내의 지역적 특성을 서술할 수 있다. 상위 계층의 경 우 비교적 적은 수로 패치 내의 영역들을 크게 분할하여 패치의 전체적 특성을 나타내고, 하위 계층 일수록 많 은 수의 작은 영역들로 상세한 특성을 나타내는 Coarse-to-Fine 형태로 볼수 있다. <피라미드 영상 기반 키포인트 추출> 크기 변화에 불변한 기술자를 생성하기 위하여 카메라 입력 영상으로부터 영상 크기에 대한 피라미드 영상을 생 성하고, 각 단계의 피라미드 영상에 대하여 키포인트를 추출한다. 추출된 영역에 대해 일정 크기의 패치 영역 에 대하여 본 발명의 일 실시예에 따른 계층적 구조 패턴에 대해 기술자를 서술한다. 본 발명에서는 키포인트 추출기로서 FAST Corner 검출기를 이용하여 Corner-like한 위치를 추정하고, Harris Cornerness Measure 방법 을 사용하여 에지 성분을 제거하는 ORB(Oriented FAST and Rotated BRIEF)의 키포인트 추출 방법을 사용할 수 있다. <계층적 구조 패턴 기반의 방향 추정> 키포인트 위치에서의 주 방향은 기술자 서술 단계에서의 서술 순서를 나타내기 때문에, 회전, 시점 변환, 조명 변화 등의 외부환경의 변화에 강인해야 한다. ORB에서는 주 방향을 추정하기 위하여 키포인트의 일정 크기의 영역에서 x, y 축에 대한 무게 중심의 위치로 부터 키포인트의 중심까지의 방향벡터를 주 방향으로 사용하는 Intensity Centroid 방법을 이용한다. BRISK의 경우 변화에 강인한 주 방향을 추정하기 위하여 BRISK 패턴에서 Long-Pair들을 정의하고 특정 Pair의 대표 값의 차이를 방향벡터의 스칼라 값으로 벡터 합을 구하여 주 방향으 로 사용하는 방법을 이용한다. 다만, BRISK의 패턴의 Long-Pair내의 수 백 개의 Pair들의 벡터 합을 계산 하는 단점이 있다. FREAK은 이를 해결하기 위하여 FREAK 패턴내의 대칭되는 Pair들에 대해서 BRISK의 벡터 합 방법 을 사용하고, 45 개의 Pair들에 대한 계산만을 고려하기 때문에 속도와 메모리의 효율 측면에서 효과적으로 계 산하는 방법을 이용한다. 그럼에도 불구하고, 일반적인 기술자들의 주 방향 성능 측정에서는 FREAK의 성능이 가장 안정적이다. 이에 따라 본 발명의 일 실시예에서는, 계층적 구조의 패턴을 이용하여 일반 기술자들의 계산속도 보다 빠르고 유사한 성능을 갖는 주 방향을 추정 방법을 이용할 수 있다. 주 방향 추정을 위한 기본 형태는 부모노드와 자 식노드들의 위치 벡터를 방향벡터로 하고, 대표 값의 차이를 스칼라 값으로 방향벡터들의 벡터 합을 주 방향으 로서 사용한다. 수학식 3은 전체 계층에 대한 제안하는 주 방향 추정식을 나타낸다. 수학식 3"}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "위 식에서 벡터 O는 주 방향에 대한 방향벡터를 나타내고, N 은 앞서 정의한 전체 비트 수로 자식노드들의 수를 의미한다. θ 는 최종 추출된 각도로 추정된 주 방향벡터에 대한 아크탄젠트 값으로 구할 수 있다. 그러나, 전 계층에 대해 주 방향을 추정하는 것은 계산시간을 증가시킴으로 기술자 서술 속도 보다 느리게 되는 문제가 있다. 이를 해결하기 위하여 각 계층별 주 방향 추정 실험을 통하여 가장 적은 수의 노드를 계산하면서 주 방 향을 추정하는 계층을 선택할 수 있다. 예를 들어, 주 방향 추정 방법의 성능을 1계층과 2계층에 대해 각각 수행하여 주 방향을 추정한 결과와 기존 연 구들에서의 주 방향 추정 결과와 비교할 수 있다. 실험은 영상에 대해 모든 기술자에 대해 동일한 키포인트의 위치를 정의하고, 각 키포인트 위치에 대해 각각의 기술자를 이용하여 주 방향을 추정하고, 영상을 조명 변화, 가우시안 블러, 회전, 크기, 시점 변화, 회전+시점 변화 후 위치 변환된 각각의 키포인트에 대해 주 방향을 추 정할 수 있고, 변환 후 추정된 주 방향과 입력 영상에서 추정된 키포인트의 방향과의 차이를 성능의 지표로 사 용할 수 있다. 만약, 주 방향 추정에 대한 실험결과에 대해 두 번째 계층까지의 누적된 벡터 합의 결과가 첫 번째 계층의 주 방향 추정의 성능보다 낮았고, 1계층의 노드들을 이용하여 주 방향을 추정한 성능이 다른 기술자들의 주 방향추정 결과와 유사한 성능을 보였다면, 이는 적당한 수의 대표 노드들에 대해 서 주 방향을 추정하는 것이 많은 수의 노드들에 대해서 주 방향을 추정하는 것 보다 더 효율적임을 의미한다. 따라서, 1계층에 대한 주 방향 추 정에 대해 수학식 3을 다시 정리하면 수학식 4와 같아진다. 수학식 4"}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "여기서, G1 은 1 계층의 자식노드들의 집합으로 부모노드와 위치가 겹치는 중앙 노드의 연산을 제외하고, 부모 노드 포함한 노드의 대표 값 계산과 간단한 벡터 합 연산으로 일반적인 주 방향 추출 방법에 대해 빠른 속도로 기존 기술자의 성능과 유사하게 주 방향을 추정할 수 있다. <기술자 매칭 및 객체 포즈 추정> 이진 부호로 구성된 고속 이진 기술자 매칭은 해밍 거리(Hamming Distance)로 고속 매칭이 가능하다. 각 비트 의 위치에서 같은 부호를 갖는 비트의 경우 거리는 0이 되고, 다른 부호의 경우 거리는 1이 된다. 이는 비트 연산자 XOR 로 구현되어 고속으로 기술자 매칭이 가능하다. 사전에 등록된 DB 영상에서 추출된 기술자들과 입 력 영상에서 추출된 각 기술자들의 전사적 관계에 대한 해밍 거리 매칭을 수행하고, 거리가 가장 작은 기술자를 매칭된 기술자로 사용한다. 매칭된 기술자들의 일대일 대응관계에 대해 통계적 파라미터 추정 방법인 란삭 (Ransac) 알고리즘을 사용하여 물체의 포즈 관계인 호모그래피(Homography)를 추정하여 객체의 포즈를 추정한다. 이렇게 기술자를 이용하는 경우 화면을 설명해주는 것과 같은 텍스트를 출력해낼 수 있고 사용자가 긴급상황에서 또는 설명할 경황이 없을 때 관할기관 담당자에게 정보를 안내할 수 있으므로 담당자의 빠른 상황 파악이 가능해진다. 비상통화부는, 사용자 단말에서 비상통화 메뉴를 선택한 경우, 승강기에 부착된 QR 코드를 스캔하여 비상통화 이벤트를 발생시키도록 하고, 비상통화 이벤트가 수신된 경우, QR 코드가 부착된 승강기 ID를 추출하 고 승강기 ID와 기 매핑되어 저장된 제어반통신조회로 에러사항을 확인하며, 에러사항이 확인된 경우 고장접수 를 시행하고, 고장접수가 된 경우 기사 단말을 할당하는데, 승강기 내부에 사람이 존재하는지의 여부를 확인하 기 위해 CCTV를 이용하여 확인하고, 사람이 있다면 긴급구조요청을 관계기관에 전달할 수도 있다. 이때, 현재 승강기의 상태정보를 함께 제공할 수 있다. 승강기의 고장이 단순히 문 고장이어서 시간을 확보할 수 있는 것 인지, 승강기 자체의 고장이어서 긴급구조가 필요한 것인지, 또 고장이 났다면 어느 부분에 고장이 난 것인지 등을 안내해줄 수 있다. <고장 분류> 만약 에러코드는 출력되지 않았는데 비상통화버튼이 눌린 경우라면, 진동 데이터의 파형을 이용하여 고장 분류 를 해줄 수도 있다. 예를 들어 소음이나 진동 등을 파악하기 위하여 CNN(Convolutional Neural Network)를 이 용할 수도 있다. 승강기 중 엘리베이터의 경우 시간에 따른 XYZ 방향 가속도를 수집하면, 가속시작시점에 양 (+)의 방향으로 펄스가 일어나고, 펄스의 완료지점이 가속종료지점, 즉 가속이 종료되며 엘리베이터가 등속으로 주행하는 구간이 있고, 감속시작지점에서 다시 음(-)의 방향으로 펄스가 발생하고 펄스의 완료지점이 감속종료 지점, 즉 감속이 종료되어 엘리베이터가 정지하는 구간이 존재한다. 이때 각 고장에 따른 파형변화분석을 하는 경우, 에러코드가 나오지 않더라도 어떠한 고장이 발생했을지를 예측 및 분류할 수 있다. 예를 들어, 가이드롤 러부하가 발생했다거나, Z축 로프 텐션이 있다거나, 불평형이 존재한다거나, 레일 단차가 존재하는 등 각 고장 상황에 따른 진동 데이터 등의 파형을 학습하고, 입력된 방향 가속도 및 진동 데이터의 파형, 즉 이미지 자체를 학습 및 검증함으로써 모델링하는 경우, 새로운 데이터가 입력되었을 때 고장의 종류를 분류해줄 수 있다. 승강기내역조회부는, 승강기 유지관리에 청구된 비용 중 결제가 되지 않은 미수금의 미수금내역조회, 승강 기 유지관리에 따른 유지보수료조회 및 승강기 유지관리에 사용된 부품교체내역조회를 포함하는 승강기 내역조 회를 제공할 수 있다. 부품교체내역 등을 저장해두지 않는 경우 대부분의 고객들은 자신의 기억에 의존해 부품 을 교체했는지를 잊어버리거나 최근 교체를 했는데 또 고장이 났다고 생각하는 경우가 많은데, 이를 일일이 확 인하고 직원들이 응대하다보면 업무효율이 떨어질 수 밖에 없다. 업무시간에 업무를 하지 못하기 때문이다. 이에, 음성인식이 가능한 챗봇 등을 구비해두고, 사용자가 음성발화하는 경우 이에 대응하는 결과를 사용자에게제공해주도록 함으로써, 상담사가 일일이 응대하거나 직원이 CS를 하지 않아도 되도록 한다. 승강기내역조회부는, 각 사용자 단말로 아이디와 비밀번호를 제공해주거나 설정하도록 할 수 있고, 매달 보수료, 점검일지, 점검상태를 확인할 수 있도록 공개하며, 수리해야 할 부품, 점검표 등을 확인하고 보수 료를 납부할 수 있는 결제 인터페이스를 제공할 수 있다. 이때, 사용자 단말에서 미처리된 상황을 즉각 알 수 있도록 할 수 있다. 대부분 사용자가 궁금한 사항은 모두 유선상으로 연락이 오기 때문에, 궁금한 사항 에 대한 정보를 문서를 보내고 이를 또 설명해주는 과정이 실시간일 수 없기 때문에, 사용자는 매번 요청해야 하는 번거로움이 있다. 이에 사용자가 실시간으로 자신의 업체계약내역, 미수금내역 등 확인하고 미수금 처리 를 할 수 있도록 인터페이스를 제공한다. 안전관리부는, 승강기의 승강기 기본안전수칙, 승강기 고장시 대처법, 승강기 보험신청안내, 승강기 안전 관리자 선임 및 변경관련 안내를 포함하는 안전관리요령을 제공할 수 있다. 승강기 안전에 대해 기본적으로 안 전수칙 등 대처사항에 대해 정리하여 일상점검을 할 수 있도록, 승강기 안전관리자가 알아야 할 수칙에 대해 정 보공개를 할 수 있다. 기본정보부는, 승강기 ID에 기 매핑된 스펙(Specification)을 포함한 승강기 제원을 기본정보로 제공할 수 있다. 사용자가 관리하고 있는 현장의 승강기 정보를 한 번에 확인할 수 있도록 정보공개를 할 수 있다. 검사일정부는, 승강기 ID의 마지막 검사일정을 체크하고, 승강기 검사일정만료일 확인, 승강기 검사신청안 내, 승강기 검사일정조회 및 승강기 검사이력조회를 포함하는 검사일정의 메뉴를 제공할 수 있다. 검사일정부 는, 기 설정된 검사일정에 따라 검사신청이 되지 않는 경우, 사용자 단말의 적어도 하나의 메신저로 푸시(Push) 메시지를 전송하고, 사용자 단말에서 푸시 메시지에서 날짜를 선택하는 경우 검사신청이 접수 된 것으로 처리할 수 있다. 비대면검사부는, 승강기 검사일정에 사용자 단말에서 기 저장한 공동현관 비밀번호를 포함한 엑세스 고유코드를 승강기의 검사업무를 할당받은 기사 단말로 전송할 수 있다. 예를 들어, 원룸의 주인인 사용자 A는 원룸에 설치된 승강기의 검사일정을 잡아야 하는데 한참 바쁜 시즌이라 일정을 못잡고 있는다고 가정하자. 이 때, 사용자 A는 원룸의 공동현관 비밀번호인 XYZW를 비대면검사부에 등록해놓고, 언제든지 와서 검사하라 는 메시지를 남겨두었다면, 해당 원룸을 관할하는 기사 단말에서 검사일정을 자신의 스케줄에 맞게 잡고, 기사 가 해당 원룸에 도달했을 때 기사 단말에서 비밀번호 XYZW를 출력할 수 있도록 설정할 수 있다. 기사도 일일이 비밀번호를 전화로 묻거나 찾을 필요가 없고, 사용자도 점검일정을 위해 집에만 머무르지 않아도 된다. 데이터베이스화부는, 적어도 하나의 기사 단말을 등록하고, 적어도 하나의 기사 단말에서 고장출동진행상 황보고, 부품교체내역 및 검사이력 중 어느 하나를 업로드하는 경우, 승강기의 승강기 ID에 매핑되도록 저장할 수 있다. 승강기 자체점검을 대행하는 대부분의 협력업체에서는 승강기 자체점검업무와 관련된 서류를 수작업 으로 작성하고 있는데, 이를 스마트폰을 이용하여 수행할 수 있도록 애플리케이션을 제공할 수 있다. 안드로이 드 기반 스마트폰을 이용한 승강기 안전진단 시스템을 설계하고 구현하는데 있어서 특히 스마트폰에 내장된 3축 가속도 센서와 마이크를 이용하여 기존의 진단장비 없이 엘리베이터의 진동 및 소음을 측정할 수도 있다. 안전기준의 적합여부 뿐만 아니라 사용자가 실질적으로 느낄 수 있도록 자체점검업무를 분석한 후 표준화 자료 를 만들어서 시스템을 설계하고 분석할 수 있다. 승강기 안전진단은 크게 엘리베이터와 에스컬레이터로 나누어 진다. 현재 엘리베이터와 에스컬레이터의 주요 측정 장비는 동일항목에 대해서는 같은 장비를 사용하고 있고, 에스컬레이터에는 없고 엘리베이터에만 있는 정밀진단 항목을 측정하기 위한 추가적인 장비가 있다. 승강기 정 밀진단 장비의 대부분은 외국산인데, 이러한 장비 중에서 소음측정을 위하여 사용되는 장비는 진동·소음계 (EVA-625)과 노트북 장비다. 승강기의 카 내에서 발생하는 소음의 정도를 측정하여 승강기 주행 소음을 확인한 다. 엘리베이터의 진동을 측정하는 방법은 진동·소음계를 카 바닥 중앙에 놓은 후, 최하층에서 최상층까지 카 를 상승·하강 시키면서 측정한다. 승강기가 운전 중에 발생하는 진동과 소음을 측정을 위해 스마트폰의 마이 크와 3축자이로 센서를 사용하면 기존 장비의 측정을 대신할 수 있다. 우선, 승강기 안전진단 업무프로세스를 분석하여 데이터베이스를 설계할 수 있는데, 승강기 안전검사를 위한 업 무분석을 토대로 생성된 ERD(Entity Relationship Diagram)를 바탕으로 생성된 스키마 집합은 MySQL DBMS에 생 성할 수 있다. 엘리베이터 안전진단에 대한 정보를 저장하기 위해서 엘레베이터 데이터베이스를 생성하여 전체 테이블을 생성할 수 있다. 승강기의 안전진단에 사용되는 다양한 설비의 통신 인터페이스를 개선함으로써 스마 트폰을 이용한 승강기 진단업무가 가능하며, 또한 스마트폰에 내장된 다양한 센서를 내장하고 있는 스마트폰의 기능을 이용하면 기존의 엘리베이터 진단업무를 대체할 수 있다. 승강기 안전진단 장비를 위하여 측정된 데이터는 안드로이드 기반 스마트폰을 이용하여 데이터베이스 형태로 저장될 수 있다. <예지보전> 본 발명의 일 실시예는, 승강기로부터 수집되는 상태 데이터를 적어도 하나의 인공지능 알고리즘에 질의(Quer y)로 입력하고, 상태 데이터 내 승강기의 이상징후탐지 또는 불량예측을 결과로 출력하여 관리처 단말로 전송할 수 있다. 이때, 예지보전(Predictive Maintenance)이란, 인공지능 알고리즘 기반으로 설비, 장비 등 고 장발생 가능성과 잔여수명을 예측하는 기술이다. 설비와 장비가 가동하면서 발생하는 진동, 소음, 전류 등을 데이터 기반으로 분석해 이상징후를 실시간으로 확인해 관리자에게 알려주는 것으로, 승강기가 고장나기 앞서 조치를 취할 수 있어 다운타임(Down-Time) 발생으로 인한 승강기 가동률이 떨어지거나 인명피해가 발생하는 것 을 줄일 수 있다. 이때, 예지보전의 단계는 정형화되어 있는데 예를 들어 표 2와 같을 수 있다. 이를 위하여, 각 상태 데이터를 실시간 처리하여 모델링을 수행한 후, 인공지능 알고리즘을 이용하여 예측분석을 진행하고, 실시간 모니터링 후 수리 및 교체시기를 예측하여 진단 및 조치를 내리게 된다. 표 2 단계 내용 제1단계데이터취득 -이상징후감지 제2단계진단 -결함 여부, 결함의 원인 진단 -심각도 분류 제3단계예지 -향후 결함진행예지 -잔존유효수명예측 제4단계제시 및 조치 -문제해결방안제시 및 조치 제5단계사후 분석 -문제해결확인 -사후상태진단 이하, 상술한 도 2의 안전관리 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설명하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하 다 할 것이다. 도 3을 참조하면, (a) 안전관리 서비스 제공 서버는 사용자 단말의 승강기를 ID를 기준으로 등록하고, (b)와 같이 각 메뉴에 따른 프로세스를 구축한 후, (c) 사용자 단말로 승강기 통합관리 애플리 케이션을 제공한다. 도 4의 (a)와 같이 안전관리 서비스 제공 서버는 고장이 접수되면 [고장접수-기사배 정-방문일자설정-방문알림-상황보고] 등의 플로우대로 사용자에게 안내하고 현재 어느 단계에 있는 것인지 그 다음 단계는 언제 실행되는지 등을 안내하고, (b)와 같이 비상통화 이벤트가 발생한 경우 에러를 체크하고 이에 따라 고장접수 또는 CCTV 접속 후 관리처 단말로 연결되도록 한다. 이 모든 과정은 RPA로 자동화될 수 있 음은 상술한 바와 같다. 그리고, 안전관리 서비스 제공 서버는 (c)와 같이 사용자 단말에서 승강기 내역을 조회하거나, 검사일정을 설정하고 내역을 조회할 수 있도록 한다. 이와 같은 도 2 내지 도 4의 승강기 통합 안전관리 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1을 통해 승강기 통합 안전관리 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용 이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 승강기 통합 안전관리 서비스 제공 시스템에 포함된 각 구성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터가 송수신되 는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설명한 다양한"}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 안전관리 서비스 제공 서버는, 적어도 하나의 승강기의 고장접수, 비상통화, 승강기 내역조회, 안전관리, 기본정보 및 검사일정의 메뉴를 생성하고, 각 메뉴의 프로세스를 구축한다(S5100). 그리고, 안전관리 서비스 제공 서버는, 사용자 단말의 승강기를 ID를 부여하여 사용자 단말과 매핑되도록 저장 하고(S5200), 사용자 단말에서 메뉴를 구동하는 경우 각 메뉴의 프로세스에 따라 관리처 단말과 연결되도록 하 거나 기 저장된 데이터를 제공한다(S5300). 또, 안전관리 서비스 제공 서버는, 사용자 단말의 승강기의 검사일정에 따른 알림을 사용자 단말로 전송한닫 (S5400). 상술한 단계들(S5100~S5400)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5400)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 승강기 통합 안전관리 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4를 통해 승강기 통합 안전관리 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용 이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 승강기 통합 안전관리 서비스 제공 방법은, 컴퓨터에 의해 실행되는 애플 리케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데 이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매 체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 승강기 통합 안전관리 서비스 제공 방법은, 단말기에 기본적으로 설치된 애 플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 승강기 통합 안전관리 서비스 제공 방법은 단말기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기 에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2022-0173391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2022-0173391", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 승강기 통합 안전관리 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 도 1의 시스템에 포함된 안전관리 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 승강기 통합 안전관리 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 승강기 통합 안전관리 서비스 제공 방법을 설명하기 위한 동작 흐름도이다."}
