{"patent_id": "10-2023-0052902", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0156198", "출원번호": "10-2023-0052902", "발명의 명칭": "의료 영상 분석 방법 및 장치", "출원인": "성균관대학교산학협력단", "발명자": "추현승"}}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "의료 영상을 분석하는 영상 분석 방법에 있어서,입력된 의료 영상의 배경을 분리하여 상기 의료 영상을 전처리하는 단계;전처리된 영상에 기초하여 상기 의료 영상에 대한 다중 스케일 영상들을 획득하는 단계;상기 다중 스케일 영상들 각각에 대한 관심 영역을 추출하는 단계; 및상기 관심 영역에 기초하여, 상기 입력된 의료 영상에 대한 다중 스케일 데이터 세트를 생성하는 단계를 포함하는, 영상 분석 방법."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 다중 스케일 영상에 기초하여 다중 스케일 딥러닝 모델을 학습시키는 단계를 더 포함하는, 영상 분석방법."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 다중 스케일 영상들은 제 1 해상도 영상 및 제 2 해상도 영상을 포함하되,상기 다중 스케일 영상들 각각에 대한 관심 영역을 추출하는 단계는,상기 제 1 해상도 영상에 대해 제 1 풀링(Pooling) 방법을 적용하여 제 1 관심 영역을 추출하는 단계; 및상기 제 2 해상도 영상에 대해 제 2 풀링 방법을 적용하여 제 2 관심 영역을 추출하는 단계를 포함하는, 영상분석 방법."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제 1 해상도 영상의 해상도는 상기 제 2 해상도 영상의 해상도에 보다 작고,상기 제 1 풀링 방법은 Global Average Pooling 방법이고,상기 제 2 풀링 방법은 Max Pooling 방법인 것을 특징으로 하는, 영상 분석 방법."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,상기 다중 스케일 영상들 각각에 대한 관심 영역을 추출하는 단계는,상기 제 1 해상도 영상 및 상기 제 2 해상도 영상 모두에 대해 self-attention 방법을 적용하는 단계를 포함하는, 영상 분석 방법."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 입력된 의료 영상 상에 상기 관심 영역을 히트맵(hit map) 형식으로 오버레이하는 단계를 더 포함하는 영상 분석 방법.공개특허 10-2024-0156198-3-청구항 7 제 1 항에 있어서,상기 데이터 세트는, 상기 다중 스케일 영상들 각각에 대한 관심 영역과 상기 전처리된 의료 영상으로 구성되는것을 특징으로 하는, 영상 분석 방법."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서,상기 데이터 세트에 기초하여, 특정 의료 목적을 달성하기 위한 의료 딥러닝 모델을 학습시키는 단계를 더 포함하는, 영상 분석 방법."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서,상기 데이터 세트와 상기 의료 딥러닝 모델에 기초하여 상기 입력된 의료 영상에 대한 의료 서비스를 제공하는단계를 더 포함하는, 영상 분석 방법."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 의료 서비스는 뼈 나이 분석인 것을 특징으로 하는, 영상 분석 방법."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "의료 영상을 분석하는 영상 분석 장치에 있어서, 상기 영상 분석 장치는신호를 송수신하는 송수신부; 및상기 송수신부를 제어하는 프로세서를 포함하되,상기 프로세서는,입력된 의료 영상의 배경을 분리하여 상기 의료 영상을 전처리하고,전처리된 영상에 기초하여 상기 의료 영상에 대한 다중 스케일 영상들을 획득하고;상기 다중 스케일 영상들 각각에 대한 관심 영역을 추출하고,상기 관심 영역에 기초하여, 상기 입력된 의료 영상에 대한 다중 스케일 데이터 세트를 생성하는 것을 특징으로하는, 영상 분석 장치."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 프로세서는,상기 다중 스케일 영상에 기초하여 다중 스케일 딥러닝 모델을 학습시키는 것을 특징으로 하는, 영상 분석장치."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 다중 스케일 영상들은 제 1 해상도 영상 및 제 2 해상도 영상을 포함하되,상기 프로세서는,상기 제 1 해상도 영상에 대해 제 1 풀링(Pooling) 방법을 적용하여 제 1 관심 영역을 추출하고,상기 제 2 해상도 영상에 대해 제 2 풀링 방법을 적용하여 제 2 관심 영역을 추출하는 것을 특징으로 하는, 영공개특허 10-2024-0156198-4-상 분석 장치."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 제 1 해상도 영상의 해상도는 상기 제 2 해상도 영상의 해상도에 보다 작고,상기 제 1 풀링 방법은 Global Average Pooling 방법이고,상기 제 2 풀링 방법은 Max Pooling 방법인 것을 특징으로 하는, 영상 분석 장치."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,상기 프로세서는,상기 제 1 해상도 영상 및 상기 제 2 해상도 영상 모두에 대해 self-attention 방법을 적용하는 것을 특징으로하는, 영상 분석 장치."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 11 항에 있어서,상기 프로세서는상기 입력된 의료 영상 상에 상기 관심 영역을 히트맵(hit map) 형식으로 오버레이하는 것을 특징으로 하는, 영상 분석 장치."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 11 항에 있어서,상기 데이터 세트는, 상기 다중 스케일 영상들 각각에 대한 관심 영역과 상기 전처리된 의료 영상으로 구성되는것을 특징으로 하는, 영상 분석 장치."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 11항에 있어서,상기 프로세서는상기 데이터 세트에 기초하여, 특정 의료 목적을 달성하기 위한 의료 딥러닝 모델을 학습시키는 것을 특징으로하는, 영상 분석 장치."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서,상기 프로세서는,상기 데이터 세트와 상기 의료 딥러닝 모델에 기초하여 상기 입력된 의료 영상에 대한 의료 서비스를 제공하는것을 특징으로 하는, 영상 분석 장치."}
{"patent_id": "10-2023-0052902", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "하나 이상의 명령어를 저장하는 하나 이상의 비일시적(non-transitory) 컴퓨터 판독 가능 매체에 있어서,입력된 의료 영상의 배경을 분리하여 상기 의료 영상을 전처리하고,전처리된 영상에 기초하여 상기 의료 영상에 대한 다중 스케일 영상들을 획득하고,상기 다중 스케일 영상들 각각에 대한 관심 영역을 추출하고,상기 관심 영역에 기초하여, 상기 입력된 의료 영상에 대한 다중 스케일 데이터 세트를 생성하는 것을 특징으로공개특허 10-2024-0156198-5-하는, 컴퓨터 판독 가능 매체."}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일실시예에 따른 의료 영상을 분석하는 영상 분석 방법은, 입력된 의료 영상의 배경을 분리하여 상기 의료 영상을 전처리하는 단계, 전처리된 영상에 기초하여 상기 의료 영상에 대한 다중 스케일 영상들을 획득하는 단계, 상기 다중 스케일 영상들 각각에 대한 관심 영역을 추출하는 단계 및 상기 관심 영역에 기초하여, 상기 입 력된 의료 영상에 대한 다중 스케일 데이터 세트를 생성하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서는 의료 영상 분석 방법 및 장치에 관한 것으로, 특히, 다중 스케일의 관심 영역 영상을 이용한 의료 영상 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4차 산업 혁명 시대에서 인공지능은 다양한 분야에서 활용되고 있다. 특히, 의료 영역에서도 인공지능의 적용 범위가 지속하여 증대되고 있다. 영상 이미지를 이용하여 정상 유무를 판정하거나 병리 영상 데이터 분석에 쓰 이는 판독 보조, 의무기록 관리, 생체 신호 모니터링과 같은 진료 보조, 데이터 분석 기반의 신약 개발 등 인공 지능 기반의 의료 기술에 대한 연구가 꾸준히 이루어지고 있다. 특히, 의료 영상 판독 분야에서 인공지능이 매 우 유용하게 활용되고 있다. 일반적인 영상과는 다르게, 의료 영상에는 특정 부분에 질병 및 병변과 같은 중요한 정보가 포함되어 있다. 영 상 판독 분야에서, 중요한 정보가 포함되어 있는 영상의 특정 부분은 관심 영역(Region of Interest, ROI)로 정 의된다. 의료 영상을 효과적으로 분석하기 위해서는 관심 영역을 정확하게 파악하는 것이 필수적이다. 기존에는 시술자가 영상을 직접 관찰하고 판단하여 수작업으로 관심 영역을 식별하는 것이 일반적이었지만, 이러한 행위 에는 많은 시간이 요구되며, 시술자 별로 판단이 달라진다는 문제점이 존재하였다. 이러한 문제점을 해결하고자, 딥러닝 모델 학습에 기초한 관심 영역 식별 방법에 대한 연구가 요구된다."}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 의료 영상 분석 방법 및 장치를 제공할 수 있다. 본 발명은 의료 영상 분석 방법 및 장치를 제공하여, 효과적으로 의료 범용 딥러닝 모델을 학습할 수 있다. 본 발명은 의료 영상 분석에 따른 결과를 시술자에게 제공하여, 시술자의 정확한 진단 및 치료를 도울 수 있다. 본 발명에 따른 의료 영상 분석 방법을 이용하여, 환자의 뼈나이를 적법하게 추정할 수 있다."}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예에 따른 의료 영상을 분석하는 영상 분석 방법은 입력된 의료 영상의 배경을 분리하여 상기 의료 영상을 전처리하는 단계, 전처리된 영상에 기초하여 상기 의료 영상에 대한 다중 스케일 영상들을 획득하 는 단계, 상기 다중 스케일 영상들 각각에 대한 관심 영역을 추출하는 단계 및 상기 관심 영역에 기초하여, 상 기 입력된 의료 영상에 대한 다중 스케일 데이터 세트를 생성하는 단계를 포함할 수 있다. 상기 영상 분석 방법은 상기 다중 스케일 영상에 기초하여 다중 스케일 딥러닝 모델을 학습시키는 단계를 더 포 함할 수 있다. 상기 다중 스케일 영상들은 제 1 해상도 영상 및 제 2 해상도 영상을 포함하되, 상기 다중 스케일 영상들 각각 에 대한 관심 영역을 추출하는 단계는, 상기 제 1 해상도 영상에 대해 제 1 풀링(Pooling) 방법을 적용하여 제 1 관심 영역을 추출하는 단계 및 상기 제 2 해상도 영상에 대해 제 2 풀링 방법을 적용하여 제 2 관심 영역을 추출하는 단계를 포함할 수 있다. 상기 제 1 해상도 영상의 해상도는 상기 제 2 해상도 영상의 해상도에 보다 작고, 상기 제 1 풀링 방법은 Global Average Pooling 방법이고, 상기 제 2 풀링 방법은 Max Pooling 방법일 수 있다. 상기 다중 스케일 영상들 각각에 대한 관심 영역을 추출하는 단계는, 상기 제 1 해상도 영상 및 상기 제 2 해상 도 영상 모두에 대해 self-attention 방법을 적용하는 단계를 포함할 수 있다. 상기 영상 분석 방법은 상기 입력된 의료 영상 상에 상기 관심 영역을 히트맵(hit map) 형식으로 오버레이하는 단계를 더 포함할 수 있다.상기 데이터 세트는, 상기 다중 스케일 영상들 각각에 대한 관심 영역과 상기 전처리된 의료 영상으로 구성될 수 있다. 상기 영상 분석 방법은 상기 데이터 세트에 기초하여, 특정 의료 목적을 달성하기 위한 의료 딥러닝 모델을 학 습시키는 단계를 더 포함할 수 있다. 상기 영상 분석 방법은 상기 데이터 세트와 상기 의료 딥러닝 모델에 기초하여 상기 입력된 의료 영상에 대한 의료 서비스를 제공하는 단계를 더 포함할 수 있다 상기 의료 서비스는 뼈 나이 분석인 것일 수 있다. 본 발명의 다른 실시예에 따른 의료 영상을 분석하는 영상 분석 장치는, 신호를 송수신하는 송수신부 및 상기 송수신부를 제어하는 프로세서를 포함하되, 상기 프로세서는, 입력된 의료 영상의 배경을 분리하여 상기 의료 영상을 전처리하고, 전처리된 영상에 기초하여 상기 의료 영상에 대한 다중 스케일 영상들을 획득하고, 상기 다 중 스케일 영상들 각각에 대한 관심 영역을 추출하고, 상기 관심 영역에 기초하여, 상기 입력된 의료 영상에 대 한 다중 스케일 데이터 세트를 생성할 수 있다. 상기 프로세서는, 상기 다중 스케일 영상에 기초하여 다중 스케일 딥러닝 모델을 학습시킬 수 있다. 상기 다중 스케일 영상들은 제 1 해상도 영상 및 제 2 해상도 영상을 포함하되, 상기 프로세서는, 상기 제 1 해 상도 영상에 대해 제 1 풀링(Pooling) 방법을 적용하여 제 1 관심 영역을 추출하고, 상기 제 2 해상도 영상에 대해 제 2 풀링 방법을 적용하여 제 2 관심 영역을 추출할 수 있다. 상기 제 1 해상도 영상의 해상도는 상기 제 2 해상도 영상의 해상도에 보다 작고, 상기 제 1 풀링 방법은 Global Average Pooling 방법이고, 상기 제 2 풀링 방법은 Max Pooling 방법일 수 있다. 상기 프로세서는, 상기 제 1 해상도 영상 및 상기 제 2 해상도 영상 모두에 대해 self-attention 방법을 적용할 수 있다. 상기 프로세서는, 상기 입력된 의료 영상 상에 상기 관심 영역을 히트맵(hit map) 형식으로 오버레이할 수 있다. 상기 데이터 세트는, 상기 다중 스케일 영상들 각각에 대한 관심 영역과 상기 전처리된 의료 영상으로 구성될 수 있다. 상기 프로세서는, 상기 데이터 세트에 기초하여, 특정 의료 목적을 달성하기 위한 의료 딥러닝 모델을 학습시키 는 것을 특징으로 하는, 영상 분석 장치. 상기 프로세서는, 상기 데이터 세트와 상기 의료 딥러닝 모델에 기초하여 상기 입력된 의료 영상에 대한 의료 서비스를 제공할 수 있다. 상기 의료 서비스는 뼈 나이 분석일 수 있다. 본 발명의 다른 실시예에 따른 하나 이상의 명령어를 저장하는 하나 이상의 비일시적(non-transitory) 컴퓨터 판독 가능 매체에 있어서, 상기 컴퓨터 판독 가능 매체는 입력된 의료 영상의 배경을 분리하여 상기 의료 영상 을 전처리하고, 전처리된 영상에 기초하여 상기 의료 영상에 대한 다중 스케일 영상들을 획득하고, 상기 다중 스케일 영상들 각각에 대한 관심 영역을 추출하고, 상기 관심 영역에 기초하여, 상기 입력된 의료 영상에 대한 다중 스케일 데이터 세트를 생성할 수 있다."}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참고로 하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나, 본 개시는 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 본 개시의 실시 예를 설명함에 있어서 공지 구성 또는 기능에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우에는 그에 대한 상세한 설명은 생략한다. 그리고, 도면에서 본 개시에 대한 설명과 관계없 는 부분은 생략하였으며, 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시에 있어서, 어떤 구성요소가 다른 구성요소와 \"연결\", \"결합\" 또는 \"접속\"되어 있다고 할 때, 이는 직접 적인 연결관계뿐만 아니라, 그 중간에 또 다른 구성요소가 존재하는 간접적인 연결관계도 포함할 수 있다. 또한 어떤 구성요소가 다른 구성요소를 \"포함한다\" 또는 \"가진다\"고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 배제하는 것이 아니라 또 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 개시에 있어서, 제1, 제2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용되 며, 특별히 언급되지 않는 한 구성요소들간의 순서 또는 중요도 등을 한정하지 않는다. 따라서, 본 개시의 범위 내에서 일 실시 예에서의 제1 구성요소는 다른 실시 예에서 제2 구성요소라고 칭할 수도 있고, 마찬가지로 일 실시 예에서의 제2 구성요소를 다른 실시 예에서 제1 구성요소라고 칭할 수도 있다. 본 개시에 있어서, 서로 구별되는 구성요소들은 각각의 특징을 명확하게 설명하기 위함이며, 구성요소들이 반드 시 분리되는 것을 의미하지는 않는다. 즉, 복수의 구성요소가 통합되어 하나의 하드웨어 또는 소프트웨어 단위 로 이루어질 수도 있고, 하나의 구성요소가 분산되어 복수의 하드웨어 또는 소프트웨어 단위로 이루어질 수도 있다. 따라서, 별도로 언급하지 않더라도 이와 같이 통합된 또는 분산된 실시 예도 본 개시의 범위에 포함된다. 본 개시에 있어서, 다양한 실시 예에서 설명하는 구성요소들이 반드시 필수적인 구성요소들을 의미하는 것은 아 니며, 일부는 선택적인 구성요소일 수 있다. 따라서, 일 실시 예에서 설명하는 구성요소들의 부분집합으로 구성 되는 실시 예도 본 개시의 범위에 포함된다. 또한, 다양한 실시 예에서 설명하는 구성요소들에 추가적으로 다른 구성요소를 포함하는 실시 예도 본 개시의 범위에 포함된다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 제시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 명세서를 한정하려는 의 도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"구비하다\" 등의 용어는 실시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합 한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 특별히 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 명세서가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미이다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미 인 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미 로 해석되지 않는다. 다중 스케일 영상 분석 방법 및 장치 이하, 도면을 참고하여 본 발명에 따른 영상 분석 방법 및 장치에 대해서 자세히 설명한다. 도 1은 본 발명의 일 실시예에 따른, 영상 분석 방법 및 장치를 개괄적으로 도시한 도면이다. 도 1을 참고하면, 본 발명의 일 실시예에 따른 영상 분석 장치는, 이미지 전처리부, 관심 영역 생성부, 관심 영역 추출부 및 결론 도출부 중 적어도 하나를 포함할 수 있다. 의료 영상에서 병변과 같은 중요한 정보가 포함되어 있는 영역은 보통 관심 영역(Region of Interest, ROI)로 정의된다. 의료 영상을 효과적으로 분석하기 위해서는 관심 영역을 정확하게 파악하는 것이 중요하다. 종래에는 시술자가 직접 판단하여 수작업으로 관심 영역을 찾아내는 것이 일반적이었으나, 이러한 활동에는 많은 시간과 노력이 요구되며, 시술자 별로 다른 결과가 도출될 수 있는 문제점이 발생할 수 있다. 이미지 전처리부는 입력된 의료 영상에 대해 전처리를 수행하고, 다중 스케일 입력 영상을 생성할 수 있다. 이때, 이미지 전처리부는 입력된 의료 영상의 노이즈 또는 배경을 제거하여 입력 영상을 전처리할 수 있다. 이미지 전처리부를 통해 전처리된 입력 영상은 관심 영역 생성부의 입력으로 사용될 수 있다. 관심 영역 생성부는 입력된 전처리 영상을 이용하여 다중 스케일 의료 영상을 생성할 수 있다. 관심 영역 생성부는 다중 스케일 의료 영상으로부터 특정 의료 진단에 필요한 다중 스케일 딥러닝 모델을 학습할 수 있다. 다음으로, 관심 영역 생성부은 스케일별 딥러닝 모델로부터 클래스 활성화 매핑(Class Activation Mapping, CAM)을 활용하여 관심 영역을 생성할 수 있으며, 히트맵을 시각화 할 수 있다. 특히, 관심 영역 생성 부는 히트맵을 입력 의료 영상 상에 오버레이하여 시각화할 수 있다. 여기서, 클래스 활성화 매핑이란 컨볼루션 신경망(Convolutional Neural Network, CNN)을 사용한 시맨틱 분할 (Semantic Segmentation) 작업에서 사용되는 시각화 기술 일 수 있다. 시맨틱 분할은 입력 영상의 각 픽셀에 대 해 해당 픽셀이 어떤 클래스에 속하는지 예측하는 기술일 수 있다. CNN 모델은 입력 이미지를 처리하면서 클래 스별로 특징을 학습할 수 있다. 클래스 활성화 매핑은 이러한 CNN 모델의 특징 맵(feature map)을 이용하여 각 클래스가 활성화되는 영역을 시각적으로 표시하는 기술일 수 있다. 즉, 클래스 활성화 매핑은 입력 영상에서 어 떤 부분이 특정 클래스를 예측하기 위한 중요 영역인지를 시각화하는 기술일 수 있다. 딥러닝 모델은 CAM을 통 해 특징을 학습하고, 어떤 영역에 주목하여 클래스를 분류해야 하는지를 학습할 수 있다. 관심 영역 추출부는 관심 영역 생성부가 시각화한 다중 스케일 히트맵으로부터 복수의 관심 영역을 추 출할 수 있다. 관심 영역 추출부는 추출된 복수의 관심 영역에 기초하여 다중 스케일 데이터 세트를 생성할 수 있다. 결론 도출부는 생성된 다중 스케일 데이터 세트에 기반하여 특정 의료상의 목적을 수행하기 위한 결론을 도 출할 수 있다. 생성된 다중 스케일 데이터 세트는 특정 의료상 목적을 수행하는 단계에서 특정 의료 목적을 달 성하기 위한 의료 범용 딥러닝 모델을 학습하는데 이용될 수 있다. 일 예로, 특정 의료 목적은 뼈 나이 평가, 다중 병변 분류, 골절 위치 추정 중 하나일 수 있으나, 본 발명이 이러한 예시에 한정되는 것은 아니다. 이미지 전처리부는 의료 영상에서 정확한 관심 영역을 찾기 위해, U-Net과 같은 segmentation 딥러닝 모델 이 사용할 수 있으며, 이를 바탕으로 노이즈 및 배경 부분을 제거할 수 있다. 관심 영역 생성부는 의료 이미지를 서로 다른 스케일 또는 해상도로 스케일링한 뒤, 각각의 영상에 대해 다 양한 풀링(Pooling) 기술을 사용하여 특정 의료 목적의 딥러닝 모델을 훈련시킬 수 있다. 예컨대, 관심 영역 생 성부는 입력된 의료 영상을 제 1 해상도 영상 및 제 2 해상도 영상으로 각각 스케일링한 후, 제 1 해상도 영상에 대해 제 1 풀링 방법을 적용하고, 제 2 해상도 영상에 대해 제 2 풀링 방법을 적용하여, 제 1 해상도 영 상의 제 1 관심 영역 및 제 2 해상도 영상의 제 2 관심 영역을 추출할 수 있다. 위에서는 관심 영역 생성부(2 0)가 의료 영상을 2가지 해상도로 다중 스케일하는 예시를 설명하였으나, 본 발명은 서로 2개의 해상도 영상에 대해서만 적용될 수 있는 것이 아니다. 관심 영역 생성부는 의료 영상을 n개의 해상도를 가지는 영상으로 멀티 스케일 할 수 있으며, n개의 해상도를 가지는 영상으로부터 n개의 관심 영역을 획득할 수 있다. 이때, 서로 다 른 2개 이상의 풀링 기법 중 적어도 하나가 각각의 해상도 영상에 대해 적용될 수 있다. 도 2는 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 도면이다. 도 2는 본 발명의 일 실시예에 따른 영상 분석 장치가 의료 영상을 3개의 해상도로 멀티 스케일하는 상황을 도 시한다. 도 2를 참고하면, 영상 분석 장치는 입력된 의료 영상을 제 1 해상도 영상, 제 2 해상도 영상 및 제 3 해상도 영상으로 멀티 스케일 할 수 있다. 예컨대, 제 1 해상도, 제 2 해상도 및 제 3 해상도는 각각 300x300, 448x448, 512x512일 수 있다. 의료 영상 분석 장치는 각각의 해상도 영상 별로 서로 다른 관심 영역을 추출할 수 있으며, 영상의 해상도 별로 서로 다른 관심 영역 히트맵이 각각의 의료 영상에 표현될 수 있다. 도 3은 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 다른 도면이다. 도 3은 서로 다른 해상도의 영상에서 추출된 복수개의 히트맵 또는 관심 영역이 하나의 의료 영상 상에 오버레 이되는 상황을 도시한다. 도 3을 참조하면, 각각의 해상도의 영상에서 개별적으로 추출된 관심 영역의 히트맵들 은 최초에 입력된 단일 의료 영상 상에 오버레이 될 수 있다. 각각의 관심 영역은 관심 영역의 크기에 따라 광역 관심 영역(global ROI), 국소 관심 영역(Local ROI) 등으로 명명될 수 있다. 일 예로, 작은 스케일링이 적용된 영상에 대해서는 Global Average Pooling 방법이 적용될 수 있다. 여기서 Global Average Pooling은 이웃하는 화소의 전반적인 관계를 나타내기 위해 영상 영역 내의 화소 값의 평균을 대표값으로 선택하는 방식의 풀링 방법일 수 있다. 즉, 광역 관심 영역은 Global Average Pooling 방법에 기초 하여 추출될 수 있다. 한편, 큰 스케일링이 적용된 영상에 대해서는 Max Pooling 방법이 적용될 수 있다. 여기 서 Max Pooling은 좁은 영역의 특징을 부각시키기 위해 이미지 영역 내의 화소 값의 최대값을 대표값으로 선택 하는 방법일 수 있다. 즉, 국소 관심 영역은 Max Pooling 방법에 기초하여 추출될 수 있다. 또한 셀프 어텐션 (Self-attention) 방법을 이용하여 보다 국소한 영상에 대한 관심 영역 추출이 수행될 수도 있다. 이때, 셀프 어텐션 방법은 스케일링 크기에 관계없이 모든 다중 스케일 영상들에 대해 적용될 수 있다. 뼈 나이 평가를 위한 영상 분석 방법 이하, 상술한 영상 분석 방법에 기초하여, 환자의 뼈 나이를 분석하는 방법에 대해서 설명한다. 뼈 나이(Bone Age)는 인간의 성숙도 평가에 있어 매우 중요한 평가 요소이다. 이러한 이유 때문에, 뼈 나이 평 가(Bone Age Assessment, BAA)의 자동화 기술 개발은 학계의 많은 관심을 받고 있다. 본 발명은 상술한 영상 분 석 방법에 기초하여, 딥러닝 기반의 뼈 나이 평가를 수행하는 방법을 제시한다. 뼈 나이 평가는 특히 어린이의 뼈 성숙도를 진단하는데 중요한 역할을 한다. 뼈 나이 평가의 결과는 아동 저신 장의 원인이 성장 지연에 의한 것인지 또는 가족성 저신장에 의한 것인지를 판단하는 지표가 될 수 있다. 특히 뼈 나이 평가는 북미 방사선 학회(Radiological Society of North America, RSNA)에서 시작된 논의의 주제가 되기도 하였다. 해당 논의에서는 뼈 나이 평가 자동화를 위해 머신 러닝을 이용하는 BoneXpert가 개발되기도 하 였다. 뼈 나이 평가 딥러닝 기술은 CNN 기반 아키텍처를 기반으로 X선 이미지로부터 특징을 추출할 수 있다. 이하 뼈 의료 영상은 X선 영상인 것으로 설명하나 본 발명의 권리범위가 이에 한정되는 것은 아니다. 이때 수동으로 라 벨링이 된 해부학적 관심 영역과 자동화된 관심 영역을 이용하여 딥러닝 모델이 학습될 수 있다. 영상 정보와 더불어 성별, 생활 연령, 체형 등의 정보도 뼈 나이 평가의 정확도를 향상시키기 위한 정보로 활용될 수 있다. 먼저, 배경과 같이 뼈 의료 영상에서 분석에 필요하지 않은 부분들이 제거될 수 있다. 다음으로, 의료 전문가의 라벨링 없이 관심 영역을 식별하기 위해 다중 스케일 로컬라이제이션이 수행될 수 있다. 이때, 전처리된 뼈 의 료 영상은 다중 스케일로 분리 및 복사될 수 있다. 이때, 더 나은 히트맵 생성 또는 관심 영역 추출을 위해 로 컬라이제이션 프로세스에 통합된 셀프 어텐션 방법이 활용될 수 있다. 뼈 의료 영상의 전처리는 입력된 X 선 영상을 배경 및 전경 영역으로 분할하는 것일 수 있다. 배경 정보에는 배 경, 노이즈 및 리드 마커 중 적어도 하나가 포함될 수 있고, 전경 영역에는 환자의 뼈 영역이 포함될 수 있다. 예컨대, 전처리 단계에서는 뼈 나이 평가에 필요한 뼈 정보만이 포함된 영상이 획득될 수 있다. 구체적으로, auto-encoder에서 사용되는 U-net을 이용하여, X선 영상이 배경 및 전경 영역으로 분할되는 학습이 수행될 수 있다. 학습을 위해 수동으로 배경 및 전경 영역이 분할된 X 선 영상들이 활용될 수 있다. 학습 데이 터 증대를 위해, 이 영상들에 회전, 원근 조절, 수평 이동 등의 이미지 처리가 추가로 수행될 수 있다. 이미지 전처리 후, 관심 영역 로컬라이제이션은 셀프 어텐션 및 광역/국소 관심 영역에 기반하여 수행될 수 있 다. 셀프 어텐션은 쿼리 Q, 키 K 및 값 V의 3가지 주요 집합을 제공한다. Q와 K는 입력을 나타내는 벡터일 수 있고, V는 해당 출력을 나타내는 벡터일 수 있다. 이때, 어텐션 값은 다음의 수학식 1에 따라 유도될 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 1에서 dk는 키 벡터의 차원을 나타내는 배율 인수 일 수 있다. Attention(Q,K,V)는 주어진 이미지 패치 가 다른 패치와 상관 관계가 있는지에 대한 어텐션 점수를 나타내는 셀프 어텐션 모듈일 수 있다. 관심 영역을 로컬라이제이션 함으로서 딥러닝 모델은 이미지의 가장 관련성이 높은 영역을 학습하고 최적의 예측을 제공할 수 있다. 이때, 셀프 어텐션 레이어(self-attention layer)는 다음의 수학식 2에 따라 표현될 수 있다.[수학식 2]"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "다음으로, 아래의 수학식 3에 기초한 셀프 어텐션 메커니즘이 채택되어 분류(Classification)가 수행될 수 있다. [수학식 3]"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서 는 추가된 레이어간 커넥션을 나타낼 수 있다. 특히, 풀링 레이어 P 이후에 셀프 어텐션 레이어 가 신경망에 추가될 수 있다. 다중 스케일과 관련하여, RxR은 이전 레이어의 입력 영상 차원 또는 해상도를 나타낼 수 있다. 셀프 어텐션에는 현재 레이어의 입력과 이에 대응되는 가중치가 포함될 수 있다. 다 음으로, 연결 레이어 Ci가 신경망에 추가되어 현재의 인풋과 성별을 연관(correlate)시킬 수 있다. 이때, i는 속성의 개수를 의미할 수 있다. 예컨대 i=2는 입력 이미지와 성별을 속성으로 사용하는 예시가 될 수 있다. 최 종적으로 마지막 레이어는 240개의 노트가 연결되는 완전 연결 레이어(fully connected layer, FC layer)일 수 있다. 이때, 240개의 노드는 1개월부터 240개월의 뼈 나이로 라벨링될 수 있다. 광역/국소 관심 영역 로컬라이제이션을 위해, 뼈 나이 평가를 위한 영상 분석 방법에는 다양한 풀링 방법이 적 용될 수 있다. 작은 스케일 모델의 신경망은 작은 스케일의 영상을 입력으로 하며 광역 관심 영역을 로컬라이제 이션 할 수 있다. 반면, 큰 스케일 모델의 신경망은 국소 관심 영역을 로컬라이제이션 할 수 있다. 일 예로, 광 역 관심 영역은 300x300의 영상에 global average pooling(GAP)을 적용하여 획득될 수 있다. 이는 다음의 수학 식 4에 기초할 수 있다. [수학식 4]"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "한편, 국소 관심 영역은 560x560의 영상에 대해 max pooling(MP)을 적용하여 획득될 수 있다. 이는 다음의 수학 식 5에 기초할 수 있다. [수학식 5]"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "InceptionV3를 백본 신경망으로 하여 GAP 레이어, 어텐션 레이어, 완전 연결 레이어가 추가될 수 있다. 소프트 라벨링은 신경망 학습을 위한 라벨 분포를 완만하게 하기 위해 적용될 수 있다. 라벨링은 다음의 수학식 6에 기 초할 수 있다. [수학식 6]"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "수학식 6에서 G는 ground-truth 분포, l은 ground truth label을 나타낼 수 있다. i는 0부터 239까지 숫자 중 하나의 값을 가질 수 있고, α는 라벨 분포의 완만한 정도를 나타낼 수 있다. 일 예로, α값이 높을수록 라벨 분포의 완만함이 증가될 수 있다. 예컨대, α는 50까지 증가될 수 있다. 백본 모델은 batch 크기가 16이며, Adam 옵티마이저가 포함된 ImageNet을 이용하여 사전 학습될 수 있다. 국소 최소값을 커버하기 위해, 초기에는 학습률 0.0003에 90 epochs로 설정되고, 이후에는 학습률 0,0001에 30 epochs로 설정될 수 있다. 이를 바탕으로 다중 스케일의 입력 크기 300x300 및 560x560으로 다중 스케일 ROI를로컬라이제이션 하도록 딥러닝 모델이 훈련될 수 있다. 손의 고정된 위치에서 동일한 크기의 관심 영역을 추출 하는 단일 스케일의 영상 분석 방법과는 달리, 본 발명에 따른 영상 분석 방법은 다중 스케일 영상이 가지는 광 역/국소 관심 영역을 이용하여 향상된 뼈 나이 평가를 수행할 수 있다. 전체 X선 영상이 아닌 광역/국소 관심 영역을 이용하여 심층 신경망 기반 회귀 모델(regression model based on deep neural network)이 학습될 수 있다. 이때, Xcetpion 신경망이 백본 신경망으로 활용될 수 있다. 회귀 함수 를 위해, convolution 레이어, MP 레이어 및 완전 연결 레이어가 백본 신경망에 추가될 수 있다. 성별 정보를 효과적으로 활용하기 남성 성별 레이블은 제 1 값, 여성은 제 2 값으로 설정될 수 있다, 여기서 제 1 값과 제 2 값은 각각 0과 1일 수 있다. 인코딩 후 레이블은 입력된 영상과 결합되어 신경망에 제공될 수 있다. 백본 모델 은 batch 크기가 16이며, Adam 옵티마이저가 포함된 ImageNet을 이용하여 사전 학습될 수 있다. 전체 네트워크 는 120 epochs 동안 학습될 수 있다. 학습률은 처음 60 epochs, 다음 30 epochs 및 마지막 30 epochs 각각에 대해 0,0003, 0.0001 및 0.00001로 설정될 수 있다. 이하, 상술한 실시예에 따른 실험 데이터를 정리한다. 본 실시예에 사용된 데이터 세트는 2017 RSNA에서 제공된 것일 수 있다. 활용된 영상은 총 12,611개이며, 이중 11,611개의 영상은 훈련용, 500개의 영상은 테스트 용으로 사용되었다. 영상 전처리를 통해 512x512 크기의 X선 영상이 얻어질 수 있다. 이 영상은 ROI 로컬라이제이션에 사용된다. 도 4는 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 또다른 도면이다. 도 4는 관심 영역 로컬라이제이션에서 생성된 히트맵을 도시한다. 도 4의 (a)는 광역 관심 영역에 대한 히트맵 을 도시하며, (b)는 국소 관심 영역의 히트맵을 도시한다. 도 4에서 붉은색 영역은 딥러닝 모델이 초점을 맞추 는 영역을 의미한다. 도 4를 참조하면, 광역 관심 영역(a)에서의 초점은 손 영역 전체에 있는 것으로 측정되는 반면, 국소 관심 영역(b)에서의 초점은 더 좁은 영역으로 측정된다. 다음으로, 광역/국소 관심 영역과 전처리된 영상을 이용하여 회귀가 구현될 수 있다. 딥러닝 모델의 평가를 위 해 MAE(Mean Absolute Error)가 이용될 수 있다. MAE는 다음의 수학식 7에 기초하여 계산될 수 있다. [수학식 7]"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "수학식 7에서 yi는 레이블을, 는 예측 값을, n은 데이터의 개수를 나타낼 수 있다. 광역/국소 관심 영역과 전처리된 영상이 결합되어 생성된 새로운 데이터 세트를 이용하여 뼈 연령 평가 모델이 훈련될 수 있다. 이때, 입력 데이터의 크기는 400x400으로 설정될 수 있다. 전체 모델을 120 epochs 동안 학습한 후 MAE는 3.52를 달성 하였으며, 이는 종래의 최신 방법에 비해 24.9% 향상된 결과이다. 다음의 표1은 실험 결과를 도시한 것이다. [표 1]"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "다음은 ablation study에 따른 실험 결과를 설명한다. ablation study는 비 로컬라이제이션(non- localization), 무작위 로컬라이제이션(randomized localization) 및 어텐션 기반 다중 스케일 로컬라이제이션 (attention based multiscale localization)을 포함하는 다양한 관심 영역 추출 방법을 이용하여 수행되었다. 무작위 로컬라이제이션의 경우 30x30의 고정된 크기와 관심 영역 로컬라이제이션에서 생성된 패치들의 평균 크 기를 이용하여 평가가 수행되었다. 표 2는 ablation study의 결과를 도시한다.[표 2]"}
{"patent_id": "10-2023-0052902", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "표 2를 참고하면, 본 실시예에 따른 어텐션 기반 다중 스케일 로컬라이제이션이 비 로컬라이제이션 및 무작위 로컬라이제이션에 비해 향상된 결과(MAE 3.52)를 도출하였음을 확인할 수 있다. 도 5는 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 또다른 도면이다. 도 5는 3개의 패치를 이용하여 수행된 실험 결과를 도시한다. 도 5에서 A는 전처리된 영상이고, B와 C는 관심 영역 로컬라이제이션을 통해 획득된 관심 영역이다. 도 5에 표시된 결과는 2개 또는 3개의 영역에 기초한 실험 결과를 도시한다. 3개의 영역을 모두 사용하는 경우(A+B+C, MAE 3.52)에 가장 좋은 성능이 얻어짐을 확인할 수 있다. 도 6은 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 순서도이다. 도 6을 참고하면, 본 발명의 일 실시예에 따른 영상 분석 방법은, 입력된 의료 영상을 전처리하는 단계(S610), 전처리된 영상에 기초하여 다중 스케일 영상을 획득하는 단계(S620), 획득된 다중 스케일 영상 각각으로부터 복 수의 관심 영역을 추출하는 단계(S630) 및 추출된 복수의 관심 영역에 기초하여 다중 스케일 데이터 셋을 생성 하는 단계(S640)을 포함할 수 있다. 여기서, 최종 생성된 다중 스케일 데이터 셋은 특정 의료 진단을 내리기 위한 데이터로 활용되거나, 특정 의료 목적을 달성하기 위한 딥러닝 모델을 학습하는데 이용될 수 있다. 도 7은 본 발명의 일 실시예에 따른 장치 구성을 나타낸 도면이다. 도 7은 본 발명의 일 실시예에 따라, 장치 구성을 나타낸 도면이다. 도 7을 참조하면, 장치는 상술한 이미 지 전처리부, 관심 영역 생성부, 관심 영역 추출부 및 결론 도출부 중 적어도 하나로 구성될 수 있다. 장치는 다른 디바이스와 통신을 수행하고, 연동되는 장치일 수 있으며, 상술한 실시예로 한정되지 않 는다. 일 예로, 장치는 상술한 동작을 위해 프로세서 및 송수신부 중 적어도 어느 하나 이상을 포함할 수 있다. 즉, 장치는 다른 장치와 통신을 하기 위해 필요한 구성을 포함할 수 있다. 일 예로, 장치는 상술한 동작을 위해 프로세서 및 송수신부를 포함할 수 있다. 즉, 장치는 다른 장치와 통신을 하기 위해 필요한 구성을 포함할 수 있다. 또한, 일 예로, 장치는 상술한 구성 이외에도 다른 구 성들, 예컨대 메모리를 포함할 수 있다. 즉, 장치는 다른 디바이스와 통신을 수행하기 위해 상술한 장치를 포함 하는 구성일 뿐, 이에 한정되는 것이며, 상술한 바에 기초하여 동작하는 장치일 수 있다. 전술한 본 개시의 예시적인 방법들은 설명의 명확성을 위해서 동작의 시리즈로 표현되어 있지만, 이는 단계가 수행되는 순서를 제한하기 위한 것은 아니며, 필요한 경우에는 각각의 단계가 동시에 또는 상이한 순서로 수행 될 수도 있다. 본 개시에 따른 방법을 구현하기 위해서, 예시하는 단계에 추가적으로 다른 단계를 포함하거나, 일부의 단계를 제외하고 나머지 단계를 포함하거나, 또는 일부의 단계를 제외하고 추가적인 다른 단계를 포함할 수도 있다. 본 개시의 다양한 실시 예는 모든 가능한 조합을 나열한 것이 아니고 본 개시의 대표적인 양상을 설명하기 위한 것이며, 다양한 실시 예에서 설명하는 사항들은 독립적으로 적용되거나 또는 둘 이상의 조합으로 적용될 수도 있다. 또한, 본 개시의 다양한 실시 예는 하드웨어, 펌웨어(firmware), 소프트웨어, 또는 그들의 결합 등에 의해 구현 될 수 있다. 하드웨어에 의한 구현의 경우, 하나 또는 그 이상의 ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), 범용 프로세서(general processor), 컨트롤러, 마이크로 컨트롤러, 마이크로 프로세서 등에 의해 구현될 수 있다. 본 개시의 범위는 다양한 실시 예의 방법에 따른 동작이 장치 또는 컴퓨터 상에서 실행되도록 하는 소프트웨어 또는 머신-실행가능한 명령들(예를 들어, 운영체제, 애플리케이션, 펌웨어(firmware), 프로그램 등), 및 이러한 소프트웨어 또는 명령 등이 저장되어 장치 또는 컴퓨터 상에서 실행 가능한 비-일시적 컴퓨터-판독가능 매체 (non-transitory computer-readable medium)를 포함한다."}
{"patent_id": "10-2023-0052902", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른, 영상 분석 방법 및 장치를 개괄적으로 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 도면이다. 도 3은 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 다른 도면이다. 도 4는 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 또다른 도면이다. 도 5는 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 또다른 도면이다. 도 6은 본 발명의 일 실시예에 따른 영상 분석 방법을 설명하기 위한 순서도이다.도 7은 본 발명의 일 실시예에 따른 장치 구성을 나타낸 도면이다."}
