{"patent_id": "10-2022-0074733", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0173906", "출원번호": "10-2022-0074733", "발명의 명칭": "사용자를 테스트하기 위한 문서를 생성하는 방법", "출원인": "삼성생명보험주식회사", "발명자": "김정동"}}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 장치에 의해 수행되는, 사용자를 테스트하기 위한 문서를 생성하는 방법으로서, 상기 방법은:외부 기기로부터 사용자의 식별정보 및 테스트의 종류에 관한 정보를 수신하는 단계;사전 학습된 제 1 신경망 모델을 이용하여, 상기 테스트의 종류에 관한 정보에 대응되는 복수의 후보 문항들을획득하는 단계;상기 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들에 기초하여, 상기 사용자의 식별정보에 대응되는 적어도 하나의 사전 응답 문항을 획득하는 단계;상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 최종 문항을획득하는 단계; 및상기 최종 문항을 포함하는 제 1 문서를 생성하여 상기 외부 기기로 전송하는 단계;를 포함하는,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 사전 학습된 제 1 신경망 모델을 이용하여, 상기 테스트의 종류에 관한 정보에 대응되는 복수의 후보 문항들을 획득하는 단계는,상기 사전 저장된 복수의 원문항들을 테스트의 종류별로 분류한 복수의 그룹들 중에서 상기 테스트의 종류에 관한 정보에 대응되는 제 1 그룹을 선택하는 단계; 및상기 제 1 그룹에 대응되는 상기 복수의 후보 문항들을 획득하는 단계;를 포함하는,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제 1 그룹은,키워드에 따라 분류된 복수의 서브 그룹들을 포함하는,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 복수의 후보 문항들은,상기 복수의 서브 그룹들 각각에서 결정된 대표 문항을 포함하는,공개특허 10-2023-0173906-3-방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 대표 문항은,상기 복수의 서브 그룹들 각각에서 최다 빈도 수의 문항인,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서,상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 상기 최종 문항을 획득하는 단계는,상기 제 1 그룹에 대응되는 상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 제1 서브 그룹의 제 1 대표 문항을 제거하여 상기 최종 문항을 획득하는 단계;를 포함하는,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 외부 기기로부터 상기 최종 문항에 대한 답변이 기재된 답변 문서를 수신하는 단계; 및사전 학습된 제 2 신경망 모델을 이용하여, 상기 답변 문서로부터 사용자의 현재 상태를 포함하는 테스트 결과정보를 획득하는 단계;를 더 포함하는,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 사전 학습된 제 2 신경망 모델은,상기 적어도 하나의 사전 응답 문항, 상기 적어도 하나의 사전 응답 문항에 대한 답변 내용 및 상기 답변 문서에 기초하여 상기 테스트 결과 정보를 출력하는,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 사용자의 현재 상태가 제 1 질병에 대해서 정상 상태로 식별되는 경우, 상기 테스트 결과 정보를 상기 외부 기기로 전송하는 단계;공개특허 10-2023-0173906-4-를 더 포함하는,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서,상기 사용자의 현재 상태가 제 1 질병에 대해서 위험 상태로 식별되는 경우, 질병에 관한 정보가 라벨링된 상기사전 저장된 복수의 원문항들에 대한 정보에 기초하여, 상기 제 1 질병에 대응되는 추가 문항을 획득하는 단계;및상기 추가 문항을 포함하는 제 2 문서를 생성하여 상기 외부 기기로 전송하는 단계;를 더 포함하며,상기 추가 문항은 상기 사전 저장된 복수의 원문항들 중에서 상기 최종 문항과 상이한 문항인,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 추가 문항을 획득하는 단계는,상기 제 1 질병이 라벨링된 사전 저장된 복수의 원문항들에 대한 그룹들 중에서 상기 제 1 질병을 나타내는 대표 문항을 포함하는 그룹들에 포함된 원문항을 상기 추가 문항으로 획득하는 단계;를 포함하는,방법."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "컴퓨터 판독가능 저장매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 컴퓨팅 장치에서 사용자를테스트하기 위한 문서를 생성하기 위한 방법을 수행하도록 하며, 상기 방법은:외부 기기로부터 사용자의 식별정보 및 테스트의 종류에 관한 정보를 수신하는 단계;사전 학습된 제 1 신경망 모델을 이용하여, 상기 테스트의 종류에 관한 정보에 대응되는 복수의 후보 문항들을획득하는 단계;상기 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들에 기초하여, 상기 사용자의 식별정보에 대응되는 적어도 하나의 사전 응답 문항을 획득하는 단계;상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 최종 문항을획득하는 단계; 및상기 최종 문항을 포함하는 제 1 문서를 생성하여 상기 외부 기기로 전송하는 단계;를 포함하는,컴퓨터 판독가능 저장매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0074733", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "사용자를 테스트하기 위한 문서를 생성하기 위한 컴퓨팅 장치로서, 상기 컴퓨팅 장치는:공개특허 10-2023-0173906-5-프로세서;메모리; 및네트워크부;를 포함하고,상기 프로세서는,외부 기기로부터 사용자의 식별정보 및 테스트의 종류에 관한 정보를 수신하고,사전 학습된 제 1 신경망 모델을 이용하여, 상기 테스트의 종류에 관한 정보에 대응되는 복수의 후보 문항들을획득하고,상기 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들에 기초하여, 상기 사용자의 식별정보에 대응되는 적어도 하나의 사전 응답 문항을 획득하고,상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 최종 문항을획득하고, 그리고상기 최종 문항을 포함하는 제 1 문서를 생성하여 상기 네트워크부를 통해 상기 외부 기기로 전송하는,컴퓨팅 장치."}
{"patent_id": "10-2022-0074733", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 몇몇 실시예에 따른, 컴퓨팅 장치에 의해 수행되는, 사용자를 테스트하기 위한 문서를 생성하는 방법 으로서, 상기 방법은: 외부 기기로부터 사용자의 식별정보 및 테스트의 종류에 관한 정보를 수신하는 단계; 사전 학습된 제 1 신경망 모델을 이용하여, 상기 테스트의 종류에 관한 정보에 대응되는 복수의 후보 문항들을 획득하 는 단계; 상기 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들에 기초하여, 상기 사용자의 식별정보 에 대응되는 적어도 하나의 사전 응답 문항을 획득하는 단계; 상기 복수의 후보 문항들 중에서 상기 적어도 하나 의 사전 응답 문항에 대응되는 문항을 제거하여 최종 문항을 획득하는 단계; 및 상기 최종 문항을 포함하는 제 1 문서를 생성하여 상기 외부 기기로 전송하는 단계;를 포함할 수 있다."}
{"patent_id": "10-2022-0074733", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 문서를 생성하는 방법에 관한 것으로, 특히 사용자를 테스트하기 위한 문서를 생성하는 방법에 관한 것이다."}
{"patent_id": "10-2022-0074733", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "특정한 목적에 따라 사용자를 테스트하기 위한 다양한 방법들이 존재할 수 있다. 예를 들어, 사용자를 테스트하 기 위한 방법은 대표적으로 심리검사(psychological test)를 포함할 수 있다. 심리검사는 인간의 지능, 적성, 학력, 성격 등을 검사하여 검사결과를 체계적인 수치로 표현하는 테스트 방법을 의미할 수 있다. 예를 들어, 심리검사는 인지적 능력을 측정하기 위한 지능검사(intelligence test), 특정한 활 동에 대하여 얼마만큼 적합한 소질을 가지고 있는가를 측정하기 위한 적성검사(aptitude test), 학업에 대한 능 력을 측정하기 위한 학력검사(achievement test), 및/또는 개인적인 특성, 태도 또는 기질의 성격을 측정하기 위한 성격검사(personality test) 등을 포함할 수 있다. 하지만, 심리검사는 신뢰도와 타당도를 높이기 위해 동일 유형의 질문을 많이 포함하게 되고, 그리고 검사의 표 준화를 위해 특정한 사용자에게는 해당되지 않은 불필요한 질문이 심리검사 과정에서 존재할 수 있다. 사용자는 심리검사에서 많은 개수의 그리고 중복되는 문항에 대해서 답하고, 과거에 다른 검사지에서 검사했던 부분을 재 응답하는 과정에서 피로도를 느낄 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2004-0027331호(2004.04.01. 공개)"}
{"patent_id": "10-2022-0074733", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 전술한 배경기술에 대응하여 안출 된 것으로, 사용자를 테스트하기 위한 문서를 생성하는 방법을 제 공하고자 한다.본 개시의 기술적 과제들은 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과 제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0074733", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 과제를 해결하기 위한, 본 개시의 몇몇 실시예에 따라, 컴퓨팅 장치에 의해 수행되는, 사용자를 테스트 하기 위한 문서를 생성하는 방법으로서, 상기 방법은: 외부 기기로부터 사용자의 식별정보 및 테스트의 종류에 관한 정보를 수신하는 단계; 사전 학습된 제 1 신경망 모델을 이용하여, 상기 테스트의 종류에 관한 정보에 대 응되는 복수의 후보 문항들을 획득하는 단계; 상기 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들 에 기초하여, 상기 사용자의 식별정보에 대응되는 적어도 하나의 사전 응답 문항을 획득하는 단계; 상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 최종 문항을 획득하는 단 계; 및 상기 최종 문항을 포함하는 제 1 문서를 생성하여 상기 외부 기기로 전송하는 단계;를 포함할 수 있다. 대안적으로, 상기 사전 학습된 제 1 신경망 모델을 이용하여, 상기 테스트의 종류에 관한 정보에 대응되는 복수 의 후보 문항들을 획득하는 단계는, 상기 사전 저장된 복수의 원문항들을 테스트의 종류별로 분류한 복수의 그 룹들 중에서 상기 테스트의 종류에 관한 정보에 대응되는 제 1 그룹을 선택하는 단계; 및 상기 제 1 그룹에 대 응되는 상기 복수의 후보 문항들을 획득하는 단계;를 포함할 수 있다. 대안적으로, 상기 제 1 그룹은, 키워드에 따라 분류된 복수의 서브 그룹들을 포함할 수 있다. 대안적으로, 상기 복수의 후보 문항들은, 상기 복수의 서브 그룹들 각각에서 결정된 대표 문항을 포함할 수 있 다. 대안적으로, 상기 대표 문항은, 상기 복수의 서브 그룹들 각각에서 최다 빈도 수의 문항일 수 있다. 대안적으로, 상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 상기 최종 문항을 획득하는 단계는, 상기 제 1 그룹에 대응되는 상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 제 1 서브 그룹의 제 1 대표 문항을 제거하여 상기 최종 문항을 획득하는 단 계;를 포함할 수 있다. 대안적으로, 상기 외부 기기로부터 상기 최종 문항에 대한 답변이 기재된 답변 문서를 수신하는 단계; 및 사전 학습된 제 2 신경망 모델을 이용하여, 상기 답변 문서로부터 사용자의 현재 상태를 포함하는 테스트 결과 정보 를 획득하는 단계;를 더 포함할 수 있다. 대안적으로, 상기 사전 학습된 제 2 신경망 모델은, 상기 적어도 하나의 사전 응답 문항, 상기 적어도 하나의 사전 응답 문항에 대한 답변 내용 및 상기 답변 문서에 기초하여 상기 테스트 결과 정보를 출력할 수 있다. 대안적으로, 상기 사용자의 현재 상태가 제 1 질병에 대해서 정상 상태로 식별되는 경우, 상기 테스트 결과 정 보를 상기 외부 기기로 전송하는 단계;를 더 포함할 수 있다. 대안적으로, 상기 사용자의 현재 상태가 제 1 질병에 대해서 위험 상태로 식별되는 경우, 질병에 관한 정보가 라벨링된 상기 사전 저장된 복수의 원문항들에 대한 정보에 기초하여, 상기 제 1 질병에 대응되는 추가 문항을 획득하는 단계; 및 상기 추가 문항을 포함하는 제 2 문서를 생성하여 상기 외부 기기로 전송하는 단계;를 더 포 함하며, 상기 추가 문항은 상기 사전 저장된 복수의 원문항들 중에서 상기 최종 문항과 상이한 문장일 수 있다. 대안적으로, 상기 추가 문항을 획득하는 단계는, 상기 제 1 질병이 라벨링된 사전 저장된 복수의 원문항들에 대 한 그룹들 중에서 상기 제 1 질병을 나타내는 대표 문항을 포함하는 그룹들에 포함된 원문항을 상기 추가 문항 으로 획득할 수 있다. 본 개시의 몇몇 다른 실시예에 따라, 컴퓨터 판독가능 저장매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 컴퓨팅 장치에서 사용자를 테스트하기 위한 문서를 생성하기 위한 방법을 수행하도록 하며, 상기 방 법은: 외부 기기로부터 사용자의 식별정보 및 테스트의 종류에 관한 정보를 수신하는 단계; 사전 학습된 제 1 신경망 모델을 이용하여, 상기 테스트의 종류에 관한 정보에 대응되는 복수의 후보 문항들을 획득하는 단계; 상 기 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들에 기초하여, 상기 사용자의 식별정보에 대응되 는 적어도 하나의 사전 응답 문항을 획득하는 단계; 상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 최종 문항을 획득하는 단계; 및 상기 최종 문항을 포함하는 제 1 문서를 생성하여 상기 외부 기기로 전송하는 단계;를 포함할 수 있다.본 개시의 몇몇 또 다른 실시예에 따라, 사용자를 테스트하기 위한 문서를 생성하기 위한 컴퓨팅 장치로서, 상 기 컴퓨팅 장치는: 프로세서; 메모리; 및 네트워크부;를 포함하고, 상기 프로세서는, 외부 기기로부터 사용자의 식별정보 및 테스트의 종류에 관한 정보를 수신하고, 사전 학습된 제 1 신경망 모델을 이용하여, 상기 테스트의 종류에 관한 정보에 대응되는 복수의 후보 문항들을 획득하고, 상기 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들에 기초하여, 상기 사용자의 식별정보에 대응되는 적어도 하나의 사전 응답 문항을 획득하고, 상기 복수의 후보 문항들 중에서 상기 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 최종 문항을 획득하고, 그리고 상기 최종 문항을 포함하는 제 1 문서를 생성하여 상기 네트워크부를 통해 상기 외부 기기로 전송할 수 있다."}
{"patent_id": "10-2022-0074733", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시는 사용자를 테스트하기 위한 문서를 효율적인 방식으로 생성할 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2022-0074733", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0074733", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다양한 실시예들이 이제 도면을 참조하여 설명된다. 본 명세서에서, 다양한 설명들이 본 개시의 이해를 제공하 기 위해서 제시된다. 그러나, 이러한 실시예들은 이러한 구체적인 설명 없이도 실행될 수 있음이 명백하다. 본 명세서에서 사용되는 \"실시예\", \"예\", \"양상\", \"예시\" 등은 기술되는 임의의 양상 또는 설계가 다른 양상 또 는 설계들보다 양호하다거나, 이점이 있는 것으로 해석되지 않을 수도 있다. 용어 \"또는\"은 배타적 \"또는\"이 아니라 내포적 \"또는\"을 의미하는 것으로 의도된다. 즉, 달리 특정되지 않거나 문맥상 명확하지 않은 경우에, \"X는 A 또는 B를 이용한다\"는 자연적인 내포적 치환 중 하나를 의미하는 것으로 의도된다. 또한, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 해당 특징 및/또는 구성요소가 존재함을 의미하는 것으로 이해되어야 한다. 다만, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 하나 이상의 다른 특징, 구성요소 및/또 는 이들의 그룹의 존재 또는 추가를 배제하지 않는 것으로 이해되어야 한다. 또한, 달리 특정되지 않거나 단수 형태를 지시하는 것으로 문맥상 명확하지 않은 경우에, 본 명세서와 청구범위에서 단수는 일반적으로 \"하나 또 는 그 이상\"을 의미하는 것으로 해석되어야 한다. 도 1은 본 개시의 몇몇 실시예에 따른 사용자를 테스트하기 위한 문서를 생성하기 위한 시스템의 블록 구성도이 다. 도 1을 참조하면, 사용자를 테스트하기 위한 문서를 생성하기 위한 시스템은 컴퓨팅 장치, 외부 기기 및 네트워크를 포함할 수 있다. 도 1에 도시된 시스템의 구성들 및 구성들 각각은 간략화하여 나타낸 예시 일 뿐이고, 이에 한정되지 않는다.컴퓨팅 장치는 인공지능을 이용하여 사용자를 테스트하기 위한 문서를 생성하기 위한 시스템 또는 그 일부 일 수 있다. 컴퓨팅 장치는 프로세서, 메모리, 네트워크부를 포함할 수 있다. 프로세서는 하나 이상의 코어로 구성될 수 있으며, 컴퓨팅 장치의 중앙 처리 장치(CPU: central processing unit), 범용 그래픽 처리 장치 (GPGPU: general purpose graphics processing unit), 텐서 처리 장 치(TPU: tensor processing unit) 등의 데이터 분석, 딥러닝을 위한 프로세서를 포함할 수 있다. 프로세서는 메모리에 저장된 컴퓨터 프로그램을 판독하여 본 개시의 몇몇 실시예에 따른 사용자를 테스트 하기 위한 문서를 생성하기 위한 데이터 처리를 수행할 수 있다. 또한, 프로세서는 본 개시의 몇몇 실시예 에 따른 사용자를 테스트하기 위한 문서를 생성하는 방법을 수행하기 위한 임의의 컴포넌트 또는 모듈을 구현할 수 있다. 또한, 본 개시의 몇몇 실시예에 따른 컴퓨팅 장치에서 수행되는 컴퓨터 프로그램은 CPU, GPGPU 또는 TPU 실행가 능 프로그램일 수 있다. 본 개시의 몇몇 실시예에 따르면, 메모리는 프로세서가 생성하거나 결정한 임의의 형태의 정보 및 네 트워크부가 수신한 임의의 형태의 정보를 저장할 수 있다. 본 개시의 몇몇 실시예에 따르면, 메모리는 임의의 유형의 저장매체를 포함할 수 있다. 컴퓨팅 장치 는 인터넷(internet) 상에서 상기 메모리의 저장 기능을 수행하는 웹 스토리지(web storage)와 관련되어 동작할 수도 있다. 전술한 메모리에 대한 기재는 예시일 뿐, 본 개시는 이에 제한되지 않는다. 본 개시의 몇몇 실시예에 따르면, 메모리는 본 개시의 사용자를 테스트하기 위한 문서를 생성하기 위한 임 의의 정보를 저장할 수 있다. 본 개시의 몇몇 실시예에 따른 네트워크부는 임의의 형태의 공지된 유선 또는 무선 네트워크들을 사용할 수 있다. 네트워크부는 유선 및 무선 등과 같은 그 통신 양태를 가리지 않고 구성될 수 있으며, PAN, LAN, WAN 등 다양한 통신망으로 구성될 수 있다. 또한, 네트워크부는 공지의 월드와이드웹(WWW: World Wide Web)일 수 있으며, 적외선 또는 블루투스와 같이 단거리 통신에 이용되는 무선 전송 기술을 이용할 수도 있다. 본 개시에서 네트워크부는 본 개시의 사용자를 테스트하기 위한 문서를 생성하는 방법을 수행하기 위해 외 부 기기와 통신하여 데이터, 신호 및/또는 정보 중 적어도 하나를 송수신할 수 있다. 본 명세서에서 설명된 기술들은 위에서 언급된 네트워크들 뿐만 아니라, 다른 네트워크들에서도 사용될 수 있다. 본 개시의 몇몇 실시예에 따른 컴퓨팅 장치는 사용자를 테스트하기 위한 문서를 생성하기 위해 외부 기기 로부터 정보를 수신할 수 있다. 예를 들어, 컴퓨팅 장치의 프로세서는 외부 기기로부터 사 용자의 식별정보 및 테스트의 종류에 관한 정보를 네트워크부를 통해 수신할 수 있다. 본 개시의 일 실시 예에 따라 사용자의 테스트를 위한 문서를 생성하기 위해서는 다양한 정보가 필요할 수 있다. 사용자의 식별정보는 사용자의 유일성을 확인하기 위한 정보일 수 있다. 예를 들어, 사용자의 식별정보는 사용 자의 이름, 사용자의 나이, 사용자의 아이디(identification) 및/또는 사용자의 고유번호(예를 들어, 주민등록 증 번호, 운전면허 번호 등) 중 적어도 하나를 포함할 수 있다. 프로세서는 사용자의 식별정보에 기초하여 외부 기기의 사용자를 인식할 수 있다. 테스트는 사람의 학력, 지능, 능력 등을 알아보기 위한 검사 또는 시험을 포함할 수 있다. 예를 들어, 테스트는 심리검사(psychological test)를 포함할 수 있다. 심리검사는 인간의 지능, 적성, 학력, 성격 등을 검사하여 검 사결과를 체계적인 수치로 표현하는 측정방법을 의미할 수 있다. 예를 들어, 심리검사는 인지적 능력을 측정하 기 위한 지능검사(intelligence test), 특정한 활동에 대하여 얼마만큼 적합한 소질을 가지고 있는가를 측정하 기 위한 적성검사(aptitude test), 학업에 대한 능력을 측정하기 위한 학력검사(achievement test), 개인적인 특성, 태도 또는 기질의 성격을 측정하기 위한 성격검사(personality test) 등을 포함할 수 있다. 따라서, 테스 트의 종류는 지능검사, 적성검사, 학력검사 및/또는 성격검사 중 적어도 하나를 포함할 수 있다. 테스트의 종류 는 외부 기기의 사용자가 진행하고자 하는 테스트와 관련된 종류일 수 있다. 위에서 예를 들어 설명된 바와 같이, 본 개시에서의 사용자를 테스트하기 위한 문서는 예를 들어 사용자의 심리 검사를 수행하기 위한 심리검사 문항을 포함하는 문서를 포함할 수 있다. 이하에서는 설명의 편의를 위해 사용 자 테스트를 위한 문서에 대한 예시로 심리검사를 수행하기 위한 문서를 들어 설명하기로 한다.프로세서는 사전 학습된 제 1 신경망 모델을 이용하여, 테스트의 종류에 관한 정보에 대응되는 복수의 후 보 문항들을 획득할 수 있다. 제 1 신경망 모델은 사전 저장된 복수의 원문항들을 포함하는 학습 데이터를 사용하여, 사전 저장된 복수의 원 문항들을 테스트의 종류별로 분류하도록 학습될 수 있다. 제 1 신경망 모델은 사전 저장된 복수의 원문항들을 테스트의 종류별로 분류하여 복수의 그룹들을 생성할 수 있 다. 그리고, 제 1 신경망 모델은 복수의 그룹들 각각에서 키워드에 따라 복수의 원문항들을 분류하여 복수의 서 브 그룹들을 생성할 수 있다. 일 실시예에서, 사전 저장된 복수의 원문항들은 사전에 수행되어 메모리에 저장된 테스트의 문서에 포함된 문항일 수 있다. 사전 저장된 복수의 원문항들은 사용자의 식별정보, 테스트의 종류에 관한 정보 및/또는 질병 에 관한 정보 중 적어도 하나가 라벨링되어 있을 수 있다. 따라서, 제 1 신경망 모델은 사전 저장된 복수의 원 문항들을 테스트의 종류별로 분류된 복수 그룹들을 생성할 수 있다. 프로세서는 사전 학습된 제 1 신경망 모델을 이용하여, 사전 저장된 복수의 원문항들을 테스트의 종류별로 분류한 복수의 그룹들 중에서 테스트의 종류에 관한 정보에 대응되는 제 1 그룹을 선택할 수 있다. 그리고, 프 로세서는 제 1 신경망 모델을 이용하여, 제 1 그룹에 대응되는 복수의 후보 문항들을 획득할 수 있다. 제 1 그룹은 외부 기기로부터 수신한 테스트의 종류에 대응되는 그룹일 수 있다. 예를 들어, 외부 기기 로부터 수신한 테스트의 종류가 우울증 검사인 경우, 제 1 그룹은 우울증 검사와 관련된 문항이 포함된 그 룹일 수 있다. 복수의 그룹들 각각은 키워드에 따라 분류될 수 있다. 예를 들어, 복수의 그룹들 중 하나인 제 1 그룹은 키워드 에 따라 분류된 복수의 서브 그룹들을 포함할 수 있다. 복수의 후보 문항들은 복수의 서브 그룹들 각각에서 결정된 대표 문항을 포함할 수 있다. 예를 들어, 복수의 후 보 문항들은 복수의 서브 그룹들 중 제 1 서브 그룹에서 결정된 제 1 대표 문항, 제 2 서브 그룹에서 결정된 제 2 대표 문항 및 제 3 서브 그룹에서 결정된 제 3 대표 문항을 포함할 수 있다. 대표 문항은 복수의 서브 그룹들 각각에서 사전 결정된 기준에 기초하여 결정된 문항일 수 있다. 예를 들어, 대표 문항은 복수의 서브 그룹들 각각에서 최다 빈도 수의 문항일 수 있다. 구체적으로, 동일한 문 서로 테스트를 진행한 사용자가 다수인 경우에는 사전 저장된 복수의 원문항들에 동일한 내용이지만 라벨링된 사용자의 식별정보가 다른 문항들이 존재할 수 있다. 따라서, 프로세서는 복수의 서브 그룹들 각각에서 문 항의 내용은 동일하고, 라벨링된 사용자의 식별정보가 서로 다른 문항이 가장 많은 문항, 즉, 최다 빈도 수의 문항을 대표 문항으로 결정할 수 있다. 다른 예를 들어, 대표 문항은 복수의 서브 그룹들 각각에서 키워드를 가장 많이 포함하는 문항일 수 있다. 구체 적으로, 사전 저장된 복수의 원문항들은 키워드에 따라 같은 그룹으로 분류될 수 있지만, 문항의 내용에 포함된 키워드의 수는 서로 다를 수 있다. 따라서, 프로세서는 복수의 서브 그룹들 각각에서 문항의 내용에 포함 된 키워드의 개수가 가장 많은 문항을 대표 문항으로 결정할 수 있다. 프로세서는 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들에 기초하여, 사용자의 식별정보에 대응되는 적어도 하나의 사전 응답 문항을 획득할 수 있다. 적어도 하나의 사전 응답 문항은 사전 저장된 복수의 원문항들 중에서 외부 기기로부터 수신한 사용자의 식별정보가 라벨링 되어 있는 문항을 의미할 수 있다. 따라서, 적어도 하나의 사전 응답 문항은 이전에 외부 기 기의 사용자가 사전에 수행한 테스트의 문서에 포함된 문항일 수 있다. 프로세서는 복수의 후보 문항들 중에서 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 최종 문항을 획득할 수 있다. 예를 들어, 프로세서는 제 1 그룹에 대응되는 복수의 후보 문항들 중에서 적어도 하나의 사전 응답 문항에 대응되는 제 1 서브 그룹의 제 1 대표 문항을 제거하여 최종 문항을 획득할 수 있다. 구체적으로, 프로세서 는 복수의 서브 그룹들 중에서 적어도 하나의 사전 응답 문항이 속하는 제 1 서브 그룹을 결정할 수 있다. 그리고, 프로세서는 제 1 그룹에 대응되는 복수의 후보 문항들 중에서 제 1 서브 그룹의 대표 문항을 제외 한 나머지 문항들을 최종 문항으로 결정할 수 있다. 따라서, 프로세서는 복수의 후보 문항들 중에서 외부 기기의 사용자가 사전에 수행한 테스트의 문서에 포함된 문항을 제외한 나머지 문항들을 최종 문항으로 결정할 수 있다. 본 개시의 몇몇 실시예에 따르면, 프로세서는 복수의 후보 문항들 중에서 사전 결정된 생략 문항에 대응되 는 문항을 제거하여 최종 문항을 획득할 수 있다. 사전 결정된 생략 문항은 중요도가 낮은 것으로 판단되어 최종 문항에서 제거하기로 사전에 결정된 문항일 수 있다. 예를 들어, 사전 결정된 생략 문항은 장기간 변화가 없는 기질에 관한 문항을 포함할 수 있다. 프로세서는 복수의 원문항들 중에서 외부 기기의 사용자가 사전 답변된 문항이 제거된 최종 문항이 생성된다는 점에서 사용자에게 효율적인 심리 검사를 제공할 수 있다. 프로세서는 최종 문항을 포함하는 제 1 문서를 생성하여 외부 기기로 네트워크부를 통해 전송할 수 있다. 프로세서는 복수의 후보 문항들 중에서 외부 기기의 사용자가 사전에 수행한 테스트의 문서 에 포함된 문항을 제외한 나머지 문항인 최종 문항을 포함하는 제 1 문서를 외부 기기로 전송함으로써, 외 부 기기의 사용자가 사전에 수행했던 테스트의 문항과 중복되지 않는 문항만을 수신하고 응답하도록 할 수 있다. 프로세서는 외부 기기로부터 최종 문항에 대한 답변이 기재된 답변 문서를 수신할 수 있다. 그리고, 프로세서는 사전 학습된 제 2 신경망 모델을 이용하여, 답변 문서로부터 사용자의 현재 상태를 포함하는 테스트 결과 정보를 획득할 수 있다. 프로세서는 테스트 결과 정보를 메모리에 저장할 수 있다. 제 2 신경망 모델은 입력되는 문항 및 답변에 기초하여 점수를 책정하고, 점수에 따라 결정된 사용자의 현재 상 태를 포함하는 테스트 결과 정보를 출력할 수 있다. 본 개시의 몇몇 실시예에 따르면, 제 2 신경망 모델은 적어도 하나의 사전 응답 문항, 적어도 하나의 사전 응답 문항에 대한 답변 내용 및/또는 최종 문항에 대한 답변이 기재된 답변 문서 중 적어도 하나에 기초하여 테스트 결과 정보를 출력할 수 있다. 따라서, 프로세서는 제 2 신경망 모델을 이용하여 현재 정보(외부 기기(20 0)로부터 수신한 답변 문서)뿐만 아니라 과거 정보(사전 저장된 사용자의 사전 응답 문항 및 그에 대한 답변 내 용)를 같이 이용하여 테스트 결과 정보를 출력함으로써, 정확도가 높은 테스트 결과 정보를 출력할 수 있다. 적어도 하나의 사전 응답 문항에 대한 답변 내용은 적어도 하나의 사전 응답 문항에 대응하여 메모리에 저 장되어 있을 수 있다. 따라서, 프로세서는 사용자의 식별정보에 기초하여 적어도 하나의 사전 응답 문항 및/또는 적어도 하나의 사전 응답 문항에 대한 답변 내용을 획득할 수 있다. 답변 문서는 최종 문항 및/또는 최종 문항에 대응하여 사용자가 답변했던 내용을 포함할 수 있다. 점수는 복수의 질병들 중에서 하나의 질병(예를 들어, 우울증, 불안장애, 스트레스 등)에 대한 정도를 나타내는 값일 수 있다. 제 2 신경망 모델은 점수가 라벨링된 문항 및 답변을 포함하는 학습 데이터를 이용하여 학습될 수 있다. 질병은 심신의 전체 또는 일부가 일차적 또는 지속적으로 장애를 일으켜서 정상적인 기능을 할 수 없는 상태로, 테스트 결과 정보와 관련된 병일 수 있다. 예를 들어, 질병은 테스트 결과(예를 들어, 심리 검사 결과 등)에 따 른 정신적 질환에 대응되는 병일 수 있다. 프로세서는 점수가 사전 설정된 임계 값 이상인 경우, 해당 질병에 대해서 위험 상태로 판단할 수 있다. 또한, 프로세서는 점수가 사전 설정된 임계 값 미만인 경우, 해당 질병에 대해서 정상 상태로 판단할 수 있다. 프로세서는 사용자의 현재 상태에 기초하여 신호, 데이터 및/또는 정보 중 적어도 하나를 외부 기기 로 전송할 수 있다. 예를 들어, 프로세서는 사용자의 현재 상태가 제 1 질병에 대해서 정상 상태로 식별되는 경우, 테스트 결 과 정보를 외부 기기로 전송할 수 있다. 다른 예를 들어, 프로세서는 사용자의 현재 상태가 제 1 질병에 대해서 위험 상태로 식별되는 경우, 질병 에 관한 정보가 라벨링된 사전 저장된 복수의 원문항들에 대한 정보에 기초하여, 제 1 질병에 대응되는 추가 문 항을 획득할 수 있다. 프로세서는 제 1 질병에 대응되는 원문항을 추가 문항으로 결정할 수 있다. 그리고, 프로세서는 추가 문항을 포함하는 제 2 문서를 생성하여 외부 기기로 전송할 수 있다. 추가 문항은사전 저장된 복수의 원문항들 중에서 최종 문항과 상이한 문장일 수 있다. 프로세서는 제 1 질병이 라벨링 된 사전 저장된 복수의 원문항들에 대한 그룹들 중에서 제 1 질병을 나타내는 대표 문항을 포함하는 그룹들에 포함된 원문항을 추가 문항으로 획득할 수 있다. 프로세서는 심리 검사에 문제가 없는 경우에는 정상인 형태의 결과가 출력되고, 그렇지 않은 경우(심리 검 사에 문제가 있는 경우)에는 추가 문항을 생성하여 추가 질문을 제시한다는 점에서 사용자에게 효율적인 심리 검사를 제공할 수 있다. 본 명세서에 걸쳐, 신경망 모델, 신경망, 연산 모델, 네트워크 함수, 뉴럴 네트워크(neural network)는 동일한 의미로 사용될 수 있다. 신경망은 일반적으로 노드라 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성 될 수 있다. 이러한 노드들은 뉴런(neuron)들로 지칭될 수도 있다. 신경망은 적어도 하나 이상의 노드들을 포함 하여 구성된다. 신경망들을 구성하는 노드(또는 뉴런)들은 하나 이상의 링크에 의해 상호 연결될 수 있다. 신경망 내에서, 링크를 통해 연결된 하나 이상의 노드들은 상대적으로 입력 노드 및 출력 노드의 관계를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 상술한 바 와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나 이상의 출 력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서, 출력 노드는 입력 노드에 입력된 데이터에 기초 하여 그 값이 결정될 수 있다. 여기서 입력 노드와 출력 노드를 상호 연결하는 노드는 파라미터를 가질 수 있다. 파라미터는 가변적일 수 있으며, 신경망이 원하는 기능을 수행하기 위해, 사용자 또는 알고리즘에 의해 가변 될 수 있다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연결된 경 우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하는 링크 에 설정된 파라미터에 기초하여 출력 노드 값을 결정할 수 있다. 상술한 바와 같이, 신경망은 하나 이상의 노드들이 하나 이상의 링크를 통해 상호 연결되어 신경망 내에서 입력 노드 및 출력 노드 관계를 형성한다. 신경망 내에서 노드들과 링크들의 개수 및 노드들과 링크들 사이의 연관관 계, 링크들 각각에 부여된 파라미터의 값에 따라, 신경망의 특성이 결정될 수 있다. 예를 들어, 동일한 개수의 노드 및 링크들이 존재하고, 링크들 사이의 파라미터 값이 상이한 두 신경망이 존재하는 경우, 두 개의 신경망 들은 서로 상이한 것으로 인식될 수 있다. 신경망은 하나 이상의 노드들을 포함하여 구성될 수 있다. 신경망을 구성하는 노드들 중 일부는, 최초 입력 노 드로부터의 거리들에 기초하여, 하나의 레이어(layer)를 구성할 수 있다. 예를 들어, 최초 입력 노드로부터 거 리가 n인 노드들의 집합은, n 레이어를 구성할 수 있다. 최초 입력 노드로부터 거리는, 최초 입력 노드로부터 해당 노드까지 도달하기 위해 거쳐야 하는 링크들의 최소 개수에 의해 정의될 수 있다. 그러나, 이러한 레이어 의 정의는 설명을 위한 임의적인 것으로서, 신경망 내에서 레이어의 차수는 상술한 것과 상이한 방법으로 정의 될 수 있다. 예를 들어, 노드들의 레이어는 최종 출력 노드로부터 거리에 의해 정의될 수도 있다. 최초 입력 노드는 신경망 내의 노드들 중 다른 노드들과의 관계에서 링크를 거치지 않고 데이터가 직접 입력되 는 하나 이상의 노드들을 의미할 수 있다. 또는, 신경망 네트워크 내에서, 링크를 기준으로 한 노드 간의 관계 에 있어서, 링크로 연결된 다른 입력 노드들 가지지 않는 노드들을 의미할 수 있다. 이와 유사하게, 최종 출력 노드는 신경망 내의 노드들 중 다른 노드들과의 관계에서, 출력 노드를 가지지 않는 하나 이상의 노드들을 의미 할 수 있다. 또한, 히든 노드는 최초 입력 노드 및 최후 출력 노드가 아닌 신경망을 구성하는 노드들을 의미할 수 있다. 본 개시의 일 실시예에 따른 신경망은 입력 레이어의 노드의 개수가 출력 레이어의 노드의 개수와 동 일할 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 감소하다가 다시 증가하는 형태의 신경망일 수 있다. 또한, 본 개시의 다른 일 실시예에 따른 신경망은 입력 레이어의 노드의 개수가 출력 레이어 의 노드의 개수 보다 적을 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 감소하는 형 태의 신경망일 수 있다. 또한, 본 개시의 또 다른 일 실시예에 따른 신경망은 입력 레이어의 노드의 개수가 출 력 레이어의 노드의 개수보다 많을 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 증가 하는 형태의 신경망일 수 있다. 본 개시의 또 다른 일 실시예에 따른 신경망은 상술한 신경망들의 조합된 형태 의 신경망일 수 있다. 딥 뉴럴 네트워크(DNN: deep neural network, 심층신경망)는 입력 레이어와 출력 레이어 외에 복수의 히든 레이 어를 포함하는 신경망을 의미할 수 있다. 딥 뉴럴 네트워크를 이용하면 데이터의 잠재적인 구조(latentstructures)를 파악할 수 있다. 즉, 사진, 글, 비디오, 음성, 음악의 잠재적인 구조(예를 들어, 어떤 물체가 사 진에 있는지, 글의 내용과 감정이 무엇인지, 음성의 내용과 감정이 무엇인지 등)를 파악할 수 있다. 딥 뉴럴 네 트워크는 컨볼루셔널 뉴럴 네트워크(CNN: convolutional neural network), 리커런트 뉴럴 네트워크(RNN: recurrent neural network), 오토 인코더(auto encoder), GAN(Generative Adversarial Networks), 제한 볼츠 만 머신(RBM: restricted boltzmann machine), 심층 신뢰 네트워크(DBN: deep belief network), Q 네트워크, U 네트워크, 샴 네트워크 등을 포함할 수 있다. 전술한 딥 뉴럴 네트워크의 기재는 예시일 뿐이며 본 개시는 이에 제한되지 않는다. 본 개시의 일 실시예에 따른 네트워크 함수에 대한 일례로 트랜스포머(transformer)가 고려될 수 있다. 일 실시예에서, 트랜스포머는 임베딩된 데이터들을 인코딩하는 인코더 및 인코딩된 데이터들을 디코딩하는 디코 더로 구성될 수 있다. 트랜스포머는 일련의 데이터(a series of data)들을 수신하여, 인코딩 및 디코딩 단계를 거처 상이한 타입의 일련의 데이터들을 출력하는 구조를 지닐 수 있다. 일 실시예에서, 일련의 데이터들은 트랜 스포머가 연산가능한 형태로 가공될 수 있다. 일련의 데이터들을 트랜스포머가 연산가능한 형태로 가공하는 과 정은 임베딩 과정을 포함할 수 있다. 데이터 토큰, 임베딩 벡터, 임베딩 토큰등과 같은 표현들은, 트랜스포머가 처리할 수 있는 형태로 임베딩된 데이터들을 지칭하는 것일 수 있다. 트랜스포머가 일련의 데이터들을 인코딩 및 디코딩하기 위하여, 트랜스포머 내의 인코더 및 디코더들을 어텐션 (attention) 알고리즘을 활용하여 처리할 수 있다. 어텐션 알고리즘이란 주어진 쿼리(Query)에 대해, 하나 이상 의 키(Key)에 대한 유사도를 구하고, 이렇게 주어진 유사도를, 각각의 키(Key)와 대응하는 값(Value)에 반영한 후, 유사도가 반영된 값(Value)들을 가중합하여 어텐션(attention) 값을 계산하는 알고리즘을 의미할 수 있다."}
{"patent_id": "10-2022-0074733", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "쿼리(Query), 키(Key) 및 값(Value)를 어떻게 설정하느냐에 따라, 다양한 종류의 어텐션 알고리즘이 분류될 수 있다. 예를 들어, 쿼리, 키 및 값을 모두 동일하게 설정하여 어텐션을 구하는 경우, 이는 셀프-어텐션 알고리즘 을 의미할 수 있다. 입력된 일련의 데이터들을 병렬로 처리하기 위해, 임베딩 벡터를 차원을 축소하여, 각 분할 된 임베딩 벡터에 대해 개별적인 어텐션 헤드를 구하여 어텐션을 구하는 경우, 이는 멀티-헤드(multi-head) 어 텐션 알고리즘을 의미할 수 있다. 일 실시예에서, 트랜스포머는 복수의 멀티-헤드 셀프 어텐션 알고리즘 또는 멀티-헤드 인코더-디코더 알고리즘 을 수행하는 모듈들로 구성될 수 있다. 일 실시예에서, 트랜스포머는 임베딩 레이어, 정규화 레이어, 소프트맥 스(softmax) 층 등 어텐션 알고리즘이 아닌 부가적인 구성요소들 또한 포함할 수 있다. 어텐션 알고리즘을 이용 하여 트랜스포머를 구성하는 방법은 Vaswani et al., Attention Is All You Need, 2017 NIPS에 개시된 방법을 포함할 수 있으며, 이는 여기에 참조로서 통합된다. 트랜스포머는 임베딩된 자연어, 분할된 이미지 데이터, 오디오 파형 등 다양한 데이터 도메인에 적용하여, 일련 의 입력 데이터를 일련의 출력 데이터로 변환할 수 있다. 다양한 데이터 도메인을 가진 데이터들을 트랜스포머 에 입력가능한 일련의 데이터들로 변환하기 위해, 트랜스포머는 데이터들을 임베딩할 수 있다. 트랜스포머는 일 련의 입력 데이터 사이의 상대적 위치관계 또는 위상관계를 표현하는 추가적인 데이터를 처리할 수 있다. 또는 일련의 입력 데이터에 입력 데이터들 사이의 상대적인 위치관계 또는 위상관계를 표현하는 벡터들이 추가적으로 반영되어 일련의 입력 데이터가 임베딩될 수 있다. 일 예에서, 일련의 입력 데이터 사이의 상대적 위치관계는, 자연어 문장 내에서의 어순, 각각의 분할된 이미지의 상대적 위치 관계, 분할된 오디오 파형의 시간 순서 등을 포함할 수 있으나, 이에 제한되지 않는다. 일련의 입력 데이터들 사이의 상대적인 위치관계 또는 위상관계를 표 현하는 정보를 추가하는 과정은 위치 인코딩(positional encoding)으로 지칭될 수 있다. 이미지 데이터를 임베딩하여 트랜스포머로 변환하는 방법의 일 예는 Dosovitskiy, et al., AN IMAGE IS WORTH 16X16 WORDS: TRANSFORMERS FOR IMAGE RECOGNITION AT SCALE에 개시되어 있으며, 해당 문서는 여기에 참조로서 통합된다. 외부 기기는 컴퓨팅 장치와 통신을 위한 매커니즘을 갖는 시스템에서의 임의의 형태의 노드들을 의미 할 수 있다. 예를 들어, 외부 기기는 모바일 단말기, 스마트 폰 등을 포함하는 사용자 단말일 수 있다. 외부 기기는 사용자로부터 사용자의 식별정보 및 테스트의 종류에 관한 정보를 입력 받을 수 있다. 예를 들어, 외부 기기는 사용자 인터페이스를 통해 사용자의 식별정보 및 테스트의 종류에 관한 정보를 입력 받 을 수 있다. 외부 기기는 컴퓨팅 장치로부터 최종 문항을 포함하는 제 1 문서를 수신하는 경우, 사용자에게 제공 할 수 있다. 예를 들어, 외부 기기는 제 1 문서를 외부 기기에 포함된 화면에 출력함으로써, 사용자 에게 제공할 수 있다. 외부 기기는 사용자로부터 제 1 문서에 포함된 최종 문항에 대한 답변을 입력 받을 수 있다. 예를 들어, 외부 기기는 사용자 인터페이스를 통해 제 1 문서에 포함된 최종 문항에 대한 답변을 입력 받을 수 있다. 외부 기기는 최종 문항에 대한 답변이 기재된 답변 문서를 컴퓨팅 장치로 전송할 수 있다. 외부 기기 는 사용자의 현재 상태를 포함하는 테스트 결과 정보를 컴퓨팅 장치로부터 수신할 수 있다. 외부 기 기는 추가 문항을 포함하는 제 2 문서를 컴퓨팅 장치로부터 수신할 수 있다. 네트워크는 임의의 형태의 데이터, 신호 및/또는 정보 중 적어도 하나를 송수신할 수 있는 임의의 유무선 통신 네트워크를 포함할 수 있다. 예를 들어, 네트워크는 컴퓨팅 장치와 외부 기기 간에 사용자 의 식별정보, 테스트의 종류에 관한 정보, 제 1 문서, 답변 문서, 테스트 결과 정보 및/또는 제 2 문서 중 적어 도 하나를 송수신할 수 있는 유무선 통신 네트워크를 포함할 수 있다. 도 2는 본 개시의 몇몇 실시예에 따른 시스템에서 사용자를 테스트하기 위한 문서를 생성하는 과정을 나타낸 도 면이다. 도 2를 참조하면, 외부 기기는 사용자 인터페이스를 통해 외부 기기의 사용자로부터 사용자의 식별정 보 및 테스트의 종류에 관한 정보를 입력 받을 수 있다. 그리고, 외부 기기는 사용자의 식별정보 및 테스 트의 종류에 관한 정보를 컴퓨팅 장치로 전송할 수 있다(S110). 컴퓨팅 장치는 사전 학습된 제 1 신경망 모델을 이용하여, 테스트 종류에 관한 정보에 대응되는 복수의 후 보 문항들을 획득할 수 있다(S120). 제 1 신경망 모델은 사전 저장된 복수의 원문항들을 포함하는 학습 데이터를 사용하여, 사전 저장된 복수의 원 문항들을 테스트의 종류별로 분류하도록 학습될 수 있다. 제 1 신경망 모델은 사전 저장된 복수의 원문항들을 테스트의 종류별로 분류하여 복수의 그룹들을 생성할 수 있 다. 그리고, 제 1 신경망 모델은 복수의 그룹들 각각에서 키워드에 따라 복수의 원문항들을 분류하여 복수의 서 브 그룹들을 생성할 수 있다. 일례로, 제 1 신경망 모델은 원문항을 입력 받았을 때 출력으로 입력된 원문항이 속하는 분류(즉, 그룹)가 무엇 인지를 출력하기 위한 분류 모델(classification model)을 의미할 수 있다. 다른 예시로, 제 1 신경망 모델은 복수의 원문항들을 군집화하기 위한 비지도 학습 기반의 클러스터링 모델을 포함할 수도 있다. 예를 들어, 비지도 학습에 사용되는 데이터에는 레이블(label)이 명시되어 있지 않은 원문항 이 포함될 수 있다. 이러한 클러스터링 모델은 입력된 데이터가 어떤 형태로 서로 그룹을 형성하는지를 파악할 수 있다. 클러스터링 모델은 레이블이 없는 학습 데이터들의 특징(feature)을 분석하여 서로 동일하거나 유사한 특징을 가진 데이터끼리 그룹화 함으로써 레이블이 없는 학습 데이터를 그룹화시킬 수 있다. 또한, 그룹화가 완 료된 클러스터링 모델에 새로운 데이터가 입력되는 경우, 지도 학습의 분류 모델과 유사한 방식을 사용하여, 사 전 학습한 그룹들의 특징값들에 기반하여 새롭게 입력된 데이터가 어느 그룹에 속하는지를 분석할 수 있다. 복수의 후보 문항들은 복수의 서브 그룹들 각각에서 결정된 대표 문항을 포함할 수 있다. 예를 들어, 복수의 후 보 문항들은 복수의 서브 그룹들 중 제 1 서브 그룹에서 결정된 제 1 대표 문항, 제 2 서브 그룹에서 결정된 제 2 대표 문항 및 제 3 서브 그룹에서 결정된 제 3 대표 문항을 포함할 수 있다. 컴퓨팅 장치는 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들에 기초하여, 사용자의 식별정 보에 대응되는 적어도 하나의 사전 응답 문항을 획득할 수 있다(S130). 적어도 하나의 사전 응답 문항은 사전 저장된 복수의 원문항들 중에서 외부 기기로부터 수신한 사용자의 식별정보가 라벨링 되어 있는 문항을 의미할 수 있다. 따라서, 적어도 하나의 사전 응답 문항은 이전에 외부 기 기의 사용자가 사전에 수행한 테스트의 문서에 포함된 문항일 수 있다. 컴퓨팅 장치는 복수의 후보 문항들 중에서 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 최 종 문항을 획득할 수 있다(S140). 예를 들어, 프로세서는 제 1 그룹에 대응되는 복수의 후보 문항들 중에서 적어도 하나의 사전 응답 문항에 대응되는 제 1 서브 그룹의 제 1 대표 문항을 제거하여 최종 문항을 획득할 수 있다.컴퓨팅 장치는 최종 문항을 포함하는 제 1 문서를 생성하여 외부 기기로 전송할 수 있다(S150). 외부 기기는 컴퓨팅 장치로부터 최종 문항을 포함하는 제 1 문서를 수신하는 경우, 사용자에게 제공 할 수 있다. 예를 들어, 외부 기기는 제 1 문서를 외부 기기에 포함된 화면에 출력함으로써, 사용자 에게 제공할 수 있다. 외부 기기는 사용자로부터 제 1 문서에 포함된 최종 문항에 대한 답변을 입력 받을 수 있다(S160). 예를 들어, 외부 기기는 사용자 인터페이스를 통해 제 1 문서에 포함된 최종 문항에 대한 답변을 입력 받을 수 있다. 외부 기기는 최종 문항에 대한 답변이 기재된 답변 문서를 컴퓨팅 장치로 전송할 수 있다(S170). 컴퓨팅 장치는 사전 학습된 제 2 신경망 모델을 이용하여, 답변 문서로부터 사용자의 현재 상태를 포함하 는 테스트 결과 정보를 획득할 수 있다(S180). 제 2 신경망 모델은 입력되는 문항 및 답변에 기초하여 점수를 책정하고, 점수에 따라 결정된 사용자의 현재 상 태를 포함하는 테스트 결과 정보를 출력할 수 있다. 점수는 복수의 질병들 중에서 하나의 질병(예를 들어, 우울 증, 불안장애, 스트레스 등)에 대한 정도를 나타내는 값일 수 있다. 제 2 신경망 모델은 점수가 라벨링된 문항 및 답변을 포함하는 학습 데이터를 이용하여 학습될 수 있다. 프로세서는 점수가 사전 설정된 임계 값 이상인 경우, 해당 질병에 대해서 위험 상태로 판단할 수 있다. 또한, 프로세서는 점수가 사전 설정된 임계 값 미만인 경우, 해당 질병에 대해서 정상 상태로 판단할 수 있다. 프로세서는 사용자의 현재 상태에 기초하여 신호, 데이터 및/또는 정보 중 적어도 하나를 외부 기기 로 전송할 수 있다. 도 3은 본 개시의 몇몇 실시예에 따른 컴퓨팅 장치에서 사용자를 테스트하기 위한 문서를 생성하기 위한 방법을 설명하기 위한 도면이다. 컴퓨팅 장치는 외부 기기로부터 사용자의 식별정보 및 테스트의 종류에 관한 정보를 수신할 수 있다 (S210). 컴퓨팅 장치는 사전 학습된 제 1 신경망 모델을 이용하여, 테스트의 종류에 관한 정보에 대응되는 복수의 후보 문항들을 획득할 수 있다(S220). 구체적으로, 컴퓨팅 장치는 사전 저장된 복수의 원문항들을 테스트의 종류별로 분류한 복수의 그룹들 중에 서 테스트의 종류에 관한 정보에 대응되는 제 1 그룹을 선택할 수 있다. 컴퓨팅 장치는 제 1 그룹에 대응되는 복수의 후보 문항들을 획득할 수 있다. 제 1 그룹은 키워드에 따라 분류된 복수의 서브 그룹들을 포함할 수 있다. 복수의 후보 문항들은 복수의 서브 그룹들 각각에서 결정된 대표 문항을 포함할 수 있다. 일례로, 대표 문항은 복수의 서브 그룹들 각각에서 최다 빈도 수의 문항일 수 있다. 다 른 예시로, 대표 문항은 복수의 서브 그룹들 각각에 포함된 원문항들의 특징들을 분석하여 재생성된 문항을 의 미할 수도 있다. 컴퓨팅 장치는 사용자의 식별정보가 라벨링된 사전 저장된 복수의 원문항들에 기초하여, 사용자의 식별정 보에 대응되는 적어도 하나의 사전 응답 문항을 획득할 수 있다(S230). 컴퓨팅 장치는 복수의 후보 문항들 중에서 적어도 하나의 사전 응답 문항에 대응되는 문항을 제거하여 최 종 문항을 획득할 수 있다(S240). 컴퓨팅 장치는 제 1 그룹에 대응되는 복수의 후보 문항들 중에서 적어도 하나의 사전 응답 문항에 대응되 는 제 1 서브 그룹의 제 1 대표 문항을 제거하여 최종 문항을 획득할 수 있다. 컴퓨팅 장치는 최종 문항을 포함하는 제 1 문서를 생성하여 외부 기기로 전송할 수 있다(S250). 컴퓨팅 장치는 외부 기기로부터 최종 문항에 대한 답변이 기재된 답변 문서를 수신할 수 있다. 컴퓨팅 장치는 사전 학습된 제 2 신경망 모델을 이용하여, 답변 문서로부터 사용자의 현재 상태를 포함하 는 테스트 결과 정보를 획득할 수 있다. 컴퓨팅 장치는 사용자의 현재 상태가 제 1 질병에 대해서 정상 상태로 식별되는 경우, 테스트 결과 정보를 외부 기기로 전송할 수 있다. 컴퓨팅 장치는 사용자의 현재 상태가 제 1 질병에 대해서 위험 상태로 식별되는 경우, 질병에 관한 정보가 라벨링된 사전 저장된 복수의 원문항들에 대한 정보에 기초하여, 제 1 질병에 대응되는 추가 문항을 획득할 수 있다. 컴퓨팅 장치는 추가 문항을 포함하는 제 2 문서를 생성하여 외부 기기로 전송할 수 있다. 도 2 및 도 3에 도시되는 단계들은 예시적인 단계들이다. 따라서, 본 개시 내용의 사상 범위를 벗어나지 않는 한도에서 도 2 및 도 3의 단계들 중 일부가 생략되거나 추가적인 단계들이 존재할 수 있다는 점 또한 당업자에 게 명백할 것이다. 또한, 도 2 및 도 3에 기재된 구성들(예를 들어, 컴퓨팅 장치, 외부 기기 등)에 관한 구체적인 내용은 앞서 도 1을 통해 설명한 내용으로 대체될 수 있다. 도 1 내지 도 3을 참조하여 전술한 바와 같이, 본 개시의 몇몇 실시예에 따른 컴퓨팅 장치는 사용자가 사 전에 응답했던 문항과 중복되는 문항이 제거된 최종 문항을 사용자에게 제공함으로써, 사용자가 문항에 대해 응 답하는 과정에서 느끼는 피로도를 줄일 수 있다. 컴퓨팅 장치는 유사한 문항들 중에서 대표 문항을 선정하여 사용자에게 제공함으로써, 중복되는 문항으로 인하여 발생되는 사용자의 집중력 저하를 막고, 검사 속도를 높일 수 있다. 컴퓨팅 장치는 사전 학습된 제 2 신경망 모델을 이용하여, 외부 기기로부터 수신한 답변 문서로부터 사용자의 현재 상태를 포함하는 테스트 결과 정보를 획득함으로써, 사용자의 현재 상태를 파악하고 추가 질문을 통해 심리적 질환의 조기 확인 및 악화 예방이 가능할 수 있다. 일 실시예에서, 제 2 신경망 모델은 최종문항에 대한 사용자의 답변을 입력받아 사용자의 테스트 결과(예컨대, 심리 상태)에 대한 정보를 출력하는 인공지능 기반의 모델을 의미할 수 있다. 일례로, 제 2 신경망 모델은 분류 모델을 포함할 수 있다. 제 2 신경망 모델은 원문항들 각각에 대한 가능한 답변들에 대응하는 특정한 답변이 가지는 특정 질병(예컨대, 심리 관련 질환 등)의 가능성을 수치화할 수 있는 모델이다. 사용자의 답변들을 조합하여 제 1 질병에 대한 가 능성, 제 2 질병에 대한 가능성 및 제 3 질병에 대한 가능성을 수치화하여 출력할 수 있다. 여기서의 제 1 질병, 제 2 질병 및 제 3 질병 각각은 제 2 신경망 모델의 클래스에 대응될 수 있다. 컴퓨팅 장치는 테스트 결과 정보를 저장하여 정보를 축적함으로써, 통계적인 활용도를 증가시킬 수 있다. 도 4는 본 개시의 실시예들이 구현될 수 있는 예시적인 컴퓨팅 환경에 대한 간략하고 일반적인 개략도이다. 본 개시가 일반적으로 컴퓨팅 장치에 의해 구현될 수 있는 것으로 전술되었지만, 당업자라면 본 개시가 하나 이 상의 컴퓨터 상에서 실행될 수 있는 컴퓨터 실행가능 명령어 및/또는 기타 프로그램 모듈들과 결합되어 및/또는 하드웨어와 소프트웨어의 조합으로써 구현될 수 있다는 것을 잘 알 것이다. 여기서 컴퓨팅 장치는 본 개시에 따 른 문장을 생성 및 검증하기 위한 방법을 수행할 수 있다. 컴퓨터는 통상적으로 다양한 컴퓨터 판독가능 매체를 포함한다. 컴퓨터에 의해 액세스 가능한 매체는 그 어떤 것이든지 컴퓨터 판독가능 매체가 될 수 있고, 이러한 컴퓨터 판독가능 매체는 휘발성 및 비휘발성 매체, 일시 적(transitory) 및 비일시적(non-transitory) 매체, 이동식 및 비-이동식 매체를 포함한다. 제한이 아닌 예로서, 컴퓨터 판독가능 매체는 컴퓨터 판독가능 저장 매체 및 컴퓨터 판독가능 전송 매체를 포함할 수 있다. 컴퓨터 판독가능 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보를 저장하는 임의의 방법 또는 기술로 구현되는 휘발성 및 비휘발성 매체, 일시적 및 비-일시적 매체, 이동 식 및 비이동식 매체를 포함한다. 컴퓨터 판독가능 저장 매체는 컴퓨터에 의해 액세스될 수 있고 원하는 정보를 저장하는 데 사용될 수 있는 임의의 기타 매체를 포함할 수 있다. 컴퓨터 판독가능 저장 매체는 본 개시에 따라 하나 이상의 프로세서로 하여금 문장을 생성 및 검증하기 위한 방법을 수행하도록 하는 명령을 포함하는 컴퓨터 프로그램을 저장할 수 있다. 컴퓨터 판독가능 전송 매체는 통상적으로 반송파(carrier wave) 또는 기타 전송 메커니즘(transport mechanis m)과 같은 피변조 데이터 신호(modulated data signal)에 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터 등을 구현하고 모든 정보 전달 매체를 포함한다. 컴퓨터를 포함하는 본 개시의 여러가지 측면들을 구현하는 예시적인 환경이 나타내어져 있으며, 컴 퓨터는 처리 장치, 시스템 메모리 및 시스템 버스를 포함한다. 시스템 버스는시스템 메모리(이에 한정되지 않음)를 비롯한 시스템 컴포넌트들을 처리 장치에 연결시킨다. 처리 장치는 다양한 상용 프로세서들 중 임의의 프로세서일 수 있다. 시스템 버스는 메모리 버스, 주변장치 버스, 및 다양한 상용 버스 아키텍처 중 임의의 것을 사용하는 로 컬 버스에 추가적으로 상호 연결될 수 있는 몇 가지 유형의 버스 구조 중 임의의 것일 수 있다. 시스템 메모리 는 판독 전용 메모리(ROM) 및 랜덤 액세스 메모리(RAM)를 포함한다. 기본 입/출력 시스템 (BIOS)은 비휘발성 메모리에 저장되며, 이 BIOS는 시동 중과 같은 때에 컴퓨터 내의 구성요소들 간 에 정보를 전송하는 일을 돕는 기본적인 루틴을 포함한다. 컴퓨터는 또한 내장형 하드 디스크 드라이브(HDD), 자기 플로피 디스크 드라이브(FDD), 및 광 디스크 드라이브를 포함한다. 이들은 각각의 인터페이스(1124, 1126, 1128)에 의해 시스템 버스(110 8)에 연결될 수 있다. 이들 드라이브 및 그와 연관된 컴퓨터 판독가능 매체는 데이터, 데이터 구조, 컴퓨터 실행가능 명령어, 기타 등 등의 비휘발성 저장을 제공한다. 컴퓨터의 경우, 드라이브 및 매체는 임의의 데이터를 적당한 디지털 형 식으로 저장하는 것에 대응한다. 운영 체제, 하나 이상의 애플리케이션 프로그램, 기타 프로그램 모듈 및 프로그램 데이터 를 비롯한 다수의 프로그램 모듈이 드라이브 및 RAM에 저장 및 캐싱될 수 있다. 사용자는 하나 이상의 유선/무선 입력 장치, 예를 들어, 키보드 및 마우스 등의 포인팅 장치를 통 해 컴퓨터에 명령 및 정보를 입력할 수 있다. 이들 및 기타 입력 장치가 종종 시스템 버스에 연결 되어 있는 입력 장치 인터페이스를 통해 처리 장치에 연결되지만, 임의의 다른 인터페이스에 의해 연결될 수 있다. 모니터 또는 다른 유형의 디스플레이 장치도 역시 비디오 어댑터 등의 인터페이스를 통해 시스템 버스에 연결된다. 모니터에 부가하여, 컴퓨터는 일반적으로 스피커, 프린터, 기타 등등의 기타 주 변 출력 장치(도시 생략)를 포함한다. 컴퓨터는 유선 및/또는 무선 통신을 통한 원격 컴퓨터(들) 등의 하나 이상의 원격 컴퓨터로의 논리 적 연결을 사용하여 네트워크화된 환경에서 동작할 수 있다. 원격 컴퓨터(들)는 임의의 통상적인 네트워 크 노드일 수 있으며, 일반적으로 컴퓨터에 대해 기술된 구성요소들 중 다수 또는 그 전부를 포함하지만, 간략함을 위해, 메모리 저장 장치만이 도시되어 있다. 본 개시의 기술 분야에서 통상의 지식을 가진 자는 정보 및 신호들이 임의의 다양한 상이한 기술들 및 기법들을 이용하여 표현될 수 있다는 것을 이해할 것이다. 본 개시의 기술 분야에서 통상의 지식을 가진 자는 여기에 개시된 실시예들과 관련하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 프로세서들, 수단들, 회로들 및 알고리즘 단계들이 전자 하드웨어, (편의를 위해, 여기에 서 소프트웨어로 지칭되는) 다양한 형태들의 프로그램 또는 설계 코드 또는 이들 모두의 결합에 의해 구현될 수 있다는 것을 이해할 것이다. 여기서 제시된 다양한 실시예들은 방법, 장치, 또는 표준 프로그래밍 및/또는 엔지니어링 기술을 사용한 제조 물품(article)으로 구현될 수 있다. 용어 제조 물품은 임의의 컴퓨터-판독가능 저장장치로부터 액세스 가능한 컴퓨터 프로그램, 캐리어, 또는 매체(media)를 포함한다 제시된 실시예들에 대한 다양한 변형들은 본 개시의 기술 분야에서 통상의 지식을 가진 자에게 명백할 것이며, 여기에 정의된 일반적인 원리들은 본 개시의 범위를 벗어남이 없이 다른 실시예들에 적용될 수 있다. 그리하여, 본 개시는 여기에 제시된 실시예들로 한정되는 것이 아니라, 여기에 제시된 원리들 및 신규한 특징들과 일관되 는 최광의의 범위에서 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2022-0074733", "section": "도면", "subsection": "도면설명", "item": 1, "content": "다양한 양상들이 이제 도면들을 참조로 기재되며, 여기서 유사한 참조 번호들은 총괄적으로 유사한 구성요소들 을 지칭하는데 이용된다. 이하의 실시예에서, 설명 목적을 위해, 다수의 특정 세부사항들이 하나 이상의 양상들 의 총체적 이해를 제공하기 위해 제시된다. 그러나, 그러한 양상(들)이 이러한 구체적인 세부사항들 없이 실시 될 수 있음은 명백할 것이다. 도 1은 본 개시의 몇몇 실시예에 따른 사용자를 테스트하기 위한 문서를 생성하기 위한 시스템의 블록 구성도이 다. 도 2는 본 개시의 몇몇 실시예에 따른 시스템에서 사용자를 테스트하기 위한 문서를 생성하는 과정을 나타낸 도 면이다. 도 3은 본 개시의 몇몇 실시예에 따른 컴퓨팅 장치에서 사용자를 테스트하기 위한 문서를 생성하기 위한 방법을 설명하기 위한 도면이다. 도 4는 본 개시의 실시예들이 구현될 수 있는 예시적인 컴퓨팅 환경에 대한 간략하고 일반적인 개략도이다."}
