{"patent_id": "10-2011-0033962", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2012-0116308", "출원번호": "10-2011-0033962", "발명의 명칭": "인터넷망으로 조종하는 유사 지능형 로봇과 통신제어 장치", "출원인": "현대원", "발명자": "손주환"}}
{"patent_id": "10-2011-0033962", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치. 명 세 서기 술 분 야본 발명은 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치에 관한 것이다. [0001]배 경 기 술본 발명은 IP 실시간 화상음성 통신 기술, IP 실시간 로봇 제어조종 기술, 식별체계(바코드, QR코드) 화상 인식 [0002]과 인증 기술, WIFI 데이터 통신과 H/W제어 기술, 고객연계관리(CRM) 데이터베이스, 음성 변환 소프트웨어 필터(로봇음성) 등과 관련된다. 발명의 내용해결하려는 과제상술한 문제점을 해결하기 위하여 본 발명이 해결하고자 하는 과제는, 로봇 조종자가 매장의 종업원이자 고객 [0003]모임의 진행자 역할도 맡을 수 있어, 다양한 엔터테인먼트를 주거나, 인터넷의 검색도구를 이용해 고객이 요구한 실시간 정보를 전달하고자 하는 것이다. 또한, 자동 판매기와 결합한 로봇 인터페이스를 이용하여, 해당 지역의 인포메이션 도우미, 자동판매기, 지식정 [0004]보 척척박사, 장애인의 재택창업 기회제공의 효과를 제공하고자 하는 것이다. 또한, 로봇 콘텐츠 부분을 콜센터 업무같은 대인 통신 서비스에 적용하여, 스마트 휴대폰의 킬러 애플리케이션 [0005]카테고리를 새롭게 만들고자 하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제 [0006]들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다. 과제의 해결 수단전술한 기술적 과제를 달성하기 위한 본 발명은 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치를 포함한 [0007]다. 기타 실시예들의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다. [0008]발명의 효과상기한 바와 같은 본 발명의 실시예에 따른 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치에 의하면, 다 [0009]음과 같은 효과가 하나 이상 존재한다. 첫째, 로봇 조종자가 매장의 종업원이자 고객 모임의 진행자 역할도 맡을 수 있어, 다양한 엔터테인먼트를 주거 [0010]나, 인터넷의 검색도구를 이용해 고객이 요구한 실시간 정보를 전달할 수 있다. 둘째, 자동 판매기와 결합한 로봇 인터페이스를 이용하여, 해당 지역의 인포메이션 도우미, 자동판매기, 지식정 [0011]보 척척박사, 장애인의 재택창업 기회제공의 효과를 제공할 수 있다. 셋째, 로봇 콘텐츠 부분을 콜센터 업무같은 대인 통신 서비스에 적용하여, 스마트 휴대폰의 킬러 애플리케이션 [0012]카테고리를 새롭게 만들 수 있다. 본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 [0013]공개특허 10-2012-0116308-2-기재로부터 당업자에게 명확하게 이해될 수 있을 것이다. 도면의 간단한 설명도 1은 로봇을 원격에서 제어 및 조종하는 애플리케이션을 나타내는 도면이다. [0014]도 2는 로봇의 안면부 비디오/오디오 인터페이스 중 2D 방식의 아바타를 나타내는 도면이다. 도 3은 로봇의 안면부 비디오/오디오 인터페이스 중 3D 방식의 아바타를 나타내는 도면이다.도 4는 고객이 소지한 식별 체계를 인식하고 CRM 데이터 불러오기를 나타내는 도면이다. 도 5는 고객의 주문을 받아 데이터를 작성하고, 해당 점포에 전송하기를 나타내는 도면이다. 도 6은 로봇의 카메라 모듈과 현장의 포토프린터를 원격에서 제어하는 것을 나타내는 도면이다. 도 7은 로봇의 멀티미디어 플레이어를 원격에서 제어하는 것을 나타내는 도면이다. 도 8은 고객과 음성 대화를 기초로 운세 데이터를 전송하는 것을 나타내는 도면이다. 도 9는 본 발명의 제1 실시예에 따른 로봇의 형태를 예시한 도면이다. 도 10은 본 발명의 제2 실시예에 따른 로봇의 형태를 예시한 도면이다.도 11은 본 발명의 제3 실시예에 따른 로봇의 형태를 예시한 도면이다.도 12는 본 발명의 제4 실시예에 따른 로봇의 형태를 예시한 도면이다. 도 13은 본 발명의 실시예에 따른 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치의 전체 구성도이다. 발명을 실시하기 위한 구체적인 내용본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 [0015]예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본발명은 청구항의 범주에 의해 정의될 뿐이다. 또한, 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. [0016]본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 이외의 다른 구성요소의 존재 또는 추가를배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 도 1은 로봇을 원격에서 제어 및 조종하는 애플리케이션을 나타내고 있다. [0017]도 2 및 도 3은 로봇의 안면부 비디오/오디오 인터페이스를 나타내는 도면이다. [0018]고객과 로봇 조종자는 실제 음성 대화를 하지만, 로봇 인터페이스에는 조종자의 그래픽 아바타가 등장한다. 따 [0019]라서 조종자는 미리 지정된 표정 제어 박스를 써서 감정 표현을 합니다. 더 필요할 때는 보조적인 그래픽 도구도 사용한다. 도 4는 고객이 소지한 식별 체계를 인식하고 CRM 데이터 불러오기를 나타내고 있다. [0020]도 5는 고객의 주문을 받아 데이터를 작성하고, 해당 점포에 전송하기를 나타내고 있다. [0021]도 6은 로봇의 카메라 모듈과 현장의 포토프린터를 원격에서 제어하는 것을 나타내고 있다. [0022]도 7은 로봇의 멀티미디어 플레이어를 원격에서 제어를 나타내고 있다. [0023]도 8은 고객과 음성 대화를 기초로 운세 데이터 전송을 나타내고 있다. [0024]도 9는 본 발명의 제1 실시예에 따른 로봇의 형태를 예시하고 있다. [0025]공개특허 10-2012-0116308-3-도 10은 본 발명의 제2 실시예에 따른 로봇의 형태를 예시하고 있다. [0026]도 11은 본 발명의 제3 실시예에 따른 로봇의 형태를 예시하고 있다. [0027]도 12는 본 발명의 제4 실시예에 따른 로봇의 형태를 예시하고 있다. [0028]도 13은 본 발명의 실시예에 따른 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치의 전체 구성도를 나타 [0029]내고 있다. 본 발명의 실시예들에 따르면, 다음과 같은 효과를 얻을 수 있다. [0030]첫째, 사회복지적 효과로서, 장애인이 일반직 고용시장에 진입할 기회를 늘리고, 장애인이 재택에서 창업할 기 [0031]회를 넓혀 줄 수 있다. 독거노인 또는 외출거부증후군 환자의 복지 사업에도 활용할 수 있으며, 신경정신질환계통 환자들한테도 심리 치료 효과를 거둘 수 있다. 둘째, 경제적 효과로서, 다재다능한 지능형 로봇이라는 착시 효과를 빌어, 고객 만족감도 높이고, 소상공인 서 [0032]비스 매장 매출을 늘릴 수 있다. 또한, 가상 현실처럼 비인간 대면이 주는 긍정적 측면의 효과를 살릴 수 있으며, 계속해서 쌓이는 고객의 CRM 데이터를 활용, 맞춤 서비스 품질을 점차 높일 수 있다. 또한, 우리나라 프랜차이즈 산업의 글로벌화를 위한 차별 포인트로 활용할 수 있다. 셋째, 무형의 국가자산 효과로서, IT 인프라 선진국뿐 아니라, CT 인프라 선진국의 면모를 세우는 데도 이바지 [0033]할 수 있으며, 박물관, 상설전시관, 민원센터 같은 공공 기관에도 활용할 수 있다. 한편, 로봇 조종자가 사람이기 때문에 대화능력 면에서 탁월하다고 할 수 있다. 인공 지능 로봇이 흉내낼 수 없 [0034]는 미묘한 감정, 유머, 뉘앙스를 빠르게 처리할 수 있으며, 또한 고차원의 대화나 질문과 응답을 유도하여 고객의 만족감을 높일 수 있다. 이상과 같이 본 발명을 도면에 도시한 실시예를 참고하여 설명하였으나, 이는 발명을 설명하기 위한 것일 뿐이 [0035]며, 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자라면 발명의 상세한 설명으로부터 다양한 변형 또는균등한 실시예가 가능하다는 것을 이해할 수 있을 것이다. 따라서 본 발명의 진정한 권리범위는 특허청구범위의기술적 사상에 의해 결정되어야 한다. 도면도면1공개특허 10-2012-0116308-4-도면2도면3도면4공개특허 10-2012-0116308-5-도면5도면6도면7공개특허 10-2012-0116308-6-도면8도면9도면10공개특허 10-2012-0116308-7-도면11도면12공개특허 10-2012-0116308-8-도면13공개특허 10-2012-0116308-9-"}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치가 제공된다."}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치에 관한 것이다."}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명은 IP 실시간 화상음성 통신 기술, IP 실시간 로봇 제어조종 기술, 식별체계(바코드, QR코드) 화상 인식 과 인증 기술, WIFI 데이터 통신과 H/W제어 기술, 고객연계관리(CRM) 데이터베이스, 음성 변환 소프트웨어 필터 (로봇음성) 등과 관련된다."}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 문제점을 해결하기 위하여 본 발명이 해결하고자 하는 과제는, 로봇 조종자가 매장의 종업원이자 고객 모임의 진행자 역할도 맡을 수 있어, 다양한 엔터테인먼트를 주거나, 인터넷의 검색도구를 이용해 고객이 요구 한 실시간 정보를 전달하고자 하는 것이다. 또한, 자동 판매기와 결합한 로봇 인터페이스를 이용하여, 해당 지역의 인포메이션 도우미, 자동판매기, 지식정 보 척척박사, 장애인의 재택창업 기회제공의 효과를 제공하고자 하는 것이다. 또한, 로봇 콘텐츠 부분을 콜센터 업무같은 대인 통신 서비스에 적용하여, 스마트 휴대폰의 킬러 애플리케이션 카테고리를 새롭게 만들고자 하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제 들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 기술적 과제를 달성하기 위한 본 발명은 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치를 포함한 다. 기타 실시예들의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같은 본 발명의 실시예에 따른 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치에 의하면, 다 음과 같은 효과가 하나 이상 존재한다. 첫째, 로봇 조종자가 매장의 종업원이자 고객 모임의 진행자 역할도 맡을 수 있어, 다양한 엔터테인먼트를 주거 나, 인터넷의 검색도구를 이용해 고객이 요구한 실시간 정보를 전달할 수 있다. 둘째, 자동 판매기와 결합한 로봇 인터페이스를 이용하여, 해당 지역의 인포메이션 도우미, 자동판매기, 지식정 보 척척박사, 장애인의 재택창업 기회제공의 효과를 제공할 수 있다. 셋째, 로봇 콘텐츠 부분을 콜센터 업무같은 대인 통신 서비스에 적용하여, 스마트 휴대폰의 킬러 애플리케이션 카테고리를 새롭게 만들 수 있다."}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 또한, 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한 다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 이외의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본"}
{"patent_id": "10-2011-0033962", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것 이다. 도 1은 로봇을 원격에서 제어 및 조종하는 애플리케이션을 나타내고 있다. 도 2 및 도 3은 로봇의 안면부 비디오/오디오 인터페이스를 나타내는 도면이다. 고객과 로봇 조종자는 실제 음성 대화를 하지만, 로봇 인터페이스에는 조종자의 그래픽 아바타가 등장한다. 따 라서 조종자는 미리 지정된 표정 제어 박스를 써서 감정 표현을 합니다. 더 필요할 때는 보조적인 그래픽 도구 도 사용한다. 도 4는 고객이 소지한 식별 체계를 인식하고 CRM 데이터 불러오기를 나타내고 있다. 도 5는 고객의 주문을 받아 데이터를 작성하고, 해당 점포에 전송하기를 나타내고 있다. 도 6은 로봇의 카메라 모듈과 현장의 포토프린터를 원격에서 제어하는 것을 나타내고 있다. 도 7은 로봇의 멀티미디어 플레이어를 원격에서 제어를 나타내고 있다. 도 8은 고객과 음성 대화를 기초로 운세 데이터 전송을 나타내고 있다. 도 9는 본 발명의 제1 실시예에 따른 로봇의 형태를 예시하고 있다. 도 10은 본 발명의 제2 실시예에 따른 로봇의 형태를 예시하고 있다. 도 11은 본 발명의 제3 실시예에 따른 로봇의 형태를 예시하고 있다. 도 12는 본 발명의 제4 실시예에 따른 로봇의 형태를 예시하고 있다. 도 13은 본 발명의 실시예에 따른 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치의 전체 구성도를 나타 내고 있다. 본 발명의 실시예들에 따르면, 다음과 같은 효과를 얻을 수 있다. 첫째, 사회복지적 효과로서, 장애인이 일반직 고용시장에 진입할 기회를 늘리고, 장애인이 재택에서 창업할 기 회를 넓혀 줄 수 있다. 독거노인 또는 외출거부증후군 환자의 복지 사업에도 활용할 수 있으며, 신경정신질환 계통 환자들한테도 심리 치료 효과를 거둘 수 있다. 둘째, 경제적 효과로서, 다재다능한 지능형 로봇이라는 착시 효과를 빌어, 고객 만족감도 높이고, 소상공인 서 비스 매장 매출을 늘릴 수 있다. 또한, 가상 현실처럼 비인간 대면이 주는 긍정적 측면의 효과를 살릴 수 있으 며, 계속해서 쌓이는 고객의 CRM 데이터를 활용, 맞춤 서비스 품질을 점차 높일 수 있다. 또한, 우리나라 프랜 차이즈 산업의 글로벌화를 위한 차별 포인트로 활용할 수 있다. 셋째, 무형의 국가자산 효과로서, IT 인프라 선진국뿐 아니라, CT 인프라 선진국의 면모를 세우는 데도 이바지 할 수 있으며, 박물관, 상설전시관, 민원센터 같은 공공 기관에도 활용할 수 있다. 한편, 로봇 조종자가 사람이기 때문에 대화능력 면에서 탁월하다고 할 수 있다. 인공 지능 로봇이 흉내낼 수 없 는 미묘한 감정, 유머, 뉘앙스를 빠르게 처리할 수 있으며, 또한 고차원의 대화나 질문과 응답을 유도하여 고객 의 만족감을 높일 수 있다. 이상과 같이 본 발명을 도면에 도시한 실시예를 참고하여 설명하였으나, 이는 발명을 설명하기 위한 것일 뿐이 며, 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자라면 발명의 상세한 설명으로부터 다양한 변형 또는 균등한 실시예가 가능하다는 것을 이해할 수 있을 것이다. 따라서 본 발명의 진정한 권리범위는 특허청구범위의 기술적 사상에 의해 결정되어야 한다."}
{"patent_id": "10-2011-0033962", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 로봇을 원격에서 제어 및 조종하는 애플리케이션을 나타내는 도면이다. 도 2는 로봇의 안면부 비디오/오디오 인터페이스 중 2D 방식의 아바타를 나타내는 도면이다. 도 3은 로봇의 안면부 비디오/오디오 인터페이스 중 3D 방식의 아바타를 나타내는 도면이다. 도 4는 고객이 소지한 식별 체계를 인식하고 CRM 데이터 불러오기를 나타내는 도면이다. 도 5는 고객의 주문을 받아 데이터를 작성하고, 해당 점포에 전송하기를 나타내는 도면이다. 도 6은 로봇의 카메라 모듈과 현장의 포토프린터를 원격에서 제어하는 것을 나타내는 도면이다. 도 7은 로봇의 멀티미디어 플레이어를 원격에서 제어하는 것을 나타내는 도면이다. 도 8은 고객과 음성 대화를 기초로 운세 데이터를 전송하는 것을 나타내는 도면이다. 도 9는 본 발명의 제1 실시예에 따른 로봇의 형태를 예시한 도면이다. 도 10은 본 발명의 제2 실시예에 따른 로봇의 형태를 예시한 도면이다. 도 11은 본 발명의 제3 실시예에 따른 로봇의 형태를 예시한 도면이다. 도 12는 본 발명의 제4 실시예에 따른 로봇의 형태를 예시한 도면이다. 도 13은 본 발명의 실시예에 따른 IP망으로 조종하는 유사 지능형 로봇과 통신제어 장치의 전체 구성도이다."}
