{"patent_id": "10-2009-0079184", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2011-0021402", "출원번호": "10-2009-0079184", "출원인": "최정내", "발명자": "최정내"}}
{"patent_id": "10-2009-0079184", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "분전반이나 부하말단에서 전류 파형을 검출하는 전류파형 검출부;상기 검출된 전류 파형으로부터 트랙킹과 관련된 적어도 하나의 특징점을 검출하는 특징점 검출부; 및학습이 완료된 인공신경망에 상기 검출된 특징점을 대입하여 얻은 출력값에 따라 상기 전류 파형이 검출된 부위에 트랙킹이 발생되었는지 여부를 판단하고, 그 판단결과를 외부로 표시하는 트랙킹 검출부를 포함하되,상기 특징점은 각각 트랙킹 발생시 전류 파형에 나타나는 임펄스 형태의 불규칙한 파형과 관련된 데이터이고,상기 학습은, 트랙킹이 발생되지 않은 경우와 발생된 경우에 대한 복수의 전류 파형으로부터 각각 검출한 상기특징점을 입력으로 하여 트랙킹 발생 여부를 식별하도록 하는 지도학습법(supervised learning)에 의해 이루어지는 것을 특징으로 하는 인공신경망을 이용한 트랙킹 검출장치."}
{"patent_id": "10-2009-0079184", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 학습시 트랙킹 검출부는, PSO 알고리즘을 이용하여 상기 인공신경망의 은닉층 노드 수, 학습률 및 모멘텀계수를 결정하는 것을 특징으로 하는 인공신경망을 이용한 트랙킹 검출장치."}
{"patent_id": "10-2009-0079184", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 특징점은 복수 개이고,상기 학습시 트랙킹 검출부는, PSO 알고리즘을 이용하여 상기 복수의 특징점 중 일부의 특징점을 선택하여 상기인공신경망의 입력으로 하는 것을 특징으로 하는 인공신경망을 이용한 트랙킹 검출장치."}
{"patent_id": "10-2009-0079184", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "분전반이나 부하말단에서 전류 파형을 검출하는 제1단계;상기 제1단계에서 검출된 전류 파형으로부터 트랙킹과 관련된 적어도 하나의 특징점을 검출하는 제2단계; 및상기 제2단계에서 검출된 특징점을 학습이 완료된 인공신경망에 대입하여 얻은 출력값에 따라 상기 전류 파형이검출된 부위에 트랙킹이 발생되었는지 여부를 판단하는 제3단계를 포함하되,상기 특징점은 각각 트랙킹 발생시 전류 파형에 나타나는 임펄스 형태의 불규칙한 파형과 관련된 값이고,상기 학습은, 트랙킹이 발생되지 않은 경우와 발생된 경우에 대한 복수의 전류 파형으로부터 각각 검출한 상기특징점을 입력으로 하여 트랙킹 발생 여부를 식별하도록 하는 지도학습법(supervised learning)에 의해 이루어지는 것을 특징으로 하는 인공신경망을 이용한 트랙킹 검출방법."}
{"patent_id": "10-2009-0079184", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 학습시, PSO 알고리즘을 이용하여 상기 인공신경망의 은닉층 노드 수, 학습률 및 모멘텀 계수를 결정하는것을 특징으로 하는 인공신경망을 이용한 트랙킹 검출방법."}
{"patent_id": "10-2009-0079184", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 특징점은 복수 개이고,상기 학습시, PSO 알고리즘을 이용하여 상기 복수의 특징점 중 일부의 특징점을 선택하여 상기 인공신경망의 입력으로 하는 것을 특징으로 하는 인공신경망을 이용한 트랙킹 검출방법.공개특허 10-2011-0021402-2-명 세 서발명의 상세한 설명 기 술 분 야본 발명은 옥내 배선의 선간 절연불량에 의해 발생되는 트랙킹(tracking) 현상을 검출하기 위한 장치 및 방법에 [0001]관한 것으로, 더욱 상세하게는 트랙킹이 발생하지 않은 경우와 트랙킹이 발생한 경우에 대한 전류 파형의 특성정보를 학습한 결과를 이용하여 분전반 및 부하말단에서 실제로 검출한 전류 파형을 판단함으로써 상기 옥내 배선에 트랙킹 현상이 발생되었는지 여부를 검출하는 인공신경망(neural-network)을 이용한 트랙킹 검출장치 및방법에 관한 것이다. 배 경 기 술일반적으로 전기 수용가의 옥내에 설치되는 전기 배선들은 전선 도체 상호간, 또는 전선 도체와 대지 사이에 흐 [0002]르는 누설전류에 의한 피해를 방지하기 위하여, 절연재질로 이루어진 전선 피복을 이용하여 상기 전선 도체 상호간을 절연시키도록 구성되어 있다.이러한 상기 전선 피복들은 대부분 유기절연재료인 합성수지류로 이루어지는데, 상기 전선 피복들이 여러 가지 [0003]원인에 의하여 변성되거나 손상되어 절연성이 저하될 경우 상기 전선 피복을 따라 누설전류가 흐르게 되는 트랙킹(tracking) 현상이 발생된다.이때, 상기 트랙킹 현상이라 함은 전선 피복의 표면에 수분이나 먼지와 같은 오염물질이 축적되거나 전선이 과 [0004]열됨에 따라 상기 전선 피복을 구성하는 절연재질이 변성되거나 열화되어 전선 도체 사이의 절연성이 불량하게됨으로써, 상기 전선 피복을 통해 누설전류가 흐르게 되는 현상을 의미한다.이와 같이, 전선 피복을 통해 흐르는 누설전류가 서서히 증가될 경우 전선 도체 사이의 절연층이 미소방전에 의 [0005]하여 탄화됨으로써 탄화도전로가 형성되고, 상기 탄화도전로를 따라 누설전류가 더욱 증가하게 될 경우 전선 도체 사이의 절연 파괴와 함께 전선 피복재가 발화하게 되는(트랙킹 화재) 심각한 문제점을 야기하게 된다.한편, 종래 기술에 따른 전기설비의 경우에도 누설전류에 의한 피해를 방지하기 위하여 분전반이나 부하 등에 [0006]배선용 차단기 또는 퓨즈 등의 안전장치를 마련하고 있으나, 상술한 트랙킹 현상에 의해 발생되는 누설전류(수십 내지 수백 mA)의 크기가 상기 안전장치들의 정격전류(수 내지 십수 A)에 비하여 매우 작기 때문에 트랙킹 현상에 의하여 전선 피복재가 발화되더라도 상기 안전장치들이 동작하지 못하게 됨으로써 화재로 이어지는 문제점이 있다.또한, 상기 트랙킹 현상에 의해 발생되는 누설전류는 전술한 바와 같이 그 크기가 매우 미세할 뿐만 아니라 부 [0007]하의 종류 등에 따라 전류 특성이 매우 랜덤하기 때문에, 종래 기술의 경우 각종의 전류센서 및 검출기를 이용하더라도 트랙킹 현상의 발생여부를 정확히 검출할 수 없다는 문제점이 있다. 발명의 내용 해결 하고자하는 과제본 발명은 상술한 종래 기술의 문제점을 해결하기 위한 것으로, 본 발명의 목적은 트랙킹 발생시 나타나는 전류 [0008]파형의 특성 정보를 인공신경망(neural-network)에 미리 학습시킴으로써, 임의의 전류 파형이 입력될 경우 상기전류 파형을 검출한 부분에 트랙킹 현상이 발생되었는지 여부를 상기 인공신경망을 통해 신속하고 정확하게 판단할 수 있는 트랙킹 검출장치 및 방법을 제공하기 위한 것이다.또한, 본 발명의 다른 목적은 최적화 알고리즘을 이용하여 상기 인공신경망의 은닉층 노드 수, 학습률 및 모멘 [0009]텀 계수를 결정하고, 상기 전류 파형의 특성 중 트랙킹 발생 여부의 판단에 영향력이 큰 일부 특성을 선택하여인공신경망의 입력으로 사용함으로써 상기 인공신경망의 추론 능력 및 계산속도를 더욱 향상시킬 수 있는 트랙공개특허 10-2011-0021402-3-킹 검출장치 및 방법을 제공하기 위한 것이다. 과제 해결수단상기와 같은 목적을 달성하기 위해 본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치는 분전반이나 부하말 [0010]단에서 전류 파형을 검출하는 전류파형 검출부, 상기 검출된 전류 파형으로부터 트랙킹과 관련된 적어도 하나의특징점을 검출하는 특징점 검출부, 및 학습이 완료된 인공신경망에 상기 검출된 특징점을 대입하여 얻은 출력값에 따라 상기 전류 파형이 검출된 부위에 트랙킹이 발생되었는지 여부를 판단하고, 그 판단결과를 외부로 표시하는 트랙킹 검출부를 포함하되, 상기 특징점은 각각 트랙킹 발생시 전류 파형에 나타나는 임펄스 형태의 불규칙한 파형과 관련된 데이터이고, 상기 학습은 트랙킹이 발생되지 않은 경우와 발생된 경우에 대한 복수의 전류 파형으로부터 각각 검출한 상기 특징점을 입력으로 하여 트랙킹 발생 여부를 식별하도록 하는 지도학습법(supervised learning)에 의해 이루어지는 것을 특징으로 한다.또한, 상기 학습시 트랙킹 검출부는, PSO 알고리즘을 이용하여 상기 인공신경망의 은닉층 노드 수, 학습률 및 [0011]모멘텀 계수를 결정하는 것을 특징으로 한다.또한, 상기 특징점은 복수 개이고, 상기 학습시 트랙킹 검출부는 PSO 알고리즘을 이용하여 상기 복수의 특징점 [0012]중 일부의 특징점을 선택하여 상기 인공신경망의 입력으로 하는 것을 특징으로 한다.또한, 본 발명에 따른 인공신경망을 이용한 트랙킹 검출방법은 분전반이나 부하말단에서 전류 파형을 검출하는 [0013]제1단계, 상기 제1단계에서 검출된 전류 파형으로부터 트랙킹과 관련된 적어도 하나의 특징점을 검출하는 제2단계, 및 상기 제2단계에서 검출된 특징점을 학습이 완료된 인공신경망에 대입하여 얻은 출력값에 따라 상기 전류파형이 검출된 부위에 트랙킹이 발생되었는지 여부를 판단하는 제3단계를 포함하되, 상기 특징점은 각각 트랙킹발생시 전류 파형에 나타나는 임펄스 형태의 불규칙한 파형과 관련된 값이고, 상기 학습은, 트랙킹이 발생되지않은 경우와 발생된 경우에 대한 복수의 전류 파형으로부터 각각 검출한 상기 특징점을 입력으로 하여 트랙킹발생 여부를 식별하도록 하는 지도학습법(supervised learning)에 의해 이루어지는 것을 특징으로 한다. 효 과이상에서 설명한 바와 같이 본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치 및 방법은 트랙킹 발생시 전 [0014]류 파형에 나타나는 특성 정보(즉, 불규칙한 임펄스 형태의 파형)를 인공신경망에 미리 학습시킨 후, 실제 전류파형의 입력시 상기 인공신경망의 학습 결과에 따라 트랙킹이 발생되었는지 여부를 판단하는 방식이기 때문에,상기 실제 전류 파형에 대한 사전 정보가 없는 경우에도 트랙킹의 발생 여부를 정확하고 신속하게 검출함으로써트랙킹에 의한 피해를 미연에 방지할 수 있다는 장점이 있다. 또한, 본 발명에 따른 트랙킹 검출장치 및 방법은 인공신경망의 학습 및 추론에 필요한 입력 데이터, 은닉층의 [0015]노드 수, 학습률 및 모멘텀 계수 등을 PSO 알고리즘에 의하여 최적화시킴으로써 상기 인공신경망의 추론 능력및 계산속도를 더욱 향상시킬 수 있다는 장점이 있다. 발명의 실시를 위한 구체적인 내용이하에서는 본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치 및 방법의 바람직한 실시예를 첨부한 도면을 [0016]참조하여 상세히 설명하기로 한다.일반적으로 트랙킹이 발생된 경우와 트랙킹이 발생되지 않은 경우에 있어서 부하 말단에서의 전압 파형은 양 경 [0017]우에 있어서 거의 변화가 없으나, 전류 파형의 경우 트랙킹 발생시 임펄스 형태의 불규칙한 피크가 나타난다는특징이 있다.이를 구체적으로 살펴보면, 트랙킹이 발생되지 않은 경우에는 도1a에 도시한 바와 같이 정상적인 사인파 형태의 [0018]전류 파형이 나타나게 되나, 트랙킹이 발생된 경우에는 도1b 내지 도1d에 도시한 바와 같이 파형의 극점 부근에서 임펄스 형태의 파형이 불규칙하게 나타난다.공개특허 10-2011-0021402-4-또한, 상기와 같은 변형된 형태의 전류 파형은 부하의 종류 및 트랙킹의 진행과정에 따라 여러 가지 다양한 패 [0019]턴으로 나타날 수 있다.본 발명은 트랙킹 발생 여부에 따른 상기 전류 파형의 차이점을 이용하는 것으로, 분전반이나 부하말단에서 검 [0020]출한 전류 파형만을 이용하여 트랙킹 발생 여부를 정확하고 신속하게 판단하기 위한 것이다.도2는 본 발명의 일실시예에 따른 인공신경망을 이용한 트랙킹 검출장치의 구성을 나타낸 블록도이다. [0021]도2의 트랙킹 검출장치는 분전반이나 부하말단에서의 전류 파형을 검출하는 전류파형 검출부(10), 상기 검출된 [0022]전류 파형으로부터 특징점을 검출하는 특징점 검출부(20), 및 상기 검출된 특징점을 이용하여 트랙킹이 발생되었는지 여부를 판단하는 트랙킹 검출부(30)를 포함하여 구성된다.상기 전류파형 검출부(10)는 분전반이나 부하말단에서 전류 파형을 입력받는 부분으로서, 변류기(current [0023]transformer, CT)(11)와 DA 컨버터(12)를 이용하여 전류 파형에 대한 데이터를 입력받도록 구성된다.이때, 샘플링 주기 및 이에 따른 데이터 개수는 필요에 따라 다르게 설정될 수 있으나, 본 발명에서는 일예로 [0024]서 1초 간격으로 50kHz/s의 샘플링 주기로 50000개의 데이터를 입력받는 것으로 구성하였다.한편, 상기 특징점 검출부(20)는 전류파형 검출부(10)에서 입력된 50000개의 샘플링 데이터로부터 트랙킹 발생 [0025]여부를 판단하기 위해 필요한 특징점들을 검출하게 되는데, 본 발명에서는 상기 특징점 검출부(20)가 데이터 연산기(21), 데이터 필터링기(22), FFT 변환기(23) 및 Wavelet 변환기(24)를 포함하도록 구성하여 <특징점 1> 내지 <특징점 12>의 12개의 특징점을 검출하도록 하였다.상기 <특징점 1> 내지 <특징점 12> 각각의 구체적인 내용 및 의미는 다음과 같다. [0026]<특징점 1> RMS_o : 이는 상기 데이터 연산기(21)를 이용하여 상기 검출된 전류 파형의 실효값을 연산한 [0027]값으로, 후술하는 RMS_f와의 대비를 통하여 트랙킹이 발생되었는지 여부를 판단하기 위해 필요한 특징점이다.<특징점 2> High_peak : 이는 상기 데이터 연산기(21)를 이용하여 상기 검출된 전류 파형의 최대값을 구한 값으 [0028]로, 상기 검출된 전류 파형의 상위 피크에 트랙킹 발생시 나타나는 임펄스 형태의 파형이 나타났는지 여부를 판단하기 위해 필요한 특징점이다.<특징점 3> Low_peak : 이는 상기 데이터 연산기(21)를 이용하여 상기 검출된 전류 파형의 최소값을 구한 값으 [0029]로, 상기 검출된 전류 파형의 하위 피크에 트랙킹 발생시 나타나는 임펄스 형태의 파형이 나타났는지 여부를 판단하기 위해 필요한 특징점이다.<특징점 4> RMS_f : 이는 상기 데이터 필터링기(22) 및 데이터 연산기(21)를 이용하여 얻어지는 값으로, 상기 [0030]검출된 전류 파형에 65Hz의 차단주파수를 가지는 버터워스(butterworth) 저역통과 필터를 적용한 후 실효값을연산한 값이다.이는 상기 입력된 전류 파형에서 트랙킹에 의해 발생된 고주파수의 전류 신호를 제거하기 위한 것으로, 상기 [0031]RMS_o와 대비하여 트랙킹 발생여부를 판단하기 위해 필요한 특징점이다.<특징점 5> 첨도(Kurtosis) : 이는 상기 데이터 연산기(21)를 이용하여 입력된 전류 파형의 첨도를 연산하여 얻 [0032]어지는 값으로, 상기 입력된 전류 파형에 트랙킹 발생시 나타나는 임펄스 형태의 파형이 나타났는지 여부를 판단하기 위해 필요한 특징점이다.<특징점 6> 비대칭도(Skewness) : 이는 상기 데이터 연산기(21)를 이용하여 입력된 전류 파형의 비대칭도를 연 [0033]산하여 얻어지는 값으로, 트랙킹 발생시 정현파형의 전류 파형이 찌그러지는 현상을 이용하여 트랙킹이 발생되었는지 여부를 판단하기 위해 필요한 특징점이다.<특징점 7> 스펙트럼 크기의 평균 : 이는 상기 데이터 필터링기(22) 및 FFT 변환기(23)를 이용하여 얻어지는 값 [0034]으로, 상기 검출된 전류 파형에 1kHz의 차단주파수를 가지는 고역통과 필터를 적용한 후 FFT 변환하여 크기의평균값을 구한 것이다.상기 스펙트럼 크기의 평균은 트랙킹 발생시 나타나는 임펄스 형태의 파형이 고주파수임을 이용한 것으로, 트랙 [0035]공개특허 10-2011-0021402-5-킹에 의해 생성된 파형을 추출하여 트랙킹이 발생되었는지 여부를 판단하기 위해 필요한 특징점이다. <특징점 8> 스펙트럼 크기의 표준편차 : 이는 상기 데이터 필터링기(22) 및 FFT 변환기(23)를 이용하여 얻어지 [0036]는 값으로, 상기 검출된 전류 파형에 1kHz의 차단주파수를 가지는 고역통과 필터를 적용한 후 FFT 변환하여 크기의 표준편차값을 구한 것이다.상기 스펙트럼 크기의 표준편차값도 트랙킹 발생시 나타나는 임펄스 형태의 파형이 고주파수임을 이용한 것으로 [0037]트랙킹에 의해 생성된 파형을 추출한 후, 상기 스펙트럼 크기의 평균과 함께 트랙킹에 의해 생성된 파형이 불규칙한지 여부를 판단하기 위해 필요한 특징점이다. <특징점 9> High_peak 평균 : 이는 상기 Wavelet 변환기(24)를 이용하여 얻어지는 값으로, 트랙킹 발생시 전류 [0038]파형의 상위 피크와 하위 피크에서 임펄스 형태의 파형이 불규칙하게 발생되는 현상을 이용한 것이다.즉, Wavelet을 이용하여 샘플링 시간(1초) 동안 나타나는 60개의 상위 피크와 하위 피크 중 상위 피크들을 찾은 [0039]후 상기 상위 피크값들을 평균하여 얻어지는 값으로서, 후술하는 High_peak 표준편차와 함께 상기 입력된 전류파형 일부에 트랙킹에 의한 임펄스 형태의 파형이 불규칙하게 포함되었는지 여부를 판단하기 위해 필요한 특징점이다.<특징점 10> High_peak 표준편차 : 이는 상기 Wavelet 변환기(24)를 이용하여 얻어지는 값으로, 트랙킹 발생시 [0040]전류 파형의 상위 피크와 하위 피크에서 임펄스 형태의 파형이 불규칙하게 발생되는 현상을 이용한 것이다.즉, Wavelet을 이용하여 샘플링 시간(1초) 동안 나타나는 60개의 상위 피크와 하위 피크 중 상위 피크들을 찾은 [0041]후, 상기 상위 피크값들의 표준편차를 구한 값으로 전술한 High_peak 평균과 함께 상기 입력된 전류 파형 일부에 트랙킹에 의한 임펄스 형태의 파형이 불규칙하게 포함되었는지 여부를 판단하기 위해 필요한 특징점이다.<특징점 11> Low_peak 평균 : 이는 상기 Wavelet 변환기(24)를 이용하여 얻어지는 값으로, 트랙킹 발생시 전류 [0042]파형의 상위 피크와 하위 피크에서 임펄스 형태의 파형이 불규칙하게 발생되는 현상을 이용한 것이다.즉, Wavelet을 이용하여 샘플링 시간(1초) 동안 나타나는 60개의 상위 피크와 하위 피크 중 하위 피크들을 찾은 [0043]후, 상기 하위 피크값들을 평균하여 얻어지는 값으로 후술하는 Low_peak 표준편차와 함께 상기 입력된 전류 파형 일부에 트랙킹에 의한 임펄스 형태의 파형이 불규칙하게 포함되었는지 여부를 판단하기 위해 필요한 특징점이다.<특징점 12> Low_peak 표준편차 : 이는 상기 Wavelet 변환기(24)를 이용하여 얻어지는 값으로, 트랙킹 발생시 [0044]전류 파형의 상위 피크와 하위 피크에서 임펄스 형태의 파형이 불규칙하게 발생되는 현상을 이용한 것이다.즉, Wavelet을 이용하여 샘플링 시간(1초) 동안 나타나는 60개의 상위 피크와 하위 피크 중 하위 피크들을 찾은 [0045]후, 상기 하위 피크값들의 표준편차를 구한 값으로 전술한 Low_peak 평균과 함께 상기 입력된 전류 파형 일부에트랙킹에 의한 임펄스 형태의 파형이 불규칙하게 포함되었는지 여부를 판단하기 위해 필요한 특징점이다.다음으로, 상기 트랙킹 검출부(30)는 특징점 검출부(20)에서 입력되는 12개의 특징점들을 이용하여 상기 전류 [0046]파형을 검출한 선로에 트랙킹이 발생되었는지 여부를 판단하는 제어부(31), 상기 제어부(31)가 트랙킹 발생 여부를 판단하기 위한 알고리즘과 상기 알고리즘의 사전 수행결과에 관한 정보 등이 미리 저장되어 있는 메모리(32), 및 트랙킹 발생시 상기 제어부(31)의 제어신호에 의해 이를 외부로 표시하는 표시부(33)를 포함하여 구성된다.본 발명에서 상기 제어부(31)는 트랙킹 발생 여부를 판단하는 추론엔진으로서 인공신경망을 사용하며, 상기 인 [0047]공신경망의 최적화를 위하여 PSO(Particle Swarm Optimization) 알고리즘을 사용하는 것을 특징으로 한다.일반적으로 인공신경망은 인간의 신경계에서 정보가 전달되는 과정을 모방한 지능형 알고리즘으로서 도3에 도시 [0048]한 바와 같이 각각 다수 개의 노드로 이루어진 입력층, 은닉층 및 출력층으로 크게 구성되며, 학습이 가능하다는 장점 때문에 패턴 인식분야에 많이 사용된다.상기와 같이 구성되는 인공신경망의 학습방법은 입력된 데이터의 패턴 분류와 예측에 유용한 지도학습법 [0049](supervised learning)과, 입력된 데이터의 군집화와 분리에 유용한 자율학습법(unsupervised learning)으로크게 분류된다.본 발명에서는 트랙킹 발생 여부를 판단하기 위한 학습방법으로서 입력에 대한 출력값을 알고 있는 상태에서 학 [0050]공개특허 10-2011-0021402-6-습을 진행하는 상기 지도학습법을 사용하였으며, 학습 알고리즘으로는 입력층에서 출력층의 방향으로 입력 데이터를 전파하여 출력값을 얻은 후, 상기 출력값과 목표값 사이의 오차를 출력층에서 입력층의 방향으로 전파하여각 층 노드 사이의 연결가중치를 변화시켜 오차를 줄여나가는 오류 역전파 알고리즘(back propagationalgorithm)을 사용하였다.이러한 인공신경망에서의 학습방법을 구체적으로 살펴보면, 먼저 제1단계에서는 입력층과 은닉층 사이, 은닉층 [0051]과 출력층 사이의 연결가중치들을 랜덤함수를 이용하여 초기화한다.다음으로 제2단계에서는 입력층에 입력된 입력 데이터에 대하여 출력층의 방향으로 전방향 전파(forward [0052]propagation)를 수행한다. 이때, 입력층에서는 입력된 데이터를 그대로 출력하고, 은닉층에서는 [수식 1]에서 알 수 있는 바와 같이 입력 [0053]층의 출력값에 입력층과 은닉층의 각 노드 사이의 연결가중치를 곱한 값의 합을 은닉층의 입력으로 한다.[0054]여기에서, netj는 뉴런 j(은닉층)의 입력값, oi는 뉴런 i(입력층)의 활성값, wji는 뉴런 i와 j 사이의 연결가중 [0055]치 및 θj는 뉴런 j의 문턱값이다. 상기 은닉층에서는 [수식 1]에서 얻은 입력값을 활성함수에 취하여 출력하게 되는데, 상기 은닉층의 활성함수로 [0056]는 [수식 2]와 같은 시그모이드(Sigmoid) 함수를 사용한다.[0057]여기에서, oj는 뉴런 j(은닉층)의 활성값이다. [0058]이와 유사하게, 출력층에서는 [수식 1]과 같이 은닉층의 출력값(즉, 활성값)에 은닉층과 출력층의 각 노드 사이 [0059]의 연결가중치를 곱한 값의 합을 출력층의 입력으로 하고, 상기 입력값을 [수식 2] 형태의 활성함수에 취하여인공신경망의 최종 출력값을 계산한다.다음으로, 제3단계에서는 상기 최종 출력값과 목표값을 비교하여 오차를 계산하며, 상기 오차가 적정 범위 이내 [0060]이면 학습을 중단하고 그렇지 않으면 출력층에서 입력층의 방향으로 일반화된 델타 규칙에 따른 역전파 알고리즘을 수행하여 연결가중치를 조절한 후, 새로운 입력 패턴을 이용하여 상기 오차가 적정 수준이 될 때까지 상기과정을 반복하게 된다.이때, 일반화된 델타 규칙을 이용한 오류 역전파 알고리즘은 널리 알려진 것이기 때문에 여기에서는 상세한 설 [0061]명을 생략한다.한편, 상기 제어부(31)가 실제 입력되는 데이터를 이용하여 트랙킹 발생 여부를 판단하기 위해서는, 먼저 상술 [0062]한 바와 같이 목표값(즉, 본 발명에서는 트랙킹 발생여부에 대응되는 값)을 알고 있는 복수의 실험데이터(즉,본 발명에서는 전류 파형에서 추출한 12개의 특징점)를 이용한 학습이 선행적으로 이루어진 후 그 학습 결과에따라 결정된 연결가중치 정보들이 메모리(32)에 저장되어져야 한다.이를 위하여, 본 발명에서는 트랙킹이 발생한 경우와 발생하지 않은 경우에 대한 1000개의 실험적인 전류 파형 [0063]으로부터 추출한 1000개의 특징점 데이터 쌍을 이용하여 학습을 수행하였는데, 상기 학습용 데이터는 메모리(32)에 미리 저장되어 있는 것이 바람직하다.이때, 인공신경망의 학습을 위해서 은닉층에서의 노드 수, 모멘텀 계수 및 학습률을 미리 결정하여야 하는데, [0064]동일한 학습 데이터를 사용하여 학습을 하는 경우에도 상기 값들을 어떻게 설정하느냐에 따라 인공신경망의 학습 성능 및 그에 따른 추론 능력이 영향을 받게 되기 때문에 상기 값들을 최적으로 설정할 필요성이 있다.또한, 트랙킹 발생 여부를 판단함에 있어서 상술한 12개의 특징점을 전부 입력 데이터로 사용할 수도 있으나, [0065]인공신경망의 추론 성능과 계산속도를 향상시키기 위하여 이들 중 판단에 영향을 미치는 특징점만을 선택하여입력 데이터로 사용할 필요성도 있다.공개특허 10-2011-0021402-7-따라서, 본 발명에서는 이를 위하여 제어부(31)가 메모리(32)에 미리 저장된 전술한 PSO 알고리즘을 이용하여 [0066]트랙킹 발생 여부 판단에 사용할 특징점의 선택, 은닉층의 노드 수, 학습률 및 모멘텀 계수 등을 최적화하는 과정을 수행한다. 상기 PSO (Particle Swarm Optimization) 알고리즘은 새, 벌 등의 군집 생활을 하는 생물체들의 이동 모습과 [0067]그 원리를 모방한 최적화 알고리즘이다. 이때, 군집을 swarm이라 하며, 군집 내의 각 개체를 particle이라한다. 상기 PSO 알고리즘에서 각 particle은 찾고자 하는 해의 위치정보를 의미하며, 이 위치를 이동시키면서 최적의 [0068]위치를 찾아간다. 각 particle 위치의 이동은 swarm 내의 가장 우수한 particle에 대한 위치와, 각 particle의자취 중에서 가장 우수했던 위치정보를 사용하여 각 particle이 이동할 방향과 속도를 계산하여 새로운 위치를결정해 간다. 상기 트랙킹 발생 여부의 판단에 사용할 특징점의 선택, 은닉층의 노드수, 학습률, 및 모멘텀 계수를 최적화하 [0069]기 위해 본 발명에서 사용한 PSO 알고리즘의 적용방법과 최적화 과정은 다음의 5단계로 수행되며, 이때 사용되는 PSO 알고리즘에서의 particle은 [표 1]에 나타낸 바와 같이 16개의 요소로 구성된다.[0070][표 1] PSO에서 particle의 구성 [0071][제1단계] : 초기화 단계 [0072][단계 1-1] n개의 particle을 탐색공간 내에서 랜덤하게 생성하여 초기 swarm을 형성한다. 본 발명에서는 n=50 [0073]으로 설정하고, 각 환산계수의 탐색공간을 [-10, 10]으로 설정하였다. 즉, [-10, 10]의 범위에서 랜덤하게 50개의 particle을 생성하였다.[단계 1-2] 초기 particle의 속도를 [-vjmax, vjmax] 내에서 랜덤하게 생성한다. 이때, vjmax는 particle의 j번째 [0074]요소의 최대 이동속도를 의미하며 탐색범위의 20%로 설정한다. [단계 1-3] 초기 swarm의 각 particle을 퍼지제어기에 적용하여 평가하여 평가지수를 구하여 pbest로 설정한다. [0075]본 발명에서는 평가지수로서 [수식 3]처럼 정의되는 Mean squared error (MSE)를 사용하였다.[0076]여기서, m은 데이터 수, yi는 실제 출력, yi*는 인공신경망의 출력이다. [0077][단계 1-4] 초기 particle의 평가지수 중 최적값을 찾아 gbest로 선정한다. [0078][제2단계] : 관성하중과 속도보정 [0079][단계 2-1] 다음으로 아래의 [수식 4]를 이용하여 관성하중 값을 계산한다. 여기서, t는 반복횟수를 의미하고, [0080]wmax = 0.9, wmin = 0.4로 설정하였으며, maxgen은 PSO 알고리즘에서 최대 반복회수를 의미하는 것으로 본 발명에서는 150으로 설정하였다.[0081]공개특허 10-2011-0021402-8-[단계 2-2] 다음으로, 아래의 [수식 5]를 이용하여 각 particle의 속도를 계산한다. [0082][0083]여기서, vjk(t)는 t번째 반복에서 k번째 particle의 j번째 요소에 대한 속도를 의미하며, c1, c2는 임의의 상수 [0084]로써 각각 2.0을 사용하였다. 또한, r1과 r2은 0 ~ 1 사이의 값으로서 [수식 5]를 계산할 때마다 매번 랜덤한 값을 발생시켜 사용하였으며, xjk는 k번째 particle의 j번째 요소의 값이다. 상기 [수식 5]은 particle이 이동할 방향과 속도의 변화량을 결정하는 식으로서, 각 particle의 이동경로에서 [0085]가장 우수했던 위치인 pbest와 가장 우수한 particle의 위치인 gbest의 값을 적용한다.[제3단계] : 각 particle의 새로운 위치 결정 [0086]상기 [제2단계]가 완료되면, 아래의 [수식 6]을 이용하여 각 particle의 새로운 위치를 결정한다. vjk(t)는 상기 [0087][단계 2-2]로부터 계산된 속도이며, 현재의 particle에 이 값을 더한다. 이때 새로 계산되는 xjk(t+1)의 각 요소가 탐색범위 [-10, 10]을 벗어날 경우 탐색범위의 상한값이나 하한값으로 수정한다.[0088][제4단계] particle의 평가 및 pbest, gbest 갱신 [0089][단계 4-1] 상기 [단계 1-3]과 같은 방법으로 위치가 갱신된 각 particle들에 대하여 평가를 수행하여 평가지수 [0090]를 구한다.[단계 4-2] 상기 [단계4-1]에서 얻은 평가지수를 이용하여 각 particle의 pbest를 갱신한다. [0091]이때, 각 particle의 평가지수를 이전 pbest와 비교하여, 이전의 pbest의 평가지수가 새로운 particle의 평가지 [0092]수보다 클 경우 새로운 particle을 pbest로 재설정한다.[단계 4-3] pbest의 particle 중 가장 우수한 particle의 평가지수와 gbest의 평가지수를 비교하여 더 적은 평 [0093]가지수를 가질 경우 gbest를 재설정한다.[제5단계] 종료 평가 [0094]종료조건, 즉 t>magent일 경우 프로그램을 종료하고 그렇지 않으면, 상기 [제2단계]부터 [제4단계]의 과정을 반 [0095]복한다. 상기 PSO 알고리즘의 수행이 종료되면, 최종적으로 생성된 gbest는 최적의 위치정보를 갖게 된다.상기와 같은 PSO 알고리즘의 수행과정에 따라서 제어부(31)는 특징점의 종류, 은닉층의 노드 수, 학습률 및 모 [0096]멘텀 계수를 변화시켜가면서 가장 좋은 학습결과를 보이는 최적값을 얻을 수 있게 된다.본 실시예에서는 트랙킹의 발생 여부를 판단하기 위한 인공신경망의 설계를 위하여 특징점의 수를 2개 내지 5개 [0097]를 사용하는 경우에 있어서 상술한 PSO 알고리즘을 직접 적용함으로써 아래의 [표 2]와 같은 결과를 얻을 수 있었다.이때, 선택된 데이터 번호라 함은 전술한 특징점 각각의 번호를 의미하는 것으로서, 예를 들어 특징점을 2개 사 [0098]용하는 경우에 선택된 데이터 번호 3과 6은 각각 <특징점 3>인 Low_peak와 특징점 6인 비대칭도를 의미한다.공개특허 10-2011-0021402-9-[0099]<표 2> PSO 알고리즘의 실제 수행결과 [0100]상기 <표 2>의 결과에서 알 수 있는 바와 같이 본 발명에 따른 트랙킹 검출방법을 적용할 경우 입력된 전류 파 [0101]형에서 추출된 12개의 특징점 중 4개의 특징점(즉, <특징점 1>, <특징점 2>, <특징점 3> 및 <특징점 6>)을 인공신경망의 입력으로 하고, 은닉층의 노드 수는 9개, 학습률은 0.0102, 그리고 모멘텀 계수는 00327로 설정하여학습할 경우에 학습능력과 실제 데이터에 대한 추론능력이 가장 우수하게 나타나는 것으로 평가되었다.한편, 제어부(31)는 상기 과정에 의하여 입력으로 사용될 특징점의 종류, 은닉층의 노드 수, 학습률 및 모멘텀 [0102]계수가 최적으로 결정되면, 이들 최적화된 값들을 이용하여 오류 역전파 알고리즘에 의해 인공신경망의 각 노드사이의 연결가중치를 학습에 의해 결정하게 된다.이때, 상기 인공신경망의 학습과정에 있어서 본 실시예에서는 트랙킹이 발생된 데이터에 대해서는 목표값을 -1 [0103]로 설정하고, 정상상태의 데이터에 대해서는 목표값을 1로 설정하여 연결가중치를 학습하였다.상술한 바와 같이 인공신경망의 연결가중치가 일단 학습이 완료되어 메모리(32)에 저장되고 나면, 상기 특징점 [0104]검출부(20)로부터 실제 입력 데이터가 입력될 경우 제어부(31)는 학습된 연결가중치가 적용된 인공신경망 알고리즘의 출력값을 이용하여 상기 입력된 실제 데이터가 트랙킹이 발생되었는지 여부를 판단하게 된다.이때, 제어부(31)는 인공신경망 알고리즘의 출력값이 0보다 큰 경우이면 트랙킹이 발생되지 않은 정상 상태의 [0105]전류 파형이라고 판단하고, 상기 인공신경망 알고리즘의 출력값이 0이거나 0보다 작을 경우에는 트랙킹이 발생되었다고 판단하게 된다.한편, 상기 제어부(31)는 이러한 판단결과를 표시하기 위한 제어신호를 상기 표시부(33)에 전달하여 트랙킹 발 [0106]생 여부를 감시자가 신속하고 정확하게 인식할 수 있도록 한다.따라서, 본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치 및 방법은 실제 입력되는 전류 파형을 실시간으 [0107]로 판단하여 트랙킹 발생 여부를 검출함으로써 상기 트랙킹에 의한 피해를 미연에 방지할 수 있다는 장점이 있다.이때, 상기 표시부(33)는 디스플레이 장치, 경보등 장치 또는 경보음 장치 등 감시자가 제어부(31)의 판단결과 [0108]를 인식할 수 있도록 하는 다양한 방식의 표시장치들에 의해서 바람직하게 구현될 수 있다. 도면의 간단한 설명도1a 내지 도1d는 옥내 배선에서 트랙킹이 발생되지 않은 경우와 발생된 경우에 있어서의 여러 가지 유형의 전 [0109]류 파형을 나타낸 도면,도2는 본 발명의 일실시예에 따른 인공신경망을 이용한 트랙킹 검출장치의 구성을 나타낸 블럭도, 및 [0110]도3은 본 발명의 일실시예에 따른 인공신경망을 이용한 트랙킹 검출장치에 사용된 인공신경망의 구성을 나타낸 [0111]도면이다.공개특허 10-2011-0021402-10-도면 도면1a 도면1b 도면1c 도면1d공개특허 10-2011-0021402-11- 도면2 도면3공개특허 10-2011-0021402-12-"}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치는 분전반이나 부하말단에서 전류 파형을 검출하는 전류파 형 검출부, 상기 검출된 전류 파형으로부터 트랙킹과 관련된 적어도 하나의 특징점을 검출하는 특징점 검출부, 및 학습이 완료된 인공신경망에 상기 검출된 특징점을 대입하여 얻은 출력값에 따라 상기 전류 파형이 검출된 부위에 트랙킹이 발생되었는지 여부를 판단하고, 그 판단결과를 외부로 표시하는 트랙킹 검출부를 포함하되, 상 기 특징점은 각각 트랙킹 발생시 전류 파형에 나타나는 임펄스 형태의 불규칙한 파형과 관련된 데이터이고, 상기 학습은 트랙킹이 발생되지 않은 경우와 발생된 경우에 대한 복수의 전류 파형으로부터 각각 검출한 상기 특징점 을 입력으로 하여 트랙킹 발생 여부를 식별하도록 하는 지도학습법(supervised learning)에 의해 이루어지는 것 을 특징으로 한다. 본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치 및 방법은 트랙킹 발생시 전류 파형에 나타나는 특성 정보 (즉, 불규칙한 임펄스 형태의 파형)를 인공신경망에 미리 학습시킨 후, 실제 전류 파형의 입력시 상기 인공신경 망이 학습 결과에 따라 트랙킹이 발생되었는지 여부를 판단하는 방식이기 때문에, 상기 실제 입력 데이터에 대한 사전 정보가 없는 경우에도 트랙킹의 발생 여부를 정확하고 신속하게 검출함으로써 트랙킹에 의한 피해를 미연에 방지할 수 있다는 장점이 있다."}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 옥내 배선의 선간 절연불량에 의해 발생되는 트랙킹(tracking) 현상을 검출하기 위한 장치 및 방법에 관한 것으로, 더욱 상세하게는 트랙킹이 발생하지 않은 경우와 트랙킹이 발생한 경우에 대한 전류 파형의 특성 정보를 학습한 결과를 이용하여 분전반 및 부하말단에서 실제로 검출한 전류 파형을 판단함으로써 상기 옥내 배 선에 트랙킹 현상이 발생되었는지 여부를 검출하는 인공신경망(neural-network)을 이용한 트랙킹 검출장치 및 방법에 관한 것이다."}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 전기 수용가의 옥내에 설치되는 전기 배선들은 전선 도체 상호간, 또는 전선 도체와 대지 사이에 흐 르는 누설전류에 의한 피해를 방지하기 위하여, 절연재질로 이루어진 전선 피복을 이용하여 상기 전선 도체 상 호간을 절연시키도록 구성되어 있다. 이러한 상기 전선 피복들은 대부분 유기절연재료인 합성수지류로 이루어지는데, 상기 전선 피복들이 여러 가지 원인에 의하여 변성되거나 손상되어 절연성이 저하될 경우 상기 전선 피복을 따라 누설전류가 흐르게 되는 트랙 킹(tracking) 현상이 발생된다. 이때, 상기 트랙킹 현상이라 함은 전선 피복의 표면에 수분이나 먼지와 같은 오염물질이 축적되거나 전선이 과 열됨에 따라 상기 전선 피복을 구성하는 절연재질이 변성되거나 열화되어 전선 도체 사이의 절연성이 불량하게 됨으로써, 상기 전선 피복을 통해 누설전류가 흐르게 되는 현상을 의미한다. 이와 같이, 전선 피복을 통해 흐르는 누설전류가 서서히 증가될 경우 전선 도체 사이의 절연층이 미소방전에 의 하여 탄화됨으로써 탄화도전로가 형성되고, 상기 탄화도전로를 따라 누설전류가 더욱 증가하게 될 경우 전선 도 체 사이의 절연 파괴와 함께 전선 피복재가 발화하게 되는(트랙킹 화재) 심각한 문제점을 야기하게 된다. 한편, 종래 기술에 따른 전기설비의 경우에도 누설전류에 의한 피해를 방지하기 위하여 분전반이나 부하 등에 배선용 차단기 또는 퓨즈 등의 안전장치를 마련하고 있으나, 상술한 트랙킹 현상에 의해 발생되는 누설전류(수 십 내지 수백 mA)의 크기가 상기 안전장치들의 정격전류(수 내지 십수 A)에 비하여 매우 작기 때문에 트랙킹 현 상에 의하여 전선 피복재가 발화되더라도 상기 안전장치들이 동작하지 못하게 됨으로써 화재로 이어지는 문제점 이 있다. 또한, 상기 트랙킹 현상에 의해 발생되는 누설전류는 전술한 바와 같이 그 크기가 매우 미세할 뿐만 아니라 부 하의 종류 등에 따라 전류 특성이 매우 랜덤하기 때문에, 종래 기술의 경우 각종의 전류센서 및 검출기를 이용 하더라도 트랙킹 현상의 발생여부를 정확히 검출할 수 없다는 문제점이 있다."}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용 해결 하고자하는 과제 본 발명은 상술한 종래 기술의 문제점을 해결하기 위한 것으로, 본 발명의 목적은 트랙킹 발생시 나타나는 전류 파형의 특성 정보를 인공신경망(neural-network)에 미리 학습시킴으로써, 임의의 전류 파형이 입력될 경우 상기 전류 파형을 검출한 부분에 트랙킹 현상이 발생되었는지 여부를 상기 인공신경망을 통해 신속하고 정확하게 판 단할 수 있는 트랙킹 검출장치 및 방법을 제공하기 위한 것이다. 또한, 본 발명의 다른 목적은 최적화 알고리즘을 이용하여 상기 인공신경망의 은닉층 노드 수, 학습률 및 모멘 텀 계수를 결정하고, 상기 전류 파형의 특성 중 트랙킹 발생 여부의 판단에 영향력이 큰 일부 특성을 선택하여 인공신경망의 입력으로 사용함으로써 상기 인공신경망의 추론 능력 및 계산속도를 더욱 향상시킬 수 있는 트랙킹 검출장치 및 방법을 제공하기 위한 것이다. 과제 해결수단 상기와 같은 목적을 달성하기 위해 본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치는 분전반이나 부하말 단에서 전류 파형을 검출하는 전류파형 검출부, 상기 검출된 전류 파형으로부터 트랙킹과 관련된 적어도 하나의 특징점을 검출하는 특징점 검출부, 및 학습이 완료된 인공신경망에 상기 검출된 특징점을 대입하여 얻은 출력 값에 따라 상기 전류 파형이 검출된 부위에 트랙킹이 발생되었는지 여부를 판단하고, 그 판단결과를 외부로 표 시하는 트랙킹 검출부를 포함하되, 상기 특징점은 각각 트랙킹 발생시 전류 파형에 나타나는 임펄스 형태의 불 규칙한 파형과 관련된 데이터이고, 상기 학습은 트랙킹이 발생되지 않은 경우와 발생된 경우에 대한 복수의 전 류 파형으로부터 각각 검출한 상기 특징점을 입력으로 하여 트랙킹 발생 여부를 식별하도록 하는 지도학습법 (supervised learning)에 의해 이루어지는 것을 특징으로 한다. 또한, 상기 학습시 트랙킹 검출부는, PSO 알고리즘을 이용하여 상기 인공신경망의 은닉층 노드 수, 학습률 및 모멘텀 계수를 결정하는 것을 특징으로 한다. 또한, 상기 특징점은 복수 개이고, 상기 학습시 트랙킹 검출부는 PSO 알고리즘을 이용하여 상기 복수의 특징점 중 일부의 특징점을 선택하여 상기 인공신경망의 입력으로 하는 것을 특징으로 한다. 또한, 본 발명에 따른 인공신경망을 이용한 트랙킹 검출방법은 분전반이나 부하말단에서 전류 파형을 검출하는 제1단계, 상기 제1단계에서 검출된 전류 파형으로부터 트랙킹과 관련된 적어도 하나의 특징점을 검출하는 제2단 계, 및 상기 제2단계에서 검출된 특징점을 학습이 완료된 인공신경망에 대입하여 얻은 출력값에 따라 상기 전류 파형이 검출된 부위에 트랙킹이 발생되었는지 여부를 판단하는 제3단계를 포함하되, 상기 특징점은 각각 트랙킹 발생시 전류 파형에 나타나는 임펄스 형태의 불규칙한 파형과 관련된 값이고, 상기 학습은, 트랙킹이 발생되지 않은 경우와 발생된 경우에 대한 복수의 전류 파형으로부터 각각 검출한 상기 특징점을 입력으로 하여 트랙킹 발생 여부를 식별하도록 하는 지도학습법(supervised learning)에 의해 이루어지는 것을 특징으로 한다. 효 과 이상에서 설명한 바와 같이 본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치 및 방법은 트랙킹 발생시 전 류 파형에 나타나는 특성 정보(즉, 불규칙한 임펄스 형태의 파형)를 인공신경망에 미리 학습시킨 후, 실제 전류 파형의 입력시 상기 인공신경망의 학습 결과에 따라 트랙킹이 발생되었는지 여부를 판단하는 방식이기 때문에, 상기 실제 전류 파형에 대한 사전 정보가 없는 경우에도 트랙킹의 발생 여부를 정확하고 신속하게 검출함으로써 트랙킹에 의한 피해를 미연에 방지할 수 있다는 장점이 있다. 또한, 본 발명에 따른 트랙킹 검출장치 및 방법은 인공신경망의 학습 및 추론에 필요한 입력 데이터, 은닉층의 노드 수, 학습률 및 모멘텀 계수 등을 PSO 알고리즘에 의하여 최적화시킴으로써 상기 인공신경망의 추론 능력 및 계산속도를 더욱 향상시킬 수 있다는 장점이 있다. 발명의 실시를 위한 구체적인 내용 이하에서는 본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치 및 방법의 바람직한 실시예를 첨부한 도면을 참조하여 상세히 설명하기로 한다. 일반적으로 트랙킹이 발생된 경우와 트랙킹이 발생되지 않은 경우에 있어서 부하 말단에서의 전압 파형은 양 경 우에 있어서 거의 변화가 없으나, 전류 파형의 경우 트랙킹 발생시 임펄스 형태의 불규칙한 피크가 나타난다는 특징이 있다. 이를 구체적으로 살펴보면, 트랙킹이 발생되지 않은 경우에는 도1a에 도시한 바와 같이 정상적인 사인파 형태의 전류 파형이 나타나게 되나, 트랙킹이 발생된 경우에는 도1b 내지 도1d에 도시한 바와 같이 파형의 극점 부근에 서 임펄스 형태의 파형이 불규칙하게 나타난다.또한, 상기와 같은 변형된 형태의 전류 파형은 부하의 종류 및 트랙킹의 진행과정에 따라 여러 가지 다양한 패 턴으로 나타날 수 있다. 본 발명은 트랙킹 발생 여부에 따른 상기 전류 파형의 차이점을 이용하는 것으로, 분전반이나 부하말단에서 검 출한 전류 파형만을 이용하여 트랙킹 발생 여부를 정확하고 신속하게 판단하기 위한 것이다. 도2는 본 발명의 일실시예에 따른 인공신경망을 이용한 트랙킹 검출장치의 구성을 나타낸 블록도이다. 도2의 트랙킹 검출장치는 분전반이나 부하말단에서의 전류 파형을 검출하는 전류파형 검출부, 상기 검출된 전류 파형으로부터 특징점을 검출하는 특징점 검출부, 및 상기 검출된 특징점을 이용하여 트랙킹이 발생되 었는지 여부를 판단하는 트랙킹 검출부를 포함하여 구성된다. 상기 전류파형 검출부는 분전반이나 부하말단에서 전류 파형을 입력받는 부분으로서, 변류기(current transformer, CT)와 DA 컨버터를 이용하여 전류 파형에 대한 데이터를 입력받도록 구성된다. 이때, 샘플링 주기 및 이에 따른 데이터 개수는 필요에 따라 다르게 설정될 수 있으나, 본 발명에서는 일예로 서 1초 간격으로 50kHz/s의 샘플링 주기로 50000개의 데이터를 입력받는 것으로 구성하였다. 한편, 상기 특징점 검출부는 전류파형 검출부에서 입력된 50000개의 샘플링 데이터로부터 트랙킹 발생 여부를 판단하기 위해 필요한 특징점들을 검출하게 되는데, 본 발명에서는 상기 특징점 검출부가 데이터 연 산기, 데이터 필터링기, FFT 변환기 및 Wavelet 변환기를 포함하도록 구성하여 <특징점 1> 내 지 <특징점 12>의 12개의 특징점을 검출하도록 하였다. 상기 <특징점 1> 내지 <특징점 12> 각각의 구체적인 내용 및 의미는 다음과 같다. <특징점 1> RMS_o : 이는 상기 데이터 연산기를 이용하여 상기 검출된 전류 파형의 실효값을 연산한 값으로, 후술하는 RMS_f와의 대비를 통하여 트랙킹이 발생되었는지 여부를 판단하기 위해 필요한 특징점이다. <특징점 2> High_peak : 이는 상기 데이터 연산기를 이용하여 상기 검출된 전류 파형의 최대값을 구한 값으 로, 상기 검출된 전류 파형의 상위 피크에 트랙킹 발생시 나타나는 임펄스 형태의 파형이 나타났는지 여부를 판 단하기 위해 필요한 특징점이다. <특징점 3> Low_peak : 이는 상기 데이터 연산기를 이용하여 상기 검출된 전류 파형의 최소값을 구한 값으 로, 상기 검출된 전류 파형의 하위 피크에 트랙킹 발생시 나타나는 임펄스 형태의 파형이 나타났는지 여부를 판 단하기 위해 필요한 특징점이다. <특징점 4> RMS_f : 이는 상기 데이터 필터링기 및 데이터 연산기를 이용하여 얻어지는 값으로, 상기 검출된 전류 파형에 65Hz의 차단주파수를 가지는 버터워스(butterworth) 저역통과 필터를 적용한 후 실효값을 연산한 값이다. 이는 상기 입력된 전류 파형에서 트랙킹에 의해 발생된 고주파수의 전류 신호를 제거하기 위한 것으로, 상기 RMS_o와 대비하여 트랙킹 발생여부를 판단하기 위해 필요한 특징점이다. <특징점 5> 첨도(Kurtosis) : 이는 상기 데이터 연산기를 이용하여 입력된 전류 파형의 첨도를 연산하여 얻 어지는 값으로, 상기 입력된 전류 파형에 트랙킹 발생시 나타나는 임펄스 형태의 파형이 나타났는지 여부를 판 단하기 위해 필요한 특징점이다. <특징점 6> 비대칭도(Skewness) : 이는 상기 데이터 연산기를 이용하여 입력된 전류 파형의 비대칭도를 연 산하여 얻어지는 값으로, 트랙킹 발생시 정현파형의 전류 파형이 찌그러지는 현상을 이용하여 트랙킹이 발생되 었는지 여부를 판단하기 위해 필요한 특징점이다. <특징점 7> 스펙트럼 크기의 평균 : 이는 상기 데이터 필터링기 및 FFT 변환기를 이용하여 얻어지는 값 으로, 상기 검출된 전류 파형에 1kHz의 차단주파수를 가지는 고역통과 필터를 적용한 후 FFT 변환하여 크기의 평균값을 구한 것이다. 상기 스펙트럼 크기의 평균은 트랙킹 발생시 나타나는 임펄스 형태의 파형이 고주파수임을 이용한 것으로, 트랙 킹에 의해 생성된 파형을 추출하여 트랙킹이 발생되었는지 여부를 판단하기 위해 필요한 특징점이다. <특징점 8> 스펙트럼 크기의 표준편차 : 이는 상기 데이터 필터링기 및 FFT 변환기를 이용하여 얻어지 는 값으로, 상기 검출된 전류 파형에 1kHz의 차단주파수를 가지는 고역통과 필터를 적용한 후 FFT 변환하여 크 기의 표준편차값을 구한 것이다. 상기 스펙트럼 크기의 표준편차값도 트랙킹 발생시 나타나는 임펄스 형태의 파형이 고주파수임을 이용한 것으로 트랙킹에 의해 생성된 파형을 추출한 후, 상기 스펙트럼 크기의 평균과 함께 트랙킹에 의해 생성된 파형이 불규 칙한지 여부를 판단하기 위해 필요한 특징점이다. <특징점 9> High_peak 평균 : 이는 상기 Wavelet 변환기를 이용하여 얻어지는 값으로, 트랙킹 발생시 전류 파형의 상위 피크와 하위 피크에서 임펄스 형태의 파형이 불규칙하게 발생되는 현상을 이용한 것이다. 즉, Wavelet을 이용하여 샘플링 시간(1초) 동안 나타나는 60개의 상위 피크와 하위 피크 중 상위 피크들을 찾은 후 상기 상위 피크값들을 평균하여 얻어지는 값으로서, 후술하는 High_peak 표준편차와 함께 상기 입력된 전류 파형 일부에 트랙킹에 의한 임펄스 형태의 파형이 불규칙하게 포함되었는지 여부를 판단하기 위해 필요한 특징 점이다. <특징점 10> High_peak 표준편차 : 이는 상기 Wavelet 변환기를 이용하여 얻어지는 값으로, 트랙킹 발생시 전류 파형의 상위 피크와 하위 피크에서 임펄스 형태의 파형이 불규칙하게 발생되는 현상을 이용한 것이다. 즉, Wavelet을 이용하여 샘플링 시간(1초) 동안 나타나는 60개의 상위 피크와 하위 피크 중 상위 피크들을 찾은 후, 상기 상위 피크값들의 표준편차를 구한 값으로 전술한 High_peak 평균과 함께 상기 입력된 전류 파형 일부 에 트랙킹에 의한 임펄스 형태의 파형이 불규칙하게 포함되었는지 여부를 판단하기 위해 필요한 특징점이다. <특징점 11> Low_peak 평균 : 이는 상기 Wavelet 변환기를 이용하여 얻어지는 값으로, 트랙킹 발생시 전류 파형의 상위 피크와 하위 피크에서 임펄스 형태의 파형이 불규칙하게 발생되는 현상을 이용한 것이다. 즉, Wavelet을 이용하여 샘플링 시간(1초) 동안 나타나는 60개의 상위 피크와 하위 피크 중 하위 피크들을 찾은 후, 상기 하위 피크값들을 평균하여 얻어지는 값으로 후술하는 Low_peak 표준편차와 함께 상기 입력된 전류 파 형 일부에 트랙킹에 의한 임펄스 형태의 파형이 불규칙하게 포함되었는지 여부를 판단하기 위해 필요한 특징점 이다. <특징점 12> Low_peak 표준편차 : 이는 상기 Wavelet 변환기를 이용하여 얻어지는 값으로, 트랙킹 발생시 전류 파형의 상위 피크와 하위 피크에서 임펄스 형태의 파형이 불규칙하게 발생되는 현상을 이용한 것이다. 즉, Wavelet을 이용하여 샘플링 시간(1초) 동안 나타나는 60개의 상위 피크와 하위 피크 중 하위 피크들을 찾은 후, 상기 하위 피크값들의 표준편차를 구한 값으로 전술한 Low_peak 평균과 함께 상기 입력된 전류 파형 일부에 트랙킹에 의한 임펄스 형태의 파형이 불규칙하게 포함되었는지 여부를 판단하기 위해 필요한 특징점이다. 다음으로, 상기 트랙킹 검출부는 특징점 검출부에서 입력되는 12개의 특징점들을 이용하여 상기 전류 파형을 검출한 선로에 트랙킹이 발생되었는지 여부를 판단하는 제어부, 상기 제어부가 트랙킹 발생 여 부를 판단하기 위한 알고리즘과 상기 알고리즘의 사전 수행결과에 관한 정보 등이 미리 저장되어 있는 메모리 , 및 트랙킹 발생시 상기 제어부의 제어신호에 의해 이를 외부로 표시하는 표시부를 포함하여 구성 된다. 본 발명에서 상기 제어부는 트랙킹 발생 여부를 판단하는 추론엔진으로서 인공신경망을 사용하며, 상기 인 공신경망의 최적화를 위하여 PSO(Particle Swarm Optimization) 알고리즘을 사용하는 것을 특징으로 한다. 일반적으로 인공신경망은 인간의 신경계에서 정보가 전달되는 과정을 모방한 지능형 알고리즘으로서 도3에 도시 한 바와 같이 각각 다수 개의 노드로 이루어진 입력층, 은닉층 및 출력층으로 크게 구성되며, 학습이 가능하다 는 장점 때문에 패턴 인식분야에 많이 사용된다. 상기와 같이 구성되는 인공신경망의 학습방법은 입력된 데이터의 패턴 분류와 예측에 유용한 지도학습법 (supervised learning)과, 입력된 데이터의 군집화와 분리에 유용한 자율학습법(unsupervised learning)으로 크게 분류된다. 본 발명에서는 트랙킹 발생 여부를 판단하기 위한 학습방법으로서 입력에 대한 출력값을 알고 있는 상태에서 학 습을 진행하는 상기 지도학습법을 사용하였으며, 학습 알고리즘으로는 입력층에서 출력층의 방향으로 입력 데이 터를 전파하여 출력값을 얻은 후, 상기 출력값과 목표값 사이의 오차를 출력층에서 입력층의 방향으로 전파하여 각 층 노드 사이의 연결가중치를 변화시켜 오차를 줄여나가는 오류 역전파 알고리즘(back propagation algorithm)을 사용하였다. 이러한 인공신경망에서의 학습방법을 구체적으로 살펴보면, 먼저 제1단계에서는 입력층과 은닉층 사이, 은닉층 과 출력층 사이의 연결가중치들을 랜덤함수를 이용하여 초기화한다. 다음으로 제2단계에서는 입력층에 입력된 입력 데이터에 대하여 출력층의 방향으로 전방향 전파(forward propagation)를 수행한다. 이때, 입력층에서는 입력된 데이터를 그대로 출력하고, 은닉층에서는 [수식 1]에서 알 수 있는 바와 같이 입력 층의 출력값에 입력층과 은닉층의 각 노드 사이의 연결가중치를 곱한 값의 합을 은닉층의 입력으로 한다."}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "여기에서, netj는 뉴런 j(은닉층)의 입력값, oi는 뉴런 i(입력층)의 활성값, wji는 뉴런 i와 j 사이의 연결가중 치 및 θj는 뉴런 j의 문턱값이다. 상기 은닉층에서는 [수식 1]에서 얻은 입력값을 활성함수에 취하여 출력하게 되는데, 상기 은닉층의 활성함수로 는 [수식 2]와 같은 시그모이드(Sigmoid) 함수를 사용한다."}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 4, "content": "여기에서, oj는 뉴런 j(은닉층)의 활성값이다. 이와 유사하게, 출력층에서는 [수식 1]과 같이 은닉층의 출력값(즉, 활성값)에 은닉층과 출력층의 각 노드 사이 의 연결가중치를 곱한 값의 합을 출력층의 입력으로 하고, 상기 입력값을 [수식 2] 형태의 활성함수에 취하여 인공신경망의 최종 출력값을 계산한다. 다음으로, 제3단계에서는 상기 최종 출력값과 목표값을 비교하여 오차를 계산하며, 상기 오차가 적정 범위 이내 이면 학습을 중단하고 그렇지 않으면 출력층에서 입력층의 방향으로 일반화된 델타 규칙에 따른 역전파 알고리 즘을 수행하여 연결가중치를 조절한 후, 새로운 입력 패턴을 이용하여 상기 오차가 적정 수준이 될 때까지 상기 과정을 반복하게 된다. 이때, 일반화된 델타 규칙을 이용한 오류 역전파 알고리즘은 널리 알려진 것이기 때문에 여기에서는 상세한 설 명을 생략한다. 한편, 상기 제어부가 실제 입력되는 데이터를 이용하여 트랙킹 발생 여부를 판단하기 위해서는, 먼저 상술 한 바와 같이 목표값(즉, 본 발명에서는 트랙킹 발생여부에 대응되는 값)을 알고 있는 복수의 실험데이터(즉, 본 발명에서는 전류 파형에서 추출한 12개의 특징점)를 이용한 학습이 선행적으로 이루어진 후 그 학습 결과에 따라 결정된 연결가중치 정보들이 메모리에 저장되어져야 한다. 이를 위하여, 본 발명에서는 트랙킹이 발생한 경우와 발생하지 않은 경우에 대한 1000개의 실험적인 전류 파형 으로부터 추출한 1000개의 특징점 데이터 쌍을 이용하여 학습을 수행하였는데, 상기 학습용 데이터는 메모리 에 미리 저장되어 있는 것이 바람직하다. 이때, 인공신경망의 학습을 위해서 은닉층에서의 노드 수, 모멘텀 계수 및 학습률을 미리 결정하여야 하는데, 동일한 학습 데이터를 사용하여 학습을 하는 경우에도 상기 값들을 어떻게 설정하느냐에 따라 인공신경망의 학 습 성능 및 그에 따른 추론 능력이 영향을 받게 되기 때문에 상기 값들을 최적으로 설정할 필요성이 있다. 또한, 트랙킹 발생 여부를 판단함에 있어서 상술한 12개의 특징점을 전부 입력 데이터로 사용할 수도 있으나, 인공신경망의 추론 성능과 계산속도를 향상시키기 위하여 이들 중 판단에 영향을 미치는 특징점만을 선택하여 입력 데이터로 사용할 필요성도 있다.따라서, 본 발명에서는 이를 위하여 제어부가 메모리에 미리 저장된 전술한 PSO 알고리즘을 이용하여 트랙킹 발생 여부 판단에 사용할 특징점의 선택, 은닉층의 노드 수, 학습률 및 모멘텀 계수 등을 최적화하는 과 정을 수행한다. 상기 PSO (Particle Swarm Optimization) 알고리즘은 새, 벌 등의 군집 생활을 하는 생물체들의 이동 모습과 그 원리를 모방한 최적화 알고리즘이다. 이때, 군집을 swarm이라 하며, 군집 내의 각 개체를 particle이라 한다. 상기 PSO 알고리즘에서 각 particle은 찾고자 하는 해의 위치정보를 의미하며, 이 위치를 이동시키면서 최적의 위치를 찾아간다. 각 particle 위치의 이동은 swarm 내의 가장 우수한 particle에 대한 위치와, 각 particle의 자취 중에서 가장 우수했던 위치정보를 사용하여 각 particle이 이동할 방향과 속도를 계산하여 새로운 위치를 결정해 간다. 상기 트랙킹 발생 여부의 판단에 사용할 특징점의 선택, 은닉층의 노드수, 학습률, 및 모멘텀 계수를 최적화하 기 위해 본 발명에서 사용한 PSO 알고리즘의 적용방법과 최적화 과정은 다음의 5단계로 수행되며, 이때 사용되 는 PSO 알고리즘에서의 particle은 [표 1]에 나타낸 바와 같이 16개의 요소로 구성된다."}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 5, "content": "[표 1] PSO에서 particle의 구성 [제1단계] : 초기화 단계 [단계 1-1] n개의 particle을 탐색공간 내에서 랜덤하게 생성하여 초기 swarm을 형성한다. 본 발명에서는 n=50 으로 설정하고, 각 환산계수의 탐색공간을 [-10, 10]으로 설정하였다. 즉, [-10, 10]의 범위에서 랜덤하게 50개 의 particle을 생성하였다. [단계 1-2] 초기 particle의 속도를 [-vjmax, vjmax] 내에서 랜덤하게 생성한다. 이때, vjmax는 particle의 j번째 요소의 최대 이동속도를 의미하며 탐색범위의 20%로 설정한다. [단계 1-3] 초기 swarm의 각 particle을 퍼지제어기에 적용하여 평가하여 평가지수를 구하여 pbest로 설정한다. 본 발명에서는 평가지수로서 [수식 3]처럼 정의되는 Mean squared error (MSE)를 사용하였다."}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 6, "content": "여기서, m은 데이터 수, yi는 실제 출력, yi*는 인공신경망의 출력이다. [단계 1-4] 초기 particle의 평가지수 중 최적값을 찾아 gbest로 선정한다. [제2단계] : 관성하중과 속도보정 [단계 2-1] 다음으로 아래의 [수식 4]를 이용하여 관성하중 값을 계산한다. 여기서, t는 반복횟수를 의미하고, wmax = 0.9, wmin = 0.4로 설정하였으며, maxgen은 PSO 알고리즘에서 최대 반복회수를 의미하는 것으로 본 발명 에서는 150으로 설정하였다. [단계 2-2] 다음으로, 아래의 [수식 5]를 이용하여 각 particle의 속도를 계산한다."}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 7, "content": "여기서, vjk(t)는 t번째 반복에서 k번째 particle의 j번째 요소에 대한 속도를 의미하며, c1, c2는 임의의 상수 로써 각각 2.0을 사용하였다. 또한, r1과 r2은 0 ~ 1 사이의 값으로서 [수식 5]를 계산할 때마다 매번 랜덤한 값 을 발생시켜 사용하였으며, xjk는 k번째 particle의 j번째 요소의 값이다. 상기 [수식 5]은 particle이 이동할 방향과 속도의 변화량을 결정하는 식으로서, 각 particle의 이동경로에서 가장 우수했던 위치인 pbest와 가장 우수한 particle의 위치인 gbest의 값을 적용한다. [제3단계] : 각 particle의 새로운 위치 결정 상기 [제2단계]가 완료되면, 아래의 [수식 6]을 이용하여 각 particle의 새로운 위치를 결정한다. vjk(t)는 상기 [단계 2-2]로부터 계산된 속도이며, 현재의 particle에 이 값을 더한다. 이때 새로 계산되는 xjk(t+1)의 각 요 소가 탐색범위 [-10, 10]을 벗어날 경우 탐색범위의 상한값이나 하한값으로 수정한다."}
{"patent_id": "10-2009-0079184", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 8, "content": "[제4단계] particle의 평가 및 pbest, gbest 갱신 [단계 4-1] 상기 [단계 1-3]과 같은 방법으로 위치가 갱신된 각 particle들에 대하여 평가를 수행하여 평가지수 를 구한다. [단계 4-2] 상기 [단계4-1]에서 얻은 평가지수를 이용하여 각 particle의 pbest를 갱신한다. 이때, 각 particle의 평가지수를 이전 pbest와 비교하여, 이전의 pbest의 평가지수가 새로운 particle의 평가지 수보다 클 경우 새로운 particle을 pbest로 재설정한다. [단계 4-3] pbest의 particle 중 가장 우수한 particle의 평가지수와 gbest의 평가지수를 비교하여 더 적은 평 가지수를 가질 경우 gbest를 재설정한다. [제5단계] 종료 평가 종료조건, 즉 t>magent일 경우 프로그램을 종료하고 그렇지 않으면, 상기 [제2단계]부터 [제4단계]의 과정을 반 복한다. 상기 PSO 알고리즘의 수행이 종료되면, 최종적으로 생성된 gbest는 최적의 위치정보를 갖게 된다. 상기와 같은 PSO 알고리즘의 수행과정에 따라서 제어부는 특징점의 종류, 은닉층의 노드 수, 학습률 및 모 멘텀 계수를 변화시켜가면서 가장 좋은 학습결과를 보이는 최적값을 얻을 수 있게 된다. 본 실시예에서는 트랙킹의 발생 여부를 판단하기 위한 인공신경망의 설계를 위하여 특징점의 수를 2개 내지 5개 를 사용하는 경우에 있어서 상술한 PSO 알고리즘을 직접 적용함으로써 아래의 [표 2]와 같은 결과를 얻을 수 있 었다. 이때, 선택된 데이터 번호라 함은 전술한 특징점 각각의 번호를 의미하는 것으로서, 예를 들어 특징점을 2개 사 용하는 경우에 선택된 데이터 번호 3과 6은 각각 <특징점 3>인 Low_peak와 특징점 6인 비대칭도를 의미한다. <표 2> PSO 알고리즘의 실제 수행결과 상기 <표 2>의 결과에서 알 수 있는 바와 같이 본 발명에 따른 트랙킹 검출방법을 적용할 경우 입력된 전류 파 형에서 추출된 12개의 특징점 중 4개의 특징점(즉, <특징점 1>, <특징점 2>, <특징점 3> 및 <특징점 6>)을 인공 신경망의 입력으로 하고, 은닉층의 노드 수는 9개, 학습률은 0.0102, 그리고 모멘텀 계수는 00327로 설정하여 학습할 경우에 학습능력과 실제 데이터에 대한 추론능력이 가장 우수하게 나타나는 것으로 평가되었다. 한편, 제어부는 상기 과정에 의하여 입력으로 사용될 특징점의 종류, 은닉층의 노드 수, 학습률 및 모멘텀 계수가 최적으로 결정되면, 이들 최적화된 값들을 이용하여 오류 역전파 알고리즘에 의해 인공신경망의 각 노드 사이의 연결가중치를 학습에 의해 결정하게 된다. 이때, 상기 인공신경망의 학습과정에 있어서 본 실시예에서는 트랙킹이 발생된 데이터에 대해서는 목표값을 -1 로 설정하고, 정상상태의 데이터에 대해서는 목표값을 1로 설정하여 연결가중치를 학습하였다. 상술한 바와 같이 인공신경망의 연결가중치가 일단 학습이 완료되어 메모리에 저장되고 나면, 상기 특징점 검출부로부터 실제 입력 데이터가 입력될 경우 제어부는 학습된 연결가중치가 적용된 인공신경망 알고 리즘의 출력값을 이용하여 상기 입력된 실제 데이터가 트랙킹이 발생되었는지 여부를 판단하게 된다. 이때, 제어부는 인공신경망 알고리즘의 출력값이 0보다 큰 경우이면 트랙킹이 발생되지 않은 정상 상태의 전류 파형이라고 판단하고, 상기 인공신경망 알고리즘의 출력값이 0이거나 0보다 작을 경우에는 트랙킹이 발생 되었다고 판단하게 된다. 한편, 상기 제어부는 이러한 판단결과를 표시하기 위한 제어신호를 상기 표시부에 전달하여 트랙킹 발 생 여부를 감시자가 신속하고 정확하게 인식할 수 있도록 한다. 따라서, 본 발명에 따른 인공신경망을 이용한 트랙킹 검출장치 및 방법은 실제 입력되는 전류 파형을 실시간으 로 판단하여 트랙킹 발생 여부를 검출함으로써 상기 트랙킹에 의한 피해를 미연에 방지할 수 있다는 장점이 있 다. 이때, 상기 표시부는 디스플레이 장치, 경보등 장치 또는 경보음 장치 등 감시자가 제어부의 판단결과 를 인식할 수 있도록 하는 다양한 방식의 표시장치들에 의해서 바람직하게 구현될 수 있다."}
