{"patent_id": "10-2025-0013329", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0053785", "출원번호": "10-2025-0013329", "발명의 명칭": "PEFT 및 RAG를 구비한 축산농가 맞춤형 종량제 AI 서비스 시스템 및 그 방법", "출원인": "영농조합법인이엔비", "발명자": "홍승익"}}
{"patent_id": "10-2025-0013329", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "PEFT 및 RAG를 구비한 축산농가 맞춤형 종량제 AI 서비스 시스템으로서,(a) 상용 대형 언어 모델(LLM)을 축산농가 맞춤형 편의 서비스 제공을 위해 PEFT(Parameter Efficient Fine-Tuning) 기법으로 미세 조정하는 PEFT 모듈;(b) 축산농가의 개체정보, 보유 장비, 농장 환경, 질병 및 사육관리 정보 등 LLM에 학습되거나 공개되기를 원치않는 정보를, 축산 및 산업 추세, 시장 및 유행병 동향 등 농가 공유 정보를 포함하여, RAG(Retrieval-Augmented Generation) 서비스 엔티티를 활용해 별도의 복수 서버 또는 무료 클라우드에 저장하는 정보 저장 모듈;(c) 상기 (a) 및 (b)의 모듈로부터 제공되는 데이터를 파이프라인 방식으로 연결하여 축산농가에 맞춤형 서비스를 제공하고,(d) 입력/출력 인터페이스가 개인비서 형태의 손글씨 또는 음성 타입으로 구성되며,(e) LLM API 키 및 내부 관리 ID를 적용하여 사용한 토큰 수에 따라 종량제로 과금하는 과금 모듈을 포함하는것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0013329", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 시스템은 초고령의 농장주들을 고려하여, 입력/출력 인터페이스를 개인비서 형태로 제공함으로써 사용의편의성을 극대화한 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0013329", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 시스템은 축산농가의 개체정보를 RFID, 블루투스 및 WiFi 중 어느 하나 또는 이들 기술의 통합을 이용하는자동개체 인식 시스템에 의해 취합하고, 취합된 데이터를 농협 등 기관 관리 데이터셋과 정기적으로 매칭·비교하여 별도의 서버에 저장·관리하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0013329", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 시스템은 유무선 통신망을 통해 설치된 각종 장비, 환경 센서 및 IoT 기기 등으로부터 데이터를 수집·제어하고, 이 데이터를 축산 관련 기관의 데이터와 정기적으로 매칭·분배하여 농장별 및 개체별 의사결정을 지원하는 기능을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2025-0013329", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "PEFT 및 RAG를 구비한 축산농가 맞춤형 종량제 AI 서비스를 제공하는 방법으로서,(a) 상용 LLM을 PEFT 기법을 적용하여 축산농가 맞춤형 편의 서비스를 제공하도록 미세 조정하는 단계;(b) 축산농가의 개체정보, 보유 장비, 농장 환경, 질병 및 사육관리 정보 등 민감 정보를 LLM 학습 데이터에 포공개특허 10-2025-0053785-3-함되거나 공개되지 않도록, 별도의 복수 서버 또는 무료 클라우드에 저장하는 단계;(c) 축산 및 산업 추세, 시장 및 유행병 동향 등 농가 공유 정보를 RAG 서비스 엔티티를 활용하여 저장하고, 필요 시 파이프라인 방식으로 검색하는 단계;(d) 입력/출력 인터페이스를 개인비서 형태의 손글씨 또는 음성 타입으로 제공하는 단계; 및(e) LLM API 키와 내부 관리 ID를 적용하여 사용한 토큰 수에 따라 종량제로 과금하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2025-0013329", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예에 따른 PEFT 및 RAG을 구비한 축산농가 맞춤형 종량제 AI 서비스 시스템 및 그 방법은, 주로 축산농가에 맞춤형으로, 사용한 만큼만 과금하는 종량제 AI 서비스를 제공하는 시스템 및 방법으로서 우선 상용 LLM(Large Language Model)을 PEFT(Parameter Efficient Fine-Tuning) 서비스로 축산농가 맞춤형 편의 서비스를 (뒷면에 계속)"}
{"patent_id": "10-2025-0013329", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 축산농가에 특화된 종량제 AI 서비스 시스템 및 그 방법에 관한 것으로, 상용 LLM을 PEFT 기법으로 최적화하여 농장 맞춤 편의 기능을 제공하고, RAG 기술을 통해 민감한 정보와 산업 동향 데이터를 별도 관리하 며, RFID 및 IoT 네트워크를 이용해 자동 개체인식과 통합 데이터 수집으로 스마트팜 운영의 효율성을 증진시키 는 기술 분야이다."}
{"patent_id": "10-2025-0013329", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 인공지능 기술의 발전과 함께 농축산업 분야에서도 스마트팜 도입이 활발히 이루어지고 있다. 특히 Large Language Model(LLM)을 기반으로 한 AI 서비스는 다양한 산업 분야에서 혁신적인 변화를 이끌고 있으며, 축산농 가에서도 이러한 기술의 도입 필요성이 증가하고 있다. 그러나 기존의 LLM 기반 서비스들은 대부분 정액제 형태로 운영되어 소규모 축산농가들에 상당한 경제적 부담으 로 작용하고 있다. 또한, 범용 목적으로 설계된 LLM은 축산농가의 특수한 요구사항과 환경을 충분히 반영하지 못하는 한계가 있다. 특히 농장주의 평균 연령이 고령화됨에 따라, 복잡한 디지털 기기나 서비스의 사용이 어려 운 실정이다. 현재 축산농가에서는 개체관리, 사육환경 모니터링, 질병 관리 등 다양한 정보를 개별적으로 관리하고 있으며, 이로 인해 통합적인 데이터 분석과 의사결정이 어려운 상황이다. RFID나 환경 센서 등 개별 IoT 장비들은 도입 되어 있으나, 이들 간의 유기적인 연계가 부족하여 데이터의 효율적인 활용이 제한적이다. 또한, 축산농가에서 발생하는 민감한 정보들(개체정보, 질병 기록, 유전정보 등)의 보안과 관리도 중요한 문제 로 대두되고 있다. 기존의 클라우드 기반 서비스들은 이러한 민감 정보의 보안을 완벽하게 보장하지 못하는 경 우가 많다. 가축의 건강상태 모니터링에서도, 현재는 개별 장비(돈형기, 우형기, X-ray, CT 등)에서 수집되는 데이터가 통 합되지 못하고 분절적으로 관리되고 있어, 종합적인 건강 평가와 예측이 어려운 상황이다. 특히 실시간으로 변 화하는 가축의 상태를 지속해서 모니터링하고 즉각적인 대응을 하는 것이 현재 시스템으로는 한계가 있다. 농장 내 통신 인프라 측면에서도, 기존의 일반적인 WiFi 네트워크로는 넓은 축사 면적과 복잡한 구조물로 인한 통신 음영 지역 문제를 해결하기 어렵다. 이는 IoT 장비들의 안정적인 데이터 수집과 전송을 저해하는 요인이 되고 있다. 더불어 축산 관련 기관(농협 등)에서 관리하는 데이터와 개별 농가의 데이터 간 연계도 미흡한 실정이다. 이로 인해 산업 전반의 동향 파악과 개별 농가의 의사결정 지원이 효과적으로 이루어지지 못하고 있다. 유전능력 평가나 질병 예측과 같은 고도화된 분석에서도, 현재는 개별 농가나 연구기관이 보유한 데이터베이스 가 분산되어 있어 통합적인 분석과 예측이 어려운 상황이다. 특히 AI 기술을 활용한 분석은 아직 초기 단계에 머물러 있다. 이러한 배경에서, 축산농가의 특성과 요구사항을 반영한 맞춤형 AI 서비스의 개발이 필요하다. 특히 경제성, 사 용 편의성, 데이터 통합관리, 보안성 등을 종합적으로 고려한 새로운 형태의 서비스 플랫폼이 요구되고 있다. 또한, 고령 농장주들도 쉽게 사용할 수 있는 직관적인 인터페이스와 합리적인 과금체계의 도입이 시급한 상황이"}
{"patent_id": "10-2025-0013329", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "다.발명의 내용"}
{"patent_id": "10-2025-0013329", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 주요 과제는 축산농가에 특화된 AI 서비스를 종량제(pay-as-you-go) 방식으로 제공함으로써, 기존의 정액제 기반 AI 서비스가 초래하는 경제적 부담과 맞춤형 서비스 부족 문제를 동시에 해결하는 데 있다. 기존 LLM(대형 언어 모델)을 단순히 활용하는 방식은 일반화된 정보를 바탕으로 동작하기 때문에, 축산농가와 같이 특수한 환경과 요구조건을 가진 현장에서 발생하는 다양한 문제에 적절한 대응이 어렵다. 특히, 축산농가에서는 개체정보, 보유 장비, 농장 환경, 질병 및 사육관리 정보 등 매우 민감하고 기밀성이 요구되는 데이터를 다루고 있으며, 이러한 정보들이 LLM의 학습 데이터에 포함되거나 외부에 노출될 경우 보안 및 프라이버시 문제가 심각 하게 발생할 수 있다. 이에 본 발명은 상용 LLM을 축산농가 맞춤형 서비스로 전환하기 위해 PEFT(Parameter Efficient Fine-Tuning) 기법을 적용하여, LLM이 일반적인 데이터 외에 축산농가 특유의 운영환경 및 개별 데이터를 반영한 맞춤형 모델 로 정밀하게 튜닝되도록 한다. 동시에, 농가의 민감한 개체정보 및 환경정보 등은 LLM 학습 과정에서 분리·격 리하여 관리하고, 축산 및 산업 동향, 시장 상황, 유행병 정보 등 농가와 공유해야 하는 공용 정보는 RAG(Retrieval-Augmented Generation) 서비스 엔티티를 통해 별도의 복수 서버나 무료 클라우드에 저장, 필요 시 파이프라인 방식으로 신속하게 검색·연계하여 활용할 수 있도록 함으로써, 데이터 보안과 정보 접근성을 모 두 확보하는 것을 목표로 한다. 또한, 축산농가의 사용자 대부분이 고령층임을 고려하여, 기존의 복잡한 디지털 인터페이스 대신 개인비서 형태 의 손글씨 또는 음성 인식 기반 입출력 시스템을 도입, 사용자가 보다 직관적이고 편리하게 서비스를 이용할 수 있도록 지원한다. 이와 함께, LLM API 키와 내부 관리 ID를 기반으로 사용한 토큰 수에 따라 과금하는 종량제 요금제를 도입하여, 사용량에 따른 합리적인 비용 청구가 가능하도록 함으로써, 경제적으로 부담이 큰 축산농가 의 비용 부담을 현저히 완화하는 동시에, 사용자가 실제 필요한 서비스에 대해서만 비용을 지불할 수 있도록 한 다. 더불어, RFID, 블루투스, Wifi 등의 통신 기술을 활용한 자동 개체 인식 시스템을 통해 축산농가의 개체정보를 실시간으로 취합하고, 이를 농협 등 관련 기관의 관리 데이터셋과 주기적으로 매칭·비교하여 별도의 서버에서 안전하게 관리함으로써, 농장별 및 개체별 상황을 정밀하게 파악할 수 있는 기반을 마련한다. 나아가, 유무선 통신망으로 구축된 축산농가 데이터망을 활용하여 설치된 각종 IOT 장비 및 환경 센서의 제어·데이터 수집 기 능을 통합, 축산 관련 기관과의 정보 매칭 및 분배를 정기적으로 수행함으로써, 농가 스스로 최적의 의사결정을 내릴 수 있도록 지원하는 스마트팜 서비스 시스템을 구현하는 데 본 발명이 집중되어 있다."}
{"patent_id": "10-2025-0013329", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 축산농가의 운영 환경 및 경영상의 다양한 제약을 고려하여, 맞춤형 AI 서비스를 종량제 방식으로 제 공함과 동시에, 데이터 보안, 사용자 편의성, 실시간 정보 관리 문제를 동시에 해결하고자 한다. 이를 위해 본 발명은 우선 상용 LLM(Large Language Model)에 대해 PEFT(Parameter Efficient Fine-Tuning) 기 법을 적용함으로써, 농가별 특화 데이터를 빠르고 효율적으로 반영할 수 있는 경량화된 모델을 구현한다. PEFT 를 통해 기존 LLM의 방대한 파라미터 전체를 재학습할 필요 없이, 농가 맞춤형 핵심 파라미터만을 미세 조정함 으로써 시간과 비용을 절감하고, 축산농가의 특수한 사육환경, 질병 관리 및 개체 데이터 등 실무에 필요한 정 보를 정확히 처리할 수 있도록 한다. 한편, 축산농가에서 취급되는 민감 정보(농장의 개체정보, 보유 장비, 환경 상태, 질병 및 사육관리 정보 등)는 LLM의 학습 데이터에 포함되지 않거나 공개되지 않도록 별도의 보안 영역에서 관리된다. 이를 위해 본 발명은 RAG(Retrieval-Augmented Generation) 서비스 엔티티를 활용하여, 축산 및 산업 동향, 시장 및 유행병 정보 등 농가 공유 정보는 복수의 독립 서버나 무료 클라우드 환경에 저장·관리하고, 필요 시 별도의 검색 파이프라인 을 통해 신속히 불러올 수 있도록 설계되었다. 이와 같이 분리된 데이터 관리 체계는 데이터 유출 위험을 최소 화하면서도 최신 정보를 실시간 반영할 수 있게 한다. 또한, 본 발명은 사용자의 접근성을 극대화하기 위해 초고령 상태의 농장주들도 손쉽게 이용할 수 있는 개인비 서 형태의 사용자 인터페이스를 채택한다. 손글씨 및 음성 인식 기반의 입출력 시스템을 적용하여, 복잡한 메뉴 나 키보드 조작 없이도 자연스러운 상호작용이 가능하도록 하고, 이를 통해 농가의 디지털 전환에 따른 부담을경감시킨다. 더불어, 상용 LLM API 키와 내부 관리 ID를 별도로 부여하여 사용한 토큰 수에 따라 과금하는 종량 제 모델을 도입함으로써, 기존 정액제 방식에 비해 실제 사용량에 따른 합리적인 요금 부과가 가능하도록 하였 다. 이는 축산농가의 경제적 부담을 줄이고, 서비스 이용의 유연성을 확보하는 핵심 수단이다. 아울러, 본 발명 은 축산농가 내 개체정보를 정확히 취합하기 위한 자동개체인식 시스템을 마련하였다. RFID, 블루투스, WiFi 등 무선 통신 기술을 단독 혹은 통합하여 적용함으로써, 각 축산 개체의 식별 정보를 실시간으로 수집하고, 농협 등 관련 기관의 관리 데이터셋과 정기적으로 매칭·비교하여 데이터의 신뢰성을 확보한다. 또한, 유무선 통신망 으로 구축된 축산농가 데이터망은 설치된 각종 IoT 장비 및 환경 센서로부터 데이터를 집합·제어하며, 이를 축 산 관련 기관 데이터와 정기적으로 연동시켜 농장별개체별 의사결정을 지원하는 통합관리 플랫폼을 제공한다. 이와 같이 본 발명의 구성 요소들은 PEFT 기반 맞춤형 LLM, RAG를 통한 분리형 데이터 관리, 사용 친화적 개인 비서 인터페이스, 종량제 과금 시스템 및 IoT 기반 자동개체인식 네트워크의 통합 운용을 통해, 축산농가의 다 양한 요구사항과 보안·경제적 문제를 동시에 해결할 수 있는 혁신적 AI 서비스 시스템 및 그 방법을 제공한다."}
{"patent_id": "10-2025-0013329", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 축산농가 특성에 최적화된 종량제 AI 서비스 시스템 및 방법으로, 사용한 만큼 과금하는 경제적 이점 을 제공하고 운영 비용 부담을 경감시키는 효과를 나타낸다. 상용 LLM을 PEFT 기법을 통해 축산농가 맞춤형으로 정밀하게 튜닝하여 사용자의 편의성을 극대화하며, 민감한 농장 개체정보, 보유 장비, 농장 환경, 질병 및 사육관리 정보 등은 RAG 서비스 엔티티를 활용해 별도로 관리함 으로써 데이터 보안성을 확보한다. 또한, 축산 산업 동향, 시장 및 유행병 정보 등 농가 공유 데이터는 별도 서버와 클라우드에 저장하여 효율적으 로 검색·활용하고, RFID, 블루투스, Wifi 등의 자동개체인식 시스템과 유무선 통신망 기반 IoT 기기 관리로 데 이터 수집 및 분석을 원활하게 수행한다. 이와 같이 본 발명은 고령 농장주도 쉽게 접근 가능한 음성 및 손글씨 인터페이스를 제공해 스마트팜 효율성을 향상시키고 축산농가의 경쟁력 강화와 미래 지속 가능성 확보에 기여하는 혁신적 효과를 발휘한다."}
{"patent_id": "10-2025-0013329", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부한 도면들을 참조하여 본 발명의 실시예를 보다 상세하게 설명하고자 한다. 도1은 전체 시스템 구성도. 본 발명의 일 실시예의 축산농가 AI 서비스 전체 구조를 도시한다. 도면1은 본 발명의 축산농가 맞춤형 종량제 AI 서비스 시스템 전체 구조를 도식화한 것이다. 농장주는 개인비서 인터페이스를 통해 손글씨나 음성으로 입력하며, 해당 정보는 PEFT 기법을 적용한 상용 LLM 서버로 전달되어 축 산농가 특화 맞춤 답변을 생성한다. 상기 본 시스템의 개인비서 인터페이스는 직관적이고 사용자 친화적인 디자인으로 구성되어, 특히 초고령의 농 장주도 손쉽게 이용할 수 있도록 최적화되었다. 사용자는 음성 또는 손글씨 입력 방식을 선택할 수 있으며, 입 력된 정보는 실시간 자연어 처리 엔진에 의해 분석되어 농장 상황에 맞춘 맞춤형 응답으로 제공된다. 또한, 인 터페이스는 큰 글자와 명확한 아이콘, 단계별 안내 메시지를 포함하여 사용자의 이해도를 높이고, 장애 요인을최소화하는 동시에 안정적인 피드백을 보장한다. 아울러 RAG 검색 엔진은 별도 클라우드 저장소에 보관된 개체정보, 보유 장비, 농장 환경, 질병 및 산업·시장 동향 등의 데이터를 실시간 검색·반영해 LLM 출력에 보조 정보를 제공한다. 그런데 상기 PEFT 기법은 상용 LLM의 일부 파라미터만 업데이트함으로써 축산농가 맞춤형 데이터를 신속하게 반 영하는 기술이다. 반면, 상기 RAG(검색 강화 생성)는 별도 클라우드에 저장된 농가 개체정보, 환경 데이터, 산 업 동향 등 다양한 외부 정보를 실시간 검색하여 보조 데이터로 활용한다. 이 두 기술은 상호 보완적으로 작용 하여, PEFT가 농가 고유의 특성을 반영한 기본 답변을 생성하면 RAG는 최신 외부 정보를 결합해 응답의 정확성 과 신뢰도를 더 강화하는 역할을 수행한다. 또한, IoT 센서 네트워크가 축사 내 가축의 위치, 체온, 행동 패턴 등 생체 데이터를 자동 수집하고, 농장 내 유무선 망으로 중앙 농장관리 서버로 전송된다. 상기한바 전송된 데이터는 축산기관 관리 데이터셋과 정기 비교·매칭되어 개체별 맞춤 의사결정을 지원하며, 전체 시스템은 사용한 만큼 과금하는 종량제 방식을 채택해 농가의 경제적 부담을 경감시킨다. 상기 LLM 종량제 방식으로 인한 농가 경제적 부담을 경감시키는 데 본 발명에 따른 시스템 및 방법은, 상용 LLM 의 API 키를 활용해 내부 관리 ID를 부여하고, 사용한 토큰 수에 따라 과금하는 종량제 방식을 채택하였다. 이 로써 정액제 방식에서 발생하는 과도한 비용 부담 없이, 실제 사용량에 따른 요금이 청구되어 농가의 경제적 부 담을 대폭 경감시킨다. 필요한 시점에만 비용을 지급할 수 있으므로, 농가 운영에 있어 불필요한 비용 지출을 최소화하고, 안정적인 재정 관리와 효율적인 자원 배분을 동시에 실현할 수 있다. 도2는 LLM PEFT 구성도. 상용 LLM에 PEFT 적용 본 발명의 일 실시예의 축산농가 맞춤 서비스 제공을 도시한다. 상기 도2 도면은 상용 LLM을 기반으로 PEFT(파라미터 효율적 파인튜닝) 모듈을 적용하여 축산농가 맞춤형 AI 서 비스를 제공하는 구성도를 나타낸다. 우선, 기존의 상용 LLM은 광범위한 언어 처리 능력을 보유한 대형 언어 모 델로서, 일반적인 자연어 이해 및 생성 기능을 수행한다. 그러나 본 발명의 목적은 축산농가의 특화된 정보 예 컨대, 농장 내 개체별 RFID 데이터, 환경 및 사육관리 정보, 장비 상태와 센서로부터 수집되는 실시간 데이터 등을 반영하여 더욱 정밀하고 맞춤화된 응답을 생성하는 데 있다. 이를 위해 PEFT 모듈이 상용 LLM에 적용된다. PEFT는 전체 모델 파라미터를 대규모로 재학습하는 대신, 소수의 핵심 파라미터만을 미세 조정하여 축산농가의 특수 데이터를 반영하도록 한다. 이 과정에서 농가의 민감한 정보 나 개별 농장에 특화된 데이터를 별도의 맞춤형 데이터 처리 모듈을 통해 연계 처리하게 되며, 이때 학습에 활 용되는 데이터는 외부에 노출되거나 상용 LLM의 정규 학습 데이터에 포함되지 않도록 별도 관리된다. 본 발명에 의한 맞춤형 농가 데이터 연계 처리 단계에서는 농장의 개체정보, 환경 모니터링, 질병 및 사육관리 정보 등이 실시간으로 수집되어 PEFT 모듈에 입력된다. 이 데이터를 바탕으로 PEFT 모듈은 상용 LLM의 기본 기 능 위에 추가 학습을 진행, 축산농가의 상황에 최적화된 응답을 생성하도록 모델을 보완한다. 예를 들어, 초고 령의 농장주가 음성이나 손글씨 입력을 통해 질의하면, 시스템은 해당 농장의 현재 상황 및 관리 이력을 고려한 맞춤형 답변을 제공한다. 최종적으로, PEFT를 적용한 맞춤형 LLM은 농가 맞춤형 AI 서비스 출력을 생성하며, 이 서비스는 개인비서 형태 의 음성 또는 손글씨 인터페이스를 통해 사용자에게 제공된다. 본 구성은 기존 정액제 과금 모델과 달리, LLM API 키와 내부 관리 ID를 활용하여 실제 사용한 토큰 수 만큼 종량제 방식으로 요금이 부과되므로, 축산농가의 경제적 부담을 크게 경감시키는 효과를 기대할 수 있다. 위와 같이 도2는, 상용 LLM의 강력한 언어 처리 능력에 PEFT 모듈을 결합하여 농가 전용 데이터를 효과적으로 반영하고, 민감한 정보를 안전하게 관리하며, 농가 맞춤형 개인 비서형 음성/손글씨 응답으로 하는 사용자 친화 적 인터페이스로 최종 맞춤형 AI 서비스를 제공하는 전체 흐름과 구성 요소를 체계적으로 설명한다. 도3은 RAG 데이터 관리도. 본 발명의 일 실시예의 축산농가 정보·시장 추세 별도 서버 저장/검색의 과정을 도 시한다. 본 발명의 실시예에 따른 AI 서비스 시스템은 축산농가의 특수한 환경과 요구사항을 반영하여, 사용한 만큼 과 금하는 종량제 AI 서비스와 함께 데이터의 안전한 저장 및 효율적 검색을 목적으로 구성한다. 상기 도3은 이 중 RAG 기반 데이터 관리 흐름을 도식화한 것이다. 이를 위하여 먼저, 외부 데이터 소스(M01)에서는 다양한 센서와 IoT 장비를 통해 축산농가의 개체정보, 보유 장 비, 농장 환경, 질병 및 사육관리 정보가 수집된다. 이때, 수집되는 데이터는 영상 자료, 바이오마커, 유전정보 등 민감한 정보와 더불어 축산 산업의 최신 동향, 시장 및 유행병 추세 등도 포함된다. 이러한 정보들은 농가의 개인 정보 보호와 외부 유출 방지를 위해 상용 LLM에는 학습되지 않도록 별도 관리가 필요하다. 그리고 수집된 원천 데이터는 데이터 수집 및 전처리 모듈(M02)로 전달된다. 이 모듈은 다양한 센서로부터 자동 으로 수집된 데이터를 실시간으로 필터링, 정제 및 통합하는 역할을 수행한다. 여기서 데이터의 중복 제거, 오 류 검증, 형식 통일 작업 등을 통해 이후의 검색 및 분석에 최적화된 상태로 가공된다. 전처리된 데이터는 분리형 데이터 저장 서버(M03)에 저장된다. 이 서버는 내부 관리 데이터와는 별도로, 농장 개체정보 및 시장 동향 등 민감 정보의 보안을 고려한 별도의 물리적 또는 클라우드 기반 서버로 구성된다. 이 러한 저장 방식은 외부 침입이나 데이터 유출의 위험을 줄이는 동시에, 필요하면 신속하게 검색할 수 있도록 인 덱스화되어 관리된다. 농협 등 기관에서 제공하는 관리 데이터셋과 정기적으로 매칭비교하여, 데이터의 최신성 및 정확성을 유지하는 것도 이 단계에서 수행된다. 저장된 데이터는 RAG 엔티티(M04)로 연결된다. RAG 모듈은 기존 LLM의 질의응답 기능과 결합하여, 사용자가 입 력한 자연어 질의에 대해 관련 저장 데이터에서 필요한 정보를 실시간으로 검색하고, 이를 바탕으로 맞춤형 응 답을 생성하는 파이프라인의 핵심 역할을 담당한다. 이 과정에서는 사용자(농장주)가 음성 또는 손글씨로 입력 한 문의가 LLM의 API를 통해 처리되며, 검색된 데이터가 추가적인 문맥으로 제공되어 보다 정확하고 개인화된 답변을 생성할 수 있도록 한다. 마지막으로, 생성된 결과는 스마트팜 개인비서 인터페이스(M05)를 통해 농장주에게 전달된다. 이 인터페이스는 주로 고령의 농장주들이 사용하기 쉽도록 음성 및 손글씨 기반의 직관적 입력/출력 방식을 채택하였으며, 응답 결과는 농가의 현재 상황, 시장 동향 및 질병 발생 예측 등 실시간으로 필요한 정보를 제공한다. 또한, 내부 관 리 ID와 LLM API 키를 기반으로 사용한 토큰 수 만큼만 과금하는 종량제 모델을 적용하여, 경제적 부담을 최소 화하는 것이 특징이다."}
{"patent_id": "10-2025-0013329", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하면, 도면 3은 다양한 센서와 외부 데이터 소스에서 축적된 농장 정보와 산업 동향 데이터를 전처리 및 분 리형 서버에 안전하게 저장한 후, RAG 엔티티를 통해 LLM과 연동하여 실시간 검색 및 맞춤형 정보 생성 파이프 라인을 구축한 시스템 구조를 보여준다. 이를 통해 농가 맞춤형 종량제 AI 서비스가 더욱 신뢰성 있고 효율적으 로 구현될 수 있으며, 축산농장 관리 및 의사결정 지원에 크게 이바지하게 된다. 도4는 개인비서 UI 인터페이스. 본 발명의 일 실시예의 축산농가에서 손글씨·음성 입력 개인 비서형 UI 제공을 도시한다. 상기 도4는 본 발명의 축산농가 맞춤형 종량제 AI 서비스 시스템에서 농장주가 더 직관적이고 편리하게 상호작 용할 수 있도록 구성된 개인 비서형 UI 인터페이스를 상세하게 나타낸 것이다. 이 UI는 특히 평균적으로 초고령 인 농장주들을 고려하여 설계되었으며, 두 가지 주요 입력 방식인 손글씨 입력과 음성 입력을 통해 사용자가 자 신의 의도나 명령을 자연스럽게 전달할 수 있도록 한다. 먼저, 헤더 영역은 화면 최상단에 위치하여 농장주의 식별 정보(예, 농장주 ID)와 현재 날짜 및 시간, 그리고 네트워크 연결 상태나 시스템 경고 아이콘 등을 표시하는 것이 바람직하다. 이를 통해 사용자는 서비스의 현재 상태와 개인 정보를 한눈에 확인할 수 있으며, 긴급 상황 발생 시 신속한 대처가 가능하다. 여기서 일 실시예로 출원인들은 “우리도우미(Woori doumi)“라는 축산농가 친화적인 브랜드를 사용한 바 있고, ”도리(Dori)“, ”두미(Dumi)“ 혹은 ”도리두미(Doridumi)“라는 애칭도 개별적으로 사용할 수 있도록하는 상 기 브랜드 메뉴를 개시한 바 있다. 그리고 도면 좌측에 배치된 **메뉴 바(좌측 패널)**는 ‘농장 정보’, ‘장비 관리’, ‘환경 센서’, ‘데이터 조회’, ‘설정’ 등 다양한 기능 메뉴를 직관적으로 나열하여 사용자가 원하는 서비스를 빠르게 선택할 수 있 도록 구성되어 있다. 각 메뉴는 터치 혹은 음성 명령으로 호출할 수 있으며, 사용자가 자주 사용하는 기능은 즐 겨찾기나 바로 가기 형태로 배치되어 있는 것이 바람직하다. 중앙의 메인 화면 영역은 두 개의 주요 입력 영역으로 구분된다. 상단에는 손글씨 입력 패드가 배치되어 있어, 사용자가 터치스크린 상에서 직접 손글씨나 간단한 그림, 기호 등을 입력할 수 있다. 이 입력 패드는 내장된 손 글씨 인식 모듈과 연동되어, 입력된 내용이 실시간으로 디지털 텍스트로 변환되어 내부의 LLM 및 PEFT 서비스에 전달된다. 농장주는 복잡한 메뉴 조작 없이도 직접 메모를 남기거나, 특정 명령어(예, “오늘 가축 건강상태 확인해줘”)를 자연스럽게 기록할 수 있다. 또한, 메인 화면 영역의 하단에는 음성 입력 버튼이 마련되어 있다. 마이크 아이콘과 “말하기”라는 안내 텍스 트가 함께 표시되어 있으며, 사용자가 이 버튼을 터치하면 음성 녹음이 시작된다. 녹음된 음성 데이터는 내장 음성인식 엔진에 의해 실시간으로 텍스트로 변환된 후, 동일하게 LLM 서비스로 전송된다. 이 과정을 통해, 사용 자는 손으로 입력하기 어려운 경우에도 간편하게 음성 명령으로 시스템에 접근할 수 있다. 전송된 입력 데이터는 내부의 PEFT 기반 맞춤형 LLM이 축산농가에 특화된 데이터를 바탕으로 분석·처리하며, 동시에 RAG 모듈을 활용하여 별도의 서버 혹은 클라우드에 저장된 농가 공유 데이터(예, 개체정보, 장비 현황, 질병 및 사육관리 정보 등)와 매칭·검색 과정을 거친다. 이로써, 사용자가 “오늘 우측 축사의 소 사육 상황 확인”과 같이 구체적인 명령을 내리면, 관련된 최신 데이터와 정보가 실시간으로 조회되어 결과 출력 영역에 텍스트 및 음성 형태로 제공된다. 그리고 상기 화면의 결과 출력 영역은 중앙 하단부에 위치하며, LLM 및 RAG 모듈로부터 전달받은 결과가 사용자 에게 명확하게 표시된다. 여기에는 단순 텍스트 정보뿐 아니라, 가축의 체온, 행동 패턴, 환경 센서 데이터 등 다양한 시각 자료와 그래프, 혹은 음성 안내가 포함될 수 있다. 특히 음성 안내 기능은 초고령 사용자의 시각적 피로를 줄여주며, 음성 합성(TTS) 기술과 결합하여 자연스러운 대화형 인터페이스를 구현한다 그리고 하단의 조작 버튼 영역은 ‘재전송’, ‘저장’, ‘도움말’, ‘설정’ 등의 기능 버튼을 제공하여, 입 력 오류 시 재시도하거나, 조회 결과를 기록 저장하고, 사용법에 대한 도움을 받을 수 있도록 지원한다. 이러한 구성은 기존 정액제 기반 LLM 서비스의 복잡한 과금체계 대신, 내부 관리 ID 및 LLM API 키를 활용하여 사용한 토큰 만큼만 과금하는 종량제 방식을 적용한 본 시스템의 경제적 효율성을 보완하는 역할도 한다. 전체적으로, 본 UI 인터페이스는 축산농가의 특성과 농장주의 사용 환경에 최적화된 맞춤형 서비스 제공을 목표 로 하며, 손글씨와 음성 입력을 통해 더욱 자연스러운 사용자 상호작용을 구현한다. 이를 통해 농장주는 복잡한 시스템 조작 없이도 필요한 정보를 신속하게 획득할 수 있으며, 데이터 기반 의사결정을 효과적으로 수행할 수 있다. 또한, 직관적인 디자인과 대화형 인터페이스는 기술에 익숙하지 않은 사용자에게도 친숙한 사용 경험을 제공하여, 스마트팜 시스템의 전반적인 접근성과 활용도를 크게 향상시킨다. 이처럼 상기 도4는 본 발명의 핵심 요소인 개인 비서형 UI의 구조와 기능을 상세히 도식화함과 동시에, 손글씨 및 음성 입력을 통해 종합적이고 실시간으로 데이터를 조회·분석하는 서비스의 동작 원리를 명확하게 제시한다. 도5는 종량제 과금 시스템 구성도. 본 발명의 일 실시예의 축산농가 LLM API 토큰 기반 종량제 과금 방식 도입 을 도시한다. 본 발명의 실시예에서는 축산농가에 최적화된 AI 서비스를 제공함과 동시에, 사용한 만큼만 비용을 지급하는 종 량제 과금 방식을 채택하고 있는데 상기 도5는 전체 시스템의 흐름과 각 구성 요소 간의 상호작용을 한눈에 보 여줍니다. 각 모듈의 역할 및 작동 원리는 아래와 같이 설명할 수 있다. 1) 사용자 인터페이스 (개인비서 형태)(CM01) 농장주와 같은 사용자가 음성이나 손글씨 입력 등 직관적인 방식으로 시스템과 상호작용할 수 있도록 개인비서 형태의 사용자 인터페이스를 구성합니다. 특히, 평균적으로 초고령의 사용자를 고려하여 간단하고 명확한 입력 방식을 제공하며, 사용자가 요청하는 서비스(예: 개체관리, 환경 모니터링, 질병 정보 조회 등)를 쉽고 빠르게 입력할 수 있도록 설계된. 2) 요청/입력 처리 모듈(CM02) 사용자로부터 입력된 데이터를 수신하여 자연어 처리 및 전처리를 시행한다. 이 과정에서 입력된 명령을 분석하 여 필요한 정보를 추출하고, 해당 명령을 LLM에 전달하기 전에 오류 검출 및 데이터 정제 과정을 거치게 된다. 이를 통해 서비스 응답의 정확도를 높이고, 사용자가 더 원활하게 원하는 정보를 얻을 수 있도록 돕는다. 3) 축산농가 맞춤형 LLM (PEFT 적용)(CM03) 본 발명에 따른 시스템의 AI 엔진은 상용 LLM에 PEFT 기법을 적용하여, 축산농가 특유의 용어 및 데이터에 맞게 최적화된 모델입니다. 이 모델은 농장의 개체정보, 보유 장비, 환경, 질병, 사육관리 정보 등 다양한 농가 관련 정보를 학습하여, 사용자의 질문에 대해 정확하고 맞춤화된 답변을 제공하게 됩니다. 다만, 민감 정보는 모델 내부에 학습되거나 공개되지 않도록 별도 관리되며, 이에 필요한 정보는 RAG 모듈을 통해 보완되는 것이 바람직하다. 4.1) LLM API 토큰 관리 시스템(CM04.1) LLM이 사용자의 요청을 처리할 때마다 API 호출에 따라 토큰이 소모된다. 이 모듈은 각 요청 별로 사용된 토큰 수를 산출하고, 해당 정보를 내부 관리 ID와 연동하여 관리한다. 토큰은 LLM의 응답 생성에 든 연산량 및 데이 터양을 정량적으로 반영하는 단위로서, 이 시스템은 실시간으로 토큰 사용량을 집계해 사용 명세를 투명하게 기 록한다. 4.2) RAG 기반 데이터 서버(CM04.2) 축산농가의 민감한 정보(예: 농장의 개체정보, 보유 장비, 환경, 질병 및 사육관리 정보 등) 및 산업 동향, 시 장 및 유행병 동향 등은 LLM에 학습되거나 공개되지 않도록 별도의 서버나 무료 클라우드에 안전하게 저장된다. 사용자의 질의에 대해 더 정밀한 답변이 필요할 경우, RAG 모듈이 해당 데이터를 검색하여 LLM의 응답을 보강한 다. 이 과정은 별도의 파이프라인을 통해 이루어지며, 데이터 보안과 정보의 최신성을 동시에 확보한다. 5) 종량제 과금 모듈 (토큰 사용량 기반)(CM05) 사용자가 LLM 서비스를 이용할 때마다 발생하는 토큰 소비량을 기반으로 과금이 산출된다. 기존의 정액제 방식 과 달리, 본 시스템은 실제 사용한 토큰 수만큼 요금을 부과하여 농가의 경제적 부담을 최소화한다. 사용된 토 큰은 LLM API 토큰 관리 시스템에서 실시간으로 기록되며, 정해진 단가에 따라 비용이 계산된다. 이 방식은 다 양한 사용 패턴에 맞춰 유연하게 과금할 수 있도록 설계되어, 사용자가 과도한 비용 부담 없이 필요할 때마다 서비스를 이용할 수 있게 한다. 6) 과금 및 결제 서버(CM06) 종량제 과금 모듈에서 산출된 토큰 사용량을 바탕으로, 최종 요금이 과금 및 결제 서버에서 처리된다. 이 서버 는 다양한 결제 시스템(예: 신용카드, 계좌이체 등)과 연동되어 실시간으로 결제를 처리하며, 사용자에게 상세 한 청구 명세와 사용 명세를 제공한다. 결제 과정은 보안 프로토콜을 준수하여 안전하게 진행되며, 사용자가 언 제든지 과금 명세를 확인할 수 있도록 투명한 보고 기능을 갖추고 있다. 상기와 같이 설명한바 같이 본 발명에 따른 좀 더 구체적인 시스템 작동 예시는 다음과 같다. ① 요청 단계 축산농가의 농장주가 스마트폰 또는 전용 단말기를 통해 “우리도우미, 오늘 가축의 체온과 행동 패턴에 이상이 있는지 확인해줘”라는 음성 명령을 입력한다. 이 명령은 사용자 인터페이스에서 수집되어 요청/입력 처리 모듈 로 전달된다. ② 전처리 및 LLM 처리 요청/입력 처리 모듈은 음성 데이터를 텍스트로 변환하고, 명령어 내의 핵심 정보를 추출하여 축산농가 맞춤형 LLM에 전달한다. LLM은 PEFT 기법을 통해 농가 특화 데이터를 반영한 맞춤형 답변을 생성한다. 이때, 응답 생성 에 사용된 토큰 수가 LLM API 토큰 관리 시스템에 의해 산출되어 기록된다. ③ 민감 정보 보완 만약 요청 내용 중 농장의 개체정보나 질병 관련 민감 정보가 포함되어 있다면, RAG 기반 데이터 서버가 별도로 해당 정보를 검색하여 LLM의 응답에 보완 정보를 제공한다. 이 과정을 통해 응답의 정밀도와 신뢰성을 높인다. ④ 토큰 과금 및 결제 LLM 응답 생성 후, 사용된 토큰 수가 종량제 과금 모듈에 의해 산출된다. 이 정보는 내부 관리 ID와 연동되어 사용자별로 집계되며, 최종적으로 과금 및 결제 서버에서 사용자가 실제 사용한 토큰 수에 따라 요금이 청구된 다. 사용자는 별도의 고정 비용 없이, 실제 사용한 서비스양에 따른 합리적인 요금제를 적용받게 된다. 그런데 AI 토큰은 일반적으로 문장의 길이와 복잡성에 따라 계산되며 영숫자 기준으로 공백을 포함한 약 4자에 서 1 토큰, 한글은 약 23자에 1 토큰으로 계산된다. 이는 AI 모델이 내부적으로 문장을 처리할 때 단어 단위가 아닌 서브 워드(Sub word) 단위로 분해하기 때문이며 영어는 공백을 기준으로 단어가 명확히 구분되는 반면 한 글은 어절 내에서도 의미가 변하는 다양한 조합이 가능해 추가적인 토큰 분할이 필요하므로 같은 의미의 문장을 표현할 때는 한글이 더 많은 토큰을 차지하는 불리함이 발생한다. 예를 들어 \"Hello\"는 1 토큰이지만 \"안녕하세요\"는 23 토큰으로 계산되어 같은 의미라도 한글이 더 큰 비용을 요구한다. 이러한 문제를 개선하기 위해 한글 특화 토큰화 기법을 적용하거나 AI 모델이 한글의 어절 단위를 효율적으로 인식하도록 최적화할 필요가 있다. 또한, 사전 학습 과정에서 한글 코퍼스를 더 많이 포함하거나 병렬 데이터를 활용해 한글 문장의 토큰 효율성을 높이는 방식이 가능하다. 기존 상용 GPT 모델처럼 BPE(Byte Pair Encoding) 기반의 토큰화를 사용할 때는 한글 특유의 어절 단위를 고려한 맞춤형 토크나이저를 개발하는 것도 해결책이 될 수 있다. 나아가 한글을 사용할 때 AI API의 토큰 단위를 보다 유연하게 조정할 수 있도록 정책을 개선하면 사용자들이 부담을 줄이면서도 효율적 으로 AI를 활용할 수 있어 바람직하다. 본 발명의 종량제 과금 시스템은 축산농가의 특수한 환경과 경제적 현실을 고려하여, 사용자 친화적 인터페이스 와 맞춤형 LLM, 안전하게 분리된 민감정보 관리(RAG), 그리고 실시간 토큰 기반 과금체계를 통합한 혁신적인 서 비스 구조를 제공한다. 특히, LLM API 토큰 관리 시스템과 종량제 과금 모듈의 연계를 통해, 농가에서는 불필요 한 비용 부담 없이 필요한 만큼의 AI 서비스를 효율적으로 이용할 수 있으며, 결제 시스템은 사용 명세에 따른 투명한 요금 청구와 결제 처리를 보장하여 이러한 구성은 기존의 정액제 과금 방식 대비 경제적 효율성을 극대 화하며, 초고령의 농장주도 쉽게 접근할 수 있는 직관적이고 안정적인 스마트팜 서비스 시스템으로 자리매김하 게 된다. 이처럼 상기 도5는 전체 시스템의 각 요소가 어떻게 상호작용하여, 축산농가 맞춤형 AI 서비스를 제공하는 동시 에 사용량에 따른 합리적인 요금 산출 및 결제가 이루어지는지를 상세히 설명하며, 본 발명의 주요 구성 요소와 그 혁신적 효과를 명확하게 보여 준다. 상기한 바와 같이 본 발명에 따른 시스템 및 방법은 기존 스마트팜 대비 다음과 같은 장점이 있다. 우선, 상기 PEFT 기반 LLM을 통해 농가 맞춤형 서비스를 제공하며, RAG 엔티티로 민감 정보를 별도 저장·검색하여 데이터 보안과 프라이버시를 강화하였다. 또한, 종량제 과금 방식과 개인비서(손글씨·음성) 인터페이스를 도입하여 초고령 농장주도 쉽게 접근할 수 있 고, RFID·UWB RTLS 등 IoT 장비를 통한 실시간 개체인식 및 위치 모니터링으로 효율적인 데이터 수집 및 의사 결정 지원이 가능하지만, 복합 시스템 통합에 따른 초기 구축 비용과 유지보수 부담, 외부 클라우드 활용 시 발 생할 수 있는 보안 문제, 그리고 농촌 특성상 네트워크 환경 불안정 및 사용자의 기술 숙련도 부족 등이 단점으 로 지적된다. 그리고 앞으로는 본 발명에 따른 시스템의 안정성 강화, 보안 및 프라이버시 문제 해결, 사용자 교육과 현장 지원 체계 마련 등 추가 과제들이 해결되어야 할 것이다."}
{"patent_id": "10-2025-0013329", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 전체 시스템 구성도. 본 발명의 일 실시예의 축산농가 AI 서비스 전체 구조를 도시한다. 도2는 LLM PEFT 구성도. 상용 LLM에 PEFT 적용 본 발명의 일 실시예의 축산농가 맞춤 서비스 제공을 도시한다. 도3은 RAG 데이터 관리도. 본 발명의 일 실시예의 축산농가 정보·시장 추세 별도 서버 저장/검색의 과정을 도 시한다. 도4는 개인비서 UI 인터페이스. 본 발명의 일 실시예의 축산농가에서 손글씨·음성 입력 개인 비서형 UI 제공을 도시한다. 도5는 종량제 과금 시스템 구성도. 본 발명의 일 실시예의 축산농가 LLM API 토큰 기반 종량제 과금 방식 도입 을 도시한다."}
