{"patent_id": "10-2023-0137967", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0054566", "출원번호": "10-2023-0137967", "발명의 명칭": "샘플 제공을 기반으로 한 리뷰 관리 시스템", "출원인": "주식회사 룰루랩", "발명자": "정지영"}}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "샘플을 제공받아 수집하고 수집된 샘플을 관리하는 샘플 관리부;사용자의 샘플 신청을 받아서 수집된 샘플을 사용자에게 제공하는 샘플 제공부;시스템을 이용하려는 사용자를 등록하고 관리하는 사용자 관리부;샘플 제공받은 사용자가 작성한 리뷰를 수집하는 리뷰 수집부; 및 사용자가 등록한 리뷰를 분석하고 관리하는 리뷰 관리부;를 포함하고,상기 샘플 제공부는 샘플을 신청한 사용자가 샘플 제공 대상자인 경우에 샘플을 제공하고,사용자 관리부는 사용자 등록 과정에서 나이와 성별을 포함하는 개인 정보와 피부 촬영 사진을 포함하는 피부측정용 정보 및 문진 정보를 수집하고,상기 리뷰 관리부는 사용자 별로 리뷰를 취합하고 분석하여, 사용자 맞춤의 화장품 추천 알고리즘을 생성하는것을 특징으로 하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 샘플 제공부는 상기 리뷰 관리부에서 생성된 사용자 맞춤의 화장품 추천 알고리즘을 반영하여 사용자별 샘플 제공 리스트를 구성하고 사용자에게 제공하는 것을 특징으로 하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 리뷰 관리부는 사용자 맞춤의 화장품 추천 알고리즘을 반영하여 구성된 사용자별 샘플 제공 리스트에서 사용자가 선택하여 작성한 리뷰를 분석하여 사용자 맞춤의 화장품 추천 알고리즘을 고도화하는 것을 특징으로 하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 리뷰 관리부는 학습된 분석 AI가 사용자에 대한 개별 파라미터를 생성하고, 사용자에 대한 개별 파라미터를 이용하여 사용자 맞춤의 화장품 추천 알고리즘을 생성하는 것을 특징으로 하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "에 있어서,상기 분석 AI는 자연어 처리를 통해서 주요 단어 리스트를 추출하고 추출된 주요 단어 리스트에 대하여 감정 분석 및 의미 해석을 적용함으로써 사용자에 대한 개별 파라미터를 생성하는 것을 특징으로 하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 사용자에 대한 개별 파라미터는 추출된 주요 단어 리스트에서 도출된 사용자별 키워드이며,사용자 맞춤의 화장품 추천 알고리즘은 사용자별 키워드에 가중치를 부여하도록 구성된 것을 특징으로 하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 샘플 제공부는 시스템에 등록하여 소정의 신청 횟수 이내의 샘플 신청을 한 신규 사용자 외에는 이전에 제공 받은 샘플에 대하여 리뷰를 작성한 경우 또는 소정 수준 이상의 리뷰를 작성한 경우에만 샘플 제공 대상자로선정하여 샘플을 제공하는 것을 특징으로 하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 사용자 관리부는 사용자 등록 과정에서 사용자가 입력한 정보 외에, 등록 이후에 추가로 입력한 피부 측정용 정보 및 사용자가 작성한 리뷰를 분석한 정보를 반영하여 사용자 정보를 관리하는 것을 특징으로 하는 샘플제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 리뷰 수집부는 어플리케이션이나 웹사이트와 같은 소정의 플랫폼을 통해서 사용자가 입력한 내용을 수집하며, 리뷰 입력 형식은 소정의 선택지에서 사용자가 선택하여 입력하도록 미리 정해진 선택문항과 개인이 자유롭게 기재하는 자유리뷰로 구성되는 것을 특징으로 하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 리뷰 수집부가 리뷰 입력 전에 새로운 피부 측정용 정보를 사용자가 입력하도록 요구하는 것을 특징으로하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2025-0054566-4-청구항 10에 있어서,상기 리뷰 수집부가 리뷰 입력 과정에서 샘플의 첫사용인지 재사용인지 여부를 입력하도록 요구하는 것을 특징으로 하는 샘플 제공을 기반으로 한 리뷰 관리 시스템."}
{"patent_id": "10-2023-0137967", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 샘플 제공을 기반으로 한 리뷰 관리 시스템에 관한 것으로, 샘플을 제공받아 수집하고 수집된 샘플을 관리하는 샘플 관리부; 사용자의 샘플 신청을 받아서 수집된 샘플을 사용자에게 제공하는 샘플 제공부; 시스템을 이용하려는 사용자를 등록하고 관리하는 사용자 관리부; 샘플 제공받은 사용자가 작성한 리뷰를 수집하는 리뷰 (뒷면에 계속)"}
{"patent_id": "10-2023-0137967", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 화장품에 대한 리뷰를 관리하는 시스템에 관한 것으로, 더욱 자세하게는 샘플 제공을 기반으로 한 리 뷰 관리 시스템에 관한 것이다."}
{"patent_id": "10-2023-0137967", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 통신 기술의 발달 및 스마트폰의 대중화에 따라 인터넷 사용이 점차 활발해 지고 있는 추세에 있다. 이러한 인터넷 환경의 변화에 따라, 인터넷상에 여러 가지 제품 관련 정보들이 방대하게 축적되고 있으며, 많은 사람이 제품을 구매하고자 할 때 다른 사람들이 인터넷상에 올려놓은 리뷰(review)를 참고하는 실정이다. 특히, 화장품과 같이 사용 경험이 중요한 제품의 경우에는 제품 선택 과정에서 타인의 리뷰를 참고하는 경향이 더욱 높게 나타나며, 이와 같은 리뷰의 기능으로 인하여, 제품의 구매를 유도하고 신제품에 대한 피드백 및 홍 보의 목적으로 제품에 대한 리뷰를 수집하고 관리하는 기술이 개발되고 있다. 인터넷에 산재된 여러 가지 리뷰 정보를 강제로 수집하는 과정에서 질이 낮은 리뷰가 증가하여 제품의 홍보와 피드백 효과를 저해하는 문제가 발생하고 있다. 또한, 제품별로 리뷰가 정리되는 것이 일반적이기 때문에 그 활 용 방향이 제한되고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2021-0022873호"}
{"patent_id": "10-2023-0137967", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서 화장품에 대한 수준 높은 리뷰를 얻을 수 있고, 리뷰의 새로운 활용 방향을 도출할 수 있는 리뷰 관리 시스템을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2023-0137967", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명에 의한 샘플 제공을 기반으로 한 리뷰 관리 시스템은, 샘플을 제공받아 수 집하고 수집된 샘플을 관리하는 샘플 관리부; 사용자의 샘플 신청을 받아서 수집된 샘플을 사용자에게 제공하는 샘플 제공부; 시스템을 이용하려는 사용자를 등록하고 관리하는 사용자 관리부; 샘플 제공받은 사용자가 작성한 리뷰를 수집하는 리뷰 수집부; 및 사용자가 등록한 리뷰를 분석하고 관리하는 리뷰 관리부;를 포함하고, 상기 샘플 제공부는 샘플을 신청한 사용자가 샘플 제공 대상자인 경우에 샘플을 제공하고, 사용자 관리부는 사용자 등록 과정에서 나이와 성별을 포함하는 개인 정보와 피부 촬영 사진을 포함하는 피부 측정용 정보 및 문진 정보 를 수집하고, 상기 리뷰 관리부는 사용자 별로 리뷰를 취합하고 분석하여, 사용자 맞춤의 화장품 추천 알고리즘 을 생성하는 것을 특징으로 한다. 상기 샘플 제공부는 상기 리뷰 관리부에서 생성된 사용자 맞춤의 화장품 추천 알고리즘을 반영하여 사용자별 샘 플 제공 리스트를 구성하고 사용자에게 제공할 수 있으며, 상기 리뷰 관리부는 사용자 맞춤의 화장품 추천 알고 리즘을 반영하여 구성된 사용자별 샘플 제공 리스트에서 사용자가 선택하여 작성한 리뷰를 분석하여 사용자 맞 춤의 화장품 추천 알고리즘을 고도화할 수 있다. 상기 리뷰 관리부는 학습된 분석 AI가 사용자에 대한 개별 파라미터를 생성하고, 사용자에 대한 개별 파라미터 를 이용하여 사용자 맞춤의 화장품 추천 알고리즘을 생성할 수 있다. 이때, 상기 분석 AI는 사용자의 리뷰에 대하여 텍스트 분석을 수행하도록 학습된 것일 수 있고, 상기 분석 AI는 자연어 처리를 통해서 주요 단어 리스트를 추출하고 추출된 주요 단어 리스트에 대하여 감정 분석 및 의미 해석 을 적용함으로써 사용자에 대한 개별 파라미터를 생성할 수 있다. 상기 사용자에 대한 개별 파라미터는 추출된 주요 단어 리스트에서 도출된 사용자별 키워드이며, 사용자 맞춤의 화장품 추천 알고리즘은 사용자별 키워드에 가중치를 부여하도록 구성될 수 있다. 상기 샘플 제공부는 시스템에 등록하여 소정의 신청 횟수 이내의 샘플 신청을 한 신규 사용자 외에는 이전에 제 공 받은 샘플에 대하여 리뷰를 작성한 경우 또는 소정 수준 이상의 리뷰를 작성한 경우에만 샘플 제공 대상자로 선정하여 샘플을 제공하는 것일 수 있다. 상기 사용자 관리부는 사용자 등록 과정에서 사용자가 입력한 정보 외에, 등록 이후에 추가로 입력한 피부 측정 용 정보 및 사용자가 작성한 리뷰를 분석한 정보를 반영하여 사용자 정보를 관리할 수 있다. 상기 리뷰 수집부는 어플리케이션이나 웹사이트와 같은 소정의 플랫폼을 통해서 사용자가 입력한 내용을 수집하 며, 리뷰 입력 형식은 소정의 선택지에서 사용자가 선택하여 입력하도록 미리 정해진 선택문항과 개인이 자유롭 게 기재하는 자유리뷰로 구성될 수 있다. 이때, 상기 리뷰 수집부가 리뷰 입력 전에 새로운 피부 측정용 정보를 사용자가 입력하도록 요구하거나 리뷰 입 력 과정에서 샘플의 첫사용인지 재사용인지 여부를 입력하도록 요구할 수 있다."}
{"patent_id": "10-2023-0137967", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이 구성된 본 발명은, 사용자 별로 리뷰를 취합하고 분석함으로써, 사용자 맞춤의 화장품 추천 알고리즘을 생성하는 새로운 활용 방향을 제공할 수 있는 효과가 있다. 또한, 이전에 제공 받은 샘플에 대하여 리뷰를 작성한 경우 또는 소정 수준 이상의 리뷰를 작성한 경우에만 샘 플 제공 대상자로 선정하여 샘플을 제공함으로써, 리뷰 참여율과 리뷰의 수준이 높아지기 때문에 리뷰의 활용 효과가 향상된다."}
{"patent_id": "10-2023-0137967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "첨부된 도면을 참조하여 본 발명에 따른 실시예를 상세히 설명한다. 그러나 본 발명의 실시형태는 여러 가지의 다른 형태로 변형될 수 있으며, 본 발명의 범위가 이하 설명하는 실 시형태로만 한정되는 것은 아니다. 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있으며, 도면상의 동일한 부호로 표시되는 요소는 동일한 요소이다. 그리고 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때 이는 \"직접적으로 연결\"되어 있는 경우뿐만 아니라 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한, 어 떤 부분이 어떤 구성요소를 \"포함\" 또는 \"구비\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성요소를 더 포함하거나 구비할 수 있는 것을 의미 한다. 또한, \"제1\", \"제2\" 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위한 것으로 이들 용어들에 의해 권리범위가 한정되어서는 아니 된다. 예를 들어, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하 게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 도 1은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템의 구성을 설명하기 위한 모식도이 다. 본 실시예의 샘플 제공을 기반으로 한 리뷰 관리 시스템은 샘플 관리부, 샘플 제공부, 사용자 관리부 , 리뷰 수집부 및 리뷰 관리부를 포함한다. 샘플 관리부는 화장품을 제조 또는 판매하는 화장품 회사로부터 샘플을 제공받아 수집하고 수집된 샘플을 관리한다. 샘플은 리스트 형태로 관리될 수도 있고, 별도의 DB를 구성하여 관리될 수도 있다. 본 발명에서 제공 되는 샘플은 판촉용 샘플일 수도 있고 개발용 샘플일 수도 있다. 샘플 제공부는 수집된 샘플을 사용자에게 제공하는 업무를 수행한다. 샘플 제공을 위하여 샘플 신청을 관 리하며, 샘플 제공 대상자를 확인하여 샘플을 제공하는 기능을 수행한다. 샘플 신청은 샘플 제공부에서 제공하는 샘플 제공 리스트에서 사용자가 선택하도록 구성되며, 이때 모든 샘플이 샘플 제공 리스트로 제공될 수도 있고, 사용자 별로 소정의 샘플들을 선택하여 사용자별 샘플 제공 리스 트를 제공할 수도 있다. 또한, 샘플 제공 리스트에는 해당 샘플을 제공한 화장품 회사의 의견이 반영될 수 있다. 사용자별 샘플 제공 리스트는 초기에는 사용자기 입력한 정보를 기초로 작성될 수 있으며, 이후에는 사용 자가 작성한 리뷰를 기초로 하여 사용자별 샘플 제공 리스트를 구성할 수 있다. 샘플 제공 대상자 확인은 시스템에 등록하여 처음으로 샘플을 신청한 사용자 또는 등록 이후에 소정의 신청 횟 수 이내의 신규 사용자는 샘플 제공 대상이며, 신규 사용자에게 제공되는 소정의 횟수를 넘긴 일반 사용자의 경 우에는 리뷰 작성 여부 또는 리뷰 내용에 따라서 샘플 제공 대상 여부가 결정될 수 있다. 구체적으로, 이전에 제공 받은 샘플에 대하여 리뷰를 작성한 경우 또는 소정 수준 이상의 리뷰를 작성한 경우에만 샘플 제공 대상자 로 선정함으로써, 사용자의 리뷰 작성 의욕을 높일 수 있다. 사용자의 리뷰 작성 의욕을 높임으로써, 리뷰 작성 비율 및 리뷰의 수준이 높아지기 때문에 샘플을 제공한 화장품 회사는 더욱 많은 리뷰 및 수준 높은 리뷰를 받 아 볼 수 있는 효과가 있다. 사용자가 샘플 제공 리스트에서 원하는 샘플을 선택하면, 샘플 제공부에서 사용자가 샘플 제공 대상자인지 확인하고, 샘플 제공 대상자인 경우에 신청한 샘플을 사용자에게 제공하도록 처리한다. 사용자 관리부는 본 발명에 따른 리뷰 관리 시스템을 이용하려는 사용자를 등록하고 관리한다. 사용자 등록은 사용자가 개인 정보와 피부 측정용 정보 및 문진 정보 등을 입력하여 수행된다. 사용자 개인 정보는 나이, 성별, 주소 등을 포함할 수 있다. 나이와 성별은 샘플의 제공과 리뷰 분석 등에서 사 용되고, 주소는 샘플 배송에 사용될 뿐만이 아니라 온습도와 자외선 등의 지역별 특성에 따른 정보로서 리뷰 분 석 등에 사용될 수 있다. 도 2는 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 사용자 등록 화면을 도시한 도 면이고, 도 3은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 샘플 신청 화면을 도 시한 도면이다. 피부 측정용 정보는 사용자가 촬영한 피부 사진 등의 정보이며, 피부 측정용 정보는 샘플 신청을 위하여 필수적 으로 요구되고, 소정의 기간마다 피부 측정용 정보를 추가로 등록하도록 구성될 수 있다. 사용자가 등록한 피부 사진을 분석하여 피부 상태와 피부 문제에 대한 정보를 생성할 수 있으며, 이러한 분석은 훈련된 AI에 의해서 수행될 수 있다. 피부 상태는 나이와 성별을 반영하여 평가될 수 있으며, 피부 문제에 대한 정보는 소정의 항목(예를 들면, 주름, 색소침착, 모공, 트러블)에 대한 평가 결과를 종합하여 생성될 수 있다. 문진 정보는 미리 정해진 소정의 문진에 대한 사용자의 답변으로 구성되는 정보이며, 피부타입을 결정하는 용도 로 이용되고, 사용자의 피부 고민을 통해서 본인이 생각하는 피부 문제를 파악하는 용도로 이용될 수도 있다. 도 4는 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 피부 측정 결과를 도시한 도면 이고, 도 5는 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 문진 화면과 피부타입 결과 화면을 도시한 도면이다. 사용자 관리부는 사용자 등록 과정에서 사용자가 입력한 정보를 시작으로 하여, 등록 이후에 추가로 입력 한 피부 측정용 정보 및 사용자가 작성한 리뷰를 분석한 정보 등을 반영하여 개별 사용자에 대한 정보를 지속적 으로 갱신하고 관리한다. 리뷰 수집부는 샘플을 제공받은 사용자가 작성한 리뷰를 수집한다. 리뷰 수집부는 어플리케이션이나 웹사이트와 같은 소정의 플랫폼을 통해서 사용자가 입력한 내용을 수집하며, 소정의 선택지에서 사용자가 선택 하여 입력하도록 미리 정해진 선택문항과 개인이 자유롭게 기재하는 자유리뷰로 구성될 수 있다. 선택문항은 제 품에 대한 별점, 기능에 대한 평가, 흡수력에 대한 평가 및 발림성에 대한 평가 등을 포함할 수 있다. 또한, 리 뷰를 입력하기 전에 새로운 피부 측정용 정보를 사용자가 입력하도록 요구할 수 있고, 샘플의 첫사용인지 재사 용인지 여부를 입력하도록 요구할 수 있으며, 나아가 복수회의 리뷰를 요구할 수도 있다. 리뷰 수집부는 이와 같이 수집된 리뷰를 제품별 리뷰 모음으로 모아서 모든 사용자에게 제공할 수 있으며, 리뷰 모음에서는 수집된 선행문항에 대한 답변의 평균 값을 표시할 수 있다. 또한, 작성 당시 피부 상태에 대한 정보와 첫사용 여부에 대한 정보를 함께 제공할 수 있다. 도 6은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 리뷰 작성 화면을 도시한 도면 이고, 도 7은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 리뷰 모음 화면을 도시 한 도면이다. 나아가 리뷰 수집부는 수집된 리뷰를 샘플을 제공한 화장품 회사에 제공할 수 있다. 화장품 회사에 제공되 는 리뷰는 해당 샘플에 대하여 본 시스템에서 수집되는 리뷰 전체일 수도 있고, 화장품 회사에서 요구하는 특정 항목에 대한 내용만 제공될 수도 있다. 또한, 리뷰 참여자에 대한 분석 데이터를 샘플 회사에 제공할 수도 있으 며, 참여자 전체 분포, 샘플별 신청 및 사용 분포, 리뷰 참여도 등의 일반 분석 데이터와 샘플별 선호군과 비선 호군에 대한 정보, 첫사용과 재사용에 따른 변화에 대한 정보 등과 같은 본 시스템 특유의 분석 정보를 제공할 수도 있다. 화장품 회사는 제공받은 리뷰를 이용하여 샘플 제품 및 서비스에 대한 피드백으로 이용할 수 있고, 임상시험 센터와 연계하거나 신제품 체험단 모집 등에 이용할 수도 있다. 리뷰 관리부는 사용자가 등록한 리뷰를 분석하고 관리한다. 기존의 리뷰 관리 시스템은 제품별 리뷰를 모아서 제품을 표현하는 정보를 도출하고 이를 소비자에게 제공하여 제품 선택에 도움을 주는 방향으로 진행되었으나, 본 발명은 특정 사용자의 리뷰들을 분석하여 사용자 맞춤의 제품을 제공하도록 사용자 중심의 분석을 수행하는 점에 특징이 있다. 도 8은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 리뷰 관리부의 동작을 설명하 기 위한 모식도이다. 리뷰 분석은 선택 문항 중에서 각 제품에 대한 별점을 취합한 뒤에 높은 점수대를 받은 화장품의 특징(성분, 기 능성 등)을 취합하거나 낮은 점수대를 받은 화장품의 특징(성분, 기능성 등)을 취합하고, 각 제품에 대한 특징 과 특징에 매칭되는 리뷰 키워드를 조합하여 학습된 분석 AI가 사용자에 대한 개별 파라미터를 생성한다. 사용 자의 개별 파라미터는 선호 제형, 고객 특징, 선호 성분 등과 같은 키워드에 대하여 사용자별 특징이 반영된 것 일 수 있다. 이를 위하여 분석 AI는 자유리뷰에 대하여 텍스트 분석을 수행하도록 학습되며, 자연어 처리를 통 해서 주요 단어 리스트를 추출하고 학습된 분석 AI는 추출된 주요 단어 리스트에 대하여 감정 분석 및 의미 해 석을 적용함으로써 추출된 주요 단어 리스트에서 도출된 사용자별 키워드인 개별 파라미터를 생성할 수 있다. 사용자 리뷰의 텍스트 분석에 적용되는 인공지능 기술은 특별히 제한되지 않는다. 사용자에 대한 개별 파라미터 는 사용자 맞춤의 화장품 추천 알고리즘을 생성하는 용도로 이용될 수 있으며, 구체적으로 사용자에 대하여 학 습된 파라미터는 사용자의 개인적 특징을 반영한 사용자별 키워드이므로 이에 대하여 가중치를 부여하는 방법으 로 화장품 DB에서 사용자 맞춤 화장품을 추천하는 알고리즘을 생성할 수 있다. 이때, 사용자가 입력한 피부 측 정용 정보를 이용하여 수행된 피부분석 결과를 함께 반영할 수 있다.그리고 사용자의 샘플에 대한 리뷰가 추가될수록 추가적인 학습에 의해서 사용자에 대한 개별 파라미터가 업데 이트되며, 사용자 맞춤의 화장품 추천 알고리즘이 고도화될 수 있다. 이를 위하여 사용자에 대한 개별 파라미터를 이용하여 생성된 사용자 맞춤의 화장품 추천 알고리즘을 샘플 제공 부에 제공하여 사용자별 샘플 제공 리스트를 구성할 때에 적용할 수 있으며, 사용자 맞춤의 화장품 추천 알고리즘을 적용하여 추천된 샘플에 대한 사용자의 리뷰를 분석하여 사용자 맞춤 화장품 추천 알고리즘을 더욱 고도화 시킬 수 있다. 이상 본 발명을 바람직한 실시예를 통하여 설명하였는데, 상술한 실시예는 본 발명의 기술적 사상을 예시적으로 설명한 것에 불과하며, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양한 변화가 가능함은 이 분야에 서 통상의 지식을 가진 자라면 이해할 수 있을 것이다. 따라서 본 발명의 보호범위는 특정 실시예가 아니라 특 허청구범위에 기재된 사항에 의해 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술적 사상도 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0137967", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템의 구성을 설명하기 위한 모식도이 다. 도 2는 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 사용자 등록 화면을 도시한 도 면이다. 도 3은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 샘플 신청 화면을 도시한 도면 이다. 도 4는 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 피부 측정 결과를 도시한 도면 이다. 도 5는 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 문진 화면과 피부타입 결과 화 면을 도시한 도면이다. 도 6은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 리뷰 작성 화면을 도시한 도면 이다. 도 7은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 리뷰 모음 화면을 도시한 도면 이다. 도 8은 본 발명의 실시예에 따른 샘플 제공을 기반으로 한 리뷰 관리 시스템에서 리뷰 관리부의 동작을 설명하 기 위한 모식도이다."}
