{"patent_id": "10-2023-0006155", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0114129", "출원번호": "10-2023-0006155", "발명의 명칭": "인공 신경망의 학습을 위한 데이터를 생성하는 장치 및 방법", "출원인": "성균관대학교산학협력단", "발명자": "전재욱"}}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 신경망의 학습을 위한 데이터를 생성하는 장치에 있어서,가상의 지도 내에서 적어도 하나의 센서의 센싱 환경을 설정하도록 구성되는 환경 설정부; 상기 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체(instance)를 포함하는 이미지 데이터를 생성하도록 구성되는 데이터 생성부; 및상기 이미지 데이터에 대한 GT(ground truth) 데이터를 추출하도록 구성되는 데이터 추출부를 포함하는 장치."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 환경 설정부는,상기 가상의 지도에서의 주간 또는 야간에 해당하는 시각 조건, 및 날씨 조건을 설정하는 것을 특징으로 하는장치."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 센싱 환경은,상기 적어도 하나의 센서의 위치, 높이 및 회전각을 포함하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 적어도 하나의 센서는,컬러(color) 이미지를 획득하도록 구성되는 제1 센서 및 상기 적어도 하나의 객체에 대한 정보를 획득하도록 구성되는 제2 센서를 포함하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 데이터 생성부는,상기 제1 센서를 이용하여 상기 이미지 데이터를 생성하고, 상기 제2 센서를 이용하여 상기 적어도 하나의 객체로부터 고유 색상값 및 윤곽 정보를 추출하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 GT 데이터는,상기 적어도 하나의 객체에 대한 바운딩 박스(bounding box) 정보 및 마스크(mark) 정보를 포함하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0114129-3-제6항에 있어서,상기 데이터 생성부는,상기 이미지 데이터, 상기 바운딩 박스 정보 및 상기 마스크 정보를 합성하여 학습용 데이터셋을 생성하는 것을특징으로 하는 장치."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 데이터 추출부는,상기 적어도 하나의 객체에 대한 고유 식별자를 기반으로 상기 가상의 지도 상에서 상기 적어도 하나의 객체의위치를 추적하여 상기 GT 데이터를 생성하는 것을 특징으로 하는 장치."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "데이터 생성 장치에 의한 데이터 생성 방법에 있어서,가상의 지도 내에서 적어도 하나의 센서의 센싱 환경을 설정하는 단계; 상기 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체(instance)를 포함하는 이미지 데이터를 생성하는 단계; 및상기 이미지 데이터에 대한 GT(ground truth) 데이터를 추출하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 설정하는 단계는,상기 가상의 지도에서의 주간 또는 야간에 해당하는 시각 조건, 및 날씨 조건을 설정하는 단계를 포함하는 것을특징으로 하는 방법."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 설정하는 단계는,상기 적어도 하나의 센서의 위치, 높이 및 회전각을 설정하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 적어도 하나의 센서는,컬러(color) 이미지를 획득하도록 구성되는 제1 센서 및 상기 적어도 하나의 객체에 대한 정보를 획득하도록 구성되는 제2 센서를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 생성하는 단계는,상기 제1 센서를 이용하여 상기 이미지 데이터를 생성하고, 상기 제2 센서를 이용하여 상기 적어도 하나의 객체로부터 고유 색상값 및 윤곽 정보를 추출하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2024-0114129-4-제9항에 있어서,상기 GT 데이터는,상기 적어도 하나의 객체에 대한 바운딩 박스(bounding box) 정보 및 마스크(mark) 정보를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 추출하는 단계 이후에,상기 이미지 데이터, 상기 바운딩 박스 정보 및 상기 마스크 정보를 합성하여 학습용 데이터셋을 생성하는 단계를 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항에 있어서,상기 추출하는 단계는,상기 적어도 하나의 객체에 대한 고유 식별자를 기반으로 상기 적어도 하나의 객체의 위치를 추적하는 단계를포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "컴퓨터 판독 가능 기록매체에 저장되는 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램은, 프로세서에 의해 실행되면,가상의 지도 내에서 적어도 하나의 센서의 센싱 환경을 설정하는 단계와, 상기 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체(instance)를 포함하는 이미지 데이터를 생성하는 단계와,상기 이미지 데이터에 대한 GT(ground truth) 데이터를 추출하는 단계를 포함하는 데이터 생성 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함하는 컴퓨터 프로그램."}
{"patent_id": "10-2023-0006155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "컴퓨터 프로그램이 저장되어 있는 컴퓨터 판독 가능 기록매체로서,상기 컴퓨터 프로그램은, 프로세서에 의해 실행되면,가상의 지도 내에서 적어도 하나의 센서의 센싱 환경을 설정하는 단계와, 상기 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체(instance)를 포함하는 이미지 데이터를 생성하는 단계와,상기 이미지 데이터에 대한 GT(ground truth) 데이터를 추출하는 단계를 포함하는 데이터 생성 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함하는 컴퓨터 판독 가능 기록매체."}
{"patent_id": "10-2023-0006155", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른 인공 신경망의 학습을 위한 데이터를 생성하는 장치는 가상의 지도 내에서 적어도 하나의 센서 의 센싱 환경을 설정하도록 구성되는 환경 설정부, 상기 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하 여 적어도 하나의 객체(instance)를 포함하는 이미지 데이터를 생성하도록 구성되는 데이터 생성부, 및 상기 이 미지 데이터에 대한 GT(ground truth) 데이터를 추출하도록 구성되는 데이터 추출부를 포함할 수 있다."}
{"patent_id": "10-2023-0006155", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 데이터 생성 장치 및 방법에 관한 것으로, 보다 구체적으로 인공 신경망(artificial neural networ k)의 학습에 사용되는 데이터를 생성하는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0006155", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "도시 인구가 증가함에 따라 차량에 의한 교통 체증 및 환경 오염이 심각해지고 있으며, 사고 발생 건수 또한 증 가하고 있다. 하지만, 미래 스마트 도시에서는 교차로 근처에 설치되는 다양한 센서들과 컴퓨터 비전 기반의지능형 교통 통제 시스템을 통해 이러한 문제들이 완화될 것으로 기대된다. 지능형 교통 통제 시스템의 개발을 위해서는 인공 신경망의 학습을 위한 차량 및 보행자 데이터가 필요하지만, 개인 정보 보호 방침으로 인해 각 지역 정부의 허가 없이는 학습용 데이터를 수집하기 어려운 실정이다. 또한, 지역 정부의 허가가 있다 하더라도 실제 사진을 수집하고 GT(ground truth)를 설정하여 인공 신경망의 학습용 데이터셋을 만드는 과정에는 막대한 인력과 비용이 필요하다. 뿐만 아니라, 야간, 우천 등의 환경에서는 물체 의 인식이 어렵기 때문에 야간 환경 및 우천 환경에 대한 데이터셋이 부족하며, 그 GT 정보 또한 부정확하다는 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2022-0144268호, 공개일자 2022년 10월 26일."}
{"patent_id": "10-2023-0006155", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 기술적 과제는 개인 정보에 관한 규제로부터 자유롭게 인공 신경망의 학습을 위한 데이터를 생성할 수 있는 장치 및 방법을 제공함에 있다. 본 발명의 다른 기술적 과제는 적은 비용으로도 누구나 간편하게 인공 신경망의 학습을 위한 데이터를 생성할 수 있는 장치 및 방법을 제공함에 있다. 본 발명의 또 다른 기술적 과제는 고정밀 GT 데이터를 생성할 수 있는 장치 및 방법을 제공함에 있다. 본 발명의 해결하고자 하는 과제는 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 해결하고 자 하는 과제는 아래의 기재로부터 본 발명이 속하는 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0006155", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 인공 신경망의 학습을 위한 데이터를 생성하는 장치는 가상의 지도 내에서 적어 도 하나의 센서의 센싱 환경을 설정하도록 구성되는 환경 설정부, 상기 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체(instance)를 포함하는 이미지 데이터를 생성하도록 구성되는 데이터 생성 부, 및 상기 이미지 데이터에 대한 GT(ground truth) 데이터를 추출하도록 구성되는 데이터 추출부를 포함할 수 있다. 여기서, 상기 환경 설정부는 상기 가상의 지도에서의 주간 또는 야간에 해당하는 시각 조건, 및 날씨 조건을 설 정할 수 있다. 또한, 상기 센싱 환경은 상기 적어도 하나의 센서의 위치, 높이 및 회전각을 포함할 수 있다. 또한, 상기 적어도 하나의 센서는 컬러(color) 이미지를 획득하도록 구성되는 제1 센서 및 상기 적어도 하나의 객체에 대한 정보를 획득하도록 구성되는 제2 센서를 포함할 수 있다. 또한, 상기 데이터 생성부는 상기 제1 센서를 이용하여 상기 이미지 데이터를 생성하고, 상기 제2 센서를 이용 하여 상기 적어도 하나의 객체로부터 고유 색상값 및 윤곽 정보를 추출할 수 있다. 또한, 상기 GT 데이터는 상기 적어도 하나의 객체에 대한 바운딩 박스(bounding box) 정보 및 마스크(mark) 정 보를 포함할 수 있다. 또한, 상기 데이터 생성부는 상기 이미지 데이터, 상기 바운딩 박스 정보 및 상기 마스크 정보를 합성하여 학습 용 데이터셋을 생성할 수 있다. 또한, 상기 데이터 추출부는 상기 적어도 하나의 객체에 대한 고유 식별자를 기반으로 상기 가상의 지도 상에서 상기 적어도 하나의 객체의 위치를 추적하여 상기 GT 데이터를 생성할 수 있다.본 발명의 다른 실시예에 따르면, 데이터 생성 장치에 의한 데이터 생성 방법은 가상의 지도 내에서 적어도 하 나의 센서의 센싱 환경을 설정하는 단계, 상기 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체를 포함하는 이미지 데이터를 생성하는 단계, 및 상기 이미지 데이터에 대한 GT 데이터를 추출하는 단계를 포함할 수 있다. 본 발명의 또 다른 실시예에 따르면, 컴퓨터 판독 가능 기록매체에 저장되는 컴퓨터 프로그램은, 프로세서에 의 해 실행되면, 가상의 지도 내에서 적어도 하나의 센서의 센싱 환경을 설정하는 단계와, 상기 가상의 지도 상에 서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체를 포함하는 이미지 데이터를 생성하는 단계와, 상 기 이미지 데이터에 대한 GT 데이터를 추출하는 단계를 포함하는 데이터 생성 방법을 상기 프로세서가 수행하도 록 하기 위한 명령어를 포함할 수 있다. 본 발명의 또 다른 실시예에 따르면, 컴퓨터 프로그램이 저장되어 있는 컴퓨터 판독 가능 기록매체는, 프로세서 에 의해 실행되면, 가상의 지도 내에서 적어도 하나의 센서의 센싱 환경을 설정하는 단계와, 상기 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체를 포함하는 이미지 데이터를 생성하는 단계와, 상기 이미지 데이터에 대한 GT 데이터를 추출하는 단계를 포함하는 데이터 생성 방법을 상기 프로세서가 수행하 도록 하기 위한 명령어를 포함할 수 있다."}
{"patent_id": "10-2023-0006155", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 가상의 지도를 기반으로 데이터셋을 생성하기 때문에 규정을 지켜가며 사용되어 야 하는, 또는 민감한 데이터를 사용할 시 발생하는 제한들이 없다. 본 발명의 일 실시예에 따르면, 적은 비용으로도 누구나 간편하게 인공 신경망의 학습을 위한 데이터를 생성할 수 있으며, 실측 데이터가 만족시킬 수 없는 조건을 충족시킬 수 있다. 본 발명의 일 실시예에 따르면, 인공 신경망의 학습용 데이터와 함께 그에 대한 GT 데이터를 생성하므로, 인간 의 레이블링(labeling) 작업 없이 고정밀 GT 데이터와 함께 대량의 학습용 데이터셋을 생성할 수 있으며, 데이 터 생성에 필요한 비용이 대폭 감소될 수 있다."}
{"patent_id": "10-2023-0006155", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예들을 참 조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다 양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구 항의 범주에 의해 정의될 뿐이다. 본 문서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다.본 문서 전체에서 어떤 부분이 어떤 구성요소를 ‘포함’한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 본 문서에서 사용되는 ‘부’라는 용어는 소프트웨어 또는 FPGA나 ASIC과 같은 하드웨어 구성요소를 의미 하며, ‘부’는 어떤 역할들을 수행한다. 그렇지만 ‘부’는 소프트웨어 또는 하드웨어에 한정되는 의미는 아 니다. ‘부’는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 ‘부’는 소프트웨어 구성요소들, 객체지향 소프트웨어 구 성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시 저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베 이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 ‘부’들 안에서 제공되는 기 능은 더 작은 수의 구성요소들 및 ‘부’들로 결합되거나 추가적인 구성요소들과 ‘부’들로 더 분리될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략한다. 도 1은 본 발명의 일 실시예에 따른 데이터 생성 장치를 나타내는 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 데이터 생성 장치는 환경 설정부, 데이터 생성부 및 데이터 추출부를 포함한다. 데이터 생성 장치는 프로세서 및 메모리를 포함하는 컴퓨팅 장치로 구현될 수 있다. 일 실시예에 있어서, 환경 설정부, 데이터 생성부 및 데이터 추출부는 소프트 웨어로 구현되어 상기 메모리에 저장될 수 있으며, 상기 프로세서에 의해 수행될 수 있다. 환경 설정부는 가상의 지도를 기반으로 인공 신경망의 학습 환경을 설정하도록 구성될 수 있다. 일 예로 환경 설정부는 가상의 지도에서 시각 조건, 날씨 조건 등 다양한 환경 조건을 설정할 수 있다. 여기서, 상기 시각 조건은 주간 및 야간을 포함할 수 있다. 상기 날씨 조건은 맑음, 흐림, 비, 눈 등을 포함할 수 있다. 예를 들어, 야간의 차량 데이터에 대한 학습용 데이터가 요구되는 경우, 환경 설정부는 가상의 지도 상에 서의 시각 조건을 야간으로 설정하고 차량 객체를 생성한 후 이를 자율 주행 상태로 설정할 수 있다. 다른 예 로, 우천 시의 차량 데이터와 보행자 데이터에 대한 학습용 데이터가 요구되는 경우, 환경 설정부는 가상 의 지도 상에서 날씨 조건을 비로 설정하고, 차량 객체 및 보행자 객체를 생성한 후 이들을 자율 주행 상태로 설정할 수 있다. 한편, 환경 설정부는 가상의 지도 내에서 적어도 하나의 센서의 센싱 환경을 설정하도록 구성될 수 있다. 여기서, 상기 적어도 하나의 센서는 가상의 지도 내에서 구현되는 가상의 센서일 수 있다. 일 예로, 환경 설정 부는 가상의 지도 상에서 학습용 데이터를 생성 또는 캡처(capture)하기 알맞은 위치를 설정하고, 해당 위 치에 적어도 하나의 센서를 위치시킬 수 있다. 그리고, 환경 설정부는 해당 위치에서 뷰(view)를 조정해 가며 해당 센서의 높이 및/또는 회전각을 결정할 수 있다. 여기서, 상기 적어도 하나의 센서는 컬러(color) 이 미지를 획득하도록 구성되는 제1 센서 및 상기 적어도 하나의 객체에 대한 정보를 획득하도록 구성되는 제2 센 서를 포함할 수 있다. 일 예로, 상기 제1 센서는 RGB(red, green, blue) 센서일 수 있으며, 상기 제2 센서는 인스턴스 세그멘테이션(instance segmentation) 센서일 수 있다. 데이터 생성부는 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체를 포함하는 이미지 데이터를 생성하도록 구성될 수 있다. 데이터 생성부에 의해 생성된 이미지 데이터는 학습이 요구 되는 인공 신경망의 입력 데이터로서 사용될 수 있다. 해당 인공 신경망은 상기 이미지 데이터를 입력 받아 상 기 이미지 데이터에 포함된 객체를 분류하는 과정을 통해 학습될 수 있다. 데이터 추출부는 가상의 지도 상에서 데이터 생성부에서 생성된 이미지 데이터에 대한 GT(ground truth) 데이터를 추출하도록 구성될 수 있다. 여기서, 상기 GT 데이터는 상기 적어도 하나의 객체에 대한 바운 딩 박스(bounding box) 정보 및 마스크(mark) 정보를 포함할 수 있다. 상기 바운딩 박스는 해당 객체의 위치를 나타내는데 사용될 수 있다. 상기 마스크 정보는 해당 객체의 분류에 사용될 수 있다. 일 예로서, 데이터 생성부는 상기 제1 센서를 이용하여 인공 신경망의 학습을 위한 이미지 데이터를 생성 할 수 있으며, 데이터 추출부는 상기 제2 센서를 이용하여 가상의 지도 내 적어도 하나의 객체로부터 고유색상값 및/또는 윤곽 정보를 추출할 수 있다. 데이터 추출부는 각 객체의 색상값 및/또는 윤곽 정보를 기 초로 해당 객체의 바운딩 박스 정보와 마스크 정보를 검출할 수 있으며, 이를 기반으로 해당 객체를 검출할 수 있다. 이 때, 데이터 추출부는 각 객체에 대한 고유 식별자를 기반으로 가상의 지도 상에서 각 객체의 위 치를 추적할 수 있으며, 이를 통해 해당 이미지 데이터에 대한 GT 데이터를 생성할 수 있다. 이후, 데이터 생 성부는 상기 이미지 데이터, 상기 바운딩 박스 정보 및 상기 마스크 정보를 합성하여 학습용 데이터를 생 성할 수 있으며, 복수개의 학습용 데이터를 기반으로 학습용 데이터셋을 생성할 수 있다. 도 2 및 도 3은 본 발명의 일 실시예에 따른 데이터 생성 장치가 인공 신경망의 학습을 위한 환경을 설정하는 과정을 나타내는 도면이다. 이하, 일 실시예로서 교차로에서의 교통 상태에 대한 데이터를 생성하기 위한 환경을 설정하는 과정을 도 2 및 도 3을 참조하여 설명한다. 먼저 도 2를 참조하면, 데이터 생성 장치는 교차로를 포함하는 3차원의 가상 지도를 생성하고, 해당 지도 상에 보행자 객체 및 차량 객체를 생성할 수 있다. 그리고 데이터 생성 장치는 실제 CCTV(closed-circuit television) 영상과 유사한 이미지 데이터를 획득하기 위하여 가상 지도 상에서 센서의 위치(좌표)를 결정 할 수 있다. 이 때, 데이터 생성 장치는 학습 목적에 따라 시각 조건, 날씨 조건, 도로 조건 등 다양한 환경 조건을 설정할 수 있다. 예를 들어, 데이터 생성 장치는 도로 상에 환경적 용인이 작용하지 않도록 날씨 조건 을 ‘흐림’또는 ‘맑음’으로 설정할 수 있으며, 한밤중의 빛 조건이 재현되도록 시각 조건을 ‘야간’으로 설 정할 수 있다. 그리고 데이터 생성 장치는 충돌 사고와 교통 체증이 최소화되도록 보행자 객체의 개수 및 차량 객체의 개수를 설정할 수 있다. 한편, 데이터 생성 장치는 가상의 지도 상에서 센서의 높이 및 회전각을 결정할 수 있다. 여기서, 회전각 은 요(yaw), 피치(pitch) 및 롤(roll)을 포함할 수 있다. 데이터 생성 장치는 학습용 데이터셋을 생성함에 있 어서 센서의 높이와 회전각을 조절함으로써 다양한 시점의 이미지 데이터를 획득할 수 있다. 도 4는 본 발명의 일 실시예에 따른 이미지 데이터를 나타내는 도면이고, 도 5는 본 발명의 일 실시예에 따른 GT 데이터를 나타내는 도면이다. 도 4 및 도 5를 참조하면, 일 예로서 도 4에는 데이터 생성 장치가 가상의 지도 상에 배치된 RGB 센서를 기반으 로 생성한 이미지 데이터가 도시되어 있고, 도 5에는 데이터 생성 장치가 상기 RGB 센서와 동일한 위치, 높이 및 회전각으로 배치된 인스턴스 세그멘테이션 센서를 기반으로 생성한 GT 데이터가 도시되어 있다. 도 4 및 도 5와 같은 이미지 데이터 및 GT 데이터는 인공 신경망의 야간 도로 교통 상황에 대한 학습을 위해 사용될 수 있 다. 도 5를 참조하면, GT 데이터에서 각 차량 객체와 각 보행자 객체는 각각 고유한 색상값을 가진다. 데이터 생성 장치는 각 객체로부터 고유 색상값을 추출할 수 있으며, 이는 해당 객체의 고유 식별자로서 사용될 수 있다. 데이터 생성 장치는 각 객체의 고유 식별자를 기반으로 해당 객체의 위치를 추적할 수 있다. 데이터 생성 장치는 인스턴스 세그멘테이션 센서를 기반으로 이러한 고유 색상값 이외에도 차량 객체 및/또는 보행자 객체의 형태와 위치(또는 배치)를 나타내는 윤곽 정보를 획득할 수 있다. 2차원 상에서 사물 검출은 각 객체에 대한 바운딩 박스를 얻어내는 것을 의미한다. 데이터 생성 장치는 인스턴스 세그멘테이션 센서로부터 차량 객체와 보행자 객체의 윤곽 정보를 획득한 후, 바운딩 박스에 대한 정보(예를 들어, 바운딩 박스의 좌측 상단 꼭짓점의 x, y 좌표 및 우측 하단 꼭짓점의 x, y 좌표)를 계산할 수 있다. 도 6은 본 발명의 일 실시예에 따른 이미지 데이터와 GT 데이터의 합성 데이터를 나타내는 도면이다. 본 발명의 일 실시예에 따른 데이터 생성 장치는 이미지 데이터 내 각 객체에 대한 마스크를 해당 이미지 데이 터에 합성하여 도 6에 도시된 것과 같은 합성 데이터를 생성할 수 있다. 이러한 합성 데이터는 고정밀 GT 정보 를 포함하며 실제 환경에서 획득된 데이터를 모방한다. 따라서 본 발명의 일 실시예에 따른 데이터 생성 장치 에 의해 해성되는 합성 데이터는 인공 신경망의 학습용 데이터로 활용되거나 수식으로 이루어진 가설들의 참/거 짓을 밝히는데 사용될 수 있다. 또한, 합성 데이터에는 규정을 지켜가며 사용되어야 하거나 또는 민감한 데이 터를 사용할 시 발생하는 제한들이 없으며, 실제 데이터가 만족할 수 없는 조건을 만족시킬 수 있으므로, 본 발 명의 일실시예에 따른 데이터 생성 장치는 학습용 데이터를 생성하는데 필요한 비용을 대폭 감소시킬 수 있다. 도 7은 본 발명의 일 실시예에 따른 데이터 생성 방법을 나타내는 도면이다. 도 7을 참조하면, 본 발명의 일 실시예에 따른 데이터 생성 장치 가상의 지도 내에서 인공 신경망의 학습 환경 을 설정할 수 있다(S700). 일 예로 데이터 생성 장치는 인공 신경망을 학습시키고자 하는 환경에 맞게 가상의 지도 내에서 시각 조건, 날씨 조건 등을 설정할 수 있다. 그리고, 데이터 생성 장치는 가상의 지도 내에서 적 어도 하나의 센서의 센싱 환경을 설정할 수 있다. 일 예로, 데이터 생성 장치는 가상의 지도 상에서 적어도 하 나의 센서의 위치를 설정하고, 해당 위치에서 뷰를 조정해가며 해당 센서의 높이 및/또는 회전각을 결정할 수 있다. 여기서, 상기 적어도 하나의 센서는 컬러 이미지를 획득하기 위한 RGB 센서 및 상기 적어도 하나의 객체 에 대한 정보를 획득하기 위한 인스턴스 세그멘테이션 센서를 포함할 수 있다. 이후, 데이터 생성 장치는 가상의 지도 상에서 상기 적어도 하나의 센서를 이용하여 적어도 하나의 객체를 포함 하는 이미지 데이터를 생성하고(S710), 해당 이미지 데이터에 대한 GT 데이터를 추출할 수 있다(S720). 여기서, 상기 GT 데이터는 특정 객체에 대해 인공 신경망이 예측 및/또는 분류하길 바라는 정답으로서 상기 적 어도 하나의 객체에 대한 바운딩 박스 정보 및 마스크 정보를 포함할 수 있다. 상기 GT 데이터는 레이블 (label)을 포함할 수 있다. 일 실시예로서, 데이터 생성 장치는 RGB 센서를 이용하여 인공 신경망의 학습을 위한 이미지 데이터(컬러 이미 지)를 생성할 수 있으며, 인스턴스 세그멘테이션 센서를 이용하여 가상의 지도에 포함된 객체들로부터 고유 색 상값 및/또는 윤곽 정보를 추출할 수 있다. 또한, 데이터 생성 장치는 각 객체의 고유 색상값 및/또는 윤곽 정 보를 기초로 해당 객체의 바운딩 박스 정보와 마스크 정보를 검출할 수 있으며, 이를 기반으로 해당 객체를 검 출할 수 있다. 상기 고유 색상값은 해당 객체의 고유 식별자로 사용될 수 있으며, 데이터 생성 장치는 각 객체 에 대한 고유 식별자를 기반으로 가상의 지도 상에서 해당 객체의 위치를 추적할 수 있다. 데이터 생성 장치는 상기 이미지 데이터와 상기 GT 데이터를 합성하여 학습용 데이터를 생성할 수 있으며, 이러한 과정을 통해 생성 된 학습용 데이터셋을 사용자에게 제공할 수 있다. 한편, 전술한 실시예에 따른 데이터 생성 장치가 수행하는 데이터 생성 방법에 포함된 각각의 단계는, 이러한 단계를 프로세서가 수행하도록 하기 위한 명령어를 포함하여 기록매체에 기록된 컴퓨터 프로그램으로 구현될 수 있다. 또한, 전술한 실시예에 따른 데이터 생성 장치가 수행하는 데이터 생성 방법에 포함된 각각의 단계는, 이러한 단계를 프로세서가 수행하도록 하기 위한 명령어를 포함하는 컴퓨터 프로그램이 기록된 컴퓨터 판독 가능한 기 록매체에서 구현될 수 있다. 본 발명에 첨부된 각 흐름도의 각 단계의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수도 있다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도의 각 단계에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이 들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데 이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 기록매체에 저장되는 것도 가능 하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 기록매체에 저장된 인스트럭션들은 흐름도의 각 단계에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되는 것도 가능하므로, 컴퓨 터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름 도의 각 단계에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 단계는 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실시예들에서는 단계들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 단계 들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 단계들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 품질에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보 호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다.부호의 설명 100: 데이터 생성 장치 110: 환경 설정부 120: 데이터 생성부 130: 데이터 추출부"}
{"patent_id": "10-2023-0006155", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 데이터 생성 장치를 나타내는 도면이다. 도 2 및 도 3은 본 발명의 일 실시예에 따른 데이터 생성 장치가 인공 신경망의 학습을 위한 환경을 설정하는 과정을 나타내는 도면이다. 도 4는 본 발명의 일 실시예에 따른 이미지 데이터를 나타내는 도면이다. 도 5는 본 발명의 일 실시예에 따른 GT 데이터를 나타내는 도면이다. 도 6은 본 발명의 일 실시예에 따른 이미지 데이터와 GT 데이터의 합성 데이터를 나타내는 도면이다. 도 7은 본 발명의 일 실시예에 따른 데이터 생성 방법을 나타내는 도면이다."}
