{"patent_id": "10-2019-0153771", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0064959", "출원번호": "10-2019-0153771", "발명의 명칭": "플랫폼 서버를 통해 제공되는 광고를 관리하는 광고 관리 장치 및 광고 관리 장치의 동작 방", "출원인": "주식회사 넥슨코리아", "발명자": "이도호"}}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "소정 게임으로부터 수집된 복수의 사용자의 로그 데이터에 기초하여, 상기 소정 게임에 대한 적어도 하나의 그룹을 설정하는 단계;상기 적어도 하나의 그룹에 제공할 광고 정보를 등록하는 단계;광고를 제공할 수 있는 복수의 플랫폼 서버로, 상기 적어도 하나의 그룹 별로 상기 광고 정보의 제공을 요청하는 단계;상기 복수의 플랫폼 서버로부터 상기 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 획득하는 단계; 및상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로 등록된 상기 광고 정보의 관리를 수행하는 단계를포함하는, 광고 관리 장치의 동작 방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 소정 게임에 대한 적어도 하나의 그룹을 설정하는 단계는,상기 소정 게임에서 사용자의 접속률, 상기 소정 게임에서 사용자의 접속 시간, 상기 소정 게임에서 사용자가구매한 아이템, 구매 금액, 상기 소정 게임에서 사용자의 게임 레벨, 캐릭터 중에서 그룹 설정에 이용되는 적어도 하나의 파라미터를 결정하는 단계; 및상기 복수의 사용자의 로그 데이터로부터 획득된 상기 복수의 사용자에 대한 상기 적어도 하나의 파라미터의 값에 기초하여, 상기 소정 게임에 대한 적어도 하나의 그룹을 설정하는 단계를 포함하는, 광고 관리 장치의 동작방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 적어도 하나의 그룹에 제공할 광고 정보를 등록하는 단계는,제1 그룹 내의 사용자들의 로그 데이터에 기초하여, 상기 제1 그룹 내의 사용자들에 대한 상기 소정 게임의 활성도 증가와 관련된 제1 광고를 결정하는 단계; 및상기 제1 그룹에 대해, 상기 제1 광고 및 상기 제1 광고의 집행 조건을 포함하는 제1 광고 정보를 등록하는 단계를 포함하는, 광고 관리 장치의 동작 방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 적어도 하나의 그룹을 설정하거나, 상기 적어도 하나의 그룹의 광고를 등록하는 데에 이용되는 정보를 입력 받는 사용자 인터페이스를 표시하는 단계를 더 포함하는, 광고 관리 장치의 동작 방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 복수의 플랫폼 서버로, 상기 적어도 하나의 그룹 별로 상기 광고 정보의 제공을 요청하는 단계는,제1 암호화 방식에 따라 제1 그룹의 사용자 정보를 암호화하는 단계; 및상기 암호화된 제1 그룹의 사용자 정보 및 상기 제1 그룹의 사용자에게 제공될 제1 광고 정보를 상기 복수의 플공개특허 10-2021-0064959-3-랫폼 서버로 전송하는 단계를 포함하는, 광고 관리 장치의 동작 방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 복수의 플랫폼 서버로, 상기 적어도 하나의 그룹 별로 상기 광고 정보의 제공을 요청하는 단계는,상기 복수의 플랫폼 서버로, 상기 제1 암호화 방식에 따라 플랫폼 서버 내의 사용자 정보가 암호화된 정보와 상기 암호화된 제1 그룹의 사용자 정보를 비교한 결과에 기초하여, 상기 제1 그룹의 사용자들에 매핑된 사용자들에게 상기 제1 광고 정보의 제공을 요청하는 단계를 더 포함하는, 광고 관리 장치의 동작 방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 복수의 플랫폼 서버로부터 상기 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 획득하는 단계는,상기 복수의 플랫폼 서버로부터, 적어도 하나의 그룹 내의 사용자들에게 소정 광고의 송출로 모니터링 된 상기피드백 정보를 획득하는 단계; 및상기 적어도 하나의 그룹 별로 상기 피드백 정보를 표시하는 단계를 포함하는, 광고 관리 장치의 동작 방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 피드백 정보는,소정 플랫폼 서버에서 제공된 소정 광고의 클릭 횟수, 상기 소정 광고에 대응되는 액션 횟수, 상기 소정 광고에의한 소정 게임의 애플리케이션 설치 횟수, 및 상기 소정 플랫폼 서버에서 발생된 광고 비용 중 적어도 하나의정보를 포함하는, 광고 관리 장치의 동작 방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로 등록된 상기 광고 정보의 관리를 수행하는단계는,상기 광고 정보가 송출된 이후에, 상기 적어도 하나의 그룹에 속한 사용자의 로그 데이터 및 상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로, 상기 소정 게임에 대한 광고의 효율을 판단하는 데에 이용되는 성과 정보를 획득하는 단계; 및 상기 적어도 하나의 그룹 별로, 상기 성과 정보에 기초하여, 상기 광고 정보의 관리를 수행하는 단계를 포함하는, 광고 관리 장치의 동작 방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 적어도 하나의 그룹 별로, 상기 성과 정보에 기초하여, 상기 광고 정보의 관리를 수행하는 단계는,제1 그룹에 제공된 제1 광고에 대한 제1 성과 파라미터의 값이 소정 기준값보다 낮으면, 상기 제1 광고를 중단또는 제2 광고로 교체하는 단계; 및상기 제1 그룹에 제공된 상기 제1 광고에 대한 상기 제1 성과 파라미터의 값이 상기 소정 기준값보다 높으면,상기 제1 광고를 유지하는 단계를 포함하는, 광고 관리 장치의 동작 방법."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "소정 게임으로부터 수집된 복수의 사용자의 로그 데이터에 기초하여, 상기 소정 게임에 대한 적어도 하나의 그룹을 설정하는 단계;공개특허 10-2021-0064959-4-상기 적어도 하나의 그룹에 제공할 광고 정보를 등록하는 단계;광고를 제공할 수 있는 복수의 플랫폼 서버로, 상기 적어도 하나의 그룹 별로 상기 광고 정보의 제공을 요청하는 단계;상기 복수의 플랫폼 서버로부터 상기 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 획득하는 단계; 및상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로 등록된 상기 광고 정보의 관리를 수행하는 단계를포함하는, 광고 관리 장치의 동작 방법을 광고 관리 장치와 결합되어 실행시키기 위해 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "소정 게임으로부터 수집된 복수의 사용자의 로그 데이터에 기초하여, 상기 소정 게임에 대한 적어도 하나의 그룹을 설정하는 단계;상기 적어도 하나의 그룹에 제공할 광고 정보를 등록하는 단계;광고를 제공할 수 있는 복수의 플랫폼 서버로, 상기 적어도 하나의 그룹 별로 상기 광고 정보의 제공을 요청하는 단계;상기 복수의 플랫폼 서버로부터 상기 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 획득하는 단계; 및상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로 등록된 상기 광고 정보의 관리를 수행하는 단계를포함하는, 광고 관리 장치의 동작 방법을 광고 관리 장치에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "광고를 제공하는 복수의 플랫폼 서버와 통신을 수행하는 통신 장치;스토리지;사용자 인터페이스 장치;프로세서; 및상기 프로세서에 의해 실행 가능한 명령어들을 저장하는 메모리를 포함하고,상기 프로세서는, 상기 명령어들을 실행함으로써,소정 게임으로부터 수집된 복수의 사용자의 로그 데이터에 기초하여, 상기 소정 게임에 대한 적어도 하나의 그룹을 설정하고,상기 적어도 하나의 그룹에 제공할 광고 정보를 등록하고,상기 복수의 플랫폼 서버로, 상기 적어도 하나의 그룹 별로 상기 광고 정보의 제공을 상기 통신 장치를 통해 요청하고,상기 복수의 플랫폼 서버로부터 상기 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 상기 통신 장치를통해 획득하고,상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로 등록된 상기 광고 정보의 관리를 수행하는, 광고관리 장치."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 프로세서는, 상기 명령어들을 실행함으로써,상기 소정 게임에서 사용자의 접속률, 상기 소정 게임에서 사용자의 접속 시간, 상기 소정 게임에서 사용자가구매한 아이템, 구매 금액, 상기 소정 게임에서 사용자의 게임 레벨, 캐릭터 중에서 그룹 설정에 이용되는 적어도 하나의 파라미터를 결정하고,공개특허 10-2021-0064959-5-상기 복수의 사용자의 로그 데이터로부터 획득된 상기 복수의 사용자에 대한 상기 적어도 하나의 파라미터의 값에 기초하여, 상기 소정 게임에 대한 적어도 하나의 그룹을 설정하는, 광고 관리 장치."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 프로세서는, 상기 명령어들을 실행함으로써,제1 그룹 내의 사용자들의 로그 데이터에 기초하여, 상기 제1 그룹 내의 사용자들에 대한 상기 소정 게임의 활성도 증가와 관련된 제1 광고를 결정하고,상기 제1 그룹에 대해, 상기 제1 광고 및 상기 제1 광고의 집행 조건을 포함하는 제1 광고 정보를 등록하는, 광고 관리 장치."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 프로세서는, 상기 명령어들을 실행함으로써,상기 사용자 인터페이스 장치를 통해, 상기 적어도 하나의 그룹을 설정하거나, 상기 적어도 하나의 그룹의 광고를 등록하는 데에 이용되는 정보를 입력 받는 사용자 인터페이스를 표시하는, 광고 관리 장치."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서,상기 프로세서는, 상기 명령어들을 실행함으로써,제1 암호화 방식에 따라 제1 그룹의 사용자 정보를 암호화하는 단계; 및상기 통신 장치를 통해 상기 암호화된 제1 그룹의 사용자 정보 및 상기 제1 그룹의 사용자에게 제공될 제1 광고정보를 상기 복수의 플랫폼 서버로 전송하는, 광고 관리 장치."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 프로세서는, 상기 명령어들을 실행함으로써,상기 복수의 플랫폼 서버로, 상기 제1 암호화 방식에 따라 플랫폼 서버 내의 사용자 정보가 암호화된 정보와 상기 암호화된 제1 그룹의 사용자 정보를 비교한 결과에 기초하여, 상기 제1 그룹의 사용자들에 매핑된 사용자들에게 상기 제1 광고 정보의 제공을 요청하는, 광고 관리 장치."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서,상기 프로세서는, 상기 명령어들을 실행함으로써,상기 복수의 플랫폼 서버로부터, 적어도 하나의 그룹 내의 사용자들에게 소정 광고의 송출로 모니터링 된 상기피드백 정보를 상기 통신 장치를 통해 획득하고,상기 사용자 인터페이스 장치를 통해 상기 적어도 하나의 그룹 별로 상기 피드백 정보를 표시하는, 광고 관리장치."}
{"patent_id": "10-2019-0153771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항에 있어서,상기 프로세서는, 상기 명령어들을 실행함으로써,상기 광고 정보가 송출된 이후에, 상기 적어도 하나의 그룹에 속한 사용자의 로그 데이터 및 상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로, 상기 소정 게임에 대한 광고의 효율을 판단하는 데에 이용되는 성공개특허 10-2021-0064959-6-과 정보를 획득하고,상기 적어도 하나의 그룹 별로, 상기 성과 정보에 기초하여, 상기 광고 정보의 관리를 수행하는, 광고 관리 장치."}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "소정 게임으로부터 수집된 복수의 사용자의 로그 데이터에 기초하여, 상기 소정 게임에 대한 적어도 하나의 그룹 을 설정하는 단계; 상기 적어도 하나의 그룹에 제공할 광고 정보를 등록하는 단계; 광고를 제공할 수 있는 복수 의 플랫폼 서버로, 상기 적어도 하나의 그룹 별로 상기 광고 정보의 제공을 요청하는 단계; 상기 복수의 플랫폼 서버로부터 상기 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 획득하는 단계; 및 상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로 등록된 상기 광고 정보의 관리를 수행하는 단계를 포함하는, 광고 관리 장치의 동작 방법이 제공된다."}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "광고를 관리하는 광고 관리 장치 및 광고 관리 장치의 동작 방법에 관한 것이다."}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "게임 업체나 퍼블리싱 업체는 소정 게임과 관련된 광고를 사용자들에게 제공한다. 사용자들은 광고에 포함된 이벤트를 참여할 수 있다. 그러나, 모든 사용자들에게 일률적인 광고가 제공된다면, 광고는 무용지물이 될 수 있다. 소정 게임의 사용자에게 적합한 광고를 제공하고, 게임 업체나 퍼플리싱 업체도 광고로 인한 수익을 증대시키기 위해 광고를 보다 효율적으로 관리하는 기술이 요구된다."}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "플랫폼 서버를 통해 소정 게임에 대해 설정된 그룹의 사용자들에게 타겟팅된 소정 광고를 제공하고자 한다. 플랫폼 서버를 통해 제공된 광고의 피드백 정보에 기초하여, 광고 관리 장치에서 광고 관리를 효율적으로 하고 자 한다. 광고 관리 장치에서 소정 게임 내의 소정 그룹에 대한 광고 설정, 광고 제공, 광고 관리를 효율적으로 하고자 한다."}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일측에 따르면, 소정 게임으로부터 수집된 복수의 사용자의 로그 데이터에 기초하여, 상기 소정 게임에 대한 적 어도 하나의 그룹을 설정하는 단계; 상기 적어도 하나의 그룹에 제공할 광고 정보를 등록하는 단계; 광고를 제 공할 수 있는 복수의 플랫폼 서버로, 상기 적어도 하나의 그룹 별로 상기 광고 정보의 제공을 요청하는 단계; 상기 복수의 플랫폼 서버로부터 상기 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 획득하는 단계; 및 상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로 등록된 상기 광고 정보의 관리를 수행하는 단계를 포함하는, 광고 관리 장치의 동작 방법이 제공된다. 다른 일측에 따르면, 상기 광고 관리 장치의 동작 방법을 광고 관리 장치와 결합되어 실행시키기 위해 매체에 저장된 컴퓨터 프로그램이 제공된다. 또 다른 일측에 따르면, 상기 광고 관리 장치의 동작 방법을 광고 관리 장치에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체가 제공된다. 일측에 따르면, 광고를 제공하는 복수의 플랫폼 서버와 통신을 수행하는 통신 장치; 스토리지; 사용자 인터페이 스 장치; 프로세서; 및 상기 프로세서에 의해 실행 가능한 명령어들을 저장하는 메모리를 포함하고, 상기 프로 세서는, 상기 명령어들을 실행함으로써, 소정 게임으로부터 수집된 복수의 사용자의 로그 데이터에 기초하여, 상기 소정 게임에 대한 적어도 하나의 그룹을 설정하고, 상기 적어도 하나의 그룹에 제공할 광고 정보를 등록하 고, 상기 복수의 플랫폼 서버로, 상기 적어도 하나의 그룹 별로 상기 광고 정보의 제공을 상기 통신 장치를 통 해 요청하고, 상기 복수의 플랫폼 서버로부터 상기 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 상기 통신 장치를 통해 획득하고, 상기 피드백 정보에 기초하여, 상기 적어도 하나의 그룹 별로 등록된 상기 광고 정 보의 관리를 수행하는, 광고 관리 장치가 제공된다."}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "플랫폼 서버를 통해 소정 게임에 대해 설정된 그룹의 사용자들에게 타겟팅된 소정 광고를 제공할 수 있다. 플랫폼 서버를 통해 제공된 광고의 피드백 정보에 기초하여, 광고 관리 장치에서 광고 관리를 수행함으로써, 광 고의 효율을 높일 수 있다. 광고 관리 장치에서 소정 게임 내의 소정 그룹에 대한 광고 설정, 광고 제공, 광고 관리를 효율적으로 할 수 있 다."}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 다양한 실시예들을 상세히 설명한다. 이하에서 설명되는 실시예들은 여러 가지 상 이한 형태로 변형되어 실시될 수도 있다. 실시예들의 특징을 보다 명확히 설명하기 위하여 이하의 실시예들이"}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 널리 알려져 있는 사항들에 관해서 자세한 설명은 생략한다. 한편, 본 명세서에서 어떤 구성이 다른 구성과 \"연결\"되어 있다고 할 때, 이는 '직접적으로 연결'되어 있는 경 우뿐 아니라, '그 중간에 다른 구성을 사이에 두고 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성이 다른 구성을 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한, 그 외 다른 구성을 제외하는 것이 아니라 다른 구성들 더 포함할 수도 있다는 것을 의미한다. 또한, 본 명세서에서 사용되는 '제 1' 또는 '제 2' 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설 명하는데 사용할 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로만 사용된다. 명세서 전체에서, \"게임 서버\"는 사용자의 전자 장치로 게임 서비스를 제공하고, 게임 서비스를 관리하기 위해 이용되는 장치를 의미할 수 있다. 또한, \"게임 서버\"는 특수 목적 컴퓨터(Special-purpose Computer), 범용 컴 퓨터(General-purpose Computer), 슈퍼 컴퓨터(Supercomputer), 대형 컴퓨터(Mainframe Computer) 등으로 구현 될 수 있고, 상기 예시에 제한되지 않는다. 명세서 전체에서, \"광고 관리 장치\"는 소정 기준에 따라 분류된 사용자들에게 타겟팅된 광고를 설정하고, 외부 의 플랫폼 서버를 통해 사용자들에게 광고를 제공하고, 플랫폼 서버로부터 획득된 피드백 정보에 기초하여 광고 관리를 하는 장치를 의미할 수 있다. 명세서 전체에서, \"플랫폼 서버\"는 게임 서버 및 광고 관리 장치의 외부 장치이고, 사용자에게 소정 서비스를 제공하는 서버일 수 있다. 명세서 전체에서, \"로그 데이터\"는 사용자가 소정 게임 내에서 활동한 기록을 포함하는 데이터 일 수 있다. 예 를 들면, \"로그 데이터\"에는, 사용자가 소정 게임에 로그인 한 시점, 사용자가 소정 게임 내에서 아이템을 구매, 누적 구매 금액, 소정 게임 내에서 사용자의 플레이 이력, 소정 게임 내에서 사용자가 달성한 스테이지 또는 퀘스트, 사용자의 게임 레벨, 사용자가 소정 게임에 로그 아웃 한 시점 등에 대한 정보 또는 데이터가 포 함될 수 있다. 명세서 전체에서, \"광고 정보\"는 광고 이름, 광고의 시작 일시, 광고 종료 일시, 광고 비용 중 적어도 하나의 정보일 수 있다. 명세서 전체에서, \"피드백 정보\"는, 플랫폼 서버에서 광고가 사용자에게 송출됨에 따라 사용자의 행위가 모니터 링 된 정보일 수 있다. 예를 들면, 피드백 정보에는, 소정 플랫폼 서버에서 제공된 소정 광고의 클릭 횟수, 소 정 광고에 대응되는 액션 횟수, 소정 광고에 의한 소정 게임의 애플리케이션 설치 횟수, 및 소정 플랫폼 서버에 서 발생된 광고 비용 중 적어도 하나의 정보가 포함될 수 있다. 명세서 전체에서, \"성과 정보\"는, 소정 게임에 대한 광고의 효율을 판단하는 데에 이용되는 정보일 수 있다. 도 1은 일실시예에 따라, 서버 및 클라이언트를 포함하는 온라인 게임 제공 시스템을 도시한다. 일 실시예에 따른 온라인 게임 제공 시스템은 도 1 에 도시된 바와 같이 서버 와 복수의 클라이언트들 (2000a, 2000b, 2000c, 2000d, 2000e, 및 2000f) 를 포함할 수 있다. 서버 는 네트워크를 통해 게임을 서비스함으로써, 복수의 클라이언트들 (2000a, 2000b, 2000c, 2000d, 2000e, 및 2000f) 에게 게임을 제공할 수 있다. 도 1 은 사용자에 의해 사용되는 클라이언트의 예들로서, 데스크톱 컴퓨터 (2000a), 태블릿 (2000b), 휴대폰 (2000c), 노트북 (2000d), 스마트폰 (2000e), 및 텔레비전 (2000f) 을 도시하지만, 클라이언트는 이에 제한되지 않고 PDA (Personal Digital Assistants), PMP (Portable Multimedia Player), 네비게이션, MP3 플레이어, 디 지털 카메라, 냉장고, 세탁기, 청소기 등의 다양한 전자 디바이스를 포함할 수 있다. 복수의 클라이언트들 (2000a, 2000b, 2000c, 2000d, 2000e, 및 2000f) 에서 게임이(예를 들면, 온라인 게임) 실행될 수 있다. 게임을 실행하기 위해, 프로그램, 예를 들어, 애플리케이션, 또는 런처 (launcher) 가 클라이 언트들 (2000a, 2000b, 2000c, 2000d, 2000e, 및 2000f) 에 설치될 수 있으나, 이에 제한되지 않는다. 사용자 들은 클라이언트들 (2000a, 2000b, 2000c, 2000d, 2000e, 및 2000f) 에 설치된 프로그램을 실행하여, 서버 에 의해 제공되는 게임을 즐길 수 있다. 후술하는 본 개시의 다양한 실시예들은 게임을 실행시키기 위 한 프로그램 내에서 구현되거나, 그 프로그램과는 별도의 프로그램을 통해 구현될 수 있다. 서버 는 게임 제공업자에 의해 운영될 수 있고, 서버 는 단일 서버, 서버의 집합체, 및 클라우드 서버를 포함할 수 있으나, 이에 제한되지 않는다. 서버 는 사용자들에게 게임을 제공하고, 사용자들의 데이터를 저장하는 데이터 베이스를 포함할 수 있다. 또한, 서버 는 결제 이벤트를 생성 및 처리하는 결제 서버 또는 지불 서버를 더 포함할 수 있다. 결제 서버 또는 지불 서버는 서버 와 별개의 서버일 수 있고, 서버 및 클라이언트들 (2000a, 2000b, 2000c, 2000d, 2000e, 및 2000f) 간의 결제나 지불을 매개할 수도 있다. 서버 는 사용자 데이터를 저장하고 관리하는 데이터베이스 (database: DB) 서버를 더 포함할 수 있고, DB 서버는 서버 와 별개의 서버일 수 있다. 서버 에서는 게임을 서비스하기 위한 프로그램이 구동될 수 있다. 후술하는 본 개시의 다양한 실시예들 은 게임을 서비스하기 위한 프로그램 내에서 구현되거나, 그 프로그램과는 별도의 프로그램을 통해 구현될 수 있다. 네트워크는 소정의 통신 방식을 이용하여 설립 (또는 형성) 된 연결을 의미하고, 클라이언트들 (2000a, 2000b, 2000c, 2000d, 2000e, 및 2000f) 사이 또는 클라이언트들 (2000a, 2000b, 2000c, 2000d, 2000e, 및 2000f) 과 서버 사이에서 데이터를 전달하는 소정의 통신 수단을 통해 연결된 통신망을 의미할 수 있다. 통신 수단은 소정의 통신 규격, 소정의 주파수 대역, 소정의 프로토콜 또는 소정의 채널을 통한 통신, 근거리 통신, 원거리 통신, 무선 통신 및 유선 통신을 포함한다. 예를 들어, 통신 수단은 블루투스, BLE, Wi-Fi, Zigbee, 3G, LTE, 초음파를 통한 통신 수단 등을 포함할 수 있으나, 이에 제한되지 않는다. 근거리 통신 수단은, 통신을 수행하는 디바이스들이 소정의 범위 내에 있을 때에만 서로 통신이 가능한 통신 수 단을 의미할 수 있고, 예를 들어, 블루투스 및 NFC 를 포함할 수 있으나, 이에 제한되지 않는다. 원거리 통신 수단은, 통신을 수행하는 디바이스들이 거리와 관계 없이 서로 통신이 가능한 통신 수단을 의미할 수 있다. 예를 들어, 원거리 통신 수단은 AP와 같은 중계기를 통해 통신을 수행하는 두 디바이스가 소정의 거 리 이상일 때에도 통신할 수 있는 수단, 및 문자 전송과 전화 통화에 사용되는 셀룰러 네트워크 (3G, LTE) 를 이용한 통신 수단을 포함할 수 있으나, 이에 제한되지 않는다. 서버 가 네트워크를 이용하여 온라인 게임을 서비스하는 과정에서, 임의의 통신 수단을 통해 서버 와 클라이언트들 (2000a, 2000b, 2000c, 2000d, 2000e, 및 2000f) 간의 통신이 수행될 수 있다. 온라인 게임은 RPG (Role Playing Game), TRPG (Tabletop RPG), MMORPG (Massively Multiplayer Online RPG), MOBA (Multiplayer Online Battle Arena), AOS (Aeon of Strife), RTS (Real Time Strategy), FPS (First- person shooter), TCG (Trading Card Game), CCG (Collectible Card Game), 스포츠, 대전격투 등 다양한 장르 의 게임일 수 있으나, 이에 제한되지 않는다. 온라인 게임은 사용자들 간의 대전 또는 사용자와 컴퓨터 (예를 들면, 인공지능) 과의 대전으로 진행될 수 있으나, 이에 제한되지 않고, 다양한 형태로 구현될 수 있다. 도 1 에 도시된 온라인 게임 제공 시스템은 온라인 플랫폼 제공 시스템으로서도 기능할 수 있다. 한편, 도 1에 도시된 서버는 도 2 내지 도 12에서 설명하는 게임 서버 와 대응될 수 있다. 도 2는 일실시예에 따라, 광고 관리 장치가 소정 그룹의 사용자에게 소정 광고가 제공될 수 있도록 광고 정 보를 플랫폼 서버로 전송하고, 플랫폼 서버로부터 수신된 피드백 정보에 따라 광고 정보를 관리하는 방법을 설 명하기 위한 개념도이다. 도 2를 참고하면, 단계 S210에서, 광고 관리 장치는 게임 서버로부터 소정 게임의 플레이 이력이 있는 복수의 사용자의 로그 데이터를 수신할 수 있다. 단계 S220에서, 광고 관리 장치는 복수의 사용자의 로그 데이터에 기초하여, 소정 게임에 대한 적어도 하나 의 그룹을 설정할 수 있다. 단계 S230에서, 광고 관리 장치는 적어도 하나의 그룹에 제공할 광고 정보를 등록할 수 있다. 단계 S240에서, 광고 관리 장치는 제1 플랫폼 서버(30-1), 제2 플랫폼 서버(30-2), 제3 플랫폼 서버(30- 3)로, 적어도 하나의 그룹별로 등록된 광고 정보의 제공을 요청할 수 있다. 단계 S250에서, 광고 관리 장치는 제1 플랫폼 서버(30-1), 제2 플랫폼 서버(30-2), 제3 플랫폼 서버(30- 3)로부터, 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 수신할 수 있다. 단계 S260에서, 광고 관리 장치는 피드백 정보에 기초하여, 적어도 하나의 그룹 별로 등록된 광고 정보의 관리를 수행할 수 있다. 도 3은 일실시예에 따라, 광고 관리 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 3을 참고하면, 단계 S310에서, 광고 관리 장치는 소정 게임으로부터 수신된 복수의 사용자의 로그 데이 터에 기초하여, 소정 게임에 대한 적어도 하나의 그룹을 설정할 수 있다. 예를 들면, 광고 관리 장치는 소정 게임에서 사용자의 접속률, 소정 게임에서 사용자의 접속 시간, 소정 게 임에서 사용자가 구매한 아이템, 구매 금액, 소정 게임에서 사용자의 게임 레벨, 캐릭터 중에서 그룹 설정에 이 용되는 적어도 하나의 파라미터를 결정할 수 있다.광고 관리 장치는 복수의 사용자의 로그 데이터로부터 복수의 사용자에 대한 적어도 하나의 파라미터의 값 을 획득할 수 있다. 광고 관리 장치는 복수의 사용자에 대한 적어도 하나의 파라미터의 값에 기초하여, 소 정 게임에 대한 적어도 하나의 그룹을 설정할 수 있다. 복수의 사용자들을 소정 기준에 따라 적어도 하나의 그 룹으로 분류함으로써, 적어도 하나의 그룹 별로 타겟팅된 광고를 제공할 수 있다. 예를 들면, 광고 관리 장치는 적어도 하나의 그룹을 설정하는 데에 이용되는 정보를 입력 받는 사용자 인터 페이스를 표시할 수 있다. 단계 S320에서, 광고 관리 장치는 적어도 하나의 그룹에 제공할 광고 정보를 등록할 수 있다. 예를 들면, 광고 관리 장치는 제1 그룹 내의 사용자들의 로그 데이터에 기초하여, 제1 그룹 내의 사용자들 에 대한 소정 게임의 활성도 증가와 관련된 제1 광고를 결정할 수 있다. 광고 관리 장치는 제1 그룹에 대해, 제1 광고 및 제1 광고의 집행 조건을 포함하는 제1 광고 정보를 등록할 수 있다. 예를 들면, 광고 관리 장치는 적어도 하나의 그룹의 광고를 등록하는 데에 이용되는 정보를 입력 받는 사용 자 인터페이스를 표시할 수 있다. 단계 S330에서, 광고 관리 장치는 광고를 제공할 수 있는 복수의 플랫폼 서버로, 적어도 하나의 그룹 별로 광고 정보의 제공을 요청할 수 있다. 예를 들면, 광고 관리 장치는 제1 암호화 방식에 따라, 제1 그룹의 사용자 정보를 암호화할 수 있다. 광고 관리 장치는 암호화된 제1 그룹의 사용자 정보 및 제1 그룹에 제공될 제1 광고 정보를 복수의 플랫폼 서버 로 전송할 수 있다. 예를 들면, 광고 관리 장치는 복수의 플랫폼 서버로, 제1 암호화 방식에 따라 플랫폼 서버 내의 사용자 정 보가 암호화된 정보와 암호화된 제1 그룹의 사용자 정보를 비교한 결과에 기초하여, 제1 그룹의 사용자들에 매 핑된 사용자들에게 제1 광고 정보의 제공을 요청할 수 있다. 플랫폼 서버를 통해 각 그룹에 속한 사용자들에게 각 그룹에 등록된 광고를 제공함으로써, 광고 관리 장치는 소 정 게임의 애플리케이션이나 프로그램 이외의 외부 플랫폼 서비스를 통해 소정 게임의 광고를 사용자에게 제공 할 수 있다. 또한, 광고 관리 장치는 플랫폼 서버를 통해 각 그룹에 속한 사용자들에게 타겟팅된 광고를 제공 할 수 있다. 단계 S340에서, 광고 관리 장치는 복수의 플랫폼 서버로부터 적어도 하나의 그룹 별로 제공된 광고의 피드 백 정보를 획득할 수 있다. 예를 들면, 광고 관리 장치는 복수의 플랫폼 서버로부터, 적어도 하나의 그룹 내의 사용자들에게 소정 광고 의 송출로 모니터링 된 피드백 정보를 획득할 수 있다. 광고 관리 장치는 적어도 하나의 그룹 별로 피드백 정보를 표시할 수 있다. 예를 들면, 피드백 정보는, 소정 플랫폼 서버에서 제공된 소정 광고의 클릭 횟수, 소정 광고에 대응되는 액션 횟수, 소정 광고에 의한 소정 게임의 애플리케이션 설치 횟수, 및 소정 플랫폼 서버에서 발생된 광고 비용 중 적어도 하나의 정보를 포함할 수 있다. 단계 S350에서, 광고 관리 장치는 피드백 정보에 기초하여, 적어도 하나의 그룹 별로 등록된 광고 정보의 관리를 수행할 수 있다. 예를 들면, 광고 관리 장치는 광고 정보가 송출된 이후에, 적어도 하나의 그룹에 속한 사용자의 로그 데이 터 및 상기 피드백 정보에 기초하여, 적어도 하나의 그룹 별로, 소정 게임에 대한 광고의 효율을 판단하는 데에 이용되는 성과 정보를 획득할 수 있다. 광고 관리 장치는 적어도 하나의 그룹 별로, 성과 정보에 기초하여, 광고 정보의 관리를 수행할 수 있다. 예를 들면, 제1 그룹에 제공된 제1 광고에 대한 제1 성과 파라미터의 값이 소정 기준값보다 낮으면, 광고 관리 장치는 제1 광고를 중단하거나, 제1 광고를 제2 광고로 교체할 수 있다. 다른 예를 들면, 제1 그룹에 제공된 제1 광고에 대한 제1 성과 파라미터의 값이 소정 기준값보다 높으면, 광고 관리 장치는 제1 광고를 유지할 수 있다.광고 관리 장치가 성과 정보에 기초하여, 광고 정보를 관리하는 동작은, 도 9 내지 도 10에서 설명한다. 광고 관리 장치는 플랫폼 서버를 통해 소정 게임에 대해 설정된 그룹의 사용자들에게 타겟팅된 소정 광고를 제공할 수 있다. 또한, 광고 관리 장치는 플랫폼 서버를 통해 제공된 광고의 피드백 정보에 기초하여, 광고 관리 장치에 서 광고 관리를 수행함으로써, 광고의 효율을 높일 수 있다. 즉, 광고 효율이 낮은 광고는 중단 또는 교체함으 로써, 광고 비용을 절감할 수 있다. 또한, 광고 효율이 높은 광고는 지속적으로 유지함으로써, 광고 비용 대비 성과를 높일 수 있다. 따라서, 광고 관리 장치는 광고 관리 장치에서 소정 게임 내의 소정 그룹에 대한 광고 설정, 광고 제공, 광고 관리를 효율적으로 할 수 있다. 도 4a는 일실시예에 따라, 광고 관리 장치에서 소정 게임에 대한 소정 파라미터에 따라 그룹을 설정하는 과정을 설명하기 위한 도면이다. 도 4a의 이미지을 참고하면, 광고 관리 장치는 적어도 하나의 그룹을 설정하는 데에 이용되는 정보를 입력 받는 사용자 인터페이스를 표시할 수 있다. 광고 관리 장치는 소정 그룹 설정에 이용되는 파라미터를 선택하는 입력을 수신할 수 있다. 예를 들면, 광 고 관리 장치는 소정 게임에서 사용자의 접속률, 소정 게임에서 사용자의 접속 시간, 소정 게임에서 사용자 가 구매한 아이템, 구매 금액, 소정 게임에서 사용자의 게임 레벨, 캐릭터 중 적어도 하나의 파라미터를 선택하 는 입력을 수신할 수 있다. 여기서, 파라미터는, 상기 언급한 파라미터에 제한되지 않는다. 도 4a의 이미지에 도시된 바와 같이, 광고 관리 장치는 접속률, 접속 시간, 구매 금액, 게임 레벨을 선택한 입력을 수신할 수 있다. 광고 관리 장치는 선택된 접속률, 접속 시간, 구매 금액, 게임 레벨의 파 라미터에 대한 세부 설정 정보를 입력 받을 수 있다. 예를 들면, \"접속률\" 파라미터에는 소정 게임에 월 또는 주마다 몇 회 이상 또는 미만으로 접속하였는지가 설정될 수 있다. 여기서, 접속 횟수는 범위로 설정될 수도 있다. 또한, \"접속 시간\" 파라미터에는 소정 게임에 지속적으로 로그인 된 시간 범위가 설정될 수 있다. 또한, \"구매 금액\" 파라미터에는 소정 게임에 사용자가 구매한 구매 금액의 범위가 설정될 수 있다. 또한, \"게 임 레벨\" 파라미터에는 소정 게임의 사용자의 레벨 범위가 설정될 수 있다. 또한, 광고 관리 장치는 로그 데이터로부터 상기 파라미터들에 대한 조건을 검색하는 검색 기간을 설정하는 입력을 수신할 수 있다. 광고 관리 장치는 검색 기간 내의 복수의 사용자의 로그 데이터로부터, 파라미터 의 설정 조건을 충족시키는 사용자들을 추출하고, 추출된 사용자들을 구성원으로 하는 소정 그룹을 생성할 수 있다. 또한, 광고 관리 장치는 하나의 게임 또는 복수의 게임에 대한 로그 데이터로부터 파라미터의 설정 조건을 충족시키는 사용자들을 추출하고, 추출된 사용자들을 구성원으로 하는 소정 그룹을 생성할 수 있다. 또한, 광고 관리 장치는 적어도 둘 이상의 검색 기간을 설정하는 입력을 수신할 수 있다. 적어도 둘 이상 의 검색 기간이 설정되면, 광고 관리 장치는 제1 검색 기간의 로그 데이터와 제2 검색 기간의 로그 데이터 를 비교한 결과에 기초하여, 파라미터의 설정 조건을 충족시키는 사용자들을 추출하고, 추출된 사용자들을 구성 원으로 하는 소정 그룹을 생성할 수 있다. 예를 들면, 관리자는 과거에 과금 사용자였으나, 최근 접속 빈도가 낮은 사용자를 제1 그룹으로 설정하기 위해, 제1 그룹의 설정 조건을 설정할 수 있다. 제1 그룹의 설정 조건은, 전체 검색 기간이 1년 이 내이고, 접속 빈도가 낮은 검색 기간이 3개월 이내이고, 접속률이 월 4회 미만이고, 구매 금액이 월 1만원~3만 원으로 설정될 수 있다. 광고 관리 장치에서 제1 그룹의 설정 조건이 설정되면, 광고 관리 장치 는 3개월 내의 복수의 사용자의 로그 데이터에 기초하여, 제1 그룹의 설정 조건을 충족시키는 제1 그룹 을 생성할 수 있다. 다른 예를 들면, 관리자는 제1 카테고리의 게임에 대해 고레벨 사용자이나, 제2 카테고리의 게임에 대해 신규 사용자인 사용자를 제2 그룹으로 설정하기 위해, 제2 그룹의 설정 조건을 설정할 수 있다. 제2 그룹 의 설정 조건은, 검색 기간이 2개월 이내이고, 제2 카테고리의 게임에 대한 접속률이 주 3회 미만이고, 제 1 카테고리의 게임에 대한 사용자의 게임 레벨이 상위 10% 이내의 레벨이고, 제2 카테고리의 게임에 대한 사용 자의 게임 레벨이 하위 10% 이내의 레벨로 설정될 수 있다. 광고 관리 장치에서 제2 그룹의 설정 조 건이 설정되면, 광고 관리 장치는 2개월 내의 복수의 사용자의 로그 데이터에 기초하여, 제2 그룹의설정 조건을 충족시키는 제2 그룹을 생성할 수 있다. 또 다른 예를 들면, 관리자는 매월 소정 구매 금액 이상의 사용자이나 최근 구매 빈도가 낮은 사용자를 제3 그 룹으로 설정하기 위해, 제3 그룹의 설정 조건을 설정할 수 있다. 제3 그룹의 설정 조건은, 전 체 검색 기간이 6개월 이내이고, 전체 검색 기간에 대한 구매 빈도가 낮은 검색 기간은 현재로부터 3개월 이내 이고, 구매 금액이 월 1만원 미만, 구매 횟수가 월 3회 미만으로 설정될 수 있다. 광고 관리 장치에서 제3 그룹의 설정 조건이 설정되면, 광고 관리 장치는 6개월 내의 복수의 사용자의 로그 데이터에 기초하여, 제3 그룹의 설정 조건을 충족시키는 제3 그룹을 생성할 수 있다. 도 4b는 다른 일실시예에 따라, 광고 관리 장치에서 소정 게임에 대한 소정 파라미터에 따라 그룹을 설정하 는 과정을 설명하기 위한 도면이다. 도 4b를 참고하면, 단계 S431에서, 광고 관리 장치는 관리자가 설정하고자 하는 그룹의 특징 정보를 획득할 수 있다. 예를 들면, 관리자는 광고 관리 장치의 사용자 인터페이스 장치를 통해 제1 그룹에 대한 특징 정 보를 입력할 수 있다. 광고 관리 장치는 \"과거에 과금 사용자였으나, 최근 접속 빈도가 낮은 사용자\"를 입 력한 입력 문구를 수신할 수 있다. 단계 S432에서, 광고 관리 장치는 특징 정보로부터 그룹 설정에 필요한 파라미터를 결정할 수 있다. 예를 들면, 광고 관리 장치는 복수의 사용자들로부터 제1 그룹의 사용자들을 추출하기 위해 필요한 파라미터를 결정할 수 있다. 광고 관리 장치는 \"검색 기간\", \"접속률\", \"구매 금액\"을 파라미터로 결정할 수 있다. 단계 S433에서, 광고 관리 장치는 결정된 파라미터에 대한 세부 설정 정보를 획득할 수 있다. 여기서, 세 부 설정 정보는 광고 관리 장치에서 자동으로 설정될 수 있고, 관리자에 의해 설정될 수도 있다. 예를 들 면, 광고 관리 장치는 전체 검색 기간을 1년 이내, 접속률 빈도 검색 기간을 3개월 이내, 접속률을 월 4회 미만, 구매 금액을 월 1만원~3만원으로 설정한 설정 조건을 세부 설정 정보로 획득할 수 있다. 단계 S434에서, 광고 관리 장치는 검색 기간 내의 복수의 사용자의 로그 데이터로부터, 파라미터의 설정 조 건을 충족시키는 사용자들을 추출하고, 추출된 사용자들을 구성원으로 하는 소정 그룹을 생성할 수 있다. 예를 들면, 광고 관리 장치는 제1 그룹의 설정 조건에 기초하여, 제1 그룹을 생성할 수 있다. 도 5는 일실시예에 따라, 광고 관리 장치에서 그룹에 제공할 광고 정보를 결정하는 과정을 설명하기 위한 도면 이다. 도 5를 참고하면, 광고 관리 장치는 소정 그룹 내의 사용자들의 로그 데이터에 기초하여, 소정 그룹 내의 사용자들에 대한 소정 게임의 활성도 증가와 관련된 소정 광고를 결정할 수 있다. 광고 관리 장치는 소정 그룹에 대해, 소정 광고 및 소정 광고의 집행 조건을 포함하는 광고 정보를 등록할 수 있다. 예를 들면, 과거에 과금 사용자였으나, 최근 접속 빈도가 낮은 사용자인 사용자들이 제1 그룹으로 설정된 경우, 광고 관리 장치는 제1 그룹 내의 사용자들의 접속 빈도를 높이기 위한 광고를 결정할 수 있다. 예를 들면, 광고 관리 장치는, 아이템 구매 할인권 광고, 출석 도장 이벤트 광고를 제1 그룹 의 사용자들에게 제공할 광고로 결정하고, 광고 정보를 등록할 수 있다. 제1 그룹의 사용자들에게 소정 광고(501, 504)를 제공함으로써, 제1 그룹의 사용자들의 접속 빈도를 높일 수 있다. 다른 예를 들면, 제1 카테고리의 게임에 대해 고레벨 사용자이나, 제2 카테고리의 게임에 대해 신규 사용자인 사용자들이 제2 그룹으로 설정된 경우, 광고 관리 장치는 제2 그룹 내의 사용자들에 대한 제2 카 테고리의 게임의 참여도를 높이거나, 제2 카테고리의 게임의 게임 레벨을 향상시키기 위한 광고를 결정할 수 있 다. 예를 들면, 광고 관리 장치는 아이템 구매 할인권 광고, 신규 플레이어 혜택 광고, 사전 예 약 이벤트 광고, 신규 아이템 구매 혜택 광고를 제2 그룹의 사용자들에게 제공할 광고로 결정하 고, 광고 정보를 등록할 수 있다. 제2 그룹의 사용자들에게 소정 광고(501, 502, 505, 506)를 제공함으로 써, 제2 그룹의 사용자들이 제2 카테고리의 게임에 적응할 수 있도록 도움을 줄 수 있다. 또 다른 예를 들면, 매월 소정 구매 금액 이상의 사용자이나, 최근 구매 빈도가 낮은 사용자인 사용자들이 제3 그룹으로 설정된 경우, 광고 관리 장치는 제3 그룹 내의 사용자들의 구매 빈도를 높이기 위한 광 고를 결정할 수 있다. 예를 들면, 광고 관리 장치는 아이템 구매 할인권 광고, 구매 금액 구간 별 이 벤트 광고, 신규 아이템 구매 혜택 광고를 제3 그룹의 사용자들에게 제공할 광고로 결정하고, 광고 정보를 등록할 수 있다. 제3 그룹의 사용자들에게 소정 광고(501, 503, 506)를 제공함으로써, 제3 그 룹의 사용자들의 게임 활성도를 증가시킬 수 있다.도 6은 일실시예에 따라, 광고 관리 장치에서 소정 그룹에 제공할 광고 정보를 등록하는 데에 이용되는 사용자 인터페이스를 설명하기 위한 도면이다. 도 6을 참고하면, 광고 관리 장치는 적어도 하나의 그룹을 설정하거나, 적어도 하나의 그룹의 광고를 등록 하는 데에 이용되는 정보를 입력 받는 사용자 인터페이스를 표시할 수 있다. 예를 들면, 도 6의 블록을 참고하면, 사용자 인터페이스에는 광고 기본 정보를 설정하는 입력란이 포함될 수 있다. 입력란에는, 광고 이름, 광고의 시작 일시 및 종료 일시, 예산 항목에 대한 정보가 입력될 수 있다. 예를 들면, 도 6의 블록을 참고하면, 사용자 인터페이스에는 광고를 제공받을 그룹의 정보를 설정하는 입 력란이 포함될 수 있다. 입력란에는, 그룹의 이름 정보가 입력될 수 있다. 또한, 입력란에는, 그룹을 설정함 에 있어서 필요한 소정 파라미터의 조건 정보가 입력될 수 있다. 또한, 사용자 인터페이스에는 \"최근 그룹 정 보 불러오기\" 아이콘이 제공될 수 있다. 예를 들면, 도 6의 블록을 참고하면, 사용자 인터페이스에는 광고 정보를 등록하는 입력란이 포함될 수 있 다. 관리자는 파일 불러오기를 선택하고, 광고 관리 장치 내에 저장된 광고 파일을 배너로 등록할 수 있다. 또한, 관리자는 그룹 내의 사용자에 의해 배너가 선택되면, 이벤트 페이지로 연결시켜주는 주소 정보를 등록할 수 있다. 한편, 배너는 복수 개가 등록될 수 있고, 이벤트 페이지로 연결시켜주는 주소 정보도 복수 개 가 등록될 수 있다. 등록된 광고가 복수 개인 경우, 관리자는 복수의 광고들에 대해 우선 순위를 정하고, 플랫 폼 서버에서 사용자에게 제공되는 배너가 우선 순위에 따라 표시될 수 있도록 할 수 있다. 예를 들면, 도 6의 블록을 참고하면, 사용자 인터페이스에는 광고 비용을 설정하는 입력란이 포함될 수 있 다. 입력란에는 광고 비용의 기준 금액, 및 최대 금액을 설정하는 정보가 입력될 수 있다. 예를 들어, 광고 비용이 기준 금액을 초과하는 경우, 광고 관리 장치는 기준 금액의 초과를 알리는 알림을 표시할 수 있다. 또한, 광고 비용이 최대 금액을 초과하는 경우, 광고 관리 장치는 플랫폼 서버로, 광고 중단을 요청할 수 있다. 예를 들면, 도 6의 블록을 참고하면, 사용자 인터페이스에는 예상 광고 비용 및 예상 광고 효과를 입력하 는 입력란이 포함될 수 있다. 예상 광고 비용 및 예상 광고 효과는 관리자에 의해 입력될 수 있다. 또한, 예 상 광고 비용 및 예상 광고 효과는 광고 관리 장치에서 예측된 정보가 입력될 수도 있다. 광고 관리 장치에서 적어도 하나의 그룹을 설정하거나, 적어도 하나의 그룹의 광고를 등록하는 데에 이용되 는 정보가 모두 입력되면, 관리자는 광고 등록하기 아이콘을 선택할 수 있다. 광고 관리 장치에서 광 고 등록하기 아이콘을 선택하는 입력이 수신되면, 광고 관리 장치는 제1 플랫폼에서 소정 그룹의 사용 자들에게 제공될 광고를 등록할 수 있다. 관리자는 제1 플랫폼에 설정된 광고 정보를 제2 플랫폼, 제3 플랫폼, 제4 플랫폼, 제5 플랫폼에 대해서도 동일 하게 설정할 수 있다. 또한, 관리자는 플랫폼 별로, 그룹 또는 광고 정보를 다르게 설정할 수도 있다. 도 7은 일실시예에 따라, 광고 관리 장치에서 소정 그룹의 사용자 정보를 암호화하여, 플랫폼 서버로 전송하는 과정을 설명하기 위한 도면이다. 도 7을 참고하면, 광고 관리 장치는 제1 암호화 방식에 따라, 제1 그룹의 사용자 정보를 암호화할 수 있다. 예를 들면, 제1 암호화 방식은, 소정 정보 또는 데이터가 암호화 되면, 소정 길이의 문자열로 출력되는 단방향 암호화 방식일 수 있다. 제1 암호화 방식은 상기 예시에 제한되지 않는다. 예를 들면, 사용자 정보에는, 사용 자의 이름, 소정 게임에서 사용자의 아이디 등에 대한 정보가 포함될 수 있다. 예를 들면, 광고 관리 장치는 제1 그룹의 사용자 리스트 내의 제1 사용자 정보, 제2 사용자 정보 , 제3 사용자 정보, …., 제n 사용자 정보를 제1 암호화 방식으로 암호화하여, 암호화된 제1 사 용자 정보, 암호화된 제2 사용자 정보, 암호화된 제3 사용자 정보, ….., 암호화된 제n 사용자 정보를 획득할 수 있다. 광고 관리 장치는 암호화된 제1 그룹의 사용자 정보 및 제1 그룹의 사용자에게 제공될 제1 광고 정보를 플 랫폼 서버로 전송할 수 있다. 광고 관리 장치는 플랫폼 서버로, 제1 암호화 방식에 따라 플랫폼 서버 내의 사용자 정보가 암호화 된 정보와 암호화된 제1 그룹의 사용자 정보를 비교한 결과에 기초하여, 제1 그룹의 사용자들에 매핑된 사용자 들에게 제1 광고 정보의 제공을 요청할 수 있다.예를 들면, 플랫폼 서버는, 플랫폼 서버에서 관리하는 사용자들에 대한 사용자 정보를 제1 암호화 방식 에 따라 암호화할 수 있다. 플랫폼 서버는 제1 암호화 방식에 따라 암호화된 사용자 정보를 암호화된 제1 그룹의 사용자 정보와 비교하여, 플랫폼 서버에서 관리하는 사용자들 중에서 제1 그룹의 사용자들에 매핑되 는 사용자들을 추출할 수 있다. 도 7에 도시된 바와 같이, 플랫폼 서버는 암호화된 제1 사용자 정보와 대응되는 암호화된 사용자 정보 를 획득하고, 암호화된 제3 사용자 정보와 대응되는 암호화된 사용자 정보를 획득할 수 있다. 플랫폼 서버는 암호화된 사용자 정보에 대응되는 제1 사용자 및 암호화된 사용자 정보에 대응되 는 제3 사용자에게 제1 광고 정보를 제공할 수 있다. 도 8은 일실시예에 따라, 광고 관리 장치에서 관리하는 광고 목록 및 소정 광고에 대한 그룹 별 성과 정보를 표 시하는 사용자 인터페이스를 설명하기 위한 도면이다. 도 8을 참고하면, 광고 관리 장치는 복수의 플랫폼 서버를 통해 송출되고 있는 광고 목록을 표시할 수 있다. 광고 관리 장치는 광고 목록에서 아이템 구매 프로모션을 선택하는 입력을 수신할 수 있다. 광 고 목록에서 아이템 구매 프로모션을 선택하는 입력이 수신되면, 광고 관리 장치는 그룹 별로 아이템 구매 프로모션에 대한 성과 정보를 표시할 수 있다. 예를 들면, 광고 관리 장치는 복수의 플랫폼 서버로부터 그룹별 사용자에게 아이템 구매 프로모션으로 제공 된 광고의 피드백 정보를 획득할 수 있다. 여기서, 피드백 정보는 플랫폼 서버에서 광고가 사용자에게 송출됨 에 따라 사용자의 행위가 모니터링 된 정보일 수 있다. 예를 들면, 피드백 정보에는, 소정 플랫폼 서버에서 제 공된 소정 광고의 클릭 횟수, 소정 광고에 대응되는 액션 횟수, 소정 광고에 의한 소정 게임의 애플리케이션 설 치 횟수, 및 소정 플랫폼 서버에서 발생된 광고 비용 중 적어도 하나의 정보가 포함될 수 있다. 광고 관리 장 치는 적어도 하나의 그룹 별로 피드백 정보를 표시할 수 있다. 또한, 광고 비용 정보는, 소정 플랫폼 서버에서 제공된 소정 광고의 클릭 횟수에 따른 광고 비용을 나타내는 CPC(Cost Per Click), 소정 광고에 대응되는 소정 액션 횟수에 따른 광고 비용을 나타내는 CPA(Cost Per Action), 소정 광고에 의한 소정 게임의 애플리케이션 설치 횟수에 따른 광고 비용을 나타내는 CPI(Cost Per Install)로 표현될 수 있다. 또한, 광고 관리 장치는 적어도 하나의 그룹 별로, 복수의 사용자의 로그 데이터 및 피드백 정보에 기초하 여, 소정 게임에 대한 광고의 효율을 판단하는 데에 이용되는 성과 정보를 획득할 수 있다. 광고 관리 장치 는 성과 정보를 표시할 수 있다. 예를 들면, 성과 정보는 성과 파라미터로 표현될 수 있다. 예를 들면, 성과 파라미터는 광고 비용 대비 성과를 나타내는 ROAS(Return On Ad Spend)일 수 있다. 또한, 성과 파라미터 는 전체 투자 비용 대비 성과를 나타내는 ROI(Return On Investment)일 수 있다. 또한, 성과 파라미터는 핵심 성과 지표를 나타내는 KPI(Key Performance Indicator)일 수 있다. 또한, 성과 파라미터는 특정 시점 이후에 사용자로 남아있는 비율을 나타내는 잔존율(Retention Rate)일 수 있다. 성과 파라미터는 상기 예시에 제한되 지 않으며, 다른 파라미터가 포함될 수 있다. 또한, 광고 관리 장치는 아이템 구매 프로모션에 대한 모든 광고, 진행 중인 광고, 일시 정지 중인 광 고, 자동 중단이 설정된 광고의 정보를 표시할 수 있다. 예를 들면, 도 8의 블록을 참고하면, 광고 관리 장치는 \"과거에 과금 사용자였으나, 최근 접속 빈도 가 낮은 사용자\"인 사용자들로 구성된 제1 그룹에 대한 아이템 구매 프로모션의 피드백 정보 및 성과 정보를 표 시할 수 있다. 예를 들면, 도 8의 블록을 참고하면, 광고 관리 장치는 \"제1 카테고리의 게임에 대해 고레벨 사용자이 나, 제2 카테고리의 게임에 대해 신규 사용자\"인 사용자들로 구성된 제2 그룹에 대한 아이템 구매 프로모션의 피드백 정보 및 성과 정보를 표시할 수 있다. 예를 들면, 도 8의 블록을 참고하면, 광고 관리 장치는 \"매월 소정 구매 금액 이상의 사용자이나, 최 근 구매 빈도가 낮은 사용자\"인 사용자들로 구성된 제3 그룹에 대한 아이템 구매 프로모션의 피드백 정보 및 성 과 정보를 표시할 수 있다. 도 9는 일실시예에 따라, 광고 관리 장치에서 성과 정보에 기초하여, 광고 정보를 관리하는 동작 방법을 설명하 기 위한 흐름도이다. 도 9를 참고하면, 단계 S910에서, 광고 관리 장치는 광고 정보가 송출된 이후에, 적어도 하나의 그룹에 속 한 사용자의 로그 데이터를 게임 서버로부터 획득할 수 있다. 단계 S920에서, 광고 관리 장치는 복수의 플랫폼 서버로부터 그룹 별로 광고의 피드백 정보를 획득할 수 있 다. 예를 들면, 피드백 정보에는, 소정 플랫폼 서버에서 제공된 소정 광고의 클릭 횟수, 소정 광고에 대응되는 액션 횟수, 소정 광고에 의한 소정 게임의 애플리케이션 설치 횟수, 및 소정 플랫폼 서버에서 발생된 광고 비용 중 적어도 하나의 정보가 포함될 수 있다. 여기서, 소정 광고에 대응되는 액션에는, 소정 게임의 실행, 소정 게임에서 아이템 구매, 소정 게임의 회원 가입, 소정 게임의 게시판에 글쓰기 등이 포함될 수 있다. 단계 S930에서, 광고 관리 장치는 사용자의 로그 데이터 및 피드백 정보에 기초하여, 소정 게임에 대한 광 고의 효율을 판단하는 데에 이용되는 성과 정보를 획득할 수 있다. 예를 들면, 광고 관리 장치는 플랫폼 서버로부터 소정 게임에 대한 광고 비용 정보(예를 들면, CPC, CPA, CPI 등)를 수신할 수 있다. 광고 관리 장치는 그룹에 속한 사용자의 로그 데이터에 기초하여, 그룹 별로 소정 게임에 대한 소정 파라미터의 정보를 획득할 수 있다. 소정 파라미터에는, 사용자의 누적 구매 금액, 접 속률, 잔존율 등이 포함될 수 있다. 광고 관리 장치는 광고 비용 대비 소정 파라미터에 대한 비율을 계산 하여, 광고의 효율을 나타내는 성과 정보를 획득할 수 있다. 단계 S940에서, 광고 관리 장치는 적어도 하나의 그룹 별로, 성과 정보에 기초하여, 광고 정보의 관리를 수 행할 수 있다. 예를 들면, 광고 관리 장치는 제1 그룹에 제공된 제1 광고에 대한 제1 성과 파라미터의 값이 소정 기준값보 다 낮으면, 제1 광고를 중단하거나, 제1 광고를 제2 광고로 교체할 수 있다. 다른 예를 들면, 광고 관리 장치는 제1 그룹에 제공된 제1 광고에 대한 제1 성과 파라미터의 값이 소정 기 준값보다 높으면, 제1 광고를 유지할 수 있다. 도 10은 일실시예에 따라, 광고 관리 장치에서 성과 정보에 기초하여, 광고 정보를 관리하는 동작을 설명하기 위한 도면이다. 도 10의 이미지을 참고하면, 광고 관리 장치는 \"매월 소정 구매 금액 이상의 사용자이나, 최근 구매 빈도가 낮은 사용자\"인 사용자들로 구성된 제3 그룹에 대한 구매 금액 구간 별 이벤트 광고의 피드백 정 보 및 성과 정보(1012, 1013)를 획득하고, 피드백 정보 및 성과 정보(1012, 1013)를 표시할 수 있 다. 광고 관리 장치는 성과 정보(1012, 1013)에 기초하여, 구매 금액 구간 별 이벤트 광고를 지속적으로 유지할 것인지를 결정할 수 있다. 광고 관리 장치는 광고 비용 대비 성과를 나타내는 ROAS 정보에 기 초하여, 광고 비용 대비 성과가 하락 추세임을 결정할 수 있다. 또한, 광고 관리 장치는 잔존율 정보 에 기초하여, 시간이 경과됨에 따라 잔존율이 하락 추세임을 결정할 수 있다. 광고 관리 장치는 구 매 금액 구간 별 이벤트 광고가 교체되어야 함을 알리는 메시지를 표시할 수 있다. 도 10의 이미 지에 도시된 바와 같이, 광고 관리 장치는 구매 금액 구간 별 이벤트 광고를 아이템 구매 할인 권 광고로 교체할 수 있다. 즉, 광고 관리 장치는 소정의 성과 파라미터가 소정의 기준값보다 낮으면, 현재 플랫폼 서버를 통해 송출되 고 있는 광고를 중단하거나, 광고를 다른 광고로 교체할 수 있다. 도 10의 이미지을 참고하면, 광고 관리 장치는 \"매월 소정 구매 금액 이상의 사용자이나, 최근 구매 빈도가 낮은 사용자\"인 사용자들로 구성된 제3 그룹에 대한 아이템 구매 할인권 광고의 피드백 정보 및 성과 정보(1022, 1023)를 획득하고, 피드백 정보 및 성과 정보(1022, 1023)를 표시할 수 있다. 광고 관리 장치는 성과 정보(1022, 1023)에 기초하여, 아이템 구매 할인권 광고를 지속적으로 유지할 것인지를 결정할 수 있다. 광고 관리 장치는 광고 비용 대비 성과를 나타내는 ROAS 정보에 기초하여, 광고 비용 대비 성과가 상승 추세임을 결정할 수 있다. 또한, 광고 관리 장치는 잔존율 정보 에 기초하여, 시간이 경과됨에 따라 잔존율이 상승 추세임을 결정할 수 있다. 광고 관리 장치는 아 이템 구매 할인권 광고를 유지한다는 메시지를 표시할 수 있다. 즉, 광고 관리 장치는 소정의 성과 파라미터가 소정의 기준값보다 높으면, 현재 플랫폼 서버를 통해 송출되 고 있는 광고를 유지할 수 있다. 도 11은 일실시예에 따라, 광고 관리 장치가 게임 서버 및 플랫폼 서버를 통해 광고 정보를 관리하는 동작 방법 을 설명하기 위한 도면이다. 도 11을 참고하면, 단계 S1101에서, 게임 서버는 소정 게임에 대한 복수의 사용자의 로그 데이터를 수집할 수 있다. 단계 S1102에서, 게임 서버는 복수의 사용자의 로그 데이터를 광고 관리 장치로 전송할 수 있다. 단계 S1103에서, 광고 관리 장치는 복수의 사용자의 로그 데이터에 기초하여, 소정 게임에 대한 적어도 하 나의 그룹을 설정할 수 있다. 단계 S1104에서, 광고 관리 장치는 적어도 하나의 그룹에 제공할 광고 정보 를 등록할 수 있다. 단계 S1105에서, 광고 관리 장치는 플랫폼 서버로, 적어도 하나의 그룹 별로 광고 정보의 제공을 요청할 수 있다. 단계 S1106에서, 플랫폼 서버는 광고 관리 장치의 요청에 따라, 적어도 하나의 그룹 별로 광고 정보를 송출할 수 있다. 단계 S1107에서, 플랫폼 서버는 광고가 송출된 사용자의 행위를 모니터링하여, 피드백 정 보를 획득할 수 있다. 플랫폼 서버는 피드백 정보를 광고 관리 장치로 전송할 수 있다. 단계 S1108에서, 광고 관리 장치가 플랫폼 서버로 광고 정보의 제공을 요청한 이후에도, 게임 서버(2 0)는 지속적으로 복수의 사용자의 로그 데이터를 광고 관리 장치로 전송할 수 있다. 단계 S1109에서, 광고 관리 장치는 복수의 사용자의 로그 데이터 및 피드백 정보에 기초하여, 소정 게임에 대한 성과 정보를 획득할 수 있다. 단계 S1110에서, 광고 관리 장치는 성과 정보에 기초하여, 광고 정보의 관리를 수행할 수 있다. 도 12는 일실시예에 따라, 광고 관리 장치의 구성을 도시한 블록도이다. 도 12에 도시된 광고 관리 장치는 통신 장치, 사용자 인터페이스 장치, 스토리지, 메모 리 및 프로세서를 포함할 수 있다. 그러나, 도시된 구성 요소 모두가 필수 구성 요소인 것은 아니 다. 도시된 구성 요소보다 많은 구성 요소에 의해 광고 관리 장치가 구현될 수 있고, 그보다 적은 구성 요 소에 의해서도 광고 관리 장치가 구현될 수 있다. 통신 장치는 외부 장치와 통신을 수행할 수 있다. 구체적으로, 통신 장치는 유선 또는 무선으로 네트워크와 연결되어 외부 장치와 통신을 수행할 수 있다. 여기서, 외부 장치는 게임 서버, 플랫폼 서버, 스마 트폰, 태블릿, PC 등일 수 있다. 통신 장치는 다양한 유무선 통신 방법 중 하나를 지원하는 통신 모듈을 포함할 수 있다. 예를 들면, 통신 모듈은 칩셋(chipset)의 형태일 수도 있고, 또는 통신에 필요한 정보를 포함 하는 스티커/바코드(e.g. NFC tag를 포함하는 스티커)등일 수도 있다. 또한, 통신 모듈은 근거리 통신 모듈, 유선 통신 모듈일 수 있다. 예를 들면, 통신 장치는 무선 랜(Wireless LAN), Wi-Fi(Wireless Fidelity), WFD(Wi-Fi Direct), 블루투 스(Bluetooth), BLE(Bluetooth Low Energy), Wired Lan, NFC(Near Field Communication), 지그비(Zigbee) 적 외선(IrDA, infrared Data Association), 3G, 4G, 및 5G 중 적어도 하나를 지원할 수 있다. 스토리지는 게임 서버로부터 수신된 복수의 사용자의 로그 데이터, 소정 게임에 대한 사용자의 그룹 정보, 그룹 별로 등록된 광고 정보, 플랫폼 서버의 정보, 플랫폼 서버로부터 수신된 피드백 정보, 소정 광고에 대한 성과 정보 등을 저장할 수 있다. 스토리지는 플랫폼 서버를 통해 그룹 별로 광고를 관리하는 데에 이용되는 프로그램, 애플리케이션 등과 관련된 정보를 저장할 수 있다. 스토리지는 광고 관리 장치 에서 실행되는 프로그램, 애플리케이션, 및 플랫폼 서버 상에서 이용되는 각종 데이터를 저장할 수 있다. 사용자 인터페이스 장치는 관리자로부터 광고 관리 장치를 제어하기 위해 데이터를 입력 받는 장치를 의미할 수 있다. 프로세서는 관리자로부터 소정 명령 또는 데이터를 입력 받기 위한 사용자 인터페이스 화면을 생성 및 출 력하도록 사용자 인터페이스 장치를 제어할 수 있다. 사용자 인터페이스 장치는 광고 관리 장치 의 동작을 제어하는 입력 등을 수신하기 위한 입력 장치와 광고 관리 장치의 동작에 따른 결과 또는 광 고 관리 장치의 상태 등의 정보를 표시하기 위한 출력 장치를 포함할 수 있다. 예를 들면, 사용자 인터페 이스 장치는 관리자 입력을 수신하는 조작 패널, 화면을 표시하는 디스플레이 패널 등을 포함할 수 있다. 구체적으로, 입력 장치는 터치 스크린, 카메라 또는 마이크 등과 같이 다양한 형태의 사용자 입력을 수신할 수 있는 장치들을 포함할 수 있다. 또한, 출력 장치는, 예를 들어, 디스플레이 패널 또는 스피커 등을 포함할 수 있다. 다만, 이에 한정되지 않고 사용자 인터페이스 장치는 다양한 입출력을 지원하는 장치를 포함할 수있다. 메모리는 소프트웨어 또는 프로그램을 저장할 수 있다. 메모리는 광고 관리 장치에서 소정 게 임에 대해 설정된 그룹에 제공할 광고를 등록하고, 광고 제공에 따른 피드백 정보에 기초하여 광고를 관리하기 위한 적어도 하나의 프로그램을 저장할 수 있다. 메모리에 저장된 적어도 하나의 프로그램은 기능에 따 라 복수 개의 모듈들로 분류될 수 있다. 프로세서는 광고 관리 장치의 전체적인 동작을 제어하며, CPU 등과 같은 적어도 하나의 프로세서를 포함할 수 있다. 프로세서는 각 기능에 대응되는 특화된 프로세서를 적어도 하나 포함하거나, 하나로 통 합된 형태의 프로세서일 수 있다. 프로세서는 메모리에 저장된 프로그램을 실행시키거나, 메모리에 저장된 데이터 또는 파일을 읽어오거나, 새로운 파일을 메모리에 저장할 수 있다. 프로세서는 메모리에 저장된 명령어 들을 실행할 수 있다. 프로세서는 소정 게임으로부터 수신된 복수의 사용자의 로그 데이터에 기초하여, 소정 게임에 대한 적어 도 하나의 그룹을 설정할 수 있다. 예를 들면, 프로세서는 소정 게임에서 사용자의 접속률, 소정 게임에서 사용자의 접속 시간, 소정 게임에 서 사용자가 구매한 아이템, 구매 금액, 소정 게임에서 사용자의 게임 레벨, 캐릭터 중에서 그룹 설정에 이용되 는 적어도 하나의 파라미터를 결정할 수 있다. 구체적인 예를 들면, 프로세서는 설정하고자 하는 그룹의 특징 정보를 획득할 수 있다. 예를 들면, 사용 자 인터페이스 장치는 제1 그룹에 대한 특징 정보를 수신할 수 있다. 프로세서는 특징 정보로부터 그룹 설정에 필요한 파라미터를 결정할 수 있다. 예를 들면, 프로세서는 복수의 사용자들로부터 제1 그 룹의 사용자들을 추출하기 위해 필요한 파라미터를 결정할 수 있다. 프로세서는 복수의 사용자의 로그 데이터로부터 복수의 사용자에 대한 적어도 하나의 파라미터의 값을 획 득할 수 있다. 프로세서는 복수의 사용자에 대한 적어도 하나의 파라미터의 값에 기초하여, 소정 게임에 대한 적어도 하나의 그룹을 설정할 수 있다. 프로세서는 결정된 파라미터에 대한 세부 설정 정보를 획득할 수 있다. 여기서, 세부 설정 정보는 광고 관리 장치에서 자동으로 설정될 수 있고, 관리자에 의해 설정될 수도 있다. 프로세서는 검색 기간 내의 복수의 사용자의 로그 데이터로부터, 파라미터의 설정 조건을 충족시키는 사 용자들을 추출하고, 추출된 사용자들을 구성원으로 하는 소정 그룹을 생성할 수 있다. 예를 들면, 광고 관리 장치는 제1 그룹의 설정 조건에 기초하여, 제1 그룹을 생성할 수 있다. 예를 들면, 프로세서는 사용자 인터페이스 장치를 통해 적어도 하나의 그룹을 설정하는 데에 이용 되는 정보를 입력 받는 사용자 인터페이스를 표시할 수 있다. 프로세서는 적어도 하나의 그룹에 제공할 광고 정보를 등록할 수 있다. 예를 들면, 프로세서는 제1 그룹 내의 사용자들의 로그 데이터에 기초하여, 제1 그룹 내의 사용자들에 대 한 소정 게임의 활성도 증가와 관련된 제1 광고를 결정할 수 있다. 프로세서는 제1 그룹에 대해, 제1 광고 및 제1 광고의 집행 조건을 포함하는 제1 광고 정보를 등록할 수 있다. 예를 들면, 프로세서는 사용자 인터페이스 장치를 통해 적어도 하나의 그룹의 광고를 등록하는 데 에 이용되는 정보를 입력 받는 사용자 인터페이스를 표시할 수 있다. 프로세서는 통신 장치를 통해 광고를 제공할 수 있는 복수의 플랫폼 서버로, 적어도 하나의 그룹 별로 광고 정보의 제공을 요청할 수 있다. 예를 들면, 프로세서는 제1 암호화 방식에 따라, 제1 그룹의 사용자 정보를 암호화할 수 있다. 프로세서 는 통신 장치를 통해 암호화된 제1 그룹의 사용자 정보 및 제1 그룹에 제공될 제1 광고 정보를 복 수의 플랫폼 서버로 전송할 수 있다. 예를 들면, 프로세서는 통신 장치를 통해 복수의 플랫폼 서버로, 제1 암호화 방식에 따라 플랫폼 서버 내의 사용자 정보가 암호화된 정보와 암호화된 제1 그룹의 사용자 정보를 비교한 결과에 기초하여, 제1 그룹의 사용자들에 매핑된 사용자들에게 제1 광고 정보의 제공을 요청할 수 있다. 프로세서는 통신 장치를 통해 복수의 플랫폼 서버로부터 적어도 하나의 그룹 별로 제공된 광고의 피드백 정보를 획득할 수 있다. 예를 들면, 프로세서는 통신 장치를 통해 복수의 플랫폼 서버로부터, 적어도 하나의 그룹 내의 사 용자들에게 소정 광고의 송출로 모니터링 된 피드백 정보를 획득할 수 있다. 프로세서는 사용자 인터페 이스 장치를 통해 적어도 하나의 그룹 별로 피드백 정보를 표시할 수 있다. 예를 들면, 피드백 정보는, 소정 플랫폼 서버에서 제공된 소정 광고의 클릭 횟수, 소정 광고에 대응되는 액션 횟수, 소정 광고에 의한 소정 게임의 애플리케이션 설치 횟수, 및 소정 플랫폼 서버에서 발생된 광고 비용 중 적어도 하나의 정보를 포함할 수 있다. 프로세서는 피드백 정보에 기초하여, 적어도 하나의 그룹 별로 등록된 광고 정보의 관리를 수행할 수 있 다. 예를 들면, 프로세서는 광고 정보가 송출된 이후에, 적어도 하나의 그룹에 속한 사용자의 로그 데이터 및 상기 피드백 정보에 기초하여, 적어도 하나의 그룹 별로, 소정 게임에 대한 광고의 효율을 판단하는 데에 이용 되는 성과 정보를 획득할 수 있다. 프로세서는 적어도 하나의 그룹 별로, 성과 정보에 기초하여, 광고 정보의 관리를 수행할 수 있다. 예를 들면, 제1 그룹에 제공된 제1 광고에 대한 제1 성과 파라미터의 값이 소정 기준값보다 낮으면, 프로세서 는 제1 광고를 중단하거나, 제1 광고를 제2 광고로 교체할 수 있다. 다른 예를 들면, 제1 그룹에 제공된 제1 광고에 대한 제1 성과 파라미터의 값이 소정 기준값보다 높으면, 프로 세서는 제1 광고를 유지할 수 있다. 이상에서 설명된 광고 관리 장치, 게임 서버 및 플랫폼 서버는 하드웨어 구성요소, 소프트웨어 구 성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들 에서 설명된 장치 및 구성요소는, 예를 들어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편"}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가 진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 기록 매체에 기록될 수 있다. 컴퓨터 판독 가능 기록 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2019-0153771", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속한다."}
{"patent_id": "10-2019-0153771", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시는, 다음의 자세한 설명과 그에 수반되는 도면들의 결합으로 쉽게 이해될 수 있으며, 참조 번호 (reference numerals)들은 구조적 구성요소(structural elements)를 의미한다. 도 1은 일실시예에 따라, 서버 및 클라이언트를 포함하는 온라인 게임 제공 시스템을 도시한다. 도 2는 일실시예에 따라, 광고 관리 장치가 소정 그룹의 사용자에게 소정 광고가 제공될 수 있도록 광고 정보를 플랫폼 서버로 전송하고, 플랫폼 서버로부터 수신된 피드백 정보에 따라 광고 정보를 관리하는 방법을 설명하기 위한 개념도이다. 도 3은 일실시예에 따라, 광고 관리 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 4a는 일실시예에 따라, 광고 관리 장치에서 소정 게임에 대한 소정 파라미터에 따라 그룹을 설정하는 과정을 설명하기 위한 도면이다. 도 4b는 다른 일실시예에 따라, 광고 관리 장치에서 소정 게임에 대한 소정 파라미터에 따라 그룹을 설정하는 과정을 설명하기 위한 도면이다. 도 5는 일실시예에 따라, 광고 관리 장치에서 그룹에 제공할 광고 정보를 결정하는 과정을 설명하기 위한 도면 이다. 도 6은 일실시예에 따라, 광고 관리 장치에서 소정 그룹에 제공할 광고 정보를 등록하는 데에 이용되는 사용자 인터페이스를 설명하기 위한 도면이다. 도 7은 일실시예에 따라, 광고 관리 장치에서 소정 그룹의 사용자 정보를 암호화하여, 플랫폼 서버로 전송하는 과정을 설명하기 위한 도면이다. 도 8은 일실시예에 따라, 광고 관리 장치에서 관리하는 광고 목록 및 소정 광고에 대한 그룹 별 성과 정보를 표 시하는 사용자 인터페이스를 설명하기 위한 도면이다. 도 9는 일실시예에 따라, 광고 관리 장치에서 성과 정보에 기초하여, 광고 정보를 관리하는 동작 방법을 설명하 기 위한 흐름도이다. 도 10은 일실시예에 따라, 광고 관리 장치에서 성과 정보에 기초하여, 광고 정보를 관리하는 동작을 설명하기 위한 도면이다. 도 11은 일실시예에 따라, 광고 관리 장치가 게임 서버 및 플랫폼 서버를 통해 광고 정보를 관리하는 동작 방법 을 설명하기 위한 도면이다. 도 12는 일실시예에 따라, 광고 관리 장치의 구성을 도시한 블록도이다."}
