{"patent_id": "10-2022-0173278", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0087987", "출원번호": "10-2022-0173278", "발명의 명칭": "인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치 및 방법", "출원인": "부산대학교 산학협력단", "발명자": "권준호"}}
{"patent_id": "10-2022-0173278", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다수 개의 컬럼(Columns)을 갖는 원본 데이터 세트를 업로드 하는 업로더;상기 원본 데이터 세트가 반전된 반전 데이터 세트를 이용하여 모조 데이터 세트를 생성하는 모조 데이터 생성기;와 상기 원본 데이터 세트를 기준으로 상기 모조 데이터 세트를 판별하는 모조 데이터 판별기;를 포함하는딥러닝 모듈; 및상기 데이터 판별기로부터 판별된 상기 모조 데이터 세트와 상기 원본 데이터 세트를 비교 검증한 후 공정성이향상된 경우 공정 데이터 세트로 추출하는 검증 모듈;를 포함하는 인공지능 학습 데이터의 공정한 보장을 위한대칭 구조 기반 모조 데이터 생성 장치."}
{"patent_id": "10-2022-0173278", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 원본 데이터 세트의 데이터 구조를 분석하고, 상기 원본 데이터 세트를 각 컬럼(Column)의 고유값만을 갖는 서브셋으로 분할하는 데이터 구조분석모듈;를 더 포함하는 것을 특징으로 하는 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치."}
{"patent_id": "10-2022-0173278", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 서브셋을 샘플링(Sampling)하여 테스트 데이터 세트를 생성하고, 상기 모조 데이터 세트의 비교 검증이 가능하도록 상기 검증 모듈에 상기 테스트 데이터 세트를 전송하는 테스트 데이터 세트 생성모듈;을 더 포함하는것을 특징으로 하는 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치."}
{"patent_id": "10-2022-0173278", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 딥러닝 모듈은,GAN 모델을 기반으로 하는 것을 특징으로 하는 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치."}
{"patent_id": "10-2022-0173278", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "업로더에 의하여, 다수 개의 컬럼(Columns)을 갖는 원본 데이터 세트가 업로드 되는 업로드 단계;딥러닝 모듈에 의하여, 상기 원본 데이터 세트가 반전된 반전 데이터가 생성되는 반전 데이터 생성단계;상기 딥러닝 모듈에 의하여, 상기 반전 데이터 세트를 이용하여 모조 데이터 세트가 생성되는 모조 데이터 생성단계;상기 딥러닝 모듈에 의하여, 상기 원본 데이터 세트를 기준으로 상기 모조 데이터 세트가 판별되는 모조 데이터판별단계; 및검증 모듈에 의하여, 상기 모조 데이터 판별단계로부터 판별된 상기 모조 데이터 세트와 상기 원본 데이터 세트가 비교 검증된 후 공정성이 향상된 경우 공정 데이터 세트로 추출되는 검증 단계;를 포함하는 인공지능 학습데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 방법."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치 및 방법에 관한 것으로, 보다 구체적으로 다수 개의 컬럼(Columns)을 갖는 원본 데이터 세트를 업로드 하는 업로더, 상기 원본 데이터 세트가 반전된 반전 데이터 세트를 이용하여 모조 데이터 세트를 생성하는 모조 데이터 생성기와 상기 원 본 데이터 세트를 기준으로 상기 모조 데이터 세트를 판별하는 모조 데이터 판별기를 포함하는 딥러닝 모듈 및 상기 데이터 판별기로부터 판별된 상기 모조 데이터 세트와 상기 원본 데이터 세트를 비교 검증한 후 공정성이 향상된 경우 공정 데이터 세트로 추출하는 검증 모듈를 포함하는 인공지능 학습 데이터의 공정한 보장을 위한 대 칭 구조 기반 모조 데이터 생성 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 인공지능 알고리즘이 빠르게 성장하고 있고, 이를 활용하여 의사결정을 내리기 전에 미리 그 위험과 영향 을 예측하여 사람의 판단을 보조하거나 자동화할 수 있다. 치안, 정책, 금융, 의학, 채용 등 다양한 주제에서 인공지능 알고리즘이 의사결정 모형을 학습할 수 있고, 이러한 의사결정 모형들은 종종 사회에 존재하는 편향까 지도 그대로 학습할 수 있다. 대상자의 삶에 중대한 영향을 미칠 수 있는 알고리즘이 내린 결정들은 그 결정과 무관해야 하는 특성에 따라 편향될 수 있으며, 성별, 인종, 종교 등 특정 집단에 속한 개인들에게 불리하게 작 용한다. 인공지능(AI) 기술의 빠른 발달로 다양한 산업 분야에 적용되면서 인공지능의 역작용이나 사회 전반에 끼치는 영향에 대한 논의가 필요하다. 특히, 성별과 인종, 사회 집단 등에 대해 편향을 갖거나 투명성 결여 등의 공정 성 문제가 이슈가 된다. 따라서 인공지능 모델 개발 시 인공지능 모델의 성능을 저하하는 데이터 세트의 불공정 성을 보정하는 것이 주요 과제이다. 예를 들어, 심장실환 발생 위험도를 판단하는 인공지능 모델의 경우, 고위험군과 저위험군의 비율이 공정하지 못한(eg, 고위험군 : 저위험군 = 80,000개 : 20,000개) 데이터 세트를 사용하면 학습 데이터의 불공정성에 의해 잘못된 결과를 도출할 수 있다. 또한, 해당 데이터 세트에서 하나의 민감한 속성(e.g, 고위험군 여부)의 비율만 보정하는 것(e.g, 고위험군 : 저위험군 = 20,000개 : 20,000개)으로는 종속적인 다른 속성들에서 편향(e.g, 고 위험군-남성 : 고위험군-여성 = 15000개 : 5000개)이 발생할 수 있으므로 제대로 된 인공지능 학습의 결과를 기 대할 수 없다. 또한, 현재까지 공정성을 보장하기 위해서 정적인 데이터 세트를 대상으로 제거하는 방식을 사용하고 있으며 추 가로 수집되는 데이터에 대한 추가적인 보정 기술이 미흡한 실정이다."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "따라서 종래보다 유연하게 데이터 세트의 데이터 편향성을 보정할 수 있는 기술이 본 기술분야에서 절실히 필요 한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허등록공보 제10-2039540호 비특허문헌 (비특허문헌 0001) 손영신, 「인공지능 알고리즘 기반 의사결정의 공정성 지각」, 서울대학교 대학원 :사회과 학대학 심리학과, 2020. 02."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로 원본 데이터 세트 내 편향을 보정할 수 있을 뿐만 아니 라 인공지능 모델을 학습하기 위한 공정 데이터 세트 내 데이터의 양을 증가시킬 수 있도록 원본 데이터 세트가 반전된 반전 데이터 세트를 이용하여 모조 데이터 세트를 생성 및 판별하고, 판별된 모조 데이터 세트와 원본 데이터 세트를 비교 검증한 후 공정성이 향상된 경우 공정 데이터 세트로 추출하는 인공지능 학습 데이터의 공 정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치 및 방법을 얻고자 하는 것을 목적으로 한다. 본 발명이 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 본 발명의 기재로부터 당해 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수있다."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데 이터 생성 장치는 다수 개의 컬럼(Columns)을 갖는 원본 데이터 세트를 업로드 하는 업로더; 상기 원본 데이터 세트가 반전된 반전 데이터 세트를 이용하여 모조 데이터 세트를 생성하는 모조 데이터 생성기;와 상기 원본 데 이터 세트를 기준으로 상기 모조 데이터 세트를 판별하는 모조 데이터 판별기;를 포함하는 딥러닝 모듈; 및 상 기 데이터 판별기로부터 판별된 상기 모조 데이터 세트와 상기 원본 데이터 세트를 비교 검증한 후 공정성이 향 상된 경우 공정 데이터 세트로 추출하는 검증 모듈;를 제공한다. 상기 목적을 달성하기 위하여, 본 발명의 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데 이터 생성 방법은 업로더에 의하여, 다수 개의 컬럼(Columns)을 갖는 원본 데이터 세트가 업로드 되는 업로드 단계;딥러닝 모듈에 의하여, 상기 원본 데이터 세트가 반전된 반전 데이터가 생성되는 반전 데이터 생성단계; 상기 딥러닝 모듈에 의하여, 상기 반전 데이터 세트를 이용하여 모조 데이터 세트가 생성되는 모조 데이터 생성 단계; 상기 딥러닝 모듈에 의하여, 상기 원본 데이터 세트를 기준으로 상기 모조 데이터 세트가 판별되는 모조 데이터 판별단계; 및 검증 모듈에 의하여, 상기 모조 데이터 판별단계로부터 판별된 상기 모조 데이터 세트와 상기 원본 데이터 세트가 비교 검증된 후 공정성이 향상된 경우 공정 데이터 세트로 추출되는 검증 단계;를 제 공한다."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본 발명에 의하면 원본 데이터 세트가 반전된 반전 데이터 세트를 이용하여 모조 데이터 세트를 생 성 및 판별하고, 판별된 모조 데이터 세트와 원본 데이터 세트를 비교 검증한 후 공정성이 향상된 경우 공정 데 이터 세트로 추출함으로써, 원본 데이터 세트 내 편향을 보정할 수 있을 뿐만 아니라 인공지능 모델을 학습하기 위한 공정 데이터 세트 내 데이터의 양을 상당히 높일 수 있는 현저한 효과가 있다."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 상세한 설명 및 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들 을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 다르게 정의되지 않는 한 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반 적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치 구성도이다. 도 2는 원본 데이터 세 트(a), 종래 딥러닝 기술을 이용한 모조 데이터 세트(b), 원본 데이터 세트와 종래 딥러닝 기술을 이용한 모조 데이터를 합친 후 출력된 공정 데이터 세트(c)를 표시한 도면이다. 도 3은 원본 데이터 세트(a), 본 발명의 일 실시예에 따라 생성된 반전 데이터 세트(b), 본 발명의 일실시예에 따라 생성된 모조 데이터 세트(c) 및 본 발 명의 일실시예에 따라 추출된 공정 데이터 세트(d)를 표시한 도면이다. 도 4는 본 발명의 인공지능 학습 데이터 의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 방법 흐름도이다. 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치 도 1을 보면, 본 발명의 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치는 업로더, 딥러닝 모듈 및 검증 모듈을 포함한다. 보다 구체적으로, 상기 업로더는 다수 개의 컬럼(Columns)을 갖는 원본 데이터 세트를 업로드 한다. 본 발명의 일실시예에 따르면, 상기 업로더는 공공데이터 포털의 OpenAPI로부터 CSV(Comma-Separated Values) 파일형식의 원본 데이터 세트를 획득하여 업로드할 수 있다. 상기 CSV 파일형식의 원본 데이터 세트는 테이블(Table), 필드(Field), 컬럼(Column) 및 컬럼값으로 구성될 수 있다. 본 발명에서 언급하는 상기 테이블(Table)은 빠른 참조를 위해 적당한 형태로 자료를 모아 놓은 것으로, 관계 데이터베이스 모델에서 자료의 구조를 2차원의 표로 나타낸 것이다. 즉, 컬럼값과 컬럼(Column)의 형태로 관리 되며 키를 지정함으로써 원하는 자료를 빠르고 쉽게 찾아 낼 수 있다. 상기 필드(Field)는 어떠한 의미를 지니는 정보의 한 조각으로, 데이터베이스 시스템에서 처리의 최소 단위가 되는 것을 말한다. 상기 컬럼값은 관계형 데이터베이스에서 레코드(record) 또는 튜플(tuple)로 불리기도 하며, 어떤 테이블에서 단일 구조 데이터 항목을 가리킨다. 간단한 용어로, 데이터베이스 테이블은 컬럼값과 컬럼 (Column) 또는 필드로 구성되어 있다고 할 수 있다. 각 테이블의 컬럼값은 일련의 관련 자료를 나타내며, 테이 블에서 모든 컬럼값은 동일한 구조를 가지고 있다. 다음으로, 상기 딥러닝 모듈은 상기 원본 데이터 세트가 반전된 반전 데이터 세트를 이용하여 모조 데이터 세트를 생성하는 모조 데이터 생성기와 상기 원본 데이터 세트를 기준으로 상기 모조 데이터 세트를 판별 하는 모조 데이터 판별기를 포함한다. 상기 딥러닝 모듈은, GAN 모델을 기반으로 하는 것을 특징으로 한다. 일반적으로, GAN 모델은 상호적대적 인 식별자(Discriminator)와 생성자(Generator)를 활용하여 기존 데이터와 비슷한 데이터를 인공적으로 생성하 는 네트워크이고, 기계학습에서 비지도 학습에 속하는 모델이다. 즉, 상기 딥러닝 모듈 내 GAN 모델은 상 기 모조 데이터 생성기와 모조 데이터 판별기를 포함하거나, 그 자체일 수 있다. 한편, 본 발명은 상기 원본 데이터 세트의 데이터 구조를 분석하고, 상기 원본 데이터 세트를 각 컬럼(Column) 의 고유값만을 갖는 서브셋으로 분할하는 데이터 구조분석모듈을 더 포함하는 것을 특징으로 한다. 예컨대, 상기 구조분석모듈은 상기 원본 데이터 세트 내 임의의 컬럼(Column)에 대해서 컬럼값 A, 컬럼값 B 컬럼값 C 및 컬럼값 D를 갖는다면 임의의 컬럼(Column)에 대해서 컬럼값 A를 갖는 데이터만을 모아서 서브셋 A로 분할하고, 임의의 컬럼(Column)에 대해서 컬럼값 B를 갖는 데이터만을 모아서 서브셋 B로 분할하고, 임의의 컬럼(Column)에 대해서 컬럼값 C를 갖는 데이터만을 모아서 서브셋 C로 분할하고, 임의의 컬럼(Column)에 대해 서 컬럼값 D를 갖는 데이터만을 모아서 서브셋 D로 분할할 수 있다. 따라서 상기 구조분석모듈은 상기 원 본 데이터 세트를 상기 서브셋 A, 서브셋 B, 서브셋 C, 서브셋 D로 분할할 수 있다. 또한, 본 발명은 상기 서브셋을 샘플링(Sampling)하여 테스트 데이터 세트를 생성하고, 상기 모조 데이터 세트 의 비교 검증이 가능하도록 상기 검증 모듈에 상기 테스트 데이터 세트를 전송하는 테스트 데이터 세트 생 성모듈을 더 포함하는 것을 특징으로 한다. 상기 테스트 데이터 세트 생성모듈은 상기 원본 데이터 세트의 데이터 분포와 동일한 테스트 데이터 세트 를 생성하기 위해서 하나의 서브셋에서 편향하여 샘플링(Sampling)하는 것이 아닌, 각 서브셋마다 골고루 샘플 링(Sampling)하여 상기 테스트 데이터 세트를 생성할 수 있다.우선, 상기 딥러닝 모듈은 상기 원본 데이터 세트를 반전시킬 수 있다. 가장 바람직하게, 상기 딥러닝 모 듈은 상기 원본 데이터 세트에서 상기 테스트 데이터 세트 생성모듈로부터 생성된 테스트 데이터 세 트를 제외한 나머지 원본 데이터 세트를 대상으로 서브셋을 반전시켜 상기 반전 데이터 세트를 생성할 수 있다. 본 발명에서 언급하는 반전은 각 서브셋의 레이블을 교체하는 동작이다. 도 3의 일실시예에 따르면, 도 3의 (a)와 같이 상기 원본 데이터 세트에서 상기 테스트 데이터 세트를 제외한 나머지 원본 데이터 세트는 서브셋 A에 포함되는 데이터의 수가 100개, 서브셋 B에 포함되는 데이터의 수가 30 개일 수 있다. 그러면, 상기 딥러닝 모듈은 도 3의 (b)와 같이 서브셋 A와 서브셋 B를 반전시킴으로써, 서 브셋 B에 포함되는 데이터의 수가 100개, 서브셋 A에 포함되는 데이터의 수가 30개인 반전 데이터 세트를 생성 할 수 있다. 또한, 상기 딥러닝 모듈 내 상기 모조 데이터 생성기는 상기 반전 데이터 세트를 학습 데이터 세트로 하여 입력함으로써, 상기 반전 데이터 세트와 동일한 컬럼들(Columns)을 갖지만 인공적으로 생성된 컬럼값들을 갖는 모조 데이터 세트를 생성할 수 있다. 따라서 실제로 모든 데이터를 획득하기 위해서는 물리적으로 한계가 존재하는데, 소정의 실제 데이터를 기반으로 인공 데이터를 생성함으로써 실제 데이터를 보완할 수 있고 인공지 능 모델의 학습량을 늘릴 수 있는 현저한 효과가 있다. 또한, 상기 딥러닝 모듈 내 상기 모조 데이터 판별기는 상기 원본 데이터 세트를 학습 데이터 세트로 하여 입력함으로써, 상기 모조 데이터 생성기로부터 생성된 상기 모조 데이터 세트를 검증 및 판별할 수 있다. 다음으로, 상기 검증 모듈은 상기 데이터 판별기로부터 판별된 상기 모조 데이터 세트와 상기 원본 데이터 세트를 비교 검증한 후 공정성이 향상된 경우 공정 데이터 세트로 추출한다. 우선, 상기 검증 모듈은 상기 테스트 데이터 세트 생성모듈로부터 상기 테스트 데이터 세트를 전송받 을 수 있다. 즉, 상기 검증 모듈로부터 비교 검증에 사용되는 상기 원본 데이터 세트는 가장 바람직하게, 상기 원본 데이터 세트 중 테스트 데이터 세트를 일컫는다. 다시 말하면, 상기 검증 모듈은 상기 테스트 데이터 세트를 제외한 상기 원본 데이터 세트에 상기 데이터 판별기로부터 판별된 상기 모조 데이터 세트를 추가하여 특정 조건식에 따라 공정성 지표에 대한 공정성 지표값(F1)을 도출할 수 있다. 그리고 상기 검증 모듈은 상기 테스트 데이터 세트에 대해서 상기 특정 조 건식에 따라 공정성 지표에 대한 공정성 지표값(F2)을 도출할 수 있다. 그리고 상기 검증 모듈은 공정성 지표값(F1, F2)간 비교를 통해서 상기 테스트 데이터 세트보다 상기 테스 트 데이터 세트를 제외한 상기 원본 데이터 세트에 상기 모조 데이터 세트가 추가된 데이터 세트가 공정성이 향 상되었다면, 상기 모조 데이터 세트가 추가된 상기 원본 데이터 세트를 상기 공정 데이터 세트로 최종적으로 추 출할 수 있다. 이때, 공정성의 향상 정도는 상기 검증 모듈에 기 설정된 수치일 수 있으나, 특정 수치에 한정되지 않는다. 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 방법 도 4를 보면, 본 발명의 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 방법은 업로드 단계(S100), 반전 데이터 생성단계(S400), 모조 데이터 생성단계(S500), 모조 데이터 판별단계(S600) 및 검증단계(S700)를 포함한다. 보다 구체적으로, 상기 업로드 단계(S100)는 업로더에 의하여, 다수 개의 컬럼(Columns)을 갖는 원본 데이 터 세트가 업로드 된다. 본 발명의 일실시예에 따르면, 상기 업로드 단계(S100)는 공공데이터 포털의 OpenAPI로부터 CSV(Comma- Separated Values) 파일형식의 원본 데이터 세트가 획득되어 업로드될 수 있다. 상기 CSV 파일형식의 원본 데이 터 세트는 테이블(Table), 필드(Field), 컬럼(Column) 및 컬럼값으로 구성될 수 있다. 본 발명에서 언급하는 상기 테이블(Table)은 빠른 참조를 위해 적당한 형태로 자료를 모아 놓은 것으로, 관계 데이터베이스 모델에서 자료의 구조를 2차원의 표로 나타낸 것이다. 즉, 컬럼값과 컬럼(Column)의 형태로 관리 되며 키를 지정함으로써 원하는 자료를 빠르고 쉽게 찾아 낼 수 있다. 상기 필드(Field)는 어떠한 의미를 지니는 정보의 한 조각으로, 데이터베이스 시스템에서 처리의 최소 단위가 되는 것을 말한다. 상기 컬럼값은 관계형 데이터베이스에서 레코드(record) 또는 튜플(tuple)로 불리기도 하며, 어떤 테이블에서 단일 구조 데이터 항목을 가리킨다. 간단한 용어로, 데이터베이스 테이블은 컬럼값과 컬럼 (Column) 또는 필드로 구성되어 있다고 할 수 있다. 각 테이블의 컬럼값은 일련의 관련 자료를 나타내며, 테이 블에서 모든 컬럼값은 동일한 구조를 가지고 있다. 한편, 본 발명은 데이터 구조분석모듈에 의하여, 상기 원본 데이터 세트의 데이터 구조가 분석되고, 상기 원본 데이터 세트이 각 컬럼(Column)의 고유값만을 갖는 서브셋으로 분할되는 데이터 구조분석단계(S200)를 더 포함하는 것을 특징으로 한다. 예컨대, 상기 데이터 구조분석단계(S200)는 상기 원본 데이터 세트 내 임의의 컬럼(Column)에 대해서 컬럼값 A, 컬럼값 B 컬럼값 C 및 컬럼값 D를 갖는지 구조 분석될 수 있다. 그리고 상기 데이터 구조분석단계(S200)는 임의의 컬럼(Column)에 대해서 컬럼값 A를 갖는 데이터만이 모아져 서브셋 A로 분할되고, 임의의 컬럼(Column)에 대해서 컬럼값 B를 갖는 데이터만이 모아져 서브셋 B로 분할되고, 임의의 컬럼(Column)에 대해서 컬럼값 C를 갖는 데이터만이 모아져 서브셋 C로 분할되고, 임의의 컬럼(Column) 에 대해서 컬럼값 D를 갖는 데이터만이 모아져 서브셋 D로 분할될 수 있다. 따라서 상기 데이터 구조분석단계 (S200)는 상기 원본 데이터 세트가 상기 서브셋 A, 서브셋 B, 서브셋 C, 서브셋 D로 분할될 수 있다. 또한, 본 발명은 테스트 데이터 세트 생성모듈에 의하여, 상기 서브셋이 샘플링(Sampling)되어 테스트 데 이터 세트가 생성되고, 상기 모조 데이터 세트의 비교 검증이 가능하도록 상기 검증 모듈에 상기 테스트 데이터 세트가 전송되는 테스트 데이터 세트 생성단계(S300)를 더 포함하는 것을 특징으로 한다. 상기 테스트 데이터 세트 생성단계(S300)는 상기 원본 데이터 세트의 데이터 분포와 동일한 테스트 데이터 세트 가 생성되기 위해서 하나의 서브셋에서 편향되어 샘플링(Sampling)되는 것이 아닌, 각 서브셋마다 골고루 샘플 링(Sampling)되어 상기 테스트 데이터 세트가 생성될 수 있다. 다음으로, 상기 반전 데이터 생성단계(S400)는 딥러닝 모듈에 의하여, 상기 원본 데이터 세트가 반전된 반 전 데이터가 생성된다. 가장 바람직하게, 상기 반전 데이터 생성단계(S400)는 상기 원본 데이터 세트에서 상기 테스트 데이터 세트 생 성단계(S300)로부터 생성된 테스트 데이터 세트를 제외한 나머지 원본 데이터 세트를 대상으로 서브셋을 반전시 켜 상기 반전 데이터 세트가 생성될 수 있다. 본 발명에서 언급하는 반전은 각 서브셋의 레이블을 교체하는 동 작이다. 도 3의 일실시예에 따르면, 도 3의 (a)와 같이 상기 원본 데이터 세트에서 상기 테스트 데이터 세트를 제외한 나머지 원본 데이터 세트는 서브셋 A에 포함되는 데이터의 수가 100개, 서브셋 B에 포함되는 데이터의 수가 30 개일 수 있다. 그러면, 상기 반전 데이터 생성단계(S400)는 도 3의 (b)와 같이 서브셋 A와 서브셋 B를 반전시킴 으로써, 서브셋 B에 포함되는 데이터의 수가 100개, 서브셋 A에 포함되는 데이터의 수가 30개인 반전 데이터 세 트가 생성될 수 있다. 다음으로, 상기 모조 데이터 생성단계(S500)는 상기 딥러닝 모듈 내 모조 데이터 생성기에 의하여, 상기 반전 데이터 세트를 이용하여 모조 데이터 세트가 생성된다. 상기 모조 데이터 판별단계(S600)는 상기 딥 러닝 모듈 내 모조 데이터 판별기에 의하여, 상기 원본 데이터 세트를 기준으로 상기 모조 데이터 세 트가 판별된다. 한편, 상기 모조 데이터 생성단계(S500)와 상기 모조 데이터 판별단계(S600)는 GAN 모델을 기반으로 하는 것을 특징으로 한다. 일반적으로, GAN 모델은 상호적대적인 식별자(Discriminator)와 생성자(Generator)를 활용하여 기존 데이터와 비슷한 데이터를 인공적으로 생성하는 네트워크이고, 기계학습에서 비지도 학습에 속하는 모델이 다. 즉, 상기 딥러닝 모듈 내 GAN 모델은 상기 모조 데이터 생성기와 모조 데이터 판별기를 포 함하거나, 그 자체일 수 있다. 또한, 상기 모조 데이터 생성단계(S500)는 상기 반전 데이터 세트가 학습 데이터 세트로 입력됨으로써, 상기 반 전 데이터 세트와 동일한 컬럼들(Columns)을 갖지만 인공적으로 생성된 컬럼값들을 갖는 모조 데이터 세트가 생 성될 수 있다(S602). 이때, 상기 모조 데이터 생성단계(S500)는 도 3의 (c)와 같이 상기 원본 데이터 세트와 상 반된 편향 즉, 상기 반전 데이터 세트와 동일한 편향을 갖고 생성될 수 있다. 따라서 실제로 모든 데이터를 획득하기 위해서는 물리적으로 한계가 존재하는데, 본 발명은 소정의 실제 데이터 를 기반으로 인공 데이터가 생성됨으로써 실제 데이터를 보완할 수 있고 인공지능 모델의 학습량을 늘릴 수 있 는 현저한 효과가 있다. 또한, 상기 모조 데이터 판별단계(S600)는 상기 원본 데이터 세트가 학습 데이터 세트로 입력됨으로써, 상기 모 조 데이터 생성단계(S500)로부터 생성된 상기 모조 데이터 세트가 검증 및 판별될 수 있다. 다음으로, 상기 검증 단계(S700)는 검증 모듈에 의하여, 상기 모조 데이터 판별단계(S600)로부터 판별된 상기 모조 데이터 세트와 상기 원본 데이터 세트가 비교 검증된 후 공정성이 향상된 경우 공정 데이터 세트로 추출된다. 상기 검증 단계(S700)는 상기 테스트 데이터 세트 생성단계(S300)로부터 생성된 상기 테스트 데이터 세트를 전 송받을 수 있다. 즉, 상기 검증 단계(S700)로부터 비교 검증에 사용되는 상기 원본 데이터 세트는 가장 바람직 하게, 상기 원본 데이터 세트 중 테스트 데이터 세트를 일컫는다. 다시 말하면, 상기 검증 단계(S700)는 상기 테스트 데이터 세트를 제외한 상기 원본 데이터 세트에 상기 데이터 판별단계(S600)로부터 판별된 상기 모조 데이터 세트가 추가되어 특정 조건식에 따라 공정성 지표에 대한 공정 성 지표값(F1)이 도출될 수 있고, 상기 테스트 데이터 세트에 대해서 상기 특정 조건식에 따라 공정성 지표에 대 한 공정성 지표값(F2)이 도출될 수 있다(S701). 그리고 상기 검증 단계(S700)는 공정성 지표값(F1, F2) 간 비교를 통해서 상기 테스트 데이터 세트보다 상기 테 스트 데이터 세트를 제외한 상기 원본 데이터 세트에 상기 모조 데이터 세트가 추가된 데이터 세트가 공정성이 향상되었다면, 상기 모조 데이터 세트가 추가된 상기 원본 데이터 세트가 상기 공정 데이터 세트로 최종적으로 추출될 수 있다(S702). 이때, 공정성의 향상 정도는 상기 검증 모듈에 기 설정된 수치일 수 있으나, 특정 수치에 한정되지 않는다. 추출된 상기 공정 데이터 세트는 상기 도 3의 (d)와 같다. 도 2의 일실시예에 따르면, 도 2의 (a)와 같이 종래에는 원본 데이터 세트를 서브셋 A와 서브셋 B로 분할하고, 도 2의 (b)와 같이 기 설정된 비율에 따라 딥러닝 모델을 이용하여 각 서브셋의 모조 데이터 세트를 생성하고, 도 2의 (c)와 같이 원본 데이터 세트와 모조 데이터 세트를 합친 후 공정 데이터 세트를 출력할 수 있다. 다만, 도 2의 (c)를 보면, 종래기술은 상기 원본 데이터 세트에 편향을 보정하지 않은 채로 그대로 모조 데이터 세트를 생성한 후 합치고, 공정 데이터 세트를 출력함으로써 공정 데이터 세트 내 편향이 포함되어 있고, 이에 따라 향후 실질적으로 사용할 수 있는 공정 데이터 세트 내 서브셋별 데이터 수가 현저히 줄어들 수 있다. 그러나 도 3의 일실시예를 다시 보면, 본 발명은 도 3의 (a)와 같이 원본 데이터 세트를 서브셋 A와 서브셋 B로 분할하고, 도 3의 (b)와 같이 원본 데이터 세트를 이용하여 서브셋 간 레이블을 교체하는 동작인 반전을 통해서 반전 데이터 세트를 생성하고, 도 3의 (c)와 같이 반전 데이터 세트를 이용하여 반전 데이터 세트와 동일한 편 향을 갖는 모조 데이터 세트를 생성하고, 도 3의 (d)와 같이 공정 데이터 세트를 추출할 수 있다. 즉, 본 발명 은 공정 데이터 세트 내 편향을 제거함으로써 공정성을 향상시킬 수 있는 현저한 효과가 있다. 동시에, 향후 실 질적으로 사용할 수 있는 공정 데이터 세트 내 서브셋별 데이터 수가 종래보다 상당히 많을 수 있다. 따라서 본 발명은 원본 데이터 세트 내 편향을 보정할 수 있을 뿐만 아니라 향후 인공지능 모델을 학습하기 위 한 공정 데이터 세트 내 데이터의 양을 상당히 늘릴 수 있는 현저한 효과가 있다. 실시예들은 하드웨어, 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨어 기술 언어, 또는 이들의 임의의 조합에 의해 구현될 수 있다. 소프트웨어, 펌웨어, 미들웨어 또는 마이크로코드로 구현되는 경우, 필요한 작업 을 수행하는 프로그램 코드 또는 코드 세그먼트들은 컴퓨터 판독 가능 저장 매체에 저장되고 하나 이상의 프로 세서에 의해 실행될 수 있다. 그리고 본 명세서에 설명된 주제의 양태들은 컴퓨터에 의해 실행되는 프로그램 모듈 또는 컴포넌트와 같은 컴퓨 터 실행 가능 명령어들의 일반적인 맥락에서 설명될 수 있다. 일반적으로, 프로그램 모듈 또는 컴포넌트들은 특 정 작업을 수행하거나 특정 데이터 형식을 구현하는 루틴, 프로그램, 객체, 데이터 구조를 포함한다. 본 명세서 에 설명된 주제의 양태들은 통신 네트워크를 통해 링크되는 원격 처리 디바이스들에 의해 작업들이 수행되는 분 산 컴퓨팅 환경들에서 실시될 수도 있다. 분산 컴퓨팅 환경에서, 프로그램 모듈들은 메모리 저장 디바이스들을 포함하는 로컬 및 원격 컴퓨터 저장 매체에 둘 다에 위치할 수 있다."}
{"patent_id": "10-2022-0173278", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 으로 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달 성될 수 있다. 그러므로 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2022-0173278", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 장치 구성도이 다. 도 2는 원본 데이터 세트(a), 종래 딥러닝 기술을 이용한 모조 데이터 세트(b), 원본 데이터 세트와 종래 딥러 닝 기술을 이용한 모조 데이터를 합친 후 출력된 공정 데이터 세트(c)를 표시한 도면이다. 도 3은 원본 데이터 세트(a), 본 발명의 일실시예에 따라 생성된 반전 데이터 세트(b), 본 발명의 일실시예에 따라 생성된 모조 데이터 세트(c) 및 본 발명의 일실시예에 따라 추출된 공정 데이터 세트(d)를 표시한 도면이 다. 도 4는 본 발명의 인공지능 학습 데이터의 공정한 보장을 위한 대칭 구조 기반 모조 데이터 생성 방법 흐름도이 다."}
