{"patent_id": "10-2016-0168244", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0067006", "출원번호": "10-2016-0168244", "발명의 명칭": "양자점 기반의 양자역학적 인공 시각 시스템 및 연산 방법", "출원인": "서울시립대학교 산학협력단", "발명자": "안도열"}}
{"patent_id": "10-2016-0168244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 영상의 관심점들 사이를 연결하는 제1 라벨드 그래프 및 제2 영상의 관심점들 사이를 연결하는 제2 라벨드그래프를 획득하는 단계;제1 영상의 관심점들과 상기 제2 영상의 관심점들 간을 매칭시켜 점대점 조합을 생성하고, 임계치와 비교하여가장 큰 점대점 조합을 추가해가면서 컨플릭트 그래프를 생성하는 단계;상기 컨플릭트 그래프의 최대 독립적 집합을 찾아내기 위한 비제한적 이진 최적화식을 생성시키는 단계;상기 비제한적 이진 최적화식을 양자 시스템의 이징 모델(Ising model)로 변환시키는 단계; 및상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션을 구하는 단계; 를 포함하는 양자점 기반의 양자역학적 인공 시각 연산방법."}
{"patent_id": "10-2016-0168244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션을 구하는 단계는,매트릭스 형상으로 배열된 양자점을 이용하여 획득되는 것을 특징으로 하는 양자점 기반의 양자역학적 인공 시각 연산방법."}
{"patent_id": "10-2016-0168244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 양자점들 각각은 최단거리로 이웃하는 양자점 사이에서만 터널링 정션으로 연결된 것을 특징으로 하는 양자점 기반의 양자역학적 인공 시각 연산방법."}
{"patent_id": "10-2016-0168244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션을 구하는 단계에서,상기 이징 모델의 해밀토니안은 단열적 전개(adiabatic evolve)를 통해서 계산하는 것을 특징으로 하는 양자점기반의 양자역학적 인공 시각 연산방법."}
{"patent_id": "10-2016-0168244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 비제한적 이진 최적화식을 머신러닝을 통해서 반복 학습시키는 단계를 더 포함하는 것을 특징으로 하는 양자점 기반의 양자역학적 인공 시각 연산방법.공개특허 10-2018-0067006-3-청구항 6 영상을 획득하는 영상 획득 모듈;상기 영상 획득 모듈로부터 획득된 영상의 처리를 위한 양자 처리 프로세서; 및상기 양자 처리 프로세서의 연산에 필요한 자료들을 저장하는 메모리부;를 포함하고,상기 양자 처리 프로세서는,제1 영상의 관심점들 사이를 연결하는 제1 라벨드 그래프 및 제2 영상의 관심점들 사이를 연결하는 제2 라벨드그래프를 획득하고, 제1 영상의 관심점들과 상기 제2 영상의 관심점들 간을 매칭시켜 점대점 조합을 생성하고, 임계치와 비교하여가장 큰 점대점 조합을 추가해가면서 컨플릭트 그래프를 생성하고,상기 컨플릭트 그래프의 최대 독립적 집합을 찾아내기 위한 비제한적 이진 최적화식을 생성시키고,상기 비제한적 이진 최적화식을 양자 시스템의 이징 모델(Ising model)로 변환시키고,상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션을 구하는 것을 특징으로 하는 양자점 기반의 양자역학적 인공 시각 시스템."}
{"patent_id": "10-2016-0168244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 양자 처리 프로세서는,매트릭스 형상으로 배열된 양자점을 포함하는 것을 특징으로 하는 양자점 기반의 양자역학적 인공 시각 시스템."}
{"patent_id": "10-2016-0168244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 양자점들 각각은 최단거리로 이웃하는 양자점 사이에서만 터널링 정션으로 연결된 것을 특징으로 하는 양자점 기반의 양자역학적 인공 시각 시스템."}
{"patent_id": "10-2016-0168244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7 항에 있어서,상기 양자점 각각에 인접하여 상기 양자점의 전자를 검출하기 위한 전하 검출부를 더 포함하는 것을 특징으로하는 양자점 기반의 양자역학적 인공 시각 시스템."}
{"patent_id": "10-2016-0168244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6 항에 있어서,상기 양자 처리 프로세서는,상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션을 구하는 과정에서, 상기 이징 모델의 해밀토니안은 단열적 전개(adiabatic evolve)를 통해서 계산하는 것을 특징으로 하는 양자점 기반의 양자역학적 인공 시각 시스템.공개특허 10-2018-0067006-4-"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "특징점의 갯수가 증가함에 따라 발생되는 NP문제를 양자역학적 이징모델을 이용한 해밀토니안으로 대치하고, 메 트릭스 형상의 양자점을 이용하여 용이하게 계산할 수 있는 양자점 기반의 양자역학적 인공 시각 시스템 및 연산 방법이 개시된다. 이러한 양자점 기반의 양자역학적 인공 시각 연산방법은, 제1 영상의 관심점들 사이를 연결하 (뒷면에 계속)"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공 시각 시스템 및 연산 방법에 관한 것으로, 보다 상세히 양자점 기반의 양자역학적 인공 시각 시 스템 및 연산 방법에 관한 것이다."}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인간은 현재 물체 인식, 지식 표현, 추론, 학습 및 자연 언어 처리 등 여러 분야에서 기계를 통한 분석보다 뛰 어난 분석 능력을 가지고 있다. 이에 따라, 기계적으로 인간의 사고방식을 모방하거나 능가하기 위해서는 복잡 한 계산방식을 거쳐야 하므로 상당한 어려움이 따르고 있다. 그 중에 일 예로 인간이 시각적으로 인지하는 능력을 모방하거나 능가하기 위하여 인공 시각 시스템의 최적화 문제에 대한 정확한 솔루션이 요구 되고 있다. 인공 시각의 복잡한 계산 방법을 해결하기 위하여 양자 컴퓨팅을 이용한 양자 역학적 계산을 수행하는 방법이 있다. 양자 컴퓨터는 계산을 수행하기 위해서 하나 또는 그 이상의 양자 효과(quantum effect)들을 이용하는 소정의 물리적 시스템(physical system)이다. 다른 양자 컴퓨터를 효율적으로 시뮬레이트할 수 있는 양자 컴퓨터를 범 용 양자 컴퓨터(Universal Quantum Computer-UQC)라고 한다. 1. 양자 계산에 대한 접근방법 양자 컴퓨터들의 설계 및 운용에 대한 몇 가지 일반적인 접근방법이 있다. 하나의 접근방법은 양자 계산의 \"회로 모델(circuit model)\"에 해당한다. 이러한 접근방법에서는 큐빗들 (qubits)은 컴파일된(compiled) 알고리즘의 표현인 논리 게이트(logical gate)의 순서에 의해 동작한다. 회로 모델 양자 컴퓨터(circuit model quantum computer)들은 실제 실행과정에 있어서 몇 가지 심각한 장애(serious barrier)들을 가지고 있다. 회로 모델에서는 큐빗들(qubits)은 하나의 게이트 시간(single-gate time)보다 더 욱 오랜 기간의 시간 동안 코히런트(coherent)가 유지되도록 요구된다. 이러한 요구는 회로 모델 양자 컴퓨터 들이 동작하기 위해서 총괄적으로 양자 에러 정정(quantum error correction)이라고 불리는 동작들을 요구하기 때문에 발생한다. 양자 에러 정정은 하나의 게이트 시간의 약 1000배의 시간 간격 동안 양자 코히런스(quantum coherence)를 유지할 수 있는 회로 모델 양자 컴퓨터의 큐빗들 없이는 수행될 수 없다. 회로 모델 양자 컴퓨터 들의 기초 정보 유닛(basic information unit)들을 형성하기 충분한 코히런스를 갖는 큐빗들을 개발하는데 초점 을 맞춘 수많은 연구들이 있었다. 관련된 내용은 Shor, P. W. \"Introduction to Quantum Algorithms\", arXiv."}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "org:quantph/0005003, pp. 1-27 에 기재되어 있다. 이와 같은 기술분야는 실제 회로 모델 양자 컴퓨터들 을 설계하고 운용하는데 적합한 레벨까지 큐빗의 코히런스를 향상시키는 능력의 부족으로 인해 여전히 정체되고 있다. 2. 계산 복잡도 이론(Computational Complexity Theory) 컴퓨터 과학에서, 계산 복잡도 이론은 자원 또는 비용을 연구하는 계산 이론(theory of computation)과 주어진 계산 문제를 해결하는데 요구되는 계산 이론의 일종이다. 비용은 일반적으로 시간과 공간과 같이 계산 자원 (computational resources)으로 불리는 추상적인 파라미터들(abstract parameter)에 의해 측정된다. 시간은 문제를 해결하는데 필요한 단계(step)수를 의미하고, 공간은 요구되는 정보 저장량 또는 요구되는 메모리부의 양을 의미한다. 최적화 문제들(Optimization problems)은 하나 또는 그 이상의 목적함수(objective function)들이 변수들의 세 트에 관해서, 때로는 제약조건(constraints)의 세트들의 조건하에서 최소화되고, 최대화되는 문제들에 해당한다. 시뮬레이션 문제들은 일반적으로 보통 시간 간격 동안의 다른 시스템에 의한 하나의 시스템의 시뮬레이션을 다 룬다. 예를 들어, 컴퓨터 시뮬레이션들은 사업 프로세스(business process), 생태학적 서식지(ecological habitats), 단백질 접힘(protein folding), 분자 바닥 상태(molecular ground states), 양자 시스템(quantumsystems) 등으로 구성된다. 이러한 문제들은 종종 복잡한 상호 관계(complex inter-relationship) 및 행동 규 칙(behavioral rules)과는 다른 다양한 수많은 실재(entity)들을 포함한다. 파인만에서는 양자 시스템이 UTM 보다 더욱 효율적으로 몇몇의 물리적인 시스템을 시뮬레이션 하는데 사용될 수 있음이 제안된다. 많은 최적화 및 시뮬레이션 문제들은 UTM을 사용해서는 풀 수 없다. 이러한 제약 때문에, UTM의 범위를 넘어서 서 계산 문제를 풀 수 있는 계산 소자들이 요구된다. 최적화 문제를 해결하기 위한 다른 디지털 컴퓨터 기반의 시스템과 방법들은 발견될 수 있다. 이러한 최적화를 문제를 해결하기 위한 기술에 대한 일 예가 한국등록특허 제10-1309677호 \"단열 양자 연산 방 법\"에 기술되어 있다. 상기 선행기술은 복수의 큐빗들을 포함하는 양자 시스템을 사용하는 양자 계산 방법에 대한 내용으로, 양자 컴 퓨팅에서 최종적으로 원하는 최소 에너지( or 비용)를 구하기 위해 중첩 상태의 구성(configuration)을 동시에 트랙킹하는 양자 어닐링(Quantum annealing)이 가능하며, 특히 양자 어닐링을 수행하기 위하여 단열적 양자 계 산(Adiabatic Quantum Computation) 기법을 이용한다. 또한, AQC는 초기상태에서 목표상태까지 해밀토니안의 단열적 변화를 일으켜 최종적으로 원하는 목표 상태에서의 해(solution)를 구하는 기법을 사용한다. 위의 선행기술은 복잡한 문제를 해결하기 위한 양자 컴퓨팅 시스템의 일반적인 동작을 기술하고 있으며, 이러한 선행기술의 존재에도 불구하고 구체화된 복잡한 문제를 해결하기 위하여 최적화된 양자 시스템의 선택은 대단히 중요한 문제로 남아 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1309677호 (등록일 2013.09.11) (특허문헌 0002) 미국등록특허 제8,504,497호 (등록일 2013.08.06) 비특허문헌 (비특허문헌 0001) \"Introduction to Quantum Algorithms\", Shor, P. W., arXiv. org:quantph/0005003, pp. 1-27. (비특허문헌 0002) Nielsen and Chuang, \"Quantum Computation and Quantum Information\", Cambridge University Press, Cambridge, pp. 343-345."}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그에 따라서, 본 발명이 해결하고자 하는 과제는, 이미지 식별을 위한 특징점의 갯수가 증가함에 따라서 발생되 는 복잡도의 계산을 용이하게 할 수 있는 양자점 기반의 양자역학적 인공 시각 시스템 및 연산 방법을 제공하는 것이다."}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 과제를 해결하기 위한 본 발명의 예시적인 일 실시예에 의한 양자점 기반의 양자역학적 인공 시각 연산 방법은, 제1 영상의 관심점들 사이를 연결하는 제1 라벨드 그래프 및 제2 영상의 관심점들 사이를 연결하는 제2 라벨드 그래프를 획득하는 단계와, 제1 영상의 관심점들과 상기 제2 영상의 관심점들 간을 매칭시켜 점대점 조 합을 생성하고, 임계치와 비교하여 가장 큰 점대점 조합을 추가해가면서 컨플릭트 그래프를 생성하는 단계와, 상기 컨플릭트 그래프의 최대 독립적 집합을 찾아내기 위한 비제한적 이진 최적화식을 생성시키는 단계와, 상기 비제한적 이진 최적화식을 양자 시스템의 이징 모델(Ising model)로 변환시키는 단계, 및 상기 이징 모델의 해 밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션을 구하는 단계를 포함한다.예컨대, 상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루 션을 구하는 단계는, 매트릭스 형상으로 배열된 양자점을 이용하여 획득될 수 있다. 또한, 상기 양자점들 각각은 최단거리로 이웃하는 양자점 사이에서만 터널링 정션으로 연결될 수 있다. 한편, 상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션 을 구하는 단계에서, 상기 이징 모델의 해밀토니안은 단열적 전개(adiabatic evolve)를 통해서 계산될 수 있다. 또한, 이러한 양자점 기반의 양자역학적 인공 시각 연산방법은, 상기 비제한적 이진 최적화식을 머신러닝을 통 해서 반복 학습시키는 단계를 더 포함할 수 있다. 본 발명의 예시적인 일 실시예에 의한 양자점 기반의 양자역학적 인공 시각 시스템은, 영상 획득 모듈, 양자 처 리 프로세서 및 메모리부를 포함할 수 있다. 상기 영상 획득 모듈은 영상을 획득한다. 상기 양자 처리 프로세 서는 상기 영상 획득 모듈로부터 획득된 영상의 처리한다. 상기 메모리부는, 상기 양자 처리 프로세서의 연산 에 필요한 자료들을 저장한다. 상기 양자 처리 프로세서는, 제1 영상의 관심점들 사이를 연결하는 제1 라벨드 그래프 및 제2 영상의 관심점들 사이를 연결하는 제2 라벨드 그래프를 획득하고, 제1 영상의 관심점들과 상기 제2 영상의 관심점들 간을 매칭시켜 점대점 조합을 생성하고, 임계치와 비교하여 가장 큰 점대점 조합을 추가해 가면서 컨플릭트 그래프를 생성하고, 상기 컨플릭트 그래프의 최대 독립적 집합을 찾아내기 위한 비제한적 이진 최적화식을 생성시키고, 상기 비제한적 이진 최적화식을 양자 시스템의 이징 모델(Ising model)로 변환시키고, 상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션을 구 한다. 예컨대, 상기 양자 처리 프로세서는, 매트릭스 형상으로 배열된 양자점을 포함할 수 있다. 이때, 상기 양자점들 각각은 최단거리로 이웃하는 양자점 사이에서만 터널링 정션으로 연결될 수 있다. 또한, 상기 양자점 각각에 인접하여 상기 양자점의 전자를 검출하기 위한 전하 검출부를 더 포함할 수 있다. 한편, 상기 양자 처리 프로세서는, 상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제 한적 이진 최적화식의 솔루션을 구하는 과정에서, 상기 이징 모델의 해밀토니안은 단열적 전개(adiabatic evolve)를 통해서 계산할 수 있다."}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같이 본 발명에 의한 양자점 기반의 양자역학적 인공 시각 시스템 및 연산 방법에 의하면 특징점의 갯수가 증가함에 따라 발생되는 NP문제를 양자역학적 이징모델을 이용한 해밀토니안으로 대치하고, 메트릭스 형상의 양 자점을 이용하여 용이하게 계산할 수 있다."}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 본문에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면을 설명하면서 유사한 참조 부호를 유사한 구성 요소에 대해 사용하였다. 첨부된 도면에 있어서, 구조 물들의 치수는 본 발명의 명확성을 기하기 위하여 실제보다 과장하여 도시한 것일 수 있다. 제1, 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로만 사 용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성 요소로 명명될 수 있 고, 유사하게 제2 구성 요소도 제1 구성 요소로 명명될 수 있다. 본 출원에서 사용한 용어는 단지 특정한 실시예들을 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부분품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 또한, A와 B가'연결된다', '결합된다'라는 의미는 A와 B가 직접적으로 연결되거나 결합하는 것 이외에 다른 구성요소 C가 A와 B 사이에 포함되어 A와 B가 연결되거나 결합되는 것을 포함하는 것이다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 또한, 방법 발명에 대한 특허청구범위에서, 각 단계가 명확하게 순서에 구속되지 않는 한, 각 단계들은 그 순서가 서로 바뀔 수도 있다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예들을 보다 상세하게 설명하고자 한다. 도 1은 본 발명의 일 실시예에 따른 인공 시각 장치에서 서로 다른 영상 간 에 패턴을 인식하는 과정을 모델링한 도면이다. 인공 시각 장치에서 컴퓨터 또는 로봇은 미리 저장된 레퍼런스 패턴과 촬영된 영상을 비교하여 영상을 인식하며, 이 과정은 훈련 과정을 거쳐 고도화된다. 일반적으로 휴리스틱(heuristic) 알고리즘이라 불리는 알고 리즘이 특정한(particular) 타입의 영상에 적용되며, 휴리스틱 알고리즘은 영상에 따라서 다양하게 달리 적용될 수 있다. 일반적으로, 인간의 시각 및 시각 정보를 인지하는 뇌는, 서로 다른 영상 간의 패턴 매칭을 위하여, 각 영상이 나타내는 패턴을 적절하게 묘사할(describe) 수 있는 특징점들을 추출하고, 그 특징점들의 위치, 배열, 특징점 들 간의 거리 및 방향 등을 인식하여 종합적으로 특징점들 및 특징점들 간의 상대적 위치 정보를 패턴으로 인지 한다. 이후 인간의 뇌는 영상으로부터 추출한 패턴 정보를 비교하여 두 영상이 일치하는 지를 판정한다. 이러한 과정은 단순히 하나의 점과 점 간의 이동으로만 탐색하기는 어려우며, 주변의 점들을 포함한 패턴 간의 매칭을 구하는 것으로 이해할 수 있다. 그러나 일반적으로 제한된 지능을 가지는 인공 시각에서는 이러한 인간의 뇌에서 이루어지는 동작 또는 인간의 감각 데이터(sensory data)의 해석을 완전히 모사하기 극히 어렵다. 인간의 뇌에서 이루어지는 동작을 모사하는 것은 이른바 NPHard 문제(NP-Hard Problem)이라고 알려져 있다. 도 1에서는 서로 다른 영상 간의 패턴을 인식하는 과정을 모델링하고, 그 과정이 일반적인 NP-Hard 문제에 속함 을 설명한다. 도 1(a)와 도 1(b)의 영상은 서로 다른 영상이기는 하지만 동일한 물리적 구조(same physical structure)를 가진 영상의 다른 버전일 수 있다. 인공 시각에 관련된 패턴 인식 연산을 위해서는 각 영상 내에서 각 관심점(특징점)들 간의 상대적 위치 정보를 나타내는 일종의 관계 벡터들의 조합을 이용하며, 이러한 관계 벡터들 간의 조합은 각 영상을 인식하는 기준이 되는 패턴과 유사한 의미를 가지는 것으로 이해할 수 있다. 그런데 영상마다 기준이 되는 패턴을 추출하는 과정은, 특징점을 추출하는 과정과 어느 특징점들 간의 상대적 위치 정보를 관계 벡터로 인식할지 결정하는 과정으로 이루어질 수 있는데, 이는 결정론적(Deterministic)인 문 제로 풀 수 있는 것이 아니고, 결과를 비교해 가면서 최적화된 값을 찾아야 하는 비 결정론적(Non- deterministic)인 문제에 속한다. 도 1(a)의 영상 내의 관심점(특징점)들 i, j, k 간 관계 벡터들의 집합으로 이루어진 기준 패턴을 X라고 가정하 고, 도 1(b)의 영상 내의 관심점(특징점)들 α, β,γ 간 관계 벡터들로 이루어진 기준 패턴을 Y라고 가정하였 을 때, 도 1(a)의 영상의 기준 패턴 X와 도 1(b)의 영상의 기준 패턴 Y를 연산하기가 어려운 문제점이 있다. 도 1(a)의 영상과 도 1(b)의 영상 간의 매핑을 묘사하기 위해서는 도 1(a)를 가장 잘 묘사할 수 있는 기준 패턴 X와 도 1(b)를 가장 잘 묘사할 수 있는 기준 패턴 Y를 구해야 하며, 기준 패턴 X가 기준 패턴 Y로 어떻게 변위 (displace)하였는지도 연산을 통하여 도출해야 한다. 즉, 도 1(a)의 영상과 도 1(b) 간의 영상 간의 매핑을 묘 사하는 관계를 탐색하는 것은 가장 최적화된 기준 패턴 X와 기준 패턴 Y의 조합을 탐색하는 것으로 볼 수 있다.본 발명에서는 이 과정을 하나의 목표 함수(objective function)로 설정하고 목표 함수를 최소화하는 최적화 문 제로 고려하고자 한다. 이때의 최적화 문제는 앞에서 언급한 것처럼 NP-하드 문제로 알려져 있다. 본 발명에서는 이러한 최적화 문제를 양자 컴퓨팅을 이용하여 해결하고자 하며, 영상 내에서 각 관심점(특징 점)들 간의 연결을 나타내는 화살표를 쌍극자로 모델링한다. 이 때, 화살표는 각 관심점(특징점)들 간의 방향 과 길이를 의미하며, 벡터로 표현할 수도 있다. 이를 위하여 (i) 도 1(a)의 영상의 특징점과 도 1(b)의 영상에서 그 특징점이 대응하는 위치 간의 미스매치를 나타내는 항(term)과, (ii) 인접한 점의 조합들(matches) 간의 발산(divergence)을 측정함으로써 인접한 점의 조합들 간의 공간적 일관성(spatial consistency)를 나타내는 항(term)을 정의할 수 있다. 양자 컴퓨팅의 물리적 모델을 활용함으로써 도 1(a)에서의 가장 최적화된 패턴 X와 도 1(b)에서 가장 최적화된 패턴 Y를 동시에 찾을 수 있다. 도 1(a)의 영상에서 관심점(특징점)들 i, j, k간의 관계 벡터들의 조합과 도 1(b)의 영상에서 관심점(특징점)들 α, β, γ 간의 관계 벡터들의 조합을 한꺼번에 양자 컴퓨팅을 위한 물리적 모델로 모델링하고 물리적 모델을 관찰함으로써 최적화된 기준 패턴 X와 기준 패턴 Y를 함께 구할 수 있다. 최 적화된 상태는 물리적 모델의 에너지가 바닥 상태일 때의 물리적 모델의 상태를 취함으로써 얻을 수 있다. 예를 들어 양자 컴퓨팅이 가능한 블랙 박스 내에 물리적 모델을 구현하고, 물리적 모델을 이용하여 단열적 진화과정 을 거쳐 목표 상태(바닥 상태)가 되었을 때 블랙 박스 내의 물리적 모델의 물성을 관찰하면 그 결과로 얻어지는 최적화된 기준 패턴 X와 기준 패턴 Y를 구할 수 있다. 이때, 각 영상들의 관심점(특징점)들 간의 벡터 간 조합이 쌍극자 모델에 의하여 묘사되도록 쌍극자를 물리적 특성으로 포함하는 물리 모델을 블랙 박스 내의 물리 모델을 선택할 수 있다. 도 1(a)의 영상에서 관심점(특징점) i를 시작점으로 하고 j를 종점으로 하는 관계 벡터는 로 나타낼 수 있 다. 이 때, 관심점(특징점) i부터 j까지의 관계는 특징 지점들 간의 평행이동(translation) 뿐만 아니라 크기 (local scale) 및 방향(orientation)의 차이까지 포함한다. 관계 벡터 는 전역 이동, 회전, 및 스케일링 (global translation, rotation, and scaling)을 위하여 정규화될 수 있다. 도 1(a)에서의 특징점들 i, j, k의 그래프를 GA로 정의하고, 도 1(b)에서의 관심점(특징점)들 α, β, γ의 그 래프를 GB로 정의하면, 수학식 1은 각 영상에서 도출된 특징점들(i ∈ GA, ∈ GB)간의 거리에 대한 정의를 나타 낸다. 도 1(a)에서의 특징점들의 개수가 M이면, GA는 M개의 노드를 가지는 라벨드 그래프(labeled graph)로 표 현된다. 도 1(b)에서의 특징점들의 개수가 N이면, GB는 N개의 노드를 가지는 라벨드 그래프로 표현된다. 이때 는 GA의 ith 꼭지점에 대한 정규화된 특징벡터(normalized feature vector)를, 는 GB의 αth 꼭지점에 대 한 정규화된 특징 벡터를 의미한다. 정규화된 특징 벡터는 문헌에 따라서는 로컬 디스크립터(local descriptor)라 불리기도 한다. 예를 들면 정규화된 특징 벡터는 관심점 주변의 변이하는 크기와 방향의 가보 웨이블렛(Gabor wavelets of varying scale and orientation)에 기반한 벡터일 수도 있다. 그래프 GA 및 GB의 에지(edge)는 특징 벡터 간의 기하학적 관계(geometric relationship)를 나타낸다. 도 1(a) 영상 및 도 1(b) 영상 간의 유사도(similarity)는 두 개의 라벨드 그래프 GA 및 GB 간의 유사도를 구함으로써 확인할 수 있다. 수학식 1"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "d(i,α)는 특징 벡터 및 간의 내적(scalar product)이며, 상호 연관된 특징 벡터의 유사성의 척도로 해석할 수 있으며 정규화된 값이다.이 때 도 1(a)에서 얻어지는 점 i와 도 1(b)에서 얻어지는 점 α간의 조합을 (i, α)라 정의할 수 있다. 조합 (i, α)가 패턴을 기술(묘사)하는 데에 적합한 점대점 조합(potential match)인지를 나타내는 척도를 점 단위 포함 임계치(Point-wise Threshold)로서 Tfeature라 정의한다면 조합 (i, α)가 d(i, α) > Tfeature를 만족하는 경 우 조합 (i, α)가 영상의 패턴을 기술하는 데에 적합한 점대점 조합(potential match)이라고 해석할 수 있다. 도 1(a)와 도 1(b)의 그래픽 표현의 유사성을 측정하는 척도로서 그래프 GA와 GB로부터 컨플릭트 그래프 GC를 생 성할 수 있다. 가장 큰 d(i, α) 값을 가지는 조합 (i, α)를 시작으로 영상의 패턴을 기술하는 데에 적합한 가능한 점대점 조합을 컨플릭트 그래프 GC의 꼭지점 Viα으로서 순차적으로 더함으로써 컨플릭트 그래프 GC를 생 성할 수 있다. 컨플릭트 그래프 GC를 생성하는 과정은 모든 적합한 점대점 조합이 포함될 때까지 반복적으로 이 루어질 수 있다. 컨플릭트 그래프 GC 내의 엣지 (i, α; j, β)는 도 1(a)의 영상에 대응하는 라벨드 그래프 GA 내의 벡터 와 사이의 기하학적 일관성(geometric consistency) 및 도 1(b)의 영상에 대응하는 라벨드 그래프 GB 내의 벡 터 와 사이의 기하학적 일관성을 인코드하여 나타내는 척도로 해석할 수 있다. 컨플릭트 그래프 GC 내의 모든 꼭지점 페어 (Viα, Vjβ) (단, i≠j 및 α≠β인 경우)에 대해서 관심점들 간의 두 페어들의 기하학적 일관성 d(i,α,j,β) = dgeometric(, )을 계산할 수 있다. 이 때 기하학적 일관성 d(i,α,j,β) = dgeometric(, )은 정규화된 값일 수 있다. 기하학적 일관성은 매칭된 점대점 페어 (i,α)와 (j,β)의 기하학적 양립 가능성(geometric compatibility)을 측정하는 수단이 될 수 있다. 이 때 기하학적 일관성은 매칭된 점대점 페어 (i,α)와 (j,β) 간의 글로벌 이동 (global translation), 회전(rotation) 및 크기 변환(scaling)에 따른 변화가 정규화된 이후, 연관된 관심점들 의 국지적 변이(local displacement), 크기 변환, 및 회전에 의한 영향의 남은 차이(residual difference)를 반영할 수 있으므로, 기하학적 양립 가능성을 측정하는 수단이 될 수 있다. 만일 정규화된 이후에 남은 차이가 너무 크면 페어 (i,α)와 (j,β)는 기하학적으로 충돌하는 상태(in geometric conflict)이고 양립 가능하지 않은 것으로 해석되므로, 매칭되는 것이 허용되지 않는다. 기하학적 일관성 d(i,α,j,β) = dgeometric(, )이 기하학적 충돌 임계값 Tgeometric에 대하여 d(i,α, j,β)< Tgeometric의 조건을 만족하면 점대점 페어 (i,α)와 (j,β)는 서로 기하학적으로 충돌하는 상태로 간주된 다. 컨플릭트 그래프 GC는 기하학적으로 충돌하는 상태에 있는 꼭지점 페어 (Viα, Vjβ)에 대하여 에지를 가진다. 이때 i≠j 이고, α≠β 임은 앞에서 설명한 바와 같다. 이러한 방법으로 컨플릭트 그래프 GC는 최대 L개의 꼭 지점을 가질 수 있다. 컨플릭트 그래프의 최대 독립적 집합(maximum independent set)은 언라벨드 그래프 (unlabeled graph) GA와 GB의 최대 공통 서브그래프와 등가적(equivalent to the maximum common subgraph)이다. 컨플릭트 그래프 Gc의 최대 독립적 집합을 찾는 과정은 하기 수학식 2와 같 은 이차의 비제한적 이진 최적화 문제(quadratic unconstrained binary optimization problem)로 해석될 수 있 다.수학식 2"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이때 모든 꼭지점에 대해서 Qiα,jβ=1이고, 컨플릭트 그래프 상의 엣지가 존재하는 점대점 페어 (i,α)와 (j,β)에 대해서는 Qiα,jβ=L이 주어진다. 최소 에너지 구성은 Viα가 최대 독립적 집합에 속할 때에만 Xiα= 1이 주 어지고, 나머지 경우에는 Xiα = 0이 주어진다. 수학식 2는 잘 알려진 NP-하드 문제로서 L이 증가하면 계산시 간은 매우 빠른 속도로 증가하는 것이 잘 알려져 있다. 이하에서는 수학식 2를 양자 역학적 이징 모델(Quantum Ising Model)에 대한 단열적 양자 계산(adiabatic quantum computation)에 적용하기 위하여 변형한다. N개의 부울 변수(Boolean Variables)의 열벡터를 라 하고 N x N 행렬을 Q라 하면, 상기 수학식 2는 하기 수학식 3과 같이 나타내어질 수 있다. 수학식 3"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "한편, 양자 역학적 이징 문제는 상기 수학식 3에 S = 2X - 1 의 관계식을 적 용하여 변수를 X에서 S로 교체하면 하기 수학식 4와 같이 나타낼 수 있다. 수학식 4"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "변수 S는 양자 역학적 스핀(quantum-mechanical spin)으로 불리며, 양자 역학적 이징 모델은 양자 컴퓨팅의 한 특정 모델인 단열 양자 컴퓨팅(AQC)에 의해 해를 구할 수 있다. 양자 역학에서 스핀 상태의 S = ±1는 힐베르트 공간(Hilbert space) 내에 서 직교 벡터를 의미하는 큐빗(qubits)을 이용하여 표시될 수 있다. 큐빗(qubits)의 두 상태는 하기 수학식 5 의 벡터에 의하여 기술될 수 있다.수학식 5"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "큐빗들을 중첩(superposition)이라 불리는 선형 조합(linear combination)에 의하여 벡터로 확장할 수 있으며, 이 과정은 수학식 6과 같이 나타내어진다. 수학식 6"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "큰 양자 시스템은 개별적인 큐빗 벡터 공간의 텐서 곱(tensor product)을 통 해 구성된다. 예를 들어, 수학식 7로 나타낼 수 있다. 수학식 7"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "N 개의 큐빗(qubit) 상태의 중첩(superposition)은 개별적인 N 스핀 상태 각각을 관찰할 수 있는 확률을 표현하 는 연관된 진폭(associated amplitudes)을 가질 수 있다. 또한, 단일 큐빗 연산자(single qubit operator)를 하기 수학식 8과 같이 정의할 수 있다. 수학식 8"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "수학식 8의 연산자를 수학식 5의 큐빗 벡터에 적용하면 하기 수학식 9와 같은 결과를 얻을 수 있다. 수학식 9"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "2-큐빗 상태에서, 연산자 σZ I는 첫 번째 큐빗의 고전적인 스핀을 추출하고, 연산자 I σZ 는 두 번째 큐빗의 고전적인 스핀을 추출하며, 연산자σZ σZ 는 두 개의 고전적인 스핀의 곱을 추출할 수 있다. N 스핀 양자 역학적 이징 모델은 하기 수학식 10과 같은 2Nx2N 해밀토니안으로 표시된다. 수학식 10"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "이 때, σZi는 ith 큐빗에 작용하는 연산자 σZ를 의미한다. 양자 시스템을 초기화하기 위하여, 다른 종류의 스핀 연산자 σZ를 하기 수학식 11과 같이 정의할 수 있다. 수학식 11"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "수학식 11의 스핀 연산자는 큐빗의 상태를 반전시킬(flip) 수 있다. 이때 ith 큐빗에 작용하는 스핀 연산자를 이용하여 기저 상태 해밀토니안(ground state Hamiltonian)을 하기 수 학식 12와 같이 나타낼 수 있다. 수학식 12"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "그리고 수학식 12의 기저 상태 해밀토니안의 고유 상태(eigenstate)는 하기 수학식 13과 같이 나타낼 수 있다. 수학식 13"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "수학식 13의 양자 상태의 시간 의존성은 하기 수학식 14의 슈뢰딩거 방정식으로 나타낼 수 있다. 수학식 14"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "양자 역학적 이징 모델을 단열적으로 풀기 위해 t=0에 |Ψ> = |Φ>0으로 주어진 초기 조건을 이용하면 단열 해밀토니안의 콘벡스 형태(convex form)는 하기 수학식 15와 같이 나타낼 수 있다. 수학식 15"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "t=0에서 양자 시스템은 가장 낮은 에너지 상태를 가진다. 이때 가장 낮은 에너지 상태는 모든 고전적인 구성 에 대하여 동등한 확률을 줄 수 있다. 반면 t=T에서는 인공 시각 문제를 풀기 위한 양자 역학적 이징 모델 문 제에 대응하도록 설계된다. 이러한 방식으로, 고전적으로는 처리하기 어려운 NP-하드 문제를 주어진 양자 시스템의 양자 역학적 단열 진화 를 통하여 해결할 수 있다. 단열 양자 컴퓨팅(AQC, Adiabatic Quantum Mechanics)에 의하여 얻어진 전역적으로 가장 낮은 고전적 구성 (globally lowest classical configuration)은 인공시각과 관련된 복잡한 연산 문제인 2차 비한정 이진 최적화 문제에 대한 해가 될 수 있다. 양자 컴퓨팅이 NP-하드 문제를 해결하는 데에 고전적인 방법에 비하여 지수함수 적 가속(exponential speed-up)을 제공할 수 있음은 수학적으로 증명되어 있다. 상기 수학식 2에 의하여 규정된 이차 비한정 이진 최적화 문제를 풀기 위하여 단열 양자 컴퓨팅 시스템을 훈련 하는 과정은, 먼저 분류 알고리즘을 이용한 하드웨어 훈련으로부터 시작된다. 분류 알고리즘은 하기 수학식 16 과 같이 나타내어 진다. 수학식 16"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "이 때, x∈RM는 분류될 입력 패턴이고, y∈{-1, 1}는 분류기에 의하여 분류된 출력을 의미한다. hi : RM-->{-1, 1}는 특징을 탐지하는 x의 함수이며, ωi∈{0,1}는 훈련 동안 최적화를 위한 가중치를 나타낸다. 훈련은 하기 수학식 17에 나타난 이산 최적화 문제(discrete optimization problem)를 해결함으로써 이루어질 수 있다. 수학식 17"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "이때 상기 수학식 17은 S개의 훈련 샘플 에 대하여 기술된다. 이하에서는 인공 시각 문제를 풀기 위한 하드웨어 구현 및 하드웨어를 기술할 수 있는 수학식을 설명한다. 도 2는 두 개의 양자점 스핀 큐빗의 개념도이다. 도 2에서는 스핀 을 갖으며, 터널링 정션으로 연결된 두 개의 양자점에 포획된 전자를 보여준다. 이러한 양자점 게이트에 의해 정의된(gate-defined) 양자점 구조를 가질 수 있다. 이러한 시 스템에 의한 해밀토니안은 아래의 수학식 18에 의해 주어진다. 수학식 18"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "이 식에서 J12(t)는 외부 바이어스에 의해 제어된다. 각각 전자의 개별적인 스핀 검출은 전하 검출부에 의 해서 수행된다. 한편, N 개의 양자점에 의한 해밀토니안은 아래의 수학식 19에 의해 기술될 수 있다. 수학식 19"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "위의 수학힉 19에서 Jij 및 hi는 양의 값을 갖는 변수로서, 외부의 전원을 인가함에 따라서 변동된다. 게이트에 인가하는 바이어스 전압은 양자 처리 프로세서의 해밀토니안을 계산하기 위하여 적절히 조절될 수 있다. 초기(t=0)에서의 해밀토니안은 모든 i 및 j에 대하여 Jij = 0이다. 수학식 15에서 T 값은 로 정의되 고, ΔΕ는 초기 그라운드 상태와 글로벌 최소 에너지 사이의 간격이다. 도 3은 본 발명의 예시적인 실시예에 의한 양자 처리 프로세서의 양자점 배열을 도시한 개념도이고, 도 4는 본 발명의 예시적인 실시예에 의한 양자점 기반 양자역학적 인공 시각 시스템의 블럭도이다. 도 3 및 도 4를 참조하면, 본 발명의 예시적인 실실예에 의한 양자점 기반 양자역학적 인공 시각 시스템은 영상 획득 모듈, 양자 처리 프로세서 및 메모리부를 포함할 수 있다.상기 영상 획득 모듈은 영상을 획득한다. 상기 영상 획득 모듈은 예컨대 CCD 카메라를 포함할 수 있 다. 상기 양자 처리 프로세서는 상기 영상 획득 모듈로부터 획득된 영상의 처리한다. 상기 메모리부는, 상기 양자 처리 프로세서의 연산에 필요한 자료들을 저장한다. 상기 양자 처리 프로세서는, 제1 영상의 관심점들 사이를 연결하는 제1 라벨드 그래프 및 제2 영상의 관심 점들 사이를 연결하는 제2 라벨드 그래프를 획득하고, 제1 영상의 관심점들과 상기 제2 영상의 관심점들 간을 매칭시켜 점대점 조합을 생성하고, 임계치와 비교하여 가장 큰 점대점 조합을 추가해가면서 컨플릭트 그래프를 생성하고, 상기 컨플릭트 그래프의 최대 독립적 집합을 찾아내기 위한 비제한적 이진 최적화식을 생성시키고, 상기 비제한적 이진 최적화식을 양자 시스템의 이징 모델(Ising model)로 변환시키고, 상기 이징 모델의 해밀토 니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션을 구한다. 예컨대, 상기 양자 처리 프로세서는, 도 3에서 도시된 바와 같은 매트릭스 형상으로 배열된 양자점을 포함할 수 있다. 이때, 상기 양자점들 각각은 최단거리로 이웃하는 양자점 사이에서만 터널링 정션으로 연결될 수 있다. 또한, 상기 양자점 각각에 인접하여 상기 양자점의 전자를 검출하기 위한 전하 검출부를 더 포 함할 수 있다. 한편, 상기 양자 처리 프로세서는, 상기 이징 모델의 해밀토니안을, 양자점을 기반하여 계산함으로써 상기 비제한적 이진 최적화식의 솔루션을 구하는 과정에서, 상기 이징 모델의 해밀토니안은 단열적 전개 (adiabatic evolve)를 통해서 계산할 수 있다. 이러한 프로세스는 앞서 자세히 설명되었으므로, 중복되는 설명 은 생략한다. 이와 같이 본 발명에 의한 양자점 기반의 양자역학적 인공 시각 시스템 및 연산 방법에 의하면 특징점의 갯수가 증가함에 따라 발생되는 NP문제를 양자역학적 이징모델을 이용한 해밀토니안으로 대치하고, 메트릭스 형상의 양 자점을 이용하여 용이하게 계산할 수 있다. 앞서 설명한 본 발명의 상세한 설명에서는 본 발명의 바람직한 실시예들을 참조하여 설명하였지만, 해당 기술분"}
{"patent_id": "10-2016-0168244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "야의 숙련된 당업자 또는 해당 기술분야에 통상의 지식을 갖는 자라면 후술될 특허청구범위에 기재된 본 발명의 사상 및 기술 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2016-0168244", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 주요 관심점에서 관심점 간의 관계 벡터간 상호작용을 모델링한 도면이다. 도 2는 두 개의 양자점 스핀 큐빗의 개념도이다. 도 3은 본 발명의 예시적인 실시예에 의한 양자 처리 프로세서의 양자점 배열을 도시한 개념도이다. 도 4는 본 발명의 예시적인 실시예에 의한 양자점 기반 양자역학적 인공 시각 시스템의 블럭도이다."}
