{"patent_id": "10-2010-0127684", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2012-0066373", "출원번호": "10-2010-0127684", "발명의 명칭": "지능형 마케팅 지원 시스템", "출원인": "국민대학교산학협력단", "발명자": "김현수"}}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "마케팅 이슈와, 상기 마케팅 이슈와 관련된 마케팅 모델과, 상기 마케팅 모델의 변수들을 정의하고 관리하는모델링 데이터베이스와;마케팅 관련 데이터를 저장하는 마케팅 데이터베이스와;마케팅 관련 데이터를 수집하여 상기 마케팅 데이터베이스에 저장하고 관리하는 데이터 통제부와;상기 모델링 데이터베이스에 정의된 마케팅 모델의 변수들에 관련된 데이터를 상기 마케팅 데이터베이스에서추출하여 상기 마케팅 모델을 통해 마케팅 이슈를 산출하는 마케팅 모델링부와;사용자와 시스템 전체의 처리 블럭간의 입출력을 처리하는 사용자 인터페이스;를 포함하는 지능형 마케팅 지원 시스템."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 지능형 마케팅 지원 시스템이 : 상기 모델링 데이터베이스에 저장된 마케팅 모델을 학습을 통해 갱신하는 마케팅 모델 자동학습부;를 더 포함하는 지능형 마케팅 지원 시스템."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 자동학습부가 : 상기 모델링 데이터베이스에 저장된 마케팅 모델들을 시스템의 처리 사례를 통해 갱신하는 사례 자동학습부;를 포함하는 지능형 마케팅 지원 시스템."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 마케팅 모델링부는 :상기 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이터로부터 제품 선호도를 산출하는 선호도산출부와;상기 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이터로부터 시장 점유율을 산출하는 점유율 산출부;를 포함하는 지능형 마케팅 지원 시스템."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 마케팅 모델링부는 : 상기 마케팅 데이터베이스에 저장된 마케팅 데이터로부터 STP(segmentation/ targeting/ positioning) 절차에따라 시장세분화/ 표적시장/포지셔닝 과정을 지원하는 STP 지원부;를 포함하는 지능형 마케팅 지원 시스템."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 마케팅 모델링부는 : 상품이나 서비스(product), 판매장소(place), 가격(price), 판매촉진(promotion)에 관련된 마케팅 변수들이공개특허 10-2012-0066373-3-매출에 미치는 영향을 추정하는 마케팅 믹스(marketing mix) 시뮬레이션부;를 포함하는 지능형 마케팅 지원시스템."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 마케팅 모델링부는 : 상기 모델링 데이터베이스에 정의된 컨셉 기반 마케팅 모델의 변수들에 관련된 데이터를 상기 마케팅 데이터베이스에서 추출하여 상기 컨셉 기반 마케팅 모델을 통해 제품 컨셉 단계에서의 시장 수요를 추정하는 컨셉기반 수요추정부와;상기 모델링 데이터베이스에 정의된 품질 기반 마케팅 모델의 변수들에 관련된 품질 평가 데이터를 상기 마케팅 데이터베이스에서 추출하여 품질 기반 마케팅 모델을 통해 품질 기반 시장 수요를 추정하는 품질 기반 수요추정부와;상기 모델링 데이터베이스에 정의된 시험시장 테스트 기반 마케팅 모델의 변수들에 관련된 시험시장 테스트데이터를 상기 마케팅 데이터베이스에서 추출하여 시험시장 테스트 기반 마케팅 모델을 통해 시험시장 테스트기반 시장 수요를 추정하는 시험시장 테스트 기반 수요추정부;를 포함하는 지능형 마케팅 지원 시스템."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서, 상기 데이터 통제부가 : 제품 및 고객 정보, 제품수명주기(product life cycle) 상의 자료를 웹에서 수집하는 웹정보수집로봇부와;무선 알에프태그 기반 통신망으로부터 제품 수명 주기 상의 데이터를 수집하는 태그정보수집부;를 포함하는데이터 수집관리부;를 포함하는 지능형 마케팅 지원 시스템."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서, 상기 지능형 마케팅 지원 시스템이 : 설문대상자를 샘플링하고 설문을 생성하며 네트워크를 통해 설문을 진행하여 결과를 상기 마케팅 데이터베이스에 저장하는 설문 관리부;를 더 포함하는 지능형 마케팅 지원 시스템."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "마케팅 관련 데이터를 수집하여 마케팅 데이터베이스에 저장하는 데이터 수집 단계와;모델링 데이터베이스에 정의된 마케팅 모델의 변수들에 관련된 데이터를 상기 마케팅 데이터베이스에서 추출하여 상기 마케팅 모델을 통해 마케팅 이슈를 산출하는 마케팅 모델링 단계와;산출된 마케팅 이슈를 사용자에게 출력하는 출력 단계;를 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서, 상기 지능형 마케팅 처리 방법이 : 상기 모델링 데이터베이스에 저장된 마케팅 모델을 학습을 통해 갱신하는 마케팅 모델 자동학습 단계;를 더포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2012-0066373-4-제 11 항에 있어서, 상기 자동학습 단계가 : 상기 마케팅 모델링 단계에서 처리된 사례를 통해 상기 모델링 데이터베이스에 저장된 마케팅 모델들을 갱신하는 사례 자동학습 단계;를 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 10 항에 있어서, 상기 마케팅 모델링 단계는 :상기 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이터로부터 제품 선호도를 산출하는 선호도 산출 단계와;상기 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이터로부터 시장 점유율을 산출하는 점유율 산출 단계;를 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 10 항에 있어서, 상기 마케팅 모델링 단계는 : 상기 마케팅 데이터베이스에 저장된 마케팅 데이터로부터 STP(segmentation/ targeting/ positioning) 절차에따라 시장세분화/ 표적시장/포지셔닝 과정을 지원하는 STP 지원 단계;를 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 10 항에 있어서, 상기 마케팅 모델링 단계는 : 상품이나 서비스(product), 판매장소(place), 가격(price), 판매촉진(promotion)에 관련된 마케팅 변수들이매출에 미치는 영향을 추정하는 마케팅 믹스(marketing mix) 시뮬레이션 단계;를 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 10 항에 있어서, 상기 마케팅 모델링 단계는 : 상기 모델링 데이터베이스에 정의된 컨셉 기반 마케팅 모델의 변수들에 관련된 데이터를 상기 마케팅 데이터베이스에서 추출하여 상기 컨셉 기반 마케팅 모델을 통해 제품 컨셉 단계에서의 시장 수요를 추정하는 컨셉기반 수요추정 단계;를 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 10 항에 있어서, 상기 마케팅 모델링 단계는 : 상기 모델링 데이터베이스에 정의된 품질 기반 마케팅 모델의 변수들에 관련된 품질 평가 데이터를 상기 마케팅 데이터베이스에서 추출하여 품질 기반 마케팅 모델을 통해 품질 기반 시장 수요를 추정하는 품질 기반 수요추정 단계;를 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 10 항에 있어서, 상기 마케팅 모델링 단계는 : 상기 모델링 데이터베이스에 정의된 시험시장 테스트 기반 마케팅 모델의 변수들에 관련된 시험시장 테스트데이터를 상기 마케팅 데이터베이스에서 추출하여 시험시장 테스트 기반 마케팅 모델을 통해 시험시장 테스트공개특허 10-2012-0066373-5-기반 시장 수요를 추정하는 시험시장 테스트 기반 수요추정 단계;를 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 10 항에 있어서, 상기 데이터 수집 단계가 : 제품 및 고객 정보, 제품수명주기(product life cycle) 상의 자료를 웹에서 수집하는 웹정보수집 단계;를 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 10 항에 있어서, 상기 데이터 수집 단계가 : 무선 알에프태그 기반 통신망으로부터 제품 수명 주기 상의 데이터를 수집하는 태그정보수집단계;를 포함하는지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 10 항에 있어서, 상기 지능형 마케팅 처리 방법이 : 설문대상자를 샘플링하고 설문을 생성하며 네트워크를 통해 설문을 진행하여 결과를 상기 마케팅 데이터베이스에 저장하는 설문 관리 단계;를 더 포함하는 지능형 마케팅 처리 방법."}
{"patent_id": "10-2010-0127684", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 10 항 내지 제 21 항에 따른 지능형 마케팅 처리 방법이 구현된 프로그램이 저장된 컴퓨터가 판독 가능한기록 매체.명 세 서기 술 분 야본 발명은 컴퓨터에 의해 처리되는 경영지원 기술에 관련되며, 특히 마케팅 지원을 위한 컴퓨터에 의한 데이 [0001]터 처리 기술에 관련된다. 배 경 기 술기업들이 판매하는 제품이나 제공하는 서비스의 경쟁력을 높이기 위해서는 고객과 고객의 활동에 대한 체계적 [0002]인 이해와 이에 기초한 효율적이고 효과적인 마케팅 활동이 필요하다. 그러나 마케팅 활동에는 데이터 수집과 처리에 많은 비용과 인력, 그리고 시일이 소요된다. 대부분 마케팅을 위한 데이터 수집은 수작업으로 이루어진다. 기존의 마케팅 지원 솔루션은 설문작성, 간단한 통계분석 등의 단순한 모듈로 이루어져 있다. 마케팅 이론의 발달로 시장을 다수의 기준에 따라 동질적인 세분 시장들로 세분하고(segmentation) 그 세분 [0003]시장 중에서 집중해야할 세분 시장을 선택하여(targeting) 제품이 소비자에게 차별화될 수 있는 특성을 도출(positioning)하고, 그에 따라 흔히 4P라고 불리는 제품(product), 판매장소(place), 가격(price), 판매촉진의 형태(promotion)를 포함하는 마케팅 믹스(marketing mix)의 요소들에 대한 투입을 결정하는 과정에 많은이론들이 제시되었다. 그렇지만, 이러한 일련의 마케팅 과정을 유기적으로 결합하여 경영자에게 의사결정을할 수 있도록 지원해주는 시스템이 제안되지 못하였다. 발명의 내용공개특허 10-2012-0066373-6-해결하려는 과제본 발명은 일련의 마케팅 기획 과정을 컴퓨터에 의해 자동화하는 것을 목적으로 한다. [0004]나아가 본 발명은 제품 기획 단계부터 사업화를 위한 시장 출시전략 및 시장관리에 이르는 전 마케팅 단계의 [0005]다양한 이슈를 효과적으로 해결할 수 있는 컴퓨터에 의한 마케팅 솔루션을 제공하는 것을 목적으로 한다. 나아가 본 발명은 자료 축적에 따라 마케팅 지원 과정을 자동학습을 통해 갱신함으로써 새로운 이슈에 대한 [0006]대응이나 기존 이슈에 대한 향상된 대응이 가능하도록 하는 것을 목적으로 한다. 추가로 기존에 수작업으로 진행하던 고객 데이터 수집 과정을 자동화하는 것을 목적으로 한다. [0007] [0008]과제의 해결 수단상기 목적을 달성하기 위한 일 양상에 따르면, 지능형 마케팅 지원 시스템은 마케팅 관련 데이터를 수집하고 [0009]관리하는 데이터 통제부와, 마케팅 모델의 변수들에 관련된 데이터를 마케팅 데이터베이스에서 추출하여 마케팅 모델에 적용함으로써 마케팅 이슈를 산출하는 마케팅 모델링부를 포함한다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 모델링 데이터베이스에 저장된 마케팅 모델 [0010]을 학습을 통해 갱신하는 마케팅 모델 자동학습부를 더 포함할 수 있다. 일 양상에 따르면, 자동학습부는 시스템의 처리 사례를 통해 마케팅 모델을 갱신할 수 있다. [0011]본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이 [0012]터로부터 제품 선호도를 산출하는 선호도 산출부와, 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이터로부터 시장 점유율을 산출하는 점유율 산출부를 포함할 수 있다. 이는 모델링 데이터베이스에 선호도 모델과 점유율 모델이 저장되어 있음을 의미한다. 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 마케팅 데이터베이스에 저장된 마케팅 데이터로부터 [0013]STP(segmentation/ targeting/ positioning) 절차에 따라 시장세분화/표적시장/포지셔닝 과정을 지원하는 STP지원부를 포함할 수 있다. 또한, 마케팅 모델링부는 상품이나 서비스(product), 판매장소(place), 가격(price), 판매촉진(promotion)에 [0014]관련된 마케팅 변수들이 매출에 미치는 영향을 추정하는 마케팅 믹스(marketing mix) 시뮬레이션부를 포함할수 있다. 더 나아가 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 모델링 데이터베이스에 정의된 컨셉 기반 마 [0015]케팅 모델의 변수들에 관련된 데이터를 마케팅 데이터베이스에서 추출하여 이 컨셉 기반 마케팅 모델을 통해제품 컨셉 단계에서의 시장 수요를 추정하는 컨셉 기반 수요추정부를 포함할 수 있다. 추가적으로 마케팅 모델링부는 모델링 데이터베이스에 정의된 품질 기반 마케팅 모델의 변수들에 관련된 품질 평가 데이터를 마케팅 데이터베이스에서 추출하여 품질 기반 마케팅 모델을 통해 품질 기반 시장 수요를 추정하는 품질 기반 수요추정부를 포함할 수 있다. 추가적으로, 마케팅 모델링부는 모델링 데이터베이스에 정의된 시험시장 테스트 기반 마케팅 모델의 변수들에 관련된 시험시장 테스트 데이터를 마케팅 데이터베이스에서 추출하여 시험시장 테스트 기반 마케팅 모델을 통해 시험시장 테스트 기반 시장 수요를 추정하는 시험시장 테스트 기반 수요추정부를 포함할 수 있다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 마케팅 관련 데이터를 수집하여 마케팅 데이 [0016]터베이스에 저장하고 관리하는 데이터 통제부를 포함한다. 일 양상에 따르면, 데이터 통제부는 제품 및 고객정보, 제품수명주기(product life cycle) 상의 자료를 웹에서 수집하는 웹정보수집로봇부와, 무선 알에프태그기반 통신망으로부터 제품 수명 주기상의 데이터를 수집하는 태그정보수집부를 포함할 수 있다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 설문대상자를 샘플링하고 설문을 생성하며 [0017]네트워크를 통해 설문을 진행하여 결과를 마케팅 데이터베이스에 저장하는 설문 관리부를 더 포함할 수 있다. 발명의 효과공개특허 10-2012-0066373-7-본 발명에 따르면, 다양한 마케팅 이슈에 관련되는 마케팅 모델들이 마케팅 데이터를 변수로 정의되고 데이터 [0018]베이스로 관리됨으로써 다양한 마케팅 이슈에 대해 체계적이고 통합적인 자동화된 데이터 처리가 가능해진다. 나아가 마케팅 모델이 축적된 자료 데이터를 자동 학습하여 갱신됨으로써, 시스템의 성능이 스스로 개선되고 [0019]새로운 마케팅 모델을 생성하여 기능을 확장하는 것이 가능해진다. 또한, 번거로운 설문조사를 컴퓨터에 의해 지원받음으로써 반자동화하여 비용과 시간을 절감할 수 있다. [0020]도면의 간단한 설명도 1은 다수의 컴퓨터를 통해 구현된 본 발명의 일 실시예에 따른 지능형 마케팅 지원 시스템의 개략적인 구 [0021]성을 도시한다. 도 2는 본 발명의 일 실시예에 따른 지능형 마케팅 지원 시스템의 개략적인 구성을 도시한 블럭도이다. 발명을 실시하기 위한 구체적인 내용전술한, 그리고 추가적인 본 발명의 양상들은 첨부된 도면을 참조하여 기술되는 바람직한 실시예들을 통해 더 [0022]욱 명확해질 것이다. 이하에서는 이러한 본 발명의 양상들을 당업자가 용이하게 이해하고 재현할 수 있을 정도로 상세히 설명한다. 도 1은 다수의 컴퓨터를 통해 구현된 본 발명의 일 실시예에 따른 지능형 마케팅 지원 시스템의 개략적인 구 [0023]성을 도시한다. 지능형 마케팅 지원 시스템은 일련의 소프트웨어 모듈들이 유기적으로 통합된 시스템이다.이들 소프트웨어 모듈들은 하나 혹은 복수의 컴퓨터에서 실행될 수 있다. 일 실시예에 있어서 이 컴퓨터 혹은 컴퓨터들은 네트워크를 통해 타 컴퓨터로 접속될 수 있다. 도 1에서 점선으로 도시된 부분은 본 발명에따른 지능형 마케팅 지원 시스템이 복수의 서버에서 구현된 실시예를 도시하며, 점선 바깥은 이 시스템이 접속된 외부 장치들을 예시적으로 도시한다. 도 1에 도시된 바와 같이, 데이터베이스 서버(17)는 마케팅 데이터와, 마케팅 모델들을 관리한다. 모델링 서 [0024]버(13)는 마케팅 이슈에 대응하는 마케팅 모델을 이용하여 마케팅 데이터를 처리하여 이슈에 대한 답을 산출한다. 자동학습 서버(15)는 자료들을 분석하여 자동학습함으로써 마케팅 모델들을 갱신하거나 생성한다. 사용자들은 각각의 컴퓨터들(31,33,35)을 통해 웹서버(11)로 접속함으로써 본 발명에 따른 지능형 마케팅 지원시스템을 사용할 수 있다. 데이터 수집 서버(19)는 네트워크를 통해 외부 컴퓨터들로 접속하여 마케팅 데이터를 수집한다. 일 예로, 데 [0025]이터 수집 서버(19)는 태그정보 관리 서버(70)로 접속할 수 있다. 태그정보 관리서버(70)는 상품에 부착된알에프 태그들과 통신하여 PLM(Product Lifecycle Management : 제품 수명주기 관리) 데이터를 수집한다. 이를 통해 단순한 거래 정보뿐만 아니라 상품의 생산에서부터 출하, 선적, 배송, 판매, 반품에 이르는 전 과정을 실시간으로 추적, 모니터링한다. 또한, 데이터 수집 서버(19)는 인터넷망(50)을 통해 수많은 웹페이지를 검색하여 마케팅 데이터를 수집한다. [0026]이러한 마케팅 데이터 수집은 웹로봇이라고 불리는 소프트웨어에 의해 이루어진다. 그러나 도 1에 도시된 시스템은 일 실시예에 불과하며, 본 발명에 따른 지능형 마케팅 지원 시스템은 간단한 몇 개의 모델에 기초하여단일의 개인용 컴퓨터에서 실행되는 패키지 프로그램 형태로 구현될 수도 있다. 도 2는 본 발명의 일 실시예에 따른 지능형 마케팅 지원 시스템의 개략적인 구성을 도시한 블럭도이다. 도시 [0027]된 바와 같이 일 실시예에 따른 지능형 마케팅 지원 시스템은 마케팅 이슈와, 상기 마케팅 이슈와 관련된 마케팅 모델과, 이 마케팅 모델의 변수들을 정의하고 관리하는 모델링 데이터베이스(110)와, 마케팅 관련 데이터를 저장하는 마케팅 데이터베이스(130)와, 마케팅 관련 데이터를 수집하고 관리하는 데이터 통제부(800)와,마케팅 모델의 변수들에 관련된 데이터를 마케팅 데이터베이스에서 추출하여 마케팅 모델에 적용함으로써 마케팅 이슈를 산출하는 마케팅 모델링부(300)를 포함한다. 마케팅 이슈란 기업이 마케팅을 함에 있어서 문제가 되는 사항들을 말한다. 예를 들어 '제품 컨셉 단계에서 [0028]주 고객을 어느 계층으로 할 것인가?', '특정한 고객층을 상대로 어떠한 마케팅을 실행했을 때 매출은 어떻게 될 것인가?', '시장 점유율은 어떻게 될 것인가?' 와 같은 이슈들이다. 이러한 마케팅 이슈들이 예를 들공개특허 10-2012-0066373-8-면 상호간의 관련성에 따라 트리 구조와 같은 구조체에 의해 구조화되어 데이터베이스로 관리되고, 이를 통해체계적인 의사결정 지원이 가능하다. 본 발명의 일 양상에 따라서 이러한 마케팅 이슈들은 마케팅 모델에 의해 컴퓨터에 의해 산출된다. 예를 들어 [0029]마케팅 모델은 그러한 이슈에 영향을 미치는 변수들을 대수적으로 조합하여 생성될 수 있다. 그러나 마케팅모델은 일련의 절차로 이루어진 모델일 수도 있다. 각 절차마다 마케팅 이슈에 관련된 다양한 변수들을 산출하는 모델들이 정의된다. 모델링 데이터베이스(110)에는 마케팅 이슈별 마케팅 모델들이 저장된다. 이러한마케팅 모델은 데이터 구조체나 또는 테이블 형태로 정의될 수 있다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 마케팅 관련 데이터를 수집하여 마케팅 데이 [0030]터베이스(130)에 저장하고 관리하는 데이터 통제부(800)를 포함한다. 일 양상에 따르면, 데이터 통제부(800)는 웹정보수집로봇부(811)와 태그정보수집부(813)를 포함하는 데이터 수집관리부(810)와, 단말기를 통해 입력되는 마케팅 데이터를 관리하는 데이터 입력 모듈(830)을 포함한다. 웹정보수집로봇부(811)는 일 실시예에 있어서 제품 및 고객 정보와, 제품수명주기(product life cycle) 상의 [0031]마케팅 자료를 웹에서 수집한다. 예를 들어 웹정보수집로봇부(811)는 신제품에 대한 사용 후기, 블로그나 까페에 게시된 사용자의 평가의견을 자동 혹은 반자동으로 수집하여 마케팅 데이터베이스(130)에 저장한다. 또다른 예로 웹정보수집로봇부(811)는 경쟁사의 웹사이트를 방문하여 경쟁사의 제품의 스펙, 할인 판매 등의 이벤트, 배송 관련 정보와 같은 데이터를 자동화해서 수집한다. 또 다른 예로 웹정보수집로봇부(811)는 온라인 상의 서베이를 통해 패널 데이터를 수집한다. 이는 소비자들 [0032]의 자발적 참여 네트워크를 근간으로 한다. 이를 위해 소비자들의 참여를 유도 위해 관련 제품평가정보에 대한 기준(Norm)을 구축하여 소비자들에게 유용한 정보를 제공해 줌으로써 자발적으로 자신의 평가정보를 제공해주고, 제공한 정보에 대한 개인적 피드백 등 다양한 형태로 정보를 생성하고 공유할 수 있는 장을제공한다. 이러한 서베이 데이터는 지속적인 기획 데이터 형태로 수집하거나 단발성 설문조사를 통해 수집할수 있다. 또한, 이러한 데이터는 웹을 통해서 및/또는 모바일 기기를 통해 수집할 수 있다. 일 실시예에 있어서, 제품 기획, 상용화, 유통, 구매, 소비에 이르는 제품 생산 소비 주기별로 품질평가속성 [0033]이 정의된다. 물리적/기능적 품질, 유통/서비스 품질, 소비자 지각 품질(구매초기 평가, 브랜드평가 등)에 따른 측정지표들이 생산자, 유통망, 혹은 웹을 통해 수집되고, 이들 정보로부터 물리적 품질 지수, 유통 품질지수, 지각 품질 지수가 도출되고 이들을 종합하여 종합 품질 지수가 정의된다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 설문대상자를 샘플링하고 설문을 생성하며 [0034]네트워크를 통해 설문을 진행하여 결과를 마케팅 데이터베이스(130)로 저장하는 설문 관리부(900)를 더 포함할 수 있다. 일 실시예에 따르면, 설문 관리부(900)는 설문 대상자를 샘플링하는 표본추출모듈과, 리스트작성기, 그리고 기존 설문 DB를 활용하여 설문 문항을 작성하고, 레이아웃(layout)을 선택한 후 온라인에 설문을 등록하는 서베이 자동생성 모듈을 포함한다. 추가로 설문 관리부(900)는 조사 대상자의 기존 응답 히스토리 정보를 통해 응답 이력을 추적하여 진행 서베이의 응답을 과거 응답과 비교하는 서베이 추적 모듈과 응답자의 신청에 따라 설문조사별 인센티브를 제공하고 누적 인센티브를 관리하는 인센티브 관리 모듈을포함한다. 본 발명의 또 다른 양상에 따르면, 데이터 수집관리부(810)는 무선 알에프태그 기반 통신망으로부터 제품 수 [0035]명 주기 상의 데이터를 수집하는 태그정보수집부(813)를 포함하는 포함할 수 있다. 일 실시예에 있어서, 태그정보 수집부(813)는 제품 수명주기 관리를 통해 얻어지는 PLM(product lifecycle management) 데이터를 수집한다. PLM Data는 제품에 대한 상세 정보와 제품 사용기간 동안 생기는 이벤트 및 의사결정에 관한 정보를포함하고 있다. 일 실시예에 있어서, 이러한 데이터 수집은 EPCIS(Electronic Product Code InformationService) 표준 기술에 기반하고 있다. EPCglobal 네트워크는 EPC 코드와 RFID 기술을 근간으로 물류 정보 교환을 위해서 물류 객체에 [0036]EPC(Electronic Product Code)를 할당하는 방법에 대한 표준을 제공한다. 이 기술을 통해 기업은 공급사슬(Supply Chain) 상에서 상품을 추적하여 객체의 가시성, 추적성, 자동화, 보안성을 추구하여 재고 최소화, 상품 손실 최소화, 주문의 신속한 처리, 소비자 기호 변화에 따른 대응능력 향상 등을 달성할 수 있다. 이러한 EPCIS 기술의 구조(Architecture)는 EPC가 기록된 알에프 태그, 태그의 정보를 읽어 들이는 장치인 리 [0037]더(reader), 리더로 읽은 태그 정보를 정제하고 취합, 중복된 정보를 제거하고 정보를 그룹화하는ALE(Application Layer Event), 정제된 EPC 정보를 저장하고 제공하는 EPC IS(Information Service),공개특허 10-2012-0066373-9-EPCglobal Network 상에서 글로벌 검색서비스를 제공하는 ONS(Object Name Service), EPCglobal Network에서물류 정보사용자가 EPC에 대한 정보를 찾고 이에 접근할 수 있도록 하는 역할을 하는 EPCIS DS(DiscoverySystem)로 구성되어 있다. EPCIS는 미들웨어로부터 태그 이벤트 정보를 받아 이를 이용해 상품의 상태 및 추적 정보를 생성하여 미래의 [0038]사용을 위해 로컬 저장소에 저장하고 관리한다. 또한, EPC에 대한 정보취합의 허브역할을 담당하며, EPC 미들웨어는 소프트웨어 구성요소로서 EPCglobal Network 구조에서 소프트웨어와 하드웨어를 연결하는 역할을 수행하고 EPC 실시간 이벤트 정보를 관리하면서 EPCIS 및 기존 시스템과 연동하기 위한 정보를 관장한다. EPCIS데이터는 비즈니스 프로세스 실행 과정에서 발생하며, 무엇을(What), 언제(when), 어디서(Where), 왜 [0039](Why) 라고 하는 4차원 구조를 가진다. 이러한 4차원 구조를 가진 EPCIS 기술을 이용해 제품 기획, 생산 유통 및 소비에 이르는 제품 수명주기 전과정에 수반되는 정보와 고객 정보를 단일화된 정보체계로 관리하고 이를 마케팅 정보 추출에 활용할 수 있다. 본 발명의 추가적인 양상에 따라, 일 실시예에 따른 데이터 통제부(800)의 각각의 기능부들(811,813,830)은 [0040]데이터를 수집함에 있어서 비정형적인 정보들의 취합을 용이하게 하기 위하여 입력 데이터를 시멘틱(semantic) 연계 처리하기 위해 데이터 시멘틱 표준(850)을 참조한다. 이를 통해 비정형화된 정보들이 연계되어 자동/반자동적인 입력이 가능하다. 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부(300)는 마케팅 데이터베이스(130)에 저장된 제품 스펙과 [0041]패널 데이터로부터 제품 선호도를 산출하는 선호도 산출부(331)와, 마케팅 데이터베이스(130)에 저장된 제품스펙과 패널 데이터로부터 시장 점유율을 산출하는 점유율 산출부(333)를 포함할 수 있다. 이는 모델링 데이터베이스(110)에 선호도 모델과 점유율 모델이 저장되어 있음을 의미한다. 제품의 기능이나 품질 등 각 제품 속성별로 수준값으로 정의되는 스펙과, 유통 방법, 광고비, 그리고 개별 소 [0042]비자들로부터 수집된 패널 데이터 등의 투입 변수에 대해 개별 소비자들의 상품 구매 선택 확률에 관련된 제품의 선호도나 이로부터 산출될 수 있는 시장 점유율은 다양한 수학적인 모델로 추정될 수 있다. 본 발명에따른 마케팅 모델링부(300)는 동적 판매 확산 프로세스(Dynamic Sales Diffusion Process: 시장진입 초기부터시간에 따른 신제품 매출 추세 예측) 계열모델과 정적 균형 시장 점유율(Static Equilibrium Market Share:신제품이 시장에 정착했을 때의 시장 점유율 예측) 계열모델을 결합하여 점유율을 산출한다. 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부(300)는 마케팅 데이터베이스(130)에 저장된 마케팅 데이 [0043]터로부터 STP(segmentation/ targeting/ positioning) 절차에 따라 시장세분화/ 표적시장/포지셔닝 과정을 지원하는 STP 지원부(371)를 포함할 수 있다. 필립 코틀러에 의해 제시된 마케팅 경영관리 과정은 시장 조사등의 조사 (research, R), 시장세분화 (Segmentation, S), 표적시장 설정 (Targeting, T), 포지셔닝(Positioning, P), 마케팅 믹스(marketing mix, MM)의 결정, 마케팅 믹스의 실행 (Implementation, I), 피드백을 얻고, 결과를 평가하며, STP 전략이나 마케팅믹스 전술을 수정 또는 개선을 포함하는 통제(Control, C)의 과정이다. 코틀러(Philip Kotler)에 의하면 효과적인 마케팅은 조사로부터 출발한다. 시장을 조사하면 각기 다른 욕구를 [0044]가진 소비자들로 구성된, 서로 다른 세분시장들(S)이 드러난다. 기업은 자신들이 경쟁자보다 탁월하게 충족시킬 수 있는 세분시장을 설정(T)하는 것이 현명하다. 기업은 각 표적시장별로 상품을 포지셔닝(P)하여, 자사 상품이 경쟁상품과 어떻게 다른가 하는 것을 알려야 한다. STP는 기업의 전략적 마케팅 사고를 대표한다.기업은 STP를 바탕으로 하여 제품, 가격, 유통, 촉진결정들의 믹스로 구성된 전술적 마케팅 믹스인 MM을 개발한다. 그런 뒤 기업은 마케팅 믹스를 실행(I)한다. 마지막으로 통제 측정치(C)를 사용하여, 결과를 모니터 및평가하고, STP전략과 MM 전술을 개선한다. STP 지원부(371)는 설문 관리부(900)나 데이터 통제부(800)에서 수집되어 마케팅 데이터베이스(130)에 수집된 [0045]데이터에 기초하여 시장 세분을 지원하며, 각각의 세분 시장 특성을 상호간에 비교하거나 전략에 매칭되는 시장의 제시를 통해 시장을 설정하도록 지원한다. 이러한 설정된 표적시장에 대해 STP 지원부(371)는 제품 스펙과 표적시장의 특성을 입력으로 최선의 마케팅 믹스를 결정할 수 있도록 시뮬레이션을 제공한다. 또한, 이러한 시뮬레이션 결과 소비자 선호도 및 시장 점유율을 추정한다. 마케팅 믹스 시뮬레이션에 대해서는 이하에 상술한다. 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부(300)는 마케팅 데이터베이스(130)에 저장된 마케팅 데이 [0046]공개특허 10-2012-0066373-10-터로부터 상품이나 서비스(product), 판매장소(place), 가격(price), 판매촉진(promotion)에 관련된 마케팅변수들이 매출에 미치는 영향을 추정하는 마케팅 믹스(marketing mix) 시뮬레이션부(373)를 포함할 수 있다.마케팅 믹스 시뮬레이션부(373)는 STP 지원부(371)에 의해 호출되는 모듈일 수 있다. 마케팅 믹스란 기업이 마케팅 목표에 따라 설정한 표적 시장에 마케팅 활동을 집중시키기 위해 사용하는 모든 [0047]투입변수 등을 해당기업의 환경과 상황에 맞게, 그리고 마케팅 효과가 최대화되도록 배합하는 마케팅 전술을의미한다. 마케팅 믹스의 요소는 상품이나 서비스(product), 판매장소(place), 가격(price),판매촉진의 형태(promotion) 등으로 흔히 4Ps라고 한다. 마케팅 믹스의 구성요소는 이외에도 제품계획, 판매경로, 광고,수송보관, 포장, 디스플레이 등 다양하다. 마케팅의 효과를 높이기 위해서는 이러한 모든 요소들을 마케팅의전략적 목표에 결합시키고, 그 목표에 입각하여 각 부문의 기능을 유기적으로 결합하여 동원하면서, 전체적인마케팅 활동을 실시해야 한다. 마케팅 믹스는 우선 제품 믹스, 프로모션 믹스, 판매경로 믹스 등 하부 믹스를 먼저 형성하고, 이들 하부 믹스들을 통합, 구성하여 가장 효율적인 마케팅 믹스를 실현하게 된다. 실제로이러한 믹스는 기업의 종류, 상태에 따라 전략적으로 변경되며, 시장표적에 따라 달리 형성된다.마케팅 믹스 시뮬레이션부(373)는 시험시장 평가결과와 설문 조사 결과, 그리고 설정된 제품 스펙을 토대로 [0048]유통망을 시뮬레이션하는 마케팅 믹스 최적화 모델에 기초하여 수요의 최대점을 파악하도록 지원한다. 더 나아가 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부(300)는 모델링 데이터베이스(110)에 정의된 컨 [0049]셉 기반 마케팅 모델의 변수들에 관련된 데이터를 마케팅 데이터베이스(130)에서 추출하여 이 컨셉 기반 마케팅 모델을 통해 제품 컨셉 단계에서의 시장 수요를 추정하는 컨셉 기반 수요추정부(391)를 포함할 수 있다.이를 통해 신상품의 출시 후 성패를 파악하는 기존의 의사결정과정을 지양하고, 컨셉 단계에서 사전에 시장성을 판단함으로써 성공율을 향상시키고 기회비용을 최소화할 수 있다. 컨셉 기반 수요추정부(391)는 광고비 투입에 따른 인지율을 예측함으로써 광고비 투입효과를 모델링하고, 컨 [0050]셉 신상품의 침투율을 예측하는 모델링을 통해 시장성을 조기 파악하고 컨셉대안, 컨셉수정, 시제품 단계 진행 등의 의사결정이 가능토록 지원한다. 또 모델링에 관여된 주요 변수를 자동적으로 데이터베이스화하여 의사결정 준거기준 (norm)을 구축할 수 있도록 시스템화한다. 이러한 과정은 먼저 설문 관리부(900)를 통해 소비자로부터 신제품 컨셉트와 신제품 프로토타입에 대한 평가 [0051](구매의향, 전반적 평가, 구체적 속성평가 등) 정보를 수집하는 것으로 시작된다. 이후에 구매의향 자료를활용하여 소비자의 시험구매 확률과 재구매확률을 예측한다. 이후에 제품 컨셉트에 대한 호의가 프로토타입에 이어지는지, 시험구매가 재구매로 이어지는지를 예측하기 위해서 확률 매트릭스를 구성한다. 다음으로,소비자의 컨셉트 및 제품에 대한 전반적 평가 및 구체적 속성 평가가 구매확률과 어떤 관계가 있는지를 추정하는 수리모형을 통해 구매 확률을 산출한다. 최종적으로 확률 매트릭스와 수리모형을 바탕으로 컨셉트 및 프로토타입에 대한 시험구매 가능성과 재구매 가능성을 예측한다. 이와 관련하여 동적 판매 확산 프로세스 모델(Dynamic Sales diffusion Process Model)은 인지 모듈 [0052](Awareness Module), 시험 모듈(Trial Module), 반복 구매 모듈(Repeat Module), 총 매출 모듈(Total VolumeModule)별로 수리모형을 통해 시장진입 초기부터 시간에 따른 신제품 매출 추세 예측한다. 동시에 정적 균형시장 점유율 모델(Static Equilibrium Market Share Model)은 시험 및 재구매 모듈(Trial and Repeat Module)과 시장 점유율 추정 모듈(Market Share Estimation Module), 선호도 모듈(Preference Module), 판매원 모듈(Source of Sales Module)별로 수리모형을 통해 신제품이 시장에 정착했을 때의 시장 점유율을 예측한다. 이를 통해 컨셉 기반 수요추정부(391)는 신제품의 예상 매출뿐 아니라 시장에 제자리를 잡을 때까지 걸리는 [0053]시간을 제시하고, 신제품 매출의 근원(Source of Sales)을 파악함으로써 경영 의사결정을 지원한다. 추가적으로 마케팅 모델링부(300)는 모델링 데이터베이스(110)에 정의된 품질 기반 마케팅 모델의 변수들에 [0054]관련된 품질 평가 데이터를 마케팅 데이터베이스(130)에서 추출하여 품질 기반 마케팅 모델을 통해 품질 기반시장 수요를 추정하는 품질 기반 수요추정부(393)를 포함할 수 있다. 시제품의 품질이 고객가치기반에 의한 평가 없이 출시되어 실패할 확률을 최소화하고, 품질 개선 포인트를 파 [0055]악하기 위하여, 품질 기반 수요추정부(393)는 품질 평가를 통해 소비자의 장기적 수요가능성 (반복구매력)을모델링하고, 반복구매량 추정을 통해 완성제품 제작 여부 및 품질 기반 수요를 추정한다. 나아가 이 모델에관여되는 주요 변수를 자동으로 데이터베이스화하여 준거기준을 축적한다. 추가적으로, 마케팅 모델링부(300)는 모델링 데이터베이스(110)에 정의된 시험시장 테스트 기반 마케팅 모델 [0056]의 변수들에 관련된 시험시장 테스트 데이터를 마케팅 데이터베이스(130)에서 추출하여 시험시장 테스트 기반공개특허 10-2012-0066373-11-마케팅 모델을 통해 시험시장 테스트 기반 시장 수요를 추정하는 시험시장 테스트 기반 수요추정부(395)를 포함할 수 있다.기존의 신상품 출시 후 시장반응에 따른 의사결정시스템은 많은 비용과 경영리스크를 수반하게 되는데, 이를 [0057]출시전에 가장 완성제품에 가까운 상태로 개발하여 시험시장테스트(simulated test market)를 함으로써 출시리스크와 비용을 최소화할 수 있다. 시험시장 테스트 기반 수요추정부(395)는 가장 출시상태에 근접한 컨셉과제품품질을 동시에 고객가치기반으로 평가하여 출시 후 총수요를 추정하는 모델을 기초로 총 수요량 및 시장점유율을 추정한다. 또한, 이 모델에 관여되는 주요 변수를 자동으로 데이터베이스화하여 준거기준을 축적한다. 품질 기반 수요추정부(393)와, 시험시장 테스트 기반 수요추정부(395)는 전술한 컨셉 기반 수요추정부(391)와 [0058]기초로 하는 데이터가 차이가 있지만 처리 과정은 유사하여 상세한 설명은 생략한다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 모델링 데이터베이스(110)에 저장된 마케팅 [0059]모델을 학습을 통해 갱신하는 마케팅 모델 자동학습부(500)를 더 포함할 수 있다. 일 실시예에 있어서, 마케팅 모델 자동학습부(500)는 마케팅 모델링부(300)에서 사용되는 다양한 모델들에 대응되어 제시된다. 도 2는이러한 다양한 모델링에 대한 자동학습부들(510, 531, 533, 571, 573, 591, 593, 595)을 도시하고 있다. 모델링 데이터베이스(110)에는 각각의 마케팅 이슈에 관련되는 모델들과 그 모델에 관여되는 주요 변수가 자 [0060]동으로 데이터베이스화되어 축적된다. 주요 변수들이 자동으로 데이터베이스화되므로 해당 마케팅 이슈에 영향을 미치는 변수들을 새롭게 추가하거나 영향력을 평가하는 것이 가능하다. 마케팅 의사결정 결과의 시간적흐름에 따른 패턴인식을 위해서 인공 지능 기술이 적용될 수 있다. 마케팅 모델 자동학습부(500)는 마케팅모델과 그에 관여된 변수나 파라미터의 유의미성을 예를 들면 회귀분석의 R-square 등을 통해 검증한다. 마케팅 데이터에 의해 정의되는 어떤 상황에서 마케팅 이슈의 의사결정 과정을 분석하여 관성이나 직관이 아닌정확한 계량모델에 의해서 유의미한 의사결정 정보를 도출해 내고 주기적으로 피드백한다. 이를 통해 자료의축적에 따른 지식의 축적 효과를 극대화하고 축적된 지식을 확대 재생산할 수 있다. 일 양상에 따르면, 자동학습부(500)는 시스템의 처리 사례를 통해 마케팅 모델을 갱신하는 사례자동학습부 [0061](510)를 포함할 수 있다. 일 실시예에 따른 사례자동학습부(510)는 본 발명에 따른 지능형 마케팅 지원 시스템의 활용 과정에서 축적된 분석 사례를 통해서 마케팅의사결정에 활용된 모델과 그 모델에 관여되는 변수나파라미터들을 변화하는 환경에 맞게 자동으로 업데이트하여 체계적이고 과학적인 마케팅 이슈에 따른 의사결정시스템을 구축할 수 있도록 한다. 부호의 설명110모델링 데이터베이스 130 마케팅 데이터베이스 [0062]300마케팅 모델링부 331선호도 산출부333점유율 산출부 371STP 지원부373마케팅 믹스 시뮬레이션부391컨셉 기반 수요추정부 393품질 기반 수요추정부395시험시장 테스트 기반 수요 추정부500마케팅모델 자동학습부510사례 자동학습부 531선호도 모델 자동학습부533점유율 모델 자동학습부 571STP 모델 자동학습부573마케팅 믹스 모델 자동학습부591컨셉 기반 모델 자동학습부593품질 기반 모델 자동학습부595시험시장 테스트 기반 모델 자동학습부공개특허 10-2012-0066373-12-700사용자 인터페이스 800데이터 통제부810데이터 수집관리부 811웹정보 수집 로봇부813태그정보 수집부 830데이터 입력 모듈850데이터 시멘틱 표준 900설문관리부도면도면1공개특허 10-2012-0066373-13-도면2공개특허 10-2012-0066373-14-"}
{"patent_id": "10-2010-0127684", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "제시된 지능형 마케팅 지원 시스템은 마케팅 관련 데이터를 수집하고 관리하는 데이터 통제부와, 마케팅 모델 의 변수들에 관련된 데이터를 마케팅 데이터베이스에서 추출하여 마케팅 모델에 적용함으로써 마케팅 이슈를 산출하는 마케팅 모델링부를 포함한다. 추가적으로 모델링 데이터베이스에 저장된 마케팅 모델을 학습을 통해 갱신하는 마케팅 모델 자동학습부이 구비된다. 다양한 마케팅 이슈에 관련되는 마케팅 모델들이 마케팅 데이터를 변수로 정의되고 데이터 베이스로 관리됨으 로써 다양한 마케팅 이슈에 대해 체계적이고 통합적인 자동화된 데이터 처리가 가능해진다. 나아가 마케팅 모 델이 축적된 자료 데이터를 자동 학습하여 갱신됨으로써, 시스템의 성능이 스스로 개선되고 새로운 마케팅 모 델을 생성하여 기능을 확장하는 것이 가능해진다."}
{"patent_id": "10-2010-0127684", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 컴퓨터에 의해 처리되는 경영지원 기술에 관련되며, 특히 마케팅 지원을 위한 컴퓨터에 의한 데이 터 처리 기술에 관련된다."}
{"patent_id": "10-2010-0127684", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기업들이 판매하는 제품이나 제공하는 서비스의 경쟁력을 높이기 위해서는 고객과 고객의 활동에 대한 체계적 인 이해와 이에 기초한 효율적이고 효과적인 마케팅 활동이 필요하다. 그러나 마케팅 활동에는 데이터 수집 과 처리에 많은 비용과 인력, 그리고 시일이 소요된다. 대부분 마케팅을 위한 데이터 수집은 수작업으로 이 루어진다. 기존의 마케팅 지원 솔루션은 설문작성, 간단한 통계분석 등의 단순한 모듈로 이루어져 있다. 마케팅 이론의 발달로 시장을 다수의 기준에 따라 동질적인 세분 시장들로 세분하고(segmentation) 그 세분 시장 중에서 집중해야할 세분 시장을 선택하여(targeting) 제품이 소비자에게 차별화될 수 있는 특성을 도출 (positioning)하고, 그에 따라 흔히 4P라고 불리는 제품(product), 판매장소(place), 가격(price), 판매촉진 의 형태(promotion)를 포함하는 마케팅 믹스(marketing mix)의 요소들에 대한 투입을 결정하는 과정에 많은 이론들이 제시되었다. 그렇지만, 이러한 일련의 마케팅 과정을 유기적으로 결합하여 경영자에게 의사결정을 할 수 있도록 지원해주는 시스템이 제안되지 못하였다."}
{"patent_id": "10-2010-0127684", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2010-0127684", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 일련의 마케팅 기획 과정을 컴퓨터에 의해 자동화하는 것을 목적으로 한다. 나아가 본 발명은 제품 기획 단계부터 사업화를 위한 시장 출시전략 및 시장관리에 이르는 전 마케팅 단계의 다양한 이슈를 효과적으로 해결할 수 있는 컴퓨터에 의한 마케팅 솔루션을 제공하는 것을 목적으로 한다. 나아가 본 발명은 자료 축적에 따라 마케팅 지원 과정을 자동학습을 통해 갱신함으로써 새로운 이슈에 대한 대응이나 기존 이슈에 대한 향상된 대응이 가능하도록 하는 것을 목적으로 한다. 추가로 기존에 수작업으로 진행하던 고객 데이터 수집 과정을 자동화하는 것을 목적으로 한다."}
{"patent_id": "10-2010-0127684", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 일 양상에 따르면, 지능형 마케팅 지원 시스템은 마케팅 관련 데이터를 수집하고 관리하는 데이터 통제부와, 마케팅 모델의 변수들에 관련된 데이터를 마케팅 데이터베이스에서 추출하여 마케 팅 모델에 적용함으로써 마케팅 이슈를 산출하는 마케팅 모델링부를 포함한다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 모델링 데이터베이스에 저장된 마케팅 모델 을 학습을 통해 갱신하는 마케팅 모델 자동학습부를 더 포함할 수 있다. 일 양상에 따르면, 자동학습부는 시스템의 처리 사례를 통해 마케팅 모델을 갱신할 수 있다. 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이 터로부터 제품 선호도를 산출하는 선호도 산출부와, 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이터 로부터 시장 점유율을 산출하는 점유율 산출부를 포함할 수 있다. 이는 모델링 데이터베이스에 선호도 모델 과 점유율 모델이 저장되어 있음을 의미한다. 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 마케팅 데이터베이스에 저장된 마케팅 데이터로부터 STP(segmentation/ targeting/ positioning) 절차에 따라 시장세분화/표적시장/포지셔닝 과정을 지원하는 STP 지원부를 포함할 수 있다. 또한, 마케팅 모델링부는 상품이나 서비스(product), 판매장소(place), 가격(price), 판매촉진(promotion)에 관련된 마케팅 변수들이 매출에 미치는 영향을 추정하는 마케팅 믹스(marketing mix) 시뮬레이션부를 포함할 수 있다. 더 나아가 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 모델링 데이터베이스에 정의된 컨셉 기반 마 케팅 모델의 변수들에 관련된 데이터를 마케팅 데이터베이스에서 추출하여 이 컨셉 기반 마케팅 모델을 통해 제품 컨셉 단계에서의 시장 수요를 추정하는 컨셉 기반 수요추정부를 포함할 수 있다. 추가적으로 마케팅 모 델링부는 모델링 데이터베이스에 정의된 품질 기반 마케팅 모델의 변수들에 관련된 품질 평가 데이터를 마케 팅 데이터베이스에서 추출하여 품질 기반 마케팅 모델을 통해 품질 기반 시장 수요를 추정하는 품질 기반 수 요추정부를 포함할 수 있다. 추가적으로, 마케팅 모델링부는 모델링 데이터베이스에 정의된 시험시장 테스 트 기반 마케팅 모델의 변수들에 관련된 시험시장 테스트 데이터를 마케팅 데이터베이스에서 추출하여 시험시 장 테스트 기반 마케팅 모델을 통해 시험시장 테스트 기반 시장 수요를 추정하는 시험시장 테스트 기반 수요 추정부를 포함할 수 있다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 마케팅 관련 데이터를 수집하여 마케팅 데이 터베이스에 저장하고 관리하는 데이터 통제부를 포함한다. 일 양상에 따르면, 데이터 통제부는 제품 및 고객 정보, 제품수명주기(product life cycle) 상의 자료를 웹에서 수집하는 웹정보수집로봇부와, 무선 알에프태그 기반 통신망으로부터 제품 수명 주기상의 데이터를 수집하는 태그정보수집부를 포함할 수 있다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 설문대상자를 샘플링하고 설문을 생성하며 네트워크를 통해 설문을 진행하여 결과를 마케팅 데이터베이스에 저장하는 설문 관리부를 더 포함할 수 있다."}
{"patent_id": "10-2010-0127684", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 다양한 마케팅 이슈에 관련되는 마케팅 모델들이 마케팅 데이터를 변수로 정의되고 데이터 베이스로 관리됨으로써 다양한 마케팅 이슈에 대해 체계적이고 통합적인 자동화된 데이터 처리가 가능해진다. 나아가 마케팅 모델이 축적된 자료 데이터를 자동 학습하여 갱신됨으로써, 시스템의 성능이 스스로 개선되고 새로운 마케팅 모델을 생성하여 기능을 확장하는 것이 가능해진다. 또한, 번거로운 설문조사를 컴퓨터에 의해 지원받음으로써 반자동화하여 비용과 시간을 절감할 수 있다."}
{"patent_id": "10-2010-0127684", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한, 그리고 추가적인 본 발명의 양상들은 첨부된 도면을 참조하여 기술되는 바람직한 실시예들을 통해 더 욱 명확해질 것이다. 이하에서는 이러한 본 발명의 양상들을 당업자가 용이하게 이해하고 재현할 수 있을 정 도로 상세히 설명한다. 도 1은 다수의 컴퓨터를 통해 구현된 본 발명의 일 실시예에 따른 지능형 마케팅 지원 시스템의 개략적인 구 성을 도시한다. 지능형 마케팅 지원 시스템은 일련의 소프트웨어 모듈들이 유기적으로 통합된 시스템이다. 이들 소프트웨어 모듈들은 하나 혹은 복수의 컴퓨터에서 실행될 수 있다. 일 실시예에 있어서 이 컴퓨터 혹 은 컴퓨터들은 네트워크를 통해 타 컴퓨터로 접속될 수 있다. 도 1에서 점선으로 도시된 부분은 본 발명에 따른 지능형 마케팅 지원 시스템이 복수의 서버에서 구현된 실시예를 도시하며, 점선 바깥은 이 시스템이 접 속된 외부 장치들을 예시적으로 도시한다. 도 1에 도시된 바와 같이, 데이터베이스 서버는 마케팅 데이터와, 마케팅 모델들을 관리한다. 모델링 서 버는 마케팅 이슈에 대응하는 마케팅 모델을 이용하여 마케팅 데이터를 처리하여 이슈에 대한 답을 산출 한다. 자동학습 서버는 자료들을 분석하여 자동학습함으로써 마케팅 모델들을 갱신하거나 생성한다. 사 용자들은 각각의 컴퓨터들(31,33,35)을 통해 웹서버로 접속함으로써 본 발명에 따른 지능형 마케팅 지원 시스템을 사용할 수 있다. 데이터 수집 서버는 네트워크를 통해 외부 컴퓨터들로 접속하여 마케팅 데이터를 수집한다. 일 예로, 데 이터 수집 서버는 태그정보 관리 서버로 접속할 수 있다. 태그정보 관리서버는 상품에 부착된 알에프 태그들과 통신하여 PLM(Product Lifecycle Management : 제품 수명주기 관리) 데이터를 수집한다. 이 를 통해 단순한 거래 정보뿐만 아니라 상품의 생산에서부터 출하, 선적, 배송, 판매, 반품에 이르는 전 과정 을 실시간으로 추적, 모니터링한다. 또한, 데이터 수집 서버는 인터넷망을 통해 수많은 웹페이지를 검색하여 마케팅 데이터를 수집한다. 이러한 마케팅 데이터 수집은 웹로봇이라고 불리는 소프트웨어에 의해 이루어진다. 그러나 도 1에 도시된 시 스템은 일 실시예에 불과하며, 본 발명에 따른 지능형 마케팅 지원 시스템은 간단한 몇 개의 모델에 기초하여 단일의 개인용 컴퓨터에서 실행되는 패키지 프로그램 형태로 구현될 수도 있다. 도 2는 본 발명의 일 실시예에 따른 지능형 마케팅 지원 시스템의 개략적인 구성을 도시한 블럭도이다. 도시 된 바와 같이 일 실시예에 따른 지능형 마케팅 지원 시스템은 마케팅 이슈와, 상기 마케팅 이슈와 관련된 마 케팅 모델과, 이 마케팅 모델의 변수들을 정의하고 관리하는 모델링 데이터베이스와, 마케팅 관련 데이 터를 저장하는 마케팅 데이터베이스와, 마케팅 관련 데이터를 수집하고 관리하는 데이터 통제부와, 마케팅 모델의 변수들에 관련된 데이터를 마케팅 데이터베이스에서 추출하여 마케팅 모델에 적용함으로써 마 케팅 이슈를 산출하는 마케팅 모델링부를 포함한다. 마케팅 이슈란 기업이 마케팅을 함에 있어서 문제가 되는 사항들을 말한다. 예를 들어 '제품 컨셉 단계에서 주 고객을 어느 계층으로 할 것인가?', '특정한 고객층을 상대로 어떠한 마케팅을 실행했을 때 매출은 어떻 게 될 것인가?', '시장 점유율은 어떻게 될 것인가?' 와 같은 이슈들이다. 이러한 마케팅 이슈들이 예를 들면 상호간의 관련성에 따라 트리 구조와 같은 구조체에 의해 구조화되어 데이터베이스로 관리되고, 이를 통해 체계적인 의사결정 지원이 가능하다. 본 발명의 일 양상에 따라서 이러한 마케팅 이슈들은 마케팅 모델에 의해 컴퓨터에 의해 산출된다. 예를 들어 마케팅 모델은 그러한 이슈에 영향을 미치는 변수들을 대수적으로 조합하여 생성될 수 있다. 그러나 마케팅 모델은 일련의 절차로 이루어진 모델일 수도 있다. 각 절차마다 마케팅 이슈에 관련된 다양한 변수들을 산출 하는 모델들이 정의된다. 모델링 데이터베이스에는 마케팅 이슈별 마케팅 모델들이 저장된다. 이러한 마케팅 모델은 데이터 구조체나 또는 테이블 형태로 정의될 수 있다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 마케팅 관련 데이터를 수집하여 마케팅 데이 터베이스에 저장하고 관리하는 데이터 통제부를 포함한다. 일 양상에 따르면, 데이터 통제부 는 웹정보수집로봇부와 태그정보수집부를 포함하는 데이터 수집관리부와, 단말기를 통해 입력 되는 마케팅 데이터를 관리하는 데이터 입력 모듈을 포함한다. 웹정보수집로봇부는 일 실시예에 있어서 제품 및 고객 정보와, 제품수명주기(product life cycle) 상의 마케팅 자료를 웹에서 수집한다. 예를 들어 웹정보수집로봇부는 신제품에 대한 사용 후기, 블로그나 까 페에 게시된 사용자의 평가의견을 자동 혹은 반자동으로 수집하여 마케팅 데이터베이스에 저장한다. 또 다른 예로 웹정보수집로봇부는 경쟁사의 웹사이트를 방문하여 경쟁사의 제품의 스펙, 할인 판매 등의 이 벤트, 배송 관련 정보와 같은 데이터를 자동화해서 수집한다. 또 다른 예로 웹정보수집로봇부는 온라인 상의 서베이를 통해 패널 데이터를 수집한다. 이는 소비자들 의 자발적 참여 네트워크를 근간으로 한다. 이를 위해 소비자들의 참여를 유도 위해 관련 제품평가정보에 대 한 기준(Norm)을 구축하여 소비자들에게 유용한 정보를 제공해 줌으로써 자발적으로 자신의 평가정보를 제공 해주고, 제공한 정보에 대한 개인적 피드백 등 다양한 형태로 정보를 생성하고 공유할 수 있는 장을 제공한다. 이러한 서베이 데이터는 지속적인 기획 데이터 형태로 수집하거나 단발성 설문조사를 통해 수집할 수 있다. 또한, 이러한 데이터는 웹을 통해서 및/또는 모바일 기기를 통해 수집할 수 있다. 일 실시예에 있어서, 제품 기획, 상용화, 유통, 구매, 소비에 이르는 제품 생산 소비 주기별로 품질평가속성 이 정의된다. 물리적/기능적 품질, 유통/서비스 품질, 소비자 지각 품질(구매초기 평가, 브랜드평가 등)에 따 른 측정지표들이 생산자, 유통망, 혹은 웹을 통해 수집되고, 이들 정보로부터 물리적 품질 지수, 유통 품질 지수, 지각 품질 지수가 도출되고 이들을 종합하여 종합 품질 지수가 정의된다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 설문대상자를 샘플링하고 설문을 생성하며 네트워크를 통해 설문을 진행하여 결과를 마케팅 데이터베이스로 저장하는 설문 관리부를 더 포함 할 수 있다. 일 실시예에 따르면, 설문 관리부는 설문 대상자를 샘플링하는 표본추출모듈과, 리스트작 성기, 그리고 기존 설문 DB를 활용하여 설문 문항을 작성하고, 레이아웃(layout)을 선택한 후 온라인에 설문 을 등록하는 서베이 자동생성 모듈을 포함한다. 추가로 설문 관리부는 조사 대상자의 기존 응답 히스토 리 정보를 통해 응답 이력을 추적하여 진행 서베이의 응답을 과거 응답과 비교하는 서베이 추적 모듈과 응답 자의 신청에 따라 설문조사별 인센티브를 제공하고 누적 인센티브를 관리하는 인센티브 관리 모듈을 포함한다. 본 발명의 또 다른 양상에 따르면, 데이터 수집관리부는 무선 알에프태그 기반 통신망으로부터 제품 수 명 주기 상의 데이터를 수집하는 태그정보수집부를 포함하는 포함할 수 있다. 일 실시예에 있어서, 태 그정보 수집부는 제품 수명주기 관리를 통해 얻어지는 PLM(product lifecycle management) 데이터를 수 집한다. PLM Data는 제품에 대한 상세 정보와 제품 사용기간 동안 생기는 이벤트 및 의사결정에 관한 정보를 포함하고 있다. 일 실시예에 있어서, 이러한 데이터 수집은 EPCIS(Electronic Product Code Information Service) 표준 기술에 기반하고 있다. EPCglobal 네트워크는 EPC 코드와 RFID 기술을 근간으로 물류 정보 교환을 위해서 물류 객체에 EPC(Electronic Product Code)를 할당하는 방법에 대한 표준을 제공한다. 이 기술을 통해 기업은 공급사슬 (Supply Chain) 상에서 상품을 추적하여 객체의 가시성, 추적성, 자동화, 보안성을 추구하여 재고 최소화, 상 품 손실 최소화, 주문의 신속한 처리, 소비자 기호 변화에 따른 대응능력 향상 등을 달성할 수 있다. 이러한 EPCIS 기술의 구조(Architecture)는 EPC가 기록된 알에프 태그, 태그의 정보를 읽어 들이는 장치인 리 더(reader), 리더로 읽은 태그 정보를 정제하고 취합, 중복된 정보를 제거하고 정보를 그룹화하는 ALE(Application Layer Event), 정제된 EPC 정보를 저장하고 제공하는 EPC IS(Information Service),EPCglobal Network 상에서 글로벌 검색서비스를 제공하는 ONS(Object Name Service), EPCglobal Network에서 물류 정보사용자가 EPC에 대한 정보를 찾고 이에 접근할 수 있도록 하는 역할을 하는 EPCIS DS(Discovery System)로 구성되어 있다. EPCIS는 미들웨어로부터 태그 이벤트 정보를 받아 이를 이용해 상품의 상태 및 추적 정보를 생성하여 미래의 사용을 위해 로컬 저장소에 저장하고 관리한다. 또한, EPC에 대한 정보취합의 허브역할을 담당하며, EPC 미들 웨어는 소프트웨어 구성요소로서 EPCglobal Network 구조에서 소프트웨어와 하드웨어를 연결하는 역할을 수행 하고 EPC 실시간 이벤트 정보를 관리하면서 EPCIS 및 기존 시스템과 연동하기 위한 정보를 관장한다. EPCIS데이터는 비즈니스 프로세스 실행 과정에서 발생하며, 무엇을(What), 언제(when), 어디서(Where), 왜 (Why) 라고 하는 4차원 구조를 가진다. 이러한 4차원 구조를 가진 EPCIS 기술을 이용해 제품 기획, 생산 유 통 및 소비에 이르는 제품 수명주기 전과정에 수반되는 정보와 고객 정보를 단일화된 정보체계로 관리하고 이 를 마케팅 정보 추출에 활용할 수 있다. 본 발명의 추가적인 양상에 따라, 일 실시예에 따른 데이터 통제부의 각각의 기능부들(811,813,830)은 데이터를 수집함에 있어서 비정형적인 정보들의 취합을 용이하게 하기 위하여 입력 데이터를 시멘틱 (semantic) 연계 처리하기 위해 데이터 시멘틱 표준을 참조한다. 이를 통해 비정형화된 정보들이 연계 되어 자동/반자동적인 입력이 가능하다. 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이터로부터 제품 선호도를 산출하는 선호도 산출부와, 마케팅 데이터베이스에 저장된 제품 스펙과 패널 데이터로부터 시장 점유율을 산출하는 점유율 산출부를 포함할 수 있다. 이는 모델링 데이 터베이스에 선호도 모델과 점유율 모델이 저장되어 있음을 의미한다. 제품의 기능이나 품질 등 각 제품 속성별로 수준값으로 정의되는 스펙과, 유통 방법, 광고비, 그리고 개별 소 비자들로부터 수집된 패널 데이터 등의 투입 변수에 대해 개별 소비자들의 상품 구매 선택 확률에 관련된 제 품의 선호도나 이로부터 산출될 수 있는 시장 점유율은 다양한 수학적인 모델로 추정될 수 있다. 본 발명에 따른 마케팅 모델링부는 동적 판매 확산 프로세스(Dynamic Sales Diffusion Process: 시장진입 초기부터 시간에 따른 신제품 매출 추세 예측) 계열모델과 정적 균형 시장 점유율(Static Equilibrium Market Share: 신제품이 시장에 정착했을 때의 시장 점유율 예측) 계열모델을 결합하여 점유율을 산출한다. 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 마케팅 데이터베이스에 저장된 마케팅 데이 터로부터 STP(segmentation/ targeting/ positioning) 절차에 따라 시장세분화/ 표적시장/포지셔닝 과정을 지 원하는 STP 지원부를 포함할 수 있다. 필립 코틀러에 의해 제시된 마케팅 경영관리 과정은 시장 조사 등의 조사 (research, R), 시장세분화 (Segmentation, S), 표적시장 설정 (Targeting, T), 포지셔닝 (Positioning, P), 마케팅 믹스(marketing mix, MM)의 결정, 마케팅 믹스의 실행 (Implementation, I), 피드 백을 얻고, 결과를 평가하며, STP 전략이나 마케팅믹스 전술을 수정 또는 개선을 포함하는 통제(Control, C) 의 과정이다. 코틀러(Philip Kotler)에 의하면 효과적인 마케팅은 조사로부터 출발한다. 시장을 조사하면 각기 다른 욕구를 가진 소비자들로 구성된, 서로 다른 세분시장들(S)이 드러난다. 기업은 자신들이 경쟁자보다 탁월하게 충족 시킬 수 있는 세분시장을 설정(T)하는 것이 현명하다. 기업은 각 표적시장별로 상품을 포지셔닝(P)하여, 자 사 상품이 경쟁상품과 어떻게 다른가 하는 것을 알려야 한다. STP는 기업의 전략적 마케팅 사고를 대표한다. 기업은 STP를 바탕으로 하여 제품, 가격, 유통, 촉진결정들의 믹스로 구성된 전술적 마케팅 믹스인 MM을 개발 한다. 그런 뒤 기업은 마케팅 믹스를 실행(I)한다. 마지막으로 통제 측정치(C)를 사용하여, 결과를 모니터 및 평가하고, STP전략과 MM 전술을 개선한다. STP 지원부는 설문 관리부나 데이터 통제부에서 수집되어 마케팅 데이터베이스에 수집된 데이터에 기초하여 시장 세분을 지원하며, 각각의 세분 시장 특성을 상호간에 비교하거나 전략에 매칭되는 시 장의 제시를 통해 시장을 설정하도록 지원한다. 이러한 설정된 표적시장에 대해 STP 지원부는 제품 스 펙과 표적시장의 특성을 입력으로 최선의 마케팅 믹스를 결정할 수 있도록 시뮬레이션을 제공한다. 또한, 이 러한 시뮬레이션 결과 소비자 선호도 및 시장 점유율을 추정한다. 마케팅 믹스 시뮬레이션에 대해서는 이하 에 상술한다. 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 마케팅 데이터베이스에 저장된 마케팅 데이 터로부터 상품이나 서비스(product), 판매장소(place), 가격(price), 판매촉진(promotion)에 관련된 마케팅 변수들이 매출에 미치는 영향을 추정하는 마케팅 믹스(marketing mix) 시뮬레이션부를 포함할 수 있다. 마케팅 믹스 시뮬레이션부는 STP 지원부에 의해 호출되는 모듈일 수 있다. 마케팅 믹스란 기업이 마케팅 목표에 따라 설정한 표적 시장에 마케팅 활동을 집중시키기 위해 사용하는 모든 투입변수 등을 해당기업의 환경과 상황에 맞게, 그리고 마케팅 효과가 최대화되도록 배합하는 마케팅 전술을 의미한다. 마케팅 믹스의 요소는 상품이나 서비스(product), 판매장소(place), 가격(price),판매촉진의 형 태(promotion) 등으로 흔히 4Ps라고 한다. 마케팅 믹스의 구성요소는 이외에도 제품계획, 판매경로, 광고, 수송보관, 포장, 디스플레이 등 다양하다. 마케팅의 효과를 높이기 위해서는 이러한 모든 요소들을 마케팅의 전략적 목표에 결합시키고, 그 목표에 입각하여 각 부문의 기능을 유기적으로 결합하여 동원하면서, 전체적인 마케팅 활동을 실시해야 한다. 마케팅 믹스는 우선 제품 믹스, 프로모션 믹스, 판매경로 믹스 등 하부 믹스 를 먼저 형성하고, 이들 하부 믹스들을 통합, 구성하여 가장 효율적인 마케팅 믹스를 실현하게 된다. 실제로 이러한 믹스는 기업의 종류, 상태에 따라 전략적으로 변경되며, 시장표적에 따라 달리 형성된다. 마케팅 믹스 시뮬레이션부는 시험시장 평가결과와 설문 조사 결과, 그리고 설정된 제품 스펙을 토대로 유통망을 시뮬레이션하는 마케팅 믹스 최적화 모델에 기초하여 수요의 최대점을 파악하도록 지원한다. 더 나아가 본 발명의 또 다른 양상에 따르면, 마케팅 모델링부는 모델링 데이터베이스에 정의된 컨 셉 기반 마케팅 모델의 변수들에 관련된 데이터를 마케팅 데이터베이스에서 추출하여 이 컨셉 기반 마케 팅 모델을 통해 제품 컨셉 단계에서의 시장 수요를 추정하는 컨셉 기반 수요추정부를 포함할 수 있다. 이를 통해 신상품의 출시 후 성패를 파악하는 기존의 의사결정과정을 지양하고, 컨셉 단계에서 사전에 시장성 을 판단함으로써 성공율을 향상시키고 기회비용을 최소화할 수 있다. 컨셉 기반 수요추정부는 광고비 투입에 따른 인지율을 예측함으로써 광고비 투입효과를 모델링하고, 컨 셉 신상품의 침투율을 예측하는 모델링을 통해 시장성을 조기 파악하고 컨셉대안, 컨셉수정, 시제품 단계 진 행 등의 의사결정이 가능토록 지원한다. 또 모델링에 관여된 주요 변수를 자동적으로 데이터베이스화하여 의 사결정 준거기준 (norm)을 구축할 수 있도록 시스템화한다. 이러한 과정은 먼저 설문 관리부를 통해 소비자로부터 신제품 컨셉트와 신제품 프로토타입에 대한 평가 (구매의향, 전반적 평가, 구체적 속성평가 등) 정보를 수집하는 것으로 시작된다. 이후에 구매의향 자료를 활용하여 소비자의 시험구매 확률과 재구매확률을 예측한다. 이후에 제품 컨셉트에 대한 호의가 프로토타입 에 이어지는지, 시험구매가 재구매로 이어지는지를 예측하기 위해서 확률 매트릭스를 구성한다. 다음으로, 소비자의 컨셉트 및 제품에 대한 전반적 평가 및 구체적 속성 평가가 구매확률과 어떤 관계가 있는지를 추정 하는 수리모형을 통해 구매 확률을 산출한다. 최종적으로 확률 매트릭스와 수리모형을 바탕으로 컨셉트 및 프 로토타입에 대한 시험구매 가능성과 재구매 가능성을 예측한다. 이와 관련하여 동적 판매 확산 프로세스 모델(Dynamic Sales diffusion Process Model)은 인지 모듈 (Awareness Module), 시험 모듈(Trial Module), 반복 구매 모듈(Repeat Module), 총 매출 모듈(Total Volume Module)별로 수리모형을 통해 시장진입 초기부터 시간에 따른 신제품 매출 추세 예측한다. 동시에 정적 균형 시장 점유율 모델(Static Equilibrium Market Share Model)은 시험 및 재구매 모듈(Trial and Repeat Modul e)과 시장 점유율 추정 모듈(Market Share Estimation Module), 선호도 모듈(Preference Module), 판매원 모 듈(Source of Sales Module)별로 수리모형을 통해 신제품이 시장에 정착했을 때의 시장 점유율을 예측한다. 이를 통해 컨셉 기반 수요추정부는 신제품의 예상 매출뿐 아니라 시장에 제자리를 잡을 때까지 걸리는 시간을 제시하고, 신제품 매출의 근원(Source of Sales)을 파악함으로써 경영 의사결정을 지원한다. 추가적으로 마케팅 모델링부는 모델링 데이터베이스에 정의된 품질 기반 마케팅 모델의 변수들에 관련된 품질 평가 데이터를 마케팅 데이터베이스에서 추출하여 품질 기반 마케팅 모델을 통해 품질 기반 시장 수요를 추정하는 품질 기반 수요추정부를 포함할 수 있다. 시제품의 품질이 고객가치기반에 의한 평가 없이 출시되어 실패할 확률을 최소화하고, 품질 개선 포인트를 파 악하기 위하여, 품질 기반 수요추정부는 품질 평가를 통해 소비자의 장기적 수요가능성 (반복구매력)을 모델링하고, 반복구매량 추정을 통해 완성제품 제작 여부 및 품질 기반 수요를 추정한다. 나아가 이 모델에 관여되는 주요 변수를 자동으로 데이터베이스화하여 준거기준을 축적한다. 추가적으로, 마케팅 모델링부는 모델링 데이터베이스에 정의된 시험시장 테스트 기반 마케팅 모델 의 변수들에 관련된 시험시장 테스트 데이터를 마케팅 데이터베이스에서 추출하여 시험시장 테스트 기반마케팅 모델을 통해 시험시장 테스트 기반 시장 수요를 추정하는 시험시장 테스트 기반 수요추정부를 포 함할 수 있다. 기존의 신상품 출시 후 시장반응에 따른 의사결정시스템은 많은 비용과 경영리스크를 수반하게 되는데, 이를 출시전에 가장 완성제품에 가까운 상태로 개발하여 시험시장테스트(simulated test market)를 함으로써 출시 리스크와 비용을 최소화할 수 있다. 시험시장 테스트 기반 수요추정부는 가장 출시상태에 근접한 컨셉과 제품품질을 동시에 고객가치기반으로 평가하여 출시 후 총수요를 추정하는 모델을 기초로 총 수요량 및 시장 점유율을 추정한다. 또한, 이 모델에 관여되는 주요 변수를 자동으로 데이터베이스화하여 준거기준을 축적한 다. 품질 기반 수요추정부와, 시험시장 테스트 기반 수요추정부는 전술한 컨셉 기반 수요추정부와 기초로 하는 데이터가 차이가 있지만 처리 과정은 유사하여 상세한 설명은 생략한다. 본 발명의 또 다른 양상에 따르면, 지능형 마케팅 지원 시스템은 모델링 데이터베이스에 저장된 마케팅 모델을 학습을 통해 갱신하는 마케팅 모델 자동학습부를 더 포함할 수 있다. 일 실시예에 있어서, 마케 팅 모델 자동학습부는 마케팅 모델링부에서 사용되는 다양한 모델들에 대응되어 제시된다. 도 2는 이러한 다양한 모델링에 대한 자동학습부들(510, 531, 533, 571, 573, 591, 593, 595)을 도시하고 있다. 모델링 데이터베이스에는 각각의 마케팅 이슈에 관련되는 모델들과 그 모델에 관여되는 주요 변수가 자 동으로 데이터베이스화되어 축적된다. 주요 변수들이 자동으로 데이터베이스화되므로 해당 마케팅 이슈에 영 향을 미치는 변수들을 새롭게 추가하거나 영향력을 평가하는 것이 가능하다. 마케팅 의사결정 결과의 시간적 흐름에 따른 패턴인식을 위해서 인공 지능 기술이 적용될 수 있다. 마케팅 모델 자동학습부는 마케팅 모델과 그에 관여된 변수나 파라미터의 유의미성을 예를 들면 회귀분석의 R-square 등을 통해 검증한다. 마 케팅 데이터에 의해 정의되는 어떤 상황에서 마케팅 이슈의 의사결정 과정을 분석하여 관성이나 직관이 아닌 정확한 계량모델에 의해서 유의미한 의사결정 정보를 도출해 내고 주기적으로 피드백한다. 이를 통해 자료의 축적에 따른 지식의 축적 효과를 극대화하고 축적된 지식을 확대 재생산할 수 있다. 일 양상에 따르면, 자동학습부는 시스템의 처리 사례를 통해 마케팅 모델을 갱신하는 사례자동학습부 를 포함할 수 있다. 일 실시예에 따른 사례자동학습부는 본 발명에 따른 지능형 마케팅 지원 시스 템의 활용 과정에서 축적된 분석 사례를 통해서 마케팅의사결정에 활용된 모델과 그 모델에 관여되는 변수나 파라미터들을 변화하는 환경에 맞게 자동으로 업데이트하여 체계적이고 과학적인 마케팅 이슈에 따른 의사결 정시스템을 구축할 수 있도록 한다."}
{"patent_id": "10-2010-0127684", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다수의 컴퓨터를 통해 구현된 본 발명의 일 실시예에 따른 지능형 마케팅 지원 시스템의 개략적인 구 성을 도시한다. 도 2는 본 발명의 일 실시예에 따른 지능형 마케팅 지원 시스템의 개략적인 구성을 도시한 블럭도이다."}
