{"patent_id": "10-2024-0076495", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0054686", "출원번호": "10-2024-0076495", "발명의 명칭": "이미지 기반 질환 진단 장치 및 방법", "출원인": "한국전자통신연구원", "발명자": "이문섭"}}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "질환 진단 장치에 있어서,검사대상자에 관련된 텍스트 데이터, 음성 데이터 및 이미지 데이터 중 적어도 2종을 포함하는 멀티 모달 데이터를 획득하는 획득 모듈; 상기 멀티 모달 데이터 중 이미지 데이터 이외의 데이터를 시각화하고 상기 멀티 모달 데이터 중 이미지 데이터및 상기 시각화된 데이터를 포함하는 이미지 데이터셋을 출력하는 전처리 모듈; 및 상기 이미지 데이터셋에 기반하여 상기 검사대상자의 지정된 질환 여부를 분류하는 분류 모듈을 포함하는 질환진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 획득 모듈은,상기 검사대상자의 진단 동안 기록된 상기 동영상 데이터로부터 상기 이미지 데이터 및 상기 음성 데이터를 각기 추출하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 동영상 데이터는,상기 검사대상자들의 얼굴 표정 또는 신체 움직임 중 적어도 하나를 포함하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서, 상기 텍스트 데이터는,상기 동영상 데이터로부터 추출된 음성 데이터를 텍스트로 변환한 데이터 및 상기 검사대상자의 소설 네트워크로부터 추출된 텍스트 중 적어도 하나의 데이터를 포함하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 전처리 모듈은,상기 이미지 데이터가 2차원 이상의 컬러 이미지 데이터이면, 상기 이미지 데이터를 1차원 흑백 이미지 데이터로 변환하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 상기 전처리 모듈은,상기 텍스트 데이터로부터 감정 키워드를 추출하고 상기 추출된 감정 키워드를 워드 클라우드(word cloud)로 시각화하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 상기 전처리 모듈은,상기 추출된 감정 키워드를 그 출연빈도 및 감정 평가 사전에 따른 감정 점수에 따른 색상과 크기로 상기 워드클라우드에 표시하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 상기 전처리 모듈은,공개특허 10-2025-0054686-3-상기 음성 데이터에 멜 스펙토그램(Mel spectrogram) 기법을 적용하여 시각화하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서, 상기 전처리 모듈은,적어도 상기 분류 모듈의 학습 단계에서 상기 데이터셋이 지정된 개수 미만이면, 데이터 증강 또는 k-fold 트레이닝(training) 기법을 사용하여 상기 데이터셋을 증강하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서, 상기 분류 모듈은,컨볼루션에 기반한 3차원 단일 네트워크 모델을 포함하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서, 상기 각 우울 환자들의 심박수, 헬스데이터, 라이프로그(life log) 중 적어도 하나의 다른 데이터를 더 획득하고, 상기 다른 데이터에 더 기반하여 상기 검사대상자의 우울증 여부를 분류하는 것인 질환 진단 장치."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "에 있어서, 상기 전처리하는 동작은,상기 음성 데이터에 멜 스펙토그램(Mel spectrogram) 기법을 적용하여 시각화하는 동작을 포함하는 것인 질환진단 방법."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "적어도 하나의 프로세서에 의한 질환 진단 방법으로서,검사대상자에 관련된 텍스트 데이터, 음성 데이터 및 이미지 데이터 중 적어도 2종을 포함하는 멀티 모달 데이터를 획득하는 동작;상기 멀티 모달 데이터 중 이미지 데이터 이외의 데이터를 시각화하는 동작;상기 멀티 모달 데이터 중 이미지 데이터 및 상기 시각화된 데이터를 포함하는 이미지 데이터셋을 출력하는 동작; 및상기 이미지 데이터셋에 기반하여 상기 검사대상자의 지정된 질환 여부를 분류하는 동작을 포함하는 질환 진단방법."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서, 상기 획득하는 동작은,상기 검사대상자의 진단 동안 기록된 상기 동영상 데이터로부터, 얼굴 표정 또는 신체 움직임 중 적어도 하나를포함하는, 상기 이미지 데이터, 및 상기 음성 데이터를 각기 추출하는 동작을 포함하는 것인 질환 진단 방법."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서, 상기 획득하는 동작은,상기 동영상 데이터로부터 추출된 음성 데이터를 텍스트 변환하여 상기 텍스트 데이터를 생성하는 동작; 및상기 검사대상자의 소설 네트워크로부터 상기 텍스트 데이터를 추출하는 동작을 포함하는 것인 질환 진단 방법."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 12에 있어서, 상기 전처리하는 동작은,상기 텍스트 데이터로부터 감정 키워드를 추출하는 동작; 및상기 추출된 감정 키워드를 워드 클라우드(word cloud)로 시각화하는 것인 질환 진단 방법.공개특허 10-2025-0054686-4-청구항 17"}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 12에 있어서, 상기 전처리하는 동작은,상기 데이터셋이 지정된 개수 미만이면, 데이터 증강 또는 k-fold 트레이닝(training) 기법을 사용하여 상기 데이터셋을 증강하는 동작을 포함하는 것인 질환 진단 방법."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 12에 있어서, 상기 분류하는 동작은,컨볼루션 구조의 3차원 단일 네트워크 모델을 통해 상기 검사대상자의 상기 지정된 질환 여부를 분류하는 동작을 포함하는 것인 질환 진단 방법."}
{"patent_id": "10-2024-0076495", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "질환 진단 장치에 있어서,적어도 하나의 인스트럭션을 포함하는 메모리; 및상기 메모리와 기능적으로 연결된 프로세서를 포함하고, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 프로세서로 하여금,검사대상자에 관련된 텍스트 데이터, 음성 데이터 및 이미지 데이터 중 적어도 2종을 포함하는 멀티 모달 데이터를 획득하고, 상기 멀티 모달 데이터 중 이미지 데이터 이외의 데이터를 시각화하고 상기 멀티 모달 데이터 중 이미지 데이터및 상기 시각화된 데이터를 포함하는 이미지 데이터셋을 출력하고, 상기 이미지 데이터셋에 기반하여 상기 검사대상자의 지정된 질환 여부를 분류하도록 하는 것인 질환 진단장치."}
{"patent_id": "10-2024-0076495", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시되는 일 실시 예에 따른 질환 진단 장치는, 각 우울 환자들에 관련된 텍스트 데이터, 음성 데이터 및 이미지 데이터 중 적어도 2종을 포함하는 멀티 모달 데이터를 획득하는 획득 모듈; 상기 멀티 모달 데이터 중 이미지 데이터 이외의 데이터를 시각화하고 상기 멀티 모달 데이터 중 이미지 데이터 및 상기 시각화된 데이터를 포함하는 이미지 데이터셋을 출력하는 전처리 모듈; 및 상기 이미지 데이터셋에 기반하여 상기 각 우울 환자의 우울증 여부를 분류하는 분류 모듈을 포함할 수 있다."}
{"patent_id": "10-2024-0076495", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 다양한 실시 예들은, 이미지 기반 질환 진단 인공지능 모델과 관련된다."}
{"patent_id": "10-2024-0076495", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "마음의 감기라 불리는 우울증은 전세계적으로 약 2억 8천만 명이 겪고 있는 정신건강 질환이다. 우울증은 약 3.8%의 유병률(attack rate)을 나타내는 사회적, 경제적 부담이 높은 정신건강 질환으로서, 개인 삶의 질에 상 당한 영향을 미치고 있다. 전염병 COVID-19 발생 이후 우울증의 유병률은 약 25%까지 증가하였고 국내 연평균 100만명 이상이 우울증 진단을 받고 있다. 우울증 진단은 다음과 같은 다양한 방법으로 수행되는데, 방법마다 장단점이 있다. 첫째로, 전문가 문진 또는 전문가 문진과 fMRI, CT 등의 의료 기기를 병행 사용하는 Clinic 판별 방법이 있다. 둘째로, PHQ-9, BDI, CESD-R 같은 문진을 통한 우울증 선별도구 활용 방법은 의료진의 시간이 많이 소요될 뿐 아니라, 우울증 진단의 정확도 및 신뢰성이 부족한 단점이 있다. 셋째로, fMRI나 CT 등을 사용하여 뇌의 기능적 및 생리학적 특성을 파 악하는 방법이 있는데, 진단 비용이 높고 조기 진단이 어려울 수 있다."}
{"patent_id": "10-2024-0076495", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "최근, ICT(Information and Communication Technology) 기술을 활용하여 데이터를 수집하고 수집된 데이터를 딥러닝 같은 인공지능 모델을 통해 학습함에 따라 정신 질환(예: 우울증)을 진단하기 위한 연구가 진행되고 있 다. 도 1은 우울증 진단에 관련된 인공지능 모델의 예시도이다. 도 1을 참조하면, 수집된 데이터는 i) Text, 영상, 음성 같은 환자의 행동 데이터(behavioral data), ii) 환자 의 SNS, 인스타그램(Instagram) 등의 소셜 데이터(social data), iii) 눈동자의 움직임, 심박수, 행동 양식 등 의 불안 증세에 대한 생리학적 데이터(physiological data) 등의 크게 3종류가 있다. 우울증 진단 장치는 단일 데이터 또는 멀티 모달 데이터로 구성되는 상기 수집된 데이터를 인공지능 모델을 통 해 우울증 진단에 이용될 수 있다. 상기 수집된 데이터는 서로 다른 디멘젼(dimension)을 가지고, 데이터의 타 입과 특성이 다르다. 따라서, 우울증 진단 장치는 종류별 데이터를 처리하기 위한 각각의 인공지능 모델을 생성 한 후 각 인공지능 모델의 진단 결과를 앙상블 기법으로 모아서 우울증을 진단/평가할 수 있다. 하지만, 이러한 형태의 우울증 진단 장치는 인공지능 네트워크 및 용량이 크므로, 시간이나 에너지를 많이 소모할 수 있다. 또 한 데이터 간 학습 결과의 불일치로 인해 처리 정확도가 떨어질 수 있다. 본 문서에 개시되는 다양한 실시 예들은 입력 데이터를 시각화한 이미지 데이터에 기반하여 우울증 여부를 판별 할 수 있는 질환 진단 장치 및 방법을 제공할 수 있다."}
{"patent_id": "10-2024-0076495", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 일 실시 예에 따른 질환 진단 장치는, 각 우울 환자들에 관련된 텍스트 데이터, 음성 데이 터 및 이미지 데이터 중 적어도 2종을 포함하는 멀티 모달 데이터를 획득하는 획득 모듈; 상기 멀티 모달 데이 터 중 이미지 데이터 이외의 데이터를 시각화하고 상기 멀티 모달 데이터 중 이미지 데이터 및 상기 시각화된 데이터를 포함하는 이미지 데이터셋을 출력하는 전처리 모듈; 및 상기 이미지 데이터셋에 기반하여 상기 각 우 울 환자의 우울증 여부를 분류하는 분류 모듈을 포함할 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 적어도 하나의 프로세서에 의한 질환 진단 방법은, 우울 환자에 관련된 텍스트 데이터, 음성 데이터 및 이미지 데이터 중 적어도 2종을 포함하는 멀티 모달 데이터를 획득하는 동작; 상기 멀티 모달 데이터 중 이미지 데이터 이외의 데이터를 시각화하는 동작; 상기 멀티 모달 데이터 중 이미지 데이터 및 상기 시각화된 데이터를 포함하는 이미지 데이터셋을 출력하는 동작; 및 상기 이미지 데이터 셋에 기반하여 상기 우울 환자의 우울증 여부를 분류하는 동작을 포함할 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 질환 진단 장치는, 적어도 하나의 인스트럭션을 포함하는 메모리; 및 상기 메모리와 기능적으로 연결된 프로세서를 포함하고, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 프로세서로 하여금, 우울 환자에 관련된 텍스트 데이터, 음성 데이터 및 이미지 데이터 중 적어도 2종을 포함하 는 멀티 모달 데이터를 획득하고, 상기 멀티 모달 데이터 중 이미지 데이터 이외의 데이터를 시각화하고 상기 멀티 모달 데이터 중 이미지 데이터 및 상기 시각화된 데이터를 포함하는 이미지 데이터셋을 출력하고, 상기 이 미지 데이터셋에 기반하여 상기 우울 환자의 우울증 여부를 분류하도록 할 수 있다."}
{"patent_id": "10-2024-0076495", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예들에 따르면, 입력 데이터를 시각화한 이미지 데이터에 기반하여 우울증 여 부를 판별할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2024-0076495", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 2는 일 실시예에 따른 질환 진단 장치의 개념도를 나타내고, 도 3은 일 실시예에 따른 질환 진단 장치의 구 성도를 나타낸다. 도 2를 참조하면, 일 실시예에 따른 질환 진단 장치는 검사대상자에 관련된 음성 데이터, 이미지 데이터, 텍스트 데이터 중 적어도 2종을 포함하는 멀티 모달 데이터를 획득할 수 있다. 상기 검사대상자는 지정된 질환 환자(예: 우울증 환자) 및 정상인을 포함할 수 있다. 상기 멀티 모달 데이터는 검사대상자에 대한 지정된 질환 진단 과정에서 확보된 동영상으로부터 생성될 수 있다. 상기 지정된 질환은 우울증, 조울증, 불안증, 우울장애, 또는 불안장애 중 적어도 하나의 질환을 포함할 수 있다. 일 실시예에 따르면, 질환 진단 장치는 멀티 모달(multi-modal) 데이터에 포함된 각 데이터들 중 이미지 데이터가 아닌 것들을 시각화할 수 있다. 예를 들어, 질환 진단 장치는 음성 데이터를 멜 스펙토그램(mel spectrogram) 기법으로 시각화하고, 텍스트를 감정 키워드 기반의 워드 클라우드(word cloud)로 시각화할 수 있 다. 일 실시예에 따르면, 질환 진단 장치는 시각화된 이미지 데이터를 포함하는 이미지 데이터를 2차원 이상의 네트워크 모델로 학습함에 따라 검사대상자의 지정된 질환 여부를 판별(또는, 분류)할 수 있다. 도 3을 참조하면, 일 실시예에 따른 질환 진단 장치는 입력 모듈, 출력 모듈, 메모리 및 프로세서를 포함할 수 있다. 일 실시 예에서, 질환 진단 장치는 일부 구성요소가 생략되거나, 추가적 인 구성요소를 더 포함할 수 있다. 또한, 질환 진단 장치의 구성요소들 중 일부가 결합되어 하나의 개체로 구성되되, 결합 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 입력 모듈은 질환 진단 장치을 사용하는 사용자 입력을 수신할 수 있다. 입력 모듈은 예를 들어, 터치스크린, 마이크, 카메라, 키보드, 마우스 중 적어도 하나의 입력 감지 회로를 포함할 수 있다. 입력 모듈은 통신 모듈을 포함하거나 통신 모듈일 수 있다. 예를 들어, 입력 모듈은 사용자 음성을 인식 또는 감지하는 마이크일 수 있다. 다른 예를 들어, 입력 모듈은 사용자 얼굴 또는 신체를 촬영하는 카메라 일 수 있다. 또 다른 예로, 입력 모듈은 사용자의 텍스트를 입력 받는 키보드나 터치 스크린일 수 있다. 또는, 입력 모듈은 소셜 네트워크로부터 사용자가 작성한 텍스트를 획득(예: 복사 및 저장)하는 통신 모듈 일 수 있다. 출력 모듈은 프로세서의 제어에 따라 기호, 숫자 또는 문자 중 적어도 하나의 데이터를 시각 또는 청 각적으로 출력할 수 있다. 출력 모듈은 예를 들면, 액정 디스플레이, OLED, 터치스크린 디스플레이, 스피 커 중 적어도 하나의 출력 장치를 포함할 수 있다. 예를 들어, 출력 모듈은 검사대상자의 지정된 질환 여 부를 나타내는 텍스트 또는 음성을 출력할 수 있다. 메모리는 다양한 형태의 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 예를 들어, 메모리 는 ROM(read only memory) 및 RAM(random access memory)를 포함할 수 있다. 일 실시예에서, 메모리는 프 로세서의 내부 또는 외부에 위치할 수 있고, 메모리는 이미 알려진 다양한 수단을 통해 프로세서 와 연결될 수 있다. 메모리는 질환 진단 장치의 적어도 하나의 구성요소(예: 프로세서)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는 예를 들어, 소프트웨어 및 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 예를 들어, 메모리는 질환 진단 서비스 제공을 위한 적 어도 하나의 인스트럭션 및 데이터를 저장할 수 있다. 상기 적어도 하나의 인스트럭션은 실행 시에 프로세서 로 하여금, 검사대상자에 관련된 텍스트 데이터, 음성 데이터 및 이미지 데이터 중 적어도 2종을 포함하는 멀티 모달 데이터를 획득하고, 상기 멀티 모달 데이터 중 이미지 데이터 이외의 데이터를 시각화하고 상기 멀티 모달 데이터 중 이미지 데이터 및 상기 시각화된 데이터를 포함하는 이미지 데이터셋을 출력하고, 상기 이미지데이터셋에 기반하여 상기 검사대상자의 지정된 질환 여부(예: 우울증 환자 또는 정상인)를 분류하도록 할 수 있다. 일 실시예에 따르면, 메모리는 텍스트 데이터의 워드 클라우드 변환에 관련된 데이터 예컨대, 감정 평가 사전을 포함할 수 있다. 상기 감정 평가 사전은 예를 들면, 각 단어들의 감정적 의미와 관련된 점수를 포함할 수 있다. 상기 감정 평가 사전은 예를 들면, Affective Norms for English Words(ANEW) 데이터베이스를 포함할 수 있다. 상 일 실시예에 따르면, 메모리는 동영상의 이미지 및 음성 분할, 음성의 텍스트 변환, 음성 데이터 및 텍스 트 데이터의 시각화, 또는 이미지 데이터셋에 기반한 지정된 질환 여부 판별에 관련된 인스트럭션 및 데이터를 저장할 수 있다. 메모리는 이미지 데이터의 경량화 또는 이미지 데이터의 증강에 관련된 인스트럭션 및 데이터를 더 저장할 수 있다. 프로세서는 질환 진단 장치의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요 소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 프로세서는 예를 들어, 중앙처리 장치(CPU), 그래픽처리장치(GPU), 마이크로프로세서, 애플리케이션 프로세서(application processor), 주문형 반도체(ASIC(application specific integrated circuit), FPGA(field programmable gate arrays)) 중 적어도 하나를 포함할 수 있으며, 복수의 코어를 가질 수 있다. 일 실시예에 따르면, 프로세서는 획득 모듈, 전처리 모듈 및 분류 모듈을 포함할 수 있다. 획득 모듈, 전처리 모듈 및 분류 모듈은 프로세서에 포함되거나, 프로세서에 의해 실 행되는 소프트웨어 모듈 또는 하드웨어 모듈일 수 있다. 일 실시예에 따르면, 획득 모듈은 검사대상자(사용자)들에 관련된 이미지 데이터, 음성 데이터 및 텍스트 데이터 중 적어도 2종을 포함하는 멀티 모달(multi-modal) 데이터를 획득할 수 있다. 획득 모듈은 각 사용 자의 진단 과정에서 기록(녹음 및 녹화)된 동영상에 기반하여 이미지 데이터, 음성 데이터 및 텍스트 데이터를 생성할 수 있다. 상기 이미지 데이터는 진단 과정에 녹화된 사용자의 얼굴 표정 및 신체 움직임을 포함하는 동 영상 이미지일 수 있다. 상기 음성 데이터는 진단 과정에 녹음된 사용자의 음성을 디지털 변환한 것일 수 있다. 상기 텍스트 데이터는 진단 과정에 기록된 글이나 음성을 텍스트로 변환한 데이터일 수 있다. 추가적으로, 상기 텍스트 데이터는 사용자의 소셜 네트워크에 이전에 기록된 데이터를 더 포함할 수 잇다. 이와 관련하여, 프로세서는 진단 과정에 참여한 사용자의 동영상 데이터를 입력 모듈을 통해 수신(또 는, 획득)할 수 있다. 추가적으로, 프로세서는 입력 모듈을 통해 사용자의 소셜 네트워크로부터 기 작성된 과거 텍스트 데이터를 더 획득할 수 있다. 프로세서는 획득 모듈을 통해 획득된 동영상 데이 터 및 과거 텍스트 데이터로부터 멀티 모달 데이터를 획득할 수 있다. 일 실시예에 따르면, 전처리 모듈은 멀티 모달 데이터 중 이미지 데이터 이외의 데이터 예컨대, 텍스트 데 이터 및 음성 데이터를 시각화할 수 있다. 한 실시예에 따르면, 전처리 모듈은 텍스트 데이터로부터 지정된 감정 키워드(단어)를 추출할 수 있다. 전 처리 모듈은 텍스트 데이터로부터 추출된 감정 키워드를 토큰화하여 이미지로 변환할 수 있다. 예를 들어, 전처리 모듈은 추출된 감정 키워드 이외의 어미와 어절을 제외한 대명사, 명사 및 서술어를 추 출할 수 있다. 전처리 모듈은 추출된 감정 키워드(명사, 대명사, 서술어)를 출연 빈도 및 감정 평가 사전 에 따른 점수를 확인할 수 있다. 전처리 모듈은 상기 추출된 감정 키워드를 출연 빈도 및 확인된 점수에 대응하도록 나타낸 워드 클라우드(word cloud)로 생성할 수 있다. 전처리 모듈은 예를 들면, 출연 빈도 및 확인된 점수가 높을수록 더 큰 크기와 더 어두운 색상으로 표현할 수 있다. 한 실시예에 따르면, 전처리 모듈은 시간 영역의 음성 데이터를 프레임별(또는, 지정된 시간 단위)로 나누 어 고속 푸리에 변환함에 따라 주파수 영역(frequency domain)의 음성 데이터로 변환할 수 있다. 전처리 모듈 은 주파수 영역의 각 주파수 정보(스펙트럼)에 멜 스펙트로그램 기법을 적용하여 멜 스펙트로그램을 산출 할 수 있다. 상기 멜 스펙트로그램 기법은 주파수 정보를 인간의 청각 구조를 반영하여 수학적으로 변환하는 (Mel scale) 기법 중 하나로서, 시간에 따른 주파수 변화를 시각적으로 표현할 수 있다. 멜 스펙트로그램의 가 로축은 시간적 특성을 나타내고, 세로 축은 주파수를 나타낸다. 예를 들어, 전처리 모듈은 멜 스펙트로그 램을 로그 스케일 처리한 로그 멜 스펙트로그램을 생성할 수 있다. 예를 들어, 우울증 환자는 톤, 세기, 변화량, 휴지기에 있어서 정상인과 차이가 있는데, 일 실시예에서는 멜 스펙트로그램 상에 나타낸 해당 차이에기반하여 우울 환자의 우울증 여부를 구분할 수 있다. 일 실시예에 따르면, 전처리 모듈은 멀티 모달 데이터 내 이미지 데이터를 전처리(예: 경량화)할 수 있다. 예를 들어, 전처리 모듈은 이미지 데이터가 2차원 이상의 컬러 이미지 데이터이면, 이미지 데이터를 1차원 흑백 이미지 데이터로 변환할 수 있다. 다른 예를 들어, 전처리 모듈은 동영상 이미지에 포함된 시계열적 정지 이미지들을 각기 1차원 흑백 이미지로 변환할 수 있다. 일 실시예에 따르면, 전처리 모듈은 전처리된 이미지 데이터, 시각화된 음성 데이터, 및 시각화된 텍스트 데이터를 포함하는 상호 관련된 이미지 데이터셋을 출력할 수 있다. 일 실시예에서, 전처리 모듈은 학습 과정에서 이미지 데이터셋이 지정된 개수 미만이면, 데이터 증강 또는 k-fold 트레이닝(training) 기법을 사용하여 이미지 데이터셋을 증강할 수 있다. 상기 지정된 개수는 분류 성능 을 보장 가능한 개수로서 실험적으로 결정될 수 있다. 일 실시예에 따르면, 분류 모듈은 검사대상자의 지정된 질환 여부를 분류 가능하도록 진단용 이미지 데이 터를 학습할 수 있다. 예를 들어, 분류 모듈은 컨볼루션에 기반한 3차원 단일 네트워크 모델을 포함할 수 있다. 상기 네트워크 모델은 예를 들면, CNN(Convolution Neural Network), Transformer, Attention, Graph neural network, Boltzmann network 중 하나일 수 있다. 학습 과정에서, 분류 모듈은 전처리된 이미지 데이터, 시각화된 음성 데이터 및 시각화된 텍스트 데이터를 포함하는 이미지 데이터셋을 입력 받을 수 있다. 예를 들어, 분류 모듈은 그 입력으로 경량화된 이미지 데 이터(1차원 흑백 이미지), 멜 스펙트로그램 및 워드 클라우드를 획득할 수 있다. 분류 모듈은 학습용 이미지 데이터셋의 특징값들을 학습함에 따라 검사대상자의 지정된 질환 환자 여부를 분류하도록 구성될 수 있다. 상기 전처리된 이미지 데이터의 특징값은 예를 들면, 얼굴 표정 및 신체 포즈에 관 련된 특징값, 그 변화 속도를 포함할 수 있다. 상기 시각화된 음성 데이터의 특징값은 예를 들면, 톤, 세기, 변 화량, 휴지기에 관련된 특징값들을 포함할 수 있다. 상기 시각화된 텍스트 데이터의 특징값은 단어 별 크기나 색상을 포함할 수 있다. 일 실시예에 따르면, 프로세서는 분류 모듈을 통한 지정된 질환 여부의 분류(진단) 결과를 출력 모듈 을 통해 출력할 수 있다. 예를 들어, 프로세서는 각 이미지 데이터셋과 관련하여 우울증 환자와 정상 인을 구분하여 나타낸 진단 결과를 출력할 수 있다. 상술한 실시예에서, 프로세서는 각 사용자들의 전체 멀티 모달 데이터를 일정 시간 단위로 구분하여 학습 및 분류한다. 따라서, 프로세서는 각 사용자의 전체 멀티 모달 데이터에 대한 진단 결과를 종합하여 각 검 사대상자의 지정된 질환 여부를 분류(진단)할 수 있다. 다양한 실시예에 따르면, 프로세서는 스마트 디바이스에 의해 진단 과정에 참여한 사용자 동영상을 기록하 고, 입력 모듈(예: 통신 모듈)을 통해 스마트 디바이스로부터 사용자 동영상을 수신할 수 있다. 상기 스마 트 디바이스는 스마트 미러, 스마트폰, 스마트 앱을 포함할 수 있다. 프로세서는 사용자와 상호 작용 가능 한 스마트 디바이스를 이용하므로 실시간 진단, 사용자와 감정 교감 및 의료진에게 진단 결과 제공을 수행할 수 있다. 다양한 실시예에 따르면, 프로세서는 메타데이터, 심박수, 헬스데이터, 라이프로그 중 적어도 하나의 다른 데이터를 추가적으로 활용하여 지정된 질환 환자 여부를 진단할 수 있다. 이 경우, 프로세서는 메타데이터, 심박수, 헬스데이터 및 라이프로그 중 적어도 하나의 다른 데이터에 기반하여 지정된 질환(예: 우 울증) 여부를 진단 가능한 다른 분류 모듈을 더 포함하고, 다른 분류 모듈에 기반하여 지정된 질환 여부를 진단 할 수 있다. 프로세서는 상기 분류 모듈 및 다른 분류 모듈에 기반한 분류 결과를 종합하여 출력 모 듈을 통해 제공할 수 있다. 예를 들어, 프로세서는 각 분류 모듈의 분류 결과를 모두 제공할 수 있다. 이와 같이, 일 실시예에 따른 질환 진단 장치는 디바이스를 통해서 확보된 데이터를 이미지화 하여 학습데이터셋 또는 진단 데이터셋을 구성하여 단일 진단 네트워크 모델에 입력하여 지정된 정신 질환을 진단하 는 방법에 관한 것으로 본 발명을 사용하는 경우, 네트워크 모델의 크기가 현저히 줄어들 뿐만 아니라 정확도 및 진단 속도를 개선할 수 있다. 이하의 문서는 지정된 질환이 우울증인 경우를 예로 들어 설명한다. 하지만, 이에 한정되지 않는다. 예를 들어, 지정된 질환은 우울증 이외의 질환, 조울증, 불안증, 우울장애, 또는 불안장 애 중 적어도 하나의 질환 또는 다른 정신 질환(공항장애)을 포함할 수 있다. 도 4는 일 실시예에 따른 워드 클라우드의 예시도는 나타낸다. 도 4에서는 하기 표 1의 우울증 환자의 음성에 기반하여 생성된 텍스트 데이터를 워드 클라우드한 예이다. 표 1 요즘 나는 내 자신을 알아볼 수 없어. 아침에 눈을 뜨면, 바로 그 무거운 느낌이 내 가슴을 짓눌러. 어제와 똑같은 날이 될 것만 같아. 어제의 기억조차 제대로 나지 않는데, 오늘을 기대하라는 말은 너 무 힘들다. 무엇을 위해 일어나야 하는지, 왜 웃어야 하는지, 왜 눈물을 흘려야 하는지. 모든 감정이 흐릿해. 마 치 먼 곳에서 들려오는 무드등의 빛처럼. 사람들은 나에게 괜찮아지려면 시간이 필요하다고 말한다. 하 지만 시간은 정말 나을까? 나는 시간이 지나도 여전히 그 자리에 서 있을 것만 같아. 친구들과의 만남, 가족들과의 대화, 모두가 그렇게 중요하고 소중하게 느껴져야 하는데, 내게는 그저 지나가는 풍경처럼 느껴져. 나를 이해해 주는 사람이 있을까? 혹은 내가 스스로를 이해할 수 있을까? 내가 느끼는 이 공허함과 외로움은 언제쯤 사라질까? 혹은 이것이 진짜 나인 걸까? 나는 도대체 누구 일까? 도 4를 참조하면, 일 실시예에 따른 질환 진단 장치는 상기 텍스트 데이터에 포함된 모든 감정 키워드들 (대명사, 명사 및 서술어)을 추출할 수 있다. 질환 진단 장치는 추출된 감정 키워드 중 서술어에 명사화하 고 감정 키워드에 대응하는 출연 빈도 및 감정 평가 사전에 따른 감정 점수를 매칭할 수 있다. 질환 진단 장치 는 출연 빈도 및 감정 점수에 따른 색상 및 크기로 각 추출된 감정 키워드를 표시한 워드 클라우드를 생성 할 수 있다. 도 4의 워드 클라우드에서 가슴, 감정, 나, 기억, 기대, 어제, 느낌, 오늘, 자신과 같은 감정 키워 드들은 빛, 가속, 무드등 이해, 풍경, 공허함, 만남, 친구, 시간, 대화, 외로움과 같은 감정 키워드보다 출연빈 도 또는 감정 점수가 상대적으로 낮은 키워드일 수 있다. 도 5은 10분 동안의 우울증 환자의 음성 데이터에 기 반하여 생성된 일 실시예에 따른 멜 스펙스토그램의 예시도이다. 도 5와 같이, 일 실시예에 따른 전처리 모듈은 멜 스펙트로그램을 통해 시간에 따른 주파수 크기를 나타낼 수 있다. 따라서, 질환 진단 장치는 멜 스펙트로그램으로부터 톤, 세기, 변화량, 휴지기에 관련된 이미지 특징값을 추출하고, 추출된 특징값에 기반하여 우울증 여부를 분류할 수 있다. 도 6은 일 실시예에 따른 이미지 데이터셋의 예를 나타낸다. 도 6을 참조하면, 이미지 데이터셋은 시각화된 텍스트 데이터, 시각화된 음성 데이터 및 얼굴 이미지 및 포즈 이미지를 포함할 수 있다. 상기 시각화된 텍스트 데이터는 우울증 환자의 토큰화한 텍스트데이터의 워드클라우 드 이미지일 수 있다. 상기 시각화된 음성 데이터는 멜 스펙트로그램으로 변환된 음성 데이터의 이미지일 수 있 다. 일 실시예에서, 상기 이미지 데이터셋은 사용자가 기록 또는 발화한 문장(어절 또는 단락의 시작과 종료시 점)을 기준으로 분할되어 학습(또는, 테스트)될 수 있다. 또는, 이미지 데이터셋은 일정 시간 단위로 획득된 우 울 환자의 데이터셋을 포함할 수 있다. 도 7은 일 실시예에 따른 분류 모듈의 세부 구성도를 나타낸다. 도 7을 참조하면, 일 실시예에 따른 분류 모듈은 컨볼루션 레이어(conv)와 멕스풀링 레이어(maxpooling layer)을 포함하는 3차원 단일 네트워크 모델을 포함할 수 있다. 분류 모듈은 3차원 단일 네트워크 모델을 이용하여 입력된 이미지 데이터셋을 학습할 수 있다. 학습 과정에서 분류 모듈은 이미지 데이터셋의 특징 값과 관련하여 각 이미지 데이터셋의 우울증 및 정상인을 구분 가능한 라벨을 학습할 수 있다. 이와 같이, 일 실시예에 따른 분류 모듈은 다른 디멘젼(dimension)을 가지며 타입과 특성이 다른 데이터를 이용하여 앙상블 기법으로 우울증을 진단하던 인공지능 모델과 달리, 이미지 데이터에 기반하여 단일 네트워크 를 사용하여 우울증 여부를 분류하므로, 네트워크 모델의 크기를 줄일 수 있고, 최적화된 학습 모델을 구성할 수 있다. 도 8은 일 실시예에 따른 분류 모듈의 학습 과정을 도시한 도면이다. 도 8을 참조하면, 동작 810에서, 질환 진단 장치는 전처리된 이미지 데이터, 시각화된 음성 특성(스펙토그 램), 시각화된 텍스트 데이터(워드 클라우드)를 포함하는 3차원 이미지 데이터셋을 획득할 수 있다. 동작 820에서, 질환 진단 장치는 획득된 3차원 이미지 데이터셋 중 일부를 학습용 데이터셋(training dataset)으로, 그 나머지를 테스트용 데이터셋(test dataset)으로 분할할 수 있다. 동작 830에서, 질환 진단 장치 학습의 정확도를 개선하기 위한 추가적인 전처리를 수행할 수 있다. 예를 들어, 질환 진단 장치는 적은 수의 학습용 데이터셋에 대하여 데이터 증강 또는 k-fold trainging 기법을 사용하여 데이터 개수를 증가시킬 수 있다. 동작 840에서, 질환 진단 장치는 분류 모듈에 학습용 데이터셋을 입력하고, 분류기(classificer)를 거쳐 네트워크를 학습시킨다. 이후, 질환 진단 장치는 테스트용 데이터셋을 이용하여 학습된 분류 모듈을 이용하여 우울 환자의 우 울증 여부를 진단할 수 있다. 도 9는 일 실시예에 따른 질환 진단 방법의 흐름도를 나타낸다. 도 9를 참조하면, 동작 910에서, 질환 진단 장치는 검사대상자(예: 우울 환자)에 관련된 텍스트 데이터, 음성 데이터 및 이미지 데이터 중 적어도 2종을 포함하는 멀티 모달 데이터를 획득할 수 있다. 예를 들어, 질환 진단 장치는 검사대상자의 진단 동안 기록된 상기 동영상 데이터로부터 이미지 데이터, 및 상기 음성 데이 터를 각기 추출할 수 있다. 상기 이미지 데이터는 얼굴 표정 또는 신체 움직임 중 적어도 하나에 관련된 순차적 인 이미지 프레임을 포함할 수 있다. 다른 예를 들어, 질환 진단 장치는 동영상 데이터로부터 추출된 음성 데이터를 텍스트 변환하여 상기 텍스트 데이터를 생성할 수 있다. 추가적으로 또는 대체적으로, 질환 진단 장치 는 검사대상자의 소설 네트워크로부터 상기 텍스트 데이터를 추출할 수 있다. 동작 920에서, 질환 진단 장치는 멀티 모달 데이터 중 이미지 데이터 이외의 데이터를 시각화할 수 있다. 예를 들어, 질환 진단 장치는 텍스트 데이터로부터 감정 키워드를 추출하고, 추출된 감정 키워드를 워드 클라우드(word cloud)로 시각화할 수 있다. 다른 예를 들어, 질환 진단 장치는 음성 데이터에 멜 스펙토그 램(Mel spectrogram) 기법을 적용하여 시각화할 수 있다. 동작 930에서, 질환 진단 장치는 멀티 모달 데이터 중 이미지 데이터 및 상기 시각화된 데이터를 포함하는 이미지 데이터셋을 구성할 수 있다. 동작 930에서, 질환 진단 장치는 이미지 데이터가 2차원 이상의 컬러 이미지 데이터이면, 상기 이미지 데이터를 1차원 흑백 이미지 데이터로 변환함에 따라 이미지 데이터를 경량화 할 수 있다. 동작 940에서, 질환 진단 장치는 상기 이미지 데이터셋에 기반하여 검사대상자의 지정된 질환 여부를 분류 할 수 있다. 상기 지정된 질환은 예를 들면, 우울증, 조울증, 불안증, 우울장애, 또는 불안장애 중 적어도 하나 의 질환을 포함할 수 있다. 예를 들어, 질환 진단 장치는 컨볼루션 구조의 3차원 단일 네트워크 모델을 통 해 상기 우울 환자의 우울증 여부를 분류할 수 있다. 이와 같이, 일 실시예에 따른 질환 진단 장치는 디바이스를 통해서 확보된 데이터를 이미지화 하여 학습데 이터셋 또는 진단 데이터셋을 구성하여 단일 진단 네트워크 모델에 입력하여 지정된 정신 질환을 진단하는 방법 에 관한 것으로 본 발명을 사용하는 경우, 네트워크 모델의 크기가 현저히 줄어들 뿐만 아니라 정확도 및 진단 속도를 개선할 수 있다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",“A 또는 B 중 적어도 하나”, \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나” 및 “A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, “기능적으로” 또는 “통신적으로”라는 용어와 함께 또는 이런 용 어 없이, “커플드” 또는 “커넥티드”라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 질환 진단 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 도 3의 메모리)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하 는 소프트웨어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 질환 진단 장치)의 프로세서(예: 프로세서는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실 행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영 되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체 의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구 적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두개의 사용자 장치들(예: 스 마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 본 문서의 다양한 실시예에 따른 구성 요소들은 소프트웨어 또는 DSP(digital signal processor), FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)와 같은 하드웨어 형태로 구현 될 수 있으며, 소정의 역할들을 수행할 수 있다. '구성 요소들'은 소프트웨어 또는 하드웨어에 한정되는 의미는 아니며, 각 구성 요소는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세 서들을 재생시키도록 구성될 수도 있다. 일 예로서 구성 요소는 소프트웨어 구성 요소들, 객체지향 소프트웨어 구성 요소들, 클래스 구성 요소들 및 태스크 구성 요소들과 같은 구성 요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데 이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함할 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있다. 다양한 실시예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통 합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수 의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2024-0076495", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 우울증 진단에 관련된 인공지능 모델의 예시도이다. 도 2는 일 실시예에 따른 질환 진단 장치의 개념도를 나타내고, 도 3은 일 실시예에 따른 질환 진단 장치의 구 성도를 나타낸다. 도 4는 일 실시예에 따른 워드 클라우드의 예시도는 나타낸다. 도 5은 10분 동안의 우울증 환자의 음성 데이터에 기반하여 생성된 일 실시예에 따른 멜 스펙스토그램의 예시도 이다. 도 6은 일 실시예에 따른 이미지 데이터셋의 예를 나타낸다. 도 7은 일 실시예에 따른 분류 모듈의 세부 구성도를 나타낸다. 도 8은 일 실시예에 따른 분류 모듈의 학습 과정을 도시한 도면이다. 도 9는 일 실시예에 따른 질환 진단 방법의 흐름도를 나타낸다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
