{"patent_id": "10-2020-0144207", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0059058", "출원번호": "10-2020-0144207", "발명의 명칭": "폐루프 배전계통의 보호장치 및 인공지능 장치", "출원인": "광주과학기술원", "발명자": "김윤수"}}
{"patent_id": "10-2020-0144207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "변전소와 수용가를 연결하는 폐루프 배전계통 상에, 적어도 두 개가 이격하는 마련되는 폐루프 배전계통의 보호장치에 있어서, 상기 폐루프 배전계통의 보호장치는, 전류를 차단하는 차단기구; 및상기 차단기구의 차단을 결정하는 인공지능 장치가 포함되고, 상기 인공지능 장치에는, 데이터를 저장하는 메모리;학습된 모델이 동작하는 프로세서; 및 어느 하나의 상기 보호장치의 동작을 위한 학습된 모델을 제공하기 위하여, 상기 적어도 두 개의 보호장치 사이의 배전선로 구간과 그 외의 구간에서 선로가 단락 및 지락 고장난 것에 상당하는 상기 입력 데이터 및 상기 출력 데이터를 학습하는 러닝 프로세서가 포함되는 폐루프 배전계통의 보호장치."}
{"patent_id": "10-2020-0144207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 프로세서에는, 적어도 두 개의 학습된 모델이 제공되고, 상기 적어도 두 개의 학습된 모델 중의 하나는 다른 하나에 비하여, 학습 사이클이 긴 폐루프 배전계통의 보호장치."}
{"patent_id": "10-2020-0144207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 학습된 모델의 출력단에 마련되어, 고장으로 판단하는 확률값을 조절하는 확률값 조절부가 포함되는 폐루프 배전계통의 보호장치."}
{"patent_id": "10-2020-0144207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 입력 데이터는, 전원 측에서 측정된 순시전압, 전원 측에서 측정된 순시전류, 순시 임피던스, 순시 대칭성분으로 전류/전압, 대칭분 임피던스, 고장 방향, 기본파 성분 RMS순시 전류, 기본파 성분 RMS순시 전압, 및부하 측에서 측정된 순시전압 중의 적어도 일부를 포함하는 폐루프 배전계통의 보호장치."}
{"patent_id": "10-2020-0144207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 출력 데이터는 고장의 종류정보 및 상태정보를 포함하는 폐루프 배전계통의 보호장치."}
{"patent_id": "10-2020-0144207", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "데이터를 저장하는 메모리;-다른 하나에 비하여 학습 사이클이 다른 적어도 두개의 학습된 모델과, -상기 적어도 두개의 학습된 모델의 출력단에 각각 마련되어, 이상동작으로 판단하는 확률값을 조절하는 적어도공개특허 10-2022-0059058-3-두 개의 확률값 조절부과, -상기 적어도 두 개의 확률값 조절부 중의 어느 하나라도 이상동작을 판단되는 경우에는 이상동작에 따른 대응신호를 출력하는 합산기가 포함되는 인공지능 장치."}
{"patent_id": "10-2020-0144207", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 폐루프 배전계통의 보호장치에는, 전류를 차단하는 차단기구; 및 상기 차단기구의 차단을 결정하 는 인공지능 장치가 포함되고, 상기 인공지능 장치에는, 데이터를 저장하는 메모리; 학습된 모델이 동작하는 프 로세서; 및 어느 하나의 상기 보호장치의 동작을 위한 학습된 모델을 제공하기 위하여, 상기 적어도 두 개의 보 호장치 사이의 배전선로 구간과 그 외의 구간에서 선로가 단락 및 지락 고장난 것에 상당하는 상기 입력 데이터 및 상기 출력 데이터를 학습하는 러닝 프로세서가 포함된다."}
{"patent_id": "10-2020-0144207", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 폐루프 배전계통의 보호장치 및 인공지능 장치에 관한 것이다."}
{"patent_id": "10-2020-0144207", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "배전계통은 배전용 변전소에서 전기수용설비에 분산 배분되는 전선로 및 관련 설비를 지칭한다. 상기 배전계통 의 전압은 22.9kV에 이른다. 상기 배전계통은 소규모 분산형 전원발생장치(가스 터빈,태양 광 등)의 출현으로 인해 단방향에서 양방향화되고 있다. 이에 따라서, 상기 배전계통은 종래 방사형 구조에서 폐루프로 구성된다. 상기 배전계통에는, 배전선로의 폴트(fault) 시에 배전선로를 차단하는 보호장치가 마련된다. 상기 보호장치는 서킷 브레이커(circuit breaker)를 포함할 수 있다. 상기 보호장치를 동작하는 종래 방식으로 인용문헌 1이 소 개된 바가 있다. 상기 인용문헌 1에 따르면, 배전선로를 따라서 연장하는 통신선로가 마련된다. 상기 보호장치 에는 상기 통신선로를 제어하는 제어장치가 마련된다. 상기 통신선로는 복수의 상기 보호장치를 연결한다. 상기 통신선로는 인입/인출되는 전력정보를 송수신하여 폴트의 발생시에 서킷 브레이커가 동작하도록 한다. 상기 통신선로 및 상기 통신선로의 제어장치를 제공하기 위해서는 상당한 비용이 필요하다. 예를 들어, 통신선 로를 광통신으로 제공하기 위해서는 9,900원/m의 비용이 소요된다. 상기 광통신을 신호처리라는 통신모뎀의 비 용이 추가로 필요하다. 추산에 따르면, 상기 통신선로의 마련에 필요한 비용은 전체 배전선로 재료1ㅣ의 33.7% 를 차지한다. 선행기술문헌 비특허문헌 (비특허문헌 0001) date of publication November 11, 2019, Digital Object Identifier 10.1109/ACCESS.2019.2952934, BO.TJAN POLAJ.ER 1, (Member, IEEE), MATEJ PINTARI. 1, MIRAN RO.ER 2, AND GORAZD .TUMBERGER 1, (Member, IEEE), 'Protection of MV Closed-Loop Distribution Networks With Bi- Directional Overcurrent Relays and GOOSE Communications. date of current version November 26, 2019."}
{"patent_id": "10-2020-0144207", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기되는 배경에서 제안되는 것으로서, 통신장치가 별도로 마련되지 않더라도 배전계통을 보호할 수 있는 폐루프 배전계통의 보호장치를 제공한다."}
{"patent_id": "10-2020-0144207", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 폐루프 배전계통의 보호장치에는, 전류를 차단하는 차단기구; 및 상기 차단기구의 차단을 결정 하는 인공지능 장치가 포함되고, 상기 인공지능 장치에는, 데이터를 저장하는 메모리; 학습된 모델이 동작하는 프로세서; 및 어느 하나의 상기 보호장치의 동작을 위한 학습된 모델을 제공하기 위하여, 상기 적어도 두 개의 보호장치 사이의 배전선로 구간과 그 외의 구간에서 선로가 단락 및 지락 고장난 것에 상당하는 상기 입력 데이 터 및 상기 출력 데이터를 학습하는 러닝 프로세서가 포함된다."}
{"patent_id": "10-2020-0144207", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 통신선로를 비롯한 통신설비의 전체비용을 절감할 수 있다. 본 발명에 따르면, 통신체계의 고장으로 인한 보호기기의 오동작 및 부동작을 방지하여 에너지 공급의 신뢰도가 증가한다."}
{"patent_id": "10-2020-0144207", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. <인공 지능(AI: Artificial Intelligence)> 인공 지능은 인공적인 지능 또는 이를 만들 수 있는 방법론을 연구하는 분야를 의미하며, 머신 러닝(기계 학습, Machine Learning)은 인공 지능 분야에서 다루는 다양한 문제를 정의하고 그것을 해결하는 방법론을 연구하는 분야를 의미한다. 머신 러닝은 어떠한 작업에 대하여 꾸준한 경험을 통해 그 작업에 대한 성능을 높이는 알고리 즘으로 정의하기도 한다. 인공 신경망(ANN: Artificial Neural Network)은 머신 러닝에서 사용되는 모델로써, 시냅스의 결합으로 네트워 크를 형성한 인공 뉴런(노드)들로 구성되는, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공 신경 망은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 인공 신경망은 입력층(Input Layer), 출력층(Output Layer), 그리고 선택적으로 하나 이상의 은닉층(Hidden Layer)를 포함할 수 있다. 각 층은 하나 이상의 뉴런을 포함하고, 인공 신경망은 뉴런과 뉴런을 연결하는 시냅 스를 포함할 수 있다. 인공 신경망에서 각 뉴런은 시냅스를 통해 입력되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함숫값을 출력할 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향 등이 포함된 다. 그리고, 하이퍼파라미터는 머신 러닝 알고리즘에서 학습 전에 설정되어야 하는 파라미터를 의미하며, 학습 률(Learning Rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포함된다. 인공 신경망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수 는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신 러닝은 학습 방식에 따라 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning)으로 분류할 수 있다. 지도 학습은 학습 데이터에 대한 레이블(label)이 주어진 상태에서 인공 신경망을 학습시키는 방법을 의미하며, 레이블이란 학습 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결과 값)을 의미할 수 있다. 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않는 상태에서 인공 신경망을 학습시키 는 방법을 의미할 수 있다. 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화 하는 행동 혹은 행동 순서를 선택하도록 학습시키는 학습 방법을 의미할 수 있다. 인공 신경망 중에서 복수의 은닉층을 포함하는 심층 신경망(DNN: Deep Neural Network)으로 구현되는 머신 러닝 을 딥 러닝(심층 학습, Deep Learning)이라 부르기도 하며, 딥 러닝은 머신 러닝의 일부이다. 이하에서, 머신 러닝은 딥 러닝을 포함하는 의미로 사용된다. 본 발명은 상기 개념에 따른 인공지능 장치를 응용한다. 도 1은 본 발명의 일 실시예에 따른 AI 장치를 나타낸다. AI 장치는 TV, 프로젝터, 휴대폰, 스마트폰, 데스크탑 컴퓨터, 노트북, 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 태블릿 PC, 웨어러블 장치, 셋톱박스(STB), DMB 수신기, 라디오, 세탁기, 냉장고, 데스크탑 컴퓨터, 디지털 사이니지, 로봇, 차량 등 과 같은, 고정형 기기 또는 이동 가능한 기기 등으로 구현될 수 있다. 도 1을 참조하면, AI장치는 통신부, 입력부, 러닝 프로세서, 센싱부, 출력부, 메모리 및 프로세서 등을 포함할 수 있다. 통신부는 유무선 통신 기술을 이용하여 다른 AI 장치나 AI 서버 등의 외부 장치들과 데이터를 송수신 할 수 있다. 예컨대, 통신부는 외부 장치들과 센서 정보, 사용자 입력, 학습 모델, 제어 신호 등을 송수신 할 수 있다. 다만, 보호장치를 직접 연결하는 수단으로 작용하지는 않는다. 이때, 통신부가 이용하는 통신 기술에는 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), LTE(Long Term Evolution), 5G, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), 블 루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), ZigBee, NFC(Near Field Communication) 등이 있을 수 있다. 입력부는 다양한 종류의 데이터를 획득할 수 있다. 이때, 입력부는 영상 신호 입력을 위한 카메라, 오디오 신호를 수신하기 위한 마이크로폰, 사용자로부터 정보를 입력 받기 위한 사용자 입력부 등을 포함할 수 있다. 여기서, 카메라나 마이크로폰을 센서로 취급하여, 카메라나 마이크로폰으로부터 획득한 신호를 센싱 데이터 또는 센서 정보라고 할 수도 있다. 입력부는 모델 학습을 위한 학습 데이터 및 학습 모델을 이용하여 출력을 획득할 때 사용될 입력 데이터 등을 획득할 수 있다. 입력부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 프로세서 또는 러닝 프로세서는 입력 데이터에 대하여 전처리로써 입력 특징점(input feature)을 추출할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망으로 구성된 모델을 학습시킬 수 있다. 여기서, 학습 된 인공 신경망을 학습 모델이라 칭할 수 있다. 학습 모델은 학습 데이터가 아닌 새로운 입력 데이터에 대하여 결과 값을 추론해 내는데 사용될 수 있고, 추론된 값은 어떠한 동작을 수행하기 위한 판단의 기초로 이용될 수 있다. 이때, 러닝 프로세서는 AI 서버의 러닝 프로세서과 함께 AI 프로세싱을 수행할 수 있다. 이때, 러닝 프로세서는 AI 장치에 통합되거나 구현된 메모리를 포함할 수 있다. 또는, 러닝 프로세서 는 메모리, AI 장치에 직접 결합된 외부 메모리 또는 외부 장치에서 유지되는 메모리를 사용하 여 구현될 수도 있다. 센싱부는 다양한 센서들을 이용하여 AI 장치 내부 정보, AI 장치의 주변 환경 정보 및 사용자 정보 중 적어도 하나를 획득할 수 있다. 이때, 센싱부에 포함되는 센서에는, 전류 센서, 전압 센서, 근접 센서, 조도 센서, 가속도 센서, 자기 센 서, 자이로 센서, 관성 센서, RGB 센서, IR 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰, 라이다, 레이더 등이 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시킬 수 있다. 이때, 출력부에는 시각 정보 를 출력하는 디스플레이부, 청각 정보를 출력하는 스피커, 촉각 정보를 출력하는 햅틱 모듈 등이 포함될 수 있 다. 상기 출력부는 제어신호를 발생시킬 수 있다. 상기 제어신호를 하드웨어의 동작을 제어하는 신호일 수 있다. 메모리는 AI 장치의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 예컨대, 메모리는 입력 부에서 획득한 입력 데이터, 학습 데이터, 학습 모델, 학습 히스토리 등을 저장할 수 있다. 프로세서는 데이터 분석 알고리즘 또는 머신 러닝 알고리즘을 사용하여 결정되거나 생성된 정보에 기초하 여, AI 장치의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. 그리고, 프로세서는 AI 장치(10 0)의 구성 요소들을 제어하여 결정된 동작을 수행할 수 있다. 이를 위해, 프로세서는 러닝 프로세서 또는 메모리의 데이터를 요청, 검색, 수신 또는 활용할 수 있고, 상기 적어도 하나의 실행 가능한 동작 중 예측되는 동작이나, 바람직한 것으로 판단되는 동작을 실행 하도록 AI 장치의 구성 요소들을 제어할 수 있다. 이때, 프로세서는 결정된 동작을 수행하기 위하여 외부 장치의 연계가 필요한 경우, 해당 외부 장치를 제 어하기 위한 제어 신호를 생성하고, 생성한 제어 신호를 해당 외부 장치에 전송할 수 있다. 프로세서는 사용자 입력에 대하여 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 사용자의 요구 사 항을 결정할 수 있다. 프로세서는 AI 장치의 동작 내용이나 동작에 대한 사용자의 피드백 등을 포함하는 이력 정보를 수집 하여 메모리 또는 러닝 프로세서에 저장하거나, AI 서버 등의 외부 장치에 전송할 수 있다. 수 집된 이력 정보는 학습 모델을 갱신하는데 이용될 수 있다. 프로세서는 메모리에 저장된 응용 프로그램을 구동하기 위하여, AI 장치의 구성 요소들 중 적어 도 일부를 제어할 수 있다. 나아가, 프로세서는 상기 응용 프로그램의 구동을 위하여, AI 장치에 포 함된 구성 요소들 중 둘 이상을 서로 조합하여 동작시킬 수 있다. 도 2는 본 발명의 일 실시 예에 따른 AI 서버를 나타낸다. 도 2를 참조하면, AI 서버는 머신 러닝 알고리즘을 이용하여 인공 신경망을 학습시키거나 학습된 인공 신 경망을 이용하는 장치를 의미할 수 있다. 여기서, AI 서버는 복수의 서버들로 구성되어 분산 처리를 수행 할 수도 있고, 5G 네트워크로 정의될 수 있다. 이때, AI 서버는 AI 장치의 일부의 구성으로 포함되어, AI 프로세싱 중 적어도 일부를 함께 수행할 수도 있다. AI 서버는 통신부, 메모리, 러닝 프로세서 및 프로세서 등을 포함할 수 있다. 통신부는 AI 장치 등의 외부 장치와 데이터를 송수신할 수 있다. 메모리는 모델 저장부를 포함할 수 있다. 모델 저장부는 러닝 프로세서을 통하여 학습 중 인 또는 학습된 모델(또는 인공 신경망, 231a)을 저장할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망(231a)을 학습시킬 수 있다. 학습 모델은 인공 신경 망의 AI 서버에 탑재된 상태에서 이용되거나, AI 장치 등의 외부 장치에 탑재되어 이용될 수도 있다. 학습 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 전부가 소프트웨어로 구현되는 경우 학습 모델을 구성하는 하나 이상의 명령어(instruction)는 메모리 에 저장될 수 있다. 프로세서는 학습 모델을 이용하여 새로운 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기 초한 응답이나 제어 명령을 생성할 수 있다. 이하에서 설명한 폐루프 배전계통의 보호장치의 구성을 위하여, 상기 인공지능 장치 및 상기 인공지 능 서버는 일부 기능이 빠질 수도 있다. 상기 인공지능 장치 및 상기 인공지능 서버의 일부 기 능은 단일의 기능블록으로 합해질 수도 있다. 상기 폐루프 배전계통의 보호장치는 도 1 또는 2에서 설명한 AI 장치의 구성을 포함하고 AI 장치 의 기능을 수행할 수 있다. 상기 폐루프 배전계통의 보호장치는, 인공지능 서버의 구성을 포함 하고 인공지능 서버의 기능을 수행할 수 있다. 상기 폐루트 배전계통의 보호장치는, 상기 AI 장치 및 상기 인공지능 서버에 각 부품 구성을 포함할 수 있고, 두 장치의 협업에 의해서 동작 할 수 있다. 이하의 설명에서는 상기 폐루프 배전계통의 보호장치는 상기 인공지능 장치에 의해서 수행되는 것을 예시한다. 도 3은 폐루프 배전계통을 설명하는 도면이다. 도 3을 참조하면, 변전소(sub station)는, 적어도 두 개(도면에서는 6개)의 폐루트 배전계통 보호장치 를 폐루프로 연결할 수 있다. 상기 폐루프는 배전계통을 제공할 수 있다. 상기 보호장치의 인근에는 수 용가가 놓일 수 있다. 상기 폐루프 배전계통의 보호장치는 상기 인공지능 장치가 포함될 수 있다. 상기 폐루프 배전계통의 보호장치에는 서킷 브레이커, 및 리클로저 등으로 예시되는 다양한 차단기구를 포함할 수 있다. 상기 차단기구는 전류를 흐름을 차단하는 역할을 수행할 수 있다. 상기 차단기구에 의해서 인접하는 한 쌍의 보 호장치(300a)(300b) 사이의 전류흐름을 차단될 수 있다. 상기 차단기구에 의해서 폐루프 배전계통은 폴트가 발생한 곳을 제외하는 곳은 보호될 수 있다. 상기 인공지능 장치에는 학습된 모델이 저장될 수 있다. 상기 학습된 모델의 학습에 사용되는, 입력 데이 터와 출력 데이터를 설명한다. 도 4는 학습에 사용되는 입력 데이터이고, 도 5는 출력 데이터이다. 먼저 도 4를 참조하면, 삼상에 대하여 각 정보를 입력 데이터로 활용할 수 있다. 구체적으로, 전원 측에서 측정 된 순시전압, 전원 측에서 측정된 순시전류, 순시 임피던스, 순시 대칭 성분으로 전류/전압, 대칭분 임피던스, 고장 방향, 기본파 성분 RMS순시 전류, 기본파 성분 RMS순시 전압, 부하 측에서 측정된 순시전압을 사용할 수 있다. 상기 정보 중에서 선택되는 정보가 학습에 사용될 수 있다. 도 5를 참조하면, 상기 입력 데이터에 대응하는 출력 데이터는, 고장(fault)의 종류정보(a)와 상태정보(b)를 포 함할 수 있다. 상기 종류정보는 고장이 무엇인가를 나타내는 정보이고, 상기 상태정보는 상기 차단기구를 어떤 상태로 할지를 나타내는 정보이다. 상기 고장의 종류정보에는, 상기 정상(normal), 삼상 중 하나의 선이 접지, 삼상 중 두 개의 선이 접지, 삼상 중 두 개의 선이 단락, 및 삼상이 모두 접지의 경우를 포함할 수 있다. 상기 상태정보에는 차단기구의 동작 을 판단할 수 있다. 정상(close)은 닫혀있고, 비정상(open)은 차단된 것을 의미할 수 있다. 상기 차단기구는, 가공선로의 경우에는 하나의 보호장치에 하나가 마련될 수 있다. 상기 차단기구는, 지중선로의 경우에는 하나의 보호장치에 적어도 두개가 마련될 수 있다. 상기 지중선로의 경 우에, 상기 적어도 두개의 차단기구는 전류흐름을 기준으로 직렬로 마련될 수 있다. 이때, 차단기구는 고장 이 발생한 쪽과 인접하는 차단기구를 동작시킬 수 있다. 도 5(a)에서 W1_open은 W4_open은, 네 개의 차단기구 가 마련되는 경우에, 1번 차단기구를 동작시키는 경우와 4번 차단기구를 동작시키는 경우를 식별할 수 있다. 상기 입력 데이터 및 상기 출력 데이터를 포함하는 학습데이터는 LSTM(long short term memory) 기법으로 학습 할 수 있다. 상기 LSTM 기법은 상기 러닝 프로세서의 전부 또는 일부 또는 협력으로 수행할 수 있다. 상기 학습은, 상기 고장의 종류정보(도 5(a))를 먼저 학습한 다음에 상기 상태정보(도 5(b))를 다음에 학습할 수 있다. 이 학습을 직렬학습이라고 할 수 있다. 상기 학습은, 상기 고장의 종류정보(도 5(a)) 및 상기 상태정 보(도 5(b))를 함께 학습할 수 있다. 이 학습을 병렬학습이라고 할 수 있다. 상기 직렬학습 상기 병렬학습 어느 경우도 학습에 적용할 수 있다. 상기 학습은, 모델이 되는 배전계통에 특유하게 수행할 수 있다. 상기 보호장치가 여섯개(제 1 ~ 6 보호장 치)가 마련되는 폐루프 배전계통를 예로 든다. 상기 제 1 보호장치의 학습모델을 학습하는 때에는, 제 1 ~ 6 보 호장치 중의 적어도 한 쌍의 보호장치의 사이에 있는 선로에서, 고장이 발생한 경우를 학습할 수 있다. 여기서 상기 보호장치의 선로는 배전선로를 포함할 수 있다. 상기 보호장치의 선로는, 상기 배전선로 외에의 구간에서선로가 단락되거나 지락되는 경우를 포함할 수 있다. 이하의 설명에서도 마찬가지이다. 상기 제 2 보호장치의 학습모델을 학습하는 때에는, 제 1 ~ 6 보호장치 중의 적어도 한 쌍의 보호장치의 사이에 있는 선로에서, 고장이 발생한 경우를 학습할 수 있다. 여기서 적어도 하나는 부분집합인 경우를 포함할 수 있 다. 다른 경우도 마찬가지이다. 물론, 각 보호장치의 학습모델을 제공할 때, 고장이 발생하지 않는 경우도 학습하여야 한다. 이와 같이, 모든 보호장치에 적합한 학습된 모델은, 자신을 포함하는 모든 보호장치 사이의 선로의 적어도 하나가 고장난 것에 상당하는 상기 입력 데이터 및 상기 출력 데이터를 이용할 수 있다. 위 학습에 따르면 각각의 보호장치는 서로 다른 학습된 모델이 AI장치에 탑재될 수 있다. 나아가서, 배전계통이 달라지는 경우에 다른 학습된 모델이 AI 장치에 탑재될 수 있다. 도 6은 상기 프로세서의 동작을 설명하는 도면이다. 상기 프로세서는, 상기 학습된 모델을 적어도 두 개 포함할 수 있다. 제 1 학습된 모델에 비하여 제 2 학 습된 모델은 학습 사이클이 길 수 있다. 예를 들어, 상기 제 1 학습된 모델을 학습할 때에는, 상기 입력 데이터 및 상기 출력 데이터는 4.02사이클(60Hz의 경우 0.06725sec) 동안 269 샘플을 이용하여 학습할 수 있다. 상기 제 2 학습된 모델을 학습할 때에는, 상기 입력 데이터 및 상기 출력 데이터는 8.04사이클(60Hz 의 경우 0.1345sec) 동안 537 샘플을 이용하여 학습할 수 있다. 한편, 상기 학습된 모델은 상기 메모리에 저장될 수 있다. 상기 프로세서는 상기 학습모델 을 업로드 할 수 있다. 상기 제 1 학습된 모델은 상기 제 2 학습된 모델에 비하여 짧은 시간을 참조하여 피쳐를 구하였다. 따라서, 상기 제 1 학습된 모델에 따르면, 상기 보호장치가 신속하게 동작할 수 있다. 상기 보호장치 가 신속하게 동작함으로써, 고장발생시에 고장에 따른 악영향의 전파를 신속하게 차단할 수 있다. 상기 제 2 학습된 모델은 상기 제 1 학습된 모델에 비하여 더 긴 시간을 참조하여 피쳐를 구한 것으 로서 더 정확할 수 있다. 따라서, 상기 제 1 학습된 모델이 파악하지 못한 고장을 더 정확하게 감지할 수 있다. 상기 보호장치에 상기 제 1, 2 학습된 모델에 함께 동작할 수 있도록 합산기가 마련 될 수 있다. 상기 합산기에 따르면 어느 쪽에서 고장신호가 감지되더라도 차단신호를 발생시킬 수 있다. 상기 차단신호에 의해서 상기 차단기가 동작할 수 있다. 상기 학습된 모델의 출력단에는, 각각 확률값 조절부이 마련될 수 있다. 상기 확률값 조절 부는 상기 학습된 모델에서 가능성으로 출력되는 값을 이용하여, 고장 및 정상으로 판단하 는 확률값을 제공할 수 있다. 예를 들어 상기 확률값 조절부의 확률값이 50%로 조절될 수 있다. 이 경우에는, 상기 학습된 모델에서 49%가 출력되는 경우에는 정상으로 판단하고, 51%로 출력되는 경우 에는 고장으로 판단할 수 있다. 상기 확률값 조절부는 사용자를 포함하는 외부의 인자로부터 조절될 수 있다. 상기 폐루프의 보호계통을 안전하 게 보호하고자 하는 경우에는, 상기 확류값을 낮게 설정할 수 있다. 상기 학습된 모델이 세 개 이상인 경우에는 상기 확률값 조절부도 마찬가지로 늘어날 수 있다. 이 경우에는 배전계통을 더 안전하게 보호할 수 있다. 산업상 이용가능성 본 발명에 따르면, 통신선로의 제공없이 폐루트 배전계통의 보호장치의 동작할 수 있다. 이에 따라서, 폐루프 배전계통의 설치에 드는 비용을 획기적으로 줄일 수 있다. 한편, 상기 입력 데이터 및 상기 출력 데이터는 시뮬레이션으로 제공할 수 있기 때문에, 인공지능의 구현을 위 하여 별도로 발생하는 납기증가, 및 비용증가의 문제는 없다."}
{"patent_id": "10-2020-0144207", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 AI 장치를 나타낸다. 도 2는 본 발명의 일 실시 예에 따른 AI 서버를 나타낸다. 도 3은 폐루프 배전계통을 설명하는 도면이다. 도 4는 학습에 사용되는 입력 데이터이다. 도 5는 출력 데이터이다. 도 6은 상기 프로세서의 동작을 설명하는 도면이다."}
