{"patent_id": "10-2023-0038404", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0143292", "출원번호": "10-2023-0038404", "발명의 명칭": "인공지능 학습데이터의 시각화방법, 이를 수행하는 컴퓨팅장치 및 컴퓨터-판독가능 매체", "출원인": "셀렉트스타 주식회사", "발명자": "전문휘"}}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "1 이상의 프로세서 및 1 이상의 메모리를 포함하는 컴퓨팅장치에서 수행되는 인공지능 학습데이터의 시각화방법으로서,1 이상의 속성정보에 대한 조건에 해당하는 쿼리에 상응하는 제1그래픽엘리먼트, 및 해당 쿼리와 관련된 학습데이터의 디스플레이레이어 상에서의 표시상태를 변경할 수 있는 인터페이스를 제공하는 스위칭인터페이스를 포함하는 쿼리목록레이어를 화면에 표시하는 쿼리목록표시단계; 및3 이하의 차원의 공간상에서 학습데이터 각각을 제2그래픽엘리먼트로 표시하는 디스플레이레이어를 화면에 표시하고, 상기 3 이하의 차원의 공간상에서 표시되는 상기 제2그래픽엘리먼트의 좌표는 해당 로우데이터의 특징정보에 따라 결정되는 디스플레이표시단계;를 포함하고,각각의 학습데이터는 로우데이터(RAW DATA) 및 해당 로우데이터에 대한 1 이상의 속성정보를 포함하고,사용자의 입력에 의하여 특정 쿼리가 활성화되었을 때, 상기 디스플레이레이어에서 표시되는 상기 제2그래픽엘리먼트의 시각적특성은 상기 특정 쿼리에 대한 제1그래픽엘리먼트의 시각적특성에 상응하는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 컴퓨팅장치 혹은 상기 컴퓨팅장치가 접속된 서버시스템에는,복수의 학습데이터를 포함하는 학습데이터셋이 업로드되어 있고,복수의 학습데이터 각각은, 로우데이터 및 해당 로우데이터에 대한 1 이상의 속성정보를 포함하는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 쿼리목록레이어는,사용자가 입력한 정보에 기초하여 생성되는 1 이상의 쿼리정보레이어를 포함하고,상기 쿼리정보레이어는,해당 쿼리에 상응하는 제1그래픽엘리먼트;해당 쿼리의 이름 및 해당 쿼리에 해당하는 학습데이터의 수를 포함하는 쿼리정보를 표시하는 쿼리정보영역;상기 디스플레이레이어에 매핑되는 제2그래픽엘리먼트의 표시상태를 표시하되, 사용자의 입력을 통해 해당 제2그래픽엘리먼트의 표시상태가 변경될 수 있는 스위칭인터페이스; 및사용자의 입력에 따라 해당 쿼리에 해당하는 1 이상의 속성정보의 조건을 표시하는 속성정보레이어를 화면에 표시하거나, 혹은 화면에 표시하지 않도록 하는 쿼리속성엘리먼트;를 포함하는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 스위칭인터페이스는,공개특허 10-2024-0143292-3-해당 쿼리와 관련된 학습데이터에 상응하는 제2그래픽엘리먼트가 상기 디스플레이레이어에 표시되는 상태임을표시하는 제1상태; 및해당 쿼리와 관련된 학습데이터에 상응하는 제2그래픽엘리먼트가 상기 디스플레이레이어에 표시되지 않는 상태임을 표시하는 제2상태; 중 하나의 상태로 표시되고,상기 제1상태의 스위칭인터페이스와 상기 제2상태의 스위칭인터페이스는, 상이한 시각적특성을 가지며 상기 스위칭인터페이스에 대한 사용자의 입력에 따라 서로 번갈아가며 변경되는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,사용자의 입력에 의하여 상기 스위칭인터페이스가 상기 제2상태로 표시되는 경우,해당 쿼리에 해당하는 제2그래픽엘리먼트는, 사용자가 입력한 표시조건에 따라, 기설정된 시각적특성을 가지는히든엘리먼트로서 상기 디스플레이레이어에 표시되는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서,사용자의 선택에 의하여 상기 스위칭인터페이스가 상기 제2상태로 표시되는 경우,해당 쿼리에 해당하는 제2그래픽엘리먼트는, 사용자가 입력한 표시조건에 따라, 어떠한 시각적형태로도 상기 디스플레이레이어에 표시되지 않는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,1 이상의 쿼리정보레이어 각각에 포함되는 스위칭인터페이스 각각은 사용자에 의해 독립적으로 조작될 수 있고,각각의 스위칭인터페이스에 대하여 사용자가 조작한 조작결과에 따라, 복수의 쿼리정보레이어 각각에 상응하는복수의 제2그래픽엘리먼트 중 1 이상은, 상기 디스플레이레이어에 동시에 표시되는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 쿼리목록표시단계는,사용자에 의하여, 사용자가 시각화하고 싶은 학습데이터의 조건에 해당하는 1 이상의 속성정보를 입력받는단계; 및사용자에 의하여, 상기 시각화하고 싶은 학습데이터에 상응하는 제1그래픽엘리먼트의 시각적특성정보를 입력받는 단계;를 포함하는 쿼리생성단계를 포함하는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 인공지능 학습데이터의 시각화방법은,상기 디스플레이레이어에 매핑된 학습데이터의 견본이미지를 표시하는 로우데이터레이어를 화면에 표시하는 로공개특허 10-2024-0143292-4-우데이터표시단계;를 더 포함하고,상기 로우데이터레이어는,사용자가 상기 디스플레이레이어 상에서 선택한 1 이상의 제2그래픽엘리먼트에 해당하는 학습데이터의 견본이미지를 표시하는 이미지목록레이어; 및상기 이미지목록레이어에서, 히든데이터에 해당하는 견본이미지의 표시상태를 표시하는 히든데이터표시인터페이스;를 포함하는 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 로우데이터표시단계는,사용자가 상기 디스플레이레이어 상에서 선택한 1 이상의 제2그래픽엘리먼트에 해당하는 학습데이터의 견본이미지를 상기 이미지목록레이어에 표시하되, 사용자가 입력한 표시조건에 따라, 상기 사용자에 의해 선택되지 않은 제2그래픽엘리먼트에 해당하는 학습데이터의 견본이미지를 더 표시할 수 있는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 9에 있어서,상기 로우데이터표시단계는,사용자가 상기 이미지목록레이어에 표시되는 견본이미지를 선택하는 경우, 선택된 견본이미지에 해당하는 학습데이터에 대한 제1상세정보를 표시하는 제1상세정보레이어를 팝업형식으로 화면에 표시하는 단계; 및사용자가 상기 제1상세정보레이어에 포함되는 확장엘리먼트를 선택하는 경우, 해당 학습데이터에 대한 제2상세정보를 표시하는 제2상세정보레이어를 팝업형식으로 화면에 표시하는 단계;를 포함하고,상기 제1상세정보레이어 및 제2상세정보레이어는,해당 학습데이터의 로우데이터; 및해당 로우데이터의 속성정보;를 표시하는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,상기 디스플레이표시단계는,상기 컴퓨팅장치 혹은 상기 컴퓨팅장치가 접속된 서버시스템에 업로드된 학습데이터셋을 피처임베딩모델에 입력하여 상기 학습데이터셋에 포함되는 로우데이터 각각에 대한 특징정보를 도출하는 특징정보도출단계;로우데이터 각각의 특징정보를 3 이하의 차원으로 축소하는 차원축소단계; 및로우데이터 각각에 대하여 차원이 축소된 특징정보를 상기 3 이하의 차원의 공간상의 특정좌표에 매핑하되, 해당 학습데이터에 해당하는 쿼리에 상응하는 제2그래픽엘리먼트로 상기 3 이하의 차원의 좌표를 가지는 공간상에표시하는 데이터매핑단계;를 포함하는, 시각화방법."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "1 이상의 프로세서 및 1 이상의 메모리를 포함하여, 인공지능 학습데이터의 시각화방법을 수행하는 컴퓨팅장치공개특허 10-2024-0143292-5-로서,1 이상의 속성정보에 대한 조건에 해당하는 쿼리에 상응하는 제1그래픽엘리먼트, 및 해당 쿼리와 관련된 학습데이터의 디스플레이레이어 상에서의 표시상태를 변경할 수 있는 인터페이스를 제공하는 스위칭인터페이스를 포함하는 쿼리목록레이어를 화면에 표시하는 쿼리목록표시부; 및3 이하의 차원의 공간상에서 학습데이터 각각을 제2그래픽엘리먼트로 표시하는 디스플레이레이어를 사용자단말의 화면에 표시하고, 상기 3 이하의 차원의 공간상에서 표시되는 상기 제2그래픽엘리먼트의 좌표는 해당 로우데이터의 특징정보에 따라 결정되는 디스플레이표시부;를 포함하고,각각의 학습데이터는 로우데이터(RAW DATA) 및 해당 로우데이터에 대한 1 이상의 속성정보를 포함하고,사용자의 입력에 의하여 특정 쿼리가 활성화되었을 때, 상기 디스플레이레이어에서 표시되는 상기 제2그래픽엘리먼트의 시각적특성은 상기 특정 쿼리에 대한 제1그래픽엘리먼트의 시각적특성에 상응하는, 컴퓨팅장치."}
{"patent_id": "10-2023-0038404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "1 이상의 프로세서 및 1 이상의 메모리를 포함하는 컴퓨팅장치에서 수행되는 인공지능 학습데이터의 시각화방법을 구현하기 위한 컴퓨터-판독가능 매체로서, 상기 컴퓨터-판독가능 매체는, 상기 컴퓨팅장치로 하여금 이하의단계들을 수행하도록 하는 컴퓨터 실행가능 명령어들을 포함하고,상기 이하의 단계들은:1 이상의 속성정보에 대한 조건에 해당하는 쿼리에 상응하는 제1그래픽엘리먼트, 및 해당 쿼리와 관련된 학습데이터의 디스플레이레이어 상에서의 표시상태를 변경할 수 있는 인터페이스를 제공하는 스위칭인터페이스를 포함하는 쿼리목록레이어를 화면에 표시하는 쿼리목록표시단계; 및3 이하의 차원의 공간상에서 학습데이터 각각을 제2그래픽엘리먼트로 표시하는 디스플레이레이어를 사용자단말의 화면에 표시하고, 상기 3 이하의 차원의 공간상에서 표시되는 상기 제2그래픽엘리먼트의 좌표는 해당 로우데이터의 특징정보에 따라 결정되는 디스플레이표시단계;를 포함하고,각각의 학습데이터는 로우데이터(RAW DATA) 및 해당 로우데이터에 대한 1 이상의 속성정보를 포함하고,사용자의 입력에 의하여 특정 쿼리가 활성화되었을 때, 상기 디스플레이레이어에서 표시되는 상기 제2그래픽엘리먼트의 시각적특성은 상기 특정 쿼리에 대한 제1그래픽엘리먼트의 시각적특성에 상응하는, 컴퓨터-판독가능매체."}
{"patent_id": "10-2023-0038404", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 학습데이터의 시각화방법, 이를 수행하는 컴퓨팅장치 및 컴퓨터-판독가능 매체로서, 더욱 상 세하게는 복수의 학습데이터를 포함하는 학습데이터셋에 대하여 사용자가 원하는 1 이상의 속성정보의 조건을 입 력하면, 해당 조건에 해당하는 학습데이터를 디스플레이레이어 상에 특정 그래픽엘리먼트로 시각화하여 표시할 수 있고, 직관적으로 제공되는 인터페이스를 통해 사용자는 업로드된 학습데이터셋을 기반으로 하는 다양한 인공 지능 학습데이터 시나리오를 용이하게 분석할 수 있는, 인공지능 학습데이터의 시각화방법, 이를 수행하는 컴퓨 팅장치 및 컴퓨터-판독가능 매체에 관한 것이다."}
{"patent_id": "10-2023-0038404", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 학습데이터의 시각화방법, 이를 수행하는 컴퓨팅장치 및 컴퓨터-판독가능 매체로서, 더욱 상세하게는 복수의 학습데이터를 포함하는 학습데이터셋에 대하여 사용자가 원하는 1 이상의 속성정보의 조건을 입력하면, 해당 조건에 해당하는 학습데이터를 디스플레이레이어 상에 특정 그래픽엘리먼트로 시각화하여 표시 할 수 있고, 직관적으로 제공되는 인터페이스를 통해 사용자는 업로드된 학습데이터셋을 기반으로 하는 다양한 인공지능 학습데이터 시나리오를 용이하게 분석할 수 있는, 인공지능 학습데이터의 시각화방법, 이를 수행하는 컴퓨팅장치 및 컴퓨터-판독가능 매체에 관한 것이다."}
{"patent_id": "10-2023-0038404", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기계학습모델은 학습용데이터(train data)를 학습시키고, 검증용데이터(validation data)로 학습에 대한 검증을 수행하고, 테스트용데이터(test data)로 해당 모델의 성능을 테스트하는 방식으로 개발된다. 더 구체적으로, 상 기 학습용데이터와 상기 검증용데이터는 해당 데이터의 레이블링(labeling) 정보와, 속성(feature)정보를 모두 포함하고, 상기 테스트용데이터는 속성정보만을 포함하고 있어, 기계학습모델은 테스트용데이터의 속성정보만을가지고 해당 데이터의 레이블(label)을 예측하였다. 이러한 방식으로 연구자들은 테스트 결과를 피드백하여 모델을 개선하는 방식으로 기계학습모델의 성능을 향상 시켰다. 그러나, 최근 들어, 인공지능 기술에 대한 연구가 활발히 진행되었고, 그 결과 인공지능 기술이 고도화 되었으며, 여러 오픈 소스를 통하여 인공지능 기술에 사용되는 여러 학습모델들의 성능이 상향 평준화된 결과, 위와 같은 방식으로 개발되던 모델 중심의 인공지능(Model-centric AI)은 성능향상에 있어서 효율성이 점차 떨 어지기 시작하였다. 따라서, 종래의 모델 중심의 인공지능(Model-centric AI) 기술에서 데이터 중심의 인공지능(Data-centric AI) 기술에 대한 관심이 점차 높아지고 있다. 데이터 중심의 인공지능(Data-centric AI) 기술이란, 학습모델은 이미 충분히 높은 성능을 가지고 있기 때문에, 반복된 테스트를 통해 학습모델을 반복적으로 개선하는 것이 아닌, 모 델테스트의 결과로서 도출된 개선사항에 대한 데이터셋을 수정하거나 추가하는 방식으로 해당 모델을 추가로 학 습시켜 학습모델의 성능을 향상시킬 수 있는 기술에 해당한다. 즉, 데이터 중심의 인공지능 기술은, 분석결과의 정확도가 떨어지는 엣지 케이스(Edge Case)를 발견하여 관련된 데이터를 데이터셋으로 더 구축함으로써 해당 학습모델의 성능을 높일 수 있으며, 이와 같은 방식으로 학습모델 의 성능을 높이기 위해서는 모델학습에 사용될 수 있는 학습데이터셋의 커버리지(coverage)를 분석하여 Data Split(train-validation-test)에 따른 데이터 분포 확인을 통해 그 적절성을 확인하는 것이 중요하다. 위와 같 은 목적을 수행하기 위하여 학습데이터셋의 커버리지를 사용자가 용이하게 분석할 수 있도록 직관적인 그래픽요 소를 활용하여 데이터를 시각화하는 기술이 필요한 실정이다."}
{"patent_id": "10-2023-0038404", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인공지능 학습데이터의 시각화방법, 이를 수행하는 컴퓨팅장치 및 컴퓨터-판독가능 매체로서, 더욱 상세하게는 복수의 학습데이터를 포함하는 학습데이터셋에 대하여 사용자가 원하는 1 이상의 속성정보의 조건을 입력하면, 해당 조건에 해당하는 학습데이터를 디스플레이레이어 상에 특정 그래픽엘리먼트로 시각화하여 표시 할 수 있고, 직관적으로 제공되는 인터페이스를 통해 사용자는 업로드된 학습데이터셋을 기반으로 하는 다양한 인공지능 학습데이터 시나리오를 용이하게 분석할 수 있는, 인공지능 학습데이터의 시각화방법, 이를 수행하는 컴퓨팅장치 및 컴퓨터-판독가능 매체를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0038404", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 과제를 해결하기 위하여, 본 발명의 일 실시예에서는, 1 이상의 프로세서 및 1 이상의 메모리를 포 함하는 컴퓨팅장치에서 수행되는 인공지능 학습데이터의 시각화방법으로서, 1 이상의 속성정보에 대한 조건에 해당하는 쿼리에 상응하는 제1그래픽엘리먼트, 및 해당 쿼리와 관련된 학습데이터의 디스플레이레이어 상에서의 표시상태를 변경할 수 있는 인터페이스를 제공하는 스위칭인터페이스를 포함하는 쿼리목록레이어를 화면에 표시 하는 쿼리목록표시단계; 및 3 이하의 차원의 공간상에서 학습데이터 각각을 제2그래픽엘리먼트로 표시하는 디스 플레이레이어를 화면에 표시하고, 상기 3 이하의 차원의 공간상에서 표시되는 상기 제2그래픽엘리먼트의 좌표는 해당 로우데이터의 특징정보에 따라 결정되는 디스플레이표시단계;를 포함하고, 각각의 학습데이터는 로우데이 터(RAW DATA) 및 해당 로우데이터에 대한 1 이상의 속성정보를 포함하고, 사용자의 입력에 의하여 특정 쿼리가 활성화되었을 때, 상기 디스플레이레이어에서 표시되는 상기 제2그래픽엘리먼트의 시각적특성은 상기 특정 쿼리 에 대한 제1그래픽엘리먼트의 시각적특성에 상응하는, 시각화방법을 제공한다. 본 발명의 일 실시예에서는, 상기 컴퓨팅장치 혹은 상기 컴퓨팅장치가 접속된 서버시스템에는, 복수의 학습데이 터를 포함하는 학습데이터셋이 업로드되어 있고, 복수의 학습데이터 각각은, 로우데이터 및 해당 로우데이터에 대한 1 이상의 속성정보를 포함할 수 있다. 본 발명의 일 실시예에서는, 상기 쿼리목록레이어는, 사용자가 입력한 정보에 기초하여 생성되는 1 이상의 쿼리 정보레이어를 포함하고, 상기 쿼리정보레이어는, 해당 쿼리에 상응하는 제1그래픽엘리먼트; 해당 쿼리의 이름 및 해당 쿼리에 해당하는 학습데이터의 수를 포함하는 쿼리정보를 표시하는 쿼리정보영역; 상기 디스플레이레이 어에 매핑되는 제2그래픽엘리먼트의 표시상태를 표시하되, 사용자의 입력을 통해 해당 제2그래픽엘리먼트의 표시상태가 변경될 수 있는 스위칭인터페이스; 및 사용자의 입력에 따라 해당 쿼리에 해당하는 1 이상의 속성정보 의 조건을 표시하는 속성정보레이어를 화면에 표시하거나, 혹은 화면에 표시하지 않도록 하는 쿼리속성엘리먼트;를 포함할 수 있다. 본 발명의 일 실시예에서는, 상기 스위칭인터페이스는, 해당 쿼리와 관련된 학습데이터에 상응하는 제2그래픽엘 리먼트가 상기 디스플레이레이어에 표시되는 상태임을 표시하는 제1상태; 및 해당 쿼리와 관련된 학습데이터에 상응하는 제2그래픽엘리먼트가 상기 디스플레이레이어에 표시되지 않는 상태임을 표시하는 제2상태; 중 하나의 상태로 표시되고, 상기 제1상태의 스위칭인터페이스와 상기 제2상태의 스위칭인터페이스는, 상이한 시각적특성 을 가지며 상기 스위칭인터페이스에 대한 사용자의 입력에 따라 서로 번갈아가며 변경될 수 있다. 본 발명의 일 실시예에서는, 사용자의 입력에 의하여 상기 스위칭인터페이스가 상기 제2상태로 표시되는 경우, 해당 쿼리에 해당하는 제2그래픽엘리먼트는, 사용자가 입력한 표시조건에 따라, 기설정된 시각적특성을 가지는 히든엘리먼트로서 상기 디스플레이레이어에 표시될 수 있다. 본 발명의 다른 실시예에서는, 사용자의 선택에 의하여 상기 스위칭인터페이스가 상기 제2상태로 표시되는 경우, 해당 쿼리에 해당하는 제2그래픽엘리먼트는, 사용자가 입력한 표시조건에 따라, 어떠한 시각적형태로도 상기 디스플레이레이어에 표시되지 않을 수 있다. 본 발명의 일 실시예에서는, 1 이상의 쿼리정보레이어 각각에 포함되는 스위칭인터페이스 각각은 사용자에 의해 독립적으로 조작될 수 있고, 각각의 스위칭인터페이스에 대하여 사용자가 조작한 조작결과에 따라, 복수의 쿼리 정보레이어 각각에 상응하는 복수의 제2그래픽엘리먼트 중 1 이상은, 상기 디스플레이레이어에 동시에 표시될 수 있다. 본 발명의 일 실시예에서는, 상기 쿼리목록표시단계는, 사용자에 의하여, 사용자가 시각화하고 싶은 학습데이터 의 조건에 해당하는 1 이상의 속성정보를 입력받는 단계; 및 사용자에 의하여, 상기 시각화하고 싶은 학습데이 터에 상응하는 제1그래픽엘리먼트의 시각적특성정보를 입력받는 단계;를 포함하는 쿼리생성단계를 포함할 수 있 다. 본 발명의 일 실시예에서는, 상기 인공지능 학습데이터의 시각화방법은, 상기 디스플레이레이어에 매핑된 학습 데이터의 견본이미지를 표시하는 로우데이터레이어를 화면에 표시하는 로우데이터표시단계;를 더 포함하고, 상 기 로우데이터레이어는, 사용자가 상기 디스플레이레이어 상에서 선택한 1 이상의 제2그래픽엘리먼트에 해당하 는 학습데이터의 견본이미지를 표시하는 이미지목록레이어; 및 상기 이미지목록레이어에서, 히든데이터에 해당 하는 견본이미지의 표시상태를 표시하는 히든데이터표시인터페이스;를 포함할 수 있다. 본 발명의 일 실시예에서는, 상기 로우데이터표시단계는, 사용자가 상기 디스플레이레이어 상에서 선택한 1 이 상의 제2그래픽엘리먼트에 해당하는 학습데이터의 견본이미지를 상기 이미지목록레이어에 표시하되, 사용자가 입력한 표시조건에 따라, 상기 사용자에 의해 선택되지 않은 제2그래픽엘리먼트에 해당하는 학습데이터의 견본 이미지를 더 표시할 수 있다. 본 발명의 일 실시예에서는, 상기 로우데이터표시단계는, 사용자가 상기 이미지목록레이어에 표시되는 견본이미 지를 선택하는 경우, 선택된 견본이미지에 해당하는 학습데이터에 대한 제1상세정보를 표시하는 제1상세정보레 이어를 팝업형식으로 화면에 표시하는 단계; 및 사용자가 상기 제1상세정보레이어에 포함되는 확장엘리먼트를 선택하는 경우, 해당 학습데이터에 대한 제2상세정보를 표시하는 제2상세정보레이어를 팝업형식으로 화면에 표 시하는 단계;를 포함하고, 상기 제1상세정보레이어 및 제2상세정보레이어는, 해당 학습데이터의 로우데이터; 및 해당 로우데이터의 속성정보;를 표시할 수 있다. 본 발명의 일 실시예에서는, 상기 디스플레이표시단계는, 상기 컴퓨팅장치 혹은 상기 컴퓨팅장치가 접속된 서버 시스템에 업로드된 학습데이터셋을 피처임베딩모델에 입력하여 상기 학습데이터셋에 포함되는 로우데이터 각각 에 대한 특징정보를 도출하는 특징정보도출단계; 로우데이터 각각의 특징정보를 3 이하의 차원으로 축소하는 차 원축소단계; 및 로우데이터 각각에 대하여 차원이 축소된 특징정보를 상기 3 이하의 차원의 공간상의 특정좌표 에 매핑하되, 해당 학습데이터에 해당하는 쿼리에 상응하는 제2그래픽엘리먼트로 상기 3 이하의 차원의 좌표를 가지는 공간상에 표시하는 데이터매핑단계;를 포함할 수 있다. 상기와 같은 과제를 해결하기 위하여, 본 발명의 일 실시예에서는, 1 이상의 프로세서 및 1 이상의 메모리를 포 함하여, 인공지능 학습데이터의 시각화방법을 수행하는 컴퓨팅장치로서, 1 이상의 속성정보에 대한 조건에 해당 하는 쿼리에 상응하는 제1그래픽엘리먼트, 및 해당 쿼리와 관련된 학습데이터의 디스플레이레이어 상에서의 표 시상태를 변경할 수 있는 인터페이스를 제공하는 스위칭인터페이스를 포함하는 쿼리목록레이어를 화면에 표시하는 쿼리목록표시부; 및 3 이하의 차원의 공간상에서 학습데이터 각각을 제2그래픽엘리먼트로 표시하는 디스플레 이레이어를 사용자단말의 화면에 표시하고, 상기 3 이하의 차원의 공간상에서 표시되는 상기 제2그래픽엘리먼트 의 좌표는 해당 로우데이터의 특징정보에 따라 결정되는 디스플레이표시부;를 포함하고, 각각의 학습데이터는 로우데이터(RAW DATA) 및 해당 로우데이터에 대한 1 이상의 속성정보를 포함하고, 사용자의 입력에 의하여 특정 쿼리가 활성화되었을 때, 상기 디스플레이레이어에서 표시되는 상기 제2그래픽엘리먼트의 시각적특성은 상기 특 정 쿼리에 대한 제1그래픽엘리먼트의 시각적특성에 상응하는, 컴퓨팅장치를 제공한다. 상기와 같은 과제를 해결하기 위하여, 본 발명의 일 실시예에서는, 1 이상의 프로세서 및 1 이상의 메모리를 포 함하는 컴퓨팅장치에서 수행되는 인공지능 학습데이터의 시각화방법을 구현하기 위한 컴퓨터-판독가능 매체로서, 상기 컴퓨터-판독가능 매체는, 상기 컴퓨팅장치로 하여금 이하의 단계들을 수행하도록 하는 컴퓨터 실행가능 명령어들을 포함하고, 상기 이하의 단계들은: 1 이상의 속성정보에 대한 조건에 해당하는 쿼리에 상응 하는 제1그래픽엘리먼트, 및 해당 쿼리와 관련된 학습데이터의 디스플레이레이어 상에서의 표시상태를 변경할 수 있는 인터페이스를 제공하는 스위칭인터페이스를 포함하는 쿼리목록레이어를 화면에 표시하는 쿼리목록표시 단계; 및 3 이하의 차원의 공간상에서 학습데이터 각각을 제2그래픽엘리먼트로 표시하는 디스플레이레이어를 사 용자단말의 화면에 표시하고, 상기 3 이하의 차원의 공간상에서 표시되는 상기 제2그래픽엘리먼트의 좌표는 해 당 로우데이터의 특징정보에 따라 결정되는 디스플레이표시단계;를 포함하고, 각각의 학습데이터는 로우데이터 (RAW DATA) 및 해당 로우데이터에 대한 1 이상의 속성정보를 포함하고, 사용자의 입력에 의하여 특정 쿼리가 활 성화되었을 때, 상기 디스플레이레이어에서 표시되는 상기 제2그래픽엘리먼트의 시각적특성은 상기 특정 쿼리에 대한 제1그래픽엘리먼트의 시각적특성에 상응하는, 컴퓨터-판독가능 매체를 제공한다."}
{"patent_id": "10-2023-0038404", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 학습데이터셋에 포함된 복수의 학습데이터 중 사용자가 원하는 속성정보에 해당 하는 학습데이터를 그래픽엘리먼트로 특정좌표에 매핑하여 화면에 표시함으로써, 사용자가 원하는 커버리지의 학습데이터들을 사용자에게 직관적으로 제공할 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 디스플레이레이어에 매핑되어 표시되는 1 이상의 서로 다른 종류의 그래픽엘리 먼트를 통해, 특정 학습모델의 학습에 사용된 데이터의 분포, 검증에 사용된 데이터의 분포, 및 테스트에 사용 된 데이터의 분포 각각을 직관적으로 파악할 수 있고, 이를 통해 각각의 데이터 간의 인과관계를 분석할 수 있 는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 사용자가 원하는 대로 쿼리에 해당하는 속성정보의 조건을 설정할 수 있어, 어 떤 속성정보를 가진 데이터가 학습모델의 성능을 떨어뜨리는지 용이하게 확인할 수 있고, 이를 통해 학습모델의 성능을 효율적으로 향상시킬 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 데이터 중심의 인공지능 기술에 사용되는 모델의 성능향상에 필요한 학습데이터 를 효율적으로 기획할 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 3 이하의 차원의 공간이 표시되는 디스플레이레이어에는 차원이 축소된 특징정 보를 기반으로 상기 공간 상에 매핑되는 그래픽엘리먼트가 표시되고, 사용자가 상기 공간 상에서 어느 하나의 그래픽엘리먼트를 선택하는 경우에, 해당 그래픽엘리먼트에 대한 학습데이터에 대한 정보가 화면에 표시되어, 디스플레이레이어 상에서 선택된 학습데이터를 사용자가 용이하게 확인할 수 있는 효과를 발휘할 수 있다."}
{"patent_id": "10-2023-0038404", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 다양한 실시예들 및/또는 양상들이 이제 도면들을 참조하여 개시된다. 하기 설명에서는 설명을 목 적으로, 하나 이상의 양상들의 전반적 이해를 돕기 위해 다수의 구체적인 세부사항들이 개시된다. 그러나, 이러 한 양상(들)은 이러한 구체적인 세부사항들 없이도 실행될 수 있다는 점 또한 본 발명의 기술 분야에서 통상의 지식을 가진 자에게 인식될 수 있을 것이다. 이후의 기재 및 첨부된 도면들은 하나 이상의 양상들의 특정한 예 시적인 양상들을 상세하게 기술한다. 하지만, 이러한 양상들은 예시적인 것이고 다양한 양상들의 원리들에서의 다양한 방법들 중 일부가 이용될 수 있으며, 기술되는 설명들은 그러한 양상들 및 그들의 균등물들을 모두 포함 하고자 하는 의도이다. 또한, 다양한 양상들 및 특징들이 다수의 디바이스들, 컴포넌트들 및/또는 모듈들 등을 포함할 수 있는 시스템 에 의하여 제시될 것이다. 다양한 시스템들이, 추가적인 장치들, 컴포넌트들 및/또는 모듈들 등을 포함할 수 있 다는 점 그리고/또는 도면들과 관련하여 논의된 장치들, 컴포넌트들, 모듈들 등 전부를 포함하지 않을 수도 있 다는 점 또한 이해되고 인식되어야 한다. 본 명세서에서 사용되는 \"실시예\", \"예\", \"양상\", \"예시\" 등은 기술되는 임의의 양상 또는 설계가 다른 양상 또 는 설계들보다 양호하다거나, 이점이 있는 것으로 해석되지 않을 수도 있다. 아래에서 사용되는 용어들 '~부', '컴포넌트', '모듈', '시스템', '인터페이스' 등은 일반적으로 컴퓨터 관련 엔티티(computer-related entity)를 의미하며, 예를 들어, 하드웨어, 하드웨어와 소프트웨어의 조합, 소프트웨어를 의미할 수 있다. 또한, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 해당 특징 및/또는 구성요소가 존재함을 의미하지만, 하나 이상의 다른 특징, 구성요소 및/또는 이들의 그룹의 존재 또는 추가를 배제하지 않는 것으로 이해되어야 한다. 또한, 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구 성요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구 별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요 소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다.또한, 본 발명의 실시예들에서, 별도로 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기 서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되 는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술 의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 실시예에서 명백하게 정 의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하에서 언급되는 “사용자단말”은 네트워크를 통해 서버나 타 단말에 접속할 수 있는 컴퓨터나 휴대용 단말 기로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱 (desktop), 랩톱(laptop) 등을 포함하고, 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신장 치로서, 스마트폰(Smart Phone), 태블릿 PC(Tablet PC), PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단 말 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 또한, \"네트워크\"는 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN) 또는 부가가치 통신망(Value Added Network; VAN) 등과 같은 유선네트워크나 이동 통신망(mobile radio communication network) 또는 위성 통신망 등과 같은 모든 종류의 무선 네트워크로 구현될 수 있다. 도 1은 본 발명의 일 실시예에 따른 인공지능 학습데이터의 시각화방법의 수행단계를 개략적으로 도시한다. 도 1에 도시된 바와 같이, 1 이상의 프로세서 및 1 이상의 메모리를 포함하는 컴퓨팅장치에서 수행되는 인공지 능 학습데이터의 시각화방법으로서, 1 이상의 속성정보에 대한 조건에 해당하는 쿼리에 상응하는 제1그래픽엘리 먼트(E11), 및 해당 쿼리와 관련된 학습데이터의 디스플레이레이어(L20) 상에서의 표시상태를 변경할 수 있는 인터페이스를 제공하는 스위칭인터페이스(E12)를 포함하는 쿼리목록레이어(L10)를 화면에 표시하는 쿼리목록표 시단계(S100); 및 3 이하의 차원의 공간상에서 학습데이터 각각을 제2그래픽엘리먼트(E21)로 표시하는 디스플레 이레이어(L20)를 화면에 표시하고, 상기 3 이하의 차원의 공간상에서 표시되는 상기 제2그래픽엘리먼트(E21)의 좌표는 해당 로우데이터의 특징정보에 따라 결정되는 디스플레이표시단계(S200);를 포함하고, 각각의 학습데이 터는 로우데이터(RAW DATA) 및 해당 로우데이터에 대한 1 이상의 속성정보를 포함하고, 사용자의 입력에 의하여 특정 쿼리가 활성화되었을 때, 상기 디스플레이레이어(L20)에서 표시되는 상기 제2그래픽엘리먼트(E21)의 시각 적특성은 상기 특정 쿼리에 대한 제1그래픽엘리먼트(E11)의 시각적특성에 상응한다. 구체적으로, 도 1에 도시된 바와 같이, 본 발명의 인공지능 학습데이터의 시각화방법은 1 이상의 프로세서 및 1 이상의 메모리를 포함하는 컴퓨팅장치에서 수행됨으로써, 사용자에게 복수의 학습데이터를 시각적으로 표시하는 서비스를 제공할 수 있다. 본 발명의 일 실시예에 따르면, 상기 컴퓨팅장치는 사용자단말을 포함하고, 상기 사용자단말은 자신의 화면을 통해 학습데이터를 시각적으로 표시하는 인터페이스를 표시하며, 사용자는 상기 사용자단말의 화면에 표시되는 인터페이스에 대한 선택입력을 수행함으로써 상기 인터페이스를 조작할 수 있고, 이를 통해 상기 사용자단말은 사용자가 원하는 조건에 해당하는 학습데이터를 상기 사용자단말의 화면에 표시함으로써, 사용자에게 복수의 학 습데이터의 특징정보에 따른 분포를 직관적이고 시각적으로 표시하는 서비스를 제공할 수 있다. 한편, 본 발명의 다른 실시예에 따르면, 상기 컴퓨팅장치는 서비스서버를 포함하고, 상기 서비스서버는 사용자 단말로 학습데이터를 시각적으로 표시하는 인터페이스를 제공하며, 사용자단말로부터 상기 인터페이스에 대한 선택입력을 수신하여, 상기 선택입력에 상응하는 상호작용, 인터페이스 및 서비스를 사용자단말로 송신할 수 있 고, 이를 통해 상기 사용자단말은 사용자가 원하는 조건에 해당하는 학습데이터를 상기 사용자단말의 화면에 표 시함으로써, 사용자에게 복수의 학습데이터의 특징정보에 따른 분포를 직관적이고 시각적으로 표시하는 서비스 를 제공할 수 있다. 상기 컴퓨팅장치의 쿼리목록표시부(미도시)는 쿼리목록레이어(L10)를 화면에 표시하는 쿼리목록표시단계(S100) 를 수행한다. 상기 쿼리목록레이어(L10)는, 사용자가 지정한 1 이상의 속성정보에 대한 조건에 해당하는 쿼리에 상응하는 제1그래픽엘리먼트(E11); 및 해당 쿼리와 관련된 학습데이터의 디스플레이레이어(L20) 상에서의 표시 상태를 변경할 수 있는 스위칭인터페이스(E12);를 포함한다. 상기 쿼리목록레이어(L10)에 대한 보다 구체적인 설명은, 도 2 내지 도 10에 대한 설명에서 후술하도록 한다. 사용자가 상기 쿼리목록레이어(L10)에 대한 입력 및 조작을 통하여 1 이상의 쿼리를 생성하는 경우, 상기 컴퓨 팅장치의 디스플레이표시부(미도시)는 3 이하의 차원의 공간상에서 학습데이터 각각을 제2그래픽엘리먼트(E21) 로 표시하는 디스플레이레이어(L20)를 화면에 표시하는 디스플레이표시단계(S200)를 수행한다. 상기 쿼리목록레이어(L10) 및 상기 디스플레이레이어(L20)는 서로 상호작용하는 것을 기술적특징으로 한다. 다 시 말해, 사용자가 쿼리목록레이어(L10)에 대하여 조작한 조작결과, 혹은 사용자가 상기 쿼리목록레이어(L10)에 서 입력한 입력조건에 따라, 상기 디스플레이레이어(L20)에 표시되는 그래픽엘리먼트의 분포가 변경되고, 이를 통해 사용자에게 사용자가 원하는 커버리지의 학습데이터들을 직관적으로 제공할 수 있는 효과를 발휘할 수 있 다. 또한, 사용자가 상기 쿼리목록레이어(L10)에 대하여 조작하거나 입력한 정보에 상응하는 그래픽엘리먼트가 상기 디스플레이레이어(L20) 상에서 즉각적으로 변화하기 때문에 보다 용이하게 사용자가 원하는 커버리지의 학 습데이터를 확인할 수 있는 효과를 발휘할 수 있다. 이하에서는, 상기 쿼리목록레이어(L10) 및 상기 디스플레이레이어(L20) 간의 유기적인 관계와 상호작용에 대하 여 상세히 서술하도록 한다. 도 2는 본 발명의 일 실시예에 따른 쿼리목록레이어(L10) 및 디스플레이레이어(L20)를 개략적으로 도시한다. 구체적으로, 쿼리목록표시단계(S100) 및 디스플레이표시단계(S200)를 통해 표시되는 쿼리목록레이어(L10) 및 디 스플레이레이어(L20)는, 도 2에 도시된 바와 같이, 화면에 동시에 표시되는 것이 바람직하며, 이를 통해 서로 유기적인 상호작용의 결과를 직관적으로 사용자에게 제공할 수 있는 효과를 발휘할 수 있다. 상기 쿼리목록레이 어(L10)는 1 이상의 쿼리정보레이어를 포함하고, 디스플레이레이어(L20)에는 업로드된 학습데이터가 특정좌표로 매핑된 복수의 제2그래픽엘리먼트(E21)가 표시된다. 한편, 상기 쿼리목록표시단계(S100) 및 상기 디스플레이표시단계(S200)는, 상기 컴퓨팅장치; 혹은 상기 컴퓨팅 장치가 접속된 서버시스템;에 포함되는 데이터베이스에 학습데이터셋이 업로드된 이후에 수행될 수 있다. 상기 학습데이터셋은 복수의 학습데이터를 포함하고, 복수의 학습데이터 각각은 로우데이터(RAW DATA) 및 해당 로우 데이터에 대한 1 이상의 속성정보를 포함한다. 상기 속성정보는, 본 발명의 일 실시예로서, 해당 로우데이터가 생성될 때 생성되는 생성정보를 포함한다. 예를 들어, 상기 생성정보는 해당 로우데이터의 이름, 생성날짜, 생 성위치, 및 데이터크기 등과 같이, 로우데이터 자체에 대한 표면적인 정보를 포함하며, 상기 생성정보는 시스템 에서 자동적으로 생성되는 것이 바람직하나, 본 발명의 다른 실시예에 따르면 사람이 직접 설정할 수 있다. 또한, 상기 속성정보는, 본 발명의 다른 실시예로서, 해당 로우데이터에 대한 분석결과에 기초하여 생성되는 분 석정보를 더 포함한다. 상기 분석결과를 생성하는 주체는 사람에 해당할 수도 있고, 기계학습모델에 해당할 수 있다. 본 발명의 일 실시예로서, 도 15를 참고하여, 해당 이미지에 포함되는 객체에 대하여 레이블링(labeling)할 수 있다. 더 구체적으로, 사람이 직접 로우데이터에 포함된 복수의 객체종류 각각의 영역을 레이블링하여 바운딩박 스(bounding box)를 설정할 수 있다. 상기 복수의 객체종류는 사람(pedestrian) 및 자동차(car) 등을 포함한다. 이와 같이, 사람이 직접 레이블링하는 경우에는, 크라우드소싱(crowd sourcing)을 사용하여 복수의 로우데이터 에 대해 레이블링할 수 있다. 한편, 본 발명의 다른 실시예로서, 기계학습모델이 로우데이터 각각을 분석하여, 로우데이터 각각에 포함된 복 수의 객체종류 각각의 영역을 레이블링하여 바운딩박스를 설정할 수 있으며, 본 발명의 또 다른 실시예로서, 동 일한 로우데이터에 대하여 사람도 해당 데이터에 대한 분석결과를 생성하고, 기계학습모델도 해당 데이터에 대 한 분석결과를 생성하여, 사람과 기계학습모델이 분석한 분석결과를 비교할 수 있도록 분석정보를 생성할 수 있 다.전술한 바와 같이, 해당 로우데이터에 대한 1 이상의 속성정보를 포함하는 복수의 학습데이터가 상기 데이터베 이스에 업로드된 후, 상기 컴퓨팅장치는 상기 데이터베이스에 업로드된 학습데이터셋을 기반으로 쿼리목록표시 단계(S100) 및 디스플레이표시단계(S200)를 수행한다. 한편, 상기 로우데이터는, 본 발명의 일 실시예로서, 이미지형태의 데이터에 해당할 수 있으나, 본 발명의 다른 실시예의 따르면, 다른 유형의 데이터, 예를 들어, 텍스트 혹은 오디오 형태의 데이터를 더 포함할 수 있다. 설 명의 편의를 위하여 이하에서는 이미지형태의 로우데이터를 기준으로 본 발명에 대한 설명을 서술하도록 한다. 도 3은 본 발명의 일 실시예에 따른 쿼리목록레이어(L10)에 포함되는 세부구성을 개략적으로 도시한다. 도 3에 도시된 바와 같이, 상기 쿼리목록레이어(L10)는, 사용자가 입력한 정보에 기초하여 생성되는 1 이상의 쿼리정보레이어를 포함하고, 상기 쿼리정보레이어는, 해당 쿼리에 상응하는 제1그래픽엘리먼트(E11); 해당 쿼리 의 이름 및 해당 쿼리에 해당하는 학습데이터의 수를 포함하는 쿼리정보를 표시하는 쿼리정보영역(A11); 상기 디스플레이레이어(L20)에 매핑되는 제2그래픽엘리먼트(E21)의 표시상태를 표시하되, 사용자의 입력을 통해 해당 제2그래픽엘리먼트(E21)의 표시상태가 변경될 수 있는 스위칭인터페이스(E12); 및 사용자의 입력에 따라 해당 쿼리에 해당하는 1 이상의 속성정보의 조건을 표시하는 속성정보레이어를 화면에 표시하거나, 혹은 화면에 표시 하지 않도록 하는 쿼리속성엘리먼트(E13);를 포함한다. 구체적으로, 사용자는 상기 쿼리목록레이어(L10) 상에서 표시되는 엘리먼트 혹은 인터페이스를 조작할 수 있고, 상기 컴퓨팅장치는 사용자가 조작한 것에 대한 결과로서 상기 디스플레이레이어(L20) 상의 그래픽엘리먼트의 표 시상태를 변화시킬 수 있다. 도 3은 화면에 표시되는 쿼리목록레이어(L10) 중 일부를 도시하며, 도 3에 도시된 쿼리목록레이어(L10)는 1 이 상의 쿼리정보레이어를 포함하고, 상기 1 이상의 쿼리정보레이어 각각은 제1그래픽엘리먼트(E11); 스위칭인터페 이스(E12); 쿼리속성엘리먼트(E13); 및 쿼리정보영역(A11);을 포함한다. 상기 1 이상의 쿼리정보레이어 각각은 사용자에 의해 설정된 단일의 쿼리에 대한 정보를 표시한다. 상기 제1그래픽엘리먼트(E11)는, 사용자에 의하여 시각적특성이 결정되고, 결정된 제1그래픽엘리먼트(E11)의 시 각적특성은 해당 쿼리에 상응하는 제2그래픽엘리먼트(E21)의 시각적특성과 상응한다. 상기 스위칭인터페이스(E12)는, 해당 쿼리와 관련된 학습데이터의 디스플레이레이어(L20) 상에서의 표시상태를 변경할 수 있는 인터페이스를 제공한다. 더 구체적으로, 상기 스위칭인터페이스(E12)는, 상기 디스플레이레이어 (L20)에 매핑되는 제2그래픽엘리먼트(E21)의 표시상태를 표시하되, 사용자의 입력을 통해 해당 제2그래픽엘리먼 트(E21)의 표시상태가 변경될 수 있는 것을 특징으로 한다. 본 발명의 일 실시예에 따르면, 상기 스위칭인터페 이스(E12)는 제1상태 및 제2상태 중 하나의 상태로 표시될 수 있다. 사용자는 상기 쿼리속성엘리먼트(E13)를 선택함으로써, 해당 쿼리에 대한 1 이상의 속성정보의 조건을 표시하는 속성정보레이어를 화면에 표시하거나, 혹은 화면에 표시하지 않도록 할 수 있다. 더 구체적으로, 디폴트 (default) 상태에서는, 도 2에 도시된 'val'쿼리정보레이어와 'train'쿼리정보레이어와 같이 해당 쿼리에 대한 속성정보레이어를 표시하지 않는다. 이와 같이 화면에 속성정보레이어가 표시되지 않는 상태에서, 사용자가 해 당 쿼리정보레이어의 쿼리속성엘리먼트(E13)를 선택하는 경우, 표시되지 않던 속성정보레이어가 디폴트상태의 해당 쿼리정보레이어에 시각적으로 합성되어 화면에 표시된다. 본 발명의 일 실시예로서, 도 3에 도시된 바와 같이 'test_query_1'쿼리정보레이어에는 'weather has snowy, and scene has highway, and time_of_day has daytime'이라는 해당 쿼리에 대한 속성정보의 조건이 속성정보레 이어에 표시된다. 한편, 'test_query_1'쿼리정보레이어 및 'test_query_2'쿼리정보레이어 각각의 속성정보레이어에 표시된 바와 같이, 사용자가 설정할 수 있는 쿼리에 대한 속성정보의 조건은 특정 클래스 혹은 특정 카테고리에 한정되지 않아 다양한 클래스 및 다양한 카테고리로 분류된 조건 중 1 이상에 해당할 수 있고, 이를 통해 사용자가 원하는 다양한 조건에 해당하는 쿼리를 생성할 수 있는 것을 특징으로 한다. 한편, 도 3에 도시된 바와 같이, 화면에 속성정보레이어가 표시되는 상태에서, 사용자가 다시 쿼리속성엘리먼트(E13)를 선택하는 경우, 표시되던 속성정 보레이어는 화면 상에서 보이지 않게 된다. 상기 쿼리정보영역(A11)은, 해당 쿼리에 대한 정보를 표시한다. 바람직하게는, 상기 쿼리정보영역(A11)에 표시 되는 쿼리에 대한 정보는, 해당 쿼리에 대한 이름 및 양적정보를 포함하는 것이 바람직하다. 해당 쿼리에 대한 이름(도 3에서는 test_query_1, test_query_2)은 사용자에 의해 설정될 수 있고, 해당 쿼리에 대한 양적정보는 해당 쿼리와 관련된 학습데이터의 수와 비율을 포함한다. 예를 들어, 사용자가 선택한 학습데이터셋에 포함되는 학습데이터의 수가 10,000개이고, 사용자가 설정한 쿼리와 관련된 학습데이터의 수가 1,500개인 경우, 해당 쿼 리에 대한 양적정보는, 해당 쿼리의 절대적인 양에 해당하는 1,500이라는 정보;와 사용자가 선택한 학습데이터 셋의 학습데이터수(=10,000) 대비 해당 쿼리와 관련된 학습데이터수(=1,500)의 비율에 해당하는 15%라는 정보; 를 모두 포함한다. 도 4는 본 발명의 일 실시예에 따른 쿼리목록레이어(L10)의 스위칭인터페이스(E12)가 제1상태로 표시될 때, 디 스플레이레이어(L20) 상에 표시되는 제2그래픽엘리먼트(E21)를 개략적으로 도시하고, 도 5는 본 발명의 일 실시 예에 따른 쿼리목록레이어(L10)의 스위칭인터페이스(E12)가 제2상태로 표시될 때, 디스플레이레이어(L20) 상에 표시되는 제2그래픽엘리먼트(E21)를 개략적으로 도시한다. 도 4 및 도 5에 도시된 바와 같이, 상기 스위칭인터페이스(E12)는, 해당 쿼리와 관련된 학습데이터에 상응하는 제2그래픽엘리먼트(E21)가 상기 디스플레이레이어(L20)에 표시되는 상태임을 표시하는 제1상태; 및 해당 쿼리와 관련된 학습데이터에 상응하는 제2그래픽엘리먼트(E21)가 상기 디스플레이레이어(L20)에 표시되지 않는 상태임 을 표시하는 제2상태; 중 하나의 상태로 표시되고, 상기 제1상태의 스위칭인터페이스와 상기 제2상태의 스위칭 인터페이스는, 상이한 시각적특성을 가지며 상기 스위칭인터페이스(E12)에 대한 사용자의 입력에 따라 서로 번 갈아가며 변경된다. 개략적으로, 도 4는 'test_query_1'쿼리정보레이어의 스위칭인터페이스(E12) 및 'test_query_2'쿼리정보레이어 의 스위칭인터페이스(E12) 모두가 제1상태로 표시될 때의 쿼리목록레이어(L10)와 디스플레이레이어(L20)를 도시 하고, 도 5는 'test_query_1'쿼리정보레이어의 스위칭인터페이스(E12)는 제2상태로 표시되고, 'test_query_2'쿼 리정보레이어의 스위칭인터페이스(E12)는 제1상태로 표시될 때의 쿼리목록레이어(L10)와 디스플레이레이어(L2 0)를 도시한다. 또한, 상기 제1상태의 스위칭인터페이스와 상기 제2상태의 스위칭인터페이스는 서로 상이한 시각적특성을 가지 고, 본 명세서에서는 원형의 그래픽이 우측에 있는 상태를 제1상태, 원형의 그래픽이 좌측에 있는 상태를 제2상 태로 정의한다. 한편, 이는 본 발명의 일 실시예일 뿐이고, 실제 발명에서는 다양한 방법으로 상기 제1상태의 스위칭인터페이스와 상기 제2상태의 스위칭인터페이스가 시각적으로 구분되도록 설계될 수 있다. 구체적으로, 스위칭인터페이스(E12)가 제1상태로 표시되면, 해당 쿼리와 관련된 학습데이터가 제2그래픽엘리먼 트(E21)로 디스플레이레이어(L20) 내의 3 이하의 차원의 공간상의 특정좌표에 매핑되어 표시된다. 도 4에서는 'test_query_1'쿼리정보레이어 및 'test_query_2'쿼리정보레이어의 스위칭인터페이스(E12)가 모두 제1상태로 표 시되어 있으므로, 이에 상응하여, 도 4의 디스플레이레이어(L20)에는 'test_query_1'쿼리에 상응하는 제2그래픽 엘리먼트(E21) 및 'test_query_2'쿼리에 상응하는 제2그래픽엘리먼트(E21)이 모두 동시에 표시되며, 각각의 쿼 리에 상응하는 제2그래픽엘리먼트(E21)는 상기 디스플레이레이어(L20) 상에서 서로 다른 시각적특성을 가진다. 한편, 도 5에서는 'test_query_1'쿼리정보레이어의 스위칭인터페이스(E12)는 제2상태로 표시되고, 'test_query_2'쿼리정보레이어의 스위칭인터페이스(E12)는 제1상태로 표시되어 있으므로, 이에 상응하여, 도 5 의 디스플레이레이어(L20)에는 'test_query_2'쿼리에 상응하는 제2그래픽엘리먼트(E21)만이 표시되고,'test_query_1'쿼리에 상응하는 학습데이터들을 히든엘리먼트(옅은 회색)로 표시된다. 히든엘리먼트는, 히든데이터가 디스플레이레이어(L20) 내에서 3 이하의 공간 상의 특정좌표에 매핑되어 표시되 는 그래픽엘리먼트를 의미하며, 상기 히든데이터는, 상기 3 이하의 공간 상에 특정좌표에 매핑되어있는 학습데 이터이지만, 제2상태로 표시되는 스위칭인터페이스(E12)의 쿼리정보레이어에 해당하는 학습데이터를 의미한다. 이와 같이, 사용자는 1 이상의 쿼리정보레이어 각각에 포함되는 스위칭인터페이스(E12) 각각에 대하여 독립적으 로 조작할 수 있고, 각각의 스위칭인터페이스(E12)에 대하여 사용자가 조작한 조작결과에 따라, 복수의 쿼리 각 각에 상응하고, 서로 다른 시각적특성을 가지는 복수의 제2그래픽엘리먼트(E21) 중 1 이상이 디스플레이레이어 (L20)에 동시에 표시되거나, 혹은 사용자가 원하는 쿼리에 상응하는 제2그래픽엘리먼트(E21)만 상기 디스플레이 레이어(L20)에 표시되도록 할 수 있다. 즉, 사용자는 1 이상의 각각의 스위칭인터페이스(E12)의 표시상태를 제1상태 및 제2상태 중 하나의 상태로 변경 시킬 수 있고, 컴퓨팅장치는 변경된 결과에 상응하는 제2그래픽엘리먼트(E21)의 표시상태를 디스플레이레이어 (L20)에 즉각적으로 반영할 수 있으며, 그 결과 사용자가 요구하는 커버리지의 학습데이터들을 쉽고 직관적으로 제공할 수 있는 효과를 발휘할 수 있다. 추가적으로, 본 발명의 일 실시예로서, 하나의 학습데이터가 복수의 쿼리에 해당할 수 있다. 예를 들어, 제1쿼 리에 대한 속성정보의 조건이 'weather has snowy'에 해당하고, 제1쿼리와 다른 제2쿼리에 대한 속성정보의 조 건이 'scene has highway'에 해당하는 경우, 눈과 고속도로를 모두 포함하는 학습데이터가 존재한다면, 기설정 된 규칙에 따라 해당 학습데이터는 해당 학습데이터에 상응하는 복수의 쿼리 중 하나가 선택되어, 선택된 쿼리 에 상응하는 제2그래픽엘리먼트(E21)로 표시될 수 있다. 즉, 해당 학습데이터는 상기 기설정된 규칙에 따라 선택된 제1쿼리에 상응하는 제2그래픽엘리먼트(E21)로 디스 플레이레이어(L20) 상에 표시될 수 있으며, 이후 상기 제1쿼리의 스위칭인터페이스(E12)가 제2상태로 변경되는 경우, 해당 학습데이터는 제2쿼리에 상응하는 제2그래픽엘리먼트(E21)로 디스플레이레이어(L20) 상에 표시될 수 있다. 도 6은 본 발명의 일 실시예에 따른 서로 다른 쿼리에 상응하는 제2그래픽엘리먼트(E21)가 표시되는 분포를 통 해 데이터를 분석하는 과정을 개략적으로 도시한다. 구체적으로, 도 6는 본 발명의 일 실시예로서 화면에 표시되는 쿼리목록레이어(L10)의 일부 및 디스플레이레이 어(L20)의 일부를 개략적으로 도시한다. 도 6에서 원형의 시각적특성을 가지는 제1그래픽엘리먼트(E11)와 제2그 래픽엘리먼트(E21)는 특정 학습모델에 학습(train)에 사용되는 데이터에 상응하고, 삼각형의 시각적특성을 가지 는 제1그래픽엘리먼트(E11)과 제2그래픽엘리먼트(E21)는 특정 학습모델의 검증(validation)에 사용되는 데이터 에 상응한다. 상기 디스플레이레이어(L20)에 매핑되는 복수의 학습데이터 각각은 해당 로우데이터 각각의 특징정보에 기초하 여 매핑되기 때문에, 특정 지점을 기준으로 군집을 형성하고 있는 제2그래픽엘리먼트(E21)들은 유사한 특징정보 를 가진 학습데이터가 매핑된 것으로 유추할 수 있다. 즉, 도 6의 디스플레이레이어(L20)를 통해, 사용자는 어 떤 특징정보를 가지는 데이터가 학습에 사용되었고, 어떤 특징정보를 가지는 데이터가 검증에 사용되었는지 직 관적으로 파악할 수 있다. 더 구체적으로, 도 6에서 점선 박스가 도시된 영역은 학습데이터셋이 매핑된 디스플레이레이어(L20)에서 검증에 사용된 학습데이터가 비교적 적게 분포된 군집을 도시한다. 이에 대하여, 사용자는 해당 군집에 포함되는 데이 터들이 학습모델의 학습에는 사용되었지만, 상기 학습모델을 테스트했을 때, 해당 군집에 포함되는 데이터들에 대해서는 검증이 덜 되었다고 판단할 수 있다. 즉, 사용자는 공간 상에 표시되는 제2그래픽엘리먼트(E21)의 분포만을 보고 해당 군집에 포함되거나, 혹은 해당 군집 인근의 학습데이터들에 대해 상기 학습모델이 운용되는 실제 서비스 내에서 정확도가 떨어지는 데이터, 혹 은 효용가치가 떨어지는 데이터에 해당하는 엣지케이스(edge case)로 판단할 수 있다. 다시 말해, 사용자는, 디스플레이레이어(L20)에 표시된 복수의 제2그래픽엘리먼트(E21)의 분포만을 보고 각 학 습데이터들의 인관관계를 파악하여 직관적으로 엣지케이스에 해당하는 데이터를 파악할 수 있고, 이에 대응하여 엣지케이스에 해당하는 데이터를 추가적으로 확보하거나, 이미 확보된 데이터를 다양한 방식으로 학습시킴으로 써 해당 학습모델의 성능을 향상시킬 수 있어, 학습모델 자체를 개선하는 것보다 효율적인 방식으로 학습모델의 성능을 향상시키는 효과를 발휘할 수 있다. 추가적으로, 본 발명의 일 실시예로서, 업로드된 학습데이터셋이 업데이트되어 디스플레이레이어(L20)에 매핑되 는 학습데이터의 수가 늘어난 경우, 추가된 학습데이터가 엣지케이스에 해당하는 종류의 학습데이터인지, 혹은 충분히 성능을 발휘하고 있는 종류의 학습데이터인지를 파악할 수 있고, 해당 학습모델이 얼마나 넓은 커버리지 를 가지고 있는지 사용자가 직관적으로 확인할 수 있는 효과를 발휘할 수 있다. 도 7은 본 발명의 일 실시예에 따른 히든엘리먼트가 표시되는 디스플레이레이어(L20)를 개략적으로 도시하고, 도 8은 본 발명의 일 실시예에 따른 히든엘리먼트가 표시되지 않는 디스플레이레이어(L20)를 개략적으로 도시한 다. 도 7 및 도 8에 도시된 바와 같이, 본 발명의 일 실시예에서는, 사용자의 입력에 의하여 상기 스위칭인터페이스 (E12)가 상기 제2상태로 표시되는 경우, 해당 쿼리에 해당하는 제2그래픽엘리먼트(E21)는, 사용자가 입력한 표 시조건에 따라, 기설정된 시각적특성을 가지는 히든엘리먼트로서 상기 디스플레이레이어(L20)에 표시될 수 있다. 한편, 본 발명의 다른 실시예에서는, 사용자의 선택에 의하여 상기 스위칭인터페이스(E12)가 상기 제2상태로 표 시되는 경우, 해당 쿼리에 해당하는 제2그래픽엘리먼트(E21)는, 사용자가 입력한 표시조건에 따라, 어떠한 시각 적형태로도 상기 디스플레이레이어에 표시되지 않을 수 있다. 구체적으로, 디스플레이레이어(L20)는 도 7 및 도 8에 도시된 바와 같이, 히든엘리먼트표시인터페이스(E22)를 포함한다. 상기 히든엘리먼트표시인터페이스(E22)는, 상기 디스플레이레이어(L20) 상에 표시되는 히든엘리먼트 의 표시상태를 변경할 수 있는 인터페이스를 제공한다. 더 구체적으로, 상기 히든엘리먼트표시인터페이스(E22) 는 기설정된 시각적특성을 가지며 히든데이터에 상응하는 그래픽엘리먼트가 상기 디스플레이레이어(L20)에 표시 되는 상태임을 표시하는 제1상태; 및 기설정된 시각적특성을 가지며 히든데이터에 상응하는 그래픽엘리먼트가 상기 디스플레이레이어(L20)에 표시되지 않는 상태임을 표시하는 제2상태; 중 하나의 상태로 표시된다. 본 발명 의 일 실시예로서, 상기 기설정된 시각적특성은 도 7 및 도 8에 도시된 바와 같이, 옅은 회색으로 표시될 수 있 다. 사용자는 히든엘리먼트표시인터페이스(E22)의 선택을 통하여, 디스플레이레이어(L20) 상에서 히든엘리먼트의 표 시상태를 변경할 수 있다. 도 7에 도시된 바와 같이, 히든엘리먼트표시인터페이스(E22)가 제1상태로 표시되는 경우, 상기 디스플레이레이어(L20)에서는 3 이하의 차원의 공간 상에서 특정좌표로 매핑된 히든엘리먼트를 표시 한다. 사용자가 제1상태로 표시되는 히든엘리먼트표시인터페이스(E22)를 선택하는 경우, 도 8에 도시된 바와 같이, 상 기 히든엘리먼트표시인터페이스(E22)는 제2상태로 변경되고, 그 결과, 상기 디스플레이레이어(L20)에서는 어떠 한 시각적형태로도 히든엘리먼트가 표시되지 않는다. 이후, 사용자가 제2상태로 표시되는 히든엘리먼트표시인터 페이스(E22)를 다시 선택하는 경우, 상기 히든엘리먼트표시인터페이스(E22)는 다시 제1상태로 표시된다. 한편, 도 7 및 도 8에 도시된 히든엘리먼트표시인터페이스(E22)의 제1상태 및 제2상태 각각의 시각적특성은, 도 5에 도시된 스위칭인터페이스(E12)의 제1상태 및 제2상태의 시각적특성과 동일하게 도시된다. 전술한 바와 같이, 사용자는 간단하고 직관적인 인터페이스의 조작을 통해, 디스플레이레이어(L20)에서 사용자 가 보고싶은 학습데이터의 분포와 히든데이터의 분포를 비교하여 볼 수 있는 효과를 발휘할 수 있다.한편, 도 7 및 도 8에 도시된 바와 같이, 상기 쿼리목록레이어(L10)는 상기 디스플레이선택인터페이스(E14)를 더 포함한다. 상기 디스플레이선택인터페이스(E14)는 1 이상의 디스플레이를 선택할 수 있는 인터페이스에 해당 하며, 상기 1 이상의 디스플레이 각각은 상이한 쿼리정보레이어를 표시하도록 설정할 수 있다. 다시 말해, 디스 플레이는 해당 디스플레이레이어(L20)에서 표시되는 1 이상의 쿼리의 집합에 해당한다. 예를 들어, 사용자가 학습데이터셋을 장면(scene)에 따른 쿼리로 분류하고 싶은 경우, 'Scene'디스플레이를 생 성하여, 해당 디스플레이에 장면에 따른 복수의 쿼리를 생성할 수 있고, 사용자가 학습데이터셋을 날씨 (weather)에 따른 쿼리로 분류하고 싶은 경우, 'Weather'디스플레이를 생성하여, 해당 디스플레이에 장면에 따 른 복수의 쿼리를 생성할 수 있다. 바람직한 예로서, 사용자는'Weather'디스플레이의 제1쿼리를 'rainy'쿼리로, 제2쿼리를 'foggy'쿼리로, 제3쿼리를 'partly cloudy'쿼리로, 제4쿼리를 'snowy'쿼리로, 제5쿼리를 'overcas t'쿼리로, 제6쿼리를 'clear'쿼리로 설정할 수 있다. 한편, 전술한 바와 같이 하나의 속성정보를 기준으로 나눈 쿼리를 표시하는 디스플레이로서 디스플레이를 설정 할 수 있으나, 본 발명의 다른 실시예에 따르면, 도 4에 도시된 바와 같이, 사용자가 원하는 조건의 속성정보를 가지는 1 이상의 쿼리만을 별도의 디스플레이로서 설정할 수 있다. 이와 같이, 본 발명은 각각 상이한 쿼리를 표시하는 복수 개의 디스플레이를 설정함으로써, 사용자가 용이하게 자신이 원하는 학습데이터 시나리오를 기획 하거나 수정할 수 있는 효과를 발휘할 수 있다. 도 9 및 도 10는 본 발명의 일 실시예에 따른 쿼리생성레이어(L11)를 통해 쿼리를 생성하는 과정을 개략적으로 도시한다. 도 9 및 도 10에 도시된 바와 같이, 상기 쿼리목록표시단계(S100)는, 사용자에 의하여, 사용자가 시각화하고 싶 은 학습데이터의 조건에 해당하는 1 이상의 속성정보를 입력받는 단계; 및 사용자에 의하여, 상기 시각화하고 싶은 학습데이터에 상응하는 제1그래픽엘리먼트(E11)의 시각적특성정보를 입력받는 단계;를 포함하는 쿼리생성 단계를 포함한다. 구체적으로, 사용자는 도 9 및 도 10에 도시된 쿼리생성레이어(L11)를 통해, 사용자가 시각화하고 싶은 학습데 이터의 조건에 해당하는 1 이상의 속성정보를 입력할 수 있고, 이에 대한 결과로서, 쿼리를 생성할 수 있다. 상 기 쿼리생성레이어(L11)는, 쿼리정보입력인터페이스(E15); 제1속성정보선택인터페이스(E16); 제2속성정보선택인 터페이스(E17); 및 조건연산자선택인터페이스(E18);를 포함한다. 상기 쿼리정보입력인터페이스(E15)는, 도 3에 대한 설명을 참고하여, 쿼리의 이름과 해당 쿼리에 상응하는 제1 그래픽엘리먼트(E11)의 시각적특성을 설정할 수 있는 인터페이스를 제공한다. 사용자는 해당 디스플레이에서 표 시되길 원하는 수만큼의 쿼리정보입력인터페이스(E15)를 생성할 수 있으며, 이미 1 이상의 쿼리가 생성된 디스 플레이에 대해서도 상기 쿼리정보입력인터페이스(E15)를 추가로 생성함으로써 별도로 사용자가 원하는 조건의 속성정보를 가지는 쿼리를 추가할 수 있다. 상기 제1속성정보선택인터페이스(E16) 및 상기 제2속성정보선택인터페이스(E17)는 기분류된 속성정보를 선택할 수 있는 인터페이스를 제공한다. 상기 기분류된 속성정보는 도 2에 대한 설명을 참고하여, 학습데이터셋 전체에 포함되는 생성정보 및 분석정보에 기초하여 상기 제1속성정보선택인터페이스(E16) 및 상기 제2속성정보선택인터 페이스(E17)에 표시된다. 본 발명의 일 실시예로서, 도 9에 도시된 바와 같이 상기 제1속성정보선택인터페이스 (E16)에 표시되는 속성정보는 상기 제2속성정보선택인터페이스(E17)에 표시되는 속성정보보다 상위 개념에 해당 한다. 예를 들어, 도 9에 도시된 바와 같이, 사용자가 상기 제1속성정보선택인터페이스(E16)에 'Scene'항목을 선택하 는 경우, 상기 제2속성정보선택인터페이스(E17)에서는 상기 제1속성정보선택인터페이스(E16)에서 선택된 속성정 보인 'Scene'항목에 상응하여, 도시장면과 관련된 이미지가 담긴 데이터에 해당하는 'city street'속성정보; 및 고속도로장면과 관련된 이미지를 포함하는 데이터에 해당하는 'highway'속성정보; 등과 같은 1 이상의 속성정보 를 선택할 수 있다.한편, 본 발명의 다른 실시예에 따르면, 사용자가 상기 제1속성정보선택인터페이스(E16)에서 'bus_AP'항목을 선 택하는 경우, 상기 제2속성정보선택인터페이스(E17)에서는 특정 숫자와 조건연산자를 입력하여 '= 0.5'와 같이 상기 제1속성정보선택인터페이스(E16)에서 선택된 속성정보의 조건을 선택하거나 입력할 수 있다. 이와 같이 사 용자가 속성정보의 조건을 입력하는 경우, 해당 입력 결과로 생성되는 쿼리와 관련된 학습데이터는 'bus_AP'라 는 속성정보가 0.5의 값을 가지는 학습데이터에 해당한다. 또한, 사용자가 쿼리를 생성하기 위해 속성정보의 조건을 선택입력하는데 있어서, 도 10에 도시된 바와 같이, 조건연산자선택인터페이스(E18)를 통해 복수의 속성정보에 대한 조건에 해당하는 쿼리를 생성할 수 있다. 상기 조건연산자선택인터페이스(E18)는 사용자가 생성하려는 쿼리에 대하여 2 이상 속성정보의 조건을 입력하는 경우, 입력하고 싶은 복수의 속성정보의 조건 각각에 대하여 'and' 또는 'or' 중 하나를 선택할 수 있는 인터페 이스를 제공한다. 즉, 사용자는 자신이 원하는 학습데이터의 종류를 상기 조건연산자선택인터페이스(E18)를 통하여 복수의 속성정 보의 조건들을 and/or로 연결함으로써 자신이 원하는 학습데이터에 해당하는 쿼리를 선택할 수 있고, 이를 통해, 사용자는 다양한 조건에 상응하는 학습데이터에 대한 쿼리를 생성할 수 있다. 도 11은 본 발명의 일 실시예에 따른 쿼리목록레이어(L10), 디스플레이레이어(L20), 및 로우데이터레이어(L30) 를 개략적으로 도시하고, 도 12는 본 발명의 일 실시예에 따른 로우데이터레이어(L30)에 포함되는 세부구성을 개략적으로 도시한다. 도 11 내지 도 12에 도시된 바와 같이, 상기 인공지능 학습데이터의 시각화방법은, 상기 디스플레이레이어(L2 0)에 매핑된 학습데이터의 견본이미지를 표시하는 로우데이터레이어(L30)를 화면에 표시하는 로우데이터표시단 계;를 더 포함하고, 상기 로우데이터레이어(L30)는, 사용자가 상기 디스플레이레이어(L20) 상에서 선택한 1 이 상의 제2그래픽엘리먼트(E21)에 해당하는 학습데이터의 견본이미지를 표시하는 이미지목록레이어(L31); 및 상기 이미지목록레이어(L31)에서, 히든데이터에 해당하는 견본이미지의 표시상태를 표시하는 히든데이터표시인터페이 스(E31);를 포함한다. 또한, 상기 로우데이터표시단계는, 사용자가 상기 디스플레이레이어(L20) 상에서 선택한 1 이상의 제2그래픽엘 리먼트(E21)에 해당하는 학습데이터의 견본이미지를 상기 이미지목록레이어(L31)에 표시하되, 사용자가 입력한 표시조건에 따라, 상기 사용자에 의해 선택되지 않은 제2그래픽엘리먼트(E21)에 해당하는 학습데이터의 견본이 미지를 더 표시할 수 있다. 구체적으로, 본 발명의 컴퓨팅장치는 상기 쿼리목록표시단계(S100) 및 상기 디스플레이표시단계(S200)에 덧붙여 로우데이터표시단계를 수행할 수 있고, 상기 로우데이터표시단계를 통해 로우데이터레이어(L30)를 화면에 표시 할 수 있다. 도 11에 도시된 바와 같이, 상기 로우데이터레이어(L30)는 쿼리목록레이어(L10) 및 디스플레이레이 어(L20)와 동시에 표시되는 것이 바람직하다. 상기 로우데이터레이어(L30)에는 복수의 견본이미지가 표시되는 이미지목록레이어(L31)를 표시하며, 상기 이미지목록레이어(L31)에 표시되는 견본이미지는 상기 디스플레이레이 어(L20)에서 선택된 제2그래픽엘리먼트(E21)에 상응하는 로우데이터의 견본이미지에 해당하는 것이 바람직하나, 사용자가 선택한 입력조건에 따라, 사용자가 상기 디스플레이레이어(L20)에서 선택하지 않은 제2그래픽엘러먼트 에 상응하는 로우데이터의 견본이미지가 표시될 수 있다. 즉, 상기 로우데이터레이어(L30)도 상기 쿼리목록레이 어(L10)와 마찬가지로, 상기 디스플레이레이어(L20)와 유기적으로 상호작용하는 특징을 가지며, 이를 통해 사용 자가 디스플레이레이어(L20) 상에서 선택한 학습데이터를 용이하게 확인할 수 있는 효과를 발휘할 수 있다. 도 12에 도시된 바와 같이, 로우데이터레이어(L30)는, 이미지목록레이어(L31); 히든데이터표시인터페이스(E31); 및 선택데이터표시인터페이스(E32);를 포함한다. 상기 이미지목록레이어(L31)는 전술한 바와 같이 사용자가 상 기 디스플레이레이어(L20) 상에서 선택한 1 이상의 제2그래픽엘리먼트(E21)에 해당하는 학습데이터에 포함되는 로우데이터의 견본이미지를 표시한다. 즉, 사용자는 디스플레이레이어(L20) 상에 표시되는 1 이상의 제2그래픽엘리먼트(E21)를 선택할 수 있고, 사용 자가 1 이상의 제2그래픽엘리먼트(E21)를 선택하는 경우, 도 13 및 도 14에 도시된 바와 같이, 선택된 제2그래픽엘리먼트(E21)에 해당하는 로우데이터의 견본이미지가 상기 이미지목록레이어(L31)에 표시된다. 한편, 상기 히든데이터표시인터페이스(E31); 및 상기 선택데이터표시인터페이스(E32);의 표시상태에 따라 상기 로우데이터레이어(L30)에 표시되는 견본이미지가 달라질 수 있다. 더 구체적으로, 히든데이터표시인터페이스 (E31)는, 사용자가 디스플레이레이어(L20)에서 선택한 제2그래픽엘리먼트(E21) 중 히든데이터에 해당하는 제2그 래픽엘리먼트(E21)의 상응하는 로우데이터의 견본이미지에 대하여 이미지목록레이어(L31) 상에서의 표시상태를 변경할 수 있는 인터페이스를 제공한다. 즉, 상기 히든데이터표시인터페이스(E31)의 표시상태가 제1상태로 표시되는 경우, 사용자가 디스플레이레이어 (L20)에서 선택한 제2그래픽엘리먼트(E21) 중 히든데이터에 해당하는 제2그래픽엘리먼트(E21)의 상응하는 로우 데이터의 견본이미지가 상기 이미지목록레이어(L31)에 표시된다. 또한, 상기 히든데이터표시인터페이스(E31)의 표시상태가 제2상태로 표시되는 경우, 사용자가 디스플레이레이어 (L20)에서 선택한 제2그래픽엘리먼트(E21) 중 히든데이터에 해당하는 제2그래픽엘리먼트(E21)의 상응하는 로우 데이터의 견본이미지는 상기 이미지목록레이어(L31)에 표시되지 않는다. 따라서, 상기 히든데이터표시인터페이스(E31)의 표시상태는 사용자의 입력에 따라 변경될 수 있으며, 전술한 스 위칭인터페이스(E12)와 같이, 사용자의 입력에 따라 상기 제1상태와 상기 제2상태로 번갈아가며 변경될 수 있다. 상기 선택데이터표시인터페이스(E32)는 사용자가 디스플레이레이어(L20)에서 선택한 제2그래픽엘리먼트(E21)에 상응하는 로우데이터의 견본이미지만을 이미지목록레이어(L31)에 표시할지를 선택할 수 있는 인터페이스를 제공 한다. 즉, 상기 선택데이터표시인터페이스(E32)의 표시상태가 제1상태로 표시되는 경우, 사용자가 디스플레이레 이어(L20)에서 선택한 제2그래픽엘리먼트(E21)에 상응하는 로우데이터의 견본이미지만을 이미지목록레이어(L3 1)에 표시하고, 상기 선택데이터표시인터페이스(E32)의 표시상태가 제2상태로 표시되는 경우, 사용자가 디스플 레이레이어(L20)에서 선택하지 않은 제2그래픽엘리먼트(E21)에 상응하는 로우데이터의 견본이미지를, 선택된 제 2그래픽엘리먼트(E21)에 상응하는 로우데이터의 견본이미지와 함께 상기 이미지목록레이어(L31)에 표시한다. 전술한 바와 같이, 사용자는 히든데이터표시인터페이스(E31)와 선택데이터표시인터페이스(E32)를 독립적으로 조 작함으로써, 사용자가 디스플레이레이어(L20)에서 선택한 제2그래픽엘리먼트(E21)에 상응하는 데이터를 선택하 지 않은 데이터와 용이하게 비교할 수 있는 효과를 발휘할 수 있으며, 이를 통해 사용자가 원하는 커버리지에 해당하는 학습데이터를 용이하게 도출할 수 있는 효과를 발휘할 수 있다. 도 13는 본 발명의 일 실시예 따른 사용자가 하나의 제2그래픽엘리먼트(E21)를 선택하는 경우의 이미지목록레이 어(L31) 및 제1상세정보레이어(L32)를 개략적으로 도시하며, 도 14는 본 발명의 일 실시예 따른 사용자가 복수 의 제2그래픽엘리먼트(E21)를 선택하는 경우의 이미지목록레이어(L31)를 개략적으로 도시한다. 도 13에 도시된 바와 같이, 상기 로우데이터표시단계는, 사용자가 상기 이미지목록레이어(L31)의 표시되는 견본 이미지를 선택하는 경우, 선택된 견본이미지에 해당하는 학습데이터에 대한 제1상세정보를 표시하는 제1상세정 보레이어(L32)를 팝업형식으로 화면에 표시하는 단계; 및 사용자가 상기 제1상세정보레이어(L32)에 포함되는 확 장엘리먼트(E33)를 선택하는 경우, 해당 학습데이터에 대한 제2상세정보를 표시하는 제2상세정보레이어(L33)를 팝업형식으로 화면에 표시하는 단계;를 포함하고, 상기 제1상세정보레이어(L32) 및 제2상세정보레이어(L33)는, 해당 학습데이터의 로우데이터; 및 해당 로우데이터의 속성정보;를 표시한다. 개략적으로, 도 13 및 도 14에 도시된 바와 같이, 사용자는 디스플레이레이어(L20) 상에서 1 이상의 제2그래픽 엘리먼트(E21)를 선택할 수 있다. 구체적으로, 도 13은 사용자가 디스플레이레이어(L20) 상에서 하나의 제2그래픽엘리먼트(E21)를 선택하는 경우 의 이미지목록레이어(L31)를 도시하며, 이 때 해당 히든데이터표시인터페이스(E31)는 제2상태로 표시되고, 해당 선택데이터표시인터페이스(E32)는 제1상태로 표시되어, 사용자가 선택한 제2그래픽엘리먼트(E21)에 상응하는 로 우데이터의 견본이미지만 상기 이미지목록레이어(L31)에 표시된다. 한편, 도 13 및 도 14에 도시된 히든데이터표시인터페이스(E31)와 선택데이터표시인터페이스(E32)의 제1상태 및 제2상태 각각의 시각적특성은, 도 5에 도시된 스위칭인터페이스(E12)의 제1상태 및 제2상태의 시각적특성과 동 일하게 도시된다. 도 13에 도시된 디스플레이레이어(L20)와 같이, 사용자가 선택한 제2그래픽엘리먼트(E21)는 별도의 그래픽엘리 먼트로(도 13에서는 별 표시)표시되고, 해당 엘리먼트에 상응하는 로우데이터의 견본이미지가 도 13의 우측에 도시된 이미지목록레이어(L31)에 도시된다. 사용자가 상기 이미지목록레이어(L31)에 표시된 견본이미지를 선택 하면, 해당 학습데이터에 대한 상세정보를 표시하는 제1상세정보레이어(L32)가 화면에 팝업형식으로 표시된다. 더 구체적으로, 상기 제1상세정보레이어(L32)는 제1로우데이터표시영역(A31); 제1속성정보표시영역(A32); 및 확 장엘리먼트(E33)를 포함한다. 상기 제1로우데이터표시영역(A31)은 해당 로우데이터를 표시하고, 상기 제1속성정 보표시영역(A32)은 해당 로우데이터에 포함되는 1 이상의 속성정보를 표시한다. 상기 제1속성정보표시영역(A32)에는, 도 9 내지 도 10에 대한 설명을 참고하여, 제1속성정보선택인터페이스 (E16)에서 표시되는 속성정보; 및 제2속성정보선택인터페이스(E17)에서 표시되는 속성정보;를 모두 표시할 수 있다. 또한, 사용자는 상기 제1상세정보레이어(L32)에 포함되는 확장엘리먼트(E33)를 통해 제2상세정보레이어(L33)를 화면에 표시하게 할 수 있다. 상기 제2상세정보레이어(L33)에 대한 설명은 도 15 내지 도 16에 대한 설명에서 후술하도록 한다. 한편, 도 14에 도시된 바와 같이, 사용자는 상기 디스플레이레이어(L20) 상에서 드래그입력을 통해 특정 영역에 포함되는 복수의 제2그래픽엘리먼트(E21)를 선택할 수 있다. 이와 같이, 드래그입력을 통해 특정 영역을 선택하 면, 해당 영역 안에서 활성화된 쿼리에 상응하는 복수의 제2그래픽엘리먼트(E21)에 상응하는 복수의 로우데이터 의 견본이미지가 이미지목록레이어(L31)에 표시된다. 이 때, 상기 활성화된 쿼리란, 도 4를 참고하여, 스위칭인 터페이스(E12)가 제1상태로 표시된 쿼리정보레이어에 해당하는 쿼리를 의미한다. 추가적으로, 본 발명의 일 실 시예에 따르면, 사용자는 상기 디스플레이레이어(L20) 상에서 드래그입력을 통해 복수의 특정 영역을 설정하여, 복수의 특정 영역에 포함되는 복수의 제2그래픽엘리먼트(E21)를 선택할 수 있다. 전술한 바와 같이, 사용자는, 도 6에 대한 설명을 참고하여, 도 14에 도시된 바와 같이 드래그입력을 통해, 상 기 디스플레이레이어(L20) 상에서 특정 쿼리의 데이터가 부족하거나, 적은 비율을 가지는 영역에 포함되는 복수 의 학습데이터를 선택할 수 있고, 선택된 학습데이터의 견본이미지가 상기 이미지목록레이어(L31)에 표시되기 때문에, 사용자가 쉽고 직관적으로 선택된 학습데이터를 확인할 수 있는 효과를 발휘할 수 있다. 도 15 및 도 16은 본 발명의 일 실시예 따른 제2상세정보레이어(L33)에 포함되는 세부구성을 개략적으로 도시한 다. 구체적으로, 도 13을 참고하여, 사용자가 제1상세정보레이어(L32)의 확장엘리먼트(E33)를 선택하는 경우, 도 15 및 도 16에 도시된 제2상세정보레이어(L33)가 화면에 표시된다. 상기 제2상세정보레이어(L33)는 해당 학습데이 터에 대하여 제1상세정보레이어(L32)에 비해 더 상세한 정보를 표시한다. 더 구체적으로, 상기 제2상세정보레이어(L33)는 제2로우데이터표시영역(A33); 제2특성정보표시영역(A34); 및 바 운딩박스설정인터페이스(A35);를 포함한다. 상기 제2로우데이터표시영역(A33)은 상기 제1로우데이터표시영역 (A31)에서 표시되는 로우데이터보다 상세한 로우데이터를 표시할 수 있다. 예를 들어, 도 15의 제2로우데이터표 시영역(A33)에 표시된 이미지형태의 로우데이터는 도 13에 도시된 제1로우데이터표시영역(A31)에 표시된 이미지 형태의 로우데이터에 비해 크고 구체적인 이미지를 표시한다. 또한, 사용자는 상기 제2상세정보레이어(L33)의 제2속성정보표시영역(A34)을 통해 해당 로우데이터의 속성정보를 확인할 수 있다. 바람직하게는, 상기 제2속성 정보표시영역(A34)에 표시되는 속성정보는 상기 제1속성정보표시영역(A32)에 표시되는 속성정보보다 상세하거나 구체적인 정보를 표시할 수 있다. 또한, 도 16에 도시된 바와 같이, 상기 제2상세정보레이어(L33)는 제2로우데이터표시영역(A33)에 도시된 바운딩 박스의 설정을 변경할 수 있는 인터페이스를 제공하는 바운딩박스설정인터페이스(A35)를 포함한다. 도 13, 도 15, 및 도 16에 도시된 바와 같이, 제1로우데이터표시영역(A31) 및 제2로우데이터표시영역(A33)에 표시되는 로 우데이터에는 바운딩박스가 합성되어 표시될 수 있다. 도 2에 대한 설명에서 전술한 바와 같이, 속성정보는 해당 로우데이터에 대한 분석결과에 기초하여 생성되는 분 석정보를 포함하고, 본 발명의 일 실시예로서, 바운딩박스의 설정정보가 상기 분석정보에 포함될 수 있다. 도 16에 도시된 상기 바운딩박스설정인터페이스(A35)에서는 GT(Ground Truth)기반 바운딩박스에 대한 설정을 변경 할 수 있는 인터페이스; 및 Inference기반 바운딩박스에 대한 설정을 변경할 수 있는 인터페이스;를 포함한다. 사용자는 상기 바운딩박스설정인터페이스(A35)의 조작을 통해 GT기반 바운딩박스 및 Inference기반 바운딩박스 각각의 투명도 및 표시되는 형태를 변경(도 16에서는 점선박스와 실선박스)할 수 있다. 한편, 바운딩박스의 설정정보를 속성정보로 가지지 않는 로우데이터에 대해서는 전술한 바와 같은 바운딩박스설 정인터페이스(A35)가 화면에 표시되지 않을 수 있으며, 다른 실시예에 따르면, 상기 GT(Ground Truth)기반 바운 딩박스에 대한 설정을 변경할 수 있는 인터페이스; 및 상기 Inference기반 바운딩박스에 대한 설정을 변경할 수 있는 인터페이스; 중 하나의 인터페이스만이 화면에 표시될 수 있다. 도 17는 본 발명의 일 실시예 따른 디스플레이표시단계(S200)의 세부단계를 개략적으로 도시하고, 도 18은 본 발명의 일 실시예에 따른 피처임베딩모델로 사용되는 기계학습모델의 구성을 개략적으로 도시한다. 도 17 및 도 18에 도시된 바와 같이, 상기 디스플레이표시단계(S200)는, 상기 컴퓨팅장치 혹은 상기 컴퓨팅장치 가 접속된 서버시스템에 업로드된 학습데이터셋을 피처임베딩모델에 입력하여 상기 학습데이터셋에 포함되는 로 우데이터 각각에 대한 특징정보를 도출하는 특징정보도출단계(S210); 로우데이터 각각의 특징정보를 3 이하의 차원으로 축소하는 차원축소단계(S220); 및 로우데이터 각각에 대하여 차원이 축소된 특징정보를 상기 3 이하의 차원의 공간상의 특정좌표에 매핑하되, 해당 학습데이터에 해당하는 쿼리에 상응하는 제2그래픽엘리먼트(E21)로 상기 3 이하의 차원의 좌표를 가지는 공간상에 표시하는 데이터매핑단계(S230);를 포함한다. 구체적으로, 본 발명의 컴퓨팅장치는, 상기 컴퓨팅장치 혹은 상기 컴퓨팅장치가 접속된 서버시스템에 업로드된 학습데이터셋을 디스플레이레이어(L20) 내의 3 이하의 차원 상의 공간상의 특정좌표에 매핑하기 위하여 특징정 보도출단계(S210), 차원축소단계(S220), 및 데이터매핑단계(S230)를 수행한다. 더 구체적으로, 상기 특징정보도출단계(S210)는, 업로드된 학습데이터셋에 포함되는 N(N은 자연수) 개의 학습데 이터들을 피처임베딩모델(Feature Embedding Model)에 입력하여 K(K는 자연수) 개의 차원을 갖는 특징정보를 도 출한다. 이 때, 상기 특징정보는 벡터형태에 해당하는 것이 바람직하다. 상기 피처임베딩모델은 어떠한 데이터 를 입력받고, 그 결과로 K 개의 차원을 갖는 특징정보를 도출하는 기계학습된 모델로서, 상기 특징정보는 K 개 의 성분을 가지며, 성분의 개수가 차원의 개수에 해당하는 것으로 이해될 수 있다. 상기 차원축소단계(S220)는 상기 K 개의 특징정보의 차원을 3 이하의 차원으로 축소한다. 이를 위하여, 상기 차 원축소단계(S220)는 종래의 벡터의 차원을 축소하기 위하여 사용하는 t-distributed Stochastic Neighbor Embedding(T-SNE), Principal Component Analysis(PCA) 등의 다양한 기법 가운데 어느 하나의 기법을 사용하여 복수의 학습데이터들 각각의 특징정보의 차원을 3 이하의 차원으로 축소한다. 상기 차원축소단계(S220)에서는 최대한 손실이 없도록 K 개의 차원을 갖는 특징정보의 차원을 3 이하의 차원으 로 축소하고, 이와 같이 차원이 축소된 특징정보는 디스플레이레이어(L20) 내에서 3 이하의 차원의 공간 상의 특정 위치에 데이터를 시각적으로 표시하기 위하여 사용될 수 있다. 상기 차원축소단계(S220) 이후, 상기 컴퓨 팅장치는 데이터매핑단계(S230)를 수행하고, 상기 데이터매핑단계(S230)는, 상술한 바와 같이 상기 차원축소단 계(S220)를 통해 차원이 축소된 N 개의 특징정보를 3 이하의 차원의 공간 상에 표시한다. 도 18에 도시된 바와 같이, 상기 기계학습모델은 전술한 상기 컴퓨팅장치 혹은 상기 컴퓨팅장치가 접속된 서버시스템에 포함되며, 상기 기계학습모델은 인코더 및 디코더를 포함할 수 있다. 상기 인코더는 상기 기계학습모델에 입력된 데이터를 취합, 압축하는 역할을 수행하고, 상기 디코더(120 0)는 상기 인코더에서 압축된 데이터를 풀어내는 역할을 수행하여 상기 디코더에서 도출된 데이터 가 상기 기계학습모델의 출력(도 18에서 결과값)에 해당할 수 있다. 예를 들어, 상기 기계학습모델에 강아지가 포함되어 있는 이미지가 입력되는 경우에, 상기 인코더 는 해당 이미지를 입력받아, 해당 이미지에 대한 정보를 벡터형태의 특징정보로 출력하고, 상기 디코더는 상기 인코더의 출력을 입력받아, 상기 특징정보에 포함되어 있는 값들에 기초하여 해당 이미지가 강아지 에 대한 이미지인지를 판단하는 정보(도 18에서 결과값)를 출력할 수 있다. 한편, 상기 기계학습모델은 학습데이터를 사용하여 입력되는 데이터에 대한 정보들을 대표할 수 있는 특 징정보를 인코더에서 출력할 수 있도록 학습될 수 있으며, 여기서 본 발명의 피처임베딩모델은 상기 학습 된 기계학습모델의 인코더에 해당할 수 있다. 도 19는 본 발명의 일 실시예에 따른 컴퓨팅장치의 내부 구성을 개략적으로 도시한다. 상술한 도 1에 대한 설명에서 서술된 컴퓨팅장치는 도 19에 도시된 컴퓨팅장치의 구성요소들을 포함할 수 있다. 도 19에 도시된 바와 같이, 컴퓨팅장치는 적어도 하나의 프로세서(processor), 메모리 (memory), 주변장치 인터페이스(peripheral interface), 입/출력 서브시스템(I/O subsystem), 전력 회로 및 통신 회로를 적어도 포함할 수 있다. 이때, 컴퓨팅장치 는 도 2에 도시된 서비스서버에 해당될 수 있다. 메모리는 일례로 고속 랜덤 액세스 메모리(high-speed random access memory), 자기 디스크, 에스램 (SRAM), 디램(DRAM), 롬(ROM), 플래시 메모리 또는 비휘발성 메모리를 포함할 수 있다. 메모리는 컴퓨팅 장치의 동작에 필요한 소프트웨어 모듈, 명령어 집합 또는 그 밖에 다양한 데이터를 포함할 수 있다. 이때, 프로세서나 주변장치 인터페이스 등의 다른 컴포넌트에서 메모리에 액세스하는 것 은 프로세서에 의해 제어될 수 있다. 주변장치 인터페이스는 컴퓨팅장치의 입력 및/또는 출력 주변장치를 프로세서 및 메모리 에 결합시킬 수 있다. 프로세서는 메모리에 저장된 소프트웨어 모듈 또는 명령어 집합을 실행하여 컴퓨팅장치를 위한 다양한 기능을 수행하고 데이터를 처리할 수 있다. 입/출력 서브시스템은 다양한 입/출력 주변장치들을 주변장치 인터페이스에 결합시킬 수 있다. 예를 들 어, 입/출력 서브시스템은 모니터나 키보드, 마우스, 프린터 또는 필요에 따라 터치스크린이나 센서 등의 주변 장치를 주변장치 인터페이스에 결합시키기 위한 컨트롤러를 포함할 수 있다. 다른 측면에 따르면, 입/출 력 주변장치들은 입/출력 서브시스템을 거치지 않고 주변장치 인터페이스에 결합될 수도 있다. 전력 회로는 단말기의 컴포넌트의 전부 또는 일부로 전력을 공급할 수 있다. 예를 들어 전력 회로 는 전력 관리 시스템, 배터리나 교류(AC) 등과 같은 하나 이상의 전원, 충전 시스템, 전력 실패 감지 회 로(power failure detection circuit), 전력 변환기나 인버터, 전력 상태 표시자 또는 전력 생성, 관리, 분배 를 위한 임의의 다른 컴포넌트들을 포함할 수 있다. 통신 회로는 적어도 하나의 외부 포트를 이용하여 다른 컴퓨팅장치와 통신을 가능하게 할 수 있다. 또는 상술한 바와 같이 필요에 따라 통신 회로는 RF 회로를 포함하여 전자기 신호(electromagnetic signal)라고도 알려진 RF 신호를 송수신함으로써, 다른 컴퓨팅장치와 통신을 가능하게 할 수도 있다. 이러한 도 19의 실시예는, 컴퓨팅장치의 일례일 뿐이고, 컴퓨팅장치는 도 19에 도시된 일부 컴포 넌트가 생략되거나, 도 19에 도시되지 않은 추가의 컴포넌트를 더 구비하거나, 2개 이상의 컴포넌트를 결합시키 는 구성 또는 배치를 가질 수 있다. 예를 들어, 모바일 환경의 통신 단말을 위한 컴퓨팅장치는 도 19에 도시된 컴포넌트들 외에도, 터치스크린이나 센서 등을 더 포함할 수도 있으며, 통신 회로에 다양한 통신방식 (WiFi, 3G, LTE, Bluetooth, NFC, Zigbee 등)의 RF 통신을 위한 회로가 포함될 수도 있다. 컴퓨팅장치 에 포함 가능한 컴포넌트들은 하나 이상의 신호 처리 또는 애플리케이션에 특화된 집적 회로를 포함하는 하드웨어, 소프트웨어, 또는 하드웨어 및 소프트웨어 양자의 조합으로 구현될 수 있다. 본 발명의 실시예에 따른 방법들은 다양한 컴퓨팅장치를 통하여 수행될 수 있는 프로그램 명령(instruction) 형 태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 특히, 본 실시예에 따른 프로그램은 PC 기반의 프로그 램 또는 모바일 단말 전용의 애플리케이션으로 구성될 수 있다. 본 발명이 적용되는 애플리케이션은 파일 배포 시스템이 제공하는 파일을 통해 컴퓨팅장치에 설치될 수 있다. 일 예로, 파일 배포 시스템은 컴퓨팅장치 의 요청에 따라 상기 파일을 전송하는 파일 전송부(미도시)를 포함할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어구 성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크 로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명 령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목 적컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이 상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2023-0038404", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상장 치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또 는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨팅장치 상에 분산되어서, 분산 된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다. 본 발명의 일 실시예에 따르면, 학습데이터셋에 포함된 복수의 학습데이터 중 사용자가 원하는 속성정보에 해당 하는 학습데이터를 그래픽엘리먼트로 특정좌표에 매핑하여 화면에 표시함으로써, 사용자가 원하는 커버리지의 학습데이터들을 사용자에게 직관적으로 제공할 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 디스플레이레이어에 매핑되어 표시되는 1 이상의 서로 다른 종류의 그래픽엘리 먼트를 통해, 특정 학습모델의 학습에 사용된 데이터의 분포, 검증에 사용된 데이터의 분포, 및 테스트에 사용 된 데이터의 분포 각각을 직관적으로 파악할 수 있고, 이를 통해 각각의 데이터 간의 인과관계를 분석할 수 있 는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 사용자가 원하는 대로 쿼리에 해당하는 속성정보의 조건을 설정할 수 있어, 어 떤 속성정보를 가진 데이터가 학습모델의 성능을 떨어뜨리는지 용이하게 확인할 수 있고, 이를 통해 학습모델의 성능을 효율적으로 향상시킬 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 데이터 중심의 인공지능 기술에 사용되는 모델의 성능향상에 필요한 학습데이터 를 효율적으로 기획할 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 3 이하의 차원의 공간이 표시되는 디스플레이레이어에는 차원이 축소된 특징정 보를 기반으로 상기 공간 상에 매핑되는 그래픽엘리먼트가 표시되고, 사용자가 상기 공간 상에서 어느 하나의 그래픽엘리먼트를 선택하는 경우에, 해당 그래픽엘리먼트에 대한 학습데이터에 대한 정보가 화면에 표시되어, 디스플레이레이어 상에서 선택된 학습데이터를 사용자가 용이하게 확인할 수 있는 효과를 발휘할 수 있다."}
{"patent_id": "10-2023-0038404", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2023-0038404", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 학습데이터의 시각화방법의 수행단계를 개략적으로 도시한다. 도 2는 본 발명의 일 실시예에 따른 쿼리목록레이어 및 디스플레이레이어를 개략적으로 도시한다. 도 3은 본 발명의 일 실시예에 따른 쿼리목록레이어에 포함되는 세부구성을 개략적으로 도시한다. 도 4는 본 발명의 일 실시예에 따른 쿼리목록레이어의 스위칭인터페이스가 제1상태로 표시될 때, 디스플레이레 이어 상에 표시되는 제2그래픽엘리먼트를 개략적으로 도시한다. 도 5는 본 발명의 일 실시예에 따른 쿼리목록레이어의 스위칭인터페이스가 제2상태로 표시될 때, 디스플레이레이어 상에 표시되는 제2그래픽엘리먼트를 개략적으로 도시한다. 도 6은 본 발명의 일 실시예에 따른 서로 다른 쿼리에 상응하는 제2그래픽엘리먼트가 표시되는 분포를 통해 데 이터를 분석하는 과정을 개략적으로 도시한다. 도 7은 본 발명의 일 실시예에 따른 히든엘리먼트가 표시되는 디스플레이레이어를 개략적으로 도시한다. 도 8은 본 발명의 일 실시예에 따른 히든엘리먼트가 표시되지 않는 디스플레이레이어를 개략적으로 도시한다. 도 9 및 도 10은 본 발명의 일 실시예에 따른 쿼리생성레이어를 통해 쿼리를 생성하는 과정을 개략적으로 도시 한다. 도 11은 본 발명의 일 실시예에 따른 쿼리목록레이어, 디스플레이레이어, 및 로우데이터레이어를 개략적으로 도 시한다. 도 12는 본 발명의 일 실시예에 따른 로우데이터레이어에 포함되는 세부구성을 개략적으로 도시한다. 도 13은 본 발명의 일 실시예 따른 사용자가 하나의 제2그래픽엘리먼트를 선택하는 경우의 이미지목록레이어 및 제1상세정보레이어를 개략적으로 도시한다. 도 14는 본 발명의 일 실시예 따른 사용자가 복수의 제2그래픽엘리먼트를 선택하는 경우의 이미지목록레이어를 개략적으로 도시한다. 도 15 및 도 16은 본 발명의 일 실시예 따른 제2상세정보레이어에 포함되는 세부구성을 개략적으로 도시한다. 도 17은 본 발명의 일 실시예 따른 디스플레이표시단계의 세부단계를 개략적으로 도시한다. 도 18은 본 발명의 일 실시예에 따른 피처임베딩모델로 사용되는 기계학습모델의 구성을 개략적으로 도시한다. 도 19는 본 발명의 일 실시예에 따른 컴퓨팅장치의 내부 구성을 개략적으로 도시한다."}
