{"patent_id": "10-2019-0146517", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0059278", "출원번호": "10-2019-0146517", "발명의 명칭": "디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템", "출원인": "디포커스", "발명자": "이현화"}}
{"patent_id": "10-2019-0146517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템에 있어서,복수의 데이터수집모듈들이 상호 직렬 또는 병렬로 연결되어 데이터를 수집하고 하나 이상의 데이터저장부로 전송하기 위한 데이터수집부; 및상기 수집된 데이터를 순환신경망(RNN) 알고리즘에 기초하여 학습된 결과에 따라 생성된 정제모듈을 이용하여정제하는 데이터정제부를 포함하는,데이터 통합수집시스템."}
{"patent_id": "10-2019-0146517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 데이터수집모듈은데이터 소스 또는 데이터수집모듈로부터 데이터가 입력되는 데이터리더모듈;데이터수집모듈 또는 데이터저장부로 데이터를 기록하기 위한 데이터라이터모듈; 및상기 데이터리더모듈과 상기 데이터라이터모듈 간의 데이터 전송을 위한 데이터파이프모듈을 포함하는,데이터 통합수집시스템."}
{"patent_id": "10-2019-0146517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 데이터수집모듈은 다수의 데이터서버들로부터 로그데이터를 수집하기 위한 플룸 기반의 제 1 데이터수집모듈인 것인,데이터 통합수집시스템."}
{"patent_id": "10-2019-0146517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 데이터수집모듈은 HDFS 및 RDBMS 간 데이터 전송을 위한 스쿱 기반의 제 2 데이터수집모듈인 것인,데이터 통합수집시스템."}
{"patent_id": "10-2019-0146517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 데이터수집모듈은 데이터 최적화를 위한 크롤링 기반의 제 3 데이터수집모듈인 것인,데이터 통합수집시스템."}
{"patent_id": "10-2019-0146517", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템은 복수의 데이터 수집모듈들이 상호 직렬 또는 병렬로 연결되어 데이터를 수집하고 하나 이상의 데이터저장부로 전송하기 위한 데 이터수집부 및 수집된 데이터를 순환신경망(RNN) 알고리즘에 기초하여 학습된 결과에 따라 생성된 정제모듈을 이 용하여 정제하는 데이터정제부를 포함할 수 있다."}
{"patent_id": "10-2019-0146517", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템에 관한 것이다. 보다 상세하게는 복수의 데이터수집모듈들이 상호 직렬 또는 병렬로 연결되어 데이터를 수집하고 하나 이상의 데이터저장부로 전 송하기 위한 데이터수집부 및 수집된 데이터를 RNN 기초 학습 결과에 따라 생성된 정제모듈을 이용하여 정제하 는 데이터정제부를 포함하는 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템에 관한 것이다."}
{"patent_id": "10-2019-0146517", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "빅데이터란, 기존의 기업 환경이나 공공 기관에서 사용되는 정형화된 데이터는 물론, 전자상거래 데이터, 메타 데이터, 웹로그, 무선식별(RFID) 데이터, 센서 네트워크 데이터, 소셜 네트워크 데이터, 소셜 데이터, 인터넷 텍스트와 문서, 인터넷 검색 인덱싱 등 기존에 미처 활용되지 못하던 비정형화 또는 반정형화된 데이터를 모두 포함하는 데이터로서, 이와 같은 데이터는 일반적으로 보통의 소프트웨어 툴 및 컴퓨터 시스템으로는 다루기 어 려운 수준의 데이터 양을 갖게 된다는 의미에서 빅데이터(Big Data)라 칭하고 있다. 빅데이터가 다양한 가치를 만들어내기 시작하면서, 사람들은 빅데이터를 원유에 비유하기 시작했다. 기름이 없으면 기기가 돌아가지 않듯 이, 빅데이터 없이 정보시대를 보낼 수 없다는 의미에서다. 미국의 시장조사기관 가트너는 데이터는 미래 경쟁 력을 좌우하는 21세기 원유라며 기업들은 다가오는 데이터 경제시대를 이해하고 이에 대비해야 한다라고 강조했 다. 21세기 기업에게 가장 중요한 자산은 데이터이며 이를 관리하고 여기서 가치를 이끌어내지 못하면 경쟁에서 살아남을 수 없다는 뜻이다. 최근 들어, 기업뿐만 아니라 정부에서도, 다양하게 수집된 빅데이터 정보 및 그를 활용한 통계 분석 데이터를 의사 결정과 정책 결정 등에 적극적으로 활용하고자하는 시도가 이어지고 있으며, 빅데이터를 활용하여 데이터 중심의 컴퓨팅 환경을 구축하기 위한 빅데이터 처리 기술이 활발하게 연구되고 있 다. 한편, 디지털 트윈(Digital Twin)은 컴퓨터에 현실 속 사물의 쌍둥이를 만들고, 현실에서 발생할 수 있는 상황 을 컴퓨터로 시뮬레이션 함으로써 사물의 동작 결과를 미리 예측하는 등의 사물에 대한 특성 및 정보를 얻기 위 한 기술을 말한다. 디지털 트윈 기술은 현실 자산의 각종 상태, 생산성, 동작 시나리오 등을 알 수 있으므로 여 러 산업들의 생산, 서비스 등 전반에 걸쳐 효율을 향상시킬 수 있으므로 최근 주목받고 있는 상황이다. 디지털 트윈은 복제품을 만든다는 점에서 디지털 목업(mockup)과 비슷하지만, 제품의 설계가 완성됨에 따라 생산 및 판 매가 이루어지는 시점에서 쓸모가 없어지는 목업과는 달리, 디지털 트윈은 제품이 완성된 이후에도 계속 유지되 며 수집한 상태 데이터를 제품 사용자에게 제공할 수 있다는 점에서 큰 장점을 가진다. 이러한, 디지털 트윈도 방대한 데이터를 처리하는 것을 기본으로 하고 있으므로, 상술한 빅데이터를 처리하고 활용하는 기술이 적용될 수 있다. 이에 따라, 디지털 트윈 기반을 기반으로 하여 빅데이터를 수집하는 기술에 대한 개발이 선결적으로 요구되고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-1757086호 (공고일자: 2017.07.05)"}
{"patent_id": "10-2019-0146517", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 바와 같은 문제점을 해결하기 위한 것으로써, 디지털 트윈 기술을 구현함에 따라 물리적 현실 세계의 건설기계를 가상화 하여 동작 상황을 시뮬레이션하기 위하여 필요한 다양한 데이터를 수집하고 통합적으 로 관리할 수 있는 데이터 통합수집시스템을 제공하고자 함에 그 목적이 있다. 또한, 데이터 최적화를 통해 데이터 전송 및 처리를 원활하게 할 수 있는 데이터 통합수집시스템을 제공하고자 함에 그 목적이 있다."}
{"patent_id": "10-2019-0146517", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예로써, 자동화 로봇 쉐어링 시스템이 제공될 수 있다. 본 발명의 일 실시 예에 따른 자동화 로봇 쉐어링 시스템은 복수의 공장들로부터 공장운영정보를 수신하고, 수 신한 공장운영정보에 기초하여 로봇지원이 필요한 공장을 추출하는 관리서버 및 관리서버로부터 지원신호에 따 라 추출된 공장으로 이동되어 공장 내에서 작업을 지원하기 위한 자율주행로봇을 포함할 수 있다. 본 발명의 일 실시 예에 따른 자동화 로봇 쉐어링 시스템에 있어서, 공장운영정보에는 공장의 가동률, 공장의 생산량, 공장 내 설비 이상정보 중 어느 하나가 포함될 수 있다.본 발명의 일 실시 예에 따른 자동화 로봇 쉐어링 시스템에 있어서, 관리서버는 수신한 공장운영정보를 분석하 고, 분석 결과에 따라 로봇지원이 필요한 공장들을 순서 및 가용 가능한 시간에 따라 추출할 수 있다. 본 발명의 일 실시 예에 따른 자동화 로봇 쉐어링 시스템에 있어서, 자율주행로봇은, 이동된 공장 내 설비의 이 상정보 판별을 위한 열감지모듈 및 카메라모듈, 물체의 형상 파악을 위한 스캔모듈, 관리서버와의 데이터 송수 신을 위한 통신모듈 및 자율주행로봇의 동작을 제어하기 위한 제어모듈을 포함할 수 있다. 본 발명의 일 실시 예에 따른 자동화 로봇 쉐어링 시스템에 있어서, 자율주행로봇은 물체를 파지하여 운반공간 에 이동시키고, 설비를 정비하기 위한 하나 이상의 로봇 암을 더 포함할 수 있다."}
{"patent_id": "10-2019-0146517", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템에 의하면, 디지털 트윈 기술을 구 현함에 따라 물리적 현실세계의 건설기계를 가상화 하여 동작 상황을 시뮬레이션하기 위하여 필요한 다양한 데 이터를 수집하고 통합적으로 관리할 수 있는 효과가 있다. 또한, 데이터 최적화를 통해 데이터 전송 및 처리를 원활하게 할 수 있는 효과가 있다."}
{"patent_id": "10-2019-0146517", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 명세서 전체에서 어떤 부분 이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, \"그 중간에 다른 소자를 사이에 두고\" 연결되어 있는 경우도 포함한다. 도 1은 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템을 나타낸 예시 도이고, 도 2는 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있 어서, 데이터수집부가 연결된 상태를 나타낸 예시도이며, 도 3은 본 발명의 일 실시 예에 따른 디지털 트 윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있어서, 플럼 기반의 데이터수집부를 나타낸 예시도이 며, 도 4는 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있어서, 스쿱 기반의 데이터수집부를 나타낸 예시도이며, 도 5는 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있어서, 크롤링 기반으로 데이터를 수집하는 과정을 나타낸 예시도이 다. 이하에서는 상술한 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 본 발명의 일 실시 예로써, 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템이 제공될 수 있다. 본 명세서에서 건설기계는 토목, 건축 등 건설공사에 사용되는 기계 장치를 총칭하는 것으로 도로, 하천, 항만, 교량 등 공사의 종류 및 대상에는 제한이 없으며, 특정 공종(Ex. 토공, 포장, 기초 등) 및 작업종류(Ex. 굴착, 운반, 다짐 등)에 제한되는 것은 아니다. 본 발명은 디지털 트윈 기반의 건설기계 지능화를 위하여 데이 터를 수집하고 통합적으로 관리하기 위한 시스템이지만, 디지털 트윈 기반의 건설기계 지능화 이외에도 다"}
{"patent_id": "10-2019-0146517", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "양한 기술분야에서 데이터 수집 및 관리를 위하여 활용될 수 있음은 당연하다. 또한, 본 발명의 일 실시 예에 따른 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템은 후술하 는 데이터 수집 방식(Ex. Flume, Crawling, Sqoop 등) 이외에도 다양한 방식으로 데이터를 수집할 수 있으 며, 이하의 수집 방식에 제한되는 것은 아니다. 도 1을 참조하면, 본 발명의 일 실시 예에 따른 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스 템은 복수의 데이터수집모듈들이 상호 직렬 또는 병렬로 연결되어 데이터를 수집하고 하나 이상의 데이터저 장부로 전송하기 위한 데이터수집부 및 수집된 데이터를 순환신경망(RNN) 알고리즘에 기초하여 학 습된 결과에 따라 생성된 정제모듈을 이용하여 정제하는 데이터정제부를 포함할 수 있다. 먼저, 순환신경망(Recurrent Neural Network, RNN)에 대하여 설명한다. 순환신경망(RNN)은 인공신경망의 일 예 로써, 상기 인공신경망(Artificial Neural Network, ANN)은 뉴런 및 뉴런 간 연결을 위한 시냅스를 통해서 주고 받는 과정에 따라 정보가 저장되는 뇌의 학습방법을 수학적으로 모델링한 기계학습(machine-learning) 알고리즘 으로서 인공신경망에서 상기 뉴런은 노드, 상기 시냅스는 가중치(weight)로 정의될 수 있다. 상기 인공신경망은 입력층(input layer), 적어도 하나 이상의 은닉층(hidden layer) 및 출력층(output layer)로 구성되며, 입력층 에는 각각 독립변수가 매칭되는 노드가 존재하며, 은닉층에는 이전층의 노드와 가중치의 결합으로 생성되는 노 드가 존재하며, 출력층은 마지막 은닉층의 뉴런과 가중치의 결합으로 생성되는 노드가 존재할 수 있고, 상기 출 력층의 노드에서 출력된 값이 종속변수일 수 있다. 상기 인공신경망에는 심층신경망(Depp Neural Network, DNN), 순환신경망(Recurrent Neural Network, RNN) 중 어느 하나가 포함될 수 있다. 뿐만 아니라, 상기 인공신경망은 심층신경망(DNN) 및 순환신경망(RNN) 중 적어도 하나 이상이 상호 결합되어 생성될 수 있다. 또한, 전술한 인공신경망 외에도 다양한 딥러닝 알고리즘이 적용될 수 있다. 심층신경망(DNN)은 복수개의 은닉층으로 구성된 인공신경망일 수 있다. 또한, 도 6은 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있어 서, 데이터 정제를 위한 순환신경망을 나타낸 예시도이다. 도 6을 참조하면, 순환신경망(RNN)은 상기 심층신경 망(DNN)과는 다르게 순환구조를 가지는 신경망으로써, 은닉층의 데이터를 저장하고 이를 다음 학습에 재귀적으 로 사용함으로써 과거의 정보를 기억하고 학습에 반영하기 때문에 시계열데이터의 분석에 적절한 신경망에 해당 된다. 즉, 상기 데이터정제부에서는 순환신경망(RNN)을 활용하여 수집된 데이터가 정제될 수 있다. 추가적으로, 순환신경망에 데이터가 입력되기 전 또는 이후에 전처리 또는 후처리가 수행될 수 있다. 상기, 전/후처리 방식 에는 데이터 필터링, 변환, 정제, 통합, 축소 등 다양한 방식의 처리 기법이 함께 활용될 수 있다. 도 2를 참조하면, 본 발명의 일 실시 예에 따른 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스 템에 있어서, 데이터수집모듈은 데이터 소스 또는 데이터수집모듈로부터 데이터가 입력되는 데이터리더모듈(Data Reader Module), 데이터수집모듈 또는 데이터저장부로 데이터를 기록하기 위한 데이터라이터모듈(Data Writer Module) 및 데이터리더모듈과 데이터라이터모듈 간의 데이터 전송 을 위한 데이터파이프모듈(Data Pipe Module)을 포함할 수 있다. 도 2에 도시된 바와 같이 데이터수집모듈은 상호 직렬 및/또는 병렬로 연결될 수 있다. 또한, 상기 데이터 수집모듈 간 연결 시 데이터의 이동은 데이터라이터모듈에서 타 데이터수집모듈의 데이터 리더모듈의 방향으로 수행될 수 있다. 또한, 전술한 바와 같이, 데이터라이터모듈에서는 데이터저장부(9 0)로 상기 데이터가 전송될 수 있다. 도 3을 참조하면, 본 발명의 일 실시 예에 따른 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스 템에 있어서, 데이터수집모듈은 다수의 데이터서버들로부터 로그데이터를 수집하기 위한 플룸(Flume) 기반 의 제 1 데이터수집모듈일 수 있다. 즉, 제 1 데이터수집모듈은 소스 시스템으로부터 데이터 로그를 수집하기 위한 것으로, 복수의 서버에 분 산되어 있는 데이터를 한 곳으로 모을 수 있도록 처리하는 장치일 수 있다. 도 3에 도시된 바와 같이, 제 1 데이터수집모듈은 플룸 기반으로 마련되어 외부 이벤트가 생성되어 수집되는 영역인 소스(Source), 소스와 싱크 간의 버퍼 구간인 채널(Channel) 및 수집된 로그 또는 이벤트를 목적지에 전달하는 싱크(Sink)로 구성될 수 있다. 즉, 일 개시에 의한 플룸 기반의 제 1 데이터수집모듈은 수집 대상 데이터(로그/이벤트)를 생성 하고, 수집 대상 로그/이벤트를 소스에서 수신하며, 소스는 수신한 메시지를 채널에 전달하며, 싱크는 채널로부 터 메시지를 수신하여 목적지에 데이터를 전달하거나 기록할 수 있다. 도 4를 참조하면, 본 발명의 일 실시 예에 따른 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스 템에 있어서, 데이터수집모듈은 HDFS 및 RDBMS 간 데이터 전송을 위한 스쿱(Sqoop) 기반의 제 2 데이터수집 모듈일 수 있다. 일 개시에 따른, 제 2 데이터수집모듈은 구조화된 관계형 데이터베이스 시스템(RDBMS) 및 HDFS와 같은 데이터 분산처리 시스템 간의 대용량 데이터들을 효율적으로 변환하여 주는 스쿱 기반의 인터페이스일 수 있다. 즉, 제 2 데이터수집모듈은 수신한 데이터를 소정의 형태로 변환하여 RDBMS 및 HDFS 간 데이터 송수신을 수 행하기 위한 장치일 수 있다. 도 5를 참조하면, 본 발명의 일 실시 예에 따른 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스 템에 있어서, 데이터수집모듈은 데이터 최적화를 위한 크롤링(Crawling) 기반의 제 3 데이터수집모듈일 수 있다. 즉, 제 3 데이터수집모듈은 웹 서버로부터 원하는 정보를 추출함으로써 처리하고자 하는 데이터를 최적화 할 수 있는 장치일 수 있다. 일 개시에 따른 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템은 스크라이브(Scribe)를 이용 하여 로그 데이터를 추출함으로써 데이터를 수집할 수 있다. 일 개시에 따른 디지털 트윈 기반 건설기계 지능화를 위한 데이터 통합수집시스템은 Bulk upload 기반으로 대용 량의 데이터를 송수신할 수 있다. 일 개시에 따르면, 상기 데이터 통합수집시스템은 배치 풀(Batch Pool)이 미 리 마련되어 있고, 업로드 스크립트의 작성 및 Batch Job 수행을 통해 모니터링할 수 있다."}
{"patent_id": "10-2019-0146517", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 이상에서 본 발명의 바람직한 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것 은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다. 즉, 본 발명의 범위는 상기 상세한 설명보다는 후술하는 청구범위에 의하여 나타내어지며, 청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다.부호의 설명 80: 데이터 100: 데이터수집부 200: 데이터정제부 110: 데이터수집모듈"}
{"patent_id": "10-2019-0146517", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템을 나타낸 예시 도이다. 도 2는 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있어서, 데 이터수집부가 연결된 상태를 나타낸 예시도이다. 도 3은 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있어서, 플 럼 기반의 데이터수집부를 나타낸 예시도이다. 도 4는 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있어서, 스 쿱 기반의 데이터수집부를 나타낸 예시도이다. 도 5는 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있어서, 크 롤링 기반으로 데이터를 수집하는 과정을 나타낸 예시도이다. 도 6은 본 발명의 일 실시 예에 따른 디지털 트윈 기반의 건설기계 지능화를 위한 시각화 시스템에 있어서, 데 이터 정제를 위한 순환신경망을 나타낸 예시도이다."}
