{"patent_id": "10-2023-0099092", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0066054", "출원번호": "10-2023-0099092", "발명의 명칭": "건설정보모델링이 접목된 건설시공모형키트의 조립에 따른 활용 방법", "출원인": "서희창", "발명자": "서희창"}}
{"patent_id": "10-2023-0099092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실제 공사현장의 시공과 관련하여 모형으로 제작된 건설시공모형키트(Construction Kit)의 조립 과정에 관련되는 작업 데이터를 수신하는 단계; 및상기 실제 공사현장에서 진행되는 시공과정과 동일한 방법으로 상기 건설시공모형키트를 이용한 조립이 이루어질 때 상기 수신한 작업 데이터 및 기저장되는 건설정보모델링(BIM)을 적용한 설계정보를 근거로 상기 건설시공모형키트의 조립에 의한 모형을 시뮬레이션하여 화면상에 표시하는 단계;를포함하는, 건설정보모델링이 접목된 건설시공모형키트의 사용 방법."}
{"patent_id": "10-2023-0099092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 화면상에 표시하는 단계는,상기 모형을 상기 실제 공사현장의 시공과정에 관련되는 3차원 모델로 화면상에 구현하는, 건설정보모델링이 접목된 건설시공모형키트의 사용 방법."}
{"patent_id": "10-2023-0099092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 3차원 모델로 화면상에 구현하는 단계는,상기 시공과 관련한 독립 기초의 제1 단계, 독립기초 기둥 및 슬라브의 제2 단계, 구조체 및 기둥의 제3 단계,구조벽, 기둥 및 보의 제4 단계, 조적벽의 제5 단계, 시공 완료의 제6 단계로 구분하여 상기 3차원 모델로 구현하는, 건설정보모델링이 접목된 건설시공모형키트의 사용 방법."}
{"patent_id": "10-2023-0099092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 3차원 모델로 화면상에 구현하는 단계는,상기 수신한 작업 데이터 및 상기 설계정보를 근거로 실제 공사현장의 시공방법이나 공법과 관련한 수치 데이터를 상기 3차원 모델상에 제공하는 단계를 포함하는, 건설정보모델링이 접목된 건설시공모형키트의 사용 방법."}
{"patent_id": "10-2023-0099092", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 조립 과정의 촬영 영상을 분석하여 작업 데이터를 생성하는 단계;상기 생성한 작업 데이터 및 상기 설계정보를 근거로 실제 공사현장에서의 시공과정을 판단하는 단계; 및상기 시공과정의 판단 결과를 근거로 상기 모형을 시뮬레이션하는 단계;를더 포함하는, 건설정보모델링이 접목된 건설시공모형키트의 사용 방법."}
{"patent_id": "10-2023-0099092", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "건설정보모델링이 접목된 건설시공모형키트의 사용 방법이 개시된다. 본 발명의 일 실시예에 따른 건설정보모델 링이 접목된 건설시공모형키트의 조립에 따른 활용 방법은, 실제 공사현장의 시공과 관련하여 모형으로 제작된 건설시공모형키트의 조립 과정에 관련되는 작업 데이터를 수신하는 단계, 및 실제 공사현장에서 진행되는 시공과 정과 동일한 방법으로 건설시공모형키트를 이용한 조립이 이루어질 때 (기)수신한 작업 데이터 및 기저장되는 건 설정보모델링(BIM)을 적용한 설계정보를 근거로 건설시공모형키트의 조립에 의한 모형을 시뮬레이션하여 화면상 에 표시하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0099092", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 건설정보모델링이 접목된 건설시공모형키트의 조립에 따른 활용 방법에 관한 것으로서, 더 상세하게 는 가령 구조물의 철근 배근을 위한 모형 키트나 구조물의 거푸집 및 양생 공정을 위한 모형 키트 등의 건설 현장에 관련된 모형을 실제 시공방법과 동일하게 적용하여 건설정보모델링(BIM: Building Information Modeling) 과 연동해 구조물의 완공 전 사전 시뮬레이션이 가능하게 하는, 건설정보모델링이 접목된 건설시공모형키트의 조립에 따른 활용 방법에 관한 것이다."}
{"patent_id": "10-2023-0099092", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "건설산업은 사물인터넷(IoT), 로봇, 인공지능(AI) 등 4차 산업혁명의 첨단기술과 융복합되면서 스마트 건설기술 확산을 통해 첨단산업으로 거듭날 새로운 기회를 맞이하고 있다. 특히, 3차원 설계와 빅데이터의 융복합 기술인 건설정보모델링(BIM)은 계획-설계-조달-시공-유지관리 등 건설 전(全)주기의 정보를 통합 활용하고, 각 단계의 관계자가 효율적으로 소통하도록 하여 건설 프로세스의 생산성·시공성·효율성 등을 극대화할 수 있는 스마트 건설의 핵심 수단이 되고 있다. 그런데, 현재에는 건설 시공(예: 건축, 토목, 플랜트, 도시인프라시설 등) 과정에서 실제 건설현장의 도면 정보 만으로 시공시 작업자나 관리자들이 시공방법, 공법에 대한 이해도가 부족해 공정과정 중 소통, 설계-시공 오류 의 문제가 다수 발생하는 문제가 있다. 이에 따라 공사현장의 BIM 설계 정보와 연동하여 구조물의 완공 전 사전 시뮬레이션의 필요성이 대두되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2019-0132896호(2019.11.29) (특허문헌 0002) 한국공개특허공보 제10-2006-0062846호(2006.06.12) (특허문헌 0003) 한국등록특허공보 제10-1914761호(2018.10.29) (특허문헌 0004) 한국등록특허공보 제10-1950698호(2019.02.19)"}
{"patent_id": "10-2023-0099092", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 가령 구조물의 철근 배근을 위한 모형 키트나 구조물의 거푸집 및 양생 공 정을 위한 모형 키트 등의 건설 현장에 관련된 모형을 실제 시공방법과 동일하게 적용하여 건설정보모델링(BI M)과 연동해 구조물의 완공 전 사전 시뮬레이션이 가능하게 하는, 건설정보모델링이 접목된 건설시공모형키트의 조립에 따른 활용 방법을 제공하는 것이다. 본 발명의 과제들은 이상에서 언급한 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0099092", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 일 실시예에 따른 건설정보모델링이 접목된 건설시공모형키트의 사용 방법은, 실제 공사현장의 시공과 관련하여 모형으로 제작된 건설시공모형키트(CON-KIT: Construction Kit)의 조립 과정에 관 련되는 작업 데이터를 수신하는 단계, 및 상기 실제 공사현장에서 진행되는 시공과정과 동일한 방법으로 상기 건설시공모형키트를 이용한 조립이 이루어질 때 상기 수신한 작업 데이터 및 기저장되는 건설정보모델링(BIM)을 적용한 설계정보를 근거로 상기 건설시공모형키트의 조립에 의한 모형을 시뮬레이션하여 화면상에 표시하는 단 계를 포함한다. 상기 화면상에 표시하는 단계는, 상기 모형을 상기 실제 공사현장의 시공과정에 관련되는 3차원 모델로 화면상 에 구현할 수 있다. 상기 3차원 모델로 화면상에 구현하는 단계는, 상기 시공과 관련한 독립 기초의 제1 단계, 독립기초 기둥 및 슬 라브의 제2 단계, 구조체 및 기둥의 제3 단계, 구조벽, 기둥 및 보의 제4 단계, 조적벽의 제5 단계, 시공 완료 의 제6 단계로 구분하여 상기 3차원 모델로 구현할 수 있다. 상기 3차원 모델로 화면상에 구현하는 단계는, 상기 수신한 작업 데이터 및 상기 설계정보를 근거로 실제 공사 현장의 시공방법이나 공법과 관련한 수치 데이터를 상기 3차원 모델상에 제공하는 단계를 포함할 수 있다. 상기 사용 방법은, 상기 조립 과정의 촬영 영상을 분석하여 작업 데이터를 생성하는 단계, 상기 생성한 작업 데 이터 및 상기 설계정보를 근거로 실제 공사현장에서의 시공과정을 판단하는 단계, 및 상기 시공과정의 판단 결 과를 근거로 상기 모형을 시뮬레이션하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2023-0099092", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 건설정보모델링이 접목된 건설 시공 모형의 조립에 따른 활용 방법은, 건설시공모 형키트를 활용하여 단순한 조립이 아닌 현장 도면을 파악하는 방법, 공정에 대한 이해 및 각각의 부재의 조립 및 연결에 대한 이해도를 향상시킬 수 있고, 구조물 시공 전에 사전 점검과정을 통해 시공상의 문제점을 면밀히 검토해 볼 수 있으며, 제작된 모형을 활용한 홍보 및 전시 효과를 가질 수 있다. 또한, 실제 공사현장에서 진행되는 공정을 본 발명의 실시예에 따른 건설시공모형키트(CON-KIT)를 활용하여 동 일한 방법으로 사전 시공하여 BIM 기반의 설계정보와 연동하여 시뮬레이션할 수 있다. 특히, 건축공사 과정에서 완성된 CON-KIT 건축물은 폐기가 아니라, 인테리어, 방수, 미장, 통신 및 소방공사 등 타 공정을 실제로 구현하면서 교육 교재로도 활용될 수 있도록 확장시킬 수 있다. 또한, 스마트건설기술인 BIM 기술을 활용하여, 교육 대상자들에게 정확한 정보를 전달함과 동시에, 기존의 책에 서 제공된 수준의 이론 정보(예: 이미지, 텍스트)가 아닌 실제 운용이 가능한 3차원 모델을 제공함으로써 공법 과 시공기술에 대한 몰입도 및 이해도를 향상시킬 수 있다. 나아가, 건설 초급기술자를 대상으로 관련 기능사 자격시험에 필요한 학습 내용을 CON-KIT로 구현하여, 시험 응 시자의 현장 이해도 및 실무능력을 향상시킬 수 있게 된다. 실시예들에 따른 효과는 이상에서 예시된 내용에 의해 제한되지 않으며, 더욱 다양한 효과들이 본 명세서 내에 포함되어 있다."}
{"patent_id": "10-2023-0099092", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는"}
{"patent_id": "10-2023-0099092", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 이하 본 발명의 실시예에 대하여 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 건설정보모델링(BIM) 기반의 건설시공모형키트 및 시뮬레이션 시스템을 나타내 는 도면, 도 2는 건설시공모형키트 구성품들의 예시도, 도 3은 건설시공모형키트, 설계 도면 및 조립 방법을 설 명하기 위한 도면, 도 4a 내지 도 4e는 다양한 종류의 건설 시공에 따른 건설시공모형키트의 조립 과정을 나타 내는 도면, 도 5는 건설시공모형키트 제작 완성 모습을 보여주는 도면, 도 6a는 도 4a 내지 도 4e의 조립 과정 에 의한 모형의 시뮬레이션 화면, 그리고 도 6b는 도 6a의 3차원 시뮬레이션 모델의 확대도이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 건설정보모델링(BIM) 기반의 건설시공모형키트 및 시뮬레이 션 시스템은 건설시공모형키트 조립체(혹은 모형, 모형 건축물), 시뮬레이션장치 및 촬영장치(미 도시)의 일부 또는 전부를 포함할 수 있다. 여기서, \"일부 또는 전부를 포함\"한다는 것은 촬영장치와 같은 일부 구성요소가 생략되어 건설정보모델링(BIM) 기반의 건설시공모형키트 및 시뮬레이션 시스템이 구성되거나, 촬영장치와 같은 일부 구성요소가 시뮬레이 션장치와 같은 다른 구성요소에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해 를 돕기 위하여 전부 포함하는 것으로 설명한다. 건설시공모형키트 조립체는 실제 공사현장, 다시 말해 건축, 토목, 플랜트, 도시인트라시설 등 건설 시공 과정에 사용되는 독립기초, 독립기초기둥, 1층 슬라브, 구조체, 기둥, 구조벽, 기둥, 보, 조적벽 등과 관련한 모형(물) 또는 키트들을 조립하여 구성한 완성품이라 볼 수 있다. 다시 말해 건설시공모형키트 조립체는 건축공사과정에서 완성된 건설시공모형키트 건축물이 될 수 있는 것이다. 모형키트들에 의해 조립된 것이 모형 (물)이며, 이러한 모형은 실제 공사현장에서 시공되는 구조물, 가령 독립기초나 조적벽 등에 대응되는 대상물이 라 볼 수 있다. 도 2에서는 본 발명의 실시예에 따른 건설시공모형키트 조립체를 완성하기 위한 건설시공 모형키트 구성품들을 보여주고 있으며, 또 도 3에서는 도 2의 구성품들을 사용하여 실제 공사현장에서 완성품을 완성하기 위해 사용되는 다양한 부가 재료들을 보여주고 있다. 해당 부가 재료(또는 자료)들에는 설계도면, 매 뉴얼 등 다양한 시공 자료들이 포함될 수 있다. 이를 이용해 모형키트의 조립이 이루어지도록 함으로써 다시 말 해 실제 공사현장에서 이루어지는 것과 같은 동일한 환경을 조성함으로써 시뮬레이션 모델링 통해 간접적으로 현장도면을 파악하는 방법, 공정에 대한 이해 및 각각의 부재의 조립 및 연결에 대한 이해도를 판단(또는 평 가)할 수 있을 것이다. 도 4a는 본 발명의 실시예에 따른 건설시공모형키트 조립체로서 독립기초의 시공 과정을 보여주고 있다. 다시 말해 건설시공모형키트의 조립을 통해 실제 공사현장에서 독립기초를 시공하는 과정과 동일한 방법으로 조 립을 하여 현장 도면을 파악하는 방법, 공정에 대한 이해 및 각각의 부재의 조립 및 연결에 대한 이해도를 향상 시킬 수 있도록 하는 것이다. 물론 독립기초와 같은 구조물의 시공 전에 시뮬레이션 등의 사전 점검 과정을 통 해 시공상의 문제점을 면밀히 검토해 볼 수 있으며, 이는 조립 작업이 이루어지는 주변에 설치되는 카메라 등의 촬영장치, 또는 시뮬레이션장치에 설치되는 카메라를 통해 조립 과정을 촬영하여 이를 통해 점검이 이루어 지도록 하는 것도 얼마든지 가능할 수 있다. 독립기초의 시공 과정이 완료되면 가령 그 단계까지 완성된 모형을 시뮬레이션함으로써 점검이 이루어질 수 있는 것이다. 관련 내용들은 이후에 좀더 다루기로 한다. 도 4b는 건설시공모형키트 조립체로서 실제 공사현장에서 독립기초 기둥, 1층 슬라브의 시공 과정을 작업 자들이 습득하도록 하기 위한 건설시공모형키트의 조립 과정을 보여주고 있다. 도 4c는 구조체, 기둥과 관련한 건설시공모형키트의 조립 과정, 도 4d는 구조벽, 기둥, 보와 관련한 건설시공모형키트의 조립 과정, 그리고 도 4e는 조적벽과 관련한 건설시공모형키트의 조립 과정을 각각 나타내고 있다. 도 5는 실제 공사현장에서 완성된 건축물에 대응되는 모형으로서 도 4a 내지 도 4e의 시공 과정을 통해 완성된 건축물을 의미할 수 있다. 물론, 본 발명의 실시예에서는 사전에 준비된 도 3에서의 키트 구성품들을 이용하여 도 4a 내지 도 4e에서와 같은 각 각의 시공 과정에 따라 모형 키트들을 조립하고 그 결과 도 5에서와 같은 키트의 제작 완성을 통해 실제 공사현 장에서와 같은 시공을 완료한다고 볼 수 있다. 시뮬레이션장치는 도 4a 내지 도 4e의 조립 과정에 따라 제작되는 도 1의 건설시공모형키트 조립체를 시뮬레이션하여 보여주는 데스크탑 컴퓨터, 랩탑컴퓨터 등 PC 기반의 단말장치뿐 아니라 스마트폰이나 태블릿PC 등 모바일 기반의 단말장치를 포함할 수 있다. 예를 들어, 모바일 기반의 단말장치의 경우에는 모형 키트의 조 립 작업이 이루어지는 탁자의 인접하는 위치에 거치하는 형태로 하여 사용하는 것도 얼마든지 가능할 수 있을 것이다. 본 발명의 실시예에 따른 시뮬레이션장치는 화면상에 가령 도 6a 및 도 6b에서와 같이 본 발명의 실시예에 따른 건설시공모형키트들을 활용하여 이루어지는 다시 말해 도 4a 내지 도 4e의 조립 과정에 따라 이 루어지는 과정의 모형을 화면에 구현해 줄 수 있다. 도 6a는 건설시공모형키트의 BIM 모델 구현 모습을 보여주 며, 도 6b는 BIM 기반 교육 정보 제공 화면을 보여주고 있다. 이를 위하여 물론 시뮬레이션장치는 실제 운 용이 가능한 3차원 모델을 구현하기 위한 프로그램을 설계하여 기저장한 후 이를 근거로 모형 키트의 조립에 의해 이루어지는 과정을 3차원 모델에 구현해 줄 수 있게 된다. 시뮬레이션장치는 도 6a에서와 같은 화면을 구현하기 위하여 시뮬레이션장치에 설치되는 카메라에 의 해 촬영되는 촬영영상을 분석하거나, 또는 모형키트의 조립이 이루어지는 공간의 주변에 설치되는 카메라 등으 로부터 제공되는 촬영영상을 분석하여 그 결과를 근거로 모델링을 구현한다고 볼 수 있다. 예를 들어, 시뮬레이 션장치는 작업자가 건설시공모형키트를 조립하여 도 4a에서의 과정에 따라 독립 기초를 완료하였다고 가정 해 보자. 이의 경우 시뮬레이션장치에는 도 6a 및 6b에서 볼 때, 독립 기초가 완료된 상태의 화면을 표시 할 수 있다. 물론 이러한 과정은 촬영영상의 분석을 통해 독립 기초가 완료되었음을 판단한 후에 화면에 3차원 모델링 영상이 구현될 수 있다. 물론 본 발명의 실시예에 따른 시뮬레이션장치는 촬영영상의 분석 결과를 기저장된 기준 데이터 또는 모델링 데이터와 비교하여 비교 결과와 관련한 코멘트 정보를 제공하는 것도 얼마든 지 가능할 수 있다. 물론 여기서 코멘트는 현장도면을 파악하는 방법, 공정에 대한 이해 및 각각의 부재의 조립 및 연결에 대한 이해도 등에 관련될 수 있을 것이다. 예를 들어 시뮬레이션장치는 도 4a에서와 같은 독립기초 작업을 수행할 때, a-b-c-d-e 등의 순서로 작업이 이루어지도록 기설정될 수 있다. 그런데 건설시공모형키트를 이용하여 조립을 수행하는 작업자(또는 사용자)가 a-c의 순으로 작업을 진행하는 경우에는 시뮬레이션장치는 기저장된 데이터를 근거로 작업의 순서가 잘못 되었음을 화면상에 통지해 줄 수도 있는 것이다. 물론 이러한 코멘트 정보를 제공하는 시점은 다양하게 이루어 질 수 있다. 다시 말해, 도 4a에서와 같은 독립기초 작업이 모두 완료된 이후에 종합적으로 작업평가(예: 작업 오류 등) 등과 관련한 코멘트를 제공할 수 있지만, 모형의 조립을 통해 작업오류가 인지되는 순간순간마다 코멘 트를 제공하는 것도 얼마든지 가능할 수 있다. 본 발명의 실시예에서는 키트 모형들이 실제 공사현장에서 사용 되는 재질 등과 동일한 재료들이 사용될 수 있고, 또 다양한 여건(예: 키트 폐기물 등)을 고려하여 후자의 경우 가 바람직할 수 있다. 시뮬레이션장치는 독립기초 작업 즉 모형키트를 이용한 조립이 완료되었을 때 이를 화면상의 3차원 모델에 반영하여 표시하고, 또 이의 과정에서 수집된 데이터를 기저장되는 BIM 기반 설계정보와 비교하여 교육 대상자 와 같은 사용자들에게 유용한 다양한 코멘트 즉 정보를 제공해 줄 수 있다. 만약 공정에 대한 이해나 각각의 부 재의 조립 및 연결에 이해도가 부족한 것으로 판단되는 경우에는 관련 정보를 제공해 줄 수 있다. 또한, BIM 기 반의 설계정보를 근거로 실제 공사현장에서 특정 작업 즉 시공에서 작업자들이 많은 오류를 발생시키는 경우에 는 오류가 많이 발생하는 작업임을 사용자들에게 인지시켜 줄 수도 있다. 또한 본 발명의 실시예에 따른 시뮬레 이션장치는 가령 독립기초의 완료 단계에서 조립 상태를 기저장되는 설계정보를 근거로 분석해 본 결과 많 은 문제가 발생한 것으로 판단될 경우 사용자에게 재조립을 요청할 수도 있다. 이의 경우 사용자는 시뮬레이션 장치의 화면에 표시되는 재조립요청 메뉴를 선택해 이전 단계로 돌아가도록 하는 것도 얼마든지 가능할 수 있으며, 또는 촬영 영상에서 재조립 모습이 확인될 때 이를 근거로 이전 단계로 다시 회귀하는 것도 얼마든지 가능할 수 있다. 시뮬레이션장치는 실제 공사현장에서 취득되는 빅데이터를 근거로 3차원 모델을 설계한다고 볼 수 있다. 다시 말해, 본 발명의 실시예에서는 건설정보모델링(BIM) 기반으로 모형 키트를 조립해 가상의 시공을 통해 실 제 시공현장에서 발생할 수 있는 작업자들의 이해도 부족 문제를 해결한다고 볼 수 있다. 물론 본 발명의 실시 예에 따른 건설정보모델링(BIM) 기반의 건설시공모형키트 및 시뮬레이션 시스템은 고등학교나 대학과 같은 교육현장, 그리고 학원 등에 구축되어 사용될 수 있을 것이다. 스마트건설기술인 BIM 기술을 활용하여, 교육 대 상자들에게 정확한 정보를 전달함과 동시에, 기존의 책에서 제공된 수준의 이론 정보(예: 이미지, 텍스트)가 아 닌 실제 운용이 가능한 3차원 모델을 제공함으로써 공법과 시공기술에 대한 몰입도 및 이해도를 향상시킬 수 있 을 것이다. 건설교육은 산업적 특성상 공학적 이론과 현장에 대한 복합적인 이해가 필수적으로 요구된다. 그러나, 현 건설 시공분야 교육은 이론 및 공법 이해 중심의 강의식 교육이 주를 이룬다. 이에 따라 학습한 지식을 실무현장에 반영하기 어려워 지식 전달에 한계가 있다. 또한 건설사 OJT(on-the-job training) 즉 직장내 교육훈련의 경우 에도 시공현장이 대형화되어 있고 업무의 복잡성과 환경적 위험성 등의 한계로 인해 교육시간이 한정적이며 지 식의 전달이 체계적이지 않아 실무 현장 투입에 애로사항이 있다. 또 건설 기술인력의 양성 측면에서 대학교육 문제점으로 이론 중심적, 현장성 결여문제(79.4%)가 심각하다. 따라서 본 발명의 실시예에서와 같이 실제 공사 현장에서의 설계정보 등이 반영되는 BIM 기술을 활용하여 실제 운용이 가능한 3차원 모델을 교육 대상자들에게 제공함으로써 자신이 실제 공사현장과 동일 또는 유사한 모형 키트들을 가지고 시공을 해 봄으로써 시공기술에 대한 몰입도 및 이해도를 증가시킬 수 있게 된다. 더욱이 BIM 기반의 설계정보와 연동하여 시뮬레이션하므로 그시뮬레이션 과정에서 실제 공정과정 중 소통, 설계, 시공 오류의 부분을 개선할 수 있게 되는 것이다. 본 발명의 실시예에 따르면, 건설산업의 특성을 고려한 BIM 기반의 건설시공모형키트의 개발을 통해 현장 중심 의 건설산업 특성을 고려한 시공역량 강화, 공간적 제약이 없는 건설시공모형키트 개발을 통한 교육 질 향상, BIM 데이터를 활용한 건설 시공 핵심기술 시뮬레이션 구현 등의 효과를 도모할 수 있을 것이다. 공간제약 없이 현장 시공 영역 구현, 또 구조, 마감재내부 등 실제 공사 중 발생할 수 있는 문제점 사전 검토, 실제 시공 경험 으로 얻을 수 있는 노하우 습득, 그리고 경험하지 못한 공정 및 공사방법에 대한 가상교육 가능 등을 통해 시 공역량을 강화할 수 있을 것이다. 또 현장 특성상 건설 시공 관련 이론 습득의 한계점 개선, 공간적 제약이 없 는 건설 시공 모형 키트를 통한 현장학습 대체, 페이퍼 및 이미지 자료가 아닌 실제 현장기술 지식 체험, 건설 시공 초급기술자의 공법 몰입도 및 이해도 향상 등을 통해 교육의 질을 향상시킬 수 있을 것이다. BIM의 3D 기 반 건설시공기술 핵심기술 시뮬레이션 구현, 3D 기반의 건설 시공 요소기술 모델링, BIM 가상공간 정보를 활용 한 교육 콘텐츠 활용, BIM 설계정보를 활용해 실 시공 모형과의 비교 정보 제공 등의 시뮬레이션을 구현할 수 있을 것이다. 상기한 내용 이외에도 도 1의 건설시공모형키트 조립체 및 시뮬레이션장치와 관련한 내용은 이후에도 좀더 다루어질 수 있으므로 자세한 내용은 그 내용들로 대신하고자 한다. 도 7은 도 1의 시뮬레이션장치의 세부구조를 예시한 블록다이어그램이다. 도 7에 도시된 바와 같이, 본 발명의 실시예에 따른 시뮬레이션장치는 통신 인터페이스부, 제어부 , 모형구조물 시뮬레이션부 및 저장부의 일부 또는 전부를 포함하며, 카메라 등의 촬영부를 더 포함할 수 있다. 여기서, \"일부 또는 전부를 포함\"한다는 것은 저장부와 같은 일부 구성요소가 생략되어 시뮬레이션장치 가 구성되거나, 모형구조물 시뮬레이션부와 같은 일부 구성요소가 제어부와 같은 다른 구성요소 에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 통신 인터페이스부는 가령 주변에 설치되어 도 1의 건설시공모형키트의 조립체가 조립되는 과정을 촬 영하는 촬영장치와 통신을 수행할 수 있다. 다시 말해, 건설과 관련한 교육이 이루어지는 공간에는 카메라가 설 치될 수 있다. 해당 카메라는 해당 공간의 벽에 고정되는 형태로 설치될 수 있지만, 탁자나 바닥에 거치 형태의 카메라가 설치될 수도 있다. 따라서 본 발명의 실시예에 따른 통신 인터페이스부는 해당 카메라와 유선 또 는 무선으로 통신하여 건설시공모형키트의 조립 과정을 촬영하여 시뮬레이션장치로 제공할 수 있다. 물론 여기서, 모형 키트를 활용한 조립 과정은 도 4a 내지 도 4e에서와 같은 과정이 될 수 있다. 제어부는 도 7의 통신 인터페이스부, 모형구조물 시뮬레이션부 및 저장부의 전반적인 제어 동작을 담당한다. 제어부는 통신 인터페이스부를 통해 촬영영상이 제공되는 경우 이를 저장부에 임시 저장한 후 불러내어 영상 분석을 위해 모형구조물 시뮬레이션부에 제공할 수 있다. 또한 제어부(71 0)는 3차원 모델링을 위한 동작을 수행할 수 있다. 이를 위하여 모형구조물 시뮬레이션부와 연계하여 동작 할 수 있다. 예를 들어, 제어부는 통신 인터페이스부에 연결되는 저장매체 또는 컴퓨터 등을 통해 건설시공모형 키트를 활용하여 실제 공사현장에서 진행되는 공정과 동일한 방법으로 사전 시공하여 BIM 기반의 설계정보와 연 동해 시뮬레이션을 제공하기 위한 프로그램을 제공받아 이를 내부에 설치할 수 있다. 물론 해당 프로그램은 3차 원 모델링은 위한 도 4a 내지 도 5에 관련되는 데이터를 저장한다고 볼 수 있다. 이에 따라 도 6a 및 도 6b에서 와 같은 형태의 모델을 화면을 구현할 수 있게 되는 것이다. 이를 위하여 제어부는 모형구조물 시뮬레이션 부에 해당 프로그램을 탑재한 후 해당 프로그램을 실행시켜 본 발명의 실시예에 따른 BIM 모델링 구현 동 작을 수행할 수 있는 것이다. 모형구조물 시뮬레이션부는 도 6a 및 도 6b에서와 같은 모델링 구현을 위한 프로그램을 탑재할 수 있다. 해당 프로그램은 건축, 토목, 플랜트, 도시인프라시설 등 건설 시공과 관련한 다양한 모델을 포함할 수 있을 것 이다. 예를 들어, 건설 시공의 경우 도 4a 내지 도 5에서와 같이, 독립기초를 포함하는 제1 단계, 독립기초기둥, 1층 슬라브를 포함하는 제2 단계, 구조체, 기둥을 포함하는 제3 단계, 구조벽, 기둥, 보를 포함 하는 제4 단계, 조적벽을 포함하는 제5 단계를 각각 화면에 구현하는 도 6a 및 도 6b에서와 같은 하나의 모델을 포함할 수 있다. 따라서 모형구조물 시뮬레이션부는 건설시공모형키트를 이용해 도 4a에서와 같이 조립이 이루어지는 경우 관련 데이터를 제공받아 즉 조립과 관련한 작업 데이터를 근거로 화면상에 독립기초 시공과 관련한 모습을 3차원 모델상에 구현할 수 있다. 또한, 모형구조물 시뮬레이션부는 모형 키트의 조립과 관련하여 화면상의 3차원 모델에 구현해주는 것 이 외에도 가령 교육대상자들이 실제 공사현장의 시공에 대응하는 모형키트의 조립을 잘못 수행하는 경우에는 이의 정보를 화면에 제공해줄 수도 있다. 물론, 이를 위하여 모형구조물 시뮬레이션부는 해당 과정을 판단하기 위한 기준 데이터 즉 BIM 기반의 설계정보를 포함하는 모델링 데이터를 기저장할 수 있으며, 그 기준 데이터와 의 비교를 통해 교육대상자의 작업이 잘못 되었음을 화면상에 통지해 줄 수 있다. 또한, 모형구조물 시뮬레이션 부는 교육대상자들이 실제 공사현장에 투입되었을 때 도면 정보만으로 시공시 시공방법, 공법에 대한 이해 도가 부족한 문제를 해결해 줄 수 있도록 화면상의 3차원 모델상에는 실제 공사현장에서의 시공에 관계되는 수 치 데이터 등을 표시해 줄도 있다. 이는 도 6b에서 잘 보여주고 있다. 본 발명의 실시예에서는 모형 키트의 조 립에 의한 3차원 모델을 화면에 구현함으로써 교육 대상자들에게 공법과 시공기술에 대한 몰입도 및 이해도를 향상시킬 수 있게 되는 것이다. 나아가 모형구조물 시뮬레이션부는 가령 촬영영상 분석 동작을 수행할 수도 있다. 촬영영상 분석을 통해 다시 말해 실시간으로 수신되는 비디오 프레임의 조립 장면을 분석하여 가령 도 4a에서와 같은 독립 기초 과정 을 제대로 수행하는지를 판단할 수 있다. 물론 독립 기초 과정은 도 4a에서와 같은 12개의 세부과정으로 구분될 수 있으며, 각각의 과정에서 대상물의 특징값을 저장한 후 이를 통해 특정 과정이 이루어졌음을 확인할 수 있을 것이다. 예를 들어 각 거푸집에 콘크리트를 타설 후 평판 막대로 평탄화 작업을 해 주는 과정의 경우, 영상에서 거푸집, 평탄 막대를 검출하여 이의 객체가 검출될 때 해당 과정이 제대로 수행되었는지를 판단할 수 있고, 또 평탄 막대의 움직임 검출을 통해 평탄화 작업이 수행됨을 판단할 수 있을 것이다. 물론 이러한 판단을 위한 기 준 데이터를 모델링 데이터(혹은 설계정보)에 포함되어 기저장될 수 있으며, 해당 기준 데이터와 영상의 분석 결과를 비교하여 특정 작업이 제대로 이루어졌는지를 판단할 수 있고, 이에 따라 작업에 오류가 있을 때 오류 정보를 화면상에 표시해 주어 작업이 수정되도록 할 수 있다. 또한, 모형키트의 조립에 의해 특정 작업이 이루 어지는 경우에는 실제 공사현장에서 필요한 시공방법이나 공법에 대한 이해도를 높일 수 있는 수치 데이터 등의 정보를 제공하여 이해도를 향상시킬 수 있을 것이다. 저장부는 제어부의 제어하에 처리되는 다양한 유형의 데이터를 임시 저장할 수 있다. 예를 들어 저장 부는 통신 인터페이스부에서 제공하는 건설시공모형키트를 활용한 조립 과정과 관련한 촬영영상을 임 시 저장한 후 영상 분석을 위해 모형구조물 시뮬레이션부로 제공할 수 있다. 상기한 내용 이외에도 도 7의 통신 인터페이스부, 제어부, 모형구조물 시뮬레이션부 및 저장부 는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하 고자 한다. 본 발명의 실시예에 따른 도 7의 통신 인터페이스부, 제어부, 모형구조물 시뮬레이션부 및 저장 부는 서로 물리적으로 분리된 하드웨어 모듈로 구성되지만, 각 모듈은 내부에 상기의 동작을 수행하기 위 한 소프트웨어를 저장하고 이를 실행할 수 있을 것이다. 다만, 해당 소프트웨어는 소프트웨어 모듈의 집합이고, 각 모듈은 하드웨어로 형성되는 것이 얼마든지 가능하므로 소프트웨어니 하드웨어니 하는 구성에 특별히 한정하 지 않을 것이다. 예를 들어 저장부는 하드웨어인 스토리지(storage) 또는 메모리(memory)일 수 있다. 하지 만, 소프트웨어적으로 정보를 저장(repository)하는 것도 얼마든지 가능하므로 위의 내용에 특별히 한정하지는 않을 것이다. 한편, 본 발명의 다른 실시예로서 제어부는 CPU 및 메모리를 포함할 수 있으며, 원칩화하여 형성될 수 있 다. CPU는 제어회로, 연산부(ALU), 명령어해석부 및 레지스트리 등을 포함하며, 메모리는 램을 포함할 수 있다. 제어회로는 제어동작을, 그리고 연산부는 2진비트 정보의 연산동작을, 그리고 명령어해석부는 인터프리터나 컴 파일러 등을 포함하여 고급언어를 기계어로, 또 기계어를 고급언어로 변환하는 동작을 수행할 수 있으며, 레지 스트리는 소프트웨어적인 데이터 저장에 관여할 수 있다. 상기의 구성에 따라, 가령 시뮬레이션장치의 동 작 초기에 모형구조물 시뮬레이션부에 저장되어 있는 프로그램을 복사하여 메모리 즉 램(RAM)에 로딩한 후 이를 실행시킴으로써 데이터 연산 처리 속도를 빠르게 증가시킬 수 있다. 딥러닝 모델 같은 경우 램(RAM)이 아 닌 GPU 메모리에 올라가 GPU를 이용하여 수행 속도를 가속화하여 실행될 수도 있다. 도 8은 본 발명의 실시예에 따른 건설정보모델링이 접목된 건설시공모형키트의 조립에 따른 활용 방법(혹은 시 뮬레이션장치의 구동과정)의 흐름도이다. 설명의 편의상 도 8을 도 1과 함께 참조하면, 도 1의 시뮬레이션장치는 실제 공사현장의 시공과 관련하여 모형으로 제작된 건설시공모형키트의 조립 과정에 관련되는 작업 데이터를 수신할 수 있다(S800). 여기서 작업 데이터는 실제 공사현장에서와 같이 모형 키트를 이용해 이루어지는 조립 과정을 촬영한 촬영영상을 지칭할 수 있지만, 그 촬영영상을 분석하여 구체적으로 어떠한 작업인지에 관련되는 데이터를 의미할 수도 있다. 예를 들 어, 앞서의 제1 단계에서 제6 단계의 작업뿐 아니라, 각각의 단계에서 이루어지는 세부 작업을 의미할 수도 있 다. 또한 시뮬레이션장치는 실제 공사현장에서 진행되는 시공과정과 동일한 방법으로 건설시공모형키트를 이용 한 조립이 이루어질 때 (기)수신한 작업 데이터 및 기저장되는 건설정보모델링(BIM)을 적용한 설계정보를 근거 로 건설시공모형키트의 조립에 따른 모형을 시뮬레이션하여 화면상에 표시한다(S810). 즉 모형키트를 조립한 상 태까지의 모형의 모습이 화면상의 3차원 모델에 반영되어 화면에 표시되는 것이다. 가령 독립기초까지 조립된 모형이라면 그 독립기초까지의 3차원 모델이 화면에 표시되는 것이다. 물론 조립에 의해 오류가 있는 경우에도 그 오류가 반영된 3차원 모델이 화면에 표시되고, 다만 그 오류에 따른 코멘트가 화면에 제시될 수 있을 것이다. 도 6a 및 도 6b에서는 조립이 완료된 상태의 구조물을 잘 보여주고 있다. 물론 본 발명의 실시예에 따른 시뮬레이션장치는 3차원 모델을 화면상에 구현하기 위하여 BIM 기반으로 3 차원 모델을 생성하기 위한 프로그램 설계 동작이 사전에 이루어질 수 있다. 해당 프로그램에는 도 6a 및 도 6b 에서와 같은 모델과 관련한 모델링 데이터뿐 아니라, 실제 공사현장에서 사용되는 설계정보를 근거로 교육대상 자들에게 시공방법이나 공법과 관련해 이해도를 높이기 위한 수치데이터 등의 이해도 데이터를 더 포함하여 처 리할 수 있을 것이다. 상기한 내용 이외에도 도 1의 시뮬레이션장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞 서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모 든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각각 하 나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램 으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일시적 저 장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발 명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다."}
{"patent_id": "10-2023-0099092", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상 첨부된 자료를 참조하여 본 발명을 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 는 본 발명의 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것 을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0099092", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 건설정보모델링(BIM) 기반의 건설시공모형키트 및 시뮬레이션 시스템을 나타내 는 도면이다. 도 2는 건설시공모형키트 구성품들의 예시도이다. 도 3은 건설시공모형키트, 설계 도면 및 조립 방법을 설명하기 위한 도면이다. 도 4a 내지 도 4e는 다양한 종류의 건설 시공에 따른 건설시공모형키트의 조립 과정을 나타내는 도면이다. 도 5는 건설시공모형키트 제작 완성 모습을 보여주는 도면이다. 도 6a는 도 4a 내지 도 4e의 조립 과정에 의한 모형의 시뮬레이션 화면이다. 도 6b는 도 6a의 3차원 시뮬레이션 모델의 확대도이다. 도 7은 도 1의 시뮬레이션장치의 세부구조를 예시한 블록다이어그램이다. 도 8은 본 발명의 실시예에 따른 건설정보모델링이 접목된 건설시공모형키트의 조립에 의한 활용 방법의 흐름도 이다."}
