{"patent_id": "10-2014-0141976", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0046206", "출원번호": "10-2014-0141976", "발명의 명칭": "더덕의 인지능 개선 활성 증진을 위한 더덕의 발효 방법", "출원인": "주식회사 어람", "발명자": "이현용"}}
{"patent_id": "10-2014-0141976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "(a) 더덕을 수세하고 건조시키는 제1단계;(b) pH 6.0-6.8이고, 20-30℃에서 더덕 추출물을 포함하는 배양 배지에 발효 미생물을 접종하여 균을 활성화시키는 제2단계; 및(c) 수세 및 건조된 더덕을 절단하지 않은 상태에서, 제2단계를 통해 활성화된 발효 미생물을 접종한 후, 교반기로 지속적으로 교반시키면서 고체발효 시킨 후, 숙성시키는 단계;로 이루어지는, 더덕의 인지능 개선 활성 물질 증진을 위한 더덕의 발효 방법."}
{"patent_id": "10-2014-0141976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,더덕 추출물은 전체 중량의 0.1-0.5% 첨가하는 것을 특징으로 하는, 더덕의 인지능 개선 활성 물질 증진을 위한더덕의 발효 방법."}
{"patent_id": "10-2014-0141976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 발효 미생물은 Leuconostoc mesenteroides, Bifidobacterium longum, Lactobacillus rhamnosus,Saccharomyces exiguus, Lactobacillus acidophilus, Bifidobacterium animalis, Bifidobacterium bifidum,Lactobacillus acidophilus, Lactobacillus bulgaricus, Lactobacillus casei, Lactobacillus delbrueckii,Lactobacillus plantarum, Lactococcus diacetylactis, Lactococcus lactis, Streptococcus thermophilus,Saccharomyces cerevisiae, Rhodopseudomonas palustris, Saccharomyces fragilis, Aspergilus niger,Bacillus stearothermophilus, 및 Acetobacter xylinum로 구성된 군으로부터 선택되는 1종 이상인 것을 특징으로 하는, 더덕의 인지능 개선 활성 물질 증진을 위한 더덕의 발효 방법."}
{"patent_id": "10-2014-0141976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 발효 미생물은 Bifidobacterium longum와 Leuconostoc mesenteroides인 것을 특징으로 하는, 더덕의 인지능 개선 활성 물질 증진을 위한 더덕의 발효 방법."}
{"patent_id": "10-2014-0141976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,접종하는 발효 미생물의 양은 전체 중량 대비 1~10%인 것을 특징으로 하는, 더덕의 인지능 개선 활성 물질 증진을 위한 더덕의 발효 방법."}
{"patent_id": "10-2014-0141976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,발효 미생물을 2종 이상 접종하는 경우, 20-25시간 간격으로 순차적으로 접종하는 것을 특징으로 하는, 더덕의인지능 개선 활성 물질 증진을 위한 더덕의 발효 방법."}
{"patent_id": "10-2014-0141976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,발효 미생물을 접종시킨 더덕을 20~30℃하에서 습도를 30~70%로 유지시킨채 3~5일 동안 고체발효 시킨 후,공개특허 10-2016-0046206-3-10~15일 동안 숙성시키는 것을 특징으로 하는, 더덕의 인지능 개선 활성 물질 증진을 위한 더덕의 발효 방법."}
{"patent_id": "10-2014-0141976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 의에 제조된, 인지능 개선 활성 물질이 증진된 더덕의 발효물."}
{"patent_id": "10-2014-0141976", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 더덕의 인지능 개선 활성 증진을 위한 더덕의 발효 방법 및 그 발효물에 관한 것으로, 더욱 상세하게 는 (a) 더덕을 수세하고 건조시키는 제1단계; (b) pH 6.0-6.8이고, 20-30℃에서 더덕 추출물을 포함하는 배양 배 지에 발효 미생물을 접종하여 균을 활성화시키는 제2단계; 및 (c) 수세 및 건조된 더덕을 절단하지 않은 상태에 (뒷면에 계속)"}
{"patent_id": "10-2014-0141976", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 더덕의 발효 방법 및 그 발효물에 관한 것으로, 더욱 상세하게는 인지능 개선 활성 증진을 목적으로 하는 더덕의 발효 방법 및 그 발효물에 관한 것이다."}
{"patent_id": "10-2014-0141976", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기억한 경험을 유지하고 재현하는 기능을 인지능이라고 말하는데, 기억력을 포함한 인지능력의 저하는 학습저하, 사회활동 위축, 이로 인한 삶의 질 저하 등을 초래하므로 사회적으로도 크게 문제시 되고 있다. 기억 력 저하의 가장 대표적인 질환이 치매인데, 여러 원인에 의해 의식장애 없이 자기유지나 사회생활에 심한 장애 를 초래할 정도로 기억력, 사고력, 이해력, 계산능력, 학습능력, 언어 및 판단력 등 전체적이고 복합적인 지적 기능의 저하가 후천적으로 일어난 기질성 뇌증후군을 통틀어 말한다. 흔히 알츠하이머병(Alzheimer's disease) 이라고 일컬어지고 있는 대부분의 노인성치매는 그 발병원인에 대해서는 자세히 밝혀진 바 없으나 많은 동물실 험 및 임상연구의결과를 토대로 뇌중 아세틸콜린(acetylcholine) 량의 결핍과 -세크레타제(secretase)에 의해 생성되는 -아밀로이드(amyloid) 단백질에 의한 독성이 주원인일 것으로 추정하고 있다. 이에 따라 기억장애를 치료하는 약물은 무스카린성 아세틸콜린(acetylcholine) 수용체에 대한 효능제, 아세틸콜린 생성 촉진제, 아세 틸콜린에스테라제(acetylcholinesterase) 저해제나 -세크레타제 억제에 의해 독성단백질의 발현을 억제하는 약 물들이 개발되고 있다. 그러나 이러한 인공적 합성 약물은 체중감소, 불면증, 악몽, 근육경련 등의 부작용을 유 발시킬 가능성을 가지고 있어 부작용이 적은 생체 적합한 치료제의 개발이 시급하다. 한편, 더덕(Codonopsis lanceolata)은 초롱꽃과에 속하는 다년생 초본으로 백삼, 사삼, 행엽, 가덕, 지취 등 여 러 가지 이름으로 불리우며, 한국, 중국(만주지방), 일본의 산간지방에서 자생하나, 최근에는 널리 재배 생산되 고 있다. 더덕은 특히, 트리터페노이드(triterpenoid)계 사포닌(saponin)과 당질 및 섬유질을 함유하고 있으며, 아미노산, 무기질 외에 스테롤, 트리터페노이드(triterpenoid), 시클로아테놀(cycloartenol), N-포밀하만(N- formylharman), 1-카보메톡시-β-카볼린(l-carbomethoxy-β-carboline), 퍼롤리린(perlolyrine), 노하만 (norharman) 및 휘발성 향기성분 등을 함유하고 있다. 상기 더덕은 한방에서는 가래를 없애주는 약재로 이용되어 강장, 해열, 거담, 폐결핵 등의 치료 목적으로 사용 되어 왔으며, 또한 특유의 풍미와 탄수화물, 단백질 외에도 칼슘, 인, 철분 등 무기질과 비타민 B1, 비타민 B2 가 풍부하여 식용으로도 널리 이용되어 왔다. 이러한 더덕에 관해서는 연구를 통해 중성지질과 콜레스테롤 축적 억제를 통한 혈청지질 감소와 항산화 효과, 항바이러스, 항알러지 효과 등이 알려져 있다. 또한, 이러한 효과는 더덕에 함유된 이리도이드 글리코시드 (iridoid glycoside), 리그닌, 이소프락시딘(isofraxidin) 등에 의한 것으로 밝혀지고 있다. 그 외에 흉선세포 의 증식과 복강 마크로파지의 활성을 증가시키는 등의 약리 작용이 있고, 최근 인지능 개선 활성 또한 보고된 바 있다. 그러나 더덕은 등급외품이 40~50% 이상으로서, 재배 농가의 수익성이 악화되고 차년도 재배면적의 확대가 어려 운 실정에도 불구하고 중하위품 더덕의 가공 기술이 거의 초보적 수준에 머물러 있어 단순 양념구이 포장, 장아 찌, 배추절임, 사탕, 단순 추출에 의한 일부 화장품 소재 등으로만 소진되고 있다. 더욱이 더덕 향에 대한 기호 도의 연령별 편차가 극심하고 인삼과 대비되어 상대적으로 하위 농산품으로 인식되어 국내 및 수출용으로 개발 이 매우 저조한 상황이다. 이와 함께 더덕은 종래 뿌리작물로 조직이 치밀하게 형성되어 있어 높은 유용성분 함 량에 비해 상응하는 활성을 나타내지 못했던 활용상의 문제점이 있었다. 이에, 발효를 통해 더덕의 활성성분을 증진시키기 위한 많은 노력이 현재까지 진행되어 왔다. 예전부터 발효는 미생물의 대사 작용을 이용하여 식품의 맛, 향 및 조직감의 향상을 제공하고 유용성분의 증진 및 식품의 저장성과 영양성을 증진시키는 역할을 하여 식품의 가공에 흔히 이용되었다. 발효 더덕과 관련된 종 래 기술로는 대한민국 등록특허 제10-1150179호에는 더덕의 항균 활성 증진을 목적으로 하는 유산균 락토바실러 스 불가리쿠스의 최적배양배지를 이용한 더덕 발효 방법이 개시되어 있으며, 대한민국 공개특허 제10-2013- 0049586호에는 더덕을 55~65℃에서 30~40시간 동안 건조하거나 증숙처리공정을 거친 시료를 55~65℃에서 20~30 시간 동안 열수추출공정을 거친 후 발효하는 것을 특징으로 하는 더덕의 증숙 및 발효 공정을 이용한 생리활성 증진방법이 개시되어 있다. 이러한 식품의 발효에는 크게 액체발효법과 고체 발효법이 있다. 종래의 식품가공에서는 액체 발효법을 많이 사 용하는데, 이 액체발효법을 이용할 경우 액상으로 발효를 진행하기 때문에 세균오염의 가능성이 높아 위생상의 문제점이 따른다. 또한, 일부 발효물에서는 액체 발효 과정 중 발암물질의 배출 가능성이 제시된 바 있다. 그리 고, 기존의 고체발효의 경우 대상물질을 분쇄가공을 하지 않은 상태에서 지속되므로 발효물에 대하여 전체적으 로 고른 발효가 어렵다는 문제점이 있다. 따라서 더덕의 인지능 향상 활성물질의 용출을 증진시킴과 동시에 액체 발효에 따른 세균오염과 발암물질 생성 의 가능성을 최소화 시킬 수 있는 발효 방법과 조건의 확립이 시급하다. 이에 본 발명자들은 더덕의 인지능 향상 활성물질의 용출을 증진시킴과 동시에 종래 액체 발효에 따른 문제인 세균오염과 발암물질 생성의 가능성을 최소화 시키며, 전체적으로 고른 발효를 나타내기 위하여 연구하던 중, 발효 미생물로서 Bifidobacterium longum과 Leuconestoc mesenteroides를 이용하여 고체 발효법을 사용함으로 써 더덕의 인지능 개선 활성 물질을 증진시킬 수 있음을 발견하고 본 발명을 완성하였다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-1150179호"}
{"patent_id": "10-2014-0141976", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명의 목적은 더덕의 인지능 개선 활성 물질 증진을 위한 더덕의 발효 방법을 제공하는데 있다. 본 발명의 다른 목적은 상기 발효 방법에 의해 제조된 더덕의 발효물을 제공하는데 있다."}
{"patent_id": "10-2014-0141976", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여 본 발명은 (a) 더덕을 수세하고 건조시키는 제1단계; (b) pH 6.0-6.8이고, 20-30℃에서 더덕 추출물을 포함하는 배양 배지에 발효 미생물을 접종하여 균을 활성화시 키는 제2단계; 및 (c) 수세 및 건조된 더덕을 절단하지 않은 상태에서, 제2단계를 통해 활성화된 발효 미생물을 접종한 후, 교반 기로 지속적으로 교반시키면서 고체발효 시킨 후, 숙성시키는 단계;로 이루어지는, 더덕의 인지능 개선 활성 물 질 증진을 위한 더덕의 발효 방법을 제공한다. 또한, 본 발명은 상기 발효 방법에 의해 얻어지는 인지능 개선 활성 물질이 증진된 더덕의 발효물을 제공한다."}
{"patent_id": "10-2014-0141976", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 더덕의 인지능 향상 활성물질의 용출을 증진시킴으로써 인지능 개선에 쓰이는 화학약물과 비 교하여 인체에 대한 안전성과 낮은 부작용을 가지므로 식품 및 의약품 소재로서의 더덕 발효물의 가치가 크게 증진되고, 고체 발효를 통해 더덕을 절단하지 않고 원형 그대로 유지시키면서 전체적으로 고르게 발효시킴으로써 상품 가치가 높아지며, 종래 액체 발효에 따른 문제인 세균오염과 발암물질 생성의 가능성을 최소화 시킬 수 있다."}
{"patent_id": "10-2014-0141976", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 '발효 더덕'은 더덕을 발효시킨 발효물을 의미하며, '더덕의 발효물', '더덕 발효물' 및 '발효 더덕'은 상호교환적으로 사용될 수 있다."}
{"patent_id": "10-2014-0141976", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하, 본 발명을 상세하게 설명한다. 본 발명은, (a) 더덕을 수세하고 건조시키는 제1단계; (b) pH 6.0-6.8이고, 20-30℃에서 더덕 추출물을 포함하는 배양 배지에 발효 미생물을 접종하여 균을 활성화시 키는 제2단계; 및 (c) 수세 및 건조된 더덕을 절단하지 않은 상태에서, 제2단계를 통해 활성화된 발효 미생물을 접종한 후, 교반 기로 지속적으로 교반시키면서 고체발효 시킨 후, 숙성시키는 단계;로 이루어지는, 더덕의 인지능 개선 활성 물 질 증진을 위한 더덕의 발효 방법을 제공한다. 본 발명에 따른 더덕의 인지능 개선 활성 물질 증진을 위한 더덕의 발효 방법을 도 1을 참조하여, 보다 구체적 으로 설명하면 다음과 같다. [제1단계 : 더덕의 수세/건조 공정] 더덕을 수세하고 건조시킨다. 일반 생체상태의 더덕으로 발효시킬 수도 있으나, 발효 효율의 측면에서 수세한 더덕을 열풍 또는 원적외선 조사와 같이 통상적으로 사용되는 건조 방법을 통하여 건조한 후 수분을 제거한 다 음 발효하는 것이 바람직하다. 본 발명의 일실시예에 있어서, 수세시킨 더덕을 온풍 건조기로 2~3일간 20~30℃에서 건조시켰으나, 이에 제한되 는 것은 아니다. [제2단계 : 발효 미생물의 배양] 더덕에 미생물 접종시, 보다 효과적이고 빠른 반응을 위하여 발효 미생물을 최적의 조건의 배지에서 배양시킬 수 있다. 이때, 상기 배지는 MRS broth 배지를 사용할 수 있으며, 미생물의 활성화를 위하여 상기 배지에 더덕 추출물을 첨가하는 것이 바람직하다. 상기 더덕 추출물은 당업계에서 통상적으로 사용되는 방법, 예컨대 열수 추출, 초음파 추출 등을 이용하여 수득할 수 있으나, 이에 제한되는 것은 아니다. 구체적으로, pH 6.0-6.8이고, 20-30℃에서 더덕 추출물을 전체 중량의 0.1-0.5% 첨가한 MRS broth 배지에 발효 미생물을 접종하여 배양시킬 수 있다. 상기 발효 미생물은 Leuconostoc mesenteroides, Bifidobacterium longum, Lactobacillus rhamnosus, Saccharomyces exiguus, Lactobacillus acidophilus, Bifidobacterium animalis, Bifidobacterium bifidum, Lactobacillus acidophilus, Lactobacillus bulgaricus, Lactobacillus casei, Lactobacillus delbrueckii, Lactobacillus plantarum, Lactococcus diacetylactis, Lactococcus lactis, Streptococcus thermophilus, Saccharomyces cerevisiae, Rhodopseudomonas palustris, Saccharomyces fragilis, Aspergilus niger, Bacillus stearothermophilus, 및 Acetobacter xylinum로 구성된 군으로부터 선택되는 1종 이상일 수 있으며, 바람직하게는 Bifidobacterium longum와 Leuconostoc mesenteroides를 사용할 수 있다. [제3단계 : 발효 및 숙성공정] 본 발명은 액체 발효과정에 의해 야기될 수 있는 세균오염과 발암물질의 생성을 최소화하고, 잘게 분쇄되면 미 생물과의 적응(adaptation)이 효과적으로 이루어지지 않는 액체발효의 단점을 해소하고자, 고체 발효를 이용하 여 더덕을 원형상태로 미생물과 접종시킴으로써 보다 효과적인 적응이 이루어게 하는 것을 특징으로 한다. 고체발효를 위하여 수세 및 건조된 더덕은 절단하지 아니한 상태에서, 제2단계를 통해 활성화된 발효 미생물을 접종한다. 이때, 접종하는 발효 미생물의 양은 전체 중량 대비 1~10%인 것이 바람직한데, 상기 범위를 벗어나는 경우에는 발효가 원활하게 수행되지 않을 수 있다. 또한, 발효 미생물을 2종 이상 접종하는 경우, 동시 접종보다는 20-25시간 간격으로 순차적으로 접종하는 것이 더덕의 효과적인 발효 및 시너지 작용을 위해 바람직하다. 본 발명의 일 실시예에 있어서, Bifidobacterium longum을 먼저 접종한 다음 24시간 후 Leuconestoc mesenteroides를 접종하였으나, 이에 제한되는 것은 아니다. 발효 미생물을 접종시킨 더덕을 20~30℃하에서 습도를 30~70%로 유지시킨채 3~5일 동안 고체발효 시킨 후, 10~15일 간 숙성과정을 거친다. 이때, 더덕의 전체적으로 고른 발효를 위하여 교반기를 이용하여 발효기간 동안 지속적으로 교반시켜 주는 것이 바람직하다. 또한, 본 발명은 상기 발효 방법에 의해 제조된 인지능 개선 활성 물질이 증진된 더덕의 발효물을 제공한다. 본 발명의 더덕의 발효물은 상술한 발효 방법을 이용하여 제조된 것으로서, 양 발명의 공통된 내용은 반복 기재 에 따른 명세서의 과도한 복잡성을 피하기 위하여, 그 기재를 생략한다. 본 발명에 따른 더덕의 발효 방법에 의해 제조된 더덕 발효물은 천연물로서 인체에 대한 안전성과 낮은 부작용 을 가지며, 신경세포의 돌기를 증가시키고(도 2 참조), 돌기 길이를 증가시키며(도 3 참조), 신경세포의 살아있 는 세포수를 증가시키고(도 4 참조), 흰 쥐의 수동회피실험을 통해 인지능 개선 효과를 나타내므로(도 5 참조), 인지능 개선 및 치매와 같은 인지능 관련 질환의 치료에 유용하게 사용될 수 있다. 이하, 본 발명을 실시예에 의해 상세히 설명하기로 한다. 그러나 이들 실시예는 본 발명을 보다 구체적으로 설 명하기 위한 것으로서, 본 발명의 범위가 이들 실시예에 한정되는 것은 아니다. <실시예 1> 인지능 개선 활성 물질이 증진된 더덕의 발효물 제조 생더덕을 수세한 후 건조기를 이용하여 2일간 건조한 후, 더덕 열수추출물이 0.2% 첨가된 pH 6.5의 MRS broth 배지에서 25℃에서 배양된 Bifidobacterium longum을 전체 중량 대비 5%로 접종하여 25℃의 온도에서 30%의 습 도를 유지하여 5일간 발효시킨 후, 20℃에서 10일간 숙성시켜 더덕의 발효물을 얻었다.<실시예 2> 발효 미생물로서 Bifidobacterium longum 대신 Leuconostoc mesenteroides를 접종한 것을 제외하고는 실시예 1 과 동일한 방법으로 수행하여 더덕의 발효물을 얻었다. <실시예 3> 발효 미생물로서 Bifidobacterium longum을 전체 중량 대비 10%로 접종하여 25℃의 온도에서 50%의 습도를 유지 하여 5일간 발효후 20℃에서 10일간 숙성한 것을 제외하고는 실시예 1과 동일한 방법으로 수행하여 더덕의 발효 물을 얻었다. <실시예 4> 발효 미생물로서 Bifidobacterium longum 대신 Leuconostoc mesenteroides를 접종한 것을 제외하고는 실시예 3 과 동일한 방법으로 수행하여 더덕의 발효물을 얻었다. <실시예 5> 발효 미생물로서 Bifidobacterium longum과 Leuconostoc mesenteroides를 1:1의 비율로 혼합하여 접종한 것을 제외하고는 실시예 3과 동일한 방법으로 수행하여 더덕의 발효물을 얻었다. <실시예 6> 발효 미생물로서 Bifidobacterium longum과 Leuconostoc mesenteroides를 1:1의 비율로 순차적으로 24시간 간 격으로 접종한 것을 제외하고는 실시예 3과 동일한 방법으로 수행하여 더덕의 발효물을 얻었다. <실시예 7> 발효 미생물로서 Bifidobacterium longum과 Leuconostoc mesenteroides를 1:2의 비율로 혼합하여 접종한 것을 제외하고는 실시예 3과 동일한 방법으로 수행하여 더덕의 발효물을 얻었다. <실시예 8> 발효 미생물로서 Bifidobacterium longum과 Leuconostoc mesenteroides를 1:2의 비율로 순차적으로 24시간 간 격으로 접종한 것을 제외하고는 실시예 3과 동일한 방법으로 수행하여 더덕의 발효물을 얻었다. <실시예 9> 발효 미생물로서 Bifidobacterium longum과 Leuconostoc mesenteroides를 2:1의 비율로 혼합하여 접종한 것을 제외하고는 실시예 3과 동일한 방법으로 수행하여 더덕의 발효물을 얻었다. <실시예 10> 발효 미생물로서 Bifidobacterium longum과 Leuconostoc mesenteroides를 2:1의 비율로 순차적으로 24시간 간 격으로 접종한 것을 제외하고는 실시예 3과 동일한 방법으로 수행하여 더덕의 발효물을 얻었다. <실험예 1> In vitro에서 PC12 세포의 생육촉진 활성 측정 발효더덕의 인지능 개선을 확인하기 위하여 얻어진 실시예 6에서 제조된 더덕의 발효물(발효 더덕)을 분말로 분 쇄하여 다음과 같은 인지능 관련 실험을 시행하였다. 생더덕과 발효 더덕을 포함하는 각 시료의 신경세포 분화 활성 측정을 위해 흰쥐의 갈색세포종 (pheochromocytoma)에서 분리한 신경세포주인 PC12 신경세포를 이용하였다. PC12 세포를 5.5×102 cells/well의 농도로 24웰 플레이트에 500 ㎕를 접종하였다. 접종 24시간 후에 시료를 60 ㎍/㎖의 농도로 100 ㎕를 첨가하여 36.5℃, 5% CO2 배양기에서 배양하였다. 매일 역상 현미경(inverted microscope, ×200)하에서 사진 촬영을 실 시하여 각 세포당 생성된 평균 돌기수를 측정하여 그 결과를 도 2에 나타내었고, 세포들 가운데 신경돌기 (neurite)가 가장 길고 많은 것을 뽑아 신경돌기의 평균 길이를 측정하여 그 결과를 도 3에 나타내었다. 또한, 5일간의 배양기간 동안 트리판 블루 염색 제외 방법(Trypan Blue Dye Exclusion method: 살아 있는 세포는 이 시약에 염색되지 않음)을 이용하여 신경돌기세포의 살아있는 세포수를 측정하여 그 결과를 도 4에 나타내었다. 도 2에 나타낸 바와 같이, 생더덕의 경우에는 시간이 지나도 신경세포 분화 활성이 거의 나타나지 않았으나, 본 발명에 따라 제조된 발효 더덕의 경우에는 시간이 지남에 따라 신경세포의 분화가 활발히 일어남으로써 세포당 돌기수가 증가함을 알 수 있었고, 첨가한 발효 더덕의 양이 많을수록 세포당 돌기수는 더욱 늘어남으로써 신경 세포의 분화가 더욱 증가함을 알 수 있었다. 또한, 도 3에 나타낸 바와 같이, 본 발명에 따라 제조된 발효 더덕의 경우 신경돌기의 평균 길이 또한 생더덕을 첨가할 때보다 유의적으로 증가하는 것으로 나타났으며, 도 4에 나타낸 바와 같이, 신경돌기세포수 또한 본 발 명에 따라 제조된 발효 더덕의 경우에서 생더덕보다 약 2배 정도 많은 것으로 나타났다. 따라서, 본 발명에 따른 더덕의 발효 방법은 더덕의 인지능 개선 활성을 증가시켜 신경세포인 PC12의 신경돌기 세포수를 증가시키고 세포당 돌기수 및 신경돌기 길이 또한 증가시킴을 알 수 있다. <실험예 2> 흰 쥐의 수동회피실험 발효더덕의 인지능 개선을 확인하기 위하여 얻어진 실시예 6에서 제조된 더덕의 발효물(발효 더덕)을 분말로 분 쇄하여 다음과 같은 인지능 관련 수동회피실험을 시행하였다. 본 실험에 사용한 흰쥐는 4주령 SPF계 수컷 ICR 마우스를 사용하였다. 입수 후 일주일간 사육환경에서의 적응 기간을 거쳤다. 적응기간 중 동물의 체중을 측정하고, 선택한 동물들은 각 군의 평균체중에 맞도록 최대한 균일 하게 분포시켜 지정된 수가 되도록 하여 온도 22±2℃, 상대습도 50±5%, 환기횟수 10~15 회/hr, 조명시간 12시 간(오전 7.5 시 점등~오후 7.5 시 소등) 및 조도 150~300 Lux의 환경조건을 설정하였다. 시험군은 부형제 대조군(G1), 스코폴라민 1 ㎎/㎏ 투여군(G2), 본 발명의 실시예 4에서 제조된 발효 더덕 167 ㎎/㎏ 투여군 (G3), 발효 더덕 333 ㎎/㎏ 투여군 (G4) 및 발효 더덕 667 ㎎/㎏ 투여군(G5)으로 하여 스코폴라민 (scopolamine) 등으로 인지기능의 감퇴를 유발시킨 마우스에 일일단회 경구투여한 후, 뇌기능 개선 효과를 알아 보기 위해 다음과 같은 실험을 수행하였다. 먼저, 흰쥐를 상자에 넣고 밝은 조명을 켰다. 동시에 다른 쪽 어두운 챔버의 칸막이를 열면 본능적으로 흰쥐는 어두운 챔버로 이동하게 된다. 이때 전기적 충격을 기억시키기 위해 어두운 챔버의 문을 닫고 바닥에 20 mA의 전기를 3초간 흘려주어 전기적 충격을 가하여 이를 각인시켰다. 이를 통해 흰쥐는 조명을 밝혀도 어두운 챔버로 들어가지 못하도록 충분히 학습시켰다. 이후 24시간 후, 각 시험군에 따라 시료와 스코폴라민을 투여하여 전날 과 동일한 방법으로 실행하여 어두운 챔버로 넘어가는데 걸린 평균 시간(retention time)을 측정하였고, 부형제 대조군, 스코폴라민 단독투여군과 비교하고 그 결과를 도 5에 나타내었다. 도 5에 나타낸 바와 같이, 스코폴라민을 투여하여 인지기능이 감퇴한 흰쥐(G2)의 경우에는 전기적 충격에도 불 구하고 50초 이내로 어두운 챔버로 들어갔으나, 본 발명에 따라 제조된 발효 더덕과 스코폴라민을 함께 투여한 흰쥐(G3-G5)의 경우에는 스코폴라민을 단독으로 투여한 경우보다 밝은 챔버에서 머무른 시간이 증가함을 알 수 있었다. 특히, 본 발명에 따라 제조된 발효 더덕을 667 mg/kg으로 투여한 흰쥐(G5)의 경우에는 스코폴라민을 투 여하지 않아 인지기능이 감퇴하지 않은 정상쥐(부형제대조군, G1)와 밝은 챔버에서 머무른 시간이 거의 같은 것으로 나타났다. 따라서, 본 발명에 따른 더덕의 발효 방법에 의해 제조된 더덕 발효물은 신경세포의 돌기 및 세포수를 증가시키 고, 돌기 길이를 증가시키며, 이를 통해 인지능 개선 효과를 나타내므로, 인지능 개선 및 치매와 같은 인지능 관련 질환의 치료에 유용하게 사용될 수 있다.이제까지 본 발명에 대하여 그 바람직한 실시예들을 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통 상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고 려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2014-0141976", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 더덕의 발효 방법을 나타낸 모식도이다. 도 2는 본 발명의 일실시예에 따라 제조된 더덕 발효물을 첨가한 신경돌기세포의 평균 돌기 수를 나타낸 그래프 이다. 도 3은 본 발명의 일실시예에 따라 제조된 더덕 발효물을 첨가한 신경돌기세포의 신경돌기 평균 길이를 나타낸 그래프이다. 도 4는 본 발명의 일실시예에 따라 제조된 더덕 발효물을 첨가한 신경돌기세포의 살아있는 세포수를 나타낸 그 래프이다. 도 5는 본 발명의 일실시예에 따라 제조된 더덕 발효물을 투여한 마우스의 수동회피 시험(passive avoidance test) 결과를 나타낸 그래프이다."}
