{"patent_id": "10-2023-0136699", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0053441", "출원번호": "10-2023-0136699", "발명의 명칭": "전동식 브레이크시스템 및 그의 통신 방법", "출원인": "현대모비스 주식회사", "발명자": "김종성"}}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전동식 브레이크(EMB: Electro-Mechanical Brake)시스템의 주제어기(BCC: Brake Center Controller)와 복수의휠제어기(BWC: Brake Wheel Controller) 간의 통신 딜레이를 최소화하기 위한 통신방법으로서,통신메시지에 포함된 데이터 중 실질적인 정보를 포함하는 브레이크데이터를 기지정된 비트 수에 기초하여 생성하는 과정;통신메시지를 복수의 사이클로서 분할하여 생성하고, 상기 복수의 사이클 중 적어도 하나의 사이클에 해당하는통신메시지에 상기 브레이크데이터를 할당하는 과정;상기 주제어기의 제1 제어부와 상기 복수의 휠제어기를 연결하기 위한 제1 통신라인을 이용하여 전송될 통신메시지 및/또는 상기 주제어기의 제2 제어부와 상기 복수의 휠제어기를 연결하기 위한 제2 통신라인을 이용하여전송될 통신메시지에 상기 브레이크데이터를 할당하는 과정; 및상기 복수의 사이클에 기초하여 통신메시지를 순차적으로 전송하고, 상기 제1 통신라인과 상기 제2 통신라인을이용하여 통신메시지를 병렬적으로 전송하되, 통신메시지 중 기지정된 시간 내에 전송되지 못한 통신메시지는생략하는 과정을 포함하는, 통신방법."}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 브레이크데이터는, 차량의 요구제동력을 생성하기 위한 각 차륜의 목표클램핑력을 포함하는, 통신방법."}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 목표클램핑력은, 상기 목표클램핑력이 기지정된 비트 수에 따라 표현될 수 있는 범위를 초과하는 값인 경우, 상기 목표클램핑력의 정밀도를 수정하여 생성하는, 통신방법."}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 브레이크데이터는, 상기 목표클램핑력이 기지정된 비트 수에 따라 표현될 수 있는 범위를 초과하는 값인지여부만을 판단하기 위한 클램핑력크기데이터를 더 포함하는, 통신방법."}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3 항에 있어서,상기 목표클램핑력은, 좌측전륜에 대한 요구제동력인 FL목표클램핑력, 우측전륜에 대한 요구제동력인 FR목표클램핑력, 좌측후륜에 대한 요구제동력인 RL목표클램핑력 및 우측후륜에 대한 요구제동력인 RR목표클램핑력을 포함하되,상기 FL목표클램핑력 및 상기 FR목표클램핑력에 대해 기지정된 비트 수는, 상기 RL목표클램핑력 및 상기 RR목표클램핑력에 대해 기지정된 비트 수보다 크도록 설정된, 통신방법."}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 FL목표클램핑력 및 상기 RR목표클램핑력은, 상기 제1 통신라인을 이용하여 전송될 통신메시지 또는 상기공개특허 10-2025-0053441-3-제2 통신라인을 이용하여 전송될 통신메시지 중 하나에 할당되고,상기 FR목표클램핑력 및 상기 RL목표클램핑력은, 상기 제1 통신라인을 이용하여 전송될 통신메시지 또는 상기제2 통신라인을 이용하여 전송될 통신메시지 중 상기 FL목표클램핑력 및 상기 RR목표클램핑력이 할당되지 않은통신메시지에 할당되는, 통신방법."}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2 항에 있어서,상기 브레이크데이터는, 상기 목표클램핑력에 대응하는 제동력이 생성되었는지 여부만을 판단하기 위한 클램핑력피드백을 더 포함하는, 통신방법."}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 브레이크데이터는, 상기 복수의 사이클 중 몇 번째 사이클에 해당하는 통신메시지인지 여부에 대한 정보인사이클데이터를 포함하는, 통신방법."}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 브레이크데이터는, 각 휠에 대한 휠속 정보인 휠속데이터를 포함하고,상기 휠속데이터는, 상기 복수의 사이클 전부에 해당하는 통신메시지에 할당되는, 통신방법."}
{"patent_id": "10-2023-0136699", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "주제어기(BCC: Brake Center Controller)와 복수의 휠제어기(BWC: Brake Wheel Controller)를 포함하는 전동식브레이크(EMB: Electro-Mechanical Brake)시스템으로서,상기 주제어기의 제1 제어부와 상기 복수의 휠제어기를 연결하기 위한 제1 통신라인과 상기 주제어기의 제2 제어부와 상기 복수의 휠제어기를 연결하기 위한 제2 통신라인을 포함하되,통신메시지에 포함된 데이터 중 실질적인 정보를 포함하는 브레이크데이터는, 기지정된 비트 수에 기초하여 생성되고,상기 브레이크데이터는, 차량의 요구제동력을 생성하기 위한 각 차륜의 목표클램핑력을 포함하고, 상기 목표클램핑력이 기지정된 비트 수에 따라 표현될 수 있는 범위를 초과하는 값인 경우, 상기 목표클램핑력의 정밀도를수정하여 생성하도록 구성되는, 전동식 브레이크시스템."}
{"patent_id": "10-2023-0136699", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전동식 브레이크시스템 및 그의 통신 방법을 개시한다. 본 개시의 일 실시예에 의하면, 전동식 브레이크(EMB: Electro-Mechanical Brake)시스템의 주제어기(BCC: Brake Center Controller)와 복수의 휠제어기(BWC: Brake Wheel Controller) 간의 통신 딜레이를 최소화하는 방법으로 (뒷면에 계속)"}
{"patent_id": "10-2023-0136699", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전동식 브레이크시스템 및 그의 통신 방법에 관한 것이다."}
{"patent_id": "10-2023-0136699", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 부분에 기술된 내용은 단순히 본 개시에 대한 배경정보를 제공할 뿐 종래기술을 구성하는 것은 아니다. 차량의 제동장치는 차량을 감속 또는 정지시키거나 주차 상태를 유지하기 위해 사용되는 장치이다. 차량의 제동 장치는 마찰력을 이용하여 제동 작용을 한다. 차량의 제동장치는 차량의 탑승자의 안전과 직결된 중요한 구성 요소이다. 차량의 제동장치의 안전성과 성능을 향상시키기 위해, 제동장치로서 전동식 브레이크(EMB: Electro-Mechanical Brake)가 사용될 수 있다. 전동식 브레이크는, 운전자가 브레이크 페달(pedal)을 밟을 경우, 브레이크 캘리퍼 (caliper)를 직접 작동시키는 것이 아니라, 전기적인 신호를 이용하여 제동력을 제어하는 장치이다. 전동식 브 레이크는 각 차륜(wheel)마다 독립된 액추에이터(actuator)를 이용하여 제동 기능을 수행한다. 전동식 브레이크 는 전자제어시스템이 브레이크 작동에 개입하고, 각 차륜을 독립적으로 제어하기 때문에, 제동력을 정밀하게 제어할 수 있다. 전동식 브레이크시스템은 각 차륜에 장착된 전동식 브레이크와 이를 제어하기 위한 주제어기를 포함하는 의미이 다. 전동식 브레이크시스템은 브레이크 바이 와이어(Brake-By-Wire)로서 구성된다. 주제어기와 전동식 브레이크 에 장착된 휠제어기는 상호 통신을 수행함으로써 차량의 제동과 관련된 다양한 명령과 정보를 공유한다. 주제어 기와 휠제어기는 다양한 명령과 정보를 포함한 메시지를 생성하고, 생성된 메시지를 상호 공유한다. 한편, 주제어기와 휠제어기가 통신하기 위해 상호 전송하는 메시지의 용량은 메시지에 포함된 정보에 따라 가변 적이다. 예를 들어, 주제어기가 휠제어기에게 높은 제동력 생성 지시를 내리기 위해 생성한 메시지는, 낮은 제 동력 생성 지시를 내리기 위해 생성한 메시지와 비교하여 용량이 더 크다. 메시지의 용량이 더 클수록 전송 속 도는 느려진다. 전동식 브레이크시스템이 ABS(Anti-lock Brake System)제어를 수행하는 경우, 이와 같은 통신 딜레이는, 치명적인 악영향을 미칠 수 있다."}
{"patent_id": "10-2023-0136699", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에, 본 개시는 이러한 문제점들을 해결하기 위한 것으로서, 전동식 브레이크시스템의 통신 딜레이를 최소화하 기 위한 통신방법을 제공하는 데 주된 목적이 있다. 또한, 본 개시는 통신 딜레이가 감소함으로써 응답성능이 뛰어나고 ABS제어 성능이 향상된 전동식 브레이크시스 템을 제공하는 데 주된 목적이 있다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제 들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0136699", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위한 본 개시의 일 실시예에 의하면, 전동식 브레이크(EMB: Electro-Mechanical Brak e)시스템의 주제어기(BCC: Brake Center Controller)와 복수의 휠제어기(BWC: Brake Wheel Controller) 간의 통신 딜레이를 최소화하기 위한 통신방법으로서, 통신메시지에 포함된 데이터 중 실질적인 정보를 포함하는 브 레이크데이터를 기지정된 비트 수에 기초하여 생성하는 과정; 통신메시지를 복수의 사이클로서 분할하여 생성하 고, 상기 복수의 사이클 중 적어도 하나의 사이클에 해당하는 통신메시지에 상기 브레이크데이터를 할당하는 과 정; 상기 주제어기의 제1 제어부와 상기 복수의 휠제어기를 연결하기 위한 제1 통신라인을 이용하여 전송될 통 신메시지 및/또는 상기 주제어기의 제2 제어부와 상기 복수의 휠제어기를 연결하기 위한 제2 통신라인을 이용하 여 전송될 통신메시지에 상기 브레이크데이터를 할당하는 과정; 및 상기 복수의 사이클에 기초하여 통신메시지 를 순차적으로 전송하고, 상기 제1 통신라인과 상기 제2 통신라인을 이용하여 통신메시지를 병렬적으로 전송하 되, 통신메시지 중 기지정된 시간 내에 전송되지 못한 통신메시지는 생략하는 과정을 포함하는, 통신방법을 제 공한다. 이러한 목적을 달성하기 위한 본 개시의 일 실시예에 의하면, 주제어기(BCC: Brake Center Controller)와 복수 의 휠제어기(BWC: Brake Wheel Controller)를 포함하는 전동식 브레이크(EMB: Electro-Mechanical Brake)시스 템으로서, 상기 주제어기의 제1 제어부와 상기 복수의 휠제어기를 연결하기 위한 제1 통신라인과 상기 주제어기 의 제2 제어부와 상기 복수의 휠제어기를 연결하기 위한 제2 통신라인을 포함하되, 통신메시지에 포함된 데이터 중 실질적인 정보를 포함하는 브레이크데이터는, 기지정된 비트 수에 기초하여 생성되고, 상기 브레이크데이터 는, 차량의 요구제동력을 생성하기 위한 각 차륜의 목표클램핑력을 포함하고, 상기 목표클램핑력이 기지정된 비 트 수에 따라 표현될 수 있는 범위를 초과하는 값인 경우, 상기 목표클램핑력의 정밀도를 수정하여 생성하도록 구성되는, 전동식 브레이크시스템을 제공한다."}
{"patent_id": "10-2023-0136699", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이 본 실시예에 의하면, 전동식 브레이크시스템의 통신 딜레이를 최소화하기 위한 통신 방법을 제공할 수 있는 효과가 있다. 또한, 통신 딜레이가 감소함으로써 응답성능이 뛰어나고 ABS제어 성능이 향상된 전동식 브레이크시스템을 제공 할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0136699", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 일부 실시예들을 예시적인 도면을 이용해 상세하게 설명한다. 각 도면의 구성 요소들에 참조 부호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 개시를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 '연결', '결합' 또는 '접속'된다고 기재된 경우, 그 구성 요소는 그 다른 구 성요소에 직접적으로 연결되거나 접속될 수 있지만, 각 구성 요소 사이에 또 다른 구성 요소가 '연결', '결합' 또는 '접속'될 수도 있다고 이해되어야 할 것이다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 '포함', '구비'한다고 할 때, 이는 특별히 반대되는 기재가 없 는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서에 기재된 '…부', '모듈' 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 반대되는 기재가 없는 이상, 어느 하나의 실시예에 대한 설명은, 다른 실시예에도 적용될 수 있음을 밝혀 둔다. 첨부된 도면과 함께 이하에 개시될 발명의 설명은 본 발명의 예시적인 실시 형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있는 유일한 실시 형태를 나타내고자 하는 것이 아니다. 도 1은 본 개시의 일 실시예에 따른 전동식 브레이크시스템의 블록도이다. 도 2는 본 개시의 일 실시예에 따른 제동 제어장치가 차량에 장착된 예를 나타내는 도면이다. 도 1 및 도 2를 참조하면, 본 개시의 일 실시예에 따른 전동식 브레이크시스템(electro-mechanical brake system, 100)은, 주제어기(main controller, 110) 및 각각의 차륜에 장착된 전동식 브레이크(EMB; Electro- Mechanical Brake, 120), 브레이크 디스크(brake disc, 130) 및 휠속센서(wheel speed sensor, 140)를 포함할 수 있다. 주제어기는 차량의 제동에 필요한 요구제동력(demanded braking force)을 생성할 수 있다. 예를 들어, 주 제어기는 차량에 장착된 페달 스트로크센서(pedal stroke sensor, 미도시)로부터 페달 스트로크값(pedal stroke value)을 수신하여, 페달 스트로크값에 대응하는 요구제동력을 생성할 수 있다. 주제어기는 차량의 요구제동력을 생성하기 위해 각 차륜의 목표클램핑력(target clamping force)을 산출할 수 있다. 주제어기는 각 차륜의 목표클램핑력을 IVN(In-Vehicle-Network)을 경유하여 각 차륜에 배치되는 전동식 브레이크에게 송신할 수 있다. 여기서 IVN은, Local CAN(Controller Area Network), Flex-Ray, LIN(Local Interconnect Network) 또는 Ethernet으로서 구성될 수 있다. 전동식 브레이크는 각 차륜(21 내지 24)에 장착되어 각 차륜(21 내지 24)의 제동을 수행할 수 있다. 예를 들어, 도 2에 도시된 바와 같이, 전동식 브레이크는 좌측전륜(FL: Front Left wheel, 21), 우측전륜(FR: Front Right wheel, 22), 좌측후륜(RL: Rear Left wheel, 23) 및 우측후륜(RR: Rear Right wheel, 24)에 각각 장착되어 좌측전륜, 우측전륜, 좌측후륜 및 우측후륜의 제동을 수행할 수 있다. 전동식 브레이 크는 마찰력을 이용하여 차량의 운동에너지를 열에너지로서 변환함으로써, 차륜(21 내지 24)의 제동을 수 행할 수 있다. 전동식 브레이크는 모터(motor, 122), 가압부(pressing unit, 123), 마찰패드(friction pad, 124), 전류 센서(current sensor, 125), 모터회전각센서(motor rotation angle sensor, 126), 포스센서(force sensor, 미 도시) 및 휠제어기(wheel controller, 121)의 전부 또는 일부를 포함할 수 있다. 모터는 회전력을 생성하여 가압부에 전달할 수 있다. 모터는 직류 모터(DC Motor), 교류 모터 (AC Motor), 유도 모터(induction motor), 동기 모터(synchronous motor), 스텝 모터(step motor), 서보 모터 (servo motor), 브러시리스 모터(brushless motor), 리니어 모터(linear motor) 또는 영구자석 동기 모터 (PMSM: Permanent Magnet Synchronous Motor) 등일 수 있다. 가압부는 기어박스(gearbox, 미도시), 스크류(screw, 미도시), 너트(nut, 미도시) 및 피스톤(piston, 미 도시)의 전부 또는 일부를 포함할 수 있다. 기어박스는 복수 개의 기어를 포함할 수 있다. 기어박스는 모터로부터 전달받은 회전력을 이용하여 복수 개의 기어를 맞물려 회전시킴으로써, 회전력을 배력(amplification)할 수 있다. 예를 들어, 기어박스는 제1 기 어(first gear) 및 제2 기어(second gear)를 포함할 수 있다. 제2 기어는 제1 기어보다 직경이 작다. 제2 기어 는 모터로부터 회전력을 직접 전달받을 수 있다. 제2 기어는 제1 기어와 맞물려 회전함으로써, 회전력을 제1 기어에 전달할 수 있다. 제1 기어는 제2 기어와 비교하여 높은 회전력을 갖고 회전하기 때문에, 회전력이 배력된다. 스크류는 배력된 회전력을 기어박스로부터 전달받을 수 있다. 스크류는 배력된 회전력을 직선운동으로 변환하여 피스톤을 가압하거나 감압할 수 있다. 너트는 회전이 제한된 상태로서 배치된다. 마찰패드는 브레이크 디스크의 양 측면에 배치될 수 있다. 피스톤이 가압되는 경우, 마찰패드는 브레이크 디스크의 양측에서 가압할 수 있다. 가압부가 마찰패드를 브레이크 디스크에 대 고 가압하면, 마찰패드가 압착되고 클램핑력(clamping force)이 생성된다. 여기서 클램핑력이 발생하기 시 작하는 지점이 접점(contact point)이다. 가압부가 접점으로부터 브레이크 디스크 측으로 이동함에 따라 마찰패드가 압착되고, 마찰패드가 압착되는 정도에 따라 클램핑력은 증가된다. 전류센서는 전동식 브레이크에 실장되어 모터에 흐르는 전류를 측정하기 위해 사용될 수 있다. 예를 들어, 전류센서는 모터구동회로에 실장되는 션트저항(shunt resistor)의 양단 간의 전압차를 나타내 는 전류센서 신호를 이용하여 실제 모터전류를 측정할 수 있다. 모터회전각센서는, 전동식 브레이크에 실장되어 모터회전각을 감지하고 전압신호로 변환하여, 모터회 전각센서 신호를 아날로그 신호로서 출력할 수 있다. 예를 들어, 모터회전각센서는 사인(sine)신호 및 코 사인(cosine)신호를 아날로그 신호로서 출력할 수 있다. 포스센서는, 전동식 브레이크에 장착되어 실제 클램핑력을 감지하고 전압신호로 변환하여, 포스센서 신호 를 아날로그 신호로서 출력할 수 있다. 휠제어기는 목표클램핑력을 주제어기로부터 IVN을 경유하여 수신할 수 있다. 휠제어기는 전류센 서 신호, 모터회전각센서 신호 및 포스센서 신호를 수신할 수 있다. 휠제어기는 전류센서 신호를 이용하여 실제 모터전류를 계산하고, 모터회전각센서 신호를 이용하여 모터각 속도 및 피스톤의 실제 스트로크를 계산할 수 있다. 휠제어기는 포스센서 신호를 이용하여 클램핑력피드백을 생성할 수 있다. 이와 달리, 포스센서가 없는 경 우, 휠제어기는 피스톤의 실제 스트로크 및 실제 모터전류를 이용하여 접점 및 홈포지션(home position)을 검출함으로써 클램핑력피드백(clamping force feedback)을 생성할 수 있다. 여기서 홈포지션은, 전동식 브레이 크가 작동하지 않은 상태의 피스톤의 실제 스트로크(stroke)를 의미한다. 또 다른 예로서, 휠제어기 는 인공지능(AI: Artificial Intelligence) 엔진(engine)을 이용함으로써, 클램핑력피드백을 생성할 수 있다. 여기서 인공지능 엔진은, 전류센서 신호 및 모터회전각센서 신호를 입력받아 실제 클램핑력을 출력하도록 학습 될 수 있다. 휠속센서는 각각의 차륜(21 내지 24)의 속력을 측정할 수 있다. 휠속센서는 자기 유도식(Magnetic Induction) 휠속센서 또는 홀 효과식(Hall effect) 휠속센서로서 구성될 수 있다. 휠속센서가 자기 유도식으로서 구성되는 경우, 차륜(21 내지 24)의 회전에 따라 코일에서 자기장이 생성되고, 자기장을 휠 속센서를 이용하여 감지하도록 구성될 수 있다. 휠속센서가 자기 유도식으로서 구성되는 경우, 휠속 센서는 감지된 자기장의 세기를 측정하여 차륜(21 내지 24)의 회전 속도를 계산할 수 있다. 이와 달리, 휠속센서가 홀 효과식 휠속센서로서 구성되는 경우, 차륜(21 내지 24)의 회전에 따라 차륜(21 내지 2 4)에 장착된 자석이 홀 센서를 통과하도록 구성될 수 있다. 홀 센서는 자석이 통과할 때 발생하는 홀 효과를 측 정하여 차륜(21 내지 24)의 회전 속도를 계산할 수 있다. 도 3은 본 개시의 일 실시예에 따른 전동식 브레이크시스템의 전동식 브레이크와 주제어기 간의 통신 연결관계를 나타낸 도면이다. 도 3을 참조하면, 본 개시의 일 실시예에 따른 전동식 브레이크시스템은, 브레이크 바이 와이어(BBW: Brake By Wire)로서 구성된다. 주제어기는 제1 제어부(first control unit, 111) 및 제2 제어부(second control unit, 112)로서 이원화 되어 구성된다. 제1 제어부 및 제2 제어부는 주제어기의 중복 설계(redundancy design)에 기초 하여 통신의 신뢰성을 담보하기 위해 구비된다. 본 개시의 일 실시예에 따른 전동식 브레이크시스템은, 제1 통신라인 및 제2 통신라인을 포함한다. 제1 통 신라인은 주제어기의 제1 제어부와 복수의 휠제어기를 연결하기 위한 통신라인이다. 제2 통신라 인은 주제어기의 제2 제어부와 복수의 휠제어기를 연결하기 위한 통신라인이다. 표 1 1 FL 목표클램핑력 11 FR 클램핑력피드백 2 FR 목표클램핑력 12 RL 클램핑력피드백 3 RL 목표클램핑력 13 RR 클램핑력피드백 4 RR 목표클램핑력 14 FL 제어기 상태 5 EPB 활성화/비활성화 15 FR 제어기 상태 6 FL 휠속 16 RL 제어기 상태 7 FR 휠속 17 RR 제어기 상태 8 RL 휠속 18 제1 제어부 상태 9 RR 휠속 19 제2 제어부 상태 10 FL 클램핑력피드백 표 1은 브레이크데이터의 일 예시를 나타낸다. 브레이크데이터는 주제어기와 복수의 휠제어기가 제1 통신라인 및 제2 통신라인을 이용하여 상호 간 공유하는 데이터들을 포함한다. 브레이크데이터는 통신메시지에 포함된 데이터 중 실질적인 정보(substantial information)를 포함하는 데이터 를 의미한다. 즉, 브레이크데이터는 통신메시지에 포함된 데이터 중 식별자(ID) 및 오류체크데이터(CRC: Cyclic Redundancy Check) 등을 제외하고, 브레이크에 대한 실질적인 정보를 포함하는 데이터를 의미한다. 브레이크데이터는 주제어기 또는 휠제어기로부터 기지정된 비트 수에 기초하여 생성될 수 있다. 예를 들어, 기지정된 비트 수가 32 bit인 경우, 브레이크데이터는 32 bit를 넘지 않도록 구성되어 생성될 수 있다. 본 개시의 일 실시예에 따른 전동식 브레이크시스템은, 통신 딜레이를 최소화하기 위해, 목표클램핑력을 표현하는 정밀도(resolution)를 조절하여 목표클램핑력에 할당되는 비트 수를 줄이도록 구성된다. 목표클램핑력은 N 단위의 힘으로서 표현되기 때문에, 브레이크데이터 중 가장 많은 비트 수를 차지한다. 예를 들어, 차량의 제동을 수행하기 위해, 차량의 각 휠은 50 kN 이상의 목표클램핑력이 할당될 수 있다. 50 kN 이상 의 목표클램핑력을 디지털화하여 전송하기 위해서는, 최소 16 bit가 필요하다. 본 개시에 따른 전동식 브레이크 시스템은, 목표클램핑력에 할당되는 비트 수를 줄임으로써 통신 딜레이를 최소화할 수 있다. 본 개시에 따 른 전동식 브레이크시스템은, 목표클램핑력에 할당되는 비트 수를 줄이기 위해, 목표클램핑력을 표현하는 정밀도(resolution)를 조절하도록 구성된다. 즉, 주제어기는 목표클램핑력이 기지정된 비트 수에 따라 표 현될 수 있는 범위를 초과하는 값인 경우, 정밀도를 수정하여 생성한다. 표 2 Max. Force Resolution Usable Max. Force of the Usable Max. Force 16bit65,535N 1N 65,535N 15bit32,767N 10N 327,670N14bit16,383N 10N 163,830N 13bit 8,191N 10N 81,910N 12bit 4,095N 100N 409,500N 11bit 2,047N 100N 204,700N 10bit 1,023N 100N 102,300N 9bit 511N 100N 51,100N 8bit 255N 1000N 255,000N 표 2의 Max. Force 항목은, 목표클램핑력에 할당되는 비트 수에 따라, 표현 가능한 최대 클램핑력 크기를 나타 낸다. 표 2의 Usable Max. Force 항목은, 목표클램핑력이 기지정된 비트 수에 따라 표현될 수 있는 범위를 초과 하는 값인 경우, 정밀도가 수정됨으로써 표현 가능한 최대 클램핑력 크기를 나타낸다. 정밀도를 조절함으로써 목표클램핑력을 표현하는 방법의 예시는 다음과 같다. 목표클램핑력의 표현이 10 bit로 서 제한되는 경우, 1,023 N 이하의 값은 그대로 표현되고, 1,023 N을 초과하는 값은 정밀도 100 N을 적용한 값 으로서 표현되어 전송된다. 예를 들어, 전송될 목표클램핑력이 2,431 N이라면, 2,400 N으로서 전송될 수 있다. 차량의 제동에서 높은 정밀도의 클램핑력 제어는, 클램핑력이 낮은 경우 중요하기 때문에, 목표클램핑력이 높은 경우 정밀도를 낮추어도 문제되지 않는다. 전술한 예시와 같이 정밀도를 조절하여 목표클램핑력을 표현하기 위해, 목표클램핑력이 1,023 N을 초과하는 값 인지 여부를 표현하는 비트가 한 개가 더 필요하다. 하지만, 비트가 추가되는 문제는, 후륜에 할당되는 목표클 램핑력의 비트 수를 전륜에 할당되는 목표클램핑력의 비트 수보다 작도록 설정함으로써 해결될 수 있다. 차량의 제동에 있어서, 제동 효율로 인해 전륜의 제동력보다 후륜의 제동력이 더 작도록 설정되므로, 후륜에 할당되는 목표클램핑력의 비트 수를 전륜에 할당되는 목표클램핑력의 비트 수보다 작도록 설정하여도 문제가 발생하지 않 는다. 전술한 방법과 같이 목표클램핑력의 비트 수를 줄이는 경우, 50 kN 크기를 표현하기 위한 목표클램핑력에 16 bit 미만의 비트 수를 할당할 수 있기 때문에, 통신 딜레이를 감소시킬 수 있는 효과가 있다. 본 개시의 다른 실시예에 따른 전동식 브레이크시스템은, 통신 딜레이를 최소화하기 위해, 클램핑력피드백 을 구체적인 값이 아닌 참/거짓(true/false)으로만 표현하여 비트 수를 줄이도록 구성된다. 예를 들어, 휠제어 기가 참 값을 가지는 클램핑력피드백을 브레이크데이터에 포함시켜 주제어기에게 전송한 경우, 주제 어기는 목표클램핑력과 클램핑력피드백이 일정 범위 내에서 동일함을 감지하고, 그에 따른 제어를 수행할 수 있다. 전술한 방법과 같이 클램핑력피드백을 참/거짓으로만 표현하는 경우, 클램핑력피드백에 각 휠 당 1 bit만 할당 해도 되기 때문에, 통신 딜레이를 감소시킬 수 있는 효과가 있다. 본 개시의 또 다른 실시예에 따른 전동식 브레이크시스템은, 통신 딜레이를 최소화하기 위해, 통신메시지 를 복수의 사이클로서 분할하여 생성하고, 복수의 사이클 및 제1 통신라인과 제2 통신라인에 브레이크데이터를 분할하여 할당하도록 구성된다. 구체적으로, 브레이크데이터를 할당하는 과정은 다음과 같다. 통신메시지에 포함된 데이터 중 실질적인 정보를 포함하는 브레이크데이터를 기지정된 비트 수에 기초하여 생성 한다. 브레이크데이터는 주제어기 또는 휠제어기로부터 생성된다. 브레이크데이터가 생성되는 상세한 과정은 전술한 바와 동일하므로, 이에 대한 상세한 설명은 생략한다. 통신메시지를 복수의 사이클로서 분할하여 생성하고, 복수의 사이클 중 적어도 하나의 사이클에 해당하는 통신 메시지에 브레이크데이터를 할당한다. 브레이크데이터를 복수의 사이클의 통신메시지에 할당하기 위해, 브레이 크데이터는 통신메시지가 몇 번째 사이클인지에 대한 정보인 사이클데이터를 포함하여야 하기 때문에, 복수의 사이클은 네 개의 사이클로서 구성되는 것이 바람직하나, 이에 한정되지 않는다. 복수의 사이클이 네 개의 사이 클로서 구성되는 경우, 사이클데이터는 2 bit만으로 표현이 가능하다. 예를 들어, 00은 첫 번째 사이클의 통신 메시지를 의미하고, 01은 두 번째 사이클의 통신메시지를 의미하고, 10은 세 번째 사이클의 통신메시지를 의미 하며, 11은 네 번째 사이클의 통신메시지를 의미하도록 설정될 수 있다. 제1 통신라인을 이용하여 전송될 통신메시지 및/또는 제2 통신라인을 이용하여 전송될 통신메시지에 브레이크데 이터를 할당한다. 브레이크데이터를 제1 통신라인 및/또는 제2 통신라인에 할당함으로써, 한 개의 통신메시지의 용량을 줄일 수 있고, 통신라인의 리던던시 설계의 효과도 발생할 수 있다. 복수의 사이클에 기초하여 통신메시지를 순차적으로 전송하고, 제1 통신라인과 상기 제2 통신라인을 이용하여 통신메시지를 병렬적으로 전송하되, 통신메시지 중 기지정된 시간 내에 전송되지 못한 통신메시지는 생략한다. 예를 들어, 복수의 사이클이 네 개의 사이클이고, 기지정된 시간이 4 ms인 경우, 4 ms 동안 세 개의 사이클에 해당하는 통신메시지가 전송되었다면, 네 번째 통신메시지는 생략되고 다시 첫 번째 통신메시지가 전송된다. 전술한 설명에 기초하여, 브레이크데이터의 비트 수 제한이 32 bit인 경우의 브레이크데이터 할당에 대한 상세 한 내용을 정리하면, 표 3 내지 표 6와 같이 표현될 수 있다. 표 3 사이클데이터 1/2/3/4 FL 클램핑력피드백 x/x/x/4 FL 목표클램핑력 1/2/3/x FR 클램핑력피드백 x/x/x/4 FR 목표클램핑력 1/2/3/x RL 클램핑력피드백 x/x/x/4 RL 목표클램핑력 1/2/3/x RR 클램핑력피드백 x/x/x/4 RR 목표클램핑력 1/2/3/x FL 제어기 상태 x/x/x/4 EPB 활성화/비활성화 x/x/x/4 FR 제어기 상태 x/x/x/4 FL 휠속 1/2/3/4 RL 제어기 상태 x/x/x/4 FR 휠속 1/2/3/4 RR 제어기 상태 x/x/x/4 RL 휠속 1/2/3/4 제1 제어부 상태 x/x/x/4 RR 휠속 1/2/3/4 제2 제어부 상태 x/x/x/4 표 3은 브레이크데이터의 일 실시예를 나타내고, 각각의 브레이크데이터가 통신메시지의 복수의 사이클 중 어떠 한 사이클에 할당되는지 나타낸다. 예를 들어, 사이클데이터는 첫 번째 내지 네 번째 사이클 모두에 포함되는 정보이다. 목표클램핑력(target clamping force)은 첫 번째 내지 세 번째 사이클에 포함되는 정보이고, 네 번째 사이클에는 포함되지 않는 정보이다. 이와 달리, 휠제어기 상태 및 제어부 상태는 첫 번째 내지 세 번째 사이클 에 포함되지 않는 정보이고, 네 번째 사이클에는 포함되는 정보이다. 브레이크데이터 중 브레이크 제어에 중요한 정보는 초기 사이클에 할당되고, 다수의 사이클에 할당되도록 구성 된다. 이와 달리, 휠제어기 상태 및 제어부 상태와 같이, 빠르게 전송될 필요가 없는 정보는 후반 사이클에 할 당되고, 소수의 사이클에만 할당되도록 구성된다. 예를 들어, 휠속은 ABS(Anti-lock Brake System)제어 등을 수 행하기 위해, 주제어기와 휠제어기 간의 빠른 정보 공유가 필요하다. 따라서, 휠속은 모든 사이클에 해당하는 통신메시지에 포함되는 정보로서 구성된다. 표 4 제1 통신라인 제2 통신라인 cycle 1/2/3 4 1/2/3 4 사이클데이터 2 2 2 2 FL 목표클램핑력 10 N/A N/A N/A FR 목표클램핑력 10 N/A N/A N/A RL 목표클램핑력 N/A N/A 10 N/A RR 목표클램핑력 N/A N/A 10 N/A EPB 활성화/비활성화 N/A 1 N/A 1 FL 휠속 5 5 N/A N/A FR 휠속 5 5 N/A N/A RL 휠속 N/A N/A 5 5 RR 휠속 N/A N/A 5 5 FL 클램핑력피드백 N/A 1 N/A 1 FR 클램핑력피드백 N/A 1 N/A 1 RL 클램핑력피드백 N/A 1 N/A 1 RR 클램핑력피드백 N/A 1 N/A 1 FL 제어기 상태 N/A 1 N/A 1 FR 제어기 상태 N/A 1 N/A 1 RL 제어기 상태 N/A 1 N/A 1 RR 제어기 상태 N/A 1 N/A 1 제1 제어부 상태 N/A 1 N/A 1 제2 제어부 상태 N/A 1 N/A 1Total 32 23 32 23 표 4는 표 3에 기초하여 할당된 브레이크데이터의 비트 수를 나타낸다. 표 4는 기설정된 비트 수가 32 bit인 경 우를 가정한 표이다. 표 3 및 표 4에 나타난 브레이크데이터의 일 실시예는, 목표클램핑력의 정밀도가 일정하도록 구성된다. 예를 들 어, 브레이크데이터의 일 실시예와 같이 목표클램핑력에 10 bit가 할당되는 경우, 휠제어기가 인식할 수 있는 최소단위의 힘은 100 N이다. 브레이크데이터의 일 실시예가 적용된 전동식 브레이크시스템은, 목표클 램핑력에 10 bit만 할당되더라도, 휠제어기가 인식할 수 있는 최소단위의 힘을 100 N으로서 정밀도를 조절 함으로써, 102,300 N의 목표클램핑력까지도 주제어기로부터 휠제어기에 정상적으로 송신할 수 있다. 본 개시의 일 실시예에 따른 전동식 브레이크 시스템이 클렘핑력크기데이터를 이용하여 브레이크데이터의 목표클램핑력을 주고받는 과정은 다음과 같다. 주제어기가 휠제어기에 903 N의 목표클램핑력을 송신하는 경우, 주제어기는 휠제어기에게 송신할 통신데이터에 9 N(수정될 정밀도에 따라 상이)의 목표클램핑력을 포함하는 브레이크데이터를 삽입한다. 휠제어기가 이와 같은 통신데이터를 수신하는 경우, 휠제어기는 목표클램핑력의 정밀도를 수정하고, 즉, 100 N 단위로서(여기서 100 N은 예시일 뿐임) 목표클램핑력을 해석한다. 다시 말해, 휠제어기는 목표 클램핑력이 900 N이라고 인식하게 된다. 본 개시의 일 실시예에 따른 전동식 브레이크 시스템이 클렘핑력크기데이터를 이용하여 브레이크데이터의 목표클램핑력을 주고받는 과정의 다른 예시로서, 주제어기가 휠제어기에 2,102 N의 목표클램핑력을 송신하는 경우, 주제어기는 휠제어기에게 송신할 통신데이터에 21 N의 목표클램핑력을 포함하는 브레 이크데이터를 삽입한다. 휠제어기가 이와 같은 통신데이터를 수신하는 경우, 휠제어기는 목표클램핑 력의 정밀도를 수정하고, 즉, 100 N 단위로서 목표클램핑력을 해석한다. 다시 말해, 휠제어기는 목표클램 핑력이 2,100 N이라고 인식하게 된다. 표 5 사이클데이터 1/2/3/4 FL 클램핑력피드백 x/x/x/4 클램핑력크기데이터 1/2/3/x FR 클램핑력피드백 x/x/x/4 FL 목표클램핑력 1/2/3/x RL 클램핑력피드백 x/x/x/4 FR 목표클램핑력 1/2/3/x RR 클램핑력피드백 x/x/x/4 RL 목표클램핑력 1/2/3/x FL 제어기 상태 x/x/x/4 RR 목표클램핑력 1/2/3/x FR 제어기 상태 x/x/x/4 EPB 활성화/비활성화 x/x/x/4 RL 제어기 상태 x/x/x/4 FL 휠속 1/2/3/4 RR 제어기 상태 x/x/x/4 FR 휠속 1/2/3/4 제1 제어부 상태 x/x/x/4 RL 휠속 1/2/3/4 제2 제어부 상태 x/x/x/4 RR 휠속 1/2/3/4 표 5는 브레이크데이터의 다른 실시예를 나타내고, 각각의 브레이크데이터가 통신메시지의 복수의 사이클 중 어 떠한 사이클에 할당되는지 나타낸다. 표 6 제1 통신라인 제2 통신라인 cycle 1/2/3 4 1/2/3 4 사이클데이터 2 2 2 2 클램핑력크기데이터 1 N/A 1 N/A FL 목표클램핑력 10 N/A N/A N/A FR 목표클램핑력 N/A N/A 10 N/A RL 목표클램핑력 N/A N/A 9 N/A RR 목표클램핑력 9 N/A N/A N/A EPB 활성화/비활성화 N/A 1 N/A 1 FL 휠속 5 5 N/A N/AFR 휠속 5 5 N/A N/A RL 휠속 N/A N/A 5 5 RR 휠속 N/A N/A 5 5 FL 클램핑력피드백 N/A 1 N/A 1 FR 클램핑력피드백 N/A 1 N/A 1 RL 클램핑력피드백 N/A 1 N/A 1 RR 클램핑력피드백 N/A 1 N/A 1 FL 제어기 상태 N/A 1 N/A 1 FR 제어기 상태 N/A 1 N/A 1 RL 제어기 상태 N/A 1 N/A 1 RR 제어기 상태 N/A 1 N/A 1 제1 제어부 상태 N/A 1 N/A 1 제2 제어부 상태 N/A 1 N/A 1 Total 32 23 32 23 표 6은 표 5에 따라 할당된 브레이크데이터의 비트 수를 나타낸다. 표 6은 표 4와 같이 기설정된 비트 수가 32 bit인 경우를 가정한 표이다. 표 6을 참조하면, 표 4의 브레이크데이터의 일 실시예와 달리 브레이크데이터의 다른 실시예는 클램핑력크기데 이터를 추가적으로 포함한다. 클램핑력크기데이터에는 1 bit가 할당되어 목표클램핑력이 기지정된 비트 수에 따 라 표현될 수 있는 범위를 초과하는 값인지 여부에 대한 정보가 포함된다. 예를 들어, 클램핑력크기데이터가 0 인 경우, 목표클램핑력이 기지정된 비트 수에 따라 표현될 수 있는 범위를 초과하지 않음을 표현하고, 클램핑력 크기데이터가 1인 경우, 목표클램핑력이 기지정된 비트 수에 따라 표현될 수 있는 범위를 초과함을 표현한다. 본 개시의 다른 실시예에 따른 전동식 브레이크 시스템은, 클램핑력크기데이터에 기초하여 목표클램핑력이 기지정된 비트 수에 따라 표현될 수 있는 범위를 초과하는지 여부를 판단하고, 초과하는 경우 목표클램핑력의 정밀도를 낮추고, 초과하지 않는 경우 목표클램핑력의 정밀도를 높임으로써, 데이터를 절약하더라도 상황에 따 라 제동력을 정밀하게 제어할 수 있는 효과가 있다. 본 개시의 다른 실시예에 따른 전동식 브레이크 시스템이 클렘핑력크기데이터를 이용하여 브레이크데이터 의 목표클램핑력을 주고받는 과정은 다음과 같다. 주제어기가 휠제어기에 903 N의 목표클램핑력을 송신하는 경우, 주제어기는 휠제어기에게 송신할 통신데이터에 903 N의 목표클램핑력과, 목표클램핑력이 기지정된 비트 수에 따라 표현될 수 있는 범위를 초과하지 않음을 나타내는 0 값의 클램핑력크기데이터를 포함하는 브레이크데이터를 삽입한다. 휠제어기가 이와 같은 통신데이터를 수신하는 경우, 휠제어기는 목표클램핑력의 정밀도를 수정하지 않고, 즉, 1 N 단 위로서 목표클램핑력을 해석한다. 이와 달리, 주제어기가 휠제어기에 2,102 N의 목표클램핑력을 송신하는 경우, 주제어기는 휠제 어기에게 송신할 통신데이터에 21 N의 목표클램핑력과, 목표클램핑력이 기지정된 비트 수에 따라 표현될 수 있는 범위를 초과함을 나타내는 1 값의 클램핑력크기데이터를 포함하는 브레이크데이터를 삽입한다. 휠제어 기가 이와 같은 통신데이터를 수신하는 경우, 휠제어기는 목표클램핑력의 정밀도를 수정하고, 즉, 100 N 단위로서 목표클램핑력을 해석한다. 다시 말해, 휠제어기는 목표클램핑력이 2,100 N이라고 인식하게 된다. 전술한 예시들로부터 볼 수 있는 것과 같이, 클램핑력크기데이터가 0인 경우, 휠제어기는 목표클램핑력의 정밀도를 수정하지 않고(1 N의 단위로서) 목표클램핑력을 인식한다. 이와 달리, 클램핑력크기데이터가 1인 경우, 휠제어기는 표현하려는 목표클램핑력의 정밀도를 수정하여(10 N 또는 100 N 등의 단위로서) 목표클 램핑력을 인식한다. 본 개시의 다른 실시예에 따른 전동식 브레이크 시스템은, 전술한 예시들과 같이 데이터를 절약하여 통신 데이터를 생성하더라도, 정밀한 단위의 제어가 중요한 낮은 클램핑력의 제어 구간에서는 1 N 단위로 클램핑력을 제어하고, 비교적 정밀한 단위의 제어가 중요하지 않은 큰 클램핑력의 제어 구간에서는 정밀도를 수정한(수정될 정밀도의 단위는 10 N 또는 100 N 등 다양하게 설정될 수 있음) 단위로서 클램핑력을 제어하여, 안정적인 제동 제어를 구현할 수 있다. 다만, 클램핑력크기데이터가 추가됨으로써, 브레이크데이터에 총 33 bit가 할당되게 되는데, 이를 32 bit로서 맞추어 할당하기 위해, 목표클램핑력의 비트 수를 조절한다. 일반적으로 각 휠에 할당되는 목표클램핑력은 전륜과 비교하여 후륜이 더 낮다. 이를 이용하여 브레이크데이터 를 32 bit로서 맞추어 할당하기 위해, 후륜의 목표클램핑력에(RL목표클램핑력 및 RR목표클램핑력) 전륜의 목표 클램핑력(FL목표클램핑력 및 FR목표클램핑력)보다 1 bit씩 적게 할당한다. 또한, 브레이크데이터의 다른 실시예에서, FL목표클램핑력 및 RR목표클램핑력은 제1 통신라인에 할당되고, FR목 표클램핑력 및 RL목표클램핑력은 제2 통신라인에 할당된다. 이와 같이, X-split 구조로서 목표클램핑력 통신라 인을 설계한 이유는, 통신라인의 리던던시 설계를 위함이다. 전술한 바와 같이, 본 개시의 다른 실시예에 따른 브레이크데이터에는, 전륜의 목표클램핑력이 후륜의 목표클램핑력과 비교하여 더 많은 비트 수가 할당되고, 이 에 따라 전륜의 목표클램핑력이 후륜의 목표클램핑력과 비교하여 더욱 정밀하게 클램핑력의 정보전달이 가능하 다. 만약 본 개시와 달리 전륜의 목표클램핑력 및 후륜의 목표클램핑력 각각이 동일한 통신라인에 할당된다면, 한 개의 통신라인의 고장 발생에 큰 영향을 받을 수 있다. 따라서, 한 개의 통신라인의 고장 발생에 따른 영향 을 최소화하기 위해, 본 개시는, X-split 구조로서 구성된 목표클램핑력 통신라인을 제공한다. 이상의 설명은 본 실시예의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 실시예가 속하는 기술 분 야에서 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변 형이 가능할 것이다. 따라서, 본 실시예들은 본 실시예의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위 한 것이고, 이러한 실시예에 의하여 본 실시예의 기술 사상의 범위가 한정되는 것은 아니다. 본 실시예의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 실시예의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0136699", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 전동식 브레이크시스템의 블록도이다. 도 2는 본 개시의 일 실시예에 따른 제동 제어장치가 차량에 장착된 예를 나타내는 도면이다. 도 3은 본 개시의 일 실시예에 따른 전동식 브레이크시스템의 전동식 브레이크와 주제어기 간의 통신 연결관계 를 나타낸 도면이다."}
