{"patent_id": "10-2022-0137342", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0057491", "출원번호": "10-2022-0137342", "발명의 명칭": "골프 관련 정보를 제공하는 가상 골프 장치 및 가상 골프 시스템", "출원인": "(주)에스지엠", "발명자": "이의범"}}
{"patent_id": "10-2022-0137342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가상의 골프코스를 표시하는 표시부;사용자가 실제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에 있어서의 상기 실제 골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출부; 및정보제공요건이 충족되는 경우에 사용자에게 골프 관련 정보를 제공하기 위한 정보 제공부를; 포함하는 가상 골프 장치."}
{"patent_id": "10-2022-0137342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 정보제공요건은 상기 가상의 골프코스에 있어서 사용자의 가상의 골프공이 처해 있는 상황에 따라 달라질수 있는 가상 골프 장치."}
{"patent_id": "10-2022-0137342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제공되는 골프 관련 정보는 상기 가상의 골프코스에 있어서 사용자의 가상의 골프공이 처해 있는 상황에따라 달라질 수 있는 가상 골프 장치."}
{"patent_id": "10-2022-0137342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 골프 관련 정보는 상기 골프 관련 정보를 제공받는 사용자의 개인성향에 따라 달라질 수 있는 가상 골프장치."}
{"patent_id": "10-2022-0137342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "가상의 골프코스를 표시하는 표시부;사용자가 실제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에 있어서의 상기 실제 골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출부; 및사용자에게 골프 관련 정보를 제공하기 위한 정보 제공부를;포함하고,상기 정보 제공부에서 제공하는 골프 관련 정보는 골프 플레이 정보, 골프 플레이 어드바이스 및 사용자 미션중 적어도 어느 하나를 포함하며, 상기 골프 관련 정보를 제공받는 사용자의 개인성향에 따라 제공되는 정보가달라질 수 있는가상 골프 장치"}
{"patent_id": "10-2022-0137342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 사용자의 개인성향은 MBTI에 따른 사용자 성격유형을 포함하는 가상 골프 장치."}
{"patent_id": "10-2022-0137342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0057491-3-서비스 장치; 상기 서비스 장치와 통신상으로 연결되는 적어도 하나 이상의 가상 골프 장치; 및정보제공요건이 충족되는 경우에 사용자에게 골프 관련 정보를 제공하기 위한 정보 제공부를;포함하고,상기 가상 골프 장치는, 가상의 골프코스를 표시하는 표시부 및, 사용자가 실제 골프공을 타격하면 타격된 실제골프공의 상태에 근거하여 상기 가상의 골프코스에 있어서의 상기 실제 골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출부를 포함하는가상 골프 시스템."}
{"patent_id": "10-2022-0137342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "서비스 장치; 상기 서비스 장치와 통신상으로 연결되는 적어도 하나 이상의 가상 골프 장치; 및사용자에게 골프 관련 정보를 제공하기 위한 정보 제공부를;포함하고,상기 가상 골프 장치는, 가상의 골프코스를 표시하는 표시부 및, 사용자가 실제 골프공을 타격하면 타격된 실제골프공의 상태에 근거하여 상기 가상의 골프코스에 있어서의 상기 실제 골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출부를 포함하며,상기 정보 제공부에서 제공하는 정보는 골프 플레이 정보, 골프 플레이 어드바이스 및 사용자 미션 중 적어도어느 하나를 포함하며, 상기 정보를 제공받는 사용자의 개인성향에 따라 상기 제공되는 정보가 달라질 수 있는가상 골프 시스템."}
{"patent_id": "10-2022-0137342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항 또는 제8항에 있어서,상기 정보 제공부는 상기 서비스 장치 또는 상기 가상 골프 장치에 구비되는 가상 골프 시스템."}
{"patent_id": "10-2022-0137342", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 골프 관련 정보를 제공하는 가상 골프 장치 및 가상 골프 시스템을 제공한다. 상기 가상 골프 장치는 가상의 골프코스를 표시하는 표시부, 사용자가 실제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에 있어서의 상기 실제 골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출부, 및 정보제공요건이 충족되는 경우에 사용자에게 골프 관련 정보를 제공하기 위한 정보 제공부를 포함한다."}
{"patent_id": "10-2022-0137342", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가상 골프 장치 및 가상 골프 시스템에 관한 것으로, 보다 상세하게는 스크린 골프와 같은 가상 골프 플레이를 하는 사용자에게 골프 관련 정보를 제공하는 가상 골프 장치 및 가상 골프 시스템에 관한 것이다."}
{"patent_id": "10-2022-0137342", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 골프 인구가 증가하면서, 가상 골프 장치 등을 이용하여 골프를 즐길 수 있는 스크린 골프가 널리 보급되 고 있다. 스크린 골프에서는 스크린을 통하여 골프장의 영상이 표시되어 마치 야외에서 실제의 골프 경기를 하 고 있는 듯한 느낌을 주면서도 야외의 필드에서 경기하는 것에 비해 시간과 비용이 세이브되기 때문에, 스크린 골프는 시간이나 경제적인 이유 등으로 실제 골프장에서 골프를 하기 어려운 현대인들에게 인기가 높다. 스크린 골프와 실제 골프를 비교하면, 스크린 골프는 밀폐된 실내 공간에서 서비스되는 특성상 오픈된 야외 공 간에서 이루어지는 실제 골프에서 제공하기 어려운 기술적 서비스를 사용자에게 제공할 수 있는 장점이 있다. 따라서 스크린 골프에 사용되는 가상 골프 장치에서는 실제 골프장에서는 제공하기 어려운 스크린 골프에 특화 된 서비스를 제공함으로써 사용자의 편의를 도모하고 흥미를 고취시킬 필요가 있다."}
{"patent_id": "10-2022-0137342", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2022-0137342", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 사정을 감안하여 발명된 것으로, 사용자가 처한 상황에 부합하는 유용한 골프 플레이 정보나 사용자의 개인성향을 감안한 여러가지 골프 관련 정보를 알려줄 수 있는 가상 골프 장치를 제공하는 것을 그 목 적으로 한다. 또한 본 발명은 사용자가 처한 상황에 부합하는 유용한 골프 플레이 정보나 사용자의 개인성향을 감안한 여러가 지 골프 관련 정보를 알려줄 수 있는 가상 골프 시스템을 제공하는 것을 그 목적으로 한다. 또한 본 발명의 다른 목적들은 이하의 설명과 첨부한 도면으로부터 명확하게 이해될 수 있다."}
{"patent_id": "10-2022-0137342", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 실시예에 따른 가상 골프 장치는 가상의 골프코스를 표시하는 표시부, 사용자가 실제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에 있어서의 상 기 실제 골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출부, 및 정보제공요건이 충족되는 경우에 사 용자에게 골프 관련 정보를 제공하기 위한 정보 제공부를 포함한다. 상기 가상 골프 장치에 있어서, 상기 정보제공요건은 상기 가상의 골프코스에 있어서 사용자의 가상의 골프공이 처해 있는 상황에 따라 달라질 수 있다. 상기 가상 골프 장치에 있어서, 상기 제공되는 골프 관련 정보는 상기 가상의 골프코스에 있어서 사용자의 가상 의 골프공이 처해 있는 상황에 따라 달라질 수 있다. 상기 가상 골프 장치에 있어서, 상기 골프 관련 정보는 상기 골프 관련 정보를 제공받는 사용자의 개인성향에 따라 달라질 수 있다. 본 발명의 다른 실시예에 따른 가상 골프 장치는 가상의 골프코스를 표시하는 표시부, 사용자가 실제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에 있어서의 상기 실제 골프공에 대응하 는 가상의 골프공의 움직임을 산출하는 산출부, 및 사용자에게 골프 관련 정보를 제공하기 위한 정보 제공부를 포함한다. 또한 상기 정보 제공부에서 제공하는 골프 관련 정보는 골프 플레이 정보, 골프 플레이 어드바이스 및 사용자 미션 중 적어도 어느 하나를 포함하며, 상기 골프 관련 정보를 제공받는 사용자의 개인성향에 따라 제공되는 정보가 달라질 수 있다. 상기 가상 골프 장치에 있어서, 상기 사용자의 개인성향은 MBTI에 따른 사용자 성격유형을 포함할 수 있다. 본 발명의 실시예에 따른 가상 골프 시스템은 서비스 장치, 상기 서비스 장치와 통신상으로 연결되는 적어도 하 나 이상의 가상 골프 장치, 및 정보제공요건이 충족되는 경우에 사용자에게 골프 관련 정보를 제공하기 위한 정 보 제공부를 포함한다. 여기에서 상기 가상 골프 장치는, 가상의 골프코스를 표시하는 표시부 및, 사용자가 실 제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에 있어서의 상기 실제 골프 공에 대응하는 가상의 골프공의 움직임을 산출하는 산출부를 포함한다. 본 발명의 다른 실시예에 따른 가상 골프 시스템은 서비스 장치, 상기 서비스 장치와 통신상으로 연결되는 적어 도 하나 이상의 가상 골프 장치, 및 사용자에게 골프 관련 정보를 제공하기 위한 정보 제공부를 포함한다. 여기 에서 상기 가상 골프 장치는, 가상의 골프코스를 표시하는 표시부 및, 사용자가 실제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에 있어서의 상기 실제 골프공에 대응하는 가상의 골프공 의 움직임을 산출하는 산출부를 포함한다. 또한 상기 정보 제공부에서 제공하는 정보는 골프 플레이 정보, 골프 플레이 어드바이스 및 사용자 미션 중 적어도 어느 하나를 포함하며, 상기 정보를 제공받는 사용자의 개인성향 에 따라 상기 제공되는 정보가 달라질 수 있다. 상기 가상 골프 시스템에 있어서, 상기 정보 제공부는 상기 서비스 장치 또는 상기 가상 골프 장치에 구비될 수 있다."}
{"patent_id": "10-2022-0137342", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 플레이 중인 사용자가 처한 상황에 부합하는 유용한 골프 플레이 정보를 사용자에게 제공할 수 있는 효과가 있다. 또한 사용자의 개인성향을 고려한 여러가지 골프 관련 정보를 제공함으로써 사용자의 흥 미를 고취시킬 수 있는 효과가 있다."}
{"patent_id": "10-2022-0137342", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예들을 통하여 본 발명을 상세하게 설명한다. 본 발명의 목적, 특징, 장점은 이하의 실시예들을 통해 쉽게 이해될 것이다. 본 발명은 여기서 설명되는 실시예들에 한정되지 않고, 다른 형태로 구체화될 수도 있다. 여기서 소개되는 실시예들은 개시된 내용이 철저하고 완전해질 수 있도록 그리고 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 따라서, 이하의 실시예들에 의하여 본 발명이 제한되어서는 안 된다. 본 명세서에서 제1, 제2 등의 용어가 다양한 요소들(elements)을 기술하기 위해서 사용되었지만, 상기 요소들이 이 같은 용어들에 의해서 한정되어서는 안 된다. 이러한 용어들은 단지 상기 요소들을 서로 구별시키기 위해서 사용되었을 뿐이다. 또, 어떤 요소가 다른 요소 위에 있다고 언급되는 경우에 그것은 다른 요소 위에 직접 형성 될 수 있거나 또는 그들 사이에 제3의 요소가 개재될 수도 있다는 것을 의미한다. 도면들에서 요소의 크기, 또는 요소들 사이의 상대적인 크기는 본 발명에 대한 더욱 명확한 이해를 위해서 다소 과장되게 도시될 수 있다. 또, 도면들에 도시된 요소의 형상이 제조 공정상의 변이 등에 의해서 다소 변경될 수 있을 것이다. 따라서, 본 명세서에서 개시된 실시예들은 특별한 언급이 없는 한 도면에 도시된 형상으로 한정되 어서는 안 되며, 어느 정도의 변형을 포함하는 것으로 이해되어야 한다. 도 1은 본 발명의 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 가상 골프 장치는 타격 플레이트, 제어부, 감지부, 입 력부, 사운드부, 표시부를 포함한다. 타격 플레이트는 사용자가 골프공을 타격하기 위하여 위치하는 영역이다. 타격 플레이트는 플레이트형 물체가 될 수도 있고 또는 별도의 물체가 아니고 단순히 가상 골프 장치가 설치되어 있는 장소의 바닥면으로서 사용자가 위치하는 부분이 될 수도 있다. 도면에 도시되어 있지 않지만, 타격 플레이트에는 골프공이 놓여 지는 타격매트가 구비되어 있고, 또한 상기 타격매트에는 상하로 이동가능한 구조의 오토티가 설치되어 있다. 상기 오토티를 통하여 사용자에게 타격용 골프공이 자동으로 제공될 수 있다. 제어부는 가상 골프 장치의 각 구성품 사이의 전반적인 동작을 컨트롤한다. 예를 들면, 제어부는 타격 매트에 설치되어 있는 상기 오토티를 컨트롤하여, 사용자가 타격하는 시점에 맞추어 오토티에서 타격용 골프공 이 제공되도록 할 수 있다. 또한 사용자가 특정 골프코스를 선택한 경우, 해당 골프코스에서 플레이할 수 있도 록 제어부는 필요한 동작을 실행한다. 즉 제어부는 영상을 처리하는 영상처리수단을 구비하고 있고, 사 용자가 특정 골프코스를 선택한 경우에 상기 영상처리수단에서 해당 골프코스 영상을 형성하여 표시부로 전 달함으로써 해당 영상이 디스플레이되도록 할 수 있다. 제어부는 산출부, 정보제공부, 저장부를 구비하고 있다. 산출부는 사용자가 타격한 골프공 의 물리적 상태 등에 근거하여 상기 물리적 상태대로 골프공이 실제 골프장에서 움직인다고 가정했을 때의 궤적 을 산출하는 산출과정을 수행한다. 정보제공부는 사용자에게 골프와 관련한 다양한 정보를 제공할 수 있도 록 관련 정보를 생성하는 등의 역할을 한다. 정보제공부의 자세한 동작에 대해서는 후술한다. 저장부는 제어부, 산출부, 정보제공부 등이 상기한 동작을 수행하는 데에 필요한 각종 프로그램이나 데이터 등을 저장하는 역할을 한다. 감지부는 골프클럽의 움직임이나 사용자가 타격한 골프공의 움직임 등을 감지하여 산출과정에 필요한 정보 를 파악하기 위한 것으로, 감지부로서 골프클럽이나 골프공의 움직임을 촬영할 수 있는 카메라나 감지센서 등의 감지수단이 사용될 수 있다. 상기 감지수단에는 이미지 센싱, 발광/수광 센싱, 레이저 센싱 등 다양한 센 싱 방식이 적용될 수 있고, 이러한 센싱 방식으로 골프클럽이나 사용자가 타격한 골프공의 상태 정보를 파악할 수 있다. 상기 카메라나 감지센서 등은 단독으로 사용되거나 함께 사용될 수 있고, 또한 1대만 사용되거나 여러 대가 사용될 수 있다. 감지부를 통하여 얻어진 정보는 제어부에 전달되어 산출과정에 사용된다. 입력부는 사용자로부터 각종 정보를 입력받기 위한 것으로 키보드나 마우스 등이 사용될 수 있다. 예를 들 면, 로그인을 위한 아이디나 패스워드를 입력할 때, 플레이 하고자 하는 골프코스나 플레이 난이도 등을 선택할 때 등에 입력부가 사용될 수 있다. 사운드부는 스피커 등과 같은 음향기기를 포함할 수 있고, 이를 통하여 사용자에게 게임의 진행 상황을 안 내하고 게임의 진행에 따른 각종 효과음을 재생하는 역할을 한다. 표시부는 프로젝터와 스크린 등을 포함한다. 프로젝터는 골프코스와 골프공의 영상이 스크린에 디스플레이 되도록 골프 관련 영상을 스크린에 투사하며, 스크린은 투사된 골프 관련 영상을 디스플레이하여 사용자에게 보 여주는 역할을 한다. 도면에 도시되어 있지는 않지만, 표시부는 스크린이외에 보조 디스플레이 역할을 하는 키오스크 등과 같은 표시기기를 더 포함할 수 있다. 본 명세서에서는 스크린에 디스플레이되는 일부 대상에 대해 '가상'이라는 용어를 붙여서 표현하는 경우가 있을 수 있다. 이는 현실 세계에 존재하는 것이 아니고 스크린 속 영상으로 디스플레이되는 것이라는 의미로서, 예를 들어 '가상의 골프코스'란 스크린에 디스플레이되는 골프코스라는 의미이고 '가상의 골프공'이란 스크린에 디스 플레이되는 골프공이라는 의미이다. 가상 골프 장치는 스크린 골프장 등에 설치되어 스크린 골프를 플레이할 수 있도록 하는 장치이며, 사용자가 스 크린 골프를 플레이할 때에 가상 골프 장치는 다음과 같이 동작한다. 사용자가 골프공을 타격하면 감지부에 서 골프클럽의 움직임이나 사용자가 타격한 골프공의 이동속도나 이동방향 등과 같은 물리적 상태를 감지한다. 감지부에 의하여 감지된 정보는 제어부에 전달되고, 제어부의 산출부는 전달된 정보에 의거하 여 산출과정을 수행한다. 표시부에서는 산출과정에서 산출된 궤적대로 가상의 골프공이 움직이는 영상을 표 시하며, 이때에 가상의 골프공은 산출된 궤적으로 비행한 후 스크린 속 가상의 골프코스의 특정지점에 착지하게 되고, 사용자는 가상의 골프공이 착지된 지점에서 넥스트 타격을 이어가게 된다. 도 2는 골프 관련 정보를 제공하는 과정을 예시적으로 나타내는 순서도이다. 도 2를 참조하면, 가상 골프 장치의 골프 관련 정보를 제공하는 동작과정은 제1 내지 제3 단계(S1, S2, S3)를 포함한다. 제1 단계(S1)에서는 사용자가 처해있는 현재 상황이 파악되고, 제2 단계(S2)에서는 정보제공요건이 충족되는지 체크되며, 제3 단계(S3)에서는 정보가 생성되어 사용자에게 제공된다. 제2 단계(S2)는 필수적인 것 은 아니며 생략가능하다. 제2 단계(S2)가 생략되는 경우에는 제1 및 제3 단계(S1, S3)가 순차적으로 실행되어 사용자가 처해 있는 현재 상황을 체크하고 해당 상황에 부합하는 정보가 제공된다. 제2 단계(S2)가 실행되는 경 우에는 정보제공요건이 충족되는 경우에만 제3 단계(S3)가 실행된다. 정보 제공은 정보제공부에 의하여 수행될 수 있고, 이를 위해 정보제공부는 인공지능을 이용할 수도 있 다. 인공지능을 이용하는 경우, 인공지능이 필요한 데이터를 입력받은 후 이를 이용하여 결과물을 출력하도록 구성할 수 있다. 여기에서 인공지능은 인간의 지적 능력을 인공적으로 구현한 프로그램이며, 인공지능에는 머신 러닝 기술 등이 적용될 수 있다. 머신러닝 기술 등을 적용함으로써 규칙에 의해 정해진 결과값을 도출하는 전통 적인 프로그램과는 다르게 인공지능이 많은 수의 입력 데이터를 분석하여 스스로 결과값을 도출하도록 할 수 있 다. 인공지능을 적용함에 있어서 여러가지 데이터가 입력 데이터로 사용될 수 있다. 예를 들면, 사용자 데이터 및/또는 골프코스 데이터 등이 입력 데이터로 사용될 수 있고, 이러한 데이터는 저장부 등과 같은 저장수단 에 저장되어 있을 수 있다. 도 3은 골프 관련 정보 생성에 사용되는 사용자 데이터를 저장하는 방식의 예를 나타내는 도면이고, 도 4는 골 프 관련 정보 생성에 사용될 수 있는 연습 플레이 데이터의 예를 나타내는 도면이다. 도 3을 참조하면, 정보 제공에 사용되는 사용자 데이터는 각 사용자별로 다른 저장영역이 할당되어 각 사용자에 게 할당된 영역에 저장되어 있을 수 있다. 예를 들면, 서로 다른 사용자 A, B가 있다고 할 때에, 사용자 A에 대 한 정보를 저장하는 영역과 사용자 B에 대한 정보를 저장하는 영역은 서로 구분되어 있을 수 있고, 각 사용자 정보를 저장하는 영역에는 사용자의 신상 정보 데이터(D1), 플레이 데이터(D2), 개인기록 데이터(D3) 등이 저장 되어 있을 수 있다. 사용자의 신상 정보 데이터(D1)는 사용자의 성명, 성별, 연령, 신체(키, 몸무게, 오른손잡 이/왼손잡이 인지 여부 등) 등과 같은 사용자의 개인 신상에 관한 정보를 포함한다. 사용자의 플레이 데이터 (D2)는 사용자가 플레이 했던 골프장 및 해당 골프장에서의 스코어 등과 같은 플레이 결과를 포함한다. 개인기 록 데이터(D3)는 사용자가 플레이한 결과로부터 산출되는 개인 기록 정보를 포함할 수 있다. 예를 들면 평균 타 수, 비거리, 페어웨이 안착률, 그린 정확도, 평균 퍼팅수 등이 사용자의 플레이 결과로부터 산출되어 저장되어 있을 수 있다. 평균 타수는 사용자가 기록한 총 타수의 평균값을 의미한다. 비거리는 사용자가 사용한 각 골프 클럽샷에 의하여 골프공이 비행하는 거리를 의미한다. 페어웨이 안착률은 티샷이 어느 정도의 비율로 (러프나 벙커에 빠지지 않고) 페어웨이에 안착하느냐를 수치로 나타내는 것이다. 그린 정확도는 그린에 골프공을 규정타 이하로 올린 횟수를 '퍼센트(%)'로 나타낸 것이다. 평균 퍼팅수는 18홀 라운딩 중 전체 퍼팅수를 18로 나누어 계산되는데, 예를 들어 전체 퍼팅 횟수가 30이라면 1.67(30/18=1.666)이 된다. 비거리는 장타 능력을, 페어웨이 안착률이나 그린 정확도는 샷의 정확도를, 평균 퍼팅수는 퍼팅의 정확도를 나타낸다고 볼 수 있고, 이들을 이용 하면 사용자의 골프 실력을 평가할 수 있다. 예를 들면, 평균 타수는 종합적인 측면에서 사용자의 골프 능력을 나타내며, 비거리, 페어웨이 안착률, 그린 정확도, 평균 퍼팅수 등은 세부적인 특정 측면에서 사용자의 골프 능 력을 나타낸다고 볼 수 있으며, 이들을 적절하게 활용하면 사용자의 골프 실력이 어느 정도인지 파악할 수 있다. 여기에서 파악된 사용자의 골프 실력은 골프 관련 정보를 생성할 때에 이용될 수 있다. 예를 들면, 골프 실력이 높은 사용자에게는 고득점을 얻을 수 있는 난이도가 높은 공략 방법을 제안하고, 골프 실력이 낮은 사용 자에게는 고득점을 얻을 수는 없지만 위험부담이 없는 난이도가 낮은 공략 방법을 제안할 수 있다. 도 3에 도시되어 있는 바와 같이, 플레이 데이터(D2) 및 개인기록 데이터(D3)는 특정 가상의 골프코스에서 타인 등과 시합했을 때의 실전 데이터와 사용자가 실전에 앞서 몸풀기 등을 위하여 연습타격을 했을 때의 연습 데이 터를 포함하고, 상기 실전 데이터와 연습 데이터는 서로 구분되어 저장되어 있을 수 있다. 연습 데이터는 사용자가 특정 골프클럽으로 반복적으로 골프공을 타격한 결과를 포함할 수 있다. 예를 들면 사 용자가 드라이버샷, 우드샷, 아이언샷, 웨지샷등을 5-10회 연습한 경우에 각 샷에 대한 플레이 기록이 저장되도 록 할 수 있다. 도 4를 참조하면, 예를 들어 사용자가 드라이버로 10회 연습 타격을 하였을 때에 각 회차당 비 거리, 방향각, 사이드 스핀, 발사각, 좌우각, 백스핀 등의 연습 플레이 데이터가 얻어질 수 있고, 이는 저장부 의 해당 사용자의 정보를 저장하는 영역에 저장될 수 있다. 또한 10회 연습 타격에 대한 평균값도 저장부 에 저장될 수 있다. 연습 데이터는 사용자가 당일 시합에 앞서서 연습한 결과를 나타내는 것으로, 이를 통 하여 사용자의 당일 컨디션을 알 수 있다. 사용자의 당일 컨디션은 사용자에게 골프 관련 플레이 정보나 어드바 이스를 제공할 때에 사용될 수 있다. 연습 데이터는 그날 그날 컨디션에 따라 달라질 수 있으므로 사용자가 플 레이를 한 당일에만 사용하고, 당일 사용자의 플레이가 완료하면 저장된 연습 데이터를 삭제하도록 구성할 수도 있다. 이하에서는 어떠한 상황에서 어떠한 정보가 제공되는지 몇 가지 구체적인 예를 살펴본다. 도 5 내지 도 11은 여러가지 골프 관련 정보의 예를 나타내는 도면이다. 도 5를 참조하면, 파5홀에서 티샷을 하는 상황을 가정한다. 스크린에는 사용자의 골프공에 대응하는 가상의 골 프공과 가상의 골프공이 놓여 있는 지점 근방의 가상의 골프코스가 표시된다. 또한 가상 골프 장치에는 스크린 이외에 보조 디스플레이 역할을 하는 키오스크 등과 같은 표시기기가 더 구비되어 있을 수 있고, 이 경우 키오 스크에는 사용자가 현재 플레이 중인 가상의 골프코스의 전체뷰를 보여주는 평면맵이 표시될 수 있다. 이러한 상황에서 골프 관련 정보로서 제1 내지 제4 정보(R11, R12, R13, R14)가 제공될 수 있다. 제1 정보(R11)는 사용 자의 타격에 의한 볼의 예상 경로와 예상 경로에 따른 도착지점에 볼이 도달할 확률을 나타낸다. 제2 정보(R1 2)는 코스 공략의 관점에서 추천할만한 이상적인 목표지점을 나타낸다. 제3 정보(R13)는 제1 정보(R11)와 마찬 가지로 사용자의 타격에 의한 볼의 예상 경로와 예상 경로에 따른 도착지점에 볼이 도달할 확률을 나타내며, 제 1 정보(R11) 정보가 스크린의 메인 영역(스크린의 중심부분)에 표시되는 반면 제3 정보(R13)는 스크린의 서브 영역(스크린의 가장자리 부분)에 미니맵으로 표시된다. 제4 정보(R14)는 사용자가 사용할 수 있는 골프클럽을나타낸다. 제4 정보(R14)에 나타나는 골프클럽은 현재 가상의 골프공과 홀컵 사이의 거리에 따라 사용자들이 통 상적으로 사용할 수 있는 골프클럽을 나타낸다. 제1 내지 제4 정보(R11, R12, R13, R14)는 정보제공부의 인공지능 프로그램 등을 이용하여 생성될 수 있고, 정보 생성시에는 저장부에 저장되어 있는 각종 사용자 데이터(연습 데이터/실전 데이터 등), 사용자가 플레 이하고 있는 가상의 골프코스에 대한 데이터 등과 같은 여러가지 데이터를 이용할 수 있다. 예를 들어, 정보제 공부는 사용자 데이터 및 골프코스 데이터 등으로부터 티샷에 의한 이상적인 목표지점을 전방 200m 지점으 로 판단할 수 있고, 사용자의 연습 데이터 등을 반영하여 사용자의 드라이버샷이 비거리 180m의 오른쪽 슬라이 스가 되어 70%의 확률로 러프 지형에 골프공이 도달할 것이라고 예상되는 경우, 전방 200m 지점을 제2 정보 (R12)로서 제공하고, 골프공의 예상도달지점과 상기 예상에 대한 확률을 제1 및 제3 정보(R11, R13)로서 제공할 수 있다. 상기한 정보(R11, R12, R13, R14)의 일부 또는 전부(사용자 제공 정보는 여기에서 언급된 정보로 한정되지 않고 다른 추가 정보가 더 제공될 수도 있음)는 자동적으로 제공되거나 또는 소정의 정보제공요건이 충족되는 경우에 제공되도록 할 수 있다. 상기 소정의 정보제공요건으로는 사용자가 골프공을 타격할 준비가 끝난 볼 레디 상태 인 경우, 드라이버샷에 의한 예상 도달 위치가 이상적인 목표지점으로부터 소정의 범위 이상으로 크게 벗어나 있는 경우(예를 들면 드라이버샷에 의하여 이상적인 목표지점으로부터 반경 10m 범위를 벗어나 있는 위치에 골 프공이 도달할 것으로 예상되는 경우) 등이 있을 수 있다. 도 6을 참조하면, 파5홀에서 첫번째 티샷을 한 후에 두번째 이상의 샷을 하는 상황을 가정한다. 스크린에는 사 용자의 골프공에 대응하는 가상의 골프공과 가상의 골프공이 놓여 있는 지점 근방의 가상의 골프코스가 표시되 고, 보조 디스플레이 역할을 하는 키오스크 등이 구비되는 경우에 여기에 사용자가 현재 플레이 중인 가상의 골 프코스의 뷰를 보여주는 평면맵이 표시될 수 있다. 이러한 상황에서 골프 관련 정보로서 제1 내지 제5 정보 (R21, R22, R23, R24, R25)가 제공될 수 있다. 제1 정보(R21)는 사용자의 타격에 의한 볼의 예상 경로와 예상 경로에 따른 도착지점에 볼이 도달할 확률을 나타낸다. 제2 정보(R22)는 코스 공략의 관점에서 추천할만한 이상 적인 목표지점을 나타낸다. 제3 정보(R23)는 경사지형에서의 오르막/내리막 정보를 나타낸다. 제3 정보(R23)에 있어서 오르막과 내리막 지형의 컬러를 다르게 표시하여, 가령 오르막은 빨간색으로 내리막은 파란색으로 표시 할 수 있다. 이때에 경사도가 어느 정도인지 구체적인 수치가 표시될 수 있다. 제4 정보(R24)는 제1 정보(R21) 와 마찬가지로 사용자의 타격에 의한 볼의 예상 경로와 예상 경로에 따른 도착지점에 볼이 도달할 확률을 나타 내며, 제4 정보(R24)는 스크린의 가장자리 부분에 제공되는 미니맵에 표시된다. 제5 정보(R25)는 현재 상황에서 통상적으로 사용자가 사용할 수 있는 골프클럽과 현재 플레이 중인 사용자에게 적합한 추천클럽 등을 나타낸다. 제1 내지 제5 정보(R21, R22, R23, R24, R25)는 정보제공부의 인공지능 프로그램 등을 이용하여 생성될 수 있고, 정보 생성시에는 저장부에 저장되어 있는 각종 사용자 데이터(연습 데이터/실전 데이터 등), 사용자 가 플레이하고 있는 가상의 골프코스에 대한 데이터 등과 같은 여러가지 데이터를 이용할 수 있다. 예를 들어, 정보제공부는 사용자 데이터 및 골프코스 데이터 등으로부터 플레이어의 성향상 오르막 경사에서 아이언 7 번으로 샷을 할 것이라 판단하고 또한 상기 아이언샷에 의하여 오른쪽 슬라이스 구질의 150m 비거리가 나와서 러프 지형에 80%의 확률로 골프공이 도달할 것이라고 예상되는 경우, 이를 제1 및 제4 정보(R21, R24)로서 제공 할 수 있다. 또한 골프코스 공략상 이상적인 목표라고 판단되는 지점을 산출하여 제2 정보(R22)로서 제공할 수 있다. 상기한 정보(R21, R22, R23, R24, R25)의 일부 또는 전부(사용자 제공 정보는 여기에서 언급된 정보로 한정되지 않고 다른 추가 정보가 더 제공될 수도 있음)는 자동적으로 제공되거나 또는 소정의 정보제공요건이 충족되는 경우에 제공되도록 할 수 있다. 상기 소정의 정보제공요건으로는 사용자가 골프공을 타격할 준비가 끝난 볼 레 디 상태인 경우, 샷에 의한 예상 도달 위치가 이상적인 목표지점으로부터 소정의 범위 이상으로 크게 벗어나 있는 경우(예를 들면 샷에 의하여 이상적인 목표지점으로부터 반경 10m 범위를 벗어나 있는 위치에 골프공이 도 달할 것으로 예상되는 경우), 경사가 있는 오르막/내리막 지형이 있고 경사도가 일정값 이상이어서 샷 난이도가 높은 경우 등이 있을 수 있다. 도 7을 참조하면, 파5홀에서 어프로치샷을 하는 상황을 가정한다. 스크린에는 사용자의 골프공에 대응하는 가상 의 골프공과 가상의 골프공이 놓여 있는 지점 근방의 가상의 골프코스가 표시되고, 보조 디스플레이 역할을 하 는 키오스크 등이 구비되는 경우에 여기에 사용자가 현재 플레이 중인 가상의 골프코스의 뷰를 보여주는 평면맵 이 표시될 수 있다. 이러한 상황에서 골프 관련 정보로서 제1 및 제2 정보(R31, R32)가 제공될 수 있다. 제1 정 보(R31)는 사용자가 사용할 수 있는 골프클럽을 나타낸다. 제2 정보(R32)는 사용자의 타격에 있어서 거리에 따른 평균탄도, 볼의 예상 도착지점과 그 도착지점에 볼이 도달할 확률을 나타낸다. 제1 정보(R31)에 나타나는 골 프클럽은 현재 가상의 골프공과 홀컵 사이의 거리에 따라 사용자들이 평균적으로 사용할 수 있는 골프클럽이 될 수 있고, 플레이 중인 사용자는 제1 정보(R31)로 표시되어 있는 골프클럽을 사용하거나 또는 임의대로 자신이 판단에 따라 자신에게 맞는 골프클럽을 선택하여 사용할 수 있다. 제1 정보(R31)를 표시할 때에는 해당 골프클 럽을 사용하였을 때에 볼이 타깃 부분에서 벗어나지 않고 중점방향(현재 가상의 골프공에서 타깃인 홀컵을 향하 는 방향)으로 갈 확률이 더 표시될 수도 있다. 제2 정보(R32)는 도 7에 도시되어 있는 바와 같이 사이드 탑뷰 형태로 표시될 수 있다. 상기한 정보(R31, R32)는 정보제공부의 인공지능 프로그램 등을 이용하여 생성될 수 있고, 정보 생성시에는 저장부에 저장되어 있는 각종 사용자 데이터(연습 데이터/실전 데이터 등), 사용 자가 플레이하고 있는 가상의 골프코스에 대한 데이터 등을 이용할 수 있다. 상기한 정보(R31, R32)의 일부 또는 전부(사용자 제공 정보는 여기에서 언급된 정보로 한정되지 않고 다른 추가 정보가 더 제공될 수도 있음)는 자동적으로 제공되거나 또는 소정의 정보제공요건이 충족되는 경우에 제공되도 록 할 수 있다. 상기 소정의 정보제공요건으로는 사용자가 골프공을 타격할 준비가 끝난 볼 레디 상태인 경우, 현재 가상의 골프공의 위치가 홀컵으로부터 소정의 거리 이내에 있는 경우(예를 들면 가상의 골프공이 홀컵으로 부터 100m 이내의 거리에 있는 경우) 등이 있을 수 있다. 도 8을 참조하면, 사용자의 가상의 골프공이 그린 영역에 있어서 퍼팅을 하는 상황을 가정한다. 스크린에는 사 용자의 골프공에 대응하는 가상의 골프공, 가상의 골프공이 놓여 있는 그린 영역 및 타깃인 홀컵(또는 홀컵에 위치하는 깃발)이 표시된다. 또한 보조 디스플레이 역할을 하는 키오스크 등이 구비되는 경우에 여기에 사용자 가 현재 플레이 중인 가상의 골프코스를 보여주는 평면맵이 표시될 수 있다. 이러한 상황에서 골프 관련 정보로 서 제1 내지 제3 정보(R41, R42, R43)가 제공될 수 있다. 제1 정보(R41)는 퍼팅에 성공하기 위한 목표지점을 나 타낸다. 퍼팅에서는 골프공을 굴려서 홀컵에 넣는 것이 목적이지만, 퍼팅의 목표지점은 골프공을 넣어야하는 홀 컵의 위치와 차이가 있을 수 있다. 왜냐하면 그린 영역에 경사가 있을 수 있고, 홀컵을 목표로 퍼팅하더라도 상 기 경사의 영향으로 홀인에 실패할 가능성이 있기 때문이다. 상기 경사를 고려하여 홀컵에서 몇 컵 정도 떨어져 있는 위치를 목표로 하여 퍼팅하는 경우에 오히려 퍼팅에 성공할 가능성이 높은 경우가 있을 수 있고, 제1 정보 (R41)는 그린 영역의 경사를 고려하여 목표로 삼아야 할 지점을 나타낸다. 제2 정보(R42)로서 '퍼팅 가이드'가 표시될 수 있다. 퍼팅 가이드는 그린 영역의 경사를 고려한 상태에서 퍼팅시 골프공을 굴려야 할 방향 및/또는 퍼팅시에 골프공이 굴러가는 예상 경로를 나타낸다. 퍼팅 가이드는 컬러로 나타낼 수 있고, 컬러에 따라 퍼팅을 어느 정도의 강도로 할 것인지를 표현할 수 있다. 예를 들면, 강하게 퍼팅해야 하는 경우(볼 스피드를 많이 내 야하는 경우)에는 빨간색으로 퍼팅 가이드를 나타내고, 약하게 퍼팅해야 하는 경우(볼 스피드를 적게 내야하는 경우)에는 초록색으로 퍼팅 가이드를 나타낼 수 있다. 제1 및 제2 정보(R41, R42)와 함께 제3 정보(R43)로서 사 용자의 예상 퍼팅 결과를 사이드 탑뷰 형식으로 보여줄 수 있다. 제1 내지 제3 정보(R41, R42, R43)는 정보제공부의 인공지능 프로그램 등을 이용하여 생성될 수 있고, 정보 생성시에는 저장부에 저장되어 있는 각종 사용자 데이터(연습 데이터/실전 데이터 등), 사용자가 플레이하 고 있는 가상의 골프코스에 대한 데이터 등을 이용할 수 있다. 예를 들어, 정보제공부가 사용자의 과거 플 레이 기록이나 연습장 데이터 등에 근거하여 사용자 퍼팅이 홀컵으로부터 3m 정도 모자라는 지점에 도달할 것이 라고 예상하는 경우, 예상 결과를 제3 정보(R43)로 표시하고 또한 상기 예상 결과를 고려하여 제1 정보(R41)인 목표지점을 홀컵보다 3m 정도 뒷쪽에 있는 위치가 되도록 설정하여 표시할 수 있다. 퍼팅은 골프의 승패를 가르는 크리티컬한 플레이이기 때문에 퍼팅 상황에서는 여러가지 형태의 정보가 다앙하게 제공될 수 있다. 도 9를 참조하면, 퍼팅상황에서 골프 관련 정보로서 도 8을 참조하여 설명하였던 정보와 다른 제1 내지 제3 정보(R51, R52, R53)가 제공될 수 있다. 제1 정보(R51)는 사용자 퍼팅에 의한 예상 퍼팅 방향을 나타내고, 제2 정보(R52)는 퍼팅 가이드(도 9에서 노란색 곡선으로 표시됨)와 제1 정보(R51)인 예상 퍼팅 방향 과의 각도 편차를 나타낸다. 또한 상기 각도 편차를 보다 명확하게 파악할 수 있도록, 제3 정보(R53)로서 상기 각도 편차를 사이드 탑뷰 형태로 보여줄 수 있다. 상기한 정보(R41, R42, R43, R51, R52, R53)의 일부 또는 전부(사용자 제공 정보는 여기에서 언급된 정보로 한 정되지 않고 다른 추가 정보가 더 제공될 수도 있음)는 자동적으로 제공되거나 또는 소정의 정보제공요건이 충 족되는 경우에 제공되도록 할 수 있다. 상기 소정의 정보제공요건으로는 사용자가 퍼팅할 준비가 끝난 볼 레디 상태인 경우, 사용자의 퍼팅에 의한 골프공의 예상 도달 지점이 홀컵으로부터 소정의 범위 이상으로 크게 벗어 나 있는 경우(예를 들면 퍼팅에 의한 예상 도달 지점이 홀컵으로부터 1m 거리를 벗어나 있는 위치인 경우), 사 용자의 예상 퍼팅 방향과 퍼팅 가이드 방향 사이의 각도 편차가 소정의 범위 이상으로 크게 차이나는 경우(예를들면 예상 퍼팅 방향이 퍼팅 가이드의 방향에서 거리상 1m 이상 차이나는 경우) 등이 있을 수 있다. 도 10을 참조하면, 파3홀에서 티샷을 하는 상황을 가정한다. 스크린에는 사용자의 골프공에 대응하는 가상의 골 프공과 가상의 골프공이 놓여 있는 지점 근방의 가상의 골프코스가 표시된다. 또한 가상 골프 장치에는 스크린 이외에 보조 디스플레이 역할을 하는 키오스크 등과 같은 표시기기가 구비되어 있을 수 있고, 이 경우 키오스크 에는 사용자가 현재 플레이 중인 가상의 골프코스의 전체뷰를 보여주는 평면맵이 표시될 수 있다. 이러한 상황 에서 골프 관련 정보로서 제1 및 제2 정보(R61, R62)가 제공될 수 있다. 제1 정보(R61)는 사용자의 타격에 의한 볼의 예상 도착지점과 상기 도착지점에 볼이 도달할 확률을 나타낸다. 제2 정보(R62)는 사용자가 사용할 수 있 는 골프클럽과 사용자에게 추천할만 골프클럽 등과 같은 골프클럽에 관한 정보을 나타낸다. 여기에서 사용자가 사용할 수 있는 골프클럽은 현재 가상의 골프공과 홀컵 사이의 거리에 따라 일반적인 사용자들이 통상적으로 사 용할 수 있는 골프클럽을 나타내고, 추천 골프클럽은 해당 사용자의 골프실력이나 플레이 스타일 등을 고려하여 맞춤형으로 추천할만한 골프클럽을 나타낸다. 제2 정보(R62)로서 통상의 골프클럽을 사용하는 경우에 있어서의 예상 온 그린(골프공을 타격하여 그린 영역에 보내는 것) 확률과 추천 골프클럽을 사용하는 경우의 예상 온 그 린 확률을 더 제공할 수도 있다. 전술한 파5홀의 티샷 상황에서는 코스 공략의 관점에서 추천할만한 이상적인 샷의 목표지점이 표시되었는데, 파3홀은 코스의 전체 거리가 짧기 때문에 대부분 티샷에서 홀컵을 향하여 온 그 린을 시도하게 되므로 코스 자체가 특이한 형태가 아니라면 별도의 추천 목표지점을 표시하지 않아도 된다. 상기한 정보(R61, R62)는 정보제공부의 인공지능 프로그램 등을 이용하여 생성될 수 있고, 정보 생성시에는 저장부에 저장되어 있는 각종 사용자 데이터(연습 데이터/실전 데이터 등), 사용자가 플레이하고 있는 가상 의 골프코스에 대한 데이터 등을 이용할 수 있다. 예를 들어 각종 데이터를 분석한 결과, 현재 플레이 중인 가 상의 골프코스에서 티샷위치에서 홀컵까지의 거리가 170m 이고 온 그린을 위해 150m 이상의 비거리가 필요하며, 통상의 사용자들이 평균적으로 A 골프클럽에 의한 평균비거리가 155m인 반면 현재 플레이 중인 사용자는 A 골프 클럽에 의한 평균비거리가 150m에 미치지 못하고 B 골프클럽에 의한 평균비거리가 160m 라는 점을 파악했다면, 사용자가 통상의 A 골프클럽을 사용하는 경우를 가정하여 사용자의 타격에 의한 볼의 예상 도착지점과 상기 예 상 도착지점에 볼이 도달할 확률(도 10의 R61에서 'ROUGH 98%' 라는 기재내용 참조)을 나타내는 내용, 사용자 에게 A 골프클럽을 사용하면 온 그린 확률이 2%(도 10의 R62에서 'IRON4(GREEN) 2%' 라는 기재내용 참조)라는 내용 및 온 그린 확률이 90%인 B 골프클럽을 사용할 것을 추천하는 내용의 정보를 생성한 후 이들 정보를 제공 할 수 있다. 상기한 정보(R61, R62)의 일부 또는 전부(사용자 제공 정보는 여기에서 언급된 정보로 한정되지 않고 다른 추가 정보가 더 제공될 수도 있음)는 자동적으로 제공되거나 또는 소정의 정보제공요건이 충족되는 경우에 제공되도 록 할 수 있다. 상기 소정의 정보제공요건으로는 사용자가 골프공을 타격할 준비가 끝난 볼 레디 상태인 경우, 티샷에 의하여 온 그린에 성공할 확률이 소정의 값 이하인 경우(예를 들면 우드 이하의 골프클럽으로 티샷에 온 그린 확률이 80% 이하로 예상되는 경우) 등이 있을 수 있다. 도 11을 참조하면, 벙커샷을 하는 상황을 가정한다. 스크린에는 사용자의 골프공에 대응하는 가상의 골프공과 가상의 골프공이 놓여 있는 벙커 및 그 주변의 골프코스가 표시된다. 또한 가상 골프 장치에는 스크린이외에 보 조 디스플레이 역할을 하는 키오스크 등과 같은 표시기기가 구비되어 있을 수 있고, 이 경우 키오스크에는 사용 자가 현재 플레이 중인 가상의 골프코스의 뷰를 보여주는 평면맵이 표시될 수 있다. 이러한 상황에서 골프 플레 이 정보로서 제1 내지 제4 정보(R71, R72, R73, R74)가 제공될 수 있다. 제1 정보(R71)는 벙커의 지형 특성을 나타내고, 제2 정보(R72)는 벙커의 각도와 사용자 골프클럽의 탄도를 비교하여 나타내고, 제3 정보(R73)는 벙커 샷이 목표로 할만한 추천방향을 나타내며, 제4 정보(R74)는 사용자가 사용할 수 있는 골프클럽을 나타낸다. 벙커는 보통 주위의 다른 잔디 영역보다 바닥이 내려앉아 있는 형상을 가지고 있으며 벙커의 가장가리에는 경사 가 형성되어 있는데, 제1 정보(R71)로서 벙커에 있어서의 오르막/내리막 정보가 표시될 수 있다. 이때에 오르막 과 내리막 지형의 컬러를 다르게 표시하여, 가령 오르막은 빨간색으로 내리막은 파란색으로 표시할 수 있다. 제 2 정보(R72)에서는 벙커의 각도와 사용자에 의한 벙커샷의 골프클럽 탄도를 비교하여 보여줌으로써 사용자가 벙 커샷을 통하여 벙커에서 탈출할 수 있는지 여부를 판단할 수 있게 한다. 제3 정보(R73)에 있어서 추천방향은 타 깃인 홀컵을 향하는 방향이 될 수 있다. 또는 홀컵을 직접 향하는 방향이 아니더라도 벙커탈출에 용이한 방향이 있다면, 벙커탈출을 우선적인 목표로 하여 그 방향을 추천할 수도 있다. 제4 정보(R74)로는 통상의 사용자가 벙 커샷에서 사용할 수 있는 골프클럽의 정보가 표시될 수 있다. 상기한 정보(R71, R72, R73, R74)는 정보제공부에 의하여 생성되며 필요한 경우 인공지능 프로그램 등을 이 용하여 생성될 수 있다. 예를 들면, 사용자 데이터(연습 데이터/실전 데이터 등)를 이용하면 사용자의 벙커샷에있어서의 평균 탄도 각도를 예상할 수 있고, 사용자가 플레이하고 있는 가상의 골프코스에 대한 데이터 등으로 부터 현재 가상의 골프공이 놓여 있는 벙커의 경사 각도를 알 수 있으며, 양자를 비교하면 벙커샷에 의하여 벙 커를 탈출할 수 있는지 여부를 예측할 수 있으므로 상기 예측 결과를 제2 정보(R72)로 생성하여 제공할 수 있다. 상기한 정보(R71, R72, R73, R74)의 일부 또는 전부(사용자 제공 정보는 여기에서 언급된 정보로 한정되지 않고 다른 추가 정보가 더 제공될 수도 있음)는 자동적으로 제공되거나 또는 소정의 정보제공요건이 충족되는 경우에 제공되도록 할 수 있다. 상기 소정의 정보제공요건으로는 사용자가 골프공을 타격할 준비가 끝난 볼 레디 상태 인 경우, 벙커샷에 의하여 벙커를 탈출할 확률이 낮다고 예상되는 경우 등이 있을 수 있다. 이상 어떠한 상황에서 어떠한 정보가 제공되는지 및 해당 정보가 제공되기 위한 정보제공요건에 대해 설명하였 다. 다만 여기에서는 몇 가지 예를 설명한 것이며, 정보 제공 상황/정보 제공 요건/제공되는 정보의 내용 등과 관련하여 설명되지 않은 다른 것이 더 있을 수 있다. 도 12는 본 발명의 다른 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 12를 참조하면, 본 실시예에 따른 가상 골프 장치는 타격 플레이트, 시뮬레이터, 카메라, 키 보드/마우스 등과 같은 입력기기, 스피커, 스크린, 프로젝터 및 키오스크를 포함한다. 또한 시뮬레이터는 산출부, 정보제공부, 저장부를 포함할 수 있다. 산출부(12 1)는 사용자가 타격한 골프공의 물리적 상태 등에 근거하여 상기 물리적 상태대로 골프공이 실제 골프장에서 움 직인다고 가정했을 때의 궤적을 산출하는 산출과정을 수행한다. 정보제공부는 사용자에게 골프와 관련한 다양한 정보를 제공할 수 있도록 관련 정보를 생성하는 등의 역할을 한다. 저장부는 시뮬레이터, 산 출부, 정보제공부 등이 상기한 동작을 수행하는 데에 필요한 각종 프로그램이나 데이터 등을 저장하 는 역할을 한다. 타격 플레이트, 시뮬레이터, 카메라, 키보드/마우스 등과 같은 입력기기, 스피커, 스크린과 프로젝터는 전술한 실시예의 가상 골프 장치에 있어서 타격 플레이트, 제 어부, 감지부, 입력부, 사운드부, 표시부에 대응하는 역할을 수행하며, 이들에 대한 상세 설명은 생략한다. 키오스크는 소형 디스플레이로서 LCD(Liquid Crystal Display), LED(Light Emitting Diode), OLED(Organic Light Emitting Diode), FED(Field Emission Display), PDP(Plasma Display Panel), 플렉서블 디스플레이(Flexible Display) 등과 같은 다양한 디스플레이 기기로 이루어질 수 있다. 본 실시예에 따르면, 가 상 골프 장치에 영상을 표시하는 장치가 스크린과 키오스크의 2가지가 구비되며, 그에 따라 다양한 화면과 정보를 다이나믹하게 사용자에게 제공할 수 있다. 스크린에는 가상의 골프공과 가상의 골프코스 등 과 같이 사용자에게 메인 영상으로 제공될 수 있는 화면이 디스플레이되고, 키오스크에는 메인 영상 또는 보조적인 정보를 제공하는 화면이 디스플레이될 수 있다. 예를 들면, 키오스크에는 사용자가 현재 플레이 중인 가상의 골프코스를 평면도로 표현한 맵이 표시될 수 있다. 본 실시예의 가상 골프 장치에서는 전술한 실시예와 마찬가지로 정보제공부에서 다양한 골프 관련 정보를 생성하여 사용자에게 제공할 수 있다. 정보제공은 전술한 실시예에서의 방식에 따라 또는 이하에서 설명하는 다 른 방식에 따라 제공될 수 있다. 도 13은 골프 관련 정보를 제공하는 과정의 다른 예를 나타내는 순서도이다. 도 13을 참조하면, 가상 골프 장치의 골프 관련 정보를 제공하는 동작과정은 제1 내지 제4 단계(S10, S20, S30, S40)를 포함한다. 제1 단계(S10)에서는 사용자가 처해있는 현재 상황이 파악되고, 제2 단계(S20)에서는 정보제 공요건이 충족되는지 체크되며, 제3 단계(S30)에서는 사용자의 개인성향이 체크되고, 제4 단계(S40)에서는 정보 가 생성되어 사용자에게 제공된다. 제2 단계(S20)는 필수적인 것은 아니며 생략가능하다. 제2 단계(S2)가 생략 되는 경우에는 제1, 제3 및 제4 단계(S10, S30, S40)가 순차적으로 실행되어 사용자가 처해 있는 현재 상황과 개인성향을 체크한 후 현재 상황과 사용자의 성향에 부합하는 정보가 제공된다. 제2 단계(S2)가 실행되는 경우 에는 정보제공요건이 충족되는 경우에만 제3 및 제4 단계(S30, S40)가 실행된다. 정보 제공은 정보제공부에 의하여 수행될 수 있다. 정보 제공 동작은 전술한 실시예에서와 마찬가지로 인 공지능 등을 이용하여 실행될 수 있다. 전술한 실시예와 달리, 본 실시예에서는 정보 제공 동작시에 사용자의 개인성향을 체크한 후, 체크된 개인성향을 반영하여 정보를 제공할 수 있다. 이를 위해 사용자의 개인성향에 대 한 정보가 저장되어 있을 수 있고, 상기 개인성향 정보는 저장부에 저장되어 있을 수 있다. 도 14는 골프 관련 정보 생성에 사용되는 사용자 데이터를 저장하는 방식의 다른 예를 나타내는 도면이다. 도 14를 참조하면, 정보 제공에 사용되는 사용자 데이터는 각 사용자별로 다른 저장영역이 할당되어 각 사용자 에게 할당된 영역에 저장되어 있을 수 있다. 예를 들면, 서로 다른 사용자 A, B가 있다고 할 때에, 사용자 A에 대한 정보를 저장하는 영역과 사용자 B에 대한 정보를 저장하는 영역은 서로 구분되어 있을 수 있고, 각 사용자 정보를 저장하는 영역에는 사용자의 신상 정보 데이터(D10), 플레이 데이터(D20), 개인기록 데이터(D30), 개인 성향 데이터(D40) 등이 저장되어 있을 수 있다. 사용자의 신상 정보 데이터(D10)는 사용자의 성명, 성별, 연령, 신체(키, 몸무게, 오른손잡이/왼손잡이 인지 여부 등) 등과 같은 사용자의 개인 신상에 관한 정보를 포함한다. 사용자의 플레이 데이터(D20)는 사용자가 플레이 했던 골프장 및 해당 골프장에서의 스코어 등과 같은 플레이 결과를 포함한다. 개인기록 데이터(D30)는 사용자가 플레이한 결과로부터 산출되는 개인 기록 정보를 포함할 수 있다. 예를 들면 평균 타수, 비거리, 페어웨이 안착률, 그린 정확도, 평균 퍼팅수 등이 사용자의 플레이 결과로 부터 산출되어 저장되어 있을 수 있다. 개인성향 데이터(D40)는 사용자의 개인성향를 나타내는 정보를 저장하고 있다. 개인성향이란 사용자의 성격에 대한 것으로, 예를 들면 사용자가 모험적인 플레이를 선호하는지 또는 안 정적인 플레이를 선호하는지 등에 관한 성향을 포함할 수 있다. 또는 개인성향이란 사용자의 MBTI에 따른 사용자 성격유형을 포함할 수 있다. MBTI(Myers-Briggs Type Indicator)란 마이어스와 브릭스가 융의 심리 유형론을 토대로 고안한 성격유형 검사이다. MBTI에서는 4가지 선 호지표를 토대로 16가지 유형으로 성격를 분류하고 있다. 상기 4가지의 선호지표에는 에너지의 방향과 주의 초 점에 있어서 외향형(E)인지 내향형(I)인지, 정보를 수집함에 있어서 감각형(S)인지 직관형인지(N), 의사결정에 있어서 사고형(T)인지 감정형인지(F)인지, 외부세계에 대처함에 있어서 판단형(J)인지 인식형(P)인지의 항목이 있다. MBTI 테스트 검사를 하게 되면, 사용자는 여러가지 질문에 대해 답변을 하게 되고, 상기 질문/답변을 분 석하여 해당 사용자가 상기 4가지 선호지표 각각에 대해 어떠한 타입에 해당하는지 알 수 있고, 그 결과 ISTJ, ENFP 등과 같은 총 16가지 성격유형 중 사용자가 어떠한 유형에 속하는지 결정될 수 있다. MBTI는 최근 국내에 서 널리 유행하고 있으며, 사용자는 인터넷 사이트나 각종 앱을 통하여 간단하게 자신의 성격유형을 확인해 볼 수 있다. 위와 같은 개인성향 데이터는 키보드/마우스 등과 같은 입력기기를 통하여 사용자가 스스로 입력하도록 함 으로써 입수될 수 있다. 또는 정보제공부 등에서 몇 가지 질문을 제시하고 사용자가 답변하도록 하고, 상기 질 문/답변 내용에 근거하여 사용자의 개인성향을 파악한 후 파악된 정보를 저장함으로써 입수될 수 있다. 도 14에 도시되어 있는 바와 같이, 플레이 데이터(D20) 및 개인기록 데이터(D30)는 특정 가상의 골프코스에서 타인 등과 시합했을 때의 실전 데이터와 사용자가 실전에 앞서 몸풀기 등을 위하여 연습타격을 했을 때의 연습 데이터를 포함하고, 상기 실전 데이터와 연습 데이터는 서로 구분되어 저장될 수 있다. 연습 데이터는 사용자가 당일 시합에 앞서서 연습한 결과를 나타내는 것으로 이를 통하여 사용자의 당일 컨디션을 알 수 있고, 사용자에 게 골프 관련 플레이 정보나 어드바이스를 제공할 때에 사용자의 당일 컨디션 데이터를 활용할 수 있다. 이하에서는 사용자의 개인 성향에 따라 사용자에게 제공되는 정보가 어떻게 달라질 수 있는지에 관한 몇 가지 예를 살펴본다. 도 15 내지 도 17은 사용자의 개인성향을 고려하여 골프 관련 정보를 제공하는 여러가지 예를 나타내는 도면이 다. 도 15를 참조하면, 사용자가 소정의 가상 골프코스에서 플레이 중이고 현재 시도하고자 하는 샷을 통하여 가상 의 골프공을 현재위치에서 그린 영역으로 보내고자 하는 상황을 가정한다. 또한 현재 상황에서 가상의 골프공을 그린 영역으로 보내는 방법은 2가지가 있고, 제1 방법은 제1 경로(P1)를 따라 한 번의 샷으로 가상의 골프공을 그린 영역으로 보내는 것이고 제2 방법은 제2 경로(P2)를 따라 두 번의 샷으로 가상의 골프공을 그린 영역으로 보내는 것이라고 가정한다. 제1 방법은 한 번의 타격으로 온 그린을 할 수 있어서 타수가 적다는 장점이 있지만, 제1 경로(P1)에는 벙커가 있어서 샷의 비거리가 부족하면 벙커에 빠질 수 있다는 위험부담이 있다. 제2 방법은 두 번의 타격으로 온 그린을 하게 되어 타수가 늘어난다는 단점이 있지만, 제2 경로(P2)는 벙커를 우회 하고 있어서 벙커를 비교적 확실하게 피할 수 있다는 장점이 있다. 즉 제1 방법은 위험부담이 크지만 성공했을 때의 보상이 크다는 특징이 있고, 제2 방법은 위험부담이 작지만 성공했을 때의 보상이 작다는 특징이 있다. 정보제공부에서 사용자에게 제공하는 정보로서 골프 플레이에 대한 어드바이스 정보가 있을 수 있다. 도 15에 도시되어 있는 것과 같은 상황에서 골프 플레이 어드바이스를 제공할 때에, 사용자의 개인성향에 따라 제1 방법에 의한 코스공략법을 제공하거나 또는 제2 방법에 의한 코스공략법을 제공할 수 있다. 예를 들면, 사용자가 모험적인 플레이를 선호하는 성향이라면 제1 방법에 기초한 골프 플레이 어드바이스를 제공하고 사용자가 안 정적인 플레이를 선호하는 성향이라면 제2 방법에 기초한 골프 플레이 어드바이스를 제공할 수 있다. 정보제공부에서 사용자에게 제공하는 정보로서 사용자가 수행할 미션과 같은 각종 콘텐츠에 관한 정보가 있을 수 있다. 상기 미션은 사용자가 골프 플레이 등을 통하여 달성할만한 목표를 제시하는 것으로, 미션 달성을 위 하여 주어지는 시간을 기준으로 일일 미션/주간 미션/월간 미션 등이 있을 수 있다. 사용자가 미션을 달성하는 경우에 일정한 보상이 주어질 수 있는데, 보상으로는 여러가지 기능을 가진 아이템 제공, 가상 골프 장치를 이 용하는 서비스 이용료의 할인 등이 있을 수 있다. 사용자에게 부여되는 미션은 사용자가 누구인지에 달라 달라 질 수 있고, 어떤 사용자에게 어떤 미션을 부여할 것인지를 결정함에 있어서 사용자의 개인성향이 반영될 수 있 다. 예를 들어 사용자가 MBTI에 따른 성격 유형이 'ISTJ'라고 하면, ISTJ 성격의 소유자는 \"진지하고 체계적이며 표 준적인 방식에 따라 계획적으로 일하는 것을 선호한다\"라고 알려져 있다. 이와 같은 ISTJ 성격 유형의 특징을 감안하여, 해당 사용자에게 미션을 부여할 때에는 단계별로 발전하도록 구성되는 미션이 부여되도록 할 수 있 다. 예를 들면 도 16에 도시되어 있는 바와 같이, 일일 미션으로서 '티샷 140m 이상'과 같은 첫번째 목표를 제 시하고 사용자가 첫번째 목표를 달성하면 '티샷 150m 이상'과 같이 첫번째 목표에서 약간 상향 조정된 목표를 제시하는 것과 같은 방식으로, 점진적으로 난이도를 올려가면서 사용자의 골프실력이 조금씩 체계적으로 향상될 수 있게 유도하는 미션이 제공되도록 할 수 있다. 다른 예로서 사용자가 MBTI에 따른 성격 유형이 'ENFP'라고 하면, ENFP 성격의 소유자는 \"이상적인 삶을 추구하 고 감수성이 풍부하고 호기심이 많으며, 실리보다는 어떤 일의 가능성을 보는 경향이 있다\" 라고 알려져 있다. 이와 같은 ENFP 성격 유형의 특징을 감안하여, 해당 사용자에게 미션을 부여할 때에는 계획적으로 잘 짜여진 미션보다는 즉흥적인 미션이 부여되도록 할 수 있다. 예를 들어 도 17을 참조하면, 일일 미션으로서 '벙커에 한 번에 빠져나오기' 등과 같은 랜덤 미션이 제공되도록 할 수 있다. 이상 사용자의 개인성향, 특히 MBTI에 따른 사용자 성격유형을 고려하여 사용자에게 골프 플레이 정보, 골프 플 레이 어드바이스, 골프 플레이 미션 등을 제공하는 몇 가지 예를 설명하였다. 여기에서 설명한 개인성향이나 사 용자에게 제공되는 정보의 유형은, 사용자의 다양한 성격를 나타내는 유형 중 몇가지 예와 사용자에게 제공가능 한 여러가지 정보 중 몇가지 예를 든 것이며, 여기에서 언급되지 않은 여러가지 사용자의 성향을 반영하여 여기 에서 언급되지 않은 다른 콘텐츠의 형태로 사용자게 제공되도록 할 수도 있다. 도 18은 본 발명의 또 다른 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 18을 참조하면, 본 실시예에 따른 가상 골프 장치는 복수의 부스(101, 102, 103)를 포함한다. 각 부스(101, 102, 103)는 모두 동일하게 구성되어 있다. 예를 들면, 첫번째 부스는 타격 플레이트(101a), 키오스크 화 면이 구비된 시뮬레이터 기기(101b), 스크린(101c) 등을 가지고 있고, 다른 부스(102, 103)도 동일한 구성품을 가지고 있다. 도면에 도시되어 있지는 않지만, 각 부스(101, 102, 103)에는 타격시 골프클럽/골프공의 움직임을 감지하기 위한 카메라 등의 다른 기기가 더 구비되어 있을 수 있다. 각 부스(101, 102, 103)에서는 다수의 사용 자가 번갈아가면서 골프를 플레이할 수 있다. 또는 각 부스(101, 102, 103)에서는 사용자 혼자서 다른 부스의 사용자와 이격되어 있는 상태에서 솔로로 플레이할 수 있다. 본 실시예에 따른 가상 골프 장치에서도 사용자에 게 여러가지 콘텐츠나 정보 등을 제공하는 수단이 구비될 수 있으며, 상기 정보제공수단은 적정 정보를 생성하 여 스크린(101c)이나 키오스크 화면 등을 통하여 사용자에게 제공할 수 있다. 상기 정보제공수단은 상기 시뮬레 이터 기기(101b)에 구비되어 있을 수 있다. 도 19는 본 발명의 실시예에 따른 가상 골프 시스템의 개략적인 구조를 나타내는 도면이다. 도 19를 참조하면, 본 발명의 실시예에 따른 가상 골프 시스템은 가상 골프 장치와 서비스 장치를 포 함한다. 가상 골프 장치로서 도 1 내지 도 18 등에 도시되어 있는 것과 같은 가상 골프 장치 등이 사용될 수 있다. 가상 골프 장치는 스크린 골프를 플레이할 수 있는 가정용 또는 대중용 스크린 골프장에 설치될 수 있으며, 스크린 골프장이 여러 곳에 있는 경우에 가상 골프 장치는 각 스크린 골프장마다 설치되어 전 체적으로 복수개가 구비되어 있을 수 있다. 가상 골프 장치는 서비스 장치와 유무선 통신망 등을 통 하여 통신상으로 연결되어 있다. 서비스 장치는 복수의 스크린 골프장을 운영하는 서비스 업자가 복수의 스크린 골프장에 구비되어 있는 가상 골프 장치를 관리하기 위하여 사용하는 중앙서버를 포함할 수 있다. 서비스 장치에는 정보제공부와 저장부가 구비되어 있다. 스크린 골프 서비스를 이용하고자 하는 사용자는 상기 서비스를 제공받기 위하여 먼저 로그인을 수행하는데, 서 비스 장치는 로그인을 할 때에 사용자의 신원을 확인하고 로그인의 승인 여부를 결정하는 역할을 할 수 있 다. 상기 로그인 동작을 위해 저장부는 사용자의 신원을 확인하는 데에 필요한 정보를 저장하고 있다. 저 장부는 사용자의 신원 확인용 정보뿐만 아니라 사용자의 플레이 기록 등을 저장할 수 있고, 이를 위해 저 장부는 도 3 및/또는 도 14 등에 도시되어 있는 것과 같은 데이터 저장구조를 가질 수 있다. 이와 같이 저 장부에 다양한 사용자 정보가 저장되어 있어서, 서비스 장치에 유선 및/또는 무선상으로 연결되어 있 는 가상 골프 장치들은 저장부에 저장되어 있는 정보를 이용할 수 있고, 가상 골프 장치들 각각 에서는 사용자의 정보를 별도로 저장할 필요가 없다. 본 실시예에 따른 가상 골프 시스템에 있어서 서비스 장치에 구비되어 있는 정보제공부는 전술한 실 시예의 가상 골프 장치에 있어서의 정보제공부와 마찬가지로 사용자에게 여러가지 콘텐츠나 정보 등을 제공할 수 있다. 정보제공부가 서비스 장치에 구비되어 있기 때문에, 복수의 가상 골프 장치 각각에는 별도 의 정보제공부가 구비될 필요가 없다. 또는 서비스 장치에 정보제공부가 구비되어 있지 않고, 그 대 신 각 가상 골프 장치마다 정보제공부가 구비되도록 구성할 수도 있다. 위와 같이 본 발명의 구체적인 실시예들을 살펴보았지만, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점 은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0137342", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 2는 골프 관련 정보를 제공하는 과정을 예시적으로 나타내는 순서도이다. 도 3은 골프 관련 정보 생성에 사용되는 사용자 데이터를 저장하는 방식의 예를 나타내는 도면이다. 도 4는 골프 관련 정보 생성에 사용될 수 있는 연습 플레이 데이터의 예를 나타내는 도면이다. 도 5 내지 도 11은 여러가지 골프 관련 정보의 예를 나타내는 도면이다. 도 12는 본 발명의 다른 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 13은 골프 관련 정보를 제공하는 과정의 다른 예를 나타내는 순서도이다. 도 14는 골프 관련 정보 생성에 사용되는 사용자 데이터를 저장하는 방식의 다른 예를 나타내는 도면이다. 도 15 내지 도 17은 사용자의 개인성향을 고려하여 골프 관련 정보를 제공하는 여러가지 예를 나타내는 도면이 다. 도 18은 본 발명의 또 다른 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 19는 본 발명의 실시예에 따른 가상 골프 시스템의 개략적인 구조를 나타내는 도면이다."}
