{"patent_id": "10-2021-0046804", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0130643", "출원번호": "10-2021-0046804", "발명의 명칭": "이형 강판 지능형 모따기 가공 유닛 헤드 장치", "출원인": "유트 머신 툴스", "발명자": "왕펑"}}
{"patent_id": "10-2021-0046804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이형 강판 지능형 모따기 가공 유닛 헤드 장치에 있어서,단일 축 로봇(1), Z축 이동기구, 회전기구와 가공실행기구를 포함하며;상기 단일 축 로봇(1)은 갠트리(gantry)단말의 z축 방향에 장착하는 데 사용하며; 상기 z축 이동기구는 단일 축 로봇(1)의 작동단에 슬라이드식으로 연결되고, 상기 z축 이동기구에 회전기구를설치하며; 상기 회전기구는 회전 지지대(5)와 회전 모터(6)를 포함하며; 상기 회전 지지대(5)는 베어링을 통해 z축 이동기구 하방에 회전하여 연결되며; 상기 회전 모터(6)는 z축 이동기구에 설치하고, 상기 회전 모터(6)의 메인축은베어링 이너 링(inner ring)과 전동식으로 연결되며; 상기 가공실행기구는 메인축 프레임(7), 반경방향의 압착 에어실린더(8), 메인축 모터(9), 자동 변환 커터기계메인축(10)과 전용 밀링 커터(milling cutter)(11)를 포함하며; 상기 메인축 프레임(7)은 반경방향으로 회전 지지대(5)에 슬라이드식으로 연결되며; 상기 반경방향의 압착 에어실린더(8)는 회전 지지대(5)에 장착되고, 상기반경방향의 압착 에어실린더(8)의 플런저(plunger)단은 메인축 프레임(7)과 고정하여 연결되며; 상기 메인축 프레임(7)에 자동 변환 커터기계 메인축(10)을 설치하고, 상기 자동 변환 커터기계 메인축(10) 바닥부는 전용 밀링 커터(11)를 장착하며; 상기 메인축 프레임(7) 꼭대기부는 칼갈기 실린더(12)가 더 장착되고, 상기 칼갈기 실린더(12)의 피스톤 로드는 자동 변환 커터기계 메인축(10) 중에 뻗어 들어가며; 상기 메인축 프레임(7)의 일측은 메인축 모터(9)를 설치하고, 상기 메인축 모터(9)의 출력단은 자동 변환 커터기계 메인축(10)의 입력단과 전동식으로 연결되는 것을 특징으로 하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치."}
{"patent_id": "10-2021-0046804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 z축 이동기구는 Z축 슬라이딩 프레임(2), 축방향 압착 실린더(3)와 하향 압착 지지대(4)를 포함하며; 상기Z축 슬라이딩 프레임(2)은 단일 축 로봇(1)의 작동단에 슬라이딩식으로 연결하고, 상기 Z축 슬라이딩 프레임(2)에 축방향 압착 실린더(3)을 고정하여 장착하되, 상기 축방향 압착 실린더(3)의 플런저는 Z축 슬라이딩 프레임(2)을 관통하며; 상기 Z축 슬라이딩 프레임(2)에는 z축 방향으로 하향 압착 지지대(4)가 슬라이딩식으로 연결되고, 상기 축방향 압착 실린더(3)의 플런저단은 하향 압착 지지대(4)와 연결하는 것을 특징으로 하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치."}
{"patent_id": "10-2021-0046804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 Z축 슬라이딩 프레임(2)은 직선형 슬라이드 레일과 슬라이드 블록을 통해 하향 압착 지지대(4)에 슬라이딩식으로 연결하는 것을 특징으로 하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치."}
{"patent_id": "10-2021-0046804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 하향 압착 지지대(4)의 바닥면에 홀을 뚫고, 상기 칼갈기 실린더(12)는 하향 압착 지지대(4)의 바닥면에뚫어진 홀을 관통하는 것을 특징으로 하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치."}
{"patent_id": "10-2021-0046804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 메인축 프레임(7) 일측 z축 방향에는 디스크 밀착형 프레임 전동 실린더(16)가 고정해 장착되고, 상기 디공개특허 10-2021-0130643-3-스크 밀착형 프레임 전동 실린더(16)의 작동단은 밀착형 디스크(13)가 장착되며, 상기 밀착형 디스크(13)는 전용 밀링 커터(11)주변에 설치하고, 상기 밀착형 디스크(13) 바닥부는 다수 개의 베어링 볼(14)을 설치하는 것을특징으로 하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치."}
{"patent_id": "10-2021-0046804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 밀착형 디스크(13)는 디스크 밀착형 프레임(17)을 통해 디스크 밀착형 프레임 전동 실린더(16)의 작동단에고정해 장착하는 것을 특징으로 하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치."}
{"patent_id": "10-2021-0046804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 전용 밀링 커터(11)는 롤러 밀착형 베어링(15)이 장착되는 것을 특징으로 하는 이형 강판 지능형 모따기가공 유닛 헤드 장치."}
{"patent_id": "10-2021-0046804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,상기 Z축 슬라이딩 프레임(2)에는 제1 정밀 감압 밸브(18)가 장착되고, 상기 회전 지지대(5)는 제2 정밀 감압밸브(19)가 장착되는 것을 특징으로 하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치."}
{"patent_id": "10-2021-0046804", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 기계 가공 설비 분야에 관한 것으로, 이형 강판 지능형 모따기 가공 유닛 헤드 장치를 제공하며, 단일 축 로봇, Z축 이동기구, 회전기구와 가공실행기구를 포함하며; 상기 단일 축 로봇은 갠트리(gantry)단말의 z축 방향에 장착하는 데 사용하며; 상기 z축 이동기구는 단일 축 로봇의 작동단에 슬라이드식으로 연결되고, 상기 z (뒷면에 계속)"}
{"patent_id": "10-2021-0046804", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 기계 가공 설비 분야에 관한 것으로, 특히, 이형 강판 지능형 모따기 가공 유닛 헤드 장치에 관한 것 이다."}
{"patent_id": "10-2021-0046804", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "강판의 응용은 아주 광범위하여 공업, 농업 등에 아주 보편적으로 응용되고 있으며, 원자력 발전과 선박 제조 중에도 흔히 볼 수 있다. 업계가 발전함에 따라, 강판의 가공 정밀도에 대한 요구도 점점 높아지며, 대부분의 가공할 홀 또는 강판 가장자리는 불규칙적인 형상을 이루고 양면 모따기 가공을 실시해야 한다. 이형 강판의 홀 및 가장자리의 모따기 작업은 통상적으로 인공에 의해 휴대식 모따기 기계를 이용하여 가공작업 을 진행하는 데, 작업자가 작업할 때 노동강도가 높고 작업 효율이 낮으며 가공 정밀도가 균일하지 않고 기업의 생산업무에 직접 영향을 미쳐 아주 큰 제약을 받고 있다. 종래기술은 모따기 기계 유닛 헤드의 구조가 복잡하고 커터의 위치가 고정되어 이형 강판과 양면 모따기 가공에 적합하지 않으며, 사용범위가 작고 가공 품질이 떨어 지며 작업 효율이 낮아 이형 강판 지능형 모따기 가공생산의 요구를 만족시키지 못한다."}
{"patent_id": "10-2021-0046804", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 주로 종래기술이 모따기 기계 유닛 헤드의 구조가 복잡하고 커터의 위치가 고정되어 이형 강판과 양 면 모따기 가공에 적합하지 않으며, 사용범위가 작고 가공 품질이 떨어지며 작업 효율이 낮은 등 기술문제를 해 결하기 위해 창출된 것으로, 그 목적은, 이형 강판 지능형 모따기 가공 장치의 갠트리(gantry)에 장착하며, 하 중을 일정하게 제어하고 밀착형 롤러로 매칭하여 이형 강판의 가장자리를 프로파일 모델링(profile modellin g)하고 양면 모따기 가공 작업을 실시할 수 있는 이형 강판 지능형 모따기 가공 유닛 헤드 장치를 제공하는 데 있다."}
{"patent_id": "10-2021-0046804", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명이 제공하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치는 단일 축 로봇, Z축 이동기구, 회전기구 와 가공실행기구를 포함하며;상기 단일 축 로봇은 갠트리(gantry)단말의 z축 방향에 장착하는 데 사용하며; 상기 z축 이동기구는 단일 축 로봇의 작동단에 슬라이드식으로 연결되고, 상기 z축 이동기구에 회전기구를 설치하며; 상기 회전기구는 회전 지지대와 회전 모터를 포함하며; 상기 회전 지지대는 베어링을 통해 z축 이동기 구 하방에 회전하여 연결되며; 상기 회전 모터는 z축 이동기구에 설치하고, 상기 회전 모터의 메인축은 베어링 이너 링(inner ring)과 전동식으로 연결되며; 상기 가공실행기구는 메인축 프레임, 반경방향의 압착 에어실린더, 메인축 모터, 자동 변환 커터기계 메인축과 전용 밀링 커터(milling cutter)를 포함하며; 상기 메인축 프레임은 반경방향으로 회전 지 지대에 슬라이드식으로 연결되며; 상기 반경방향의 압착 에어실린더는 회전 지지대에 장착되고 상기 반경방향의 압착 에어실린더의 플런저(plunger)단은 메인축 프레임과 고정하여 연결되며; 상기 메인축 프 레임에 자동 변환 커터기계 메인축을 설치하고, 상기 자동 변환 커터기계 메인축 바닥부는 전용 밀 링 커터를 장착하며; 상기 메인축 프레임 꼭대기부는 칼갈기 실린더가 더 장착되고 상기 칼갈기 실 린더의 피스톤 로드는 자동 변환 커터기계 메인축 중에 뻗어 들어가며; 상기 메인축 프레임의 일측 은 메인축 모터를 설치하고, 상기 메인축 모터의 출력단은 자동 변환 커터기계 메인축의 입력단과 전 동식으로 연결된다. 바람직하게, 상기 z축 이동기구는 Z축 슬라이딩 프레임, 축방향 압착 실린더와 하향 압착 지지대를 포 함하며; 상기 Z축 슬라이딩 프레임은 단일 축 로봇의 작동단에 슬라이딩식으로 연결하고, 상기 Z축 슬라 이딩 프레임에 축방향 압착 실린더을 고정하여 장착하되, 상기 축방향 압착 실린더의 플런저는 Z축 슬 라이딩 프레임을 관통하며; 상기 Z축 슬라이딩 프레임에는 z축 방향으로 하향 압착 지지대가 슬라이딩 식으로 연결되고, 상기 축방향 압착 실린더의 플런저단은 하향 압착 지지대와 연결한다. 바람직하게, 상기 Z축 슬라이딩 프레임은 직선형 슬라이드 레일과 슬라이드 블록을 통해 하향 압착 지지대 에 슬라이딩식으로 연결한다. 바람직하게, 상기 하향 압착 지지대의 바닥면에 홀을 뚫고 상기 칼갈기 실린더는 하향 압착 지지대의 바닥면에 뚫어진 홀을 관통한다. 바람직하게, 상기 메인축 프레임 일측 z축 방향에는 디스크 밀착형 프레임 전동 실린더가 고정해 장착되 고, 상기 디스크 밀착형 프레임 전동 실린더의 작동단은 밀착형 디스크가 장착되며, 상기 밀착형 디스 크는 전용 밀링 커터주변에 설치하고 상기 밀착형 디스크 바닥부는 다수 개의 베어링 볼을 설 치한다. 바람직하게, 상기 밀착형 디스크는 디스크 밀착형 프레임을 통해 디스크 밀착형 프레임 전동 실린더 의 작동단에 고정해 장착한다. 바람직하게, 상기 전용 밀링 커터는 롤러 밀착형 베어링이 장착된다. 바람직하게, 상기 Z축 슬라이딩 프레임에는 제1 정밀 감압 밸브가 장착되고, 상기 회전 지지대는 제2 정밀 감압 밸브가 장착된다."}
{"patent_id": "10-2021-0046804", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명이 제공하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치는 구조가 정교하고 뛰어나며 배치가 합리적 이다. 따라서, 축방향 압착 실린더와 제1 정밀 감압 밸브의 매칭 작용으로 하향 압착 지지대 및 상부의 모든 기 구가 z축 방향에서 하향의 일정한 압력이 발생되도록 하고, 밀착형 디스크의 일정한 하중이 가공할 강판 상표면 을 누르도록 할 수 있다. 반경방향의 압착 에어실린더와 제2 정밀 감압 밸브의 매칭 작용은 메인축 프레임 및 그 상부의 모든 기구가 어느 반경방향에서 일정한 압력을 제어할 수 있고 전용 밀링 커터(milling cutter) 상의 롤러 밀착형 베이링 아웃 링(out ring)의 일정한 압력이 가공할 강판의 가공할 가장자리에 밀착하도록 할 수 있 다. 본 발명은 이형 강판 모따기 가공을 실시해야 하는 경우, 하중을 일정하게 제어하고 밀착형 롤러로 매칭하 여 이형 강판의 가장자리를 프로파일 모델링(profile modelling)하고 양면 모따기 가공 작업을 실시할 수 있어 작업 속도가 빠르고 적용하는 공작물 범위가 광범위하며, 자동화 정도가 높고 이형 강판 프로파일 모델링 양면 모따기의 수요를 만족시킬 수 있으며, 노동력을 대량 감축시키고 작업 효율을 향상시키며 원가를 절감하는 효과 를 이룰 수 있는 데, 이와 같은 효과는 모두 기존의 상황을 대폭 개선하고 고객의 수요를 잘 만족시킬 수 있다.본 발명은 이형 강판, 이형 홀, 프로파일 모델링 양면 모따기 가공작업에 부합되고 선박, 우주항공, 석유화학공 업, 야금, 원자력 발전, 강철구조 등 다양한 업계의 강판 모따기 설비에 적용될 수 있어 시장 전망이 아주 좋다."}
{"patent_id": "10-2021-0046804", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명이 해결하는 기술문제, 이용하는 기술방안과 도달하려는 기술효과를 더 명확히 하기 위해, 도면 및 실시예와 결합하여 본 발명을 진일보 상세히 설명한다. 여기에서 설명하는 구체 실시예는 본 발명을 해석하 는 데만 사용하고 본 발명을 제한하지 않는다는 것은 이해할 수 있을 것이다. 또한 무엇보다도, 서술하는 데 편 리하도록 도면 중에는 전부 내용이 아닌 본 발명과 관련된 부분만 도시되었다. 도 1은 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 입체도 1이고(위에서 아래로 관찰한 경 우); 도 2는 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 입체도 2이고(아래에서 위로 관찰 한 경우); 도 3은 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 정면도이고; 도 4는 본 발명 에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 좌측면도이고; 도 5는 본 발명에 따른 이형 강판 지능 형 모따기 가공 유닛 헤드 장치의 우측면도이고; 도 6은 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤 드 장치의 조감도이고; 도 7은 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 저면도이다. 도 1 내지 도 7에서 도시하는 바와 같이, 본 발명 실시예에서 제공하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치는 단일 축 로봇, z축 이동기구, 회전기구와 가공실행기구를 포함한다. 상기 단일 축 로봇은 갠트리(gantry) 단말의 z축 방향에 장착하는 데 사용한다. 단일 축 로봇은 z축 이 동기구 및 그 상부의 모든 기구를 구동하여 z축 방향에서 이동하도록 할 수 있다. 갠트리는 이형 강판 지능형 모따기 가공 장치의 주요 어셈블리이다. 상기 z축 이동기구는 단일 축 로봇의 작동단에 슬라이딩식으로 연결하고, 상기 z축 이동기구에는 회전기구를 설치한다. 상세하게, 상기 z축 이동기구는 Z축 슬라이딩 프레임, 축방향 압착 실린더와 하향 압착 지지대 를 포함하며; 상기 Z축 슬라이딩 프레임은 직선형 슬라이드 레일과 슬라이드 블록을 통해 단일 축 로봇 의 작동단에 슬라이딩식으로 연결하고, 상기 Z축 슬라이딩 프레임에는 축방향 압착 실린더를 고정해 장착하되, 상기 축방향 압착 실린더의 플런저(plunger)는 Z축 슬라이딩 프레임을 관통하며; 상기 Z축 슬 라이딩 프레임에는 z축 방향으로 하향 압착 지지대를 슬라이딩식으로 연결하고, 상기 축방향 압착 실린더 의 플런저단은 하향 압착 지지대와 연결한다. 상기 하향 압착 지지대의 바닥면은 홀을 뚫는다. 상기 Z 축 슬라이딩 프레임은 제1 정밀 감압 밸브가 장착되고 축방향 압착 실린더와 제1 정밀 감압 밸브(1 8)의 매칭 작용은 하향 압착 지지대 및 그 상부의 모든 기구가 z축 방향에서 하향의 일정한 압력이 발생하도 록 하여 최종적으로는 밀착형 디스크 바닥부의 다수 개 베어링 볼의 일정한 하중이 가공할 강판 상표면 을 누르도록 한다. 상기 회전기구는 회전 지지대와 회전 모터를 포함하며; 상기 회전 지지대는 베어링을 통해 z축 이동기 구 하방에 회전하여 연결하며, 베이링 아웃 링(out ring)은 하향 압착 지지대와 고정해 연결하되, 상세하게 는, 하향 압착 지지대의 뚫린 홀 하방에 연결한다. 상기 회전 지지대에는 제2 정밀 감압 밸브가 장착 된다. 베어링 이너 링(inner ring)은 부싱(bushing)을 통해 가죽벨트 롤러가 고정해 장착된다. 상기 회전 모터 는 z축 이동기구, 상세하게는, 하향 압착 지지대의 일측에 설치하고, 상기 회전 모터의 메인축은 가죽 벨트와 가죽벨트 롤러를 통해 베어링 이너 링과 전동식으로 연결한다. 회전 모터는 회전 지지대 및 그 상부의 모든 기구가 하향 압착 지지대 내부에서 회전 동작을 실시하는 것을 구동할 수 있다. 상기 가공실행기구는 메인축 프레임, 반경방향의 압착 에어실린더,메인축 모터, 자동 변환 커터기계 메인축과 전용 밀링 커터(milling cutter)를 포함하며; 상기 메인축 프레임은 반경방향으로 슬라이 드 레일 슬라이드 블록을 통해 회전 지지대에 슬라이딩식으로 연결하며; 상기 반경방향의 압착 에어실린더 는 회전 지지대에 장착하고, 상기 반경방향의 압착 에어실린더의 플런저단은 메인축 프레임과 고정 해 연결하며; 상기 메인축 프레임에는 자동 변환 커터기계 메인축을 설치하고, 상기 자동 변환 커터기계 메인축 바닥부는 전용 밀링 커터를 장착하며, 상기 전용 밀링 커터에는 롤러 밀착형 베어링이 장착된다. 상기 메인축 프레임 꼭대기부는 칼갈기 실린더가 더 장착되고, 상기 칼갈기 실린더는 하 향 압착 지지대의 바닥면에 뚫린 홀을 관통하되, 상기 칼갈기 실린더의 피스톤 로드는 자동 변환 커터기 계 메인축 중에 뻗어 들어가며; 상기 메인축 프레임의 일측은 메인축 모터를 설치하고, 상기 메인축 모터의 출력단과 자동 변환 커터기계 메인축의 입력단은 가죽벨트와 가죽벨트 롤러를 통해 전동식으로 연결한다. 이외에도, 상기 메인축 프레임 일측 z축 방향에는 디스크 밀착형 프레임 전동 실린더가 고정해 장착되고 디스크 밀착형 프레임 전동 실린더의 작동단은 밀착형 디스크가 장착되며, 상기 밀착형 디스크는 전용 밀링 커터(milling cutter) 주변에 설치하고 상기 밀착형 디스크 바닥부는 다수 개의 베어링 볼 을 설치한다. 상기 밀착형 디스크는 균일하게 배치된 다수 개의 커넥트 로드를 통해 메인축 프레임 에 장착하며; 또는 상기 밀착형 디스크는 디스크 밀착형 프레임을 통해 디스크 밀착형 프레임 전동 실 린더의 작동단에 고정해 장착하고 디스크 밀착형 프레임 전동 실린더는 밀착형 디스크의 승강을 제 어할 수 있다. 본 발명이 제공하는 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 작동 원리는 아래와 같다. 단일 축 로봇 은 z축 이동기구 및 그 상부의 모든 기구를 구동하여 z축 방향에서 이동하도록 할 수 있다. 회전 모터는 회전 지지대 및 그 상부의 모든 기구가 하향 압착 지지대 내부에서 회전 동작을 실시하는 것을 구동할 수 있다. 메인축 모터가 작동하고 출력단은 자동 변환 커터기계 메인축을 움직여 회전시키며, 더 나아가, 전용 밀링 커터을 움직여 회전 동작을 실시하도록 한다. 자동 변환 커터기계 메인축은 커터를 자동으로 교체할 수 있다. 축방향 압착 실린더와 제1 정밀 감압 밸브의 매칭 작용은 하향 압착 지지대 및 상부 의 모든 기구가 z축 방향에서 하향의 일정한 압력이 발생하도록 하여 최종적으로는 밀착형 디스크 바닥부의 다수 개 베어링 볼의 일정한 하중이 가공할 강판 상표면을 누르도록 한다. 반경방향의 압착 에어실린더 와 제2 정밀 감압 밸브의 매칭 작용은 메인축 프레임 및 그 상부의 모든 기구가 어느 반경방향에서 일 정한 압력을 제어할 수 있고 반경방향의 압착 에어실린더와 회전기구의 매칭은 수평 반경방향으로 가공할 가 장자리에 수직되게 밀착형의 일정한 하중을 발생시켜 최종적으로는 전용 밀링 커터의 롤러 밀착형 베어링 아웃 링의 일정한 압력이 가공할 강판의 가공할 가장자리를 누르도록 한다. 본 발명은 종향과 횡향으로 하 중을 제어할 수 있다. 사용할 때 본 발명에 따른 유닛 헤드 장치를 이축 갠트리(gantry)에 장착하고 이형 강판 지능형 모따기 가공 장 치를 스캔한 후, 본 발명의 유닛 헤드 장치를 가공할 홀과 가장자리까지 이동시키며, 회전기구는 스캔된 윤곽을 통해 가공할 가장자리에 수직되도록 회전하며, 반경방향의 압착 에어실린더는 밀링 커터(milling cutter)가 가공할 위치를 누르도록 한다. 상하 양면 모따기는 상하 모따기의 전용 밀링 커터를 매칭하여 구 현할 수 있고, 하면 모따기 가공은 강판을 일정한 높이로 받쳐 주어 가공할 가장자리를 피해야 한다. 이형 강판 지능형 모따기 가공 장치의 이론적 가공 경로가 실제와 편차가 발생하는 상황에 관해서, 본 발명에 따른 유닛 헤드 장치는 하중을 일정하게 제어하여 밀착형 롤러로 매칭하고, 편차를 보완하여 이형 강판의 가장자리를 프로 파일 모델링(profile modelling)하여 양면 모따기 가공 작업을 실시할 수 있다. 무엇보다도, 상기 각 실시예는 본 발명의 기술방안을 설명하는 데만 사용하고 그를 제한하지 않으며; 상기 각"}
{"patent_id": "10-2021-0046804", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "실시예를 참조하여 본 발명을 상세히 설명하였지만, 본 기술분야의 통상적인 지식인들은 상기 각 실시예에 기재 된 기술방안을 수정하거나 또는 그 중 일부 또는 전부 기술특징을 등가적으로 치환하여도 상응되는 기술방안의 본질은 본 발명의 각 실시예에 따른 기술방안의 범위를 벗어나지 않는다는 것을 이해하여야 할 것이다."}
{"patent_id": "10-2021-0046804", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 입체도 1이고; 도 2는 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 입체도 2이고; 도 3은 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 정면도이고; 도 4는 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 좌측면도이고; 도 5는 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 우측면도이고; 도 6은 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 조감도이고; 도 7은 본 발명에 따른 이형 강판 지능형 모따기 가공 유닛 헤드 장치의 저면도이다."}
