{"patent_id": "10-2021-0022755", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0118822", "출원번호": "10-2021-0022755", "발명의 명칭": "지능형 안전모 및 이를 구비한 안전 관리 시스템", "출원인": "이경복", "발명자": "이경복"}}
{"patent_id": "10-2021-0022755", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "산업 재해가 발생할 수 있는 현장에서 사용되는 지능형 안전모로서, 상기 안전모에 장착되고, 서버로부터 현장의 위험 요소 정보를 수신하는 무선 안테나, 상기 안전모에 장착되고 상기 무선 안테나를 통해 수신된 위험 요소 정보를 처리하는 무선 네트워크 모듈,상기 무선 네트워크 모듈에서 처리된 위험 요소 정보에 따라 위험 요소별 점등을 실행하는 LED 표시부, 상기 무선 네트워크 모듈 및 LED 표시부에 전원을 공급하는 전원부를 포함하는 것을 특징으로 하는 지능형 안전모."}
{"patent_id": "10-2021-0022755", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "현장의 상태를 촬영하는 카메라,상기 카메라로부터의 영상 정보를 수신하고 현장의 안전 상태를 판단하는 서버, 청구항 제1항 지능형 안전모,상기 영상 정보를 수신하는 관리자 단말기를 포함하는 것을 특징으로 하는 안전 관리 시스템."}
{"patent_id": "10-2021-0022755", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서,상기 서버는 상기 영상 정보를 수신하는 수신부,상기 수신부에서 수신된 영상 정보에서 위험 요소 데이터로 취득하는 데이터 취득부, 상기 데이터 취득부에서 취득된 위험 요소 데이터를 학습하는 학습부,상기 학습부에서의 학습 결과에 따라 상기 영상 정보에서의 위험 요소를 판단하는 판단부,상기 판단부에서의 판단 결과를 상기 안전모 또는 관리자 단말기로 송신하는 송신부를 포함하는 것을 특징으로하는 안전 관리 시스템."}
{"patent_id": "10-2021-0022755", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에서,상기 판단부는 작업자의 안전 상태 또는 작업 현장의 안전 상태에 따른 위험 요소를 판단하고, 상기 관리자 단말기에는 상기 영상 정보에 부가하여 위험 요소 부분이 표시되는 것을 특징으로 하는 안전 관리시스템."}
{"patent_id": "10-2021-0022755", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에서,공개특허 10-2022-0118822-3-상기 학습부는 상기 영상 정보의 반복 학습을 위한 텐서플로우(TensorFlow) 라이브러리를 적용하고, 다층 퍼셉트론이 가능한 케라스(Keras)가 적용되며, 상기 영상 정보에서 이미지를 인식하기 위해 합성곱신경망(Convolutional Neural Network, CNN)이 적용되고, 상기 데이터 취득부는 상기 케라스의 이미지 데이터 제너레이터(Image data generator)를 이용하여 작업자의 전신 및 보호장비 이미지 및 현장의 설계 정보를 기초로 초기 학습에 필요한 데이터셋을 생성하는 것을 특징으로하는 안전 관리 시스템."}
{"patent_id": "10-2021-0022755", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "산업 재해가 발생할 수 있는 현장에서 작업의 위험 요소를 검지하고 작업자 또는 관리자에게 위험 상태를 통지하 여 산업 재해를 방지할 수 있는 지능형 안전모 및 이를 구비한 안전 관리 시스템에 관한 것으로, 현장의 상태를 촬영하는 카메라, 상기 카메라로부터의 영상 정보를 수신하고 현장의 안전 상태를 판단하는 서버, 지능형 안전모, 상기 영상 정보를 수신하는 관리자 단말기를 포함하는 구성을 마련하여, 관리자가 위험 상태 정보를 용 이하게 인식할 수 있다."}
{"patent_id": "10-2021-0022755", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지능형 안전모 및 이를 구비한 안전 관리 시스템에 관한 것으로, 특히 산업 재해가 발생할 수 있는 현장에서 작업의 위험 요소를 검지하고 작업자 또는 관리자에게 위험 상태를 통지하여 산업 재해를 방지할 수 있는 지능형 안전모 및 이를 구비한 안전 관리 시스템에 관한 것이다."}
{"patent_id": "10-2021-0022755", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "산업기술의 발전에 따라 건설 현장, 제철소, 조선소 또는 기계 공장과 같은 산업 현장이 대형화되고 복잡해지면 서, 작업자들의 안전성과 작업 효율 향상을 위해 안전모나 장갑 등과 같은 보호장구들 또한 발전하고 있다. 특히, 건설 현장의 경우 다른 곳보다도 빈번하게 위험에 노출되므로 항상 안전이 중요시되는 장소이며, 건설 현 장에서는 사람이 항상 불안전한 구조물을 이동해야 하므로 낙사 사고의 위험이 크다. 또한, 중장비의 사용으로 인하여 다칠 위험이 있고 떨어지는 물체에 의해 상해를 입을 위험이 있다. 공사 또는 건설 현장 작업장에서 사 고 유형 중 가장 많은 부분을 차지하는 사고는 추락이나 낙하 등으로 인한 사망사고이다. 이러한 상황에서 안전모는 사람의 신체 중 중요한 부위인 머리를 보호함으로써 위험에서 사람을 보호하게 된다. 즉, 안전모는 작업현장에서 작업자의 머리를 보호하기 위해서 사용되는 모자로서, 강화 플라스틱 또는 금속 등 으로 만들어지고 작업자의 머리를 감싸는 구조를 갖는다. 한편, 최근에는 건축공사 또는 토목공사 등에서 작업자가 이동 중 또는 작업 중에 위험구역을 적시에 인지하지 못하여 많은 추락사고와 안전사고가 발생하고 있고, 이를 예방하기 위한 다양한 기술이 개발되고 있다. 이와 같은 안전모를 적용한 기술의 일 예가 하기 문헌 1 내지 3 등에 개시되어 있다. 예를 들어, 하기 특허문헌 1에는 안전모와 일체화된 카메라를 통해 작업자가 바라보는 실제환경 이미지를 입력 받는 영상 입력부를 포함하는 입력부, 상기 영상 입력부로부터 입력받은 실제환경 이미지를 분석하여 실제환경 을 인식하고, 실제환경 이미지에 가상 콘텐츠를 정합하여 증강현실 콘텐츠를 생성하는 영상 처리부를 포함하는 프로세서 및 상기 영상 처리부에서 생성된 증강현실 콘텐츠를, 상기 안전모와 일체화된 착용형 디스플레이를 통 해 출력하는 영상 출력부를 포함하는 출력부를 구비한 작업 가이드용 모듈 일체형 안전모 장치에 대해 개시되어 있다. 또 하기 특허문헌 2에는 복수개의 스마트 안전모 세트 및 서버를 포함하고, 복수개의 스마트 안전모 세트는 작업자에 착용되어 작업자가 위치한 작업환경에 대한 데이터를 생성하여 서버로 전송하며, 각 스마트 안전모 세 트는 도 1에 도시된 바와 같이, 안전모, 안전모 밴드, 각 작업자가 직접 착용하는 이어셋, 데이터 처리장치, 케이블 및 작업환경을 촬영한 영상 데이터를 생성하는 카메라를 포함하며, 케이블을 통해 상 기 안전모 밴드로 전원을 공급하고, 상기 케이블을 통해 상기 안전모 밴드로부터 수신되는 상기 영상 데이터 또 는 센싱 데이터를 처리하는 스마트 안전모 제어 시스템에 대해 개시되어 있다. 한편, 하기 특허문헌 3에는 카메라 감시구역의 영상 신호를 수신하는 수신부, 상기 영상 신호로부터 객체의 크 기와 윤곽선을 기초로 사람임을 판별하고, 사람 머리부분 RGB(Red, Green, Blue)값 또는 HSV(Hue, Saturation, Value)의 색상(H)값 중 적어도 하나 이상을 기초로 안전모 착용 여부를 판별하는 처리부 및 안전모 미착용자 판 별시 상기 안전모 미착용자의 썸네일 영상을 획득하기 위한 PTZ(Pan-Tilt-Zoom) 카메라 제어 신호를 출력하는 송신부를 포함하되, 상기 카메라는 소정 기준 값 이하의 해상도를 가지는 카메라이고, 상기 처리부의 안전모 착용 여부 판별은 상기 RGB 값과 미리 설정된 기준 RGB 값의 비교 결과에 기초하거나 상기 HSV의 색상(H) 값과 미 리 설정된 기준 HSV의 색상(H) 값의 비교 결과에 기초하는 안전모 착용 비전 감시 시스템에 대해 개시되어 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제2013-0067450호(2013.06.24 공개) (특허문헌 0002) 대한민국 등록특허공보 제10-1884536호(2018.07.26 등록) (특허문헌 0003) 대한민국 등록특허공보 제10-1033349호(2011.04.28 등록)"}
{"patent_id": "10-2021-0022755", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같은 특허문헌 1에 개시된 기술에서는 안전모와 일체화된 카메라를 통해 작업자가 바라보는 실제환 경 이미지에 가상 콘텐츠를 정합하여 증강현실 콘텐츠를 생성하고, 이를 안전모와 일체화된 착용형 디스플레이 를 통해 작업자에게 제공하여 작업현장에서 두꺼운 매뉴얼이나 인스트럭터의 도움없이 작업을 원활히 진행할 수 있지만, 작업자의 안전 관리를 위한 위험 요소의 검지 및 알람을 실행할 수 있는 기술에 대해서는 개시되어 있 지 않았다. 또 상기 특허문헌 2에서는 통신모듈 및 전원공급장치를 안전모와 분리하여 구성하고, 안전모에 장착되는 카메라 를 이용하여 영상회의를 수행할 수 있는 산업현장의 안전관리를 위한 스마트 안전모 제어 시스템을 제공하고, 상기 특허문헌 3에서는 카메라 감시구역 내의 안전모 미착용자를 인식하고, 안전모 미착용자에게 경고 메시지를 전송함으로써 안전사고를 예방할 수 있는 기술에 대해서만 개시되어 있을 뿐, 산업 재해가 발생할 수 있는 현장 에서의 위험 요소를 작업자 또는 안전 관리자가 인식할 수 없다는 문제가 있었다. 본 발명의 목적은 상술한 바와 같은 문제점을 해결하기 위해 이루어진 것으로서, 산업 재해가 발생할 수 있는 현장에서 작업자의 보호구 착용 및 위험 구역으로 접근하는 것을 관리자가 용이하게 검지하여 산업 재해를 방지 할 수 있는 지능형 안전모 및 이를 구비한 안전 관리 시스템을 제공하는 것이다. 본 발명의 다른 목적은 딥러닝 학습에 의해 영상 정보에서 정확한 안전 상태 정보를 취득할 수 있는 지능형 안 전모 및 이를 구비한 안전 관리 시스템을 제공하는 것이다."}
{"patent_id": "10-2021-0022755", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위해 본 발명에 따른 지능형 안전모는 산업 재해가 발생할 수 있는 현장에서 사용되는 지 능형 안전모로서, 상기 안전모에 장착되고, 서버로부터 현장의 위험 요소 정보를 수신하는 무선 안테나, 상기 안전모에 장착되고 상기 무선 안테나를 통해 수신된 위험 요소 정보를 처리하는 무선 네트워크 모듈, 상기 무선 네트워크 모듈에서 처리된 위험 요소 정보에 따라 위험 요소별 점등을 실행하는 LED 표시부, 상기 무선 네트워 크 모듈 및 LED 표시부에 전원을 공급하는 전원부를 포함하는 것을 특징으로 한다. 또한, 상기 목적을 달성하기 위해 본 발명에 따른 안전 관리 시스템은 현장의 상태를 촬영하는 카메라, 상기 카 메라로부터의 영상 정보를 수신하고 현장의 안전 상태를 판단하는 서버, 상술한 지능형 안전모, 상기 영상 정보 를 수신하는 관리자 단말기를 포함하는 것을 특징으로 한다. 또 본 발명에 따른 안전 관리 시스템에서, 상기 서버는 상기 영상 정보를 수신하는 수신부, 상기 수신부에서 수 신된 영상 정보에서 위험 요소 데이터로 취득하는 데이터 취득부, 상기 데이터 취득부에서 취득된 위험 요소 데 이터를 학습하는 학습부, 상기 학습부에서의 학습 결과에 따라 상기 영상 정보에서의 위험 요소를 판단하는 판단부, 상기 판단부에서의 판단 결과를 상기 안전모 또는 관리자 단말기로 송신하는 송신부를 포함하는 것을 특 징으로 한다. 또 본 발명에 따른 안전 관리 시스템에서, 상기 판단부는 작업자의 안전 상태 또는 작업 현장의 안전 상태에 따 른 위험 요소를 판단하고, 상기 관리자 단말기에는 상기 영상 정보에 부가하여 위험 요소 부분이 표시되는 것을 특징으로 한다. 또 본 발명에 따른 안전 관리 시스템에서, 상기 학습부는 상기 영상 정보의 반복 학습을 위한 텐서플로우 (TensorFlow) 라이브러리를 적용하고, 다층 퍼셉트론이 가능한 케라스(Keras)가 적용되며, 상기 영상 정보에서 이미지를 인식하기 위해 합성곱신경망(Convolutional Neural Network, CNN)이 적용되고, 상기 데이터 취득부는 상기 케라스의 이미지 데이터 제너레이터(Image data generator)를 이용하여 작업자의 전신 및 보호장비 이미지 및 현장의 설계 정보를 기초로 초기 학습에 필요한 데이터셋을 생성하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0022755", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이, 본 발명에 따른 지능형 안전모 및 이를 구비한 안전 관리 시스템에 의하면, 안전모에 위험 요소 정보에 따라 위험 요소별 점등을 실행하는 LED 표시부를 마련하는 것에 의해 관리자가 위험 상태 정보를 용이하게 인식할 수 있다는 효과가 얻어진다. 또 본 발명에 따른 지능형 안전모 및 이를 구비한 안전 관리 시스템에 의하면, 카메라에서 촬영된 영상 정보에 대한 데이터 취득부 및 학습부의 딥러닝에 의해 산업 재해가 발생할 수 있는 현장에서 정확한 영상 정보를 취득 할 수 있다는 효과도 얻어진다."}
{"patent_id": "10-2021-0022755", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 상기 및 그 밖의 목적과 새로운 특징은 본 명세서의 기술 및 첨부 도면에 의해 더욱 명확하게 될 것 이다. 본 발명의 안전 관리 시스템에서 작업자의 안전 상태 또는 작업 현장의 안전 상태에 적용되는 용어 \"딥러닝 모 듈\"은 CNN(Convolutional Neural Network) 구조를 기반으로 마련될 수 있으며, 이 CNN은 인공 신경 회로망 (ANN, Artificial Neural Networks)의 일종이며, 인공 신경 회로망은 신경 뉴런(Neuron) 구조를 본떠 만든 것으로 뉴런과 뉴런 사이의 시냅스(Synapse)의 연결 구조를 본떠 패턴이나 알고리즘을 학습할 수 있도록 만들어진 망으로써, 예를 들어 도 2에 도시된 바와 같이, 입력층(Input Layer), 은닉층(Hidden Layer), 출력층(Output Layer) 형태를 기본으로 각 층의 방식에 따라 다양한 종류로 나눌 수 있다. 즉 CNN은 작업자의 영상 또는 작업 현장의 영상에 대한 입력, 특징 추출, 특징을 위치변경이나 왜곡에 따라 변함이 없게 처리, 분류 및 출력하도록 구성된다. 또 본 발명에 적용되는 딥러닝 분석용 시각 이미지는 서로 연관이 있는 정보들이 특정 공간, 형태상에서 색깔, 질감, 포토로지 등의 형태로 공간상의 상관관계를 가진다. 예를 들어, 이미지 상의 고양이를 분석하는 경우를 보면 고양이에 관련된 정보는 필연적으로 이미지 상의 특정 지점에 분포되어 있으며, 고양이의 특징을 판단할 수 있는 귀, 눈, 입, 수염 등 상관관계가 있는 정보가 공간상에서 특정한 형태로 분포되어 있다. 따라서 본 발 명에서는 작업자의 영상 또는 작업 현장의 영상에 대해 특정한 이미지 변환 기법을 이용하여 시계열 데이터의 정보가 공간상에 특정한 포토로지적 성격을 가지고 상관관계를 갖도록 변환하여 딥러닝의 활용성을 높이는 것이다. 즉, 본 발명에서는 딥러닝 분석의 성능을 증대시키기 위하여 주어진 시계열 데이터를 이미지로 변환하여 분석의 성능을 증대시키는 것으로서, 예를 들어 작업자의 영상 또는 작업 현장의 영상 분석에 특화된 이미지 변환 기법 을 적용하여 작업자의 안전 상태 또는 작업 현장의 안전 상태를 판단할 수 있다. 이하, 본 발명에 따른 안전모에 대해 도면에 따라서 설명한다. 도 3은 본 발명에 적용되는 안전모의 구조를 나타내는 블록도이다. 본 발명에 따른 안전모는 산업 재해가 발생할 수 있는 현장에서 사용되는 지능형 안전모로서, 도 3에 도시 된 바와 같이, 상기 안전모에 장착되고, 서버로부터 현장의 위험 요소 정보를 수신하는 무선 안테나, 상기 안전모에 장착되고 상기 무선 안테나를 통해 수신된 위험 요소 정보를 처리하는 무선 네트워크 모듈, 상기 무선 네트워크 모듈에서 처리된 위험 요소 정보에 따라 위험 요소별 점등을 실행하는 LED 표시부, 상기 무선 네트워크 모듈 및 LED 표시부에 전원을 공급하는 전원부를 포함한다. 상기 무선 안테나는 안전모에서 돌출하여 안전모의 좌측 또는 우측에 마련될 수 있고, 서버와의 통신은 예를 들어, 협대역 사물인터넷(NB-IoT) 방식, UNB(Ultra Narrow-Band) 모듈레이션 방식, Wi-Sun(Smart utility networks) 방식, 지그비(ZigBee) 방식, ISM(Industry-Science-Medical) 밴드 방식, RF 통신 방식, 블 루투스(BLE) 방식 중의 어느 하나로 실행될 수 있다. 상기 무선 네트워크 모듈은 IO 보드 상에 마련되고, 상기 안테나와 유선으로 연결된 RF 통신부, RF 통신부의 통신 상태를 제어하는 통신 제어부를 포함할 수 있다. 이와 같은 무선 네트워크 모듈은 예를 들 어 안전모의 외측에서 밴드 결합 또는 헤드폰과 같은 방식에 의해 마련될 수 있다. 상기 LED 표시부는 다양한 색상으로 표시될 수 있도록 다수의 LED 발광부를 구비할 수 있다. 예를 들어, 정상 상태에서는 녹색 발광, 작업자의 안전 상태 이상일 때는 황색 발광, 작업 현장의 안전 상태 이상일 때는 적색 발광의 구조로 마련될 수 있다. 상기 전원부는 통상의 배터리로서, 충전 가능한 배터리를 적용할 수 있다. 또는, 전원부의 크기를 소 형으로 마련하기 위해 버튼형 건전지를 적용할 수도 있다. 다음에 상술한 바와 같은 안전모를 적용한 안전 관리 시스템에 대해 도 4 및 도 5에 따라 설명한다. 도 4는 본 발명에 따른 지능형 안전모를 구비한 안전 관리 시스템의 구성을 설명하기 위한 도면이고, 도 5는 도 4에 도시된 서버의 구성을 설명하기 위한 블록도이다. 본 발명에 따른 안전 관리 시스템은 도 4에 도시된 바와 같이, 지능형 안전모, 현장의 상태를 촬영하는 카 메라, 상기 카메라로부터의 영상 정보를 수신하고 현장의 안전 상태를 판단하는 서버, 상기 영 상 정보를 수신하는 관리자 단말기를 포함할 수 있다. 또 본 발명에 따른 안전 관리 시스템에서는 상기 지 능형 안전모에 대한 정보, 현장의 카메라에 대한 정보, 상기 영상에 관한 정보, 상기 관리자 단말기 에 대한 정보를 저장하는 데이터베이스를 더 포함할 수도 있다. 상기 지능형 안전모는 도 3에 도시된 바와 같은 구조의 지능형 안전모를 적용하며, 상기 카메라는 산 업 재해가 발생할 수 있는 현장에서 설치대 등에 마련된 하우징 상에 장착된다. 즉 상기 카메라는 예를 들 어, 건설 현장의 위험 구역을 촬영하는 구성으로서, 상하 좌우 방향으로 회전 동작 가능하며 소정 각도 범위의 영상이 실시간으로 촬영될 수 있고, 야간에도 위험구역으로 접근하는 작업자를 촬영할 수 있도록 적외선 카메라 를 적용할 수도 있다. 또 상기 카메라에는 광각 렌즈의 기능, 줌 렌즈의 기능, 흔들린 보정 기능 등을 구 비할 수 있고, 촬영된 영상을 서버로 전송하기 위한 송신 모듈이 마련된다. 또한, 상술한 바와 같은 카메 라는 작업 현장의 조건 또는 상황에 따라 다수 곳에 설치될 수 있다. 상기 서버는 통상의 서버로서 일종의 웹서버, 웹서비스 서버, 모바일 웹서버 또는 어플 서버로서 역할을 하도록 구축되는 것이 바람직하다. 또 관리자 단말기에게 안전 상태 정보 등을 제공하기 위한 웹페이지를 제공할 수 있다. 이와 같은 서버는 도 5에 도시된 바와 같이, 상기 영상 정보를 수신하는 수신부, 상기 수신부에 서 수신된 영상 정보에서 위험 요소 데이터로 취득하는 데이터 취득부, 상기 데이터 취득부에서 취득된 위험 요소 데이터를 학습하는 학습부, 상기 학습부에서의 학습 결과에 따라 상기 영상 정보에서의 위험 요소를 판단하는 판단부, 상기 판단부에서의 판단 결과를 상기 안전모 또는 관리자 단말기 로 송신하는 송신부를 포함한다. 상기 수신부와 송신부는 통상의 송수신 모듈로 이루어지고, 근거리 통신을 위한 협대역 사물인터넷 (NB-IoT) 방식, UNB(Ultra Narrow-Band) 모듈레이션 방식, Wi-Sun(Smart utility networks) 방식, 지그비 (ZigBee) 방식, ISM(Industry-Science-Medical) 밴드 방식, RF 통신 방식, 블루투스(BLE) 방식 중의 어느 하나 를 실행할 수 있다. 그러나 이에 한정되는 것은 아니며, 광대역 무선 이동 통신 서비스 등 무선 통신 기술의 발 전에 따라 다양하게 응용 실시할 수 있다. 상기 데이터 취득부는 딥러닝을 위해 카메라에서 촬영된 영상 정보에서 예를 들어, 케라스(Keras)의 이미지 데이터 제너레이터(Image data generator)를 이용하여 작업자의 전신 및 보호장비 이미지 및 현장의 설 계 정보를 기초로 초기 학습에 필요한 데이터셋을 생성한다. 즉 상기 데이터 취득부는 작업자의 보호 장비 로서, 예를 들어 안전모, 안전 조끼, 안전화의 착용 여부, 작업 현장의 위험 요소를 카테고리 별로 나누어 데이 터를 취득하게 한다. 상기 학습부는 상기 데이터 취득부에서 취득된 영상 정보의 반복 학습을 위한 텐서플로우 (TensorFlow) 라이브러리를 적용하고, 다층 퍼셉트론이 가능한 케라스(Keras)가 적용되며, 상기 영상 정보에서 이미지를 인식하기 위해 합성곱신경망(Convolutional Neural Network, CNN)을 적용한다. 즉 학습부에서는 영상 정보로부터 특징을 추출하기 위해 영상 정보를 도 2에 도시된 바와 같은 입력층의 입력 값으로 적용하며, 컨볼루션 레이어(Convolutional layer)를 적용할 수도 있다. 이러한 컨볼루션 레이어는 특징을 추출하는 필터와 상기 필터의 값을 비선형 값으로 바꾸어주는 액티베이션 (Activation) 함수로 이루어지며, 추출된 이미지를 활성맵(Activation map)으로 만든 다음, 만들어진 활성맵에 활성화 함수를 적용시킬 수도 있다. 즉, 활성화 함수로는 예를 들어, ReLu(Rectified Linear Unit)가 적용될 수 있고, 도 2에 도시된 바와 같은 2개의 은닉층(Hidden Layer)을 포함할 수도 있다. 상술한 바와 같은 데이터 취득부와 학습부에서의 딥러닝 방법을 통한 학습 엔진을 구현하여 학습이 진행되고 나면, 카메라에서 촬영된 영상 정보에서 작업자가 검출되고, 작업자로부터 보호장비 착용 여부 (특성)가 추가로 검출될 수 있으며, 검출된 작업자의 이동 경로를 파악하여 위험 구역으로 접근 여부를 판단부 에서 판단할 수 있다. 즉, 판단부는 작업자의 안전 상태 또는 작업 현장의 안전 상태에 따른 위험 요 소를 판단하고, 판단 결과를 상기 안전모의 무선 안테나 또는 관리자 단말기로 송신하게 한다. 한편, 상기 판단부에서의 판단 결과는 예를 들어, 카메라가 설치된 지역의 작업자에게 경고 방송 또 는 경고등의 점멸 등을 실행하게 할 수도 있다. 또한, 상기 판단부에서 판단 결과는 LED 표시부에 정 상 상태인 녹색 발광, 작업자의 안전 상태 이상인 황색 발광, 작업 현장의 안전 상태 이상인 적색 발광이 실현 되도록 구현할 수도 있다. 또 상기 서버에 관한 설명에서, 데이터 취득부, 학습부 및 판단부를 각각 구분하여 설명하 였지만, 이에 한정되는 것은 아니고 프로그램에 의한 일련의 처리에 의해 실현되도록 구성될 수도 있다. 또한, 상기 서버는 예를 들어, 안전모 및 관리자 단말기와의 근거리 통신을 위해 공사 현장의 관리 부 스 내에 설치될 수도 있다. 상기 관리자 단말기는 관리자가 휴대하여 사용할 수 있고, 서버와 데이터 통신을 할 수 있는 통신 기 능을 구비한 것으로서, 스마트폰(Smart Phone), 휴대 단말기(Portable Terminal), 이동 단말기(Mobile Terminal), 개인 정보 단말기(Personal Digital Assistant: PDA), PMP(Portable Multimedia Player) 단말기, 웨어러블 디바이스(Wearable Device, 예를 들어, 워치형 단말기(Smartwatch), 글래스형 단말기(Smart Glass), HMD(Head Mounted Display) 등 포함) 중의 어느 하나 일 수 있다. 그러나 이에 한정되는 것은 아니고, 관리자가 산업 재해가 발생할 수 있는 현장을 사무실에서 관리하기 위해, 개인용 컴퓨터, 노트북 컴퓨터, 슬레이트 PC(Slate PC), 태블릿 PC(Tablet PC), 울트라북(ultrabook), IPTV(Internet Protocol Television) 단말기, 스 마트 TV, 디지털방송용 단말기, AVN(Audio Video Navigation) 단말기, 시스템, 플렉시블 단말기(Flexible Terminal) 등과 같은 다양한 단말기를 적용할 수도 있다. 한편, 상기 관리자 단말기에는 상기 영상 정보에 부가하여 판단부에 의해 판단된 위험 요소 부분이 표시되도록 구현될 수도 있다. 또한, 상기 관리자 단말기는 인접한 작업 현장에서의 공동 통제 및 지시를 위해 관리자 단말기 간의 정보 공유 시스템으로 마련될 수도 있다. 이상 본 발명자에 의해서 이루어진 발명을 상기 실시 예에 따라 구체적으로 설명하였지만, 본 발명은 상기 실시 예에 한정되는 것은 아니고 그 요지를 이탈하지 않는 범위에서 여러 가지로 변경 가능한 것은 물론이다. 산업상 이용가능성 본 발명에 따른 지능형 안전모 및 이를 구비한 안전 관리 시스템을 사용하는 것에 의해 관리자가 위험 상태 정 보를 용이하게 인식할 수 있다."}
{"patent_id": "10-2021-0022755", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 기술에 따른 산업현장의 안전관리를 위한 스마트 안전모 제어 시스템의 구성을 나타내는 도면, 도 2는 CNN(Convolutional Neural Network) 구조의 일 예를 나타내는 도면, 도 3은 본 발명에 적용되는 안전모의 구조를 나타내는 블록도, 도 4는 본 발명에 따른 지능형 안전모를 구비한 안전 관리 시스템의 구성을 설명하기 위한 도면, 도 5는 도 4에 도시된 서버의 구성을 설명하기 위한 블록도."}
