{"patent_id": "10-2024-0044371", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0149333", "출원번호": "10-2024-0044371", "발명의 명칭": "전하저장형 터널링 트랜지스터 소자 및 이의 제조방법과 그 부울 논리 연산 방법", "출원인": "서울대학교산학협력단", "발명자": "최우영"}}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "반도체 기판;상기 반도체 기판 상에 형성된 게이트;상기 게이트의 하부에 형성된 채널 영역으로 서로 이격된 소스 영역 및 드레인 영역;상기 게이트와 상기 채널 영역 사이에 형성된 유전체층; 및상기 유전체층에 상호 이격되어 매립되고 상호 독립적으로 전하를 저장하는 제1 및 제2 전하저장층들을 포함하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 유전체층은상기 게이트와 상기 채널 영역 사이에 1차적으로 형성되고 적어도 일부가 상기 채널 영역과 중첩되는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 유전체층은상기 소스 영역과 상기 드레인 영역 상에 2차적으로 형성되는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 유전체층은상기 제1 및 제2 전하저장층들의 물질들의 일함수를 기초로 서로 다른 유전율을 가지는 제1 유전율 유전막 물질또는 제2 유전율 유전막 물질로 형성되는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 제1 유전율 유전막 물질은실리콘 산화막(SiO2) 및 실리콘 옥시나이트라이드(SiON) 중 하나를 포함하는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서, 상기 제2 유전율 유전막 물질은스트론튬 산화막(SrO), 알루미늄 산화막(A12O3), 마그네슘 산화막(MgO), 스칸듐 산화막(Sc2O3), 가돌리늄 산화막(Gd2O3), 이트륨 산화막(Y2O3), 사마륨 산화막(Sm2O3), 하프늄 산화막(HfO2), 지르코늄 산화막(ZrO2), 티타늄 산공개특허 10-2024-0149333-3-화막(TiO2), 탄탈 산화막(Ta2O5), 바륨 산화막(BaO) 및 비스무스 산화막(Bi2O3) 중 하나를 포함하는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 제1 및 제2 전하저장층들은선택적인 쓰기(program) 또는 지우기(erase) 동작을 통해 상기 전하의 저장을 독립적으로 혹은 동시에 제어하는것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 제1 및 제2 전하저장층들은상기 소스 영역과 상기 채널 영역 간 일정 수준 이상의 터널링 전류가 흐를 때의 게이트 전압인 임계 전압(Vth)또는 상기 드레인 영역과 상기 채널 영역 간 일정 수준 이상의 터널링 전류가 흐를 때의 게이트 전압인 앰비폴러 전압(Vamb)을 조정하는 쓰기(program) 또는 지우기(erase) 동작을 선택적으로 혹은 동시에 수행 가능한 것을특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 제1 및 제2 전하저장층들은이종 게이트 유전체(hetero gate dielectric)로 형성되고 서로 동일한 물질로 구성되는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 제1 및 제2 전하저장층들은폴리실리콘 또는 Si3N4, HfO2, Al2O3 및 이들의 조합 중 선택된 하나의 물질로 형성되는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 제1 및 제2 전하저장층들은상기 소스 영역 및 상기 드레인 영역에 있는 2차적으로 형성되는 유전체층의 상부에 각각 형성되는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "반도체 기판 상부에 유전체층 및 게이트층을 형성하는 단계;상기 반도체 기판 내에 소스 영역, 드레인 영역 및 채널 영역을 형성하는 단계;상기 유전체층의 양측면을 식각하여 상기 게이트층의 하단 양측에 언더 컷 형태의 공간을 형성하는 단계;상기 유전체층을 포함하는 전체 표면에 산화 공정을 통해 산화막을 형성하고 상기 공간이 매립되도록 상기 전체표면을 따라 전하저장층을 형성하는 단계; 및상기 산화막 및 전하저장층을 식각하여 상기 유전체층에 상호 이격되어 매립된 제1 및 제2 전하저장층들을 형성공개특허 10-2024-0149333-4-하는 단계를 포함하는 전하저장층 터널링 트랜지스터 소자의 제조방법."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 유전체층은 실리콘 산화막(SiO2)으로 형성되고, 기화 불산 식각(HF vapor etch) 공정을 수행하여 상기 공간을 형성하는 것을 특징으로 하는 전하저장층 터널링 트랜지스터 소자의 제조방법."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 제1 및 제2 전하저장층들은쓰기(program) 및 지우기(erase) 동작을 선택적으로 혹은 동시에 수행하여 상호 독립적으로 전하를 저장하는 것을 특징으로 하는 전하저장층 터널링 트랜지스터 소자의 제조방법."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "게이트와 채널 영역 사이에 형성된 유전체층에 상호 이격되어 매립되고 상호 독립적으로 전하를 저장하는 제1및 제2 전하저장층들을 초기 상태(initial state)로 설정하는 제1 단계;선택적인 쓰기(program) 또는 지우기(erase) 동작을 수행하여 부울 논리 연산하는 제2 단계; 및상기 부울 논리 연산의 결과에 대해 읽기(read) 동작을 수행하는 제3 단계를 포함하는 전하저장형 터널링 트랜지스터 소자의 부울 논리 연산 방법."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 제1 단계는 상기 채널 영역과 소스 영역 간의 임계 전압(Vth) 또는 상기 채널 영역과 드레인 영역 간의 앰비폴러 전압(Vamb)으로 상기 제1 및 제2 전하저장층들을 초기화하는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자의 부울 논리 연산 방법."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서, 상기 제2 단계는상기 제1 전하저장층의 쓰기(program) 또는 지우기(erase) 동작을 수행하여 임계 전압(Vth)의 전압 레벨을 조정하는 단계; 및상기 제2 전하저장층의 쓰기(program) 및 지우기(erase) 동작을 수행하여 앰비폴러 전압(Vamb)의 전압 레벨을 조정하는 단계를 포함하며,상기 임계 전압(Vth)의 전압 레벨 조정과 상기 앰비폴러 전압(Vamb)의 전압 레벨 조정은 독립적으로 수행되는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자의 부울 논리 연산 방법."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서, 상기 제2 단계는공개특허 10-2024-0149333-5-상기 제1 전하저장층에 대해 BBHE(Band-to-band tunneling induced hot-electron injection) 또는 FN(FowlerNordheim) 터널링을 통해 쓰기(program) 또는 지우기(erase) 동작을 수행하는 단계를 포함하는 것을 특징으로하는 전하저장형 터널링 트랜지스터 소자의 부울 논리 연산 방법."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서, 상기 제2 단계는상기 제2 전하저장층에 대해 BBHH(Band-to-band tunneling induced hot-hole injection) 또는 DHE(drain hot-electron injection)를 통해 쓰기(program) 또는 지우기(erase) 동작을 수행하는 단계를 포함하는 것을 특징으로 하는 전하저장형 터널링 트랜지스터 소자의 부울 논리 연산 방법."}
{"patent_id": "10-2024-0044371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서, 상기 제3 단계는게이트 전압(VG)의 전압 레벨을 조정하여 상기 제1 전하저장층 또는 제2 전하저장층의 읽기(read) 동작을 수행하는 단계; 및상기 읽기(read) 동작 시 드레인 전류(ID)의 전류 레벨을 기준 레벨과 비교하여 부울 논리 연산의 결과를 판단하는 단계를 포함하는 것을 특징으로 하는 저장형 터널링 트랜지스터 소자의 부울 논리 연산 방법."}
{"patent_id": "10-2024-0044371", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전하저장형 터널링 트랜지스터 소자 및 이의 제조방법과 그 부울 논리 연산 방법에 관한 것으로, 상기 소자는 반도체 기판; 상기 반도체 기판 상에 형성된 게이트; 상기 게이트의 하부에 형성된 채널 영역으로 서로 이격된 소스 영역 및 드레인 영역; 상기 게이트와 상기 채널 영역 사이에 형성된 유전체층; 및 상기 유전체층에 상호 이격되어 매립되고 상호 독립적으로 전하를 저장하는 제1 및 제2 전하저장층들을 포함한다."}
{"patent_id": "10-2024-0044371", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전하저장형 터널링 트랜지스터 기술에 관한 것으로, 보다 상세하게는 초전력 동작 시 강점을 갖는 터 널링 전계 효과 트랜지스터를 기반으로 부울 논리 연산이 가능한 프로세스 인 메모리(PIM; Process In Memory) 특화용 전하저장형 터널링 트랜지스터 소자 및 이의 제조방법과 그 부울 논리 연산 방법에 관한 것이다."}
{"patent_id": "10-2024-0044371", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전 세계적인 지능형 반도체, 휴대용 전자기기의 수요 증가로 저전력 소자에 대한 필요성 또한 급격히 증가하고 있다. 한편, 기존의 폰 노이만(von Neumann) 구조의 경우, 연산 데이터량이 기하급수적으로 늘어남에 따라 연 산 장치-메모리 유닛 간의 데이터 이동으로 인한 에너지 소모가 심각한 문제로 대두되었다. 최근까지도 반도체 기술 분야에서는 소자의 크기를 줄여 동작 속도를 개선하고 집적도를 향상하기 위한 시도들 이 계속되어 왔다. 그러나, 이로 인한 공정비용의 상승, 단채널 효과로 인한 누설전류 증가 및 게이트 장악력 감소 등의 문제로 추가적인 소자 스케일링에 제동이 걸리는 형상이다. 무어의 법칙 폐기를 선언한 근래의 반도 체 기술 분야의 관심사는 동작 속도의 개선과 집적도의 향상에서 데이터 연산을 위한 기본 구조 변경 혹은 저전 력/고에너지 효율의 소자 구현으로 이동하고 있다. 기존의 폰 노이만 구조를 이용한 연산 방법은 연산 장치와 메모리 유닛 간의 데이터 전송 과정이 필수 불가결한데, 연산에 대량의 데이터가 필요한 경우 이러한 과정에서 소모되는 에너지 손실이 매우 크다는 단점을 갖고 있다. 따라서, 연산 장치-메모리 유닛 간의 데이터 이동으로 인한 에너지 소모 없이 메모리 내에서 연산을 구현하는 기술이 요구되고 있다. 본 발명은 부울 논리 연산(Boolean logic operation)을 수행함에 있어서 연산 장치-메모리 유닛 간의 데이터 이 동 과정을 획기적으로 줄일 수 있는 전하저장형 터널링 트랜지스터 소자를 제안한다. 본 발명에서 제안하는 전 하저장형 터널링 트랜지스터 소자는 대량의 데이터 처리를 요구하는 빅 데이터 시대에 적합한 저전력/고에너지 효율의 새로운 메모리/비메모리 기술 확보에 있어 핵심적인 역할을 할 것이며, 향후 차세대 저전력/고에너지 효 율 메모리/비메모리 시장을 선점하고 선도해 나가는데 기여할 것으로 전망된다.선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2273935호 (2021.06.30.)"}
{"patent_id": "10-2024-0044371", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는 기존 실리콘 CMOS 공정과 호환성이 매우 높은 전하저장형 터널링 트랜지스터를 통해 부 울 논리 연산이 가능한 초저전력 PIM 특화용 전하저장형 터널링 트랜지스터 소자 및 이의 제조방법과 그 부울 논리 연산 방법을 제공하고자 한다."}
{"patent_id": "10-2024-0044371", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예들 중에서, 전하저장형 터널링 트랜지스터 소자는 반도체 기판; 상기 반도체 기판 상에 형성된 게이트; 상기 게이트의 하부에 형성된 채널 영역으로 서로 이격된 소스 영역 및 드레인 영역; 상기 게이트와 상기 채널 영역 사이에 형성된 유전체층; 및 상기 유전체층에 상호 이격되어 매립되고 상호 독립적으로 전하를 저장하는 제1 및 제2 전하저장층들을 포함한다. 상기 유전체층은 상기 게이트와 상기 채널 영역 사이에 1차적으로 형성되고 적어도 일부가 상기 채널 영역과 중 첩될 수 있다. 상기 유전체층은 상기 소스 영역과 상기 드레인 영역 상에 2차적으로 형성될 수 있다. 상기 유전체층은 서로 다른 유전율을 가지는 제1 유전율 유전막 물질 또는 제2 유전율 유전막 물질로 형성될 수 있다. 상기 제1 유전율 유전막 물질은 실리콘 산화막(SiO2) 및 실리콘 옥시나이트라이드(SiON) 중 하나를 포함할 수 있다. 상기 제2 유전율 유전막 물질은 스트론튬 산화막(SrO), 알루미늄 산화막(A12O3), 마그네슘 산화막(MgO), 스칸듐 산화막(Sc2O3), 가돌리늄 산화막 (Gd2O3), 이트륨 산화막(Y2O3), 사마륨 산화막(Sm2O3), 하프늄 산화막(HfO2), 지 르코늄 산화막(ZrO2), 티타늄 산 화막(TiO2), 탄탈 산화막(Ta2O5), 바륨 산화막(BaO) 및 비스무스 산화막(Bi2O3) 중 하나를 포함할 수 있다. 상기 제1 및 제2 전하저장층들은 선택적인 쓰기(program) 또는 지우기(erase) 동작을 통해 상기 전하의 저장을 독립적으로 혹은 동시에 제어할 수 있다. 상기 제1 및 제2 전하저장층들은 상기 소스 영역과 상기 채널 영역 간의 일정 수준 이상의 터널링 전류가 흐를 때의 게이트 전압인 임계 전압(Vth) 또는 상기 드레인 영역과 상기 채널 영역 간 일정 수준 이상의 터널링 전류 가 흐를 때의 게이트 전압인 앰비폴러 전압(Vamb)을 조정하는 쓰기(program) 또는 지우기(erase) 동작을 선택적 으로 혹은 동시에 수행 가능하다. 상기 제1 및 제2 전하저장층들은 이종 게이트 유전체(hetero gate dielectric)로 형성되고 서로 동일한 물질로 구성될 수 있다. 상기 제1 및 제2 전하저장층들은 폴리실리콘 또는 Si3N4, HfO2, Al2O3 및 이들의 조합 중 선택된 하나의 물질로 형성될 수 있다. 상기 제1 및 제2 전하저장층들은 상기 소스 영역 및 상기 드레인 영역에 있는 2차적으로 형성되는 유전체층의 상부에 각각 형성될 수 있다. 실시예들 중에서, 전하저장형 터널링 트랜지스터 소자의 제조방법은 반도체 기판 상부에 유전체층 및 게이트층 을 형성하는 단계; 상기 반도체 기판 내에 소스 영역, 드레인 영역 및 채널 영역을 형성하는 단계; 상기 유전체 층의 양측면을 식각하여 상기 게이트층의 하단 양측에 언더 컷 형태의 공간을 형성하는 단계; 상기 유전체층을 포함하는 전체 표면에 산화 공정을 통해 산화막을 형성하고 상기 공간이 매립되도록 상기 전체 표면을 따라 전 하저장층을 형성하는 단계; 및 상기 산화막 및 전하저장층을 식각하여 상기 유전체층에 상호 이격되어 매립된 제1 및 제2 전하저장층들을 형성하는 단계를 포함한다. 상기 유전체층은 실리콘 산화막(SiO2)으로 형성되고, 기화 불산 식각(HF vapor etch) 공정을 수행하여 상기 공 간을 형성할 수 있다. 상기 제1 및 제2 전하저장층들은 쓰기(program) 및 지우기(erase) 동작을 선택적으로 혹은 동시에 수행하여 상 호 독립적으로 전하를 저장할 수 있다. 실시예들 중에서, 전하저장층 터널링 트랜지스터 소자의 부울 논리 연산 방법은 게이트와 채널 영역 사이에 형 성된 유전체층에 상호 이격되어 매립되고 상호 독립적으로 전하를 저장하는 제1 및 제2 전하저장층들을 초기 상 태(initial state)로 설정하는 제1 단계; 선택적인 쓰기(program) 또는 지우기(erase) 동작을 수행하여 부울 논 리 연산하는 제2 단계; 및 상기 부울 논리 연산의 결과에 대해 읽기(read) 동작을 수행하는 제3 단계를 포함한 다. 상기 제1 단계는 상기 채널 영역과 소스 영역 간의 임계 전압(Vth) 또는 상기 채널 영역과 드레인 영역 간의 앰 비폴러 전압(Vamb)으로 상기 제1 및 제2 전하저장층들을 초기화할 수 있다. 상기 제2 단계는 상기 제1 전하저장층의 쓰기(program) 또는 지우기(erase) 동작을 수행하여 임계 전압(Vth)의 전압 레벨을 조정하는 단계; 및 상기 제2 전하저장층의 쓰기(program) 및 지우기(erase) 동작을 수행하여 앰비 폴러 전압(Vamb)의 전압 레벨을 조정하는 단계를 포함하며, 상기 임계 전압(Vth)의 전압 레벨 조정과 상기 앰비폴 러 전압(Vamb)의 전압 레벨 조정은 독립적으로 수행될 수 있다. 상기 제2 단계는 상기 제1 전하저장층에 대해 BBHE(Band-to-band tunneling induced hot-electron injection) 또는 FN(Fowler Nordheim) 터널링을 통해 쓰기(program) 또는 지우기(erase) 동작을 수행하는 단계를 포함할 수 있다. 상기 제2 단계는 상기 제2 전하저장층에 대해 BBHH(Band-to-band tunneling induced hot-hole injection) 또는 DHE(drain hot-electron injection)를 통해 쓰기(program) 또는 지우기(erase) 동작을 수행하는 단계를 포함할 수 있다. 상기 제3 단계는 게이트 전압(VG)의 전압 레벨을 조정하여 상기 제1 전하저장층 또는 제2 전하저장층의 읽기 (read) 동작을 수행하는 단계; 및 상기 읽기(read) 동작 시 드레인 전류(ID)의 전류 레벨을 기준 레벨과 비교하 여 부울 논리 연산의 결과를 판단하는 단계를 포함할 수 있다."}
{"patent_id": "10-2024-0044371", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 기술은 다음의 효과를 가질 수 있다. 다만, 특정 실시예가 다음의 효과를 전부 포함하여야 한다거나 다 음의 효과만을 포함하여야 한다는 의미는 아니므로, 개시된 기술의 권리범위는 이에 의하여 제한되는 것으로 이 해되어서는 아니 될 것이다. 본 발명의 일 실시예에 따른 전하저장형 터널링 트랜지스터 소자 및 이의 제조방법과 그 부울 논리 연산 방법은 저전력/고에너지 효율의 특성을 갖는 터널링 트랜지스터를 이용함으로써 기존 메모리 공정과 호환성이 높다는 효과를 제공한다. 또한, 대량의 데이터 연산을 필요로 하는 분야 및 낮은 누설 전류를 필요로 하는 에너지 절 약형 반도체 시스템 구현을 가능하게 하며, 더 나아가서 낮은 대기 전력이 요구되는 배터리를 사용하는 휴대용 전자기기에 사용되는 시스템 반도체에도 응용이 가능하며, 메모리 유닛-연산 장치 간 데이터 이동을 획기적으로 감소시키는 효과를 얻을 수 있다."}
{"patent_id": "10-2024-0044371", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 관한 설명은 구조적 내지 기능적 설명을 위한 실시예에 불과하므로, 본 발명의 권리범위는 본문에 설 명된 실시예에 의하여 제한되는 것으로 해석되어서는 아니 된다. 즉, 실시예는 다양한 변경이 가능하고 여러 가지 형태를 가질 수 있으므로 본 발명의 권리범위는 기술적 사상을 실현할 수 있는 균등물들을 포함하는 것으 로 이해되어야 한다. 또한, 본 발명에서 제시된 목적 또는 효과는 특정 실시예가 이를 전부 포함하여야 한다거 나 그러한 효과만을 포함하여야 한다는 의미는 아니므로, 본 발명의 권리범위는 이에 의하여 제한되는 것으로 이해되어서는 아니 될 것이다. 한편, 본 출원에서 서술되는 용어의 의미는 다음과 같이 이해되어야 할 것이다. \"제1\", \"제2\" 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위한 것으로, 이들 용어들에 의해 권리범위가 한정되어서는 아니 된다. 예를 들어, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\"있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결될 수 도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\"있다고 언급된 때에는 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 한편, 구성요소들 간의 관계를 설명하는 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 이웃 하는\"과 \"~에 직접 이웃하는\" 등도 마찬가지로 해석되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, \"포함 하다\"또는 \"가지다\" 등의 용어는 실시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 각 단계들에 있어 식별부호(예를 들어, a, b, c 등)는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단 계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순 서와 다르게 일어날 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 여기서 사용되는 모든 용어들은 다르게 정의되지 않는 한, 본 발명이 속하는 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한 이상적이거나 과도하게 형식적인 의미를 지니는 것으로 해석될 수 없다. 이하 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 이하 도면상의 동일한 구성 요소에 대하여는 동일한 참조 부호를 사용하고, 동일한 구성 요소에 대해서 중복된 설명은 생략한 다. 인공지능 기술 분야는 여러 응용분야에 사용되며 폭발적인 발전을 이루고 있다. 인공지능을 통해 여러 고난이 도 문제들을 해결하려는 시도가 계속되고 있으며, 더욱 정확하고 정밀한 인공지능 구현을 위하여 점점 많은 양 의 데이터 연산이 요구되고 있다. 이에 비해 기존의 연산 처리를 위한 프로세서 기술은 무어의 법칙 한계와 폰 노이만(von Neumann) 아키텍처의 구조적인 문제점으로 인하여 고성능/저전력 인공지능 구현의 발목을 잡고 있는 실정이다. 따라서 인공지능 구현에 최적화된 새로운 컴퓨팅 시스템이 절실히 요구되며, 이러한 기술을 보유한 기업과 국가가 인공지능 기술과 반도체 시장을 선도할 가능성이 높다. 이에 본 발명에서는 연산 장치-메모리 유닛 간의 데이터 이동을 현저히 줄임으로써 고에너지 효율 연산 구현이 가능한 전하저장형 터널링 트랜지스터 소자를 제안함으로써, 향후 급속하게 성장할 에너지 절약 분야에서 경쟁 력을 선점할 수 있으며, 전반적인 차세대 고에너지 효율 메모리/비메모리 반도체 시장을 선도해 나가는데 일조 하고자 한다. 도 1은 폰 노이만(Von Neumann) 구조와 프로세스 인 메모리(PIM; process-in memory) 기술의 동작 방식을 설명 하기 위한 도면으로, 도 1의 (a)는 폰 노이만 구조를 나타내고, 도 1의 (b)는 PIM 기술의 동작 방식을 나타낸다. 폰 노이만 구조는 메모리 유닛(Memory unit)과 연산 장치(Processing unit)가 물리적으로 분리된 구조로, 데이 터 처리를 위해 버스(bus)를 통한 데이터 이동이 필수적이다. 이는 처리해야 하는 데이터의 양이 증가할수록 연산 장치와 메모리 유닛 간 데이터 이동으로 인한 시간 소모 및 에너지 손실이 점차 증가하는 것을 의미한다. 따라서, 인공지능 분야와 같이 대량의 데이터 처리를 요구하는 분야에서 폰 노이만 구조는 연산 시간 및 에너지 소모 면에서 비효율적이다. 이를 해결하기 위해 새로운 beyond von Neumann 컴퓨팅 기술을 구현하고자 하는 여 러 시도들이 계속되고 있다. 이에 본 발명은 실리콘 CMOS 공정과 호환성이 매우 높은 전하저장형 터널링 트랜 지스터를 통해 부울 논리 연산(Boolean logic operation)이 가능한 초저전력 PIM 특화용 전하저장형 터널링 트 랜지스터 소자 제작 및 동작 원리를 제안하고자 한다. 도 2는 본 발명의 일 실시예에 따른 전하저장형 터널링 트랜지스터 소자를 도시한 단면도이다. 도 2를 참조하면, 전하저장형 터널링 트랜지스터 소자는 반도체 기판, 소스 영역, 드레인 영역 , 채널 영역, 유전체층 및 게이트를 포함한다. 반도체 기판은 bulk Si 웨이퍼(wafer)을 통해 형성되거나 또는 SOI(Silicon On Insulator)를 통해 형성될 수 있다. 반도체 기판은 SOI 하단의 매몰 산화막(Buried Oxide, BOX) 및 실리콘 기판으로 형성될 수 있다. 여기에서, SOI는 실리콘 단결정층 사이에 절연층이 형성되어 있는 구조의 기판에 해당할 수 있다. 매몰 산화막은 절연막으로 사용되는 산화층(Oxide layer)으로, 전기적 절연체의 역할뿐만 아니라 집적회로의 제조공 정에서 소자와 소자 간의 격리에 사용되는 산화막에 해당하고, SOI 상의 특정 영역에 불순물을 도핑하는 공정과 정에서 해당 영역 이외의 영역에 대한 확산방지막의 역할을 수행할 수 있다. 이하, 반도체 기판은 반드시 이렇게 한정되는 것은 아니다. 반도체 기판 상에는 게이트가 형성된다. 게이트의 하부에는 채널 영역이 형성된다. 채널 영역은 반도체 기판 내에 소스 영역과 드레인 영역 사이에 형성될 수 있다. 소스 영역 및 드레인 영역은 반도체 기판 내에 채널 영역으로 서로 이격되어 형성된다. 소스 영역 및 드레인 영역은 서로 다른 타입의 불순물이 도핑되어 형성될 수 있다. 예를 들어, 소스영역은 P+ 영역으로 형성되고, 드레인 영역은 N+ 영역으로 형성될 수 있다. 여기에서, N형 불순물은 비소(As), 인(P), 비스무스(Bi) 및 안티몬(Sb) 중 적어도 하나를 포함할 수 있고, P형 불순물은 알루미늄(Al), 붕소(B), 인듐(In) 및 갈륨(Ga) 중 적어도 하나를 포함할 수 있다. 유전체층은 게이트와 채널 영역 사이에 형성된다. 유전체층은 반도체 기판 상에 소 스 영역, 채널 영역 및 드레인 영역에 접하여 형성될 수 있다. 구체적으로, 유전체층은 게이트와 채널 영역 사이에 1차적으로 형성되고 적어도 일부가 채널 영역과 중첩될 수 있다. 유전체층은 소스 영역과 드레인 영역 상에 2차적으로 형성될 수 있다. 유전체층 내에는 소스 영역 및 드레인 영역과 인접하여 국부적으로 제1 및 제2 전하저장층들(160a,160b)이 형성될 수 있다. 유전체층은 서로 다른 유전율을 가지는 제1 유전율 유전막 물질 또는 제2 유전율 유전막 물질로 형성될 수 있다. 여기에서, 제1 유전율 유전막은 제2 유전율 유전막에 비해 유전율이 낮은 저 유전율(Low-k)막에 해당할 수 있고, 제2 유전율 유전막은 고 유전율(High-k)막에 해당할 수 있다. 제1 유전율 유전막 물질은 실리콘 산화막(SiO2) 및 실리콘 옥시나이트라이드(SiON) 중 하나를 포함할 수 있다. 제2 유전율 유전막 물질은 스트론튬 산화막(SrO), 알루미늄 산화막(A12O3), 마그네슘 산화막(MgO), 스칸듐 산화 막(Sc2O3), 가돌리늄 산화막 (Gd2O3), 이트륨 산화막(Y2O3), 사마륨 산화막(Sm2O3), 하프늄 산화막(HfO2), 지르코 늄 산화막(ZrO2), 티타늄 산 화막(TiO2), 탄탈 산화막(Ta2O5), 바륨 산화막(BaO) 및 비스무스 산화막(Bi2O3) 중 하나를 포함할 수 있다. 제1 및 제2 전하저장층들(160a,160b)은 유전체층에 상호 이격되어 매립되고 상호 독립적으로 전하를 저장 할 수 있다. 제1 및 제2 전하저장층들(160a,160b)은 소스 영역 및 드레인 영역에 있는 2차적으로 형 성되는 유전체층의 상부에 각각 형성될 수 있다. 제1 및 제2 전하저장층들(160a,160b)은 이종 게이트 유 전체(hetero gate dielectric)로 형성되고 서로 동일한 물질로 구성될 수 있다. 여기에서, 제1 및 제2 전하저 장층들(160a,160b)은 폴리실리콘 또는 Si3N4, HfO2, Al2O3 및 이들의 조합 중 선택된 하나의 물질로 형성될 수 있다. 제1 및 제2 전하저장층들(160a,160b)은 선택적인 쓰기(program) 또는 지우기(erase) 동작을 통해 전하의 저장을 독립적으로 제어할 수 있다. 즉, 제1 및 제2 전하저장층들(160a,160b)은 소스 영역와 채널 영역 간 일정 수준 이상의 터널링 전류가 흐를 때의 게이트 전압인 임계 전압(threshold voltage) 또는 드레인 영역 과 채널 영역 간 일정 수준 이상의 터널링 전류가 흐를 때의 게이트 전압인 앰비폴러 전압(ambipolar voltage)을 조정하여 쓰기(program) 또는 지우기(erase) 동작을 선택적으로 혹은 동시에 수행할 수 있다. 전하저장형 터널링 트랜지스터 소자는 제1 및 제2 전하저장층들(160a,160b)을 통해 쓰기(program), 지우기 (erase) 및 읽기(read)의 메모리 동작을 수행하여 연산 장치 없이 부울 논리 연산(Boolean logic operation)을 구현할 수 있다. 도 3은 본 발명의 전하저장형 터널링 트랜지스터 소자의 동작에 따른 드레인 전류 및 게이트 전압의 변화를 설 명하기 위한 그래프로, 제1 및 제2 전하저장층들의 선택적인 쓰기 및 지우기 동작에 따른 드레인 전류(ID)와 게 이트 전압(VG)의 변화를 도식화한 그래프이다. 도 3을 참조하면, Bit1 및 Bit2는 제1 및 제2 전하저장층들(160a,160b)에 해당한다. 전하저장형 터널링 트랜지 스터 소자는 소스 영역과 채널 영역 간 일정 수준 이상의 터널링 전류가 흐를 때의 게이트 전압 인 임계 전압(Vth)의 전압 레벨을 양(+) 또는 음(-)의 방향으로 조정하여 제1 전하저장층(160a)에 해당하는 Bit1 의 쓰기(program) 또는 지우기(erase) 동작을 수행할 수 있다. 또한, 전하저장형 터널링 트랜지스터 소자(10 0)는 드레인 영역과 채널 영역 간 일정 수준 이상의 터널링 전류가 흐를 때의 게이트 전압인 앰비폴 러 전압(Vamb)의 전압 레벨을 양(+) 또는 음(-)의 방향으로 조정하여 제2 전하저장층(160b)에 해당하는 Bit2의 쓰기(program) 또는 지우기(erase) 동작을 수행할 수 있다. 전하저장형 터널링 트랜지스터 소자는 부울 논리 연산(Boolean logic operation)을 수행하기 위해 제1 및 제2 전하저장층(160a,160b)인 Bit1 및 Bit2에 쓰고 지우는 과정이 반드시 필요하다. 전하저장형 터널링 트랜지스터 소자는 선택적인 쓰기 또는 지우기 동작이 가능한 특성을 가지고 있다. 선택적인 쓰기/지우기 동작 이란 임계 전압(Vth) 또는 앰비폴러 전압(Vamb)만 선택적으로 조정하는 동작을 의미하며, 하기의 표 1에 제시된 전압 조건을 통해 제1 및 제2 전하저장층들(160a,160b)에 해당하는 Bit1 또는 Bit2에 쓰기/지우기 동작을 수행 함으로써 구현할 수 있다. 하기 표 1은 전하저장형 터널링 트랜지스터 소자에서의 Bit1 및 Bit2의 선택적 인 쓰기 및 지우기 동작 조건을 개발, 검증하기 위해 TCAD 시뮬레이션을 진행하여 확보된 동작 조건이다. [표 1]"}
{"patent_id": "10-2024-0044371", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 2, "content": "도 4는 본 발명에 따른 터널링 트랜지스터 소자의 선택적인 쓰기 동작 시뮬레이션을 진행한 결과를 도시한 그래 프이다. 도 4를 참조하면, 본 발명의 전하저장형 터널링 트랜지스터 소자의 제1 및 제2 전하저장층인 Bit1 및 Bit2 각각 에 대한 선택적인 쓰기 동작 검증을 위하여 Bit1 과 Bit2 모두 지워진 상태에서 쓰기 동작 시뮬레이션을 진행한 결과이다. 시뮬레이션을 통해, 선택적인 Bit1 쓰기 동작이 BBHE(band-to-band tunneling induced hot- electron injection)를 통해 가능함을 확인하였다. 또한, 선택적인 Bit2 쓰기 동작의 경우BBHH(band-to-band tunneling induced hot-hole injection)을 이용하여 가능함을 알 수 있다. 따라서, 두 선택적인 쓰기 동작 모 두 제안한 전압 조건을 통해 다른 Bit에 영향을 주지 않고 독립적으로 구현될 수 있다. 도 5는 본 발명에 따른 전하저장형 터널링 트랜지스터 소자의 선택적인 지우기 동작 시뮬레이션을 진행한 결과 를 도시한 그래프이다. 도 5를 참조하면, 선택적인 Bit1 지우기 동작은 FN 터널링(Fowler Nordheim tunneling)을 통하여 가능하고, 선 택적인 Bit2 지우기 동작은 드레인(drain)단에서 공급된 전자(electron)를 이용한 DHE(drain hot-electron injection)을 통하여 가능함을 확인하였다. 단, 해당 선택적인 쓰기/지우기 방식은 상기 설명된 BBHE, BBHH, FN tunneling, DHE에 국한되지 않고 Poole-Frenkel emission 등 다양한 물리현상을 통해 구현 가능하다. 도 6은 본 발명의 전하저장형 터널링 트랜지스터 소자의 전기장의 크기 분포를 나타내는 그래프로, 도 6의 (a) 는 전하저장형 터널링 트랜지스터 소자의 BBHE(Band-to-band tunneling induced hot-electron injection) 시 전기장의 크기 분포를 도시한 것이고, 도 6의 (b)는 전하저장형 터널링 트랜지스터 소자의 BBHH(Band-to-band tunneling induced hot-hole injection) 시 전기장의 크기 분포를 도시한 것이다. 도 6을 참조하면, 본 발명에 따른 전하저장형 터널링 트랜지스터 소자의 hot-carrier injection 동작 시 전하저 장형 터널링 트랜지스터 소자의 전기장 크기 분포를 보여준다. 터널링 트랜지스터는 동작 시 소스/채널 (source/channel) 또는 채널/드레인 터널 정션(channel/drain tunnel junction) 부근에 강한 수평 방향과 수직방향의 전기장을 형성하므로 이를 이용하여 효율적인 hot-carrier injection이 가능하다. 또한 전하저장형 터 널링 트랜지스터 소자의 임계 전압 및 앰비폴러 전압은 주로 각각 소스/채널 또는 채널/드레인 터널 정션에 가 해지는 전기장의 영향을 받으므로, 터널 정션 부근에서 효율적인 hot-carrier injection이 가능하다는 점은 저 전력/고에너지 효율로 임계 전압 및 앰비폴러 전압을 조정함에 있어 강점으로 작용한다. 도 7은 본 발명에 따른 전하저장형 터널링 트랜지스터 소자의 부울 논리 연산 과정의 일 실시예를 설명하는 도 면으로, 소자의 부울 논리 연산 단계 및 단계별 로직 변수(logic variable)의 동작 조건을 나타낸다. 도 7를 참조하면, 전하저장형 터널링 트랜지스터 소자는 초기화(Initialize), 쓰기/지우기(Program/Erase), 읽 기(Read)의 3단계 과정을 차례로 수행하여 부울 논리 연산하게 된다. 먼저, 제1 단계로 초기화(Initialize)는 로직 변수A(logic variable A)가 대응되며, 제2 단계쓰기/지우기 (Program/Erase) 단계에는 로직 변수 B 및 C(logic variable B, C)가 대응되며, 읽기(Read) 단계에는 로직 변 수 D(logic variable D)가 대응된다. 여기에서, 로직 변수 B는 게이트 전압(VG)에 따라 결정되고, 로직 변수 C 는 소스 전압(VS) 및 드레인 전압(VD)에 따라 결정된다. 각 로직 변수는 0 내지는 1의 값 또는 부울 논리 연산 의 입력(input) 값인 변수 p 혹은 q 값을 가질 수 있다. 이때, 변수 p와 q는 부울 논리 연산의 입력 값으로 사 용되며, p와 q를 연산한 결과 값은 읽기(Read) 단계에서 읽힌다. 제1 단계(Step 1)는 전하저장형 터널링 트랜지스터 소자의 제1 및 제2 전하저장층들을 초기 상태(initial state)로 설정하는 과정으로, Bit1과 Bit2가 모두 써진 상태와 지워진 상태 두 가지가 존재하며 각 상태에 대응 하는 로직 변수 값은 도 7에서 확인 가능하다. 제2 단계(Step 2)는 선택적인 쓰기(program) 또는 지우기(erase) 동작을 수행하여 부울 논리 연산하는 과정으로, 이때 드레인, 게이트, 소스 단에 인가하는 전압에 따라 로직 변수가 결정된다. 제3 단계(Step 3)는 부울 논리 연산의 결과에 대해 읽기(read) 동작을 수행하는 과정으로, 해당 단계에서 입력 변수 p, q를 부울 논리 연산한 결과 값이 읽힌다. 부울 논리 연산을 수행하기 위한 로직 변수의 입력 값의 한 가지 예를 표2와 같이 나타낼 수 있다. 각각의 로 직 변수 A, B, C, D에 표 2와 같은 값을 입력하면 부울 논리 연산이 가능하며, 이는 TCAD를 통한 AND 연산이 가 능함을 검증한 결과이다. [표 2]"}
{"patent_id": "10-2024-0044371", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 3, "content": "도 8 내지 도 10은 본 발명의 전하저장형 터널링 트랜지스터 소자를 통한 부울 논리 연산의 단계를 설명하기 위 한 도면으로, (a)는 로직 변수 값에 따른 드레인 전류 - 게이트 전압 전달함수를 도시한 그래프이고, (b)는 로 직 변수 값에 따른 바이어스 상태를 도시한 표이다. 먼저, 도 8은 부울 논리 연산의 제1 단계인 초기(Initialize) 단계를 설명하기 위한 것으로, 제1 단계는 제1 및 제2 전하저장층들을 초기 상태(initial state)로 설정한다. 여기에서, 제1 및 제2 전하저장층들은 전하저장형 터널링 트랜지스터 소자의 게이트와 채널 영역 사이에 형성된 유전체층에 상호 이격되어 매립되고 상호 독립적 으로 전하를 저장하도록 구성된다. 제1 단계는 채널 영역과 소스 영역 간의 임계 전압(Vth) 또는 채널 영역과 드레인 영역 간의 앰비폴러 전압(Vamb)으로 제1 및 제2 전하저장층들을 초기화한다. 제1 단계는 상기 표 2의 로 직 변수 A가 대응된다. 도 8의 (a)는 로직 변수인 A가 각각 0 또는 1일때의 드레인 전류(ID) 및 게이트 전압 (VG)의 관계를 나타내고, (b)는 로직 변수 A값에 따른 제1 및 제2 전하저장층들에 해당하는 각 Bit의 쓰기/지우 기 상태를 나타낸다. 여기에서, 로직 변수 A=1은 Bit1 및 Bit2 모두 지우기 상태를 나타내고, A=0은 Bit1 및 Bit2 모두 쓰기 상태를 나타낸다. 다음으로, 도 9는 부울 논리 연산의 제2 단계인 쓰기/지우기(Program/Erase) 단계를 설명하기 위한 것으로, 도 9의 (a)는 로직 변수 B, C의 조합에 따른 임계 전압(Vth) 및 앰비폴러 전압(Vamb)의 변화를 나타내며, (b)는 로직 변수 B, C 값에 따른 바이어스 상태를 나타낸다. 제2 단계는 선택적인 쓰기(program) 또는 지우기(erase) 동작을 수행하여 부울 논리 연산한다. 제2 단계는 제1 전하저장층의 쓰기 또는 지우기 동작을 수행하여 임계 전압(Vth)의 전압 레벨을 조정할 수 있다. 또한, 제2 단 계는 제2 전하저장층의 쓰기 또는 지우기 동작을 수행하여 앰비폴러 전압(Vamb)의 전압 레벨을 조정할 수 있다. 제2 단계는 임계 전압(Vth)의 전압 레벨 조정과 앰비폴러 전압(Vamb)의 전압 레벨 조정을 독립적으로 수행할 수 있다. 제2 단계는 제1 및 제2 전하저장층들에 대해 쓰기 또는 지우기를 통해 총 4가지 종류의 동작을 가능하다. 제2 단계는 제1 전하저장층에 대해 BBHE(Band-to-band tunneling induced hot-electron injection) 또는 FN 터 널링을 통해 쓰기(program) 또는 지우기(erase) 동작을 수행한다. BBHE(Band-to-band tunneling induced hot- electron injection)는 전하저장층에 전압을 가해 밴드-투-밴드 터널링 현상을 유발하여 열전자를 주입하여 저 장하는 기술이다. 예를 들어, 제2 단계는 로직 변수 B, C가 모두 0인 경우 제1 전하저장층에 해당하는 Bit1에 BBHE를 통해 쓰기(program) 동작을 수행하고, 로직 변수 B, C가 모두 1인 경우 Bit1에 FN 터널링을 통해 지우기 (erase) 동작을 수행한다. 또한, 제2 단계는 제2 전하저장층에 대해 BBHH(Band-to-band tunneling induced hot-hole injection) 또는 DHE(drain hot-electron injection)를 통해 쓰기(program) 또는 지우기(erase) 동작을 수행한다. 예를 들어, 제2 단계는 로직 변수 B, C가 각각 1, 0인 경우 제2 전하저장층에 해당하는 Bit2에 BBHH를 통해 쓰기(program) 동작을 수행하고, 로직 변수 B, C가 각각 0, 1인 경우 Bit2에 DHE(drain hot-electron injection)를 통해 지우 기(erase) 동작을 수행한다. 도 10은 부울 논리 연산의 제3 단계인 읽기(Read) 단계를 설명하기 위한 것으로, 도 10의 (a)는 로직 변수 D 값 에 따라 인가하는 게이트 전압(Gate voltage)과 각각의 경우에 따른 드레인 전류-게이트 전압 관계를 나타내며, (b)는 로직 변수 D값에 따른 바이어스 상태를 나타낸다. 제3 단계는 부울 논리 연산의 결과에 대해 읽기(read) 동작을 수행한다. 제3 단계는 게이트 전압(VG)의 전압 레벨을 조정하여 제1 전하저장층 또는 제2 전하저장층의 읽기(read) 동작을 수행한다. 제3 단계는 읽기(read) 동작 시 전류 레벨을 기준 레벨과 비교하여 부울 논리 연산의 결과를 판단할 수 있다. 제3 단계는 부울 논리 연산의 최종 단계로, 부울 논리 연산의 결과 값을 읽게 된다. 제3 단계는 로직 변수 D가 0인 경우 게이트 전압 (VG)으로 VG,read1을 인가하여 Bit1의 정보를 읽으며, 로직 변수 D가 1인 경우 게이트 전압(VG)으로 VG,read2를 인가 하여 Bit2의 정보를 읽는다. 제3 단계는 읽기 동작 시 전류 값이 일정 수준 이상이면 부울 논리 연산의 결과 값을 1 로 판단하고, 읽기 동작 시 전류 값이 일정 수준 이하이면 부울 논리 연산의 결과 값을 0으로 판단한다. 여기에서, 전류는 드레인 전류(ID)를 의미한다. 도 11은 AND 연산의 시뮬레이션 결과를 나타내는 그래프로, AND 연산을 위해 소스(source), 게이트(gate), 드레 인(drain) 단에 인가해야 하는 펄스(pulse)의 개념도 및 TCAD를 통한 AND 연산에 대한 검증 결과를 나타낸다. 도 11을 참조하면, AND 연산을 수행하기 위해 로직 변수 값을 각각 A=0, B=0, C=p, D=q로 설정하였다. 제3 단 계(Step 3) 결과는 p AND q를 연산한 값으로, p와 q가 모두 1일 때만 높은 값의 드레인 전류가 흘렀음을 확인 가능하다. 높은 드레인 전류가 흘렀을 때를 1, 낮은 드레인 전류가 흘렀을 때를 0으로 정의하면, p AND q 연산 이 잘 되었음을 확인할 수 있다. 도 12a 내지 12e는 본 발명의 일 실시예에 따른 전하저장형 터널링 트랜지스터 소자의 제조방법을 설명하는 도 면이다. 도 12a 내지 12e를 참조하여 본 발명에 따른 전하저장형 터널링 트랜지스터 소자의 제조방법을 순서대로 설명하 면 다음과 같다. 먼저, 도 12a를 참조하면, 반도체 기판 상부에 유전체층 및 게이트층을 형성한다. 반도체 기판은 SOI(Silicon On Insulator) 기판 또는 실리콘 기판으로 형성될 수 있다. 반도체 기판 은 SOI 하단의 매몰 산화막(Buried Oxide, BOX) 및 실리콘 기판으로 형성될 수 있다. 여기에서, SOI는 실리콘 단결정층 사이에 절연층이 형성되는 구조의 기판에 해당한다. 매몰 산화막은 절연막으로 사용되는 산화 층(Oxide layer)으로, 전기적 절연체의 역할뿐만 아니라 집적회로의 제조공정에서 소자와 소자 간의 격리에 사 용되는 산화막에 해당하고, SOI 상의 특정 영역에 불순물을 도핑하는 공정과정에서 해당 영역 이외의 영역에 대 한 확산방지막의 역할을 수행할 수 있다. 이하, 반도체 기판은 반드시 이렇게 한정되는 것은 아니다. 유전체층은 제1 유전율 유전막 물질 또는 제2 유전율 유전막 물질로 형성될 수 있다. 여기에서, 제1 유전 율 유전막은 제2 유전율 유전막에 비해 유전율이 낮은 저 유전율(Low-k)막에 해당할 수 있고, 제2 유전율 유전 막은 고 유전율(High-k)막에 해당할 수 있다. 제1 유전율 유전막 물질은 실리콘 산화막(SiO2) 및 실리콘 옥시 나이트라이드(SiON) 중 하나를 포함할 수 있다. 제2 유전율 유전막 물질은 스트론튬 산화막(SrO), 알루미늄 산 화막(A12O3), 마그네슘 산화막(MgO), 스칸듐 산화막(Sc2O3), 가돌리늄 산화막 (Gd2O3), 이트륨 산화막(Y2O3), 사 마륨 산화막(Sm2O3), 하프늄 산화막(HfO2), 지르코늄 산화막(ZrO2), 티타늄 산화막(TiO2), 탄탈 산화막(Ta2O5), 바륨 산화막(BaO) 및 비스무스 산화막(Bi2O3) 중 하나를 포함할 수 있다. 게이트층는 폴리실리콘, 비정질실리콘 등의 실리콘계 물질이나 금속 물질 등으로 형성할 수 있다. 여기서 는 n+ 폴리실리콘층을 사용하고 있으나 반드시 이에 한정하지는 않는다. 이어서, 게이트층 및 유전체층을 식각하여 일정 선폭의 게이트 패턴을 형성한다. 게이트 패턴 형성 후 이를 마스크로 반도체 기판 내에 소스 영역 및 드레인 영역을 형성한다. 소스 영역 및 드레인 영역은 확산(Diffusion) 공정 또는 이온 주입(Ion Implantation) 공정을 통해 불순물을 도핑하여 형성할 수 있다. 일 실시예에서 소스 영역은 P+ 영역이고, 드레인 영역은 N+ 영 역으로 형성할 수 있다. 채널 영역은 소스 영역보다 P형 불순물이 약하게 도핑(P-)되거나, 도핑되지 않은 진성 영역(intrinsic region)으로 형성될 수 있고, 드레인 영역보다 N형 불순물이 약하게 도핑(N- 영 역)되거나, 도핑되지 않은 진성 영역으로 형성될 수도 있다. 그런 다음, 도 12b를 참조하면, 게이트 패턴의 유전체층 측면을 더 식각하여 게이트층 보다 좁은 선 폭을 갖도록 한다. 즉, 게이트 패턴 하단 양측에 'A'와 같은 언더 컷 형태의 공간이 형성된다. 이때, 유전체 층의 식각 공정은 통상의 건식 또는 습식 식각으로 진행할 수 있다. 유전체층이 실리콘 산화막 (SiO2)으로 형성된 경우에는 불산 기체를 사용하는 기화 불산 식각(HF vapor etch) 공정으로 진행될 수 있다. 그런 다음, 도 12c를 참조하면, 산화 공정을 통해 식각된 유전체층을 포함하는 전체 표면에 산화막을 형성한다. 여기에서, 산화막은 유전체층가 동일한 물질로 구성되어 소스 영역과 드레인 영역 상에 유전체층을 2차적으로 형성할 수 있다. 그런 다음, 도 12d를 참조하면, 산화막이 형성된 게이트 패턴을 포함하는 전체 표면을 따라 전하저장층 을 형성한다. 이때, 전하저장층은 식각된 유전체층으로 인해 발생된 공간(A)이 완전히 매립되 도록 진행할 수 있다. 여기서, 전하저장층은 실리콘 공정 호환성이 높은 물질들을 통해 구현할 수 있다. 예를 들어, 전하저장층은 폴리실리콘 등의 반도체 물질이나 Si3N4, HfO2, Al2O3 등의 물질로 형성될 수있다. 마지막으로, 도 12e를 참조하면, 게이트 패턴 상단의 게이트층을 식각 마스크로 산화막 및 전하저장 층을 식각하여 게이트 패턴의 유전체층 양측에 제1 및 제2 전하저장층들(260a,260b)이 형성되도록 한 다. 여기에서, 제1 및 제2 전하저장층들(260a,260b)은 선택적인 쓰기(program) 및 지우기(erase) 동작을 통해 상호 독립적으로 전하를 저장할 수 있다. 상술한 바와 같이, 본 발명에 따른 전하저장형 터널링 트랜지스터 소자는 게이트 패턴 하단 양측에 상호 독립적 으로 전하를 저장하는 제1 및 제2 전하저장층들을 형성하고 소자의 임계 전압(Vth) 및 앰비폴러 전압(Vamb)의 전 압 레벨을 조정하여 제1 및 제2 전하저장층들에 대해 선택적인 쓰기(program) 또는 지우기(erase) 동작을 수행 할 수 있다. 이에 따라 저전력, 고에너지 효율의 터널링 트랜지스터를 이용하므로 MOSFET(metal-oxide- semiconductor field effect transistor) 대비 저전력 동작에 강점이 있으며, 이는 낮은 누설 전류 및 동작 전 압을 필요로 하는 에너지 절약형 반도체 시스템 구현에 월등한 효과를 제공한다. 또한, 본 발명의 전하저장형 터널링 트랜지스터 소자를 통하여 부울 논리 연산 수행 시, 연산 장치-메모리 유닛 간의 데이터 이동을 획기적 으로 줄임으로써 이에 소모되는 시간 및 에너지 손실을 줄이며, 이러한 에너지 관점에서의 장점은 더 나아가서 낮은 전력으로 연산을 수행해야 하는 휴대용 전자기기에 사용되는 시스템 반도체에도 응용이 가능하다. 상기에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특 허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2024-0044371", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 폰 노이만(Von Neumann) 구조와 프로세스 인 메모리(PIM; process-in memory) 기술의 동작 방식을 설명 하기 위한 도면이다. 도 2는 본 발명의 일 실시예에 따른 전하저장형 터널링 트랜지스터 소자를 도시한 단면도이다. 도 3은 본 발명의 전하저장형 터널링 트랜지스터 소자의 동작에 따른 드레인 전류 및 게이트 전압의 변화를 설 명하기 위한 그래프이다. 도 4는 본 발명에 따른 전하저장형 터널링 트랜지스터 소자의 선택적인 쓰기 동작 시뮬레이션을 진행한 결과를 도시한 그래프이다. 도 5는 본 발명에 따른 전하저장형 터널링 트랜지스터 소자의 선택적인 지우기 동작 시뮬레이션을 진행한 결과 를 도시한 그래프이다. 도 6은 본 발명의 전하저장형 터널링 트랜지스터 소자의 전기장의 크기 분포를 나타내는 그래프이다. 도 7은 본 발명에 따른 전하저장형 터널링 트랜지스터 소자의 부울 논리 연산 과정의 일 실시예를 설명하는 도 면이다. 도 8 내지 도 10은 본 발명의 전하저장형 터널링 트랜지스터 소자를 통한 부울 논리 연산의 단계를 설명하기 위 한 도면이다. 도 11은 AND 동작의 시뮬레이션 결과를 나타내는 그래프이다. 도 12a-12e는 본 발명의 일 실시예에 따른 전하저장형 터널링 트랜지스터 소자의 제조방법을 설명하는 도면이다."}
