{"patent_id": "10-2010-0025997", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2011-0084076", "출원번호": "10-2010-0025997", "출원인": "한국전자통신연구원", "발명자": "정영배"}}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비균일 격자구조 인공 자기 도체에 있어서,도전성(導電性) 접지층;상기 도전성 접지층과 미리 결정된 거리만큼 이격되어 형성되고, 전기 용량성 셀들을 포함하는 도전층;상기 접지층과 상기 도전층을 전기적으로 연결하는 비아; 및상기 도전층에 밀착 또는 미리 결정된 거리만큼 이격되어 배치되는 복수개의 다이폴 안테나를 포함하며,상기 전기 용량성 셀들은 상기 복수개의 다이폴 안테나를 기준으로 순차적으로 나누어져 그룹화됨을 특징으로하는 인공 자기 도체."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 전기 용량성 셀들은 격자 형상으로 배열됨을 특징으로 하는 인공 자기 도체."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 전기 용량성 셀들이 동일한 그룹에 포함된 경우에는, 상기 그룹에 포함된 전기 용량성 셀들의 크기 또는간격은 균일하게 배열됨을 특징으로 하는 인공 자기 도체."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 전기 용량성 셀들이 서로 다른 그룹에 포함된 경우에는, 상기 전기 용량성 셀들의 크기 또는 간격은 비균일하게 배열됨을 특징으로 하는 인공 자기 도체."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 도전층은,상기 전기 용량성의 셀들이 동일한 그룹에 포함된 경우에는, 상기 그룹에 포함된 전기 용량성 셀들의 반사 계수위상값은 균일하게 배열됨을 특징으로 하는 인공 자기 도체."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 도전층은,상기 전기 용량성의 셀들이 서로 다른 그룹에 포함된 경우에는, 상기 전기 용량성 셀들의 반사 계수 위상값은비균일하게 배열됨을 특징으로 하는 인공 자기 도체.공개특허 10-2011-0084076-3-청구항 7 제 1 항에 있어서,상기 접지층과 도전층 사이에 유전체층을 더욱 구비함을 특징으로 하는 인공 자기 도체."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "인공 자기 도체를 구비하는 안테나에 있어서, 상기 인공 자기 도체는,도전성(導電性) 접지층;상기 도전성 접지층과 미리 결정된 거리만큼 이격되어 형성되고, 전기 용량성 셀들을 포함하는 도전층;상기 접지층과 상기 도전층을 전기적으로 연결하는 비아; 및상기 도전층에 밀착 또는 미리 결정된 거리만큼 이격되어 배치되는 복수개의 다이폴 안테나를 포함하며,상기 전기 용량성 셀들은 상기 복수개의 다이폴 안테나를 기준으로 순차적으로 나누어져 그룹화됨을 특징으로하는 안테나."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 전기 용량성 셀들은 격자 형상으로 배열됨을 특징으로 하는 안테나."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 전기 용량성 셀들이 동일한 그룹에 포함된 경우에는, 상기 그룹에 포함된 전기 용량성 셀들의 크기 또는간격은 균일하게 배열됨을 특징으로 하는 안테나."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서,상기 전기 용량성 셀들이 서로 다른 그룹에 포함된 경우에는, 상기 전기 용량성 셀들의 크기 또는 간격은 비균일하게 배열됨을 특징으로 하는 안테나."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8 항에 있어서, 상기 도전층은,상기 전기 용량성의 셀들이 동일한 그룹에 포함된 경우에는, 상기 그룹에 포함된 전기 용량성 셀들의 반사 계수위상값은 균일하게 배열됨을 특징으로 하는 안테나."}
{"patent_id": "10-2010-0025997", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 8 항에 있어서, 상기 도전층은,상기 전기 용량성의 셀들이 서로 다른 그룹에 포함된 경우에는, 상기 전기 용량성 셀들의 반사 계수 위상값은비균일하게 배열됨을 특징으로 하는 안테나.공개특허 10-2011-0084076-4-청구항 14 제 8 항에 있어서,상기 접지층과 도전층 사이에 유전체층을 더욱 구비함을 특징으로 하는 안테나.명 세 서기 술 분 야본 발명은 격자 셀이 배열된 구조를 가지는 인공 자기 도체(Artificial magnetic conductor: AMC)와 이를 포함 [0001]하는 안테나에 관한 것으로, 특히, 반사 계수의 위상값을 격자 셀의 그룹에 따라 다르게 하여 반사파의 동위상면 형태 및 진행 방향을 조절할 수 있는 인공 자기 도체 및 이를 포함하는 안테나에 관한 것이다. \"본 발명은 지식경제부 및 정보통신연구진흥원의 IT원천기술사업의 일환으로 수행한 연구로부터 도출된 것이다 [0002][과제고유번호: 2007-F-041-03, 과제명 : 지능형 안테나 기술개발].\"배 경 기 술자기 도체(magnetic conductor)는 일반적으로 사용되는 전기도체(electric conductor)에 상응하는 것으로, 전 [0003]기도체의 표면상에서는 전기장의 접선 성분이 거의 0이 되지만, 자기도체의 표면상에서는 자기장의 접선 성분이거의 0이 되어 전기도체에서와는 달리 자기도체 표면상으로는 전류가 흐를 수 없게 된다.이와 같은 자기도체의 성질로 인하여, 자기도체는 회로적으로는 특정 주파수에서 상당히 높은 임피던스를 갖는 [0004]즉, 개방 회로의 기능을 하는 성분으로 작용하게 된다. 이러한 자기도체는 일반적인 전기도체 상에 의도된 특정단위 셀패턴을 일정 간격으로 주기적으로 배열함으로써 구현할 수 있다. 이렇게 만들어진 자기도체를 인공자기도체라 한다.인공 자기 도체는 자연계에 일반적으로 존재하지 않는 현상을 나타내는 메타물질의 하나로서, 기존 기술들의 물 [0005]리적 한계를 극복할 수 있는 핵심 기술로서 주목 받고 있다. 인공 자기 도체는 자연계에서 볼 수 있는 전도체(electric conductor)와 달리 인공적으로 특정 주파수 영역에서 자기 도체(magnetic conductor)의 특성을 지니는 표면을 지닌 구조를 말한다.인공 자기 도체는 전기 전도체로 구성되어 있으며, 도체 표면에 돌기형의 구조를 가짐으로써 커패시턴스 [0006](capacitance) 성분과 인덕턴스(inductance) 성분을 발생시키게 된다. 이 성분들은 주파수의 함수로서 특정 주파수 영역에서는 이 성분들에 의해 표면 임피던스가 매우 높아지는 특성을 가지게 된다. 일반적인 전도체의 경우, 표면 임피던스는 0을 가지고 반사계수가 ‘-1’을 가지게 되어 영상 전류가 역위상을 [0007]가지게 되나, 인공 자기 도체의 경우, 표면 임피던스가 매우 큰 값을 가지고 반사계수가 ‘+1’을 가지게 되어영상전류가 동위상을 가지는 특성을 지닌다. 또한 높은 표면 임피던스로 인하여 표면파의 전파를 억제시키는 특성을 지닌다.발명의 내용해결하려는 과제따라서, 본 발명은, 비균일 격자 구조를 가지는 인공 자기 도체 및 이를 포함하는 안테나를 제공한다. [0008]그리고, 본 발명은, 인공 자기 도체를 구성하고 있는 전체 전기 용량성 셀들을 소정의 그룹으로 나누고, 그룹에 [0009]따라 셀들의 크기가 비균일하게 배열되는 인공 자기 도체 및 이를 포함하는 안테나를 제공한다.또한, 본 발명은, 인공 자기 도체를 구성하고 있는 전체 전기 용량성 셀들의 크기를 소정의 그룹에 따라 비균일 [0010]하게 조정함으로써 격자마다 고유의 반사계수 위상값을 가지는 인공 자기 도체 및 이를 포함하는 안테나를 제공한다.그리고, 본 발명은, 나누어진 그룹들 간의 셀 크기는 비균일하게 함으로써 반사파의 방향 및 형태를 조절하는 [0011]공개특허 10-2011-0084076-5-인공 자기 도체 및 이를 포함하는 안테나를 제공한다.과제의 해결 수단상기한 목적들을 해결하기 위해 본 발명의 일실시 예에 따른 비균일 격자구조 인공 자기 도체는 도전성(導電性) [0012]접지층; 상기 도전성 접지층과 미리 결정된 거리만큼 이격되어 형성되고, 전기 용량성 셀들을 포함하는 도전층;상기 접지층과 상기 도전층을 전기적으로 연결하는 비아; 상기 도전층에 밀착 또는 미리 결정된 거리만큼 이격되어 배치되는 복수개의 다이폴 안테나를 포함하고, 상기 전기 용량성 셀들은 상기 복수개의 다이폴 안테나를기준으로 순차적으로 나누어져 그룹화된다.본 발명의 일 실시 예에 따른 인공 자기 도체를 구비하는 안테나는 도전성(導電性) 접지층; 상기 도전성 접지층 [0013]과 미리 결정된 거리만큼 이격되어 형성되고, 전기 용량성 셀들을 포함하는 도전층; 상기 접지층과 상기 도전층을 전기적으로 연결하는 비아; 상기 도전층에 밀착 또는 미리 결정된 거리만큼 이격되어 배치되는 복수개의 다이폴 안테나;를 포함하고, 상기 전기 용량성 셀들은 상기 복수개의 다이폴 안테나를 기준으로 순차적으로 나누어져 그룹화된다.발명의 효과본 발명은, 인공 자기 도체의 도체부를 형성하는 전체 전기 용량성 셀들을 다이폴 배열 안테나의 위치에 따라 [0014]소정의 그룹으로 나누고, 전기 용량성 셀들이 동일한 그룹에 포함되면 균일한 반사위상을 가지고, 각각의 그룹은 비균일한 반사위상을 가지게 함으로써, 반사파의 방향을 조절하는 것과 동일한 성능을 가지면서 설계과정을매우 단순화할 수 있다.도면의 간단한 설명도 1은 일반적인 인공 자기 도체를 도시한 도면, [0015]도 2는 도 1에 도시된 인공 자기 도체의 격자 셀 간의 커패시턴스 성분과 인덕턴스 성분으로 발생되는 표면 임피던스의 변화에 따른 반사 계수의 위상 변화를 나타내는 그래프,도 3은 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조를 개략적으로 도시한도면,도 4a는 균일 격자를 갖는 기존의 인공 자기 도체에 대한 등가회로이며, 4b는 비균일 격자를 갖는 본 발명에 따른 인공 자기 도체에 대한 등가회로,도 5는 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조를 개략적으로 도시한도면,도 6은 일반적인 인공 자기 도체의 설계기법에 의거하여 설계된 인공 자기 도체(500)를 4개의 다이폴 안테나로구성되는 배열 안테나의 반사판으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴을 도시한 도면, 도 7은 본 발명의 실시 예에 따라 설계된 인공 자기 도체(500)를 개의 다이폴 안테나로 구성되는 배열 안테나의반사판으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴을 도시한 도면이다.발명을 실시하기 위한 구체적인 내용상술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되어 있는 상세한 설명을 통하여 보다 명확 [0016]해 질 것이며, 그에 따라 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을용이하게 실시할 수 있을 것이다. 또한, 본 발명을 설명함에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에 그 상세한 설명을 생략하기로 한다. 본 발명은, 격자 셀이 배열된 구조를 가지는 인공 자기 도체(Artificial magnetic conductor: AMC)의 설계 방 [0017]법을 제안한다. 여기서, 후술할 본 발명의 실시 예에서는 반사 계수의 위상값을 격자 위치에 따라 다르게 하여공개특허 10-2011-0084076-6-반사파의 동위상면 형태를 조절하고, 반사파의 진행 방향을 조절할 수 있는 인공 자기 도체의 설계 방법에 제공한다. 그러면 여기서, 도 1을 참조하여 본 발명의 실시 예에 따른 인공 자기 도체를 설명하기 전에 일반적인 인공 자기 도체의 구조를 구체적으로 설명하기로 한다.도 1은 일반적인 인공 자기 도체를 도시한 도면이다. [0018]도 1을 참조하면, 인공 자기 도체의 정면(100), 측면(200), 후면(300)을 도시하고 있다. 인공 자기 도체의 측면 [0019](200)을 참조하면, 인공 자기 도체는 접지층(10), 격자 셀을 포함하는 도체층(20), 및 비아(via, 30)를 포함한다. 상기 접지층(10)은 도전성(導電性)이고, 상기 도체층(20)은 상기 접지층(10)으로부터 미리 결정된 거리만큼 이 [0020]격되어 형성된다. 상기 비아(30)은 상기 접지층과 도전층을 전기적으로 연결한다. 상기 도체층(20)에 배열된 전기 용량성의 격자 셀 각각의 크기 또는 간격은 균일하고, 상기 전기 용량성의 격자 셀들의 위치에 따라 반사 계수 위상값이 균일하게 배열된다.도 2는 도 1에 도시된 인공 자기 도체의 격자 셀 간의 커패시턴스 성분과 인덕턴스 성분으로 발생되는 표면 임 [0021]피던스의 변화에 따른 반사 계수의 위상 변화를 나타내는 그래프이다.도 1과 2에 도시된 바와 같이, 일반적인 인공 자기 도체는 균일한 격자 구조를 가지고 있으며, 각 주파수에서의 [0022]모든 격자들의 반사계수 위상은 도 2와 같이 동일하고, 반사 계수의 위상이 0이 되는 주파수에서 완벽한 자기도체의 성질을 가지게 된다. 따라서 종래의 인공 자기 도체는 전자기파를 반사하는데 있어 입사각과 반사각이 Snell의 법칙을 따르고 [0023]있으며, 반사 계수의 위상에 변화가 있을 뿐 반사파의 진행 방향이 변화하지는 않는 특성을 지니고 있었다. 그러면 여기서, 도 3을 참조하여 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조를 보다 구체적으로 설명하기로 한다.도 3은 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조를 개략적으로 도시한 [0024]도면이다.도 3을 참조하면, 인공 자기 도체(300)는 도전성(導電性) 접지층, 상기 접지층과 미리 결정된 거리만큼 이격되 [0025]어 형성되고, 전기 용량성 셀들을 포함하며 도전층, 및 상기 접지층과 상기 도전층을 전기적으로 연결하는 비아를 포함한다. 소정의 다이폴 안테나(310a, 310b, 310c, 310d)는 상기 인공 자기 도체(300)의 도전층, 예컨대 윗면에 밀착시키 [0026]거나 5mm 이내의 간격을 두고 띄워서 배치된다. 또한, 인공 자기 도체(300)는 급전부(320a, 320b, 320c, 320d)를 포함한다.상기 도 3은 비균일한 격자 셀 구조를 가지는 인공 자기 도체(300)를 4개의 다이폴 안테나(310a, 310b, 310c, [0027]310d)로 이루어진 배열 안테나의 반사판으로 적용한 경우이다. 즉, 상기 인공 자기 도체(300)에 포함된 비균일한 격자 셀(311 내지 326)은 서로 다른 크기를 가짐으로써, 서로 다른 반사위상을 갖는다.그러나 도 3의 비균일한 격자 셀 구조를 가지는 인공 자기 도체(300)의 경우, 격자 셀의 수가 많아질수록 각각 [0028]의 셀을 특정 주파수에서 특정 반사위상을 가지도록 설계해야한다. 이와 같은 경우에는 설계 과정이 매우 복잡해진다는 단점이 있다. 그러면 여기서, 도 4a 및 도 4b를 참조하여 모든 격자구조가 동일한 형태를 가진 경우와동일하지 않은 형태를 가진 경우를 보다 구체적으로 설명하기로 한다.도 4a는 모든 격자구조가 동일한 형태를 가진 경우에 대한 등가회로이고, 4b는 각 격자구조가 비균일한 형태에 [0029]대한 등기회로이다. 도 4a 및 도 4b를 참조하면, 도 4a의 모든 커패시턴스(capacitance)와 인덕턴스(inductance)는 C0와 L0로 동일 [0030]하다. 하지만, 도 4b의 커패시턴스와 인덕턴스 값은 좌측으로부터 각각 C1/L1, C2/L2, C3/L3이다. 본 발명의 실시 예와 같은 버섯형의 임피던스 구조에서 커패시턴스 성분은 도전층의 이웃하는 격자들 간의 근접 [0031]성으로 인해 발생하고, 인덕턴스 성분은 회로의 루프 구조로 인해 발생한다. 도 4a 및 도 4b의 인공 자기 도체의 격자 구조는 격자들 간의 캐패시턴스 성분과 인덕턴스(inductance) 성분에 [0032]의한 공진 특성을 가지고 있다. 격자 구조에서 발생되는 커패시턴스 성분과 인덕턴스 성분에 의한 표면 임피던스는 하기 <수학식 1>과 같이 표현된다.공개특허 10-2011-0084076-7-수학식 1[0033]상기 <수학식 1>을 참조하면, Zs는 표면, 예컨대 S에 대한 임피던스이다. j는 -1에 제곱근을 취한 값이고, w는 [0034]각 주파수로 단위는 rad/s이다. 즉, Hz 단위를 가지는 주파수 f에 2 × pi를 곱한 값입니다. L은 격자 구조를가지는 등가회로의 인덕턴스이고, C는 격자구조를 가지는 등가회의 커패시턴스이다. 또한, 표면에서의 반사계수는 하기 <수학식 2>와 같이 나타나며, 반사계수의 위상 값은 하기 <수학식 3>과 같이 [0035]나타낼 수 있다.수학식 2[0036]상기 <수학식 2>를 참조하면, Zs는 표면, 예컨대 S에 대한 임피던스이고, Γ는 반사 계수이고, η는 자유 공간 [0037]임피던스이며, e는 일반적인 수학에서 사용되는 exponential 함수이고, Φ는 반사계수의 위상 값으로, 인공 자기 도체 표면의 경계면에서 전자기파가 반사될 때, 전자기파의 위상이 얼마나 변화되는가를 나타낸다. 수학식 3[0038]상기 <수학식 3>을 참조하면, Zs는 표면, 예컨대 S에 대한 임피던스이고, η는 자유 공간 임피던스이다. In은 [0039]일반적인 수학에서 사용되는 자연로그 함수이고, Im은 의 허수부를 구하기 위한 함수이다. 그러면 여기서, 하기 <표 1>을 참조하여 상기 인공 자기 도체(300)에 포함된 비균일한 격자 셀(311 내지 326) [0040]이 특정 주파수에서 가지는 반사위상과 상기 반사위상을 갖기 위해 설계된 전기 용량성 격자 셀의 크기를 보다구체적으로 설명하기로 한다.공개특허 10-2011-0084076-8-<표 1>을 참조하면, <표 1>은 도 3의 비균일한 격자 셀을 가지는 인공 자기 도체(300)의 각 셀(311 내지 326)이 [0041]특정 주파수, 예컨대 2.045 GHz의 주파수에서 가지는 반사위상과, 이러한 반사위상을 갖기 위해 설계된 전기 용량성 격자 셀의 크기를 나타낸다. 상기 <표 1>과 같은 일반적인 비균일한 격제 셀을 가지는 인공 자기 도체의 설계기법에 의거하여 인공 자기 도 [0042]체를 설계하면 상기와 같이 16개의 격자 셀을 각각 설계해야 번거로움이 따른다. 표 1[0043]상기와 같은 경우에는, 격자 셀의 수가 많아질수록 각각의 셀을 특정 주파수에서 특정 반사위상을 가지도록 설 [0044]계해야한다. 이와 같은 경우에는 설계 과정이 매우 복잡해진다는 단점이 있다. 그러면 여기서, 도 5를 참조하여본 발명의 실시 예에 따른 비균일 격자구조를 가지는 인공 자기 도체의 구조를 보다 구체적으로 설명하기로 한다. 도 5는 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조를 개략적으로 도시한 [0045]도면이다. 도 5를 참조하면, 인공 자기 도체(500)는 도전성(導電性) 접지층, 상기 접지층과 미리 결정된 거리만큼 이격되 [0046]어 형성되고, 전기 용량성 셀들을 포함하며 도전층, 및 상기 접지층과 상기 도전층을 전기적으로 연결하는 비아를 포함한다. 소정의 다이폴 안테나(510a, 510b, 510c, 510d)는 상기 인공 자기 도체(500)의 도전층, 예컨대 윗면에 밀착시키거나 5mm 이내의 간격을 두고 띄워서 배치된다. 또한, 인공 자기 도체(500)는 급전부(510a, 510b,510c, 510d)를 포함한다.또한, 상기 도전층에 포함되는 격자 셀들을 다이폴 안테나(510a, 510b, 510c, 510d)를 기준으로 순차적으로 나 [0047]누어 그룹화 한다. 도 5에서는, 다이폴 안테나(510a, 510b, 510c, 510d)가 4개이므로 격자 셀(611 내지 626)을4개의 그룹(530, 540, 550, 560)으로 순차적으로 나누어 그룹화 한다.첫 번째 그룹(530)에 속하는 격자 셀들(611, 612, 613, 614)의 크기는 동일하며, 두 번째 그룹(540)에 속하는 [0048]공개특허 10-2011-0084076-9-격자 셀들(615, 616, 617, 618)의 크기 역시 동일하고, 세 번째 그룹(550)에 속하는 격자 셀들(619, 620, 621,622)의 크기 역시 동일하며, 네 번째 그룹(560)에 속하는 격자 셀들(623, 624, 625, 626)의 크기 역시동일하다. 상기 각 그룹에 속한 셀들은 동일한 위치에 있는 셀들이 가져야하는 반사위상의 평균을 구하고, 상기 각 그룹에 [0049]속한 셀들은 상기 평균값을 가진다. 예를 들어, 8°의 빔 조향각을 가지는 인공자기도체를 세로 방향으로 16개의 셀을 가지는 구조로 설계하고자 한다. 이때, 1번째 셀부터 4번째 셀들이 각각 100°, 90°, 80°, 70°의 반사위상을 가져야 한다고 가정한다. 이때, 1 번째 셀부터 4번째 셀이 동일한 그룹에 포함되면, 1 번째 셀부터4번째 셀의 반사위상 값은 상기 4개의 셀들의 반사 위상, 예컨대 100°, 90°, 80°, 70°를 평균한 반사위상값인 85°이다. 또한, 상기 각 그룹들(530, 540, 550, 560)끼리는 서로 다른 격자 셀 크기를 가진다. 그러면 여기서, 하기 <표 [0050]2>를 참조하여 상기 인공 자기 도체(500)에 포함된 비균일한 격자 셀(611 내지 626)이 특정 주파수에서 가지는반사위상과 상기 반사위상을 갖기 위해 설계된 전기 용량성 격자 셀의 크기를 보다 구체적으로 설명하기로한다.표 2[0051]상기 <표 2>를 참조하면, 도 3과 동일한 반사파 각도를 갖도록 설계하기 위해서 본 발명의 실시 예에 따른 비균 [0052]일 격자구조를 가지는 인공 자기 도체(500)의 각 격자 셀(611 내지 626)에서의 반사위상과, 각 전기 용량성 격자 셀의 크기를 나타낸다.첫 번째 그룹(530)에 속하는 격자 셀(611, 612, 613, 614)의 크기는 동일한 반사위상, 예컨대 111.4이고, 두 번 [0053]째 그룹(540)에 속하는 격자 셀(615, 616, 617, 618)의 크기는 동일한 반사위상, 예컨대 37.1이고, 세 번째 그룹(550)에 속하는 격자 셀(619, 620, 621, 622)의 크기는 동일한 반사위상, 예컨대 -37.1이고, 네 번째 그룹(560)에 속하는 격자 셀(623, 624, 625, 626)의 크기 동일한 반사위상, 예컨대 -111.4이다. 본 발명의 실시 예에 따른 비균일한 격자 셀을 가지는 인공 자기 도체의 설계기법에 의거하여 인공 자기 도체 [0054]공개특허 10-2011-0084076-10-(500)를 설계하는 경우와 일반적인 인공 자기 도체의 설계기법에 의거하여 인공 자기 도체(300)를 설계하는 경우와 비교하면, 일반적인 인공 자기 도체의 설계기법에 의거하여 인공 자기 도체(300)를 설계하면 비균일한 격자 셀 각각이 서로 다른 반사위상을 가지도록 설계해야 하기 때문에 번거로움이 따른다.하지만, 본 발명의 실시 예에 따른 비균일한 격자 셀을 가지는 인공 자기 도체의 설계기법에 의거하여 인공 자 [0055]기 도체(500)를 설계하면 다이폴 안테나 위치에 따라 나뉘어진 각각의 그룹에 속한 격자 셀은 동일한 반사위상을 가지므로 일반적인 인공 자기 도체의 설계기법에 의거하여 설계된 인공 자기 도체(300)보다 간편하게 인공자기 도체를 설계할 수 있다. 그러면 여기서, 도 8및 도9를 참조하여 일반적인 방법에 의거하여 설계된 인공 자기 도체(300)와 본 발명의 실시 예에 따라 설계된 인공 자기 도체(500)를 개의 다이폴 안테나로 구성되는 배열안테나의 반사판으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴을 설명하기로 한다.도 6은 일반적인 인공 자기 도체의 설계기법에 의거하여 설계된 인공 자기 도체(500)를 4개의 다이폴 안테나로 [0056]구성되는 배열 안테나의 반사판으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴 도시한 도면이고, 도 7은본 발명의 실시 예에 따라 설계된 인공 자기 도체(500)를 개의 다이폴 안테나로 구성되는 배열 안테나의 반사판으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴을 도시한 도면이다.도 6을 참조하면, 방사되는 전력이 일반적인 도체 반사판이나 균일한 격자 셀을 가지는 인공 자기 도체 반사판 [0057]을 사용했을 경우와 같이 0°가 아닌, 비균일한 격자 셀을 가지는 인공 자기 도체를 반사판으로 적용함에 따라8°만큼 기울어져서 방사됨을 확인할 수 있다.도 7을 참조하면, 방사되는 전력이 0°가 아닌 8°만큼 기울어져서 방사됨을 확인할 수 있다. 이처럼 단순화된 [0058]설계기법에 따라 비균일한 격자 셀을 가지는 인공 자기 도체를 설계해도, 종래의 비균일한 격자 셀을 가지는 인공 자기 도체와 동일한 성능을 가질 수 있다.이와 같이, 본 발명에 실시 예에 따른 단순화된 비균일 격자구조를 가지는 인공 자기 도체 설계기법에 의거하여 [0059]설계된 인공 자기 도체(500)를 사용하면 격자 셀의 개수가 늘어남에 따라 증가하는 설계의 복잡도를 비약적으로줄일 수 있으며, 각 격자 셀이 가지는 크기의 차이도 커지기 때문에 제작공정에서 발생하는 미세한 오차에 따른성능 저하를 줄일 수 있다.이제까지 본 발명에 대하여 바람직한 실시예를 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통상의 [0060]지식을 가진 자는 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 본 발명을 구현할 수 있음을 이해할 것이다. 그러므로, 상기 개시된 실시예 들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는모든 차이점은 본 발명에 포함된 것으로 해석되어야 한다.부호의 설명100 : 인공 자기 도체, 10 : 접지층 [0061]20 : 도체층, 30 : 비아300 : 인공 자기 도체, 310a 내지 310d : 다이폴 안테나311 내지 326 : 인공 자기 도체의 셀500 : 인공 자기 도체510a 내지 510d : 다이폴 안테나,611 내지 626 : 인공 자기 도체의 각 결자 셀530 : 인공 자기 도체의 첫 번째 그룹540 : 인공 자기 도체의 두 번째 그룹550 : 인공 자기 도체의 세 번째 그룹560 : 인공 자기 도체의 네 번째 그룹공개특허 10-2011-0084076-11-도면도면1공개특허 10-2011-0084076-12-도면2공개특허 10-2011-0084076-13-도면3도면4a공개특허 10-2011-0084076-14-도면4b도면5공개특허 10-2011-0084076-15-도면6공개특허 10-2011-0084076-16-도면7공개특허 10-2011-0084076-17-"}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 격자 셀이 배열된 구조를 가지는 인공 자기 도체(Artificial magnetic conductor: AMC)와 이를 포함 하는 안테나에 관한 것으로, 특히, 반사 계수의 위상값을 격자 위치에 따라 다르게 하여 반사파의 동위상면 형태 를 조절하고, 반사파의 진행 방향을 조절할 수 있는 인공 자기 도체의 설계 방법에 관한 것이다. 본 발명의 인공 자기 도체는 도전성(導電性) 접지층과 상기 도전성 접지층과 미리 결정된 거리만큼 이격되어 형 성되고, 전기 용량성 셀들을 포함하는 도전층과 상기 접지층과 상기 도전층을 전기적으로 연결하는 비아와 상기 도전층에 밀착 또는 미리 결정된 거리만큼 이격되어 배치되는 복수개의 다이폴 안테나를 포함하고, 상기 전기 용량성 셀들은 상기 복수개의 다이폴 안테나를 기준으로 순차적으로 나누어져 그룹화된다."}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 격자 셀이 배열된 구조를 가지는 인공 자기 도체(Artificial magnetic conductor: AMC)와 이를 포함 하는 안테나에 관한 것으로, 특히, 반사 계수의 위상값을 격자 셀의 그룹에 따라 다르게 하여 반사파의 동위상 면 형태 및 진행 방향을 조절할 수 있는 인공 자기 도체 및 이를 포함하는 안테나에 관한 것이다. \"본 발명은 지식경제부 및 정보통신연구진흥원의 IT원천기술사업의 일환으로 수행한 연구로부터 도출된 것이다 [과제고유번호: 2007-F-041-03, 과제명 : 지능형 안테나 기술개발].\""}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자기 도체(magnetic conductor)는 일반적으로 사용되는 전기도체(electric conductor)에 상응하는 것으로, 전 기도체의 표면상에서는 전기장의 접선 성분이 거의 0이 되지만, 자기도체의 표면상에서는 자기장의 접선 성분이 거의 0이 되어 전기도체에서와는 달리 자기도체 표면상으로는 전류가 흐를 수 없게 된다. 이와 같은 자기도체의 성질로 인하여, 자기도체는 회로적으로는 특정 주파수에서 상당히 높은 임피던스를 갖는 즉, 개방 회로의 기능을 하는 성분으로 작용하게 된다. 이러한 자기도체는 일반적인 전기도체 상에 의도된 특정 단위 셀패턴을 일정 간격으로 주기적으로 배열함으로써 구현할 수 있다. 이렇게 만들어진 자기도체를 인공자기 도체라 한다. 인공 자기 도체는 자연계에 일반적으로 존재하지 않는 현상을 나타내는 메타물질의 하나로서, 기존 기술들의 물 리적 한계를 극복할 수 있는 핵심 기술로서 주목 받고 있다. 인공 자기 도체는 자연계에서 볼 수 있는 전도체 (electric conductor)와 달리 인공적으로 특정 주파수 영역에서 자기 도체(magnetic conductor)의 특성을 지니 는 표면을 지닌 구조를 말한다. 인공 자기 도체는 전기 전도체로 구성되어 있으며, 도체 표면에 돌기형의 구조를 가짐으로써 커패시턴스 (capacitance) 성분과 인덕턴스(inductance) 성분을 발생시키게 된다. 이 성분들은 주파수의 함수로서 특정 주 파수 영역에서는 이 성분들에 의해 표면 임피던스가 매우 높아지는 특성을 가지게 된다. 일반적인 전도체의 경우, 표면 임피던스는 0을 가지고 반사계수가 ‘-1’을 가지게 되어 영상 전류가 역위상을 가지게 되나, 인공 자기 도체의 경우, 표면 임피던스가 매우 큰 값을 가지고 반사계수가 ‘+1’을 가지게 되어 영상전류가 동위상을 가지는 특성을 지닌다. 또한 높은 표면 임피던스로 인하여 표면파의 전파를 억제시키는 특 성을 지닌다."}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은, 비균일 격자 구조를 가지는 인공 자기 도체 및 이를 포함하는 안테나를 제공한다. 그리고, 본 발명은, 인공 자기 도체를 구성하고 있는 전체 전기 용량성 셀들을 소정의 그룹으로 나누고, 그룹에 따라 셀들의 크기가 비균일하게 배열되는 인공 자기 도체 및 이를 포함하는 안테나를 제공한다. 또한, 본 발명은, 인공 자기 도체를 구성하고 있는 전체 전기 용량성 셀들의 크기를 소정의 그룹에 따라 비균일 하게 조정함으로써 격자마다 고유의 반사계수 위상값을 가지는 인공 자기 도체 및 이를 포함하는 안테나를 제공 한다. 그리고, 본 발명은, 나누어진 그룹들 간의 셀 크기는 비균일하게 함으로써 반사파의 방향 및 형태를 조절하는 인공 자기 도체 및 이를 포함하는 안테나를 제공한다."}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적들을 해결하기 위해 본 발명의 일실시 예에 따른 비균일 격자구조 인공 자기 도체는 도전성(導電性) 접지층; 상기 도전성 접지층과 미리 결정된 거리만큼 이격되어 형성되고, 전기 용량성 셀들을 포함하는 도전층; 상기 접지층과 상기 도전층을 전기적으로 연결하는 비아; 상기 도전층에 밀착 또는 미리 결정된 거리만큼 이격 되어 배치되는 복수개의 다이폴 안테나를 포함하고, 상기 전기 용량성 셀들은 상기 복수개의 다이폴 안테나를 기준으로 순차적으로 나누어져 그룹화된다. 본 발명의 일 실시 예에 따른 인공 자기 도체를 구비하는 안테나는 도전성(導電性) 접지층; 상기 도전성 접지층 과 미리 결정된 거리만큼 이격되어 형성되고, 전기 용량성 셀들을 포함하는 도전층; 상기 접지층과 상기 도전층 을 전기적으로 연결하는 비아; 상기 도전층에 밀착 또는 미리 결정된 거리만큼 이격되어 배치되는 복수개의 다 이폴 안테나;를 포함하고, 상기 전기 용량성 셀들은 상기 복수개의 다이폴 안테나를 기준으로 순차적으로 나누 어져 그룹화된다."}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은, 인공 자기 도체의 도체부를 형성하는 전체 전기 용량성 셀들을 다이폴 배열 안테나의 위치에 따라 소정의 그룹으로 나누고, 전기 용량성 셀들이 동일한 그룹에 포함되면 균일한 반사위상을 가지고, 각각의 그룹 은 비균일한 반사위상을 가지게 함으로써, 반사파의 방향을 조절하는 것과 동일한 성능을 가지면서 설계과정을 매우 단순화할 수 있다."}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되어 있는 상세한 설명을 통하여 보다 명확 해 질 것이며, 그에 따라 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 또한, 본 발명을 설명함에 있어서 본 발명과 관련된 공지 기술에 대한 구체적 인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에 그 상세한 설명을 생략하기로 한다. 본 발명은, 격자 셀이 배열된 구조를 가지는 인공 자기 도체(Artificial magnetic conductor: AMC)의 설계 방 법을 제안한다. 여기서, 후술할 본 발명의 실시 예에서는 반사 계수의 위상값을 격자 위치에 따라 다르게 하여반사파의 동위상면 형태를 조절하고, 반사파의 진행 방향을 조절할 수 있는 인공 자기 도체의 설계 방법에 제공 한다. 그러면 여기서, 도 1을 참조하여 본 발명의 실시 예에 따른 인공 자기 도체를 설명하기 전에 일반적인 인 공 자기 도체의 구조를 구체적으로 설명하기로 한다. 도 1은 일반적인 인공 자기 도체를 도시한 도면이다. 도 1을 참조하면, 인공 자기 도체의 정면, 측면, 후면을 도시하고 있다. 인공 자기 도체의 측면 을 참조하면, 인공 자기 도체는 접지층, 격자 셀을 포함하는 도체층, 및 비아(via, 30)를 포함한 다. 상기 접지층은 도전성(導電性)이고, 상기 도체층은 상기 접지층으로부터 미리 결정된 거리만큼 이 격되어 형성된다. 상기 비아은 상기 접지층과 도전층을 전기적으로 연결한다. 상기 도체층에 배열된 전 기 용량성의 격자 셀 각각의 크기 또는 간격은 균일하고, 상기 전기 용량성의 격자 셀들의 위치에 따라 반사 계 수 위상값이 균일하게 배열된다. 도 2는 도 1에 도시된 인공 자기 도체의 격자 셀 간의 커패시턴스 성분과 인덕턴스 성분으로 발생되는 표면 임 피던스의 변화에 따른 반사 계수의 위상 변화를 나타내는 그래프이다. 도 1과 2에 도시된 바와 같이, 일반적인 인공 자기 도체는 균일한 격자 구조를 가지고 있으며, 각 주파수에서의 모든 격자들의 반사계수 위상은 도 2와 같이 동일하고, 반사 계수의 위상이 0이 되는 주파수에서 완벽한 자기 도체의 성질을 가지게 된다. 따라서 종래의 인공 자기 도체는 전자기파를 반사하는데 있어 입사각과 반사각이 Snell의 법칙을 따르고 있으며, 반사 계수의 위상에 변화가 있을 뿐 반사파의 진행 방향이 변화하지는 않는 특성을 지니고 있었다. 그 러면 여기서, 도 3을 참조하여 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조 를 보다 구체적으로 설명하기로 한다. 도 3은 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조를 개략적으로 도시한 도면이다. 도 3을 참조하면, 인공 자기 도체는 도전성(導電性) 접지층, 상기 접지층과 미리 결정된 거리만큼 이격되 어 형성되고, 전기 용량성 셀들을 포함하며 도전층, 및 상기 접지층과 상기 도전층을 전기적으로 연결하는 비아 를 포함한다. 소정의 다이폴 안테나(310a, 310b, 310c, 310d)는 상기 인공 자기 도체의 도전층, 예컨대 윗면에 밀착시키 거나 5mm 이내의 간격을 두고 띄워서 배치된다. 또한, 인공 자기 도체는 급전부(320a, 320b, 320c, 320 d)를 포함한다. 상기 도 3은 비균일한 격자 셀 구조를 가지는 인공 자기 도체를 4개의 다이폴 안테나(310a, 310b, 310c, 310d)로 이루어진 배열 안테나의 반사판으로 적용한 경우이다. 즉, 상기 인공 자기 도체에 포함된 비균일 한 격자 셀(311 내지 326)은 서로 다른 크기를 가짐으로써, 서로 다른 반사위상을 갖는다. 그러나 도 3의 비균일한 격자 셀 구조를 가지는 인공 자기 도체의 경우, 격자 셀의 수가 많아질수록 각각 의 셀을 특정 주파수에서 특정 반사위상을 가지도록 설계해야한다. 이와 같은 경우에는 설계 과정이 매우 복잡 해진다는 단점이 있다. 그러면 여기서, 도 4a 및 도 4b를 참조하여 모든 격자구조가 동일한 형태를 가진 경우와 동일하지 않은 형태를 가진 경우를 보다 구체적으로 설명하기로 한다. 도 4a는 모든 격자구조가 동일한 형태를 가진 경우에 대한 등가회로이고, 4b는 각 격자구조가 비균일한 형태에 대한 등기회로이다. 도 4a 및 도 4b를 참조하면, 도 4a의 모든 커패시턴스(capacitance)와 인덕턴스(inductance)는 C0와 L0로 동일 하다. 하지만, 도 4b의 커패시턴스와 인덕턴스 값은 좌측으로부터 각각 C1/L1, C2/L2, C3/L3이다. 본 발명의 실시 예와 같은 버섯형의 임피던스 구조에서 커패시턴스 성분은 도전층의 이웃하는 격자들 간의 근접 성으로 인해 발생하고, 인덕턴스 성분은 회로의 루프 구조로 인해 발생한다. 도 4a 및 도 4b의 인공 자기 도체의 격자 구조는 격자들 간의 캐패시턴스 성분과 인덕턴스(inductance) 성분에 의한 공진 특성을 가지고 있다. 격자 구조에서 발생되는 커패시턴스 성분과 인덕턴스 성분에 의한 표면 임피던 스는 하기 <수학식 1>과 같이 표현된다.수학식 1"}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 <수학식 1>을 참조하면, Zs는 표면, 예컨대 S에 대한 임피던스이다. j는 -1에 제곱근을 취한 값이고, w는 각 주파수로 단위는 rad/s이다. 즉, Hz 단위를 가지는 주파수 f에 2 × pi를 곱한 값입니다. L은 격자 구조를 가지는 등가회로의 인덕턴스이고, C는 격자구조를 가지는 등가회의 커패시턴스이다. 또한, 표면에서의 반사계수는 하기 <수학식 2>와 같이 나타나며, 반사계수의 위상 값은 하기 <수학식 3>과 같이 나타낼 수 있다. 수학식 2"}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 <수학식 2>를 참조하면, Zs는 표면, 예컨대 S에 대한 임피던스이고, Γ는 반사 계수이고, η는 자유 공간 임피던스이며, e는 일반적인 수학에서 사용되는 exponential 함수이고, Φ는 반사계수의 위상 값으로, 인공 자 기 도체 표면의 경계면에서 전자기파가 반사될 때, 전자기파의 위상이 얼마나 변화되는가를 나타낸다. 수학식 3"}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상기 <수학식 3>을 참조하면, Zs는 표면, 예컨대 S에 대한 임피던스이고, η는 자유 공간 임피던스이다. In은 일반적인 수학에서 사용되는 자연로그 함수이고, Im은 의 허수부를 구하기 위한 함수이다. 그러면 여기서, 하기 <표 1>을 참조하여 상기 인공 자기 도체에 포함된 비균일한 격자 셀(311 내지 326) 이 특정 주파수에서 가지는 반사위상과 상기 반사위상을 갖기 위해 설계된 전기 용량성 격자 셀의 크기를 보다 구체적으로 설명하기로 한다.<표 1>을 참조하면, <표 1>은 도 3의 비균일한 격자 셀을 가지는 인공 자기 도체의 각 셀(311 내지 326)이 특정 주파수, 예컨대 2.045 GHz의 주파수에서 가지는 반사위상과, 이러한 반사위상을 갖기 위해 설계된 전기 용 량성 격자 셀의 크기를 나타낸다. 상기 <표 1>과 같은 일반적인 비균일한 격제 셀을 가지는 인공 자기 도체의 설계기법에 의거하여 인공 자기 도 체를 설계하면 상기와 같이 16개의 격자 셀을 각각 설계해야 번거로움이 따른다. 표 1"}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "상기와 같은 경우에는, 격자 셀의 수가 많아질수록 각각의 셀을 특정 주파수에서 특정 반사위상을 가지도록 설 계해야한다. 이와 같은 경우에는 설계 과정이 매우 복잡해진다는 단점이 있다. 그러면 여기서, 도 5를 참조하여 본 발명의 실시 예에 따른 비균일 격자구조를 가지는 인공 자기 도체의 구조를 보다 구체적으로 설명하기로 한 다. 도 5는 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조를 개략적으로 도시한 도면이다. 도 5를 참조하면, 인공 자기 도체는 도전성(導電性) 접지층, 상기 접지층과 미리 결정된 거리만큼 이격되 어 형성되고, 전기 용량성 셀들을 포함하며 도전층, 및 상기 접지층과 상기 도전층을 전기적으로 연결하는 비아 를 포함한다. 소정의 다이폴 안테나(510a, 510b, 510c, 510d)는 상기 인공 자기 도체의 도전층, 예컨대 윗 면에 밀착시키거나 5mm 이내의 간격을 두고 띄워서 배치된다. 또한, 인공 자기 도체는 급전부(510a, 510b, 510c, 510d)를 포함한다. 또한, 상기 도전층에 포함되는 격자 셀들을 다이폴 안테나(510a, 510b, 510c, 510d)를 기준으로 순차적으로 나 누어 그룹화 한다. 도 5에서는, 다이폴 안테나(510a, 510b, 510c, 510d)가 4개이므로 격자 셀(611 내지 626)을 4개의 그룹(530, 540, 550, 560)으로 순차적으로 나누어 그룹화 한다. 첫 번째 그룹에 속하는 격자 셀들(611, 612, 613, 614)의 크기는 동일하며, 두 번째 그룹에 속하는 격자 셀들(615, 616, 617, 618)의 크기 역시 동일하고, 세 번째 그룹에 속하는 격자 셀들(619, 620, 621, 622)의 크기 역시 동일하며, 네 번째 그룹에 속하는 격자 셀들(623, 624, 625, 626)의 크기 역시 동일하다. 상기 각 그룹에 속한 셀들은 동일한 위치에 있는 셀들이 가져야하는 반사위상의 평균을 구하고, 상기 각 그룹에 속한 셀들은 상기 평균값을 가진다. 예를 들어, 8°의 빔 조향각을 가지는 인공자기도체를 세로 방향으로 16개 의 셀을 가지는 구조로 설계하고자 한다. 이때, 1번째 셀부터 4번째 셀들이 각각 100°, 90°, 80°, 70°의 반 사위상을 가져야 한다고 가정한다. 이때, 1 번째 셀부터 4번째 셀이 동일한 그룹에 포함되면, 1 번째 셀부터 4번째 셀의 반사위상 값은 상기 4개의 셀들의 반사 위상, 예컨대 100°, 90°, 80°, 70°를 평균한 반사위상 값인 85°이다. 또한, 상기 각 그룹들(530, 540, 550, 560)끼리는 서로 다른 격자 셀 크기를 가진다. 그러면 여기서, 하기 <표 2>를 참조하여 상기 인공 자기 도체에 포함된 비균일한 격자 셀(611 내지 626)이 특정 주파수에서 가지는 반사위상과 상기 반사위상을 갖기 위해 설계된 전기 용량성 격자 셀의 크기를 보다 구체적으로 설명하기로 한다. 표 2"}
{"patent_id": "10-2010-0025997", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "상기 <표 2>를 참조하면, 도 3과 동일한 반사파 각도를 갖도록 설계하기 위해서 본 발명의 실시 예에 따른 비균 일 격자구조를 가지는 인공 자기 도체의 각 격자 셀(611 내지 626)에서의 반사위상과, 각 전기 용량성 격 자 셀의 크기를 나타낸다. 첫 번째 그룹에 속하는 격자 셀(611, 612, 613, 614)의 크기는 동일한 반사위상, 예컨대 111.4이고, 두 번 째 그룹에 속하는 격자 셀(615, 616, 617, 618)의 크기는 동일한 반사위상, 예컨대 37.1이고, 세 번째 그 룹에 속하는 격자 셀(619, 620, 621, 622)의 크기는 동일한 반사위상, 예컨대 -37.1이고, 네 번째 그룹 에 속하는 격자 셀(623, 624, 625, 626)의 크기 동일한 반사위상, 예컨대 -111.4이다. 본 발명의 실시 예에 따른 비균일한 격자 셀을 가지는 인공 자기 도체의 설계기법에 의거하여 인공 자기 도체 를 설계하는 경우와 일반적인 인공 자기 도체의 설계기법에 의거하여 인공 자기 도체를 설계하는 경 우와 비교하면, 일반적인 인공 자기 도체의 설계기법에 의거하여 인공 자기 도체를 설계하면 비균일한 격 자 셀 각각이 서로 다른 반사위상을 가지도록 설계해야 하기 때문에 번거로움이 따른다. 하지만, 본 발명의 실시 예에 따른 비균일한 격자 셀을 가지는 인공 자기 도체의 설계기법에 의거하여 인공 자 기 도체를 설계하면 다이폴 안테나 위치에 따라 나뉘어진 각각의 그룹에 속한 격자 셀은 동일한 반사위상 을 가지므로 일반적인 인공 자기 도체의 설계기법에 의거하여 설계된 인공 자기 도체보다 간편하게 인공 자기 도체를 설계할 수 있다. 그러면 여기서, 도 8및 도9를 참조하여 일반적인 방법에 의거하여 설계된 인공 자 기 도체와 본 발명의 실시 예에 따라 설계된 인공 자기 도체를 개의 다이폴 안테나로 구성되는 배열 안테나의 반사판으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴을 설명하기로 한다. 도 6은 일반적인 인공 자기 도체의 설계기법에 의거하여 설계된 인공 자기 도체를 4개의 다이폴 안테나로 구성되는 배열 안테나의 반사판으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴 도시한 도면이고, 도 7은 본 발명의 실시 예에 따라 설계된 인공 자기 도체를 개의 다이폴 안테나로 구성되는 배열 안테나의 반사판 으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴을 도시한 도면이다. 도 6을 참조하면, 방사되는 전력이 일반적인 도체 반사판이나 균일한 격자 셀을 가지는 인공 자기 도체 반사판 을 사용했을 경우와 같이 0°가 아닌, 비균일한 격자 셀을 가지는 인공 자기 도체를 반사판으로 적용함에 따라 8°만큼 기울어져서 방사됨을 확인할 수 있다. 도 7을 참조하면, 방사되는 전력이 0°가 아닌 8°만큼 기울어져서 방사됨을 확인할 수 있다. 이처럼 단순화된 설계기법에 따라 비균일한 격자 셀을 가지는 인공 자기 도체를 설계해도, 종래의 비균일한 격자 셀을 가지는 인 공 자기 도체와 동일한 성능을 가질 수 있다. 이와 같이, 본 발명에 실시 예에 따른 단순화된 비균일 격자구조를 가지는 인공 자기 도체 설계기법에 의거하여 설계된 인공 자기 도체를 사용하면 격자 셀의 개수가 늘어남에 따라 증가하는 설계의 복잡도를 비약적으로 줄일 수 있으며, 각 격자 셀이 가지는 크기의 차이도 커지기 때문에 제작공정에서 발생하는 미세한 오차에 따른 성능 저하를 줄일 수 있다. 이제까지 본 발명에 대하여 바람직한 실시예를 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 본 발명을 구현할 수 있 음을 이해할 것이다. 그러므로, 상기 개시된 실시예 들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어 야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 한다."}
{"patent_id": "10-2010-0025997", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일반적인 인공 자기 도체를 도시한 도면, 도 2는 도 1에 도시된 인공 자기 도체의 격자 셀 간의 커패시턴스 성분과 인덕턴스 성분으로 발생되는 표면 임 피던스의 변화에 따른 반사 계수의 위상 변화를 나타내는 그래프, 도 3은 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조를 개략적으로 도시한 도면, 도 4a는 균일 격자를 갖는 기존의 인공 자기 도체에 대한 등가회로이며, 4b는 비균일 격자를 갖는 본 발명에 따 른 인공 자기 도체에 대한 등가회로, 도 5는 본 발명의 실시 예에 따른 비균일 격자 셀 구조를 가지는 인공 자기 도체의 구조를 개략적으로 도시한 도면, 도 6은 일반적인 인공 자기 도체의 설계기법에 의거하여 설계된 인공 자기 도체를 4개의 다이폴 안테나로 구성되는 배열 안테나의 반사판으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴을 도시한 도면, 도 7은 본 발명의 실시 예에 따라 설계된 인공 자기 도체를 개의 다이폴 안테나로 구성되는 배열 안테나의 반사판으로 사용했을 때, 2.045 GHz의 주파수에서의 방사패턴을 도시한 도면이다."}
