{"patent_id": "10-2020-0114005", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0032343", "출원번호": "10-2020-0114005", "발명의 명칭": "전자 장치 및 전자 장치에서 인 에어 제스처를 처리하는 방법", "출원인": "삼성전자주식회사", "발명자": "데그티야렌코, 일리야"}}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 통신 모듈; 적어도 하나의 프로세서; 디스플레이 모듈; 및 메모리;를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 통신 모듈을 통해 연결된 디지털 펜으로부터 인 에어 제스처(in-air gesture) 및 버튼 선택 정보를 수신하고, 상기 수신된 인 에어 제스처 및 버튼 선택 정보에 기반하여 제스처 종류를 판단하고,상기 판단한 제스처 종류에 따라 상기 인 에어 제스처를 인식하고, 상기 인식된 인 에어 제스처를 출력하도록 상기 디스플레이 모듈을 제어하는 인스트럭션들(instructions)을 저장하는, 전자 장치."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제스처 입력의 종류는, 손글씨, 스케치, 도형, 다이어 그램 또는 공식을 포함하는 전자 장치."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 버튼 선택 정보는, 상기 디지털 펜의 버튼의 선택 및 해제 시점을 포함하며, 상기 인스트럭션들은 상기 프로세서가, 상기 수신된 인 에어 제스처에서 상기 선택 및 해제 시점에 대응하여 입력된 제스처를 인식하도록 하는, 전자장치."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 인스트럭션들은 상기 프로세서가, 상기 제스처 입력의 종류가 상기 손글씨인 경우, 상기 선택 및 해제 시점에 대응하는 제스처에 기반으로 텍스트데이터를 출력하도록 하는, 전자 장치."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 인스트럭션들은 상기 프로세서가, 상기 디지털 펜으로부터, 상기 디지털 펜의 가속도 센서 또는 자이로 센서를 통해 감지된 센서 데이터를 수신하고, 상기 수신된 센서 데이터에 기반하여 상기 인 에어 제스처를 인식하도록 하는, 전자 장치.공개특허 10-2022-0032343-3-청구항 6 제1항에 있어서, 상기 수신된 인 에어 제스처는 적어도 두 개의 제스처 종류들에 따라 입력되는 적어도 두 개의 제스처들을 포함하며, 상기 인스트럭션들은 상기 프로세서가, 상기 적어도 두 개의 제스처들 각각을 해당하는 제스처 종류에 기반하여 처리하고, 상기 제스처 종류에 따라 처리된 상기 적어도 두 개의 제스처들이 표시되도록 하는 전자 장치."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 인스트럭션들은 상기 프로세서가, 근거리 통신 연결을 통해 상기 디지털 펜과 연결되도록 상기 통신 모듈을 제어하고, 상기 근거리 통신을 통해 상기 디지털 펜으로부터 상기 인 에어 제스처 및 상기 버튼 선택 정보를 수신하도록제어하는, 전자 장치."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 인스트럭션들은 상기 프로세서가, 기계 학습(machine learning) 기술을 이용하여 상기 제스처 분류를 판단하도록 하는, 전자 장치."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 인스트럭션들은 상기 프로세서가, 상기 수신된 인 에어 제스처에서 2차원 특성 정보 및 3차원 특성 정보를 추출하고, 상기 추출된 2차원 특성 정보 및 3차원 특성 정보에 기반하여, 상기 제스처 종류를 판단하도록 하는 전자 장치."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치에서 인 에어 제스처를 처리하는 방법에 있어서, 상기 전자 장치의 통신 모듈을 통해 연결된 디지털 펜으로부터 인 에어 제스처(in-air gesture) 및 버튼 선택정보를 수신하는 동작; 상기 수신된 인 에어 제스처 및 버튼 선택 정보에 기반하여 제스처 종류를 판단하는 동작; 상기 판단한 제스처 종류에 따라 상기 인 에어 제스처를 인식하는 동작; 및 상기 인식된 인 에어 제스처를 출력하는 동작;을 포함하는, 전자 장치에서의 인 에어 제스처 처리 방법."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 제스처 입력의 종류는, 손글씨, 스케치, 도형, 다이어 그램 또는 공식을 포함하는, 전자 장치에서의 인 에어 제스처 처리 방법."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 공개특허 10-2022-0032343-4-상기 버튼 선택 정보는, 상기 디지털 펜의 버튼의 선택 및 해제 시점을 포함하며, 상기 수신된 인 에어 제스처에서 상기 선택 및 해제 시점에 대응하여 입력된 제스처를 인식하는 동작;을 더 포함하는, 전자 장치에서의 인 에어 제스처 처리 방법."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 제스처 입력의 종류가 상기 손글씨인 경우, 상기 선택 및 해제 시점에 대응하는 제스처에 기반으로 텍스트데이터를 출력하는 동작;을 더 포함하는, 전자 장치에서의 인 에어 제스처 처리 방법."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서, 상기 디지털 펜으로부터, 상기 디지털 펜의 가속도 센서 또는 자이로 센서를 통해 감지된 센서 데이터를 수신하는 동작; 및 상기 수신된 센서 데이터에 기반하여 상기 인 에어 제스처를 인식하는 동작;을 더 포함하는, 전자 장치에서의인 에어 제스처 처리 방법."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서, 상기 수신된 인 에어 제스처는 적어도 두 개의 제스처 종류들에 따라 입력되는 적어도 두 개의 제스처들을 포함하며, 상기 적어도 두 개의 제스처들 각각을 해당하는 제스처 종류에 기반하여 처리하는 동작; 및 상기 제스처 종류에 따라 처리된 상기 적어도 두 개의 제스처들이 표시 동작;을 더 포함하는, 전자 장치에서의인 에어 제스처 처리 방법."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서, 근거리 통신 연결을 통해 상기 디지털 펜과 연결하는 동작; 및 상기 근거리 통신을 통해 상기 디지털 펜으로부터 상기 인 에어 제스처 및 상기 버튼 선택 정보를 수신하는 동작;을 더 포함하는, 전자 장치에서의 인 에어 제스처 처리 방법."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서, 기계 학습(machine learning) 기술을 이용하여 상기 제스처 분류를 판단하는 동작;을 더 포함하는, 전자 장치에서의 인 에어 제스처 처리 방법."}
{"patent_id": "10-2020-0114005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10항에 있어서, 상기 인스트럭션들은 상기 프로세서가, 상기 수신된 인 에어 제스처에서 2차원 특성 정보 및 3차원 특성 정보를 추출하는 동작; 및 상기 추출된 2차원 특성 정보 및 3차원 특성 정보에 기반하여, 상기 제스처 종류를 판단하는 동작;을 더 포함하는, 전자 장치에서의 인 에어 제스처 처리 방법."}
{"patent_id": "10-2020-0114005", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서의 다양한 실시 예에 따른, 전자 장치 및 전자 장치에서 인 에어 제스처를 처리하는 방법은, 통신 모듈; 적어도 하나의 프로세서; 디스플레이 모듈; 및 메모리;를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 통신 모듈을 통해 연결된 디지털 펜으로부터 인 에어 제스처(in-air gesture) 및 버튼 선택 정 보를 수신하고, 상기 수신된 인 에어 제스처 및 버튼 선택 정보에 기반하여 제스처 종류를 판단하고, 상기 판단 한 제스처 종류에 따라 상기 인 에어 제스처를 인식하고, 상기 인식된 인 에어 제스처를 출력하도록 상기 디스플 레이 모듈을 제어하는 인스트럭션들(instructions)을 저장할 수 있다. 그 외 다양한 실시 예가 가능할 수 있다."}
{"patent_id": "10-2020-0114005", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서의 다양한 실시 예들은, 전자 장치 및 전자 장치에서 인 에어 제스처(in-air gesture)를 인식하고 처리 하는 방법에 관한 것이다."}
{"patent_id": "10-2020-0114005", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 다양한 전자 장치(예, 증강 현실(augmented reality: AR) 장치, 가상 현실(virtual reality: VR) 장치 또 는 스마트 TV)들에 대해 사용자 친화적인 데이터 입력 인터페이스가 요구되고 있다. 이러한 장치들에 데이터를 입력하기 위해 음성 인식 기반 또는 제스처 기반의 입력 방식을 사용할 수 있다. 제스처 기반의 입력 방식 중 손글씨와 같은 입력 형태를 이용하는 방식은 인간과 기계 간에 가장 자연스럽게 인 터랙션(interaction)할 수 있는 방법들 중 하나이다. 상기 제스처 인식 기술은 비디오 추적 기술에 기반할 수 있다."}
{"patent_id": "10-2020-0114005", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "음성 인식 기반 또는 제스처 기반의 입력 방식을 사용함에 따라, 낮은 신뢰성, 개인 정보 입력의 부적절함, 또 는 인식된 데이터를 변경할 수 있는 기회가 부족함 등 다양한 단점이 야기될 수 있다. 또한, 모든 필기 데이터 및 제어 제스처는 특별한 메커니즘 없이 하나의 스트로크(stroke)로 기록될 수 있으며, 콘텐트(예, 제어 제스처, 텍스트, 도형, 스케치 등)에 대한 자유 형식 입력의 경우 상기 필기 데이터 및 제스처 를 다른 제스처 또는 스트로크로 분리하는 것이 매우 복잡할 수 있다. 다양한 실시 예에 따른 전자 장치 및 전자 장치에서 인 에어 제스처를 처리하는 방법은, 센서 기반으로 공중에 서 입력된 인 에어 제스처에서, 펜 업/다운을 감지하고, 제스처의 종류를 분류하여 상기 제스처 입력을 처리할 수 있다."}
{"patent_id": "10-2020-0114005", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서의 다양한 실시 예에 따른, 전자 장치는 통신 모듈; 적어도 하나의 프로세서; 디스플레이 모듈; 및 메모 리;를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 통신 모듈을 통해 연결된 디지털 펜으로부 터 인 에어 제스처(in-air gesture) 및 버튼 선택 정보를 수신하고, 상기 수신된 인 에어 제스처 및 버튼 선택 정보에 기반하여 제스처 종류를 판단하고, 상기 판단한 제스처 종류에 따라 상기 인 에어 제스처를 인식하고, 상기 인식된 인 에어 제스처를 출력하도록 상기 디스플레이 모듈을 제어하는 인스트럭션들(instructions)을 저 장할 수 있다. 본 문서의 다양한 실시 예에 따른 전자 장치에서 인 에어 제스처를 처리하는 방법은, 상기 전자 장치의 통신 모 듈을 통해 연결된 디지털 펜으로부터 인 에어 제스처(in-air gesture) 및 버튼 선택 정보를 수신하는 동작; 상 기 수신된 인 에어 제스처 및 버튼 선택 정보에 기반하여 제스처 종류를 판단하는 동작; 상기 판단한 제스처 종 류에 따라 상기 인 에어 제스처를 인식하는 동작; 및 상기 인식된 인 에어 제스처를 출력하는 동작;을 포함할 수 있다."}
{"patent_id": "10-2020-0114005", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서의 다양한 실시 예에 따른 전자 장치 및 전자 장치에서 인 에어 제스처를 처리하는 방법은, 사용자의 인 에어 제스처를 종류에 따라 분류하여 처리함에 따라, 사용자가 직관적으로 전자 장치를 제어하도록 할 수 있다."}
{"patent_id": "10-2020-0114005", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예들이 첨부된 도면을 참조하여 기재된다. 실시 예 및 이에 사용된 용어들은 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 문서에서, \"A 또는 B\" 또는 \"A 또는 B 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모든 가능 한 조합을 포함할 수 있다. \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 해당 구성요소들을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으로 또는 통신적으로) 연 결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 문서에서, \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, 하드웨어적 또는 소프 트웨어적으로 \"~에 적합한,\" \"~하는 능력을 가지는,\" \"~하도록 변경된,\" \"~하도록 만들어진,\" \"~를 할 수 있 는,\" 또는 \"~하도록 설계된\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로 세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 웨어러블 장 치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head- mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하 나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼 트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토 스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구, 건물/구조물 또는 자동차의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터, 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 플렉서블하거나, 또는 전술한 다양한 장치들 중 둘 이상의 조합일 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공 지능 전자 장치)를 지칭할 수 있다. 이하, 첨부 도면을 참조하여, 본 문서의 다양한 실시 예에 따른 전자 장치 및 서비스 디스커버리하는 전자 장치 및 방법이 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 문서의 다양한 실시 예에 따른, 네트워크 환경 내의 전자 장치의 블럭도이다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈 , 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에 서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성 요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다.센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a 내지 2e는 본 문서의 다양한 실시 예에 따라, 전자 장치로 인 에어 제스처가 입력되는 상황의 다양한 예 들을 도시한 도면들이다. 본 문서의 다양한 실시 예에 따르면, 사용자는 인 에어 제스처를 입력하기 위해, 디지털 펜(예, 스타 일러스 펜)을 이용할 수 있다. 예컨대, 상기 디지털 펜은 적어도 하나의 버튼(201a)을 포함하며, 상기 버 튼(201a)이 선택됨에 따라 전자 장치에서 인 에어 제스처에 대한 미리 지정된 기능을 수행하도록 할 수 있 다. 다양한 실시예에 따라, 후술하는 설명에서는 상기 버튼(201a)이 눌러진 상태를 펜 다운(pen down) 상태라 지칭할 수 있으며, 상기 버튼(201a)의 누름이 해제된 상태를 펜 업(pen up) 상태라 지칭할 수 있다. 본 문서의 다양한 실시 예에 따른 디지털 펜(예, S 펜TM )에는 제스처를 추적하고, 특히 필기 및 손으로 그린 물 체 입력에 사용할 수 있는 관성 시스템(예, 가속도 센서, 자이로 센서)이 장착될 수 있다. 도 2a를 참조하면, 전자 장치는 웨어러블 장치로서 사용자의 신체 일부(예, 머리)에 착용 가능한 형 태일 수 있다. 사용자는 디지털 펜을 이용하여 인 에어 제스처의 일 종류로 손글씨(handwriting) 데 이터를 입력할 수 있다. 예컨대, 사용자는 디지털 펜을 이용하여 \"hello\"에 해당하는 손글씨를 입력 할 수 있다. 도 2b를 참조하면, 전자 장치는 태블릿 PC(tablet personal computer)로서, 디지털 펜의 접촉을 감 지하는 디스플레이 모듈을 포함할 수 있다. 본 문서의 다양한 실시 예에 다르면, 사용자는 디지털 펜을 파지한 상태로 상기 디스플레이 모듈 상에 손글씨를 작성할 수 있다. 예컨대, 상기 전자 장치는 디지털 펜이 디스플레이 모듈 과 터치되는 지점을 추적하고, 상기 지점들로 이뤄지는 궤적을 손글씨 데이터로 확인할 수 있다. 도 2c를 참고하면, 사용자는 디지털 펜을 이용하여 전자 장치의 기능을 제어할 수 있다. 예컨대, 전자 장치에서는 카메라 어플리케이션이 실행될 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치에서는 디지털 펜으로부터의 입력에 따라 상기 카메라 어플리케이션에서의 기능을 제어할 수 있다. 예컨대, 상기 전자 장치의 화면상에 카메라 모듈을 통해 획득된 영상이 표시되고, 디지털 펜의 버튼(201a)이 선택되면, 버튼(201a)이 선택된 시점에 전자 장치 에 표시된 화면이 촬영될 수 있다. 도 2d를 참조하면, 전자 장치에서는 디지털 펜을 이용한 콘텐트 편집 기능을 제공할 수 있다. 예컨대, 전자 장치의 사용자는 촬영된 이미지를 선택하고, 상기 디지털 펜을 이용하여 상기 이 미지 상으로 입력되는 글씨(예, 'JOSH') 또는 다양한 표시들을 입력할 수 있다. 상기 전자 장치에서 는 상기 이미지에 글씨 또는 표시들을 합성하여 화면상에 표시하거나 메모리에 저장할 수 있다. 도 2e를 참조하면, 전자 장치는 모니터 형태의 장치일 수 있다. 예컨대, 상기 전자 장치에서는 실행 가능한 다양한 어플리케이션들이 표시될 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 원격으로 디지털 펜의 입력을 감지하고, 상기 어플 리케이션들 중 감지된 입력에 대응하는 어플리케이션에 대해 미리 지정된 기능을 수행할 수 있다. 예컨대, 전자 장치는 상기 감지된 입력을 해당 어플리케이션을 선택하고, 실행 시키는 명령으로 확인할 수 있다. 도 3a는 본 문서의 다양한 실시 예에 따른 전자 장치 및 디지털 펜 구성의 일 예를 도시한 블록도이다. 도 3a를 참조하면, 전자 장치는 디지털 펜과 통신 연결되어 상기 디지털 펜으로부터 인 에어 제 스처에 대응하는 정보를 수신할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 디스플레이 모듈, 센 서 모듈 및 통신 모듈을 포함할 수 있다. 상기 프로세서는 인 에어 제스처 분류 모듈, 손 글씨 인식 모듈, 스케치 및 두들 인식 모듈, 도형 및 다이어그램 인식 모듈 또는 공식 인식 모 듈을 포함할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 웨어러블 장치로서, 안경/헬멧 형태의 HMD 장치, 헤드셋 (headset), 헤드 업(head-up) 디스플레이 장치 또는 홀로그래픽(holographic)디스플레이 장치일 수 있으며, 그 외 다양한 형태의 디스플레이 장치가 가능할 수 있다. 본 문서의 다양한 실시 예에 따르면, 프로세서가 다양한 모듈들을 포함하는 것으로 설명하였지만, 상기 구 성들 중 일부가 생략 또는 삭제될 수 있으며, 프로세서에서 해당 모듈의 동작을 수행하도록 구성될 수 있 다. 본 문서의 다양한 실시 예에 따르면, 인 에어 제스처 분류 모듈은 디지털 펜을 통해 원격으로 입력되 는 인 에어 제스처의 종류를 분류할 수 있다. 예컨대, 상기 인 에어 제스처의 종류는 손글씨, 스케치(sketch), 두들(doodle), 도형(shape), 다이어그램(diagram) 또는 공식(formula)을 포함할 수 있으며, 그 외 다양한 분류 항목을 포함할 수 있다. 본 문서의 다양한 실시 예에 따르면, 손글씨 인식 모듈은 인 에어 제스처 분류 모듈로부터 손글씨로 분류된 인 에어 제스처의 데이터를 처리할 수 있다. 예컨대, 손글씨 인식 모듈은 인 에어 제스처에 해당하 는 텍스트를 인식하고, 인 에어 제스처를 디스플레이 모듈을 통해 화면상에 텍스트의 형태로 출력할 수 있 다. 본 문서의 다양한 실시 예에 따르면, 스케치 및 두들 인식 모듈은 인 에어 제스처 분류 모듈로부터 스케치 또는 두들로 분류된 인 에어 제스처의 데이터를 처리할 수 있다. 예컨대, 스케치 및 두들 인식 모듈 은 인 에어 제스처에서 특징을 추출하고, 상기 추출한 특징에 대응하는 사진 또는 객체의 이미지를 디스플 레이 모듈을 통해 화면상에 출력할 수 있다. 본 문서의 다양한 실시 예에 따르면, 도형 및 다이어그램 인식 모듈은 인 에어 제스처 분류 모듈로부 터 도형 또는 다이어그램으로 분류된 인 에어 제스처의 데이터를 처리할 수 있다. 예컨대, 도형 및 다이어그램인식 모듈은 인 에어 제스처에 대응하는 도형 또는 다이어그램을 인식하고, 인 에어 제스처를 인식된 도형 또는 다이어그램의 형태로 디스플레이 모듈을 통해 화면상에 출력할 수 있다. 본 문서의 다양한 실시 예에 따르면, 공식 인식 모듈은 인 에어 제스처 분류 모듈로부터 공식으로 분 류된 인 에어 제스처의 데이터를 처리할 수 있다. 예컨대, 공식 인식 모듈은 인 에어 제스처의 데이터에서 숫자, 수식 기호, 연산자 등을 추출하여, 공식의 형태로 인 에어 제스처를 디스플레이 모듈을 통해 화면상 에 출력할 수 있다. 본 문서의 다양한 실시 예에 따르면, 메모리는 실행 시에, 상기 프로세서(또는 보조 프로세서) 가, 상기 통신 모듈을 통해 연결된 디지털 펜으로부터 인 에어 제스처 및 버튼 선택 정보를 수신하고, 상 기 수신된 인 에어 제스처 및 버튼 선택 정보에 기반하여 제스처 종류를 판단하고, 상기 판단한 제스처 종류에 따라 상기 인 에어 제스처를 인식하고, 상기 인식된 인 에어 제스처를 출력하도록 상기 디스플레이 모듈을 제어 하는 인스트럭션들을 저장할 수 있다. 본 문서의 다양한 실시 예에 따르면, 디스플레이 모듈은 프로세서를 통해 출력되는 인 에어 제스처의 데이터를 표시할 수 있다. 예컨대, 상기 인 에어 제스처의 데이터는, 손글씨, 스케치, 두들, 도형, 다이어그램 또는 공식의 형태로 출력되어 디스플레이 모듈에 표시될 수 있다. 본 문서의 다양한 실시 예에 따르면, 센서 모듈은 인 에어 제스처를 감지할 수 있다. 예컨대, 센서 모듈 은 제스처 센서, 가속도 센서 또는 근접 센서를 포함할 수 있으며, 그 외 인 에어 제스처를 감지 또는 분 류하기 위한 다양한 센서들이 포함될 수 있다. 본 문서의 다양한 실시 예에 따르면, 통신 모듈은 전자 장치와 디지털 펜과의 통신 연결을 수행 할 수 있다. 예컨대, 상기 통신 모듈은 근거리 통신 방식(예, BLE)을 통해 상기 전자 장치와 디지털 펜을 연결하여, 상기 디지털 펜으로부터의 버튼(201a) 입력 또는 인 에어 제스처와 관련된 정보를 수 신할 수 있다. 도 3b는 본 문서의 다양한 실시 예에 따른 인 에어 제스처의 입력 및 출력의 다양한 예들을 도시한 도면이다. 도 3b를 참조하면, 사용자는 디지털 펜을 이용하여 다양한 제스처를 입력할 수 있다. 예컨대, 전자 장치에서는 상기 제스처 입력이 원격으로 입력되는 인 에어 제스처로서, 인 에어 제스처 분류 모듈을 통해 인 에어 제스처의 종류가 분류되도록 제어할 수 있다. 본 문서의 다양한 실시 예에 따르면, 사용자는 'Hello'에 해당하는 제스처(320a)를 입력할 수 있다. 인 에 어 제스처 분류 모듈은 입력된 제스처(320a)의 종류를 손글씨로 분류하고, 손글씨 인식 모듈에서 상 기 제스처(320a)를 처리하도록 할 수 있다. 본 문서의 다양한 실시 예에 따르면, 손글씨 인식 모듈에서는 상기 제스처(320a)에 해당하는 언어를 확인 하고, 해당 언어에서 상기 제스처(320a)에 대응하는 문자를 확인할 수 있다. 상기 확인된 문자는 텍스트 데이터 (320b)의 형태로 출력될 수 있다. 본 문서의 다양한 실시 예에 따르면, 사용자는 고양이 그림에 해당하는 제스처(330a)를 입력할 수 있다. 인 에어 제스처 분류 모듈은 입력된 제스처(330a)의 종류를 스케치 또는 두들로 분류하고, 스케치 및 두들 인식 모듈에서 상기 제스처(330a)를 처리하도록 할 수 있다. 본 문서의 다양한 실시 예에 따르면, 스케치 및 두들 인식 모듈에서는 상기 제스처(330a)에 해당하는 사진 또는 객체를 확인할 수 있다. 상기 확인된 사진 또는 객체는 이미지 데이터(330b)의 형태로 출력될 수 있다. 본 문서의 다양한 실시 예에 따르면, 사용자는 다이어그램의 형태의 제스처(340a)를 입력할 수 있다. 인 에어 제스처 분류 모듈은 입력된 제스처(340a)의 종류를 도형 또는 다이어그램으로 분류하고, 도형 및 다 이어그램 인식 모듈에서 상기 제스처(340a)를 처리하도록 할 수 있다. 본 문서의 다양한 실시 예에 따르면, 도형 및 다이어그램 인식 모듈에서는 상기 제스처(340a)에 해당하는 다이어그램 구조(예, 비율, 색, 수치)를 확인하고, 해당 다이어그램 구조에 따라 상기 제스처(340a)를 다이어그 램 객체(340b)의 형태로 출력할 수 있다. 본 문서의 다양한 실시 예에 따르면, 사용자는 'E=mc2'에 해당하는 제스처(350a)를 입력할 수 있다. 인 에 어 제스처 분류 모듈은 입력된 제스처(350a)의 종류를 공식으로 분류하고, 공식 인식 모듈에서 상기제스처(350a)를 처리하도록 할 수 있다. 본 문서의 다양한 실시 예에 따르면, 공식 인식 모듈에서는 상기 제스처(350a)에서, 숫자, 수식 기호, 연 산자 등을 추출하고, 추출된 숫자, 수식 기호 또는 연산자를 공식(350b)의 형태로 출력할 수 있다. 다시 도 3a를 참조하면, 디지털 펜은, 버튼(201a), 프로세서, 메모리, 공진 회로, 충전 회로, 배터리, 통신 회로, 안테나, 트리거 회로 및/또는 센서를 포함할 수 있 다. 어떤 실시예들에서는, 상기 디지털 펜의 프로세서, 공진 회로의 적어도 일부 및/또는 통신 회로의 적어도 일부는 인쇄회로기판 상에 또는 칩 형태로 구성될 수 있다. 상기 버튼(201a), 프로세서 , 공진 회로 및/또는 통신 회로는 메모리, 충전 회로, 배터리, 안테나, 트리거 회로 및/또는 센서와 전기적으로 연결될 수 있다. 본 문서의 다양한 실시 예에 따른 버튼(201a)은 물리적인 버튼의 형태로서 디지털 펜 외부에 돌출되어 장 착될 수 있다. 예컨대, 프로세서는 상기 버튼(201a)이 선택되면, 상기 버튼(201a)이 선택되는 동안의 시점 정보 및 인 에어 제스처의 정보를 전자 장치로 전송할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치에서는 상기 버튼(201a)이 선택되는 동안에 입력된 인 에어 제스처를 펜 다운(또는 버튼(201a) 선택) 상태의 제스처로 확인하고, 상기 확인된 펜 다운 상태의 제스처를 펜 업 상태의 제스처와 구분하여 처리할 수 있다. 본 문서의 다양한 실시 예에 따른 프로세서는, 커스터마이즈드(customized) 하드웨어 모듈 또는 소프트웨 어(예를 들어, 어플리케이션 프로그램)를 실행하도록 구성된 제너릭(generic) 프로세서를 포함할 수 있다. 상기 프로세서는, 디지털 펜에 구비된 다양한 센서들, 데이터 측정 모듈, 입출력 인터페이스, 디지털 펜 의 상태 또는 환경을 관리하는 모듈 또는 통신 모듈 중 적어도 하나를 포함하는 하드웨어적인 구성 요소 (기능) 또는 소프트웨어적인 요소(프로그램)를 포함할 수 있다. 상기 프로세서는 예를 들어, 하드웨어, 소 프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함할 수 있다. 일 실시 예에 따르면, 프로세 서는 버튼(예: 버튼)의 눌림 상태를 나타내는 정보, 센서에 의하여 획득된 센싱 정보, 및/또는 센싱 정보에 기반하여 계산된 정보(예: 디지털 펜의 위치와 연관된 정보)를, 통신 회로를 통하여 전 자 장치로 송신하도록 설정될 수 있다. 본 문서의 다양한 실시 예에 따른 공진 회로는, 전자 장치의 디지타이저(예: 표시 장치)로부터 발생되는 전자기장 신호에 기반하여 공진될 수 있으며, 공진에 의하여 전자기 공명 방식(electro-magnetic resonance, EMR) 입력 신호(또는, 자기장 및)를 방사할 수 있다. 전자 장치는, 전자기 공명 방식 입력 신 호를 이용하여, 전자 장치 상의 디지털 펜의 위치를 확인할 수 있다. 예를 들어, 전자 장치는, 디지타이저 내의 복수 개의 채널들(예: 복수 개의 루프 코일들) 각각에서, 전자기 공명 방식 입력 신호에 의하 여 발생되는 유도 기전력(예: 출력 전류)의 크기에 기반하여, 디지털 펜의 위치를 확인할 수 있다. 한편, 상술한 바에서는, 전자 장치 및 디지털 펜이 EMR 방식에 기반하여 동작하는 것과 같이 설명되었지만, 이는 단순히 예시적인 것으로, 전자 장치는 ECR(electrically coupled resonance) 방식에 기반하여 전기 장에 기반한 신호를 발생시킬 수도 있다. 디지털 펜의 공진 회로는, 전기장에 의하여 공진될 수 있다. 전자 장치는, 디지털 펜에서의 공진에 의한 복수 개의 채널들(예: 전극들)에서의 전위를 확인할 수 있으며, 전위에 기반하여 디지털 펜의 위치를 확인할 수도 있다. 디지털 펜은, AES(active electrostatic) 방식으로 구현될 수도 있으며, 그 구현 종류에는 제한이 없음을 당업자는 이해할 것이다. 아울 러, 전자 장치는 터치 패널의 적어도 하나의 전극과 연관된 커패시턴스(셀프 커패시턴스 또는 뮤추얼 커패 시턴스)의 변경에 기반하여 디지털 펜을 검출할 수도 있다. 이 경우, 디지털 펜에는 공진 회로가 포 함되지 않을 수도 있다. 본 개시에서 \"패널\", 또는 \"센싱 패널\"은, 디지타이저 및 TSP(touch screen panel)를 포괄하는 용어로 이용될 수 있다. 다양한 실시예에 따라서, 공진 회로를 통하여 패턴을 가지는 신호가 수신될 수 있다. 프로세서는, 공진 회로를 통하여 수신된 신호의 패턴을 분석하여, 분석 결과에 기반하여 동작을 수행할 수 있다. 다양 한 실시예에 따른 디지털 펜은, 공진 회로를 통하여 하나의 제 1 통신을 수행할 수 있으며, 통신 회 로를 통하여 제 2 통신을 수행할 수 있다. 예를 들어, 디지털 펜은, 전자 장치에 삽입된 경우 에 공진 회로를 통하여 전자 장치로부터 정보를 수신할 수 있다. 예를 들어, 디지털 펜은, 전 자 장치로부터 탈거된 경우에 통신 회로를 통하여 통신 신호를 수신할 수 있으나, 삽입된 경우에도 통신 회로를 통한 통신 신호 수신이 가능할 수 있다.본 문서의 다양한 실시 예에 따른 메모리는, 디지털 펜의 동작에 관련된 정보를 저장할 수 있다. 예 를 들어, 상기 정보는 상기 전자 장치와의 통신을 위한 정보 및 디지털 펜의 입력 동작에 관련된 주 파수 정보를 포함할 수 있다. 아울러, 메모리는, 센서의 센싱 데이터로부터 디지털 펜의 위치 에 대한 정보(예: 좌표 정보, 및/또는 변위 정보)를 계산하기 위한 프로그램(또는, 어플리케이션, 알고리즘, 또 는 처리 루프)을 저장할 수도 있다. 메모리는, 통신 회로의 통신 스택을 저장할 수도 있다. 구현에 따라, 통신 회로 및/또는 프로세서는 전용 메모리를 포함할 수도 있다. 본 문서의 다양한 실시 예에 따른 공진 회로는, 코일(coil)(또는, 인덕터(inductor)) 및/또는 캐패시터 (capacitor)를 포함할 수 있다. 상기 공진 회로는, 입력되는 전기장 및/또는 자기장(예: 전자 장치의 디지타이저로부터 발생되는 전기장 및/또는 자기장)에 기반하여 공진할 수 있다. 디지털 펜이 EMR 방식 에 의하여 신호를 전송하는 경우, 디지털 펜은 전자 장치의 유도성 패널(inductive panel)로부터 발 생되는 전자기장(electromagnetic field)에 기반하여, 공진 주파수를 포함하는 신호를 생성할 수 있다. 디지털 펜이 AES 방식에 의하여 신호를 전송하는 경우, 디지털 펜은 전자 장치와 용량 결합(capacity coupling)을 이용하여 신호를 생성할 수 있다. 디지털 펜이 ECR 방식에 의하여 신호를 전송하는 경우, 디 지털 펜은 전자 장치의 용량성(capacitive) 장치로부터 발생되는 전기장(electric field)에 기반하여, 공 진 주파수를 포함하는 신호를 생성할 수 있다. 일 실시 예에 따르면, 상기 공진 회로는 사용자의 조작 상 태에 따라 전자기장의 세기 또는 주파수를 변경시키는데 이용될 수 있다. 예를 들어, 상기 공진 회로는, 호버링 입력, 드로잉 입력, 버튼 입력 또는 이레이징 입력을 인식하기 위한 다양한 주파수를 제공할 수 있다. 예를 들어, 공진 회로는, 복수 개의 커패시터의 연결 조합에 따라 다양한 공진 주파수를 제공할 수 있거나, 또는 가변 인덕터, 및/또는 가변 커패시터에 기반하여 다양한 공진 주파수를 제공할 수도 있다. 본 문서의 다양한 실시 예에 따른 충전 회로는 스위칭 회로에 기반하여 공진 회로와 연결된 경우, 공 진 회로에서 발생되는 공진 신호를 직류 신호로 정류하여 배터리에 제공할 수 있다. 일 실시 예에 따 르면, 디지털 펜은 충전 회로에서 감지되는 직류 신호의 전압 레벨을 이용하여, 상기 전자 장치(10 1)에 디지털 펜이 삽입되었는지 여부를 확인할 수 있다. 또는, 디지털 펜은 충전 회로에서 확 인되는 신호에 대응하는 패턴을 확인하여, 디지털 펜이 삽입되었는지 여부를 확인할 수도 있다. 본 문서의 다양한 실시 예에 따른 배터리는 디지털 펜의 동작에 요구되는 전력을 저장하도록 구성될 수 있다. 상기 배터리는, 예를 들어, 리튬-이온 배터리, 또는 캐패시터를 포함할 수 있으며, 충전식 또는 교환식일 수 있다. 일 실시 예에 따르면, 배터리는 충전 회로로부터 제공받은 전력(예를 들어, 직류 신호(직류 전력))을 이용하여 충전될 수 있다. 본 문서의 다양한 실시 예에 따른 통신 회로는, 디지털 펜과 전자 장치의 통신 모듈 간의 무선 통신 기능을 수행하도록 구성될 수 있다. 일 실시 예에 따르면, 통신 회로는 근거리 통신 방식을 이 용하여 디지털 펜의 상태 정보, 입력 정보, 및/또는 위치와 연관된 정보를 전자 장치로 전송할 수 있 다. 예를 들어, 통신 회로는 트리거 회로를 통해 획득한 디지털 펜의 방향 정보(예: 모션 센서 데이터), 마이크로 폰을 통해 입력된 음성 정보 또는 배터리의 잔량 정보를 전자 장치로 전송할 수 있다. 예를 들어, 통신 회로는, 센서로부터 획득된 센싱 데이터, 및/또는 센싱 데이터에 기반하여 확 인된 디지털 펜의 위치와 연관된 정보를 전자 장치로 송신할 수 있다. 예를 들어, 통신 회로는, 디지털 펜에 구비된 버튼(201a)의 상태에 대한 정보를 전자 장치로 송신할 수 있다. 일 예로, 근거리 통신 방식은 블루투스, BLE(bluetooth low energy), NFC, Wi-Fi direct 중 적어도 하나를 포 함할 수 있으나, 그 종류에는 제한이 없다. 본 문서의 다양한 실시 예에 따른 안테나는 신호 또는 전력을 외부(예를 들어, 상기 전자 장치)로 송 신하거나 외부로부터 수신하는데 이용될 수 있다. 일 실시 예에 따르면, 디지털 펜은, 복수의 안테나(29 7)들을 포함할 수 있고, 이들 중에, 통신 방식에 적합한 적어도 하나의 안테나를 선택할 수 있다. 상기 선 택된 적어도 하나의 안테나를 통하여, 통신 회로는 신호 또는 전력을 외부 전자 장치와 교환할 수 있 다. 본 문서의 다양한 실시 예에 따른 트리거 회로는 적어도 하나의 버튼 또는 센서 회로를 포함할 수 있다. 일 실시 예에 따르면, 프로세서는 디지털 펜의 버튼(201a)의 입력 방식(예를 들어, 터치 또는 눌림) 또는 종류(예를 들어, EMR 버튼 또는 BLE 버튼)를 확인할 수 있다. 일 실시 예에 따르면, 트리거 회로는 버튼(201a)의 입력 신호 또는 센서를 통한 신호를 이용하여 전자 장치로 트리거 신호를 전송할 수 있 다.본 문서의 다양한 실시 예에 따른 센서는, 가속도 센서(accelerometer), 자이로 센서(gyro sensor), 및/ 또는 지자계 센서(geomagnetic sensor)를 포함할 수 있다. 가속도 센서는, 디지털 펜의 리니어한 움직임 및/또는 디지털 펜의 3축에 대한 가속도에 대한 정보를 센싱할 수 있다. 자이로 센서는, 디지털 펜 의 회전과 관련된 정보를 센싱할 수 있다. 지자계 센서는, 디지털 펜의 절대 좌표계 내에서의 향하는 방 향에 대한 정보를 센싱할 수 있다. 일 실시 예에 따르면, 센서는, 움직임을 측정하기 위한 센서뿐만 아니 라, 디지털 펜의 내부의 작동 상태 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있는 센서, 예를 들어, 배터리 잔량 감지 센서, 압력 센서, 광 센서, 온도 센서, 생체 센서 중 적어도 하나 를 포함할 수 있다. 다양한 실시예에 따라서, 프로세서는, 센서로부터 획득한 정보를, 통신 회로 를 통하여 전자 장치로 송신할 수 있다. 또는, 프로세서는, 센서로부터 획득한 정보에 기 반하여, 디지털 펜의 위치와 연관된 정보(예: 디지털 펜의 좌표 및/또는 디지털 펜의 변위)를, 통신 회로를 통하여 전자 장치로 송신할 수도 있다. 도 4는 본 문서의 다양한 실시 예에 따른 인 에어 제스처의 종류를 분류하는 동작의 일 예를 도시한 흐름도이다. 도 4를 참조하면, 410 동작에서 전자 장치는 통신 모듈을 통해 디지털 펜으로부터 전송된 센서 데이터를 획득할 수 있다. 예컨대, 상기 센서 데이터는 디지털 펜의 방향 정보(예: 모션 센서 데이터), 디 지털 펜의 버튼(201a) 선택 정보를 포함할 수 있다. 420 동작에서 전자 장치는 수신된 제스처 정보로부터 3D(three-dimensional) 제스처를 형성할 수 있다. 예 컨대, 전자 장치는 획득된 센서 데이터를 이용하여, 제스처에 대한 3차원적인 궤적을 3D 제스처로 형성할 수 있다. 421 동작에서 전자 장치는 3D 제스처의 특성 정보를 추출할 수 있다. 예컨대, 전자 장치는 상기 3D 제스처에서 깊이 정보 또는 스케일 정보 등의 특정 정보를 추출할 수 있다. 430 동작에서 전자 장치는 3D 제스처에서 유효한 2D 평면(informative two dimensional plane)을 선택할 수 있다. 예컨대, 전자 장치는 3D 제스처에서 사용자의 제스처에 대한 식별이 가능한 평면을 상기 유효한 2D 평면으로 선택할 수 있다. 440 동작에서 전자 장치는 선택된 유효한 2D 평면의 제스처를 펜 업/다운 상태 정보에 기반하여 필터링할 수 있다. 전자 장치의 프로세서는 상기 디지털 펜의 버튼(201a)이 선택되는 동안 입력된 제스처 를 펜 다운(또는 버튼(201a) 선택) 제스처로 확인할 수 있다. 전자 장치는 확인된 펜 다운 상태에서 입력 된 제스처를 필터링하고, 상기 필터링된 펜 다운 상태의 제스처를 포함하는 스트로크를 인 에어 제스처 분류 모 듈로 전달할 수 있다. 441 동작에서 전자 장치는 유효한 2D 평면의 제스처에서 2D 특성 정보를 추출할 수 있다. 예컨대, 2D 평면 의 특성 정보는 제스처의 x축 또는 y축 상의 변화량(예, x 또는 y) 또는 펜 업/다운 정보를 포함할 수 있다. 본 문서의 다양한 실시 예에 따르면, 421 동작 또는 441 동작의 수행 결과, 3D 평면 특성 정보 및 2D 평면 특성 정보가 추출되면, 450 동작에서 전자 장치는 RNN(recurrent neural network) 기반의 인 에어 제스처 분류 를 수행할 수 있다. 전자 장치의 프로세서는 인 에어 제스처 분류의 결과를 인 에어 제스처 분류 모 듈로 전달할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 추출된 3D 평면 특성 정보 및 2D 평면 특성 정보의 조합 에 기반하여, 인 에어 제스처를 분류할 수 있다. 예컨대, 전자 장치는 인 에어 제스처 분류를 위한 2D 평 면 특성 정보가 충분히 추출되지 않은 경우, 추출된 3D 평면 특성(예, 깊이 정보 또는 스케일 정보) 정보를 더 고려하여 인 에어 제스처를 분류할 수 있다. 전자 장치에서는 공중에서 입력되는 인 에어 제스처의 3D 특 성을 더 고려하여 인 에어 제스처를 분류함에 따라, 해당 인 에어 제스처의 특성에 맞는 정확한 분류가 가능할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 특정 제스처 종류에 대응하는 2D 제스처의 특성 정보 및 3D 제스처의 특성 정보와 관련된 정보를 저장할 수 있다. 예컨대, 전자 장치는 추출된 2D 제스처의 특성 정보 및 3D 제스처의 특성 정보가 특정 제스처 종류에 해당하는 특성 정보에 대응하는지를 판단하여 인 에어 제 스처를 분류할 수 있다. 460 동작에서 전자 장치의 인 에어 제스처 분류 모듈은 전달된 필터링된 스트로크 또는 인 에어 제스 처 분류의 결과를 확인하고, 인식 모듈을 선택할 수 있다. 예컨대, 상기 인식 모듈은 인 에어 제스처 분류 모듈 , 손글씨 인식 모듈, 스케치 및 두들 인식 모듈, 도형 및 다이어그램 인식 모듈 또는 공식 인식 모듈을 포함할 수 있으며, 전자 장치는 제스처 분류의 결과에 따라, 필터링된 스트로크 또는 인 에어 제스처에 대해 추출된 2D 평면 특성 정보를 선택된 인식 모듈로 전달하여 해당 인식 모듈에서 스트로크 또 는 제스처를 처리하도록 할 수 있다. 도 5는 본 문서의 다양한 실시 예에 따라, 사용자의 인 에어 제스처에서 펜 업/다운을 필터링하는 동작의 일 예 를 도시한 도면이다. 도 5를 참조하면, 전자 장치는 사용자가 디지털 펜을 이용하여 입력한 제스처 원본을 확인할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 상기 제스처 원본에서 펜 업/다운을 필터링하여, 움직임 제스처 및 유효한 제스처를 구분할 수 있다. 예컨대, 상기 움직임 제스처은 사용자가 데 이터 입력을 준비하기 위해 디지털 펜을 위 혹은 아래 방향으로 움직이는 입력일 수 있다. 상기 유효한 제 스처는 사용자가 실제 데이터를 입력하는 제스처로서, 미리 설정된 언어에 따른 단어 혹은 문장, 숫자, 도 형, 이미지의 형태를 포함할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 디지털 펜의 버튼(201a)이 눌려진 상태를 펜 다운 상태로 판단하고, 사용자의 제스처 원본 에서 상기 버튼(201a)이 눌려진 상태(예컨대, 펜 다운 상태)에서 의 제스처만을 필터링할 수 있다. 상기 펜 다운 상태(예컨대, 버튼(201a)이 눌려진 상태)에서 입력된 제스처를 유효한 제스처로 분류하고, 펜 업 상태(예컨대, 버튼(201a)이 해제된 상태)에서 입력된 제스처를 움직임 제스처 로 분류할 수 있다. 예컨대, 사용자는 사용자가 원하는 제스처 입력을 위해 버튼(201a)을 누른 상태로 제스처를 입력할 수 있으며, 전자 장치는 해당 기간에 입력된 제스처 입력에서 펜 업/다운 상태에 기반하여 움직임 제스처를 필터링하여 실제 사용자가 입력하고자 하는 제스처 입력을 유효한 제스처로 확인할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 펜 업/다운 필터링 동작의 결과로, 제스처 원본에 서 유효한 제스처에 대응하는 데이터를 선택할 수 있다. 도 6은 본 문서의 다양한 실시 예에 따라, 필터링된 제스처를 텍스트로 출력하는 동작의 일 예를 도시한 흐름도 이다. 도 6을 참조하면, 610 동작에서 전자 장치에서는 디지털 펜을 이용하여 입력된 제스처에서 펜 업/다 운 필터링된 제스처(또는, 스트로크)를 확인할 수 있다. 620 동작에서 전자 장치는 필터링된 제스처에 대한 전처리(pre-processing)를 수행할 수 있다. 621 동작에서 전자 장치는 필터링된 제스처의 특성을 추출할 수 있다. 631 동작에서 전자 장치는 필터링된 제스처에 대한 언어를 감지할 수 있다. 예컨대, 전자 장치는 외 부 데이터(예, 언어 설정 또는 위치)에 기반하여 제스처에 대한 언어를 감지할 수 있다. 640 동작에서 전자 장치는 지식 기반으로 언어를 설정할 수 있다. 예컨대, 전자 장치는 RNN 가중치를 확인하는 641 동작 및 언어 모델을 확인하는 642 동작을 수행할 수 있다. 전술된 621 동작 및 641 동작의 수행 결과, 필터링된 제스처에서 특성을 추출하고 및 RNN 가중치를 확인하면, 622 동작에서 전자 장치는 LSTM(long short term memory) RNN 알고리즘을 적용할 수 있다. 전술된 622 동작 및 642 동작의 수행 결과, LSTM RNN 알고리즘을 적용하고, 언어 모델을 확인하면, 623 동작에 서 전자 장치는 디코딩을 수행할 수 있다. 650 동작에서 전자 장치는 디코딩의 수행 결과, 인식된 텍스트를 출력할 수 있다. 예컨대, 필터링된 제스 처에서 'Hello World'에 해당하는 텍스트를 추출하여 출력할 수 있다. 도 7은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 텍스트 형태의 인 에어 제스처를 처리하는 동작의 일 예를 도시한 도면이다. 도 7을 참조하면, 전자 장치는 HMD 장치로서, 사용자가 전자 장치를 착용한 상태에서 상기 전자 장치 와 통신 연결된 디지털 펜을 이용하여 인 에어 제스처를 입력할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치에서는 VR 영상을 표시할 수 있다. 상기 VR 영상(70 0)은 사용자가 텍스트 형태의 인 에어 제스처 입력을 입력하는 제스처 입력 키보드 및 상기 입력한 텍스트 가 표시되는 제스처 표시 영역을 포함할 수 있다. 상기 제스처 입력 영역은 텍스트를 다양한 형태로 입력하여 검색할 수 있는 검색 창 및 제스처 입력 키보드의 표시를 삭제하기 위한 버튼을 포함 할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 텍스트 입력을 위해 키보드 사용이 중요한 환경에 있거 나, 텍스트 또는 도형 입력이 불편한 전자 장치(예, HMD 장치, AR/VR 장치 또는 스마트 TV)일 수 있다. 본 문서의 다양한 실시 예에 따르면, 사용자는 펜으로 글씨를 쓰듯이 원하는 텍스트를 인 에어 제스처로 입력하 고, 전자 장치에서는 입력된 인 에어 제스처에서 텍스트를 추출하여 제스처 표시 영역에 표시할 수 있다. 상기 전자 장치는 다양한 상형 문자 형태의 언어(예, 한국어, 중국어, 또는 일본어)에 따른 텍스트 를 추출할 수 있다. 다양한 실시예에 따라, 사용자는 사용자가 원하는 제스처 입력을 위해 펜의 버튼 (201a)을 누른 상태로 제스처를 입력할 수 있으며, 전자 장치는 도 5의 설명에서 상술한 바와 같이 해당 기간에 입력된 제스처 입력에서 펜 업/다운 상태에 기반하여 움직임 제스처를 필터링하여 실제 사용자가 입력하 고자 하는 제스처 입력을 유효한 제스처로 확인할 수 있다. 도 8은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 도형 형태의 인 에어 제스처를 처리하는 동작의 일 예 를 도시한 도면이다. 도 8을 참조하면, 전자 장치는 HMD 장치로서, 제1 사용자가 전자 장치를 착용하면, AR의 영상 을 표시할 수 있다. 제2 사용자는 상기 전자 장치와 통신 연결된 디지털 펜이 한 상태에서 상기 전자 장치와 통신 연결된 디지털 펜을 파지한 상태로 인 에어 제스처를 입력하는 상황일 수 있 다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 디지털 펜으로부터 입력되는 인 에어 제스처의 종 류를 '스케치'로 판단하여 상기 인 에어 제스처를 처리할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 인체의 근육, 혈관 또는 뼈 구조에 대한 이미지를 AR 화 면에 표시할 수 있다. 제2 사용자는 전자 장치를 착용하고 있는 제1 사용자에게 인체 구조 에 대한 시각적 설명을 위해, 디지털 펜으로 인 에어 제스처를 입력할 수 있다. 본 문서의 다양한 실시 예에 따르면, 제2 사용자는 디지털 펜으로 특정 구조에 대한 설명에 해당하는 스케치를 입력할 수 있다. 상기 전자 장치는 스케치 및 두들 인식 모듈을 통해 상기 스케치 입 력을 처리하고, 처리된 스케치 입력을 표시할 수 있다. 예컨대, 전자 장치는 제2 사용자의 스케치 입력에 대한 위치 및 움직임 궤적을 확인하고, 미리 설정된 표시 설정(예, 색, 펜 굵기)을 적용하 여 AR 화면에 표시할 수 있다. 다양한 실시예에 따라, 사용자는 사용자가 원하는 제스처 입력을 위해 펜 의 버튼(201a)을 누른 상태로 제스처를 입력할 수 있으며, 전자 장치는 도 5의 설명에서 상술한 바와 같이 해당 기간에 입력된 제스처 입력에서 펜 업/다운 상태에 기반하여 움직임 제스처를 필터링하여 실제 사용 자가 입력하고자 하는 제스처 입력을 유효한 제스처로 확인할 수 있다. 도 9는 본 문서의 다양한 실시 예에 따라, 전자 장치에서 인 에어 제스처를 이용하여 표시 객체를 선택하는 동 작의 일 예를 도시한 도면이다. 도 9를 참조하면, 전자 장치에서는 AR 화면이 표시될 수 있다. 상기 AR 화면에서는 집 거실을 촬영한 이미지에, 집 거실에 놓여있는 객체들에 대한 정보 및 객체들(예, 화분, 액자, 스탠드 등)을 선택 하기 위한 표시가 중첩되어 표시될 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 전자 장치와 통신 연결된 디지털 펜으로부터 입력되는 인 에어 제스처 입력의 종류를 확인하고, 상기 인 에어 제스처를 AR 화면에 표시된 객체를 선택 하기 위한 입력으로 확인할 수 있다. 예컨대, 전자 장치는 상기 인 에어 제스처의 움직임 궤적이, AR 화면 에 표시된 객체들 중 특정 객체의 모양과 대응하는 경우, 해당 객체를 선택하기 위한 입력으로 확인할 수 있다. 전자 장치에서는 특정 객체의 모양과 대응하는 인 에어 제스처 입력에 대해 해당 인 에어 제스처 입 력의 움직임 궤적(예, 921, 922 또는 923)을 표시할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 특정 객체(예, 화분)에 대한 선택 입력을 확인할 수 있 다. 예컨대, 전자 장치는 디지털 펜의 버튼(201a)이 눌렸는지에 따라, 상기 선택 입력이 입력된 것으로 확인할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 특정 객체(예, 화분)에 대한 선택 입력을 입력되면, 해 당 객체에 대한 정보를 표시할 수 있다. 예컨대, 상기 정보는 거실에 놓인 화분들(예, 'jade or money tree', 'hedge cactus' 또는 'century plant') 중 해당하는 화분에 대한 정보가 강조 표시될 수 있다. 다양한 실시예에 따라, 사용자는 사용자가 원하는 제스처 입력을 위해 펜의 버튼(201a)을 누른 상태로 제 스처를 입력할 수 있으며, 전자 장치는 도 5의 설명에서 상술한 바와 같이 해당 기간에 입력된 제스처 입 력에서 펜 업/다운 상태에 기반하여 움직임 제스처를 필터링하여 실제 사용자가 입력하고자 하는 제스처 입력을 유효한 제스처로 확인할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 디지털 펜으로부터의 인 에어 제스처 입력을 분류 하고 처리함에 따라, 사용자가 AR 화면에 표시된 객체를 편리하게 조작하도록 할 수 있다. 도 10은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 인 에어 제스처를 이용하여 표시 객체를 제어하는 동 작의 일 예를 도시한 도면이다. 도 10을 참조하면, 전자 장치에서는 AR 화면이 표시될 수 있다. 상기 AR 화면에는 전자 장치 와 통신 연결된 청소기 장치가 촬영되어 표시될 수 있다. 본 문서의 다양한 실시 예에 따르면, 청소기 장치는 전자 장치로부터의 제어 명령에 따라 동작할 수 있으며, 전자 장치는 디지털 펜을 이용한 인 에어 제스처를 입력하여 상기 청소기 장치를 제어 할 수 있다. 본 문서의 다양한 실시 예에 따르면, 사용자는 디지털 펜을 이용하여, 청소기 장치에 대한 명령에 해당하는 입력을 인 에어 제스처로 입력할 수 있다. 예컨대, 상기 사용자는 명령의 대상이 청소기 장치 임을 나타내는 화살표 및 상기 청소기 장치의 청소 기능의 수행을 명령하기 위해, 'Clean'에 해당 하는 텍스트를 입력할 수 있다. 다양한 실시예에 따라, 사용자는 사용자가 원하는 제스처 입력을 위해 펜 의 버튼(201a)을 누른 상태로 제스처를 입력할 수 있으며, 전자 장치는 도 5의 설명에서 상술한 바와 같이 해당 기간에 입력된 제스처 입력에서 펜 업/다운 상태에 기반하여 움직임 제스처를 필터링하여 실제 사용자가 입력하고자 하는 제스처 입력을 유효한 제스처로 확인할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 상기 입력으로부터 인식된 텍스트에 대응하는 명 령으로 청소기 장치의 '청소 기능'을 확인하고, 청소기 장치가 청소 기능을 수행하도록 제어할 수 있다. 본 문서의 다양한 실시 예에 따르면, 사용자는 청소기 장치에 대한 추가 명령으로 디지털 펜으로 가 상의 벽을 그려 입력할 수 있다. 전자 장치에서는 상기 가상의 벽을 상기 청소기 장치 의 청소 영역을 설정한 것으로 판단하고, 상기 청소기 장치가 상기 가상의 벽에 해당하는 영역을 청소하지 않도록 제어할 수 있다. 도 11은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 인 에어 제스처를 이용하여 3D 모델링을 수행하는 동 작의 일 예를 도시한 도면이다. 도 11을 참조하면, 전자 장치에서는 AR 화면이 표시될 수 있다. 예컨대, 상기 AR 화면에서는 무대 이미지에 3D 모델링된 의상 그래픽이 표시될 수 있다. 본 문서의 다양한 실시 예에 따르면, 사용자는 디지털 펜을 이용하여 의상 디자인을 스케치하는 인 에어 제스처를 입력할 수 있다. 전자 장치는 인 에어 제스처 분류 모듈을 통해 입력된 인 에어 제스처의 종류가 '스케치'인 것으로 판단하고, 스케치 및 두들 인식 모듈에서 상기 인 에어 제스처를 처리하도록 제 어할 수 있다. 다양한 실시예에 따라, 사용자는 사용자가 원하는 제스처 입력을 위해 펜의 버튼(201a)을 누른 상태로 제스처를 입력할 수 있으며, 전자 장치는 도 5의 설명에서 상술한 바와 같이 해당 기간에 입 력된 제스처 입력에서 펜 업/다운 상태에 기반하여 움직임 제스처를 필터링하여 실제 사용자가 입력하고자 하는 제스처 입력을 유효한 제스처로 확인할 수 있다. 본 문서의 다양한 실시 예에 따르면, 스케치 및 두들 인식 모듈에서는 '스케치'로 분류된 인 에어 제스처 를 처리할 수 있다. 예컨대, 스케치 및 두들 인식 모듈은 입력된 인 에어 제스처를 3D 모델링하여 사용자 의 스케치(예, 1110 또는 1120)가 입체적으로 표시되도록 제어할 수 있다. 본 문서의 다양한 실시 예에 따라, 전자 장치에서는 인 에어 제스처의 종류가 '스케치'로 분류됨에 따라, 스케치 및 두들 인식 모듈에서 스케치를 처리하도록 제어함에 따라, 디지털 펜을 이용하여 쉽게 3D 모델링을 수행하고, 프로토타이핑(prototyping)에 활용할 수 있다. 도 12는 본 문서의 다양한 실시 예에 따라, 인 에어 제스처를 이용하여 스마트 TV를 제어하는 동작의 일 예를 도시한 도면이다. 도 12를 참조하면, 전자 장치와 통신 연결되어 데스크톱 PC 역할을 수행하는 스마트 TV가 구비되며, 전자 장치와 통신 연결된 디지털 펜을 이용하여 상기 스마트 TV를 제어하도록 할 수 있다. 예 컨대, 전자 장치는 DeXTM 기반으로 스마트 TV와 연결될 수 있다. 본 문서의 다양한 실시 예에 따르면, 스마트 TV에서는 전자 장치를 통해 실시간으로 촬영되는 영상 을 포함하는 AR 화면이 표시될 수 있다. 예컨대, 상기 AR 화면에는, 인 에어 제스처 입력의 종류를 선택하기 위한 항목들 및 인 에어 제스처 입력 모드를 선택하기 위한 항목들들 포함할 수 있다. 상기 인 에어 제스처 입력의 종류를 선택하기 위한 항목들에는, 두들('doodle'), 스케치('sketch'), 도형 ('shape') 또는 텍스트('text')로 선택하기 위한 항목들을 포함할 수 있다. 상기 인 에어 제스처 입력 모드를 선택하기 위한 항목들은, AR 화면에 표시된 항목을 선택하기 위한 항목 선택 모드 또 는 인 에어 제스처의 움직임 궤적을 표시하기 위한 제스처 표시 모드를 선택하기 위한 항목들을 포함할 수 있다. 본 문서의 다양한 실시 예에 따르면, 사용자는 항목 선택 모드가 선택된 상태에서, 디지털 펜으로 스케치 항목을 가리킬 수 있다. 전자 장치는 상기 스케치 항목을 가리킨 채로 일정 시간 유지 되는 경우, 인 에어 제스처 입력의 종류를 '스케치'로 확인할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 버튼(201a)이 눌려진 상태로 입력되는 인 에어 제스처를 유효한 제스처로 확인하고, 상기 확인된 인 에어 제스처의 움직임 궤적을 상기 AR 화면 상에 표시할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 전자 장치와 통신 연결된 다양한 전자 장치들을 제 어하기 위해, 인 에어 제스처의 입력을 확인하면, 상기 인 에어 제스처의 종류를 확인하고 확인된 종류에 따라 인 에어 제스처를 처리할 수 있다. 도 13은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 사용자의 인 에어 제스처를 종류에 따라 처리하는 동 작의 일 예를 도시한 도면이다. 도 13을 참조하면, 전자 장치는 통신 연결된 디지털 펜을 통한 인 에어 제스처의 입력을 확인 할 수 있다. 사용자가 입력한 인 에어 제스처는 'ⓜ ⓔ'에 해당하는 기호 및 'E=mc2'에 해당하는 수학 공식를 포함할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 텍스트 및 수학 공식를 인 에어 제스처의 종류에 따라 처리할 수 있다. 예컨대, 전자 장치는 상기 기호는 '도형'로 분류하여 도형 및 다이어 그램 인식 모듈에서 처리하도록 제어하고, 상기 수학 공식는 '공식'으로 분류하여 공식 인식 모듈 에서 처리하도록 제어할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 입력된 인 에어 제스처의 처리 결과를 화면 에 표시할 수 있다. 예컨대, 도형 및 다이어그램 인식 모듈은 상기 기호에 대응하는 도형, 모 양 또는 기호를 확인하고, 전자 장치에서 처리 가능한 문자로 출력할 수 있다. 공식 인식 모듈(35 0)은 상기 수학 공식를 구성하는 문자 또는 수학 연산자를 확인하고, 전자 장치에서 처리 가능한 공 식의 형태로 출력할 수 있다. 다양한 실시예에 따라, 사용자는 사용자가 원하는 제스처 입력을 위해 펜 의 버튼(201a)을 누른 상태로 제스처를 입력할 수 있으며, 전자 장치는 도 5의 설명에서 상술한 바와 같이 해당 기간에 입력된 제스처 입력에서 펜 업/다운 상태에 기반하여 움직임 제스처를 필터링하여 실제 사용 자가 입력하고자 하는 제스처 입력을 유효한 제스처로 확인할 수 있다. 본 문서의 다양한 실시 예에 따르면, 전자 장치는 다양한 형태로 입력된 인 에어 제스처에 대해, 각 제스 처의 종류에 따라 구분하여 처리함에 따라, 사용자의 의도에 따라 해당 제스처에 대한 동작을 수행하도록 할 수 있다. 도 14는 본 문서의 다양한 실시 예에 따른, 전자 장치에서 인 에어 제스처를 처리하는 동작의 일 예를 도시한 흐름도이다. 도 14를 참조하면, 1410 동작에서 전자 장치는 상기 전자 장치의 통신 모듈을 통해 연결된 디지털 펜으로부터 인 에어 제스처(in-air gesture) 및 버튼 선택 정보를 수신할 수 있다. 상기 버튼 선택 정보는, 상기 디지털 펜 의 버튼의 선택 및 해제 시점을 포함할 수 있다. 본 문서의 다양한 실시 예에 따른 전자 장치에서 인 에어 제스처를 처리하는 방법은, 근거리 통신 연결을 통해 상기 디지털 펜과 연결하는 동작 및 상기 근거리 통신을 통해 상기 디지털 펜으로부터 상기 인 에어 제스처 및 상기 버튼 선택 정보를 수신하는 동작을 더 포함할 수 있다. 1420 동작에서 전자 장치는 상기 수신된 인 에어 제스처 및 버튼 선택 정보에 기반하여 제스처 종류를 판단할 수 있다. 예컨대, 상기 제스처 입력의 종류는, 손글씨, 스케치, 도형, 다이어 그램 또는 공식을 포함할 수 있다. 1430 동작에서 전자 장치는 상기 판단한 제스처 종류에 따라 상기 인 에어 제스처를 인식할 수 있다. 예컨대, 전자 장치의 다양한 출력 장치(예, 디스플레이 모듈)을 통해 인식된 인 에어 제스처를 출력할 수 있다. 본 문서의 다양한 실시 예에 따른 전자 장치에서 인 에어 제스처를 처리하는 방법은, 상기 수신된 인 에어 제스 처에서 상기 선택 및 해제 시점에 대응하여 입력된 제스처를 인식하는 동작과 상기 제스처 입력의 종류가 상기 손글씨인 경우, 상기 선택 및 해제 시점에 대응하는 제스처에 기반으로 텍스트 데이터를 출력하는 동작을 더 포 함할 수 있다. 본 문서의 다양한 실시 예에 따른 전자 장치에서 인 에어 제스처를 처리하는 방법은, 상기 디지털 펜으로부터, 상기 디지털 펜의 가속도 센서 또는 자이로 센서를 통해 감지된 센서 데이터를 수신하는 동작 및 상기 수신된 센서 데이터에 기반하여 상기 인 에어 제스처를 인식하는 동작을 더 포함할 수 있다. 본 문서의 다양한 실시 예에 따른 전자 장치에서 인 에어 제스처를 처리하는 방법은, 상기 수신된 인 에어 제스 처는 적어도 두 개의 제스처 종류들에 따라 입력되는 적어도 두 개의 제스처들을 포함하며, 상기 적어도 두 개 의 제스처들 각각을 해당하는 제스처 종류에 기반하여 처리하는 동작 및 상기 제스처 종류에 따라 처리된 상기 적어도 두 개의 제스처들이 표시 동작을 더 포함하는, 전자 장치에서의 인 에어 제스처 처리 방법. 도 15는 본 문서의 다양한 실시 예에 따른 디지털 펜의 전자 장치 탈거 시의 디지털 펜 및 전자 장치의 동작을 설명하기 위한 흐름도이다. 도 15를 참고하면, 1521 동작에서, 디지털 펜은, 전자 장치의 수납 공간으로부터 탈거될 수 있다. 예를 들어, 사용자는, 전자 장치의 수납 공간으로부터 디지털 펜을 꺼낼 수 있다. 1523 동작에서, 전자 장치는, 디지털 펜의 탈거를 감지할 수 있다. 예를 들어, 전자 장치는, 디지털 펜으로부터의 신호 미수신에 기반하여 디지털 펜의 탈거를 감지할 수 있으나, 탈거 감지 방법 에는 제한이 없다. 1525 동작에서, 디지털 펜은, 디지털 펜의 탈거를 감지할 수 있다. 예를 들어, 디지털 펜은, 전자 장치로부터의 신호 미수신에 기반하여 디지털 펜의 탈거를 감지할 수 있으나, 탈거 감지 방법에 는 제한이 없다. 탈거가 감지된 경우, 디지털 펜은 전자 장치와 파라미터(예: 연결 인터벌 (connection interval) 및/또는 슬레이브 레이튼시(slave latency))를 교환할 수도 있다. 다양한 실시예에 따라서, 디지털 펜은, 1527 동작에서, 탈거 감지에 기반하여, 가속도 센서를 활성화할 수 있다. 디지털 펜은, 활성화한 가속도 센서를 통하여, 1529 동작에서, 디지털 펜의 가속도 정보를 센싱할 수 있다. 도시되지는 않았지만, 디지털 펜은, 센싱된 가속도 정보를 전자 장치로 송신할 수도 있다. 다양한 실시예에서, 전자 장치는, 수신한 가속도 정보에 기반하는 동작을 수행할 수 있다. 다양한 실시예 에서, 디지털 펜은, 가속도 센서를 활성화하고, 상대적으로 높은 전력을 소모하는 자이로 센서는, 비활성 화 상태를 유지하도록 설정될 수도 있다. 다양한 실시예에 따라서, 디지털 펜은, 1531 동작에서, 버튼(예: 버튼)의 입력을 확인할 수 있다. 버튼은, 물리 키, 터치 키, 모션 키, 압력 키, 키 리스(key less)의 방식 중 어느 하나로 구현될 수 있으며, 구현 형태에는 제한이 없다. 버튼 입력이 확인되면, 디지털 펜은, 1533 동작에서, 자이로 센서를 활성화할 수 있다. 디지털 펜은 활성화한 자이로 센서를 통하여, 1535 동작에서, 회전 정보를 센싱할 수 있다. 1537 동작에서, 디지털 펜은, 센싱 결과에 기반한 정보를 송신할 수 있다. 예를 들어, 디지털 펜은, 가속도 센서 및 자이로 센서를 통하여 획득한 센싱 정보를, 전자 장치로 송신할 수 있다. 또는, 디지털 펜은, 가속도 센서 및 자이로 센서를 통하여 획득한 센싱 정보에 기반하여, 디지털 펜의 좌표(예: 2 차원 좌표, 또는 3차원 좌표)를 확인할 수 있으며, 확인된 좌표를 전자 장치로 송신할 수 있다. 또는, 디 지털 펜은, 가속도 센서 및 자이로 센서를 통하여 획득한 센싱 정보에 기반하여, 디지털 펜의 좌표 (예: 2차원 좌표, 또는 3차원 좌표)의 변위 정보를 확인할 수 있으며, 확인된 변위 정보를 전자 장치로 송 신할 수 있다. 1539 동작에서, 전자 장치는, 수신한 정보에 기반하여 동작을 수행할 수 있다. 전자 장치는, 센싱 정보를 수신한 경우에는, 센싱 정보에 기반한 디지털 펜의 위치 정보를 확인하고, 위치 정보에 대응하는 제스처를 확인하고, 제스처에 대응하는 동작을 수행할 수 있다. 전자 장치는, 디지털 펜의 위치 정 보를 수신한 경우에는, 위치 정보에 대응하는 제스처를 확인하고, 제스처에 대응하는 동작을 수행할 수 있다. 예를 들어, 디지털 펜은, 펜 버튼의 입력이 해제될 때까지 정보를 전자 장치로 송신할 수 있다. 전 자 장치는, 버튼의 입력 해제가 검출되기 전까지 확인된 디지털 펜의 위치 정보에 기반하여, 제스처 를 확인할 수 있다. 버튼의 입력 해제가 검출되면, 디지털 펜은 자이로 센서를 다시 비활성화시킬 수도 있다. 다만, 다양한 실시예에서, 디지털 펜은, 탈거 감지시부터 자이로 센서 및 가속도 센서를 모두 활성 화시킬 수도 있다. 이 경우, 버튼 입력 이전의 디지털 펜의 위치 정보는, 제스처 방향에 대한 보정에 이 용될 수 있으며, 제스처 인식 정확도가 향상될 수 있다. 예를 들어, 전자 장치는, 디지털 펜의 초기 자세 정보를 확인하고, 이를 기준으로 한 변위를 이용하여 제스처를 인식할 수도 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2a 도면2b 도면2c 도면2d 도면2e 도면3a 도면3b 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15"}
{"patent_id": "10-2020-0114005", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 문서의 다양한 실시 예에 따른 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2a는 본 문서의 다양한 실시 예에 따라, 전자 장치로 인 에어 제스처가 입력되는 상황의 일 예를 도시한 도 면이다. 도 2b는 본 문서의 다양한 실시 예에 따라, 전자 장치로 인 에어 제스처가 입력되는 상황의 일 예를 도시한 도 면이다. 도 2c는 본 문서의 다양한 실시 예에 따라, 전자 장치로 인 에어 제스처가 입력되는 상황의 일 예를 도시한 도면이다. 도 2d는 본 문서의 다양한 실시 예에 따라, 전자 장치로 인 에어 제스처가 입력되는 상황의 일 예를 도시한 도 면이다. 도 2e는 본 문서의 다양한 실시 예에 따라, 전자 장치로 인 에어 제스처가 입력되는 상황의 일 예를 도시한 도 면이다. 도 3a는 본 문서의 다양한 실시 예에 따른 전자 장치 및 디지털 펜 구성의 일 예를 도시한 블록도이다. 도 3b는 본 문서의 다양한 실시 예에 따른 인 에어 제스처의 입력 및 출력의 다양한 예들을 도시한 도면이다. 도 4는 본 문서의 다양한 실시 예에 따른 인 에어 제스처의 종류를 분류하는 동작의 일 예를 도시한 흐름도이다. 도 5는 본 문서의 다양한 실시 예에 따라, 사용자의 인 에어 제스처에서 펜 업/다운을 필터링하는 동작의 일 예 를 도시한 도면이다. 도 6은 본 문서의 다양한 실시 예에 따라, 필터링된 제스처를 텍스트로 출력하는 동작의 일 예를 도시한 흐름도 이다. 도 7은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 텍스트 형태의 인 에어 제스처를 처리하는 동작의 일 예를 도시한 도면이다. 도 8은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 도형 형태의 인 에어 제스처를 처리하는 동작의 일 예 를 도시한 도면이다. 도 9는 본 문서의 다양한 실시 예에 따라, 전자 장치에서 인 에어 제스처를 이용하여 표시 객체를 선택하는 동 작의 일 예를 도시한 도면이다. 도 10은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 인 에어 제스처를 이용하여 표시 객체를 제어하는 동 작의 일 예를 도시한 도면이다. 도 11은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 인 에어 제스처를 이용하여 3D 모델링을 수행하는 동 작의 일 예를 도시한 도면이다. 도 12는 본 문서의 다양한 실시 예에 따라, 인 에어 제스처를 이용하여 스마트 TV를 제어하는 동작의 일 예를 도시한 도면이다. 도 13은 본 문서의 다양한 실시 예에 따라, 전자 장치에서 사용자의 인 에어 제스처를 종류에 따라 처리하는 동 작의 일 예를 도시한 도면이다. 도 14는 본 문서의 다양한 실시 예에 따른, 전자 장치에서 인 에어 제스처를 처리하는 동작의 일 예를 도시한 흐름도이다. 도 15는 본 문서의 다양한 실시 예에 따라, 전자 장치와 디지털 펜 간의 인 에어 제스처를 처리하는 동작의 일 예를 도시한 흐름도이다."}
