{"patent_id": "20-2006-0031950", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "20-2008-0002027", "출원번호": "20-2006-0031950", "출원인": "한상수"}}
{"patent_id": "20-2006-0031950", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공피부에 미세한 버블로 구성하여 버블 안에 각각의 센서 4개를 배치하여 종래의 사례보다 힘의 존재의 감지정도와 압력이 가해지는 압력이 가해지는 방향까지 감지하는 로봇 손."}
{"patent_id": "20-2006-0031950", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서센서 4개보다 많은 센서를 배치하여 원을 구성, 더욱더 섬세한 행동을 할 수 있는 로봇 손.명 세 서고안의 상세한 설명 고안의 목적 고안이 속하는 기술 및 그 분야의 종래기술휴머노이드 로봇은 로봇이라는 커다란 범위에 일부이며 기본적으로 명령을 받고 움직이는 기계이다. <7>음성신호, 전기신호, 혹은 프로그램 등으로 명령을 주는데, 사람의 명령으로 또는 자가 인식으로 인해 필요한부분을 움직이기 위한 신호로 바꿔준다. <8> <9> 로봇이 명령을 받았을 때 기본 작동원리에 관한 Flow Chart <10> <11> 휴머노이드 로봇은 5가지 핵심 기술을 갖고 있는데 그것은 상호작용, 운동성, 네비게이션, 조정, 지능이 그 <12>것이다. 특히 정체불명의 물체를 깨거나 떨어트리는 일 없이 잡을 수 있는 능력인 자동조종은 이 휴머노이드로봇 분야에서 점점 중요해지는 분야이다. 우리는 인간을 닮은 로봇이 진공청소기를 밀고, 식기세척기에 그릇을 넣고 빼고, 문을 열고, 그리고 칼을 사 <13>용하여 마늘과 대파를 다져주기를 원한다. 이 모든 것을 해내려면 손이 필요한 것이다. 그런데 종래기술은 아직까지 피부와 같은 부드러움이 부족해 인간형 로봇의 손가락 같은 기관에 적용하기에는 <14>다소 무리가 있다. 또한 아직 표면에 수직 방향으로 작용하는 힘밖에 감지하지 못하기 때문에 자유로운 방향성을 이루지는 못했다. 고안이 이루고자 하는 기술적 과제따라서 본 고안은 이상에서 언급한 종래 로봇 손의 한계점을 감안하여 안출한 것으로, 본 고안의 목적은 로봇의 <15>손가락과 손바닥이 손에 가해지는 힘의 존재와 그 정도를 감지할 뿐만 아니라, 압력이 가해지는 방향까지 감지- 2 -공개실용신안 20-2008-0002027하여 정체불명의 물체를 쉽게 다룰 수 있게 한다. 고안의 구성 및 작용 본 고안은 로봇이 물체를 집거나 놓을 때 힘의 존재를 감지하며, 압력의 방향성도 감지하도록 미세한 실리콘 <16>버블(8)을 결합하여 안의 각각의 개별 센서(1,2,3,4)를 장착한 것이다. 물체가 각각의 미세한 실리콘 버블에 밀착 되었을 때 압력 센서 A(1), 압력 센서 B(2), 압력 센서 C(3), 압력 <17>센서 D(4)에 압력이 가해진다. 실리콘 버블(9) 안쪽 벽 위에 붙은 전극(7)은 전극 받침대(6) 고정 되어있으며압력으로 인해 전극(7)이 아래로 내려가 균등하게 네 군데의 센서에 닿게 되면 회로기판(5)에서 그것을 인지하여 작동이 된다. 그렇지만 가정 하에 네 군데의 센서를 전부 닿지 않고 오직 오른쪽에 배치된 압력 센서 A(1), 압력 센서 B(3) <18>에만 압력이 가해져 전극(7)이 닿는다면 회로기판(5)이 이것을 감지하여 나머지 압력 센서 B(2), 압력 센서D(4)에 운동성을 주어 실리콘 버블(9)의 왼쪽에 힘을 더 가하게 해준다. 고안의 효과그런데 종래기술은 아직까지 피부와 같은 부드러움이 부족해 인간형 로봇의 손가락 같은 기관에 적용하기에는 <19>다소 무리가 있다. 그렇지만 이 인공피부 압력센서는 힘의 존재와 그 정도를 감지하며 종래에는 수직적인 힘밖에 감지를 하지 못했던 조정기술을 수평적인 힘 까지 감지하도록 고안하여 휴머노이드 로봇이 더욱더 인간에가깝게 개발이 가능 하게 되었다. 이상에서 본 발명은 기재된 구체적인 실시예에 대해서만 상세히 설명하였지만 본 발명의 기술사상 범위 내에서 <20>다양한 변형 및 수정이 가능함은 당업자에게 있어서 명백한 것이며, 이러한 변형 및 수정이 첨부된 특허청구범위에 속함은 당연한 것이다.도면의 간단한 설명제1도면 : 본 발명에 의한 인공피부 압력센서의 단면도 <1>- 도면의 주요부분에 대한 부호의 설명 - <2>1: 압력센서A 2: 압력센서B <3>3: 압력센서C 4: 압력센서D <4>5: 회로기판 6: 전극 받침대 <5>7: 전극 8: 실리콘 버블 <6>도면 도면1- 3 -공개실용신안 20-2008-0002027"}
{"patent_id": "20-2006-0031950", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 고안은 로봇의 손이 물체를 잡을 때 물체가 손가락으로부터 미끄러지는 것을 감지해 내고 이를 멈추도록 반응 할 수 있도록 하는 것이다. 본 고안은 로봇의 손, 합성고무 재질의 피부, 촉감을 감지하는 센서와 피부와 촉감을 연결 시켜 주는 전극으로 구성한다."}
