{"patent_id": "10-2019-0152152", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0063706", "출원번호": "10-2019-0152152", "발명의 명칭": "지능형 임베디드 시스템을 위한 저전력 실시간 스케줄링 방법", "출원인": "류수현", "발명자": "류수현"}}
{"patent_id": "10-2019-0152152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "경성 태스크로 이루어진 태스크셋에 대해 DRAM과 비휘발성 차세대 메모리를 함께 사용하여, 메모리의 전력 소모를 줄이는 방법(이하 HM: Hybrid Memory)과 프로세서의 전압을 동적으로 조절하여 프로세서의 전력 소모를 낮추는 방법(이하 DVFS: Dynamic Voltage Frequency Scaling) 방법, 태스크셋의 태스크에 대해 할당될 하드웨어 자원을 미리 지정하는 ‘태스크 최적화’ 방식을 이용하여 전력 절감 효과를 보이는 실시간 스케줄링 방법."}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "[제목] 지능형 임베디드 시스템을 위한 저전력 실시간 스케줄링 방법 ["}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "/해결과제] 본 발명에서는 DVFS, HM, 태스크 최적화 방식을 함께 적용하여 메모리와 프로세서의 전력 소모를 줄일 수 있는 스케줄링 방법에 관한 것이다. [해결수단] 본 발명에서는 경성 태스크에 대해 DRAM과 비휘발성 차세대 메모리를 함께 사용하여, 메모리의 전력 소모를 줄이 는 방법(이하 HM: Hybrid Memory)과 프로세서의 전압을 동적으로 조절하여 프로세서의 전력 소모를 낮추는 방법 (이하 DVFS: Dynamic Voltage Frequency Scaling)을 결합하여 시스템의 전력 절감 효과를 최대화하는 실시간 스 케줄링 방법을 제안한다. 또한, 태스크셋의 태스크에 대해 할당될 하드웨어 자원을 미리 지정하는 방식을 이용하 여 전력 절감 효과를 가속한다. [기대효과] 본 발명은 전력 절감 효과가 있는 스케줄링 방법을 통해 한정된 배터리를 전력 공급원으로 사용하는 지능형 임베 디드 시스템 구축을 위한 기반을 마련한다. [대표도]"}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2021-0063706 CPC특허분류 G06F 1/3275 (2013.01) G06F 1/3293 (2019.01)명 세 서 청구범위 청구항 1 경성 태스크로 이루어진 태스크셋에 대해 DRAM과 비휘발성 차세대 메모리를 함께 사용하여, 메모리의 전력 소모 를 줄이는 방법(이하 HM: Hybrid Memory)과 프로세서의 전압을 동적으로 조절하여 프로세서의 전력 소모를 낮추 는 방법(이하 DVFS: Dynamic Voltage Frequency Scaling) 방법, 태스크셋의 태스크에 대해 할당될 하드웨어 자 원을 미리 지정하는 ‘태스크 최적화’ 방식을 이용하여 전력 절감 효과를 보이는 실시간 스케줄링 방법. 발명의 설명 기 술 분 야 본 발명은 멀티코어 환경에서의 실시간 스케줄링 방법으로서, 보다 구체적으로는 DVFS(Dynamic Voltage/Frequency Scaling) 방법과 HM(Hybrid Memory), 태스크에 할당될 하드웨어 자원을 미리 지정하는 '태 스크 최적화' 방법을 통하여 메모리와 프로세서의 전력 소모를 줄일 수 있는 스케줄링 방법에 관한 것이다."}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 IT 기술은 마이크로프로세서의 저가, 소형화, 고성능화에 따라 제품 경쟁력의 핵심이 H/W 생산 기술에서 S/W 최적화 기술로 이동하는 대변혁이 진행 중에 있다. 이러한 마이크로프로세서를 이용해 다양한 분야에서 5G 통신, 발전된 인공지능(AI)을 비롯한 고성능 개발을 진행하고 있다. 예를 들어, 모바일 기기나 가전 등의 사물 에 통신기능과 센서를 내장하여 연결하는 기술인 사물인터넷(IoT) 에서도 5G와 인공지능 기술 등을 도입하여 보 다 빠른 지능형 시스템을 만드는 연구가 진행중이다. 또한, 스마트 자동차와 같은 임베디드시스템에도 인공지능, 5G, 다수의 카메라, 멀티 디스플레이, 초음파 센서 등의 기술을 이용하여 사용자에게 보다 발전된 서 비스를 제공하는 연구를 진행 중이다. 이러한 시스템들은 주어진 시간 내에 특정한 일을 수행해야 하는 일종의 “실시간 임베디드 시스템”으로, 용량 이 한정된 배터리를 전력 공급의 수단으로 사용한다는 특징이 있다. 그러나, 새롭게 적용되고 있는 위의 기술들 은 비교적 복잡하고 용량이 큰 연산을 필요로 한다. 따라서, 이러한 실시간 임베디드 시스템 환경에서 전력을 절감할 수 있는 기술의 중요성이 커지고 있다. 스마트폰과 같은 모바일 기기에서 메모리는 총 전력소모 중 48%을 차지하는 중요한 전력 소비원이다. 특히 더 많은 응용 프로그램을 수용 할 수 있는 DRAM으로 인해 메모리의 전력 소모는 급격히 증가했다. 이러한 전력소모 의 원인은 DRAM의 전력재공급(refresh) 연산 때문이다. DRAM은 휘발성 매체이므로, 읽기(read), 쓰기(write) 작 업이 수행되지 않는 유휴상태(idle)에서도 저장 데이터를 유지하기 지속적인 전력재공급 연산이 필요하며 이는 많은 에너지 소모를 야기한다. 이러한 DRAM의 전력소모를 줄이기 위한 시도로 비 휘발성 저전력 메모리 (LPM)기술이 대두되었다.PC-RAM (위상 변화 랜덤 액세스 메모리) 및 STT-MRAM (스핀 전송 토크 자기 랜덤 액세스 메모리) 등의 LPM은 전력재공급 연산 없이 데이터의 유지가 가능하므로 메모리의 전력소모를 크게 줄일 수 있다. 즉, LPM은 유휴시간에 전력 소모를 전혀 하지 않는다. 그러나, LPM의 읽기/ 쓰기를 위한 접근 시간이 DRAM의 접근시간보다 느리기 떄문에, LPM을 DRAM로 전부 교체하는 것은 불가능하다. 따라서 LPM과 DRAM을 함께 사용하여, DRAM의 전력 재공급연산으로 인한 전력 소모량과, LPM의 접근시간 지연을 절충 할 수 있다. LPM은 저전압 / 주파수 모드에서 실행되는 경우, 실시 간 태스크의 deadline을 위반하지 않을 수 있다. 프로세서의 연산능력의 발전으로 프로세서의 전압 및 주파수 조절 기법(DVFS)이 태스크 스케줄링에 활용되고 있 다. CMOS 회로 기술에 기반한 DVFS 기법은 태스크 부하에 따라 공급 전압과 주파수를 동적으로 변경한다. 이 기 법은 프로세서에 공급 전압을 낮출 경우, 수행 양은 그에 비례하여 감소하지만, 전력 소모량은 제곱에 비례하는 만큼 대폭 절감할 수 있다. 처리할 작업량이 프로세서의 처리 용량에 크게 못미치는 상황에서는 프로세서의 공 급 전압을 낮추어전력 소모를 줄이더라도 태스크의 데드라인을 보장할 수 있다. 따라서 DVFS를 이용해 프로세서"}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "의 연산 속도를 조정하여 실시간 태스크 스케줄링을 하는 경우, 더욱 더 유연하게 에너지를 절감 할 수 있다.발명의 내용"}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "한정된 배터리를 전력 공급원으로 사용하는 지능형 임베디드 시스템에게 새로운 저전력 스케줄링 방식을 제안하 여 더 긴 배터리 타임을 보장할 수 있도록 한다."}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에서는 CMOS 회로 기술을 기반으로 전력 절감을 위해 CPU의 전압과 주파수를 동적으로 조절하는 DVFS(Dynamic Voltage Frequency Scaling) 방법을 이용한다. 이를 통해 태스크들이 데드라인을 만족하는 범위 에서 적절한 전압 및 주파수로 실행될 수 있도록 해서 전력을 절감한다. 두 번째로, 본 발명에서는 전력 절감을 위해 기존의 DRAM과 비휘발성 차세대 메모리를 혼합하여 사용하는 모드 를 지원한다. 데이터를 유지하기 위해 지속적인 전력 재공급 과정이 필요한 DRAM의 작업 일부를 비휘발성 차세 대 메모리에서 실행함으로써 시스템의 전력 소모를 줄일 수 있다. 세 번째로, 본 발명에서는 전력 절감을 위해 태스크 최적화 방안을 이용한다. 이는 태스크에 할당할 하드웨어 자원을 스케줄링 전 미리 지정하여 전력 소모량을 감소시키는 기술이다. 본 발명에서는 이에 유전 알고리즘을 적용하고자 한다."}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 방법에 따르면 DVFS 방법, HM 방법, 태스크 최적화 방법을 복합적으로 이용하여 태스크의 데드라인을 어기지 않는 범위에서 시스템이 소모하는 전력을 크게 감소시킬 수 있다."}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "첫 번째로, 본 발명에서 이용하는 DVFS(Dynamic Voltage/Frequency Scaling) 방법에 대한 설명이다. 이는 CMOS 회로 기술에 기반한 방법으로 [그림 1]과 같은 식에 의해 프로세서에 공급되는 전압을 낮출 경우 처리량이 저하 되지만, 전력 소모량이 그 제곱에 비례하는 만큼 크게 절약할 수 있다는 점에서 고안되었다. 즉, 처리할 작업량 이 프로세서의 처리 용량에 크게 못미치는 상황에서는 프로세서의 공급 전압을 낮추어 전력 소모를 줄이면서도 데드라인 안에 수행할 수 있도록 한다. 두 번째로, 본 발명에서 이용하는 차세대 메모리에 대한 설명이다. 기존 많은 시스템에서 사용되는 DRAM은 휘발 성 매체이기 때문에 읽기 및 쓰기 작업이 수행되지 않는 유휴상태에서도 데이터를 유지하기 위한 전력재공급 연 산이 주기적으로 수행되어야 한다. 반면에 PC-RAM(위상 변화 랜덤 액세스 메모리) 및 STT-MRAM(스핀 전송 토크 자기 랜덤 액세스 메모리) 등으로 대표되는 비휘발성 메모리(이하 LPM)는 이러한 전력재공급 연산 없이 데이터 의 유지가 가능하므로 메모리의 전력 소모를 줄일 수 있다. 그러나 이러한 LPM은 DRAM에 비해 접근시간을 더 많 이 필요로 하기 때문에, 본 발명에서는 LPM과 DRAM을 함께 사용하는 HM(Hybrid Memory) 방식을 통해 태스크의 데드라인을 어기지 않는 범위 내에서 전력 소모를 줄인다. 마지막으로, 태스크셋의 각 태스크에 할당될 하드웨어 자원을 미리 지정하는 '태스크 최적화' 방안에 대한 설명 이다. 본 발명에서는 메타 휴리스틱 알고리즘의 일종인 유전 알고리즘을 이용하여 태스크를 수행할 프로세서의 전압/주파수 조합과 메모리 종류를 미리 결정한다. 따라서, 입력인 태스크가 n개 일 때, 각각의 한 원소가 순서 대로 각 태스크에 지정된 메모리의 종류와 전압/주파수 모드를 나타내는 숫자를 가진 길이 n의 염색체 2개로 인 코딩 한다. 솔루션 선택의 기준이 되는 비용함수에는 전력 소모량과 스케줄 가능 여부에 따른 패널티가 반영되 어 계산되며, Roulette Wheel Selction 방식을 이용하여 솔루션을 선택한다. 이후에는 crossover, mutation 등 을 통해 염색체를 진화시켜 최적 근사 솔루션을 구한다."}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "[그림 1] 프로세서의 전력 계산 식 다음으로, 본 발명에서는 할당된 하드웨어 자원을 바탕으로 태스크의 최악수행시간을 결정하고 이를 이용해 태 스크의 스케줄 가능여부를 판단하여 스케줄링에 이용한다. 태스크의 최악수행시간은 태스크가 수행될 CPU voltage/frequency 모드와 메모리의 종류에 따라서 결정된다. (예를 들어, 낮은 voltage/frequency 모드에서수행된다면 수행시간은 늘어나겠지만, 전력 소모량은 [그림 1]의 식에 따라 voltage의 제곱으로 감소하기 때문 에 총 전력 소모량은 줄어든다.) 또한 이 과정에서 CPU의 voltage/frequency를 낮춰 늘어나는 수행시간과 비휘 발성 메모리에서 수행되어 늘어나는 수행시간은 overlap 되는 부분이 있다. 따라서, 최악수행시간(ti, wcet)는 태스크가 수행될 CPU voltage/frequency 모드와 메모리의 종류 중에서 더 느린 요소에 의해 결정된다고 할 수 있다. 따라서 DVFS 및 LPM을 고려하여 최악수행시간(ti)를 스케일링하는 함수 f를 적용한다. 또한, 실시간 태스크의 스케줄링 알고리즘 중 가장 데드라인이 가까운 태스크를 가장 먼저 스케줄링 하는 EDF(earliest deadline first)가 최적으로 알려져 있는데, 이 때 EDF로 스케줄링이 가능하지 않으면 다른 어떠 한 알고리즘으로도 스케줄링이 불가능하다는 점을 이용하여 스케줄링 가능 여부를 판단한다. 결론적으로, 모든 태스크들이 데드라인을 지키면서 실행이 되기 위해서는 프로세서의 이용률 U가 적어도 [그 림 2] 조건을 만족해야 한다."}
{"patent_id": "10-2019-0152152", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[그림 2] 태스크셋의 스케줄링 가능 여부 판단식 글로 위 식을 조금 더 서술하자면, n은 task의 개수, m은 코어의 개수, pii는 i번째 task의 주기이고, ti는 i번 째 task가 일반적으로(DRAM에서 DVFS를 적용하지 않았을 때) 수행될 때의 최악수행시간이다. f(ti)는 DVFS와 HM 을 적용해서 새롭게 정의한 최악수행시간이라고 할 수 있으며, 모든 태스크의 (결정된 최악수행시간)/(주기)의 합이 코어의 개수를 초과하면 스케줄링이 불가능하다. 본 발명에서는 위 방식을 바탕으로 태스크셋의 스케줄링이 가능한 범위 내에서 각 태스크에 최대한 전력 소모가 낮은 프로세서 voltage/frequency 모드와 메모리를 할당함으로써 전력 소모를 최소화 한다."}
