{"patent_id": "10-2021-0178916", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0090430", "출원번호": "10-2021-0178916", "발명의 명칭": "사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템 및 방법", "출원인": "주식회사 휴마트컴퍼니", "발명자": "김동현"}}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 정신 관련 데이터를 수집하는 정신데이터수집부;상기 정신데이터수집부에 수집된 데이터를 기반으로 상기 사용자의 정신건강 상태를 분류하는 정신상태분류부;사용자의 정신건강 상태에 따른 디지털 치료 정보탭이 테깅되는 서비스를 제공하는 치료관련테깅부;를 포함하는것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 정신데이터수집부는,사용자 가족관계 데이터 및 사용자 개인정보입력 데이터, 사용자-심리테스트 결과데이터, 사용자 치료경험, 병원 기록 데이터, 병원 약물 검색 및 리뷰 데이터를 수집하는 사용자입력데이터수집부;사용자와 전문 심리상담사간의 의사소통 음성 및 텍스트 내용 및 상기 전문 심리상담사의 상담 내용 요약 정보데이터를 수집하는 심리상담데이터수집부;사용자와 AI챗봇 의사소통에 따른 사용자 대화 용어 및 문장 데이터를 실시간으로 수집하는 AI챗봇소통데이터수집부;를 포함하는 것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 정신상태분류부는,상기 정신데이터수집부에 수집된 데이터를 기반으로 사용자의 정신건강 상태를 분석하는 정신상태분석부; 8감정 주요호소문제 분류 AI알고리즘을 기반으로, 상기 사용자의 정신건강 상태를 분노, 좌절, 행복, 사랑, 슬픔, 공포, 수치, 연민의 8가지 감정 상태별로 분류하는 8감정분류부;를 포함하는 것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 8감정분류부는,상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로 상기 정신상태분석부에서 도출된 데이터를 수치 변환하여상기 8가지 감정 상태별로 분류하는 수치분류부;위기 수준 분류 AI알고리즘을 통해 상기 수치분류부에서 분류된 상기 8가지 감정 상태가 위험 수치 범위에 들어온 것을 선별하는 위험감정분류부;를 포함하는 것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 수치분류부는,상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로,상기 정신상태분석부에서 도출된 데이터가 분노의 감정 상태이면 0;공개특허 10-2023-0090430-3-상기 정신상태분석부에서 도출된 데이터가 공포의 감정 상태이면 1;상기 정신상태분석부에서 도출된 데이터가 좌절의 감정 상태이면 2;상기 정신상태분석부에서 도출된 데이터가 수치의 감정 상태이면 3;상기 정신상태분석부에서 도출된 데이터가 연민의 감정 상태이면 4;상기 정신상태분석부에서 도출된 데이터가 슬픔의 감정 상태이면 5;상기 정신상태분석부에서 도출된 데이터가 행복의 감정 상태이면 6;상기 정신상태분석부에서 도출된 데이터가 사랑의 감정 상태이면 7;로 수치변환하는 것을 특징으로 하는 사용자정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 위험감정분류부는,상기 위기 수준 분류 AI알고리즘을 통해 상기 정신상태분석부에서 도출된 데이터가 0에서 3인 경우, 약물치료 및 의료 정신과의료인의 치료가 필요한 상태인 고위험군 단계(Level_1);상기 정신상태분석부에서 도출된 데이터가 4에서 5인 경우,정신과의료인 혹은 심리상담전문가의 상담이 필요한 상태인 위험군 단계(Level_2);로 상기 위험 수치 범위를 설정하는 위험범위설정부;상기 정신상태분석부에서 도출된 데이터가 상기 고위험군 단계(Level_1) 혹은 상기 위험군 단계(Level_2)로 선별하는 위험군선별부;를 포함하는 것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 치료관련테깅부는,상기 정신상태분류부에서 도출된 사용자의 정신건강 상태의 증상 및 유사정신질환 정보를 포함하고 있는, 8개의증상정보탭을 포함하고 있는 증상정보탭제공부;8개 중의 어느 하나의 상기 증상정보탭이 선택될 경우, 선택된 상기 증상정보탭에 포함된 상기 사용자의 정신건강 상태의 증상 관련 약물 치료데이터 혹은, 비약물 치료데이터들이 테깅되는 서비스를 제공하는 치료데이터테깅부;를 포함하는 것을 특징으로 하는 사용자 정신 건강상태 분석을 활용한 디지털 치료제 매칭 시스템."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 8개의 증상정보탭은,분노의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 공포의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 좌절의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는증상정보탭;수치의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 연민의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 슬픔의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는증상정보탭, 행복의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 사랑의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭;을 포함하고 있는 것을 특징으로 하는 사용자 정신 건강 상태 분석공개특허 10-2023-0090430-4-을 활용한 디지털 치료제 매칭 시스템."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 비약물 치료데이터들은,정신과의료인, 정신건강의학과박사, 임상심리전문가, 상담심리전문가 정보 및 상담 치료 관련 정보, 생활습관교정 관련 정보, 상담 커뮤니티 정보, 명상 콘텐츠, 요가 콘텐츠, 심리 완화 도움 운동 관련 정보를 포함하고있는 것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "사용자 정신 건강 상태에 따른 디지털 치료제 매칭 방법에 있어서,사용자 정신 관련 데이터를 수집하는 단계;사용자의 정신건강 상태를 분류하는 단계;사용자의 정신건강 상태에 따른 디지털 치료 정보탭이 테깅되는 서비스를 제공하는 단계;를 포함하는 것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 방법."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,사용자 정신 관련 데이터를 수집하는 단계는,사용자 가족관계 데이터 및 사용자 개인정보입력 데이터, 사용자-심리테스트 결과데이터, 사용자 치료경험, 병원 기록 데이터, 병원 약물 검색 및 리뷰 데이터를 수집하는 단계;사용자와 AI챗봇 의사소통에 따른 사용자 대화 용어 및 문장 데이터를 실시간으로 수집하는 단계;를 포함하는것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 방법."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,사용자의 정신건강 상태를 분류하는 단계는,상기 수집된 사용자 정신 관련 데이터를 기반으로 사용자의 정신건강 상태를 분석하는 단계; 8감정 주요호소문제 분류 AI알고리즘을 기반으로, 상기 사용자의 정신건강 상태를 분노, 좌절, 행복, 사랑, 슬픔, 공포, 수치, 연민의 8가지 감정 상태별로 분류하는 단계;를 포함하는 것을 특징으로 하는 사용자 정신 건강상태 분석을 활용한 디지털 치료제 매칭 방법."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 수집된 사용자 정신 관련 데이터를 기반으로 사용자의 정신건강 상태를 분석하는 단계는,상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로 사용자 정신 관련 데이터를 수치 변환하여 상기 8가지 감정 상태별로 분류하는 단계;위기 수준 분류 AI알고리즘을 통해 분류된 상기 8가지 감정 상태가 위험 수치 범위에 들어온 것을 선별하는 단계;를 포함하는 것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 방법."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로 사용자 정신 관련 데이터를 수치 변환하여 상기 8가지 감공개특허 10-2023-0090430-5-정 상태별로 분류하는 단계는,상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로,상기 사용자 정신 관련 데이터가 분노의 감정 상태이면 0;상기 사용자 정신 관련 데이터가 공포의 감정 상태이면 1;상기 사용자 정신 관련 데이터가 좌절의 감정 상태이면 2;상기 사용자 정신 관련 데이터가 수치의 감정 상태이면 3;상기 사용자 정신 관련 데이터가 연민의 감정 상태이면 4;상기 사용자 정신 관련 데이터가 슬픔의 감정 상태이면 5;상기 사용자 정신 관련 데이터가 행복의 감정 상태이면 6;상기 사용자 정신 관련 데이터가 사랑의 감정 상태이면 7;로 수치변환하는 단계;를 포함하는 것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 방법."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 위기 수준 분류 AI알고리즘을 통해 분류된 상기 8가지 감정 상태가 위험 수치 범위에 들어온 것을 선별하는 단계는,상기 사용자 정신 관련 데이터가 0에서 3인 경우, 약물치료 및 의료 정신과의료인의 치료가 필요한 상태인 고위험군 단계(Level_1);상기 사용자 정신 관련 데이터가 4에서 5인 경우,정신과의료인 혹은 심리상담전문가의 상담이 필요한 상태인 위험군 단계(Level_2);로 상기 위험 수치 범위를 설정하는 단계;상기 사용자 정신 관련 데이터가 상기 고위험군 단계(Level_1) 혹은 상기 위험군 단계(Level_2)로 선별하는 단계;를 포함하는 것을 특징으로 하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 방법."}
{"patent_id": "10-2021-0178916", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서,상기 사용자의 정신건강 상태에 따른 디지털 치료 정보탭이 테깅되는 서비스를 제공하는 단계는,상기 사용자의 정신건강 상태의 증상 및 유사정신질환 정보를 포함하고 있는, 8개의 증상정보탭을 포함하고 있으며,8개 중의 어느 하나의 상기 증상정보탭이 선택될 경우, 선택된 상기 증상정보탭에 포함된 상기 사용자의 정신건강 상태의 증상 관련 약물 치료데이터 혹은, 비약물 치료데이터들이 테깅되는 서비스를 제공하는 단계;를 포함하는 것을 특징으로 하는 사용자 정신 건강 상태 분석을활용한 디지털 치료제 매칭 방법."}
{"patent_id": "10-2021-0178916", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 응급상황 신속한 중증도 분류 장치 및 방법에 관한 것으로, 보다 상세하게는 RTM(Rapid Triage Machine)기기를 통해 다수 사상자 발생시에 환자의 의식상태와 기도상태 등을 확인하여 신속하게 중증도 분류를 할 수 있는 응급상황 신속한 중증도 분류 장치 및 방법에 관한 것으로, RTM(Rapid Triage Machine) 장치에 있어 서, 응급사건이 발생한 환경에서의 응급상황정보를 수집하는 응급정보수집모듈; 딥러닝 기반의 상기 응급상황정 보를 기반으로 응급 환자의 중증도 단계를 분류하는 응급상태분석모듈; 응급병원서버와 연결되어 응급 환자상태 관련 정보데이터를 송수신하는 통신모듈;를 포함한다."}
{"patent_id": "10-2021-0178916", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 정신 건강 질환과 같이 지속적이고 연속적인 관리가 필요하고 복약 순응도가 낮은 영역의 경우 디지 털을 통한 환자 상태를 모니터링 하여, 개인에 최적화 된 치료 방법론을 제공하는 사용자 정신 건강 상태 분석 을 활용한 디지털 치료제 매칭 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0178916", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "대한민국 국민 4명 중 1명은 살아가면서 한 번 이상 우울증, 불안장애와 같은 정신질환을 경험한다. 대한민국 인구 10만 명 당 자살자는 28.7명으로 OECD 회원국 중 가장 높으며, 이는 18.7명으로 2위인 일본과도 큰 격차를 보이는 숫자이다. 한국은 2003년 이후 매년 자살률 1위를 기록하고 있다. 그런데 이 중 전문 정신 건강 관리 서 비스를 통해 치료를 받은 비율은 15%에 불과하다. 특히 우울증은 국내에서 제일 많은 환자를 보유하고 있는 질환이다. 2019년 조사에 따르면 1년 간 우울증 등 정 신질환으로 정신건강의학과를 찾아 진료받은 환자가 200만 명을 넘어섰다. 특히 우울증 환자는 2014년 58만명에 서 75만명으로 늘어났고, 같은 기간 불안장애 환자는 53만명에서 69만명까지 늘어났다. 2018년에 이들이 쓴 진 료비는 총 1조 4317억원이다. 이에 따라, 정신건강의학과에 대한 낮은 접근성과 높은 재발율, 낮은 약물 복용 순응도 문제점을 해결하는 대안 으로 디지털치료제가 대두되고 있다. 디지털 치료제란 질병을 예방, 관리, 치료하기 위해 환자에게 근거 기반한 치료적 개입을 하는 소프트웨어 의료기기다. SaMD (Software as a Medical Device)의 한 종류다. 정신건강의학 과에서 기존 약물치료를 대체 할 수 있을 것으로 기대되고 있다. 디지털치료제는 소프트웨어 의료기기이기 때문 에 물리적 장벽을 낮춰 접근성을 높일 수 있고, 기존 신약 대비 복약순응도가 우수하며, 개발비용과 기간이 적 게 들기 때문에 더 개인에게 최적화 된 디지털치료제가 개발 될 것으로 기대되고 있다. 한편, 디지털치료제는 기존의 약물 복약 순응도와 같이 유저가 디지털치료제에 대한 몰입도와 지속사용성 등을 증명해야 하며, 임상 환경에서 치료 효과성을 증명하더라도, 디지털치료제 실제 런칭 시 환자가 지속적으로 사 용 여부는 임상 단계 결과와 다르게 나올 가능성이 있다는 문제점이 존재한다. 또한, 지속적인 모니터링과 의료 계 전문가의 진단없이 환자의 보유 정신건강 진료DB 및 상담만으로 정신건강을 진단(예측)이 어려우며, 또한 환 자 적합형 디지털 치료법을 제공하는데 어려움이 있다는 한계점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록번호 (KR)제10-2216768호(2021.02.09.) (특허문헌 0002) 한국공개번호 (KR)제2018-0098840호(2018.09.05.) (특허문헌 0003) 한국공개번호 (KR)제10-2021-0065773호(2021.06.04) (특허문헌 0004) 한국등록번호 (KR)제10-2222451호(2021.02.24.)"}
{"patent_id": "10-2021-0178916", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 이와 같은 문제점을 감안한 것으로서, 본 발명은 정신건강 치료 목적의 대화DB(심리상담 DB)등 활용 빅데이터를 입력으로 하여, 사용자의 실제 문제 맥락과 상황에 초점을 기준으로 사용자 정신 건강 상태 인공지 능 분석 결과를 기반으로 디지털 치료제 솔루션을 매칭하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료 제 매칭 시스템 및 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0178916", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예들에 따른, 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템은 사용자 정신 관련 데이터를 수집하는 정신데이터수집부; 상기 정신데이터수집부에 수집된 데이터를 기반으로 상기 사용자의 정신건강 상태를 분류하는 정신상태분류부; 사용자의 정신건강 상태에 따른 디지털 치료 정보탭이 테깅되는 서 비스를 제공하는 치료관련테깅부;를 포함한다. 본 발명의 실시 예들에 있어서,상기 정신데이터수집부는, 사용자 가족관계 데이터 및 사용자 개인정보입력 데이 터, 사용자-심리테스트 결과데이터, 사용자 치료경험, 병원 기록 데이터, 병원 약물 검색 및 리뷰 데이터를 수"}
{"patent_id": "10-2021-0178916", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "집하는 사용자입력데이터수집부; 사용자와 전문 심리상담사간의 의사소통 음성 및 텍스트 내용 및 상기 전문 심리상담사의 상담 내용 요약 정보 데이터를 수집하는 심리상담데이터수집부; 사용자와 AI챗봇 의사소통에 따른 사용자 대화 용어 및 문장 데이터를 실시간으로 수집하는 AI챗봇소통데이터수집부;를 포함한다. 본 발명의 실시 예들에 있어서, 상기 정신상태분류부는, 상기 정신데이터수집부에 수집된 데이터를 기반으로 사 용자의 정신건강 상태를 분석하는 정신상태분석부; 8감정 주요호소문제 분류 AI알고리즘을 기반으로, 상기 사용 자의 정신건강 상태를 분노, 좌절, 행복, 사랑, 슬픔, 공포, 수치, 연민의 8가지 감정 상태별로 분류하는 8감정 분류부;를 포함한다. 본 발명의 실시 예들에 있어서, 상기 8감정분류부는, 상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로 상 기 정신상태분석부에서 도출된 데이터를 수치 변환하여 상기 8가지 감정 상태별로 분류하는 수치분류부; 위기 수준 분류 AI알고리즘을 통해 상기 수치분류부에서 분류된 상기 8가지 감정 상태가 위험 수치 범위에 들어온 것 을 선별하는 위험감정분류부;를 포함한다. 본 발명의 실시 예들에 있어서, 상기 수치분류부는, 상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로, 상 기 정신상태분석부에서 도출된 데이터가 분노의 감정 상태이면 0; 상기 정신상태분석부에서 도출된 데이터가 공 포의 감정 상태이면 1; 상기 정신상태분석부에서 도출된 데이터가 좌절의 감정 상태이면 2; 상기 정신상태분석 부에서 도출된 데이터가 수치의 감정 상태이면 3; 상기 정신상태분석부에서 도출된 데이터가 연민의 감정 상태 이면 4; 상기 정신상태분석부에서 도출된 데이터가 슬픔의 감정 상태이면 5; 상기 정신상태분석부에서 도출된 데이터가 행복의 감정 상태이면 6; 상기 정신상태분석부에서 도출된 데이터가 사랑의 감정 상태이면 7;로 수치 변환한다. 본 발명의 실시 예들에 있어서, 상기 위험감정분류부는, 상기 위기 수준 분류 AI알고리즘을 통해 상기 정신상태 분석부에서 도출된 데이터가 0에서 3인 경우, 약물치료 및 의료 정신과의료인의 치료가 필요한 상태인 고위험군 단계(Level_1); 상기 정신상태분석부에서 도출된 데이터가 4에서 5인 경우, 정신과의료인 혹은 심리상담전문가 의 상담이 필요한 상태인 위험군 단계(Level_2);로 상기 위험 수치 범위를 설정하는 위험범위설정부; 상기 정신 상태분석부에서 도출된 데이터가 상기 고위험군 단계(Level_1) 혹은 상기 위험군 단계(Level_2)로 선별하는 위 험군선별부;를 포함한다. 본 발명의 실시 예들에 있어서, 상기 치료관련테깅부는, 상기 정신상태분류부에서 도출된 사용자의 정신건강 상 태의 증상 및 유사정신질환 정보를 포함하고 있는, 8개의 증상정보탭을 포함하고 있는 증상정보탭제공부; 8개 중의 어느 하나의 상기 증상정보탭이 선택될 경우, 선택된 상기 증상정보탭에 포함된 상기 사용자의 정신건강 상태의 증상 관련 약물 치료데이터 혹은, 비약물 치료데이터들이 테깅되는 서비스를 제공하는 치료데이터테깅부;를 포함한다. 본 발명의 실시 예들에 있어서, 상기 8개의 증상정보탭은, 분노의 감정 상태의 증상 및 유사정신질환 정보를 포 함하고 있는 증상정보탭, 공포의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 좌절의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭; 수치의 감정 상태의 증상 및 유사정신질 환 정보를 포함하고 있는 증상정보탭, 연민의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정 보탭, 슬픔의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 행복의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 사랑의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭;을 포함한다. 본 발명의 실시 예들에 있어서, 상기 비약물 치료데이터들은, 정신과의료인, 정신건강의학과박사, 임상심리전문 가, 상담심리전문가 정보 및 상담 치료 관련 정보, 생활습관 교정 관련 정보, 상담 커뮤니티 정보, 명상 콘텐츠, 요가 콘텐츠, 심리 완화 도움 운동 관련 정보를 포함한다. 본 발명의 또 다른 실시 예들에 따른, 사용자 정신 건강 상태에 따른 디지털 치료제 매칭 방법에 있어서, 사용 자 정신 관련 데이터를 수집하는 단계; 사용자의 정신건강 상태를 분류하는 단계; 사용자의 정신건강 상태에 따 른 디지털 치료 정보탭이 테깅되는 서비스를 제공하는 단계;를 포함한다. 본 발명의 실시 예들에 있어서, 사용자 정신 관련 데이터를 수집하는 단계; 사용자 가족관계 데이터 및 사용자 개인정보입력 데이터, 사용자-심리테스트 결과데이터, 사용자 치료경험, 병원 기록 데이터, 병원 약물 검색 및 리뷰 데이터를 수집하는 단계; 사용자와 AI챗봇 의사소통에 따른 사용자 대화 용어 및 문장 데이터를 실시간으 로 수집하는 단계;를 포함한다. 본 발명의 실시 예들에 있어서, 사용자의 정신건강 상태를 분류하는 단계; 상기 수집된 사용자 정신 관련 데이 터를 기반으로 사용자의 정신건강 상태를 분석하는 단계; 8감정 주요호소문제 분류 AI알고리즘을 기반으로, 상기 사용자의 정신건강 상태를 분노, 좌절, 행복, 사랑, 슬픔, 공포, 수치, 연민의 8가지 감정 상태별로 분류하 는 단계;를 포함한다. 본 발명의 실시 예들에 있어서, 상기 수집된 사용자 정신 관련 데이터를 기반으로 사용자의 정신건강 상태를 분 석하는 단계는, 상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로 사용자 정신 관련 데이터를 수치 변환하 여 상기 8가지 감정 상태별로 분류하는 단계; 위기 수준 분류 AI알고리즘을 통해 분류된 상기 8가지 감정 상태 가 위험 수치 범위에 들어온 것을 선별하는 단계;를 포함한다. 본 발명의 실시 예들에 있어서, 상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로 사용자 정신 관련 데이터 를 수치 변환하여 상기 8가지 감정 상태별로 분류하는 단계는, 상기 8감정 주요호소문제 분류 AI알고리즘을 기 반으로, 상기 사용자 정신 관련 데이터가 분노의 감정 상태이면 0; 상기 사용자 정신 관련 데이터가 공포의 감 정 상태이면 1; 상기 사용자 정신 관련 데이터가 좌절의 감정 상태이면 2; 상기 사용자 정신 관련 데이터가 수 치의 감정 상태이면 3; 상기 사용자 정신 관련 데이터가 연민의 감정 상태이면 4; 상기 사용자 정신 관련 데이 터가 슬픔의 감정 상태이면 5; 상기 사용자 정신 관련 데이터가 행복의 감정 상태이면 6; 상기 사용자 정신 관 련 데이터가 사랑의 감정 상태이면 7;로 수치변환하는 단계;를 포함한다. 본 발명의 실시 예들에 있어서, 상기 위기 수준 분류 AI알고리즘을 통해 분류된 상기 8가지 감정 상태가 위험 수치 범위에 들어온 것을 선별하는 단계는, 상기 사용자 정신 관련 데이터가 0에서 3인 경우, 약물치료 및 의료 정신과의료인의 치료가 필요한 상태인 고위험군 단계(Level_1); 상기 사용자 정신 관련 데이터가 4에서 5인 경 우, 정신과의료인 혹은 심리상담전문가의 상담이 필요한 상태인 위험군 단계(Level_2);로 상기 위험 수치 범위 를 설정하는 단계; 상기 사용자 정신 관련 데이터가 상기 고위험군 단계(Level_1) 혹은 상기 위험군 단계 (Level_2)로 선별하는 단계;를 포함한다. 본 발명의 실시 예들에 있어서, 상기 사용자의 정신건강 상태에 따른 디지털 치료 정보탭이 테깅되는 서비스를 제공하는 단계는, 상기 사용자의 정신건강 상태의 증상 및 유사정신질환 정보를 포함하고 있는, 8개의 증상정보 탭을 포함하고 있으며, 8개 중의 어느 하나의 상기 증상정보탭이 선택될 경우, 선택된 상기 증상정보탭에 포함 된 상기 사용자의 정신건강 상태의 증상 관련 약물 치료데이터 혹은, 비약물 치료데이터들이 테깅되는 서비스를 제공하는 단계;를 포함한다."}
{"patent_id": "10-2021-0178916", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같은 응급상황 신속한 중증도 분류 장치 및 방법에 따르면, 첫째, 정신 건강 질환과 같이 지속적이고 연속적인 관리가 필요하고 복약 순응도가 낮은 영역의 경우 디지털을 통한 환자 상태를 모니터링 할 수 있다. 둘째, 개인에 최적화 된 치료 방법론 도입이 가능하다. 셋째, 빅데이터 및 인공지능 분석에 따른, 사용자 정신 건강 상태와 감정상태를 정확하게 분석이 가능하다. 넷째, 정신 건강 진단 기술을 고도화 하여 자연어처리 딥러닝 기술을 활용해서, 더 개인화된 진단(호소문제, 치 료적 개입방법, 위기 수준 진단)이 가능하다. 다섯째, 유저 풀(pool)과 프로세스가 정립되어 있어, 디지털치료 후보 방법론 도출 시 즉각적인 사업성 검증이 가능하다."}
{"patent_id": "10-2021-0178916", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "첨부한 도면을 참조하여 본 발명의 실시 예들에 따른 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템 및 방법에 대하여 상세히 설명한다. 본 발명은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는바, 특정 실시 예들을 도면에 예시하고 본문에 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 첨부된 도면에 있어서, 구조물들의 치수는 본 발명의 명확성을 기하기 위하여 실제보다 확대하거나, 개략적인 구성을 이해하기 위하여 실제보다 축소하여 도시한 것이다. 또한, 제1 및 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용 어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로 만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 한편, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명은 정신건강 치료 목적의 대화DB(심리상담 DB)등 활용 빅데이터를 입력으로 하여, 사용자의 실제 문제 맥락과 상황에 초점을 기준으로 사용자 정신 건강 상태 인공지능 분석 결과를 기반으로 디지털 치료제 솔루션을 매칭하는 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템 및 방법을 제공하는 것이다. 도 1과 도 2는 본 발명의 구성도 및 모식도이다. 도 1 및 도 2를 참고하면, 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 시스템은 정신데이터수집 부, 정신상태분류부 및 치료관련테깅부로 구성된다. 정신데이터수집부의 경우, 사용자 정 신 관련 데이터를 수집하며, 정신상태분류부는 정신데이터수집부에 수집된 데이터를 기반으로 상기 사용자의 정신건강 상태를 분류하며, 치료관련테깅부는 사용자의 정신건강 상태에 따른 디지털 치료 정보 탭이 테깅되는 서비스를 제공한다. 도 3은 본 발명의 일실시예에 따른 정신데이터수집부의 구성도이다. 도 3을 참고하면, 정신데이터수집부는 사용자입력데이터수집부(100a) 및 심리상담데이터수집부(100b) 및 AI챗봇소통데이터수집부(100c)를 포함한다. 사용자입력데이터수집부(100a)는 사용자 가족관계 데이터 및 사용자 개인정보입력 데이터, 사용자-심리테스트 결과데이터, 사용자 치료경험, 병원 기록 데이터, 병원 약물 검색 및 리뷰 데이터를 수집하며, 심리상담데이터수집부(100b) 상기 사용자와 전문 심리상담사와의 최소 50분간의 대화록과, 상기 대화록인 상기 사용자와 전문 심리상담사와의 의사소통 음성 및 텍스트 내용을 분석하는 상기 전문 심리상담사의 기록부, 상기"}
{"patent_id": "10-2021-0178916", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전문 심리상담사가 기록한 사용자의 감정/심리 변화 내용 및 상담 요약 내용 데이터를 수집하며, AI챗봇소통데 이터수집부(100b)는 사용자와 AI챗봇 의사소통에 따른 사용자 대화 용어 및 문장 데이터를 실시간으로 수집한다. 즉, 상기 AI챗봇은 상담센터/병원 코디네이터가 상담 접수지를 부여하고 내담자에게 연령, 성별, 이 전 치료경험, 가족관계, 발달력 등을 묻는 과정을 상기 AI챗봇이 대체하며, 자연어처리 기술을 이용하여 상담 접수지를 대화형 인터페이스로 자동화한 한다. 이 후, 정신데이터수집부는 상기 사용자와 AI 챗봇이 주고 받은 고민 데이터, 대화 데이터, 심리검사 데이터, 병원과 약물 검색 및 리뷰 데이터, 고객이 직접 진술한 인구 통계 및 가족관계 정보, 고객 정보 데이터를 활용하여, 정신건강 질환에 있어 사회적/심리적/상황적 맥락을 고 려하여 상기 사용자 정신 관련 데이터의 DB를 구축한다. 도 4는 본 발명의 일실시예에 따른 정신상태분류부의 구성도이다. 도 4를 참고하면, 정신상태분류부는 정신상태분석부과 8감정분류부를 포함한다. 정신상태분석부 는 정신데이터수집부에 수집된 데이터를 기반으로 사용자의 정신건강 상태를 분석하며, 8감정분류부 는 8감정 주요호소문제 분류 AI알고리즘을 기반으로, 상기 사용자의 정신건강 상태를 분노, 좌절, 행복, 사랑, 슬픔, 공포, 수치, 연민의 8가지 감정 상태별로 분류한다. 도 5는 본 발명의 일실시예에 따른 8감정분류부의 구성도이다. 도 5를 참고하면, 8감정분류부는 수치분류부 및 위험감정분류부를 포함한다. 여기서, 수치분류 부는 상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로 상기 정신상태분석부에서 도출된 데이터를 수 치 변환하여 상기 8가지 감정 상태별로 분류하며, 위험감정분류부는 위기 수준 분류 AI알고리즘을 통해 수 치분류부에서 분류된 상기 8가지 감정 상태가 위험 수치 범위에 들어온 것을 선별한다. 즉, 좀 더 상세하 게 설명하자면, 수치분류부는, 상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로, 정신상태분석부 에서 도출된 데이터가 분노의 감정 상태이면 0으로, 정신상태분석부에서 도출된 데이터가 공포의 감 정 상태이면 1로, 정신상태분석부에서 도출된 데이터가 좌절의 감정 상태이면 2로, 정신상태분석부에 서 도출된 데이터가 수치의 감정 상태이면 3으로, 정신상태분석부에서 도출된 데이터가 연민의 감정 상태 이면 4로, 정신상태분석부에서 도출된 데이터가 슬픔의 감정 상태이면 5로, 정신상태분석부에서 도출 된 데이터가 행복의 감정 상태이면 6으로, 정신상태분석부에서 도출된 데이터가 사랑의 감정 상태이면 7로 수치변환한다. 도 6은 본 발명의 일실시예에 따른 위험감정분류부의 구성도이다. 도 6을 참고하면, 위험감정분류부는 위험범위설정부(280a) 및 위험군선별부(280b)로 구성된다. 위험범위설 정부(280a)는 상기 위기 수준 분류 AI알고리즘을 통해 정신상태분석부에서 도출된 데이터가 0에서 3인 경 우, 약물치료 및 의료 정신과의료인의 치료가 필요한 상태인 고위험군 단계(Level_1)로 설정하며, 정신상태분석 부에서 도출된 데이터가 4에서 5인 경우, 정신과의료인 혹은 심리상담전문가의 상담이 필요한 상태인 위험 군 단계(Level_2);로 상기 위험 수치 범위를 설정하며, 위험군선별부(280b)는 정신상태분석부에서 도출된 데이터가 상기 고위험군 단계(Level_1) 혹은 상기 위험군 단계(Level_2)로 선별한다. 도 7은 본 발명의 일실시예에 따른 치료관련테깅부의 구성도이다. 도 7을 참고하면, 치료관련테깅부는, 증상정보탭제공부(300a), 치료데이터테깅부(300b), 치료콘텐츠생성부 (300c), 치료콘텐츠판단부(300d) 및 치료콘텐츠제공부(300e)를 포함한다. 증상정보탭제공부(300a)는 정신상태분류부에서 도출된 사용자의 정신건강 상태의 증상 및 유사정신질환 정 보를 포함하고 있는, 8개의 증상정보탭을 포함하고 있으며, 치료데이터테깅부(300b)는 8개 중의 어느 하나의 상 기 증상정보탭이 선택될 경우, 선택된 상기 증상정보탭에 포함된 상기 사용자의 정신건강 상태의 증상 관련 약 물 치료데이터 혹은, 비약물 치료데이터들이 테깅되는 서비스를 제공한다. 여기서, 상기 8개의 증상정보탭은, 분노의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 공포의 감정 상태의 증상 및 유사 정신질환 정보를 포함하고 있는 증상정보탭, 좌절의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭; 수치의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 연민의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 슬픔의 감정 상태의 증상 및 유사정신질환 정보를 포 함하고 있는 증상정보탭, 행복의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있는 증상정보탭, 사랑의 감정 상태의 증상 및 유사정신질환 정보를 포함하고 있다. 또한, 상기 비약물 치료데이터들은, 정신과의료인, 정신건강의학과박사, 임상심리전문가, 상담심리전문가 정보 및 상담 치료 관련 정보, 생활습관 교정 관련 정보, 상담 커뮤니티 정보, 명상 콘텐츠, 요가 콘텐츠, 심리 완화 도움 운동 관련 정보를 포함한다. 여기서, 치료관련테깅부는 치료콘텐츠생성부(300c)와 치료콘텐츠판단부(300d) 및 치료콘텐츠제공부(300e) 더 포함하며, 치료콘텐츠생성부(300c)는 자연환경요소 혹은 산림에서 걷거나 숨 쉬는 영상 혹은 바닷가에서 스 트레칭을 하는 영상 및 자연색상 각각에 대한 영상정보를 생성하며, 치료콘텐츠판단부(300d)는 상기 자연환경요 소 혹은 산림에서 걷거나 숨 쉬는 영상 혹은 바닷가에서 스트레칭을 하는 영상 및 자연색상 각각에 대한 영상정 보가, 소화에 도움이 되는 영상 정보 데이터; 인지 혹은, 산림욕 분위기를 조성함으로써 신경 안정과 마음의 평안에 도움이 되는 영상 정보데이터; 인지 혹은 신경 자극과 관련된 영상 정보데이터; 인지를 판단하여 매칭 (Matching)한다. 좀 더 상세하게 설명하자면, 치료콘텐츠판단부(300d)는 섭식장애 혹은, 신경불안증, 슬픔, 고 통으로 인해 소화가 되지 않은 사용자에게는 상기 소화에 도움이 되는 영상 정보 데이터인, 상기 자연환경요소 혹은 산림에서 걷거나 숨 쉬는 영상을 매칭하며, 조울증 혹은 우울증 혹은 예민증, 분노, 공포의 감정을 느끼는 사용자에게는 산림욕 분위기를 조성함으로써 신경 안정과 마음의 평안에 도움이 되는 영상 정보데이터인, 상기 산림에서 걷거나 숨 쉬는 영상을 매칭하며, 마지막으로 수치, 좌절, 분노조절장애을 앓고 있는 사용자에게는 신 경 자극과 관련된 영상 정보데이터인, 상기 산림에서 걷거나 숨 쉬는 영상과, 바닷가에서 스트레칭하는 연상을 매칭한다. 이 후, 치료콘텐츠제공부(300e)는 치료콘텐츠판단부(300d)에서 매칭된 결과데이데이터에 따라, 섭식장애 혹은, 신경불안증, 슬픔, 고통으로 인해 소화가 되지 않은 사용자에게는 상기 소화에 도움이 되는 영상 정보 데이터를 제공하며, 조울증 혹은 우울증 혹은 예민증, 분노, 공포의 감정을 느끼는 사용자에게는 산림욕 분위기를 조성함 으로써 신경 안정과 마음의 평안에 도움이 되는 영상 정보데이터를 제공하며, 수치, 좌절, 분노조절장애을 앓고 있는 사용자에게는 신경 자극과 관련된 영상 정보데이터를 제공한다. 도8은 본 발명의 흐름도이다. 도 8를 참고하면, 사용자 정신 건강 상태 분석을 활용한 디지털 치료제 매칭 방법은 사용자 정신 건강 상태에 따른 디지털 치료제 매칭 방법에 있어서, 사용자 정신 관련 데이터를 수집하는 단계(S801)와, 사용자의 정신건 강 상태를 분류하는 단계(S802); 및 사용자의 정신건강 상태에 따른 디지털 치료 정보탭이 테깅되는 서비스를 제공하는 단계(S803);를 포함한다. 좀 더 상세하게 설명하자면, 사용자 정신 관련 데이터를 수집하는 단계(S801)는, 사용자 가족관계 데이터 및 사 용자 개인정보입력 데이터, 사용자-심리테스트 결과데이터, 사용자 치료경험, 병원 기록 데이터, 병원 약물 검 색 및 리뷰 데이터를 수집하는 단계;와 사용자와 AI챗봇 의사소통에 따른 사용자 대화 용어 및 문장 데이터를 실시간으로 수집하는 단계;를 포함하며, 사용자의 정신건강 상태를 분류하는 단계(S802)는 상기 수집된 사용자 정신 관련 데이터를 기반으로 사용자의 정신건강 상태를 분석하는 단계; 8감정 주요호소문제 분류 AI알고리즘을 기반으로, 상기 사용자의 정신건강 상태를 분노, 좌절, 행복, 사랑, 슬픔, 공포, 수치, 연민의 8가지 감정 상태 별로 분류하는 단계;를 포함한다. 여기서, 상기 수집된 사용자 정신 관련 데이터를 기반으로 사용자의 정신건강 상태를 분석하는 단계는, 상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로 사용자 정신 관련 데이터를 수 치 변환하여 상기 8가지 감정 상태별로 분류하는 단계; 위기 수준 분류 AI알고리즘을 통해 분류된 상기 8가지 감정 상태가 위험 수치 범위에 들어온 것을 선별하는 단계;를 포함한다. 또한, 상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로 사용자 정신 관련 데이터를 수치 변환하여 상기 8가지 감정 상태별로 분류하는 단계는 상기 8감정 주요호소문제 분류 AI알고리즘을 기반으로, 상기 사용자 정신 관련 데이터가 분노의 감정 상태이면 0; 상기 사용자 정신 관련 데이터가 공포의 감정 상태이면 1; 상기 사용자 정신 관련 데이터가 좌절의 감정 상 태이면 2; 상기 사용자 정신 관련 데이터가 수치의 감정 상태이면 3; 상기 사용자 정신 관련 데이터가 연민의 감정 상태이면 4; 상기 사용자 정신 관련 데이터가 슬픔의 감정 상태이면 5; 상기 사용자 정신 관련 데이터가 행복의 감정 상태이면 6; 상기 사용자 정신 관련 데이터가 사랑의 감정 상태이면 7;로 수치변환하는 단계;를 포 함하며, 상기 위기 수준 분류 AI알고리즘을 통해 분류된 상기 8가지 감정 상태가 위험 수치 범위에 들어온 것을 선별하는 단계는, 상기 사용자 정신 관련 데이터가 0에서 3인 경우, 약물치료 및 의료 정신과의료인의 치료가 필요한 상태인 고위험군 단계(Level_1); 상기 사용자 정신 관련 데이터가 4에서 5인 경우, 정신과의료인 혹은 심리상담전문가의 상담이 필요한 상태인 위험군 단계(Level_2);로 상기 위험 수치 범위를 설정하는 단계; 상기 사용자 정신 관련 데이터가 상기 고위험군 단계(Level_1) 혹은 상기 위험군 단계(Level_2)로 선별하는 단계;를 포함한다. 또한, 좀 더 상세하게 설명하자면, 상기 사용자의 정신건강 상태에 따른 디지털 치료 정보탭이 테깅되는 서비스 를 제공하는 단계(S803)는, 상기 사용자의 정신건강 상태의 증상 및 유사정신질환 정보를 포함하고 있는, 8개의 증상정보탭을 포함하고 있으며, 8개 중의 어느 하나의 상기 증상정보탭이 선택될 경우, 선택된 상기 증상정보탭 에 포함된 상기 사용자의 정신건강 상태의 증상 관련 약물 치료데이터 혹은, 비약물 치료데이터들이 테깅되는 서비스를 제공하는 단계;를 포함한다. 이상에서 설명한 바와 같은 응급상황 신속한 중증도 분류 장치 및 방법에 따르면, 첫째, 정신 건강 질환과 같이 지속적이고 연속적인 관리가 필요하고 복약 순응도가 낮은 영역의 경우 디지털을 통한 환자 상태를 모니터링 할수 있다. 둘째, 개인에 최적화 된 치료 방법론 도입이 가능하다. 셋째, 빅데이터 및 인공지능 분석에 따른, 사 용자 정신 건강 상태와 감정상태를 정확하게 분석이 가능하다. 넷째, 정신 건강 진단 기술을 고도화 하여 자연 어처리 딥러닝 기술을 활용해서, 더 개인화된 진단(호소문제, 치료적 개입방법, 위기 수준 진단)이 가능하다. 다섯째, 유저 풀(pool)과 프로세스가 정립되어 있어, 디지털치료 후보 방법론 도출 시 즉각적인 사업성 검증이 가능하다. 앞서 설명한 본 발명의 상세한 설명에서는 본 발명의 바람직한 실시 예들을 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자 또는 해당 기술 분야에 통상의 지식을 갖는 자라면 후술될 특허 청구범위에 기재된 본 발 명의 사상 및 기술 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2021-0178916", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1과 도 2는 본 발명의 구성도 및 모식도이다. 도 3은 본 발명의 일실시예에 따른 정신데이터수집부의 구성도이다. 도 4는 본 발명의 일실시예에 따른 정신상태분류부의 구성도이다. 도 5는 본 발명의 일실시예에 따른 8감정분류부의 구성도이다. 도 6은 본 발명의 일실시예에 따른 위험감정분류부의 구성도이다. 도 7은 본 발명의 일실시예에 따른 치료관련테깅부의 구성도이다. 도8은 본 발명의 흐름도이다."}
