{"patent_id": "10-2014-0178563", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0071172", "출원번호": "10-2014-0178563", "발명의 명칭": "스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템", "출원인": "공간정보기술 주식회사", "발명자": "이종훈"}}
{"patent_id": "10-2014-0178563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템에 있어서,스테레오 영상을 획득하기 위한 스테레오영상획득부(100);상기 획득된 스테레오 영상을 저장하고 있는 스테레오영상저장부(200);다수의 스테레오 영상으로부터 특징점을 추출하기 위한 특징점추출부(300);어느 한 스테레오 영상과 이어지는 다른 스테레오 영상에 존재하는 특징점 중에서 일치하는 특징점을 찾아서 서로 연결하기 위한 특징점연결부(400);상기 특징점연결부에 의해 서로 연결된 스테레오 영상들을 맵핑시켜 파노라마 3차원 스테레오 전체 맵을 생성하기 위한 전체맵생성부(500);상기 전체맵생성부에서 생성된 파노라마 3차원 스테레오 전체 맵 정보를 저장하고 있는 전체맵디비(600);상기 전체맵디비로부터 공간 정보를 추출한 후, 공간 함수를 이용하여 실제 공간 지도에 실제 이동 객체를 맵핑하여 이동 객체의 위치, 속도, 방향을 분석하기 위한 이동객체분석부(700);를 포함하여 구성되는 것을 특징으로하는 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템."}
{"patent_id": "10-2014-0178563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 이동객체분석부(700)는,장애물이 있어도 파노라마 3차원 스테레오 전체 맵과 상관없이 이동객체의 위치, 이동 경로를 분석할 수 있는것을 특징으로 하는 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템."}
{"patent_id": "10-2014-0178563", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 이동객체분석부(700)는,카메라가 이동한 자세를 계산하거나 특징점을 이용하여 카메라 시점과 실제 공간상의 관계를 계산하고 배경을제거해서 이동객체를 추출하고 그 이동객체를 전체 맵에 표시하는 것을 특징으로 하는 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템."}
{"patent_id": "10-2014-0178563", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템에 관한 것으로, 더욱 상세하게는 스테레오 영상을 이용하여 파노라마 3차원 맵을 생성하고, 이동객체를 파노라마 3차원 맵에 맵핑하여 구현하여 오브젝트 트래킹을 수행할 수 있게 되어 이동 객체의 위치, 속도, 방향을 분석할 수 있는 스테레오 카메라를 이용한 파노 라마 3차원 맵 생성시스템에 관한 것이다."}
{"patent_id": "10-2014-0178563", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템에 관한 것으로, 더욱 상세하게는 스테레오 영상을 이용하여 파노라마 3차원 맵을 생성하고, 이동객체를 파노라마 3차원 맵에 맵핑하여 구현하여 오브젝트 트래킹을 수행할 수 있게 되어 이동 객체의 위치, 속도, 방향을 분석할 수 있는 스테레오 카메라를 이용한 파노 라마 3차원 맵 생성시스템에 관한 것이다."}
{"patent_id": "10-2014-0178563", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "영상으로부터 3차원 모델을 복원하는 기법은, 컴퓨터 비전 영역에서 매우 오래된 연구 주제이다. 그 대표적인 기술로서 빛과 그림자의 관계로부터 3차원 정보를 복원하는 기법(shape from shading), 물체 표면 패턴으로부터 3차원 정보를 복원하는 기법(shape from texture) 및 윤곽선 정보로부터 3차원 정보를 복원하는 기법(visual hull) 등이 있다. 특히, 윤곽선 정보로부터 3차원 정보를 복원하는 기법(visual hull)은 매우 간단하면서도 효율적으로 3차원 모 델을 복원할 수 있어 최근 많은 연구가 이루어졌다. 그러나, 이 기법은 오목한 영역에 대한 복원이 불가능한 문제점이 있으며, 카메라의 수가 적은 경우 매우 조악 한 모델이 생성되는 문제점이 있다. 한편, 스테레오 영상을 이용한 영상 처리기법이 활발히 연구되고 있는데, 두 대의 카메라에서 얻어진 영상에서 생기는 양안 시차를 이용하여 깊이를 추정하는 기술이지만 이를 활용하기 위한 어플리케이션 기술 개발이 시급 한 실정이다. 또한, 기존 지능형 CCTV의 특징으로서, 인공지능 방식의 인식으로 사람의 얼굴, 물체의 인식, 물체의 추적분야 로 발달되어 있으나, 해상도 및 화소의 밝기만으로 물체를 판별하는 문제점이 있었다. 그리고, 기존 고정형 CCTV의 경우에는 감시영역을 벗어난 후 물체의 추적이 지속될 수 없으며, 카메라 고정대의 노후 및 바람, 열, 비, 진동 등의 외부 영향을 받아 감시영역이 변경될 소지가 많았었다. 일반적인 CCTV의 단점은 왜곡의 보정이 어려우며, 카메라와 객체의 정확한 위치, 길이, 높이, 크기, 방향을 알 수 없었다. 또한, 배경을 현실에 가까운 3차원 영상으로 제공하여 해당 영상 내에서 추적하고자 하는 이동 객체만을 확인할 수 있는 기술을 요구하게 되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 10-1290197호(2013.07.22)"}
{"patent_id": "10-2014-0178563", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템은 상기와 같은 종래 기술에서 발생하는 문 제점을 해소하기 위한 것으로, 스테레오 영상을 이용하여 파노라마 3차원 맵을 생성하고, 이동객체를 파노라마 3차원 맵에 맵핑하여 구현하여 오브젝트 트래킹을 수행할 수 있게 되어 이동 객체의 위치, 속도, 방향을 신속하 게 분석할 수 있도록 하는데 있다."}
{"patent_id": "10-2014-0178563", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템은, 스테레오 영상을 획득하기 위한 스테레오영상획득부; 상기 획득된 스테레오 영상을 저장하고 있는 스테레오영상저장부; 다수의 스테레오 영상으로부터 특징점을 추출하기 위한 특징점추출부; 어느 한 스테레오 영상과 이어지는 다른 스테레오 영상에 존재하는 특징점 중에서 일치하는 특징점을 찾아서 서 로 연결하기 위한 특징점연결부; 상기 특징점연결부에 의해 서로 연결된 스테레오 영상들을 맵핑시켜 파노라마 3차원 스테레오 전체 맵을 생성하 기 위한 전체맵생성부; 상기 전체맵생성부에서 생성된 파노라마 3차원 스테레오 전체 맵 정보를 저장하고 있는 전체맵디비; 상기 전체맵디비로부터 공간 정보를 추출한 후, 공간 함수를 이용하여 실제 공간 지도에 실제 이동 객체를 맵핑 하여 이동 객체의 위치, 속도, 방향을 분석하기 위한 이동객체분석부;를 포함하여 구성되어 본 발명의 과 제를 해결하게 된다."}
{"patent_id": "10-2014-0178563", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의해, 스테레오 영상을 이용하여 파노라마 3차원 맵을 생성하고, 이동객체를 파노라마 3차원 맵에 맵 핑하여 구현하여 오브젝트 트래킹을 수행할 수 있게 되어 이동 객체의 위치, 속도, 방향을 신속하게 분석할 수 있으며, 배경에 가려져 추적이 불가능할 경우에도 파노라마 3차원 전체맵과 관계없이 위치와 이동경로를 분석할 수 있는 효과를 제공한다."}
{"patent_id": "10-2014-0178563", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 통해 본 발명의 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템에 대해 상세히 설명하기로 한다. 도 1은 본 발명의 실시예에 따른 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템의 전체 블록도이다. 도 1에 도시한 바와 같이, 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템은 스테레오영상획득 부; 스테레오영상저장부; 특징점추출부; 특징점연결부; 전체맵생성부; 전체맵디비 ; 이동객체분석부;를 포함하여 구성된다. 상기 스테레오영상획득부는 스테레오 카메라로부터 스테레오 영상을 획득하게 된다. 상기 스테레오 영상은 두 개의 카메라에서 촬영된 좌측 영상 및 우측 영상을 의미하며, 별도의 라인보정부를 통 해 좌측 영상 및 우측영상의 라인을 보정할 수도 있다. 즉, 흔들림이 발생하면 데이터 처리시에 에러가 발생할 수 있기 때문에 보정을 수행하게 되는 것이다. 이때, 상기 획득된 스테레오 영상을 스테레오영상저장부에 저장하게 된다. 상기 특징점추출부는 도 2에 도시한 바와 같이, 다수의 스테레오 영상으로부터 특징점을 추출하게 된다. 좌우측 카메라를 통해 얻어지는 영상의 대응되는 특징점을 2차원 좌표로 구하게 된다. 상기 특징점들은 에피폴라 라인(Epipolar Line)을 연결하고 보정하는데 이용되며, 본 발명의 일 실시예에서는 이 특징점들을 추출하기 위해 컬러 에지(Color Edge) 추출 방식이 이용된다. 상기 특징점연결부는 어느 한 스테레오 영상과 이어지는 다른 스테레오 영상에 대응하는 특징점 중에서 일 치하는 특징점을 찾아서 서로 연결하고 특징점을 이용하여 좌우 영상을 평행이 되게 보정한다. 예를 들어, 파노라마 사진을 찍듯이 stereo 영상으로 구축한 3D를 이어서 파노라마 3D를 구현하는 것인데, 연결 하는 방법은 각각의 stereo 영상에서 얻어지는 특징점 중에서 바로 옆에 존재하는 stereo 영상에서 얻어진 특징 점 중에서 일치하는 특징점을 찾아서 연결하고 연결 후 잘 안맞는 부분은 오차를 제거하면서 이어나가게 되는 것이다. 상기 전체맵생성부는 도 2에 도시한 바와 같이, 특징점연결부에 의해 서로 연결된 스테레오 영상들을 맵핑 시켜 파노라마 3차원 스테레오 전체 맵을 생성하게 되며, 생성된 전체 맵을 전체맵디비에 저장 처리하게 된다. 상기 전체맵디비는 전체맵생성부에서 생성된 파노라마 3차원 스테레오 전체 맵 정보를 저장하고 있다. 한편, 파노라마 뿐만 아니라 달리는 차나 무인비행기에서 촬영한 영상은 물론 여러 시점에서 찍은 실내와 영상 을 같은 방법으로 이어서 전체의 큰 3차원 파노라마 맵을 만들어 나갈 수 있다. 상기 파노라마 3차원 스테레오 전체 맵은 배경에 해당하며, 배경은 가급적 변화가 적으므로 이동 객체 추적을 위하여 모든 영상을 확인할 필요없이 특정 이동 객체만을 추출하여 해당 이동 객체의 이동 경로를 신속하게 추 적해 나갈 수 있는 것이다. 상기 이동객체분석부는 상기 전체맵디비로부터 공간 정보를 추출한 후, 공간 함수를 이용하여 실제 공간 지도에 실제 이동 객체를 맵핑하여 이동 객체의 위치, 속도, 방향을 분석하게 된다. 속도 및 방향으로 이미지가 아닌 실시간으로 이동하는 동영상 정보를 가지고 있기 때문에 쉽게 분석이 가능하게 된다. 실제 스테레오 영상은 고정 위치값을 가지고 있는 카메라로부터 획득하기 때문에 이동체를 확인할 수 있고, 상 기한 파노라마 3차원 스테레오 전체 맵에 맵핑이 가능하게 되는 것이다. 상기와 같이, 이동경로를 알 수 있기 때문에 예를 들어, 어린이 보호구역을 지정하거나, 신호등을 도입하기 전 에 증거 데이터로 활용할 수 있게 된다. 즉, 공간 정보를 이용하여 다양한 통계 정보로 활용할 수 있는 것이다. 또한, 공간 정보를 지도와 매칭한 후, 공간 함수를 구현해서 오브젝트 트래킹이 가능하므로 이동체를 추적하는 데 활용할 수 있게 된다. 그리고, 상기 이동객체분석부는 장애물이 있어도 파노라마 3차원 스테레오 전체 맵과 상관없이 이동객체의 위치, 이동 경로를 분석할 수 있는 것을 특징으로 한다. 또한, 상기 이동객체분석부는, 일정 시점에서 카메라좌표와 실제좌표의 좌표변환을 위해서 일정시점이 실제공간상의 어느 부분에 해당하는지 알아야 한다. 그러기 위해서 카메라가 이동한 자세를 계산하거나 특징점을 이용하여 카메라시점과 실제공간상의 관계를 계산 하고 배경을 제거해서 이동객체를 추출하고 그 이동객체를 전체 맵에 표시하게 된다. 본 발명의 구성 및 동작을 통해 스테레오 영상을 이용하여 파노라마 3차원 맵을 생성하고, 이동객체를 파노라마 3차원 맵에 맵핑하여 구현하여 오브젝트 트래킹을 수행할 수 있게 되어 이동 객체의 위치, 속도, 방향을 신속하 게 분석할 수 있으며, 배경에 가려져 추적이 불가능할 경우에도 파노라마 3차원 전체맵과 관계없이 위치와 이동 경로를 분석할 수 있는 효과를 제공한다. 또한, 공간 정보를 이용하여 다양한 통계가 가능하며, 사람 및 차량 등의 이동 경로를 알 수 있으므로 어린이 보호 구역, 신호등을 도입할 경우에 데이터로 활용할 수 있게 된다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구 범위의 의 미 및 범위 그리고 그 등가 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0178563", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 스테레오 카메라를 이용한 파노라마 3차원 맵 생성시스템의 전체 블록도이며, 도 2는 특징점 추출 및 파노라마 3차원 스테레오 전체 맵을 나타낸 예시도이다."}
