{"patent_id": "10-2023-0090228", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0010253", "출원번호": "10-2023-0090228", "발명의 명칭": "인공지능 기술을 활용한 페인트부스의 공기 정화 시스템", "출원인": "주식회사 더블유솔루션", "발명자": "전현중"}}
{"patent_id": "10-2023-0090228", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "페이트부스로부터 유입된 유입 분진량 및 페인트 부스 공기정화장치에서 배출된 배수 분진량을 측정하는 분진량측정 센서;상기 분진수가 상향향으로 분무되도록 하는 회전날개;상기 회전날개의 회전 정보를 측정하는 회전 감지 센서;상기 회전날개에 의해 분무된 분무 분진수가 분급 낙하되면 배수관을 통해 배수되는 분진양을 측정하는 배수관센싱 센서;상기 배수관을 통해 상기 페인트 부스 공기정화장치에서 배출된 분진수가 저장되어 있는 외부옥외탱크; 및상기 유입 분진량, 상기 배수 분진량 및 상기 회전날개의 회전 정보에 따라 상기 회전날개의 속도를 모니터링하여 상기 분진수의 분무량을 조절하고, 외부옥외탱크에 배수된 분진량에 따라 상기 외부옥외탱크에 유입되는 약품의 용량을 제어하는 페이트부스 공기 정화 모니터링 장치를 포함하고,상기 학습 데이터에 기초하여 입력 이미지에 포함된 제1 적어도 하나의 피도장물에 대한 인식 정보를 출력하도록 제1 AI 모델을 학습시키는 단계; 및제2 사용자가 이용하는 제2 단말 장치로부터 제2 피도장물에 대한 이미지가 수신됨에 기반하여, 상기 제2 제품에 대한 이미지를 상기 제1 AI 모델이 입력하여 상기 제2 피도장물에 포함된 제2 적어도 하나의 피도장물에 대한 인식 정보를 획득하고, 상기 획득된 제2 적어도 하나의 피도장물에 대한 인식 정보가 포함된 제1 메시지를상기 제2 단말 장치로 전송하는 단계를 포함하는 것을 특징으로 하는 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템."}
{"patent_id": "10-2023-0090228", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 페이트부스로부터 유입된 유입 분진량 및 페인트 부스 공기정화장치에서 배출된 배 수 분진량을 측정하는 분진량 측정 센서, 상기 분진수가 상향향으로 분무되도록 하는 회전날개, 상기 회전날개의 회전 정보를 측정하는 회전 감지 센서, 상기 회전날개에 의해 분무된 분무 분진수가 분급 낙하되면 배수관을 통 해 배수되는 분진양을 측정하는 배수관 센싱 센서, 상기 배수관을 통해 상기 페인트 부스 공기정화장치에서 배출 된 분진수가 저장되어 있는 외부옥외탱크 및 상기 유입 분진량, 상기 배수 분진량 및 상기 회전날개의 회전 정보 에 따라 상기 회전날개의 속도를 모니터링하여 상기 분진수의 분무량을 조절하고, 외부옥외탱크에 배수된 분진량 에 따라 상기 외부옥외탱크에 유입되는 약품의 용량을 제어하는 페이트부스 공기 정화 모니터링 장치를 포함하는 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템에 관한 것이다."}
{"patent_id": "10-2023-0090228", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템에 관한 것으로, 보다 구체적으로 페이트부스 내 공기를 정화하는 페이트부스 공기 정화 장치의 상태를 IoT 센서를 통해 모니터링하여 페이트부스의 공기가 정화되도록 하는 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0090228", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 자동차, 가전제품 등 조립이 완료된 제품은 부식을 막고 모양을 내기 위해 도장작업을 실시한다. 도장작업은 주로 밀폐된 부스(booth)안에서 작업자가 분사(spray)식 도장설비를 가지고 제품에 대해 페인트를 분무하여 실시된다. 작업자가 페인트를 분사하여 도장작업을 실시할 경우, 미세먼지, 페인트 분진 등 작업환경에 영향을 끼치는 입 자들이 페인트부스 내 공기 중에 부유하게 된다. 이 경우, 페인트부스 내 부유하는 입자들이 도장제품의 불량률 을 증가시킬 수 있다. 이러한 미세입자와 휘발성유기화합물의 대기오염물질은 그 독성이 강하여 인체에 중대한 해를 가하고, 자극적이 고 불쾌한 악취를 내며, 대기 중에 그냥 배출되면 대기오염을 유발시키므로, 가능한 한 신속하게 부스 내부로부 터 배출하여 작업자의 건강을 보호하고, 도장 생산성을 향상시키도록 해야 하며, 배출과정에서 배기공기로부터 완벽하게 제거하여 대기 중으로 배출되는 것을 적극 억제시켜야만 한다. 이를 위해, 종래에는 배기팬을 이용하여 부스 하단측에 연결되어 외부로 연장되는 배기관을 통해 부스내의 공기 를 외부로 배출시 배기관상에 여러 형태의 오염물질 정화장치를 설치하여 배기공기중에 함유된 오염물질을 제거 하였는데, 주로 1회성 필터를 이용하였고, 필터만으로 휘발성유기화합물의 제거에 한계가 있어 필터 후방에 많 은 미세공과 넓은 표면적을 갖는 활성탄 흡착제를 설치하여 이용하였지만 효율성이 매우 낮은 문제가 있었다."}
{"patent_id": "10-2023-0090228", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 페이트부스 내 공기를 정화하는 페이트부스 공기 정화 장치의 상태를 IoT 센서를 통해 모니터링하여 페이트부스의 공기가 정화되도록 하는 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템을 제공하는 것을 목적으로 한다. 또한, 본 발명은 페이트부스로부터 유입된 유입 분진양 및 외부로 배수되는 배수 분진량에 따라 회전날개의 속 도를 모니터링하여 분진수의 분무량을 모니터링할 수 있도록 하는 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템을 제공하는 것을 목적으로 한다. 또한, 본 발명은 외부옥외탱크에 배수된 분진량에 따라 외부옥외탱크에 유입되는 약품의 용량을 제어하여 물을 정화시킬 수 있도록 하는 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템을 제공하는 것을 목적으로 한 다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2023-0090228", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위한 페이트부스로부터 유입된 유입 분진량 및 페인트 부스 공기정화장치에서 배출된 배수 분진량을 측정하는 분진량 측정 센서, 상기 분진수가 상향향으로 분무되도록 하는 회전날개, 상기 회전날 개의 회전 속도를 측정하는 회전 감지 센서, 상기 회전날개에 의해 분무된 분무 분진수가 분급 낙하되면 배수관 을 통해 배수되는 분진양을 측정하는 배수관 센싱 센서, 상기 배수관을 통해 상기 페인트 부스 공기정화장치에 서 배출된 분진수가 저장되어 있는 외부옥외탱크 및 상기 유입 분진량, 상기 배수 분진량 및 상기 회전날개의 회전 속도에 따라 상기 회전날개의 속도를 모니터링하여 상기 분진수의 분무량을 조절하고, 외부옥외탱크에 배 수된 분진량에 따라 상기 외부옥외탱크에 유입되는 약품의 용량을 제어하는 페이트부스 공기 정화 모니터링 장 치를 포함한다. 또한, 이러한 목적을 달성하기 위한 인공지능 기술을 활용한 페인트부스의 공기 정화 방법은 분진량 측정 센서 가 페이트부스로부터 유입된 유입 분진량을 센싱하여 페이트부스 공기 정화 모니터링 장치에 제공하는 단계, 회 전날개의 회전에 의해 분진수를 상방향으로 분무하면 분무된 분무 분진수가 분급 낙하되면 배수관을 통해 외부 옥외탱크에 저장되는 단계, 상기 회전날개의 일측면에 형성된 회전 감지 센서가 상기 회전날개의 회전 속도를 센싱하여 상기 페이트부스 공기 정화 모니터링 장치에 제공하는 단계, 상기 배수관의 일측면에 형성된 배수관 센싱 센서가 회전날개에 의해 분무된 분무 분진수가 분급 낙하되면 배수관을 통해 배수되는 분진양을 센싱하여 상기 페이트부스 공기 정화 모니터링 장치에 제공하는 단계, 상기 페이트부스 공기 정화 모니터링 장치가 상기 유입 분진량, 상기 배수 분진량 및 상기 회전날개의 회전 속도에 따라 상기 회전날개의 속도를 모니터링하여 상 기 분진수의 분무량을 조절하는 단계 및 상기 외부옥외탱크에 배수된 분진량에 따라 상기 외부옥외탱크에 유입 되는 약품의 용량을 제어하는 단계를 포함한다."}
{"patent_id": "10-2023-0090228", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 바와 같은 본 발명에 의하면, 페이트부스 내 공기를 정화하는 페이트부스 공기 정화 장치의 상태를 IoT 센서를 통해 오염 정도 등을 측정하여 페이트부스의 공기가 정화되도록 한다는 장점이 있다. 또한 본 발명에 의 하면, 페이트부스로부터 유입된 유입 분진양 및 외부로 배수되는 배수 분진량에 따라 회전날개의 속도를 모니터 링하여 분진수의 분무량을 제어할 수 있다는 장점이 있다. 또한 본 발명에 의하면, 외부옥외탱크에 배수된 분진 량에 따라 외부옥외탱크에 유입되는 약품의 용량을 모니터링하여 물을 정화시킬 수 있다는 장점이 있다."}
{"patent_id": "10-2023-0090228", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 본 명세서에서 사용된 용어 중 “분진”이란 아황산가스, 질소 산화물, 납, 오존, 일산화 탄소 등과 함께 수많 은 대기오염물질을 포함하는 대기오염 물질로 자동차, 공장 등에서 발생하여 대기중 장기간 떠다니는 입경 10㎛ 이하의 미세한 먼지이며, PM10이라 하고, 입자가 2.5㎛ 이하인 경우는 PM2.5라고 쓰며 '초미세먼지' 또는 '극미 세먼지' 라고 부른다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템을 설명하기 위한 네트워크 구성도이다. 도 2는 본 발명의 일 실시예에 따른 IoT 기술을 이용한 페이트부스 공기 정화 장치를 설 명하기 위한 도면이다. 도 3은 본 발명의 일 실시예에 따른 IoT 기술을 이용한 페이트부스 공기 정화 장치의 분 진수가 분무되어 배출되는 일부 구성을 나타낸 확대도이다. 도 4는 본 발명의 일 실시예에 따른 인공지능 기술 을 활용한 페인트부스의 공기 정화 시스템을 설명하기 위한 블록도이다. 도 1 내지 도 4를 참조하면, 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템은 페이트부스 공기 정화 장치, 페이트부스 공기 정화 모니터링 장치 및 사용자 단말을 포함하고, 페이트부스 공기 정화 장치는 수막조, 회전날개, 회전 감지 센서, 배수관, 유도관, 물분사체 및 외부옥외탱크를 포함한다. 수막조는 공기중에 페인트분진이 포함되는 페인트부스 및 페인트부스와 격벽으로 분리되어 정화된 공기가 상방향으로 이동하는 정화부스로 구성된다. 그리고, 페인트부스는 공기중의 페인트분진에 물을 분사하여 페인트부스의 하부에 페인트분진이 포함된 분진수가 모이도록 이루어진다. 이때, 격벽의 하부가 개방되도록 이루어져 페인트부스에서 정화부스 방 향으로 분진수가 유입되도록 이루어진다. 또한, 정화부스의 하부에서 페인트부스로부터 유입된 분진수를 정화하고, 정화부스의 상부에 정화 된 공기를 외부로 토출시키는 통로가 구비될 수 있다.분진량 측정 센서는 페이트부스로부터 유입된 유입 분진량을 센싱하여 페이트부스 공기 정화 모니터링 장치 에 제공한다. 분진량 측정 센서는 외부옥외탱크에 형성되어 외부옥외탱크에 저장된 분진수의 농도를 측정하여 페이 트부스 공기 정화 모니터링 장치에 제공한다. 회전날개는 제1 회전날개 및 제2 회전날개를 포함한다. 제1 회전날개는 페인트부스로부터 유입된 분진수로 이루어지는 제1수막과 접하도록 배치된다. 또 한, 제1 회전날개를 구성하는 날개의 단부에 삼각 톱날이 구비되어 회전시 분진수가 상방향으로 분무되도 록 형성된다. 상기의 제1 회전날개는 중심축을 기준으로 호 형상의 날개가 복수 개 형성되며, 전후 방향으로 길게 형성 되어 시계방향으로 회전할 수 있다. 제1 회전날개는 페인트 부스로부터 유입된 분진수가 상방향으로 분무되도록 한다. 이때, 페인트 부스는 공 기중의 페인트 분진에 물을 분사하여 페인트 부스의 하부에 페인트 분진이 포함된 분진수가 모이도록 이루 어진다. 상기의 제1 회전날개는 페이트부스 공기 정화 모니터링 장치의 모니터링에 따라 제1 회전 속도로 회 전되어 분진수를 분무시킨다. 또한, 제1수막과 제1 회전날개의 삼각 톱날 중 돌출날의 끝단부와의 거리를 h₁으로 정의하고, 제1수 막과 제1 회전날개의 톱날 중 인입날의 끝단부와의 거리를 h₂로 정의하였을 때, 제1 회전날개 가 회전하면 h₁과 h₂지점에서 발생하는 압력의 차이로 와류가 발생하여 제1수막의 분진수가 상방향으로 분무될 수 있다. 제1 회전날개가 제1 회전 속도로 회전되어 분진수가 분무되면 일부는 제1 배수관을 통해 외부옥외탱 크에 배출되고 나머지는 제1 유도관을 통해 제2 회전날개로 배출된다. 이때, 제1 회전날개(11 1)의 제1 회전 속도는 페이트부스로부터 유입된 유입 분진량에 따라 변경될 수 있다. 제1 유도관은 제1 회전날개를 감싸는 케이스로서, 달팽이관 형상으로 이루어져 제1 회전날개로 부터 분무된 분진수를 일방향으로 안내한다. 또한, 제1 유도관은 제1 회전날개의 측면을 감싸는 제1내측면(미도시)과 제1 회전날개의 상부와 제1내측면의 외부를 감싸는 제1외측면으로 이루어질 수 있다. 이때, 제1 회전날개가 시계방향으로 회전하며 상방향으로 안내된 분무 상태의 분진수가 제1내측면과 충돌 하며 제1외측면 방향으로 안내되고, 제1외측면으로 안내된 분진수는 일방향으로 안내될 수 있다. 그리고, 제1 유도관의 출구측에서 분진수를 이루는 분진의 입자에 따라 분급되어 일부는 제1 배수관 으로 낙하되고, 일부는 제2수막에 포함되거나, 제2 회전날개 방향으로 안내된다. 제1 배수관은 제1 유도관의 출구 하측에 형성되어 제1 유도관으로부터 안내된 분무 분진수가 분 급 낙하되면 고농도 분진수를 우선 배출시킨다. 이때, 제1 배수관은 상부에 고농도 분진수가 통과되는 배수개구부(미도시)가 형성될 수 있으며, 배수개구 부 상부에 제2 회전날개와 접하는 제2수막이 형성될 수 있다. 제2 회전날개는 제1 유도관의 출구측에 수막조의 하부로부터 분리되어 배치되고, 날개의 단부에 삼각 톱날이 형성되어 회전시 분진수가 상방향으로 분무되도록 형성된다. 제2 회전날개는 제1 유도관으로부터 안내된 분진수 및 하기 언급될 물분사체에서 분사되는 물로 구성되는 제2수막과 접하도록 배치된다. 그리고, 제2 회전날개는 중심축을 기준으로 호 형상의 날개가 복수 개 형성되며, 전후 방향으로 길게 형성 되어 시계방향으로 회전할 수 있다. 또한, 제2수막과 제2 회전날개의 삼각 톱날 중 돌출날의 끝단부와의 거리를 h₁으로 정의하고, 제2수 막과 제2 회전날개의 톱날 중 인입날의 끝단부와의 거리를 h₂로 정의하였을 때, 제2 회전날개 가 회전하면 h₁과 h₂지점에서 발생하는 압력의 차이로 와류가 발생하여 제2수막의 분진수가 상방향으로분무될 수 있다. 상기의 제2 회전날개는 페이트부스 공기 정화 모니터링 장치의 모니터링에 따라 제2 회전 속도로 회 전되어 분진수를 분무시킨다. 제2 회전날개가 제2 회전 속도로 회전되어 분진수가 분무되면 유도관을 통해 낙하된 분진수가 제2유도관을 통해 제2 배수관을 통해 외부옥외탱크에 배출된다. 상기의 제2 회전 속도는 제1 회전 속도보다 늦게 설정될 수 있다. 이와 같은 이유는 제2 회전날개에 의해 상방향으로 분무되는 분진수는 제1 회전날개로부터 분무된 분진수 중 배출되지 않고 유입된 분진수이기 때 문에, 제1 회전날개로 유입되는 분진량보다 적은 양의 분진량이 존재하기 때문이다. 제2유도관은 제2 회전날개를 감싸는 케이스로서, 달팽이관 형상으로 이루어지며, 제2 회전날개 로부터 분무된 분진수를 일방향으로 안내한다. 또한, 제2유도관은 제2 회전날개의 측면을 감싸는 제2내측면(미도시)과 제2 회전날개의 상부와 제2내측면의 외부를 감싸는 제2외측면으로 이루어질 수 있다. 이때, 제2 회전날개가 시계방향으로 회전하며 상방향으로 안내된 분무 상태의 분진수가 제2내측면과 충돌 하며 제2외측면 방향으로 안내되고, 제2외측면으로 안내된 분진수는 일방향으로 안내될 수 있다. 그리고, 제2유도관의 출구측에서 분진수를 이루는 분진의 입자에 따라 분급되어 분진수는 외부로 배출될 수 있다. 이때, 물분사체는 제2 회전날개의 날개가 접하는 제2수막을 형성시킨다. 그리고, 제2유도관의 출구에는, 제2유도관으로부터 안내되어 분급 낙하된 분진수를 배출하는 제2 배 수관이 구비될 수 있다. 이때, 제2 배수관은 제2수막이 형성된 제1 배수관보다 높은 위치에 형성될 수 있다. 그리고, 제2 배수관은 분급 낙하된 분진수 중 제1 배수관에서 분급되지 않았거나, 제2수막으로 부터 분무되어 제2유도관으로 안내된 분무 분진수가 낙하되어 제2 배수관으로 배출될 수 있다. 회전 감지 센서는 회전날개에 형성되어 회전날개의 회전 속도를 센싱하여 회전 속도를 페이트부 스 공기 정화 모니터링 장치에 제공한다. 이러한 회전 감지 센서는 제1 회전 감지 센서 및 제2 회전 감지 센서를 포함한다. 제1 회전 감지 센서는 제1 회전날개의 회전 속도를 센싱하여 회전 속도를 페이트부스 공기 정화 모니 터링 장치에 제공한다. 제2 회전 감지 센서는 제2 회전날개의 회전 속도를 센싱하여 회전 속도를 페이트부스 공기 정화 모니 터링 장치에 제공한다. 유도관은 회전날개에 의해 분무된 분진수를 일방향으로 안내한다. 이러한 유도관은 제1 유도관 및 제2 유도관을 포함한다. 제1 유도관은 제1 회전날개의 출구측에 형성되어 제1 회전날개에 의해 분무되면 분진의 입자에 따라 제1 배수관으로 낙하시키거나 제2 회전날개 방향으로 안내한다. 제2 유도관은 제2 회전날개를 감싸는 케이스로서, 달팽이관 형상으로 이루어지며, 제2회전날개 로부터 분무된 분진수를 일방향으로 안내한다. 또한, 제2유도관은 제2회전날개의 측면을 감싸는 제2내측면(미도시)과 제2회전날개의 상부와 제 2내측면의 외부를 감싸는 제2외측면으로 이루어질 수 있다. 배수관은 회전날개에 의해 분무된 후 낙하된 분진수를 외부옥외탱크에 배출시킨다. 이러한 배수 관은 제1 배수관 및 제2 배수관을 포함한다. 제1 배수관은 제1 유도관의 출구 하측에 형성되어 제1 유도관으로부터 안내된 분무 분진수가 분 급 낙하되면 고농도 분진수를 외부옥외탱크에 우선 배출시킨다. 이때, 제1배수관은 상부에 고농도 분 진수가 통과되는 배수개구부(미도시)가 형성될 수 있다. 제2 배수관은 제2 유도관의 출구 하측에 형성되며, 분급 낙하된 분진수 중 제1배수관에서 분급 되지 않았거나, 분무되어 제2유도관으로 안내된 분무 분진수가 낙하되면 고농도 분진수를 외부옥외탱크 에 우선 배출시킨다. 배수관 센싱 센서는 회전날개에 의해 분무된 분무 분진수가 분급 낙하되면 배수관을 통해 배수되는 분진양을 센싱한다. 이러한 배수관 센싱 센서는 제1 배수관 센싱 센서 및 제2 배수관 센싱 센서(15 2)를 포함한다. 제1 배수관 센싱 센서는 제1 배수관에 형성되어 제1 배수관을 통해 외부옥외탱크에 배출되 는 분진양을 센싱하여 페이트부스 공기 정화 모니터링 장치에 제공한다. 제2 배수관 센싱 센서는 제2 배수관에 형성되어 제2 배수관을 통해 외부옥외탱크에 배출되 는 분진양을 센싱하여 페이트부스 공기 정화 모니터링 장치에 제공한다. 외부옥외탱크에는 제1 배수관 및 제2 배수관을 통해 배출된 분진수가 저장되며, 제1 배수관 및 제2 배수관이 연결되는 파이프가 구비될 수 있다. 제1 배수관 및 제2 배수관으로부터 배출된 분진수가 1차 저장되는 1차 저장소, 1차 저장소에 저장된 분진수가 약품을 투입하여 정화된 분진수가 이동되는 2차저장소 및 3차저장소가 내측에 구비될 수 있다. 이때, 외부옥외탱크의 내부에는 분진을 흡착/처리하기 위하여 부상제, 필링제, 수질정화용 분말활성탄 등 이 순환되도록 이루어질 수 있다. 그리고, 외부옥외탱크에서 정화된 물은 펌프를 통해 페인트 부스 및 정화부스로 공급할 수 있다. 페이트부스 공기 정화 모니터링 장치는 복수의 센서(즉, 분진량 측정 센서, 회전 감지 센서, 배수관 센싱 센서)로부터 수신된 센싱 정보를 기초로 페이트부스의 공기 정화 과정을 모니터링하는 장치이다. 먼저, 페이트부스 공기 정화 모니터링 장치는 페이트부스로부터 유입된 유입 분진량, 배수관을 통해 배수 되는 배수 분진량 및 상기 회전날개의 회전 정보에 따라 상기 회전날개의 속도를 모니터링하여 상기 분진수의 분무량을 조절한다. 일 실시예에서, 페이트부스 공기 정화 모니터링 장치는 페이트부스로부터 유입된 분진량에 해당하는 기준 회전 속도 및 상기 회전 감지 센서로부터 수신된 회전 속도를 비교하고, 상기 비교 결과에 따라 상기 회전날개 의 회전 속도를 모니터링하여 상기 분진수의 분무량을 조절한다. 보다 구체적으로, 페이트부스 공기 정화 모니터링 장치는 미리 저장된 분진량 별 기준 회전 속도를 기초로 페이트부스로부터 유입된 분진량에 해당하는 기준 회전 속도를 추출한다. 그런 다음, 페이트부스 공기 정화 모니터링 장치는 페이트부스로부터 유입된 분진량에 해당하는 기준 회전 속도 및 제1 회전 감지 센서로부터 수신된 회전 속도를 비교하고, 비교 결과에 따라 제1 회전날개의 속도를 보정하여 분진수의 분무량을 조절한다. 일 실시예에서, 페이트부스 공기 정화 모니터링 장치는 분진량에 해당하는 기준 회전 속도 및 제1 회전 감 지 센서로부터 수신된 제1 회전 속도 사이의 차이 속도가 특정 속도 이하이면 제1 회전날개의 속도를 그대로 유지하도록 한다. 다른 일 실시예에서, 페이트부스 공기 정화 모니터링 장치는 분진량에 해당하는 기준 회전 속도 및 제1 회 전 감지 센서로부터 수신된 제1 회전 속도 사이의 차이 속도가 특정 속도 이상이면 상기 차이 속도만큼 속 도를 증가 또는 감소하도록 제1 회전날개의 속도를 모니터링한다. 상기와 같이, 페이트부스 공기 정화 모니터링 장치는 제1 회전날개의 속도를 모니터링한 후 제1 회전 감지 센서로부터 수신된 제1 회전 속도가 변경되었는지 여부를 판단한다. 만일, 페이트부스 공기 정화 모니터링 장치는 제1 회전 감지 센서로부터 수신된 제1 회전 속도가 변 경되었다고 판단되면, 제1 배수관 센싱 센서로부터 수신된 제1 배수관을 통해 외부옥외탱크로 배수되는 분진량에 따라 제1 회전 속도를 모니터링한다. 한편, 페이트부스 공기 정화 모니터링 장치는 제1 회전날개로부터 분무된 분진수 중 배출되지 않은 일부 분진량에 해당하는 기준 회전 속도 및 제2 회전 감지 센서로부터 수신된 제2 회전 속도를 비교하여 제2 회전날개의 속도를 보정한다.이때, 제1 회전날개로부터 분무된 분진수 중 배출되지 않은 일부 분진량에 해당하는 기준 회전 속도는 최 초 분진량에 해당하는 기준 회전 속도보다 느릴 수 있다. 이와 같은 이유는, 제1 회전날개에 의해 일부 배 출되고 남은 분진량은 최초에 유입된 분진량보다 적기 때문이다. 일 실시예에서, 페이트부스 공기 정화 모니터링 장치는 제1 회전날개로부터 분무된 분진수 중 배출되 지 않은 일부 분진량에 해당하는 기준 회전 속도 및 제2 회전 감지 센서로부터 수신된 제2 회전 속도 사이 의 차이 속도가 특정 속도 이하이면 제2 회전날개의 속도를 그대로 유지하도록 한다. 다른 일 실시예에서, 페이트부스 공기 정화 모니터링 장치는 제1 회전날개로부터 분무된 분진수 중 배출되지 않은 일부 분진량에 해당하는 기준 회전 속도 및 제2 회전 감지 센서로부터 수신된 제2 회전 속 도 사이의 차이 속도가 특정 속도 이상이면 상기 차이 속도만큼 속도를 증가 또는 감소하도록 제2 회전날개(2 0)의 속도를 모니터링한다. 상기와 같이, 페이트부스 공기 정화 모니터링 장치는 제1 회전날개의 속도를 모니터링한 후 제1 회전 감지 센서로부터 수신된 제1 회전 속도가 변경되었는지 여부를 판단한다. 만일, 페이트부스 공기 정화 모니터링 장치는 제1 회전 감지 센서로부터 수신된 제1 회전 속도가 변 경되었다고 판단되면, 제2 배수관 센싱 센서로부터 수신된 제1 배수관을 통해 외부옥외탱크로 배수되는 분진량에 따라 제2 회전 속도를 모니터링한다. 또한, 페이트부스 공기 정화 모니터링 장치는 미리 결정된 분진량 별 약품 투입 용량을 기초로 외부옥외탱 크에 저장된 분진량에 해당하는 약품 투입 용량을 결정하고, 상기 약품 투입 용량 만큼의 약품이 투입되도 록 약품 투입 밸브를 모니터링한다. 도 5는 본 발명의 다른 일 실시예에 따른 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템은 페이트부스 공기 정화 장치를 설명하기 위한 블록도이다. 도 1, 도 2, 도 3 및 도 5를 참조하면, 페이트부스 공기 정화 모니터링 장치는 수막(171, 172), 수위 측정 센서, 온도 측정 센서, 습도 측정 센서 및 온도 조절 장치를 더 포함할 수 있다. 수위 측정 센서는 수막(171, 172)에 위치하여 수막의 물 수위를 센싱하여 페이트부스 공기 정화 모니터링 장치에 제공한다. 이러한 수위 측정 센서는 제1 수위 측정 센서 및 제2 수위 측정 센서를 포함 한다. 이와 같은 이유는, 임펠라가 회전하면 배기팬에서 페인트부스에 분진 및 공기를 토출시키면 공기 바람 물이 토출되면서 임펠라의 회전 톱날 끝 부위 및 물 수위가 적정해야만이 수막을 많이 되기 때문에, 수위 측정 센서(171, 172)가 물 수위를 센싱하여 페이트부스 공기 정화 모니터링 장치에 제공하여 물 수위가 조 절되도록 한다. 따라서, 제1 수위 측정 센서는 제1 수막에 위치하여 수막의 물 수위를 센싱하여 페이트부스 공기 정 화 모니터링 장치에 제공하고, 제2 수위 측정 센서는 제2 수막에 위치하여 수막의 물 수위를 센 싱하여 페이트부스 공기 정화 모니터링 장치에 제공한다. 온도 측정 센서는 페이트부스 공기 정화 모니터링 장치의 내부 온도 정보를 센싱하여 페이트부스 공 기 정화 모니터링 장치에 제공한다. 습도 측정 센서는 페이트부스 공기 정화 모니터링 장치의 내부 습도 정보를 센싱하여 페이트부스 공 기 정화 모니터링 장치에 제공한다. 페이트부스 공기 정화 모니터링 장치는 페인트부스에서 공기중의 분진에 분사된 후 배출된 물의 양만 큼 물이 공급되도록 모니터링한다. 이를 위해, 페이트부스 공기 정화 모니터링 장치는 수위 측정 센서로부터 수신된 물 수위 및 기준 물 수위를 비교하여 물 수위가 기준 물 수위가 되도록 물이 공급되도록 한다. 또한, 페이트부스 공기 정화 모니터링 장치는 온도 측정 센서로부터 수신된 내부 온도에 따라 온도 조절 장치를 동작시켜 페인트부스의 온도가 조절되도록 한다. 이와 같은 이유는, 겨울철에 페인트부스 의 온도가 특정 온도 이하인 경우 온도 조절 장치를 동작시켜 온도를 기준 온도만큼 높이기 위해서이다. 일 실시예에서, 페이트부스 공기 정화 모니터링 장치는 온도 측정 센서로부터 수신된 내부 온도 및 기준 온도를 비교하여 차이 온도를 산출하고, 차이 온도가 특정 온도 이하이면, 습도 측정 센서로부터 수 신된 내부 습도 및 기준 습도를 비교하여 차이 습도를 산출하고, 차이 습도가 특정 습도 이하인지 여부에 따라 온도 조절 장치를 동작시켜 온도를 기준 온도만큼 높이도록 한다. 상기의 실시예에서, 페이트부스 공기 정화 모니터링 장치는 습도 측정 센서로부터 수신된 내부 습도 및 기준 습도를 비교하여 차이 습도를 산출하고 차이 습도가 특정 습도 이하이면, 온도 조절 장치를 동작 시켜 온도 및 습도를 기준 온도 및 기준 습도 각각에 해당되도록 높이도록 한다. 상기의 실시예에서, 페이트부스 공기 정화 모니터링 장치는 습도 측정 센서로부터 수신된 내부 습도 및 기준 습도를 비교하여 차이 습도를 산출하고 차이 습도가 특정 습도 이상이면, 차이 온도 및 차이 습도 각각 을 그래프 상에 표시한 후 그래프 사이의 간격이 특정 간격 이하인 횟수가 특정 횟수 이상이면 온도 조절 장치 를 동작시켜 온도 및 습도를 기준 온도 및 기준 습도 각각에 해당되도록 높이도록 한다. 다른 일 실시예에서, 페이트부스 공기 정화 모니터링 장치는 온도 측정 센서로부터 수신된 내부 온도 및 기준 온도를 비교하여 차이 온도를 산출하고, 차이 온도가 특정 온도 이상이면 온도 조절 장치를 동작 시켜 온도를 기준 온도만큼 높이도록 한다. 도 5는 본 발명에 따른 페이트부스 공기 정화 모니터링 장치의 내부 구조를 설명하기 위한 블록도이다. 도 5를 참조하면, 페이트부스 공기 정화 모니터링 장치는 정보 수신부, 분진량 별 기준 회전 속도 데 이터베이스, 회전 속도 별 기준 분무량 데이터베이스, 공기 정화 장치 모니터링부 및 정보 송신 부를 포함한다. 정보 수신부는 복수의 센서(즉, 즉, 분진량 측정 센서, 회전 감지 센서, 배수관 센싱 센서)로부 터 정보를 수신하여 공기 정화 장치 모니터링부에 제공한다. 먼저, 정보 수신부는 분진량 센서로부터 분진량를 수신하여 공기 정화 장치 모니터링부에 제공 한다. 이때, 분진량에 따라 제1 회전날개 및 제2 회전날개의 회전 속도를 상이하게 보정하여야 분무 되는 분진수의 분무량을 변경할 수 있다. 따라서, 분진수의 분무량은 제1 회전날개 및 제2 회전날개 의 회전 속도를 보정하는데 사용된다. 또한, 정보 수신부는 제1 회전 감지 센서 및 제2 회전 감지 센서 각각으로부터 제1 회전날개 및 제2 회전날개의 회전 속도를 수신하여 공기 정화 장치 모니터링부에 제공한다. 이때, 제1 회전날개 및 제2 회전날개의 회전 속도는 분진수의 분무량이 정확한지 확인하기 위해서 사용된다. 또한, 정보 수신부는 수위 측정 센서로부터 수신된 물 수위, 온도 측정 센서로부터 수신된 내부 온도 및 습도 측정 센서로부터 수신된 내부 습도 각각을 공기 정화 장치 모니터링부에 제공한다. 분진량 별 기준 회전 속도 데이터베이스에는 분진량 별 제1 회전날개 및 제2 회전날개 각각의 기준 회전 속도가 저장되어 있다. 즉, 페이트부스로부터 유입된 분진량이 상이하기 때문에, 분진량 별로 제1 회 전날개 및 제2 회전날개 각각의 기준 회전 속도를 분진량 별 기준 회전 속도 데이터베이스에 미리 저장하는 것이다. 회전 속도 별 기준 분무량 데이터베이스에는 제1 회전날개 및 제2 회전날개 각각의 회전 속도 별 기준 분무량이 저장되어 있다. 즉, 제1 회전날개 및 제2 회전날개 각각의 회전 속도에 따라 서로 다 른 높이로 분진수가 상향으로 분무하게 되기 때문에, 제1 회전날개 및 제2 회전날개 각각의 회전 속 도 별로 기준 분무량을 미리 저장하는 것이다. 공기 정화 장치 모니터링부는 정보 수신부로부터 수신된 정보를 기초로 페이트부스 공기 정화 장치의 다른 구성 요소의 동작을 모니터링한다. 이를 위해, 공기 정화 장치 모니터링부는 정보 수신부로부터 수신된 분진수 농도, 분진수 높이, 제1 회전 정보 및 제2 회전 정보를 기초로 상기 제1 회전날개 및 상기 제2 회전날개의 속도를 모니터링한 다.먼저, 공기 정화 장치 모니터링부는 페이트부스로부터 유입된 유입 분진량, 배수관을 통해 배수되는 배수 분진량 및 상기 회전날개의 회전 정보에 따라 상기 회전날개의 속도를 모니터링하여 상기 분진수의 분무량을 조 절한다. 일 실시예에서, 공기 정화 장치 모니터링부는 페이트부스로부터 유입된 분진량에 해당하는 기준 회전 속도 및 상기 회전 감지 센서로부터 수신된 회전 속도를 비교하고, 상기 비교 결과에 따라 상기 회전날개의 회전 속 도를 모니터링하여 상기 분진수의 분무량을 조절한다. 보다 구체적으로, 공기 정화 장치 모니터링부는 미리 저장된 분진량 별 기준 회전 속도를 기초로 페이트부 스로부터 유입된 분진량에 해당하는 기준 회전 속도를 추출한다. 그런 다음, 공기 정화 장치 모니터링부는 페이트부스로부터 유입된 분진량에 해당하는 기준 회전 속도 및 제1 회전 감지 센서로부터 수신된 회전 속도를 비교하고, 비교 결과에 따라 제1 회전날개의 속도를 보정하여 분진수의 분무량을 조절한다. 일 실시예에서, 공기 정화 장치 모니터링부는 분진량에 해당하는 기준 회전 속도 및 제1 회전 감지 센서 로부터 수신된 제1 회전 속도 사이의 차이 속도가 특정 속도 이하이면 제1 회전날개의 속도를 그대로 유지하도록 한다. 다른 일 실시예에서, 공기 정화 장치 모니터링부는 분진량에 해당하는 기준 회전 속도 및 제1 회전 감지 센서로부터 수신된 제1 회전 속도 사이의 차이 속도가 특정 속도 이상이면 상기 차이 속도만큼 속도를 증 가 또는 감소하도록 제1 회전날개의 속도를 모니터링한다. 상기와 같이, 공기 정화 장치 모니터링부는 제1 회전날개의 속도를 모니터링한 후 제1 회전 감지 센 서로부터 수신된 제1 회전 속도가 변경되었는지 여부를 판단한다. 만일, 공기 정화 장치 모니터링부는 제1 회전 감지 센서로부터 수신된 제1 회전 속도가 변경되었다고 판단되면, 제1 배수관 센싱 센서로부터 수신된 제1 배수관을 통해 외부옥외탱크로 배수되는 분 진량에 따라 제1 회전 속도를 모니터링한다. 한편, 공기 정화 장치 모니터링부는 제1 회전날개로부터 분무된 분진수 중 배출되지 않은 일부 분진 량에 해당하는 기준 회전 속도 및 제2 회전 감지 센서로부터 수신된 제2 회전 속도를 비교하여 제2 회전 날개의 속도를 보정한다. 이때, 제1 회전날개로부터 분무된 분진수 중 배출되지 않은 일부 분진량에 해당하는 기준 회전 속도는 최 초 분진량에 해당하는 기준 회전 속도보다 느릴 수 있다. 이와 같은 이유는, 제1 회전날개에 의해 일부 배 출되고 남은 분진량은 최초에 유입된 분진량보다 적기 때문이다. 일 실시예에서, 공기 정화 장치 모니터링부는 제1 회전날개로부터 분무된 분진수 중 배출되지 않은 일부 분진량에 해당하는 기준 회전 속도 및 제2 회전 감지 센서로부터 수신된 제2 회전 속도 사이의 차이 속도가 특정 속도 이하이면 제2 회전날개의 속도를 그대로 유지하도록 한다. 다른 일 실시예에서, 공기 정화 장치 모니터링부는 제1 회전날개로부터 분무된 분진수 중 배출되지 않은 일부 분진량에 해당하는 기준 회전 속도 및 제2 회전 감지 센서로부터 수신된 제2 회전 속도 사이의 차이 속도가 특정 속도 이상이면 상기 차이 속도만큼 속도를 증가 또는 감소하도록 제2 회전날개의 속도를 모니터링한다. 상기와 같이, 공기 정화 장치 모니터링부는 제1 회전날개의 속도를 모니터링한 후 제1 회전 감지 센 서로부터 수신된 제1 회전 속도가 변경되었는지 여부를 판단한다. 만일, 공기 정화 장치 모니터링부는 제1 회전 감지 센서로부터 수신된 제1 회전 속도가 변경되었다고 판단되면, 제2 배수관 센싱 센서로부터 수신된 제1 배수관을 통해 외부옥외탱크로 배수되는 분 진량에 따라 제2 회전 속도를 모니터링한다. 또한, 공기 정화 장치 모니터링부는 미리 결정된 분진량 별 약품 투입 용량을 기초로 외부옥외탱크에 저장된 분진량에 해당하는 약품 투입 용량을 결정하고, 상기 약품 투입 용량 만큼의 약품이 투입되도록 약품 투 입 밸브를 모니터링한다. 또한, 공기 정화 장치 모니터링부는 수위 측정 센서로부터 수신된 물 수위 및 기준 물 수위를 비교하 여 물 수위가 기준 물 수위가 되도록 물이 공급되도록 한다. 또한, 공기 정화 장치 모니터링부는 온도 측정 센서로부터 수신된 내부 온도에 따라 온도 조절 장치 를 동작시켜 페인트부스의 온도가 조절되도록 한다. 이와 같은 이유는, 겨울철에 페인트부스의 온 도가 특정 온도 이하인 경우 온도 조절 장치를 동작시켜 온도를 기준 온도만큼 높이기 위해서이다. 일 실시예에서, 공기 정화 장치 모니터링부는 온도 측정 센서로부터 수신된 내부 온도 및 기준 온도 를 비교하여 차이 온도를 산출하고, 차이 온도가 특정 온도 이하이면, 습도 측정 센서로부터 수신된 내부 습도 및 기준 습도를 비교하여 차이 습도를 산출하고, 차이 습도가 특정 습도 이하인지 여부에 따라 온도 조절 장치를 동작시켜 온도를 기준 온도만큼 높이도록 한다. 상기의 실시예에서, 공기 정화 장치 모니터링부는 습도 측정 센서로부터 수신된 내부 습도 및 기준 습도를 비교하여 차이 습도를 산출하고 차이 습도가 특정 습도 이하이면, 온도 조절 장치를 동작시켜 온도 및 습도를 기준 온도 및 기준 습도 각각에 해당되도록 높이도록 한다. 상기의 실시예에서, 공기 정화 장치 모니터링부는 습도 측정 센서로부터 수신된 내부 습도 및 기준 습도를 비교하여 차이 습도를 산출하고 차이 습도가 특정 습도 이상이면, 차이 온도 및 차이 습도 각각을 그래 프 상에 표시한 후 그래프 사이의 간격이 특정 간격 이하인 횟수가 특정 횟수 이상이면 온도 조절 장치를 동작시켜 온도 및 습도를 기준 온도 및 기준 습도 각각에 해당되도록 높이도록 한다. 다른 일 실시예에서, 공기 정화 장치 모니터링부는 온도 측정 센서로부터 수신된 내부 온도 및 기준 온도를 비교하여 차이 온도를 산출하고, 차이 온도가 특정 온도 이상이면 온도 조절 장치를 동작시켜 온도 를 기준 온도만큼 높이도록 한다. 도 6은 본 발명에 따른 페이트부스 공기 정화 모니터링 방법의 일 실시예를 설명하기 위한 흐름도이다. 도 6을 참조하면, 분진량 측정 센서는 페이트부스로부터 유입된 유입 분진량을 센싱하여 페이트부스 공기 정화 모니터링 장치에 제공한다(단계 S310). 회전날개의 회전에 의해 분진수가 상방향으로 분무하면 분무된 분무 분진수가 분급 낙하되면 배수관을 통해 외 부옥외탱크에 저장된다(단계 S320). 상기 회전날개의 일측면에 형성된 회전 감지 센서가 상기 회전날개의 회전 정보를 센싱하여 상기 페이트부스 공 기 정화 모니터링 장치에 제공한다(단계 S330). 상기 배수관의 일측면에 형성된 배수관 센싱 센서가 회전날개에 의해 분무된 분무 분진수가 분급 낙하되면 배수 관을 통해 배수되는 분진양을 센싱하여 상기 페이트부스 공기 정화 모니터링 장치에 제공한다(단계 S340). 상기 페이트부스 공기 정화 모니터링 장치가 상기 유입 분진량, 상기 배수 분진량 및 상기 회전날개의 회전 정 보에 따라 상기 회전날개의 속도를 모니터링하여 상기 분진수의 분무량을 조절한다(단계 S350). 상기 페이트부스 공기 정화 모니터링 장치가 상기 외부옥외탱크에 배수된 분진량에 따라 상기 외부옥외탱크에 유입되는 약품의 용량을 제어한다(단계 S360). 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 상기의 실시예에 한정되는 것은 아니며, 이는 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명 사상은 아래에 기재된 특허청구범위에 의해서만 파악되어야 하고, 이의 균등 또는 등가적 변형 모두는 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2023-0090228", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템을 설명하기 위한 네트워크 구성도이다. 도 2는 본 발명의 일 실시예에 따른 IoT 기술을 이용한 페이트부스 공기 정화 장치를 설명하기 위한 도면이다. 도 3은 본 발명의 일 실시예에 따른 IoT 기술을 이용한 페이트부스 공기 정화 장치의 분진수가 분무되어 배출되 는 일부 구성을 나타낸 확대도이다. 도 4는 본 발명의 일 실시예에 따른 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템을 설명하기 위한 블록도이다. 도 5는 본 발명의 다른 일 실시예에 따른 인공지능 기술을 활용한 페인트부스의 공기 정화 시스템을 설명하기 위한 블록도이다."}
