{"patent_id": "10-2023-0047478", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0151454", "출원번호": "10-2023-0047478", "발명의 명칭": "인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템 및 방법", "출원인": "주식회사 펄슨", "발명자": "반성윤"}}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보가 저장되어 있는 인물데이터베이스;복수의 연봉 비교 대상자의 인사정보, 조직정보 및 연봉정보가 저장되어 있는 시장데이터베이스; 및 상기 인물데이터베이스로부터 상기 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보를 수신 받아, 상기 연봉 협상 대상자의 연봉 인상률을 산출하는 연봉산출장치;를 포함하는 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템."}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 인사정보는,연봉 협상 대상자 및 연봉 비교 대상자의 성별, 나이, 직군, 직무, 경력, 전공, 자격증, 프로그래밍 정보 중 어느 하나 이상을 포함하며,상기 조직정보는,연봉 협상 대상자 및 연봉 비교 대상자의 회사규모, 회사위치 정보 중 어느 하나 이상을 포함하며,상기 연봉정보는,연봉 협상 대상자 및 연봉 비교 대상자의 임금지급형태, 인센티브 정보 중 어느 하나 이상을 포함하는 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템."}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 연봉산출장치는,상기 인물데이터베이스로부터 상기 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보를 수신 받는 데이터 수신부;인공지능 모델을 통해 시장데이터베이스를 필터링하여 복수의 연봉 비교 대상자 중 연봉 협상 대상자와 인사정보 및 조직정보가 가장 유사한 대상자들의 연봉정보를 매칭하는 데이터 필터링부; 상기 연봉 협상 대상자의 연봉정보와 연봉 비교 대상자들의 연봉정보를 비교하여, 상기 연봉 협상 대상자의 고정급(기본급, 복리후생, 수당, 상여금)과 변동급(성과급, 주식보상)이 연봉 비교 대상자들과 비교해 어느 수준인지를 분석하는 데이터 분석부; 및미리 설정된 옵션정보에 따라 상기 연봉 협상 대상자의 연봉 인상률을 산출하는 데이터 산출부;를 포함하는 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템."}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,공개특허 10-2024-0151454-3-상기 인공지능 모델은,직무별로 우선순위가 높게 설정된 정보를 기준으로 상기 연봉 협상 대상자와 연봉 비교 대상자들을 매칭하도록학습되는 클러스터링 알고리즘인 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템."}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 미리 설정된 옵션정보는,연봉 수준, 성과급 항목 및 연봉 기준이 사용자에 의해 설정된 것이며,상기 연봉 수준은 연봉 협상 대상자에게 지급하고자 하는 연봉이 시장 선도 수준, 시장 평균 수준 및 시장 추격수준 중 어디에 해당하는지 사용자에 의해 설정된 것이며,상기 성과급 항목은 연봉 협상 대상자에게 지급하고자 하는 성과급의 비중이 시장 선도 수준, 시장 평균 수준및 시장 추격 수준 중 어디에 해당하는지 사용자에 의해 설정된 것이며,상기 연봉 기준은 연봉 협상 대상자의 연봉 인상률을 산출함에 있어서 전문성 수준 및 경력 중 어디에 중점을둘 것인지 사용자에 의해 설정된 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템."}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "인물데이터베이스가 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보를 저장하는 A단계;시장데이터베이스가 복수의 연봉 비교 대상자의 인사정보, 조직정보 및 연봉정보를 저장하는 B단계; 및 연봉산출장치가 상기 인물데이터베이스로부터 상기 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보를 수신받아, 상기 연봉 협상 대상자의 연봉 인상률을 산출하는 C단계;를 포함하는 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 방법."}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제8항에 있어서,상기 인사정보는,연봉 협상 대상자 및 연봉 비교 대상자의 성별, 나이, 직군, 직무, 경력, 전공, 자격증, 프로그래밍 정보 중 어느 하나 이상을 포함하며,상기 조직정보는,연봉 협상 대상자 및 연봉 비교 대상자의 회사규모, 회사위치 정보 중 어느 하나 이상을 포함하며,상기 연봉정보는,연봉 협상 대상자 및 연봉 비교 대상자의 임금지급형태, 인센티브 정보 중 어느 하나 이상을 포함하는 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 방법."}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,공개특허 10-2024-0151454-4-상기 C단계는,데이터 수신부가 상기 인물데이터베이스로부터 상기 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보를 수신 받는 단계;데이터 필터링부가 인공지능 모델을 통해 시장데이터베이스를 필터링하여 복수의 연봉 비교 대상자 중 연봉 협상 대상자와 인사정보 및 조직정보가 가장 유사한 대상자들의 연봉정보를 매칭하는 단계; 데이터 분석부가 상기 연봉 협상 대상자의 연봉정보와 연봉 비교 대상자들의 연봉정보를 비교하여, 상기 연봉협상 대상자의 고정급(기본급, 복리후생, 수당, 상여금)과 변동급(성과급, 주식보상)이 연봉 비교 대상자들과비교해 어느 수준인지를 분석하는 단계; 및데이터 산출부가 미리 설정된 옵션정보에 따라 상기 연봉 협상 대상자의 연봉 인상률을 산출하는 단계;를 포함하는 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 방법."}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 인공지능 모델은,직무별로 우선순위가 높게 설정된 정보를 기준으로 상기 연봉 협상 대상자와 연봉 비교 대상자들을 매칭하도록학습되는 클러스터링 알고리즘인 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 방법."}
{"patent_id": "10-2023-0047478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 미리 설정된 옵션정보는,연봉 수준, 성과급 항목 및 연봉 기준이 사용자에 의해 설정된 것이며,상기 연봉 수준은 연봉 협상 대상자에게 지급하고자 하는 연봉이 시장 선도 수준, 시장 평균 수준 및 시장 추격수준 중 어디에 해당하는지 사용자에 의해 설정된 것이며,상기 성과급 항목은 연봉 협상 대상자에게 지급하고자 하는 성과급의 비중이 시장 선도 수준, 시장 평균 수준및 시장 추격 수준 중 어디에 해당하는지 사용자에 의해 설정된 것이며,상기 연봉 기준은 연봉 협상 대상자의 연봉 인상률을 산출함에 있어서 전문성 수준 및 경력 중 어디에 중점을둘 것인지 사용자에 의해 설정된 것을 특징으로 하는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 방법."}
{"patent_id": "10-2023-0047478", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템 및 방법에 관한 것으로, 더 욱 상세하게는 연봉 협상 대상자의 적정한 연봉 인상률을 인공지능 모델을 통해 산출할 수 있는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0047478", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템 및 방법에 관한 것으로, 더 욱 상세하게는 연봉 협상 대상자의 적정한 연봉 인상률을 인공지능 모델을 통해 산출할 수 있는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0047478", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "회사와 같이 다수의 구성원들이 속한 조직에서는 정기 또는 비정기적으로 구성원에 대한 연봉 협상이 이루어진 다. 일반적으로 이러한 구성원에 대한 연봉협상에 있어서, 개인, 조직의 성과 등 회사 내부 요인만이 주로 반영 되고 외부 시장데이터는 배제되는 경우가 많다.이럴 경우 외부 시장데이터가 반영되지 못함에 따라 적정연봉 수준에 대한 개인과 회사간의 인식의 차이가 크게 발생할 여지가 존재하며, 이로 인해 인재 유출 및 채용에 있어 문제가 발생하고 있다. 적정연봉에 대한 시장 수준을 파악하는 방법으로는, 대기업의 경우 시장보상수준에 대한 인사컨설팅을 의뢰하고 있으나, 중소기업의 경우 비용적 부담 등으로 인해 주로 채용사이트 혹은 임금정보시스템 등을 주로 활용하고 있다. 하지만 채용사이트 등에서 제시하는 수준은 단순 통계 기반의 기업 평균연봉 수준이거나 국민연금 추산 평균 급 여 정도만을 제시하고 있다. 따라서, 연봉협상, 연봉인상 등에 있어 정교한 시장데이터가 반영되어 인재에 대한 적정한 연봉 책정이 가능한 시스템의 개발이 필요한 상황이다."}
{"patent_id": "10-2023-0047478", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 이러한 필요성의 의해 창출된 것으로, 본 발명의 목적은 연봉 협상 대상자의 적정한 연봉 인상률을 인공지능 모델을 통해 산출할 수 있는 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템 및 방법을 제공하는데 있다. 본 발명의 해결과제는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 해결과제들은 아래의 기 재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0047478", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한, 본 발명에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비 스 제공 시스템은 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보가 저장되어 있는 인물데이터베이스; 복 수의 연봉 비교 대상자의 인사정보, 조직정보 및 연봉정보가 저장되어 있는 시장데이터베이스; 및 상기 인물데 이터베이스로부터 상기 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보를 수신 받아, 상기 연봉 협상 대상 자의 연봉 인상률을 산출하는 연봉산출장치를 포함하는 것을 특징으로 한다. 또한, 상기 인사정보는, 연봉 협상 대상자 및 연봉 비교 대상자의 성별, 나이, 직군, 직무, 경력, 전공, 자격증, 프로그래밍 정보 중 어느 하나 이상을 포함하며, 상기 조직정보는, 연봉 협상 대상자 및 연봉 비교 대 상자의 회사규모, 회사위치 정보 중 어느 하나 이상을 포함하며, 상기 연봉정보는, 연봉 협상 대상자 및 연봉 비교 대상자의 임금지급형태, 인센티브 정보 중 어느 하나 이상을 포함하는 것을 특징으로 한다. 또한, 상기 연봉산출장치는, 상기 인물데이터베이스로부터 상기 연봉 협상 대상자의 인사정보, 조직정보 및 연 봉정보를 수신 받는 데이터 수신부; 인공지능 모델을 통해 시장데이터베이스를 필터링하여 복수의 연봉 비교 대 상자 중 연봉 협상 대상자와 인사정보 및 조직정보가 가장 유사한 대상자들의 연봉정보를 매칭하는 데이터 필터 링부; 상기 연봉 협상 대상자의 연봉정보와 연봉 비교 대상자들의 연봉정보를 비교하여, 상기 연봉 협상 대상자 의 고정급(기본급, 복리후생, 수당, 상여금)과 변동급(성과급, 주식보상)이 연봉 비교 대상자들과 비교해 어느 수준인지를 분석하는 데이터 분석부; 및 미리 설정된 옵션정보에 따라 상기 연봉 협상 대상자의 연봉 인상률을산출하는 데이터 산출부를 포함하는 것을 특징으로 한다. 또한, 상기 인공지능 모델은, 직무별로 우선순위가 높게 설정된 정보를 기준으로 상기 연봉 협상 대상자와 연봉 비교 대상자들을 매칭하도록 학습되는 클러스터링 알고리즘인 것을 특징으로 한다. 또한, 상기 미리 설정된 옵션정보는, 연봉 수준, 성과급 항목 및 연봉 기준이 사용자에 의해 설정된 것이며, 상 기 연봉 수준은 연봉 협상 대상자에게 지급하고자 하는 연봉이 시장 선도 수준, 시장 평균 수준 및 시장 추격 수준 중 어디에 해당하는지 사용자에 의해 설정된 것이며, 상기 성과급 항목은 연봉 협상 대상자에게 지급하고 자 하는 성과급의 비중이 시장 선도 수준, 시장 평균 수준 및 시장 추격 수준 중 어디에 해당하는지 사용자에 의해 설정된 것이며, 상기 연봉 기준은 연봉 협상 대상자의 연봉 인상률을 산출함에 있어서 전문성 수준 및 경 력 중 어디에 중점을 둘 것인지 사용자에 의해 설정된 것을 특징으로 한다. 한편, 상기와 같은 목적을 달성하기 위한, 본 발명에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 방법은 인물데이터베이스가 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보를 저장하는 A단계; 시장데이터베이스가 복수의 연봉 비교 대상자의 인사정보, 조직정보 및 연봉정보를 저장하는 B단계; 및 연봉산출장치가 상기 인물데이터베이스로부터 상기 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보를 수신 받아, 상기 연봉 협상 대상자의 연봉 인상률을 산출하는 C단계를 포함하는 것을 특징으로 한다. 또한, 상기 인사정보는, 연봉 협상 대상자 및 연봉 비교 대상자의 성별, 나이, 직군, 직무, 경력, 전공, 자격증, 프로그래밍 정보 중 어느 하나 이상을 포함하며, 상기 조직정보는, 연봉 협상 대상자 및 연봉 비교 대 상자의 회사규모, 회사위치 정보 중 어느 하나 이상을 포함하며, 상기 연봉정보는, 연봉 협상 대상자 및 연봉 비교 대상자의 임금지급형태, 인센티브 정보 중 어느 하나 이상을 포함하는 것을 특징으로 한다. 또한, 상기 C단계는, 데이터 수신부가 상기 인물데이터베이스로부터 상기 연봉 협상 대상자의 인사정보, 조직정 보 및 연봉정보를 수신 받는 단계; 데이터 필터링부가 인공지능 모델을 통해 시장데이터베이스를 필터링하여 복 수의 연봉 비교 대상자 중 연봉 협상 대상자와 인사정보 및 조직정보가 가장 유사한 대상자들의 연봉정보를 매 칭하는 단계; 데이터 분석부가 상기 연봉 협상 대상자의 연봉정보와 연봉 비교 대상자들의 연봉정보를 비교하여, 상기 연봉 협상 대상자의 고정급(기본급, 복리후생, 수당, 상여금)과 변동급(성과급, 주식보상)이 연 봉 비교 대상자들과 비교해 어느 수준인지를 분석하는 단계; 및 데이터 산출부가 미리 설정된 옵션정보에 따라 상기 연봉 협상 대상자의 연봉 인상률을 산출하는 단계를 포함하는 것을 특징으로 한다. 또한, 상기 인공지능 모델은, 직무별로 우선순위가 높게 설정된 정보를 기준으로 상기 연봉 협상 대상자와 연봉 비교 대상자들을 매칭하도록 학습되는 클러스터링 알고리즘인 것을 특징으로 한다. 또한, 상기 미리 설정된 옵션정보는, 연봉 수준, 성과급 항목 및 연봉 기준이 사용자에 의해 설정된 것이며, 상 기 연봉 수준은 연봉 협상 대상자에게 지급하고자 하는 연봉이 시장 선도 수준, 시장 평균 수준 및 시장 추격 수준 중 어디에 해당하는지 사용자에 의해 설정된 것이며, 상기 성과급 항목은 연봉 협상 대상자에게 지급하고 자 하는 성과급의 비중이 시장 선도 수준, 시장 평균 수준 및 시장 추격 수준 중 어디에 해당하는지 사용자에 의해 설정된 것이며, 상기 연봉 기준은 연봉 협상 대상자의 연봉 인상률을 산출함에 있어서 전문성 수준 및 경 력 중 어디에 중점을 둘 것인지 사용자에 의해 설정된 것을 특징으로 한다."}
{"patent_id": "10-2023-0047478", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템 및 방법은 연봉 협상 대상자의 적정한 연봉 인상률을 인공지능 모델을 통해 산출할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0047478", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0047478", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이상의 본 발명의 목적들, 다른 목적들, 특징들 및 이점들은 첨부된 도면과 관련된 이하의 바람직한 실시 예들 을 통해서 쉽게 이해될 것이다. 그러나 본 발명은 여기서 설명되는 실시 예들에 한정되지 않고 다른 형태로 구 체화될 수도 있다. 오히려, 여기서 소개되는 실시 예들은 개시된 내용이 철저하고 완전해질 수 있도록 그리고 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 본 명세서에서 어떤 엘리먼트, 구성요소, 장치, 또는 시스템이 프로그램 또는 소프트웨어로 이루어진 구성요소 를 포함한다고 언급되는 경우, 명시적인 언급이 없더라도, 그 엘리먼트, 구성요소, 장치, 또는 시스템은 그 프 로그램 또는 소프트웨어가 실행 또는 동작하는데 필요한 하드웨어(예를 들면, 메모리, CPU 등)나 다른 프로그램 또는 소프트웨어(예를 들면 운영체제나 하드웨어를 구동하는데 필요한 드라이버 등)를 포함하는 것으로 이해되 어야 할 것이다. 또한, 어떤 엘리먼트(또는 구성요소)가 구현됨에 있어서 특별한 언급이 없다면, 그 엘리먼트(또는 구성요소)는 소프트웨어, 하드웨어, 또는 소프트웨어 및 하드웨어 어떤 형태로도 구현될 수 있는 것으로 이해되어야 할 것이다. 또한, 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되 는 '포함한다(comprises)' 및/또는 '포함하는(comprising)'은 언급된 구성요소는 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 또한, 본 명세서에서 '부', '장치' 등의 용어는 하드웨어 및 해당 하드웨어에 의해 구동되거나 하드웨어를 구 동하기 위한 소프트웨어의 기능적, 구조적 결합을 지칭하는 것으로 의도될 수 있다. 예를 들어, 여기서 하드웨 어는 CPU 또는 다른 프로세서(processor)를 포함하는 데이터 처리 기기일 수 있다. 또한, 하드웨어에 의해 구 동되는 소프트웨어는 실행중인 프로세스, 객체(object), 실행파일(executable), 실행 스레드(thread of execution), 프로그램(program) 등을 지칭할 수 있다.이하, 본 발명에서 실시하고자 하는 구체적인 기술내용에 대해 첨부도면을 참조하여 상세하게 설명하기로 한다. 도면에 도시된 각각의 구성은 기능 및 논리적으로 분리될 수 있음을 나타내는 것이며, 반드시 각각의 구성이 별"}
{"patent_id": "10-2023-0047478", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "도의 물리적 장치로 구분되거나 별도의 코드로 작성됨을 의미하는 것은 아님을 본 발명의 기술분야의 평균적 전 문가는 용이하게 추론할 수 있을 것이다. 도 1은 본 발명의 일실시예에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템의 블록구성도이며, 도 2는 본 발명의 일실시예에 따른 연봉산출장치의 블록구성도이다. 도 1에 도시된 바와 같이 본 발명에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템은 인물데이터베이스 , 시장데이터베이스, 및 연봉산출장치를 포함할 수 있다. 상기 인물데이터베이스는 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보가 저장되어 있으며, 상기 시장데이터베이스는 복수의 연봉 비교 대상자의 인사정보, 조직정보 및 연봉정보가 저장되어 있다. 이때, 상기 인사정보는, 연봉 협상 대상자 및 연봉 비교 대상자의 성별, 나이, 직군, 직무, 경력, 전공, 자격증, 프로그래밍 정보 중 어느 하나 이상을 포함할 수 있다. 또한, 상기 조직정보는, 연봉 협상 대상자 및 연봉 비교 대상자의 회사규모, 회사위치 정보 중 어느 하나 이상 을 포함할 수 있다. 또한 아울러, 상기 연봉정보는, 연봉 협상 대상자 및 연봉 비교 대상자의 임금지급형태, 인센티브 정보 중 어느 하나 이상을 포함할 수 있다. 상기 연봉산출장치는 상기 인물데이터베이스와 시장데이터베이스에 저장되어 있는 연봉 협상 대 상자의 인사정보, 조직정보 및 연봉정보와 복수의 연봉 비교 대상자의 인사정보, 조직정보 및 연봉정보를 이용 하여 상기 연봉 협상 대상자의 연봉 인상률을 산출할 수 있다. 또한, 도 2에 도시된 바와 같이, 상기 연봉산출장치는 연봉 협상 대상자의 연봉 인상률 산출을 위하여 데 이터 수신부, 데이터 필터링부, 데이터 분석부 및 데이터 산출부 구성을 더 포함할 수 있 다. 상기 각 구성요소(100, 200 또는 300)는 적어도 하나의 프로세서를 포함할 수 있다. 적어도 하나의 프로세서는 ASIC(Application Specific Integrated Circuit), DSP(Digital Signal Processor), PLD(Programmable Logic Device), FPGA(Field Programmable Gate Array), CPU(Central Processing unit), GPU(Graphic Processing Unit), 마이크로컨트롤러(microcontroller) 및/또는 마이크로프로세서(microprocessor) 등으로 구현될 수 있다. 각 구성요소(100, 200 또는 300)는 메모리를 더 포함할 수 있다. 메모리는 플래시 메모리(flash memory), 하드디스크(hard disk), SSD(Solid State Disk), RAM(Random Access Memory), SRAM(Static Random Access Memory), ROM(Read Only Memory), PROM(Programmable Read Only Memory), EEPROM(Electrically Erasable and Programmable ROM), EPROM(Erasable and Programmable ROM) 및/또는 eMMC(embedded multimedia card) 등과 같 은 저장매체를 포함할 수 있다.또한 각 구성요소(100, 200 또는 300)는 네트워크를 통해 연결될 수 있는데, 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망 의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi- Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스(Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 이하에서는 상기와 같이 구성되는 본 발명에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템을 통한 서비스 제공 방법에 대해서 도 3 내지 7을 통해서 상세하게 설명하도록 한다. 도 3은 본 발명의 일실시예에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 방법 순서 도이다. 도 3에 도시된 바와 같이, 본 발명에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템을 통한 서비스 제공 방법은 인물데이터베이스가 연봉 협상 대상자의 인사정보, 조직정보 및 연봉정보를 저장하는 단계(S100)와 시장데이터베이스가 복수의 연봉 비교 대상자의 인사정보, 조직정보 및 연봉정보를 저장하는 단계(S200) 및 연봉산출장치가 인물데이터베이스로부터 연봉 협상 대상자의 인 사정보, 조직정보 및 연봉정보를 수신 받아, 연봉 협상 대상자의 연봉 인상률을 산출하는 단계(S300)로 이루어 진다. 상기 단계(S100, S200)에서 인물데이터베이스 및 시장데이터베이스에 저장되는 정보는 인사정보, 조 직정보 및 연봉정보로 한정하지 않고 연봉 협상 대상자의 연봉 인상률 산출에 필요한 다양한 정보가 포함될 수 있다. 상기 단계(S300)에서는, 상기 인물데이터베이스 및 시장데이터베이스에 저장되어 있는 정보들을 이용 해서 연봉 협상 대상자의 연봉 인상률을 산출하는데, 이는 도 4와 같다. 도 4는 본 발명의 일실시예에 따른 연 봉산출장치의 연봉산출 방법 순서도이다. 도 4에 도시된 바와 같이, 상기 단계(S300)는 데이터 수신부가 인물데이터베이스로부터 연봉 협상 대상자 의 인사정보, 조직정보 및 연봉정보를 수신 받는 단계(S310)를 먼저 포함한다. 상기 단계(S310)에서 상기 데이 터 수신부는 상기 인사정보, 조직정보 및 연봉정보를 수신하여, 인사정보, 조직정보 및 연봉정보 중 연봉 인상률 산출에 필요한 정보만 추출하여 연봉 협상 대상자 프로필을 만들거나, 모든 정보를 이용하여 연봉 협상 대상자 프로필을 생성할 수 있다. 다음으로, 상기 단계(S300)는 데이터 필터링부가 인공지능 모델을 통해 시장데이터베이스를 필터링하여 복 수의 연봉 비교 대상자 중 연봉 협상 대상자와 인사정보 및 조직정보가 가장 유사한 대상자들의 연봉정보를 매 칭하는 단계(S320)를 포함한다. 상기 단계(S320)에서 상기 데이터 필터링부는 시장데이터베이스를 필터링 하여 복수의 연봉 비교 대상자 중 연봉 협상 대상자와 인사정보 및 조직정보가 가장 유사한 대상자들의 연봉 비 교 대상자 프로필 그룹을 생성할 수 있다. 또한, 생성된 연봉 비교 대상자 프로필 그룹을 연봉 협상 대상자 프 로필과 비교하여 연봉정보를 매칭할 수 있다. 상기 연봉 비교 대상자 프로필 그룹은 미리 설정한 형식에 맞게 생성되는데, 이때, 시장데이터베이스에서 수집 되는 데이터가 형식에 맞지 않을 경우 자동으로 형식에 맞게 전처리 되어 저장된다. 상기 인공지능 모델은 직무별로 우선순위가 높게 설정된 정보를 기준으로 상기 연봉 협상 대상자와 연봉 비교 대상자들을 매칭하도록 학습되는 클러스터링 알고리즘일 수 있다. 여기서 직무별로 우선순위가 높게 설정된 정 보라 함은 예를 들어 연봉 협상 대상자의 직무가 개발자일 경우에는 개발자가 사용하는 프로그래밍 언어일 수 있다. 또한, 상기 인공지능 모델의 학습을 위해 학습데이터세트, 검증데이터세트 및 테스트데이터세트가 사전에 준비 될 수 있으며, 다양한 알고리즘으로 인공지능 모델이 학습될 수 있다. 또한, 인공지능 모델의 성능을 상승시키기 위해 복수의 인공지능 모델을 학습시키고, 인공지능 모델의 하이퍼 파라미터를 최적화시키는 Bayesian Optimizer기법을 사용하여, 복수의 인공지능 모델의 민감도, 특이도, 정확도, PPV(positive predictive value), NPV(negative predictive value) 및 AUC (area under the ROC(receiver operating characteristic)) 점수 중 어느 하나 이상을 측정하여 가장 성능이 높은 인공지능 모 델을 선정할 수 있다. 다음으로, 상기 단계(S300)는 데이터 분석부가 연봉 협상 대상자의 연봉정보와 연봉 비교 대상자들의 연봉 정보를 비교하여, 연봉 협상 대상자의 고정급과 변동급이 연봉 비교 대상자들과 비교해 어느 수준인지를 분석하 는 단계(S330)를 포함할 수 있다. 상기 단계(S330)에서 상기 데이터 분석부는 분석한 결과를 시각화하여 사용자에게 보여줄 수 있는데, 이는 도 5 및 6과 같다. 도 5는 본 발명의 일실시예에 따른 데이터 분석부의 연 봉 비교 실시예시도이며, 도 6은 본 발명의 일실시예에 따른 데이터 분석부의 연봉 비교 다른 실시예시도이다. 도 5 및 6에 도시된 바와 같이, 사용자는 연봉 협상 대상자의 현재 연봉 수준이 연봉 비교 대상자들에 비해 어 느 정도인지를 한눈에 확인할 수 있다. 다음으로, 상기 단계(S300)는 데이터 산출부가 미리 설정된 옵션정보에 따라 연봉 협상 대상자의 연봉 인 상률을 산출하는 단계(S340)를 포함할 수 있다. 상기 단계(S340)에서 상기 미리 설정된 옵션정보는 연봉 수준, 성과급 항목 및 연봉 기준이 사용자에 의해 설정된 것일 수 있다. 또한, 상기 연봉 수준은 연봉 협상 대상자에게 지급하고자 하는 연봉이 시장 선도 수준, 시장 평균 수준 및 시 장 추격 수준 중 어디에 해당하는지 사용자에 의해 설정된 것일 수 있다. 또한 아울러, 상기 성과급 항목은 연봉 협상 대상자에게 지급하고자 하는 성과급의 비중이 시장 선도 수준, 시 장 평균 수준 및 시장 추격 수준 중 어디에 해당하는지 사용자에 의해 설정된 것일 수 있다. 또한 아울러, 상기 연봉 기준은 연봉 협상 대상자의 연봉 인상률을 산출함에 있어서 전문성 수준 및 경력 중 어 디에 중점을 둘 것인지 사용자에 의해 설정된 것일 수 있다. 상기 데이터 산출부는 상기한 바와 같은 미리 설정된 옵션 정보에 따라 연봉 인상률을 산출하는데, 이는 도 7과 같다. 도 7은 본 발명의 일실시예에 따른 데이터 산출부의 연봉 인상률 산출 실시예시도이다. 도 7에 도 시된 바와 같이, 미리 설정된 옵션 정보에 따라 연봉 협상 대상자의 연봉 인상률이 산출될 수 있다. 따라서, 상기한 바와 같이 본 발명에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시 스템 및 방법은 연봉 협상 대상자의 적정한 연봉 인상률을 인공지능 모델을 통해 산출할 수 있는 효과가 있다. 이상에서, 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합되거나 결합되어 동작하는 것으로 설명 되었다고 해서, 본 발명이 반드시 이러한 실시예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라 면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들 이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조 합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴 퓨터 프로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명 의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 저장매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽어지고 실행됨으로써, 본 발명의 실시 예를 구현할 수 있다. 한편, 이상으로 본 발명의 기술적 사상을 예시하기 위한 바람직한 실시 예와 관련하여 설명하고 도시하였지만, 본 발명은 이와 같이 도시되고 설명된 그대로의 구성 및 작용에만 국한되는 것이 아니며, 기술적 사상의 범주를 일탈함이 없이 본 발명에 대해 다수의 변경 및 수정 가능함을 당업자들은 잘 이해할 수 있을 것이다. 따라서, 그러한 모든 적절한 변경 및 수정과 균등물들도 본 발명의 범위에 속하는 것으로 간주하여야 할 것이다. 따라 서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2023-0047478", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 시스템의 블록구성도 도 2는 본 발명의 일실시예에 따른 연봉산출장치의 블록구성도 도 3은 본 발명의 일실시예에 따른 인공지능 기반 매칭 알고리즘을 통한 적정 보상 추천 서비스 제공 방법 순서 도 도 4는 본 발명의 일실시예에 따른 연봉산출장치의 연봉산출 방법 순서도 도 5는 본 발명의 일실시예에 따른 데이터 분석부의 연봉 비교 실시예시도 도 6은 본 발명의 일실시예에 따른 데이터 분석부의 연봉 비교 다른 실시예시도 도 7은 본 발명의 일실시예에 따른 데이터 산출부의 연봉 인상률 산출 실시예시도"}
