{"patent_id": "10-2018-0110826", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0036071", "출원번호": "10-2018-0110826", "발명의 명칭": "자율주행통합제어기를 이용한 지능형 자동주차 및 호출 시스템 과 플랫폼", "출원인": "한빛 세마텍", "발명자": "박상규"}}
{"patent_id": "10-2018-0110826", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 차량의 교통안내 및 안전한 자율주행 운행을 위한 통신망을 이용하여 도로 정보를 실시간으로 차량에게제공하는 교통안내플랫폼 ; 각종 내부 및 외부 센서 신호, 영상감지 신호, 신호기 신호, 타 차량인식, 보행자 및 위험물과 돌발물 인식,물체의 운동정보 파악, GPS, 자동항해등을 통하여 각종 정보를 제공받고 인지 및 판단하여 자동차의 자율적 운행이 가능하도록 하는 자율주행플랫폼 ; 사용자 자율주행차량의 자동주차 및 차량 호출을 위하여 최단거리 내에 빈 주차공간이 있는 주차장을 파악하거나 예약된 주차장의 주차정보를 사용자 차량에게 제공하고 안내하는 주차관제 플랫폼 ; 상기 주차관제플랫폼에서 선정되어 자율주행 차량을 안내하여 고진된 주차장 진입구에 도착한 후, 상기 사용자차량의 입구게이트 통과, 빈주차공간 고지, 자율주차, 호출정보 수신, 자율출차, 과금 및 결재, 출구게이트 통과까지, 자동적으로 제어되고 고속으로 작동하는 자동주차제어 플랫폼 ; 상기한 교통안내플랫폼, 주차관제 플랫폼 , 주차장 플랫폼과 무선통신 기술을 기반으로 연결되면, 상기한 교통정보, 주차장 정보, 입차, 주차 및 출차에 관련된 실시간 정보를 수신하고 사용차의 차량에게 자율주행플랫폼에 의한 자율주차를 명령하고 정해진 시간과 장소에 다시 차량을 호출하는 신호를 생성하여 명령하는 사용자 단말과 앱 (Apps : Application Softwares 응용소프웨어) ; 상기한 사용자 단말과로부터 장거기 무선통신으로 자율주차 및 호출의 목적을 명령을 지시받은 후 상기한 교통안내플랫폼, 주차관제 플랫폼 , 주차장 플랫폼들과 자율적으로 소통하며, 상기한 사용자 단말로부터의 명령의실행을 위하여 사용자의 차량에 장착된 각종 센서, 사진인식, 전자제어장치, 자동제어, 위치인식 (GPS), 네비게이션, 블랙박스 (Black Box), 웹(Web), 실시간 데이터분석등 다양한 기술을 융합하여, 각종 센서와 인식장치로부터 수신한 신호와 상기한 플랫폼들로부터의 정보등을 종합적으로 신속하게 분석하여 실행시키는 자율주행통합제어 장치 ; 를 포함하는 자율주행기술 기반의 통합적 스마트 자율주차 및 호출시스템"}
{"patent_id": "10-2018-0110826", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인간이 원하는 도심에서 원하는 가장 큰 문제중의 하나인 주차문제를 해결하기 위한 자율주행통합제어 기 (IADCC Integrated Autonomous Driving Car Controller) 를 이용한 스마트한 자동주차 및 호출시스템으로서, 이의 운용을 위하여는 통합된 유비쿼터스(편재) 센서 네트워크 IUSN (Integrated Ubiquitous Sensor Network)는 (뒷면에 계속)"}
{"patent_id": "10-2018-0110826", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트폰, 교통안내, 주차관제, 주차제어 플랫폼을 구축하고 이를 이용하여 도시 혹은 특정 지역에 가장 큰 불편사항인 주차문제를 해결하는 자율주행, 자율주차 및 차량호출시스템에 관한 것이다"}
{"patent_id": "10-2018-0110826", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "주지된 바와 같이 최근에는 전자 통신기술이 활발하게 개발되고 있으며, 이를 기반으로 종래에 음성통 화만을 수행하던 휴대폰이 컴퓨터로 진화하면서 무선데이터 통신, 각종 멀티미디어, 위성을 통한 위치안내, 카 메라 사진 및 영상 촬영, 음성인식등 다양한 기능이 탑재되어 컴퓨터와 동일한 성능을 발휘할 수 있게 되었으며, 생활에 필요한 다양한 정보등을 받거나 이러한 정보등을 활용하여 생활의 편리와 삶의 질 개선을 추 구할 수 있게 되었다. 또한, 최근에는 특정 iT기기가 인간에게 특정 정보 혹은 음악을 찾아 제공하거나, 비서 대행업무 제공등 인터넷 기기가 인간이 필요로 하는 특정 행위등을 대신하여 주는 인공지능 기술이 개발되어 응 용되고 있다. 사람이 용무를 보기 위하여 자동차를 운행하여 도심이나 특정지역에 진입하였을 때 주차하기 위하여 원하는 목 적지에 주차공간이 없는 경우, 목적지의 최근거리 내에 있는 주차공간을 찾아서 주차한 후 목표지점까지 이동하 여 용무를 본 후 다시 주차장까지 와서 차를 찾고 다시 재시동을 걸고 다음 목적지로 이동하는 데 많은 시간과노력이 소모된다. 도심이나 특정 단지 내에 주차장이 부족한 경우에는 이러한 문제는 더욱 심각해진다. 물론, 사용자가 용무를 보는 장소에 주차공간이 있다면 사용의 필요성은 없으나, 수많은 인간이 유동하는 도심지역에 서는 이러한 주차공간을 확보하거나 사용자가 주차공간을 찾는 것이 매우 어려운 현실이다. 도심 외각에 공용주차공간을 만들고 지하철 혹은 트램등과 같은 지역간 운송수단을 이용하여 대중운송수단까지 이동하는 방법등이 있으나 이는 자율성이 부족하거나 막대한 공용이동설비에 대한 투자비가 들어가거나, 사용자 가 추가적으로 이동해야 하는 등 편리성이 떨어지는 단점이 있다. 상기한 심각한 주차 문제를 해결하고자, 인공지능, iT , 인터넷, 스마트폰 앱, 자동화, 무선통신, 센서, GPS, 영상과 사물인식, 자동제어, 고속신호전달기술, 기지국관제 및 주차관제 시스템 기술등을 기반으로 한 자율주행 통합제어장치, 자율주행 플랫폼, 교통안내플랫폼 및 주차 플랫폼등이 필요하다. 필요한 무선통신 기술은 통신 기지국을 이용한 LTE (4G/5G)등 장거리 통신기술, WiMax 혹은 WAVE등 노변기지국과 빠르게 이동하는 차량간에 적용이 가능한 중거리 통신기술 및 주차제어시스템과 소통하는 블루투스, 지그비, 와이파이, RFID등 근거리 무 선통신 기술이 필요하다."}
{"patent_id": "10-2018-0110826", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 상기한 종래의 극심한 주차문제와 불편함을 해소하기 위하여 자율주행과 관 련 여러 플랫폼을 구축하고 이를 기반으로 한, 자율적 주차 및 차량 호출 시스템을 제공하는 것이다. 본 발명이 해결하고자 하는 과제는 우선적으로 차량의 교통안내 및 안전한 자율주행 운행을 위한 도로 정보를 실시간으로 차량에게 제공하는 중거리 통신기지국의 통신망을 이용하여 구축하는 교통안내플랫폼 ; 사용자 차 량의 자율주차 및 차량 호출을 위하여 최단 시간과 거리 내에 빈 주차공간이 있는 주차장을 파악하거나 예약된 주차장의 주차정보 사용자 차량에게 제공하고 안내하는 주차관제 플랫폼 ; ( 자율주행과 자율주차를 위하여 선 정된 ) 주차장 진입구에 도착한 후, 입구 게이트 통과, 주차, 호출정보 수신, 출차, 과금 및 결재, 출구 게이트 통과까지 고속으로 실행할 수 있는 주차장 플랫폼을 구축하여 자율주행과 자율주차를 위한 시스템 및 방법을 제 공하는 것을 목적으로 한다. 또한, 본 발명이 해결하고자 하는 과제는 상기한 교통안내플랫폼, 주차관제 플랫폼, 주차제어 플랫폼과 무선통 신 기술을 기반으로 사용자의 스마트폰과 스마트폰 앱 (Apps : Application Softwares : 응용소프웨어)으로부 터 장거기 무선통신으로 자율주차 및 호출의 목적을 명령을 하달 받은 후 이의 실행을 위하여 무선통신 인공지 능, 센서, 사진인식, 전자제어장치, 자동제어, 위치인식 (GPS), 내비게이션, 블랙박스 (Black Box), 웹(Web), 실시간 데이터 분석 등 다양한 기술을 융합하여, 각종 센서와 인식장치로부터 수신한 신호와 상기한 플랫폼들로 부터의 정보등을 분석하여 자율주행과 자율주차를 통합적으로 제어하고 실행시키는 자율주행통합제어 장치 ; 상 기 통합제어장치로부터 명령을 사용자 차량의 전자제어ECU에 하달하여 자율주행, 자율주차 및 차량호출명령을 실행함으로써 사용자가 최단 시간 내에 편리하게 주차하고 용무를 마친 후 차량을 재호출하여 다음 목적지로 이 동할 수 있도록 효율적이고 지능적인 플랫폼들과 시스템 구축, 이를 운용하는 장치와 방법을 제공하는 것을 목 적으로 한다."}
{"patent_id": "10-2018-0110826", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명을 따르면, 안전한 교통안내 시스템, 자동주차 및 호출시스템 호출시스템과 각 플랫폼등을 기반으로 사 용자가 용무를 보고 싶은 장소에서 내려서 자유롭게 실시간으로 일을 볼 수 있도록 스마트폰 앱과 자율주행통합 제어장치에 의하여 최단 거리 내에 빈 주차 공간을 자동으로 검색하여 발견한 후, 사용자 차량을 안전 안내하고 자율주행하여 자동으로 지정 주차장에 주차하고 ; 또한 사용자가 시간과 장소를 지정하여 차량을 호출하였을때 이를 주차장에 주차되어 있는 차량에 신호를 전달하고 출차하여 자율주행방식으로 사용자에게 다시 전달함으 로써 사용자가 자동차의 주차에 신경 쓸 필요 없이 편리하게 용무를 볼 수 있는 편의성과 효율성을 제공할 수 있다. 본 발명을 따르면 주차난과 교통체증이 심각한 특정 지역 내에 교통안내플랫폼, 주차관제 플랫폼 , 주차장 제어 플랫폼의 구축되어 무선통신, iOT, 인공지능, 융합되어 스마트 유동성 (smart mobility)를 제공하는 효과가 있 다. 본 발명을 따르면, 차량 내에 자율주행통합제어장치 설치하여 사용자의 스마트폰 앱(apps)을 사용하여 자율주행, 자율주차, 차량호츨을 자유롭고 안전하게 실행시킴으로써 각 개인이 주차와 교통체증으로 인하여 소 모하는 엄청난 시간과 노력을 절감시키는 효과가 있다. 또한, 본 발명을 따르며, 교통과 도로의 빅데이터를 수집하여 첨단 정밀지도서비스플랫폼의 구축과 운영이 가능 하여 보다 정밀한 자율주행을 위한 정밀 지도와 안내데이터를 제공하는 획기적인 효과가 있다 또한, 주차 공간을 찾느라고 헤매는 차량들을 최단 시간 내에 고속으로 대량의 방법으로 주차시키고 출차함으로 써 해당 지역의 모빌리티를 지능적으로 향상시켜 교통체증을 획기적으로 절감시킬 수 있는 효과가 있다."}
{"patent_id": "10-2018-0110826", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 충분히 이해하기 위해서 본 발명의 바람직한 실시예를 첨부 도면을 참조하여 설명한다. 그러나 본 발 명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에 서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 사람이 용무를 보기 위하여 자동차를 운행하여 도심이나 특정지역에 진입하였을 때 사용자는 용무를 보기 위한 위치와 주차가 가능한 위치가 상이한 경우, 주차가 가능한 장소를 찾는 데 어려움이 있고 따라서 많은 시간을 소모하고 있다. 특별히 이러한 주차 문제는 차량운행이 많고 주차 공간이 부족한 도심에 심각한 문제가 되어 있 으며 모든 자동차 운전자에게 많은 불편을 끼치고 있다. 또한 대학이나 특정 산업단지, 주차 공간이 부족한 특정 지역, 혹은 주차장과 목적지와 많이 떨어져 있는 경우에도 효율적으로 주차를 하고 용무를 보는 문제는 아 직도 해결되고 있지 않다. 본 발명에서는 인간이 원하는 도심에서 원하는 가장 큰 문제중의 하나인 주차문제를 해결하기 위한 자율주행통 합제어기 (IADCC Integrated Autonomous Driving Car Controller 혹은 Integrated Autonomous Driving Car Control System) 를 이용한 스마트한 자동주차 및 호출시스템이다. 이 자율주행에 의한 자율주차를 실현하기 위 하여 본 발명에서는 자율주행통합제어기를 개시하여 제안한다 자율주행통합제어기 다음의 기술들과 통합되어 운용되어야 한다. 그 기술들은 스마트폰과 앱 소프트웨어와의 무선소통, 차량의 자동제어, 차량의 ECU로부터의 차량의 고유정보 수신, 차량 전후방 인식, 도로 차선 인지, 교 통신호기 인지, 고성능 카메라와 센서, 위치추적 (GPS : Graphical Positioning System), 자율주행, 중거리와 장거리 이동통신, 중거리 통신방식과 기지국, 교통안내플랫폼 및 주차관제 플랫폼, 차량인식을 위한 근거리통 신방식, 고속 주차제어 시스템, 자동결재시스템 등을 포함한다. 관련된 핵심장치로는 자율주행통합제어기 (센서, 카메라, 레이더, 라이다, GPS, 중장거리통신모듈 포함), 스마트폰, 기지국 및 관제센터, 중장거리 통신 장치 (WAVE 혹은 4G/5G), 근거리 무선통신장치 (블루투스/와이파이 /지그비), 차량인식센서 (지자기, 초음파, RFID), 자동차의 전자제어장치 (Electronics Control Unit), 빈 주차 공간의 데이터를 공유하며 효울적으로 주 차장을 배분하여 안내하는 주차관제시스템과 고속으로 자동화된 기계식 주차장 혹은 인데스화된 주차장을 운영 하여 주차시키는 주차제어시스템을 포함한다. 상기한 플랫폼, 자동제어장치 , 각종센서, 통신을 이용한 자율 주행 주차를 위한 방법의 전체 구성도를 개략 적으로 도1에 예시하였다. 즉, 본 발명은 도 1에 보듯이 유비쿼터스(편재) 센서 네트워크 (Ubiquitous Sensor Network : 이후 'USN'이라 명칭함 )을 구축하여 자율주행과 자율주차를 실행하여 편안함과 시간의 효율성을 추 구하고자 함이다. USN'이란 필요한 모든 사물에(Ubiquitous) 태그를 부착하고, 컴퓨팅능력과 통신기능을 부여해 사물과 환경을 자동으로 인식하고 (Sensor) 네트워크 (Network)를 통해 실시간 정보를 구축, 활용토록 하는 통 신망이다. 본 발명에서는 자율주행에 의하여 자율 주차를 하고 호출하는데 필요한 최적의 플랫폼과 실행하는 장치로 구성된다. 도1에서 보는 바와 같이, 자율주행플랫폼, 교통안내플랫폼, 주차관제풀랫폼, 주차제어플랫폼 으로 구성된다. 각 플랫폼에는 각 플랫폼을 운영하는 메인 서버 혹은 컴퓨터가 존재한다. 자율주행플랫폼은 사 용자의 차량, 자율주행통합제어기와 ECU가 주체이며, 각 산하에 각종 센서, 영상감지, 각종 차량 내부센서, 실 행장치, 무선망이 있다. 교통안내플랫폼은 교통관제센터가 중심이 되고, 복수개의 교통기지국으로 구성되며, 그 산하에 각종센서와 영상감지, 무선망이 존재하며 이를 기반으로 상기 교통안내플랫폼의USN을 형성하고 차량의 자율주행통합제어기에 필요한 안전한 교통정보를 제공한다. 주차관제플랫폼은 중앙에 주차관제센터가 있어 복수 개의 주차장으로부터 사전에 파악된 기본정보와 각 주차장 별 현재의 주차장 운영현황을 파악하여 필요 시에 주 차정보를 실시간으로 자율주행플랫폼에 제공한다. 주차제어플랫폼은 자동기계식 주차장의 경우에, 인덱스화된 주차공간 셀, 차량반송로봇, 영상감지, 근거리 혹은 중거리 무선망을 기본으로 상기 플랫폼의 USN을 구성하며, 차량이 지정된 주차장에 도착한 후 자동주차제어시스템이 차량을 인계 받아, 최단 시간 내에 안전하게 주차시키 고 사용자가 호출하는 시간에 예측 제어하여 과금, 결재 후에 사용자에게 재전달할 수 있도록 상기 차량을 출차 시키는 플랫폼이다. 도 1에 예시된 바와 같이 본 발명은 교통안내플랫폼, 주차관제 플랫폼, 자율주행 플랫폼, 주차제어플랫폼과 각 플랫폼에서 기능을 실행하는 각 시스템 및 장치를 기반으로 하여, 사용자가 사용자의 스마트폰을 이용하여 차 량 내에 설치된 자율주행통합제어기(장치)에 명령하여 자율주행에 의한 자율주차를 하도록 하는 것을 포함한다. 본 발명에 필요한 플랫폼 자율주행 플랫폼, 교통안내플랫폼 , 주차관제 플랫폼, 주차제어 플랫폼, 정밀지도플랫폼 플랫폼이란 구체적으로 \"새로운 기술·프로그램·프로세스·서비스가 발전할 수 있는 기반 기술, 운용 소 프트웨어, 네트워크, 또는 생태계\"를 의미한다 .본 발명에 포함하고 있는 플랫폼은 안전한 교통안내를 위한 자 율주행 플랫폼 , 교통안내 플랫폼 , 주차관제 플랫폼 , 주차제어 플랫폼시스템이다. 주차 및 출차를 제어하고 관리하는 주차제어 운영방식을 주차제어 플랫폼이라하고 이를 구체적으로 실행, 제어, 관리하는 주차장에 설치된 로봇을 포함한 각종 플랫폼 대신 주차제어시스템('주차제어기' 혹은 '주차제어장 치')이라 명명한다. 이 기계화된 혹은 주차정보가 시스템화 된 주차장과 차량간의 정보를 관리 및 제어하는 주 차 네트워크를 관제하는 플랫폼이 주차관제 플랫폼이다. 자율주행플랫폼은 각종 센서 신호, 신호기 신호, 타 차 량인식, 보행자 및 위험물/돌발물 인식, 물체의 운동정보 파악, GPS, 자동항해등을 통하여 각종 정보를 제공받 고 인지 및 판단하여 자동차의 자율적 운행이 가능하도록 하는 플랫폼이다. 본 발명의 \"자율주행에 의한 자율주차를 구성하는 복수개의 플랫폼, 넷트워크, 통신, 구성장치 요소, 운 영방법은 기지국관제센터, 기지국-차량간 (V2I), 차량들간 (V2V)에 통신하여 도로, 교통 및 사고 상황등에 대한 안내등 정보를 주고 받는 네트워크를 포함하는 교통안내 플랫폼 ; 주차관제센터-주차장-차량간 소통하여 주차공간을 예약하거나, 빈 주차공간정보를 파악하여 전달하는 네트워크 를 포함하는 주차관제 플랫폼 ; 교통안내플랫폼과 주차관제플랫폼과 소통하여 자동차가 자율주행 할 수 있도록 것을 네트워크를 포함하는 자율 주행플랫폼 (시스템) ; 상기한 플랫폼들과 융합하여 소통하며, 자율주행하여, 최단거리 내의 최단 시간 내에 지정된 주차장을 찾아가는 명령을 실행하는 자율주행통합제어기 ; 상기 자율주행통합제어기는 1) 4G(/5G)장거리 통신수단을 통하여 사용자로부터 명령을 받고 자율주행과 자율주 차 상황을 실시간으로 보고하고 ; 2) WAVE 중거리 무선통신방식을 통하여 교통안내 플랫폼으로 전반적인 교통 안내를 받고 ; 3) 주차관제 플랫폼으로부터 빈 주차공간을 가지고 있는 주차장의 위치를 실시간으로 파악하고 정보를 전달하고, 예약을 받거나, 혹은 사용자에게 확인하여 정해진 시간에 주차공간을 예약하고 ; 4) 자율주 행 플랫폼에 의하여 차량의 현재 위치로부터 지정된 주차장의 위치까지 자율주행 에 위하여 찾아가고 ; 5) 상기 주차장의 도달한 후 주차제어시스템과 소통하여 차량을 입고시키거나 사용자의 호출명령에 의하여 결재 후 출차 시키는등 주차 관련 모든 행위를 수행하는 것을 포함하는 장치 ; 사용자의 스마트폰에 설치되어 상기 자율주행통합제어기에게 자율주차 혹은 차량호출을 명령하거나 , 상기 자율 주행통합제어기로부터 자동차의 주행상황, 주차 및 차량 호출 신호를 주고 받으며 현재의 차량의 주행/주차/호 출/사고 상황을 실시간으로 모니터링하며 보고 받는 것을 포함하는 스마트폰 앱 ; 사용자 스마트폰 앱 의 명령에 따라, 주변의 주차장을 검색하여 최단거리, 최단시간 내에 도달할 수 빈 주차공 간이 있는 주차장을 파악할 수 있는 검색기능이 구비되거나, 주차관제 플랫폼과 소통하여 최적의 주차장을 전달 받거나, 혹은 사용자의 스마트폰 앱으로부터 예약된 주차장정보를 하달받아서 이를 찾아가는 기능을 포함하는 자율주행통합제어기 ; 상기 통합제어기는 사용자의 차량에 이미 설치되어 있거나 설치하여 사용할 타 차량인지센서, 보행자인지센서, 신호기인지센서, 사물인지 센서, 사물의 운동정보와 위치 감지기, 위치센서(GPS)모듈, 가속도센서모듈등과 이들 로부터 신호를 받아 인식하고 내부의 CPU로부터 사용자 차량의 ECU에게 자율주행 실행 명령을 내리고 (시동, 운 행, 제동, 정차, 주차, 전원오프 등의) 동작을 제어하고 실행하며, 자율주행과 주차상황을 파악하여 그 결과를 사용자에게 보고하고 수단을 포함하는 자율자율주행통합제어기 ; 상기한 바와 같은 자율주행통합제어기로부터 주행 명령을 실행 명령을 하달 받고 실행하는 각 사용자의 차량에 내재되어 있는 ECU (전자제어장치 ) ; 상기 자율주행통합제어기가 자동차의 각종 신호 , 사물인지 (차량, 보행자, 위험물 ; 신호인식), 및 상황인지과 정을 통하여 운행에 관한 사항을 파악하여 상기 ECU에게 동작조절 명령 (조향 操向, 속도, 시동, 주차등 ) 을 전달하거나 ECU로부터 자동차 자체의 상태와 운전조건을 등을 파악하여 자율주행통합제어기로 송수신하는 신호전달시스템 ; 사용자의 차량에 설치되어 있는 혹은 자율주차를 위하여 설치할 복수의 센서 ( 운전을 위한 센서 - 전방센서 , 후방센서 , 측면센서, 조향, 가속, 감속의 속도센서, 기울기 센서 및 위치센서 ) ; 자동차 내부의 자동차 동작을 위한 센서류 : 전원, 산소, 쓰로틀 밸브 각도, 각종 (냉각수, 엔진) 온도, 압력, 기체유량, 도어, 주차). 키인식 (소유자)센서와 이로부터 신호를 전달하는 장치; 각 사용자의 차량에 설치되어 물체를 인식하거나, 사진 혹은 영상을 저장하고 전달하는 블랙박스 혹은 카메라 (전방 후방)등에 의하여 물체를 인식하는 비전 (vision)장치 ; 각 사용자의 차량에 설치되어 움직이는 물체의 운동 정보와 위치를 정밀하게 측정하여 전달하는 하는 라이다 (Lidar)장치 ; 각 사용자의 차량에 설치되어 교통안내와 교통안전에 최대한 확보하는 중거리 WAVE 통신 방법을 기반으로 하여 WAVE 설치 차량과 WAVE 기지국으로부터 각종 도로 상황등을 종합하고, 제어하며, 전달하는 기지국관제센터와 ; 주차관제플랫폼으로 통보받은 위치의 주차장으로 자율주행통합제어기에 의하여 자율주행하여 도달한 후, 자율주 행통합제어기와 소통하여 정해진 주차공간에 주차시키거나, 다시 사용자의 호출에 따라 자동으로 과금 및 결재 차량을 출차시키는 고속 주차제어시스템 ; 자율주행통합제어기와 주차제어시스템이 소통하는 저에너지 블루투스 (Blooth Low Energy BLE), 와이파이, 지그 비 (ZigBee), 혹은 RFID를 이용한 DSRC (Dedicated Short Range Communications) 근거리 통신 방식 ; 출차 후 재시동하여 주차장으로부터 나와서 교통안내 플랫폼과 소통하며 사용자의 위치까지 자동차를 다시 전달 할 수 있도록 자율주행플랫폼과 이를 기반으로 하는 자율주행통합제어기 ; 최적 경로, 교통, 도로, 날씨 및 3차원 도로 환경 정보(차선 정보, 가드레일, 도로 곡률경사, 신호등 표지판 위 치, 교통 표식)등 교통관련 정보등을 상기한 자율주행통합제어기 혹은WAVE모뎀이 장착된 차량들이 수집하여 정 밀지도를 최신상태로 유지하여 최신 교통정보 및 자율주행 관련 다양한 서비스를 실시간으로 제공함을 물론 사 용자 차량의 에너지를 절감하는 방법을 구현시키는 정밀지도 플랫폼 ; 를 포함하여 구성하고 동작하는 것을 특징으로 한다. 상기 관련 내용은 도 1 내지 도 5 에 도시하여 나타내었 다. 본 발명은 자율주행방법에 의한 자율주차를 실시하기 위하여, 종합적인 USN (Integrated Ubiquitous Sensor Network)을 구성하여 각 사용자가 사용자의 스마트폰 앱을 이용하여 사용자의 차량 내에 설치된 상기 자율주행 통합제어기에 주차 혹은 호출 명령을 하달하면, 상기 사용자의 차량의 자율주행통합제어기는 차량 내부와 외부 의 각종 센서, 카메라등 측정장치와 유무선 통신망등을 기반으로 주변도로, 타 차량, 보행자, 신호등, 위험물을 인지하고, 통합제어기 내부의 장거리/중거리/근거리 무선통신모듈을 통하여 WAVE기지국과 기지국관제센터, 주차 장의 주차제어시스템, 주차관제센터와 자율적으로 소통하며 정보를 교환함으로써, 자율적으로 주차공간을 찾아 서 (Automatic Parking Lot Finding and Tracking System)와 기지국간의 교통정보를 이용하여 안내하는 안전한 교통안내시스템 (Automatic Traffic Guidance System : ATSGPS) 에 관련한 방법과 이를 실행하는 자율주행통합 제어기에 관한 것이다. 본 발명은 상기의 상세한 설명에서 언급되는 형태로만 한정되는 것은 아님을 잘 이해할 수 있을 것이다. 따라서 본 발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다. 또한, 본 발명은 첨부된 청구범위에 의해 정의되는 본 발명의 정신과 그 범위 내에 있는 모든 변형물과 균등물 및 대 체물을 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2018-0110826", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명의 자율주행에 의한 자율주차는 다양한 플랫폼과 장치, 기술들이 복합되어 포함되므로 각 플랫폼별로 나 누어 다음과 같이 보다 상세히 진술한다.자율주행 플랫폼, 자율주행통합제어기 및 자율주행 차량 자율주차를 위하여 인공지능을 기반으로 하는 사용자 차량의 자유주행기술이 복합된다. 자율주행자동차란 운전 자의 개입 없이 주변 환경을 인식하고, 주행 상황을 판단하여, 차량을 제어함으로써 스스로 주어진 목적지까지 안전하게 주행이 가능한 자동차를 말한다. 이러한 운전자가 차량을 조작하지 않아도 스스로 주행하는 자율주행 자동차는 교통사고를 줄이고 교통 효율성을 높이며 연료 및 에너지를 절감하고 운전을 대신해줌으로써, 편의를 증대시킬 수 있는 미래 개인 교통수단이 될 것으로 기대된다. 최근에 차량의 자율주행에 대한 연구가 진행되고 있지만 아직도 교통안전상의 문제가 있어 특히 중장거리를 자동차가 독단적이고 자율적으로 주행하도록 하는 부 분활용을 하기에는 아직도 많은 한계가 있다. 자동차의 자율주행은 크게 하드웨어, 소프트웨어 , 컴퓨팅 , 통신 , 지도위치(GPS)및 내비게이션 서비스, 주차 장 관제등 등 세부 분야로 나뉘어 진다. 자율주행자동차의 하드웨어는 크게 차체와 센서로 나뉘어 진다. 차체 는 탑승자를 위한 공간, 조향, 가속, 감속제어 시스템이다. 센서는 운전자와 차얀내 부 외부 정보를 측정하는 인지장치를 말한다. 자율주행플랫폼 구축에 필수적인 사항은 안전성, 내구성, 가격, 사회적인 인식과 합의등이 다. 자율주행에 필요한 자율주행통합제어기, 카메라등 각종 센서 네트워크 (USN for Autonomous Driving) 자율주행자동차란 운전자의 개입 없이 주변 환경을 인식하고, 주행 상황을 판단하여, 차량을 제어함으로써 스스 로 주어진 목적지까지 안전하게 주행이 가능한 자동차를 말한다. 즉, 운전자가 차량을 조작하지 않아도 스스로 주행하는 자동차로 차 세대 자동차 산업으로 주목받고 있는 기술이다. 이러한 자율주행 자동차는 교통사고를 줄이고 교통 효율성을 높이며 연료를 절감하고 운전을 대신해줌으로써, 편의를 증대시킬 수 있는 미래 개인 교 통수단이 될 것으로 기대된다. 최근에 차량의 자율주행에 대한 연구가 진행되고 있지만 아직도 교통안전상의 문 제가 있어 특히 중장거리를 자동차가 독단적이고 자율적으로 주행하도록 하는 부분활용을 하기에는 아직도 많은 한계가 있다. 본 발명에서는 인간이 원하는 도심에서 원하는 가장 큰 문제중의 하나인 주차문제를 해결하기 위한 자율주행통 합제어기 (IADC Integrated Autonomous Driving Car Controller 혹은 Integrated Autonomous Driving Car Control System) 를 이용한 스마트한 자동주차 및 호출 시스템이다. 이 발명의 실현을 위하여는 자율주행통합제 어기는 다음의 기술들과 통합되어 운용되어야 한다. 스마트폰과 구동 소프트웨어, 차량의 자동제어, 차량의 ODD 로부터의 차량의 고유정보 수신, 차량 전후방 인식, 도로 차선 인지, 교통신호기 인지, 고성능 카메라와 센서, 위치추적 (GPS : Graphical Positioning System), 내비게이션 항해, 자동결재시스템, 중거리와 장거리 이동통 신 기지국과 통신방식, 주차관제 시스템 등이다. 관련된 핵심장치로는 자율주행통합제어기 (센서, 카메라, 레이 다 (Radar), 라이다 (Lidar), GPS, 중장거리통신모듈 포함), 스마트폰, 기지국등 통신설비, 통신장치 (WAVE 혹 은 LTE (3G/4G/5G) ) 자동차의 전자제어장치 (Electronics Control Unit), 주차관제플랫폼과 자동화된 주차장 등이다. 정해진 일정 경로를 따라 이동하는 자율적인 교통수단에서는 교통안전(Traffic Guidance and Traffic Safety)이 필수적이다. 안전상황이 발생한 경우, 사상자가 발생하고 운행차량 등 중요한 인적 물질적 자산에 심각한 손실 이 오므로, 이러한 경우에, 선로 상에 운행방해 물체 혹은 사람이 있을 경우에 자동 돌발 검지 시스템이 필요하 며, 이에 의하여 기지국 센터, 후방 차량, 구조센터에 자동 고지되어 추가적인 사고와 인적 피해를 예방하고 피 해자 혹은 손상 자산이 있을 경우에 이를 긴급 구조 및 추가 손상을 미연에 방지하는 것이 중요하다. 특히 이런 경우에는 빠른 속도로 움직이는 차량간과 차량과 기지국간 통신수단이 중요하다. 최근에 이러한 차량간 (V2V : Vehicle-to-Vehicle) 차량-기지국간 (V2I: Vehicle-to-Infrastructure, 차량-선로변 인프라(기지국등)간) 통신 시스템이 중요하게 되어 이를 위한 통신에 대한 필요성이 대두되었는데 이로 인해서 탄생한 것이 Wireless Access in Vehicular Environments (이동환경 내에서의 무선 통신시스템 ; 이후 ‘WAVE’ 라 명칭함) 이다. 본 발명에서는 사용자의 자동주차명령에 의하여 자율주행하여 지정된 주차장의 주차공간에 자동으로 주차를 하 고 그 이후에 다시 사용자 원하는 시간에 호출하여 원하는 장소로 차량을 배송하는 방법과 장치(자율주행통합제 어기)에 관한 것이다. 상기한 자율주행통합제어기에 의하여 자율주행에하여 자율주차하거나 사용자의 호출에 출차하여 사용자에게 재전달하는 과정을 도 2와 도 3에 예시하였다. 즉, 본 발명에서는 사용자의 자동주차명령 에 의하여 사용자 차량에 장착되어 있는 자율주행통합제어기가 GPS에 의하여 사용자가 내리는 위치('용무지'라 명칭)를 기억하고, 용무지로부터 사용자의 스마트폰/스마트폰앱 명령에 의하여 주차관제센 터에 구축된 스마트관제플랫폼에 위하여 최고로 근접한 위치의 주차공간이 있는 주차장을 검색 하여 그 위치를 저장 및 지정하고 자율주행에 의한 자동항해를 (automatic navigation) 시작한다. 스마트폰 으로 명령을 실행할 때는 명령실행과 고객정보의 보호를 위하여 반드시 인증 절차를 거치도록 한다. 자 율주행통합제어기는 자동차의 ECU로부터 신호전달부를 통하여 자동차의 속도, 상태, 동작 모드등의 기본 정보등을 공급받으며, ECU에게 검색된 최적의 주차장 위치로 일정하고 안전한 속도로 항해 안내를 명령한 다. 또한, 자율주행통합제어기는 각 차량에 설치된 각종센서, 카메라, 라이다와 무선장치를 통 하여 전후방 차량, 도로 및 차선, 도로 장애물등 사물 , 교통신호기, 사물의 운동정보와 위치 등을 관련된 신호 혹은 정보를 받아서 분석한 후 판단하여 신호전달부를 통하여 차량의 ECU에게 정해진 정속운전, 가속, 감속, 제동, 임시주차등의 명령을 하달 후 실행시킨다. 또한, LTE등 장거 리 이동무선통신과 중거리 WAVE를 무선무선방식을 통하여 구축된 교통안내 플랫폼을 통하여 안전한 교통 안내를 받으며, 상기한 방법을 통하여 정해진 주차장까지 안전하게 이동한다. 차량의 가속 시에는 자율주 행의 안전을 위하여 설정된 속도 이하의 범위에서 그리고 전방차량과의 이격 거리를 유지하면서 주행한다. 주차장에 도착 후에는 자율주행통합제어기에 의하여 차량는 주차제어 플랫폼에 의하여 동작되 는 자동주차시트멤에 의하여 운행된다 주차제어플랫폼에서는 차량의 입차 인식, 빈 주차공간 고지 및 위치 추적, 주차 및 위치고지, 주차료 과금 및 결재, 출차인식 등으로 나누어진다. 고속으로 자동회된 주차장에서는 빈주차공간 고지 및 위치추적 단계는 생략된다. 주차제어플랫폼 과 주차제어시스템에 대하여는 나중에 보다 상세하게 기술한다. 상기한 바와 같이 본 발명에서는 주차장까지 혹은 사용자가 원하는 호출위치까지 이동하는 경로상에서 발생할 수 있는 교통안전관련 제어방법으로서 상기 WAVE를 기반으로 구축된 교통안내플랫폼으로부터 차량이동 노 선상에 설치된 사고 혹은 장애물 검지장치에서 수집된 정보를 각 WAVE 기지국을 통하여 기지국 중앙관제센터 와 여타 차량에 전달함과 동시에 교통상황. 도로상황, 사고 상황등에 관련된 통합된 정보를 차량의 내에 있는 WAVE 통신모듈을 통하여 자율주행통합제어기에 전달하고 상기 통합제어기의 마이크로프로세서가 상기한 각종센서/카메라을 통한 인지정보와 교통안내플랫폼으로부터 전달된 교통정보를 통한 분석 및 판단하여 차량의 ECU에게 자동으로 명령하여 차량모션을 지능제어하는 지율주행 방법이다. 또한, 비상상태, 주차 및 출차등 정보는 자율주행통합제어기 내에 있는 장거리 통신 모듈에 이용하여 (이동통신사의 기지국과 서버를 통하여) 사용자에게 문자 혹은 스마트앱 프로그램(Apps)을 통하여 실시간 필요한 정보를 전송하는 방법을 포함한다. WAVE와 각종 인식장치에 의하여 자율주행통합제어기는 주차장까지 가는 최적경로의 트랙킹 데이터, 운전영상자료, 예상도착 시간, 안전 도착 여부, 주차여부, 주차과금 시간 등을 자동으로 모니터 링하거나 저장하며, 사용자가 원하는 경우, 이동통신사 장거리 통신망을 통하여 사용자에게 실시간 통보한다. 즉, 안전 자율운행, 주차, 호출등에 관련된 모든 정보를 WAVE와 통신사 통신방식으로 연결하여 사용자의 스마트 폰과 연결하여 차량이 제어를 받고 명령 실행 상황을 사용자에게 보고를 하는 시스템을 포함하는 것이다. 본 발명의 자율주행통합제어기은 도4에 예시된 바와 같이 장치가 구성된다. 자율주행통합제어기는 제한된 시간 내에 안전한 자율운행을 위하여 인지, 연산, 판단, 제어 기능을 실행하는 실시간 시스템이어야 한다. 이 기능을 수행할 수 없다면, 사고로 이어질 수 있다. 여기서 실시간이라 함은 실시간 시스템(real-time system) 이란 특정 작업 요청이 있을 경우에 이를 제한된 짦은 시간 안에 빠르게 처리할 수 있는 시스템이어야 한다. 실 시간 자율주행을 위해 가장 중요한 자율주행통합제어기는 컴퓨팅 시스템이고 플랫폼(computing platform)이다. 이 플랫폼은 제한된 짦은 시간 내에 복잡한 자율주행 인공지능을 실시간으로 작동시켜야 한다. 자율주행 컴퓨팅 플랫폼과 더불어 해당 플랫폼에 특화된 딥러닝 기반의 인공지능 소프트웨어 플랫폼 기술을 가미하여 자율주행- 자율주차을 실행 반복할수록 심화교육 (Deep Learing)에 의하여 보다 효율적으로 진화가 가능하다. 자율주행통합제어기는 초고속 산업용 컴퓨터이며, CPU (중앙연산처리장치 : 120), 메모리 (DRAM, FRAM)는 물론 각종 센서와 장치로부터 신호를 송수신할 수 있는 인터페이스 혹은 통신 포트, 각종 무 선 통신모듈이 포함되어 있는 종합적인 HMI(Human-Machine Interface) 시스템이다. 자율주행통합제어기에 는 장거리통신모듈은 이동통신사에세 제동되는 LTE(4G/5G), 중거리 통신모듈은 WAVE, 근거리통신모듈 등이 설치되어 사용한다. 근거리 통신방법은 필요에 따라 ZigBee/RF/ BLE )/WiFi등을 설 치하고 용도에 따라 활용한다. 통합제어기에는 전원공급부와 전력공급장치를 통해서 안정된 DC 전압과 전력이 공급된다. 보다 빠른 속도의 운영소프트웨어(Operating Software : OS)와 응용 프로그램인 자동 제어프로그램등은 고속으로 구동하는 FRAM에 설치하고 운행한 정보등 관련하여는 추후에 정리하여 하드디 스크 HDD에 백업저장한다. 백업저장된 정보는 추후에 클라우드 백업망에 전송되어 빅데이터로 저장되고,딥러닝에 의하여 운행을 개선하는 데 활용된다. 자율주행통합제어기에는 각종 외부센서, 카메라 , 라 이다으로부터 많은 정보가 전달된다. 상기 센서등 장치들로부터 전달되는 정보는 타차량인식, 사람 인식, 도로인식, 신호기인식, 사물인식과 운동정보 등이다 [도 4와 도 3참조]. 항후 에는 상기한 인식정보들이 카메라를 이용한 영상감지 신호들로 구성되며, 이러한 영상정보와 이를 전달받고, 인 식하고 판단하는 GPU가 매우 중요하다. 자율주행통합제어기에서는 외부 감지기(150, 160, 180)와 Ecu(70 0)으로부터 각종 신호를 빠르게 받아서 분석해야 하므로 신호전달시스템 BIOS가 중요하다. 자율주행 자동차의 제어장치는 자율주행플랫폼의 제일 중요한 요소이며, 안전을 위해 실시간으로 작동돼야 한다. 통합제어기 컴퓨터의 마이크로 프로세서 (CPU), DRAM , FRAM , 신호전달장치, 통신장치 는 초고속이어 야 하며, 운용소프트와 응용소프트 웨어는 너무 무거워서는 안되며 각종센서와 플랫폼들로부터 전달되는 정보를 인식하고, 논리적 신속하게 판단한 후에 실행명령을 실시간으로 내려야 한다. 상기 소프트웨어들은 HDD가 아닌 FRAM 에 설치되어야 하고,HDD는 운행정보를 저장하고 클라우드에 전달하는 용도로 사용한다. 상기한 각종 감지장치, 플랫폼, 무선통신망, GPS, 통하여 전달된 교통, 도로 정보와 ECU 으로 신호전달부 를 통하여 전달된 차량의 내부 정보등 등을 기반으로 자율주행통합제어기는 종합으로 분석 판단하여, ECU 에게 주행명령을 실행한다. 주행명령은 시동, 운행(정속, 가속, 감속), 제동, 정차, 조향 (방향변 경), 주차, 전원끔 (power-off)의 실행 등을 포함한다 (도2 참조). 자율주행을 위하여 자율주행통합제어기가 필요한 장치들과 신호들과 이를 기반으로 ECU에 내리는 실행명령들에 관련하여 도 5에 예시하였다. 자율주행 자동차 기술 단계는 4단계로 분류된다. 1단계는 특정 기능의 자동화 단 계인 선택적 능동제어 단계로서, 현재도 자동차에서 지원하는 차선이탈경보장치나 크루즈 컨트롤 등의 기능이 이 단계에 속한다. 2단계는 기존의 자율주행 기술들이 통합되어 기능하는 통합적 능동제어 단계로, 운전자들의 시선은 전방을 유지시키지만 운전대와 페달을 이용하지 않아도 된다. 3단계는 차량이 교통신호와 도로 흐름을 인식해 운전자가 독서 등 다른 활동을 할 수 있고 특정 상황에서만 운전자의 개입이 필요한 제한적 자율주행 단 계이다. 본 발명은 제4단계에 해당되며 완최고등급인 4단계는 모든 상황에서 운전자의 개입이 필요 없는 완전 자율주행 단계다. 자율주행을 위하여는 자울주행통합제어기에 지도안내와 운행지침이 신뢰할 수준으로 형성되어 입력되어 있어야 한다. 자율주행차량이 지켜야 할 규칙, 정속 운행 (특별 변경사항이 있지 않는 한) 차선 유지 (차선 이탈시 경보), 각 속도별 앞차량과의 이격거리유지 운행 신호기 신호 사전 인지 (카메라와 신호기 통신장치로 부터 수신) 예측제어, 사람과 사 인지 기능, 등 안전운행을 위한 지침이 설정되고 이에 대한 실행이다. 안전 운행을 위하여 도 3과 도5예시된 바와 같이 각종 센서 를 사용하여 자율주행 센서네트워크를 구성하여 통 합제어기에 제공하고 통합제어기는 이를 기반으로 차량의 국부적인 운행에 활용한다. 각종 센서, 카메라 센서, 라이다 (Lidar), 초음파센서, 가속도센서, 조향센서, 위치 센서등을 포함하여 구성된다. 또한, 목적지까 지 단거리와 중거리, 교통정보는 WAVE 기지국, WAVE 모뎀이 설치되어 있는 타 차량 이동통신(LTE등) 교통상황 정보에 의하여 예측 판단하여 자동 제어 운행한다. 본 발명의 자율주행차량은 움직이는 주변 물체를 인식하기 위하여는 카메라, 라이다 (Lidar), 초음파, 레이다 (Radar)등의 센서를 조합하여 운행한다. 특히, 카메라의 비 전(vision) 인식 기술을 통해 물체 종류를 분류해 내고, 라이다를 이용하요 움직이는 물체의 운동 정보와 위치 를 정밀하게 파악하는 즉, 카메라와 라이다를 통합하는 센서 플랫폼을 구성하고 두 센서의 정보 융합을 통해 물 체의 운동 정보를 정확하게 측정하는 동시에 그 물체가 어떤 종류인지도 파악하여 자율주행통합제어기에 제공한 다. 상기 방법으로, 사람과 사물, 차량을 인지 파악하여 사고를 미연에 방지한다. 라이다 센서는 차량을 기 준으로 360도, 200m까지 사물을 인식한다. 자율주행차량이 사용하는 기타 센서등은 3차원 가속도계와 회전 속도계, 운전대 각도(또는 주행 거리) 센서등이다 이러한 정보를 통합하여 사용자가 시작점을 기준으로 움직 인 거리와 방향을 계산할 수 있다. 상기 센서정보등이 관성측정장치(IMU)와 주행거리측정장치 (Odometr)에 이용 된다. 상기 기본 정보들은, 이는 ECU와 자율주행통합 제어장치에 실시간으로 보고된다. 또한 카메라 모듈 (혹은 카메라 비전 센서)는 전방카메라 2개 (전방 정면과 정면의 하향방향), 후방카메라 2개 (후방 정면과 정면의 하향방향), 각 도어별 센서 각 1개씩 (예를 들면, 4도어 차량의 경우 측면센서 4개), 각 차량의 코너 방향 센서 4개를 설치하여 인지한다. 또한, 초음파센서를 전방, 후방, 좌측면, 우측면등에 복수 개 를 설치하여 타 차량과 사람을 포함한 사물의 접근에 대하여 인지하여 충돌 혹은 접촉을 추가적으로 예방한다. 참고로, 차량의 키를 소유하고 있는 사용자가 접촉하기 전까지는 모든 운행은 자동잠금(락)상태에서 운용하는 것을 기반으로 하며, 비상상황이나 특수 상황 시에는 통합제어기가 무선통신과 공인인증 절차등 사용자의 명령 과 허가를 득한 후에 자동잠금 상태를 해제한다. 본 발명에서는 상기한 바와 같이 복수개의 센서를 설치하여 사고를 방지하고 각종 신호와 정보를 통합분석하여 예측 주행하는 것을 포함한다. 교통안내 플랫폼의 구축과 통신방식 : 교통안내 , Wave, 기지국, 관제센터 정해진 일정 경로를 따라 이동하는 자율적인 교통수단에서는 교통안전( Traffic Guidance and Traffic Safet y)이 필수적이다. 교통안전상황이 발생한 경우, 자동 돌발 위험검지시스템이 필요하며, 이에 의하여 기지국 센 터, 후방 차량, 구조센터에 자동 고지하여 추가적인 사고와 피해를 예방하고, 피해가 있을 경우에 이를 긴급 구 조 및 추가 피해를 미연에 방지하는 것이 중요하다. 특히 이런 경우에는 빠른 속도로 움직이는 차량간과 차량과 기지국간 통신수단이 중요하다. 최근에 이러한 차량간 (V2V : Vehicle-to-Vehicle) 차량-기지국간 (V2I: Vehicle-to-Infrastructure, 차량-선로변 인프라(기지국등)간) 통신시스템이 중요하게 되어 이를 위한 통신기술 에 대한 대두되었으며 이로 인해서 Wireless Access in Vehicular Environments (이동환경 내에서의 무선 통신 시스템 ; 이후 ‘WAVE’라 명칭함) 탄생되었다. 본 발명에서 제안하고자 하는 자율 주차 및 차량호출시스템을 위하여는 교통안내 플랫폼 구축이 되어야 보다 안전한 자율운행이 가능하다. 편리성 추구 때문에 안전성을 해 칠 수는 없으며, 안전운행은. 상기 자율주행이 제일 중요한 요소이다. 따라서, 본 발명에서는 자율주차 주행을 위하여 WAVE 통신, 기지국 및 기지국관제센터로부터 도로, 교통 및 사고 상황등에 대한 안내를 받는 플랫폼을 구축하고 이를 이용하여 사용자의 차량이 안전하게 안내를 받고 자율주행하여 주차장까지 도착하여 주차하는 것 을 포함한다. 본 발명이 활용하는 중요 플랫폼 중의 하나인 WAVE 통신방식에 대하여 살펴보면 다음과 같다. 현재 하 이패스와 같은 과금 체계용으로 널리 사용되고 있는 DSRC (Dedicated Short Range Communications) 규격은 짧 은 거리 내에서 도로변의 노변기지국 (RSE : Road-Side Equipment)와 차량 단말 사이에 무선으로 정보를 주고받 는 목적으로 개발되었다. DSRC란 차량을 위한 무선 전용 이동 통신으로 지능형교통체계 (IntelligentTransportation System, ITS)서비스를 제공하기 위한 통신 수단의 하나이다. ITS에서 요구되는 정 보들은 노변 기지국과 차량간의 통신을 통해 서로에게 전달되어야 하며, 이를 구현하기 위해서 양쪽 장치간의 무선고속패킷통신이 가능한 기술을 이용하여야 한다. DSRC는 노변-차량간의 양방향 근거리 통신, 일 대 다수의 통신기능, 고속전송 기능, 값싸고 단순한 변조기술을 사용하는 특징을 갖고 있다. DSRC는 최대 160km/h의 속도 로 최대 1Mbps의 전송속도, 약 100m 전후의 최대 통신거리를 지원하도록 설계되었으며, 현재 하이패스 시스템 (무선 통행료 결제 시스템) 의 주요 통신 규격으로 사용되고 있다. 그러나, 최근에 교통시스템이 발달하면서 노 변기지국과 차량단말기 사이에 주고받는 정보의 양이 많아지고, 보다 빠른 속도와 더 넓은 거리의 통신을 원하 게 되었을 뿐 아니라, 차량단말기와 차량단말기 간, 즉 차량 간(V2V, Vehicle-to-Vehicle) 통신에 대한 필요성 대두되었다. WAVE 규격과 기존 통신과의 차별성을 설명하면 다음과 같다. 첫 번째로는 고속 이동 시에도 빠르고 안정적인 접속이 가능하다. WAVE 규격은 최대 200km/h에서도 데이터 통신이 가능한데, 이를 위해 기본 채널 대역폭이 절반(20Mhz→10MHz)으로 줄었으며, 이는 데이터 전송속도를 반 으로 줄이는 대신 통신의 신뢰성을 높이고, 채널 점유 경쟁을 줄이고자 함이다. (즉, 열악한 통신 환경 때문에 통신이 어렵고, 통신의 신뢰성을 높이고자 전송속도를 줄임) 또한, 초기 접속 시 보안에 관련된 프로토콜을 따로 정의하여 IEEE802.11a와 같은 인증 절차를 생략하여 빠른 접속DL 가능하도록 되어 있다. 두 번째로는, 필드형 데이터 통신 및 통신 반경의 증가이다. Wi-Fi는 주로 실내용으로 대체로 고정된 환경 에서의 빠른 데이터 전송을 하는 것이 목표라면, WAVE는 시시각각 변화되는 옥외용 환경에서 Wi-Fi에 비해 속도 는 느리지만 (이론적으로 1/2 정도이다) 한번 통신 시 정확하게 전달하는 것이 목표이다. 또한, ITS 환경의 요구사항을 반영하여 DSRC가 최대 약 100m의 통신 반경을 갖던 것을 LOS(Line-of-Sight)가 보장되는 환경에서 최대 1km 까지 지원하도록 반경 범위 개선된 통신방식이다. 세 번째로는, 차량간(V2V) 통신 지원이 가능하다. WAVE 규격과 비슷하거나 오히려 우수한 전송 속도를 가진 모바일 WiMAX/Wibro나 LTE 등의 통신 방식들이 존재하는 것은 사실이나, 이들 통신 방식 규격들은 모두 WAVE와 달리 차량간(V2V) 통신을 지원하지 않는다. 또한, 이들 통신 방식으로 V2V를 구현할 경우, 구현 방식 별로 호환성을 유지하기가 매우 어렵기 때문에 해외는 물론 국내에서도 시장경쟁력이 저하된다. 네 번째로는 OFDM(Orthogonal Frequency Division Multiplexing) 변조방식이다. 일반적인 도심환경이나 옥 외 환경에서의 전파는 일직선으로 도착하는 직접파보다는 건물이나 지형지물에 반사되어 도착하는 많은 반사파 로 구성되어 있다. 따라서, 이러한 다중반사파에 의한 멀티패스 페이딩(multipath fading) 현상은 고속으로 갈수록 간섭 등 여러 가지 문제점을 발생되는데, 이러한 문제점을 해결하기 위해서는 복잡하고 규모가 큰 통신시 스템을 필요로 하게 되며, 이 역시 주파수 효율성이 떨어지는 등 심각한 성능 열화등의 문제점이 발생된다. 이 러한 문제점들을 해결하기 위한 OFDM 기술은 최신 전송속도가 10Mbps 이상인 고속 무선 이동통신인 모바일 WiMAX, LTE 등에 사용되고 있으며, WAVE 규격에서도 OFDM 기술을 사용하고 있어 반사파가 많은 경우도 상기한 문제점이 없이 활용할 수 있다. 본 발명의 자율주행 및 자율주차를 위한 안전한 교통안내 플랫폼을 개발하기 위하여 WAVE 와 타 통신방식 비교 및 적합성을 검토하면 다음과 같다. 종래의 가능한 모든 무선 통신 방식을 조사하였을 때, WAVE 통신, DSRC, mobile WiMAX 등이 ITS 환경에서 요구되는 서비스 구현 최소 요구 조건에 부합된다. 그러나, DSRC는 최대 전송 속도가 약 1Mbps로, 대용량 데이터를 고속 전송하기에는 무리가 있을 뿐 아니라, V2V 미지원, 끊김 없는 데이터 통신을 위한 핸드오버 미지원으로 나머지 두 통신방식에 비해 상대적으로 제한적인 통신방식이다. WAVE를 제외 한 나머지 통신방식들은 차량간(V2V) 통신을 규격에서 정의하지 않고 지원하지 않으므로, 모든 조건을 만족하는"}
{"patent_id": "10-2018-0110826", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "규격은 현재까지는 WAVE가 유일하다. DSRC와 WAVE 통신규격 과 성능을 요약하면 표1과 같다. 표 1 표 1. DSRC와 WAVE 통신규격 성능 비교 항목 규격 RF-DSRC IR-DSRC WAVE 주파수 5.8GHz 800~900nm 5.850~5.925GHz 대역폭 10MHz 50nm 10MHz 기저대역 변조 방식 ASK ASK-OOK OFDM 지원 가능 전송 속도 1.024Mbps 1.024Mbps 3,6,9,12,27Mbps 최대 속도 지원 160km/h 160km/h 200km/h 최대 통신 반경 10~20m, 100m 10~20m max 1km 주요 무선 통신 방식 별 성능 비교를 도 6에 예시하고 WAVE통신과 여타 이동통신 방식 별 비교를 표2에 정리하 여 나타내었다. 표 2 표 2. WAVE와 여타 이동통신 방식 별 비교 요구 조건통신 요구 조건무선 이동통신 방식 IR DSRCWLAN (802. 11g)WiMAX (802. 16d)셀룰러 3GPP (HSPA)mobile WiMAX (802. 16e)WAVE (802. 11p) 주파수 - NA5.8GHz2.4GHz2~11GHz2.0GHz 2.3 ~2.4GHz5.9GHz 교통 흐름에 상관없 는 지속적인 정보교환최소 110km/h 이 동 속도 지 원지원 가능 (180km/h)지원 가능 (160km/h)지원 안함 (Walk)지원 안함 (Walk)지원 가능 (250km/h)지원 가능 (120km/h)지원 가능 (200km/h) 단말기 장착 차량 95% 이상 의 정보교환최대 지연 시간 313ms 이내10ms200ms3~5sec10ms 1.5 ~3.5sec10ms 100ms 다양한 형태 정보 제공 데 이터 전송최소 1Mbps 이상의 전송 속도4Mbps1Mbps54Mbps75Mbps14.4Mbps (하향시)평균 2Mbps 최대 10Mbps평균 12Mbps 최대 27Mbps충분한 운전자 의사결정 예상 시간최소 85m 통 신 반경1m 100m500m개활지 22.5km 도심지 1km2km 1km 1km 끊김없는 통신 을 위한 핸드 오버 지원 가 능여부- 지원 안함지원 안함지원 가능지원 가능지원 가능지원 가능지원 가능 V2V 통신 지원 여부규격 내 정 의 여부지원 안함지원 안함지원 안함지원 안함지원 안함지원 안함지원 가능 Wave무선통신을 기반으로 도로변, 신호기, 주차장등 포함하여 일정한 간격으로 기지국을 설치한다. 상기한 WAVE 기지국, WAVE 기지국 관제센터, 자동주차관제센터와 자율주행차량을 도 7에 예시하였다. 자율주행차량은 자율주 행통합제어기를 이용하여 빈 주차공간이 있는 주차장까지 (주차관제센터로부터 정보수집) GPS와 내비게이션을 통하여 이동하며 중간에 WAVE 지지국으로부터 교통, 사고, 도로 상황등에 안내를 받는다. 좀 더 자세하게는 교 통상황, 교통신호제어기로부터의 신호인식, 보행자검지 (V2P), 기타 사물검지 (V2D : Vehicle to Device), 돌발 상황검지 혹은 도로 및 기상정보등을 받을 수 있다. 또한, 자율주행차량은 WAVE 모듈이 설치되어 있는 다른 차 량과 교신을 직접 주고 받을 수도 있으며 다른 차량이 기지국 혹은 기지국관제센터에 교신한 정보 역시 교환한 다. 자율주행차량은 차량 내부에 WAVE 통신 모듈이 설치 되어 자율주행통합제어기가 있으며, 여타 차량은 WAVE 통신모듈이 장착되어 있는 WAVE 모뎀만 있으면 차량간 (V2V) 소통이 가능하며 자율주행통합제어기가 필수 적이지는 않다. 본 발명의 WAVE 를 이용한 특수 기능 노변 상에 기지국을 설치하여 차량과 교신하기 위하여 (V2I), 기지국에는 WAVE 모뎀 송수신 장치의 설치가 필요 하며, WAVE 장치 외에도 카메라, 라이다(lidar)등의 설치도 필요하다. V2I 구축을 위한 인프라 비용을 절감하기 위하여 기존 도로변의 가로등에 설치하여 통합관리 제어하는 것도 중요한 착상이라 할 수 있으면 본 발명에서는 이에 대한 것도 포함한다. 목적지에 빨리 도착하기 위해 중요한 건 ‘가장 짧은’도로가 아니라 ‘가장 안 막히는’ 도로다. 아무리 짧은 도로라도 꽉 막혀 있다면 먼 길을 돌아가는 것보다 훨씬 오랜 시간이 소요된다. 물론 종래의 라디오 교통방송이 나 내비게이션을 통해 교통상황 정보를 제공 받을 수 있긴 하지만 운전하는 각 개인이 해당 정보를 기반으로 어 떤 판단을 내릴지 알 수 없기 때문에 종래의 방송 혹은 내비게이션으로는 교통 체증이 없는 도로로의 경로 탐색 은 실패할 가능성이 높다. 이런 가능성을 최소화하기 위해서 본 발명에서는 중거리 WAVE 통신망의 해당지역 (Local)의 교통안내 정보를 실시간 (real-time)으로 받아 최단 시간 내에 목적지인 주차장까지 자율주행하는 방 법을 포함한다 도 8에 WAVE 중거리 통신망과 기지국을 통하여 어떻게 최적운행이 가능한지 예를 들어 설명한다. 자율주행차량 의 좌측하단의 출발지점에서 출발하여 운행하는데, 주차공간이 있는 주차장이 지정되어 움직이는 경우 주차장까 지 도달하는 데 여러 경로가 있을 수 있다 (도 8에는 4가지 경로 예시함). 경로1에 자동차 사고가 있다면 경로1 과 경로4가 통에 어려움이 있으므로, 차량은 경로2와 경로3을 택하여 운행한다. 이 사고에 대한 통지는 가장 근 접한 WAVE 기지국 혹은 WAVE모뎀이 설치되어 있는 타 차량으로 정보를 수신한다. 운행도중, 경로2의 교통상황 이 좋지 않으면, WAVE 기지국에서 제공된 국지적인 (Local) 통행량정보를 기반으로 자율주행차량을 경로3로 안 내한다. 이동통신사 기지국으로부터 교통정보가 제공되기는 하지만, 실시간 정보가 들어오기에는 시간이 오래 걸리므로, WAVE 기지국으로부터의 사고등 돌발상황과 교통체증 상황등의 정보를 실시간 제공받아 판단하는 경우, 최적경로에 의하여 최단 시간 내에 주차가 가능하다. 본 발명의 자율주행통합제어기의 자율주행-자율주차 프로그램의 동작 플로우 차트에 대한 예시도를 도 9에 나 타내었다. 각 차량에 무선신호 인식장치 (WAVE모뎀) WSRk (RFTk)를 설치하고 역에는 무선신호 송출 장치WSSi (RFSi)를 설치한다. 인덱스 i 는 i번째 WAVE 기지국를 나타내는 인덱스 (도로변 기지국, 기지국 관제센터 (교통안내센터), 주차관제센터, 각 주차장에도 설치한다) ; k 는 차량을 나타내는 인덱스 이다. RFTk [WSRk (Wireless Sensor Reader)와 혼용함] : k-차량에 설치된 무선신호 인식장치 (WAVE모뎀) [k차량에 설치된 WAVE 모뎀]. 본 발명에서는 무선신호 인식장로서 WAVE통신 방식을 근간으로 사용한다. WAVE모뎀장치를 WSR로 명기하 고 기타무선신호 인식장치를 RFT로 명기한다 RFSi [ WSSi Wireless Signal Sender (도로변에 설치된 i- WAVE기지국 에 설치된 무선신호 송출장치) 혹은 WSTi Wireless Signal Sender ID Tag ]]. 본 발명에서는 무선신호 인식장치로서 WAVE 통신 방식을 근간으로 사용한다. 다만, BLE(Bluetooth Low Energy) 등 WAVE통신과는 별도로 기타 무선 인식장치 및 통신방식을 개별적으로 혹은 혼용하여 사용이 가능하다. WAVE기 지국장치를 WSS로 명기하고 기타무선신호 송출장치를 RFS로 명기한다. 본 발명의 교통안내 플랫폼과 WAVE에서 제공받을 수 있는 기타 정보 혹은 지원사항으로는 도로 위험구간 정보, 도로작업구간, 교차로 신호위반 감지기, 차량추돌방지 지원, 노면상태와 기상정보, 스마트 통행료 과금 및 결재 (차량최대속도가 200 km/h로 감속할 필요없음), 긴급차량(앰블런스, 소방차등) 혹은 안전차량 (스쿨버스등) 접 근에 대한 정보를 실시간으로 받을 수 있다. 이미 이동통신 내비게이션 서비스등에서 실행하고 있기는 하나 일 정 속도 제한 구역등에 대한 정보도 실시간으로 보다 상세하게 제공받을 수 있다. 운전자는 교통 신호가 언제 바뀔지 알 수 없기 때문에 빨간색 신호등에 즉각적으로 반응, 차량 속도를 늦춘다. 하지만 브레이크에 의한 즉각적 감속과 제동은 차량의 운동에너지를 열에너지로 빠르게 바꾸고, 불필요한 차량 에너지 소모의 원인이 된다. 정밀지도로 공유되는 실시간 신호 정보로 교통 신호를 예측할 수 있다면 자율주행 자동차는 브레이크를 덜 밟으면서도 안전하게 감속하는 운행 계획을 세울 수 있다. 이 밖에도 정밀지도엔 도로 곡률·경사 정보가 포함돼 있기 때문에 해당 정보를 활용하면 에너지 소모가 가장 적은 경로를 예측하고 운행을 계획할 수 있다. 무엇보다 자율주행 자동차는 인간 운전자와 달리 계획된 운전 경로를 정확히 지키며 작동하므 로 연비 향상에 효과적이다. 이러한 방법은 하이브리드카, 전기차 혹은 공회전제한장치 [Idle Stop and Go System : ISG 시스템 ]이 장착되어 있는 일반차량과 함께 사용할 때 에너지 절감효과를 최대화 시길 수 있다. 또한, 교차로에서 차량의 방향을 바꿀 때 현지 국가의 교통법에 의하여 시간이 오래 걸리는 방향이 있다 (국내 에서는 좌회전방향). 따라서 이러하게 시간의 오래 걸리는 방향을 지양하는 운행 방법으로 최적경로를 트랙킹하 여 들어가는 방법에 의하여 시간을 단축하고 에너지 사용을 단축하는 것이 가능하다. 본 발명은 상기한 상기한 바와 같은 교통상황, 도로상황, 신호에 정보에 따른 예측 제어 운전을 통한 에너지 절감에 관한 방법을 포함한 다. 효율적인 자동차의 자율주행을 위해선 자율주행용 정밀 지도가 필요하며, 자율주행 판단·제어에 사용될 수 있 다. 본 발명은 이동통신사에서 제공하는 내비게이션 지도를 기본으로 하되, 자율주행통합제어기는 정밀지도 (High Definition Map : HDM)를 클라우드 서비스로 제공하는 정밀지도 플랫폼에 접속하고 이로부터 정보를 수집 하고, WAVE 통신망으로부터 기지국과 주변의 여러 차량의 인지 정보를 공유하면 공사(사고) 구간이나 차량 흐름 등 시시각각 변하는 살아있는 최신 정보를 유지하는 방법을 포함한다. 자율주행 정밀지도 는 자율주행 시스템에 필요한 3차원 도로 환경 정보를 10㎝ ~ 20㎝ 수준의 정확도로 제공한다. 이때 ‘3차원 도로 환경 정보’는 차선 정보, 가드레일, 도로 곡률경사, 신호등 표지판 위치, 교통 표식 등 기존 내비게이션에 포함되지 않은 내용을 제공하는 것을 포함한다. 상기한 정밀지도 플랫폼은 자율주행 관련 다양한 서비스의 기반으로 사용될 수 있다. 또한, 본 발명에서는 SLAM(Simultaneous localization and mapping)방법을 활용하여 차량의 동시적 위치추정 및 지도작성으로 주위 공간의 지도를 만들면서 동시에 차량 스스로가 그 지도상의 어디에 있는지를 추정하는 기 법이다. 차량에 붙은 여러 개의 센서와 오프라인 지도를 결합해서 활용하는 방법을 포함한다. 또 한가지 중요한 사항은 도로 환경이다. 도로 환경은 계절이나 날씨에 따라 수시로 바뀐다. 공사 상황이나 사 고, 노후화 등에도 영향을 받는다. 이러한 정보를 항상 현재의 상태로 파악하는 일은 매우 어려우나, 이런 변화 를 파악하는 방법에는 2가지 방법이 있겠다. 현재 도로 상황등을 WAVE 차량, WAVE 기지국과 관제센터가 수집하 여 자율주행차량의 통합제어기에 실시간으로 직접 정보를 전달하여 반영하는 방법이다. 이러한 방법이 사용되기 위하여는 각 차량에 도로의 상황을 파악할 수 있는 센서 (예를 들면 차량차체 하부에 카메라 센서장착 및 인식 등이) 구비되어야 한다. 또 다른 방법은. WAVE망을 통하여 수집된 도로상황정보가 지도서비스 플랫폼의 전달 되어 빅데이터화하고 클라우드 컴퓨팅에 의하여 분석한 후 정밀지도 정보에 변화가 검출되어 새 지도정보가 반 영된 후 이 정보를 실시간으로 자율주행차량의 통합제어기에 전송하는 방법이다. 정밀지도에 수록되어 활용이 가능한 지도 정보를 최신상태로 유지하는 것은 시간과 비용이 많이 들어가는 작업 이다. 이 문제를 해결하기 위하여 자율주행 차량 내 환경 인지 시스템과 차량에 장착된 센서를 이용하여 WAVE가 설치된 여러 차량의 인지된 정보를 차량으로부터 수집, 융합하여 정밀지도를 최신의 정보 상태를 유지할 수 있 다. 본 발명에서는 이러한 WAVE가 설치된 차량의 능동적 데이터 수집과 이를 기반으로 정밀지도를 창출하고 정 밀지도플랫폼을 구축하여 이를 공유하는 방법을 포함한다. 본 발명에서는 상기한 WAVE를 이용하여 최적 경로, 교통, 도로, 날씨등을안내받아 운행하고 또한 상기 교통관련 정보등을 WAVE 차량들이 수집하여 정밀정밀지도 플랫폼을 구축하고 정밀지도를 최신상태로 유지하는 방법과 아 이디어를 모두 포함하여 개시한다. 다만 본 발명은 상기한 센서의 종류등 특정방법에 국한되지 않는다 상기한 봐와 같이 본 발명에서는 최단 거리 내의 빈 공간이 있는 주차장으로 상기한 자율주행방법에 의하여 이 동하고, 자동으로 주차하고 자동으로 출차하여 사용자에게 전달하는 종합 USN, 이를 구성하는 각 플랫폼들, 각 플랫폼의 운영 방법 및 이를 운영하기 위한 시스템들과 장치들을 포함한다. 본 발명에서는 차량간 추돌방지, 교통량상황, 도로상황,기상상황, 도로작업구간, 신호기 신호등의 정보를 WAVE 로부터 실시간 제공받아 차량이 안전하게 주행할 수 있도록 하는 자율주행플랫폼, 운영방법과 이를 실행하기 위 한 자율주행통합제어기를 포함하여 최단시간 내에 주차장까지 도달할 수 있는 자율운행 및 자율주차방법을 개시 한다. 주차관제 플랫폼 : 1) 주변의 빈 주차 공간, 최단 시간 주차, 2) 주차료가 저렴한 주차장, 3) 초고속 기계식 방식의 주차장 자율주행통합제어기를 이용한 스마트 자동주차 및 호출시스템이 최적의 상태로 운용이 되려면 빈 주차공간이 있는 주차장을 안내하는 주차관제플랫폼과 각 주차장의 자동화된 고속 주차제어플랫폼과 시스템(입차, 과금 , 결재, 출차)과의 무선통신을 통한 이 필수적으로 효율성을 가지고 융합되어야 한다. 주차관제플랫폼 은 특정지역 내의 등록된 모든 주차장의 데이터 베이스와 모든 주차에 관련된 영업 현황 을 실시간으로 파악하고 저장하여 이를 자율주차를 위한 정보를 자율주행통합제어기 혹은 사용자의 스마트 폰앱에 제공하는 플랫폼이다. 각 주차장의 기본 정보 데이터베이스 (DataBase : DB) 주소, GPS좌표, 운영주체 , 시설현황 (총 주차공간, 관 리 인원), 주차방식 (기계식, 자주식) , 영업정보 (영업요일, 영업시간, 시간 별 주차요금, 정기차량 요금구조, 요금할인구조)이다 . 현재의 주차 현황과 가동운영정보는 주차장의, 점유현황, 가용주차공간 현, 예약현황등이 다. 주차관제 플랫폼은 상기한 각 주차장의 실시간 주차현황을 파악하여 자율주행통합제어기와 장거리(LTE 등)와 중거리 (WAVE등) 무선통신방식으로 사용자의 차량이 최단 시간 내에 도착하여 주차할 수 있는 주차장의 정보를 제공하고, 예약하는 것을 포함한다. 또한 해당 주차장의 주차제어시스템에게 상기한 해당 사용자의 차 량이 오고 있다는 것을 고지하여 예약하고, 최적주차를 위하여 사전에 준비시키는 것을 포함한다. 제일 좋은 방법은 사용자가 자율주행통합제어기에 명령하여 통합제어기가 사전에 사용자의 목적지에 최단 거리 내의 최단 시단 내에 주차하고 출차할 수 있는 주차장으로 자율적으로 검색하여 예약하는 방법이다. 이는 물론 주차관제플랫폼에서 제공되는 주차장의 상기 기본 영업 정보에 의하여 판단될 것이며, 예약 후에는 사용자의 스마트폰앱에 고지하여 확인(confirmation)받는다 본 발명에서는 상기한 주차관제플랫폼을 통하여 자율주행통합제어기가 특정 목적지 근처의 주차공간을 사 전에 예약하거나 검색을 통하여 최단 시간 내에 주차할 수 있는 주차장관련 정보를 제공하는 것을 포함한다. 주차제어플랫폼 (운영체계)과 시스템 (장치) 주차 과금 : 주차 시간 자동으로 계산하여 과금, : 하이패스 카드 혹은 QR 코드 인식, 스마트폰 카드등으로 자동으로 결재 (자율주행차량에 전자결재 시스템이 구비되어 있어야 함) . 또한, 본 발명에서는 상기한 안전한 교통안전플랫폼과 주차관제플랫폼으로부터 고지되어 지정된 주차장에 도달 한 이후에 최적의 효율적인 초고속 주차방법과의 융합을 위하여 인덱스화 되어 있고 자동화된 고속 기계식 주 차제어시스템 혹은 무선통신방식을 근간으로 하는 주차공간을 차량이 찾아가는 자주식 주차시스템을 포함한다.차량이 주차장에 도달하기까지 GPS와 이미 구축된 지도를 기반으로 하는 내비게이션(항해)를 통하여 안내를 받 는 것과 더불어, 주차장의 상황을 고지받기 위하여 주차관제시스템에 등록되어 운영되는 주차장에는 WAVE 기지 국을 설치하는 것을 포함한다. 후술하겠지만, 자율주행차량이 주차관제 시스템과 교신하여 주변 주차장 중에 빈 주차 공간이 있는 주차장을 검 색하고 파악하여 자율주행방식으로 이동하여 주차가 가능하다. 그러나, 현재 공용주차장 혹은 대형쇼핑몰등 의 경우처럼, 주차장 진입과 유출할 때, 빈 주차 공간을 찾아 가는 비효율성으로 인한 율속효과 (Bottle Neck Effect) 로 인한 많은 정체가 일어난다 . 따라서, 본 발명의 주차관제시스템과 함께 운영되는 주차제어플랫폼 (제어시스템)은 주차장으로 진입된 차량을 초고속으로 배분하여 주차하고 출차된 차량을 배출시켜야한다. 이와 같이 초고속 주차 및 출차가 되지 않는 경우에 오히려 주차문제로 인하여 많은 시간적 지연이 발생하게 되기 때 문에 이 문제는 반드시 해결되어야 한다. 또 다른 문제는 주차장으로 오는 과정과 사용자의 호출로 인하여 출 차하여 사용자에게 재배달하는 과정에서 교통이 막히는 경우이다. 이 경우에는 기지국 내비게이션 시스템과 WAVE 기지국을 포함하는 교통안내플랫폼을 기반으로 자율주행통합제어기가 분석 판단하여 최적경로를 트랙킹하 여 최단 시간 내에 안전하게 배송한다. 초고속 기계식 자동 주차제어시스템 (High-Spee Automated Parking Control System) 에서는 사용자의 차량이 주차장에 입고된 후, 이미 인지되어 있는 빈 주차공간셀에 해당 자동차를 입고하여 주차시키는 것을 포함하는 지능형 제어 시스템이다. 즉, 종래에는 사용자가 직접 종래방식의 주차장에 진입한 후 어딘 가에 있을 지 모는 빈 주차 공간을 찾아 헤맬 뿐 만 아니라 주차공간을 발견한 후에도 주차하는 데 너무 많은 시간을 소모하며 타 차량을 대기시키고 있다는 점이다. 이것이 주차장에서 많은 혼돈과 불필요한 시간 소모를 초래하고 있다는 점이다. 도심 공간의 교통체증난과 주차난을 없애기 위하여 상기한 바와 같은 종래의 인간이 주차하는 자주식 주차방식을 획기적으로 개선하는 것이 필요하다. 초고속기계식 주차 시스템에서는 각 층별로 주차공간이 이미 인덱스화되어 있고 사용자의 차량이 어느 공간으로 입고되었는지 주차관제시스템의 CPU와 저장공간에 저장된다. 이 경우에는 센서 혹은 무선통신 방식으로 주차공 간의과 해당 차량을 매칭할 필요가 없으므로 상대적으로 간단하며 초고속방법으로 최적의 주차가 가능하다. 즉, 주차장에 도달한 이후에는 자율주행에 의한 주차가 필요가 없어 주차시간를 절약하고 안전도를 월등하게 향상할 수 있다. 본 발명에서는 자율주행과 자율주차를 인간이 아닌 인공지능(artificial intelligence)을 기반으로 하는 자동차 컴퓨터 (자율주행통합제어기), 교통안내플랫폼의 서버컴퓨터, 주차관제플랫폼의 서버컴퓨터, 고속 주차제어시스 템의 서버컴퓨터가 상호 소통함으로써, 최고의 효율성을 가지고 차량을 자율적이고 능동적으로 주행시키고 주 차시키는 상기한 플랫폼들, 장치들과 방법들을 포함하여 구성하여 개시한다. 또한 본 발명은 이러한 자율주행 과 자율주차 방법을 많은 차량에 적용하여 운영하면서 형성된 빅데이터로부터 각 플랫폼들의 서버컴퓨터들과 USN들 상호간에 운용결과데이터를 종합 분석하여 심화교육(Deep Learning)을 통하여 보다 효율적인 자율주차방 법이 제안될 수 있도록 하는 알코리즘과 방법을 포함한다. 교통안내 플랫폼과 주차관제플랫폼에 안내를 받아서 사용자의 자량이 자율주행에 의하여 주차장에 진입하는 순 간, 자동차의 자율주행통합제어기 그 이후의 모든 주차관련 행동은 무선 통신 방식으로 주차제어시스템과 교신 하며 인계를 한다. 사용자의 차량이 어느 주차장에 들어갔는지는 주차관제 시스템의 메인컴퓨터에 저장된다. 주차관제플랫폼의 메인컴퓨터는 각 주차장의 컴퓨터에 유선 무선 방식으로 연결되어 주차된 정보를 보고받아 이 정보를 모니터링하며 자율주행통합제어기에 전달하고, 또한 관련된 내용을 기억하여 돌발상황등 비 상시에 대비한다. 주차제어시스템은 각 층별로 주차공간이 이미 인덱스화되어 있고 고속기계식주차장의 차량 반송 로봇이 사용자 의 차량을 어느 주차 공간 셀로 입고하였는지 주차제어시스템의 컴퓨터에 저장되고 기억되어 출차 시에 실시간 (real-time) 초고속으로 출차할 수 있는 기능을 포함한다. 여기서 셀 (Cell)이라 함은 차량이 들어가서 주차되 는 한 개의 공간을 의미한다. 물론, 주차 후, 주차정보는 주차제어 시스템은 주차관제플랫폼에 자동으로 보고되 며, 차량의 자율주행통합제어는 해당정보를 사용자에게 장거리 통신방식 (예를 들면 LTE)을 사용하여 사용자에 게 주차장, 주차 시간등의 주차정보를 사용자에게 보고한다. 상기 자동주차의 경우에는 종래의 주차장과는 달 리 모든 동작을 인간이 아닌 주차제어시스템의 지능화된 컴퓨터와 기계장치에 의하여 초고속 방법으로 주차와 출차가 가능하기 때문에 최적의 주차가 가능하다. 본 발명에서는 상기 방법을 기본으로, 자율주행에 의하여 도 착한 사용자의 차량을 인간을 배제하고 지능화하여, 주차와 출차에 따른 시간소모를 획기적으로 절감하고 안전 도를 월등하게 향상할 수 있는 최고효율의 자동화된 기계식 주차제어방식을 제안한다. 즉, 주차를 원하는 차량을 최단 시간에 주차하여 저장하고 사용자가 원하는 시간에 최단 시간 내에 배송 전달하는 시스템이다. 즉, 본 발명의 핵심은, 교통안내 플랫폼과 주차관제플랫폼을 기반으로 빈 주차공간이 있는 주차장을 최단 시간 내에 찾아 들어가는 방법과 주차장에서는 최단 시간 내에 주차하고 정해진 시간에 예측 제어하여 효율적으로 출 차하는 주차제어 시스템이며, 이러한 획기적인 방법의 중심에 상기 플랫폼과 소통하고 차량을 자동 지능제어하 는 자율주행통합제어장치이다. 또한, 주차장의 자동화, 기계 동작이 안되는 경우 율속효과 (Bottle-Neck Effect)에 의하여 정체현상이 발생하므로 본 발명의 주차제어시스템은 기계주차설비의 원격 고장감시 및 진단 시스템에 관한 것도 포함한다. 본 발명에서는 상기 자동주차제어플랫폼을 실행하기 위하여 고속의 자동화된 기계식 주차제어시스템에 대하여 2 가지를 우선적으로 개시한다. 첫번째로는 원통형 주차장의 형태에 대한 형태와 각 층별 주차공간의 셀을 이용하여 주차하는 방법을 도 10에 서 예시한다. 원통형 주차장이 i=1,2 ..., I 층으로 구성되어 있다면, 각 층의 주차공간셀은 j=1, 2,..., Ji (Ji는 i층의 총 주차공간 수이다. 대부분 이 총 주차셀 수자는 동일한 숫자로 구성됨이 상례이다). Ji가 12개이 라면 i층의 각 주차공간은 30도의 각도로 분포되어 있다. 도 11에 예시된 바와 같이 차량 이송로봇은, z축, r축, 과 θ축 3방향으로 움직임이 가능한 3축로봇이다. z축은 상하방향으로 움직이는 (즉, 층사이를 움직이는) 축이고, r축은 반경방향으로 움직이는 (즉, 로봇팔을 뻗어서 해당 주차공간 셀 쪽으로 향하여 움직이는) 축이고, θ축은 각 층에서 회전하는 방향으로 움직이는 축이다. 도 11에서 보여지는 차량이송 로봇팔은 한 개 이며 이를 단일팔 (single arm) 로봇이라 하는데, 단일 팔 로봇의 경우는 구조가 단순하나 한 번에 한 개의 차 량밖에 이송하지 못하는 단점이 있다. 차량이송 및 주차 속도를 높이기 위하여 다중팔 (multi-arm) 구조의 로 봇이 바람직하다. 도 12는 다중팔의 일예로서 이중팔 (dual arm) 를 예시한다. 이 경우에는 2개의 팔에 각각 차량을 탑재하여 이송하므로 주차속도를 단일팔 로봇의 최소 4배까지 올릴 수 있다. 즉, 2개의 주차용 차량을 탑재하여 특정 측의 비어있는 주차 공간에 각각 주차시키고, 출차를 원하는 층으로 이동하여 출차 차량2개를 탑 재한 후 출차시키는 층으로 이동하여 (통상 지상 1층) 내려와 출차시킬 수 있다. 실제로는 Z축 모션이 시간이 많이 걸리므로 고층까지 상하 이동하는 경우, 시간을 단일팔 로봇보다 4배이상 절감할 수도 있다. 물론, 주차 하는 차량이 하나 밖에 없는 경우, 1개 차량을 탑재하고 지정된 층에 올라가서 1개의 출차 차량을 탑재하여 출 차 준비할 수 있다. 차량 이송로봇은 전기, 유압, 혹은 공압방식으로 사용하거나 혼용하여 사용할 수 있다. 도 13 에서는 원통형 주차타워의 주차 차량의 진입구와 출차차량의 유툴구의 형태와 배열을 예시하고 있다. 이 런 방식에 의하여 주차 진입구와 출차 유출구를 분리하여 차량들이 원통형 주차타워에 엉키는 것을 최대한 방지 한다. 도 11에서는 차량의 진입구와 유출구를 각각 4개씩 배열하여 구성하였으나, 한 층의 주차공간 셀 수 Ji / 2 개만큼 진입구와 유출구를 만들어 다양하게 운용할 수 있다 물론, 진입구와 유출구의 배열형태는 상술한 특정 의 실시 예에 한정되지 아니하며 실시 예를 변형하여 다양한 방법으로 운용가능하며, 이러한 변형 실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안 될 것이다. 차량을 탑재할 때는 각 차량은 차량홀더 (car holder)위에 위치시킨 후, 차량이송로봇이 이 차량홀 더에 안착한 차량을 고속으로 지정층의 지정된 주차공간 셀에 주차시킨다. 어느 층의 어느 주차공간 셀에 주차되었는지는 주차제어 시스템에 의하여 사용자 차량의 자율주행통합제어기와 주차관제 시스템에 고지되어 기억된다. 또한, 자율주행통합제어기는 각 사용자의 스마트폰으로 상기 주차정보를 보고한다. 기계식주차방식의 두번째 안으로 사각형 구조의 층별 주차장 형태와 각 층별에서 자유롭게 움직이는 이송로봇에 의하여 주차공간 셀에 주차하는 방법이다 (도14 참조). 상기 방법은 각 층을 움직여서 이송하는 로봇이 다수 존 재하며, 이 z축 로봇으로 해당 층에 차량을 이송시킨다. 차량탑재방법은 첫번째 방법과 동일하게 각 차량을 차 량홀더 (car holder)위에 위치시킨 후, z축차량이송로봇이 이 차량홀더에 안착한 차향 전체를 고속으로 지정층 에 이송시킨다. 해당 층에 올라온 차량은 각 층에 자유롭게 움직이는 차량이동로봇에 의하여 지정주차공간 셀 에 주차시킨다. 이 이동형 반송로봇 (Car Mover 혹은 Car Moving Robot)은 다방향으로 움직일 수 있으며, 차량 탑재를 인지하는 인지기능과 카메라에 위하여 사물들을 인지하며, 충돌 방지하며, 자율주행하여 지정된 주차공 간으로 차량을 이동시킨다. 이동형 반송로봇 Car Mover을 \"CM\" 으로 명명하여 도12에 명기하였다. 각 주차공간 이 배열된 셀이 단일 레이어 (단일 열)인경우, 차량이동로봇의 움직이는 공간이 많이 차지하므로 주차공간을 2 레이어 (이중 열) 구조로 하여 배송하면 보다 효과적일 수 있다. 도 14에서는 구역1과 구역2를 예시하고 있으며,각 구역을 담당하는 로봇은 지정구역에서만 차량반송업무를 담당한다. 주차와 출차 이송속도를 제고하기 위하여 층별 입구와 출구는 복수 개로 한다. 도12에서는 각 층에 입구 2개와 출구 2개를 보여 주고 있으며, 이수자는 주차공간의 배열방식에 의하여 디자인된다. 상기 Z축 이송로봇과 이동형 반송로봇이 상기 차량홀더에 안착한 차량을 고속으로 지정된 층의 지정된 주차공간 셀에 주차시킨다. 어느 층의 어느 주차공간 셀에 주차되 었는지는 근거리 (와이파이 /지그비 / BLE /RFID) 혹은 중거리 통신망(WAVE) 과 무선중계기 (지그비 혹은 클라 이언트 브리지 CB) 와 WLAN AP등을 통해서 주차제어 시스템 컴퓨터에 보고된다 (도 15 참조). 이 정보는 주차 제어 시스템에 의하여 주차관제 시스템과 사용자 차량의 자율주행통합제어기에 고지되어 기억된다. 또한, 자율 주행통합제어기는 각 사용자의 스마트폰으로 상기 주차정보를 보고한다. 상기한 주차제어시스템은 이미 각 주차공간들이 인덱스화되어 있기 때문에 차량반송로봇에 의하여 차량을 주차 공간에 넣은 후 해당 차량과 주차공간 셀 정보를 DSRC (Dedicated Short Range Communications) 근거리 통신 방식 [지그비, 저에너지 블루투스 BLE (Blooth Low Energy 4.0), 와이파이, (ZigBee), 혹은 RFID ] 을 이용하여 무 선중계기에 정보를 전달하고, 이는 WLAN AP를 통하여 주차제어시스템의 서버컴퓨터에 전달된다. 이는 도 16에 표시된 무선 통신망과 개념이 동일하다. 본 발명은 상술한 특정의 실시 예에 한정되지 아니하며, 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술 분야에서 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형 실시들은 본 발명의 기술적 사상이나 전 망으로부터 개별적으로 이해되어져서는 안 될 것이다. 자율주행에 의하여 자주식 주차 하는 방법 상기 자동화된 기계에 의한 주차 방식이 아닌, 자율주행차량에 의하여 빈 주차 공간을 자주식으로 찾아 들어가 는 경우도 가능하다. 이 경우에도 해당 주차장은 모든 주차공간을 인덱스화하고 주차공간 셀이 비어 있는지 유무를 실시간을 파악하고 인지해야 효율적인 주차가 가능하다. 즉, 기계식주차방식이 아니고 자주식 주차방식 의 경우에는 차량과 주차공간이 상호인식하고, 차량이 주차공간을 찾아가야 하며,주차 후 기억하여야 한다. 본 발명에서는 주차여부를 파악하는 주차 인식센서와 이를 주차제어시스템에 알려 주는 근거리 무선통신방법들과 복합적으로 혼용하여 차량을 빈 주차공간으로 자동으로 안내하고, 주차하며, 상호인식하는 자동인식 및 데이터 수집(Auto-Idendification and Data Collection) 방법을 포함하여 적용한다. 자주식 주차의 경우에 주차공간 셀에 차량이 주차 되어 있는지를 인식하여 실시간으로 파악하는 기능은 매우 중 요하다. 인간이 빈 공간을 찾아 가는 것이 아니라, 자율주행 차량이 자주식 방법으로 빈 공간을 찾아 들어가는 경우이므로, 상기 자주식 주차장의 경우에는 크게 4가지가 필요한데, 빈 주차공간의 파악, 빈 주차 공 간으로 차량의 안내, 차량이 주차된 후 해당 주차공간에 어느 차량이 주차되어 있는지 차량정보의 전달, 호출시 주차공간에서 차량을 출차를 한 후 출차 차량정보와 해당 주차공간이 비어 있는 공간임을 메인 컴퓨 터에 고지하여 다음 차량이 주차할 수 있도록 예비한다. 기타 공동사항으로 입구게이트 통과시 주차장에 진입한 차량정보와 시간 파악, 출구게이트 통과시 유출시간, 총 주차시간의 계산, 자동과금 및 자동결재, 주차장으로부터 도로까지의 안내이다. 일단계로, 주차공간에 차량이 주차되었는지는 여부를 파악하는 차량 감지 방법과 비어있는 주차공간의 데이터 수집과 맵핑(mapping)이다. 주차공간에 차량이 주차되어 있는 지 여부를 판단하는 차량감지 방법으로는 영상감지기, 지자기 센서, 루프감 지기, 초음파 센서, RF, 레이저 센서등의 방법이 있다 . 각 주차공간에 카메라 모듈을 설치하여 차량의 존재 영 상을 분석하고 차량 번호를 인식하는 영상감지기, 차량의 이동에 의하여 도선 상의 전류 변화를 감지하는 루프 감지기, 차량에 의하여 반사되어 오는 음파를 이용하는 초음파 센서, 차량에 의해 반사되어 오는 레이저를 이용 하는 레이저 센서, 차량의 이동에 의한 지구 지자기의 변화를 감지하는 지자기 센서등이다. 차량에 부착된 RF 태그(Tag) 주차공간 셀에 RF 리더로 인식하는 방법이 있다. 이 경우에는 각 주차공간마다 리더기를 설치하고 전력을 공급해야 하므로 비용과 관리가 증가하는 문제점이 있다. 이와 반대되는 역 RF 방식에 대하여는 후술 한다. 또한, 차량을 인식하는 다른 방법으로는 해당차량에 고유의 블루투스 장치를 설치하고 각 주차공간에 블루투스 장치를 설치하여 상호간 최근 거리 매칭에 의하여 인식하는 방법이 있다. 본 발명에서는 상기한 다양한 차량인 식 방법등이 포함되어 자주식 주차방법에 의하여 운영되는 주차제어플랫폼 개시하여 제안한다 상기 방법 중에서 주차공간에 지가기 센서 혹은 영상감지기, 초음파, RF 센서를 설치하여 인식하는 방법등을 예 시한다. 그러나 본 발명은 이러한 지자기와 영상감지 방법들에 국한하지 않는다. 각 주차공간 셀이 비어 있는 경우와 각 주차공간에 차량이 주차되었다면 각 주차공간에 어느 차량이 주차되어 있는지에 관한 해당정보를 실시간으로 근거리 무선통신방식 DSRC와 중계기(중간 통신장치)를 통하여 주차제어 시스템의 컴퓨터로 고지한다. 상기 근거리 무선통신 방식으로는 각 지그비 (ZigBee), 저에너지 블루투스 (Blooth Low-Energy : 일명 'BLE') , WiFi, 혹은 RF 방법등이 있다. 지그비는 근거리 통신 방식의 하나로서, IEEE 표준협회에서 정한 802.15.4 표준의 일종이다. 통신 한계 거리는 짧지만 전력 소모가 적고 원가가 저렴하다는 장점이 있고, 양방향·다채널 통신이 가능하다 전력 소모측면에서 효용성이 있어 배터리가 수개월에서 수년간 지속해서 사용할 수 있으며, 가격적으로도 매우 저렴하다는 장점이 있다. 구현 측면에서 지그비 프로토콜은 블루투스나 IEEE 802.15.3 고속HR (High Rate)-WPAN, 또는 802.11x 무 선 랜(LAN) 프로토콜보다 훨씬 간단하게 구성할 수 있다. 전송거리는 30m ~ 100m 까지의 전송거리를 가지며, 최 대 250kbps의 전송속도를 지원하고 주파수 범위는 868 MHz(유럽), 900~928 MHz,(북미), 2.4 GHz (이외지역 ; 한국등)이다. 또 따른 지그비의 특징은 Node 당 최대 255대의 기기 연결 가능, 최대 65,000개의 Node 확장 연결 이 가능하다. 자주식 주차 제어에 적용하기 위하여 상기 지그비 통신을 기반으로 인터페이스 보드 및 장치를 제작하여 다음의 기능들의 추가함으로써 보다 성능을 개선하여 실행이 가능하다. Zigbee 무선 통신을 이용한 RS232/RS485 통신이 가능하고, 신호 증폭안테나를 설치하여 최대 1.6km 까지 전송이 가능하며, 별도의 멀티 포트를 사용 하지 않고 1:N의 통신이 가능하며 (최대 255 ~ 65,000개), 2.4GHz의 전파 사용으로 주변의 전파의 간섭을 받지 않고 통신 이 가능하다 . 이러한 개량된 장치를 사용하여, 도 16에 예시된 바와 같이 본 발명에서는 주차장의 각 주차공 간 셀에 차량이 주차가 이루어지면, 차량이 주차된 사실과 주차된 차량정보를 지그비 무선중계기로 발신한다. 상기 주차된 차량정보는 상기한 바와 같은 영상감지, 지자기센서, 초음파 감지등의 방법에 의하여 인지된 주차 정보를 전달한다. 각 주차공간에 어느 차량이 주차되어 있는지에 관한 정보는 상기 센서방법에 의하여 신규로 주차가 되면, 해당 차량의 정보를 DSRC (대표적인 방법으로 지그비)에 의하여 각 층의 일정구역별로 설치되어 있는 지그비 (ZigBee) 무선중계기에 전송한다. 상기 지그비 무선중계기는 주차장의 기본구역별로 나누어 설치한다. 물론 안 나테의 설치와 성능에 따라 1km 이상 통신이 가능하고 65,000개의 노드까지 연결이 가능하다. 통신의 안정성과 속도를 위하여 255개의 까지의 주차공간 셀을 연결하여 정보를 수신하고, 주차 구역별로 개별 지그비 무선중계 기를 복수로 설치하여 각 주차공간 셀에 설치된 지그비 노드로부터 주차정보를 수신하여 통합관제한다. 지그비 무선중계기 이외의 방법으로 각 주차공간 셀에 WiFi 노드를 설치하고 이로부터 주차된 차량정보를 무선 클라이 언트 브리지 (Client Bridge ; 향후 ‘CB’로 명칭함 )로 전달받아 이용하는 방법이 있다. 와이파이 동작주파 수는 2.45GHz이며, 통신거리범위는 50~100m 이다. 통상 USN은 센서노드, 싱크노드, 게이트웨이로 구성되어 있 는데, 자주식 주차제어 플랫폼의 국부적인 USN의 요소로서 센서노드는 각 주차공간 셀의 차량인지 센서이고, 주차공간정보 (정량적으로 측정하고, 측정된 값을 데이터화) 를 싱크노드인 무선중계기와 WAP에 전송한다. 이 로부터 유선 망 Ethernet 기반으로 게이트웨이를 통하여 주차제어 서버컴퓨터 연결되어 주차제어플랫폼을 구성 한다. 주차공간의 차량인식과 주차 관리를 지자기센서와 지그비로 구성하여 한다면, 그 장치적인 특성은 다음과 같다. 우선, 지자기 센서는 주차구획 바닥에 매립하여, 차량의 점유 여부를 감지하고 통신중계기로 무선 송신, 차량 점유 검지 기능, 배터리 잔량 모니터링등이 가능하고 외부 선로(전원 & 통신) 불필요 하며. 실시간 운영 체제이 다. 주차정보를 전달하는 지그비는 설치 및 유지 보수가 용이하며, 저전력 슬립모드 지원이 가능하며, IEEE 802.15.4 Radio(2.4GHz) Compliant, 기후(눈,비,안개, 조도 등)에 관계없이 안정적인 차량 검지가 가능하고 사 용온도도 -20~70℃ 저온과 고온에 있고, 방수 방진 케이스에 넣어서 안전하게 보호가 가능하게 설치가 가능하 다. 지그비 방식 대신에 본 발명의 교통안내 플랫폼의 기반 통신망인 WAVE를 주차장의 통신망으로 사용이 가능 하다. 전술한 바와 같이 자율주행차량이 주차장까지 안내되어야 하므로 주차장에 WAVE 기지국을 설치한다. 복 층 층의 광대한 면적을 갖는 주차장의 경우에 각 층마다 WAVE 모뎀을 설치한다. WAVE 모듈이 있는 자율주행통 합제어기 혹은 WAVE 모뎀이 장착된 차량이 주차공간 셀에 주차된 경우, 해당 주차된 차량정보와 셀에 관련한 내용을 WAVE 통신에 의하여 전송한다. 본 발명에서는 상기한 방법에 의하여 파악된 차량감지 내용과 주차정보를 WAVE통신망을 이용하여 주차제어시스템에 전달하는 방법을 포함한다. 상기 지그비 혹은 클라이언트브리지에 의하여 층별로 취합된 정보는 유선 혹은 무선통신에 의하여 주자제어시스 템의 메인서버컴퓨터에 보고되며, 상기 주차제어 서버는 비어 있는 주차공간을 대형 전광판에 전송하여 표시하고, 출차 시에는 (서버컴퓨터에서 혹은 서버의 하위 컴퓨터에서 총 주차시간을 계산하여) 차량에게 과금하고 스 마트카드 혹은 하이패스 카드에 의하여 결재하도록 한다. 상기 지그비 통신을 기반으로 수집된 주차공간 전체에 관련된 정보는 무선 WLAN AP(Wireless Access Poin : 'WAP') 혹은 유선 (Ethernet 혹은 시리얼) 방식으로 취합하여 메인 주차제어서버 컴퓨터에 연결된다 [도 15 참 조.] 무선 액세스 포인트 WAP는 와이파이를 이용한 관련 표준을 이용하여 컴퓨터 네트워크에서 무선 장치들을 유선 장치에 연결하는 장치이다. 본 각 WAP는 복수개의 무선중계기에 연결되며, WAP 역시 주차장의 운영상황과 크기에 따라 복수 개로 설치한다. 상기 WAP는 유선망을 거치는 라우터에 연결되어 주차제어서버컴퓨터, 클라우 드DB저장장치 [혹은 (오프라인) 데이터 저장장치], 주차관제플랫폼 서버, 교통안내 플랫폼 서버, 카드사 서버와 연결하여 소통한다. 자주식 주차제어방식에의 2번째 주요 사항은 입구게이트에 진입한 후 빈 주차공간을 찾아가는 것이다. 메인 컴 퓨터는 빈 주차공간을 파악하고 있다가 (주차공간 맵 파악, 층간 대형 전광판에 고지) 자율주행차량이 입구 게 이트에 진입하는 순간 예약되어 있거나 혹은 빈 주차공간 있는 주차공간 셀을 고지하고 차량의 자율주행통합제 어기는 이를 통보받은 후에, DSRC방법으로 안내 받아 차량이 자율주행하여 해당 주차공간 셀을 찾아가서 주차 한다. 즉, 본 발명에서는 입구게이트에서는 차량이 진입하는 순간에 차량의 넘버를 카메라로 혹은 근거리 무 선통신방식 DSRC에 의하여 인식하고 이 차량의 정보를 DSRC 혹은 유선을 통하여 자동주차제어시스템의 컴퓨터에 고지한다. 일단 주차장에 복수 개의 층이 존재하는 경우에는 고지된 주차공간정보의 층을 파악한 후에 DSRC 혹은 카 메라의 영상감지에 의하여 차량을 해당 층에 안내한다. 해당 층에서 상기 지정 주차공간 셀을 찾아 가는 방법 은 여러가지 방법이 있다. 도15에 예시된 바와 같이, 차량은 자동주차제어시스템으로부터 빈 주차공간 셀까지 통합된 DSRC의 무선 통신방 식에 의한 위치신호발생장치에 의하여 안내를 받아서 최단 시간 내에 찾아가고 주차하는 방법을 포함한다. 한 가지 방법으로는 각 주차공간 셀에 저에너지 블루투스 BLE를 기반으로 하는 비콘 (Beacon : 표지판이나 신호 등 을 의미하는)을 설치하여 이로부터 발생하는 신호를 차향의 블루투스 장치가 인지하여 추적하여 찾아 들어간다. 블루투스 단거리 통신기술은 1989년 개발된 후 몇 단계에 걸쳐 업그레이드 되었다. 블루투스 1.2는 700 kbit/s 의 전송 속도를 낼 수 있었으며 블루투스 2.0은 최대 3 Mbit/s까지 속도가 향상되었다. 이후 블루투스 2.1은 기 기의 페어링 속도와 보안을 강화하였고 블루투스 3.0은 다시 전송속도를 24 Mbit/s까지 향상시켰다. 2010년, 저 전력을 주요 목표로 한 블루투스 4.0이 개발되었는데, 종래의 기기간 서로 데이터를 주고받을 수 있는 기능은 유지하면서도 일방향 통신 또한 가능하게 된 특징이 있다. 비콘(Beacon)이란 반경 50~70m 정도의 범위 안에 있 는 사용자의 위치를 찾아서 메시지 전송이나 모바일 결제 등을 가능하게 해주는 통신 기술로서 '블루투스 (Bluetooth) 4.0' 의 BLE를 기반으로 한다. 사용하는 신호에는 블루투스 신호외에 소리나 빛도 가능하다. 블 루투스 비콘은 UUID (Universally Unique Identifier)가 포함된 정보 패킷을 보낼 수 있다. 이때 UUID는 해당 비콘에 특정한 이벤트를 유발할 수 있는데, 특정 건물의 내부에서 위치추정을 하고자 할 때 방마다 여러 개의 비콘을 설치하면 약 2미터 이내로 사용자의 위치를 파악할 수 있다. 블루투스 비콘은 RSSI (Received Signal Strength Indicator) 값을 전송할 수 있기 때문에 사전에 알려진 비콘의 출력 신호 세기와 신호강도를 사용하면 비콘과 단말기 사이의 거리를 추정할 수 있다. 따라서, 주차공간 셀마다 비콘을 설치하면 차량이 지정된 추자 공간 셀을 찾아가는 것이 가능하다. 각 층을 인식하는 데도 층별로 비콘을 설치하여 다른 UUID를 보내서 층을 구분해서 인식할 수 있다. 건물 내 위치 확인 및 추적 분야는 오랫동안 와이파이의 독무대였지만 블루투스 로우 에너지(BLE) 기술 기반의 작고, 저전력이고 값싼 비콘이 대안으로 부상하면서 BLE 방식을 더 선호하게 되었다. 공간 해상도는 보통 많은 수의 비콘을 배치하는 방법을 통해 개선이 가능하다. 그러나 특히 대형 주차장, 컨벤션 센터, 경기장, 박물관등 과 같은 곳에서 아주 많은 수의 비콘을 계획, 배치, 유지보수, 관리하기란 보통 어려운 일이 아니다. 상기한 수많은 비콘 센서노드들의 관리 및 유지보수의 어려움을 해결하기 위하여 가상 비콘 방법이 있다. 이 방 법은 비콘 기기를 가상화해 '가상 비콘(Virtual Beacon)'을 생성하고 위치기반서비스(Location Based Service : LBS)를 제공하는 솔루션이다. 가상 비콘에서는 하나 이상의 인프라 기기가 다수의 비콘을 에뮬레이션하므로 개별 비콘 장치가 필요 없고, 따라서 기능 타협 없이 배치 및 운영에 드는 비용을 낮출 수 있다. 가상 비콘은 이러한 상황을 바꿀 잠재력을 지녔다. 가상 비콘에서는 하나 이상의 인프라 기기가 다수의 비콘을 에뮬레이션하 므로 개별 비콘 장치가 필요 없고, 따라서 기능 타협 없이 배치 및 운영에 드는 비용을 낮출 수 있다. 가상 비 콘을 이용한 위치 측정 방법은 각 위치에서 무선의 측정장치가 고유한 전파정보를 미리 측정하여 기준 데이터값을 수집하여 상기 측정된 기준 데이터값을 관리서버에 전송하여 데이터베이스에 저장한다. 전파 측정은 상기 측정 디바이스가 실제로 있는 위 에서의 전파를 측정한다. 측정하는 전파의 종류는 WAVE, BLE, 와이파이,LTE등 이동통신망 혹은 지자기 등일 수 있으며, 전파의 정보는 전파의 고유넘버와 신호세기 포함한다. 이후에 BLE 가 장착된 자율주행통합제어기 (혹은 스마트폰이나 스마트 기기)가 설치된 차량이 상기 특정 위치에 근접시에 특 정 위치에서 전파정보를 측정하여 데이터값을 측정한 후에 해당 데이터값을 관리서버에 전송하고 상기 관리서버 의 데이터베이스에 저장된 상기 측정 데이터값과 관련된 기준 데이터값을 수신하여 현재 측정된 측정 데이터값 과의 유사한 정도를 계산하여 일정한 오차범위 이내일 경우 특정위치에 근접하였음을 판별하여 특정 위치의 근 접 신호를 파악하는 방법이다. 즉, 가상 비콘은 비콘 영역 안에서 가상 좌표값을 부여해 신호를 송수신하는 방식이다. 특정 위치에 비콘이 있다고 가정하고 해당 지점에서 라디오 주파수를 내보낸다. 기기가 없어도 비콘 신호만 보내주면 송수신이 가능하며, 스마트기기가 이 비콘 신호를 받은 것처럼 인식하게 하는 것이다. 본 발 명에서는 실제적인 비콘과 가상 비콘을 사용하여 지정된 주차공간 셀을 찾아 가는 방법을 포함한다. 비워 있는 주차공간을 주차제어 시스템으로부터 고지 받지 못하는 경우, 카메라 영상 인식 방법에 의하여 통상적인 방법과 유사하게 비워있는 주차공간을 찾아 가는 방법도 있다, 본 발명에서는 사용자의 자율주행통합제어기가 주차장의 각 층에 실제 존재하는 비콘으로부터 신호를 받거나 가 상 비콘으로부터 상기한 방법으로 위치 인식을 하거나, 혹은 상기 영상감지 방법으로 빈 주차공간 셀을 찾아 들어간 후, 차량의 카메라를 이용하여 사전 고지된 주차공간 셀의 넘버와 주차 차선등을 확인한 후 안전 주차를 하고 사용자의 스마트폰 앱으로 고지하는 것을 포함한다. 각 층별 주차공간 셀을 인식하는 방법으로는 (가상) 비콘 방식 이외에 RFID 방법이 있다. RFID를 기반으로 하는 위치인식 및 추적기술을 응용하여 주차공간 셀에 차량이 주차되어 있는 지 여부를 판단할 수 있다. 사물의 위 치인식 및 이동물체의 추적은 위치기반 서비스 (Location Based Service)의 기본이다. 위치인식과 추적 메커니 즘은 WiFi, WSN(Wireless Sensor Network), 초음파, 적외선 및 카메라 기술이 이용되고 있다. RFID는 무선신호 를 사용하여 사물의 식별 및 추적을 목적으로 하는 기술이며, 재고관리 및 효율개선을 위해 공급체인관리 (supply chain management)에 널리 사용된다. RFID의 위치인식 및 추적시스템은 RFID태그, 리더(reader) 및 데 이터 처리 하부시스템으로 구성된다. 리더가 태그에서 ID메시지를 수신할 때 리더는 태그식별뿐 아니고 태그의 RSS (Received Signal Strength)정보도 받는다. RSS정보는 파워로 dBm으로 표시된다. 모든 태그에서 RSS정보를 조합하여 타깃위치를 추정할 수 있다. RSS정보의 장점은 추가비용 없이 쉽게 이용할 수 있는 점이다. RSS정보는 환경인자 때문에 그 값이 변동하여 신뢰성에 문제가 있다. 작은 환경변화도 RSS에 커다란 변화의 원인이 되고 더구나 환경에서 다중통로전파 및 간섭은 변동성을 증가한다. 따라서 위치정확도는 이러한 인자에 의해 쉽게 영 향을 받게 된다. RFID의 성능은 정확도 (위치인식 오차), 지연시간(latency : 물체가 새로운 위치로 이동할 때 와 새로운 위치정보를 얻을 때 사이의 시간), 비용 (태그와 리더의 수를, 배치설정의 적합성 및 고장에 대한 견 고성)으로 평가된다. RFID기반은 태그기반기술과 리더기반기술이다. RF태그의 첫 번째 기술은 LANDMARC (Indoor Location Sensing using active RFID)이며, 이는 기준태그(reference tag)와 추적태그를 사용한다. 기준태그는 현장에 배치하고 추적태그는 타깃에 부착한다. LANDMARC의 정확도는 평균 약 1m이고, 24㎡의 면적에서는 2m정도인 것으로 관측되 었다. 지연시간은 약 7.5s이었지만 H/W의 개선으로 현재 2s까지 개선되었다. 간섭과 다중통로의 영향을 받지만 타깃위치를 추정하기 위해 가장 가까운 기준태그(신호 크기 면에서 가장 가까운)를 선정하여 정확성을 얻을 수 있다. 리더기반 기술을 살펴보면, 대부분 RFID적용에서 전술한 태그기반 시스템을 포함하여 태그는 이동물체 타깃에 부착되고 리더는 고정위치에 있게 된다. 그러나, 리더기반 위치인식시스템에서 태그와 리더의 기존역할 은 반대이다. 즉, 태그는 고정된 위치에 놓고 포터블 리더는 이동사용자 또는 추적하는 물체에 의해 이동된다. 이동사용자의 위치는 포터블 리더에 의해 검출된 태그 ID(또는 RSS 값)로부터 결정된다. RFID기반 위치인식시 스템에 대하여 이 방법은 때로는 역 RFID라고 부른다. 역 RFID의 문제점은 포터블 리더의 태그정보를 중앙집중 식 추적시스템에 통신하는 방법이다. 재래식 방법에서는 설치된 리더 망으로 통신하지만 이러한 네트워크가 불 가능할 때는 대체 방법을 사용해야 한다. 본 출원의 경우를 살펴보면, 역 RFID방식으로서 RF 태그(Tag)는 각 차량에 설치하고, RF 리더는 각 주차공간 셀에 설치하여 상호 인식하게 된다. 이 경우에는 각 주차공간 셀마 다 리더기를 설치하고 전력을 공급해야 하므로 비용과 관리가 증가한다. 본 발명에서는 상기한 바와 같이 역 RFID방법을 사용하여 자율주행통합제어기에 리더를 설치하고 각 주차공간 셀에 RF 태그를 설치하여 지정된 주차공간에 차량감지 여부를 인식할 수 있다. 반경 1km를 커버하는 WAVE 기지 국(모뎀)을 각 층간에 설치하여 WAVE 통신망 을 이용하여 RF 리더에 인식된 데이터를 주차정보를 전달한다. WAVE 이외의 방식으로는RF 리더에 인식된 데이터를 노드 확장수가 매우 큰 지그비 (혹은 CB) 무선중계기 및WLAN AP를 사용하여 주차정보를 주차제어서버컴퓨터에 전달한다 (도 15 참조). 혹은 와이파이 망을 사용하는 CB 무선중계기와 WLAN AP를 사용하는 것도 방안 중의 하나이다. 주차장의 각 층을 인식하는 방법으로는 (가상) 비콘 혹은 RFID방식 이외에도 카메라를 이용한 사진(영상)감지 인식, 와이파이를 이용한 방식등이 있다. 본 발명에서는 상기한 방법들을 포함하여 차량이 자율주행하여 주차 공간 셀을 찾아가는 별도의 방법을 다음과 같이 개시한다. 소리를 이용하는 방법은 비가청(非可聽) 주파수 대역의 소리, 즉 사람이 들을 수는 없지만 수신장치는 들을 수 있는 소리에 코드를 심어 놓고, 비콘이 그 소리 신호를 지속적으로 보내서 수신장치가 인식하도록 하는 방법이 다. 빛을 사용하는 방법으로는 비콘의 신호로 LED 조명를 이용하는 방법이 있다. 사람은 인지할 수 없지만 차 량의 수신장치 카메라는 인지할 수 있는 방법으로서 비콘이 빛을 쏘면 수신장치의 카메라가 이를 신호로 인식하 여 위치를 찾아 가는 방법이다. 위치인식을 하는 또 다른 방식으로 위치인식 UWB 방법이 있다. 위치인식UWB 는 언제 어디서나 주체와 객체의 위 치를 인식하고, 이를 기반으로 유용한 유비쿼터스 위치 기반 서비스를 제공하는 방법으로서 펄스 방식 UWB기술 은 실내나 음영 지역에서 수십 cm급 이내의 정밀한 위치 인식·추적 기능이 가능하다 . 미국 FCC (Federal Communications Commission)는 2002년 2월에 3.1~10.6 GHz 주파수 대역에서 -42.3dBm/MHz 의 송신 출력으로 UWB (Ultra Wide Band)를 사용할 수 있도록 UWB 통신 시스템을 허가했다. FCC는 UWB 시스 템을 기존의 협대역 시스템 및 3G 셀룰러 기술로 설명되는 광대역 시스템과 구분하기 위해 중심 주파수의 20% 이상의 점유 대역폭을 차지하는 시스템 혹은 500MHz 이상의 점유 대역폭을 차지하는 무선 전송 기술 시스템을 UWB라 정의하였다. UWB 펄스를 사용하여 두 노드 사이의 UWB 펄스 전파 시간을 측정해 냄으로써 두 노드 사이의 거리를 측정이 가능하며 따라서 위치 파악이 가능하다. 좀 더 상세하게 설명하면, UWB위치인지시스템 의 위치 추적방식은 도착 시간차 TDOA (Time Difference of Arrival)과 도착 각도AOA(Angle of Arrival)를이용 하여, UWB센서와 UWB 태그와의 거리를 구하고 UWB센서 3곳으로부터의 거리 정보를 이용하여 삼각좌표에 의하여 좌표를 계산한다. 정밀도는 15cm 정도이고, UWB 태그는 주기으로 UWB신호를 송신하면, 건물에 배치된 UWB 센서 리시버는 이를 수신하여 거리를 계산하고 (이더넷으로 혹은 무선으로 연결된 ) PC서버에게 계산된 거리 정보를 전송하고, PC는 UWB 센서들로부터 전송된 거리 정보를 이용하여 UWB 태그의 좌표를 계산한다. UWB 센서의 개수 는 최소 3개 이상이어야 한다. 본 발명에서는 차량에 UWB 태그를 설치하여 UWB 신호를 송신하고 각 주차공간영 역에 (고정된) UWB센서를 설치함으로써, 지정된 주차공간 셀의 좌표위치를 추적하여 자율주차가 가능하다. 이동 노드인 UWB 태그가 동작할 때만 고정노드의 UWB 센서가 동작하므로 전력소모가 적고 분산형이기 때문에 부하가 걸리는 센서 노드가 없다는 장점이 있다 . 또 다른 실내 위치 시스템은 RF신호와 초음파 신호사이의 시간 차이를 이용하는 방식이다. 즉, 이 방법에서의 비콘은 상기한 BLE4.0이 아닌 RF신호와 초음파 신호를 송신하며, 상기한 시간차로부터 비콘 (송신기 : Sender) 과 수신장치 (Receiver, Reader 혹은 Listener) 사이의 거리를 계산하고, 비콘 3곳으로부터 거리정보를 이용하 여 삼각 측량법에 의하여 좌표를 계산한다.사용하는 RF는 433 MHz의 주파수를 사용하고 있으며 정밀도는 1~ 3 cm로 정밀도가 상당히 높다. 천장에 배치되는 비콘들은 매초별로 RF와 초음파 신호를 송신하고 수신장치는 이 를 수신하여 거리를 계산하고 (시리얼 포트로 혹은 무선으로 연결된) PC로 계산된 거리 정보를 발송한다. 비콘 의 개수는 최소 3개이상, 최대 8개까지 가능하다. 이 방식은 이동하는 이동노드 (Mobile node ; 본 발명에서는 차량)가 없더라도 고정노드(Fixed Node)인 비콘들이 계속 신호를 발송하는등 계속 동작을 해야 하기 때문에 전 력 소모가 심하고 또한 집중형이기 때문에 이동노드에 부하가 걸리는 단점이 있다. 본 발명에서는 상기한 위치 인식방법등을 통하여 차량이 지정 주차공간셀을 안내받아 찾아가는 방법을 개시한다. 차량이 해당 주차공간영역에 도달하면, 차량의 카메라로 영상감지하여 지정된 주차공간 셀 번호를 확인한 후 해 당 주차공간 셀에 주차 진입한다. 차량의 카메라에 의하여 주차선을 인식하고 후방의 장애물이 있는 지 확인 후 주차선의 좌측선과 우측선에 동일하게 일정거리를 띄우고 자율주차를 실행한 후,, 자동으로 주차브레이크를 동 작하고, 전원을 끈다. 주차공간에 차량이 주차된 후 해당 차량의 정보를 파악하여 전달하는 장치가 각 주차공간 각 셀에 설치 되어 있어야 하므로 상대적으로 저렴하고 복수개의 모듈을 다량으로 설치가 가능한 BLE 방법이 적합해 보인다. 그러 나 본 발명에서는 BLE에 국한하지 않으며 상기한 근거리 무선통신방식들을 다 포함하여 제안하며 .주차된 차량 정보를 취합하는 방식도 지그비 혹은 클라이언트 브리지 CB 방법에 국한하지 않는다. 본 발명에서는 상기 센 서와 무선 모듈을 설치하여 차량이 이들 모듈로부터 발생되는 신호를 기반으로 해당 주차공간을 찾아갈 수 있는 방법을 포함한다. 도 3에서 보는 바와 같이 주차제어플랫폼에 의해 운영되는 주차제어시스템은 입차시 입차시간과 주 차위치를 기억하고 출차시에는 총주차시간을 계산하고 차량의 자율주행통합제어기로 과금하며 자동결재한 후 사 용자에게 자동주차앱 혹은 문자로 고지한다. 상기한 센서, DSRC, 중계기를 통한 주차와 출차정보는 주차제어시 스템의 컴퓨터가 유선 (Ethernet), 혹은 WAVE 및 LTE등 중장거리 무선통신방식으로 주체관제시스템과 통신하여 소통한다. 출차인식은 BLE/RFID/카메라/등으로 가능하며 총 주차시간을 계산하여 자동과금을 통보받아 이를 결 재하고 출차하도록 한다. 이후에는 자율주행방법으로 주차장 출구와 도로를 인식하여 사용자가 원하는 위치로 배송한다. 주차제어시스템에 의하여 주차된 공간으로부터 출차게이트를 통과하기까지의 총 출차에 걸리는 시간과 사용자가 원하는 배송목적지까지 걸리는 예상시간을 교통안내플랫폼으로 예측하여 미리 출차 준비 를 한 후 사용자가 원하는 시간에 목적지로 차량을 배송 완료한다. 주차료의 과금과 결재는 자동차의 출차시 자동으로 신속하게 결재할 필요가 있다. 이와같이 자동으로 신속하게 결재하기 위해서는 사용자의 차량에 전자결재 시스템이 등록되고 구비되어 있어야 한다. 본 발명에서는 주차제 어시스템에서 출차를 인식하고 계산하여 통보한 주차료를 자율주행통합제어기는 전달받아, RF를 기반으로 한 하 이패스카드나 BLE/비콘 방법을 이용하여 자동으로 모바일 결재하거나 주차제어시스템이 제공한 QR코드를 통합제 어기가 카메라로 인식하여 자동으로 결재하는 방법등을 포함한다.물론 본 발명은 상기 방법등에 국한하지 않는 다. 사용자의 차량이 출차한 후 주차관련 모든 기억은 주차관제 시스템의 컴퓨터에 일정기간 (예를 들면 30일) 저장 되었다가, 특정 기간 이후에는 대용량 저장장치가 있는 클라우드 시스템에 이동 보관되며 Big Data화 하며 학습 과정을 통해 자율주행-자율주차 시스템 개선에 활용한다. 주차장으로부터의 예측 출차 관련 자율주행퉁합제어기는 주차제어시스템으로부터 출차시간과 교통안내플랫폼으로부터 WAVE 통신망으로 파악된 주 변의 도로의 교통 (트래빅)상황 및 사고 상황등 정보로부터 배송목적지 위치까지 걸리는 자율주행 예상시간을 예측하여 미리 예측하여 출차준비를 한 후 차량을 출차하여 사용자가 지정한 장소에 정확한 시간에 자율주행 하여 배송한다. 사용자가 지정한 시간 보다 일찍 도착한 경우에, 지정장소가 주차 통제 구역인 경우에 자율적으 로 배회주행을 하던지 노변의 주차 공간에 주차한 후, 사용자에게 고지하고 사용자의 다음 호출명령을 대기한다. 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에 한정되지 아니하며, 명세서에서 진술하는 혹은 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발 명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형 실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안 될 것이다. 그러므로 본 발명은 상기의 상세한 설명에서 언급되는 형태로만 한정되는 것은 아님을 잘 이해할 수 있을 것이다. 따라서 본 발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다. 또한, 본 발명은 첨부된 청구범위에 의해 정의되는 본 발명의 정신과 그 범위 내에 있는 모든 변형물과 균 등물 및 대체물을 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2018-0110826", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 자율주차를 위하여 구성된 플랫폼들과 유비퀴터스 센서네트워크(USN)를 도시한 예시도. 도 2는 본 발명의 자율주행통합제어기, ECU, 주요 플랫폼들과 각 플랫폼들의 주요장치와 센서등과 차량의 동작 제어를 설명하는 예시도. 도 3은 본 발명의 스마트폰, 앱, 자율주통합제어장치, ECU, 교통안내관제센터, 주차관제안내센터, 주차장 및 주 차제어시스템과 각 플랫폼들에 연결되어 구축된 센서네트로부터 제공된 정보를 기반으로 자율주행 차량이 출발 지에서 주차장까지 가는데 구조를 설명하는 예시도. 도 4는 본 발명의 자율주행통합제어장치의 구성과 ECU와 외부의 센서들을 설명하는 예시도 도 5는 본 발명의 자율주차를 위한 자율주행장치 시스템의 구성요소를 설명하는 예시도. 도 6은 주요 무선 통신 방식 별 성능을 비교하는 도면 도 7은 본 발명의 자율주행 차량이 스마트폰, 자율주통합제어기, 교통안내관제센터, 자율주차관제센터로부터 상 호 정보를 주고 받아 주행하는 통신방법을 설명하는 예시도 (자율주행플랫폼, 교통안내플랫폼, 주차관제플랫폼 기반) 도 8은 본 발명의 자율주행통합제어기와 플랫폼들을 이용하여 도심 내 출발지에서 주차장까지 차량이 자율주행 하여 찾아가는 과정을 설명하는 예시도 도 9는 본 발명의 자율주행통합제어기의 자율주행-자율주차 프로그램의 동작 플로우 차트에 대한 예시도. 도 10은 본 발명의 자동화된 원통형 주차장의 각 층별 주차 및 출차 시스템의 구조에 대하여 설명하는 예시도 도 11은 본 발명의 자동화된 원통형 주차장의 각 층별 3축 차량이송용 로봇의 이동방향과 동작에 대하여 설명하 는 예시도. 도 12는 본 발명의 다중 팔을 가진 3축 차량반송용 로봇을 설명하는 예시도. 도 13은 본 발명의 자동 주차제어시스템의 복수 개의 입구 및 출구 구성방법을 설명하는 예시도. 도 14는 본 발명의 각 층별 차량반송로봇에 의한 자동화된 주차 및 출차 시스템을 설명한 예시도. 도 15는 본 발명의 자주식 주차방식에 의한 각 층별 주차 및 출차 시스템에 대한 예시도."}
