{"patent_id": "10-2022-0010944", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0114586", "출원번호": "10-2022-0010944", "발명의 명칭": "인공지능 기반 선박용 HVAC 용량 추정 시스템 및 방법", "출원인": "주식회사 디섹", "발명자": "윤석용"}}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "선박용 HVAC 용량 추정 시스템에 있어서,현재 가지고 있는 HVAC 설계 데이터의 단변량 통계 및 다변량 분석을 수행하는 통계 분석 모듈;상기 통계 분석 모듈을 통해 통계 및 분석된 데이터를 통해 HVAC 용량을 추정할 수 있는 모델을 학습하고 평가하는 모델 생성 모듈;상기 모델 생성 모듈에서 학습이 완료된 모델을 결합하여 실제 선박용 HVAC 용량을 추정하는 앙상블 모델 모듈;및상기 앙상블 모델 모듈에서 추정된 HVAC 용량을 차트로 도식화하여 나타내는 도식화 모듈을 포함하며;선박의 초기 설계 단계에서 자체적으로 HVAC 용량 추정이 가능한 것을 특징으로 하는 인공지능 기반 선박용HVAC 용량 추정 시스템."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 통계 분석 모듈은,각 데이터의 특징별 분포를 확인할 수 있고, 설계자에게 해당 특징들에 따른 공기조화 용량 추정에 대한 마진을판단할 수 있도록 정보를 제공하는 것을 특징으로 하는 인공지능 기반 선박용 HVAC 용량 추정 시스템."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 통계 분석 모듈은, 기존 설계 데이터에 설계하고자 하는 선박의 특징을 입력하고 비교함으로써 현재 데이터가 어떤 특징에 밀집 또는 분산되어 있는지 확인 가능한 것을 특징으로 하는 인공지능 기반 선박용 HVAC 용량 추정 시스템."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 모델 생성 모듈은,딥러닝 모델이 학습하기 위해 필요한 하이퍼 파라미터를 사용자의 선택에 따라 값을 조정할 수 있으며;학습마다 입력되는 데이터 수, 전체 학습 횟수, 학습률 및 학습 체크포인트를 설정할 수 있는 것을 특징으로 하는 인공지능 기반 선박용 HVAC 용량 추정 시스템."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 앙상블 모델 모듈은, 공개특허 10-2023-0114586-3-공기조화 용량을 추정하고 결과값을 표에 출력하며;입력 데이터를 파일로 입력하거나 개별 값을 입력해줌으로써 단일 추정도 가능한 것을 특징으로 하는 인공지능기반 선박용 HVAC 용량 추정 시스템."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 도식화 모듈은,앙상블 모델 모듈에서 추정된 HVAC 용량의 결과를 특정 입력값의 변화에 따라 변화하는 차이를 가시화하여 확인할 수 있는 것을 특징으로 하는 인공지능 기반 선박용 HVAC 용량 추정 시스템."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "인공지능 기반 선박용 HVAC 용량 추정 방법에 있어서,선박의 HVAC 설계 데이터를 통계분석 모듈에서 단변량 통계 및 다변량 분석을 수행하는 통계 및 분석 단계;상기 통계 및 분석 단계에서 통계 및 분석된 데이터를 활용하여 모델 생성 모듈에서 공기조화 용량을 추정할 수있는 모델을 학습하고 평가하는 모델 생성 단계;상기 모델 생성 단계에서 학습된 모델을 앙상블 모델 모듈에서 결합하여 실제 선박용 공기조화 용량을 추정하는HVAC 용량 추정 단계; 및상기 HVAC 용량 추정 단계에서 추정된 공기조화 용량을 도식화 모듈을 통해 차트로 도식화하여 나타내는 도식화단계를 포함하며;선박의 초기 설계 단계에서 자체적으로 HVAC 용량 추정이 가능한 것을 특징으로 하는 인공지능 기반 선박용HVAC 용량 추정 방법."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 통계 및 분석 단계는,각 데이터의 특징별 분포를 확인할 수 있고, 설계자에게 해당 특징들에 따른 공기조화 용량 추정에 대한 마진을판단할 수 있도록 정보를 제공하는 것을 특징으로 하는 인공지능 기반 선박용 HVAC 용량 추정 방법."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 통계 및 분석 단계는,기존 설계 데이터에 설계하고자 하는 선박의 특징을 입력하고 비교함으로써 현재 데이터가 어떤 특징에 밀집 또는 분산되어 있는지 확인 가능한 것을 특징으로 하는 인공지능 기반 선박용 HVAC 용량 추정 방법."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7에 있어서,상기 모델 생성 단계는,공개특허 10-2023-0114586-4-딥러닝 모델이 학습하기 위해 필요한 하이퍼 파라미터를 사용자의 선택에 따라 값을 조정할 수 있으며;학습마다 입력되는 데이터 수, 전체 학습 횟수, 학습률 및 학습 체크포인트를 설정할 수 있는 것을 특징으로 하는 인공지능 기반 선박용 HVAC 용량 추정 방법."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 7에 있어서,상기 HVAC 용량 추정 단계는,공기조화 용량을 추정하고 결과값을 표에 출력하며;입력 데이터를 파일로 입력하거나 개별 값을 입력해줌으로써 단일 추정도 가능한 것을 특징으로 하는 인공지능기반 선박용 HVAC 용량 추정 방법."}
{"patent_id": "10-2022-0010944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 7에 있어서,상기 도식화 단계는,HVAC 용량 추정 단계에서 추정된 HVAC 용량의 결과를 특정 입력값의 변화에 따라 변화하는 차이를 가시화하여확인할 수 있는 것을 특징으로 하는 인공지능 기반 선박용 HVAC 용량 추정 방법."}
{"patent_id": "10-2022-0010944", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 선박용 HVAC 용량 추정 시스템에 있어서, 현재 가지고 있는 HVAC 설계 데이터의 단변량 통계 및 다변 량 분석을 수행하는 통계 분석 모듈; 상기 통계 분석 모듈을 통해 통계 및 분석된 데이터를 통해 HVAC 용량을 추 정할 수 있는 모델을 학습하고 평가하는 모델 생성 모듈; 상기 모델 생성 모듈에서 학습이 완료된 모델을 결합하 여 실제 선박용 HVAC 용량을 추정하는 앙상블 모델 모듈; 및 상기 앙상블 모델 모듈에서 추정된 HVAC 용량을 차 트로 도식화하여 나타내는 도식화 모듈을 포함하며; 선박의 초기 설계 단계에서 자체적으로 HVAC 용량 추정이 가 능한 것을 특징으로 하는 인공지능 기반 선박용 HVAC 용량 추정 시스템을 제안한다."}
{"patent_id": "10-2022-0010944", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 선박용 HVAC 용량 추정을 위한 딥러닝 모델 개발에 관한 것으로, 공기조화 시스템 설계 데이터를 활 용하여 공기조화 용량을 추정할 수 있는 인공지능 기반 선박용 HVAC 용량 추정 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0010944", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "선박 설계회사에서 선주의 발주로 견적 설계를 수행하게 된다. 이 과정에서 선박에 필요한 공기조화 시스템 장 비 선정 및 용량을 계산하기 위해 장비 공급업체에 견적을 요청하게 된다. 현재 국내 선박 제조 업체의 대부분 은 공기조화(HVAC) 장비 견적 산출을 위해 외주업체에 위탁을 하는 방식이며, 견적 설계의 특성 상 설계 변경이 자주 발생하게 되고, 이에 따른 공기조화 장비의 재선정 및 재계산을 수행하여야 한다. 또한 짧은 시간 내에 설 계된 자료를 토대로 초기 비용을 계산하여야 하므로 장비 공급업체의 빠른 대응이 필요하나 실제 업무 진행에서 는 다소 지체되는 상황이 발생한다. 따라서, 선박 설계회사에서 견적 설계에 필요한 공기조화 장비 선정을 위한 공기조화 용량을 추정할 수 있는 모 델 개발이 필요한 실정이다."}
{"patent_id": "10-2022-0010944", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존에 제안된 방법들의 상기와 같은 문제점들을 해결하기 위해 제안된 것으로서, 조선소 내에서 자 체적인 HVAC 시스템 견적을 산출하고 외주업체의 의존도를 줄일 수 있으며, HVAC 시스템 설계 데이터를 활용하 여 공기조화 용량을 추정할 수 있는 인공지능 기반 선박용 HVAC 용량 추정 시스템 및 방법을 제공하는 것을 목 적으로 한다."}
{"patent_id": "10-2022-0010944", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 특징에 따른 인공지능 기반 선박용 HVAC 용량 추정 시스템에 있어서, 현재 가지고 있는 HVAC 설계 데 이터의 단변량 통계 및 다변량 분석을 수행하는 통계 분석 모듈; 상기 통계 분석 모듈을 통해 통계 및 분석된 데이터를 통해 HVAC 용량을 추정할 수 있는 모델을 학습하고 평가하는 모델 생성 모듈; 상기 모델 생성 모듈에 서 학습이 완료된 모델을 결합하여 실제 선박용 HVAC 용량을 추정하는 앙상블 모델 모듈; 및 상기 앙상블 모델 모듈에서 추정된 HVAC 용량을 차트로 도식화하여 나타내는 도식화 모듈을 포함하며; 선박의 초기 설계 단계에서 자체적으로 HVAC 용량 추정이 가능한 것을 특징으로 한다. 바람직하게는, 상기 통계 분석 모듈은, 각 데이터의 특징별 분포를 확인할 수 있고, 설계자에게 해당 특징들에 따른 공기조화 용량 추정에 대한 마진을 판단할 수 있도록 정보를 제공하는 것을 특징으로 한다. 또한 바람직하게는, 상기 통계 분석 모듈은, 기존 설계 데이터에 설계하고자 하는 선박의 특징을 입력하고 비교 함으로써 현재 데이터가 어떤 특징에 밀집 또는 분산되어 있는지 확인 가능한 것을 특징으로 한다. 또한 바람직하게는, 상기 모델 생성 모듈은, 딥러닝 모델이 학습하기 위해 필요한 하이퍼 파라미터를 사용자의 선택에 따라 값을 조정할 수 있으며; 학습마다 입력되는 데이터 수, 전체 학습 횟수, 학습률 및 학습 체크포인 트를 설정할 수 있는 것을 특징으로 한다. 또한 바람직하게는, 상기 앙상블 모델 모듈은, 공기조화 용량을 추정하고 결과값을 표에 출력하며; 입력 데이터 를 파일로 입력하거나 개별 값을 입력해줌으로써 단일 추정도 가능한 것을 특징으로 한다. 또한 바람직하게는, 상기 도식화 모듈은, 앙상블 모델 모듈에서 추정된 HVAC 용량의 결과를 특정 입력값의 변화 에 따라 변화하는 차이를 가시화하여 확인할 수 있는 것을 특징으로 한다. 본 발명의 특징에 따른 인공지능 기반 선박용 HVAC 용량 추정 방법에 있어서, 선박의 HVAC 설계 데이터를 통계 분석 모듈에서 단변량 통계 및 다변량 분석을 수행하는 통계 및 분석 단계; 상기 통계 및 분석 단계에서 통계 및 분석된 데이터를 활용하여 모델 생성 모듈에서 공기조화 용량을 추정할 수 있는 모델을 학습하고 평가하는 모델 생성 단계; 상기 모델 생성 단계에서 학습된 모델을 앙상블 모델 모듈에서 결합하여 실제 선박용 공기조화 용량을 추정하는 HVAC 용량 추정 단계; 및 상기 HVAC 용량 추정 단계에서 추정된 공기조화 용량을 도식화 모듈 을 통해 차트로 도식화하여 나타내는 도식화 단계를 포함하며; 선박의 초기 설계 단계에서 자체적으로 HVAC 용 량 추정이 가능한 것을 특징으로 한다. 또한 바람직하게는, 상기 통계 및 분석 단계는, 각 데이터의 특징별 분포를 확인할 수 있고, 설계자에게 해당 특징들에 따른 공기조화 용량 추정에 대한 마진을 판단할 수 있도록 정보를 제공하는 것을 특징으로 한다. 또한 바람직하게는, 상기 통계 및 분석 단계는, 기존 설계 데이터에 설계하고자 하는 선박의 특징을 입력하고 비교함으로써 현재 데이터가 어떤 특징에 밀집 또는 분산되어 있는지 확인 가능한 것을 특징으로 한다. 또한 바람직하게는, 상기 모델 생성 단계는, 딥러닝 모델이 학습하기 위해 필요한 하이퍼 파라미터를 사용자의 선택에 따라 값을 조정할 수 있으며; 학습마다 입력되는 데이터 수, 전체 학습 횟수, 학습률 및 학습 체크포인 트를 설정할 수 있는 것을 특징으로 한다. 또한 바람직하게는, 상기 HVAC 용량 추정 단계는, 공기조화 용량을 추정하고 결과값을 표에 출력하며; 입력 데 이터를 파일로 입력하거나 개별 값을 입력해줌으로써 단일 추정도 가능한 것을 특징으로 한다. 또한 바람직하게는, 상기 도식화 단계는, HVAC 용량 추정 단계에서 추정된 HVAC 용량의 결과를 특정 입력값의 변화에 따라 변화하는 차이를 가시화하여 확인할 수 있는 것을 특징으로 한다."}
{"patent_id": "10-2022-0010944", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안하고 있는 인공지능 기반 선박용 HVAC 용량 추정 시스템 및 방법에 따르면, 선박용 공기조화 설계 데이터를 통계분석하고, 분석결과를 학습 데이터로 활용하여 공기조화 용량을 추정할 수 있는 인공지능 기 반 모델을 개발함으로써, 초기설계 단계에서 공급업체에 의존하지 않고 자체적으로 HVAC 용량 추정이 가능하며, 마진 적용을 통해 초기비용 추산이 가능하다. 이로 인해 잦은 설계 변경에 대한 업무의 지체도 예방하고, 데이터 축적에 따라 과도한 비용 추산을 예방할 수 있다."}
{"patent_id": "10-2022-0010944", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하면서 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 본 발명의 이점 및 특징, 그리고 그것을 달성하는 방법은 첨부된 도면과 함께 상세하게 후술되어 있는 실시예들 을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에 개시되는 실시예들에 의해 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것"}
{"patent_id": "10-2022-0010944", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이며, 단지 본 실시예들은 본발명의 개시가 완전하도록 하며, 본 발명이 속하는 기술분야에서 통상의 지식을 가 진자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐 이다. 또한, 본 발명을 설명함에 있어 관련된 공지기술 등이 본 발명의 요지를 흐리게 할수 있다고 판단되는 경우 그 에 관한 자세한 설명은 생략하기로 한다. 도 1은 일반적인 조선소와 HVAC 제조업체 간의 업무 프로세스를 나타내는 개략 개념도이고, 도 2는 본 발명의 실시예에 따른 인공지능 기반 선박용 HVAC 용량 추정 시스템의 구성을 나타내는 블록도이고, 도 3은 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그램의 통계 분석 모듈 화면을 나타내는 도면이고, 도 4는 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함 하는 프로그램의 데이터 세트 및 특정 데이터의 데이터 분포 화면을 나타내는 도면이고, 도 5는 본 발명의 실시 예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그램의 모델 생성 모듈 화면을 나 타내는 도면이고, 도 6은 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하 는 프로그램의 앙상블 모델 모듈 화면을 나타내는 도면이고, 도 7 및 도 8은 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그램의 도식화 모듈 화면을 나타내는 도면이고, 도 9 는 본 발명의 실시예에 따른 인공지능 기반 선박용 HVAC 용량 추정 방법을 나타내는 흐름도이다. 도 1에 도시된 바와 같이, 일반적인 조선소와 HVAC 제조업체 간의 업무 프로세스를 살펴보면, 조선소에서 견적 설계에서 초기 HVAC 용량 및 장비 견적을 요청한다. HVAC 제조업체는 조선소에서 수신한 요청에 대하여 HVAC 용량(capacity) 추정 및 장비 견적서를 제공한다. 조선소는 HVAC 제조업체로부터 견적서를 수령 후 설계 변경에 따른 장비 견적을 재요청 한다. 이에 HVAC 제조업체는 재요청 사항을 반영하여 견적서를 수정한다. 이어서, 조선서는 재요청하여 수령한 견적서에 대하여 설계 변경에 따른 장비 견적을 재요청하고, HVAC 제조업 체는 재요청 사항을 반영하여 견적서를 또 수정할 수 있다. 따라서, 반복되는 잦은 설계 변경에 따른 업무 비효율성의 개선과 짧은 시간 내에 설계된 자료를 토대로 초기 비용을 계산하여야 하므로 조선소의 견적 설계에 필요한 공기조화 장비 선정을 위한 HVAC 용량을 추정할 수 있 는 모델 개발이 필요하다. 도 2 내지 도 8을 참조하면, 본 발명에 따른 인공지능 기반 선박용 HVAC 용량 추정 시스템은 학습 및 평가 프로그램과 추정 프로그램을 포함한다. 소프트웨어 구성은 Python 언어(3.6)를 이용하여, 알고리즘 및 GUI 개발을 수행하였으며, 데이터 처리에는 Pandas와 Numpy, 학습 알고리즘은 Tensorflow 라이브러리를 사용하였고, 학습결과 도식화 및 GUI 구성은 PyQt5 버전을 사용하였다. 학습 및 평가 프로그램은 데이터 통계분석 모듈과 모델 생성 모듈이 탑재되어 있고, 추정 프로 그램은 앙상블 모델 모듈과 도식화 모듈이 탑재되어 있다. HVAC란 난방(Heating), 통풍(Ventilation) 또는 공기조화(Air Conditioning)에 관한 것으로, 선박의 내부에 난 방, 통풍 및 공기조화를 위해 설치된다. HVAC는 난방장치, 환기장치 또는 에어컨 등의 공조장치와 이러한 공조장치와 연결되며 공기가 이동하는 통로인 배관을 포함한다. 본 발명의 특징에 따른 인공지능 기반 선박용 HVAC 용량 추정 시스템은 선박용 HVAC 용량을 추정하는 딥러닝 모 델로서, HVAC 용량 데이터를 통계 분석하는 데이터 통계 분석 모듈과, HVAC 용량을 추정할 수 있는 모델을 학습하고 평가하는 모델을 생성하는 모델 생성 모듈과, 학습된 모델을 결합하여 실제 선박용 HVAC 용량을 추정하는 HVAC 용량 추정 앙상블 모델 모듈과, 앙상블 모델 모듈에서 추정된 HVAC 용량을 차트로 도 식화하여 나타내는 도식화 모듈을 포함하며, 4개의 모듈이 프로그램 상에 포함되어 있다. 도 3은 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그램의 통계 분석 모듈 화면을 나타내는 도면이고, 도 4는 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그램의 데이터 세트 및 특정 데이터의 데이터 분포 화면을 나타내는 도면이다. 도 3 및 도 4를 참조하면, 통계 분석 모듈은 현재 가지고 있는 HVAC 설계 데이터의 단변량 통계 및 다변량 분석 수행이 가능하다. 각 데이터의 특징 별 분포를 확인할 수 있고, 설계자에게 해당 특징들에 따른 HVAC 용량 추정에 대한 마진을 판단하는데 도움을 준다. 추가적으로 기존 설계 데이터에 설계하고자 하는 선박의 특징을 입력하고 비교함으로써 도 4(a)에 도시된 바와 같이 데이터 세트를 나타내고 도 4(b)와 같이 특정 데이터의 데 이터 분포를 나타낼 수 있다. 따라서, 현재 데이터가 어떤 특징에 밀집 또는 분산되어 있는지 확인 가능하다. 도 5를 참조하면, 모델 생성 모듈은 인공지능 기반의 학습 모델을 생성하기 위한 기능이 포함되어 있다. 학습 및 시험 데이터의 특징 개수를 선택하고 특징 개수에 맞는 학습 데이터와 시험 데이터를 불러와 해당 파일 을 표 1과 같이 테이블 형태로 확인할 수 있다. 표 1"}
{"patent_id": "10-2022-0010944", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "딥러닝 모델이 학습하기 위해 필요한 하이퍼 파라미터(Hyper parameter)를 사용자의 선택에 따라 값을 조정할 수 있으며, 학습마다 입력되는 데이터 수, 전체 학습 횟수, 학습률 및 학습 체크포인트를 설정할 수 있다. 학습할 딥러닝 모델을 선택하고 학습을 수행하게 되며, 학습 결과를 차트로 확인할 수 있다. 학습이 완료된 모 델에 시험 데이터를 입력 후 결과 확인 및 결과를 파일로 저장이 가능하다. 다음으로 도 6을 참조하면, 앙상블 모델 모듈은 학습 및 평가 프로그램에서 학습이 완료된 모델을 앙상블 기법을 이용하여 새로운 모델을 구성한다. 학습된 모델의 특징 개수를 선택하고, 모델이 저장되어 있는 경로를 설정하고, 데이터 파일을 입력하여 HVAC 용량을 추정한다. 설정된 경로의 모델을 불러와 앙상블 모델을 구성하고, HVAC 용량을 추정하게 되며 결과값을 표에 출력한다. 입 력 데이터를 파일로도 입력이 가능하고, 개별 값을 입력해줌으로써 단일 데이터 추정도 가능하다. - 추정된 결과값에 해당 데이터의 특성에 따라 사용자가 보정계수를 적용하여 계산이 가능하며, 테이블로 출력 이 가능하다. 즉, 앙상블 모델 모듈은 모델 생성 모듈에서 학습이 완료된 모델이 저장되어 있는 경로를 설정하고, 데이터 파일을 입력하여 HVAC 용량을 추정할 수 있다. 설정된 경로의 모델을 불러와 앙상블 모델을 구성하고, HVAC 용량을 추정하게 되며 결과값을 표에 출력한다. 입력 데이터를 파일로도 입력이 가능하고, 연구로 얻어진 개별 값을 입력해줌으로써 단일 추정도 가능하다. 여기서 앙상블 모델 모듈의 앙상블(Ensemble)은 여러 개의 모델을 조합하여 결과를 예측하는 방식으로 정 확도가 높은 모델 하나를 쓰는 것보다, 정확도가 낮은 모델을 여러 개 조합하는 방식으로 결과를 예측하는 것을 의미할 수 있다. 또한, 학습을 시킬 때 한가지 알고리즘을 사용하는 것이 아니라 다양한 알고리즘을 적용하여 여러 모델을 만들 어내는 형태를 나타낸다. 이것에 의해 앙상블 모듈은 과적합(Overfitting)을 감소시킬 수 있으며, 예측 정확도를 높일 수 있다. 각 모델별로 발생하는 편파성(bias)를 종합하여 예측을 하기 때문에 과적합이 발생할 확률을 줄여줄 수 있다. 또한, 다양한 모델의 결과를 종합하여 예측 결과를 만들어 내면서 예측 정확도가 향상될 수 있는 것을 특징으로 한다. 예를 들어, 주어진 데이터에서 랜덤 샘플링을 통해서 여러 학습 데이터를 만들고, 만들어진 학습 데이터를 모델 에 적용시키고 나서, 예측된 여러 결과 값들을 통계하여 분석하여 최종 결과값을 산출하는 방식이다. 다음으로 도 7 및 도 8을 참조하면, HVAC 용량 도식화 모듈은, 앙상블 모델 모듈에서 추정된 HVAC 용 량의 결과를 특정 입력값의 변화에 따라 변화하는 차이 확인을 위한 가시화 용도의 기능을 한다.도 7에서 빈칸에 HVAC 용량을 입력하면 차이를 하나의 도식화된 표에서 확인이 가능하다. 또한, 도 8에서와 같이, 특정 입력값의 변화에 따라 변화하는 차이 확인을 위한 가시화를 진행할 수 있다. 따라서 본 발명은 선박용 HVAC 용량 추정을 위한 딥러닝 모델 학습 및 추정 프로그램으로, 선박용 HVAC 설계 데 이터를 통계분석하고, 분석결과를 학습 데이터로 활용하여 HVAC 용량을 추정할 수 있는 인공지능 기반 모델이다. 초기 설계 단계에서 외주업체에 의존하지 않고 자체적으로 HVAC 용량 추정이 가능하며, 마진 적용을 통해 초기 비용 추산이 가능하다. 이로 인해 잦은 설계 변경에 대한 업무의 지체도 예방하고, 데이터 축적에 따라 과도한 비용 추산을 예방할 수 있는 효과를 가진다. 따라서 본 발명에 따르면, 선주의 발주로 견적 설계 단계에서 확인 가능한 Spec. 정보를 이용하여 초기에 HVAC 용량을 추정함으로써 선주의 요청에 빠른 대응이 가능한 효과를 가진다. 또한, Spec. 상에 나와 있는 데이터를 개별 입력하여 HVAC 용량 추정이 가능하다. 또한, 사용자의 노하우 및 특성에 따라 데이터셋을 새로 구성하여 학습 모델 구성이 가능하며, 추가 데이터 확 보에 따라 지속적인 학습을 통해 추정 모델 개선 및 발전 가능하다. 도 9를 참조하여, 본 발명의 실시예에 따른 인공지능 기반 선박용 HVAC 용량 추정 방법을 나타내는 흐름을 살펴 보면, 선박용 HVAC 설계 데이터를 통계분석 모듈에서 통계 분석하는 데이터 통계 및 분석 단계(S110)와, 상기 데이터 통계 및 분석 단계(S110)를 통해 분석결과를 학습 데이터로 활용하여 모델 생성 모듈에서 HVAC 용량을 추정할 수 있는 모델을 학습하고 평가하는 모델을 생성하는 단계(S120)와, 상기 모델을 생성하는 단계에서 학습 된 모델을 앙상블 모델 모듈에서 결합하여 실제 선박용 HVAC 용량을 추정하는 단계(S130)와, 상기 HVAC 용량을 추정하는 단계에서 추정된 HVAC 용량을 도식화 모듈에서 차트로 도식화하여 나타내는 단계(S140)를 포함하는 것 을 특징으로 한다. 이것에 의해 본 발명은 선박용 HVAC 설계 데이터를 통계분석하고, 분석결과를 학습 데이터로 활용하여 HVAC 용 량을 추정할 수 있는 인공지능 기반 모델을 통하여, 초기설계 단계에서 공급업체에 의존하지 않고 자체적으로 HVAC 용량 추정이 가능하며, 마진 적용을 통해 초기비용 추산이 가능하다. 이로 인해 잦은 설계 변경에 대한 업 무의 지체도 예방하고, 데이터 축적에 따라 과도한 비용 추산을 예방할 수 있는 효과를 가진다. 지금까지 본 발명의 인공지능 기반 선박용 HVAC 용량 추정 시스템 및 방법에 관한 구체적인 실시예에 관하여 설 명하였으나, 본 발명의 범위에서 벗어나지 않는 한도 내에서는 여러가지 실시변형이 가능함은 자명하다. 그러므로 본 발명의 범위에는 설명된 실시예에 국한되어 전해져서는 안되며, 후술하는 특허청구범위 뿐만 아니 라 이 특허청구범위와 균등한 것들에 의해 정해져야 한다. 즉, 전술된 실시예는 모든 면에서 예시적인 것이며, 한정적인 것이 아닌 것으로 이해되어야 하며, 본 발명의 범 위는 상세한설명 보다는 후술될 특허청구범위에 의하여 나타내어지며, 그 특허청구범위의 의미 및 범위 그리고 그 등가 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본발명의 범위에 포함되는 것으로 해석되어야 한 다."}
{"patent_id": "10-2022-0010944", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일반적인 조선소와 HVAC 제조업체 간의 업무 프로세스를 나타내는 개략 개념도이다. 도 2는 본 발명에 따른 인공지능 기반 선박용 HVAC 용량 추정 시스템의 구성을 나타내는 블록도이다. 도 3은 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그램의 통계 분석 모듈 화면을 나타내는 도면이다. 도 4는 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그램의 데이 터 세트 및 특정 데이터의 데이터 분포 화면을 나타내는 도면이다. 도 5는 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그램의 모델 생성 모듈 화면을 나타내는 도면이다. 도 6은 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그램의 앙상 블 모델 모듈 화면을 나타내는 도면이다. 도 7 및 도 8은 본 발명의 실시예에 따른 선박용 HVAC 용량 추정을 위한 인공지능 알고리즘을 포함하는 프로그 램의 도식화 모듈 화면을 나타내는 도면이다. 도 9는 본 발명의 실시예에 따른 인공지능 기반 선박용 HVAC 용량 추정 방법을 나타내는 흐름도이다."}
