{"patent_id": "10-2019-0141025", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0054849", "출원번호": "10-2019-0141025", "발명의 명칭": "인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법 및 장치", "출원인": "박제영", "발명자": "박제영"}}
{"patent_id": "10-2019-0141025", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법으로서,광고주 서버로부터 광고대상제품정보 및 광고게재기간정보를 수신하는 단계;SNS 서비스를 제공하는 적어도 하나의 SNS 서버로부터 인플루언서와 연관된 정보를 수신하는 단계;상기 적어도 하나의 SNS 서버로부터 상기 인플루언서를 팔로잉하는 팔로워들과 연관된 정보를 수신하는 단계;온라인쇼핑 서비스를 제공하는 적어도 하나의 온라인쇼핑몰 서버로부터 상기 팔로워들의 제품구매정보를 수신하는 단계;인공지능 기계학습모델을 이용하여, 상기 광고대상제품정보, 상기 팔로워들과 연관된 정보 및 상기 팔로워들의제품구매정보에 기초하여, 상기 팔로워들의 제품구매예정시기를 추정하는 단계;상기 팔로워들과 연관된 정보, 상기 제품구매예정시기 및 상기 광고게재기간정보에 기초하여 각 팔로워에 대한구매가능성점수를 산정하고, 상기 인플루언서와 연관된 정보 및 상기 팔로워들의 구매가능성점수에 기초하여 상기 인플루언서의 광고적합성점수를 산정하는 단계; 및복수의 인플루언서에 대한 상기 광고적합성점수에 기초하여 상기 광고대상제품과 매칭될 인플루언서를 결정하는단계를 포함하는, 인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법."}
{"patent_id": "10-2019-0141025", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 인플루언서와 연관된 정보는, 상기 인플루언서가 업로드한 콘텐츠정보, 상기 콘텐츠와 연관된 제품정보,및 상기 인플루언서를 팔로잉하는 팔로워들의 계정정보 중 적어도 하나를 포함하는 것을 특징으로 하는, 인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법."}
{"patent_id": "10-2019-0141025", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 팔로워들과 연관된 정보는, 각 팔로워의 나이, 성별, 지역, 성격, 또는 성향을 포함하는 인적정보, 각 팔로워가 업로드한 콘텐츠정보 및 상기 콘텐츠와 연관된 제품정보, 및 각 팔로워의 온라인쇼핑몰 계정정보 중 적어도 하나를 포함하는 것을 특징으로 하는, 인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법."}
{"patent_id": "10-2019-0141025", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 팔로워들의 제품구매정보는, 상기 팔로워들이 온라인쇼핑몰에서 구매하거나 구매의사를 표시한 제품의 종류와 용량 및 이에 기초하여 산정한 사용기간정보를 포함하는 것을 특징으로 하는, 인공지능을 이용하여 제품과인플루언서를 매칭하는 방법."}
{"patent_id": "10-2019-0141025", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2021-0054849-3-제4항에 있어서,상기 인공지능 기계학습모델은, 상기 광고대상제품과 상기 팔로워들이 온라인쇼핑몰에서 구매하거나 구매의사를표시한 제품이 상이할 경우, 제품의 유사도를 고려하여 상기 팔로워들의 제품구매예정시기를 추정하는 것을 특징으로 하는, 인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법."}
{"patent_id": "10-2019-0141025", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 구매가능성점수는, 상기 팔로워들의 제품구매예정시기 및 상기 광고게재기간이 일치하는지 여부를 고려하여 산정되며,상기 인플루언서의 광고적합성점수는, 상기 인플루언서를 팔로잉하는 팔로워들의 숫자와 상기 팔로워들의 평균구매가능성점수를 고려하여 산정되는 것을 특징으로 하는, 인공지능을 이용하여 제품과 인플루언서를 매칭하는방법."}
{"patent_id": "10-2019-0141025", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 따른 인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법을 실행하기위한 컴퓨터 프로그램이 기록된 컴퓨터로 판독 가능한 기록매체."}
{"patent_id": "10-2019-0141025", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능을 이용하여 광고대상제품과 인플루언서(influencer)를 매칭하는 방법 및 장치에 관한 것이다. 본 발명의 일 실시예에 따르면, 광고주가 인플루언서를 통해 제품을 광고하고자 할 때, 인공지능 기계학 습모델을 이용해 해당 인플루언서를 팔로잉하는 팔로워들의 제품구매예정시기를 추정함으로써, 실제로 광고대상 제품을 구매할 가능성이 더 높은 팔로워들을 보유한 인플루언서를 광고모델로 선정할 수 있다. 구체적으로, 팔로 워들의 온라인 쇼핑 내역을 통해 해당 팔로워들이 광고대상제품을 구매할 가능성을 추정할 수 있고, 광고주는 실 제로 광고대상제품을 구매할 가능성이 더 높은 팔로워들을 보유한 인플루언서를 광고모델로 선정하여 보다 효과 적인 제품 홍보가 가능하다."}
{"patent_id": "10-2019-0141025", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 이용하여 광고대상제품과 인플루언서(influencer)를 매칭하는 방법 및 장치에 관한 것으 로서, 더욱 상세하게는 광고주가 인플루언서를 통해 제품을 광고하고자 할 때, 인공지능 기계학습모델을 이용해 해당 인플루언서를 팔로잉하는 팔로워들의 제품구매예정시기를 추정함으로써, 제품의 구매가능성이 보다 높은 팔로워들을 보유한 인플루언서를 광고모델로 선정할 수 있도록 하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2019-0141025", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인플루언서(influencer)란 '영향력을 행사하는 사람'이라는 뜻으로서, 소셜네트워크서비스(SNS)에서 많은 수의 팔로워(인플루언서가 업로드하는 콘텐츠를 구독하는 사용자)를 보유한 유명인을 지칭한다. 소셜네트워크서비스 는 특정 관심사나 활동을 공유하는 사람들 사이의 관계망을 구축해 주는 온라인 서비스로서, 페이스북 (Facebook), 트위터(Twitter), 인스타그램(Instagram), 유튜브(Youtube), 인터넷 블로그(blog) 등이 이에 해당 한다. 최근 스마트폰 등 인터넷 단말기의 보급으로 인해 소셜네트워크서비스의 이용자가 증가함에 따라, 이러한 인플 루언서를 마케팅에 활용하고자 하는 기업이 증가하고 있다. 인플루언서를 통한 SNS 마케팅은 영화배우나 스포츠 스타 등 전통적인 광고모델을 통한 TV 마케팅에 비해 효율적인 것으로 알려져 있다. TV나 라디오를 이용한 광고 는 불특정 다수에게 광고를 전달해야 하므로 대부분의 사람들에게 영향력을 미칠 수 있는 정도의 높은 인지도를 가진 연예인을 기용하는 것이 일반적이지만, 인플루언서는 특정 분야에서 특정 관심사를 공유하는 팔로워들에 대해서 특히 높은 인지도를 가지므로 팔로워들이 관심을 가질만한 제품을 집중적으로 홍보하기가 용이하다. 예를 들어, 뷰티 유튜버(화장품 리뷰 또는 화장 노하우와 관련된 콘텐츠를 업로드하는 인플루언서)를 화장품 광 고모델로 기용하면, 화장품에 관심이 많은 팔로워들에게 제품을 효과적으로 홍보할 수 있으며, 키즈 유튜버(어 린이를 대상으로 한 방송 콘텐츠를 업로드하는 인플루언서)를 장난감 광고모델로 기용하면, 저연령층의 팔로워 들에게 제품을 효과적으로 홍보할 수 있다. 또한, 인플루언서들 대부분은 유명 영화배우나 스포츠스타에 비해 저렴한 비용으로 고용할 수 있다. 이러한 광고는 일반적으로 인플루언서가 직접 광고모델이 되거나, 인플루언서가 업로드하는 콘텐츠(텍스트, 사진, 영상 등)의 중간에 제품 광고영상이 삽입되는 방식으로 이루어진다. 일반적인 인플루언서 마케팅에 있어서 광고주(광고대상제품의 판매자이자 광고모델을 기용하고자 하는 기업 등)는 효과적인 광고를 위해 인플루언서가 업로드하는 콘텐츠의 종류를 고려하고(해당 콘텐츠와 광고대상제품의 관련성이 높을수록 팔로워들에게 효과적인 홍보가 가능하므로) 인플루언서가 보유한 팔로워가 몇 명인지(즉, 광 고가 몇 명의 사람들에게 영향을 미칠 수 있는지)를 고려하여 광고계약을 체결할 인플루언서를 선정하게 된다. 그러나 단순히 인플루언서들 간의 팔로워 수를 비교하는 것만으로는 해당 팔로워들 중 실제 구매의사를 가진 실 구매자의 수가 얼마나 되는지 정확히 판단할 수 없는 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-1896668호"}
{"patent_id": "10-2019-0141025", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은 인공지능 기계학습모델을 이용하여 광고를 시청한 후 실제로 제품을 구매할 확률이 더 높은 팔 로워들을 보유한 인플루언서를 결정하기 위한 방법 및 장치를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2019-0141025", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 바람직한 실시예들이 제공된다. 일 실시예에 따른 인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법은, 광고주 서버로부터 광고대상제품 정보 및 광고게재기간정보를 수신하는 단계; SNS 서비스를 제공하는 적어도 하나의 SNS 서버로부터 인플루언서 와 연관된 정보를 수신하는 단계; 상기 적어도 하나의 SNS 서버로부터 상기 인플루언서를 팔로잉하는 팔로워들 과 연관된 정보를 수신하는 단계; 온라인쇼핑 서비스를 제공하는 적어도 하나의 온라인쇼핑몰 서버로부터 상기 팔로워들의 제품구매정보를 수신하는 단계; 인공지능 기계학습모델을 이용하여, 상기 광고대상제품정보, 상기 팔로워들과 연관된 정보 및 상기 팔로워들의 제품구매정보에 기초하여, 상기 팔로워들의 제품구매예정시기를 추 정하는 단계; 상기 팔로워들과 연관된 정보, 상기 제품구매예정시기 및 상기 광고게재기간정보에 기초하여 각 팔로워에 대한 구매가능성점수를 산정하고, 상기 인플루언서와 연관된 정보 및 상기 팔로워들의 구매가능성점수 에 기초하여 상기 인플루언서의 광고적합성점수를 산정하는 단계; 및 복수의 인플루언서에 대한 상기 광고적합 성점수에 기초하여 상기 광고대상제품과 매칭될 인플루언서를 결정하는 단계를 포함한다. 일 실시예에서, 상기 인플루언서와 연관된 정보는, 상기 인플루언서가 업로드한 콘텐츠정보, 상기 콘텐츠와 연 관된 제품정보, 및 상기 인플루언서를 팔로잉하는 팔로워들의 계정정보 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 상기 팔로워들과 연관된 정보는, 각 팔로워의 나이, 성별, 지역, 성격, 또는 성향을 포함하는 인적정보, 각 팔로워가 업로드한 콘텐츠정보 및 상기 콘텐츠와 연관된 제품정보, 및 각 팔로워의 온라인쇼핑몰 계정정보 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 상기 팔로워들의 제품구매정보는, 상기 팔로워들이 온라인쇼핑몰에서 구매하거나 구매의사를 표 시한 제품의 종류와 용량 및 이에 기초하여 산정한 사용기간정보를 포함할 수 있다. 일 실시예에서, 상기 인공지능 기계학습모델은, 상기 광고대상제품과 상기 팔로워들이 온라인쇼핑몰에서 구매하 거나 구매의사를 표시한 제품이 상이할 경우, 제품의 유사도를 고려하여 상기 팔로워들의 제품구매예정시기를 추정할 수 있다. 일 실시예에서, 상기 구매가능성점수는, 상기 팔로워들의 제품구매예정시기 및 상기 광고게재기간이 일치하는지 여부를 고려하여 산정되며, 상기 인플루언서의 광고적합성점수는, 상기 인플루언서를 팔로잉하는 팔로워들의 숫 자와 상기 팔로워들의 평균 구매가능성점수를 고려하여 산정될 수 있다.실시예들에 따른 인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법을 실행하기 위한 컴퓨터 프로그램이 기록된 컴퓨터로 판독 가능한 기록매체가 제공될 수 있다. 일 실시예에 따른 인공지능을 이용하여 제품과 인플루언서를 매칭하는 장치는 저장부 및 처리부를 포함하고, 상 기 저장부는, 광고주 서버로부터 광고대상제품정보 및 광고게재기간정보를 수신하여 저장하고, SNS 서비스를 제 공하는 적어도 하나의 SNS 서버로부터 인플루언서와 연관된 정보를 수신하여 저장하고, 상기 적어도 하나의 SNS 서버로부터 상기 인플루언서를 팔로잉하는 팔로워들과 연관된 정보를 수신하여 저장하고, 온라인쇼핑 서비스를 제공하는 적어도 하나의 온라인쇼핑몰 서버로부터 상기 팔로워들의 제품구매정보를 수신하여 저장하도록 구성되 고, 상기 처리부는, 상기 광고대상제품정보, 상기 팔로워들과 연관된 정보 및 상기 팔로워들의 제품구매정보에 기초하여, 인공지능 기계학습모델을 이용하여 상기 팔로워들의 제품구매예정시기를 추정하고, 상기 팔로워들과 연관된 정보, 상기 제품구매예정시기 및 상기 광고게재기간정보에 기초하여 각 팔로워에 대한 구매가능성점수를 산정하고, 상기 인플루언서와 연관된 정보 및 상기 팔로워들의 구매가능성점수에 기초하여 상기 인플루언서의 광고적합성점수를 산정하고, 복수의 인플루언서에 대한 상기 광고적합성점수에 기초하여 상기 광고대상제품과 매칭될 인플루언서를 결정하도록 구성된다. 일 실시예에서, 상기 인플루언서와 연관된 정보는, 상기 인플루언서가 업로드한 콘텐츠정보, 상기 콘텐츠와 연 관된 제품정보, 및 상기 인플루언서를 팔로잉하는 팔로워들의 계정정보 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 상기 팔로워들과 연관된 정보는, 각 팔로워의 나이, 성별, 지역, 성격, 또는 성향을 포함하는 인적정보, 각 팔로워가 업로드한 콘텐츠정보 및 상기 콘텐츠와 연관된 제품정보, 및 각 팔로워의 온라인쇼핑몰 계정정보 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 상기 팔로워들의 제품구매정보는, 상기 팔로워들이 온라인쇼핑몰에서 구매하거나 구매의사를 표 시한 제품의 종류와 용량 및 이에 기초하여 산정한 사용기간정보를 포함할 수 있다. 일 실시예에서, 상기 인공지능 기계학습모델은, 상기 광고대상제품과 상기 팔로워들이 온라인쇼핑몰에서 구매하 거나 구매의사를 표시한 제품이 상이할 경우, 제품의 유사도를 고려하여 상기 팔로워들의 제품구매예정시기를 추정할 수 있다. 일 실시예에서, 상기 구매가능성점수는, 상기 팔로워들의 제품구매예정시기 및 상기 광고게재기간이 일치하는지 여부를 고려하여 산정되며, 상기 인플루언서의 광고적합성점수는, 상기 인플루언서를 팔로잉하는 팔로워들의 숫 자와 상기 팔로워들의 평균 구매가능성점수를 고려하여 산정될 수 있다."}
{"patent_id": "10-2019-0141025", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 광고주가 인플루언서를 통해 제품을 광고하고자 할 때, 인공지능 기계학습모델 을 이용해 해당 인플루언서를 팔로잉하는 팔로워들의 제품구매예정시기를 추정함으로써, 실제로 광고대상제품을 구매할 가능성이 더 높은 팔로워들을 보유한 인플루언서를 광고모델로 선정할 수 있다. 일 실시예에 따르면, 팔로워들의 제품구매예정시기를 추정함에 있어서, SNS 서버로부터 제공 받은 팔로워들의 정보(나이, 성별, 지역, 성격 등)와 온라인쇼핑몰 서버로부터 제공 받은 팔로워들의 제품구매정보(언제 어떤 제 품을 구매하였는지) 등을 종합적으로 고려할 수 있다. 기존에는 광고주가 인플루언서를 광고모델로 선정함에 있어서 인플루언서가 보유한 팔로워의 수를 단순 비교하 였으나, 이것만으로는 팔로워들 중 실제 구매의사를 가진 잠정고객이 얼마나 되는지 판단하기가 어려웠다. 본 발명의 실시예에 따르면 팔로워들의 온라인 쇼핑 내역으로부터 해당 팔로워들이 광고대상제품을 구매할 가능성 을 추정할 수 있고, 광고주는 실제로 광고대상제품을 구매할 가능성이 더 높은 팔로워들을 보유한 인플루언서를 광고모델로 선정하여 보다 효과적인 제품 홍보가 가능하다."}
{"patent_id": "10-2019-0141025", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어는 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어를 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 관례 또는 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 명세서의 설명 부분에서 그 의미를 기 재할 것이다. 따라서 본 명세서에서 사용되는 용어는, 단순한 용어의 명칭이 아닌 그 용어가 가지는 실질적인 의미와 본 명세서의 전반에 걸친 내용을 토대로 해석되어야 함을 밝혀두고자 한다. 또한, 본 명세서에 기술된 실시예는 전적으로 하드웨어이거나, 부분적으로 하드웨어이고 부분적으로 소프트웨어 이거나, 또는 전적으로 소프트웨어인 측면을 가질 수 있다. 본 명세서에서 \"부(unit)\", \"장치(device)\", \"서버 (server)\" 또는 \"시스템(system)\" 등은 하드웨어, 하드웨어와 소프트웨어의 조합, 또는 소프트웨어 등 컴퓨터 관련 엔티티(entity)를 지칭한다. 예를 들어, 부, 모듈, 장치, 서버 또는 시스템은 플랫폼(platform)의 일부 또 는 전부를 구성하는 하드웨어 및/또는 상기 하드웨어를 구동하기 위한 애플리케이션(application) 등의 소프트 웨어를 지칭하는 것일 수 있다. 이하 첨부 도면들 및 첨부 도면들에 기재된 내용들을 참조하여 실시예를 상세하게 설명하지만, 청구하고자 하는 범위는 실시예들에 의해 제한되거나 한정되는 것은 아니다. 광고대상제품 및 인플루언서의 매칭 시스템 도 1은 일 실시예에 따른 인공지능을 이용하여 제품과 인플루언서를 매칭하는 시스템을 나타낸 구성도이다. 도 1을 참조하면, 일 실시예에 따른 시스템은, 인공지능을 이용하여 제품과 인플루언서를 매칭하기 위한 장치 , 광고주 서버, SNS 서버, 온라인쇼핑몰 서버로 구성될 수 있다. 실시예에서, 상기 장치는 저장부, 처리부 및 인공지능 기계학습모델을 포함할 수 있다. 일 실시예에서, 저장부는 CD-ROM, RAM, ROM, 메모리 카드, 하드 디스크, 광자기 디스크, 스토리지 디바이 스 등 데이터를 저장하고 필요한 시점에 꺼낼 수 있는 기억장치를 의미한다. 저장부는 네트워크 모듈을 이 용하여 각 서버로부터 데이터를 수신 및 저장한다. 또한, 매칭 알고리즘을 수행하기 위한 컴퓨터 프로그램 명령 들을 저장하거나, 인공지능 기계학습모델을 구동하기 위한 프로그램 명령들을 저장하도록 구성될 수 있다. 저장부는 광고주 서버로부터 광고대상제품정보 및 광고게재기간정보를 수신하여 저장한다. 광고주는 광고대상제품의 실제 판매자로서 광고모델로 선정된 인플루언서에게 광고료를 지급하는 주체이다. 광고주는 되 도록 저렴한 비용으로 최대한의 광고효과를 얻고자 하므로, 인플루언서 마케팅에 있어서 광고모델인 인플루언서 가 얼마나 많은 팔로워들에게 영향을 미치는지, 해당 팔로워들이 실제로 제품을 구매할 가능성이 얼마나 되는지 등의 요인을 고려한다. 광고주 서버는 광고주가 직접 운영하거나 광고주로부터 위임 받은 대리인(광고사)이 운영하는 서버로서, 게 재될 광고의 대상이 되는 제품(즉, 광고주가 홍보하고자 하는 제품)에 관한 정보 및 해당 광고를 언제부터 언제 까지 게재할지에 대한 정보 등을 네트워크를 통해 장치에 전송한다(편의상 \"장치\"로 표현하였으나 반드시 하드웨어적인 단일 구성요소만을 의미하는 것은 아니며, 제품-인플루언서 매칭 서비스를 제공하는 서비스제공자 가 운영하는 서버일 수 있다). 예를 들어, 광고주인 S사는 샴푸(머리를 감을 때 쓰는 세정제품)를 제조 및 판매하는 회사이다. S사는 자사가 새롭게 개발하여 판매 중인 샴푸 제품을 홍보하기 위해 유튜브(Youtube)에서 활동 중인 인플루언서 중 한 명을 광고모델로 기용하고자 한다. S사는 장치와 네트워크를 통해 연결된 자사의 서버를 통해(또는 S사의 위임을 받은 광고회사의 서버를 통해) 광고대상제품정보, 즉 샴푸 제품에 대한 정보를 업로드 한다. 샴푸 제품의 정보 에는 예를 들어 샴푸의 효능, S사 또는 샴푸의 고객 연령층, 제품의 가격정보 등이 포함될 수 있다. 또한, 해당 샴푸 제품의 광고를 언제부터 언제까지 게재할지(예를 들어, 1월 1일부터 1월 30일까지)에 대한 광고게재기간정 보를 업로드 한다. 제품과 인플루언서를 매칭하는 장치는 네트워크를 통해 광고주 서버로부터 광고대상제품정보 및 광고게 재기간정보를 수신하고 저장부에 저장한다. 일 실시예에서, 처리부는 광고대상제품의 카테고리를 분 류하고, 해당 카테고리와 관련이 있는 인플루언서의 정보를 SNS 서버에 요청할 수 있다. SNS 서버는 페이스북(Facebook), 트위터(Twitter), 인스타그램(Instagram), 유튜브(Youtube), 인터넷 블로 그(blog) 등 소셜네트워크서비스의 제공자가 운영하는 서버로서, 해당 플랫폼을 통해 콘텐츠를 업로드하거나 시 청하는 사용자들의 계정정보를 저장하고 있다. SNS 서버는 장치의 요청에 따라 광고대상제품의 카테고리와 관련이 있는 인플루언서(예를 들어, 광고주 가 설정한 수 이상의 팔로워를 보유한 사용자)의 계정정보 및 상기 인플루언서를 팔로잉하는 팔로워들의 계정정 보를 장치에 전송한다. 예를 들어, S사의 광고 대상이 샴푸 제품일 경우, 유튜브(Youtube) 서버는 샴푸에 관한 리뷰 글 또는 영상을 업로드한 적이 있는 인플루언서, 또는 반드시 샴푸가 아니더라도 린스, 비누, 화장품 등 유사 제품과 연관된 콘텐츠를 업로드한 적이 있는 인플루언서의 계정정보(ID, 이름, 성별, 나이 등 인적정보, 콘텐츠정보 등)를 장치에 전송할 수 있다. 또한, 유튜브 서버는 해당 인플루언서를 팔로잉하는 팔로워들의 계정정보(ID, 이름, 성별, 나이 등 인적정보)를 장치에 전송할 수 있다. 이 경우 팔로워들은 인 플루언서가 업로드한 샴푸 관련 콘텐츠를 시청할 의사를 표시한(계정 팔로잉을 통해) 사용자들이므로, 다른 사 용자에 비해 광고대상제품인 샴푸에 대한 관심이 높을 것으로 기대된다. 장치는 SNS 서버로부터 수신한 인플루언서 및 팔로워와 연관된 정보들을 수신하여 저장부에 저장 하는 동시에, 팔로워들의 계정정보를 이용하여 온라인쇼핑몰 서버에 상기 팔로워들의 제품구매정보를 요청 한다. 온라인쇼핑몰 서버는 온라인쇼핑 서비스를 제공하는 서비스제공자가 운영하는 서버로서, 상기 서버에는 사용자가 온라인쇼핑몰에서 어떠한 물건을 언제 구매하였는지, 가상의 장바구니에 담아 놓은 제품은 무엇인지, 어떤 제품에 관심이 큰지에 대한 정보가 저장되어 있다. 일반적으로 온라인쇼핑몰에서 제품을 구매하기 위해서 는 사용자의 인적정보(이름, 성별, 나이 등)를 서버에 제출하고 ID 및 계정을 생성하여야 하는데, 이러한 인적 정보 및 계정정보가 온라인쇼핑몰 서버에 저장되어 있다. 온라인쇼핑몰 서버는 장치로부터 요청을 수신하여, SNS 서버로부터 수신한 팔로워들의 계정정보 (ID, 이름, 성별, 나이 등 인적정보)와 일치하는 계정(사용자)이 존재하는지 검색하고, 해당 계정이 존재한다면 계정의 사용자가 제품을 구매한 정보(제품의 종류에 관한 정보, 구매날짜 등)를 장치에 전송한다. 최근에는 온라인쇼핑몰 계정 생성시 자주 사용하는 SNS 계정과 연동되도록 설정하는 경우가 많은데(예컨대 싱글 사인온 방식), 이러한 경우에는 장치가 온라인쇼핑몰 서버에 별도의 제품구매정보를 요청할 필요 없이, SNS 서 버에서 팔로워 정보 및 이들의 제품구매정보를 직접 수신할 수도 있다. 장치는 온라인쇼핑몰 서버로부터 수신한 상기 팔로워들의 제품구매정보를 저장부에 저장하고, 처 리부가 상기 정보들을 종합하여 각 팔로워들의 제품구매예정시기를 추정하도록 한다. 처리부는 컴퓨터의 중앙처리장치(CPU) 등 입력된 데이터의 연산 및 처리를 수행하여 원하는 결과를 출력하 기 위한 구성요소이다. 처리부는 하나의 컴퓨터에 포함되는 단일 프로세서나 다중 프로세서, 또는 복수의 컴퓨터나 외부 서버의 프로세서가 결합된 형태일 수도 있다. 일 실시예에서, 처리부는 인공지능 기계학습모델을 이용하여, 상기 광고대상제품정보, 상기 팔로워들 과 연관된 정보 및 상기 팔로워들의 제품구매정보에 기초하여, 상기 팔로워들의 제품구매예정시기를 추정하도록 구성된다. 제품구매예정시기란 팔로워가 광고대상제품 또는 관련제품을 구매할 가능성이 높은 시기를 의미하며, 각 제품의 평균 수명(소모품일 경우 사용 주기)을 고려하여 결정될 수 있다. 예를 들어, 일반적으로 개인이 샴 푸 1L를 구매하여 전부 사용하는데 걸리는 기간이 약 3개월이라고 가정하면, 사용자의 샴푸 제품의 구매예정시 기는 온라인쇼핑몰을 통해 마지막으로 샴푸 제품을 구매한 날짜로부터 3개월이 되는 날짜로 추정할 수 있다. 개 인마다 사용 주기에는 편차가 있으므로 추정 날짜의 전후로 버퍼 일수를 더해 제품구매예정시기를 결정할 수 있 다. 일 실시예에서, 처리부는 제품구매예정시기를 추정함에 있어서 인공지능 기계학습모델을 사용할 수 있다. 기계학습(Machine Learning)이란 입력된 데이터를 군집화하거나 분류하기 위한 기술로서, 데이터의 분류 방법론에 따라 딥러닝(Deep Learning), 서포트벡터머신(SVM), 인공신경망(Neural Networks) 등 여러 종류의 기 계학습 알고리즘이 존재한다. 일반적인 입출력 시스템은 정해진 입력에 대하여 정해진 결과만을 출력하지만, 기 계학습모델을 이용하면 학습 데이터를 벡터화하고 출력에 대한 피드백이 다시 입력되므로, 학습을 거치면서 성능이 향상되고 임의의 입력에 대해서도 결과를 출력할 수 있다. 실시예에 따르면, 기계학습모델은 광고대상제품정보, 팔로워들과 연관된 정보, 팔로워들의 제품구매정보를 입력 받아 팔로워들의 제품구매예정시기를 추정하는데 이용되며, 추정된 시기에 실제 제품 구매로 이어지는지 여부를 피드백으로 입력 받아 학습모델의 성능이 향상될 수 있다. 제품구매예정시기가 결정되면, 처리부는 상기 제품구매예정시기와 광고주가 원하는 광고게제기간이 일치하 는지를 판단하여 각 팔로워들에 대한 구매가능성점수를 산정하고, 후보 인플루언서들마다 상기 구매가능성점수 와 팔로워 수 등을 비교하여 최종적으로 광고대상제품과 매칭될 인플루언서를 결정하게 된다. 구체적인 실시예 도 2는 일 실시예에 따른 시스템에 있어서 처리부가 각 팔로워들의 제품구매예정시기를 추정하고, 광고게재기간 과 일치하는지 여부를 분석하여 인플루언서의 광고적합성점수를 산정하는 과정을 나타낸다. 도 2를 참조하면, 처리부는 광고주 서버로부터 광고대상제품정보, 예를 들어 제품의 카테고리는 \"샴푸\"라는 정보 및 광고게재기간정보, 예를 들어 1월 1일부터 1월 30일까지 광고하기를 원한다는 정보를 수신 한다. 처리부는 SNS 서버에 샴푸 제품과 관련이 있는 인플루언서 A의 계정정보 및 상기 인플루언서 A 를 팔로잉하는 팔로워 A, B의 계정정보, 인플루언서 B의 계정정보 및 상기 인플루언서 B를 팔로잉하는 팔로워 C, D의 계정정보를 요청하고 수신한다. 인플루언서 A, B는 상기 SNS 상에 샴푸 제품과 연관성이 높은 콘텐츠를 주기적으로 업로드 하는 사용자일 수 있다(생활용품 리뷰어, 뷰티 블로거 등). 처리부는 팔로워 A~D의 인적정보 및 계정정보를 이용하여 온라인쇼핑몰 서버로부터 상기 팔로워들의 제품구매정보를 수신한다. 구체적인 실시예로는, 팔로워의 인적정보 및 계정정보를 복수의 온라인쇼핑몰 서버에 서 검색하여 동일한 사용자(팔로워)의 계정이 존재하는 경우, 상기 사용자가 어떠한 제품을 언제 구매하였는지 등의 정보를 요청한다. 예를 들어, 복수의 온라인쇼핑몰 서버를 검색한 결과, 팔로워 A는 3개월 전 쇼핑몰 A에서 샴푸 1L를 구매한 이 력이 있고, 팔로워 B는 1개월 전 쇼핑몰 B에서 샴푸 1L를 구매한 이력이 있으며, 팔로워 C는 6개월 전 쇼핑몰 A 에서 샴푸 2L를 구매한 이력이 있고, 팔로워 D는 2개월 전 쇼핑몰 C에서 샴푸 1L를 구매한 이력이 있는 것으로 가정한다. 저장부 또는 인공지능 기계학습모델의 데이터베이스는, 샴푸 제품을 1L 구매할 경우 약 3개월 정도 사용이 가능하다는 제품사용기간 정보가 저장되어 있을 수 있다. 이러한 정보는 설계자에 의해 사전에 입력된 정보일 수도 있고, 또는 해당 정보를 기초로 기계학습을 수행하여 수정된 정보일 수도 있다. 이와 같은 제품사 용기간 정보는 벡터화하여 기계학습모델을 학습시키는데 이용된다. 처리부는 상기 제품사용기간 정보를 근거로 팔로워 A의 제품구매예정시기는 현 시점인 1월 1일부터 버퍼 기간을 더한 1월 15일까지라고 추정할 수 있으며, 같은 방식으로 팔로워 B의 제품구매예정시기는 2개월 후인 3 월 1일부터 3월 15일까지, 팔로워 C의 제품구매예정시기는 현 시점인 1월 1일부터 1월 15일까지(2L를 구매하였 으나 구매한지 6개월이 경과했기 때문에 모두 사용하였을 것으로 판단함), 팔로워 D의 제품구매예정시기는 1개 월 후인 2월 1일부터 2월 15일까지로 추정할 수 있다. 처리부는 팔로워들의 제품구매예정시기와 광고게재기간의 일치여부를 고려하여 각 팔로워마다 구매가능성 점수를 산정한다. 팔로워 A, C는 제품구매예정시기(1월 1일~1월 15일)가 광고게재기간(1월 1일~1월 30일)에 모 두 포함되므로 가장 높은 점수인 100점을 부여할 수 있고, 팔로워 B는 제품구매예정시기와 광고게재기간이 2개 월 이상 차이 나므로 80점, 팔로워 D는 1개월 이상 차이 나므로 90점을 부여할 수 있다. 구체적인 점수의 숫자 는 단지 발명의 이해를 돕기 위한 예시일 뿐이며, 추가적인 요인들을 반영하여 상이하게 설정할 수 있다. 처리부는 인플루언서와 연관된 정보 및 각 팔로워들의 구매가능성점수에 기초하여 인플루언서 A, B의 광고 적합성점수를 산정할 수 있는데, 단순한 예시로 인플루언서 A와 B의 팔로워 수가 각각 2명으로 동일하다고 가정 하고, 업로드 하는 콘텐츠의 빈도 등이 유사하다고 가정하면, 인플루언서의 광고적합성점수는 팔로워들의 구매 가능성점수의 평균에 따라 정해질 수 있다. 본 예시에서는, 인플루언서 A의 광고적합성점수는 90점, 인플루언서 B의 광고적합성점수는 95점으로 산정될 수 있다. 마지막으로, 처리부는 광고적합성점수에 기초하여 어떤 인플루언서가 광고대상제품을 광고하기에 더 적합 한지를 결정한다. 다른 수많은 요인들(예를 들어, 인플루언서의 인지도, 나이, 성향 등)이 더 고려될 수도 있지 만, 본 예시에서는 간결한 설명을 위해 다른 요인들은 동일한 수준이라고 가정한다. 그러나 본 발명이 상술한 '다른 수많은 요인들'을 배제하는 것을 발명의 특징으로 하는 것은 아니며 실시예에 따라서 위 요인들을 포함 하도록 구성될 수 있음은 당연하다. 상기 예시에서는 인플루언서 B의 광고적합성점수가 더 높으므로, 처리부는 인플루언서 B를 광고대상제품(S 사의 샴푸 제품)과 매칭하고 그 결과를 광고주 서버로 전송한다. 인공지능 기계학습모델은 다양한 변수를 고려하여 각 팔로워에 대한 제품구매예정시기, 구매가능성점수, 광고적합성점수를 산정할 수 있다. 학습되지 않은 데이터, 예를 들어 샴푸가 아닌 린스 제품에 관한 구매정보가 입력된 경우, 샴푸-린스 간의 유사도(벡터공간상의 거리), 다른 사용자들의 샴푸 제품과 린스 제품 구매 주기, 시차 등을 고려하여 제품구매예정시기 또는 구매가능성점수를 결정할 수 있다. 도 3은 또 다른 실시예에 따라 각 팔로워들의 제품구매예정시기를 추정하고 인플루언서의 광고적합성점수를 산 정하는 과정을 나타낸다. 도 3을 참조하면, 처리부는 도 2를 통해 설명한 것과 유사한 과정을 통해 팔로워 A~D의 제품구매정보를 온 라인쇼핑몰 서버로부터 수신한다. 복수의 온라인쇼핑몰 서버를 검색한 결과, 팔로워 A는 3개월 전 쇼핑몰 A 에서 샴푸 1L를 구매한 이력이 있고, 팔로워 B는 1개월 전 쇼핑몰 B에서 린스 1L를 구매한 이력이 있으며, 팔로 워 C는 6개월 전 쇼핑몰 A에서 샴푸 2L를 구매한 이력이 있고, 팔로워 D는 2개월 전 쇼핑몰 C에서 비누 1개를 구매한 이력이 있는 것으로 가정한다. 전술한 바와 같이, 샴푸 1L의 일반적인 사용기간이 3개월이라고 가정하면, 팔로워 A, C의 제품구매예정시기(1월 1일~1월 15일)와 광고게재기간(1월 1일~1월 30일)이 겹치므로 구매가능성점수는 100점으로 산정될 수 있다. 그 러나 팔로워 B와 관련해서는 \"린스\"는 광고대상제품도 아니고 제품의 평균적인 사용기간 정보는 입력된 적이 없 다. 이 경우 인공지능 기계학습모델은 온라인쇼핑몰 서버에서 다수의 사용자 구매내역을 검색하여 \"샴푸\" 제품 과 \"린스\" 제품의 구매 주기, 구매자의 성별, 연령층이 어느 정도 유사하다는 정보를 획득할 수 있다(특히, 구 매자는 생활용품인 샴푸와 린스를 동시에 구매하는 경향이 크다). 이에 따라, 인공지능 기계학습모델은 각 제품의 유사도 정보에 기초하여 사전에 입력되지 않은 린스 제품에 대 한 구매예정시기를 추정할 수 있다. 예를 들어, 린스 1L의 평균 사용기간이 샴푸 1L와 마찬가지로 3개월이라고 판단하였다면, 팔로워 B는 2개월 후인 3월 1일~3월 15일쯤에 광고대상제품인 샴푸를 구매할 것으로 추정할 수 있다. 다만, 팔로워 B가 온라인쇼핑몰 B에서 실제로 구매했던 제품은 샴푸가 아닌 린스이기 때문에 이를 감안하 여 구매가능성점수를 좀 더 낮게 산정한다. 예를 들어, 도 2의 팔로워 B는 샴푸를 구매했었기 때문에 구매가능 성점수가 80점이지만, 도 3의 팔로워 B는 린스를 구매했었기 때문에 구매가능성점수는 70점이다. 일 실시예에 따르면, 만약 추정된 제품구매예정시기에 실제로 팔로워 B가 광고대상제품을 구매한다면, 다음에는 해당 구매 정보를 반영하여 샴푸와 린스 제품의 유사도를 더 높게 책정하고, 결과적으로 구매가능성점수를 더 높게 산정할 수도 있다. 이처럼 기계학습모델은 사전 입력된 데이터가 없는 경우에도 스스로 학습을 거듭하면서 구매가능성 추정의 정확도를 향상시킬 수 있다. 팔로워 D와 관련해서는 \"비누\" 또한 광고대상제품도 아니고 제품의 평균적인 사용기간 정보는 입력된 적이 없다. 상기와 유사한 방식으로, 인공지능 기계학습모델은 온라인쇼핑몰 서버에서 다수의 사용자 구매내역을 검 색하여 \"샴푸\" 제품과 \"비누\" 제품의 구매 주기, 제품의 용도, 특성, 제조사, 제품 카테고리 등을 비교하여 제 품 간 유사도를 결정할 수 있다. 예를 들어, 검색 결과 비누 1개의 평균적인 사용기간이 3개월이라고 판단하였 다면, 팔로워 B는 2개월 후인 3월 1일~3월 15일쯤에 비누를 다시 구매하거나, 또는 동시에 광고대상제품인 샴푸 를 구매할 것으로 추정된다. 다만, 비누 제품은 린스 제품에 비해 광고대상제품인 샴푸와의 유사도가 낮다고 판 단하여 구매가능성점수는 보다 낮은 50점으로 산정될 수 있다. 도 2를 참조하여 설명한 바와 같이, 처리부는 인플루언서와 연관된 정보 및 각 팔로워들의 구매가능성점수 에 기초하여 인플루언서 A, B의 광고적합성점수를 산정한다. 도 3의 예시에서는 인플루언서 A의 광고적합성점수 는 80점, 인플루언서 B의 광고적합성점수는 75점으로 산정될 수 있다. 따라서 보다 높은 광고적합성점수를 받은 인플루언서 A가 광고대상제품과 매칭되며, 해당 결과는 광고주 서버로 전송된다. 이뿐만 아니라, 기계학습모델은 팔로워들의 인적정보, 계정정보 등을 추가적으로 반영하여 제품구매예정시기나 구매가능성점수를 결정할 수 있다. 예를 들어, 도 2 및 도 3에서 팔로워 A, C의 구매가능성점수는 오직 샴푸의 사용기간정보(1L당 3개월)만을 고려하여 산정되었으나, 팔로워들의 인적정보, 예를 들어 팔로워 A는 남자이고 팔로워 C는 여자일 경우 일반적으로 남자보다 여자가 샴푸 구매 주기가 더 짧을 것으로 예상되므로 이를 반영하 여 제품구매예정시기를 추정할 수 있다. 또한, 팔로워 A의 SNS 계정정보에, 예를 들어 팔로워 A가 최근에 SNS상에서 샴푸를 검색한 이력이 있거나 코멘트에 샴푸 등의 단어가 포함되는 등 추가정보가 존재한다면 이를 반영 하여 구매가능성점수를 더 높게 산정할 수도 있다. 전술한 실시예들과 이에 따른 제품구매예정시기의 추정, 구매가능성점수 및 광고적합성점수의 산정 방법과 구체 적인 점수 값 등은 단지 예시적인 것에 불과하며, 광고주 서버, SNS 서버, 온라인쇼핑몰 서버 등으로부터 필요 한 데이터를 수집하고 기계학습모델을 이용해 인플루언서를 결정하는 알고리즘에 다양한 수정 및 변경이 이루어 질 수 있다. 광고대상제품 및 인플루언서의 매칭 방법 도 4는 일 실시예에 따른 인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법을 나타낸 순서도이다. 먼저, 광고주 서버로부터 광고대상제품정보 및 광고게재기간정보를 수신하는 단계가 수행된다(S100). 광고주 서 버는 광고주가 직접 운영하거나 광고주로부터 위임 받은 대리인(광고사)이 운영하는 서버이다. 프로세서, 메모 리, 네트워크 모듈을 구비하는 장치는, 광고주 서버로부터 게재될 광고의 대상이 되는 제품(즉, 광고주가 홍보 하고자 하는 제품)에 관한 정보 및 해당 광고를 언제부터 언제까지 게재할지에 대한 정보를 수신한다. 이어서, SNS 서비스를 제공하는 적어도 하나의 SNS 서버로부터 인플루언서와 연관된 정보를 수신하는 단계 (S200) 및 적어도 하나의 SNS 서버로부터 상기 인플루언서를 팔로잉하는 팔로워들과 연관된 정보를 수신하는 단 계가 수행된다(S300). 예를 들어, 광고주인 S사의 광고 대상이 샴푸 제품일 경우, SNS 상에 샴푸에 관한 콘텐츠 (텍스트, 사진, 영상 등)를 업로드한 적이 있는 인플루언서(또는 샴푸가 아니더라도 린스, 비누, 화장품 등 연 관 제품과 관련된 콘텐츠를 업로드한 적이 있는 인플루언서)에 대한 계정정보(ID, 이름, 성별, 나이 등 인적정 보, 콘텐츠정보 등)를 SNS 서버로부터 수신한다. 또한, 해당 인플루언서를 팔로잉하는 팔로워들의 계정정보(ID, 이름, 성별, 나이 등 인적정보)를 함께 수신할 수 있다. 이어서, 온라인쇼핑 서비스를 제공하는 적어도 하나의 온라인쇼핑몰 서버로부터 상기 팔로워들의 제품구매정보 를 수신하는 단계가 수행된다(S400). 온라인쇼핑몰 서버는 온라인쇼핑 서비스를 제공하는 서비스제공자가 운영 하는 서버로서, 사용자가 온라인쇼핑몰에서 어떠한 물건을 언제 구매하였는지, 가상의 장바구니에 담아 놓은 제 품은 무엇인지, 어떤 제품에 관심이 큰지에 대한 정보가 저장되어 있다. SNS 서버로부터 수신한 팔로워의 계정 정보 및 인적정보와 일치하는 사용자의 제품구매정보(제품의 종류에 관한 정보, 구매날짜 등)를 수신한다. 이어서, 인공지능 기계학습모델을 이용하여, 상기 광고대상제품정보, 상기 팔로워들과 연관된 정보 및 상기 팔 로워들의 제품구매정보에 기초하여, 상기 팔로워들의 제품구매예정시기를 추정하는 단계가 수행된다(S500). 제 품구매예정시기란 팔로워가 광고대상제품 또는 관련제품을 구매할 가능성이 높은 시기를 의미하며, 각 제품의 평균 수명(소모품일 경우 사용 주기)을 고려하여 결정될 수 있다. 이어서, 상기 팔로워들과 연관된 정보, 제품구매예정시기 및 상기 광고게재기간정보에 기초하여 각 팔로워에 대 한 구매가능성점수를 산정하고, 상기 인플루언서와 연관된 정보 및 상기 팔로워들의 구매가능성점수에 기초하여 상기 인플루언서의 광고적합성점수를 산정하는 단계가 수행된다(S600). 예를 들어, 샴푸 1L의 평균적인 사용기간(즉, 재구매 주기)이 3개월이라고 가정할 경우, 팔로워 A가 3개월 전에 샴푸 1L를 구매한 이력이 있다면 제품구매예정시기는 현 시점이며(전후로 일주일 정도 추가될 수 있음), 광고주 가 광고게재를 원하시는 시기와 겹친다면 높은 구매가능성점수를 부여할 수 있다. 이 때, 팔로워 A의 인적정보 (예를 들어, 샴푸를 구매할 가능성이 높은 성별, 연령층) 및 계정정보(예를 들어, 최근 SNS 상에 샴푸에 관해 언급한 적이 있거나 샴푸를 검색한 이력이 있다는 정보)를 고려하여 구매가능성점수를 더하거나 뺄 수 있다. 각 인플루언서의 광고적합성점수는 해당 인플루언서를 팔로잉하는 팔로워들이 많을수록, 각 팔로워들의 평균 구 매가능성점수가 클수록 높게 산정될 수 있다. 일 실시예에서, 인플루언서의 개인정보 또는 SNS 계정정보 등이 더 고려될 수 있다. 마지막으로, 복수의 인플루언서에 대한 상기 광고적합성점수에 기초하여 상기 광고대상제품과 매칭될 인플루언 서를 결정하는 단계가 수행된다(S700). 복수의 인플루언서의 광고적합성점수를 비교하여 가장 높은 점수를 받은 인플루언서가 광고대상제품과 매칭되며 상기 결과는 광고주 서버로 전송될 수 있다. 실시예에 따른 인공지능을 이용한 제품과 인플루언서를 매칭하는 방법은, 애플리케이션으로 구현되거나 다양한 컴퓨터 구성요소를 통하여 수행될 수 있는 프로그램 명령어의 형태로 구현되어 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능한 기록 매체는 프로그램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 컴퓨터 판독 가능한 기록 매체의 예에는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD- ROM, DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 ROM, RAM, 플래시 메모리 등과 같은 프로그램 명령어를 저장하고 수행하도록 특별히 구성된 하드웨 어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사 용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 상기 하드웨어 장치는 본 발명에 따른 처 리를 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 이상에서 설명한 제품과 인플루언서를 매칭하는 장치 및 방법에 의하면, 광고주가 인플루언서를 통해 제품을 광 고하고자 할 때, 인공지능 기계학습모델을 이용해 해당 인플루언서를 팔로잉하는 팔로워들의 제품구매예정시기 를 추정함으로써, 실제로 광고대상제품을 구매할 가능성이 더 높은 팔로워들을 보유한 인플루언서를 광고모델로 선정할 수 있다. 기존에는 광고주가 인플루언서를 광고모델로 선정할 때 해당 인플루언서가 보유한 팔로워의 수를 단순 비교하였 으나, 이것만으로는 팔로워들 중 실제 구매의사를 가진 잠정고객이 얼마나 되는지 판단하기가 어려웠다. 본 발 명의 실시예에 따르면 팔로워들의 온라인 쇼핑 내역을 통해 해당 팔로워들이 광고대상제품을 구매할 가능성을 추정해볼 수 있으므로, 광고주는 실제로 광고대상제품을 구매할 가능성이 더 높은 팔로워들을 보유한 인플루언 서를 광고모델로 선정하여 보다 효과적인 제품 홍보가 가능하다. 이상에서는 실시예들을 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2019-0141025", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 인공지능을 이용하여 제품과 인플루언서를 매칭하는 시스템을 나타낸 구성도이다. 도 2는 일 실시예에 따른 시스템에 있어서 각 인플루언서의 광고적합성점수를 산정하는 과정을 나타낸예시이다. 도 3은 일 실시예에 따른 시스템에 있어서 각 인플루언서의 광고적합성점수를 산정하는 과정을 나타낸 또 다른 예시이다. 도 4는 일 실시예에 따른 인공지능을 이용하여 제품과 인플루언서를 매칭하는 방법을 나타낸 순서도이다."}
