{"patent_id": "10-2023-0045659", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0136195", "출원번호": "10-2023-0045659", "발명의 명칭": "인공지능 서비스 개발 서버 및 인공지능 서비스 개발 방법", "출원인": "티쓰리큐 주식회사", "발명자": "박병훈"}}
{"patent_id": "10-2023-0045659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자디바이스로부터 AI생성정보를 수신하는 제1데이터수신모듈;초거대AI서버에 AI생성정보를 기초로 AI알고리즘코드의 생성을 요청하는 AI생성요청모듈;AI생성정보와 AI알고리즘코드를 기초로 추론서비스를 생성하는 추론서비스생성모듈;추론서비스를 사용자디바이스에 의해 호출 가능한 추론서비스API를 생성하는 추론서비스API생성모듈;사용자디바이스로부터 추론서비스API에 대응하는 UI설정정보를 수신하는 제2데이터수신모듈;초거대AI서버에 UI설정정보를 기초로 UI코드 생성을 요청하는 UI코드생성요청모듈; 및UI코드를 기초로 추론서비스API를 이용하는 AI응용서비스를 생성하는 AI응용서비스생성모듈을 포함하는 인공지능 서비스 개발 서버."}
{"patent_id": "10-2023-0045659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,AI생성정보는 인공지능 서비스 목적에 따른 데이터와 알고리즘유형정보를 포함하며,데이터는 인공지능 서비스 목적에 따라 라벨링된 라벨 데이터(Labeled Data)를 포함하고,사용자디바이스에 복수의 알고리즘유형정보를 포함하는 알고리즘데이터를 제공하는 알고리즘데이터제공모듈을 더포함하는 인공지능 서비스 개발 서버."}
{"patent_id": "10-2023-0045659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,마켓플레이스서버에 개념증명(PoC)상품 등록 및 NFT저작권 생성을 요청하는 제1권리확보모듈을 더 포함하며,제1권리확보모듈은 추론서비스, 추론서비스API, AI응용서비스, 추론서비스에서 사용 또는 도출된 데이터, 추론서비스API에서 사용 또는 도출된 데이터, 및 AI응용서비스에서 사용 또는 도출된 데이터를 개념증명상품으로 등록 요청하고,또한, 제1권리확보모듈은 추론서비스, 추론서비스API, AI응용서비스, 추론서비스에서 사용 또는 도출된 데이터,추론서비스API에서 사용 또는 도출된 데이터, 및 AI응용서비스에서 사용 또는 도출된 데이터에 대한 NFT저작권생성을 요청하는 인공지능 서비스 개발 서버."}
{"patent_id": "10-2023-0045659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,사용자디바이스로부터 추론서비스, 추론서비스API 및 AI응용서비스 중 적어도 하나를 이용하여 확보되는 커스터마이징정보를 수신하는 제3데이터수신모듈; 및커스터마이징정보를 이용하여 AI응용서비스를 커스터마이징한 AI실용서비스를 생성하는 AI실용서비스생성모듈을더 포함하는 인공지능 서비스 개발 서버."}
{"patent_id": "10-2023-0045659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,마켓플레이스서버에 AI실용상품 등록 및 NFT저작권 생성을 요청하는 제2권리확보모듈을 더 포함하며,공개특허 10-2024-0136195-3-제2권리확보모듈은 AI실용서비스를 AI실용상품으로 등록 요청하고,또한, 제2권리확보모듈은 AI실용서비스에 대한 NFT저작권 생성을 요청하는 인공지능 서비스 개발 서버."}
{"patent_id": "10-2023-0045659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "사용자디바이스에서 AI생성정보를 생성하는 AI정보생성단계;사용자디바이스로부터 AI생성정보를 수신하는 제1데이터수신단계;AI생성정보를 기초로 초거대AI서버에 AI알고리즘코드 생성을 요청하는 AI생성요청단계;AI생성정보와 AI알고리즘코드를 기초로 추론서비스를 생성하는 추론서비스생성단계;추론서비스를 사용자디바이스에 의해 호출 가능한 추론서비스API를 생성하는 추론서비스API생성단계;사용자디바이스로부터 추론서비스API에 대응하는 UI설정정보를 수신하는 제2데이터수신단계;초거대AI서버에 UI설정정보를 기초로 UI코드 생성을 요청하는 UI코드생성요청단계; 및UI코드를 기초로 추론서비스API를 이용하는 AI응용서비스를 생성하는 AI응용서비스생성단계를 포함하는 인공지능 서비스 개발 방법."}
{"patent_id": "10-2023-0045659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,AI생성정보는 인공지능 서비스 목적에 따른 데이터와 알고리즘유형정보를 포함하며,데이터는 인공지능 서비스 목적에 따라 라벨링된 라벨 데이터(Labeled Data)를 포함하고,사용자디바이스에 복수의 알고리즘유형정보를 포함하는 알고리즘데이터를 제공하는 알고리즘데이터제공단계를 더포함하는 인공지능 서비스 개발 방법."}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사용자디바이스로부터 AI생성정보를 수신하는 제1데이터수신모듈, 초거대AI서버에 AI생성정보를 기초 로 AI알고리즘코드의 생성을 요청하는 AI생성요청모듈, AI생성정보와 AI알고리즘코드를 기초로 추론서비스를 생 성하는 추론서비스생성모듈, 추론서비스를 사용자디바이스에 의해 호출 가능한 추론서비스API를 생성하는 추론서 비스API생성모듈, 사용자디바이스로부터 추론서비스API에 대응하는 UI설정정보를 수신하는 제2데이터수신모듈, 초거대AI서버에 UI설정정보를 기초로 UI코드 생성을 요청하는 UI코드생성요청모듈, 및 UI코드를 기초로 추론서비 스API를 이용하는 AI응용서비스를 생성하는 AI응용서비스생성모듈을 포함하여, 사용자가 원하는 목적에 맞는 인 공지능 서비스를 용이하게 개발할 수 있다."}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 서비스 개발 서버 및 그 방법에 관한 것으로서, 더욱 상세하게는 사용자가 원하는 목적에 적합한 인공지능 서비스 개발 서버 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능(人工知能) 또는 A.I.(Artificial Intelligence)는 일반적으로 인간의 학습능력, 추론능력, 지각능력이 필요한 작업을 할 수 있도록 컴퓨터 시스템을 구현하려는 컴퓨터과학의 세부분야 중 하나이다. 인간을 포함한 동물이 갖고 있는 지능 즉, natural intelligence와는 다른 개념이다. 지능을 갖고 있는 기능을 갖춘 컴퓨터 시 스템이며, 인간의 지능을 기계 등에 인공적으로 구현한 것이다. 일반적으로 범용 컴퓨터에 적용한다고 가정한다. 인공지능 기술로는, 미로탐색 알고리즘, 퍼지이론, 패턴인식, 기계학습, 인공신경망, 유전알고리즘 등 다양한 기술이 활용되고 있다. 종래 기술에 따른 인공지능 서비스 개발의 경우, 상술한 인공지능 기술을 이용하여 복잡 하고 어려운 과정을 거쳐 인공지능 서비스를 개발하고 있는 실정이다. 선행기술문헌 : 한국등록특허 제2471324호(2022.11.23)"}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시 예는, 사용자가 원하는 목적에 적합한 인공지능 서비스를 용이하게 구현할 수 있는 인공지능 개발 서버 및 그 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위하여, 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버는, 사용자 디바이스로부터 AI생성정보를 수신하는 제1데이터수신모듈, 초거대AI서버에 AI생성정보를 기초로 AI알고리즘코 드의 생성을 요청하는 AI생성요청모듈, AI생성정보와 AI알고리즘코드를 기초로 추론서비스를 생성하는 추론서비 스생성모듈, 추론서비스를 사용자디바이스에 의해 호출 가능한 추론서비스API를 생성하는 추론서비스API생성모 듈, 사용자디바이스로부터 추론서비스API에 대응하는 UI설정정보를 수신하는 제2데이터수신모듈, 초거대AI서버 에 UI설정정보를 기초로 UI코드 생성을 요청하는 UI코드생성요청모듈, 및 UI코드를 기초로 추론서비스API를 이 용하는 AI응용서비스를 생성하는 AI응용서비스생성모듈을 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사용자가 원하는 목적에 최적인 인공지능 서비스를 용이하게 구현할 수 있다."}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "명세서 전체에 걸쳐서 동일한 참조번호들은 실질적으로 동일한 구성요소들을 의미한다. 이하의 설명에서, 본 발"}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명의 핵심 구성과 관련이 없는 경우 및 본 발명의 기술분야에 공지된 구성과 기능에 대한 상세한 설명은 생략될 수 있다. 본 명세서에서 서술되는 용어의 의미는 다음과 같이 이해되어야 할 것이다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는"}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 발명의 실시예를 설명하기 위한 도면에 개시된 형상, 크기, 비율, 각도, 개수 등은 예시적인 것이므로 본 발 명이 도시된 사항에 한정되는 것은 아니다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 또한, 본 발명을 설명함에 있어서, 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐 릴 수 있다고 판단되는 경우 그 상세한 설명은 생략한다. 본 명세서에서 언급된 '포함한다', '갖는다', '이루어진다' 등이 사용되는 경우 '~만'이 사용되지 않는 이상 다 른 부분이 추가될 수 있다. 구성 요소를 단수로 표현한 경우에 특별히 명시적인 기재 사항이 없는 한 복수를 포 함하는 경우를 포함한다. 구성 요소를 해석함에 있어서, 별도의 명시적 기재가 없더라도 오차 범위를 포함하는 것으로 해석한다. 위치 관계에 대한 설명일 경우, 예를 들어, '~상에', '~상부에', '~하부에', '~옆에' 등으로 두 부분의 위치 관 계가 설명되는 경우, '바로' 또는 '직접'이 사용되지 않는 이상 두 부분 사이에 하나 이상의 다른 부분이 위치 할 수도 있다. 시간 관계에 대한 설명일 경우, 예를 들어, '~후에', '~에 이어서', '~다음에', '~전에' 등으로 시간적 선후 관 계가 설명되는 경우, '바로' 또는 '직접'이 사용되지 않는 이상 연속적이지 않은 경우도 포함할 수 있다. 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않는다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이 하에서 언급되는 제1 구성요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있다. \"X축 방향\", \"Y축 방향\" 및 \"Z축 방향\"은 서로 간의 관계가 수직으로 이루어진 기하학적인 관계만으로 해석되어 서는 아니 되며, 본 발명의 구성이 기능적으로 작용할 수 있는 범위 내에서 보다 넓은 방향성을 가지는 것을 의 미할 수 있다. \"적어도 하나\"의 용어는 하나 이상의 관련 항목으로부터 제시 가능한 모든 조합을 포함하는 것으로 이해되어야 한다. 예를 들어, \"제1 항목, 제2 항목 및 제3 항목 중에서 적어도 하나\"의 의미는 제1 항목, 제2 항목 또는 제 3 항목 각각 뿐만 아니라 제1 항목, 제2 항목 및 제3 항목 중에서 2개 이상으로부터 제시될 수 있는 모든 항목 의 조합을 의미할 수 있다. 본 발명의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하고, 기술적 으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적으로 실시 가능할 수도 있고 연관 관계로 함께 실시할 수도 있다. 이하에서 도면을 참조하여 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버를 설명한다. 도 1은 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버 및 그 방법을 설명하기 위한 도면이며, 도 2는 도 1에 도시된 인공지능 서비스 개발 서버의 일 실시 예를 도시한 도면이다. 도 1 및 2를 참조하면, 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버는 사용자디바이스 및 초 거대AI서버 간 통신을 통해, 목적에 맞는 인공지능 서비스를 용이하게 구현할 수 있다. 인공지능 서비스 개 발 서버는 인공지능 서비스 개발에 필요한 기능을 수행하는 시스템 또는 AI플랫폼일 수 있다. 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버는 제1데이터수신모듈, AI생성요청모듈, 추론서비스생성 모듈, 추론서비스API생성모듈, 제2데이터수신모듈 및 AI응용서비스생성모듈을 포함한다. 제1데이터수신모듈은 사용자디바이스로부터 AI생성정보를 수신할 수 있다. AI생성정보는 인공지능 서비 스 목적에 따른 데이터와 알고리즘유형정보를 포함하며, AI서비스를 구상하고 제작하려고 하는 사용자는 목적에 따른(맞는) 데이터와 알고리즘유형정보를 제1데이터수신모듈에 제공할 수 있다. 여기서, 데이터는 인공지능 서비스 목적에 따라 라벨링된 라벨 데이터(Labeled Data)를 포함한다. 일 실시 예로, 인공지능 서비스의 목적은 동물 사진들 중에서 고양이가 있는 사진만을 찾아내는 것이 될 수 있다. 또한, 라벨링된 라벨 데이터는 각 사진 에서 어떤 게 고양이고, 어떤 게 강아지고, 어떤 게 송아지인지 구별된 데이터를 말한다. AI생성요청모듈은 초거대AI서버에 AI생성정보를 기초로 AI알고리즘코드의 생성을 요청할 수 있다. 초거 대AI서버는 ChatGPT 서버를 포함할 수 있다. 초거대AI서버는 AI생성요청모듈의 요청에 따라 AI알고리 즘코드를 생성할 수 있다. 즉, 초거대AI서버는 목적에 따른 데이터와 알고리즘유형정보에 따라 AI알고리즘코 드를 생성할 수 있다. AI알고리즘코드는 전처리코드, 학습코드, 추론코드, 후처리코드 등을 포함할 수 있다. 추론서비스생성모듈은 AI생성정보와 AI알고리즘코드를 기초로 추론서비스를 생성할 수 있다. 일 실시 예로, 추론서비스생성모듈은 AI알고리즘코드와 목적에 맞는 데이터를 기초로 전처리->학습->배포->평가/테스트를 거쳐 추론서비스를 생성할 수 있다. 사용자디바이스로부터 전처리된 데이터가 제공되는 경우, 전처리 과정은 생략될 수 있다. 사용자디바이스로부터 제공된 데이터 중 일부는 학습데이터로 사용되고, 나머지는 평가데이 터로 사용될 수 있다. 추론서비스생성모듈을 통해 AI알고리즘코드를 수정 보완하여, 사용자의 목적에 따른 인공지능 서비스를 적합하고 용이하게 구현할 수 있다. 추론서비스에 의해, 사용자디바이스로부터 제공되는 새로운 데이터에 대해 목적에 맞는 인공지능 서비스가 수행될 수 있다. 추론서비스API생성모듈은 추론서비스를 사용자디바이스에 의해 호출 가능한 추론서비스API를 생성할 수 있다. 추론서비스API는 사용자디바이스와의 통신 기능을 추론서비스에 적용한 것이다. 따라서, 사용자디바이 스를 통해 추론서비스를 이용할 수 있다. 사용자디바이스는 인공지능 서비스 개발 서버와 통신 가능한 수단을 말한다. 또한, 사용자디바이스는 특정인 한 명의 사용자로 한정하는 것은 아니다. 즉, 사용자디바이 스는 복수의 사용자 중 어느 사용자를 나타낼 수 있다. 따라서, 추론서비스API는 복수의 사용자 들에게 공유 될 수 있다. 제2데이터수신모듈은 사용자디바이스로부터 추론서비스API에 대응하는 UI설정정보를 수신할 수 있다. UI 설정정보는 UI(USER INTERFACE) 아키텍쳐를 글로 표현한 프롬프트(PROMPT)일 수 있다. 프롬프트는 컴퓨터 시스 템이 사용자에 대하여 다음에 어떠한 조작을 행해야 하는지 지시하기 위한 지시 메시지를 말한다. 예를 들자면,UI설정정보는 아래 문장일 수 있다. '화면 왼쪽 상단에 전체 데이터 수, 현재 읽어 들인 데이터 수를 표시하고 오른쪽 상단에는 그 비율에 따른 막 대 그래프를 표시해줘. 다음 단락에는 고양이가 있는 사진 수/현재 사진 수를 표시해주고 그 옆에 찾은 이미지 가 나오는 창을 만들어줘. 그 아래에 사진 한 장을 처리하는 시간과 현재 경과 시간을 표시해주고 그 아래에 시 작, 정지 버튼 붙여줘＇ UI코드생성요청모듈은 초거대AI서버에 UI설정정보를 기초로 UI코드 생성을 요청할 수 있다. UI코드는 인 공지능 서비스 개발 서버를 통해 아래와 같은 UI화면을 제공할 수 있다."}
{"patent_id": "10-2023-0045659", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "AI응용서비스생성모듈은 UI코드를 기초로 추론서비스API를 이용하는 AI응용서비스를 생성할 수 있다. 즉, AI응용서비스생성모듈은 UI코드를 추론서비스API와 연동시켜, AI응용서비스를 생성할 수 있다. 따라서, 사 용자디바이스에서 상술한 UI코드에 의해 표시되는 UI화면을 제공받아, 추론서비스API를 이용할 수 있다. 도 3은 도 2에 도시된 인공지능 서비스 개발 서버의 다른 실시 예를 도시한 도면이며, 도 4는 도3에 도시된 알고리즘데이터제공모듈의 일 실시 예를 설명하기 위한 도면이다. 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버는 알고리즘데이터제공모듈을 더 포함할 수 있 다. 알고리즘데이터제공모듈은 사용자디바이스에 알고리즘데이터를 제공할 수 있다. 알고리즘데이터는 복수의 알고리즘유형정보를 포함한다. 알고리즘유형정보는 처리 대상인 데이터와 데이터에 대한 태스크에 따라 분류될 수 있다. 데이터는 텍스트, 이미지, 음성, 영상, 로그(수치), 위성 및 바이너리를 포함할 수 있다. 또한, 태스크는 분류, 회귀, 이상탐지 및 군집화를 포함할 수 있다. 사용자는 사용자디바이스를 통해 복수의 알고리즘유형정보를 포함한 알고리즘데이터를 제공받으므로, 인공지 능 서비스 목적에 맞는 알고리즘유형정보를 선택(결정)할 수 있다. 따라서, 원하는 목적에 최적화된 인공지능 서비스 개발이 용이하다. 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버는 제1권리확보모듈을 더 포함할 수 있다. 제1 권리확보모듈은 마켓플레이스서버에 개념증명(PoC / Proof of Concept)상품의 등록 및 NFT저작권 생성을 요청할 수 있다. 개념증명이란 사용자디바이스로부터 수신된 데이터와 사용자에 의해 정의된 목적에 맞는 인 공지능 서비스가 학습 등 AI 개발 과정을 통해 실제 구현 가능함을 확인한 것을 말한다. 또한, 개념증명상품이 란 개념증명을 통해 산출된(이용된) 데이터, 인공지능 서비스(추론서비스 등) 등의 완성된 개발산출물을 말한다. 예컨대, 제1권리확보모듈은 추론서비스, 추론서비스API, AI응용서비스, 추론서비스에서 사용 또는 도출된 데이터, 추론서비스API에서 사용 또는 도출된 데이터, 및 AI응용서비스에서 사용 또는 도출된 데이터를 개념증 명상품으로 등록 요청할 수 있다. 또한, 제1권리확보모듈은 추론서비스, 추론서비스API, AI응용서비스, 추 론서비스에서 사용 또는 도출된 데이터, 추론서비스API에서 사용 또는 도출된 데이터, 및 AI응용서비스에서 사 용 또는 도출된 데이터에 대한 NFT저작권 생성을 요청할 수 있다. 따라서, 사용자가 개발한 인공지능 서비스 및 그와 관련된 데이터(정보)에 대해 권리 확보가 가능하다. 또한, 추론서비스, 추론서비스API, AI응용서비스 등이 마켓플레이스에 등록되어, 복수의 사용자들에 의해 사용(테스트)될 수 있다. 따라서, 복수의 사용자들에 의해 커스터마이징 정보를 확보할 수 있다. 추론서비스, 추론서비스API, AI응용서비스 등은 그 서비스를 구현하는 코드일 수 있다. 도 5는 도 3에 도시된 인공지능 서비스 개발 서버의 다른 실시 예를 도시한 도면이다. 도 5를 참조하면, 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버는 제3데이터수신모듈 및 AI 실용서비스생성모듈을 더 포함할 수 있다. 제3데이터수신모듈은 사용자디바이스로부터 추론서비스, 추론서비스API 및 AI응용서비스 중 적어도 하나를 이용하여 확보되는 커스터마이징정보를 수신할 수 있다. 여기서 커스터마이징은 개념증명 상품 및 그 서비스 API에 해당 도메인의 실제 데이터 또는 현장 데이 터를 이용하여 전문가가 실용이 가능하도록 튜닝하는 작업일 수 있다. 따라서, 커스터마이징정보는 전문가의 사 용자디바이스로부터 수신되는 튜닝이 요구되는 정보일 수 있다. 한편 지금까지 상술한 사용자디바이스들은 서로 동일 또는 상이할 수 있다. AI실용서비스생성모듈은 커 스터마이징정보를 이용하여 AI응용서비스를 커스터마이징한 AI실용서비스를 생성할 수 있다. 이에 의해, 전문적 으로 활용하려는 사용자의 목적에 맞는 인공지능 서비스 개발 완성도를 향상시킬 수 있으면서도 쉽게 구현할 수 있다. 도 6은 도 5에 도시된 인공지능 서비스 개발 서버의 다른 실시 예를 도시한 도면이다. 도 6을 참조하면, 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버는 제2권리확보모듈을 더 포 함할 수 있다. 제2권리확보모듈은 마켓플레이스서버에 AI실용상품 등록 및 NFT저작권 생성을 요청할 수 있다. 예컨대, 제2권리확보모듈은 AI실용서비스를 AI실용상품으로 등록 요청할 수 있다. 또한, 제2권리확 보모듈은 AI실용서비스에 대한 NFT저작권 생성을 요청할 수 있다. 따라서, 사용자가 개발한 인공지능 서비 스에 대해 권리 확보가 가능하다. 지금까지 인공지능 서비스 개발 서버에 대해 설명하였다. 이하에서, 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 방법에 대해 설명한다. 도 7은 본 발명의 일 실시 예를 도시한 인공지능 서비스 개발 방법을 도시한 도면이다. 도 1 및 7을 참조하면, 본 발명의 일 실시 예를 도시한 인공지능 서비스 개발 방법은 AI정보생성단계(S10), 제1 데이터수신단계(S20), AI생성요청단계(S30), 추론서비스생성단계(S40), 추론서비스API생성단계(S50), 제2데이터 수신단계(S60), UI코드생성요청단계(S60) 및 AI응용서비스생성단계(S80)를 포함한다. AI정보생성단계(S10)에서 사용자디바이스는 AI생성정보를 생성할 수 있다. 제1데이터수신단계(S20)에서, 제1 데이터수신모듈은 사용자디바이스로부터 AI생성정보를 수신한다. AI생성요청단계(S30)에서, AI생성요청 모듈은 AI생성정보를 기초로 초거대AI서버에 AI알고리즘코드 생성을 요청할 수 있다. 추론서비스생성단 계(S50)에서, 추론서비스생성모듈은 AI생성정보와 AI알고리즘코드를 기초로 추론서비스를 생성할 수 있다. 추론서비스API생성단계(S50)에서, 추론서비스API생성모듈은 추론서비스를 사용자디바이스에 의해 호출 가능한 추론서비스API를 생성할 수 있다. 제2데이터수신단계(S60)에서, 제2데이터수신모듈은 사용자디바이 스로부터 추론서비스API에 대응하는 UI설정정보를 수신할 수 있다. UI코드생성요청단계(S70)에서, UI코드생 성요청모듈은 초거대AI서버에 UI설정정보를 기초로 UI코드 생성을 요청할 수 있다. AI응용서비스생성단 계(S80)에서, AI응용서비스생성모듈은 UI코드를 기초로 추론서비스API를 이용하는 AI응용서비스를 생성할 수 있다. AI생성정보는 인공지능 서비스 목적에 따른 데이터와 알고리즘유형정보를 포함한다. 데이터는 인공지능 서비스 목적에 따라 라벨링된 라벨 데이터(Labeled Data)를 포함한다. 이에 대한 자세한 설명은 상술한 바와 같다. 도 8은 도 7에 도시된 인공지능 서비스 개발 방법의 다른 실시 예를 도시한 도면이다. 도 8을 참조하면, 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 방법은 알고리즘데이터제공단계(S100)를 더 포함할 수 있다. 알고리즘데이터제공모듈은 사용자디바이스에 복수의 알고리즘유형정보를 포함하는 알고리즘데이터를 제공하는 할 수 있다(S100). 알고리즘데이터 및 알고리즘유형정보에 대한 자세한 설명은 상술 한 바와 같다. 또한, 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 방법은 제1권리확보단계(S200)를 더 포함할 수 있다. 제1권리확보단계에서(S200)에서, 제1권리확보모듈은 마켓플레이스서버에 개념증명(PoC)상품 등록 및 NFT 저작권 생성을 요청할 수 있다. 제1권리확보단계(S200)는, 개념증명상품등록단계와 제1NFT저작권생성단계를 포함한다. 개념증명상품등록단계에 서, 추론서비스, 추론서비스API, AI응용서비스, 추론서비스에서 사용 또는 도출된 데이터, 추론서비스API에서 사용 또는 도출된 데이터, 및 AI응용서비스에서 사용 또는 도출된 데이터가 개념증명상품으로 등록 요청된다. 제1NFT저작권생성단계에서, 추론서비스, 추론서비스API, AI응용서비스, 추론서비스에서 사용 또는 도출된 데이 터, 추론서비스API에서 사용 또는 도출된 데이터, 및 AI응용서비스에서 사용 또는 도출된 데이터에 대한 NFT저 작권 생성이 요청될 수 있다. 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 방법은 제2데이터수신단(S300)계와 AI실용서비스생성단계 (S400)를 더 포함할 수 있다. 제3데이터수신단계(S300)에서 사용자디바이스로부터 추론서비스, 추론서비스API 및 AI응용서비스 중 적어도 하나를 이용하여 확보되는 커스터마이징정보가 수신될 수 있다. AI실용서비스생성단 계(S400)에서 커스터마이징정보를 이용하여 AI응용서비스를 커스터마이징한 AI실용서비스가 생성될 수 있다. 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 방법은 제2권리확보단계(S500)를 더 포함한다. 제2권리확보 단계(S500)에서, 제2권리확보모듈은 마켓플레이스서버에 AI실용상품 등록 및 NFT저작권 생성을 요청할 수 있다. 제2권리확보단계(S500)는 AI실용상품등록단계와 제2NFT저작권생성단계를 포함한다. AI실용상품등록단계에서, AI 실용서비스가 AI실용상품으로 등록 요청될 수 있다. 제2NFT저작권생성단계에서, AI실용서비스에 대한 NFT저작권 생성이 요청될 수 있다. 이상 본 발명자에 의해서 이루어진 발명을 상기 실시 예에 따라 구체적으로 설명하였지만, 본 발명은 상기 실시 예에 한정되는 것은 아니고, 그 요지를 이탈하지 않는 범위에서 여러 가지로 변경 가능한 것은 물론이다."}
{"patent_id": "10-2023-0045659", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 인공지능 서비스 개발 서버 및 그 방법을 설명하기 위한 도면이다. 도 2는 도 1에 도시된 인공지능 서비스 개발 서버의 일 실시 예를 도시한 도면이다. 도 3은 도 2에 도시된 인공지능 서비스 개발 서버의 다른 실시 예를 도시한 도면이다. 도 4는 도3에 도시된 알고리즘데이터제공모듈의 일 실시 예를 설명하기 위한 도면이다. 도 5는 도 3에 도시된 인공지능 서비스 개발 서버의 다른 실시 예를 도시한 도면이다. 도 6은 도 5에 도시된 인공지능 서비스 개발 서버의 다른 실시 예를 도시한 도면이다. 도 7은 본 발명의 일 실시 예를 도시한 인공지능 서비스 개발 방법을 도시한 도면이다. 도 8은 도 7에 도시된 인공지능 서비스 개발 방법의 다른 실시 예를 도시한 도면이다."}
