{"patent_id": "10-2022-0011277", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0114930", "출원번호": "10-2022-0011277", "발명의 명칭": "요시험봉 검사 정보 기반의 인공지능 학습 모델을 이용한 콩팥 기능 예측 분석 방법 및 그 장", "출원인": "차의과학대학교 산학협력단", "발명자": "남상민"}}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "콩팥 기능 예측 분석 장치의 동작 방법에 있어서,콩팥 기능 예측 분석 대상자의 대상자 정보를 획득하는 단계;상기 대상자의 요시험봉 검사 정보를 획득하는 단계;상기 요시험봉 검사 정보 및 상기 대상자 정보를, 사전 구축된 요시험봉 변수 학습 기반 인공지능 모델에 입력하여, 추정 사구체 여과율 예측 레벨을 획득하는 단계; 및상기 추정 사구체 여과율 예측 레벨에 기초한 콩팥기능 분석 정보를 출력하는 단계를 포함하는콩팥 기능 예측 분석 장치의 동작 방법."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 대상자의 요시험봉 검사 정보는 제1 입력 모델에 대응하는 제1 요시험봉 검사 변수 정보를 포함하고,제1 요시험봉 검사 변수 정보는, 요단백 변수, 혈뇨 변수, 당뇨 변수, 요비중 변수, 요산도 변수중 적어도 하나를 포함하는콩팥 기능 예측 분석 장치의 동작 방법."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 대상자의 요시험봉 검사 정보는 제2 입력 모델에 대응하는 제2 요시험봉 검사 변수 정보를 포함하고,제2 요시험봉 검사 변수 정보는, 요단백 변수, 요아질산염 변수, 요빌리루빈 변수, 혈뇨 변수, 당뇨 변수, 요백혈구 변수, 우로빌리노겐 변수, 요케톤 변수, 요비중 변수 및 요산도 변수 중 적어도 하나를 포함하는콩팥 기능 예측 분석 장치의 동작 방법."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 요시험봉 변수 학습 기반 인공지능 모델을 구축하는 단계를 더 포함하고,상기 구축하는 단계는,요시험봉 검사 학습 변수 및 대상자 학습 변수를 표준화 알고리즘에 따라 전처리하는 단계; 및상기 전처리된 요시험봉 검사 학습 변수 및 대상자 학습 변수를 입력값으로 설정하고, 상기 입력값에 대응하는대상자의 추정 사구체 여과율 레벨을 출력값으로 설정하여, 그래디언트 부스팅 학습 기반의 인공지능 모델 학습을 수행하는 단계를 포함하는콩팥 기능 예측 분석 장치의 동작 방법."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 그래디언트 부스팅 학습 기반의 인공지능 모델은, 병렬 처리 기반의 익스트림 그래디언트 부스팅(XGBoost,eXtreme Gradient Boosting) 알고리즘을 이용하여 학습된 것인공개특허 10-2023-0114930-3-콩팥 기능 예측 분석 장치의 동작 방법."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 그래디언트 부스팅 학습 기반의 인공지능 모델은,분류 불균형을 조정하기 위한 추정 사구체 여과율 레벨별 훈련 파라미터의 스케일 긍정 가중치가 각각 설정되는콩팥 기능 예측 분석 장치의 동작 방법."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 구축하는 단계는,트리 기반 파이프라인 최적화 툴(TPOT, Tree-based Pipeline Optimization Tool)로 최적화된 하이퍼파라미터를상기 그래디언트 부스팅 학습 기반의 인공지능 모델에 적용하는 단계를 더 포함하는콩팥 기능 예측 분석 장치의 동작 방법."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,상기 전처리하는 단계는,상기 요시험봉 검사 학습 변수 및 대상자 학습 변수를 이용한 모델 성능 테스트를 반복 처리하여, 상기 요시험봉 검사 학습 변수 및 대상자 학습 변수 중 성능 저하가 없는 복수의 학습 변수들을 모델 입력 변수로결정하는, 입력 변수 선택 최적화를 수행하는 단계를 포함하는콩팥 기능 예측 분석 장치의 동작 방법."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 추정 사구체 여과율 예측 레벨에 기초한 콩팥기능 분석 정보를 출력하는 단계는,상기 추정 사구체 여과율 예측 레벨에 따라 콩팥 기능 저하가 예측된 경우, 상기 요시험봉 검사 정보 및 상기대상자 정보에 대응하는 입력 변수별 기여도를 SHAP(SHapley Additive exPlanations) 알고리즘 연산에 따라 획득하고, 상기 입력 변수별 기여도에 기초한 분석 정보를 생성하여, 상기 콩팥기능 분석 정보에 포함시키는 단계를 포함하는콩팥 기능 예측 분석 장치의 동작 방법."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "콩팥 기능 예측 분석 장치에 있어서,콩팥 기능 예측 분석 대상자의 대상자 정보를 획득하는 대상자 정보 처리부;상기 대상자의 요시험봉 검사 정보를 획득하는 요시험봉 정보 처리부;상기 요시험봉 검사 정보 및 상기 대상자 정보를, 사전 구축된 요시험봉 변수 학습 기반 인공지능 모델에 입력하여, 추정 사구체 여과율 예측 레벨을 획득하는 분석 처리부; 및상기 추정 사구체 여과율 예측 레벨에 기초한 콩팥기능 분석 정보를 출력하는 출력부를 포함하는콩팥 기능 예측 분석 장치."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2023-0114930-4-제10항에 있어서,상기 대상자의 요시험봉 검사 정보는 제1 입력 모델에 대응하는 제1 요시험봉 검사 변수 정보 및 제2 입력 모델에 대응하는 제2 요시험봉 검사 변수 정보를 포함하고,제1 요시험봉 검사 변수 정보는, 요단백 변수, 혈뇨 변수, 당뇨 변수, 요비중 변수, 요산도 변수 중 적어도 하나를 포함하고,제2 요시험봉 검사 변수 정보는, 요단백 변수, 요아질산염 변수, 요빌리루빈 변수, 혈뇨 변수, 당뇨 변수, 요백혈구 변수, 우로빌리노겐 변수, 요케톤 변수, 요비중 변수 및 요산도 변수 중 적어도 하나를 포함하는콩팥 기능 예측 분석 장치."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 요시험봉 변수 학습 기반 인공지능 모델을 구축하는 인공지능 학습 기반 모델 구축부를 더 포함하고,상기 인공지능 학습 기반 모델 구축부는,요시험봉 검사 학습 변수 및 대상자 학습 변수를 표준화 알고리즘에 따라 전처리하고, 상기 전처리된 요시험봉검사 학습 변수 및 대상자 학습 변수를 입력값으로 설정하고, 상기 입력값에 대응하는 대상자의 추정 사구체 여과율 레벨을 출력값으로 설정하여, 그래디언트 부스팅 학습 기반의 인공지능 모델 학습을 수행하는콩팥 기능 예측 분석 장치."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 그래디언트 부스팅 학습 기반의 인공지능 모델은, 병렬 처리 기반의 익스트림 그래디언트 부스팅(XGBoost,eXtreme Gradient Boosting) 알고리즘을 이용하여 학습되며,상기 익스트림 그래디언트 부스팅 알고리즘에 따라, 분류 불균형을 조정하기 위한 추정 사구체 여과율 레벨 모델별 훈련 스케일 가중치(scale_pos_weight)가 각각 설정된 것인콩팥 기능 예측 분석 장치."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 인공지능 학습 기반 모델 구축부는,트리 기반 파이프라인 최적화 툴(TPOT, Tree-based Pipeline Optimization Tool)로 최적화된 하이퍼파라미터를상기 그래디언트 부스팅 학습 기반의 인공지능 모델에 적용하고,상기 요시험봉 검사 학습 변수 및 대상자 학습 변수를 이용한 모델 성능 테스트를 반복 처리하여, 상기 요시험봉 검사 학습 변수 및 대상자 학습 변수 중 성능 저하가 없는 복수의 학습 변수들을 모델 입력 변수로결정하는, 입력 변수 선택 최적화를 수행하는콩팥 기능 예측 분석 장치."}
{"patent_id": "10-2022-0011277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 분석 처리부는, 상기 추정 사구체 여과율 예측 레벨에 따라 콩팥 기능 저하가 예측된 경우, 상기 요시험봉검사 정보 및 상기 대상자 정보에 대응하는 입력 변수별 기여도를 SHAP(SHapley Additive exPlanations) 알고리즘 연산에 따라 획득하고, 상기 입력 변수별 기여도에 기초한 분석 정보를 생성하여, 상기 콩팥기능 분석 정보에 포함시키는콩팥 기능 예측 분석 장치.공개특허 10-2023-0114930-5-"}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따른 방법은, 콩팥 기능 예측 분석 장치의 동작 방법에 있어서, 콩팥 기능 예측 분석 대상 자의 대상자 정보를 획득하는 단계; 상기 대상자의 요시험봉 검사 정보를 획득하는 단계; 상기 요시험봉 검사 정 보 및 상기 대상자 정보를, 사전 구축된 요시험봉 변수 학습 기반 인공지능 모델에 입력하여, 추정 사구체 여과 율 예측 레벨을 획득하는 단계; 및 상기 추정 사구체 여과율 예측 레벨에 기초한 콩팥기능 분석 정보를 출력하는 단계를 포함한다."}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 콩팥 기능 예측 분석 방법 및 그 장치에 관한 것이다. 보다 구체적으로, 본 발명은 요시험봉 검사 정 보 기반의 인공지능 학습 모델을 이용한 콩팥 기능 예측 분석 방법 및 그 장치에 관한 것이다."}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 식생활을 중심으로 한 생활 습관의 큰 변화 및 고령화 추세에 따라 고혈압이나 당뇨병 등의 생활 습관 질 병 발생률이 증가하고, 그에 따라 콩팥 질환, 나아가 신부전의 위험이 증가하고 있다. 콩팥은 노폐물의 배설, 체액, 전해질 및 산 염기 평형의 조절 등을 통해 내부 환경의 항상성을 유지하는데 중요 한 장기이다. 콩팥은 수소, 나트륨, 칼륨 및 규소 등의 혈액에 있는 다양한 화합물의 농도를 제어하고 노폐물을 소변으로 배출한다. 콩팥 기능 저하는 어떠한 것이든, 혈액에서 대사 산물을 충분히 제거하는 신체 능력을 방해 할 수 있으며, 신체의 전해질 평형을 파괴할 수 있다. 콩팥 기능의 저하 또는 부전은 그 증상이 치명적이다. 일반적으로 콩팥 기능의 저하에 따른 말기 신부전증의 경우, 혈액검사, 소변검사, 콩팥 초음파검사 등을 종합하 여 진단할 수 있다. 특히, 혈액검사를 통하면 혈중 요소질소 농도(BUN: Blood urea nitrogen), 혈중 크레아틴 농도(Cr:Creatine)의 상승을 알 수 있으며 이를 통해 사구체 여과율을 추정해 볼 수 있다. 그러나, 초기 콩팥 질환은 무증상인 경우가 많고, 혈액 검사 등의 종합 검사는 많은 시간과 비용이 소요되므로 초기 진단이 잘 이루어지지 못하는 문제점이 있다. 특히, 조기 진단 및 치료를 하지 못하고 추후 종합검사를 통 해 진단되면, 투석이나 콩팥 이식과 같은 고비용 치료가 수반되는 바, 혈액검사를 포함하는 종합 검사를 대체할 수 있는 간편하고 접근성 높은 선별검사 수단이 요구되고 있다."}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 바와 같은 문제점을 해결하고자 안출된 것으로, 요시험봉 검사만으로도 콩팥기능의 저하 여부 와 저하 요인 등을 예측할 수 있는 딥러닝 인공지능 기반의 학습 모델을 구축하고, 이에 기초한 콩팥 기능의 예 측 분석을 수행함으로써, 혈액검사 없이도 간편하고 접근성 높은 초기 진단 가능한 선별검사 수단을 제공할 수 있는 요시험봉 검사 정보 기반의 인공지능 학습 모델을 이용한 콩팥 기능 예측 분석 방법 및 그 장치를 제공하 는 데 그 목적이 있다."}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 과제를 해결하기 위한 본 발명의 실시 예에 따른 방법은, 콩팥 기능 예측 분석 장치의 동작 방법에 있어서, 콩팥 기능 예측 분석 대상자의 대상자 정보를 획득하는 단계; 상기 대상자의 요시험봉 검사 정 보를 획득하는 단계; 상기 요시험봉 검사 정보 및 상기 대상자 정보를, 사전 구축된 요시험봉 변수 학습 기반 인공지능 모델에 입력하여, 추정 사구체 여과율 예측 레벨을 획득하는 단계; 및 상기 추정 사구체 여과율 예측 레벨에 기초한 콩팥기능 분석 정보를 출력하는 단계를 포함한다. 상기한 바와 같은 과제를 해결하기 위한 본 발명의 실시 예에 따른 장치는, 콩팥 기능 예측 분석 장치에 있어서, 콩팥 기능 예측 분석 대상자의 대상자 정보를 획득하는 대상자 정보 처리부; 상기 대상자의 요시험봉 검사 정보를 획득하는 요시험봉 정보 처리부; 상기 요시험봉 검사 정보 및 상기 대상자 정보를, 사전 구축된 요 시험봉 변수 학습 기반 인공지능 모델에 입력하여, 추정 사구체 여과율 예측 레벨을 획득하는 분석 처리부; 및 상기 추정 사구체 여과율 예측 레벨에 기초한 콩팥기능 분석 정보를 출력하는 출력부를 포함한다."}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 상기 요시험봉 검사 정보 및 상기 대상자 정보를, 사전 구축된 요시험봉 변수 학 습 기반 인공지능 모델에 입력하여, 추정 사구체 여과율 예측 레벨을 획득하고, 상기 추정 사구체 여과율 예측 레벨에 기초한 콩팥기능 분석 정보를 제공할 수 있으며, 결과적으로 혈액 검사 없이 요시험봉 검사만으로도 콩 팥기능의 저하 여부와 저하 요인 등을 예측할 수 있는 딥러닝 인공지능 기반의 학습 모델을 구축하고, 이에 기 초한 콩팥 기능의 예측 분석을 수행할 수 있게 된다.이에 따라, 본 발명의 실시 예에 따르면, 별도의 혈액검사 없이도 간편하고 접근성 높은 초기 진단 가능한 선별 검사 수단을 제공할 수 있는 요시험봉 검사 정보 기반의 인공지능 학습 모델을 이용한 콩팥 기능 예측 분석 방 법 및 그 장치를 제공할 수 있게 된다."}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 내용은 단지 본 발명의 원리를 예시한다. 그러므로 당업자는 비록 본 명세서에 명확히 설명되거나 도시 되지 않았지만 본 발명의 원리를 구현하고 본 발명의 개념과 범위에 포함된 다양한 장치와 방법을 발명할 수 있 는 것이다. 또한, 본 명세서에 열거된 모든 조건부 용어 및 실시 예들은 원칙적으로, 본 발명의 개념이 이해되 도록 하기 위한 목적으로만 명백히 의도되고, 이와 같이 특별히 열거된 실시 예들 및 상태들에 제한적이지 않는 것으로 이해되어야 한다. 또한, 본 발명의 원리, 관점 및 실시 예들 뿐만 아니라 특정 실시 예를 열거하는 모든 상세한 설명은 이러한 사 항의 구조적 및 기능적 균등물을 포함하도록 의도되는 것으로 이해되어야 한다. 또한 이러한 균등물들은 현재 공지된 균등물뿐만 아니라 장래에 개발될 균등물 즉 구조와 무관하게 동일한 기능을 수행하도록 발명된 모든 소 자를 포함하는 것으로 이해되어야 한다. 따라서, 예를 들어, 본 명세서의 블록도는 본 발명의 원리를 구체화하는 예시적인 회로의 개념적인 관점을 나타 내는 것으로 이해되어야 한다. 이와 유사하게, 모든 흐름도, 상태 변환도, 의사 코드 등은 컴퓨터가 판독 가능 한 매체에 실질적으로 나타낼 수 있고 컴퓨터 또는 프로세서가 명백히 도시되었는지 여부를 불문하고 컴퓨터 또 는 프로세서에 의해 수행되는 다양한 프로세스를 나타내는 것으로 이해되어야 한다. 또한 프로세서, 제어 또는 이와 유사한 개념으로 제시되는 용어의 명확한 사용은 소프트웨어를 실행할 능력을 가진 하드웨어를 배타적으로 인용하여 해석되어서는 아니 되고, 제한 없이 디지털 신호 프로세서(DSP) 하드웨어, 소프트웨어를 저장하기 위한 롬(ROM), 램(RAM) 및 비휘발성 메모리를 암시적으로 포함하는 것으로 이 해되어야 한다. 주지관용의 다른 하드웨어도 포함될 수 있다. 상술한 목적, 특징 및 장점은 첨부된 도면과 관련한 다음의 상세한 설명을 통하여 보다 분명해질 것이며, 그에"}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "따라 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있 을 것이다. 또한, 본 발명을 실시함에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에 그 상세한 설명을 생략하기로 한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시 예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 도 1은 본 발명의 실시 예에 따른 콩팥 기능 예측 분석 장치를 구체적으로 도시한 블록도이다. 도 1을 참조하면, 본 발명의 실시 예에 따른 콩팥 기능 예측 분석 장치는, 요시험봉 정보 처리부, 대 상자 정보 처리부, 분석 처리부, 인공지능 학습 기반 모델 구축부 및 예측 결과 출력부를 포함한다.먼저, 본 명세서에서 설명되는 콩팥 기능 예측 분석 장치는, PC(personal computer), 노트북 컴퓨터 (laptop computer), 휴대폰(Mobile phone), 태블릿 PC(Tablet PC), PDA(Personal Digital Assistants), PMP(Portable Multimedia Player) 등이 포함될 수 있다. 하지만, 본 발명은 상기 장치 구분에 한정되지 않고 데이터 처리 및 저장, 관리 기능을 고도화하여 확장할 수 있는 서버 시스템 등의 장치를 포함할 수도 있다. 그리고, 본 발명의 실시 예에 따른 콩팥 기능 예측 분석 장치는, 외부의 모바일 단말이나, 서버 또는 직접 입력되는 사용자 입력 정보로부터, 콩팥 기능 예측 분석 대상자의 대상자 정보를 획득하고, 상기 대상자의 요시 험봉 검사 정보를 획득하며, 상기 요시험봉 검사 정보 및 상기 대상자 정보를, 사전 구축된 요시험봉 변수 학습 기반 인공지능 모델에 입력하여, 추정 사구체 여과율 예측 레벨을 획득하고, 상기 추정 사구체 여과율 예측 레 벨에 기초한 콩팥기능 분석 정보를 출력하는 분석 장치일 수 있다. 여기서, 콩팥 기능 예측 분석 장치에서 출력되는 상기 콩팥기능 분석 정보는, 콩팥병의 조기 진단 정보를 포함할 수 있으며, 전술한 모바일 단말, 서버 또는 별도의 디스플레이 장치 등을 통해 출력될 수 있다. 예를 들 어, 상기 콩팥 질환의 조기 진단 정보는 건강 관리센터에서 제공하는 서버 등의 시스템으로 제공되거나, 모바일 단말로 제공될 수 있으며, 이를 위해, 콩팥 기능 예측 분석 장치는, 유선/무선 네트워크를 통해 모바일 단 말 또는 서버 시스템에 연결될 수 있다. 상기 네트워크에 연결된 장치 또는 단말은 사전 설정된 네트워크 채널을 통해 상호간 통신을 수행할 수 있으며, 통신을 위한 각각의 프로토콜을 지원하는 통신 모듈을 구비할 수 있다. 여기서 상기 네트워크는 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN), 부 가가치 통신망(Value Added Network; VAN), 개인 근거리 무선통신(Personal Area Network; PAN), 이동 통신망 (Mobile radio communication network) 또는 위성 통신망 등과 같은 모든 종류의 유/무선 네트워크로 구현될 수 있다. 이러한 콩팥 기능 예측 분석 장치의 콩팥기능 분석 데이터 처리를 통해, 별도의 혈액검사 없이 요시험봉 검사만으로도 콩팥 질환의 진단 예측을 가능하게 하는 바, 이를 구현하기 위해, 도 1을 참조하면, 먼저 요시험 봉 정보 처리부는 대상자의 요시험봉 검사 정보를 획득하기 위한 정보의 획득 처리를 수행할 수 있으며, 대상자 정보 처리부는 콩팥 기능 분석을 위한 대상자 정보의 획득 처리를 수행할 수 있다. 여기서, 요시험봉 정보 처리부에서 획득되는 상기 대상자의 요시험봉 검사 정보는 소변검사의 종류에 따른 제1 입력 모델 또는 제2 입력 모델로 구분될 수 있다. 제1 입력 모델의 경우, 5종 소변검사인 경우에 대응할 수 있으며, 제1 입력 모델의 요시험봉 검사 정보는 제1 요시험봉 검사 변수 정보를 포함하고, 상기 제1 요시험봉 검사 변수 정보는, 요단백 변수, 혈뇨 변수, 당뇨 변 수, 요비중 변수, 요산도 변수 중 적어도 하나를 포함할 수 있다. 바람직하게, 제1 입력 모델의 요시험봉 검사 변수 정보는 상기 요단백 변수, 혈뇨 변수, 당뇨 변수, 요비중 변수, 요산도 변수의 5가지가 모두 포함될 수 있 다. 제2 입력 모델의 경우, 10종 소변검사인 경우에 대응할 수 있으며, 제2 입력 모델의 요시험봉 검사 정보는 제2 요시험봉 검사 변수 정보를 포함하고, 상기 제2 요시험봉 검사 변수 정보는, 요단백 변수, 요아질산염 변수, 요 빌리루빈 변수, 혈뇨 변수, 당뇨 변수, 요백혈구 변수, 우로빌리노겐 변수, 요케톤 변수, 요비중 변수 및 요산 도 변수 중 적어도 하나를 포함할 수 있다. 바람직하게, 제2 입력 모델의 요시험봉 검사 변수 정보는, 상기 요 단백 변수, 요아질산염 변수, 요빌리루빈 변수, 혈뇨 변수, 당뇨 변수, 요백혈구 변수, 우로빌리노겐 변수, 요 케톤 변수, 요비중 변수 및 요산도 변수의 10가지가 모두 포함될 수 있다. 그리고, 대상자 정보 처리부에서 획득되는 대상자 정보는, 대상자의 나이 정보, 성별 정보를 포함하는 추 정 사구체 여과율 예측을 위한 사용자 정보를 포함할 수 있다. 그리고, 분석 처리부는, 상기 요시험봉 검사 정보 및 상기 대상자 정보를, 인공지능 학습 기반 모델 구축 부의 학습 프로세스에 의해 사전 구축된 요시험봉 변수 학습 기반 인공지능 모델에 입력하여, 추정 사구체 여과율 예측 레벨을 획득할 수 있다. 또한, 예측 결과 출력부는, 상기 추정 사구체 여과율 예측 레벨에 기초한 콩팥기능 분석 정보를 출력할 수 있으며, 예측 결과 출력부는 모바일 단말, 서버 또는 사용자 디스플레이 장치 등을 이용하여, 상기 콩팥기 능 분석 정보를 포함하는 다양한 형태의 콩팥 기능 진단 인터페이스를 출력할 수 있다. 그리고, 인공지능 학습 기반 모델 구축부는, 상기 요시험봉 변수 학습 기반 인공지능 모델을 구축함에 있 어서, 요시험봉 검사 학습 변수와, 대상자 학습 변수를 입력값으로 구성하고, 신기능 저하 정도를 나타내는 추 정 사구체 여과율(eFGR, Estimated Glomerular Filtration Rate)의 레벨을 출력값으로 구성하는 학습 데이트 세트를 이용한 인공지능 기반의 기계학습을 수행할 수 있다. 이를 위해, 인공지능 학습 기반 모델 구축부는, 요시험봉 검사 학습 변수 및 대상자 학습 변수를 표준화 알고리즘에 따라 전처리할 수 있다. 여기서, 상기 인공지능 학습 기반 모델 구축부는, 그래디언트 부스팅 학습 기반의 인공지능 모델이 최상의 성능을 발휘할 수 있도록 상기 요시험봉 검사 학습 변수 및 대상자 학습 변수로 트리 기반 파이프라인 최적화 툴(TPOT, Tree-based Pipeline Optimization Tool)를 이용해 최적화 될 수 있다. 또한, 인공지능 학습 기반 모델 구축부는, 제2 입력 모델의 10종 소변검사 학습 변수 중 한 개 이상을 선 택적으로 조합하여, 요시험봉 대상자 학습 변수와 함께 모델 성능 테스트를 반복 처리함으로써, 상기 요시험 봉 검사 학습 변수 및 대상자 학습 변수 중 성능 저하가 없는 복수의 학습 변수들을 모델 입력 변수로 결정할 수 있다. 예를 들어, 제2 입력 모델에서 선택된 학습 변수들에서 선택된 5가지의 변수가 제1 입력 모델 변수로 서 결정될 수 있는 것이며, 그 조합에 따라서는 제3 입력 모델, 제4 입력 모델 등의 다양한 입력 변수 모델들이 구성될 수 있다. 또한, 인공지능 학습 기반 모델 구축부는, 상기 전처리된 요시험봉 검사 학습 변수 및 대상자 학습 변수를 입력값으로 설정하고, 상기 입력값에 대응하는 대상자의 추정 사구체 여과율 레벨을 출력값으로 설정하여, 그래 디언트 부스팅 학습 기반의 인공지능 모델 학습을 수행할 수 있다. 이러한 상기 그래디언트 부스팅 학습 기반의 인공지능 모델은, 병렬 처리 기반의 익스트림 그래디언트 부스팅 (XGBoost, eXtreme Gradient Boosting) 알고리즘을 이용하여 학습되는 모델이 이용될 수 있다. 또한, 상기 그 래디언트 부스팅 학습 기반의 인공지능 모델은, 분류 불균형(imbalance classification)을 조정하기 위한 추정 사구체 여과율 레벨 별 훈련 스케일 가중치(scale_pos_weight)가 각각 적절하게 설정되어 있을 수 있다. 보다 상세한 학습 모델 구축 및 동작 방식에 대하여는 보다 구체적으로 후술하도록 한다.도 2는 본 발명의 실시 예에 따른 콩팥 기능 예측 분석 장치의 동작 방법을 설명하기 위한 흐름도이며, 도 3 및 도 4는 본 발명의 실시 예에 따른 인공지능 학습 모델의 구축 과정을 설명하기 위한 흐름도이다. 먼저, 도 2를 참조하면, 본 발명의 실시 예에 따른 콩팥 기능 예측 분석 장치는, 요시험봉 검사 변수 및 대상자 변수를 학습 모델의 매개 변수로서 전처리하여, 요시험봉 검사 학습 변수 및 대상자 학습 변수를 획득한 다(S101). 그리고, 콩팥 기능 예측 분석 장치는, 상기 요시험봉 검사 학습 변수 및 상기 대상자 학습 변수를 입력값 으로 설정하고, 이에 대응하는 상기 대상자의 추정 사구체 여과율 레벨을 출력값으로 설정하여, 가중치 조절된 그래디언트 부스팅 학습 기반 인공지능 모델을 구축한다(S103). 이후, 콩팥 기능 예측 분석 장치는, 대상자의 요시험봉 검사 정보 및 대상자 정보를 모델에 입력하여 (S105), 추정 사구체 여과율 예측 레벨과, 콩팥기능 저하의 변수 별 기여도 정보를 포함하는 콩팥기능 분석 정 보를 생성한다(S105). 이후, 콩팥 기능 예측 분석 장치는, 생성된 콩팥기능 분석 정보를 출력한다(S107). 콩팥 기능 예측 분석 장치는, 콩팥 기능 분석 정보 기반의 다양한 건강 진단 서비스를 모바일 단말 또는 서버 시스템으로 제공 할 수 있다. 그리고, 도 3 및 도 4는 본 발명의 실시 예에 따른 인공지능 학습 모델의 구축 및 분석 과정을 보다 구체적으로 도시한 것으로, 먼저, 본 발명의 실시 예에 따른 학습 기반 인공지능 모델은, 전술한 것처럼 병렬 처리 기반의 익스트림 그래디언트 부스팅(XGBoost, eXtreme Gradient Boosting) 알고리즘을 이용하여 사전 구축될 수 있다. 여기서, 본 발명의 실시 예에 따라 학습에 이용되는 XGBoost 알고리즘은, 그래디언트 부스팅 (gradient boosting) 트리 알고리즘 (tree algorithm) 기술을 사용하는 기계학습 알고리즘이며, 학습 변수에 따라 생성된 복수의 트리 모델을 결합하여 최종 판단을 수행하는 것으로 알려진 알고리즘으로서, 트리 모델들을 생성할 때 이전 트리 모델의 오류를 수정하며(이를 부스팅이라고 함), 이때 그래디언트 하강 (gradient descent) 알고리즘 을 사용하여 손실을 최소화하는 방식이다. 또한, XGBoost는 희소성 인식 분할 색인(sparsity-aware split finding) 방식으로 결측값을 처리할 수 있으며, GPU를 사용하여 계산 속도를 가속할 수 있는 장점이 있다. 그리고, 이러한 XGBoost 알고리즘을 본 발명의 실시 예에 따른 추정 사구체 여과율 예측 레벨의 예측에 이용하 기 위해, 본 발명의 실시 예에 따른 추정 사구체 여과율 예측값(eGFR)의 학습 변수는 아래의 수학식 1과 같은 사구체 여과율 평가 공식인 CKD-EPI 방식으로 획득되는 사구체 여과율 값일 수 있으며, 상기 eGFR 값은 사전 설 정된 범위에 따라, 각 레벨 별로 분류 처리될 수 있다. 예를 들어, 상기 추정 사구체 여과율(eGFR) 예측값은 제1 레벨인 60 mL/min/1.83m^2 미만인 범주와, 제2 레벨인 45 mL/min/1.83m^2 미만인 범주와, 제3 레벨인 30 mL/min/1.83m^2 미만인 범주 중 어느 하나에 해당될 수 있으 며, 이에 따라 3개의 레벨 중 어느 하나가 선택적으로 할당될 수 있다. 그리고, 출력 결과는 상기 추정 사구체 여과율 예측값 레벨별 긍정(positive) 또는 부정(negative) 결과로서 결정될 수 있다. 또한, 레벨의 긍정 또는 부정 결과를 위한 각 레벨별 역치가 사전에 설정될 수 있으며, 후술할 서브 그룹별로 역치는 상이하게 설정될 수 있다. 수학식 1"}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 수학식 1에서, sCr은 혈청 크레아티닌 농도를 나타내며, A, κ, α는 각각 성별 및 sCr의 농도에 따라 하 기 표 1에 의해 가변 설정되는 값일 수 있다. 구체적인 연산과정에 대하여는 알려진 논문(Levey AS, A new equation to estimate glomerular filtration rate, Ann Intern Med. 2009 May 5;150:604-12) 등을 참고할 수 있다. 표 1"}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "또한, 이와 같은 추정 사구체 여과율 예측 레벨의 학습을 위해, 본 발명의 실시 예에 따른 학습 변수 중 적어도 일부는 정규화 처리될 수 있다. 보다 구체적으로 예를 들어, 본 발명의 실시 예에 따른 요시험봉 정보 및 대상자 정보 중, 나이(age), 요비중 (urine specific gravity), 및 요산도(urine pH)는 평균을 제거하고 단위 분산에 맞게 재조정하는 표준화 처리 가 수행될 수 있다. 이에 대한 표준화 처리 과정은 수학식 2와 같이 설명될 수 있다. 수학식 2"}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, z는 표준화 처리된 입력값을 나타내며, x는 원본 입력값, u는 입력 값들의 평균값이며, s는 입력값들의 표준편차를 나타낸다.이에 따라 본 발명의 실시 예에 따른 인공지능 학습 기반 모델 구축부는, 수학식 2를 이용한 표준화에 따 라 전처리된 요시험봉 정보와, 대상자 정보를 입력값으로 설정하고, 전술한 수학식 1 및 표 1에 의해 산출되는 추정 사구체 여과율 예측 레벨을 출력값으로 설정하는 학습 데이터 세트를 구성하며, 실제의 임상 데이터를 이 용한 그래디언트 부스팅 트리 알고리즘 기반의 학습 프로세스를 수행하며, 결과 예측의 성능을 반복적으로 향상 시켜, 최적의 모델을 구축할 수 있다. 또한, 여기서 인공지능 학습 기반 모델 구축부는, 상기 요시험봉 검사 학습 변수 및 대상자 학습 변수를 이용한 모델 성능 테스트를 반복 처리하여, 상기 요시험봉 검사 학습 변수 및 대상자 학습 변수 중 최상의 성능 을 보이는 복수의 학습 변수들을 모델 입력 변수로 결정하는 입력 변수 선택 최적화를 수행할 수 있다. 예를 들어, 본 발명의 실시 예에 따른 인공지능 학습 기반 모델 구축부는, 상기 요시험봉 검사 학습 변수 및 대상자 학습 변수에서 특징 변수를 선택할 수 있으며, 이를 위해, 인공지능 학습 기반 모델 구축부는, XGBoost 모델에서 계산된 특성 중요도(feature importance) 값에 따라 모델 변수들 중 가장 중요하지 않은 변수 를 제거한 후, 훈련 데이터를 이용해 모델 성능을 확인하고 모델 성능 하락이 없다면 그 다음으로 중요하지 않 은 변수를 제거하고 다시 성능 테스트를 수행할 수 있다. 그리고, 인공지능 학습 기반 모델 구축부는, 이 과정을 최초 모델과 비교했을 때 성능 저하가 없을 때까지 반복함에 따라, 입력에 필요한 입력변수들의 개수를 줄일 수 있다. 본 발명의 실시 예에 따른 테스트에 따르면, 입력 변수는 최초 12개에서 7개가 될 때까지 모델 성능 저하가 없었음을 확인할 수 있었다. 한편, 본 발명의 실시 예에 따른 인공지능 학습 기반 모델 구축부는, XGBoost의 하이퍼파라미터를, 자동화 된 인공지능 도구인 트리 기반 파이프라인 최적화 툴(TPOT, Tree-based Pipeline Optimization Tool)로 최적화 함에 따라, 보다 높은 성능을 도모할 수 있다. 보다 구체적으로, TPOT은 유전 프로그래밍을 사용하여 기계 학습 파이프라인을 최적화하는 파이썬(Python)용 자동 기계 학습 도구이다. 특히, 본 발명의 실시 예에 따른 최적화가 수행된 하이퍼파라미터들은 아래의 표 2와 같다. 표 2"}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서, 특히 스케일 긍정 가중치(scale_pos_weight) 변수는, 통상적으로 이진 분류 모델에서 출력 비율이 불균 형일 때, 불균형을 조정해 주는 변수로서, 훈련데이터의 출력 비율로 조정되는 값이며, 통상적으로는 많은 비율 의 집단의 수를 적은 비율의 집단의 수로 나눈 값이 설정될 수 있다. 이에 따라, 본 발명의 실시 예에 따른 인공지능 학습 기반 모델 구축부는 각각의 레벨별 학습 모델 및 그 학습 파라미터를 서로 상이하게 설정할 수 있으며, 특히 스케일 긍정 가중치(scale_pos_weight) 변수를 조정하여 각 레벨에 따른 긍/부정 출력 비율 간 불균형을 사전에 조정할 수 있다. 또한, 본 발명의 실시 예에 따른 학습 모델은 그 입력 변수의 특징에 따라 하나 이상의 서브 그룹으로 분류 처 리할 수 있으며, 각 서브 그룹에 대응하여 서로 다른 추정 사구체 여과율 예측 레벨 역치를 할당함에 따라, 콩 팥 기능 저하를 보다 정확하게 예측하도록 처리할 수 있다. 여기서, 상기 서브 그룹은 특히 요단백 및 요당의 수치에 따라 적어도 4개 이상의 그룹으로 구분될 수 있으며, 이는 단백뇨 등에 따른 민감도와 특이도가 달라 성 능이 저하될 수 있는 문제점들을 보정하는 데 이용된다. 이와 같이 모델이 구축되면, 도 3 및 도 4에 도시된 바와 같은 분석 프로세스가 수행될 수 있다. 먼저, 분석 처리부는, 요시험봉 정보의 서브그룹 정보 분류를 결정하고, 서브그룹 정보 분류에 따른 모델 별 역치를 설정한다(S203). 여기서, 서브그룹 정보 분류는, 전술한 바와 같이 요단백 및 요당의 수치에 따라 분석 처리부에서 분류 처 리될 수 있다. 도 4는 S203 단계에서 처리되는 분류 프로세스를 보다 구체적으로 예시한 것으로, 도 4에 도시된 바와 같이, 요 단백질과 요당 레벨의 각 기준값에 따라 적어도 4개의 서브그룹타입으로 설정될 수 있다. 또한, 분석 처리부는, 서브그룹 타입 중 단백질 레벨 및 당 레벨이 모두 사전 설정된 기준값에 따른 역치 보다 낮은 서브그룹 1을 제외한 나머지 2, 3, 4타입의 경우에는 내과 진료가 필요할 수 있으므로, 이를 안내하 는 서비스 프로세스를 더 수행할 수도 있다. 그리고, 다시 도 3을 참조하면, 분석 처리부는, 입력된 요시험봉 정보 및 대상자 정보의 표준화 처리를 수 행한다(S205). 여기서 상기 표준화 처리는 앞서 설명한 수학식 2를 통해 수행될 수 있으며, 결과적으로 학습에 이용된 데이터 를 이용하여, 입력 정보의 표준화 처리가 가능하게 된다. 그리고, 분석 처리부는, 사전 학습된 인공지능 모델에 상기 표준화 처리된 입력 정보를 적용하여, 출력 정 보로서 획득되는 추정 사구체 여과율 예측 레벨 별 긍정 또는 부정 정보에 따라, 추정 사구체 여과율 예측 레벨 확률을 결정한다(S209). 이후, 분석 처리부는, 앞서 결정된 서브그룹 타입에 대응하여 설정된 역치와, 상기 추정 사구체 여과율 예 측 레벨 확률에 기초하여, 콩팥 기능의 저하여부 정보를 생성한다(S211). 여기서, 분석 처리부는, 콩팥 기능 저하 시 SHAP(SHapley Additive exPlanations) 값을 계산하여, 콩팥 기능 저하에 각 입력 변수가 기여한 정도를 설명하는 설명정보를 생성할 수 있다(S213). 이에 따라, 분석 처리부는 상기 콩팥 기능 저하 여부 정보 및 입력값이 기여한 정도와 연관된 설명 정보를 포함하는 콩팥 분석 결과 정보를 예측 결과 출력부로 출력할 수 있다(S215). 예를 들어, 상기 분석 처리부는, 상기 추정 사구체 여과율 예측 레벨에 따라 콩팥 기능 저하가 예측된 경 우, 상기 요시험봉 검사 정보 및 상기 대상자 정보에 대응하는 입력 변수별 기여도를 SHAP(SHapley Additive exPlanations) 알고리즘 연산에 따라 획득하고, 상기 입력 변수별 기여도에 기초한 분석 정보를 생성하여, 상기 콩팥기능 분석 정보에 포함시킬 수 있는 것이다. 도 5 내지 도 6는 본 발명의 실시 예에 따른 인공지능 학습 모델의 성능 테스트 분석 결과를 나타내는 그래프이 다. 도 5 및 도 6는 학습 데이터로서, 단일 의료기관에서 생성된 210,000여 사례를 이용하여 학습을 수행하고, 국민 건강영양조사(KNHANES) 데이터를 이용하여 외부 검증한 결과로서, 일반 인구집단에 적용 가능한 선별 검사 및 검증이 수행된 결과를 나타낸다. 도 5는 전술한 제1 입력 모델인 소변검사 5종 키트를 이용한 검사 결과의 성능 지표이며, 도 6는 제2 입력 모델인 소변검사 10종 키트를 이용한 검사 결과의 성능 지표를 나타낸다. 테스트 분석에서, 추정 사구체 여과율 예측 레벨은 그 수치 범주에 따라 제1 레벨 모델(eGFR60 model), 제2 레 벨 모델(eGFR45 model), 제3 레벨 모델(eGFR30 model)로 설정되었으며, 전술한 바와 같이 서브 그룹은 단백질 수치 및 당 수치에 따라 4개의 서브 그룹 타입으로 분류 설정되었다. 분류에 따라 모델이 계산한 예측 값이 각 서브 그룹 타입에 해당하는 역치(Threshold)보다 크면, 추정 사구체 여과율 예측 레벨(eGFR)이 60 미만의 제1 레벨인지, 45미만의 제2 레벨인지 30 미만의 제3 레벨인지의 긍정/부정 결과가 출력될 수 있다.도 5 및 도 6에 도시된 테스트 수행에 따른 최종적인 성능 결과는 민감도가 0.8 내지 1.0, 특이도는 0.7 내지 0.9로서, 이에 따른 AUC(Area under the Curve)가 0.9 내지 1.0를 기록하여, 신뢰성 있는 모델 구축 및 운용이 가능한 것을 확인할 수 있다. 이와 같은 본 발명의 실시 예에 따른 콩팥 기능 예측 분석 장치 및 그 동작 방법에 따라, 별도의 혈액 검 사 없이도, 요시험봉 검사 결과와 대상자 정보만 입력하면, 콩팥 기능 저하를 신속 용이하게 예측할 수 있게 된 다. 이에 따라, 본 발명은 만성 콩팥병의 조기 진단을 가능하게 하며, 이로 인한 삶의 질 저하를 예방하고, 사회경 제적 비용을 절감할 수 있을 뿐만 아니라, 인공지능을 이용한 분석을 통해, 학습 데이터가 누적됨에 따라 보다 정확한 서비스 및 기기 동작을 제공할 수 있게 된다. 상술한 본 발명에 따른 방법은 컴퓨터에서 실행되기 위한 프로그램으로 제작되어 컴퓨터가 읽을 수 있는 기록 매체에 저장될 수 있으며, 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장장치 등이 있다. 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고, 상기 방법을 구현하기 위한 기능적인(function) 프로그램,"}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "코드 및 코드 세그먼트들은 본 발명이 속하는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 또한, 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시"}
{"patent_id": "10-2022-0011277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형 실시들은 본 발명 의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2022-0011277", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 콩팥 기능 예측 분석 장치를 구체적으로 도시한 블록도이다. 도 2는 본 발명의 실시 예에 따른 콩팥 기능 예측 분석 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 3 및 도 4는 본 발명의 실시 예에 따른 인공지능 학습 모델의 구축 과정을 설명하기 위한 흐름도이다. 도 5 내지 도 6은 본 발명의 실시 예에 따른 인공지능 학습 모델의 성능 테스트 분석 결과를 나타내는 그래프이 다."}
