{"patent_id": "10-2023-0079363", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0177889", "출원번호": "10-2023-0079363", "발명의 명칭": "대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치, 방법 및 컴퓨터프로그램", "출원인": "한림대학교 산학협력단", "발명자": "이윤재"}}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "응급 환자에 대해 중증 환자인지를 결정하도록 학습된 중증 진단 인공지능 모델을 포함하는 메모리; 및상기 중증 진단 인공지능 모델에 응급 환자 정보를 입력 데이터로 입력하여 상기 중증 진단 인공지능 모델로부터 상기 응급 환자 정보의 응급 환자에 대해 중증 환자인지가 결정된 결과인 중증 진단 정보를 출력 데이터로출력받는 프로세서;를 포함하는 것을 특징으로 하는대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는의료진에 의해서 응급 환자에 대해 중증 환자인지가 결정된 결과인 의료진 중증 진단 정보를 정답 데이터로 설정하고, 상기 의료진 중증 진단 정보에 대응되는 응급 환자 정보를 문제 데이터로 설정하여 훈련 데이터를 구성하고, 상기 훈련 데이터를 이용하여 상기 중증 진단 인공지능 모델을 학습시키는 것을 특징으로 하는 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는대화형 인공지능 모델을 이용하여 상기 의료진 중증 진단 정보 및 상기 의료진 중증 진단 정보에 대응되는 응급환자 정보 각각을 확장시키는 것을 특징으로 하는대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 프로세서는상기 정답 데이터로 설정된 상기 의료진 중증 진단 정보 및 상기 문제 데이터로 설정된 상기 응급 환자 정보의정보량에 기초하여 상기 중증 진단 인공지능 모델의 학습도를 산출하는 것을 특징으로 하는대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는상기 응급 환자 정보가 재결정 조건을 충족하는지 여부를 판단하고,공개특허 10-2024-0177889-3-상기 응급 환자 정보가 재결정 조건을 충족하면, 상기 중증 진단 인공지능 모델에 상기 응급 환자 정보를 상기입력 데이터로 재입력하여 상기 중증 진단 인공지능 모델로부터 상기 중증 진단 정보를 상기 출력 데이터로 재출력받는 것을 특징으로 하는대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "프로세서가 중증 진단 인공지능 모델이 응급 환자에 대해 중증 환자인지를 결정하도록 상기 중증 진단 인공지능모델을 학습시키는 단계;상기 프로세서가 상기 중증 진단 인공지능 모델에 응급 환자 정보를 입력 데이터로 입력하여 상기 중증 진단 인공지능 모델로부터 상기 응급 환자 정보의 응급 환자에 대해 중증 환자인지가 결정된 결과인 중증 진단 정보를출력 데이터로 출력받는 단계;를 포함하는 것을 특징으로 하는대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 학습시키는 단계는상기 프로세서가 의료진에 의해서 응급 환자에 대해 중증 환자인지가 결정된 결과인 의료진 중증 진단 정보를정답 데이터로 설정하고, 상기 의료진 중증 진단 정보에 대응되는 응급 환자 정보를 문제 데이터로 설정하여 훈련 데이터를 구성하는 단계; 및상기 프로세가 상기 훈련 데이터를 이용하여 상기 중증 진단 인공지능 모델을 학습시키는 단계;를 포함하는 것을 특징으로 하는 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서가 대화형 인공지능 모델을 이용하여 상기 의료진 중증 진단 정보 및 상기 의료진 중증 진단 정보에 대응되는 응급 환자 정보 각각을 확장시키는 단계;를 포함하는 것을 특징으로 하는대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 프로세서가 상기 정답 데이터로 설정된 상기 의료진 중증 진단 정보 및 상기 문제 데이터로 설정된 상기응급 환자 정보의 정보량에 기초하여 상기 중증 진단 인공지능 모델의 학습도를 산출하는 단계;를 포함하는 것을 특징으로 하는대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,공개특허 10-2024-0177889-4-상기 프로세서가 상기 응급 환자 정보가 재결정 조건을 충족하는지 여부를 판단하고, 상기 응급 환자 정보가 재결정 조건을 충족하면, 상기 중증 진단 인공지능 모델에 상기 응급 환자 정보를 상기 입력 데이터로 재입력하여상기 중증 진단 인공지능 모델로부터 상기 중증 진단 정보를 상기 출력 데이터로 재출력받는 단계;를 포함하는것을 특징으로 하는대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법."}
{"patent_id": "10-2023-0079363", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "하드웨어인 컴퓨터와 결합되어, 제6항의 방법을 수행할 수 있도록 컴퓨터에서 독출가능한 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0079363", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 응급 환자에 대해 중증 환자인지를 결정하도록 학습된 중증 진단 인공지능 모델을 포함하는 메모리; 및 상기 중증 진단 인공지능 모델에 응급 환자 정보를 입력 데이터로 입력하여 상기 중증 진단 인공지능 모델로부터 상기 응급 환자 정보의 응급 환자에 대해 중증 환자인지가 결정된 결과인 중증 진단 정보를 출력 데이터로 출력받는 프로세서;를 포함할 수 있다."}
{"patent_id": "10-2023-0079363", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치, 방법 및 컴퓨터프로그램에 관한 것으로 서, 더욱 상세하게는 응급 환자에 대해 중증 환자인지를 결정하도록 학습된 중증 진단 인공지능 모델을 이용하 여 응급 환자에 대해 중증 환자인지를 결정할 수 있는 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장 치, 방법 및 컴퓨터프로그램에 관한 것이다."}
{"patent_id": "10-2023-0079363", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "중증도 분류(Triage)란 응급처치와 환자 이송의 우선 순위를 결정하기 위하여 환자를 증상별로 구분하는 것을 말한다. 즉 대량환자 발생시는 한정된 인원으로 많은 환자에게 최선의 의료를 제공하여야 하므로 전문요원이 아 니라고 할지라도 환자의 경, 중을 구분하여 응급처치 및 이송의 우선 순위를 부여하는 것이다. 응급 환자에서 긴급한 응급처치를 요하는 환자는 전체응급환자의 10~15%를 점유하는 것으로 보고되고 있다. 이 러한 환자들을 중증도에 따라서 치료가 가능한 병원으로 빠른 시간내 직접 이송하는 경우에서 환자의 예후가 양 호하다고 보고되고 있다. 이러한 의미에서 중증도 분류는 응급의료의 중요한 분야이지만, 병원이외의 장소에서 근무하는 응급요원이나 중,소병원에서 근무하는 의료인은 응급의료에 대한 임상적 경험이나 학문적 지식이 충분 하지 않으므로, 응급환자의 중증도를 신속하게 평가하지 못하는 경우가 많다. 또한 병원전 상황은 이용할 수 있는 검사기구가 한정되 있고 시행할 수 있는 이학적 검사도 제한이 있다. 이러 한 면에서 사건발생 상황이나 환자가 호소하는 증상 등은 다른 정보에 비해 획득이 용이하면서도 환자파악의 중 요한 근거가 될 수 있다. 이러한 정보를 처음 파악할 때 실질적인 내용으로 이루어진다면 환자의 병원전 중증도 파악에 도움이 될뿐만이 아니라 이후 병원에서 진단이 이루어 질 때도 효과적으로 질환에 접근하는데 도움이 될 수 있다 응급의료체계는 사고 또는 불의의 대량 재해 등으로 응급환자가 발생하였을 때 최대한 빠른 시간 내에 적절한 진료를 행할 수 있도록 환자의 후송 및 진료에 관한 유기적인 조직체계를 정립한 것으로, 일반적으로 병원 전 단계, 후송단계, 병원단계 등의 3단계로 이루어져 있다. 이들 모든 과정은 상호 유기적인 협조 체제 하에서 일 관된 시스템으로 구축되어 사고현장, 이송과정 및 병원 응급실을 적절하게 연결할 수 있어야 한다. 이러한 상황에서 중증도 분류는 제한된 의료 자원을 효율적으로 배분하기 위하여, 의학적으로 치료가 필요한 환 자들의 순위를 정하고 구분하는 기능으로, 이를 수행함으로써 비응급환자는 1,2차 병원으로 긴급환자는 3차 병 원으로 이송되어 응급의료시스템의 효율화와 환자에게도 만족할 만한 치료를 제공할 수 있다. 하지만, 중증도 분류체계를 별도로 숙지할 필요없이 환자상태에 대한 기록만으로 중증도 분류 체계가 이루어 질 수 있는 기술이 요구되고 있다.선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2018-0049470호"}
{"patent_id": "10-2023-0079363", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은, 응급 환자에 대해 중증 환자인지를 결정하도록 학습된 중증 진단 인공지능 모델을 이용하여 응급 환자에 대해 중증 환자인지를 결정할 수 있는 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치, 방법 및 컴퓨터프로그램을 제공함에 있다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2023-0079363", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 응급 환자에 대해 중증 환자인지 를 결정하도록 학습된 중증 진단 인공지능 모델을 포함하는 메모리; 및 상기 중증 진단 인공지능 모델에 응급 환자 정보를 입력 데이터로 입력하여 상기 중증 진단 인공지능 모델로부터 상기 응급 환자 정보의 응급 환자에 대해 중증 환자인지가 결정된 결과인 중증 진단 정보를 출력 데이터로 출력받는 프로세서;를 포함할 수 있다. 상기 프로세서는 의료진에 의해서 응급 환자에 대해 중증 환자인지가 결정된 결과인 의료진 중증 진단 정보를 정답 데이터로 설정하고, 상기 의료진 중증 진단 정보에 대응되는 응급 환자 정보를 문제 데이터로 설정하여 훈 련 데이터를 구성하고, 상기 훈련 데이터를 이용하여 상기 중증 진단 인공지능 모델을 학습시킬 수 있다. 상기 프로세서는 대화형 인공지능 모델을 이용하여 상기 의료진 중증 진단 정보 및 상기 의료진 중증 진단 정보 에 대응되는 응급 환자 정보 각각을 확장시킬 수 있다. 상기 프로세서는 상기 정답 데이터로 설정된 상기 의료진 중증 진단 정보 및 상기 문제 데이터로 설정된 상기 응급 환자 정보의 정보량에 기초하여 상기 중증 진단 인공지능 모델의 학습도를 산출할 수 있다. 상기 프로세서는 상기 응급 환자 정보가 재결정 조건을 충족하는지 여부를 판단하고, 상기 응급 환자 정보가 재 결정 조건을 충족하면, 상기 중증 진단 인공지능 모델에 상기 응급 환자 정보를 상기 입력 데이터로 재입력하여 상기 중증 진단 인공지능 모델로부터 상기 중증 진단 정보를 상기 출력 데이터로 재출력받을 수 있다. 본 발명에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법은 프로세서가 중증 진단 인공지능 모델이 응급 환자에 대해 중증 환자인지를 결정하도록 상기 중증 진단 인공지능 모델을 학습시키는 단계; 상기 프로세서가 상기 중증 진단 인공지능 모델에 응급 환자 정보를 입력 데이터로 입력하여 상기 중증 진단 인공지 능 모델로부터 상기 응급 환자 정보의 응급 환자에 대해 중증 환자인지가 결정된 결과인 중증 진단 정보를 출력 데이터로 출력받는 단계;를 포함할 수 있다. 상기 학습시키는 단계는 상기 프로세서가 의료진에 의해서 응급 환자에 대해 중증 환자인지가 결정된 결과인 의 료진 중증 진단 정보를 정답 데이터로 설정하고, 상기 의료진 중증 진단 정보에 대응되는 응급 환자 정보를 문 제 데이터로 설정하여 훈련 데이터를 구성하는 단계; 및 상기 프로세가 상기 훈련 데이터를 이용하여 상기 중증 진단 인공지능 모델을 학습시키는 단계;를 포함할 수 있다. 본 발명에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법은 상기 프로세서가 대화형 인공지능 모델을 이용하여 상기 의료진 중증 진단 정보 및 상기 의료진 중증 진단 정보에 대응되는 응급 환자 정보 각각 을 확장시키는 단계;를 포함할 수 있다.본 발명에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법은 상기 프로세서가 상기 정답 데이 터로 설정된 상기 의료진 중증 진단 정보 및 상기 문제 데이터로 설정된 상기 응급 환자 정보의 정보량에 기초 하여 상기 중증 진단 인공지능 모델의 학습도를 산출하는 단계;를 포함할 수 있다. 본 발명에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법은 상기 프로세서가 상기 응급 환자 정보가 재결정 조건을 충족하는지 여부를 판단하고, 상기 응급 환자 정보가 재결정 조건을 충족하면, 상기 중증 진단 인공지능 모델에 상기 응급 환자 정보를 상기 입력 데이터로 재입력하여 상기 중증 진단 인공지능 모델로 부터 상기 중증 진단 정보를 상기 출력 데이터로 재출력받는 단계;를 포함할 수 있다. 본 발명에 따른 컴퓨터 프로그램은 상술된 본 발명에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분 류 방법을 수행할 수 있도록 컴퓨터에서 읽기 가능한 기록매체에 저장될 수 있다."}
{"patent_id": "10-2023-0079363", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 응급 환자에 대해 중증 환자인지를 결정하도록 학습된 중증 진단 인공지능 모델을 이용하여 응급 환자에 대해 중증 환자인지를 결정함으로써, 중증 환자인지를 판단하는 의료진의 숙련도에 영향없이 정확 하고 신속하게 응급 환자에 대해 중증 환자인지를 결정할 수 있다."}
{"patent_id": "10-2023-0079363", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대 해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다.어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소) 를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요 소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는 상기 어떤 구성요소 와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도 록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성(또는 설정)된\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것 만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성 (또는 설정)된 제어부\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리에 저 장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서 (generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 특히, 본 명세서에서, “~장치”는 중앙처리장치(Central Processing Unit (CPU)), 애플리케이션 프로세서 (Application Processor (AP)) 및 커뮤니케이션 프로세서(Communication Processor (CP)) 중 하나 이상을 포함 할 수 있다. 본 명세서에서, “~장치”는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로서 이해될 수 있다. 예를 들어, “~장치”는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이 언트 및 애플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 컨텍스트 상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포 함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야 에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어들 중 일반적인 사전에 정의된 용어들은 관련 기술의 컨텍스트 상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 도 1은 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치의 구성도이다. 도 1을 참조하면, 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치 는 응급 환자에 대해 중증 환자인지를 결정하도록 학습된 중증 진단 인공지능 모델(S-AI)을 포함하는 메모 리 및 중증 진단 인공지능 모델(S-AI)에 응급 환자 정보를 입력 데이터로 입력하여 중증 진단 인공지능 모 델(S-AI)로부터 응급 환자 정보의 응급 환자에 대해 중증 환자인지가 결정된 결과인 중증 진단 정보를 출력 데 이터로 출력받는 프로세서를 포함한다. 프로세서는 메모리와 연결되어 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치의 전 반적인 동작을 제어한다. 일 실시예로, 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는, 서버, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 노트북 컴퓨터(notebook computer), PDA(personal digital assistant), PMP(portable multimedia player), 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 한편, 메모리는 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치의 동작에 필요한 각종 프 로그램 및 데이터를 저장할 수 있다. 메모리는 비휘발성 메모리, 휘발성 메모리, 플래시메모리(flash- memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD) 등으로 구현될 수 있다. 프로세서는 메모리에 저장된 각종 프로그램을 이용하여 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치의 전반적인 동작을 제어할 수 있다. 프로세서는 RAM, ROM, 그래픽 처리부, 메인 CPU,제1 내지 n 인터페이스 및 버스로 구성될 수 있다. 이때, RAM, ROM, 그래픽 처리부, 메인 CPU, 제1 내지 n 인터 페이스 등은 버스를 통해 서로 연결될 수 있다. RAM은 O/S 및 어플리케이션 프로그램을 저장한다. 구체적으로, 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치가 부팅되면 O/S가 RAM에 저장되고, 사용자가 선택한 각종 어플리케이션 데이터가 RAM에 저장될 수 있다. ROM에는 시스템 부팅을 위한 명령어 세트 등이 저장된다. 턴 온 명령이 입력되어 전원이 공급되면, 메인 CPU는 ROM에 저장된 명령어에 따라 메모리에 저장된 O/S를 RAM에 복사하고, O/S를 실행시켜 시스템을 부팅시킨다. 부팅이 완료되면, 메인 CPU는 메모리에 저장된 각종 어플리케이션 프로그램을 RAM에 복사하고, RAM에 복사된 어플리케이션 프로그램을 실행시켜 각종 동작을 수행한다. 그래픽 처리부는 연산부(미도시) 및 렌더링부(미도시)를 이용하여 아이템, 이미지, 텍스트 등과 같은 다양한 객 체를 포함하는 화면을 생성한다. 여기서, 연산부는 입력부로부터 수신된 제어 명령을 이용하여 화면의 레이아웃 에 따라 각 객체들이 표시될 좌표값, 형태, 크기, 컬러 등과 같은 속성값을 연산하는 구성일 수 있다. 그리고, 렌더링부는 연산부에서 연산한 속성값에 기초하여 객체를 포함하는 다양한 레이아웃의 화면을 생성하는 구성이 일 수 있다. 이러한 렌더링부에서 생성된 화면은 디스플레이의 디스플레이 영역 내에 표시될 수 있다. 메인 CPU는 메모리에 액세스하여, 메모리에 저장된 OS를 이용하여 부팅을 수행한다. 그리고, 메인 CPU는 메모리에 저장된 각종 프로그램, 컨텐츠, 데이터 등을 이용하여 다양한 동작을 수행한다. 제1 내지 n 인터페이스는 상술한 각종 구성요소들과 연결된다. 제1 내지 n 인터페이스 중 하나는 네트워크를 통 해 외부 장치와 연결되는 네트워크 인터페이스가 될 수도 있다. 한편, 나아가, 프로세서는 인공지능 모델을 제어할 수 있다. 이 경우, 프로세서는 인공지능 모델을 제어하 기 위한 그래픽 전용 프로세서(예: GPU)를 포함할 수 있음은 물론이다. 한편, 본 발명에 따른 인공지능 모델은 지도학습(supervised learning) 또는 비지도학습(unsupervised learning)기반의 모델일 수 있다. 나아가, 본 발명에 따른 인공지능 모델은 SVM(support vector machine), Decision tree, neural network 등 및 이들이 응용된 방법론을 포함할 수 있다. 일 실시예로, 본 발명에 따른 인공지능 모델은 학습데이터를 입력하여 학습된 합성곱 신경망(Convolutional deep Neural Networks, CNN) 기반의 인공지능 모델일 수 있다. 다만, 이에 한정되는 것은 아니며, 다양한 인공 지능 모델이 본 발명에 적용될 수 있음은 물론이다. 예컨대, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network)과 같은 모델이 인공지능 모델로서 사용될 수 있으나, 이에 한정되지 않는다. 이때, 합성곱 신경망(Convolutional deep Neural Networks, CNN)은 최소한의 전처리(preprocess)를 사용하도록 설계된 다계층 퍼셉트론(multilayer perceptrons)의 한 종류이다. 합성곱 신경망은 하나 또는 여러개의 합성곱 계층(convolutional layer)과 그 위에 올려진 일반적인 인공신경망 계층들로 이루어져 있으며, 가중치와 통합 계층(pooling layer)들을 추가로 활용한다. 이러한 구조 덕분에 합성곱 신경망은 2차원 구조의 입력 데이터를 충분히 활용할 수 있다. 또한, 합성곱 신경망은 표준 역전달을 통해 훈련될 수 있다. 합성곱 신경망은 다른 피 드포워드 인공신경망 기법들보다 쉽게 훈련되는 편이고 적은 수의 매개변수를 사용한다는 이점이 있다. 또한, 심층 신경망(Deep Neural Networks, DNN)은 입력 계층(input layer)과 출력 계층(output layer) 사이에 복수개의 은닉 계층(hidden layer)들로 이뤄진 인공신경망(Artificial Neural Network, ANN)이다. 이때, 심층 신경망의 구조는 퍼셉트론(perceptron)으로 구성될 수 있다. 퍼셉트론은 여러 개의 입력 값(input) 과 하나의 프로세서(prosessor), 하나의 출력 값으로 구성된다. 프로세서는 여러 개의 입력 값에 각각 가중치를 곱한 후, 가중치가 곱해진 입력 값들을 모두 합한다. 그 다음 프로세서는 합해진 값을 활성화함수에 대입하여 하나의 출력 값을 출력한다. 만약 활성화함수의 출력 값으로 특정한 값이 나오기를 원하는 경우, 각 입력 값에 곱해지는 가중치를 수정하고, 수정된 가중치를 이용하여 출력 값을 다시 계산할 수 있다. 이때, 각각의 퍼셉트 론은 서로 다른 활성화함수를 사용할 수 있다. 또한 각각의 퍼셉트론은 이전 계층에서 전달된 출력들을 입력으 로 받아들인 다음, 활성화 함수를 이용해서 출력을 구한다. 구해진 출력은 다음 계층의 입력으로 전달된다. 상 술한 바와 같은 과정을 거치면 최종적으로 몇 개의 출력 값을 얻을 수 있다. 순환 신경망(Reccurent Neural Network, RNN)은 인공신경망을 구성하는 유닛 사이의 연결이 Directed cycle을 구성하는 신경망을 말한다. 순환 신경망은 앞먹임 신경망과 달리, 임의의 입력을 처리하기 위해 신경망 내부의메모리를 활용할 수 있다. 심층 신뢰 신경망(Deep Belief Networks, DBN)이란 기계학습에서 사용되는 그래프 생성 모형(generative graphical model)으로, 딥 러닝에서는 잠재변수(latent variable)의 다중계층으로 이루어진 심층 신경망을 의미 한다. 계층 간에는 연결이 있지만 계층 내의 유닛 간에는 연결이 없다는 특징이 있다. 심층 신뢰 신경망은 생성 모형이라는 특성상 선행학습에 사용될 수 있고, 선행학습을 통해 초기 가중치를 학습 한 후 역전파 혹은 다른 판별 알고리즘을 통해 가중치의 미조정을 할 수 있다. 이러한 특성은 훈련용 데이터가 적을 때 굉장히 유용한데, 이는 훈련용 데이터가 적을수록 가중치의 초기값이 결과적인 모델에 끼치는 영향이 세지기 때문이다. 선행학습된 가중치 초기값은 임의로 설정된 가중치 초기값에 비해 최적의 가중치에 가깝게 되 고 이는 미조정 단계의 성능과 속도향상을 가능케 한다. 상술한 인공지능 및 그 학습방법에 관한 내용은 예시를 위하여 서술된 것이며, 상술한 실시 예들에서 이용되는 인공지능 및 그 학습방법은 제한되지 않는다. 예를 들어, 당 업계의 통상의 기술자가 동일한 과제해결을 위하여 적용할 수 있는 모든 종류의 인공지능 기술 및 그 학습방법이 개시된 실시 예에 따른 시스템을 구현하는 데 활 용될 수 있다. 한편, 프로세서는 하나 이상의 코어(core, 미도시) 및 그래픽 처리부(미도시) 및/또는 다른 구성 요소와 신호를 송수신하는 연결 통로(예를 들어, 버스(bus) 등)를 포함할 수 있다. 일 실시예에 따른 프로세서는 메모리에 저장된 하나 이상의 인스트럭션을 실행함으로써, 본 발명과 관련하여 설명된 방법을 수행한다. 예를 들어, 프로세서는 메모리에 저장된 하나 이상의 인스트럭션을 실행함으로써 신규 학습용 데이터 를 획득하고, 학습된 모델을 이용하여, 획득된 신규 학습용 데이터에 대한 테스트를 수행하고, 테스트 결과, 라 벨링된 정보가 소정의 제1 기준값 이상의 정확도로 획득되는 제1 학습용 데이터를 추출하고, 추출된 제1 학습용 데이터를 신규 학습용 데이터로부터 삭제하고, 추출된 학습용 데이터가 삭제된 신규 학습용 데이터를 이용하여 학습된 모델을 다시 학습시킬 수 있다. 한편, 프로세서는 프로세서 내부에서 처리되는 신호(또는, 데이터)를 일시적 및/또는 영구적으로 저 장하는 램(RAM: Random Access Memory, 미도시) 및 롬(ROM: Read-Only Memory, 미도시)을 더 포함할 수 있다. 또한, 프로세서는 그래픽 처리부, 램 및 롬 중 적어도 하나를 포함하는 시스템온칩(SoC: system on chip) 형태로 구현될 수 있다. 메모리에는 프로세서의 처리 및 제어를 위한 프로그램들(하나 이상의 인스트럭션들)을 저장할 수 있 다. 메모리에 저장된 프로그램들은 기능에 따라 복수 개의 모듈들로 구분될 수 있다. 도 2는 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치에 의한 시스템 구성도이다. 도 2를 참조하면, 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치 는 적어도 하나의 단말과 통신하여, 응급 환자의 응급 환자 정보를 획득하는 통신부를 더 포함 할 수 있다. 통신부는 외부 장치와 통신을 수행할 수 있다. 특히, 통신부는 와이파이 칩, 블루투스 칩, 무선 통신 칩, NFC칩, 저전력 블루투스 칩(BLE 칩) 등과 같은 다양한 통신 칩을 포함할 수 있다. 이때, 와이파이 칩, 블루 투스 칩, NFC 칩은 각각 LAN 방식, WiFi 방식, 블루투스 방식, NFC 방식으로 통신을 수행한다. 와이파이 칩이나 블루투스칩을 이용하는 경우에는 SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송수신 하여, 이를 이용하 여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 무선 통신칩은 IEEE, 지그비, 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), 5G(5th Generation) 등과 같은 다양 한 통신 규격에 따라 통신을 수행하는 칩을 의미한다. 한편, 단말은 의료진, 구조진(구급대원) 및 병원 행정과 직원 중 하나 이상이 보유한 전자 장치일 수 있다. 일 실시예로, 단말은, 서버, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기 (mobile phone), 영상 전화기, 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 노트북 컴퓨터(notebook computer), PDA(personal digital assistant), PMP(portable multimedia player), 웨어러블 장치(wearabledevice) 중 적어도 하나를 포함할 수 있다. 도 3은 입출력부를 더 포함하는 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치의 구성도이다. 도 3을 참조하면, 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치 는 사용자 명령을 바탕으로 응급 환자의 응급 환자 정보를 획득하고, 적어도 하나의 정보를 사용자에게 제 공하는 입출력부를 더 포함할 수 있다. 입출력부는 외부장치 연결 포트, 스캔장치, 카메라, 디스플레이, 마우스, 키보드, 리모컨 등을 포함하여, 사용자의 입력을 획득하고, 전자 장치의 정보를 출력하여 사용자에게 가시화된 정보를 제공할 수 있다. 카메라는 적어도 하나의 피사체를 촬영하기 위한 구성으로, 프로세서는 카메라를 통해 적어도 하나의 객체 를 인식하거나 객체와의 거리를 식별할 수 있다. 디스플레이는 다양한 정보를 시각적으로 출력하기 위한 구성이다. 디스플레이는 LCD(Liquid Crystal Display), PDP(Plasma Display Panel), OLED(Organic Light Emitting Diodes), TOLED(Transparent OLED), Micro LED 등으로 구현될 수 있으나, 이에 한정되는 것은 아니고 이밖에 종래 알려진 다양한 형태의 디스플레이를 포함할 수 있다. 디스플레이는, 사용자의 터치 조작을 감지할 수 있는 터치스크린 형태로 구현될 수 있으며, 접히거나 구부러질 수 있는 플렉서블 디스플레이로 구현될 수도 있다. 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 입출력부(14 0)를 통해 의료진, 구조진(구급대원) 및 병원 행정과 직원 중 하나 이상이 직접 입력하는 방식으로 응급 환자 정보를 획득하거나, 통신부를 통해 외부 장치인 단말로부터 응급 환자 정보를 획득할 수 있다. 여기서, 응급 환자는, 응급실에 내원한 환자 및 구조진(구급대원)에 의해 응급실로 이송되거나 이송 중인 환자 중 어느 하나일 수 있다. 응급 환자 정보는, 응급 환자의 개인정보, 신체 정보, 병력 정보, 진료 정보, 및 생체 정보 중 적어도 하나를 포함할 수 있다. 개인정보는 응급 환자의 이름, 응급 환자의 주민번호, 응급 환자의 내원번호, 응급 환자의 성별, 응급 환자의 나이, 응급 환자의 직업, 응급 환자의 흡연력, 및 응급 환자의 음주력 중 적어도 하나를 포함하며, 신체 정보는 응급 환자의 키, 응급 환자의 체중, 응급 환자의 시력, 응급 환자의 청력 등 응급 환자의 신체의 형태 및 기능 에 대한 수치이며, 이때, 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 개인정보 및 신체 정보를 획득하기 위해, 국민건강보험공단에 기 등록된 응급 환자의 건강검진 정 보를 국민건강보험공단으로부터 획득하거나, 의료진이 응급 환자 및 응급 환자 보호자 중 적어도 한 명으로부터 설문을 수행하여 획득하거나, 응급 환자 및 응급 환자 보호자 중 적어도 한 명으로부터 통신부 및 입출력 부 중 적어도 하나를 통해 획득할 수 있다. 병력 정보는 응급 환자의 가족력이 있는 병명, 응급 환자의 입원력, 응급 환자의 수술력, 응급 환자의 발병 전 일상생활 능력 및 응급 환자의 발병 전 신경학적 능력 중 적어도 하나를 포함할 수 있으며, 전자 장치는 병력 정보를 획득하기 위해, 의료진이 응급 환자 및 응급 환자 보호자 중 적어도 한 명으로부터 설문을 수행하 여 획득하거나, 응급 환자 및 응급 환자 보호자 중 적어도 한 명으로부터 통신부 및 입출력부 중 적 어도 하나를 통해 획득할 수 있다. 생체 정보는, 응급 환자의 의식 수준, 시간 당 소변량, 생체징후에 대한 모니터링 값, 혈액 검사 정보, 응급 환 자에게 적용된 적어도 하나의 식이 정보, 및 응급 환자의 대변 정보 중 적어도 하나를 포함하며, 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 의료진의 사용자 명령을 통 신부 및 입출력부 중 적어도 하나를 통해 생체 정보로 획득할 수 있다. 이때, 생체 정보는, 응급 환자의 모니터링 값, 요 검사 정보, 및 혈액 검사 정보 중 적어도 하나에 대한 누적 데이터 또한 포함할 수 있다. 한편, 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 응급 환 자 정보를 음성 형식의 음성 데이터로 획득할 수도 있고, 텍스트 형식의 텍스트 데이터로 획득할 수도 있다. 이때, 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 응급 환 자 정보를 음성 형식의 음성 데이터로 획득하는 경우, 음성-텍스트 변환 알고리즘을 이용하여 텍스트 형식의 텍 스트 데이터로 변환할 수 있다. 도 4는 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치에 의해 중증 진단 인공지능 모델이 학습되는 과정을 설명하기 위한 도면이고, 도 5는 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치가 중증 진단 인공지능 모델을 이용하여 환자를 분류하는 과 정을 설명하기 위한 도면이다. 도 4 및 도 5를 더 참조하면, 프로세서는 복수의 정답 데이터와 복수의 정답 데이터 각각에 대응되는 복수 의 문제 데이터로 구성된 훈련 데이터를 구성하고, 훈련 데이터를 이용하여 중증 진단 인공지능 모델(S-AI)를 학습시킬 수 있다. 구체적으로, 프로세서는 의료진에 의해서 응급 환자에 대해 중증 환자인지가 결정된 결과인 의료진 중증 진단 정보(SD-T)를 정답 데이터로 설정하고, 의료진 중증 진단 정보(SD-T)에 대응되는 응급 환자 정보(EP-T)를 문제 데이터로 설정하여 훈련 데이터를 구성할 수 있다. 이때, 프로세서는 응급 환자가 응급실에 내원한 시점 및 응급 환자가 응급실로 이송되는 시점 중 하나 이 상의 시점에 응급 환자로부터 획득되는 응급 환자 정보(EP-T)를 문제 데이터로 설정할 수 있다. 또한, 프로세서는 응급 환자가 미리 설정된 진료 횟수 이상 진료된 시점에 의료진에 의해서 응급 환자에 대해 중증 환자인지가 결정된 결과를 의료진 중증 진단 정보(SD-T)로 획득하거나, 응급 환자를 미리 설정된 진 료 횟수 이상 진료한 의료진에 의해서 응급 환자에 대해 중증 환자인지가 결정된 결과를 의료진 중증 진단 정보 (SD-T)로 획득하고, 이러하게 획득된 의료진 중증 진단 정보(SD-T)를 정답 데이터로 설정할 수 있다. 즉, 프로세서는 응급이 발생된 응급 시점 이후에 수차례 진료가 진행된 후 의료진에 의해서 응급 시점 당 시 응급 환자였던 환자에 대해 중증 환자인지가 결정된 결과를 의료진 중증 진단 정보(SD-T)로 획득할 수 있다. 한편, 다른 실시 예에 따른 프로세서는 대화형 인공지능 서비스를 이용하여 응급 환자 정보(EP-T) 및 의료 진 중증 진단 정보(SD-T) 각각을 확장시킬 수 있다. 구체적으로, 다른 실시 예에 따른 프로세서는 대화형 인공지능 서비스를 이용하여 응급 환자 정보(EP-T)에 포함된 약어 및 의료전문용어의 의미 정보와 유사 용어를 획득하고, 획득된 의미 정보와 유사 용어를 해당 응급 환자 정보(EP-T)에 다시 포함시켜 응급 환자 정보(EP-T)를 확장시킬 수 있다. 이를 위해, 다른 실시 예에 따른 프로세서는 응급 환자 정보(EP-T)에 포함된 약어 및 의료전문용어를 추출 하고, 추출된 약어 및 의료전문용어를 각각의 의미와 유사 용어를 문의하는 문의 문구를 생성하고, 생성된 문의 문구를 대화형 인공지능 서비스에 입력시키며, 입력에 대응하여 대화형 인공지능 서비스로부터 응급 환자 정보 (EP-T)에 포함된 약어 및 의료전문용어 각각의 의미 정보와 유사 용어를 획득할 수 있다. 또한, 다른 실시 예에 따른 프로세서는 대화형 인공지능 서비스를 이용하여 의료진 중증 진단 정보(SD- T)에 포함된 약어 및 의료전문용어의 의미 정보와 유사 용어를 획득하고, 획득된 의미 정보와 유사 용어를 해당 의료진 중증 진단 정보(SD-T)에 다시 포함시켜 의료진 중증 진단 정보(SD-T)를 확장시킬 수 있다. 이를 위해, 다른 실시 예에 따른 프로세서는 의료진 중증 진단 정보(SD-T)에 포함된 약어 및 의료전문용어 를 추출하고, 추출된 약어 및 의료전문용어를 각각의 의미와 유사 용어를 문의하는 문의 문구를 생성하고, 생성 된 문의 문구를 대화형 인공지능 서비스에 입력시키며, 입력에 대응하여 대화형 인공지능 서비스로부터 의료진 중증 진단 정보(SD-T)에 포함된 약어 및 의료전문용어 각각의 의미 정보와 유사 용어를 획득할 수 있다. 여기서, 대화형 인공지능 서비스는 Chat-GPT일 수 있으나, 대화형식으로 문답을 수행하는 인공지능 서비스이라 면 그 종류는 제한되지 않을 수 있다. 한편, 다른 실시 예에 따른 프로세서는 정답 데이터로 설정된 의료진 중증 진단 정보(SD-T) 및 문제 데이 터로 설정된 응급 환자 정보(EP-T)의 정보량에 기초하여 중증 진단 인공지능 모델(S-AI)의 학습도를 산출할 수 있다.구체적으로, 다른 실시 예에 따른 프로세서는 의료진 중증 진단 정보(SD-T) 및 응급 환자 정보(EP-T) 각각 에 대응되는 응급 환자의 수를 상술된 정보량으로 계산하고, 정보량을 클수록 중증 진단 인공지능 모델(S-AI)의 학습정도가 높음을 나타내도록 학습도를 산출할 수 있다. 이후, 프로세서는 문제 데이터로 응급 환자 정보(EP-T)가 설정되고 정답 데이터로 설정된 응급 환자 정보 (EP-T)에 대응되는 의료진 중증 진단 정보(SD-T)가 정답 데이터로 설정되어 구성된 훈련 데이터를 이용하여, 중 증 진단 인공지능 모델(S-AI)에 의료진에 의해 중증 환자인지가 결정되지 않은 응급 환자의 응급 환자 정보(E P)가 입력 데이터로 입력되면, 의료진에 의해 중증 환자인지가 결정되지 않은 응급 환자에 대해 중증 환자인지 를 중증 진단 인공지능 모델(S-AI)이 결정할 수 있도록, 중증 진단 인공지능 모델(S-AI)을 학습시킬 수 있다. 한편, 프로세서는 의료진에 의해 중증 환자인지가 결정되지 않은 응급 환자의 응급 환자 정보(EP)가 획득 되면, 중증 진단 인공지능 모델(S-AI)에 응급 환자 정보(EP)를 입력 데이터로 입력하여 중증 진단 인공지능 모 델(S-AI)로부터 응급 환자 정보(EP)의 응급 환자에 대해 중증 환자인지가 결정된 결과인 중증 진단 정보(SD)를 출력 데이터로 출력받을 수 있다. 한편, 다른 실시 예에 따른 프로세서는 응급 환자 정보(EP)가 재결정 조건을 충족하는지 여부를 판단할 수 있다. 구체적으로, 다른 실시 예에 따른 프로세서는 응급 환자 정보(EP)에 포함된 약어 및 의료전문용어의 제1 개수를 산출하고, 응급 환자 정보(EP)에 포함된 약어 및 의료전문용어 중에서 중증 진단 인공지능 모델(S-AI)의 훈련 데이터를 구성하는 문제 데이터의 응급 환자 정보(EP-T)에 포함되지 않은 제2 개수를 산출하며, 제1 개수 대비 제2 개수의 비율을 불포함 비율로 산출하고, 불포함 비율이 기준 비율을 초과하는 경우, 응급 환자 정보 (EP)가 재결정 조건을 충족하는지 여부를 판단할 수 있다. 이후, 다른 실시 예에 따른 프로세서는 응급 환자 정보(EP)가 재결정 조건을 충족하면, 대화형 인공지능 서비스를 이용하여 응급 환자 정보(EP)에 포함된 약어 및 의료전문용어의 의미 정보와 유사 용어를 획득하고, 획득된 의미 정보와 유사 용어를 해당 응급 환자 정보(EP)에 다시 포함시켜 응급 환자 정보(EP)를 확장시킬 수 있다. 이어서, 다른 실시 예에 따른 프로세서는 중증 진단 인공지능 모델(S-AI)에 확장된 응급 환자 정보(EP)를 입력 데이터로 재입력하여 중증 진단 인공지능 모델(S-AI)로부터 중증 진단 정보(SD)를 출력 데이터로 재출력받 을 수 있다. 이후, 프로세서는 중증 진단 인공지능 모델(S-AI)로부터 출력 데이터로 출력받은 중증 진단 정보(SD)를 입 출력부를 통해 표시하여 의료진 및 구조진(구급대원) 중 하나 이상에게 제공할 수 있다. 또한, 프로세서는 중증 진단 인공지능 모델(S-AI)로부터 출력 데이터로 출력받은 중증 진단 정보(SD)를 통 신부 통해 외부 장치로 송신할 수 있다. 이하, 본 발명의 다른 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치에 대해 설명하도록 한다. 본 발명의 다른 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 초진 환자에 대해 수행되어야 하는 검사 및 초진 환자에 대해 처방되어야 하는 약물 중 하나 이상을 결정하도록 학습된 초진 진단 인공지능 모델을 포함하는 메모리 및 초진 진단 인공지능 모델에 초진 환자 정보를 입력 데이터로 입 력하여 초진 진단 인공지능 모델로부터 초진 환자 정보의 초진 환자에 대해 수행되어야 하는 검사 및 초진 환자 에 대해 처방되어야 하는 약물 중 하나 이상이 결정된 결과인 초진 진단 정보를 출력 데이터로 출력받는 프로세 서를 포함한다. 본 발명의 다른 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 적어도 하나 의 단말과 통신하여, 초진 환자의 초진 환자 정보를 획득하는 통신부를 더 포함할 수 있다. 본 발명의 다른 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 사용자 명령 을 바탕으로 초진 환자의 초진 환자 정보를 획득하고, 적어도 하나의 정보를 사용자에게 제공하는 입출력부 를 더 포함할 수 있다. 본 발명의 다른 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 입출력부 를 통해 의료진, 구조진(구급대원) 및 병원 행정과 직원 중 하나 이상이 직접 입력하는 방식으로 초진 환 자 정보를 획득하거나, 통신부를 통해 외부 장치인 단말로부터 초진 환자 정보를 획득할 수 있다. 여기서, 초진 환자는, 해당 의료진에게 처음으로 진료를 받는 환자일 수 있다. 초진 환자 정보는, 초진 환자의 개인정보, 신체 정보, 병력 정보, 진료 정보, 및 생체 정보 중 적어도 하나를 포함할 수 있다. 개인정보는 초진 환자의 이름, 초진 환자의 주민번호, 초진 환자의 내원번호, 초진 환자의 성별, 초진 환자의 나이, 초진 환자의 직업, 초진 환자의 흡연력, 및 초진 환자의 음주력 중 적어도 하나를 포함하며, 신체 정보는 초진 환자의 키, 초진 환자의 체중, 초진 환자의 시력, 초진 환자의 청력 등 초진 환자의 신체의 형태 및 기능 에 대한 수치이며, 이때, 본 발명의 다른 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 개인정보 및 신체 정보를 획득하기 위해, 국민건강보험공단에 기 등록된 초진 환자의 건강검진 정 보를 국민건강보험공단으로부터 획득하거나, 의료진이 초진 환자 및 초진 환자 보호자 중 적어도 한 명으로부터 설문을 수행하여 획득하거나, 초진 환자 및 초진 환자 보호자 중 적어도 한 명으로부터 통신부 및 입출력 부 중 적어도 하나를 통해 획득할 수 있다. 병력 정보는 초진 환자의 가족력이 있는 병명, 초진 환자의 입원력, 초진 환자의 수술력, 초진 환자의 발병 전 일상생활 능력 및 초진 환자의 발병 전 신경학적 능력 중 적어도 하나를 포함할 수 있으며, 전자 장치는 병력 정보를 획득하기 위해, 의료진이 초진 환자 및 초진 환자 보호자 중 적어도 한 명으로부터 설문을 수행하 여 획득하거나, 초진 환자 및 초진 환자 보호자 중 적어도 한 명으로부터 통신부 및 입출력부 중 적 어도 하나를 통해 획득할 수 있다. 생체 정보는, 초진 환자의 의식 수준, 시간 당 소변량, 생체징후에 대한 모니터링 값, 혈액 검사 정보, 초진 환 자에게 적용된 적어도 하나의 식이 정보, 및 초진 환자의 대변 정보 중 적어도 하나를 포함하며, 본 발명의 다 른 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치는 의료진의 사용자 명령을 통신부 및 입출력부 중 적어도 하나를 통해 생체 정보로 획득할 수 있다. 이때, 생체 정보는, 초진 환자의 모니터링 값, 요 검사 정보, 및 혈액 검사 정보 중 적어도 하나에 대한 누적 데이터 또한 포함할 수 있다. 프로세서는 복수의 정답 데이터와 복수의 정답 데이터 각각에 대응되는 복수의 문제 데이터로 구성된 훈련 데이터를 구성하고, 훈련 데이터를 이용하여 초진 진단 인공지능 모델를 학습시킬 수 있다. 구체적으로, 프로세서는 의료진에 의해서 초진 환자에 대해 수행되어야 하는 검사 및 초진 환자에 대해 처 방되어야 하는 약물 중 하나 이상이 결정된 결과인 의료진 초진 진단 정보를 정답 데이터로 설정하고, 의료진 초진 진단 정보에 대응되는 초진 환자 정보를 문제 데이터로 설정하여 훈련 데이터를 구성할 수 있다. 한편, 다른 실시 예에 따른 프로세서는 대화형 인공지능 서비스를 이용하여 초진 환자 정보 및 의료진 초 진 진단 정보 각각을 확장시킬 수 있다. 구체적으로, 다른 실시 예에 따른 프로세서는 대화형 인공지능 서비스를 이용하여 초진 환자 정보에 포함 된 약어 및 의료전문용어의 의미 정보와 유사 용어를 획득하고, 획득된 의미 정보와 유사 용어를 해당 초진 환 자 정보에 다시 포함시켜 초진 환자 정보를 확장시킬 수 있다. 이를 위해, 다른 실시 예에 따른 프로세서는 초진 환자 정보에 포함된 약어 및 의료전문용어를 추출하고, 추출된 약어 및 의료전문용어를 각각의 의미와 유사 용어를 문의하는 문의 문구를 생성하고, 생성된 문의 문구 를 대화형 인공지능 서비스에 입력시키며, 입력에 대응하여 대화형 인공지능 서비스로부터 초진 환자 정보에 포 함된 약어 및 의료전문용어 각각의 의미 정보와 유사 용어를 획득할 수 있다. 또한, 다른 실시 예에 따른 프로세서는 대화형 인공지능 서비스를 이용하여 의료진 초진 진단 정보에 포함 된 약어 및 의료전문용어의 의미 정보와 유사 용어를 획득하고, 획득된 의미 정보와 유사 용어를 해당 의료진 초진 진단 정보에 다시 포함시켜 의료진 초진 진단 정보를 확장시킬 수 있다. 이를 위해, 다른 실시 예에 따른 프로세서는 의료진 초진 진단 정보에 포함된 약어 및 의료전문용어를 추 출하고, 추출된 약어 및 의료전문용어를 각각의 의미와 유사 용어를 문의하는 문의 문구를 생성하고, 생성된 문 의 문구를 대화형 인공지능 서비스에 입력시키며, 입력에 대응하여 대화형 인공지능 서비스로부터 의료진 초진 진단 정보에 포함된 약어 및 의료전문용어 각각의 의미 정보와 유사 용어를 획득할 수 있다.여기서, 대화형 인공지능 서비스는 Chat-GPT일 수 있으나, 대화형식으로 문답을 수행하는 인공지능 서비스이라 면 그 종류는 제한되지 않을 수 있다. 한편, 다른 실시 예에 따른 프로세서는 정답 데이터로 설정된 의료진 초진 진단 정보 및 문제 데이터로 설 정된 초진 환자 정보의 정보량에 기초하여 초진 진단 인공지능 모델의 학습도를 산출할 수 있다. 구체적으로, 다른 실시 예에 따른 프로세서는 의료진 초진 진단 정보 및 초진 환자 정보 각각에 대응되는 응급 환자의 수를 상술된 정보량으로 계산하고, 정보량을 클수록 초진 진단 인공지능 모델의 학습정도가 높음을 나타내도록 학습도를 산출할 수 있다. 이후, 프로세서는 문제 데이터로 초진 환자 정보가 설정되고 정답 데이터로 설정된 초진 환자 정보에 대응 되는 의료진 초진 진단 정보가 정답 데이터로 설정되어 구성된 훈련 데이터를 이용하여, 초진 진단 인공지능 모 델에 의료진에 의해 수행되어야 하는 검사 및 처방되어야 하는 약물이 결정되지 않은 초진 환자의 초진 환자 정 보가 입력 데이터로 입력되면, 의료진에 의해 수행되어야 하는 검사 및 처방되어야 하는 약물이 결정되지 않은 초진 환자에 대해 수행되어야 하는 검사 및 초진 환자에 대해 처방되어야 하는 약물 중 하나 이상을 초진 진단 인공지능 모델이 결정할 수 있도록, 초진 진단 인공지능 모델을 학습시킬 수 있다. 한편, 프로세서는 의료진에 의해 수행되어야 하는 검사 및 처방되어야 하는 약물이 결정되지 않은 초진 환 자의 초진 환자 정보가 획득되면, 초진 진단 인공지능 모델에 초진 환자 정보를 입력 데이터로 입력하여 초진 진단 인공지능 모델로부터 초진 환자 정보의 초진 환자에 대해 수행되어야 하는 검사 및 초진 환자에 대해 처방 되어야 하는 약물 중 하나 이상이 결정된 결과인 초진 진단 정보를 출력 데이터로 출력받을 수 있다. 한편, 다른 실시 예에 따른 프로세서는 초진 환자 정보가 재결정 조건을 충족하는지 여부를 판단할 수 있 다. 구체적으로, 다른 실시 예에 따른 프로세서는 초진 환자 정보에 포함된 약어 및 의료전문용어의 제1 개수 를 산출하고, 초진 환자 정보에 포함된 약어 및 의료전문용어 중에서 초진 진단 인공지능 모델의 훈련 데이터를 구성하는 문제 데이터의 초진 환자 정보에 포함되지 않은 제2 개수를 산출하며, 제1 개수 대비 제2 개수의 비율 을 불포함 비율로 산출하고, 불포함 비율이 기준 비율을 초과하는 경우, 초진 환자 정보가 재결정 조건을 충족 하는지 여부를 판단할 수 있다. 이후, 다른 실시 예에 따른 프로세서는 초진 환자 정보가 재결정 조건을 충족하면, 대화형 인공지능 서비 스를 이용하여 초진 환자 정보에 포함된 약어 및 의료전문용어의 의미 정보와 유사 용어를 획득하고, 획득된 의 미 정보와 유사 용어를 해당 초진 환자 정보에 다시 포함시켜 초진 환자 정보를 확장시킬 수 있다. 이어서, 다른 실시 예에 따른 프로세서는 초진 진단 인공지능 모델에 확장된 초진 환자 정보를 입력 데이 터로 재입력하여 초진 진단 인공지능 모델로부터 초진 진단 정보를 출력 데이터로 재출력받을 수 있다. 이후, 프로세서는 초진 진단 인공지능 모델로부터 출력 데이터로 출력받은 초진 진단 정보를 입출력부 를 통해 표시하여 의료진에게 제공할 수 있다. 또한, 프로세서는 초진 진단 인공지능 모델로부터 출력 데이터로 출력받은 초진 진단 정보를 통신부 통해 외부 장치로 송신할 수 있다. 이하, 본 발명의 또 다른 실시 예에 따른 음성 텍스트 입력 데이터를 이용한 환자 분류 장치에 대해 설명 하도록 한다. 본 발명의 또 다른 실시 예에 따른 음성 텍스트 입력 데이터를 이용한 환자 분류 장치는 응급 환자에 대해 응급환자 분류체계에 따른 진료우선도를 결정하도록 학습된 진료우선도 결정 인공지능 모델을 포함하는 메모리 및 진료우선도 결정 인공지능 모델에 응급 환자 정보를 입력 데이터로 입력하여 진료우선도 결정 인공지 능 모델로부터 응급 환자 정보의 응급 환자에 대해 응급환자 분류체계에 따른 진료우선도가 결정된 결과인 진료 우선도 결정 정보를 출력 데이터로 출력받는 프로세서를 포함한다. 프로세서는 복수의 정답 데이터와 복수의 정답 데이터 각각에 대응되는 복수의 문제 데이터로 구성된 훈련 데이터를 구성하고, 훈련 데이터를 이용하여 진료우선도 결정 인공지능 모델를 학습시킬 수 있다. 구체적으로, 프로세서는 의료진에 의해서 응급 환자에 대해 응급환자 분류체계에 따른 진료우선도가 결정 된 결과인 의료진 진료우선도 결정 정보를 정답 데이터로 설정하고, 의료진 진료우선도 결정 정보에 대응되는 응급 환자 정보를 문제 데이터로 설정하여 훈련 데이터를 구성할 수 있다. 이때, 프로세서는 응급 환자가 응급실에 내원한 시점 및 응급 환자가 응급실로 이송되는 시점 중 하나 이 상의 시점에 응급 환자로부터 획득되는 응급 환자 정보를 문제 데이터로 설정할 수 있다. 또한, 프로세서는 응급 환자가 응급실에서 퇴원하거나 응급실에서 일반 병실로 이동하는 시점에 의료진에 의해서 응급 환자에 대해 응급환자 분류체계에 따른 진료우선도가 결정된 결과를 의료진 진료우선도 결정 정보 로 획득하고, 이러하게 획득된 의료진 진료우선도 결정 정보를 정답 데이터로 설정할 수 있다. 여기서, 의료진 진료우선도 결정 정보는 한국형 응급환자 분류도구(Korean Triage and Acuity Scale; KTAS)에 기반하여 의료진에 의해서 응급 환자에 대해 결정된 진료우선도일 수 있다. 이에 따라, 의료진 진료우선도 결정 정보가 KTAS에 기반한 진료우선도를 나타내는 경우, 프로세서는 제1 단계 내지 제5 단계 중 어느 하나로 진료 우선도가 결정된 의료진 진료우선도 결정 정보를 획득할 수 있다. 이때, 의료진 진료우선도 결정 정보가 KTAS에 따른 제1 단계일수록 해당 응급 환자가 중증이어서 진료우선도가 우선되어야 함을 의미할 수 있다. 하지만, 의료진 진료우선도 결정 정보는 한국형 응급환자 분류도구 외에 응급 환자의 진료우선도를 분류하는 다 양한 분류체계에 기반하여 의료진에 의해서 응급 환자에 대해 결정된 진료우선도일 수도 있다. 한편, 다른 실시 예에 따른 프로세서는 대화형 인공지능 서비스를 이용하여 응급 환자 정보 및 의료진 진 료우선도 결정 정보 각각을 확장시킬 수 있다. 구체적으로, 다른 실시 예에 따른 프로세서는 대화형 인공지능 서비스를 이용하여 응급 환자 정보에 포함 된 약어 및 의료전문용어의 의미 정보와 유사 용어를 획득하고, 획득된 의미 정보와 유사 용어를 해당 응급 환 자 정보에 다시 포함시켜 응급 환자 정보를 확장시킬 수 있다. 이를 위해, 다른 실시 예에 따른 프로세서는 응급 환자 정보에 포함된 약어 및 의료전문용어를 추출하고, 추출된 약어 및 의료전문용어를 각각의 의미와 유사 용어를 문의하는 문의 문구를 생성하고, 생성된 문의 문구 를 대화형 인공지능 서비스에 입력시키며, 입력에 대응하여 대화형 인공지능 서비스로부터 응급 환자 정보에 포 함된 약어 및 의료전문용어 각각의 의미 정보와 유사 용어를 획득할 수 있다. 또한, 다른 실시 예에 따른 프로세서는 대화형 인공지능 서비스를 이용하여 의료진 진료우선도 결정 정보 에 포함된 약어 및 의료전문용어의 의미 정보와 유사 용어를 획득하고, 획득된 의미 정보와 유사 용어를 해당 의료진 진료우선도 결정 정보에 다시 포함시켜 의료진 진료우선도 결정 정보를 확장시킬 수 있다. 이를 위해, 다른 실시 예에 따른 프로세서는 의료진 진료우선도 결정 정보에 포함된 약어 및 의료전문용어 를 추출하고, 추출된 약어 및 의료전문용어를 각각의 의미와 유사 용어를 문의하는 문의 문구를 생성하고, 생성 된 문의 문구를 대화형 인공지능 서비스에 입력시키며, 입력에 대응하여 대화형 인공지능 서비스로부터 의료진 진료우선도 결정 정보에 포함된 약어 및 의료전문용어 각각의 의미 정보와 유사 용어를 획득할 수 있다. 여기서, 대화형 인공지능 서비스는 Chat-GPT일 수 있으나, 대화형식으로 문답을 수행하는 인공지능 서비스이라 면 그 종류는 제한되지 않을 수 있다. 한편, 다른 실시 예에 따른 프로세서는 정답 데이터로 설정된 의료진 진료우선도 결정 정보 및 문제 데이 터로 설정된 응급 환자 정보의 정보량에 기초하여 진료우선도 결정 인공지능 모델의 학습도를 산출할 수 있다. 구체적으로, 다른 실시 예에 따른 프로세서는 의료진 진료우선도 결정 정보 및 응급 환자 정보 각각에 대 응되는 응급 환자의 수를 상술된 정보량으로 계산하고, 정보량을 클수록 진료우선도 결정 인공지능 모델의 학습 정도가 높음을 나타내도록 학습도를 산출할 수 있다. 이후, 프로세서는 문제 데이터로 응급 환자 정보가 설정되고 정답 데이터로 설정된 응급 환자 정보에 대응 되는 의료진 진료우선도 결정 정보가 정답 데이터로 설정되어 구성된 훈련 데이터를 이용하여, 진료우선도 결정 인공지능 모델에 의료진에 의해 응급환자 분류체계에 따른 진료우선도가 결정되지 않은 응급 환자의 응급 환자 정보가 입력 데이터로 입력되면, 의료진에 의해 응급환자 분류체계에 따른 진료우선도가 결정되지 않은 응급 환 자에 대해 응급환자 분류체계에 따른 진료우선도를 진료우선도 결정 인공지능 모델이 결정할 수 있도록, 진료우 선도 결정 인공지능 모델을 학습시킬 수 있다. 한편, 프로세서는 의료진에 의해 응급환자 분류체계에 따른 진료우선도가 결정되지 않은 응급 환자의 응급 환자 정보가 획득되면, 진료우선도 결정 인공지능 모델에 응급 환자 정보를 입력 데이터로 입력하여 진료우선도 결정 인공지능 모델로부터 응급 환자 정보의 응급 환자에 대해 응급환자 분류체계에 따른 진료우선도가 결정된 결과인 진료우선도 결정 정보를 출력 데이터로 출력받을 수 있다. 한편, 다른 실시 예에 따른 프로세서는 응급 환자 정보가 재결정 조건을 충족하는지 여부를 판단할 수 있 다. 구체적으로, 다른 실시 예에 따른 프로세서는 응급 환자 정보에 포함된 약어 및 의료전문용어의 제1 개수 를 산출하고, 응급 환자 정보에 포함된 약어 및 의료전문용어 중에서 진료우선도 결정 인공지능 모델의 훈련 데 이터를 구성하는 문제 데이터의 응급 환자 정보에 포함되지 않은 제2 개수를 산출하며, 제1 개수 대비 제2 개수 의 비율을 불포함 비율로 산출하고, 불포함 비율이 기준 비율을 초과하는 경우, 응급 환자 정보가 재결정 조건 을 충족하는지 여부를 판단할 수 있다. 이후, 다른 실시 예에 따른 프로세서는 응급 환자 정보가 재결정 조건을 충족하면, 대화형 인공지능 서비 스를 이용하여 응급 환자 정보에 포함된 약어 및 의료전문용어의 의미 정보와 유사 용어를 획득하고, 획득된 의 미 정보와 유사 용어를 해당 응급 환자 정보에 다시 포함시켜 응급 환자 정보를 확장시킬 수 있다. 이어서, 다른 실시 예에 따른 프로세서는 진료우선도 결정 인공지능 모델에 확장된 응급 환자 정보를 입력 데이터로 재입력하여 진료우선도 결정 인공지능 모델로부터 진료우선도 결정 정보를 출력 데이터로 재출력받을 수 있다. 이후, 프로세서는 진료우선도 결정 인공지능 모델로부터 출력 데이터로 출력받은 진료우선도 결정 정보를 입출력부를 통해 표시하여 의료진 및 구조진(구급대원) 중 하나 이상에게 제공할 수 있다. 또한, 프로세서는 진료우선도 결정 인공지능 모델로부터 출력 데이터로 출력받은 진료우선도 결정 정보를 통신부 통해 외부 장치로 송신할 수 있다. 한편, 다른 실시 예에 따른 프로세서는 진료우선도 결정 인공지능 모델로부터 진료우선도 결정 정보를 출 력받을 때 마다, 출력된 진료우선도 결정 정보에 기초하여 응급환자 분류 수수료를 산출할 수 있다. 구체적으로, 다른 실시 예에 따른 프로세서는 출력된 진료우선도 결정 정보가 해당 응급 환자의 진료우선 도가 우선되어야 함을 나타낼수록 해당 진료우선도 결정 정보에 대응되는 응급환자 분류 수수료가 높도록 응급 환자 분류 수수료를 산출할 수 있다. 즉, 다른 실시 예에 따른 프로세서는 진료우선도가 높게(우선되게) 결정되는 과정일수록 의료진이 확인해 야 하는 사항과 과정이 많아짐을 고려하여, 진료우선도가 높은(우선되는) 진료우선도 결정 정보가 출력될수록 응급환자 분류 수수료가 높도록 응급환자 분류 수수료를 산출할 수 있다. 도 6은 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법의 순서도이다. 도 6을 참조하면, S1 단계에서, 프로세서가 응급 환자에 대해 중증 환자인지를 결정하도록 중증 진단 인공지능 모델을 학습시킬 수 있다. 이후, S2 단계에서, 통신부 또는 입출력부가 응급 환자의 응급 환자 정보를 획득할 수 있다. 이어서, S3 단계에서, 프로세서가 응급 환자 정보를 중증 진단 인공지능 모델의 입력 데이터로 입력할 수 있다. 이를 통해, S4 단계에서, 프로세서가 중증 진단 인공지능 모델로부터 응급 환자 정보의 응급 환자에 대해 중증 환자인지가 결정된 결과인 중증 진단 정보를 출력 데이터로 출력 받을 수 있다. 최종적으로, S5 단계에서, 프로세서가 중증 진단 정보를 외부로 출력할 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에상주할 수도 있다. 또한, 본 발명의 서로 다른 실시예들은 상호 보완되거나 결합될 수 있다. 본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조 합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler), 파이썬(Python) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되 는 알고리즘으로 구현될 수 있다."}
{"patent_id": "10-2023-0079363", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0079363", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치의 구성도이다. 도 2는 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치에 의한 시스템 구성도이다. 도 3은 입출력부를 더 포함하는 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치의 구성도이다. 도 4는 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치에 의해 중증 진단 인공지능 모델이 학습되는 과정을 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 장치가 중증 진단 인공지능 모델을 이용하여 환자를 분류하는 과정을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시 예에 따른 대화형 인공지능 서비스를 이용한 인공지능 환자 분류 방법의 순서도이다."}
