{"patent_id": "10-2023-0063434", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0165819", "출원번호": "10-2023-0063434", "발명의 명칭": "페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템 및 그 시스템의 구동방법", "출원인": "(주)한양솔라에너지", "발명자": "이동근"}}
{"patent_id": "10-2023-0063434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "페로브스카이트 태양전지의 박막 공정에 관련되는 박막 공정 데이터를 서로 다른 방식으로 분석하기 위한 복수의 인공지능 모델(model)을 저장하는 저장부; 및상기 복수의 인공지능 모델 중 사용자 단말장치에서 선택되는 인공지능 모델을 적용하여 상기 사용자 단말장치에서 제공하는 박막 공정 데이터를 분석하며, 상기 분석에 따른 데이터 분석 결과를 상기 사용자 단말장치로 제공하는 제어부;를 포함하는, 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템."}
{"patent_id": "10-2023-0063434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 다중회귀모델, 의사결정트리, 랜덤 포레스트, 릿지 회귀 모델, 라쏘 회귀모델, 엘라스틱넷모델, SVM(Support Vector Machine), SVM Linear, SVM radial, SVM Sigmoid 중 기설정되는 복수의 인공지능 모델을 사용하는, 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템."}
{"patent_id": "10-2023-0063434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어부는, 상기 데이터 분석 결과로서 MSE(Mean Square Error), MAE(Mean Absolute Error), RMSE(RootMean Square Error), R-Square(R2), Adjusted R-Square(AdjR2)의 평가지표별 분석값을 포함하여 제공하는, 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템."}
{"patent_id": "10-2023-0063434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는, 상기 사용자 단말장치에서 상기 박막 공정 데이터의 분석을 위한 인공지능 모델을 선택할 때 상기 선택한 인공지능 모델과 관련한 상세 설명 및 결과 산출물의 예시를 화면상에 제공하며, 상기 화면상에서 데이터 분석을 위한 요청이 있을 때 데이터 분석 동작을 수행하는, 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템."}
{"patent_id": "10-2023-0063434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는, 상기 데이터 분석을 위한 요청이 있을 때 상기 박막 공정 데이터가 기록된 지정 포맷의 파일을상기 사용자 단말장치에서 첨부하도록 서비스 화면상에서 요청하는, 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템."}
{"patent_id": "10-2023-0063434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "저장부가, 페로브스카이트 태양전지와 관련한 박막 공정 데이터를 서로 다른 방식으로 분석하기 위한 복수의 인공지능 모델을 저장하는 단계; 및제어부가, 상기 복수의 인공지능 모델 중 사용자 단말장치에서 선택되는 인공지능 모델을 적용하여 상기 사용자단말장치에서 제공하는 박막 공정 데이터를 분석하며, 상기 분석에 따른 데이터 분석 결과를 상기 사용자 단말장치로 제공하는 단계;를포함하는, 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템의 구동방법.공개특허 10-2024-0165819-3-청구항 7 제6항에 있어서,상기 분석하는 단계는,다중회귀모델, 의사결정트리, 랜덤 포레스트, 릿지 회귀 모델, 라쏘 회귀모델, 엘라스틱넷 모델, SVM, SVMLinear, SVM radial, SVM Sigmoid 중 기설정되는 복수의 인공지능 모델을 사용하는, 페로브스카이트 태양전지를위한 산업 인공지능모델 시스템의 구동방법."}
{"patent_id": "10-2023-0063434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 분석하는 단계는,상기 데이터 분석 결과로서 MSE, MAE, RMSE, R-Square, Adjusted R-Square의 평가지표별 분석값을 포함하여 제공하는, 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템의 구동방법."}
{"patent_id": "10-2023-0063434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 제공하는 단계는,상기 사용자 단말장치에서 상기 박막 공정 데이터의 분석을 위한 인공지능 모델을 선택할 때 상기 선택한 인공지능 모델과 관련한 상세 설명 및 결과 산출물의 예시를 화면상에 제공하는 단계; 및상기 화면상에서 데이터 분석을 위한 요청이 있을 때 데이터 분석 동작을 수행하는 단계;를포함하는, 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템의 구동방법."}
{"patent_id": "10-2023-0063434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 데이터 분석 동작을 수행하는 단계는,상기 데이터 분석을 위한 요청이 있을 때 상기 박막 공정 데이터가 기록된 지정 포맷의 파일을 상기 사용자 단말장치에서 첨부하도록 서비스 화면상에서 요청하는 단계를 포함하는, 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템의 구동방법."}
{"patent_id": "10-2023-0063434", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템 및 그 시스템의 구동방법에 관한 것으로서, 본 발명의 실시예에 따른 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템는, 페로브스카이 트 태양전지의 박막 공정에 관련되는 박막 공정 데이터를 서로 다른 방식으로 분석하기 위한 복수의 인공지능 모 델을 저장하는 저장부, 및 복수의 인공지능 모델 중 사용자 단말장치에서 선택되는 인공지능 모델을 적용하여 사 용자 단말장치에서 제공하는 박막 공정 데이터를 분석하며, 분석에 따른 데이터 분석 결과를 사용자 단말장치로 제공하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2023-0063434", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템 및 그 시스템의 구동방법에 관한 것으로 서, 더 상세하게는 가령 차세대 페로브스카이트 태양전지의 상용화에 가장 어려움을 겪고 있는 슬롯 다이(Slot- die) 박막 공정에서 광흡수층 코팅 공정에 영향을 미치는 무수히 많은 다양하고 복잡한 주요 변수들의 코팅 조 건을 최적화하는 머신러닝 기반의 산업 인공지능 모델을 개발하고 이를 융합한 사용자 중심의 지능형 추론 통합 플랫폼을 구축하여 차세대 대면적 페로브스카이트 태양전지의 양산화를 조기에 앞당기고자 하는 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템 및 그 시스템의 구동방법에 관한 것이다."}
{"patent_id": "10-2023-0063434", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 태양전지의 핵심 기술은 실리콘 태양전지가 시장의 95%를 차지하고 있으나, 가격경쟁력을 무기로 한 중국 산 제품으로 정상적인 경쟁이 불가한 상태로 국가 경쟁력을 확보하기 위하여 차세대(3세대) 태양전지 상용화 개 발이 시급하다. 페로브스카이트 태양전지는 기존 실리콘 태양전지보다 용액을 이용한 공정으로 제조가 쉽고, 제 작 원가가 평균 5배 정도 저렴해 차세대 태양전지로 주목받고 있으나 페로브스카이트 태양전지를 상용화하기 위 한 대면적 모듈을 제조하기 위해서는 기존 태양전지 제작 공정인 스핀 코팅(Spin coating) 방식이 아닌 슬롯 다 이 코팅(Slot-die coating) 방식이 구현되어야 하는 과제가 있다. 그런데, 실험실의 셀(Cell) 단위 연구 단계를 지나 수년간 상용화를 위해 진행되고 있는 Slot-die 코팅 방식은 아직 태양전지 광 흡수층 성능에 영향을 주는 코팅 속도(Coating speed), 내외부 온·습도, Bed 온도, N2 세기, 압력, 간격, 높이 등 모듈의 대면적화에 영향을 주는 다양하고 복잡한 무수히 많은 코팅 변수의 최적 결정화 조 건이 해결이 아직도 안되고 있어 페로브스카이트 태양전지 상용화의 허들을 넘지 못하고 있다. 이에 최근에는 차세대 페로브스카이트 태양전지 박막 코팅 공정인 Slot-die 코팅 공정에 영향을 주는 무수히 많 은 다양하고 복잡한 주요 변수에 대한 데이터를 수집, 분석하여 최종적으로 페로브스카이트 태양전지의 상용화 를 위한 박막 코팅 최적화 인공지능 모델 개발과 이를 결합한 사용자 중심의 지능형 추론 통합 플랫폼의 기술 개발이 절실히 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-2478303호(2022.12.13)"}
{"patent_id": "10-2023-0063434", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 가령 차세대 페로브스카이트 태양전지의 상용화에 가장 어려움을 겪고 있는 슬롯 다이 박막 공정에서 광흡수층 코팅 공정에 영향을 미치는 무수히 많은 다양하고 복잡한 주요 변수들의 코팅 조건을 최적화 하는 머신러닝 기반의 산업 인공지능 모델을 개발하고 이를 융합한 사용자 중심의 지능형 추론 통합 플랫폼을 구축하여 차세대 대면적 페로브스카이트 태양전지 양산화를 조기에 앞당기고자 하는 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템 및 그 시스템의 구동방법을 제공함에 그 목적이 있다."}
{"patent_id": "10-2023-0063434", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템는, 페로브스카이트 태양전 지의 박막 공정에 관련되는 박막 공정 데이터를 서로 다른 방식으로 분석하기 위한 복수의 인공지능 모델 (model)을 저장하는 저장부, 및 상기 복수의 인공지능 모델 중 사용자 단말장치에서 선택되는 인공지능 모델을 적용하여 상기 사용자 단말장치에서 제공하는 박막 공정 데이터를 분석하며, 상기 분석에 따른 데이터 분석 결 과를 상기 사용자 단말장치로 제공하는 제어부를 포함한다. 상기 제어부는, 다중회귀모델, 의사결정트리, 랜덤 포레스트, 릿지 회귀 모델, 라쏘 회귀모델, 엘라스틱넷 모델, SVM(Support Vector Machine), SVM Linear, SVM radial, SVM Sigmoid 중 기설정되는 복수의 인공지능 모 델을 사용할 수 있다. 상기 제어부는, 상기 데이터 분석 결과로서 MSE(Mean Square Error), MAE(Mean Absolute Error), RMSE(Root Mean Square Error), R-Square(R2), Adjusted R-Square(AdjR2)의 평가지표별 분석값을 포함하여 제공할 수 있 다. 상기 제어부는, 상기 사용자 단말장치에서 상기 박막 공정 데이터의 분석을 위한 인공지능 모델을 선택할 때 상 기 선택한 인공지능 모델과 관련한 상세 설명 및 결과 산출물의 예시를 화면상에 제공하며, 상기 화면상에서 데 이터 분석을 위한 요청이 있을 때 데이터 분석 동작을 수행할 수 있다. 상기 제어부는, 상기 데이터 분석을 위한 요청이 있을 때 상기 박막 공정 데이터가 기록된 지정 포맷의 파일을 상기 사용자 단말장치에서 첨부하도록 서비스 화면상에서 요청할 수 있다. 또한 본 발명의 실시예에 따른 페로브스카이트 태양전지를 위한 산업 인공지능모델 시스템의 구동방법은, 저장 부가 페로브스카이트 태양전지와 관련한 박막 공정 데이터를 서로 다른 방식으로 분석하기 위한 복수의 인공지 능 모델을 저장하는 단계, 및 제어부가, 상기 복수의 인공지능 모델 중 사용자 단말장치에서 선택되는 인공지능 모델을 적용하여 상기 사용자 단말장치에서 제공하는 박막 공정 데이터를 분석하며, 상기 분석에 따른 데이터 분석 결과를 상기 사용자 단말장치로 제공하는 단계를 포함한다. 상기 분석하는 단계는, 다중회귀모델, 의사결정트리, 랜덤 포레스트, 릿지 회귀 모델, 라쏘 회귀모델, 엘라스틱 넷 모델, SVM(Support Vector Machine), SVM Linear, SVM radial, SVM Sigmoid 중 기설정되는 복수의 인공지능 모델을 사용할 수 있다. 상기 분석하는 단계는, 상기 데이터 분석 결과로서 MSE, MAE, RMSE, R-Square), Adjusted R-Square의 평가지표 별 분석값을 포함하여 제공할 수 있다. 상기 제공하는 단계는, 상기 사용자 단말장치에서 상기 박막 공정 데이터의 분석을 위한 인공지능 모델을 선택 할 때 상기 선택한 인공지능 모델과 관련한 상세 설명 및 결과 산출물의 예시를 화면상에 제공하는 단계, 및 상 기 화면상에서 데이터 분석을 위한 요청이 있을 때 데이터 분석 동작을 수행하는 단계를 포함할 수 있다. 상기 데이터 분석 동작을 수행하는 단계는, 상기 데이터 분석을 위한 요청이 있을 때 상기 박막 공정 데이터가 기록된 지정 포맷의 파일을 상기 사용자 단말장치에서 첨부하도록 서비스 화면상에서 요청하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0063434", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면 Slot-die 코팅 시 요구되는 다수의 속성들을 이용하여 최적의 조건을 예측하는 다중 독립변수를 이용한 지도학습 기반의 회귀 모델을 이용함으로써 박막 코팅 공정을 최적화하여 광 흡수층의 성능 을 높이고, 이에 따라 대면적 페로브스카이트 태양전지의 상용화를 조기에 앞당길 수 있을 것이다. 또한, 본 발명의 실시예에 따르면 사용자가 현장에서 수집된 데이터를 사용하여 예측 모델을 노코딩(No-coding) 방식으로 분석 결과를 직접 모니터링할 수 있는 사용자 중심의 인공지능 추론 통합 플랫폼 서비스를 제공할 수 있을 것이다."}
{"patent_id": "10-2023-0063434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예에 대하여 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 페로브스카이트 태양전지를 위한 인공지능서비스 시스템을 나타내는 도면이며, 도 2는 도 1의 산업 인공지능모델 시스템의 서비스 동작을 간략히 나타내는 도면이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 페로브스카이트 태양전지를 위한 인공지능서비스 시스템(이 하, 인공지능서비스 시스템)은 사용자 단말장치, 통신망 및 산업 인공지능모델 시스템의 일 부 또는 전부를 포함하며, 코팅 머신을 더 포함할 수 있다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 코팅 머신과 같은 일부 구성요소가 생략되어 인공지능서비스 시스템이 구성되거나, 산업 인공지능모델 시스템를 구성하는 구성요소의 일부 또는 전부가 통신망 을 구성하는 네트워크장치(예: 무선교환장치 등)에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 구체적인 설명에 앞서, 일반적인 반도체 소자의 제조와 마찬가지로 본 발명의 실시예에 따른 가령 페로브스카이 트 태양전지의 광소자도 클린룸(clean room) 내에 구비되는 다수의 공정장비에 의해 형성된다고 볼 수 있다. 그 공정장비들 중 하나가 코팅 머신이 될 수 있다. 물론, 공정장비의 내부에는 웨이퍼, 석영기판이나 유리 기판상에 광소자를 형성하기 위해 각각의 공정을 수행하는 다수의 챔버(chamber)가 구비될 수 있다. 통상적으로 페로브스카이트 태양전지는 기본적으로 후면전극, 홀전도층, 광흡수층, 전자전도층, 전면 투명전극, 유리기판의 구조로 이루어질 수 있으며, 전면에서 입사된 태양빛이 광흡수층에 흡수되어 광흡수층으로부터 전자-정공쌍이 형성되어 전기를 발생하는 형태로 이루어진다. 또한, 국내의 한양솔라에너지 사(社)의 경우에는 기판상에 형성된 전면전극, 전자 전공층, 페로브스카이트 광흡 수층, 정공 전도층 및 후면 전극을 포함하며, 페로브스카이트 광흡수층은 전면층 구간, 후면층 구간 및 전면층 구간과 후면층 구간 사이에 배치된 에너지 밴드갭 경사층 구간을 포함하여 에너지 밴드갭이 휘어진만큼 전기장 을 받아 전면쪽으로 재결합없이 이동할 수 있는 확률이 개선된 태양전지를 선보이고 있다. 전자수집효율이 개선 된 페로브스카이트 태양전지는 광흡수층의 전면층 구간에서 에너지가 큰 태양빛을 잘 흡수하며, 광흡수층의 후 면층 구간에서는 긴 거리를 효율적으로 이동할 수 있는 페로브스카이트 광흡수층을 포함하는 태양전지를 구현한 바 있다. 사용자 단말장치는 도 1의 통신망을 경유하여 산업 인공지능모델 시스템에서 제공하는 플랫폼 서비스에 접속하여 페로브스카이트 태양전지의 박막 코팅을 위한 최적의 조건을 예측하기 위한 서비스를 이용할 수 있다. 여기서, 플랫폼 서비스는 \"H.Y.D.T AI 플랫폼\"이라 명명될 수 있다. H.Y.D.T란 차세대 페로브스카이트 태양전지 솔루션 공정에서 수집된 빅데이터를 기반으로 AI 알고리즘을 설계하여 다양한 제조와 연구분야에서도 사용가능하도록 수요자 맞춤형으로 개발한 것으로 사용자가 현장에서 확보한 빅데이터를 가지고 알아내고자 하 는 예측값(혹은 목표값)을 직접 인사이트(insight) 해보는 다양한 인공지능 모델이 통합된 실시간 예측 플랫폼 을 의미한다. 사용자 단말장치는 도 1의 산업 인공지능모델 시스템에 접속하여 다양한 서비스를 이용할 수 있으며, 데스크탑컴퓨터, 랩탑컴퓨터 등 PC 기반의 단말장치뿐 아니라, 태블릿PC, 스마트폰 등 모바일 기반의 단말장치 를 포함할 수 있다. 물론 본 발명의 실시예에 따른 사용자 단말장치는 PC 기반의 단말장치를 이용해 웹 (Web) 기반으로 서비스를 이용할 수 있으며, 모바일 기반의 단말장치를 통해서는 어플리케이션 즉 앱(App.) 기 반으로 서비스를 이용할 수 있다. 사용자 단말장치는 다양한 유형의 단말장치가 사용될 수 있으므로, 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 사용자 단말장치의 사용자 가령 제조회사의 관리자는 현장의 박막 공정 과정에서, 또는 자신들이 소유하는 코팅 머신을 사용하여 취득하는 박막 공정 데이터 즉 박막 코팅 관련 데이터를 소유할 수 있다. 물론 여기 서 박막 코팅 관련 데이터는 슬롯 다이 공정과 관련한 데이터를 의미할 수 있으며, 가령 3D Slot-die 방법으로 실험한 데이터 즉 속성이 coating speed(SPD), N2 blowing 간격(DIST), N2 blowing 세기(BAR), N2 blowing 높이 (HG), bed 온도(TMP)에 따른 코팅 두께(THK)와 관련한 다양한 유형의 데이터가 될 수 있다. 즉 태양전지의 광흡 수층 박막 형성에 영향을 미치는 변수는 베드 온도, 코팅 속도, N2 블로잉 간격, N2 블로잉 높이, N2 블로잉 세 기 등의 변수가 될 수 있다. 이와 관련되는 온도, 습도, 솔루션 점도, 시간, 좌표 등을 포함할 수 있을 것이다. 사용자 단말장치는 이러한 다양한 변수들을 고려한 최적의 조건 즉 조건과 관련한 예측 데이터를 분석 결 과로서 제공받는다고 볼 수 있다. 예를 들어, 최적의 조건을 형성하기 위한 변수가 15개라면 15개의 변수에 대 한 예측값을 제공받을 수 있는 것이다. 이때 제공되는 예측값은 사용자 단말장치에서 선택되는 인공지능 모델을 기반으로 하는 것이 바람직하지만, 본 발명의 실시예에서는 특정 인공지능 모델의 결과에 특별히 한정하 지는 않을 것이다. 다시 말해, 사용자 단말장치의 사용자는 각각의 인공지능 모델을 이용한 예측 데이터를 종합적으로 판단하여 코팅 조건을 설정할 수 있지만, 산업 인공지능모델 시스템에서 복수의 인공지능 모델 의 예측 데이터를 종합하여 사용자 단말장치로 제공해 주는 것도 얼마든지 가능할 수 있다. 대표적으로 평 균값을 제공하는 것이다. 다시 말해 온도 변수에 대하여 A 인공지능 모델이 a값을 산출했고, B 인공지능 모델이 b값을 산출했으며, C 인공지능 모델이 c값을 산출했다면 평균값은 (a+b+c)/3의 형태가 될 수 있는 것이다. 물론, 이의 과정에서 특정 산출값에 가중치를 부여하는 것도 얼마든지 가능할 수도 있을 것이다. 사용자 단말장치는 도 2에 도시된 바와 같이, 박막 공정과 관련한 특히 광 흡수층의 성능을 높이기 위하여 코팅 머신 등을 통해 수집한 데이터를 도 1의 산업 인공지능모델 시스템로 제공하며, 이의 과정에서 사용자 단말장치는 데이터 분석을 위하여 복수의 인공지능 모델 중 하나를 선택할 수 있다. 예를 들어, 해 당 복수의 인공지능 모델에는 다중회귀모델, 의사결정트리, 랜덤 포레스트, 릿지 회귀 모델, 엘라스틱넷 모델, 서포트 벡터 머신(SVM: Support Vector Machine) 등 다양한 유형의 인공지능 모델이 포함될 수 있으며, 따라서 사용자 단말장치는 서비스 화면상에서 자신이 원하는 인공지능 모델을 선택한 후 그에 따라 데이터 분석 결과를 제공받는다고 볼 수 있다. 다양한 인공지능 모델과 관련해서는 이후에 좀더 다루기로 한다. 사용자 단말장치는 데이터 분석 결과를 가령 회원 가입시 인증된 이메일 주소정보를 근거로 이메일의 형태 로 수신할 수 있으며, 해당 분석 결과에는 슬롯 다이 코팅시 요구되는 다수의 속성들을 이용하여 예측한 최적의 조건에 부합하는 결과가 될 수 있다. 분석 결과는 가령 다중회귀 모델의 경우 (변수간) 상관관계, 회귀 적합도, 변수간 중요도 등을 그래프 등의 형태로 제공될 수 있으며, 또 구체적인 데이터 분석 결과를 엑셀 파일 등의 형 태로 제공받을 수도 있다. 사용자 단말장치의 사용자 가령 제조 관리자는 해당 데이터의 분석 결과를 근거로 도 1의 코팅 머신의 최적의 코팅 조건을 설정할 수 있게 되는 것이다. 물론 최적의 코팅 조건이란 사용 자 단말장치에서 제공하는 데이터를 통해 이를 고려하여 최적의 코팅이 가능하도록 분석 결과를 제공하는 것이다. 이때 최적의 코팅 조건에는 코팅 머신을 제조하는 다양한 제조회사나 해당 코팅 머신을 구비하 여 태양전지를 생산하는 생산라인의 제조환경 등이 고려될 수도 있을 것이다. 사용자 단말장치의 사용자는 코팅 머신을 즉 슬롯 다이 코팅 머신을 예측된 데이터를 기반으로 장비를 운영하도록 동작시킨다고 볼 수 있다. 물론 예측된 데이터란 도 1의 산업 인공지능모델 시스템에서 제공하 는 데이터 분석 결과를 의미할 수 있다. 코팅 머신은 통신망을 통해 사용자 단말장치를 경유하지 않고 산업 인공지능모델 시스템와 다이렉트로 통신하여 데이터 분석에 따른 그 예측된 데이터를 직접 제공 받아 자동 세팅 동작을 수행하는 것도 얼마든지 가능할 수 있다. 따라서 본 발명의 실시예에서는 코팅 머신(9 9)의 장비 운용을 위해 사용자 단말장치를 이용하는 것에 특별히 한정하지는 않을 것이다. 물론 자동 세팅 후에 사용자 단말장치로 해당 사실을 통지하는 것도 얼마든지 가능할 수는 있을 것이다. 통신망은 유무선 통신망을 모두 포함할 수 있다. 가령 통신망으로서 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서 유선망은 케이블망이나 공중 전화망(PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함하는 의미이다. 물론 본 발명의 실시예에 따른 통신망은 이에 한정되는 것이 아니며, 향후 구현될 차 세대 이동 통신 시스템의 접속망으로서 가령 클라우드 컴퓨팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있다. 가령, 통신망이 유선 통신망인 경우 통신망 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지만, 무선 통신망인 경우에는 통신사에서 운용하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속 하여 데이터를 처리하거나, BTS(Base Transceiver Station), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터를 처리할 수 있다. 통신망은 액세스포인트를 포함할 수도 있다. 액세스포인트는 건물 내에 많이 설치되는 펨토(femto) 또는 피코(pico) 기지국과 같은 소형 기지국을 포함할 수 있다. 여기서, 펨토 또는 피코 기지국은 소형 기지국의 분 류상 사용자 단말장치 등을 최대 몇 대까지 접속할 수 있느냐에 따라 구분될 수 있다. 물론 사용자 단말장 치 등과 지그비 및 와이파이(Wi-Fi) 등의 근거리 통신을 수행하기 위한 근거리 통신 모듈을 포함할 수 있 다. 액세스포인트는 무선통신을 위하여 TCP/IP 혹은 RTSP(Real-Time Streaming Protocol)를 이용할 수 있다. 여기서, 근거리 통신은 와이파이 이외에 블루투스, 지그비, 적외선(IrDA), UHF(Ultra High Frequency) 및 VHF(Very High Frequency)와 같은 RF(Radio Frequency) 및 초광대역 통신(UWB) 등의 다양한 규격으로 수행될 수 있다. 이에 따라 액세스포인트는 데이터 패킷의 위치를 추출하고, 추출된 위치에 대한 최상의 통신 경로를 지정하며, 지정된 통신 경로를 따라 데이터 패킷을 다음 장치, 예컨대 인접하는 고정형 카메라, 대표 고정형 카메라나 관제서버 등으로 전달할 수 있다. 액세스포인트는 일반적인 네트워크 환경에서 여러 회선을 공유할 수 있으며, 예컨대 라우터(router), 리피터(repeater) 및 중계기 등이 포함될 수 있다. 산업 인공지능모델 시스템는 슬롯 다이 박막 공정에서 광 흡수층 코팅 공정에 영향을 미치는 무수히 많은 다양하고 복잡한 주요 변수들의 코팅 조건을 최적화하는 머신러닝 기반의 산업 인공지능 모델을 구축하고, 이를 융합한 사용자 중심의 지능형 추론 통합 플랫폼 서비스를 제공한다. 좀더 구체적으로 산업 인공지능모델 시스템 는 슬롯 다이 코팅 시 요구되는 다수의 속성들을 이용하여 최적의 조건을 예측하는 다중 독립변수를 이용 한 지도학습 기반의 회귀 모델을 구축하여 이를 통해 서비스를 제공할 수 있다. 물론 본 발명의 실시예에서는 비지도 학습 방식이나 준지도 학습 방식 즉 지도학습과 비지도학습이 병행되는 방식도 사용될 수 있으므로, 어 느 하나의 방식에 특별히 한정하지는 않을 것이다. 여기서 지도학습 방식은 코팅과 관련하여 가장 이상적인 데 이터를 학습시키고 또는 전문가들이 자문한 데이터를 학습시키고, 이때 학습을 위하여 일종의 라벨링(labeling) 동작이 이루어질 수도 있으며 이를 근거로 예측 동작이 이루어지도록 하는 것이다. 또한 사용자가 현장에서 수 집된 데이터를 사용하여 예측 모델을 노코딩 방식으로 분석 결과를 직접 모니터링할 수 있는 사용자 중심의 인 공지능 추론 통합 플랫폼 서비스를 제공한다. 좀더 구체적으로 본 발명의 실시예에 따른 산업 인공지능모델 시스템는 H.Y.D.T AI 플랫폼 서비스를 제공 한다. 이를 위하여 산업 인공지능모델 시스템는 자바스크립트(javascript)로 작성된 홈페이지 즉 온라인 사이트에 접속하여 로그인 과정이 진행되도록 한다. 그리고 깃 배시(Git bash)로 저장된 아이디/패스워드를 대 조하여 로그인 과정을 진행시킨다. 그리고 사용자 단말장치의 요청에 따라 인공지능 모델을 사용하기 위한 서비스 화면을 제공할 수 있다. 선택 가능한 인공지능 모델은 10가지 정도를 제공하지만 그 이상이 될 수도 있 다. 사용자 단말장치의 사용자가 모델을 선택한 후 '솔루션 이용하기' 버튼을 선택하는 경우 지정 포맷의 양식으로 제공된 데이터의 분석 동작을 수행할 수 있으며, 사용자가 선택한 인공지능 모델을 이용한 분석 결과를 사용자 단말장치로 가령 아나콘다 3(Anaconda 3)을 활용하여 사용자의 ID로 메일을 전송할 수 있다. 이 에 따라 사용자 단말장치의 사용자는 모델별 갖가지 결과물을 확인한 후 실제 코팅에 대입 즉 적용할 수 있다. 즉 사용자 단말장치의 사용자는 분석 결과를 확인한 후 도 1의 코팅 머신의 코팅 조건(혹은 환 경)을 설정하거나 기설정된 조건을 변경할 수 있다. 물론 그 조건이란 앞서 언급한 광흡수층 제조시 복잡한 주 요 변수들의 코팅 조건을 의미하며, 온도, 습도, 솔루션 점도, 속도, N2 간격, N2 세기, 시간, 좌표 등의 구체 적인 값이 될 수 있는 것이다. 산업 인공지능모델 시스템에 구축되는 인공지능 모델은 시중에서 유통되고 있는 다양한 모델이 구축될 수 있지만, 구체적으로 신뢰성이 검증된 모델이 사용되는 것이 바람직하다. 여기서, 모델은 특정 동작 즉 데이터 분석을 위해 기생성된 프로그램이라 볼 수 있다. 모델(model), 알고리즘, 프로그램, 모듈(module), 소스코드 등 은 엄격하게는 의미가 구분되어야 하는 것이지만, 유사한 의미로 사용될 수 있다. 산업 인공지능모델 시스템 는 대표적으로 다중회귀 모델(Multiful Regression)을 포함할 수 있다. 다중회귀 모델은 독립변수와 종속 변수 사이의 인과관계를 설명하기 위해 사용되는 모델이다(다중회귀, 다항회귀). 단일 회귀보다 계산할 수 있는 변수량이 많아 오차 분산을 줄이고 정확도를 높일 수 있다. 가령 암종별 상관관계, 높이뛰기 최적화, 수질인자 간 상관관계 등 여러 분야에서 활용할 수 있는 인공지능(AI)이다. 또 산업 인공지능모델 시스템는 의사결 정트리를 포함할 수 있다. 의사결정트리는 특정 항목에 대한 속성과 결과값을 연결해 준다. 한 번의 분기 때마 다 변수 영역을 두 개로 구분한다. 리프노드는 최대한 분리하여 복잡성이 낮게 하는 것이 목적이다. 또한 산업 인공지능모델 시스템는 랜덤 포레스트, 릿지 회귀 모델, 라쏘 회귀 모델, 엘라스틱넷 모델 등을 더 포함할 수 있다. 랜덤 포레스트는 유연성, 정확성, 단순성으로 인해 자주 사용되는 지도머신 알고리즘이다. 랜덤 포레스트가 의사결정트리와 다른 점은, 의사결정트리는 의사결정에 사용하는 규칙을 만들려는 경향이 있고 랜덤 포레스트는 기능을 무작위로 선택하여 결과 평준화를 하는 경향이 있다. 검류·분출·회귀 등의 다양한 문 제에 활용되고 있다. 릿지 회귀 모델은 최소 제곱법과 유사한 형태이다, 정규화를 통해 변수간 상관관계가 높은 상황에서 예측하기 위해 사용 변수 선택이 불가능하나 모든 변수가 모델에 기여하고 크기가 큰 변수를 먼저 줄 이는 경향이 있으며 문제에 대한 명확한 해답을 제시할 수 있다. 라쏘 회귀 모델은 정확한 해답을 낼 순 없지만 변수 선택이 가능한 점을 이용해 변수간 상관관계가 낮은 상황에서 릿지 모델과 비교하면 예측 성능이 좋다. 해 답을 낼 수 없는 closed form solution 상태지만 mcmc 등의 방법으로 근사값을 얻을 수는 있다. 덜 중요한 변수 의 가중치를 제거하는 특징이 있다. 변수끼리 상관관계가 높다면 릿지회귀에 비해 메리트 즉 장점이 적다. 엘라 스틱넷 모델은 릿지 회귀와 라쏘 회귀를 절충하여 두 정규화 항에 r이라는 함수를 두어 결과값을 우수하게 예측 한다. 두 모델을 결합하다 보니 수행시간이 상대적으로 길어지는 문제가 있기는 하다. v가 0에 가까워지면 릿지, 1에 가까워지면 라쏘와 같다. 이외에도 본 발명의 실시예에 따른 산업 인공지능모델 시스템는 SVM, SVM Linear, SVM Polynomial, SVM radial(R.B.F), SVM Sigmoid 등의 인공지능 모델을 더 포함하여 서비스를 제공할 수 있다. SVM은 신호 처리, 의 료 응용 분야, 자연어 처리, 음성 및 영상 인식을 비롯한 여러 분류 및 회귀 문제에 사용되는 지도 학습 알고리 즘이다. 분류를 위한 기준선을 정의하는 모델이며 속성이 2가지면 선형, 3가지 이상이면 3차원이다. 속성값과 결정경계의 거리는 마진으로 불리며 이 마진이 최대화될수록 좋은 데이터이다. 다른 데이터값의 필요 없이 결정 경계만 잘 정의하면 되기 때문에 매우 빠른 속도를 낼 수 있다. 또한 SVM Linear는 2차원 데이터를 사용해서 초 평면의 결정경계를 구하는 모델이고, SVM Polynomial은 2차원의 데이터를 3차원으로 변환하여 비선형 데이터의 초평면 결정경계를 구하는 모델로 사용한다. SVM은 선형판별함수이기 때문에 XOR 같은 영역을 나누는 문제를 풀 지 못한다. 즉 SVM radial은 고차원의 문제를 풀기 위해 고차원으로 변형하여 비선형 데이터의 초평면 결정경계 를 구하는 모델이다. SVM Sigmoid는 모든 데이터를 0과 1로 치환하고 미분할 수 있는 모델로 사용하는 것이며, linear와 같은 커널 함수의 종류이다. 한편, 본 발명의 실시예에 따른 산업 인공지능모델 시스템에서 제공하는 평가지표별 특징은 다음과 같다. 평가지표로는 MSE(Mean Square Error), MAE(Mean Absolute Error), RMSE(Root Mean Square Error), R- Square(R2) 및 AdjR2(Adjusted R-Square) 등이 사용될 수 있다. MSE는 예측값과 실제값의 차이를 제곱하여 평 균한 값으로 값이 작을수록 모델의 예측력이 좋다. 또한 MAE는 예측값과 실제값의 차이의 절대값을 평균한 값이 다. 마찬가지로 작을수록 좋고 이상치의 영향을 적게 받는다. RMSE는 MSE의 제곱근 값으로 예측값과 실제값의 차이를 제곱하여 평균한 값의 제곱근을 계산한 것이다. 즉 MSE 값에 루트를 씌운 것이다. 마찬가지로 낮을수록 좋다. R-Square는 회귀분석에서 종속변수의 총변동량 중 모형에서 설명할 수 있는 변동량의 비율이며, 예측력의 척도로 1에 가까울수록 모델이 데이터를 잘 설명한다고 볼 수 있다. AdjR2는 다중회귀에선 독립변수의 개수가 많아질수록 R-Square 값이 높아지는 경향이 있다. 그러나 변수가 많다고 해서 반드시 모델이 더 좋은 것은 아니며 이러한 경우에 AdjR2 값으로 모델의 예측력을 평가한다. 즉 R-Square)에서 자유도를 고려한 값이다. 본 발명의 실시예에 따른 산업 인공지능모델 시스템는 사용자 단말장치에서 선택하는 인공지능 모델 을 근거로 데이터의 분석 결과 즉 최적의 조건을 위한 예측 데이터를 제공하는 것이지만, 사용자 단말장치(10 0)의 사용자는 복수의 인공지능 모델에서 각각 제공하는 예측 데이터를 근거로 각 인공지능 모델에서 가장 우수 한 결과값만을 선택하여 도 1의 코팅 머신의 코팅 조건을 세팅하는 것도 얼마든지 가능할 수 있다. 다시 말 해, 인공지능 모델은 모델마다 장단점이 존재하기 마련이며 따라서 이러한 점을 고려하여 결과값을 취사선택하 여 이용할 수도 있을 것이다. 상기한 내용 이외에도 도 1의 사용자 단말장치 및 산업 인공지능모델 시스템는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 이후에 좀더 다루어질 수 있으므로, 그 내용들로 대신하고자 한다. 도 3은 도 1의 산업 인공지능모델 시스템의 세부구조를 예시한 블록다이어그램이다. 설명의 편의상 도 3을 도 1과 함께 참조하면, 본 발명의 실시예에 따른 산업 인공지능모델 시스템는 코팅 머신에서 페로브스카이트 태양전지를 최적 조건에서 생산하도록 돕기 위한 장치로서, 통신 인터페이스부 , 제어부, 코팅공정 인공지능처리부 및 저장부의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 저장부와 같은 일부 구성요소가 생략되어 산업 인공지능모델 시스템가 구성되거나, 코팅공정 인공지능처리부와 같은 일부 구성요소가 제어부와 같은 다른 구 성요소에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하 는 것으로 설명한다. 통신 인터페이스부는 도 1의 사용자 단말장치와 통신한다. 통신을 수행하는 과정에서 통신 인터페이 스부는 변/복조, 먹싱/디먹싱, 인코딩/디코딩, 해상도를 변환하는 스케일링 등의 동작을 수행할 수 있으며, 이는 당업자에게 자명하므로 더 이상의 설명은 생략하도록 한다. 통신 인터페이스부는 제어부의 제어하에 사용자 단말장치로 본 발명의 실시예에 따른 서비스를 제공하기 위한 서비스 화면을 제공할 수 있다. 대표적으로 통신 인터페이스부는 사용자 단말장치의 서비스 요청시 서비스 화면을 통해 다수의 인공지능 모델 중 하나를 선택하도록 요청할 수 있으며, 또 지정 포 맷의 파일에 데이터를 입력한 데이터 파일을 첨부하도록 요청할 수 있다. 데이터 파일은 지정된 포맷의 엑셀 파 일이 제공될 수 있다. 또한 사용자 단말장치에서 원하는 인공지능 모델을 선택하고, 또 데이터 파일을 제공한 상태에서 '솔루션 이용하기' 버튼을 선택하는 경우 해당 선택한 인공지능 모델 가령 다중회귀 모델을 실행하여 첨부된 데이터 파 일의 데이터를 분석할 수 있는데, 통신 인터페이스부는 분석 결과를 사용자 단말장치의 사용자가 제 공한 메일 주소로 전송할 수 있다. 통신 인터페이스부는 이러한 동작에 관여할 수 있다. 제어부는 통신 인터페이스부, 코팅공정 인공지능처리부 및 저장부의 전반적인 제어 동작을 담당한다. 제어부는 대표적으로 도 1의 사용자 단말장치의 서비스 요청시 코팅공정 인공지능처리부 를 제어하여 내부에 탑재된 그래픽(GUI) 프로그램 및 인공지능 프로그램을 실행시킬 수 있다. 그래픽 프로 그램은 사용자 단말장치로 서비스 화면을 제공하기 위한 동작을 수행할 수 있으며, 인공지능 프로그램은 사용자 단말장치에서 제공하는 페로브스카이트 태양전지의 박막 공정과 관련한 데이터를 제공받아 이를 사 용자 단말장치에서 선택하는 인공지능 모델을 통해 분석하여 해당 모델의 분석에 따른 분석 결과를 사용자 단말장치로 제공하기 위하여 통신 인터페이스부의 통신을 제어할 수 있다. 또한, 제어부는 이외에도 코팅공정 인공지능처리부와 연계하여 다양한 동작을 수행할 수 있다. 사용 자 단말장치의 장치식별정보, 또는 사용자의 사용자 정보를 근거로 각각의 인공지능 모델에 의해 분석된 분석 결과를 도 1의 DB(120a)에 체계적으로 분류하여 저장시킬 수 있으며, 이를 위하여 제어부는 인트라넷 망 등을 통해 연결되는 DB(120a)에 접속하도록 통신 인터페이스부의 통신을 제어할 수 있다. 나아가 제어 부는 분석 결과를 사용자 단말장치에서 등록한 이메일 주소정보로 자동 전송되도록 메일 모듈을 실행 할 수도 있다. 물론 해당 메일 모듈은 이메일 전송에 관여하며 해당 모듈은 코팅공정 인공지능처리부에 포 함하여 구성될 수 있으며, 제어부는 이를 실행시켜 외부의 메일 서버 등과 연계하여 사용자 단말장치(10 0)로 데이터 분석 결과를 이메일로 제공할 수 있다. 코팅공정 인공지능처리부는 도 1의 사용자 단말장치로 페로브스카이트 태양전지의 박막 공정과 관련 한 인공지능 모델별 분석 데이터를 제공하기 위한 동작을 수행할 수 있다. 여기서, 인공지능 모델은 사용자 단말장치의 사용자가 자율적으로 선택하는 것이므로 가령 사용자 단말장치의 사용자가 동일한 박막 공 정 관련 데이터를 이용하여 A 인공지능모델을 통해 분석 데이터를 얻을 수 있고, 또 B 인공지능모델을 통해 분 석 데이터를 얻을 수 있다. 물론, 코팅공정 인공지능처리부는 이러한 서비스를 제공하기 위하여 결제모듈 을 실행시켜 결제가 이루어진 사용자 단말장치에 한하여 서비스를 제공할 수도 있을 것이다. 좀더 구체적으로 코팅공정 인공지능처리부는 복수의 프로그램 모듈을 포함하여 이를 실행시킬 수 있다. 여 기서, 모듈은 S/W 모듈을 의미할 수 있지만 그것에 특별히 한정하지는 않을 것이다. 다시 말해, 하드웨어, 소프 트웨어, 또 그 조합에 의해 구성될 수 있을 것이다. 복수의 프로그램 모듈은 대표적으로 서비스 화면 생성을 위 한 그래픽 모듈, 또 결제처리를 위한 결제모듈, 아나콘다3과 같이 이메일을 통해 분석 결과의 파일을 전송하기 위한 메일모듈, 박막 공정 데이터의 처리를 위한 인공지능 모듈을 포함할 수 있다. 여기서, 인공지능 모듈은 복 수의 인공지능 모델 즉 프로그램(혹은 알고리즘)을 포함할 수 있으며, 해당 인공지능 모델은 사용자 단말장치 의 요청에 따라 선택적으로 동작할 수 있다. 다시 말해, 코팅공정 인공지능처리부는 사용자 단말장치에서 선택되는 인공지능 모델을 실행하여 박 막 공정 데이터를 분석할 수 있다. 인공지능 모델은 크게 회귀모델, 의사결정트리, 랜덤 포레스트, 엘라스틱넷 모델, SVM 등의 모델을 포함할 수 있으며, 물론 이외에도 다양한 유형의 인공지능 모델을 포함할 수 있다. 또한, 평가지표에 있어서 MSE, MAE, RMSE, R2 및 AdjR 등 다양한 지표를 적용하여 박막 공정 데이터를 처리할 수 있다. 이러한 인공지능 모델은 모듈(예: 칩 등) 등의 형태로 코팅공정 인공지능처리부에 탑재될 수 있 다. 또한, 코팅공정 인공지능처리부는 도 3의 제어부와 연계하여 동작하는 매니저(manager)를 포함할 수도 있다. 해당 매니저는 소프트웨어적으로 구성된 제어 프로그램이 될 수 있으며, 이를 통해 제어부의 요청에 따라 그래픽 모듈, 결제모듈, 메일모듈, 인공지능 모듈을 각각 제어할 수 있을 것이다. 기타 자세한 내 용은 이후에 서비스 화면을 통해 좀더 다루기로 한다. 저장부는 제어부의 제어하에 처리되는 다양한 유형의 데이터를 임시 저장할 수 있다. 저장부는 사용자 단말장치에서 제공하는 박막 공정 데이터를 임시 저장한 후 불러내어 데이터 분석을 위해 코팅공정 인공지능처리부로 제공할 수 있다. 이때, 저장부는 데이터 전송과 함께 사용자 단말장치에서 선 택한 인공지능 모델의 선택 정보를 함께 제공함으로써 그 선택한 인공지능 모델에 따른 분석이 이루어지도록 할 수 있다. 상기한 내용 이외에도 도 3의 통신 인터페이스부, 제어부, 코팅공정 인공지능처리부 및 저장부 는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하 고자 한다. 본 발명의 실시예에 따른 도 3의 통신 인터페이스부, 제어부, 코팅공정 인공지능처리부 및 저장 부는 서로 물리적으로 분리된 하드웨어 모듈로 구성되지만, 각 모듈은 내부에 상기의 동작을 수행하기 위 한 소프트웨어를 저장하고 이를 실행할 수 있을 것이다. 다만, 해당 소프트웨어는 소프트웨어 모듈의 집합이고, 각 모듈은 하드웨어로 형성되는 것이 얼마든지 가능하므로 소프트웨어니 하드웨어니 하는 구성에 특별히 한정하 지 않을 것이다. 예를 들어 저장부는 하드웨어인 스토리지(storage) 또는 메모리(memory)일 수 있다. 하지 만, 소프트웨어적으로 정보를 저장(repository)하는 것도 얼마든지 가능하므로 위의 내용에 특별히 한정하지는 않을 것이다. 한편, 본 발명의 다른 실시예로서 제어부는 CPU 및 메모리를 포함할 수 있으며, 원칩화하여 형성될 수 있 다. CPU는 제어회로, 연산부(ALU), 명령어해석부 및 레지스트리 등을 포함하며, 메모리는 램을 포함할 수 있다. 제어회로는 제어동작을, 그리고 연산부는 2진비트 정보의 연산동작을, 그리고 명령어해석부는 인터프리터나 컴 파일러 등을 포함하여 고급언어를 기계어로, 또 기계어를 고급언어로 변환하는 동작을 수행할 수 있으며, 레지 스트리는 소프트웨어적인 데이터 저장에 관여할 수 있다. 상기의 구성에 따라, 가령 산업 인공지능모델 시스템 의 동작 초기에 코팅공정 인공지능처리부에 저장되어 있는 프로그램을 복사하여 메모리 즉 램(RAM)에 로딩한 후 이를 실행시킴으로써 데이터 연산 처리 속도를 빠르게 증가시킬 수 있다. 딥러닝 모델 같은 경우 램 (RAM)이 아닌 GPU 메모리에 올라가 GPU를 이용하여 수행 속도를 가속화하여 실행될 수도 있다. 도 4a 내지 도 4i는 도 1의 산업 인공지능모델 시스템에서 제공하는 서비스 화면의 예시도이다. 설명의 편의상 도 4a 내지 도 4i를 도 1과 함께 참조하면, 도 1의 사용자 단말장치의 서비스 요청시 산업 인공지능모델 시스템는 도 4a에서와 같이 메인화면을 제공한다. 물론 메인화면은 다양하게 설계될 수 있으 며, 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 회원가입이 먼저 진행된 경우에는 로그인을 통해 다양한 인공지능 모델이 통합된 실시간 예측 플랫폼 서비스를 제공할 수 있다. 도 4a 및 도 4b는 로그인을 통해 서비스에 접속하는 과정을 보여주고 있다. 회원가입시 아이디는 메일주소를 통해 가입이 가 능할 수 있다. 또한, 도 1의 사용자 단말장치는 로그인을 완료한 상태에서 도 4c에서와 같이 'view detail' 항목을 선택 하여 박막 공정 데이터의 분석을 위한 서비스에 접속할 수 있다. 도 4d는 데이터 예측 솔루션 화면을 보여주고 있다. 화면의 상측 영역(혹은 제1 영역)에는 산업 인공지능모델 시스템에서 제공하는 복수의 인공지능 모 델 항목(또는 메뉴)들이 표시된다. 사용자 단말장치의 사용자는 자신이 원하는 인공지능 모델을 선택할 수 있다. 도 4d에는 다중회귀 모델이 선택되는 모습을 보여주고 있다. 물론 본 발명의 실시예에서는 유료 서비스를 제공할 수 있으며, 별도의 결제가 필요한 경우에는 '결제하기' 버튼을 선택한 후 결제를 진행한 후에 서비스를 이용할 수도 있을 것이다. 도 4d에서 볼 때, 제1 영역에서 다중회귀 모델이 선택되는 경우 그 하단의 제2 영역 에는 다중회귀 모델과 관련한 자세한 설명과, 또 결과 산출물과 관련한 예시가 화면상에 보여질 수 있다. 회귀 모델의 경우 상관관계, 회귀적합도 및 변수간 중요도 등의 분석 결과가 제공될 수 있으며, 평가지표별 예측 모 델 성능 평가 결과도 제공될 수 있다. 물론 이러한 데이터는 파일 형태로 생성되어 사용자 단말장치로 이 메일 주소 정보를 통해 제공될 수 있다. 도 4d에서 볼 때, 화면의 하단(혹은 제3 영역)에는 '무료체험하기' 버튼과 '솔루션 이용하기' 버튼이 각각 표시 된다. 무료 체험하기의 경우에는 가령 2주 정도의 시간범위 이내에서 무료서비스가 제공될 수 있으며, 유료회원 의 경우에는 솔루션 이용하기를 통해 박막 공정과 관련한 본격적인 분석 과정을 진행할 수 있다. '솔루션 이용 하기' 버튼 즉 데이터 분석 요청 버튼의 선택시 도 4e에서와 같은 화면으로 전환 또는 진입할 수 있다. 도 4e는 사용자 단말장치에서 박막 공정과 관련한 데이터를 첨부하기 위한 화면에 해당한다. 원활한 데이터 분석을 위하여 파일은 지정 포맷의 파일을 사용할 수 있으며, 가령 엑셀 파일 등의 지정 포맷에 박막 공정 데이터를 입 력하여 제공하도록 서비스가 이루어질 수 있다. 데이터 파일의 양식은 플랫폼 보관함 등에서 제공될 수 있다. 카테고리는 크게 학습용 데이터 첨부파일과 예측용 데이터 첨부파일로 구분될 수 있다. 여기서 학습용 데이터 첨부파일은 예측용 데이터 첨부파일의 데이터 분석을 위한 기준이 될 수 있을 것이다. 본 발명의 실시예에서는 지도학습 방식으로 회귀모델이 동작할 수 있다. 도 4f는 예측 데이터 작성을 위한 데이터 파일 양식의 예를 보 여주고 있다. 도 4f에서 볼 때 속성의 계수는 15개 정도로 제공될 수 있다. 물론 여기서 속성은 박막 공정을 위 한 변수를 의미할 수도 있을 것이다. 더 정확하게는 Att1 = 조건 1, Att2 = 조건2, ....., Att15 = 조건 15를 각각 나타낸다고 볼 수 있다. 도 4g에서와 같이, 사용자 단말장치에서 파일 첨부를 완료한 후 그 하단의 '메일 발송하기' 버튼을 선택하 는 경우 첨부된 박막 공정 데이터의 분석 동작이 진행될 수 있으며, 물론 해당 데이터는 메일 발송하기와 함께 산업 인공지능모델 시스템로 제공되어 분석 동작이 이루어지게 되며, 이후 사용자 단말장치로는 도 4h에서와 같이 이메일을 통해 분석 결과 즉 분석 데이터가 자동으로 제공될 수 있다. 앞서 다중회귀모델을 선택 하였으므로 그에 따른 분석 데이터가 제공되는 것이다. 도 4i는 분석 결과로서 제공되는 다중회귀모델에 따른 분석 데이터 중 일부를 보여주고 있다. 사용자 단말장치를 통해 사용자는 상관관계, 회귀 적합도, 변수간 중요도 등을 확인할 수 있다. 도 4j는 다중회귀모델에 따른 평가지표별 결과 데이터를 보여주고 있다. R2 = 0.7, adjR2 = 0.68, RMSE = 7.72, MAE = 6.71에 해당할 수 있다. 사용자 단말장치는 산업 인공지능모델 시스템로부터 제공되는 예측 데이터를 기반으로 도 1의 코팅 머신을 운용할 수 있다. 예측 데이터는 코팅 머신의 태양전지 제조 특히 광흡수층의 박막 공정과 관련 한 온도, 습도, 솔루션 점도, 속도, N2 간격, N2 세기, 시간, 좌표 등과 관련한 데이터이므로 이를 반영하여 코 팅 머신은 공정 데이터를 재설정하거나 기설정된 데이터를 변경할 수 있을 것이다. 물론 본 발명의 실시예서는 다중회귀모델을 사용하는 경우를 가정하여 설명하였지만, 사용자 단말장치의 사용자는 모델별 갖가지 결과물을 확인 후 실제 코팅에 적용할 수 있으며, 이의 과정에서 복수의 모델별 결과를 종합적으로 판단하여 실제 코팅에 대입하는 것도 얼마든지 가능할 수 있을 것이다. 도 5는 도 1의 산업 인공지능모델 시스템의 구동과정을 나타내는 흐름도이다. 설명의 편의상 도 5를 도 1과 함께 참조하면, 본 발명의 실시예에 따른 산업 인공지능모델 시스템는 페로 브스카이트 태양전지와 관련한 박막 공정 데이터를 서로 다른 방식으로 분석하기 위한 복수의 인공지능 모델을 저장할 수 있다(S500). 여기서, 박막 공정 데이터는 가령 광 흡수층의 박막 코팅에 관련되는 데이터가 될 수 있 으며, 온도, 습도, 솔루션 점도, 속도, N2 간격, N2 세기, 시간, 좌표 등의 변수와 관련한 데이터를 포함할 수 있다. 또한, 복수의 인공지능 모델은 다중회귀 모델, 의사결정트리, 랜덤 포레스트, 릿지 회귀 모델, 라쏘 회귀모델, 엘라스틱넷 모델, SVM 등 다수를 포함할 수 있다. 또한 산업 인공지능모델 시스템는 복수의 인공지능 모델 중 사용자 단말장치에서 선택되는 인공지능 모델을 적용하여 사용자 단말장치에서 제공하는 박막 공정 데이터를 분석하며, 분석에 따른 데이터 분석 결과를 사용자 단말장치로 제공한다(S510). 예를 들어, 산업 인공지능모델 시스템는 복수의 인공지능 모델 중 다중회귀모델이 선택되는 경우 해당 다중회귀모델 즉 인공지능 프로그램을 실행해 사용자 단말장치 에서 제공한 박막 공정 데이터를 분석하여 분석 결과로서 예측 데이터를 제공할 수 있다. 여기서 예측 데 이터는 가령 박막 코팅의 최적 조건과 관련한 데이터에 해당할 수 있다. 산업 인공지능모델 시스템는 사용자 단말장치로부터 데이터 분석을 위한 박막 공정 데이터를 제공받 기 위하여 지정 포맷의 파일 형태로 데이터를 요청할 수 있다. 인공지능 모델은 해당 데이터 포맷을 기준으로 데이터를 분석하도록 설정 즉 프로그램화되어 있으므로, 표준 양식을 제공하고 해당 양식을 통해 데이터를 제공 받을 수 있는 것이다. 이외에도 산업 인공지능모델 시스템는 온라인 플랫폼 서비스를 제공하면서 사용자 단말장치에서 데이터 분석을 위한 특정 인공지능 모델을 선택할 때 그와 관련한 상세한 설명을 제공할 수 있으며, 또 산출결과물의 예시도 서비스 화면을 통해 제공할 수 있다. 그후 사용자 단말장치에서 데이터 분석 요청시 사용자 단말장치의 박막 공정 데이터가 입력된 파일을 첨부하도록 요청할 수 있는 것이다. 뿐만 아니라, 산업 인공지능모델 시스템는 데이터 분석 결과를 회원가입시 인증된 이메일 주소로 자동으로 전송할 수 있다. 본 발명의 실시예에 따른 서비스는 유료로 제공될 수 있으며, 물론 서비스를 1회 이용할 때마 다 지정 금액의 결제를 진행하도록 할 수 있으며, 월정액제로 서비스를 제공하는 것도 얼마든지 가능할 수 있다. 이를 위하여 산업 인공지능모델 시스템는 결제모듈을 실행시킬 수 있으며, 이를 통해 PG사 서버나 은행 등의 금융사 서버 등과 연계하여 결제를 처리할 수도 있을 것이다. 상기한 내용 이외에도 도 1의 산업 인공지능모델 시스템는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모 든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각각 하 나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램 으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일시적 저 장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발 명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다."}
{"patent_id": "10-2023-0063434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 첨부된 도면을 참조하여 본 발명의 실시예들을 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식 을 가진 자는 본 발명의 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정 적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0063434", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 페로브스카이트 태양전지를 위한 인공지능서비스 시스템을 나타내는 도면, 도 2는 도 1의 산업 인공지능모델 시스템의 서비스 동작을 간략히 나타내는 도면, 도 3은 도 1의 산업 인공지능모델 시스템의 세부구조를 예시한 블록다이어그램, 도 4a 내지 도 4i는 도 1의 산업 인공지능모델 시스템에서 제공하는 서비스 화면의 예시도, 그리고 도 5는 도 1의 산업 인공지능모델 시스템의 구동과정을 나타내는 흐름도이다."}
