{"patent_id": "10-2019-0088044", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0011102", "출원번호": "10-2019-0088044", "발명의 명칭": "맞춤형 상업정보 인공지능 검색 시스템", "출원인": "주식회사 앱컴파니", "발명자": "장효용"}}
{"patent_id": "10-2019-0088044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "상품정보를 저장하는 빅데이터 상품정보 DB;상기 빅데이터 상품정보 DB에 상점 및 상품 정보를 제공하는 복수의 판매자 단말;위치기반 정보를 갖는 복수의 사용자 단말에 설치되어 이미지, 음성, 텍스트 중 어느 하나를 이용해 상품검색어를 입력하고 검색된 상품검색정보를 제공받는 인터페이스모듈;상기 상품검색어의 이미지나 텍스트를 상기 빅데이터 상품정보 DB에서 검색하여 산출된 상기 상품검색정보를 상기 인터페이스모듈에 제공하는 이미지검색모듈;상기 상품검색어의 음성을 텍스트 변환 API(Application Programming Interface)를 통해 상기 빅데이터 상품정보 DB에서 검색하여 산출된 텍스트형태의 상기 상품검색정보를 음성변환 API를 통해 상기 인터페이스모듈에 음성으로 제공하는 음성검색모듈;상기 상품검색어 및 상기 상품검색정보와 이를 통한 사용자의 구매상품정보를 포함하여 온·오프라인 상점 및상품 정보의 데이터를 실시간으로 수집하여 상기 빅데이터 상품정보 DB에 저장하는 크롤러;상기 크롤러를 통해 수집된 상기 상품검색어와 상기 상품검색정보 및 상기 구매상품정보를 포함하는 상기 인터페이스모듈의 로그정보를 사용자별 데이터로 수집하는 데이터수집부, 상기 복수의 사용자별 데이터를 상품별로구분하는 상품카테고리부, 상기 구매상품정보를 바탕으로 상기 상품별 구분을 분석하여 각 사용자별로 상품에따른 선호도를 파악하는 선호도분석부, 상기 각 사용자의 선호도에 따라 개별 사용자를 그룹화하는 사용자그룹부, 상기 사용자그룹별로 최적화된 상품정보를 제공하는 최적상품추천부,를 포함하는 인공지능서버; 로 구성되는 것을 특징으로 하는 맞춤형 상업정보 인공지능 검색 시스템."}
{"patent_id": "10-2019-0088044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 인공지능서버는 상기 최적상품추천부를 통해 제공된 상기 상품검색정보 중 사용자의 구매의사가 반영된 찜한 상품의 구매 유도를 위해, 사용자의 방문지역에 맞춰 상기 찜한 상품을 보유한 오프라인 상점의 상품정보,이벤트 정보, 할인 또는 무료 쿠폰 등을 발송하는 구매유도부가 더 포함되는 것을 특징으로 하는 맞춤형 상업정보 인공지능 검색 시스템."}
{"patent_id": "10-2019-0088044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 음성검색모듈은, 상기 인터페이스모듈를 통해 입력된 질의어인 음성파일을 텍스트데이터로 변환하는 CloudSpeech API; 상기 텍스트데이터를 단어별로 단순화하여 검색어와 명령어를 추출하는 텍스트추출부; 상기 추출된검색어 및 명령어를 미리 설정된 명령 DB와 비교하는 질의어 처리부; 상기 검색어를 상기 추출된 명령어로 상기인공지능서버를 통해 상기 빅데이터 상품정보 DB에서 검색하여 그 결과를 메시지로 응답하는 응답메시지부; 상기 메시지의 텍스트를 음성파일로 변환하는 Android TTS API; 을 특징으로 하는 맞춤형 상업정보 인공지능 검색시스템."}
{"patent_id": "10-2019-0088044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "상기 제3항에 있어서,공개특허 10-2021-0011102-3-상기 질의어 처리부는, 질의어를 사전학습 알고리즘을 활용하여 유사어를 확률로 판단하는 숫자치환부; 상기 숫자치환부의 결과에 따라 상기 사용자의 질의어를 미리 설정된 상기 명령DB에 저장된 사전학습 질의어와 비교하는 비교부; 상기 비교부의 결과에 따라 유사여부를 판단하는 유사어판단부; 상기 유사어판단부에서 인지하지 못한 상기 질의어를 상기 응답메시지부를 통해 사용자에게 유사도가 높은 유도문장으로 유도질의를 하는 유도질의부; 상기 유사어판단부 및 상기 유도질의부를 통해 인지된 상기 응답메시지부를 통해 사용자에게 응답하는 인지확인부; 상기 유도질의를 통해 재답변된 답변이 상기 비교부 및 상기 유사어판단부를 통해 인지 가능한 질의어인 경우 최초 질의어와 상기 유도질의한 유도문장을 동의어로 처리하는 동의어처리부; 로 이루어지는 것을 특징으로 하는 맞춤형 상업정보 인공지능 검색 시스템."}
{"patent_id": "10-2019-0088044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 크롤러에 정보를 제공하며 상기 판매자 단말의 오프라인 상점별 ID가 저장되는 NFC(Near FieldCommunication)스티커를 구비하되,위치기반 정보를 갖는 상기 사용자 단말은 상기 NFC스티커에 태깅하거나, 상기 상품검색정보의 상품정보 상세에서 상점의 '팔로우' 허락으로 상기 오프라인 상점에 설치되는 와이파이, 비콘, NFC 중 어느 하나에 자동 페어링되어 상기 오프라인 상점의 상품정보, 이벤트 정보, 할인 또는 무료 쿠폰을 수신하는 것을 특징으로 하는 맞춤형 상업정보 인공지능 검색 시스템."}
{"patent_id": "10-2019-0088044", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 맞춤형 상업정보 인공지능 검색 시스템에 관한 것으로, 좀 더 상세하게는 본 발명은 크롤러를 이용해 온·오프라인 상점의 쇼핑정보를 실시간으로 수집하여 빅데이터화 하고, 이 빅데이터 상품정보 DB에 기반하여 사 용자가 주로 이미지나 음성을 통해 상품검색에 사용한 상품검색어와 검색결과인 상품검색정보 및 이를 통한 구매 상품정보를 인공지능서버를 통해 분석하여 사용자 개인의 선호도를 분석함과 함께, 유사한 선호도를 보이는 사용 자별로 그룹화한 사용자그룹으로 분류하여, 개인별 또는 그룹별로 최적화된 실시간 상품정보를 제공 및 추천하는 맞춤형 상업정보 인공지능 검색 시스템에 관한 것이다."}
{"patent_id": "10-2019-0088044", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 맞춤형 상업정보 인공지능 검색 시스템에 관한 것으로, 좀 더 상세하게는 본 발명은 크롤러를 이용해 온·오프라인 상점의 쇼핑정보를 실시간으로 수집하여 빅데이터화 하고, 이 빅데이터 상품정보 DB에 기반하여 사용자가 주로 이미지나 음성을 통해 상품검색에 사용한 상품검색어와 검색결과인 상품검색정보 및 이를 통한 구매상품정보를 인공지능서버를 통해 분석하여 사용자 개인의 선호도를 분석함과 함께, 유사한 선호도를 보이는 사용자별로 그룹화한 사용자그룹으로 분류하여, 개인별 또는 그룹별로 최적화된 실시간 상품정보를 제공 및 추 천하는 맞춤형 상업정보 인공지능 검색 시스템에 관한 것이다."}
{"patent_id": "10-2019-0088044", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 모바일 상거래 시장에서 많은 주목을 받고 있는 O2O(Online-To-Offline)를 꼽을 수 있다. O2O란 ICT(Information & Communication Technology) 기술을 기반으로 온라인을 통해 고객을 유치하여 오프라인으로 소비자를 유도하는 방 식이다. 예를 들어, 근거리통신(NFC: Near Field Communication)기술이나 위치기반 (LB: location based) 기술을 활용해 오프라인 매장 주변의 소비자에게 할인쿠폰을 발송하여 잠재고객을 오프라인 매 장으로 유치하는 것이다. 또한, 이렇게 유치한 고객을 통해서 축적된 데이터를 분석해 효과적인 마케팅 방법도 도출할 수 있다. 방문 고객의 정보를 기반으로 충성도가 높은 고객에게 더 많은 혜택을 제공하는 등 정교한 고 객관리도 구현 가능해 오프라인 매장의 수익을 증대시키는 수단으로 주목받고 있다. 기존 O2O 서비스들은 위치기반 단순 상점 정보를 나열하는 수준이었다. 때문에, 소비자들은 대부분 상품의 이미 지, 평점, 평균 배달 시간, 가격 등 매우 복합적으로 고려하여 상품을 구매해야 했다. 따라서 이러한 귀찮을 선 택을 최소화하고 더 많은 상품에서 자동으로 상품을 골라주는 기능이 필요하게 된다. 또한, 기존 O2O는 모든 데 이터가 비실시간 데이터라 상점마다 실시간 매출 상황의 따른 판매전환(시간별 판매가 미비할 때 할인판매 기능 미비)이 가능하지 않으며 소비자에게 알려줄 방안도 없었다. 한편, 상기와 같은 문제를 보완하기 위한 노력의 일환으로 인공지능을 이용한 채팅형 주문 방식이 있다. 딜리버 리히어로의 챗봇인 '헝그리봇' 은 자연어 대화 방식으로 주문이 이뤄진다. 해당 대화창에서 과거 주문 내역 데 이터를 참고해 사용자에게 음식점이나 메뉴를 추천하기도 한다. 특정 피자 업체, 특정 메뉴를 반복해서 페이스 북 메신저 창을 통해 주문하면, 해당 주문 내용을 기억해 다음번 피자 주문 때 반영한다.카카오와 네이버도 챗봇과 같은 채팅형 주문을 제공하고 있다. 카카오는 '카카오톡 주문하기'를 제공하고 있으 며, 네이버는 '네이버 톡톡'이라는 채팅형 서비스를 제공하고 있다. 네이버는 자체 인공지능 스피커로 우아한형 제들의 '배달의민족'과 연동하게 된다. 인공지능 스피커는 사람의 말을 텍스트로 변환하여 해당 상품을 찾아 주 는 서비스이다. 카카오도 카카오 미니라는 스피커를 활용한 주문하기, 택시호출, 추천음악 서비스를 제공하고 있다. 상기와 같은 기술들의 추천기능은 단순하게 최근 카테고리를 보여주는 수준에 그치고 있다. 즉, 현재 상품 추천 은 사용자의 최근 본 카테고리나 나이 등을 고려하는 정도의 단순 상품 추천에 그치고 있다. 이러한 수준의 추 천방식은 굳이 인공지능의 도입없이도 단순하게 프로그램의 검색 조건을 바꾸는 방식으로도 구현 가능하다. 그 러나 사용자의 실제 구매상품과 구매패턴까지 종합적인 판단을 하기 위해서는 인공지능의 도입 필요하다. 즉, 사용자의 판매 시점의 위치, 사용자가 가장 많이 본 상품의 이미지까지 수치화하여 분석하기 위해서는 인간과 같은 종합적인 상품을 선별할 수 있는 기능을 갖춘 인공지능의 도입이 필요하다. 예컨데, 구매상품정보 등 그동 안의 구매 데이터를 분석하여 어떤 사용자가 특정 지역의 특정 장소를 자주 방문한다면, 그 사용자의 이동경로 를 추측하여 상품을 추천해 줄 수 있다. 이는 사용자의 구매상품정보를 바탕으로 그동안 사용자의 주 구매상품 이 의류이고, 의류 중에서도 짧은 스커트의 분홍색 원피스라면 해당 상품의 이미지를 수치화하여 사용자의 방문 지역의 이동경로 상에 있는 상점에서 가장 유사한 상품을 추천하여 주는 기능의 직관적인 상품추천이 가능하게 된다. 이러한 직관적인 상품추천은 특히, O2O 사업의 지역 상품을 추천할 때 유용하다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내 등록특허 10-1635090 (등록일 2016.06.24) (특허문헌 0002) 국내 공개특허 10-2018-0016180 (공개일 2018.02.14) (특허문헌 0003) 국내 등록특허 10-1918358 (등록일 2018.11.07) (특허문헌 0004) 국내 등록특허 10-0340036 (등록일 2002.05.27) (특허문헌 0005) 국내 등록특허 10-1180371 (등록일 2012.08.31)"}
{"patent_id": "10-2019-0088044", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기한 문제점을 극복하기 위한 본 발명의 목적은 원하는 정보를 얻기 위해 상품정보의 빅데이터화를 통한 빅데 이터 검색 시스템과 직관적인 이미지 검색과 음성인식을 제공하는 것이다. 또 다른 목적은 인공지능 서버를 활용하여 사용자 취향에 맞는 상품을 추천해주는 기능을 제공하는 것이다. 이 는 크롤러로 수집된 빅데이터 상품정보 DB와 연동하는 인공지능 서버를 통해 사용자의 상품 로그를 데이터로 저 장하였다가 특정날짜에 사용자의 기호를 분석하여 비슷한 상품류를 추천하는 것이다. 또 다른 목적은 음성인식기술을 활용하여 대화형 검색 주문까지 가능하게 하는 것이다. 사용자가 인터페이스모 듈을 통해 자연어로 말을 하게 되면, 자동으로 해당 음성파일을 텍스트로 변환하여 해당 정보와 유사한 상품을 검색하여 사용자에게 제공하도록 하는 것이다. 또 다른 목적은 이미지 검색을 활용하여 길거리 쇼윈도우, 대형마트 등에서 지금 보고 있는 상품을 사용자 단말 의 인터페이스모듈을 통해 상품을 카메라로 촬용하면, 촬영된 이미지 파일을 빅데이터 상품정보 DB에서 해당 상 품과 가장 유사한 상품을 검색하여 사용자에게 제공하도록 하는 것이다. 또 다른 목적은 온·오프라인 상점 및 상품 정보를 크롤러를 이용해 빅데이터화하고, 이를 사용자 단말의 인터 페이스모듈을 통해 이미지 검색 및 음성 검색이 가능한 상품정보 검색 및 수신 시스템을 제공하는 것이다."}
{"patent_id": "10-2019-0088044", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명은 상품정보를 저장하는 빅데이터 상품정보 DB; 상기 빅데이터 상품정보 DB에 상점 및 상품정보를 제공하는 복수의 오프라인 판매자 단말; 복수의 사용자 단말에 설치되어 이미지, 음성, 텍스트 중 어느 하나를 이용해 상품검색어를 입력하고 검색된 상품검색정보를 제공받는 인터페이스모듈; 상기 상품검색어의 이미지나 텍스트를 상기 빅데이터 상품정보 DB에서 검색하여 산출된 상기 상품검색정보를 상 기 인터페이스모듈에 제공하는 이미지검색모듈; 상기 상품검색어의 음성을 텍스트 변환 API(Application Programming Interface)를 통해 상기 빅데이터 상품정보 DB에서 검색하여 산출된 텍스트형태의 상기 상품검색정 보를 음성변환 API를 통해 상기 인터페이스모듈에 음성으로 제공하는 음성검색모듈; 상기 상품검색어 및 상기 상품검색정보와 이를 통한 사용자의 구매상품정보를 포함하여 온·오프라인 상점 및 상품정보의 데이터를 수집 하여 상기 빅데이터 상품정보 DB에 저장하는 크롤러; 상기 크롤러를 통해 수집된 상기 상품검색어와 상기 상품 검색정보 및 상기 구매상품정보를 포함하는 상기 인터페이스모듈의 로그정보를 사용자별 데이터로 수집하는 데 이터수집부, 상기 복수의 사용자별 데이터를 상품별로 구분하는 상품카테고리부, 상기 구매상품정보를 바탕으로 상기 상품별 구분을 분석하여 각 사용자별로 상품에 따른 선호도를 파악하는 선호도분석부, 상기 각 사용자의 선호도에 따라 개별 사용자를 그룹화하는 사용자그룹부, 상기 사용자그룹별로 최적화된 상품정보를 제공하는 상 품추천부를 포함하는 인공지능서버; 로 구성되는 것을 특징으로 한다. 또한, 상기 음성검색모듈은, 상기 인터페이스모듈를 통해 입력된 자연어인 음성파일을 텍스트데이터로 변환하는 Cloud Speech API; 상기 텍스트데이터를 단어별로 단순화하여 검색어와 명령어를 추출하는 텍스트추출부; 상기 추출된 명령어를 미리 설정된 명령 DB와 비교하여 상기 검색어를 상기 추출된 명령어로 상기 인공지능서버를 통 해 상기 빅데이터 상품정보 DB에서 검색하여 그 결과를 메시지로 응답하는 응답메시지부; 상기 메시지의 텍스트 를 음성파일로 변환하는 Android TTS API; 로 이루어지는 것을 특징으로 한다. 또한, 상기 음성검색모듈은 상기 텍스트추출부를 통해 추출된 상기 명령어가 상기 명령 DB에 등록되지 않은 경 우에 상기 응답메시지부를 통해 사용자에게 재질문하는 재질문부가 더 포함되는 것을 특징으로 한다. 또한, 상기 크롤러에 정보를 제공하며 상기 판매자 단말의 상점별 ID가 저장되는 NFC(Near Field Communication)스티커를 구비하되, 위치기반 정보를 갖는 상기 사용자 단말은 상기 NFC스티커에 태깅하거나, 상 기 상품검색정보의 상품정보 상세에서 상점의 '팔로우' 허락으로 상기 오프라인 상점에 설치되는 와이파이, 비 콘, NFC 중 어느 하나에 자동 페어링 되어 상기 오프라인 상점의 상품정보, 이벤트 정보, 할인 또는 무료 쿠폰 을 수신하는 것을 특징으로 한다."}
{"patent_id": "10-2019-0088044", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 구성의 본 발명은 첫째, 이미지 검색을 활용하여 거리나 상점 등에서 마음에 드는 상품을 촬영하면, 이 와 최대한 유사한 상품을 검색하여 구매까지 원스톱으로 이루어질 수 있다는 장점이 있다. 둘째, 음성 검색을 통해 신체가 불편한 장애인이나 노약자들도 상품을 검색하고 구매함에 아무런 어려움이 없다 는 장점이 있다. 터치 위주의 스마트폰은 손이 불편한 장애인이나, 시력이 좋지 못한 노인들에게는 사용상의 제 약이 있을 수 있으나, 음성만으로도 상품의 주문 및 결제가 가능하여 사회적 약자에게도 많은 도움이 된다. 셋째, 사용자에게 최적화된 상품만을 추천받을 수 있다는 장점이 있다. 바쁜 일상에서 내 취향을 알고 자동으로 선택하여 주는 기능은 사용자에게 선택의 스트레스를 줄여줄 수 있게 된다. 본 발명은 인공지능을 활용하여 사 용자의 상품검색정보 및 구매상품정보를 분석하여 최적화된 상품을 추천하기 때문에 사용자는 쉽고 편리하게 상 품을 선택하여 구매할 수 있게 된다."}
{"patent_id": "10-2019-0088044", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 이용하여 본 발명을 상세하게 설명한다. 다만, 첨부 도면은 본 발명의 바람직한 실시예를 나타낸 것이므로, 이들 도면에 의해서 본 발명의 권리범위가 제한되는 것은 아니다. 그리고, 본 발명을 실시하 는데 꼭 필요한 구성이라 하더라도 공지기술에 속하거나, 통상의 기술자가 공지기술로 부터 용이하게 실시할 수 있는 구성에 대해서는 구체적인 설명을 생략한다. 도 1과 같이, 본 발명은 크롤러를 이용해 온·오프라인 상점의 쇼핑정보를 실시간으로 수집하여 빅데이터화 하고, 이 빅데이터 상품정보 DB에 기반하여 사용자가 주로 이미지나 음성을 통해 상품검색에 사용한 상품검 색어와 검색결과인 상품검색정보 및 이를 통한 구매상품정보를 인공지능서버를 통해 분석하여 사용자 개인의 선호도를 분석함과 함께, 유사한 선호도를 보이는 사용자별로 그룹화한 사용자그룹으로 분류하여, 개인별 또는 그룹별로 최적화된 실시간 상품정보를 제공 및 추천하는 맞춤형 상업정보 인공지능 검색 시스템을 특징으로 한다. 도 1 및 도 2에 도시된 것처럼, 상기와 같은 특징을 갖는 본 발명 맞춤형 상업정보 인공지능 검색 시스템은 판매자 단말, 사용자 단말, 빅데이터 상품정보 DB, 실시간으로 정보를 수집하는 크롤러 및 인공지 능서버로 이루어진다. 상기 복수의 판매자 단말은 빅데이터 상품정보 DB에 상점의 정보 및 상품의 정보를 제공하는 온·오프라 인 상점을 모두 포함한다. 이중 온라인 상점의 경우 온라인 상에 등록된 상점 및 상품 정보가 상기 크롤러에 의해 자동으로 수집되어 상기 빅데이터 상품정보 DB에 저장된다. 또한, 오프라인 상점의 경우에는 상기 크롤 러 및/또는 상기 빅데이터 상품정보 DB에 상점 및 상품 정보를 제공한다. 그리고 위치기반 정보를 갖는 상기 사용자 단말은 상기 판매자 단말과 온라인 또는 오프라인을 통해 연결 될 수 있다. 먼저, 오프라인 상점에 설치된 판매자 단말의 상점별 ID가 저장되는 NFC스티커에 사용자 단말 을 태깅하여 연결가능하다. 또한, 상기 빅데이터 상품정보 DB를 통해 상기 사용자 단말로 제공받은 상 품검색정보의 상품정보 상세에서 상점의 '팔로우' 허락으로 상기 오프라인 상점에 연결가능하게 된다. 상기와 같이 사용자 단말이 판매자 단말에 연결되면 상점에 설치된 와이파이, 비콘, NFC 중 어느 하나에 사용자 단말이 자동 페어링 또는 사용자 단말의 인터페이스모듈을 통해 자동 연결되어 상기 오프라인 상점의 상품정보, 이벤트 정보, 할인 또는 무료 쿠폰을 실시간으로 수신할 수 있게 된다. 상기 복수의 사용자 단말에는 인터페이스 모듈이 설치된다. 바람직한 사용자 단말은 스마트폰이나 이에 한정하지는 않는다. 소비자는 상기 인터페이스모듈을 작동하여 사진촬영을 통한 이미지, 음성, 텍스트 중 어 느 하나를 입력값으로 하여 상기 빅데이터 상품정보 DB와의 통신을 통해 상품검색어 및 상품검색어에 따른 검색결과인 상품검색정보를 제공받는다. 이때, 상기 빅데이터 상품정보 DB는 상기 크롤러에 의해 실시간 으로 수집되는 온·오프라인 상점 및 상품 정보를 제공받는다. 그리고 상기 인공지능서버는 상기 사용자 단 말의 인터페이스모듈을 통해 입력되는 상품검색어와, 검색결과인 상품검색정보를 통해 사용자가 선택하여 구매하는 구매상품정보 또는 구매의사가 높은 찜한 상품정보 등을 고려하여 입력된 상품검색어에 최적화된 상품 검색정보를 산출하여 개별 사용자에게 맞춤형으로 정보를 제공한다. 물론 이때, 상기 인공지능서버는 맞춤형 정보를 제공하기 위해 개별 사용자의 특성 뿐만 아니라, 다른 사용자의 인터페이스모듈을 통해 입력된 상품 검색어, 상품검색정보, 구매상품정보 및 찜한 상품정보가 개별 사용자의 맞춤형 정보의 산출을 위해 이용될 수 있다. 도 3은 상기 사용자 단말의 인터페이스모듈을 이용해 이미지로 상품정보를 검색할 경우의 상품검색 개념 도이다. 상기 이미지검색모듈은 사용자 단말의 인터페이스모듈을 작동하여 이미지검색을 선택하면 작동한다. 상기 인터페이스모듈을 통해 쇼윈도우나 대형마트 등에서 상품을 촬영하면, 해당 이미지 파일을 빅데이터 상 품정보 DB로 전송한다. 상품 이미지 파일은 LIRE(Lucene Image Retrieval)모듈을 통해 상기 빅데이터 상품정보 DB에 인덱스화된 데이터를 검색하여 사용자가 촬영한 이미지와 가장 비슷한 상품을 리스트로 전송한다. 여기서, 상기 이미지검색모듈의 설명 중 LIRE모듈을 제외하면, 텍스트 검색에 의한 상품검색정보의 과정과 동일하다. 도 4를 참조하면, 상기 음성검색모듈은 사용자 단말에서 인터페이스모듈을 실행하여 사용자가 인성인 식 버튼을 클릭하거나, 음성을 통해 음성인식 기능을 활성화하여 자연어로 말을 하게 되면, 해당 음성파일을 텍 스트로 변환하여 해당 정보와 유사한 상품을 검색하여 보여주게 된다. 이러한 음성인식기술을 활용하여 대화형 검색 주문까지 가능할 수 있다. 상기 음성검색모듈은 구글의 Cloud Speech API(Application Programming Interface)를 이용해 질의어인 음성파일을 텍스트데이터로 변환한다. 그리고 상기 텍스트데이터는 텍스트추출부에서 단어별로 단순화하여 검색어와 명령어를 추출한다. 상기 텍스트추출부에서 추출된 상기 검색어 및 상기 명령어는 질의어 처리부 에 의해 미리 설정된 명령 DB에서 인지 가능한 질의어인지를 비교한다. 상기 질의어 처리부에서 인 지된 질의는 상기 검색어를 상기 명령어로 상기 인공지능서버를 통해 상기 빅데이터 상품정보 DB에서 검 색하여 그 결과를 응답메시지부에서 사용자에게 메시지로 응답하게 된다. 여기서 상기 응답메시지는 텍스트 이므로 이를 음성파일로 변환하는 Android TTS API(Android Text-To-Speech Application Programming Interface)를 통해 음성파일 형태로 사용자에게 상품검색정보로 제공된다. 또한, 도 5와 같이, 상기 질의어 처리부는 사용자가 사용하는 다양한 자연어인 질의어가 무엇을 목적으로 질의하는지를 판단하여 이에 부합하는 답변을 제공하기 위해 언어인지 기능을 학습하기 위한 것으로, 숫자치환 부(63a), 비교부(63b), 유사어판단부(63c), 유도질의부(63d), 동의어처리부(63f)로 구성될 수 있다. 이렇게 상 기 음성검색모듈이 상기 질의어 처리부와 같은 언어인지 학습 기능을 갖음으로 인해, 상기 음성검색모듈 은 사용자와 대화를 주고받으면서 상품의 주문까지 완료하는 챗봇의 기능까지 수행 가능하게 된다. 상기 숫자치환부(63a)는 사용자의 상기 질의어를 사전학습 알고리즘을 활용하여 유사어를 확률로 판단한다. 이 렇게 상기 숫자치환부(63a)에서 판단된 비교부(63b)에서 상기 질의어는 미리 설정된 명령 DB에 저장된 사전 학습 질의어와 비교과정을 거친다. 상기 비교부(63b)에서 미리 설정된 명령 DB와의 비교 결과는 유사어판단 부(63c)로 전달되는데, 이 유사어판단부(63c)에서 사용자의 상기 질의어가 학습된 질의어인지를 판단하게 된다. 이때, 상기 유사업판부와를 통해 유사어로 인지된 상기 질의어와 하기에서 설명할 유도질의부(63d)를 통해 재답 변된 질의어가 유사어로 인지된 질의어에 대해서는 인지확인부(63e)에서 확인되어 상기 인공지능서버를 통해 상기 빅데이터 상품정보 DB에서 검색하여 그 결과를 응답메시지부로 사용자에게 상품검색정보로 제공된 다. 그러나 상기 유사어판단부(63c)에서 인지하지 못한 질의어는 유도질의부(63d)에 의해 상기 응답메시지부 를 통해 사용자에게 유사도가 높은 유도문장으로 유도질의를 하게 된다. 그리고 상기 유도질의를 통해 재답 변된 답변이 상기 비교부(63b) 및 상기 유사어판단부(63c)를 통해 미리 설정된 상기 명령 DB의 학습된 질의 어로 인지 가능한 질의어인 경우에는 상기 최초 질의어와 상기 유도 질의어인 유도문장을 동의어로 처리하는 동 의어처리부(63f)에서 동의어로 처리한다. 상기 크롤러는 사용자 단말에서 사용자가 상기 인터페이스모듈에 입력한 상기 상품검색어, 상기 빅데 이터 상품정보 DB를 통해 검색결과인 상기 상품검색정보, 그리고 상기 상품검색어 및 상기 상품검색정보를 통한 사용자가 실제로 구매한 구매상품정보와 구매 의사가 반영된 찜한 상품은 물론이거니와, 온·오프라인 상 점 및 상품 정보의 데이터를 실시간으로 수집하여 상기 빅데이터 상품정보 DB에 저장한다. 도 6 및 도 7과 같이, 상기 인공지능서버는 상기 사용자 단말의 인터페이스모듈을 통해 입력된 상품검 색어를 바탕으로 상기 빅데이터 상품정보 DB에 저장된 정보 중 사용자에게 최적화된 상품검색정보를 산출하 여 상기 인터페이스모듈로 전송하는 기능을 수행한다. 여기서 최적화된 상품검색정보라 함은 사용자의 성별, 나이, 지역은 물론, 기존에 상기 인터페이스모듈을 통 해 검색했었던 상품검색어를 바탕으로 확인된 사용자의 상품 선호유형 등을 반영한 것이다. 이는 상기 크롤러 에 의해 사용자의 상품검색어, 상품검색정보, 구매상품정보 및 찜한 상품이 실시간으로 수집되어 저장되기 때문에, 상기 인공지능서버는 이러한 축적된 사용자별 데이터를 바탕으로 사용자마다 개별적으로 최적화된 상품검색정보를 산출하여 상기 인터페이스모듈을 통해 사용자에게 제공할 수 있게 되는 것이다. 이는 동일 검색어 일지라도 상기 인공지능서버가 학습을 통해 사용자 개별로 특성화된 맞춤 상품검색정보를 제공한다는 의미이다. 상기한 기능을 갖는 상기 인공지능서버는 데이터수집부, 상품카테고리부, 선호도분석부, 사용자 그룹부, 최적상품추천부, 및 구매유도부를 포함한다. 먼저, 상기 데이터수집부는 상기 크롤러를 통해 수집된 상기 상품검색어, 상품검색정보, 구매상품정보 및 찜한 상품을 포함하여 상기 인터페이스모듈의 로그정보를 모두 사용자별 데이터로 수집한다. 그리고 상기 데이터수집부에 사용자별 데이터로 수집된 사용자별 데이터는 한 사용자의 것이 아닌, 여러 사용자인 복수 의 사용자별 데이터로, 이 복수의 사용자별 데이터를 수치화하여 유사성이 큰 것을 한데 모아 상품별로 구분하 여 상품카테고리부를 설정한다. 그리고 상기 상품카테고리부를 통해 개별 사용자별로, 특정 사용자가 특정 상품 중 어떤 유형의 상품을 선호하는지를 파악하여 선호도분석부를 설정한다. 그 다음으로 상기 선호 도분석부를 통해 특정 상품에 대한 개별 사용자의 유사한 선호도 범위를 설정하고, 선호도 설정 범위에 따 라 개별 사용자를 그룹화하는 사용자그룹부를 설정한다. 이렇게 개별 사용자가 선호도에 따라 그룹화되면, 최적상품추천부는 특정 사용자가 상기 인터페이스모듈을 통해 상품검색어를 입력할 경우, 상기 특정 사 용자와 동일 그룹에 속한 다른 사용자들이 많이 선택한 상품검색정보를 리스트화하여 상기 특정 사용자의 상품 검색정보로 제공하게 되는 것이다. 또한, 상기 인공지능서버는 사용자의 상품검색어를 통해 상기 최적상품추천부가 제공한 상품검색정보 중 실제 구매가 진행되지는 않았으나, 구매의사가 있어 잠시 구매를 보류하고 있는 찜한 상품에 대해서 사용자의 방문지역을 추적하여 방문지역 오프라인 상점에 사용자의 찜한 상품과 유사한 상품이 등록된 경우, 사용자에게 유사 상품을 보유한 오프라인 상점의 상품정보, 이벤트 정보, 할인 또는 무료 쿠폰 등을 발송하여 찜한 상품의 구매를 유도하는 구매유도부가 구성될 수도 있다."}
{"patent_id": "10-2019-0088044", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 온오프라인 상점의 상품정보 검색시스템의 개념도. 도 2는 본 발명 맞춤형 상업정보 인공지능 검색 시스템 서비스를 위한 전체 구성도. 도 3은 본 발명 이미지검색모듈의 상품검색 개념도.도 4는 본 발명 음성검색모듈의 음성인식 구조도. 도 5는 본 발명 음성검색모듈의 처리 흐름도. 도 6은 본 발명 인공지능서버의 상품분류학습 흐름도. 도 7은 본 발명 인공지능서버의 구성도."}
