{"patent_id": "10-2022-0130427", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0051358", "출원번호": "10-2022-0130427", "발명의 명칭": "인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치", "출원인": "주식회사 램스", "발명자": "정원홍"}}
{"patent_id": "10-2022-0130427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "레이저를 조사하여 스캔함으로써, 철도 건널목 상에 위치하는 장애물에 대한 3차원 영상을 획득하기 위한 데이터를 획득하는 라이다스캐너;상기 장애물에 대한 2차원 영상을 획득하는 카메라;상기 라이다스캐너로부터 획득되는 데이터와 상기 카메라로부터 획득되는 2차원 영상에 대한 딥러닝 처리에 의해 장애물을 추출하는 딥러닝가속기; 및상기 딥러닝가속기로부터 추출되는 장애물에 대한 데이터를 수신받아 철도 건널목 제어기 측으로 제어신호를 전달하는 검지제어부;상기 라이다스캐너로부터 획득되는 데이터와 상기 카메라로부터 획득되는 2차원 영상으로부터 AI 기반의 증강현실을 구현하는 증강현실구현부; 상기 증강현실구현부로부터 구현되는 증강 현실을 증강현실단말기에 무선으로 제공하도록 하는 무선통신부;상기 라이다스캐너로부터 상기 장애물에 대한 거리 측정용 데이터를 전달받아, 상기 장애물에 대한 거리를 산출하고, 상기 철도 건널목 제어기 또는 상기 무선통신부를 통해서 상기 증강현실단말기에 제공하는 거리산출부;를 포함하는, 인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치."}
{"patent_id": "10-2022-0130427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 라이다스캐너, 상기 카메라 및 상기 딥러닝가속기는,철도 선로 개수 각각에 대응하도록 설치되는 함체마다 각각 내장되도록 설치되고, 상기 라이다스캐너는,상기 레이저의 스캐닝을 위한 수평시야각이 120~160°임과 아울러, 수직시야각이 20~40°이고,상기 검지제어부는,상기 딥러닝가속기로부터 유선 또는 무선에 의해 데이터를 제공받도록 상기 철도 건널목 제어기 측에 설치되는,인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치."}
{"patent_id": "10-2022-0130427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,철도 건널목의 차단기 이상 여부를 검지하기 위한 차단기검지부를 더 포함하고,상기 거리산출부는,상기 라이다스캐너로부터 차단기 끝단에 대한 거리를 산출하고,상기 차단기검지부는,상기 철도 건널목 제어기로부터 상기 차단기가 건널목 횡단을 차단하도록 하강하기 위한 제어신호 출력을 감지시, 상기 거리산출부로부터 상기 차단기 끝단의 거리 정보를 제공받고, 상기 거리 정보가 설정된 최소 범위에해당하지 않는 경우, 그리고, 상기 철도 건널목 제어기로부터 상기 차단기가 건널목 횡단을 가능하게 하도록 상승하기 위한 제어신호 출력을 감지시, 상기 거리산출부로부터 상기 차단기 끝단의 거리 정보를 제공받고, 상기거리 정보가 설정된 최대 범위에 해당하지 않는 경우, 상기 철도 건널목 제어기에 차단기의 고장 신호를 전달하는,인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치. 공개특허 10-2024-0051358-3-"}
{"patent_id": "10-2022-0130427", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 레이저를 조사하여 스캔함으로써, 철도 건널목 상에 위치하는 장애물에 대한 3차원 영상을 획득하기 위한 데이터를 획득하는 라이다스캐너; 상기 장애물에 대한 2차원 영상을 획득하는 카메라; 상기 라이다스캐너로 부터 획득되는 데이터와 상기 카메라로부터 획득되는 2차원 영상에 대한 딥러닝 처리에 의해 장애물을 추출하는 (뒷면에 계속)"}
{"patent_id": "10-2022-0130427", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 철도 건널목 전자식 제어기를 위한 영상 융합형 신호처리 검지장치에 관한 것으로서, 보다 상세하게 는 철도 건널목 전자식 제어기 운용을 위한 인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에 관 한 것이다."}
{"patent_id": "10-2022-0130427", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 철도 건널목 등에는 안전을 위한 차단장치 및 경고등이 설치되어 있으나, 보행자의 부주의로 인하 여, 건널목 상에 존재 가능한 위험 요소로 인하여 안전한 열차의 운행에 지장을 초래할 뿐만 아니라, 건널목 보 행자나 운행자의 생명을 위험하게 하고 있는 실정이다. 이러한 철도 건널목에서 열차가 통과할 때 발생할 수 있는 장애물을 레이저빔을 이용하여 측정할 수 있도록 하 고 있으며, 이와 관련되는 종래 기술로서, 한국등록특허 제10-1040324호의 \"철도 건널목 감시 시스템 및 그 제 어방법\"이 제시된 바 있다. 이는 철도 건널목 감시 시스템에 있어서, 철도 건널목상에 진입한 위험요소를 감지 하는 감지 센서를 구비하여 센서 수단; 상기 센서 수단이 위험요소를 감지하면 철도 건널목의 상황을 촬영하여 영상정보를 획득하는 영상 획득 수단; 상기 센서 수단의 감지 정보를 다중화 통신을 통해 상기 센서수단으로부 터 철도 건널목상 위험요소 감지 정보를 수집하는 센서 정보 수집 모듈, 상기 센서 노드간의 인터페이스를 담당 하는 제1 인터페이스 모듈, 상기 센서 노드의 유지보수를 수행하는 센서 유지 보수 모듈 및 상기 센서 노드간의 정보처리 및 제어를 수행하는 정보처리 및 제어 모듈을 구비하여 수집하는 센서 노드; 상기 센서 노드로부터 감 지 정보를 다중화 통신을 통해 수신하여 전송하는 다수개의 게이트웨이; 및 상기 게이트웨이로부터 전송받은 위 험요소 정보와 상기 영상 획득 수단으로부터 전송받은 영상 정보를 통해 상황 분석 데이터를 생성하고 분석하여, 상기 철도 건널목을 제어하고 모니터링하는 중앙 시스템;을 포함하고, 감지 센서는 레이저가 사용될 수 있다. 그러나, 이와 같은 종래 기술은 기존의 철도 건널목에서 장애물을 감지하기 위하여, 발광부와 수광부가 분리된 레이저빔 방식을 사용함으로써, 기술적인 특성상 사각지대가 존재하여 검지영역에 한계가 있고, 노후화에 따른 잦은 오작동 발생으로 유지 및 보수에 많은 시간과 비용이 과다하게 소요되는 문제점을 가지고 있었다."}
{"patent_id": "10-2022-0130427", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기한 바와 같은 종래 기술의 문제점을 해결하기 위하여, 본 발명은 발광부와 수광부가 일체화되어 안정적이면 서 건널목 검지영역 전 구간을 스캐닝할 수 있는 라이다(LiDAR) 스캐닝 데이터와 카메라 영상을 동기화 후, AI 기반 증강현실로 출력하고, 이로 인해, 철도 건널목에 대한 장애물의 검지 및 안전 파악의 정확성을 높이며, 정 확한 거리 정보를 포함한 장애물의 크기 및 형태를 선명한 영상과 함께 제공하고, 이로 인해 검지 정보의 신뢰 성을 확보하여 지능적인 건널목 안전성을 제공하는데 목적이 있다. 본 발명의 다른 목적들은 이하의 실시례에 대한 설명을 통해 쉽게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0130427", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위해, 본 발명의 일측면에 따르면, 레이저를 조사하여 스캔함으로써, 철도 건널목 상에 위치하는 장애물에 대한 3차원 영상을 획득하기 위한 데이 터를 획득하는 라이다스캐너; 상기 장애물에 대한 2차원 영상을 획득하는 카메라; 상기 라이다스캐너로부터 획득되는 데이터와 상기 카메라로부터 획득되는 2차원 영상에 대한 딥러닝 처리에 의 해 장애물을 추출하는 딥러닝가속기; 및 상기 딥러닝가속기로부터 추출되는 장애물에 대한 데이터를 수신받아 철도 건널목 제어기 측으로 제어신호를 전 달하는 검지제어부;상기 라이다스캐너로부터 획득되는 데이터와 상기 카메라로부터 획득되는 2차원 영상으로부터 AI 기반의 증강 현실을 구현하는 증강현실구현부; 상기 증강현실구현부로부터 구현되는 증강 현실을 증강현실단말기에 무선으로 제공하도록 하는 무선통신부; 상기 라이다스캐너로부터 상기 장애물에 대한 거리 측정용 데이터를 전달받아, 상기 장애물에 대한 거리를 산출 하고, 상기 철도 건널목 제어기 또는 상기 무선통신부를 통해서 상기 증강현실단말기에 제공하는 거리산출부; 를 포함하는, 인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치가 제공된다. 상기 라이다스캐너, 상기 카메라 및 상기 딥러닝가속기는, 철도 선로 개수 각각에 대응하도록 설치되는 함체마 다 각각 내장되도록 설치되고, 상기 라이다스캐너는, 상기 레이저의 스캐닝을 위한 수평시야각이 120~160°임과 아울러, 수직시야각이 20~40°이고, 상기 검지제어부는, 상기 딥러닝가속기로부터 유선 또는 무선에 의해 데이 터를 제공받도록 상기 철도 건널목 제어기 측에 설치될 수 있다. 철도 건널목의 차단기 이상 여부를 검지하기 위한 차단기검지부를 더 포함하고, 상기 거리산출부는, 상기 라이 다스캐너로부터 차단기 끝단에 대한 거리를 산출하고, 상기 차단기검지부는, 상기 철도 건널목 제어기로부터 상 기 차단기가 건널목 횡단을 차단하도록 하강하기 위한 제어신호 출력을 감지시, 상기 거리산출부로부터 상기 차 단기 끝단의 거리 정보를 제공받고, 상기 거리 정보가 설정된 최소 범위에 해당하지 않는 경우, 그리고, 상기 철도 건널목 제어기로부터 상기 차단기가 건널목 횡단을 가능하게 하도록 상승하기 위한 제어신호 출력을 감지 시, 상기 거리산출부로부터 상기 차단기 끝단의 거리 정보를 제공받고, 상기 거리 정보가 설정된 최대 범위에 해당하지 않는 경우, 상기 철도 건널목 제어기에 차단기의 고장 신호를 전달할 수 있다."}
{"patent_id": "10-2022-0130427", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에 의하면, 발광부와 수광부가 일 체화되어 안정적이면서 건널목 검지영역 전 구간을 스캐닝할 수 있는 라이다(LiDAR) 스캐닝 데이터와 카메라 영 상을 동기화 후 AI 기반 증강현실로 출력할 수 있고, 이로 인해, 철도 건널목에 대한 장애물의 검지 및 안전 파 악의 정확성을 높일 수 있으며, 정확한 거리 정보를 포함한 장애물의 크기 및 형태를 선명한 영상과 함께 제공 할 수 있고, 이로 인해 검지 정보의 신뢰성을 확보하는 효과를 가진다."}
{"patent_id": "10-2022-0130427", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고, 여러 가지 실시례를 가질 수 있는 바, 특정 실시례들을 도면에 예시하 고, 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니고, 본 발명의 기술 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 식으로 이해되어야 하고, 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 하기 실시례에 한정되는 것은 아니다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 실시례를 상세히 설명하며, 도면 부호에 관계없이 동일하거나 대 응하는 구성요소에 대해서는 동일한 참조 번호를 부여하고, 이에 대해 중복되는 설명을 생략하기로 한다. 도 1은 본 발명의 일 실시례에 따른 인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장를 도시한 구성 도이다. 도 1을 참조하면, 본 발명의 일 실시례에 따른 인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치 는 라이다스캐너, 카메라, 딥러닝가속기 및 검지제어부를 포함할 수 있다. 라이다스캐너는 레이저를 조사하여 스캔함으로써, 철도 건널목 상에 위치하는 장애물에 대한 3차원 영상을 획득하기 위한 데이터를 획득하도록 한다. 라이다스캐너는 예컨대, 전방으로 조사되는 레이저를 수평방향으 로 스캔하여, 존재하는 장애물과의 거리 측정을 통해 2차원공간의 영상을 구현할 수 있도록 하고, 스캔 영역을 상하로 가변시킴으로써, 2차원공간의 영상을 상하 방향으로 다수로 획득하도록 하게 해준다. 따라서, 후술하게 될 딥러닝가속기에 의해, 라이다스캐너를 통해서 얻어지는 2차원공간의 영상을 상하로 적층함으로써, 3 차원공간의 형상을 구현하도록 할 수 있다. 카메라는 철도 건널목 상의 장애물에 대한 2차원 영상을 획득하도록 한다. 딥러닝가속기는 라이다스캐너로부터 획득되는 데이터와 카메라로부터 획득되는 2차원 영상에 대한 딥러닝 처리에 의해 장애물을 추출하도록 한다. 딥러닝가속기는 예컨대, 도 2에서와 같이, 라이다스캐너 로부터 3차원 포인트 클라우드 데이터를 획득한다(S11). 3차원 포인트 클라우드는 3차원 공간상에 퍼져 있 는 여러 포인트(Point)의 집합(set cloud)를 의미한다. 딥러닝가속기는 이러한 3차원 포인트 클라우드 데이 터를 클러스터링하고(S12), 포인트 대상에 대한 거리 산출을 수행할 수 있다(S13). 그리고, 딥러닝가속기는 카메라로부터 이미지를 획득하고(S14), 이미지디텍터에 의해 이미지 대상을 획득하여(S15), 획득되는 이미 지 대상과 3D 대상의 융합(S16)을 통해서 대상 검지, 즉 장애물 검지(S17)를 수행하게 된다. 여기서 융합은 3D 대상의 영역 중에서 매칭되는 2D 이미지를 합성하는 것을 의미할 수 있다. 따라서, 딥러닝가속기는 카메라 의 2D 이미지를 라이다스캐너의 3D 대상 영역 중에서 매칭되는 영역에 일치하도록 추출하여 합성시킬 수 있다. 매칭 여부는 획득 내지 촬영 방향과 외형을 통해서 결정될 수 있으나, 이에 반드시 한하는 것은 아니 며, 2D와 3D 영상의 다양한 융합 방법이 사용될 수 있다. 딥러닝가속기는 도 3에서와 같이, CNN 객체 인식을 위해 단일 딥러닝 네트워크 기반 장애물 검출 알고리즘 을 구현할 수 있고, YOLO v3 기반 디자인이 적용될 수 있는데, 여기서, Classification과 Regression을 단일 네트워크로 처리하고, 객체 분류 및 위치 탐지를 실시간 처리하는 딥러닝 API를 가지며, Darknet53 Backbone 연 산의 기준 해상도 변경 및 처리 속도 확보를 가능하도록 한다. 또한 딥러닝가속기는 도 4에서와 같이, CNN(convolutional neural network) 레이어(layer) 하드웨어 로직을 가질 수 있으며, 도 5에서 Convolution과 Pooling layer의 파라미터를 나타낸 바와 같다. 도 6 및 도 7을 참조하면, 모든 레이어 템플릿은 CNN 모델에 정확하게 맞도록 효율적인 하드웨어 리소스 활용을 위해 쉽게 매개 변수화할 수 있도록 설계된다. iFMn, iFMw, iFMh는 Input feature map의 수, 너비 및 높이, 그 리고 kw, kh, st는 커널의 너비, 높이, stride이고, oFMn, oFMw, oFMh는 Output feature map의 숫자, 너비, 높 이이다. Loop Unrolling 최적화는 Pkw = Pkh = Pin = 1의 Unrolling 계수를 사용하여 Convolution loop 최적화를 가능하도록 한다. Convolution 구현 체계에 있어서, Kernel Convolution 작업은 내부 데이터 이동 방식으로 수행하고, 컨볼루션 회로는 Input feature map을 펼쳐 스트리밍 동작으로 Input feature map을 계산하도록 설계 될 수 있다. Convolutional Layer 구성에 있어서, Output feature map은 외부 메모리 DRAM에 저장되고, FPGA의 리소스를 사용하여 다양한 입력 이미지 크기로 깊은 CNN 모델을 생성할 수 있다. Pooling Layer 구성에 있어서, MainFSM이 풀링 레이어(PL)를 실행하면, 풀링 레이어는 픽셀 버퍼에서 iFMnХiFMwХiFMh 픽셀을 순차적으로 읽 어, Convolution 회로에 해당 구성 크기로 스트리밍 처리할 수 있다. 도 8에서 도시된 바와 같이, Fully Connected Layer 구성을 나타내는데, 여기서, Pnn은 병렬 뉴런 노드 수를 나 타낸다. 또한 도 9에서 도시된 바와 같이, Softmax 활성화를 나타내는데, 여기서, iNN은 Fully Connected Layer의 뉴런 노드 수를 나타낸다. 도 10을 참조하면, 모듈 별로 하드웨어와의 동작을 확인하기 위한 검증용 프로파일링(profiling) 기능을 구현할 수 있는데, 이를 위해, 각 레이어 별 입력, 출력 정보를 로그 파일로 생성하고, 각 레이어 별 가중치 및 파라미 터 정보를 파일로 생성하며, 핵심 CNN 연산의 각 단계별 RTL 모델 간 데이터를 검증하게 된다. 네트워크 구조의 변경에도 높은 성능을 확보할 수 있는 2단계 학습 방법론이 제시될 수 있는데, 검출기 네트워크를 특징 추출 레 이어(Feature Extraction Layer)와 검출 레이어(Detection Layer : Classification + Detection)로 분리하여 학습을 진행할 수 있다. 이 경우, 1단계는 특징 추출 레이어의 학습이 ImageNet 2012 데이터베이스(약 120만 장)에 대하여 진행하여 파라미터를 도출하고, 2단계는 검출 레이어의 학습이 1단계를 통해 확보한 특징 추출 레 이어에 검출 레이어를 추가하여 자체제작(약 2만장) 데이터베이스를 혼합하여 재학습을 진행해 최종 파라미터를 도출할 수 있다. 검지제어부는 딥러닝가속기로부터 추출되는 장애물에 대한 데이터를 수신받아 철도 건널목 제어기 측으로 제어신호를 전달하도록 한다. 또한 검지제어부는 외부로부터 수신되는 조작부(미도시)의 조작 신호 에 따라 검지 영역의 설정을 가능하도록 할 수 있다. 또한 검지제어부는 딥러닝가속기와 제어모듈 간의 연동 통신체계를 도 11에 나타낸 바와 같다. 이 경우, 열차 진입 개시 알림, 데이터 요구 시작, 전송 종료 알림은 검지제어부로부터 딥러닝가속기 측으로 전달될 수 있다. 수신 응답, 검지 데이터 및 고장 데이 터는 딥러닝가속기로부터 검지제어부 측으로 전달될 수 있다. 한편, 철도 건널목 제어기는 기능감시부 및 고장통신부가 스위칭부에 연결되고, 외부의 전원공 급부로부터 동작 전원이 스위칭부로 제공된다. 유지보수부단말기는 GPS I/F모듈이 연결되며, 보 수부디스플레이부를 가지며, 제어표시부의 제어모듈이 연결된다. 제어모듈은 입력부와 출 력부를 가지는 계전기부에 연결된다. 제어모듈은 출력부를 통해 차단기, 경보등 및 방향 표시등의 동작을 각각 제어한다. 제어표시부는 보수부디스플레이에 대한 고장 정보를 제공하는 고장 검지송신모듈, 지장경고등의 동작을 제어하는 지장경고등모듈, 경고/문자등의 동작을 제어하는 동/종모듈, 음성/혼스피커의 동작을 제어하는 음성/혼모듈, 정보설정을 위한 정보설정모듈, 전 원공급부로부터 전원을 제공받아 동작에 필요한 전원으로 변환하여 공급하는 전원모듈을 포함할 수 있고, 이들 각각이 제어모듈에 의해 제어될 수 있다. 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치는 증강현실구 현부 및 무선통신부, 그리고 거리산출부를 더 포함할 수 있으며, 나아가서 차단기검지부를 더 포함할 수 있다. 증강현실부는 라이다스캐너로부터 획득되는 데이터와 카메라로부터 획득되는 2차원 영상으로부터 AI 기반의 증강 현실을 구현하도록 하는데, 이러한 증강 현실의 구현을 위해 기존의 알려진 기술이 사용될 수 있음은 물론이다. 무선통신부는 증강현실구현부로부터 구현되는 증강 현실을 증강현실단말기(미도시)에 무선으로 제공하 도록 한다. 따라서, 관리자 또는 사용자는 증강현실단말기를 통해서 Wi-FI, 3G, LTE 또는 5G 등의 무선통신 방 식을 이용하여 제공되는 증강 현실로부터 철도 건널목 상에서의 장애물 구조 및 크기 등을 쉽게 파악할 수 있도 록 한다. 거리산출부는 라이다스캐너로부터 장애물에 대한 거리 측정용 데이터를 전달받아, 장애물에 대한 거리 를 산출하고, 철도 건널목 제어기 또는 무선통신부를 통해서 증강현실단말기(미도시)에 제공할 수 있다. 철도 건널목 제어기는 거리산출부로부터 제공되는 장애물에 대한 거리를 통해서 장애물이 열차에 대한 충돌을 야기할지 또는 장애물의 이동 여부 등에 따라 경보 발생이나 후속 조치를 취할 수 있도록 정해진프로세스를 수행하도록 구성될 수 있다. 증강현실단말기는 거리산출부로부터 제공되는 장애물에 대한 거리 를 디스플레이되는 증강 현실의 장애물에 매칭되어 디스플레이되도록 함으로써, 장애물에 대한 위치를 인지하도 록 할 수 있다. 거리산출부는 라이다스캐너의 레이저 출력소자로부터 출사되어 장애물에 반사된 레이저를 센서부가 감 지할 때, 레이저 출력소자로부터 레이저가 출력된 시간과 장애물에 반사된 레이저가 센서부에 감지된 시간을 확 인함으로써, 출사된 레이저와 감지된 레이저의 시간차이인 비행시간(Time Of Flight; TOF)을 이용하여, 장애물 과의 거리 측정을 수행하게 된다. 라이다스캐너, 카메라 및 딥러닝가속기는 철도 선로 개수 각각에 대응하도록 설치되는 함체마 다 각각 내장되도록 설치될 수 있다. 따라서, 예를 들면, 도 12에서와 같이, 복선 철도인 경우, 복선 철동의 양 측에 각각 배치되도록 2개의 함체가 설치될 수 있다. 여기서, 라이다스캐너는 예컨대, 레이저의 스캐닝 을 위한 수평시야각이 120~160°임과 아울러, 수직시야각이 20~40°일 수 있다. 검지제어부는 딥러닝가속기 로부터 유선 또는 무선에 의해 데이터를 제공받도록 철도 건널목 제어기 측에 설치될 수 있다. 차단기검지부는 철도 건널목의 차단기 이상 여부를 검지하기 위한 것이다. 여기서, 거리산출부는 라 이다스캐너로부터 차단기 끝단에 대한 거리를 산출하도록 하는데, 이를 위해 라이다스캐너가 차단기 끝단이 향하는 측에 위치함으로써, 스캐닝시 차단기에서 가장 가까운 끝단에 대한 레이저의 조사시간과 레이저의 반사후 도달시간으로부터 차단기 끝단에 거리를 산출하도록 할 수 있다. 한편, 차단기의 끝단에 는 거리산출부에 의한 거리 측정이 용이하도록 레이저 반사 및 거리 검출에 유리한 부가 구조물이 부착될 수도 있다. 차단기검지부는 철도 건널목 제어기, 예컨대 제어모듈로부터 차단기가 건널목 횡단을 차단하도 록 하강하기 위한 제어신호 출력을 감지시, 거리산출부로부터 차단기 끝단의 거리 정보를 제공받고, 거 리 정보가 설정된 최소 범위에 해당하지 않는 경우, 그리고, 철도 건널목 제어기의 제어모듈로부터 차 단기가 건널목 횡단을 가능하게 하도록 상승하기 위한 제어신호 출력을 감지시, 거리산출부로부터 차단 기 끝단의 거리 정보를 제공받고, 거리 정보가 설정된 최대 범위에 해당하지 않는 경우, 철도 건널목 제어기 의 제어모듈에 차단기의 고장 신호를 전달하도록 할 수 있다. 여기서, 설정된 최소 범위는 차단기 가 하강함으로써, 라이다스캐너로부터 차단기 끝단과의 가까워진 거리가 포함되는 거리값의 범위일 수 있고, 설정된 최대 범위는 차단기가 상승함으로써, 라이다스캐너로부터 차단기 끝단과의 멀어진 거리가 포함되는 거리값의 범위일 수 있다. 따라서, 차단기 끝단과의 상대적인 거리 변화를 통해서 차단기 의 위치를 판단함으로써 차단기의 고장 여부를 손쉽게 파악할 수 있도록 한다. 이와 같은 본 발명에 따른 인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에 따르면, 발광부와 수광부가 일체화되어 안정적이면서 건널목 검지영역 전 구간을 스캐닝할 수 있는 라이다(LiDAR) 스캐닝 데이터 와 카메라 영상을 동기화 후 AI 기반 증강현실로 출력할 수 있고, 이로 인해, 철도 건널목에 대한 장애물의 검 지 및 안전 파악의 정확성을 높일 수 있다. 이와 같이 본 발명에 대해서 첨부된 도면을 참조하여 설명하였으나, 본 발명의 기술적 사상을 벗어나지 않는 범 위 내에서 다양한 수정 및 변형이 이루어질 수 있음은 물론이다. 그러므로, 본 발명의 범위는 설명된 실시례에 한정되어서는 아니되며, 후술하는 특허청구범위뿐만 아니라 이러한 특허청구범위와 균등한 것들에 의해 정해져 야 한다."}
{"patent_id": "10-2022-0130427", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치를 도시한 구성도이다. 도 2는 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 장애물 에 해당하는 대상을 검지하는 과정을 나타낸 흐름도이다. 도 3은 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 YOLO v3 Darknet53 backbone network를 나타낸다. 도 4는 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 CNN accelerator 블록도이다. 도 5는 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 Convolution과 Pooling layer의 파라미터이다 도 6은 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 Convolution layer Processing Element(PE) architecture를 나타낸다. 도 7은 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 Pooling layer Processing Element(PE) architecture를 나타낸다. 도 8은 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 Fully connected layer 구성 파라메터를 나타낸다. 도 9는 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 Softmax 활성화 기능을 나타낸다.도 10은 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 모듈 단위검증 및 객체검출 결과 확인 SW 구조를 나타낸다. 도 11은 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치과의 철도 건널목 제어기와의 연동 통신 체계를 나타낸 흐름도이다. 도 12는 본 발명의 일 실시례에 따른 3인공지능 기반 라이다와 2차원 영상 융합형 신호처리 검지장치에서 함체 의 설치를 나타낸 이미지이다."}
