{"patent_id": "10-2023-0187196", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0052923", "출원번호": "10-2023-0187196", "발명의 명칭": "전자 장치", "출원인": "삼성전자주식회사", "발명자": "김승훈"}}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(600)에 있어서,상면, 상기 상면에 반대되는 하면 및 상기 상면과 상기 하면을 감싸는 측면을 포함하는 하우징(610);상기 하우징(610)의 상기 상면에 배치된 디스플레이(330);상기 하우징(610)의 내부에 배치된 브라켓(670);상기 하우징(610)과 상기 브라켓(670) 사이에 배치된 인쇄회로기판(620);상기 인쇄회로기판(620)의 상기 디스플레이(330)에 마주하는 일면 상에 배치된 제1 전자 부품(630);상기 제1 전자 부품(630)을 감싸도록 배치된 제1 쉴드캔(650);상기 브라켓(670)의 일부 및 상기 제1 쉴드캔(650)과 중첩되고, 상기 제1쉴드캔(650) 및 상기 디스플레이(330)사이에 배치된 방열 부재(680); 및상기 방열 부재(680)의 일 영역 상에 배치되어 상기 방열 부재(680)를 상기 제1 쉴드캔(650)에 고정하도록 배치된 커버 플레이트(690);를 포함하는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 커버 플레이트(690)는 상기 제1 쉴드캔(650)에 대응하는 부분에 배치되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 커버 플레이트(690)는,상기 제1 쉴드캔(650)과 대응되는 커버부(691);제1 측에 형성된 제1 고정부(692),상기 제1 측과 반대되는 제2 측에 형성된 제2 고정부(693);를 포함하는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 제1 고정부(692)는 상기 브라켓(670)에 고정되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 제2 고정부(693)는 상기 하우징(610)에 고정되는,전자 장치.공개특허 10-2025-0052923-3-청구항 6 제5 항에 있어서,상기 제2 고정부(693)는 홀(694)을 포함하고,상기 하우징(610)은 상기 홀(694)과 대응되는 부분에 형성된 스크류 홈(612)을 포함하고,스크류(695)가 상기 스크류 홀(694)을 관통하여 상기 스크류 홈(612)에 결합되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2 항에 있어서,상기 방열 부재(680)는,상기 커버 플레이트(690) 전체 및 상기 브라켓(670)의 적어도 일부와 중첩되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2 항에 있어서,상기 방열 부재(1210)는,상기 커버 플레이트(690)와 중첩되는 제1 부분(1211),상기 브라켓(670)과 중첩되는 제2 부분(1212), 및상기 제1 부분(1211)과 상기 제2 부분(1212)의 사이에 배치된 밴딩부(1213);를 포함하고,상기 제1 부분(1211)은 제1 높이에 대응하도록 배치되고,상기 제2 부분(1212)은 상기 제1 높이보다 높은 제2 높이에 대응하도록 배치되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 커버 플레이트(690)의 상면은 상기 방열 부재(1210)의 상면의 높이와 같거나 낮은 높이에 위치하는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,제2 전자 부품(1310)을 감싸도록 배치된 제2 쉴드캔(1350)을 더 포함하고,상기 방열 부재(1210)는 상기 제2 쉴드캔(1350)과 중첩되도록 배치되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치(1600)에 있어서,상면, 상기 상면에 반대되는 하면 및 상기 상면과 상기 하면을 감싸는 측면을 포함하는 하우징(610);상기 하우징(610)의 상기 상면에 배치된 디스플레이(330);상기 하우징(610)의 내부에 배치된 브라켓(670);공개특허 10-2025-0052923-4-상기 하우징과 상기 브라켓(670) 사이에 배치된 인쇄회로기판(620);상기 인쇄회로기판(620)의 상기 디스플레이(330)에 마주하는 일면 상에 배치된 제1 전자 부품(630) 및 제2 전자부품(1640);상기 제1 전자 부품(630)을 감싸도록 배치된 쉴드캔(650);상기 쉴드캔(650)의 상부를 덮도록 배치되는 차폐 시트(660);상기 제2 전자 부품(1640)을 감싸도록 배치된 쉴드 부재(1650); 및상기 브라켓(670)의 일부, 상기 쉴드캔(650), 및 상기 쉴드 부재(1650)와 중첩되고, 상기 디스플레이(330)의 하부에 배치된 커버 플레이트(1690);를 포함하는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 커버 플레이트(1690)를 상기 차폐 시트(660)에 부착하는 제1 접착 부재(1610),상기 커버 플레이트(1690)를 상기 브라켓(670)에 부착하는 제2 접착 부재(1620), 및상기 커버 플레이트(1690)를 상기 쉴드 부재(1650)에 부착하는 제3 접착 부재(1630);를 더 포함하는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 커버 플레이트(1690)는 상기 쉴드캔(650)의 일부 또는 전체와 대응되는 부분에 배치되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12 항에 있어서,상기 커버 플레이트(1690)는 상기 쉴드 부재(1650)의 일부 또는 전체와 대응되는 부분에 배치되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항 또는 제14 항에 있어서,상기 커버 플레이트(1690)는,상기 쉴드캔(650), 및 상기 쉴드 부재(1650)와 대응되는 커버부(1691),제1 측에 형성된 제1 고정부(1692),상기 제1 측과 반대되는 제2 측에 형성된 제2 고정부(1693);를 포함하는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15 항에 있어서,상기 제1 고정부(1692)를 상기 하우징에 고정하는 제1 스크류(1710), 및상기 제2 고정부(1693)를 상기 하우징에 고정하는 제2 스크류(1720)를 포함하는,전자 장치.공개특허 10-2025-0052923-5-청구항 17 제16 항에 있어서,상기 제1 고정부(1692)는 제1 스크류 홀을 포함하고,상기 하우징(610)은 상기 제1 스크류 홀과 대응되는 부분에 형성된 제1 스크류 홈(6103)을 포함하고,상기 제1 스크류(1710)가 상기 제1 스크류 홀을 관통하여 상기 제1 스크류 홈(6103)에 결합되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서,상기 제2 고정부(1693)는 제2 스크류 홀을 포함하고,상기 하우징(610)은 상기 제2 스크류 홀과 대응되는 부분에 형성된 제2 스크류 홈(6104)를 포함하고,상기 제2 스크류(1720)가 상기 제2 스크류 홀을 관통하여 상기 제2 스크류 홈(6104)에 결합되는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18 항에 있어서,상기 커버 플레이트(1690)의 상면과 상기 브라켓(670)의 상면은 실질적으로 동일한 높이에 위치하는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서,상기 인쇄회로기판에 배치되는 전자 부품(830), 상기 전자 부품(830)을 감싸도록 배치되는 제2 쉴드캔(810), 및제2 차폐 시트(820)를 더 포함하는,전자 장치."}
{"patent_id": "10-2023-0187196", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 전자 장치는, 상면, 상기 상면에 반대되는 하면 및 상기 상면과 상기 하면을 감싸 는 측면을 포함하는 하우징, 상기 하우징의 상기 상면에 배치된 디스플레이; 상기 하우징의 내부에 배치된 브라 켓; 상기 하우징과 상기 브라켓 사이에 배치된 인쇄회로기판; 상기 인쇄회로기판의 상기 디스플레이에 마주하는 일면 상에 배치된 제1 전자 부품; 상기 제1 전자 부품을 감싸도록 배치된 제1 쉴드캔; 상기 브라켓의 일부 및 상 기 제1 쉴드캔과 중첩되고, 상기 제1쉴드캔 및 상기 디스플레이 사이에 배치된 방열 부재; 및 상기 방열 부재의 일 영역 상에 배치되어 상기 방열 부재를 상기 제1 쉴드캔에 고정하도록 배치된 커버 플레이트를 포함할 수 있다. 그 밖에 다양한 실시 예들이 가능할 수 있다."}
{"patent_id": "10-2023-0187196", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(disclosure)의 실시 예들은 전자 부품들(예: 프로세서, IC(integrated circuit), 메모리)에서 발생하 는 열을 방열하기 위한 커버 플레이트(예: 금속 플레이트)를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0187196", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는, 예를 들어, 가전제품, 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC, 영상/ 음향 장치, 데스크톱/랩톱 컴퓨터, 또는 차량용 내비게이션과 같이 탑재된 프로그램에 따라 지정된 기능을 수행 하는 장치를 의미할 수 있다. 전자 장치는 점차 슬림화 되어가고 있으며, 강성이 증가되고, 디자인적 측면이 강 화됨과 동시에 그 기능적 요소가 차별화되기 위하여 개발되고 있다. 전자 장치는 전자 부품들(예: 프로세서, IC(integrated circuit), 메모리)과 주변 회로들이 배치되는 적어도 하 나의 인쇄회로기판(PCB: printed circuit board), 및/또는 PBA: printed board assembly)를 포함할 수 있다. 전자 장치는 프로세서(예: 어플리케이션 프로세서)와 전자 부품들에서 발생되는 노이즈(예: 전자기파)를 차폐하 기 위한 차폐 부품(예: 차폐 부재)들을 포함할 수 있다. 전자 장치는 프로세서와 전자 부품들에서 발생되는 열 을 배출(예: 방열)하기 위한 열 전달 부재(예: TIM(thermal interface material), 열 확산 부재, 열 확산 플레 이트)를 포함할 수 있다. 위에서 기재된 내용들은 본 개시의 실시 예들의 이해를 돕기 위한 배경 정보로서만 제공된다. 위의 내용 중 어 느 것이 본 개시와 관련하여 선행 기술로 적용될 수 있는지 여부에 대한 결정이 내려지지 않았으며, 어떠한 주 장도 이루어지지 않았다. 전자 장치에는 단위 면적당 전력 사용량(예: 전력 밀도(power density))이 높은 프로세서와 전자 부품들이 적용 되고 있다. 단위 면적당 전력 사용량이 높은 프로세서와 전자 부품들이 한정된 면적의 인쇄회로기판들(PCBs, PBAs)에 배치되어 전자 장치에서 발열이 발생할 수 있다. 전자 장치의 발열 온도가 높아짐으로 인해, 전자 장치 의 성능이 저하되거나, 프로세서와 전자 부품들의 수명이 줄어들 수 있다. 높아진 발열 온도로 인하여 전자 장 치의 외부 표면의 온도가 상승하여, 사용자에게 불편함을 줄 수 있다. 전자 장치의 전자 부품들에서 발생하는 열을 방열하기 위해서, 열 전달 부재(예: TIM, 방열 플레이트, 열 확산 부재, 열 확산 플레이트)를 적용할 수 있다. 전자 장치의 부품들에서 발생하는 노이즈(예: 전자기파)를 차폐하기 위해서, 금속 재질의 프레임(예: 금 속 플레이트), 및 프로세서와 전자 부품들을 둘러싸는 쉴드캔(shieldcan)을 적용할 수 있다. 디스플레이에 힘이 가해지면, 디스플레이의 성능에 영향을 주고 파손이 발생할 수 있어, 디스플레이 영역으로 프로세서에서 발생한 열의 방열 패스를 형성하는 것에 제약이 있다. 이로 인해, 쉴드캔을 이용하여 프로세서에서 발생되는 열을 방열 하게 되는데, 쉴드캔의 면적이 한정됨으로 프로세서에서 발생하는 열을 효과적으로 방열할 수 없다. 본 개시의 실시 예는, 전자 장치에 배치된 프로세서에서 발생된 열을 효과적으로 방열할 수 있는 전자 장치를 제공할 수 있다. 본 개시의 실시 예는, 전자 장치에 배치된 전자 부품들에서 발생된 열을 효과적으로 방열할 수 있는 전자 장치 를 제공할 수 있다. 본 개시의 실시 예는, 쉴드캔의 차폐 시트 상에 방열 부재(예: 방열 플레이트, 방열 시트)를 배치하고, 방열 부 재(예: 방열 플레이트, 방열 시트) 상에 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 배치할 수 있다. 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 방열 부재(예: 방열 플레이트, 방열 시 트)를 차폐 시트에 밀착시켜 디스플레이와 방열 부재(예: 방열 플레이트, 방열 시트) 사이에 갭을 형성하고, 방 열 부재(예: 방열 플레이트, 방열 시트)와 차폐 시트를 통해 열을 분산시켜, 방열 효율을 향상시킬 수 있는 전 자 장치를 제공할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 본 개시의 사상 및 영역으로부터 벗어나지 않는 범위에서 다양하게 확장될 수 있을 것이다. 언급되지 않은 또 다른 기술적 과제들"}
{"patent_id": "10-2023-0187196", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "은 아래의 기재로부터 본 문서가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 상면, 상기 상면에 반대되는 하면 및 상기 상면과 상기 하면을 감싸 는 측면을 포함하는 하우징, 상기 하우징의 상기 상면에 배치된 디스플레이; 상기 하우징의 내부에 배치된 브라 켓; 상기 하우징과 상기 브라켓 사이에 배치된 인쇄회로기판; 상기 인쇄회로기판의 상기 디스플레이에 마주하는 일면 상에 배치된 제1 전자 부품; 상기 제1 전자 부품을 감싸도록 배치된 제1 쉴드캔; 상기 브라켓의 일부 및 상기 제1 쉴드캔과 중첩되고, 상기 제1쉴드캔 및 상기 디스플레이 사이에 배치된 방열 부재; 및 상기 방열 부재 의 일 영역 상에 배치되어 상기 방열 부재를 상기 제1 쉴드캔에 고정하도록 배치된 커버 플레이트를 포함할 수 있다. 그 밖에 다양한 실시 예들이 가능할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 상면, 상기 상면에 반대되는 하면 및 상기 상면과 상기 하면을 감싸 는 측면을 포함하는 하우징; 상기 하우징의 상기 상면에 배치된 디스플레이; 상기 하우징의 내부에 배치된 브라 켓; 상기 하우징과 상기 브라켓 사이에 배치된 인쇄회로기판; 상기 인쇄회로기판의 상기 디스플레이에 마주하는 일면 상에 배치된 제1 전자 부품 및 제2 전자 부품; 상기 제1 전자 부품을 감싸도록 배치된 쉴드캔; 상기 쉴드 캔의 상부를 덮도록 배치되는 차폐 시트; 상기 제2 전자 부품을 감싸도록 배치된 쉴드 부재; 및 상기 브라켓의 일부, 상기 쉴드캔, 및 상기 쉴드 부재와 중첩되고, 상기 디스플레이의 하부에 배치된 커버 플레이트(예: 금속 플레이트);를 포함할 수 있다. 본 개시의 전자 장치는, 프로세서에서 발생된 열을 효과적으로 방열할 수 있는 전자 장치를 제공할 수 있다. 본 개시의 전자 장치는, 전자 부품들에서 발생된 열을 효과적으로 방열할 수 있는 전자 장치를 제공할 수 있다. 본 개시의 전자 장치는, 쉴드캔의 차폐 시트(예: 차폐 플레이트)에 상에 방열 부재(예: 방열 플레이트, 방열 시 트)를 배치하고, 방열 부재(예: 방열 플레이트, 방열 시트) 상에 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 배치할 수 있다. 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 방열 부재(예:방열 플레이트, 방열 시트)를 차폐 시트(예: 차폐 플레이트)에 밀착시켜 디스플레이와 방열 부재(예: 방열 플레 이트, 방열 시트) 사이에 갭을 형성할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트), 차폐 시트(예: 차폐 플레이트), 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 열을 분산시켜, 방열 효 율을 향상시킬 수 있는 전자 장치를 제공할 수 있다. 본 개시의 전자 장치는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 상면의 높이와 방열 부재 (예: 방열 플레이트, 방열 시트)의 제2 부분의 높이가 실질적으로 동일해지도록 함으로서, 사용자의 손가락으로 디스플레이(예: 플렉서블 디스플레이)를 누르는(예: -z축 방향으로 누르는) 경우에 디스플레이(예: 플렉서블 디 스플레이)가 파손되는 것을 방지할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 디스플레이(예: 플렉서블 디스플레이)의 비표시 영역(예: 베젤 영역)에 대응하는 위치에 배치된 열전도 압축 부재(예: 열전도 가스켓)를 통해서, 방열 부재(예: 방열 플레이트, 방열 시트)를 통해 이동된 열을 디스플레이(예: 플렉서블 디스플레이)의 하부 구조물로 확산시켜, 방 열 효율을 향상시킬 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)를 통해 프로세서 및 적어도 하나의 전자 부품에서 발생된 열을 넓은 면적으로 분산시켜, 방열 효율을 향상시킬 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)를 통해 제1 차폐 시트(예: 차폐 플레이트)에 밀착시켜, 디스플레이(예: 플렉 서블 디스플레이)와 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트) 사이에 갭을 형성할 수 있다. 제1 차폐 시트(예: 차폐 플레이트), 및 커버 플레이트(예: 베이퍼 챔 버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)를 통해 열을 분산시켜, 방열 효율을 향상시킬 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0187196", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "첨부된 도면을 참조한 다음의 설명은 청구범위 및 그 균등물에 의해 정의된 바와 같은 개시 내용의 다양한 실시 예의 포괄적인 이해를 돕기 위해 제공된다. 여기에는 이해를 돕기 위한 다양한 특정 세부 사항이 포함되어 있지"}
{"patent_id": "10-2023-0187196", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "만 이는 단지 예시적인 것으로 간주되어야 한다. 따라서, 본 기술분야의 통상의 지식을 가진 자는 본 개시 내용 의 범위 및 사상을 벗어나지 않고 본 명세서에 기재된 다양한 실시 예의 다양한 변경 및 수정이 이루어질 수 있 음을 인식할 것이다. 또한, 명료함과 간결함을 위해 잘 알려진 기능 및 구성에 대한 설명은 생략할 수 있다. 하기 설명 및 청구범위에 사용된 용어 및 단어들은 문헌상의 의미에 한정되지 않으며, 본 문서의 명확하고 일관 된 이해를 가능하게 하기 위해 출원인이 사용한 것에 불과하다. 따라서, 본 문서의 다양한 실시 예에 대한 다음 설명은 첨부된 청구범위 및 그 균등물에 의해 정의된 바와 같은 본 문서를 제한하기 위한 것이 아니라 단지 예 시의 목적으로 제공된다는 것이 당업자에게 명백해야 한다. 단수 형태는 문맥이 명백하게 달리 지시하지 않는 한 복수 지시 대상을 포함하는 것으로 이해되어야 한다. 따라 서, 예를 들어 \"구성요소 표면\"에 대한 언급은 그러한 표면 중 하나 이상에 대한 언급을 포함할 수 있다. 도 1은 다양한 실시 예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버를 통 하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치(10 1)에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가 될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테 나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르 면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다 른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보 조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다 른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄회로기판, 상기 인쇄회로기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배치되 고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄회로기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수 의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또 는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청 할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있 다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로 서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예에 있어서, 외부 의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망 을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워 크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 일 실시 예에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않 는다. 본 개시의 일 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정일 실시 예들로 한정 하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 개시의 일 실시 예에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 개시의 일 실시 예는 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 일 실시 예에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 일 실시 예에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 일 실시 예에 따르 면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구 성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로 그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구 성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 일 실시 예에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수 행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이 상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은, 접히거나 펼치질 수 있도록 구성된 플렉서블(flexible) 디스플 레이를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은, 제1 방향으로 슬라이딩(예: x축 방향으로 슬라이딩) 또는 제2 방향으로 슬라이딩(예: y축 방향으로 슬라이딩) 가능하게 배치되어 화면(예: 디스플레이 화면)을 제공하는 플렉 서블 디스플레이를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은, 가변형 디스플레이(예: stretchable display), 익스펜더블 디스 플레이(expandable display) 또는 슬라이드 인/아웃 디스플레이(slide-in/out display)로 지칭될 수도 있다. 일 실시 예에 따르면, 디스플레이 모듈은, 바형(bar type), 또는 평판형(plate type)의 디스플레이를 포함 할 수도 있다. 도 1의 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회로를 포함할 수 있다. 도 1의 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 도 2a 및 도 2b는 본 개시의 일 실시 예에 따른 전자 장치의 제1 상태(예: 펼침 상태, unfolded stage)를 전면 및 후면에서 바라본 도면들이다. 도 2c 및 도 2d는 본 개시의 일 실시 예에 따른 전자 장치의 제2 상태(예: 접 힘 상태, folded state)를 전면 및 후면에서 바라본 도면들이다. 도 2a 내지 도 2d의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실 시 예들을 더 포함할 수 있다. 도 2a 내지 도 2d를 참조하면, 본 개시의 일 실시 예에 따른 전자 장치(예: 도 1의 전자 장치)는, 서 로에 대하여 접힘 가능하도록 적어도 하나의 힌지 장치(예: 힌지 모듈 또는 힌지 구조)를 통해 폴딩축(F)을 기 준으로 회동 가능하게 결합되는 한 쌍의 하우징들(210, 220)(예: 폴더블 하우징 구조), 한 쌍의 하우징들(210, 220)을 통해 배치되는 제1 디스플레이(예: 플렉서블(flexible) 디스플레이, 폴더블(foldable) 디스플레이 또는 메인 디스플레이) 및/또는 제2 하우징을 통해 배치된 제2 디스플레이(예: 서브 디스플레이)를 포함할 수 있다. 일 실시 예에 따르면, 적어도 하나의 힌지 장치의 적어도 일부는 제1 하우징 및 제2 하우징을 통해 외부로부터 보이지 않도록 배치되고, 제1 상태(예: 펼침 상태)에서, 접힘 가능한 부분을 커버하는 힌지 하우징 (예: 힌지 커버)을 통해 외부로부터 보이지 않게 배치될 수 있다. 본 문서에서는 제1 디스플레이가 배치된 면은 전자 장치의 전면으로 정의될 수 있다. 본 문서에서는 전면의 반대면은 전자 장치의 후 면으로 정의될 수 있다. 또한 전면과 후면 사이의 공간을 둘러싸는 면은 전자 장치의 측면으로 정의될 수 있다. 일 실시 예에 따르면, 한 쌍의 하우징들(210, 220)은 적어도 하나의 힌지 장치를 통해 서로에 대하여 폴딩 가능 하게 배치되는 제1 하우징 및 제2 하우징을 포함할 수 있다. 일 실시 예에 따르면, 한 쌍의 하우징들(210, 220)은 도 2a 내지 도 2d에 도시된 형태 및 결합으로 제한되지 않 으며, 다른 형상이나 부품의 조합 및/또는 결합에 의해 구현될 수도 있다. 일 실시 예에 따르면, 제1 하우징과 제2 하우징은 폴딩축(F)을 기준으로 양측에 배치되고, 폴딩축 (F)에 대하여 전체적으로 대칭인 형상을 가지며 서로 일치하도록 접힐 수 있다. 일 실시 예에 따르면, 제1 하우징과 제2 하우징은 폴딩축(F)을 기준으로 비대칭으로 접힐 수도 있다. 일 실시 예에 따르면, 제1 하우징 및 제2 하우징은 전자 장치가 제1 상태(예: 펼침 상태, unfolded stage)인지, 제2 상태(예: 접힘 상태, folded state)인지, 또는 제3 상태(예: 중간 상태, intermediate state)인지 여부에 따라 서로 이루는 각도나 거리가 서로 달라질 수 있다. 예를 들면, 전자 장치 는 센서 모듈(예: 도 1의 센서 모듈)을 이용하여 제1 상태(예: 펼침 상태, unfolded stage)인지, 제 2 상태(예: 접힘 상태, folded state)인지, 또는 제3 상태(예: 중간 상태, intermediate state)인지를 센싱할 수 있다. 전자 장치는 센서 모듈(예: 도 1의 센서 모듈)을 이용하여 제1 하우징 및 제2 하우징 이 서로 이루는 각도를 센싱할 수 있다. 일 실시 예에 따르면, 제1 하우징은 전자 장치의 제1 상태(예: 펼침 상태)에서, 적어도 하나의 힌지 장치에 연결될 수 있다. 제1 하우징은 전자 장치의 전면을 향하도록 배치된 제1 면, 제1 면 의 반대 방향을 향하는 제2 면, 및/또는 제1 면과 제2 면 사이의 제1 공간의 적어 도 일부를 둘러싸는 제1 측면 부재를 포함할 수 있다. 일 실시 예에 따르면, 제2 하우징은 전자 장치의 제1 상태(예: 펼침 상태)에서, 적어도 하나의 힌지 장치와 연결될 수 있다. 제2 하우징은 전자 장치의 전면을 향하도록 배치된 제3 면, 제3 면 의 반대 방향을 향하는 제4 면, 및/또는 제3 면 및 제4 면 사이의 제2 공간의 적어 도 일부를 둘러싸는 제2 측면 부재를 포함할 수 있다. 일 실시 예에 따르면, 제1 면은, 제1 상태(예: 펼침 상태)에서 제3 면과 실질적으로 동일한 방향을 향하고, 제2 상태(예: 접힘 상태)에서 제3 면과 마주보도록 적어도 부분적으로 대면될 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 하우징과, 제2 하우징의 구조적 결합을 통해 제1 디스플 레이를 수용하도록 형성된 리세스를 포함할 수도 있다. 일 실시 예에 따르면, 리세스는 제1 디스플레이와 실질적으로 동일한 크기를 가질 수 있다. 일 실시 예에 따르면, 제1 하우징은, 제1 디스플레이를 위에서 바라볼 때, 제1 측면 부재와 결 합될 수 있다. 제1 하우징은 제1 디스플레이의 가장자리와 중첩 배치됨으로써, 제1 디스플레이 의 가장자리가 외부로부터 보이지 않도록 커버하는 제1 보호 프레임(213a)(예: 제1 장식 부재)을 포함할 수 있 다. 일 실시 예에 따르면, 제1 보호 프레임(213a)은 제1 측면 부재와 일체로 형성될 수도 있다. 일 실시 예에 따르면, 제2 하우징은, 제1 디스플레이를 위에서 바라볼 때, 제2 측면 부재와 결 합될 수 있다. 제2 하우징은 제1 디스플레이의 가장자리와 중첩 배치됨으로써, 제1 디스플레이 의 가장자리가 외부로부터 보이지 않도록 커버하는 제2 보호 프레임(223a)을 포함할 수 있다. 일 실시 예에 따르면, 제2 보호 프레임(223a)은 제2 측면 부재와 일체로 형성될 수도 있다. 일 실시 예에 따르면, 제1 보호 프레임(213a)과 제2 보호 프레임(223a)은 생략될 수도 있다. 일 실시 예에 따르면, 힌지 하우징(예: 힌지 커버)은, 제1 하우징과 제2 하우징 사이에 배치될 수 있다. 힌지 하우징은 적어도 하나의 힌지 장치의 일부(예: 적어도 하나의 힌지 모듈)를 가리도록 배치 될 수 있다. 일 실시 예에 따르면, 힌지 하우징은, 전자 장치의 제1 상태(예: 펼침 상태), 제2 상태(예: 접힘 상 태) 또는 제3 상태(예: 중간 상태)에 따라, 제1 하우징 및 제2 하우징의 일부에 의해 가려지거나, 외 부로 노출될 수 있다. 예컨대, 전자 장치가 제1 상태(예: 펼침 상태)인 경우, 힌지 하우징의 적어도 일부는 제1 하우징 및 제2 하우징에 의해 가려져 실질적으로 외부에서 보이지 않도록 배치될 수 있다. 일 실시 예에 따르면, 전자 장치가 제2 상태(접힘 상태)인 경우, 힌지 하우징의 적어도 일부는 제1 하우징 및 제2 하우징 사이에서, 외부로부터 보일 수 있게 배치될 수 있다. 일 실시 예에 따르면, 제1 하우징 및 제2 하우징이 소정의 각도를 이루는(folded with a certain angle) 제3 상태(중간 상태)인 경우, 힌지 하우징은 제1 하우징 및 제2 하우징 사이에서 전자 장치의 외부로 적어도 부분적으로 외부에서 보일 수 있게 배치될 수 있다. 예컨대, 힌지 하우징이 외 부로 노출되는 영역은 완전히 접힌 상태보다 적을 수 있다. 일 실시 예에 따르면, 힌지 하우징은 곡면을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치가 제1 상태(예: 펼침 상태)인 경우, 제1 하우징 및 제2 하우징(22 0)은 약 180도의 각도를 이루며, 제1 디스플레이의 제1 영역(230a), 제2 영역(230b) 및 폴딩 영역(230c) 은 실질적으로 동일 평면을 이룰 수 있다. 제1 디스플레이의 제1 영역(230a), 제2 영역(230b) 및 폴딩 영 역(230c)은 실질적으로 동일 방향(예: z 축 방향)을 향하도록 배치될 수 있다. 일 실시 예로서, 전자 장치(20 0)가 제1 상태(예: 펼침 상태)인 경우, 제1 하우징은 제2 하우징에 대하여 약 360도의 각도로 회동하 여 제2 면과 제4 면이 마주보도록 반대로 접힐 수도 있다(예: out folding 방식). 일 실시 예에 따르면, 전자 장치가 제2 상태(접힘 상태)인 경우, 제1 하우징의 제1 면 및 제2 하우징의 제3 면은 서로 마주보게 배치될 수 있다. 이러한 경우, 제1 디스플레이의 제1 영역 (230a)과 제2 영역(230b)은 폴딩 영역(230c)를 통해, 서로 좁은 각도(예: 0도 ~ 약 10도 범위)를 형성하며, 서 로 마주보도록 배치될 수도 있다. 일 실시 예에 따르면, 폴딩 영역(230c)은 적어도 일부가 소정의 곡률을 가지 는 곡형으로 변형될 수 있다. 일 실시 예에 따르면, 전자 장치가 제3 상태(중간 상태)인 경우, 제1 하우징 및 제2 하우징은 서로 소정의 각도(a certain angle)로 배치될 수 있다. 이러한 경우, 제1 디스플레이의 제1 영역(230a)과 제2 영역(230b)은 제2 상태(예: 접힘 상태)보다 크고, 제1 상태(예: 펼침 상태)보다 작은 각도를 형성할 수 있 으며, 폴딩 영역(230c)의 곡률은 제2 상태(접힘 상태)인 경우보다 작을 수 있고, 제1 상태(예: 펼침 상태)보다 클 수 있다. 일 실시 예에 따르면, 제1 하우징과 제2 하우징은, 적어도 하나의 힌지 장치를 통해, 제 2 상태(예: 접힘 상태)에서 제3 상태(예: 중간 상태) 사이의 지정된 폴딩 각도에서 멈출 수 있는 각도를 형성할 수 있다(예: free stop 기능). 일 실시 예에 따르면, 제1 하우징과 제2 하우징은, 적어도 하나의 힌 지 장치를 통해, 지정된 변곡 각도를 기준으로, 펼쳐지는 방향 또는 접히는 방향으로, 가압 받으면서 지속적으 로 동작될 수도 있다. 일 실시 예에 따르면, 전자 장치는, 제1 하우징 및/또는 제2 하우징에 배치되는 적어도 하나의 디스플레이(230, 235), 입력 장치, 음향 출력 장치들(227, 228), 센서 모듈들(217a, 217b, 226), 카메라모듈들(216a, 216b, 225), 키 입력 장치, 인디케이터(미도시 됨) 또는 커넥터 포트 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 구성 요소들 중 적어도 하나를 생략하거나 적어도 하 나의 다른 구성 요소를 추가적으로 포함할 수 있다. 일 실시 예에 따르면, 적어도 하나의 디스플레이(230, 235)는, 제1 하우징의 제1 면으로부터 적어도 하나의 힌지 장치를 통해 제2 하우징의 제3 면의 지지를 받도록 배치되는 제1 디스플레이(예: 플렉서블 디스플레이) 및 제2 하우징의 내부 공간에서 제4 면을 통해 적어도 부분적으로 외부로부터 보일 수 있게 배치되는 제2 디스플레이를 포함할 수 있다. 일 실시 예에 따르면, 제2 디스플레이는 제1 하우징의 내부 공간에서 제2 면을 통해 외부로부터 보일 수 있게 배치될 수도 있다. 일 실시 예에 따르면, 제1 디스플레이는, 전자 장치의 제1 상태(예: 펼침 상태)에서 주로 사용될 수 있다. 전자 장치의 제1 상태(예: 펼침 상태)에서도 제2 디스플레이가 사용될 수 있다. 일 실시 예에 따르면, 제2 디스플레이는, 전자 장치의 제2 상태(예: 접힘 상태)에서 주로 사용될 수 있다. 전자 장치의 제2 상태(예: 접힘 상태)에도 제1 디스플레이가 사용될 수 있다. 일 실시 예에 따르면, 전자 장치는 제3 상태(예: 중간 상태)의 경우, 제1 하우징과 제2 하우징 의 폴딩 각도에 기반하여 제1 디스플레이 및/또는 제2 디스플레이를 사용 가능하게 제어할 수 있다. 일 실시 예에 따르면, 제1 디스플레이는, 한 쌍의 하우징들(210, 220)에 의해 형성된 수용 공간에 배치될 수 있다. 예를 들어, 제1 디스플레이는 한 쌍의 하우징들(210, 220)에 의해 형성되는 리세스(recess)(20 1)에 배치될 수 있으며, 제1 상태(예: 펼침 상태)에서, 전자 장치의 전면의 실질적으로 대부분을 차지하도 록 배치될 수 있다. 일 실시 예에 따르면, 제1 디스플레이는, 적어도 일부 영역이 평면 또는 곡면으로 변 형될 수 있는 플렉서블 디스플레이를 포함할 수 있다. 일 실시 예에 따르면, 제1 디스플레이는 제1 하우징과 대면하는 제1 영역(230a) 및 제2 하우징 과 대면하는 제2 영역(230b)을 포함할 수 있다. 일 실시 예에 따르면, 제1 디스플레이는 폴딩축(F)을 기준 으로, 제1 영역(230a)의 일부 및 제2 영역(230b)의 일부를 포함하는 폴딩 영역(230c)을 포함할 수 있다. 일 실시 예에 따르면, 폴딩 영역(230c)의 적어도 일부는 적어도 하나의 힌지 장치와 대응되는 영역을 포함할 수 있다. 일 실시 예에 따르면, 제1 디스플레이의 영역 구분은 한 쌍의 하우징(210, 220) 및 적어도 하나의 힌지 장 치에 의한 예시적인 물리적 구분일 뿐, 실질적으로 한 쌍의 하우징(210, 220) 및 적어도 하나의 힌지 장치를 통 해 제1 디스플레이는 이음매 없는(seamless), 하나의 전체 화면으로 표시될 수 있다. 일 실시 예에 따르면, 제1 영역(230a)과 제2 영역(230b)은 폴딩 영역(230c)을 기준으로 전체적으로 대칭인 형상 을 가지거나, 부분적으로 비대칭 형상을 가질 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 하우징의 제2 면에 배치되는 제1 후면 커버 및 제2 하우징의 제4 면에 배치되는 제2 후면 커버를 포함할 수 있다. 일 실시 예에 따르면, 제1 후면 커버의 적어도 일부는 제1 측면 부재와 일체로 형성될 수도 있다. 일 실시 예에 따르면, 제2 후면 커 버의 적어도 일부는 제2 측면 부재와 일체로 형성될 수도 있다. 일 실시 예에 따르면, 제1 후면 커버 및 제2 후면 커버 중 적어도 하나의 커버는 실질적으로 투명한 플레이트(예: 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트) 또는 불투명한 플레이 트로 형성될 수 있다. 일 실시 예에 따르면, 제1 후면 커버는, 예를 들어, 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합과 같은, 불투명한 플레이트에 의하여 형성될 수 있다. 일 실시 예에 따르면, 제2 후면 커버는, 예를 들어, 글래스 또는 폴리머와 같은, 실질적으로 투명한 플레 이트를 통해 형성될 수 있다. 따라서, 제2 디스플레이는, 제2 하우징의 내부 공간에서, 제2 후면 커 버를 통해 외부로부터 보일 수 있게 배치될 수 있다. 일 실시 예에 따르면, 입력 장치는, 마이크를 포함할 수 있다. 일 실시 예에 따르면, 입력 장치는 소 리의 방향을 감지할 수 있도록 배치되는 복수 개의 마이크들을 포함할 수 있다.일 실시 예에 따르면, 음향 출력 장치들(227, 228)은 스피커들을 포함할 수 있다. 일 실시 예에 따르면, 음향 출력 장치들(227, 228)은, 제2 하우징의 제4 면을 통해 배치되는 통화용 리시버 및 제2 하우징 의 제2 측면 부재의 적어도 일부를 통해 배치되는 외부 스피커를 포함할 수 있다. 일 실시 예에 따르면, 입력 장치, 음향 출력 장치들(227, 228) 및 커넥터 포트는 제1 하우징 및 /또는 제2 하우징의 공간들에 배치될 수 있다. 입력 장치, 음향 출력 장치들(227, 228) 및 커넥터 포 트는 제1 하우징 및/또는 제2 하우징에 형성된 적어도 하나의 홀을 통하여 외부 환경에 노출될 수 있다. 일 실시 예에 따르면, 제1 하우징 및/또는 제2 하우징에 형성된 홀들은 입력 장치 및 음향 출력 장치들(227, 228)을 위하여 공용으로 사용될 수 있다. 일 실시 예에 따르면, 음향 출력 장치들(227, 228)은 제1 하우징 및/또는 제2 하우징에 형성된 홀이 배제된 채, 동작되는 스피커(예: 피에조 스피 커)를 포함할 수도 있다. 일 실시 예에 따르면, 카메라 모듈들(216a, 216b, 225)은, 제1 하우징의 제1 면에 배치되는 제1 카메 라 모듈(216a), 제1 하우징의 제2 면에 배치되는 제2카메라 모듈(216b) 및/또는 제2 하우징의 제4 면에 배치되는 제3카메라 모듈을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제2카메라 모듈(216b) 근처에 배치되는 플래시를 포함할 수 있다. 일 실시 예에 따르면, 플래시는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 일 실시 예에 따르면, 카메라 모듈들(216a, 216b, 225)은 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미 지 시그널 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 카메라 모듈들(216a, 216b, 225) 중 적어도 하나 의 카메라 모듈은 2개 이상의 렌즈들(예: 광각 및 망원 렌즈) 및 이미지 센서들을 포함하고, 제1 하우징 및/또는 제2 하우징의 어느 한 면에 함께 배치될 수도 있다. 일 실시 예에 따르면, 센서 모듈들(217a, 217b, 226)(예: 도 1의 센서 모듈)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈들(217a, 217b, 226)(예: 도 1의 센서 모듈)은, 제1 하우징의 제1 면에 배치되는 제1 센서 모듈(217a), 제1 하우징의 제2 면에 배치되는 제2 센서 모듈(217b) 및 /또는 제2 하우징의 제4 면에 배치되는 제3 센서 모듈을 포함할 수 있다. 일 실시 예에 따르면, 센서 모듈들(217a, 217b, 226)(예: 도 1의 센서 모듈)은 제스처 센서, 자이로 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 조도 센서, 초음파 센서, 근접 센서, 생체 센서(예: 홍채 인식 센서), 거리 검출 센서(예: TOF(time of flight) 센서, LiDAR(light detection and ranging) 센서), 기압 센서, 마그네틱 센서(예: 6축 센서, 지자기 센서), 가속도 센서, 온도 센서, 습도 센서, 및/또는 지문 인식 센 서 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치의 프로세서(예: 도 1의 프로세서)는 센서 모듈들(217a, 217b, 226) (예: 도 1의 센서 모듈)을 동작하여, 전자 장치의 주변의 조도, 및/또는 IR 세기를 센싱할 수 있다. 프로세서는 전자 장치의 주변의 조도에 대한 정보 및 IR 세기에 대한 정보를 획득할 수 있다. 일 실시 예에 따르면, 전자 장치는, 도시되지 않은 제스처 센서, 자이로 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 조도 센서, 초음파 센서, 근접 센서, 생체 센서(예: 홍채 인식 센서), 거리 검출 센서(예: TOF(time of flight) 센서, LiDAR(light detection and ranging) 센서), 기압 센서, 마그네틱 센서(예: 6축 센 서, 지자기 센서), 가속도 센서, 온도 센서, 습도 센서, 및/또는 지문 인식 센서 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 지문 인식 센서는 제1 하우징의 제1 측면 부재 및/또는 제2 하우징의 제2 측면 부재 중 적어도 하나의 측면 부재를 통해 배치될 수도 있다. 일 실시 예에 따르면, 키 입력 장치는, 제1 하우징의 제1 측면 부재를 통해 외부로 노출되도록 배치될 수 있다. 일 실시 예에 따르면, 키 입력 장치는 제2 하우징의 제2 측면 부재를 통해 외 부로 노출되도록 배치될 수도 있다. 일 실시 예에 따르면, 전자 장치는 상기 키 입력 장치들 중 일부 또는 전부를 포함하지 않을 수 있고, 포함되지 않은 키 입력 장치는 적어도 하나의 디스플레이(230, 235) 상에 소프트 키와 같은 다른 형태로 구현될 수 있다. 일 실시 예로서, 키 입력 장치는 적어도 하나의 디스 플레이(230, 235)에 포함된 압력 센서를 이용하여 구현될 수 있다.일 실시 예에 따르면, 커넥터 포트는, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터 (예: USB 커넥터 또는 IF 모듈(interface connector port 모듈))를 포함할 수 있다. 일 실시 예에 따르면, 커 넥터 포트는 외부 전자 장치와 오디오 신호를 송수신하기 위한 기능을 함께 수행하거나, 오디오 신호의 송 수신 기능을 수행하기 위한 별도의 커넥터 포트(예: 이어잭 홀)를 더 포함할 수도 있다. 일 실시 예에 따르면, 카메라 모듈들(216a, 216b, 225) 중 적어도 하나의 카메라 모듈(216a, 225), 센서 모듈들 (217a, 217b, 226) 중 적어도 하나의 센서 모듈(217a, 226) 및/또는 인디케이터는 적어도 하나의 디스플레이 (230, 235)를 통해 시각적으로 노출되도록 배치될 수 있다. 예컨대, 적어도 하나의 카메라 모듈(216a, 225), 적 어도 하나의 센서 모듈(217a, 226) 및/또는 인디케이터는 적어도 하나의 하우징(210, 220)의 내부 공간에서, 적 어도 하나의 디스플레이(230, 235)의 활성화 영역(display area) 아래에 배치될 수 있다. 적어도 하나의 카메라 모듈(216a, 225), 적어도 하나의 센서 모듈(217a, 226) 및/또는 인디케이터는 커버 부재(예: 제1 디스플레이 의 윈도우층(미도시 됨) 및/또는 제2 후면 커버)까지 천공된 오프닝 또는 투명 영역을 통해 외부 환 경과 접할 수 있도록 배치될 수 있다. 일 실시 예에 따르면, 적어도 하나의 디스플레이(230, 235)와 적어도 하나의 카메라 모듈(216a, 225)이 대면하 는 영역은 컨텐츠를 표시하는 영역의 일부로서 일정 투과율을 갖는 투과 영역으로 형성될 수 있다. 일 실시 예에 따르면, 투과 영역은 약 5% ~ 약 20% 범위의 투과율을 갖도록 형성될 수 있다. 이러한 투과 영역 은 이미지 센서로 결상되어 화상을 생성하기 위한 광이 통과하는 적어도 하나의 카메라 모듈(216a, 225)의 유효 영역(예: 화각 영역)과 중첩되는 영역을 포함할 수 있다. 예를 들어, 디스플레이(230, 235)의 투과 영역은 주변 보다 픽셀의 밀도가 낮은 영역을 포함할 수 있다. 예를 들어, 투과 영역은 오프닝을 대체할 수 있다. 예를 들어, 적어도 하나의 카메라 모듈(216a, 225)은 언더 디스플레이 카메라(UDC, under display camera) 또는 언 더 패널 카메라(UPC, under panel camera)를 포함할 수 있다. 일 실시 예로서, 일부 카메라 모듈 또는 센서 모 듈(217a, 226)은 디스플레이를 통해 시각적으로 노출되지 않고 그 기능을 수행하도록 배치될 수도 있다. 예컨대, 디스플레이(230, 235)(예: 디스플레이 패널) 아래에 배치된 카메라 모듈(216a, 225) 및/또는 센서 모듈 (217a, 226)과 대면하는 영역은, UDC(under display camera) 구조로써, 천공된 오프닝이 불필요할 수도 있다. 도 2a의 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회로를 포함할 수 있다. 도 2a의 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 도 3a는 본 개시의 일 실시 예에 따른, 제1 상태(예: 펼침 상태, flat state 또는 unfolding state)를 도시한 전자 장치의 사시도이다. 도 3b는 본 개시의 일 실시 예에 따른 제1 상태(예: 펼침 상태)에서, 전자 장치의 전 면을 도시한 평면도이다. 도 3c는 본 개시의 일 실시 예에 따른, 제1 상태(예: 펼침 상태)에서, 전자 장치의 후 면을 도시한 평면도이다. 도 3d는 본 개시의 일 실시 예에 따른, 제2 상태(예: 접힘 상태, folding state)를 도 시한 전자 장치의 사시도이다. 도 3e는 본 개시의 일 실시 예에 따른, 제3 상태(예: 중간 상태, intermediate state)를 도시한 전자 장치의 사시도이다. 도 3a 내지 도 3e의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실 시 예들을 더 포함할 수 있다. 도 3a 내지 도 3e를 참조하면, 본 개시의 일 실시 예에 따른 전자 장치는, 힌지 구조(예: 도 3b의 힌지 구 조, 힌지 장치 또는 힌지 모듈)를 기준으로 서로에 대하여 마주보며 접히도록 회동 가능하게 결합되는 한 쌍의 하우징(310, 320)(예: 폴더블 하우징)을 포함할 수 있다. 일 실시 예에 따르면, 힌지 구조는 x축 방향으로 배치되거나, y축 방향으로 배치될 수 있다. 일 실시 예에 따르면, 힌지 구조는 동일한 방향 또는 서로 다른 방향으로 폴딩되도록 2개 이상 배치될 수도 있다. 일 실시 예에 따르면, 전자 장치는 한 쌍의 하우징(310, 320)에 의해 형성된 영역에 배치되는 플렉서블 디 스플레이(예: 폴더블 디스플레이)를 포함할 수 있다. 일 실시 예에 따르면, 제1 하우징과 제2 하우징은 폴딩 축(축 A)을 중심으로 양측에 배치되고, 폴딩 축(축 A)에 대하여 실질적으로 대칭인 형상을 가질 수 있다. 일 실시 예에 따르면, 제1 하우징 및 제2 하우징은 전자 장치의 상태가 제1 상태(예: 펼침 상태, flat state 또는 unfolding state)인지, 제2 상태(예: 접힘 상태, folding state)인지, 또는 제3 상태(예: 중간 상태, intermediate state)인지에 따라 서로 이루는 각도나 거리가 달라질 수 있다. 일 실시 예에 따르면, 한 쌍의 하우징(310, 320)은 힌지 구조와 결합되는 제1 하우징(예: 제1 하우징 구조, 제1 하우징 부분) 및 힌지 구조와 결합되는 제2 하우징(예: 제2 하우징 구조, 제2 하우징 부분)을 포함할 수 있다. 일 실시 예에 따르면, 제1 하우징은, 제1 상태(예: 펼침 상태)에서, 제1 방향(예: 전면 방향)(z축 방향)을 향하는 제1 면 및 제1 면과 대향되는 제2 방향(예: 후면 방향)(-z축 방향)을 향하는 제2 면을 포함할 수 있다. 일 실시 예에 따르면, 제2 하우징은 제1 상태(예: 펼침 상태)에서, 제1 방향(z축 방향)을 향하는 제3 면 및 제2 방향(-z축 방향)을 향하는 제4 면을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 제1 상태(예: 침 상태)에서, 제1 하우징의 제1 면과 제2 하 우징의 제3 면이 실질적으로 동일한 제1 방향(z축 방향)을 향하고, 제2 상태(예: 접힘 상태)에서 제1 면과 제3 면이 서로 마주보는 방식으로 동작될 수 있다. 일 실시 예에 따르면, 전자 장치는, 제1 상태(예: 펼침 상태)에서, 제1 하우징의 제2 면과 제2 하우징의 제4 면이 실질적으로 동일한 제2 방향(-z 축 방향)을 향하고, 제2 상태(예: 접힘 상태)에서 제2 면과 제4 면이 서로 반대 방향을 향하도록 동작될 수 있다. 예를 들면, 제2 상태(예: 접힘 상 태)에서 제2 면은 제1 방향(z축 방향)을 향할 수 있고, 제4 면은 제2 방향(-z 축 방향)을 향할 수 있 다. 일 실시 예에 따르면, 제1 하우징은 적어도 부분적으로 전자 장치의 외관을 형성하는 제1 측면 부재 및 제1 측면 부재와 결합되고, 전자 장치의 제2 면의 적어도 일부를 형성하는 제1 후면 커버를 포함할 수 있다. 일 실시 예에 따르면, 제1 측면 부재는 제1 측면(313a), 제1 측면(313a)의 일단으로부터 연장되는 제2 측 면(313b) 및 제1 측면(313a)의 타단으로부터 연장되는 제3 측면(313c)을 포함할 수 있다. 일 실시 예에 따르면, 제1 측면 부재는 제1 측면(313a), 제2 측면(313b), 및 제3 측면(313c)을 통해 장방형(예: 정사각형 또는 직사각형) 형상으로 형성될 수 있다. 일 실시 예에 따르면, 제2 하우징은 적어도 부분적으로 전자 장치의 외관을 형성하는 제2 측면 부재 및 제2 측면 부재와 결합되고, 전자 장치의 제4 면의 적어도 일부를 형성하는 제2 후면 커버를 포함할 수 있다. 일 실시 예에 따르면, 제2 측면 부재는 제4 측면(323a), 제4 측면(323a)의 일단으로부터 연장되는 제5 측면(323b) 및 제4 측면(323a)의 타단으로부터 연장되는 제6 측면(323c)을 포함할 수 있다. 일 실시 예에 따르면, 제2 측면 부재는 제4 측면(323a), 제5 측면(323b), 및 제6 측면(323c)을 통해 장방형 형상으로 형성될 수 있다. 일 실시 예에 따르면, 한 쌍의 하우징(310, 320)은 도시된 형태 및 결합으로 제한되지 않으며, 다른 형상이나 부품의 조합 및/또는 결합에 의해 구현될 수 있다. 예를 들어, 제1 측면 부재는 제1 후면 커버와 일 체로 형성될 수 있고, 제2 측면 부재는 제2 후면 커버와 일체로 형성될 수 있다. 일 실시 예에 따르면, 전자 장치는, 제1 상태(예: 펼침 상태)에서, 제1 측면 부재의 제2 측면(313b) 과 제2 측면 부재의 제5 측면(323b)이 어떠한 갭(gap) 없이 연결될 수 있다. 일 실시 예에 따르면, 전자 장치는, 제1 상태(예: 펼침 상태)에서, 제1 측면 부재의 제3 측면(313c)과 제2 측면 부재의 제6 측면(323c)이 어떠한 갭(gap) 없이 연결될 수 있다. 일 실시 예에 따르면, 전자 장치는, 제1 상태(예: 펼침 상태)에서, 제2 측면(313b)과 제5 측면(323b)의 합 한 길이가 제1 측면(313a) 및/또는 제4 측면(323a)의 길이보다 길도록 구성될 수 있다. 또한, 제3 측면(313c)과 제6 측면(323c)의 합한 길이가 제1 측면(313a) 및/또는 제4 측면(323a)의 길이보다 길도록 구성될 수 있다. 일 실시 예에 따르면, 제1 측면 부재 및/또는 제2 측면 부재는 금속으로 형성되거나, 금속에 사출되 는 폴리머를 더 포함할 수 있다. 일 실시 예에 따르면, 제1 측면 부재 및/또는 제2 측면 부재는 폴리 머로 형성된 적어도 하나의 분절부(3161, 3162, 및/또는 3261, 3262)를 통해 전기적으로 분절된 적어도 하나의 도전성 부분(316 및/또는 326)을 포함할 수도 있다. 이러한 경우, 적어도 하나의 도전성 부분은 전자 장치(30 0)에 포함된 무선 통신 회로와 전기적으로 연결됨으로써 지정된 적어도 하나의 대역(예: 약 400MHz~약 6GHz)에서 동작하는 안테나로 사용될 수 있다. 일 실시 예에 따르면, 제1 후면 커버 및/또는 제2 후면 커버는, 예를 들어, 코팅 또는 착색된 유리, 세라믹, 폴리머, 또는 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘) 중 적어도 하나 또는 적어도 둘의 조합에 의하여 형성될 수 있다. 일 실시 예에 따르면, 플렉서블 디스플레이는 제1 하우징의 제1 면으로부터 힌지 구조를 가로질러 제2 하우징의 제3 면의 적어도 일부까지 연장되도록 배치될 수 있다. 예를 들어, 플렉서블 디스플레이는 실질적으로 제1 면과 대응하는 제1 부분(330a), 제3 면과 대응하는 제2 부분 (330b), 및 제1 부분(330a)과 제2 부분(330b)을 연결하고, 힌지 구조와 대응하는 제3 부분(330c)(예: 굴 곡 가능 영역)을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 하우징의 가장자리를 따라 결합되는 제1 보호 커버(예: 제1 보호 프레임 또는 제1 장식 부재)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 하우징 의 가장자리를 따라 결합되는 제2 보호 커버(예: 제2 보호 프레임 또는 제2 장식 부재)를 포함할 수 있다. 일 실시 예에 따르면, 제1 보호 커버 및/또는 제2 보호 커버는 금속 또는 폴리머 재질로 형성될 수 있다. 일 실시 예에 따르면, 제1 보호 커버 및/또는 제2 보호 커버는 장식 부재(decoration membe r)로 사용될 수 있다. 일 실시 예에 따르면, 플렉서블 디스플레이는 제1 부분(330a)의 가장자리가 제1 하우징과 제1 보호 커버 사이에 개재되도록 위치될 수 있다. 일 실시 예에 따르면, 플렉서블 디스플레이는 제2 부분 (330b)의 가장자리가 제2 하우징과 제2 보호 커버 사이에 개재되도록 위치될 수 있다. 일 실시 예에 따르면, 플렉서블 디스플레이는 힌지 구조와 대응되는 영역에 배치되는 보호 캡을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 힌지 구조를 지지하는 힌지 하우징(예: 힌지 커버)을 포함할 수 있다. 일 실시 예에 따르면, 플렉서블 디스플레이는 제2 면의 적어도 일부로부터 제4 면의 적어도 일 부까지 연장 배치될 수 있다. 이러한 경우, 전자 장치는 플렉서블 디스플레이가 외부로 노출될 수 있 도록 접힐 수 있다(아웃 폴딩 방식). 일 실시 예에 따르면, 전자 장치는 플렉서블 디스플레이와 별도로 배치되는 서브 디스플레이(예: 외부 디스플레이)를 포함할 수 있다. 일 실시 예에 따르면, 서브 디스플레이(예: 외 부 디스플레이)는 제1 하우징의 제2 면에 적어도 부분적으로 노출되도록 배치됨으로써, 제2 상태(예: 접힘 상태)일 경우, 플렉서블 디스플레이의 표시 기능을 대체하여, 전자 장치의 상태 정보(예: 제1 상태 정보, 제2 상태 정보, 또는 제3 상태 정보)를 표시할 수 있다. 일 실시 예에 따르면, 서브 디스플레이(예: 외부 디스플레이)는 제1 후면 커버의 적어도 일부 영역을 통해 외부로부터 보일 수 있게 배치될 수 있다. 일 실시 예에 따르면, 서브 디스플레이(예: 외부 디스플레 이)는 제2 하우징의 제4 면에 배치될 수도 있다. 이러한 경우, 서브 디스플레이(예: 외부 디스 플레이)는 제2 후면 커버의 적어도 일부 영역을 통해 외부로부터 보일 수 있게 배치될 수 있다. 일 실시 예에 따르면, 전자 장치는 입력 장치(예: 마이크), 음향 출력 장치(301, 302), 센서 모듈 , 카메라 장치(305, 308), 키 입력 장치, 또는 커넥터 포트 중 적어도 하나를 포함할 수 있다. 전자 장치의 내부에 배치되고, 홀 또는 형상을 통해 동작하는 실질적인 전자 부품(예: 입력 장치, 음향 출 력 장치, 센서 모듈, 또는 카메라 장치)를 포함할 수도 있다. 일 실시 예에 따르면, 입력 장치는 제2 하우징에 배치되는 적어도 하나의 마이크를 포함할 수 있다. 일 실시 예에 따르면, 음향 출력 장치(301, 302)는 스피커들(301, 302)을 포함할 수 있다. 일 실시 예에 따르면, 적어도 하나의 커넥터 포트는, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위하여 사용될 수 있다. 일 실시 예에 따르면, 적어도 하나의 커넥터 포트(예: 이어잭 홀)는 외부 전자 장치와 오디오 신호를 송수신하기 위한 커넥터(예: 이어잭)를 수용할 수도 있다.일 실시 예에 따르면, 센서 모듈은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하 는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈은, 예를 들어, 제1 하우징의 제1 면(31 1)을 통해 외부 환경을 검출할 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 하우징의 제2 면 을 통해 외부 환경을 검출하도록 배치되는 적어도 하나의 센서 모듈을 더 포함할 수도 있다. 일 실시 예에 따르면, 센서 모듈(예: 조도 센서)은 플렉서블 디스플레이 아래에서, 플렉서블 디스플 레이를 통해 외부 환경을 검출하도록 배치될 수 있다. 일 실시 예에 따르면, 센서 모듈(예: 도 1의 센서 모듈)은 제스처 센서, 자이로 센서, 그립 센서, 컬 러 센서, IR(infrared) 센서, 조도 센서, 초음파 센서, 근접 센서, 생체 센서(예: 홍채 인식 센서), 거리 검출 센서(예: TOF(time of flight) 센서, LiDAR(light detection and ranging) 센서), 기압 센서, 마그네틱 센서 (예: 6축 센서, 지자기 센서), 가속도 센서, 온도 센서, 습도 센서, 및/또는 지문 인식 센서 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 카메라 장치들(305, 308)은, 제1 하우징의 제1 면에 배치되는 제1 카메라 장치 (예: 전면 카메라 장치) 및 제1 하우징의 제2 면에 배치되는 제2 카메라 장치를 포함할 수 있다. 전자 장치는 제2 카메라 장치 근처에 배치되는 플래시를 더 포함할 수 있다. 일 실시 예에 따르면, 카메라 장치들(305, 308)은 TOF(time of flight) 용 렌즈들 및/또는 이미지 센서를 포함 할 수도 있다. 일 실시 예에 따르면, 키 입력 장치(예: 키 버튼)는, 제1 하우징의 제1 측면 부재의 제3 측면 (313c)에 배치될 수 있다. 일 실시 예에 따르면, 키 입력 장치는 제1 하우징의 다른 측면들(313a, 313b) 및/또는 제2 하우징의 측면들(323a, 323b, 323c) 중 적어도 하나의 측면에 배치될 수도 있다. 일 실시 예에 따르면, 카메라 장치들(305, 308) 중 일부 카메라 장치(예: 제1 카메라 장치) 또는 센서 모 듈은 플렉서블 디스플레이를 통해 노출되도록 배치될 수 있다. 예컨대, 제1 카메라 장치 또는 센서 모듈은 전자 장치의 내부 공간에서, 플렉서블 디스플레이에 적어도 부분적으로 형성된 오 프닝(예: 관통 홀)을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 일 실시 예에 따르면, 일부 센서 모듈은 전자 장치의 내부 공간에서 플렉서블 디스플레이를 통 해 시각적으로 노출되지 않고 그 기능을 수행하도록 배치될 수도 있다. 예컨대, 이러한 경우, 플렉서블 디스플 레이의, 센서 모듈과 대면하는 영역은 오프닝이 생략될 수도 있다. 일 실시 예에 따르면, 전자 장치는 힌지 구조를 통해 제3 상태(예: 중간 상태, intermediate stat e)를 유지하도록 동작될 수도 있다. 이러한 경우, 전자 장치는 제1 면과 대응하는 디스플레이 영역과, 제3 면과 대응하는 디스플레이 영역에 서로 다른 컨텐츠가 표시되도록 플렉서블 디스플레이 를 제어할 수도 있다. 일 실시 예에 따르면, 전자 장치는 힌지 구조를 통해 일정 변곡 각도(예: 중간 상태일 때, 제1 하우 징과 제2 하우징 사이의 각도)를 기준으로 실질적으로 제1 상태(예: 펼침 상태, 도 3a의 펼침 상태) 및/또는 실질적으로 제2 상태(예: 접힘 상태, 도 3d의 접힘 상태)로 동작될 수 있다. 예를 들어, 전자 장치 는, 힌지 구조를 통해, 일정 변곡 각도로 펼쳐진 상태에서, 펼쳐지는 방향(B 방향)으로 가압력이 제 공될 경우, 제1 상태(예: 펼침 상태, 도 3a의 펼침 상태)로 천이되도록 동작될 수 있다. 예를 들어, 전자 장치 는, 힌지 구조를 통해, 일정 변곡 각도로 펼쳐진 상태에서, 접히려는 방향(C 방향)으로 가압력이 제 공될 경우, 제2 상태(예: 접힘 상태, 도 3d의 접힘 상태)로 천이되도록 동작될 수 있다. 일 실시 예에 따르면, 전자 장치는, 힌지 구조를 통해 다양한 각도에서 펼쳐진 상태(미도시)를 유지하도록 동작될 수도 있 다. 도 3a의 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회로를 포함할 수 있다. 도 3a의 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 도 4a 및 도 4b는 본 개시의 다양한 실시 예에 따른 제1 상태(예: 인출 상태(slide-out state))에서 전자 장치 의 전면 및 후면을 도시한 도면이다. 도 4c 및 도 4d는 본 개시의 다양한 실시 예에 따른 제2 상태(예: 인입 상 태(slide-in state))에서 전자 장치의 전면 및 후면을 도시한 도면이다.도 4a 내지 도 4d의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실 시 예들을 더 포함할 수 있다. 도 4a 내지 도 4d를 참조하면, 본 개시의 일 실시 예에 따른 전자 장치는 두 하우징(410, 420)이 지정된 방향(예: ①방향 또는 ②방향)(예: ± y축 방향)으로 서로에 대하여 슬라이딩됨으로써, 롤러블 디스플레이(430, rollable display)(예: 플렉서블 디스플레이(flexible display))의 표시 면적을 가변(예: 확장 또는 축소)시킬 수 있다. 그러나 이에 한정되지 않으며, 전자 장치는 두 하우징(410, 420)이 지정된 방향과 수직한 방향 (예: ± x 축 방향)으로 슬라이딩됨으로써, 롤러블 디스플레이의 표시 면적의 가변(예: 확장 또는 축소)을 유도하도록 구성될 수도 있다. 일 실시 예에 따르면, 전자 장치는 제1 하우징(예: 제1 하우징 구조, 이동부 또는 슬라이드 하우징), 제1 하우징과 지정된 방향(예: ①방향 또는 ②방향)(예: ± y축 방향)으로 슬라이딩 가능하게 결합된 제2 하우징(예: 제2 하우징 구조, 고정부 또는 베이스 하우징) 및 제1 하우징과 제2 하우징의 적어 도 일부를 통해 지지받도록 배치된 롤러블 디스플레이(예: 플렉서블 디스플레이)(예: expandable display 또는 stretchable display)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 사용자에 의해 파지된 제2 하우징을 기준으로, 제1 하우징이 제1 방향(①방향)(예: y축 방향)으로 인출되거나(slide-out), 제1 방향(①방향)과 반대인 제2 방향(②방향)(예: -y축 방향)으로 인입되도록(slide-in) 구성될 수 있다. 일 실시 예에 따르면, 제1 공간을 포함하는 제1 하우징의 적어도 일부는 제2 하우징의 제2 공 간에 수용됨으로써, 인입 상태(slide-in state)로 변경될 수 있다. 예를 들면, 제1 상태(예: 인출 상태) 에서 제2 상태(예: 인입 상태)로 변경될 수 있다. 일 실시 예에 따르면, 전자 장치는 인출 상태(slide-out state)에서, 적어도 부분적으로 제1 하우징 의 적어도 일부와 동일한 평면을 형성하기 위한 밴딩 가능 부재(bendable member 또는 bendable support member)(예: 다관절 힌지 모듈 또는 멀티바 조립체)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 인입 상태(slide-in state)에서, 밴딩 가능 부재(bendable member 또 는 bendable support member)(예: 다관절 힌지 모듈 또는 멀티바 조립체)는 적어도 부분적으로 제2 하우징(42 0)의 제2 공간으로 수용될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 적어도 일부는, 인입 상태에서, 밴딩 가능 부재의 지지를 받으 면서 제2 하우징의 제2 공간으로 수용됨으로써 외부로부터 보이지 않게 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 적어도 일부는, 인출 상태에서, 제1 하우징과 적어도 부 분적으로 동일한 평면을 형성하는 밴딩 가능 부재의 지지를 받으면서, 외부로부터 보일 수 있게 배치될 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 측면 부재를 포함하는 제1 하우징 및 제2 측면 부재 를 포함하는 제2 하우징을 포함할 수 있다. 일 실시 예에 따르면, 제1 측면 부재는 제1 방향(예: y 축 방향)을 따라 제1 길이를 갖는 제1 측면, 제1 측면으로부터 실질적으로 수직한 방향(예: x 축 방향)을 따라 제1 길이보다 짧은 제2 길이를 갖도록 연장된 제2 측면 및 제2 측면으로부터 제1 측면과 실질적으로 평행하게 연장되고 제1 길이를 갖는 제3 측면을 포함할 수 있다. 일 실시 예에 따르면, 제1 측면 부재는 적어도 부분적으로 도전성 부재(예: 금속)로 형성될 수 있다. 예를 들면, 제1 측면 부재는 도전성 부재 및 비도전성 부재(예: 폴리머)의 결합에 의해 형성될 수 있다. 일 실시 예에 따르면, 제1 하우징은 제1 측면 부재의 적어도 일부로부터 제1 공간의 적어도 일 부까지 연장된 제1 지지 부재를 포함할 수 있다. 일 실시 에 따르면, 제1 지지 부재는 제1 측면 부재와 일체로 형성될 수 있다. 예를 들면, 제1 지지 부재는 제1 측면 부재와 별개로 형성되고, 제1 측면 부재와 구조적으로 결합될 수도 있다. 일 실시 예에 따르면, 제2 측면 부재는 적어도 부분적으로 제1 측면과 대응될 수 있다. 제2 측면 부 재는 제3 길이를 갖는 제4 측면, 제4 측면으로부터 제2 측면과 실질적으로 평행한 방향 으로 연장되고 제3 길이보다 짧은 제4 길이를 갖는 제5 측면, 및 제5 측면으로부터 제3 측면과 대응되도록 연장되고 제3 길이를 갖는 제6 측면을 포함할 수 있다. 일 실시 예에 따르면, 제2 측면 부재는 적어도 부분적으로 도전성 부재(예: 금속)로 형성될 수 있다. 예를 들면, 제2 측면 부재는 도전성 부재 및 비도전성 부재(예: 폴리머)의 결합에 의해 형성될 수 있다. 일 실시 예에 따르면, 제2 측면 부재의 적어도 일부는 제2 하우징의 제2 공간의 적어도 일부까 지 연장된 제2 지지 부재를 포함할 수 있다. 일 실시 예에 따르면, 제2 지지 부재는 제2 측면 부재와 일체로 형성될 수 있다. 예를 들면, 제2 지 지 부재는 제2 측면 부재와 별개로 형성되고, 제2 측면 부재와 구조적으로 결합될 수도 있다. 일 실시 예에 따르면, 제1 측면과 제4 측면은 서로에 대하여 슬라이딩 가능하게 결합될 수 있다. 일 실시 예에 따르면, 제3 측면과 제6 측면은 서로에 대하여 슬라이딩 가능하게 결합될 수 있다. 일 실시 예에 따르면, 인입 상태에서, 제1 측면은 제4 측면과 중첩됨으로써, 실질적으로 외부로부 터 보이지 않게 배치될 수 있다. 일 실시 예에 따르면, 인입 상태에서, 제3 측면은 제6 측면과 중첩됨으로써, 실질적으로 외부로부 터 보이지 않게 배치될 수 있다. 예를 들면, 제1 측면 및 제3 측면의 적어도 일부는 인입 상태에서, 적어도 부분적으로 외부로부터 보일 수 있게 배치될 수도 있다. 일 실시 예에 따르면, 인입 상태에서, 제1 지지 부재는 제2 지지 부재와 중첩됨으로써, 실질적으로 외부로부터 보이지 않게 배치될 수 있다. 일 실시 예에 따르면, 제1 하우징은 제1 측면 부재의 적어도 일부와 결합된 제1 후면 커버를 포 함할 수 있다. 일 실시 예에 따르면, 제1 후면 커버는 제1 지지 부재의 적어도 일부와 결합되는 방식으로 배치될 수 있다. 예를 들면, 제1 후면 커버는 제1 측면 부재와 일체로 형성될 수도 있다. 일 실시 예에 따르면, 제1 후면 커버는 폴리머, 코팅 또는 착색된 유리, 세라믹, 금속(예: 알루미늄, 스테 인레스 스틸(STS), 또는 마그네슘), 또는 이러한 소재들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 예를 들면, 제1 후면 커버는 제1 측면 부재의 적어도 일부까지 연장될 수도 있다. 예를 들면, 제1 지지 부 재의 적어도 일부는 제1 후면 커버로 대체될 수도 있다. 일 실시 예에 따르면, 제2 하우징은 제2 측면 부재의 적어도 일부와 결합된 제2 후면 커버를 포 함할 수 있다. 일 실시 예에 따르면, 제2 후면 커버는 제2 지지 부재의 적어도 일부와 결합되는 방식으로 배치될 수 있다. 예를 들면, 제2 후면 커버는 제2 측면 부재와 일체로 형성될 수도 있다. 일 실시 예에 따르면, 제2 후면 커버는 폴리머, 코팅 또는 착색된 유리, 세라믹, 금속(예: 알루미늄, 스테 인레스 스틸(STS), 또는 마그네슘), 또는 이러한 소재들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 예를 들면, 제2 후면 커버는 제2 측면 부재의 적어도 일부까지 연장될 수도 있다. 예를 들면, 제2 지지 부 재의 적어도 일부는 제2 후면 커버로 대체될 수도 있다. 일 실시 예에 따르면, 롤러블 디스플레이는 제1 하우징 및 제2 하우징의 적어도 일부의 지지를 받도록 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이는 항상 외부로부터 보여지는 제1 부분(430a)(예: 평면부) 및 제1 부분(430a)으로부터 연장되는 제2 부분(430b)(예: 굴곡 가능부)을 포함할 수 있다. 제2 부분(430b)(예: 굴곡 가 능부)은 인입 상태에서 외부로부터 보이지 않도록 제2 하우징의 제2 공간으로 적어도 부분적으로 수 용될 수 있다. 일 실시 예에 따르면, 제1 부분(430a)은 제1 하우징의 지지를 받도록 배치될 수 있다. 제2 부분(430b)은 적어도 부분적으로 밴딩 가능 부재의 지지를 받도록 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 제2 부분(430b)은 제1 하우징이 제1 방향(①방향)을 따라 인출된 상태에서, 밴딩 가능 부재의 지지를 받으면서 제1 부분(430a)으로부터 연장될 수 있다. 롤러블 디스플레 이의 제2 부분(430b)은 제1 하우징이 제1 방향(① 방향)을 따라 인출된 상태에서, 제1 부분(430a)과실질적으로 동일한 평면을 형성하고, 외부로부터 보일 수 있도록 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 제2 부분(430b)은 제1 하우징이 제2 방향(②방향)을 따라 인입된 상태에서, 제2 하우징의 제2 공간으로 수용될 수 있다. 롤러블 디스플레이의 제2 부분 (430b)은 제1 하우징이 제2 방향(②방향)을 따라 인입된 상태에서, 외부로부터 보이지 않도록 배치될 수 있다. 따라서, 전자 장치는 제2 하우징으로부터 지정된 방향(예: ±y 축 방향)을 따라 제1 하우징 이 슬라이딩 방식으로 이동됨에 따라 롤러블 디스플레이의 표시 면적이 가변(예: 확장 또는 축소)될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이는 제2 하우징을 기준으로 이동되는 제1 하우징의 슬라 이딩 이동에 따라, 제1 방향(①방향)으로의 길이가 가변(예: 확장 또는 축소)될 수 있다. 예컨대, 롤러블 디스 플레이는 인입 상태에서, 제1 길이(L1)에 대응하는 제1 표시 면적(예: 제1 부분(430a)과 대응하는 영역)을 가질 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이는 인출 상태에서, 제2 하우징을 기준으로 제1 하우징 이 제2 길이(L2) 만큼 슬라이딩 이동할 수 있다. 롤러블 디스플레이는 인출 상태에서, 제1 길이(L1)보다 긴 제3 길이(L3)와 대응될 수 있다. 롤러블 디스플레이는 인출 상태에서, 제1 표시 면적보다 큰 제3 표시 면적(예: 제1 부분(430a)과 제2 부분(430b)을 포함하는 영역)을 갖도록 확장될 수 있다. 일 실시 예에 따르면, 전자 장치의 제1 상태(예: 인출 상태)에서, 외부로 보여지는 롤러블 디스플레이 의 화면 크기(예: 화면 면적)가 최대(예: 실질적으로 최대)가 될 수 있다. 일 실시 예에 따르면, 전자 장치의 제2 상태(예: 인입 상태)에서, 외부로 보여지는 롤러블 디스플레이 의 화면 크기(예: 화면 면적)가 최소(예: 실질적으로 최소)가 될 수 있다. 일 실시 예에 따르면, 전자 장치의 제3 상태(예: 중간 상태)에서, 외부로 보여지는 롤러블 디스플레이 의 화면 크기(예: 화면 면적)는 제1 상태(예: 인출 상태)보다는 작고 제2 상태(예: 인입 상태) 보다는 클 수 있다. 예를 들면, 전자 장치의 제3 상태(예: 중간 상태)에서, 외부로 보여지는 롤러블 디스플레이(43 0)의 화면 크기(예: 화면 면적)는 최대 크기(예: 최대 화면 면적) 보다는 작고 최소 크기(예: 최소 화면 면적) 보다는 클 수 있다. 일 실시 예에 따르면, 전자 장치는, 제1 하우징의 제1 공간에 배치된 음향 입력 장치(예: 마이 크(403-1)), 음향 출력 장치(예: 통화용 리시버 또는 스피커), 센서 모듈(404, 417), 카메라 모듈 (예: 제1 카메라 모듈 또는 제2 카메라 모듈), 커넥터 포트, 키 입력 장치 또는 인디케이 터(미도시 됨) 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 하우징에 배치된 또 다른 입력 장치(예: 마이크)을 포함 할 수 있다. 다른 실시 예로서, 전자 장치는, 상술한 구성 요소들 중 적어도 하나가 생략되거나, 다른 구 성 요소들이 추가적으로 포함되도록 구성될 수도 있다. 다른 실시 예로서, 상술한 구성 요소들 중 적어도 하나 는 제2 하우징의 제2 공간에 배치될 수도 있다. 일 실시 예에 따르면, 음향 입력 장치는, 마이크(403-1)를 포함할 수 있다. 어떤 실시 예에서는, 음향 입력 장 치(예: 마이크(403-1))는 소리의 방향을 감지할 수 있도록 배치되는 복수의 마이크들을 포함할 수도 있다. 음향 출력 장치는, 예를 들어, 통화용 리시버 및 스피커를 포함할 수 있다. 일 실시 예에 따르면, 스피커는, 인입/인출 상태에 관계 없이, 항상 외부로 노출되는 위치(예: 제2 측면 )에서, 제1 하우징에 형성된 적어도 하나의 스피커 홀을 통해 외부와 대응될 수 있다. 일 실시 예에 따르면, 커넥터 포트(예: USB(universal serial bus) 타입 C 단자)는 인출 상태에서, 제1 하우징에 형성된 커넥터 포트 홀을 통해 외부와 대응될 수 있다. 예를 들면, 커넥터 포트는 인입 상 태에서, 제2 하우징에 형성되고, 커넥터 포트 홀과 대응하도록 형성된 오프닝을 통해 외부와 대응될 수도 있다. 예를 들면, 통화용 리시버는 별도의 스피커 홀이 배제된 채, 동작되는 스피커(예: 피에조 스피커)를 포함 할 수도 있다. 일 실시 예에 따르면, 센서 모듈(404, 417)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 예를 들면, 센서 모듈(404, 417)은, 전자 장치의 전면에 배치된 제1 센서 모듈(예: 근접 센서 또는 조도 센서, 가속도 센서, 6축 센서) 및/또는 전자 장치의 후면에 배치된 제2 센서 모듈(예: HRM(heart rate monitoring) 센서)를 포함할 수 있다. 일 실시 예에 따르면, 제1 센서 모듈은 전자 장치의 전면에서, 롤러블 디스플레이의 아래(예: z 축 방향을 기준으로 하부)에 배치될 수 있다. 일 실시 예에 따르면, 제1 센서 모듈 및/또는 제2 센서 모듈은 근접 센서, 조도 센서, TOF(time of flight) 센서, 초음파 센서, 지문 인식 센서, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센 서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서 또는 습도 센서 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 카메라 모듈은, 전자 장치의 전면에 배치된 제1 카메라 모듈 및 전자 장치 의 후면에 배치된 제2 카메라 모듈을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 카메라 모듈 근처에 위치되는 플래시(미도시 됨)를 포함할 수 도 있다. 일 실시 예에 따르면, 카메라 모듈들(405, 416)은, 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시 그널 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 제1 카메라 모듈은 롤러블 디스플레이의 아래(예: z축 방향을 기준으로 하부) 에 배치될 수 있다. 제1 카메라 모듈은 롤러블 디스플레이의 아래(예: z축 방향을 기준으로 하부)에 배치되어, 롤러블 디스플레이의 활성화 영역(예: 표시 영역) 중 일부를 통해 피사체를 촬영하도록 구성될 수도 있다. 일 실시 예에 따르면, 카메라 모듈들 중 제1 카메라 모듈은 롤러블 디스플레이를 통해 외부 환경을 검출하도록 배치될 수 있다. 센서 모듈(404, 417)들 중 일부 센서 모듈은 롤러블 디스플레이를 통해 외부 환경을 검출하도록 배치될 수 있다. 예컨대, 제1 카메라 모듈 또는 일부 센서 모듈은 제1 하우 징의 제1 공간에서, 롤러블 디스플레이에 형성된 투과 영역 또는 천공된 오프닝을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 제1 카메라 모듈과 대면하는 영역은 컨텐츠를 표시하는 표시 영역의 일부로써, 지정된 투과율을 갖는 투과 영역으로 형성될 수도 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 투과 영역은 약 5% 내지 약 20% 범위의 투과율을 갖도록 형성 될 수 있다. 이러한 투과 영역은 이미지 센서로 결상되어 화상을 생성하기 위한 광이 통과하는, 제1 카메라 모 듈의 유효 영역(예: 화각 영역)과 중첩되는 영역을 포함할 수 있다. 예를 들어, 롤러블 디스플레이의 투과 영역은 주변보다 픽셀의 배치 밀도 및/또는 배선 밀도가 낮은 영역을 포함할 수 있다. 예를 들어, 투과 영 역은 상술한 오프닝을 대체할 수 있다. 예를 들어, 일부 카메라 모듈은 언더 디스플레이 카메라(UDC, under display camera)를 포함할 수 있다. 예를 들면, 일부 센서 모듈은 전자 장치의 내부 공간에서 롤러블 디스플레이를 통해 시각적으로 노출되지 않고, 그 기능을 수행하도록 배치될 수도 있다. 일 실시 예에 따르면, 전자 장치는 제2 하우징의 도전성 제2 측면 부재를 통해 배치된 베젤 안 테나(A)를 포함할 수 있다. 예컨대, 베젤 안테나(A)는 제2 측면 부재의 제5 측면 및 제6 측면(421 3)의 적어도 일부에 배치되고, 비도전성 소재(예: 폴리머)로 형성된 적어도 하나의 분절부(4271, 4272)를 통해 전기적으로 분절된 도전성 부분을 포함할 수 있다. 일 실시 예에 따르면, 무선 통신 회로(예: 도 1의 무선 통신 모듈)는 도전성 부분을 통해 지정된 적 어도 하나의 주파수 대역(예: 약 600MHz ~ 9000MHz)(예: legacy 대역 또는 NR 대역)에서 무선 신호를 송신 또는 수신하도록 설정될 수 있다. 일 실시 예에 따르면, 전자 장치는 적어도 하나의 분절부의 적어도 일부를 커버하기 위하여, 제5 측 면에 배치된 측면 커버(4212a)를 포함할 수 있다. 예를 들면, 베젤 안테나(A)는 제4 측면, 제5 측 면 및 제6 측면 중 적어도 하나의 측면에 배치될 수도 있다. 예를 들면, 베젤 안테나(A)는 제1 하 우징의 제1 측면, 제2 측면 및 제3 측면 중 적어도 하나의 측면에 배치될 수도 있다. 일 실시 예에 따르면, 전자 장치는 적어도 하나의 안테나 모듈(예: 5G 안테나 모듈 또는 안테나 구조체)을 더 포함할 수도 있다. 예를 들면, 적어도 하나의 안테나 모듈(예: 5G 안테나 모듈 또는 안테나 구조체)은 전자 장치의 내부 공간(예: 제1 공간 또는 제2 공간)에 배치될 수 있다. 적어도 하나의 안테나 모듈(예: 5G 안테나 모듈 또는 안테나 구조체)은 다른 무선 통신 회로(예: 도 1의 무선 통신 모듈)를 통해, 약 3GHz ~ 100GHz 범위의 주파수 대역에서 무선 신호를 송신 또는 수신하도록 배치될 수 있다. 일 실시 예에 따르면, 전자 장치의 인입/인출 동작은 자동으로 수행될 수 있다. 예컨대, 전자 장치의 인입/인출 동작은, 피니언 기어를 포함하는 구동 모터(예: 기어 구동부)와 랙 기어의 결합을 통해 수행될 수 있 다. 랙 기어는 제1 하우징의 제1 공간에 배치될 수 있다. 피니언 기어를 포함하는 구동 모터(예: 기 어 구동부)는 제2 하우징의 제2 공간에 배치될 수 있다. 예를 들면, 전자 장치의 프로세서(예: 도 1의 프로세서)는, 인입 상태로부터 인출 상태로 변경되기 위한 트리거링 동작을 검출할 경우, 전자 장치의 내부에 배치된 구동 모터를 동작시킬 수 있다. 예를 들면, 전자 장치의 프로세서(예: 도 1의 프로세서)는, 인출 상태로부터 인입 상태로 변경되기 위한 트리거링 동작을 검출할 경우, 전자 장치의 내부에 배치된 구동 모터를 동작시킬 수 있다. 예를 들면, 전자 장치의 상태 변경(예: 인입 또는 인출 상태 변경)의 트리거링 동작은 롤러블 디스플레이 에 표시된 객체(object)를 선택(예: 터치) 또는 전자 장치에 포함된 물리적 버튼(예: 키 버튼)의 조 작을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 하우징의 제2 공간에서, 제1 하우징의 제1 공간 과 가장 가까운, 인출 방향(①방향)으로의 단부에 구동 모터가 배치될 수 있다. 전자 장치는 제1 공 간에 배치된 제1 기판(예: 메인 기판)과 전기적 연결 부재를 통해 전기적으로 연결되는 전기적 연결 구조 를 가질 수 있다. 도 4a의 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회로를 포함할 수 있다. 도 4a의 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 도 5a 및 도 5b는 본 개시의 일 실시 예에 따른 제1 상태(예: 인출 상태, slide-out state)에서 전자 장치의 전 면 및 후면을 도시한 도면이다. 도 5c 및 도 5d는 본 개시의 일 실시 예에 따른 제2 상태(예: 인입 상태, slide-in state)에서 전자 장치의 전면 및 후면을 도시한 도면이다. 도 5a 내지 도 5d의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실 시 예들을 더 포함할 수 있다. 도 5a 내지 도 5d를 참조하면, 본 개시의 일 실시 예에 따른 전자 장치는, 제1 하우징(예: 제1 하우 징 구조 또는 베이스 하우징), 제2 하우징(예: 제2 하우징 구조 또는 슬라이드 하우징), 및 롤러블 디스플 레이(예: 플렉서블 디스플레이)(예: expandable display 또는 stretchable display)를 포함할 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이는 제1 하우징 및 제2 하우징의 적어도 일부의 지지를 받도록 배치될 수 있다. 일 실시 예에 따르면, 제1 하우징과 제2 하우징은 상호 결합될 수 있다. 예를 들면, 제2 하우징(52 0)은 제1 하우징으로부터 지정된 방향(예: x 축 방향) 및 지정된 거리 내에서 이동 가능하게 결합될 수 있 다. 일 실시 예에 따르면, 전자 장치는, 제1 상태(예: 인출 상태, slide-out state)에서, 적어도 부분적으로 제1 하우징의 적어도 일부와 동일한 평면을 형성하기 위한 밴딩 가능 부재(bendable member 또는 bendable support member)(예: 다관절 힌지 모듈 또는 멀티바 조립체)를 포함할 수 있다. 밴딩 가능 부재(bendable member 또는 bendable support member)(예: 다관절 힌지 모듈 또는 멀티바 조립체)는 제2 상태(예: 인입 상 태)에서 적어도 부분적으로 제2 하우징의 제2 공간으로 수용될 수 있다. 일 실시 예에 따르면, 제2 하우징의 적어도 일부는 제1 하우징의 제1 공간에 수용됨으로써, 제 2 상태(예: 인입 상태, slide-in state)로 변경될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 적어도 일부는 제1 상태(예: 인출 상태)에서, 제1 하우징(51 0)과 적어도 부분적으로 동일한 평면을 형성하는 밴딩 가능 부재의 지지를 받으면서, 외부로부터 보일 수 있게 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 적어도 일부는 제2 상태(예: 인입 상태)에서, 밴딩 가능 부재 의 지지를 받으면서 제2 하우징의 내부 공간으로 수용됨으로써 외부로부터 보이지 않게 배치될 수 있다. 일 실시 예에 따르면, 전자 장치의 제1 상태(예: 인출 상태)에서, 외부로 보여지는 롤러블 디스플레이 의 화면 크기(예: 화면 면적)가 최대(예: 실질적으로 최대)가 될 수 있다. 일 실시 예에 따르면, 전자 장치의 제2 상태(예: 인입 상태)에서, 외부로 보여지는 롤러블 디스플레이 의 화면 크기(예: 화면 면적)가 최소(예: 실질적으로 최소)가 될 수 있다. 일 실시 예에 따르면, 전자 장치의 제3 상태(예: 중간 상태)에서, 외부로 보여지는 롤러블 디스플레이 의 화면 크기(예: 화면 면적)는 제1 상태(예: 인출 상태)보다는 작고 제2 상태(예: 인입 상태) 보다는 클 수 있다. 예를 들면, 전자 장치의 제3 상태(예: 중간 상태)에서, 외부로 보여지는 롤러블 디스플레이(53 0)의 화면 크기(예: 화면 면적)는 최대 크기(예: 최대 화면 면적) 보다는 작고 최소 크기(예: 최소 화면 면적) 보다는 클 수 있다. 일 실시 예에 따르면, 전자 장치는 전면(500a)(예: 제1 면, 화면이 표시되는 면), 전면(500a)과 반대 방향 을 향하는 후면(500b)(예: 제2 면) 및 전면(500a)과 후면(500b) 사이의 공간을 둘러싸는 측면(미도시 됨)을 포 함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 측면 부재를 포함하는 제1 하우징 및 제2 측면 부재 를 포함하는 제2 하우징을 포함할 수 있다. 일 실시 예에 따르면, 제1 측면 부재는 제1 방향(예: x 축 방향)을 따라 제1 길이를 갖는 제1 측면, 제1 측면으로부터 실질적으로 수직한 방향(예: y 축 방향)을 따라 제1 길이보다 긴 제2 길이를 갖도록 연 장된 제2측면 및 제2측면으로부터 제1 측면과 실질적으로 평행하게 연장되고 제1 길이를 갖 는 제3측면을 포함할 수 있다. 일 실시 예에 따르면, 제1 측면 부재는 적어도 부분적으로 도전성 소재(예: 금속)로 형성될 수 있다. 일 실시 예에 따르면, 제1 측면 부재의 적어도 일부는 제1 하우징의 제1 공간의 적어도 일부까지 연장된 제1 지지 부재를 포함할 수 있다. 일 실시 예에 따르면, 제2 측면 부재는 적어도 부분적으로 제1 측면과 대응되고, 제3 길이를 갖는 제4 측면, 제4 측면으로부터 제2측면과 실질적으로 평행한 방향으로 연장되고, 제3 길이보다 긴 제4 길이를 갖는 제5 측면 및 제5 측면으로부터 제3측면과 대응되도록 연장되고, 제3 길 이를 갖는 제6 측면을 포함할 수 있다. 일 실시 예에 따르면, 제2 측면 부재는 적어도 부분적으로 도전성 소재(예: 금속)로 형성될 수 있다. 일 실시 예에 따르면, 제2 측면 부재의 적어도 일부는 제2 하우징의 제2 공간의 적어도 일부까지 연장된 제2 지지 부재를 포함할 수 있다. 일 실시 예에 따르면, 제1 측면과 제4 측면 및 제3측면과 제6 측면은 서로에 대하여 슬라이딩 가능하게 결합될 수 있다. 일 실시 예에 따르면, 제2 상태(예: 인입 상태)에서, 제4 측면은 제1 측면과 중첩됨으로써, 실질적으로 외부로부터 보이지 않게 배치될 수 있다. 일 실시 예에 따르면, 제2 상태(예: 인입 상태)에서, 제6 측면은 제3 측면과 중첩됨으로써, 실질적 으로 외부로부터 보이지 않게 배치될 수 있다. 일 실시 예에 따르면, 제4 측면 및 제6 측면의 적어 도 일부는, 제2 상태(예: 인입 상태)에서, 적어도 부분적으로 외부로부터 보일 수 있게 배치될 수도 있다. 일 실시 예에 따르면, 제2 상태(예: 인입 상태)에서, 제2 지지 부재는 제1 지지 부재와 중첩됨으로써, 실질적으로 외부로부터 보이지 않게 배치될 수 있다. 예를 들면, 제2 지지 부재의 일부는, 제2 상태(예: 인입 상태)에서, 제1 지지 부재와 중첩됨으로써 외부로부터 보이지 않게 배치될 수 있다. 제 2 지지 부재의 나머지 일부는 외부로부터 보일 수 있게 배치될 수도 있다. 일 실시 예에 따르면, 전자 장치는 후면(500b)에서, 제1 하우징의 적어도 일부에 배치되는 후면 커버(51 3)를 포함할 수 있다. 일 실시 예에 따르면, 후면 커버는 제1 지지 부재의 적어도 일부를 통해 배치 될 수 있다. 일 실시 예에 따르면, 후면 커버는 제1 측면 부재와 일체로 형성될 수도 있다. 일 실시 예에 따르면, 후면 커버는 폴리머, 코팅 또는 착색된 유리, 세라믹, 금속(예: 알루미늄, 스테인레 스 스틸(STS), 또는 마그네슘), 또는 상기 소재들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 일 실시 예에 따르면, 후면 커버는 제1 측면 부재의 적어도 일부까지 연장될 수도 있다. 일 실시 예에 따르면, 제1 지지 부재의 적어도 일부는 후면 커버로 대체될 수도 있다. 일 실시 예에 따르면, 전자 장치는 제2 하우징에서, 제2 지지 부재의 적어도 일부에 배치되거나, 제2 지지 부 재의 적어도 일부와 대체되는, 또 다른 후면 커버(예: 제2후면 커버)를 포함할 수도 있다. 일 실시 예에 따르면, 롤러블 디스플레이는 제1 부분(530a)(예: 평면부) 및 제2 부분(530b)(예: 굴곡 가능 부)을 포함할 수 있다. 예를 들면, 제1 부분(530a)(예: 평면부)은 항상 외부로부터 시작적으로 보이도록 배치될 수 있다. 예를 들면, 제2 부분(530b)(예: 굴곡 가능부)은 제1 부분(530a)으로부터 연장되고, 제2 상태(예: 인입 상태)에서 외부로부터 적어도 일부분이 보이지 않도록 제2 하우징의 제2 공간으로 적어도 부분적으 로 수용될 수 있다. 일 실시 예에 따르면, 제1 부분(530a)은 제1 하우징의 지지를 받도록 배치될 수 있다. 일 실시 예에 따르면, 제2 부분(530b)은 적어도 부분적으로 밴딩 가능 부재의 지지를 받도록 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이는 제2 하우징이 지정된 제1 방향(①방향)을 따라 이동하여 인출(예: 화면 확장)될 수 있다. 디스플레이는 제2 하우징이 지정된 제1 방향(①방향)을 따라 인출된 상태에서, 밴딩 가능 부재의 지지를 받으면서 제1 부분(530a)으로부터 연장될 수 있다. 롤러블 디스플레이(53 0)는 제1 부분(530a)과 실질적으로 동일한 평면을 형성하고, 외부로부터 보일 수 있도록 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이는 제2 하우징이 지정된 제2 방향(②방향)을 따라 이동하여 인입(예: 화면 축소)될 수 있다. 롤러블 디스플레이의 제2 부분(530b)은 제2 하우징이 지정된 제2 방 향(②방향)을 따라 인입된 상태에서, 제2 하우징의 제2 공간으로 수용되고, 외부로부터 보이지 않도 록 배치될 수 있다. 따라서, 전자 장치는 제1 하우징으로부터 지정된 방향(예: x 축 방향)을 따라 제 2 하우징이 슬라이딩 방식으로 이동됨에 따라 롤러블 디스플레이의 표시 면적이 가변되도록 유도할 수 있다. 일 실시 예에 따르면, 제1 하우징과 제2 하우징은 서로에 대하여 전체 폭이 가변되도록 슬라이딩 방 식으로 동작될 수 있다. 일 실시 예에 따르면, 전자 장치는, 제1 상태(예: 인출 상태)에서, 제2 하우징의 제2 공간에 수용된 밴딩 가능 부재의 적어도 일부가, 추가적인 제2 폭(W2)을 갖도록 이동됨으로써, 제1 폭(W1)보다 큰 제3 폭(W3)을 갖도록 구성될 수 있다. 예컨대, 롤러블 디스플레이는, 제2 상태(예: 인입 상태)에서, 실질적으 로 제1 폭(W1)과 대응하는 표시 면적을 가질 수 있다. 롤러블 디스플레이는, 제1 상태(예: 인출 상태)에서, 실질적으로 제3 폭(W3)과 대응하는 확장된 표시 면적을 가질 수 있다. 일 실시 예에 따르면, 전자 장치는, 제2 상태(예: 인입 상태)에서, 제2측면으로부터 제5 측면(521 2)까지의, 제1 폭(W1)를 갖도록 구성될 수 있다. 일 실시 예에 따르면, 전자 장치의 인입/인출 동작은 자동으로 수행될 수 있다. 예컨대, 전자 장치는, 구동 모듈이 동작되지 않은 상태에서, 제2 상태(예: 인입 상태)로부터 제1 상태(예: 인출 상태)로 변경되기 위한 트리거링 동작을 검출할 경우, 전자 장치의 내부에 배치된 구동 모듈을 동작시킬 수 있다. 예컨대, 전자 장치는, 구동 모듈이 동작되지 않은 상태에서, 제1 상태(예: 인출 상태)로부터 제2 상태(예: 인입 상태)로 변경되기 위한 트리거링 동작을 검출할 경우, 전자 장치의 내부에 배치된 구동 모듈을 동작 시킬 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 인출/인입의 트리거링 동작은 제2 하우징이 인입되려는 제2 방향(예: ②방향)으로 푸시-풀(push-pull) 구간 만큼 이동된 이동 거리를 검출하는 동작을 포함할 수 있다. 예 컨대, 전자 장치는 프로세서(예: 도 1의 프로세서)와 작동적으로 연결되고, 구동 모듈의 구동 모터를 제어하기 위한 구동 모터 제어 모듈을 통해, 구동 모듈을 동작시키거나 정지시킬 수 있다. 일 실시 예에 따르면, 전자 장치는, 제1 하우징의 제1 공간에 배치되는 음향 입력 장치(예: 마 이크), 음향 출력 장치(예: 통화용 리시버 또는 스피커), 센서 모듈(504, 517), 카메라 모듈(제 1 카메라 모듈 또는 제2 카메라 모듈), 커넥터 포트, 키 입력 장치(미도시 됨) 또는 인디케이터 (미도시 됨) 중 적어도 하나를 포함할 수 있다. 일 실시 예로서, 전자 장치는, 상술한 구성 요소들 중 적어도 하나가 생략되거나, 다른 구성 요소들이 추가적으로 포함되도록 구성될 수도 있다. 일 실시 예로서, 상술 한 구성 요소들 중 적어도 하나는 제2 하우징의 제2 공간에 배치될 수도 있다. 일 실시 예에 따르면, 음향 입력 장치는 마이크를 포함할 수 있다. 일 실시 예에서는, 음향 입력 장치(예: 마이크)는 소리의 방향을 감지할 수 있도록 배치되는 복수의 마이크들을 포함할 수도 있다. 음향 출력 장 치는, 예를 들어, 통화용 리시버 및 스피커를 포함할 수 있다. 일 실시 예에 따르면, 스피커는, 제1 상태(예: 인출 상태)에서, 제1 하우징에 형성된 적어도 하나의 스피커 홀을 통해 외부와 대면될 수 있 다. 일 실시 예에 따르면, 커넥터 포트(예: USB(universal serial bus) 타입 C 단자)는, 제1 상태(예: 인출 상태)에서, 제1 하우징에 형성된 커넥터 포트 홀을 통해 외부와 대면될 수 있다. 일 실시 예에 따르면, 통화용 리시버는 별도의 스피커 홀이 배제된 채, 동작되는 스피커(예: 피에조 스피 커)를 포함할 수도 있다. 일 실시 예에 따르면, 센서 모듈(504, 517)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 예를 들면, 센서 모듈(504, 517)은, 전자 장치의 전면(500a)에 배치된 제1 센서 모듈(예: 근접 센서 또는 조도 센서) 및/또는 후면(500b)에 배치된 제2 센 서 모듈(예: HRM(heart rate monitoring) 센서)를 포함할 수 있다. 일 실시 예에 따르면, 제1 센서 모듈은 전자 장치의 전면(500a)에서, 롤러블 디스플레이 아래 (예: z축 방향에서 하부)에 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 아래(예: z축 방향에서 하부)에 디지타이저(digitizer)(예: 도 8의 디지타이저)가 배치될 수 있다. 일 실시 예에 따르면, 제1 센서 모듈 및/또는 제2 센서 모듈은 제스처 센서, 자이로 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 조도 센서, 초음파 센서, 근접 센서, 생체 센서(예: 홍채 인식 센서), 거 리 검출 센서(예: TOF(time of flight) 센서, LiDAR(light detection and ranging) 센서), 기압 센서, 마그네 틱 센서(예: 6축 센서, 지자기 센서), 가속도 센서, 온도 센서, 습도 센서, 또는 지문 인식 센서 중 적어도 하 나를 포함할 수 있다. 일 실시 예에 따르면, 카메라 모듈은, 전자 장치의 전면(500a)에 배치된 제1 카메라 모듈 및 후면 (500b)에 배치된 제2 카메라 모듈을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 카메라 모듈 근처에 위치되는 플래시를 포함할 수 있다. 일 실시 예에 따르면, 카메라 모듈들(505, 516)은, 하나 또는 복수의 렌즈들, 이미지 센서, 메모리, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 제1 카메라 모듈은 롤러블 디스플레이 아래에 배치되고, 롤러블 디스플레이 의 활성화 영역 중 일부를 통해 피사체를 촬영하도록 구성될 수도 있다. 일 실시 예에 따르면, 플래시 는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 일 실시 예에 따르면, 카메라 모듈들 중 제1 카메라 모듈, 센서 모듈(504, 517)들 중 일부 센서 모듈(50 4)은 롤러블 디스플레이를 통해 외부 환경을 검출하도록 배치될 수 있다. 예컨대, 제1 카메라 모듈 또는 일부 센서 모듈은 제1 하우징의 제1 공간에서, 롤러블 디스플레이에 형성된 투과 영 역 또는 천공된 오프닝을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 제1 카메라 모듈과 대면하는 영역은 컨텐츠를 표시하는 영역의 일부로서 지정된 투과율을 갖는 투과 영역으로 형성될 수도 있다. 일 실시 예에 따르면, 롤러블 디스플레이의 투과 영역은 약 5% 내지 약 20% 범위의 투과율을 갖도록 형성 될 수 있다. 이러한 투과 영역은 이미지 센서로 결상되어 화상을 생성하기 위한 광이 통과하는, 제1 카메라 모 듈의 유효 영역(예: 화각 영역)과 중첩되는 영역을 포함할 수 있다. 예를 들어, 롤러블 디스플레이의 투과 영역은 주변보다 픽셀의 밀도 및/또는 배선 밀도가 낮은 영역을 포함할 수 있다. 예를 들어, 투과 영역은 상술한 오프닝을 대체할 수 있다. 예를 들어, 일부 카메라 모듈은 언더 디스플레이 카메라(UDC, under display camera)를 포함할 수 있다. 일 실시 예에 따르면, 일부 센서 모듈은 전자 장치의 내부 공간에서 롤러블 디스플레이를 통해 시각적으로 노출되지 않고, 그 기능을 수행하도록 배치될 수도 있다.일 실시 예에 따르면, 전자 장치는 제1 하우징의 제1 공간에 배치된 무선 통신 회로(예: 도 1 의 무선 통신 모듈)와 전기적으로 연결된 적어도 하나의 안테나(A1, A2)를 포함할 수 있다. 일 실시 예에 따르면, 적어도 하나의 안테나(A1, A2)는, 전자 장치의 상측 영역에 배치된 제1 안테나(A1) 및 하측 영역에 배치된 제2 안테나(A2)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 하우징의 제2측면 및/또는 제2 하우징의 제5 측면 에 배치된 추가적인 적어도 하나의 안테나를 더 포함할 수도 있다. 일 실시 예에 따르면, 제1 안테나(A1)는 제1 측면 부재의 제3측면에서, 적어도 하나의 비도전성 부 분(5111, 5112)을 통해 분절된 제1 도전성 부분을 포함할 수 있다. 일 실시 예에 따르면, 제1 도전성 부분은 지정된 간격으로 이격된 제1 비도전성 부분 및 제2 비도전 성 부분을 통해 분절되도록 배치되고, 무선 통신 회로(예: 도 1의 무선 통신 모듈)와 전기적으로 연 결될 수 있다. 일 실시 예에 따르면, 제2 안테나(A2)는 제1 측면 부재의 제1 측면에서, 적어도 하나의 비도전성 부 분(5211, 5212)을 통해 분절된 제2 도전성 부분을 포함할 수 있다. 일 실시 예에 따르면, 제2 도전성 부분은 지정된 간격으로 이격된 제3비도전성 부분 및 제4비도전성 부분을 통해 분절되도록 배치되고, 무선 통신 회로(예: 도 1의 무선 통신 모듈)와 전기적으로 연결 될 수 있다. 일 실시 예에 따르면, 무선 통신 회로(예: 도 1의 무선 통신 모듈)는 제1 도전성 부분 및/또는 제2도 전성 부분을 통해 지정된 주파수 대역(예: 약 800MHz ~ 6000MHz)(예: legacy 대역)에서 무선 신호를 송신 및/또는 수신하도록 설정될 수 있다. 일 실시 예에 따르면, 전자 장치는 내부 공간(예: 제1 공간 또는 제2 공간)에 배치되는 적어 도 하나의 안테나 모듈(예: 5G 안테나 모듈 또는 안테나 구조체)을 더 포함할 수도 있다. 적어도 하나의 안테나 모듈(예: 5G 안테나 모듈 또는 안테나 구조체)은 다른 무선 통신 회로(예: 도 1의 무선 통신 모듈)를 통해, 약 3GHz ~ 100GHz 범위의 주파수 대역에서 무선 신호를 송신 및 수신하도록 배치될 수 있다. 본 개시의 예시적인 실시 예들에 따른 전자 장치는 인입/인출 동작을 위하여 내부 공간(예: 제2 공간 )에 배치된 구동 모듈을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 구동 모듈이 구동되지 않고, 제1 상태(예: 인출 상태, slide-out state)에서, 제2 하우징이 인입되려는 제2 방향(예: ②방향)으로 푸시-풀 구간 만큼 가압되는 트리거링 동 작을 검출할 수 있다. 트리거 동작을 검출하면, 구동 모듈을 통해 제2 하우징을 자동으로 인입시킬 수 있 다(push and pull-in 동작)(예: slide-in 동작). 일 실시 예에 따르면, 전자 장치는 구동 모듈을 구동시키기 위한 트리거링 동작으로써, 푸시-풀 동작을 이 용할 수 있다. 예컨대, 전자 장치는, 구동 모듈이 구동하지 않고, 제2 상태(예: 인입 상태, slide-in state)에서, 제2 하우징이 인입되려는 제2 방향(예: ②방향)으로 푸시-풀 구간 만큼 가압되는 트리거링 동 작을 검출할 수 있다. 트리거 동작을 검출하면, 구동 모듈을 통해 제2 하우징을 자동으로 인출시킬 수 있 다(예: push and pull-out 동작)(예: slide-out 동작). 도 5a의 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회로를 포함할 수 있다. 도 5a의 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 도 6은 본 개시의 일 실시 예에 따른 전자 장치의 전개 사시도이다. 도 7은 도 6의 전자 장치가 조립된 상태를 나타내는 것으로, 하우징, 브라켓, 방열 부재 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 나타내는 도면이다. 도 6 및 도 7의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예 들을 더 포함할 수 있다. 도 6 및 도 7의 전자 장치는 도 3a의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 6 및 도 7을 참조하면, 본 개시의 일 실시 예에 따른 전자 장치는, 하우징(예: 리어 하우징(rear housing)), 인쇄회로기판(예: PCB(printed circuit boared), PBA(printed board assembly)), 프로세서 (예: 도 1의 프로세서, 어플리케이션 프로세서), 열 전달 부재(예: TIM(thermal interface material), 열 확산 부재), 제1 쉴드캔(650, shieldcan), 제1 차폐 시트(예: 차폐 플레이트), 브라켓 (예: 프론트 브라켓(front bracket), 방열 부재(예: 방열 플레이트, 방열 시트), 커버 플레이트 (예: 금속 플레이트, 금속 시트, 커버 시트), 및 디스플레이(예: 플렉서블 디스플레이)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회로 를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 인터페이스를 포함할 수 있다. 예를 들면, 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 및 /또는 오디오 인터페이스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치를 외부 전자 장치와 전 기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 배터리(예: 도 1의 배터리)를 포함할 수 있다. 배터리는 전 자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충전 불가능한 1차 전지, 또는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 안테나 모듈(예: 도 1의 안테나 모듈)을 포함할 수 있다. 예를 들면, 안테나 모듈은 안테나 및 안테나 구동 회로를 포함할 수 있다. 예를 들면, 안테나는 NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 예를 들면, 안테나는, 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신할 수 있다. 예를 들면, 전자 장치의 측면 베젤 구조의 적어도 일부분 및/또는 하우징(예: 리어 하우징 (rear housing))의 적어도 일부분에 의하여 안테나 구조가 형성될 수 있다. 도 8은 도 7의 A-A' 선에 따른 전자 장치의 단면도이다. 도 9는 도 7의 B-B' 선에 따른 전자 장치의 단면도이다. 도 6 내지 도 9를 참조하면, 일 실시 예에 따르면, 하우징(예: 리어 하우징)은, 상면, 상기 상면에 반대되 는 하면 및 상기 상면과 상기 하면을 감싸는 측면을 포함할 수 있다. 하우징(예: 리어 하우징)의 내부에는 디스플레이(예: 플렉서블 디스플레이) 및 부품들을 수용할 수 있는 공간이 형성될 수 있다. 일 실시 예에 따르면, 브라켓(예: 프론트 브라켓)은,하우징(예: 리어 하우징)의 상면에 배치될 수 있 다. 예를 들면, 브라켓(예: 프론트 브라켓)은, 하우징(예: 리어 하우징)의 내부에 형성된 공간에 수 용될 수 있다. 예를 들면, 브라켓은, 디스플레이와 인쇄회로기판의 사이에 배치될 수 있다. 일 실시 예에 따르면, 인쇄회로기판(예: PCB, PBA)은, 하우징(예: 리어 하우징)의 상면에 배치될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)은, 하우징(예: 리어 하우징)의 내부에 형성된 공간에 수용될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)은 하우징과 브라켓(예: 프론트 브라켓)의 사이에 배치될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)에는 프로세서, 및 전자 부품들이 배치될 수 있다. 전자 부품들은 적어도 하나의 PMIC, 메모리(예: 도 1의 메모리)를 포 함할 수 있다. 예를 들면, 메모리(예: 도 1의 메모리)는 휘발성 메모리 또는 비휘발성 메모리를 포함 할 수 있다. 일 실시 예에 따르면, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 및 전자 부품들은 디 스플레이(예: 플렉서블 디스플레이)와 마주하도록 인쇄회로기판(예: PCB, PBA)의 일면 또는 양면 상 에 배치될 수 있다. 예를 들면, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 및 메모리 (예: 도 1의 메모리)는 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 배치될 수 있다. 예를 들면, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서) 및 메모리(예: 도 1의 메모 리)는 제1 접속 부재(예: 솔더 볼(solder ball))에 의해서 인쇄회로기판(예: PCB, PBA)과 전기 적으로 연결될 수 있다. 예를 들면, PMIC는 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면) 상에 배치될 수 있다. 예를 들면, PMIC는 제2 접속 부재(예: 솔더 볼(solder ball))에 의해서 인쇄회로기판(예: PCB, PB A)과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 지지 부재(예: 지지 브라켓)는 하우징(예: 리어 하우징)의 상면에 배치되고, 인쇄회로기판(예: PCB, PBA)을 지지할 수 있다. 예를 들면, 지지 부재(예: 지지 브라켓)는 하우징 (예: 리어 하우징)과 인쇄회로기판(예: PCB, PBA) 사이에 배치되어, 인쇄회로기판(예: PCB, PBA)을 지지할 수 있다. 일 실시 예에 따르면, 제1 쉴드캔은 인쇄회로기판(예: PCB, PBA) 상에서 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)를 감싸도록 배치될 수 있다. 예를 들면, 제1 쉴드캔은 상면의 일 부에는 개구가 형성되어, 제1 쉴드캔은 상부가 개방될 수 있다. 예를 들면, 제1 쉴드캔은 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 위치할 수 있다. 예 를 들면, 제1 쉴드캔은 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)를 감싸도록 배 치되어, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 전자파를 차폐할 수 있다. 제1 쉴드캔은 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 열을 방열할 수 있다. 일 실시 예에 따르면, 제1 차폐 시트(예: 차폐 플레이트)는, 제1 쉴드캔의 상면을 덮도록 배치될 수 있다. 예를 들면, 제1 차폐 시트(예: 차폐 플레이트)에 의해서 제1 쉴드캔의 상부가 차폐될 수 있다. 예를 들면, 제1 차폐 시트(예: 차폐 플레이트)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)와 메모리에서 발생하는 노이즈를 차폐하는 기능을 가지는 동시에, 프로세서(예: 도 1의 프 로세서, 어플리케이션 프로세서)와 메모리에서 발생하는 열을 방열할 수 있다. 이를 위해, 제1 차폐 시트(예: 차폐 플레이트)는, 열전도율이 높은 금속 재질로 형성될 수 있다. 예를 들면, 제1 차폐 시트 (예: 차폐 플레이트)는 구리(Cu), 알루미늄(Al)과 같은 열전도성이 높은 금속 재질로 형성될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓)의 적 어도 일부와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시 트)는, 브라켓(예: 프론트 브라켓(front bracket)의 상부(예: z축 방향에서 상부)에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 쉴드캔과 일부와 중첩(예: z 축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 쉴드캔 의 상부(예: z축 방향에서 상부)에 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 방열 부재(예: 방열 플레이트, 방열 시트)의 일 영역 상에 배치될 수 있다. 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 방열 부재(예: 방열 플레이트, 방열 시트)를 제1 쉴드캔에 고정하도록 배치될 수 있다. 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 디스플레이(예: 플렉서블 디스플레이) 의 화면을 바라보았을 때, 방열 부재(예: 방열 플레이트, 방열 시트)를 아래 방향(예: -z축 방향)으로 눌 러서 방열 부재(예: 방열 플레이트, 방열 시트)가 제1 쉴드캔에 고정되도록 할 수 있다. 일 실시 예에 따르면, 열 전달 부재(예: TIM, 열 확산 부재)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)의 상면에 배치될 수 있다. 일 실시 예에 따르면, 열 전달 부재(예: TIM, 열 확산 부재)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)와 제1 차폐 시트(예: 차폐 플레이트) 사이에 배치될 수 있다. 예를 들면, 열 전달 부재(예: TIM, 열 확산 부재)는 액상 TIM 또는 고상 TIM을 포함할 수 있다. 열 전달 부재(예: TIM, 열 확산 부재)는 액상 또는 고상의 열전도 매개체로서, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)와 차폐 시트(예: 차폐 플레이트) 간의 열 접촉 면적이 넓어지도록 할 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 디스플레이(예: 플렉서블 디스플 레이)와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 디스플레이(예: 플렉서블 디스플레이)의 하부(예: z축 방향에서 하부)에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓)과 디 스플레이(예: 플렉서블 디스플레이)의 사이에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 쉴드캔과 디스플레이 (예: 플렉서블 디스플레이)의 사이에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 커버 플레이트(예: 금속 플레이 트, 금속 시트, 커버 시트)의 전체와 중첩되도록 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓)의 적 어도 일부와 중첩되도록 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 프로세서(예: 도 1의 프로세서, 어플 리케이션 프로세서)로부터 전달된 열을 빠르게 확산시키고, 열을 공기로 전달할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트)는 그라파이트 시트(graphite sheet) 또는 구리 시트(Cu sheet)로 형성될 수 있다. 일 실시 예에 따르면, 디스플레이(예: 플렉서블 디스플레이)는, 하우징(예: 리어 하우징)의 상면에 배치될 수 있다. 예를 들면, 디스플레이(예: 플렉서블 디스플레이)는, 하우징(예: 리어 하우징)의 내 부에 형성된 공간에 수용될 수 있다. 예를 들면, 디스플레이(예: 플렉서블 디스플레이)는 z축 방향에서 방열 부재(예: 방열 플레이트, 방 열 시트)와 일정 간격(gap)을 두고 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)와 디스플레이(예: 플렉서블 디스플레이) 사이 의 간격을 통해서 방열 패스가 형성될 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 쉴드캔, 및 제2 차폐 시트(예: 차폐 플레이트)를 포함할 수 있다. 일 실시 예에 따르면, 제2 쉴드캔은 인쇄회로기판(예: PCB, PBA) 상에서 전자 부품들을 감싸도록 배 치될 수 있다. 예를 들면, 전자 부품들은 적어도 하나 이상의 PMIC를 포함할 수 있다. 예를 들면, 제2 쉴드캔은 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면) 상에 위치할 수 있다. 예 를 들면, 제2 쉴드캔은 적어도 하나 이상의 PMIC를 감싸도록 배치되어, 적어도 하나 이상의 PMIC에서 발생하는 전자파를 차폐할 수 있다. 제2 쉴드캔은 적어도 하나 이상의 PMIC에서 발생 하는 열을 방열할 수 있다. 예를 들면, 제2 차폐 시트(예: 차폐 플레이트)는, 적어도 하나 이상의 PMIC에서 발생하는 노이즈를 차폐하는 기능을 가지는 동시에, 적어도 하나 이상의 PMIC에서 발생하는 열을 방열할 수 있다. 이를 위해, 제2 차폐 시트(예: 차폐 플레이트)는, 열전도율이 높은 금속 재질로 형성될 수 있다. 예를 들면, 제2 쉴드캔은 상면의 일부에는 개구가 형성되어, 제2 쉴드캔은 상부가 개방될 수 있다. 도 8에서는 제1 쉴드캔이 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면)에 배치되고, 제2 쉴드캔 이 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면)에 배치되어 있다. 따라서, 제1 쉴드캔의 상 면의 개구와 제2 쉴드캔의 상면의 개구는 서로 반대 방향으로 형성될 수 있다. 일 실시 예에 따르면, 제2 차폐 시트(예: 차폐 플레이트)는, 제2 쉴드캔의 상면(도 8 및 도 9에서는 아래쪽)을 덮도록 배치될 수 있다. 예를 들면, 제2 차폐 시트(예: 차폐 플레이트)에 의해서 제2 쉴드캔 의 상부(도 8 및 도 9에서는 하부)가 차폐될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 방열 부재(예: 방열 플레이트, 방열 시트) 상에서 제1 쉴드캔에 대응하는 부분에 배치될 수 있다. 예를 들면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는 제1 쉴드캔의 일부와 중첩되 도록 배치될 수 있다. 예를 들면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는 제1 쉴드캔의 전체와 중첩되 도록 배치될 수 있다. 예를 들면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는 열 전달 부재(예: TIM, 열 확산 부재), 제1 차폐 시트(예: 차폐 플레이트), 및 방열 부재(예: 방열 플레이트, 방열 시트)를 사 이에 두고 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)의 일부분 또는 전체와 중첩되도록배치될 수 있다. 도 10a 및 도 10b는 본 개시의 일 실시 예에 따른 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 고정 구조를 나타내는 도면이다. 도 8, 도 9, 도 10a 및 도 10b를 참조하면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 커버부, 제1 고정부, 및 제2 고정부을 포함할 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 커버부는, 제1 쉴 드캔의 상면과 대응되어, 제1 쉴드캔의 상면을 덮도록 형성될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제1 고정부는, 커 버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제1 측에서 돌출(예: 수평 방향으로 돌출)될 수 있다. 예를 들면, 제1 고정부의 상면이 커버부의 상면의 높이보다는 낮아지도록, 제1 고정부가 밴딩될 수 있다. 예를 들면, 제1 고정부는 브라켓(예: 프론트 브라켓)의 일측의 하부에 배치될 수 있다. 예를 들면, 제1 고정부에는 홈이 형성될 수 있고, 브라켓(예: 프론트 브라켓)의 일측의 하부에는 돌기가 형성될 수 있다. 제1 고정부에 형성된 홈과 브라켓(예: 프론트 브라켓)에 형성된 돌기의 결합 구조에 의해서, 제1 고정부가 브라켓(예: 프론트 브라켓)에 고정될 수 있다. 브라켓(예: 프론트 브라켓)이 제1 고정부를 아래 방향(예: -z축 방향)으로 눌러주어, 방열 부재(예: 방열 플레이트, 방 열 시트)가 제1 차폐 시트(예: 차폐 플레이트)에 밀착되도록 할 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제2 고정부는, 커 버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제2 측에서 돌출(예: 수평 방향으로 돌출)될 수 있다. 예를 들면, 제2 고정부의 상면이 커버부의 상면의 높이보다는 낮아지도록, 제2 고정부가 밴딩(예: 이중 밴딩)될 수 있다. 일 실시 예에 따르면, 제2 고정부는 스크류에 의해서 하우징(예: 리어 하우징)에 고정될 수 있 다. 예를 들면, 제2 고정부는 스크류 홀을 포함할 수 있다. 제2 고정부에 형성된 스크류 홀 에 스크류가 끼워질 수 있다. 예를 들면, 브라켓(예: 프론트 브라켓)에는 스크류가 끼워질 수 있는 브라켓 홀이 형성될 수 있다. 예를 들면, 하우징(예: 리어 하우징)은, 스크류 홀 및 브 라켓 홀과 대응되는 부분에 형성된 스크류 홈을 포함할 수 있다. 예를 들면, 스크류가 스크류 홀 및 브라켓 홀을 관통 및 스크류 홈에 끼워질 수 있다. 스크류를 이용한 제2 고정부 와 하우징(예: 리어 하우징)의 결합 구조에 의해서, 제2 고정부가 하우징(예: 리어 하우징)에 고정될 수 있다. 이러한 고정 구조에 의해서, 제2 고정부를 아래 방향(예: -z축 방향)으로 눌러 주어, 방열 부재(예: 방열 플레이트, 방열 시트)가 제1 차폐 시트(예: 차폐 플레이트)에 밀착되도록 할 수 있다. 도 6 내지 도 10b를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 방열 부재(예: 방열 플레이트, 방열 시트) 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 프로세서 (예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생된 열을 넓은 면적으로 분산시켜, 방열 효율 을 향상시킬 수 있다. 도 6 내지 도 10b를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 방열 부재(예: 방열 플레이트, 방열 시트)를 차폐 시트 (예: 차폐 플레이트)에 밀착시켜 디스플레이(예: 플렉서블 디스플레이)와 방열 부재(예: 방열 플레이트, 방열 시트) 사이에 간격(gap)을 형성할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트), 차 폐 시트(예: 차폐 플레이트), 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 열을 분산시켜, 방열 효율을 향상시킬 수 있다. 도 11 및 도 12는 본 개시의 일 실시 예에 따른 전자 장치의 단면도이다. 도 11 및 도 12의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 11 및 도 12의 전자 장치는 도 3a의 전자 장치와 적어도 일부 유사하 거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 11 및 도 12의 전자 장치는 도 6 내지 도 9 의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다.도 11 및 도 12의 전자 장치를 설명함에 있어서, 도 6 내지 도 9의 전자 장치와 동일(또는 유사)한 구성들에 대한 상세한 설명은 생략될 수 있다. 도 11 및 도 12를 참조하면, 본 개시의 일 실시 예에 따른 전자 장치는, 하우징(예: 리어 하우징 (rear housing)), 인쇄회로기판(예: PCB(printed circuit boared), PBA(printed board assembly)), 프로 세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 열 전달 부재(예: TIM(thermal interface material), 열 확산 부재), 제1 쉴드캔(650, shieldcan), 제1 차폐 시트(예: 차폐 플레이트), 브라켓 (예: 프론트 브라켓(front bracket)), 방열 부재(예: 방열 플레이트, 방열 시트, 도 6 내지 도 9의 방열 부재), 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트), 및 디스플레이(예: 플 렉서블 디스플레이)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회 로를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 인터페이스를 포함할 수 있다. 예를 들면, 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 및 /또는 오디오 인터페이스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치를 외부 전자 장치와 전 기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 배터리(예: 도 1의 배터리)를 포함할 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충전 불가능한 1 차 전지, 또는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 안테나 모듈(예: 도 1의 안테나 모듈)을 포함할 수 있다. 예를 들면, 안테나 모듈은 안테나 및 안테나 구동 회로를 포함할 수 있다. 예를 들면, 안테나는 NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 예를 들면, 안테나는, 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신할 수 있다. 예를 들면, 전자 장치의 측면 베젤 구조의 적어도 일부분 및/또는 하우징(예: 리어 하우징 (rear housing))의 적어도 일부분에 의하여 안테나 구조가 형성될 수 있다. 일 실시 예에 따르면, 인쇄회로기판(예: PCB, PBA)은, 하우징(예: 리어 하우징)의 상면에 배치될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)은, 하우징(예: 리어 하우징)의 내부에 형성된 공간에 수용될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)은 하우징과 브라켓(예: 프론트 브라켓)의 사이에 배치될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)에는 프로세서, 및 전자 부품들이 배치될 수 있다. 전자 부품들은 적어도 하나의 PMIC, 메모리(예: 도 1의 메모리)를 포 함할 수 있다. 예를 들면, 메모리(예: 도 1의 메모리)는 휘발성 메모리 또는 비휘발성 메모리를 포함 할 수 있다. 일 실시 예에 따르면, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 및 전자 부품들은 디 스플레이(예: 플렉서블 디스플레이)와 마주하도록 인쇄회로기판(예: PCB, PBA)의 일면 또는 양면 상 에 배치될 수 있다. 예를 들면, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 및 메모리 (예: 도 1의 메모리)는 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 배치될 수 있다. 예를 들면, PMIC는 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면) 상에 배치될 수 있다. 일 실시 예에 따르면, 지지 부재(예: 지지 브라켓)는 하우징(예: 리어 하우징)의 상면에 배치되고, 인쇄회로기판(예: PCB, PBA)을 지지할 수 있다. 일 실시 예에 따르면, 제1 쉴드캔은 인쇄회로기판(예: PCB, PBA) 상에서 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)를 감싸도록 배치될 수 있다. 예를 들면, 제1 쉴드캔은 상면의 일 부에는 개구가 형성되어, 제1 쉴드캔은 상부가 개방될 수 있다. 예를 들면, 제1 쉴드캔은 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 위치할 수 있다. 예 를 들면, 제1 쉴드캔은 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)를 감싸도록 배 치되어, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 전자파를 차폐할 수있다. 제1 쉴드캔은 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 열을 방열할 수 있다. 일 실시 예에 따르면, 제1 차폐 시트(예: 차폐 플레이트)는, 제1 쉴드캔의 상면을 덮도록 배치될 수 있다. 예를 들면, 제1 차폐 시트(예: 차폐 플레이트)에 의해서 제1 쉴드캔의 상부가 차폐될 수 있다. 예를 들면, 제1 차폐 시트(예: 차폐 플레이트)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 노이즈를 차폐하는 기능을 가지는 동시에, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 열을 방열할 수 있다. 이를 위해, 제1 차폐 시트(예: 차폐 플레이트)는, 열전도율이 높은 금속 재질(예: 구리(Cu))로 형성될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓)의 적어도 일부와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓(front bracket)의 상부(예: z축 방향에서 상부)에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 쉴드캔과 일부와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 쉴드캔 의 상부(예: z축 방향에서 상부)에 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 방열 부재(예: 방열 플레이트, 방열 시트)의 일 영역 상에 배치될 수 있다. 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 방열 부재(예: 방열 플레이트, 방열 시트)를 제1 쉴드캔에 고정하도록 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 디스플레이(예: 플렉서블 디스플레이)의 화면을 바라보았을 때, 방열 부재(예: 방열 플레이트, 방열 시트)를 아래 방향 (예: -z축 방향)으로 눌러서 방열 부재(예: 방열 플레이트, 방열 시트)가 제1 쉴드캔에 고정되도록 할 수 있다. 일 실시 예에 따르면, 열 전달 부재(예: TIM, 열 확산 부재)은, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)의 상면에 배치될 수 있다. 일 실시 예에 따르면, 열 전달 부재(예: TIM, 열 확산 부재)은, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)와 제1 차폐 시트(예: 차폐 플레이트) 사이에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 디스플레이(예: 플렉서블 디스 플레이)와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 디스플레이(예: 플렉서블 디스플레이)의 하부(예: z축 방향에서 하부)에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓)과 디스플레이(예: 플렉서블 디스플레이)의 사이에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 쉴드캔과 디스플레이 (예: 플렉서블 디스플레이)의 사이에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 커버 플레이트(예: 금속 플레이 트, 금속 시트, 커버 시트)의 전체와 중첩되도록 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓)의 적어도 일부와 중첩되도록 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 프로세서(예: 도 1의 프로세서, 어플 리케이션 프로세서)로부터 전달된 열을 빠르게 확산시키고, 열을 공기로 전달할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트)는 그라파이트 시트(graphite sheet) 또는 구리 시트(Cu sheet)로 형성될 수 있다. 일 실시 예에 따르면, 디스플레이(예: 플렉서블 디스플레이)는, 하우징(예: 리어 하우징)의 상면에 배치될 수 있다. 예를 들면, 디스플레이(예: 플렉서블 디스플레이)는, 하우징(예: 리어 하우징)의 내 부에 형성된 공간에 수용될 수 있다. 예를 들면, 디스플레이(예: 플렉서블 디스플레이)는 z축 방향에서 방열 부재(예: 방열 플레이트, 방 열 시트)와 일정 간격(gap)을 두고 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)와 디스플레이(예: 플렉서블 디스플레이) 사이 의 간격을 통해서 방열 패스가 형성될 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 쉴드캔, 및 제2 차폐 시트(예: 차폐 플레이트)를 포함 할 수 있다. 일 실시 예에 따르면, 제2 쉴드캔은 인쇄회로기판(예: PCB, PBA) 상에서 전자 부품들을 감싸도록 배 치될 수 있다. 예를 들면, 전자 부품들은 적어도 하나 이상의 PMIC를 포함할 수 있다. 예를 들면, 제2 쉴드캔은 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면) 상에 위치할 수 있다. 예 를 들면, 제2 쉴드캔은 적어도 하나 이상의 PMIC를 감싸도록 배치되어, 적어도 하나 이상의 PMIC에서 발생하는 전자파를 차폐할 수 있다. 제2 쉴드캔은 적어도 하나 이상의 PMIC에서 발생 하는 열을 방열할 수 있다. 예를 들면, 제2 차폐 시트(예: 차폐 플레이트)는, 적어도 하나 이상의 PMIC에서 발생하는 노이즈를 차폐하는 기능을 가지는 동시에, 적어도 하나 이상의 PMIC에서 발생하는 열을 방열할 수 있다. 이를 위해, 제2 차폐 시트(예: 차폐 플레이트)는, 열전도율이 높은 금속 재질로 형성될 수 있다. 예를 들면, 제2 쉴드캔은 상면의 일부에는 개구가 형성되어, 제2 쉴드캔은 상부가 개방될 수 있다. 도 11 및 도 12에서는 제1 쉴드캔이 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면)에 배치되고, 제 2 쉴드캔이 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면)에 배치되어 있다. 따라서, 제1 쉴드캔 의 상면의 개구와 2 쉴드캔의 상면의 개구는 서로 반대 방향으로 형성될 수 있다. 일 실시 예에 따르면, 제2 차폐 시트(예: 차폐 플레이트)는, 제2 쉴드캔의 상면(도 11 및 도 12에서 는 아래쪽)을 덮도록 배치될 수 있다. 예를 들면, 제2 차폐 시트(예: 차폐 플레이트)에 의해서 제2 쉴드캔 의 상부(도 11 및 도 12에서는 하부)가 차폐될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 방열 부재(예: 방열 플레이트, 방열 시트) 상에서 제1 쉴드캔에 대응하는 부분에 배치될 수 있다. 예를 들면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는 제1 쉴드캔의 일부와 중첩되 도록 배치될 수 있다. 예를 들면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는 제1 쉴드캔의 전체와 중첩되 도록 배치될 수 있다. 예를 들면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는 열 전달 부재(예: TIM, 열 확산 부재), 제1 차폐 시트(예: 차폐 플레이트), 및 방열 부재(예: 방열 플레이트, 방열 시트)를 사 이에 두고 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)의 일부분 또는 전체와 중첩되도록 배치될 수 있다. 10a 및 도 10b를 결부하여 설명하면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 커버부 , 제1 고정부, 및 제2 고정부를 포함할 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 커버부는, 제1 쉴 드캔의 상면과 대응되어, 제1 쉴드캔의 상면을 덮도록(예: 제1 쉴드캔의 상면과 중첩되도록) 형 성될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제1 고정부는, 커 버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제1 측에서 돌출(예: 수평 방향으로 돌출)될 수 있다. 예를 들면, 제1 고정부의 상면이 커버부의 상면의 높이보다는 낮아지도록, 제1 고정부가 밴딩될 수 있다. 예를 들면, 제1 고정부는 브라켓(예: 프론트 브라켓)의 일측의 하부에 배치될 수 있다. 예를 들면, 제1 고정부에는 홈이 형성될 수 있고, 브라켓(예: 프론트 브라켓)의 일측의 하부에는 돌기가 형성될 수 있다. 제1 고정부에 형성된 홈과 브라켓(예: 프론트 브라켓)에 형성된 돌기의 결합 구조에 의해서, 제1 고정부가 브라켓(예: 프론트 브라켓)에 고정될 수 있다. 브라켓(예: 프론트브라켓)이 제1 고정부를 아래 방향(예: -z축 방향)으로 눌러주어, 방열 부재(예: 방열 플레이트, 방 열 시트)가 제1 차폐 시트(예: 차폐 플레이트)에 밀착되도록 할 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제2 고정부는, 커 버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제2 측에서 돌출(예: 수평 방향으로 돌출)될 수 있다. 예를 들면, 제2 고정부의 상면이 커버부의 상면의 높이보다는 낮아지도록, 제2 고정부가 밴딩(예: 이중 밴딩)될 수 있다. 일 실시 예에 따르면, 제2 고정부는 스크류에 의해서 하우징(예: 리어 하우징)에 고정될 수 있 다. 예를 들면, 제2 고정부는 스크류 홀을 포함할 수 있다. 제2 고정부에 형성된 스크류 홀 에 스크류가 끼워질 수 있다. 예를 들면, 브라켓(예: 프론트 브라켓)에는 스크류가 끼워질 수 있는 브라켓 홀이 형성될 수 있다. 예를 들면, 하우징(예: 리어 하우징)은, 스크류 홀 및 브 라켓 홀과 대응되는 부분에 형성된 스크류 홈을 포함할 수 있다. 예를 들면, 스크류가 스크류 홀 및 브라켓 홀을 관통 및 스크류 홈에 끼워질 수 있다. 스크류를 이용한 제2 고정부 와 하우징(예: 리어 하우징)의 결합 구조에 의해서, 제2 고정부가 하우징(예: 리어 하우징)에 고정될 수 있다. 이러한 고정 구조에 의해서, 제2 고정부를 아래 방향(예: -z축 방향)으로 눌러 주어, 방열 부재(예: 방열 플레이트, 방열 시트)가 제1 차폐 시트(예: 차폐 플레이트)에 밀착되도록 할 수 있다. 도 11에 도시된 바와 같이, 방열 부재(예: 방열 플레이트, 방열 시트)의 상면 위에 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)가 배치되면, 방열 부재(예: 방열 플레이트, 방 열 시트)의 상면의 높이와 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 상면의 높이가 상 이할 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)의 상면은 제1 높이(H1)에 위치하고, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 상면은 제1 높이(H1)보다 높은 제2 높이(H2) 에 위치할 수 있다. 사용자의 손가락으로 디스플레이(예: 플렉서블 디스플레이)를 누르는(예: -z축 방향으로 누르는) 경우, 방열 부재(예: 방열 플레이트, 방열 시트)의 상면과 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 상면의 단차로 인해서 디스플레이(예: 플렉서블 디스플레이)가 파손될 수도 있다. 도 12에 도시된 바와 같이, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 부분, 제2 부분 , 및 밴딩부를 포함할 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)의 제1 부분은, 커버 플레이트 (예: 금속 플레이트, 금속 시트, 커버 시트)와 중첩되도록 배치될 수 있다. 예를 들면, 방열 부재 (예: 방열 플레이트, 방열 시트)의 제1 부분은, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 전체와 중첩되도록 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)의 제2 부분은, 브라켓(예: 프론트 브라켓)과 중첩되도록 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)의 제2 부분은, 브라켓(예: 프론트 브라켓)의 적어도 일부분과 중첩되도록 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)의 밴딩부는, 제1 부분과 제 2 부분 사이에 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)의 밴딩부의 제1 측은 제1 부분과 연결 되고, 제2 측은 제2 부분과 연결될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)의 밴딩부는, 제1 부분의 상 면의 높이와 제2 부분의 상면의 높이가 상이하도록 밴딩될 수 있다. 예를 들면, 제1 부분은 제1 높이(H1)에 대응하도록 배치될 수 있다. 제2 부분은 제1 높이(H1)보다 높은 제2 높이(H2)에 대응하도록 배치될 수 있다. 제1 부분의 제1 높이(H1)와 제2 부분의 제2 높이 (H2)의 차이는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 높이와 실질적으로 동일할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트)의 제1 부분의 높이(H1)가 제2 부분의 높이 (H2)보다 낮게 위치하여, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 상면의 높이와 방열 부재(예: 방열 플레이트, 방열 시트)의 제2 부분의 높이(H2)가 실질적으로 동일할 수 있다.도 11 및 도 12를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 방열 부재(예: 방열 플레이트, 방열 시트) 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 프로세서 (예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생된 열을 넓은 면적으로 분산시켜, 방열 효율 을 향상시킬 수 있다. 도 11 및 도 12를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 방열 부재(예: 방열 플레이트, 방열 시트)를 차폐 시트 (예: 차폐 플레이트)에 밀착시켜 디스플레이(예: 플렉서블 디스플레이)와 방열 부재(예: 방열 플레이트, 방열 시트) 사이에 갭을 형성할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트), 차폐 시 트(예: 차폐 플레이트), 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 열을 분산시켜, 방열 효율을 향상시킬 수 있다. 도 11 및 도 12를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 상면의 높이와 방열 부재(예: 방열 플레이트, 방열 시트)의 제2 부분의 높이(H2)가 실질적으로 동일해지도록 함으로서, 사용자의 손가락으로 디스플레이(예: 플렉서블 디스플레이)를 누르는(예: -z축 방향으로 누르는) 경우에 디스플레이(예: 플렉서블 디스플레이) 가 파손되는 것을 방지할 수 있다. 도 13 및 도 14는 본 개시의 일 실시 예에 따른 전자 장치의 단면도이다. 도 13 및 도 14의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 13 및 도 14의 전자 장치는 도 3a의 전자 장치와 적어도 일부 유사하 거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 13 및 도 14의 전자 장치는 도 6 내지 도 9 의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 13 및 도 14의 전자 장치는 도 12의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 13 및 도 14의 전자 장치를 설명함에 있어서, 도 6 내지 도 9의 전자 장치와 동일(또는 유사)한 구성들에 대한 상세한 설명은 생략될 수 있다. 도 13 및 도 14의 전자 장치를 설명함에 있어서, 도 12의 전자 장치와 동일(또는 유사)한 구성들에 대한 상세한 설명은 생략될 수 있다. 도 13은 도 7에 도시된 A-A' 선에 따른 전자 장치의 단면도이다. 도 14는 도 7에 도시된 B-B' 선에 따른 전자 장치의 단면도이다. 도 13 및 도 14를 참조하면, 본 개시의 일 실시 예에 따른 전자 장치는, 하우징(예: 리어 하우징 (rear housing)), 인쇄회로기판(예: PCB(printed circuit boared), PBA(printed board assembly)), 프로 세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 열 전달 부재(예: TIM(thermal interface material), 열 확산 부재), 제1 쉴드캔(650, shieldcan), 제1 차폐 시트(예: 차폐 플레이트), 제2 쉴드캔 , 제2 차폐 시트, 브라켓(예: 프론트 브라켓(front bracket), 방열 부재(예: 방열 플레 이트, 방열 시트, 도 12의 방열 부재), 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트), 적어도 하나의 전자 부품, 쉴드 부재, 및 디스플레이(예: 플렉서블 디스플레이)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회 로를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 인터페이스를 포함할 수 있다. 예를 들면, 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 및 /또는 오디오 인터페이스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치를 외부 전자 장치와 전 기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 배터리(예: 도 1의 배터리)를 포함할 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충전 불가능한 1 차 전지, 또는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 안테나 모듈(예: 도 1의 안테나 모듈)을 포함할 수 있다. 예를 들면, 안테나 모듈은 안테나 및 안테나 구동 회로를 포함할 수 있다. 예를 들면, 안테나는NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 예를 들면, 안테나는, 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신할 수 있다. 예를 들면, 전자 장치의 측면 베젤 구조의 적어도 일부분 및/또는 하우징(예: 리어 하우징 (rear housing))의 적어도 일부분에 의하여 안테나 구조가 형성될 수 있다. 일 실시 예에 따르면, 인쇄회로기판(예: PCB, PBA)은, 하우징(예: 리어 하우징)의 상면에 배치될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)은, 하우징(예: 리어 하우징)의 내부에 형성된 공간에 수용될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)은 브라켓(예: 프론트 브라켓)의 상부에 배 치될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)에는 프로세서, 및 전자 부품들이 배치될 수 있다. 전자 부품들은 적어도 하나의 PMIC, 메모리(예: 도 1의 메모리)를 포함할 수 있다. 예를 들면, 메모리(예: 도 1의 메모리)는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 일 실시 예에 따르면, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 및 전자 부품들은 디 스플레이(예: 플렉서블 디스플레이)와 마주하도록 인쇄회로기판(예: PCB, PBA)의 일면 또는 양면 상 에 배치될 수 있다. 예를 들면, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 및 메모리 (예: 도 1의 메모리)는 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 배치될 수 있다. 예를 들면, PMIC는 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면) 상에 배치될 수 있다. 일 실시 예에 따르면, 지지 부재(예: 지지 브라켓)는 하우징(예: 리어 하우징)의 상면에 배치되고, 인쇄회로기판(예: PCB, PBA)을 지지할 수 있다. 일 실시 예에 따르면, 제1 쉴드캔은 인쇄회로기판(예: PCB, PBA) 상에서 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)를 감싸도록 배치될 수 있다. 예를 들면, 제1 쉴드캔은 상면의 일 부에는 개구가 형성되어, 제1 쉴드캔은 상부가 개방될 수 있다. 예를 들면, 제1 쉴드캔은 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 위치할 수 있다. 예 를 들면, 제1 쉴드캔은 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)를 감싸도록 배 치되어, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 전자파를 차폐할 수 있다. 제1 쉴드캔은 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 열을 방열할 수 있다. 일 실시 예에 따르면, 제1 차폐 시트(예: 차폐 플레이트)는, 제1 쉴드캔의 상면을 덮도록 배치될 수 있다. 예를 들면, 제1 차폐 시트(예: 차폐 플레이트)에 의해서 제1 쉴드캔의 상부가 차폐될 수 있다. 예를 들면, 제1 차폐 시트(예: 차폐 플레이트)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 노이즈를 차폐하는 기능을 가지는 동시에, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 열을 방열할 수 있다. 이를 위해, 제1 차폐 시트(예: 차폐 플레이 트)는, 열전도율이 높은 금속 재질로 형성될 수 있다. 일 실시 예에 따르면, 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 적어도 하나의 전자 부품 이 배치될 수 있다. 일 실시 예에 따르면, 적어도 하나의 전자 부품을 감싸도록 쉴드 부재가 배치될 수 있다. 예를 들 면, 쉴드 부재는 적어도 하나의 전자 부품을 감싸도록 배치되어, 적어도 하나의 전자 부품에 서 발생하는 전자파를 차폐할 수 있다. 쉴드 부재는 적어도 하나의 전자 부품에서 발생하는 열을 방열할 수 있다. 예를 들면, 쉴드 부재는 제1 쉴드캔 또는 제2 쉴드캔과 동일한 형상과 동일 재질로 형성될 수 있다. 예를 들면, 쉴드 부재는 제1 차폐 시트(예: 차폐 플레이트) 또는 제2 차폐 시트(예: 차폐 플레이트)를 포함할 수 있다. 예를 들면, 쉴드 부재는 제1 쉴드캔과 제1 차폐 시트(예: 차폐 플레이트)가 일체화된 형태로 형성될 수 있다. 예를 들면, 쉴드 부재는 제2 쉴드캔 과 제2 차폐 시트(예: 차폐 플레이트)가 일체화된 형태로 형성될 수 있다. 일 실시 예에 따르면, 브라켓(예: 프론트 브라켓)의 일부분이 오픈된 부분에 쉴드 부재가 배치될 수 있다. 예를 들면, 제1 쉴드캔과 쉴드 부재는, 브라켓(예: 프론트 브라켓)의 적어도 일부를 사 이에 두고 이격되어 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓)의 적어도 일부와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓(front bracket))의 상부(예: z축 방향에서 상부)에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 쉴드캔과 일부와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 쉴드캔 의 상부(예: z축 방향에서 상부)에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 쉴드 부재의 적어도 일부(또는 전체)와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트) 는, 쉴드 부재의 상부(예: z축 방향에서 상부)에 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 방열 부재(예: 방열 플레이트, 방열 시트)의 일 영역 상에 배치될 수 있다. 커버 플레이트(예: 금속 플레이트, 금속 시 트, 커버 시트)는, 방열 부재(예: 방열 플레이트, 방열 시트)를 제1 쉴드캔에 고정하도록 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 디스플레이(예: 플렉서블 디스플레이)의 화면을 바라보았을 때, 방열 부재(예: 방열 플레이트, 방열 시트)를 아래 방향 (예: -z축 방향)으로 눌러서 방열 부재(예: 방열 플레이트, 방열 시트)가 제1 쉴드캔에 고정되도록 할 수 있다. 일 실시 예에 따르면, 열 전달 부재(예: TIM, 열 확산 부재)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)의 상면에 배치될 수 있다. 일 실시 예에 따르면, 열 전달 부재(예: TIM, 열 확산 부재)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)와 제1 차폐 시트(예: 차폐 플레이트) 사이에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 디스플레이(예: 플렉서블 디스 플레이)와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 디스플레이(예: 플렉서블 디스플레이)의 하부(예: z축 방향에서 하부)에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓)과 디스플레이(예: 플렉서블 디스플레이)의 사이에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 쉴드캔과 디스플레이 (예: 플렉서블 디스플레이)의 사이에 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 커버 플레이트(예: 금속 플레 이트, 금속 시트, 커버 시트)의 전체와 중첩되도록 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 브라켓(예: 프론트 브라켓)의 적어도 일부와 중첩되도록 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 프로세서(예: 도 1의 프로세서, 어플 리케이션 프로세서), 및 적어도 하나의 전자 부품으로부터 전달된 열을 빠르게 확산시키고, 열을 공기로 전달할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트)는 그라파이트 시트(graphite sheet) 또는 구 리 시트(Cu sheet)로 형성될 수 있다. 일 실시 예에 따르면, 디스플레이(예: 플렉서블 디스플레이)는, 하우징(예: 리어 하우징)의 상면에 배치될 수 있다. 예를 들면, 디스플레이(예: 플렉서블 디스플레이)는, 하우징(예: 리어 하우징)의 내 부에 형성된 공간에 수용될 수 있다. 예를 들면, 디스플레이(예: 플렉서블 디스플레이)는 z축 방향에서 방열 부재(예: 방열 플레이트, 방 열 시트)와 일정 간격(gap)을 두고 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)와 디스플레이(예: 플렉서블 디스플레이) 사이 의 간격을 통해서 방열 패스가 형성될 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 쉴드캔, 및 제2 차폐 시트(예: 차폐 플레이트)를 포함 할 수 있다. 일 실시 예에 따르면, 제2 쉴드캔은 인쇄회로기판(예: PCB, PBA) 상에서 전자 부품들을 감싸도록 배 치될 수 있다. 예를 들면, 전자 부품들은 적어도 하나 이상의 PMIC를 포함할 수 있다. 예를 들면, 제2 쉴드캔은 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면) 상에 위치할 수 있다. 예 를 들면, 제2 쉴드캔은 적어도 하나 이상의 PMIC를 감싸도록 배치되어, 적어도 하나 이상의 PMIC에서 발생하는 전자파를 차폐할 수 있다. 제2 쉴드캔은 적어도 하나 이상의 PMIC에서 발생 하는 열을 방열할 수 있다. 예를 들면, 제2 차폐 시트(예: 차폐 플레이트)는, 적어도 하나 이상의 PMIC에서 발생하는 노이즈를 차폐하는 기능을 가지는 동시에, 적어도 하나 이상의 PMIC에서 발생하는 열을 방열할 수 있다. 이를 위해, 제2 차폐 시트(예: 차폐 플레이트)는, 열전도율이 높은 금속 재질로 형성될 수 있다. 예를 들면, 제2 쉴드캔은 상면의 일부에는 개구가 형성되어, 제2 쉴드캔은 상부가 개방될 수 있다. 도 13 및 도 14 에서는 제1 쉴드캔이 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면)에 배치되고, 제2 쉴드캔이 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면)에 배치되어 있다. 따라서, 제1 쉴드캔 의 상면의 개구와 2 쉴드캔의 상면의 개구는 서로 반대 방향으로 형성될 수 있다. 일 실시 예에 따르면, 제2 차폐 시트(예: 차폐 플레이트)는, 제2 쉴드캔의 상면(도 13 및 도 14에서 는 아래쪽)을 덮도록 배치될 수 있다. 예를 들면, 제2 차폐 시트(예: 차폐 플레이트)에 의해서 제2 쉴드캔 의 상부(도 13 및 도 14에서는 하부)가 차폐될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 방열 부재(예: 방열 플레이트, 방열 시트) 상에서 제1 쉴드캔에 대응하는 부분에 배치될 수 있다. 예를 들면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는 제1 쉴드캔의 일부와 중첩 되도록 배치될 수 있다. 예를 들면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는 제1 쉴드캔의 전체와 중첩 되도록 배치될 수 있다. 예를 들면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는 열 전달 부재(예: TIM, 열 확산 부재), 제1 차폐 시트(예: 차폐 플레이트), 및 방열 부재(예: 방열 플레이트, 방열 시트)를 사 이에 두고 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)의 일부분 또는 전체와 중첩되도록 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 커버부, 제1 고정부, 및 제2 고정부를 포함할 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 커버부는, 제1 쉴드캔의 상면과 대응되어, 제1 쉴드캔의 상면을 덮도록 형성될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 커버부는, 방열 부재(예: 방열 플레이트, 방열 시트)의 상면을 덮도록 형성될 수 있다. 예를 들면, 커버 플레이트 (예: 금속 플레이트, 금속 시트, 커버 시트)의 커버부는, 방열 부재(예: 방열 플레이트, 방열 시트)를 아래 방향(예: -z축 방향)으로 눌러서, 방열 부재(예: 방열 플레이트, 방열 시트)가 차폐 시트 (예: 차폐 플레이트)에 밀착되도록 할 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제1 고정부는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제1 측에서 돌출(예: 수평 방향으로 돌출)될 수 있다. 예를 들면, 제1 고정부의 상면이 커버부의 상면의 높이보다는 낮아지도록, 제1 고정부 가 밴딩될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제2 고정부는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 제2 측에서 돌출(예: 수평 방향으로 돌출)될수 있다. 예를 들면, 제2 고정부의 상면이 커버부의 상면의 높이보다는 낮아지도록, 제2 고정부 가 밴딩될 수 있다. 일 실시 예에 따르면, 제1 고정부는 제1 스크류에 의해서 하우징(예: 리어 하우징)에 고정될 수 있다. 예를 들면, 제1 고정부는 제1 스크류 홀을 포함할 수 있다. 제1 고정부에 형성된 제1 스 크류 홀에 제1 스크류가 끼워질 수 있다. 예를 들면, 하우징(예: 리어 하우징)은, 제1 스크류 홀과 대응되는 부분에 형성된 제1 스크류 홈을 포함할 수 있다. 예를 들면, 제1 스크류가 제1 스크류 홀 을 관통하여 제1 스크류 홈에 끼워질 수 있다. 일 실시 예에 따르면, 제2 고정부는 제2 스크류에 의해서 하우징(예: 리어 하우징)에 고정될 수 있다. 예를 들면, 제2 고정부는 제2 스크류 홀을 포함할 수 있다. 제2 고정부에 형성된 제2 스 크류 홀에 제2 스크류가 끼워질 수 있다. 예를 들면, 하우징(예: 리어 하우징)은, 제2 스크류 홀과 대응되는 부분에 형성된 제2 스크류 홈을 포함할 수 있다. 예를 들면, 제2 스크류가 제2 스크류 홀 을 관통하여 제2 스크류 홈에 끼워질 수 있다. 일 실시 예에 따르면, 제1 스크류를 이용한 제1 고정부와 하우징(예: 리어 하우징)의 결합 구 조에 의해서, 제1 고정부가 하우징(예: 리어 하우징)에 고정될 수 있다. 제2 스크류를 이용한 제2 고정부와 하우징(예: 리어 하우징)의 결합 구조에 의해서, 제2 고정부가 하우징(예: 리어 하우징)에 고정될 수 있다. 이러한 고정 구조에 의해서, 제1 고정부 및 제2 고정부를 아래 방 향(예: -z축 방향)으로 눌러주어, 방열 부재(예: 방열 플레이트, 방열 시트)가 제1 차폐 시트(예: 차폐 플레이트)에 밀착되도록 할 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)는, 제1 부분, 제2 부분, 및 밴딩부를 포함할 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)의 제1 부분은, 커버 플레이트 (예: 금속 플레이트, 금속 시트, 커버 시트)와 중첩되도록 배치될 수 있다. 예를 들면, 방열 부재 (예: 방열 플레이트, 방열 시트)의 제1 부분은, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커 버 시트)의 전체와 중첩되도록 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)의 제2 부분는, 브라켓(예: 프론트 브라켓)과 중첩되도록 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)의 제2 부분는, 브라켓(예: 프론트 브라켓)의 적어도 일부분과 중첩되도록 배치될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)의 밴딩부는, 제1 부분과 제 2 부분 사이에 배치될 수 있다. 예를 들면, 방열 부재(예: 방열 플레이트, 방열 시트)의 밴딩부의 제1 측은 제1 부분과 연결 되고, 제2 측은 제2 부분과 연결될 수 있다. 일 실시 예에 따르면, 방열 부재(예: 방열 플레이트, 방열 시트)의 밴딩부는, 제1 부분의 상 면의 높이와 제2 부분의 상면의 높이가 상이하도록 밴딩될 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트)의 제1 부분의 높이가 제2 부분의 높이보다 낮게 위치하여, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 상면의 높이(H)와 방열 부재 (예: 방열 플레이트, 방열 시트)의 제2 부분의 높이(H)가 실질적으로 동일할 수 있다. 도 13 및 도 14를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 방열 부재(예: 방열 플레이트, 방열 시트) 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 프로세서 (예: 도 1의 프로세서, 어플리케이션 프로세서) 및 적어도 하나의 전자 부품에서 발생된 열을 넓은 면적으로 분산시켜, 방열 효율을 향상시킬 수 있다. 도 13 및 도 14를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 방열 부재(예: 방열 플레이트, 방열 시트)를 차폐 시트 (예: 차폐 플레이트)에 밀착시켜 디스플레이(예: 플렉서블 디스플레이)와 방열 부재(예: 방열 플레이트, 방열 시트) 사이에 갭을 형성할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트), 차폐 시 트(예: 차폐 플레이트), 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 열을분산시켜, 방열 효율을 향상시킬 수 있다. 도 13 및 도 14를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 상면의 높이(H)와 방열 부재(예: 방열 플레이트, 방열 시트)의 제2 부분의 높이(H)가 실질적으로 동일해지도록 함으로서, 사용자의 손가락으로 디스플레이(예: 플 렉서블 디스플레이)를 누르는(예: -z축 방향으로 누르는) 경우에 디스플레이(예: 플렉서블 디스플레이)가 파손되는 것을 방지할 수 있다. 도 15는 본 개시의 일 실시 예에 따른 전자 장치의 단면도이다. 도 15의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 15의 전자 장치는 도 3a의 전자 장치와 적어도 일부 유사하거나, 전자 장치 의 다른 실시 예들을 더 포함할 수 있다. 도 15의 전자 장치는 도 6 내지 도 9의 전자 장치와 적어 도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 15의 전자 장치를 설명함에 있어서, 도 6 내지 도 9의 전자 장치와 동일(또는 유사)한 구성들에 대한 상세한 설명은 생략될 수 있다. 도 15를 참조하면, 본 개시의 일 실시 예에 따른 전자 장치는, 하우징(예: 리어 하우징(rear housing)), 인쇄회로기판(예: PCB(printed circuit boared), PBA(printed board assembly)), 프로세서 (예: 도 1의 프로세서, 어플리케이션 프로세서), 열 전달 부재(예: TIM(thermal interface material), 열 확산 부재), 제1 쉴드캔(650, shieldcan), 제1 차폐 시트(예: 차폐 플레이트), 브라켓 (예: 프론트 브라켓(front bracket), 방열 부재(예: 방열 플레이트, 방열 시트), 커버 플레이트 (예: 금속 플레이트, 금속 시트, 커버 시트), 열전도 압축 부재(예: 열전도 가스켓), 및 디스플레이 (예: 플렉서블 디스플레이)를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회 로를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 인터페이스를 포함할 수 있다. 예를 들면, 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 및 /또는 오디오 인터페이스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치를 외부 전자 장치와 전 기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 배터리(예: 도 1의 배터리)를 포함할 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충전 불가능한 1 차 전지, 또는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 안테나 모듈(예: 도 1의 안테나 모듈)을 포함할 수 있다. 예를 들면, 안테나 모듈은 안테나 및 안테나 구동 회로를 포함할 수 있다. 예를 들면, 안테나는NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 예를 들면, 안테나는, 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신할 수 있다. 예를 들면, 전자 장치의 측면 베젤 구조의 적어도 일부분 및/또는 하우징(예: 리어 하우징 (rear housing))의 적어도 일부분에 의하여 안테나 구조가 형성될 수 있다. 도 15를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 방열 부재(예: 방열 플레이트, 방열 시트) 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 프로세서(예: 도 1 의 프로세서, 어플리케이션 프로세서)에서 발생된 열을 넓은 면적으로 분산시켜, 방열 효율을 향상시킬 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)는, 스크류에 의해서 하우징(예: 리어 하우징)에 고정될 수 있다. 스크류를 이용한 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)와 하우징(예: 리어 하우징)의 결합 구조에 의해서, 커버 플레이트 (예: 금속 플레이트, 금속 시트, 커버 시트)가 고정될 수 있다. 이러한 고정 구조에 의해서, 커버 플레이트 (예: 금속 플레이트, 금속 시트, 커버 시트)를 아래 방향(예: -z축 방향)으로 눌러주어, 방열 부재(예: 방열 플레이트, 방열 시트)가 제1 차폐 시트(예: 차폐 플레이트)에 밀착되도록 할 수 있다. 일 실시 예에 따르면, 열전도 압축 부재(예: 열전도 가스켓)는, 방열 부재(예: 방열 플레이트, 방열 시트)을 상부의 일측에 배치될 수 있다. 예를 들면, 열전도 압축 부재(예: 열전도 가스켓)는, 방열 부재(예: 방열 플레이트, 방열 시트)와 디스플레이(예: 플렉서블 디스플레이) 사이에 배치될 수 있다. 예를 들면, 열전도 압축 부재(예: 열 전도 가스켓)는, 디스플레이(예: 플렉서블 디스플레이)의 비표시 영역(예: 베젤 영역)에 대응하는 위치에 배치될 수 있다. 열전도 압축 부재(예: 열전도 가스켓)에 의해서, 방열 부재(예: 방열 플레이트, 방 열 시트)를 통해 이동된 열을 디스플레이(예: 플렉서블 디스플레이)의 하부 구조물로 확산시켜, 방열 효율 을 향상시킬 수 있다. 도 15를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 금속 플레 이트, 금속 시트, 커버 시트)를 통해 방열 부재(예: 방열 플레이트, 방열 시트)를 차폐 시트(예: 차 폐 플레이트)에 밀착시켜 디스플레이(예: 플렉서블 디스플레이)와 방열 부재(예: 방열 플레이트, 방 열 시트) 사이에 간격(gap)을 형성할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트), 차폐 시트 (예: 차폐 플레이트), 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 열을 분 산시켜, 방열 효율을 향상시킬 수 있다. 도 15를 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 디스플레이(예: 플렉서블 디스 플레이)의 비표시 영역(예: 베젤 영역)에 대응하는 위치에 배치된 열전도 압축 부재(예: 열전도 가스켓) 를 통해서, 방열 부재(예: 방열 플레이트, 방열 시트)를 통해 이동된 열을 디스플레이(예: 플렉서블 디스플레이)의 하부 구조물로 확산시켜, 방열 효율을 향상시킬 수 있다. 도 16 및 도 17은 본 개시의 일 실시 예에 따른 전자 장치의 단면도이다. 도 16 및 도 17의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 16 및 도 17의 전자 장치는 도 3a의 전자 장치와 적어도 일부 유사하 거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 16 및 도 17의 전자 장치는 도 6 내지 도 9 의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 16 및 도 17의 전자 장치는 도 12의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 16 및 도 17의 전자 장치는 도 13 및 도 14의 전자 장치와 적어도 일부 유사하 거나, 전자 장치의 다른 실시 예들을 더 포함할 수 있다. 도 16 및 도 17의 전자 장치를 설명함에 있어서, 도 6 내지 도 9의 전자 장치와 동일(또는 유사)한 구성들에 대한 상세한 설명은 생략될 수 있다. 도 16 및 도 17의 전자 장치를 설명함에 있어서, 도 12의 전자 장치와 동일(또는 유사)한 구성들에 대한 상세한 설명은 생략될 수 있다. 도 16 및 도 17의 전자 장치를 설명함에 있어서, 도 13 및 도 14의 전자 장치와 동일(또는 유사)한 구성들에 대한 상세한 설명은 생략될 수 있다. 도 16 및 도 17의 전자 장치를 설명함에 있어서, 도 15의 전자 자치와 동일(또는 유사)한 구성들에 대한 상세한 설명은 생략될 수 있다. 도 16은 도 7에 도시된 A-A' 선에 따른 전자 장치의 단면도이다. 도 17은 도 7에 도시된 B-B' 선에 따른 전자 장치의 단면도이다. 도 16 및 도 17을 참조하면, 본 개시의 일 실시 예에 따른 전자 장치는, 하우징(예: 리어 하우징 (rear housing)), 인쇄회로기판(예: PCB(printed circuit boared), PBA(printed board assembly)), 프로 세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 열 전달 부재(예: TIM(thermal interface material), 열 확산 부재), 제1 쉴드캔(650, shieldcan), 제1 차폐 시트(예: 차폐 플레이트), 제2 쉴드캔 , 제2 차폐 시트(예: 차폐 플레이트), 복수의 접착 부재들(1610, 1620, 1630), 브라켓(예: 프 론트 브라켓(front bracket), 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이 트, 금속 시트, 커버 시트), 적어도 하나의 전자 부품, 쉴드 부재, 및 디스플레이(예: 플렉서 블 디스플레이)를 포함할 수 있다.일 실시 예에 따르면, 전자 장치는 터치 센서 및 터치 센서 IC(integrated circuit)를 포함하는 터치 회 로를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 전자 펜(예: 스타일러스 펜) 및 디지타이저를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 인터페이스를 포함할 수 있다. 예를 들면, 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 및 /또는 오디오 인터페이스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치를 외부 전자 장치와 전 기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 배터리(예: 도 1의 배터리)를 포함할 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충전 불가능한 1 차 전지, 또는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 안테나 모듈(예: 도 1의 안테나 모듈)을 포함할 수 있다. 예를 들면, 안테나 모듈은 안테나 및 안테나 구동 회로를 포함할 수 있다. 예를 들면, 안테나는NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 예를 들면, 안테나는, 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신할 수 있다. 예를 들면, 전자 장치의 측면 베젤 구조의 적어도 일부분 및/또는 하우징(예: 리어 하우징 (rear housing))의 적어도 일부분에 의하여 안테나 구조가 형성될 수 있다. 일 실시 예에 따르면, 인쇄회로기판(예: PCB, PBA)은, 하우징(예: 리어 하우징)의 상면에 배치될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)은, 하우징(예: 리어 하우징)의 내부에 형성된 공간에 수용될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)은 브라켓(예: 프론트 브라켓)의 상부에 배 치될 수 있다. 예를 들면, 인쇄회로기판(예: PCB, PBA)에는 프로세서, 및 전자 부품들이 배치될 수 있다. 전자 부품들은 적어도 하나의 PMIC, 및/또는 메모리를 포함할 수 있다. 예를 들면, 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 일 실시 예에 따르면, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 및 전자 부품들은 디 스플레이(예: 플렉서블 디스플레이)와 마주하도록 인쇄회로기판(예: PCB, PBA)의 일면 또는 양면 상 에 배치될 수 있다. 예를 들면, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 및 메모리 (예: 도 1의 메모리)는 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 배치될 수 있다. 일 실시 예에 따르면, 지지 부재(예: 지지 브라켓)는 하우징(예: 리어 하우징)의 상면에 배치되고, 인쇄회로기판(예: PCB, PBA)을 지지할 수 있다. 일 실시 예에 따르면, 제1 쉴드캔은 인쇄회로기판(예: PCB, PBA) 상에서 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)를 감싸도록 배치될 수 있다. 예를 들면, 제1 쉴드캔은 상면의 일 부에는 개구가 형성되어, 제1 쉴드캔은 상부가 개방될 수 있다. 예를 들면, 제1 쉴드캔은 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 위치할 수 있다. 예 를 들면, 제1 쉴드캔은 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)를 감싸도록 배 치되어, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 전자파를 차폐할 수 있다. 제1 쉴드캔은 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 열을 방열할 수 있다. 일 실시 예에 따르면, 제1 차폐 시트(예: 차폐 플레이트)는, 제1 쉴드캔의 상면을 덮도록 배치될 수 있다. 예를 들면, 제1 차폐 시트(예: 차폐 플레이트)에 의해서 제1 쉴드캔의 상부가 차폐될 수 있다. 예를 들면, 제1 차폐 시트(예: 차폐 플레이트)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 노이즈를 차폐하는 기능을 가지는 동시에, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)에서 발생하는 열을 방열할 수 있다. 이를 위해, 제1 차폐 시트(예: 차폐 플레이트)는, 열전도율이 높은 금속 재질로 형성될 수 있다. 일 실시 예에 따르면, 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면) 상에 적어도 하나의 전자 부품 이 배치될 수 있다. 일 실시 예에 따르면, 적어도 하나의 전자 부품을 감싸도록 쉴드 부재가 배치될 수 있다. 예를 들 면, 쉴드 부재는 적어도 하나의 전자 부품을 감싸도록 배치되어, 적어도 하나의 전자 부품에 서 발생하는 전자파를 차폐할 수 있다. 쉴드 부재은 적어도 하나의 전자 부품에서 발생하는 열을 방열할 수 있다. 예를 들면, 쉴드 부재는 제1 쉴드캔 또는 제2 쉴드캔과 동일한 형상과 동일 재질로 형성될 수 있다. 예를 들면, 쉴드 부재는 제1 차폐 시트(예: 차폐 플레이트) 또는 제2 차폐 시트(예: 차폐 플레이트)를 포함할 수 있다. 예를 들면, 쉴드 부재는 제1 쉴드캔과 제1 차폐 시트(예: 차폐 플레이트)가 일체화된 형태로 형성될 수 있다. 예를 들면, 쉴드 부재는 제2 쉴드캔 과 제2 차폐 시트(예: 차폐 플레이트)가 일체화된 형태로 형성될 수 있다. 일 실시 예에 따르면, 브라켓(예: 프론트 브라켓)의 일부분이 오픈된 부분에 쉴드 부재가 배치될 수 있다. 예를 들면, 제1 쉴드캔과 쉴드 부재는, 브라켓(예: 프론트 브라켓)의 적어도 일부를 사 이에 두고 이격되어 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)는, 제1 쉴드캔, 제1 차폐 시트(예: 차폐 플레이트), 및 쉴드 부재와 중첩 되도록 배치될 수 있다. 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)는, 브라켓(예: 프론트 브라켓)의 적어도 일부분과 중첩되도록 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)와 제1 차폐 시트(예: 차폐 플레이트) 사이에는 제1 접착 부재이 배치될 수 있 다. 예를 들면, 제1 접착 부재에 의해서 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레 이트, 금속 플레이트, 금속 시트, 커버 시트)가 제1 차폐 시트(예: 차폐 플레이트)의 상면에 부착되어, 고 정될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)와 브라켓(예: 프론트 브라켓)의 적어도 일부분 사이에는 제2 접착 부재이 배치 될 수 있다. 예를 들면, 제2 접착 부재에 의해서 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히 트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)가 브라켓(예: 프론트 브라켓)의 적어도 일부분의 상 면에 부착되어, 고정될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)와 쉴드 부재 사이에는 제3 접착 부재이 배치될 수 있다. 예를 들면, 제3 접착 부재에 의해서 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)가 쉴드 부재의 상면에 부착되어, 고정될 수 있다. 일 실시 예에 따르면, 열 전달 부재(예: TIM, 열 확산 부재)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)의 상면에 배치될 수 있다. 일 실시 예에 따르면, 열 전달 부재(예: TIM, 열 확산 부재)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서)와 제1 차폐 시트(예: 차폐 플레이트) 사이에 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)는, 디스플레이(예: 플렉서블 디스플레이)와 중첩(예: z축 방향에서 중첩)될 수 있다. 예를 들면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커 버 시트)는, 디스플레이(예: 플렉서블 디스플레이)의 하부(예: z축 방향에서 하부)에 배치될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)는, 제1 쉴드캔과 디스플레이(예: 플렉서블 디스플레이)의 사이에 배치될 수 있 다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)는, 제1 쉴드캔의 적어도 일부 또는 전체와 중첩될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)는, 쉴드 부재의 적어도 일부 또는 전체와 중첩될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)는, 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서), 및 적어도 하나의 전자 부품으로부터 전달된 열을 빠르게 확산시키고, 열을 공기로 전달할 수 있다. 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)는, 그라파이트 시트 (graphite sheet) 또는 구리 시트(Cu sheet)로 형성될 수 있다. 일 실시 예에 따르면, 디스플레이(예: 플렉서블 디스플레이)는, 하우징(예: 리어 하우징)의 상면에 배치될 수 있다. 예를 들면, 디스플레이(예: 플렉서블 디스플레이)는, 하우징(예: 리어 하우징)의 내 부에 형성된 공간에 수용될 수 있다. 예를 들면, 디스플레이(예: 플렉서블 디스플레이)는 z축 방향에서 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)와 일정 간격(gap)을 두고 배치될 수 있다. 예를 들면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커 버 시트)와 디스플레이(예: 플렉서블 디스플레이) 사이의 간격을 통해서 방열 패스가 형성될 수 있다. 일 실시 예에 따르면, 제2 쉴드캔은 인쇄회로기판(예: PCB, PBA) 상에서 전자 부품들을 감싸도록 배 치될 수 있다. 예를 들면, 전자 부품들은 적어도 하나 이상의 PMIC를 포함할 수 있다. 예를 들면, 제2 쉴드캔은 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면) 상에 위치할 수 있다. 예 를 들면, 제2 쉴드캔은 적어도 하나 이상의 PMIC를 감싸도록 배치되어, 적어도 하나 이상의 PMIC에서 발생하는 전자파를 차폐할 수 있다. 제2 쉴드캔은 적어도 하나 이상의 PMIC에서 발생 하는 열을 방열할 수 있다. 예를 들면, 제2 차폐 시트(예: 차폐 플레이트)는, 적어도 하나 이상의 PMIC에서 발생하는 노이즈를 차폐하는 기능을 가지는 동시에, 적어도 하나 이상의 PMIC에서 발생하는 열을 방열할 수 있다. 이를 위해, 제2 차폐 시트(예: 차폐 플레이트)는, 열전도율이 높은 금속 재질로 형성될 수 있다. 예를 들면, 제2 쉴드캔은 상면의 일부에는 개구가 형성되어, 제2 쉴드캔은 상부가 개방될 수 있다. 도 11 및 도 12에서는 제1 쉴드캔이 인쇄회로기판(예: PCB, PBA)의 제1 면(예: 상면)에 배치되고, 제 2 쉴드캔이 인쇄회로기판(예: PCB, PBA)의 제2 면(예: 하면)에 배치되어 있다. 따라서, 제1 쉴드캔 의 상면의 개구와 2 쉴드캔의 상면의 개구는 서로 반대 방향으로 형성될 수 있다. 일 실시 예에 따르면, 제2 차폐 시트(예: 차폐 플레이트)는, 제2 쉴드캔의 상면(도 16 및 도 17에서 는 아래쪽)을 덮도록 배치될 수 있다. 예를 들면, 제2 차폐 시트(예: 차폐 플레이트)에 의해서 제2 쉴드캔 의 상부(도 16 및 도 17에서는 하부)가 차폐될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)는, 커버부, 제1 고정부, 및 제2 고정부를 포함할 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)의 커버부는, 제1 쉴드캔의 상면과 대응되어, 제1 쉴드캔의 상면을 덮도록 형성될 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)의 커버부는, 쉴드 부재의 상명과 대응되어, 쉴드 부재의 상면을 덮도록 형성될 수 있다. 예를 들면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커 버 시트)의 커버부는, 제1 차폐 시트(예: 차폐 플레이트)를 아래 방향(예: -z추 방향)으로 눌러서, 제1 차폐 시트(예: 차폐 플레이트)가 열 전달 부재(예: TIM, 열 확산 부재)에 밀착되도록 할 수 있다. 예를 들면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커 버 시트)의 커버부는, 쉴드 부재를 아래 방향(예: -z추 방향)으로 눌러서, 밀착되도록 할 수 있다. 일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)의 제1 고정부는, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이 트, 금속 플레이트, 금속 시트, 커버 시트)의 제1 측에서 돌출(예: 수평 방향으로 돌출)될 수 있다. 예를 들면, 제1 고정부의 상면이 커버부의 상면의 높이보다는 낮아지도록, 제1 고정부가 밴딩될 수 있다.일 실시 예에 따르면, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금 속 시트, 커버 시트)의 제2 고정부는, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이 트, 금속 플레이트, 금속 시트, 커버 시트)의 제2 측에서 돌출(예: 수평 방향으로 돌출)될 수 있다. 예를 들면, 제2 고정부의 상면이 커버부의 상면의 높이보다는 낮아지도록, 제2 고정부가 밴딩될 수 있다. 일 실시 예에 따르면, 제1 고정부는 제1 스크류에 의해서 하우징(예: 리어 하우징)에 고정될 수 있다. 예를 들면, 제1 고정부는 제1 스크류 홀을 포함할 수 있다. 제1 고정부에 형성된 제1 스 크류 홀에 제1 스크류가 끼워질 수 있다. 예를 들면, 하우징(예: 리어 하우징)은, 제1 스크류 홀과 대응되는 부분에 형성된 제1 스크류 홈을 포함할 수 있다. 예를 들면, 제1 스크류가 제1 스크류 홀 을 관통하여 제1 스크류 홈에 끼워질 수 있다. 일 실시 예에 따르면, 제2 고정부는 제2 스크류에 의해서 하우징(예: 리어 하우징)에 고정될 수 있다. 예를 들면, 제2 고정부는 제2 스크류 홀을 포함할 수 있다. 제2 고정부에 형성된 제2 스 크류 홀에 제2 스크류가 끼워질 수 있다. 예를 들면, 하우징(예: 리어 하우징)은, 제2 스크류 홀과 대응되는 부분에 형성된 제2 스크류 홈을 포함할 수 있다. 예를 들면, 제2 스크류가 제2 스크류 홀 을 관통하여 제2 스크류 홈에 끼워질 수 있다. 일 실시 예에 따르면, 제1 스크류를 이용한 제1 고정부와 하우징(예: 리어 하우징)의 결합 구 조에 의해서, 제1 고정부가 하우징(예: 리어 하우징)에 고정될 수 있다. 제2 스크류를 이용한 제2 고정부와 하우징(예: 리어 하우징)의 결합 구조에 의해서, 제2 고정부가 하우징(예: 리어 하우징)에 고정될 수 있다. 이러한 고정 구조에 의해서, 제1 고정부 및 제2 고정부를 아래 방 향(예: -z축 방향)으로 눌러주어, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플 레이트, 금속 시트, 커버 시트)가 제1 차폐 시트(예: 차폐 플레이트)를 밀착시킬 수 있다. 도 16 및 도 17을 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)를 통해 프로세서(예: 도 1의 프로세서, 어플리케이션 프로세서) 및 적어도 하나의 전자 부품에서 발생된 열을 넓은 면적 으로 분산시켜, 방열 효율을 향상시킬 수 있다. 도 16 및 도 17을 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)를 통해 제1 차폐 시트 (예: 차폐 플레이트)에 밀착시켜, 디스플레이(예: 플렉서블 디스플레이)와 커버 플레이트(예: 베이 퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트) 사이에 갭을 형성할 수 있다. 제 1 차폐 시트(예: 차폐 플레이트), 및 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)를 통해 열을 분산시켜, 방열 효율을 향상시킬 수 있다. 도 16 및 도 17을 참조하여 설명한 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)의 상면의 브라켓(예: 프론트 브라켓)의 상면의 높이가 실질적으로 동일해지도록 함으로서, 사용자의 손가락으로 디스플레이(예: 플렉서블 디스플레이)를 누르는(예: -z축 방향으로 누르는) 경우에 디스플레이(예: 플렉서블 디스플레이) 가 파손되는 것을 방지할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치(예: 도 6의 전자 장치)는, 상면, 상기 상면에 반대되는 하면 및 상기 상면과 상기 하면을 감싸는 측면을 포함하는 하우징(예: 도 6 내지 도 9의 하우징), 상기 하우징 의 상기 상면에 배치된 디스플레이(예: 도 8 및 도 9의 디스플레이); 상기 하우징의 내부에 배 치된 브라켓(예: 도 8 및 도 9의 브라켓); 상기 하우징과 상기 브라켓 사이에 배치된 인쇄회로 기판(예: 도 6의 인쇄회로기판620)); 상기 인쇄회로기판의 상기 디스플레이에 마주하는 일면 상에 배 치된 제1 전자 부품(예: 도 8 및 도 9의 프로세서); 상기 제1 전자 부품을 감싸도록 배치된 제1 쉴드 캔(예: 도 8 및 도 9의 제1 쉴드캔); 상기 브라켓의 일부 및 상기 제1 쉴드캔과 중첩되고, 상기 제1쉴드캔 및 상기 디스플레이 사이에 배치된 방열 부재(예: 도 8 및 도 9의 방열 부재); 및 상 기 방열 부재의 일 영역 상에 배치되어 상기 방열 부재를 상기 제1 쉴드캔에 고정하도록 배치된 커버 플레이트(예: 도 8 및 도 9의 커버 플레이트);를 포함할 수 있다. 일 실시 예에 따르면, 상기 커버 플레이트는 상기 제1 쉴드캔에 대응하는 부분에 배치될 수 있다. 일 실시 예에 따르면, 상기 커버 플레이트는, 상기 제1 쉴드캔과 대응되는 커버부; 제1 측에 형 성된 제1 고정부, 상기 제1 측과 반대되는 제2 측에 형성된 제2 고정부;를 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 고정부는 상기 브라켓에 고정될 수 있다. 일 실시 예에 따르면, 상기 제2 고정부는 상기 하우징에 고정될 수 있다. 일 실시 예에 따르면, 상기 제2 고정부는 홀을 포함할 수 있다. 상기 하우징은 상기 홀과 대응되는 부분에 형성된 스크류 홈을 포함할 수 있다. 스크류가 상기 스크류 홀을 관통하여 상 기 스크류 홈에 결합될 수 있다. 일 실시 예에 따르면, 상기 방열 부재는, 상기 커버 플레이트 전체 및 상기 브라켓의 적어도 일 부와 중첩될 수 있다. 일 실시 예에 따르면, 상기 방열 부재는, 상기 커버 플레이트와 중첩되는 제1 부분, 상기 브 라켓과 중첩되는 제2 부분, 및 상기 제1 부분과 상기 제2 부분의 사이에 배치된 밴딩부 ;를 포함할 수 있다. 상기 제1 부분은 제1 높이에 대응하도록 배치될 수 있다. 상기 제2 부분 은 상기 제1 높이보다 높은 제2 높이에 대응하도록 배치될 수 있다. 일 실시 예에 따르면, 상기 커버 플레이트의 상면은 상기 방열 부재의 상면의 높이에 위치하거나, 또는 낮은 높이에 위치할 수 있다. 일 실시 예에 따르면, 제2 전자 부품을 감싸도록 배치된 제2 쉴드캔을 더 포함할 수 있다. 상기 방 열 부재는 상기 제2 쉴드캔과 중첩되도록 배치될 수 있다. 본 개시의 일 실시 예에 따른 전자 장치(예: 도 16 및 도 17의 전자 장치)는, 상면, 상기 상면에 반대되 는 하면 및 상기 상면과 상기 하면을 감싸는 측면을 포함하는 하우징(예: 도 16 및 도 17의 하우징); 상기 하우징의 상기 상면에 배치된 디스플레이(예: 도 6의 디스플레이); 상기 하우징의 내부에 배치된 브라켓 (예: 도 16 및 도 17의 브라켓); 상기 하우징과 상기 브라켓 사이에 배치된 인쇄회로기판(예: 도 16 및 도 17의 인쇄회로기판); 상기 인쇄회로기판의 일면 상에 배치된 제1 전자 부품(예: 도 16 및 도 17의 전자 부품) 및 제2 전자 부품(예: 도 16 및 도 17의 제2 전자 부품); 상기 제1 전자 부 품을 감싸도록 배치된 쉴드캔(예: 도 16 및 도 17의 쉴드캔); 상기 쉴드캔의 상부를 덮도록 배 치되는 차폐 시트(예: 도 16 및 도 17의 차폐 시트); 상기 제2 전자 부품을 감싸도록 배치된 쉴드 부재(예: 쉴드 부재); 및 상기 브라켓의 일부, 상기 쉴드캔, 및 상기 쉴드 부재와 중첩 되고, 상기 디스플레이의 하부에 배치된 커버 플레이트(예: 도 16 및 도 17의 커버 플레이트);를 포 함할 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 커버 플레이트를 상기 차폐 시트에 부착하는 제1 접 착 부재(예: 도 16의 제1 접착 부재)를 포함할 수 있다. 전자 장치는 상기 커버 플레이트를 상기 브라켓에 부착하는 제2 접착 부재(예: 도 16의 제2 접착 부재)를 포함할 수 있다. 전자 장치 는 상기 커버 플레이트를 상기 쉴드 부재에 부착하는 제3 접착 부재(예: 도 16의 제3 접착 부재)를 포함할 수 있다. 일 실시 예에 따르면, 상기 커버 플레이트는 상기 쉴드캔의 일부 또는 전체와 대응되는 부분에 배치 될 수 있다. 일 실시 예에 따르면, 상기 커버 플레이트는 상기 쉴드 부재의 일부 또는 전체와 대응되는 부분에 배치될 수 있다. 일 실시 예에 따르면, 상기 커버 플레이트는 상기 쉴드캔, 및 상기 쉴드 부재와 대응되는 커 버부를 포함할 수 있다. 상기 커버 플레이트는 제1 측에 형성된 제1 고정부를 포함할 수 있 다. 상기 커버 플레이트는 상기 제1 측과 반대되는 제2 측에 형성된 제2 고정부를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 제1 고정부를 상기 하우징에 고정하는 제1 스크류, 및 상기 제2 고정부를 상기 하우징에 고정하는 제2 스크류를 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 고정부는 제1 스크류 홀을 포함할 수 있다. 상기 하우징은 상기 제1 스크류 홀과 대응되는 부분에 형성된 제1 스크류 홈을 포함할 수 있다. 상기 제1 스크류가 상기 제1 스크류 홀을 관통하여 상기 제1 스크류 홈에 결합될 수 있다. 일 실시 예에 따르면, 상기 제2 고정부는 제2 스크류 홀을 포함할 수 있다. 상기 하우징은 상기 제2 스크류 홀과 대응되는 부분에 형성된 제2 스크류 홈를 포함할 수 있다. 상기 제2 스크류가 상기 제 2 스크류 홀을 관통하여 상기 제2 스크류 홈에 결합될 수 있다. 일 실시 예에 따르면, 상기 커버 플레이트의 상면과 상기 브라켓의 상면은 실질적으로 동일한 높이 에 위치할 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 인쇄회로기판에 배치되는 전자 부품, 상기 전자 부품 을 감싸도록 배치되는 제2 쉴드캔, 및 제2 차폐 시트를 더 포함할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 방열 부재(예: 방열 플레이트, 방열 시트) 및 커버 플레이트(예: 금 속 플레이트, 금속 시트, 커버 시트)를 통해 프로세서(예: 어플리케이션 프로세서)에서 발생된 열을 넓은 면적 으로 분산시켜, 방열 효율을 향상시킬 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 통해 방열 부재(예: 방열 플레이트, 방열 시트)를 차폐 시트(예: 차폐 플레이트)에 밀착시켜 디스플레이(예: 플렉서 블 디스플레이)와 방열 부재(예: 방열 플레이트, 방열 시트) 사이에 간격(gap)을 형성할 수 있다. 방열 부재(예: 방열 플레이트, 방열 시트), 차폐 시트(예: 차폐 플레이트), 및 커버 플레이트(예: 금속 플레이트, 금 속 시트, 커버 시트)를 통해 열을 분산시켜, 방열 효율을 향상시킬 수 있다. 본 개시의 전자 장치는, 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 상면의 높이와 방열 부재 (예: 방열 플레이트, 방열 시트)의 제2 부분의 높이가 실질적으로 동일해지도록 함으로서, 사용자의 손가락으로 디스플레이(예: 플렉서블 디스플레이)를 누르는(예: -z축 방향으로 누르는) 경우에 디스플레이(예: 플렉서블 디 스플레이)가 파손되는 것을 방지할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 디스플레이(예: 플렉서블 디스플레이)의 비표시 영역(예: 베젤 영역)에 대응하는 위치에 배치된 열전도 압축 부재(예: 열전도 가스켓)를 통해서, 방열 부재(예: 방열 플레이트, 방열 시트)를 통해 이동된 열을 디스플레이(예: 플렉서블 디스플레이)의 하부 구조물로 확산시켜, 방 열 효율을 향상시킬 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)를 통해 프로세서 및 적어도 하나의 전자 부품에서 발생된 열을 넓은 면적으로 분산시켜, 방열 효율을 향상시킬 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)를 통해 제1 차폐 시트(예: 차폐 플레이트)에 밀착시켜, 디스플레이(예: 플렉 서블 디스플레이)와 커버 플레이트(예: 베이퍼 챔버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트) 사이에 갭을 형성할 수 있다. 제1 차폐 시트(예: 차폐 플레이트), 및 커버 플레이트(예: 베이퍼 챔 버, 히트 파이프, 히트 플레이트, 금속 플레이트, 금속 시트, 커버 시트)를 통해 열을 분산시켜, 방열 효율을 향상시킬 수 있다. 본 개시에서 얻을 수 있는 효과를 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2023-0187196", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "아래의 기재로부터 본 개시가 속하는 기술분야에서 통상적인 지식을 가진 자에게 명확하게 이해될 수 있을 것이다.도면 도면1 도면2a 도면2b 도면2c 도면2d 도면3a 도면3b 도면3c 도면3d 도면3e 도면4a 도면4b 도면4c 도면4d 도면5a 도면5b 도면5c 도면5d 도면6 도면7 도면8 도면9 도면10a 도면10b 도면11 도면12 도면13 도면14 도면15 도면16 도면17"}
{"patent_id": "10-2023-0187196", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다. 도 1은 본 개시의 다양한 실시 예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a 및 도 2b는 본 개시의 일 실시 예에 따른 전자 장치의 제1 상태(예: 펼침 상태, unfolded stage)를 전면 및 후면에서 바라본 도면들이다. 도 2c 및 도 2d는 본 개시의 일 실시 예에 따른 전자 장치의 제2 상태(예: 접힘 상태, folded state)를 전면 및 후면에서 바라본 도면들이다. 도 3a는 본 개시의 일 실시 예에 따른, 제1 상태(예: 펼침 상태, flat state 또는 unfolding state)를 도시한 전자 장치의 사시도이다. 도 3b는 본 개시의 일 실시 예에 따른 제1 상태(예: 펼침 상태)에서, 전자 장치의 전면을 도시한 평면도이다. 도 3c는 본 개시의 일 실시 예에 따른, 제1 상태(예: 펼침 상태)에서, 전자 장치의 후면을 도시한 평면도이다. 도 3d는 본 개시의 일 실시 예에 따른, 제2 상태(예: 접힘 상태, folding state)를 도시한 전자 장치의 사시도 이다. 도 3e는 본 개시의 일 실시 예에 따른, 제3 상태(예: 중간 상태, intermediate state)를 도시한 전자 장치의 사 시도이다. 도 4a 및 도 4b는 본 개시의 다양한 실시 예에 따른 제1 상태(예: 인출 상태(slide-out state))에서 전자 장치 의 전면 및 후면을 도시한 도면이다. 도 4c 및 도 4d는 본 개시의 다양한 실시 예에 따른 제2 상태(예: 인입 상태(slide-in state))에서 전자 장치의전면 및 후면을 도시한 도면이다. 도 5a 및 도 5b는 본 개시의 일 실시 예에 따른 제1 상태(예: 인출 상태, slide-out state)에서 전자 장치의 전 면 및 후면을 도시한 도면이다. 도 5c 및 도 5d는 본 개시의 일 실시 예에 따른 제2 상태(예: 인입 상태, slide-in state)에서 전자 장치의 전 면 및 후면을 도시한 도면이다. 도 6은 본 개시의 일 실시 예에 따른 전자 장치의 전개 사시도이다. 도 7은 도 6의 전자 장치가 조립된 상태를 나타내는 것으로, 하우징, 브라켓, 방열 부재 및 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)를 나타내는 도면이다. 도 8은 도 7의 A-A' 선에 따른 전자 장치의 단면도이다. 도 9는 도 7의 B-B' 선에 따른 전자 장치의 단면도이다. 도 10a 및 도 10b는 본 개시의 일 실시 예에 따른 커버 플레이트(예: 금속 플레이트, 금속 시트, 커버 시트)의 고정 구조를 나타내는 도면이다. 도 11 및 도 12는 본 개시의 일 실시 예에 따른 전자 장치의 단면도이다. 도 13 및 도 14는 본 개시의 일 실시 예에 따른 전자 장치의 단면도이다. 도 15는 본 개시의 일 실시 예에 따른 전자 장치의 단면도이다. 도 16 및 도 17은 본 개시의 일 실시 예에 따른 전자 장치의 단면도이다. 도면 전체에 걸쳐, 동일한 참조 번호가 동일하거나 유사한 요소, 특징 및 구조를 묘사하는 데 사용된다는 점에 유의해야 한다."}
