{"patent_id": "10-2022-0129366", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0049897", "출원번호": "10-2022-0129366", "발명의 명칭": "인공지능 게이트 시스템", "출원인": "씨앤피파트너스 주식회사", "발명자": "조원주"}}
{"patent_id": "10-2022-0129366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "게이트; 및상기 게이트의 상부에 설치되어, 상기 게이트를 통과하려는 출입자를 감지하는 인공지능카메라;를 포함하고,상기 인공지능카메라는 영상객체의 영상을 촬영하는 영상촬영모듈과 상기 영상촬영모듈에서 수집된 영상에서 상기 영상객체의 특정한 부위로서 위치파악의 대상으로 정해지는 특정영상부위의 위치를 추적하며 상기 특정영상부위의 위치를 식별하여, 상기 특정영상부위의 식별된 위치 및 갯수에 따라 정상진입여부를 판단하는 제어부를포함하는 인공지능 보안용 게이트 시스템."}
{"patent_id": "10-2022-0129366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 영상촬영모듈로부터 전송된 영상에서 영상객체의 위치를 검출하는 영상객체검출모듈, 상기 영상객체의 특정한 부위로서 위치파악의 대상으로 정해지는 특정영상부위의 상기 영상내에서의 위치를 추적하는 특정영상부위추적모듈, 상기 영상객체추적모듈에서 추적된 상기 특정영상부위의 위치식별영역에서의 위치를 식별하는 위치식별모듈, 및 상기 위치식별모듈에서 판단한 특정영상부위의 위치에 따라 정상진입여부를 판단하는 정상진입판단모듈을 포함하는 인공지능 보안용 게이트 시스템."}
{"patent_id": "10-2022-0129366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 특정영상부위는 풋(Foot)인 인공지능 보안용 게이트 시스템."}
{"patent_id": "10-2022-0129366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 특정영상부위추적모듈은 보이지 않는 상기 특정영상부위를 검출하기 위해서 인공신경망모델을 이용하여 특정영상부위의 위치를 학습 및 추적하는 인공지능 보안용 게이트 시스템."}
{"patent_id": "10-2022-0129366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 위치식별영역은 상기 게이트에 제1방향에서 접하는 정해진 크기의 영역인 제1통행영역(A-1), 상기 게이트에서 제2방향에서 접하는 정해진 크기의 영역인 제2통행영역(A-2), 상기 제1통행영역에 접하는 정해진 크기의영역인 제1근접영역(B-1), 상기 제2통행영역에 접하는 정해진 크기의 영역인 제2근접영역(B-2)을 포함하는 인공지능 보안용 게이트 시스템."}
{"patent_id": "10-2022-0129366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 위치식별모듈은 상기 특정영상부위는 영역이름, 영역가로크기(width), 영역세로크기(height), 영역x, 영역y, 감지시간(datetime), 및 객체번호를 포함하는 좌표값으로 위치를 식별하는 인공지능 보안용 게이트 시스템."}
{"patent_id": "10-2022-0129366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0049897-3-제6항에 있어서,상기 정상진입판단모듈은 상기 제1통행영역(A-1), 상기 제2통행영역(A-2), 상기 제1근접영역(B-1), 및 상기 제2근접영역(B-2)로 구성되는 군에서 선택되는 하나의 영역에만 상기 특정영상부위가 추적되고, 상기 특정영상부위가 상기 선택된 영역에 1개만 위치하는 것으로 판단될 경우 정상진입으로 보고 게이트를 개방하는 인공지능 보안용 게이트 시스템."}
{"patent_id": "10-2022-0129366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 정상진입판단모듈은 상기 제1통행영역(A-1), 상기 제2통행영역(A-2), 상기 제1근접영역(B-1), 및 상기 제2근접영역(B-2)로 구성되는 군에서 선택되는 둘이상의 영역에 상기 특정영상부위가 위치하는 것으로 판단될 경우에 비정상진입으로 보고 출입문(110)을 폐쇄하는 보안용 게이트 시스템."}
{"patent_id": "10-2022-0129366", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 정상진입판단모듈은 상기 제1통행영역(A-1), 상기 제2통행영역(A-2), 상기 제1근접영역(B-1), 및 상기 제2근접영역(B-2)로 구성되는 군에서 선택되는 하나의 영역에 상기 특정영상부위가 2개이상 위치하는 것으로 판단될 경우에 비정상진입으로 보고 출입문(110)을 폐쇄하는 보안용 게이트 시스템."}
{"patent_id": "10-2022-0129366", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 보안용 게이트 시스템은, 게이트; 및 상기 게이트의 상부에 설치되어, 상기 게이트를 통과하려는 출입자를 감지하는 인공지능카메라;를 포함하고, 상기 인공지능카메라는 영상객체의 영상을 촬영하는 영상촬영모듈과 상기 영상촬영모듈에서 수집된 영상에서 상 기 영상객체의 특정한 부위로서 위치파악의 대상으로 정해지는 특정영상부위의 위치를 추적하며 상기 특정영상부 위의 위치를 식별하여, 상기 특정영상부위의 식별된 위치 및 갯수에 따라 정상진입여부를 판단하는 제어부를 포 함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0129366", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예들은 인공지능 카메라를 구비한 보안 게이트 시스템에 관한 것이다."}
{"patent_id": "10-2022-0129366", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 보안 출입 통제 시스템은 관공서, 연구소, 일반기업, 공항 및 군부대 등에서 비인·허가자의 출입을 제한하고, 건물의 중요 장소 및 취약 지역에 외부인의 출입을 제한하여 내부 인원의 보호, 침입 방지, 내부 중 요 시설 및 각종 정보 보호를 위한 것이다. 이러한 보안 출입 통제 시스템은 대부분 RFID 및/또는 생체 인식 기술을 이용하여 출입자에게 고유 ID 번호가 저장된 RF 카드를 소지하도록 하여 출입 시 카드를 인증하도록 하고 있다. 또한, 생체 인식 기술인 지문 인식, 얼굴 인식, 홍채 인식을 이용하는 경우에도 생체 정보를 등록하는 단말기에 고유 ID를 저장해 ID 등록 여부, 출 입문별 출입 가능 여부 그리고 출입 가능 시간 등을 파악하여 출입을 제한하는 기능을 수행한다. 또한, 출입 통제 소프트웨어를 이용하여 관리자는 출입자의 신상 정보 및 출입 이력을 관리할 수 있으며, 출입 자의 신상 정보 등록 시 출입자별로 고정된 출입등급을 설정하여 출입을 제한할 수 있다. 따라서, 종래의 보안 출입 통제 시스템은 출입 인·허가자가 카드나 지문을 이용하여 출입 인가를 받아 출입 게 이트가 열리면, 출입을 자유롭게 할 수 있었다. 즉, 종래의 보안 출입 통제 시스템은 비 인·허가자가 게이트를 통해서는 무단 침입할 수 없었다. 그러나, 종래의 보안 출입 통제 시스템은 비 인·허가자가 정상적인 진입을 하는 경우 무단 침입할 수 없었지만 2명 이상이 진입하거나 양방향에서 비정상적으로 진입하는 경우에는 이를 통제할 방법이 없었다."}
{"patent_id": "10-2022-0129366", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에 따른 인공지능 게이트 시스템의 실시예들은 종래에 비해 출입 신뢰성이 향상된 인공지능 카메라를 구 비한 보안용 게이트 시스템을 제공하는데 있다. 즉, 본 발명의 해결하고자 하는 과제는 스피드 게이트의 상부에 인공지능카메라를 부착하여 스피드 게이트에 2 인 이상 비정상적으로 무단 침입하는 비 인·허가자를 센싱하여 보안을 강화하고, 또한 무단 출입 시도가 촬영 된 영상을 저장하여 사고에 대한 근거 자료를 보관할 수 있는 인공지능 카메라를 구비한 보안용 게이트 시스템 을 제공하는데 있다."}
{"patent_id": "10-2022-0129366", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 보안용 게이트 시스템은, 게이트; 및 상기 게이트의 상부에 설치되어, 상기 게이트를 통과하려는 출입자를 감지하는 인공지능카메라;를 포함하고, 상기 인공지능카메라는 영상객체의 영상을 촬영하는 영상촬영모듈과 상기 영상촬영모듈에서 수집된 영상에서 상 기 영상객체의 특정한 부위로서 위치파악의 대상으로 정해지는 특정영상부위의 위치를 추적하며 상기 특정영상 부위의 위치를 식별하여, 상기 특정영상부위의 식별된 위치 및 갯수에 따라 정상진입여부를 판단하는 제어부를 포함하는 것을 특징으로 한다. 이 때, 상기 제어부는, 상기 영상촬영모듈로부터 전송된 영상에서 영상객체의 위치를 검출하는 영상객체검출모듈, 상기 영상객체의 특정한 부위로서 위치파악의 대상으로 정해지는 특정영상부위의 상기 영상내에서의 위치를 추 적하는 특정영상부위추적모듈, 상기 영상객체추적모듈에서 추적된 상기 특정영상부위의 위치식별영역에서의 위치를 식별하는 위치식별모듈, 및 상기 위치식별모듈에서 판단한 특정영상부위의 위치에 따라 정상진입여부를 판단하는 정상진입판단모듈을 포함 하는 것이 바람직하다. 또한, 상기 특정영상부위는 풋(Foot)인 것이 바람직하다. 또한, 상기 특정영상부위추적모듈은 보이지 않는 상기 특정영상부위를 검출하기 위해서 인공신경망모델을 이용 하여 특정영상부위의 위치를 학습 및 추적하는 것이 바람직하다. 또한, 상기 위치식별영역은 상기 게이트에 제1방향에서 접하는 정해진 크기의 영역인 제1통행영역(A-1), 상기 게이트에서 제2방향에서 접하는 정해진 크기의 영역인 제2통행영역(A-2), 상기 제1통행영역에 접하는 정해진 크 기의 영역인 제1근접영역(B-1), 상기 제2통행영역에 접하는 정해진 크기의 영역인 제2근접영역(B-2)을 포함하는 것이 바람직하다. 또한, 상기 위치식별모듈은 상기 특정영상부위는 영역이름, 영역가로크기(width), 영역세로크기(height), 영역 x, 영역y, 감지시간(datetime), 및 객체번호를 포함하는 좌표값으로 위치를 식별하는 것이 바람직하다. 또한, 상기 정상진입판단모듈은 상기 제1통행영역(A-1), 상기 제2통행영역(A-2), 상기 제1근접영역(B-1), 및 상 기 제2근접영역(B-2)로 구성되는 군에서 선택되는 하나의 영역에만 상기 특정영상부위가 추적되고, 상기 특정영 상부위가 상기 선택된 영역에 1개만 위치하는 것으로 판단될 경우 정상진입으로 보고 게이트를 개방하는 것이 바람직하다. 또한, 상기 정상진입판단모듈은 상기 제1통행영역(A-1), 상기 제2통행영역(A-2), 상기 제1근접영역(B-1), 및 상 기 제2근접영역(B-2)로 구성되는 군에서 선택되는 둘이상의 영역에 상기 특정영상부위가 위치하는 것으로 판단 될 경우에 비정상진입으로 보고 출입문을 폐쇄하는 것이 바람직하다. 또한, 상기 정상진입판단모듈은 상기 제1통행영역(A-1), 상기 제2통행영역(A-2), 상기 제1근접영역(B-1), 및 상 기 제2근접영역(B-2)로 구성되는 군에서 선택되는 하나의 영역에 상기 특정영상부위가 2개이상 위치하는 것으로 판단될 경우에 비정상진입으로 보고 출입문을 폐쇄하는 것이 바람직하다."}
{"patent_id": "10-2022-0129366", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 종래에 비해 출입 신뢰성이 향상된 인공지능 카메라를 구비한 보안용 게이트 시스템을 제공한다. 즉, 본 발명은 스피드 게이트의 상부에 인공지능 카메라를 부착하여 스피드 게이트의 상부로 무단 침입하는 비 인,허가자를 센싱하여 경고함으로써 보안을 강화하고, 또한 무단 출입 시도가 촬영된 영상을 저장하여 사고에 대한 근거 자료를 보관할 수 있는 인공지능 카메라를 구비한 보안용 게이트 시스템을 제공한다."}
{"patent_id": "10-2022-0129366", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에 본 발명을 상세하게 설명하기에 앞서, 본 명세서에 사용된 용어는 특정의 실시예를 기술하기 위한 것일 뿐 첨부하는 특허청구의 범위에 의해서만 한정되는 본 발명의 범위를 한정하려는 것은 아님을 이해하여야 한다. 본 명세서에 사용되는 모든 기술용어 및 과학용어는 다른 언급이 없는 한은 기술적으로 통상의 기술을 가진 자 에게 일반적으로 이해되는 것과 동일한 의미를 가진다. 본 명세서 및 청구범위의 전반에 걸쳐, 다른 언급이 없는 한 포함(comprise, comprises, comprising)이라는 용 어는 언급된 물건, 단계 또는 일군의 물건, 및 단계를 포함하는 것을 의미하고, 임의의 어떤 다른 물건, 단계 또는 일군의 물건 또는 일군의 단계를 배제하는 의미로 사용된 것은 아니다. 한편, 본 발명의 여러 가지 실시예들은 명확한 반대의 지적이 없는 한 그 외의 어떤 다른 실시예들과 결합될 수 있다. 특히 바람직하거나 유리하다고 지시하는 어떤 특징도 바람직하거나 유리하다고 지시한 그 외의 어떤 특징 및 특징들과 결합될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예 및 이에 따른 효과를 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 카메라를 구비한 보안용 게이트 시스템의 기구적 구성을 도시한 개념도이고, 도 2는 본 발명의 일 실시예에 따른 인공지능 카메라를 구비한 보안용 게이트 시스템의 구성을 나 타내는 블럭도이다. 이에 따르면, 본 발명의 실시예에 따른 인공지능카메라를 구비한 보안용 게이트 시스템은 개폐 가능한 게 이트와, 게이트가 설치되는 제1지지대와, 제1지지대, 제1지지대로부터 상부 방향으로 연장된 제2지지대, 거치대, 및 거치대에 설치되는 인공지능카메라를 포함한다. 또한, 본 발명의 실시예에 따른 인공지능카메라를 구비한 보안용 게이트 시스템은 제1지지대로부터 상부 방향 으로 연장된 제2지지대와, 제2지지대에 설치된 인공지능카메라를 더 포함할 수도 있다. 제1지지대는, 예를 들면, 한정하는 것은 아니지만, 출입자의 양측에 기둥 형태로 형성될 수 있으며, 일측 에 출입자의 ID 카드 또는 생체 정보를 인식하기 위한 ID 카드 리더가 설치될 수 있다. 제1지지대에 는 게이트가 설치됨으로써, 후술할 제어부의 제어 신호에 따라 개방 및/또는 폐쇄가 될 수 있다. 이 러한 ID 카드 리더, 출입문의 설치 구조, 형태, 모양 및/또는 동작 방식은 종래와 동일 또는 유사하 며, 다양하게 변경 가능하므로 더 상세한 설명은 생략하기로 한다. 제2지지대는 제1지지대로부터 연장되어 상부 방향으로 형성될 수 있다. 제2지지대는, 예를들면, 한정하는 것은 아니지만, 한쌍의 제1지지대가 연장되는 형태로 설치될 수 있다. 거치대는 제2지지대의 단부를 서로 연결하는 브리지 형태로 구비될 수 있으나, 이에 제한되지 않으며, 인 공지능카메라를 거치하기 위한 다양한 형상 및 방법으로 구성될 수 있다. 즉, 인공지능카메라가 제2지지대 가 아닌 건물의 천정이나 벽 등의 다른 구조물에 설치될 수 있기 때문이다.h 또한 비정상진입인 경우 경고 메시지나 경고음을 발생하는 경고부와 관리서버로 정보를 전달하기 위한 통 신부, 그리고 촬영된 영상과 출입기록을 저장하는 저장부를 더 포함할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 인공지능 카메라의 구성을 나타내는 블럭도이다. 인공지능카메라는 거치대에 설치되어 하부 방향으로 영상을 촬영하며, 게이트를 통과하는 출입자를 영상으로 촬영하는 일방적인 기능을 수행할 뿐만아니라, 게이트로의 정상진입을 확인하기 위하여 촬영하는 영상 중 정상진입여부를 판단하는 특정 영상객체의 위치를 추적한다. 이를 위하여, 인공지능카메라는 촬영 영역에 대한 영상을 취득하여 전송하는 영상 촬영모듈과 촬영된 영상에서 출입자의비정상 진입여부를 판단하여 실행명령을 수행하는 제어부를 포함한다. 본 실시예에서 영상촬영모듈과 제어부는 설명의 편의상 하나의 인공지능카메라에 포함되어 설치되며, 하나의 인공지능카메라에 영상촬영모듈과 제어부가 모두 포함되는 구성으로 설명한다. 그러나 실시예에 따라서 다수의 영상촬영모듈에 하나의 제어부가 설치되며, 제어부는 별도의 공간에 위치하는 것도 가능하며, 개별적 영 상촬영모듈이 통신부를 구비하여 개별적으로 촬영된 영상들이 유무선 통신을 통하여 관리서버에 위치한 제어부 로 송신되게 할 수 있다. 영상촬영모듈은 예를 들면, 한정하는 것은 아니지만, 거치대에 설치되어, 출입자를 촬영하고, 촬영된 출입 자 영상을 제어부 전송한다. 여기서, 영상촬영모듈은 3차원 카메라, 3차원 스테레오 카메라 또는 입체카메라일 수 있다. 일례로, 3차원 카메라는 2대의 카메라를 사용해 입체 영상을 얻을 수 있는데, 이를 위해 본발명의 실시예에서 평행식 카메라, 직교식 카메라, 수평식 카메라, 교차식 카메라, 수평 이동식 카메라 등이 이용될 수 있다. 다양한 방식의 3차원 카메라로 촬영된 출입자의 영상 분석에 의해, 출입자의 특정영상부위가 추적될 수 있다. 제어부는 ID 카드 리더에 의해 출입자의 ID 카드정보가 인식되기 전에, 인공지능카메라를 통해 게이 트를 통해 비정상적으로 출입자가 지나가는 것을 감지하였을 경우, 경고부에 경고 메시지를 출력하여 출입 자를 제지하거나 주변의 보안 요원이 이를 신속하게 인지할 수 있도록 한다. 이를 위하여 제어부는 영상객체검출모듈, 특정영상부위추적모듈, 특정위치식별모듈, 정상진입판단모듈을 포함한다. 영상객체검출모듈은 영상 촬영모듈로부터 전송된 영상으로부터 딥러닝 객체 검출(Deep learing objectdetection) 방법을 사용하여 객체를 검출한다. 이때, 객체 검출모듈은 R-CNN, Fast R-CNN, Faster R- CNN, R-FCN, YOLO, SSD 등과 같은 공지의 딥러닝 객체 인식 방법을 사용하여 영상 촬영모듈로부터 전송된 영상 으로부터 사람이나 또는 동물 등을 검출할 수 있다. 특정영상부위추적모듈은 영상객체로부터 특정영상부위를 검출한다. 특정영상부위는 영상객체 중 특정한 부위로서 위치파악의 대상으로 정해지는 부위를 말한다. 이 때, 수집된 영상에는 특정영상부위가 노출된 영상과 특정영상부위가 노출되지 않은 영상이 포함된다. 특정영상부위가 노출된 영상에서는 쉽게 특정영상부위의 위치 를 추적할 수 있으나, 특정영상부위가 노출되지 않은 영상에서는 특정영상부위의 위치의 추정이 필요하다. 예를 들어, 특정영상부위가 풋(Foot)인 경우 여러요인에 의해서 가려질 수 있기 때문에 이러한 경우 특정영상부위의 위치를 추정하기 위한 모듈이 필요하다. 통상 사람의 경우 특정영상부위로서 Head나 Foot이 될 수 있으나, 추정을 용이하게 하기 위하여 특정영상부위 는 영상객체(출입자)의 헤드(Head)보다 풋(Foot)으로 선정하는 것이 바람직하다. Foot의 위치는 곧 바닥면을 의 미하는 것이므로 사람의 게이트 진입/통과/진출 여부를 확실히 판단할 수 있기 때문이다. 상대적으로 Head의 위 치는 Foot의 위치와 상관없을 만큼 상체 및 머리 운동에 따라 위치 자유도가 높아 게이트 진입/통과/진출 여부 를 확실히 판단하기 어려운 면이 있다. 특정영상부위추적모듈은 보이지 않는 특정영상부위를 추정하기 위해서 딥러닝으로 구현될 수 있다. 특정 영상부위가 감추어진 수집된 영상들에서 특정영상부위가 가려진 유형을 본인, 앞사람, 뒷사람, 사물에 의해 가 려진 유형으로 분류하고, 이를 인공신경망모델을 이용하여 특정영상부위의 위치를 학습 및 추적하게 한다. 이로 써, 특정영상부위추적모듈은 영상객체로부터 특정영상부위를 직접검출하거나 추정해서 검출할 수 있다. 한편 특정영상부위추적모듈은 인공지능의 기술사용없이 영상객체 탐지로 얻어진 바운딩 박스의 형상변화 와 Foot의 위치(또는 사람 무게중심의 위치) 변화를 모델링하여 Foot의 바닥면 위치를 추정할 수도 있다. 특정영상부위추적모듈은 노출되거나 추정된 위치를 바탕으로 영상객체 중 특정영상부위가 위치식별영역에 서 변화하는 위치를 추적할 수 있게 된다. 위치식별모듈은 특정영상부위추적모듈에서 추출된 특정영상부위의 위치를 식별한다. 도 4는 본 발명의 일 실시예에 따른 인공지능 게이트 시스템에서의 위치식별영역을 설명하는 설명도이다. 이에 따르면, 인공지능카메라는 탑뷰를 볼 수 있도록 설치되므로, 출입자가 게이트로 진입, 통과, 진출하는 위 치식별영역에서의 영상을 촬영할 수 있다. 위치식별영역은 제1근접영역(B-1), 제1통행영역(A-1), 제2통행영역(A-2), 제2근접영역(B-2)을 포함한다. 이 때, 각 영역은 정해진 길이와 폭으로 정해진다. 일예로, 제1근접영역(B-1)은 90×50cm, 제1통행영역(A-1)은 64× 55cm, 제2통행영역(A-2)는 64×55cm, 제2근접영역(B-2) 90×50cm일 수 있다. 위치식별모듈은 특정영상부위가 위치식별영역 중 제1근접영역(B-1), 제1통행영역(A-1), 제2통행영역(A- 2), 제2근접영역(B-2)의 어디에 위치하는 지 식별한다. 이로써 특정영상부위가 위치한 곳에 따라서 제어부가 다 른 실행을 명령할 수 있다. 이때, 특정영상부위는 영역이름, 영역가로크기(width), 영역세로크기(height), 영역x, 영역y, 분류타입 (head,foot), 감지시간(datetime), 객체번호로 정의되는 좌표값으로 위치가 식별된다. 정상진입판단모듈은 특정영상부위의 식별된 위치 및 갯수에 따라 정상진입여부를 판단한다. 정상진입판단모듈은 제1통행영역(A-1), 제2통행영역(A-2), 제1근접영역(B-1), 및 제2근접영역(B-2)로 구 성되는 군에서 선택되는 하나의 영역에만 특정영상부위가 추적되고, 특정영상부위가 선택된 영역에 1개만 위치 하는 것으로 판단될 경우 정상진입으로 보고 게이트를 개방한다. 또한, 정상진입판단모듈은 제1통행영역(A-1), 제2통행영역(A-2), 제1근접영역(B-1), 및 제2근접영역(B- 2)로 구성되는 군에서 선택되는 둘이상의 영역에 상기 특정영상부위가 위치하는 것으로 판단될 경우에 비정상진 입으로 보고 출입문을 폐쇄한다. 또한, 정상진입판단모듈은 제1통행영역(A-1), 제2통행영역(A-2), 제1근접영역(B-1), 및 제2근접영역(B- 2)로 구성되는 군에서 선택되는 하나의 영역에 특정영상부위가 2개이상 위치하는 것으로 판단될 경우에 비정상 진입으로 보고 출입문을 폐쇄한다. 제어부의 동작을 순서에 따라 설명하면, 출입자(영상객체)가 진입함에 따라서 영상객체검출모듈은 수집된 영상 중에서 영상객체를 인공지능적으로 탐지하고, 특정영상부위추적모듈은 영상 내에서 특정영상부위의 위치를 파악하거나 추정하여 검출한다. 이후 위치식별모듈은 영상객체검출모듈로부터 특정영상부위의 위치를 전달받아 영상이름, 영역가로크기 (width), 영역세로크기(height), 영역x, 영역y, 분류타입(head,foot), 감지시간(datetime), 객체번호가 부여된 좌표값으로 특정영상부위의 위치를 파악한다. 다음으로 진입판단모듈은 위치식별영역 내의 특정영상부위의 갯수 를 파악하여 비정상진입 여부를 판단한다. 한편, 제어부는, 상술한 바와 같이, 임의의 적절한 하드웨어, 펌웨어(예를 들어, 주문형 반도체), 소프트 웨어, 또는 소프트웨어, 펌웨어 및 하드웨어의 적절한 조합을 이용하여 구현될 수 있으며, 이에 대한 추가적인 설명은 생략한다. 도 5는 본 발명의 다양한 실시예에 따른 인공지능 카메라를 구비한 보안용 게이트 시스템의 시나리오별 제어부 의 게이트 제어를 도시한 개념도이다. 도 5a는 보안용 게이트 시스템에 출입자가 정상적으로 입장하는 경우를 설명한다. 출입자가 진입함에 따라서 영 상에서 출입자가 검출되고, 출입자의 특정영상부위인 Foot가 영상에서 검출된다. Foot가 먼저 제1근접영역(B- 1)에 검출되면 제어부는 환영메시지와 인증요청메시지를 보내고, 다음으로 출입자가 제1통행영역(A-1)에 입장하 여 진입 인증을 진행하면 제어부는 게이트를 오픈한다. 이후, 출입자가 제2통행영역(A-2)을 통과하고, 제2근접 영역(B-2)을 통과하게 된다. 이 때, 위치식별영역별 좌표값이 추적된다. 도 5b는 보안용 게이트 시스템에 출입자가 정상적으로 퇴장하는 경우를 설명한다. 출입자가 진입함에 따라서 영 상에서 출입자가 검출되고, 출입자의 특정영상부위인 Foot가 영상에서 검출된다. Foot가 먼저 제2근접영역(B- 2)에 검출되면 제어부는 환송메시지를 보내고, 다음으로 출입자가 제2통행영역(A-2)에 입장하면 제어부는 게이 트를 오픈한다. 이후, 출입자가 제1통행영역(A-1)을 통과하고, 진출근접영역(B-1)을 통과하게 된다. 이 때, 위 치식별영역별 좌표값이 추적된다. 도 5c는 보안용 게이트 시스템에 복수의 출입자가 비정상적으로 입장하는 경우를 설명한다. 2인의 출입자가 진 입함에 따라서 영상에서 2인의 출입자가 검출되고, 출입자의 특정영상부위인 Foot가 영상에서 2개가 검출(객체 번호 3, 4)된다. 이 때, 2개의 Foot가 먼저 제1근접영역(B-1)에 있는 것으로 파악되면 제어부는 1차 경고메시지 를 보내고, 2개의 Foot가 제1통행영역(A-1)에 있는 것으로 파악되면 제어부는 2차경고메시지를 보낸다. 도 5d는 보안용 게이트 시스템에 출입자가 통과하기 전에 다른 출입자가 비정상적으로 입장하는 경우를 설명한 다. 출입자가 진입 후 제1통행영역(A-1)에 머무르고 있는 동안 다음의 출입자가 제1근접영역(B-1)에 있는 것으 로 파악되면 제어부는 경고메시지를 보낸다. 도 5e는 보안용 게이트 시스템에 출입자가 통과하기 전에 다른 출입자가 비정상적으로 입장하는 경우를 설명한 다. 출입자가 진출 후 제1통행영역(B-1)에 머무르고 있는 동안 다음의 출입자가 제1근접영역(B-2)에 있는 것으 로 파악되면 제어부는 경고메시지를 보낸다. 이상과 같이 본 발명은 비록 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 상기의 실시예에 한정되는 것은 아니며, 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 그러므로 본 발명의 범위는 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2022-0129366", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 인공지능 카메라를 구비한 보안용 게이트 시스템의 기구적 구성을 도시한 개념도이다. 도 2는 본 발명의 일 실시예에 따른 인공지능 카메라를 구비한 보안용 게이트 시스템의 구성을 나타내는 블럭도 이다. 도 3은 일 실시예에 따른 인공지능 카메라의 구성을 설명한 블럭도도이다. 도 4는 본 발명의 일실시예에 따른 인공지능 게이트 시스템에서의 위치식별영역을 설명하는 설명도이다. 도 5는 본 발명의 다양한 실시예에 따른 인공지능 카메라를 구비한 보안용 게이트 시스템의 시나리오별 동작 흐 름을 도시한 동작도이다."}
