{"patent_id": "10-2019-0151633", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0063121", "출원번호": "10-2019-0151633", "발명의 명칭": "로봇 및 그의 제어 방법", "출원인": "엘지전자 주식회사", "발명자": "최정은"}}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "주행 모터;엘리베이터 제어 장치와 통신하기 위한 통신부;엘리베이터의 내부 공간을 센싱하는 센싱부; 및상기 엘리베이터 제어 장치로부터 수신되는 데이터 또는 상기 센싱부의 센싱 데이터에 기초하여, 상기 엘리베이터로의 탑승 가능 여부를 확인하고,상기 엘리베이터에 탑승 가능한 경우, 상기 통신부 또는 상기 센싱부를 통해 획득되는 상기 엘리베이터의 내부공간 정보에 기초하여 탑승 위치를 설정하고,설정된 탑승 위치로 이동하도록 상기 주행 모터를 제어하는 프로세서를 포함하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 센싱부는 카메라를 포함하고,상기 프로세서는,상기 카메라를 통해 획득되거나 상기 엘리베이터 제어 장치로부터 수신되는 상기 내부 공간의 영상에 기초하여,상기 내부 공간 중 상기 로봇의 탑승 가능 공간의 존재 여부를 감지하고,감지 결과 상기 탑승 가능 공간이 존재하는 경우 상기 엘리베이터에 탑승 가능한 것으로 확인하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 센싱부는 거리 센서를 더 포함하고,상기 프로세서는,상기 내부 공간의 영상 또는 상기 내부 공간에 대한 상기 거리 센서의 센싱 데이터에 기초하여 상기 탑승 가능공간의 존재 여부를 감지하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는,상기 내부 공간 중 상기 엘리베이터의 출입구의 일 측과의 거리가 기준 거리 이상이고 상기 출입구와 가장 근접한 위치를 상기 탑승 위치로 설정하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 센싱부는 카메라 또는 거리 센서 중 적어도 하나를 포함하고,상기 내부 공간 정보는, 상기 내부 공간의 영상 또는 상기 내부 공간에 대한 거리 센서의 센싱 데이터를 포함하고,상기 프로세서는,공개특허 10-2021-0063121-3-상기 내부 공간 정보에 기초하여, 상기 내부 공간 중 기 설정된 기본 탑승 위치로의 탑승 가능 여부를확인하고,확인 결과 상기 기본 탑승 위치에 탑승 가능한 경우, 상기 기본 탑승 위치로 이동하도록 상기 주행 모터를 제어하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 프로세서는,상기 기본 탑승 위치에 탑승 불가능한 경우, 상기 내부 공간 정보에 기초하여 탑승 가능 공간을 감지하고,감지된 탑승 가능 공간 중 상기 기본 탑승 위치와 가장 근접한 위치를 상기 탑승 위치로 설정하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 프로세서는,상기 엘리베이터의 탑승 후, 상기 통신부 또는 상기 센싱부를 통해 상기 엘리베이터의 내부 공간 정보를 획득하고,획득된 내부 공간 정보에 기초하여 상기 기본 탑승 위치로의 이동이 가능함을 감지하고,감지 결과에 기초하여 상기 기본 탑승 위치로 이동하도록 상기 주행 모터를 제어하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 내부 공간 정보는 기 입력된 적어도 하나의 하차 층수를 포함하고,상기 프로세서는,상기 기 입력된 적어도 하나의 하차 층수와 상기 로봇의 하차 층수에 기초하여 상기 탑승 위치를 설정하는로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서는,상기 기 입력된 적어도 하나의 하차 층수와 상기 로봇의 하차 층수에 기초하여, 상기 엘리베이터의 적어도 하나의 탑승자에 대한 상대적인 하차 순서를 추정하고,추정된 하차 순서에 기초하여 상기 탑승 위치를 설정하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 프로세서는,상기 상대적인 하차 순서가 빠를수록, 상기 탑승 위치를 상기 엘리베이터의 출입구와 가깝게 설정하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 프로세서는,상기 로봇의 탑승 층수와 하차 층수 간의 차이에 기초하여 상기 탑승 위치를 설정하고,공개특허 10-2021-0063121-4-상기 차이가 클수록 상기 탑승 위치를 상기 엘리베이터의 출입구와 가깝게 설정하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,머신 러닝 알고리즘에 의해 학습된 탑승 위치 설정 모델에 포함되는 적어도 하나의 명령어를 저장하는 메모리를더 포함하고,상기 탑승 위치 설정 모델은,상기 로봇의 탑승 층수, 하차 층수, 상기 엘리베이터에 기 입력된 적어도 하나의 하차 층수, 탑승자 정보, 또는탑승 대기자 수 중 적어도 하나를 포함하는 입력 데이터에 대해 레이블된 탑승 위치를 포함하는 데이터를 출력하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 프로세서는,상기 엘리베이터의 적재 중량과 상기 로봇의 중량의 합이 상기 엘리베이터의 정격 중량을 초과하지 않는 경우상기 엘리베이터에 탑승 가능한 것으로 확인하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 프로세서는,상기 엘리베이터의 탑승 후, 상기 센싱부에 포함된 카메라를 통해 상기 내부 공간의 영상을 획득하고,획득된 영상에 기초하여 상기 내부 공간의 탑승자 및 물체를 감지하고,감지된 탑승자 및 물체에 기초한 중량 배분을 추정하고,추정된 중량 배분에 기초하여 상기 탑승 위치를 설정 또는 조절하는 로봇."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "카메라 또는 거리 센서 중 적어도 하나를 통해 엘리베이터의 내부 공간 정보를 획득하는 단계;획득된 내부 공간 정보에 기초하여 상기 엘리베이터의 탑승 가능 여부를 확인하는 단계;상기 엘리베이터에 탑승 가능한 경우, 상기 내부 공간 정보에 기초하여 탑승 위치를 설정하는 단계; 및설정된 탑승 위치로 이동하도록 주행 모터를 제어하는 단계를 포함하고,상기 내부 공간 정보는 상기 카메라에 의해 획득되는 상기 내부 공간의 영상, 또는 상기 거리 센서에 의해 획득되는 상기 내부 공간의 센싱 데이터 중 적어도 하나를 포함하는 로봇의 제어 방법."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 탑승 위치를 설정하는 단계는,상기 엘리베이터의 내부 공간 중, 상기 엘리베이터의 출입구의 일 측과의 거리가 기준 거리 이상이고 상기 출입구와 가장 근접한 위치를 상기 탑승 위치로 설정하는 단계를 포함하는 로봇의 제어 방법."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 탑승 위치를 설정하는 단계는,공개특허 10-2021-0063121-5-상기 내부 공간 정보에 기초하여, 기 설정된 기본 탑승 위치로의 탑승 가능 여부를 확인하는 단계;확인 결과 상기 기본 탑승 위치에 탑승 가능한 경우, 상기 기본 탑승 위치를 상기 탑승 위치로 설정하는 단계;및확인 결과 상기 기본 탑승 위치에 탑승 불가능한 경우, 상기 내부 공간 정보로부터 감지된 탑승 가능 공간 중상기 기본 탑승 위치와 가장 근접한 위치를 상기 탑승 위치로 설정하는 단계를 포함하는 로봇의 제어 방법."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 내부 공간 정보는 기 입력된 적어도 하나의 하차 층수를 포함하고,상기 탑승 위치를 설정하는 단계는,상기 기 입력된 적어도 하나의 하차 층수와 상기 로봇의 하차 층수에 기초하여 추정되는 하차 순서에 기초하여상기 탑승 위치를 설정하는 단계를 포함하는 로봇의 제어 방법."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서,상기 탑승 위치를 설정하는 단계는,상기 로봇의 탑승 층수, 하차 층수, 상기 엘리베이터에 기 입력된 적어도 하나의 하차 층수, 탑승자 정보, 또는탑승 대기자 수 중 적어도 하나를 포함하는 입력 데이터를, 머신 러닝 알고리즘에 의해 학습된 탑승 위치 설정모델로 입력하는 단계; 및상기 탑승 위치 설정 모델로부터 출력된 데이터에 포함된 탑승 위치를 상기 탑승 위치로 설정하는 단계를 포함하는 로봇의 제어 방법."}
{"patent_id": "10-2019-0151633", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서,상기 엘리베이터의 탑승 후 상기 내부 공간 정보를 획득하는 단계; 및획득된 내부 공간 정보에 기초하여 상기 로봇의 위치를 이동하도록 상기 주행 모터를 제어하는 단계를 더 포함하는 로봇의 제어 방법."}
{"patent_id": "10-2019-0151633", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따른 로봇은, 주행 모터, 엘리베이터 제어 장치와 통신하기 위한 통신부, 엘리베이터의 내 부 공간을 센싱하는 센싱부, 및 상기 엘리베이터 제어 장치로부터 수신되는 데이터 또는 상기 센싱부의 센싱 데 이터에 기초하여, 상기 엘리베이터로의 탑승 가능 여부를 확인하고, 상기 엘리베이터에 탑승 가능한 경우, 상기 통신부 또는 상기 센싱부를 통해 획득되는 상기 엘리베이터의 내부 공간 정보에 기초하여 탑승 위치를 설정하고, 설정된 탑승 위치로 이동하도록 상기 주행 모터를 제어하는 프로세서를 포함한다."}
{"patent_id": "10-2019-0151633", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 로봇 및 그의 제어 방법에 관한 것이다."}
{"patent_id": "10-2019-0151633", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇은 스스로 보유한 능력에 의해 주어진 일을 자동으로 처리하거나 작동하는 기계로서, 로봇의 응용분야는 대 체로 산업용, 의료용, 우주용, 해저용 등 다양한 분야로 분류된다. 최근에는 자율 주행 기술이나 센서를 이용한 자동 제어 기술, 통신 기술 등의 발전으로 인해, 보다 다양한 분야 에 로봇을 적용하기 위한 연구가 지속되고 있다. 자율 주행 기술이 적용된 로봇은, 실내 또는 실외를 주행하면서 다양한 동작을 수행하거나 다양한 서비스를 제 공할 수 있다. 한편, 건물 내부의 다양한 구역들을 주행하며 서비스를 제공하는 로봇의 경우, 건물 내의 다른 층으로 이동하기 위해 엘리베이터를 이용할 수 있다. 이 경우, 로봇의 엘리베이터의 탑승 및 하차 상황은 일반적인 주행 상황과 상이한 바, 원활한 엘리베이터 이용을 위한 주행 제어 방안이 요구될 수 있다."}
{"patent_id": "10-2019-0151633", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2019-0151633", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 엘리베이터의 탑승 시 상기 엘리베이터와 관련된 다양한 데이터에 기초하여 최적의 탑승 위치를 설정하는 로봇을 제공하는 것이다."}
{"patent_id": "10-2019-0151633", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 로봇은, 엘리베이터 제어 장치 또는 로봇의 센싱부를 통해 획득되는 엘리베이터의 내 부 공간 정보에 기초하여, 상기 엘리베이터로의 탑승 가능 여부를 확인하고, 상기 엘리베이터에 탑승 가능한 경 우 상기 내부 공간 정보에 기초하여 탑승 위치를 설정하고, 설정된 탑승 위치로 이동하도록 상기 주행 모터를 제어할 수 있다. 상기 로봇은 상기 센싱부의 카메라를 통해 획득되거나 엘리베이터 제어 장치로부터 수신되는 내부 공간의 영상, 또는 상기 센싱부의 거리 센서를 통해 획득되는 상기 내부 공간의 센싱 데이터에 기초하여 탑승 가능 공간의 존 재 여부를 감지할 수 있다. 실시 예에 따라, 상기 로봇은 상기 엘리베이터의 내부 공간 중 출입구의 일 측과의 거리가 기준 거리 이상이고 출입구와 가장 근접한 위치를 탑승 위치로 설정할 수 있다. 실시 예에 따라, 상기 로봇은 기 설정된 기본 탑승 위치로의 탑승 가능 여부를 확인하여, 상기 기본 탑승 위치 에 탑승하거나 상기 기본 탑승 위치와 근접한 위치에 탑승할 수 있다. 실시 예에 따라, 상기 로봇은 엘리베이터에 기 입력된 적어도 하나의 하차 층수와 상기 로봇의 하차 층수에 기 초하여 하차 순서를 추정하고, 추정된 하차 순서에 기초하여 탑승 위치를 설정할 수 있다. 실시 예에 따라, 상기 로봇은 탑승 층수와 하차 층수 간의 차이에 기초하여 탑승 위치를 설정할 수 있다. 실시 예에 따라, 상기 로봇은 머신 러닝 알고리즘에 의해 학습된 탑승 위치 설정 모델을 이용하여, 다양한 종류 의 데이터에 기초한 탑승 위치를 설정할 수 있다. 실시 예에 따라, 상기 로봇은 엘리베이터의 적재 중량, 로봇의 중량, 및 엘리베이터의 정격 중량에 기초하여 탑 승 가능 여부를 확인할 수 있다. 실시 예에 따라, 상기 로봇은 엘리베이터의 내부 공간의 중량 배분에 기초하여 탑승 위치를 설정하거나 조절할 수 있다."}
{"patent_id": "10-2019-0151633", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 로봇은 엘리베이터의 탑승 시 센서 등을 통해 감지되는 다양한 상황에 기초하여, 주행의 용이성 또는 다른 탑승자에게 가해지는 방해를 최소화할 수 있는 최적의 탑승 위치를 설정할 수 있다. 또한, 로봇은 엘리베이터의 탑승 시 기 설정된 기본 위치로의 탑승이 불가능한 경우 다른 적절한 탑승 위치를 지능적으로 설정하여 탑승할 수 있다. 특히, 로봇은 상기 기본 위치와 가장 근접한 위치를 탑승 위치로 설정함 으로써, 탑승 및 하차 시의 효율성 저하를 최소화하고, 다른 탑승자들의 불편함을 최소화할 수 있다. 뿐만 아니라, 로봇은 다른 탑승자들에 대한 로봇의 상대적인 하차 순서를 추정하여 탑승 위치를 설정함으로써, 하차 시 주행 편의성을 향상시킬 수 있고 하차 중 다른 탑승자와의 접촉이나 충돌 등을 최소화할 수 있다. 또한, 로봇은 인공지능 기반으로 학습된 모델을 이용함으로써, 엘리베이터의 이용과 관련된 다양한 정보에 맞는 최적의 탑승 위치를 설정할 수 있다. 뿐만 아니라, 로봇은 엘리베이터의 적재 중량에 따라 탑승 여부를 결정함으로써 과적으로 인한 엘리베이터의 불 안정한 이동이나 고장 발생을 방지할 수 있다. 또한, 로봇은 엘리베이터 내의 중량 배분 또는 무게중심에 기초하여 탑승 위치를 조절함으로써, 중량 편차로 인 한 엘리베이터의 불안정한 이동을 방지하고, 엘리베이터의 고장 발생을 최소화할 수 있다."}
{"patent_id": "10-2019-0151633", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명한다. 첨부된 도면은 본 명세서에 개 시된 실시 예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사 상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 로봇은 스스로 보유한 능력에 의해 주어진 일을 자동으로 처리하거나 작동하는 기계를 의미할 수 있다. 특히, 환경을 인식하고 스스로 판단하여 동작을 수행하는 기능을 갖는 로봇을 지능형 로봇이라 칭할 수 있다. 로봇은 사용 목적이나 분야에 따라 산업용, 의료용, 가정용, 군사용 등으로 분류할 수 있다. 로봇은 액츄에이터 또는 모터를 포함하는 구동부를 구비하여 로봇 관절을 움직이는 등의 다양한 물리적 동작을 수행할 수 있다. 또한, 이동 가능한 로봇은 구동부에 휠, 브레이크, 프로펠러 등이 포함되어, 구동부를 통해 지 상에서 주행하거나 공중에서 비행할 수 있다. 인공 지능은 인공적인 지능 또는 이를 만들 수 있는 방법론을 연구하는 분야를 의미하며, 머신 러닝(기계 학습, Machine Learning)은 인공 지능 분야에서 다루는 다양한 문제를 정의하고 그것을 해결하는 방법론을 연구하는 분야를 의미한다. 머신 러닝은 어떠한 작업에 대하여 꾸준한 경험을 통해 그 작업에 대한 성능을 높이는 알고리 즘으로 정의하기도 한다. 인공 신경망(ANN: Artificial Neural Network)은 머신 러닝에서 사용되는 모델로써, 시냅스의 결합으로 네트워 크를 형성한 인공 뉴런(노드)들로 구성되는, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공 신경 망은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 인공 신경망은 입력층(Input Layer), 출력층(Output Layer), 그리고 선택적으로 하나 이상의 은닉층(Hidden Layer)를 포함할 수 있다. 각 층은 하나 이상의 뉴런을 포함하고, 인공 신경망은 뉴런과 뉴런을 연결하는 시냅 스를 포함할 수 있다. 인공 신경망에서 각 뉴런은 시냅스를 통해 입력되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함숫값을 출력할 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향 등이 포함된 다. 그리고, 하이퍼파라미터는 머신 러닝 알고리즘에서 학습 전에 설정되어야 하는 파라미터를 의미하며, 학습률(Learning Rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포함된다. 인공 신경망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수 는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신 러닝은 학습 방식에 따라 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning)으로 분류할 수 있다. 지도 학습은 학습 데이터에 대한 레이블(label)이 주어진 상태에서 인공 신경망을 학습시키는 방법을 의미하며, 레이블이란 학습 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결과 값)을 의미할 수 있다. 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않는 상태에서 인공 신경망을 학습시키 는 방법을 의미할 수 있다. 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화 하는 행동 혹은 행동 순서를 선택하도록 학습시키는 학습 방법을 의미할 수 있다. 인공 신경망 중에서 복수의 은닉층을 포함하는 심층 신경망(DNN: Deep Neural Network)으로 구현되는 머신 러닝 을 딥 러닝(심층 학습, Deep Learning)이라 부르기도 하며, 딥 러닝은 머신 러닝의 일부이다. 이하에서, 머신 러닝은 딥 러닝을 포함하는 의미로 사용된다. 자율 주행은 스스로 주행하는 기술을 의미하며, 자율 주행 차량은 사용자의 조작 없이 또는 사용자의 최소한의 조작으로 주행하는 차량(Vehicle)을 의미한다. 예컨대, 자율 주행에는 주행중인 차선을 유지하는 기술, 어댑티브 크루즈 컨트롤과 같이 속도를 자동으로 조절 하는 기술, 정해진 경로를 따라 자동으로 주행하는 기술, 목적지가 설정되면 자동으로 경로를 설정하여 주행하 는 기술 등이 모두 포함될 수 있다. 차량은 내연 기관만을 구비하는 차량, 내연 기관과 전기 모터를 함께 구비하는 하이브리드 차량, 그리고 전기 모터만을 구비하는 전기 차량을 모두 포괄하며, 자동차뿐만 아니라 기차, 오토바이 등을 포함할 수 있다. 이때, 자율 주행 차량은 자율 주행 기능을 가진 로봇으로 볼 수 있다. 도 1은 본 발명의 일 실시 예에 따른 로봇을 포함하는 AI 장치를 나타낸다. AI 장치는 TV, 프로젝터, 휴대폰, 스마트폰, 데스크탑 컴퓨터, 노트북, 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 태블릿 PC, 웨어러블 장치, 셋톱박스(STB), DMB 수신기, 라디오, 세탁기, 냉장고, 데스크탑 컴퓨터, 디지털 사이니지, 로봇, 차량 등 과 같은, 고정형 기기 또는 이동 가능한 기기 등으로 구현될 수 있다. 도 1을 참조하면, AI 장치는 통신부, 입력부, 러닝 프로세서, 센싱부, 출력부, 메모리 및 프로세서 등을 포함할 수 있다. 통신부는 유무선 통신 기술을 이용하여 다른 AI 장치(100a 내지 100e)나 AI 서버 등의 외부 장치들과 데이터를 송수신할 수 있다. 예컨대, 통신부는 외부 장치들과 센서 정보, 사용자 입력, 학습 모델, 제어 신호 등을 송수신할 수 있다. 이때, 통신부가 이용하는 통신 기술에는 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), LTE(Long Term Evolution), 5G, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), 블 루투스(Bluetooth쪠), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), ZigBee, NFC(Near Field Communication) 등이 있다. 입력부는 다양한 종류의 데이터를 획득할 수 있다. 이때, 입력부는 영상 신호 입력을 위한 카메라, 오디오 신호를 수신하기 위한 마이크로폰, 사용자로부터 정보를 입력 받기 위한 사용자 입력부 등을 포함할 수 있다. 여기서, 카메라나 마이크로폰을 센서로 취급하여, 카메라나 마이크로폰으로부터 획득한 신호를 센싱 데이터 또는 센서 정보라고 할 수도 있다. 입력부는 모델 학습을 위한 학습 데이터 및 학습 모델을 이용하여 출력을 획득할 때 사용될 입력 데이터 등을 획득할 수 있다. 입력부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 프로세서 또는 러닝 프로세서는 입력 데이터에 대하여 전처리로써 입력 특징점(input feature)을 추출할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망으로 구성된 모델을 학습시킬 수 있다. 여기서, 학습 된 인공 신경망을 학습 모델이라 칭할 수 있다. 학습 모델은 학습 데이터가 아닌 새로운 입력 데이터에 대하여결과 값을 추론해 내는데 사용될 수 있고, 추론된 값은 어떠한 동작을 수행하기 위한 판단의 기초로 이용될 수 있다. 이때, 러닝 프로세서는 AI 서버의 러닝 프로세서과 함께 AI 프로세싱을 수행할 수 있다. 이때, 러닝 프로세서는 AI 장치에 통합되거나 구현된 메모리를 포함할 수 있다. 또는, 러닝 프로세서 는 메모리, AI 장치에 직접 결합된 외부 메모리 또는 외부 장치에서 유지되는 메모리를 사용하 여 구현될 수도 있다. 센싱부는 다양한 센서들을 이용하여 AI 장치 내부 정보, AI 장치의 주변 환경 정보 및 사용자 정보 중 적어도 하나를 획득할 수 있다. 이때, 센싱부에 포함되는 센서에는 근접 센서, 조도 센서, 가속도 센서, 자기 센서, 자이로 센서, 관성 센 서, RGB 센서, IR 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰, 라이다, 레이더 등이 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시킬 수 있다. 이때, 출력부에는 시각 정보를 출력하는 디스플레이부, 청각 정보를 출력하는 스피커, 촉각 정보를 출력하 는 햅틱 모듈 등이 포함될 수 있다. 메모리는 AI 장치의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 예컨대, 메모리는 입력 부에서 획득한 입력 데이터, 학습 데이터, 학습 모델, 학습 히스토리 등을 저장할 수 있다. 프로세서는 데이터 분석 알고리즘 또는 머신 러닝 알고리즘을 사용하여 결정되거나 생성된 정보에 기초하 여, AI 장치의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. 그리고, 프로세서는 AI 장치(10 0)의 구성 요소들을 제어하여 결정된 동작을 수행할 수 있다. 이를 위해, 프로세서는 러닝 프로세서 또는 메모리의 데이터를 요청, 검색, 수신 또는 활용할 수 있고, 상기 적어도 하나의 실행 가능한 동작 중 예측되는 동작이나, 바람직한 것으로 판단되는 동작을 실행 하도록 AI 장치의 구성 요소들을 제어할 수 있다. 이때, 프로세서는 결정된 동작을 수행하기 위하여 외부 장치의 연계가 필요한 경우, 해당 외부 장치를 제 어하기 위한 제어 신호를 생성하고, 생성한 제어 신호를 해당 외부 장치에 전송할 수 있다. 프로세서는 사용자 입력에 대하여 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 사용자의 요구 사 항을 결정할 수 있다. 이때, 프로세서는 음성 입력을 문자열로 변환하기 위한 STT(Speech To Text) 엔진 또는 자연어의 의도 정 보를 획득하기 위한 자연어 처리(NLP: Natural Language Processing) 엔진 중에서 적어도 하나 이상을 이용하여, 사용자 입력에 상응하는 의도 정보를 획득할 수 있다. 이때, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 적어도 일부가 머신 러닝 알고리즘에 따라 학습된 인 공 신경망으로 구성될 수 있다. 그리고, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 러닝 프로세서 에 의해 학습된 것이나, AI 서버의 러닝 프로세서에 의해 학습된 것이거나, 또는 이들의 분산 처리에 의해 학습된 것일 수 있다. 프로세서는 AI 장치의 동작 내용이나 동작에 대한 사용자의 피드백 등을 포함하는 이력 정보를 수집 하여 메모리 또는 러닝 프로세서에 저장하거나, AI 서버 등의 외부 장치에 전송할 수 있다. 수 집된 이력 정보는 학습 모델을 갱신하는데 이용될 수 있다. 프로세서는 메모리에 저장된 응용 프로그램을 구동하기 위하여, AI 장치의 구성 요소들 중 적어 도 일부를 제어할 수 있다. 나아가, 프로세서는 상기 응용 프로그램의 구동을 위하여, AI 장치에 포 함된 구성 요소들 중 둘 이상을 서로 조합하여 동작시킬 수 있다. 도 2는 본 발명의 일 실시 예에 따른 로봇과 연결되는 AI 서버를 나타낸다. 도 2를 참조하면, AI 서버는 머신 러닝 알고리즘을 이용하여 인공 신경망을 학습시키거나 학습된 인공 신 경망을 이용하는 장치를 의미할 수 있다. 여기서, AI 서버는 복수의 서버들로 구성되어 분산 처리를 수행 할 수도 있고, 5G 네트워크로 정의될 수 있다. 이때, AI 서버는 AI 장치의 일부의 구성으로 포함되어, AI 프로세싱 중 적어도 일부를 함께 수행할 수도 있다.AI 서버는 통신부, 메모리, 러닝 프로세서 및 프로세서 등을 포함할 수 있다. 통신부는 AI 장치 등의 외부 장치와 데이터를 송수신할 수 있다. 메모리는 모델 저장부를 포함할 수 있다. 모델 저장부는 러닝 프로세서을 통하여 학습 중 인 또는 학습된 모델(또는 인공 신경망, 231a)을 저장할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망(231a)을 학습시킬 수 있다. 학습 모델은 인공 신경 망의 AI 서버에 탑재된 상태에서 이용되거나, AI 장치 등의 외부 장치에 탑재되어 이용될 수도 있다. 학습 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 전부가 소프트웨어로 구현되는 경우 학습 모델을 구성하는 하나 이상의 명령어(instruction)는 메모리 에 저장될 수 있다. 프로세서는 학습 모델을 이용하여 새로운 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기 초한 응답이나 제어 명령을 생성할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 로봇을 포함하는 AI 시스템을 나타낸다. 도 3을 참조하면, AI 시스템은 AI 서버, 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰 (100d) 또는 가전(100e) 중에서 적어도 하나 이상이 클라우드 네트워크와 연결된다. 여기서, AI 기술이 적 용된 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰(100d) 또는 가전(100e) 등을 AI 장치(100a 내지 100e)라 칭할 수 있다. 클라우드 네트워크는 클라우드 컴퓨팅 인프라의 일부를 구성하거나 클라우드 컴퓨팅 인프라 안에 존재하는 네트워크를 의미할 수 있다. 여기서, 클라우드 네트워크는 3G 네트워크, 4G 또는 LTE(Long Term Evolution) 네트워크 또는 5G 네트워크 등을 이용하여 구성될 수 있다. 즉, AI 시스템을 구성하는 각 장치들(100a 내지 100e, 200)은 클라우드 네트워크를 통해 서로 연결될 수 있다. 특히, 각 장치들(100a 내지 100e, 200)은 기지국을 통해서 서로 통신할 수도 있지만, 기지국을 통하지 않 고 직접 서로 통신할 수도 있다. AI 서버는 AI 프로세싱을 수행하는 서버와 빅 데이터에 대한 연산을 수행하는 서버를 포함할 수 있다. AI 서버는 AI 시스템을 구성하는 AI 장치들인 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스 마트폰(100d) 또는 가전(100e) 중에서 적어도 하나 이상과 클라우드 네트워크을 통하여 연결되고, 연결된 AI 장치들(100a 내지 100e)의 AI 프로세싱을 적어도 일부를 도울 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)를 대신하여 머신 러닝 알고리즘에 따라 인공 신경망을 학습시킬 수 있고, 학습 모델을 직접 저장하거나 AI 장치(100a 내지 100e)에 전송할 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)로부터 입력 데이터를 수신하고, 학습 모델을 이용하여 수신한 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성하여 AI 장치 (100a 내지 100e)로 전송할 수 있다. 또는, AI 장치(100a 내지 100e)는 직접 학습 모델을 이용하여 입력 데이터에 대하여 결과 값을 추론하고, 추론 한 결과 값에 기초한 응답이나 제어 명령을 생성할 수도 있다. 이하에서는, 상술한 기술이 적용되는 AI 장치(100a 내지 100e)의 다양한 실시 예들을 설명한다. 여기서, 도 3에 도시된 AI 장치(100a 내지 100e)는 도 1에 도시된 AI 장치의 구체적인 실시 예로 볼 수 있다. 로봇(100a)은 AI 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. 로봇(100a)은 동작을 제어하기 위한 로봇 제어 모듈을 포함할 수 있고, 로봇 제어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 로봇(100a)은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 로봇(100a)의 상태 정보를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계획을 결정하거나, 사용 자 상호작용에 대한 응답을 결정하거나, 동작을 결정할 수 있다. 여기서, 로봇(100a)은 이동 경로 및 주행 계획을 결정하기 위하여, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 로봇(100a)은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있 다. 예컨대, 로봇(100a)은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 동작을 결정할 수 있다. 여기서, 학습 모델은 로봇(100a)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, 로봇(100a)은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등 의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 로봇(100a)은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적 어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계 획에 따라 로봇(100a)을 주행시킬 수 있다. 맵 데이터에는 로봇(100a)이 이동하는 공간에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예컨대, 맵 데이터에는 벽, 문 등의 고정 객체들과 화분, 책상 등의 이동 가능한 객체들에 대한 객체 식별 정보 가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위치 등이 포함될 수 있다. 또한, 로봇(100a)은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있다. 이때, 로봇(100a)은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. 로봇(100a)은 AI 기술 및 자율 주행 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터 테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. AI 기술과 자율 주행 기술이 적용된 로봇(100a)은 자율 주행 기능을 가진 로봇 자체나, 자율 주행 차량(100b)과 상호작용하는 로봇(100a) 등을 의미할 수 있다. 자율 주행 기능을 가진 로봇(100a)은 사용자의 제어 없이도 주어진 동선에 따라 스스로 움직이거나, 동선을 스 스로 결정하여 움직이는 장치들을 통칭할 수 있다. 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차량(100b)은 이동 경로 또는 주행 계획 중 하나 이상을 결정 하기 위해 공통적인 센싱 방법을 사용할 수 있다. 예를 들어, 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차량(100b)은 라이다, 레이더, 카메라를 통해 센싱된 정보를 이용하여, 이동 경로 또는 주행 계획 중 하나 이상 을 결정할 수 있다. 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)과 별개로 존재하면서, 자율 주행 차 량(100b)의 내부에서 자율 주행 기능에 연계되거나, 자율 주행 차량(100b)에 탑승한 사용자와 연계된 동작을 수 행할 수 있다. 이때, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)을 대신하여 센서 정보를 획득 하여 자율 주행 차량(100b)에 제공하거나, 센서 정보를 획득하고 주변 환경 정보 또는 객체 정보를 생성하여 자 율 주행 차량(100b)에 제공함으로써, 자율 주행 차량(100b)의 자율 주행 기능을 제어하거나 보조할 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)에 탑승한 사용자를 모니터링하 거나 사용자와의 상호작용을 통해 자율 주행 차량(100b)의 기능을 제어할 수 있다. 예컨대, 로봇(100a)은 운전 자가 졸음 상태인 경우로 판단되는 경우, 자율 주행 차량(100b)의 자율 주행 기능을 활성화하거나 자율 주행 차 량(100b)의 구동부의 제어를 보조할 수 있다. 여기서, 로봇(100a)이 제어하는 자율 주행 차량(100b)의 기능에는 단순히 자율 주행 기능뿐만 아니라, 자율 주행 차량(100b)의 내부에 구비된 네비게이션 시스템이나 오디오 시스 템에서 제공하는 기능도 포함될 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)의 외부에서 자율 주행 차량 (100b)에 정보를 제공하거나 기능을 보조할 수 있다. 예컨대, 로봇(100a)은 스마트 신호등과 같이 자율 주행 차 량(100b)에 신호 정보 등을 포함하는 교통 정보를 제공할 수도 있고, 전기 차량의 자동 전기 충전기와 같이 자 율 주행 차량(100b)과 상호작용하여 충전구에 전기 충전기를 자동으로 연결할 수도 있다. 도 4는 본 발명의 일 실시 예에 따른 로봇의 제어 구성을 나타내는 블록도이다. 도 4를 참조하면, 로봇(100a)은 통신부, 입력부, 러닝 프로세서, 센싱부, 출력부, 주행 모터, 메모리, 및 프로세서를 포함할 수 있다. 도 4에 도시된 구성들은 설명의 편의를 위 한 일례로서, 로봇(100a)은 도 4에 도시된 구성들보다 많거나 적은 구성들을 포함할 수 있다. 한편, 도 1의 AI 장치와 관련된 내용은 본 발명의 로봇(100a)에도 유사하게 적용되는 바, 도 1에서 상술한 내용과 중복되는 내용은 생략한다. 통신부는 로봇(100a)을 네트워크를 통해 서버, 이동 단말기, 다른 로봇 등과 연결하기 위한 통신 모듈들을 포함할 수 있다. 상기 통신 모듈들 각각은 도 1에서 상술한 통신 기술 중 어느 하나를 지원할 수 있다. 예컨대, 로봇(100a)은 공유기 등의 액세스 포인트를 통해 네트워크와 연결될 수 있다. 이에 따라, 로봇(100a)은 입력부나 센싱부 등을 통해 획득되는 각종 정보를, 상기 네트워크를 통해 서버나 이동 단말기로 제공 할 수 있다. 또한, 로봇(100a)은 상기 서버나 이동 단말기로부터 정보나 데이터, 명령 등을 수신할 수 있다. 입력부는 다양한 종류의 데이터를 획득하는 적어도 하나의 입력 수단을 포함할 수 있다. 예컨대, 상기 적 어도 하나의 입력 수단은 버튼이나 다이얼 등의 물리 입력 수단, 터치 패드나 터치 패널과 같은 터치 입력부, 사용자의 음성이나 로봇(100a) 주변의 소리 등을 수신하는 마이크로폰 등을 포함할 수 있다. 사용자는 입력부 를 통해 각종 요청이나 명령을 로봇(100a)으로 입력할 수 있다. 센싱부는 로봇(100a) 주변의 다양한 정보를 센싱하는 적어도 하나의 센서를 포함할 수 있다. 예컨대, 센싱부는 로봇(100a) 주변의 영상을 획득하기 위한 적어도 하나의 카메라를 포함할 수 있다. 적어도 하나의 카메라는 기 공지된 다양한 종류의 카메라(2D 카메라, 3D 카메라, 적외선 카메라 등)를 포 함할 수 있다. 또한, 센싱부는 로봇(100a) 주변의 사람이나 사물 등과의 거리를 감지하기 위한 거리 센서를 더 포함 할 수 있다. 예를 들어, 상기 거리 센서는 초음파 센서, 라이다(LiDar) 등 거리의 감지가 가능한 다양한 종류의 센서로 구현될 수 있다. 실시 예에 따라, 센싱부는 근접 센서, 조도 센서, 자이로 센서 등의 센서들을 더 포함할 수도 있다. 출력부는 로봇(100a)의 동작이나 상태, 로봇(100a)에서 실행되는 각종 서비스, 프로그램, 애플리케이션 등 과 관련된 각종 정보 또는 콘텐츠를 출력할 수 있다. 예컨대 출력부는 디스플레이 및 스피커 등 을 포함할 수 있다. 디스플레이는 상술한 각종 정보, 메시지, 또는 콘텐츠를 그래픽 형태로 출력할 수 있다. 스피커는 상 기 각종 정보, 메시지, 또는 콘텐츠를 음성이나 음향 형태로 출력할 수 있다. 적어도 하나의 주행 모터는 로봇(100a)의 이동(주행)을 위한 것으로서, 예컨대 로봇(100a)의 하부에 구비 된 적어도 하나의 휠과 연결되어, 로봇(100a)의 주행을 위한 구동력을 상기 적어도 하나의 휠로 제공할 수 있다. 프로세서는 상기 적어도 하나의 주행모터를 제어하여 로봇(100a)의 주행 방향 및/또는 주행 속 도를 조절할 수 있다. 메모리는 로봇(100a)에 포함된 구성 요소들의 동작을 제어하기 위한 제어 데이터, 입력부를 통해 획 득된 입력이나 센싱부를 통해 획득되는 정보에 기초한 동작을 수행하기 위한 데이터 등의 각종 데이터가 저장될 수 있다. 또한, 메모리에는 프로세서에 포함된 적어도 하나의 프로세서나 컨트롤러에 의해 실행되는 소프트웨 어 모듈이나 애플리케이션 등의 프로그램 데이터가 저장될 수 있다. 이러한 메모리는 하드웨어적으로, ROM, RAM, EPROM, 플래시 드라이브, 하드 드라이브 등과 같은 다양한 저 장기기를 포함할 수 있다. 프로세서는 로봇(100a)의 동작을 제어하는 적어도 하나의 프로세서나 컨트롤러 등을 포함할 수 있다. 구체 적으로, 프로세서는 적어도 하나의 CPU, AP(application processor), 마이크로컴퓨터(또는 마이컴), 집적 회로, ASIC(application specific integrated circuit) 등을 포함할 수 있다. 한편, 본 발명의 실시 예에 따른 로봇(100a)은 건물 내의 여러 층들을 이동하면서 소정 태스크를 수행할 수 있 다. 상기 여러 층들의 이동을 위해, 이동 로봇은 건물에 구비된 엘리베이터의 탑승 및 하차가 가능하도록 구현 될 수 있다. 엘리베이터에는 로봇뿐만 아니라 탑승자들이 탑승 및 하차하는 바, 로봇(100a)은 다른 탑승자들의 불편을 최소 화할 수 있도록 엘리베이터의 내부 상황 등에 기초한 최적의 탑승 방식에 따라 엘리베이터에 탑승할 필요가 있 다. 이하 도 5 내지 도 14b를 참조하여, 로봇(100a)이 엘리베이터에 탑승하는 동작과 관련된 다양한 실시 예들을 설 명한다. 도 5는 본 발명의 실시 예에 따른 로봇의 엘리베이터 탑승 시 제어 동작을 설명하기 위한 플로우차트이다. 도 5를 참조하면, 로봇(100a)은 엘리베이터의 탑승을 위해 엘리베이터를 호출할 수 있다(S500). 로봇(100a)은 건물 내의 현재 층으로부터 다른 층으로 이동하기 위해 엘리베이터를 호출할 수 있다. 예컨대, 로봇(100a)과 엘리베이터 제어 장치(미도시; 예컨대 서버 등의 컴퓨팅 장치)가 통신 가능한 경우, 프로 세서는 엘리베이터 호출 요청을 통신부를 통해 상기 엘리베이터 제어 장치로 전송할 수 있다. 또는, 로봇(100a)에 엘리베이터 버튼을 물리적으로 조작 가능한 수단(예컨대 로봇 암 등)이 구비된 경우, 프로 세서는 상기 수단을 제어하여 엘리베이터 버튼을 누름으로써 엘리베이터를 호출할 수도 있다. 실시 예에 따라, 다른 탑승 예정자에 의해 엘리베이터가 호출된 상태인 경우, 프로세서는 엘리베이터의 호 출을 위한 동작을 수행하지 않고 대기할 수도 있다. 로봇(100a)은 엘리베이터의 탑승 가능 여부를 확인할 수 있다(S510). 프로세서는 엘리베이터의 도어가 오픈됨이 감지되면, 카메라를 통해 획득되는 엘리베이터 내부 공간 의 영상 및/또는 거리 센서를 통해 획득되는 엘리베이터 내부 공간의 센싱 데이터에 기초하여, 엘리베이터 의 탑승 가능 여부를 확인할 수 있다. 프로세서는 상기 엘리베이터의 내부 공간 정보(내부 공간의 영상 및/또는 센싱 데이터)에 기초하여 엘리베 이터 내부 공간 중 로봇(100a)이 탑승 가능한 크기의 빈 공간(탑승 가능 공간)이 존재하는지 여부를 감지할 수 있다. 실시 예에 따라, 프로세서는 엘리베이터 제어 장치(미도시)로부터 엘리베이터 내부 공간의 영상을 수신하고, 수신된 영상으로부터 상기 탑승 가능 공간의 존재 여부를 감지할 수도 있다. 실시 예에 따라, 프로세서는 엘리베이터의 호출 시점으로부터 엘리베이터의 도어 오픈 시점까지의 임의의 시점에서, 엘리베이터 제어 장치(미도시)로부터 엘리베이터의 탑승 가능 여부에 대한 정보를 통신부를 통 해 수신할 수도 있다. 예컨대 상기 정보는 탑승 가능 공간의 존재 여부, 또는 엘리베이터 내부의 무게에 기초한 탑승 가능 여부에 기초하여 제공될 수 있다. 확인 결과 엘리베이터에 탑승 불가능한 경우(S520의 NO), 로봇(100a)은 엘리베이터에 탑승하지 않고 대기하거나, 다른 엘리베이터에 탑승할 수 있다(S530). 반면, 확인 결과 엘리베이터에 탑승 가능한 경우(S520의 YES), 로봇(100a)은 엘리베이터의 탑승 위치를 설정하 기 위한 정보(내부 공간 정보)를 획득할 수 있다(S540). 로봇(100a)은 획득된 정보에 기초하여 설정되는 탑승 위치로 이동하도록 주행 모터를 제어함으로써 엘리베이터에 탑승할 수 있다(S550). 상기 정보(내부 공간 정보)는 카메라를 통해 획득되거나 엘리베이터 제어 장치로부터 수신되는 영상, 및/ 또는 거리 센서를 통해 획득되는 센싱 데이터를 포함할 수 있다. 예컨대, 프로세서는 S510 단계에서 카메라 및/또는 거리 센서를 통해 감지된 탑승 가능 공간 중 소정 위치를 탑승 위치로 설정하고, 설정된 탑승 위치로 이동하도록 주행 모터를 제어할 수 있다. 또는, 프로세서는 해당 엘리베이터에 대해 기 설정된 기본 위치(기본 탑승 위치)로 이동하도록 주행 모터 를 제어할 수도 있다. 또는, 프로세서는 기 정의된 탑승 위치 설정 조건에 기초하여 탑승 위치를 설정할 수도 있다. 이와 관련된 일부 예들에 대해 이하 도 6a 내지 도 6b를 참조하여 설명한다. 도 6a 내지 도 6b는 로봇의 엘리베이터 탑승 위치 설정과 관련된 예시도들이다. 도 6a를 참조하면, 프로세서는 엘리베이터로의 빠른 탑승 및 하차를 위해, 엘리베이터의 내부 공간 중 출입구와 근접한 위치를 탑승 위치로 설정할 수 있다. 한편, 프로세서는 다른 탑승자나 물체(휠체어 등)의 탑승 및 하차를 위해, 출입구의 일 측과 로봇 (100a)이 기설정된 기준 거리 이상 이격되도록 탑승 위치를 설정할 수 있다. 예컨대, 제1 위치(P1)는 출입구의 일 측과 로봇(100a)의 거리(D1)가 상기 기준 거리 이상일 수 있으나, 출 입구와 상대적으로 멀 수 있다. 한편, 제3 위치(P3)는 출입구의 일 측과의 거리(D3)가 기준 거리 미만일 수 있다. 그리고, 제2 위치(P2)는 출입구의 일 측과의 거리(D2)가 기준 거리 이상이면서 출입구와 가장 근접할 수 있다. 즉, 프로세서는 출입구와 가장 가까우면서, 출입구의 일 측과의 거리가 기준 거리 이상인 제2 위치(P2)를 로봇(100a)의 탑승 위치로 설정할 수 있다. 도 6b를 참조하면, 우선 내부 공간은 출입구의 후방에 위치하는 것으로 정의할 수 있다. 프로세서는 로봇(100a)의 용이한 탑승 및 하차를 위해, 출입구의 직후방에 대응하는 영역(REG) 중 소 정 위치를 탑승 위치로 설정할 수 있다. 즉, 상기 영역(REG)의 폭은 출입구의 폭(DW)과 같거나 작을 수 있 다. 이 경우, 로봇(100a)은 직진 주행만으로 엘리베이터에 탑승 및 하차할 수 있으므로, 주행 알고리즘이 단순 화될 수 있다. 그리고, 프로세서는 상기 영역(REG)에 존재하는 탑승 가능 위치 중 최후방에 해당하는 위치를 탑승 위치로 설정함으로써, 다른 탑승자나 물체 등의 탑승 및 하차 시 불편함을 최소화할 수 있다. 다시 도 5를 설명한다. 상술한 예들 외에도, 프로세서는 다양한 방식에 따라 탑승 위치를 설정하고, 설정된 탑승 위치로 이동하도 록 주행 모터를 제어할 수 있다. 이와 관련된 실시 예들에 대해서는 추후 도 7 내지 도 14b를 통해 상세히 설명하기로 한다. 실시 예에 따라, 로봇(100a)은 엘리베이터의 탑승 후, 상기 엘리베이터와 관련된 정보에 기초하여 탑승 위치를 이동(변경)할 수도 있다(S560). 프로세서는 엘리베이터의 탑승 후, 엘리베이터 내부의 탑승자 수 또는 위치 변화, 엘리베이터 내부의 무게 변화 정보, 엘리베이터의 현재 층수와 하차 층수 간의 차이 등에 기초하여 탑승 위치를 이동함으로써, 보다 효 율적인 위치에서 엘리베이터를 이용할 수 있다. 이하 도 7 내지 도 14b를 참조하여, 로봇(100a)의 엘리베이터 탑승 위치 설정과 관련된 다양한 실시 예들을 설 명한다. 도 7 내지 도 14b에 개시된 실시 예들은 어느 하나만이 선택적으로 적용되거나, 복수의 실시 예들이 조 합되는 형태로 적용될 수도 있다. 도 7은 로봇의 엘리베이터 탑승 시, 기본 위치로의 탑승 여부에 기초하여 수행하는 제어 동작의 예를 설명하기 위한 플로우차트이다. 도 5와 도 7을 참조하면, 로봇(100a)이 엘리베이터에 탑승 가능한 경우(S520의 YES), 로봇(100a)은 기본 위치로 의 탑승 가능 여부를 확인할 수 있다(S710). 상기 기본 위치는 엘리베이터 내의 공간 중 기 설정된 특정 위치에 해당할 수 있다. 또는, 상기 기본 위치는 도 6a 내지 도 6b의 실시 예에 따라 설정되는 탑승 위치에 해당할 수도 있다. 프로세서는 상기 기본 위치에 대응하는 영역이 빈 상태인지 여부를 카메라 및/또는 거리 센서 등을 이용하여 감지할 수 있다. 감지 결과에 기초하여, 프로세서는 상기 기본 위치로의 탑승 가능 여부를 확인할 수 있다. 기본 위치에 탑승 가능한 경우(S720의 YES), 로봇(100a)의 프로세서는 상기 기본 위치로 이동하도록 주행 모터를 제어할 수 있다(S730). 프로세서는 상기 기본 위치가 빈 상태인 경우(탑승자 또는 물체가 상기 기본 위치에 존재하지 않는 경우), 주행 모터를 제어하여 로봇(100a)을 상기 기본 위치로 이동시킴으로써 엘리베이터에 탑승할 수 있다. 반면, 기본 위치에 탑승 불가능한 경우(S720의 NO), 로봇(100a)은 엘리베이터 내부의 영상 또는 센싱 데이터에 기초하여 탑승 가능 공간을 감지할 수 있다(S740).상기 기본 위치가 빈 상태가 아닌 것으로 감지되는 경우(예컨대 상기 기본 위치에 탑승자 또는 물체가 존재하는 경우), 프로세서는 카메라 또는 엘리베이터 제어 장치(미도시)로부터 획득되는 영상 및/또는 거리 센 서를 통해 감지되는 센싱 데이터에 기초하여 탑승 가능 공간을 감지할 수 있다. 로봇(100a)은 감지된 탑승 가능 공간 중, 상기 기본 위치와 가장 근접한 위치로 이동하도록 주행 모터를 제어할 수 있다(S750). 상기 기본 위치는 로봇(100a)의 엘리베이터 탑승 및 하차를 위한 최적화된 위치이거나, 다른 탑승자의 엘리베이 터 이용 방해를 최소화하기 위해 설정된 위치일 수 있다. 따라서, 프로세서는 감지된 탑승 가능 공간 중, 상기 기본 위치와 가장 근접한 위치를 탑승 위치로 설정할 수 있다. 실시 예에 따라, 설정된 기본 위치가 복수 개인 경우, 프로세서는 복수의 기본 위치들 중 어느 하나와 가 장 근접한 위치를 탑승 위치로 설정할 수 있다. 도 8a 내지 도 8c는 도 7의 제어 동작과 관련된 예시도들이다. 도 8a와 도 8b를 참조하면, 로봇(100a)의 프로세서는 엘리베이터의 도어가 열림에 따라 출입구 가 개방된 경우, 기 설정된 기본 위치(DP)로의 탑승 가능 여부를 확인할 수 있다. 예컨대, 프로세서는 카메라 또는 엘리베이터 제어 장치(미도시)로부터 엘리베이터의 내부 공간 을 포함하는 영상을 획득하거나, 거리 센서를 통해 상기 내부 공간에 대한 센싱 데이터를 획득 할 수 있다. 프로세서는 획득된 영상 및/또는 센싱 데이터로부터 기본 위치(DP)에 대응하는 영역의 일부에 제1 탑승자 및 제2 탑승자가 존재함을 감지할 수 있다. 이 경우, 프로세서는 상기 영상 및/또는 센싱 데이터에 기초하여 탑승 가능 공간을 인식하고, 인식된 탑승 가능 공간 중 상기 기본 위치(DP)와 가장 근접한 위치를 탑승 위치로 설정할 수 있다. 프로세서는 설정된 탑승 위치로 이동하도록 주행 모터를 제어할 수 있다. 도시되지는 않았으나, 실시 예에 따라 프로세서는 상기 기본 위치(DP)에 다른 탑승자의 존재가 인식된 경 우, 출력부를 통해 탑승 위치의 이동 요청을 출력할 수 있다. 상기 다른 탑승자가 상기 출력된 이동 요청 에 응답하여 기본 위치(DP)와 중첩되지 않는 위치로 이동한 경우, 프로세서는 상기 기본 위치(DP)로 이동 하도록 주행 모터를 제어할 수 있다. 한편, 프로세서는 엘리베이터의 탑승 후, 내부 공간에 존재하는 탑승자의 하차나 이동 등에 따 른 공간 상태를 주기적 또는 연속적으로 감지할 수 있다. 프로세서는 감지 결과에 기초하여 탑승 위치를 조절할 수 있다. 이와 관련하여 도 8c를 참조하면, 프로세서는 상술한 영상 및/또는 센싱 데이터에 기초하여, 기본 위치 (DP)에 위치한 제1 탑승자의 하차, 및 제2 탑승자의 이동에 따라 기본 위치(DP)로 이동 가능함을 감 지할 수 있다. 프로세서는 상기 기본 위치(DP)로 이동하도록 주행 모터를 제어함으로써, 로봇(100a)의 탑승 위치를 조절할 수 있다. 즉, 도 7 내지 도 8c에 도시된 실시 예에 따르면, 로봇(100a)은 엘리베이터의 탑승 시 기 설정된 기본 위 치(DP)로의 탑승이 불가능한 경우 다른 적절한 탑승 위치를 지능적으로 설정하여 탑승할 수 있다. 또한, 로봇 (100a)은 상기 기본 위치(DP)와 가장 근접한 위치를 탑승 위치로 설정함으로써, 탑승 및 하차 시의 효율성 저하 를 최소화하고, 타 탑승자들의 불편함을 최소화할 수 있다. 도 9는 로봇이 하차 층수에 기초하여 엘리베이터로의 탑승을 제어하는 동작을 설명하기 위한 플로우차트이다. 도 5와 도 9를 참조하면, 엘리베이터에 탑승 가능한 경우(S520의 YES), 로봇(100a)은 엘리베이터에 기 입력된 하차 층수 정보를 획득할 수 있다(S910). 프로세서는 엘리베이터 제어 장치(미도시)로부터, 엘리베이터의 탑승자에 의해 기 입력된 적어도 하나의 하차 층수를 포함하는 하차 층수 정보를 수신할 수 있다. 또는, 프로세서는 엘리베이터의 탑승 후, 엘리베이터 내에 설치되어 상기 하차 층수 정보를 표시하는 하차 층수 정보 출력부(303; 도 10a 참조)를 포함하는 영상을 카메라를 통해 획득할 수 있다. 프로세서는 카메라를 통해 획득된 영상을 처리함으로써 상기 하차 층수 정보를 획득할 수 있다. 로봇(100a)은 상기 기 입력된 하차 층수 정보와, 로봇(100a)의 하차 층수에 기초하여 탑승 위치를 설정할 수 있 다(S920). 로봇(100a)은 설정된 탑승 위치로 이동하도록 주행 모터를 제어할 수 있다(S930). 프로세서는 획득된 하차 층수 정보에 포함된 적어도 하나의 하차 층수와, 로봇(100a)의 하차 층수를 비교 하고, 비교 결과에 기초하여 탑승 위치를 설정할 수 있다. 구체적으로, 프로세서는 상기 비교 결과에 기초하여, 엘리베이터의 다른 탑승자(들)에 대한 로봇(100a)의 상대적인 하차 순서를 추정함으로써, 상기 탑승 위치를 설정할 수 있다. 예컨대, 로봇(100a)이 '1층'에서 엘리베이터에 탑승하고, 기 입력된 하차 층수가 '3층', 및 '5층'이며, 로봇 (100a)의 하차 층수가 '7층'인 경우, 프로세서는 엘리베이터 내의 타 탑승자들에 비해 로봇(100a)의 하차 순서가 느린 것으로 추정할 수 있다. 프로세서는 상기 하차 순서의 추정 결과에 기초하여 탑승 위치를 설정할 수 있다. 프로세서는 상기 하차 순서가 빠를수록 상기 탑승 위치를 엘리베이터의 출입구와 가까운 위치로 설정하고, 상기 하차 순서가 느 릴수록 상기 탑승 위치를 엘리베이터의 출입구와 먼 위치로 설정할 수 있다. 도 10a 내지 도 10b는 도 9의 제어 동작과 관련된 예시도들이다. 도 10a를 참조하면, 프로세서는 엘리베이터의 탑승 시, 카메라를 제어하여 하차 층수 정보 출력 부를 포함하는 영상을 획득할 수 있다. 예컨대 상기 하차 층수 정보 출력부는 광원을 각각 포함하는 복수의 버튼들, 또는 디스플레이 등의 형태로 구현될 수 있다. 프로세서는 획득된 영상으로부터 기 입력된 적어도 하나의 하차 층수를 인식할 수 있다. 예컨대 상기 하차 층수 정보 출력부가 복수의 버튼들로 구성된 경우, 프로세서는 광원이 온 된 적어도 하나의 버튼을 확인하고, 확인된 적어도 하나의 버튼 각각에 대응하는 층수를 인식함으로써 상기 적어도 하나의 하차 층수를 인식할 수 있다. 프로세서는 인식된 적어도 하나의 하차 층수와 로봇(100a)의 하차 층수를 비교함으로써, 타 탑승자들(401, 402)에 대한 로봇(100a)의 상대적인 하차 순서를 추정할 수 있다. 도 10b를 참조하면, 로봇(100a)의 하차 순서가 타 탑승자들(401, 402)의 하차 순서보다 빠른 것으로 추정된 경 우, 프로세서는 출입구와 인접한 위치를 탑승 위치로 설정하고, 상기 탑승 위치로 이동하도록 주행 모터를 제어할 수 있다. 즉, 도 9 내지 도 10b에 도시된 실시 예에 따르면, 로봇(100a)은 타 탑승자들에 대한 로봇(100a)의 상대적인 하 차 순서를 추정하여 탑승 위치를 설정함으로써, 하차 시 주행 편의성을 향상시킬 수 있고 하차 중 다른 탑승자 와의 접촉이나 충돌 등을 최소화할 수 있다. 한편, 도시되지는 않았으나, 프로세서는 로봇(100a)의 탑승 층수와 하차 층수 간의 차이에 기초하여 탑승 위치를 설정할 수도 있다. 예컨대, 프로세서는 하차 층수와 탑승 층수 간의 차이가 작을수록 상기 탑승 위 치를 엘리베이터의 출입구와 가까운 위치로 설정할 수 있다. 그리고, 프로세서는 하차 층수와 탑승 층수 간의 차이가 클수록 상기 탑승 위치를 출입구와 먼 위치로 설정할 수 있다. 도 11은 로봇이 인공지능 기반으로 학습된 모델을 이용하여 엘리베이터로의 탑승을 제어하는 동작을 설명하기 위한 플로우차트이다. 도 12는 도 11의 제어 동작과 관련된 예시도이다. 도 5, 도 11, 및 도 12를 참조하면, 로봇(100a)은 엘리베이터에 탑승 가능한 경우(S520의 YES), 상기 엘리베이 터에 기 입력된 하차 층수 정보, 로봇(100a)의 탑승 층수 및 하차 층수, 탑승자 정보, 또는 탑승 대기자 수 중 적어도 하나(INPUT_DATA)를, 기 학습된 탑승 위치 설정 모델(231b)로 입력할 수 있다(S1110). 탑승 위치 설정 모델(231b)은, 로봇(100a)의 러닝 프로세서 또는 서버(200a)의 러닝 프로세서에 의해 학습된 모델로서, 예컨대 머신 러닝(딥러닝) 기반의 인공신경망을 포함할 수 있다. 상기 탑승 위치 설정 모델(231b)은 상기 기 입력된 하차 층수 정보, 로봇(100a)의 탑승 층수, 하차 층수, 탑승 자 정보, 또는 탑승 대기자 수 중 적어도 하나의 데이터에 대하여 레이블된 탑승 위치를 포함하는 데이터 (OUTPUT_DATA)를 출력할 수 있다.상기 탑승 위치 설정 모델(231b)은 하드웨어, 소프트웨어, 또는 이들의 조합으로 구현될 수 있다. 탑승 위치 설 정 모델(231b)의 일부 또는 전부가 소프트웨어로 구현되는 경우, 탑승 위치 설정 모델(231b)을 구성하는 하나 이상의 명령어(instruction)는 메모리에 저장될 수 있다. 프로세서는 도 9에서 상술한 바와 같이 카메라를 통해 획득된 영상으로부터 기 입력된 하차 층수 정 보를 획득하거나, 엘리베이터 제어 장치(미도시)로부터 상기 기 입력된 하차 층수 정보를 획득할 수 있다. 또한, 프로세서는 카메라를 통해 획득된 영상, 거리 센서를 통해 획득되는 센싱 데이터, 또는 엘리베이터 제어 장치(미도시)로부터 수신되는 데이터 중 적어도 하나에 기초하여 탑승자 정보를 획득할 수 있 다. 예컨대 상기 탑승자 정보는 엘리베이터에 탑승한 탑승자 또는 물체의 위치, 수, 무게 등을 포함할 수 있다. 또한, 프로세서는 엘리베이터 제어 장치(미도시) 또는 빌딩 관리 장치(미도시)로부터 수신되는 데이터에 기초하여 탑승 대기자 수에 대한 정보를 획득할 수도 있다. 예컨대, 엘리베이터 제어 장치 또는 빌딩 관리 장치 는 건물 내 각 층의 엘리베이터 대기 위치마다 구비된 CCTV를 통해 획득되는 영상을 로봇(100a)으로 전송하고, 프로세서는 수신된 영상으로부터 탑승 대기자 수에 대한 정보를 획득할 수 있다. 또는, 엘리베이터 제어 장치 또는 빌딩 관리 장치가 상기 획득된 영상으로부터 탑승 대기자 수에 대한 정보를 획득하고, 획득된 정보를 로봇(100a)으로 전송할 수 있다. 실시 예에 따라, 도 12에 도시된 바와 같이 탑승 위치 설정 모델(231b)로 입력되는 데이터(INPUT_DATA)는 현재 시각 등의 다양한 데이터를 더 포함할 수도 있다. 로봇(100a)은 탑승 위치 설정 모델(231b)로부터 출력되는 데이터(OUTPUT_DATA)로부터 로봇(100a)의 탑승 위치 정보를 획득할 수 있다(S1120). 로봇(100a)은 획득된 탑승 위치 정보에 대응하는 위치로 이동하도록 주행 모터 를 제어할 수 있다(S1130). 탑승 위치 설정 모델(231b)은 입력된 데이터(INPUT_DATA)에 대한 결과 값을 추론하고, 추론된 결과 값을 포함하 는 데이터(OUTPUT_DATA)를 출력할 수 있다. 예컨대, 상기 데이터(OUTPUT_DATA)는 로봇(100a)의 탑승 위치를 좌표 형태로 출력할 수 있다. 실시 예에 따라, 상기 데이터(OUTPUT_DATA)는 로봇(100a)의 탑승 가능 여부에 대한 정보를 더 포함할 수도 있다. 프로세서는 상기 데이터(OUTPUT_DATA)로부터 획득된 탑승 위치로 이동하도록 주행 모터를 제어할 수 있다. 실시 예에 따라, 프로세서 또는 러닝 프로세서는, 상기 획득된 탑승 위치로의 이동 후 탑승 결과(탑 승 완료 또는 탑승 불가)를 이용하여 탑승 위치 설정 모델(231b)의 학습 동작을 수행할 수 있다. 상기 학습 동 작에 의해 탑승 위치 설정 모델(231b)이 업데이트될 수 있다. 즉, 도 11 내지 도 12에 도시된 실시 예에 따르면, 로봇(100a)은 인공지능 기반으로 학습된 모델을 이용함으로 써, 엘리베이터의 이용과 관련된 다양한 정보에 맞는 최적의 탑승 위치를 설정할 수 있다. 도 13은 로봇이 엘리베이터 내의 중량 정보에 따라 탑승 위치를 설정 및 변경하는 동작을 설명하기 위한 플로우 차트이다. 도 13을 참조하면, 로봇(100a)은 엘리베이터를 호출하고(S1300), 탑승자 및/또는 탑승 물체의 중량 정보에 기초 하여 엘리베이터로의 탑승 가능 여부를 확인할 수 있다(S1310). 엘리베이터는 내부의 탑승자 및 물체의 총 중량(이하 적재 중량으로 정의함)을 감지하는 센서를 구비할 수 있다. 엘리베이터 제어 장치는 상기 센서에 의해 감지된 적재 중량이 기설정된 임계 중량(또는 정격 중량)에 도 달하는 경우 추가적인 탑승자나 물체의 탑승을 제한할 수 있다. 프로세서는 엘리베이터 제어 장치로부터 상기 적재 중량에 대한 정보를 수신하고, 상기 적재 중량과 로봇 (100a)의 중량의 합이 상기 임계 중량을 초과하는지 여부에 따라 탑승 가능 여부를 확인할 수 있다. 실시 예에 따라, 프로세서는 엘리베이터의 도어가 오픈되면, 카메라를 통해 내부 공간의 영상을 획득 하고, 획득된 영상으로부터 내부 공간에 존재하는 탑승자 및 물체를 감지할 수 있다. 프로세서는 감지된 탑승자 및 물체에 기초하여 상기 적재 중량을 추정하고, 추정된 적재 중량과 로봇(100a)의 중량의 합이 임계 중 량을 초과하는지 여부에 따라 탑승 가능 여부를 확인할 수도 있다. 확인 결과 엘리베이터에 탑승 불가능한 경우(S1320의 NO), 로봇(100a)은 엘리베이터에 탑승하지 않고 대기하거 나 다른 엘리베이터에 탑승할 수 있다(S1330). 상기 적재 중량과 로봇(100a)의 중량의 합이 임계 중량을 초과하는 경우, 프로세서는 엘리베이터에 탑승하 지 않고 대기하거나 다른 엘리베이터에 탑승할 수 있다. 확인 결과 엘리베이터에 탑승 가능한 경우(S1320의 YES), 로봇(100a)은 탑승 위치로 이동하도록 주행 모터(16 0)를 제어할 수 있다(S1340). 상기 적재 중량과 로봇(100a)의 중량의 합이 임계 중량 이하인 경우, 프로세서는 엘리베이터에 탑승 가능 한 것으로 확인할 수 있다. 이 경우, 프로세서는 도 5 내지 도 12에 도시된 실시 예에 따라 설정되는 탑승 위치로 이동하도록 주행 모 터를 제어할 수 있다. 실시 예에 따라, 엘리베이터의 탑승 후, 로봇(100a)은 탑승자 및/또는 탑승 물체의 변화에 따른 엘리베이터 내 의 중량 배분을 추정할 수 있다(S1350). 로봇(100a)은 추정된 중량 배분에 기초하여 탑승 위치를 이동하도록 주 행 모터를 제어할 수 있다(S1360). 프로세서는 카메라를 통해 획득되는 영상 및/또는 거리 센서를 통해 획득되는 센싱 데이터를 이 용하여, 엘리베이터 내에 존재하는 탑승자 및/또는 물체의 수나 위치 변화를 감지하고, 감지 결과에 기초하여 엘리베이터 내의 중량 배분을 추정할 수 있다. 프로세서는 엘리베이터 내의 소정 영역들 간의 중량 편차가 기준 편차 이상인 것으로 추정되는 경우, 상기 중량 편차를 감소시킬 수 있는 위치로 로봇(100a)의 위치를 이동시킬 수 있다. 또는 프로세서는 추정된 중량 배분에 기초하여 엘리베이터의 무게 중심이 내부 공간의 중심부에 위치하도 록 로봇(100a)의 위치를 설정하고, 설정된 위치로 이동하도록 주행 모터를 제어할 수도 있다. 도 14a 내지 도 14b는 도 13의 동작과 관련된 예시도들이다. 도 14a를 참조하면, 프로세서는 엘리베이터의 적재 중량에 기초하여 로봇(100a)이 탑승 가능한 것으 로 확인되는 경우, 설정된 탑승 위치로 이동하도록 주행 모터를 제어할 수 있다. 실시 예에 따라, 프로세서는 내부 공간의 탑승자 분포에 기초하여 탑승 위치를 설정할 수도 있다. 도 14a에 도시된 바와 같이 내부 공간에 제1 탑승자 내지 제4 탑승자가 존재하는 경우, 탑승자들로 인해 무게중심이 내부 공간의 중앙부와 하차 층수 정보 출력부 사이에 위치할 수 있다. 프로세서는 상기 무게중심을 내부 공간의 중앙부로 이동시키기 위해, 탑승 위치를 도 14a에 도시된 위치로 설정할 수 있다. 한편, 도 14b를 참조하면, 로봇(100a)의 탑승 후 엘리베이터의 이동 중 제2 탑승자 및 제3 탑승자가 하차한 경우, 탑승자들의 하차로 인해 무게중심의 위치가 변경될 수 있다. 프로세서는 센싱부를 통해 탑승자의 수 및 위치 변화를 감지하고, 감지 결과에 기초하여 무게중심의 위치 변화를 추정할 수 있다. 프로세서는 변경된 무게중심 위치를 내부 공간의 중앙부로 다시 이동시키기 위해, 로봇(100a)의 위치 를 변경시킬 수 있다. 즉, 도 13 내지 도 14b에 도시된 실시 예에 따르면, 로봇(100a)은 엘리베이터의 적재 중량에 따라 탑승 여부를 결정함으로써 과적으로 인한 엘리베이터의 불안정한 이동이나 고장 발생을 방지할 수 있다. 또한 로봇(100a)은 엘리베이터 내의 중량 배분 또는 무게중심에 기초하여 탑승 위치를 조절함으로써, 중량 편차 로 인한 엘리베이터의 불안정한 이동을 방지하고, 엘리베이터의 고장 발생을 최소화할 수 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이 고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사 상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6a 도면6b 도면7 도면8a 도면8b 도면8c 도면9 도면10a 도면10b 도면11 도면12 도면13 도면14a 도면14b"}
{"patent_id": "10-2019-0151633", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 로봇을 포함하는 AI 장치를 나타낸다. 도 2는 본 발명의 일 실시 예에 따른 로봇과 연결되는 AI 서버를 나타낸다. 도 3은 본 발명의 일 실시 예에 따른 로봇을 포함하는 AI 시스템을 나타낸다. 도 4는 본 발명의 일 실시 예에 따른 로봇의 제어 구성을 나타내는 블록도이다. 도 5는 본 발명의 실시 예에 따른 로봇의 엘리베이터 탑승 시 제어 동작을 설명하기 위한 플로우차트이다. 도 6a 내지 도 6b는 로봇의 엘리베이터 탑승 위치 설정과 관련된 예시도들이다. 도 7은 로봇의 엘리베이터 탑승 시, 기본 위치로의 탑승 여부에 기초하여 수행하는 제어 동작의 예를 설명하기 위한 플로우차트이다. 도 8a 내지 도 8c는 도 7의 제어 동작과 관련된 예시도들이다. 도 9는 로봇이 하차 층수에 기초하여 엘리베이터로의 탑승을 제어하는 동작을 설명하기 위한 플로우차트이다. 도 10a 내지 도 10b는 도 9의 제어 동작과 관련된 예시도들이다. 도 11은 로봇이 인공지능 기반으로 학습된 모델을 이용하여 엘리베이터로의 탑승을 제어하는 동작을 설명하기 위한 플로우차트이다. 도 12는 도 11의 제어 동작과 관련된 예시도이다. 도 13은 로봇이 엘리베이터 내의 무게 정보에 따라 탑승 위치를 설정 및 변경하는 동작을 설명하기 위한 플로우 차트이다. 도 14a 내지 도 14b는 도 13의 동작과 관련된 예시도들이다."}
