{"patent_id": "10-2021-0182505", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0089666", "출원번호": "10-2021-0182505", "발명의 명칭": "인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치", "출원인": "김양균", "발명자": "김양균"}}
{"patent_id": "10-2021-0182505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "터널 설계를 위한 지반조사를 통하여 수집된 지반정보와 해당 터널의 굴착 시에 나타난 막장의 실제 암반분류결과를 수집하는 학습데이터 수집부;상기 학습데이터 수집부로부터 수집된 정보를 학습하여 암반분류에 관련된 학습모델을 생성하는 학습모델 생성부; 및새로운 터널 설계가 진행되는 경우, 해당 지역에 대해 조사된 지반조사결과를 상기 학습모델에 입력하여 터널노선의 일정 구간별로 최종 암반분류 결과를 각각 분석하는 데이터 분석부;를 포함하되,상기 학습데이터 수집부는,과거에 실시된 다수의 터널설계를 위한 전기비저항탐사, 시추조사, 탄성파탐사, 암석의 종류, 지표에서부터 터널 상단까지의 심도 중 적어도 하나를 포함하는 지반조사 결과 및 해당 터널의 굴착 시에 나타난 막장의 실제암반분류결과를 수집하고, 상기 수집된 정보 중 터널 전구간 또는 일부 구간에 대해 실시한 전기비저항탐사 결과와 일부 지점에 대해서만 실시한 시추조사 결과를 기초로 예비 암반분류결과를 도출하고,상기 학습모델 생성부는,상기 예비 암반분류결과와 상기 예비 암반분류결과외 다른 지반조사결과를 입력 데이터로 하고, 상기 막장의 실제 암반분류결과를 출력결과로 하는 학습을 수행하여 적어도 하나의 학습모델을 생성하며,상기 데이터 분석부는,새로운 터널의 설계시, 기 실시된 지반조사결과 중 전기비저항탐사 결과와 시추조사 결과를 기초로 터널노선 상의 일정 구간별로 도출된 예비 암반분류결과 및 상기 예비 암반분류결과외 다른 지반조사 결과를 상기 학습된학습모델에 입력하여 터널노선 상의 일정 구간별로 최종 암반분류결과를 분석하는 것을 특징으로 하는 인공지능기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치."}
{"patent_id": "10-2021-0182505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 학습데이터 수집부는,전기비저항탐사 결과와 시추조사 결과를 기초로 도출된 터널노선 상의 일정 구간별 예비 암반분류결과와 탄성파탐사에서 분석된 탄성파 속도, 암석의 종류, 지표에서부터 터널 상단까지의 심도 중 적어도 하나의 결과에서 동일한 구간별로 해당 터널의 굴착 시 나타난 각 막장의 암반분류결과와 대응하는 데이터를 도출하는 것을 특징으로 하는 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치."}
{"patent_id": "10-2021-0182505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 학습모델 생성부는,예비 암반분류결과, 터널구간에서의 탄성파탐사에 의한 탄성파 속도, 터널노선 각 지점별 지표에서 터널까지의심도, 암석의 종류, 해당 터널 굴착 시 나타난 막장의 실제 암반분류결과 중 적어도 하나의 정보를 기반으로 학습하여 학습모델을 생성하는 것을 특징으로 하는 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시암반분류 장치."}
{"patent_id": "10-2021-0182505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,공개특허 10-2022-0089666-2-상기 학습모델 생성부는,레이블이 설정된 복수의 학습데이터로부터 추출된 서로 다른 복수의 데이터 샘플을 이용하여 복수의 예측모델을학습시키고, 상기 학습된 복수의 예측모델을 이용하여 학습모델을 생성하는 것을 특징으로 하는 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치."}
{"patent_id": "10-2021-0182505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 학습모델 생성부는,레이블이 설정된 복수의 학습데이터로부터 추출된 복수의 데이터 샘플에 대응하는 예측모델을 학습시키고, 상기학습된 예측모델에 상기 복수의 학습데이터를 입력하여 산출된 예측값 중 오답인 데이터에 기 설정된 가중치를곱하여 다음 학습데이터를 생성하며, 상기 다음 학습데이터를 생성하는 과정을 반복수행하여 복수의 예측모델을생성하고, 상기 생성된 복수의 예측모델을 이용하여 학습모델을 생성하는 것을 특징으로 하는 인공지능 기술과굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치."}
{"patent_id": "10-2021-0182505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 학습모델 생성부는,레이블이 설정된 복수의 학습데이터를 공통으로 이용하여 서로 다른 복수의 예측모델을 학습시키고, 상기 학습된 복수의 예측모델을 이용하여 학습모델을 생성하는 것을 특징으로 하는 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치."}
{"patent_id": "10-2021-0182505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 학습모델 생성부는,인공신경망(Artificial Neural Networks, ANN), 배깅(Bootstrap Aggregating, Bagging), 부스팅(Boosting), 보팅(Voting) 및 SVM (Support Vector Machine) 중 적어도 하나의 기법을 이용하여 학습모델을 생성하는 것을 특징으로 하는 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치."}
{"patent_id": "10-2021-0182505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서,상기 데이터 분석부는,새로운 터널 설계시, 새로운 터널에 대한 예비 암반분류결과를 도출하고, 상기 도출된 예비 암반분류결과 및 탄성파탐사를 통해 도출된 탄성파속도, 터널노선 각 지점별 지표에서 터널까지의 심도, 암석의 종류 중 적어도 하나의 정보를 포함하는 지반조사결과를 학습모델에 입력하여 상기 새로운 터널에서의 최종적인 암반분류결과를분석하는 것을 특징으로 하는 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치."}
{"patent_id": "10-2021-0182505", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치가 개시된다. 본 발명의 암 반분류 장치는 터널 설계를 위한 지반조사를 통하여 수집된 지반정보와 해당 터널의 굴착 시에 나타난 막장의 실 제 암반분류결과를 수집하는 학습데이터 수집부, 학습데이터 수집부로부터 수집된 정보를 학습하여 암반분류에 관련된 학습모델을 생성하는 학습모델 생성부 및 새로운 터널 설계가 진행되는 경우, 해당 지역에 대해 조사된 지반조사결과를 학습모델에 입력하여 터널노선의 일정 구간별로 최종 암반분류 결과를 각각 분석하는 데이터 분 석부를 포함한다."}
{"patent_id": "10-2021-0182505", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 암반분류 기술에 관한 것으로, 더욱 상세하게는 이미 굴착 완료된 터널의 설계시의 지반조사결과와 굴착시의 암반분류결과를 인공지능 기술로 분석하여 다른 터널 및 지하 공간 설계시 암반분류의 정확도를 향상 시키는 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치에 관한 것이다."}
{"patent_id": "10-2021-0182505", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 터널과 같은 지하 공간의 설계에서 암반의 상태를 파악하는 것은 안전과 경제적인 측면에서 매우 중 요하다. 따라서 암반의 상태를 객관적으로 평가할 수 있는 공학적 방법이 필요하며 이러한 방법을 암반 분류라고 한다. 암반 분류 방법 중 가장 일반적으로 활용되는 것이 1974년에 Z.T. Bieniawski가 제안한 RMR(Rock Mass Rating, 암반등급)과 1975년 Nick Barton이 제안한 Q값이다. RMR은 신선암의 강도, 암질지수(Rock Quality Designation, RQD), 절리(불연속면) 간격, 절리(불연속면) 상태, 지하수 상태 등 총 5개 항목 각각에 대해 할당 된 배점을 합산한 후 터널의 방향성에 대한 보정을 하여 최종 점수를 산정한다. Q값은 암질지수(Rock Quality Designation, RQD), 절리군의 수, 절리면의 거칠기, 절리면의 변질정도, 절리내 지하수 저감계수, 응력감소계수 의 조합으로 계산이 된다. 터널을 설계할 때 터널구간에 대하여 시추조사, 전기비저항탐사, 탄성파탐사, 지형조사, 암석시험 등과 같은 지 반조사를 실시하고 이를 통해 전기비저항측정치, 탄성파속도, 암석의 종류(암종), 터널 각 지점별 지표에서 터 널까지의 심도, 암반의 강도 등과 같은 암반 특성을 파악하게 된다. 도 1에서 도시된 바와 같이 터널 전 구간 또는 일부 구간에 대해 실시하는 전기비저항탐사 결과와 터널 일부 지 점에 대해서만 실시하는 시추조사 결과를 상관분석하여 상관식을 도출한 후 전기비저항탐사를 실시하였으나, 시 추조사가 실시되지 않아 암반분류를 할 수 없는 동일 터널내 여타 구간에 대하여 측정된 전기비저항값을 상술된 상관식에 입력하여 터널노선상의 일정 구간별 암반분류결과(RMR 또는 Q값)를 도출하였다. 이러한 경우 시추가 이루어지지 않은 대부분의 터널구간에 대한 암반분류결과가 오직 전기비저항탐사 결과에 의 해서만 결정되어 터널굴착시 나타나는 실제 암질의 상태와 많은 차이를 나타나게 됨으로써, 터널설계시 추정된 공사비 및 공사기간이 실제와 적지 않은 차이를 나타내는 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2021-0105307호(2021.08.26.)"}
{"patent_id": "10-2021-0182505", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적 과제는 이미 굴착 완료된 터널의 설계시의 지반조사결과와 굴착시의 암반분류 결과를 인공지능 기술로 분석하여 다른 터널 및 지하 공간 설계시 암반분류의 정확도를 향상시키는 인공지능 기 술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치를 제공하는데 목적이 있다."}
{"patent_id": "10-2021-0182505", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위해 본 발명에 따른 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분 류 장치는 터널 설계를 위한 지반조사를 통하여 수집된 지반정보와 해당 터널의 굴착 시에 나타난 막장의 실제 암반분류결과를 수집하는 학습데이터 수집부, 상기 학습데이터 수집부로부터 수집된 정보를 학습하여 암반분류 에 관련된 학습모델을 생성하는 학습모델 생성부 및 새로운 터널 설계가 진행되는 경우, 해당 지역에 대해 조사 된 지반조사결과를 상기 학습모델에 입력하여 터널노선의 일정 구간별로 최종 암반분류 결과를 각각 분석하는 데이터 분석부를 포함하되, 상기 학습데이터 수집부는, 과거에 실시된 다수의 터널설계를 위한 전기비저항탐사, 시추조사, 탄성파탐사, 암석의 종류, 지표에서부터 터널 상단까지의 심도 중 적어도 하나를 포함하는 지반조사 결과 및 해당 터널의 굴착 시에 나타난 막장의 실제 암반분류결과를 수집하고, 상기 수집된 정보 중 터널 전구 간 또는 일부 구간에 대해 실시한 전기비저항탐사 결과와 일부 지점에 대해서만 실시한 시추조사 결과를 기초로 예비 암반분류결과를 도출하고, 상기 학습모델 생성부는, 상기 예비 암반분류결과와 상기 예비 암반분류결과외 다른 지반조사결과를 입력 데이터로 하고, 상기 막장의 실제 암반분류결과를 출력결과로 하는 학습을 수행하여 적어도 하나의 학습모델을 생성하며, 상기 데이터 분석부는, 새로운 터널의 설계시, 기 실시된 지반조사결과 중 전기비저항탐사 결과와 시추조사 결과를 기초로 터널노선 상의 일정 구간별로 도출된 예비 암반분류결과 및 상 기 예비 암반분류결과외 다른 지반조사 결과를 상기 학습된 학습모델에 입력하여 터널노선 상의 일정 구간별로 최종 암반분류결과를 분석하는 것을 특징으로 한다. 또한 상기 학습데이터 수집부는, 전기비저항탐사 결과와 시추조사 결과를 기초로 도출된 터널노선 상의 일정 구 간별 예비 암반분류결과와 탄성파탐사에서 분석된 탄성파 속도, 암석의 종류, 지표에서부터 터널 상단까지의 심 도 중 적어도 하나의 결과에서 동일한 구간별로 해당 터널의 굴착 시 나타난 각 막장의 암반분류결과와 대응하 는 데이터를 도출하는 것을 특징으로 한다. 또한 상기 학습모델 생성부는, 예비 암반분류결과, 터널구간에서의 탄성파탐사에 의한 탄성파 속도, 터널노선 각 지점별 지표에서 터널까지의 심도, 암석의 종류, 해당 터널 굴착 시 나타난 막장의 실제 암반분류결과 중 적 어도 하나의 정보를 기반으로 학습하여 학습모델을 생성하는 것을 특징으로 한다. 또한 상기 학습모델 생성부는, 레이블이 설정된 복수의 학습데이터로부터 추출된 서로 다른 복수의 데이터 샘플 을 이용하여 복수의 예측모델을 학습시키고, 상기 학습된 복수의 예측모델을 이용하여 학습모델을 생성하는 것 을 특징으로 한다. 또한 상기 학습모델 생성부는, 레이블이 설정된 복수의 학습데이터로부터 추출된 복수의 데이터 샘플에 대응하 는 예측모델을 학습시키고, 상기 학습된 예측모델에 상기 복수의 학습데이터를 입력하여 산출된 예측값 중 오답 인 데이터에 기 설정된 가중치를 곱하여 다음 학습데이터를 생성하며, 상기 다음 학습데이터를 생성하는 과정을 반복수행하여 복수의 예측모델을 생성하고, 상기 생성된 복수의 예측모델을 이용하여 학습모델을 생성하는 것을 특징으로 한다. 또한 상기 학습모델 생성부는, 레이블이 설정된 복수의 학습데이터를 공통으로 이용하여 서로 다른 복수의 예측 모델을 학습시키고, 상기 학습된 복수의 예측모델을 이용하여 학습모델을 생성하는 것을 특징으로 한다. 또한 상기 학습모델 생성부는, 인공신경망(Artificial Neural Networks, ANN), 배깅(Bootstrap Aggregating, Bagging), 부스팅(Boosting), 보팅(Voting) 및 SVM (Support Vector Machine) 중 적어도 하나의 기법을 이용하 여 학습모델을 생성하는 것을 특징으로 한다. 또한 상기 데이터 분석부는, 새로운 터널 설계시, 새로운 터널에 대한 예비 암반분류결과를 도출하고, 상기 도 출된 예비 암반분류결과 및 탄성파탐사를 통해 도출된 탄성파속도, 터널노선 각 지점별 지표에서 터널까지의 심 도, 암석의 종류 중 적어도 하나의 정보를 포함하는 지반조사결과를 학습모델에 입력하여 상기 새로운 터널에서 의 최종적인 암반분류결과를 분석하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0182505", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 인공지능 기술과 굴착시 암반분류결과를 이용한 터널 설계시 암반분류 장치는 이미 굴착 완료된 터널의 설계시의 지반조사결과와 굴착시의 암반분류결과(RMR 또는 Q값)를 인공지능 기술에 적용하여 터널노선의 일정 구간별 RMR 또는 Q값을 분석함으로써, 설계시 수집된 전기비저항탐사결과와 시추조사결과만으로 도출되던 종래의 암반분류결과보다 더 정확한 평가결과를 도출할 수 있다. 이를 통해 본 발명은 설계시 추정한 터널시공비용 및 기간의 오차를 줄일 수 있다."}
{"patent_id": "10-2021-0182505", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 우선 각 도면의 구성요소들에 참조부호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가 지도록 하고 있음에 유의한다. 또한 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설 명이 당업자에게 자명하거나 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 도 2는 본 발명의 실시예에 따른 암반분류 장치를 설명하기 위한 블록도이고, 도 3은 본 발명의 실시예에 따른 암반분류 과정을 설명하기 위한 도면이며, 도 4는 본 발명의 실시예에 따른 학습데이터 수집부를 설명하기 위한 도면이며, 도 5는 본 발명의 일 실시예에 따른 인공신경망을 이용하여 학습모델을 생성하는 과정을 설명하기 위 한 도면이고, 도 6은 본 발명의 다른 실시예에 따른 배깅 기법을 이용하여 학습모델을 생성하는 과정을 설명하 기 위한 도면이며, 도 7은 본 발명의 또 다른 실시예에 따른 부스팅 기법을 이용하여 학습모델을 생성하는 과정 을 설명하기 위한 도면이고, 도 8은 본 발명의 또 다른 실시예에 따른 보팅 기법을 이용하여 학습 모델을 생성 하는 과정을 설명하기 위한 도면이다. 도 2 내지 도 8을 참조하면, 암반분류 장치는 이미 굴착 완료된 터널의 설계시의 지반조사결과와 굴착시의 암반분류결과를 인공지능 기술로 분석하여 다른 터널 및 지하 공간 설계시 암반분류의 정확도를 향상시킨다. 암 반분류 장치는 입력부, 제어부, 출력부 및 저장부를 포함한다. 입력부는 새로운 터널 설계를 위해 수집된 지반조사와 관련된 지반정보를 입력받는다. 여기서 지반정보는 암반의 특성을 나타내는 정보로써, 예를 들면 전기비저항탐사, 시추조사, 탄성파탐사, 암석의 종류, 지표에서부 터 터널 상단까지의 심도 등을 포함하는 정보일 수 있다. 또한 입력부는 수집된 정보 중 터널 전구간 또는 일부 구간에 대해 실시한 전기비저항탐사 결과와 일부 지점에 대해서만 실시한 시추조사 결과를 기초로 예비 암 반분류결과를 도출한다. 제어부는 암반분류 장치의 전반적인 제어를 수행한다. 제어부는 사전에 굴착이 완료된 터널의 설 계시 조사된 지반정보와 실제 굴착시 암반분류결과를 수집하고, 수집된 정보를 데이터 전처리를 한다. 데이터 전처리는 수집된 정보가 추후 수행된 분석에 맞도록 정렬, 포맷 변경 등을 수행하는 과정일 수 있다. 제어부 는 전처리된 정보를 학습하여 암반분류에 관련된 학습모델을 생성한다. 제어부는 다양한 인공지능 기술 을 이용하여 전처리된 정보를 학습시킬 수 있으며, 바람직하게는 인공신경망(Artificial Neural Networks, ANN), 배깅(Bootstrap Aggregating, Bagging), 부스팅(Boosting), 보팅(Voting) 및 SVM (Support Vector Machine) 중 적어도 하나의 기법을 이용하여 학습모델을 생성할 수 있다. 제어부는 새로운 터널 설계가 진 행되는 경우, 해당 지역에 대해 조사된 지반조사결과를 생성된 학습모델에 입력하여 터널노선의 일정 구간별로 최종 암반분류 결과(RMR 또는 Q값)를 각각 분석한다. 상세하게는 제어부는 학습데이터 수집부, 학습모델 생성부 및 데이터 분석부를 포함한다. 학습데이터 수집부는 학습용 지반데이터 정보를 수집하고, 전처리한다. 상세하게는 학습데이터 수집부 는 과거에 실시된 다수의 터널설계를 위한 전기비저항탐사, 시추조사, 탄성파탐사, 암석의 종류, 지표에서부터 터널 상단까지의 심도 중 적어도 하나를 포함하는 지반조사 결과 및 해당 터널의 굴착 시에 나타난 막장의 실제 암반분류결과를 수집한다. 학습데이터 수집부는 수집된 정보 중 터널 전구간 또는 일부 구간에 대해 실시한 전기비저항탐사 결과와 일부 지점에 대해서만 실시한 시추조사 결과를 기초로 예비 암반분류결과를 도출한다. 이때 학습데이터 수집부는 도출된 터널노선 상의 일정 구간별 예비 암반분류결과와 탄성파탐사에서 분석된 탄성파 속도, 암석의 종류, 지표에서부터 터널 상단까지의 심도 중 적어도 하나의 결과에서 동일한 구간별로 해 당 터널의 굴착 시 나타난 각 막장의 암반분류결과와 대응하는 데이터를 도출한다. 즉 학습데이터 수집부는 추후 수행될 분석에 맞도록 수집 및 도출된 정보들을 도 4와 같이 각 정보들을 터널 구간별로 포맷을 정리하는 전처리를 할 수 있다. 학습모델 생성부는 예비 암반분류결과와 예비 암반분류결과외 다른 지반조사결과를 입력 데이터로 하고, 막 장의 실제 암반분류결과를 출력결과로 하는 학습을 수행하여 적어도 하나의 학습모델을 생성한다. 여기서 학습 모델은 인공지능 기술을 기반으로 생성된 모델로써, 바람직하게는 인공신경망, 배깅, 부스팅, 보팅 및 SVM 중 적어도 하나의 기법을 이용할 수 있으나, 이에 한정하지 않는다.예를 들어 도 5에 도시된 바와 같이 인공지능모델은 인공신경망을 이용하여 생성될 수 있다. 이때 인공신경망은 복수의 계층을 포함한다. 이러한 복수의 계층은 입력층(IL: Input Layer), 은닉층(HL: Hidden Layer, HL1 내지 HLk) 및 출력층(OL: Output Layer)을 포함한다. 또한, 복수의 계층(IL, HL, OL) 각각은 하나 이상의 노드를 포함한다. 예컨대, 도시된 바와 같이, 입력층(IL)은 n개의 입력노드(i1 ~ in)를 포함하며, 출력층(OL)은 1개의 출력노드(v)를 포함할 수 있다. 또한, 은닉층(HL) 중 제1 은닉계층(HL1)은 a개의 노드(h11 ~ h1a)를 포함하고, 제2 은닉계층(HL2)은 b개의 노드(h21 ~ h2b)를 포함 하고, 제k 은닉계층(HLk)은 c개의 노드(hk1 ~ hkc)를 포함할 수 있다. 그러면, 인공신경망의 원형으로부터 학습모델을 생성하는 방법에 대해서 설명하기로 한다. 학습모델 생성부(3 3)는 예비 암반분류결과, 터널구간에서의 탄성파탐사에 의한 탄성파 속도, 터널노선 각 지점별 지표에서 터널까 지의 심도, 암석의 종류 중 적어도 하나의 정보를 학습데이터로 마련한다. 학습데이터가 마련되면, 학습모델 생 성부는 학습데이터의 입력 데이터에 대응하여 해당 터널 굴착 시 나타난 막장의 실제 암반분류결과를 레이 블로 설정한다. 그런 다음, 학습모델 생성부는 입력 데이터를 입력특징벡터로 변환하고, 학습모델의 원형, 즉, 인공신경망의 원형에 입력한다. 그러면, 복수의 계층의 복수의 노드는 입력특징벡터에 대응하여 연산 결과 에 가중치 및 임계치를 포함하는 인공신경망의 파라미터가 적용되어 다음 계층의 연산에 입력되는 연산을 수행 하여 최종적으로 출력값을 산출한다. 즉, 인공신경망의 복수의 계층의 복수의 노드는 입력특징벡터에 대해 가중 치 및 임계치를 포함하는 인공신경망의 파라미터가 적용되는 복수의 연산을 수행하여 최종적으로 출력값을 산출 한다. 이러한 출력값은 막장의 실제 암반분류결과의 추정치이다. 학습모델 생성부는 평가 지표를 통해 학습모델의 원형이 소정의 정확도에 도달할 때까지 복수의 서로 다른 학습데이터를 이용하여 전술한 바와 같은 최적화를 반복하여 수행함으로써 학습모델을 생성한다. 다음으로, 본 발명의 다른 실시예에 따른 학습모델을 생성하는 방법에 대해서 설명하기로 한다. 도 6은 배깅 기 법을 통해 학습모델을 생성하는 방법을 설명하기 위한 도면이다. 학습모델 생성부는 복수의 학습데이터(fd)를 마련한다. 이때, 각각의 학습데이터(fd)는 입력 데이터에 대응 하는 레이블, 즉, 해당 터널 굴착 시 나타난 막장의 실제 암반분류결과 데이터를 의미한다. 그런 다음, 학습모델 생성부는 최초 입력된 복수개의 학습데이터(fd)에서 무작위로 선택하여(예컨대, {A, B, D, E}와 같이 크기 4의 표본) 구성된 복수의 데이터 샘플 (예컨대, sd1, sd1, sd3)를 마련한다. 이어서, 학습모델 생성부는 복수의 데이터 샘플 각각에 대응하는 복수의 예측모델(m1, m2, m3)의 원형을 준 비한다. 도시된 바에 따르면, 제1 내지 제3 데이터 샘플(sd1, sd2, sd3) 각각에 대응하여 제1 내지 제3 예측모 델(m1, m2, m3)이 마련되었다. 예측모델은 인공신경망(ANN), 결정트리(Decision Tree) 등을 예시할 수 있다. 하 지만, 본 발명을 이에 한정하는 것은 아니며, 학습이 적용될 수 있는 모두 종류의 모델은 본 발명의 예측모델이 될 수 있다. 이어서, 학습모델 생성부는 서로 다른 복수의 데이터 샘플 각각에 대응하는 예측모델에 입력하여 복수의 예 측모델 각각으로부터 예측값을 얻는다. 즉, 학습모델 생성부가 제1 내지 제3 샘플(sd1, sd2, sd3) 각각을 대응하는 예측모델(m1, m2, m3)의 원형에 입력하여 제1 내지 제3 예측모델(m1, m2, m3) 각각으로부터 제1 내지 제3 예측값(P1, P2, P3)을 얻는다. 이어서, 학습모델 생성부는 제1 내지 제3 예측값(P1, P2, P3) 각각과 대응하는 레이블의 차이가 최소가 되 도록 제1 내지 제3 예측모델(m1, m2, m3)의 원형 각각의 파라미터를 최적화하는 학습을 수행하여 제1 내지 제3 예측모델을 완성한다. 이로써, 학습모델 생성부는 복수의 예측모델을 포함하는 학습모델이 생성한다. 다음으로, 본 발명의 다른 실시예에 따른 학습모델을 생성하는 방법에 대해서 설명하기로 한다. 도 7은 본 발명 의 다른 실시예에 따른 부스팅 기법을 통해 학습모델을 생성하는 방법을 설명하기 위한 도면이다. 먼저, 학습모델 생성부는 최초 입력되는 복수개의 제1 학습데이터(fd1)을 마련한다. 이때, 각각의 제1 학습 데이터(fd1)는 입력 데이터에 대응하는 레이블, 즉, 해당 터널 굴착 시 나타난 막장의 실제 암반분류결과 데이 터를 의미한다. 다음으로, 도 7을 참조하면, 학습모델 생성부는 복수의 제1 학습데이터(fd1)에서 소정 크기의 표본을 추출 하는 샘플링을 수행하여 복수의 제1 데이터 샘플(sd1){B D E I}를 추출한다. 이어서, 학습모델 생성부는 하 나의 제1 예측모델(m1)의 원형을 준비한다. 도시된 예에 따르면, 제1 예측모델(m1)의 원형이 마련되었다. 전술 한 바와 같이, 예측모델은 인공신경망(ANN), 결정트리(Decision Tree) 등을 예시할 수 있고, 학습이 적용되는모든 종류의 알고리즘이 예측모델이 될 수 있다. 그런 다음, 학습모델 생성부는 복수의 제1 데이터 샘플(sd1)을 제1 예측모델(m1)의 원형에 입력하여 도출되 는 제1 예측값(P1)과 대응하는 레이블과의 차이가 최소가 되도록 제1 예측모델(m1)의 원형의 파라미터를 최적화 하는 학습을 수행하여 제1 예측모델(m1)을 완성한다. 이어서, 학습모델 생성부는 학습된 제1 예측모델(m1)의 타당성을 검증하기 위하여 복수의 제1 학습데이터 (fd1) 전체를 제1 예측모델(m1)에 입력하여 산출된 예측값(P1)과 이에 상응하는 레이블을 비교한다. 그런 다음, 학습모델 생성부는 산출된 예측값(P1)과 레이블이 동일한 경우의 정답 학습데이터{B D E I}는 제외하고 레 이블과 상이한 오답학습데이터{A C F G H}가 차후 모델에서 다시 샘플링될 가능성을 높이도록 상기 오답 학습데 이터에 소정의 가중치를 곱하여 보정된 학습데이터{A‘C’F‘G’H‘}로 만든 후, 제1 학습데이터(fd1)에 있던 상응하는 데이터{A C F G H}와 교체시켜 제2 학습데이터(fd2)를 생성한다. 그런 다음 학습모델 생성부는 제1 예측모델(m1)에서와 동일한 방법으로, 복수의 제2 학습데이터(fd2)에서 소정 크기의 표본을 추출하는 샘플링을 수행하여 복수의 제2 데이터 샘플(sd2){A’E F’H’}를 추출한다. 이어 서, 학습모델 생성부는 하나의 제2 예측모델(m2)의 원형을 준비한다. 도시된 예에 따르면, 제2 예측모델 (m2)의 원형이 마련되었다. 전술한 바와 같이, 예측모델은 인공신경망(ANN), 결정트리(Decision Tree) 등을 예 시할 수 있고, 학습이 적용되는 모든 종류의 알고리즘이 예측모델이 될 수 있다. 그런 다음, 학습모델 생성부는 복수의 제2 데이터 샘플(sd2)를 제2 예측모델(m2)의 원형에 입력하여 도출되 는 제2 예측값(P2)과 대응하는 레이블의 차이가 최소가 되도록 제2 예측모델(m2)의 원형의 파라미터를 최적화하 는 학습(training)을 수행하여 제2 예측모델(m2)을 완성한다. 이어서, 학습모델 생성부는 학습된 제2 예측모델(m2)의 타당성을 검증(validation)하기 위하여 복수의 제2 학습데이터(fd2) 전체를 제2 예측모델(m2)에 입력하여 산출된 예측값(P2)과 이에 상응하는 레이블을 비교한다. 그런 다음, 학습모델 생성부는 산출된 예측값(P2)이 레이블과 동일한 경우의 정답학습데이터{A’B D G’I} 는 제외하고 레이블과 상이한 오답학습데이터{C’E F’H’}가 차후 모델에서 다시 샘플링될 가능성을 높이도록 상기 오답 학습데이터에 소정의 가중치를 곱하여 보정된 학습데이터{C“ E’ F”H“}로 만든 후, 제2 학습데이 터(fd2)에 있던 상응하는 데이터{C’E F’H’}와 교체시켜 제3 학습데이터(fd3)를 생성한다. 그런 다음, 학습모델 생성부는 제1 예측모델(m1) 및 제2 예측모델(m2)에서 실시하였던 데이터 샘플 추출, 학습(training) 및 검증(validation)과정과 동일한 일련의 과정을 순차적으로 다수 반복한다. 이어서, 이러한 과정을 거쳐 확립된 학습모델 생성부에 새로운 데이터가 입력되면, 학습모델 생성부는 상기 각각의 예측모델(m1, m2, m3,...)을 통해 예측된 예측값(P1, P2, P3,...)과 각각의 예측모델(m1, m2, m3,...)에 상응하는 소정의 모델가중치(w1, w2, w3,...)를 곱하여 최종적인 결과값을 도출한다. 전술한 바와 같이, 학습모델 생성부는 복수의 데이터 샘플을 이용하여 예측모델의 원형에 대한 학습을 수행 하여 예측모델을 완성하고, 완성된 예측모델에 대해 복수의 학습데이터를 이용하여 검증을 수행하여, 오류가 있 는 데이터 샘플은 차후 모델에서 샘플링될 가능성을 높이도록 가중치를 부여한 채 기존 데이터와 교체하여 새로 운 학습데이터를 만들고, 다시 복수의 샘플링된 데이터를 만들어 학습, 검증하는 과정을 순차적으로 다수 반복 한다. 이렇게 해서 완성된 모델에 새로운 데이터가 입력되면, 각각의 예측모델에서 도출된 예측값과 각각의 예 측모델마다 설정된 소정의 모델가중치를 곱하여 최종적인 결과값이 도출되는 것이다. 이로써, 복수의 예측모델 을 포함하는 학습모델이 생성된다. 다음으로, 본 발명의 다른 실시예에 따른 학습모델을 생성하는 방법에 대해서 설명하기로 한다. 도 8은 본 발명 의 다른 실시예에 따른 보팅 기법을 통해 학습모델을 생성하는 방법을 설명하기 위한 도면이다. 도 8을 참조하면, 학습모델 생성부는 먼저 복수의 학습데이터(fd)를 마련한다. 이때, 각각의 학습데이터 (fd)는 입력 데이터에 대응하는 레이블, 즉, 해당 터널 굴착 시 나타난 막장의 실제 암반분류결과 데이터를 의 미한다. 이어서, 서로 다른 복수의 예측모델(ma, mb, mc)의 원형을 준비한다. 도시된 예에 따르면, 예측모델A, 예측모델 B 및 예측모델C(ma, mb, mc)의 원형이 마련될 수 있다. 여기서, 서로 다른 복수의 예측모델(ma, mb, mc)이라함 은 예컨대, 인공신경망, 결정트리 등과 같이 모델의 종류가 다르거나, CNN, RNN 등과 같이, 알고리즘의 종류가 다르거나, 예컨대, 계층, 노드와 같이 알고리즘의 구조가 다른 모델을 의미한다. 그런 다음, 학습모델 생성부는 복수의 예측모델(ma, mb, mc)의 원형 각각에 동일한 학습데이터(fd)를 입력 하여 복수의 예측모델(ma, mb, mc)의 원형 각각으로부터 예측값을 얻는다. 즉, 학습모델 생성부가 학습데이 터(fd)를 예측모델A, 예측모델B 및 예측모델C(ma, mb, mc)의 원형에 입력하여 예측모델A, 예측모델B 및 예측모 델C(ma, mb, mc)의 원형 각각으로부터 제1 내지 제3 예측값(P1, P2, P3)을 얻는다. 이어서, 학습모델 생성부는 제1 내지 제3 예측값(P1, P2, P3) 각각과 대응하는 레이블의 차이가 최소가 되 도록 예측모델A, 예측모델B 및 예측모델C(ma, mb, mc)의 원형 각각의 파라미터를 최적화하는 학습을 수행하여 예측모델A, 예측모델B 및 예측모델C(ma, mb, mc)를 완성한다. 이로써, 복수의 예측모델을 포함하는 학습모델이 생성된다. 데이터 분석부는 새로운 터널 설계시, 새로운 터널에 대한 최종 암반분류결과를 도출한다. 즉, 데이터 분석 부에서는 입력부에서 입력된 새로운 터널에서의 예비 암반분류결과, 탄성파탐사를 통해 도출된 탄성파 속도, 터널노선 각 지점별 지표에서 터널까지의 심도, 암석의 종류 중 적어도 하나의 정보를 포함하는 지반조사 결과를 학습된 학습모델에 입력하여 터널노선 상의 일정 구간별로 최종 암반분류결과를 분석한다. 여기서 학습 모델은 학습모델 생성부에서 생성되고 학습된 학습모델을 의미한다. 데이터 분석부는 분석 결과인 최종 암반분류결과를 출력부를 통해 출력되도록 제어한다. 출력부는 입력부로부터 입력된 정보를 출력하고, 제어부로부터 분석된 최종 암반분류 결과를 출력 한다. 저장부는 암반분류 장치가 구동하기 위한 프로그램 또는 알고리즘이 저장된다. 저장부는 입력부 로부터 입력된 정보가 저장되고, 제어부로부터 분석된 최종 암반분류 결과가 저장된다. 또한 저장부 에는 제어부로부터 학습된 학습데이터가 저장된다. 저장부는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 미디어 카드 마이크로 타입(multimedia card micro type), 카드 타 입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기메모리, 자기 디스크 및 광디스크 중 적어도 하나의 저장매체를 포 함할 수 있다. 도 9는 본 발명의 실시예에 따른 암반분류 방법을 설명하기 위한 순서도이다. 도 2 및 도 9를 참조하면, 암반분류 방법은 이미 굴착 완료된 터널의 설계시의 지반조사결과와 굴착시의 암반분 류결과(RMR 또는 Q값)를 인공지능 기술에 적용하여 터널노선의 일정 구간별 RMR 또는 Q값을 분석함으로써, 설계 시 수집된 전기비저항탐사결과와 시추조사결과만으로 도출되던 종래의 암반분류결과보다 더 정확한 평가결과를 도출할 수 있다. 이를 통해 암반분류 방법은 설계시 추정한 터널시공비용 및 기간의 오차를 줄일 수 있다. S110 단계에서, 암반분류 장치는 터널 설계를 위한 지반조사를 통하여 수집된 지반정보와 해당 터널의 굴 착 시에 나타난 막장의 실제 암반분류결과를 수집한다. 이때 암반분류 장치는 과거에 실시된 다수의 터널 설계를 위한 전기비저항탐사, 시추조사, 탄성파탐사, 암석의 종류, 지표에서부터 터널 상단까지의 심도 중 적어 도 하나를 포함하는 지반조사 결과 및 해당 터널의 굴착 시에 나타난 막장의 실제 암반분류결과를 수집하고, 수 집된 정보 중 터널 전구간 또는 일부 구간에 대해 실시한 전기비저항탐사 결과와 일부 지점에 대해서만 실시한 시추조사 결과를 기초로 예비 암반분류결과를 도출한다. S120 단계에서, 암반분류 장치는 수집된 정보를 학습하여 암반분류에 관련된 학습모델을 생성한다. 암반분 류 장치는 예비 암반분류결과와 예비 암반분류결과외 다른 지반조사결과를 입력 데이터로 하고, 막장의 실 제 암반분류결과를 출력결과로 하는 학습을 수행하여 적어도 하나의 학습모델을 생성한다. 이때 암반분류 장치 는 인공신경망, 배깅, 부스팅, 보팅 및 SVM 중 적어도 하나의 기법을 이용하여 학습모델을 생성할 수 있 다. S130 단계에서, 암반분류 장치는 새로운 터널 설계의 진행 여부를 판단한다. 암반분류 장치는 새로운 터널 설계가 진행되면 S140 단계를 수행하고, 진행하지 않으면 시스템을 종료한다. S140 단계에서, 암반분류 장치는 새로운 터널에서의 지반조사 데이터 수집 및 입력을 한다. 암반분류 장치 는 새로운 터널에서의 예비 암반분류결과, 탄성파탐사를 통해 도출된 탄성파속도, 터널노선 각 지점별 지 표에서 터널까지의 심도, 암석의 종류 중 적어도 하나의 정보를 포함하는 지반조사 결과를 학습된 학습모델에 입력한다.S150 단계에서, 암반분류 장치는 새로운 터널과 관련된 지역에 대해 조사된 지반조사결과를 상기 학습모델 에 입력하여 터널노선의 일정 구간별로 최종 암반분류 결과를 각각 분석한다. 암반분류 장치는 기 실시된 지반조사결과 중 전기비저항탐사 결과와 시추조사 결과를 기초로 터널노선 상의 일정 구간별로 도출된 예비 암 반분류결과 및 예비 암반분류결과외 다른 지반조사 결과를 학습된 학습모델에 입력하여 터널노선 상의 일정 구 간별로 최종 암반분류결과를 분석할 수 있다. 암반분류 장치는 분석된 결과인 최종 암반분류결과를 출력하 여 사용자가 해당 결과를 확인할 수 있도록 지원한다. 본 발명의 실시 예에 따른 방법은 컴퓨터 프로그램 명령어와 데이터를 저장하기에 적합한 컴퓨터로 판독 가능한 매체의 형태로 제공될 수도 있다. 이러한, 컴퓨터가 읽을 수 있는 기록매체는 프로그램 명령, 데이터 파일, 데 이터 구조 등을 단독으로 또는 조합하여 포함할 수 있으며, 컴퓨터 시스템에 의해 읽혀질 수 있는 데이터가 저 장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 하드 디스크, 플로피 디스 크 및 자기 테이프와 같은 자기 매체(Magnetic Media), CD-ROM(Compact Disk Read Only Memory), DVD(Digital Video Disk)와 같은 광기록 매체(Optical Media), 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체 (Magneto-Optical Media) 및 롬(ROM, Read Only Memory), 램(RAM, Random Access Memory), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치를 포함한다. 또한, 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저 장되고 실행될 수 있다. 그리고, 본 발명을 구현하기 위한 기능적인(functional) 프로그램, 코드 및 코드 세그"}
{"patent_id": "10-2021-0182505", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "먼트들은 본 발명이 속하는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 이상으로 본 발명의 기술적 사상을 예시하기 위한 바람직한 실시예와 관련하여 설명하고 도시하였지만, 본 발명 은 이와 같이 도시되고 설명된 그대로의 구성 및 작용에만 국한되는 것은 아니며, 기술적 사상의 범주를 이탈함 없이 본 발명에 대해 다수의 변경 및 수정이 가능함을 당업자들은 잘 이해할 수 있을 것이다. 따라서 그러한 모 든 적절한 변경 및 수정과 균등물들도 본 발명의 범위에 속하는 것으로 간주되어야 할 것이다."}
{"patent_id": "10-2021-0182505", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 암반분류 과정을 설명하기 위한 도면이다. 도 2는 본 발명의 실시예에 따른 암반분류 장치를 설명하기 위한 블록도이다. 도 3은 본 발명의 실시예에 따른 암반분류 과정을 설명하기 위한 도면이다. 도 4는 본 발명의 실시예에 따른 학습데이터 수집부를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 인공신경망을 이용하여 학습모델을 생성하는 과정을 설명하기 위한 도면이 다. 도 6은 본 발명의 다른 실시예에 따른 배깅 기법을 이용하여 학습모델을 생성하는 과정을 설명하기 위한 도면이 다. 도 7은 본 발명의 또 다른 실시예에 따른 부스팅 기법을 이용하여 학습모델을 생성하는 과정을 설명하기 위한 도면이다. 도 8은 본 발명의 또 다른 실시예에 따른 보팅 기법을 이용하여 학습 모델을 생성하는 과정을 설명하기 위한 도 면이다.도 9는 본 발명의 실시예에 따른 암반분류 방법을 설명하기 위한 순서도이다."}
