{"patent_id": "10-2022-0076065", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0174889", "출원번호": "10-2022-0076065", "발명의 명칭": "설비 또는 장치의 비정상 작동의 리뷰잉 시스템", "출원인": "주식회사 소프트센", "발명자": "이재성"}}
{"patent_id": "10-2022-0076065", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "장치 또는 설비의 내부 또는 외부의 미리 결정된 감시 영역 또는 감시 대상에 대한 연속적인 영상 이미지를 획득하는 영상 획득 모듈(11);획득된 영상 이미지로부터 비정상 상태를 탐지하는 이상 상태 탐지 모듈(12);이상 상태 탐지 모듈(12)에 의하여 탐지된 이미지를 분리하고, 디지털 이미지로 변환시키는 이미지 분리/변환모듈(13);변환된 이미지에 탐지 정보를 표시하는 이상 상태 표시 모듈(14); 및표시된 이미지를 확인하여 분석하고, 저장하는 분석/저장 모듈(15)을 포함하는 설비 또는 장치의 비정상 작동의리뷰잉 시스템."}
{"patent_id": "10-2022-0076065", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 영상 획득 모듈(11)은 IP 카메라를 포함하는 설비 또는 장치의 비정상 작동 리뷰잉 시스템."}
{"patent_id": "10-2022-0076065", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 분리/표시 모듈(14)에 의하여 분리된 이미지를 외부 컴퓨터로 전송하는 외부 컴퓨터 전송모듈(36)을 더 포함하는 설비 또는 장치의 비정상 작동 리뷰잉 시스템."}
{"patent_id": "10-2022-0076065", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 감시 영역은 제품이 투입되는 투입 영역, 제품이 검사되는 검사 영역 또는 제품이 배출되는배출 영역이 되는 것을 특징으로 하는 설비 또는 장치의 비정상 작동 리뷰잉 시스템."}
{"patent_id": "10-2022-0076065", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 검사 대상은 정해진 이동 라인을 따라 이동되는 제품이 되는 것을 특징으로 하는 설비 또는장치의 비정상 작동 리뷰잉 시스템."}
{"patent_id": "10-2022-0076065", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 설비 또는 장치의 비정상 작동 리뷰잉 시스템에 관한 것이다. 설비 또는 장치의 비정상 작동의 리뷰잉 시스템은 장치 또는 설비의 내부 또는 외부의 미리 결정된 감시 영역 또는 감시 대상에 대한 연속적인 영상 이미 지를 획득하는 영상 획득 모듈; 획득된 영상 이미지로부터 비정상 상태를 탐지하는 이상 상태 탐지 모듈 ; 이상 상태 탐지 모듈에 의하여 탐지된 이미지를 분리하고, 디지털 이미지로 변환시키는 이미지 분리/ 변환 모듈; 변환된 이미지를 분리하여 탐지 정보를 표시하는 이상 상태 표시 모듈; 및 표시된 이미지를 리뷰잉을 하여 분석하고, 저장하는 분석/저장 모듈을 포함한다."}
{"patent_id": "10-2022-0076065", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 설비 또는 장치의 비정상 작동 리뷰잉 시스템에 관한 것이고, 구체적으로 IP(Internet Protocol) 카 메라와 같은 이미지 획득 수단에 의하여 획득된 연속 영상 이미지를 분석하여 설비 또는 장치에서 발생될 수 있 는 비정상적인 작동 상태를 리뷰잉을 하는 설비 또는 장치의 비정상 작동 리뷰잉 시스템에 관한 것이다."}
{"patent_id": "10-2022-0076065", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다양한 기계적 또는 전기적 부품으로 이루어진 기계 장치, 검사 장치 또는 이와 유사한 설비는 정해진 방법에 따라 작동될 수 있다. 그리고 이와 같은 장치 또는 설비가 고장이 나는 경우 그에 따른 조치가 취해지고 이후 장치 또는 설비는 정상적으로 작동될 수 있다. 장치 또는 설비의 오류 또는 오작동은 다양한 형태로 나타날 수 있다. 예를 들어 오류 또는 오작동이 간헐적으로 발생하면서 장치 또는 설비가 다시 정상 상태로 복원될 수 있 다. 이와 같은 간헐적 또는 비주기적 형태의 오류 또는 오작동은 장치 또는 설비의 작동 상태를 계속적으로 감 시하지 않으면 발견되기 어렵다. 그러므로 장치 또는 설비의 지속적인 감시를 위한 수단이 만들어질 필요가 있 다. 장치 또는 설비의 작동 상태의 감시를 위한 선행 기술로 특허등록번호 10-1464344는 감시 영상의 정상 상태 학습을 통한 비정상 상태 감지 방법과 이를 적용한 감시 카메라 및 영상 관리 방법에 대하여 개시한다. 특허공 개번호 10-2017-0010730는 가스 터빈 엔진과 같은 발전 기계류의 비 파괴적인 시각 검사 방법에 대하여 개시한 다. 기계 장치, 검사 장치 또는 이와 유사한 장치 또는 설비에서 간헐적으로 발생되는 비정상 상태는 일반적으로 발견되기 어렵고, 짧은 시간 동안 발생되므로 실질적으로 발생되었는지 여부가 명확하지 않을 수 있다. 그러 나 이와 같은 오류가 지속되는 경우 또는 이와 같은 오작동 상태에서 공정이 진행되거나, 검사가 진행되는 경우 불량 제품이 생산되거나, 검사 오류를 발생시키거나 또는 공정 오류를 발생시킬 수 있다. 그러므로 이와 같은 간헐적 또는 주기적인 아닌 형태의 비정상적인 상태가 감시되고 그에 따른 적절한 조치가 취해질 필요가 있다. 그러나 선행 기술은 이와 같은 시스템 및 방법에 대하여 개시하지 않는다. 본 발명은 선행 기술의 문제점을 해결하기 위한 것으로 아래와 같은 목적을 가진다. 선행기술문헌 특허문헌 (특허문헌 0001) 선행기술 1: 특허등록번호101464344(㈜그린아이티코리아, 2017.11.25 공고) 감시 영상의 정상 상태 학습을 통한 이상 상태 감지 방법과 이를 적용한 감시 카메라 및 영상 관리 시스템 (특허문헌 0002) 선행기술 2: 특허공개번호 10-2017-0010730(지멘스 에너지, 인코포레이티드, 2017.02.01. 공 개) 구형 카메라를 갖춘 단축 검사 스코프 및 발전 기계류의 내부 검사 방법"}
{"patent_id": "10-2022-0076065", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 장치 또는 설비의 작동 부분에 대한 연속적인 영상 이미지를 획득하면서 장치 또는 설비에서 발생되는 다양한 형태의 비정상적인 상태를 탐지하여 관련 이미지를 분리하고, 분리된 관련 이미지의 리뷰잉 및 분석이 가능한 설비 또는 장치의 비정상 작동 리뷰잉 시스템을 제공하는 것이다."}
{"patent_id": "10-2022-0076065", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 적절한 실시 형태에 따르면, 설비 또는 장치의 비정상 작동의 리뷰잉 시스템은 장치 또는 설비의 내 부 또는 외부의 미리 결정된 감시 영역 또는 감시 대상에 대한 연속적인 영상 이미지를 획득하는 영상 획득 모 듈; 획득된 영상 이미지로부터 비정상 상태를 탐지하는 이상 상태 탐지 모듈; 이상 상태 탐지 모듈에 의하여 탐 지된 이미지를 분리하고, 디지털 이미지로 변환시키는 이미지 분리/변환 모듈; 변환된 이미지에 탐지 정보를 표 시하는 이상 상태 표시 모듈; 및 표시된 이미지를 확인하여 분석하고, 저장하는 분석/저장 모듈을 포함한다. 본 발명의 다른 적절한 실시 형태에 따르면, 영상 획득 모듈은 IP 카메라를 포함한다. 본 발명의 또 다른 적절한 실시 형태에 따르면, 분리/표시 모듈에 의하여 분리된 이미지를 외부 컴퓨터로 전송 하는 외부 컴퓨터 전송 모듈을 더 포함한다. 본 발명의 또 다른 적절한 실시 형태에 따르면, 감시 영역은 제품이 투입되는 투입 영역, 제품이 검사되는 검사 영역 또는 제품이 배출되는 배출 영역이 된다. 본 발명의 또 다른 적절한 실시 형태에 따르면, 검사 대상은 정해진 이동 라인을 따라 이동되는 제품이 된다. 본 발명의 또 다른 적절한 실시 형태에 따르면, 비정상 상태는 간헐적으로 또는 비주기적으로 발생되는 오작동 또는 오류 상태가 된다."}
{"patent_id": "10-2022-0076065", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 설비 또는 장치의 비정상 작동의 리뷰잉 시스템은 기계 또는 설비의 작동 과정에서 간헐적으로 발생되는 비정상적인 작동 상태의 탐지가 가능하도록 한다. 본 발명에 따른 리뷰잉 시스템은 예를 들어 매우 짧 은 시간 동안 또는 순간적으로 비정상적으로 작동된 이후 다시 원래의 작동 상태가 되는 희귀 형태의 비정상 작 동 상태의 탐지가 가능하도록 한다. 본 발명에 따른 시스템은 기계 장치 또는 설비, 전기 장치 또는 설비, 검사 장치 또는 설비와 같이 계속적으로 작동 상태가 유지되는 다양한 장치 또는 설비에 적용될 수 있다. 예를 들어 본 발명에 따른 시스템은 엑스레이 검사 장치에 적용되어 검사 투입 과정, 검사 과정 또는 배출 과정에서 발생 되는 검사 대상의 유동 오류의 탐지가 가능하도록 한다. 또한 본 발명에 따른 시스템은 기계 장치 또는 설비의 내부에서 발생되는 비정상 상태의 탐지가 가능하도록 한다."}
{"patent_id": "10-2022-0076065", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서 본 발명은 첨부된 도면에 제시된 실시 예를 참조하여 설명이 되지만 실시 예는 본 발명의 명확한 이해 를 위한 것으로 본 발명은 이에 제한되지 않는다. 아래의 설명에서 서로 다른 도면에서 동일한 도면 부호를 가 지는 구성 요소는 유사한 기능을 가지므로 발명의 이해를 위하여 필요하지 않는다면 반복하여 설명이 되지 않으 며 공지의 구성요소는 간략하게 설명이 되거나 생략이 되지만 본 발명의 실시 예에서 제외되는 것으로 이해되지 않아야 한다. 도 1은 본 발명에 따른 설비 또는 장치의 비정상 작동의 리뷰잉 시스템의 실시 예를 도시한 것이다. 도 1을 참조하면, 설비 또는 장치의 비정상 작동의 리뷰잉 시스템은 장치 또는 설비의 내부 또는 외부의 미리 결정된 감시 영역 또는 감시 대상에 대한 연속적인 영상 이미지를 획득하는 영상 획득 모듈; 획득된 영상 이미지로부터 비정상 상태를 탐지하는 이상 상태 탐지 모듈; 이상 상태 탐지 모듈에 의하여 탐지된 이 미지를 분리하고, 디지털 이미지로 변환시키는 이미지 분리/변환 모듈; 변환된 이미지에 탐지 정보를 표시 하는 이상 상태 표시 모듈; 및 표시된 이미지를 확인하여 분석하고, 저장하는 분석/저장 모듈을 포함한 다. 영상 획득 모듈은 미리 결정된 감시 영역에 설치될 수 있고, 감시 영역은 장치 또는 설비의 작동 부분의 일 부가 될 수 있다. 예를 들어 장치 또는 설비는 연속적으로 이동되는 다수 개의 검사 대상을 검사하는 엑스레이 검사 장치가 될 수 있다. 그리고 엑스레이 검사 장치에서 검사 대상이 투입되는 투입 영역, 검사 대상이 검사되 는 검사 영역 또는 검사 대상이 배출되는 배출 영역이 감시 영역으로 설정될 수 있다. 감시 영역에서 감시 대상 이 결정될 수 있고, 감시 대상은 장치 또는 설비의 일부 또는 검사 대상이 될 수 있다. 감시 영역에서 감시 대 상이 결정되면, 감시 조건이 설정될 수 있다. 감시 조건은 초점 위치, 감시 경계 영역, 밝기 또는 이와 유사한 이미지 획득 조건을 포함할 수 있다. 감시 영역 및 감시 조건이 결정되면 장치 또는 설비의 연속적인 감시를 위 하여 적어도 하나의 영상 획득 모듈이 설치될 수 있다. 영상 획득 모듈은 예를 들어 IP(Internet Protocol) 카메라와 같은 카메라가 될 수 있다. 영상 획득 모듈에 의하여 연속적으로 이미지가 획득될 수 있고, 획득된 이미지로부터 이상 상태 탐지 모듈에 의하여 이상 상태가 탐지될 수 있다. 이상 상태 탐지 모 듈은 영상 획득 모듈에 의하여 획득된 이미지로부터 이상 상태의 발생을 탐지하는 기능을 가질 수 있다. 예를 들어 이상 상태 탐지 모듈은 기준 이미지를 포함할 수 있고, 기준 이미지를 영상획득 모듈 에 의하여 획득된 이미지와 대비하여 이상 상태 또는 비정상 상태의 발생 여부를 판단하는 기능을 가질 수 있다. 또는 이상 상태 탐지 모듈은 획득된 영상 이미지로부터 비정상 상태에 해당하는 부분을 탐지하는 기 능을 가질 수 있다. 이상 상태 탐지 모듈은 실시간으로 획득된 이미지로부터 비정상 상태에 해당되는 부분 을 탐지할 수 있고, 다양한 방법으로 비정상 상태에 해당하는 부분을 결정할 수 있다. 예를 들어 이상 상태의 탐지는 소프트 프로그램에 의하여 진행될 수 있고, 인공지능 학습 알고리즘 방식이 비정상 상태의 탐지에 적용 될 수 있다. 이상 상태 탐지 모듈에 의하여 이상 상태에 있는 것으로 판단되면 이미지 분리/변환 모듈 에 의하여 해당 부분의 이미지가 분리될 수 있고, 분리된 이미지가 디지털 이미지로 변환될 수 있다. 이미지의 분리는 캡쳐 방식이 되거나, 표지 방식이 될 수 있다. 캡처 방식에 의하여 이상 상태가 발생되면 해당 이미지가 캡처되고, 캡처 이미지에 대하여 이상 상태 발생 위치를 기준으로 경계 영역이 형성될 수 있다. 그리고 경계 영 역의 외부가 음영 처리가 되어 분리 이미지가 만들질 수 잇다. 표지 방식에 의하여 이상 상태가 발생된 위치가 다양한 방법으로 표지가 될 수 있고, 표지가 된 부분이 변환되어 처리될 수 있다. 이미지의 분리는 다양한 방법 으로 이루어질 수 있고 이에 의하여 본 발명은 제한되지 않는다. 디지털 이미지로 변환된 분리된 이미지는 이상 상태 표시 모듈에 의하여 감시 정보와 결합될 수 있다. 감시 정보는 이상 상태의 종류, 발생 시각, 발생 위 치 또는 이와 유사한 정보를 포함할 수 있다. 분리된 이미지에 대한 감시 정보의 표시는 다양한 방법으로 이루 어질 수 있고, 이에 의하여 본 발명은 제한되지 않는다. 이와 같은 방법으로 분리 이미지에 이상 상태 관련 정 보 또는 감시 정보가 표시되면 분석/저장 모듈로 전송될 수 있고, 분석/저장 모듈은 예를 들어 퍼스널컴퓨터가 될 수 있다. 이상 상태 표시 모듈은 예를 들어 와이-파이 통신, 블루투스 통신 또는 이와 유사한 근거리 통신 수단을 통하여 분석/저장 모듈과 데이터 통신이 가능하다. 이상 상태 표시 모듈은 표시가 된 분리 이미지를 근거리 무선 통신을 통하여 분석/저장 모듈로 전송할 수 있다. 분석/저장 모듈은 전 송된 이미지를 확인 및 분석하여 이상 상태를 확인할 수 있다. 그리고 전송된 이미지, 관련 정보 및 분석 결과 가 저장될 수 있다. 분석/저장 모듈은 영상 획득 모듈, 이상 상태 탐지 모듈, 이미지 분리/변환 모 듈 및 이상 상태 표시 모듈과 분리되어 위치할 수 있고, 다양한 종류의 데이터 분석이 가능한 전자기기 가 될 수 있고 이에 의하여 본 발명은 제한되지 않는다. 도 2는 본 발명에 따른 시스템에 적용되는 IP 카메라 모듈의 실시 예를 도시한 것이다. 도 2를 참조하면, IP 카메라 모듈은 카메라 몸체; 카메라 몸체의 앞쪽에 형성된 렌즈 유닛; 렌즈 유닛의 둘레를 따라 배치된 다수 개의 조명 소자(23_1 내지 23_N); 및 커버(C)를 포함할 수 있다. 카메라 몸체의 내부에 이미지 생성을 위한 다양한 부품 또는 소자가 배치될 수 있고, 렌즈 유닛을 통하여 유입 된 광에 의하여 이미지가 획득될 수 있다. IP 카메라 모듈은 장치 또는 설비의 내부에 배치될 수 있고, 이로 인 하여 이미지의 획득에 필요한 밝기가 확보되지 못할 수 있다. 이미지 획득을 위한 적절한 조명 환경의 형성을 위하여 렌즈 유닛의 둘레에 적어도 하나의 조명 소자(23_1 내지 23_N)가 배치될 수 있다. 조명 소자(23_1 내지 23_N)의 발광 수준이 조절될 수 있고, 적절한 조명 환경의 형성을 위하여 조도 센서가 설치될 수 있다. 카메라 몸체의 내부에 제어 수단이 배치될 수 있고, 제어 수단은 조도 센서로부터 획득된 정보에 기초하여 조명 소자(23_1 내지 23_N)의 발광 수준을 조절할 수 있다. 카메라 몸체의 앞쪽 면 또는 다른 적 절한 위치에 환경 센서 모듈이 설치될 수 있고, 환경 센서 모듈에 의하여 감시 영역의 온도, 습도 또는 이와 유사한 환경 상태가 측정될 수 있다. 커버(C)에 의하여 카메라 몸체가 보호될 수 있고, IP 카메라 모 듈에 근거리 통신 수단이 설치될 수 있다. IP 카메라 모듈은 고정 지그에 결합되어 감시 영역의 감시를 위하여 설치될 수 있다. 고정 지그는 연장 암; 연장 암의 한쪽 끝에 형성된 체결 블록; 및 연장 암의 다른 끝에 형성된 고정 브래킷으로 이루어질 수 있다. 고정 브래킷은 장치, 설비 또는 구조물에 고정될 수 있는 구조를 가질 수 있고, 연장 암은 IP 카메라 모듈의 초점이 감시 영역에 형성될 수 있도록 연장될 수 있다. 선택적으로 연장 암은 길이 조절이 가능한 구조가 될 수 있다. 체결 블록에 카메라 몸체 가 결합될 수 있고, 체결 블록에 예를 들어 플러스 형상의 고정 홀이 형성될 수 있다. 카메라 몸체 의 아래쪽에 고정 홀에 삽입되어 고정되는 체결 날개가 형성될 수 있다. 카메라 몸체는 볼트, 나 사 또는 핀과 같은 고정 수단에 의하여 체결 블록에 고정될 수 있다. 다양한 원인으로 인하여 시간의 경과에 따라 IP 카메라 모듈의 초점 위치가 변할 수 있다. 이로 인하여 정해진 감시 영역에 대한 이미지가 획득 되지 않을 수 있다. 이와 같은 감시 영역의 변화를 탐지하기 위하여 렌즈 유닛의 양쪽에 위치 결정 유닛 (26a, 26b)이 설치될 수 있다. 위치 결정 유닛(26a, 26b)은 카메라의 초점이 정해진 위치에 있는지 여부를 감시 하는 기능을 가질 수 있다. 위치 결정 유닛(26a, 26b)은 예를 들어 가속도 센서, 자이로 센서 또는 광학 센서가 될 수 있다. 위치 결정 유닛(26a, 26b)의 탐지에 의하여 카메라의 초점이 미리 결정된 범위를 벗어난 것으로 판 단되면, 자동으로 초점이 맞추어지거나, 초점 위치의 변화가 관리 모듈로 전송될 수 있다. 카메라 초점의 위치 변화는 다양한 방법으로 탐지될 수 있고 제시된 실시 예에 제한되지 않는다. 또한 고정 지그는 다양한 구조를 가질 수 있고, 예를 들어 카메라 몸체의 경사 조절이 가능한 구조가 될 수 있다. IP 카메라 모듈은 다양한 구조를 가지는 고정 지그에 결합되어 고정될 수 있고 제시된 실시 예에 제한되지 않는다. 도 3은 본 발명에 따른 시스템의 작동 구조의 실시 예를 도시한 것이다. 도 3을 참조하면, IP 카메라에 의하여 감시 영역에 대한 감시 이미지가 획득될 수 있고, 감시 조건이 미리 설정될 수 있다. IP 카메라에 의하여 획득된 이미지가 이미지 리뷰 모듈에 의하여 리뷰가 될 수 있다. 이미지 리뷰 모듈에 의한 리뷰 과정에서 비정상 상태의 이미지가 탐색되면, 해당 이미지가 비정상 이미지 선별 모듈에 의하여 선별될 수 있다. 구체적으로 비정상 상태에 해당하는 이미지에 대하여 비정상 표지가 부여될 수 있다. 비정상 표지가 된 이미지는 데이터 분리/변환 모듈에 의하여 분리되어 디지털 이미지로 변 환될 수 있다. 이후 정보 결합 모듈에 의하여 분리된 디지털 이미지에 감시 정보가 결합될 수 있다. 감시 정보는 예를 들어 이미지 획득 시각, 온도, 습도, 이상 상태의 종류, 이미지 획득 위치 또는 이와 유사한 정보 를 포함할 수 있다. 이와 같이 정보가 결합된 이미지 데이터가 근거리 통신 수단을 통하여 외부 PC 전송 모듈 에 의하여 외부에 설치된 개인용 컴퓨터로 전송될 수 있다. 외부 PC에 분석/저장 모듈이 설치될 수 있 고, 분석/저장 모듈에 의하여 전송된 디지털 데이터가 분석되어 저장될 수 있다. 그리고 분석 결과에 따라 장치 또는 설비에 적절한 조치가 취해질 수 있다.도 4는 본 발명에 따른 장치 또는 설비의 비정상 작동 리뷰잉 방법의 실시 예를 도시한 것이다. 도 4를 참조하면, 장치 또는 설비의 비정상 작동 리뷰잉 방법은 투입, 검사 및 배출 부위의 각각에 적어도 하나 의 IP 카메라가 설치되는 단계(P41); 설치된 IP 카메라로부터 연속적으로 그리고 실시간으로 이미지가 획득되어 리뷰가 되는 단계(P42); 이상 상태의 발생 여부가 확인되는 단계(P43); 이상 상태에 대한 이미지가 분리되어 디 지털 이미지로 변환되는 단계(P44); 변환된 이미지가 외부 컴퓨터로 무선 통신을 통하여 전송되는 단계(P45); 및 외부 컴퓨터에서 이미지가 확인되어 분석되는 단계(P46)를 포함한다. 설비 또는 장치는 다양한 종류의 검사 장치가 될 수 있고, 예를 들어 전자 제품, 배터리, 식품 또는 이와 유사 한 제품을 인-라인 방식으로 연속적으로 검사하는 엑스레이 검사 장치가 될 수 있다. 엑스레이 검사 장치는 제 품이 연속적으로 이송되어 공급되는 투입 영역; 밀폐된 구조를 가지는 검사 영역; 및 검사가 완료된 제품이 배 출되는 배출 영역으로 이루어질 수 있다. 각각의 영역에 적어도 하나의 IP 카메라가 설치될 수 있고(P41), 연속 적으로 그리고 실시간으로 감시 이미지가 획득될 수 있다. 각각의 연속 이미지가 리뷰가 될 수 있고(P42), 리뷰 결과에 따라 이상 상태 발생 여부가 판단될 수 있다(P43). 만약 이상 상태가 발생되지 않은 상태라면(N), 이미 지 리뷰가 계속하여 진행될 수 있다(P42). 이에 비하여 이상 상태가 발생된 것으로 판단되면(Y), 관련 이미지가 분리될 수 있고, 디지털 이미지로 변환될 수 있다(P44). 이와 함께 위에서 설명된 것처럼, 디지털 이미지에 감 시 정보가 결합될 수 있다. 변환된 이미지가 근거리 통신 수단을 통하여 외부 컴퓨터로 전송될 수 있고(P45), 외부 컴퓨터에서 이미지가 리뷰가 되어 이상 상태의 발생 여부가 확인될 수 있다. 또한 이상 상태의 종류 또는 발생 원인이 분석될 수 있다(P46). 그리고 확인 결과 및 분석 결과가 저장될 수 있다(P47). 탐색 대상이 되는 이상 상태 또는 비정상 상태는 주로 간헐적으로 또는 비주기적으로 발생될 수 있다. 이상 상 태는 다양한 종류의 오류 또는 오작동을 포함하고, 장치 또는 설비 자체에서 발생되거나, 검사 대상에서 발생될 수 있다. 이와 같이 탐색 대상이 되는 비정상 상태는 장치 또는 설비의 작동 과정에서 발생되는 다양한 형태의 오류 또는 오작동을 포함하고 이에 의하여 본 발명은 제한되지 않는다. 위에서 본 발명은 제시된 예를 참조하여 상사하게 설명이 되었지만 이 분야에서 통상의 지식을 가진 자는 제시 된 실기 예를 참조하여 본 발명의 기술적 사상을 벗어나지 않는 범위에서 다양한 변형 및 수정 발명을 만들 수 있다. 본 발명은 이와 같은 변형 및 수정 발명에 의하여 제한되지 않으며 다만 아래에 첨부된 청구범위에 의하 여 제한된다."}
{"patent_id": "10-2022-0076065", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 설비 또는 장치의 비정상 작동의 리뷰잉 시스템의 실시 예를 도시한 것이다. 도 2는 본 발명에 따른 시스템에 적용되는 IP 카메라 모듈의 실시 예를 도시한 것이다. 도 3은 본 발명에 따른 시스템의 작동 구조의 실시 예를 도시한 것이다. 도 4는 본 발명에 따른 설비 또는 장치의 비정상 작동 리뷰잉 방법의 실시 예를 도시한 것이다."}
