{"patent_id": "10-2022-0022381", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0125596", "출원번호": "10-2022-0022381", "발명의 명칭": "AI 기반 손가락 추적 기능 탑재 AR 안경을 이용한 항만 물류 관리 시스템 제공 방법 및 이를", "출원인": "주식회사 제이엔이웍스", "발명자": "홍의석"}}
{"patent_id": "10-2022-0022381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 지능 기반 손가락 추적 기술이 탑재된 AR (augmented reality) 안경 장치를 이용한, 항만 물류 관리 시스템으로서,디스플레이부 및 영상촬영부를 포함하고, 작업자가 착용 가능하도록 안경 형태로 형성되며, 컨테이너에 부착된 인식 번호를 상기 영상촬영부를 이용하여 스캔하여 코드 데이터를 획득하고, 상기 코드 데이터에 대응하는정보 데이터를 상기 디스플레이부에 출력하는 AR 안경 장치; 및상기 코드 데이터 및 상기 코드 데이터에 대응되는 정보 데이터를 저장하고, 상기 AR 안경 장치로부터 상기 코드 데이터에 대응되는 정보 데이터가 조회 요청되면, 상기 정보 데이터를 상기 AR 안경 장치로 송신하는 항만관리 서버를 포함하고,상기 AR 안경 장치는,상기 영상촬영부를 이용하여 상기 작업자의 손가락 위치 및 동작을 촬영하고, 상기 촬영된 영상을 처리하여 사용자 상호 작용 입력 신호로 변환하며,상기 AR 안경 장치는,상기 사용자 상호 작용 입력 신호를 딥러닝 학습 데이터로서 상기 항만 관리 서버로 전송하는 것을 특징으로 하는,항만 물류 관리 시스템."}
{"patent_id": "10-2022-0022381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 항만 관리 서버는,상기 사용자 상호 작용 입력 신호를 학습 데이터로 딥러닝을 수행하고, 상기 딥러닝의 결과에 기반하여 상기 하나 이상의 정보 데이터를 상기 AR 안경 장치로 제공하는 것을 특징으로 하는,항만 물류 관리 시스템."}
{"patent_id": "10-2022-0022381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 AR 안경 장치는,상기 사용자 상호 작용 입력을 위한 하나 이상의 정보 데이터를 상기 디스플레이부에 출력하고, 상기 작업자의 손가락 위치 및 동작에 기반하여 상기 하나 이상의 정보 데이터 중 적어도 하나를 선택하는 상기사용자 상호 작용 입력 신호를 생성하는 것을 특징으로 하는,항만 물류 관리 시스템."}
{"patent_id": "10-2022-0022381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 하나 이상의 정보 데이터 및 상기 사용자 상호 작용 입력 신호는 3차원 좌표 정보로 표현되는 것을 특징으로 하는, 항만 물류 관리 시스템.공개특허 10-2023-0125596-3-청구항 5 제1항에 있어서,상기 AR 안경 장치는,상기 항만 관리 서버와 신호를 송수신하기 위한 무선 통신부를 더 포함하는 것을 특징으로 하는,항만 물류 관리 시스템."}
{"patent_id": "10-2022-0022381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "작업자가 착용 가능하도록 안경 형태로 형성되고 인공 지능 기반 손가락 추적 기술이 탑재된 AR (augmentedreality) 안경 장치로서,디스플레이부; 영상촬영부; 및프로세서를 포함하고,상기 프로세서는 컨테이너에 부착된 인식 번호를 상기 영상촬영부를 이용하여 스캔하여 코드 데이터를획득하고, 상기 코드 데이터에 대응하는 정보 데이터를 상기 디스플레이부에 출력하며, 상기 AR 안경 장치는,상기 영상촬영부를 이용하여 상기 작업자의 손가락 위치 및 동작을 촬영하고, 상기 촬영된 영상을 처리하여 사용자 상호 작용 입력 신호로 변환하며,상기 AR 안경 장치는,상기 사용자 상호 작용 입력 신호를 딥러닝 학습 데이터로서 항만 관리 서버로 전송하는 것을 특징으로 하는,AR 안경 장치."}
{"patent_id": "10-2022-0022381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 항만 관리 서버는,상기 사용자 상호 작용 입력 신호를 학습 데이터로 딥러닝을 수행하고, 상기 딥러닝의 결과에 기반하여 상기 하나 이상의 정보 데이터를 상기 AR 안경 장치로 제공하는 것을 특징으로 하는,AR 안경 장치."}
{"patent_id": "10-2022-0022381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 AR 안경 장치는,상기 사용자 상호 작용 입력을 위한 하나 이상의 정보 데이터를 상기 디스플레이부에 출력하고, 상기 작업자의 손가락 위치 및 동작에 기반하여 상기 하나 이상의 정보 데이터 중 적어도 하나를 선택하는 상기사용자 상호 작용 입력 신호를 생성하는 것을 특징으로 하는,AR 안경 장치."}
{"patent_id": "10-2022-0022381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 하나 이상의 정보 데이터 및 상기 사용자 상호 작용 입력 신호는 3차원 좌표 정보로 표현되는 것을 특징으로 하는, 공개특허 10-2023-0125596-4-AR 안경 장치."}
{"patent_id": "10-2022-0022381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 AR 안경 장치는,상기 항만 관리 서버와 신호를 송수신하기 위한 무선 통신부를 더 포함하는 것을 특징으로 하는,AR 안경 장치."}
{"patent_id": "10-2022-0022381", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공 지능 기반 손가락 추적 기술이 탑재된 증강 현실 (augmented reality, AR) 안경 장치를 이용한, 항만 물류 관리 시스템에 관한 것으로, 디스플레이부 및 영상촬영부를 포함하고, 작업자가 착용 가능하도록 안 경 형태로 형성되며, 컨테이너에 부착된 인식 번호를 상기 영상촬영부를 이용하여 스캔하여 코드 데이터를 획득 하고, 상기 코드 데이터에 대응하는 정보 데이터를 상기 디스플레이부에 출력하는 AR 안경 장치; 및 상기 코드 데이터 및 상기 코드 데이터에 대응되는 정보 데이터를 저장하고, 상기 AR 안경 장치로부터 상기 코드 데이터에 대응되는 정보 데이터가 조회 요청되면, 상기 정보 데이터를 상기 AR 안경 장치로 송신하는 항만 관리 서버를 포 함한다."}
{"patent_id": "10-2022-0022381", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 AR 안경을 이용한 항만 물류 관리 시스템 제공에 관한 것으로서, 상세하게 AI 기반 손가락 추적 기능 탑재 AR 안경을 이용한 항만 물류 관리 시스템 제공 방법 및 이를 위한 장치에 관한 것이다."}
{"patent_id": "10-2022-0022381", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 코로나 19와 같은 전세계적 재난으로 인하여 비대면 온라인 쇼핑과 해외 직구의 증가로 인해 배송량이 크 게 늘어나고 있으며, 특히, 작업자 육안 분류에 의존하는 기존 항만 물류 관리의 분류 시스템은 비약적으로 증 가하는 물량을 점점 감당하기 어려운 상황에 이르고 있다. 구체적으로, 최근 물동량이 기하급수적으로 불어나 28년 만에 물동량이 3,400% 폭증하였으며, 인력부족 문제와 잦은 파업 등으로 물류대란이 상시적으로 발생하고 있으며 이는 기업의 생산성과 납기 준수 등에도 악영향을 끼 쳐 막대한 사회적 손실을 초래하고 있다. 특히, 비대면 관리를 요구하는 재난 상황에서 업무 특성에 맞게 개발된 효율적인 항만 물류 관리 시스템 운영과 작업자가 신속하게 항만 컨테이너를 관리하기 위한 비전 피킹 (Vision Picking) 콘텐츠를 개발하여 물류 통합 관리 현장에서 기업의 물류관리능력, 운영능력을 최적화 시킴으로써 경영자원의 유용한 활용과 고객서비스 향상 을 위한 솔루션이 필요하다."}
{"patent_id": "10-2022-0022381", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 AI 기반 손가락 추적 기능 탑재 AR 안경을 이용한 항만 물류 관리 시스템 제공 방법 및 이를 위한 장치를 제공하는 것이다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재들로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0022381", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 양상인 인공 지능 기반 손가락 추적 기술이 탑재된 증강 현실 (augmented reality, AR) 안경 장치 를 이용한, 항만 물류 관리 시스템은, 디스플레이부 및 영상촬영부를 포함하고, 작업자가 착용 가능하도록 안경 형태로 형성되며, 컨테이너에 부착 된 인식 번호를 상기 영상촬영부를 이용하여 스캔하여 코드 데이터를 획득하고, 상기 코드 데이터에 대응하는 정보 데이터를 상기 디스플레이부에 출력하는 AR 안경 장치; 및 상기 코드 데이터 및 상기 코드 데이터에 대응 되는 정보 데이터를 저장하고, 상기 AR 안경 장치로부터 상기 코드 데이터에 대응되는 정보 데이터가 조회 요청 되면, 상기 정보 데이터를 상기 AR 안경 장치로 송신하는 항만 관리 서버를 포함하고, 상기 AR 안경 장치는, 상기 영상촬영부를 이용하여 상기 작업자의 손가락 위치 및 동작을 촬영하고, 상기 촬영 된 영상을 처리하여 사용자 상호 작용 입력 신호로 변환하며, 상기 사용자 상호 작용 입력 신호를 딥러닝 학습 데이터로서 상기 항만 관리 서버로 전송하는 것을 특징으로 한다. 바람직하게는, 상기 항만 관리 서버는, 상기 사용자 상호 작용 입력 신호를 학습 데이터로 딥러닝을 수행하고, 상기 딥러닝의 결과에 기반하여 상기 하나 이상의 정보 데이터를 상기 AR 안경 장치로 제공하는 것을 특징으로 한다. 바람직하게는, 상기 AR 안경 장치는, 상기 사용자 상호 작용 입력을 위한 하나 이상의 정보 데이터를 상기 디스 플레이부에 출력하고, 상기 작업자의 손가락 위치 및 동작에 기반하여 상기 하나 이상의 정보 데이터 중 적어도 하나를 선택하는 상기 사용자 상호 작용 입력 신호를 생성하는 것을 특징으로 한다. 특히, 상기 하나 이상의 정 보 데이터 및 상기 사용자 상호 작용 입력 신호는 3차원 좌표 정보로 표현되는 것을 특징으로 한다. 나아가, 상기 AR 안경 장치는, 상기 항만 관리 서버와 신호를 송수신하기 위한 무선 통신부를 더 포함한다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확 하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0022381", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 AI 기반 손가락 추적 기능 탑재 AR 안경을 이용한 항만 물류 관리 시스템 제공 방법 및 이를 위한 장 치를 제공하는 장점이 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2022-0022381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시 예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시 예를 설명함에 있어, 관련된 공지 구성 또는 기능 에 대한 구체적인 설명이 본 발명의 실시 예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생 략한다. 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있 다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 또한, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어 를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일 반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의 하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 개시의 다양한 예에서, “/” 및 “,”는 “및/또는”을 나타내는 것으로 해석되어야 한다. 예를 들어, “ A/B”는 “A 및/또는 B”를 의미할 수 있다. 나아가, “A, B”는 “A 및/또는 B”를 의미할 수 있다. 나아가, “A/B/C”는 “A, B 및/또는 C 중 적어도 어느 하나”를 의미할 수 있다. 나아가, “A, B, C”는 “A, B 및/또 는 C 중 적어도 어느 하나”를 의미할 수 있다. 본 개시의 다양한 예에서, “또는”은 “및/또는”을 나타내는 것으로 해석되어야 한다. 예를 들어, “A 또는 B ”는 “오직 A”, “오직 B”, 및/또는 “A 및 B 모두”를 포함할 수 있다. 다시 말해, “또는”은 “부가적으 로 또는 대안적으로”를 나타내는 것으로 해석되어야 한다. 본 발명을 설명하기에 앞서, 본 발명이 적용될 수 있는 통신 분야인 5G에 관하여 설명한다. 5G의 세 가지 주요 요구 사항 영역은 개선된 모바일 광대역 (Enhanced Mobile Broadband, eMBB) 영역, 다량의 머신 타입 통신 (massive Machine Type Communication, mMTC) 영역 및 초-신뢰 및 저 지연 통신 (Ultra-reliable and Low Latency Communications, URLLC) 영역을 포함한다. 5G는 초당 수백 메가 비트에서 초당 기가 비트로 평가되는 스트림을 제공하는 수단으로 FTTH (fiber-to-the- home) 및 케이블 기반 광대역 (또는 DOCSIS)을 보완할 수 있다. 이러한 빠른 속도는 가상 현실과 증강 현실뿐 아니라 4K 이상(6K, 8K 및 그 이상)의 해상도로 TV를 전달하는데 요구된다. VR(Virtual Reality) 및 AR(Augmented Reality) 애플리케이션들은 거의 몰입형(immersive) 스포츠 경기를 포함한다. 특정 응용 프로그램 은 특별한 네트워크 설정이 요구될 수 있다. 예를 들어, VR 게임의 경우, 게임 회사들이 지연을 최소화하기 위 해 코어 서버를 네트워크 오퍼레이터의 에지 네트워크 서버와 통합해야 할 수 있다. 스마트 사회(smart society)로서 언급되는 스마트 도시와 스마트 홈은 고밀도 무선 센서 네트워크로 임베디드될 것이다. 지능형 센서의 분산 네트워크는 도시 또는 집의 비용 및 에너지-효율적인 유지에 대한 조건을 식별할 것이다. 유사한 설정이 각 가정을 위해 수행될 수 있다. 온도 센서, 창 및 난방 컨트롤러, 도난 경보기 및 가전 제품들은 모두 무선으로 연결된다. 이러한 센서들 중 많은 것들이 전형적으로 낮은 데이터 전송 속도, 저전력 및 저비용이다. 하지만, 예를 들어, 실시간 HD 비디오는 감시를 위해 특정 타입의 장치에서 요구될 수 있다. 열 또는 가스를 포함한 에너지의 소비 및 분배는 고도로 분산화되고 있어, 분산 센서 네트워크의 자동화된 제어 가 요구된다. 스마트 그리드는 정보를 수집하고 이에 따라 행동하도록 디지털 정보 및 통신 기술을 사용하여 이 런 센서들을 상호 연결한다. 이 정보는 공급 업체와 소비자의 행동을 포함할 수 있으므로, 스마트 그리드가 효 율성, 신뢰성, 경제성, 생산의 지속 가능성 및 자동화된 방식으로 전기와 같은 연료들의 분배를 개선하도록 할 수 있다. 스마트 그리드는 지연이 적은 다른 센서 네트워크로 볼 수도 있다. 미션 크리티컬 애플리케이션(mission critical application)(예, e-건강(e-health))은 5G사용 시나리오들 중 하나이다. 건강 부문은 이동 통신의 혜택을 누릴 수 있는 많은 응용 프로그램을 보유하고 있다. 통신 시스템은 멀리 떨어진 곳에서 임상 진료를 제공하는 원격 진료를 지원할 수 있다. 이는 거리에 대한 장벽을 줄이는데 도 움을 주고, 거리가 먼 농촌에서 지속적으로 이용하지 못하는 의료 서비스들로의 접근을 개선시킬 수 있다. 이는 또한 중요한 진료 및 응급 상황에서 생명을 구하기 위해 사용된다. 이동 통신 기반의 무선 센서 네트워크는 심 박 수 및 혈압과 같은 파라미터들에 대한 원격 모니터링 및 센서들을 제공할 수 있다. 무선 및 모바일 통신은 산업 응용 분야에서 점차 중요해지고 있다. 배선은 설치 및 유지 비용이 높다. 따라서, 케이블을 재구성할 수 있는 무선 링크들로의 교체 가능성은 많은 산업 분야에서 매력적인 기회이다. 그러나, 이 를 달성하는 것은 무선 연결이 케이블과 비슷한 지연, 신뢰성 및 용량으로 동작하는 것과, 그 관리가 단순화될 것이 요구된다. 낮은 지연과 매우 낮은 오류 확률은 5G로 연결될 필요가 있는 새로운 요구 사항이다. 물류(logistics) 및 화물 추적(freight tracking)은 위치 기반 정보 시스템을 사용하여 어디에서든지 인벤토리 (inventory) 및 패키지의 추적을 가능하게 하는 이동 통신에 대한 중요한 사용 예이다. 물류 및 화물 추적의 사 용 예는 전형적으로 낮은 데이터 속도를 요구하지만 넓은 범위와 신뢰성 있는 위치 정보가 필요하다. 도 1을 참조하면, 통신시스템은 무선 기기, 기지국(BS) 및 네트워크를 포함한다. 비록 도 1은 통신시스템의 네 트워크의 일 예로서 5G 네트워크를 도시하고 있지만, 본 명세의 구현들은 5G 시스템에 한정되지 않고, 5G 시스 템을 넘어 차세대 통신시스템에 적용될 수 있다. BS 및 네트워크는 무선 기기로 구현될 수 있고, 특정 무선 기기는 다른 무선 기기들에 대해 BS/네트워크 노드로 동작할 수 있다. 무선 기기는 무선 접속 기술(radon access technology, RAT) (예, 5G NR(new RAT), LTE)을 이용하여 통신을 수 행하는 기기를 의미하며, 통신/무선/5G 기기로 지칭될 수 있다. 이로 제한되는 것은 아니지만, 무선 기기는 로 봇(100a), 차량(100b-1, 100b-2), 확장 현실(extended reality, XR) 기기(100c), 휴대 기기(hand-held device)(100d), 가전(100e), 사물 인터넷(Internet of things, IoT) 기기(100f), 인공 지능(artificial intelligence, AI)기기/서버를 포함할 수 있다. 예를 들어, 차량은 무선 통신 기능이 구비된 차량, 자율 주행 차량, 및 차량간 통신을 수행할 수 있는 차량을 포함할 수 있다. 여기서, 차량은 무인 항공기(unmanned aerial vehicle, UAV)(예, 드론)를 포함할 수 있다. XR 기기는 증강 현실(augmented reality, AR)/가상 현실(virtual reality, VR)/혼합 현실(mixed reality, MR) 기기를 포함할 수 있으며, 헤드 마운트 디스플레이(head-mounted device, HMD), 차량에 구비된 헤드업 디스플레이(head-up display, HUD), 텔레비전, 스마트폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지 (signage), 차량, 로봇 등의 형태로 구현될 수 있다. 휴대 기기는 스마트폰, 스마트패드, 웨어러블 기기(예, 스 마트워치, 스마트글래스), 및 컴퓨터(예, 노트북)를 포함할 수 있다. 가전은 TV, 냉장고, 및 세탁기를 포함할 수 있다. IoT 기기는 센서 및 스마트미터를 포함할 수 있다. 본 명세서에서, 무선 기기(100a~100f)는 UE로 지칭될 수 있다. UE는, 예를 들어, 휴대폰, 스마트 폰, 노트북 컴 퓨터, 디지털 방송용 단말기, 개인 정보 단말기(personal digital assistant, PDA), 휴대용 멀티미디어 플레이 어(portable multimedia player, PMP), 네비게이션, 슬레이트 PC(slate PC), 태블릿 PC, 울트라북, 차량, 자율 주행 기능을 탑재한 차량, 커넥티드카, UAV, AI 모듈, 로봇, AR 기기, VR 기기, MR 기기, 홀로그램 기기, 공공 안전 기기, MTC 기기, IoT 기기, 의료 기기, 핀테크 기기(또는 금융 기기), 보안 기기, 기후/환경 기기, 5G 서 비스와 관련된 기기, 또는 4차 산업 혁명 분야와 관련된 기기를 포함할 수 있다. UAV는, 예를 들어, 사람이 타지 않고 무선 제어 신호에 의해 비행하는 비행체일 수 있다. VR 기기는, 예를 들어, 가상 세계의 객체 또는 배경을 구현하는 기기를 포함할 수 있다. AR 기기는, 예를 들어, 현실 세계의 객 체 또는 배경에 가상 세계의 객체 또는 배경을 연결하여 구현되는 기기를 포함할 수 있다. MR 기기는, 예를 들 어, 현실 세계의 객체 또는 배경에 가상 세계의 객체 또는 배경을 융합하여 구현되는 기기를 포함할 수 있다. 홀로그램 기기는, 예를 들어, 홀로그래피라는 두 개의 레이저 광이 만나서 발생하는 빛의 간섭현상을 활용하여, 입체 정보를 기록 및 재생하여 360도 입체 영상을 구현하는 기기를 포함할 수 있다. 공공 안전 기기는, 예를 들 어, 영상 중계 기기 또는 사용자의 인체에 착용 가능한 영상 기기를 포함할 수 있다. MTC 기기 및 IoT 기기는, 예를 들어, 사람의 직접적인 개입이나 또는 조작이 필요하지 않는 기기들 일 수 있다. 예를 들어, MTC 기기 및 IoT 기기는 스마트 미터, 벤딩 머신, 온도계, 스마트 전구, 도어락 또는 각종 센서를 포함할 수 있다. 의료 기기는, 예를 들어, 질병을 진단, 치료, 경감, 처치 또는 예방할 목적으로 사용되는 기기일 수 있다. 예를 들어, 의료 기기는 상해 또는 장애를 진단, 치료, 경감 또는 교정할 목적으로 사용되는 기기일 수 있다. 예를 들어, 의료 기기는 구조 또는 기능을 검사, 대체 또는 변형할 목적으로 사용되는 기기일 수 있다. 예를 들어, 의료 기기는 임신을 조절할 목적으로 사용되는 기기일 수 있다. 예를 들어, 의료 기기는 진료용 기기, 수술용 기기, (체외) 진단용 기기, 보청기 또는 시술용 기기를 포함할 수 있다. 보안 기기는, 예를 들어, 발생할 우려 가 있는 위험을 방지하고, 안전을 유지하기 위하여 설치한 기기일 수 있다. 예를 들어, 보안 기기는 카메라, CCTV, 녹음기(recorder) 또는 블랙박스일 수 있다. 핀테크 기기는, 예를 들어, 모바일 결제와 같은 금융 서비스 를 제공할 수 있는 기기일 수 있다. 예를 들어, 핀테크 기기는 결제 기기 또는 POS(point of sales)를 포함할 수 있다. 기후/환경 기기는, 예를 들어, 기후/환경을 모니터링 또는 예측하는 기기를 포함할 수 있다. 무선 기기(100a~100f)는 BS을 통해 네트워크와 연결될 수 있다. 무선 기기(100a~100f)에는 AI 기술 이 적용될 수 있으며, 무선 기기(100a~100f)는 네트워크를 통해 AI 서버와 연결될 수 있다. 네트워크 는 3G 네트워크, 4G(예, LTE) 네트워크, 5G(예, NR) 네트워크 및 비욘드(beyond) 5G 네트워크를 이용하여 구성될 수 있다. 무선 기기(100a~100f)는 BS/네트워크를 통해 서로 통신할 수도 있지만, BS/네트워크 를 통하지 않고 직접 통신(e.g. 사이드링크 통신)할 수도 있다. 예를 들어, 차량들(100b-1, 100b-2)은 직접 통 신(e.g. V2V(vehicle-to-vehicle)/V2X(vehicle-to-everything) 통신)을 할 수 있다. 또한, IoT 기기(예, 센 서)는 다른 IoT 기기(예, 센서) 또는 다른 무선 기기(100a~100f)와 직접 통신을 할 수 있다. 무선 기기(100a~100f)/BS-BS 간에는 무선 통신/연결(150a, 150b)이 이뤄질 수 있다. 여기서, 무선 통신/연결은 상향링크/하향링크 통신(150a)과 사이드링크 통신(150b)(또는, D2D 통신)과 같은 다양한 RAT(예, 5G NR)를 통해 이뤄질 수 있다. 무선 통신/연결(150a, 150b)을 통해 무선 기기와 BS/무선 기기는 서로 무선 신 호들을 전송/수신할 수 있다. 예를 들어, 무선 통신/연결(150a, 150b)은 다양한 물리채널을 통해 신호들을 전송 /수신할 수 있다. 이를 위해, 본 명세의 다양한 제안들에 기반하여, 무선 신호들의 전송/수신을 위한 다양한 설 정 정보 구성 과정, 다양한 신호 처리 과정(예, 채널 인코딩/디코딩, 변조/복조, 및 자원 매핑/디매핑) 및 자원 할당 과정 중 적어도 일부가 수행될 수 있다. 본 명세에서, 컴퓨터 판독가능한 저장 매체는 적어도 하나의 프로세서에 의해 실행될 때 적어도 하나의 프로세 서로 하여금 본 명세의 몇몇 실시예 또는 구현들에 따른 동작을 수행하게 하는 적어도 하나의 지시 또는 컴퓨터 프로그램을 저장한다. 본 명세에서, 처리 기기 또는 장치는 적어도 하나의 프로세서, 및 적어도 하나의 프로세서에 연결가능한, 그리 고, 실행될 때, 적어도 하나의 프로세서로 하여금 본 명세의 몇몇 실시예 또는 구현들에 따른 동작을 수행하게 하는 지시들을 저장한, 적어도 하나의 컴퓨터 메모리를 포함할 수 있다.최근 항만 물류 관리 시스템에 AI 기능을 반영한 새로운 항만 물류 관리 기술이 등장하고 있다. 또한, 항만 물 류 관리 시스템에 정보 통신 기술(ICT)와 사물 인터넷(IoT) 개념을 적용하여 스마트 항만 물류 관리 시스템을 운영하고 있으며, 최근에는 인공지능 (AI), 블록 체인 (Block-Chain), 빅 데이터 (Big Data), 클라우드 (Cloud) 기술이 결합된 자율적인 지능형 항만 물류 관리 시스템에 대한 관심도 높아지고 있지만, 물류 창고에서 의 1인당 평균 분류작업이 35.8% 늘어 전체 노동시간의 42.8%를 차지하여 물류 분류 작업의 효율화가 당면 과제 로서 고려되고 있다. 최근 미국, 유럽, 영국 전역의 다양한 산업 분야에서는 산업 분야에서는 VR 안경 또는 스마트 안경을 활용한 비 전 피킹(Vision Picking) 기술이 위 문제점을 해결하기 위한 수단으로 고려되고 있다. 비전 피킹(Vision Picking) 기술이란, 증강 현실(AR) 기술 기반의 웨어러블 디바이스를 물류창고 업무에 활용한 것으로, 과거에는 물건을 일일이 바코드 스캐너로 찍고 픽업 리스트에 수기로 체크를 해야 했지만, 비전 피킹이 적용된 물류현장에서는 스마트 안경이 이를 대신하여 스마트 안경을통해 직원들은 스마트공장 물류 창고 내 제 품 구역, 제품 위치, 주문 수량, 수하물 하역 장소 등과 같은 피킹 작업 관련 정보들을 자동으로 제공받게 되는 기술이다. 본 발명에서는 AI영상 손가락 추적기능 탑재 AR 안경을 활용한 비전 피킹 (Vision Picking)을 이용한 항만 물류 관리 시스템을 제공하는 것을 목적으로 한다. 과거에는 컨테이너의 위치 및 수량 등에 관한 정보와 컨테이너 내 제품 수량과 같은 정보는 수기로 체크를 해야 했지만, AI영상 손가락 추적 기능이 탑재된 AR안경 기반 비전 피킹을 이용한다면, 항만 내 컨테이너 위치, 컨테 이너 수량 및 컨테이너 내 제품 수량 등과 같은 관련 정보들을 자동으로 제공받을 수 있다. 보다 구체적으로, 본 발명에서는 반복되는 항만 물류 단순 검수작업을 자동화하고 작업 효율을 향상하기 위한 웨어러블 AR 안경 기반 항만 항만 물류 관리 시스템을 제공한다. 항만에서 작업자가 실시간 영상 및 OCR 기술을 활용하여 컨테이너 검수를 하기 위한 시스템으로 안전하고 정확 하게 검수작업을 처리할 수 있다. 특히, 모바일 AR안경에서 수집되는 영상정 보를 웹 영상 전송 기술 활용하면 5G기반 고화질 화상채팅 등의 서비스를 종합적으로 지원할 수 있게 된다 특히, 본 발명의 일 예는 항만 물류 작업자가 AR 안경 디바이스를 이용하여 컨테이너 검수를 하기 위한 시스템 으로 컨테이너 검수는 검수자가 컨테이너 번호, 씰 번호, Y/T 번호를 확인하고, 터미널 운영시스템 서버, 즉 항 만 관리 서버와 컨테이너 목록이 일치하면 완료된다. 본 발명에 따르면, 항만물류 작업자가 컨테이너 정보를 AR 안경으로 현장에서 확인하고, 현장의 영상정보를 항 만 관리 서버로 5G 통신을 통한 송수신 및 자동 저장하며, 현장 작업자간의 컨테이너 정보 및 영상정보를 AR 안 경을 통해 공유함으로 인하여, 비대면 관련성이 높다. 특히, 본 발명의 경우, 양안 AR 안경 기반 5G 웹 기반 영상 전송 기능을 이용하며, AI 손가락 추적 기술을 활용 한 AR 메뉴 좌표 인식 기능을 제공한다. 또한, OCR을 통한 항만 컨테이너 검수 서비스를 제공할 수 있다. 이로 인하여, 종이 문서나 한손에 들고 다니는 모바일 기기 의 비효율성을 제거 하고 단순한 컨테이너 검수 작 업을 자동화하고 현장에서 필요한 정보를 찾는 과정이 AR 기술을 통해 간소화되어 업무의 효율성을 증대시킨다. 나아가, 현장과 사무실을 실시간으로 연결해줌으로써 원격 업무지원을 가능하게 해주며 작업자 상호간 혹은 전 문가와의 대면 시간과 비용을 현저히 줄일 수 있게 된다. 도 2는 본 발명의 실시예에 따른 항만 물류 관리 시스템의 일 예이다. 특히, 도 2는 설명의 편의를 위하여 컨테 이너 검수 기능을 구현하기 위한 항만 물류 관리 시스템을 도시한다. 도 2를 참조하면, 발명의 실시예에 따른 항만 물류 관리 시스템은 웨어러블 양안 AR 안경 및 무선 통합 통신 모 듈을 제공하며, 이는 하나의 장치로 제공될 수 있다. 즉, 무선 통합 통신 모듈은 웨어러블 양안 AR 안경의 일 구성인 것이 바람직하다. 특히, 무선 통합 통신 모듈은 LTE 및 5G와 같은 일반적인 무선 통신 기능 뿐만 아니라, 웨어러블 양안 AR 안경과 IoT 디바이스와 통신 링크를 형성하는 기능 역시 수행할 수 있다. 또한, 본 발명은 5G 통신 기능이 가능한 웨어러블 양안 AR 안경을 이용하는 것을 주된 특징으로 하며, AR 안경 연계 비전 실시간 피킹 콘텐츠 서비스 제공하고, AI 영상 인식 기반 손가락 추적 기능을 제공한다. 특히, 본 발 명의 항만 물류 관리 시스템은 손 표적 모델 해석을 위하여 3D 메뉴 좌표 인식 기술이 적용되며, OCR 엔진을 활 용하여 광학 인식 알고리즘이 요구될 수 있다. 이러한 기술에 의하여, 웨어러블 양안 AR 안경을 통하여 제품 번호/바코드/QR코드 인식 기능을 수행할 수 있다. 추가적으로, 본 발명의 항만 물류 관리 시스템은 보다 효율적인 관리를 위하여 5G 통신 AR 안경을 활용한 화상 채팅 기능이 제공되며, AR 기술을 활용하여 원격 지원 및 원격 판서 기능이 제공될 수 있다. 이하 본 발명의 특징에 관하여 보다 상세하게 설명한다. 본 발명인 AI 기반 손가락 추적 기능 탑재 AR 안경을 이용한 항만 물류 관리 시스템의 구현을 위하여, AI영상 손가락 추적기능 탑재 AR 안경을 활용한 비전 피킹(Vision Picking) 콘텐츠가 포함된다. 특히, AI 학습 데이터를 수집하고 항만 관리 서버로 전달하며, 상기 항만 관리 서버로부터 딥 러닝을 통하여 학습된 인식 정보 를 전달받기 위하여, AR 안경은 5G 시스템과 연결될 수 있으며, 이를 위하여 무선 통신 모듈이 포함될 수 있다. 또한, OCR 알고리즘 기반 제품 분류 정보 서비스가 적용된다. 여기서, OCR (optical character reader)이란 광 학 문자 판독 장치로서, 용지 상에 타이프라이터나 라인프린터로 인쇄된 문자 또는 사람이 손으로 쓴 문자를 읽 는 장치이다. 즉, 문자, 숫자 또는 다른 기호의 형태가 갖는 정보로부터 디지털 컴퓨터에 알맞는 부호화된 전기 신호로 변환하는 장치이다. 특히, 본 발명에서는 번호/바코드/QR코드에 특화된 인식 모델 라이브러리가 포함될 수 있다. 또한, 핵심적으로, AI 손가락 추적 기술 기반 AR 메뉴 좌표 인식 기술이 포함된다. 이를 위하여, AI 학습 데이 터를 이용하여 손가락 끝 3D 좌표 반환 알고리즘이 본 발명에 적용되며, 손가락 3D 공간 메뉴 터치 인터랙션 기 술이 적용된다. 도 3은 본 발명의 실시예에 따른 AR 안경, 즉 증강 현실 안경 장치와 항만 관리 서버와의 신호 흐름도이다. 도 3을 참조하면, 증강 현실 안경 장치는 디스플레이부 및 영상촬영부를 포함하고, 작업자가 착용 가능하도록 안경 형태로 형성되며, 상기 항만 관리 서버와 신호를 송수신하기 위한 무선 통신부를 더 포함할 수 있다. 바람직하게는, 증강 현실 안경 장치가 컨테이너에 부착된 인식 번호를 상기 영상촬영부를 이용하여 스캔하여 코 드 데이터를 획득하고, 상기 무선 통신부를 이용하여 상기 코드 데이터를 상기 항만 관리 서버로 전송할 수 있 다. 또한, 항만 관리 서버는 상기 코드 데이터 및 상기 코드 데이터에 대응되는 정보 데이터를 저장하고, 상기 증강 현실 안경 장치로부터 상기 코드 데이터에 대응되는 정보 데이터가 조회 요청되면, 상기 정보 데이터를 상기 증 강 현실 안경 장치로 송신할 수 있다. 바람직하게는, 상기 증강 현실 안경 장치는, 상기 사용자 상호 작 용 입력을 위한 하나 이상의 정보 데이터를 상기 디스플레이부에 출력하고, 상기 작업자의 손가락 위치 및 동작 에 기반하여 상기 하나 이상의 정보 데이터 중 적어도 하나를 선택하는 상기 사용자 상호 작용 입력 신호를 생 성할 수 있다. 나아가, 상기 하나 이상의 정보 데이터 및 상기 사용자 상호 작용 입력 신호는 3차원 좌표 정보 로 표현될 수 있다. 또한, 상기 증강 현실 안경 장치는, 상기 영상촬영부를 이용하여 상기 작업자의 손가락 위치 및 동작을 촬영하 고, 상기 촬영된 영상을 처리하여 사용자 상호 작용 입력 신호로 변환하여 처리할 수 있으며, 추가적으로 상기 사용자 상호 작용 입력 신호를 딥러닝 학습 데이터로서 상기 항만 관리 서버로 전송할 수도 있다. 상기 사용자 상호 작용 입력 신호를 학습 데이터로 딥러닝을 수행하고, 상기 딥러닝의 결과에 기반하여 상기 하나 이 상의 정보 데이터를 상기 증강 현실 안경 장치로 제공할 수 있다. 도 4는 본 발명의 일 실시예에 따른 디바이스의 블록 구성도를 예시한다. 특히, 도 4는 본 발명에서 제공하는 AR 안경의 일 형태일 수 있다. 도 4를 참조하면, 디바이스는 프로세서, 메모리, RF 모듈, 디스플레이 모듈 및 사용자 인터페이스 모듈을 포함한다. 디바이스는 설명의 편의를 위해 도시된 것으로서 일부 모듈은 생략될 수 있다. 또한, 디바이스는 필요한 모듈을 더 포함할 수 있다. 또한, 디바이스에서 일부 모듈은 보다 세분화된 모듈로 구분될 수 있 다. 프로세서는 도면을 참조하여 예시한 본 발명의 실시 예에 따른 동작을 수행하도록 구성된다. 구체적 으로, 프로세서의 자세한 동작은 도 1 내지 도 3에 기재된 내용을 참조할 수 있다. 메모리는 프로세서에 연결되며 오퍼레이팅 시스템, 어플리케이션, 프로그램 코드, 데이터 등을 저 장한다. RF 모듈은 프로세서에 연결되며 기저대역 신호를 무선 신호를 변환하거나 무선신호를 기저대역 신호로 변환하는 기능을 수행한다. 이를 위해, RF 모듈은 아날로그 변환, 증폭, 필터링 및 주파수 상향 변환 또는 이들의 역과정을 수행한다. 디스플레이 모듈은 프로세서에 연결되며 다양한 정보를 디스플레이한다. 디스플레이 모듈은 이로 제한되는 것은 아니지만 LCD(Liquid Crystal Display), LED(Light Emitting Diode), OLED(또는ganic Light Emitting Diode)와 같은 잘 알려진 요소를 사용할 수 있다. 사용자 인터페이스 모듈은 프로세서와 연결되며 키패드, 터치 스크린 등과 같은 잘 알려진 사용자 인터페이스의 조합으로 구성될 수 있다. 이상에서 설명된 실시예들은 본 발명의 구성요소들과 특징들이 소정 형태로 결합된 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려되어야 한다. 각 구성요소 또는 특징은 다른 구성요 소나 특징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 본 발명 의 실시예를 구성하는 것도 가능하다. 본 발명의 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있다. 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함시킬 수 있음은 자명하다. 본 명세서에 개시된 실시 예들과 관련하여 설명된 방법 또는 알고리즘의 단계는 프로세서에 의해 실행되는 하드 웨어, 소프트웨어 모듈, 또는 그 2 개의 결합으로 직접 구현될 수 있다. 소프트웨어 모듈은 RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터, 하드 디스크, 착탈형 디스크, CD-ROM과 같은 저 장 매체(즉, 메모리 및/또는 스토리지)에 상주할 수도 있다. 예시적인 저장 매체는 프로세서에 커플링되며, 그 프로세서는 저장 매체로부터 정보를 판독할 수 있고 저장 매 체에 정보를 기입할 수 있다. 다른 방법으로, 저장 매체는 프로세서와 일체형일 수도 있다. 프로세서 및 저장 매체는 주문형 집적회로(ASIC) 내에 상주할 수도 있다. ASIC는 사용자 단말기 내에 상주할 수도 있다. 다른 방 법으로, 프로세서 및 저장 매체는 사용자 단말기 내에 개별 컴포넌트로서 상주할 수도 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이 고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아 래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0022381", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 첨부되는 도면은 본 발명에 대한 이해를 제공하기 위한 것으로서 본 발명의 다양한 실시형태들을 나타내고 명세서의 기재와 함께 본 발명의 원리를 설명하기 위한 것이다. 도 1은 통신시스템의 네트워크의 일 예이다. 도 2는 본 발명의 실시예에 따른 항만 물류 관리 시스템의 일 예이다. 도 3은 본 발명의 실시예에 따른 AR 안경, 즉 증강 현실 안경 장치와 항만 관리 서버와의 신호 흐름도이다 도 4는 본 발명의 일 실시예에 따른 디바이스의 블록 구성도를 예시한다."}
