{"patent_id": "10-2022-0067003", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0166702", "출원번호": "10-2022-0067003", "발명의 명칭": "차량 내부의 모니터링 장치 및 방법", "출원인": "현대자동차주식회사", "발명자": "김응환"}}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "송신 신호를 송출하고, 상기 송신 신호의 반사파를 수신하는 무선 송수신 장치;상기 무선 송수신 장치의 감지 범위를 이동시키는 이동부재; 및 상기 수신 신호를 바탕으로, 상기 감지 범위 내의 객체를 검출하는 제어부;를 포함하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 이동부재는 차량의 실내 영역에 배치된 레일; 및상기 레일을 따라 이동하며, 상기 무선 송수신 장치가 결합되는 결합부;를 포함하는 것을 특징으로 하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 레일은 차량의 장축 방향을 따라 배치되는 것을 특징으로 하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 이동부재는상기 차량의 썬루프에 결합되어 상기 썬루프의 이동에 따라 움직이며, 상기 무선 송수신 장치가 결합되는 결합부를 포함하는 것을 특징으로 하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 결합부는 상기 썬루프가 개방함에 따라 상기 차량의 외측으로 이동하는 것을 특징으로 하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,공개특허 10-2023-0166702-3-상기 제어부는제1 타이밍에서 상기 차량의 실내 전방 영역을 모니터링하고, 제2 타이밍에서 상기 차량의 실내 후방 영역을 모니터링하는 것을 특징으로 하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,베이스 프레임; 및상기 베이스 프레임에 결합되어 회전 이동하여, 상기 무선 송수신 장치를 회전시키는 회전부재;를 포함하는 것을 특징으로 하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 회전부재의 회전 반경은 지면과 평행인 면에 속하는 것을 특징으로 하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 회전부재에 결합되며, 상기 회전부재의 회전 방향과 수직 방향으로 일정 범위 내에서 회전하는 틸트부;를더 포함하는 것을 특징으로 하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 틸트부의 회전 반경은 지면과 수직인 면에 속하는 것을 특징으로 하는 차량 내부의 모니터링 장치."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "레이더를 이용하여, 제1 감지 영역에 대한 모니터링을 수행하는 단계;상기 레이더의 조준선이 상기 제1 감지 영역과 다른 제2 감지 영역을 향하도록, 상기 레이더와 결합된 이동부재를 이동시키는 단계; 및제2 타이밍에서, 제2 감지 영역에 대한 모니터링을 수행하는 단계;를 포함하는 차량 내부의 모니터링 방법."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 이동부재를 이동시키는 단계는상기 이동부재를 차량 내부에서 직선 이동시키거나, 상기 이동부재를 임의의 평면상에서 회전시키는 것을 특징으로 하는 차량 내부의 모니터링 방법.공개특허 10-2023-0166702-4-청구항 13 제 11 항에 있어서,상기 제1 감지 영역에 대한 모니터링을 수행하는 단계는상기 제1 감지 영역 내의 객체 검출을 바탕으로, 객체 감지 이벤트를 처리하는 단계를 포함하는 것을 특징으로하는 차량 내부의 모니터링 방법."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 객체 감지 이벤트를 처리하는 단계는상기 제1 감지 영역의 객체 검출을 바탕으로, 상기 제1 감지 영역에 대한 특정데이터를 획득하는 센서부를 동작시키는 단계를 더 포함하는 것을 특징으로 하는 차량 내부의 모니터링 방법."}
{"patent_id": "10-2022-0067003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 11 항에 있어서,상기 제1 감지 영역에 대한 모니터링을 수행하는 단계는미리 설정된 기능을 위해서 상기 레이더의 초기 위치를 결정하는 감지 모드를 확인하는 단계;상기 감지 모드를 바탕으로 상기 레이더의 조준선이 상기 제1 감지 영역을 향하도록 제어하는 단계;를 포함하는것을 특징으로 하는 차량 내부의 모니터링 방법."}
{"patent_id": "10-2022-0067003", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 차량 내부의 모니터링 장치 및 방법에 관한 것으로, 본 발명의 실시 예에 의한 차량 내부의 모니터링 장치는 송신 신호를 송출하고 송신 신호의 반사파를 수신하는 무선 송수신 장치, 무선 송수신 장치의 감지 범위 를 이동시키는 이동부재, 및 수신 신호를 바탕으로 감지 범위 내의 객체를 검출하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2022-0067003", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량 내부의 모니터링 장치 및 방법에 관한 것으로, 특히 간소한 구조로 넓은 영역을 모니터링할 수 있는 기술에 관한 것이다."}
{"patent_id": "10-2022-0067003", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "차량 내의 도난을 방지하고, 탑승객의 하차 여부를 확인하기 위해서 차량 내부를 모니터링하는 다양한 방안들이 활용되고 있다. 차량 내부를 모니터링하기 위해서 차량 내부의 객체를 감지할 수 있는 센서들을 활용하기도 한다. 센서의 종류 에 따라서 단일 센서로는 차량 내부를 전체적으로 모니터링하기가 쉽지 않은 것이 일반적이고, 감지 범위를 늘 리기 위해서 센서를 많이 사용하면 원가 상승의 부담이 발생한다. 또한, 차량은 운행에 필요한 조작을 위해서 다양한 센서들이 활용되고 있지만, 각각의 센서들은 개별적으로 동 작할 뿐이어서 차량 내부를 모니터링하는 효율이 개선되지 않는 실정이다."}
{"patent_id": "10-2022-0067003", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시 예는 센싱 장치를 줄이면서 차량 내부의 넓은 영역을 모니터링할 수 있는 차량 내부의 모니터링 장치 및 방법을 제공하기 위한 것이다. 또한, 본 발명의 실시 예는 보다 정확하게 객체를 확인할 수 있는 차량 내부의 모니터링 장치 및 방법을 제공하 기 위한 것이다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재들로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0067003", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 의한 차량 내부의 모니터링 장치는 송신 신호를 송출하고 송신 신호의 반사파를 수신하는 무선 송수신 장치, 무선 송수신 장치의 감지 범위를 이동시키는 이동부재, 및 수신 신호를 바탕으로 감지 범위 내의 객체를 검출하는 제어부를 포함할 수 있다. 본 발명의 실시 예에 의하면, 상기 이동부재는 차량의 실내 영역에 배치된 레일 및 상기 레일을 따라 이동하며 상기 무선 송수신 장치가 결합되는 결합부를 포함할 수 있다. 본 발명의 실시 예에 의하면, 상기 레일은 차량의 장축 방향을 따라 배치될 수 있다. 본 발명의 실시 예에 의하면, 상기 이동부재는 상기 차량의 썬루프에 결합되어 상기 썬루프의 이동에 따라 움직 이며, 상기 무선 송수신 장치가 결합되는 결합부를 포함할 수 있다. 본 발명의 실시 예에 의하면, 상기 결합부는 상기 썬루프가 개방함에 따라 상기 차량의 외측으로 이동할 수 있 다. 본 발명의 실시 예에 의하면, 상기 제어부는 제1 타이밍에서 상기 차량의 실내 전방 영역을 모니터링하고, 제2 타이밍에서 상기 차량의 실내 후방 영역을 모니터링할 수 있다. 본 발명의 실시 예에 의하면, 상기 이동부재는 베이스 프레임 및 상기 베이스 프레임에 결합되어 회전 이동하여 상기 무선 송수신 장치를 회전시키는 회전부재를 포함할 수 있다. 본 발명의 실시 예에 의하면, 상기 회전부재의 회전 반경은 지면과 평행인 면에 속하는 것일 수 있다. 본 발명의 실시 예에 의하면, 상기 회전부재에 결합되며 상기 회전부재의 회전 방향과 수직 방향으로 일정 범위 내에서 회전하는 틸트부를 더 포함할 수 있다. 본 발명의 실시 예에 의하면, 상기 틸트부의 회전 반경은 지면과 수직인 면에 속하는 것일 수 있다. 본 발명의 실시 예에 의한 차량 내부의 모니터링 방법은 레이더를 이용하여, 제1 감지 영역에 대한 모니터링을 수행하는 단계, 상기 레이더의 조준선이 상기 제1 감지 영역과 다른 제2 감지 영역을 향하도록, 상기 레이더와 결합된 이동부재를 이동시키는 단계, 및 제2 타이밍에서, 제2 감지 영역에 대한 모니터링을 수행하는 단계를 포 함할 수 있다. 본 발명의 실시 예에 의하면, 상기 이동부재를 이동시키는 단계는 상기 이동부재를 차량 내부에서 직선 이동시 키거나, 상기 이동부재를 임의의 평면상에서 회전시킬 수 있다. 본 발명의 실시 예에 의하면, 상기 제1 감지 영역에 대한 모니터링을 수행하는 단계는 상기 제1 감지 영역 내의 객체 검출을 바탕으로, 객체 감지 이벤트를 처리하는 단계를 포함할 수 있다. 본 발명의 실시 예에 의하면, 상기 객체 감지 이벤트를 처리하는 단계는 상기 제1 감지 영역의 객체 검출을 바 탕으로, 상기 제1 감지 영역에 대한 특정데이터를 획득하는 센서부를 동작시키는 단계를 더 포함할 수 있다. 본 발명의 실시 예에 의하면, 상기 제1 감지 영역에 대한 모니터링을 수행하는 단계는 미리 설정된 기능을 위해 서 상기 레이더의 초기 윛치를 결정하는 감지 모드를 확인하는 단계, 상기 김지 모드를 바탕으로 상기 레이더의 조준선이 상기 제1 감지 영역을 향하도록 제어하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0067003", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 의하면, 이동부재를 이용하여 레이더의 감지 영역을 변경하면서 차량 내부를 모니터링함으 로써, 레이더의 개수를 줄이면서도 차량 내부의 넓은 면적을 모니터링 할 수 있다. 또한 본 발명의 실시 예에 의하면, 감지 영역의 객체 감지를 바탕으로 특정 이벤트를 처리함으로써 차량 내부의 모니터링을 통해서 다양한 기능을 수행할 수 있다. 또한, 본 발명의 실시 예에 의하면, 객체 감지를 통해서 센서부를 동작시킴으로써, 차량 내부를 보다 정확하게 모니터링할 수 있다.이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2022-0067003", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한 다. 본 발명의 실시예의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소 의 본질이나 차례 또는 순서 등이 한정되지 않는다. 또한, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용 어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들 은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정 의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 도 1 내지 도 11을 참조하여, 본 발명의 실시 예들을 구체적으로 설명하기로 한다. 도 1은 본 발명의 일 실시 예에 따른 모니터링 장치 및 이를 포함하는 차량의 구성을 나타내는 블록도이다. 도 1을 참조하면, 본 발명의 일 실시 예에 따른 모니터링 장치는 차량 내부를 모니터링하기 위한 것으로, 차량의 내부에 구현될 수 있다. 이때, 모니터링 장치의 제어부는 차량의 내부 제어 유닛들과 일체로 형성될 수 있으며, 별도의 장치로 구현되어 별도의 연결 수단에 의해 차량의 제어 유닛들과 연결될 수도 있다. 모니터링 장치는 레이더, 제어부, 및 센서부를 포함할 수 있다. 레이더는 지향성의 송신 신호를 송출하고, 송신 신호의 반사파를 수신 신호로 수신하는 무선 송수신 장치 에 해당될 수 있다. 따라서 본 명세서는 무선 송수신 장치가 레이더로 구현된 실시 예를 중심으로 설명하 지만, 무선 송수신 장치는 이에 한정되지 않을 수 있다. 레이더는 송신 신호를 생성하고, 송신부를 통해서 송신 신호를 송신할 수 있다. 레이더의 수신 부는 송신 신호가 객체에 의해 반사되는 수신 신호를 수신할 수 있다. 레이더의 믹서는 송신 신호와 수신 신호 간의 주파수 차이 성분을 갖는 비트 신호를 생성할 수 있다. 필터는 비트 신호를 필터 링하고, 아날로그 디지털 컨버터(Analog Digital Converter; ADC)는 필터링 된 비트 신호를 디지털 신호 의 센싱 데이터로 변환할 수 있다. 레이더는 주파수 변조 연속파형(Frequency Modulated Continuous Wave; FMCW) 방식 또는 UWD(Ultra- wideband) 레이더 등으로 구현될 수 있다. 이동부재는 일정 시간 단위로 레이더를 이동시킬 수 있다. 특히, 이동부재는 레이더의 감 지 범위가 달라지도록 레이더를 이동시킬 수 있다. 제어부는 카메라(CAM)를 이용하여 획득한 영상에서 사람 또는 생명체에 해당하는 객체를 검출할 수 있다. 제어부는 객체가 사람일 경우 객체의 나이를 추정할 수 있고, 객체의 나이에 따라서 알람 송출 여부를 결 정할 수 있다. 제어부는 객체 검출 또는 객체의 나이를 추정하는 과정에서 인공지능(artificial intelligence; 이하, AI) 프로세서를 포함할 수 있다. AI 프로세서는 미리 저장된 프로그램을 이용하여 신경망을 학습할 수 있다. 영상 에서 객체 검출을 위한 신경망은 인간의 뇌 구조를 컴퓨터 상에서 모의하도록 설계될 수 있으며, 인간의 신경망 의 뉴런(neuron)을 모의하는, 가중치를 갖는 복수의 네트워크 노드들을 포함할 수 있다. 복수의 네트워크 모드 들은 뉴런이 시냅스(synapse)를 통해 신호를 주고 받는 뉴런의 시냅틱 활동을 모의하도록 각각 연결 관계에 따 라 데이터를 주고 받을 수 있다. 신경망은 신경망 모델에서 발전한 딥러닝 모델을 포함할 수 있다. 딥 러닝 모 델에서 복수의 네트워크 노드들은 서로 다른 레이어에 위치하면서 컨볼루션(convolution) 연결 관계에 따라 데 이터를 주고 받을 수 있다. 신경망 모델의 예는 심층 신경망(DNN, deep neural networks), 합성곱 신경망(CNN, convolutional deep neural networks), 순환 신경망(RNN, Recurrent Boltzmann Machine), 제한 볼츠만 머신 (RBM, Restricted Boltzmann Machine), 심층 신뢰 신경망(DBN, deep belief networks), 심층 Q-네트워크(Deep Q-Network)와 같은 다양한 딥 러닝 기법들을 포함할 수 있다. 또한, 제어부는 레이더를 통해서 객체가 감지된 것을 바탕으로, 초음파 센서(US)를 동작시킬 수 있다. 제어부는 레이더를 통해서 객체가 감지된 것을 바탕으로, 좌석 센서(PS)를 동작시킬 수 있다. 본 발명의 다른 실시 예에 의한 제어부는 레이더를 통해서 객체가 감지된 것을 바탕으로, 단위 기간 동안 차량 조작부에 대한 사용자 입력을 모니터링할 수 있다. 차량 조작부는 운전을 위한 사용자 입 력 또는 차량의 편의 기능을 위한 사용자 입력을 수신하는 장치이다. 차량 조작부는 스티어링 휠, 기어, 윈도우 조절 스위치, 마이크 등을 포함할 수 있다. 이외에도, 차량 조작부는 브레이크 페달 및 가속 페달 등을 포함할 수 있다. 또한, 제어부는 센서부에 의해서 사람 또는 생명체가 감지되거나, 단위 기간 내에 차량 조작부 의 사용자 입력이 확인되는 것을 바탕으로, 출력부를 제어하여 알람을 송출할 수 있다. 제어부가 알 람을 송출하는 절차는 객체가 사람으로 판단되는 경우로 한정될 수 있고, 특히 제어부는 객체의 나이가 임 계치 미만인 경우에 한해서 알람을 송출할 수 있다. 또한 제어부는 모뎀을 통해서 사용자 단말기 에 차량 내에서 객체가 감지된 사실을 통지할 수 있다. 센서부는 차량 내부를 모니터링하기 위한 것으로, 이미지 센서를 포함하는 카메라(CAM), 초음파 센서(US), 및 좌석 센서(PS) 등을 포함할 수 있다. 카메라(CAM)는 이미지 센서를 통해서 획득한 전기 신호를 바탕으로 차량 내부의 영상 데이터를 획득할 수 있다. 카메라(CAM)는 복수의 시트 영역들에 대한 영상을 획득하도록 배치될 수 있고, 예를 들어 각각의 시트 영역에 대응하도록 복수 개의 카메라(CAM)들이 설치될 수 있다. 초음파 센서(US)는 초음파 액츄에이터를 통해서 생성된 초음파를 송출하고, 객체에 의해서 반사되는 초음파를 수신한 것을 바탕으로, 객체의 거리를 산출할 수 있다. 초음파 센서(US)는 복수의 시트 영역들에 대한 객체를 감지할 수 있도록 배치될 수 있고, 예를 들어 각각의 시트 영역에 대응하도록 복수 개의 초음파 센서(US)들이 설치될 수 있다. 좌석 센서(PS)는 시트에 내장되어, 시트에 가해지는 압력을 센싱하는 압력 센서일 수 있다. 출력부는 차량 내부의 객체 감지를 외부로 알리기 위한 것으로, 램프, 버저, 및 디스플레이 를 포함할 수 있다. 램프는 차량의 외부에서 확인될 수 있도록 발광하며, 차량 내부의 객체 종류에 따라 발광 횟수 또는 발광 패턴이 달라질 수 있다. 버저는 차량의 외부에서 청취될 수 있도록 울릴 수 있으며, 차량 내부의 객체 종류에 따라 울림 횟수 또는 울림 패턴이 달라질 수 있다. 디스플레이는 차량 외부에 위치한 사용자에게 영상을 표시하는 장치일 수 있다. 디스플레이는 차량 내부에서 윈도우로 영상을 표시하는 헤드업 디스플레이(Head-Up Display; HUD) 또는 차량의 윈도우에 형성된 터 치 디스플레이일 수 있다. 모뎀은 제어부의 제어 하에, 서버를 통해서 사용자 단말기에게 객체 감지 정보를 전송할 수 있다. 모 뎀은 이동 통신을 위한 기술 표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division MultiAccess),CDMA2000(Code Division Multi Access 2000), EV- DO(Enhanced Voice-Data Optimized or Enhanced Voice-DataOnly), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink PacketAccess), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등)에 따라 구축된 이동 통신망 상에서 기지국, 외부의 단말, 센터 중 적어도 하나와 무선 신호를 송수신할 수 있다. 무선 신호는 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송 수신에 따른 다양한 형태의 데이터를 포함할 수 있다. 도 2 및 도 3은 본 발명의 실시 예에 의한 차량 내부의 모니터링 장치를 나타내는 도면이다. 특히, 도 2는 실 시 예에 따른 이동 부재를 나타내는 도면이며, 도 3 및 도 4는 도 2에 도시된 이동 부재가 차량에 장착된 실시 예를 나타내는 도면이다. 도 1 내지 도 4를 참조하면, 본 발명의 실시 예에 의한 차량 내부의 모니터링 장치는 레일, 결합부, 레이더 및 제어부를 포함할 수 있다. 레일은 차량의 실내 영역에 배치될 수 있고, 결합부가 결합되어 결합부의 이동을 가이드할 수 있다. 도 2에 도시된 레일은 직선 이동이 가능한 실시 예를 도시하고 있지만, 레일의 형태는 이에 한정되지 않을 수 있다. 즉, 레일은 곡률을 갖는 형태로 이루어질 수 있다. 레일은 베이스 프레임과 지지부에 의해서 지지될 수 있다. 베이스 프레임은 차량의 실내 영역에서 차체와 결합될 수 있다. 지지부는 베이스 프레임의 양 끝단에 결합되고, 레일을 고정할 수 있다. 결합부는 레일을 따라 이동할 수 있고, 레이더가 장착되는 영역을 제공할 수 있다. 결합부 는 레이더와 물리적으로 분리되지 않고, 일체형일 수 있다. 도 2 내지 도 4에 도시된 레이더는 적어도 송수신부(111,112)를 포함할 수 있다. 믹서, 필터, ADC 등을 포함하는 레이더의 신호 처리부는 무선 송수신 장치(111, 112)와는 별도로 배치될 수 있으 며, 일례로 제어부에 포함될 수도 있다. 제어부는 차량의 전자제어유닛(micro controller unit; MCU)에 포함될 수 있고, 별도의 프로세서로 구현될 수도 있다. 도 3 및 도 4에서와 같이, 베이스 프레임은 차량의 실내 영역에서 천장에 결합될 수 있다. 레일은 차량의 장축 방향을 따라 배치되어서, 레이더는 차량의 장축 방향을 따라 이동할 수 있다. 즉, 레이더 는 차량의 전방에서 후방으로 이동하거나, 차량의 후방에서 전방으로 이동할 수 있다. 도 5는 본 발명의 다른 실시 예에 의한 차량 내부의 모니터링 장치를 나타내는 도면이다. 특히, 도 5는 실시 예에 따른 이동 부재를 도시하고 있다. 도 6은 도 5에 도시된 실시 예에 따른 감지 범위를 나타내는 도면이다. 도 5 및 도 6을 참조하면, 본 발명의 실시 예에 의한 차량 내부의 모니터링 장치는 이동부재, 레이더 및 제어부를 포함할 수 있다. 이동부재는 썬루프와 결합될 수 있다. 실시 예에 의하면, 이동부재는 썬루프의 개폐장치(S)와 결합 될 수 있다. 썬루프를 개방시키거나 닫기 위해서 썬루프의 개폐장치(S)는 이동할 수 있고, 이동부재는 개 폐장치(S)의 이동을 따라 움직일 수 있다. 이동부재의 이동에 따라 레이더의 위치도 달라질 수 있다. 예를 들어, 제1 타이밍에서 레이더 는 제1 위치(P1)에 있을 수 있다. 그리고, 제2 타이밍에서 레이더는 제2 위치(P2)에 있을 수 있다. 제1 타이밍 및 제2 타이밍은 서로 구분되는 시간을 지칭하며, 시간의 순서와는 상관없을 수 있다. 그 결과, 도 6에 서 보는 바와 같이, 레이더는 제1 타이밍에서 차량의 실내 전방 영역에 해당하는 제1 감지 영역(A1)를 모 니터링할 수 있고, 제2 타이밍에서 차량의 실내 후방 영역에 해당하는 제2 감지 영역(A2) 를 모니터링할 수 있다. 도 7은 본 발명의 다른 실시 예에 의한 이동부재를 나타내는 도면이다. 도 7을 참조하면, 본 발명의 다른 실시 예에 의한 이동부재는 고정부 및 회전부재를 포함할 수 있다. 고정부는 차량의 실내 영역에 결합될 수 있다. 회전부재는 고정부에 결합되어 회전 이동할 수 있다. 레이더는 회전부재의 일면에 결합될 수 있다. 예를 들어, 레이더는 회전부재의 제1 결합 위치(LA1)에 결합될 수 있다. 회전부재의 회전에 의해서 레이더는 회전부재의 회전 반경을 따 라 감지 범위를 조절할 수 있다. 회전부재의 회전 반경은 지면, 즉, 차량의 평면과 평행인 면에 속할 수 있다. 도 8은 회전부재에 따른 감지 범위를 조절하는 실시 예를 설명하는 도면이다. 도 8을 참조하면, 회전부재는 차량의 천장에 부착되어, 차량의 평면과 평행하게 회전할 수 있다. 제어부는 회전부재를 회전시키면서, 일정 시간 단위로 차량 내부를 모니터링할 수 있다. 예를 들어, 레이더는 제1 타이밍에서 제1 감지 영역(A1)을 모니터링할 수 있다. 그리고 회전부재의 회전에 의해 서, 레이더는 제2 타이밍에서 제2 감지 영역(A2)을 모니터링할 수 있다. 회전부재가 회전하는 동안 모니터링 동작은 중지될 수 있다. 레이더의 위치가 달라지면 수신 신호를 처리하는 정확도가 저하될 수 있기 때문이다. 도 7에서와 같이, 다른 실시 예에 의한 이동부재는 틸트부를 더 포함할 수 있다. 틸트부는 회전부재 의 회전 반경과 수직 방향으로 회전할 수 있다. 레이더는 틸트부에 결합되어, 틸트부의 회전에 따라 모니터링 영역을 조절할 수 있다. 예를 들어, 레이더는 틸트부의 외측 영역, 즉 제2 결합위치 (LA2)에 결합될 수 있다. 즉, 도 7에 도시된 이동부재는 틸트부를 포함하는 실시 예를 도시하고 있지만, 앞서 설명한 바와 같이 틸트부가 생략된 상태일 수 있다. 다른 실시 예에 의한 이동부재는 도 7에서 회전부재를 생략하고, 고정부에 틸트부가 직접 결합 된 실시 예로 구현될 수도 있다. 결과적으로, 레이더의 회전 방향에 따라 고정부에 회전부재 또는 틸트부가 선택적으로 결합될 수 있다. 다른 실시 예에 의한 이동부재는 도 7에 도시된 고정부가 도 2에 도시된 결합부와 체결될 수 있다. 따라서, 레이더는 도 2에 도시된 레일을 따라 이동하면서, 도 7에서와 같이 특정 방향으로 회전할 수 도 있다. 도 9는 틸트부의 회전에 따른 감지 범위를 조절하는 실시 예를 설명하는 도면이다. 도 9를 참조하면, 틸트부의 회전에 의해서, 레이더는 차량의 전방 영역과 후방 영역을 모니터링할 수 있다. 제어부는 틸트부를 회전시키면서, 일정 시간 단위로 차량 내부를 모니터링할 수 있다. 예를 들어, 레이더는 제1 타이밍에서 차량의 전방 영역에 해당하는 제1 감지 영역(A1)을 모니터링할 수 있다. 그리고 회전부재의 회전에 의해서, 레이더는 제2 타이밍에서 차량의 후방 영역에 해당하는 제2 감지 영역 (A2)을 모니터링할 수 있다. 도 10은 본 발명의 실시 예에 의한 차량 내부의 모니터링 방법을 설명하는 순서도이다. 도 10을 참조하여, 본 발명의 실시 예에 의한 차량 내부의 모니터링 방법을 살펴보면 다음과 같다. S1001에서, 제어부는 1차 모니터링 동작을 수행할 수 있다. 제1 타이밍에서, 레이더의 송수신부(111,112)는 제1 감지 영역(A1)을 향할 수 있다. 레이더는 제1 감지 영역(A1)을 향해서 지향성의 송신 신호를 송출하고, 송신 신호의 반사파를 수신 신호로 수신할 수 있다. 실시 예에 의하면, 레이더는 수신 신호를 수신하고, 믹서를 이용하여 송신 신호와 수신 신호 간의 주파수 차이 성분을 갖는 비트 신호를 생성할 수 있다. 레이더는 필터를 이용하여비트 신호를 필터링하고, ADC를 이용하여 비트 신호를 디지털 형태의 센싱 데이터로 변환할 수 있다. S1002에서, 제어부는 객체가 감지되는지 여부를 판단할 수 있다. 제어부는 센싱 데이터를 바탕으로, 제1 감지 영역(A1) 내에서 감지되는 객체를 확인할 수 있다. S1003에서, 제어부는 객체 감지 이벤트 처리를 할 수 있다. 제어부는 객체 감지를 바탕으로, 객체 감지 이벤트를 처리할 수 있다. 객체 감지 이벤트는 미리 설정될 수 있다. 실시 예에 의하면, 제어부는 객체가 사람으로 추정되는 경우 사람의 심박수를 측정하는 객체 감지 이벤트 를 처리할 수 있다. 실시 예에 의하면, 제어부는 제1 감지 영역(A1) 내에서 감지되는 객체에 대응하여, 제1 감지 영역(A1)에 대한 특정 데이터를 획득하는 센서부를 동작시킬 수 있다. 예를 들어, 제1 감지 영역(A1) 내에서 감지되 는 객체에 대응하여, 제1 감지 영역을 촬영하는 카메라(CAM)를 동작시킬 수 있다. 실시 예에 의하면, 제어부는 객체 감지 이벤트의 처리 결과를 모뎀을 통해서 사용자 단말기에 전 송할 수 있다. 본 발명의 실시 예에 의하면, 레이더를 이용하여 제1 감지 영역(A1)에 대한 1차적인 모니터링을 수행하고, 센서를 이용하여 2차적인 모니터링을 수행하기 때문에 보다 정확한 객체 검출이 가능해질 수 있다. S1004에서, 제어부는 이동부재를 이동시킬 수 있다. 실시 예에 의하면, 제어부는 도 2에 도시된 결합부를 레일을 따라 이동시킬 수 있다. 또는 실시 예에 의하면, 제어부는 도 7에 도시된 회전부재를 회전시키거나, 틸트부를 회전시킬 수 있다. 이에 따라, 제어부는 제2 타이밍에서 레이더가 제2 감지 영역(A2)을 향하도록 제어할 수 있다. 이동 부재가 이동하는 동안, 제어부는 레이더의 동작을 중지시킬 수 있다. 레이더의 감지 영역을 변경시킨 수, S1005에서 제어부는 2차 모니터링 동작을 수행할 수 있고, S1006 에서, 제어부는 제2 감지 영역(A2) 내에서 객체가 감지되는지 여부를 판단할 수 있다. 이를 바탕으로 S1007에서 제어부는 객체 감지 이벤트 처리를 할 수 있다. S1007 단계의 객체 감지 이벤트는 S1003 단계 와 동일할 수 있다. 도 11은 본 발명의 다른 실시 예에 의한 차량 내부의 모니터링 방법을 설명하는 순서도이다. 도 11을 참조하여, 본 발명의 실시 예에 의한 차량 내부의 모니터링 방법을 살펴보면 다음과 같다. S1101에서, 제어부는 감지 모드 설정을 확인할 수 있다. 감지 모드는 이동부재의 초기 위치를 결정하기 위한 것일 수 있다. 실시 예에 의하면, 감지 모드는 이동부재의 초기 위치를 직접 지시하는 명령일 수 있다. 또는 실시 예에 의하면, 감지 모드는 특정 기능으로 설정될 수 있다. 예를 들어, 감지 모드는 도어의 잠금 여 부를 확인하는 것일 수 있다. 또는 감지 모드는 승객, 특히 유아의 탑승을 확인하는 것일 수 있다. 또는 감지 모드는 외부인의 침입을 감지하는 것일 수 있다. 또는 감지 모드는 차량 내의 유실물을 확인하는 모드일 수 있 다. S1102에서, 제어부는 감지 모드를 바탕으로 레이더의 초기 위치를 조절할 수 있다. 감지 모드가 이동부재의 초기 위치를 직접 지시하는 명령일 경우, 제어부는 감지 모드가 지시하는 위 치로 이동부재를 제어할 수 있다. 감지 모드가 도어의 잠금 여부를 확인하는 모드일 경우, 레이더의 감지 영역이 도어 중에서 어느 하나를 향하도록 제어부는 이동부재를 제어할 수 있다. 감지 모드가 승객의 탑승을 확인하는 모드일 경우, 레이더의 감지 영역이 차량 내의 시트 중에서 어느 하 나를 향하도록 제어부는 이동부재를 이동시킬 수 있다. 특히, 제어부는 레이더의 감지 영역이 차량 내의 카시트를 향하도록 이동부재를 제어할 수 있다. 감지 모드가 외부인의 침입을 감지하는 모드일 경우, 레이더의 감지 영역이 차량 내의 시트 중에서 어느 하나를 향하도록 제어부는 이동부재를 이동시킬 수 있다. 감지 모드가 차량 내의 유실물을 확인하는 모드일 경우, 레이더의 감지 영역이 차량 내의 시트 중에서 어 느 하나를 향하도록 제어부는 이동부재를 이동시킬 수 있다. S1103에서, 제어부는 레이더가 향하는 초기 감지 영역에 대한 모니터링을 진행할 수 있다. 제어부는 레이더를 제어하여, 초기 감지 영역에 대한 모니터링을 수행할 수 있다. S1104에서, 제어부는 초기 감지 영역에 대한 모니터링을 바탕으로 객체 감지 이벤트를 처리할 수 있다. 객체 감지 이벤트는 도 10에 도시된 실시 예에서 설명된 것과 동일할 수 있다. S1105에서, 제어부는 2차 모니터링을 진행할 수 있다. 2차 모니터링은 초기 감지 영역 이외의 감지 영역 에 대한 모니터링을 의미할 수 있다. 2차 모니터링의 세부적인 방법은 전술한 실시 예들에서와 동일한 절차일 수 있다. 도 12는 본 발명의 일 실시 예에 따른 컴퓨팅 시스템을 나타내는 도면이다. 도 12를 참조하면, 컴퓨팅 시스템은 버스를 통해 연결되는 적어도 하나의 프로세서, 메모리 , 사용자 인터페이스 입력 장치, 사용자 인터페이스 출력 장치, 스토리지, 및 네트워 크 인터페이스를 포함할 수 있다. 프로세서는 중앙 처리 장치(CPU) 또는 메모리 및/또는 스토리지에 저장된 명령어들에 대한 처리를 실행하는 반도체 장치일 수 있다. 프로세서는 본 발명의 실시 예에 의한 제어부의 구성을 포함할 수 있다. 메모리 및 스토리지는 다양한 종류의 휘발성 또는 불휘발성 저장 매체를 포함할 수 있다. 예를 들어, 메모리는 ROM(Read Only Memory) 및 RAM(Random Access Memory)을 포함할 수 있다. 따라서, 본 명세서에 개시된 실시예들과 관련하여 설명된 방법 또는 알고리즘의 단계는 프로세서에 의해 실행되는 하드웨어, 소프트웨어 모듈, 또는 그 2 개의 결합으로 직접 구현될 수 있다. 소프트웨어 모듈은 RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터, 하드 디스크, 착탈형 디스크, CD-ROM과 같은 저장 매체(즉, 메모리 및/또는 스토리지)에 상주할 수도 있다. 예시적인 저장 매체는 프로세서에 커플링되며, 그 프로세서는 저장 매체로부터 정보를 판독할 수 있고 저장 매체에 정보를 기입할 수 있다. 다른 방법으로, 저장 매체는 프로세서와 일체형일 수도 있다. 프로세서 및 저장 매체는 주문형 집적회로(ASIC) 내에 상주할 수도 있다. ASIC는 사용자 단말기 내에 상주할 수 도 있다. 다른 방법으로, 프로세서 및 저장 매체는 사용자 단말기 내에 개별 컴포넌트로서 상주할 수도 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위 에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2022-0067003", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 모니터링 장치 및 이를 포함하는 차량의 구성을 나타내는 블록도이다. 도 2는 실시 예에 따른 이동 부재를 나타내는 도면이다. 도 3 및 도 4는 이동 부재가 차량에 장착된 실시 예를 나타내는 도면이다. 도 5는 본 발명의 다른 실시 예에 의한 차량 내부의 모니터링 장치를 나타내는 도면이다. 도 6은 본 발명의 실시 예에 레이더의 따른 감지 범위를 나타내는 도면이다. 도 7은 본 발명의 다른 실시 예에 의한 이동부재를 나타내는 도면이다. 도 8은 회전부재에 따른 감지 범위를 조절하는 실시 예를 설명하는 도면이다. 도 9는 틸트부의 회전에 따른 감지 범위를 조절하는 실시 예를 설명하는 도면이다. 도 10은 본 발명의 실시 예에 의한 차량 내부의 모니터링 방법을 설명하는 순서도이다. 도 11은 본 발명의 다른 실시 예에 의한 차량 내부의 모니터링 방법을 설명하는 순서도이다. 도 12는 본 발명의 일 실시 예에 따른 컴퓨팅 시스템을 나타내는 도면이다."}
