{"patent_id": "10-2020-0087286", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0009058", "출원번호": "10-2020-0087286", "발명의 명칭": "케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법 및 그 인공지능부", "출원인": "국토안전관리원", "발명자": "박성우"}}
{"patent_id": "10-2020-0087286", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 케이블에 의하여 지지되는 케이블 지지 교량(사장교, 현수교)에 구비된 케이블의 일측에 설치되어 상기케이블의 진동에 따른 가속도 데이터를 측정하는 가속도계(100)와;상기 가속도계(100)에 의하여 측정된 상기 케이블의 진동에 따른 가속도 데이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정하는 인공지능부(200)와;선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 산출부(300)와;상기 산출부(300)에서 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기준 장력을비교하여 적정성 여부를 검증하는 비교부(400)를; 포함한 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법으로서,진동수, 진폭, 시간, 온도와 같은 데이터가 입력되는 제1단계(S1)와;입력된 상기 데이터를 필터링하여 유효한 데이터를 선별하는 제2단계(S2)와;선별된 상기 데이터를 바탕으로 고유진동 모드의 차수를 표현하는 제3단계(S3)를;포함한 것을 특징으로 하는 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법."}
{"patent_id": "10-2020-0087286", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1단계는 학습해야할 데이터를 선별하여 선정하고 유효하지 않는 데이터를 필터링하는 과정을 포함하는것을 특징으로 하는 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법."}
{"patent_id": "10-2020-0087286", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1단계는 학습해야 할 데이터의 본질만 남겨두고, 학습에 방해가 되는 요소를 제거하여 학습에 맞도록 상기 데이터를 변형시키는 데이터 전처리 과정을 추가로 진행하는 것을 특징으로 하는 케이블 지지 교량 모니터링시스템의 인공지능부 학습방법."}
{"patent_id": "10-2020-0087286", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 제2단계는 상기 데이터를 필터링하여 유효한 데이터를 선별하는 은닉층의 개수를 설정하는 단계를 더 진행하는 것을 특징으로 하는 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법."}
{"patent_id": "10-2020-0087286", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제3단계는 출력값을 0에서 1 사이의 실수로 표현하며, 모든 출력값의 합이 1이 되도록 설정된 소프트맥스함수를 활용하여 고유진동 모드 여부를 판정하는 것을 특징으로 하는 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법."}
{"patent_id": "10-2020-0087286", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제3단계에서 고유진동 모드 여부를 판정시에는 고유진동수 피크치의 경계 영역에 의하여 고유진동 모드를공개특허 10-2022-0009058-3-선정하는 것을 특징으로 하는 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법."}
{"patent_id": "10-2020-0087286", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 제3단계에서 고유진동 모드 여부를 판정시에는 진동수와 진폭의 분포 영역의 형태를 활용하여 고유진동 모드의 패턴을 인식함으로써 고유진동 모드를 선정하는 것을 특징으로 하는 케이블 지지 교량 모니터링 시스템의인공지능부 학습방법."}
{"patent_id": "10-2020-0087286", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 따른 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법이 수행되는케이블 지지 교량 모니터링 시스템의 인공지능부로서,상기 인공지능부(200)는 인공신경망 알고리즘으로 구현되며 진동수, 진폭, 시간, 온도와 같은 데이터가 입력되는 입력층(210)과, 상기 입력층(210)에서 입력된 상기 데이터를 필터링하여 유효한 데이터를 선별하는 은닉층(220)과, 상기 은닉층(220)에서 선별된 상기 데이터를 바탕으로 고유진동 모드의 차수를 표현하는 출력층(230)으로 구성되는 심층신경망으로 이루어진 것을 특징으로 하는 케이블 지지 교량 모니터링 시스템의 인공지능부."}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 복수의 케이블에 의하여 지지되는 교량에 구비된 케이블의 일측에 설치되어 상기 케이블의 변위에 따 른 가속도 데이터를 측정하는 가속도계와; 상기 가속도계에 의하여 측정된 상기 케이블의 변위에 따른 가속도 데 이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동 (뒷면에 계속)"}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 건설 분야에 관한 것으로서, 상세하게는 케이블 지지 교량 모니터링 시스템의 인공지능 학습방법에 관한 것이다."}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사장교, 현수교와 같은 케이블지지 교량(이하 \"교량\")은 국가사회간접시설의 핵심이 되는 도로의 주요 시설물로 서, 설정한 설계수명 동안 안전하게 기능을 수행할 수 있도록 설계되어, 공용기간 동안의 안정성과 사용성이 확 보되도록 하고 있다. 이러한 교량은 시간이 경과함에 따라 교통 환경의 변화 및 재료의 열화 등과 같은 다양한 원인에 의해 손상을 받게 되므로, 적절한 유지 관리를 통해 수명을 연장하는 것이 필요하다. 특히, 교량의 전체적인 거동을 나타내는 케이블에 가해지는 장력은, 교량의 성능 저하, 노후도를 판단하는 근거 로서 교량의 건전성 평가에 있어서 중요한 지표가 되므로, 교량의 케이블에 가해지는 장력을 주기적으로 모니터 링 하여 안전성을 확보하는 것은 중요한 과제가 되고 있다. 이를 위하여 케이블에 의하여 지지되는 교량에서 케이블의 가속도 계측 데이터를 통하여 교량의 거동을 분석함 에 있어서 인공지능 기법을 적용하여 면밀하게 분석이 이루어지도록 하여 교량의 전체적인 거동을 모니터링하여 교량이 안정적으로 지지되도록 할 필요성이 요구되고 있다. 이를 위한 종래의 기술을 살펴보면, 종래의 실시간 학습과 호출을 위한 인공지능 시스템 및 그 처리 방법(공개 번호 제10-2019-0082645호)은 각각의 레거시 시스템으로부터 인공지능 서버로의 데이터 스트리밍전송을 데이터 핸들링 장치를 경유하여 수행하도록 설계되어 있으나, 이러한 종래 기술은 스트리밍 방식으로 전송된 데이터가 필터링없이 그대로 사용되고 있기 때문에 데이터에 대한 신뢰도가 저하된다는 문제점이 있다. 그리고, 종래의 인공지능 자가 학습 로봇(공개번호 제10-2018-0114537호)은 인식 결과 검증부의 판단 결과 매칭 결과의 정확도가 기 정해진 레벨 미만인 경우에 데이터 수신부로부터 수신된 데이터를 서버로 전송하도록 하고, 인식 결과 검증부의 판단 결과 매칭 결과의 정확도가 기 정해진 레벨 이상인 경우에 자가 학습 로봇이 기 설정 된 사물 대응 행동을 수행하도록 함으로써 인공지능을 이용한 매칭 결과의 정확도에 따라 로봇의 행동을 제어하 도록 설계되어 있으나, 이러한 종래 기술은 로봇의 행동 제어에 관한 것이므로 본 발명의 사장교 모니터링 시스 템에 적용하기가 쉽지 않다는 문제점이 있다. 따라서, 사장교 및 현수교 계측 시스템의 방대한 계측 데이터를 활용함으로써 고도의 분석기술의 적용을 활성화 시킴과 동시에 인공지능을 이용하여 계측분석 기술자와 동등 이상의 분석 성능을 확보하여 기존 계측 분석에 의"}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "한 교량의 동적거동 분석 알고리즘의 기능적 신뢰성을 향상시키기 위한 필요성이 점점 대두되고 있는 실정이다. 발명의 내용"}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 도출된 것으로서, 케이블에 의하여 지지되는 케이블 지지 교 량(사장교, 현수교)와 같은 방대한 구조물에서 케이블의 가속도 계측 데이터를 통하여 교량의 거동을 분석함에 있어서 인공지능 기법을 적용하여 면밀하게 분석함으로써 교량의 전체적인 거동을 모니터링하여 교량이 안정적 으로 지지되도록 함으로써 안전사고를 미연에 방지할 수 있도록 하는 케이블 지지 교량 모니터링 시스템의 인공 지능 학습방법을 제시하는 것을 그 목적으로 한다."}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제의 해결을 위하여, 본 발명은 복수의 케이블에 의하여 지지되는 교량에 구비된 케이블의 일측에 설치 되어 상기 케이블의 진동에 따른 가속도 데이터를 측정하는 가속도계와; 상기 가속도계에 의하여 측정된 상기 케이블의 진동에 따른 가속도 데이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정하는 인공지능부와; 선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 산출부와; 상기 산출부에서 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기준 장력을 비교하여 적정성 여부를 검증하는 비교부를; 포함한 케이블지지 교량 모니터링 시스템의 인공지능부 학습방법으로서, 진동수, 진폭, 시간, 온도와 같은 데이터가 입력되는 제1단계와; 입력된 상기 데이터를 필터링하여 유효한 데이터를 선별하는 제2단계와; 선별된 상기 데이터를 바탕 으로 고유진동 모드의 차수를 표현하는 제3단계를; 포함한 것을 특징으로 하는 케이블 지지 교량 모니터링 시스 템의 인공지능부 학습방법을 제시한다. 여기서, 상기 제1단계는 학습해야할 데이터를 선별하여 선정하고 유효하지 않는 데이터를 필터링하는 과정을 포 함할 수 있다. 그리고, 상기 제1단계는 학습해야 할 데이터의 본질만 남겨두고, 학습에 방해가 되는 요소를 제거하여 학습에 맞도록 상기 데이터를 변형시키는 데이터 전처리 과정을 추가로 진행하도록 할 수 있다. 아울러, 상기 제2단계는 상기 데이터를 필터링하여 유효한 데이터를 선별하는 은닉층의 개수를 설정하는 단계 를 더 진행하도록 할 수 있다. 또한, 상기 제3단계는 출력값을 0에서 1 사이의 실수로 표현하며, 모든 출력값의 합이 1이 되도록 설정된 소프 트맥스 함수를 활용하여 고유진동 모드 여부를 판정하도록 할 수 있다. 아울러, 상기 제3단계에서 고유진동 모드 여부를 판정시에는 고유진동수 피크치의 경계 영역에 의하여 고유진동 모드를 선정할 수 있다. 그리고, 상기 제3단계에서 고유진동 모드 여부를 판정시에는 진동수와 진폭의 분포 영역의 형태를 활용하여 고 유진동 모드의 패턴을 인식함으로써 고유진동 모드를 선정할 수 있다. 상기 과제의 해결을 위하여, 본 발명은 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법이 수행되는 케이블 지지 교량 모니터링 시스템의 인공지능부로서, 상기 인공지능부는 인공신경망 알고리즘으로 구현되며 진 동수, 진폭, 시간, 온도와 같은 데이터가 입력되는 입력층과, 상기 입력층에서 입력된 상기 데이터를 필터링하 여 유효한 데이터를 선별하는 은닉층과, 상기 은닉층에서 선별된 상기 데이터를 바탕으로 고유진동 모드의 차수 를 표현하는 출력층으로 구성되는 심층신경망으로 이루어진 것을 특징으로 하는 케이블 지지 교량 모니터링 시 스템의 인공지능부를 제공한다."}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 케이블에 의하여 지지되는 케이블 지지 교량(사장교, 현수교)와 같은 방대한 구조물에서 케이블의 가 속도 계측 데이터를 통하여 교량의 거동을 분석함에 있어서 인공지능 기법을 적용하여 면밀하게 분석함으로써 교량의 전체적인 거동을 모니터링하여 케이블 지지 교량이 안정적으로 지지되도록 함으로써 안전사고를 미연에 방지할 수 있도록 하는 효과가 있다. 그리고, 본 발명은 케이블 지지 교량(사장교, 현수교)의 거동을 분석함에 있어서 반복적으로 학습이 이루어진 인공지능을 적용하여 분석이 이루어지도록 함으로써 분석 결과에 대한 신뢰도를 향상시킬 수 있는 효과가 있다."}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부도면을 참조하여 본 발명의 실시예에 관하여 상세히 설명한다. 도 1은 본 발명의 일 실시예에 따른 케이블 지지 교량 모니터링 시스템의 연결구조를 개략적으로 도시한 개략도 이고, 도 2는 도 1의 케이블 지지 교량 모니터링 시스템의 인공지능부의 구성을 개략적으로 도시한 개략도이며, 도 3은 도 1의 인공지능부에서 가속도 데이터에 인공지능 기법을 적용하여 유효 고유동진수를 선정하는 과정을 도시한 개념도이며, 도 4는 도 2의 케이블 지지 교량 모니터링 시스템의 인공지능부의 학습방법을 순차적으로 기재한 흐름도이고, 도 5는 본 발명의 일 실시예에 따른 케이블 지지 교량 모니터링 시스템을 이용하여 케이블 지지 교량을 모니터링하는 과정을 개략적으로 도시한 개략도이고, 도 6은 본 발명의 일 실시예에 따른 케이블 지지 교량 모니터링 시스템을 이용하여 케이블 지지 교량을 모니터링하는 과정을 순차적으로 기재한 흐름도이다. 우선, 도 1에 도시한 바와 같이, 본 발명에 따른 케이블 지지 교량 모니터링 시스템의 전체적인 구성은, 복수의 케이블에 의하여 지지되는 교량에 구비된 케이블의 일측에 설치되어 상기 케이블의 진동에 따른 가속도 데이터 를 측정하는 가속도계와; 상기 가속도계에 의하여 측정된 상기 케이블의 진동에 따른 가속도 데이터 에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수 를 선정하는 인공지능부와; 선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산 하는 산출부와; 상기 산출부에서 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기준 장력을 비교하여 적정성 여부를 검증하는 비교부를; 포함하여 구성되어 있다. 교량에 구비된 케이블의 일측에 설치되는 가속도계는 케이블 지지 교량(사장교, 현수교)를 지지하는 케이 블의 고유진동수, 감쇠 등 주기적 동적 특성을 확인하기 위하여 설치되는 장치이다. 인공지능부는 가속도계에 의하여 측정된 상기 케이블의 진동에 따른 가속도 데이터에 인공지능 기법 을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정하는 역할 을 한다. 도 3에 도시된 바와 같이, 인공지능부를 이용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정시에는 PP기법으로 계측된 응답신호를 퓨리에 변환시킴으로써 상기 유효 고유진 동수를 선정하게 된다. 교량 계측시스템의 가속도 데이터는 응답 신호를 이용하여 고유 특성치를 추출하는 방법이 적용되고 있으며, 고 유치 추출기법은 PP기법(peak-picking)으로서 계측된 응답신호를 퓨리에 변환(Fourier transformation)시켜서 스펙트럼의 첨두 주파수를 고유진동수로 취하게 된다. 주파수 분석 및 진동수 피크 추출 모듈을 이용하여 진동수의 피크치를 추출하고 여러 시간대의 진동수를 동일한 그래프에 표현하고, 이러한 과정을 시간대별로 확대하면 가속도계의 진동수 피크치가 유사한 진동수의 영역에 분포되는 특성을 확인할 수 있다. 고유진동수는 케이블의 진동 특성에 의해 일정한 진동수에 대한 경계 범위를 형성하게 되며 고유진동수의 경계 범위는 인공지능 학습용 데이터의 구축을 위한 기준으로 활용될 수 있다. 이러한 케이블의 진동 특성은 에너지법칙에 근거하여 각 고유진동수는 모드 차수별로 등간격으로 분포하게 되는 데, 이러한 특성은 가속도계의 동적 특성 분석에 의해 확인되며 충분한 학습용 데이터가 만들어질 경우에 케이 블의 진동 모드에 대한 피크치는 명확해지게 된다. 도 2에 도시된 바와 같이, 이러한 인공지능부는 인공신경망 알고리즘으로 구현되며 진동수, 진폭, 시간, 온도와 같은 데이터가 입력되는 입력층과, 상기 입력층에서 입력된 상기 데이터를 필터링하여 유효한 데이터를 선별하는 은닉층과, 상기 은닉층에서 선별된 상기 데이터를 바탕으로 고유진동 모드의 차수 를 표현하는 출력층으로 구성되는 심층신경망으로 이루어진다. 입력층은 학습용 데이터의 주요 변수 항목인 진동수, 진폭을 우선 고려하였으며, 이후 시간, 온도 등에 대 하여 추가로 설정할 수 있도록 하며, 입력 데이터는 학습에 맞도록 변형시키는 데이터 전처리 과정을 수행하게 된다. 데이터 전처리는 주로 학습 데이터의 본질만을 남겨두고, 학습에 방해가 되는 요소를 제거하는 역할을 하게 되 며, 이러한 데이터 전처리를 위해 가장 간편하고 보편적인 방법인 스케일링 기법을 적용한다. 은닉층을 구현하기 위해서는 은닉층의 개수 설정, 활성화함수 선택 및 신경망 가중치값의 초기화가 필요하 다. 인공신경망에서는 다양한 문제들을 은닉층을 하나만 설정하여도 원하는 결과를 얻을 수 있는데, 이는 은닉층이 하나인 신경망도 뉴런 수가 충분하면 아주 복잡한 함도도 모델링 할 수 있기 때문이다. 하지만, 심층신경망을 이용하여 복잡한 모델링을 하는 경우에는 얕은 신경망보다 휠씬 적은 수의 뉴런의 사용으 로 더욱 빠르게 훈련이 가능하기 때문에 복잡한 문제의 경우에는 과대적합이 생길 때까지 점진적으로 은닉층 의 개수를 늘리면서 검토하는 것이 바람직하다. 입력층과 출력층의 뉴런 수는 해당 작업에 필요한 입력과 출력의 형태에 따라 결정되며, 은닉층(22 0)의 구성 방식은 일반적으로 각 층의 뉴런을 점점 줄여서 깔대기처럼 구성하는데 저수준의 많은 특성이 고수준 의 적은 특성으로 합쳐질 수 있기 때문이다. 은닉층의 활성화 함수는 Sigmoid와 ReLU 활성화 함수를 일반적으로 사용하게 되는데, Sigmoid 함수는 레이 어를 깊게 쌓으면 파라미터의 업데이트가 정상적으로 이루어지지 않는 문제를 발생시키기 때문에 이러한 문제를 개선하기 위해 본 발명의 은닉층의 경우에는 ReLU 활성화 함수를 사용한다. 이러한 ReLU 활성화 함수는 출력에 대한 최대값이 없다는 점에서 다른 활성화 함수보다는 계산이 조금 더 빠르 다는 효과가 있으며, 결과에 대한 예측률이 높다는 장점도 있다. 출력층은 노드수가 3으로 지정되어 있는데, 이러한 출력층에는 고유진동 모드의 차수를 표현하게 되 는데, 모드 차수를 바로 표현하는 것이 아니라 소프트맥스 함수를 활용하여 확률에 의해 모드의 확률값을 출력 하게 되고, 이 출력값의 분석에 의해 고유진동 모드의 차수를 결정하는 방식이 사용된다. 출력층의 활성화 함수로 사용하는 소프트맥스 함수는 분류와 회귀 모델의 두 종류에 모두 사용 가능하지만 분류 모델에 더욱 좋은 결과를 보이는 특징이 있다. 따라서, 고유진동 모드를 추정하는 기능은 데이터의 분류 기능에 의해 출력되는 구조이므로 소프트맥스 함수의 이용이 적정하게 된다. 소프트맥스 함수는 출력값을 0에서 1.0 사이의 실수로 표현하는 구조이며, 소프트맥스 함수에 의한 모든 출력값 의 합은 1이 되도록 설정되어 있는데, 출력값의 합이 1이 된다는 것은 소프트맥스 함수의 중요한 특징에 해당되 며 이러한 특징을 활용하여 출력값을 확률로 해석할 수 있게 된다. 이러한 구성을 갖는 본 발명에 따른 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법을 도 4를 참고하 여 설명하면 다음과 같다. 우선, 진동수, 진폭, 시간, 온도와 같은 데이터가 입력되는 제1단계(S1)를 진행하는데, 상기 제1단계는 학습해 야할 데이터를 선별하여 선정하고 유효하지 않는 데이터를 필터링하는 과정을 포함한다. 데이터 필터링 과정이 완료되면 학습해야 할 데이터의 본질만 남겨두고, 학습에 방해가 되는 요소를 제거하여 학습에 맞도록 상기 데이터를 변형시키는 데이터 전처리 과정을 추가로 진행하게 된다. 그리고, 입력된 상기 데이터를 필터링하여 유효한 데이터를 선별하는 제2단계(S2)를 진행한 후에, 상기 데이터 를 필터링하여 유효한 데이터를 선별하는 은닉층의 개수를 설정하는 단계를 더 진행하게 된다. 그 후, 선별된 상기 데이터를 바탕으로 고유진동 모드의 차수를 표현하는 제3단계(S3)를 진행함으로써 케이블 지지 교량 모니터링 시스템의 인공지능부 학습방법이 완료된다. 상기 제3단계에서 고유진동 모드 여부를 판정시에는 고유진동수 피크치의 경계 영역에 의하여 고유진동 모드를 선정할 수도 있고, 진동수와 진폭의 분포 영역의 형태를 활용하여 고유진동 모드의 패턴을 인식함으로써 고유진 동 모드를 선정할 수도 있다. 한편, 산출부는 선정된 상기 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 역할을 한다. 상기 케이블에 가해지는 장력을 계산시에는 , 또는 와 같은 수식이 사용되는데, 상기 수식은 아래의 장력과 고유진동수 관계를 활용한 수식으로부터 도출된다. - 아 래 -"}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, T는 장력, w는 단위길이당중량(kN/m), g는 중력가속도(9.82m/s2), L은 유효길이(m), f는 진동수, n은 진동모드이다. 또한, 다중모드를 사용하여 회귀분석을 통하여 T의 값을 구할 수 있으며 아래와 같은 수식을 이용한다."}
{"patent_id": "10-2020-0087286", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서 은 n차 모드에 대한 진동수, EI는 케이블의 휨강성으로서, 위의 식에 따라 a와 b를 구하면 그래프 상의 기울기(a)와 절편(b)을 통해 장력 T와 휨강성 EI를 산정할 수 있다. 비교부는 산출부에서 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기 준 장력을 비교하여 적정성 여부를 검증하는 역할을 한다. 도 5에 도시된 바와 같이, 인공지능 학습부는 상기 비교부에서 상기 케이블에 가해지는 장력에 대한 검증이 완료되면 반복적으로 상기 인공지능부에서 재학습이 이루어지도록 하여 고유모드에 대한 패턴을 인 식하도록 하는 역할을 한다. 인공지능 학습부에서 인공지능부에 학습이 이루어지도록 하는 과정은 케이블에 부착된 가속도계로부 터 원시데이터를 FFT에 의해 주파수로 변환하고 진동수와 진폭을 학습 데이터로 구성하여 이를 반복적으로 입력 하여 고유진동 모드에 대한 패턴을 인식하는 방법인 사용된다. 관리부는 상기 고유모드에 대한 패턴의 인식이 완료되면 검증 대상 주파수를 입력하여 상기 검증 대상 주 파수에 대한 고유진동 모드와 동일 패턴 진동수를 산출함으로써 고유진동 모드를 예측하여 교량의 관리가 지속 적으로 이루어지도록 하는 역할을 한다. 이러한 괸리부에서는 인공지능부에 의해 고유진동 모드에 해당하는 진동수의 패턴을 인식하여 학습이 이루어지도록 하고, 학습 모델에 검증용 주파수를 입력할 경우 고유진동 모드와 동일한 패턴의 진동수를 고유진 동 모드로 판정하는 방식이 사용된다. 상술한 바와 같은 구성을 갖는 본 발명의 일 실시예에 따른 케이블 지지 교량 모니터링 시스템의 인공지능 학습 방법을 이용하여 케이블 지지 교량을 모니터링하는 과정을 도 6을 참조하여 설명하면 다음과 같다. 우선, 교량의 케이블 일측에 설치된 가속도계를 이용하여 상기 교량을 지지하는 케이블의 진동에 따른 가속도 데이터를 측정하여 수집하는 제1단계(S1)를 진행하게 된다. 그리고, 가속도 데이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모 드별 유효 고유진동수를 선정하는 제2단계(S2)를 진행하게 된다. 상기 제2단계에서는 상술한 바와 같이, PP기법으로 계측된 응답신호를 퓨리에 변환시킴으로써 상기 유효 고유진 동수를 선정하게 된다. 모드별 유효 고유진동수의 선정이 완료되면 선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 제3단계(S3)를 진행하게 된다. 상기 제3단계에서 상기 케이블에 가해지는 장력을 계산시에는 또는 와 같은 수식이 사용된다. 그 후, 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기준 장력을 비교하여 적정 성 여부를 검증하는 제4단계(S4)를 진행한다. 그리고, 상기 케이블에 가해지는 장력에 대한 검증이 완료되면 반복적으로 인공지능부에서 재학습이 이루어지도 록 하여 고유모드에 대한 패턴을 인식하도록 하는 제5단계(S5)를 진행한다. 마지막으로 상기 고유모드에 대한 패턴의 인식이 완료되면 검증 대상 주파수를 입력하여 상기 검증 대상 주파수 에 대한 고유진동 모드와 동일 패턴 진동수를 산출함으로써 고유모드를 예측하여 교량의 관리가 지속적으로 이 루어지도록 하는 제6단계(S6)를 진행함으로써 케이블 지지 교량 모니터링 시스템의 인공지능 학습방법 이용하여 케이블 지지 교량을 모니터링하는 과정이 완료된다. 상술한 바와 같은 구성을 갖는 본 발명에 따른 케이블 지지 교량 모니터링 시스템의 인공지능 학습방법은 케이 블에 의하여 지지되는 교량과 같은 방대한 구조물에서 케이블의 가속도 계측 데이터를 통하여 교량의 거동을 면 밀하게 분석함으로써 교량의 전체적인 거동을 정확하게 모니터링하여 교량이 안정적으로 지지되도록 함으로써 안전사고를 미연에 방지할 수 있게 된다. 이상은 본 발명에 의해 구현될 수 있는 바람직한 실시예의 일부에 관하여 설명한 것에 불과하므로, 주지된 바와 같이 본 발명의 범위는 위의 실시예에 한정되어 해석되어서는 안 될 것이며, 위에서 설명된 본 발명의 기술적 사상과 그 근본을 함께 하는 기술적 사상은 모두 본 발명의 범위에 포함된다고 할 것이다."}
{"patent_id": "10-2020-0087286", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 케이블 지지 교량 모니터링 시스템의 연결구조를 개략적으로 도시한 개략도 이고, 도 2는 도 1의 케이블 지지 교량 모니터링 시스템의 인공지능부의 구성을 개략적으로 도시한 개략도이며, 도 3은 도 1의 인공지능부에서 가속도 데이터에 인공지능 기법을 적용하여 유효 고유동진수를 선정하는 과정을 도시한 개념도이며, 도 4는 도 2의 케이블 지지 교량 모니터링 시스템의 인공지능부의 학습방법을 순차적으로 기재한 흐름도이고, 도 5는 본 발명의 일 실시예에 따른 케이블 지지 교량 모니터링 시스템을 이용하여 케이블 지지 교량을 모니터 링하는 과정을 개략적으로 도시한 개략도이고, 도 6은 본 발명의 일 실시예에 따른 케이블 지지 교량 모니터링 시스템을 이용하여 케이블 지지 교량을 모니터 링하는 과정을 순차적으로 기재한 흐름도이다."}
