{"patent_id": "10-2023-0135899", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0052747", "출원번호": "10-2023-0135899", "발명의 명칭": "무선 통신 시스템에서 네트워크 에너지 소모 절감 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "박성진"}}
{"patent_id": "10-2023-0135899", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 제어 신호 처리 방법에 있어서,기지국으로부터 전송되는 제1 제어 신호를 수신하는 단계;상기 수신된 제1 제어 신호를 처리하는 단계; 및상기 처리에 기반하여 생성된 제2 제어 신호를 상기 기지국으로 전송하는 단계를 포함하는, 제어 신호 처리 방법."}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 본 개시는 무선 통신 시스템에 관한 것으로, 보다 구체적으로, 무선 통신 시스템에서 멀티 패스 릴레이를 이용하는 방법과 장치 에 관한 것이다. 무선 통신 시스템에서 제어 신호 처리 방법에 있어서, 기지국으로부터 전송되는 제1 제어 신호 를 수신하는 단계; 상기 수신된 제1 제어 신호를 처리하는 단계; 및 상기 처리에 기반하여 생성된 제2 제어 신호 를 상기 기지국으로 전송하는 단계를 포함한다."}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 단말과 기지국의 동작에 관한 것이다. 구체적으로, 본 개시는 무선 통신 시스 템에서 데이터 정보 구성/보고 방법 및 이를 수행할 수 있는 장치에 관한 것이다."}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz, THz) 대역(예를 들어, 95GHz에서 3 테라헤르츠 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다."}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "개시된 실시예는 이동 통신 시스템에서 서비스를 효과적으로 제공할 수 있는 장치 및 방법을 제공하고자 한다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "개시된 실시예는 무선 통신 시스템에서 제어 신호 처리 방법에 있어서, 기지국으로부터 전송되는 제1 제어 신호 를 수신하는 단계; 상기 수신된 제1 제어 신호를 처리하는 단계; 및 상기 처리에 기반하여 생성된 제2 제어 신 호를 상기 기지국으로 전송하는 단계를 포함하는 방법을 제공할 수 있다."}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시 예에 따르면, 이동통신 시스템에서 서비스를 효과적으로 제공할 수 있는 장치 및 방법이 제공될 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 실시예를 설명함에 있어서 본 개시가 속하는 기술 분야에 익히 알려져 있고 본 개시와 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 개시의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부된 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성 요 소에는 동일한 참조 번호를 부여하였다. 본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시의 개시가 완전하도록 하고, 본 개시가 속하"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시 는 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 또 한 본 개시를 설명함에 있어서 관련된 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐 릴 수 있다고 판단된 경우 그 상세한 설명은 생략한다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하 여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 본 개시의 실시 예들을 설명함에 있어서, 이동통신 규격 표준화 단체인 3GPP(3rd Generation Partnership Project)가 명시하고 있는 5G 이동통신 규격 상의 무선 접속망인 New Radio(NR)과 코어 망인 패킷 코어 5G System, 혹은 5G Core Network, 혹은 NG Core(Next Generation Core)를 주된 대상으로 하지만, 본 개시의 주요 한 요지는 유사한 기술적 배경을 가지는 여타의 통신 시스템에도 본 개시의 범위를 크게 벗어 나지 아니 하는 범위에서 약간의 변형으로 적용 가능하며, 이는 본 개시의 기술 분야에서 숙련된 기술적 지식을 가진 자의 판단 으로 가능 할 것이다. 이하, 설명의 편의를 위하여, 3GPP 규격(5G, NR, LTE 또는 이와 유사한 시스템의 규격)에서 정의하고 있는 용어 및 명칭들이 일부 사용될 수 있다. 하지만, 본 개시가 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격 에 따르는 시스템에도 동일하게 적용될 수 있다. 이하, 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity, 네트워크 엔티티)들 을 지칭하는 용어, 메시지들을 지칭하는 용어, 네트워크 엔티티들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시에서 사용하는 용어들에 한정 되는 것은 아니며, 동등한 기술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 이하, 기지국은 단말의 자원할당을 수행하는 주체로서, gNode B, eNode B, Node B, BS (Base Station), 무선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말은 UE (User Equipment),MS (Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기능을 수행할 수 있는 멀티미디어시스템을 포함 할 수 있다. 본 개시에서 하향링크(Downlink; DL)는 기지국이 단말에게 전송하는 신호의 무선 전송경로이고, 상 향링크는(Uplink; UL)는 단말이 기국에게 전송하는 신호의 무선 전송경로를 의미한다. 또한, 이하에서 LTE 또는 LTE-A 시스템을 일예로서 설명할 수도 있지만, 유사한 기술적 배경 또는 채널형태를 갖는 여타의 통신시스템에 도 본 개시의 실시예가 적용될 수 있다. 예를 들어 LTE-A 이후에 개발되는 5세대 이동통신 기술(5G, new radio, NR) 또는 6세대 이동통신 기술(6G) 이에 포함될 수 있으며, 이하의 5G 또는 6G는 기존의 LTE, LTE-A 및 유사한 다른 서비스를 포함하는 개념일 수도 있다. 또한, 본 개시는 숙련된 기술적 지식을 가진 자의 판단으로써 본 개 시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기 타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴 퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예를 들면, 잇달아 도시되어 있는 두 개의 블 록들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으 로 수행되는 것도 가능하다. 이때, 본 실시예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들 을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있 다. 또한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 통신 시 스템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 4G 네트워크 이후 (Beyond 4G Network) 통신 시스템 또는 LTE 시스템 이후 (Post LTE) 이후의 시스템이라 불리어지고 있다. 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 초고주파(mmWave) 대역 (예를 들어, 60기가(60GHz) 대역과 같은)에서의 구현이 고려되고 있다. 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍(beamforming), 거대 배열 다 중 입출력(massive MIMO), 전차원 다중입출력(Full Dimensional MIMO: FD-MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 및 대규모 안테나 (large scale antenna) 기술들이 논의되 고 있다. 또한 시스템의 네트워크 개선을 위해, 5G 통신 시스템에서는 진화된 소형 셀, 개선된 소형 셀 (advanced small cell), 클라우드 무선 액세스 네트워크 (cloud radio access network: cloud RAN), 초고밀도 네트워크 (ultra-dense network), 기기 간 통신 (Device to Device communication: D2D), 무선 백홀 (wireless backhaul), 이동 네트워크 (moving network), 협력 통신 (cooperative communication), CoMP (CoordinatedMulti-Points), 및 수신 간섭제거 (interference cancellation) 등의 기술 개발이 이루어지고 있다. 이 밖에도, 5G 시스템에서는 진보된 코딩 변조(Advanced Coding Modulation: ACM) 방식인 FQAM (Hybrid FSK and QAM Modulation) 및 SWSC (Sliding Window Superposition Coding)과, 진보된 접속 기술인 FBMC(Filter Bank Multi Carrier), NOMA(non-orthogonal multiple access), 및 SCMA(sparse code multiple access) 등이 개발되 고 있다. 한편, 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 IoT(Internet of Things, 사물인터넷) 망으로 진화하고 있다. 클라우드 서버 등과 의 연결을 통한 빅데이터(Big data) 처리 기술 등이 IoT 기술에 결합된 IoE (Internet of Everything) 기술도 대두되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소 들이 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크(sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 연구되고 있다. IoT 환경에서는 연결된 사물들에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능 형 IT(Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT(information technology)기술과 다양 한 산업 간의 융합 및 복합을 통하여 스마트홈, 스마트 빌딩, 스마트 시티, 스마트 카 또는 커넥티드 카, 스마 트 그리드, 헬스 케어, 스마트 가전, 첨단의료서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템 (5세대 통신 시스템 또는 New Radio (NR))을 IoT 망에 적용하기 위한 다양한 시도들이 이 루어지고 있다. 예를 들어, 센서 네트워크(sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 5G 통신 기술인 빔 포밍, MIMO 및 어레이 안테나 등의 기법에 의 해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처리 기술로써 클라우드 무선 액세스 네트워크(cloud RAN)가 적용되는 것도 3eG 기술과 IoT 기술 융합의 일 예라고 할 수 있을 것이다. 상술한 것과 무선통신 시스템의 발전에 따라 다양한 서비스를 제공할 수 있게 됨으로써, 이러한 서비스들을 원 활하게 제공하기 위한 방안이 요구되고 있다. 무선 통신 시스템은 초기의 음성 위주의 서비스를 제공하던 것에서 벗어나 예를 들어, 3GPP의 HSPA(High Speed Packet Access), LTE(Long Term Evolution 또는 E-UTRA (Evolved Universal Terrestrial Radio Access)), LTE-Advanced (LTE-A), LTE-Pro, 3GPP2의 HRPD(High Rate Packet Data), UMB(Ultra Mobile Broadband), 및 IEEE의 802.16e 등의 통신 표준과 같이 고속, 고품질의 패킷 데이터 서비스를 제공하는 광대역 무선 통신 시스 템으로 발전하고 있다. 상기 광대역 무선 통신 시스템의 대표적인 예로, LTE 시스템에서는 하향링크(Downlink; DL)에서는 OFDM(Orthogonal Frequency Division Multiplexing) 방식을 채용하고 있고, 상향링크(Uplink; UL)에서는 SC- FDMA(Single Carrier Frequency Division Multiple Access) 방식을 채용하고 있다. 상향링크는 단말(UE(User Equipment) 또는 MS(Mobile Station))이 기지국(eNode B, 또는 base station(BS))으로 데이터 또는 제어신호를 전송하는 무선링크를 뜻하고, 하향링크는 기지국이 단말로 데이터 또는 제어신호를 전송하는 무선링크를 뜻한다. 상기와 같은 다중 접속 방식은, 통상 각 사용자 별로 데이터 또는 제어정보를 실어 보낼 시간-주파수 자원을 서로 겹치지 않도록, 즉 직교성 (Orthogonality)이 성립하도록, 할당 및 운용함으로써 각 사용자의 데이 터 또는 제어정보를 구분할 수 있다. LTE 이후의 향후 통신 시스템으로서, 즉, 5G 통신시스템은 사용자 및 서비스 제공자 등의 다양한 요구 사항을 자유롭게 반영할 수 있어야 하기 때문에 다양한 요구사항을 동시에 만족하는 서비스가 지원되어야 한다. 5G 통 신시스템을 위해 고려되는 서비스로는 향상된 모바일 광대역 통신(enhanced Mobile Broadband, eMBB), 대규모 기계형 통신(massive Machine Type Communication, mMTC), 초신뢰 저지연 통신(Ultra Reliability Low Latency Communciation, URLLC) 등이 있다. eMBB는 기존의 LTE, LTE-A 또는 LTE-Pro가 지원하는 데이터 전송 속도보다 더욱 향상된 데이터 전송 속도를 제 공하는 것을 목표로 한다. 예를 들어, 5G 통신시스템에서 eMBB는 하나의 기지국 관점에서 하향링크에서는 20Gbps의 최대 전송 속도(peak data rate), 상향링크에서는 10Gbps의 최대 전송 속도를 제공할 수 있어야 한다. 또한 5G 통신시스템은 최대 전송 속도를 제공하는 동시에, 증가된 단말의 실제 체감 전송 속도(User perceived data rate)를 제공해야 한다. 이와 같은 요구 사항을 만족시키기 위해, 더욱 향상된 다중 안테나 (Multi Input Multi Output, MIMO) 전송 기술을 포함하여 다양한 송수신 기술의 향상을 요구한다. 또한 LTE가 사용하는 2GHz 대역에서 최대 20MHz 전송대역폭을 사용하여 신호를 전송하는 반면에, 5G 통신시스템은 3~6GHz 또는 6GHz 이상 의 주파수 대역에서 20MHz 보다 넓은 주파수 대역폭을 사용함으로써 5G 통신시스템에서 요구하는 데이터 전송속도를 만족시킬 수 있다. 동시에, 5G 통신시스템에서 사물 인터넷(Internet of Thing, IoT)와 같은 응용 서비스를 지원하기 위해 mMTC가 고려되고 있다. mMTC는 효율적으로 사물 인터넷을 제공하기 위해 셀 내에서 대규모 단말의 접속 지원, 단말의 커버리지 향상, 향상된 배터리 시간, 단말의 비용 감소 등이 요구된다. 사물 인터넷은 여러 가지 센서 및 다양 한 기기에 부착되어 통신 기능을 제공하므로 셀 내에서 많은 수의 단말(예를 들어, 1,000,000 단말/km2)을 지원 할 수 있어야 한다. 또한 mMTC를 지원하는 단말은 서비스의 특성상 건물의 지하와 같이 셀이 커버하지 못하는 음영지역에 위치할 가능성이 높으므로 5G 통신시스템에서 제공하는 다른 서비스 대비 더욱 넓은 커버리지를 요 구할 수 있다. mMTC를 지원하는 단말은 저가의 단말로 구성되어야 하며, 단말의 배터리를 자주 교환하기 힘들기 때문에 10~15년과 같이 매우 긴 배터리 생명시간(battery life time)이 요구될 수 있다. 마지막으로, URLLC의 경우, 특정한 목적(mission-critical)으로 사용되는 셀룰라 기반 무선 통신 서비스이다. 예를 들어, 로봇(Robot) 또는 기계 장치(Machinery)에 대한 원격 제어(remote control), 산업 자동화 (industrial automation), 무인 비행장치(Unmaned Aerial Vehicle), 원격 건강 제어(Remote health care), 비 상 상황 알림(emergency alert) 등에 사용되는 서비스 등을 고려할 수 있다. 따라서 URLLC가 제공하는 통신은 매우 낮은 저지연 및 매우 높은 신뢰도 제공해야 한다. 예를 들어, URLLC을 지원하는 서비스는 0.5 밀리초 보다 작은 무선 접속 지연시간(Air interface latency)를 만족해야 하며, 동시에 10-5 이하의 패킷 오류율(Packet Error Rate)의 요구사항을 갖는다. 따라서, URLLC을 지원하는 서비스를 위해 5G 시스템은 다른 서비스보다 작은 전송 시간 구간(Transmit Time Interval, TTI)를 제공해야 하며, 동시에 통신 링크의 신뢰성을 확보하기 위해 주파수 대역에서 넓은 리소스를 할당해야 하는 설계사항이 요구될 수 있다. 5G의 세가지 서비스들, 즉 eMBB, URLLC, mMTC는 하나의 시스템에서 다중화되어 전송될 수 있다. 이 때, 각각의 서비스들이 갖는 상이한 요구사항을 만족시키기 위해 서비스간에 서로 다른 송수신 기법 및 송수신 파라미터를 사용할 수 있다. 물론 5G는 전술한 세가지 서비스들에 제한되지 않는다. 이하 본 개시의 실시 예를 첨부한 도면과 함께 상세히 설명한다. 이하, 기지국은 단말의 자원할 당을 수행하는 주체로서, hNode B, hNB, iNode B, iNB, gNode B, gNB, eNode B, Node B, BS (Base Station), 무선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말은 UE (User Equipment), MS (Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기능을 수행할 수 있는 멀티미디어시스템을 포함할 수 있다. 이하에서는 5G 시스템 또는 차세대 통신 시스템 (예를 들어, 6G)을 일례로서 본 개시의 실시예를 설명 하지만, 유사한 기술적 배경 또는 채널형태를 갖는 여타의 통신시스템에도 본 개시의 실시예가 적용될 수 있다. 예를 들어 LTE 또는 LTE-A 이동통신 및 5G 이후에 개발되는 이동통신 기술이 이에 포함될 수 있을 것이다. 따라 서, 본 개시의 실시예는 본 기술 분야의 통상의 기술자의 판단으로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있다. 본 개시에서의 내용은 FDD 및 TDD 시스템에서 적용이 가능한 것이다. 또한, 본 개시를 설명함에 있어서 관련된 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단된 경우 그 상세한 설명은 생략한다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려 하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 이하 본 개시를 설명함에 있어서, 상위 계층 시그널링이라 함은 하기의 시그널링 중에서 적어도 하나 또는 하나 이상의 조합에 해당하는 시그널링 일 수 있다. - MIB (Master Information Block) - SIB (System Information Block) 또는 SIB X (X=1, 2, 쪋) - RRC (Radio Resource Control) - MAC (Medium Access Control) CE (Control Element) 또한, L1 시그널링이라 함은 하기의 물리 계층 채널 또는 시그널링을 이용한 시그널링 방법 중에서 적어도 하나 또는 하나 이상의 조합에 해당하는 시그널링 일 수 있다. - PDCCH (Physical Downlink Control Channel) - DCI (Downlink Control Information) - 단말-특정 (UE-specific) DCI - 그룹 공통 (Group common) DCI - 공통 (Common) DCI - 스케쥴링 DCI (예를 들어 하향링크 또는 상향링크 데이터를 스케쥴링하는 목적으로 사용되는 DCI) - 비스케쥴링 DCI (예를 들어 하향링크 또는 상향링크 데이터를 스케쥴링하는 목적이 아닌 DCI) - PUCCH (Physical Uplink Control Channel) - UCI (Uplink Control Information) 이하 본 개시에서 A 와 B 간 우선순위를 결정한다 함은 미리 정해진 우선순위 규칙(priority rule)에 따라 더 높은 우선순위를 가지는 것을 선택하여 그에 해당하는 동작을 수행하거나 또는 더 낮은 우선순위를 가지는 것에 대한 동작을 생략(omit or drop)하는 등 다양하게 언급될 수 있다. 이하 본 개시에서는 다수의 실시예를 통하여 상기 예제들을 설명하나 이는 독립적인 것들이 아니며 하나 이상의 실시 예가 동시에 또는 복합적으로 적용되는 것이 가능하다. [NR 시간-주파수 자원] 이하에서는 5G 또는 차세대 통신 시스템의 프레임 구조에 대해 도면을 참조하여 보다 구체적으로 설명한다. 도 1은 본 개시의 실시예에 따른 5G 또는 차세대 통신 시스템에서 데이터 또는 제어채널이 전송되는 무선 자원 영역인 시간-주파수 영역의 기본 구조를 도시한 도면이다. 도 1의 가로축은 시간 영역을, 세로축은 주파수 영역을 나타낸다. 시간 및 주파수 영역에서 자원의 기본 단위는 자원 요소(Resource Element, RE, 101)로서 시간 축으로 1 OFDM(Orthogonal Frequency Division Multiplexing) 심볼 및 주파수 축으로 1 부반송파(Subcarrier)로 정의될 수 있다. 주파수 영역에서 (일례로 12)개의 연속된 RE들은 하나의 자원 블록(Resource Block, RB, 104)을 구성할 수 있다. 도 2는 본 개시의 실시예에 따른 무선 통신 시스템에서 프레임, 서브프레임, 슬롯 구조를 도시한 도면이다. 도 2에는 프레임(Frame, 200), 서브프레임(Subframe, 201), 슬롯(Slot, 202) 구조의 일 예가 도시되어 있다. 1 프레임은 10ms로 정의될 수 있다. 1 서브프레임은 1ms로 정의될 수 있으며, 따라서 1 프레임은 총 10개의 서브프레임으로 구성될 수 있다. 1 슬롯(202, 203)은 14개의 OFDM 심볼로 정의될 수 있다(즉 1 슬롯 당 심볼 수( )=14). 1 서브프레임은 하나 또는 복수 개의 슬롯(202, 203)으로 구성될 수 있으며, 1 서브프레임당 슬롯(202, 203)의 개수는 부반송파 간격에 대한 설정 값 μ(204, 205)에 따라 다를 수 있 다. 도 2의 일 예에서는 부반송파 간격 설정 값으로 μ=0인 경우와 μ=1인 경우가 도시되어 있다. μ =0일 경우, 1 서브프레임은 1개의 슬롯으로 구성될 수 있고, μ=1일 경우, 1 서브프레임 은 2개의 슬롯으로 구성될 수 있다. 즉 부반송파 간격에 대한 설정 값 μ에 따라 1 서브프레임 당 슬 롯 수( )가 달라질 수 있고, 이에 따라 1 프레임 당 슬롯 수( )가 달라질 수 있다. 각 부반송파 간 격 설정 μ에 따른 및 는 하기의 표 1로 정의될 수 있다. [표 1]"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[QoS 개념] 이하에서는 본 개시의 실시예에 따른 5G 또는 차세대 통신 시스템(예를 들어, 6G)에서 QoS(Quality of Servic e)에 대한 설정 및 제어 방법들에 대해서 설명한다. 본 개시에서 설명하는 5G 용어는 5G 통신 기술만을 한정하 지 않으며, 그 이후 차세대 통신 시스템을 의미하는 것이 가능할 수 있다. 또는, 6G로 대체되어 적용하는 것이 충분히 가능할 수 있다. QoS 모델은 QoS Flows를 기반으로 하며, GBR(Guaranteed Bit Rate)을 요구하는 QoS Flows와 non-GBR QoS Flows 을 요구하는 QoS Flows를 모두 지원할 수 있다. NAS (Non Access Stratum) 레벨에서 QoS Flow는 PDU (Packet Data Unit) 세션에서 QoS 구분하는 가장 작은 단위이다. PDU 세션 내에서 QoS 흐름은 NG-U(user plane interface between NG-RAN and 5GC)를 통해 캡슐화된 헤더에 운반된 QFI(QoS Flow ID)에 의해 식별되는 것이 가능할 수 있다. 5GC (5G Core Network, 또는 차세대 통신 시스템의 코어망)에 연결된 NR (또는 차세대 통신 시 스템)과 5GC에 연결된 E-UTRA (또는 NR) 모두 NG-RAN (또는 차세대 통신 시스템의 무선망)의 QoS 아키텍처는 도 3에 기술되어 있으며, 다음과 같다. 도 3은 본 개시의 실시예에 따른 5GC (5G Core Network, 또는 차세대 통신 시스템의 코어망)에 연결된 NR (또는 차세대 통신 시스템)과 5GC에 연결된 E-UTRA (또는 NR) 모두 NG-RAN (또는 차세대 통신 시스템의 무선망)의 QoS 구조를 보여주는 도면이다. - 각 UE에 대해 5GC는 하나 이상의 PDU Sessions를 설정하는 것이 가능할 수 있다. - SA (Standalone) mode의 NB-IoT, IAB(Integrated Access and Backhaul)-MT(Mobile Termination)를 제외한 UE별로 PDU Session과 함께 DRB(Data Radio Bearers)가 1개 이상 설정되고, 이후 해당 PDU Session의 QoS flow(s)에 대한 DRB(s)가 추가로 설정될 수 있다. - NB-IoT UE가 NG-U 데이터 전송을 지원하는 경우, NG-RAN은 PDU Session과 함께 DRB(Data Radio Bearers)를 설정하고 하나의 DRB에만 하나의 PDU Session Map을 설정할 수 있다. - NG-RAN은 서로 다른 PDU Session에 속하는 패킷을 서로 다른 DRB에 매핑할 수 있다. - 단말과 5GC의 NAS level 패킷 필터는 UL, DL 패킷을 QoS Flows와 연관시킬 수 있다. - 단말과 NG-RAN의 AS-level mapping rule은 UL과 DL QoS Flows를 DRB와 연관시킬 수 있다. NG-RAN과 5GC는 패킷을 적절한 QoS Flows와 DRB(Data Radio Bearer)에 매핑하여 서비스 품질(신뢰성 및 목표 지연 등)을 보장한다. 따라서, NG-RAN과 5GC는 IP-flows를 QoS flows(NAS)로, QoS flows에서 DRBs(Access Stratum)로 2단계 매핑한다. NAS 수준에서의 QoS 흐름은 5GC가 NG-RAN에 제공하는 QoS 프로파일과 5GC가 UE에 제공하는 QoS 규칙에 의해 정의될 수 있다. QoS profile은 NG-RAN이 radio interface에서 treatment를 결정하 는 데에 사용되며, QoS rule은 Uplink User Plane traffic과 QoS flow 간의 mapping을 지시한다. QoS flow(흐 름)은 프로파일에 따라 GBR 또는 Non-GBR일 수 있다. QoS 흐름의 QoS 프로파일은 예를 들어, 다음의 QoS 파라미 터 중 적어도 하나를 포함할 수 있다. - QoS Flow 별 ■ 5G QoS 식별자(5QI); ■ ARP(Allocation and Retention Priority) - GBR QoS flow only인 경우 ■ Uplink와 Downlink 모두 GFBR(Guaranteed Flow Bit Rate) ■ Uplink와 Downlink 모두 MFBR(Maximum Flow Bit Rate) ■ Uplink와 Downlink 모두 최대 Packet Loss Rate; ■ Critical Resource Type 지연 ■ Notification Control 기능 참고: 최대 패킷 손실률(Packet Loss Rate (UL, DL)은 음성 미디어에 속하는 GBR QoS 흐름에 대해서만 제공된다. - Non-GBR QoS의 경우: ■ RQA(Reflective QoS Attribute): RQA가 포함되면, 이 QoS 흐름에서 수행되는 일부(전부일 수도 있지만 항상 전부는 아님) 트래픽이 NAS에서 RQoS(Reflective Quality of Service)의 영향을 받는다는 것을 나타낸다; ■ 추가 QoS Flow 정보. QoS 프로파일에 포함될 수 있는 QoS 파라미터인 Notification Control은 QoS Flow에 대해 GFBR이 더 이상(또는 다시) 수행될 수 없을 때, RAN으로부터 Notification이 요청되는지 여부를 나타낸다. 주어진 GBR QoS Flow에 대 해 Notification Control이 활성화되고, RAN이 GFBR을 보장할 수 없다고 판단하면, RAN은 SMF로 Notification 을 전송하고, QoS Flow(즉, NG-RAN이 이 QoS Flow에 대해 요청된 GFBR을 전달하지 않는 동안)를 유지해야 한다. NG-RAN은 Radio link failure 또는 RAN 내부 congestion으로 인해 해당 GBR QoS Flow에 대한 NG-RAN 자원 해제 가 필요하다. 적용 가능한 경우, NG-RAN은 SMF에게 GFBR을 다시 보장할 수 있음을 알리는 새로운 알림을 보낸다. NG-RAN이 Notification Control 파라미터로 Alternative QoS 파라미터 Set을 수신하는 경우, NG-RAN은 현재 수 행할 수 있는 QoS 파라미터 Set에 해당하는 참조를 Notification에 포함할 수도 있다. 타겟 NG-RAN 노드는, 핸 드오버 시, 소스 NG-RAN 노드로 Xn에 대해 현재 수행할 수 있는 QoS 파라미터 세트에 대한 참조를 알림 제어 표 시에 포함할 수 있다. 또한, 각 PDU 세션(Session-AMBR), 각 UE(UE-AMBR), UE별 슬라이스(UE-Slice-MBR)에 Aggregate Maximum Bit Rate(AMBR)가 연결될 수 있다. Session-AMBR은 특정 PDU Session에 대해 모든 Non-GBR QoS Flow에 걸쳐 제공될 것으로 예상되는 Aggregate Bit Rate를 제한하며, UPF(User Plane Function)에 의해 보장된다. UE- AMBR(Aggregate Maximum Bit Rate)은 UE의 모든 Non-GBR QoS Flow에 걸쳐 제공될 것으로 되는 Aggregate Bit Rate를 제한하며, RAN에 의해 보장된다. UE-Slice-MBR은 동일한 Slice(S-NSSAI)에 대해 UE의 PDU Sessions에 해당하는 모든 GBR 및 Non-GBR QoS Flow에 걸쳐 제공될 것으로 예상되는 Aggregate Bit Rate를 제한하며, RAN 에 의해 보장된다. 5QI는 QoS 특성과 연관되어, 각 QoS Flow에 대한 노드 특정 파라미터를 설정하기 위한 지침을 제공할 수 있다. 표준화되거나 미리 구성된 5G QoS 특성은 5QI (5G QoS Identifier) 값으로부터 도출되며, 명시적으로 시그널링 되지 않는다. 신호화된 QoS 특성은 QoS 프로파일의 일부로서 포함된다. QoS 특성은 예를 들어, 다음 중 적어도 하나를 포함할 수 있다. - 우선순위 수준 - Packet Delay Budget(Core Network Packet Delay Budget 포함) - Packet Error Rate - Averaging Window - 최대 Data Burst Volume. DRB(Data Radio Bearer)는 Access Stratum 레벨에서 무선 인터페이스(Uu) 상의 패킷 처리를 정의할 수 있다. DRB는 동일한 패킷 포워딩 처리로 패킷을 서비스할 수 있다. NG-RAN에 의한 DRB 매핑으로의 QoS 흐름은 QFI 및 연관된 QoS 프로파일들에 기초한다(QoS 파라미터 및 QoS 특성). 서로 다른 패킷 포워딩 처리가 필요한 QoS 플로 우(flow)/흐름에 대해 별도의 DRB가 설정되거나, 동일한 DRB에서 동일한 PDU 세션에 속하는 여러 QoS 플로우가 다중화될 수 있다. 상향링크에서 QoS Flows to DRBs의 매핑은 두 가지 다른 방식으로 시그널링되는 매핑 규칙에 의해 제어될 수 있 다. - 반사 매핑(Reflective mapping): UE는 DRB 별로 Downlink packet의 QFI(s)를 모니터링하고, Uplink에서도 downlink에서와 동일한 mapping을 적용한다. 즉, DRB의 경우, UE는 Downlink packet에서 관찰되는 QFI(s) 및 PDU Session에 해당하는 QoS flow(s)에 속하는 Uplink packet을 DRB에 mapping한다. 이러한 반사 매핑을 가능 하게 하기 위해, NG-RAN은 Uu 상의 하향링크 패킷들을 QFI로 마킹한다. - 명시적 구성(explicit configuration): DRB 매핑 규칙으로의 QoS 흐름은 RRC에 의해 명시적으로 시그널링될 수 있다. QoS Flows to DRBs 매핑이 반사 매핑(Reflective Mapping) 또는 명시적 구성(explicit configuration)을 통해 수행되는지 여부와 관계없이, UE는 Mapping Rule의 최신 Update를 항상 적용한다. DRB mapping rule로의 QoSflow가 update되면, UE는 Old bearer에 대한 end marker를 전송한다. Downlink에서 QFI는 RQoS(Reflective QoS)의 목적으로 Uu를 통해 NG-RAN에 의해 시그널링되며, NG-RAN이나 NAS(RQA에서 지시하는 바와 같이)가 DRB에 서 운반되는 QoS flow(s)에 대해 반사 매핑을 사용하려고 하지 않으면 Uu를 통해 해당 DRB에 대해 QFI가 시그널 링되지 않는다. 상향링크의 경우, NG-RAN은 UE가 Uu를 통해 QFI를 시그널링하도록 설정할 수 있다. 각 PDU 세션 에 대해, 기본(default) DRB가 구성될 수 있다. 들어오는 UL 패킷이 UE에게 설정된/구성된 RRC 또는 반사 매핑 규칙과 일치하지 않으면, UE는 UE에게 설정된/구성된 RRC 또는 반사 매핑 규칙과 일치하지 않는 UL 패킷을 PDU 세션의 기본 DRB에 매핑한다. Non-GBR QoS 흐름(flow)의 경우, 5GC는 동일한 PDU 세션에 설정된 다른 Non-GBR QoS 흐름과 비교하여 트래픽이 더 자주 나타날 가능성이 있음을 나타내기 위해, 특정 QoS 흐름과 연관된 추가 QoS 흐름 정보 파라미터를 NG-RAN으로 전송할 수 있다. 각 PDU 세션 내에서 여러 QoS 흐름을 DRB에 매핑하는 방 법은 최대 NG-RAN이다. 각 PDU 세션 내에서 여러 QoS 흐름을 DRB에 매핑하는 방법은 NG-RAN에 의해 결정/설정될 수 있다. NG-RAN은 GBR 흐름과 non-GBR 흐름 또는 둘 이상의 GBR 흐름을 동일한 DRB에 매핑하는 것이 가능할 수 있다. [QoS Flow 생성 및 해지 절차] 이하에서는 5G 또는 차세대 통신 시스템에서 QoS(Quality of Service)에 대한 설정 및 제어 방법들에 대해서 설 명한다. 도 4는 실시예에 따른 PDU Session Establishment를 위한 메시지 흐름도이다. 도 4의 일련의 절차들에 대해서 설명하면 다음과 같다. 1. 본 개시의 일 실시예에 따르면, 단말은 AMF(Access and Mobility Management Function)에 PDU session establishment를 요청할 수 있다. 2. 본 개시의 일 실시예에 따르면, AMF는 gNB로 PDU SESSION RESOURCE SETUP REQUEST 메시지를 보내는데, 이 메시지에는 NAS QoS 관련 정보와 함께 단말로 보낼 NAS 메시지가 포함되어 있을 수 있다. 3. 본 개시의 일 실시예에 따르면, gNB는 위 2.에서 수신한 적어도 하나의 DRB와 NAS 메시지의 구성을 포함하는 RRCReconfiguration 메시지를 UE로 전송할 수 있다. 4. 본 개시의 일 실시예에 따르면, UE는 신규 PDU session에 대한 DRB(s)를 설정하고 QFI to DRB mapping rule 을 생성할 수 있다. 5. 본 개시의 일 실시예에 따르면, 단말은 gNB로 RRCReconfiguration Complete 메시지를 전송할 수 있다. 6. 본 개시의 일 실시예에 따르면, gNB는 PDU SESSION RESOURCE SETUP RESPONSE 메시지를 AMF로 전송할 수 있 다. 7. 본 개시의 일 실시예에 따르면, User Plane Data는 Mapping Rule에 따라 DRB(s)를 통해 UE와 gNB 간에, PDU Session을 위해 터널을 통해 UPF와 gNB 간에 교환될 수 있다. Uu에 대한 QFI 마킹은 선택 사항인 반면, NG-U에 대한 QFI 마킹은 항상 존재한다. 도 5는 본 개시의 일 실시예에 따른 신규 QoS flow를 위해 explicit RRC signaling을 사용하는 상황과 관련된 흐름도이다. 도 5는, gNB는 UPF로부터 QFI와 연관된 제1 하향링크 패킷을 수신하는데, 제1 하향링크 패킷에 대 한 QoS 파라미터는 PDU 세션 설정으로부터 이미 알려져 있지만, AS에서는 아직 임의의 DRB와 연관이 없는 경우 에 관한 것이다. 도 5의 일련의 절차들에 대해서 설명하면 다음과 같다. 0. 본 개시의 일 실시예에 따르면, PDU session 및 DRB(s)는 이미 설정되어 있을 수 있다. 1. 본 개시의 일 실시예에 따르면, gNB는 UPF로부터 새로운 QFI를 갖는 하향링크 패킷을 수신할 수 있다. 2. 본 개시의 일 실시예에 따르면, gNB는 AS 매핑 규칙을 업데이트하기 위해 명시적 RRC 시그널링을 사용하여 기존 DRB를 통해 새로운 QoS 흐름을 보내기로 결정할 수 있다. 3. 본 개시의 일 실시예에 따르면, gNB는 새로운 QFI를 DRB mapping rule로 UE에게 RRCReconfiguration 메시지 를 보낼 수 있다. gNB는 또한 새로운 QoS Flow에 대한 QoS 요구 사항을 충족시키기 위해 필요한 경우 DRB configuration을 업데이트하기로 결정할 수 있다. 4. 본 개시의 일 실시예에 따르면, RRCReconfiguration 메시지가 수신된다면, UE는 QFI를 DRB mapping rule 및 configuration으로 업데이트한다.5. 본 개시의 일 실시예에 따르면, UE는 gNB로 RRCReconfigurationComplete 메시지를 보낼 수 있다. 6. 본 개시의 일 실시예에 따르면, 새로운 QoS flow에 대한 User Plane Data는 Update된 mapping rule에 따라 DRB를 통해 UE와 gNB 간, PDU session을 위해 터널을 통해 UPF와 gNB 간 교환이 가능할 수 있다. 도 6은 본 개시의 실시예에 따른 gNB가 NAS explicit signaling을 수반하는 CN으로부터 새로운 QoS flow establishment request를 수신하는 경우와 관련된 흐름도이다. QoS flow establishment request는 gNB와 UE에 게 QFI에 대한 QoS 파라미터를 제공할 수 있다. 도 6에서, gNB는 QoS 흐름(flow)에 대해 (기존의 것을 재사용하 기 보다는) 새로운 DRB를 설정하기로 결정하고, RRC 시그널링에 대한 매핑 규칙을 제공할 수 있다. 도 6의 일련 의 절차들에 대해서 설명하면 다음과 같다. 0. 본 개시의 일 실시예에 따르면, PDU session 및 DRB(s)는 이미 설정되어 있을 수 있다. 1. 본 개시의 일 실시예에 따르면, gNB는 새로운 QoS flow를 위해 AMF로부터 PDU SESSION RESOURCE MODIFY REQUEST 메시지를 수신할 수 있다. 2. 본 개시의 일 실시예에 따르면, gNB가 이 새로운 QoS 흐름을 매핑할 기존 DRB를 찾을 수 없는 경우, 새로운 DRB를 설정하기로 결정할 수 있다. 3. 본 개시의 일 실시예에 따르면, gNB는 위 1. 에서 수신한 새로운 QFI to DRB mapping rule을 갖는 DRB configuration과 NAS message를 포함하여, UE로 RRCReconfiguration 메시지를 전송할 수 있다. 4. 본 개시의 일 실시예에 따르면, UE는 PDU 세션과 관련된 새로운 QoS 흐름에 대한 DRB를 설정하고 매핑 규칙 을 업데이트할 수 있다. 5. 본 개시의 일 실시예에 따르면, UE는 gNB로 RRCReconfigurationComplete 메시지를 보낼 수 있다. 6 본 개시의 일 실시예에 따르면, gNB는 PDU SESSION RESOURCE MODIFY RESPONSE 메시지를 AMF로 전송할 수 있 다. 7. 본 개시의 일 실시예에 따르면, User Plane Data는 Mapping Rule에 따라 DRB(s)를 통해 UE와 gNB 간에, PDU Session을 위해 터널을 통해 UPF와 gNB 간에 교환될 수 있다. 도 7은 본 개시의 실시예에 따른 gNB가 명시적 NAS 시그널링을 수반하는 CN(Core Network)으로부터 QoS flow 해 제 요청을 수신한 경우와 관련된 흐름도이다. 도 7의 일련의 절차들에 대해서 설명하면 다음과 같다. 0. 본 개시의 일 실시예에 따르면, PDU session 및 DRB(s)는 이미 설정되어 있을 수 있다. 1. 본 개시의 일 실시예에 따르면, gNB는 AMF로부터 PDU SESSION RESOURCE MODIFY REQUEST 메시지를 수신하고, QoS flow를 해제할 수 있다. 2. 본 개시의 일 실시예에 따르면, gNB는 QFI to DRB mapping rule에 해당하는 release를 결정할 수 있다. DRB 는 다른 QoS 흐름(flow)도 운반하기 때문에 DRB는 해제되지 않을 수 있다. 3. 본 개시의 일 실시예에 따르면, gNB는 UE로 RRCReconfiguration 메시지를 보내 QFI to DRB mapping rule을 해제할 수 있다. 4. 본 개시의 일 실시예에 따르면, UE는 AS QFI를 DRB 매핑 규칙에 업데이트하여, QFI를 DRB 매핑 규칙으로부터 해제할 수 있다. 5. 본 개시의 일 실시예에 따르면, UE는 gNB로 RRCReconfigurationComplete 메시지를 보낼 수 있다. 6. 본 개시의 일 실시예에 따르면, gNB는 PDU SESSION RESOURCE MODIFY RESPONSE 메시지를 AMF로 전송할 수 있 다. 도 8은 실시예에 따른 UE AS가 QFI to DRB mapping rule이 존재하지 않는 새로운 QoS flow에 대한 UL packet을 수신하는 경우와 관련된 흐름도이다. 도 8의 일련의 절차들에 대해서 설명하면 다음과 같다. 0. 본 개시의 일 실시예에 따르면, PDU session 및 DRB(default DRB 포함)는 이미 설정되어 있을 수 있다. 1. 본 개시의 일 실시예에 따르면, UE AS는 UE NAS로부터 새로운 QFI를 갖는 패킷을 수신할 수 있다. 2. 본 개시의 일 실시예에 따르면, 단말은 수신된 패킷의 QFI를 이용하여 DRB에 매핑할 수 있다. 설정된 PDU session에 대한 AS mapping rule에 수신된 패킷의 QFI와 DRB 간의 mapping이 없는 경우, default DRB에 수신된 패킷을 할당한다. 3. 본 개시의 일 실시예에 따르면, 단말은 UL 패킷을 default DRB를 통해 전송할 수 있다. UE는 SDAP 헤더에 QFI를 포함시킬 수 있다. 4. 본 개시의 일 실시예에 따르면, gNB는 UL 패킷을 UPF로 전송하며, UL 패킷은 위 1. 및 3. 의 QFI를 포함할 수 있다. 5. 본 개시의 일 실시예에 따르면, gNB가 UL 패킷과 관련된 QoS flow를 위해 새로운 DRB를 사용하고자 할 경우, 이를 설정할 수 있다. 또한, RQoS(Reflective QoS) 또는 RRC 시그널링을 사용하여 QoS 흐름(flow)을 기존 DRB 로 이동하는 것을 선택할 수도 있다. 6. 본 개시의 일 실시예에 따르면, 새로운 QoS flow에 대한 User Plane Data는 Update된 mapping rule에 따라 DRB를 통해 UE와 gNB 간, PDU session을 위해 터널을 통해 UPF와 gNB 간 교환될 수 있다. [Notification control] 이하, NG-RAN 노드(node)가, NG-RAN 노드가 AMF 또는 5GC로부터 설정받은 QoS 요구조건을 만족시킬 수 없는 상 황임을 AMF 또는 5GC로 알려주는/지시하는 동작에 대해서 설명한다. PDU Session Resource Notify 절차는 UE에 대해 이미 설정된 QoS flow(s) 또는 PDU session(s)이 해제되거나, Notify 제어를 요청한 NG-RAN 노드에 의해 더 이상 QoS flow(s) 또는 PDU session(s)에서의 동작이 수행되지 않거나, Notify 제어를 요청한 NG-RAN 노드 에 의해 더 이상 QoS flow(s) 또는 PDU session(s)에서의 동작이 다시 수행됨을 알리는 것을 목적으로 한다. 또 한, PDU Session Resource Notify 절차는 Path Switch Request 절차 중 업데이트된 QoS 파라미터가 NG-RAN 노 드에서 정상적으로 수용되지 않음을 알리기 위해서도 사용될 수 있다. PDU Session Resource Notify 절차에서는 UE 관련 시그널링이 사용될 수 있다. 본 개시의 일 실시예에 따르면, NG-RAN 노드는 PDU SESSION RESOURCE NOTIFY 메시지를 AMF로 전송하여 PDU SESSION RESOURCE NOTIFY 절차를 시작할 수 있다. PDU SESSION RESOURCE NOTIFY 메시지는 PDU session resources 또는 QoS flow 중 NG-RAN 노드에 의해 해제되거나, NG-RAN 노드에 의한 동작이 더 이상 수행되지 않 거나, NG-RAN 노드에 의한 동작이 다시 수행되는 것에 대한 정보를 포함한다. - NG-RAN 노드에 의해 일부 QoS flow가 해제되거나, NG-RAN 노드에 의해 일부 QoS flow(와 관련된 NG-RAN 노드 동작)가 더 이상 수행되지 않거나, NG-RAN 노드에 의해 일부 QoS flow(와 관련된 NG-RAN 노드 동작)가 다시 수 행되는 PDU 세션마다 PDU Session Resource Notify Transfer IE가 포함되어야 한다. 1.QoS Flow Released List IE에서 NG-RAN 노드가 해제하는 QoS flow 목록 2.QoS Flow Notify List IE에서 Notification Cause IE와 함께 NG-RAN 노드가 더 이상 수행하지 않거나 다시 수행한 GBR QoS flow 목록. 더 이상 충족되지 않는 것으로 표시된 QoS flow의 경우, NG-RAN 노드는 또한 현재 QoS 파라미터 세트 인덱스 IE에서 충족될 수 있는 대체 QoS 파라미터 세트를 나타낼 수 있다. 3.QoS 파라미터가 업데이트되었지만 Path Switch Request 절차 동안 NG-RAN 노드에 의해 성공적으로 수용되지 못한 QoS flow 목록이 있을 경우, QoS flow 피드백 목록 IE에서 제공할 수 있는 값과 연관될 수 있다. - NG-RAN 노드가 해제하는 PDU session resource 별 PDU session resource notify releaseed transfer IE는 Release cause를 Cause IE에 포함할 수 있다. NG-RAN 노드는 지원되는 경우 User Location Information IE를 통해서 단말의 PDU SESSION RESOURCE NOTIFY 메 시지 위치 정보를 보고한다. AMF는 PDU SESSION RESOURCE NOTIFY 메시지를 수신하면 PDU Session ID IE에 표시 된 PDU 세션마다 해당 PDU와 연관된 SMF로 PDU Session Resource Notify Transfer IE 또는 PDU Session Resource Notify Release Transfer IE를 투명하게(transparent) 전송해야 한다. SMF의 세션 PDU Session Resource Notify Transfer IE 수신 시, SMF는 Core Network Side에서 PDU Session(s) 또는 QoS Flow(s)에 대한 적절한 Release 또는 Modify 절차를 정상적으로 수행하도록 한다. PDU Session Resource Notify Transfer IE 또는 PDU Session Resource Notify Released Transfer IE에 Secondary RAT Usage Information IE가 포함된 PDU Session 마다 SMF는 이런 정보(PDU SESSION RESOURCE NOTIFY 메시지에 포함된 정보 등을 의미할 수 있음) 를 처리한다. PDU SESSION RESOURCE NOTIFY 메시지에 User Location Information IE가 포함된 경우, AMF는 이 런 정보(PDU SESSION RESOURCE NOTIFY 메시지에 포함된 정보 등을 의미할 수 있음)를 처리한다. 아래의 [표 2], [표 3], [표 4]는 상술한 PDU SESSION RESOURCE NOTIFY 메시지 구성의 일례이다. [표 2]"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "[표 3]"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "[표 4]"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 6, "content": "도 9는 본 개시의 일 실시예에 따른 PDU SESSION RESOURCE NOTIFY 메시지 전송에 따른 변화된 QoS flow를 적용 하는 과정을 보여주는 흐름도이다. 먼저, 도 4에서 설명한 것과 같이 PDU 세션과 DRB 설정이 수행된 이후에, 단말과 기지국, UPF는 서로 설정된 QFI에 따라 UP Data 처리를 수행할 수 있다. 하지만, 기지국 무선 자원 상황 또는 해당 기지국에 접속한 단말들 이 증가하는 것과 같은 상황에서 기지국은 AMF 또는 UPF로부터 지시된 QFI를 만족하면서 서비스를 수행하는 것 이 어려울 수 있다. 따라서, 기지국은 AMF 또는 UPF에게 상기 설명한 PDU SESSION RESOURCE NOTIFY 메시지 전 송 및 대체 QoS 파라미터를 제공함으로써, QFI 변경을 요청할 수 있다. PDU SESSION RESOURCE NOTIFY 메시지를 수신한 AMF 또는 UPF는, 기지국이 AMF 또는 UPF로부터 지시된 QFI를 만족하면서 서비스를 수행하는 것이 어려운 상황을 고려하여, QFI 값을 업데이트할 수 있고, QFI 값을 업데이트 하는 AMF 또는 UPF의 동작은 도 5, 도 6 또 는 도 7에서 설명한 방법들 중 적어도 하나를 고려하여 수행될 수 있다. 예를 들어, QFI 2를 통해 전달된 packet들에 대해서 0.1%의 Packet error rate 및 30ms의 Delay budget을 요구되지만, 기지국이 이와 같은 요구 조건을 만족시키기 어려운 경우, 기지국은 UPF 또는 AMF에게 QFI 2 보다 완화된 요구 조건을 요청하기 위해 상 기 [표 2] 내지 [표 4]에서 상술한 PDU SESSION RESOURCE NOTIFY 메시지를 전송할 수 있다. 이를 통해, AMF 또 는 UPF는 QFI 2가 아닌 이보다 완화된 요구 조건을 가진 QFI 4에 대응하는 packet들에 대해서 1%의 Packet error rate 및 100ms의 Delay budget을 요구하도록 변경할 수 있고, 기지국은 변경된 QFI에 따라 packet들에 대한 처리를 수행할 수 있다. QFI 4는 AMF가 결정하며, 기지국이 QFI 4를 PDU SESSION RESOURCE NOTIFY 메시지 전달 시, QFI 4를 Alternative QoS Parameters Set Notify Index로 포함하여 AMF로 제공할 수 있다. [제 1 실시예] 기지국은 기지국(또는 네트워크) 에너지 소모 절감을 위해 주파수 자원, 시간 자원, 또는 안테나 자원 (또는 MIMO layer) 관점에서 최대 가용 자원 대비 일부의 자원만을 사용할 수 있다. 과도한 기지국 에너지 사용은 기 지국 운영 관점에서의 비용 증가를 초래하기 때문이다. 따라서, 기지국이 주파수 자원, 시간 자원, 또는 안테나 자원 (또는 MIMO layer) 중 일부의 자원만을 사용할 경우, 기지국이 최대 가용 자원 대비 UPF로 전달된 packet 들을 처리하기 위한 지연 시간이 증가되거나, 또는 기지국의 packet 전송 성공 확률의 신뢰도가 낮아질 수 있는가능성이 생길 수 있다. 따라서, 기지국은 UPF 또는 AMF에게 기지국 에너지 소모 절감을 위한 별도 요청 메시지 를 전송함으로써, packet 전송 관련 요구 조건 완화를 위한 QFI 변경을 요구할 수 있다. 이에 따라, UPF 또는 AMF는 해당 서비스 제공업체가 제공해준 packet의 QoS 중요도와 기지국 에너지 소모 절감 중요성을 동시에 고려 할 수 있고, 이에 따라, QFI를 변경하거나 또는 요구 조건이 완화된 대체 QFI를 기지국에게 제공할 수 있다. QFI를 변경하지 않는다는 것은 기지국 에너지 소모 절감 보다 해당 packet의 QoS를 만족하는 것이 더 중요함을 의미할 수 있다. 또는, 완화된 대체 QFI를 제공하는 것은 해당 packet의 QoS 만족보다 기지국 에너지 소모 절감 이 중요함을 의미할 수 있다. 다만, 이는 하나의 예시일 뿐이며, 이와 달리 최대 QFI 값은 UPF와 AMF가 네트워 크 상황 및 사용자 체감 만족도를 종합적으로 고려하여 결정결정되는 것이 가능할 수도 있다. 예를 들어, 기지 국이 AMF 또는 UPF로 [표 5]와 같은 메시지를 통해 기지국 에너지 소모 절감을 요청하는 것이 가능할 수 있다. [표 5]"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "[표 5]에서, 기지국은 Notification Cause 메시지에서 \"network energy saving\" 모드를 지시함으로써, 기지국 은 기지국 에너지 소모 절감을 위한 QFI 변경을 UPF와 AMF로 요청할 수 있다. [표 5]의 메시지는 [표 2]와 유사 하게 기지국에서 AMF 또는 UPF로 전달되는 것이 가능하며, 그 이외 기지국 에너지 소모 절감과 관련된 코어망의 다른 entity로 전달될 수도 있다. 또한, [표 5]에서, 기지국이 추가적으로 에너지 소모 절감을 위해 필요한 QFI 값을 제공할 수 있다. 또한, 추가적으로 기지국은 에너지 소모 절감 비율에 따른 QFI 후보 값 리스트를 제공할 수 있다. 예를 들어, 아래의 [표 6]과 같은 정보가 [표 5]에 포함되어 전달될 수 있다. [표 6]과 같이, 기지국 은 본 개시의 일 실시 예에 따른 기지국 에너지 소모 절감 레벨 (또는 비율)에 따른 대체 QoS 파라미터를 AMF 또는 UPF로 전달할 수 있다. 예를 들어, 기지국 에너지 소모 절감 비율이 최대 기준 10%일 때와 50%일 때, 특정 packet을 처리하기 위한 요구 조건이 달라질 수 있으며, 50%일 때, packet 처리 요구 조건은 10% 일 때보다 완 화될 수 있다. 기지국이 이와 같은 비율을 직접 AMF 또는 UPF로 전달하거나, 또는 기지국이 AMF 또는 UPF로 이 와 같은 비율을 레벨 값으로 간접적으로 전달할 수 있다. 또한, [표 6]에서는 Alternative QoS 파라미터들을 Packet error rate 및 packet delay의 조합으로 표현했지만, 이 중 일부 값만으로 Alternative QoS 파라미터가 구성될 수 있거나, 또는 packet size 또는 packet importance와 같은 신규 packet 파라미터들이 Alternative QoS 파라미터에 추가될 수 있다. 또한, 각 레벨 (또는 비율) 별로 서로 다른 조합의 QoS 파라미터들이 구성될 수 있다. 코어망이 [표 6]과 같은 Alternative QoS 파라미터들에 대한 정보를 받게되면, 코어망은 QoS 만족 여 부과 기지국 에너지 소모 절감 여부를 동시에 고려하여 보다 적절한 QoS 파라미터 값을 결정할 수 있다. [표 6]"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "[표 6]은 별도의 테이블 형태로 AMF 또는 UPF로 전달되거나, 또는 [표 5]에서 Network energy saving level은 Notification Cause에 세부적으로 포함되고, Current QoS Parameters Set Index에 이에 대응되는 각각의 값이 Alternative QoS Parameter Index으로 매핑될 수 있다. 또한, 기지국이 보고할 수 있는 최대 개수는 사전에 AMF 또는 UPF를 통해 설정받을 수 있고, 이 중 일부 또는 전체의 값을 기지국이 [표 6]과 같이 구성하여 [표 5]의 메시지에 포함하여 AMF 또는 UPF로 전달할 수 있다. 제 1 실시 예에서 설명한 network energy saving을 요구하는 메시지가 포함된 [표 5]의 전달을 위한 동작의 흐 름도는 기본적으로 도 9에서 설명한 것과 유사하며, PDU Session Resource Notify 메시지에 [표 5]에서 network energy saving 관련 파라미터가 추가된다. 따라서, 이와 같은 정보를 통해 AMF는 Notify 메시지에서 기 지국이 대체 QoS 파라미터를 요구하는 이유가 기지국 에너지 소모 절감을 위해서인지, 또는 기지국 가용 최대 자원을 사용해도 AMF가 설정한 QoS 요구조건을 만족 못하는 상황이어서인지를 구분하는 것이 가능할 수 있다. [제 2 실시예] 제 1 실시예는 기지국이 기지국 에너지 소모 절감을 위한 메시지를 전송 시, PDU Session Notify Control 메시 지 내의 Notification Cause를 활용하여 전달했지만, 제 2 실시예는 해당 메시지 전송을 위해 도 10과 같이 별 도 Energy Saving Notify 메시지를 새롭게 구성하여 전달하는 것이 가능할 수 있으며, 도 10은 본 개시의 일 실 시예에 따른 기지국이 AMF에게 기지국 에너지 소모 절감을 위한 메시지를 보고하는 흐름도이다. 해당 메시지의 구성 형태는 다음 [표 7]과 같을 수 있다. 이는 예시일 뿐 일부 항목이 존재하지 않거나 변형된 형태가 가능할 수 있다. [표 7]"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "또는, 해당 메시지의 구성 형태는 다음 [표 8]과 같을 수 있다. 이는 예시일 뿐 일부 항목이 존재하지 않거나 변형된 형태가 가능할 수 있다. [표 8]은 [표 7]과 달리 복수의 enegy saving level 정보들을 포함할 수 있으며, 각 level은 기지국이 에너지 소모를 절감할 수 있는 비율을 의미할 수 있다. 예를 들어, enegy saving level 1은 10%의 기지국 에너지 소모 절감을 제공할 수 있는 값이고, enegy saving level 2은 20%의 기지국 에 너지 소모 절감을 제공할 수 있는 값일 수 있다. 이는 예시일 뿐 다른 값으로 적용되는 것이 가능할 수 있다. 또한, 기지국이 에너지 소모를 절감할 수 있는 비율이 레벨 값으로 지시되는 것이 아니라 퍼센트 단위의 값으로 제공될 수 있다. 또한, [표 8]은 2개(level 1, level 2)의 값만을 예시로 들었지만, 이 외에도 하나 또는 2개 이상의 복수의 level 값을 통해 기지국이 에너지 소모를 절감할 수 있는 비율을 지시하는 것도 가능할 수 있다. 단말은 Energy saving level 별로 이에 대응되는 QoS 파라미터 값을 추가적으로 Energy saving level과 같이 제공할 수 있다. 예를 들어, enegy saving level 1는 Alternative QoS Parameters Set Notify Index 1에 대응 되고, enegy saving level 2는 Alternative QoS Parameters Set Notify Index 2에 대응되도록 구성될 수 있다. Alternative QoS Parameters Set Notify Index의 값은 packet delay, packet error rate, packet size, packet importance에 대한 값들 중 적어도 하나가 포함될 수 있고, 각 energy saving level 별로 서로 다른 구 성을 가질 수 있다. [표 8]"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "본 개시의 일 실시예에 따르면, 기지국 (또는 NG-RAN 노드)는 Energy Saving Notify 메시지를 전송하여 기지국 이 AMF에게 기지국 에너지 소모 절감을 위한 메시지를 보고하는 절차를 시작할 수 있다. Energy Saving Notify 메시지는 PDU session resources 또는 QoS flow 중 NG-RAN 노드에 의해 해제되거나, NG-RAN 노드에 의한 동작 이 더 이상 수행되지 않거나, NG-RAN 노드에 의한 동작이 다시 수행되는 것에 대한 정보를 포함한다. QoS Flow Notify List IE에서 Energy Saving Request IE와 함께 NG-RAN 노드가 기지국의 에너지 소모를 절감하기 위한 QoS 흐름(Flow)이 존재하면, NG-RAN 노드는 또한 현재 QoS 파라미터 세트 인덱스 IE에서 기지국 에너지 소모 절 감 동작이 수행될 경우, 만족 가능한 대체 QoS 파라미터 세트를 현재 QoS 파라미터 세트 인덱스 IE에 나타낼 수 있다. [제 3 실시예] 제 1 실시예와 제 2 실시예 모두, 처음 PDU session과 이에 대응되는 DRB 설정이 완료된 이후, 기지국이 에너지 소모 절감을 위한 별도 추가 메시지를 통해 AMF 또는 UPF로 하여금 기존에 요구되는 QoS 보다 완화된 QoS 파라 미터 설정을 요청하고, 이를 통해 기지국이 원하는 에너지 소모 절감을 달성하는 방법에 관한 것이다. 이와 달 리, 제 3 실시예는 PDU session과 이에 대응되는 DRB 설정이 완료되기 이전, 또는 PDU session과 이에 대응되는 DRB 설정이 수행되는 과정에서 기지국 에너지 소모 절감을 위한 요청 메시지를 보내는 방법에 관한 것이다. 구 체적으로, 실시예 3에서 설명하는 방법은 도 4에서 설명한 동작과 유사하지만, 도 11과 같이 PDU Session Establishment Request 정보를 단말 또는 기지국이 AMF로 전달하며, 이 때, 기지국은 기지국 에너지 소모 절감 관련 메시지를 PDU Session Establishment Request 정보에 포함할 수 있다. 도 11은 본 개시의 일 실시예에 따른 기지국이 코어망과 PDU session establishment 시, 기지국 에너지 소모 절 감을 수행하는 절차를 보여주는 흐름도이다. 도 11에 따른 동작을 통해, AMF의 QoS flow - DRB mapping 시, AMF는 기지국 에너지 소모 절감을 고려하여 Qos flow - DRB mapping을 수행하는는 것이 가능할 수 있다. 보다 구체적으로, 기지국 에너지 소모 절감 메시지가 없고, AMF가 QoS 파라미터 집합 1로 QFI를 설정하여 QoS flow - DRB mapping을 수행하는 상황에서 상기 기지국 에너지 소모 절감 메시지가 AMF로 전달된 경우, AMF는 기 지국 에너지 소모 절감 메시지가 없음을 고려하여 QoS 파라미터 집합 1보다 요구조건이 완화된 QoS 파라미터 집 합 2로 설정하는 것이 가능할 수 있다. QoS 파라미터 집합 2는 QoS 파라미터 집합 1 대비 긴 packet delay 값을 가지거나 또는 높은 packet error rate를 가지는 것일 수 있다. 또는, AMF는 동일한 서비스 제공자에게 제공받 은 packet 일지라도 해당 packet들에 대해 적응적으로 다른 QoS 파라미터들을 적용하여 QoS flow - DRB mapping을 수행할 수도 있다. 예를 들어, AMF는 동일한 서비스 정보를 가진 packet들을 기지국으로 전달 시, 동 일한 서비스 정보를 가진 packet들을 QoS 파라미터 집합 1로 매핑하거나 또는 QoS 파라미터 집합 2로 매핑할 수 있다. 동일한 서비스 정보를 가진 packet들에 대한 적응적 QoS 파라미터 적용을 통한 QoS flow - DRB mapping을 통해, QoS 요구 조건과 기지국 에너지 소모 절감이 동시에 달성될 수 있다. 도 12는 본 개시의 일 실시 예에 따른 무선 통신 시스템에서 단말의 구조를 도시하는 도면이다. 도 12를 참조하면, 단말은 단말기 수신부와 단말기 송신부를 일컫는 송수신부(transceiver), 메모 리(미도시) 및 단말기 처리부(1205, 또는 단말기 제어부 또는 프로세서)를 포함할 수 있다. 전술한 단말의 통신 방법에 따라, 단말의 송수신부(1200, 1210), 메모리 및 단말기 처리부 가 동작할 수 있다. 다만, 단말의 구성 요소가 전술한 예에 한정되는 것은 아니다. 예를 들어, 단말은 전술한 구성 요소들 보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함할 수도 있다. 뿐만 아니라, 송수신부, 메모리, 및 프로세서가 하나 의 칩(chip) 형태로 구현될 수도 있다. 송수신부는 기지국과 신호를 송수신할 수 있다. 여기에서, 신호는 제어 정보 및 데이터를 포함할 수 있다. 이 를 위해, 송수신부는 전송되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송신기와, 수신되는 신호를 저 잡음 증폭하고 주파수를 하강 변환하는 RF 수신기 등으로 구성될 수 있다. 다만, 이는 송수신부의 일 실시 예일뿐이 며, 송수신부의 구성 요소가 RF 송신기 및 RF 수신기에 한정되는 것은 아니다. 또한, 송수신부는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력되는 신호를 무 선 채널을 통해 전송할 수 있다. 메모리는 단말의 동작에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 단말이 송수신하는 신호 에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 롬(ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구성될 수 있다. 또한, 메모리는 복수 개일 수 있다. 또한 프로세서는 전술한 실시 예에 따라 단말이 동작할 수 있도록 일련의 과정을 제어할 수 있다. 예를 들어, 프로세서는 두 가지 계층으로 구성되는 DCI를 수신하여 동시에 다수의 PDSCH를 수신하도록 단말의 구성 요소를 제어할 수 있다. 프로세서는 복수 개일 수 있으며, 프로세서는 메모리에 저장된 프로그램을 실행함으로써 단말 의 구성 요소 제어 동작을 수행할 수 있다. 도 13는 본 개시의 일 실시 예에 따른 무선 통신 시스템에서 기지국의 구조를 도시하는 도면이다. 도 13를 참조하면, 기지국은 기지국 수신부와 기지국 송신부를 일컫는 송수신부, 메모리(미도시) 및 기지국 처리부(1305, 또는 기지국 제어부 또는 프로세서)를 포함할 수 있다. 전술한 기지국의 통신 방법에 따라, 기지국의 송수신부(1300, 1310), 메모리 및 기지국 처리부 가 동작할 수 있다. 다만, 기지국의 구 성 요소가 전술한 예에 한정되는 것은 아니다. 예를 들어, 기지국은 전술한 구성 요소들 보다 더 많은 구성 요 소를 포함하거나 더 적은 구성 요소를 포함할 수도 있다. 뿐만 아니라 송수신부, 메모리, 및 프로세서가 하나의 칩(chip) 형태로 구현될 수도 있다. 송수신부는 단말과 신호를 송수신할 수 있다. 여기에서, 신호는 제어 정보 및 데이터를 포함할 수 있다. 이를 위해, 송수신부는 전송되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송신기와, 수신되는 신호를 저 잡음 증 폭하고 주파수를 하강 변환하는 RF 수신기 등으로 구성될 수 있다. 다만, 이는 송수신부의 일 실시예일뿐이며, 송수신부의 구성 요소가 RF 송신기 및 RF 수신기에 한정되는 것은 아니다. 또한, 송수신부는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 메모리는 기지국의 동작에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 기지국이 송수신하는 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 롬(ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구성될 수 있다. 또한, 메모리는 복수 개일 수 있다. 프로세서는 전술한 본 개시의 실시 예에 따라 기지국이 동작할 수 있도록 일련의 과정을 제어할 수 있다. 예를 들어, 프로세서는 다수의 PDSCH에 대한 할당 정보를 포함하는 두 가지 계층의 DCI들을 구성하고 이를 전송하기 위해 기지국의 각 구성 요소를 제어할 수 있다. 프로세서는 복수 개일 수 있으며, 프로세서는 메모리에 저장된 프로그램을 실행함으로써 기지국의 구성 요소 제어 동작을 수행할 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic discstorage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근 (access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장치 는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 개시에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편, 본 명세서와 도면에 개시된 본 개시의 실시 예들은 본 개시의 기술 내용을 쉽게 설명하고 본 개시의 이해 를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 개시의 범위를 한정하고자 하는 것은 아니다. 즉 본 개시의 기 술적 사상에 바탕을 둔 다른 변형예들이 실시 가능하다는 것은 본 개시의 속하는 기술 분야에서 통상의 지식을 가진 자에게 자명한 것이다. 또한 상기 각각의 실시 예는 필요에 따라 서로 조합되어 운용할 수 있다. 예컨대, 본 개시의 일 실시 예와 다른 일 실시 예의 일부분들이 서로 조합되어 기지국과 단말이 운용될 수 있다. 예를 들면, 본 개시의 제1 실시 예와 제2 실시 예의 일부분들이 서로 조합되어 기지국과 단말이 운용될 수 있다. 또 한 상기 실시 예들은 FDD LTE 시스템을 기준으로 제시되었지만, TDD LTE 시스템, 5G 혹은 6G 시스템 등 다른 시 스템에도 상기 실시 예의 기술적 사상에 바탕을 둔 다른 변형예들이 실시 가능할 것이다. 한편, 본 개시의 방법을 설명하는 도면에서 설명의 순서가 반드시 실행의 순서와 대응되지는 않으며, 선후 관계 가 변경되거나 병렬적으로 실행 될 수도 있다. 또는, 본 개시의 방법을 설명하는 도면은 본 개시의 본질을 해치지 않는 범위 내에서 일부의 구성 요소가 생략 되고 일부의 구성요소만을 포함할 수 있다. 또한, 본 개시의 방법은 개시의 본질을 해치지 않는 범위 내에서 각 실시예에 포함된 내용의 일부 또는 전부가 조합되어 실행될 수도 있다. 본 개시의 다양한 실시예들이 전술되었다. 전술한 본 개시의 설명은 예시를 위한 것이며, 본 개시의 실시예들은"}
{"patent_id": "10-2023-0135899", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "개시된 실시예들에 한정되는 것은 아니다. 본 개시가 속하는 기술분야의 통상의 지식을 가진 자는 본 개시의 기 술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 본 개시의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청 구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 개시의 범위에 포함되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2023-0135899", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시예에 따른 무선 통신 시스템에서 시간-주파수영역의 기본 구조를 도시한 도면이다. 도 2는 본 개시의 실시예에 따른 무선 통신 시스템에서 프레임, 서브프레임, 슬롯 구조를 도시한 도면이다. 도 3은 본 개시의 실시예에 따른 5GC (5G Core Network, 또는 차세대 통신 시스템의 코어망)에 연결된 NR (또는 차세대 통신 시스템)과 5GC에 연결된 E-UTRA (또는 NR) 모두 NG-RAN (또는 차세대 통신 시스템의 무선망)의 QoS 구조를 보여주는 도면이다. 도 4는 본 개시의 실시예에 따른 PDU Session Establishment를 위한 메시지 흐름도이다. 도 5는 본 개시의 일 실시예에 따른 신규 QoS flow를 위해 explicit RRC signaling을 사용하는 상황과 관련된흐름도이다. 도 6은 본 개시의 실시예에 따른 gNB가 NAS explicit signaling을 수반하는 CN으로부터 새로운 QoS flow establishment request를 수신하는 경우와 관련된 흐름도이다. 도 7은 본 개시의 실시예에 따른 gNB가 명시적 NAS 시그널링을 수반하는 CN(Core Network)으로부터 QoS flow 해제 요청을 수신한 경우와 관련된 흐름도이다. 도 8은 실시예에 따른 UE AS가 QFI to DRB mapping rule이 존재하지 않는 새로운 QoS flow에 대한 UL packet을 수신하는 경우와 관련된 흐름도이다. 도 9는 본 개시의 일 실시예에 따른 PDU SESSION RESOURCE NOTIFY 메시지 전송에 따른 변화된 QoS flow를 적용하는 과정을 보여주는 흐름도이다. 도 10은 본 개시의 일 실시예에 따른 기지국이 AMF에게 기지국 에너지 소모 절감을 위한 메시지를 보고하는 흐 름도이다. 도 11은 본 개시의 일 실시예에 따른 기지국이 코어망과 PDU session establishment 시, 기지국 에너지 소모 절 감을 수행하는 절차를 보여주는 흐름도이다. 도 12는 본 개시의 일 실시 예에 따른 무선 통신 시스템에서 단말의 구조를 도시하는 도면이다. 도 13는 본 개시의 일 실시 예에 따른 무선 통신 시스템에서 기지국의 구조를 도시하는 도면이다."}
