{"patent_id": "10-2021-0114807", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0032223", "출원번호": "10-2021-0114807", "발명의 명칭": "음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템 및 방법", "출원인": "계명대학교 산학협력단", "발명자": "조치흠"}}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "특정 진료과에 대한 수술 절차, 수술 및 진단 결과를 포함한 표준 수술 결과 보고서를 분석하여 문자열 데이터로 변환하고, 상기 문자열 데이터에서 키워드를 추출하여 의료 정보를 포함한 진단 표준 질문 데이터를 각각 생성하는 표준 질문 생성부;상기 각각의 진단 표준 질문 데이터에 포함된 응답 영역의 키워드를 추출하여 응답 데이터를 생성하는 질의 응답 생성부;상기 각각의 진단 표준 질문 데이터와 이에 대응하는 응답 데이터를 학습 데이터로 하여 인공 신경 처리망과 연동하여 인공지능에 학습하는 학습부; 및상기 각각의 진단 표준 질문 데이터는 질의에 대응하여 선택하는 응답 선택 번호를 포함하고, 상기 각각의 진단표준 질문 데이터를 음성 신호로 변환하여 사용자 단말기로 전송하고, 상기 사용자 단말기로부터 상기 응답 선택 번호를 음성 신호로 입력받아 수신하고, 상기 인공 신경 처리망을 통해 상기 응답 선택 번호에 대응하는 응답 데이터를 출력하는 제어부를 포함하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템."}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제어부는 상기 출력한 응답 데이터를 고려하여 수술 절차, 수술 및 진단 결과를 포함한 최종 수술 결과 보고서를 생성하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템."}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 학습부는 상기 인공 신경 처리망을 이용하여 상기 각각의 진단 표준 질문 데이터의 특징값들이 입력 벡터가 되며, 입력층, 은닉층, 출력층을 통과하면, 상기 각각의 진단 표준 질문 데이터에 포함된 응답 데이터를 출력 벡터로 생성하도록 지도 학습을 통해 학습하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서제공 시스템."}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 제어부는 상기 각각의 진단 표준 질문 데이터를 NLU(Natural Language Understanding) 모듈에 의해 문법적 분석(Syntactic analyze) 또는 의미적 분석(semantic analyze)을 수행하여 자연어의 텍스트 문자열 의미를파악하고, 음성 합성 모듈에 의해 상기 자연어의 텍스트 문자열을 음성 신호로 변환하고, 상기 변환한 음성 신호를 상기 사용자 단말기로 전송하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템."}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 제어부는 상기 사용자 단말기로부터 상기 각각의 진단 표준 질문 데이터에 포함된 응답 선택 번호를 사용자의 음성 신호로 수신하는 수신부와, 상기 수신부로부터 수신된 사용자의 음성 신호를 텍스트 데이터로 변환하는 ASR(Automatic Speech Recognition) 모듈을 더 포함하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템."}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2023-0032223-3-청구항 5에 있어서,상기 인공 신경 처리망을 이용하여 상기 텍스트 데이터인 상기 응답 선택 번호가 딥러닝 기반 분류기 모델을 통해 상기 응답 데이터의 결과값으로 출력하는 분류부를 더 포함하는 음성 인식 플랫폼을 활용한 인공지능 기반의수술결과보고서 제공 시스템."}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 표준 질문 생성부는 상기 진단 표준 질문 데이터를 인덱스를 레이블링하여 각각 생성하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템."}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "표준 수술 결과 보고서를 기반으로 인공지능에 학습하여 진단 표준 질문 데이터를 복수개 생성하는 단계;상기 각각의 진단 표준 질문 데이터는 질의에 대응하여 선택하는 응답 선택 번호를 포함하고, 상기 각각의 진단표준 질문 데이터를 음성 신호로 변환하여 사용자 단말기로 전송하고, 상기 사용자 단말기로부터 상기 응답 선택 번호를 음성 신호로 입력받아 수신하는 단계; 및상기 인공지능에 학습한 진단 표준 질문 데이터를 이용하여 상기 수신한 응답 선택 신호에 대응하는 응답 데이터를 각각 생성하고, 상기 생성한 응답 데이터를 기반으로 수술 절차, 수술 및 진단 결과로 이루어진 최종 수술결과 보고서를 생성하는 단계를 포함하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 방법."}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 진단 표준 질문 데이터를 복수개 생성하는 단계는,상기 진단 표준 질문 데이터의 생성 시 인덱스를 레이블링하여 의료 정보를 포함한 진단 표준 질문 데이터를 각각 생성하는 단계를 더 포함하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 방법."}
{"patent_id": "10-2021-0114807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서,인공 신경 처리망을 이용하여 상기 각각의 진단 표준 질문 데이터의 특징값들이 입력 벡터가 되며, 입력층, 은닉층, 출력층을 통과하면, 상기 각각의 진단 표준 질문 데이터에 포함된 응답 데이터를 출력 벡터로 생성하도록지도 학습을 통해 학습하는 단계를 더 포함하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 방법."}
{"patent_id": "10-2021-0114807", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템 및 방법은 수술 이후에 수기로 작성하 는 수술 결과 보고서를 인공지능 기반의 음성 인식으로 수술 절차 및 수술 진단 결과를 입력하고, 이에 대한 응 답으로 수술 결과 보고서를 자동으로 생성한다. 본 발명은 음성 인식으로 수술 절차 및 진단 결과를 입력할 수 있으며, 응답 선택 신호를 번호로 구성하여 발음 에 따른 입력값 인식의 부정확성을 방지할 수 있고, 수술 결과 보고서 생성의 편의성과 정확성을 높이는 효과가 있다."}
{"patent_id": "10-2021-0114807", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반의 수술결과보고서 제공 시스템에 관한 것으로서, 더욱 상세하게는 수술 이후에 수기로 작성하는 수술 결과 보고서를 인공지능 기반의 음성 인식으로 수술 절차 및 수술 진단 결과를 입력하고, 이에 대한 응답으로 수술 결과 보고서를 자동으로 생성하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보 고서 제공 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0114807", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 의사들은 병원 수술이 끝난 이후에 수술 과정 및 수술 결과 보고서를 작성하였다. 그러나 의사들은 수술 결과 보고서를 수술마다 직접 수기로 작성해야 하므로 보고서 작성에 오랜 시간이 소요되 며, 복잡한 수술의 경우, 수술 이후에 많은 시간이 지난 후에 수술 결과 보고서를 작성하게 되므로 기억 오류로 수술 과정을 빼먹게 되는 단점이 있다.즉, 의사들은 수술이 복잡하거나 수술 시간이 긴 경우, 수술 이후에 수술 결과 보고서를 작성해야 하므로 수술 과정을 꼼꼼히 기억하고 작성하는데 어렵기 때문에 수술 결과 보고서의 기록 정확성이 떨어질 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허번호 제10-1990895호"}
{"patent_id": "10-2021-0114807", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이와 같은 문제점을 해결하기 위하여, 본 발명은 수술 이후에 수기로 작성하는 수술 결과 보고서를 인공지능 기 반의 음성 인식으로 수술 절차 및 수술 진단 결과를 입력하고, 이에 대한 응답으로 수술 결과 보고서를 자동으 로 생성하는 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템 및 방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2021-0114807", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 특징에 따른 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템은, 특정 진료과에 대한 수술 절차, 수술 및 진단 결과를 포함한 표준 수술 결과 보고서를 분석하여 문자열 데이터 로 변환하고, 상기 문자열 데이터에서 키워드를 추출하여 의료 정보를 포함한 진단 표준 질문 데이터를 각각 생 성하는 표준 질문 생성부; 상기 각각의 진단 표준 질문 데이터에 포함된 응답 영역의 키워드를 추출하여 응답 데이터를 생성하는 질의 응 답 생성부; 상기 각각의 진단 표준 질문 데이터와 이에 대응하는 응답 데이터를 학습 데이터로 하여 인공 신경 처리망과 연 동하여 인공지능에 학습하는 학습부; 및 상기 각각의 진단 표준 질문 데이터는 질의에 대응하여 선택하는 응답 선택 번호를 포함하고, 상기 각각의 진단 표준 질문 데이터를 음성 신호로 변환하여 사용자 단말기로 전송하고, 상기 사용자 단말기로부터 상기 응답 선 택 번호를 음성 신호로 입력받아 수신하고, 상기 인공 신경 처리망을 통해 상기 응답 선택 번호에 대응하는 응 답 데이터를 출력하는 제어부를 포함한다. 본 발명의 특징에 따른 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 방법은, 표준 수술 결과 보고서를 기반으로 인공지능에 학습하여 진단 표준 질문 데이터를 복수개 생성하는 단계; 상기 각각의 진단 표준 질문 데이터는 질의에 대응하여 선택하는 응답 선택 번호를 포함하고, 상기 각각의 진단 표준 질문 데이터를 음성 신호로 변환하여 사용자 단말기로 전송하고, 상기 사용자 단말기로부터 상기 응답 선 택 번호를 음성 신호로 입력받아 수신하는 단계; 및 상기 인공지능에 학습한 진단 표준 질문 데이터를 이용하여 상기 수신한 응답 선택 신호에 대응하는 응답 데이 터를 각각 생성하고, 상기 생성한 응답 데이터를 기반으로 수술 절차, 수술 및 진단 결과로 이루어진 최종 수술 결과 보고서를 생성하는 단계를 포함한다."}
{"patent_id": "10-2021-0114807", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 구성에 의하여, 본 발명은 음성 인식으로 수술 절차 및 진단 결과를 입력할 수 있으며, 응답 선택 신호 를 번호로 구성하여 발음에 따른 입력값 인식의 부정확성을 방지할 수 있고, 수술 결과 보고서 생성의 편의성과 정확성을 높이는 효과가 있다."}
{"patent_id": "10-2021-0114807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 도 1은 본 발명의 실시예에 따른 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템의 구 성을 나타낸 도면이다. 본 발명의 실시예에 따른 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템은 사용 자 단말기, 통신망 및 수술결과보고서 제공 서버를 포함한다. 사용자 단말기는 HTML(Hypertext Markup Language)5 기반의 웹브라우저를 탑재하는 유선단말 또는 무선단 말을 포함하고, 유선단말인 데스크탑 PC 뿐만 아니라 스마트폰, PDA, 태블릿 PC 등과 같이 모바일 기기를 모두 포함한다. 사용자 단말기는 문자, 숫자, 기호 등을 입력 모듈(키보드, 터치 스크린 등)을 통해 입력할 수 있고, 음성 신호를 입력하는 마이크 모듈과, 음성 신호를 출력하는 스피커 모듈을 구비한다. 사용자 단말기는 수술결과보고서 제공 서버와 통신을 수행하기 위한 인터페이스를 제공하는데, 이를 테면, 지그비(Zigbee), 알에프(RF), 와이파이(WiFi), 3G, 4G, LTE, LTE-A, 와이브로(Wireless Broadband Internet) 등의 무선통신, 또는 인터넷, SNS(Social Network Service) 등을 사용할 수 있다. 사용자 단말기는 각종 프로그램(예를 들면, 보고서 생성 애플리케이션) 및 단말 제어부(미도시)를 통해 처 리된 각종 데이터들을 저장하며, 저장매체로 플래시 메모리 등 비휘발성 메모리를 사용할 수 있다. 사용자 단말기는 보고서 생성 애플리케이션을 구동하여 통신망을 통해 수술결과보고서 제공 서버 에 접속하고, 수술 결과 보고서를 자동으로 생성하기 위한 일련의 절차를 수행한다. 통신망은 유무선 통신망을 모두 포함하고, 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서, 유선망 은 케이블망이나 공중 전화망(PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함한다. 사용자 단말기는 수술결과보고서 제공 서버에 접속하여 수술 결과 보고서를 작성하기 위한 보고서 생 성 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 수신한다. 수술결과보고서 제공 서버는 수술 결과 보고서를 작성하는 보고서 생성 애플리케이션을 생성하여 통신망 을 거쳐 사용자 단말기로 전송한다. 사용자 단말기는 보고서 생성 애플리케이션을 구동하여 수술결과보고서 제공 서버에 접속하여 연결된 다. 수술결과보고서 제공 서버는 본 발명에서 예시한 부인과 수술 절차 및 진단 표준 질문 데이터를 음성 정보 로 변환하여 생성하고, 생성된 음성 정보를 사용자 단말기로 제공한다. 사용자 단말기는 부인과 수술 절차 및 진단 표준 질문 데이터에 포함된 응답 선택 번호를 사용자의 음성 신호로 입력받는다. 사용자 단말기는 입력된 음성 신호를 통신망을 거쳐 수술결과보고서 제공 서버로 전송한다. 수술결과보고서 제공 서버는 각각의 진단 표준 질문 데이터를 음성 신호로 변환하여 사용자 단말기로 전송한다. 사용자 단말기는 각각의 진단 표준 질문 데이터에 포함된 응답 선택 번호를 사용자로부터 음성 신호로 입 력받아 수술결과보고서 제공 서버로 전송한다. 수술결과보고서 제공 서버는 인공지능에 학습한 진단 표준 질문 데이터를 이용하여 사용자 단말기로 부터 수신한 음성 신호에 대응하는 응답 데이터를 생성하고, 생성한 응답 데이터를 기반으로 수술 절차. 수술 및 진단 결과로 이루어진 최종 수술 결과 보고서를 생성한다. 진단 표준 질문 데이터는 부인과 수술 절차, 수술 결과 및 진단 결과를 나타낸 것이다. 진단 표준 질문 데이터의 일례를 다음과 같다. 첫 번째 단계는 1번 복강경 검사와 2번 기계장치 중 어떤 플랫폼으로 시작할지에 대한 질문에 응답한다. 여기서, 응답 선택 번호는 1번 또는 2번이다. 두 번째 단계는 어떤 절차를 수행하고 있는지에 대해 1번 자궁 절제술, 2번 근종 절제술, 3번 난소 낭선종 절제 술 중 하나를 택하여 응답한다. 여기서, 응답 선택 번호는 1번, 2번, 3번이다. 세 번째 단계는 진단 결과로 1번 자궁선근종, 2번 자궁근종, 3번 상피내암, 4번 기타 중 어떤 진단을 내렸는지 를 선택하여 응답한다. 여기서, 응답 선택 번호는 1번, 2번, 3번이다. 네 번째 단계는 자궁의 크기 확인을 위한 질문의 답으로 1번부터 8번까지 차례대로 보통 크기, 6 내지 8주, 8 내지 10주, 10 내지 12주, 12 내지 14주, 14 내지 16주, 16 내지 18주, 20주 이상 크기로 응답란이 구성되어 있 다. 여기서, 응답 선택 번호는 1번부터 8번이다. 다섯 번째 단계는 난소의 왼쪽 오른쪽 크기가 각각 정상인지 아닌지에 대한 질문에 응답함으로써 비정상이라면 6가지의 선택란 중 하나를 선택한다. 여기서, 응답 선택 번호는 1번부터 6번이다. 6가지 선택란에는 단순 낭종, 유피포낭, 자궁내막종, 점액성, 장액, 그리고 기타가 있다. 낭종의 크기가 4cm, 6cm, 8cm, 10cm, 12cm, 14cm 이상 중 어디에 해당하는지를 선택하여 응답한다. 여섯 번째는 자궁경부, 난소 나팔관 등의 유착 여부를 확인하는 단계로, 유착이 있다면 약간, 보통, 심한 중 한 가지를 선택하여 응답한다. 일곱 번째는 출혈량 추정에 관한 질문에는 50ml, 100ml, 150ml, 200ml, 300ml 이상 중 해당하는 선택란으로 응 답한다. 여기서, 응답 선택 번호는 1번부터 5번이다. 여덟 번째는 자궁 수술 유형으로 1번 복강경보조 질식 자궁 절제술(LAVH)와 2번 전체 복강경하 자궁 적출술 (TLH) 중 하나를 택하여 응답한다. 여기서, 응답 선택 번호는 1번 또는 2번이다. 아홉 번째는 난관 난소 절개술을 했는지에 대한 여부에 대한 응답으로서, 1번 편측 난관 난소 적출술(USO), 양 측 난관 난소 절제술(BSO) 중 하나를 선택한다. 2번 편측 난관 난소 적출을 선택한 경우에는 오른쪽인지 왼쪽인 지에 대해서도 응답하여야 한다. 여기서, 응답 선택 번호는 1번 또는 2번이다. 각각의 진단 표준 질문 데이터는 질의에 대응하여 선택하는 응답 선택 번호를 포함한다. 본 발명은 선택 진료과로 산부인과를 예시하고, 부인과 기반의 수술 결과 보고서를 음성 인식으로 수술 절차 및 진단 결과를 입력할 수 있으며, 응답 선택 신호를 번호로 구성하여 발음에 따른 입력값 인식의 부정확성을 방지 할 수 있다. 도 2는 본 발명의 실시예에 따른 수술결과보고서 제공 서버의 내부 구성을 간략하게 나타낸 블록도이고, 도 3은 본 발명의 실시예에 따른 부인과 수술 절차 및 진단 표준 질문 데이터의 일례를 나타낸 도면이고, 도 4는 본 발 명의 실시예에 따른 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 방법을 나타낸 전체 개념 도이다. 본 발명의 실시예에 따른 수술결과보고서 제공 서버는 수술 결과 보고서 데이터베이스부, 입력 데이 터 처리부, 표준 질문 생성부, 질의 응답 생성부, 제어부, 수신부, ASR 모듈,NLU 모듈, 음성 합성 모듈, 전송부(119b), 디스플레이부, 학습 세트 생성부 및 인공 신경 처리 망을 포함한다. 수술 결과 보고서 데이터베이스부는 진료과에 따른 표준 수술 결과 보고서를 복수개 저장하고, 저장 시 수 술 결과 보고서를 전처리를 수행하여 문자열 형태의 포맷으로 변환하여 저장한다. 입력 데이터 처리부는 수술 결과 보고서 데이터베이스부로부터 수술 결과 보고서를 수신하는 경우, 수신한 수술 결과 보고서의 텍스트 문장 구조를 형태론적, 구문론적, 의미론적으로 분석하여 벡터값을 산출할 수 있다. 입력 데이터 처리부는 수술 결과 보고서의 텍스트 문장 구조인 문자열 형태를 NLP(Natural Language Understanding) 모듈(미도시)에 의해 개체(Entity)와 의미구(Intent)로 구분하고, 벡터화 모듈(미도시)에 의해 구분된 개체와 의미구를 벡터값으로 처리한다. NLP 모듈은 최소 의미 단위인 형태소 분석, 어간 추출, 불용어 추출 등의 기능을 포함할 수 있다. 벡터화 모듈은 구분된 개체와 의미구를 Sen2vec, Word2vec 등을 이용한 벡터값으로 처리한다. 표준 질문 생성부는 입력 데이터 처리부로부터 수신한 수술 결과 보고서의 개체와 의미구로 이루어진 문자열 데이터에서 키워드를 추출하여 의료 정보를 포함한 문장 데이터를 생성한다. 표준 질문 생성부는 데이터베이스 검색을 위해서 문장 데이터마다 인덱스를 레이블링하여 의료 정보를 포 함한 부인과 수술 절차 및 진단 표준 질문 데이터를 각각 생성한다. 다른 실시예로서, 표준 질문 생성부는 키워드를 출현 빈도수에 따라 선택하고, 키워드의 빈도수가 기설정 된 횟수 이상인 경우, 진단 표준 질문 데이터의 생성 시 필요한 키워드로 선택한다. 부인과 수술 절차 및 진단 표준 질문 데이터는 다양한 의료 데이터로 환자 생성 데이터, 증상 데이터, 진단 데 이터, 수술 과정 데이터, 수술 결과 데이터 등을 포함할 수 있다. 질의 응답 생성부는 질의인 진단 표준 질문 데이터에서 쿼리 영역인 응답 선택 번호를 추출하고, 쿼리 영 역에 대한 응답 데이터를 생성한다. 질의 응답 생성부는 질의인 진단 표준 질문 데이터에 대응하는 응답 데이터를 추출하여 생성한다. 제어부는 질의 응답 생성부로부터 진단 표준 질문 데이터와 이에 대응하는 응답 데이터를 수신하여 학습 세트 생성 모듈로 전송한다. 각각의 진단 표준 질문 데이터는 질의에 대응하여 선택하는 응답 선택 번호를 포함한다. 제어부는 각각의 진단 표준 질문 데이터를 음성 신호로 변환하여 사용자 단말기로 전송하고, 사용자 단말기로부터 응답 선택 번호를 음성 신호로 입력받아 수신하고, 인공 신경 처리망을 통해 응답 선택 번호에 대응하는 응답 데이터를 출력한다. 제어부는 출력한 응답 데이터를 고려하여 수술 절차, 수술 및 진단 결과를 포함한 최종 수술 결과 보고서 를 생성한다. 본 발명의 실시예에 따른 인공 지능 장치는 학습 세트 생성 모듈 및 인공 신경 처리망을 포함한다. 학습 세트 생성 모듈은 학습 데이터 처리부, 학습부 및 분류부를 포함한다. 인공 신경 처리망은 입력층, 컨볼루션 레이어부, 풀링 레이어부 및 풀리 커넥티드 레이어부로 이루어진 은닉층, 출력층을 포함한다. 학습 데이터 처리부는 입력 데이터 처리부로부터 수신한 복수의 진단 표준 질문 데이터(인덱스 포 함)와 응답 데이터를 수신하고, 학습 데이터로 분산하여 저장한다. 학습 데이터 처리부는 분산 병렬 처리 가 가능한 데이터베이스부로 형성될 수 있다. 인공 신경 처리망은 학습 데이터 처리부에 저장된 학습 데이터의 진단 표준 질문 데이터를 신경망에 입력시켜 오류를 수정하고, 수정된 오류를 이용하여 각각의 진단 표준 질문 데이터에 대응하는 응답 데이터를 출력한다.이때, 인공 신경 처리망은 심층 컨볼루션 신경망(Deep Convolutional Neural Neworks, CNNs)을 이용하고, 입력층, 은닉층, 출력층을 포함할 수 있다. 입력층은 학습 데이터 처리부에 저장된 학습 데이터를 획득하고, 획득한 학습 데이터를 특징맵을 가 지는 레이어로 저장한다. 여기서, 특징맵은 다수의 노드들이 2차원으로 배열된 구조를 가짐으로써 후술되는 은 닉층과의 연결을 용이하게 할 수 있다. 은닉층은 상위 계층에 위치한 레이어의 특징맵을 획득하고, 획득한 특징맵으로부터 점차 높은 수준의 특징 을 추출한다. 은닉층은 하나 또는 그 이상으로 형성될 수 있으며 컨볼루션 레이어부, 풀링 레이어부 및 풀리 커넥티드 레이어부를 포함한다. 컨볼루션 레이어부는 학습 데이터로부터 컨볼루션 연산을 수행하는 구성으로서, 복수의 입력 특징맵과 연 결되는 특징맵을 포함한다. 풀링 레이어부는 컨볼루션 레이어부의 출력을 입력으로 받아 컨볼루션 연산, 즉 서브 샘플링 연산을 수행하는 구성이고, 은닉층의 하위 계층에 위치한 컨볼루션 레이어부가 가지는 입력 특징맵의 수와 동일한 수의 특징맵을 포함하며, 각각의 특징맵은 입력 특징맵과 일대일로 연결된다. 풀리 커넥티드 레이어부는 컨볼루션 레이어부의 출력을 입력으로 받아 출력층에서 출력되는 각 카테고리별 출력에 맞게 학습하는 구성이고, 학습된 국소적 정보, 즉 특징들을 종합하여 추상적인 내용을 학습 한다. 이때, 은닉층이 풀링 레이어부를 구비할 경우, 폴링 커넥티드 레이어부는 폴링 레이어부와 연결되며, 폴링 레이어부의 출력으로부터 특징들을 종합하여 추상적인 내용을 학습한다. 출력층은 소프트 맥스(soft-max) 등의 함수를 이용하여 분류하고자 원하는 각 카테고리별 출력을 확률값으 로 매핑한다. 이때, 출력층에서 출력된 결과는 학습부 또는 분류부로 전달되어 오류역전파를 수 행하거나 응답 데이터로 출력될 수도 있다. 학습부는 지도 학습을 수행하는 것으로, 지도 학습은 학습 데이터에 기계학습 알고리즘을 적용하여 함수를 추론하고, 그 추론된 함수를 통해 해답을 찾는다. 학습부는 지도 학습을 통해서 학습 데이터를 대표하는 선형 모델을 생성하고, 그 선형 모델을 통해 미래의 사건을 예측할 수 있다. 학습부는 이전까지 학습된 데이터를 근거로 새로운 데이터가 기존에 학습된 데이터에 어떻게 분류되는지 판단한다. 학습부는 부인과 수술 절차 및 진단 표준 질문 데이터를 인공 신경 처리망의 학습을 수행하고, 유형 별 딥러닝 특징값을 이용하여 각 진단 표준 질문 데이터에 대응하는 응답 데이터를 학습한다. 본 발명의 일실시예에서 인공 신경 처리망의 학습은 지도 학습(supervised-learning)으로 이루어진다. 지도 학습은 학습 데이터와 그에 대응하는 출력 데이터를 함께 인공 신경 처리망에 입력하고, 학습 데이터 에 대응하는 출력 데이터가 출력되도록 연결된 간선들의 가중치를 업데이트 하는 방법이다. 일예로, 본 발명의 인공 신경 처리망은 델타 규칙 및 오류역전파 학습 등을 이용하여 인공뉴런들 사이의 연결 가중치를 업데 이트 할 수 있다. 오류역전파(Error-back-propagation) 학습은 주어진 학습 데이터에 대해 전방계산(Feed-Forward)으로 오류를 추정한 후, 출력 레이어에서 시작하여 은닉층과 입력층 방향인 역방향으로 추정한 오류를 전파하고, 오류를 줄이는 방향으로 인공 뉴런들 사이의 연결 가중치를 업데이트한다. 학습부는 입력층 - 은닉층 - 폴링 커넥티드 레이어부 - 출력층을 통해 획득된 결과로 부터 오차를 계산하고, 계산된 오차를 보정하기 위해 다시 출력층 - 폴링 커넥티드 레이어부 - 은닉 층 - 입력층의 순서로 오류를 전파하여 연결 가중치를 업데이트할 수 있다. 학습부는 인공 신경 처리망을 이용하여 입력되는 각각의 진단 표준 질문 데이터(인덱스 포함)의 특징 값들이 입력 벡터가 되며, 입력층, 은닉층, 출력층을 통과하면, 각각의 진단 표준 질문 데이터 에 포함된 응답 데이터를 출력 벡터로 생성하도록 지도 학습을 통해 학습된다.학습부는 각각의 진단 표준 질문 데이터와 이에 대응하는 응답 데이터를 학습 데이터로 하여 인공 신경 처 리망과 연동하여 인공지능에 학습한다. 분류부는 입력되는 응답 선택 번호를 이용하여 진단 표준 질문 데이터에 포함된 응답 데이터를 출력한다. 인공 신경 처리망은 입력값(진단 표준 질문 데이터)이 어떤 것이 들어오면 출력값(응답 데이터)이 어떤 나 와야 하는지 미리 알고 있다. 분류부는 학습부에서의 오류역전파를 통해 업데이트된 연결 가중치를 가지는 인공 신경 처리망 의 출력 데이터를 응답 데이터로 출력할 수 있다. 분류부는 업데이트된 연결 가중치를 가지는 인공 신경 처리망에 학습 데이터, 테스트 데이터 또는 학 습에 사용되지 않은 새 데이터가 입력되면, 입력층 - 은닉층 - 폴링 커넥티드 레이어부 - 출력 층을 통해 출력된 결과를 획득하여 응답 데이터로 출력할 수 있다. 분류부는 진단 표준 질문 데이터, 응답 선택 번호, 응답 데이터를 기반으로 최적화를 통해 딥러닝 기반 분 류기 모델을 생성한다. 분류부는 입력된 진단 표준 질문 데이터와, 응답 선택 번호가 딥러닝 기반 분류기 모델을 통해 응답 데이 터의 결과값으로 출력한다. 수신부는 사용자 단말기로부터 부인과 수술 절차 및 진단 표준 질문 데이터에 포함된 응답 선택 번호 를 사용자의 음성 신호로 수신한다. ASR(Automatic Speech Recognition) 모듈은 사용자 단말기로부터 수신된 사용자의 음성 신호를 텍스 트 데이터로 변환한다. ASR 모듈은 프론트-엔드 스피치 프리 프로세서(front-end speech pre-processor)를 포함한다. 프론트-엔 드 스피치 프리프로세서는 스피치 입력으로부터 대표적인 특징을 추출한다. 예를 들어, 프론트-엔드 스피치 프 리프로세서는 스피치 입력을 푸리에 변환을 수행하여 대표적인 다차원 벡터의 시퀀스로서 스피치 입력을 특징짓 는 스펙트럼 특징을 추출한다. 또한, ASR 모듈은 하나 이상의 스피치 인식 모델(예컨대, 음향 모델 및/또 는 언어 모델)을 포함하고, 하나 이상의 스피치 인식 엔진을 구현할 수 있다. 스피치 인식 모델의 예는 은닉 마 르코프 모델(hidden Markov models), 가우시안 혼합 모델(Gaussian-Mixture Models), 딥 신경망 모델(Deep Neural Network Models), n-gram 언어 모델, 및 기타 통계 모델 중 하나의 모델을 포함한다. ASR 모듈이 텍스트 문자열(예를 들어, 단어들, 또는 단어들의 시퀀스, 또는 토큰들의 시퀀스)을 포함하는 인식 결과를 생성하면, 인식 결과는 의도 추론을 위해 자연 언어 처리 모듈로 전달된다. 일부 예들에서, ASR 모 듈은 스피치 입력의 다수의 후보 텍스트 표현들을 생성한다. 각각의 후보 텍스트 표현은 스피치 입력에 대 응하는 단어들 또는 토큰들의 시퀀스이다. NLU(Natural Language Understanding) 모듈은 각각의 진단 표준 질문 데이터를 법적 분석(Syntactic Analyze) 또는 의미적 분석(Semantic Analyze)을 수행하여 자연어의 텍스트 문자열 의미를 파악한다. 문법적 분석은 문법 단위(예를 들어, 단어, 구, 형태소 등)를 나누고, 나누어진 단위가 어떠한 문법적인 요소를 갖는지 파악할 수 있다. 상기 의미적 분석은 의미(semantic) 매칭, 룰(rule) 매칭, 포뮬러(formula) 매칭 등을 이용하여 수행할 수 있다. 이에 따라, NUL 모듈은 사용자 입력이 어느 도메인(Domain), 의도(Intent) 또는 상기 의도를 표현하는데 필요한 파라미터(Parameter)를 획득할 수 있다. NLU 모듈은 도메인, 의도 및 상기 의도를 파악하는데 필요한 파라미터로 나누어진 매핑 규칙을 이용하여 사용자의 의도 및 파라미터를 결정할 수 있다. 음성 합성 모듈은 자연어의 텍스트 문자열을 음성 신호로 변환한다. 음성 합성 모듈은 텍스트로부터 의 스피치 출력을 생성하기 위하여 임의의 적절한 스피치 합성 기법을 사용하는데, 이는 편집 합성 (concatenative synthesis), 단위 선택 합성(unit selection synthesis), 다이폰 합성, 도메인-특정 합성, 포 먼트 합성(Formant synthesis), 조음 합성(Articulatory synthesis), HMM(hidden Markov model) 기반 합성 및 정현파 합성(sinewave synthesis)을 포함한다.제어부는 각각의 진단 표준 질문 데이터를 NLU(Natural Language Understanding) 모듈에 의해 문법 적 분석(Syntactic analyze) 또는 의미적 분석(semantic analyze)을 수행하여 자연어의 텍스트 문자열 의미를 파악하고, 음성 합성 모듈에 의해 자연어의 텍스트 문자열을 음성 신호로 변환한다. 제어부는 각각의 진단 표준 질문 데이터를 음성 신호로 변환하여 전송부(119b)를 통해 사용자 단말기(10 1)로 전송한다. 다른 실시예로서, 제어부는 진단 표준 질문 데이터에 포함된 인덱스의 순서에 따라 음성 신호로 변환하여 사용자 단말기로 전송한다. 사용자 단말기는 각각의 진단 표준 질문 데이터를 음성 신호로 하여 스피커(미도시)를 통해 출력한다. 수술결과보고서 제공 서버는 사용자 단말기로부터 각각의 진단 표준 질문 데이터에 대한 응답 선택 신호를 수신하는 경우, 인공 신경 처리망과 연동하여 응답 선택 신호의 오차 발생을 판단하고, 오차가 발 생하지 않으면, 진단 표준 질문 데이터와 응답 데이터를 입력 데이터로 표준 수술 결과 보고서로 설정하여 수술 결과 보고서 데이터베이부에 저장한다. 수술결과보고서 제공 서버는 사용자 단말기로부터 각각의 진단 표준 질문 데이터에 대한 응답 선택 신호를 수신하는 경우, 인공 신경 처리망과 연동하여 응답 선택 신호의 오차 발생을 판단하고, 오차가 발 생하면, 진단 표준 질문 데이터를 재질문하기 위한 재질문 요청 신호를 생성하여 표준 질문 생성부로 전 송한다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2021-0114807", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 시스템의 구 성을 나타낸 도면이다. 도 2는 본 발명의 실시예에 따른 수술결과보고서 제공 서버의 내부 구성을 간략하게 나타낸 블록도이다. 도 3은 본 발명의 실시예에 따른 부인과 수술 절차 및 진단 표준 질문 데이터의 일례를 나타낸 도면이다. 도 4는 본 발명의 실시예에 따른 음성 인식 플랫폼을 활용한 인공지능 기반의 수술결과보고서 제공 방법을 나타 낸 전체 개념도이다."}
