{"patent_id": "10-2023-0135990", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0052787", "출원번호": "10-2023-0135990", "발명의 명칭": "대량생산을 위한 복수의 3D 프린터 제어 장치 및 방법", "출원인": "재단법인 철원플라즈마 산업기술연구원", "발명자": "김민하"}}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대량생산을 위한 복수의 3D 프린터 제어 방법에 있어서, 사용자 단말로부터 3D 프린팅 제품에 대한 출력 요청 정보를 수신하는 단계;상기 출력 요청 정보에 기초하여 상기 사용자 단말에 복수의 추천 공정 정보를 제공하는 단계;상기 사용자 단말로부터 수신된 선택 입력을 기반으로 상기 복수의 추천 공정 정보 중 적어도 하나의 추천 공정정보를 수행 공정 정보로 결정하는 단계; 및상기 수행 공정 정보를 기반으로 복수의 3D 프린터를 제어하는 단계,를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 추천 공정 정보를 제공하는 단계는,복수의 관리자 단말 각각으로부터 장비 환경 정보를 포함하는 관리자 정보를 수신하는 단계;상기 복수의 관리자 단말 각각에 대한 상기 장비 환경 정보를 고려하여 상기 출력 요청 정보에 대한 복수의 제1추천 공정 정보를 생성하는 단계;상기 사용자 단말로부터 상기 복수의 제1 추천 공정 정보 중 적어도 하나의 추천 공정 정보에 대한 선택 입력을수신하는 단계; 및상기 선택 입력에 따른 상기 적어도 하나의 추천 공정 정보를 상기 사용자 단말에 제2 추천 공정 정보로서 제공하는 단계,를 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 복수의 추천 공정 정보를 제공하는 단계는,상기 복수의 제1 추천 공정 정보에 대한 출력 시뮬레이션을 수행하는 단계; 상기 출력 시뮬레이션의 결과에 따른 검증 정보 및 견적 정보를 생성하는 단계; 및상기 복수의 제1 추천 공정 정보에 대응하는 상기 검증 정보 및 상기 견적 정보를 사용자 단말에 제공하는단계,를 더 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 복수의 3D 프린터를 제어하는 단계는,상기 수행 공정 정보에 따라 구동되는 복수의 3D 프린터에 대한 상태 정보를 수집하는 단계; 상기 수행 공정 정보 및 상기 상태 정보를 관리자 단말에 송신하는 단계;상기 관리자 단말로부터 상기 수행 공정 정보 및 상기 상태 정보에 대한 제어 정보를 수신하는 단계; 및공개특허 10-2025-0052787-3- 상기 제어 정보에 기초하여 상기 복수의 3D 프린터를 제어하는 단계,를 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 출력 요청 정보는,상기 3D 프린팅 제품의 3D 도면 정보를 포함하는 것이고,상기 추천 공정 정보 및 상기 수행 공정 정보는,상기 3D 도면 정보에 대한 도면 리스트의 배치 정보, 세부 파라미터 정보 및 공정 순서 정보 중 적어도 하나의정보를 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 상태 정보는,상기 복수의 3D 프린터 각각에 대한 위치 정보, 현재 출력 중인 제품에 대한 제1 3D 도면 정보, 현재 출력 중인제품의 출력 이후 출력 예정인 제2 3D 도면 정보, 기 설정된 세부 파라미터 정보 및 상기 복수의 3D 프린터 각각의 구동 여부에 대한 공정 상태 정보 중 적어도 하나의 정보를 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 복수의 3D 프린터는,상기 관리자 단말을 통해 원격으로 제어되는 것인, 제어 방법."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "대량생산을 위한 복수의 3D 프린터 제어 장치에 있어서,사용자 단말로부터 3D 프린팅 제품에 대한 출력 요청 정보를 수신하는 수신부;상기 출력 요청 정보에 기초하여 상기 사용자 단말에 복수의 추천 공정 정보를 제공하는 공정 정보 추천부;상기 사용자 단말로부터 수신된 선택 입력을 기반으로 상기 복수의 추천 공정 정보 중 적어도 하나의 추천 공정정보를 수행 공정 정보로 결정하는 공정 정보 결정부; 및상기 수행 공정 정보를 기반으로 복수의 3D 프린터를 제어하는 제어부,를 포함하는, 제어 장치."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 공정 정보 추천부는,상기 수신부를 통해 복수의 관리자 단말 각각으로부터 수신된 장비 환경 정보를 포함하는 관리자 정보에대하여, 상기 복수의 관리자 단말 각각에 대한 장비 환경 정보를 고려하여 상기 출력 요청 정보에 대한 복수의제1 추천 공정 정보를 생성하고,상기 사용자 단말로부터 수신된 상기 복수의 제1 추천 공정 정보 중 적어도 하나의 추천 공정 정보에 대한 선택입력에 따른 적어도 하나의 추천 공정 정보를 상기 사용자 단말에 제2 추천 공정 정보로서 제공하는 것인, 제어장치."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2025-0052787-4-제9항에 있어서,상기 공정 정보 추천부는,상기 복수의 제1 추천 공정 정보에 대한 출력 시뮬레이션을 수행하고,상기 출력 시뮬레이션의 결과에 따른 검증 정보 및 견적 정보를 생성하고, 상기 복수의 제1 추천 공정 정보에 대응하는 상기 검증 정보 및 상기 견적 정보를 사용자 단말에 제공하는것인, 제어 방법."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 제어부는,상기 수행 공정 정보에 따라 구동되는 복수의 3D 프린터에 대한 상태 정보를 수집하고, 상기 수행 공정 정보 및상기 상태 정보를 관리자 단말에 송신하여 상기 관리자 단말로부터 수신된 상기 수행 공정 정보 및 상기 상태정보에 대한 제어 정보에 기초하여 상기 복수의 3D 프린터를 제어하는 것인, 제어 장치."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 출력 요청 정보는,상기 3D 프린팅 제품의 3D 도면 정보를 포함하는 것이고,상기 추천 공정 정보 및 상기 수행 공정 정보는, 상기 3D 도면 정보에 대한 도면 리스트의 배치 정보, 세부 파라미터 정보 및 공정 순서 정보 중 적어도 하나의정보를 포함하는 것인, 제어 장치."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 상태 정보는,상기 복수의 3D 프린터 각각에 대한 위치 정보, 현재 출력 중인 제품에 대한 제1 3D 도면 정보, 현재 출력 중인제품의 출력 이후 출력 예정인 제2 3D 도면 정보, 세부 파라미터 정보 및 상기 복수의 3D 프린터 각각의 구동여부에 대한 공정 상태 정보 중 적어도 하나의 정보를 포함하는 것인, 제어 장치."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 복수의 3D 프린터는, 상기 관리자 단말을 통해 원격으로 제어되는 것인, 제어 장치."}
{"patent_id": "10-2023-0135990", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "대량생산을 위한 복수의 3D 프린터 제어 시스템에 있어서,출력하고자 하는 3D 프린팅 제품에 대한 출력 요청 정보 및 상기 출력 요청 정보에 대한 공정 정보를 선택하는선택 입력을 3D 프린터 제어 장치로 송신하는 사용자 단말;상기 사용자 단말로부터 수신된 출력 요청 정보에 기초하여 상기 사용자 단말에 복수의 추천 공정 정보를 제공하고, 상기 사용자 단말로부터 수신된 선택 입력을 기반으로 상기 복수의 추천 공정 정보 중 적어도 하나의 추천 공정 정보를 수행 공정 정보로 결정하고, 상기 수행 공정 정보를 기반으로 복수의 3D 프린터를 제어하는 3D프린터 제어 장치; 및상기 3D 프린터 제어 장치로부터 수신되는 제어 정보에 따라 구동되는 복수의 3D 프린터,공개특허 10-2025-0052787-5-를 포함하는, 제어 시스템."}
{"patent_id": "10-2023-0135990", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "대량생산을 위한 복수의 3D 프린터 제어 방법에 관한 것이며, 대량생산을 위한 복수의 3D 프린터 제어 방법은, 사용자 단말로부터 3D 프린팅 제품에 대한 출력 요청 정보를 수신하는 단계, 상기 출력 요청 정보에 기초하여 상 기 사용자 단말에 복수의 추천 공정 정보를 제공하는 단계, 상기 사용자 단말로부터 수신된 선택 입력을 기반으 로 상기 복수의 추천 공정 정보 중 적어도 하나의 추천 공정 정보를 수행 공정 정보로 결정하는 단계 및 상기 수 행 공정 정보를 기반으로 복수의 3D 프린터를 제어하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0135990", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 대량생산을 위한 복수의 3D 프린터 제어 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0135990", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "1983년 세계 최초의 3D 프린터가 개발되어, 1988년 상용화 된 후, 3D 프린터는 현재까지 하드웨어 및 소프트웨 어 측면에서 재료와 경화 방식 등에 대한 기술 개발이 이루어지고 있다. 최근에는 3D 프린터를 이용하여 사출 또는 다이캐스팅을 대체할 수 있는 대량 생산 기술에 대한 연구가 활발히 진행되고 있으며, 기존의 양상 시스템으로는 생산될 수 없는 일체형 디자인 구조 등의 사출이 어렵거나 불가능 한 구조에 대한 대량 제작 시스템의 개발이 진행되고 있다. 다만, 3D 프린터를 이용한 대량 생산 시스템은, 다수의 3D 프린터를 비롯한 장비를 직병렬로 배치하여 관리하는 것으로, 장비의 수가 증가됨에 따라 관리자가 직접 장비를 운영하고 관리하는 것에 한계가 발생한다. 따라서, 관리자가 직접 운영 및 관리하기 어려운 다수의 장비의 상태((Idle, Run, Fail, Complete 등)를 파악하 고, 생산할 제품에 대한 3D 도면을 배치할 수 있는 제어 플랫폼의 구축이 요구되며, 나아가 다수의 3D 프린터의 효율적 운영 및 체계적 제품 생산을 위한 주문, 생산, 품질 평가 및 유통 등의 과정을 관리할 수 있는 제어 플 랫폼이 요구된다. 본원의 배경이 되는 기술은 한국등록특허공보 제10-1808040호에 개시되어 있다."}
{"patent_id": "10-2023-0135990", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 복수의 관리자 단말로부터 수신한 제어 정보에 기초하여 다수의 3D 프린터를 포함하는 다수의 공정 장비 각각을 원격으로 제어함으로써, 3D 프린팅 제품의 생 산 라인을 시스템화 하여 3D 프린팅 제품의 대량 생산을 할 수 있는, 대량생산을 위한 복수의 3D 프린터 제어 방법을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 사용자 단말로부터 수신한 출력 요청 정보를 기 반으로 3D 프린팅 제품을 출력함으로써, 다수의 사용자가 각각 요구하는 다양한 형태 및 구조의 제품을 대량으 로 생산(제작)할 수 있는, 대량생산을 위한 복수의 3D 프린터 제어 방법을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0135990", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 방법은, 사용자 단말로부터 3D 프린팅 제품에 대한 출력 요청 정보를 수신하는 단계. 상기 출력 요 청 정보에 기초하여 상기 사용자 단말에 복수의 추천 공정 정보를 제공하는 단계, 상기 사용자 단말로부터 수신 된 선택 입력을 기반으로 상기 복수의 추천 공정 정보 중 적어도 하나의 추천 공정 정보를 수행 공정 정보로 결 정하는 단계 및 상기 수행 공정 정보를 기반으로 복수의 3D 프린터를 제어하는 단계를 포함할 수 있다. 본원의 일 실시예에 따르면, 상기 복수의 추천 공정 정보를 제공하는 단계는, 복수의 관리자 단말 각각으로부터 장비 환경 정보를 포함하는 관리자 정보를 수신하는 단계, 상기 복수의 관리자 단말 각각에 대한 상기 장비 환 경 정보를 고려하여 상기 출력 요청 정보에 대한 복수의 제1 추천 공정 정보를 생성하는 단계, 상기 사용자 단 말로부터 상기 복수의 제1 추천 공정 정보 중 적어도 하나의 추천 공정 정보에 대한 선택 입력을 수신하는 단계 및 상기 선택 입력에 따른 상기 적어도 하나의 추천 공정 정보를 상기 사용자 단말에 제2 추천 공정 정보로서 제공하는 단계를 포함하는 것일 수 있다.본원의 일 실시예에 따르면, 상기 복수의 추천 공정 정보를 제공하는 단계는, 상기 복수의 제1 추천 공정 정보 에 대한 출력 시뮬레이션을 수행하는 단계, 상기 출력 시뮬레이션의 결과에 따른 검증 정보 및 견적 정보를 생 성하는 단계 및 상기 복수의 제1 추천 공정 정보에 대응하는 상기 검증 정보 및 상기 견적 정보를 사용자 단말 에 제공하는 단계를 더 포함하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 복수의 3D 프린터를 제어하는 단계는, 상기 수행 공정 정보에 따라 구동되는 복수의 3D 프린터에 대한 상태 정보를 수집하는 단계, 상기 수행 공정 정보 및 상기 상태 정보를 관리자 단말에 송신하는 단계, 상기 관리자 단말로부터 상기 수행 공정 정보 및 상기 상태 정보에 대한 제어 정보를 수신하는 단계 및 상기 제어 정보에 기초하여 상기 복수의 3D 프린터를 제어하는 단계를 포함하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 출력 요청 정보는, 상기 3D 프린팅 제품의 3D 도면 정보를 포함하는 것이고, 상기 추천 공정 정보 및 상기 수행 공정 정보는, 상기 3D 도면 정보에 대한 도면 리스트의 배치 정보, 세부 파 라미터 정보 및 공정 순서 정보 중 적어도 하나의 정보를 포함하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 상태 정보는, 상기 복수의 3D 프린터 각각에 대한 위치 정보, 현재 출력 중인 제품에 대한 제1 3D 도면 정보, 현재 출력 중인 제품의 출력 이후 출력 예정인 제2 3D 도면 정보, 기 설정된 세 부 파라미터 정보 및 상기 복수의 3D 프린터 각각의 구동 여부에 대한 공정 상태 정보 중 적어도 하나의 정보를 포함하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 복수의 3D 프린터는, 상기 관리자 단말을 통해 원격으로 제어되는 것일 수 있 다. 상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 장치는, 사용자 단말로부터 3D 프린팅 제품에 대한 출력 요청 정보를 수신하는 수신부, 상기 출력 요청 정보에 기초하여 상기 사용자 단말에 복수의 추천 공정 정보를 제공하는 공정 정보 추천부, 상기 사용자 단말로부터 수신된 선택 입력을 기반으로 상기 복수의 추천 공정 정보 중 적어도 하나의 추천 공정 정보를 수행 공정 정보로 결정하는 공정 정보 결정부 및 상기 수행 공정 정보를 기반으로 복수의 3D 프린터를 제어하는 제어 부를 포함할 수 있다. 본원의 일 실시예에 따르면, 상기 공정 정보 추천부는, 상기 수신부를 통해 복수의 관리자 단말 각각으로부터 수신된 장비 환경 정보를 포함하는 관리자 정보에 대하여, 상기 복수의 관리자 단말 각각에 대한 장비 환경 정 보를 고려하여 상기 출력 요청 정보에 대한 복수의 제1 추천 공정 정보를 생성하고, 상기 사용자 단말로부터 수 신된 상기 복수의 제1 추천 공정 정보 중 적어도 하나의 추천 공정 정보에 대한 선택 입력에 따른 적어도 하나 의 추천 공정 정보를 상기 사용자 단말에 제2 추천 공정 정보로서 제공하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 공정 정보 추천부는, 상기 복수의 제1 추천 공정 정보에 대한 출력 시뮬레이 션을 수행하고, 상기 출력 시뮬레이션의 결과에 따른 검증 정보 및 견적 정보를 생성하고, 상기 복수의 제1 추 천 공정 정보에 대응하는 상기 검증 정보 및 상기 견적 정보를 사용자 단말에 제공하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 제어부는, 상기 수행 공정 정보에 따라 구동되는 복수의 3D 프린터에 대한 상 태 정보를 수집하고, 상기 수행 공정 정보 및 상기 상태 정보를 관리자 단말에 송신하여 상기 관리자 단말로부 터 수신된 상기 수행 공정 정보 및 상기 상태 정보에 대한 제어 정보에 기초하여 상기 복수의 3D 프린터를 제어 하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 출력 요청 정보는, 상기 3D 프린팅 제품의 3D 도면 정보를 포함하는 것이고, 상기 추천 공정 정보 및 상기 수행 공정 정보는, 상기 3D 도면 정보에 대한 도면 리스트의 배치 정보, 세부 파 라미터 정보 및 공정 순서 정보 중 적어도 하나의 정보를 포함하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 상태 정보는, 상기 복수의 3D 프린터 각각에 대한 위치 정보, 현재 출력 중인 제품에 대한 제1 3D 도면 정보, 현재 출력 중인 제품의 출력 이후 출력 예정인 제2 3D 도면 정보, 기 설정된 세 부 파라미터 정보 및 상기 복수의 3D 프린터 각각의 구동 여부에 대한 공정 상태 정보 중 적어도 하나의 정보를 포함하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 복수의 3D 프린터는, 상기 관리자 단말을 통해 원격으로 제어되는 것일 수 있 다. 상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 시스템은, 출력하고자 하는 3D 프린팅 제품에 대한 출력 요청 정보 및 상기 출력 요청 정보에 대한공정 정보를 선택하는 선택 입력을 3D 프린터 제어 장치로 송신하는 사용자 단말, 상기 사용자 단말로부터 수신 된 출력 요청 정보에 기초하여 상기 사용자 단말에 복수의 추천 공정 정보를 제공하고, 상기 사용자 단말로부터 수신된 선택 입력을 기반으로 상기 복수의 추천 공정 정보 중 적어도 하나의 추천 공정 정보를 수행 공정 정보 로 결정하고, 상기 수행 공정 정보를 기반으로 복수의 3D 프린터를 제어하는 3D 프린터 제어 장치 및 상기 3D 프린터 제어 장치로부터 수신되는 제어 정보에 따라 구동되는 복수의 3D 프린터를 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2023-0135990", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 복수의 관리자 단말로부터 수신한 제어 정보에 기초하여 다수의 3D 프 린터를 포함하는 다수의 공정 장비 각각을 원격으로 제어함으로써, 3D 프린팅 제품의 생산 라인을 시스템화 하 여 3D 프린팅 제품의 대량 생산을 수행할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 사용자 단말로부터 수신한 출력 요청 정보를 기반으로 3D 프린팅 제품 을 출력함으로써, 다수의 사용자가 각각 요구하는 다양한 형태 및 구조의 제품을 대량으로 생산(제작)할 수 있 다. 전술한 본원의 과제 해결 수단에 의하면, 내부 환경 플랫폼을 통해 장비관리자에게 다수의 3D 프린터의 관리 솔 루션을 제공하고, 외부 환경 플랫폼을 통해 장비사업자에게 3D 프린터 출력을 원하는 사용자를 연결시켜주는 솔 루션을 제공할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2023-0135990", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 대량생산을 위한 복수의 3D 프린터 제어 장치에 관한 것이다. 도 1은 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 시스템의 개략적인 구성도이다. 도 1을 참조하면, 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 시스템은, 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 장치(이하, '본 장치'라 한다.), 복수의 3D 프린터, 현장 단말, 관리자 단말 및 사용자 단말을 포함할 수 있다. 본 장치, 복수의 3D 프린터, 현장 단말, 관리자 단말 및 사용자 단말 상호 간은 네트 워크를 통해 통신할 수 있다. 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트 워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 유무선 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 블루투스(Bluetooth) 네트워크, Wifi 네트워 크, NFC(Near Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함될 수 있으나, 이에 한정된 것은 아니다. 또한, 본원의 실시예에 관한 설명에서 현장 단말, 관리자 단말 및 사용자 단말 등을 포함하는 단말은 네트워크를 통해 본 장치와 연동되는 디바이스로서, 예를 들면, 스마트폰(Smartphone), 스마트패드 (Smart Pad), 태블릿 PC, 웨어러블 디바이스 등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단 말기 같은 모든 종류의 무선 통신 장치 및 데스크탑 컴퓨터, 스마트 TV와 같은 고정용 단말기일 수도 있다. 또한, 본원의 실시예에 관한 설명에서 복수의 3D 프린터는, 엄밀히 3D 프린팅 제품의 생산 과정에 요구되 는 복수의 공정 장비에 포함되는 것이나, 설명의 편의를 위해 3D 프린팅 제품의 생산 과정에 요구되는 복수의 공정 장비를 통틀어 복수의 3D 프린터로 표현한 것일 수 있다. 다시 말해, 복수의 3D 프린터는, 3D 프린터 그 자체만을 포함하는 것일 수도 있으나, 본원의 설명에서 3D 프린터를 포함하는 3D 프린팅 제품 생산을 위한 공정 장비 모두 혹은 적어도 일부를 포함하는 것일 수도 있다. 3D 프린팅 제품 생산을 위한 공정 장비에 대해서는 도 2를 참조하여 상세히 후술하기로 한다. 본원의 일 실시예에 따르면, 본 장치는, 웹 사이트 및 애플리케이션 등을 통해 현장 단말, 관리자 단 말 및 사용자 단말로부터 입력을 수신하거나, 현장 단말, 관리자 단말 및 사용자 단말 에 정보를 제공할 수 있다. 한편, 현장 단말은, 복수의 3D 프린터를 포함하는 공정 장비가 위치한 공정 현장에 배치되는 단말로, 현장에서 공정 장비에 대한 이슈 발생 시 복수의 공정 장비를 직접 관리하기 위한 현장 작업자에 의해 사용되는 것일 수 있다. 또한, 관리자 단말은, 공정 현장에 적어도 복수의 3D 프린터를 포함하는 공정 장비를 보유한 장비 관 리자(장비 사업자)에 의해 사용되는 단말로, 본 장치를 통해 공정 현장에 위치한 장비 관리자가 보유하고 있는 복수의 공정 장비에 대한 정보를 수신하고, 복수의 공정 장비를 제어하기 위한 제어 정보를 송신하는 것일 수 있다. 이때, 공정 현장에는 복수의 장비 관리자가 각각 보유하고 있는 다수의 공정 장비가 배치되는 것일 수있고, 각각의 장비 관리자는 자신이 보유한 공정 장비에 대한 정보 수신 및 송신이 가능한 것일 수 있다. 또한, 사용자 단말은, 출력하고자 하는 3D 프린팅 제품의 생산을 의뢰하는 사용자(개인, 개인 사업자 및 법인 사업자 등)의 단말로, 출력하고자 하는 3D 프린팅 제품에 대한 3D 도면 및 생산량 등을 포함하는 출력 요 청 정보를 인가 받아 본 장치에 송신하고, 해당 3D 프린팅 제품의 생산에 적용될 공정 장비와 해당 공정 장비를 보유한 장비 관리자에 대한 관리자 정보 및 공정 장비의 공정 과정에 대한 공정 정보를 수신할 수 있다. 또한, 사용자 단말은, 수신한 관리자 정보 및 공정 정보 중 출력을 요청할 관리자 및 공정에 대한 정보를 선택하는 선택 입력을 인가 받아 본 장치에 송신할 수 있다. 본원의 일 실시예에 따르면, 본 장치는, 사용자 단말로부터 수신된 출력 요청 정보에 기초하여 사용 자 단말에 복수의 추천 공정 정보를 제공하고, 사용자 단말로부터 수신된 선택 입력을 기반으로 복수 의 추천 공정 정보 중 적어도 하나의 추천 공정 정보를 수행 공정 정보로 결정하고, 수행 공정 정보를 기반으로 복수의 3D 프린터를 제어할 수 있다. 즉, 복수의 3D 프린터는, 본 장치로부터 수신되는 제어 정 보에 따라 구동되는 것일 수 있다. 한편, 본원의 일 실시예에 따르면, 본 장치는 3D 프린터의 대량 양산 서비스를 제공하기 위해 다수의 공정장비를 네트워크로 묶고, 각각의 장비를 제어하기 위한 '내부 환경 플랫폼'과 장비사업자와 사용자를 대상으로 하는 '외부 환경 플랫폼'을 구분하여 제공하는 것일 수 있으나, 이에만 한정되는 것은 아니다. 달리 말해, 본원의 실시예에 관한 설명에서 본 장치와 다수의 공정장비 사이에서 수행되는 각종 제어 내지 상호 작용에 관한 사항은 '내부 환경 플랫폼'인 것으로 지칭되고, 본 장치와 각 사용자(예를 들면, 장비사업자 등) 간의 상호 작용에 관한 사항은 '외부 환경 플랫폼'인 것으로 지칭되는 것일 수 있으나, 본원의 구현예에 따 라서는 외부 환경 플랫폼과 내부 환경 플랫폼을 별도로 구분하지 않는 형태로 복수의 3D 프린터 제어 시스템 이 구축될 수 있음은 물론이다. 보다 구체적으로 본원의 실시예에 관한 설명에서 내부 환경 플랫폼은 '장비탭', '3D도면탭', '장비접속탭', '데 이터정보탭' 등으로 예시적으로 구성될 수 있으며, 이 중 '장비탭'에서는 전체 장비 설비의 모습과 장비의 상태 를 표시하고, '3D도면탭'에서는 현재 진행 중이거나 예약이 된 3D 도면의 리스트와 해당 도면에 따른 공정장비 의 순서를 표기하고, '장비접속탭'은 원격으로도 직접 장비에 접속하여 파라미터를 변경할 수도 있도록 하는 하 위 모듈일 수 있으며, 이러한 내부 환경 플랫폼을 통해 장비의 상태 및 파라미터값의 확인이 가능할 수 있고, '데이터정보탭'에서는 현재 가동되고 있는 모든 실시간 장비데이터를 수집하여 데이터베이스화 하도록 동작할 수 있으나, 이에만 한정되는 것은 아니다. 이러한 내부 환경 플랫폼과 구분하여, 외부 환경 플랫폼은 장비사업자와 사용자를 대상으로 하는 두 개의 플랫 폼을 포함할 수 있으며, 장비사업자용은 기존의 내부 환경 플랫폼의 탭들은 실시간 연동하여 그대로 사용하며, 부가적인 탭을 추가로 두어 장비관리에 관한 설정을 적용할 수 있도록 구축(예를 들면, '장비사용료탭' 등을 통 한 장비 사용료 설정 등)될 수 있다. 한편, 보유 3D프린터를 최초 플랫폼에 등록시 '출력사이트카드'가 생성(제작)될 수 있고, 해당 카드는 사용자에 게 출력될 수 있다. 또한, 외부 환경 플랫폼의 사용자에 대하여 '장비탭', '공정탭', '파일수정탭', '장비사용 료탭' 등이 활성화 될 수 있으며, 이 중 '공정탭'에서는 장비사업자가 설정해둔 공정장비의 순서를 선택할 수 있으며, 나아가 딥러닝 등 인공지능 기반 기술을 활용하여 실시간 추천 장비 리스트를 제공할 수 있다. 또한, '파일수정탭'은 공정을 진행하기 위해 외부 환경 플랫폼에서 제공하는 가상의 장비 프로그램을 활용하여 파일이 최종적으로 수정되며, 최종적으로 '장비사용료탭'에서 안내사항 및 동의사항 확인 후 결재를 통해 출력 을 원격으로 의뢰하도록 동작할 수 있으나, 이에만 한정되는 것은 아니다. 이하에서는, 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 장치에서 수행되는 대량생 산을 위한 복수의 3D 프린터 제어 프로세스에 대해 상세히 설명하기로 한다. 본원의 일 실시예에 따르면, 본 장치는, 사용자 단말로부터 3D 프린팅 제품에 대한 출력 요청 정보를 수신할 수 있다. 이때, 출력 요청 정보는, 3D 프린팅 제품의 3D 도면 정보, 3D 프린팅 제품의 생산량, 출력을 위한 장비가 위치한 장소(장비 현장의 위치), 장비의 연식이나 모델명을 포함하는 장비 조건 및 허용 가능한 최 대 사용료 중 적어도 하나의 정보를 포함하는 것일 수 있다. 본원의 일 실시예에 따르면, 본 장치는, 사용자 단말로부터 수신한 출력 요청 정보에 기초하여 사용 자 단말에 복수의 추천 공정 정보를 제공할 수 있다. 이때, 본 장치는, 복수의 관리자 단말로부 터 수신한 각각의 관리자 정보를 고려하여 사용자 단말에 복수의 추천 공정 정보를 제공하는 것일 수있다. 구체적으로, 본 장치는, 복수의 관리자 단말 각각으로부터 관리자 식별 정보, 장비 환경 정보, 보유 장비 정보, 사용 필라멘트 정보 및 장비 사용료를 포함하는 관리자 정보를 수신하고, 수신한 관리자 정보에 기 초하여 관리자 정보를 송신한 관리자 단말을 각각 본 장치에 등록시키는 것일 수 있다. 도 2는 관리자 단말의 등록 시 부여되는 관리자 카드를 예시적으로 나타내는 도면이다. 도 2를 참조하면, 본 장 치는, 수신한 관리자 정보를 포함하는 관리자 카드를 생성하고, 생성한 관리자 카드를 관리자 정보에 대응 하는 관리자 단말에 부여함으로써, 해당 관리자 단말을 등록시키는 것일 수 있다. 이때, 관리자 카드는, 도 2에 예시한 바와 같이, 관리자(장비 사업자)의 이름, 관리자에 대한 문의를 남길 수 있는 관리자의 전화번호, 이메일 등을 포함하는 관리자 식별 정보, 장비가 장비 현장에 구축되어 있는 전경 이 미지를 포함하는 장비 환경 정보, FDM 및 3차원 스캐너 등의 보유하고 있는 장비의 개수 등을 포함하는 보유 장 비 정보, 출력할 3D 프린팅 제품의 높이(mm) 및 부피(mm2), 장비의 사용에 소요되는 시간, 장비의 사용 횟수(건) 중 어느 하나에 대한 기본 사용료 등을 포함하는 장비 사용료 등이 표시되는 것일 수 있으며, 부가적 으로, 관리자 카드에는 본 장치를 구축 및 운영하는 기관/기업명(도 2를 참조하여 예를 들면, (재)철원플 라즈마산업기술연구원)과 해당 기관/기업의 주소(도 2를 참조하여 예를 들면, 강원도 철원군 서면 금강로 7194 공장동2동) 등이 더 표시되는 것일 수도 있다. 이와 관련하여, 본 장치는, 관리자 단말의 등록을 위해 동의 입력 수신, 공정 번호 및 순서 정보의 수신, 장비 사용료에 대한 검증 및 테스트, 관리자 단말과 공정 현장의 연동, 저작권 안내를 포함하는 안 내사항 제공 및 전자서명 수신 등의 과정을 더 수행하는 것일 수 있다. 구체적으로, 본 장치는, 관리자 단말의 등록 시, 관리자 단말에 대응하는 관리자에 대한 장비 환경 정보 및 보유 장비 정보의 수집에 대한 동의 여부를 관리자 단말로부터 수신하고, 동의에 대한 입력 을 수신한 경우에 관리자 단말을 등록시키는 것일 수 있다. 또한, 본 장치는, 관리자 단말의 등록 시, 보유 장비에 대한 장비 별 지정된 공정 번호 및 공정 번호 에 기초한 공정 순서 정보를 더 수신할 수 있다. 공정 번호는, 보유 장비를 이용하여 수행 가능한 공정 순서, 즉 공정 순서에 대한 순서 제약 조건을 파악하기 위한 것으로, 보유 장비의 종류에 따라 각각 부여되는 것일 수 있다. 본 장치는, 예시적으로 컴퓨터 언어/코드를 통해 공정 번호에 대한 순서 제약 조건을 공정 순서 정 보로서 수신하는 것일 수 있다. 일예로, 복수의 공정 장비 중, 3D 프린터의 공정 번호는 1번, 부속 제어 장치의 공정 번호는 2번, 3 차원 스캐너의 공정 번호는 3번, 퍼티코팅기의 공정 번호는 4번, 도색 장치의 공정 번호는 5번 일 때, 순서 제약 조건은, essen first 1; essen final 3; essen 2 > 4; essen 2 > 5; essen 4 > 5; essen 4 = 5로 작성되는 것일 수 있다. 여기서 각 코드에 대한 설명은 다음과 같다. essen first 1;(반드시 1번 공정은 첫 번째 여야 한다. 즉, 3D 프린터를 이용한 출력은 필수적이다.) essen final 3;(반드시 3번 공정으로 마무리되어야 한다. 즉, 3차원 스캐너를 이용한 출력물 검사는 필수 적이다.) essen 2 > 4;( 반드시 2번 공정은 4번 공정보다 앞에 와야 한다.) essen 2 > 5;(반드시 2번 공정은 5번 공정보다 앞에 와야 한다.) essen 4 > 5;(반드시 4번 공정은 5번 공정보다 앞에 와야 한다.) essen 4 = 5(반드시 4번 공정과 5번 공정은 같이 활성화 되어야 한다. 즉, 4번 공정이 사용되면 5번 공정도 사 용되어야 하고, 5번 공정을 사용하려면 4번 공정도 활성화 된다.) 다만, 이에 한정되는 것은 아니며, 본 장치는, 순서 제약 정보 대신 관리자 단말에 대응하는 관리자 가 보유하는 보유 장비를 통해 수행 가능한 가능 순서 정보를 공정 순서 정보로서 수신하는 것일 수 있으며, 가 능 순서 정보는 예시적으로 번->2번->4번->5번->3번 또는 1번->2번->3번->4번->5번->3번 등과 같이 공정 번호를 순차적으로 나열한 형태로 입력되는 것일 수 있다. 또한, 본 장치는, 장비 사용료에 대한 검증 및 테스트를 수행하여, 검증 및 테스트를 통과한 장비 사용료 를 포함하는 관리자 정보에 대한 관리자 단말만을 등록시키는 것일 수 있다. 구체적으로, 본 장치는, 관리자 정보 별 보유 장비에 대하여, 속이 비워져 있는 서포트 없는 샘플, 속이 채워져 있지만 서포트가 없는 샘플, 속이 채워져 있는 서포트가 있는 샘플, 속이 채워져 있는 서포트가 있는 샘 플의 모형이 다수의 X, Y Array로 구성되어 있는 샘플, 속이 채워져 있는 높이 별 서포트가 있는 샘플 등의 복 수의 임의 샘플 중 미리 설정된 임계 개수 이상의 임의 샘플에 대한 출력 테스트를 수행하고, 출력 테스트 결과 임의 샘플 각각에 대한 예상 단가를 산출하여 관리자 단말에 제공하고, 관리자 단말로부터 산출된 예 상 단가에 대한 확인을 수신하면, 해당 관리자 단말을 등록하는 것일 수 있다. 또한, 본 장치는, 관리자 단말과, 관리자 단말에 대응하는 관리자의 보유 장비가 위치한 공정 현장을 연동하되, 샘플 제작 1건에 대한 의뢰 수신, 공정 수행, 공정에 따른 금액 산출 및 금액 결제 절차를 포 함하는 테스트를 통해 연동을 최종적으로 확인하는 것일 수도 있다. 또한, 본 장치는, 3D 프린팅 제품의 제작에 있어, 법적 문제 발생의 방지를 위해 관리자 단말에 저작 권 안내를 포함하는 안내사항을 제공하고, 관리자 단말로부터 안내사항에 대한 관리자의 전자서명을 수신 하면, 해당 관리자 단말을 등록하는 것일 수 있다. 본원의 일 실시예에 따르면, 본 장치는 등록된 관리자 단말에 대한 관리자 정보를 고려하여 사용자 단말로부터 수신한 출력 요청 정보에 대한 복수의 제1 추천 공정 정보를 생성할 수 있다. 다시 말해, 본 장치는, 본 장치에 등록된 복수의 관리자 단말에 대한 복수의 관리자 정보를 참조하여, 출력 요 청 정보에 따른 3D 프린팅 제품의 출력(생산)이 가능하고, 등록된 복수의 관리자 단말에 대응하는 복수의 관리자 중 적어도 한 관리자가 보유한 보유 장비들로 수행 가능한 공정 과정에 대한 복수의 제1 추천 공정 정보 를 생성하는 것일 수 있다. 다만, 이에 한정되는 것은 아니며, 본 장치는, 등록된 복수의 관리자 단말 각각에 대한 복수의 관리 자 카드를 사용자 단말에 제공하고, 사용자 단말로부터 복수의 관리자 카드 중 적어도 하나의 카드에 대한 선택 입력을 수신하여, 선택된 적어도 하나의 카드에 대응하는 관리자가 제공 가능한 공정 과정만을 고려 하여 복수의 제1 추천 공정 정보를 생성하는 것일 수도 있다. 다시 말해, 관리자 카드는, 사용자에게, 본 장치에 등록된 관리자 및 사용 가능한 장비들에 대한 정보를 제공하기 위해 이용되는 것일 수 있으며, 본 장치는, 사용자 단말에 제공된 복수의 관리자 카드 중 적어도 하나의 카드의 저장에 대한 입력을 사용자 단말로부터 수신하면, 입력이 수신된 관리자 카드를 해 당 사용자 단말에 고정적으로 제공하여, 사용자 단말에 대응하는 사용자가 용이하게 해당 관리자 카 드의 지속적인 확인 및 해당 관리자 카드에 대응하는 관리자로의 지속적인 출력 의뢰가 가능하도록 할 수 있다. 이때, 본 장치는, 복수의 제1 추천 공정 정보를 생성함에 있어, 학습 모델을 이용하는 것일 수도 있으며, 이러한 학습 모델은, 예시적으로, 딥러닝 모델, 기계학습(머신러닝) 모델, 신경망 모델(인공 신경망 모델), 뉴 로 퍼지 모델 등을 의미할 수 있다. 본원에서 고려되는 인공지능 모델로는, 컨볼루션 신경망(Convolution Neural Network, CNN, 합성곱 신경망), 순환신경망(RNN, Recurrent Neural Network), 딥 신경망(Deep Neural Network) 등과 같이 종래에 이미 공지되었거나 향후 개발되는 다양한 기계학습을 위한 신경망 모델이 적용될 수 있다. 본원의 일 실시예에 따르면, 본 장치는, 생성한 복수의 제1 추천 공정 정보를 사용자 단말에 송신하 고, 사용자 단말로부터 송신한 복수의 제1 추천 공정 정보 중 적어도 하나의 추천 공정 정보에 대한 선택 입력을 수신할 수 있다. 이와 관련하여, 본 장치는, 복수의 제1 추천 공정 정보에 대한 출력 시뮬레이션의 결과를 사용자 단말 에 함께 송신하여, 사용자가 출력 시뮬레이션의 결과를 고려하여 복수의 제1 추천 공정 정보 중 적어도 하 나의 추천 공정 정보를 선택할 수 있도록 할 수 있다. 구체적으로, 본 장치는, 복수의 제1 추천 공정 정보에 대한 출력 시뮬레이션을 수행할 수 있다. 본 장치 는, 사용자 단말 에 제공하기 위한 복수의 제1 추천 공정 정보 각각에 대해, 공정 시 사용되는 장비 의 연식, 성능, 모델명 및 예약되어 있는 공정량과, 공정 시 사용되는 재료의 종류 및 단가 등을 기반으로, 출 력 요청 정보에 따른 3D 프린팅 제품의 출력 과정 및 결과를 시뮬레이션하고, 시뮬레이션 결과로서, 생산할 3D 프린팅 제품에 대한 불량 발생률 및 제품 퀄리티에 대한 검증 정보와, 하나의 3D 프린팅 제품에 대한 단가 및 출력 요청 정보에 포함되는 제품의 생산량에 따른 총 예상 장비 사용료를 포함하는 견적 정보를 산출할 수 있다. 다시 말해, 본 장치는, 복수의 제1 추천 공정 정보에 대한 출력 시뮬레이션 결과에 따른 검증 정보및 견적 정보를 생성할 수 있다. 또한, 본 장치는, 복수의 제1 추천 공정 정보와 함께, 복수의 제1 추천 공정 정보 각각에 대응하는 검증 정보 및 견적 정보를 사용자 단말에 송신하여, 복수의 제1 추천 공정 정보에 대한 출력 시뮬레이션 결과를 제공하는 것일 수 있다. 또한, 본 장치는, 사용자 단말로부터 복수의 제1 추천 공정 정보에 대한 선택 입력을 수신하고, 선택 입력에 따른 적어도 하나의 추천 공정 정보를 사용자 단말에 제2 추천 공정 정보로서 다시 제공할 수 있다. 달리 말해, 본 장치는, 복수의 제1 추천 공정 정보 중 사용자 단말을 통해 선택되지 않은 추천 공정 정보를 제외하고, 선택된 추천 공정 정보만을 다시 제공하여 사용자로 하여금 최종적으로 수행될 공정 정 보를 선택하게끔 유도할 수 있다. 이와 관련하여, 본 장치는, 제2 추천 공정 정보가 복수 개이면, 출력 시뮬레이션 결과를 기반으로 복수의 제2 추천 공정 정보 간의 비교 정보를 사용자 단말에 더 제공하는 것일 수 있다. 비교 정보는, 출력 시뮬 레이션 결과로 산출된 검증 정보 및 견적 정보를 이용하여 제2 추천 공정 정보 간의 비교가 용이하도록 생성된 테이블 형태의 정보를 의미하는 것일 수 있으며, 부가적으로 공정을 수행하는 공정 장비가 위치한 공정 현장의 주소 정보, 출력 요청 정보에 포함된 생산량에 따른 3D 프린팅 제품의 생산에 대한 총 예상 소요 시간 정보를 더 포함하는 것일 수 있다. 다만, 이에 한정되는 것은 아니며, 본 장치는, 제1 추천 공정 정보 및 제2 추천 공정 정보는 서로 구분되 지 않고, 복수의 추천 공정 정보를 출력 시뮬레이션 결과에 따른 검증 정보 및 견적 정보와 비교 정보를 동시에 사용자 단말에 제공하는 것일 수 있다. 구체적으로, 출력 요청 정보 및 관리자 정보를 고려하였을 때, 선 정되는 추천 공정 정보의 수가 미리 설정된 임계 개수 미만이면, 선정된 추천 공정 정보와, 해당 추천 공정 정 보 각각에 대한 출력 시뮬레이션 결과 및 비교 정보를 모두 한 번에 사용자 단말에 제공할 수 있다. 다시 말해, 본 장치는, 복수의 추천 공정 정보를 순차적으로 제공하여 사용자가 복수의 추천 공정 정보 중 적어도 일부의 정보만을 제외함으로써 최종적으로 수행될 수행 공정 정보를 결정하도록 할 수 있으나, 추천 공 정 정보의 개수가 미리 설정된 임계 개수 미만이면, 사용자가 한 번에 수행 공정 정보를 선택할 수 있도록 복수 의 추천 공정 정보를 한 번에 사용자 단말에 제공하는 것일 수 있다. 즉, 본 장치는, 사용자 단말로부터 수신된 선택 입력을 기반으로 복수의 추천 공정 정보 중 적어도 하나의 추천 공정 정보를 수행 공정 정보로 결정할 수 있다. 구체적으로, 사용자가 동일한 3D 프린팅 제품을 서 로 상이한 재료 혹은 서로 상이한 공정으로 제작하기를 희망하거나, 동일한 재료 및 동일한 공정으로 제작하되 복수의 공정 현장에서 동시에 제작하기를 희망하는 경우, 본 장치는, 복수의 추천 공정 정보 중 2개 이상 의 추천 공정 정보에 대한 선택 입력을 수신하고, 선택된 2개 이상의 추천 공정 정보를 모두 수행 공정 정보로 결정하는 것일 수 있다. 다만, 이러한 경우, 사용자의 오판을 방지하기 위해, 본 장치는, 복수의 추천 공 정 정보 중 2개 이상의 추천 공정 정보에 대한 선택 입력을 수신하면, 사용자 단말을 통해 선택 입력에 대 한 확인을 요청하는 것일 수 있으나, 이에 한정되는 것은 아니다. 한편, 추천 공정 정보 및 수행 공정 정보를 포함하는 공정 정보는, 출력 요청 정보에 포함된 3D 도면 정보에 대 한 도면 리스트의 배치 정보, 세부 파라미터 정보 및 공정 순서 정보 중 적어도 하나의 정보를 포함하는 것일 수 있다. 구체적으로, 도면 리스트의 배치 정보는, 해당 공정을 수행하는 장비에서 현재 생산하고 있는 3D 프린팅 제품의 도면 정보와 순차적으로 생산되도록 예약되어 있는 3D 프린팅 제품의 도면 정보를 포함하는 도면 리스트에 출력 요청 정보에 포함된 3D 도면 정보가 배치되는 순서를 포함하는 것일 수 있고, 세부 파라미터 정보는, 복수의 공 정 장비 각각에 대하여 출력 요청 정보에 따른 3D 프린팅 제품의 출력을 위해 설정되어야 하는 복수의 파라미터 종류 및 값을 포함하는 것일 수 있고, 공정 순서 정보는, 해당 공정 정보를 수행하는 장비들을 보유한 관리자의 관리자 단말로부터 수신된 순서 제약 정보 및 가능 순서 정보 중 적어도 하나를 포함하는 것일 수 있으나, 이에 한정되는 것은 아니다. 본원의 일 실시예에 따르면, 본 장치는, 결정된 수행 공정 정보에 따른 견적 정보를 생성하고, 견적 정보 및 견적 정보에 따른 금액 결제 요청을 사용자 단말에 제공할 수 있다. 견적 정보는, 관리자 정보에 포함 된 장비 사용료를 기반으로 산출된 금액을 포함하는 것일 수 있다. 본 장치는, 사용자 단말로부터 금 액 결제 요청에 따른 결제 프로세스의 완료 여부를 수신하고, 사용자 단말의 결제 프로세스가 완료된 것으 로 판단되면, 수행 공정 정보에 따른 생산 공정이 시작되도록 복수의 3D 프린터를 제어하는 것일 수 있다.본원의 일 실시예에 따르면, 본 장치는, 결정된 수행 공정 정보를 기반으로 복수의 3D 프린터를 제어 할 수 있다. 구체적으로, 본 장치는, 공정 현장에 배치되어 있는 복수의 3D 프린터를 포함하는 복수 의 공정 장비의 배치를 모니터링하고, 복수의 공정 장비 각각의 순차적 공정을 제어하는 것일 수 있다. 본 장치는, 결정된 수행 공정 정보에 따라 구동되는 복수의 3D 프린터에 대한 상태 정보를 수집할 수 있다. 이때, 상태 정보는, 복수의 3D 프린터 각각에 대한 위치 정보, 현재 출력 중인 제품에 대한 제1 3D 도면 정보, 현재 출력 중인 제품의 출력 이후 출력 예정인 제2 3D 도면 정보, 기 설정된 세부 파라미터 정보 및 복수의 3D 프린터 각각의 구동 여부에 대한 공정 상태 정보 중 적어도 하나의 정보를 포함하는 것일 수 있 다. 또한, 본 장치는, 수행 공정 정보 및 상태 정보를 관리자 단말에 송신하고, 관리자 단말로부터 수행 공정 정보 및 상태 정보에 대한 제어 정보를 수신할 수 있다. 구체적으로, 본 장치는, 복수의 3D 프린터를 포함하는 복수의 공정 장비 각각에 대한 제1 3D 도면 정 보, 제2 3D 도면 정보, 기 설정된 세부 파라미터 정보 및 공정 상태 정보(S)를 관리자 단말에 제공하고, 관리자가 수행 공정 정보에 기초하여, 제1 3D 도면 정보, 제2 3D 도면 정보, 기 설정된 세부 파라미터 정보 및 공정 상태 정보(S)에 따라 기 설정된 공정 스케줄 정보의 적어도 일부를 수정하거나, 기 설정된 세부 파라미터 정보의 적어도 일부를 수정하도록 하는 것일 수 있다. 이와 관련하여, 기 설정된 공정 스케줄 정보는, 출력 예정인 3D 프린팅 제품에 대한 제2 3D 도면 정보를 고려하 여 생성된 것으로, 각각의 제2 3D 도면 정보에 대한 공정 시작 시점, 예상 소요 시간, 예상 공정 종료 시점 등 을 포함하는 것일 수 있다. 또한, 제어 정보는, 기 설정된 공정 스케줄 정보를 수정하기 위한 스케줄 수정 정보 및 기 설정된 세부 파라미터 정보를 수정하기 위한 파라미터 수정 정보를 포함하는 것일 수 있다. 또한, 본 장치는, 제어 정보에 기초하여 복수의 3D 프린터를 제어할 수 있다. 구체적으로, 본 장치 는, 관리자 단말을 통해 수신된 스케줄 수정 정보 및 파라미터 수정 정보를 기반으로, 복수의 3D 프 린터 및 이 외의 복수의 공정 장비의 공정 스케줄 정보 및 세부 파라미터 정보를 수정하여, 복수의 3D 프 린터 및 이 외의 복수의 공정 장비가 수행 공정 정보에 따른 3D 프린팅 제품의 생산 공정을 수행하도록 제 어하는 것일 수 있다. 다시 말해, 본 장치는, 관리자가 관리자 단말을 통해 복수의 3D 프린터 및 이 외의 복수의 공정 장비를 원격으로 제어 가능하도록 제공하는 것일 수 있다. 또한, 본 장치는, 출력 요청 정보에 따른 3D 프린팅 제품의 생산량이 한 명의 관리자가 보유하는 공정 장 비만으로 생산할 때 예상되는 소요 시간이 사용자 및 관리자 중 적어도 하나에 의해 기 설정된 임계 시간을 초 과하는 것으로 판단되거나, 사용자가 동일한 3D 프린팅 제품을 동일한 재료 및 동일한 공정으로 제작하되 복수 의 공정 현장에서 동시에 제작하기를 희망하는 경우, 서로 동일한 세부 파라미터 정보 및 공정 순서 정보에 따 른 생산 공정이, 복수의 공정 현장에서 동시 수행되거나, 복수의 관리자 단말 각각이 보유한 각각의 공정 장비들을 통해 동시 수행되도록 지원할 수 있다. 달리 말해, 배치 정보는 상이 하되, 세부 파라미터 정보 및 공정 순서 정보를 동일한 복수의 공정 정보 각각이 수행 공정 정보로 결정되어, 수행 공정 정보가 복수 개인 경우, 복수의 관리자가 보유하는 각각의 공정 장비들 에 의해 해당 복수의 수행 공정 정보에 따른 생산 공정이 수행될 수 있으며, 복수의 관리자가 각자의 공정 장비 들을 제어하되, 해당 공정 장비들에 의해 동일한 3D 프린팅 제품들이 생산될 수 있다. 따라서, 본 장치는, 비교적 적은 시간을 소요하여 동일한 3D 프린팅 제품의 대량 생산이 가능하도록 지원할 수 있다. 또한, 본 장치는, 수행 공정 정보에 따라 복수의 3D를 포함하는 복수의 공정 장비가 공정을 수행하고 있을 때, 이에 대한 공정 장비의 모니터링 기능을 관리자 단말 및 사용자 단말에 제공할 수 있다. 모니터 링 기능은, 관리자 단말 및 사용자 단말을 통해 관리자 및 사용자가 원격으로, 공정 상태 정보, 공정 순서 정보, 수행 공정 정보에 따라 설정된 세부 파라미터 정보, 수행 공정 정보에 포함된 3D 도면 정보의 등록 번호, 파일명, 등록일자, 현재 공정 위치, 총 예상 소요 시간, 예상 잔여 시간(공정 수행 중인 경우) 또는 예상 대기 시간(공정 대기 중인 경우) 등을 모니터링 할 수 있도록 지원하는 기능을 의미하는 것일 수 있다. 또한, 본 장치는, 관리자 단말 및 사용자 단말로부터 관리자 단말 및 사용자 단말에 모니터링 기능을 통해 제공한 3D 도면 정보, 공정 순서 정보 및 세부 파라미터 정보에 대한 수정 요청을 수신할 수 있고, 수신한 수정 요청에 따라 3D 도면 정보, 공정 순서 정보 및 세부 파라미터 정보를 선택적으로 수정할수 있다. 구체적으로, 본 장치는, 관리자 단말 및 사용자 단말 중 어느 하나의 단말로부터 수정 요청을 수신하면, 다른 하나의 단말에 해당 수정 요청을 전달하고, 다른 하나의 단말로부터 해당 수정 요청에 대한 수 락 여부에 대한 선택 입력을 수신할 수 있다. 또한, 본 장치는, 다른 하나의 단말이 수정 요청을 수락한 경우, 어느 하나의 단말에 수정 요청이 수락됨 을 전달하고, 임의의 관리코드를 관리자 단말 및 사용자 단말에 제공할 수 있다. 본 장치는, 수 정 요청을 송신한 어느 하나의 단말로부터 관리코드를 입력 받으면, 해당 수행 공정 정보에 따른 생산 공정이 현재 수행되는 중 이어도, 3D 도면 정보, 공정 순서 정보 및 세부 파라미터 정보에 대한 수정 정보를 수신하고, 3D 도면 정보, 공정 순서 정보 및 세부 파라미터 정보를 적어도 일부 수정하는 것일 수 있다. 다만, 본 장치 는, 수정 정보를 기반으로 3D 도면 정보, 공정 순서 정보 및 세부 파라미터 정보 중 적어도 하나를 수정할 경우, 공정 장비의 이상을 유발될 것으로 예상되면, 해당 수정 정보에 따른 수정을 거부할 수 있다. 또한, 3D 도면 정보, 공정 순서 정보 및 세부 파라미터 정보 중 적어도 하나가 수정될 경우, 본 장치는, 관리자 단말을 통해 기 설정된 정보 수정에 따른 추가 금액을 사용자 단말에 제공할 수 있다. 상술한 바에 따르면, 본 장치는, 복수의 관리자 단말로부터 수신한 제어 정보에 기초하여 다수의 3D 프린터를 포함하는 다수의 공정 장비 각각을 원격으로 제어함으로써, 3D 프린팅 제품의 생산 라인을 시스 템화 하여 3D 프린팅 제품의 대량 생산을 수행할 수 있다. 또한, 상술한 바에 따르면, 사용자 단말로부터 수신한 출력 요청 정보를 기반으로 3D 프린팅 제품을 출력 함으로써, 다수의 사용자가 각각 요구하는 다양한 형태 및 구조의 제품을 대량으로 생산(제작)할 수 있다. 이하에서는, 복수의 공정 장비에 대한 모니터링 정보의 제공 프로세스 및 복수의 공정 장비의 제어 프로세스를, 현장 단말 및 관리자 단말에 제공 가능한 인터페이스(도 3 내지 도 6 참조)를 통해 상세히 설명하기 로 한다. 이와 관련하여, 도 3 내지 도 6을 참조하여 설명되는 인터페이스는 현장 단말을 통해 제공되는 것일 수 있 으나, 관리자 단말이 원격으로 본 장치 에 접속한 경우, 관리자 단말에도 도 3 내지 도 6을 참 조하여 설명되는 인터페이스들이 제공되는 것일 수 있다. 도 3은 복수의 공정 장비의 배치를 표시하는 배치 표시 인터페이스를 예시적으로 나타내는 도면이다. 도 3을 참조하면, 복수의 공정 장비는, 3D 프린터, 후처리 장치(부속 제거 장치, 퍼티코팅기, 도색 장치 등), 3차원 스캐너 및 출력물 이동 장치 등을 포함할 수 있다. 구체적으로, 3D 프린터는 3D 도면에 기초하여 필라멘트 방식의 3D 출력물을 출력하는 것이고, 후처리 장치 중 부속 제거 장치는 출력 시 사용된 서포트 등의 부속품을 제거하는 것이고, 후처리 장치 중 퍼티코팅기 는 표면이 연마된 출력물의 표면을 퍼티로 코팅 및 건조하는 것이고, 후처리 장치 중 도색 장치는 퍼 티로 코팅된 출력물을 도색하는 것이고, 3차원 스캐너는 3D 도면과 출력물의 일치도 및 불량 여부를 검사 하기 위한 것이고, 출력물 이동 장치는 3D 프린터, 부속 제거 장치, 퍼티코팅기, 도색 장 치 및 3차원 스캐너 등의 다른 공정 장비 간의 출력물 이동을 지원하는 것으로, 드론 및 컨베이어 등 을 포함하는 것일 수 있으며, 공정 순서에 따라 출력물을 각각의 공정 장비로 이동시키는 것일 수 있다. 도 4는 복수의 공정 장비에 대한 공정 상태 및 공정 순서에 따른 공정 경로를 표시하는 상태 표시 인터페이스 (A) 및 각 공정 장비 별 현재 수행하고 있는 공정에 대한 소요 시간을 표시하는 시간 표시 인터페이스(B)를 예 시적으로 나타내는 도면이다. 도 4의 상태 표시 인터페이스(A)를 참조하면, 본 장치는, 공정 현장에 위치한 복수의 공정 장비의 배치 정 보 및 공정 상태 정보(S)를 제공할 수 있다. 구체적으로, 도 4의 상태 표시 인터페이스(A)에 도시된 바와 같이, 공정 현장에는 복수의 공정 장비가 배치되어 있을 수 있고, 본 장치는, 공정 현장에 배치되어 있는 복수의 공정 장비 각각의 배치 정보를 저장하고, 복수의 공정 장비 각각으로부터 공정 상태를 감지할 수 있다. 또한, 본 장치는, 복수의 공정 장비 각각에 대한 공정 상태 정보(S)를 배치도 상에 표시하는 것일 수 있다. 도 4의 상태 표시 인터페이스(A)를 참조하여 예시하면, 본 장치는, 장비 고장에 따른 공정 실패, 장 비 정상 가동 중 및 장비 구동 대기 상태 등을 포함하는 장비의 공정 상태를 감지하고, 공정 상태에 따라, 장비 고장에 따른 공정 실패는 적색, 장비 정상 가동 중은 녹색, 장비 구동 대기 상태는 황색으로 표시할 수 있으나,이에 한정되는 것은 아니다. 또한, 본 장치는 현장 단말을 통해 배치도에 표시한 복수의 공정 장비 중 어느 하나에 대한 선택 입 력을 수신하면, 배치도 상에 공정 순서에 따른 공정 경로를 더 표시할 수 있고, 각 공정 장비 별 현재 수행하고 있는 공정에 대한 소요 시간을 시간 표시 인터페이스(B)에 표시하는 것일 수 있다. 다만, 이에 한정되는 것은 아니며, 본 장치는, 대기 중인 3D 도면에 대한 항목을 더 표시하고, 해당 항목에 대한 선택 입력이 인가 되면, 대기 중인 3D 도면에 대한 공정 경로 및 예상 소요 시간을 더 표시하는 것일 수 있다. 도 5는 복수의 공정 장비를 통한 출력 예정인3D 도면 리스트를 표시하는 도면 리스트 표시 인터페이스(C) 및 복 수의 공정 장비 각각에 대한 파라미터 설정 값을 표시하는 파라미터 표시 인터페이스(D)를 예시적으로 나타내는 도면이다. 구체적으로, 도 5의 도면 리스트 표시 인터페이스(C)를 참조하면, 본 장치는, 공정 현장 내의 복수의 공정 장비를 이용하여 출력할 3D 프린팅 제품에 대한 3D 도면 정보를 리스트업하여, 해당 3D 도면 정보의 등록 번호, 파일명, 등록일자, 현재 공정 위치, 총 예상 소요 시간, 예상 잔여 시간(공정 수행 중인 경우) 또는 예상 대기 시간(공정 대기 중인 경우), 공정 순서 정보를 제공할 수 있다. 또한, 도 5의 파라미터 표시 인터페이스(D)를 참조하면, 본 장치는, 현재 공정 수행 중인 3D 도면 정보 또 는 대기 중인 3D 도면 정보에 대해 기 설정된 세부 파라미터 정보와 3D 도면 정보에 따른 예상 3D 프린팅 제품 의 이미지를 더 제공하는 것일 수 있다. 이때, 현장 단말 또는 원격 접속되어 있는 관리자 단말은, 도 5에 도시된 인터페이스를 통해, 도면 리스트에 대한 3D 도면 정보의 추가 및 취소, 순서 변경 등의 수정에 대한 입력 및 기 설정된 세부 파라미터 정 보의 수정에 대한 입력을 인가 받는 것일 수 있으며, 본 장치는, 도면 리스트 및 세부 파라미터 정보가 수 정되면, 각각의 3D 도면 정보에 대응하는 공정에 대한 총 예상 소요 시간, 예상 잔여 시간(공정 수행 중인 경우) 또는 예상 대기 시간(공정 대기 중인 경우) 등을 자동으로 수정하는 것일 수 있으나, 이에 한정되는 것은 아니다. 또한, 각각의 3D 도면 정보의 등록 번호는, 관리자 및 현장 작업자에 의해 미리 설정된 규칙에 따라 자동으로 생성되는 것일 수 있으며, 예시적으로, 공정 순서 정보 및 공정 번호에 따른 규칙에 따라 생성되는 것일 수 있 으나, 이에 한정되는 것은 아니다. 도 6은 관리자 단말의 원격 접속 여부 및 원격 접속 시 외부의 관리자 단말에 제공되는 공정 장비 별 현장 정보 를 표시하는 원격 접속 인터페이스(E) 및 원격 접속 시 외부의 관리자 단말에 제공되는 공정 장비 별 공정 상태 정보 및 원격으로 제어되는 제2 3D 도면 정보 및 기 설정된 세부 파라미터 정보를 표시하는 원격 제어 인터페이 스(F)를 예시적으로 나타내는 도면이다. 도 6의 원격 접속 인터페이스(E)를 참조하면, 본 장치는, 공정 장비 별 관리자 단말의 원격 접속 여 부를 표시하고, 원격 접속 시 원격으로 연결된 공정 장비의 현장 정보를 표시 및 관리자 단말에 제공할 수 있다. 구체적으로, 현장 정보는, 카메라를 통해 촬영되는 해당 공정 장비의 영상 정보, 해당 공정 장비에 포함 되어 있는 자체 인터페이스 화면 정보 등을 포함하는 것일 수 있다. 도 6의 원격 제어 인터페이스(F)를 참조하면, 본 장치는, 원격 접속된 공정 장비의 공정 상태 정보(S)를 표시 및 관리자 단말에 제공하고, 공정 장비 별 제2 3D 도면 정보 및 기 설정된 세부 파라미터 정보를 표 시 및 관리자 단말에 제공할 수 있다. 예시적으로, 세부 파라미터 정보는, 해당 공정 장비가 FDM 방식의 3D 프린터인 경우, 노즐 위치, 노즐 온도, 배드 온도, 출력 파일, 출력 파일 저장 위치, 서보 모터 전압/전류 등에 대한 정보를 포함하는 것일 수 있으나, 이에 한정되는 것은 아니다. 또한, 본 장치는, 관리자 단말을 통해 제2 3D 도면 정보 및 세부 파라미터 정보에 대한 수정 요청을 수신할 수 있고, 수정 요청에 따라 제2 3D 도면 정보 및 세부 파라미터 정보를 수정하는 것일 수 있다. 다만, 이러한 수정은, 공정 장비의 이상을 유발하지 않을 것으로 판단되는 수준에 한하여 수락되는 것일 수 있다. 도 7은 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 장치의 개략적인 블록도이다. 도 7을 참조하면, 본 장치는, 수신부, 공정 정보 추천부, 공정 정보 결정부 및 제어부 를 포함할 수 있다. 본원의 일 실시예를 따르면, 수신부는, 사용자 단말로부터 3D 프린팅 제품에 대한 출력 요청 정보를 수신할 수 있다. 이때, 출력 요청 정보는, 3D 프린팅 제품의 3D 도면 정보를 포함하는 것일 수 있다. 또한, 수 신부는, 복수의 관리자 단말 각각으로부터 장비 환경 정보를 포함하는 관리자 정보를 수신할 수 있다. 본원의 일 실시예에 따르면, 공정 정보 추천부는, 출력 요청 정보에 기초하여 사용자 단말에 복수의 추천 공정 정보를 제공할 수 있다. 본원의 일 실시예에 따르면, 공정 정보 결정부는, 사용자 단말로부터 수신된 선택 입력을 기반으로 복수의 추천 공정 정보 중 적어도 하나의 추천 공정 정보를 수행 공정 정보로 결정할 수 있다. 이때, 추천 공정 정보 및 수행 공정 정보는, 3D 도면 정보에 대한 도면 리스트의 배치 정보, 세부 파라미터 정보 및 공정 순서 정보 중 적어도 하나의 정보를 포함하는 것일 수 있다. 구체적으로, 공정 정보 추천부는, 복수의 관리자 단말 각각에 대한 장비 환경 정보를 고려하여 출력 요청 정보에 대한 복수의 제1 추천 공정 정보를 생성하고, 복수의 제1 추천 공정 정보에 대한 출력 시뮬레이션 을 수행하고, 출력 시뮬레이션의 결과에 따른 검증 정보 및 견적 정보를 생성하고, 복수의 제1 추천 공정 정보 에 대응하는 검증 정보 및 견적 정보를 사용자 단말에 제공할 수 있다. 이때, 수신부는, 사용자 단말로부터 복수의 제1 추천 공정 정보 중 적어도 하나의 추천 공정 정보에 대한 선택 입력을 수신할 수 있고, 에서 공정 정보 추천부는, 선택 입력에 따른 적어도 하나의 추천 공정 정보를 사용자 단말에 제2 추천 공정 정보로서 제공할 수 있다. 본원의 일 실시예에 따르면, 제어부는, 수행 공정 정보를 기반으로 복수의 3D프린터를 제어할 수 있다. 구체적으로, 제어부는, 수행 공정 정보에 따라 구동되는 복수의 3D 프린터에 대한 상태 정보를 수집 할 수 있다. 이때, 상태 정보는, 복수의 3D 프린터 각각에 대한 위치 정보, 현재 출력 중인 제품에 대한 제1 3D 도면 정보, 현재 출력 중인 제품의 출력 이후 출력 예정인 제2 3D 도면 정보, 세부 파라미터 정보 및 상 기 복수의 3D 프린터 각각의 구동 여부에 대한 공정 상태 정보 중 적어도 하나의 정보를 포함하는 것일 수 있다. 또한, 제어부는, 수행 공정 정보 및 상태 정보를 관리자 단말에 송신할 수 있다. 이때, 수신부 는, 관리자 단말로부터 수행 공정 정보 및 상태 정보에 대한 제어 정보를 수신하고, 제어부는, 제어 정보에 기초하여 복수의 3D 프린터를 제어할 수 있다. 여기서, 복수의 3D 프린터는, 관리자 단말 을 통해 제어 정보에 기초하여 원격으로 제어되는 것일 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 8은 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 방법에 대한 동작 흐름도이다. 도 8은 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 방법에 대한 동작 흐름도이다. 도 8에 도시된 대량생산을 위한 복수의 3D 프린터 제어 방법은 앞서 설명된 대량생산을 위한 복수의 3D 프린터 제어 장치에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 대량생산을 위한 복수의 3D 프린터 제어 장치에 대하여 설명된 내용은 대량생산을 위한 복수의 3D 프린터 제어 방법에 대한 설명에 도 동일하게 적용될 수 있다. 도 8을 참조하면, 단계 S11에서 수신부는, 사용자 단말로부터 3D 프린팅 제품에 대한 출력 요청 정보 를 수신할 수 있다. 이때, 출력 요청 정보는, 3D 프린팅 제품의 3D 도면 정보를 포함하는 것일 수 있다. 다음으로, 단계 S12에서 공정 정보 추천부는, 출력 요청 정보에 기초하여 사용자 단말에 복수의 추천 공정 정보를 제공할 수 있다. 다음으로, 단계 S13에서 공정 정보 결정부는, 사용자 단말로부터 수신된 선택 입력을 기반으로 복수 의 추천 공정 정보 중 적어도 하나의 추천 공정 정보를 수행 공정 정보로 결정할 수 있다. 이때, 추천 공정 정 보 및 수행 공정 정보는, 3D 도면 정보에 대한 도면 리스트의 배치 정보, 세부 파라미터 정보 및 공정 순서 정 보 중 적어도 하나의 정보를 포함하는 것일 수 있다. 다음으로, 단계 S14에서 제어부는, 수행 공정 정보를 기반으로 복수의 3D 프린터를 제어할 수 있다. 도 9는 본원의 일 실시예에 따른 추천 공정 정보의 제공 방법에 대한 동작 흐름도이다. 도 9에 도시된 추천 공정 정보의 제공 방법은 앞서 설명된 대량생산을 위한 복수의 3D 프린터 제어 장치의 공정 정보 추천부에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 대량생산을 위한 복수의 3D 프린터 제어 장치의 공정 정보 추천부에 대하여 설명된 내용은 추천 공정 정보의 제공 방 법에 대한 설명에도 동일하게 적용될 수 있다. 도 9를 참조하면, 단계 S21에서 수신부는, 복수의 관리자 단말 각각으로부터 장비 환경 정보를 포함 하는 관리자 정보를 수신할 수 있다. 다음으로, 단계 S22에서 공정 정보 추천부는, 복수의 관리자 단말 각각에 대한 장비 환경 정보를 고 려하여 출력 요청 정보에 대한 복수의 제1 추천 공정 정보를 생성할 수 있다. 다음으로, 단계 S23에서 공정 정보 추천부는, 복수의 제1 추천 공정 정보에 대한 출력 시뮬레이션을 수행 할 수 있다. 다음으로, 단계 S24에서 공정 정보 추천부는, 출력 시뮬레이션의 결과에 따른 검증 정보 및 견적 정보를 생성할 수 있다. 다음으로, 단계 S25에서 공정 정보 추천부는, 복수의 제1 추천 공정 정보에 대응하는 검증 정보 및 견적 정보를 사용자 단말에 제공할 수 있다. 다음으로, 단계 S26에서 수신부는, 사용자 단말로부터 복수의 제1 추천 공정 정보 중 적어도 하나의 추천 공정 정보에 대한 선택 입력을 수신할 수 있다. 다음으로, 단계 S27에서 공정 정보 추천부는, 선택 입력에 따른 적어도 하나의 추천 공정 정보를 사용자 단말에 제2 추천 공정 정보로서 제공할 수 있다. 도 10은 본원의 일 실시예에 따른 복수의 3D 프린터 제어 방법에 대한 동작 흐름도이다. 도10에 도시된 복수의 3D 프린터 제어 방법은 앞서 설명된 대량생산을 위한 복수의 3D 프린터 제어 장치의 제어부에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 대량생산을 위한 복수의 3D 프린터 제어 장치 의 제어부에 대하여 설명된 내용은 복수의 3D 프린터 제어 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 10을 참조하면, 단계 S31에서 제어부는, 수행 공정 정보에 따라 구동되는 복수의 3D 프린터에 대 한 상태 정보를 수집할 수 있다. 이때, 상태 정보는, 복수의 3D 프린터 각각에 대한 위치 정보, 현재 출력 중인 제품에 대한 제1 3D 도면 정보, 현재 출력 중인 제품의 출력 이후 출력 예정인 제2 3D 도면 정보, 세부 파 라미터 정보 및 상기 복수의 3D 프린터 각각의 구동 여부에 대한 공정 상태 정보 중 적어도 하나의 정보를 포함 하는 것일 수 있다. 다음으로, 단계 S32에서 제어부는, 수행 공정 정보 및 상태 정보를 관리자 단말에 송신할 수 있다. 다음으로, 단계 S33에서 수신부는, 관리자 단말로부터 수행 공정 정보 및 상태 정보에 대한 제어 정 보를 수신할 수 있다. 다음으로, 단계 S34에서 제어부는, 제어 정보에 기초하여 복수의 3D 프린터를 제어할 수 있다. 이때, 복수의 3D 프린터는, 관리자 단말을 통해 제어 정보에 기초하여 원격으로 제어되는 것일 수 있다. 상술한 설명에서, 단계 S11 내지 S14, 단계 S21 내지 S27, 단계 S31 내지 S 34는 본원의 구현예에 따라서, 추가 적인 단계들로 더 분할되거나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본원의 일 실시 예에 따른 대량생산을 위한 복수의 3D 프린터 제어 방법, 추천 공정 정보의 제공 방법 및 복수 의 3D 프린터 제어 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 대량생산을 위한 복수의 3D 프린터 제어 방법, 추천 공정 정보의 제공 방법 및 복수의 3D 프린터 제어 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그램 또는 애플리케이션의 형태로도 구 현될 수 있다."}
{"patent_id": "10-2023-0135990", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2023-0135990", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 시스템의 개략적인 구성도이다. 도 2는 관리자 단말의 등록 시 부여되는 관리자 카드를 예시적으로 나타내는 도면이다. 도 3은 복수의 공정 장비의 배치를 표시하는 배치 표시 인터페이스를 예시적으로 나타내는 도면이다. 도 4는 복수의 공정 장비에 대한 공정 상태 및 공정 순서에 따른 공정 경로를 표시하는 상태 표시 인터페이스 및 각 공정 장비 별 현재 수행하고 있는 공정에 대한 소요 시간을 표시하는 시간 표시 인터페이스를 예시적으로 나타내는 도면이다. 도 5는 복수의 공정 장비를 통한 출력 예정인3D 도면 리스트를 표시하는 도면 리스트 표시 인터페이스 및 복수 의 공정 장비 각각에 대한 파라미터 설정 값을 표시하는 파라미터 표시 인터페이스를 예시적으로 나타내는 도면 이다. 도 6은 관리자 단말의 원격 접속 여부 및 원격 접속 시 외부의 관리자 단말에 제공되는 공정 장비 별 현장 정보 를 표시하는 원격 접속 인터페이스 및 원격 접속 시 외부의 관리자 단말에 제공되는 공정 장비 별 공정 상태 정 보 및 원격으로 제어되는 제2 3D 도면 정보 및 기 설정된 세부 파라미터 정보를 표시하는 원격 제어 인터페이스 를 예시적으로 나타내는 도면이다. 도 7은 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 장치의 개략적인 블록도이다. 도 8은 본원의 일 실시예에 따른 대량생산을 위한 복수의 3D 프린터 제어 방법에 대한 동작 흐름도이다. 도 9는 본원의 일 실시예에 따른 추천 공정 정보의 제공 방법에 대한 동작 흐름도이다. 도 10은 본원의 일 실시예에 따른 복수의 3D 프린터 제어 방법에 대한 동작 흐름도이다."}
