{"patent_id": "10-2023-0159434", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0052227", "출원번호": "10-2023-0159434", "발명의 명칭": "전자 장치 및 전자 장치의 보안 데이터 처리 방법", "출원인": "삼성전자주식회사", "발명자": "이가원"}}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,통신 회로;보안 칩셋; 및상기 통신 회로 및 상기 보안 칩셋과 작동적으로 연결되는 프로세서를 포함하고,상기 보안 칩셋은,제1보안 도메인(security domain) 및 제2보안 도메인을 포함하는 복수의 보안 도메인들; 및포스트 양자 암호 시스템에 기반한 전자 서명을 검증하기 위한 PQC 전자 서명 검증 모듈을 포함하고,상기 프로세서는,상기 통신 회로를 통해 외부 엔티티로부터 상기 복수의 보안 도메인들 중 제1보안 도메인으로 전달되는 스크립트를 수신하고,상기 스크립트를 파싱하여, 상기 외부 엔티티의 인증서 및 전자 서명을 획득하고,상기 PQC 전자 서명 검증 모듈을 통해, 상기 제1보안 도메인에 미리 저장된 상기 외부 엔티티의 인증서와 관련된 제1인증키를 이용하여 상기 획득한 외부 엔티티의 인증서를 검증하고,상기 외부 엔티티의 인증서로부터 제2인증키를 추출하고, 및상기 PQC 전자 서명 검증 모듈을 통해, 상기 제2인증키를 이용하여 상기 전자 서명의 유효성을 확인하도록 설정된 전자 장치."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 보안 칩셋은,포스트 양자 암호 시스템에 기반한 KEM(key encapsulation mechanism) 알고리즘을 실행하는 PQC(post quantumcryptography) KEM 모듈을 더 포함하는 전자 장치."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 제2보안 도메인은 상기 KEM(key encapsulation mechanism) 알고리즘에 사용되는 KEM 공개 키 및 KEM 비밀키를 저장하는 전자 장치."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 제1보안 도메인은 상기 KEM 알고리즘에 사용되는 키를 저장하지 않는 전자 장치.공개특허 10-2025-0052227-3-청구항 5 제 3항에 있어서,상기 KEM 공개키 및 상기 KEM 비밀키는 전자 장치의 공정 단계에서 주입된 고정키 인 전자 장치."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항 내지 제 5항 중 어느 한 항에 있어서,상기 스크립트는,제1암호문을 더 포함하고,상기 프로세서는,상기 외부 엔티티의 전자 서명이 유효한 것으로 확인되는 경우, 상기 PQC KEM 모듈을 통해, 상기 KEM 비밀 키를이용하여 상기 제1암호문을 디-캡슐화 하여, 랜덤키를 획득하도록 설정된 전자 장치."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 스크립트는 제2암호문 및 암호화 된 커맨드를 더 포함하고,상기 프로세서는,상기 획득한 랜덤키를 이용하여 상기 제2암호문을 복호화 하여, 상기 외부 엔티티의 ECDH(elliptic curveDiffie-Hellman) 공개키를 획득하고,상기 획득한 외부 엔티티의 ECDH 공개키 및 상기 제1보안 도메인에 저장된 ECDH 개인키를 이용하여, ECDH 알고리즘을 통해 세션키를 생성하고, 및상기 세션키를 이용하여 상기 암호화된 커맨드를 복호화 하도록 설정된 전자 장치."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 외부 엔티티의 ECDH 공개키를 획득하는 동작 및 상기 세션키를 생성하는 동작은 레거시 암호 시스템의 알고리즘에 기초하는 전자 장치."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "전자 장치의 보안 데이터 처리 방법에 있어서,외부 엔티티로부터 상기 전자 장치의 보안 칩셋의 복수의 보안 도메인들 중 제1보안 도메인으로 전달되는 스크립트를 수신하는 동작;상기 스크립트를 파싱하여, 상기 외부 엔티티의 인증서 및 전자 서명을 획득하는 동작;PQC 전자 서명 검증 모듈을 통해, 상기 제1보안 도메인에 미리 저장된 상기 외부 엔티티의 인증서와 관련된 제1인증키를 이용하여 상기 획득한 외부 엔티티의 인증서를 검증하는 동작;상기 외부 엔티티의 인증서로부터 제2인증키를 추출하는 동작; 및상기 PQC 전자 서명 검증 모듈을 통해, 상기 제2인증키를 이용하여 상기 전자 서명의 유효성을 확인하는 동작을포함하는 방법.공개특허 10-2025-0052227-4-청구항 10 제 9항에 있어서,상기 보안 칩셋은,포스트 양자 암호 시스템에 기반한 KEM(key encapsulation mechanism) 알고리즘을 실행하는 PQC(post quantumcryptography) KEM 모듈을 더 포함하는 방법."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10항에 있어서,상기 제2보안 도메인은 상기 KEM(key encapsulation mechanism) 알고리즘에 사용되는 KEM 공개 키 및 KEM 비밀키를 저장하는 방법."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 제1보안 도메인은 상기 KEM 알고리즘에 사용되는 키를 저장하지 않는 방법."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11항에 있어서,상기 KEM 공개키 및 상기 KEM 비밀키는 전자 장치의 공정 단계에서 주입된 고정키 인 방법."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 9항 내지 제 13항 중 어느 한 항에 있어서,상기 스크립트는, 제1암호문을 더 포함하고,상기 방법은,상기 외부 엔티티의 전자 서명이 유효한 것으로 확인되는 경우, 상기 PQC KEM 모듈을 통해, 상기 KEM 비밀 키를이용하여 상기 제1암호문을 디-캡슐화 하여, 랜덤키를 획득하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서,상기 스크립트는 제2암호문 및 암호화 된 커맨드를 더 포함하고,상기 방법은,상기 획득한 랜덤키를 이용하여 상기 제2암호문을 복호화 하여, 상기 외부 엔티티의 ECDH(elliptic curveDiffie-Hellman) 공개키를 획득하는 동작;상기 획득한 외부 엔티티의 ECDH 공개키 및 상기 제1보안 도메인에 저장된 ECDH 개인키를 이용하여, ECDH 알고리즘을 통해 세션키를 생성하는 동작; 및공개특허 10-2025-0052227-5-상기 세션키를 이용하여 상기 암호화된 커맨드를 복호화 하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2023-0159434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 외부 엔티티의 ECDH 공개키를 획득하는 동작 및 상기 세션키를 생성하는 동작은 레거시 암호 시스템의 알고리즘에 기초하는 방법."}
{"patent_id": "10-2023-0159434", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서의 다양한 실시예에 따른 전자 장치는, 통신 회로, 보안 칩셋, 및 상기 통신 회로 및 상기 보안 칩셋과 작동적으로 연결되는 프로세서를 포함할 수 있다. 상기 보안 칩셋은, 제1보안 도메인(security domain) 및 제2보 안 도메인을 포함하는 복수의 보안 도메인들, 및 포스트 양자 암호 시스템에 기반한 전자 서명을 검증하기 위한 (뒷면에 계속)"}
{"patent_id": "10-2023-0159434", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치에 관한 것이며, 암호화 시스템에서 전자 장치가 외부 엔티티로부터 수신되는 보안 데이터 를 처리하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0159434", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치 상에서 다양한 기능을 제공함에 따라 전자 장치에 저장되는 데이터를 안전하게 보호하기 위한 방안이 요구된다. 이에 따라, 전자 장치는 보안이 필요한 데이터들을 신뢰할 수 없는 외부로부터 보호할 수 있는 보안 칩셋(secure chipset)(또는 보안 엘리먼트 IC(secure element IC))를 포함할 수 있다. 예를 들어, 보안 칩셋은 내부의 키 및 어플리케이션들을 하드웨어적으로 안전하게 보호하는 것을 보장하며, 스마트 카드, SIM(subscriber identity module) 카드, NFC(near field communication) 칩, eSE(embedded secure element)와 같이 다양한 분야에서 활용될 수 있다. 서비스 프로바이더(service provider)는 자신의 서비스를 제공하기 위해 전자 장치의 보안 칩셋 상에 애플릿 (applet)을 설치하고 정책을 설정하거나, 필요한 값을 주입 또는 획득하는 것과 같은 보안 동작들을 수행할 수 있다. 서비스 프로바이더가 보안 칩셋에 대한 보안 동작으로 활용하는 방식 중 스크립트(script) 방식을 예로 들 수 있다. 스크립트 방식은 암호화 된 커맨드(command)를 포함하며, 보안 칩셋에 전송 시 전자 장치는 암호화 된 커맨드를 복호화 하여 커맨드에 대응하는 동작을 수행할 수 있다. 스크립트 방식의 경우, 암호화 된 명령이 포함된 스크립트를 디바이스 코드 상에 포함 시키거나, 또는 특정 요구에 맞추어 서버를 통해 일괄적으로 다운 로드 받는 방식으로 보안 칩셋에 제공될 수 있다. 이 경우, 신뢰할 수 없는 공격자에 의해 스크립트가 노출될 수 있다. 스크립트 상의 커맨드는 암호화 되어 있기 때문에, 암호화 키가 없는 공격자는 커맨드의 내용을 확인할 수 없다. 예를 들어, 비대칭 키 방식으로 스크립트를 암호화 하는 경우, 개인 키를 갖지 않는 외부 공격자는 스크 립트 상의 커맨드를 복호화 하는 것이 불가능하다. 하지만, 양자 컴퓨터 기술이 발전되어 상용화되는 경우, 타 원곡선 암호 기반의 비대칭키 쌍을 이용하는 레거시 암호 시스템에서 비대칭키 쌍 중 공개 키만 가지고 개인 키 를 계산해 낼 수도 있다. 이러한 문제를 해결하기 위해, 양자 컴퓨터에 의한 공격을 방어할 수 있는 포스트 양 자 암호화(또는 양자 내성 암호화)(post-quantum cryptography, 이하 PQC)가 연구되어 표준화되고 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련된 종래 기술(prior art)로서 적용될 수 있는지에 대하여 어떠한 주장이 나 결정이 제기되지 않는다. PQC 알고리즘은 암호화 및 복호화에 사용되는 키의 사이즈가 매우 크고, 레거시 암호 알고리즘 대비 성능이 떨 어질 수 있다. 또한, PQC 알고리즘이 적용되는 보안 칩셋의 경우, 부채널 공격에서도 안전하도록 방어 기재가 적용되고, 하드웨어 가속기 적용으로 인해 메모리의 소모가 클 수 있다. 보안 칩셋은 제한적인 메모리 크기와 컴퓨팅 파워를 가질 수 있으며, 이에 따라, 기존의 보안 칩셋에 적용되어 있는 모든 암호 시스템들을 모두 PQC 시스템으로 변경하는 것은 무리가 있다. 본 문서(disclosure)(또는 명세서(specification), 발명(invention))에 따른 전자 장치는 통신 회로, 보안 칩 셋, 및 상기 통신 회로 및 상기 보안 칩셋과 작동적으로 연결되는 프로세서를 포함할 수 있다.일 실시예에 따르면, 상기 보안 칩셋은, 제1보안 도메인(security domain) 및 제2보안 도메인을 포함하는 복수 의 보안 도메인들, 및 포스트 양자 암호 시스템에 기반한 전자 서명을 검증하기 위한 PQC 전자 서명 검증 모듈 을 포함할 수 있다. 일 실시예에 따르면, 상기 프로세서는, 상기 통신 회로를 통해 외부 엔티티로부터 상기 복수의 보안 도메인들 중 제1보안 도메인으로 전달되는 스크립트를 수신하고, 상기 스크립트를 파싱하여, 상기 외부 엔티티의 인증서 및 전자 서명을 획득하고, 상기 PQC 전자 서명 검증 모듈을 통해, 상기 제1보안 도메인에 미리 저장된 상기 외 부 엔티티의 인증서와 관련된 제1인증키를 이용하여 상기 획득한 외부 엔티티의 인증서를 검증하고, 상기 외부 엔티티의 인증서로부터 제2인증키를 추출하고, 및 상기 PQC 전자 서명 검증 모듈을 통해, 상기 제2인증키를 이 용하여 상기 전자 서명의 유효성을 확인하도록 설정될 수 있다. 본 문서의 다양한 실시예에 따른 전자 장치의 보안 데이터 처리 방법은, 외부 엔티티로부터 상기 전자 장치의 보안 칩셋의 복수의 보안 도메인들 중 제1보안 도메인으로 전달되는 스크립트를 수신하는 동작, 상기 스크립트 를 파싱하여, 상기 외부 엔티티의 인증서 및 전자 서명을 획득하는 동작, PQC 전자 서명 검증 모듈을 통해, 상 기 제1보안 도메인에 미리 저장된 상기 외부 엔티티의 인증서와 관련된 제1인증키를 이용하여 상기 획득한 외부 엔티티의 인증서를 검증하는 동작, 상기 외부 엔티티의 인증서로부터 제2인증키를 추출하는 동작, 및 상기 PQC 전자 서명 검증 모듈을 통해, 상기 제2인증키를 이용하여 상기 전자 서명의 유효성을 확인하는 동작을 포함할 수 있다. 본 문서의 다양한 실시예에 따르면, 레거시 암호 시스템에서 사용되는 보안 칩셋의 구성 중 일부만을 양자 암호 시스템의 구성으로 변경하면서도, 양자 컴퓨터에 의한 공격으로부터 보호될 수 있는 하이브리드 암호 시스템을 포함하는 전자 장치 및 전자 장치의 보안 데이터 처리 방법을 제공할 수 있다."}
{"patent_id": "10-2023-0159434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으 며 여기에서 설명하는 실시예에 한정되지 않는다. 도면의 설명과 관련하여, 동일하거나 유사한 구성요소에 대해 서는 동일하거나 유사한 참조 부호가 사용될 수 있다. 또한, 도면 및 관련된 설명에서는, 잘 알려진 기능 및 구성에 대한 설명이 명확성과 간결성을 위해 생략될 수 있다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가 적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상 기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전 자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제 공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용 한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 다양한 실시예에 따른 전자 장치 및 외부 서버들을 도시한 것이다. 일 실시예에 따르면, 전자 장치는 스마트 폰, 태블릿 PC와 같은 휴대용 전자 장치로써, 다양한 어플리케이 션을 이용해 다양한 기능을 제공할 수 있다. 전자 장치는 신뢰할 수 없는 외부의 공격으로부터 데이터들을 보호하기 위한 보안 칩셋(secure chipset)(또는 보안 엘리먼트 IC(secure element IC))를 포함할 수 있다. 보 안 칩셋은 내부에 저장되는 키 및 어플리케이션들을 하드웨어적으로 안전하게 보호하는 것을 보장할 수 있다. 일 실시예에 따르면, 외부 엔티티는 전자 장치의 보안 칩셋과 보안 통신을 하고자 하는 전자 장치 외부의 주체일 수 있다. 예를 들어, 외부 엔티티는 서비스 프로바이더(예: 교통카드 업체, ID 관리 서버) 또는 서비스 프로바이더로부터 서비스 운영을 위탁 받은 TSM(trusted service manager)일 수 있으며, SE 오너(secure element owner)가 외부 엔티티가 될 수도 있다. 일 실시예에 따르면, 외부 엔티티(40 0)는 서비스 프로바이더에 의해 운영되는 서버 장치일 수 있으며, 복수의 서버 장치들을 포함할 수 있다. 외부 엔티티는 전자 장치의 보안 칩셋 내에서 적어도 하나의 보안 도메인을 할당 받아, 애플릿과 같은 다 양한 데이터를 저장할 수 있다. 일 실시예에 따르면, SE 오너는 전자 장치의 제조사에서 운영하는 적어도 하나의 서버 장치를 포함할 수 있다. SE 오너는 공정 단계에서 전자 장치의 보안 칩셋 내에 암호화 및 복호화에 사용되는 키를 주입할 수 있다. 또한, SE 오너는 외부 엔티티의 요청에 따라 보안 칩셋에 주입한 키(예: 공개키 (public key))를 전달할 수 있다. 보안 칩셋이 외부 엔티티로부터 커맨드(command)를 수신하는 경우, 수신한 커맨드에 대한 별도의 인증 (authentication) 또는 검증(verification)을 하지 않으면, 불특정한 또는 인가 받지 않은 외부로부터 전달되는 커맨드에 의해 동작하여, 보안 칩셋 내에 악의적인 애플릿이 설치되거나, 및/또는 보안 칩셋이 악의 적인 동작 을 수행할 수 있다. 따라서, 보안 칩셋은 외부 엔티티와 통신 시에 외부 엔티티를 인증하고, 채널 메 시지를 보호하기 위한 보안 채널(secure channel)을 형성할 수 있다. 상기 보안 채널들은 다양한 방식으로 규격 화될 수 있으며, 전자 장치의 보안 칩셋은 규격화 된 보안 채널을 통해 구동되도록 구현될 수 있다. 일 실시예에 따르면, 전자 장치의 보안 칩셋은 복수의 보안 도메인(secure domain)들을 포함할 수 있다. 보안 칩셋은 별도의 운영 체제(operating system, OS)을 탑재할 수 있으며, 예를 들어, Global Platform의 card specification 규격을 따르는 운영 체제를 탑재할 수 있다. 전자 장치는 Global Platform의 card specification 규격에 따라 보안 칩셋 내에 복수의 보안 도메인들을 형성할 수 있으며, 각각의 보안 도메인을 서로 다른 외부 엔티티의 서비스와 관련된 데이터를 저장하기 위해 할당할 수 있다. 각각의 보안 도메인은 독립적으로 각각의 서비스를 제공할 수 있으며, 다른 보안 도메인의 asset에 접근 불가능한 정책을 가지고, 다 른 도메인의 키를 알 수 없다. 일 실시예에 따르면, 외부 엔티티는 전자 장치의 보안 칩셋에서 적어도 하나의 보안 도메인을 할당 받을 수 있으며, 해당 보안 도메인 내에 원하는 정책을 설정하거나, 필요한 값을 주입 또는 획득하거나, 또는 애플릿을 설치 및 구동하는 것과 같은 보안 동작들을 수행할 수 있다. 일 실시예에 따르면, 외부 엔티티는 스크립트(script) 방식에 따라 보안 도메인에 대해 보안 동작을 수행 할 수 있다. 예를 들어, 스크립트 방식은 GP SCP11c(global platform secure channel protocol 11c), SEMS(secure element management system), LCCM(local card contents management)을 예로 들 수 있으나, 이에 한정되지는 않는다. 스크립트 방식은 특정 보안 도메인을 할당 받은 외부 엔티티가 해당 보안 도메인에 저 장된 고정키 쌍 중 공개키를 활용하여, 인증, 세션키 생성, 커맨드를 암호화하고, 생성된 데이터들을 스크립트 에 포함하여 보안 도메인으로 전송하는 과정들을 포함할 수 있다. 스크립트 방식을 활용하는 경우, 외부 엔티티 와 보안 칩셋의 보안 도메인 사이에 dynamic 또는 interactive 한 통신 메시지의 생성 없이도, 외부 엔티 티에서 생성한 스크립트를 그대로 보안 칩셋에 전송하여 보안 도메인 상에서 원하는 동작을 실행할 수 있 다. 또한, 스크립트 방식을 활용하는 경우, 서비스 프로바이더 또는 타겟 SD(security domain)의 관리자가 운영 하는 서버와의 네트워크 연결 없이도 스크립트의 전달 및 실행이 가능하기 때문에, 다양하게 활용이 가능한 장 점이 있다. 일 실시예에 따르면, 외부 엔티티는 상술한 스크립트 방식에 따라, 암호화된 커맨드를 전자 장치의 공정 과정에서 디바이스 코드 상에 포함 시키거나, 서버를 통해 일괄적으로 다운로드 하는 방식으로 보안 칩셋 상에 스크립트를 전달할 수 있다. 이와 같이 스크립트를 전달하는 과정 및 보안 칩셋 상에 저장되는 상태에서 외부의 신뢰할 수 없는 공격자에 의해 스크립트가 노출될 수 있다. 레거시 암호 시스템에 따르면, 스크립트가 공격자에게 노출되더라도, 공격자가 스크립트에 포함된 커맨드의 내 용을 알아내거나, 스크립트를 위변조할 수 없다. 예를 들어, 스크립트에는 보안 도메인에 주입되어 있는 고정키 쌍 중 공개키와 외부 엔티티의 고정키 쌍의 공개키, 및/또는 외부 엔티티가 생성한 임시키 쌍 중 공 개키만 포함할 수 있으며, 개인키를 가지고 있어야만 계산해 낼 수 있는 세션 암호화키로 암호화 및 전자 서명 될 수 있으므로, 개인키를 갖지 않는 공격자는 스크립트 내에 암호화된 데이터들을 알아내거나, 위변조 할 수 없다. 양자 역학의 원리를 이용한 양자 컴퓨터가 개발됨에 따라, RSA 또는 ECC(elliptic curve cryptography)와 같은 공개키 암호 시스템은 그 안정성이 취약해 질 수 있다. 예를 들어, 양자 컴퓨터가 발달하는 경우, 타원곡선에 기반한 ECC 알고리즘의 공개키를 이용해 개인키를 계산해 낼 위험이 있다. 이 경우, 양자 컴퓨터를 이용한 공격 자는 스크립트 방식에서 암호화에 사용한 개인키를 계산해 낼 수 있으며, 개인키를 이용해 스크립트의 내용을 복호화 하거나, 또는 외부 엔티티에서 생성한 것과 같은 유효한 스크립트를 생성해 낼 수도 있다. 이러한 양자 컴퓨터로 인한 레거시 암호 시스템의 취약성을 보완하기 위해, 포스트 양자 암호화(또는 양자 내성 암호) 시스템(post-quantum cryptography, 이하 PQC)이 개발되고 있다. PQC 알고리즘은 양자 컴퓨터의 공격 시도에도 해독되지 못하는 다양한 암호화 알고리즘을 지칭하는 것으로, KEM(key encapsulation mechanism) 알고리즘인Kyber, PQC 전자 서명(digital signature, DS) 알고리즘인 Dilithium이 표준화 되고 있다. 이와 같은 PQC 알고 리즘은 암호화 및 복호화에 사용되는 키의 사이즈가 크고, 레거시 암호 시스템 대비 성능이 떨어질 수 있다. 또 한, PQC 알고리즘이 적용되는 보안 칩셋의 경우, 부채널 공격에서도 안전하도록 방어 기재가 적용되고, 하드웨 어 가속기 적용으로 인해 메모리의 소모가 클 수 있다. 이와 같은 이유에 따라, 제한적인 메모리 크기와 컴퓨팅 파워를 갖는 전자 장치의 보안 칩셋에 PQC 알고리즘을 적용하는 것은 어려울 수 있다. 상술한 문제를 고려하여, 본 문서의 다양한 실시예에 따른 전자 장치는 보안 칩셋에 대해 레거시 암호 시 스템에서 구현되는 구조를 최대한 유지하고, 보안 칩셋의 운영 체제의 변경을 최소화 하면서도, quantum safe한 (또는 양자 컴퓨터의 공격으로부터 안전한) 스크립트 방식의 보안 서비스를 제공할 수 있다. 일 실시예에 따르면, 전자 장치의 보안 칩셋은 PQC KEM 알고리즘에 사용되는 하나의 키 쌍을 저장할 수 있 다. 또한, 전자 장치는 PQC 전자 서명 알고리즘 중 전자 서명의 검증을 위한 알고리즘을 수행하는 모듈을 저장할 수 있다. 전자 장치는 상술한 키 쌍 및 모듈 외에는 레거시 암호 시스템의 구조를 포함할 수 있으 며, 이와 같이 구성함에도 양자 컴퓨터의 공격에 스크립트가 노출되지 않도록 할 수 있다. 도 3은 다양한 실시예에 따른 전자 장치의 블록도이다. 도 3을 참조하면, 전자 장치는 보안 칩셋, 무선 통신 회로, 프로세서, 및 메모리를 포함할 수 있다. 도시된 구성 중 적어도 일부가 생략 또는 치환되더라도 본 문서의 다양한 실시예를 구현할 수 있다. 전자 장치는 도 1의 전자 장치의 구성 및/또는 기능 중 적어도 일부를 더 포함할 수 있다. 일 실시예에 따르면, 무선 통신 회로는 외부 장치(예: 도 2의 외부 엔티티)와의 무선 통신을 지원할 수 있다. 예를 들어, 무선 통신 회로는 셀룰러 무선 통신(예: 4G LTE, 5G NR), 및 근거리 무선 통신(예: WLAN, Bluetooth)을 지원하기 위한 다양한 하드웨어 및 소프트웨어 구성을 포함할 수 있다. 무선 통신 회로 는 도 1의 통신 모듈의 구성 및/또는 기능 중 적어도 일부를 포함할 수 있다. 일 실시예에 따르면, 무선 통신 회로는 OTA(over the air) 방식으로 외부 엔티티로부터 보안 데이터(예: 스크립트)를 수신할 수 있다. 일 실시예에 따르면, 메모리는 휘발성 메모리 및 비휘발성 메모리를 포함하여, 다양한 데이터들을 일시적 또는 영구적으로 저장할 수 있다. 메모리는 도 1의 메모리의 구성 및/또는 기능 중 적어도 일부를 포 함하고, 도 1의 프로그램을 저장할 수 있다. 메모리는 프로세서에서 수행될 수 있는 다양한 인 스트럭션(instruction)들을 저장할 수 있다. 이와 같은 인스트럭션들은 프로세서에 의해 인식될 수 있는 산술 및 논리 연산, 데이터 이동, 입출력의 제어 명령을 포함할 수 있다. 일 실시예에 따르면, 프로세서는 전자 장치의 각 구성 요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 수행할 수 있는 구성으로써, 하나 이상의 프로세서들로 구성될 수 있다. 프로세서는 도 1의 프로세서의 구성 및/또는 기능 중 적어도 일부를 포함할 수 있다. 프로세서는 무선 통신 회로, 메모리, 보안 칩셋와 같은 전자 장치의 각 구성 요소와 작동적으로(operatively), 기능적으로 (functionally) 및/또는 전기적으로(electrically) 연결될 수 있다. 일 실시예에서, 전자 장치의 하드웨어들이 작동적으로 결합된 것은, 하드웨어들 중 제1 하드웨어에 의해 제2 하드웨어가 제어되도록, 하드웨어들 사이의 직접적인 연결, 또는 간접적인 연결이 유선으로, 또는 무선으로 수립된 것을 의미할 수 있다. 프로세서가 전자 장치 상에서 구현할 수 있는 연산 및 데이터 처리 기 능에는 한정됨이 없을 것이나, 본 문서에서는 외부 엔티티로부터 스크립트를 수신하고, 스크립트 및 보안 칩셋 에 미리 주입되어 있는 키를 이용하여 암호화 키를 생성하고, 및/또는 암호화 된 커맨드를 복호화 하여 커 맨드를 실행하기 위한 다양한 실시예들에 대해 설명하기로 한다. 후술할 프로세서의 동작들은 메모리(22 0)에 저장된 인스트럭션들을 로딩(loading)함으로써 수행될 수 있다. 일 실시예에 따르면, 후술할 프로세서 의 동작 중 적어도 일부는 보안 칩셋에 포함된 보안 프로세서(미도시)에 의해 수행될 수 있다. 일 실시예에 따르면, 보안 칩셋(secure element)은 안전한 데이터의 저장 및 보호된 커맨드의 실행 환경을 보장해주는 회로 구성 및 소프트웨어를 포함할 수 있다. 일 실시예에 따르면, 보안 칩셋은 프로세서 및 메모리와 별도의 칩셋(chipset)으로 구성될 수 있으며, 다른 일 실시예에 따르면 메모리의 일부 물리적 영역이 보안 칩셋의 영역으로 할당될 수 있다. 보안 칩셋은 보안 엘리먼트 IC(secure element IC) 또는 보안 회로(secure circuitry)로 지칭될 수도 있다. 일 실시예에 따르면, 보안 칩셋은 프로세서에 의해 실행되는 운영 체제와는 독립적인 운영 체제를 저 장 및 실행할 수 있다. 예를 들어, 보안 칩셋의 운영 체제는 Global Platform의 card specification 규격을 따를 수 있다. 일 실시예에 따르면, 보안 칩셋은 복수의 보안 도메인(security domain)들을 포함할 수 있다. 복수의 보안 도메인들은 보안 칩셋 상에서 물리적으로 또는 논리적으로 분리된 영역으로 할당될 수 있다. 각각의 보안 도메인은 독립적으로 각각의 외부 엔티티(예: 교통카드 업체, ID 관리 서버)의 서비스를 제공할 수 있으며, 다 른 보안 도메인의 asset에 접근 불가능한 정책을 가지고, 다른 도메인의 키를 알 수 없다. 일 실시예에 따르면, 복수의 보안 도메인들은 특정 외부 엔티티의 서비스와 관련된 애플릿을 저장하고 외부 엔 티티에서 전달 받은 스크립트에 포함된 커맨드를 실행하는 제1보안 도메인, 및 보안 칩셋 내에서 다른 보 안 도메인의 동작을 관리하고 암호화 키의 관리 및 분배를 수행하는 제2보안 도메인을 포함할 수 있다. 보안 칩 셋에 포함되는 보안 도메인의 개수는 이에 한정되지 않으며, 다른 적어도 하나의 외부 엔티티의 서비스를 제공하기 위해 제1보안 도메인의 기능 및 동작에 대응하는 적어도 하나의 보안 도메인이 보안 칩셋 상에 할당될 수 있다. 일 실시예에 따르면, 제2보안 도메인은 CASD(controlling authority security domain)일 수 있다. CASD는 새로 생성되는 보안 도메인의 초기 키를 생성해 주거나, 다른 보안 도메인의 서비스 애플릿의 보안 칩셋에 대한 증명(attestation)을 외부 엔티티에 제공하고자 하는 경우, 증명을 위한 서명을 제공해 줄 수 있다. 본 문서에 서는 제2보안 도메인이 CASD인 것으로 설명하나, 이에 한정되지는 않는다. 일 실시예에 따르면, 제2보안 도메인(예: CASD)은 PQC(post-quantum cryptography) KEM(key encapsulation mechanism) 알고리즘에 사용되는 비대칭 키 쌍 KEM.PK(또는 KEM 공개키) 및 KEM.SK(또는 KEM 비밀키)를 저장할 수 있다. 제2보안 도메인에 저장되는 비대칭키 쌍 KEM.PK 및 KEM.SK는 보안 칩셋 칩셋의 제조 공정에서 주 입되거나, 전자 장치의 제조 공정에서 보안 칩셋 내에 주입되거나, 또는 사용자에 의해 전자 장치 의 사용 중에 무선 통신 회로를 통해 OTA 방식으로 수신하여 주입될 수 있다. 일 실시예에 따르면, 비대칭키 쌍 KEM.PK 및 KEM.SK는 SE 오너에 의해 생성되는 고정키(static key)일 수 있으며, 예를 들어, SE 오 너는 전자 장치의 모델 별로 또는 SE 카드의 운영 체제 별로 복수의 전자 장치들의 보안 칩셋에 대해 동일한 PQC KEM 키 쌍을 고정 키(static key)로써 주입할 수 있다. 일 실시예에 따르면, 제1보안 도메인은 제2보안 도메인에 저장된 PQC KEM 키 쌍을 이용해 암호문을 복호화 할 수 있다. 예를 들어, 제1보안 도메인과 제2보안 도메인 사이에는 정해진 인터페이스(예: SIO(sharable interface object))가 형성될 수 있으며, 제1보안 도메인은 SIO API의 호출을 통해 제2보안 도메인에 저장된 PQC KEM 비대칭 키 쌍 중 적어도 하나를 이용한 디-캡슐화(de-capsulation)를 요청할 수 있다. 제2보안 도메인 은 상기 디-캡슐화 요청에 대응하여, KEM 비대칭 키 쌍 중 KEM 비밀키를 이용한 디-캡슐화의 결과 값으로 랜덤 키를 획득하고, 획득한 랜덤키를 SIO를 통해 제1보안 도메인에 전달할 수 있다. PQC KEM 키들은 레거시 암호 시스템의 비대칭 키들보다 크기가 큰데, 보안 칩셋에서 제2보안 도메인에만 PQC KEM 키 쌍을 저장하기 때 문에 키의 저장에 소요되는 메모리 리소스를 감소 시킬 수 있다. 일 실시예에 따르면, 보안 칩셋은 PQC KEM 모듈(미도시) 및 PQC 전자 서명 검증 모듈(미도시)을 포함할 수 있다. 일 실시예에 따르면, PQC KEM 모듈은 보안 칩셋 내에 구현되어 있는 KEM 알고리즘을 위한 라이브러 리, 패키지 또는 모듈을 포함할 수 있다. PQC KEM 모듈은 Kyber와 같은 KEM 알고리즘의 키 캡슐화 (encapsulation) 또는 디-캡슐화(de-capsulation)를 수행할 수 있다. 일 실시예에 따르면, PQC 전자 서명 검증 모듈은 보안 칩셋에 구현되어 있는 PQC 전자 서명 알고리즘 기능 중 서명 검증 기능을 제공하는 라이브러 리, 패키지 또는 모듈을 포함할 수 있다. PQC 전자 서명 검증 모듈은 Dilithium과 같은 quantum safe 한(또는 양자 컴퓨터의 공격으로부터 안전한) 전자 서명 알고리즘을 구현할 수 있다. 복수의 보안 도메인들, PQC KEM 모듈 및 PQC 전자 서명 검증 모듈을 포함하는 보안 칩셋의 구체적인 구성 에 대해서는 도 4를 통해 보다 상세히 설명하기로 한다. 일 실시예에 따르면, 전자 장치는 외부 엔티티로부터 커맨드를 포함하는 스크립트를 수신할 수 있다. 이하 에서는 외부 엔티티로부터 제1보안 도메인을 타겟으로 하는 스크립트가 수신되는 경우, 프로세서(또는 보 안 칩셋의 보안 프로세서)의 동작에 대해 설명하기로 한다. 일 실시예에 따르면, 프로세서(또는 보안 칩셋의 보안 프로세서)는 수신된 스크립트로부터 외부 엔티 티의 인증서, 전자 서명, 복수의 암호문들 및 암호화 된 커맨드들을 파싱(parsing) 할 수 있다. 일 실시예에 따르면, 프로세서는 PQC 전자 서명 검증 모듈을 통해, 미리 획득한 OCE(off-card entity) 인 증서 발급자(예: issuer 또는 CA)의 공개키를 이용하여 외부 엔티티의 인증서를 검증할 수 있다. 전자 장치는 외부 엔티티가 보유한 전자 서명 인증서를 검증하기 위해, 외부 엔티티의 인증서를 발행하는 발급자(예: issuer 또는 CA)로부터 공개키를 미리 획득할 수 있다. 예를 들어, 보안 칩셋의 공정 단계, 전 자 장치의 공정 단계, 및/또는 SE 오너가 운영하는 OTA 서비스를 통해 OCE 인증서 발급자의 공개키가 보안 칩셋 상에 미리 주입될 수 있다. 외부 엔티티는 PQC 전자 서명 알고리즘과 키를 이용해 전자 서명하였기 때문에, 외부 엔티티의 인증서는 양자 컴퓨터에 의해 공격받지 않음을 신뢰할 수 있다. 일 실시예에 따르면, 프로세서는 PQC 전자 서명 검증 모듈을 통해, 외부 엔티티의 인증서에서 추출한 공개 키를 이용하여 외부 엔티티의 전자 서명을 검증할 수 있다. 검증에 성공하는 경우, 전자 장치는 외부 엔티 티에 의해 서명된 스크립트 임을 신뢰할 수 있다. 일 실시예에 따르면, 프로세서는 PQC KEM 모듈을 통해 스크립트로부터 파싱한 제1암호문을 제2보안 도메인 에 저장된 KEM 비밀키를 이용하여 디-캡슐화 하고, 랜덤키 K를 획득할 수 있다. 예를 들어, 프로세서는 제 1보안 도메인과 제2보안 도메인 사이의 SIO API를 호출하여 제2보안 도메인에 KEM 비밀키를 이용한 디-캡슐화를 요청하고, 제2보안 도메인은 KEM 비밀키를 이용한 디-캡슐화의 결과 값으로 랜덤키 K를 획득할 수 있다. 제1암 호문은 외부 엔티티가 KEM 비밀키와 키 쌍인 KEM 공개키를 이용하여 생성한 랜덤키를 캡슐화 한 것일 수 있으며, PQC KEM 모듈을 통해 외부 엔티티와 동일한 PQC KEM 알고리즘에 의해 제1암호문을 디-캡슐화 함에 따라 외부 엔티티에서 생성한 랜덤키와 동일한 랜덤키가 획득될 수 있다. 일 실시예에 따르면, 프로세서는 PQC KEM 모듈의 디-캡슐화에 의해 획득된 랜덤키를 이용하여 스크립트로 부터 파싱한 제2암호문을 복호화 하고, 외부 엔티티에서 생성한 임시 ECDH(elliptic curve Diffie-Hellman) 키 쌍 중 공개키를 획득할 수 있다. 외부 엔티티에서 생성한 임시 ECDH 키 쌍 중 공개키는 생성 후 랜덤키로 암호 화 한 후 전자 장치의 보안 칩셋 내에서 복호화 되기 때문에 quantum safe할(또는 양자 컴퓨터의 공 격으로부터 안전할) 수 있다. 일 실시예에 따르면, 프로세서는 획득한 외부 엔티티의 ECDH 공개키 및 제1보안 도메인에 저장된 ECDH 개 인키를 이용하여, 세션키를 생성할 수 있다. 여기서, 세션키를 생성하는 알고리즘은 레거시 암호 시스템의 ECDH(elliptic curve Diffie-Hellman)) 알고리즘일 수 있다. 외부 엔티티는 자신이 생성한 ECDH 비밀키 및 전 자 장치의 제1보안 도메인에 저장된 ECDH 공개 키를 이용하여 세션키를 생성할 수 있으며, 스크립트에 포 함된 커맨드의 암호문은 외부 엔티티가 생성한 세션키에 의해 암호화될 수 있다. 전자 장치는 외부 엔티티 와 동일한 ECDH 알고리즘을 통해, 외부 엔티티의 ECDH 공개키 및 제1보안 도메인의 ECDH 개인키을 이용하여 세 션키를 생성하였으므로, 전자 장치에서 생성한 세션키와 외부 엔티티에서 생성한 세션키는 서로 동일할 수 있다. 일 실시예에 따르면, 프로세서는 생성된 세션키를 이용하여 암호화 된 커맨드를 복호화 할 수 있다. 커맨 드는 외부 엔티티에 의해 세션키를 이용한 대칭키 암호화 방식으로 암호화 되었고, 전자 장치가 생성한 세 션키는 외부 엔티티가 생성한 세션키와 동일하므로, 암호화 된 커맨드를 복호화 할 수 있다. 프로세서가 세션키를 생성하고 커맨드를 복호화하는 과정은 PQC 시스템을 사용하지 않고, 레거시 암호화 시스템의 방식을 사용할 수 있다. 따라서, 전자 장치는 세션키를 생성하고 커맨드를 복호화 하기 위해 quantum safe한 하드 웨어 및/또는 소프트웨어를 포함하지 않는 레거시 암호 시스템의 구성만 포함하더라도, 양자 컴퓨터의 공격에 의해 스크립트가 노출되지 않는 quantum safe한 환경을 제공할 수 있다. 일 실시예에 따르면, 프로세서는 복호화 된 커맨드를 실행할 수 있다. 예를 들어, 프로세서는 커맨드 에서 설정된 애플릿을 설치 및 동작 하거나, 및/또는 커맨드에서 정해진 정책을 타겟 보안 도메인인 제1보안 도 메인 상에서 실행할 수 있다. 도 4는 다양한 실시예에 따른 전자 장치의 보안 칩셋의 블록도이다. 도 4를 참조하면, 보안 칩셋(secure element)(예: 도 3의 보안 칩셋)은 복수의 보안 도메인들(310, 320, 330), PQC KEM 모듈, 및 PQC 전자 서명 검증 모듈을 포함할 수 있다. 일 실시예에 따르면, 보안 칩셋은 전자 장치의 프로세서(예: 도 3의 프로세서)에 의해 운영되는 운영 체제와는 독립적인 운영 체제(예: Global Platform의 card specification의 운영 체제)를 탑재할 수 있다. 보 안 칩셋의 운영 체제는 복수의 보안 도메인(security domain, SD)들을 할당할 수 있다. 각각의 보안 도메 인(예: CASD, SD A, SD B)은 보안 칩셋 상에서 물리적으로 또는 논리적으로 분리된 영역 으로 할당될 수 있다. 각각의 보안 도메인(310, 320, 330)은 독립적으로 각각의 서비스를 제공할 수 있으며, 다 른 보안 도메인의 asset에 접근 불가능한 정책을 가지고, 다른 도메인의 키를 알 수 없다.일 실시예에 따르면, CASD(controlling authority security domain)는 보안 칩셋 내에서 다른 보안 도메인의 생성, 삭제, 업데이트의 동작을 관리하고, 보안 칩셋 내의 키 관리를 담당하며, 다른 보안 도메 인에 키를 분배하는 동작을 수행할 수 있다. CASD는 새로 생성되는 보안 도메인의 초기 키를 생성해 주거 나, 다른 보안 도메인의 서비스 애플릿의 보안 칩셋에 대한 증명(attestation)을 외부 엔티티에 제공하고 자 하는 경우, 증명을 위한 서명을 제공해 줄 수 있다. 일 실시예에 따르면, CASD는 PQC(post-quantum cryptography) KEM(key encapsulation mechanism) 알고리 즘에 사용되는 비대칭 키 쌍 KEM.PK(또는 KEM 공개키) 및 KEM.SK(또는 KEM 비밀키)를 저장할 수 있다. KEM(또는 키 캡슐화 매커니즘) 알고리즘은 대칭키 암호화 방식과 공개키 암호화 방식을 결합하여 메시지의 송신자와 수신 자 사이에 안전한 키 교환을 가능하게 하는 암호화 기술일 수 있다. 일 실시예에 따르면, CASD에 저장되는 비대칭키 쌍 KEM.PK 및 KEM.SK는 보안 칩셋 칩셋의 제조 공정 에서 주입되거나, 전자 장치의 제조 공정에서 보안 칩셋 내에 주입되거나, 또는 사용자에 의해 전자 장치 의 사용 중에 무선 통신 회로를 통해 OTA 방식으로 수신하여 주입될 수 있다. 일 실시예에 따르면, 비대칭키 쌍 KEM.PK 및 KEM.SK는 SE 오너(예: 도 2의 SE 오너)에 의해 생성되는 고정키(static key)일 수 있다. 예를 들어, SE 오너는 전자 장치의 모델 별로 또는 SE 카드의 운영 체제 별로 복수의 전자 장치들의 보안 칩셋 에 대해 동일한 PQC KEM 키 쌍을 고정 키(static key)로써 주입할 수 있다. 이에 따라, 보안 칩셋의 특정 보안 도메인(예: SD A)을 할당 받은 외부 엔티티는 전자 장치의 모델 또는 보안 칩셋의 운영 체제에 대한 정보를 포함하여 SE 오너에 키의 전달을 요청하고, SE 오너로부터 KEM 공개키 KEM.PK를 획득할 수 있다. 다른 일 실시예에 따르면, 비대칭키 쌍 KEM.PK 및 KEM.SK는 CASD가 아닌 다른 보안 도메인에 저장될 수도 있다. 본 문서에서는 PQC KEM 알고리즘에 사용되는 KEM.PK 및 KEM.SK를 저장하는 보안 도메인(예: CASD 또 는 다른 보안 도메인)을 제2보안 도메인으로 지칭할 수 있다. 일 실시예에 따르면, SD A 및 SD B는 보안 칩셋에서 각각의 외부 엔티티의 서비스에 대응하여 할당된 보안 도메인일 수 있다. 도 4에서는 2개의 보안 도메인 SD A 및 SD B를 도시하고 있으나, 보 안 칩셋에서 할당 가능한 보안 도메인의 개수는 이에 한정되지 않는다. 일 실시예에 따르면, SD A 및 SD B는 적어도 하나의 애플릿(applet)을 저장할 수 있다. 여기서, 애플 릿은 보안 도메인과 같이 소용량 컴퓨터 장치 상에서 실행되는 소규모 어플리케이션을 의미할 수 있다. 일 실시 예에 따르면, SD A 및 SD B는 서로 독립적으로 서로 다른 외부 엔티티의 서비스를 제공할 수 있으며, 다른 보안 도메인의 asset에 접근 불가능한 정책을 가지고, 다른 보안 도메인의 키를 알 수 없다. 일 실시예에 따르면, SD A 및 SD B는 레거시 암호 시스템인 ECDH(elliptic curve Diffie-Hellman) 알고리즘에 사 용되는 키 쌍을 저장할 수 있다. 일 실시예에 따르면, SD A 및 SD B는 각각 대응되는 외부 엔티티로부터 전달되는 커맨드에 기초하여 애플릿을 설치 및 실행하고, 애플릿에 대한 정책 설정, 업데이트와 같은 동작을 실행할 수 있다. 일 실시예에 따르면, SD A 및 SD B는 CASD와 정해진 인터페이스(예: SIO(sharable interface object))를 통 해 통신할 수 있다. SIO는 서로 다른 보안 도메인 또는 애플릿 사이에 통신을 제공하는 인터페이스일 수 있다. 본 문서에서는 특정 외부 엔티티의 서비스에 대해 할당되는 보안 도메인인 SD A 또는 SD B를 제1보안 도메인으로 지칭할 수 있다. 일 실시예에 따르면, SD A 또는 SD B(또는 제1보안 도메인)는 인터페이스를 통해 CASD(또는 제2 보안 도메인)로부터 KEM 알고리즘의 비대칭키 쌍 KEM.PK 및 KEM.SK를 획득할 수 있다. 예를 들어, SD A 또 는 SD B는 CASD와 사이의 인터페이스(예: SIO)의 API를 호출하여, CASD에 저장된 KEM 비대칭키 쌍 중 적어도 하나를 이용한 디-캡슐화(de-capsulation)를 요청할 수 있다. CASD는 미리 주입된 KEM 비대 칭키 쌍 중 KEM 비밀키를 이용한 디-캡슐화의 결과 값으로 랜덤키 K를 획득하고 SD A 또는 SD B에 전 달할 수 있다. KEM 키 쌍은 그 길이가 길고 신규 생성에 시간이 오래 소요될 수 있으며, SD A 및 SD B는 별도로 KEM 키 쌍을 저장하지 않고, KEM.PK 및 KEM.SK를 저장한 CASD를 이용하여, 스크립트의 복호화에 사용할 수 있다. 일 실시예에 따르면, SD A 및 SD B는 KEM 키 쌍을 보안 채널 키로 가질 수 있도록 속성(property)를 변경할 필요 없이 레거시 암호 시스템의 구조를 그대로 활용할 수 있다. 일 실시예에 따르면, PQC KEM 모듈은 보안 칩셋 내에 구현되어 있는 KEM 알고리즘을 위한 라이브러리, 패키지 또는 모듈을 포함할 수 있다. PQC KEM 모듈은 Kyber와 같은 KEM 알고리즘의 키 캡슐화 (encapsulation) 또는 디-캡슐화(de-capsulation)를 수행할 수 있다. PQC KEM 모듈은 특정 SD(예: SDA 또는 SD B)에 대해 외부 엔티티로부터 스크립트가 수신되는 경우, CASD에 저장된 KEM 키 쌍 중 비밀키 KEM.SK를 이용해 스크립트에 포함된 키의 암호문을 디-캡슐화 할 수 있다. PQC KEM 모듈의 KEM 알고리즘은 스크립트를 전달하는 외부 엔티티의 KEM 알고리즘과 동일 또는 대응될 수 있으며, 외부 엔티티에서 공개키 KEM.PK를 이용해 캡슐화 한 암호문을 CASD가 비밀키 KEM.SK를 이용해 디-캡슐화 할 수 있다. 일 실시예에 따르면, PQC 전자 서명 검증 모듈은 보안 칩셋에 구현되어 있는 PQC 전자 서명 알고리즘 기능 중 서명 검증 기능을 제공하는 라이브러리, 패키지 또는 모듈을 포함할 수 있다. PQC 전자 서명 검증 모듈 은 Dilithium과 같은 quantum safe 한 전자 서명 알고리즘을 구현할 수 있다. 일 실시예에 따르면, PQC 전자 서명 검증 모듈은 외부 엔티티에서 전달되는 스크립트에 포함된 인증서를 검증하여, 스크립트를 생성한 주체가 외부 엔티티임을 확인할 수 있다. PQC 전자 서명 검증 모듈은 외부 엔티티가 보유한 전자 서명 인증서를 검증하기 위해, 외부 엔티티의 인증서를 발행하는 발급자(예: issuer 또는 CA)로부터 공개키를 미리 획득할 수 있다. 예를 들어, 보안 칩셋의 공정 단계, 전자 장치의 공정 단 계, 및/또는 SE 오너가 운영하는 OTA 서비스를 통해 OCE 인증서 발급자의 공개키가 보안 칩셋 상에 미리 주입될 수 있다. 외부 엔티티는 PQC 전자 서명 알고리즘과 키를 이용해 전자 서명하였기 때문에, 인증서 발급자로부터 획득한 공개키를 이용해 인증서의 검증에 성공하는 경우, 스크립트에 포함된 인증서는 양자 컴퓨터에 의해 공격 받지 않은 외부 엔티티에 의해 생성된 것임을 신뢰할 수 있다. 일 실시예에 따르면, PQC 전자 서명 검증 모듈은 외부 엔티티에서 전달되는 스크립트에 포함된 전자 서명 을 검증하여, 인증된 외부 엔티티에 의해 스크립트가 서명된 것임을 확인할 수 있다. PQC 전자 서명 검증 모듈 은 스크립트의 인증서로부터 추출한 공개키에 기초하여 전자 서명의 유효성을 검증할 수 있다. PQC 알고리즘은 키의 크기가 크고 동작 속도가 느린 단점이 있으나, 인증서와 전자 서명을 검증하는 알고리즘은 다른 PQC 알고리즘에 비해 상대적으로 빠르고 메모리 소모가 적을 수 있다. 따라서, PQC 전자 서명 검증 모듈 을 이용하여 인증서 및 전자 서명을 검증하는 경우, 리소스를 적게 소모하면서도, quantum safe하도록 구 현할 수 있다. 도 5는 다양한 실시예에 따른 외부 엔티티에서 스크립트를 생성하는 방법의 흐름도이다. 도 5에 도시된 방법은 전자 장치의 보안 칩셋(예: 도 3 및 도 4의 보안 칩셋)의 외부에 위치하는 외부 엔 티티(또는 OCE(off-card entity))(예: 도 2의 외부 엔티티)에 의해 수행될 수 있다. 이하에서는 앞서 설명 한 바 있는 기술적 특징에 대해서는 그 설명을 생략할 수도 있다. 일 실시예에 따르면, 외부 엔티티는 전자 장치의 보안 칩셋(secure element)에 포함된 복수의 보안 도메인 (security domain)들 중 타겟 보안 도메인(예: 제1보안 도메인)과 보안 통신을 수행하고자 하는 전자 장치의 외 부의 주체일 수 있다. 예를 들어, 외부 엔티티는 서비스 제공자(예: 교통카드 업체, ID 관리 서버), 또는 보안 칩셋의 오너(owner)(예: 전자 장치의 제조사)에서 운영하는 서버 장치일 수 있다. 외부 엔티티는 적어도 하나의 서버 장치를 포함할 수 있으며, 도 5의 방법의 각각의 동작은 외부 엔티티를 구성하는 서버 장치 중 하나 또는 2 이상의 서버 장치에 의해 수행될 수 있다. 일 실시예에 따르면, 외부 엔티티는 적어도 하나의 서버 장치를 통해 여러 동작을 수행할 수 있으므로, 메모리, 프로세서와 같은 컴퓨팅 리소스 및/또는 컴퓨팅 파워에 제약이 없을 수 있다. 따라서, 외부 엔티티는 제한된 리 소스를 갖는 전자 장치와 달리 PQC(post-quantum cryptography) 알고리즘을 동작 하기 위한 충분한 리소스를 이 용할 수 있다. 이하 실시예에서 각 동작들은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작들의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 일 실시예에 따르면, 동작 510에서, 외부 엔티티는 PQC 전자 서명(digital signature, DS)에 사용되는 키 쌍(예: 공개키 OCE.DS.PK 및 비밀키 OCE.DS.SK)과 상기 키들에 대한 인증서 OCE.DS.CERT를 저장할 수 있다. 일 실시예에 따르면, 동작 515에서, 외부 엔티티는 전자 장치의 보안 칩셋(secure element, SE)의 제1보안 도메 인(security domain, SD)에 전송할 커맨드를 생성할 수 있다. 일 실시예에 따르면, 전자 장치의 보안 칩셋은 복 수의 보안 도메인들을 포함할 수 있으며, 전자 장치는 복수의 보안 도메인들 중 어느 하나(예: 제1보안 도메 인)를 외부 엔티티에서 제공하는 서비스의 데이터를 저장하기 위해 할당할 수 있다. 외부 엔티티에서 생성하는 커맨드는 외부 엔티티에서 제공하는 서비스와 관련된 애플릿(applet), 정책 설정, 필요한 값을 주입 또는 획득 하는 보안 동작과 같은 보안 데이터들을 포함할 수 있다.일 실시예에 따르면, 동작 520에서, 외부 엔티티는 보안 칩셋의 제2보안 도메인에 저장되어 있는 공개 키 KEM.PK를 보안 칩셋의 오너(owner)로부터 획득할 수 있다. 여기서, 제2보안 도메인은 CASD(controlling authority security domain)일 수 있다. 예를 들어, CASD는 보안 칩셋 내에서 다른 보안 도메인의 생성, 삭제, 업데이트와 같은 동작을 관리하고, 보안 칩셋 내의 키 관리를 담당하며, 다른 보안 도메인에 키를 분배하는 동 작을 수행할 수 있다. CASD는 새로 생성되는 보안 도메인의 초기 키를 생성해 주거나, 다른 보안 도메인의 서비 스 애플릿의 보안 칩셋에 대한 증명(attestation)을 외부 엔티티에 제공하고자 하는 경우, 증명을 위한 서명을 제공해 줄 수 있다. 본 문서에서는, 제2보안 도메인을 CASD로 설명하기로 하나, 이에 한정되지 않으며, CASD가 아닌 다른 보안 도메인 중 어느 하나에 PQC KEM 키 쌍을 주입하여 제2보안 도메인으로 동작할 수도 있다. 일 실시예에 따르면, 제2보안 도메인(또는 CASD)은 양자 컴퓨터에 의해 계산될 수 없는 PQC KEM(key encapsulation mechanism) 알고리즘에 사용되는 비대칭 키 쌍인 공개키 KEM.PK 및 비밀키 KEM.SK를 저장할 수 있다. PQC KEM 키 쌍은 전자 장치의 제조사와 같은 SE 오너에 의해 생성되어 전자 장치의 공정 단계에서 주입될 수 있다. 예를 들어, SE 오너는 전자 장치의 모델 별로 또는 SE 카드의 운영 체제 별로 복수의 전자 장치의 보 안 칩셋들에 대해 동일한 PQC KEM 키 쌍을 고정 키(static key)로써 주입할 수 있다. 일 실시예에 따르면, PQC KEM 비대칭 키 쌍은 전자 장치의 공정 단계에서 제2보안 도메인에 주입될 수 있으며, 또는 전자 장치가 사용자 에 의해 사용 중 OTA(over the air) 방식으로 전달 받아 제2보안 도메인에 주입될 수 있다. 일 실시예에 따르면, 외부 엔티티는 SE 오너(또는 SE 칩 벤더)에 요청하여 공개키 KEM.PK를 획득할 수 있다. SE 오너는 전자 장치의 모델 별 또는 SE 카드의 운영 체제 별로 고정키를 사용할 수 있으며, 외부 엔티티의 요청에 응답하여 전자 장치의 모델 또는 SE 카드의 운영 체제에 대응하는 공개키 KEM.PK를 보안 경로를 통해 외부 엔티 티에 제공할 수 있다. 일 실시예에 따르면, 동작 525에서, 외부 엔티티는 획득한 공개키 KEM.PK를 PQC KEM(key encapsulation mechanism) 알고리즘에 입력하여, 랜덤키 K 및 K를 캡슐화(encapsulation) 한 암호문 c1을 생성할 수 있다. 일 실시예에 따르면, 동작 530에서, 외부 엔티티는 레거시 암호 시스템의 ECDH(elliptic curve Diffie- Hellman) 알고리즘를 이용하여, 공개키 ePK 및 비밀키 eSK를 포함하는 임시 키 쌍을 생성할 수 있다. 여기서, ECDH 알고리즘은 타원 곡선 암호학(elliptic curve cryptography, ECC)에 기반하며, 안전한 통신을 위해 키를 교환하는 데 사용되는 키 교환 프로토콜일 수 있다. 예를 들어, ECDH 키 교환 프로토콜에 따르면 메시지의 송신 자와 수신자는 각각 자신의 개인키 및 공개키를 생성하고, 공개키를 서로 교환하고, 송신자는 자신의 개인키 및 수신자로부터 획득한 공개키를 통해 공유키를 계산하고, 수신자는 자신의 개인키 및 송신자로부터 획득한 공개 키를 통해 공유키를 계산할 수 있으며, 각각 공유키를 KDF(key derivation function)에 입력하여 서로 동일한 세션키를 생성할 수 있다. ECDH 알고리즘은 레거시 암호 시스템에 기반하기 때문에, 양자 컴퓨터를 이용해 해독 될 수 있다. 본 문서에서는 외부 엔티티가 ECDH 알고리즘을 이용해 임시 키 쌍 ePK 및 eSK를 생성하는 것으로 설명하나, 이에 한정되지 않으며, 다른 레거시 암호 시스템의 비대칭키 생성 방식을 사용할 수 있다. 일 실시예에 따르면, 동작 535에서, 외부 엔티티는 랜덤키 K로 임시 공개키 ePK를 암호화 하여, 암호문 c2를 생 성할 수 있다. 예를 들어, 외부 엔티티는, ePK를 암호화 하기 위해, AES(advanced encryption standard)와 같 은 대칭키 블록 암호 알고리즘을 이용할 수 있으며, 블록 암호 알고리즘의 운영을 위한 운영 모드(mode of operation)는 CBC(cipher block chaining), GCM(galois counter mode)과 같은 방법을 활용할 수 있다. ECDH 공 개키 ePK는 quantum safe 하지 않으나, ePK를 랜덤키 K를 통해 암호화 함에 따라, 양자 컴퓨터에 의한 공격에 의해서도 노출되지 않을 수 있다. 일 실시예에 따르면, 동작 540에서, 외부 엔티티는 암호문 c1 및 c2를 전자 서명 비밀 키 OCE.DS.SK로 서명하여, 전자 서명 OCE.sig을 생성할 수 있다. 전자 서명 비밀 키 OCE.DS.SK는 동작 510에서 스크립트의 생성 이전에 미리 저장된 키일 수 있다. 일 실시예에 따르면, 암호문 c1 및 c2는 quantum safe 한 PQC KEM 알고리즘 및 대칭 키 암호 알고리즘을 활용하 여 생성 되었으므로, 랜덤키 K와 ECDH 공개키 ePK는 양자 컴퓨터의 공격으로부터 안전하게 보호될 수 있다. 또 한, 외부 엔티티가 전자 서명 비밀 키 OCE.DS.SK를 이용해 quantum safe한 서명 알고리즘으로 서명했기 때문에, 스크립트를 수신하는 수신자(예: 전자 장치의 보안 칩셋)는 암호문 c1 및 c2가 비밀키 OCE.DS.SK를 보유한 주체 만이 생성한 것임을 신뢰할 수 있다. 일 실시예에 따르면, 동작 545에서, 외부 엔티티는 임시 비밀키 eSK 및 제1보안 도메인의 공개 키 SD.ECDH.PK를 이용하여, 레거시 암호 시스템의 ECDH를 통해 세션 키 s를 생성할 수 있다. 여기서, 외부 엔티티가 세선 키 s를생성하는 방식은 레거시 암호 시스템의 스크립트 방식에서 ECDH를 활용하여 세션 키를 생성하는 방식을 포함할 수 있다. 예를 들어, 외부 엔티티는 자신이 생성한 임시 비밀키 eSK와 제1보안 도메인이 생성한 공개키 SD.ECDH.PK를 ECDH 알고리즘에 입력하여 공유키를 생성하고, 공유키를 KDF에 입력하여 세션키 s를 생성할 수 있 다. 세션키 s는 전자 장치의 보안 칩셋(또는 제1보안 도메인)과 생성한 커맨드를 전송하기 위한 세션에서 메시 지의 암호화에 사용될 수 있으며, 새로운 커맨드를 전송하기 위해 새로운 세션을 형성하는 경우, 외부 엔티티는 동작 530 내지 동작 545 중 적어도 일부를 다시 수행하여 새로운 세션키를 생성할 수 있다. 일 실시예에 따르면, 외부의 공격자는 quantum safe한 방식으로 암호화되어 ECDH 공개키 ePK를 알아낼 수 없기 때문에, 세션 키 s를 계산해낼 수 없다. 일 실시예에 따르면, 동작 550에서, 외부 엔티티는 생성된 세션 키 s를 이용하여 커맨드를 암호화 하고, 및 전 자 서명을 생성할 수 있다. 여기서, 외부 엔티티가 커맨드를 암호화 하고, 전자 서명하는 방식은 레거시 암호 시스템의 스크립트 생성 방식(예: GP SCP11c(global platform secure channel protocol 11c), SEMS(secure element management system), LCCM(local card contents managemnet))을 활용할 수 있다. 일 실시예에 따르면, 세션키 s는 대칭키 암호화에 사용되므로, 암호화된 커맨드는 수신자(예: 전자 장치의 보안 칩셋)는 동일한 세션 키 s를 통해 커맨드를 복호화 할 수 있다. 일 실시예에 따르면, 동작 555에서, 외부 엔티티는 인증서 OCE.DS.CERT, 전자 서명 OCE.sig, 암호문 c1 및 c2, 및 암호화 된 커맨드를 포함하는 스크립트를 생성할 수 있다. 외부 엔티티는 스크립트의 수신자(예: 전자 장치 의 보안 칩셋)가 스크립트에 포함된 각 데이터를 파싱(parsing) 가능한 형태로 결합하여 스크립트를 생성할 수 있다. 일 실시예에 따르면, 동작 560에서, 외부 엔티티는 생성된 스크립트를 전자 장치로 전송할 수 있다. 예를 들어, 외부 엔티티는 무선 네트워크를 통한 OTA 방식으로 스크립트를 전자 장치로 전송할 수 있다. 도 6은 다양한 실시예에 따른 전자 장치가 스크립트를 처리하는 방법의 흐름도이다. 도 6에 도시된 방법은 전자 장치(예: 도 3의 전자 장치)에 의해 수행될 수 있다. 이하에서는 앞서 설명한 바 있 는 기술적 특징에 대해서는 그 설명을 생략할 수도 있다. 일 실시예에 따르면, 전자 장치는 보안 칩셋을 포함하며, 보안 칩셋은 복수의 도메인들을 포함할 수 있다. 일 실시예에 따르면, 복수의 보안 도메인들 중 제1보안 도메인은 외부 엔티티의 서비스와 관련된 데이터를 저장하 기 위해 할당된 보안 도메인일 수 있다. 또한, 제2보안 도메인은 보안 칩셋 내에서 다른 보안 도메인을 생성 및 관리하고, 키 관리를 담당하는 CASD(controlling authority security domain)일 수 있으며, CASD에 한정되지는 않는다. 일 실시예에 따르면, 제2보안 도메인은 PQC KEM 알고리즘의 비대칭키 쌍 KEM.PK 및 KEM.SK를 저장할 수 있다. 이하 실시예에서 각 동작들은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작들의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 일 실시예에 따르면, 동작 610에서, 전자 장치는 외부 엔티티로부터 제1보안 도메인으로 제공되는 스크립트를 수신할 수 있다. 예를 들어, 전자 장치는 무선 통신 회로(예: 도 3의 무선 통신 회로)을 이용해 무선 네트워크 를 통한 OTA 방식으로 외부 엔티티로부터 스크립트를 수신할 수 있다. 여기서, 외부 엔티티는 서비스 제공자(예: 교통카드 업체, ID 관리 서버), 또는 보안 칩셋의 오너(owner)(예: 전자 장치의 제조사)에서 운영하 는 서버 장치일 수 있다. 일 실시예에 따르면, 동작 615에서, 전자 장치는 수신된 스크립트로부터 외부 엔티티의 인증서 OCE.DS.CERT, 전 자 서명 OCE.sig, 암호문 c1 및 c2, 및 암호화 된 커맨드를 파싱(parsing)할 수 있다. 일 실시예에 따르면, 동작 620에서, 전자 장치는 OCE 인증서 발급자의 공개키와 PQC 전자 서명 검증 모듈을 활 용하여, 인증서 OCE.DS.CERT를 검증할 수 있다. 예를 들어, 전자 장치는 외부 엔티티가 보유한 전자서명 인증서 를 검증하기 위해, 외부 엔티티의 인증서를 발행하는 발급자(예: issuer 또는 CA)로부터 공개키를 미리 획득할 수 있다. 외부 엔티티는 PQC 전자 서명 알고리즘과 키를 이용해 전자 서명하였기 때문에, 인증서 OCE.DS.CERT는 양자 컴퓨터에 의해 공격받지 않음을 신뢰할 수 있다. 따라서 전자 장치는 인증서 OCE.DS.CERT의 검증에 성공하 는 경우, 수신한 스크립트가 해당 외부 엔티티에 의해 생성된 것임을 인증할 수 있다. 일 실시예에 따르면, 인 증서 OCE.DS.CERT는 전자 서명의 공개키를 포함할 수 있다. 일 실시예에 따르면, 동작 625에서, 전자 장치는 인증서 OCE.DS.CERT에서 추출한 공개키 및 PQC 전자 서명 검증 모듈을 이용하여, 전자 서명 OCE.sig를 검증할 수 있다. 검증에 성공하는 경우, 전자 장치는 동작 620에서 인증 된 주체인 외부 엔티티에 의해 서명된 것임을 신뢰할 수 있다. 일 실시예에 따르면, 동작 630에서, 전자 장치는 PQC KEM 모듈을 통해, 암호문 c1을 제2보안 도메인에 저장된 비밀키 KEM.SK를 이용하여 디-캡슐화(decapsulation)하여, 랜덤키 K를 획득할 수 있다. 일 실시예에 따르면, 제 1보안 도메인은 제2보안 도메인과 사이의 인터페이스(예: SIO(sharable interface object))의 API를 호출하여, 제2보안 도메인에 저장된 PQC KEM 키 쌍 중 비밀키 KEM.SK를 획득할 수 있다. 제2보안 도메인에 저장된 PQC KEM 키 쌍은 제조 공정 또는 OTA 방식으로 주입된 고정키 일 수 있다. 일 실시예에 따르면, 암호문 c1은 외부 엔티티에서 공개키 KEM.PK를 PQC KEM((key encapsulation mechanism)에 입력하여 생성한 랜덤키 K를 캡슐화 한 것일 수 있으며, 전자 장치의 보안 칩셋에 저장되는 PQC KEM 모듈은 외 부 엔티티와 동일한 PQC KEM 알고리즘에 의해 암호문 c1을 디-캡슐화 할 수 있다. 일 실시예에 따르면, 동작 635에서, 전자 장치는 랜덤키 K를 이용하여 암호문 c2를 복호화 하여, 외부 엔티티가 생성한 공개키 ePK를 획득할 수 있다. 외부 엔티티에서 생성한 임시 ECDH 키 쌍 중 공개키 ePK는 생성 후 랜덤 키 K를 암호화 한 후 전자 장치의 보안 칩셋 내에서 복호화 되기 때문에 quantum safe할 수 있다. 따라서, 공개 키 ePK는 외부로 노출되지 않으며, ECDH(또는 ECC) 키 쌍에 대한 양자 컴퓨터의 공격으로부터 안전할 수 있다. 일 실시예에 따르면, 동작 640에서, 전자 장치는 외부 엔티티의 공개키 ePK 및 제1보안 도메인의 개인키 SD.ECDH.SK를 이용하여, 레거시 암호 시스템의 ECDH를 통해 세션키 s를 생성할 수 있다. 외부 엔티티는 임시 비 밀키 eSK 및 제1보안 도메인의 공개 키 SD.ECDH.PK를 이용하여 세션키 s를 생성할 수 있으며, 스크립트에 포함 된 커맨드의 암호문은 외부 엔티티가 생성한 세션키 s에 의해 암호화될 수 있다. 전자 장치는 외부 엔티티와 동 일한 ECDH 알고리즘을 통해, 외부 엔티티의 공개키 ePK 및 제1보안 도메인의 개인키 SD.ECDH.SK을 이용하여 세 션키 s를 생성하였으므로, 전자 장치에서 생성한 세션키 s와 외부 엔티티에서 생성한 세션키 s는 서로 동일할 수 있다. 일 실시예에 따르면, 동작 645에서, 전자 장치는 생성된 세션키 s를 이용하여 암호화 된 커맨드를 복호화 할 수 있다. 커맨드는 세션키 s를 이용한 대칭키 방식으로 암호화 되었고, 전자 장치는 동작 640에서 외부 엔티티와 동일한 세션키 s를 생성했으므로, 생성한 세션키 s를 이용하는 경우 커맨드를 복호화할 수 있다. 일 실시예에 따르면, 전자 장치가 세션키를 생성하고 커맨드를 복호화하는 과정은 PQC 시스템을 사용하지 않고, 레거시 암호화 시스템의 방식을 사용할 수 있다. 따라서, 전자 장치는 세션키를 생성하고 커맨드를 복호화 하기 위해 quantum safe한 하드웨어 및/또는 소프트웨어를 포함하지 않는 레거시 암호 시스템의 구성만 포함하더라도, 양자 컴퓨터의 공격에 의해 스크립트가 노출되지 않는 quantum safe한 환경을 제공할 수 있다. 일 실시예에 따르면, 동작 650에서, 전자 장치는 제1보안 도메인에 대해 커맨드를 실행할 수 있다. 예를 들어, 전자 장치는 커맨드에서 설정된 애플릿을 설치 및 동작 하거나, 및/또는 커맨드에서 정해진 정책을 실행할 수 있다. 본 문서의 다양한 실시예에 따른 전자 장치는, 통신 회로, 보안 칩셋, 및 상기 통신 회로 및 상기 보안 칩셋과 작동적으로 연결되는 프로세서를 포함할 수 있다. 일 실시예에 따르면, 상기 보안 칩셋은, 제1보안 도메인(security domain) 및 제2보안 도메인을 포함하는 복수 의 보안 도메인들, 및 포스트 양자 암호 시스템에 기반한 전자 서명을 검증하기 위한 PQC 전자 서명 검증 모듈 을 포함할 수 있다. 일 실시예에 따르면, 상기 프로세서는, 상기 통신 회로를 통해 외부 엔티티로부터 상기 복수의 보안 도메인들 중 제1보안 도메인으로 전달되는 스크립트를 수신하고, 상기 스크립트를 파싱하여, 상기 외부 엔티티의 인증서 및 전자 서명을 획득하고, 상기 PQC 전자 서명 검증 모듈을 통해, 상기 제1보안 도메인에 미리 저장된 상기 외 부 엔티티의 인증서와 관련된 제1인증키를 이용하여 상기 획득한 외부 엔티티의 인증서를 검증하고, 상기 외부 엔티티의 인증서로부터 제2인증키를 추출하고, 및 상기 PQC 전자 서명 검증 모듈을 통해, 상기 제2인증키를 이 용하여 상기 전자 서명의 유효성을 확인하도록 설정될 수 있다. 일 실시예에 따르면, 상기 보안 칩셋은, 포스트 양자 암호 시스템에 기반한 KEM(key encapsulation mechanism) 알고리즘을 실행하는 PQC(post quantum cryptography) KEM 모듈을 더 포함할 수 있다. 일 실시예에 따르면, 상기 제2보안 도메인은 상기 KEM(key encapsulation mechanism) 알고리즘에 사용되는 KEM 공개 키 및 KEM 비밀 키를 저장할 수 있다. 일 실시예에 따르면, 상기 제1보안 도메인은 상기 KEM 알고리즘에 사용되는 키를 저장하지 않을 수 잇다. 일 실시예에 따르면, 상기 KEM 공개키 및 상기 KEM 비밀키는 전자 장치의 공정 단계에서 주입된 고정키 일 수 있다. 일 실시예에 따르면, 상기 스크립트는, 제1암호문을 더 포함하고, 상기 프로세서는, 상기 외부 엔티티의 전자 서명이 유효한 것으로 확인되는 경우, 상기 PQC KEM 모듈을 통해, 상기 KEM 비밀 키를 이용하여 상기 제1암호문 을 디-캡슐화 하여, 랜덤키를 획득하도록 설정될 수 있다. 일 실시예에 따르면, 상기 스크립트는 제2암호문 및 암호화 된 커맨드를 더 포함하고, 상기 프로세서는, 상기 획득한 랜덤키를 이용하여 상기 제2암호문을 복호화 하여, 상기 외부 엔티티의 ECDH(elliptic curve Diffie- Hellman) 공개키를 획득하고, 상기 획득한 외부 엔티티의 ECDH 공개키 및 상기 제1보안 도메인에 저장된 ECDH 개인키를 이용하여, ECDH 알고리즘을 통해 세션키를 생성하고, 및 상기 세션키를 이용하여 상기 암호화된 커맨 드를 복호화 하도록 설정될 수 있다. 일 실시예에 따르면, 상기 외부 엔티티의 ECDH 공개키를 획득하는 동작 및 상기 세션키를 생성하는 동작은 레거 시 암호 시스템의 알고리즘에 기초할 수 있다. 본 문서의 다양한 실시예에 따른 전자 장치의 보안 데이터 처리 방법은, 외부 엔티티로부터 상기 전자 장치의 보안 칩셋의 복수의 보안 도메인들 중 제1보안 도메인으로 전달되는 스크립트를 수신하는 동작, 상기 스크립트 를 파싱하여, 상기 외부 엔티티의 인증서 및 전자 서명을 획득하는 동작, PQC 전자 서명 검증 모듈을 통해, 상 기 제1보안 도메인에 미리 저장된 상기 외부 엔티티의 인증서와 관련된 제1인증키를 이용하여 상기 획득한 외부 엔티티의 인증서를 검증하는 동작, 상기 외부 엔티티의 인증서로부터 제2인증키를 추출하는 동작, 및 상기 PQC 전자 서명 검증 모듈을 통해, 상기 제2인증키를 이용하여 상기 전자 서명의 유효성을 확인하는 동작을 포함할 수 있다. 일 실시예에 따르면, 상기 보안 칩셋은, 포스트 양자 암호 시스템에 기반한 KEM(key encapsulation mechanism) 알고리즘을 실행하는 PQC(post quantum cryptography) KEM 모듈을 더 포함할 수 있다. 일 실시예에 따르면, 상기 제2보안 도메인은 상기 KEM(key encapsulation mechanism) 알고리즘에 사용되는 KEM 공개 키 및 KEM 비밀 키를 저장할 수 있다. 일 실시예에 따르면, 상기 제1보안 도메인은 상기 KEM 알고리즘에 사용되는 키를 저장하지 않을 수 있다. 일 실시예에 따르면, 상기 KEM 공개키 및 상기 KEM 비밀키는 전자 장치의 공정 단계에서 주입된 고정키 일 수 있다. 일 실시예에 따르면, 상기 스크립트는, 제1암호문을 더 포함하고, 상기 방법은, 상기 외부 엔티티의 전자 서명 이 유효한 것으로 확인되는 경우, 상기 PQC KEM 모듈을 통해, 상기 KEM 비밀 키를 이용하여 상기 제1암호문을 디-캡슐화 하여, 랜덤키를 획득하는 동작을 더 포함할 수 있다. 일 실시예에 따르면, 상기 스크립트는 제2암호문 및 암호화 된 커맨드를 더 포함하고, 상기 방법은, 상기 획득 한 랜덤키를 이용하여 상기 제2암호문을 복호화 하여, 상기 외부 엔티티의 ECDH(elliptic curve Diffie- Hellman) 공개키를 획득하는 동작, 상기 획득한 외부 엔티티의 ECDH 공개키 및 상기 제1보안 도메인에 저장된 ECDH 개인키를 이용하여, ECDH 알고리즘을 통해 세션키를 생성하는 동작, 및 상기 세션키를 이용하여 상기 암호 화된 커맨드를 복호화 하는 동작을 더 포함할 수 있다. 일 실시예에 따르면, 상기 외부 엔티티의 ECDH 공개키를 획득하는 동작 및 상기 세션키를 생성하는 동작은 레거 시 암호 시스템의 알고리즘에 기초할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다.도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제3구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체들을 포함할 수 있으며, 복수의 개체들 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요 소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2023-0159434", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 다양한 실시예에 따른 전자 장치 및 외부 서버들을 도시한 것이다. 도 3은 다양한 실시예에 따른 전자 장치의 블록도이다. 도 4는 다양한 실시예에 따른 전자 장치의 보안 칩셋의 블록도이다. 도 5는 다양한 실시예에 따른 외부 엔티티에서 스크립트를 생성하는 방법의 흐름도이다. 도 6은 다양한 실시예에 따른 전자 장치가 스크립트를 처리하는 방법의 흐름도이다."}
