{"patent_id": "10-2023-0135035", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0052018", "출원번호": "10-2023-0135035", "발명의 명칭": "대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치 및 그 방법", "출원인": "한국전력공사", "발명자": "황명하"}}
{"patent_id": "10-2023-0135035", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통신모듈; 메모리; 및 상기 통신모듈 및 상기 메모리와 작동적으로 연결(operatively coupled to)된 프로세서;를 포함하되, 상기 프로세서는 사용자 단말기로부터 입력되는 사용자의 음성 요구문에 대해 대형 언어 모델을 이용하여 텍스트로 변환한 후 설정된 RPA 기능별 트리거와 병합하여 RPA 챗봇으로 연계하면 상기 RPA 챗봇을 통해 상기 RPA기능별 트리거를 기반으로 요구문에 대한 응답을 수행하는 것을 특징으로 하는 대형 언어 모델 기반 음성 인식연계 로보틱 프로세스 자동화 장치."}
{"patent_id": "10-2023-0135035", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 음성 요구문은, 음성 질문과 음성 명령어 중 어느 하나 이상을 포함하는 것을 특징으로 하는 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치."}
{"patent_id": "10-2023-0135035", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 RPA 기능별 트리거는, RPA 장치가 적용되는 분야에 따라 상기 RPA 챗봇이 제공하는 기능을 세분화하여 설정하는 것을 특징으로 하는대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치."}
{"patent_id": "10-2023-0135035", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 상기 프로세서는, 선택된 상기 RPA 기능별 트리거를 설정하고, 사용자의 상기 음성 요구문을 상기 대형 언어 모델을 이용하여 텍스트로 변환하는 음성인식 수행모듈; 상기 RPA 챗봇을 통해 요구문에 대한 응답을 수행하는 로보틱 프로세스 자동화 수행모듈; 및 상기 음성인식 수행모듈에서 설정된 상기 RPA 기능별 트리거와 변환된 상기 텍스트를 병합하여 상기 로보틱 프로세스 자동화 수행모듈로 전송하는 텍스트-챗봇 연계모듈;을 포함하는 것을 특징으로 하는 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치."}
{"patent_id": "10-2023-0135035", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서, 상기 음성인식 수행모듈은, 상기 사용자 단말기로부터 키입력을 입력받아 선택된 상기 RPA 기능별 트리거를 설정하는 입력-트리거변환모듈; 및 상기 사용자 단말기로부터 입력된 음성 데이터에 대해 상기 텍스트로 변환한 후 상기 대형 언어 모델을 이용하여 인식된 상기 음성 요구문을 추출하는 음성-텍스트 변환모듈;을 포함하는 것을 특징으로 하는 대형 언어 모델기반 음성 인식 연계 로보틱 프로세스 자동화 장치. 공개특허 10-2025-0052018-3-청구항 6 프로세서가 사용자 단말기로부터 선택된 RPA 기능별 트리거를 설정하는 단계; 상기 프로세서가 상기 사용자 단말기로부터 입력된 음성 요구문에 대해 대형 언어 모델을 이용하여 텍스트로 변환하는 단계; 상기 프로세서가 설정된 상기 RPA 기능별 트리거와 변환된 상기 텍스트를 병합하여 RPA 챗봇으로 연계하는단계; 및 상기 프로세서가 상기 RPA 챗봇을 통해 연계된 상기 RPA 기능별 트리거를 기반으로 요구문에 대한 응답을 수행하는 단계;를 포함하는 것을 특징으로 하는 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 방법."}
{"patent_id": "10-2023-0135035", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서, 상기 음성 요구문은, 음성 질문과 음성 명령어 중 어느 하나 이상을 포함하는 것을 특징으로 하는 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 방법."}
{"patent_id": "10-2023-0135035", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서, 상기 RPA 기능별 트리거는, RPA 장치가 적용되는 분야에 따라 상기 RPA 챗봇이 제공하는 기능을 세분화하여 설정하는 것을 특징으로 하는대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 방법."}
{"patent_id": "10-2023-0135035", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6항에 있어서, 상기 RPA 기능별 트리거를 설정하는 단계는, 상기 프로세서가 상기 사용자 단말기로부터 키입력을 통해 선택된 상기 RPA 기능별 트리거를 설정하는 것을 특징으로 하는 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 방법."}
{"patent_id": "10-2023-0135035", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6항에 있어서, 상기 텍스트로 변환하는 단계는, 상기 프로세서가 상기 사용자 단말기로부터 입력된 음성 데이터에 대해 상기 대형 언어 모델을 이용하여 인식한후 상기 음성 요구문을 추출하여 상기 텍스트로 변환하는 것을 특징으로 하는 대형 언어 모델 기반 음성 인식연계 로보틱 프로세스 자동화 방법."}
{"patent_id": "10-2023-0135035", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치 및 그 방법이 개시된다. 본 발명의 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치는, 통신모듈; 메모리; 및 통신모듈 및 메모리 와 작동적으로 연결(operatively coupled to)된 프로세서;를 포함하되, 프로세서는 사용자 단말기로부터 입력되 는 사용자의 음성 요구문에 대해 대형 언어 모델을 이용하여 텍스트로 변환한 후 설정된 RPA 기능별 트리거와 병 합하여 RPA 챗봇으로 연계하면 RPA 챗봇을 통해 RPA 기능별 트리거를 기반으로 요구문에 대한 응답을 수행하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0135035", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치 및 그 방법에 관한 것으로서, 보 다 상세하게는 사용자의 질문 및 명령어 입력을 최소화할 수 있도록 음성 인식 시스템을 연계하고, RPA(Robotic Process Automation) 기능별 트리거를 사용자의 질문 및 명령어에 연동되도록 하여 RPA 챗봇을 수행할 수 있도 록 하는 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0135035", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 로보틱 프로세스 자동화(Robotic Process Automation; RPA)는 디지털 시스템에 대한 사람(사용자) 의 상호작용(interaction)을 소프트웨어 로봇(즉, RPA 로봇)에 손쉽게 에뮬레이션하고 통합하여 로봇을 통해 비 즈니스 업무를 실행할 수 있도록 해주는 역할을 하는 업무 자동화 기술이다. 여기서, RPA 로봇은 사람이 수행하는 것처럼 데이터를 캡처하고 애플리케이션을 조작하며, 정보를 해석하고 이 에 대한 대응을 트리거하며, 다른 시스템과 통신하면서 광범위한 반복적 작업을 수행하여 사람이 수행하는 일련 의 업무를 대신하여 수행할 수 있다. 가령, RPA 로봇은 애플리케이션에 로그인하고, 파일 및 폴더를 이동하며, 데이터를 복사 및 붙여 넣고, 양식을 작성하며, 문서에서 정형 및 반정형 데이터를 추출하고, 브라우저를 스크레이핑(scraping) 하는 등의 작업이 가 능하다. 이와 같이 RPA를 통해 모든 과제(또는 업무)를 처리할 경우, 조직의 작업 속도(workflow)가 혁신되고 효율화될 뿐만 아니라 특정 요구 사항에 맞춤화된 빠른 대응을 통해 확장성과 유연성을 배가할 수 있는 효과가 있기 때문 에 점차 RPA의 사용이 증가되고 있는 상황이다."}
{"patent_id": "10-2023-0135035", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 발명의 배경기술은 대한민국 등록특허공보 제10-2190459호(2020.12.11. 공고, RPA의 공유를 위한 사용자 인 터페이스 장치)에 개시되어 있다."}
{"patent_id": "10-2023-0135035", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이와 같은 로보틱 프로세스 자동화(RPA)는 기술 진보에 따라 여러 단계로 구분되는데, 단순 반복 업무를 자동화 하기 위한 간단한 툴인 'Desktop Automation' 개념을 RPA 1.0, 소프트웨어 로봇이 사람의 행동과 규칙 기반 작 업을 모방하고 업무를 수행하는 'Attended/Unattended RPA Automation' 개념을 RPA 2.0, 그리고 머신러닝 및 자연어 처리(Natural Language Processing) 알고리즘을 적용하여 인간의 두뇌를 모방한 지능형 소프트웨어 로봇 인 'Cognitive and AI Automation' 개념을 RPA 3.0으로 정의된다. 최근에는 ChatGPT와 같은 대형 언어 모델의 등장으로 인해 자연어 처리 기술을 접목한 딥러닝 챗봇 기반의 RPA 3.0 시대가 도래하고 있다. 딥러닝 챗봇을 이용한 RPA의 경우, 사람이 직접 챗봇에 질문 또는 명령을 입력하면 챗봇이 의도(Intent)를 분류 하고 해당 의도에 맞는 답변을 출력하거나 RPA 로봇을 실행한다. 그러나, 이러한 장치들은 챗봇을 직접적으로 사용 가능한 환경에서만 적용되는 단점이 있다. 전력, 의료, 자동 차 분야 등 다양한 산업분야에서는 현업 작업 시 챗봇을 사용하기 힘든 환경이 대다수이다. 따라서, 질문 및 명 령어 입력을 최소화할 수 있도록 음성 인식 시스템을 연계한 로보틱 프로세스 자동화 장치의 개발이 필요한 실 정이다. 스피치(Speech)란 사람 간의 가장 자연스럽고 효율적인 의사소통 방식이기 때문에 사람은 직접 기계에 키보드 등을 활용하여 입력하는 방식보다 스피치가 더욱 편하다고 생각하기 때문에 이를 가능하도록 하는 자동 음성 인 식(Automatic Speech Recognition ; ASR) 시스템을 개발하였다. 따라서 사람들은 이러한 ASR 시스템을 이용하여 마이크를 통해 음성을 입력하고, 텍스트로 자동 변환된 명령어 를 통해 원하는 업무를 수행할 수 있게 되었다. 최근에는 Multilayer perceptrons(MLP), Recurrent Neural Network(RNN), Convolutional Neural Network(CNN), Transformer와 같이 인공지능의 폭발적인 성장으로 이러한 인공지능 기술을 활용한 ASR 시스템이 개발되고 있다. 특히, 트랜스포머(Transformer) 기술은 기존의 MLP, RNN, CNN의 단점을 보완하는 어텐션 메커니즘(Attention Mechanism)을 적용하였으며, ChatGPT와 같은 대형 언어 모델(Large Language Model) 개발에 일조 하였다. 위스퍼(Whisper)는 Large-scale weak supervision 기술을 적용한 강건한 음성 인식 모델로써, Transformer을 적용한 대형 언어 모델 기반의 시퀀스 투 시퀀스(Sequence To Sequence) 모델이다. 이러한 위스퍼(Whisper)는 최신 대형 언어 모델로써, 웹으로부터 수집한 60만 시간 이상의 다국어 및 다중 업무 지도 데이터(Multilingual and multitask supervised data)를 학습하였기 때문에 기존 모델들에 비해 높은 성 능을 보이고 있다. 그러나, 이러한 최신 대형 언어 모델은 각 기업에서 사용하는 챗봇에 대한 트리거(Trigger)를 학습하지 않았기 때문에 트리거 인식률이 낮을 수밖에 없는 문제점이 있다. 이와 같이 인공지능 기술을 적용한 RPA 챗봇의 경우, 사람이 직접 챗봇에 질문 또는 명령을 입력하면 챗봇이 의 도를 분류하고 해당 의도에 맞는 답변을 출력하거나 RPA 로봇을 실행한다. 그러나, 실제 산업 분야에서는 현업 작업 시 챗봇을 활용한 채팅 입력 환경이 힘든 경우가 많아 환경에 따라 챗 봇을 직접적으로 사용할 수 없는 문제점이 있고, ChatGPT와 같은 대형 언어 모델은 각 기업에서 사용하는 챗봇 에 대한 트리거를 학습하지 않았기 때문에 인식률이 낮은 문제점이 있다. 본 발명은 상기와 같은 문제점들을 개선하기 위하여 안출된 것으로, 일 측면에 따른 본 발명의 목적은 사용자의 질문 및 명령어 입력을 최소화할 수 있도록 음성 인식 시스템을 연계하고, RPA(Robotic Process Automation) 기 능별 트리거를 사용자의 질문 및 명령어에 연동되도록 하여 RPA 챗봇을 수행할 수 있도록 하는 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치 및 그 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0135035", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치는, 통신모듈; 메 모리; 및 통신모듈 및 메모리와 작동적으로 연결(operatively coupled to)된 프로세서;를 포함하되, 프로세서는 사용자 단말기로부터 입력되는 사용자의 음성 요구문에 대해 대형 언어 모델을 이용하여 텍스트로 변환한 후 설 정된 RPA 기능별 트리거와 병합하여 RPA 챗봇으로 연계하면 RPA 챗봇을 통해 RPA 기능별 트리거를 기반으로 요 구문에 대한 응답을 수행하는 것을 특징으로 한다. 본 발명에서 음성 요구문은, 음성 질문과 음성 명령어 중 어느 하나 이상을 포함하는 것을 특징으로 한다. 본 발명에서 RPA 기능별 트리거는, RPA 장치가 적용되는 분야에 따라 RPA 챗봇이 제공하는 기능을 세분화하여 설정하는 것을 특징으로 한다. 본 발명에서 프로세서는, 선택된 RPA 기능별 트리거를 설정하고, 사용자의 음성 요구문을 대형 언어 모델을 이 용하여 텍스트로 변환하는 음성인식 수행모듈; RPA 챗봇을 통해 요구문에 대한 응답을 수행하는 로보틱 프로세 스 자동화 수행모듈; 및 음성인식 수행모듈에서 설정된 RPA 기능별 트리거와 변환된 텍스트를 병합하여 로보틱 프로세스 자동화 수행모듈로 전송하는 텍스트-챗봇 연계모듈;을 포함하는 것을 특징으로 한다. 본 발명에서 음성인식 수행모듈은, 사용자 단말기로부터 키입력을 입력받아 선택된 RPA 기능별 트리거를 설정하 는 입력-트리거 변환모듈; 및 사용자 단말기로부터 입력된 음성 데이터에 대해 텍스트로 변환한 후 대형 언어 모델을 이용하여 인식된 음성 요구문을 추출하는 음성-텍스트 변환모듈;을 포함하는 것을 특징으로 한다. 본 발명의 다른 측면에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 방법은, 프로세서가 사용자 단말기로부터 선택된 RPA 기능별 트리거를 설정하는 단계; 프로세서가 사용자 단말기로부터 입력된 음성 요구문에 대해 대형 언어 모델을 이용하여 텍스트로 변환하는 단계; 프로세서가 설정된 RPA 기능별 트리거와 변 환된 텍스트를 병합하여 RPA 챗봇으로 연계하는 단계; 및 프로세서가 RPA 챗봇을 통해 연계된 RPA 기능별 트리 거를 기반으로 요구문에 대한 응답을 수행하는 단계;를 포함하는 것을 특징으로 한다. 본 발명에서 음성 요구문은, 음성 질문과 음성 명령어 중 어느 하나 이상을 포함하는 것을 특징으로 한다. 본 발명에서 RPA 기능별 트리거는, RPA 장치가 적용되는 분야에 따라 RPA 챗봇이 제공하는 기능을 세분화하여 설정하는 것을 특징으로 한다. 본 발명에서 RPA 기능별 트리거를 설정하는 단계는, 프로세서가 사용자 단말기로부터 키입력을 통해 선택된 RPA 기능별 트리거를 설정하는 것을 특징으로 한다. 본 발명에서 텍스트로 변환하는 단계는, 프로세서가 사용자 단말기로부터 입력된 음성 데이터에 대해 대형 언어 모델을 이용하여 인식한 후 음성 요구문을 추출하여 텍스트로 변환하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0135035", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 측면에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치 및 그 방법은 사 용자의 질문 및 명령어 입력을 최소화할 수 있도록 음성 인식 시스템을 연계하고, RPA(Robotic Process Automation) 기능별 트리거를 사용자의 질문 및 명령어에 연동되도록 함으로써, 대형 언어 모델을 기반으로 음 성을 인식하여 RPA 챗봇을 수행할 때 응답 성능을 향상시킬 수 있을 뿐만 아니라 고객 만족도를 향상시킬 수 있 다."}
{"patent_id": "10-2023-0135035", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치 및 그 방법을 설명한다. 이 과정에서 도면에 도시된 선들의 두께나 구성요소의 크기 등은 설명의 명료성과 편의상 과장되게 도시되어 있을 수 있다. 또한, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어 들로서 이는 사용자, 운용자의 의도 또는 관례에 따라 달라질 수 있다. 그러므로 이러한 용어들에 대한 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1은 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치를 나타 낸 블록 구성도이고, 도 2는 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치에서 프로세서의 내부 구성을 나타낸 블록도이며, 도 3은 본 발명의 일 실시예에 따른 대형 언어 모 델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치에서 RPA 기능별 트리거를 나타낸 예시이고, 도 4는 본 발 명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치에서 RPA 챗봇 기능의 서비스 목록을 나타낸 예시이며, 도 5는 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보 틱 프로세스 자동화 장치에서 챗봇 기능을 나타낸 예시 화면이다. 도 1에 도시된 바와 같이 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자 동화 장치는, 통신모듈, 메모리 및 프로세서를 포함할 수 있다. 통신모듈은 네트워크를 통해 사용자 단말기와 RPA 장치가 서로 통신하기 위한 구성 또는 기 능을 제공할 수 있으며, 사용자 단말기로부터 입력되는 키입력이나 사용자의 음성 데이터를 수신 받을 수 있고, 응답 결과를 사용자 단말기로 전달할 수 있다. 메모리는 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치의 동작과 관련한 실행 프로그램을 저장할 수 있으며, 저장되는 정보들은 필요에 따라 프로세서에 의해 취사선택될 수 있다. 즉, 메모리에는 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치의 구동을 위한 운 영 체제(O/S; Operating System)나 어플리케이션(프로그램 또는 애플릿)의 실행과정에서 발생되는 여러 종류의 데이터 및 명령어가 저장된다. 이때, 메모리는 비휘발성 메모리, 휘발성 메모리, 플래시메모리(flash- memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD) 등으로 구현될 수 있다, 또한, 메모리 는 액세스 되며, 프로세서에 의한 데이터의 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 프로세서는 통신모듈 및 메모리와 작동적으로 연결(operatively coupled to)되어 대형 언어 모 델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치의 전반적인 동작을 제어하기 위해 메모리에 저 장된 각종 프로그램을 램에 복사하고, 실행시켜 각종 동작을 수행할 수 있다. 여기서, 프로세서가 하나의 CPU만을 포함하는 것으로 설명하였지만, 구현 시에는 복수의 CPU(또는 DSP, SoC 등)으로 구현될 수 있다. 다양한 실시예로, 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케 이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 즉, 프로세서는 사용자 단말기로부터 입력되는 사용자의 음성 요구문에 대해 대형 언어 모델을 이 용하여 텍스트로 변환한 후 설정된 RPA 기능별 트리거와 병합하여 RPA 챗봇으로 연계하면 RPA 챗봇을 통해 RPA 기능별 트리거를 기반으로 요구문에 대한 응답을 수행할 수 있다. 여기서 음성 요구문은 음성 질문 및 음성 명령어 중 어느 하나 이상을 포함할 수 있다. 보다 구체적으로 도 2에 도시된 바와 같이 프로세서는 음성인식 수행모듈, 로보틱 프로세스 자동화 수행모듈 및 텍스트-챗봇 연계모듈을 포함할 수 있다. 음성인식 수행모듈은 선택된 RPA 기능별 트리거를 설정하고, 사용자의 음성 요구문을 대형 언어 모델 을 이용하여 텍스트로 변환할 수 있다. 여기서, 음성인식 수행모듈은 사용자 단말기로부터 키입력을 입력받아 선택된 RPA 기능별 트리거로 변 환하는 입력-트리거 변환모듈(132-1) 및 사용자 단말기로부터 입력된 음성 데이터에 대해 대형 언어 모델 을 이용하여 인식한 후 음성 요구문을 추출하여 텍스트로 변환하는 음성-텍스트 변환모듈(132-2)을 포함할 수 있다. 즉, 도 3에 도시된 바와 같이 RPA 기능별 트리거는 RPA 장치가 적용되는 분야에 따라 RPA 챗봇이 제공할 수 있는 기능을 세분화하여 설정할 수 있다. 예를 들어, RPA 장치가 기업에 적용되는 경우, RPA 기능 목록을 다음과 같이 세분화하여 설정할 수 있다. 일상대화 및 업무지원 대화 기능을 제공하는 [Chatbot] 기능, 회사 식당의 점심 및 저녁메뉴를 확인할 수 있는 [Menu] 기능, 회의를 위한 미팅룸을 예약할 수 있는 [Meeting Room Reservation] 기능, 부서 의 예산을 확인할 수 있는 [Department Budget] 기능, 연구 프로젝트의 예산을 확인할 수 있는 [Research Project - Budget] 기능, 연구 프로젝트의 참여율을 확인할 수 있는 [Research Project ?? Participation Rate] 기능, 연구 프로젝트의 비용을 계산할 수 있는 [Research Project ?? Cost Calculation] 기능, 개인별 일정을 예약할 수 있는 [Schedule Reservation] 기능, 직원들의 업무를 확인할 수 있는 [Work Division] 기능으로 설정할 수 있다. 로보틱 프로세스 자동화 수행모듈은 RPA 챗봇을 통해 요구문에 대한 응답을 수행할 수 있다. 즉, 요구문에 따른 자용자의 질문에 응답하거나 명령어에 맞는 RPA 로봇을 수행할 수 있다. 텍스트-챗봇 연계모듈은 음성인식 수행모듈에서 설정된 RPA 기능별 트리거와 변환된 텍스트를 병합하 여 로보틱 프로세스 자동화 수행모듈로 전송하여 연계되도록 할 수 있다. 이와 같이 구성된 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치의 구동을 구체적으로 설명하면 다음과 같다. 먼저, 프로세서는 사용자 단말기로부터 RPA 기능별 트리거를 선택하기 위한 키입력이 되면 입력-트리 거 변환모듈(132-1)을 통해 RPA 챗봇이 제공하는 여러 기능 중에 특정 기능을 활성화하기 위한 RPA 기능별 트리 거(Trigger(Tr))를 설정할 수 있다. 이때 PRA 기능별 트리거(Trigger(Tr))는 도 3과 같이 설정된 9개의 RPA 기능별 트리거 중 하나의 번호를 선택하 여 설정할 수 있다. 이와 같이 프로세서는 사용자 단말기로부터 RPA 기능별 트리거의 선택 번호가 입력될 경우, 선택된 번 호에 해당하는 RPA 기능을 실행하기 위한 트리거(Tr)가 설정되어 텍스트-챗봇 연계모듈로 전달한다. 또한, 프로세서는 음성-텍스트 변환모듈(132-2)을 통해 사용자 단말기로부터 입력되는 음성 데이터를 녹음 하여 wav 파일 형태로 저장한 후 STT_Model을 활용하여 저장된 Wav 파일을 불러들여 음성 데이터를 텍스트로 변 환한 후 대형 언어 모델을 이용하여 인식된 음성 요구문에 따른 사용자의 질문(question) 또는 명령 (command) 텍스트(UT)를 추출할 수 있다. 이와 같이 음성인식 수행모듈에서 출력된 트리거 토큰(Tr)과 텍스트(UT)는 텍스트-챗봇 연계모듈에서 입력받아 병합하여 TrUT를 생성한 후 로보틱 프로세스 자동화 수행모듈의 RPA 챗봇으로 송신할 수 있다. 로보틱 프로세스 자동화 수행모듈은 RPA 챗봇을 통해 사용자의 질문에 대해 응답하거나, 명령에 대해 알맞 은 RPA 챗봇을 시행할 수 있다. 이때 RPA 챗봇의 프론트엔드는 Mattermost를 활용할 수 있으며, 질의응답 및 RPA 명령을 시행하기 위한 백엔드 는 RASA 프레임워크를 적용할 수 있고, RPA 챗봇 기능의 서비스 목록은 일상대화 및 업무지원 대화로 구성할 수 있다. 여기서 RPA 챗봇 기능의 서비스 목록은 도 4에 도시된 바와 같이 일상대화의 경우는 감정표현 및 기본 인사 등 의 일반적인 대화이며, 총 12가지 서비스를 포함하는 다수의 의도(Intent)로 구축할 수 있다. 또한, 업무지원 대화의 경우는 기업에서 주로 활용하는 총 35가지의 서비스를 포함하는 다수의 의도(Intent)로 구축할 수 있다. 따라서 각각의 업무 처리를 위해 사용자가 기능을 시행하면 해당 RPA 로봇을 실행하여 질의응답 및 RPA 명령을 시행할 수 있다. 도 5에 도시된 바와 같이 '캡봇'이라는 단어는 본 실시예에서 [챗봇] 기능을 가리키는 트리거(Tr)이며, '출장신 청 상세화면 알려줘'는 RPA 챗봇에게 송신하는 요구문으로 사용자의 질문 또는 명령어(UT)이다. 즉, RPA 챗봇의 입력창에 입력되는 텍스트는 기능별 트리거(Tr)와 텍스트(UT)를 병합한 TrUT이다. 따라서 로보틱 프로세스 자동화 수행모듈에 TrUT가 전달되면, RPA 챗봇은 각 질문에 대한 알맞은 의도를 분류하게 되고, 분류된 의도에 대한 답변을 출력한다. 즉, [출장신청 상세화면] 안내 방법을 설명하기 위하여 1. 출장구분(근거리, 국내, 여비불지급, 전근여비, 외부 강의 등), 출장용무, 출장지 등의 필요 정보를 입력할 수 있도록 안내하는 화면과, 2. 지불 제외 항목, 출장자 내역, 출장 일정 내역 등의 정보를 입력할 수 있도록 안내하는 화면을 출력할 수 있다. 상술한 바와 같이, 본 발명의 실시예에 의한 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치 에 따르면, 사용자의 질문 및 명령어 입력을 최소화할 수 있도록 음성 인식 시스템을 연계하고, RPA(Robotic Process Automation) 기능별 트리거를 사용자의 질문 및 명령어에 연동되도록 함으로써, 대형 언어 모델을 기반 으로 음성을 인식하여 RPA 챗봇을 수행할 때 응답 성능을 향상시킬 수 있을 뿐만 아니라 고객 만족도를 향상시 킬 수 있다. 도 6은 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 방법을 설명 하기 위한 흐름도이다. 도 6에 도시된 바와 같이 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자 동화 방법에서는, 먼저 프로세서가 사용자 단말기로부터 선택된 RPA 기능별 트리거를 설정한다(S10). 즉, 프로세서는 사용자 단말기로부터 키입력을 입력받아 RPA 챗봇이 제공하는 여러 기능 중에 특정 기 능을 활성화하기 위한 RPA 기능별 트리거(Trigger(Tr))를 설정할 수 있다. 이때 PRA 기능별 트리거(Trigger(Tr))는 도 3과 같이 RPA 장치가 적용되는 분야에 따라 RPA 챗봇이 제공하는 기 능을 세분화하여 설정된 9개의 RPA 기능별 트리거 중 하나의 번호를 키입력을 통해 선택하여 설정할 수 있다. S10 단계에서 RPA 기능별 트리거를 설정한 후 프로세서가 사용자 단말기로부터 입력된 음성 요구문에 대해 대형 언어 모델을 이용하여 텍스트로 변환한다(S20). 이때 프로세서가 녹음을 위한 안내 문구를 출력하고 'Enter' 키가 입력되면 확인하는 문구와 마이크로폰을 설정한 문구를 출력한 후 사용자 단말기로부터 입력되는 음성 데이터를 설정 시간동안 녹음하여 wav 파일 형태로 저장한 후 STT_Model을 활용하여 저장된 Wav 파일을 불러들여 음성 데이터를 텍스트로 변환한 후 대형 언어 모델을 이용하여 인식된 음성 요구문에 따른 사용자의 질문(question) 또는 명령(command) 텍스트(U T)를 추출할 수 있다. 여기서 음성 요구문은 음성 질문과 음성 명령어 중 어느 하나 이상을 포함할 수 있다. S20 단계에서 음성 요구문을 텍스트로 변환한 후 프로세서는 설정된 RPA 기능별 트리거(Tr)와 변환된 텍스 트(UT)를 병합하여 RPA 챗봇으로 연계한다(S30). S30 단계에서 RPA 기능별 트리거 토큰과 사용자의 질문 또는 명령어 텍스트(UT)를 병합하여 연계된 텍스트를 입 력받은 프로세서는 RPA 챗봇에 입력하여 RPA 챗벗을 통해 RPA 기능별 트리거를 기반으로 요구문에 대한 응 답을 수행한다(S40). 상술한 바와 같이, 본 발명의 실시예에 의한 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 방법 에 따르면, 사용자의 질문 및 명령어 입력을 최소화할 수 있도록 음성 인식 시스템을 연계하고, RPA(Robotic Process Automation) 기능별 트리거를 사용자의 질문 및 명령어에 연동되도록 함으로써, 대형 언어 모델을 기반 으로 음성을 인식하여 RPA 챗봇을 수행할 때 응답 성능을 향상시킬 수 있을 뿐만 아니라 고객 만족도를 향상시 킬 수 있다. 본 명세서에서 설명된 구현은, 예컨대, 방법 또는 프로세스, 장치, 소프트웨어 프로그램, 데이터 스트림 또는 신호로 구현될 수 있다. 단일 형태의 구현의 맥락에서만 논의(예컨대, 방법으로서만 논의)되었더라도, 논의된 특징의 구현은 또한 다른 형태(예컨대, 장치 또는 프로그램)로도 구현될 수 있다. 장치는 적절한 하드웨어, 소 프트웨어 및 펌웨어 등으로 구현될 수 있다. 방법은, 예컨대, 컴퓨터, 마이크로프로세서, 집적 회로 또는 프로 그래밍 가능한 로직 디바이스 등을 포함하는 프로세싱 디바이스를 일반적으로 지칭하는 프로세서 등과 같은 장 치에서 구현될 수 있다. 프로세서는 또한 최종-사용자 사이에 정보의 통신을 용이하게 하는 컴퓨터, 셀 폰, 휴 대용/개인용 정보 단말기(personal digital assistant: \"PDA\") 및 다른 디바이스 등과 같은 통신 디바이스를 포함한다. 본 발명은 도면에 도시된 실시예를 참고로 하여 설명되었으나, 이는 예시적인 것에 불과하며, 당해 기술이 속하 는 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호범위는 아래의 청구범위에 의해서 정하여져야 할 것이다."}
{"patent_id": "10-2023-0135035", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치를 나타 낸 블록 구성도이다. 도 2는 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치에서 프 로세서의 내부 구성을 나타낸 블록도이다. 도 3은 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치에서 RPA 기능별 트리거를 나타낸 예시이다. 도 4는 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치에서 RPA 챗봇 기능의 서비스 목록을 나타낸 예시이다. 도 5는 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 장치에서 챗 봇 기능을 나타낸 예시 화면이다. 도 6은 본 발명의 일 실시예에 따른 대형 언어 모델 기반 음성 인식 연계 로보틱 프로세스 자동화 방법을 설명 하기 위한 흐름도이다."}
