{"patent_id": "10-2023-0010671", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0136516", "출원번호": "10-2023-0010671", "발명의 명칭": "디지털 바이오 마커에 기초하여 인지 강화 훈련을 제공하는 기법", "출원인": "주식회사 하이", "발명자": "황혜빈"}}
{"patent_id": "10-2023-0010671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "장치의 적어도 하나의 프로세서가 디지털 바이오 마커에 기초하여 인지 강화 훈련을 제공하는 방법에 있어서,상기 방법은:사용자 단말기에 설치된 제1 애플리케이션을 이용하여 획득된 제1 디지털 바이오 마커 데이터를 상기 사용자 단말기로부터 수신하는 단계;상기 제1 디지털 바이오 마커 데이터에 기초하여 상기 사용자 단말기의 사용자의 인지 기능 상태를 결정하는 단계; 및상기 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠가 상기 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 몇몇 실시예에 의하면 장치의 적어도 하나의 프로세서가 디지털 바이오 마커에 기초하여 인지 강화 훈 련을 제공하는 방법이 개시된다. 상기 방법은: 사용자 단말기에 설치된 제1 애플리케이션을 이용하여 획득된 제1 디지털 바이오 마커 데이터를 상기 사용자 단말기로부터 수신하는 단계; 상기 제1 디지털 바이오 마커 데이터에 기초하여 상기 사용자 단말기의 사용자의 인지 기능 상태를 결정하는 단계; 및 상기 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠가 상기 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기하는 단계;를 포함할 수 있다."}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 디지털 바이오 마커에 기초하여 인지 강화 훈련을 제공하는 기법에 관한 것으로, 구체적으로 사용자 단말기에 설치된 애플리케이션을 이용하여 획득된 디지털 바이오 마커 데이터에 기초하여 사용자의 인지 기능 상태를 결정하고, 사용자의 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠를 사용자 단말기에 설치된 다른 애플리케이션을 통해 제공하는 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "알츠하이머 질환(Alzheimer's Disease, AD)은 노화에 따라 수반되는 뇌 질환으로서, 점진적인 기억력 장애, 인 지력 결손, 개인 성격의 변화 등을 초래하는 질병이다. 그리고, 치매(dementia)는 정상적으로 생활해오던 사람 이 다양한 원인에 인해 뇌기능이 손상되면서 발생하는, 지속적이고 전반적인 인지 기능의 저하 상태를 의미한다. 여기서 인지 기능이란 기억력, 언어 능력, 시공간 파악 능력, 판단력 및 추상적 사고력 등 다양한 지 적 능력을 가리키는 것으로서, 각 인지 기능은 뇌의 특정 부위와 밀접한 관련이 있다. 치매의 가장 흔한 형태가 알츠하이머 질환이다. 알츠하이머 질환, 치매 또는 경도 인지 장애를 진단하기 위한 다양한 방법들이 제시되고 있다. 예컨대, 후각 조 직의 miR-206의 발현 수준을 이용하여 알츠하이머 질환 또는 경도 인지 장애를 진단하는 방법, 혈액 내에서 특 징적으로 증가하는 바이오 마커를 이용하여 치매를 진단하는 방법 등이 알려져 있다. 그러나, 후각 조직의 miR-206을 이용하기 위해서는 조직 검사에 필요한 특수 장비 또는 검사가 필요하고, 혈액 내의 바이오 마커를 이용하기 위해서는 침습적인 방법으로 환자의 혈액을 채취해야 하므로, 환자의 거부감이 상 대적으로 크다는 단점이 각각 존재한다. 한편, 치매가 발병하기 전에 이를 예방하는 것이 무척 중요하다. 치매를 예방하기 위해서는 현재 치매의 이전 단계인 경도 인지 장애 단계나 정상 단계에서부터 인지 강화 훈련을 수행하고 규칙적인 운동과 채소, 견과류 및 어류 위주의 식단 관리를 하는 것이 좋다. 따라서, 사용자에게 인지 강화 훈련과 관련된 습관이 형성될 수 있도 록 도움을 주는 장치에 대한 개발이 필요한 실정이다. 즉, 별도의 특수 장비 또는 검사 없이, 환자가 거부감을 거의 느끼지 않는 방법으로 인지 능력 저하를 진단하고 사용자의 인지 기능 상태에 따라 인지 능력을 강화하는 훈련을 제공하는 방법을 개발할 필요성이 절실한 실정이 다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허출원번호 10-2019-0135908 (2019.02.01 출원)"}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 전술한 문제 및 다른 문제를 해결하는 것을 목적으로 한다. 본 개시의 몇몇 실시예가 이루고자 하는 기술적 과제는, 사용자의 인지 기능 상태에 따라 사용자의 인지 예비능이 향상될 수 있도록 하는 것을 그 목적 으로 한다. 본 개시에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 개시의 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해 될 수 있을 것이다."}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 몇몇 실시예에 의한 장치의 적어도 하나의 프로세서가 디지털 바이오 마커에 기초하여 인지 강화 훈 련을 제공하는 방법 방법은: 사용자 단말기에 설치된 제1 애플리케이션을 이용하여 획득된 제1 디지털 바이오 마커 데이터를 상기 사용자 단말기로부터 수신하는 단계; 상기 제1 디지털 바이오 마커 데이터에 기초하여 상기 사용자 단말기의 사용자의 인지 기능 상태를 결정하는 단계; 및 상기 인지 기능 상태에 대응하는 인지 강화 훈 련 콘텐츠가 상기 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기하는 단계;를 포함할 수 있 다. 본 개시의 몇몇 실시예에 따르면 상기 제1 디지털 바이오 마커 데이터는, 상기 제1 애플리케이션을 이용하여 실 행된 복수의 테스트에 대한 정답률에 대한 정보, 상기 복수의 테스트 중 적어도 하나에 기초하여 획득된 시선 정보, 상기 복수의 테스트 중 적어도 하나에 기초하여 획득된 음성 관련 정보 및 상기 복수의 테스트 각각에 대 한 응답 시간에 대한 정보를 포함할 수 있다. 본 개시의 몇몇 실시예에 따르면, 상기 제1 디지털 바이오 마커 데이터에 기초하여 상기 사용자의 인지 기능 상 태를 결정하는 단계는, 상기 제1 디지털 바이오 마커 데이터를 기 학습된 인지 기능 상태 인식 모델에 입력하는 단계; 및 상기 인지 기능 상태 인식 모델의 출력 데이터에 기초하여 상기 인지 기능 상태를 결정하는 단계;를 포함할 수 있다. 본 개시의 몇몇 실시예에 따르면, 상기 인지 강화 훈련 콘텐츠는, 저장부에 저장된 복수의 인지 강화 훈련 콘텐 츠 중 상기 인지 기능 상태에 대응하는 콘텐츠일 수 있다. 본 개시의 몇몇 실시예에 따르면, 상기 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠가 상기 사용자 단말 기에 설치된 제2 애플리케이션을 통해 제공되도록 야기하는 단계는, 상기 인지 기능 상태에 기초하여 복수의 인 지 영역 중 상기 사용자에게 부족한 적어도 하나의 인지 영역을 결정하는 단계; 및 저장부에 저장된 복수의 인 지 강화 훈련 콘텐츠 중 상기 적어도 하나의 인지 영역을 향상시키는 콘텐츠를 상기 인지 강화 훈련 콘텐츠로 결정하는 단계;를 포함할 수 있다. 본 개시의 몇몇 실시예에 따르면, 기 설정된 시간 간격마다 이전에 제공된 인지 강화 훈련 콘텐츠와 난이도, 콘 텐츠의 종류 및 콘텐츠 수 중 적어도 하나가 상이한 인지 강화 훈련 콘텐츠가 상기 제2 애플리케이션을 통해 제 공되도록 야기하는 단계;를 더 포함할 수 있다. 본 개시의 몇몇 실시예에 따르면, 상기 제1 디지털 바이오 마커 데이터를 이용하여 상기 제1 디지털 바이오 마 커 데이터를 수신한 제1 시점의 상기 사용자의 제1 뇌 나이를 산출하는 단계; 상기 제1 시점으로부터 기 설정된 기간이 경과된 제2 시점까지 제1 애플리케이션 및 제2 애플리케이션을 통해 확보한 제2 디지털 바이오 마커 데 이터를 이용하여 제2 뇌 나이를 산출하는 단계; 및 상기 제1 뇌 나이 및 상기 제2 뇌 나이에 기초하여 산출된 뇌 나이 변동 정보가 상기 사용자 단말기에 설치된 상기 제2 애플리케이션을 통해 출력되도록 야기하는 단계;를더 포함할 수 있다. 본 개시의 몇몇 실시예에 따르면, 상기 제2 디지털 바이오 마커 데이터는: 상기 장치가 상기 제1 시점부터 상기 기 설정된 기간 동안 기 설정된 개수의 인지 강화 훈련 콘텐츠가 상기 제2 애플리케이션을 통해 제공되도록 야 기한 후 상기 사용자 단말기로부터 수신한 훈련 결과 데이터; 상기 장치가 상기 기 설정된 기간 동안 상기 사용 자 단말기로부터 수신한 습관 수행 데이터; 및 상기 장치가 상기 제2 시점에 상기 제1 애플리케이션을 이용하여 복수의 테스트가 실행되도록 야기한 후 상기 사용자 단말기로부터 수신한 테스트 결과 데이터;를 포함할 수 있 다. 본 개시의 몇몇 실시예에 따르면, 상기 테스트 결과 데이터는, 상기 제2 시점에 상기 제1 애플리케이션을 이용 하여 실행된 상기 복수의 테스트에 대한 정답률에 대한 정보, 상기 복수의 테스트 중 적어도 하나에 기초하여 획득된 사용자의 시선 정보, 상기 복수의 테스트 중 적어도 하나에 기초하여 획득된 음성 관련 정보 및 상기 복 수의 테스트 각각에 대한 응답 시간에 대한 정보를 포함할 수 있다. 본 개시의 몇몇 실시예에 따르면, 상기 훈련 결과 데이터는, 상기 기 설정된 개수의 인지 강화 훈련 콘텐츠에 대한 정답률에 대한 정보 및 상기 사용자 단말기에 제공된 상기 기 설정된 개수의 인지 강화 훈련 콘텐츠 중 상 기 사용자 단말기에서 실행된 인지 강화 훈련 콘텐츠의 개수에 기초하여 산출되는 사용률에 대한 정보를 포함할 수 있다. 본 개시의 몇몇 실시예에 따르면, 상기 습관 수행 데이터는, 습관 수행 데이터 획득 단계들을 통해 획득되고, 상기 습관 수행 데이터 획득 단계들은: 상기 사용자 단말기가 복수의 습관 리스트 중 적어도 하나의 습관을 상 기 사용자로부터 입력 받고 상기 적어도 하나의 습관과 관련된 상황 정보를 상기 사용자로부터 입력 받은 경우, 상기 사용자 단말기로부터 상기 적어도 하나의 습관에 대한 정보 및 상기 상황 정보를 수신하는 단계; 상기 상 황 정보에 기초하여 생성된 메시지가 상기 제2 애플리케이션을 통해 상기 사용자 단말기에서 출력되도록 야기하 는 단계; 및 상기 사용자 단말기가 상기 사용자로부터 상기 적어도 하나의 습관과 관련된 특정 입력을 수신한 경우 생성된 상기 습관 수행 데이터를 상기 사용자 단말기로부터 수신하는 단계;를 포함할 수 있다. 본 개시의 몇몇 실시예에 의한 컴퓨터 판독가능 저장 매체에 저장된 컴퓨터 프로그램은 장치의 적어도 하나의 프로세서에서 실행되는 경우, 디지털 바이오 마커에 기초하여 인지 강화 훈련을 제공하는 단계들을 수행하며, 상기 단계들은: 사용자 단말기에 설치된 제1 애플리케이션을 이용하여 획득된 제1 디지털 바이오 마커 데이터를 상기 사용자 단말기로부터 수신하는 단계; 상기 제1 디지털 바이오 마커 데이터에 기초하여 상기 사용자의 인지 기능 상태를 결정하는 단계; 및 상기 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠가 상기 사용자 단말기 에 설치된 제2 애플리케이션을 통해 제공되도록 야기하는 단계;를 포함할 수 있다. 본 개시의 몇몇 실시예에 의한 디지털 바이오 마커에 기초하여 인지 강화 훈련을 제공하는 장치는, 적어도 하나 의 프로그램 명령이 저장된 저장부; 및 상기 적어도 하나의 프로그램 명령을 수행하는 적어도 하나의 프로세 서;를 포함하고, 상기 적어도 하나의 프로세서는, 사용자 단말기에 설치된 제1 애플리케이션을 이용하여 획득된 제1 디지털 바이오 마커 데이터를 상기 사용자 단말기로부터 수신하고, 상기 제1 디지털 바이오 마커 데이터에 기초하여 상기 사용자의 인지 기능 상태를 결정하고, 상기 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠가 상기 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기할 수 있다. 본 개시에서 얻을 수 있는 기술적 해결 수단은 이상에서 언급한 해결 수단들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "또 다른 해결 수단들은 아래의 기재로부터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 인지 강화 훈련의 효과에 대해 설명하면 다음과 같다. 본 개시의 몇몇 실시예에 의해 인지 강화 훈련 콘텐츠를 제공하는 경우 사용자의 인지 예비능이 보다 효과적으 로 향상될 수 있다. 본 개시를 통해 얻을 수 있는 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급하지 않은 또 다른 효과들"}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "은 아래의 기재로부터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것 이다."}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 개시에 따른 장치 및 상기 장치의 제어 방법의 다양한 실시예(들)를 상세하게 설명하되, 도면 부호에 관계없이 동일하거나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되 는 설명은 생략하기로 한다. 본 개시의 목적 및 효과, 그리고 그것들을 달성하기 위한 기술적 구성들은 첨부되는 도면과 함께 상세하게 후술 되어 있는 실시예들을 참조하면 명확해질 것이다. 본 개시의 하나 이상의 실시예들을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 개시의 적어도 하나의 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 본 개시의 용어들은 본 개시에서의 기능을 고려하여 정의된 용어들로써 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 또한, 첨부된 도면은 본 개시의 하나 이상의 실시예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 개시의 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 본 개시의 작성의 용이함만이 고려되어 부 여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 따라서, 이하에서 언급되는 제1 구성요소는 본 개시의 기술적 사상 내에서 제2 구성 요소 가 될 수도 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 즉, 달리 특정되지 않거나 단 수 형태를 지시하는 것으로 문맥상 명확하지 않은 경우, 본 개시와 청구범위에서 단수는 일반적으로 \"하나 또는 그 이상\"을 의미하는 것으로 해석되어야 한다. 본 개시에서, \"포함하는\", \"포함한다\" 또는 \"가지다\" 등의 용어는 본 개시상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"또는\"이라는 용어는 배타적 의미의 \"또는\"이 아니라 내포적 의미의 \"또는\"으로 이해되어야 한다. 즉, 달리 특정되지 않거나 문맥상 명확하지 않은 경우에, \"X는 A 또는 B를 이용한다\"는 자연적인 내포적 치환 중 하나를 의미하는 것으로 의도된다. 즉, X가 A를 이용하거나; X가 B를 이용하거나; 또는 X가 A 및 B 모두를 이용하는 경우, \"X는 A 또는 B를 이용한다\"가 이들 경우들 어느 것으로도 적용될 수 있다. 또한, 본 개시에 사 용된 \"및/또는\"이라는 용어는 열거된 관련 아이템들 중 하나 이상의 아이템의 가능한 모든 조합을 지칭하고 포 함하는 것으로 이해되어야 한다. 본 개시에서 사용되는 용어 \"정보\" 및 \"데이터\"는 서로 상호 교환 가능하도록 사용될 수 있다."}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다른 정의가 없다면, 본 개시에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 개시의 기술분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 특별히 정의되어 있지 않는 한 과도하게 해석되지 않는다. 그러나 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "다. 단지 본 개시의 몇몇 실시예들은 본 개시의 기술분야에서 통상의 지식을 가진 자에게 본 개시의 범주를 완 전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 그러므로 그 정의는 본 개시 전반에 걸친 내용을 토대로 내려져야 할 것이다. 본 개시의 몇몇 실시예에 따르면, 장치의 적어도 하나의 프로세서(이하, '프로세서'라고 지칭함)는 사용자 단말 기에 설치된 제1 애플리케이션을 이용하여 획득된 제1 디지털 바이오 마커 데이터를 사용자 단말기로부터 수신 할 수 있다. 그리고, 프로세서는 제1 디지털 바이오 마커 데이터에 기초하여 사용자 단말기의 사용자의 인지 기 능 상태를 결정할 수 있다. 프로세서는, 사용자의 인지 기능 상태가 결정된 경우, 사용자의 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠가 사용자 단말기에 설치된 제1 애플리케이션과 상이한 제2 애플리케이션을 통 해 제공되도록 야기할 수 있다. 이하에서는, 도 1 내지 도 14을 참조하여 인지 강화 훈련 콘텐츠를 제공하는 방 법에 대해서 설명한다. 도 1은 본 개시의 몇몇 실시예에 따른 인지 강화 훈련을 제공하는 시스템을 설명하기 위한 개략도이다. 도 1을 참조하면 인지 강화 훈련을 제공하는 시스템은 인지 강화 훈련 콘텐츠를 제공하는 장치 및 인지 강 화 훈련을 필요로 하는 사용자의 사용자 단말기를 포함할 수 있다. 그리고, 장치와 사용자 단말기 는 유/무선 네트워크를 통해 통신이 연결될 수 있다. 다만, 도 1에 도시된 시스템을 구성하는 구성요 소들은 인지 강화 훈련을 제공하는 시스템을 구현하는데 있어서 필수적인 것은 아니어서, 위에서 열거된 구성요 소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 본 개시의 장치는 유/무선 네트워크(wire/wireless network)를 통하여 사용자 단말기와 페어링 또는 연결(pairing or connecting) 가능하며, 이를 통해 소정 데이터를 송/수신할 수 있다. 이 경우, 유/무선 네트워크를 통해 송/수신되는 데이터는 송/수신 전에 변환(converting)될 수 있다. 여기서, “유/무선 네 트워크”라 함은, 장치와 사용자 단말기 사이에서 페어링 또는/및 데이터 송수신을 위해 다양한 통신 규격 내지 프로토콜을 지원하는 통신 네트워크를 통칭한다. 이러한 유/무선 네트워크는, 규격에 의해 현재 또는 향후 지원될 통신 네트워크를 모두 포함하며, 그를 위한 하나 또는 그 이상의 통신 프로토콜들을 모 두 지원 가능하다. 장치는 프로세서, 저장부 및 통신부를 포함할 수 있다. 도 1에 도시된 구성요소들은 장치 를 구현하는데 있어서 필수적인 것은 아니어서, 본 개시에서 설명되는 장치는 위에서 열거된 구성요 소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 본 개시의 장치의 각 구성요소는 실제 구현되는 장치의 사양에 따라 통합, 추가, 또는 생략될 수 있 다. 즉, 필요에 따라, 2 이상의 구성요소가 하나의 구성요소로 합쳐지거나 하나의 구성요소가 2 이상의 구성요 소로 세분화될 수 있다. 또한, 각 블록에서 수행하는 기능은 본 개시의 실시예를 설명하기 위한 것이며, 그 구 체적인 동작이나 장치는 본 발명의 권리범위를 제한하지 아니한다. 본 개시에서 설명되는 장치는 데이터(data), 콘텐츠(content), 서비스(service) 및 애플리케이션 (application) 등을 송신 및 수신 중 적어도 하나 이상을 수행하는 모든 디바이스를 포함할 수 있다. 다만, 이 에 한정되는 것은 아니다. 본 개시의 장치에는 예를 들어, 서버(server), PC(Personal Computer), 마이크로프로세서, 메인프레임 컴 퓨터, 디지털 프로세서, 디바이스 제어기 등과 같은 고정형 디바이스(standing device) 스마트 폰(Smart Phone), 태블릿 PC(Tablet PC), 노트북(Notebook) 등과 같은 모바일 디바이스(mobile device or handheld device)가 모두 포함될 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시에서, \"서버\"라 함은, 다양한 종류의 사용자 단말기 즉, 클라이언트(client)로 데이터를 공급 또는 그로 부터 데이터를 수신하는 장치 혹은 시스템을 의미한다. 서버로 예컨대, 웹 페이지(web page), 웹 컨텐츠 또는 웹 서비스(web content or web service)를 제공하는 웹 서버(Web server)나 포털 서버(portal server), 광고 데이터(advertising data)를 제공하는 광고 서버(advertising server), 컨텐츠를 제공하는 컨텐츠 서버(content server), SNS(Social Network Service)를 제공하는 SNS 서버, 제조업체(manufacturer)에서 제공하는 서비스 서버(service server), VoD(Video on Demand)나 스트리밍(streaming) 서비스 제공을 위한 MVPD(Multichannel Video Programming Distributor), 유료 서비스(pay service) 등을 제공하는 서비스 서버 등 이 포함될 수 있다. 본 개시에서 장치로 명명하는 경우, 그 의미는 문맥에 따라 서버를 의미하나, 고정형 디바이스 또는 모바 일 디바이스를 의미할 수도 있고 특별히 언급하지 않는다면 모두 포함하는 의미로 사용될 수도 있다. 프로세서는 응용 프로그램과 관련된 동작 외에도 통상적으로 장치의 전반적인 동작을 제어할 수 있다. 프로세서는 장치의 구성요소들을 통해 입력 또는 출력되는 신호, 데이터, 정보 등을 처리하거 나 저장부에 저장된 응용 프로그램을 구동함으로써, 적절한 정보 또는 기능을 제공 또는 처리할 수 있다. 프로세서는 저장부에 저장된 응용 프로그램을 구동하기 위하여 장치의 구성요소들 중 적어도 일 부를 제어할 수 있다. 나아가, 프로세서는 응용 프로그램의 구동을 위하여 장치에 포함된 구성요소들 중 적어도 둘 이상을 서로 조합하여 동작시킬 수 있다. 프로세서는 하나 이상의 코어로 구성될 수 있으며, 다양한 상용 프로세서들 중 임의의 프로세서일 수 있다. 예를 들어, 프로세서는 장치의 중앙 처리 장치(CPU: Central Processing Unit), 범용 그래픽 처리 장치 (GPUGP: General Purpose Graphics Processing Unit), 텐서 처리 장치(TPU: Tensor Processing Unit) 등 을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 프로세서는 듀얼 프로세서 또는 기타 멀티프로세서 아키텍처로 구성될 수 있다. 다만, 이에 한 정되는 것은 아니다. 프로세서는 저장부에 저장된 컴퓨터 프로그램을 판독하여 본 개시의 몇몇 실시예에 따른 인지 기능 상태 인식 모델을 이용하여 사용자의 인지 기능 상태를 결정할 수 있다. 여기서, 사용자의 인지 기능 상태는 사 용자가 경도 인지 장애(Mild Cognitive Impaired; MCI)가 있는지, 주관적 인지 저하(Subjective Memory Impairment; SMI)가 있는지, 사용자의 뇌 나이는 몇 살인지, 사용자에게 부족한 인지 영역은 어떤 영역인지 등 을 나타낼 수 있다. 다만, 이에 한정되는 것은 아니다. 저장부는, 장치의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 저장부는 장치에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 장치의 동작을 위한 데이터들, 명령어들, 적어도 하나의 프로그램 명령을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일 부는, 무선 통신을 통해 외부 서버로부터 다운될 수 있다. 또한, 이러한 응용 프로그램 중 적어도 일부는, 장치 의 기본적인 기능을 위하여 출고 당시부터 장치 상에 존재할 수도 있다. 한편, 응용 프로그램은, 저 장부에 저장되고, 장치 상에 설치되어 프로세서에 의하여 장치의 동작(또는 기능)을 수행 하도록 구동될 수 있다. 저장부는 프로세서에서 생성하거나 결정한 임의의 형태의 정보 및 통신부를 통해 수신한 임의의 형태의 정보를 저장할 수 있다. 저장부는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입(Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 장치는 인터넷(internet) 상에서 저장부의 저장 기능을 수행하는 웹 스토리지(web storage)와 관련되어 동작될 수도 있다. 저장부는 사용자의 인지 예비능 향상을 위한 복수의 인지 강화 훈련 콘텐츠를 저장하고 있을 수 있다. 인 지 예비능은 뇌의 노화를 대비해 평소에는 사용되지 않는 뇌의 대체 네트워크를 활용하는 능력으로 인지 예비능 이 높으면 치매 예방에 효과적이라는 연구 결과가 존재한다. 따라서, 인지 예비능을 향상시키는 인지 강화 훈련 콘텐츠가 장치의 저장부에 저장되어 있고, 사용자의 인지 기능 상태에 기초하여 사용자에게 인지 강 화 훈련 콘텐츠가 제공되는 경우 사용자는 치매를 예방할 수 있다. 본 개시에서 프로세서는 사용자의 인지 기능 상태를 결정한 후 저장부에 저장된 복수의 인지 강화 훈 련 콘텐츠 중 사용자의 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠가 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기할 수 있다. 다만, 이에 한정되는 것은 아니고, 프로세서는 복수의 인지 강화 훈련 콘텐츠 중 사용자 단말기의 사용자가 선택한 인지 강화 훈련 콘텐츠가 제2 애플리케이션을 통해 제공되도록 야기할 수 있다. 복수의 인지 강화 훈련 콘텐츠는 전문화된 6개의 인지 영역 중 적어도 하나 이상의 인지 영역에 대한 능력 향상 을 목표로 하는 콘텐츠를 포함할 수 있다. 여기서, 6개의 인지 영역은 기억력, 계산능력, 주의력, 언어능력, 실 행능력 및 시공간 능력을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 복수의 인지 강화 훈련 콘텐츠는 게임 형태로 인지 강화 훈련을 진행할 수 있다. 이 경우 사용자의 흥미를 고취 시켜 사용자가 자발적으로 인지 강화 훈련을 수행할 수 있도록 만들 수 있다. 기억력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는 특정 정보를 상기시키는 훈련을 게임 형태로 제공할 수 있 다. 예를 들어, 기억력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는 시 외우기 게임, 나라별 국기 외우기 게임, 사자성어 뜻을 제공한 후 사자성어 중간에 들어간 단어 맞추기 게임, 사자성어 뜻을 제공한 후 예시에 들 어갈 사자성어 맞추기 게임, 그리드(Grid) 틀 안에서 시각적 자극의 위치를 기억하기 게임 등을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 계산능력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는 사칙 연산 문제를 제공하여 연산 능력을 향상시키는 훈 련을 게임 형태로 제공할 수 있다. 예를 들어, 계산 능력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는 제시된 숫자와 연산자를 합쳐 연산하는 게임, 제시된 식에서 빈칸에 들어가는 숫자를 맞추는 게임, 암호를 활용해서 식 을 해독한 후 정답을 맞추는 게임, 메뉴판에서 메뉴를 선택하고 총 식사의 가격과 거스름돈을 계산하는 게임 등 을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 주의력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는, 사용자의 주의를 집중시키는 훈련을 게임 형태로 제공할 수 있다. 예를 들어, 주의력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는, 여러 개의 글자가 섞인 글자판에서 주제에 맞는 단어를 찾는 게임, 주어진 제시문에서 특정 이모티콘의 개수를 세는 게임 등을 포함할 수 있다. 다 만, 이에 한정되는 것은 아니다. 언어 능력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는, 문장 또는 단어를 이용하여 수행하는 연상 또는 유추 훈련을 게임 형태로 제공할 수 있다. 예를 들어, 언어 능력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는, 제시 된 단어의 순서를 바꿔 완성된 단어를 만드는 게임, 공통된 첫 글자 맞추는 게임 등을 포함할 수 있다. 실행 능력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는 시간의 흐름에 따라 일의 순서를 결정하는 훈련을 게임 형태로 제공할 수 있다. 예를 들어, 실행 능력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는, 주어진 예산과 시 간을 초과하지 않게 일정을 계획하는 게임, 뒤죽박죽 섞여 있는 것의 순서를 맞추는 게임 등을 포함할 수 있다. 시공간 능력 향상을 목표로 하는 인지 강화 훈련 콘텐츠는 특정 물체를 대상으로 바라보는 시점에 따라 보여지 는 형상을 예상하는 훈련을 게임 형태로 제공할 수 있다. 한편, 본 개시에서 저장부에 저장된 복수의 인지 강화 훈련 콘텐츠는 난이도, 콘텐츠의 종류 및 콘텐츠의 수 중 적어도 하나가 다를 수 있다. 따라서, 사용자는 다양한 난이도와 다양한 종류의 인지 강화 훈련 콘텐츠를 제공받을 수 있다. 통신부는 장치와 유선/무선 통신 시스템 사이, 장치와 다른 장치 사이 또는 장치와 외부 서버 사이의 유선/무선 통신을 가능하게 하는 하나 이상의 모듈을 포함할 수 있다. 또한, 통신부는 장치 를 하나 이상의 네트워크에 연결하는 하나 이상의 모듈을 포함할 수 있다. 통신부는 유선/무선 인터넷 접속을 위한 모듈을 말하는 것으로 장치에 내장되거나 외장될 수 있다. 통신부는 유선/무선 신호를 송수신하도록 이루어질 수 있다. 통신부는 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV- DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등)에 따라 구축된 이동 통신망 상에서 기지국, 외부의 단말 및 서버 중 적어도 하나 와 무선 신호를 송수신할 수 있다. 무선 인터넷 기술로는, 예를 들어 WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), Wi-Fi(Wireless Fidelity) Direct, DLNA(Digital Living Network Alliance), WiBro(Wireless Broadband), WiMAX(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등이 있을 수 있다. 다만, 상기에 서 나열되지 않은 인터넷 기술까지 포함한 범위에서 적어도 하나의 무선 인터넷 기술에 따라 통신부는 데 이터를 송수신할 수 있다. 더불어, 통신부는 근거리 통신(Short range communication)을 통해 신호를 송수신하도록 이루어질 수도 있 다. 통신부는 블루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra-Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless- Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여 근 거리 통신을 수행할 수 있다. 통신부는 근거리 통신망(Wireless Area Networks)을 통해 무선 통신을 지원 할 수 있다. 근거리 무선 통신망은 근거리 무선 개인 통신망(Wireless Personal Area Networks)일 수 있다. 본 개시의 몇몇 실시예에 따른 장치는 통신부를 통해 사용자 단말기와 유/무선 네트워크가 연결될 수 있다. 본 개시에서 사용자 단말기는 유/무선 네트워크(wire/wireless network)를 통하여 장치와 페어 링 또는 연결(pairing or connecting) 가능하며, 이를 통해 소정 데이터를 송/수신 및 디스플레이할 수 있다. 본 개시에서 설명되는 사용자 단말기는 데이터(data), 콘텐츠(content), 서비스(service) 및 애플리케이션 (application) 등을 송신, 수신 및 디스플레이 중 적어도 하나 이상을 수행하는 모든 디바이스를 포함할 수 있 다. 그리고, 사용자 단말기는 인지 강화 훈련을 필요로 하는 사용자의 단말기를 의미할 수 있다. 다만, 이 에 한정되는 것은 아니다. 본 개시에서 사용자 단말기는 예를 들어, 휴대폰, 스마트 폰(smart phone), 태블릿 PC(tablet PC), 울트 라북(ultrabook) 등과 같은 이동 단말기(mobile device)를 포함할 수 있다. 다만, 이에 한정되는 것은 아니고, 사용자 단말기는 PC(Personal Computer), 마이크로프로세서, 메인프레임 컴퓨터, 디지털 프로세서, 디바이 스 제어기 등과 같은 고정형 디바이스(standing device)도 포함할 수 있다. 사용자 단말기는 프로세서, 저장부, 통신부 및 디스플레이부를 포함할 수 있다. 도 1 에 도시된 구성요소들은 사용자 단말기를 구현하는데 있어서 필수적인 것은 아니어서, 본 개시에서 설명되 는 사용자 단말기는 위에서 열거된 구성요소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 본 개시의 사용자 단말기의 각 구성요소는 실제 구현되는 사용자 단말기의 사양에 따라 통합, 추가, 또는 생략될 수 있다. 즉, 필요에 따라, 2 이상의 구성요소가 하나의 구성요소로 합쳐지거나 하나의 구성요소가 2 이상의 구성요소로 세분화될 수 있다. 또한, 각 블록에서 수행하는 기능은 본 개시의 실시예를 설명하기 위한 것이며, 그 구체적인 동작이나 장치는 본 발명의 권리범위를 제한하지 아니한다. 사용자 단말기의 프로세서, 저장부 및 통신부는 장치의 프로세서, 저장부 및 통신부와 동일한 구성 요소이므로, 중복되는 설명은 생략하고, 이하 차이점을 중심으로 설명한다. 본 개시에서 저장부는 제1 애플리케이션 및 제2 애플리케이션을 저장하고 있을 수 있다. 제1 애플리케이션 및 제2 애플리케이션은 무선 통신을 통해 외부 서버로부터 다운될 수 있다. 다만, 이에 한정되는 것은 아니다. 제1 애플리케이션은 사용자의 치매 단계 선별을 위한 복수의 테스트를 수행할 수 있는 화면을 제공하는 애플리 케이션일 수 있다. 본 개시에서 사용자의 치매 단계를 선별하기 위한 복수의 테스트를 수행한 후 획득된 디지털 바이오 마커 데이터는 사용자의 인지 기능 상태를 결정할 때 활용될 수 있다. 사용자 단말기의 프로세서는 제1 애플리케이션이 실행된 경우, 사용자의 치매 단계 선별을 위한 복수 의 테스트 각각을 수행하기 위한 화면을 디스플레이하도록 디스플레이부를 제어할 수 있다. 여기서, 복수 의 테스트는 스트루프 테스트(stroop test), 계산력 테스트, 기억력 테스트, 시선 테스트 및 혼합 테스트 중 적 어도 하나를 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 스트루프 테스트는 주어진 과제에 대한 반응 시간이 주의에 따라 달라지는 효과 또는 이러한 현상을 이용하여 테스트를 진행하는 것을 의미할 수 있다. 계산력 테스트는 수학식을 제공하고 그에 따른 정답을 선택하는 방식으로 테스트를 진행하는 것을 의미할 수 있 다. 기억력 테스트는 이전 화면에 디스플레이 된 복수의 객체를 기억하여 현재 디스플레이되고 있는 화면에서 선택 하는 방식으로 테스트를 진행하는 것을 의미할 수 있다. 상술한 테스트들은 일 예시에 불과할 뿐 본 개시의 테스트들은 상술한 예시에 한정되는 것은 아니다. 제2 애플리케이션은 챗봇 서비스를 제공할 수 있는 메신저 애플리케이션일 수 있다. 본 개시에서, 사용자는 제2 애플리케이션을 통해 챗봇과 대화하는 형태로 자신의 인지 기능 상태를 제공받을 수 있다. 또한, 사용자는 제2 애플리케이션을 통해 챗봇과 대화하는 형태로 인지 강화 훈련 콘텐츠를 제공받을 수 있다. 다만, 이에 한정되는 것은 아니다. 한편, 본 개시의 몇몇 실시예에 따르면, 사용자는 제2 애플리케이션을 통해 우울/불안 선별 테스트를 수행할 수 도 있다. 여기서, 우울/불안 선별 테스트는 우울/불안 선별을 위한 질문을 사용자에게 제공하고 사용자의 응답 의 의미가 \"예\" 및 \"아니오\"에 해당하는지에 따라 사용자의 우울과 불안을 선별하는 테스트일 수 있다. 만약, 사용자에게 우울 또는 불안 증세가 있다고 인식된 경우, 제2 애플리케이션을 통해 우울 훈련과 불안 훈련이 기 설정된 횟수만큼 기 설정된 시간 간격으로(예를 들어, 총 4회가 1주일 간격으로) 제공될 수 있다. 다만, 사용자 에게 우울 훈련과 불안 훈련이 제공될 때, 우울 훈련과 불안 훈련은 함께 제공되는 것이 아니고 분리되어(시간 을 달리하여) 제공될 수 있다. 본 개시의 다른 몇몇 실시예에 따르면, 사용자는 제2 애플리케이션을 통해 다양한 대화를 챗봇과 진행할 수 있 다. 예를 들어, 사용자는 스마트폰 사용 방법 학습과 관련된 대화, 과거 회상과 관련된 대화, 단순 수다와 관련 된 대화를 제2 애플리케이션을 이용하여 챗봇과 진행할 수 있다. 한편, 본 개시에서 사용자의 인지 기능 상태는 인지 기능 상태 인식 모델을 통해 결정될 수 있다. 인지 기능 상 태 인식 모델은 학습용 데이터에 라벨링 된 라벨 데이터와 인지 기능 상태 인식 모델에서 출력된 예측 데이터 사이의 차이 값을 역전파(back propagation)하여 신경망의 가중치를 업데이트하는 방법으로 학습된 인공지능 모 델일 수 있다. 한편, 본 개시에서 사용자의 뇌 나이를 산출하는 뇌 나이 산출 모델이 저장부에 저장되어 있을 수 있다. 뇌 나이 산출 모델도 인지 기능 상태 인식 모델과 마찬가지로 학습용 데이터에 라벨링된 라벨 데이터와 뇌 나이 산출 모델에서 출력된 예측 데이터 사이의 차이 값을 역전파(back propagation)하여 신경망의 가중치를 업데이 트하는 방법으로 학습된 인공지능 모델일 수 있다. 인지 기능 상태 인식 모델 또는 뇌 나이 산출 모델을 이용한 연산을 수행하기 위해서는 높은 처리 속도 및 연산 능력이 필요하기 때문에 인지 기능 상태 인식 모델 및 뇌 나이 산출 모델은 장치의 저장부에만 저장 되어 있고, 사용자 단말기의 저장부에는 저장되어 있지 않을 수 있다. 다만, 이에 한정되는 것은 아 니다. 디스플레이부는 사용자 단말기에서 처리되는 정보를 표시(출력)할 수 있다. 예를 들어, 디스플레이부 는 사용자 단말기에서 구동되는 응용 프로그램의 실행 화면 정보 또는 이러한 실행 화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 디스플레이부는 액정 디스플레이(liquid crystal display, LCD), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display, TFT LCD), 유기 발광 다이오드(organic light-emitting diode, OLED), 플렉서블 디스플레이(flexible display), 3차원 디스플레이(3D display), 전자잉크 디스플레이(e-ink display) 중에서 적어도 하나를 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 디스플레이부는 터치 방식에 의하여 제어 명령을 입력 받을 수 있도록, 디스플레이부에 대한 터치를 감지하는 터치 센서를 포함할 수 있다. 디스플레이부는 터치 센서와 상호 레이어 구조를 이루거나 일체형 으로 형성됨으로써, 터치스크린을 구현할 수 있다. 이러한, 터치스크린은, 사용자 단말기와 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력부로써 기능함과 동시에 사용자 단말기와 사용자 사이의 출력 인 터페이스를 제공할 수 있다. 터치 센서는 저항막 방식, 정전용량 방식, 적외선 방식, 초음파 방식, 자기장 방식 등 여러 가지 터치 방식 중 적어도 하나를 이용하여 디스플레이부에 가해지는 터치(또는 터치 입력 또는 선택 입력)을 감지할 수 있다. 일 예로, 터치 센서는, 터치 스크린의 특정 부위에 가해진 압력 또는 특정 부위에 발생하는 정전 용량 등의 변 화를 전기적인 입력 신호로 변환하도록 구성될 수 있다. 터치 센서는, 터치 스크린 상에 터치를 가하는 터치 대상체가 터치 센서 상에 터치 되는 위치, 면적, 터치 시의 압력, 터치 시의 정전 용량 등을 검출할 수 있도록 구 성될 수 있다. 여기서. 터치 대상체는 터치 센서에 터치를 인가하는 물체로서, 예를 들어, 손가락, 터치펜 또는 스타일러스 펜(Stylus pen), 포인터 등이 될 수 있다. 이와 같이, 터치 센서에 대한 터치 입력(또는 선택 입력)이 있는 경우, 그에 대응하는 신호(들)는 터치 제어기 로 보내진다. 터치 제어기는 그 신호(들)를 처리한 다음 대응하는 데이터를 프로세서로 전송한다. 이로써, 프로세서는 디스플레이부의 어느 영역이 터치 되었는지 여부 등을 알 수 있게 된다. 여기서, 터치 제 어기는, 프로세서와 별도의 구성요소일 수 있고, 프로세서 자체일 수도 있다. 한편, 도면에는 도시되지 않았지만, 사용자 단말기는 음향 출력부를 더 포함할 수 있다. 본 개시의 몇몇 실시예에 따르면, 음향 출력부는 복수의 테스트 중 어느 하나의 테스트를 진행하는 것과 연동하여 기 설정된 음 향(예를 들어, 현재 사용자가 수행해야 되는 작업을 설명하는 음성)을 출력할 수 있다. 다만, 이에 한정되는 것 은 아니다. 본 개시의 몇몇 실시예에 따르면, 사용자의 인지 기능 상태를 결정하기 위한 디지털 바이오 마커(디지털 기기로 부터 획득되는 바이오 마커)는 사용자 단말기에서 복수의 테스트를 진행하여 획득될 수 있다. 장치의 프로 세서는 사용자 단말기에서 획득된 디지털 바이오 마커 데이터를 사용자 단말기로부터 수신하여 사용 자의 인지 기능 상태를 결정할 수 있다. 그리고, 장치의 프로세서는 사용자의 인지 기능 상태에 대응 하는 인지 강화 훈련 콘텐츠를 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기할 수 있다. 이는 도 2를 참조하여 자세히 설명한다. 도 2는 본 개시의 몇몇 실시예에 따라 인지 강화 훈련 콘텐츠를 제공하는 방법의 일례를 설명하기 위한 흐름도 이다. 도 2와 관련하여 도 1에서 상술한 바와 중복되는 내용은 다시 설명하지 않으며, 이하 차이점을 중심으로 설명한다. 도 2를 참조하면, 장치의 프로세서는 제1 디지털 바이오 마커 데이터를 사용자 단말기로부터 통 신부를 통해 수신할 수 있다(S110). 구체적으로, 사용자 단말기의 사용자는 사용자 단말기에 설치된 제1 애플리케이션이 실행한 후 복수 의 테스트를 진행할 수 있다. 이 경우, 사용자 단말기의 프로세서는 통신부를 통해 복수의 테스 트를 수행한 테스트 결과 데이터인 제1 디지털 바이오 마커 데이터를 장치에 전송할 수 있다. 그리고, 장 치의 프로세서는 통신부를 통해 제1 디지털 바이오 마커 데이터를 수신할 수 있다. 본 개시에서 제1 애플리케이션은 사용자 단말기의 사용자의 치매 단계 선별을 위한 테스트를 실행하는 애 플리케이션일 수 있다. 여기서, 복수의 테스트는 사용자의 치매 단계(예를 들어, 인지정상군, 인지저하군 등)를 선별하기 위한 테스트이다. 따라서, 복수의 테스트를 수행한 후 획득된 테스트 결과 데이터는 사용자의 치매 단 계를 선별하기 위해 사용될 수 있다. 다만, 테스트 결과 데이터 중 적어도 일부는 사용자의 인지 기능 상태를 결정할 때 활용될 수 있다. 구체적으로, 복수의 테스트를 수행한 후 획득된 테스트 결과 데이터는 다양한 정보 예를 들어, 복수의 테스트의 총 소요 시간에 대한 정보, 정답이라고 결정된 횟수에 대한 정보, 상기 오답이라고 결정된 횟수에 대한 정보, 복수의 테스트에 대한 정답률에 대한 정보, 복수의 테스트 중 적어도 하나를 통해 획득된 시선 정보, 상기 복수 의 테스트 중 적어도 하나에 기초하여 획득된 음성 관련 정보 및 복수의 테스트 각각에 대한 응답 시간에 대한 정보 등을 포함할 수 있다. 하지만, 테스트 결과 데이터가 포함하고 있는 다양한 정보 중 복수의 테스트에 대한 정답률에 대한 정보, 복수의 테스트 중 적어도 하나를 통해 획득된 시선 정보, 상기 복수의 테스트 중 적어도 하나에 기초하여 획득된 음성 관련 정보 및 복수의 테스트 각각에 대한 응답 시간에 대한 정보가 사용자의 인지 기능 상태를 결정할 때 활용될 수 있다. 즉, 제1 디지털 바이오 마커 데이터는 사용자 단말기에 설치된 제 1 애플리케이션을 이용하여 실행된 복수의 테스트를 통해 획득된 데이터 중 적어도 일부로 복수의 테스트에 대 한 정답률에 대한 정보, 복수의 테스트 중 적어도 하나를 통해 획득된 시선 정보, 상기 복수의 테스트 중 적어 도 하나에 기초하여 획득된 음성 관련 정보 및 복수의 테스트 각각에 대한 응답 시간에 대한 정보를 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시에서, 복수의 테스트에 대한 정답률은 복수의 테스트에서 정답이라고 결정된 횟수를 복수의 테스트 전체 개수로 나누어서 산출될 수 있다. 그리고, 복수의 테스트 각각에 대한 응답 시간에 대한 정보는 복수의 테스트 각각이 디스플레이된 후에 사용자의 응답을 수신한 시점까지 소요된 시간에 대한 정보를 의미할 수 있다. 본 개시에서 복수의 테스트는 스트루프 테스트(stroop test), 계산력 테스트, 기억력 테스트, 시선 테스트 및 혼합 테스트 중 적어도 하나를 포함할 수 있다. 복수의 테스트에 대한 자세한 설명은 도 3 내지 도 12를 참조하 여 후술한다. 장치의 프로세서는 제1 디지털 바이오 마커 데이터를 통신부를 통해 수신한 경우, 제1 디지털 바이오 마커 데이터에 기초하여 사용자의 인지 기능 상태를 결정할 수 있다(S120). 여기서, 사용자는 제1 디지 털 바이오 마커 데이터를 전송한 사용자 단말기의 사용자일 수 있다. 구체적으로, 장치의 프로세서는 제1 디지털 바이오 마커 데이터인 복수의 테스트에 대한 정답률에 대 한 정보, 복수의 테스트 중 적어도 하나를 통해 획득된 시선 정보, 상기 복수의 테스트 중 적어도 하나에 기초 하여 획득된 음성 관련 정보 및 복수의 테스트 각각에 대한 응답 시간에 대한 정보를 기 학습된 인지 기능 상태 인식 모델에 입력할 수 있다. 그리고, 프로세서는 인지 기능 상태 인식 모델에서 출력된 출력 데이터에 기 초하여 사용자의 인지 기능 상태를 결정할 수 있다. 여기서, 사용자의 인지 기능 상태는 사용자가 경도 인지 장애(Mild Cognitive Impaired; MCI)가 있는지, 주관적 인지 저하(Subjective Memory Impairment; SMI)가 있는 지, 사용자의 뇌 나이는 몇 살인지, 사용자에게 부족한 인지 영역은 어떤 영역인지 등을 나타낼 수 있다. 다만, 이에 한정되는 것은 아니다. 좀더 구체적으로, 본 개시에서 복수의 테스트에 대한 정답률에 대한 정보, 복수의 테스트 중 적어도 하나에 의 해 획득된 시선 정보, 상기 복수의 테스트 중 적어도 하나에 기초하여 획득된 음성 관련 정보 및 복수의 테스트 각각에 대한 응답 시간에 대한 정보가 기 학습된 인지 기능 상태 인식 모델에 입력되면, 기 학습된 인지 기능 상태 인식 모델은 경도 인지 장애와 관련된 스코어 값, 주관적 인지 저하와 관련된 스코어 값, 사용자의 뇌 나 이와 관련된 값 및 사용자의 6개의 인지 영역 각각과 관련된 스코어 값을 출력할 수 있다. 이 경우, 프로세서 는 인지 기능 상태 인식 모델에서 출력된 값들을 이용하여 사용자가 경도 인지 장애가 있는지, 주관적 인 지 저하가 있는지, 사용자의 뇌 나이는 몇 살인지, 사용자에게 부족한 인지 영역은 어떤 영역인지를 결정할 수 있다. 일례로, 장치의 프로세서는 기 학습된 인지 기능 상태 인식 모델에서 출력된 경도 인지 장애와 관련 된 스코어 값이 기 설정된 임계 값을 초과하면 경도 인지 장애가 있다고 결정할 수 있다. 다만, 이에 한정되는 것은 아니고, 프로세서는 기 학습된 인지 기능 상태 인식 모델에서 출력된 경도 인지 장애와 관련된 스코 어 값이 기 설정된 임계 값 보다 작거나 같으면 경도 인지 장애가 있다고 결정할 수도 있다. 다른 일례로, 장치의 프로세서는 기 학습된 인지 기능 상태 인식 모델에서 출력된 주관적 인지 저하 와 관련된 스코어 값이 기 설정된 임계 값을 초과하면 주관적 인지 저하가 있다고 결정할 수 있다. 다만, 이에 한정되는 것은 아니고, 프로세서는 기 학습된 인지 기능 상태 인식 모델에서 출력된 주관적 인지 저하와 관련된 스코어 값이 기 설정된 임계 값보다 작거나 같으면 주관적 인지 저하가 있다고 결정할 수도 있다. 또 다른 일례로, 장치의 프로세서는 기 학습된 인지 기능 상태 인식 모델에서 출력된 뇌 나이와 관련 된 값에 기초하여 사용자의 뇌 나이를 산출할 수 있다. 또 다른 일례로, 장치의 프로세서는 기 학습된 인지 기능 상태 인식 모델에서 출력된 6개의 인지 영 역 각각과 관련된 스코어 값 중 기 설정된 임계 값을 초과하는 스코어 값을 갖는 인지 영역을 부족한 인지 영역 으로 결정할 수 있다. 다만, 이에 한정되는 것은 아니고, 프로세서는 기 학습된 인지 기능 상태 인식 모델 에서 출력된 6개의 인지 영역 각각과 관련된 스코어 값 중 기 설정된 임계 값보다 작거나 같은 스코어 값을 갖 는 인지 영역을 부족한 인지 영역으로 결정할 수도 있다. 본 개시에서 인지 기능 상태 인식 모델은 복수의 테스트에 대한 정답률에 대한 정보, 복수의 테스트 중 적어도 하나에 의해 획득된 시선 정보, 상기 복수의 테스트 중 적어도 하나에 기초하여 획득된 음성 관련 정보 및 복수 의 테스트 각각에 대한 응답 시간에 대한 정보를 입력하면 사용자의 인지 기능 상태와 관련된 출력 데이터를 출 력하도록 학습(training)될 수 있다. 여기서, 출력 데이터는 사용자의 뇌 나이와 관련된 값, 사용자가 경도 인 지 장애에 해당하는지 여부와 관련된 스코어 값, 사용자가 주관적 인지 저하가 있는지와 관련된 스코어 값 및 사용자의 6개의 인지 영역 각각과 관련된 스코어 값 중 적어도 하나를 포함할 수 있다. 다만, 이에 한정되는 것 은 아니다. 인지 기능 상태 인식 모델은, 학습용 데이터에 라벨링 된 라벨 데이터와 인지 기능 상태 인식 모델에서 출력된 예측 데이터 사이의 차이 값을 역전파(back propagation)하여 신경망의 가중치를 업데이트하는 방법으로 학습될 수 있다. 본 개시에서 학습 데이터는 복수의 테스트 사용자가 자신의 테스트 장치를 통해 본 개시의 몇몇 실시예에 따른 복수의 테스트 각각을 수행하여 획득될 수 있다. 여기서, 학습 데이터는 테스트 사용자가 복수의 테스트를 수행 하여 획득되는 복수의 테스트 결과 데이터를 포함할 수 있다. 본 개시에서 테스트 사용자는, 경도 인지 장애가 존재하는 사용자, 주관적 인지 저하가 있는 사용자, 타 테스트 를 통해서 뇌 나이와 6개의 인지 영역 각각에 대한 스코어 값을 알 수 있는 사용자 등을 포함할 수 있다. 다만 이에 한정되는 것은 아니다. 본 개시에서 테스트 장치는 학습 데이터를 확보할 때 다양한 테스트 사용자들이 테스트를 수행하는 장치를 의미 할 수 있다. 여기서, 테스트 장치는, 본 개시에서 인지 기능 상태 인식에 사용되는 사용자 단말기와 동일 하게 휴대폰, 스마트 폰(smart phone), 태블릿 PC(tablet PC), 울트라북(ultrabook) 등과 같은 이동 단말기 (mobile device)일 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시에서 라벨 데이터는 테스트 사용자의 뇌 나이와 관련된 값, 테스트 사용자가 경도 인지 장애에 해당하는 지 여부와 관련된 스코어 값, 테스트 사용자가 주관적 인지 저하가 있는지와 관련된 스코어 값 및 테스트 사용 자의 6개의 인지 영역 각각과 관련된 스코어 값을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 인지 기능 상태 인식 모델은 일반적으로 노드로 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성될 수 있다. 이러한 노드들은 뉴런(neuron)들로 지칭될 수도 있다. 신경망은 적어도 하나의 노드들을 포함하여 구성될 수 있다. 신경망들을 구성하는 노드(또는 뉴런)들은 하나 이상의 링크에 의해 상호 연결될 수 있다. 인지 기능 상태 인식 모델 내에서, 링크를 통해 연결된 하나 이상의 노드들은 상대적으로 입력 노드 및 출력 노 드의 관계를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 상술한 바와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나의 출력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서 출력 노드의 데이터는 입력 노드에 입력된 데이터 에 기초하여 그 값이 결정될 수 있다. 여기서, 입력 노드와 출력 노드를 상호 연결하는 링크는 가중치(weight) 를 가질 수 있다. 가중치는 가변적일 수 있으며, 신경망이 원하는 기능을 수행하기 위해, 사용자 또는 알고리즘 에 의해 가변될 수 있다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연결된 경우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하는 링크에 설정된 가중치 에 기초하여 출력 노드 값을 결정할 수 있다. 상술한 바와 같이, 인지 기능 상태 인식 모델은 하나 이상의 노드들이 하나 이상의 링크를 통해 상호 연결되어 신경망 내에서 입력 노드 및 출력 노드 관계를 형성할 수 있다. 인지 기능 상태 인식 모델 내에서 노드들과 링 크들의 개수 및 노드들과 링크들 사이의 연관 관계, 링크들 각각에 부여된 가중치의 값에 따라, 인지 기능 상태 인식 모델의 특성이 결정될 수 있다. 인지 기능 상태 인식 모델은 하나 이상의 노드들의 집합으로 구성될 수 있다. 인지 기능 상태 인식 모델을 구성 하는 노드들의 부분 집합은 레이어(layer)를 구성할 수 있다. 인지 기능 상태 인식 모델을 구성하는 노드들 중 일부는, 최초 입력 노드로부터의 거리들에 기초하여, 하나의 레이어(layer)를 구성할 수 있다. 예를 들어, 최초 입력 노드로부터 거리가 n인 노드들의 집합은, n 레이어를 구성할 수 있다. 최초 입력 노드로부터 거리는, 최초 입력 노드로부터 해당 노드까지 도달하기 위해 거쳐야 하는 링크들의 최소 개수에 의해 정의될 수 있다. 그러나, 이러한 레이어의 정의는 설명을 위한 임의적인 것으로서, 인지 기능 상태 인식 모델 내에서 레이어의 차수는 상술한 것과 상이한 방법으로 정의될 수 있다. 예를 들어, 노드들의 레이어는 최종 출력 노드로부터 거 리에 의해 정의될 수도 있다. 최초 입력 노드는 신경망 내의 노드들 중 다른 노드들과의 관계에서 링크를 거치지 않고 데이터가 직접 입력되 는 하나 이상의 노드들을 의미할 수 있다. 또는, 인지 기능 상태 인식 모델 내에서, 링크를 기준으로 한 노드 간의 관계에 있어서, 링크로 연결된 다른 입력 노드들을 가지지 않는 노드들을 의미할 수 있다. 이와 유사하게, 최종 출력 노드는 신경망 내의 노드들 중 다른 노드들과의 관계에서, 출력 노드를 가지지 않는 하나 이상의 노 드들을 의미할 수 있다. 또한, 히든 노드는 최초 입력 노드 및 최후 출력 노드가 아닌 신경망을 구성하는 노드 들을 의미할 수 있다. 본 개시의 몇몇 실시예에 따른 인지 기능 상태 인식 모델은 출력 레이어의 노드의 개수가 입력 레이어의 노드의 개수보다 많을 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 증가하는 형태의 신경망 일 수 있다. 그리고, 입력 레이어의 노드 각각에 제1 디지털 바이오 마커 데이터가 입력될 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 인지 기능 상태 인식 모델은 딥 뉴럴 네트워크 구조를 가질 수 있다. 딥 뉴럴 네트워크(DNN: deep neural network, 심층신경망)는 입력 레이어와 출력 레이어 외에 복수의 히든 레이 어를 포함하는 신경망을 의미할 수 있다. 딥 뉴럴 네트워크를 이용하면 데이터의 잠재적인 구조(latent structures)를 파악할 수 있다. 딥 뉴럴 네트워크는 컨볼루션 뉴럴 네트워크(CNN: convolutional neural network), 리커런트 뉴럴 네트워크 (RNN: recurrent neural network), 오토 인코더(auto encoder), 제한 볼츠만 머신(RBM: restricted boltzmann machine), 심층 신뢰 네트워크(DBN: deep belief network), Q 네트워크, U 네트워크, 샴 네트워크, 적대적 생 성 네트워크(GAN: Generative Adversarial Network) 등을 포함할 수 있다. 전술한 딥 뉴럴 네트워크의 기재는 예시일 뿐이며 본 개시는 이에 제한되지 않는다. 본 개시의 인지 기능 상태 인식 모델은 교사 학습(supervised learning) 방식으로 학습될 수 있다. 다만, 이에 한정되는 것은 아니고, 인지 기능 상태 인식 모델은 비교사 학습(unsupervised learning), 반교사학습(semi supervised learning), 또는 강화학습(reinforcement learning) 중 적어도 하나의 방식으로 학습될 수도 있다. 인지 기능 상태 인식 모델의 학습은 인지 기능 상태 인식 모델이 사용자의 인지 기능 상태를 식별하는 동작을 수행하기 위한 지식을 뉴럴 네트워크에 적용하는 과정일 수 있다. 인지 기능 상태 인식 모델은 출력의 오류를 최소화하는 방향으로 학습될 수 있다. 인지 기능 상태 인식 모델의 학습에서 반복적으로 학습 데이터(학습용 테스트 결과 데이터)를 인지 기능 상태 인식 모델에 입력시키고 학습 데이터에 대한 인지 기능 상태 인식 모델의 출력(뉴럴 네트워크를 통해 예측된 스코어 값)과 타겟(라벨 데이터 로 사용된 스코어 값)의 에러를 계산하고, 에러를 줄이기 위한 방향으로 인지 기능 상태 인식 모델의 에러를 인 지 기능 상태 인식 모델의 출력 레이어에서부터 입력 레이어 방향으로 역전파(backpropagation)하여 인지 기능 상태 인식 모델의 각 노드의 가중치를 업데이트 하는 과정이다. 업데이트 되는 각 노드의 연결 가중치는 학습률(learning rate)에 따라 변화량이 결정될 수 있다. 입력 데이터 에 대한 인지 기능 상태 인식 모델의 계산과 에러의 역전파는 학습 사이클(epoch)을 구성할 수 있다. 학습률은 인지 기능 상태 인식 모델의 학습 사이클의 반복 횟수에 따라 상이하게 적용될 수 있다. 예를 들어, 인지 기능 상태 인식 모델의 학습 초기에는 높은 학습률을 사용하여 인지 기능 상태 인식 모델이 빠르게 일정 수준의 성능 을 확보하도록 하여 효율성을 높이고, 학습 후기에는 낮은 학습률을 사용하여 정확도를 높일 수 있다. 인지 기능 상태 인식 모델의 학습에서 학습 데이터는 실제 데이터(즉, 학습된 인지 기능 상태 인식 모델을 이용 하여 처리하고자 하는 데이터)의 부분집합일 수 있으며, 따라서, 학습 데이터에 대한 오류는 감소하나 실제 데 이터에 대해서는 오류가 증가하는 학습 사이클이 존재할 수 있다. 과적합(overfitting)은 이와 같이 학습 데이 터에 과하게 학습하여 실제 데이터에 대한 오류가 증가하는 현상이다. 과적합은 머신러닝 알고리즘의 오류를 증가시키는 원인으로 작용할 수 있다. 이러한 과적합을 막기 위하여 다양 한 최적화 방법이 사용될 수 있다. 과적합을 막기 위해서는 학습 데이터를 증가시키거나, 레귤라이제이션 (regularization), 학습의 과정에서 네트워크의 노드 일부를 비활성화하는 드롭아웃(dropout), 배치 정규화 레 이어(batch normalization layer)의 활용 등의 방법이 적용될 수 있다. 단계(S120)에서 사용자의 인지 기능 상태가 결정된 경우, 장치의 프로세서는 사용자의 인지 기능 상 태에 대응하는 인지 강화 훈련 콘텐츠가 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야 기할 수 있다(S130). 여기서, 인지 강화 훈련 콘텐츠는 제2 애플리케이션에서 챗봇 시스템으로부터 수신한 메시 지 형태로 제공될 수 있다. 구체적으로, 장치의 프로세서는 사용자의 인지 기능 상태가 결정된 경우, 사용자의 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠를 사용자에게 제공할 콘텐츠로 결정할 수 있다. 그리고, 프로세서는 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠를 사용자 단말기에 전송하도록 통신부를 제어할 수 있 다. 여기서, 인지 강화 훈련 콘텐츠는 저장부에 저장된 복수의 인지 강화 훈련 콘텐츠 중 사용자의 인지 기능 상태에 대응하는 콘텐츠일 수 있다. 예를 들어, 장치의 프로세서는 사용자의 인지 기능 상태에 기초하여 사용자의 6개의 인지 영역 중 사 용자에게 부족하다고 결정된 인지 영역 향상을 목표로 하는 인지 강화 훈련 콘텐츠를 저장부에 저장된 복 수의 인지 강화 훈련 콘텐츠 중에서 선택할 수 있다. 그리고, 프로세서는 상기 선택된 인지 강화 훈련 콘 텐츠를 사용자에게 제공할 인지 강화 훈련 콘텐츠로 결정할 수 있다. 즉, 프로세서는 사용자의 인지 기능 상태에 기초하여 복수의 인지 영역 중 사용자에게 부족한 적어도 하나의 인지 영역을 결정할 수 있고, 저장부에 저장된 복수의 인지 강화 훈련 콘텐츠 중 적어도 하나의 인지 영역을 향상시키는 콘텐츠를 사용자에게 제공할 인지 강화 훈련 콘텐츠로 결정할 수 있다. 그리고, 프로세서는 통신부를 제어하여 사용자의 인지 기 능 상태에 대응하는 인지 강화 훈련 콘텐츠를 사용자 단말기에 전송할 수 있다. 한편, 프로세서는 상기 결정된 콘텐츠를 사용자 단말기에 전송하도록 통신부를 제어할 수 있다. 이 경우, 사용자 단말기의 프로세서는 상기 콘텐츠를 통신부를 통해 수신한 후 사용자 단말기 에 설치된 제2 애플리케이션을 통해 제공할 수 있다. 좀더 구체적으로, 사용자 단말기의 프로세서는 상기 결정된 콘텐츠를 포함하는 신호를 장치로부 터 통신부를 통해 수신할 수 있다. 프로세서는 신호를 수신한 경우, 제2 애플리케이션을 통해 사용자 에게 알림(예를 들어, 메시지 수신 알림)을 제공할 수 있다. 그리고, 프로세서는 사용자가 알림에 반응하 여 제2 애플리케이션을 실행하는 경우, 신호에 포함된 콘텐츠를 챗봇 시스템으로부터 수신한 메시지 형태로 제2 애플리케이션을 통해 제공할 수 있다. 본 개시의 몇몇 실시예에 따르면, 장치의 프로세서는 사용자의 인지 기능 상태에 대응하는 인지 강화 훈련 콘텐츠를 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기한 후에 기 설정된 시간 간격마다 이전에 제공된 인지 강화 훈련 콘텐츠와 난이도, 콘텐츠의 종류 및 콘텐츠 수 중 적어도 하나 상이한 인지 강화 훈련 콘텐츠가 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기할 수 있다. 일례로, 장치의 프로세서는 인지 강화 훈련 콘텐츠가 사용자 단말기에 설치된 제2 애플리케이션 을 통해 제공되도록 야기한 후 사용자로부터 훈련 결과 데이터를 수신할 수 있다. 여기서, 훈련 결과 데이터는, 기 설정된 개수의 인지 강화 훈련 콘텐츠에 대한 정답률에 대한 정보를 포함할 수 있다. 따라서, 프로세서(11 0)는 사용자에게 이전에 제공된 인지 강화 훈련 콘텐츠에 대한 정답률이 기 설정된 정도를 초과하는지 여부에 기초하여 기 설정된 시간이 경과한 후에 제공될 인지 강화 훈련 콘텐츠의 난이도를 변경할지 여부를 결정할 수 있다. 즉, 프로세서는 기 설정된 시간 간격으로 인지 강화 훈련 콘텐츠를 제공하되, 이전에 제공된 인지 강화 훈련 콘텐츠에 대한 정답률이 기 설정된 정도(예를 들어, 80%)를 초과하는지 여부에 기초하여 차 회에 제 공될 인지 강화 훈련 콘텐츠의 난이도를 변경할 수 있다. 다른 일례로, 장치의 프로세서는 인지 강화 훈련 콘텐츠가 사용자 단말기에 설치된 제2 애플리 케이션을 통해 제공되도록 야기한 후 사용자로부터 훈련 결과 데이터를 수신할 수 있다. 여기서, 훈련 결과 데 이터는, 사용자가 제공받아서 실행한 인지 강화 콘텐츠의 종류에 대한 정보(예를 들어, 6개의 인지 영역 중 어 느 인지 영역의 강화를 목표로 하는 콘텐츠인지에 대한 정보)를 포함할 수 있다. 따라서, 프로세서는 사용 자에게 이전에 제공된 인지 강화 훈련 콘텐츠와 다른 종류의 인지 강화 훈련 콘텐츠를 기 설정된 시간이 경과한 후에 제공될 인지 강화 훈련 콘텐츠로 결정할 수 있다. 또 다른 일례로, 장치의 프로세서는 인지 강화 훈련 콘텐츠가 사용자 단말기에 설치된 제2 애플 리케이션을 통해 제공되도록 야기한 후 사용자로부터 훈련 결과 데이터를 수신할 수 있다. 여기서, 훈련 결과 데이터는, 인지 강화 훈련 콘텐츠에 포함된 콘텐츠의 수에 대한 정보를 포함할 수 있다. 따라서, 프로세서(11 0)는 사용자에게 이전에 제공된 인지 강화 훈련 콘텐츠와 콘텐츠의 수가 다른 인지 강화 훈련 콘텐츠를 기 설정 된 시간이 경과한 후에 제공할 수 있다. 상술한 바와 같이, 인지 강화 훈련 콘텐츠를 사용자의 인지 기능 상태에 따라 결정하여 사용자에게 제공하는 경 우, 사용자에게 적합한 인지 강화 훈련 콘텐츠를 제공할 수 있어 사용자의 인지 예비능을 빠르게 향상시킬 수 있다. 도 3 내지 도 12는 본 개시의 몇몇 실시예에 따라 사용자 단말기가 제1 디지털 바이오 마커 데이터를 획득하기 위해 수행하는 테스트의 일례를 설명하기 위한 도면들이다. 도 3 내지 도 12와 관련하여 도 1 내지 도 2에서 상 술한 내용과 중복되는 내용은 다시 설명하지 않고 이하 차이점을 중심으로 설명한다. 도 3은 본 개시의 몇몇 실시예에 따라 스트루프 테스트를 실행하는 방법의 일례를 설명하기 위한 도면이다. 도 3을 참조하면, 사용자 단말기에서 스트루프 테스트가 실행되는 경우, 사용자 단말기의 화면 상에 스트루프 테스트와 관련된 화면이 디스플레이될 수 있다. 여기서, 스트루프 테스트는 사용자 단말기에 설치된 제1 애플리케이션을 통해서 실행될 수 있다. 구체적으로, 사용자 단말기의 사용자가 사용자 단말기에 설치된 제1 애플리케이션을 이용하여 스트루 프 테스트를 실행하는 경우, 사용자 단말기는 장치에 스트루프 테스트 실행과 관련된 신호를 전송할 수 있다. 장치는 스트루프 테스트 실행과 관련된 신호를 수신한 경우, 사용자 단말기 상에 스트루프 테스트와 관련된 화면이 디스플레이될 수 있도록 야기할 수 있다. 예를 들어, 장치의 프로세서는 사용자의 사용자 단말기가 제1 개수(예를 들어, 4개)의 숫자 텍 스트(예를 들어, \"1\")를 제1 영역에 디스플레이하는 것과 연동하여 제2 영역에 제1 개수를 나타내는 제1 숫자(예를 들어, \"4\")가 표시되는 제1 버튼과 제1 개수와 상이한 제2 숫자(예를 들어, \"1\", \"2\", \" 3\")가 표시되는 적어도 하나의 제2 버튼을 디스플레이하도록 야기할 수 있다. 여기서, 제1 영역은 화 면 상의 좌측 영역, 제2 영역은 화면 상의 우측 영역일 수 있으나, 이에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 사용자 단말기에 스트루프 테스트와 관련된 화면이 디스플레이되는 경우, 테스트 내용과 관련된 메시지가 임의의 영역에 디스플레이될 수 있다. 여기서, 사용자는 메시지를 통해 주어진 과제가 무엇인지 인지할 수 있다. 더불어, 사용자 단말기는 디스플레이부를 통해 메시지를 화 면 상에 디스플레이하는 것과 연동하여 음향 출력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함 된 내용을 설명하는 음성)을 출력할 수도 있다. 상술한 바와 같이, 메시지와 함께 음향으로 주어진 과제가 무엇 인지 사용자에게 인지시키는 경우 사용자가 실수로 오답을 선택할 가능성이 낮아질 수 있다. 한편, 제1 버튼 및 적어도 하나의 제2 버튼 중 어느 하나의 버튼을 선택하는 제1 선택 입력에 따라 정답 여부가 결정될 수 있다. 예를 들어, 제1 선택 입력이 제1 버튼을 선택하는 입력이라고 인식한 경우 정답이라고 결정될 수 있고, 제 1 선택 입력이 적어도 하나의 제2 버튼을 선택하는 입력이라고 인식된 경우 오답이라고 결정될 수 있다. 본 개시의 몇몇 실시예에 따르면, 스트루프 테스트는 숫자 텍스트의 제1 개수와 숫자 텍스트(N)를 변경하면서 기 설정된 횟수만큼 수행될 수 있다. 예를 들어, 기 설정된 횟수가 2회인 경우, 사용자 단말기는 4개의 숫자 텍스트(예를 들어, \"1\")를 제1 영 역에 디스플레이할 수 있다. 그리고, 제1 선택 입력에 따라 정답인지 여부가 결정될 수 있다. 그 다음, 사 용자 단말기는 3개의 다른 숫자 텍스트(예를 들어, \"2)를 제1 영역에 디스플레이할 수 있다. 그리고, 제1 선택 입력에 따라 정답인지 여부가 다시 결정될 수 있다. 이러한 방식으로 스트루프 테스트가 2회만큼 수행 될 수 있다. 상술한 예시는 일 예시에 불과할 뿐 본 개시가 이에 한정되는 것은 아니다. 도 3에서 제시하는 스트루프 테스트는 제1 영역에 제시되는 숫자 텍스트의 개수를 선택하는 것이다. 하지 만, 이에 한정되는 것은 아니고 스트루프 테스트는 제1 영역에 제시되는 숫자 텍스트와 동일한 숫자 텍스 트를 선택하는 것을 과제로 제시할 수도 있다. 이 경우, 선택 입력이 사용자 단말기에서 제1 영역에 디스플레이된 숫자 텍스트와 동일한 숫자 텍스트가 표시되는 버튼을 선택하는 선택 입력이라고 인식된 경우 정 답이라고 결정할 수 있고, 선택 입력이 제1 영역에 디스플레이된 숫자 텍스트와 상이한 숫자 텍스트가 표 시되는 버튼을 선택하는 선택 입력이라고 인식된 경우 오답이라고 결정할 수 있다. 한편, 스트루프 테스트를 통해 획득되는 테스트 결과 데이터는 스트루프 테스트를 기 설정된 횟수만큼 수행한 총 소요 시간에 대한 정보, 정답이라고 결정된 횟수에 대한 정보, 오답이라고 결정된 횟수에 대한 정보, 스트루 프 테스트를 실행한 횟수 대비 정답을 맞힌 횟수와 관련된 정답률에 대한 정보 및 스트루프 테스트를 위한 화면 이 디스플레이된 후 복수의 버튼 중 어느 하나를 선택하는 선택 입력을 수신할 때까지 소요된 응답 시간 정보 중 적어도 하나를 포함할 수 있다. 다만, 본 개시에서 사용자의 인지 기능 상태를 결정하기 위해 사용되는 제1 디지털 바이오 마커 데이터는 정답률에 대한 정보 및 응답 시간 정보만 포함할 수 있다. 즉, 제1 애플리케이션 은 사용자의 치매 단계 선별을 위해 사용되는 애플리케이션이지만 제1 애플리케이션을 통해 획득된 정보 중 적 어도 일부는 사용자의 인지 기능 상태를 결정할 때 사용될 수 있다. 한편, 스트루프 테스트와 관련된 화면에 포함된 적어도 하나의 요소는 숫자 텍스트(N) 및 복수의 버튼(501, 502)을 포함할 수 있다. 여기서, 숫자 텍스트(N) 및 복수의 버튼(501, 502)의 크기는 기 설정된 크기(고령자가 쉽게 인식할 수 있는 크기) 이상을 가질 수 있다. 이와 같이 적어도 하나의 요소가 기 설정된 크기 이상을 가질 경우, 고령자들도 쉽게 테스트를 진행할 수 있다. 도 4는 본 개시의 몇몇 실시예에 따라 계산력 테스트를 실행하는 방법의 일례를 설명하기 위한 도면이다. 도 4를 참조하면, 사용자 단말기에서 계산력 테스트가 실행되는 경우, 사용자 단말기의 화면 상에 계 산력 테스트와 관련된 화면이 디스플레이될 수 있다. 여기서, 계산력 테스트는 사용자 단말기에 설치된 제 1 애플리케이션을 통해서 실행될 수 있다. 구체적으로, 사용자 단말기의 사용자가 사용자 단말기에 설치된 제1 애플리케이션을 이용하여 계산력 테스트를 실행하는 경우, 사용자 단말기는 장치에 계산력 테스트 실행과 관련된 신호를 전송할 수 있 다. 장치는 계산력 테스트 실행과 관련된 신호를 수신한 경우, 사용자 단말기 상에 계산력 테스트와 관련된 화면이 디스플레이될 수 있도록 야기할 수 있다. 예를 들어, 장치의 프로세서는 사용자의 사용자 단말기가 제1 수학식(F1)을 포함하는 버튼 , 제2 수학식(F2)을 포함하는 버튼 및 기 설정된 텍스트를 포함하는 버튼을 디스플레이하 도록 야기할 수 있다. 기 설정된 텍스트를 포함하는 버튼은 제1 수학식(F1)을 포함하는 버튼과 제2 수학식(F2)을 포함 하는 버튼 사이에 배치될 수 있다. 기 설정된 텍스트를 포함하는 버튼이 상술한 위치에 배치되 는 경우 사용자가 실수로 오답을 선택할 가능성이 낮아질 수 있다. 다만, 본 개시는 이에 한정되는 것은 아니다. 기 설정된 텍스트는 제1 수학식(F1)의 결과 값과 제2 수학식(F2)의 결과 값이 동일하다는 것을 나타내는 텍스트일 수 있다. 예를 들어, 제5 버튼에는 \"같다\"라는 기 설정된 텍스트가 포함될 수 있다. 다만, 이에 한정되는 것은 아니다. 제1 수학식(F1) 및 제2 수학식(F2)은 다양한 종류의 수학식을 포함할 수 있다. 예를 들어, 제1 수학식(F1) 및 제2 수학식(F2)은 적어도 두개의 숫자에 대해 덧셈, 뺄셈, 곱셈, 나눗셈 등을 하는 수학식일 수 있다. 다만, 이 에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 사용자 단말기에 계산력 테스트와 관련된 화면이 디스플레이되는 경우, 테스트 내용과 관련된 메시지가 임의의 영역에 디스플레이될 수 있다. 여기서, 사용자는 메시지를 통해 주어진 과제가 무엇인지 인지할 수 있다. 더불어, 사용자 단말기는 디스플레이부를 통해 메시지를 화면 상에 디스 플레이하는 것과 연동하여 음향 출력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함된 내용을 설 명하는 음성)을 출력할 수도 있다. 상술한 바와 같이, 메시지와 함께 음향으로 주어진 과제가 무엇인지 사용자 에게 인지시키는 경우 사용자가 실수로 오답을 체크할 가능성이 낮아질 수 있다. 한편, 복수의 버튼(503, 504, 505) 중 어느 하나의 버튼을 선택하는 선택 입력에 따라 정답 여부가 결정될 수 있다. 구체적으로, 제1 수학식의 결과 값과 제2 수학식의 결과 값의 비교 결과에 기초하여 선택 입력의 정답 여부가 결정될 수 있다. 도 4와 같이 제1 수학식(F1)의 결과 값이 제2 수학식(F2)의 결과 값 보다 큰 경우, 선택 입력에 따라 제1 수학 식(F1)을 포함하는 버튼이 선택되었다고 인식되면 정답이라고 결정될 수 있다. 그리고, 선택 입력에 따라 제1 수학식(F1)을 포함하는 버튼 이외의 버튼들(504, 505) 중 어느 하나가 선택되었다고 인식되면 오답이 라고 결정될 수 있다. 상술한 바와 같이 정답을 결정하는 이유는 계산력 테스트에서 제시하는 과제가 더 큰 결 과 값을 갖는 수학식을 고르는 것이기 때문이다. 따라서, 과제가 변경되면 그에 따라 정답도 변경될 수 있다. 즉, 더 작은 결과 값을 갖는 수학식을 고르는 것이 계산력 테스트에서 제시하는 과제인 경우 그에 따라 정답도 변경될 수 있다. 본 개시의 몇몇 실시예에 따르면, 계산력 테스트는 제1 수학식(F1)과 제2 수학식(F2)을 변경하면서 기 설정된 횟수만큼 수행될 수 있다. 본 개시의 몇몇 실시예에 따르면, 프로세서는, 계산력 테스트를 수행하기에 앞서 사용자가 계산력 테스트 내용을 확인할 수 있도록 예비 테스트를 수행할 수 있다. 여기서, 예비 테스트는 상술한 계산력 테스트와 동일 한 방식으로 진행되기 때문에 이에 대한 자세한 설명은 생략한다. 한편, 상술한 계산력 테스트를 통해 획득되는 테스트 결과 데이터는 계산력 테스트를 기 설정된 횟수만큼 수행 한 총 소요 시간에 대한 정보, 정답이라고 결정된 횟수에 대한 정보, 오답이라고 결정된 횟수에 대한 정보, 계 산력 테스트를 실행한 횟수 대비 정답을 맞힌 횟수와 관련된 정답률에 대한 정보 및 계산력 테스트를 위한 화면 이 디스플레이된 후 복수의 버튼 중 어느 하나를 선택하는 선택 입력을 수신할 때까지 소요된 응답 시간 정보중 적어도 하나를 포함할 수 있다. 다만, 본 개시에서 사용자의 인지 기능 상태를 결정하기 위해 사용되는 제1 디지털 바이오 마커 데이터는 정답률에 대한 정보 및 응답 시간 정보만 포함할 수 있다. 즉, 제1 애플리케이션 은 사용자의 치매 단계 선별을 위해 사용되는 애플리케이션이지만 제1 애플리케이션을 통해 획득된 정보 중 적 어도 일부는 사용자의 인지 기능 상태를 결정할 때 사용될 수 있다. 한편, 계산력 테스트와 관련된 화면에 포함된 적어도 하나의 요소는 텍스트, 복수의 수학식(F1, F2) 및 복 수의 버튼(503, 504)을 포함할 수 있다. 여기서, 텍스트, 복수의 수학식(F1, F2) 및 복수의 버튼(503, 504)의 크기는 기 설정된 크기(고령자가 쉽게 인식할 수 있는 크기) 이상을 가질 수 있다. 이와 같이 적어도 하 나의 요소가 기 설정된 크기 이상을 가질 경우, 고령자들도 쉽게 테스트를 진행할 수 있다. 도 5는 본 개시의 몇몇 실시예에 따라 기억력 테스트를 수행하는 방법의 일례를 설명하기 위한 도면이다. 사용자 단말기에서 기억력 테스트가 실행되는 경우, 사용자 단말기 의 화면 상에 기억력 테스트와 관 련된 화면이 디스플레이될 수 있다. 여기서, 기억력 테스트는 사용자 단말기에 설치된 제1 애플리케이션을 통해서 실행될 수 있다. 구체적으로, 사용자 단말기의 사용자가 사용자 단말기에 설치된 제1 애플리케이션을 이용하여 기억력 테스트를 실행하는 경우, 사용자 단말기는 장치에 기억력 테스트 실행과 관련된 신호를 전송할 수 있 다. 장치는 기억력 테스트 실행과 관련된 신호를 수신한 경우, 사용자 단말기 상에 기억력 테스트와 관련된 화면이 디스플레이될 수 있도록 야기할 수 있다. 예를 들어, 도 5의 (a)를 참조하면, 장치의 프로세서는 사용자의 사용자 단말기가 기 설정된 시 간(예를 들어, 10초) 동안 적어도 두개의 객체(O1, O2)를 디스플레이하도록 야기할 수 있다. 그리고, 도 5의 (b)를 참조하면, 프로세서는 사용자 단말기가 적어도 두개의 객체 중 제1 객체를 제3 영역 상에 디스플레이하고, 적어도 두개의 객체 중 제2 객체와 적어도 두개의 객체(701, 702)와 상이한 적어도 하나의 추가 객체를 제4 영역 상에 디스플레이하도록 야기할 수 있다. 본 개시의 적어도 두개의 객체(701, 702) 각각은 형상 및/또는 모양이 서로 상이할 수 있다. 예를 들어, 적어도 두개의 객체는 제1 형상을 갖는 제1 객체와 제1 형상과 상이한 제2 형상을 갖는 제2 객체를 포함할 수 있다. 본 개시의 적어도 하나의 추가 객체 각각은 적어도 두개의 객체(701, 702) 각각과 형상 및/또는 모양이 서 로 상이할 수 있다. 더불어, 적어도 하나의 추가 객체 각각은 서로 형상 및/또는 모양이 상이할 수 있다. 제3 영역은 화면 상의 좌측에 위치할 수 있고, 제4 영역은 화면 상의 우측에 위치할 수 있다. 다만, 이에 한정되는 것은 아니다. 도 5의 (a)를 다시 참조하면, 기억력 테스트가 수행됨에 따라 사용자 단말기에 디스플레이되는 화면 상에 는 현재 디스플레이되는 화면을 통해 사용자가 수행해야하는 작업을 알려주는 내용의 메시지가 디스플레이될 수 있다. 예를 들어, 메시지는 현재 화면 상에 디스플레이되고 있는 적어도 두개의 객체(701, 702)를 기억하라는 내용을 포함할 수 있다. 도 5의 (b)를 다시 참조하면, 사용자 단말기에 디스플레이되는 화면 상에는 현재 디스플레이되는 화면을 통해 사용자가 수행해야하는 작업을 알려주는 내용의 메시지가 디스플레이될 수 있다. 예를 들어, 메시지는 디 스플레이 된 화면에서 제3 영역에 디스플레이 된 제1 객체와 같이 포함됐던 제2 객체를 선택하 라는 내용을 포함할 수 있다. 더불어, 사용자 단말기는 디스플레이부를 통해 메시지를 화면 상에 디스플레이하는 것과 연동하여 음향 출 력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함된 내용을 설명하는 음성)을 출력할 수도 있다. 상술한 바와 같이, 메시지와 함께 음향으로 사용자가 수행해야하는 작업을 사용자에게 인지시키는 경우 사용자 가 현재 수행해야 되는 작업이 무엇인지 명확하게 인지할 수 있다. 한편, 제4 영역 상에 디스플레이된 복수의 객체(702, 703) 중 어느 하나를 선택하는 선택 입력에 따라 정 답 여부가 결정될 수 있다. 일례로, 상기 선택 입력이 제2 객체를 선택하는 입력이라고 인식된 경우, 정답이라고 결정될 수 있다. 다른 일례로, 상기 선택 입력이 적어도 하나의 추가 객체 중 어느 하나를 선택하는 입력이라고 인식된 경 우, 오답이라고 결정될 수 있다. 본 개시의 몇몇 실시예에 따르면, 기억력 테스트는, 적어도 두개의 객체(701, 702)와 적어도 하나의 추가 객체 를 변경하면서 기 설정된 횟수만큼 수행할 수 있다. 여기서, 복수의 객체(701, 702, 703)를 변경할 때 복 수의 객체 전부를 변경할 수도 있고, 복수의 객체(701, 702, 703) 중 적어도 일부를 변경할 수도 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 제4 영역 상에 디스플레이된 복수의 객체(702, 703) 중 어느 하나를 선 택하는 선택 입력이 수신된 경우, 복수의 객체 전부에 대한 선택 입력이 비활성화될 수 있다. 이 경우, 사용자 가 무의식 중에 터치 입력을 하여 실수로 오답을 체크하는 경우를 방지할 수 있다. 본 개시의 몇몇 실시예에 따르면, 프로세서는, 기억력 테스트를 수행하기에 앞서 사용자가 기억력 테스트 와 관련된 내용을 확인할 수 있도록 예비 테스트를 수행할 수 있다. 여기서, 예비 테스트는 상술한 기억력 테스 트와 동일한 방식으로 진행되기 때문에 이에 대한 자세한 설명은 생략한다. 한편, 상술한 기억력 테스트를 통해 획득되는 테스트 결과 데이터는 기억력 테스트를 기 설정된 횟수만큼 수행 한 총 소요 시간에 대한 정보, 정답이라고 결정된 횟수에 대한 정보, 오답이라고 결정된 횟수에 대한 정보, 기 억력 테스트를 실행한 횟수 대비 정답을 맞힌 횟수와 관련된 정답률에 대한 정보 및 기억력 테스트와 관련된 화 면을 디스플레이한 후 제4 영역 상에 디스플레이된 객체들(702, 703) 중 어느 하나를 선택하는 선택 입력 을 수신할 때까지 소요된 응답 시간 정보 중 적어도 하나를 포함할 수 있다. 다만, 본 개시에서 사용자의 인지 기능 상태를 결정하기 위해 사용되는 제1 디지털 바이오 마커 데이터는 정답률에 대한 정보 및 응답 시간 정보 만 포함할 수 있다. 즉, 제1 애플리케이션은 사용자의 치매 단계 선별을 위해 사용되는 애플리케이션이지만 제1 애플리케이션을 통해 획득된 정보 중 적어도 일부는 사용자의 인지 기능 상태를 결정할 때 사용될 수 있다. 한편, 기억력 테스트와 관련된 화면에 포함된 적어도 하나의 요소는 복수의 객체(701, 702, 703)를 포함할 수 있다. 여기서, 복수의 객체(701, 702, 703)의 크기는 기 설정된 크기(고령자가 쉽게 인식할 수 있는 크기) 이상 을 가질 수 있다. 이와 같이 적어도 하나의 요소가 기 설정된 크기 이상을 가질 경우, 고령자들도 쉽게 테스트 를 진행할 수 있다. 도 6 내지 도 8는 본 개시의 몇몇 실시예에 따라 시선 테스트를 수행하는 방법의 일례를 설명하기 위한 도면이 다. 도 6을 참조하면, 장치의 프로세서는 시선 테스트를 진행하기에 앞서 사용자 단말기에 디스플레 이되는 화면의 중앙 영역 상에 특정 객체가 디스플레이도록 야기할 수 있다. 일례로, 장치의 프로세서는 중앙 영역 상에 특정 객체가 포함된 화면을 생성하여 사용자 단말기에 전송할 수 있다. 이 경우, 사용자 단말기는 특정 객체가 중앙 영역 상에 포함된 화면을 디스플레이할 수 있다. 다른 일례로, 사용자 단말기의 저장부에 특정 객체가 중앙 영역 상에 포함된 화면이 저장 되어 있을 수 있다. 사용자 단말기의 프로세서는 장치에서 저장부에 저장되어 있는 상기 화면을 디스플레이하라는 신호를 통신부를 통해 수신한 경우, 사용자 단말기에 상기 화면을 디스플레 이하도록 디스플레이부를 제어할 수 있다. 또 다른 일례로, 사용자 단말기의 저장부에 특정 객체의 이미지가 저장되어 있을 수 있다. 이 경우, 장치의 프로세서가 통신부를 통해 특정 객체가 포함된 화면을 디스플레이하라는 신 호를 사용자 단말기에 전송한 경우, 사용자 단말기의 프로세서가 중앙 영역 상에 특정 객 체가 포함된 화면을 생성하여 디스플레이할 수 있다. 다만, 상술한 예시들을 일례에 불과하므로, 본 개시는 상술한 예시들에 한정되는 것은 아니다. 본 개시에서 특정 객체는 사용자의 시선이 디스플레이되는 화면의 중앙에 올 수 있도록 유도하는 객체일 수 있다. 예를 들어, 제1 객체는 십자가 형상을 갖는 객체일 수 있다. 다만, 특정 객체는 상술한 예 시에 한정되는 것은 아니고 다양한 형상 또는 모양을 가질 수 있다. 한편, 본 개시에서 특정 객체는 중앙 영역에 위치할 수 있다. 따라서, 특정 객체를 응시하는 사 용자의 시선은 화면의 중앙으로 올 수 있다. 다만, 이에 한정되는 것은 아니다. 한편, 본 개시의 몇몇 실시예에 따르면, 사용자 단말기에 디스플레이되는 화면 상에는 현재 디스플레이되 는 화면을 통해 사용자가 수행해야하는 작업이 무엇인지 알려주는 내용의 메시지가 디스플레이될 수 있다. 예를들어, 메시지는 현재 화면 상에 디스플레이되고 있는 특정 객체를 쳐다보라는 내용을 포함할 수 있다. 더 불어, 사용자 단말기는 디스플레이부를 통해 메시지를 화면 상에 디스플레이하는 것과 연동하여 음향 출력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함된 내용을 설명하는 음성)을 출력할 수도 있 다. 이와 같이, 메시지와 함께 음향을 출력하여 사용자가 수행해야하는 작업을 사용자에게 인지시키는 경우 사 용자가 현재 수행해야하는 작업이 무엇인지 명확하게 이해할 수 있다. 따라서, 단순 실수로 잘못된 작업을 수행 할 가능성이 낮아질 수 있다. 한편, 장치의 프로세서는 특정 객체를 화면의 중앙 영역 상에 디스플레이한 경우, 기 설정 된 조건이 만족되는지 여부를 확인할 수 있다. 일례로, 사용자 단말기는 디스플레이되는 화면의 중앙 영역 상에 특정 객체가 디스플레이되는 것(제1 태스크를 수행하는 것)과 연동하여 사용자 단말기의 사용자의 눈이 포함된 영상을 영상 획득부(예를 들 어, 카메라)를 통해 획득할 수 있다. 사용자 단말기에서 영상을 분석하여 기 설정된 조건이 만족되는지 여 부를 확인할 수 있다. 그리고, 사용자 단말기에서 기 설정된 조건이 만족되었다고 인식된 경우, 사용자 단 말기의 프로세서는 통신부를 통해 기 설정된 조건이 만족되었다는 신호를 장치에 전송할 수 있다. 이 경우, 장치는 기 설정된 조건이 만족되었다고 인식할 수 있다. 다른 일례로, 사용자 단말기는 디스플레이되는 화면의 중앙 영역 상에 특정 객체가 디스플레이 되는 것(제1 태스크를 수행하는 것)과 연동하여 사용자 단말기의 사용자의 눈이 포함된 영상을 영상 획득부를 통해 획득할 수 있다. 사용자 단말기는 획득된 영상을 장치에 전송하도록 통신부를 제어할 수 있다. 장치의 프로세서는 통신부를 통해 사용자의 눈이 포함된 영상을 수신한 경우, 상기 영상 을 분석하여 기 설정된 조건이 만족되는지 여부를 확인할 수 있다. 다만, 상술한 예시들은 일 예시에 불과할 뿐 본 개시는 상술한 예시들에 한정되는 것은 아니다. 기 설정된 조건은, 특정 객체가 디스플레이되는 동안 획득된 영상을 분석하여 사용자가 특정 객체를 기 설정된 시간 동안 응시하고 있다고 인식된 경우 만족될 수 있다. 한편, 장치는 기 설정된 조건이 만족되었다고 인식한 경우, 사용자 단말기의 화면에 특정 객체 대신 적어도 하나의 객체가 디스플레이되도록 야기할 수 있다. 도 6에서 도시된 특정 객체를 포함하는 화면이 디스플레이된 상태에서 기 설정된 조건이 만족된 경우 다음 과 같은 작업이 수행될 수 있다. 도 7을 참조하면, 장치는 기 설정된 조건이 만족되었다고 인식한 경우, 사용자 단말기가 제1 객체 , 제2 객체 및 텍스트(T)를 포함하는 화면을 디스플레이하도록 야기할 수 있다. 이 경우, 사용자 단 말기는 특정 객체 대신 텍스트(T)를 중앙 영역 상에 디스플레이하는 것과 연동하여 중앙 영역 의 양 사이드 영역(432, 433) 각각에 제1 객체 및 제2 객체를 디스플레이할 수 있다. 즉, 적어 도 하나의 객체는 중앙 영역에 표시되는 텍스트(T)와 양 사이드 영역(432, 433) 각각에 표시되는 제1 객체 및 제2 객체를 포함할 수 있다. 여기서, 제1 객체, 제2 객체 및 텍스트(T)를 포함하는 화 면은 2000ms 동안 디스플레이될 수 있다. 다만, 이에 한정되는 것은 아니다. 제1 객체 및 제2 객체는 동일한 형상(예를 들어, 직경이 0.2cm인 원형 형상 등)을 갖고 색체만 서로 상이할 수 있다. 이 경우, 제1 객체 및 제2 객체 중 어느 하나의 객체는 텍스트(T)가 의미하는 색상 을 가질 수 있고, 다른 객체는 텍스트(T)가 의미하는 색상과 다른 색상을 가질 수 있다. 다만, 이에 한정되는 것은 아니고, 제1 객체 및 제2 객체는 서로 다른 형상을 갖고 색체도 상이할 수도 있다. 텍스트(T)는 색상 또는 형상을 의미하는 단어일 수 있다. 다만, 텍스트(T)의 의미는 상술한 예시에 한정되는 것 은 아니다. 만약, 텍스트(T)의 의미가 색상과 관련된 경우, 텍스트(T) 자체의 색상은 텍스트(T)가 의미하는 색상과 동일할 수도 있고 상이할 수도 있다. 다만, 이에 한정되는 것은 아니다. 한편, 본 개시의 몇몇 실시예에 따르면, 사용자 단말기에 디스플레이되는 화면 상에는 사용자가 수행해야 하는 기 설정된 시선 과제가 무엇인지 알려주는 내용의 메시지가 디스플레이될 수 있다. 여기서, 기 설정된 시 선 과제는 사용자가 어떤 객체를 응시해야 하는지를 나타낼 수 있다. 몇몇 실시예에 따르면, 기 설정된 시선 과제는 제1 객체 및 제2 객체 중 텍스트(T)의 의미와 관련된 객체를 응시하는 과제일 수 있다. 이 경우, 텍스트(T)의 의미는 형상과 관련될 수도 있고, 색상과 관련될 수도 있다. 다만, 텍스트(T)의 의미는 상술한 예시에 한정되는 것은 아니다. 일례로, 텍스트(T)가 빨강을 의미하고, 제1 객체는 빨간색을 갖고 제2 객체는 파란색을 가질 수 있다. 그리고, 화면에 디스플레이되는 메시지는 텍스트(T)가 가리키는 색상의 객체를 응시하라는 내용을 포함할 수 있다. 이 경우, 사용자가 제1 객체를 응시하는 것이 사용자가 기 설정된 과제를 올바르게 수행하는 것 일 수 있다. 다른 일례로, 텍스트(T)가 원을 의미하고, 제1 객체는 원형 형상을 갖고 제2 객체는 사각형 형상을 가질 수 있다. 그리고, 화면에 디스플레이되는 메시지는 텍스트(T)가 가리키는 형상의 객체를 응시하라는 내용 을 포함할 수 있다. 이 경우, 사용자가 제1 객체를 응시하는 것이 사용자가 기 설정된 과제를 올바르게 수 행하는 것일 수 있다. 다른 몇몇 실시예에 따르면, 기 설정된 시선 과제는 제1 객체 및 제2 객체 중 텍스트(T)의 의미와 관 련 없는 객체를 응시하는 과제일 수 있다. 이 경우, 텍스트(T)의 의미는 형상과 관련될 수도 있고, 색상과 관련 될 수도 있다. 다만, 텍스트(T)의 의미는 상술한 예시에 한정되는 것은 아니다. 일례로, 텍스트(T)가 빨강을 의미하고, 제1 객체는 빨간색을 갖고 제2 객체는 파란색을 가질 수 있다. 그리고, 화면에 디스플레이되는 메시지는 텍스트(T)가 가리키는 색상을 갖지 않는 객체를 응시하라는 내 용을 포함할 수 있다. 이 경우, 사용자가 제2 객체를 응시하는 것이 사용자가 기 설정된 과제를 올바르게 수행하는 것일 수 있다. 다른 일례로, 텍스트(T)가 원을 의미하고, 제1 객체는 원형 형상을 갖고 제2 객체는 사각형 형상을 가질 수 있다. 그리고, 화면에 디스플레이되는 메시지는 텍스트(T)가 가리키는 형상을 갖지 않는 객체를 응시하 라는 내용을 포함할 수 있다. 이 경우, 사용자가 제2 객체를 응시하는 것이 사용자가 기 설정된 과제를 올 바르게 수행하는 것일 수 있다. 또 다른 몇몇 실시예에 따르면, 기 설정된 시선 과제는 제1 객체 및 제2 객체 중 텍스트(T) 자체의 색상과 관련된 객체를 응시하는 과제일 수 있다. 이 경우, 텍스트(T) 자체의 색상은 텍스트(T)의 의미와 상이할 수도 있고, 텍스트(T)의 의미와 동일할 수도 있다. 일례로, 텍스트(T)가 빨강을 의미하고, 텍스트(T)의 색상이 빨간색일 수 있고, 제1 객체는 빨간색을 갖고 제2 객체는 파란색을 가질 수 있다. 그리고, 화면에 디스플레이되는 메시지는 텍스트(T)의 색상을 갖는 객 체를 응시하라는 내용을 포함할 수 있다. 이 경우, 사용자가 제1 객체를 응시하는 것이 사용자가 기 설정 된 과제를 올바르게 수행하는 것일 수 있다. 다른 일례로, 텍스트(T)가 빨강을 의미하고, 텍스트(T)의 색상이 텍스트(T)의 의미와 상이한 파란색일 수 있고, 제1 객체는 빨간색을 갖고 제2 객체는 파란색을 가질 수 있다. 그리고, 화면에 디스플레이되는 메시 지는 텍스트(T)의 색상을 갖는 객체를 응시하라는 내용을 포함할 수 있다. 이 경우, 사용자가 제2 객체를 응시하는 것이 사용자가 기 설정된 과제를 올바르게 수행하는 것일 수 있다. 또 다른 몇몇 실시예에 따르면, 기 설정된 시선 과제는 제1 객체 및 제2 객체 중 텍스트(T) 자체의 색상과 관련 없는 객체를 응시하는 과제일 수 있다. 이 경우, 텍스트(T) 자체의 색상은 텍스트(T)의 의미와 상 이할 수도 있고, 텍스트(T)의 의미와 동일할 수도 있다. 일례로, 텍스트(T)가 빨강을 의미하고, 텍스트(T)의 색상이 빨간색일 수 있고, 제1 객체는 빨간색을 갖고 제2 객체는 파란색을 가질 수 있다. 그리고, 화면에 디스플레이되는 메시지는 텍스트(T)의 색상을 갖지 않 는 객체를 응시하라는 내용을 포함할 수 있다. 이 경우, 사용자가 제2 객체를 응시하는 것이 사용자가 기 설정된 과제를 올바르게 수행하는 것일 수 있다. 다른 일례로, 텍스트(T)가 빨강을 의미하고, 텍스트(T)의 색상이 텍스트(T)의 의미와 상이한 파란색일 수 있고, 제1 객체는 빨간색을 갖고 제2 객체는 파란색을 가질 수 있다. 그리고, 화면에 디스플레이되는 메시 지는 텍스트(T)의 색상을 갖지 않는 객체를 응시하라는 내용을 포함할 수 있다. 이 경우, 사용자가 제1 객체 를 응시하는 것이 사용자가 기 설정된 과제를 올바르게 수행하는 것일 수 있다. 도 6에서 도시된 특정 객체를 포함하는 화면이 디스플레이된 상태에서 기 설정된 조건이 만족된 경우 도 7 에서 상술한 작업과 다른 다음과 같은 작업이 수행될 수 있다. 도 8을 참조하면 장치의 프로세서는 사용자 단말기가 중앙 영역과 상이한 제2 영역(R2) 및 제3 영역(R3) 중 어느 하나의 영역에 시선 유도 객체를 디스플레이하도록 야기할 수 있다. 이 경우, 사용자 단말기는 제1 객체를 디스플레이하는 것 대신 중앙 영역과 상이한 제2 영역(R2) 또는 제3 영역(R3)에 시선 유도 객체(O4)를 디스플레이할 수 있다. 즉, 적어도 하나의 객체는, 제1 영역과 상이한 제2 영역(R2) 및 제3 영역(R3) 중 어느 하나의 영역에 디스플레이되는 시선 유도 객체(O4)를 포함할 수 있다. 좀더 구체적으로, 도 8의 (a) 및 (b)를 참조하면, 기 설정된 조건이 만족되는 경우 사용자 단말기에 디스 플레이되는 화면은 도 6의 중앙 영역과 상이한 제2 영역(R2) 및 제3 영역(R3) 중 어느 하나의 영역(R2)에 디스플레이되는 시선 유도 객체(O4)를 포함할 수 있다. 여기서, 제2 영역(R2) 및 제3 영역(R3) 중 어느 하나의 영역은 랜덤하게 선택될 수 있고, 시선 유도 객체(O4)를 포함하는 화면은 2000ms 동안 디스플레이될 수 있다. 다만, 이에 한정되는 것은 아니다. 시선 유도 객체(O4)는 기 설정된 형상(예를 들어, 직경이 0.2cm인 원형 형상 등)과 기 설정된 색체(예를 들어, 빨간색)을 갖는 객체일 수 있다. 중앙 영역은 제2 영역(R2) 및 제3 영역(R3) 사이에 위치할 수 있다. 즉, 제2 영역(R2) 및 제3 영역(R3)이 정중앙에 위치하는 중앙 영역의 양 측면에 위치할 수 있다. 다만, 이에 한정되는 것은 아니다. 한편, 본 개시의 몇몇 실시예에 따르면, 사용자 단말기에 디스플레이되는 화면 상에는 사용자가 수행해야 하는 기 설정된 시선 과제가 무엇인지 알려주는 내용의 메시지(M3, M4)가 디스플레이될 수 있다. 여기서, 기 설 정된 시선 과제는 사용자가 어떤 객체를 응시해야 하는지를 나타낼 수 있다. 도 8의 (a)를 참조하면, 기 설정된 시선 과제는 시선 유도 객체(O4)를 응시하는 과제일 수 있다. 그리고, 화면 에 디스플레이되는 메시지(M3)는 시선 유도 객체(O4)를 빠르게 응시하라는 내용을 포함할 수 있다. 이 경우, 사 용자가 시선 유도 객체(O4)를 응시하는 것이 사용자가 기 설정된 과제를 올바르게 수행하는 것일 수 있다. 도 8의 (b)를 참조하면, 기 설정된 시선 과제는 시선 유도 객체(O4)가 위치하는 방향과 반대 방향을 응시하는 과제일 수 있다. 그리고, 화면에 디스플레이되는 메시지(M4)는 시선 유도 객체(O4)를 빠르게 응시하라는 내용을 포함할 수 있다. 이 경우, 사용자가 시선 유도 객체(O4)의 반대 방향의 임의의 지점을 응시하는 것이 사용자가 기 설정된 과제를 올바르게 수행하는 것일 수 있다. 한편, 사용자 단말기는 디스플레이부를 통해 메시지(M3 또는 M4)를 화면 상에 디스플레이하는 것과 연동하여 음향 출력부를 통해 메시지(M3 또는 M4)와 관련된 음향(예를 들어, 메시지(M3 또는 M4) 내에 포함된 내용을 설명하는 음성)을 출력할 수도 있다. 이와 같이, 메시지(M3 또는 M4)와 함께 음향으로 사용자가 수행해 야하는 기 설정된 시선 과제를 사용자에게 인지시키는 경우 사용자가 현재 수행해야하는 기 설정된 시선 과제가 무엇인지 명확하게 이해할 수 있다. 따라서, 단순 실수로 잘못된 시선 과제를 수행할 가능성이 낮아질 수 있다. 결과적으로, 기 설정된 시선 과제는 시선 유도 객체를 응시하는 과제 및 시선 유도 객체가 위치하는 방향과 반 대 방향을 응시하는 과제 중 적어도 하나를 포함할 수 있다. 그리고, 화면에 디스플레이되는 메시지(M3 또는 M4)에는 기 설정된 시선 과제가 무엇인지에 대한 내용이 포함될 수 있다. 한편, 사용자 단말기는 디스플레이부를 통해 메시지를 화면 상에 디스플레이하는 것과 연동하여 음향 출력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함된 내용을 설명하는 음성)을 출력할 수도 있 다. 이와 같이, 메시지와 함께 음향으로 사용자가 수행해야하는 기 설정된 시선 과제를 사용자에게 인지시키는 경우 사용자가 현재 수행해야하는 기 설정된 시선 과제가 무엇인지 명확하게 이해할 수 있다. 따라서, 단순 실 수로 잘못된 시선 과제를 수행할 가능성이 낮아질 수 있다. 장치의 프로세서는 시선 테스트를 기 설정된 횟수(예를 들어, 5회)만큼 수행하도록 야기할 수 있다. 즉, 프로세서는 사용자 단말기에 도 6에 도시된 화면이 디스플레이되도록 야기한 후에 사용자의 시선 이 중앙을 응시한다고 인식된 경우, 도 7 또는 도 8에 도시된 화면이 사용자 단말기에 디스플레이되도록 야기하는 태스크를 기 설정된 횟수만큼 수행할 수 있다. 본 개시와 같이 시선 테스트를 진행하기 전에 사용자의 시선이 중앙에 오도록 만들 경우, 사용자가 기존에 사용 하고 있는 사용자 단말기에 별도의 구성요소를 추가하지 않더라도 정확하게 사용자의 치매 단계를 식별할 수 있다. 한편, 치매 환자가 아닌 일반인이 중앙을 응시하고 있지 않다가 화면의 좌측 또는 우측에 표시되는 객체를 응시 해야 하는 경우 시선이 빠르게 움직이지 못해 치매가 아닌 사람이 치매라고 결정될 수 있다. 따라서, 사용자가중앙을 응시하고 있다가 화면의 좌측 또는 우측에 표시되는 객체를 응시해야 치매 단계 식별의 정확도가 향상될 수 있다. 따라서, 본 개시는 텍스트, 적어도 하나의 객체가 포함된 화면이 디스플레이되기 전에 사용자가 중앙 을 응시할 수 있도록 특정 객체가 중앙에 포함된 화면이 디스플레이될 수 있다. 한편, 본 개시의 몇몇 실시예에 따르면, 장치의 프로세서는 시선 테스트가 기 설정된 횟수만큼 수행 되는 동안 사용자와 관련된 시선 정보를 획득할 수 있다. 여기서, 시선 정보는 사용자의 치매 단계를 식별하기 위한 디지털 바이오 마커(디지털 장치로부터 획득되는 바이오 마커)로 사용될 수 있다. 상술한 시선 테스트를 통해 획득되는 테스트 결과 데이터는 시선 정보를 포함할 수 있다. 여기서, 시선 정보는, 사용자가 기 설정된 시선 과제를 올바르게 수행한 횟수에 대한 정보, 사용자가 기 설정된 시선 과제를 올바르게 수행하지 못한 횟수에 대한 정보, 사용자의 시선이 기 설정된 시간 동안 특정 지점을 계속해서 응시하고 있는지 에 대한 정보, 적어도 하나의 객체가 포함된 화면이 디스플레이된 시점부터 사용자의 시선이 적어도 하나의 객 체 중 어느 하나의 객체로 이동한 시점까지 소요된 시간에 대한 정보(사용자의 반응이 지연된 시간에 대한 정보), 사용자의 시선의 이동 속도에 대한 정보 및 사용자의 시선이 기 설정된 시선 과제와 관련된 지점을 정확 하게 응시하고 있는지에 대한 정보 중 적어도 하나를 포함할 수 있다. 본 개시의 몇몇 실시예에 따르면, 프로세서는 시선 테스트를 수행하기에 앞서 사용자가 기 설정된 시선 과 제를 확인할 수 있도록 예비 테스트를 수행할 수 있다. 여기서, 예비 테스트는 상술한 시선 테스트와 동일한 방 식으로 진행되기 때문에 이에 대한 자세한 설명은 생략한다. 한편, 시선 테스트와 관련된 화면에 포함된 적어도 하나의 요소는 적어도 하나의 객체(예를 들어, 도 7의 특정 객체, 텍스트(T) 및 복수의 객체(712, 713) 또는 도 8의 시선 유도 객체(O4))를 포함할 수 있다. 여기서, 적어도 하나의 객체의 크기는 기 설정된 크기(고령자가 쉽게 인식할 수 있는 크기) 이상을 가질 수 있다. 이와 같이 적어도 하나의 요소가 기 설정된 크기 이상을 가질 경우, 고령자들도 쉽게 테스트를 진행할 수 있다. 도 9는 본 개시의 몇몇 실시예에 따라 기억력 테스트를 수행하는 방법의 다른 일례를 설명하기 위한 도면이다. 도 9의 (a)를 참조하면, 장치의 프로세서는 기억력 테스트를 수행하는 경우, 복수의 객체를 포 함하는 N차 화면이 사용자 단말기에 디스플레이되도록 야기할 수 있다. 여기서, N은 1 이상의 자연수일 수 있다. 그리고 복수의 객체(O)는 서로 형상 및 모양 중 적어도 하나가 상이한 객체일 수 있다. 일례로, 장치의 프로세서는 복수의 객체를 포함하는 N차 화면을 생성하여 사용자 단말기에 전송할 수 있다. 이 경우, 사용자 단말기의 프로세서는 복수의 객체가 포함된 N차 화면을 디스 플레이하도록 디스플레이부를 제어할 수 있다. 다른 일례로, 사용자 단말기의 저장부에 복수의 객체가 서로 다른 위치에 배치되어 있는 복수의 화면이 저장되어 있을 수 있다. 사용자 단말기의 프로세서는 장치로부터 복수의 객체를 포 함하는 화면을 디스플레이하라는 신호를 통신부를 통해 수신한 경우, 저장부에 저장된 복수의 화면 중 어느 하나의 화면을 N차 화면으로 디스플레이할 수 있다. 또 다른 일례로, 사용자 단말기의 저장부에 복수의 객체의 이미지가 저장되어 있을 수 있다. 사 용자 단말기의 프로세서는 장치로부터 복수의 객체를 포함하는 화면을 디스플레이하라는 신호를 통신부를 통해 수신한 경우 복수의 객체를 포함하는 N차 화면을 생성하여 디스플레이할 수 있다. 한편, N차 화면은 현재 디스플레이되는 화면을 통해 사용자가 수행해야하는 작업이 무엇인지 알려주는 내용의 메시지를 포함할 수 있다. 예를 들어, N차 화면이 가장 먼저 디스플레이되는 1차 화면인 경우 메시지는 1차 화 면에 포함된 복수의 객체 중 어느 하나를 선택하라는 내용을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 메시지가 디스플레이되는 것과 연동하여 음향 출력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함된 내용을 설명하는 음성)을 출력할 수도 있다. 이와 같이, 메시지와 함께 음 향을 출력하여 사용자가 수행해야하는 작업을 사용자에게 인지시키는 경우 사용자가 현재 수행해야하는 작업이 무엇인지 명확하게 이해할 수 있다. 따라서, 단순 실수로 잘못된 작업을 수행할 가능성이 낮아질 수 있다. 도 9의 (b)를 참조하면, 사용자 단말기의 프로세서는 복수의 객체 중 어느 하나의 객체를 선택하는 N차 선택 입력이 수신할 수 있다. 본 개시에서 프로세서는 N차 선택 입력이 수신된 경우 N차 화면에 대한 추가 선택 입력을 비활성화시킬 수 있다. 여기서, 추가 선택 입력은 N차 화면이 디스플레이된 상태에서 첫번째로 어느 하나의 객체를 선택하는 선 택 입력이 감지된 이후에 추가로 감지된 선택 입력을 의미할 수 있다. 상술한 바와 같이 N차 화면에 대한 추가 선택 입력이 비활성화되는 경우 사용자가 실수로 N차 화면 상의 임의의 영역을 추가로 터치했을 때 발생하게 되는 오류가 감소할 수 있다. 한편, 사용자 단말기의 프로세서는 복수의 객체 중 N차 선택 입력을 통해 선택된 객체에 대해서 기 설정된 효과를 반영하여 디스플레이하도록 디스플레이부를 제어할 수 있다. 예를 들어, 복수의 객체 중 N차 선택 입력을 통해 선택된 객체만 다른 객체와 다른 색상으로 하이라이트될 수 있다. 다 만, 이에 한정되는 것은 아니다. 도 9의 (c)를 참조하면, 장치의 프로세서는 복수의 객체 중 어느 하나를 선택하는 N차 선 택 입력이 감지된 경우, 사용자 단말기에서 복수의 객체가 재배열된 N+1차 화면이 디스플레이되도록 야기 할 수 있다. 일례로, 사용자 단말기의 프로세서는 N차 선택 입력이 감지된 경우, N차 선택 입력이 감지되었다는 N 차 신호를 장치에 전송하도록 통신부를 제어할 수 있다. 여기서, 상기 N차 신호에는 복수의 객체 중 어느 객체가 선택되었는지에 대한 정보가 포함되어 있을 수 있다. 장치의 프로세서는 N차 신호를 수신한 경우, 복수의 객체가 재배열된 N+1차 화면을 생성하여 사용자 단말기에 전송하도록 통신부 를 제어할 수 있다. 사용자 단말기의 프로세서는 통신부를 통해 N+1차 화면을 수신한 경우, N+1차 화면을 디스플레이하도록 디스플레이부를 제어할 수 있다. 다른 일례로, 사용자 단말기의 저장부에는 복수의 객체가 서로 다른 위치에 배치되어 있는 복수 의 화면이 저장되어 있을 수 있다. 사용자 단말기는 N차 선택 입력이 감지된 경우, N차 선택 입력이 감지 되었다는 N차 신호를 장치에 전송할 수 있다. 여기서, 상기 N차 신호에는 복수의 객체 중 어느 객체 가 선택되었는지에 대한 정보가 포함되어 있을 수 있다. 그리고, 프로세서는 저장부에 저장된 복수의 화면 중 이전에 디스플레이되지 않은 화면을 선택하여 디스플레이하도록 디스플레이부를 제어할 수 있다. 이전에 디스플레이되지 않았던 화면이 디스플레이되는 경우, 복수의 객체가 재배열된 화면이 디스플레이되 는 것처럼 보일 수 있다. 또 다른 일례로, 사용자 단말기의 저장부에는 복수의 객체의 이미지가 저장되어 있을 수 있다. 사용자 단말기는 N차 선택 입력이 감지된 경우, N차 선택 입력이 감지되었다는 N차 신호를 장치에 전 송할 수 있다. 여기서, 상기 N차 신호에는 복수의 객체 중 어느 객체가 선택되었는지에 대한 정보가 포함 되어 있을 수 있다. 사용자 단말기의 프로세서는 N차 화면에 디스플레이된 복수의 객체와 다른 위치 에 복수의 객체가 디스플레이되도록 복수의 객체를 재배열한 N+1차 화면을 생성할 수 있다. 그리고, 프로세서 는 N+1차 화면을 디스플레이하도록 디스플레이부를 제어할 수 있다. 도 9의 (a) 및 (c)를 참조하면, N차 화면에 포함된 복수의 객체 각각의 위치는 N+1차 화면에 포함된 복수 의 객체 각각의 위치와 상이할 수 있다. 즉, 프로세서는 N차 화면에 포함된 복수의 객체의 위치를 랜덤하게 변경하여 N+1차 화면에 포함된 복 수의 객체를 재배열시킬 수 있다. 한편, N+1차 화면은 현재 디스플레이되는 화면을 통해 사용자가 수행해야하는 작업이 무엇인지 알려주는 내용의 메시지를 포함할 수 있다. 예를 들어, 메시지는 N+1차 화면에 포함된 복수의 객체 중 이전 화면에서 선택되지 않은 어느 하나의 객체를 선택하라는 내용을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 메시지가 디스플레이되는 것과 연동하여 음향 출력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함된 내용을 설명하는 음성)을 출력할 수도 있다. 이와 같이, 메시지와 함께 음 향을 출력하여 사용자가 수행해야하는 작업을 사용자에게 인지시키는 경우 사용자가 현재 수행해야하는 작업이 무엇인지 명확하게 이해할 수 있다. 따라서, 단순 실수로 잘못된 작업을 수행할 가능성이 낮아질 수 있다. 도 9의 (d)를 참조하면, N+1차 화면에 디스플레이된 복수의 객체 중 어느 하나를 선택하는 N+1차 선택 입력이 감지된 경우, N+1차 선택 입력을 통해 선택된 객체와 적어도 하나의 이전 선택 입력을 통해 선택된 적어도 하나 의 객체가 동일한지 여부에 기초하여 N+1차 선택 입력의 정답 여부가 결정될 수 있다. 일례로, N이 1인 경우, 2차 선택 입력을 통해 선택된 객체와 이전 선택 입력인 1차 선택 입력을 통해 선택된 객 체가 동일한지 여부가 인식될 수 있다. 1차 선택 입력을 통해 선택된 객체가 2차 선택 입력을 통해 선택된 객체와 동일한 경우 오답이라고 결정되고, 1차 선택 입력을 통해 선택된 객체가 2차 선택 입력을 통해 선택된 객체 와 상이한 경우 정답이라고 결정될 수 있다. 다른 일례로, N이 2인 경우, 3차 선택 입력을 통해 선택된 객체가 이전 선택 입력인 1차 선택 입력과 2차 선택 입력을 통해 선택된 복수의 객체와 동일한지 여부를 인식할 수 있다. 1차 선택 입력을 통해 선택된 객체가 2차 선택 입력을 통해 선택된 객체 전부가 3차 선택 입력을 통해 선택된 객체와 상이한 경우 정답이라고 결정될 수 있고, 1차 선택 입력을 통해 선택된 객체와 2차 선택 입력을 통해 선택된 객체 중 어느 하나가 3차 선택 입력을 통해 선택된 객체와 동일한 경우 오답이라고 결정될 수 있다. 한편, 본 개시에서 프로세서는 N+1차 선택 입력이 수신된 경우 N+1차 화면에 대한 추가 선택 입력을 비활 성화시킬 수 있다. 여기서, 추가 선택 입력은 N+1차 화면이 디스플레이된 상태에서 첫번째로 어느 하나의 객체 를 선택하는 선택 입력이 감지된 이후에 추가로 감지된 선택 입력을 의미할 수 있다. 상술한 바와 같이 N+1차 화면에 대한 추가 선택 입력이 비활성화되는 경우 사용자가 실수로 N+1차 화면 상의 임 의의 영역을 추가로 터치했을 때 발생하게 되는 오류가 감소할 수 있다. 한편, 사용자 단말기의 프로세서는 복수의 객체 중 N+1차 선택 입력을 통해 선택된 객체에 대해서 기 설정된 효과를 반영하여 디스플레이하도록 디스플레이부를 제어할 수 있다. 예를 들어, 복수의 객체 중 N+1차 선택 입력을 통해 선택된 객체만 다른 객체와 다른 색상으로 하이라이트될 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 장치의 프로세서는 기억력 테스트를 기 설정된 횟수만큼 수행할 수 있다. 이 경우, 기억력 테스트가 M(1 이상의 자연수)번 더 수행되는 경우 N에 M이 더해질 수 있다. 즉, 프로세 서는 사용자 단말기에 디스플레이되는 화면 상에 포함된 복수의 객체 중 어느 하나를 선택하는 선택 입력을 감지한 경우, 사용자 단말기에 디스플레이된 화면에 포함된 복수의 객체의 위치가 기 설정된 횟수 만큼 계속 변경되도록 야기할 수 있다. 그리고, 프로세서는 적어도 하나의 이전 선택 입력을 통해 선택된 적어도 하나의 객체 전부와 현재 선택 입력을 통해 선택된 객체가 동일한지 여부에 기초하여 현재 선택 입력이 정답인지 여부를 결정할 수 있다. 본 개시의 몇몇 실시예에 따르면, 프로세서는 기억력 테스트를 수행하기 앞서 사용자가 어떤 식으로 테스 트를 수행하면 되는지 확인할 수 있도록 예비 테스트를 수행할 수 있다. 여기서, 예비 테스트는 상술한 기억력 테스트와 동일한 방식으로 진행되기 때문에 이에 대한 자세한 설명은 생략한다. 본 개시의 몇몇 실시예에 따르면, 장치의 프로세서는 기억력 테스트를 수행하는 것과 연동하여 획득 된 사용자의 눈이 포함된 영상에 기초하여 시선 정보를 획득할 수 있다. 여기서, 시선 정보는, 사용자의 시선이 움직이는 순서에 대한 정보, 화면에 디스플레이된 복수의 객체 각각에 대한 사용자의 시선의 유지 여부에 대한 정보 및 복수의 객체 각각에 사용자의 시선이 유지된 시간에 대한 정보 중 적어도 하나를 포함할 수 있다. 상술한 기억력 테스트를 통해 획득되는 테스트 결과 데이터는, 시선 정보, 정답이라고 결정된 횟수에 대한 정보, 오답이라고 결정된 횟수에 대한 정보, 정답률에 대한 정보, N차 화면 또는 N+1차 화면이 디스플레이된 상 태에서 N차 선택 입력 또는 N+1차 선택 입력이 수신될 때까지 소요된 시간에 대한 응답 시간 정보를 포함할 수 있다. 다만, 본 개시에서 사용자의 인지 기능 상태를 결정하기 위해 사용되는 제1 디지털 바이오 마커 데이터는 시선 정보, 정답률에 대한 정보 및 응답 시간 정보만 포함할 수 있다. 즉, 제1 애플리케이션은 사용자의 치매 단계 선별을 위해 사용되는 애플리케이션이지만 제1 애플리케이션을 통해 획득된 정보 중 적어도 일부는 사용자 의 인지 기능 상태를 결정할 때 사용될 수 있다. 한편, 도 9에서 상술한 기억력 테스트와 관련된 화면에 포함된 적어도 하나의 요소는 복수의 객체를 포함 할 수 있다. 여기서, 복수의 객체의 크기는 기 설정된 크기 이상을 가질 수 있다. 이와 같이 적어도 하나 의 요소가 기 설정된 크기(고령자가 쉽게 인식할 수 있는 크기) 이상을 가질 경우, 고령자들도 쉽게 테스트를 진행할 수 있다. 도 10 내지 도 12은 본 개시의 몇몇 실시예에 따라 혼합 테스트를 수행하는 방법의 일례를 설명하기 위한 도면 이다. 도 10의 (a)를 참조하면, 장치의 프로세서는 혼합 테스트를 수행하는 경우, 문장 포함된 제1 화 면이 사용자 단말기에 디스플레이되도록 야기할 수 있다. 일례로, 장치의 저장부에는 복수의 문장이 저장되어 있을 수 있다. 여기서, 복수의 문장은 서로 다른 단어를 이용하여 육하원칙에 맞게 생성된 문장일 수 있다. 그리고, 복수의 문장의 길이는 서로 상이할 수 있다. 프로세서는 저장부에 저장된 복수의 문장 중 하나의 문장을 선택하여 해당 문장을 디스플레이하라는 신호를 사용자 단말기에 전송하도록 통신부를 제어할 수 있다. 사용자 단말기의 프로세서 는 통신부를 통해 상기 신호를 수신한 경우, 상기 신호에 포함된 문장을 디스플레이하도록 디스플레 이부를 제어할 수 있다. 다른 일례로, 장치의 저장부에는 복수의 단어가 저장되어 있을 수 있다. 여기서, 복수의 단어는 서로 다른 품사와 서로 다른 의미를 갖고 있는 단어일 수 있다. 장치의 프로세서는 기 설정된 알고리즘에 기초하여 복수의 단어 중 적어도 일부를 조합하여 육하원칙에 맞는 문장을 생성할 수 있다. 프로세서는 생 성된 문장을 디스플레이하라는 신호를 사용자 단말기에 전송하도록 통신부를 제어할 수 있다. 사용자 단말기의 프로세서는 통신부를 통해 상기 신호를 수신한 경우, 상기 신호에 포함된 문장을 디스플레이하도록 디스플레이부를 제어할 수 있다. 또 다른 일례로, 사용자 단말기의 저장부에는 복수의 문장이 저장되어 있을 수 있다. 여기서, 복수의 문장은 서로 다른 단어를 이용하여 육하원칙에 맞게 생성된 문장일 수 있다. 그리고, 복수의 문장의 길이는 서 로 상이할 수 있다. 장치의 프로세서는 문장이 포함된 제1 화면을 디스플레이하라는 신호를 사용자 단말기에 전송할 수 있다. 이 경우, 사용자 단말기의 프로세서는 저장부에 저장된 복수의 문장 중 어느 하나의 문장을 선택하여 디스플레이하도록 디스플레이부를 제어할 수 있다. 또 다른 일례로, 사용자 단말기의 저장부에는 복수의 단어가 저장되어 있을 수 있다. 여기서, 복수의 단어는 서로 다른 품사와 서로 다른 의미를 갖고 있는 단어일 수 있다. 장치의 프로세서는 문장이 포 함된 제1 화면을 디스플레이하라는 신호를 사용자 단말기에 전송할 수 있다. 이 경우, 사용자 단말기(20 0)의 프로세서는 기 설정된 알고리즘에 기초하여 저장부에 저장된 복수의 단어 중 적어도 일부를 조 합하여 육하원칙에 맞는 문장을 생성할 수 있다. 그리고, 프로세서는 생성된 문장을 디스플레이하도 록 디스플레이부를 제어할 수 있다. 상술한 예시들은 본 개시의 설명을 위한 예시들에 불과하며, 본 개시는 상술한 예시들에 한정되는 것은 아니다. 한편, 본 개시에서 문장을 포함하는 제1 화면은 녹음 버튼(Br)을 포함할 수 있다. 여기서, 녹음 버튼(Br)은 기 설정된 시간 동안 녹음 버튼에 대한 터치 입력이 비활성화된 상태로 디스플레이될 수 있다. 사용자 단말기의 프로세서는 기 설정된 시간이 경과된 경우, 녹음 버튼(Br)에 대한 터치 입력을 활성 화시킬 수 있다. 일례로, 장치의 프로세서는 제1 화면이 디스플레이된 시점으로부터 기 설정된 시간이 경과되었는지 여부를 확인할 수 있다. 프로세서는 문장이 포함된 제1 화면이 디스플레이된 시점으로부터 기 설정된 시간이 경과했다고 인식한 경우, 사용자 단말기에 녹음 버튼(Br)을 활성화하라는 신호를 전송할 수 있다. 사용자 단말기는 상기 신호를 수신한 경우, 녹음 버튼(Br)에 대한 터치 입력을 활성화할 수 있다. 다른 일례로, 사용자 단말기의 프로세서는 문장이 포함된 제1 화면이 디스플레이된 시점부터 기 설정된 시간이 경과되었는지 여부를 확인할 수 있다. 프로세서는 문장이 포함된 제1 화면이 디스플레 이된 시점으로부터 기 설정된 시간이 경과했다고 인식한 경우, 녹음 버튼(Br)에 대한 터치 입력을 활성화할 수 있다. 다만, 상술한 예시들은 본 개시의 일 예시들을 설명하기 위한 것으로 본 개시가 상술한 예시들에 한정되는 것은 아니다. 한편, 본 개시의 몇몇 실시예에 따르면, 녹음 버튼(Br)에 대한 터치 입력의 활성화와 무관하게 제1 화면에 포함 된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경될 수 있다. 일례로, 프로세서는 사용자 단말기에 제1 화면이 디스플레이된 후 기 설정된 시간이 경과된 경우(예 를 들어, 1~2초) 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경되도록 야기할 수 있다. 이 경우, 녹음 버튼(Br)에 대한 터치 입력은 활성화되어 있을 수도 있고, 비활성화되어 있을 수도 있 다. 좀더 구체적으로, 프로세서는 사용자 단말기에 제1 화면이 디스플레이된 후 기 설정된 시간이 경과되 었는지 여부를 확인할 수 있다. 그리고, 프로세서는 기 설정된 시간이 경과되었다고 인식한 경우, 제1 화 면에 포함된 문장을 구성하는 적어도 하나의 색상을 변경하라는 신호를 사용자 단말기에 전송하도록 통신 부를 제어할 수 있다. 이 경우, 사용자 단말기의 프로세서는 상기 신호를 수신함에 따라 제1 화 면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경되도록 디스플레이부를 제어할 수 있다. 다만, 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상을 순서대로 변경시키는 방법은 상술한 예시에 한정되는 것은 아니다. 다른 일례로, 프로세서는 사용자 단말기에 제1 화면이 디스플레이된 후 바로 제1 화면에 포함된 문장 을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경되도록 야기할 수도 있다. 이 경우, 제1 화면을 디스플 레이하라는 신호에 제1 화면에 포함된 문장을 구성하는 적어도 하나의 색상을 순서대로 변경하라는 신호가 포함 되어 있을 수도 있고, 사용자 단말기에서 제1 화면을 디스플레이할 때 자동으로 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경될 수도 있다. 이 경우, 녹음 버튼(Br)에 대한 터치 입력은 활성화되어 있을 수도 있고, 비활성화되어 있을 수도 있다. 또 다른 일례로, 제1 화면에 포함된 녹음 버튼(Br)의 터치 입력은 처음부터 활성화된 상태를 유지하고 있을 수 있다. 프로세서는 사용자 단말기에 제1 화면이 디스플레이된 후 녹음 버튼(Br)에 터치 입력이 감지되 었다고 인식한 경우, 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경되도록 야 기할 수 있다. 좀더 구체적으로, 사용자 단말기의 프로세서는 제1 화면에 포함된 녹음 버튼(Br)에 대한 터치 입력이 감지된 경우, 녹음 버튼(Br)에 대한 터치가 수행되었다는 정보를 장치에 전송하도록 통신부를 제어할 수 있다. 장치의 프로세서는 사용자 단말기로부터 통신부를 통해 상기 정보를 수신한 경우, 녹음 버튼(Br)에 대한 터치 입력이 감지되었다고 인식할 수 있다. 그리고, 프로세서는 제1 화면에 포함된 문장을 구성하는 적어도 하나의 색상을 변경하라는 신호를 사용자 단말기에 전송하도록 통신부 를 제어할 수 있다. 이 경우, 사용자 단말기의 프로세서는 상기 신호를 수신함에 따라 제1 화면 에 포함된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경되도록 디스플레이부를 제어할 수 있다. 다만, 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상을 순서대로 변경시키는 방법은 상 술한 예시에 한정되는 것은 아니다. 한편, 본 개시의 몇몇 실시예에 따르면, 문장이 포함된 제1 화면은 현재 디스플레이되는 화면을 통해 사용 자가 수행해야하는 작업이 무엇인지 알려주는 내용의 메시지를 포함할 수 있다. 예를 들어, 메시지는 화면에 포 함된 문장을 암기하라는 내용을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 메시지가 디스플레이되는 것과 연동하여 음향 출력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함된 내용을 설명하는 음성)이 출력될 수도 있다. 이와 같이, 메시지와 함께 음 향을 출력하여 사용자가 수행해야하는 작업을 사용자에게 인지시키는 경우 사용자가 현재 수행해야하는 작업이 무엇인지 명확하게 이해할 수 있다. 따라서, 단순 실수로 잘못된 작업을 수행할 가능성이 낮아질 수 있다. 한편, 도 10의 (b)를 참조하면, 녹음 버튼(Br)이 활성화된 후 녹음 버튼(Br)에 대한 터치 입력이 감지된 경우, 사용자 단말기의 프로세서는 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경되도록 디스플레이부를 제어할 수 있다. 여기서, 적어도 하나의 어절의 색상이 순서대로 변 경될 때 텍스트의 색상만 변경될 수도 있고, 도 10의 (b)와 같이 텍스트에 색상이 하이라이트되는 형태로 색상 이 변경될 수도 있다. 일례로, 사용자 단말기의 프로세서는 녹음 버튼(Br)에 대한 터치 입력에 따라 특정 신호를 생성하여 장치에 전송하도록 통신부를 제어할 수 있다. 장치의 프로세서는 상기 특정 신호를 통신부 를 통해 수신한 경우, 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상을 순서대로 변 경하라는 신호를 사용자 단말기에 전송할 수 있다. 사용자 단말기의 프로세서는 상기 신호를 통 신부를 통해 수신한 경우, 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대 로 변경되도록 디스플레이부를 제어할 수 있다. 다른 일례로, 사용자 단말기의 프로세서는 녹음 버튼(Br)에 대한 터치 입력에 따라 녹음 버튼(Br)이 선택되었다는 신호를 장치에 전송하도록 통신부를 제어할 수 있다. 그 다음, 사용자 단말기의프로세서는 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경되도록 디스플레이부를 제어할 수 있다. 즉, 사용자 단말기는 장치로부터 별도의 신호를 수신하지 않고 바로 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절의 색상이 순서대로 변경되도록 디스플레이부 를 제어할 수 있다. 한편, 제1 화면에 포함된 문장을 구성하는 적어도 하나의 어절 중 첫번째 어절부터 순차적으로 색상이 변 경될 수 있다. 예를 들어, 제1 화면에 포함된 문장이 \"영희는 화요일에 도서관에서 동생을 35분동안 만났다.\"인 경우, 프 로세서는 문장의 첫번째 어절(\"영희는\")의 색상이 먼저 변경되도록 디스플레이부를 제어할 수 있다. 그리고, 프로세서는 기 설정된 시간(예를 들어, 1~2초)이 경과된 후에 두번째 어절이 첫번째 어절과 동일한 색상으로 변경되도록 디스플레이부를 제어할 수 있다. 프로세서는 이런 식으로 제1 화면에 포 함된 문장을 구성하는 적어도 하나의 어절 전체의 색상을 순차적으로 변경할 수 있다. 본 개시의 프로세서는 자체적으로 또는 장치로부터 특정 신호를 수신한 경우에 문장의 적어도 하나의 어절의 색상을 순차적으로 변경하도록 디스플레이부를 제어할 수 있다. 제1 화면 상에 문장이 단순히 디스플레이되는 경우 사용자가 문장을 전체적으로 읽지 않을 수도 있다. 하 지만, 상술한 바와 같이 사용자가 녹음 버튼(Br)을 터치함에 따라 문장을 구성하는 적어도 하나의 어절의 색상이 순차적으로 변경되는 경우, 사용자가 문장을 전체적으로 읽을 가능성이 높아진다. 즉, 사용자가 문장 을 전체적으로 읽지 않아서 혼합 테스트가 제대로 수행되지 못하는 문제점이 상술한 실시예를 통해 해결될 수 있다. 한편, 본 개시의 몇몇 실시예에 따르면, 녹음 버튼(Br)에 대한 터치 입력이 감지된 경우, 녹음 버튼(Br)에 기 설 정된 효과가 부가되면서 디스플레이될 수 있다. 예를 들어, 녹음 버튼(Br)을 중심으로 기 설정된 색상이 퍼져 나 가는 형태의 효과가 녹음 버튼(Br)에 부가될 수 있다. 다만, 기 설정된 효과는 상술한 예시에 한정되는 것은 아 니고 다양한 효과가 녹음 버튼(Br)에 부가될 수 있다. 상술한 바와 같이 녹음 버튼(Br)에 대한 터치 입력이 감지 된 경우 녹음 버튼(Br)에 기 설정된 효과가 부가되면 사용자가 현재 녹음이 진행 중이라는 것을 인지할 수 있다. 본 개시의 몇몇 실시예에 따르면, 장치의 프로세서는 녹음 버튼(Br)에 대한 터치 입력이 감지된 경우, 예비 녹음 파일을 획득할 수 있다. 그리고, 프로세서는 사용자 단말기에서 획득된 예비 녹음 파일을 통해 음성 분석이 가능한 상태인지 여부를 인식할 수 있다. 만약, 음성 분석이 불가능한 상태라고 판단 된 경우, 프로세서는 기 설정된 알람을 출력하도록 디스플레이부 및 음향 출력부 중 적어도 하나를 제어할 수 있다. 여기서, 기 설정된 알람은 조용한 곳에서 녹음을 진행하라는 내용과 관련된 알림일 수 있다. 한편, 도 11를 참조하면, 프로세서는 사용자 단말기가 문장을 포함하는 제1 화면 대신 움직이는 객체(Om)를 디스플레이하는 것과 연동하여 사용자의 눈이 포함된 영상을 획득하도록 야기할 수 있다. 이 경우, 사용자의 눈이 포함된 영상을 분석하여 사용자의 시선 변화와 관련된 시선 정보가 획득될 수 있다. 사용자 단말기에 디스플레이되는 움직이는 객체(Om)는 기 설정된 경로(P)를 따라 기 설정된 속도로 특정 방향(D)을 향해 움직일 수 있다. 본 개시에서 움직이는 객체(Om)는 기 설정된 크기의 특정 형상을 갖는 객체일 수 있다. 예를 들어, 움직이는 객 체(Om)는 직경이 0.2cm인 원형 객체일 수 있다. 상술한 크기의 형상을 갖는 객체(Om)가 움직이는 경우, 사용자의 시선이 상기 객체를 따라서 원활하게 움직일 수 있다. 본 개시에서 기 설정된 경로(P)는 코사인(cosine) 파형 또는 사인(sine) 파형을 갖도록 움직이는 경로일 수 있 다. 여기서, 코사인 파형 또는 사인 파형의 진폭(amplitude)은 일정할 수 있다. 다만, 이에 한정되는 것은 아니 다. 기 설정된 속도는 20 deg/sec 내지 40deg/sec인 경우에, 사용자의 시선을 자극하면서 정확하게 사용자의 치매 여부를 식별하기에 적당할 수 있다. 따라서, 기 설정된 속도는 20 deg/sec 내지 40deg/sec일 수 있다. 다만, 이 에 한정되는 것은 아니다. 특정 방향(D)은 화면의 좌측에서 우측을 향하는 방향 또는 화면의 우측에서 좌측을 향하는 방향일 수 있다. 다 만, 이에 한정되는 것은 아니다. 한편, 혼합 테스트는 기 설정된 라운드(round)만큼 수행될 수 있다. 여기서, 움직이는 객체의 속도와 움직이는 객체가 움직이는 방향 중 적어도 하나는 라운드가 변경됨에 따라 변경될 수 있다. 더불어, 혼합 테스트에서 디 스플레이되는 문장도 라운드가 변경됨에 따라 변경될 수 있다. 예를 들어, 첫 라운드에서 혼합 테스트를 수행할 때 움직이는 객체의 속도는 그 다음 라운드에서 혼합 테스트를 수행할 때 움직이는 객체의 속도보다 느릴 수 있다. 그리고, 첫 라운드에서 혼합 테스트를 수행할 때 움직이는 객체가 왼쪽에서 오른쪽 방향으로 움직였다면, 그 다음 라운드에서 혼합 테스트를 수행할 때 움직이는 객체는 왼쪽에서 오른쪽 방향으로 움직일 수 있다. 더불어, 첫 라운드에서 혼합 테스트를 수행할 때의 문장은 제1 길이 의 문장일 수 있고, 다음 라운드에서 혼합 테스트를 수행할 때의 문장은 제1 길이보다 긴 제2 길이의 문장일 수 있다. 다만, 이에 한정되는 것은 아니다. 한편, 도 11에는 도시되지 않았지만, 움직이는 객체가 디스플레이되는 화면은 현재 디스플레이되는 화면을 통해 사용자가 수행해야하는 작업이 무엇인지 알려주는 내용의 메시지를 포함할 수 있다. 예를 들어, 메시지는 움직 이는 객체를 응시하라는 내용을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 메시지가 디스플레이되는 것과 연동하여 음향 출력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함된 내용을 설명하는 음성)이 출력될 수도 있다. 이와 같이, 메시지와 함께 음 향을 출력하여 사용자가 수행해야하는 작업을 사용자에게 인지시키는 경우 사용자가 현재 수행해야하는 작업이 무엇인지 명확하게 이해할 수 있다. 따라서, 단순 실수로 잘못된 작업을 수행할 가능성이 낮아질 수 있다. 한편, 본 개시의 몇몇 실시예에 따르면, 움직이는 객체를 디스플레이하는 것과 연동하여 사용자의 눈이 포함된 영상이 획득될 수 있다. 그리고, 상기 영상을 분석하여 시선 변화와 관련된 시선 정보가 획득될 수 있다. 여기 서, 시선 정보는 사용자의 눈이 포함된 영상에서 분석된 사용자의 동공의 좌표 값을 이용하여 산출될 수 있다. 그리고, 동공의 좌표 값은, 동공의 중심점이 위치하는 지점의 좌표 값일 수도 있고, 동공의 테두리와 관련된 좌 표 값들일 수도 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 시선 정보는 사용자의 눈이 움직인 거리와 움직이는 객체(Om)가 움직인 거리에 기초하여 산출되는 정 확도 정보, 움직이는 객체(Om)가 움직이기 시작한 시점과 사용자의 눈이 움직이기 시작한 시점에 기초하여 산출 되는 레이턴시(latency) 정보 및 사용자의 눈이 움직인 속도와 관련된 속도 정보 중 적어도 하나를 포함할 수 있다. 본 개시에서 정확도 정보는 사용자의 시선이 움직이는 객체(Om)를 정확하게 응시하고 있는지에 대한 정보일 수 있다. 여기서, 정확도 정보는 사용자의 시선이 움직인 거리에 대한 정보와 움직이는 객체(Om)가 움직인 거리에 대한 정보를 이용하여 결정될 수 있다. 구체적으로, 사용자의 시선이 움직인 거리를 움직이는 객체(Om)가 움직인 거리로 나눠서 나오는 값이 1에 가까울수록 사용자의 시선이 움직이는 객체(Om)를 정확하게 응시하고 있다고 인 식할 수 있다. 본 개시에서 레이턴시 정보는 사용자의 반응 속도를 확인하기 위한 정보일 수 있다. 즉, 레이턴시 정보는 움직 이는 객체(Om)가 움직이기 시작한 시점부터 사용자의 눈이 움직이기 시작한 시점까지 소요된 시간에 대한 정보를 포함할 수 있다. 본 개시에서 속도 정보는 사용자의 눈의 움직임 속도를 의미할 수 있다. 즉, 속도 정보는 사용자의 눈동자가 이 동한 거리에 대한 정보와 사용자의 눈동자가 이동할 때 소용되는 시간에 대한 정보에 기초하여 산출될 수 있다. 다만, 이에 한정되는 것은 아니고, 프로세서는 다양한 방법으로 속도 정보를 산출할 수 있다. 예를 들어, 프로세서는 사용자의 시선의 위치 궤적을 생성하고, 위치 궤적을 미분해서 속도 값을 환 원함으로써 속도 정보를 산출할 수 있다. 한편, 도 12의 (a)를 참조하면, 프로세서는 사용자 단말기가 문장이 가려진 제2 화면을 디스플레이하는 것 과 연동하여 녹음 파일을 획득하도록 야기할 수 있다. 여기서, 제2 화면은 문장이 몇 개의 어절로 구성되는지 알 수 있도록 문장을 구성하는 적어도 하나의 어절이 구분되어 가려진 화면일 수 있다. 상술한 바와 같이 적어 도 하나의 어절이 구분되어 가려지는 경우, 사용자가 어절의 개수를 확인할 수 있다. 따라서, 사용자가 이전에 암기했던 문장을 어절의 개수를 확인함으로써 자연스럽게 생각해 낼 수 있다. 본 개시에서 제2 화면은 녹음 버튼(Br)을 포함할 수 있다. 다만, 도 10의 제1 화면이 디스플레이될 때와는 상이 하게 녹음 버튼(Br)은 계속 터치 입력이 활성화된 상태일 수 있다. 본 개시의 몇몇 실시예에서 사용자가 녹음 버튼(Br)을 터치하는 터치 입력이 감지된 경우, 장치의 프로세 서는 사용자 단말기가 녹음 파일을 획득하도록 야기할 수 있다. 한편, 녹음 버튼(Br)에 대한 터치 입력이 감지된 경우, 녹음 버튼(Br)에 기 설정된 효과가 부가되면서 디스플레 이될 수 있다. 예를 들어, 녹음 버튼(Br)을 중심으로 기 설정된 색상이 퍼져나가는 형태의 효과가 녹음 버튼(B r)에 부가될 수 있다. 다만, 기 설정된 효과는 상술한 예시에 한정되는 것은 아니고 다양한 효과가 녹음 버튼 (Br)에 부가될 수 있다. 상술한 바와 같이 녹음 버튼(Br)에 대한 터치 입력이 감지된 경우 녹음 버튼(Br)에 기 설정된 효과가 부가되면 사용자가 현재 녹음이 진행 중이라는 것을 인지할 수 있다. 본 개시의 몇몇 실시예에 따르면, 제2 화면은 현재 디스플레이되는 화면을 통해 사용자가 수행해야하는 작업이 무엇인지 알려주는 내용의 메시지를 포함할 수 있다. 예를 들어, 메시지는 제2 화면에 포함된 문장을 소리내어 말하라는 내용을 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시의 몇몇 실시예에 따르면, 메시지가 디스플레이되는 것과 연동하여 음향 출력부를 통해 메시지와 관련된 음향(예를 들어, 메시지 내에 포함된 내용을 설명하는 음성)이 출력될 수도 있다. 이와 같이, 메시지와 함께 음 향을 출력하여 사용자가 수행해야하는 작업을 사용자에게 인지시키는 경우 사용자가 현재 수행해야하는 작업이 무엇인지 명확하게 이해할 수 있다. 따라서, 단순 실수로 잘못된 작업을 수행할 가능성이 낮아질 수 있다. 한편, 도 12의 (b)를 참조하면, 문장을 구성하는 적어도 하나의 어절 중 특정 어절(A)은 디스플레이되고 특정 어절(A)을 제외한 나머지 어절은 가려지는 형태로 제2 화면이 디스플레이될 수 있다. 여기서, 특정 어절(A)은 서술어가 포함된 어절일 수도 있고 문장의 맨 마지막에 배치되는 어절일 수도 있다. 다만, 이에 한정되는 것은 아니다. 상술한 바와 같이, 특정 어절(A)이 가려지지 않고 제2 화면에 디스플레이되는 경우, 특정 어절(A)은 사용자가 암기한 전체 문장을 기억해내도록 만드는 힌트가 될 수 있다. 사용자가 치매인 경우, 특정 어절(A)이 디스플레이되더라도 사용자는 전체 문장을 기억해낼 수 없다. 하지만, 사용자가 치매가 아닌 경우 특정 어절(A)이 디스플레이되면 사용자는 전체 문장을 기억해낼 수 있다. 따라서, 특정 어절(A)이 제2 화면에서 가려지지 않고 디스플레이된 후 획득된 녹음 파일을 분석하여 사용자의 치매 단계 를 식별하는 디지털 바이오 마커로 활용하는 경우 치매 식별의 정확도가 높아질 수 있다. 한편, 본 개시의 몇몇 실시예에 따르면, 녹음 파일을 이용하여 사용자의 음성과 관련된 음성 관련 정보가 획득 될 수 있다. 여기서, 음성 관련 정보는, 음성 인식 기술을 통해 변환한 텍스트 데이터와 원문 데이터 사이의 유 사도를 나타내는 유사도 정보 및 녹음 파일에 의해 분석된 사용자의 음성 분석 정보 중 적어도 하나를 포함할 수 있다. 먼저, 유사도 정보를 획득하는 방법은 다음과 같다. 음성 인식 기술을 통해 녹음 파일은 텍스트 데이터로 변환될 수 있다. 그리고, 텍스트 데이터와 원문 데이터 사 이의 유사도를 나타내는 유사도 정보가 생성될 수 있다. 여기서, 원문 데이터는 도 10의 제1 화면에 포함된 문 장일 수 있다. 본 개시에서 유사도 정보는 삽입 작업, 삭제 작업 및 대체 작업 중 적어도 하나를 통해 텍스트 데이터를 원문 데이터로 변환 시 수행되는 작업의 횟수에 대한 정보를 포함할 수 있다. 여기서, 작업의 횟수가 많으면 많을수 록 원문 데이터와 텍스트 데이터가 비유사하다고 판단될 수 있다. 삽입 작업은 텍스트 데이터에 적어도 하나의 글자를 삽입하는 작업을 의미할 수 있다. 예를 들어, 텍스트 데이 터가 2개의 글자를 포함하고 있고 원문 데이터가 텍스트 데이터와 동일한 글자를 포함하면서 1개의 글자를 더 포함하고 있는 경우, 원문 데이터에만 포함되어 있는 1개의 글자를 텍스트 데이터에 삽입하는 작업이 삽입 작업 일 수 있다. 삭제 작업은 텍스트 데이터에 포함된 적어도 하나의 글자를 삭제하는 작업을 의미할 수 있다. 예를 들어, 원문 데이터가 2개의 글자를 포함하고 있고 텍스트 데이터가 원문 데이터와 동일한 글자를 포함하면서 1개의 글자를더 포함하고 있는 경우, 원문 데이터에 포함되어 있지 않은 1개의 글자를 텍스트 데이터에서 삭제하는 작업이 삭제 작업일 수 있다. 대체 작업은 텍스트 데이터에 포함된 적어도 하나의 글자를 다른 글자로 대체하는 작업을 의미할 수 있다. 예를 들어, 원문 데이터가 2개의 글자를 포함하고 있고, 텍스트 데이터도 2개의 글자를 포함하되 원문 데이터와 1개 의 글자만 동일한 경우, 원문 데이터와 상이한 텍스트 데이터에 포함된 글자를 원문 데이터와 동일하게 수정하 는 작업이 대체 작업일 수 있다. 본 개시에서 음성 분석 정보는 사용자의 말하기 속도 정보 및 제2 화면이 디스플레이된 시점과 녹음 파일의 녹 음이 시작된 시점에 기초하여 산출된 응답 속도 정보 중 적어도 하나를 포함할 수 있다. 다만, 이에 한정되는 것은 아니다. 본 개시에서 말하기 속도 정보는 사용자가 발화한 단어의 수에 대한 정보와 사용자가 발화를 완료할 때까지 소 요된 총 소요 시간에 대한 정보에 기초하여 산출될 수 있다. 다만, 이에 한정되는 것은 아니고, 프로세서 는 다양한 알고리즘에 기초하여 말하기 속도 정보를 획득할 수 있다. 본 개시에서 응답 속도 정보는 제2 화면이 디스플레이된 시점부터 녹음 파일의 녹음이 시작된 시점까지 소요된 시간을 나타낼 수 있다. 즉, 소요된 시간이 짧은 경우 응답 속도가 빠르다고 인식될 수 있고, 소요된 시간이 긴 경우 응답 속도가 느리다고 인식될 수 있다. 본 개시에서 테스트 결과 데이터는, 시선 정보, 녹음 파일을 음성 인식 기술을 통해 변환한 텍스트 데이터와 원 문 데이터 사이의 유사도를 나타내는 유사도 정보, 사용자의 말하기 속도 정보 및 제2 화면이 디스플레이된 제1 시점과 녹음 파일의 녹음이 시작된 제2 시점에 기초하여 산출된 응답 속도 정보 중 적어도 하나를 포함할 수 있 다. 한편, 혼합 테스트와 관련된 화면에 포함된 적어도 하나의 요소는 문장 및 움직이는 객체(Om)를 포함할 수 있다. 여기서, 문장 및 움직이는 객체(Om)의 크기는 기 설정된 크기(고령자가 쉽게 인식할 수 있는 크기) 이상을 가질 수 있다. 이와 같이 적어도 하나의 요소가 기 설정된 크기 이상을 가질 경우, 고령자들도 쉽게 테 스트를 진행할 수 있다. 본 개시의 몇몇 실시예에 따르면, 프로세서는 혼합 테스트를 수행하기에 앞서 사용자가 혼합 테스트 내용 을 확인할 수 있도록 예비 테스트를 수행할 수 있다. 여기서, 예비 테스트는 상술한 혼합 테스트와 동일한 방식 으로 진행되기 때문에 이에 대한 자세한 설명은 생략한다. 도 3 내지 도 12에서 상술한 테스트는 본 개시의 몇몇 실시예에 따라 제1 디지털 바이오 마커 데이터를 획득하 기 위한 테스트일 수 있다. 한편, 본 개시의 몇몇 실시예에 따르면, 제1 디지털 바이오 마커 데이터를 획득하기 위해서는 도 3 내지 도 12에서 상술한 복수의 테스트를 전부 실행해야 할 수도 있다. 다만, 이에 한정되는 것은 아니다. 한편, 본 개시의 몇몇 실시예에 따르면 장치는 사용자의 뇌 나이 변동 정보를 사용자 단말기에 제공할 수 도 있다. 이는 도 13을 참조하여 좀더 자세히 설명한다. 도 13은 본 개시의 몇몇 실시예에 따라 장치가 사용자 단말기에 사용자의 뇌 나이 변동 정보를 제공하는 방법의 일례를 설명하기 위한 흐름도이다. 도 13과 관련하여 도 1 내지 도 12에서 상술한 바와 중복되는 내용은 다시 설명하지 않으며 이하 차이점을 중심으로 설명한다. 도 13을 참조하면 사용자는 사용자 단말기에 설치된 제1 애플리케이션을 실행한 후 복수의 테스트를 실행 할 수 있다. 이 경우, 사용자 단말기는 제1 애플리케이션을 통해 실행된 복수의 테스트를 수행한 후 획득 된 테스트 결과 데이터를 제1 디지털 바이오 마커 데이터로 획득할 수 있다(S201). 여기서, 제1 디지털 바이오 마커 데이터는 제1 애플리케이션을 이용하여 실행된 복수의 테스트에 대한 정답률에 대한 정보, 복수의 테스트 중 적어도 하나를 통해 획득된 시선 정보, 복수의 테스트 중 적어도 하나를 통해 획득된 음성 관련 정보 및 복 수의 테스트 각각에 대한 응답 시간에 대한 정보를 포함할 수 있다. 단계(S201)에서 사용자 단말기가 제1 디지털 바이오 마커 데이터를 획득한 경우, 사용자 단말기의 프 로세서는 통신부를 제어하여 제1 디지털 바이오 마커 데이터(S202)를 장치에 전송할 수 있다. 장치의 프로세서는 통신부를 통해 사용자 단말기가 전송한 제1 디지털 바이오 마커 데이 터를 수신할 수 있다(S202). 한편, 장치의 프로세서는 제1 디지털 바이오 마커 데이터를 수신한 경우(S202), 제1 디지털 바이오 마커 데이터를 이용하여 제1 뇌 나이를 산출할 수 있다(S203). 여기서, 제1 뇌 나이는 제1 디지털 바이오 마커 데이터를 수신한 제1 시점에서의 사용자 단말기의 사용자의 뇌 나이를 의미할 수 있다. 구체적으로, 장치의 프로세서는 제1 디지털 바이오 마커 데이터를 수신한 경우, 저장부에 저장 된 기 학습된 뇌 나이 산출 모델에 입력할 수 있다. 그리고, 프로세서는 뇌 나이 산출 모델에서 출력된 출 력 값을 이용하여 사용자의 제1 뇌 나이를 산출할 수 있다. 본 개시에서 장치의 저장부에는 기 학습된 뇌 나이 산출 모델이 저장되어 있을 수 있다. 여기서, 기 학습된 뇌 나이 산출 모델은 복수의 테스트에 대한 정답률에 대한 정보, 복수의 테스트 중 적어도 하나에 기초 하여 획득된 시선 정보, 복수의 테스트 중 적어도 하나를 통해 획득된 음성 관련 정보 및 복수의 테스트 각각에 대한 응답 시간에 대한 정보가 입력되었을 때 사용자의 뇌 나이를 산출하는 인공지능 모델일 수 있다. 본 개시에서 뇌 나이 산출 모델은 학습용 데이터에 라벨링 된 라벨 데이터(뇌 나이)와 뇌 나이 산출 모델에서 출력된 예측 데이터(예측되는 뇌 나이) 사이의 차이 값을 역전파(back propagation)하여 신경망의 가중치를 업 데이트하는 방법으로 학습된 인공지능 모델일 수 있다. 뇌 나이 산출 모델을 학습시키는 방법과 뇌 나이 산출 모델의 구조는 인지 기능 상태 인식 모델과 유사하며, 이에 대한 설명은 상술한 바 자세한 설명은 생략한다. 한편, 사용자 단말기의 프로세서는 제1 디지털 바이오 마커 데이터를 장치에 전송한 후(S202), 제1 애플리케이션 및 제2 애플리케이션을 이용하여 제2 디지털 바이오 마커 데이터를 획득할 수 있다(S204). 여 기서, 제2 디지털 바이오 마커 데이터는 제1 시점으로부터 기 설정된 기간(예를 들어, 1주일)이 경과된 제2 시 점까지 제1 애플리케이션 및 제2 애플리케이션을 통해 확보된 데이터로 제2 시점의 사용자의 뇌 나이를 산출하 기 위해 사용되는 데이터일 수 있다. 구체적으로, 제2 디지털 바이오 마커 데이터는, 장치가 제1 시점부터 기 설정된 기간 동안 기 설정된 개수 의 인지 강화 훈련 콘텐츠가 제2 애플리케이션을 통해 제공되도록 야기한 후 사용자 단말기로부터 수신한 훈련 결과 데이터, 장치가 기 설정된 기간 동안 사용자 단말기로부터 수신한 습관 수행 데이터 및 장치 가 제2 시점에 제1 애플리케이션을 이용하여 복수의 테스트가 실행되도록 야기한 후 사용자 단말기로 부터 수신한 테스트 결과 데이터를 포함할 수 있다. 즉, 제2 시점의 뇌 나이는 제2 시점에 제1 애플리케이션을 통해 획득되는 디지털 바이오 마커인 테스트 결과 데이터와 함께 제1 시점에서 제2 시점까지 제2 애플리케이션 을 통해 획득되는 훈련 결과 데이터와 습관 수행 데이터를 포함하는 연속 데이터를 이용하여 산출될 수 있다. 본 개시에서 장치의 프로세서는 제1 시점부터 기 설정된 시간 간격으로 기 설정된 개수의 인지 강화 훈련 콘텐츠가 사용자 단말기의 제2 애플리케이션을 통해 제공되도록 야기할 수 있다. 그리고, 사용자가 사용자 단말기의 제2 애플리케이션을 이용하여 기 설정된 개수의 인지 강화 훈련 콘텐츠를 실행한 경우, 기 설정된 개수의 인지 강화 훈련 콘텐츠 각각의 실행 결과 데이터인 훈련 결과 데이터를 획득할 수 있다. 여기 서, 훈련 결과 데이터는 기 설정된 개수의 인지 강화 훈련 콘텐츠에 대한 정답률에 대한 정보 및 사용자 단말기 에 제공된 기 설정된 개수의 인지 강화 훈련 콘텐츠 중 사용자 단말기에서 실행된 인지 강화 훈련 콘텐츠 의 개수에 기초하여 산출되는 사용률에 대한 정보를 포함할 수 있다. 여기서, 사용률은 장치가 사용자 단 말기에 인지 강화 훈련 콘텐츠를 전송한 횟수 대비 사용자 단말기에서 인지 강화 훈련 콘텐츠를 실행 한 횟수에 기초하여 산출될 수 있다. 본 개시에서 습관 수행 데이터는 습관 수행 데이터 획득 단계들을 통해 획득될 수 있다. 여기서, 습관 수행 데 이터 획득 단계들을 구체적으로 설명하면 다음과 같다. 먼저, 사용자 단말기의 사용자는 사용자 단말기가 복수의 습관 리스트를 제2 애플리케이션을 통해 디스플 레이하는 경우, 복수의 습관 리스트 중 적어도 하나의 습관을 선택할 수 있다. 그리고, 사용자 단말기의 사용자는 자신이 선택한 적어도 하나의 습관과 관련된 상황 정보를 입력할 수 있다. 본 개시에서 복수의 습관 리스트는 인지 예비능 향상을 위한 식이 요법과 관련된 습관, 인지 예비능 향상을 위 한 신체와 관련된 습관, 인지 예비능 향상을 위한 인지 능력과 관련된 습관 및 인지 예비능 향상을 위한 사회 활동과 관련된 습관 중 적어도 하나를 포함할 수 있다. 일례로, 복수의 습관 리스트는, 하루에 견과류 한주먹 챙겨먹기, 물 1L 이상 마시기, 비타민 먹기, 야채 먹기, 생선 먹기 등과 같이 사용자의 식이 요법과 관련된 습관을 포함할 수 있다. 다른 일례로, 복수의 습관 리스트는, 하루에 3번 먼 곳 바라보기, 산책하기, 명상하기, 30분 이상 유산소 운동 하기, 30분 이상 무산소 운동 하기 등과 같이 사용자의 신체와 관련된 습관을 포함할 수 있다. 또 다른 일례로, 복수의 습관 리스트는, 하루에 한번 암산으로 계산 문제 풀기, 어제 했던 3가지 일 떠올리기, 15분 이상 인지 강화 훈련 콘텐츠를 통한 인지 강화 훈련 진행하기, 옆사람한테 사랑한다고 말하기 등과 같이 사용자의 인지 능력과 관련된 습관을 포함할 수 있다. 또 다른 일례로, 복수의 습관 리스트는, 하루에 한번 가족에게 전화하기, 친구와 5분 이상 메신저를 통해 대화 하기, 하루에 한번 편지 쓰기, 하루에 한번 주변 사람에게 작은 선물 주기 등과 같이 사용자의 사회 활동과 관 련된 습관을 포함할 수 있다. 다만, 상술한 바는 습관 리스트에 포함되는 것의 일 예시들일 뿐 상술한 내용에 한정되는 것은 아니다. 한편, 본 개시에서 적어도 하나의 습관과 관련된 상황 정보는 적어도 하나의 습관을 실행하기 위한 상황적 단서 (context cue)를 의미할 수 있다. 즉, 단순한 목표 설정뿐만 아니라 사용자가 처한 상황에서 단서를 제공하여 상황에 대한 반응 조건을 만들어 주는 것이 상황 정보일 수 있다. 예를 들어, 적어도 하나의 습관으로 '하루에 물 1L 마시기'가 선택된 경우, 주변에 '물컵'이라는 큐(cue)를 눈에 보이는 곳에 둘 수 있도록 돕는 것을 의미 할 수 있다. 이는, 실생활에서 활용할 수 있는 개개인의 상황 신호를 설정하여 사용자의 동기(motivation)를 증 진시키기 위한 것이다. 장치의 프로세서는, 사용자 단말기가 복수의 습관 리스트 중 적어도 하나의 습관을 입력 받고 적어도 하나의 습관과 관련된 상황 정보를 사용자로부터 입력 받은 경우, 사용자 단말기로부터 적어도 하 나의 습관에 대한 정보 및 상황 정보를 통신부를 통해 수신할 수 있다. 장치의 프로세서는 적어도 하나의 습관에 대한 정보 및 상황 정보를 수신한 경우, 상황 정보에 기초 하여 메시지를 생성할 수 있다. 예를 들어, 상황 정보에 포함된 큐가 '물컵'인 경우, 물컵을 잘 보이는 곳에 두 라는 내용의 메시지를 생성할 수 있다. 장치의 프로세서는 상기 생성된 메시지가 제2 애플리케이션을 통해 사용자 단말기에서 출력되도 록 야기할 수 있다. 여기서, 제2 애플리케이션은 메신저 애플리케이션일 수 있고, 상기 메시지는 제2 애플리케 이션을 통해 실행되는 챗봇 시스템을 통해서 제공될 수 있다. 따라서, 사용자는 챗봇과 대화하는 형태로 물컵을 잘 보이는 곳에 두라는 내용의 메시지를 제2 애플리케이션을 통해 확인할 수 있다. 한편, 사용자는 자신이 적어도 하나의 습관 중 어느 하나를 수행한 경우 제2 애플리케이션을 통해 챗봇 시스템 을 상대로 텍스트를 입력할 수 있다. 여기서, 사용자가 습관을 수행한 후 입력하는 텍스트는 자신이 습관의 수 행을 완료했음을 암시 또는 직감시키는 문장 또는 단어일 수 있다. 이 경우, 사용자 단말기의 프로세서 는 사용자가 입력한 텍스트를 자연어 처리 기술을 이용하여 분석하여 사용자의 습관이 수행되었는지 여부 를 인식할 수 있다. 그리고, 사용자 단말기의 프로세서는 사용자의 습관이 수행되었다고 인식한 경우, 습관 수행 데이터 즉, 습관의 수행이 완료되었음을 나타내는 데이터를 생성하여 장치에 전송하도록 통신부를 제어할 수 있다. 예를 들어, 사용자가 하루에 물 1L 마시기 습관의 수행을 완료한 경우 제2 애플리케이션을 이용하여 '나 물 다 마셨어'라는 문장을 입력할 수 있다. 이 경우, 사용자 단말기의 프로세서는 사용자에 의해 입력된 ' 나 물 다 마셨어'라는 문장을 분석하여 사용자가 '하루에 물 1L 마시기' 습관의 수행을 완료했다고 인식할 수 있다. 그리고, 사용자 단말기의 프로세서는 습관 수행 데이터를 생성하여 장치에 전송하도록 통 신부를 제어할 수 있다. 결과적으로, 장치의 프로세서는 사용자 단말기가 사용자로부터 적어도 하나의 습관과 관련된 특정 입력을 수신한 경우 생성되는 습관 수행 데이터를 사용자 단말기로부터 수신할 수 있다. 본 개시에서 는 사용자 단말기가 사용자가 입력한 문장을 분석하는 내용만 기재하였으나, 사용자가 입력한 문장이 장치 의 프로세서에 의해 분석되어 습관 수행 데이터가 장치에서 생성될 수도 있다. 본 개시의 몇몇 실시예에 따르면, 습관 수행 데이터가 생성된 경우, 사용자 단말기의 사용자에게 기 설정 된 리워드가 제공될 수 있다. 여기서, 리워드는 사용자가 자신이 선택한 습관을 제대로 수행하는 경우 제공되는 포인트, 스탬프, 호칭, 선물 등 사용자의 의욕을 고취시킬 수 있는 보상을 의미할 수 있으며, 사용자에게 보상 적인 의미로 받아들여질 수 있는 것이면 제한없이 리워드에 포함될 수 있다. 상술한 바와 같이 리워드가 제공되 는 경우 사용자는 인지 예비능 향상을 위한 습관 형성을 위한 동기가 생길 수 있어 사용자의 인지 예비능의 향 상에 도움이 될 수 있다. 본 개시에서 장치의 프로세서는 제1 시점에 제1 애플리케이션을 통해 복수의 테스트가 제1 애플리케 이션을 통해 실행되도록 야기한 후, 기 설정된 기간이 경과된 제2 시점에 다시 복수의 테스트가 제1 애플리케이 션을 통해 실행되도록 야기할 수 있다. 여기서, 제2 시점에 다시 실행되는 복수의 테스트는 제1 시점에 실행한 복수의 테스트와 동일한 유형의 테스트일 수 있다. 다만, 테스트의 구체적인 수행 방법에 있어서 차이가 있을 수 있다. 다만 이에 한정되는 것은 아니다. 한편, 제2 시점에 복수의 테스트를 수행한 경우 획득되는 테스트 결과 데이터는 제1 시점부터 기 설정된 기간이 경과한 후인 제2 시점에 제1 애플리케이션을 이용하여 실행된 복수의 테스트에 대한 정답률에 대한 정보, 복수 의 테스트 중 적어도 하나에 기초하여 획득된 시선 정보, 복수의 테스트 중 적어도 하나를 통해 획득된 음성 관 련 정보 및 복수의 테스트 각각에 대한 응답 시간에 대한 정보를 포함할 수 있다. 즉, 복수의 테스트를 수행한 제1 시점부터 일정 시간이 경과한 후 다시 복수의 테스트를 수행하여 획득된 테스트 결과 데이터가 제2 디지털 바이오 마커 데이터로 사용자의 제2 시점의 뇌 나이를 산출할 때 이용될 수 있다. 한편, 단계(S204)에서 제2 디지털 바이오 마커 데이터가 획득된 경우, 장치의 프로세서는 제2 디지털 바이오 마커 데이터를 이용하여 제2 뇌 나이를 산출할 수 있다(S206). 구체적으로, 장치의 프로세서는 제2 디지털 바이오 마커 데이터를 수신한 경우, 저장부에 저장 된 기 학습된 뇌 나이 산출 모델에 입력할 수 있다. 그리고, 프로세서는 뇌 나이 산출 모델에서 출력된 출 력 값을 이용하여 사용자의 제2 뇌 나이를 산출할 수 있다. 제1 시점에 사용되는 뇌 나이 산출 모델은 제2 시점 에 사용되는 뇌 나이 산출 모델과 상이할 수도 있고, 동일할 수도 있다. 다만, 사용자의 뇌 나이 산출의 정확도 향상을 위해 제1 시점에서 사용되는 뇌 나이 산출 모델은 제2 시점에서 사용되는 뇌 나이 산출 모델과 상이한 것이 적합할 수 있다. 본 개시의 몇몇 실시예에 따르면, 장치의 프로세서는 제2 시점에 제1 애플리케이션을 통해 획득되는 디지털 바이오 마커인 테스트 결과 데이터와 함께 제1 시점에서 제2 시점까지 제2 애플리케이션을 통해 획득되 는 훈련 결과 데이터와 습관 수행 데이터를 포함하는 연속 데이터를 뇌 나이 산출 모델의 입력 데이터로 입력하 여 제2 뇌 나이를 산출할 수 있다. 본 개시에서 장치의 저장부에는 기 학습된 뇌 나이 산출 모델이 저장되어 있을 수 있다. 여기서, 기 학습된 뇌 나이 산출 모델은 기 설정된 기간 동안 기 설정된 개수의 인지 강화 훈련 콘텐츠를 제공한 후 확보된 훈련 결과 데이터, 기 설정된 기간 동안의 습관 수행 데이터 및 훈련 결과 데이터와 습관 수행 데이터를 모두 확보한 후에 복수의 테스트를 실행하여 획득되는 테스트 결과 데이터를 입력하였을 때 사용자의 뇌 나이를 산출 하는 인공지능 모델일 수 있다. 본 개시에서 뇌 나이 산출 모델은 학습용 데이터에 라벨링 된 라벨 데이터(뇌 나이)와 뇌 나이 산출 모델에서 출력된 예측 데이터(예측되는 뇌 나이) 사이의 차이 값을 역전파(back propagation)하여 신경망의 가중치를 업 데이트하는 방법으로 학습된 인공지능 모델일 수 있다. 그리고, 뇌 나이 산출 모델을 학습시키기 위해 사용되는 학습 데이터는 기 설정된 훈련 시간만큼 인지 강화 훈련 콘텐츠를 이용한 사용자들의 데이터일 수 있다. 뇌 나 이 산출 모델을 학습시키는 방법과 뇌 나이 산출 모델의 구조는 인지 기능 상태 인식 모델과 유사하며, 이에 대 한 설명은 상술한 바 자세한 설명은 생략한다. 장치의 프로세서는 단계(S203)에서 산출된 제1 뇌 나이 및 단계(S206)에서 산출된 제2 뇌 나이에 기 초하여 뇌 나이 변동 정보를 생성할 수 있다(S207). 즉, 프로세서는 제1 뇌 나이와 제2 뇌 나이를 비교 분 석하여 제2 시점에 사용자의 뇌 나이의 변동이 있는지, 얼만큼 변동되었는지 등에 대한 정보를 생성할 수 있다. 장치의 프로세서는 단계(S207)에서 뇌 나이 변동 정보를 생성한 경우, 뇌 나이 변동 정보를 사용자 단말기에 전송하도록 통신부를 제어할 수 있다(S208). 사용자 단말기의 프로세서는 통신부 를 통해 뇌 나이 변동 정보를 수신한 경우, 뇌 나이 변동 정보를 제2 애플리케이션을 통해 출력할 수 있다 (S209). 구체적으로, 장치의 프로세서는 뇌 나이 변동 정보를 생성한 경우 뇌 나이 변동 정보를 포함하는 신 호를 사용자 단말기에 전송하도록 통신부를 제어할 수 있다. 사용자 단말기의 프로세서는 상기 신호를 수신한 경우, 제2 애플리케이션을 통해 알림을 제공할 수 있다. 여기서, 알림은 제2 애플리케이션 을 통해 챗봇 서비스로 제공될 수 있다. 일례로, 장치의 프로세서는 제1 뇌 나이와 제2 뇌 나이를 비교하여 뇌 나이의 변동이 있으면, 변동된 정도에 대한 정보가 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기할 수 있다. 여기서, 변동된 정도에 대한 정보는 사용자의 뇌 나이가 몇 살이었고, 현재 몇 살로 변동되어 사용자의 뇌 나이 가 이전보다 어려졌다는 형태의 정보를 포함할 수 있다. 다른 일례로, 장치의 프로세서는 제1 뇌 나이와 제2 뇌 나이를 비교하여 뇌 나이의 변동이 없으면, 뇌 나이가 변동되지 않았다는 정보가 사용자 단말기에 설치된 제2 애플리케이션을 통해 제공되도록 야기할 수 있다. 여기서, 변동되지 않았다는 정보는 사용자의 뇌 나이가 몇 살이었고, 현재 몇 살이고, 뇌 나이의 변동 이 없으므로 인지 강화 훈련 콘텐츠를 좀더 많이 이용하라는 형태의 정보를 포함할 수 있다. 상술한 본 개시의 몇몇 실시예에 따라 뇌 나이 변동 정보를 제공하는 경우, 본 개시의 프로그램에 대한 주 사용 자인 노령층의 참여율을 향상시킬 수 있다. 노령층 사용자의 경우 뇌 나이 변화에 민감하게 반응하기 때문이다. 더불어, 제2 애플리케이션을 통해 챗봇 시스템으로 뇌 나이 정보를 제공하는 경우 엔터테이먼트적 요소가 가미 되어 사용자의 참여율을 증대시킬 수 있다. 한편, 72명의 사용자 각각의 인지 능력 상태에 대응하는 인지 강화 훈련 콘텐츠를 72명의 사용자 각각에게 제공 하고, 한달 동안 하루 평균 29.8분 동안 인지 강화 훈련 콘텐츠를 사용하여 인지 강화 훈련을 수행하도록 하였 다. 그리고, 훈련 전후의 뇌의 MRI 촬영을 수행하여 수행 결과를 비교한 바 있다. 수행 결과를 비교하여 분석해 본 결과 전두엽의 일부 네트워크가 향상되는 경향을 확인하였다. 도 14은 본 개시의 몇몇 실시예에 따른 인지 강화 훈련을 진행하는 경우 발생하는 효과를 설명하기 위한 도면이 다. 도 14의 결과와 관련된 실험을 진행하기 위해 약 30명의 사용자 각각의 인지 능력 상태에 대응하는 인지 강화 훈련 콘텐츠를 약 30명의 사용자 각각이 장기간 사용하도록 하였다. 그리고, 모바일 신경 심리 검사를 인지 강 화 훈련 전후로 실행한 바 있다. 도 14에서 PAL(Paired Associates Learning) 및 DMS(Delayed Matching to Sample)는 고령자의 인지 능력을 측 정하기 위한 CANTAB(Cambridge Neuropsychological Test Automated Battery)이라는 검사 도구의 일부 과제이다. 즉, 약 30명을 대상으로 PAL과 DMS 두가지 영역을 측정하였다. 그리고, 도 14에서 M(SD), t 및 P는 임상 데이터의 평균 값, 유의 확률 및 유의 확률의 영향력으로 보면 된다. 도 14을 살펴보면 약 30명의 사용자를 대상으로 모바일 신경 심리 검사를 수행한 결과 정서와 인지에서 유의미 한 효과를 보인 것을 확인하였다. 상술한 본 발명의 실시예들 중 적어도 하나에 의하면, 사용자의 인지 예비능이 빠르게 향상될 수 있다는 장점이 있다. 본 개시에서 장치는 상기 설명된 몇몇 실시예들의 구성과 방법이 한정되게 적용될 수 있는 것이 아니라, 상기 몇몇 실시예들은 다양한 변형이 이루어질 수 있도록 각 실시예들의 전부 또는 일부가 선택적으로 조합되어 구성될 수도 있다. 본 개시에서 설명되는 다양한 실시예는 예를 들어, 소프트웨어, 하드웨어 또는 이들의 조합된 것을 이용하여 컴 퓨터 또는 이와 유사한 디바이스로 읽을 수 있는 기록매체 내에서 구현될 수 있다. 하드웨어적인 구현에 의하면, 여기에 설명되는 몇몇 실시예는 ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays, 프로세서, 제어기, 마이크로 컨트 롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 개시에서 설명되는 몇몇 실시예가 적어도 하나의 프로세서로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 개시에서 설명되는 절차 및 기능과 같은 몇몇 실시예는 별도의 소프트웨어 모듈들로 구현될 수 있다. 소프트웨어 모듈들 각각은 본 개시에서 설명되는 하나 이상의 기능, 태스크 및 작동 을 수행할 수 있다. 적절한 프로그램 언어로 쓰여진 소프트웨어 애플리케이션으로 소프트웨어 코드(software code)가 구현될 수 있다. 여기서, 소프트웨어 코드는, 저장부에 저장되고, 적어도 하나의 프로세서에 의해 실행될 수 있다. 즉, 적어도 하나의 프로그램 명령이 저장부에 저장되어 있고, 적어도 하나의 프로그 램 명령이 적어도 하나의 프로세서에 의해 실행될 수 있다. 본 개시의 몇몇 실시예에 따른 장치의 적어도 하나의 프로세서가 디지털 바이오 마커에 기초하여 인지 강화 훈 련을 제공하는 방법은 장치에 구비된 적어도 하나의 프로세서가 읽을 수 있는 기록매체에 적어도 하나의 프로세 서가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 적어도 하나의 프로세서가 읽을 수 있는 기록매체는 적어 도 하나의 프로세서에 의해 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록 디바이스를 포함한다. 적어도 하나의 프로세서가 읽을 수 있는 기록 매체의 예로는 ROM(Read Only Memory), RAM(Random Access Memory), CD- ROM, 자기 테이프, 플로피디스크, 광 데이터 저장 디바이스 등이 포함된다. 한편, 본 개시에서 첨부된 도면을 참조하여 설명하였으나, 이는 실시예일 뿐 특정 실시예에 한정되지 아니하며,"}
{"patent_id": "10-2023-0010671", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 변형실시가 가능한 다양한 내용도 청구범위에 따른 권리범위에 속한다. 또한, 그러한 변형실시들이 본 발명의 기술 사상으로부터 개별적으로 이해되어서는 안 된다."}
{"patent_id": "10-2023-0010671", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 다양한 실시예들이 도면들을 참조로 설명되며, 여기서 유사한 참조 번호들은 총괄적으로 유사한 구성 요소들을 지칭하는데 이용된다. 이하의 실시예에서, 설명 목적을 위해, 다수의 특정 세부사항들이 하나 이상의 실시예들의 총체적 이해를 제공하기 위해 제시된다. 그러나, 그러한 실시예(들)가 이러한 구체적인 세부사항들 없이 실시될 수 있음은 명백할 것이다. 도 1은 본 개시의 몇몇 실시예에 따른 인지 강화 훈련을 제공하는 시스템을 설명하기 위한 개략도이다. 도 2는 본 개시의 몇몇 실시예에 따라 인지 강화 훈련 콘텐츠를 제공하는 방법의 일례를 설명하기 위한 흐름도 이다. 도 3 내지 도 12는 본 개시의 몇몇 실시예에 따라 사용자 단말기가 제1 디지털 바이오 마커 데이터를 획득하기 위해 수행하는 테스트의 일례를 설명하기 위한 도면들이다. 도 13은 본 개시의 몇몇 실시예에 따라 장치가 사용자 단말기에 사용자의 뇌 나이 변동 정보를 제공하는 방법의 일례를 설명하기 위한 흐름도이다. 도 14은 본 개시의 몇몇 실시예에 따른 인지 강화 훈련을 진행하는 경우 발생하는 효과를 설명하기 위한 도면이 다."}
