{"patent_id": "10-2022-0150199", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0095801", "출원번호": "10-2022-0150199", "발명의 명칭": "인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법 및 시스템", "출원인": "(주)제이엘케이", "발명자": "김동민"}}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 조직 추출부가 병리영상에서 조직 영역을 추출하는 제1 조직 추출 단계;제1 패치 생성부가 조직 영역을 추출한 상기 병리 영상을 정사각형 조각 형태의 패치들로 분할하는 제1 패치 생성 단계;제1 이미지 전처리부가 상기 패치들에 색상 표준화를 적용하는 제1 이미지 전처리 단계;심각도 예측부가 색상 표준화가 적용된 상기 패치들을 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출하는 심각도 예측 단계; 및패치 선정부가 산출된 상기 심각도 점수를 이용해 심각도가 가장 높은 패치를 선정하여 가시화하는 패치 선정단계;를 포함하는 것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제1 조직 추출 단계는,상기 제1 조직 추출부가 암 영역의 위치를 표시한 상기 병리영상의 RGB(Red, Green, Blue) 값을 HSV(Hue,Saturation, Value) 값으로 변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추출하는 것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 제1 패치 생성 단계는,상기 제1 패치 생성부가 조직 영역을 추출한 상기 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패치들로 분할하고,상기 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미리 지정한픽셀의 크기로 조절하는 것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 심각도 예측 단계는,상기 심각도 예측부가 색상 표준화가 적용된 상기 패치들을 소프트맥스 함수(Softmax Function)를 이용하는 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출하는 것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2023-0095801-3-청구항 1에 있어서,상기 패치 선정 단계는,상기 패치 선정부가 상기 심각도 점수를 설정된 임계치 값을 통해 이진화하고, 상기 이진화된 점수를 바탕으로암으로 판별된 패치들을 심각도 점수가 높은 순서대로 가시화하여 제공하는 것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "에 있어서,상기 인공지능 학습 단계는,상기 인공지능 학습부가 라벨링된 상기 암 패치들 또는 상기 정상 패치들을 중에서, 상대적으로 적은 패치들의개수만큼 상대적으로 많은 패치들에서 랜덤으로 선택하여(Under-sampling) 상기 암 패치들과 상기 정상 패치들의 균형을 맞추어 학습하는 것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 제2 조직 추출 단계는,상기 제2 조직 추출부가 암 영역의 위치를 표시한 상기 학습용 병리영상의 RGB(Red, Green, Blue) 값을HSV(Hue, Saturation, Value) 값으로 변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추출하는것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서,상기 제2 패치 생성 단계는,상기 제2 패치 생성부가 조직 영역을 추출한 상기 학습용 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패치들로 분할하고,상기 학습용 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미리지정한 픽셀의 크기로 조절하는 것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법.공개특허 10-2023-0095801-4-청구항 9"}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 6에 있어서,상기 인공지능 학습 단계는,상기 인공지능 학습부가 상기 암 패치 또는 상기 정상 패치를 이용해 상기 패치 분류 모델로서 합성 곱 신경망(Convolutional Neural Network) 기반의 인공지능 모델을 학습하는 것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "병리영상에서 조직 영역을 추출하는 제1 조직 추출부;조직 영역을 추출한 상기 병리 영상을 정사각형 조각 형태의 패치들로 분할하는 제1 패치 생성부;상기 패치들에 색상 표준화를 적용하는 제1 이미지 전처리부;색상 표준화가 적용된 상기 패치들을 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출하는 심각도 예측부; 및산출된 상기 심각도 점수를 이용해 심각도가 가장 높은 패치를 선정하여 가시화하는 패치 선정부;를 포함하는 것을 특징으로 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 제1 조직 추출부는,암 영역의 위치를 표시한 상기 병리영상의 RGB(Red, Green, Blue) 값을 HSV(Hue, Saturation, Value) 값으로변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추출하는 인공지능 기반의 병리영상 암 병변맞춤형 위치 표시 시스템."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서,상기 제1 패치 생성부는,조직 영역을 추출한 상기 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixelresolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패치들로 분할하고,상기 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미리 지정한공개특허 10-2023-0095801-5-픽셀의 크기로 조절하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 11에 있어서,상기 심각도 예측부는,색상 표준화가 적용된 상기 패치들을 소프트맥스 함수(Softmax Function)를 이용하는 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 11에 있어서,상기 패치 선정부는,상기 심각도 점수를 설정된 임계치 값을 통해 이진화하고, 상기 이진화된 점수를 바탕으로 암으로 판별된 패치들을 심각도 점수가 높은 순서대로 가시화하여 제공하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시시스템."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "에 있어서,상기 제2 패치 생성부는,조직 영역을 추출한 상기 학습용 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixelresolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패치들로 분할하고,상기 학습용 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미리지정한 픽셀의 크기로 조절하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 제2 조직 추출부는,암 영역의 위치를 표시한 상기 학습용 병리영상의 RGB(Red, Green, Blue) 값을 HSV(Hue, Saturation, Value)값으로 변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추출하는 인공지능 기반의 병리영상 암병변 맞춤형 위치 표시 시스템.공개특허 10-2023-0095801-6-청구항 18"}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서,상기 인공지능 학습부는,라벨링된 상기 암 패치들 또는 상기 정상 패치들을 중에서, 상대적으로 적은 패치들의 개수만큼 상대적으로 많은 패치들에서 랜덤으로 선택하여(Under-sampling) 상기 암 패치들과 상기 정상 패치들의 균형을 맞추어 학습하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템."}
{"patent_id": "10-2022-0150199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 16에 있어서,상기 인공지능 학습부는,상기 암 패치 또는 상기 정상 패치를 이용해 상기 패치 분류 모델로서 합성 곱 신경망(Convolutional NeuralNetwork) 기반의 인공지능 모델을 학습하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템."}
{"patent_id": "10-2022-0150199", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법 및 시스템에 관한 것으로, 본 발명에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법은, 제1 조직 추출부가 병리영상에서 조직 영역을 추출 하는 제1 조직 추출 단계; 제1 패치 생성부가 조직 영역을 추출한 상기 병리 영상을 정사각형 조각 형태의 패치 들로 분할하는 제1 패치 생성 단계; 제1 이미지 전처리부가 상기 패치들에 색상 표준화를 적용하는 제1 이미지 전처리 단계; 심각도 예측부가 색상 표준화가 적용된 상기 패치들을 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출하는 심각도 예측 단계; 및 패치 선정부가 산출된 상기 심각도 점수를 이용해 심각도가 가장 높은 패치를 선정하여 가시화하는 패치 선정 단계;를 포함하여 구성된 다."}
{"patent_id": "10-2022-0150199", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법 및 시스템에 관한 것으로, 보다 상세하게 는 인공지능 기반으로 입력된 병리 이미지로부터 암 심각도 예측치가 높은 순서대로 병변 의심영역의 좌표를 제 공하여 진단을 보조할 수 있도록 하는 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0150199", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 병리 영상은 크기가 매우 크기에 병리 의사가 병리 이미지 판독 시 이상 소견을 보이는 곳을 찾는 데에 많은 시간이 소요된다. 병리 분야는 의료 인공지능 연구가 가장 활발한 분야 중 하나로서, 진단을 최종적으로 확정하는 중요한 역할을 수행하고 있으며, 병리과에 의해 결정된 판단은 진료 및 연구를 수행하는 시작점에 해당되기 때문에 병리과의 판독 정확성은 매우 중요하다. 따라서, 병리 데이터의 판독 효율성, 일관성 및 정확성을 높이기 위해 병리과의 다양한 영역에서 이미지 인식 인공지능 기술이 연구되고 있다. 이와 같이, 진단 시간을 최소화하고 오진의 가능성을 줄일 수 있는 기술이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허문헌 1: 등록특허공보 제10-2237696호(2021.04.08)"}
{"patent_id": "10-2022-0150199", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제를 해결하기 위해 안출된 것으로서, 본 발명은 인공지능을 활용하여 병리 의사에게 암 심 각도 예측치가 높은 순서대로 병변 의심영역의 좌표를 제공하여 암 의심영역부터 판독을 시작하도록 함으로써, 진단 시간을 최소화하고 오진의 가능성을 줄일 수 있도록 하고자 한다."}
{"patent_id": "10-2022-0150199", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 문제를 해결하기 위한 본 발명의 일실시예에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법은, 제1 조직 추출부가 병리영상에서 조직 영역을 추출하는 제1 조직 추출 단계; 제1 패치 생성부가 조직 영역을 추출한 상기 병리 영상을 정사각형 조각 형태의 패치들로 분할하는 제1 패치 생성 단계; 제1 이미지 전 처리부가 상기 패치들에 색상 표준화를 적용하는 제1 이미지 전처리 단계; 심각도 예측부가 색상 표준화가 적용 된 상기 패치들을 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출하는 심각도 예측 단계; 및 패치 선정부가 산출된 상기 심각도 점수를 이용해 심각도가 가장 높은 패치를 선정하여 가시화하는 패치 선정 단계;를 포함하여 구성된다. 본 발명의 다른 일실시예에 따르면, 상기 제1 조직 추출 단계는 상기 제1 조직 추출부가 암 영역의 위치를 표시 한 상기 병리영상의 RGB(Red, Green, Blue) 값을 HSV(Hue, Saturation, Value) 값으로 변환하여 채도 값이 기 준값 이상인 부분에 해당하는 조직 영역을 추출할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제1 패치 생성 단계는 상기 제1 패치 생성부가 조직 영역을 추출한 상 기 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다 수의 일정한 크기의 정사각형 조각 형태의 패치들로 분할하고, 상기 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미리 지정한 픽셀의 크기로 조절할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 심각도 예측 단계는 상기 심각도 예측부가 색상 표준화가 적용된 상기 패치들을 소프트맥스 함수(Softmax Function)를 이용하는 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 패치 선정 단계는 상기 패치 선정부가 상기 심각도 점수를 설정된 임 계치 값을 통해 이진화하고, 상기 이진화된 점수를 바탕으로 암으로 판별된 패치들을 심각도 점수가 높은 순서 대로 가시화하여 제공할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 심각도 예측 단계의 이전에, 어노테이션부가 학습용 병리영상에 암 영 역의 위치를 표시는 어노테이션 단계; 제2 조직 추출부가 암 영역의 위치를 표시한 상기 학습용 병리영상에서 조직 영역을 추출하는 제2 조직 추출 단계; 제2 패치 생성부가 조직 영역을 추출한 상기 학습용 병리 영상을 정 사각형 조각 형태의 패치들로 분할하는 제2 패치 생성 단계; 제2 이미지 전처리부가 상기 패치들에 색상 표준화 를 적용하는 제2 이미지 전처리 단계; 패치 라벨링부가 색상 표준화과 적용된 상기 패치들을 상기 암 영역의 표 시의 여부에 따라 암 패치 또는 정상 패치로 라벨링 하는 패치 라벨링 단계; 및 인공지능 학습부가 라벨링된 상 기 암 패치 또는 상기 정상 패치를 이용해 패치 분류 모델을 학습하는 인공지능 학습 단계;를 더 포함하고, 상 기 심각도 예측 단계는 상기 심각도 예측부가 색상 표준화가 적용된 상기 패치들을 학습된 상기 패치 분류 모델 에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제2 조직 추출 단계는 상기 제2 조직 추출부가 암 영역의 위치를 표시 한 상기 학습용 병리영상의 RGB(Red, Green, Blue) 값을 HSV(Hue, Saturation, Value) 값으로 변환하여 채도값이 기준값 이상인 부분에 해당하는 조직 영역을 추출할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제2 패치 생성 단계는 상기 제2 패치 생성부가 조직 영역을 추출한 상 기 학습용 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패치들로 분할하고, 상기 학습용 병리 영상에 포함되는 속성 값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미리 지정한 픽셀의 크기로 조절할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 인공지능 학습 단계는 상기 인공지능 학습부가 라벨링된 상기 암 패치 들 또는 상기 정상 패치들을 중에서, 상대적으로 적은 패치들의 개수만큼 상대적으로 많은 패치들에서 랜덤으로 선택하여(Under-sampling) 상기 암 패치들과 상기 정상 패치들의 균형을 맞추어 학습할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 인공지능 학습 단계는 상기 인공지능 학습부가 상기 암 패치 또는 상 기 정상 패치를 이용해 상기 패치 분류 모델로서 합성 곱 신경망(Convolutional Neural Network) 기반의 인공지 능 모델을 학습할 수 있다. 본 발명의 일실시예에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템은, 병리영상에서 조직 영역을 추출하는 제1 조직 추출부; 조직 영역을 추출한 상기 병리 영상을 정사각형 조각 형태의 패치들로 분할 하는 제1 패치 생성부; 상기 패치들에 색상 표준화를 적용하는 제1 이미지 전처리부; 색상 표준화가 적용된 상 기 패치들을 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수 를 산출하는 심각도 예측부; 및 산출된 상기 심각도 점수를 이용해 심각도가 가장 높은 패치를 선정하여 가시화 하는 패치 선정부;를 포함하여 구성된다. 본 발명의 다른 일실시예에 따르면, 상기 제1 조직 추출부는 암 영역의 위치를 표시한 상기 병리영상의 RGB(Red, Green, Blue) 값을 HSV(Hue, Saturation, Value) 값으로 변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추출할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제1 패치 생성부는 조직 영역을 추출한 상기 병리 영상을 이동 슬라이 딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패치들로 분할하고, 상기 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미리 지정한 픽셀의 크기로 조절할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 심각도 예측부는 색상 표준화가 적용된 상기 패치들을 소프트맥스 함 수(Softmax Function)를 이용하는 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 패치 선정부는 상기 심각도 점수를 설정된 임계치 값을 통해 이진화하 고, 상기 이진화된 점수를 바탕으로 암으로 판별된 패치들을 심각도 점수가 높은 순서대로 가시화하여 제공할 수 있다. 본 발명의 다른 일실시예에 따르면, 학습용 병리영상에 암 영역의 위치를 표시하는 어노테이션부; 암 영역의 위 치를 표시한 상기 학습용 병리영상에서 조직 영역을 추출하는 제2 조직 추출부; 조직 영역을 추출한 상기 학습 용 병리 영상을 정사각형 조각 형태의 패치들로 분할하는 제2 패치 생성부; 상기 패치들에 색상 표준화를 적용 하는 제2 이미지 전처리부; 색상 표준화과 적용된 상기 패치들을 상기 암 영역의 표시의 여부에 따라 암 패치 또는 정상 패치로 라벨링 하는 패치 라벨링부; 및 라벨링된 상기 암 패치 또는 상기 정상 패치를 이용해 패치 분류 모델을 학습하는 인공지능 학습부;를 더 포함하고, 상기 심각도 예측부는 색상 표준화가 적용된 상기 패치 들을 학습된 상기 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제2 조직 추출부는 암 영역의 위치를 표시한 상기 학습용 병리영상의 RGB(Red, Green, Blue) 값을 HSV(Hue, Saturation, Value) 값으로 변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추출할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제2 패치 생성부는 조직 영역을 추출한 상기 학습용 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정 사각형 조각 형태의 패치들로 분할하고, 상기 학습용 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정 보를 추출하여 분할된 상기 패치들을 미리 지정한 픽셀의 크기로 조절할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 인공지능 학습부는 라벨링된 상기 암 패치들 또는 상기 정상 패치들을 중에서, 상대적으로 적은 패치들의 개수만큼 상대적으로 많은 패치들에서 랜덤으로 선택하여(Under-sampling) 상기 암 패치들과 상기 정상 패치들의 균형을 맞추어 학습할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 인공지능 학습부는 상기 암 패치 또는 상기 정상 패치를 이용해 상기 패치 분류 모델로서 합성 곱 신경망(Convolutional Neural Network) 기반의 인공지능 모델을 학습할 수 있다."}
{"patent_id": "10-2022-0150199", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 인공지능을 활용하여 병리 의사에게 암 심각도 예측치가 높은 순서대로 병변 의심영역의 좌표를 제공 하여 암 의심영역부터 판독을 시작하도록 함으로써, 진단 시간을 최소화하고 오진의 가능성을 줄일 수 있다."}
{"patent_id": "10-2022-0150199", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 다만, 실시형태를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 발명의 요지를 불 필요하게 흐릴 수 있다고 판단되는 경우 그에 대한 상세한 설명은 생략한다. 또한, 도면에서의 각 구성요소들의 크기는 설명을 위하여 과장될 수 있으며, 실제로 적용되는 크기를 의미하는 것은 아니다. 또한, 명세서 전체에서, 일 구성요소가 다른 구성요소와 \"연결된다\" 거나 \"접속된다\" 등으로 언급된 때에는, 상 기 일 구성요소가 상기 다른 구성요소와 직접 연결되거나 또는 직접 접속될 수도 있지만, 특별히 반대되는 기재 가 존재하지 않는 이상, 중간에 또 다른 구성요소를 매개하여 연결되거나 또는 접속될 수도 있다고 이해되어야 할 것이다. 또한, 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 도 1은 본 발명의 일실시예에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템의 구성도이다. 본 발명의 일실시예에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템은 컴퓨터 단말, 서버 또는 전용 장치로 구성되거나, 각 기능을 제공하는 구성요소가 각각 컴퓨터 단말, 서버 또는 전용 장치로 구성 될 수 있다. 또는, 본 발명의 일실시예에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템은 각 기능을 제공하는 각각의 구성요소가 하드웨어 또는 소프트웨어로 구성될 수 있다. 보다 구체적으로, 본 발명의 일실시예에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템은 예 측부 및 학습부를 포함하여 구성될 수 있다. 또한, 상기 예측부는 제1 조직 추출부, 제1 패치 학습부, 제1 이미지 전처리부, 심각도 예 측부 및 패치 선정부를 포함하여 구성될 수 있다. 먼저, 상기 제1 조직 추출부는 병리영상에서 조직 영역을 추출한다. 이때, 상기 제1 조직 추출부는 암 영역의 위치를 표시한 상기 병리영상의 RGB(Red, Green, Blue) 값을 HSV(Hue, Saturation, Value) 값으로 변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추출할 수 있다. 또한, 상기 제1 조직 추출부는 조직 영역을 추출한 상기 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패치들로 분 할하고, 상기 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미 리 지정한 픽셀의 크기로 조절할 수 있다. 보다 구체적으로, 상기 제1 조직 추출부는 병리영상의 흰색 배경을 제외하고 조직 영역만 추출할 수 있으 며, 입력된 병리영상의 색 공간을 RGB(Red Green Blue: 빨간색, 녹색, 파란색) 척도에서 HSV(Hue Saturation Value: 색조, 채도, 값) 척도로 변환할 수 있다. 이때, H(Hue), S(Saturation), V(Value)는 0과 255 사이의 값 으로 표현할 수 있으며. S(Saturation: 채도값)는 특정한 색상의 가장 진한 상태를 100%로 하였을 때 진함의 정 도를 나타내며, 채도값 0은 같은 명도의 무채색을 나타낸다. 그에 따라, 상기 제1 조직 추출부는 S(Saturation) 채널에서 S 값이 4 이상인 부분만 추출하여 대략적인 조직 영역을 얻을 수 있다. 상기 제1 패치 생성부는 조직 영역을 추출한 상기 병리 영상을 정사각형 조각 형태의 패치들로 분할한다. 이때, 상기 제1 패치 생성부는 조직 영역을 추출한 상기 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패치들로 분 할하고, 상기 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미 리 지정한 픽셀의 크기로 조절할 수 있다. 보다 상세하게 설명하면, 상기 패치(patch)란 병리영상을 정사각형 조각 형태로 분할한 이미지를 의미하며, 상 기 제1 패치 생성부는 입력된 병리영상에 대하여 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도 (pixel resolution) 정규화를 통해 다수의 일정한 사이즈(512×512 픽셀)의 소형 패치들을 생성할 수 있다. 이 때, 픽셀 해상도(pixel resolution) 정규화란 스캐너마다 픽셀 해상도가 다르기 때문에 일정한 픽셀(pixel) 크 기로 정규화시키는 작업을 말한다. 이때, 상기 제1 패치 생성부는 병리영상에 속성값으로 저장되어 있는 배율 정보를 추출하여 미리 지정한 픽셀 크기로 영상 리사이즈(resize) 작업 진행할 수 있다. 또한, 상기 제1 패치 생성부는 병리영상 전체 영역 중 배경에 해당하는 영역은 패치를 생성하지 않고, 상 기 제1 조직 추출부에서 추출된 조직 부분에 해당하는 영역의 패치만을 생성하며, 이와 같은 패치화를 통 해 이후에 전체 병리 이미지가 아닌 작은 영역별(패치별) 심각도를 예측하게 된다. 상기 제1 이미지 전처리부는 상기 패치들에 색상 표준화를 적용한다. 보다 상세하게 설명하면, 병리영상의 경우 H&E(Hematoxyling and Eosin) 염색 용액에 따라 영상의 색상이 달라 진다. 따라서, 데이터셋이 같은 색상으로 표준화될 경우 이미지 간의 색상 차이가 감소하므로 효율적인 인공지 능 모델 학습이 가능하다. 따라서, 상기 제1 이미지 전처리부는 제1 패치 생성부에서 생성된 패치들에 색상 표준화(stain normalization)를 실행하며, 이때 색상 표준화는 Macenko method를 사용할 수 있다. 상기 심각도 예측부는 색상 표준화가 적용된 상기 패치들을 패치 분류 모델에 입력하여 각 상기 패치들 별 로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출한다. 즉, 상기 심각도 예측부는 상기 학습부에서 학습된 패치 분류 모델에 색상 표준화가 적용된 상기 패 치들을 입력하여 심각도 점수를 산출할 수 있다. 이때, 상기 심각도 예측부는 색상 표준화가 적용된 상기 패치들을 소프트맥스 함수(Softmax Function)를 이용하는 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출할 수 있다. 즉, 상기 학습부에서 학습한 암, 정상 패치 분류 모델에 상기 제1 이미지 전처리부에서 생성된 패치 들을 입력하여 패치별로 모델의 예측 결과를 산출할 수 있으며, 이때 소프트맥스 함수(Softmax Function)를 사 용하여 암 클래스 패치 분류 확률을 0 부터 1까지 범위의 확률로 표현하고 이를 패치의 심각도로 정의하도록 구 성될 수 있다. 그에 따라, 상기 패치 선정부는 산출된 상기 심각도 점수를 이용해 심각도가 가장 높은 패치를 선정하여 가시화한다. 이때, 상기 패치 선정부는 상기 심각도 점수를 설정된 임계치 값을 통해 이진화하고, 상기 이진화된 점수 를 바탕으로 암으로 판별된 패치들을 심각도 점수가 높은 순서대로 가시화하여 제공할 수 있다. 보다 상세하게 설명하면, 상기 패치 선정부는 심각도 점수를 사용자가 설정한 입계치(threshold) 값을 통 해 이진화 하고, 이진화된 점수를 바탕으로 암으로 판별된 패치들을 가시화할 수 있다. 이때, 상기 패치 선정부는 암으로 판별된 패치들을 심각도 예측치가 높은 순서대로 정렬할 수 있으며, 심 각도 예측치가 동일한 패치가 2개 이상 존재할 경우, 인접한 8개의 패치의 심각도 예측치의 평균을 구하여 평균 값이 높은 패치를 우선순위로 하여 정렬할 수 있다. 또한, 상기 패치 선정부는 심각도가 가장 높은 패치 영역을 가시화하여 사용자(병리의사)에게 가시화할 수 있으며, 사용자가 가시화된 패치 영역의 분석을 마치고 다음 버튼을 누르면, 다음으로 심각도 예측치가 높은 패치 영역을 가시화하여 제공할 수 있다. 한편, 상기 학습부는 어노테이션부, 제2 패치 학습부, 제2 이미지 전처리부 및 패치 라벨 링부 및 인공지능 학습부를 포함하여 구성될 수 있다. 상기 어노테이션부는 학습용 병리영상에 암 영역의 위치를 표시한다. 또한, 상기 제2 조직 추출부는 암 영역의 위치를 표시한 상기 학습용 병리영상에서 조직 영역을 추출한다. 이때, 상기 제2 조직 추출부는 암 영역의 위치를 표시한 상기 학습용 병리영상의 RGB(Red, Green, Blue) 값을 HSV(Hue, Saturation, Value) 값으로 변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추 출할 수 있다. 또한, 상기 제2 조직 추출부는 조직 영역을 추출한 상기 학습용 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패 치들로 분할하고, 상기 학습용 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미리 지정한 픽셀의 크기로 조절할 수 있다. 보다 구체적으로, 상기 제2 조직 추출부는 학습용 병리영상의 흰색 배경을 제외하고 조직 영역만 추출할 수 있으며, 입력된 학습용 병리영상의 색 공간을 RGB(Red Green Blue: 빨간색, 녹색, 파란색) 척도에서 HSV(Hue Saturation Value: 색조, 채도, 값) 척도로 변환할 수 있다. 이때, H(Hue), S(Saturation), V(Value)는 0과 255 사이의 값으로 표현할 수 있으며. S(Saturation: 채도값)는 특정한 색상의 가장 진한 상태를 100%로 하였을 때 진함의 정도를 나타내며, 채도값 0은 같은 명도의 무채색을 나타낸다. 그에 따라, 상기 제2 조직 추출부 는 S(Saturation) 채널에서 S 값이 4 이상인 부분만 추출하여 대략적인 조직 영역을 얻을 수 있다. 상기 제2 패치 생성부는 조직 영역을 추출한 상기 학습용 병리 영상을 정사각형 조각 형태의 패치들로 분 할한다. 이때, 상기 제2 패치 생성부는 조직 영역을 추출한 상기 학습용 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패 치들로 분할하고, 상기 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패 치들을 미리 지정한 픽셀의 크기로 조절할 수 있다. 보다 상세하게 설명하면, 상기 패치(patch)란 병리영상을 정사각형 조각 형태로 분할한 이미지를 의미하며, 상 기 제2 패치 생성부는 입력된 학습용 병리영상에 대하여 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 사이즈(512×512 픽셀)의 소형 패치들을 생성할 수 있 다. 이때, 픽셀 해상도(pixel resolution) 정규화란 스캐너마다 픽셀 해상도가 다르기 때문에 일정한 픽셀 (pixel) 크기로 정규화시키는 작업을 말한다. 이때, 상기 제2 패치 생성부는 학습용 병리영상에 속성값으로 저장되어 있는 배율 정보를 추출하여 미리 지정한 픽셀 크기로 영상 리사이즈(resize) 작업 진행할 수 있다. 또한, 상기 제2 패치 생성부는 학습용 병리영상 전체 영역 중 배경에 해당하는 영역은 패치를 생성하지 않 고, 상기 제2 조직 추출부에서 추출된 조직 부분에 해당하는 영역의 패치만을 생성하며, 이와 같은 패치화 를 통해 이후에 전체 학습용 병리 이미지가 아닌 작은 영역별(패치별) 심각도를 예측하게 된다. 상기 제2 이미지 전처리부는 상기 패치들에 색상 표준화를 적용한다. 보다 상세하게 설명하면, 병리영상의 경우 H&E (Hematoxyling and Eosin) 염색 용액에 따라 영상의 색상이 달라 진다. 따라서, 데이터셋이 같은 색상으로 표준화될 경우 이미지 간의 색상 차이가 감소하므로 효율적인 인공지능 모델 학습이 가능하다. 따라서, 상기 제2 이미지 전처리부는 제2 패치 생성부에서 생성된 패치들에 색상 표준화(stain normalization)를 실행하며, 이때 색상 표준화는 Macenko method를 사용할 수 있다. 상기 패치 라벨링부는 색상 표준화과 적용된 상기 패치들을 상기 암 영역의 표시의 여부에 따라 암 패치 또는 정상 패치로 라벨링한다. 즉, 상기 패치 라벨링부는 생성된 인공지능 학습용 패치들을 암, 정상 두 클래스로 라벨링하며, 이때 생성 된 패치들에서 암 어노테이션(annotation)이 있는 패치는 암, 암 어노테이션이 없는 패치는 정상 패치로 라벨링 할 수 있다. 따라서, 상기 인공지능 학습부는 라벨링된 상기 암 패치 또는 상기 정상 패치를 이용해 패치 분류 모델을 학습한다. 이때, 상기 인공지능 학습부는 라벨링된 상기 암 패치들 또는 상기 정상 패치들을 중에서, 상대적으로 적 은 패치들의 개수만큼 상대적으로 많은 패치들에서 랜덤으로 선택하여(Under-sampling) 상기 암 패치들과 상기 정상 패치들의 균형을 맞추어 학습할 수 있다. 또한, 상기 인공지능 학습부는 상기 암 패치 또는 상기 정상 패치를 이용해 상기 패치 분류 모델로서 합성 곱 신경망(Convolutional Neural Network) 기반의 인공지능 모델을 학습할 수 있다. 즉, 본 발명에 따르면 클래스 불균형(Class imbalance) 문제를 해결하기 위하여, 상기 인공지능 학습부는 암 클래스와 정상 클래스 중 패치가 많은 클래스의 전체 패치들 중 패치가 적은 클래스의 패치 개수만큼 랜덤으 로 선택하여(Under-sampling) 두 클래스의 균형을 맞추어 학습한다. 이때, 상기 인공지능 학습부는 합성 곱 신경망(Convolutional Neural Network) 기반의 인공지능 모델을 학습할 수 있으며, 새로운 병리영상 어노테이션이 입력될 때마다, 상기의 과정을 반복하며 인공지능 모델을 재 학습할 수 있다. 또한, 학습용 어노테이션의 수가 많을수록 인공지능 모델의 신뢰도가 높아진다. 이와 같이 본 발명에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템은 인공지능을 활용하여 병리 의사에게 암 심각도 예측치가 높은 순서대로 병변 의심영역의 좌표를 제공하여 암 의심영역부터 판독을 시 작하도록 함으로써, 진단 시간을 최소화하고 오진의 가능성을 줄일 수 있다. 도 2 및 도 3은 본 발명의 일실시예에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 방법을 설명하 기 위한 흐름도로서, 도 2는 본 발명의 일실시예에 따른 인공지능 학습 방법을 설명하기 위한 흐름도이고, 도 3 은 본 발명의 일실시예에 따른 학습된 인공지능에 의해 병리영상 암 병변 맞춤형 위치 표시 방법을 설명하기 위 한 흐름도이다. 이후부터는 도 2 및 도 3을 참조하여 본 발명의 일실시예에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위 치 표시 방법을 설명하기로 한다. 먼저, 어노테이션부가 학습용 병리영상에 암 영역의 위치를 표시한다(S110). 이후, 제2 조직 추출부가 암 영역의 위치를 표시한 상기 학습용 병리영상에서 조직 영역을 추출한다(S120). 이때, 상기 제2 조직 추출부가 암 영역의 위치를 표시한 상기 학습용 병리영상의 RGB(Red Green Blue) 값을 HSV(Hue Saturation Value) 값으로 변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추출할 수 있다. 이후에는 제2 패치 생성부가 조직 영역을 추출한 상기 학습용 병리 영상을 정사각형 조각 형태의 패치들로 분할 한다(S130). 보다 상세하게 설명하면, 상기 제2 패치 생성부가 조직 영역을 추출한 상기 학습용 병리 영상을 이동 슬라이딩 윈도(Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조 각 형태의 패치들로 분할하고, 상기 학습용 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출 하여 분할된 상기 패치들을 미리 지정한 픽셀의 크기로 조절할 수 있다. 이후, 제2 이미지 전처리부가 상기 패치들에 색상 표준화를 적용한다(S140). 이후에는 패치 라벨링부가 색상 표준화과 적용된 상기 패치들을 상기 암 영역의 표시의 여부에 따라 암 패치 또 는 정상 패치로 라벨링 한다(S150). 이후, 인공지능 학습부가 라벨링된 상기 암 패치 또는 상기 정상 패치를 이용해 패치 분류 모델을 학습한다 (S160). 보다 상세하게 설명하면, 상기 인공지능 학습부가 라벨링된 상기 암 패치들 또는 상기 정상 패치들을 중에서, 상대적으로 적은 패치들의 개수만큼 상대적으로 많은 패치들에서 랜덤으로 선택하여(Under-sampling) 상기 암 패치들과 상기 정상 패치들의 균형을 맞추어 학습할 수 있으며, 이때, 상기 인공지능 학습부가 상기 암 패치 또 는 상기 정상 패치를 이용해 상기 패치 분류 모델로서 합성 곱 신경망(Convolutional Neural Network) 기반의 인공지능 모델을 학습할 수 있다. 한편, 제1 조직 추출부가 병리영상에서 조직 영역을 추출한다(S210). 이때, 상기 제1 조직 추출부가 암 영역의 위치를 표시한 상기 병리영상의 RGB(Red Green Blue) 값을 HSV(Hue Saturation Value) 값으로 변환하여 채도 값이 기준값 이상인 부분에 해당하는 조직 영역을 추출할 수 있다. 이후, 제1 패치 생성부가 조직 영역을 추출한 상기 병리 영상을 정사각형 조각 형태의 패치들로 분할한다 (S220). 보다 상세하게 설명하면, 상기 제1 패치 생성부가 조직 영역을 추출한 상기 병리 영상을 이동 슬라이딩 윈도 (Sliding Window) 방식과 픽셀 해상도(pixel resolution) 정규화를 통해 다수의 일정한 크기의 정사각형 조각 형태의 패치들로 분할하고, 상기 병리 영상에 포함되는 속성값으로 저장되어 있는 배율 정보를 추출하여 분할된 상기 패치들을 미리 지정한 픽셀의 크기로 조절할 수 있다. 이후, 제1 이미지 전처리부가 상기 패치들에 색상 표준화를 적용한다(S230). 그에 따라, 심각도 예측부가 색상 표준화가 적용된 상기 패치들을 상기 인공지능 학습부가 학습시킨 패치 분류 모델에 입력하여, 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출한다(S240). 이때, 상기 심각도 예측부가 색상 표준화가 적용된 상기 패치들을 소프트맥스 함수(Softmax Function)를 이용하 는 패치 분류 모델에 입력하여 각 상기 패치들 별로 예측 결과로서 암의 확률을 나타내는 심각도 점수를 산출할 수 있다. 이후, 패치 선정부가 산출된 상기 심각도 점수를 이용해 심각도가 가장 높은 패치를 선정하여 가시화한다(S250) 보다 상세하게 설명하면, 상기 패치 선정부가 상기 심각도 점수를 설정된 임계치 값을 통해 이진화하고, 상기 이진화된 점수를 바탕으로 암으로 판별된 패치들을 심각도 점수가 높은 순서대로 가시화하여 제공할 수 있다. 이와 같이 본 발명에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템은 인공지능을 활용하여 병리 의사에게 암 심각도 예측치가 높은 순서대로 병변 의심영역의 좌표를 제공하여 암 의심영역부터 판독을 시 작하도록 함으로써, 진단 시간을 최소화하고 오진의 가능성을 줄일 수 있다. 전술한 바와 같은 본 발명의 상세한 설명에서는 구체적인 실시예에 관해 설명하였다. 그러나 본 발명의 범주에 서 벗어나지 않는 한도 내에서는 여러 가지 변형이 가능하다. 본 발명의 기술적 사상은 본 발명의 전술한 실시 예에 국한되어 정해져서는 안 되며, 청구범위뿐만 아니라 이 청구범위와 균등한 것들에 의해 정해져야 한다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2022-0150199", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 인공지능 기반의 병리영상 암 병변 맞춤형 위치 표시 시스템의 구성도이다. 도 2는 본 발명의 일실시예에 따른 인공지능 학습 방법을 설명하기 위한 흐름도이다. 도 3은 본 발명의 일실시예에 따른 학습된 인공지능에 의해 병리영상 암 병변 맞춤형 위치 표시 방법을 설명하 기 위한 흐름도이다."}
