{"patent_id": "10-2023-0053744", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0157212", "출원번호": "10-2023-0053744", "발명의 명칭": "의류 피팅룸 커넥티드 시스템 및 방법", "출원인": "주식회사 피엔케이솔루션", "발명자": "성보경"}}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "매장의 스마트 피팅룸에 설치되어 상기 스마트 피팅룸으로 반입된 하나 이상의 의류 각각에 부착된 태그로부터상기 의류에 대한 의류정보를 포함하는 의류 태그정보를 읽고, 상기 의류의 용도 및 의류정보를 전송하고, 이에대한 응답으로 상기 의류정보의 의류와 관련된 의류관련정보를 수신받아 표시하며, 상기 용도에 대응하는 환경을 조성하기 위한 피팅룸 환경 설정정보를 수신받아 상기 스마트 피팅룸을 상기 피팅룸 환경 설정정보에 설정된환경으로 조성하는 스마트 피팅룸 제어부; 및상기 매장에서 판매되는 다수의 의류 각각에 대한 용도를 포함하는 의류정보 및 의류관련정보와, 해당 의류의용도에 따른 피팅룸 환경 설정정보를 저장하여 관리하고, 상기 스마트 피팅룸 제어부로부터 상기 의류정보의 수신 시 상기 의류정보에 포함된 의류의 용도에 대응하는 피팅룸 환경 설정정보를 생성하여 상기 의류정보의 의류와 관련된 의류관련정보와 함께 상기 스마트 피팅룸 제어부로 전송하는 피팅 관리부를 포함하는 것을 특징으로하는 의류 피팅룸 커넥티드 시스템."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 스마트 피팅룸 제어부는,유무선 데이터통신망에 유선 및 무선 중 어느 하나로 연결되어 상기 유무선 데이터통신망에 연결된 상기 피팅관리부와 데이터통신을 수행하는 통신부;상기 스마트 피팅룸으로 반입되는 의류에 부착된 태그로부터 의류 태그정보를 읽어 출력하는 태그 리더기;상기 의류관련정보를 표시하는 제1디스플레이부;상기 피팅룸 환경 설정정보에 대응하도록 스마트 피팅룸 내부의 환경을 조성하는 환경 조성부; 및상기 태그 리더기를 통해 스마트 피팅룸으로 반입된 의류 각각에 대한 의류 태그정보를 획득하여, 상기 의류 태그정보에 포함된 의류정보의 의류에 대한 용도 및 의류정보를 포함하는 피팅요청정보를 상기 통신부를 통해 상기 피팅 관리부로 전송하고 이에 대한 응답으로 상기 의류의 용도 및 고객이 상기 의류를 사고자 하는 용도 중어느 하나의 용도에 대응하는 환경을 조성하기 위한 피팅룸 환경 설정정보 및 상기 의류관련정보를 포함하는 피팅정보를 상기 피팅 관리부로부터 수신받아 상기 의류관련정보를 상기 제1디스플레이부를 통해 표시하고, 상기피팅룸 환경 설정정보에 따라 환경 조성부를 제어하여 상기 스마트 피팅룸을 상기 피팅룸 환경 설정정보에 대응하는 상기 환경으로 조성하는 제어부를 포함하는 것을 특징으로 하는 의류 피팅룸 커넥티드 시스템"}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는,상기 태그 리더기를 통해 상기 스마트 피팅룸으로 반입한 하나 이상의 의류 각각에 부착된 태그로부터 의류 태그정보를 획득하는 의류 태그정보 획득부;상기 의류 태그정보가 획득되면, 상기 의류 태그정보에 포함된 의류정보 및 의류의 용도를 포함하는 피팅요청정보를 생성하여 상기 통신부를 통해 피팅 관리부로 전송하는 피팅정보 요청부;상기 피팅요청정보의 전송에 대한 응답으로 상기 피팅 관리부로부터 상기 피팅룸 환경 설정정보 및 상기 의류관련정보를 포함하는 피팅정보를 수신한 후, 상기 피팅정보로부터 의류관련정보 및 피팅룸 환경 설정정보를 추출공개특허 10-2024-0157212-3-하여 각각 출력하는 피팅정보 수신부;상기 의류관련정보를 입력받아 상기 제1디스플레이부에 표시하는 피팅 인터페이스부; 및상기 피팅룸 환경 설정정보를 입력받아 상기 환경 조성부를 제어하여 상기 피팅룸 환경 설정정보에 따라 상기스마트 피팅룸 내부를 상기 의류정보의 의류 용도에 대응하는 환경으로 조성하는 피팅룸 환경 제어부를 포함하는 것을 특징으로 하는 의류 피팅룸 커넥티드 시스템."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어부는,스마트 피팅룸 내부로 고객이 입실하는지를 모니터링하는 입실 모니터링부를 더 포함하되,상기 의류 태그정보 획득부는,상기 입실 모니터링부를 통해 스마트 피팅룸으로 들어오는 고객이 검출되면 상기 태그 리더기를 구동하여 상기의류에 부착된 태그로부터 의류 태그정보를 리딩하여 획득하는 것을 특징으로 하는 의류 피팅룸 커넥티드 시스템."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 환경 조성부는,영상을 디스플레이하는 제2디스플레이부;상기 제2디스플레이부에 대향하는 위치에 구성되어 상기 제2디스플레이부에 표시된 영상 및 상기 스마트 피팅룸에 있는 고객을 표시하는 제3디스플레이부;스피커를 포함하여 오디오를 출력하는 오디오 처리부; 및다양한 색의 빛을 조사하는 조명을 포함하고, 제어를 받아 상기 조명의 밝기 및 색상을 조절하는 조명 처리부를포함하되,상기 피팅룸 환경 제어부는,상기 의류의 용도 또는 스마트 피팅룸에 입실한 고객의 의류 구매 용도에 대응하고 상기 피팅룸 환경 설정정보에 포함되어 수신된 영상을 상기 제2디스플레이부에 표시하고, 상기 피팅룸 환경 설정정보에 포함된 조명 설정정보에 대응하도록 조명 처리부를 제어하여 상기 스마트 피팅룸 내부에 빛을 조사하며, 상기 피팅룸 환경 설정정보에 포함된 오디오를 상기 오디오 처리부를 통해 출력하여, 상기 의류의 용도 또는 고객의 의류 구매 용도에대응하도록 상기 스마트 피팅룸의 환경을 조성하는 것을 특징으로 하는 의류 피팅룸 커넥티드 시스템."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 스마트 피팅룸 제어부는,적어도 하나 이상의 카메라를 포함하는 카메라부; 및입력부를 더 포함하되,상기 제어부는,상기 제1디스플레이부 및 상기 입력부를 통해 고객이 입을 의류를 선택받거나, 상기 카메라부를 통해 고객이 의류를 입는지를 모니터링하여 고객의 의류 착용 및 착용한 의류를 감지하여 감지한 의류에 대한 의류정보를 출력공개특허 10-2024-0157212-4-하는 의류 착용 모니터링부를 더 포함하되,상기 피팅정보 요청부는,상기 의류 태그정보 획득부를 통해 획득된 의류정보의 의류 중 상기 의류 착용 모니터링부를 통해 고객이 입을의류에 대한 의류정보를 포함하는 피팅요청정보를 상기 피팅 관리부로 전송하는 것을 특징으로 하는 의류 피팅룸 커넥티드 시스템."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 피팅 인터페이스부는,상기 제1디스플레이부를 통해 스마트 피팅룸 내에 있는 고객이 상기 스마트 피팅룸 내부로 가져 들어온 의류와동일 디자인의 색상 및 크기를 변경할 수 있는 사용자 인터페이스 수단을 제공하고,상기 제어부는,상기 사용자 인터페이스 수단을 통해 고객이 입고 있는 의류에 대한 색상 및 크기의 변경 요청 시 상기 카메라를 통해 인식되는 상기 의류의 색상 및 크기를 가상으로 변경한 영상을 생성하여 상기 제2디스플레이부 및 제3디스플레이부 중 어느 하나 이상에 표시하는 가상 착용 시뮬레이션부를 더 포함하는 것을 특징으로 하는 의류피팅룸 커넥티드 시스템."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서,상기 스마트 피팅룸 제어부로부터 상기 스마트 피팅룸 내에 있는 고객이 요청한 고객 요청 정보를 수신하여 점원에게 통지하고, 점원의 응답 시 상기 응답에 대응하는 응답정보를 상기 스마트 피팅룸 제어부로 전송하는 점원 단말기를 더 포함하고,상기 스마트 피팅룸 제어부는,입력부를 더 포함하되,상기 제어부는,상기 제1디스플레이부에 고객으로부터 고객 요청 사항을 입력 및 선택받을 수 있는 고객 요청 사용자 인터페이스 수단을 표시하고, 상기 고객 요청 사용자 인터페이스 수단 및 상기 입력부를 통해 고객의 요청 사항을 입력받고, 입력된 고객 요청 사항에 대한 고객 요청 정보를 생성하여 상기 통신부를 통해 상기 점원 단말기로 전송하고, 상기 고객 요청 정보에 대한 응답 정보를 수신받아 상기 제1디스플레이부에 표시하는 비대면 인터페이스부를 더 포함하는 것을 특징으로 하는 의류 피팅룸 커넥티드 시스템."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "매장의 스마트 피팅룸에 설치된 스마트 피팅룸 제어부가 상기 스마트 피팅룸으로 반입된 하나 이상의 의류 각각에 부착된 태그로부터 상기 의류에 대한 의류정보를 포함하는 의류 태그정보를 읽고, 상기 의류의 용도 및 의류정보를 전송하는 피팅정보 요청 과정;상기 매장에서 판매되는 다수의 의류 각각에 대한 용도를 포함하는 의류정보 및 의류관련정보와, 해당 의류의용도에 따른 피팅룸 환경 설정정보를 저장하여 관리하는 피팅 관리부가 상기 스마트 피팅룸 제어부로부터 상기의류정보의 수신 시 상기 의류정보에 포함된 의류의 용도에 대응하는 피팅룸 환경 설정정보를 생성하여 상기 의류정보의 의류와 관련된 의류관련정보와 함께 상기 스마트 피팅룸 제어부로 전송하는 피팅정보 제공 과정; 및상기 스마트 피팅 제어부가 상기 피팅 관리부로부터 상기 피팅요청정보에 대한 응답으로 상기 의류정보의 의류와 관련된 의류관련정보를 수신받아 표시하며, 상기 용도에 대응하는 환경을 조성하기 위한 피팅룸 환경 설정정공개특허 10-2024-0157212-5-보를 수신받아 상기 스마트 피팅룸을 상기 피팅룸 환경 설정정보에 설정된 환경으로 조성하는 피팅룸 환경 조성과정을 포함하는 것을 특징으로 하는 의류 피팅룸 커넥티드 방법."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 피팅정보 요청 과정은상기 제어부가 의류 태그정보 획득부에 의해 태그 리더기를 통해 스마트 피팅룸으로 반입한 하나 이상의 의류각각에 부착된 태그로부터 의류 태그정보를 획득하는 의류 태그정보 획득 단계; 및상기 제어부가 상기 의류 태그정보가 획득되면, 피팅정보 요청부를 통해 상기 의류 태그정보의 의류정보 및 의류의 용도를 포함하는 피팅요청정보를 생성하여 통신부를 통해 상기 피팅 관리부로 전송하는 피팅정보 요청 단계를 포함하는 것을 특징으로 하는 의류 피팅룸 커넥티드 방법."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 피팅룸 환경 조성 과정은,상기 제어부가 피팅정보 수신부를 통해 상기 피팅요청정보의 전송에 대한 응답으로 상기 피팅 관리부로부터 상기 피팅룸 환경 설정정보 및 상기 의류관련정보를 포함하는 피팅정보를 수신한 후, 상기 피팅정보로부터 의류관련정보 및 피팅룸 환경 설정정보를 추출하여 각각 출력하는 피팅정보 수신 단계;상기 제어부가 피팅 인터페이스부를 통해 상기 의류관련정보를 입력받아 제1디스플레이부에 표시하는 피팅 인터페이스 단계; 및상기 제어부가 피팅룸 환경 제어부를 통해 상기 피팅룸 환경 설정정보를 입력받아 상기 환경 조성부를 제어하여상기 피팅룸 환경 설정정보에 따라 상기 스마트 피팅룸 내부의 환경을 상기 의류정보의 의류 용도에 대응하는환경을 조성하는 피팅룸 환경 조성 단계를 포함하는 것을 특징으로 하는 의류 피팅룸 커넥티드 방법."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 피팅정보 요청 과정은,상기 제어부가 입실 모니터링부를 통해 스마트 피팅룸 내부로 고객이 입실하는지를 모니터링하는 입실 모니터링단계를 더 포함하되,상기 의류 태그정보 획득 단계에서, 상기 제어부가 상기 입실 모니터링부를 통해 스마트 피팅룸으로 들어오는고객이 검출되면 상기 태그 리더기를 구동하여 상기 의류에 부착된 태그로부터 의류 태그정보를 리딩하여 획득하는 것을 특징으로 하는 의류 피팅룸 커넥티드 방법."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 피팅룸 환경 조성 과정은,상기 제어부의 피팅룸 환경 제어부가 상기 의류의 용도 또는 스마트 피팅룸에 입실한 고객의 의류 구매 용도에대응하고 상기 피팅룸 환경 설정정보에 포함되어 수신된 영상을 상기 제2디스플레이부에 표시하는 배경 조성 단계;공개특허 10-2024-0157212-6-상기 피팅룸 환경 제어부가 상기 피팅룸 환경 설정정보에 포함된 조명 설정정보에 대응하도록 조명 처리부를 제어하여 상기 스마트 피팅룸 내부에 빛을 조사하는 빛 환경 조성 단계; 및상기 피팅룸 환경 제어부가 상기 피팅룸 환경 설정정보에 포함된 오디오를 상기 오디오 처리부를 통해 출력하는소리 환경 조성 단계를 포함하여,상기 의류의 용도 또는 고객의 의류 구매 용도에 대응하도록 상기 스마트 피팅룸의 환경을 조성하는 것을 특징으로 하는 의류 피팅룸 커넥티드 방법."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 피팅정보 요청 과정은,상기 제어부가 의류 착용 모니터링부를 통해 상기 제1디스플레이부 및 상기 입력부를 통해 고객이 입을 의류를선택받거나, 상기 카메라부를 통해 고객이 의류를 입는지를 모니터링하여 고객의 의류 착용 및 착용한 의류를감지하여 감지한 의류에 대한 의류정보를 출력하는 의류 착용 모니터링 단계를 더 포함하되,상기 제어부는,상기 피팅정보 요청 단계에서 상기 의류 태그정보 획득부를 통해 획득된 의류정보의 의류 중 상기 의류 착용 모니터링부를 통해 고객이 입을 의류에 대한 의류정보를 포함하는 피팅요청정보를 상기 피팅 관리부로 전송하는것을 특징으로 하는 의류 피팅룸 커넥티드 방법."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 스마트 피팅룸 제어부의 상기 제어부가 상기 사용자 인터페이스 수단을 통해 고객이 입고 있는 의류에 대한 색상 및 크기의 변경 요청 시 가상 착용 시뮬레이션부에 의해 상기 카메라를 통해 인식되는 상기 의류의 색상 및 크기를 가상으로 변경한 영상을 생성하여 상기 제2디스플레이부 및 제3디스플레이부 중 어느 하나 이상에표시하는 가상 착용 시뮬레이션 과정을 더 포함하는 것을 특징으로 하는 의류 피팅룸 커넥티드 방법."}
{"patent_id": "10-2023-0053744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항 또는 제15항에 있어서,상기 스마트 피팅룸 제어부가 제1디스플레이부에 고객으로부터 고객 요청 사항을 입력 및 선택받을 수 있는 고객 요청 사용자 인터페이스 수단을 표시하고, 상기 고객 요청 사용자 인터페이스 수단 및 입력부를 통해 고객의요청 사항을 입력받고, 입력된 고객 요청 사항에 대한 고객 요청 정보를 생성하여 통신부를 통해 스마트 피팅룸외부에 있는 점원 단말기로 전송하고, 상기 점원 단말기로부터 상기 고객 요청 정보에 대한 응답 정보를 수신받아 상기 제1디스플레이부에 표시하는 비대면 인터페이스 과정을 더 포함하는 것을 특징으로 하는 의류 피팅룸커넥티드 방법."}
{"patent_id": "10-2023-0053744", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 의류 피팅룸 커넥티드 시스템 및 방법에 관한 것으로, 더욱 상세하게는 의류를 구매하러 매장을 방문 한 고객이 의류를 골라 피팅룸에 들어갈 때 고객이 선택한 의류에 대한 의류정보를 자동 획득하여 표시하고, 피 팅룸 내부의 환경을 의류에 대응하는 환경 또는 고객이 선택한 환경으로 조성하고, 피팅룸 밖의 매장 직원의 관 리자 단말기와 상호 인터페이스를 수행하여 고객이 피팅룸 밖으로 나가지 않고도 원하는 서비스를 빠르게 제공할 수 있는 의류 피팅룸 커넥티드 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0053744", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 의류 피팅룸 커넥티드 시스템 및 방법에 관한 것으로, 더욱 상세하게는 의류를 구매하러 매장을 방문 한 고객이 의류를 골라 피팅룸에 들어갈 때 고객이 선택한 의류와 관련된 정보를 확인할 수 있고, 의류의 용도 에 따른 고객에 대한 의류 적합도를 눈으로 확인할 수 있으며, 고객의 필요 사항을 외부의 점원에게 쉽게 전달 할 수 있는 의류 피팅룸 커넥티드 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0053744", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통상 커넥티드 시스템이란 오프라인으로만 진행하던 행동, 서비스 등을 사물인터넷(Internet of things: IoT) 디바이스 등을 활용하여 해당 행동 및 서비스를 수행하는 사용자를 컴퓨터 시스템에 접목하는 시스템을 의미한 다. 이러한 커넥티드 시스템은 헬스, 필라테스 등의 운동, 자동차, 전시관, 박물관 등과 같이 다양한 분야에 적 용되고 있다. 이런 추세에 기반하여 의류 분야에서도 커넥티드 시스템을 적용하려고 개발 중이나 의류의 재고 관리 등으로 제 한되고 있는 실정이며, 고객과 관련된 커넥티드 시스템을 제공하고 있지 못하다. 이러한 문제점을 개선하기 위해 대한민국 등록특허 제10-1876994호 [LED 패널 기반의 가상 피팅 시스템 및 방법](이하 \"선행기술\"이라 함)은 의류를 구매한 피팅 요청자의 신체정보를 분석하고, 분석된 신체정보에 대응 하는 의복을 제공하여 선택할 수 있도록 하고, 선택된 의류를 고객의 신체에 합성하여 표시할 수 있도록 하는 기술을 개시하여 사용자인 피팅 요청자가 자신의 신체에 맞는 의복을 쉽게 선택해서 가상으로 착용해 볼 수 있 도록 하여, 자신에 맞는 사이즈 및 의복을 구매할 수 있도록 하고 있다. 그러나 상기 선행기술은 사용자인 고객이 가상으로 의복을 입어볼 수 있도록 하는 것으로, 실제 의복을 입는 것 은 아니어서 고객 자신에게 실제로 잘 맞는지를 확인할 수 없으며, 실제 의류와 사용자인 고객 둘 모두를 시스 템에 연결할 수 없으므로 진정한 커넥티드 시스템이라고 보기 어렵다. 또한, 상기 선행기술은 가상의 옷을 입어볼 수 있을 뿐, 실제 옷을 입어보는 경우에는 일반적인 피팅룸과 동일 하고, 옷을 교체하여야 하는 경우 고객이 일일이 피팅룸을 나와 다른 의류로 교환한 후 다시 피팅룸에 들어와야 하므로 고객 관점에서 불편한 문제점이 있다. 또한, 상기 선행기술은 단순히 의복만을 고객의 신체에 합성하여 표시하므로, 상기 고객이 구매하고자 하는 의 복을 입고자 하는 환경에 적합한지를 알 수 없는 문제점이 있다."}
{"patent_id": "10-2023-0053744", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-1876994호(2018.07.10. 공고)"}
{"patent_id": "10-2023-0053744", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명의 목적은 의류를 구매하러 매장을 방문한 고객이 의류를 골라 피팅룸에 들어갈 때 고객이 선택 한 의류에 대한 의류정보 및 상기 의류와 관련된 다른 의류들에 대한 정보를 자동 획득하여 표시하고, 피팅룸 내부의 환경을 의류에 대응하는 환경 또는 고객이 선택한 환경으로 조성하며, 피팅룸 밖의 매장 직원의 관리자 단말기와 상호 인터페이스를 수행하여 고객이 피팅룸 밖으로 나가지 않고도 원하는 서비스를 빠르게 받을 수 있 는 의류 피팅룸 커넥티드 시스템 및 방법을 제공함에 있다."}
{"patent_id": "10-2023-0053744", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명에 따른 의류 피팅룸 커넥티드 시스템은: 매장의 스마트 피팅룸에 설 치되어 상기 스마트 피팅룸으로 반입된 하나 이상의 의류 각각에 부착된 태그로부터 상기 의류에 대한 의류정보 를 포함하는 의류 태그정보를 읽고, 상기 의류의 용도 및 의류정보를 전송하고, 이에 대한 응답으로 상기 의류 정보의 의류와 관련된 의류관련정보를 수신받아 표시하며, 상기 용도에 대응하는 환경을 조성하기 위한 피팅룸 환경 설정정보를 수신받아 상기 스마트 피팅룸을 상기 피팅룸 환경 설정정보에 설정된 환경으로 조성하는 스마 트 피팅룸 제어부; 및 상기 매장에서 판매되는 다수의 의류 각각에 대한 용도를 포함하는 의류정보 및 의류관련 정보와, 해당 의류의 용도에 따른 피팅룸 환경 설정정보를 저장하여 관리하고, 상기 스마트 피팅룸 제어부로부 터 상기 의류정보의 수신 시 상기 의류정보에 포함된 의류의 용도에 대응하는 피팅룸 환경 설정정보를 생성하여 상기 의류정보의 의류와 관련된 의류관련정보와 함께 상기 스마트 피팅룸 제어부로 전송하는 피팅 관리부를 포 함하는 것을 특징으로 한다.상기 스마트 피팅룸 제어부는, 유무선 데이터통신망에 유선 및 무선 중 어느 하나로 연결되어 상기 유무선 데이 터통신망에 연결된 상기 피팅 관리부와 데이터통신을 수행하는 통신부; 상기 스마트 피팅룸으로 반입되는 의류 에 부착된 태그로부터 의류 태그정보를 읽어 출력하는 태그 리더기; 상기 의류관련정보를 표시하는 제1디스플레 이부; 상기 피팅룸 환경 설정정보에 대응하도록 스마트 피팅룸 내부의 환경을 조성하는 환경 조성부; 및 상기 태그 리더기를 통해 스마트 피팅룸으로 반입된 의류 각각에 대한 의류 태그정보를 획득하여, 상기 의류 태그정 보에 포함된 의류정보의 의류에 대한 용도 및 의류정보를 포함하는 피팅요청정보를 상기 통신부를 통해 상기 피 팅 관리부로 전송하고 이에 대한 응답으로 상기 의류의 용도 및 고객이 상기 의류를 사고자 하는 용도 중 어느 하나의 용도에 대응하는 환경을 조성하기 위한 피팅룸 환경 설정정보 및 상기 의류관련정보를 포함하는 피팅정 보를 상기 피팅 관리부로부터 수신받아 상기 의류관련정보를 상기 제1디스플레이부를 통해 표시하고, 상기 피팅 룸 환경 설정정보에 따라 환경 조성부를 제어하여 상기 스마트 피팅룸을 상기 피팅룸 환경 설정정보에 대응하는 상기 환경으로 조성하는 제어부를 포함하는 것을 특징으로 한다. 상기 제어부는, 상기 태그 리더기를 통해 상기 스마트 피팅룸으로 반입한 하나 이상의 의류 각각에 부착된 태그 로부터 의류 태그정보를 획득하는 의류 태그정보 획득부; 상기 의류 태그정보가 획득되면, 상기 의류 태그정보 에 포함된 의류정보 및 의류의 용도를 포함하는 피팅요청정보를 생성하여 상기 통신부를 통해 피팅 관리부로 전 송하는 피팅정보 요청부; 상기 피팅요청정보의 전송에 대한 응답으로 상기 피팅 관리부로부터 상기 피팅룸 환경 설정정보 및 상기 의류관련정보를 포함하는 피팅정보를 수신한 후, 상기 피팅정보로부터 의류관련정보 및 피팅 룸 환경 설정정보를 추출하여 각각 출력하는 피팅정보 수신부; 상기 의류관련정보를 입력받아 상기 제1디스플레 이부에 표시하는 피팅 인터페이스부; 및 상기 피팅룸 환경 설정정보를 입력받아 상기 환경 조성부를 제어하여 상기 피팅룸 환경 설정정보에 따라 상기 스마트 피팅룸 내부를 상기 의류정보의 의류 용도에 대응하는 환경으로 조성하는 피팅룸 환경 제어부를 포함하는 것을 특징으로 한다. 상기 제어부는, 스마트 피팅룸 내부로 고객이 입실하는지를 모니터링하는 입실 모니터링부를 더 포함하되, 상기 의류 태그정보 획득부는, 상기 입실 모니터링부를 통해 스마트 피팅룸으로 들어오는 고객이 검출되면 상기 태그 리더기를 구동하여 상기 의류에 부착된 태그로부터 의류 태그정보를 리딩하여 획득하는 것을 특징으로 한다. 상기 환경 조성부는, 영상을 디스플레이하는 제2디스플레이부; 상기 제2디스플레이부에 대향하는 위치에 구성되 어 상기 제2디스플레이부에 표시된 영상 및 상기 스마트 피팅룸에 있는 고객을 표시하는 제3디스플레이부; 스피 커를 포함하여 오디오를 출력하는 오디오 처리부; 및 다양한 색의 빛을 조사하는 조명을 포함하고, 제어를 받아 상기 조명의 밝기 및 색상을 조절하는 조명 처리부를 포함하되, 상기 피팅룸 환경 제어부는, 상기 의류의 용도 또는 스마트 피팅룸에 입실한 고객의 의류 구매 용도에 대응하고 상기 피팅룸 환경 설정정보에 포함되어 수신된 영상을 상기 제2디스플레이부에 표시하고, 상기 피팅룸 환경 설정정보에 포함된 조명 설정정보에 대응하도록 조 명 처리부를 제어하여 상기 스마트 피팅룸 내부에 빛을 조사하며, 상기 피팅룸 환경 설정정보에 포함된 오디오 를 상기 오디오 처리부를 통해 출력하여, 상기 의류의 용도 또는 고객의 의류 구매 용도에 대응하도록 상기 스 마트 피팅룸의 환경을 조성하는 것을 특징으로 한다. 상기 스마트 피팅룸 제어부는, 적어도 하나 이상의 카메라를 포함하는 카메라부; 및 입력부를 더 포함하되, 상 기 제어부는, 상기 제1디스플레이부 및 상기 입력부를 통해 고객이 입을 의류를 선택받거나, 상기 카메라부를 통해 고객이 의류를 입는지를 모니터링하여 고객의 의류 착용 및 착용한 의류를 감지하여 감지한 의류에 대한 의류정보를 출력하는 의류 착용 모니터링부를 더 포함하되, 상기 피팅정보 요청부는, 상기 의류 태그정보 획득 부를 통해 획득된 의류정보의 의류 중 상기 의류 착용 모니터링부를 통해 고객이 입을 의류에 대한 의류정보를 포함하는 피팅요청정보를 상기 피팅 관리부로 전송하는 것을 특징으로 한다. 상기 피팅 인터페이스부는, 상기 제1디스플레이부를 통해 스마트 피팅룸 내에 있는 고객이 상기 스마트 피팅룸 내부로 가져 들어온 의류와 동일 디자인의 색상 및 크기를 변경할 수 있는 사용자 인터페이스 수단을 제공하고, 상기 제어부는, 상기 사용자 인터페이스 수단을 통해 고객이 입고 있는 의류에 대한 색상 및 크기의 변경 요청 시 상기 카메라를 통해 인식되는 상기 의류의 색상 및 크기를 가상으로 변경한 영상을 생성하여 상기 제2디스플 레이부 및 제3디스플레이부 중 어느 하나 이상에 표시하는 가상 착용 시뮬레이션부를 더 포함하는 것을 특징으 로 한다. 상기 시스템은: 상기 스마트 피팅룸 제어부로부터 상기 스마트 피팅룸 내에 있는 고객이 요청한 고객 요청 정보 를 수신하여 점원에게 통지하고, 점원의 응답 시 상기 응답에 대응하는 응답정보를 상기 스마트 피팅룸 제어부 로 전송하는 점원 단말기를 더 포함하고, 상기 스마트 피팅룸 제어부는, 입력부를 더 포함하되, 상기 제어부는, 상기 제1디스플레이부에 고객으로부터 고객 요청 사항을 입력 및 선택받을 수 있는 고객 요청 사용자 인터페이스 수단을 표시하고, 상기 고객 요청 사용자 인터페이스 수단 및 상기 입력부를 통해 고객의 요청 사항을 입력 받고, 입력된 고객 요청 사항에 대한 고객 요청 정보를 생성하여 상기 통신부를 통해 상기 점원 단말기로 전송 하고, 상기 고객 요청 정보에 대한 응답 정보를 수신받아 상기 제1디스플레이부에 표시하는 비대면 인터페이스 부를 더 포함하는 것을 특징으로 한다. 상기와 같은 목적을 달성하기 위한 본 발명에 따른 의류 피팅룸 커넥티드 방법은: 매장의 스마트 피팅룸에 설치 된 스마트 피팅룸 제어부가 상기 스마트 피팅룸으로 반입된 하나 이상의 의류 각각에 부착된 태그로부터 상기 의류에 대한 의류정보를 포함하는 의류 태그정보를 읽고, 상기 의류의 용도 및 의류정보를 전송하는 피팅정보 요청 과정; 상기 매장에서 판매되는 다수의 의류 각각에 대한 용도를 포함하는 의류정보 및 의류관련정보와, 해 당 의류의 용도에 따른 피팅룸 환경 설정정보를 저장하여 관리하는 피팅 관리부가 상기 스마트 피팅룸 제어부로 부터 상기 의류정보의 수신 시 상기 의류정보에 포함된 의류의 용도에 대응하는 피팅룸 환경 설정정보를 생성하 여 상기 의류정보의 의류와 관련된 의류관련정보와 함께 상기 스마트 피팅룸 제어부로 전송하는 피팅정보 제공 과정; 및 상기 스마트 피팅 제어부가 상기 피팅 관리부로부터 상기 피팅요청정보에 대한 응답으로 상기 의류정 보의 의류와 관련된 의류관련정보를 수신받아 표시하며, 상기 용도에 대응하는 환경을 조성하기 위한 피팅룸 환 경 설정정보를 수신받아 상기 스마트 피팅룸을 상기 피팅룸 환경 설정정보에 설정된 환경으로 조성하는 피팅룸 환경 조성 과정을 포함하는 것을 특징으로 한다. 상기 피팅정보 요청 과정은 상기 제어부가 의류 태그정보 획득부에 의해 태그 리더기를 통해 스마트 피팅룸으로 반입한 하나 이상의 의류 각각에 부착된 태그로부터 의류 태그정보를 획득하는 의류 태그정보 획득 단계; 및 상 기 제어부가 상기 의류 태그정보가 획득되면, 피팅정보 요청부를 통해 상기 의류 태그정보의 의류정보 및 의류 의 용도를 포함하는 피팅요청정보를 생성하여 통신부를 통해 상기 피팅 관리부로 전송하는 피팅정보 요청 단계 를 포함하는 것을 특징으로 한다. 상기 피팅룸 환경 조성 과정은, 상기 제어부가 피팅정보 수신부를 통해 상기 피팅요청정보의 전송에 대한 응답 으로 상기 피팅 관리부로부터 상기 피팅룸 환경 설정정보 및 상기 의류관련정보를 포함하는 피팅정보를 수신한 후, 상기 피팅정보로부터 의류관련정보 및 피팅룸 환경 설정정보를 추출하여 각각 출력하는 피팅정보 수신 단계; 상기 제어부가 피팅 인터페이스부를 통해 상기 의류관련정보를 입력받아 제1디스플레이부에 표시하는 피 팅 인터페이스 단계; 및 상기 제어부가 피팅룸 환경 제어부를 통해 상기 피팅룸 환경 설정정보를 입력받아 상기 환경 조성부를 제어하여 상기 피팅룸 환경 설정정보에 따라 상기 스마트 피팅룸 내부의 환경을 상기 의류정보의 의류 용도에 대응하는 환경을 조성하는 피팅룸 환경 조성 단계를 포함하는 것을 특징으로 한다. 상기 피팅정보 요청 과정은, 상기 제어부가 입실 모니터링부를 통해 스마트 피팅룸 내부로 고객이 입실하는지를 모니터링하는 입실 모니터링 단계를 더 포함하되, 상기 의류 태그정보 획득 단계에서, 상기 제어부가 상기 입실 모니터링부를 통해 스마트 피팅룸으로 들어오는 고객이 검출되면 상기 태그 리더기를 구동하여 상기 의류에 부 착된 태그로부터 의류 태그정보를 리딩하여 획득하는 것을 특징으로 한다. 상기 피팅룸 환경 조성 과정은, 상기 제어부의 피팅룸 환경 제어부가 상기 의류의 용도 또는 스마트 피팅룸에 입실한 고객의 의류 구매 용도에 대응하고 상기 피팅룸 환경 설정정보에 포함되어 수신된 영상을 상기 제2디스 플레이부에 표시하는 배경 조성 단계; 상기 피팅룸 환경 제어부가 상기 피팅룸 환경 설정정보에 포함된 조명 설 정정보에 대응하도록 조명 처리부를 제어하여 상기 스마트 피팅룸 내부에 빛을 조사하는 빛 환경 조성 단계; 및 상기 피팅룸 환경 제어부가 상기 피팅룸 환경 설정정보에 포함된 오디오를 상기 오디오 처리부를 통해 출력하는 소리 환경 조성 단계를 포함하여, 상기 의류의 용도 또는 고객의 의류 구매 용도에 대응하도록 상기 스마트 피 팅룸의 환경을 조성하는 것을 특징으로 한다. 상기 피팅정보 요청 과정은, 상기 제어부가 의류 착용 모니터링부를 통해 상기 제1디스플레이부 및 상기 입력부 를 통해 고객이 입을 의류를 선택받거나, 상기 카메라부를 통해 고객이 의류를 입는지를 모니터링하여 고객의 의류 착용 및 착용한 의류를 감지하여 감지한 의류에 대한 의류정보를 출력하는 의류 착용 모니터링 단계를 더 포함하되, 상기 제어부는, 상기 피팅정보 요청 단계에서 상기 의류 태그정보 획득부를 통해 획득된 의류정보의 의류 중 상기 의류 착용 모니터링부를 통해 고객이 입을 의류에 대한 의류정보를 포함하는 피팅요청정보를 상기 피팅 관리부로 전송하는 것을 특징으로 한다. 상기 방법은: 상기 스마트 피팅룸 제어부의 상기 제어부가 상기 사용자 인터페이스 수단을 통해 고객이 입고 있 는 의류에 대한 색상 및 크기의 변경 요청 시 가상 착용 시뮬레이션부에 의해 상기 카메라를 통해 인식되는 상 기 의류의 색상 및 크기를 가상으로 변경한 영상을 생성하여 상기 제2디스플레이부 및 제3디스플레이부 중 어느 하나 이상에 표시하는 가상 착용 시뮬레이션 과정을 더 포함하는 것을 특징으로 한다.상기 방법은: 상기 스마트 피팅룸 제어부가 제1디스플레이부에 고객으로부터 고객 요청 사항을 입력 및 선택받 을 수 있는 고객 요청 사용자 인터페이스 수단을 표시하고, 상기 고객 요청 사용자 인터페이스 수단 및 입력부 를 통해 고객의 요청 사항을 입력받고, 입력된 고객 요청 사항에 대한 고객 요청 정보를 생성하여 통신부를 통 해 스마트 피팅룸 외부에 있는 점원 단말기로 전송하고, 상기 점원 단말기로부터 상기 고객 요청 정보에 대한 응답 정보를 수신받아 상기 제1디스플레이부에 표시하는 비대면 인터페이스 과정을 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0053744", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 고객이 선택한 의류를 가지고 피팅룸에 들어가는 것만으로, 고객이 선택한 의류에 대한 의류정보 및 선택 의류와 잘 매칭되는 의류들에 대한 정보를 고객에게 제공하므로, 고객에게 의류의 선택폭을 넓게 해주고, 편리성을 제공할 수 있는 효과가 있다. 이에 따라 본 발명은 고객이 자신이 선택한 의류뿐만 아니라, 선택한 의류와 잘 어울리는 의류들을 추천받아 확 인할 수 있도록 하므로 고객이 자신에게 맞는 최적의 의류를 구매할 수 있도록 할 수 있는 효과가 있다. 그리고 본 발명은 매장에 대한 고객 만족도를 높이고, 고객이 선택한 의류뿐만 아니라 고객이 선택한 의류에 잘 어울리는 다른 의류들을 추천할 수 있으므로, 다른 의류에 대한 홍보 및 구매를 유도할 수 있으므로 매장의 매 출을 증대시킬 수 있는 효과가 있다. 또한, 본 발명은 피팅룸에 입실한 고객이 입어볼 의류를 변경하고자 하는 경우 피팅룸 내에서 피팅룸 밖의 매장 직원과 상호작용을 하여, 피팅룸에서 바로 원하는 의류를 매장 직원을 통해 받아 바로 입어볼 수 있으므로, 고 객에게 편리성을 제공하고, 빠른 대응으로 고객의 의류 구매를 유도할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0053744", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 발명에 따른 피팅룸 커넥티드 시스템의 구성 및 동작을 상세히 설명하고, 상기 시스템의 피팅룸 커넥티드 방법을 설명한다. 본 발명에서 의류란 상의나 하의뿐만 아니라, 속옷, 모자, 벨트, 신발, 가방 등과 같이 사람이 몸에 걸칠 수 있는 모든 것을 의미한다. 도 1은 본 발명에 따른 의류 피팅룸 커넥티드 시스템의 구성을 나타낸 도면이다. 본 발명에 따른 의류 피팅룸 커넥티드 시스템은 스마트 피팅룸 제어부 및 피팅 관리부를 포함하고, 실 시 예에 따라 점원 단말기를 더 포함한다. 상기 점원 단말기, 스마트 피팅룸 제어부 및 피팅 관리부는 유무선 데이터통신망에 유선 및 무 선 중 어느 하나로 연결되어 상호 데이터통신을 수행한다. 상기 유무선 데이터통신망은 와이파이(WiFi)망 및 지그비(Zigbee)망 중 어느 하나 이상을 포함하는 로컬망 (Local Area Network: LAN) 등이 적용될 수 있을 것이다. 상기 점원 단말기는 매장에서 근무하는 점원이 사용하는 단말기로 데스크톱 컴퓨터, 개인용 컴퓨터, 노 트북 등의 컴퓨터 단말기, 스마트폰, 스마트패드 등의 모바일 단말기 등이 될 수 있으며, 매장 내에 하나 이상 구성될 수 있을 것이다. 상기 점원 단말기는 본 발명에 따른 피팅룸 비대면 서비스를 제공하기 위한 어플리케이션(또는 \"앱\"이라 함)이 설치되어, 유무선 데이터통신망을 통해 스마트 피팅룸 제어부와 데이터통신을 수행한다. 스마트 피팅룸 제어부는 매장 내에 구성되는 피팅룸 중 어느 하나 이상에 설치되어 스마트 피팅룸을 구성한다. 스마트 피팅룸 제어부는 자신이 설치된 스마트 피팅룸으로 반입되는 적어도 하나 이상의 의류 각각에 부 착된 태그로부터 상기 의류에 대한 의류정보를 포함하는 의류 태그정보를 읽어 태그가 부착된 의류에 대한 의류 정보 및 상기 의류와 관련된 의류관련정보를 표시하고, 상기 피팅 관리부로부터 상기 의류 용도 및 고객이 상기 의류를 사고자 하는 고객 의류 용도 중 어느 하나에 대응하는 환경을 조성하기 위한 피팅룸 환경 설정정보 를 수신받아 스마트 피팅룸을 상기 피팅룸 환경 설정종보에 대응하는 상기 환경으로 조성한다. 상기 의류 용도 및 고객 의류 용도의 용도란 의류 제작 시 의도된 의류의 착용 장소, 분야 등으로, 골프(의류), 야구(복), 축구(복) 등의 스포츠 의류, 파티(의류), 수영(복), 등산(의류), 정장, 이브닝드레스, 캐주얼 등이 될 수 있을 것이다. 동일한 의류에 대해 상기 의류 용도와 고객 의류 용도는 동일할 수도 다를 수도 있을 것이다. 예를 들어, 의류의 원래 의류 용도는 골프이나, 고객 의류 용도는 캐주얼 용도일 수 있을 것이다. 상기 스마트 피팅룸 제어부의 상세 구성 및 동작은 다음의 도 3을 참조하여 상세히 설명한다. 피팅 관리부는 상기 매장에서 판매되는 다양한 다수의 의류 각각에 대한 의류정보 및 해당 의류의 용도 에 따른 피팅룸 환경 설정정보를 저장하여 관리한다. 상기 피팅 관리부는 상기 스마트 피팅룸 제어부로부터 피팅요청정보의 수신 시 상기 피팅요청정보에 포 함된 의류에 대응하는 피팅룸 환경 설정정보를 생성하여 상기 스마트 피팅룸 제어부로 제공한다. 상기 피팅 관리부의 상세 구성 및 동작은 다음의 도 4를 참조하여 상세히 설명한다. 도 2는 본 발명에 따른 의류 피팅룸 커넥티드 시스템의 스마트 피팅룸 제어부의 상세 구성을 나타낸 도면이고, 도 3은 본 발명에 따른 의류 피팅룸 커넥티드 시스템의 스마트 피팅룸의 내부 구성을 나타낸 도면이다. 이하 도 2 및 도 3을 참조하여 설명한다. 스마트 피팅룸 제어부는 저장부, 제1디스플레이부, 입력부, 통신부, 태그 리더기 , 환경 조성부 및 제어부를 포함하고, 실시 예에 따라 카메라부를 더 포함할 수 있을 것이다. 저장부는 본 발명에 따른 스마트 피팅룸 제어부의 전반적인 동작을 제어하기 위한 제어프로그램을 저 장하는 프로그램영역, 상기 제어프로그램 수행 중에 발생하는 데이터를 일시 저장하는 임시영역, 상기 제어프로 그램 수행에 필요한 데이터 및 상기 제어프로그램 수행 중에 발생하는 데이터를 반영구적으로 저장하는 데이터 영역을 포함한다. 제1디스플레이부는 제어부의 제어를 받아 도 2에서 보이는 바와 같이 스마트 피팅룸 내부로 가지 고 들어온 의류(c1, c2, c3)에 대한 기본적인 의류정보를 표시하고, 다양한 사용자 인터페이스 수단을 표시하며, 상기 사용자 인터페이스 수단을 통해 의류와 관련된 다양한 정보를 표시한다. 입력부는 상기 제1디스플레이부의 화면에 일체로 구성되어 고객이 터치하는 위치에 대응하는 위치신 호를 출력하는 터치패드, 다수의 텍스트 정보를 입력할 수 있고 다양한 기능을 선택할 수 있으며 화면에 표시된 객체 간 이동 및 선택할 수 있는 키보드 및 상기 화면에 커서를 표시하고, 커서의 위치를 이동시켜, 객체(아이 콘 등)를 선택하고 특정 기능을 선택하는 마우스 등 중 어느 하나 이상을 포함할 수 있을 것이다. 통신부는 상기 유무선 데이터통신망에 유선 및 무선 중 어느 하나로 연결되어, 상기 유무선 데이터통신 망에 접속한 점원 단말기, 피팅 관리부 등과 제어부가 데이터통신을 수행할 수 있도록 한다. 태그 리더기는 스마트 피팅룸의 입구 및 제1디스플레이부 중 어느 하나 이상에 인접한 위치에 설 치되어 스마트 피팅룸으로 반입하는 의류에 부착되어 있는 태그로부터 의류 태그정보를 무선으로 읽어드려 제어부로 출력한다. 상기 태그는 무선주파수식별(Radio Frequency Identification: RFID) 태그, 근거리무선통신(Near Field Communication: NFC) 태그, 바코드 태그, 큐알(QR)코드 대그 등이 될 수 있을 것이다. 상기 태그에는 의류 태그 정보가 저장되며, 상기 의류 태그정보에는 해당 의류의 고유 식별정보인 의류 식별정보만 포함하는 의류정보가 저장될 수도 있고, 의류 식별정보를 포함하고 의류의 이미지, 의류명, 의류 용도, 제작년월일, 디자이너정보,제작사 정보, 간단한 설명 등 중 어느 하나 이상을 더 포함하는 의류정보가 저장될 수도 있을 것이다. 따라서 상기 태그 리더기는 바코드 리더기, QR코드 리더기, RFID 리더기, NFC 리더기 등이 될 수 있으며, 두 가지 이상의 기능이 복합 구성된 리더기일 수도 있을 것이다. 상기 태그는 NFC 태그인 것이 바람직하며, 상기 태그 리더기는 태그가 부착된 의류가 일정 거리 떨어져 있 어도 태그로부터 의류 태그정보를 읽을 수 있도록 구성되는 것이 바람직할 것이다. 환경 조성부는 제2디스플레이부, 제3디스플레이부, 오디오 처리부 및 조명 처리부를 포함하고, 상기 제어부의 제어를 받아 스마트 피팅룸을 고객이 입거나 선택한 의류의 용도에 대응하는 환경을 조성한다. 예를 들면, 고객이 입거나 선택한 의류가 골프 의류이면 환경 조성부는 제어부의 제어를 받아 제2디스플레이부에 골프장의 임의 골프 코스 영상을 표시하고, 조명 처리부를 제어하여 조명를 통해 골프장의 골프 코스에 내리쬐는 강렬한 태양빛을 재생하여 스마트 피팅룸 내부를 조사하며, 오디오 처리부를 제어하여 스피커를 통해 바람 소리, 새소리 등의 자연의 소리를 재생하여 스마트 피팅룸 내에 울리도록 재생할 수 있을 것이다. 또한 제3디스플레이부는 단순한 거울일 수도 있 고, 스마트 미러일 수도 있을 것이다. 제3디스플레이부는 고객이 제2디스플레이부에 표시되는 영상 및 조명에 의해 조사되는 조명의 환경에 서 있는 모습을 볼 수 있도록 한다. 상기 제3디스플레이부가 스마트 미러인 경우, 고객이 고개를 돌리지 않고도 도 3과 같이 자신의 뒷모습을 볼 수 있도록 표시할 수도 있 을 것이다. 상기 제2디스플레이부는 도 3에서 나타낸 바와 같이 프로젝터일 수도 있고, 액정표시장치(Liquid Cryatal Display: LCD) 유기EL 표시장치 등일 수도 있을 것이다. 오디오 처리부는 스마트 피팅룸 내에 구성되는 마이크를 더 포함할 수도 있으며, 마이크를 통해 입력되 는 오디오를 제어부로 출력하도록 구성될 수도 있을 것이다. 카메라부는 하나 이상의 카메라(171, 172)를 포함하고, 카메라를 통해 촬영된 영상을 제어부로 출력 한다. 상기 스마트 피팅룸이 고객이 입고 있던 의류를 탈의하고 구매하고자 하는 의류를 입어보는 장소라는 점에서 고객이 원하는 시점에만 카메라(171, 172)의 렌즈가 스마트 피팅룸 내부를 촬영할 수 있도록 카메라 렌즈의 앞을 물리적으로 차단하거나 해제하는 카메라 차단부(미도시)를 더 포함하도록 구성되는 것이 바람직할 것이다. 한편, 카메라(171, 172)를 통해 촬영된 영상은 저장부의 임시영역에만 임시적으로 저장되며, 외부로 전송 되지 않도록 구성되는 것이 바람직할 것이다. 단, 고객이 스냅샷을 촬영한 경우, 스냅샷 이미지에 대해서만 외 부로 전송하도록 구성될 수는 있을 것이다. 제어부는 의류 태그정보 획득부, 피팅정보 요청부, 피팅정보 수신부, 피팅 인터페이스부 및 피팅룸 환경 제어부를 포함하고, 실시 예에 따라 입실 모니터링부, 고객정보 획득부, 의류 착용 모니터링부, 가상 착용 시뮬레이션부 및 비대면 인터페이스부를 더 포함하여, 본 발 명에 따른 스마트 피팅룸 제어부의 전반적인 동작을 제어한다. 구체적으로 설명하면, 입실 모니터링부는 실시 예에 따라 구성되어 스마트 피팅룸 내부로 고객이 입실 하는지를 모니터링하고, 고객의 입실 감지에 따른 감지 이벤트를 발생시킨다. 상기 고객의 입실 여부는 별도의 인체 감지 센서(미도시)를 통해 감지할 수도 있고, 후술할 의류 태그정보 획득부를 통해 임의 의류에 부착 된 의류 태그정보의 획득 여부에 의해 감지할 수도 있으며, 입력부 및 제1디스플레이부에 표시된 사 용자 인터페이스 수단 중 어느 하나의 입실 버튼의 눌림 여부에 의해 감지할 수도 있을 것이다. 의류 태그정보 획득부는 태그 리더기를 통해 의류에 부착된 태그로부터 태그 의류정보를 획득한다. 상기 태그 의류정보에 포함된 의류정보가 의류 식별정보이면 의류 태그정보 획득부는 태그 의류정보의 획 득 시 태그 의류정보에 포함된 의류 식별정보를 포함하는 의류정보 요청 정보를 피팅 관리부로 전송하고, 그에 대한 의류정보를 피팅 관리부로부터 수신받아 출력하도록 구성될 수도 있을 것이다. 고객정보 획득부는 실시 예에 따라 구성되어, 스마트 피팅룸 내부로 들어온 고객을 식별하고, 피팅 관 리부로부터 식별된 고객에 대한 고객 식별정보를 피팅정보 요청부로 출력하여 피팅 관리부로 제공 한다. 상기 고객을 식별하기 위해 고객 식별정보는 제1디스플레이부에 표시된 사용자 인터페이스 수단 중 고객정보 입력 수단 및 입력부를 통해 고객으로부터 직접 입력받아 획득할 수도 있고, 태그 리더기를통해 고객에게 지급된 고객카드로부터 획득할 수도 있을 것이다. 피팅정보 요청부는 의류 태그정보 획득부를 통해 의류 태그정보가 획득되면 상기 의류 태그정보에 포 함된 의류정보 및 의류의 용도를 포함하는 피팅요청정보를 생성한 후 통신부를 통해 피팅 관리부로 전 송하여 피팅정보를 요청한다. 상기 피팅요청정보는 실시 예에 따라 상기 고객정보 획득부로부터 입력되는 고객 식별정보를 더 포함할 수도 있을 것이다. 상기 의류의 용도는 상기 의류정보에 포함되어 있을 수도 있고, 후술할 피팅 인터페이스부를 통해 고객으로부터 입력받을 수도 있을 것이다. 피팅정보 수신부는 피팅정보 요청부를 통해 피팅요청정보의 발송 후 피팅 관리부로부터 피팅정보가 수 신되는지를 모니터링하고, 피팅정보가 수신되면 피팅정보에 포함된 의류관련정보 및 피팅룸 환경 설정정보를 추 출하고, 상기 의류관련정보를 피팅 인터페이스부로 출력하고, 상기 피팅룸 환경 설정정보를 피팅룸 환경 제어부로 출력한다. 피팅 인터페이스부는 상기 피팅정보 수신부로부터 의류관련정보가 입력되면 제1디스플레이부에 상기 의류관련정보를 표시한다. 상기 피팅 인터페이스부는 상기 의류관련정보를 제2디스플레이부 및 제3디스플레이부 중 어느 하나 이상에 표시할 수도 있을 것이다. 상기 의류관련정보는 상기 의류정보, 상기 의류정보의 의류와 유사하거나 잘 어울리는 유사 의류정보 및 추천 매칭 의류정보가 포함될 수 있을 것이다. 실시 예에 따라 고객 식별정보가 피팅 관리부로 제공되는 경우, 상기 의류관련정보는 상기 고객 식별정보에 기반한 고객의 취향이 반영된 정보일 수 있을 것이다. 피팅 인터페이스부는 고객인 사용자와 인터페이싱을 수행하기 위한 다양한 사용자 인페이스 수단을 제1디 스플레이부에 표시하고, 그에 대응하는 정보를 입력받아 처리하는 동작을 수행한다. 상기 피팅 인터페이스부는 상기 제1디스플레이부를 통해 피팅룸 내에 있는 고객이 상기 피팅룸 내부 로 가져 들어온 의류와 동일 디자인의 색상 및 크기를 변경할 수 있는 색상 및 크기 변경 사용자 인터페이스 수 단을 제공할 수도 있을 것이다. 의류 착용 모니터링부는 실시 예에 따라 구성되어 고객이 스마트 피팅룸 내부로 가지고 들어온 의류를 착용했는지를 모니터링하고, 의류 착용을 감지하고 의류 착용 감지를 피팅정보 요청부, 피팅룸 환경 제어 부 및 가상 착용 시뮬레이션부로 출력한다. 상기 의류 착용 여부는 제1디스플레이부에 표시되는 사용자 인터페이스 수단 및 입력부를 통해 고객으로부터 입력받을 수도 있고, 카메라부를 구비하는 경우, 카메라(171, 172)를 통해 상기 획득된 영상으로부터 인공지능(AI)에 기반하여 상기 의류정보의 의류 착용 여부를 감지하도록 구성될 수도 있을 것이다. 상기 피팅정보 요청부는 실시 예에 따라 의류 착용 모니터링부에 의한 고객의 의류 착용 감지 시 피 팅요청정보를 생성하여 피팅 관리부로 전송하도록 구성될 수도 있을 것이다. 피팅룸 환경 제어부는 상기 피팅정보 수신부로부터 피팅룸 환경 설정정보가 입력되면, 입력된 피팅룸 환경 설정정보에 따라 환경 조성부를 제어하여 스마트 피팅룸 내부의 환경을 의류의 용도에 대응하는 환경이 되도록 조성한다. 가상 착용 시뮬레이션부는 피팅 인터페이스부를 통해 상기 제1디스플레이부에 표시되는 색상 및 크기 변경 사용자 인터페이스 수단을 통해 고객이 입고 있는 의류에 대한 색상 및 크기의 변경 요청 시 상기 카 메라(71, 72)를 통해 인식되는 상기 의류의 색상 및 크기를 가상으로 변경한 영상을 생성하여 상기 제2디스플레 이부 및 제3디스플레이부 중 어느 하나 이상에 표시한다. 비대면 인터페이스부는 상기 제1디스플레이부에 고객으로부터 고객 요청 사항을 입력 및 선택받을 수 있는 고객 요청 사용자 인터페이스 수단을 표시하고, 상기 고객 요청 사용자 인터페이스 수단 및 상기 입력 부를 통해 고객의 요청 사항을 입력받고, 입력된 고객 요청 사항에 대한 고객 요청 정보를 생성하여 상기 통신 부를 통해 상기 점원 단말기로 전송하고, 상기 고객 요청 정보에 대한 응답 정보를 상기 점원 단말기 로부터 수신받아 상기 제1디스플레이부에 표시한다. 상기 고객 요청 사항은 의류(c1, c2, c3)의 변경, 반입한 의류(c1, c2, c3)의 사이즈(Size), 색상 변경 요청 등이 될 수 있을 것이다. 의류의 변경 시 비대면 인 터페이스부는 매장에서 판매하는 의류 리스트를 제공하고, 제공된 의류 리스트에서 임의의 의류를 선택 받을 수 있는 의류 선택 수단을 제공할 것이다. 도 4는 본 발명에 따른 의류 피팅룸 커넥티드 시스템의 피팅 관리부의 구성을 나타낸 도면이다. 도 4를 참조하면, 피팅 관리부는 서버 저장부, 서버 통신부 및 서버 제어부를 포함한다. 서버 저장부는 피팅 관리부의 전반적인 동작을 제어하기 위한 제어프로그램을 저장하는 프로그램영역, 상기 제어프로그램 수행 중에 발생하는 데이터를 일시 저장하는 임시영역, 상기 제어프로그램 수행에 필요한 데 이터 및 상기 제어프로그램 수행 중에 발생한 데이터를 반영구적으로 저장하는 데이터영역을 포함한다. 상기 데 이터영역에는 상품 DB, 피팅룸 환경 DB 및 고객 DB이 구성될 수 있을 것이다. 상기 상품 DB는 매장에 있는 또는 동일 가맹점 매장에 있는 의류들에 대한 의류식별정보별 의류관련정 보를 저장한다. 상기 의류관련정보는 의류 이미지, 의류 설명, 의류 용도, 가격, 재고수량, 재고지점 등을 포함 하는 의류정보, 의류별 유사 의류정보 및 추천 매칭 의류정보를 포함한다. 상기 유사 의류정보는 임의 의류와 유사한 디자인, 용도 등의 하나 이상의 의류에 대한 의류정보를 의미한다. 상기 추천 매칭 의류정보는 임의 의 류와 잘 어울리는 하나 이상의 의류에 대한 의류정보를 의미한다. 피팅룸 환경 DB는 의류 용도별 피팅룸 환결 설정정보를 저장한다. 상기 피팅룸 환경 설정정보는 용도별로 하나 이상의 장소에 대한 영상, 용도 및 장소별 오디오, 용도 및 장소별 조명정보를 포함한다. 고객 DB는 고객별 고객 식별정보를 포함하는 고객정보, 고객 취향정보, 고객 의류 구매 이력 정보 등을 저 장할 수 있을 것이다. 상기 고객 식별정보는 고객의 고유의 고객 식별번호를 포함하고, 이름, 전환번호 등을 더 포함할 수 있을 것이다. 상기 고객 취향정보는 고객 좋아하는 의류 종류, 디자인, 색상, 크기에 대한 정보를 포 함할 수 있을 것이다. 서버 통신부는 유무선 데이터통신망에 유선으로 연결되어 상기 유무선 데이터통신망에 연결된 점원 단말기, 스마트 피팅룸 제어부 등과 서버 제어부가 상호 데이터통신을 수행할 수 있도록 한다. 서버 제어부는 피팅 요청 모니터링부, 검색부 및 피팅룸 환경 설정정보 제공부를 포함하고, 실시 예에 따라 의류정보 요청 모니터링부, 정보 제공부, 고객 취향정보 수집부 및 비대면 서비스 중계부를 더 포함하여, 본 발명에 따른 피팅 관리부의 전반적인 동작을 제어한다. 의류정보 요청 모니터링부는 실시 예에 따라 구성되어 스마트 피팅룸 제어부로부터 의류 요청 정보가 수신되면 상기 의류 요청 정보에 포함된 의류 식별정보에 대응하는 의류정보를 상품 DB에서 검색하여 정보 제공부로 출력한다. 정보 제공부는 상기 의류정보를 서버 통신부를 통해 스마트 피팅룸 제어부로 제공한다. 피팅 요청 모니터링부는 서버 통신부를 통해 스마트 피팅룸 제어부로부터 피팅요청정보가 수신되 는지를 모니터링하고, 피팅요청정보의 수신 시 피팅요청정보에 포함되고 의류 원래의 의류 용도 및 고객이 선택 한 의류 용도 중 어느 하나 이상을 포함하는 의류정보를 검색부로 출력한다. 실시 예에 따라 피팅요청정보 에 고객 식별정보가 포함되어 있는 경우, 상기 피팅 요청 모니터링부는 고객 식별정보도 검색부로 출 력한다. 검색부는 의류관련정보 검색부 및 피팅룸 환경 설정정보 검색부를 포함하고, 실시 예에 따라 고 객정보 검색부를 더 포함한다. 고객정보 검색부는 상기 피팅 요청 모니터링부로부터 고객 식별정보가 입력되면 고객 DB에서 상 기 고객 식별정보에 대응하는 고객의 취향정보, 의류 구매 이력 정보 등 중 어느 하나 이상을 포함하는 고객이 용정보를 수집하여 피팅정보 제공부로 출력한다. 의류관련정보 검색부는 상기 의류정보를 입력받고, 상품 DB로부터 상기 피팅요청정보에 포함된 의류 정보의 의류와 유사한 유사 의류 및 추천 매칭 의류를 검색하여, 유사 의류정보 및 추천 매칭 의류정보를 생성 하여 상기 의류정보, 유사 의류정보, 추천 매칭 의류정보를 포함하는 의류관련정보를 생성하여 피팅정보 제공부 로 출력한다. 피팅룸 환경 설정정보 검색부는 상기 의류정보를 입력받고, 피팅룸 환경 DB로부터 상기 의류정보의 의류 용도에 대응하는 피팅룸 환경 설정정보를 검색하여 피팅정보 제공부로 출력한다. 피팅정보 제공부는 피팅룸 환경 설정정보 검색부로부터 의류정보, 유사 의류정보 및 추천 매칭 의류 정보를 포함하는 의류관련정보 및 피팅룸 환경 설정정보를 입력받고, 상기 의류관련정보 및 피팅룸 환경 설정정 보를 포함하는 피팅정보를 생성한 후, 서버 통신부를 통해 스마트 피팅룸 제어부로 전송한다.고객 취향정보 수집부는 점원 단말기 또는 포스 단말기(미도시)를 통해 고객의 구매한 의류에 대한 의 류정보 및 고객정보를 획득하여, 고객 구매 이력 정보를 생성하여 고객 DB에 저장하고, 고객의 고객 구매 이력 정보에 기반하여 고객의 취향정보(고객이 주로 구매하는 색상, 사이즈, 디자인, 용도 등)를 생성하여 고객 DB에 저장한다. 비대면 서비스 중계부는 스마트 피팅룸 제어부로부터 비대면 서비스의 요청이 발생되면 점원 단말기 를 상기 스마트 피팅룸 제어부에 연결하여 고객과 점원 간의 상호작용(요청 및 응답)을 중계한다. 도 5는 본 발명의 일실시 예에 따른 의류 피팅룸 커넥티드 방법을 나타낸 흐름도이다. 도 5를 참조하면, 스마트 피팅룸 제어부의 제어부는 고객이 스마트 피팅룸으로 들어오는지를 모니 터링한다(S111). 고객이 스마트 피팅룸으로 들어오면 제어부는 태그 리더기를 통해 태그 의류정보가 리드되는지의 여부에 의해 스마트 피팅룸으로 반입된 의류가 인식되는지를 모니터링한다(S113). 의류가 인식되지 않으면 제어부는 의류를 인식할 것을 요청하는 메시지를 제1디스플레이부, 제2디스 플레이부 및 제3디스플레이부 중 어느 하나 이상을 통해 표시한다(S115). 의류가 인식되면 제어부는 상기 태그 의류정보로부터 의류정보가 획득되거나, 상기 태그 의류정보에 의류 식별정보만 포함되어 있는 경우 피팅 관리부로부터 의류정보가 획득되는지를 판단한다(S117). 의류정보가 획득되면 제어부는 인식된 적어도 하나 이상의 의류에 대한 의류정보를 제1디스플레이부 에 표시한다(S119). 의류정보가 표시되면 제어부는 제1디스플레이부에 표시된 사용자 인터페이스 수단 및 입력부를 통해 제1디스플레이부의 상기 사용자 인터페이스 수단을 통해 표시된 적어도 하나 이상의 의류 중 고객이 입을 의류가 선택되는지를 검사하거나, 카메라부를 통해 고객이 의류를 착용하였는지를 검사하여 고객의 의류 착용 여부를 판단한다(S121). 고객이 의류를 착용한 것으로 판단되면 제어부는 고객이 착용한 의류에 대한 의류정보를 포함하는 피팅요 청정보를 생성하여 피팅 관리부로 전송하고(S123), 상기 피팅요청정보의 전송에 대한 응답정보인 피팅정보 가 상기 피팅 관리부로부터 수신되는지를 모니터링한다(S125). 피팅정보가 수신되면 제어부는 피팅정보로부터 의류관련정보 및 피팅룸 환경 설정정보를 추출한(S127) 후, 의류관련정보를 제1디스플레이부에 표시한다(S129). 의류관련정보가 표시되면 제어부는 환경 조성부를 통해 스마트 피팅룸 내부를 피팅룸 환경 설정정 보에 대응하는 환경으로 조성한다(S131). 스마트 피팅룸의 환경 조성 후, 제어부는 의류 교환 이벤트가 발생되는지를 검사한다(S133). 상기 의류 교환 이벤트는 제1디스플레이부에 표시되는 사용자 인터페이스 수단의 의류 사이즈 변경, 색상 변경, 반입 의류의 착용 의류 변경 등에 의해 발생될 수 있을 것이다. 의류 교환 이벤트가 발생되면 제어부는 반입 의류 교체 착용인지를 판단한다(S134). 반입 의류 교체 착용이면 제어부는 상술한 S121로 진행하여 상술한 S121 이후 과정을 반복 수행한다. 그러나 반입 의류 교체 착용이 아니면 제어부는 피팅룸 비대면 서비스 및 가상 착용 서비스 중 하나를 선 택할 것을 요청하고(S135) 피팅룸 비대변 서비스가 선택되는지 가상 착용 서비스가 선택되는지를 판단한다 (S133). 피팅룸 비대면 서비스가 선택되면 제어부는 통신부, 유무선 데이터통신망 및 피팅 관리부를 통해 점원 단말기와 연결하여 피팅룸 비대면 서비스를 제공한다(S137). 상기 피팅룸 비대면 서비스는 다음 의 도 6을 참조하여 상세히 설명한다. 가상 착용 서비스가 선택되면, 제어부는 현재 착용 중인 의류의 사이즈 변경 또는 색상 변경을 요청하고 (S139), 고객이 사이즈 또는 색상 변경을 요청하면 현재 입고 있는 의류의 사이즈 또는 색상을 가상으로 변경한 가상현실 영상을 생성하여 제2디스플레이부 및 제3디스플레이부(스마트 미러인 경우)에 표시한다 (S141). 도 6은 본 발명의 일실시 예에 따른 의류 피팅룸 커넥티드 방법 중 피팅룸 비대면 서비스 제공 방법을 나타낸 절차도로, 피팅 관리부의 중계 과정을 제외한 절차도이다. 도 6을 참조하여 피팅룸 비대면 서비스 제공 방법을 설명하면, 스마트 피팅룸 제어부는 피팅룸 비대면 서비 스 이벤트가 발생하는지를 모니터링한다(S211). 상술한 도 5의 S133에서와 같이 피팅룸 비대면 서비스 요청이 발생하여 피팅룸 비대면 서비스 이벤트가 발생되 면, 스마트 피팅룸 제어부는 제1디스플레이부를 통해 고객의 요청 사항을 선택 또는 입력할 것을 요청 한다(S213). 상기 고객의 요청 사항의 요청 후, 스마트 피팅룸 제어부는 요청 사항이 선택 또는 입력되는지를 모니터링 하고(S215), 고객 요청 사항이 선택 또는 입력되면 고객 비대면 요청 정보를 생성한(S217) 후, 점원 단말기(1 0)로 전송한다(S219). 점원 단말기는 고객 비대면 요청 정보가 수신되는지를 모니터링하던 중(S221), 스마트 피팅룸 제어부로 부터 고객 비대면 요청 정보가 수신되면 알람을 발생하여 고객 비대면 요청 정보 수신되었음을 점원에게 알리고 (S213), 점원이 고객 비대면 요청 정보의 수신 확인을 요청하는지를 판단한다(S215). 점원의 수신 확인 요청이 발생되면, 점원 단말기는 고객 비대면 요청 정보를 표시하고(S217), 점원이 고객 비대면 요청 정보를 확인했는지를 판단한다(S219). 점원이 고객 비대면 요청 정보를 확인한 것으로 판단되면 점원 단말기는 스마트 피팅룸 제어부와 채널 을 형성하여 고객의 상세 요청 사항을 확인한다(S221). 상기 채널은 채팅 채널일 수도 있고, 음성 채널일 수도 있을 것이다. 상기 채널을 통해 고객의 상세 요청 사항이 확인되면 점원 단말기는 점원으로부터 상세 요청 사항 확인 이 벤트의 발생 시 요청 확인 정보를 스마트 피팅룸 제어부로 전송한다(S223). 상기 요청 확인 정보는 고객이 최종 요청한 의류에 대한 의류정보를 포함하며, 제1디스플레이부에 표시될 것이다. 상기 요청 확인 정보의 수신 후 스마트 피팅룸 제어부는 태그 리더기를 통해 상기 요청 확인 정보의 의류정보에 대응하는 의류 태그정보가 인식되는지를 모니터링하고(S225), 의류 태그정보가 획득되면 요청 사항 과 일치되는지를 판단한다(S227). 요청사항과 일치하지 않으면 스마트 피팅룸 제어부는 비일치에 따른 정보를 제1디스플레이부에 표시하 고(S229), 일치하면 일치에 따른 정보를 제2디스플레이부에 표시한다(S231). 상기 비일치에 따른 정보는 인식된 의류가 요청된 의류와 다른 의류임을 나타내는 정보로, 사이즈의 불일치, 색 상의 불일치, 의류 종류 또는 디자인의 불치 여부 정보를 포함할 수 있을 것이다. 상기 일치에 따른 정보는 해 당 의류의 의류정보일 수 있을 것이다. 한편, 본 발명은 전술한 전형적인 바람직한 실시 예에만 한정되는 것이 아니라 본 발명의 요지를 벗어나지 않는"}
{"patent_id": "10-2023-0053744", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "범위 내에서 여러 가지로 개량, 변경, 대체 또는 부가하여 실시할 수 있는 것임은 당해 기술분야에서 통상의 지 식을 가진 자라면 용이하게 이해할 수 있을 것이다. 이러한 개량, 변경, 대체 또는 부가에 의한 실시가 이하의 첨부된 특허청구범위의 범주에 속하는 것이라면 그 기술사상 역시 본 발명에 속하는 것으로 보아야 한다."}
{"patent_id": "10-2023-0053744", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 의류 피팅룸 커넥티드 시스템의 구성을 나타낸 도면이다. 도 2는 본 발명에 따른 의류 피팅룸 커넥티드 시스템의 스마트 피팅룸 제어부의 상세 구성을 나타낸 도면이다. 도 3은 본 발명에 따른 의류 피팅룸 커넥티드 시스템의 스마트 피팅룸의 내부 구성을 나타낸 도면이다. 도 4는 본 발명에 따른 의류 피팅룸 커넥티드 시스템의 피팅 관리부의 구성을 나타낸 도면이다. 도 5는 본 발명의 일실시 예에 따른 의류 피팅룸 커넥티드 방법을 나타낸 흐름도이다. 도 6은 본 발명의 일실시 예에 따른 의류 피팅룸 커넥티드 방법 중 피팅룸 비대면 서비스 제공 방법을 나타낸 절차도이다."}
