{"patent_id": "10-2023-0066123", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0168589", "출원번호": "10-2023-0066123", "발명의 명칭": "전지 수명을 예측하기 위한 전지 수명 예측 방법", "출원인": "한국에너지기술연구원", "발명자": "이찬우"}}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전지 수명을 예측하기 위한 전지 수명 예측 방법에 있어서,C-V(Capacity-Voltage) 곡선을 기초로 방전 곡선을 추출하는 단계;상기 방전 곡선의 변화에 대한 보조 함수를 이용하는 단계;상기 보조 함수를 기초로 특성치를 도출하는 단계;중요도에 따라 특성을 분류하는 단계; 및회귀 모델에 따른 값을 기초로 모델을 선택하는 단계를 포함하는 전지 수명 예측 방법."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 방전 곡선을 추출하는 단계는,수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출하는 전지 수명 예측 방법."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 방전 곡선을 추출하는 단계는,초기의 방전 곡선 및 중기의 방전 곡선을 추출하되,상기 보조 함수를 이용하는 단계는,상기 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 상기 중기의 방전 곡선의 적어도 일부 지점의 좌표 값을 이용하는 전지 수명 예측 방법."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 특성치를 도출하는 단계는,상기 보조 함수와 관련된 최솟값, 편차, 왜도, 첨도 중 적어도 하나를 계산하는 단계를 더 포함하는 전지 수명 예측 방법."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 특성을 분류하는 단계는,상기 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관관계를 정량화하는 단계를 더 포함하는 전지 수명 예측 방법."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "전지 수명을 예측하기 위한, 컴퓨터로 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램에 있어서, 상기 컴퓨터프로그램은 컴퓨팅 디바이스의 하나 이상의 프로세서에서 실행되는 경우 전지 수명 예측 방법을 제공하기 위한공개특허 10-2024-0168589-3-동작들을 수행하도록 하며, 상기 동작들은,C-V 곡선을 이용하여 방전 곡선을 추출하는 동작;상기 방전 곡선의 변화에 대한 보조 함수를 이용하는 동작;상기 보조 함수를 기초로 특성치를 도출하는 동작;중요도에 따라 특성을 분류하는 동작; 및회귀 모델에 따른 값을 기초로 모델을 선택하는 동작을 포함하는 컴퓨터 프로그램."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 방전 곡선을 추출하는 동작은,수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출하는 컴퓨터 프로그램."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 방전 곡선을 추출하는 동작은,초기의 방전 곡선 및 중기의 방전 곡선을 추출하되,상기 보조 함수를 이용하는 동작은,상기 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 상기 중기의 방전 곡선의 적어도 일부 지점의 좌표 값을 이용하는 컴퓨터 프로그램."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 특성치를 도출하는 동작은,상기 보조 함수와 관련된 최솟값, 편차, 왜도, 첨도 중 적어도 하나를 계산하는 동작을 더 포함하는 컴퓨터 프로그램."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 특성을 분류하는 동작은,상기 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관관계를 정량화하는 동작을 더 포함하는 컴퓨터 프로그램."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전지 수명을 예측하기 위한 전지 수명 예측 장치에 있어서,C-V 곡선을 이용하여 방전 곡선을 추출하는 방전 곡선 추출부;상기 방전 곡선의 변화에 대한 보조 함수를 이용하는 보조 함수 이용부;상기 보조 함수를 기초로 특성치를 도출하는 특성치 도출부;중요도에 따라 특성을 분류하는 특성 분류부; 및회귀 모델에 따른 값을 기초로 모델을 선택하는 모델 선택부공개특허 10-2024-0168589-4-를 포함하는 전지 수명 예측 장치."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 방전 곡선 추출부는,수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출하는 전지 수명 예측 장치."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 방전 곡선 추출부는,초기의 방전 곡선 및 중기의 방전 곡선을 추출하되,상기 보조 함수 이용부는,상기 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 상기 중기의 방전 곡선의 적어도 일부 지점의 좌표 값을 이용하는 전지 수명 예측 장치."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 특성치 도출부는,상기 보조 함수와 관련된 최솟값, 편차, 왜도, 첨도 중 적어도 하나를 계산하는 전지 수명 예측 장치."}
{"patent_id": "10-2023-0066123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 특성 분류부는,상기 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관관계를 정량화하는 전지 수명 예측 장치."}
{"patent_id": "10-2023-0066123", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일실시예에 따른 전지 수명을 예측하기 위한 전지 수명 예측 방법은, C-V(Capacity-Voltage) 곡선을 기초로 방전 곡선을 추출하는 단계; 상기 방전 곡선의 변화에 대한 보조 함수를 이용하는 단계; 상기 보조 함수를 기초로 특 성치를 도출하는 단계; 중요도에 따라 특성을 분류하는 단계; 및 회귀 모델에 따른 값을 기초로 모델을 선택하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0066123", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 일실시예는 전지 수명을 예측하기 위한 전지 수명 예측 방법 및 장치, 컴퓨터 프로그램에 관한 것으 로, 구체적으로는 인공지능 기반 상용 이차 전지 진단 기술에 관한 것이다."}
{"patent_id": "10-2023-0066123", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "친환경차 보급로드맵에 따르면, 전기차 보급은 기하급수적으로 증가하고 있으며, 전 세계적으로 전기차의 판매 대수는 점점 증가 추세에 있다. 이와 같이, 전 세계적으로 전기 교통 수단 시장이 폭발적으로 확대하고 있어, 핵심 부품인 전지에 대한 관심도 가 급격히 늘어날 것으로 예상되나, 전지의 수명을 예측하는데 있어서 많은 문제들이 발생하고 있다. 이러한 문제를 해결하기 위해서 연구가 진행되고 있으나 많은 문제들을 해결하지는 못하고 있는 실정이다."}
{"patent_id": "10-2023-0066123", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일실시예에 따른 전지 수명을 예측하기 위한 전지 수명 예측 방법은, C-V(Capacity-Voltage) 곡선을 기초로 방 전 곡선을 추출하는 단계; 상기 방전 곡선의 변화에 대한 보조 함수를 이용하는 단계; 상기 보조 함수를 기초로 특성치를 도출하는 단계; 중요도에 따라 특성을 분류하는 단계; 및 회귀 모델에 따른 값을 기초로 모델을 선택 하는 단계를 포함할 수 있다.일실시예에 따른 상기 방전 곡선을 추출하는 단계는, 수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출 할 수 있다. 일실시예에 따른 상기 방전 곡선을 추출하는 단계는, 초기의 방전 곡선 및 중기의 방전 곡선을 추출하되, 상기 보조 함수를 이용하는 단계는, 상기 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 상기 중기의 방전 곡선 의 적어도 일부 지점의 좌표 값을 이용할 수 있다. 일실시예에 따른 상기 특성치를 도출하는 단계는, 상기 보조 함수와 관련된 최솟값, 편차, 왜도, 첨도 중 적어 도 하나를 계산하는 단계를 더 포함할 수 있다. 일실시예에 따른 상기 특성을 분류하는 단계는, 상기 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관 관계를 정량화하는 단계를 더 포함할 수 있다. 일실시예에 따른 전지 수명을 예측하기 위한, 컴퓨터로 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램에 있 어서, 상기 컴퓨터 프로그램은 컴퓨팅 디바이스의 하나 이상의 프로세서에서 실행되는 경우 전지 수명 예측 방 법을 제공하기 위한 동작들을 수행하도록 하며, 상기 동작들은, C-V 곡선을 이용하여 방전 곡선을 추출하는 동 작; 상기 방전 곡선의 변화에 대한 보조 함수를 이용하는 동작; 상기 보조 함수를 기초로 특성치를 도출하는 동 작; 중요도에 따라 특성을 분류하는 동작; 및 회귀 모델에 따른 값을 기초로 모델을 선택하는 동작을 포함할 수 있다. 일실시예에 따른 상기 방전 곡선을 추출하는 동작은, 수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출 할 수 있다. 일실시예에 따른 상기 방전 곡선을 추출하는 동작은, 초기의 방전 곡선 및 중기의 방전 곡선을 추출하되, 상기 보조 함수를 이용하는 동작은, 상기 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 상기 중기의 방전 곡선 의 적어도 일부 지점의 좌표 값을 이용할 수 있다. 일실시예에 따른 상기 특성치를 도출하는 동작은, 상기 보조 함수와 관련된 최솟값, 편차, 왜도, 첨도 중 적어 도 하나를 계산하는 동작을 더 포함할 수 있다. 일실시예에 따른 상기 특성을 분류하는 동작은, 상기 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관 관계를 정량화하는 동작을 더 포함할 수 있다. 일실시예에 따른 전지 수명을 예측하기 위한 전지 수명 예측 장치는, C-V 곡선을 이용하여 방전 곡선을 추출하 는 방전 곡선 추출부; 상기 방전 곡선의 변화에 대한 보조 함수를 이용하는 보조 함수 이용부; 상기 보조 함수 를 기초로 특성치를 도출하는 특성치 도출부; 중요도에 따라 특성을 분류하는 특성 분류부; 및 회귀 모델에 따 른 값을 기초로 모델을 선택하는 모델 선택부를 포함할 수 있다. 일실시예에 따른 상기 방전 곡선 추출부는, 수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출할 수 있다. 일실시예에 따른 상기 방전 곡선 추출부는, 초기의 방전 곡선 및 중기의 방전 곡선을 추출하되, 상기 보조 함수 이용부는, 상기 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 상기 중기의 방전 곡선의 적어도 일부 지점 의 좌표 값을 이용할 수 있다. 일실시예에 따른 상기 특성치 도출부는, 상기 보조 함수와 관련된 최솟값, 편차, 왜도, 첨도 중 적어도 하나를 계산할 수 있다. 일실시예에 따른 상기 특성 분류부는, 상기 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관관계를 정 량화할 수 있다."}
{"patent_id": "10-2023-0066123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 기술 사상은 설명되는 일부 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 기술 사상 범위 내에서라면, 실시 예들간 그 구성 요소들 중 하나 이상을 선택적으로 결합, 치환하여 사용할 수 있다. 또한, 본 발명의 실시예에서 사용되는 용어(기술 및 과학적 용어를 포함)는, 명백하게 특별히 정의되어 기술되"}
{"patent_id": "10-2023-0066123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "지 않는 한, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 일반적으로 이해될 수 있는 의미로 해 석될 수 있으며, 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미를 고려 하여 그 의미를 해석할 수 있을 것이다. 또한, 본 발명의 실시예에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함할 수 있고, “A 및(와) B, C 중 적 어도 하나(또는 한 개 이상)”로 기재되는 경우 A, B, C로 조합할 수 있는 모든 조합 중 하나 이상을 포함할 수 있다. 또한, 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본 질이나 차례 또는 순서 등으로 한정되지 않는다. 그리고, 어떤 구성 요소가 다른 구성요소에 '연결', '결합' 또는 '접속'된다고 기재된 경우, 그 구성 요소는 그 다른 구성 요소에 직접적으로 연결, 결합 또는 접속되는 경우뿐만 아니라, 그 구성 요소와 그 다른 구성 요소 사이에 있는 또 다른 구성 요소로 인해 '연결', '결합' 또는 '접속' 되는 경우도 포함할 수 있다. 또한, 각 구성 요소의 “상(위) 또는 하(아래)”에 형성 또는 배치되는 것으로 기재되는 경우, 상(위) 또는 하 (아래)는 두 개의 구성 요소들이 서로 직접 접촉되는 경우뿐만 아니라 하나 이상의 또 다른 구성 요소가 두 개 의 구성 요소들 사이에 형성 또는 배치되는 경우도 포함한다. 또한, “상(위) 또는 하(아래)”으로 표현되는 경 우 하나의 구성 요소를 기준으로 위쪽 방향뿐만 아니라 아래쪽 방향의 의미도 포함할 수 있다. 이하, 첨부된 도면을 참조하여 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거나 대응하는 구성 요 소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 도 1은 일실시예에 따른 전지 수명을 예측하기 위한 전지 수명 예측 방법의 흐름도이다. 일실시예에 따르면, 전지 수명을 예측하기 위한 전지 수명 예측 방법의 각 단계는, 후술되는 전지 수명을 예측 하기 위한 전지 수명 예측 장치에 의해 수행될 수 있다. 전지 수명을 예측하기 위한 전지 수명 예측 방법은, 전 지 수명 예측 장치가 수행하는 모든 동작/기능/특징 등을 포함할 수 있다. 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 전지 수명 예측 기기, 전지와 관련된 기기, 장치, 기구, 회 로, 후술되는 컴퓨팅 디바이스 등의 적어도 일부를 포함할 수 있다. 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 명세서 내의 수식 또는 그래프 등의 적어도 일부를 이용하 여, 전지 수명을 예측하기 위한 전지 수명 예측 방법을 수행할 수 있다.전지 수명 예측 장치는, 각 배터리(셀) 별 방전 C-V 파형을 기반으로 방전 프로파일 생성한 이후, 측정 초/중기 간 곡선 파형 차이를 보조함수로 도입한 다음, 특성치를 도출하고 특성을 분류한 이후에 회귀 모델을 자동으로 선택할 수 있다. 단계에서, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, C-V(Capacity-Voltage) 곡선을 기초로 방전 곡선을 추출할 수 있다. 단계에서, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 방전 곡선의 변화에 대한 보조 함수를 이용 할 수 있다. 단계에서, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 보조 함수를 기초로 특성치를 도출할 수 있 다. 단계에서, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 중요도에 따라 특성을 분류할 수 있다. 단계에서, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 회귀 모델에 따른 값을 기초로 모델을 선택 할 수 있다. 일실시예에 따르면, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출할 수 있다. 일실시예에 따르면, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 초기의 방전 곡선 및 중기의 방전 곡선 을 추출하되, 보조 함수를 이용하는 단계는, 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 중기의 방전 곡선의 적어도 일부 지점의 좌표 값을 이용할 수 있다. 일실시예에 따르면, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 보조 함수와 관련된 최솟값, 편차, 왜 도, 첨도 중 적어도 하나를 계산할 수 있다. 일실시예에 따르면, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관관계를 정량화할 수 있다. 도 2는 일실시예에 따른 전지 수명을 예측하기 위한, 컴퓨터로 판독 가능한 기록 매체에 저장된 컴퓨터 프로그 램을 실행하는 프로세서를 구비하는 컴퓨팅 디바이스에 대한 블록도이다. 컴퓨터 프로그램은 상술된 전지 수명 예측 방법의 각 단계의 적어도 일부를 명령어, 코드 등으로 포함할 수 있 다. 컴퓨팅 디바이스는, 프로세서, 메모리, 데이터송수신기 등의 적어도 일부를 포함할 수 있다. 컴퓨팅 디바이스는, 기록 매체를 포함할 수 있다. 컴퓨팅 디바이스는, 동작들을 수행하기 위한 데이터 등을 수신하거나 또는 동작들을 수행하여 도출된/획득된 데이터 등을 전송할 수 있다. 기록 매체는 컴퓨팅 디바이스에 탈착 가능하거나 또는 삽입 가능한 기록 매체일 수 있으며, 비휘발성 기록 매체, CD, 하드 디스크, 플래쉬 메모리, SSD 등의 적어도 일부를 포함할 수 있다. 기록 매체는 컴퓨 팅 디바이스에 장착될 수도 있다. 일실시예에 따르면, 전지 수명을 예측하기 위한, 컴퓨터로 판독 가능한 기록 매체에 저장된 컴퓨터 프로그 램은 컴퓨팅 디바이스의 하나 이상의 프로세서에서 실행되는 경우 상술한 전지 수명 예측 방법을 제 공하기 위한 동작들을 수행하도록 할 수 있다. 이 동작들은, C-V 곡선을 이용하여 방전 곡선을 추출하는 동작, 방전 곡선의 변화에 대한 보조 함수를 이용하는 동작, 보조 함수를 기초로 특성치를 도출하는 동작, 중요도에 따라 특성을 분류하는 동작, 및 회귀 모델에 따른 값을 기초로 모델을 선택하는 동작을 포함할 수 있다. 일실시예에 따르면, 방전 곡선을 추출하는 동작은, 수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출할 수 있다. 프로세서는, 수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출할 수 있다. 일실시예에 따르면, 방전 곡선을 추출하는 동작은, 초기의 방전 곡선 및 중기의 방전 곡선을 추출하되, 보조 함 수를 이용하는 동작은, 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 중기의 방전 곡선의 적어도 일부 지 점의 좌표 값을 이용할 수 있다. 프로세서는, 초기의 방전 곡선 및 중기의 방전 곡선을 추출하되, 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 중기의 방전 곡선의 적어도 일부 지점의 좌표 값을 이용할 수 있다.일실시예에 따르면, 특성치를 도출하는 동작은, 보조 함수와 관련된 최솟값, 편차, 왜도, 첨도 중 적어도 하나 를 계산하는 동작을 더 포함할 수 있다. 프로세서는, 보조 함수와 관련된 최솟값, 편차, 왜도, 첨도 중 적 어도 하나를 계산할 수 있다. 일실시예에 따르면, 특성을 분류하는 동작은, 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관관계를 정량화하는 동작을 더 포함할 수 있다. 프로세서는, 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관관계를 정량화할 수 있다. 도 3은 일실시예에 따른 충방전 C-V 곡선으로부터 방전 곡선 분리 및 전처리를 나타내는 도면이다. 전지 수명 예측 장치는, 충방전 C-V 곡선으로부터 방전 곡선을 분리하고, 전처리할 수 있다. 전지 수명 예측 장치는, 해당 전지에서 실측된 충방전 C-V 곡선과 같은 C-V 곡선으로부터 수명 예측에 활용될 방전 곡선만을 추출하거나 또는 분리할 수 있다. 전지 수명 예측 장치는, 도 3의 충방전 C-V 곡선 등을 디스플레이하도록 그래프를 제공할 수 있다. 전지 수명 예측 장치는, 디스플레이를 구비하거나 또는 디스플레이와 연결될 수 있다. 충방전 C-V 곡선을 나타내는 그래프 의 X축은 “Capacity (mAh)”이고 Y축은 “Potential (V)”일 수 있다. X축은 Capacity로서, 일반적으로 mAh/g 가 상용적으로 쓰이나, 본 출원인이 측정한 상용 셀은 모두 같은 질량을 지니므로 편의상 mAh로 기재하였다. Y축은 Voltage로서, 셀에 가해진 전압을 의미하며, Potential과 같은 의미일 수 있다. 전지 수명 예측 장치는, 충방전 C-V 곡선을 나타내는 그래프의 적어도 일부를 전처리할 수 있으며, 필요한 그래 프 부분만을 추출할 수 있다. 전지 수명 예측 장치는, 추출된 그래프/방전 곡선의 그래프를 디스플레이를 통해 제공할 수 있다. 도 4는 일실시예에 따른 방전 곡선 변화 추세 파악을 위한 보조 함수 도입을 나타내는 도면이다. 전지 수명 예측 장치는, 방전 곡선 변화 추세 파악을 위하여 초기의 방전 곡선 및 중기의 방전 곡선을 추출할 수 있다. 전지 수명 예측 장치는, 추출한 초기의 방전 곡선 및 중기의 방전 곡선을 나타내는 그래프를 제공/생성할 수 있 다. 추출한 초기의 방전 곡선 및 중기의 방전 곡선을 나타내는 그래프의 X축은 “Discharge capacity(Ah)”이고 Y축은 “Voltage (V)”일 수 있다. 전지 수명 예측 장치는, 추출한 방전 곡선의 적어도 일부를 기초로/이용하여 도출되는/계산되는 보조 함수로 보 조 함수를 나타내는 그래프를 제공/생성할 수 있다. 보조 함수는, 수명 예측 모델로 활용을 위한 보조 함수로서 “Q40(V)-Q4(V)”를 포함할 수 있다. 보조 함수를 나 타내는 그래프의 X축은 “Q40 - Q4 (Ah)”이고 Y축은 “Voltage (V)”일 수 있다. 보조 함수를 나타내는 그래프 는 사이클 라이프(Cycle life)에 따라 상이한 색상이 제공될 수 있다. 도 4의 좌측을 참조하면, 도 3의 경우 충전 곡선 및 방전 곡선이 모두 포함되어 있으나, 전지 수명 예측 장치는, 본 발명이 목적으로 하는 방전 곡선만을 따로 추출 후, 초기(4th) 및 중기(40th) 사이클의 곡선을 나타 낼/제공할 수 있다. 도 4의 우측을 참조하면, 전지 수명 예측 장치는, V 값에 지배 받는 Q(V) 함수를 구성한 후, 각 셀 별로 40th 사이클의 Q40(V)와 4th 사이클의 Q4(V)의 그래프의 값 차이를 다중으로 나타낼/표시할 수 있다. 이 때 곡선의 색 은 각 셀의 실측 수명을 나타낸 것이며, 이렇게 산출된 각 셀 별 Q40(V)-Q4(V) 곡선을 특성치 추출에 이용할 “ 보조 함수”로 칭할 수 있다. 도 5는 일실시예에 따른 보조 함수로부터의 특성치 도출을 나타내는 도면이다. 전지 수명 예측 장치는, 도입된 보조 함수(Q40-Q4) 로부터 하기와 같이 특성/특성치 1 내지 4와, 초기 사이클 곡 선(Q4) 과 최대 방전 용량을 갖는 곡선(Qmax)을 이용하여 특성/특성치 5 내지 6을 추출할 수 있다. 도 5를 참조하면, 붉은 숫자는 전지 수명 예측에 필요한 특성치 값을 얻을 수 있는 정보를 포함할 수 있다. 1,2,3,4,5,6 은 보조함수 Q40(V)-Q4(V)의 좌표 데이터로부터 파이썬 코드를 이용해 (scipy 모듈) 손쉽게 얻을 수 있으며, 관련된 식은 하기와 같다. 5번은 4th cycle에서의 discharge capacity(discharge capacity: 각 cycle 별 최저 전압이 인가되었을 때의 capacity)에 관한 것이다. 6번은 Discharge capacity(실측 데이터 상 가장 큰 discharge capacity 값에서 4th cycle에서의 discharge capacity 값을 뺀 수)에 관한 것이다."}
{"patent_id": "10-2023-0066123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "7. Charging C-rate (도 6에 대한 하기 설명에 포함됨) 도 6은 일실시예에 따른 충전 조건으로부터의 특성치 도출을 나타내는 도면이다. 전지 수명 예측 장치는, 가변적인 충전 C-rate를 (AC-> BC) 통합하여 대표성을 갖는 하나의 파라미터 (parameter)를 도출하여 실제 전지 수명과의 연관 관계를 확보할 수 있다."}
{"patent_id": "10-2023-0066123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전지 수명 예측 장치는, 2회 이상 변하는 가변적인 charge C-rate 값을 위 식을 통해 하나의 수치로 통합하여 실측 수명과의 양의 상관관계를 파악/판단할 수 있다. 전지 수명 예측 장치는, 배터리 충방전 데이터 수집 시, 단위 충전 스텝에서 두 번 이상의 변화하는 충전 C- rate이 전체 수명에 미치는 영향이 반영된 특성값을 산출 및 도입할 수 있다. 상기 수학식에서 X는 60, A는 1.5C, B는 0.5C일 경우, 0.5C 방전이 될 수 있다. 전지 수명 예측 장치는, 단일 충전 스텝에서 두 번 이상 변화하는 가변적인 충전 C-rate이 셀 수명에 미치는 영 향이 반영된 특성값을 이용할 수 있다. 전지 수명 예측 장치는, 충전 C-rate가 커질수록 충전시간이 짧아지며, 이에 따라 전극의 온전한 충전 성능을 발현하지 못하며 수명이 짧아지는 문제를 방지할 수 있다. 충방전 데이터 셋은 셀 마다 특정한 단일 충/방전 C-rate를 설정하여 수집되며, 최대 수명을 갖는 C-rate에 대한 최적화가 이 루어질 수 있다. 전지 수명 예측 장치는, 이러한 최적화 문제를 해결할 수 있다. 전지 수명 예측 장치는, 측정 데이터에 다양성을 가미하여 전지 수명과의 상관관계식을 도출할 수 있다(용례: 급속 충전, 완속 충전이 동시에 호환되는 배터리).도 7은 일실시예에 따른 중요도가 높은 특성 분류를 나타내는 도면이다. 전지 수명 예측 장치는, 상관계수 (Spearman's ρ) 계산을 통하여 특성들 간, 특성과 수명 간 상관 관계를 정량 화할 수 있다(ρ=1 강한 양의 상관성, ρ=-1 강한 음의 상관성). 전지 수명 예측 장치는, 고상관성 특성들을(예를 들어, |ρ|>0.8인 특성) 기계학습 모델에 적용될 특성으로 선 정할 수 있다. [(a) Variance, (b) minimum, (c) charging C-rate]"}
{"patent_id": "10-2023-0066123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 5, "content": "도 7의 좌측을 참조하면, Spearman's correlation coefficient 값(ρ)에 관하여, 도 5 및 6에서 보조함수로부 터 추출한 특성치들 간의 상관관계를 수치화한 것을 알 수 있다. -1은 음의 상관관계를 나타내며, +1은 양의 상 관관계를 나타낸다. 절댓값이 1에 가까워질수록 상관관계가 강하다고 할 수 있다. 반대로 절댓값이 0에 가까워 갈수록 상관관계가 뚜렷하지 않은 것으로 할 수 있다. 도 7의 우측을 참조하면, Spearman's correlation coefficient 값(ρ)에 관하여, 도 5 및 6에서 보조함수로부 터 추출한 특성치들과 실측 수명과의 상관관계를 수치화한 것을 알 수 있다. 이 때, (a), (b), (c)와 같은 수명 과의 상관관계가 큰 특성치들이 추후 수명 예측 모델의 특성으로써 자동적으로 선별되어 활용될 수 있다. 도 8은 일실시예에 따른 다양한 회귀 모델로부터의 개별 정합성 확보를 나타내는 도면이다. 전지 수명 예측 장치는, 기계 학습 파이프라인(pipeline)을 이용하여, 하이퍼파라미터(Hyperparameters) 자동 최적화 알고리즘이 포함된 다양한 회귀 모델에 대한 R2 값을 확보하고 고성능 모델 자동 선택할 수 있다. 전지 수명 예측 장치는, 한 가지 회귀모델에 국한되지 않는 측정 데이터 별 가장 높은 수명 정합성이 산출되는 모델을 코드가 자동으로 선택하게 할 수 있다. 전지 수명 예측 장치는, 다양한 회귀 모델 중 충방전 실측 데이터에 대해 가장 높은 정합성(R2)을 갖는 모델을 자동으로 선택할 수 있다. 한 가지의 예측 모델이 설정된다면 사용자의 충/방전 데이터셋에 따라 매우 낮은 예측 성능을 지닐 가능성이 있 으므로, 전지 수명 예측 장치는, 이러한 문제를 해소하기 위해 데이터셋에 관계 없이 가장 높은 수명 예측력을 갖도록 모델을 자동으로 선택할 수 있다. 도 8을 참조하면, 전지 수명 예측 장치가, 도 7에서 선별된 고상관성 특성치들을 공통적으로 이용하며 회귀 기 반 알고리즘만 바꿔가며 예측 성능을 분석한 도표를 제공할 수 있는 것을 알 수 있다. 이 때 성능의 기준이 되 는 결정계수(R2)의 식은 도 8의 우측 하단과 같다. 도 9는 일실시예에 따른 전지 수명을 예측하기 위한 전지 수명 예측 장치의 블록도이다. 일실시예에 따르면, 전지 수명을 예측하기 위한 전지 수명 예측 장치는, 방전 곡선 추출부, 보조 함 수 이용부, 특성치 도출부, 특성 분류부, 모델 선택부를 포함할 수 있다. 방전 곡선 추출부는 C-V 곡선을 이용하여 방전 곡선을 추출할 수 있다. 보조 함수 이용부는, 방전 곡선의 변화에 대한 보조 함수를 이용할 수 있다. 특성치 도출부는, 보조 함수를 기초로 특성치를 도출할 수 있다. 특성 분류부는, 중요도에 따라 특성을 분류할 수 있다. 모델 선택부는, 회귀 모델에 따른 값을 기초로 모델을 선택할 수 있다. 일실시예에 따르면, 방전 곡선 추출부는, 수명을 예측하려는 전지의 C-V 곡선 중 방전 곡선을 추출할 수 있다. 일실시예에 따르면, 방전 곡선 추출부는, 초기의 방전 곡선 및 중기의 방전 곡선을 추출하되, 보조 함수 이용부는, 초기의 방전 곡선의 적어도 일부 지점의 좌표 값 및 중기의 방전 곡선의 적어도 일부 지점의 좌 표 값을 이용할 수 있다. 일실시예에 따르면, 특성치 도출부는, 보조 함수와 관련된 최솟값, 편차, 왜도, 첨도 중 적어도 하나를 계 산할 수 있다. 일실시예에 따르면, 특성 분류부는, 특성치의 적어도 일부를 기초로 특성과 전지 수명 간 상관관계를 정량 화할 수 있다. 본 실시예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(field-programmable gate array) 또는 ASIC과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드 웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 상기에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특 허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0066123", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일실시예에 따른 전지 수명을 예측하기 위한 전지 수명 예측 방법의 흐름도이다. 도 2는 일실시예에 따른 전지 수명을 예측하기 위한, 컴퓨터로 판독 가능한 기록 매체에 저장된 컴퓨터 프로그 램을 실행하는 프로세서를 구비하는 컴퓨팅 디바이스에 대한 블록도이다. 도 3은 일실시예에 따른 충방전 C-V 곡선으로부터 방전 곡선 분리 및 전처리를 나타내는 도면이다.도 4는 일실시예에 따른 방전 곡선 변화 추세 파악을 위한 보조 함수 도입을 나타내는 도면이다. 도 5는 일실시예에 따른 보조 함수로부터의 특성치 도출을 나타내는 도면이다. 도 6은 일실시예에 따른 충전 조건으로부터의 특성치 도출을 나타내는 도면이다. 도 7은 일실시예에 따른 중요도가 높은 특성 분류를 나타내는 도면이다. 도 8은 일실시예에 따른 다양한 회귀 모델로부터의 개별 정합성 확보를 나타내는 도면이다. 도 9는 일실시예에 따른 전지 수명을 예측하기 위한 전지 수명 예측 장치의 블록도이다."}
