{"patent_id": "10-2021-0014869", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0111517", "출원번호": "10-2021-0014869", "발명의 명칭": "가맹점 관리 시스템 및 서비스 제공 방법", "출원인": "민재홍", "발명자": "민재홍"}}
{"patent_id": "10-2021-0014869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "상기된 본 명세서는제품과 제품을 제조하는 방법 동영상을 저장하는 제품 데이터베이스;가맹점들에 대한 정보를 저장한 가맹점 정보 데이터베이스;인공지능의 학습을 위한 매출 데이터베이스; 를 구축하며제품 레시피 및 제조 동영상을 제공하는 시스템;가맹점주들이 이용할 수 있는 자유 게시판 서비스;상기 학습한 인공지능을 통한 예상 가맹비 확인 서비스;관리자가 가맹점 데이터베이스를 열람할 수 있는 관리자 전용 시스템; 및 보안 인증을 통해 데이터베이스를 수정할 수 있는 기능; 을 포함하는 가맹점 관리 시스템 및 서비스를 제공하는 방법에 관한 것이다."}
{"patent_id": "10-2021-0014869", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 제품, 가맹점, 매출 데이터베이스를 구축하고 상기 데이터들을 통해 제품 데이터를 제공하는 서비스, 인공지능을 통한 예상 가맹비 계산 서비스, 관리자가 이용할 수 있는 가맹점 데이터 열람서비스, 추가적인 보안 인증을 통한 데이터 수정 및 삭제 기능을 포함하여 가맹점을 편리하게 관리할 수 있고 단합시킬 수 있는 애플리 케이션 시스템 및 서비스 제공 방법에 관한 것이다."}
{"patent_id": "10-2021-0014869", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기술을 이용하여 가맹점을 관리하는 시스템 및 서비스를 제공하는 방법에 관한 것이다. 인공지능을 활용하여 예상 매출을 예측하여 이를 기반으로 가맹비를 계산할 수 있는 서비스를 제공할 예정이다."}
{"patent_id": "10-2021-0014869", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명은 애플리케이션을 기반으로 다양한 서비스를 제공하여 가맹점을 관리하는 시스템을 구축하는 방법에 관 한 것이다. 데이터베이스를 구축하여 제품의 레시피와 제품을 제작하는 방법을 동영상으로 촬영하여 이를 제공하고, 자유롭 게 소통할 수 있는 자유 게시판과 인공지능을 이용한 가맹비 계산 서비스를 제공하며, 관리자 전용 시스템을 구 현하여 가맹점들을 관리할 수 있도록 한다."}
{"patent_id": "10-2021-0014869", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 인공지능 기술을 기반으로 가맹점주들에게 편리한 서비스를 제공하는 데에 있다. 여러 가맹점을 계약하다 보면 똑같은 맛을 재현하기 어려워지는데 레시피 제공 서비스를 통하여 어느 가맹점에 서든지 균일하게 최고의 맛을 제공할 수 있도록 하는데에 있다. 또한, 많은 가맹점을 대상으로 손쉽게 관리하기 위한 관리자 시스템을 구현하여 관리의 용이성을 높인다."}
{"patent_id": "10-2021-0014869", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 과제를 해결하기 위해 본 발명에 따른 가맹점 관리 시스템 및 서비스를 제공하는 애플리케이션은 제품 레시피를 제공하기 위한 제품 데이터와 제품 제조 동영상을 제공하며, 매출 데이터를 바탕으로 인공지능을 학습 시켜 예성 매출을 예측할 수 있도록 하여 가맹비를 계산하는 서비스를 제공하고, 자유로운 소통이 가능한 자유 게시판을 제공하며, 관리자의 용이한 가맹점 관리를 위한 관리자 전용 가맹점 정보 열람 서비스를 제공하는 시 스템을 구현한다. 본 발명의 실시 예는 가맹점주들에게 제공하는 정보 면에서 제품 데이터베이스를 구축하여 레시피와 제조 동영 상을 제공하고 서비스 면에서 소통을 위한 자유 게시판을 활성화하고 자신의 가맹점의 예상 매출을 예측하여 가맹비를 계산해볼 수 있는 시스템을 제공하며 관리자가 용이하게 가맹점을 관리할 수 있도록 관리자 서비스 면에 서 관리자만 가맹점 관련 데이터베이스를 열람할 수 있으며 추가적인 보안 인증을 통해 정보를 수정 및 삭제 가 능하도록 구현하는 것을 포함한다. 본 발명에 따른 실시 예는 레시피 제공으로 균일한 맛을 제공할 수 있는 것을 가장 우선 순위로 한다."}
{"patent_id": "10-2021-0014869", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따른 레시피 데이터 및 제조 방법 동영상을 제공함으로 어느 가맹점에서나 균일하게 최고 의 맛을 전달할 수 있도록 한다. 또한, 자유 게시판을 이용하여 가맹점주들에게 필요한 정보나 소식을 공지하는 것을 가능하게 한다."}
{"patent_id": "10-2021-0014869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 본 발명의 실시 예에 따라 애플리케이션을 이용한 가맹점 관리 서비스 및 시스템을 제공하는 방법을 나 타내는 도면이다. 레시피 데이터베이스를 구축하여 이용자의 화면의 디스플레이하고 제조 방법 동영상을 시청할 수 있는 서비스를 구현할 수 있도록 한다. 자유 게시판을 통해 자유롭게 소통할 수 있게 하며 익명 기능을 이용할 수 있도록하지만 악용시에 규칙에 따라 처분한다. 매출 데이터를 학습한 인공지능을 이용하여 가맹점의 예상 매출을 예측하여 가맹비를 계산할 수 있는 시스템을 구현할 수 있도록 한다. 관리자 권한을 가진 사람이 가맹점을 용이하게 관리하기 위한 관리자 전용 시스템을 제공하며 이는 가맹점 관련 데이터베이스를 열람할 수 있고 추가적인 보안 인증을 통해 수정이 가능하도록 구현한다."}
{"patent_id": "10-2021-0014869", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따라 전체 애플리케이션 서비스를 형성하는 과정을 나타내는 도면이다."}
