{"patent_id": "10-2019-0126396", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0043341", "출원번호": "10-2019-0126396", "발명의 명칭": "인공지능 대화 서비스 생성 방법 및 장치", "출원인": "주식회사 엘지유플러스", "발명자": "김시윤"}}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 대화 서비스 생성 방법에 있어서,인공지능 대화 서비스의 제작을 위한 제작 인터페이스를 통해 인공지능 대화 서비스의 서비스 이름에 대한 사용자 입력을 수신하는 단계;상기 수신에 응답하여, 상기 서비스 이름에 대응하는 시나리오를 생성하는 단계;상기 시나리오를 형성하는 대화 서비스에서 기준이 되는 사용자 발화 문장에 대한 사용자 입력을 수신하는단계;상기 사용자 발화 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력을 수신하는 단계; 및상기 서비스 이름, 상기 사용자 발화 문장 및 상기 인공지능 응답 문장에 대한 정보를 저장하는 단계를 포함하는,인공지능 대화 서비스 생성 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 사용자 발화 문장에 대한 하나 이상의 동의 문장을 결정하는 단계를 더 포함하는,인공지능 대화 서비스 생성 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 하나 이상의 동의 문장을 결정하는 단계는,상기 사용자 발화 문장에 대한 텍스트 분석을 수행하는 단계;상기 텍스트 분석 결과에 기초하여 상기 사용자 발화 문장으로부터 추출된 각 단어의 동의어를 출력하는 단계;상기 각 단어의 동의어에 대한 사용자 선택 정보를 수신하는 단계; 및상기 사용자 선택 정보에 기초하여 상기 사용자 발화 문장에 대한 동의 문장을 결정하는 단계를 더 포함하는,인공지능 대화 서비스 생성 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 인공지능 응답 문장에 대한 정보를 저장하는 단계는,상기 사용자 발화 문장 및 상기 사용자 발화 문장의 동의 문장에 대응하는 인공지능 응답 문장에 기초하여, 상공개특허 10-2021-0043341-3-기 인공지능 응답 문장에 대한 정보를 저장하는 단계를 포함하는,인공지능 대화 서비스 생성 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "인공지능 대화 서비스 제공 방법에 있어서,마이크로폰을 통해 사용자의 발화 문장 입력을 수신하는 단계;미리 등록된 대화 서비스 설정 정보에 기초하여 상기 발화 문장 입력에서 의도된 서비스를 결정하는 단계;상기 대화 서비스 설정 정보에 기초하여, 상기 결정된 서비스와 관련된 상기 발화 문장 입력에 대응하는 응답문장을 결정하는 단계; 및상기 응답 문장을 상기 사용자에게 제공하는 단계를 포함하는,인공지능 대화 서비스 제공 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 응답 문장을 결정하는 단계는,상기 발화 문장 입력을 분석하는 단계; 및상기 대화 서비스 설정 정보 및 상기 분석 결과에 기초하여, 상기 발화 문장 입력에 대응하는 응답 문장을 결정하는 단계를 포함하는,인공지능 대화 서비스 제공 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 응답 문장을 결정하는 단계는,상기 대화 서비스 설정 정보에 등록된 서비스별 대표 문장들 중에서 상기 발화 문장 입력에 대응하는 대표 문장을 결정하는 단계; 및상기 결정된 대표 문장에 대응하는 기 정의된 응답 문장을 상기 발화 문장 입력에 대응하는 응답 문장으로 결정하는 단계를 포함하는,인공지능 대화 서비스 제공 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 분석하는 단계는,공개특허 10-2021-0043341-4-상기 발화 문장 입력으로부터 명사, 수량, 동사 및 사용자의 의도에 대한 정보 중 적어도 하나를 추출하는 단계를 포함하는,인공지능 대화 서비스 제공 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제5항에 있어서,상기 대화 서비스 설정 정보는,서비스, 시나리오, 대화 및 서비스 순서 중 적어도 하나에 대한 설정 정보를 포함하는,인공지능 대화 서비스 제공 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 대화 서비스 설정 정보는,인공지능 대화 서비스를 생성하는 것에 대한 사용자 입력에 기초하여 등록, 수정 및 삭제 중 적어도 하나가 수행되는,인공지능 대화 서비스 제공 방법."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 하나의 항의 방법을 실행시키기 위한 인스트럭션들을 저장하는 컴퓨터 판독 가능한저장 매체."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "인공지능 대화 서비스 생성 방법을 수행하는, 인공지능 대화 서비스 생성 장치에 있어서,메모리 및 프로세서를 포함하고,상기 메모리는 상기 프로세서에 의해 실행 가능한 인스트럭션들(instructions)을 저장하고,상기 인스트럭션들이 상기 프로세서에 의해 실행될 때, 상기 프로세서는 상기 인공지능 대화 서비스 생성 장치가,인공지능 대화 서비스의 제작을 위한 제작 인터페이스를 통해 인공지능 대화 서비스의 서비스 이름에 대한 사용자 입력을 수신하고,상기 수신에 응답하여, 상기 서비스 이름에 대응하는 시나리오를 생성하고,상기 시나리오를 형성하는 대화 서비스에서 기준이 되는 사용자 발화 문장에 대한 사용자 입력을 수신하고,상기 사용자 발화 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력을 수신하고,상기 서비스 이름, 상기 사용자 발화 문장 및 상기 인공지능 응답 문장에 대한 정보를 저장하도록 상기 인공지능 대화 서비스 생성 장치를 제어하는,인공지능 대화 서비스 생성 장치.공개특허 10-2021-0043341-5-청구항 13 제12항에 있어서,상기 프로세서는 상기 인공지능 대화 서비스 생성 장치가,상기 사용자 발화 문장에 대한 하나 이상의 동의 문장을 결정하도록 상기 인공지능 대화 서비스 생성 장치를 제어하는,인공지능 대화 서비스 생성 장치."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 프로세서는 상기 인공지능 대화 서비스 생성 장치가,상기 사용자 발화 문장에 대한 텍스트 분석을 수행하고,상기 텍스트 분석 결과에 기초하여 상기 사용자 발화 문장에 대한 사용자 입력으로부터 추출된 각 단어의 동의어를 출력하고,상기 각 단어의 동의어에 대한 사용자 선택 정보를 수신하고,상기 사용자 발화 문장에 대한 사용자 입력 및 상기 사용자 선택 정보 중 적어도 하나에 기초하여 상기 동의 문장을 결정하도록 상기 인공지능 대화 서비스 생성 장치를 제어하는,인공지능 대화 서비스 생성 장치."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 프로세서는 상기 인공지능 대화 서비스 생성 장치가,상기 사용자 발화 문장 및 상기 사용자 발화 문장의 동의 문장에 대응하는 인공지능 응답 문장에 대한 사용자입력에 기초하여, 상기 인공지능 응답 문장에 대한 정보를 저장하도록 상기 인공지능 대화 서비스 생성 장치를제어하는,인공지능 대화 서비스 생성 장치."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "인공지능 대화 서비스 제공 방법을 수행하는, 인공지능 대화 서비스 제공 장치에 있어서,마이크로폰을 통해 사용자의 발화 문장 입력을 수신하는 사용자 발화 문장 수신부;미리 등록된 대화 서비스 설정 정보에 기초하여 상기 발화 문장 입력에서 의도된 서비스를 결정하는 서비스 결정부;상기 대화 서비스 설정 정보에 기초하여, 상기 결정된 서비스와 관련된 상기 발화 문장 입력에 대응하는 응답문장을 결정하는 응답 문장 결정부; 및상기 응답 문장을 상기 사용자에게 제공하는 응답 문장 출력부를 포함하는,인공지능 대화 서비스 제공 장치.공개특허 10-2021-0043341-6-청구항 17 제16항에 있어서,상기 발화 문장 입력을 분석하는 사용자 발화 문장 분석부를 더 포함하고,상기 응답 문장 결정부는,상기 대화 서비스 설정 정보 및 상기 분석 결과에 기초하여, 상기 발화 문장 입력에 대응하는 응답 문장을 결정하는,인공지능 대화 서비스 제공 장치."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 응답 문장 결정부는,상기 대화 서비스 설정 정보에 등록된 서비스별 대표 문장들 중에서 상기 발화 문장 입력에 대응하는 대표 문장을 결정하고,상기 결정된 대표 문장에 대응하는 기 정의된 응답 문장을 상기 발화 문장 입력에 대응하는 응답 문장으로 결정하는,인공지능 대화 서비스 제공 장치."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 사용자 발화 문장 분석부는,상기 발화 문장 입력으로부터 명사, 수량, 동사 및 사용자의 의도에 대한 정보 중 적어도 하나를 추출하는,인공지능 대화 서비스 제공 장치."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서,상기 대화 서비스 설정 정보는,서비스, 시나리오, 대화 및 서비스 순서 중 적어도 하나에 대한 설정 정보를 포함하는,인공지능 대화 서비스 제공 장치."}
{"patent_id": "10-2019-0126396", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,상기 대화 서비스 설정 정보는,대화 서비스를 설정하는 것에 대한 사용자 입력에 기초하여 등록, 수정 및 삭제 중 적어도 하나가 수행되는,인공지능 대화 서비스 제공 장치.공개특허 10-2021-0043341-7-"}
{"patent_id": "10-2019-0126396", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 대화 서비스 생성 방법 및 장치가 개시된다. 인공지능 대화 서비스 생성 방법은 인공지능 대화 서비스 의 제작을 위한 제작 인터페이스를 통해 인공지능 대화 서비스의 서비스 이름에 대한 사용자 입력을 수신하는 단 계, 수신에 응답하여, 서비스 이름에 대응하는 시나리오를 생성하는 단계, 시나리오를 형성하는 대화 서비스에서 기준이 되는 사용자 발화 문장에 대한 사용자 입력을 수신하는 단계, 사용자 발화 문장에 대응하는 인공지능 응 답 문장에 대한 사용자 입력을 수신하는 단계 및 서비스 이름, 사용자 발화 문장 및 인공지능 응답 문장에 대한 정보를 저장하는 단계를 포함할 수 있다."}
{"patent_id": "10-2019-0126396", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "실시예들은 인공지능 대화 서비스를 생성하는 기술 및 인공지능 대화 서비스를 제공하는 기술에 관한 것이다."}
{"patent_id": "10-2019-0126396", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 스피커의 보급이 확대되고, 인공지능 스피커와 연계된 다양한 서비스들이 등장하면서 인공지능 스피커 의 활용도가 계속해서 높아지고 있다. 사용자들은 다양한 분야의 서비스를 스피커를 통해서 이용할 수 있다. 그러나, 각 서비스들을 이용하기 위해서, 사용자들은 서비스의 제공자가 설정한 대화 가이드에 기초한 사용자의 발화 입력을 통해서만 서비스를 제공받을 수 있다. 제공자가 설정한 대화 가이드는 사용자의 발화 습관이나 사 용자의 의도를 포함하지 않는다. 따라서 제공자가 설정한 대화 가이드에 기초한 음성 인식 방법은 사용자에게 최적화된 음성 인식 기능을 제공할 수 없다는 한계점을 가진다."}
{"patent_id": "10-2019-0126396", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 인공지능 대화 서비스 생성 방법은 인공지능 대화 서비스의 제작을 위한 제작 인터페이스를 통해 인공지능 대화 서비스의 서비스 이름에 대한 사용자 입력을 수신하는 단계; 상기 수신에 응답하여, 상기 서비스 이름에 대응하는 시나리오를 생성하는 단계; 상기 시나리오를 형성하는 대화 서비스에서 기준이 되는 사 용자 발화 문장에 대한 사용자 입력을 수신하는 단계; 상기 사용자 발화 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력을 수신하는 단계; 및 상기 서비스 이름, 상기 사용자 발화 문장 및 상기 인공지능 응답 문장에 대한 정보를 저장하는 단계를 포함할 수 있다. 일 실시예에 따른 인공지능 대화 서비스 생성 방법은 상기 사용자 발화 문장에 대한 하나 이상의 동의 문장을 결정하는 단계를 더 포함할 수 있다. 상기 동의 문장을 결정하는 단계는, 상기 사용자 발화 문장에 대한 텍스트 분석을 수행하는 단계; 상기 텍스트 분석 결과에 기초하여 상기 사용자 발화 문장에 대한 사용자 입력으로부터 추출된 각 단어의 동의어를 출력하는 단계; 상기 각 단어의 동의어에 대한 사용자 선택 정보를 수신하는 단계; 및 상기 사용자 발화 문장에 대한 사 용자 입력 및 상기 사용자 선택 정보 중 적어도 하나에 기초하여 상기 동의 문장을 결정하는 단계를 더 포함할 수 있다. 상기 인공지능 응답 문장에 대한 정보를 저장하는 단계는, 상기 사용자 발화 문장 및 상기 사용자 발화 문장의 동의 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력에 기초하여, 상기 인공지능 응답 문장에 대한 정 보를 저장하는 단계를 포함할 수 있다. 일 실시예에 따른 인공지능 대화 서비스 제공 방법은 마이크로폰을 통해 사용자의 발화 문장 입력을 수신하는 단계; 미리 등록된 대화 서비스 설정 정보에 기초하여 상기 발화 문장 입력에서 의도된 서비스를 결정하는 단계; 상기 대화 서비스 설정 정보에 기초하여, 상기 결정된 서비스와 관련된 상기 발화 문장 입력에 대응하는 응답 문장을 결정하는 단계; 및 상기 응답 문장을 상기 사용자에게 제공하는 단계를 포함할 수 있다. 상기 응답 문장을 결정하는 단계는, 상기 발화 문장 입력을 분석하는 단계; 및 상기 대화 서비스 설정 정보 및 상기 분석 결과에 기초하여, 상기 발화 문장 입력에 대응하는 응답 문장을 결정하는 단계를 포함할 수 있다. 상기 응답 문장을 결정하는 단계는, 상기 대화 서비스 설정 정보에 등록된 서비스별 대표 문장들 중에서 상기 발화 문장 입력에 대응하는 대표 문장을 결정하는 단계; 및 상기 결정된 대표 문장에 대응하는 기 정의된 응답 문장을 상기 발화 문장 입력에 대응하는 응답 문장으로 결정하는 단계를 포함할 수 있다.상기 분석하는 단계는, 상기 발화 문장 입력으로부터 명사, 수량, 동사 및 사용자의 의도에 대한 정보 중 적어 도 하나를 추출하는 단계를 포함할 수 있다. 상기 대화 서비스 설정 정보는, 서비스, 시나리오, 대화 및 서비스 순서 중 적어도 하나에 대한 설정 정보를 포 함할 수 있다. 상기 대화 서비스 설정 정보는, 인공지능 대화 서비스를 생성하는 것에 대한 사용자 입력에 기초하여 등록, 수 정 및 삭제 중 적어도 하나가 수행될 수 있다. 일 실시예에 따른 인공지능 대화 서비스 생성 방법을 수행하는, 인공지능 대화 서비스 생성 장치는 메모리 및 프로세서를 포함하고, 상기 메모리는 상기 프로세서에 의해 실행 가능한 인스트럭션들(instructions)을 저장하 고, 상기 인스트럭션들이 상기 프로세서에 의해 실행될 때, 상기 프로세서는 상기 인공지능 대화 서비스 생성 장치가, 인공지능 대화 서비스의 제작을 위한 제작 인터페이스를 통해 인공지능 대화 서비스의 서비스 이름에 대한 사용자 입력을 수신하고, 상기 수신에 응답하여, 상기 서비스 이름에 대응하는 시나리오를 생성하고, 상기 시나리오를 형성하는 대화 서비스에서 기준이 되는 사용자 발화 문장에 대한 사용자 입력을 수신하고, 상기 사 용자 발화 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력을 수신하고, 상기 서비스 이름, 상기 사용 자 발화 문장 및 상기 인공지능 응답 문장에 대한 정보를 저장하도록 상기 인공지능 대화 서비스 생성 장치를 제어할 수 있다. 상기 프로세서는 상기 인공지능 대화 서비스 생성 장치가, 상기 사용자 발화 문장에 대한 하나 이상의 동의 문 장을 결정하도록 상기 인공지능 대화 서비스 생성 장치를 제어할 수 있다. 상기 프로세서는 상기 인공지능 대화 서비스 생성 장치가, 상기 사용자 발화 문장에 대한 텍스트 분석을 수행하 고, 상기 텍스트 분석 결과에 기초하여 상기 사용자 발화 문장에 대한 사용자 입력으로부터 추출된 각 단어의 동의어를 출력하고, 상기 각 단어의 동의어에 대한 사용자 선택 정보를 수신하고, 상기 사용자 발화 문장에 대 한 사용자 입력 및 상기 사용자 선택 정보 중 적어도 하나에 기초하여 상기 동의 문장을 결정하도록 상기 인공 지능 대화 서비스 생성 장치를 제어할 수 있다. 상기 프로세서는 상기 인공지능 대화 서비스 생성 장치가, 상기 사용자 발화 문장 및 상기 사용자 발화 문장의 동의 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력에 기초하여, 상기 인공지능 응답 문장에 대한 정 보를 저장하도록 상기 인공지능 대화 서비스 생성 장치를 제어할 수 있다. 일 실시예에 따른 인공지능 대화 서비스 제공 방법을 수행하는, 인공지능 대화 서비스 제공 장치는 마이크로폰 을 통해 사용자의 발화 문장 입력을 수신하는 사용자 발화 문장 수신부; 미리 등록된 대화 서비스 설정 정보에 기초하여 상기 발화 문장 입력에서 의도된 서비스를 결정하는 서비스 결정부; 상기 대화 서비스 설정 정보에 기 초하여, 상기 결정된 서비스와 관련된 상기 발화 문장 입력에 대응하는 응답 문장을 결정하는 응답 문장 결정부; 및 상기 응답 문장을 상기 사용자에게 제공하는 응답 문장 출력부를 포함할 수 있다. 일 실시예에 따른 인공지능 대화 서비스 제공 장치는 상기 발화 문장 입력을 분석하는 사용자 발화 문장 분석부 를 더 포함하고, 상기 응답 문장 결정부는, 상기 대화 서비스 설정 정보 및 상기 분석 결과에 기초하여, 상기 발화 문장 입력에 대응하는 응답 문장을 결정할 수 있다. 상기 응답 문장 결정부는, 상기 대화 서비스 설정 정보에 등록된 서비스별 대표 문장들 중에서 상기 발화 문장 입력에 대응하는 대표 문장을 결정하고, 상기 결정된 대표 문장에 대응하는 기 정의된 응답 문장을 상기 발화 문장 입력에 대응하는 응답 문장으로 결정할 수 있다. 상기 사용자 발화 문장 분석부는, 상기 발화 문장 입력으로부터 명사, 수량, 동사 및 사용자의 의도에 대한 정 보 중 적어도 하나를 추출할 수 있다. 상기 대화 서비스 설정 정보는, 서비스, 시나리오, 대화 및 서비스 순서 중 적어도 하나에 대한 설정 정보를 포 함할 수 있다. 상기 대화 서비스 설정 정보는, 대화 서비스를 설정하는 것에 대한 사용자 입력에 기초하여 등록, 수정 및 삭제 중 적어도 하나가 수행될 수 있다."}
{"patent_id": "10-2019-0126396", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따르면, 사용자에게 최적화된 인공지능 대화 서비스를 제공할 수 있다. 일 실시예에 따르면, 사용자는 개인 맞춤형 인공지능 대화 서비스를 제공받을 수 있다. 일 실시예에 따르면, 사용자는 기술과 관련된 지식 없이도, 인공지능 대화 서비스를 직접 구성하여 생성할 수 있다. 일 실시예에 따르면, 사용자는 사용자의 발화 습관이나 사용자의 의도가 반영된 인공지능 대화 서비스를 제공받 을 수 있다. 일 실시예에 따르면, 사용자는 사용자의 편의대로 인공지능 대화 서비스와 관련된 대화 서비스 설정 정보를 생 성, 수정 및 삭제할 수 있다. 일 실시예에 따르면, 사용자는 사용자가 생성한 대화 서비스 설정 정보를 통해 보다 편리하게 인공지능 스피커 를 작동시킬 수 있도록 하여, 인공지능 스피커의 보급에 기여할 수 있다. 일 실시예에 따르면, 사용자가 생성한 대화 서비스 설정 정보를 커뮤니티에 공유하여, 인공지능 스피커에 대한 홍보와 이에 따른 신규 사용자의 유입을 도모할 수 있다. 일 실시예에 따르면, 사용자가 직접 인공지능 대화 서비스를 구성할 수 있도록 하여, 관리자가 대화 서비스를 구성할 경우에 소요되는 노력, 시간 및 비용을 절감할 수 있다."}
{"patent_id": "10-2019-0126396", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 첨부된 도면을 참조하여 실시예들을 상세하게 설명한다. 각 도면에 제시된 동일한 참조 부호는 동일 한 부재를 나타낸다. 아래 설명하는 실시예들에는 다양한 변경이 가해질 수 있다. 아래 설명하는 실시예들은 실시 형태에 대해 한정 하려는 것이 아니며, 이들에 대한 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 실시예를 한정하려는 의도가 아 니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포 함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 실시예가 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 또한, 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부 여하고 이에 대한 중복되는 설명은 생략하기로 한다. 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 실시예의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 도 1은 일 실시예에 따른 인공지능 대화 서비스 생성 방법을 설명하기 위한 흐름도이다. 인공지능 대화 서비스 생성 방법을 통해, 인공지능 스피커 또는 음성 인식 기능을 수행하는 기기를 사용하는 사 용자는, 사용자가 원하는 대로 직접 대화 서비스 설정 정보를 구성하여 생성할 수 있다. 또한, 사용자는 사용 자가 직접 생성한 대화 서비스 설정 정보에 기초하여 인공지능 스피커 또는 음성 인식 기능을 수행하는 기기로 부터 인공지능 대화 서비스 생성 기능을 제공받을 수 있다. 또한, 사용자가 대화 서비스 설정 정보에 제휴 플 랫폼과 연결된 서비스를 제공받는 것과 관련된 설정 정보를 등록하면, 사용자는 이에 대응하는 사용자의 발화 문장을 입력하여 대화 서비스뿐만 아니라 제휴 플랫폼과 연결된 서비스를 제공받을 수도 있다. 실시예에 따라 인공지능 대화 서비스 생성 방법은, 인공지능 스피커와 연결된 사용자 단말 또는 인공지능 기반 의 음성 인식 기능을 수행하는 사용자 단말을 통해 대화 서비스를 설정하는 것과 관련된 사용자 인터페이스를 제공할 수 있다. 사용자는 인공지능 스피커와 연결된 사용자 단말 또는 인공지능 기반의 음성 인식 기능을 수 행하는 사용자 단말에서 실행되는 웹 페이지(web page) 또는 애플리케이션을 통해 대화 서비스 설정 정보를 생 성, 수정 및 삭제 중 적어도 하나를 수행할 수 있다. 또한, 사용자는 웹 페이지(web page) 또는 애플리케이션 을 통해 대화 서비스를 설정하는 것과 관련된 가이드 라인을 제공받을 수도 있다. 본 명세서에서 설명하는 인공지능 대화 서비스 생성 장치는 인공지능 스피커, 인공지능 기반의 음성 인식 기능 을 제공하는 기기 및 인공지능 기반의 음성 인식 기능을 제공하는 사용자 단말 중 어느 하나일 수 있다. 도 1을 참조하면, 단계에서 인공지능 대화 서비스 생성 장치는 인공지능 대화 서비스의 제작을 위한 제작 인터페이스를 통해 인공지능 대화 서비스의 서비스 이름에 대한 사용자 입력을 수신할 수 있다. 단계에서 인공지능 대화 서비스 생성 장치는 수신에 응답하여, 서비스 이름에 대응하는 시나리오를 생성할 수 있다. 인공지능 대화 서비스 생성 장치는 시나리오를 구성할 대화를 구성할 수 있다. 단계에서 인공지능 대화 서비스 생성 장치는 시나리오를 형성하는 대화 서비스에서 기준이 되는 사용자 발화 문장에 대한 사용자 입력을 수신할 수 있다. 즉, 인공지능 대화 서비스 생성 장치는, 인공지능 대화 서비스 제공 장치가 시나리오에 기초 하여 응답 문장을 결정하기 위한 사용자 발화 문장에 대한 사용자 입력을 수신할 수 있다. 또한, 인공지능 대 화 서비스 생성 장치는 단계에서 사용자 발화 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력을 수신할 수도 있다. 실시예에 따라 인공지능 대화 서비스의 서비스 이름에 대한 사용자 입력, 사용자 발화 문장에 대한 사용자 입력 및 인공지능 응답 문장에 대한 사용자 입력은 음성 입력 및 텍스트 입력 중 적어도 하나의 형태로 입력될 수 있 다. 사용자는 인공지능 대화 서비스의 제작을 위한 제작 인터페이스를 통해 인공지능 대화 서비스를 생성하는 것과 관련된 사용자 입력을 입력할 수 있다. 단계에서 인공지능 대화 서비스 생성 장치는 서비스 이름, 사용자 발화 문장 및 인공지능 응답 문장에 대 한 정보를 저장할 수 있다. 인공지능 대화 서비스 생성 장치는 서비스 이름과 사용자 발화 문장을 대응시킬 수 있다. 또한, 인공지능 대화 서비스 생성 장치는 인공지능 응답 문장에 대한 사용자 입력을 서비스 이름 및 사 용자 발화 문장과 대응시킬 수 있다. 인공지능 대화 서비스 생성 장치는 서비스 이름에 대응하는 사용자 발화 문장과, 사용자 발화 문장에 대응하는 인공지능 응답 문장을 저장할 수 있다. 다른 실시예에서 인공지능 대화 서비스 생성 장치는 사용자 발화 문장에 대한 하나 이상의 동의 문장을 결정할 수 있다. 인공지능 대화 서비스 생성 장치는 사용자 발화 문장에 대한 텍스트 분석을 수행할 수 있다. 인공지 능 대화 서비스 생성 장치는 텍스트 분석 결과에 기초하여 사용자 발화 문장에 대한 사용자 입력으로부터 추출 된 각 단어의 동의어를 출력할 수 있다. 여기서, 인공지능 대화 서비스 생성 장치는 디스플레이를 통해 사용자 발화 문장에 대한 사용자 입력으로부터 추출된 각 단어의 동의어를 출력할 수 있다. 인공지능 대화 서비스 생성 장치는 사용자로부터 각 단어의 동의어에 대한 사용자 선택 정보를 수신할 수 있다. 예를 들어, 인공지능 대화 서비스 생성 장치는 \"음악\"이라는 단어에 대해 \"노래\" 및 \"뮤직(music)\"이라는 동의 어를 출력할 수 있다. 인공지능 대화 서비스 생성 장치는 사용자로부터 \"노래\"에 대한 선택이 포함된 사용자 선택 정보를 수신한 경우, 인공지능 대화 서비스 제공 장치가 사용자 발화 문장 입력에서 \"음악\"과 \"노래\"를 동 일한 의미를 가진 단어로 인식하도록 설정할 수 있다. 인공지능 대화 서비스 생성 장치는 사용자 발화 문장에 대한 사용자 입력 및 사용자 선택 정보 중 적어도 하나 에 기초하여 동의 문장을 결정할 수 있다. 인공지능 대화 서비스 생성 장치는 인공지능 응답 문장을 사용자 발 화 문장에 대응시키는 것뿐만 아니라, 사용자 발화 문장의 동의 문장에도 대응시킬 수 있다. 인공지능 대화 서 비스 생성 장치는 사용자 발화 문장 및 사용자 발화 문장의 동의 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력에 기초하여, 인공지능 응답 문장에 대한 정보를 저장할 수 있다. 도 2는 일 실시예에 따른 인공지능 대화 서비스 제공 방법을 설명하기 위한 흐름도이다. 본 명세서에서 설명하는 인공지능 대화 서비스 제공 장치는 인공지능 스피커, 인공지능 기반의 음성 인식 기능 을 제공하는 기기 및 인공지능 기반의 음성 인식 기능을 제공하는 사용자 단말 중 어느 하나일 수 있다. 인공 지능 대화 서비스 제공 장치는, 인공지능 대화 서비스 생성 장치를 통해 생성되어 미리 등록된 대화 서비스 설 정 정보에 기초하여 인공지능 대화 서비스를 제공할 수 있다. 인공지능 대화 서비스 제공 장치와 인공지능 대 화 서비스 생성 장치는 실시예에 따라 동일한 장치일 수 있고, 서로 다른 장치일 수도 있다. 또한, 인공지능 대화 서비스 제공 장치와 인공지능 대화 서비스 생성 장치는 하나의 장치가 다른 하나의 장치에 포함되어 있거 나, 두 장치 모두 또 다른 하나의 장치에 포함되어 있을 수도 있다. 도 2를 참조하면 인공지능 대화 서비스 제공 장치는 단계에서, 마이크로폰을 통해 사용자의 발화 문장 입 력을 수신할 수 있다. 인공지능 대화 서비스 제공 장치는 단계에서 미리 등록된 대화 서비스 설정 정보에 기초하여 발화 문장 입력에서 의도된 서비스를 결정할 수 있다. 즉, 인공지능 대화 서비스 제공 장치는 미리 등록된 대화 서비스 설정 정보 및 발화 문장 입력에 기초하여, 사용자가 제공받고자 하는 서비스를 결정할 수 있다. 일 실시예에서, 대화 서비스 설정 정보는 서비스, 시나리오, 대화 및 서비스 순서 중 적어도 하나에 대한 설정 정보를 포함할 수 있다. 대화 서비스 설정 정보는 서비스, 시나리오, 대화 및 서비스 순서 중 적어도 하나에 대한 설정 정보는 사용자에 의해 설정될 수 있다. 즉, 대화 서비스 설정 정보는 인공지능 대화 서비스를 생성 하는 것에 대한 사용자 입력에 기초하여 등록, 수정 및 삭제 중 적어도 하나가 수행될 수 있다. 여기서, 사용 자 입력은 사용자의 발화 음성, 텍스트 및 사용자 선택 중 적어도 하나일 수 있다. 다른 실시예에서, 인공지능 대화 서비스 제공 장치는 사용자 입력을 통해 사용자로부터 사용자가 생성하고자 하 는 서비스에 대한 이름을 수신할 수 있다. 인공지능 대화 서비스 제공 장치는 사용자가 생성하고자 하는 서비 스에 대한 이름에 대응하는 시나리오를 생성할 수 있고, 사용자로부터 시나리오 안에서의 대화와 관련된 문장을 입력 받을 수 있다. 인공지능 대화 서비스 제공 장치는 사용자로부터 입력 받은 대화와 관련된 문장에 대해 텍 스트 분석을 수행할 수 있다. 인공지능 대화 서비스 제공 장치는 텍스트 분석 결과에 기초하여, 대화와 관련된 문장을 텍스트 형식으로 출력할 수 있고, 사용자가 각각의 텍스트를 구분할 수 있는 색으로 텍스트를 표시할 수 있다. 인공지능 대화 서비스 제공 장치는 사용자로부터 각각의 텍스트와 같은 의미를 가진 다른 텍스트를 입력 받아 대화와 관련된 문장과 동일한 뜻을 가지는 유사 문장을 추가할 수도 있다. 또한, 인공지능 대화 서비스 제공 장치는 대화와 관련된 문장과 유사 문장에 대응하는 응답을 사용자로부터 입력 받을 수 있다. 단계에서, 인공지능 대화 서비스 제공 장치는 대화 서비스 설정 정보에 기초하여, 결정된 서비스와 관련된 발화 문장 입력에 대응하는 응답 문장을 결정할 수 있다. 일 실시예에서 인공지능 대화 서비스 제공 장치는 발화 문장 입력을 분석할 수 있다. 인공지능 대화 서비스 제 공 장치는 발화 문장 입력으로부터 명사, 수량, 동사 및 사용자의 의도에 대한 정보 중 적어도 하나를 추출할 수 있다. 인공지능 대화 서비스 제공 장치는 대화 서비스 설정 정보 및 분석 결과에 기초하여, 발화 문장 입력에 대응하 는 응답 문장을 결정할 수 있다. 인공지능 대화 서비스 제공 장치는 대화 서비스 설정 정보에 등록된 서비스별 대표 문장들 중에서 발화 문장 입력에 대응하는 대표 문장을 결정할 수 있다. 대화 서비스 설정 정보는 서비스별 대표 문장들을 포함할 수 있고, 서비스별 대표 문장들과 동일한 의미를 가지 는 유사 문장들도 포함할 수 있다. 인공지능 대화 서비스 제공 장치는 분석 결과로 추출된 명사, 수량, 동사 및 사용자의 의도에 대한 정보 중 적어도 하나를 포함하는 대표 문장 또는 유사 문장을 결정할 수 있다. 대화 서비스 설정 정보에 기초하면, 대표 문장들은 대표 문장들 각각에 대응하는 응답 문장이 설정되어 있을 수 있다. 인공지능 대화 서비스 제공 장치는 결정된 대표 문장에 대응하는 기 정의된 응답 문장을 발화 문장 입력에 대응 하는 응답 문장으로 결정할 수 있다. 또한, 단계에서 인공지능 대화 서비스 제공 장치는 응답 문장을 사 용자에게 제공할 수 있다. 일 실시예에서, 사용자 입력에 기초하여 결정된 대화 서비스 설정 정보는 yaml(Aint Markup Language) 파일과 같은 스크립트 파일로 저장되어, 발명자가 시스템 개발 시에 대화 서비스 설정 정보를 소스에 참고할 수 있도록 할 수 있다. 도 3은 일 실시예에 따른 사용자의 발화 문장 입력에 따른 응답 문장이 출력되는 과정을 설명하기 위한 흐름도 이다. 도 3을 참조하면, 인공지능 대화 서비스 제공 장치는 단계에서 사용자의 발화 문장 입력을 수신할 수 있다. 단계에서, 인공지능 대화 서비스 제공 장치는 대화 서비스 설정 정보에 기초하여, 사용자의 발화 문장 입 력이 어떤 서비스로의 진입을 의도하는 것인지 파악하여, 발화 문장 입력에 대응하는 서비스를 결정할 수 있다. 단계에서 인공지능 대화 서비스 제공 장치는 발화 문장 입력에 대한 분석을 수행할 수 있다. 인공지능 대 화 서비스 제공 장치는 음성 형태의 발화 문장 입력을 텍스트 형태로 변환하고, 텍스트 형태의 사용자의 발화 문장 입력으로부터 명사, 수량, 동사 및 사용자의 의도에 대한 정보 중 적어도 하나를 추출할 수 있다. 인공지능 대화 서비스 제공 장치는 단계에서, 발화 문장 입력으로부터 추출된 명사, 수량, 동사 및 사용자 의 의도에 대한 정보 중 적어도 하나와 대화 서비스 설정 정보에 기초하여 발화 문장 입력에 대응하는 대표 문 장을 결정할 수 있다. 대화 서비스 설정 정보는 서비스별 대표 문장들 및 대표 문장들과 동일한 의미를 가지는 것으로 결정된 유사 문장들도 포함할 수 있다. 인공지능 대화 서비스 제공 장치는 발화 문장 입력으로부터 추 출된 명사, 수량, 동사 및 사용자의 의도에 대한 정보 중 적어도 하나를 포함하는 대표 문장 또는 유사 문장을, 발화 문장 입력에 대응하는 것으로 결정할 수 있다. 단계에서 인공지능 대화 서비스 제공 장치는 발화 문장 입력에 대응하는 것으로 결정된 대표 문장의 응답 문장을, 발화 문장 입력에 대응하는 응답 문장으로 결정할 수 있다. 여기서, 응답 문장은 mp3(MPEG-1 Audio Layer 3), txt(text) 및 mp4(MPEG-4 Part 14) 중 적어도 하나의 형태를 가질 수 있다. 단계에서, 인공지능 대화 서비스 제공 장치는 사용자의 발화 문장 입력에 대한 응답으로, 응답 문장을 출 력할 수 있다. 실시예에 따라 인공지능 대화 서비스 제공 장치는 응답 문장을 음성 형태, 텍스트 형태 및 동영 상 형태 중 적어도 하나로 출력할 수 있다. 도 4a 내지 도 4f는 일 실시예에 따른 인공지능 대화 서비스 생성과 관련된 사용자 인터페이스를 도시하는 도면 이다. 일 실시예에서, 인공지능 대화 서비스 생성 장치는 인공지능 대화 서비스 생성 장치와 연결된 사용자 단말 또는, 인공지능 대화 서비스 생성 장치에서 실행될 웹 페이지 또는 애플리케이션 중 적어도 하나를 통해 대화 서비스 설정과 관련된 사용자 인터페이스를 제공할 수 있다. 도 4a는 대화 서비스 설정과 관련된 메인 페이지를 도시하는 도면일 수 있다. 도 4a를 참조하면, 인공지능 대 화 서비스 생성 장치에 연결된 사용자 단말 또는 인공지능 대화 서비스 생성 장치는 메인 페이지에서, 대화 서 비스 설정하는 것과 관련된 로그인에 대한 가이드와 애플리케이션에 대한 가이드를 제공할 수 있다. 도 4b는 대화 서비스 설정과 관련된 서비스 관리 페이지를 도시하는 도면일 수 있다. 도 4b를 참조하면, 인공 지능 대화 서비스 생성 장치에 연결된 사용자 단말 또는 인공지능 대화 서비스 생성 장치는 서비스 관리 페이지 에서, 대화 서비스 설정 정보에 등록된 서비스에 대한 설정 정보를 리스트 형식으로 디스플레이할 수 있다. 서 비스에 대한 설정 정보는 서비스의 이름(서비스 명), 서비스의 생성일 및 서비스의 생성자에 대한 정보를 포함 할 수 있다. 각각의 서비스와 서비스에 대한 설정 정보는 기 저장되어 있거나 사용자 입력에 기초하여 생성, 삭제 및 수정 등과 같은 관리가 수행될 수 있다. 사용자 입력은 음성 및 텍스트 중 적어도 하나의 형태일 수 있고, 또는 실시예에 따라 사용자 선택 정보를 포함할 수도 있다. 도 4c는 대화 서비스 설정과 관련된 시나리오 관리 페이지를 도시하는 도면일 수 있다. 도 4c를 참조하면, 인 공지능 대화 서비스 생성 장치에 연결된 사용자 단말 또는 인공지능 대화 서비스 생성 장치는 시나리오 관리 페 이지에서, 대화 서비스 설정 정보에 등록된 시나리오에 대한 설정 정보를 리스트 형식으로 디스플레이할 수 있 다. 시나리오에 설정 대한 정보는 시나리오의 이름(시나리오 명), 시나리오의 생성일 및 시나리오의 생성자에 대한 정보를 포함할 수 있다. 또한, 일 시나리오는, 기존에 생성되어 있거나 새롭게 생성된 다른 시나리오와 연결될 수도 있기 때문에, 시나리오에 대한 설정 정보에는 각 시나리오의 이전 시나리오 및 다음 시나리오에 대 한 설정 정보가 포함될 수도 있다. 각각의 시나리오와 시나리오에 대한 설정 정보는 기 저장되어 있거나 사용 자 입력에 기초하여 생성, 삭제 및 수정 등과 같은 관리가 수행될 수 있다. 사용자 입력은 음성 및 텍스트 중 적어도 하나의 형태일 수 있고, 또는 실시예에 따라 사용자 선택 정보를 포함할 수도 있다. 도 4d는 대화 서비스 설정과 관련된 대화 관리 페이지를 도시하는 도면일 수 있다. 도 4d를 참조하면, 인공지 능 대화 서비스 생성 장치에 연결된 사용자 단말 또는 인공지능 대화 서비스 생성 장치는 대화 관리 페이지에서, 대화 서비스 설정 정보에 등록된 대화에 대한 설정 정보를 리스트 형식으로 디스플레이할 수 있다. 대화에 대한 설정 정보는 대표 문장(또는 대표 대화 문장), 대화의 생성일 및 대화의 생성자에 대한 정보를 포 함할 수 있다. 각각의 대화와 대화에 대한 설정 정보는 기존에 저장되어 있거나 사용자 입력에 기초하여 생성, 삭제 및 수정 등과 같은 관리가 수행될 수 있다. 사용자 입력은 음성 및 텍스트 중 적어도 하나의 형태일 수 있고, 또는 실시예에 따라 사용자 선택 정보를 포함할 수도 있다. 도 4e는 대화 서비스와 관련된 대화 관리 페이지에서 디스플레이된 대표 문장이 클릭되어 선택된 것에 대한 파 생 페이지를 도시하는 도면일 수 있다. 즉, 도 4d에서 대표 대화 문장을 클릭한 사용자는, 클릭한 대표 대화 문장에 대응하는 도 4e의 페이지를 제공받을 수 있다. 도 4e를 참조하면, 인공지능 대화 서비스 생성 장치에 연결된 사용자 단말 또는 인공지능 대화 서비스 생성 장 치는 사용자 선택 정보에 대응하는 대표 문장에 대한 설정 정보를 출력할 수 있다. 대표 문장에 대한 설정 정 보는 대표 대화 문장, 대표 대화 문장의 생성일 및 대표 대화 문장의 생성자에 대한 정보를 포함할 수 있다. 또한, 대표 문장에 대한 설정 정보는 대표 문장에 대한 분석 결과를 포함할 수도 있다. 대표 문장은 명사, 수 량 및 대표 문장에 담긴 의도 중 적어도 하나가 추출되어 분석될 수 있다. 인공지능 대화 서비스 생성 장치는 대표 문장에 대한 설정 정보에 기초하여, 사용자로부터 수신한 발화 문장 입력과 동일하거나 동일한 의미를 가 지고 있는 대표 문장을 결정할 수 있다. 또한, 대화 서비스와 관련된 대화 관리 페이지에서 디스플레이된 대표 문장이 클릭되어 선택된 것에 대한 파생 페이지에는 대표 문장과 동일하거나 동일한 의미를 가지고 있는 것으로 결정된 유사 문장을 디스플레이될 수도 있다. 대표 문장에 대한 설정 정보 및 대표 문장에 대응하는 유사 문장 중 적어도 하나는 기존에 저장되어 있거나, 또 는 사용자 입력에 기초하여 생성, 삭제 및 수정될 수 있다. 도 4f는 서비스 순서도에 대한 페이지를 도시하는 도면일 수 있다. 도 4f를 참조하면, 서비스 순서도에 대한 페이지에는 서비스가 제공되는 순서에 대한 설정 정보를 나타내는 순서도가 디스플레이될 수 있다. 서비스가 제공되는 순서에 대한 설정 정보는 사용자 입력에 기초하여 결정될 수 있다. 서비스가 제공되는 순서에 대한 설정 정보는, 서비스에 대응하는 대화 및 시나리오 중 적어도 하나에 대응하는 사용자의 발화 음성 입력이 수신 되고, 발화 음성 입력에 기초한 응답 문장이 결정되고, 출력되는 과정이 포함될 수 있다. 또한, 실시예에 따라, 서비스가 제공되는 순서에 대한 설정 정보에는 응답 문장에 대응하는 서비스를 제공하는 것에 대한 설정 정보가 포함될 수도 있다. 도 5는 일 실시예에 따른 인공지능 대화 서비스 제공 장치의 구성을 도시하는 도면이다. 도 5를 참조하면, 인공지능 대화 서비스 제공 장치는 사용자 발화 문장 수신부, 사용자 발화 문장 분석부 , 서비스 결정부, 웹/애플리케이션 페이지 제공부, 응답 문장 결정부, 응답 문장 출력부 , 사용자 인증 정보 저장부 및 대화 서비스 설정 정보 저장부를 포함할 수 있다. 일 실시예에서, 사용자 발화 문장 수신부는 마이크로폰을 통해 사용자의 발화 문장 입력을 수신할 수 있다. 사용자 발화 문장 수신부는 사용자의 발화 문장 입력을 수신하기 위한 마이크로폰을 포함할 수 있 다. 사용자 발화 문장 분석부는 사용자의 발화 문장 입력에 대응하는 발화 문장에 대한 분석을 수행할 수 있다. 사용자 발화 문장 분석부는 발화 문장으로부터 명사, 수량, 동사 및 사용자의 의도에 대한 정보 중 적어도 하나를 추출할 수 있다. 사용자 발화 문장 분석부는 다른 음성인식에 대한 솔루션을 사용할 수 있 는 자유도를 가질 수 있다. 서비스 결정부는 미리 등록된 대화 서비스 설정 정보에 기초하여 발화 문장 입력에서 의도된 서비스를 결 정할 수 있다. 웹/애플리케이션 페이지 제공부는 사용자가 대화 서비스 설정 정보에 대한 등록, 수정 및 삭제 중 적어도 하나를 수행하는 것에 대한 웹 페이지 또는 애플리케이션의 페이지를 제공할 수 있다. 응답 문장 결정부는 대화 서비스 설정 정보 및 사용자의 발화 문장에 대한 분석 결과에 기초하여, 결정된 서비스와 관련된 발화 문장 입력에 대응하는 응답 문장을 결정할 수 있다. 응답 문장 결정부는 대화 서비 스 설정 정보에 등록된 서비스별 대표 문장들 중에서 발화 문장 입력에 대응하는 대표 문장을 결정할 수 있다. 응답 문장 결정부는 대표 문장에 대응하는 기 정의된 응답 문장을 발화 문장에 대응하는 응답 문장으로 결 정할 수 있다. 응답 문장 출력부는 결정된 응답 문장을 출력하여 사용자에게 제공할 수 있다. 응답 문장 출력부는 응답 문장이 음성 형태인 경우, 스피커와 같은 음성 출력 장치를 통해 음성 형태로 출력할 수 있고, 텍스트 형 태인 경우, 디스플레이 등을 통해 텍스트 형태로 출력할 수 있다. 또한, 응답 문장 출력부는 응답 문장이 동영상 형태인 경우, 디스플레이와 음성 출력 장치를 통해 동영상 형태로 출력할 수 있다. 사용자 인증 정보 저장부는 사용자 계정이 인공지능 대화 서비스를 제공받는 것과 관련한 사용자의 인증 정보를 저장할 수 있다. 사용자가 입력한 사용자 계정에 대한 입력 정보가 사용자 인증 정보 저장부에 저 장되어 있는 경우, 사용자 계정은 인공지능 대화 서비스 제공받는 것과 관련한 권한을 부여받을 수 있다. 대화 서비스 설정 정보 저장부는 인공지능 대화 서비스 제공 장치가 대화 서비스를 제공하는 것과 관련하 여, 서비스, 시나리오, 대화 및 서비스 순서 중 적어도 하나에 대한 설정 정보를 저장할 수 있다. 여기서, 서 비스, 시나리오, 대화 및 서비스 순서 중 적어도 하나는 인공지능 대화 서비스 생성 장치를 통해 생성되어 인공 지능 대화 서비스 제공 장치의 대화 서비스 설정 정보 저장부에 저장될 수 있다. 도 6은 일 실시예에 따른 인공지능 대화 서비스 생성 장치의 구성을 도시하는 도면이다. 도 6을 참조하면, 인공지능 대화 서비스 생성 장치는 본 명세서에서 설명된 인공지능 대화 서비스 생성 장 치에 대응할 수 있다. 인공지능 대화 서비스 생성 장치는 프로세서, 메모리 및 통신 인터페이 스를 포함할 수 있다. 또한 실시예에 따라, 인공지능 대화 서비스 생성 장치는 사용자 입력 인터페 이스, 디스플레이 및 스피커를 더 포함할 수 있다. 메모리는 프로세서에 연결되고, 프로세서에 의해 실행가능한 인스트럭션들, 프로세서가 연 산할 데이터 또는 프로세서에 의해 처리된 데이터를 저장할 수 있다. 메모리는 비일시적인 컴퓨터 판독가능 매체, 예컨대 고속 랜덤 액세스 메모리 및/또는 비휘발성 컴퓨터 판독가능 저장 매체(예컨대, 하나 이 상의 디스크 저장 장치, 플래쉬 메모리 장치, 또는 기타 비휘발성 솔리드 스테이트 메모리 장치)를 포함할 수 있다. 통신 인터페이스는 외부 장치(예를 들어, 인공지능 대화 서비스 제공 장치, 사용자 단말 및 제휴 플랫폼) 와 통신하기 위한 인터페이스를 제공한다. 예를 들어, 통신 인터페이스는 유선 네트워크, 무선 네트워크, 블루투스 BLE(Bluetooth Low Energy)를 통해 외부 장치와 통신할 수 있다. 디스플레이는 인공지능 대화 서비스 생성 방법을 제공하는 것과 관련된 화면을 디스플레이할 수 있다. 스 피커는 인공지능 대화 서비스 생성 방법을 제공하는 것과 관련된 음성을 출력할 수 있다. 사용자 입력 인 터페이스는 사용자에 의해 입력되는 사용자 입력을 수신할 수 있다. 예를 들어 사용자 입력 인터페이스 는 터치 스크린, 마우스, 키보드 또는 음성 인식 인터페이스(예, 마이크로폰) 등을 포함할 수 있다. 프로세서는 본 명세서에서 설명된 인공지능 대화 서비스 생성 장치의 동작과 관련된 하나 이상의 동작을 수행하도록 인공지능 대화 서비스 생성 장치를 제어할 수 있다. 일 실시예에서, 사용자 입력 인터페이스에 포함된 마이크로폰은 음성 형태의 사용자의 발화 문장 입력에 대한 사용자 입력을 수신할 수 있다. 또한, 사용자 입력 인터페이스에 포함된 터치 스크린 또는 키보드는텍스트 형태의 사용자의 발화 문장 입력에 대한 사용자 입력을 수신할 수 있다. 스피커는 인공지능 대화 서비스 생성 방법과 관련된 사운드 데이터를 출력할 수 있다. 프로세서는 인공지능 대화 서비스의 서비스 이름에 대한 사용자 입력에 기초하여 서비스 이름에 대응하는 시나리오를 생성할 수 있고, 사용자 발화 문장에 대한 사용자 입력 및 사용자 발화 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력에 기초하여 시나리 오를 형성할 수 있다. 예를 들어, 프로세서는 인공지능 대화 서비스 생성 장치가 인공지능 대화 서비스의 제작을 위한 제작 인터페이스를 통해 인공지능 대화 서비스의 서비스 이름에 대한 사용자 입력을 수신하고, 수신에 응답하여, 서 비스 이름에 대응하는 시나리오를 생성하도록 인공지능 대화 서비스 생성 장치를 제어할 수 있다. 또한, 프로세서는 인공지능 대화 서비스 생성 장치가 시나리오를 형성하는 대화 서비스에서 기준이 되는 사용자 발화 문장에 대한 사용자 입력을 수신하고, 사용자 발화 문장에 대응하는 인공지능 응답 문장에 대 한 사용자 입력을 수신하도록 인공지능 대화 서비스 생성 장치를 제어할 수 있다. 프로세서는 인공지능 대화 서비스 생성 장치가 서비스 이름, 사용자 발화 문장 및 인공지능 응답 문 장에 대한 정보를 저장하도록 인공지능 대화 서비스 생성 장치를 제어할 수 있다. 프로세서는 인공 지능 대화 서비스 생성 장치가 사용자 발화 문장 및 사용자 발화 문장의 동의 문장에 대응하는 인공지능 응답 문장에 대한 사용자 입력에 기초하여, 인공지능 응답 문장에 대한 정보를 저장하도록 인공지능 대화 서비 스 생성 장치를 제어할 수 있다. 다른 실시예에서 프로세서는 인공지능 대화 서비스 생성 장치가 사용자 발화 문장에 대한 하나 이상 의 동의 문장을 결정하도록 인공지능 대화 서비스 생성 장치를 제어할 수 있다. 프로세서는 인공지 능 대화 서비스 생성 장치가 사용자 발화 문장에 대한 텍스트 분석을 수행하고, 텍스트 분석 결과에 기초 하여 사용자 발화 문장에 대한 사용자 입력으로부터 추출된 각 단어의 동의어를 출력하도록 인공지능 대화 서비 스 생성 장치를 제어할 수 있다. 또한, 프로세서는 인공지능 대화 서비스 생성 장치가 각 단어 의 동의어에 대한 사용자 선택 정보를 수신하고, 사용자 발화 문장에 대한 사용자 입력 및 사용자 선택 정보 중 적어도 하나에 기초하여 동의 문장을 결정하도록 인공지능 대화 서비스 생성 장치를 제어할 수 있다. 일 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별 히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하 도록 구성될 수 있으며, 그 역도 마찬가지이다. 이상과 같이 본 발명은 비록 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 상기의 실시예에 한정되는 것은 아니며, 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 그러므로, 본 발명의 범위는 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 특허청구범위뿐만 아니 라 이 특허청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2019-0126396", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 인공지능 대화 서비스 생성 방법을 설명하기 위한 흐름도이다. 도 2는 일 실시예에 따른 인공지능 대화 서비스 제공 방법을 설명하기 위한 흐름도이다. 도 3은 일 실시예에 따른 사용자의 발화 문장 입력에 따른 응답 문장이 출력되는 과정을 설명하기 위한 흐름도 이다. 도 4a 내지 도 4f는 일 실시예에 따른 인공지능 대화 서비스 생성과 관련된 사용자 인터페이스를 도시하는 도면 들이다. 도 5는 일 실시예에 따른 인공지능 대화 서비스 제공 장치의 구성을 도시하는 도면이다. 도 6은 일 실시예에 따른 인공지능 대화 서비스 생성 장치의 구성을 도시하는 도면이다."}
