{"patent_id": "10-2021-0067773", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0149604", "출원번호": "10-2021-0067773", "발명의 명칭": "영상 기반 학습 데이터 셋 생성 장치 및 방법", "출원인": "한국전자통신연구원", "발명자": "권영진"}}
{"patent_id": "10-2021-0067773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대상을 촬영한 영상으로부터 상기 대상을 검출하는 영상 취득부;상기 검출된 대상의 근골격에 기반한 자세 정보를 추출하고, 상기 추출된 자세 정보와 상기 대상의 근골격과의매칭 여부를 판단하는 판단부; 및상기 매칭 여부를 판단한 결과에 기반하여 미스 매칭 결과에 대한 자세 정보를 수정하는 수정부를 포함하는 것을 특징으로 하는 영상 기반 학습 데이터 셋 생성 장치."}
{"patent_id": "10-2021-0067773", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "영상 기반 학습 데이터 셋 생성 장치 및 방법이 개시된다. 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 장치는 대상을 촬영한 영상으로부터 대상을 검출하는 영상 취득부; 상기 검출된 대상의 근골격에 기반한 자 세 정보를 추출하고, 상기 추출된 자세 정보와 상기 대상의 근골격과의 매칭 여부를 판단하는 판단부 및 상기 매 칭 여부를 판단한 결과에 기반하여 미스 매칭 결과에 대한 자세 정보를 수정하는 수정부를 포함한다."}
{"patent_id": "10-2021-0067773", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기술에 관한 것으로, 보다 상세하게는 인공지능 학습 모델을 구축하기 위한 학습 데이터 셋 생성 기술에 관한 것이다."}
{"patent_id": "10-2021-0067773", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래에 AI기술을 이용한 서비스 모델이 다양한 산업군에 적용되고 있는데, AI모델의 성능은 학습에 사용되는 데 이터의 양과 질에서 기술력의 차이가 나타난다. 현재 양질의 학습데이터를 확보하기 위해 많은 인적 리소스가 투입되고 있으며 그로 인해 많은 비용과 시간이 소비되고 있다. 특히, 다양한 산업군에서 작업자의 자세로부터 작업 공정하기 위한 학습 데이터 셋의 구축이 요구되고 있다. 한편, 한국등록특허 제 10-2112858 호“가이드 포인트를 제공하는 UI를 이용한 학습 데이터 생성 방법 및 장치 ”는 가이드 포인트를 제공하는 UI를 이용함으로써 방대한 양의 학습 데이터를 생성하는 방법 및 장치에 관하여 개시하고 있다."}
{"patent_id": "10-2021-0067773", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 영상으로부터 신속하고 정확하게 학습 데이터 셋을 생성하는 것을 목적으로 한다. 또한, 본 발명은 영상으로부터 학습 데이터 셋 구축하기 위한 물적, 인적, 그리고 시간적인 리소스를 저감하는 것을 목적으로 한다."}
{"patent_id": "10-2021-0067773", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 장치는 대상을 촬영한 영상으로부터 대상을 검출하는 영상 취득부; 상기 검출된 대상의 근골격에 기반한 자세 정보를 추출하고, 상기 추출된 자세 정보와 상기 대상의 근골격과의 매칭 여부를 판단하는 판단부 및 상기 매칭 여부를 판단한 결과에 기반하여 미스 매칭 결과에 대한 자세 정보를 수정하는 수정부를 포함한다."}
{"patent_id": "10-2021-0067773", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 본 발명은 영상으로부터 신속하고 정확하게 학습 데이터 셋을 생성할 수 있다. 또한, 본 발명은 영상으로부터 학습 데이터 셋 구축하기 위한 물적, 인적, 그리고 시간적인 리소스를 저감할 수 있다."}
{"patent_id": "10-2021-0067773", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 여기서, 반복되는 설명, 본 발명의 요지를 불 필요하게 흐릴 수 있는 공지 기능, 및 구성에 대한 상세한 설명은 생략한다. 본 발명의 실시형태는 당 업계에서 평균적인 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위해서 제공되는 것이다. 따라서, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하, 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 장치를 나타낸 블록도이다. 도 2 내지 도 4 는 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 과정을 나타낸 도면이다. 도 5 및 도 6은 본 발 명의 일실시예에 따른 영상과 대상의 근골격 정상 매칭 결과를 나타낸 도면이다. 도 7 및 도 8은 본 발명의 일 실시예에 따른 영상과 대상의 근골격 미스 매칭 결과를 나타낸 도면이다. 도 9는 본 발명의 일실시예에 따른 자 세 정보의 매칭 결과를 나타낸 도면이다. 도 10은 본 발명의 일실시예에 따른 근골격 기반 자세 정보의 수정 과 정을 나타낸 도면이다. 도 1을 참조하면, 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 장치는 보조 입력 장치, 영상 취득부, 판단부, 수정부 및 저장부를 포함한다. 영상 취득부는 대상을 촬영한 영상으로부터 상기 대상을 검출할 수 있다. 이 때, 영상 취득부는 카메라를 이용하여 작업자(대상)를 촬영하고, 작업자를 촬영한 영상 정보를 입력 받 을 수 있다. 이 때, 영상 취득부는 영상에서 작업자를 검출하고, 작업자에 대한 트래킹을 수행할 수 있다. 이 때, 영상 취득부는 촬영된 영상에서 기설정된 프레임별(설정 값, 0.5초, 1초 등)로 샘플링을 수행할 수 있다. 이 때, 영상 취득부는 샘플링된 영상에서 대상을 검출하고, 얼굴-손가락 화질 열화 정도를 분석할 수 있다. 이 때, 영상 취득부는 열화된 프레임을 스킵하거나, 열화된 프레임의 앞뒤 프레임만을 추출할 수 있다. 도 2를 참조하면, 영상 취득부는 열화된 영상, 정상 판정 영상에 Tagging 후 Non-Labeled DB에 저장 할 수 있다. 판단부는 상기 검출된 대상의 근골격에 기반한 자세 정보를 추출하고, 상기 추출된 자세 정보와 상기 대상 의 근골격과의 매칭 여부를 판단할 수 있다. 이 때, 판단부는 Non-Labeled DB에 저장된 이미지로부터 Pose Estimation Model 또는 Depth 기반 자 세정보 추출할 수 있다. 도 3을 참조하면, 판단부는 추출된 자세 정보를 이미지와 세트로 구성하여 1차 레이블링 데이터로 Pose- Labeled DB에 저장할 수 있다. 이 때, 판단부는 다수의 데이터 셋 검증인의 보조 입력 장치에게 Pose-Labeled DB에 저장된 1차 레이블링 데이터를 전달할 수 있다. 이 때, 판단부는 1차 레이블링 데이터를 판정할 수 있다(Fast Mode). 이 때, 판단부는 영상과 자세정보 매칭 상태 만 판단할 수 있다. 이 때, 판단부는 정상 매칭 시(Image Full Path, Pose Json, Track Type, 검증자 ID, Validation Value(+ 가중치)를 데이터 셋 DB인 저장부에 저장할 수 있다. 이 때, 판단부는 미스 매칭 시 (Image Full Path, Pose Json, Track Type, 검증자 ID, Validation Value(-가중치) 데이터 셋 DB인 저장부에 저장할 수 있다. 이 때, 판단부는 다수의 데이터 셋 검증인의 보조 입력 장치로부터 특정 값(thw, 임계 값) 이상의 가 중치를 얻었을 때 데이터 셋 DB인 저장부에 저장할 수 있다. 도 4를 참조하면, 보조 입력 장치를 통해 검증인들이 미스 매칭과 정상 매칭인 결과를 판정하여 입력하는 과정을 나타낸 것을 알 수 있다. 보조 입력 장치는 영상과 자세정보 매칭 상태만 판단함에 있어서, 일반적인 컴퓨팅 디바이스를 사용하기 어 려운 신체 장애가 있는 검증인에게 특화된 인터페이스를 지원할 수 있다. 예를 들어, 보조 입력 장치는 인지장애가 없는 장애인의 상황에 신체활동 역량에 따라 음성, 눈동자 추적기, 눈 깜빡임 감지 장치 또는 얼굴 추적기등을 이용해 매칭 가부 결정만 입력할 수 있다. 도 5 및 도 6을 참조하면, 추출된 자세 정보와 작업자의 근골격이 정상 매칭된 결과를 나타낸 것을 알 수 있다. 도 7 및 도 8을 참조하면, 추출된 자세 정보와 작업자의 근골격이 미수 매칭된 결과를 나타낸 것을 알 수 있다. 도 9를 참조하면, 보조 입력 장치가 검증인의 표정으로부터 추출된 자세 정보와 작업자의 근골격에 대한 PASS(판단 불가), NOT ACCEPT(미스 매칭) 및 ACCEPT(정상 매칭)을 판단하는 예시를 나타낸 것을 알 수 있다. 수정부는 상기 매칭 여부를 판단한 결과에 기반하여 미스 매칭 결과에 대한 자세 정보를 수정할 수 있다. 이 때, 수정부는 2차 레이블링 데이터 판정을 수행할 수 있다(Normal Mode). 이 때, 수정부는 1차 레이블링 데이터 판정(Fast Mode)에서 부적합 판정 데이터를 재 검증할 수 있다. 이 때, 수정부는 Pose-Label 정보를 검증자가 Pose Estimation Model이 오 인식한 자세 정보를 수정할 수 있다. 도 10을 참조하면, 보조 입력 장치를 통해 검증자가 미스 매칭된 자세 정보를 드래그 또는 지점간 포인팅을 통해 작업자와 정상 매칭 되도록 자세 정보를 수정하는 예를 나타낸 것을 알 수 있다. 이 때, 수정부는 수정된 자세 정보에 상응하는 Image Full Path, Pose Json(수정본), Track Type, 검증자 ID를 데이터셋 DB에 저장할 수 있다. 도 11은 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 방법을 나타낸 동작흐름도이다. 도 11을 참조하면, 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 방법은 먼저 영상을 취득할 수 있다(S210). 즉, 단계(S210)는 대상을 촬영한 영상으로부터 상기 대상을 검출할 수 있다. 이 때, 단계(S210)는 카메라를 이용하여 작업자(대상)를 촬영하고, 작업자를 촬영한 영상 정보를 입력 받을 수 있다. 이 때, 단계(S210)는 영상에서 작업자를 검출하고, 작업자에 대한 트래킹을 수행할 수 있다. 이 때, 단계(S210)는 촬영된 영상에서 기설정된 프레임별(설정 값, 0.5초, 1초 등)로 샘플링을 수행할 수 있다. 이 때, 단계(S210)는 샘플링된 영상에서 대상을 검출하고, 얼굴-손가락 화질 열화 정도를 분석할 수 있다. 이 때, 단계(S210)는 열화된 프레임을 스킵하거나, 열화된 프레임의 앞뒤 프레임만을 추출할 수 있다. 이 때, 단계(S210)는 열화된 영상, 정상 판정 영상에 Tagging 후 Non-Labeled DB에 저장할 수 있다. 또한, 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 방법은 대상의 자세 관련 데이터인 자세 정보 를 추출할 수 있다(S220). 즉, 단계(S220)는 상기 검출된 대상의 근골격에 기반한 자세 정보를 추출하고, 이 때, 단계(S220)는 Non-Labeled DB에 저장된 이미지로부터 Pose Estimation Model 또는 Depth 기반 자 세정보 추출할 수 있다. 이 때, 단계(S220)는 추출된 자세 정보를 이미지와 세트로 구성하여 1차 레이블링 데이터로 Pose-Labeled DB에 저장할 수 있다. 또한, 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 방법은 데이터를 판정할 수 있다(S230). 즉, 단계(S230)는 상기 추출된 자세 정보와 상기 대상의 근골격과의 매칭 여부를 판단할 수 있다. 이 때, 단계(S230)는 다수의 데이터 셋 검증인의 보조 입력 장치에게 Pose-Labeled DB에 저장된 1차 레이블링 데이터를 전달할 수 있다. 이 때, 단계(S230)는 1차 레이블링 데이터를 판정할 수 있다(Fast Mode). 이 때, 단계(S230)는 영상과 자세정보 매칭 상태 만 판단할 수 있다. 이 때, 단계(S230)는 정상 매칭 시(Image Full Path, Pose Json, Track Type, 검증자 ID, Validation Value(+ 가중치)를 데이터 셋 DB인 저장부에 저장할 수 있다. 이 때, 단계(S230)는 미스 매칭 시 (Image Full Path, Pose Json, Track Type, 검증자 ID, Validation Value(- 가중치) 데이터 셋 DB인 저장부에 저장할 수 있다. 이 때, 단계(S230)는 다수의 데이터 셋 검증인의 보조 입력 장치로부터 특정 값(thw, 임계 값) 이상의 가중 치를 얻었을 때 데이터 셋 DB인 저장부에 저장할 수 있다. 도 4를 참조하면, 보조 입력 장치를 통해 검증인들이 미스 매칭과 정상 매칭인 결과를 판정하여 입력하는 과정을 나타낸 것을 알 수 있다. 보조 입력 장치는 영상과 자세정보 매칭 상태만 판단함에 있어서, 일반적인 컴퓨팅 디바이스를 사용하기 어 려운 신체 장애가 있는 검증인에게 특화된 인터페이스를 지원할 수 있다. 예를 들어, 보조 입력 장치는 인지장애가 없는 장애인의 상황에 신체활동 역량에 따라 음성, 눈동자 추적기, 눈 깜빡임 감지 장치 또는 얼굴 추적기등을 이용해 매칭 가부 결정만 입력할 수 있다. 도 5 및 도 6을 참조하면, 추출된 자세 정보와 작업자의 근골격이 정상 매칭된 결과를 나타낸 것을 알 수 있다. 도 7 및 도 8을 참조하면, 추출된 자세 정보와 작업자의 근골격이 미수 매칭된 결과를 나타낸 것을 알 수 있다. 도 9를 참조하면, 보조 입력 장치가 검증인의 표정으로부터 추출된 자세 정보와 작업자의 근골격에 대한 PASS(판단 불가), NOT ACCEPT(미스 매칭) 및 ACCEPT(정상 매칭)을 판단하는 예시를 나타낸 것을 알 수 있다. 또한, 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 방법은 데이터를 수정할 수 있다(S240). 즉, 단계(S240)는 상기 매칭 여부를 판단한 결과에 기반하여 미스 매칭 결과에 대한 자세 정보를 수정할 수 있 다. 이 때, 단계(S240)는 2차 레이블링 데이터 판정을 수행할 수 있다(Normal Mode). 이 때, 단계(S240)는 1차 레이블링 데이터 판정(Fast Mode)에서 부적합 판정 데이터를 재 검증할 수 있다. 이 때, 단계(S240)는 Pose-Label 정보를 검증자가 Pose Estimation Model이 오 인식한 자세 정보를 수정할 수 있다. 도 10을 참조하면, 보조 입력 장치를 통해 검증자가 미스 매칭된 자세 정보를 드래그 또는 지점간 포인팅을 통해 작업자와 정상 매칭 되도록 자세 정보를 수정하는 예를 나타낸 것을 알 수 있다.이 때, 단계(S240)는 수정된 자세 정보에 상응하는 Image Full Path, Pose Json(수정본), Track Type, 검증자 ID를 데이터셋 DB에 저장할 수 있다. 도 12는 본 발명의 일실시예에 따른 컴퓨터 시스템을 나타낸 도면이다. 도 12를 참조하면, 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 장치는 컴퓨터로 읽을 수 있는 기록매체와 같은 컴퓨터 시스템에서 구현될 수 있다. 도 12에 도시된 바와 같이, 컴퓨터 시스템은 버스를 통하여 서로 통신하는 하나 이상의 프로세서, 메모리, 사용자 인터페이스 입력 장치 , 사용자 인터페이스 출력 장치 및 스토리지를 포함할 수 있다. 또한, 컴퓨터 시스템(110 0)은 네트워크에 연결되는 네트워크 인터페이스를 더 포함할 수 있다. 프로세서는 중앙 처 리 장치 또는 메모리나 스토리지에 저장된 프로세싱 인스트럭션들을 실행하는 반도체 장치일 수 있 다. 메모리 및 스토리지는 다양한 형태의 휘발성 또는 비휘발성 저장 매체일 수 있다. 예를 들어, 메모리는 ROM이나 RAM을 포함할 수 있다. 이상에서와 같이 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 장치 및 방법은 상기한 바와 같이 설명된 실시예들의 구성과 방법이 한정되게 적용될 수 있는 것이 아니라, 상기 실시예들은 다양한 변형이 이루 어질 수 있도록 각 실시예들의 전부 또는 일부가 선택적으로 조합되어 구성될 수도 있다."}
{"patent_id": "10-2021-0067773", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 장치를 나타낸 블록도이다. 도 2 내지 도 4는 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 과정을 나타낸 도면이다. 도 5 및 도 6은 본 발명의 일실시예에 따른 영상과 대상의 근골격 정상 매칭 결과를 나타낸 도면이다. 도 7 및 도 8은 본 발명의 일실시예에 따른 영상과 대상의 근골격 미스 매칭 결과를 나타낸 도면이다. 도 9는 본 발명의 일실시예에 따른 자세 정보의 매칭 결과를 나타낸 도면이다. 도 10은 본 발명의 일실시예에 따른 근골격 기반 자세 정보의 수정 과정을 나타낸 도면이다. 도 11은 본 발명의 일실시예에 따른 영상 기반 학습 데이터 셋 생성 방법을 나타낸 동작흐름도이다. 도 12는 본 발명의 일실시예에 따른 컴퓨터 시스템을 나타낸 도면이다."}
