{"patent_id": "10-2023-0186295", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0052240", "출원번호": "10-2023-0186295", "발명의 명칭": "하이브리드 벅 컨버터 및 이의 동작 방법, 하이브리드 벅 컨버터를 포함하는 전력 관리 IC", "출원인": "삼성전자주식회사", "발명자": "장두진"}}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하이브리드 벅 컨버터에 있어서, 전원 전압 노드와 제1 스위칭 노드를 연결하는 제1 PMOS 트랜지스터와 제2 PMOS 트랜지스터, 접지 노드와 상기제1 스위칭 노드를 연결하는 제1 NMOS 트랜지스터와 제2 NMOS 트랜지스터, 상기 제1 스위칭 노드와 제2 스위칭노드를 연결하는 인덕터를 포함하는 벅 컨버터;상기 제2 스위칭 노드와 제1 출력 노드를 연결하는 제3 NMOS 트랜지스터;상기 제2 스위칭 노드와 제2 출력 노드를 연결하는 제3 PMOS 트랜지스터;상기 제2 출력 노드에 상응하는 제2 출력 전압에 기반하여 구동되는 션트 레귤레이터;상기 제1 PMOS 트랜지스터와 상기 제1 NMOS 트랜지스터의 펄스폭 제어에 기반하여 상기 인덕터를 통과하는 인덕터 전류의 크기를 조절하는 제1 PWM 컨트롤러; 및상기 제1 PMOS 트랜지스터와 상기 제1 NMOS 트랜지스터의 펄스폭 제어에 기반하여 상기 제2 출력 전압의 크기를조절하는 제2 PWM 컨트롤러를 포함하는, 하이브리드 벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 션트 레귤레이터는, 상기 제2 출력 노드 및 상기 제1 출력 노드와 연결되는 파인 PMOS 트랜지스터와, 상기 파인 PMOS 트랜지스터와병렬로 연결되는 코어스 PMOS 트랜지스터와, 상기 제1 출력 노드 및 제3 출력 노드와 연결되는 코어스 NMOS 트랜지스터를 더 포함하고,상기 하이브리드 벅 컨버터는, 상기 제1 출력 노드에 상응하는 제1 출력 전압과 제1 기준 전압의 비교 결과에 기반하여 상기 코어스 PMOS 트랜지스터, 상기 파인 PMOS 트랜지스터, 및 코어스 NMOS 트랜지스터의 제어 신호를 생성함으로써 상기 션트 레귤레이터로부터 상기 제1 출력 노드로 제공되는 션트 전류의 크기를 제어하는, 하는 푸시-풀 컨트롤러를 더 포함하는, 하이브리드 벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제1 PWM 컨트롤러는, 상기 인덕터 전류가 상기 션트 전류의 N배와 동일해지도록 상기 제1 PMOS 트랜지스터 및 상기 제1 NMOS 트랜지스터 간에 펄스폭 비율을 조정하고, 상기 N은 자연수에 상응하는, 하이브리드 벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 제1 PWM 컨트롤러는, 상기 인덕터 전류가 상기 션트 전류의 N배보다 큰 경우, 상기 제1 PMOS 트랜지스터의 듀티 사이클을증가시키고, 상기 인덕터 전류가 상기 션트 전류의 N배보다 작은 경우, 상기 제1 PMOS 트랜지스터의 듀티 사이클을 감소시키도록 구성되고, 공개특허 10-2025-0052240-3-상기 제1 NMOS 트랜지스터와 상기 제1 PMOS 트랜지스터는 서로 교번하여 턴-온되는, 하이브리드 벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 제1 기준 전압은, 동적 전압 스케일링에 기반하여 가변되는, 하이브리드 벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 제2 PWM 컨트롤러는, 상기 제2 출력 전압 및 제2 기준 전압의 비교 결과에 기반하여, 상기 제2 출력 전압이 상기 제2 기준 전압과 동일해지도록 상기 제3 PMOS 트랜지스터 및 상기 제3 NMOS 트랜지스터 간에 펄스폭 비율을 조정하는, 하이브리드벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 제2 PWM 컨트롤러는, 상기 제2 출력 전압이 상기 제2 기준 전압을 초과하는 경우, 상기 제3 PMOS의 듀티 사이클을 감소시키고, 상기제2 출력 전압이 상기 제2 기준 전압보다 미만인 경우, 상기 제3 PMOS의 듀티 사이클을 증가시키도록 구성되고, 상기 제3 NMOS 트랜지스터와 상기 제3 PMOS 트랜지스터는 서로 교번하여 턴-온되는, 하이브리드 벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 제2 기준 전압은, 동적 전압 스케일링의 빈도(frequency)에 기반하여 가변되는, 하이브리드 벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서, 상기 제3 출력 노드와 접지 노드 사이에 제3 출력 커패시터; 상기 제3 출력 노드와 상기 제1 스위칭 노드를 연결하는 제4 NMOS 트랜지스터; 및 상기 제3 출력 노드에 상응하는 제3 출력 전압과 제3 기준 전압의 비교 결과에 기반하여 상기 제4 NMOS 트랜지스터를 턴-온하는 히스테리시스 컨트롤러를 더 포함하는, 하이브리드 벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 히스테리시스 컨트롤러는, 상기 제3 출력 전압이 상기 제3 기준 전압과 윈도우 전압의 합을 초과하는 경우, 상기 제4 NMOS 트랜지스터를턴-온하고, 상기 제1 NMOS 트랜지스터를 턴-오프하고,상기 제3 출력 전압이 상기 제3 기준 전압에서 윈도우 전압을 뺀 값보다 미만인 경우, 상기 제4 NMOS 트랜지스터를 턴-오프하고, 상기 제1 NMOS 트랜지스터를 턴-온하도록 구성되는, 하이브리드 벅 컨버터."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "벅 컨버터 및 션트 레귤레이터를 포함하는 하이브리드 벅 컨버터의 동작 방법에 있어서, 상기 벅 컨버터의 인덕터를 통과하는 인덕터 전류가 상기 션트 레귤레이터로부터 출력되는 션트 전류의 N배의비교 결과에 기반하여 상기 벅 컨버터의 상부 스위칭 소자와 하부 스위칭 소자 간에 펄스폭 제어를 수행하는 단계;공개특허 10-2025-0052240-4-제2 출력 전압과 제2 기준 전압의 비교 결과에 기반하여 제3 NMOS 트랜지스터와 제3 PMOS 트랜지스터 간에 펄스폭 제어를 수행하는 단계를 포함하고, 상기 상부 스위칭 소자는, 전원 전압과 상기 인덕터의 일 단에 상응하는 제1 스위칭 노드를 연결하고, 상기 하부 스위칭 소자는, 접지 노드와 상기 제1 스위칭 노드를 연결하고, 상기 제3 PMOS 트랜지스터는, 상기 제2 출력 전압에 상응하는 제2 출력 노드와 상기 인덕터의 타 단에 상응하는제2 스위칭 노드를 연결하고,제3 NMOS 트랜지스터는, 상기 제2 스위칭 노드와 제1 출력 전압에 상응하는 제1 출력 노드를 연결하는, 하이브리드 벅 컨버터의 동작 방법."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 션트 레귤레이터는, 상기 제2 출력 노드 및 상기 제1 출력 노드와 연결되는 파인 PMOS 트랜지스터와, 상기파인 PMOS 트랜지스터와 병렬로 연결되는 코어스 PMOS 트랜지스터와, 상기 제1 출력 노드 및 제3 출력 노드와연결되는 코어스 NMOS 트랜지스터를 더 포함하고,상기 제1 출력 전압과 제1 기준 전압의 비교하는 단계;상기 비교의 결과에 기반하여 상기 코어스 PMOS 트랜지스터, 상기 파인 PMOS 트랜지스터, 및 코어스 NMOS 트랜지스터의 제어 신호를 생성하는 단계;상기 제어 신호에 기반하여 상기 션트 전류의 크기를 제어하는 단계를 더 포함하는, 하이브리드 벅 컨버터의 동작 방법."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 상부 스위칭 소자와 하부 스위칭 소자 간에 펄스폭 제어를 수행하는 단계는, 상기 인덕터 전류가 상기 션트 전류의 N배보다 큰 것을 식별하는 단계;상기 식별에 기반하여, 상기 상부 스위칭 소자의 듀티 사이클을 증가시키는 단계를 더 포함하는, 하이브리드 벅컨버터의 동작 방법."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 상부 스위칭 소자와 하부 스위칭 소자 간에 펄스폭 제어를 수행하는 단계는, 상기 인덕터 전류가 상기 션트 전류의 N배보다 작은 것을 식별하는 단계;상기 식별에 기반하여, 상기 상부 스위칭 소자의 듀티 사이클을 감소시키는 단계를 더 포함하는, 하이브리드 벅컨버터의 동작 방법."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서, 상기 제1 기준 전압은, 동적 전압 스케일링에 기반하여 가변되는, 하이브리드 벅 컨버터의 동작 방법."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 제3 NMOS 트랜지스터와 상기 제3 PMOS 트랜지스터 간에 펄스폭 제어를 수행하는 단계는, 상기 제2 출력 전압이 상기 제2 기준 전압을 초과하는 것을 식별하는 단계; 및공개특허 10-2025-0052240-5-상기 식별에 기반하여, 상기 제3 PMOS의 듀티 사이클을 감소시키는 단계를 더 포함하는, 하이브리드 벅 컨버터의 동작 방법."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서, 상기 제3 NMOS 트랜지스터와 상기 제3 PMOS 트랜지스터 간에 펄스폭 제어를 수행하는 단계는, 상기 제2 출력 전압이 상기 제2 기준 전압보다 미만임을 식별하는 단계; 및상기 식별에 기반하여, 상기 제3 PMOS 트랜지스터의 듀티 사이클을 증가시키는 단계를 더 포함하는, 하이브리드벅 컨버터의 동작 방법."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서, 상기 제2 기준 전압은, 동적 전압 스케일링의 빈도(frequency)에 기반하여 가변되는, 하이브리드 벅 컨버터의동작 방법."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12항에 있어서, 제3 출력 전압과 제3 기준 전압을 비교하는 단계;상기 비교의 결과에 기반하여, 제4 NMOS 트랜지스터를 턴-온 또는 턴-오프하는 단계를 더 포함하고, 상기 제3 출력 전압은, 상기 제3 출력 노드와 접지 노드를 연결하는 제3 커패시터에 기반하고, 상기 제4 NMOS 트랜지스터는, 상기 제3 출력 노드와 상기 제1 스위칭 노드를 연결하는, 하이브리드 벅 컨버터의 동작 방법."}
{"patent_id": "10-2023-0186295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 제3 출력 전압이 상기 제3 기준 전압과 윈도우 전압의 합을 초과하는 경우, 상기 제4 NMOS 트랜지스터를턴-온하는 단계; 상기 제3 출력 전압이 상기 제3 기준 전압에서 윈도우 전압을 뺀 값보다 미만인 경우, 상기 제4 NMOS 트랜지스터를 턴-오프하는 단계를 더 포함하는, 하이브리드 벅 컨버터의 동작 방법."}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여, 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터는, 전원 전압 노드 와 제1 스위칭 노드를 연결하는 제1 PMOS 트랜지스터와 제2 PMOS 트랜지스터, 접지 노드와 상기 제1 스위칭 노드 를 연결하는 제1 NMOS 트랜지스터와 제2 NMOS 트랜지스터, 상기 제1 스위칭 노드와 제2 스위칭 노드를 연결하는 (뒷면에 계속)"}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 기술적 사상은 하이브리드 벅 컨버터에 관한 것이며, 더욱 상세하게는, 고속 과도 응답 및 높은 동적 효율을 위한 하이브리드 벅 컨버터 및 이의 동작 방법, 하이브리드 벅 컨버터를 포함하는 전력 관리 IC에 관한 것이다."}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 및 머신러닝과 같은 고성능 병렬 처리 기술은 보편화되었으며, 이미지 및 음성인식 이외에도 다양한 영역으로 확산되고 있다. 다량의 데이터를 고속으로 처리해야 하는 특성상 고성능 컴퓨팅용 프로세서의 활용이 필수적인데 극복해야 하는 기술적 요구가 대두되고 있다. 예를 들어, 고성능 컴퓨팅용 프로세서에서 필요로 하 는 전력량이 지속적으로 상승하고 있다. 상승하는 전력 요구량에 비례하여 높은 열 설계 전력과 높은 열 소모 비용이 요구되며 방열을 위해 많은 자원들이 소모되고 있다. 전력 사용률을 효과적으로 제어하기 위해 프로세싱 처리량에 따라 전원을 가변하는 동적 전압 스케일링 기술은 고성능 컴퓨팅용 프로세서에서 필수적이며, 더 높은 효율을 달성하기 위해서는 동적 전압 스케일링의 트래킹 속 도의 개선이 필요하다. 동전 전압 스케일링의 트래킹 속도를 높이기 위하여 벅 컨버터에 병렬로 션트 레귤레이 터를 추가하는 하이브리드 벅 컨버터가 제안되었다. 다만, 기 제안된 하이브리드 벅 컨버터는 이상적으로 100%의 전력 변환 효율을 가지는 벅 컨버터에 비하여 전력 손실을 야기하는 션트 레귤레이터의 잦은 동작에 따라 효율 감소가 기하 급수적으로 커지게 된다. 따라서, 동적 전압 스케일링을 지원하는 하이브리드 벅 컨버터에서 이와 같은 효율 감소를 최소화할 필요가 있다."}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 기술적 사상이 해결하려는 과제는, 고속 과도 응답을 유지하는 동시에 높은 동적 효율을 가지는 하이 브리드 벅 컨버터, 하이브리드 벅 컨버터의 동작 방법 및 하이브리드 벅 컨버터를 포함하는 전력 관리 IC를 제 공하는 데에 있다."}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터는, 전원 전압 노드와 제1 스위칭 노드를 연결하는 제1 PMOS 트랜지스터와 제2 PMOS 트랜지스터, 접지 노드와 상기 제1 스위칭 노드를 연결하는 제1 NMOS 트랜지스터와 제2 NMOS 트랜지스터, 상기 제1 스위칭 노드와 제2 스위칭 노드를 연결하는 인덕터를 포함하는 벅 컨버터, 상기 제2 스위칭 노드와 제1 출력 노드를 연결하는 제3 NMOS 트랜지스터, 상기 제2 스위칭 노드와 제2 출력 노드를 연결하는 제3 PMOS 트랜지스터, 상기 제2 출력 노드에 상응하는 제2 출력 전압에 기반하여 구동되는 션트 레귤 레이터, 상기 제1 PMOS 트랜지스터와 상기 제1 NMOS 트랜지스터의 펄스폭 제어에 기반하여 상기 인덕터를 통과 하는 인덕터 전류의 크기를 조절하는 제1 PWM 컨트롤러, 및 상기 제1 PMOS 트랜지스터와 상기 제1 NMOS 트랜지 스터의 펄스폭 제어에 기반하여 상기 제2 출력 전압의 크기를 조절하는 제2 PWM 컨트롤러를 포함할 수 있다. 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 동작 방법은, 상기 벅 컨버터의 인덕터를 통과하는 인 덕터 전류가 상기 션트 레귤레이터로부터 출력되는 션트 전류의 N배와 동일한지 비교하는 단계와, 상기 비교의 결과에 따라, 상기 벅 컨버터의 상부 스위칭 소자와 하부 스위칭 소자 간에 펄스폭 제어를 수행하는 단계와, 제 2 출력 전압과 제2 기준 전압의 비교 결과에 기반하여 제3 NMOS 트랜지스터와 제3 PMOS 트랜지스터 간에 펄스폭 제어를 수행하는 단계를 포함하고, 상기 상부 스위칭 소자는, 전원 전압과 상기 인덕터의 일 단에 상응하는 제1 스위칭 노드를 연결하고, 상기 하부 스위칭 소자는, 접지 노드와 상기 제1 스위칭 노드를 연결하고, 상기 제3 PMOS 트랜지스터는, 상기 제2 출력 전압에 상응하는 제2 출력 노드와 상기 인덕터의 타 단에 상응하는 제2 스위 칭 노드를 연결하고, 제3 NMOS 트랜지스터는, 상기 제2 스위칭 노드와 제1 출력 전압에 상응하는 제1 출력 노드 를 연결할 수 있다."}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 예시적 실시예에 따르면, 하이브리드 벅 컨버터의 션트 레귤레이터를 별도의 외부 전원 없이 구동함 으로써 션트 레귤레이터에서 발생하는 전압 강하의 크기를 감소시켜 전력 소모를 최소화할 수 있다. 본 개시의 예시적 실시예에 따르면, 벅 컨버터에 의한 전류와 션트 레귤레이터에 의한 전류 간에 배수 관계를 설정함으로서 션트 레귤레이터에서 발생하는 전력 소모를 최소화할 수 있다. 본 개시의 예시적 실시예에 따르면, 디스차지되는 전류를 커패시터에 저장하고, 저장된 전하에 따라 인덕터 전 류로 재사용함으로써 전력 소모를 최소화할 수 있다. 본 개시의 예시적 실시예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 아니하며, 언급되지"}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아니한 다른 효과들은 이하의 기재로부터 본 개시의 예시적 실시예들이 속하는 기술분야에서 통상의 지식을 가 진 자에게 명확하게 도출되고 이해될 수 있다. 즉, 본 개시의 예시적 실시예들을 실시함에 따른 의도하지 아니"}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "한 효과들 역시 본 개시의 예시적 실시예들로부터 당해 기술분야의 통상의 지식을 가진 자에 의해 도출될 수 있 다."}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 개시의 예시적 실시예들에 대하여 상세히 설명하기로 한다. 도 1은 본 개시의 예시적 실시예에 따른 전자 장치 및 외부 전원을 나타내는 블록도이다. 도 1을 참조하면, 전자 장치 및 외부 전원이 개시된다. 전자 장치에 포함되는 배터리를 충 전하기 위하여, 전자 장치 및 외부 전원은 서로 유선 또는 무선을 통해 연결될 수 있다. 다양한 실시예들에서, 전자 장치는 사용자가 휴대할 수 있는 다양한 전자 기기들을 포함할 수 있다. 예를 들어, 전자 장치는 스마트 폰, 태블릿(tablet) PC(Personal Computer), 휴대폰, PDA(Personal Digital Assistant), 랩톱, 웨어러블(wearable) 장치, GPS(Global Positional system) 장치, 전자책 단말기, 디지털방 송용 단말기, MP3 플레이어, 디지털 카메라 등과 같은 모바일 장치일 수 있다. 다른 예를 들어, 전자 장치(10 0)는 전기 자동차일 수도 있다. 실시예에 따라, 전자 장치는 전력 관리 IC(integrated circuit)(PMIC)를 포함할 수 있다. PMIC(10 1)는 집적 회로 칩으로서 구현될 수 있으며, 인쇄 회로 기판(printed circuitry board, PCB) 상에 장착될 수도 있다. PMIC는 외부 전원으로부터 전력을 공급받아, 배터리에 전달함으로써, 배터리를 충전 할 수 있으며, 시스템 로드에게 전력을 전달함으로써 전자 장치가 다양한 기능을 수행하도록 제어할 수 있다. PMIC에 관한 구체적인 구성은 도 2에서 후술하기로 한다. 또한, 전자 장치는 배터리를 포함할 수 있다. 배터리는 적어도 하나의 배터리 셀을 포함할 수 있다. 예를 들어, 배터리는 서로 직렬로 연결된 복수의 배터리 셀들을 포함하는 멀티 셀 배터리에 대응될 수 있다. 다른 예를 들어, 배터리는 하나의 배터리 셀을 포함하는 싱글 셀 배터리에 대응될 수도 있다. 배 터리는, 전자 장치가 외부 전원과 연결된 경우, PMIC를 통해 전력을 공급받을 수 있다. 배 터리는, 전자 장치가 외부 전원과 연결되지 않는 경우, 시스템 로드에게 전력을 제공함으 로써 전자 장치가 다양한 기능을 수행하도록 제어할 수 있다.또한, 전자 장치는 시스템 로드를 포함할 수 있다. 미 도시되었지만, 시스템 로드는 전자 장치 에서 PMIC 및 배터리를 제외한 나머지 구성들을 포함할 수 있다. 예를 들어, 시스템 로드 는 디스플레이, 어플리케이션 프로세서, 통신 프로세서, 스피커, 메모리 등을 포함할 수 있다. 즉, 시스템 로드 는 전자 장치에 포함되는 칩들, 모듈들, 동작 블록, 기능 블록, IP(intellectual property) 블록들 을 지칭할 수 있다. 시스템 로드는 외부 전원 또는 배터리로부터 전력을 공급받고, 다양한 기능 을 사용자에게 제공할 수 있다. 예를 들어, 시스템 로드 중 모니터는 디스플레이를 통해 객체를 표시함으 로써, 사용자에게 시각적 인지를 제공할 수 있고, 통신 프로세서는, 외부 장치(external device)와 무선 신호를 교환함으로써 데이터를 송수신할 수 있으며, 어플리케이션 프로세서는 다양한 연산을 수행할 수 있다. 또한, 전자 장치는 리셉터클(receptacle) 인터페이스를 포함할 수 있다. 리셉터클 인터페이스는 USB(universal serial bus) 케이블을 통해 전자 장치와 외부 전원을 연결할 수 있다. 일 실시예에서, 리셉터클 인터페이스는 USB 타입-C 인터페이스에 상응할 수 있고, 상기 USB 케이블은 USB 타 입-C 케이블에 상응할 수 있다. 상기 USB 타입-C 인터페이스는, USB 2.0, USB 3.1 또는, USB 3.2의 정의에 기 초하여 구현될 수 있다. 리셉터클 인터페이스는 복수의 핀들을 포함할 수 있다. 복수의 핀들은, 전력 공급 을 위한 핀, 데이터 전송을 위한 핀, CC(configuration channel) 핀을 포함할 수 있다. 외부 전원은 전자 장치에게 전력을 공급할 수 있다. 다양한 실시예들에 따라, 외부 전원은 TA(travel adaptor) 및 무선 충전기(wireless charger)를 포함할 수 있다. 무선 충전기는 와이 어를 통해 전력을 공급하는 대신, 대기(air)를 통해 무선으로 전력을 전송하여 전자 장치를 충전할 수 있 다. 다양한 실시예들에 따라, 무선 충전기는 자기유도 방식, 자기공진 방식, 및 전자기 유도 방식, 비방사 형 무선 충전(WiTricity) 등 다양한 무선 충전 방식에 기반하여 전력을 전송할 수 있다. TA는 전자 장치의 PMIC와 연결되는 와이어를 통해 전력을 공급할 수 있다. TA는 가정용 전원인 AC 110V 내지 220V 또는 다른 전원 공급 수단(예를 들어, 컴퓨터)으로부터 공급되는 전원을 배터리(10 3)의 충전에 필요한 DC 전원으로 변환하여 전자 장치에 제공할 수 있다. 다양한 실시예들에 따라, 리셉터 클 인터페이스는 보조 배터리의 출력 단자와 전기적으로 연결될 수도 있다. 도 2는 본 개시의 예시적 실시예에 따른 PMIC의 세부 블록도이다. 도 2의 PMIC은 도 1의 전자 장치에 포함되는 PMIC에 상응할 수 있다. 도 2를 참조하면, PMIC는 제어 회로, 다이렉트 차저, 스위칭 차저, ICL, 퓨얼 게이지, 파워미터 를 포함할 수 있다. ICL은 입력 전류의 크기를 조절할 수 있다. 예를 들어, 배터리의 충전과 동시에 시스템 로드 또 한 동작중인 경우, PMIC로 입력되는 입력 전류의 크기는 배터리를 충전하기 위한 충전 전류와 시스템 로드 에게 전달되는 로드 전류의 합에 대응할 수 있다. 입력 전류의 크기가 증가하는 경우, PMIC의 과부하 및 이에 따른 화재 등의 위험을 야기할 수 있다. 따라서, ICL은 입력 전류의 크기가 일정 크기를 초과하지 않도록 제어할 수 있다. 미 도시되었지만, ICL은 내부 트랜지스터 저항을 포함할 수 있다. 입력 전류의 크 기가 일정 크기를 초과하는 경우, 제어 회로로부터 수신한 제어 신호(Ctrl)에 따라 내부 트랜지스터 저항 의 크기를 증가시킬 수 있다. 외부 전원 전압의 크기는 일정하므로, 내부 트랜지스터 저항의 크기를 증가시킴으 로써 입력 전류의 크기를 감소시킬 수 있다. 제어 회로는 PMIC의 전반적인 동작을 제어할 수 있다. 제어 회로는 리셉터클 인터페이스를 통해 TA와 통신을 수행할 수 있다. 예를 들어, 제어 회로는 제어 정보(control information)를 TA에게 전송하여 TA의 출력 전압 및 출력 전류를 제어할 수 있다. 스위칭 차저는 벅 컨버터(BUCK converter)를 포함하며, 입력 전압을 스텝 다운(step down)하고, 벅 컨버터 의 주기를 조절하여 충전 전류를 조정할 수 있다. 스위칭 차저는 인덕터(inductor)를 포함하기 때문에, 스 위칭 손실(switching loss)과 인덕터 자체의 저항 성분에 의한 전도 손실(conduction loss)을 제거할 수 없다. 따라서, 스위칭 차저의 충전 효율은 다이렉트 차저보다 충전 효율보다 낮을 수 있다. 다이렉트 차저는 캡 디바이더를 통해(via) 입력 전압을 배터리에 직접적으로 전달할 수 있다. 다이렉 트 차저는 트랜지스터 및 커패시터(capacitor)만 포함하므로, 전술한 스위칭 손실 및 인덕터 자체의 저항 성분에 의한 전도 손실을 세이브할 수 있다. 캡 디바이더를 통해 입력 전압을 직접 배터리의 노드에 전달 할 수 있으므로, 고효율 충전 시스템에 적합할 수 있다. 퓨얼 게이지는 배터리를 센싱할 수 있다. 예를 들어, 퓨얼 게이지는 배터리의 충전 상태 (state of charge, SoC), 충전 전압, 충전 전류, 배터리 온도를 센싱할 수 있다. 충전 상태는 배터리의 최 대 용량에 대한 현재 용량의 비율로서, 퍼센트(%) 단위로 정의될 수 있다. 미 도시되었지만, 퓨얼 게이지는 ADC 컨버터(analog to digital converter)를 포함할 수 있다. 퓨얼 게이 지는 ADC 컨버터를 통해 센싱한 전압, 전류, 온도의 아날로그 정보를 디지털 변환하여 다이렉트 차저 , 스위칭 차저 및/또는 시스템 로드에게 전달할 수 있다. 퓨얼 게이지는 집적 회로 칩의 일부로서 구현될 수 있고, 인쇄 회로 기판에 장착될 수 있다. 그러나, 본 발명은 이에 한정되지 않으며, 퓨얼 게이지와 PMIC는 서로 다른 집적 회로들 또는 집적 회로 칩들로 각각 구현될 수도 있다. 파워미터는 입출력 전압 및 전류에 대한 정보를 획득할 수 있다. 파워미터는 PMIC로 입력되는 전압 및 전류, 시스템 로드에게 전달되는 전압 및 전류의 크기를 센싱할 수 있다. 미 도시되었지만, 파워미터는 ADC 컨버터를 포함하며, ADC 컨버터를 이용하여 센싱한 전압, 전류, 전력에 대한 정보를 디지털 변환하여 다이렉트 차저, 스위칭 차저 및/또는 시스템 로드에게 전달할 수 있다. 파워미터는 집적 회로 칩의 일부로서 구현될 수 있고, 인쇄 회로 기판에 장착될 수 있다. 그러나, 본 발명은 이에 한정되지 않으며, 파워미터와 PMIC는 서로 다른 집적 회로들 또는 집적 회로 칩들로 각각 구현될 수도 있다. 미 도시되었지만, PMIC는 전력 절감 조건 하에서도 적절하게 동작하도록 저전압 차단(under-voltage lockout, UVLO) 기능, 과전류 방지(over-current protection, OCP) 기능, 과전압 방지(over-voltage protection, OVP) 기능, 돌입 전류를 경감시키는 소프트-스타트(soft-start) 기능, 폴드백 전류 제한(foldback current limit) 기능, 단락 회로 보호를 위한 히컵 모드(Hiccup Mode) 기능, 과열 차단(over-temperature protection, OTP) 기능 등의 다양한 기능들 중 적어도 하나의 기능을 지원하는 회로 또는 블록을 더 포함할 수 있다. 일 실시예에 따라, 스위칭 차저는 DC-DC 컨버터를 포함할 수 있다. 예를 들어, 상기 DC-DC 컨버터는 하이 브리드 벅 컨버터에 상응할 수 있다. 상기 하이브리드 벅 컨버터는, 이종-병렬 컨버터 중 하나의 종류로서, 예 를 들어, 서로 상이한 벅 컨버터와 션트 레귤레이터가 병렬로 연결된 DC-DC 컨버터를 지칭할 수 있다. 이하, 비 교예에 따른 하이브리드 벅 컨버터 및 본 개시의 예시적 실시예들에 따른 하이브리드 벅 컨버터를 살펴보기로 한다. 도 3a는 비교예에 따른 하이브리드 벅 컨버터의 회로도이고, 도 3b는 비교예에 따른 동작 전압 스케일링의 빈도에 따른 효율 손실을 나타내는 그래프이다. 도 3a를 참조하면, 비교예에 따른 하이브리드 벅 컨버터는 병렬로 연결된 벅 컨버터와 션트(shunt) 레귤레이터를 포함할 수 있다. 벅 컨버터는 PMOS 트랜지스터(MP), NMOS 트랜지스터(MN), 인덕터(L), 커패시터(COUT)를 포함할 수 있다. PMOS 트랜지스터(MP)와 NMOS 트랜지스터(MN)는 서로 교번적으로 턴-온될 수 있다. 예를 들어, 시스템 로드(10 2)로 입력되는 로드 전류(ILOAD)를 증가시켜야 하는 경우, PMOS 트랜지스터(MP)가 턴-온되는 시간이 증가하고, 동 시에 NMOS 트랜지스터(MN)가 턴-온되는 시간이 감소하도록 서로 교번적으로 턴-온될 수 있다. 다른 예를 들어, 시스템 로드로 입력되는 로드 전류(ILOAD)를 감소시켜야 하는 경우, PMOS 트랜지스터(MP)가 턴-온되는 시간 이 감소하고, 동시에 NMOS 트랜지스터(MN)가 턴-온되는 시간이 증가하도록 서로 교번적으로 턴-온될 수 있다. 션트 레귤레이터는 PMOS 트랜지스터(MPH), NMOS 트랜지스터(MNH)를 포함할 수 있다. 션트 레귤레이터 는 고속 과도 응답을 위하여 PMOS 트랜지스터(MPH), NMOS 트랜지스터(MNH)를 제어할 수 있다. 예를 들어, 시스템 로드로 입력되는 로드 전류(ILOAD)를 증가시켜야 하는 경우, 션트 레귤레이터는 PMOS 트랜지스터(MPH) 를 턴-온하여 과도 상태의 로드 전류(ILOAD)에 차지 전류(ICH)를 추가하여 로드 전류(ILOAD)가 빠르게 정상 상태에 진입하도록 제어할 수 있다. 다른 예를 들어, 시스템 로드로 입력되는 로드 전류(ILOAD)를 감소시켜야 하는 경우, 션트 레귤레이터는 NMOS 트랜지스터(MNH)를 턴-온하여 과도 상태의 로드 전류(ILOAD)로부터 디스차지 전류(IDCH)를 차감하여 로드 전류(ILOAD)가 빠르게 정상 상태에 진입하도록 제어할 수 있다.도 3b를 참조하면, 그래프의 X축은 동적 전압 스케일링의 빈도를, 그래프의 Y축은 효율 손실을 각각 나타낸다. 예를 들어, 비교예에 따른 하이브리드 벅 컨버터는 동적 전압 스케일링이 발생할 때마다 션트 레귤레이터 를 통해 로드 전류(ILOAD)에 차지 전류(ICH)를 추가하거나, 로드 전류(ILOAD)로부터 디스차지 전류(IDCH)를 차 감하도록 동작한다. 다만, 션트 레귤레이터를 동작할 때마다 전력 소모가 발생하며, 전력 소모는 전압 강 하의 크기(예: 전원 전압(VDD)와 출력 전압(VOUT)의 차이)에 비례하며 션트 전류(예: 차지 전류(ICH)와 디스차지 전류(IDCH)의 차이)에 비례할 수 있다. 즉, 도 3b를 참조하면, 동적 전압 스케일링이 발생하는 빈도가 높아질수 록 효율 손실이 급격하게 증가하는 것을 확인할 수 있다. 도 4는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 회로도이다. 도 4를 참조하면, 하이브리드 벅 컨버터는 벅 컨버터 및 션트 레귤레이터를 포함할 수 있다. 추 가적으로, 하이브리드 벅 컨버터는 비교예에 따른 하이브리드 벅 컨버터에 더하여 제3 NMOS 트랜지스 터(MN3), 제3 PMOS 트랜지스터(MP3), 제4 NMOS 트랜지스터(MN4), 커플링 커패시터(CC), 제2 출력 커패시터(COUT2), 제3 출력 커패시터(COUT3)를 더 포함할 수 있다. 실시예에 따라, 하이브리드 벅 컨버터의 제1 NMOS 트랜지스터(MN1), 제2 NMOS 트랜지스터(MN2)는 하부(low- side) 스위칭 소자로 지칭될 수 있다. 하이브리드 벅 컨버터의 제1 PMOS 트랜지스터(MP1), 제2 PMOS 트랜 지스터(MP2)는 상부(high-side) 스위칭 소자로 지칭될 수 있다. 실시예에 따라, 하이브리드 벅 컨버터는 제3 NMOS 트랜지스터(MN3), 제3 PMOS 트랜지스터(MP3) 및 제2 출력 커패시터(COUT2) 커플링 커패시터(CC)를 더 포함할 수 있다. 제3 NMOS 트랜지스터(MN3)는 제2 스위칭 노드(LX2)와 제1 출력 노드(OUT1) 사이에 배치될 수 있다. 제3 PMOS 트랜지스터(MP3)는 제2 스위칭 노드(LX2)와 제2 출력 노드 (OUT2)의 사이에 배치될 수 있다. 실시예에 따라, 제3 NMOS 트랜지스터(MN3)와 제3 PMOS 트랜지스터(MP3)는 서로 교번적으로 턴-온될 수 있다. 제3 NMOS 트랜지스터(MN3)와 제3 PMOS 트랜지스터(MP3)가 교번적으로 턴-온됨으로 써 제2 출력 노드(OUT2)의 전압 레벨이 제어될 수 있다. 제2 출력 노드(OUT2)의 전압은, 제2 출력 전압(VOUT2)에 상응할 수 있다. 제2 출력 노드(OUT2)는 션트 레귤레이터를 구동하기 위한 노드일 수 있다. 즉, 션트 레귤 레이터는 제2 출력 전압(VOUT2)에 기반하여 구동될 수 있다. 커플링 커패시터(CC)는 제1 출력 노드(OUT1)와 제2 출력 노드(OUT2) 사이의 커플링을 위한 커패시터이다. 커플링 커패시터(CC)는 제1 출력 노드(OUT1)의 제1 출 력 전압(VOUT1)과 제2 출력 노드(OUT2)의 제2 출력 전압(VOUT2) 사이의 AC 전류가 통과하는 전기적 경로에 상응할 수 있다. 즉, 제1 출력 전압(VOUT1) 및 제2 출력 전압(VOUT2)은 제3 PMOS 트랜지스터(MP3)와 제3 NMOS 트랜지스터 (MN3)의 듀티 사이클, 제1 출력 커패시터(COUT1), 제2 출력 커패시터(COUT2) 및 커플링 커패시터(CC)에 기반하여 레 귤레이션될 수 있다. 실시예에 따라, 하이브리드 벅 컨버터는 제4 NMOS 트랜지스터(MN4) 및 제3 출력 커패시터(COUT3)를 더 포함 할 수 있다. 제4 NMOS 트랜지스터(MN4)는 제1 스위칭 노드(LX1)와 제3 출력 노드(OUT3)를 연결할 수 있다. 제4 NMOS 트랜지스터(MN4)는 제3 출력 커패시터(COUT3)의 전압 레벨에 기반하여 턴-온되거나, 턴-오프될 수 있다. 예 를 들어, 제3 출력 커패시터(COUT3)이 충전되어 제3 출력 노드(OUT3)의 전압 레벨이 제1 임계 값을 초과하는 경우, 제4 NMOS 트랜지스터(MN4)는 턴-온될 수 있다. 제4 NMOS 트랜지스터(MN4)가 턴-온되는 경우, 인덕터 전류 (IIND)는 제3 출력 커패시터(COUT3)에 저장된 전하를 이용하여 생성될 수 있다. 즉, 제4 NMOS 트랜지스터(MN4)는 디스차지되는 전류를 제3 출력 커패시터(COUT3)를 통해 저장하고, 제3 출력 커패시터(COUT3)에 저장된 전하가 일정 기준을 초과하는 경우, 제4 NMOS 트랜지스터(MN4)를 턴-온하여 저장된 전하를 인덕터 전류(IIND)로 다시 사용 (reuse)할 수 있다. 이에 대한 구체적인 설명은 도 8a 내지 도 8c에서 후술하기로 한다. 실시예에 따라, 션트 레귤레이터는 코어스 레귤레이터 및 파인 레귤레이터를 포함할 수 있다. 코어스 레귤레이터는 제2 출력 노드(OUT2)와 제1 출력 노드(OUT1)를 연결하는 코어스 PMOS 트랜지스터(MCP) 및 제1 출력 노드(OUT1)와 제3 출력 노드(OUT3)를 연결하는 코어스 NMOS 트랜지스터(MCN)를 포함할 수 있다. 코어스 PMOS 트랜지스터(MCP)는 제1 출력 노드(OUT1)의 전압 레벨을 레귤레이션하기 위한 차지 전류의 크기를 조절 할 수 있다. 예를 들어, 코어스 PMOS 트랜지스터(MCP)는 32개의 PMOS 트랜지스터들을 포함할 수 있다. 코어스 PMOS 트랜지스터(MCP)는 32개의 PMOS 트랜지스터들의 턴-온 또는 턴-오프에 기반하여 제1 출력 노드(OUT1)로 입 력되는 션트 전류(ISHUNT)의 크기를 제어할 수 있다. 예를 들어, 32개의 PMOS 트랜지스터들 중 턴-온된 트랜지스 터들의 개수가 많을수록 제1 출력 노드(OUT1)로 입력되는 차지 전류가 증가하고, 이에 따라 션트 전류(ISHUNT)의 크기가 증가할 수 있다. 코어스 NMOS 트랜지스터(MCN)는 제1 출력 노드(OUT1)의 전압 레벨을 레귤레이션하기 위한 디스차지 전류의 크기 를 조절할 수 있다. 예를 들어, 코어스 NMOS 트랜지스터(MCN)는 32개의 NMOS 트랜지스터들을 포함할 수 있다. 코 어스 NMOS 트랜지스터(MCN)는 32개의 NMOS 트랜지스터들의 턴-온 또는 턴-오프에 기반하여 제1 출력 노드(OUT1) 로 입력되는 션트 전류(ISHUNT)의 크기를 제어할 수 있다. 예를 들어, 32개의 NMOS 트랜지스터들 중 턴-온된 트랜 지스터들의 개수가 많을수록 제1 출력 노드(OUT1)로부터 제3 출력 노드(OUT3)로 방전되는 디스차지 전류가 증가 하고, 이에 따라 션트 전류(ISHUNT)의 크기가 감소할 수 있다. 파인 레귤레이터는 제2 출력 노드(OUT2)와 제1 출력 노드(OUT1)를 연결하는 파인 PMOS 트랜지스터(MFP)를 포함할 수 있다. 파인 PMOS 트랜지스터(MFP)는 제1 출력 노드(OUT1)의 전압 레벨을 레귤레이션하기 위한 차지 전 류의 크기를 조절할 수 있다. 예를 들어, 파인 PMOS 트랜지스터(MFP)는 128개의 PMOS 트랜지스터들을 포함할 수 있다. 파인 PMOS 트랜지스터(MFP)는 128개의 PMOS 트랜지스터들의 턴-온 또는 턴-오프에 기반하여 제1 출력 노드 (OUT1)로 입력되는 션트 전류(ISHUNT)의 크기를 제어할 수 있다. 예를 들어, 128개의 PMOS 트랜지스터들 중 턴-온 된 트랜지스터들의 개수가 많을수록 제1 출력 노드(OUT1)로 입력되는 차지 전류가 증가하고, 이에 따라 션트 전 류(ISHUNT)의 크기가 증가할 수 있다. 파인 PMOS 트랜지스터(MFP)는 코어스 PMOS 트랜지스터(MCP)보다 더 많은 트 랜지스터들을 포함하기 때문에, 상기 차지 전류의 조절을 더욱 미세하게 수행할 수 있다. 전술한 실시예에서 코어스 PMOS 트랜지스터(MCP) 및 코어스 NMOS 트랜지스터(MCN)는 각각 128개의 파워 MOSFET들 을 포함하고, 파인 PMOS 트랜지스터(MFP)는 32개의 파워 MOSFET들을 포함하는 것으로 도시하였으나, 이에 제한되 는 것은 아니다. 다양한 실시예들에 따라, 코어스 PMOS 트랜지스터(MCP), 코어스 NMOS 트랜지스터(MCN) 및 파인 PMOS 트랜지스터(MFP)에 포함되는 파워 MOSFET들의 개수는 가변적으로 설정될 수 있다. 도 5a는 본 개시의 예시적 실시예에 따른 푸시-풀 컨트롤러를 포함하는 하이브리드 벅 컨버터의 회로 도이다. 도 5a를 참조하면, 하이브리드 벅 컨버터는 도 4의 하이브리드 벅 컨버터에 추가적으로 푸시-풀 컨트 롤러를 더 포함할 수 있다. 실시예에 따라, 푸시-풀 컨트롤러는 션트 레귤레이터의 턴-온 또는 턴-오프를 제어할 수 있다. 푸시- 풀 컨트롤러는 션트 컨트롤러, 과도 컨트롤러(transient controller) 등의 다양한 용어로 지칭될 수 있다. 푸시-풀 컨트롤러는 제1 출력 노드(OUT1)의 전압인 제1 출력 전압(VOUT1)을 수신할 수 있다. 푸시-풀 컨트롤 러는 PMIC의 파워미터로부터 상기 제1 출력 전압(VOUT1)의 전압 값을 수신할 수 있다. 푸시-풀 컨트롤러는 제1 기준 전압(VREF1)을 수신할 수 있다. 푸시-풀 컨트롤러는 PMIC의 제어 회로(22 0)로부터 상기 제1 기준 전압(VREF1)을 수신할 수 있다. 상기 제1 기준 전압(VREF1)은 제어 회로에 의해 가변 될 수 있다. 예를 들어, 제어 회로가 동적 전압 스케일링(dynamic voltage scaling)을 수행할 것을 결정할 수 있다. 제어 회로는 제1 기준 전압(VREF1)의 값을 높이거나, 낮춤으로써 제1 출력 노드(OUT1)의 제1 출력 전압(VOUT1)을 변경하고, 이에 따라 로드 전류(ILOAD)를 변경할 수 있다. 실시예에 따라, 푸시-풀 컨트롤러는 코어스 레귤레이터의 제어 신호(PG_32 또는 NG_32)를 생성하지 않을 수 있다. 예를 들어, 하이브리드 벅 컨버터는 정상 상태(steady state)일 수 있다. 정상 상태는, 제1 출력 전압(VOUT1)이 제1 기준 전압(VREF1)에 거의 근접하여 제1 출력 노드(OUT1) 및 로드 전류(ILOAD)의 변화가 크지 않고 안정적인 상태를 지칭할 수 있다. 하이브리드 벅 컨버터가 정상 상태인 경우, 코어스 레귤레이터 를 구동하여 급격하게 션트 전류(ISHUNT)를 급격하게 감소시키거나 증가시킬 필요가 없으므로, 푸시-풀 컨트 롤러는 코어스 레귤레이터를 구동하기 위한 제어 신호(PG_32 또는 NG_32)를 생성하지 않을 수 있다. 다만, 상기 정상 상태에 있더라도, 하이브리드 벅 컨버터는 제1 출력 전압(VOUT1)이 제1 기준 전압(VREF1)을 성공적으로 추적하기 위하여 파인 레귤레이터의 제어 신호(PG_128)는 생성할 수 있다. 실시예에 따라, 푸시-풀 컨트롤러는 코어스 레귤레이터의 제어 신호(PG_32 또는 NG_32) 및 파인 레귤 레이터의 제어 신호(PG_128)를 모두 생성할 수 있다. 예를 들어, 하이브리드 벅 컨버터는 과도 상태 (transient state)일 수 있다. 과도 상태는, 제1 출력 전압(VOUT1)이 제1 기준 전압(VREF1)으로부터 이격된 상태 를 지칭할 수 있다. 즉, 상기 과도 상태는, 제1 출력 전압(VOUT1)과 제1 기준 전압(VREF1)의 차이가 크거나 증가하 는 경우에 상응할 수 있다. 예를 들어, 제어 회로가 동적 전압 스케일링을 결정하여 제1 기준 전압(VREF1) 을 변경할 수 있다. 이 경우, 제1 출력 전압(VOUT1) 및 로드 전류(ILOAD)가 빠르게 정상 상태에 진입할 수 있도록 션트 전류(ISHUNT)의 변경이 필요할 수 있다. 푸시-풀 컨트롤러는 제1 기준 전압(VREF1)과 제1 출력 전압 (VOUT1)을 비교하고, 비교 결과에 기반하여 코어스 레귤레이터를 구동하기 위한 제어 신호(PG_32 또는 NG_32)를 생성할 수 있다. 다만, 이 경우에도 파인 레귤레이터를 위한 제어 신호(PG_128)가 생성되지 않는 것이 아니며, 코어스 레귤레이터를 위한 제어 신호(PG_32 또는 NG_32)와 함께 생성될 수 있다. 예를 들어, 제어 회로에 의해 제1 기준 전압(VREF1)이 높아질 수 있다. 푸시-풀 컨트롤러는 제1 기준 전압(VREF1)에 따라 제1 출력 전압(VOUT1)을 승압시키기 위하여 션트 전류(ISHUNT)의 크기를 증가시킬 수 있다. 이를 위해, 푸시- 풀 컨트롤러는 코어스 PMOS 트랜지스터(MCP)에 포함되는 128개의 PMOS 트랜지스터들 중 턴-온되는 PMOS 트 랜지스터들의 개수를 증가시킬 수 있다. 다른 예를 들어, 제어 회로에 의해 제1 기준 전압(VREF1)이 낮아질 수 있다. 푸시-풀 컨트롤러는 제1 기준 전압(VREF1)에 따라 제1 출력 전압(VOUT1)을 강압시키기 위하여 션트 전류(ISHUNT)의 크기를 감소시킬 수 있다. 이를 위해, 푸시-풀 컨트롤러는 코어스 NMOS 트랜지스터(MCN)에 포함되는 128개의 NMOS 트랜지스터들 중 턴-온되는 NMOS 트랜지스터들의 개수를 증가시킬 수 있다. 도 5b는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 동작방법을 나타내는 순서도이다. 도 5b를 참조하면, 동작 S510에서, 하이브리드 벅 컨버터는 제1 출력 전압(VOUT1) 값을 수신할 수 있다. 하 이브리드 벅 컨버터의 푸시-풀 컨트롤러는 제1 출력 전압(VOUT1) 및 제1 기준 전압(VREF1)을 비교할 수 있다. 동작 S520에서, 하이브리드 벅 컨버터는 제1 출력 전압(VOUT1)이 정상 상태인지 판단할 수 있다. 예를 들어, 하이브리드 벅 컨버터의 푸시-풀 컨트롤러는 제1 출력 전압(VOUT1)과 제1 기준 전압(VREF1)의 차 이가 임계 값 이하인 경우, 정상 상태로 판단할 수 있다. 다른 예를 들어, 예를 들어, 하이브리드 벅 컨버터 의 푸시-풀 컨트롤러는 제어 회로로부터 동적 전압 스케일링에 기반한 제1 기준 전압(VREF1)의 변경을 위한 제어 신호를 수신하는 것에 응답하여, 정상 상태가 아닌 과도 상태로 판단할 수 있다. 동작 S530에서, 하이브리드 벅 컨버터는 파인 레귤레이터 및 코어스 레귤레이터를 함께 조정하 여 션트 전류(ISHUNT)를 제어할 수 있다. 동작 S520에서 푸시-풀 컨트롤러는 하이브리드 벅 컨버터가 현재 과도 상태임을 판단할 수 있다. 푸시-풀 컨트롤러는 제1 출력 전압(VOUT1)을 최대한 빠르게 제1 기준 전압(VREF1)에 수렴하도록 션트 전류(ISHUNT)를 증가 또는 감소시킬 수 있다. 예를 들어, 제1 출력 전압(VOUT1)이 제 1 기준 전압(VREF1)보다 큰 경우, 제1 출력 전압(VOUT1)을 낮추기 위하여 코어스 NMOS 트랜지스터(MCN)를 구동하기 위한 제어 신호(NG_32)를 생성할 수 있다. 다른 예를 들어, 제1 출력 전압(VOUT1)이 제1 기준 전압(VREF1)보다 작 은 경우, 제1 출력 전압(VOUT1)을 높이기 위하여 코어스 PMOS 트랜지스터(MPN)를 구동하기 위한 제어 신호(PG_32) 및 파인 PMOS 트랜지스터(MFP)를 구동하기 위한 제어 신호(PG_128)를 생성할 수 있다. 동작 S540에서, 하이브리드 벅 컨버터는 파인 레귤레이터만 조정하여 션트 전류(ISHUNT)를 제어할 수 있다. 동작 S520에서 푸시-풀 컨트롤러는 하이브리드 벅 컨버터가 현재 정상 상태임을 판단할 수 있다. 푸시-풀 컨트롤러는 제1 출력 전압(VOUT1)이 이미 정상 상태이므로 션트 전류(ISHUNT)를 급격하게 증가 또는 감소시킬 필요가 없다. 따라서, 푸시-풀 컨트롤러는 파인 PMOS 트랜지스터(MFP)를 구동하기 위한 제어 신호(PG_128)만 생성하여 션트 전류(ISHUNT)를 제어함으로써 제1 출력 전압(VOUT1)가 제1 기준 전압(VREF1)을 성공 적으로 추적할 수 있다. 도 6a는 본 개시의 예시적 실시예에 따른 제1 PWM 컨트롤러를 포함하는 하이브리드 벅 컨버터의 회로 도이다. 도 6a를 참조하면, 하이브리드 벅 컨버터는 도 4의 하이브리드 벅 컨버터에 추가적으로 GM 셀, 보상 네트워크, 비교기 및 제1 PWM 컨트롤러를 더 포함할 수 있다. 실시예에 따라, GM 셀은 연산 증폭기에 상응할 수 있다. GM 셀은 전압의 차동 입력을 수신하여 제1 레귤레이션 전압(VC1)을 출력할 수 있다. 제1 PWM 컨트롤러는 제1 레귤레이션 전압(VC1)에 기반하여 듀티 사이클을 제어할 수 있다. 상기 차동 입력 중 하나는, 션트 전압(VSHUNT)에 상응할 수 있다. 상기 션트 전압 (VSHUNT)은 션트 전류(ISHUNT)를 센싱하여 전압으로 변환한 값일 수 있다. 상기 차동 입력 중 다른 하나는 인덕터 전압(VIND)에 상응할 수 있다. 상기 인덕터 전압(VIND)은 인덕터 전류(IIND)를 센싱하여 전압으로 변환한 값일 수 있다. 실시예에 따라, 인덕터 전류(IIND)를 전압으로 변환하는 비율과 션트 전류(ISHUNT)를 전압으로 변환하는 비 율은 상이할 수 있다. 일 실시예에 따라, 인덕터 전류(IIND)는 1:1의 비율에 기반하여 인덕터 전압(VIND)으로 변 환될 수 있다. 션트 전류(ISHUNT)는 1: 의 비율에 기반하여 션트 전압(VSHUNT)으로 변환될 수 있다. 즉, 인덕터 전 류(IIND)와 션트 전류(ISHUNT)은 아래의 수학식을 만족하도록 레귤레이션될 수 있다. 수학식 1"}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하이브리드 벅 컨버터는 인덕터 전류(IIND)의 크기가 션트 전류(ISHUNT)의 크기의 배가 되도록 레귤레이션하 여 션트 레귤레이터에서 발생하는 전력 소모의 크기를 감소시킬 수 있다. 션트 레귤레이터에서 발생 하는 전력 소모(power loss, PL)는 하기의 수학식과 같다. 수학식 2"}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "즉, 하이브리드 벅 컨버터는 로드 전류(ILOAD)의 대부분(예: )을 인덕터 전류(IIND)에서 처리하고, 션트 전류(ISHUNT)는 로드 전류(ILOAD)의 작은 부분(small portion)(예: )만 할당하여 션트 전류(ISHUNT)의 크기를 감 소시킴으로써 전력 소모를 줄일 수 있다. 예를 들어, 상기 의 값은 100일 수 있으나, 이에 제한되는 것은 아니 다. 동작 환경에 따라, 상기 의 값은 100보다 작을 수도 있고, 100보다 크게 설정될 수 있다. 상기 의 값은 전자 장치의 사용자의 설정에 따라 가변될 수도 있다. 실시예에 따라, 보상 네트워크는 제1 레귤레이션 출력(VC1)의 교류 성분의 응답 속도를 결정할 수 있다. 보 상 네트워크는 제1 보상 커패시터(CP1), 제2 보상 커패시터(CP2), 및 제1 보상 저항(RP1)을 포함할 수 있다. 비교기는 입력 신호를 비교하여 비교 결과를 나타내는 출력 신호를 생성할 수 있다. 비교기는 차동 입력을 수신할 수 있다. 상기 차동 입력 중 하나는, 교류 파형(waveform)일 수 있다. 예를 들어, 상기 교류 파 형은 톱니파(sawtooth waveform)일 수 있으나, 이에 제한되는 것은 아니다. 다양한 실시예들에 따라, 상기 교류파형은, 삼각파(triangle waveform), 사각파(square waveform) 등을 더 포함할 수 있다. 실시예에 따라, 비교 기는 제1 레귤레이션 전압(VC1)과 상기 교류 파형의 전압(VSAW1) 크기를 비교하여 비교 결과를 제1 PWM 컨트 롤러에게 제공할 수 있다. 실시예에 따라, 제1 PWM 컨트롤러는 제1 PMOS 트랜지스터(MP1) 및 제1 NMOS 트랜지스터(MN1) 간에 듀티 사 이클을 제어할 수 있다. 예를 들어, 제1 PWM 컨트롤러는 인덕터 전류(IIND)가 션트 전류(ISHUNT)의 배보다 작은 경우, 제1 PMOS 트랜지스터(MP1)의 턴-온 시간을 증가시킬 수 있다. 즉, 제1 PWM 컨트롤러는 인덕터 전류(IIND)의 크기를 증가시키기 위하여 제1 NMOS 트랜지스터(MN1) 및 제1 PMOS 트랜지스터(MP1)가 교번적으로 턴 -온되는 하나의 주기 내에서 제1 PMOS 트랜지스터(MP1)가 턴-온되는 시간을 증가시킬 수 있다. 다른 예를 들어, 제1 PWM 컨트롤러는 인덕터 전류(IIND)가 션트 전류(ISHUNT)의 배보다 큰 경우, 제1 PMOS 트랜지스터(MP1)의 턴-온 시간을 감소시킬 수 있다. 즉, 제1 PWM 컨트롤러는 인덕터 전류(IIND)의 크기를 감소시키기 위하여 제1 NMOS 트랜지스터(MN1) 및 제1 PMOS 트랜지스터(MP1)가 교번적으로 턴-온되는 하나의 주기 내에서 제1 PMOS 트랜지스터(MP1)가 턴-온되는 시간을 감소시킬 수 있다. 도 6b는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 동작방법을 나타내는 순서도이다. 도 6b를 참조하면, 동작 S610에서, 하이브리드 벅 컨버터는 션트 전류(ISHUNT), 인덕터 전류(IIND)를 센싱하 여 션트 전압(VSHUNT) 및 인덕터 전압(VIND)을 생성할 수 있다. 예를 들어, 하이브리드 벅 컨버터는 제1 전류 -전압 컨버터 및 제2 전류-전압 컨버터를 더 포함할 수 있다. 제1 전류-전압 컨버터는 인덕터 전류(IIND)를 인덕 터 전압(VIND)으로 변환할 수 있다. 이 때, 제1 전류-전압 컨버터의 변환 비율은 1:1일 수 있다. 제2 전류-전압 컨버터는 션트 전류(ISHUNT)를 션트 전압(VSHUNT)으로 변환할 수 있다. 이 때, 제2 전류-전압 컨버터의 변환 비율은 1: 일 수 있다. 즉, 제2 전류-전압 컨버터는 션트 전류(ISHUNT)를 배하여 션트 전압(VSHUNT)을 생성할 수 있다. 동작 S620에서, 하이브리드 벅 컨버터는 션트 전압(VSHUNT) 및 인덕터 전압(VIND)에 기반하여 제1 레귤레이션 전압(VC1)을 생성할 수 있다. 예를 들어, 하이브리드 벅 컨버터의 GM 셀은 동작 S610에서 획득된 션 트 전압(VSHUNT) 및 인덕터 전압(VIND)을 각각 입력으로 수신하여 상기 제1 레귤레이션 전압(VC1)을 출력할 수 있다. 동작 S630에서, 하이브리드 벅 컨버터는 제1 레귤레이션 전압(VC1)과 교류 파형의 전압(VSAW1)의 비교에 기 반하여, 제1 PMOS 트랜지스터(MP1) 및 제1 NMOS 트랜지스터(MN1)의 펄스폭 비율을 제어할 수 있다. 예를 들어, 제1 PWM 컨트롤러는 제1 레귤레이션 전압(VC1)이 교류 파형의 전압(VSAW1)의 중간 값을 초과하는 경우(예: 인덕터 전류(IIND)가 션트 전류(ISHUNT)의 배보다 큰 경우), 제1 PWM 컨트롤러는 제1 PMOS 트랜지스터(MP1) 의 턴-온 시간이 감소되도록 펄스폭 비율을 제어할 수 있다. 다른 예를 들어, 제1 PWM 컨트롤러는 제1 레 귤레이션 전압(VC1)이 교류 파형의 전압(VSAW1)의 중간 값 미만인 경우(예: 인덕터 전류(IIND)가 션트 전류(ISHUNT) 의 배보다 작은 경우), 제1 PWM 컨트롤러는 제1 PMOS 트랜지스터(MP1)의 턴-온 시간이 증가되도록 펄스폭 비율을 제어할 수 있다. 도 7a는 본 개시의 예시적 실시예에 따른 제2 PWM 컨트롤러를 포함하는 하이브리드 벅 컨버터의 회로 도이다. 도 7a를 참조하면, 하이브리드 벅 컨버터는 도 4의 하이브리드 벅 컨버터에 추가적으로 GM 셀, 보상 네트워크, 비교기 및 제2 PWM 컨트롤러를 더 포함할 수 있다. 실시예에 따라, GM 셀은 연산 증폭기에 상응할 수 있다. GM 셀은 전압의 차동 입력을 수신하여 제2 레귤레이션 전압(VC2)을 출력할 수 있다. 제2 PWM 컨트롤러는 제2 레귤레이션 전압(VC2)에 기반하여 제3 PMOS 트랜지스터(MP3) 및 제3 NMOS 트랜지스터(MN3)의 듀티 사이클을 제어할 수 있다. 상기 차동 입력 중하나는, 제2 출력 전압(VOUT2)에 상응할 수 있다. 상기 제2 출력 전압(VOUT2)은 제2 출력 노드(OUT2)의 전압을 센 싱한 값일 수 있다. 상기 차동 입력 중 다른 하나는 제2 기준 전압(VREF2)일 수 있다. 제2 기준 전압(VREF2)은 제2 출력 전압(VOUT2)의 전압 레벨을 제어하기 위한 기준이 되는 전압일 수 있다. 상기 제2 기준 전압(VREF2)은 제어 회로에 의해 가변될 수 있다. 예를 들어, 제어 회로는 동적 전압 스케일링의 빈도에 기반하여 제2 기 준 전압(VREF2)을 전원 전압(VDD)에 가깝게 설정하거나, 또는 제1 출력 전압(VOUT1)에 가깝게 설정할 수 있다. 제2 기준 전압(VREF2)에 관한 구체적인 설명은 도 7d에서 후술하기로 한다. 실시예에 따라, 보상 네트워크는 제2 레귤레이션 출력(VC2)의 교류 성분의 응답 속도를 결정할 수 있다. 보 상 네트워크는 제3 보상 커패시터(CP3)를 포함할 수 있다. 비교기는 입력 신호를 비교하여 비교 결과를 나타내는 출력 신호를 생성할 수 있다. 비교기는 차동 입력을 수신할 수 있다. 상기 차동 입력 중 하나는, 교류 파형(waveform)일 수 있다. 예를 들어, 상기 교류 파 형은 톱니파일 수 있으나, 이에 제한되는 것은 아니다. 다양한 실시예들에 따라, 상기 교류 파형은, 삼각파 (triangle waveform), 사각파(square waveform) 등을 더 포함할 수 있다. 실시예에 따라, 비교기는 제2 레귤레이션 전압(VC2)과 상기 교류 파형의 전압(VSAW2) 크기를 비교하여 비교 결과를 제2 PWM 컨트롤러에게 제공할 수 있다. 실시예에 따라, 제2 PWM 컨트롤러는 제3 PMOS 트랜지스터(MP3) 및 제3 NMOS 트랜지스터(MN3) 간에 듀티 사 이클을 제어할 수 있다. 예를 들어, 제2 PWM 컨트롤러는 제2 레귤레이션 전압(VC2)가 교류 파형의 전압 (VSAW2)보다 작은 경우, 제3 PMOS 트랜지스터(MP3)이 턴-온되는 시간을 증가시킬 수 있다. 즉, 제2 PWM 컨트롤러 는 제2 출력 전압(VOUT2)의 전압 레벨을 높이기 위하여 제3 NMOS 트랜지스터(MN3) 및 제3 PMOS 트랜지스터 (MP3)가 교번적으로 턴-온되는 하나의 주기 내에서 제3 PMOS 트랜지스터(MP3)가 턴-온되는 시간을 증가시킬 수 있다. 다른 예를 들어, 제2 PWM 컨트롤러는 제2 레귤레이션 전압(VC2)가 교류 파형의 전압(VSAW2)보다 큰 경 우, 제3 PMOS 트랜지스터(MP3)이 턴-온되는 시간을 감소시킬 수 있다. 즉, 제2 PWM 컨트롤러는 제2 출력 전압(VOUT2)의 전압 레벨을 낮추기 위하여 제3 NMOS 트랜지스터(MN3) 및 제3 PMOS 트랜지스터(MP3)가 교번적으로 턴-온되는 하나의 주기 내에서 제3 PMOS 트랜지스터(MP3)가 턴-온되는 시간을 감소시킬 수 있다. 도 7b는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 동작방법을 나타내는 순서도이다. 도 7b를 참조하면, 동작 S710에서, 하이브리드 벅 컨버터는 제2 출력 전압(VOUT2)의 전압 레벨을 수신할 수 있다. 예를 들어, GM 셀은 차동 입력 중 하나의 입력으로서 제2 출력 노드(OUT2)의 제2 출력 전압(VOUT2)의 센싱 값을 수신할 수 있다. 동작 S720에서, 하이브리드 벅 컨버터는 제2 출력 전압(VOUT2) 및 제2 기준 전압(VREF2)에 기반하여 제2 레귤 레이션 전압(VC2)을 생성할 수 있다. 예를 들어, 하이브리드 벅 컨버터의 GM 셀은 동작 S610에서 수 신한 제2 출력 전압(VOUT2)과 제2 기준 전압(VREF2)에 기반하여 제2 레귤레이션 전압(VC2)을 출력할 수 있다. 상기 제2 기준 전압(VREF2)은 제2 출력 전압(VOUT2)의 전압 레벨을 전원 전압(VDD)에 근사하게 설정할 것인지 또는 제1 출력 노드(VOUT1)에 근사하게 설정할 것인지 제어하기 위한 기준 전압일 수 있다. 동작 S730에서, 하이브리드 벅 컨버터는 제2 레귤레이션 전압(VC2)과 교류 파형의 전압(VSAW2)의 비교에 기 반하여, 제3 PMOS 트랜지스터(MP3) 및 제3 NMOS 트랜지스터(MN3)의 펄스폭 비율을 제어할 수 있다. 예를 들어, 제1 PWM 컨트롤러는 제2 레귤레이션 전압(VC2)이 교류 파형의 전압(VSAW2)보다 큰 경우, 제2 PWM 컨트롤러 는 제3 PMOS 트랜지스터(MP3)의 턴-온 시간이 감소되도록 펄스폭 비율을 제어할 수 있다. 이에 따라, 제2 레귤레이션 전압(VC2)가 점차 감소되어 교류 파형의 전압(VSAW2)의 중간 값에 수렴할 수 있다. 다른 예를 들어, 제2 PWM 컨트롤러는 제2 레귤레이션 전압(VC2)이 교류 파형의 전압(VSAW2)보다 작은 경우, 제2 PWM 컨트롤러 는 제3 PMOS 트랜지스터(MP3)의 턴-온 시간이 증가되도록 펄스폭 비율을 제어할 수 있다. 이에 따라, 제2레귤레이션 전압(VC2)가 점차 증가되어 교류 파형의 전압(VSAW2)의 중간 값에 수렴할 수 있다. 도 7c는 본 개시의 예시적 실시예에 따른 전력 소모의 감소의 일 예를 도시한다. 도 7c를 참조하면, 제2 출력 노드(OUT2)의 전압 레벨이 도시된다. 도 3의 비교예에 따른 션트 레귤레이터는 전 원 전압(VDD)에 기반하여 구동된다. 따라서, 비교예에 따른 하이브리드 벅 컨버터의 전력 소모를 나타내면 아래와 같다. 수학식 3"}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "본 개시의 예시적 실시예들에 따라 레귤레이션되는 제2 출력 노드(OUT2)에 기반하여 션트 레귤레이터를 구 동하는 경우, 션트 레귤레이터의 구동 전압은 전원 전압(VDD)에서 제2 출력 전압(VOUT2)로 감소될 수 있다. 따라서, 본 개시의 예시적 실시예들에 따른 하이브리드 벅 컨버터의 전력 소모를 나타내면 아래와 같다. 수학식 4"}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, 제2 출력 전압(VOUT2)은 전원 전압(VDD) 미만이므로, 전압 강하의 크기가 감소되며 이에 따라 전력 소모 의 크기 또한 감소되는 것을 알 수 있다. 즉, 하이브리드 벅 컨버터는, 션트 레귤레이터의 구동하기 위한 전압을 전원 전압(VDD)에서 제2 출력 전압(VOUT2)로 변경함으로써 전력 소모를 감소시킬 수 있다. 도 7d는 본 개시의 예시적 실시예에 따른 제2 기준 전압(VREF2)이 가변되는 예를 도시한다. 도 7d를 참조하면, 제2 기준 전압(VREF2)은 동적 전압 스케일링의 빈도에 기반하여 V1) 내지 제3 전압(V3) 중 어 느 하나의 값으로 가변될 수 있다. 실시예에 따라, 제1 시점(T1)에서 PMIC의 제어 회로는 제1 제어 신호를 생성할 수 있다. 상기 제1 제어 신호는 제2 기준 전압(VREF2)의 크기를 제1 전압(V1)로 설정할 것을 지시 하는 신호일 수 있다. 제어 회로는 일정 기간 동안 동적 전압 스케일링의 발생 횟수를 트래킹할 수 있다. 제어 회로는 동적 전압 스케일링이 적정 횟수만큼 발생하는 경우에 상기 제1 제어 신호를 생성할 수 있다. 예를 들어, 일정 기간 동안 동적 전압 스케일링이 발생한 횟수가 제1 값보다 크고 제2 값보다 작은 경우, 제어 회로는 상기 제1 제어 신호를 생성할 수 있다. 상기 제2 값은 상기 제1 값보다 클 수 있다. 실시예에 따라, 제2 시점(T2)에서 PMIC의 제어 회로는 제2 제어 신호를 생성할 수 있다. 상기 제2 제 어 신호는 제2 기준 전압(VREF2)의 크기를 제2 전압(V2)로 설정할 것을 지시하는 신호일 수 있다. 제2 전압(V2)의 크기는, 제1 전압(V1)의 크기보다 클 수 있다. 즉, 제2 제어 신호는, 제2 출력 노드(OUT2)의 제2 출력 전압 (VOUT2)의 크기를 높게 설정하기 위한 신호일 수 있다. 제어 회로는 제1 시점(T1) 이후 동적 전압 스케일링 이 매우 자주 발생하는 것을 식별할 수 있다. 예를 들어, 일정 기간 동안 동적 전압 스케일링이 발생한 횟수가 상기 제2 값을 초과하는 경우, 제어 회로는 상기 제2 제어 신호를 생성하여 제2 출력 전압(VOUT2)의 전압 레벨을 전원 전압(VDD)에 가깝게 변경할 수 있다. 동적 전압 스케일링이 자주 발생하는 경우, 션트 레귤레이션 가 구동되는 횟수 역시 증가할 수 있다. 제2 출력 전압(VOUT2)가 낮게 설정(예: 제1 출력 전압(VOUT1)과 유사 한 값)되는 경우, 동적 전압 스케일링이 발생한 시점에 제2 출력 전압(VOUT2)이 션트 레귤레이션을 구동할 만큼 높지 않아 제1 출력 전압(VOUT1) 및 로드 전류(ILOAD)의 과도 상태가 오래 유지되는 단점이 발생할 수 있다. 이를 방지하기 위하여, 제어 회로는 동적 전압 스케일링이 자주 발생하는 환경에서는 션트 레귤레이터 를 항상 구동될 수 있도록 제2 출력 전압(VOUT2)을 높게 설정할 수 있다. 실시예에 따라, 제3 시점(T3)에서 PMIC의 제어 회로는 제3 제어 신호를 생성할 수 있다. 상기 제3 제 어 신호는 제2 기준 전압(VREF2)의 크기를 제3 전압(V3)로 설정할 것을 지시하는 신호일 수 있다. 제3 전압(V3)의 크기는, 제1 전압(V1) 및 제2 전압(V2)보다 작을 수 있다. 즉, 제3 제어 신호는, 제2 출력 노드(OUT2)의 제2 출 력 전압(VOUT2)의 전압 레벨을 낮게 설정(예: 제1 출력 전압(VOUT1)에 매우 근사)하기 위한 신호일 수 있다. 제어 회로는 제2 시점(T2) 이후 동적 전압 스케일링이 거의 발생하지 않는 것을 식별할 수 있다. 예를 들어, 일 정 기간 동안 동적 전압 스케일링이 발생한 횟수가 상기 제1 값 미만인 경우, 제어 회로는 상기 제3 제어 신호를 생성하여 제2 출력 전압(VOUT2)의 전압 레벨을 제1 출력 전압(VOUT1)에 근사하도록 변경할 수 있다. 동적 전압 스케일링이 드물게(rarely) 발생하는 경우, 션트 레귤레이션가 구동되는 횟수 역시 감소할 수 있다. 제2 출력 전압(VOUT2)가 높게 설정(예: 전원 전압(VDD)과 유사한 값)되는 경우, 션트 레귤레이터에서 발생하 는 전력 소모의 크기가 증가할 수 있다. 따라서, 션트 레귤레이터에서 발생하는 전력 소모를 감소시켜 전 력 효율을 증가시키기 위하여 제어 회로는 동적 전압 스케일링이 거의 발생하지 않는 환경에서는 제2 출력 전압(VOUT2)을 낮게 설정할 수 있다. 도 8a는 본 개시의 예시적 실시예에 따른 히스테리시스 컨트롤러를 포함하는 하이브리드 벅 컨버터의 회로도이고, 도 8b는 본 개시의 예시적 실시예에 따른 제3 기준 전압(VREF3)의 일 예이다. 도 8a를 참조하면, 하이브리드 벅 컨버터는 도 4의 하이브리드 벅 컨버터에 추가적으로 히스테리시스 (hysteresis) 컨트롤러를 더 포함할 수 있다. 실시예에 따라, 히스테리시스 컨트롤러는 제4 NMOS 트랜지스터(MN4)의 턴-온 또는 턴-오프를 제어할 수 있 다. 예를 들어, 히스테리시스 컨트롤러는 제3 기준 전압(VREF3) 및 제3 출력 전압(VOUT3)를 각각 수신할 수 있다. 히스테리시스 컨트롤러는 제3 출력 전압(VOUT3)이 제3 기준 전압(VREF3)으로부터 일정 범위를 벗어나는 것에 응답하여, 제4 NMOS 트랜지스터(MN4)를 턴-온하거나, 턴-오프할 수 있다. 도 8b를 함께 참조하면, 제4 NMOS 트랜지스터(MN4)는 제3 출력 전압(VOUT3)이 제3 기준 전압(VREF3)에 윈도우 전압 (VWINDOW)을 합산한 값을 초과하는 경우, 턴-온될 수 있다. 제3 기준 전압(VREF3)에 윈도우 전압(VWINDOW)을 합산한 값을 초과할 만큼 제3 출력 커패시터(COUT3)가 충전되었으므로, 히스테리시스 컨트롤러는 제4 NMOS 트랜지 스터(MN4)를 턴-온하여 제3 출력 커패시터(COUT3)에 저장된 전하를 이용하여 인덕터 전류(IIND)를 생성할 수 있다. 히스테리시스 컨트롤러는 제4 NMOS 트랜지스터(MN4)를 턴-온하는 동시에, 제1 NMOS 트랜지스터(MN1)를 턴- 오프할 수 있다. 즉, 제4 NMOS 트랜지스터(MN4) 및 제1 NMOS 트랜지스터(MN1)은 서로 교번적으로 턴-온될 수 있 다. 도 8b를 함께 참조하면, 제4 NMOS 트랜지스터(MN4)는 제3 출력 전압(VOUT3)이 제3 기준 전압(VREF3)에서 윈도우 전 압(VWINDOW)을 차감한 값보다 미만인 경우, 턴-오프될 수 있다. 제3 기준 전압(VREF3)에서 윈도우 전압(VWINDOW)을 차 감한 값보다 미만으로 제3 출력 전압(VOUT3)이 감소하는 경우, 제3 출력 커패시터(COUT3)에 저장되었던 전하를 대 부분 사용하였을 수 있다. 히스테리시스 컨트롤러는 제4 NMOS 트랜지스터(MN4)를 턴-오프하여 제3 출력 노 드(OUT3)와 제1 스위칭 노드(LX1)를 전기적으로 분리할 수 있다. 히스테리시스 컨트롤러는 제4 NMOS 트랜지 스터(MN4)를 턴-오프하는 동시에, 제1 NMOS 트랜지스터(MN1)를 턴-온할 수 있다. 이후, 제1 출력 노드(OUT1)에서 코어스 NMOS 트랜지스터(MCN)를 통해 디스차지되는 전류를 이용하여 제3 출력 커패시터(COUT3)가 충전될 수 있고, 제3 출력 전압(VOUT3)이 제3 기준 전압(VREF3)에 윈도우 전압(VWINDOW)을 합산한 값을 초과하는 경우, 제4 NMOS 트랜 지스터(MN4)는 다시 턴-온될 수 있을 것이다. 다양한 실시예들에 따라, 히스테리시스 컨트롤러는 제4 NMOS 트랜지스터(MN4)의 턴-온 또는 턴-오프 제어 히스토리에 기반하여 제3 출력 커패시터(COUT3)에 저장된 전하를 재사용하기 위한 최적의 윈도우 전압(VWINDOW)을 가변적으로 설정할 수도 있을 것이다. 도 8c는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 동작방법을 나타내는 순서도이다. 도 8c를 참조하면, 동작 S810에서, 하이브리드 벅 컨버터는 제3 출력 전압(VOUT3)의 전압 레벨을 수신할 수 있다. 예를 들어, 히스테리시스 컨트롤러는 하나의 입력으로서 제3 출력 노드(OUT3)의 제3 출력 전압(VOUT 3)의 센싱 값을 수신할 수 있다. 동작 S820에서, 하이브리드 벅 컨버터는 제3 출력 전압(VOUT3) 및 제3 기준 전압(VREF3)과 윈도우 전압 (VWINDOW)에 기반하여 제1 NMOS 트랜지스터(MN1) 및 제4 NMOS 트랜지스터(MN4)를 제어할 수 있다. 예를 들어, 히스 테리시스 컨트롤러는 제3 출력 전압(VOUT3)이 제3 기준 전압(VREF3)에 윈도우 전압(VWINDOW)을 합산한 값을 초 과하는 경우, 제4 NMOS 트랜지스터(MN4)를 턴-온하고, 제1 NMOS 트랜지스터(MN1)를 턴-오프할 수 있다. 다른 예 를 들어, 히스테리시스 컨트롤러는 제3 출력 전압(VOUT3)이 제3 기준 전압(VREF3)에서 윈도우 전압(VWINDOW)을 차감한 값보다 미만인 경우, 제4 NMOS 트랜지스터(MN4)를 턴-오프하고, 제1 NMOS 트랜지스터(MN1)를 턴-온할 수 있다. 전술한 실시예들을 참조하면, 도 5a에서 션트 레귤레이터를 제어하기 위한 푸시-풀 컨트롤러를, 도 6a에서 인덕터 전류(IIND)를 제어하기 위한 제1 PWM 컨트롤러를, 도 7a에서 제2 출력 전압(VOUT2)를 제어하 기 위한 제2 PWM 컨트롤러를, 도 8a에서 제3 출력 전압(VOUT3)를 제어하기 위한 히스테리시스 컨트롤러 를 각각 도시하였으나, 푸시-풀 컨트롤러, 제1 PWM 컨트롤러, 제2 PWM 컨트롤러, 및 히스 테리시스 컨트롤러는 별도로 동작하는 것이 아니며, 동시에(concurrently) 동작할 수 있다. 즉, 도 4의 하 이브리드 벅 컨버터는 푸시-풀 컨트롤러, 제1 PWM 컨트롤러, 제2 PWM 컨트롤러, 및 히스테 리시스 컨트롤러에 의해 동시에 및/또는 독립적으로 제어될 수 있다. 도 9는 본 개시의 일 실시예에 따른 하이브리드 벅 컨버터의 효율 개선을 나타내는 그래프이다. 도 9를 참조하면, 좌측의 제1 그래프는 제1 출력 전압(VOUT1)에 따른 효율이 얼마나 개선되는지 도시한다. 예를 들어, 비교예에 따른 하이브리드 벅 컨버터의 경우, 제1 출력 전압(VOUT1)이 1V일 때 효율은 70%인 반면, 본 개 시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 경우, 효율이 85%를 초과하는 것을 확인할 수 있다. 이러한 효율 개선은, 션트 레귤레이터를 전원 전압(VDD)에 기반하여 구동하지 않고 제1 출력 전압(VOUT1)으로부터 레귤레 이션한 제2 출력 전압(VOUT2)으로 구동함으로써 전력 소모의 원인인 전압 강하의 크기를 감소시키고, 인덕터 전류 (IIND)를 항상 션트 전류(ISHUNT)의 배로 유지하여 션트 레귤레이터에 기반하는 전류의 크기를 감소시킨 것에 기 반할 수 있다. 우측의 제2 그래프는 동적 전압 스케일링의 빈도수에 따른 효율 손실이 얼마나 개선되는지 도시한다. 예를 들어, 동적 전압 스케일링의 주파수가 10KHz일 때, 비교예에 따른 하이브리드 벅 컨버터의 경우 효율 손실은 3% 인 것을 확인할 수 있다. 반면, 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 경우, 효율 손실이 약 0.7%로 감소하는 것을 확인할 수 있다. 이러한 효율 손실의 감소는, 션트 레귤레이터를 전원 전압(VDD)에 기반하 여 구동하지 않고 제1 출력 전압(VOUT1)으로부터 레귤레이션한 제2 출력 전압(VOUT2)으로 구동함으로써 전력 소모 의 원인인 전압 강하의 크기를 감소시키고, 인덕터 전류(IIND)를 항상 션트 전류(ISHUNT)의 배로 유지하여 션트 레귤레이터에 기반하는 전류의 크기를 감소시키고, 션트 레귤레이터로부터 방전되는 디스차지 전류를 제3 커패 시터(COUT3)에 저장하였다가 인덕터 전류(IIND)를 생성하는 데에 재사용하는 것에 기반할 수 있다. 이상에서와 같이 도면과 명세서에서 예시적인 실시예들이 개시되었다. 본 명세서에서 특정한 용어를 사용하여 실시예들을 설명되었으나, 이는 단지 본 개시의 기술적 사상을 설명하기 위한 목적에서 사용된 것이지 의미 한"}
{"patent_id": "10-2023-0186295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "정이나 특허청구범위에 기재된 본 개시의 범위를 제한하기 위하여 사용된 것은 아니다. 그러므로 본 기술분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라 서, 본 개시의 진정한 기술적 보호범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다.도면 도면1 도면2 도면3a 도면3b 도면4 도면5a 도면5b 도면6a 도면6b 도면7a 도면7b 도면7c 도면7d 도면8a 도면8b 도면8c 도면9"}
{"patent_id": "10-2023-0186295", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 예시적 실시예에 따른 전자 장치 및 외부 전원을 나타내는 블록도이다. 도 2는 본 개시의 예시적 실시예에 따른 PMIC의 세부 블록도이다. 도 3a는 비교예에 따른 하이브리드 벅 컨버터의 회로도이다. 도 3b는 비교예에 따른 하이브리드 벅 컨버터의 회로도이다. 도 4는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 회로도이다. 도 5a는 본 개시의 예시적 실시예에 따른 푸시-풀 컨트롤러를 포함하는 하이브리드 벅 컨버터의 회로도이다. 도 5b는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 동작방법을 나타내는 순서도이다. 도 6a는 본 개시의 예시적 실시예에 따른 제1 PWM 컨트롤러를 포함하는 하이브리드 벅 컨버터의 회로도이다. 도 6b는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 동작방법을 나타내는 순서도이다. 도 7a는 본 개시의 예시적 실시예에 따른 제2 PWM 컨트롤러를 포함하는 하이브리드 벅 컨버터의 회로도이 다. 도 7b는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 동작방법을 나타내는 순서도이다. 도 7c는 본 개시의 예시적 실시예에 따른 전력 소모의 감소의 일 예를 도시한다. 도 7d는 본 개시의 예시적 실시예에 따른 제2 기준 전압이 가변되는 예를 도시한다. 도 8a는 본 개시의 예시적 실시예에 따른 히스테리시스 컨트롤러를 포함하는 하이브리드 벅 컨버터의 회로도이 다. 도 8b는 본 개시의 예시적 실시예에 따른 제3 기준 전압의 일 예이다. 도 8c는 본 개시의 예시적 실시예에 따른 하이브리드 벅 컨버터의 동작방법을 나타내는 순서도이다. 도 9는 본 개시의 일 실시예에 따른 하이브리드 벅 컨버터의 효율 개선을 나타내는 그래프이다."}
