{"patent_id": "10-2021-0158821", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0072263", "출원번호": "10-2021-0158821", "발명의 명칭": "앤솔로지 출판 시스템 및 이를 이용한 출판 방법", "출원인": "유명란", "발명자": "유명란"}}
{"patent_id": "10-2021-0158821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "게시글을 업로드하는 사용자 단말; 및상기 게시글을 이용하여 앤솔로지를 출판하는 앤솔로지 출판 서버를 포함하고, 상기 앤솔로지 출판 서버는, 글쓰기 양식을 제공하는 포맷 정보 제공부; 글쓰기 테마 정보를 제공하는 토픽 정보 제공부; 상기 게시글에 대한 관리를 수행하는 게시글 관리부; 상기 게시글을 기설정 분류에 따라 그룹핑하는 앤솔로지 매칭부; 및그룹핑된 상기 게시글을 이용하여 앤솔로지 출판을 수행하는 앤솔로지 출판부를 포함하는 것인 앤솔로지 출판 시스템."}
{"patent_id": "10-2021-0158821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 사용자 단말은 웹 방식 및 앱 방식 중 적어도 어느 하나의 방식에 따라 상기 앤솔로지 출판 서버에 접속하여 상기 게시글을 업로드하는 것인 앤솔로지 출판 시스템."}
{"patent_id": "10-2021-0158821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 포맷 정보 제공부는 사용자 선택 정보를 고려하여, 사용자가 작성하고자 하는 글쓰기 분류에 따른 상기 글쓰기 양식을 선별하여 제공하는 것인 앤솔로지 출판 시스템."}
{"patent_id": "10-2021-0158821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 토픽 정보 제공부는 나이, 연령, 성별, 관심사 정보 중 적어도 어느 하나를 포함하는 사용자 정보를 고려하여 사용자가 관심을 가질 것으로 예상되는 상기 글쓰기 테마 정보를 제공하는 것인 앤솔로지 출판 시스템."}
{"patent_id": "10-2021-0158821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 공개특허 10-2023-0072263-2-상기 게시글 관리부는 상기 게시글을 기설정 분류에 따라 게시판 별로 관리하고, 다른 사용자의 피드백 정보를관리하는 것인 앤솔로지 출판 시스템."}
{"patent_id": "10-2021-0158821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 앤솔로지 매칭부는 게시글 작성자인 사용자의 선택 정보 및 구독자의 관심 분야 정보 중 적어도 어느 하나를 고려하여 상기 앤솔로지를 출판하기 위한 그룹핑을 수행하는 것인 앤솔로지 출판 시스템."}
{"patent_id": "10-2021-0158821", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 앤솔로지 출판 서버는 상기 앤솔로지의 출판 과정에서 형성된 인적 네트워크를 토대로 형성 가능한 마을사업에 대한 추천 정보, 해당 마을 사업에 대한 지원 정보를 제공하는 것인 앤솔로지 출판 시스템."}
{"patent_id": "10-2021-0158821", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 앤솔로지 출판 시스템 및 이를 이용한 출판 방법에 관한 것이다. 본 발명에 따른 앤솔로지 출판 시스템은 게시글을 업로드하는 사용자 단말; 및 상기 게시글을 이용하여 앤솔로지 를 출판하는 앤솔로지 출판 서버를 포함하고, 상기 앤솔로지 출판 서버는, 글쓰기 양식을 제공하는 포맷 정보 제 공부; 글쓰기 테마 정보를 제공하는 토픽 정보 제공부; 상기 게시글에 대한 관리를 수행하는 게시글 관리부; 상 기 게시글을 기설정 분류에 따라 그룹핑하는 앤솔로지 매칭부; 및 그룹핑된 상기 게시글을 이용하여 앤솔로지 출 판을 수행하는 앤솔로지 출판부를 포함한다."}
{"patent_id": "10-2021-0158821", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 앤솔로지 출판 시스템 및 이를 이용한 출판 방법에 관한 것이다."}
{"patent_id": "10-2021-0158821", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전문적인 출판물기획자 또는 작가가 아닌 일반인들의 경우에도, 자전적 이야기 또는 자신의 생각을 담아 출판물 을 내고 싶은 니즈가 있으나, 이를 지원하는 플랫폼이 부재한 실정이다."}
{"patent_id": "10-2021-0158821", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위해 제안된 것으로, 일반인들이 자전적 이야기 또는 자신의 생각을 담은 게시글을 업로드하고, 상이한 사용자들 간의 게시글을 매칭하고 앤솔로지를 출판하는 출판 시스템 및 방법을 제 공하는데 그 목적이 있다."}
{"patent_id": "10-2021-0158821", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 앤솔로지 출판 시스템 및 이를 이용한 출판 방법에 관한 것이다. 본 발명에 따른 앤솔로지 출판 시스템은 게시글을 업로드하는 사용자 단말; 및 상기 게시글을 이용하여 앤솔로 지를 출판하는 앤솔로지 출판 서버를 포함하고, 상기 앤솔로지 출판 서버는, 글쓰기 양식을 제공하는 포맷 정보 제공부; 글쓰기 테마 정보를 제공하는 토픽 정보 제공부; 상기 게시글에 대한 관리를 수행하는 게시글 관리부; 상기 게시글을 기설정 분류에 따라 그룹핑하는 앤솔로지 매칭부; 및 그룹핑된 상기 게시글을 이용하여 앤솔로지 출판을 수행하는 앤솔로지 출판부를 포함한다. 상기 사용자 단말은 웹 방식 및 앱 방식 중 적어도 어느 하나의 방식에 따라 상기 앤솔로지 출판 서버에 접속하 여 상기 게시글을 업로드한다. 상기 포맷 정보 제공부는 사용자 선택 정보를 고려하여, 사용자가 작성하고자 하는 글쓰기 분류에 따른 상기 글 쓰기 양식을 선별하여 제공한다. 상기 토픽 정보 제공부는 나이, 연령, 성별, 관심사 정보 중 적어도 어느 하나를 포함하는 사용자 정보를 고려 하여 사용자가 관심을 가질 것으로 예상되는 상기 글쓰기 테마 정보를 제공한다. 상기 게시글 관리부는 상기 게시글을 기설정 분류에 따라 게시판 별로 관리하고, 다른 사용자의 피드백 정보를 관리한다. 상기 앤솔로지 매칭부는 게시글 작성자인 사용자의 선택 정보 및 구독자의 관심 분야 정보 중 적어도 어느 하나 를 고려하여 상기 앤솔로지를 출판하기 위한 그룹핑을 수행한다. 상기 앤솔로지 출판 서버는 상기 앤솔로지의 출판 과정에서 형성된 인적 네트워크를 토대로 형성 가능한 마을 사업에 대한 추천 정보, 해당 마을 사업에 대한 지원 정보를 제공한다."}
{"patent_id": "10-2021-0158821", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 이용자는 자신의 인생을 돌아보며 물음표로 시작된 자신 스스로를 찾아가며 느끼는 소소한 기억들과 그 속에서 현재와 미래를 이어갈 의미있는 가치를 찾고 그것을 정리하고 기록하며, 다른 이들과 생각 과 경험을 공유하며 앤솔로지를 출판하고, 나아가 형성된 인적네트워크를 토대로 마을 기업을 여는 등 사회의 구성원으로서 자신의 가치를 찾을 수 있도록 지원하는 효과가 있다."}
{"patent_id": "10-2021-0158821", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0158821", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 전술한 목적 및 그 이외의 목적과 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2021-0158821", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "으며, 단지 이하의 실시예들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 목적, 구성 및 효과를 용이하게 알려주기 위해 제공되는 것일 뿐으로서, 본 발명의 권리범위는 청구항의 기재에 의해 정의 된다. 한편, 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한 다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성소자, 단계, 동작 및/또는 소자가 하나 이상의 다른 구성소자, 단계, 동작 및/또는 소자의 존재 또는 추가됨을 배제하지 않는다. 이하에서는, 당업자의 이해를 돕기 위하여 본 발명이 제안된 배경에 대하여 먼저 서술하고, 본 발명의 실시예에 대하여 서술하기로 한다. 기획(planning)은 어떤 대상에 대해 그 대상의 변화를 가져올 목적을 확인하고, 그 목적을 성취하는 데에 가장 적합한 행동을 설계하는 것을 의미한다. 이에 대해 계획(plan)은 기획을 통해 산출된 결과를 의미하며, 사업계 획(program)과 단위사업계획(project)은 계획의 하위 개념으로 볼 수 있다. 종래 기술에 따른 출판물의 기획은 다양한 조사 등을 통해 독자가 원하는 출판물의 내용과 출판 시장 동향 등을 파악하고, 작가 섭외, 출판물의 영업 전략 등 출판물을 기획 및 제작에 관련된 모든 일을 담당한다. 독자가 요 구하는 주제를 발굴하기 위해 다양한 조사와 연구를 수행하며, 시장성, 타 출판물과의 차별성, 최근 경향을 고 려해 세부적인 기획안을 작성한다. 이에 적합한 작가를 섭외하고 집필된 원고를 검토한다. 내용상 필요한 그림 이나 삽화, 사진 등을 수록하기 위해 미술가나 사진가와 접촉하고 일을 요청한다. 출간 이후의 홍보 및 판매 전 략을 세워 본격적인 마케팅방향을 결정한다. 전문적인 출판물기획자 또는 작가가 아닌 일반인들의 경우에도, 자전적 이야기 또는 자신의 생각을 담아 출판물 을 내고 싶은 니즈가 있으나, 이를 지원하는 플랫폼이 부재한 실정이다. 예컨대 자서전을 출판하고자 하는 경우, 출판사에 의뢰하게 되면 많은 비용이 소요되므로 쉽게 접근하기 어려운 영역이다. 그리고, 기획은 곧 나 를 아는 당사자성에서 출발하게 되는데, 기획자 스스로 \"나\"를 찾는데 애로 사항이 있다. 본 발명은 전술한 문제점을 해결하기 위해 제안된 것으로, 앤솔로지 출판 시스템 및 이를 이용한 출판 방법을 제안하여, 이용자 각자가 온전히 바라보는 시간, 내가 원하는 것, 가치, 소중한 것, 추억, 기록과 관련된 글을 업로드하고, 다른 이용자들 간의 소통을 지원하고, 앤솔로지(사화집)를 출판하며, 나아가 마을 기업을 만들거나 사회 구성원으로서 각자의 의미 있는 자리를 만드는 것을 지원한다. 본 발명과 관련한 이용자의 타겟은 연령(50대의 갱년기에 접어든 여성, 10대 청소년), 니즈 또는 지역(내 이야 기를 찾고 싶은 여성, 비슷한 상황의 또래모임을 만들고 싶은 도봉구 여성)에 따라 정해질 수 있다. 본 발명의 실시예에 따르면, 이용자는 자신의 인생을 돌아보며 흥미 있는 일, 즐거운 일, 하고 싶은 일 등을 찾 아낼 수 있고, 물음표로 시작된 자신 스스로를 찾아가며 느끼는 소소한 기억들과 그 속에서 현재와 미래를 이어 갈 의미있는 가치를 찾고 그것을 정리하고 기록하는 것이 가능하다. 이를 통해, 사화집이라는 결과물로 지금을 추억하고, 예컨대 같은 또래 모임의 인적 네트워크를 형성하고 마음이 맞는 사람들끼리 마을 기업을 만드는 등 (예컨대, 베이킹과 관련된 추억, 레시피를 담은 사화집을 출판하고, 같은 취미를 가진 사람들끼리 베이킹 카페 라는 마을 기업을 만들 수도 있음), 제2의 인생을 통해 사회인의 한 사람으로 가치를 발견할 수 있도록 지원하 는 효과가 있다. 본 발명의 실시예에 따르면, 지난 삶을 회고하며 짧은 글들로 가볍게 이야기를 풀어내고 저자의 마음도 풀어지 는 효과가 있다. 이를 통해, 지난 삶을 통해 앞으로의 자신은 어떻게 지내고 싶은 지 확인하고, 자신만의 레시 피나 강점을 찾고 기록하며, 부모님 등 가족을 생각하며 글 기록을 남기는 것이 가능하다. 도 1은 본 발명의 실시예에 따른 앤솔로지 출판 시스템을 도시한다. 복수의 사용자 단말(100a 내지 100n)은 앤솔로지 출판 서버에 접속하여(웹 방식 또는 앱 방식으로 접속함), 앤 솔로지 출판을 위한 전단계로서 다양한 정보(글 작성 포맷, 글 작성 토픽, 심리 테스트, 사용자 정보-나이, 연 령, 성별, 관심사 정보-를 고려한 추천 컨텐츠)를 제공받고, 게시글을 업로드한다. 앤솔로지 출판 서버는 포맷 정보 제공부, 토픽 정보 제공부, 게시글 관리부, 앤솔로지 매 칭부, 출판부 및 전자지갑 관리부를 포함한다. 전문 작가 또는 글쓰기를 기존의 취미로 삼고 있던 이용자가 아닌 경우, 자신의 생각을 어디서부터, 어떠한 형 식으로 작성하여야 하는지 알지 못하는 경우가 있다. 사용자는 포맷 정보 제공부로부터 글쓰기 포맷을 각 분류별로 제공받을 수 있다. 예컨대, 음식 레시피를 작성하고자 하는 사용자가 \"음식 레시피 글쓰기 포맷\"을 선택하는 경우, 준비 재료, 준 비 재료 다듬기, 요리 순서 등에 따라 기설정된 음식 레시피 글쓰기 포맷이 제공된다. 또한, 음식 레시피 외에 음식 레시피와 연관된 사용자의 추억에 대한 글쓰기 포맷을 요청하는 경우, 음식 레시피 글 전 또는 후에 포함 되는 수필 글쓰기 포맷이 제공된다. 사용자는 토픽 정보 제공부로부터 글쓰기 토픽에 대한 정보를 제공받을 수 있다. 예컨대, 계절, 사용자 정보(전술한 나이, 연령, 성별, 관심사 정보 등), 핫한 키워드 등 사용자가 관심을 가질 것으로 생각되는 토픽 정보를 제공하여, 글쓰기 테마를 정할 수 있도록 지원한다. 예를 들어, 2021년 11월 16일 이 수능 시험 임박일인 경우, 수험생 연령대의 사용자에게는 수능을 준비하는 요령, 수능에 임하는 각오를 토픽정보로 제공하고, 수험생을 자녀로 둔 부모 연령대의 사용자에게는 자녀 수능과 관련한 추억, 자녀 수능 시 자 녀를 대하는 태도와 관련된 노하우 등을 토픽 정보로 제공할 수 있다. 토픽 정보 제공부는 단편적으로 글쓰기 토픽에 대한 정보를 일방적으로 전달하는 것 외에, 사용자 설문조 사(심리테스트)를 수행하여, 사용자가 관심을 가질 만한 영역 정보를 추출하고, 추출된 영역정보를 고려하여 글 쓰기 토픽에 대한 정보를 추천하여 제공하는 것이 가능하다. 게시글 관리부는 사용자 단말(100a 내지 100n)을 통해 업로드된 게시글을 저장하고, 게시글을 각 분류된 게시판 별로 관리함으로써, 다른 사용자들이 해당 게시글을 읽고, 반응하고(댓글, 좋아요), 공유할 수 있도록 하는 플랫폼을 제공한다. 이를 통해, 게시글을 업로드한 사용자는 자신이 게시한 글에 대한 다른 사용자의 반응을 살펴볼 수 있고, 피드 백을 확인하여 더 나은 게시글 작성에 참고할 수 있다. 앤솔로지 매칭부는 사용자의 요청에 따라, 또는 인공지능 등을 이용한 텍스트 분석 등의 다양한 기법을 토 대로, 유사한 카테고리 별로 앤솔로지를 출판하기 위한 전단계의 매칭을 수행한다. 예컨대, 전술한 \"수능\" 관련 토픽 정보가 있을 경우, \"자녀 수능 시험을 앞두고 자녀를 대하는 태도와 관련된 노하우\"에 관한 복수의 게시글을 모아서 매칭할 수 있고, 이를 내년에 수험생이 되는 부모 연령대의 사용자의 관심 분야의 앤솔로지로 출판하도록 기획한다. 또한, \"수능을 준비하는 요령(마무리 학습 방법)\"과 관련한 복수 의 게시글을 모아서 매칭하고, 이를 내년에 수험생이 되는 학생 연령대의 사용자의 관심 분야의 앤솔로지로 출 판하도록 기획한다. 출판부는 전술한 매칭된 앤솔로지에 대해, 사용자들의 동의를 얻거나 사전 동의에 근거하여, 앤솔로지 출 판을 수행한다. 종전 기술에 따르면, 학생 사용자가 \"수능을 준비하는 마무리 학습 방법과 관련한 요령\"에 대해 알고 싶은 경우, 포털 사이트에서 적절한 검색어 입력을 통해 일일이 게시글을 확인하여야 하는데, 광고성 게시글 등에 의 해 정작 원하는 정보를 얻지 못하는 문제점이 있다. 반면, 본 발명의 실시예에 따르면, 앤솔로지 출판 서버 에 의해 자동으로 기획되고 출판되는 해당 토픽의 앤솔로지를 통해, 복수의 사용자가 게시한 글을 한 번에 묶어서 읽을 수 있으므로, 보다 양질의 정보를 획득하는 것이 가능한 효과가 있다. 또한, 좀 더 세부적으로 \"서 울시 도봉구 수능을 준비하는 마무리 학습 방법과 관련한 요령\"으로 지역 정보가 포함된 앤솔로지의 경우, 도봉 구에서 수능 시험을 치는 학생들이 알면 좋은 정보, 예컨대 도봉구 각 수능시험장 별 유의사항(교통편, 헷갈리 기 쉬운 지명 정보 등)을 알 수 있어, 보다 사용자의 니즈에 부합하는 정보를 제공하는 것이 가능하다. 또한, \"서울시 도봉구 수능을 준비하는 마무리 학습 방법과 관련한 요령\"으로 앤솔로지를 출판하게 된 게시글 작성자들은, 커뮤니티 기능을 통해 인적네트워크를 구축할 수 있고, \"서울시 도봉구 저소득 계층 자녀인 수험생\"에 대한 재능 기부 등을 수행하는 마을사업을 구상할 수 있다. 본 발명의 실시예에 따른 앤솔로지 출판 서버는 비단 앤솔로지 출판 결과물을 기획하고 제작하는 것에 그 치지 않고, 그 과정에서 구축되는 인적 네트워크를 통해 구성할 수 있는 마을사업에 대한 아이디어 정보, 마을 사업에 대한 정부, 지자체 지원 정보 등을 제공하는 것이 가능하다. 전자지갑 관리부는 사용자의 계정과 연결되어, 카드 결제, 계좌 이체, 포인트 적립, 포인트 사용 등을 수 행한다. 예컨대, 게시글 업로드 시 포인트 적립, 게시글 반응 시 포인트 적립 등을 통해, 적립된 포인트를 추후 앤솔로 지 출판에 사용할 수 있도록 한다. 또한, 펀딩을 받아 해당 앤솔로지의 종이 출판물 제작을 수행할 수 있다. 도 2는 본 발명의 실시예에 따른 앤솔로지 출판 방법을 도시한다. 본 발명의 실시예에 따른 앤솔로지 출판 방법은 포맷 정보 또는 토픽 정보를 제공하는 단계(S210), 게시글 업로 드 및 관리를 수행하는 단계(S220), 커뮤니티를 제공하고 앤솔로지 매칭을 수행하는 단계(S230), 앤솔로지 출판 을 수행하는 단계(S240)를 포함한다. S210 단계는 글쓰기에 익숙하지 않은, 또는 어떠한 주제로 글쓰기를 써야 할지 아이디어가 부족한 사용자에게, 글쓰기 포맷 정보 또는 토픽 정보를 제공한다. S220 단계는 사용자가 업로드한 게시글을 관리하고, 다른 사용자가 편하게 확인하고 열람할 수 있도록 기분류된 게시판 별로 게시글을 관리한다. S230 단계는 사용자 간의 커뮤니티 기능을 제공하고, 게시글을 매칭시켜 앤솔로지 매칭을 수행한다. S240 단계는 매칭된 앤소로지에 대한 출판 과정을 수행한다. 한편, 본 발명의 실시예에 따른 앤솔로지 출판 방법은 컴퓨터 시스템에서 구현되거나, 또는 기록매체에 기록될 수 있다. 컴퓨터 시스템은 적어도 하나 이상의 프로세서와, 메모리와, 사용자 입력 장치와, 데이터 통신 버스와, 사용자 출력 장치와, 저장소를 포함할 수 있다. 전술한 각각의 구성 요소는 데이터 통신 버스를 통해 데이터 통신을 한다. 컴퓨터 시스템은 네트워크에 커플링된 네트워크 인터페이스를 더 포함할 수 있다. 프로세서는 중앙처리 장치 (central processing unit (CPU))이거나, 혹은 메모리 및/또는 저장소에 저장된 명령어를 처리하는 반도체 장치 일 수 있다. 메모리 및 저장소는 다양한 형태의 휘발성 혹은 비휘발성 저장매체를 포함할 수 있다. 예컨대, 메모리는 ROM 및 RAM을 포함할 수 있다. 따라서, 본 발명의 실시예에 따른 앤솔로지 출판 방법은 컴퓨터에서 실행 가능한 방법으로 구현될 수 있다. 본 발명의 실시예에 따른 앤솔로지 출판 방법이 컴퓨터 장치에서 수행될 때, 컴퓨터로 판독 가능한 명령어들이 본 발명에 따른 앤솔로지 출판 방법을 수행할 수 있다. 한편, 상술한 본 발명에 따른 앤솔로지 출판 방법은 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현되는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록 매체로는 컴퓨터 시스템에 의하여 해독될 수 있 는 데이터가 저장된 모든 종류의 기록 매체를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플래시 메모리, 광 데이터 저장장치 등이 있을 수 있다. 또한, 컴 퓨터로 판독 가능한 기록매체는 컴퓨터 통신망으로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 읽을 수 있 는 코드로서 저장되고 실행될 수 있다.도면 도면1 도면2"}
{"patent_id": "10-2021-0158821", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 앤솔로지 출판 시스템을 도시한다. 도 2는 본 발명의 실시예에 따른 앤솔로지 출판 방법을 도시한다."}
