{"patent_id": "10-2022-0100073", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0022040", "출원번호": "10-2022-0100073", "발명의 명칭": "증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법", "출원인": "주식회사 피앤씨솔루션", "발명자": "최치원"}}
{"patent_id": "10-2022-0100073", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "내부에 무인 점포 시설이 구비된 자율주행 차량인 무인 점포 차량(100);사용자가 머리에 착용해 증강현실을 제공받는 증강현실 글래스 장치(200); 및상기 무인 점포 차량(100)을 관리하고, 상기 증강현실 글래스 장치(200)의 요청에 따라 상기 무인 점포 차량(100)을 매칭하고 이동 요청하는 서비스 서버(300)를 포함하는 시스템에서 각 단계가 수행되는 자율주행 무인점포의 이용 방법으로서,(2) 상기 서비스 서버(300)가, 상기 증강현실 글래스 장치(200)에서 음성 명령을 통해 선택된 무인 점포 서비스를 제공하는 상기 무인 점포 차량(100)을 매칭하는 단계;(3) 상기 단계 (2)에서 매칭된 무인 점포 차량(100)이 상기 서비스 서버(300)로부터 상기 증강현실 글래스 장치(200)의 위치 정보를 수신하고, 자율주행 방식으로 상기 수신한 위치 정보에 대응하는 위치로 이동하는 단계;(4) 상기 증강현실 글래스 장치(200)에서, 상기 무인 점포 차량(100)의 실시간 위치 정보를 증강현실로 출력하는 단계;(5) 상기 무인 점포 차량(100)이 사용자 인증을 완료하고 문 잠금을 해제하여, 사용자의 입장 및 내부의 무인점포 시설 이용을 허용하는 단계; 및(6) 상기 사용자가 상기 무인 점포 차량(100)에서 나가고 무인 점포 서비스의 제공이 종료되면, 상기 무인 점포차량(100)이 상기 서비스 서버(300)로부터 전달받은 이동 위치로 이동하는 단계를 포함하는 것을 특징으로하는, 증강현실 글래스 장치(200)와 음성인식을 이용한 자율주행 무인 점포의 이용 방법."}
{"patent_id": "10-2022-0100073", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 단계 (2) 이전에는,(1) 상기 증강현실 글래스 장치(200)에서 증강현실로 무인 점포 서비스를 선택할 수 있는 옵션이 출력되는 단계를 더 포함하는 것을 특징으로 하는, 증강현실 글래스 장치(200)와 음성인식을 이용한 자율주행 무인 점포의 이용 방법."}
{"patent_id": "10-2022-0100073", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 단계 (1)에서는,상기 증강현실 글래스 장치(200)에서 무인 점포 서비스를 호출하는 음성 명령어를 인식하면, 상기 무인 점포 서비스를 선택할 수 있는 메뉴를 출력하는 것을 특징으로 하는, 증강현실 글래스 장치(200)와 음성인식을 이용한자율주행 무인 점포의 이용 방법."}
{"patent_id": "10-2022-0100073", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 단계 (2)에서는,상기 증강현실 글래스 장치(200)의 위치를 기반으로 상기 선택된 무인 점포 서비스를 제공하는 무인 점포 차량(100)을 검색하며, 검색 결과를 사용해 상기 증강현실 글래스 장치(200)의 선택에 따라 무인 점포 차량(100)을매칭하거나, 상기 서비스 서버(300)가 상기 검색 결과를 사용해 자동으로 무인 점포 차량(100)을 매칭하는 것을특징으로 하는, 증강현실 글래스 장치(200)와 음성인식을 이용한 자율주행 무인 점포의 이용 방법.공개특허 10-2024-0022040-3-청구항 5 제1항에 있어서, 상기 단계 (4)에서는,상기 증강현실 글래스 장치(200)의 뷰 필드에 상기 무인 점포 차량(100)이 인식되면, 상기 무인 점포 차량(100)의 내부 영상, 상기 무인 점포 차량(100)의 서비스 제공 품목 및 재고 정보를 포함하는 군에서 선택된 적어도하나 이상을 증강현실로 출력하는 것을 특징으로 하는, 증강현실 글래스 장치(200)와 음성인식을 이용한 자율주행 무인 점포의 이용 방법."}
{"patent_id": "10-2022-0100073", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 단계 (5)에서는,상기 증강현실 글래스 장치(200)의 위치 정보와 상기 무인 점포 차량(100)의 현재 위치 정보가 매칭되면 상기사용자 인증을 완료하는 것을 특징으로 하는, 증강현실 글래스 장치(200)와 음성인식을 이용한 자율주행 무인점포의 이용 방법."}
{"patent_id": "10-2022-0100073", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 단계 (5)에서는,상기 증강현실 글래스 장치(200)의 위치 정보와 상기 무인 점포 차량(100)의 현재 위치 정보가 매칭되고, 상기증강현실 글래스 장치(200)에서 뷰 필드(view field)의 객체를 인식하여 인식한 객체가 상기 무인 점포 차량(100)과 일치하면, 상기 사용자 인증을 완료하는 것을 특징으로 하는, 증강현실 글래스 장치(200)와 음성인식을이용한 자율주행 무인 점포의 이용 방법."}
{"patent_id": "10-2022-0100073", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 단계 (6)에서는,상기 서비스 서버(300)는, 상기 무인 점포 차량(100)에서 제공하는 무인 점포 서비스의 이용자 발생 현황, 교통상황 및 다른 무인 점포 차량(100)의 배치를 고려하여, 상기 무인 점포 서비스의 제공이 종료된 무인 점포 차량(100)의 이동 위치를 결정하여 전달하는 것을 특징으로 하는, 증강현실 글래스 장치(200)와 음성인식을 이용한자율주행 무인 점포의 이용 방법."}
{"patent_id": "10-2022-0100073", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법에 관한 것으로서, 보다 구체적으로는 내부에 무인 점포 시설이 구비된 자율주행 차량인 무인 점포 차량; 사용자가 머리에 착용해 증강현 실을 제공받는 증강현실 글래스 장치; 및 상기 무인 점포 차량을 관리하고, 상기 증강현실 글래스 장치의 요청에 (뒷면에 계속)"}
{"patent_id": "10-2022-0100073", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자율주행 무인 점포의 이용 방법에 관한 것으로서, 보다 구체적으로는 증강현실 글래스 장치와 음성 인식을 이용한 자율주행 무인 점포의 이용 방법에 관한 것이다."}
{"patent_id": "10-2022-0100073", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율주행차는 운전자가 핸들과 가속페달, 브레이크 등을 조작하지 않아도 정밀한 지도, 위성항법시스템(GPS) 등 차량의 각종 센서로 상황을 파악해 스스로 목적지까지 찾아가는 자동차를 말한다. 시장조사업체 네비건트리서 치에 따르면 세계 자율주행차 시장은 2020년 전체 자동차 시장의 2%인 2000억 달러를 차지한 뒤 2035년까지 1조 2000억 달러에 달할 것으로 추정된다. 자율주행 자동차가 실현되기 위해서는, 차간 거리를 자동으로 유지해 주는 HDA 기술, 차선이탈 경보 시스템 (LDWS), 차선유지 지원 시스템(LKAS), 후측방 경보 시스템(BSD), 어드밴스트 스마트 크루즈 컨트롤(ASCC), 자동긴급제동 시스템(AEB) 등 수많은 기술이 필요하다. 미국자동차기술학회(SAE)는 자율주행자동차의 발달 수준을 레벨 0부터 레벨 5까지 6단계로 나눴다. 0 단계는 자율주행 기능 없는 일반 차량, 1단계는 자동브레이크, 자동속도조절 등 운전 보조 기능, 2단계는 부분 자율주 행, 운전자의 상시 감독 필요, 3단계는 조건부 자율주행, 자동차가 안전기능 제어, 탑승자 제어가 필요한 경우 신호, 4단계는 고도 자율주행, 주변 환경 관계없이 운전자 제어 불필요, 5단계는 완전 자율주행, 사람이 타지 않고도 움직이는 무인 주행차가 그것이다. 최근 자율주행차를 사용한 택배 배송이나 택시 서비스 등, 자율주행차와 이를 통한 각종 서비스가 시도되고 있 는 만큼, 자율주행차를 활용한 무인 점포도 도입될 가능성이 있다. 한편, 본 발명과 관련된 선행기술로, 공개특허 제10-2021-0027442호(발명의 명칭: 무인 배송 차량에 의한 무인 배송 시스템, 공개일자: 2021년 03월 10일) 등이 개시된 바 있다."}
{"patent_id": "10-2022-0100073", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존에 제안된 방법들의 상기와 같은 문제점들을 해결하기 위해 제안된 것으로서, 증강현실 글래스 장치에서 음성 명령을 통해 무인 점포 서비스를 선택하면, 해당 서비스를 제공할 수 있는 자율주행 무인 점포 차량이 매칭되어 증강현실 글래스 장치의 위치로 이동하고, 사용자 인증 완료 후 사용자가 무인 점포 차량에 입 장해 시설을 이용함으로써, 증강현실 글래스 장치와 음성인식을 사용해 빠르고 편리하게 원하는 서비스를 제공 받을 수 있고, 증강현실 글래스 장치에서 무인 점포 차량의 실시간 위치 정보, 내부 영상, 서비스 제공 품목, 재고 정보 등을 증강현실로 제공해, 사용자가 무인 점포 차량 내부에 입장하기 전에도 쉽고 편리하게 해당 무인 점포 차량에 관한 다양한 정보를 확인할 수 있는, 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점 포의 이용 방법을 제공하는 것을 그 목적으로 한다."}
{"patent_id": "10-2022-0100073", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 특징에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법은, 내부에 무인 점포 시설이 구비된 자율주행 차량인 무인 점포 차량; 사용자가 머리에 착용해 증강현실을 제공받는 증강현실 글래스 장치; 및 상기 무인 점포 차량을 관리하고, 상기 증강현실 글래스 장치의 요청에 따라 상기 무인 점포 차량을 매칭하고 이동 요청하는 서비스 서버를 포함하는 시스템에서 각 단계가 수행되는 자율주행 무인 점포의 이용 방법으로서, 상기 서비스 서버가, 상기 증강현실 글래스 장치에서 음성 명령을 통해 선택된 무인 점포 서비스를 제공하 는 상기 무인 점포 차량을 매칭하는 단계; 상기 단계 에서 매칭된 무인 점포 차량이 상기 서비스 서버로부터 상기 증강현실 글래스 장치의 위치 정 보를 수신하고, 자율주행 방식으로 상기 수신한 위치 정보에 대응하는 위치로 이동하는 단계; 상기 증강현실 글래스 장치에서, 상기 무인 점포 차량의 실시간 위치 정보를 증강현실로 출력하는 단계; 상기 무인 점포 차량이 사용자 인증을 완료하고 문 잠금을 해제하여, 사용자의 입장 및 내부의 무인 점포 시설 이용을 허용하는 단계; 및 상기 사용자가 상기 무인 점포 차량에서 나가고 무인 점포 서비스의 제공이 종료되면, 상기 무인 점포 차량 이 상기 서비스 서버로부터 전달받은 이동 위치로 이동하는 단계를 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 단계 이전에는, 상기 증강현실 글래스 장치에서 증강현실로 무인 점포 서비스를 선택할 수 있는 옵션이 출력되는 단계를 더 포함할 수 있다. 더욱 바람직하게는, 상기 단계 에서는, 상기 증강현실 글래스 장치에서 무인 점포 서비스를 호출하는 음성 명령어를 인식하면, 상기 무인 점포 서비스 를 선택할 수 있는 메뉴를 출력할 수 있다. 바람직하게는, 상기 단계 에서는, 상기 증강현실 글래스 장치의 위치를 기반으로 상기 선택된 무인 점포 서비스를 제공하는 무인 점포 차량을 검 색하며, 검색 결과를 사용해 상기 증강현실 글래스 장치의 선택에 따라 무인 점포 차량을 매칭하거나, 상기 서 비스 서버가 상기 검색 결과를 사용해 자동으로 무인 점포 차량을 매칭할 수 있다. 바람직하게는, 상기 단계 에서는, 상기 증강현실 글래스 장치의 뷰 필드에 상기 무인 점포 차량이 인식되면, 상기 무인 점포 차량의 내부 영상, 상기 무인 점포 차량의 서비스 제공 품목 및 재고 정보를 포함하는 군에서 선택된 적어도 하나 이상을 증강현실 로 출력할 수 있다. 바람직하게는, 상기 단계 에서는, 상기 증강현실 글래스 장치의 위치 정보와 상기 무인 점포 차량의 현재 위치 정보가 매칭되면 상기 사용자 인증 을 완료할 수 있다. 더욱 바람직하게는, 상기 단계 에서는, 상기 증강현실 글래스 장치의 위치 정보와 상기 무인 점포 차량의 현재 위치 정보가 매칭되고, 상기 증강현실 글래스 장치에서 뷰 필드(view field)의 객체를 인식하여 인식한 객체가 상기 무인 점포 차량과 일치하면, 상기 사용자 인증을 완료할 수 있다. 바람직하게는, 상기 단계 에서는, 상기 서비스 서버는, 상기 무인 점포 차량에서 제공하는 무인 점포 서비스의 이용자 발생 현황, 교통 상황 및 다른 무인 점포 차량의 배치를 고려하여, 상기 무인 점포 서비스의 제공이 종료된 무인 점포 차량의 이동 위치 를 결정하여 전달할 수 있다."}
{"patent_id": "10-2022-0100073", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안하고 있는 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법에 따르 면, 증강현실 글래스 장치에서 음성 명령을 통해 무인 점포 서비스를 선택하면, 해당 서비스를 제공할 수 있는 자율주행 무인 점포 차량이 매칭되어 증강현실 글래스 장치의 위치로 이동하고, 사용자 인증 완료 후 사용자가 무인 점포 차량에 입장해 시설을 이용함으로써, 증강현실 글래스 장치와 음성인식을 사용해 빠르고 편리하게 원 하는 서비스를 제공받을 수 있고, 증강현실 글래스 장치에서 무인 점포 차량의 실시간 위치 정보, 내부 영상, 서비스 제공 품목, 재고 정보 등을 증강현실로 제공해, 사용자가 무인 점포 차량 내부에 입장하기 전에도 쉽고 편리하게 해당 무인 점포 차량에 관한 다양한 정보를 확인할 수 있다."}
{"patent_id": "10-2022-0100073", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단 되는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 ‘연결’ 되어 있다고 할 때, 이는 ‘직접적으로 연결’ 되 어 있는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 ‘간접적으로 연결’ 되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 ‘포함’ 한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제 외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 도 1은 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법을 제공하는 시스템 구성을 도시한 도면이다. 도 1에 도시된 바와 같이, 본 발명의 일실시예에 따른 증강 현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법을 제공하는 시스템은, 무인 점포 차량, 증강현실 글래스 장치 및 서비스 서버를 포함하여 구성될 수 있다. 무인 점포 차량은, 내부에 무인 점포 시설이 구비된 자율주행 차량일 수 있다. 여기서, 무인 점포 차량 은 각종 서비스를 제공할 수 있는 시설이 내부에 구비된 자율주행 차량으로, 운전자 없이 자율주행을 통해 목적지까지 이동할 수 있다. 무인 점포 차량이 제공하는 서비스는, 식료품 판매, 미용실, 의료 진단, 노 래방 등이 있을 수 있다. 실시예에 따라서, 사용자가 전문가에 의한 미용 서비스나 의료 서비스를 신청하면, 내부에 미용실이나 의료 기기 등의 시설이 구비된 무인 점포 차량은 미용사나 의료진 등 전문가의 위치로 먼저 이동해 전문가 탑승 후 사용자의 위치로 이동하여, 사용자가 요청한 전문적인 서비스를 제공할 수도 있다. 또한, 내부 청소가 필요하거나 재고 부족 등의 경우, 무인 점포 차량은 자율주행을 통해 무인 점포 서비스 를 지원하는 서비스 지원 센터, 물류센터 등으로 이동해, 내부를 청소하거나 물품을 추가로 적재, 진열 등을 할 수 있다. 이때, 무인 점포 차량은, 내부 청소가 필요한지를 판단하기 위해 내부 촬영 영상을 인공지능 기 반 영상 분석을 통해 분석하고, 내부 청소가 필요한 것으로 판단되면 자율주행 방식으로 서비스 지원 센터로 이 동할 수 있다. 또한, 무인 점포 차량은 물품 진열 내역, 판매 내역, 물품 진열대의 적재 무게 등을 사용 해 재고를 산출하고, 재고가 기준 수량 이하이면 자율주행 방식으로 물류센터 등으로 이동할 수 있다. 증강현실 글래스 장치는, 사용자가 머리에 착용해 증강현실을 제공받는 장치일 수 있다. 증강현실 글래스 장치는 착용자의 눈 전방에 배치된 광학 디스플레이부를 통해 현실 세계의 광의 적어도 일부를 투과하는 동시에, 디스플레이에서 출력되는 영상 광의 적어도 일부를 착용자의 눈 방향으로 전달하여 착용자에게 증강현 실을 제공할 수 있다. 증강현실 글래스 장치는 AR 또는 XR(eXtended Reality, 확장 현실)을 제공할 수 있 는 장치로, 광학 회절 방식, 빔 스플리터 방식, 핀 미러 방식 등 복수의 렌즈와 미러 등을 포함해 다양한 방식 으로 구현될 수 있다. 또한, 증강현실 글래스 장치는, 음성인식 기능을 포함하여 사용자의 음성 명령어를인식하고 음성 명령에 따른 기능을 수행할 수 있다. 서비스 서버는, 무인 점포 차량을 관리하고, 증강현실 글래스 장치의 요청에 따라 무인 점포 차 량을 매칭하고 이동 요청할 수 있다. 즉, 서비스 서버는 네트워크를 통해 무인 점포 차량 및 증강현실 글래스 장치와 각종 신호 및 데이터를 송수신함으로써, 증강현실 글래스 장치를 착용하고 무인 점포 서비스를 요청한 사용자에게 적절한 무인 점포 차량을 배차하여 무인 점포 서비스를 제공할 수 있다. 여기서, 네트워크는 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN) 또는 부 가가치 통신망(Value Added Network; VAN) 등과 같은 유선 네트워크나 이동 통신망(mobile radio communication network), 위성 통신망, 블루투스(Bluetooth), Wibro(Wireless Broadband Internet), HSDPA(High Speed Downlink Packet Access), LTE(Long Term Evolution), 3/4/5/6G(3/4/5/6th Generation Mobile Telecommunication) 등과 같은 모든 종류의 무선 네트워크로 구현될 수 있다. 도 2는 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법의 흐름을 도시한 도면이다. 도 2에 도시된 바와 같이, 본 발명의 일실시예에 따른 증강현실 글래스 장치 와 음성인식을 이용한 자율주행 무인 점포의 이용 방법은, 서비스 서버가 증강현실 글래스 장치(20 0)에서 음성 명령을 통해 선택된 무인 점포 서비스를 제공하는 무인 점포 차량을 매칭하는 단계(S200), 무 인 점포 차량이 서비스 서버로부터 증강현실 글래스 장치의 위치 정보를 수신하고 자율주행 방 식으로 이동하는 단계(S300), 증강현실 글래스 장치에서 무인 점포 차량의 실시간 위치 정보를 증강 현실로 출력하는 단계(S400), 무인 점포 차량이 사용자 인증을 완료하고 문 잠금을 해제하여, 사용자의 입 장 및 내부의 무인 점포 시설 이용을 허용하는 단계(S500) 및 사용자가 무인 점포 차량에서 나가고 무인 점포 서비스의 제공이 종료되면, 무인 점포 차량이 서비스 서버로부터 전달받은 이동 위치로 이동하 는 단계(S600)를 포함하여 구현될 수 있으며, 단계 S200 이전에는 증강현실 글래스 장치에서 증강현실로 무인 점포 서비스를 선택할 수 있는 옵션이 출력되는 단계(S100)를 더 포함하여 구현될 수 있다. 단계 S100에서는, 증강현실 글래스 장치에서 증강현실로 무인 점포 서비스를 선택할 수 있는 옵션이 출력 될 수 있다. 보다 구체적으로, 단계 S100에서는, 증강현실 글래스 장치에서 무인 점포 서비스를 호출하는 음성 명령어를 인식하면, 무인 점포 서비스를 선택할 수 있는 메뉴를 출력할 수 있다. 즉, 증강현실 글래스 장 치를 착용한 상태에서 사용자가 “무인 점포” 등과 같이 음성으로 명령하면, 증강현실 글래스 장치 가 음성인식을 통해 음성 명령어를 인식하고, 이에 대응하여 무인 점포 서비스를 선택할 수 있는 옵션 메뉴를 증강현실로 표시할 수 있다. 이때, 무인 점포 서비스를 선택할 수 있는 옵션은, 여러 서비스 아이콘이 나열된 메뉴 형태일 수 있으며, 손동작이나 음성 명령을 사용해 스크롤 가능하게 구현될 수 있다. 또한, 각 옵션 또는 아이콘은, 편의점, 미용실, 의료 진단, 약국, 노래방 등 서비스를 직관적으로 파악할 수 있는 형태일 수 있다. 단계 S200에서는, 서비스 서버가, 증강현실 글래스 장치에서 음성 명령을 통해 선택된 무인 점포 서 비스를 제공하는 무인 점포 차량을 매칭할 수 있다. 보다 구체적으로, 단계 S200에서는, 증강현실 글래스 장치의 위치를 기반으로 선택된 무인 점포 서비스를 제공하는 무인 점포 차량을 검색하며, 검색 결과 를 사용해 증강현실 글래스 장치의 선택에 따라 무인 점포 차량을 매칭하거나, 서비스 서버가 검색 결과를 사용해 자동으로 무인 점포 차량을 매칭할 수 있다. 예를 들어, 증강현실 글래스 장치를 착용한 사용자가 “노래방”이나 “노래방 무인 점포” 등과 같이 특 정 서비스를 지정해 음성으로 명령하면, 증강현실 글래스 장치는 음성을 인식해 해당 무인 점포 서비스의 서비스 제공 내용, 사용자의 사용 이력, 주변의 무인 점포 차량 검색 결과, 주변의 무인 점포 차량까 지의 거리, 이용자 평점, 이용 후기, 재고 현황 등을 표시할 수 있다. 서비스 서버는, 증강현실 글래스 장치 가 선택한 특정 무인 점포 차량을 매칭할 수 있고, 가장 가까운 무인 점포 차량이나 이용 후기가 가장 좋은 무인 점포 차량 등을 자동으로 매칭할 수도 있다. 도 3은 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법에서, 사용자가 무인 점포 서비스를 선택하는 모습을 예를 들어 도시한 도면이다. 도 3에 도시된 바와 같 이, 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방 법에서는, 증강현실 글래스 장치에서 사용자가 “노래방”이라고 특정 무인 점포 서비스를 음성으로 선택 하면, 서비스 서버가 노래방 서비스를 제공하는 인접한 무인 점포 차량을 검색해 지도에 “①”과 “ ②”로 표시하여 증강현실로 제공할 수 있다. 다시 사용자가 음성으로 “1” 또는 “2”라고 특정 무인 점포 차량을 선택하면, 서비스 서버는 선택된 무인 점포 차량을 사용자와 매칭할 수 있다. 이때, 특 정 무인 점포 차량을 선택하기 전에, 검색된 각각의 무인 점포 차량의 서비스 제공 내용, 재고 현황, 내부 영상, 서비스 만족도, 이용 후기 등의 상세 정보를 제공할 수 있다. 서비스 서버는 매칭된 무인 점 포 차량이 사용자의 위치로 이동하도록 명령하면서, 증강현실 글래스 장치에 증강현실로 “노래방 무 인 점포 호출합니다.”라는 메시지를 출력할 수 있다. 실시예에 따라서, 위의 메시지에 대응해 승낙하는 제스 처나 음성 명령어를 사용해 최종 확인 후, 서비스 서버가 매칭된 무인 점포 차량에 이동을 명령할 수 있다. 단계 S300에서는, 단계 S200에서 매칭된 무인 점포 차량이 서비스 서버로부터 증강현실 글래스 장치 의 위치 정보를 수신하고, 자율주행 방식으로 수신한 위치 정보에 대응하는 위치로 이동할 수 있다. 즉, 단계 S200에서 증강현실 글래스 장치와 무인 점포 차량이 매칭되면, 서비스 서버가 증강현실 글 래스 장치의 위치 정보를 수신해 무인 점포 차량에 송신하면서 해당 위치로 이동하도록 지시할 수 있 다. 무인 점포 차량은 현재 위치를 출발지로, 수신한 증강현실 글래스 장치의 위치 정보를 목적지로 각각 설정해 경로를 계산하고 자율주행 방식으로 이동할 수 있다. 실시예에 따라서, 사용자가 전문가에 의한 서비스, 예를 들어 미용 서비스나 의료 서비스 등을 신청하면, 내부 에 미용실이나 의료 기기 등의 시설이 구비된 무인 점포 차량은 미용사나 의료진 등 전문가의 위치로 먼저 이동해 전문가 탑승 후 사용자의 위치로 이동하여, 사용자가 요청한 전문 서비스를 제공할 수도 있다. 이를 위하여, 단계 S200에서는 미리 구축된 전문가 풀(pool)을 사용해, 증강현실 글래스 장치의 위치, 무 인 점포 차량의 위치 및 전문가의 위치를 고려해, 전문가를 픽업하여 증강현실 글래스 장치로 가장 빨리 이동할 수 있는 무인 점포 차량을 매칭할 수 있다. 또는, 증강현실 글래스 장치의 사용자가 선 택한 전문가 또는 무인 점포 차량을 기준으로, 무인 점포 차량 또는 전문가를 매칭할 수도 있다. 단 계 S300에서는, 무인 점포 차량이 서비스 서버로부터 전문가의 위치 정보와 증강현실 글래스 장치 의 위치 정보를 수신하고, 현재 위치를 출발해 전문가의 위치를 경유하여 증강현실 글래스 장치의 위 치로 이동할 수 있다. 단계 S400에서는, 증강현실 글래스 장치에서, 무인 점포 차량의 실시간 위치 정보를 증강현실로 출력 할 수 있다. 즉, 사용자가 증강현실 글래스 장치를 통해 투과하여 보고 있는 현실 세계에, 이동 중인 무 인 점포 차량의 위치를 증강현실로 표시하여 제공할 수 있다. 보다 구체적으로, 무인 점포 차량을 나타내는 아이콘을 무인 점포 차량이 오고 있는 방향에 증강현실로 표시하되, 증강현실 글래스 장치 와 무인 점포 차량 사이의 거리에 따라 아이콘의 크기를 변경하여 표시할 수 있다. 무인 점포 차량 이 증강현실 글래스 장치의 시야 또는 뷰 필드(view field)에 진입하면, 투과되어 보이는 현실 세계의 무 인 점포 차량 또는 그 주변에 아이콘을 표시할 수 있다. 이를 위해서, 증강현실 글래스 장치의 객체 인식 기능을 사용해 시야의 무인 점포 차량을 인식하여, 정확한 위치에 아이콘을 표시할 수 있다. 실시예 에 따라서는, 모바일 지도를 증강현실로 출력하고, 지도 위에 무인 점포 차량의 위치를 표시할 수도 있다. 한편, 단계 S400에서는, 증강현실 글래스 장치의 뷰 필드에 무인 점포 차량이 인식되면, 무인 점포 차량의 내부 영상, 무인 점포 차량의 서비스 제공 품목 및 재고 정보를 포함하는 군에서 선택된 적어 도 하나 이상을 증강현실로 출력할 수 있다. 즉, 증강현실 글래스 장치의 객체 인식 기능을 사용해 무인 점포 차량이 시야에 보이면, 해당 무인 점포 차량의 상세 정보를 증강현실로 출력할 수 있다. 도 4는 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법에서, 무인 점포 차량 인식 시 각종 정보가 증강현실로 표시되는 모습을 예를 들어 도시한 도면이다. 도 4에 도시된 바와 같이, 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주 행 무인 점포의 이용 방법의 단계 S400에서는, 증강현실 글래스 장치에서 시야를 통해 보이는 무인 점포 차량 주변에 해당 무인 점포 차량에서 제공하는 노래방 서비스에 대한 정보, 내부 CCTV 영상, 구매할 수 있는 음료 목록과 재고 수량 등을 증강현실로 표시할 수 있다. 또한, 실시예에 따라서는, 단계 S200에서 증강현실 글래스 장치와 매칭된 무인 점포 차량이 아니더라 도, 증강현실 글래스 장치의 시야에 진입한 무인 점포 차량의 서비스 제공 품목, 물품별 재고, 사용 이력 등의 상세 정보를 증강현실로 제공하여, 사용자가 시야에 있는 무인 점포 차량의 정보를 확인하고 선 택해 서비스를 이용할 수도 있다. 한편, 증강현실 글래스 장치에서 객체 인식 기능을 통해 단계 S200에서 매칭된 무인 점포 차량이 인 식되면, 무인 점포 차량의 내부 영상을 무인 점포 차량 위에 증강현실 영상으로 표시해 제공할 수도 있다. 따라서 사용자는 무인 점포 차량 내부에 입장하기 전에 증강현실 글래스 장치를 통해 내부 모 습 등을 쉽게 파악할 수 있다. 단계 S500에서는, 무인 점포 차량이 사용자 인증을 완료하고 문 잠금을 해제하여, 사용자의 입장 및 내부 의 무인 점포 시설 이용을 허용할 수 있다. 즉, 무인 점포 차량이 증강현실 글래스 장치의 위치에 도착하면, 사용자 인증 후 사용자가 차량 내부로 입장해 무인 점포 서비스를 이용할 수 있다. 여기서, 단계 S500에서는, 증강현실 글래스 장치의 위치 정보와 무인 점포 차량의 현재 위치 정보가 매칭되면 사용자 인증을 완료할 수 있다. 즉, 사용자 인증 방법으로, 증강현실 글래스 장치와 무인 점포 차량의 현재 위치 사이의 거리를 측정하고, 측정한 거리가 미리 정해진 값 이하이면 인증 성공으로 처리할 수 있다. 또한, 단계 S500에서는, 증강현실 글래스 장치의 위치 정보와 무인 점포 차량의 현재 위치 정보가 매 칭되고, 증강현실 글래스 장치에서 뷰 필드(view field)의 객체를 인식하여 인식한 객체가 단계 S200에서 매칭된 무인 점포 차량과 일치하면, 사용자 인증을 완료할 수 있다. 예를 들어, 무인 점포 차량의 외부에 부착된 번호판, 식별부호 등을 컴퓨터 비전 기술로 인식해 사용자 인증을 처리할 수 있다. 이와 같이, 위치 정보와 객체 인식을 모두 사용해 사용자 인증을 함으로써, 무인 점포 서비스를 요청한 증강현실 글래스 장 치를 착용한 사용자가 매칭된 무인 점포 차량을 이용할 수 있도록 인증 정확성을 높일 수 있다. 사용자 인증이 완료되면, 무인 점포 차량의 문 잠금이 해제되고 자동으로 도어가 개방될 수 있으며, 사용 자는 무인 점포 차량에 입장해 원하는 서비스를 이용할 수 있다. 단계 S600에서는, 사용자가 무인 점포 차량에서 나가고 무인 점포 서비스의 제공이 종료되면, 무인 점포 차량이 서비스 서버로부터 전달받은 이동 위치로 이동할 수 있다. 즉, 사용자의 무인 점포 서비스 이용이 종료되면, 무인 점포 차량은 도어를 닫고 안전한 운행을 위해 문을 잠근 다음, 다음 위치로 이동할 수 있다. 여기서, 다음 위치는 무인 점포 서비스를 요청한 다른 증강현실 글래스 장치의 위치나 교통이편리한 위치일 수 있으며, 서비스 이용자 발생 가능성이 높은 위치와 서비스별 무인 점포 차량의 지리적 배치를 고려하여 다음 목적지로의 이동이 용이할 것으로 예상되는 위치일 수도 있다. 보다 구체적으로, 단계 S600에서는, 서비스 서버는, 무인 점포 차량에서 제공하는 무인 점포 서비스 의 이용자 발생 현황, 교통 상황 및 다른 무인 점포 차량의 배치를 고려하여, 무인 점포 서비스의 제공이 종료된 무인 점포 차량의 이동 위치를 결정하여 전달할 수 있다. 한편, 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법은, 단계 S500과 단계 S600 사이에, 사용자의 무인 점포 시설 이용에 따라 증강현실 글래스 장치에 등 록된 결제 수단을 사용해 결제를 처리하는 단계(미도시)를 더 포함할 수 있다. 즉, 사용자가 무인 점포 서비스 를 이용하면서 물품을 구입하거나 서비스 대금을 지불하는 경우, 이에 따른 결제를 처리할 수 있다. 이때, 결 제 처리는, 증강현실 글래스 장치에 등록된 페이 서비스, 모바일 결제 서비스 등을 이용할 수 있으며, 사 용자가 서비스 서버에 미리 등록한 결제 정보를 이용할 수도 있다. 그밖에, 신용카드, 암호화폐, 쿠폰, 포인트 등 다양한 결제 수단을 사용해 결제를 처리할 수 있다. 전술한 바와 같이, 본 발명에서 제안하고 있는 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법에 따르면, 증강현실 글래스 장치에서 음성 명령을 통해 무인 점포 서비스를 선택하면, 해당 서비스를 제공할 수 있는 자율주행 무인 점포 차량이 매칭되어 증강현실 글래스 장치의 위치로 이동하고, 사용자 인증 완료 후 사용자가 무인 점포 차량에 입장해 시설을 이용함으로써, 증강현실 글래스 장치와 음성인식을 사용해 빠르고 편리하게 원하는 서비스를 제공받을 수 있고, 증강현실 글래스 장치 에서 무인 점포 차량의 실시간 위치 정보, 내부 영상, 서비스 제공 품목, 재고 정보 등을 증강현실로 제공해, 사용자가 무인 점포 차량 내부에 입장하기 전에도 쉽고 편리하게 해당 무인 점포 차량에 관 한 다양한 정보를 확인할 수 있다. 한편, 본 발명은 다양한 통신 단말기로 구현되는 동작을 수행하기 위한 프로그램 명령을 포함하는 컴퓨터에서 판독 가능한 매체를 포함할 수 있다. 예를 들어, 컴퓨터에서 판독 가능한 매체는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD_ROM, DVD와 같은 광기록 매체(optical media), 플롭티 컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 이와 같은 컴퓨터에서 판독 가능한 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합 하여 포함할 수 있다. 이때, 컴퓨터에서 판독 가능한 매체에 기록되는 프로그램 명령은 본 발명을 구현하기 위 하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 예를 들어, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해 실행될 수 있는 고급 언어 코드를 포함할 수 있다."}
{"patent_id": "10-2022-0100073", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 설명한 본 발명은 본 발명이 속한 기술분야에서 통상의 지식을 가진 자에 의하여 다양한 변형이나 응용이 가능하며, 본 발명에 따른 기술적 사상의 범위는 아래의 특허청구범위에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2022-0100073", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법 을 제공하는 시스템 구성을 도시한 도면. 도 2는 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법 의 흐름을 도시한 도면. 도 3은 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법 에서, 사용자가 무인 점포 서비스를 선택하는 모습을 예를 들어 도시한 도면. 도 4는 본 발명의 일실시예에 따른 증강현실 글래스 장치와 음성인식을 이용한 자율주행 무인 점포의 이용 방법 에서, 무인 점포 차량 인식 시 각종 정보가 증강현실로 표시되는 모습을 예를 들어 도시한 도면."}
