{"patent_id": "10-2022-0178219", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0096011", "출원번호": "10-2022-0178219", "발명의 명칭": "인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법 및 장치", "출원인": "씨제이올리브네트웍스 주식회사", "발명자": "임채국"}}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이미지 발화 영상 생성 장치에 의해 수행되는 이미지 발화 영상 생성 방법에 있어서, 얼굴 구성요소의 기준 위치가 정의된 사용자 정의 템플릿을 설정하는 단계; 상기 설정된 사용자 정의 템플릿을 기반으로 입력 이미지에서 얼굴 구성요소의 위치를 나타내는 얼굴 랜드마크(Landmark)를 생성하는 단계; 입력 음성과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를생성하는 단계; 및 상기 입력 이미지, 상기 입력 음성 및 상기 생성된 프레임별 얼굴 랜드마크를 이용해, 상기 입력 이미지에 대해상기 입력 음성에 따라 움직이는 이미지 발화 영상을 생성하는 단계를 포함하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 사용자 정의 템플릿을 설정하는 단계는, 사용자가 원하는 템플릿 이미지에 대한 얼굴 구성요소의 기준 위치를 이용하여 상기 사용자 정의 템플릿을 설정하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 사용자 정의 템플릿을 설정하는 단계는, 수집된 복수의 훈련 이미지에서 기학습된 랜드마크 생성 모델 기반으로 얼굴 구성요소를 검출하고, 상기 검출된얼굴 구성요소와 각각 이웃하는 이웃 구성요소 간의 거리 평균값을 기준값으로 설정하고, 상기 거리 평균값에가장 가까운 엣지 이미지의 얼굴 구성요소 위치를 상기 사용자 정의 템플릿의 얼굴 구성요소의 기준 위치로 설정하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 얼굴 랜드마크(Landmark)를 생성하는 단계는, 상기 입력 이미지가 사람 이미지인 경우 상기 사람 이미지의 얼굴 구성요소와 상기 설정된 사용자 정의 템플릿의 얼굴 구성요소를 매칭하여 좌표값을 삽입하고, 상기 입력 이미지가 사물 이미지인 경우 상기 설정된 사용자정의 템플릿의 얼굴 구성요소에 맞게 상기 사물 이미지에 얼굴 구성요소를 배정하여 좌표값을 삽입하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 얼굴 랜드마크(Landmark)를 생성하는 단계는, 상기 생성된 얼굴 랜드마크에서 오인식된 얼굴 구성요소의 위치가 확인된 경우, 상기 설정된 사용자 정의 템플릿을 기반으로 오인식된 얼굴 구성요소의 위치를 수정하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상생성 방법.공개특허 10-2024-0096011-3-청구항 6 제5항에 있어서, 상기 얼굴 랜드마크(Landmark)를 생성하는 단계는, 상기 입력 이미지에서 얼굴의 엣지(Edge)를 검출하고, 상기 입력 이미지를 상기 사용자 정의 템플릿의 얼굴 사이즈와 동일하게 재설정하고, 상기 검출된 얼굴의 엣지와 상기 사용자 정의 템플릿을 오버랩하여 오인식된 얼굴구성요소의 위치를 확인하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 얼굴 랜드마크(Landmark)를 생성하는 단계는, 상기 생성된 얼굴 랜드마크에서 얼굴 구성요소의 좌표값을 각각 클러스터링하여 클러스터링 중심값을 계산하고,상기 사용자 정의 템플릿의 얼굴 구성요소의 기준 위치를 상기 계산된 클러스터링 중심값에 위치시키고, 오인식된 얼굴 구성요소의 좌표값이 존재하는 경우 상기 오인식된 얼굴 구성요소의 좌표값을 상기 사용자 정의 템플릿에 정의된 얼굴 구성요소의 기준 위치로 수정하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 프레임별 얼굴 랜드마크를 생성하는 단계는, 상기 입력 음성에 대해 음성 딥뉴럴넷을 통해 음성 특성과 음성 내용 특징이 포함된 음성 특징을 추출하고, 상기 추출된 음성 특징과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를 생성하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 이미지 발화 영상을 생성하는 단계는, 상기 입력 이미지 내의 얼굴 이미지를 기설정된 삼각분할 방식에 따라 삼각분할하고, 상기 생성된 프레임별 얼굴 랜드마크에 따라 상기 삼각분할된 얼굴 이미지의 픽셀 위치를 변환하고, 상기 입력 음성의 음성 길이에 맞게위치 변환된 프레임을 생성하여 이미지 발화 영상을 생성하는, 인공지능 기반 랜드마크를 이용한 이미지 발화영상 생성 방법."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 입력 이미지와 연관된 입력 텍스트가 수신되는 경우, 상기 입력 텍스트를 음성으로 변환하는 단계를 더 포함하고, 상기 이미지 발화 영상을 생성하는 단계는, 상기 변환된 음성을 이용하여 상기 변환된 음성에 따라 움직이는 이미지 발화 영상을 생성하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "하나 이상의 프로그램을 저장하는 메모리; 및 상기 저장된 하나 이상의 프로그램을 실행하는 프로세서를 포함하고, 상기 프로세서는, 얼굴 구성요소의 기준 위치가 정의된 사용자 정의 템플릿을 설정하고, 공개특허 10-2024-0096011-4-상기 설정된 사용자 정의 템플릿을 기반으로 입력 이미지에서 얼굴 구성요소의 위치를 나타내는 얼굴 랜드마크(Landmark)를 생성하고, 입력 음성과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를생성하고, 상기 입력 이미지, 상기 입력 음성 및 상기 생성된 프레임별 얼굴 랜드마크를 이용해, 상기 입력 이미지에 대해상기 입력 음성에 따라 움직이는 이미지 발화 영상을 생성하는, 인공지능 기반 랜드마크를 이용한 이미지 발화영상 생성 장치."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 프로세서는, 사용자가 원하는 템플릿 이미지에 대한 얼굴 구성요소의 기준 위치를 이용하여 상기 사용자 정의 템플릿을 설정하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 프로세서는, 수집된 복수의 훈련 이미지에서 기학습된 랜드마크 생성 모델 기반으로 얼굴 구성요소를 검출하고, 상기 검출된얼굴 구성요소와 각각 이웃하는 이웃 구성요소 간의 거리 평균값을 기준값으로 설정하고, 상기 거리 평균값에가장 가까운 엣지 이미지의 얼굴 구성요소 위치를 상기 사용자 정의 템플릿의 얼굴 구성요소의 기준 위치로 설정하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 프로세서는, 상기 입력 이미지가 사람 이미지인 경우 상기 사람 이미지의 얼굴 구성요소와 상기 설정된 사용자 정의 템플릿의 얼굴 구성요소를 매칭하여 좌표값을 삽입하고, 상기 입력 이미지가 사물 이미지인 경우 상기 설정된 사용자정의 템플릿의 얼굴 구성요소에 맞게 상기 사물 이미지에 얼굴 구성요소를 배정하여 좌표값을 삽입하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 프로세서는, 상기 생성된 얼굴 랜드마크에서 오인식된 얼굴 구성요소의 위치가 확인된 경우, 상기 설정된 사용자 정의 템플릿을 기반으로 오인식된 얼굴 구성요소의 위치를 수정하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상생성 장치."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 프로세서는, 상기 입력 이미지에서 얼굴의 엣지(Edge)를 검출하고, 상기 입력 이미지를 상기 사용자 정의 템플릿의 얼굴 사이즈와 동일하게 재설정하고, 상기 검출된 얼굴의 엣지와 상기 사용자 정의 템플릿을 오버랩하여 오인식된 얼굴구성요소의 위치를 확인하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "공개특허 10-2024-0096011-5-제15항에 있어서, 상기 프로세서는, 상기 생성된 얼굴 랜드마크에서 얼굴 구성요소의 좌표값을 각각 클러스터링하여 클러스터링 중심값을 계산하고,상기 사용자 정의 템플릿의 얼굴 구성요소의 기준 위치를 상기 계산된 클러스터링 중심값에 위치시키고, 오인식된 얼굴 구성요소의 좌표값이 존재하는 경우 상기 오인식된 얼굴 구성요소의 좌표값을 상기 사용자 정의 템플릿에 정의된 얼굴 구성요소의 기준 위치로 수정하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서, 상기 프로세서는, 상기 입력 음성에 대해 음성 딥뉴럴넷을 통해 음성 특성과 음성 내용 특징이 포함된 음성 특징을 추출하고, 상기 추출된 음성 특징과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를 생성하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서, 상기 프로세서는, 상기 입력 이미지 내의 얼굴 이미지를 기설정된 삼각분할 방식에 따라 삼각분할하고, 상기 생성된 프레임별 얼굴 랜드마크에 따라 상기 삼각분할된 얼굴 이미지의 픽셀 위치를 변환하고, 상기 입력 음성의 음성 길이에 맞게위치 변환된 프레임을 생성하여 이미지 발화 영상을 생성하는, 인공지능 기반 랜드마크를 이용한 이미지 발화영상 생성 장치."}
{"patent_id": "10-2022-0178219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서, 상기 프로세서는, 상기 입력 이미지와 연관된 입력 텍스트가 수신되는 경우, 상기 입력 텍스트를 음성으로 변환하고, 상기 변환된음성을 이용하여 상기 변환된 음성에 따라 움직이는 이미지 발화 영상을 생성하는, 인공지능 기반 랜드마크를이용한 이미지 발화 영상 생성 장치."}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법 및 장치에 관한 것으로, 본 발명의 일 실시예에 따른 이미지 발화 영상 생성 방법은, 얼굴 구성요소의 기준 위치가 정의된 사용자 정의 템플릿을 설정 하는 단계, 상기 설정된 사용자 정의 템플릿을 기반으로 입력 이미지에서 얼굴 구성요소의 위치를 나타내는 얼굴 랜드마크(Landmark)를 생성하는 단계, 입력 음성과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를 생성하는 단계, 및 상기 입력 이미지, 상기 입력 음성 및 상기 생성된 프레 임별 얼굴 랜드마크를 이용해, 상기 입력 이미지에 대해 상기 입력 음성에 따라 움직이는 이미지 발화 영상을 생 성하는 단계를 포함한다."}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 이미지 발화 영상 생성 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "발화 얼굴 생성(Talking face generation)은 정적인 이미지와 음성을 입력하여 이미지에 있는 사람 얼굴의 눈, 코, 입을 검출함으로써, 발화를 할 수 있는 영상을 만드는 기술이다. 발화 얼굴 생성은 사람 얼굴뿐만 아니라 사물에 대해 눈, 코, 입 형상을 표현할 수 있으며, 자연스러운 발화를 할 수 있는 인공지능 기술이다. 즉, 사람 형태의 캐릭터 이미지를 발화하는 기술인 발화 얼굴 생성은 발화를 위한 음성을 이용하여 사람 이미지 가 발화하는 립싱크 영상을 생성하는 것이다. 종래 기술에서 이미지를 가지고 립싱크를 생성하는 기술은 정해진 형태 즉, 눈, 코, 입의 구조가 존재해야 하거 나, 사람 얼굴의 구조(예컨대, 눈, 코, 입)를 가진 이미지가 입력되어야 한다. 뿐만 아니라 이미지의 크기가 다 른 경우, 종래 기술은 사용자 얼굴의 눈, 코, 입의 정확한 위치를 검출하지 못할 수 있어서 부자연스러운 립싱"}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "크 영상이 생성되는 단점이 있다. 발명의 내용"}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 인공지능 기반으로 이미지 및 음성 파일을 활용하여 정적 이미지를 자연스러운 발화가 가 능한 이미지 발화 영상으로 생성하기 위한, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법 및 장치를 제공하고자 한다. 본 발명의 실시예들은 사람 이미지뿐만 아니라 사물 이미지에도 적용 가능하며, 잘못 검출된 눈, 코, 입의 위치 를 재 조정할 수 있는 사용자 정의 템플릿 방법을 제안함으로써, 자연스러운 이미지 발화 영상을 생성하기 위한, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법 및 장치를 제공하고자 한다. 다만, 본 발명의 해결하고자 하는 과제는 이에 한정되는 것이 아니며, 본 발명의 사상 및 영역으로부터 벗어나 지 않는 범위의 환경에서도 다양하게 확장될 수 있을 것이다."}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 이미지 발화 영상 생성 장치에 의해 수행되는 이미지 발화 영상 생성 방법에 있 어서, 얼굴 구성요소의 기준 위치가 정의된 사용자 정의 템플릿을 설정하는 단계; 상기 설정된 사용자 정의 템 플릿을 기반으로 입력 이미지에서 얼굴 구성요소의 위치를 나타내는 얼굴 랜드마크(Landmark)를 생성하는 단계; 입력 음성과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를 생성하는 단계; 및 상기 입력 이미지, 상기 입력 음성 및 상기 생성된 프레임별 얼굴 랜드마크를 이용해, 상기 입력 이미지에 대해 상기 입력 음성에 따라 움직이는 이미지 발화 영상을 생성하는 단계를 포함하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법이 제공될 수 있다. 상기 사용자 정의 템플릿을 설정하는 단계는, 사용자가 원하는 템플릿 이미지에 대한 얼굴 구성요소의 기준 위 치를 이용하여 상기 사용자 정의 템플릿을 설정할 수 있다. 상기 사용자 정의 템플릿을 설정하는 단계는, 수집된 복수의 훈련 이미지에서 기학습된 랜드마크 생성 모델 기 반으로 얼굴 구성요소를 검출하고, 상기 검출된 얼굴 구성요소와 각각 이웃하는 이웃 구성요소 간의 거리 평균 값을 기준값으로 설정하고, 상기 거리 평균값에 가장 가까운 엣지 이미지의 얼굴 구성요소 위치를 상기 사용자 정의 템플릿의 얼굴 구성요소의 기준 위치로 설정할 수 있다. 상기 얼굴 랜드마크(Landmark)를 생성하는 단계는, 상기 입력 이미지가 사람 이미지인 경우 상기 사람 이미지의 얼굴 구성요소와 상기 설정된 사용자 정의 템플릿의 얼굴 구성요소를 매칭하여 좌표값을 삽입하고, 상기 입력 이미지가 사물 이미지인 경우 상기 설정된 사용자 정의 템플릿의 얼굴 구성요소에 맞게 상기 사물 이미지에 얼 굴 구성요소를 배정하여 좌표값을 삽입할 수 있다. 상기 얼굴 랜드마크(Landmark)를 생성하는 단계는, 상기 생성된 얼굴 랜드마크에서 오인식된 얼굴 구성요소의 위치가 확인된 경우, 상기 설정된 사용자 정의 템플릿을 기반으로 오인식된 얼굴 구성요소의 위치를 수정할 수 있다. 상기 얼굴 랜드마크(Landmark)를 생성하는 단계는, 상기 입력 이미지에서 얼굴의 엣지(Edge)를 검출하고, 상기 입력 이미지를 상기 사용자 정의 템플릿의 얼굴 사이즈와 동일하게 재설정하고, 상기 검출된 얼굴의 엣지와 상 기 사용자 정의 템플릿을 오버랩하여 오인식된 얼굴 구성요소의 위치를 확인할 수 있다. 상기 얼굴 랜드마크(Landmark)를 생성하는 단계는, 상기 생성된 얼굴 랜드마크에서 얼굴 구성요소의 좌표값을 각각 클러스터링하여 클러스터링 중심값을 계산하고, 상기 사용자 정의 템플릿의 얼굴 구성요소의 기준 위치를 상기 계산된 클러스터링 중심값에 위치시키고, 오인식된 얼굴 구성요소의 좌표값이 존재하는 경우 상기 오인식 된 얼굴 구성요소의 좌표값을 상기 사용자 정의 템플릿에 정의된 얼굴 구성요소의 기준 위치로 수정할 수 있다. 상기 프레임별 얼굴 랜드마크를 생성하는 단계는, 상기 입력 음성에 대해 음성 딥뉴럴넷을 통해 음성 특성과 음 성 내용 특징이 포함된 음성 특징을 추출하고, 상기 추출된 음성 특징과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를 생성할 수 있다. 상기 이미지 발화 영상을 생성하는 단계는, 상기 입력 이미지 내의 얼굴 이미지를 기설정된 삼각분할 방식에 따 라 삼각분할하고, 상기 생성된 프레임별 얼굴 랜드마크에 따라 상기 삼각분할된 얼굴 이미지의 픽셀 위치를 변 환하고, 상기 입력 음성의 음성 길이에 맞게 위치 변환된 프레임을 생성하여 이미지 발화 영상을 생성할 수 있다. 상기 방법은, 상기 입력 이미지와 연관된 입력 텍스트가 수신되는 경우, 상기 입력 텍스트를 음성으로 변환하는 단계를 더 포함하고, 상기 이미지 발화 영상을 생성하는 단계는, 상기 변환된 음성을 이용하여 상기 변환된 음 성에 따라 움직이는 이미지 발화 영상을 생성할 수 있다. 한편, 본 발명의 다른 실시예에 따르면, 하나 이상의 프로그램을 저장하는 메모리; 및 상기 저장된 하나 이상의 프로그램을 실행하는 프로세서를 포함하고, 상기 프로세서는, 얼굴 구성요소의 기준 위치가 정의된 사용자 정의 템플릿을 설정하고, 상기 설정된 사용자 정의 템플릿을 기반으로 입력 이미지에서 얼굴 구성요소의 위치를 나타 내는 얼굴 랜드마크(Landmark)를 생성하고, 입력 음성과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를 생성하고, 상기 입력 이미지, 상기 입력 음성 및 상기 생성된 프레임 별 얼굴 랜드마크를 이용해, 상기 입력 이미지에 대해 상기 입력 음성에 따라 움직이는 이미지 발화 영상을 생 성하는, 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치가 제공될 수 있다. 상기 프로세서는, 사용자가 원하는 템플릿 이미지에 대한 얼굴 구성요소의 기준 위치를 이용하여 상기 사용자 정의 템플릿을 설정할 수 있다. 상기 프로세서는, 수집된 복수의 훈련 이미지에서 기학습된 랜드마크 생성 모델 기반으로 얼굴 구성요소를 검출 하고, 상기 검출된 얼굴 구성요소와 각각 이웃하는 이웃 구성요소 간의 거리 평균값을 기준값으로 설정하고, 상 기 거리 평균값에 가장 가까운 엣지 이미지의 얼굴 구성요소 위치를 상기 사용자 정의 템플릿의 얼굴 구성요소 의 기준 위치로 설정할 수 있다. 상기 프로세서는, 상기 입력 이미지가 사람 이미지인 경우 상기 사람 이미지의 얼굴 구성요소와 상기 설정된 사 용자 정의 템플릿의 얼굴 구성요소를 매칭하여 좌표값을 삽입하고, 상기 입력 이미지가 사물 이미지인 경우 상 기 설정된 사용자 정의 템플릿의 얼굴 구성요소에 맞게 상기 사물 이미지에 얼굴 구성요소를 배정하여 좌표값을 삽입할 수 있다. 상기 프로세서는, 상기 생성된 얼굴 랜드마크에서 오인식된 얼굴 구성요소의 위치가 확인된 경우, 상기 설정된 사용자 정의 템플릿을 기반으로 오인식된 얼굴 구성요소의 위치를 수정할 수 있다. 상기 프로세서는, 상기 입력 이미지에서 얼굴의 엣지(Edge)를 검출하고, 상기 입력 이미지를 상기 사용자 정의 템플릿의 얼굴 사이즈와 동일하게 재설정하고, 상기 검출된 얼굴의 엣지와 상기 사용자 정의 템플릿을 오버랩하 여 오인식된 얼굴 구성요소의 위치를 확인할 수 있다. 상기 프로세서는, 상기 생성된 얼굴 랜드마크에서 얼굴 구성요소의 좌표값을 각각 클러스터링하여 클러스터링 중심값을 계산하고, 상기 사용자 정의 템플릿의 얼굴 구성요소의 기준 위치를 상기 계산된 클러스터링 중심값에 위치시키고, 오인식된 얼굴 구성요소의 좌표값이 존재하는 경우 상기 오인식된 얼굴 구성요소의 좌표값을 상기 사용자 정의 템플릿에 정의된 얼굴 구성요소의 기준 위치로 수정할 수 있다. 상기 프로세서는, 상기 입력 음성에 대해 음성 딥뉴럴넷을 통해 음성 특성과 음성 내용 특징이 포함된 음성 특 징을 추출하고, 상기 추출된 음성 특징과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를 생성할 수 있다. 상기 프로세서는, 상기 입력 이미지 내의 얼굴 이미지를 기설정된 삼각분할 방식에 따라 삼각분할하고, 상기 생 성된 프레임별 얼굴 랜드마크에 따라 상기 삼각분할된 얼굴 이미지의 픽셀 위치를 변환하고, 상기 입력 음성의 음성 길이에 맞게 위치 변환된 프레임을 생성하여 이미지 발화 영상을 생성할 수 있다. 상기 프로세서는, 상기 입력 이미지와 연관된 입력 텍스트가 수신되는 경우, 상기 입력 텍스트를 음성으로 변환 하고, 상기 변환된 음성을 이용하여 상기 변환된 음성에 따라 움직이는 이미지 발화 영상을 생성할 수 있다."}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 기술은 다음의 효과를 가질 수 있다. 다만, 특정 실시예가 다음의 효과를 전부 포함하여야 한다거나 다 음의 효과만을 포함하여야 한다는 의미는 아니므로, 개시된 기술의 권리범위는 이에 의하여 제한되는 것으로 이 해되어서는 아니 될 것이다. 본 발명의 실시예들은 인공지능 기반으로 이미지 및 음성 파일을 활용하여 정적 이미지를 자연스러운 발화가 가 능한 이미지 발화 영상으로 생성할 수 있다.본 발명의 실시예들은 잘못 검출된 눈, 코, 입의 위치를 재 조정할 수 있는 사용자 정의 템플릿 방법을 제안함 으로써, 자연스러운 이미지 발화 영상을 생성할 수 있다. 본 발명의 일 실시예는 사용자 정의 템플릿 기반으로 오인식 랜드마크(눈, 코, 입)를 정확하게 수정할 수 있다. 본 발명의 일 실시예는 사용자 정의 템플릿 기반으로 입력한 이미지의 형태를 매칭하여 오 인식된 얼굴의 눈, 코, 입의 위치를 자동으로 수정할 수 있다. 본 발명의 일 실시예는 눈, 코, 입이 없는 사물에 대해서, 인공지능 기반으로 눈, 코, 입을 구성할 수 있으며, 이를 통해 자연스러운 발화 영상을 생성할 수 있다. 본 발명의 일 실시예는 애니매이션의 캐릭터 자유 발화 서비스, 광고 활용을 위한 광고 내 캐릭터 및 가상 인간 발화 서비스, 게임 캐릭터 활용을 위한 NPC 등의 발화 서비스, 가상 아나운서를 위한 가상인간의 정보 전달 서비스 등에 사용될 수 있다."}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 구체적으로 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 기술적 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이 해될 수 있다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들이 용어들에 의해 한정되 는 것은 아니다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 본 발명에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 본 발명에서 사용한 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용 어들을 선택하였으나 이는 당 분야에 종사하는 기술자의 의도, 판례, 또는 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분 에서 상세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용 어가 가지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 발명에서, \"포함하다\" 또 는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하, 본 발명의 실시예들을 첨부 도면을 참조하여 상세히 설명하기로 하며, 첨부 도면을 참조하여 설명함에 있 어, 동일하거나 대응하는 구성요소는 동일한 도면번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 본 발명의 일 실시예는 다음의 4 단계를 통해 수행될 수 있다. 본 발명의 일 실시예는 사용자 정의 템플릿 셋팅 단계를 수행할 수 있다. 여기서, 사용자 정의 템플릿 셋팅 단 계는 오인식된 얼굴 랜드마크(Landmark)의 수정을 위한 사용자 정의 템플릿을 생성할 수 있다. 그리고 본 발명의 일 실시예는 얼굴 인식을 위한 얼굴 랜드마크 생성 단계를 수행할 수 있다. 여기서, 얼굴 인 식을 위한 얼굴 랜드마크 생성 단계는 입력 이미지에 대해 얼굴의 구성요소(예컨대, 눈, 코, 입)에 대한 얼굴 랜드마크(좌표 값)를 생성할 수 있다. 이어서, 본 발명의 일 실시예는 오인식 랜드마크(눈, 코, 입)에 대한 수정 단계를 수행할 수 있다. 여기서, 오 인식 랜드마크(눈, 코, 입)에 대한 수정 단계는 입력 이미지에 대해 얼굴 엣지를 검출하고, 사이즈의 재 조정을 수행할 수 있다. 오인식 랜드마크(눈, 코, 입)에 대한 수정 단계는 사용자 정의 템플릿 기반으로 얼굴 랜드마크 (좌표값)를 수정할 수 있다. 이후, 본 발명의 일 실시예는 영상 생성 단계를 수행할 수 있다. 여기서, 영상 생성 단계는 상기 완료된 이미지 와 음성 파일 기반으로 얼굴 휨(face warp) 동작을 수행하고 이미지 발화 영상을 생성할 수 있다. 본 발명의 일 실시예에서는 사람의 형태 뿐만 아니라, 사물에 대해서 적용가능하다. 본 발명의 일 실시예는 사 용자 정의 템플릿 기반으로 입력한 이미지의 형태를 매칭하여 오 인식된 얼굴의 눈, 코, 입의 위치를 자동으로 수정할 수 있다. 특히, 본 발명의 일 실시예는 눈, 코, 입이 없는 사물에 대해서, 인공지능 기반으로 눈, 코, 입을 구성할 수 있으며, 이를 통해 자연스러운 발화 영상을 생성할 수 있다. 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 서비스는 애니매이션의 캐릭터 자유 발화 서비스, 광고 활용을 위한 광고 내 캐릭터 및 가상인간 발화 서비스, 게임 캐릭터 활 용을 위한 NPC 등의 발화 서비스, 가상 아나운서를 위한 가상인간의 정보 전달 서비스 등에 사용될 수 있 다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법을 나타낸 흐 름도이다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생 성 방법은 이미지 발화 영상 생성 장치에 의해 수행될 수 있으며, 사전 셋팅(Pre-setting) 단계, 제1 단계 (first phase) 및 제2 단계(second phase)로 이루어질 수 있다. 단계 S101에서, 이미지 발화 영상 생성 장치는 사전 셋팅(Pre-setting) 단계로서, 사용자 정의 템플릿을 설정할 수 있다. 사전 셋팅(Pre-setting) 단계는 입력값을 전달하기 전 단계로 사용자에 의해 사용자 정의 템플릿을 설 정한다. 여기서, 사용자 정의 템플릿은 본 발명의 일 실시예에서 중요 요소로 얼굴의 구성요소(눈, 코, 입)의 얼굴 랜드마크를 자동으로 수행하기 위한 기준 템플릿이다. 사전 셋팅 단계에서 정의한 사용자 정의 템플릿은 오인식된 좌표값의 거리를 수정할 수 있으며, 특히 입 모양의 자연스러운 발화를 위한 사전정의 데이터이다. 그리고 이미지 발화 영상 생성 장치는 단계 S102 내지 S106을 통해 입력 이미지에 대한 얼굴 랜드마크를 생성하 고 오인식을 수정하는 제1 단계(first phase)를 수행할 수 있다. 단계 S102에서, 이미지 발화 영상 생성 장치는 입력 이미지 및 입력 음성을 입력받는다. 단계 S103에서, 이미지 발화 영상 생성 장치는 입력 이미지를 전처리한다. 일례로, 이미지 발화 영상 생성 장치 는 입력 이미지의 사이즈를 계산하고, 입력 이미지 내에서 얼굴을 인식하여 눈, 코, 입의 위치를 파악할 수 있다. 단계 S104에서, 이미지 발화 영상 생성 장치는 사전 훈련된 얼굴 검출 모델을 통해 얼굴의 눈, 코, 입을 검출하 고 랜드마크(좌표값: points)를 계산할 수 있다. 다음으로, 이미지 발화 영상 생성 장치는 잘못 인식된 얼굴 랜드마크의 눈, 코, 입에 대한 좌표에 대한 수정 단 계를 수행할 수 있다. 단계 S105에서, 이미지 발화 영상 생성 장치는 얼굴 랜드마크의 좌표값을 확인하여 오인식된 얼굴 랜드마크의 좌표가 있는지를 확인할 수 있다. 단계 S106에서, 이미지 발화 영상 생성 장치는 사용자 정의 템플릿 기반으로 얼굴 랜드마크의 좌표값을 수정할 수 있다. 일례로, 이미지 발화 영상 생성 장치는 입력된 입력 이미지의 얼굴의 엣지를 검출하고, 사용자 정의 템플릿의 얼굴 사이즈와 동일하게 재설정한다. 그리고 이미지 발화 영상 생성 장치는 검출된 엣지와 사용자 정 의 템플릿을 오버랩한다. 이어서, 이미지 발화 영상 생성 장치는 오버랩된 입력 이미지의 눈, 코, 입을 잘못 인 식된 랜드마크 (좌표값)으로 수정할 수 있다. 한편, 이미지 발화 영상 생성 장치는 단계 S107 내지 S110을 통해 입력 이미지 및 입력 음성 데이터 기반으로 이미지 발화 영상을 생성하는 제2 단계(second phase)를 수행할 수 있다. 단계 S107에서, 이미지 발화 영상 생성 장치는 입력 이미지, 수정된 얼굴 랜드마크 및 입력 음성을 입력받고, 입력 이미지에 대해 프레임별 랜드마크를 생성한다. 즉, 이미지 발화 영상 생성 장치는 화자 랜드마크 애니메이 션(Speaker landmark animation) 단계를 수행할 수 있다. 단계 S108에서, 이미지 발화 영상 생성 장치는 얼굴 휨(Face warp) 단계를 수행할 수 있다. 단계 S109에서, 이미지 발화 영상 생성 장치는 모델 추론(Model Inference) 단계를 수행할 수 있다. 단계 S110에서, 이미지 발화 영상 생성 장치는 이미지 발화 영상을 생성할 수 있다. 생성된 이미지 발화 영상은 공유 볼륨에 파일(.mp4)로 저장될 수 있다. 한편, 사용자 정의 템플릿 구성은 직접 선택과 간접 선택에 의한 사용자 정의 템플릿으로 구성할 수 있다. 사용자의 직접 선택에 의한 사용자 정의 템플릿의 직접 선택 동작을 살펴보면 다음과 같다. 사용자는 사용자 선택에 의한 사용자 정의 템플릿을 직접 셋팅할 수 있다. 사용자가 원하는 이미지(예컨대, 특 정 가수나 특정 배우와 같은 원하는 이미지)를 기반으로 해당 얼굴의 눈, 코, 입 위치를 활용할 수 있다. 다음으로, 사용자의 간접 선택에 의한 사용자 정의 템플릿의 간접 선택 동작을 살펴보면 다음과 같다. 도 2는 본 발명의 일 실시예에 따른 사용자 정의 템플릿 생성 방법을 나타낸 흐름도이다. 단계 S201에서, 이미지 발화 영상 생성 장치는 이미지 데이터를 수집한다. 여기서, 이미지 데이터는 사용자 정 의 템플릿 생성을 위한 것으로 약 1,000장이 될 수 있으나, 특정 개수로 한정되지 않는다. 단계 S202에서, 이미지 발화 영상 생성 장치는 수집된 이미지 데이터에서 랜드마크 모델 기반으로 얼굴의 눈, 코, 입을 검출한다. 단계 S203에서, 이미지 발화 영상 생성 장치는 검출된 얼굴의 랜드마크에서 이웃된 좌표값 간의 거리를 계산한 다. 단계 S204에서, 이미지 발화 영상 생성 장치는 계산된 거리의 평균값에 가장 가까운 엣지 이미지를 선택하고, 평균 좌표값을 저장하여 사용자 정의 템플릿을 생성할 수 있다. 도 3 내지 도 6은 본 발명의 일 실시예에 따른 사용자 정의 템플릿 생성 방법의 예시를 나타낸 도면이다. 도 3 내지 도 6에는 간접 선택에 의한 자동 사용자 정의 템플릿의 구성 방법에 대한 예시가 나타나 있다. 도 3에는 이미지 수집 및 정제 단계(S201)가 도시되어 있다. 이미지 발화 영상 생성 장치는 이미지를 최소 1,000장 이상의 이미지 데이터를 수집할 수 있다. 여기서, 이미지는 정면을 바라보거나 전체 이미지에서 얼굴에 해당하는 부분만 필터링될 수 있다. 그리고 이미지 발화 영상 생성 장치는 수집된 이미지의 특정 사이즈를 정의하여 재 설정한다. 본 발명의 일 실 시예에서는 256×256 사이즈로 설정할 수 있다. 여기서, 이미지 사이즈는 사용자 정의에 의해 자유롭게 변경 가 능하다. 이어서, 이미지 발화 영상 생성 장치는 랜드마크 생성 모델(예컨대, Retinaface) 기반으로 이미지에서 얼굴의 눈, 코, 입을 검출할 수 있다. 도 4에는 랜드마크 모델 기반 눈, 코, 입 검출 단계(S202) 및 얼굴 구성요소 번호 부여 단계가 도시되어 있다. 이미지 발화 영상 생성 장치는 검출한 눈, 코, 입에 대해 정의된 번호 순서대로 각각 부여하고, 하기의 [수학식 1]을 이용하여 이웃된 번호에 대한 거리를 계산할 수 있다. 이후, 이미지 발화 영상 생성 장치는 평균 을 기준값(threshold)으로 설정할 수 있다. 여기서, 기준값은 얼굴 랜드마크의 수정시 사용될 수 있다. 수학식 1"}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, 거리는 이웃된 번호에 대한 거리를 나타내고, a1, a2, b1, b2는 이웃된 번호에 대한 x축 및 y축 좌표값 을 나타낸다. 도 5에는 이웃된 번호 좌표에 대한 거리 계산 단계(S203)가 도시되어 있다. 이미지 발화 영상 생성 장치는 모든 이미지에 대해 얼굴의 눈, 코, 입 별로 번호가 부여된 이웃된 좌표값 간의 거리를 계산한다. 도 5에 도시된 바와 같이, 이미지가 1000장인 경우, 이미지 1부터 이미지 1000인 1000장 모두에 대해 왼쪽 눈, 오른쪽 눈, 코, 입에 대한 좌표값 간의 거리 계산을 통해 왼쪽 눈, 오른쪽 눈, 코, 입에 대한 평균을 평균 계산 결과로 계산할 수 있다. 도 6에는 엣지 이미지 선택 및 좌표값을 가진 템플릿 저장 단계(S204)가 도시되어 있다. 이미지 발화 영상 생성 장치는 계산된 모든 거리 값에 평균을 평균 계산 결과로 계산하고, 평균값에 가장 가까운 엣지 이미지를 선택하고, 좌표값을 가진 사용자 정의 템플릿을 저장할 수 있다. 도 7은 본 발명의 일 실시예에 따른 이미지 전처리 및 랜드마크 생성, 수정 과정을 나타낸 흐름도이다. 단계 S301에서, 이미지 발화 영상 생성 장치는 사전에 정의된 사용자 정의 템플릿을 불러온다. 단계 S302에서, 이미지 발화 영상 생성 장치는 입력 이미지 및 입력 음성을 입력받는다. 단계 S303에서, 이미지 발화 영상 생성 장치는 입력 이미지에 대해 리사이즈 동작을 수행한다. 예를 들어, 이미 지 발화 영상 생성 장치는 입력 이미지의 전처리를 위해, 이미지 전체 크기를 계산하고 256×256로 리사이즈할 수 있다. 본 발명의 일 실시예에서 사용한 사이즈는 256×256이며, 사용자 정의에 의해 사이즈 설정이 가능하다. 그리고 이미지 발화 영상 생성 장치는 얼굴 랜드마크 생성 및 이상 유무 확인 단계를 수행할 수 있다. 단계 S304에서, 이미지 발화 영상 생성 장치는 얼굴 랜드마크의 좌표값을 계산한다. 여기서, 이미지 발화 영상 생성 장치는 사전정의된 눈, 코, 입 모델(예컨대, Retinaface 활용)에 의해 임의의 좌표를 부여한다. 단계 S305에서, 이미지 발화 영상 생성 장치는 생성된 얼굴 랜드마크 내에서 눈, 코, 입에 각각 부여된 좌표값 의 거리값을 계산한다. 단계 S306에서, 이미지 발화 영상 생성 장치는 얼굴 랜드마크의 좌표값을 확인한다. 단계 S307에서, 이미지 발화 영상 생성 장치는 이웃된 번호 간의 거리값이 기준값(threshold) 이상인지를 확인 한다. 여기서, 이미지 발화 영상 생성 장치는 이웃된 번호 간의 거리값이 기준값 이상일 경우 오 인식 좌표로 설정한다. 기준값은 사용자 정의 템플릿에서 계산된 이웃간 좌표값의 거리 평균으로 설정될 수 있다. 기준값은 상기 사용자 정의 템플릿에서 정의될 수 있다. 단계 S308에서, 이미지 발화 영상 생성 장치는 이웃된 번호 간의 거리값이 기준값 이상일 경우 사용자 정의 템 플릿 기반 랜드마크 좌표 수정 단계를 수행할 수 있다. 일례로, 이미지 발화 영상 생성 장치는 사용자 정의 템플릿과 얼굴 랜드마크가 표기된 입력 이미지와 매칭시켜 눈, 코, 입의 구조를 비교한다. 그리고 이미지 발화 영 상 생성 장치는 사용자 정의 템플릿 구조에 맞게 번호의 순서와 길이에 맞게 포인트를 재배치한다. 여기서, 입 력 이미지가 사람 이미지의 경우, 이미지 발화 영상 생성 장치는 눈, 코, 입을 매칭하여 좌표값을 자동으로 수 정할 수 있다. 입력 이미지가 사물 이미지의 경우, 이미지 발화 영상 생성 장치는 사용자 정의 템플릿에 맞게 임의로 눈, 코, 입의 위치를 배정하여 좌표를 삽입할 수 있다. 이후, 단계 S309에서, 이미지 발화 영상 생성 장치는 얼굴 랜드마크의 좌표값을 저장한다. 단계 S307에서 이웃 된 번호 간의 거리값이 기준값 미만일 경우, 이미지 발화 영상 생성 장치는 단계 S309를 수행한다. 도 8은 본 발명의 일 실시예에 따른 사전 정의한 랜드마크 템플릿 기반 자동 좌표 수정 방법을 나타낸 흐름도이 다. 도 8에 도시된 사전 정의한 랜드마크 템플릿 기반 자동 좌표 수정 방법은 좌표값을 오 인식한 경우에 수행될 수 있다. 단계 S401에서, 이미지 발화 영상 생성 장치는 입력 이미지를 입력받는다. 단계 S402에서, 이미지 발화 영상 생성 장치는 입력된 얼굴 랜드마크 기반으로 왼쪽 눈, 오른쪽 눈, 코, 입의 좌표값을 클러스터링 하여 중심 값을 계산한다. 단계 S403에서, 이미지 발화 영상 생성 장치는 사용자 정의 템플릿의 눈, 코, 입을 클러스터링 중심값으로 배치 한다. 단계 S404에서, 이미지 발화 영상 생성 장치는 오인식 좌표가 존재하는지를 확인한다. 단계 S405에서, 이미지 발화 영상 생성 장치는 오인식 좌표가 존재하는 경우, 수동으로 좌표값을 수정한다. 단계 S406에서, 이미지 발화 영상 생성 장치는 재 정의된 좌표값(포인트)을 저장한다. 단계 S405에서 오인식 좌 표가 존재하지 않는 경우, 이미지 발화 영상 생성 장치는 단계 S406을 수행한다. 도 9는 본 발명의 일 실시예에 따른 도 8의 정의한 템플릿 기반 랜드마크 좌표 수정 과정의 예시를 나타낸 도면 이다. 도 9에는 정의한 템플릿 기반 랜드마크 좌표 수정 과정이 도시되어 있다. 템플릿 기반 랜드마크 좌표 수정 과정 은 좌표값을 오 인식한 경우에 수행될 수 있다. 이미지 발화 영상 생성 장치는 사용자가 입력한 입력 이미지에서 이미 검출한 얼굴 랜드마크를 기반으로 눈, 코, 입의 좌표값을 클러스터링 한다. 클러스터링 계산 예시가 도 9에 도시되어 있다. 그리고 이미지 발화 영상 생성 장치는 왼쪽 눈, 오른쪽 눈, 코, 입에 대해 각각 클러스터링 중심값을 계산한다. 이어서, 이미지 발화 영상 생성 장치는 사용자 정의 템플릿의 평균 계산된 눈, 코, 입을 클러스터링 계산 예시에 계산된 각각의 중심값에 위치시킨다. 이후, 이미지 발화 영상 생성 장치는 클러스터링 계산 예시에 계산된 각각의 중심값에 위치시킨 눈, 코, 입에 대해 각각 번호와 좌표값을 부여하고 저장한다. 그리고 이미지 발화 영상 생성 장치는 만약 오인식 좌표가 존재하는 경우, 수동으로 수정하여 재 정의된 이미지 의 좌표값을 저장한다. 도 10은 본 발명의 일 실시예에 따른 얼굴 휨 및 말하는 영상 생성 과정을 나타낸 흐름도이다. 우선, 이미지 발화 영상 생성 장치는 화자 랜드마크 애니메이션(Speaker landmark animation) 과정을 수행한다. 이미지 발화 영상 생성 장치는 음성 딥뉴럴넷 모델에 입력 음성을 입력으로 넣는다. 단계 S501에서, 이미지 발화 영상 생성 장치는 음성 딥뉴럴넷을 통해 음성 특성과 음성 내용 특징 즉, 음성 특 징을 추출한다. 그리고 이미지 발화 영상 생성 장치는 추출된 음성 특징과 얼굴 랜드마크를 생성 딥뉴럴넷에 입력으로 넣는다. 이후, 단계 S502에서, 이미지 발화 영상 생성 장치는 음성 특징과 얼굴 랜드마크를 이용해 입력 음성에 따른 움 직이는 랜드마크 프레임을 생성 딥뉴럴넷을 통해 프레임 별로 생성한다.다음으로, 이미지 발화 영상 생성 장치는 얼굴 휨(Face warp) 과정을 수행한다. 이미지 발화 영상 생성 장치는 입력 이미지를 입력받고, 입력 이미지에 얼굴 랜드마크 포인트를 찍는다. 단계 S503에서, 이미지 발화 영상 생성 장치는 삼각분할 방식(예컨대, 들로네 삼각분할(Delaunay triangulation) 등)을 통해 얼굴을 얼굴 랜드마크에 따라 분할할 수 있다. 단계 S504에서, 이미지 발화 영상 생성 장치는 삼각분할 된 픽셀 전체를 랜드마크 프레임에 따라서 위치 변환한 다. 단계 S505에서, 이미지 발화 영상 생성 장치는 입력 음성의 음성 길이에 맞게 위치 변환된 프레임을 생성한다. 단계 S506에서, 이미지 발화 영상 생성 장치는 이미지 발화 영상을 생성한다. 예를 들면, 이미지 발화 영상 생 성 장치는 이미지 발화 영상을 mp4 포맷의 결과 영상으로 생성할 수 있다. 도 11 내지 도 13은 본 발명의 일 실시예에 따른 사용자 정의 템플릿 기반 랜드마크 수정 결과를 나타낸 도면이 다. 도 11에는 얼굴 랜드마크의 생성 이미지가 도시되어 있다. 얼굴 랜드마크의 생성 이미지에는 얼굴의 눈, 코, 입에 맞게 각각 부여되어 생성된 점, 위치를 변경할 점, 위치가 변경된 점이 표시되어 있다. 도 12에는 얼굴 랜드마크의 좌표값이 사전에 저장된 사용자 정의 템플릿 이미지가 도시되어 있다. 도 13에는 얼굴 랜드마크의 생성 이미지가 사용자 정의 템플릿 이미지 기반으로 수정된 얼굴 랜드마 크의 수정 이미지가 도시되어 있다. 수정된 얼굴 랜드마크의 수정 이미지에서 도 11에 도시된 생성된 점은 동일하다. 반면, 도 11에서의 위치를 변경할 점 및 위치가 변경된 점은 도 13에서는 사용자 정의 템 플릿 이미지 기반으로 수정된 지점에 위치하고 있다. 도 14 및 도 15는 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 서비스 를 위한 서비스 메인 UI 예시를 나타낸 도면이다. 도 14에는 이미지 발화 영상 생성 서비스를 위한 서비스 메인 UI가 도시되어 있다. 메인화면 예시에는 이 미지 파일을 파일 선택하여 입력할 수 있는 이미지 데이터 입력 항목과, 음성 파일을 파일 선택하여 입력할 수 있는 음성 데이터 입력 항목이 포함되어 있다. 그리고 사용자가 이미지 파일을 입력한 경우 입력된 현재 이미지 가 표시될 수 있다. 도 15에는 이미지 발화 영상 생성 서비스를 위한 서비스 메인 UI에 이미지 파일과 음성 파일을 입력한 예 시가 도시되어 있다. 일례로, 사용자가 이미지 파일인 monalisa2.jpg 파일과 음성 파일인 monalisa2.wav 파일을 서비스 메인 UI를 통해 입력한 경우, monalisa2.jpg 파일에 해당하는 이미지가 현재 이미지로 표시될 수 있다. 도 16 및 도 17은 본 발명의 일 실시예에 따른 이미지 발화 영상 생성 결과 예시를 나타낸 도면이다. 도 16 및 도 17에는 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 결과 가 도시되어 있다. 도 16에는 입력 이미지가 사람 이미지인 경우에 생성된 이미지 발화 영상의 캡처 화면이 도시되어 있다. 일례로, 입력 이미지가 모나리자 이미지인 경우, 이미지 발화 영상 생성 장치에 의해 생성된 모나리자의 이미지 발화 영상은 재생 버튼이 클릭되면 입력 음성에 따라 움직일 수 있다. 도 17에는 입력 이미지가 사물 이미지인 경우에 생성된 이미지 발화 영상의 캡처 화면이 도시되어 있다. 일례로, 입력 이미지가 차가 담긴 찻잔 이미지인 경우, 이미지 발화 영상 생성 장치에 의해 생성된 찻잔 이미지 의 이미지 발화 영상은 재생 버튼이 클릭되면 입력 음성에 따라 움직일 수 있다. 여기서, 입력 이미지의 찻잔 이미지에 사용자 정의 템플릿 기반으로 얼굴의 눈, 코, 입이 생성되고, 찻잔에 생성된 눈, 코, 입이 입력 음성에 따라 움직이는 것을 확인할 수 있다. 한편, 본 발명의 일 실시예는 사용자가 SNS(Social Network / Networking Service) 등에 업로드 하는 컨텐츠 제작에도 활용될 수 있다. 변형 실시예로서, 이미지 발화 영상 생성 장치는 사용자의 휴대폰 카메라와 연결될 수 있다. 사용자가 사진을 촬영한 후, 촬영된 사진의 이미지 발화 영상 생성을 위해 글을 쓰면, 촬영된 사진과 글이 통신망을 통해 이미 지 발화 영상 생성 장치로 전달될 수 있다. 이미지 발화 영상 생성 장치는 전달된 그 글을 읽어서 음성으로 변환할 수 있다. 그리고 이미지 발화 영상 생성 장치는 촬영된 사진, 변환된 음성 및 프레임별 얼굴 랜드마크를 이용해, 촬영된 사진에 대해 변환된 음성에 따 라 움직이는 이미지 발화 영상 즉, 말하는 컨텐츠를 생성할 수 있다. 여기서, 사용자는 생성된 말하는 컨텐츠를 이미지 발화 영상 생성 장치를 통해 SNS에 업로드 시킬 수 있다. 또 는, 사용자는 이미지 발화 영상 생성 장치로부터 사용자 단말을 통해 말하는 컨텐츠를 수신하고, 수신된 말하는 컨텐츠를 SNS에 업로드 시킬 수 있다. 도 18은 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 시스템의 구성을 나타낸 도면이다. 도 18에 도시된 바와 같이, 본 발명의 일 실시예에 따른 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 시스템은 서비스 웹, 프론트 서버, 벡엔드 서버 및 공유 볼 륨을 포함한다. 그러나 도시된 구성요소 모두가 필수 구성요소인 것은 아니다. 도시된 구성요소보다 많은 구성요소에 의해 이미지 발화 영상 생성 시스템이 구현될 수도 있고, 그보다 적은 구성요소에 의해서도 이미지 발화 영상 생성 시스템이 구현될 수 있다. 이하, 도 18의 이미지 발화 영상 생성 시스템의 각 구성요소들의 구체적인 구성 및 동작을 설명한다. 서비스 웹은 사용자가 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 서비스를 이용할 수 있는 서비스 화면이다. 프론트 서버는 사용자로부터 입력 이미지 및 입력 음성이 포함된 데이터를 입력받을 수 있다. 사용자는 사용자 단말을 통해 서비스 웹에 접속할 수 있다. 프론트 서버는 웹 기반 서비스를 제공하기 위한 전달 기능과 사용자로부터 전달받은 데이터(이미지, 음 성)를 백엔드 서버에 전달하는 기능을 가진다. 여기서, 프론트 서버는 내부 보안으로 인한 접근 제어 될 수 있다. 벡엔드 서버는 프론트 서버로부터 전달받은 입력 데이터를 기반으로 인공지능 모델을 활용하여 얼굴 랜드마크의 좌표값(포인트)을 계산하는 기능(제1 단계)와 이미지 발화 영상을 생성하는 기능(제2 단계)을 수행 할 수 있다. 여기서, 벡엔드 서버는 얼굴 랜드마크의 좌표값(포인트)을 계산하는 기능(제1 단계)을 수행하 는 제1 벡엔드 서버와 이미지 발화 영상을 생성하는 기능(제2 단계)을 수행하는 제2 벡엔드 서버로 구성될 수 있다. 공유 볼륨은 사용자 정의 템플릿, 입력 이미지, 계산된 랜드마크 포인터 지점의 좌표값을 저장하며, 생성 한 이미지 발화 영상을 저장하는 기능을 수행한다. 이와 같이, 본 발명의 일 실시예에 따른 이미지 발화 영상 생성 시스템은 인공지능 기반 랜드마크를 이용한 이 미지 발화 영상 생성 서비스 하기 위해, 서비스 웹, 프론트 서버, 벡엔드 서버 및 데이터 관리 서버인 공유 볼륨을 기반으로 시스템을 구성할 수 있다. 도 19는 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치의 구성도이 다. 도 19에 도시된 바와 같이, 본 발명의 일 실시예에 따른 이미지 발화 영상 생성 장치는 메모리 및 프 로세서를 포함한다. 그러나 도시된 구성요소 모두가 필수 구성요소인 것은 아니다. 도시된 구성요소보다 많은 구성요소에 의해 이미지 발화 영상 생성 장치가 구현될 수도 있고, 그보다 적은 구성요소에 의해서도 이미지 발화 영상 생성 장치가 구현될 수 있다. 본 발명의 일 실시예에 따른 이미지 발화 영상 생성 장치는 인공지능 기반 랜드마크를 이용한 이미지 발화 영상을 생성하는 전반적인 기능을 수행하는 장치이다. 구현예로서, 본 발명의 일 실시예에 따른 이미지 발화 영 상 생성 장치는 도 18의 벡엔드 서버에 포함되어 구현될 수 있다. 또는, 본 발명의 일 실시예에 따른 이미지 발화 영상 생성 장치는 벡엔드 서버 및 공유 볼륨에 포함되어 구현될 수 있으며, 특정 장치, 특정 서버, 특정 시스템 구조로 한정되지 않고, 이미지 발화 영상을 생성하는 전반적인 기능을 수행하는 장치로 구현될 수 있다. 이하, 도 19의 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치의 각 구성요소들의 구체적인 구성 및 동작을 설명한다. 메모리는 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 동작과 관련된 하나 이상의 프로그램을 저장한다. 프로세서는 메모리에 저장된 하나 이상의 프로그램을 실행한다. 프로세서는 얼굴 구성요소의 기준 위치가 정의된 사용자 정의 템플릿을 설정하고, 설정된 사용자 정의 템 플릿을 기반으로 입력 이미지에서 얼굴 구성요소의 위치를 나타내는 얼굴 랜드마크(Landmark)를 생성하고, 입력 음성과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를 생성하 고, 입력 이미지, 상기 입력 음성 및 상기 생성된 프레임별 얼굴 랜드마크를 이용해, 입력 이미지에 대해 입력 음성에 따라 움직이는 이미지 발화 영상을 생성한다. 실시예들에 따르면, 프로세서는 사용자가 원하는 템플릿 이미지에 대한 얼굴 구성요소의 기준 위치를 이용 하여 상기 사용자 정의 템플릿을 설정할 수 있다. 실시예들에 따르면, 프로세서는 수집된 복수의 훈련 이미지에서 기학습된 랜드마크 생성 모델 기반으로 얼 굴 구성요소를 검출하고, 검출된 얼굴 구성요소와 각각 이웃하는 이웃 구성요소 간의 거리 평균값을 기준값으로 설정하고, 계산된 거리 평균값에 가장 가까운 엣지 이미지의 얼굴 구성요소 위치를 사용자 정의 템플릿의 얼굴 구성요소의 기준 위치로 설정할 수 있다. 실시예들에 따르면, 프로세서는 입력 이미지가 사람 이미지인 경우 사람 이미지의 얼굴 구성요소와 설정된 사용자 정의 템플릿의 얼굴 구성요소를 매칭하여 좌표값을 삽입하고, 입력 이미지가 사물 이미지인 경우 설정된 사용자 정의 템플릿의 얼굴 구성요소에 맞게 사물 이미지에 얼굴 구성요소를 배정하여 좌표값을 삽입할 수 있다. 실시예들에 따르면, 프로세서는 생성된 얼굴 랜드마크에서 오인식된 얼굴 구성요소의 위치가 확인된 경우, 설정된 사용자 정의 템플릿을 기반으로 오인식된 얼굴 구성요소의 위치를 수정할 수 있다. 실시예들에 따르면, 프로세서는 입력 이미지에서 얼굴의 엣지(Edge)를 검출하고, 입력 이미지를 상기 사용 자 정의 템플릿의 얼굴 사이즈와 동일하게 재설정하고, 검출된 얼굴의 엣지와 사용자 정의 템플릿을 오버랩하여 오인식된 얼굴 구성요소의 위치를 확인할 수 있다. 실시예들에 따르면, 프로세서는 생성된 얼굴 랜드마크에서 얼굴 구성요소의 좌표값을 각각 클러스터링하여 클러스터링 중심값을 계산하고, 사용자 정의 템플릿의 얼굴 구성요소의 기준 위치를 상기 계산된 클러스터링 중 심값에 위치시키고, 오인식된 얼굴 구성요소의 좌표값이 존재하는 경우 오인식된 얼굴 구성요소의 좌표값을 사 용자 정의 템플릿에 정의된 얼굴 구성요소의 기준 위치로 수정할 수 있다. 실시예들에 따르면, 프로세서는 입력 음성에 대해 음성 딥뉴럴넷을 통해 음성 특성과 음성 내용 특징이 포 함된 음성 특징을 추출하고, 추출된 음성 특징과 생성된 얼굴 랜드마크를 이용해 입력 음성에 따라 움직이는 프 레임별 얼굴 랜드마크를 생성할 수 있다. 실시예들에 따르면, 프로세서는 입력 이미지 내의 얼굴 이미지를 기설정된 삼각분할 방식에 따라 삼각분할 하고, 생성된 프레임별 얼굴 랜드마크에 따라 상기 삼각분할된 얼굴 이미지의 픽셀 위치를 변환하고, 입력 음성 의 음성 길이에 맞게 위치 변환된 프레임을 생성하여 이미지 발화 영상을 생성할 수 있다. 실시예들에 따르면, 프로세서는 입력 이미지와 연관된 입력 텍스트가 수신되는 경우, 입력 텍스트를 음성 으로 변환하고, 변환된 음성을 이용하여 변환된 음성에 따라 움직이는 이미지 발화 영상을 생성할 수 있다. 한편, 프로세서에 의해 실행될 때, 상기 프로세서로 하여금 방법을 실행하게 하는 명령어들을 저장하기 위한 비 일시적 컴퓨터 판독가능 저장 매체로서, 상기 방법은: 얼굴 구성요소의 기준 위치가 정의된 사용자 정의 템플릿 을 설정하는 단계; 상기 설정된 사용자 정의 템플릿을 기반으로 입력 이미지에서 얼굴 구성요소의 위치를 나타 내는 얼굴 랜드마크(Landmark)를 생성하는 단계; 입력 음성과 상기 생성된 얼굴 랜드마크를 이용해 상기 입력 음성에 따라 움직이는 프레임별 얼굴 랜드마크를 생성하는 단계; 및 상기 입력 이미지, 상기 입력 음성 및 상기 생성된 프레임별 얼굴 랜드마크를 이용해, 상기 입력 이미지에 대해 상기 입력 음성에 따라 움직이는 이미지 발 화 영상을 생성하는 단계를 포함하는, 비일시적 컴퓨터 판독 가능한 저장 매체가 제공될 수 있다. 한편, 본 발명의 일 실시예에 따르면, 이상에서 설명된 다양한 실시예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개 시된 실시예들에 따른 전자 장치(예: 전자 장치(A))를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있 는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체 가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 또한, 본 발명의 일 실시예에 따르면, 이상에서 설명된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 본 발명의 일 실시예에 따르면, 이상에서 설명된 다양한 실시예들은 소프트웨어(software), 하드웨어 (hardware) 또는 이들의 조합을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 일부 경우에 있어 본 명세서에서 설명되는 실시예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시예들은 별도의 소프트 웨어 모듈들로 구현될 수 있다. 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 동작을 수행할 수 있다. 한편, 상술한 다양한 실시예들에 따른 기기의 프로세싱 동작을 수행하기 위한 컴퓨터 명령어(computer instructions)는 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium)에 저장될 수 있 다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어는 특정 기기의 프로세서에 의해 실행되었 을 때 상술한 다양한 실시예에 따른 기기에서의 처리 동작을 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판 독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반영구적 으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매 체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등이 있을 수 있다. 또한, 상술한 다양한 실시예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작 들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생 략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2022-0178219", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2022-0178219", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 방법을 나타낸 흐 름도이다. 도 2는 본 발명의 일 실시예에 따른 사용자 정의 템플릿 생성 방법을 나타낸 흐름도이다. 도 3 내지 도 6은 본 발명의 일 실시예에 따른 사용자 정의 템플릿 생성 방법의 예시를 나타낸 도면이다. 도 7은 본 발명의 일 실시예에 따른 이미지 전처리 및 랜드마크 생성, 수정 과정을 나타낸 흐름도이다. 도 8은 본 발명의 일 실시예에 따른 사전 정의한 랜드마크 템플릿 기반 자동 좌표 수정 방법을 나타낸 흐름도이 다. 도 9는 본 발명의 일 실시예에 따른 도 8의 정의한 템플릿 기반 랜드마크 좌표 수정 과정의 예시를 나타낸 도면 이다. 도 10은 본 발명의 일 실시예에 따른 얼굴 휨 및 말하는 영상 생성 과정을 나타낸 흐름도이다. 도 11 내지 도 13은 본 발명의 일 실시예에 따른 사용자 정의 템플릿 기반 랜드마크 수정 결과를 나타낸 도면이 다. 도 14 및 도 15는 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 서비스 를 위한 서비스 메인 UI 예시를 나타낸 도면이다. 도 16 및 도 17은 본 발명의 일 실시예에 따른 이미지 발화 영상 생성 결과 예시를 나타낸 도면이다. 도 18은 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 시스템의 구성을 나타낸 도면이다. 도 19는 본 발명의 일 실시예에 따른 인공지능 기반 랜드마크를 이용한 이미지 발화 영상 생성 장치의 구성도이 다."}
