{"patent_id": "10-2014-0028141", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0106086", "출원번호": "10-2014-0028141", "발명의 명칭": "단백질 번역을 촉진하는 인공 비번역 선도서열", "출원인": "한국생명공학연구원", "발명자": "권오석"}}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서열번호 1의 핵산 서열로 구성되고, 단백질 번역(translation)을 촉진하는 인공 비번역 선도서열(artificialuntranslated leader sequence)."}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항의 인공 비번역 선도서열을 포함하는 유전자 컨스트럭트(construct)."}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항의 인공 비번역 선도서열을 포함하는 벡터."}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서, 상기 벡터는 프로모터, 제 1항의 인공 비번역 선도서열 및 목적 단백질을 암호화하는 폴리뉴클레오티드를 포함하는 것을 특징으로 하는 벡터."}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서, 상기 목적 단백질은 표지 단백질을 더 포함하는 것을 특징으로 하는 벡터."}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3항 내지 제 5항 중 어느 한 항의 벡터로 숙주세포를 형질전환시킨 형질전환체."}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서, 상기 숙주세포는 대장균(E. coli) 또는 슈도모나스 속 균주(Pseudomanas)인 것을 특징으로 하는 형질전환체."}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서, 상기 슈도모나스 속 균주는 슈도모나스 푸티다(Pseudomanas putida)인 것을 특징으로 하는 형질전환체."}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "1) 제 3항 내지 제 5항 중 어느 한 항의 벡터를 포함하는 형질전환체를 제조하는 단계; 및2) 상기 단계 1)의 형질전환체를 배양한 배양액으로부터 단백질을 회수하는 단계를 포함하는 단백질의 대량 생산 방법.공개특허 10-2015-0106086-3-청구항 10 제 9항에 있어서, 상기 단계 1)의 형질전환체는 대장균 또는 슈도모나스 속 균주인 것을 특징으로 하는 형질전환체."}
{"patent_id": "10-2014-0028141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9항에 있어서, 상기 단계 2)의 단백질은 표지 단백질인 것을 특징으로 하는 형질전환체."}
{"patent_id": "10-2014-0028141", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 단백질 번역을 촉진하는 인공 비번역 선도서열에 관한 것으로, 구체적으로 돌연변이된 대장균 유래의 5'-비번역 선도서열(untranslated leader sequence) 및 sfGFP 유전자를 포함한 pSYK144를 제작한 후 슈도모나스 푸티다에 형질전환한 결과, 형광 단백질의 발현이 현저하게 증가하는 것을 확인함으로써, 상기 인공 비번역 선도 서열을 목적 단백질의 대량 생산 및 프로모터 분석에 유용하게 이용할 수 있다."}
{"patent_id": "10-2014-0028141", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 목적 유전자 앞에 도입하여 해당 단백질의 번역을 증대시킬 수 있는 인공 비번역 선도서열에 관한 것으로, 보다 상세하게는 목적 유전자 앞에 도입하여 해당 단백질의 번역을 증대시킬 수 있는 돌연변이 된 대장균 유래의 5'-비번역 선도서열을 돌연변이 시킨 인공 선도서열에 관한 것이다."}
{"patent_id": "10-2014-0028141", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "미생물로부터 생산된 효소를 산업적으로 이용하려는 연구는 지난 100여 년간 여러 분야에서 폭넓게 진행되어 왔 다. 이러한 연구는 주로 배양이 가능한 미생물을 대상으로 이루어졌고, 이로부터 밝혀진 다양한 미생물 효소들 이 산업적으로 이용되고 있다. 그러나, 최근 분자미생물 생태학의 연구를 통해서 자연계에 존재하는 미생물의 99％ 이상이 전형적인 배지에서 배양되지 않는다는 사실이 증명되었다(Amann et al., Microbiol. Rev. 59:143-169, 1995; Hugenholtz and Pace, Trends Biotechnol. 14:190-197, 1996; Ward et al., Nature 345:63-65, 1990). 따라서, 아직까지 배 양 및 동정이 불가능한 미생물들로부터 효소를 찾으려는 노력이 필요하며, 이는 분자생물학적인 유전자 재조합 발현을 통하여 가능하리라 여겨진다. 이러한 접근 방법의 일환으로 메타게놈(metagenome)에 관한 연구가 시도되고 있는데, 메타게놈은 자연계에 존재 하는 모든 미생물의 유전체를 통칭하며, 일반적으로, 메타게놈 연구는 자연계 시료로부터 미생물을 배양하지 않 고 메타게놈을 분리한 후, 이들을 플라스미드 라이브러리로 작성하여 배양가능한 대장균과 같은 발현숙주에 도 입하는 단계로 구성된다. 이는 난배양 미생물에 대한 전체 유전체 정보 해석은 어렵더라도 해당 미생물 유래의 유전자원 산물을 확보할 수 있는 장점이 있다. 환경 시료에서 메타게놈을 추출하여 라이브러리를 구축한 후 여기에서 유용한 유전자를 스크리닝하는 방법은 1990년대 중반 이후 진행되기 시작하였다. 가장 전형적인 스크리닝 방법은 메타게놈을 토양, 해수 등 환경 시 료에서 추출하여 BAC (bacterial artificial chromosome), 포스미드(fosmid), 혹은 플라스미드(plasmid) 벡터 에 삽입하여 E. coli에 형질전환한 후, 기질이 들어있는 평판 배지 위에서 활성을 보는 방법이다. 현재까지 메 타게놈 라이브러리 스크리닝을 통하여 항생제 합성 및 항생제 내성에 관련된 단백질 유전자들과 아가라제 (agarase), 아미다제(amidase), 아밀라제(amylase), 에스테라제(esterase), 리파제(lipase), 자일라나아제 (xylanase), 펙테이트 리아제(pectate lyase), 폴리케타이드 합성효소(polyketide synthases) 등 산업체에 쓰 이는 효소 유전자들이 스크리닝 되었음이 보고되었다(Daniel, D. Curr. Opinion Biotechnol. 15:199-204, 2004; Streit, W. R. et al., Curr. Opinion Biotechnol. 15:285-290, 2004; Yun, J. and S. Ryu, Microbial. Cell Factories 4:8, 2005). 최근에는 메타게놈 라이브러리를 구축하고 스크리닝하는 과정에서 위의 방법을 개선시키는 방법들이 연구되었다. 우선 숙주인 대장균(E. coli)을 이용하여 환경 시료 중의 다양한 미생물에서 유래한 메타게놈 유 전자를 활성형 단백질로 발현하는데 수반되는 전사, 번역 시스템의 부적합 등의 한계성을 인식하고 E. coli 이 외에 스트렙토마이세스 리비단스(Streptomyces lividans)나 슈도모나스 푸티다(Pseudomonas putida) 등을 숙주 로 이용하여 메타게놈 라이브러리 구축에 이용한 예도 보고되었다(Courtois, S. et al., Appl. Environ. Microbiol. 69:49-55, 2003; Martinez, A. et al., Appl. Environ. Microbiol. 70:2452-2463, 2004; Wang, G.Y. S. et al., Org. Lett. 2:2401-2404, 2000). 그리고 특정한 효소를 스크리닝하기 위하여 해당 기질을 넣은 배지에서 라이브러리를 전-강화(pre-enrichment)시키는 방법도 시도되었다(Entcheva, P. et al., Appl. Environ Microbiol. 67:89-99, 2001; Gabor, E. M. et al., Environ. Microbiol. 6:948-958, 2004a; Knietsch, A. et al., Appl. Environ. Microbiol. 69:1408-1416, 2003; Voget, S. et al., Appl. Environ. Microbiol. 69:6235-6242, 2003). 또한 액체 배양 상태의 메타게놈 라이브러리에서 원하는 기질에 의하여 발현 이 유도되는 유전자를 세포자동해석ㆍ분리장치(FACS)로 스크리닝하는 방법(SIGEX)도 보고되었으며(Uchiyama, T. et al., Nat. Biotechnol. 23:88-93, 2005), 이외에도 메타게놈 라이브러리에서 원하는 유전자를 찾아낼 수 있 는 확률적 효용성을 생물정보학적 접근방법으로 검증하기도 하였다(Gabor, E. M. et al., Environ. Microbiol. 6:879-886, 2004b). 아울러, 메타게놈 라이브러리를 구축한 후, shotgun sequencing을 하여, 배양 할 수 없는 세균의 DNA 정보가 무작위적으로 밝혀지고 있다(Tyron, G. et al., Nature 428: 37-73, 2004; Venter, J. C. et al., Science 304: 66-74, 2004). 하지만, 이러한 메타게놈 라이브러리를 구축하는데 사용 하는 기존의 벡터 시스템은 주로 단순한 목적의 클로닝을 위한 벡터로서 유전자 발현에는 적합하지 않은 문제점 이 있다. 즉, 이종의 발현 숙주에서 외래 유전자를 발현하고자 할 때 프로모터를 포함한 전사 조절 인자와 리 보솜 결합 부위, 개시 코돈 등의 번역 조절 인자, 그리고 각 요소들간의 거리 등 다양한 조건이 충족되어야 하 며 이러한 요소들이 발현 숙주의 유전자 전사 및 번역 시스템과 부합해야 한다. 한편, 번역 조절 기전 중 mRNA의 5'-비번역부위(5'-untranslated region, 5'-UTR)에 있는 샤인-달가르노 서열 (Shine-Dalgarno sequence, SD)과 AU-리치 서열(AU-rich sequences)을 포함하는 조절인자(regulatory elements)는 번역 조절을 위한 번역 개시 복합체(translation initiation complex) 형성과 시작 코돈(start codon, AUG)의 인식에 중요한 역할을 한다. 한편 원핵생물뿐만 아니라 진핵생물에서도 mRNA의 5'-UTR에 코작 서 열(Kozak sequence)이 존재하여 SD 서열과 유사한 기능을 한다. 이러한 5'-UTR을 포함한 프라이머 라이브러리 구축과 돌연변이 유발형 PCR(error-prone PCR)을 통해 구축된 프로모터 라이브러리에서 다양한 활성을 보이는 프로모터를 스크리닝하는 연구가 진행되었다(K. Hammer et al., Trends Biotechnol, 2006, 53-55). 대표적 으로 대장균 W205 또는 W209의 trp-lac 융합 균주(fusion strain)에서 유래된 lacZ 번역 융합 벡터를 이용한 사례도 존재한다(R.W. Simons et al., Gene, 1987, 85-96, S.T. Liang et al., J Bacteriol, 1998, 6090-6100). 흥미로운 점은 이 대장균 유래의 trp-lac 선도서열과 lacZ 유전자를 융합하여 삽입하였을 경우, 베 타-갈락토시다아제(beta-galactosidase)의 활성이 최대 60배 가까이 증가하는 것을 확인하였다(W.S. Reznikoff et al., J Bacteriol, 1974, 1231-1239). 이에, 본 발명자들은 대장균 외 균주에서 목적 단백질의 발현을 촉진할 수 있는 방법을 찾기 위해 노력한 결과, 돌연변이된 대장균 유래의 5'-비번역 선도서열(untranslated leader sequence) 및 형광단백질 (sfGFP) 유전자 가 융합된 pSYK144 벡터를 제작한 후 슈도모나스 푸티다(Pseudomonas putida)에 형질전환하여 형광 단백질의 발 현이 현저하게 증가하는 것을 확인함으로써, 상기 인공 비번역 선도서열을 미생물에서 목적 단백질의 대량 생산 및 염색체 삽입용 표지 유전자 발현 또는 프로모터 분석용 벡터 제작에 유용하게 이용할 수 있음을 밝힘으로써, 본 발명을 완성하였다."}
{"patent_id": "10-2014-0028141", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 단백질 번역(translation)을 촉진하는 인공 비번역 선도서열을 제공하는 것이다."}
{"patent_id": "10-2014-0028141", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 목적을 달성하기 위하여, 본 발명은 단백질 번역(translation)을 촉진하는 인공 비번역 선도서열을 제공한다. 또한, 본 발명은 상기 인공 비번역 선도서열을 포함하는 유전자 발현 컨스트럭트(expression construct)를 제공 한다. 또한, 본 발명은 상기 인공 비번역 선도서열을 포함하는 벡터를 제공한다. 또한, 본 발명은 상기 벡터로 숙주세포를 형질전환시킨 형질전환체를 제공한다. 아울러, 본 발명은 1) 상기 벡터를 포함하는 형질전환체를 제조하는 단계; 및 2) 상기 단계 1)의 형질전환체를 배양한 배양액으로부터 단백질을 회수하는 단계를 포함하는 단백질의 대량 생 산 방법을 제공한다."}
{"patent_id": "10-2014-0028141", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 인공 비번역 선도서열 및 이를 포함하는 벡터는 슈도모나스 푸티다(Pseudomanas putida) 형질전환체 에서 목적 단백질의 발현을 현저하게 증가시키므로, 단백질의 대량 생산, 및 단백질 과발현 벡터, 라이브러리 구축용 벡터, 프로모터 분석용 벡터, 유전체 삽입용 표지 유전자 발현 카세트 등의 제조에 유용하게 이용될 수 있다."}
{"patent_id": "10-2014-0028141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명을 상세히 설명한다. 본 발명은 서열번호 1의 핵산 서열로 구성되고, 단백질 번역(translation)을 촉진하는 인공 비번역 선도서열 (untranslated leader sequence)을 제공한다. 본 발명에서 \"비번역 선도서열(untranslated leader sequence)\"은 5'-비번역부위(5'-untranslated region, 5'- UTR)를 의미하고, 개시 코돈(initiation codon)의 앞에 위치하여 mRNA 암호화 서열의 번역을 조절하는 데 중요 한 역할을 한다. 본 발명의 인공 비번역 선도서열은 대장균에서 유래한 것으로 trp-lacZ 선도서열의 돌연변이 서열을 포함한다. 또한, 본 발명은 서열번호 1의 핵산 서열로 구성된 비번역 선도서열을 포함하는 유전자 발현 컨스트럭트 (expression construct)를 제공한다. 본 명세서에서 \"발현 컨스트럭트(expression construct)\"는 세포내에서 단백질 발현을 위한 최소의 엘리먼트 (element)만을 포함하는 핵산분자를 의미하는 것으로 정의된다. 바람직하게는 본 발명의 발현 컨스트럭트는 상기 서열번호 1의 핵산 서열로 구성된 비번역 선도서열을 최소의 필수 구성요소로 포함한다. 또한, 본 발명의 발현 컨스트럭트는 추가적으로 프로모터 서열에 작동적으로 연결되 도록 외래 단백질 코딩 핵산 서열을 클로닝할 수 있는 제한효소 인식 염기 서열을 포함할 수 있다. 본 발명의발현 컨스트럭트에 포함되는 제한효소 인식 염기 서열의 제한효소는 특정의 것으로 한정되지 않으며, 예를 들어 EcoRI, EcoRII, BamHI, HindIII, TaqI, NotI, HinfI, Sau3A, PovII, SmaI, HaeIII, HgaI, AluI, EcoRV, EcoP15I, KpnI, PstI, SacI, SalI, ScaI, SpeI, SphI, StuI, XbaI 등을 포함하나 이에 한정되지 않는다. 또한, 본 발명은 서열번호 1의 핵산 서열로 구성된 인공 비번역 선도서열을 포함하는 벡터를 제공한다. 본 발명에서 벡터는 적당한 숙주세포에서 목적 단백질을 발현할 수 있는 재조합 벡터로서, 유전자 삽입물이 발 현되도록 작동가능하게 연결된 필수적인 조절 요소를 포함하는 유전자 작제물을 말한다. 본 발명에서 용어, \"작 동가능하게 연결된(operably linked)\"는 일반적 기능을 수행하도록 핵산 발현 조절 서열과 목적하는 단백질을 코딩하는 핵산 서열이 기능적으로 연결(functional linkage)되어 있는 것을 말한다. 예를 들어, 프로모터와 단 백질을 코딩하는 핵산 서열이 작동가능하게 연결되어 코딩하는 핵산 서열의 발현에 영향을 미칠 수 있다. 재조"}
{"patent_id": "10-2014-0028141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "합 벡터와의 작동적 연결은 당해 기술분야에서 잘 알려진 유전자 재조합 기술을 이용하여 제조할 수 있으며, 부 위-특이적 DNA 절단 및 연결은 당해 기술 분야에서 일반적으로 알려진 효소 등을 사용한다. 상기 벡터는 프로모터, 서열번호 1의 핵산 서열로 구성된 비번역 선도서열 및 목적 단백질을 암호화하는 폴리뉴 클레오티드를 포함하는 것이 바람직하나 이에 한정되지 않는다. 상기 목적 단백질은 표지 단백질을 더 포함하는 것이 바람직하나 이에 한정되지 않는다. 상기 벡터는 플라스미드 벡터, 코즈미드 벡터, 및 박테리오 파지 벡터인 것이 바람직하고, 플라스미드 벡터를 사용하는 것이 보다 바람직하나, 이에 한정되지 않는다. 본 발명의 벡터의 제작 시에는, 목적 단백질을 생산하고자 하는 숙주세포의 종류에 따라 상기 비번역 선도서열 이외에 프로모터(promoter), 종결자(terminator), 인핸서(enhancer) 등과 같은 발현조절 서열, 막 표적화 또는 분비를 위한 서열 등을 적절히 선택하고 목적에 따라 다양하게 조합할 수 있다. 보다 상세하게, 적합한 벡터는 프로모터, 오퍼레이터, 개시코돈, 종결코돈 및 인핸서 같은 발현 조절 엘리먼트 외에도 막 표적화 또는 분비를 위한 시그널 서열 또는 리더 서열을 포함하며 목적에 따라 다양하게 제조될 수 있다. 벡터의 프로모터는 구성적 또는 유도성일 수 있다. 상기 시그널 서열에는 숙주가 에쉐리키아속(Escherichia sp.)균인 경우에는 PhoA 시그 널 서열, OmpA 시그널 서열 등이, 숙주가 바실러스속(Bacillus sp.)균인 경우에는 α-아밀라아제 시그널 서열, 서브틸리신 시그널 서열 등을 이용할 수 있으나, 이에 제한되지 않는다. 또한, 벡터는 벡터를 함유하는 숙주 세포를 선택하기 위한 선택 마커를 포함할 수 있고, 복제 가능한 발현벡터인 경우 복제 기원을 포함한다. 또한, 본 발명은 서열번호 1의 핵산 서열로 구성된 비번역 선도서열을 포함하는 벡터로 숙주세포를 형질전환시 킨 형질전환체를 제공한다. 상기 숙주세포는 대장균(E. coli) 또는 슈도모나스 속 균주(Pseudomanas)인 것이 바람직하나 이에 한정되지 않 는다. 상기 대장균 속 균주는 K 계열 균주 또는 B계열 균주인 것이 바람직하나 이에 한정하지 않는다. 또한, 상 기 슈도모나스 속 균주는 슈도모나스 애루지노사(P. aeruginosa), 슈도모나스 클로로라피스(P. chlororaphis), 슈도모나스 플루오레슨스(P. fluorescens), 슈도모나스 퍼투시노제나(P. pertucinogena), 슈도모나스 푸티다(P. putida), 슈도모나스 스튜트제리(P. stutzeri) 또는 슈도모나스 시린게(P. syringae)인 것이 바람직하고, 슈도 모나스 푸티다(P. putida)인 것이 더욱 바람직하나 이에 한정되지 않는다. 본 발명의 구체적인 실시예에서, 본 발명자들은 프로모터 뒤로 목적 단백질의 발현을 촉진하는 인공 비번역 선 도서열이 도입된 벡터를 구축하기 위하여, 먼저 pBBRBB-eGFP 벡터에서 eGFP 유전자를 제거하고 sfGFP(super folding GFP) 유전자가 삽입된 벡터를 제조하여 'pSYK141'로 명명하였다. 또한, 상기 pSYK 141 벡터의 sfGFP 유전자 앞에 대장균 유래 비번역 선도서열이 도입된 벡터를 제조하고 'pSYK143'으로 명명하였다(도 1a 및 도 1b 참조). 또한, 본 발명자들은 단백질 번역을 촉진하는 돌연변이 비번역 선도서열을 획득하기 위하여, 도 2의 모식도와 같이 무작위 PCR 돌연변이(random PCR mutagenesis)를 수행하여 돌연변이 선도서열 도입 벡터를 제조하여 비번 역 선도서열 돌연변이 라이브러리를 구축하였다(도 2 참조). 또한, 본 발명자들은 단백질 번역을 촉진하는 비번역 선도서열 및 이를 포함하는 벡터를 획득하기 위하여, 상기 무작위 돌연변이 선도서열 도입 라이브러리 벡터를 대장균에 형질전환한 형질전환체를 이용하여 형광 분석을 수 행하고 각 시료의 형광을 비교하여 sfGFP 발현이 높은 형질전환체를 선별하였다. 또한, 상기 선별된 형질전환체 로부터 재조합 플라스미드 DNA를 분리하고 슈도모나스 푸티다에 형질전환한 후 형광 분석을 수행한 결과, 상기선별된 무작위 돌연변이 선도서열을 포함한 재조합 플라스미드 도입 슈도모나스 푸티다 형질전환체(P-041)의 sfGFP의 활성 변화가 선도서열을 포함하지 않는 형질전환체와 비교하여 최대 34배 이상의 발현을 나타내고, 해 당 선도서열의 염기서열을 확인한 결과 리보솜 결합 부위 다운스트림(ribosome binding site downstream)에 G→ A로 돌연변이 된 것을 확인하였으며, 'pSYK144'로 명명하였다(도 3 및 도 4, 및 표 7 참조). 따라서, 본 발명의 돌연변이된 인공 비번역 선도서열 및 이를 포함하는 벡터는 형질전환체에서 목적 단백질의 발현을 현저하게 증가시키므로, 단백질의 대량 생산, 및 단백질 과발현 벡터, 라이브러리 구축용 벡터, 프로모 터 분석용 벡터, 유전체 삽입용 표지 유전자 발현 카세트 등의 제조에 유용하게 이용될 수 있다. 또한, 본 발명은 1) 서열번호 1의 핵산 서열로 구성된 비번역 선도서열을 포함하는 벡터를 포함하는 형질전환체를 제조하는 단계; 및 2) 상기 단계 1)의 형질전환체를 배양한 배양액으로부터 단백질을 회수하는 단계를 포함하는 단백질의 대량 생 산 방법을 제공한다. 상기 방법에 있어서, 단계 1)의 벡터는 프로모터, 서열번호 1의 핵산 서열로 구성된 비번역 선도서열 및 목적 단백질을 암호화하는 폴리뉴클레오티드를 포함하고, 상기 목적 단백질은 표지 단백질을 더 포함하는 것이 바람 직하나 이에 한정되지 않는다. 상기 방법에 있어서, 단계 1)의 형질전환체는 대장균 또는 슈도모나스 속 균주인 것이 바람직하나 이에 한정되 지 않는다. 상기 형질전환체는 상기 벡터를 임의의 숙주세포에 도입시킴으로써 용이하게 제조될 수 있다. 본 발 명의 바람직한 실시예에서는 발현 벡터를 대장균 DH5α 균주 또는 슈도모나스 푸티다 KT2440 균주에 도입하여 형질전환체를 제조하였다. 상기 방법에 있어서, 단계 2)의 단백질은 표지 단백질인 것이 바람직하나 이에 한정되지 않는다. 본 발명의 바 람직한 실시예에서는 표지 단백질로 sfGFP를 이용하였다. 본 발명의 돌연변이된 인공 비번역 선도서열 및 이를 포함하는 벡터는 형질전환체에서 목적 단백질의 발현을 현 저하게 증가시키므로, 상기 벡터를 도입한 형질전환체를 이용하여 단백질을 대량 생산하는 방법은 목적 단백질 의 대량 생산에 유용하게 이용될 수 있다. 이하, 본 발명을 실시예에 의해 상세히 설명한다."}
{"patent_id": "10-2014-0028141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "단, 하기 실시예는 본 발명을 예시하는 것일 뿐, 본 발명의 내용이 하기 실시예에 의해 한정되는 것은 아니다. <실시예 1> 비번역 선도서열(untranslated leader sequence) 도입 벡터 제조 <1-1> sfGFP(super folding GFP) 도입 벡터 제조 번역 조절 기전 중 mRNA의 5'-비번역부위(5'-untranslated region, UTR)에 있는 샤인-달가르노 서열(Shine- Dalgarno sequence, SD)과 AU-리치 서열(AU-rich sequences)를 포함하는 조절인자(regulatory elements)는 번 역 조절을 위한 번역 개시 복합체(translation initiation complex) 형성과 시작 코돈(start codon, AUG)의 인 식에 중요한 역할을 한다. 따라서, 도 1의 모식도와 같은 비번역 선도서열을 도입한 벡터를 구축하기 위하여, 먼저 pBBRBB 벡터에 sfGFP(super folding GFP)가 삽입된 pBBRBB-sfGFP 벡터를 제조하였다. 구체적으로, pBBRBB-eGFP 벡터(4,857 bp)(https://www.addgene.org)에 제한효소 NdeI(TaKaRa Bio Inc., Shiga, Japan) 및 XhoI(TaKaRa Bio Inc., Shiga, Japan)을 처리하여 절단한 후, 아가로오즈 겔(agarose gel)에서 전기 영동하고 DNA 분리 정제 키트(Gel purification kit, Bioneer, 대전, 대한민국)를 이용하여 제조사의 절차에 따라 eGFP 유전자 부분을 제거한 벡터 골격 부분(4,115 bp)을 순수정제하였다. 그 다음, pHCE IIB(Takara. C o)의 NdeI, HindIII 제한효소 부위에 sfGFP 유전자(Gene accession No. HQ873313.1, Nature biotechnology, 2006, 24:79-88)가 삽입된 pHCE IIB-sfGFP 벡터를 주형으로 하여 하기 [표 1]의 프라이머 쌍 sfGFP-F- NdeI/sfGFP-R-XhoI, 및 PrimeSTAR GXL DNA 중합효소(Polymerase)(Takara, Japan)를 이용하여 하기 [표 2]의 조 건에서 중합 효소 연쇄 반응(Polymerase Chain Reaction, PCR)을 수행하여, 1,206 bp 크기의 sfgfp-TrrnB 단편을 증폭하였다. 상기 증폭된 PCR 산물을 DNA 분리 정제 키트(PCR purification kit, Bioneer, 대전, 대한민 국)를 이용하여 제조사의 절차에 따라 순수 정제하고 제한효소 NdeI 및 XhoI(TaKaRa Bio Inc., Shiga, Japan) 으로 절단한 후, 상기와 같이 아가로오즈 겔에서 전기영동하고 DNA 분리 정제 키트를 이용하여 순수정제하고 상 기 eGFP 부분을 제거한 pBBRBB벡터 골격 내로 클로닝하였다. 상기 클로닝하여 sfGFP-TrrnB 단편이 도입된 pBBRBB 벡터를 대장균 DH5α에 형질전환 후, 재조합 플라스미드 DNA를 분리하였다. 상기 분리된 DNA는 서열분석 (sequencing)(제노텍, 대전, 대한민국)을 통해 염기서열을 확인하고, 'pSYK141'로 명명하였다(도 1a). 표 1 프라이머(primer) 서열(5'→3')a pBBRBB-sfGFPi-FCATATGAGCAAAGGTGAAGAACTGTTTACC(서열번호 3) pBBRBB-sfGFPi-RAGATCTCCTCCTTCTACTAGACGC(서열번호 4) 1-Lead-S-F TCTAGTAGAAGGAGGAGATCTGGACAACCGATGAAAGCGGCG(서열번호 5) 1-Lead-S-R TTCTTCACCTTTGCTCATATGAGCTGTTTCCTGTGTGATAAAGAAAG(서열번호 6) 2-Lead-S-F TCTAGTAGAAGGAGGAGATCT(서열번호 7) 2-Lead-S-R TTCTTCACCTTTGCTCATATG(서열번호 8) sfGFP-R-XhoI CCGCTCGAGAGAGTTTGTAGAAACGCAAAAAGGCC(서열번호 9) sfGFP-F-NdeI GGAATTCCATATGAGCAAAGGTGAAGAACTGTTTACC(서열번호 10) a밑줄친 서열부위는 제한 효소의 인식 부위이다. 표 2 PCR 조건 변성(denaturation) 98℃10초 30회 결합(annealing) 58℃5초 신장(extension) 72℃30초 <1-2> 비번역 선도서열 도입된 sfGFP 벡터 제조 비번역 선도서열을 도입한 벡터를 구축하기 위하여, 상기 실시예 <1-1>을 통해 획득한 pSYK141 벡터에 비번역 선도서열이 도입된 pSKY143 벡터를 제조하였다. 구체적으로, 상기 실시예 <1-1>에 기재된 방법으로 획득한 pSYK141 벡터를 제한효소 BglII(TaKaRa Bio Inc., Shiga, Japan)와 NdeI(TaKaRa Bio Inc., Shiga, Japan)으로 처리하여 절단한 후, 상기 실시예 <1-1>과 같이 아 가로오즈 겔에서 전기영동하고 DNA 분리 정제 키트를 이용하여 순수정제하였다. 그 다음, pRS415를 주형으로 상 기 [표 1]의 프라이머 쌍 1-Lead-S-F/1-Lead-S-R, 및 PrimeSTAR GXL DNA 중합효소(Takara, Japan)를 이용하여 하기 [표 3]의 조건에서 PCR을 수행하여, 136 bp 크기의 선도서열(leader sequence) 단편을 증폭하였다. 상기 증폭된 DNA 단편을 PCR 산물 정제 키트(PCR purification kit, Bioneer, 대전, 대한민국)를 이용하여 순수 정 제하여 제한효소 BglII 및 NdeI을 처리하여 절단한 후 상기 BglII-NdeI으로 절단한 pSYK141 벡터 내로 클로닝하 였다. 상기 클로닝하여 선도서열이 도입된 pSYK141 벡터를 대장균 DH5α에 형질전환 후, 플라스미드 DNA를 분리 하였다. 상기 분리된 DNA는 서열분석(sequencing)(제노텍, 대전, 대한민국)을 통해 염기서열을 확인하고, 'pSYK143'으로 명명하였다(도 1b). 표 3 PCR 조건 변성(denaturation) 98℃10초 30회 결합(annealing) 58℃5초 신장(extension) 72℃10초 <실시예 2> 단백질 번역 촉진을 위한 선도서열 돌연변이 라이브러리 제작 도 2의 모식도와 같이 단백질 번역 촉진을 위해 선도서열에 무작위 PCR 돌연변이(random PCR mutagenesis)를 수 행하여 라이브러리를 구축하였다. 구체적으로, 상기 실시예 <1-1>에 기재된 방법으로 획득한 pSYK141 벡터를 주형으로 상기 [표 1]의 프라이머 쌍 pBBRBB-sfGFPi-F/pBBRBB-sfGFPi-R 및 PrimeSTAR GXL DNA 중합효소(Takara, Japan)를 이용하여 하기 [표 4]의 조건에서 역 PCR(Inverse Polymerase Chain Reaction, iPCR)을 수행하여, 5,310 bp 크기의 벡터 골격 단편을 증폭하였다. 상기 증폭된 DNA 단편을 아가로오즈 겔에서 전기영동하고 DNA 분리 정제 키트를 이용하여 순수정제 하였다. 그 다음, 상기 실시예 <1-2>에 기재된 방법으로 획득한 pSYK143을 주형으로 상기 [표 1]의 프라이머 쌍 1-Lead-S-F/R 및 PrimeSTAR GXL DNA 중합효소(Takara, Japan)을 이용하여 하기 [표 5]의 조건에서 PCR을 수행 하여, 136 bp 크기의 선도서열 단편을 증폭하고 PCR 산물분리 정제 키트를 이용하여 순수 정제하였다. 상기 증 폭된 선도서열을 주형으로 상기 [표 1]의 프라이머 쌍 2-Lead-S-F/2-Lead-S-R를 사용하여 클론텍(Clontech)사의 DiversifyTM PCR Random Mutagenesis Kit(Cat. # 630703)로 하기 [표 6]의 조건에서 PCR을 수행하였다. 상기 PCR 산물은 아가로오즈 겔로 전기영동하여 분리하고, DNA 분리 정제 키트를 이용하여 136 bp 크기의 무작위 돌 연변이 선도서열을 순수정제하였다. 그 다음, 상기 순수정제한 무작위 돌연변이 선도서열을 EZ-CloningTM 키트 (Enzynomics, 대전, 대한민국)을 사용하여 상기 준비된 5,310 bp 크기의 pSYK141 벡터 내로 클로닝하여 라이브 러리를 구축하였다. 추후 실험을 위해 상기 클로닝된 무작위 돌연변이 선도서열 벡터 라이브러리를 슈도모나스 푸티다(Pseudomanas putida) KT2440에 형질전환을 다음과 같은 방법으로 진행하였다. 먼저 Luria-Bertani(LB) 배지(트립톤 10 g/L, 효모추출물 5 g/L, 염화나트륨 10 g/L)을 사용하여 30℃에서 18시간 이상 전배양한 슈도모 나스 푸티다 KT2440를 원심분리하여 상등액을 제거한 후 동일한 양의 10% 글리세롤(glycerol)을 사용하여 세척 하여 1/100 부피로 농축한 후 전기천공법으로 형질전환하였다. 표 4 PCR 조건 변성(denaturation) 98℃10초 30회 결합(annealing) 58℃5초 신장(extension) 72℃3분 표 5 PCR 조건 변성(denaturation) 98℃10초 30회 결합(annealing) 58℃5초 신장(extension) 72℃15초 표 6 PCR 조건 변성(denaturation) 95℃5분 1회 변성(denaturation) 94℃30초 25회 신장(extension) 68℃10초 최종 신장(final extension)68℃1분 1회 <실시예 3> 단백질 번역 촉진을 위한 선도서열 확인 <3-1> 무작위 돌연변이 선도서열 라이브러리로부터 단백질 번역 촉진을 위한 선도서열 스크리닝 상기 <실시예 2>를 통해 획득한 무작위 돌연변이 선도서열 도입 벡터 라이브러리로부터 단백질 번역을 촉진하는 선도서열을 선별하기 위하여, 무작위 돌연변이 선도서열 도입 벡터 형질전환체를 이용하여 형광 강도 분석을 수 행하였다. 구체적으로, 상기 <실시예 2>에 기재된 방법으로 획득한 무작위 돌연변이 선도서열 도입 벡터 라이브러리 형질 전환체를 플레이트에 도말 후 cell observer를 사용하여 1차적으로 형광의 밝기가 강한 것을 19개의 클론을 선별한 후 단일 콜로니를 얻었다. 그 다음, 상기 선별된 형질전환체에서 형광을 측정하기 위하여, 플라스미드 DNA 를 추출 후 슈도모나스 푸티다 KT2440에 형질전환을 하였다. <3-2> 단백질 번역 촉진을 위한 돌연변이 선도서열 도입 벡터를 포함하는 형질전환체의 형광 강도 확인 상기 실시예 <3-1>을 통해 선별된 단백질 번역 촉진 돌연변이 선도서열의 단백질 번역 촉진 능력을 확인하기 위 하여, 상기 선별된 단백질 번역 촉진 선도서열 도입 벡터 형질전환체에서 sfGFP 단백질의 형광 강도 분석을 수 행하였다. 구체적으로, 상기 실시예 <3-1>을 통해 선별된 단백질 번역 촉진 선도서열 도입 벡터가 포함된 슈도모나스 푸티 다 KT2440 형질전환체에서 재조합 플라스미드 DNA를 분리한 후, 상기 분리한 19개의 재조합 플라스미드 DNA, pBBRBB, 비번역 선도서열이 삽입되지 않은 벡터 형질전환체(P-141) 및 야생형 비번역선도서열이 삽입된 벡터 형 질전환체(P-143)을 각각 슈도모나스 푸티다 KT2440에 형질전환을 수행하였다. 그 다음, 상기 형질전환체를 최종 농도 50 ㎍/㎖ 카나마이신(Km)이 포함된 LB 배지(트립톤 10 g/ℓ, 효모추출물 5 g/ℓ, 염화나트륨 10 g/ℓ)로 30℃에서 12시간 이상 전배양하였다. 이후, 상기 전배양액을 100분의 1 부피 비로 다시 LB-Km 배지에 접종하여, 30℃에서 6시간을 배양한 후 원심분리하여 세포를 회수하였다. 그 다음, 동량의 PBS(Phosphate buffered saline; NaCl 8 g/ℓ, KCl 0.2 g/ℓ, Na2HPO4 1.44 g/ℓ, KH2PO4 0.24 g/ℓ pH 7.4)로 세척 후 멀티플레이트 리 더기(Spectramax I3, Molecular Devices; Sunnyvale, CA)를 이용하여 발광파장(excitation wavelength): 485 nm, 방출 파장(emission wavelength): 535 nm으로 각 시료의 형광을 확인하였다. 그 결과, 도 3에 나타낸 바와 같이, 야생형 비번역선도서열이 삽입된 벡터 형질전환체(P-143)가 비번역 선도서 열이 삽입되지 않은 벡터 형질전환체(P-141)과 비교하여 sfGDP의 활성 변화가 12배 이상 높게 나타는 것을 확인 하였으며, 무작위 돌연변이 선도서열 삽입 벡터 형질전환체로부터 P-143보다 sfGFP 발현이 높은 11개의 클론을 확보하였다. 그 중 돌연변이된 선도서열을 포함하고 있는 벡터 형질전환체 P-041은 상기 분리한 재조합 플라스 미드 중 형광발현이 가장 우수하고, P-141과 P-143 형질전환체에 비해 각각 34배 및 2.8배 이상의 높은 형광발 현을 나타내는 것으로 확인하였다(도 3). 그 다음, 상기 가장 sfGFP 발현이 높은 형질전환체 P-041의 플라스미드를 실시예 <1-1>에 기재된 방법으로 형질 전환체로부터 분리하여 'pSYK144'로 명명하였으며, 염기서열 분석을 수행하였다. 그 결과, 도 4에 나타낸 바와 같이, 선도서열의 무작위 돌연변이로 인해 비번역선도서열에 G→A로 돌연변이가 도입된 것을 확인하였다(도 4). 표 7 플라스미드 DNA선도서열(5'→3') pSYK144GGACAACCGATGAAAGCGGCGACGCGCAGTTAATCCCACAGCCGCCAGTTCCGCTGGCGGCATTTTAACTTTCTTTATCACACAGGAA ACAACTCATATG(서열번호 1) pSYK143GGACAACCGATGAAAGCGGCGACGCGCAGTTAATCCCACAGCCGCCAGTTCCGCTGGCGGCATTTTAACTTTCTTTATCACACAGGAA ACAGCTCATATG(서열번호 2)도면 도면1 도면2 도면3 도면4 서 열 목 록 <110> Korea Research Institute of Bioscience and Biotechnology <120> Artificial untranslated leader sequence to enhance protein translation <130> 14p-01-11 <160> 10 <170> KopatentIn 2.0 <210> 1 <211> 100 <212> DNA <213> Escherichia coli <400> 1 ggacaaccga tgaaagcggc gacgcgcagt taatcccaca gccgccagtt ccgctggcgg 60 cattttaact ttctttatca cacaggaaac aactcatatg 100 <210> 2 <211> 100 <212> DNA<213> Escherichia coli <400> 2 ggacaaccga tgaaagcggc gacgcgcagt taatcccaca gccgccagtt ccgctggcgg 60 cattttaact ttctttatca cacaggaaac agctcatatg 100 <210> 3 <211> 30 <212> DNA <213> Artificial Sequence <220><223> pBBRBB-sfGFPi-F <400> 3 catatgagca aaggtgaaga actgtttacc 30 <210> 4 <211> 24 <212> DNA <213> Artificial Sequence <220><223> pBBRBB-sfGFPi-R <400> 4 agatctcctc cttctactag acgc 24 <210> 5 <211> 42 <212> DNA <213> Artificial Sequence <220><223> 1-Lead-S-F <400> 5 tctagtagaa ggaggagatc tggacaaccg atgaaagcgg cg 42 <210> 6 <211> 47 <212> DNA <213> Artificial Sequence <220><223> 1-Lead-S-R <400> 6 ttcttcacct ttgctcatat gagctgtttc ctgtgtgata aagaaag 47 <210> 7<211> 21 <212> DNA <213> Artificial Sequence <220><223> 2-Lead-S-F <400> 7 tctagtagaa ggaggagatc t 21 <210> 8 <211> 21 <212> DNA <213> Artificial Sequence <220><223> 2-Lead-S-R <400> 8 ttcttcacct ttgctcatat g 21 <210> 9 <211> 35 <212> DNA <213> Artificial Sequence <220><223> sfGFP-R-XhoI <400> 9 ccgctcgaga gagtttgtag aaacgcaaaa aggcc 35 <210> 10 <211> 37 <212> DNA <213> Artificial Sequence <220><223> sfGFP-F-NdeI <400> 10 ggaattccat atgagcaaag gtgaagaact gtttacc 37"}
{"patent_id": "10-2014-0028141", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 sfGFP 발현 벡터(pSYK141)를 나타낸 도이다. 도 1b는 야생형 비번역(untranslated) 선도서열(Leader sequence)가 도입된 sfGFP 발현 벡터(pSYK143)를 나타 낸 도이다. 도 2은 무작위 PCR 돌연변이를 통한 단백질 번역 촉진 선도서열 도입 벡터 라이브러리 구축 모식도를 나타낸 도 이다. 도 3는 pSYK141, pSYK143 및 무작위 돌연변이 선도서열 도입 벡터 라이브러리에서 선별된 형질전환체에서 발현 된 sfGFP 단백질의 형광 강도를 나타낸 도이다. 도 4는 무작위 돌연변이 선도서열 도입 벡터 라이브러리로부터 단백질 촉지능이 가장 우수한 벡터(pSYK144)의 선도서열의 염기서열 분석 결과를 나타낸 도이다."}
