{"patent_id": "10-2022-0045222", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0089516", "출원번호": "10-2022-0045222", "발명의 명칭": "디스플레이 장치용 거치 디바이스", "출원인": "삼성전자주식회사", "발명자": "강남현"}}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디스플레이 장치용 거치 디바이스에 있어서,제 1 면 및 상기 제 1 면에 반대되는 제 2 면을 포함하고, 상기 제 1 면에 디스플레이 장치가 부착되어 상기 디스플레이 장치와 일체로 움직이는 구동 플레이트;상기 구동 플레이트의 상기 제 2 면의 적어도 일부와 접촉되도록 나란히 배치되며, 상기 구동 플레이트의 직선이동을 막는 락킹 유닛을 포함하는, 바디 플레이트;상기 바디 플레이트의 상기 구동 플레이트와 결합된 면의 반대 면에 배치되는, 스탠드 플레이트를 포함하고,상기 락킹 유닛은, 상기 바디 플레이트 및 상기 스탠드 플레이트가 겹쳐져 나란히 배치되는 그라운드 모드에서는 잠금이 유지되고, 상기 바디 플레이트 및 상기 스탠드 플레이트가 이격 되어 배치되는 스탠드 모드에서는 잠금이 해제되는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 바디 플레이트는,상기 구동 플레이트의 상기 제 2 면과 커플링 되어 상기 구동 플레이트의 직선 이동 및 회전 운동을 유도하는드라이브 멤버; 및상기 드라이브 멤버의 직선 이동 경로를 안내하는 슬라이드 가이드를 더 포함하고,상기 슬라이드 가이드는, 상기 구동 플레이트의 상기 제 2 면이 상기 바디 플레이트와 접촉되는 면적이 최대일때의 상기 드라이브 멤버가 배치되는 제 1 위치; 및 상기 구동 플레이트의 상기 제 2 면이 상기 바디 플레이트와 접촉되는 면적이 최소일 때 상기 드라이브 멤버가 배치되는 제 2 위치를 포함하며,상기 드라이브 멤버는 상기 제 1 위치 및 상기 제 2 위치 사이에서 이동하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 락킹 유닛은,상기 드라이브 멤버의 상기 슬라이드 가이드와 접하는 양 측에 배치된 락킹 유닛 그루브와 맞물려 상기 드라이브 멤버가 상기 제 1 위치에 고정되도록 하는 잠금 부재;상기 잠금 부재의 상기 슬라이드 가이드를 향하는 측에 배치되는, 락킹 스프링을 포함하고,상기 락킹 스프링은, 상기 그라운드 모드에서는 수축된 상태로 유지되어 상기 잠금 부재가 상기 락킹 유닛 그루브와 맞물리도록 하고, 상기 스탠드 모드에서는 팽창된 상태로 유지되어 상기 잠금 부재가 상기 락킹 유닛공개특허 10-2023-0089516-3-그루브와 맞물림이 해제되도록 하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 잠금 부재는 제 1 자성체를 포함하고,상기 스탠드 플레이트는, 상기 락킹 스프링이 수축된 상태에서 상기 잠금 부재의 상기 제 1 자성체의 위치와 대응되는 위치에 제 2 자성체를 포함하며,상기 제 1 자성체 및 상기 제 2 자성체 간에 인력이 작용하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 드라이브 멤버는,상기 구동 플레이트와 커플링 되는 드라이브 커플링 유닛; 및상기 드라이브 커플링 유닛을 둘러싸도록 배치되며 상기 드라이브 커플링 유닛의 회전 운동을 안내하는 회전 홈을 포함하고, 상기 슬라이드 가이드를 따라 직선 이동하는 프레임 유닛을 포함하고,상기 드라이브 커플링 유닛은 상기 프레임 유닛의 상기 회전 홈에서 회전되는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 드라이브 멤버는, 상기 프레임 유닛의 내측면에 배치되어 상기 드라이브 커플링 유닛에 대해 탄성력이 작용되는 스위블 가이드 탄성체를 더 포함하고,상기 드라이브 커플링 유닛은 정사각형 구조를 가지는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 바디 플레이트는,상기 구동 플레이트의 직선 이동 시 상기 바디 플레이트에 대한 상기 구동 플레이트의 각도를 고정하는 제 1 마찰부재를 더 포함하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2023-0089516-4-제 2 항에 있어서,상기 바디 플레이트는,상기 구동 플레이트와 커플링 된 드라이브 멤버가 상기 제 2 위치에 있을 때에 상기 드라이브 멤버의 미끄러짐을 방지하는 제 2 마찰부재를 더 포함하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 5 항에 있어서,상기 바디 플레이트는,상기 구동 플레이트의 직선 이동 시 상기 바디 플레이트에 대한 상기 구동 플레이트의 각도를 고정하는 제 1 마찰부재; 및상기 구동 플레이트와 커플링 된 드라이브 멤버가 상기 제 2 위치에 있을 때에 상기 구동 플레이트의 위치를 고정하는 제 2 마찰부재를 더 포함하고,상기 제 1 마찰부재는 상기 드라이브 커플링 유닛의 스위블 락 홈과 맞물려 상기 드라이브 커플링 유닛의 회전을 방지하고, 상기 제 2 마찰부재는 상기 드라이브 멤버의 상기 프레임 유닛의 상기 슬라이드 가이드와 접하는양 측에 배치된 락킹 유닛 그루브와 맞물려 상기 드라이브 멤버의 상기 제 2 위치에서 미끄러짐을 방지하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 2 항에 있어서,상기 슬라이드 가이드는, 상기 슬라이드 가이드의 길이 방향과 평행한 기어 랙을 포함하고,상기 드라이브 멤버는, 상기 슬라이드 가이드의 기어 랙과 맞물려 구동되는 슬라이드 기어를 더 포함하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 디스플레이 장치는 상기 구동 플레이트에 대하여 자기력에 의해 부착 및 탈착 되는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 구동 플레이트는, 상기 디스플레이 장치에 내장된 배터리를 충전시키는 충전 유닛을 더 포함하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2023-0089516-5-제 1 항에 있어서,상기 스탠드 플레이트는, 상기 바디 플레이트의 힌지 유닛을 포함하는 에지에 대하여 접하도록 구성되며,상기 힌지 유닛에 의해 상기 스탠드 플레이트 및 상기 바디 플레이트 사이의 각도가 조절되는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서,상기 구동 플레이트는,상기 구동 플레이트의 상기 제 1 면에 부착되는 서로 다른 상기 디스플레이 장치의 정보를 식별하는 장치 식별유닛을 더 포함하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 2 항에 있어서,상기 바디 플레이트는 스피커를 더 포함하고,상기 스피커는 상기 드라이브 멤버가 상기 제 2 위치에 배치될 때에 활성화 되는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "디스플레이 장치용 거치 디바이스에 있어서,제 1 면 및 상기 제 1 면에 반대되는 제 2 면을 포함하고, 상기 제 1 면에 디스플레이 장치가 부착되어 상기 디스플레이 장치와 일체로 움직이는 구동 플레이트;상기 구동 플레이트의 상기 제 2 면의 적어도 일부와 접촉되도록 나란히 배치되는, 바디 플레이트;상기 바디 플레이트의 상기 구동 플레이트와 결합된 면의 반대 면에 배치되며, 상기 바디 플레이트의 적어도 하나의 에지에 접하도록 구성되는, 스탠드 플레이트를 포함하고,상기 바디 플레이트는, 상기 구동 플레이트의 직선 이동 시 상기 바디 플레이트에 대한 상기 구동 플레이트의각도를 고정하는 제 1 마찰부재를 포함하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 바디 플레이트는,상기 구동 플레이트의 상기 제 2 면과 커플링 되어 상기 구동 플레이트의 직선 이동 및 회전 운동을 유도하는드라이브 멤버; 및상기 드라이브 멤버의 직선 이동 경로를 안내하는 슬라이드 가이드공개특허 10-2023-0089516-6-를 더 포함하고,상기 슬라이드 가이드는, 상기 구동 플레이트의 상기 제 2 면이 상기 바디 플레이트와 접촉되는 면적이 최대일때의 상기 드라이브 멤버가 배치되는 제 1 위치; 및 상기 구동 플레이트의 상기 제 2 면이 상기 바디 플레이트와 접촉되는 면적이 최소일 때 상기 드라이브 멤버가 배치되는 제 2 위치를 포함하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 드라이브 멤버는, 상기 바디 플레이트의 상기 제 1 마찰부재와 맞물리는 스위블 락 홈을 포함하며,상기 제 1 마찰부재는, 상기 슬라이드 가이드 상의 상기 직선 이동 경로를 따라 상기 구동 플레이트의 상기 제2 면을 향하는 방향으로 돌출되어 형성되고,상기 드라이브 멤버가 상기 제 2 위치에 배치되면 상기 스위블 락 홈이 상기 제 1 마찰부재와 맞물림이 해제되는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 16 항에 있어서,상기 바디 플레이트는, 상기 구동 플레이트의 미끄러짐을 방지하는 제 2 마찰부재를 더 포함하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "디스플레이 장치용 거치 디바이스에 있어서,제 1 면 및 상기 제 1 면에 반대되는 제 2 면을 포함하고, 상기 제 1 면에 디스플레이 장치가 부착되어 상기 디스플레이 장치와 일체로 움직이는 구동 플레이트;상기 구동 플레이트의 상기 제 2 면의 적어도 일부와 접촉되도록 나란히 배치되며, 상기 구동 플레이트의 직선이동을 막는 락킹 유닛을 포함하는, 바디 플레이트;상기 바디 플레이트의 상기 구동 플레이트와 결합된 면의 반대 면에 배치되며, 상기 바디 플레이트의 적어도 하나의 에지에 접하도록 구성되는, 스탠드 플레이트를 포함하고,상기 락킹 유닛은, 상기 바디 플레이트 및 상기 스탠드 플레이트가 겹쳐져 나란히 배치되는 그라운드 모드에서는 잠금이 유지되고, 상기 바디 플레이트 및 상기 스탠드 플레이트가 상기 에지를 축으로 일정 간격 이상 이격되어 배치되는 스탠드 모드에서는 잠금이 해제되며,상기 바디 플레이트는, 상기 구동 플레이트의 직선 이동 시 상기 바디 플레이트에 대한 상기 구동 플레이트의각도를 고정하는 제 1 마찰부재; 및 상기 구동 플레이트의 미끄러짐을 방지하는 제 2 마찰부재를 포함하는,거치 디바이스."}
{"patent_id": "10-2022-0045222", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시 예들에 따른 디스플레이 장치용 거치 디바이스는, 제 1 면 및 상기 제 1 면에 반대되는 제 2 면을 포함하고, 상기 제 1 면에 디스플레이 장치가 부착되어 상기 디스플레이 장치와 일체로 움직이는 구동 플레이트, 상기 구동 플레이트의 상기 제 2 면의 적어도 일부와 접촉되도록 나란히 배치되며, 상기 구동 플레이트의 직선 이동을 막는 락킹 유닛을 포함하는, 바디 플레이트, 상기 바디 플레이트의 상기 구동 플레이트와 결합된 면의 반 대 면에 배치되는, 스탠드 플레이트를 포함하고, 상기 락킹 유닛은, 상기 바디 플레이트 및 상기 스탠드 플레이 트가 겹쳐져 나란히 배치되는 그라운드 모드에서는 잠금이 유지되고, 상기 바디 플레이트 및 상기 스탠드 플레이 트가 이격 되어 배치되는 스탠드 모드에서는 잠금이 해제될 수 있다."}
{"patent_id": "10-2022-0045222", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이하의 다양한 실시 예들은 디스플레이 장치용 거치 디바이스에 관한 것이다."}
{"patent_id": "10-2022-0045222", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다양한 종류의 디스플레이 장치(예: 핸드폰, 타블렛, TV)가 개발됨에 따라, 디스플레이 장치용 거치 디바이스가 개발되고 있다. 그에 따라 다양한 기능(예: 디스플레이 장치의 회전, 슬라이드 기능)을 갖는 디스플레이 장치용 거치 디바이스에 대한 수요가 증가하고 있다."}
{"patent_id": "10-2022-0045222", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "다양한 실시 예들에 따르면, 사용자의 사용 환경에 맞는 디스플레이 장치의 높이 및 각도를 제공할 수 있는 디 스플레이 장치용 거치 디바이스를 제공할 수 있다."}
{"patent_id": "10-2022-0045222", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시 예들에 따른 디스플레이 장치용 거치 디바이스는, 제 1 면 및 상기 제 1 면에 반대되는 제 2 면을 포함하고, 상기 제 1 면에 디스플레이 장치가 부착되어 상기 디스플레이 장치와 일체로 움직이는 구동 플레이트, 상기 구동 플레이트의 상기 제 2 면의 적어도 일부와 접촉되도록 나란히 배치되며, 상기 구동 플레이 트의 직선 이동을 막는 락킹 유닛을 포함하는, 바디 플레이트, 상기 바디 플레이트의 상기 구동 플레이트와 결 합된 면의 반대 면에 배치되는, 스탠드 플레이트를 포함하고, 상기 락킹 유닛은, 상기 바디 플레이트 및 상기 스탠드 플레이트가 겹쳐져 나란히 배치되는 그라운드 모드에서는 잠금이 유지되고, 상기 바디 플레이트 및 상기 스탠드 플레이트가 이격 되어 배치되는 스탠드 모드에서는 잠금이 해제될 수 있다. 다양한 실시 예들에 따른 디스플레이 장치용 거치 디바이스는, 제 1 면 및 상기 제 1 면에 반대되는 제 2 면을 포함하고, 상기 제 1 면에 디스플레이 장치가 부착되어 상기 디스플레이 장치와 일체로 움직이는 구동 플레이트, 상기 구동 플레이트의 상기 제 2 면의 적어도 일부와 접촉되도록 나란히 배치되는, 바디 플레이트, 상기 바디 플레이트의 상기 구동 플레이트와 결합된 면의 반대 면에 배치되며, 상기 바디 플레이트의 적어도 하 나의 에지에 접하도록 구성되는, 스탠드 플레이트를 포함하고, 상기 바디 플레이트는, 상기 구동 플레이트의 직 선 이동 시 상기 바디 플레이트에 대한 상기 구동 플레이트의 각도를 고정하고, 하단에서 상기 디스플레이 장치 의 회전을 방지하는 제 1 마찰부재를 포함할 수 있다. 다양한 실시 예들에 따른 디스플레이 장치용 거치 디바이스는, 제 1 면 및 상기 제 1 면에 반대되는 제 2 면을 포함하고, 상기 제 1 면에 디스플레이 장치가 부착되어 상기 디스플레이 장치와 일체로 움직이는 구동 플레이트, 상기 구동 플레이트의 상기 제 2 면의 적어도 일부와 접촉되도록 나란히 배치되며, 상기 구동 플레이 트의 직선 이동을 막는 락킹 유닛을 포함하는, 바디 플레이트, 상기 바디 플레이트의 상기 구동 플레이트와 결 합된 면의 반대 면에 배치되며, 상기 바디 플레이트의 적어도 하나의 에지에 접하도록 구성되는, 스탠드 플레이 트를 포함하고, 상기 락킹 유닛은, 상기 바디 플레이트 및 상기 스탠드 플레이트가 겹쳐져 나란히 배치되는 그 라운드 모드에서는 잠금이 유지되고, 상기 바디 플레이트 및 상기 스탠드 플레이트가 상기 에지를 축으로 일정 간격 이상 이격 되어 배치되는 스탠드 모드에서는 잠금이 해제되며, 상기 바디 플레이트는, 상기 구동 플레이트 의 직선 이동 시 상기 바디 플레이트에 대한 상기 구동 플레이트의 각도를 고정하는 제 1 마찰부재 및 상기 구 동 플레이트가 상기 바디 플레이트의 상단에서 하단으로 미끄러지는 것을 방지하는 제 2 마찰부재를 포함할 수 있다."}
{"patent_id": "10-2022-0045222", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예들에 따르면, 거치 디바이스와 디스플레이 장치를 쉽게 부착 및 분리할 수 있다. 다양한 실시 예 들에 따르면, 다양한 사이즈의 디스플레이 장치와 호환하여 체결될 수 있으며 거치 디바이스는 디스플레이 장치 의 사이즈를 인식하여 작동할 수 있다. 다양한 실시 예들에 따르면, 디스플레이 장치의 사용자들로 하여금 사용 자의 환경에 맞는 눈높이와 각도를 쉽게 조정할 수 있다. 다양한 실시 예들에 따른 전자 장치의 효과는 이상에 서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 통상의 기술자에게 명확 하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0045222", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈 , 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리 , 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들면, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르 면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다 른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보 조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들면, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들면, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용 되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들면, 소프트웨어(예: 프로그램) 및, 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발 성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치(10 1)의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키(예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다.오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들면, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들면, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들면, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다 른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또 는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청 할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있 다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로 서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들면, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예에 있어서, 외부 의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망 을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워 크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아 이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \" 제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분 하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤 (예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이 런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시 예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포 함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circui t)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치 들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구 성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2a 내지 도 2c는 일 실시 예에 따른 거치 디바이스의 그라운드 모드(예: 도 2a) 및 스탠드 모드(예: 도 2b 및 도 2c)를 나타낸 도면이다. 일 실시 예에서, 거치 디바이스는 충전 유닛, 장치 식별 유닛, 스피커를 포함하는 전자 장치(예: 도 1의 전자 장치)일 수 있다. 도 2a 내지 도 2c를 참조하면, 일 실시 예에 따른 거치 디바이스는, 구동 플레이트, 바디 플레이트 및 스탠드 플레이트를 포함할 수 있다. 일 실시 예에 따른 거치 디바이스는, 바디 플레이트 및 스탠드 플레이트가 겹쳐져 나란히 배치되는 그라운드 모드(예: 도 2a) 또는 바디 플레이트 및 스탠드 플레이트가 이격 되어 배치되는 스탠드 모드(예: 도 2b 및 도2c)로 유지될 수 있다. 일 실시 예에 따른 그라운드 모드에서, 거치 디바이스의 스탠드 플레이트가 바닥면과 접하는 상태로 배치될 수 있다. 일 실시 예에 따른 스탠드 모드에서, 거치 디바이스의 바디 플레이트의 모서리 및스탠드 플레이트의 모서리가 바닥면과 접하는 상태로 배치될 수 있다. 일 실시 예에서, 구동 플레이트는, 제 1 면 및 제 1 면에 반대되는 제 2 면을 포함할 수 있다. 일 실시 예에서, 바디 플레이트는, 구동 플레이트의 제 2 면의 적어도 일부와 접촉되도록 나란 히 배치될 수 있다. 일 실시 예에서, 스탠드 플레이트는, 구동 플레이트와 접촉된 바디 플레이트 의 면의 반대 면의 적어도 일부와 접촉되도록 나란히 배치될 수 있다. 일 실시 예에서, 바디 플레이트에 전력 공급 케이블(C)이 연결될 수 있다. 전력 공급 케이블(C)은, 거치 디바이스에 전력 또는 전원을 공급할 수 있다. 바디 플레이트와 전력 공급 케이블(C)은 여러가지 결 합 방식(예: 자성에 의한 결합 방식, 억지 끼워 맞춤 방식, 핀 커넥팅 방식, 포고핀 결합 방식) 또는 무선 충전 방식에 의해 연결될 수 있다. 도 3a 내지 도 3c는 일 실시 예에 따른 거치 디바이스(예: 도 2a 내지 도 2c의 거치 디바이스)에 일 실시 예에 따른 디스플레이 장치(D)가 부착된 상태를 나타낸 도면이다. 도 3a 내지 도 3c를 참조하면, 일 실시 예에 따른 거치 디바이스(예: 도 2a의 거치 디바이스)에는 디 스플레이 장치(D)가 부착될 수 있다. 일 실시 예에 따른 디스플레이 장치(D)는, 디스플레이 모듈(예: 도 1의 디 스플레이 모듈)을 포함하는 거치 디바이스(예: 핸드폰(cell phone), 태블릿(tablet), 모니터, TV)를 포함 할 수 있다. 일 실시 예에 따른 디스플레이 장치(D)는, 거치 디바이스가 그라운드 모드로 배치되어 있는 경우(예: 도 3a)에 거치 디바이스의 구동 플레이트(예: 도 2a의 구동 플레이트)의 제 1 면(예: 도 2a 의 제 1 면)에 배치될 수 있다. 일 실시 예에 따른 디스플레이 장치(D)는, 거치 디바이스가 스탠드 모드로 배치되어 있는 경우(예: 도 3b 및 도 3c)에 거치 디바이스의 구동 플레이트(예: 도 2a의 구동 플레이트)의 제 1 면(예: 도 2a의 제 1 면)에 배치될 수 있다. 일 실시 예에서, 거치 디바이스의 구동 플레이트의 제 1 면에 배치된 디스플레이 장치(D)는, 구동 플레이트의 제 1 면에 부착되어 구동 플레이트와 일체로 움직일 수 있다. 일 실시 예에서, 디스플레이 장치(D)는 구동 플레이트의 제 1 면에 수직한 방향을 축으로 하여 구동 플레이 트와 함께 회전될 수 있다. 일 실시 예에서, 디스플레이 장치(D)가 회전되기 전에는 디스플레이 모듈(예: 도 1의 디스플레이 모듈)의 세로 방향 길이보다 가로 방향 길이가 더 길게 배치될 수 있으며(예: 도 3b), 디스플레이 장치(D)가 회전된 후에는 디스플레이 모듈(예: 도 1의 디스플레이 모듈)의 세로 방향 길이보다 가로 방향 길이가 더 짧게 배치될 수 있다. 일 실시 예에서, 거치 디바이스는 디스플레이 장치(D)의 전원을 충전시키는 구조를 포함할 수 있다. 예를 들어, 거치 디바이스는 유선 충전 구조(예: 포고핀 결합에 의한 충전 구조) 및/또는 무선 충전 구조를 포 함할 수 있다. 도 4a 및 도 4b는 일 실시 예에 따른 스탠드 모드의 거치 디바이스(예: 도 2a 내지 도 2c의 거치 디바이스 및/또는 도 3a 내지 도 3c의 거치 디바이스)의 전면 분해 사시도 및 후면 분해 사시도이다. 도 4a 및 도 4b를 참조하면, 거치 디바이스(예: 도 2a 내지 도 2c의 거치 디바이스 및/또는 도 3a 내 지 도 3c의 거치 디바이스)는 구동 플레이트(예: 도 3a 내지 도 3c의 구동 플레이트), 바디 플 레이트(예: 도 3a 내지 도 3c의 바디 플레이트) 및 스탠드 플레이트(예: 도 3a 내지 도 3c의 스 탠드 플레이트)를 포함할 수 있다. 일 실시 예에서, 구동 플레이트는 제 1 면(예: 도 3a의 제 1 면) 및 제 1 면에 반대되 는 제 2 면을 포함할 수 있다. 일 실시 예에서, 바디 플레이트는 구동 플레이트의 제 2 면의 적어도 일부와 접촉되도록 나란 히 배치될 수 있다. 일 실시 예에서, 바디 플레이트는 하우징 및 바디 프레임을 포함할 수 있다. 일 실시 예에서, 하우징은 바디 프레임과 결합하여 바디 플레이트의 내부 구성요소들을 커버할 수 있다. 일 실시 예에서, 하우징은 구동 플레이트와 드라이브 멤버가 커플링 되어 이동 할 수 있도록 하는 슬라이드 홀(H)을 포함할 수 있다. 일 실시 예에 따른 슬라이드 홀(H)은 드라이브 멤버(42 4)의 직선 이동 경로를 따라 연장할 수 있다. 일 실시 예에서, 바디 프레임은 바디 플레이트의 내부 구성요소들(예: 락킹 유닛, 드라이브 멤버, 슬라이드 가이드, 제 1 마찰부재, 제 2 마찰부재)을 수용할 수 있다. 일 실시 예에서, 바디 플레이트는, 드라이브 멤버, 슬라이드 가이드, 제 1 마찰부재, 제 2 마찰부재를 더 포함할 수 있다. 제 1 마찰부재 및 제 2 마찰부재는, 드라이브 멤버에 대해 마찰력을 작용시킴으로써, 드라이브 멤버가 바디 플레이트 상에서 구동되는 경우에 병진 운동 또는 회전 운동 시의 움직임을 제한할 수 있다. 일 실시 예에 따른 제 1 마찰부재 및 제 2 마찰부재는 내 구성을 위해 연질 소재의 합성 수지로 구성될 수 있으며, 예를 들어, 폴리옥시메틸렌(polyoxymethylene: POM)과 같은 강성이 높고 마찰에 강하며 내마모성이 우수한 소재로 구성될 수 있다. 일 실시 예에서, 제 1 마찰부재 는 드라이브 멤버의 바디 플레이트 상에서의 회전 움직임, 즉 스위블(swivel)을 제한하므로 '스 위블 락'으로 명명될 수 있다. 일 실시 예에서, 제 2 마찰부재는 드라이브 멤버의 바디 플레이트 상에서의 상하 병진 움직임, 즉 슬립(slip)을 제한하므로 '슬립 락'으로 명명될 수 있다. 스위블 락 및 슬립 락과 관련하여, 도 5a 내지 도 6d를 참조하여 이하에서 더욱 상세히 설명한다. 일 실시 예에서, 스탠드 플레이트는, 힌지 유닛을 포함할 수 있다. 일 실시 예에 따른 힌지 유닛 은 제 1 블록(431a), 제 2 블록(431b) 및 힌지 샤프트(431c)를 포함할 수 있다. 일 실시 예에 따른 힌지 유닛의 제 1 블록(431a)은 바디 플레이트의 바디 프레임과 커플링 되고, 힌지 유닛의 제 2 블록(431b)은 스탠드 플레이트와 커플링 될 수 있다. 일 실시 예에 따른 힌지 유닛은, 힌지 샤프트 (431c)를 축으로 제 1 블록(431a) 및 제 2 블록(431b) 사이의 각도가 변화할 수 있다. 일 실시 예에서, 스탠드 플레이트는, 힌지 유닛의 제 1 블록(431a)과 커플링 된 바디 플레이트의 에지와 접하도록 구성 될 수 있다. 일 실시 예에서, 제 1 블록(431a) 및 제 2 블록(431b) 사이의 각도 변화에 따라 제 1 블록(431a)에 커플링 된 바디 플레이트 및 제 2 블록(431b)에 커플링 된 스탠드 플레이트 사이의 각도가 함께 변화 할 수 있다. 도 5a 내지 도 5d는 일 실시 예에 따른 거치 디바이스(예: 도 4a 및 도 4b의 거치 디바이스)의 바디 플레 이트(예: 도 4a 및 도 4b의 바디 플레이트) 및 바디 플레이트에 포함되는 구성요소들을 나타낸 도면이다. 도 5a 및 도 5b를 참조하면, 바디 플레이트는 락킹 유닛, 드라이브 멤버(예: 도 4a 및 도 4b의 드라이브 멤버), 슬라이드 가이드(예: 도 5a 및 도 5b의 슬라이드 가이드), 스위블 락(예: 도 4a 및 도 4b의 제 1 마찰부재), 슬립 락(예: 도 4a 및 도 4b의 제 2 마찰부재)을 포함할 수 있다. 일 실시 예에서, 락킹 유닛은 거치 디바이스(예: 도 4a 및 도4b의 거치 디바이스)가 그라운드 모드에 있을 때에 디스플레이 장치(예: 도 3a 내지 도 3c의 디스플레이 장치(D))가 이동하지 못하도록 막을 수 있다. 일 실시 예에 따른 락킹 유닛은, 거치 디바이스가 그라운드 모드에 있을 때에 바디 플레이트 상에서 디스플레이 장치(D)의 슬라이딩 움직임을 제한하므로, '슬라이드 락'으로 명명될 수 있다. 일 실시 예에서, 드라이브 멤버는, 구동 플레이트(예: 도 4a 및 도 4b의 구동 플레이트)의 제 2 면 (예: 도 4a 및 도 4b의 제 2 면)과 결합되어 일체로서 바디 플레이트 상에서 이동할 수 있다. 일 실시 예에서, 슬라이드 가이드는, 바디 프레임(예: 도 4a 및 도 4b의 바디 프레임) 상에 오목하게 형성될 수 있다. 슬라이드 가이드는, 드라이브 멤버의 직선 이동 경로를 안내할 수 있으며, 구동 플 레이트(예: 도 4a 및 도 4b의 구동 플레이트)의 제 2 면(예: 도 4a 및 도 4b의 제 2 면)이 바디 플 레이트와 접촉되는 면적이 최대일 때의 드라이브 멤버가 배치되는 제 1 위치(예: 도 5a에서 드라이브 멤버가 슬라이드 가이드의 하단에 배치되는 위치) 및 구동 플레이트(예: 도 4a 및 도 4b의 구동 플레 이트)의 제 2 면(예: 도 4a 및 도 4b의 제 2 면)이 바디 플레이트와 접촉되는 면적이 최소일 때의 드라이브 멤버가 배치되는 제 2 위치(예: 도 5b에서 드라이브 멤버가 슬라이드 가이드의 상단에 배치되는 위치)를 포함할 수 있다. 일 실시 예에서, 스위블 락(예: 도 4a 및 도 4b의 제 1 마찰부재)은, 슬라이드 가이드 상에서 구동 플레이트(예: 도 4a 및 도 4b의 구동 플레이트)의 제 2 면(예: 도 4a 및 도 4b의 제 2 면)을 향하는 방향으로 돌출되어 형성되며, 드라이브 멤버의 직선 이동 경로를 따라 연장할 수 있다. 일 실시 예 에 따른 스위블 락은, 구동 플레이트(예: 도 4a 및 도 4b의 구동 플레이트)의 직선 이동 시 바디 플 레이트(예: 도 4a 및 도 4b의 바디 플레이트)에 대한 구동 플레이트의 각도를 고정할 수 있다. 일 실시 예에서, 슬립 락(예: 도 4a 및 도 4b의 제 2 마찰부재)은, 드라이브 멤버가 제 2 위치 (예: 도 5b)에 배치되는 경우에 드라이브 멤버의 락킹 유닛 그루브(FG2)(예: 도 5d)와 커플링 되는 돌출부 를 포함할 수 있다. 일 실시 예에 따른 슬립 락은, 드라이브 멤버가 제 2 위치에 있을 때에 드라이브 멤버와 커플링 되어 드라이브 멤버 및/또는 드라이브 멤버와 커플링 되는 구동 플레이트(예: 도 4a 및 도 4b의 구동 플레이트)의 미끄러짐을 방지할 수 있다. 일 실시 예에 따른 바디 플레이트는, 힌지 유닛(예: 도 4a 및 도 4b의 힌지 유닛)의 제 1 블록 (예: 도 4a 및 도 4b의 제 1 블록(431a))과 커플링 되어, 힌지 샤프트(예: 도 4a 및 도 4b의 힌지 샤프트 (431c))를 축으로 하여 바디 플레이트 및 스탠드 플레이트(예: 도 4a 및 도 4b의 스탠드 플레이트) 사이의 각도가 조절 가능할 수 있다. 일 실시 예에서, 바디 플레이트는, 한 쌍 이상의 가이드 스프링 유닛(GS)을 포함할 수 있다. 일 실시 예에 따른 가이드 스프링 유닛(GS)은, 드라이브 멤버가 제 1 위치 및 제 2 위치 사이의 직선 이동 경로를 이동 (예: 슬라이딩)하는 경우에 드라이브 멤버의 직선 이동 경로와 평행한 경로를 따라 이동할 수 있다. 일 실 시 예에서, 가이드 스프링 유닛(GS)은 한 쌍의 토션 스프링(torsion spring)을 포함할 수 있다. 일 실시 예에 따른 가이드 스프링 유닛(GS)의 일 단부에는 슬라이드 가이드의 외측에 커플링 되는 보조 슬라이더(AS)를 포함할 수 있고, 타 단부에는 바디 플레이트의 하우징(예: 도 4a 및 도 4b의 하우징)에 체결되는 슬 라이드 커플러(SC)를 포함할 수 있다. 일 실시 예에서, 가이드 스프링 유닛(GS)은, 드라이브 멤버에 결합 된 디스플레이 장치(D)가 제 1 위치에서 제 2 위치로 이동하는 경우에 중력의 반대 방향으로 탄성력을 작용하여 반자동 구동 방식에 의해 드라이브 멤버가 제 1 위치에서 제 2 위치로 용이하게 이동되도록 할 수 있다.도 5c 및 도 5d를 참조하여, 슬라이드 락(예: 도 5a의 락킹 유닛)의 구조에 관해 상세히 설명한다. 슬라이드 락은, 잠금 부재(523a) 및 락킹 유닛 스프링(523b)을 포함할 수 있다. 드라이브 멤버는, 드라이브 커 플링 유닛(524a), 프레임 유닛(524b), 스위블 가이드 탄성체(524c) 및 높이 고정 유닛(524d)을 포함할 수 있다. 일 실시 예에서, 드라이브 멤버의 프레임 유닛(524b)은, 회전 홈(FG1) 및 락킹 유닛 그루브(FG2)를 포함할 수 있다. 일 실시 예에서, 슬라이드 락의 잠금 부재(523a)는, 드라이브 멤버가 제 1 위치(예: 도 5a에서 드라 이브 멤버가 슬라이드 가이드의 하단에 배치되는 위치)에 배치되는 경우에 드라이브 멤버의 적 어도 일 측에 배치되는 락킹 유닛 그루브(FG2)와 맞물려 드라이브 멤버가 이동하지 못하도록 할 수 있다. 일 실시 예에서, 슬라이드 락의 락킹 유닛 스프링(523b)은, 잠금 부재(523a)의 슬라이드 가이드를 마 주하는 측면에 배치되어 탄성력을 작용할 수 있다. 일 실시 예에 따른 락킹 유닛 스프링(523b)이 수축된 상태에 서는 잠금 부재(523a)가 드라이브 멤버의 락킹 유닛 그루브(FG2)와 맞물릴 수 있고, 락킹 유닛 스프링 (523b)이 팽창된 상태에서는 잠금 부재(523a)와 드라이브 멤버의 락킹 유닛 그루브(FG2)와 맞물림이 해제 될 수 있다. 일 실시 예에 따른 잠금 부재(523a)는, 제 1 자성체(Ma)를 포함할 수 있다. 일 실시 예에 따른 스탠드 플레이트(예: 도 4a 및 도 4b의 스탠드 플레이트)는, 락킹 유닛 스프링(523b)이 수축된 상태에서 잠금 부재(523a)의 제 1 자성체(Ma)의 위치와 대응되는 위치에 제 2 자성체(Mb)를 포함할 수 있다. 일 실시 예에서, 제 1 자성체(Ma)와 제 2 자성체(Mb)는 서로에 대하여 끌어당기는 힘(예: 인력)이 작용될 수 있다. 일 실시 예에서, 제 1 자성체(Ma)를 포함하는 슬라이드 락을 포함하는 바디 플레이트와 제 2 자성체(Mb)를 포함하는 스탠드 플레이트(예: 도 4a 및 도 4b의 스탠드 플레이트)가 겹쳐져 나란히 배치 되는 그라운드 모드(예: 도 2a)의 경우, 제 1 자성체(Ma)와 제 2 자성체(Mb) 사이에 작용하는 인력이 충분히 강 하여 락킹 유닛 스프링(523b)이 수축된 상태로 유지될 수 있고, 슬라이드 락의 잠금이 유지되어 드라이브 멤버의 이동(예: 슬라이딩)이 막힐 수 있다. 다른 실시 예에서, 제 1 자성체(Ma)를 포함하는 슬라이드 락 을 포함하는 바디 플레이트와 제 2 자성체(Mb)를 포함하는 스탠드 플레이트(예: 도 4a 및 도 4b의 스 탠드 플레이트)가 이격되어 배치되는 스탠드 모드(예: 도 2b 및/또는 도 2c)의 경우, 제 1 자성체(Ma)와 제 2 자성체(Mb) 사이에 작용하는 인력이 약해져 락킹 유닛 스프링(523b)이 팽창된 상태로 유지될 수 있고, 슬 라이드 락의 잠금이 해제되어 드라이브 멤버의 자유로운 이동(예: 슬라이딩)이 가능해질 수 있다. 도 6a 내지 도 6d는 일 실시 예에 따른 거치 디바이스(예: 도 2a 내지 도2c의 거치 디바이스 및/또는 도 4a 및 도 4b의 거치 디바이스)의 드라이브 멤버를 여러 각도 및 상태에 따라 나타낸 도면이다. 도 6a 내지 도 6d를 참조하여, 드라이브 멤버(예: 도 5a 내지 도 5c의 드라이브 멤버), 스위블 락(예: 도 5a 내지 도 5c의 스위블 락) 및 슬립 락(예: 도 5a 내지 도 5c의 슬립 락)에 관하여 상세히 설명한다.도 6a 및 도 6b를 참조하면, 일 실시 예에 따른 드라이브 멤버는, 드라이브 커플링 유닛(624a)(예: 도 5c 및 도 5d의 드라이브 커플링 유닛(524a)), 프레임 유닛(624b)(예: 도 5c 및 도 5d의 프레임 유닛(524a)), 스위 블 가이드 탄성체(624c)(예: 도 5c 및 도 5d의 스위블 가이드 탄성체(524c)) 및 높이 고정 유닛(624d)(예: 도 5c 및 도 5d의 높이 고정 유닛(624d))을 포함할 수 있다. 일 실시 예에서, 드라이브 커플링 유닛(624a)은, 구동 플레이트(예: 도 4a 및 도 4b의 구동 플레이트)의 제 2 면(예: 도 4a 및 도 4b의 제 2 면)과 커플링 될 수 있다. 일 실시 예에서, 드라이브 커플링 유닛 (624a)은, 정다각형 구조를 가질 수 있다. 다른 실시 예에서, 드라이브 커플링 유닛(624a)은, 정사각형 구조를 가질 수 있다. 일 실시 예에서, 프레임 유닛(624b)은, 드라이브 커플링 유닛(624a)을 둘러싸도록 배치될 수 있다. 일 실시 예 에 따른 프레임 유닛(624b)은, 슬라이드 가이드(예: 도 5a 및 도 5b의 슬라이드 가이드)를 따라 직선 이동 할 수 있다. 일 실시 예에 따른 프레임 유닛(624b)은, 드라이브 커플링 유닛(624a)의 회전 운동을 안내하는 회 전 홈(FG1)을 포함할 수 있고, 드라이브 커플링 유닛(624a)은 프레임 유닛(624b)의 회전 홈(FG1)에서 회전될 수 있다. 일 실시 예에 따른 프레임 유닛(624b)은, 드라이브 커플링 유닛(624a)이 슬라이드 가이드 상의 제 1 위치에 있을 때에 직선 운동을 막는 슬라이드 락(예: 도 5c 및 도 5d의 슬라이드 락) 또는 드라이브 커플 링 유닛(624a)이 슬라이드 가이드 상의 제 2 위치에 있을 때에 미끄러짐을 막는 슬립 락(예: 도 5a 및 도 5b의 슬립 락)과 맞물리는 락킹 유닛 그루브(FG2)를 포함할 수 있다. 일 실시 예에서, 스위블 가이드 탄성체(624c)는, 드라이브 커플링 유닛(624a)의 양측면과 프레임 유닛(624b)의 내측면에 접하게 배치될 수 있다. 일 실시 예에 따른 스위블 가이드 탄성체(624c)는, 드라이브 커플링 유닛 (624a)과 프레임 유닛(624b) 사이에서 탄성적으로 변형하도록 구성될 수 있다. 일 실시 예에서, 높이 고정 유닛(624d)(예: 도 5c 및 도 5d의 높이 고정 유닛(624d))은, 프레임 유닛(624b)에 커플링 되어 일 방향(예: 슬라이드 가이드(예: 도 5a 및 도 5b의 슬라이드 가이드)의 제 2 위치에서 제 1 위치를 향하는 방향)으로 연장할 수 있다. 일 실시 예에 따른 높이 고정 유닛(624d)의 일 단부가 슬라이드 가이 드의 일 단부에 형성되는 턱(미도시)과 접하는 경우에 드라이브 멤버의 일 방향(예: 슬라이드 가이드 (예: 도 5a 및 도 5b의 슬라이드 가이드)의 제 2 위치에서 제 1 위치를 향하는 방향)을 향한 직선 이동이 정지될 수 있다. 도 6c및 도 6d를 참조하면, 드라이브 멤버는, 스위블 락 홈(DG)을 더 포함할 수 있다. 일 실시 예에 따른 스위블 락 홈(DG)은, 바디 플레이트(예: 도 5a 및 도 5b의 바디 플레이트)의 스위블 락(예: 도 5a 및 도 5b의 스위블 락)과 맞물릴 수 있다. 일 실시 예에서, 드라이브 멤버가 슬라이드 가이드 상의 제 1 위치(예: 도 6c)로부터 슬라이드 가이드 상의 제 2 위치에 도달하기 전까지 스위블 락 홈(DG)은 스위 블 락과 계속해서 맞물림을 유지할 수 있다. 스위블 락 홈(DG) 및 스위블 락의 맞물림 구조에 의해 드라이브 멤버가 제 2 위치에 도달하기 전에는 커플링 유닛이 회전될 수 없고, 이는 드라이브 멤버에 커플링 되는 디스플레이 장치(D)의 손상을 막기 위함이다. 다른 실시 예에서, 드라이브 멤버가 슬라이드 가이드 상의 제 2 위치에 배치되는 경우(예: 도 6d)에 스위블 락 홈(DG)은 스위블 락과 맞물림이 해 제될 수 있다. 일 실시 예에 따른 스위블 락 홈(DG) 및 스위블 락의 맞물림이 해제되면, 드라이브 커플링 유닛(624a)은 프레임 유닛(624b)의 회전 홈(FG1)에서 자유롭게 회전될 수 있다. 일 실시 예에서, 드라이브 멤버 가 제 2 위치(예: 도 6d)에 배치되는 경우, 드라이브 멤버의 락킹 유닛 그루브(FG2)(예: 도 6c)은 슬 립 락의 돌출부와 커플링 되어 드라이브 멤버 및/또는 드라이브 멤버와 커플링 되는 구동 플레 이트(예: 도 4a 및 도 4b의 구동 플레이트)가 레일 가이드 상에서 미끄러지지 않고 제 2 위치에 고정될 수 있다. 다른 실시 예에서, 거치 디바이스는 스피커, 바람직하게는 둘 이상의 스피커를 더 포함할 수 있으며, 일 실시 예에 따른 스피커는 드라이브 멤버가 제 2 위치(예: 도 6d)에 배치되는 경우에 드라이브 멤버와 커플링 되는 구동 플레이트가 거치 디바이스 상에서 플로팅 모드로 변화됨으로써 활성화될 수 있다. 도 7은 일 실시 예에 따른 드라이브 멤버(예: 도 6a 내지 도 6d의 드라이브 멤버)가 제 1 위치에 위 치하는 상태에서 바디 플레이트(예: 도 5a 또는 도 5b의 바디 플레이트) 및 바디 플레이트에 포 함되는 구성요소들(예: 슬라이드 락, 드라이브 멤버, 슬라이드 가이드, 스위블 락, 슬립 락)을 개략적으로 나타낸 도면이다. 일 실시 예에서, 바디 플레이트는, 슬라이드 락(예: 도 5a 및 도 5b의 슬라이드 락), 드라이브 멤버(예: 도 5a 및 도 5b의 드라이브 멤버), 슬라이드 가이 드(예: 도 5a 및 도 5b의 슬라이드 가이드), 스위블 락(예: 도 5a 및 도 5b의 스위블 락), 슬립 락(예: 도 5a 및 도 5b의 슬립 락)을 포함할 수 있다. 일 실시 예에서, 드라이브 멤버는, 드라이브 커플링 유닛(예: 도 5c 및 도 5d의 드라이브 커플링 유닛 (524a)), 프레임 유닛(예: 도 5c및 도 5d의 프레임 유닛(524b)), 스위블 가이드 탄성체(예: 도 5c 및 도 5d의 스위블 가이드 탄성체(524c)) 및 높이 고정 유닛(예: 도 5c 및 도 5d의 높이 고정 유닛(524d))을 포함할 수 있 다. 일 실시 예에서, 드라이브 멤버는, 슬라이드 기어(724e)를 더 포함할 수 있다. 일 실시 예에서, 슬라이드 가이드는, 기어 랙(725a)을 포함할 수 있다. 일 실시 예에서, 드라이브 멤버가 슬라이드 가이드 상의 제 1 위치에서 제 2 위치까지 이동(예: 슬라 이딩)하는 경우에 드라이브 멤버의 슬라이드 기어(724e) 및 슬라이드 가이드의 기어 랙(725a)은 서로 맞물려 구동될 수 있다. 일 실시 예에 따른 슬라이드 기어(724e) 및 기어 랙(725a)의 맞물림 구조에 의해, 드라 이브 멤버는 슬라이드 가이드 상의 제 1 위치 및 제 2 위치 사이의 임의의 위치에서 미끄러지지 않고 정지될 수 있다. 일 실시 예에 따른 슬라이드 기어(724e) 및 기어 랙(725a)의 맞물림 구조에 의해, 구동 플레이 트(예: 도 4a 및/또는 도 4b의 구동 플레이트)에 부착되는 디스플레이 장치(D)의 크기 또는 형태에 따라 거치되는 위치를 용이하게 조절할 수 있다. 도 8은 일 실시 예에 따른 거치 디바이스(예: 도 4a 및 도 4b의 거치 디바이스)의 구동 플레이트(예: 도 4a 및 도 4b의 구동 플레이트)의 정면도이다. 도 8을 참조하면, 구동 플레이트는 충전 유닛 및/또는 장치 식별 유닛을 포함할 수 있다. 일 실시 예에서, 구동 플레이트의 충전 유닛은, 유선 충전 구조(811a) 및/또는 무선 충전 구조(811 b)를 포함할 수 있다. 일 실시 예에서, 유선 충전 구조(811a)를 포함하는 충전 유닛은, 디스플레이 장치 (D)에 접촉되는 단자(예: 포고핀 단자)를 포함할 수 있다. 일 실시 예에서, 무선 충전 구조(811b)를 포함하는 충전 유닛은, 코일(미도시), 무선 충전 IC(미도시), 배터리(예: 도 1의 배터리) 및 외부 연결 단자(미도시)를 포함할 수 있다. 일 실시 예에 따른 유선 충전 구조(811a) 및/또는 무선 충전 구조(811b)를 포 함하는 충전 유닛은, 디스플레이 장치(D)의 배터리(예: 도 1의 배터리)가 방전된 상태이거나 가용 전 력량이 지정된 레벨 미만인 경우, 충전 유닛이 전력을 송신하여 디스플레이 장치(D)의 배터리를 충전 시킬 수 있다. 일 실시 예에서, 구동 플레이트의 장치 식별 유닛은, 제 1 식별 유닛(812a), 제 2 식별 유닛(812b) 및 제 3 식별 유닛(812c)을 포함할 수 있다. 각각의 장치 식별 유닛(812a, 812b 또는 812c)은, 디스플레이 장치 (D)가 구동 플레이트에 부착되는 경우에 부착된 디스플레이 장치(D)의 타입(예: 종류, 크기, 소프트웨어 종류)을 식별하여 거치 디바이스(예: 도 4a 및 도 4b의 거치 디바이스)의 내부 구조들의 구동 여부가 결정 될 수 있다. 예를 들면, 제 1 사이즈를 갖는 디스플레이 장치(D)가 거치 디바이스의 구동 플레이트에 부착되는 경우 제 1 식별 유닛(812a)만이 활성화 될 수 있고, 제 2 사이즈를 갖는 디스플레이 장치(D)가 거치 디바이스의 구동 플레이트에 부착되는 경우 제 1 식별 유닛(812a) 및 제 2 식별 유닛(812b)이 함께 활성화 될 수 있으며, 제 3 사이즈를 갖는 디스플레이 장치(D)가 거치 디바이스의 구동 플레이트에 부착되는 경우 제 1 식별 유닛(812a), 제 2 식별 유닛(812b) 및 제 3 식별 유닛(812c)이 모두 활성화 될 수 있 다. 일 실시 예에 따른 장치 식별 유닛은 예를 들어, hall IC 유닛 또는 NFC 유닛일 수 있으며, 반드시 이 에 한정되는 것은 아니다. 본 실시 예에서 장치 식별 유닛의 개수는 3개로 한정되어 설명되었으나, 장치 식별 유닛의 개수 및 구동 플레이트 상에서의 위치는 다양한 실시 예들에 따라 변동될 수 있다. 일 실시 예에서, 구동 플레이트는, 자성체(M2)를 더 포함할 수 있다. 구동 플레이트에 포함되는 자성 체(M2)는, 이중 극 자석(double pole magnet) 또는 다극 자석(multipole magnet)일 수 있으며, 바람직하게는 다극 자석일 수 있다. 일 실시 예에 따른 자성체(M2)와 디스플레이 장치(D)의 부착면에 내장된 자성체(미도시) 간에 인력이 작용할 수 있다. 일 실시 예에 따른 자성체(M2)가 구동 플레이트 상에 배치되는 위치와 디스 플레이 장치(D)의 부착면에 내장된 자성체의 위치가 서로 대응되어, 디스플레이 장치(D)가 구동 플레이트 에 부착되는 경우 강력한 결합력을 형성할 수 있다. 일 실시 예에서, 구동 플레이트의 제 2 면(예: 도 4b 의 제 2 면)의 적어도 일부와 접촉되는 바디 플레이트(예: 도 4a 및 도 4b의 바디 플레이트)에 자성 체(미도시)를 더 포함할 수 있다. 일 실시 예에서, 디스플레이 장치(D)가 구동 플레이트와 함께 회전하는 경우, 구동 플레이트에 포함 되는 자성체(M2) 및 바디 플레이트(예: 도 7의 바디 플레이트)에 포함되는 자성체(M1))가 서로 대응되어 자연스러운 회전 멈춤을 달성할 수 있다. 일 실시 예에 따른 드라이브 멤버(예: 도 4a의 드라이브 멤버)가슬라이드 가이드(예: 도 4a의 슬라이드 가이드) 상의 제1 위치에 배치되는 경우에 바디 플레이트(예: 도 7 의 바디 플레이트) 및 구동 플레이트 간의 배치에서, 바디 플레이트의 자성체(M1)의 위치와 구 동 플레이트의 자성체(M2)의 위치가 서로 대응될 수 있고, 이러한 구조에 의해 구동 플레이트의 회전 운동 시 바디 플레이트의 자성체(M1) 및 구동 플레이트의 자성체(M2) 간의 인력에 의해 회전이 정지 될 수 있다. 바디 플레이트에 포함되는 자성체(M1)는, 이중 극 자석(double pole magnet) 또는 다극 자석 (multipole magnet)일 수 있으며, 바람직하게는 다극 자석일 수 있다. 도 9는 또 다른 실시 예에 따른 거치 디바이스(예: 도 4a 및 도 4b의 거치 디바이스)의 스탠드 모드를 나 타낸 정면도이다. 도 9를 참조하면, 거치 디바이스의 바디 플레이트(예: 도 4a 및 도 4b의 바디 플레 이트)는 스피커를 더 포함할 수 있다. 일 실시 예에 따른 스피커는, 드라이브 멤버(예: 도 5a 및 도 5b의 드라이브 멤버)가 제 1 위치에 배치되어 드라이브 멤버와 커플링 되는 구동 플레이트(예: 도 4a 및 도 4b의 구동 플레이트)에 부착된 디스플레이 장치(D)가 거치 디바이스 상에서 프레임 모드 로 유지되는 경우에는 비활성화 상태로 유지될 수 있고, 드라이브 멤버가 제 2 위치에 배치되어 드라이브 멤버와 커플링 되는 구동 플레이트에 부착된 디스플레이 장치(D)가 거치 디바이스 상에서 플로 팅 모드로 변화되면 활성화될 수 있다. 일 실시 예에 따른 스피커의 비활성화 시에는 디스플레이 장치(D) 에 내장된 스피커 및 거치 디바이스의 하단의 스피커에 의해 프레임 모드에서도 풍부한 음향을 제공한다. 일 실시 예에 따라 디스플레이 장치(D)가 거치 디바이스 상에서 플로팅 모드로 변화되는 경우, 스피커 는 디스플레이 장치(D)에 기본적으로 구비되어 있는 스피커와 결합하여 더욱 풍부한 3D 음질을 제공할 수 있으며, 플로팅 모드로 변화되는 경우 디스플레이 장치(D)에 출력되는 디스플레이 또한 모드에 따라 최적화(예 를 들어, 사운드 이퀄라이저 등의 팝업 창 출력)될 수 있다. 도 10은 일 실시 예에 따른 거치 디바이스의 구동 실시 예를 도시한 사시도이다. 도 10을 참조하면, 거치 디바이스는 미사용 시 그라운드 모드(예: 도 2a)의 상태로 보관 및 유지될 수 있 다. 거치 디바이스를 사용해야 하는 경우, 거치 디바이스의 바디 플레이트(예: 도 3b의 바디 플레이 트) 및 스탠드 플레이트(예: 도 3b의 스탠드 플레이트)를 연결하는 힌지 유닛을 이용하여 저면에 거 치됨으로써 스탠드 모드 상태로 유지될 수 있다. 일 실시 예에 따른 구동 플레이트(예: 도 3b의 구동 플레이트 )의 제 1 면에 디스플레이 장치(D)가 부착될 수 있다(스탠딩 뷰: standing view). 구동 플레이트(예: 도 3b의 구동 플레이트)에 부착된 디스플레이 장치(D)는 스탠드 모드의 거치 디바이스 상에서 상단으로 슬라이드 될 수 있고(플로팅 수평 뷰: floating horizontal view), 상단으로 슬라이드 된 상태에서 회전(스위블)되어 세로로 거치될 수 있다(플로팅 수직 뷰: floating vertical view), 거치 디바이스 및 디 스플레이 장치(D)의 사용이 완료된 경우, 상기의 과정을 반대로 수행함으로써 거치 디바이스 및 디스플레 이 장치(D)를 용이하게 보관 가능하다. 일 실시 예에서, 거치 디바이스(예: 도 3b의 거치 디바이스)는, 디스플레이 장치(D)와의 상호작용을 통해 사용자의 사용 편의성을 증대시킬 수 있다. 이하에서는 일 실시 예에 따른 거치 디바이스와 디스플레이 장 치(D)의 상호작용에 따라 사용 편의성이 증대되는 여러 실시 예에 관하여 설명한다. 도 11 및 도 12는 여러 실시 예에 따른 거치 디바이스의 사용 예를 도시한 도면이다. 도 11을 참조하면, 영상통화 또는 화상회의 시에 거치 디바이스와 디스플레이 장치(D)의 상호작용에 따라 사용자의 사용 편의성이 증대될 수 있다. 일 실시 예에 따른 거치 디바이스 상에 스탠딩 뷰 상태로 거치된 디스플레이 장치(D)는, 거치 디바이스의 기울어진 각도를 인식하여 내장 카메라의 각도 조절 장치를 통해 출력되는 이미지가 보정될 수 있다. 일 실시 예에 따른 거치 디바이스 상에서 디스플레이 장치(D)가 슬라 이드 업(slide-up) 되어 플로팅 수평 뷰 상태로 거치되는 경우, 상단 이동을 인식하여 카메라의 화각 범위를 넓 혀주거나 출력되는 이미지가 보정될 수 있다. 또한, 도 9의 바디 플레이트(예: 도 9의 바디 플레이트)의 하단에 배치되는 스피커(예: 도 9의 스피커)가 개방되어 풍부한 사운드를 제공할 수 있다. 일 실시 예에 따른 스피커는, 거치 디바이스를 사용하는 사용자들로 하여금 디스플레이 장치(D)를 통한 화면 시청 또는 화상 회의 시 출력되는 소리의 음량 및 음질을 개선할 수 있다. 일 실시 예에 따른 거치 디바이스 상 에서 디스플레이 장치(D)가 스위블 되어 플로팅 수직 뷰 상태로 거치되는 경우, 회전을 인식하여 출력되는 이미 지가 디스플레이 장치(D)의 디스플레이 중앙에 위치될 수 있도록 보정 출력될 수 있다. 또한, 출력되는 영상통 화 화면이 상하로 분할되어 더욱 용이한 영상통화 또는 화상회의가 이루어지도록 할 수 있다. 도 12를 참조하면, 거치 디바이스와 디스플레이 장치(D)의 상호작용에 따라 디스플레이 장치(D)의 UI 출력 이 조정됨으로써 사용자의 사용 편의성이 증대될 수 있다. 일 실시 예에 따른 거치 디바이스 상에 스탠딩뷰 상태로 거치된 디스플레이 장치(D)의 디스플레이는 하단에 설정 컨트롤 바(setting control bar)를 출력할 수 있다. 일 실시 예에 따른 디스플레이 장치(D)가 거치 디바이스 상에서 슬라이드 업 되어 플로팅 수평 뷰 상태로 거치되는 경우, 디스플레이 장치(D)의 디스플레이는 플로팅 수평 뷰로의 변환을 인식하여 다양한 팝 업 창을 띄울 수 있다. 도 11 및 도 12를 참조하여 거치 디바이스와 디스플레이 장치(D)의 상호작용에 따라 사용 편의성이 증대되 는 여러 실시 예에 관하여 설명하였으나, 상기의 실시 예는 예시적인 것에 불과하며 통상의 기술자가 용이하게 생각해낼 수 있는 다양한 상호작용에 따른 사용 편의성이 달성될 수 있다.다양한 실시 예들에 따른 디스플레이 장치(D) 거치용 거치 디바이스는, 제 1 면 및 상기 제 1 면에 반대되는 제 2 면을 포 함하고, 상기 제 1 면에 디스플레이 장치(D)가 부착되어 상기 디스플레이 장치(D)와 일체로 움직이는 구 동 플레이트, 상기 구동 플레이트의 상기 제 2 면의 적어도 일부와 접촉되도록 나란히 배치되 며, 상기 구동 플레이트의 직선 이동을 막는 락킹 유닛을 포함하는, 바디 플레이트, 상기 바디 플레이트의 상기 구동 플레이트와 결합된 면의 반대 면에 배치되는, 스탠드 플레이트를 포함하 고, 상기 락킹 유닛은, 상기 바디 플레이트 및 상기 스탠드 플레이트가 겹쳐져 나란히 배치되는 그라운드 모드에서는 잠금이 유지되고, 상기 바디 플레이트 및 상기 스탠드 플레이트가 이격 되어 배 치되는 스탠드 모드에서는 잠금이 해제될 수 있다. 일 실시 예에서, 상기 바디 플레이트는, 상기 구동 플레이트의 상기 제 2 면과 커플링 되어 상 기 구동 플레이트의 직선 이동 및 회전 운동을 유도하는 드라이브 멤버(424, 524) 및 상기 드라이브 멤버 (424, 524)의 직선 이동 경로를 안내하는 슬라이드 가이드(425, 525)를 더 포함하고, 상기 슬라이드 가이드 는, 상기 구동 플레이트의 상기 제 2 면이 상기 바디 플레이트와 접촉되는 면적이 최대일 때의 상기 드라이브 멤버(424, 524)가 배치되는 제 1 위치 및 상기 구동 플레이트의 상기 제 2 면이 상기 바디 플레이트와 접촉되는 면적이 최소일 때 상기 드라이브 멤버(424, 524)가 배치되는 제 2 위치를 포함할 수 있다. 일 실시 예에서, 상기 락킹 유닛은, 상기 드라이브 멤버(424, 524)의 상기 슬라이드 가이드(425, 525)와 접하는 양 측에 배치된 락킹 유닛 그루브(FG2)와 맞물려 상기 드라이브 멤버(424, 524)가 상기 제 1 위치에 고 정되도록 하는 잠금 부재(523a), 상기 잠금 부재(523a)의 상기 슬라이드 가이드를 향하는 측에 배치되는, 락킹 유닛 스프링(523b)을 포함하고, 상기 락킹 유닛 스프링(523b)은, 상기 그라운드 모드에서는 수축된 상태로 유지되어 상기 잠금 부재(523a)가 상기 락킹 유닛 그루브(FG2)와 맞물리도록 하고, 상기 스탠드 모드에서는 팽 창된 상태로 유지되어 상기 잠금 부재(523a)가 상기 락킹 유닛 그루브(FG2)와 맞물림이 해제되도록 할 수 있다. 일 실시 예에서, 상기 잠금 부재(523a)는 제 1 자성체(Ma)를 포함하고, 상기 스탠드 플레이트는, 상기 락 킹 유닛 스프링(523b)이 수축된 상태에서 상기 잠금 부재(523a)의 상기 제 1 자성체(Ma)의 위치와 대응되는 위 치에 제 2 자성체(Mb)를 포함하며, 상기 제 1 자성체(Ma) 및 상기 제 2 자성체(Mb) 간에 인력이 작용할 수 있다. 일 실시 예에서, 상기 드라이브 멤버는, 상기 구동 플레이트와 커플링 되는 드라이브 커플링 유닛 (524a) 및 상기 드라이브 커플링 유닛(524a)을 둘러싸도록 배치되며 상기 드라이브 커플링 유닛(524a)의 회전 운동을 안내하는 회전 홈(FG1)을 포함하고, 상기 슬라이드 가이드를 따라 직선 이동하는 프레임 유닛 (524b)을 포함하고, 상기 드라이브 커플링 유닛(524a)은 상기 프레임 유닛(524b)의 상기 회전 홈(FG1)에서 회전 되는, 일 실시 예에서, 상기 드라이브 멤버는, 상기 프레임 유닛(524b)의 내측면에 배치되어 상기 드라이브 커플 링 유닛(524a)에 대해 탄성력이 작용되는 스위블 가이드 탄성체(524c)를 더 포함하고, 상기 드라이브 커플링 유 닛(524a)은 정사각형 구조를 가질 수 있다. 일 실시 예에서, 상기 바디 플레이트(420, 520)는, 상기 구동 플레이트의 직선 이동 시 상기 바디 플레이 트(420, 520)에 대한 상기 구동 플레이트의 각도를 고정하는 제 1 마찰부재를 더 포함할 수 있다. 일 실시 예에서, 상기 바디 플레이트(420, 520)는, 상기 구동 플레이트와 커플링 된 드라이브 멤버가 상기 제 2 위치에 있을 때에 상기 드라이브 멤버의 미끄러짐을 방지하는 제 2 마찰부재를 더 포함할 수 있다. 일 실시 예에서, 상기 바디 플레이트(420, 520)는, 상기 구동 플레이트의 직선 이동 시 상기 바디 플레이 트(420, 520)에 대한 상기 구동 플레이트의 각도를 고정하는 제 1 마찰부재 및 상기 구동 플레이트와 커플링 된 드라이브 멤버가 상기 제 2 위치에 있을 때에 상기 구동 플레이트의 위치를 고정 하는 제 2 마찰부재를 더 포함하고, 상기 제 1 마찰부재는 상기 드라이브 커플링 유닛(524a)의 스위 블 락 홈(DG)과 맞물려 상기 드라이브 커플링 유닛(524a)의 회전을 방지하고, 상기 제 2 마찰부재는 상기 드라이브 멤버의 상기 프레임 유닛(524b)의 상기 슬라이드 가이드와 접하는 양 측에 배치된 락킹 유 닛 그루브(FG2)와 맞물려 상기 드라이브 멤버의 상기 제 2 위치에서 미끄러짐을 방지할 수 있다. 일 실시 예에서, 상기 슬라이드 가이드(525, 725)는, 상기 슬라이드 가이드(525, 725)의 길이 방향과 평행한 기 어 랙(725a)을 포함하고, 상기 드라이브 멤버(524, 724)는, 상기 슬라이드 가이드(525, 725)의 기어 랙(725a)과 맞물려 구동되는 슬라이드 기어(724e)를 더 포함할 수 있다. 일 실시 예에서, 상기 디스플레이 장치(D)는 상기 구동 플레이트에 대하여 자기력에 의해 부착 및 탈착 될 수 있다. 일 실시 예에서, 상기 구동 플레이트는, 상기 디스플레이 장치(D)에 내장된 배터리(예: 도 1의 배터리 )를 충전시키는 충전 유닛을 더 포함할 수 있다. 일 실시 예에서, 상기 스탠드 플레이트는, 상기 바디 플레이트의 힌지 유닛을 포함하는 에지에 대하 여 접하도록 구성되며, 상기 힌지 유닛에 의해 상기 스탠드 플레이트 및 상기 바디 플레이트 사 이의 각도가 조절될 수 있다. 일 실시 예에서, 상기 구동 플레이트는, 상기 구동 플레이트의 상기 제 1 면에 부착되는 서로 다른 상기 디스플레이 장치(D)의 정보를 식별하는 장치 식별 유닛을 더 포함할 수 있다. 일 실시 예에서, 상기 바디 플레이트는 스피커를 더 포함하고, 상기 스피커는 상기 드라이브 멤 버가 상기 제 2 위치에 배치될 때에 활성화 될 수 있다. 다양한 실시 예들에 따른 디스플레이 장치(D) 거치용 거치 디바이스는, 제 1 면 및 상기 제 1 면 에 반대되는 제 2 면을 포함하고, 상기 제 1 면에 디스플레이 장치(D)가 부착되어 상기 디스 플레이 장치(D)와 일체로 움직이는 구동 플레이트, 상기 구동 플레이트의 상기 제 2 면의 적어 도 일부와 접촉되도록 나란히 배치되는, 바디 플레이트, 상기 바디 플레이트의 상기 구동 플레이트 와 결합된 면의 반대 면에 배치되며, 상기 바디 플레이트의 적어도 하나의 에지에 접하도록 구성되는, 스탠드 플레이트를 포함하고, 상기 바디 플레이트는, 상기 구동 플레이트의 직선 이 동 시 상기 바디 플레이트에 대한 상기 구동 플레이트의 각도를 고정하는 제 1 마찰부재를 포함할 수 있다. 일 실시 예에서, 상기 바디 플레이트는, 상기 구동 플레이트의 상기 제 2 면과 커플링 되어 상 기 구동 플레이트의 직선 이동 및 회전 운동을 유도하는 드라이브 멤버(424, 524) 및 상기 드라이브 멤버 (424, 524)의 직선 이동 경로를 안내하는 슬라이드 가이드(425, 525)를 더 포함하고, 상기 슬라이드 가이드 (425, 525)는, 상기 구동 플레이트의 상기 제 2 면이 상기 바디 플레이트와 접촉되는 면적이 최대일 때의 상기 드라이브 멤버(424, 524)가 배치되는 제 1 위치 및 상기 구동 플레이트의 상기 제 2 면 이 상기 바디 플레이트(420, 520)와 접촉되는 면적이 최소일 때 상기 드라이브 멤버(424, 524)가 배치되 는 제 2 위치를 포함할 수 있다. 일 실시 예에서, 상기 드라이브 멤버는, 상기 바디 플레이트의 상기 제 1 마찰부재와 맞물리는 스위블 락 홈(DG)을 포함하며, 상기 제 1 마찰부재는, 상기 슬라이드 가이드 상의 상기 직선 이동 경 로를 따라 상기 구동 플레이트의 상기 제 2 면을 향하는 방향으로 돌출되어 형성되고, 상기 드라이 브 멤버가 상기 제 2 위치에 배치되면 상기 스위블 락 홈(DG)이 상기 제 1 마찰부재와 맞물림이 해제 될 수 있다. 일 실시 예에서, 상기 바디 플레이트는, 상기 구동 플레이트의 미끄러짐을 방지하는 제 2 마찰부재 를 더 포함할 수 있다. 다양한 실시 예들에 따른 디스플레이 장치(D) 거치용 거치 디바이스는, 제 1 면 및 상기 제 1 면 에 반대되는 제 2 면을 포함하고, 상기 제 1 면에 디스플레이 장치(D)가 부착되어 상기 디스 플레이 장치(D)와 일체로 움직이는 구동 플레이트, 상기 구동 플레이트의 상기 제 2 면의 적어 도 일부와 접촉되도록 나란히 배치되며, 상기 구동 플레이트의 직선 이동을 막는 락킹 유닛을 포함하 는, 바디 플레이트, 상기 바디 플레이트의 상기 구동 플레이트와 결합된 면의 반대 면에 배치되며, 상기 바디 플레이트의 적어도 하나의 에지에 접하도록 구성되는, 스탠드 플레이트를 포함하고, 상기 락킹 유닛은, 상기 바디 플레이트 및 상기 스탠드 플레이트가 겹쳐져 나란히 배치되는 그 라운드 모드에서는 잠금이 유지되고, 상기 바디 플레이트 및 상기 스탠드 플레이트가 상기 에지를 축 으로 일정 간격 이상 이격 되어 배치되는 스탠드 모드에서는 잠금이 해제되며, 상기 바디 플레이트는, 상 기 구동 플레이트의 직선 이동 시 상기 바디 플레이트에 대한 상기 구동 플레이트의 각도를 고 정하는 제 1 마찰부재 및 상기 구동 플레이트의 미끄러짐을 방지하는 제 2 마찰부재를 포함할 수 있다."}
{"patent_id": "10-2022-0045222", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속한다."}
{"patent_id": "10-2022-0045222", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a는 일 실시 예에 따른 거치 디바이스의 그라운드 모드를 나타낸 전면 사시도이다. 도 2b는 일 실시 예에 따른 거치 디바이스의 스탠드 모드를 나타낸 전면 사시도이다. 도 2c는 일 실시 예에 따른 거치 디바이스의 스탠드 모드를 나타낸 후면 사시도이다. 도 3a는 일 실시 예에 따른 그라운드 모드의 거치 디바이스에 일 실시 예에 따른 디스플레이 장치가 부착된 상 태를 나타낸 전면 사시도이다. 도 3b는 일 실시 예에 따른 스탠드 모드의 거치 디바이스에 일 실시 예에 따른 디스플레이 장치가 부착되어 회 전되기 전의 상태를 나타낸 전면 사시도이다. 도 3c는 일 실시 예에 따른 스탠드 모드의 거치 디바이스에 일 실시 예에 따른 디스플레이 장치가 부착되어 회 전된 후의 상태를 나타낸 전면 사시도이다. 도 4a는 일 실시 예에 따른 스탠드 모드의 거치 디바이스의 전면 분해 사시도이다. 도 4b는 일 실시 예에 따른 스탠드 모드의 거치 디바이스의 후면 분해 사시도이다. 도 5a는 일 실시 예에 따른 거치 디바이스의 드라이브 멤버가 제 1 위치에 위치하는 상태에서 바디 플레이트 내 구성요소들을 개략적으로 나타낸 도면이다. 도 5b는 일 실시 예에 따른 거치 디바이스의 드라이브 멤버가 제 2 위치에 위치하는 상태에서 바디 플레이트 내 구성요소들을 개략적으로 나타낸 도면이다. 도 5c는 일 실시 예에 따른 거치 디바이스의 드라이브 멤버에 슬라이드 락이 체결된 상태를 나타낸 도면이다. 도 5d는 일 실시 예에 따른 거치 디바이스의 드라이브 멤버에 슬라이드 락이 풀린 상태를 나타낸 도면이다. 도 6a는 일 실시 예에 따른 거치 디바이스의 드라이브 멤버의 정면도이다. 도 6b는 일 실시 예에 따른 거치 디바이스의 드라이브 멤버의 분해 사시도이다. 도 6c는 일 실시 예에 따른 거치 디바이스의 드라이브 멤버에 스위블 락이 체결된 상태를 나타낸 도면이다. 도 6d는 일 실시 예에 따른 거치 디바이스의 드라이브 멤버에 스위블 락이 풀려 드라이브 커플링 유닛이 회전하 는 상태를 나타낸 도면이다. 도 7은 다른 실시 예에 따른 거치 디바이스의 드라이브 멤버가 제 1 위치에 위치하는 상태에서 바디 플레이트 내 구성요소들을 개략적으로 나타낸 도면이다. 도 8은 일 실시 예에 따른 거치 디바이스의 구동 플레이트의 정면도이다. 도 9는 또 다른 실시 예에 따른 거치 디바이스의 스탠드 모드를 나타낸 정면도이다. 도 10은 일 실시 예에 따른 거치 디바이스의 구동 실시 예를 도시한 사시도이다. 도 11은 일 실시 예에 따른 거치 디바이스의 사용 예를 도시한 도면이다. 도 12는 다른 실시 예에 따른 거치 디바이스의 사용 예를 도시한 도면이다."}
