{"patent_id": "10-2020-0174403", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0084686", "출원번호": "10-2020-0174403", "발명의 명칭": "이미지간 유사도 결정 장치 및 유사도 결정 방법", "출원인": "라온피플 주식회사", "발명자": "김태웅"}}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "물품에 관한 제1이미지가 저장되는 메모리; 및딥러닝을 수행하기 위한 프로그램을 실행함으로써 딥러닝을 수행하는 제어부를 포함하며, 상기 제어부는, 이미지 간 유사도를 출력하도록 딥러닝 모델을 학습시키고, 물품에 관한 제2이미지 및 상기 제1이미지를 입력하여 상기 학습된 딥러닝 모델에서 출력되는 유사도를 제공하는, 유사도 결정 장치."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 물품의 종류를 식별하고 식별된 물품의 종류에 기초하여 상기 물품에 대응되는 제1이미지를 획득하는, 유사도 결정 장치."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어부는, 상기 제1이미지에 기초하여 제2이미지를 획득하는, 유사도 결정 장치."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는,상기 제1이미지에 기초하여 상기 물품의 제2이미지의 획득을 위한 설정값을 결정하고 상기 설정값에 기초하여제2이미지를 획득하는, 유사도 결정 장치."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제어부는,상기 제1이미지에 기초하여 상기 물품의 제2이미지의 개수를 결정하고, 상기 개수에 따라 제2이미지를획득하는, 유사도 결정 장치."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제어부는,상기 유사도에 기초하여 알람정보를 생성하여 제공하는, 유사도 결정 장치."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "유사도 결정 장치가 이미지 간의 유사도를 결정하는 방법으로서,이미지간 유사도를 출력하도록 딥러닝 모델을 학습시키는 단계; 및공개특허 10-2022-0084686-3-상기 학습된 딥러닝 모델에 물품에 관한 제1이미지 및 제2이미지를 입력함으로써 상기 제1이미지 및 상기 제2이미지 간의 유사도를 제공하는 단계를 포함하는, 유사도 결정 방법."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 물품의 종류를 식별하는 단계; 및상기 물품의 종류에 기초하여 상기 물품에 대응되는 제1이미지를 획득하는 단계를 더 포함하는, 유사도 결정 방법."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 제1이미지에 기초하여 제2이미지를 획득하는 단계를 더 포함하는, 유사도 결정 방법."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 제1이미지에 기초하여 상기 물품의 제2이미지의 획득을 위한 설정값을 결정하는 단계; 및상기 설정값에 기초하여 제2이미지를 획득하는 단계를 더 포함하는, 유사도 결정 방법."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 제1이미지에 기초하여 상기 물품의 제2이미지의 개수를 결정하는 단계; 및상기 개수에 따라 제2이미지를 획득하는 단계를 더 포함하는, 유사도 결정 방법."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 유사도에 기초하여 알람정보를 생성하여 제공하는 단계를 더 포함하는, 유사도 결정 방법."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제7항에 기재된 방법을 수행하는 프로그램이 기록된 컴퓨터 판독 가능한 기록 매체."}
{"patent_id": "10-2020-0174403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "유사도 결정 장치에 의해 수행되며, 제7항에 기재된 유사도 결정 방법을 수행하기 위해 매체에 저장된 컴퓨터프로그램."}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "유사도 결정 장치 및 유사도 결정 방법을 제시하며, 일 실시예에 따르면, 유사도 결정 장치로서, 물품에 관한 제 1이미지가 저장되는 메모리, 및 딥러닝을 수행하기 위한 프로그램을 실행함으로써 딥러닝을 수행하는 제어부를 포함하며, 상기 제어부는, 이미지 간 유사도를 출력하도록 딥러닝 모델을 학습시키고, 물품에 관한 제2이미지 및 상기 제1이미지를 입력하여 상기 학습된 딥러닝 모델에서 출력되는 유사도를 제공할 수 있다."}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은 이미지간 유사도 결정 장치 및 유사도 결정 방법에 관한 것으로, 보다 상세 하게는 디자인권 등록 물품과 대상물품의 유사도를 판단하기 위한 이미지간 유사도 결정 장치 및 유사도 결정 방법에 관한 것이다."}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어, 제조사 또는 유통사들은 자신이 제작, 판매하는 물품을 시장에서 보호받기 위해 디자인권을 등록해 두는 경우도 많다. 이때, 물품의 종류가 매우 다양하며, 또한 한 종류 내에서도 제조사별로 상이한 디자인을 갖고 있고, 같은 종류, 같은 제조사라 하더라도 모델이 다양한 경우가 있어, 각각에 대해 디자인권을 확보해둔 상태라면 침해 판단 시 검토해야 할 디자인권의 개수가 매우 많아진다. 한편 해외 직구가 용이해지고 해외물품의 수입이 용이해짐에 따라 수입품이 증가하고 있다. 즉 디자인권 침해 여부를 판단해야 하는 대상 또한 증가하고 있어 어떤 물품이 등록된 디자인권을 침해하는지 확인하는데 많은 시간이 걸리며, 또한 침해 여부 판단을 사람이 육안으로 수행하기 때문에 그 정확성이 낮을 수 있고 사람별로 판단의 편차가 있을 수밖에 없다. 따라서 등록 디자인권을, 예를 들어, 수입 통관 물품이 침해하는지 여부를 정확하고 빠른 시간 내에 판단하는 기술의 개발이 필요하다. 관련하여 선행기술 문헌인 대한민국 공개특허 제10-2017-0001849 호에서는, 정품인증 대상에 부착되는 스티커의 한 면에 도포되고, 입사된 빛을 반사시킬 때 특정 스펙트럼을 포함시켜 반사시키는 광학물질, 상기 정품인증 대 상에 부착되는 스티커의 한 면에 패턴 형상으로 형성되고, 정품인증 대상 제품의 정보를 포함하는 추가정보, 그 리고 상기 정품인증 대상에 부착되는 스티커의 한 면에 형성되는 무작위 패턴으로서 상기 정품인증 대상의 정품 을 인증하는 패턴을 포함하는 인증 수단에 대해 제안하고 있다. 선행기술은 정품 인증을 위한 스티커 부착을 요 하는바, 선행기술로 특정 물품이 디자인권을 침해하는지 여부를 판단하기 어렵다. 따라서 등록 디자인권을 대상물품이 침해하는지를 판단하기 위한 기술의 개발이 필요하게 되었다."}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "한편, 전술한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다."}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은, 이미지간 유사도 결정 장치 및 유사도 결정 방법을 제시하는데 목적이 있 다. 또한, 본 명세서에서 개시되는 실시예들은, 물품의 디자인권 침해 가능성을 판정할 수 있는 유사도 결정 장치 및 유사도 결정 방법을 제시하는데 목적이 있다. 또한, 본 명세서에서 개시되는 실시예들은, 인공지능 기반으로 추론을 수행함으로써 이미지간 유사도를 판단할 수 있는 유사도 결정 장치 및 유사도 결정 방법을 제시하는데 목적이 있다."}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 명세서에 기재된 일 실시예에 따르면, 유사도 결정 장치로서, 물품에 관한 제1이미지가 저장되는 메모리, 및 딥러닝을 수행하기 위한 프로그램을 실행함으로써 딥 러닝을 수행하는 제어부를 포함하며, 상기 제어부는, 이미지 간 유사도를 출력하도록 딥러닝 모델을 학습시키고, 물품에 관한 제2이미지 및 상기 제1이미지를 입력하여 상기 학습된 딥러닝 모델에서 출력되는 유사 도를 제공할 수 있다 또한, 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 명세서에 기재된 일 실시예에 따르면, 유사 도 결정 장치가 이미지 간의 유사도를 결정하는 방법으로서, 이미지간 유사도를 출력하도록 딥러닝 모델을 학습 시키는 단계, 및 상기 학습된 딥러닝 모델에 물품에 관한 제1이미지 및 제2이미지를 입력함으로써 상기 제1이미 지 및 상기 제2이미지 간의 유사도를 제공할 수 있다. 또한, 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 명세서에 기재된 일 실시예에 따르면, 유사 도 결정 방법을 수행하는 프로그램이 기록된 컴퓨터 판독 가능한 기록 매체로서 상기 유사도 결정 방법은, 이미 지간 유사도를 출력하도록 딥러닝 모델을 학습시키는 단계, 및 상기 학습된 딥러닝 모델에 물품에 관한 제1이미 지 및 제2이미지를 입력함으로써 상기 제1이미지 및 상기 제2이미지 간의 유사도를 제공할 수 있다. 또한, 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 명세서에 기재된 일 실시예에 따르면, 유사 도 결정 장치에 의해 수행되며, 유사도 결정 방법을 수행하기 위해 매체에 저장된 컴퓨터 프로그램으로서 상기 유사도 결정 방법은, 이미지간 유사도를 출력하도록 딥러닝 모델을 학습시키는 단계, 및 상기 학습된 딥러닝 모 델에 물품에 관한 제1이미지 및 제2이미지를 입력함으로써 상기 제1이미지 및 상기 제2이미지 간의 유사도를 제 공할 수 있다."}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 과제 해결 수단 중 하나에 의하면, 이미지간 유사도 결정 장치 및 유사도 결정 방법을 제시할 수 있다. 전술한 과제 해결 수단 중 하나에 의하면, 물품의 디자인권 침해 가능성을 판정할 수 있는 유사도 결정 장치 및 유사도 결정 방법을 제시할 수 있다. 전술한 과제 해결 수단 중 하나에 의하면, 인공지능 기반으로 추론을 수행함으로써 이미지간 유사도를 판단할 수 있는 유사도 결정 장치 및 유사도 결정 방법을 제시할 수 있다. 전술한 과제 해결 수단 중 하나에 의하면, 최소한의 리소스로 빠른 시간 내에 물품의 디자인권 침해 가능성을 판정할 수 있는 유사도 결정 장치 및 유사도 결정 방법을 제시할 수 있다. 개시되는 실시예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다"}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "른 효과들은 아래의 기재로부터 개시되는 실시예들이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 다양한 실시예들을 상세히 설명한다. 아래에서 설명되는 실시예들은 여러 가지 상이한 형태로 변형되어 실시될 수도 있다. 실시예들의 특징을 보다 명확히 설명하기 위하여, 이하의 실시"}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예들이 속하는 기술분야에서 통상의 지식을 가진 자에게 널리 알려져 있는 사항들에 관해서 자세한 설명은 생략 하였다. 그리고, 도면에서 실시예들의 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부 분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 구성이 다른 구성과 \"연결\"되어 있다고 할 때, 이는 '직접적으로 연결'되어 있는 경우뿐 아니라, '그 중간에 다른 구성을 사이에 두고 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성이 어떤 구성을 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한, 그 외 다른 구성을 제외하는 것이 아니라 다른 구 성들을 더 포함할 수도 있음을 의미한다. 이하 첨부된 도면을 참고하여 실시예들을 상세히 설명하기로 한다. 도 1은 본 명세서에 개시된 일 실시예에 따른 유사도 결정 장치를 설명하기 위한 블록도이며, 도 2는 본 명세서 에 개시된 일 실시예에 따른 유사도 결정 장치를 설명하기 위한 예시도이다. 유사도 결정 장치는 물품의 이미지를 기반으로 해당 물품의 외관이 디자인권 등록된 물품과 유사한지 여부 를 판단함으로써 해당 물품이 디자인권을 침해하는지 여부를 판단하기 위한 장치이다. 이러한 유사도 결정 장치에는 딥러닝 모델을 수행하기 위한 프로그램이 설치 및 구동될 수 있고, 유사도 결정 장치는 구동된 컴퓨터 프로그램의 제어에 따라 본 명세서에 기재된 실시예에 따른 유사도 결정 방법 을 수행할 수 있다. 이와 같은 유사도 결정 장치는 관리자와 인터랙션할 수 있는 애플리케이션이 설치된 전자단말기, 또는 서 버로 구현되거나 서버-클라이언트 시스템으로 구현될 수 있으며, 서버-클라이언트 시스템으로 구현되는 경우 관 리자와의 인터랙션을 위한 온라인 서비스용 애플리케이션이 설치된 전자단말기를 포함할 수 있다. 이때 전자단말기는 네트워크를 통해 원격지의 서버에 접속하거나, 타 디바이스 및 서버와 연결 가능한 컴퓨터나 휴대용 단말기, 텔레비전, 웨어러블 디바이스(Wearable Device) 등으로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop)등을 포함하고, 휴대용 단 말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), GSM(Global System for Mobile communications), IMT(International Mobile Telecommunication)-2000,CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet), 스마트폰(Smart Phone), 모바일 WiMAX(Mobile Worldwide Interoperability for Microwave Access) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 또한, 텔레비전은 IPTV(Internet Protocol Television), 인터넷 TV(Internet Television), 지상파 TV, 케이블 TV 등 을 포함할 수 있다. 나아가 웨어러블 디바이스는 예를 들어, 시계, 안경, 액세서리, 의복, 신발 등 인체에 직접 착용 가능한 타입의 정보처리장치로서, 직접 또는 다른 정보처리장치를 통해 네트워크를 경유하여 원격지의 서 버에 접속하거나 타 디바이스와 연결될 수 있다. 그리고 서버는, 네트워크를 통해 통신이 가능한 컴퓨터로 구현되거나 클라우드 컴퓨팅 서버로 구현될 수 있다. 또한, 서버는 데이터를 저장할 수 있는 저장장치를 포함하거나 제 3의 서버를 통해 데이터를 저장할 수 있다. 상술된 바와 같이 유사도 결정 장치는 전자단말기, 서버 또는 서버-클라이언트 시스템 중 어느 하나의 형 태로 구현될 수 있으며, 서버로 구현될 경우, 유사도 결정 장치를 구성하는 구성부는 물리적으로 분리된 복수의 서버에서 수행되거나 하나의 서버에서 수행될 수 있다. 도 1에서 도시된 바와 같이, 실시예에 따른 유사도 결정 장치는 통신부, 입출력부, 메모리 및 제어부 를 포함할 수 있다. 통신부는 유사도 결정 장치가 다른 장치 또는 네트워크와 유무선 통신을 수행하도록 할 수 있다. 가 령 유사도 결정 장치가 다른 저장장치들 또는 관리자 디바이스로 알람정보를 제공하기 위한 통신 기능을 제공할 수 있다. 반면 입출력부는 입력을 수신하기 위한 입력부와 작업의 수행 결과 또는 유사도 결정 장치의 상태 등 의 정보를 표시하기 위한 출력부를 포함할 수 있다. 예를 들어 입출력부는 유저의 입력을 수신하는 조작 패널(operation panel) 및 화면을 표시하는 디스플레이 패널(display panel) 등을 포함할 수 있다. 구체적으로 입력부는 키보드, 물리 버튼, 터치 스크린, 카메라 또는 마이크 등과 같이 다양한 형태의 입력을 수 신할 수 있는 장치들을 포함할 수 있다. 또한, 출력부는 디스플레이 패널 또는 스피커 등을 포함할 수 있다. 다 만, 이에 한정되지 않고 입출력부는 다양한 입출력을 지원하는 구성을 포함할 수 있다. 실시예에 따르면, 입력부는 대상물품이 포함된 모습을 촬영한 영상을 생성하거나, 또는 외부 디바이스를 통해 생성된 영상을 입력으로서 수신할 수 있다. 또한, 출력부는 상기 영상에 대한 연산의 결과인 유사도를 출력하거 나, 알람정보 등을 출력할 수 있다. 메모리에는 파일, 어플리케이션 및 프로그램 등과 같은 다양한 종류의 데이터가 설치 및 저장될 수 있다. 제어부는 메모리에 저장된 데이터에 접근하여 이를 이용하거나, 또는 새로운 데이터를 메모리에 저장할 수도 있다. 또한, 제어부는 메모리에 설치된 프로그램을 실행할 수도 있다. 예를 들어, 메모 리는 딥러닝 모델이 구현된 프로그램이 설치될 수 있으며, 상술한 바와 같이 대상물이 포함된 모습을 촬영 한 영상을 저장하거나 영상을 구성하는 프레임들을 저장할 수도 있다. 반면 제어부는 유사도 결정 장치의 전체적인 동작을 제어하며, CPU, GPU 등과 같은 프로세서를 포함 할 수 있다. 제어부는 이미지간 유사도 판단을 위한 동작을 수행하도록 유사도 결정 장치에 포함된 다른 구성들을 제어할 수 있다. 예를 들어, 제어부는 메모리에 저장된 프로그램을 실행시키거나, 메 모리에 저장된 파일을 읽어오거나, 새로운 파일을 메모리에 저장할 수도 있다. 실시예에 따르면, 제어부는 제1이미지와 제2이미지 간의 유사도를 출력할 수 있다. 관련하여 '제1이미지'는 디자인권 등록된 등록물품에 관한 이미지를 지칭하며, '제2이미지'는 침해 판단 대상이 되는 대상물품에 관한 이미지를 지칭한다. 즉, 대상물품이 등록물품의 디자인권을 침해하는지 여부를 판다하기 위해 제어부는 제1이미지 및 제2이미지 간의 유사도를 제공할 수 있다. 관련하여 본 명세서에서 물품은, 예를 들어 자동차 부품, IT제품, 생활가전, 이미용품이 될 수 있으나 상술된 예에 한정되지 않는다. 제1이미지와 제2이미지 간의 유사도를 출력하기 위해, 제어부는 복수의 이미지를 입력하였을 때 복수의 이 미지간 유사도를 출력하도록 딥러닝 모델을 학습시킬 수 있다. 일실시예에 따르면 제어부는 제1이미지와 제2이미지 간의 유사도로서 유클리드 거리(Euclidean distance) 를 출력하도록 딥러닝 모델을 학습시킬 수 있다.예를 들어 제어부는 입력된 이미지 각각의 특징벡터를 추출하여 특징벡터 간의 유클리드 거리를 연산하도 록 딥러닝 모델을 학습시킬 수 있다. 이에 제어부는 학습된 딥러닝 모델에 복수의 이미지가 입력되었을 때 유클리드 거리를 유사도로서 출력할 수 있고, 또한 유클리드 거리가 0으로 수렴할수록 유사도가 높다고 판단되 므로, 1에 대해 유클리드 거리를 나눈 값을 유사도로서 출력할 수도 있다. 이때 딥러닝 모델 네트워크는 예를 들어, DNN(Deep neural network), CCN(Convolutional neural network), 또 는 RNN (Recurrent Neural Network) 등이 될 수 있으며 상술된 예에 제한되지 않는다. 한편 제어부는 디자인권 침해 여부의 판단 대상이 되는 대상물품에 관한 정보를 획득하였을 때 대상물품에 대응되는 제1이미지를 획득할 수 있다. 즉 제어부는 대상물품이 침해할 가능성이 있는 등록물품들에 관한 제1이미지를 획득할 수 있으며, 예를 들 어 대상물품이 이미용제품 중에서 화장품용기일 때 화장품용기에 관한 등록디자인에 대응되는 제1이미지를 획득 할 수 있다. 일실시예에 따르면 제어부는 디자인권 등록된 등록물품을 촬영한 제1이미지를 획득할 수 있다. 예를 들어, 제어부는 디자인권 등록된 물품을 다양한 각도에서 하나 이상의 카메라로 촬영한 이미지를 하 나 이상 획득할 수 있고 또는 다양한 촬영 환경 하에서 촬영된 이미지를 하나 이상 획득할 수 있다. 또 다른 실시예에 따르면 제어부는 디자인 등록된 물품에 대응되는 디자인 명세서에 기재된 도면을 제1이 미지로서 획득할 수 있다. 예를 들어 제어부는 디자인권 등록된 물품에 대응되는 디자인 명세서에 도면으로서 사시도가 포함되어 있 다면, 해당 사시도를 제1이미지로서 획득할 수 있다. 이를 위해 제어부는 특허청에 등록된 등록디자인 명 세서를 분석하여 물품별 이미지를 추출할 수 있다. 한편 제어부는 대상물품의 종류를 식별할 수 있다. 즉 제어부는 디자인권 침해 여부 판단의 대상이 되는 대상물품의 종류에 대응되는 제1이미지의 획득을 위 해 대상물품의 종류를 식별할 수 있다. '종류'는 물품을 구분하기 위한 기준으로서, 등록디자인 침해 판단에 있어 유의미한 정보일 수 있다. 종류로서, 예를 들어 자동차 부품, IT제품, 생활가전, 이미용품 등이 될 수 있으며 더 세분화될 수도 있다. 또한 '종류'는 예를 들어, 디자인보호법 상에서 정의되는 물품류가 될 수도 있다. 일 실시예에 따르면 제어부는 종류 식별을 위해 딥러닝 모델을 학습시킬 수 있다. 예를 들어 제어부는 대상물품에 대한 일측면을 촬영한 이미지를 입력하였을 때 대상물품의 종류를 출력하 도록 딥러닝 모델을 학습시킬 수 있다. 또는 예를 들어 제어부는 대상물품 상에 표시된 바코드 이미지를 입력하였을 때 대상물품의 종류를 출력하도록 딥러닝 모델을 학습시킬 수 있다. 또 다른 실시예에 따르면 제어부는 대상물품이 통관물품인 경우 통관물품에 대응되는 식별코드에 따라 종 류를 결정할 수 있다. 예를 들어 대상물품을 수입하기 위해 작성된 식별코드가 존재한다면, 제어부는 해당 식별코드를 분석하여 대상물품의 종류가 자동차 부품임을 결정할 수 있다. 이와 같이 식별된 대상물품의 종류에 기초하여 제어부는 대상물품에 대응되는 제1이미지를 획득할 수 있다. 예를 들어 대상물품의 종류가 이미용품이라면, 제어부는 이미용품에 관한 디자인권 등록된 물품의 제1이미 지를 획득할 수 있다. 또한 예를 들어 대상물품의 종류가 이미용품으로서 화장품 용기라면, 화장품 용기에 관한 디자인권이 존재하는 등록물품들의 제1이미지를 제어부는 획득할 수 있다. 즉 제어부는 대상물품의 종류에 대응되는 제1이미지를 획득할 수 있으며 이러한 제1이미지는 메모리 에 저장되어 획득될 수 있거나, 또는 외부 디바이스에 저장되어 있어 통신부를 통해 획득될 수 있다. 그에 따라 제어부는 예를 들어, 대상물품의 종류에 대응되며 디자인권 등록된 제품을 촬영한 이미지 또는 디자인 등록 명세서에 기재된 이미지를 제1이미지로서 획득할 수 있다. 한편 제어부는 대상물품에 관한 제2이미지를 획득할 수 있다. 일 실시예에 따르면 제어부는 대상물품을 촬영한 제2이미지를 획득할 수 있다. 예를 들어 기설정된 촬영조 건 하에서 대상물품을 촬영하여 이미지를 제2이미지로서 획득할 수 있다. 또 다른 실시예에 따르면 제어부는 제1이미지에 기초하여 대상물품에 관한 제2이미지를 획득할 수 있다. 제어부는 제1이미지에 기초하여 대상물품의 제2이미지의 획득을 위한 설정값을 결정하고 상기 설정값에 기 초하여 제2이미지를 획득할 수 있다. 이때, 설정값은 대상물품을 촬영할 때의 조건으로서 촬영횟수, 촬영환경 등에 관한 값을 포함할 수 있고 예를 들어, 촬영된 이미지의 개수, 대상물품에 대한 카메라의 각도값, 대상물품 촬영을 위한 조명값, 카메라 줌배율 값, 카메라와 대상물품간의 거리값 등에 관한 정보를 포함할 수 있다. 실시예에 따르면, 제어부는 제1이미지에 기초하여 대상물품의 제2이미지의 개수를 결정하고, 결정된 개수 에 따라 제2이미지를 획득할 수 있다. 예를 들어 제어부는, 대상물품의 종류에 대응되는 제1이미지를 구성하는 이미지의 개수가 총 4개라면 대상 물품에 관한 제2이미지를 총 4개 획득할 수 있고 이를 위해 예를 들어 카메라의 촬영횟수를 4회로 설정하거나, 또는 4대의 카메라 각각에서 이미지를 획득하도록 설정할 수 있다. 관련하여 도 2를 참조하면, 제1이미지로서 물품A에 대해 2개의 이미지가 획득되면 제어부는 물품A에 대해 2대의 카메라로 촬영한 이미지 2개를 제2이미지로 설정할 수 있고, 이때 제1이미지가 표면도 및 이면도이 므로, 물품A를 촬영할 때 물품A를 상단에서 바라봤을 때의 이미지와, 물품A를 하단에서 바라봤을 때의 이미지, 두 개를 제2이미지로서 획득할 수 있다. 또는, 제1이미지로서 물품B에 대해 3개의 이미지가 획득되면 제어부는 물품B에 대해 2대의 카메라로 촬영한 이미지 3개를 제2이미지로 설정할 수 있고, 예를 들어 조명조건을 달리하여 촬영한 사시도 2개와, 대상 물품B를 정면에서 촬영한 이미지 1개를 제2이미지로서 획득할 수 있다. 또한 제어부는, 물품C에 6개의 이미지가 제1이미지로서 획득되면, 물품 C에 대해 육면도에 따라 배치 된 6대의 카메라로 촬영한 6개의 이미지를 제2이미지로서 획득할 수 있다. 상술된 바와 같이 제2이미지가 결정되면 제어부는 제1이미지 및 제2이미지를 입력값으로 하여 유사도를 출 력할 수 있다. 제1이미지 및 제2이미지 각각이 복수개이면, 제어부는 각각의 매칭되는 이미지들 간의 유사도를 제공할 수 있다. 예를 들어 제어부는 제1이미지 및 제2이미지 각각으로서 정면도와 사시도가 있다면, 정면도의 제1이 미지는 정면도의 제2이미지와, 사시도의 제1이미지는 정면도의 제2이미지와 유사도를 판단할 수 있다. 아울러 제어부는 유사도가 소정의 임계치 이상이라고 판단되면 이를 관리자에게 제공할 수 있다 즉 유사도가 높을수록 이미지들 간에 유사하다고 판단되는데, 이러한 유사도에 기초하여 제어부는 알람정 보를 생성하여 제공할 수 있다. 예를 들어 대상물품에 대한 제2이미지 중 적어도 하나가 제1이미지와의 유사도가 소정의 임계치 이상이면, 대상 물품이 디자인권을 침해할 가능성이 있다고 판단하고 제어부는 알람정보를 생성할 수 있다. 또는 예를 들어 대상물품에 대한 제2이미지 모두가 제1이미지와의 유사도가 소정의 임계치 이상이면 대상물품이 디자인권을 침해할 가능성이 있다고 판단하고 제어부는 알람정보를 생성할 수 있다 또는 예를 들어 대상물품에 대한 제2이미지와 제1이미지 각각에 대한 유사도의 합이 소정의 임계치 이상이면 대 상물품이 디자인권을 침해할 가능성이 있다고 판단하고 제어부는 알람정보를 생성할 수 있다 한편 도 3 및 도 4는 일 실시예에 따른 유사도 결정 장치가 이미지간 유사도를 결정하는 방법을 설명하기 위한 순서도이다. 도 3 및 도 4에 도시된 유사도 결정 방법은 도 1 및 도 2를 통해 설명된 유사도 결정 장치에서 시계열적으 로 처리하는 단계들을 포함한다. 따라서 이하에서 생략된 내용이라고 하더라도 도 1 및 도 2에 도시된 유사도 결정 장치에 관하여 이상에서 기술한 내용은 도 3 내지 도 4에 도시된 실시예에 따른 유사도 결정 방법에 도 이용될 수 있다.도 3을 참조하면, 유사도 결정 장치는 이미지간 유사도를 출력하기 위한 딥러닝 모델을 학습시킬 수 있다 (S310). 그리고 학습된 딥러닝 모델에 제1이미지 및 제2이미지를 입력함으로써 유사도 결정 장치는 유사도를 출력 할 수 있고(S320), 유사도가 소정의 임계치 이상이라면(S330), 알람정보를 관리자단말(미도시)에게 제공할 수 있다 (S340). 그에 따라 알람정보를 확인한 관리자는, 해당 대상물품이 디자인권을 침해할 가능성이 있다고 판 단하고 대상물품을 보다 면밀히 조사해볼 수 있다. 한편 학습된 딥러닝 모델에 입력되는 제1이미지 및 제2이미지를 결정하기 위해 유사도 결정 장치는 도 4에 따른 각 단계를 수행할 수 있다. 즉, 유사도 결정 장치는 대상물품을 식별하면 대상물품의 종류를 식별할 수 있다 (S410). 이와 같이 식별된 물품의 종류에 기초하여 유사도 결정 장치는 대상물품에 대응되는 제1이미지를 획득할 수 있다(S420). 예를 들어 유사도 결정 장치는 대상물품이 생활가전 중에서 가습기라고 판단되면 가습기로 서 디자인권 등록된 물품의 이미지를 제1이미지로서 획득할 수 있다. 또한 유사도 결정 장치는 제1이미지에 기초하여 제2이미지를 획득할 수 있다. 즉 유사도 결정 장치는 제1이미지에 기초하여 제2이미지의 획득을 위한 설정값을 결정할 수 있다 (S430). 이와 같이 결정된 설정값에 따라 제2이미지를 획득하면(S440), 유사도 결정 장치는 제1이미지 및 제2이미 지를 딥러닝 모델에 입력함으로써 유사도를 결정할 수 있다. 이처럼 대상물품의 이미지를 획득하고 딥러닝 모델을 이용하여 분석함으로써 본 명세서에 개시된 실시예에 따른 유사도 결정 방법은 빠르고 보다 정확하게 디자인권 침해 가능성이 있는 물품을 판별해낼 수 있다. 상기와 같이 설명된 유사도 결정 방법은 컴퓨터에 의해 실행 가능한 명령어 및 데이터를 저장하는, 컴퓨터로 판 독 가능한 매체의 형태로도 구현될 수 있다. 이때, 명령어 및 데이터는 프로그램 코드의 형태로 저장될 수 있으 며, 프로세서에 의해 실행되었을 때, 소정의 프로그램 모듈을 생성하여 소정의 동작을 수행할 수 있다. 또한, 컴퓨터로 판독 가능한 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발 성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터로 판독 가능한 매체는 컴퓨터 기록 매체일 수 있는데, 컴퓨터 기록 매체는 컴퓨터 판독 가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같 은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함할 수 있다. 예를 들어, 컴퓨터 기록 매체는 HDD 및 SSD 등과 같은 마그네틱 저장 매체, CD, DVD 및 블루레 이 디스크 등과 같은 광학적 기록 매체, 또는 네트워크를 통해 접근 가능한 서버에 포함되는 메모리일 수 있다. 상기와 같이 설명된 유사도 결정 방법은 컴퓨터에 의해 실행 가능한 명령어를 포함하는 컴퓨터 프로그램(또는 컴퓨터 프로그램 제품)으로 구현될 수도 있다. 컴퓨터 프로그램은 프로세서에 의해 처리되는 프로그래밍 가능한 기계 명령어를 포함하고, 고레벨 프로그래밍 언어(High-level Prog램(RAM)ming Language), 객체 지향 프로그래 밍 언어(Object-oriented Prog램(RAM)ming Language), 어셈블리 언어 또는 기계 언어 등으로 구현될 수 있다. 또한 컴퓨터 프로그램은 유형의 컴퓨터 판독가능 기록매체(예를 들어, 메모리, 하드디스크, 자기/광학 매체 또 는 SSD(Solid-State Drive) 등)에 기록될 수 있다. 상기와 같이 설명된 유사도 결정 방법은 상술한 바와 같은 컴퓨터 프로그램이 컴퓨팅 장치에 의해 실행됨으로써 구현될 수 있다. 컴퓨팅 장치는 프로세서와, 메모리와, 저장 장치와, 메모리 및 고속 확장포트에 접속하고 있는 고속 인터페이스와, 저속 버스와 저장 장치에 접속하고 있는 저속 인터페이스 중 적어도 일부를 포함할 수 있다. 이러한 성분들 각각은 다양한 버스를 이용하여 서로 접속되어 있으며, 공통 머더보드에 탑재되거나 다른 적절한 방식으로 장착될 수 있다. 여기서 프로세서는 컴퓨팅 장치 내에서 명령어를 처리할 수 있는데, 이런 명령어로는, 예컨대 고속 인터페이스 에 접속된 디스플레이처럼 외부 입력, 출력 장치상에 GUI(Graphic User Interface)를 제공하기 위한 그래픽 정 보를 표시하기 위해 메모리나 저장 장치에 저장된 명령어를 들 수 있다. 다른 실시예로서, 다수의 프로세서 및 (또는) 다수의 버스가 적절히 다수의 메모리 및 메모리 형태와 함께 이용될 수 있다. 또한 프로세서는 독립적인 다수의 아날로그 및(또는) 디지털 프로세서를 포함하는 칩들이 이루는 칩셋으로 구현될 수 있다. 또한 메모리는 컴퓨팅 장치 내에서 정보를 저장한다. 일례로, 메모리는 휘발성 메모리 유닛 또는 그들의 집합으 로 구성될 수 있다. 다른 예로, 메모리는 비휘발성 메모리 유닛 또는 그들의 집합으로 구성될 수 있다. 또한 메모리는 예컨대, 자기 혹은 광 디스크와 같이 다른 형태의 컴퓨터 판독 가능한 매체일 수도 있다. 그리고 저장장치는 컴퓨팅 장치에게 대용량의 저장공간을 제공할 수 있다. 저장 장치는 컴퓨터 판독 가능한 매 체이거나 이런 매체를 포함하는 구성일 수 있으며, 예를 들어 SAN(Storage Area Network) 내의 장치들이나 다른 구성도 포함할 수 있고, 플로피 디스크 장치, 하드 디스크 장치, 광 디스크 장치, 혹은 테이프 장치, 플래시 메 모리, 그와 유사한 다른 반도체 메모리 장치 혹은 장치 어레이일 수 있다. 이상의 실시예들에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(field prog램(RAM)mable gate array) 또는 ASIC 와 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트 웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨 어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들 과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램특허 코드의 세그먼트들, 드라이버들, 펌웨 어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구 성요소들과 '~부'들로부터 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU 들을"}
{"patent_id": "10-2020-0174403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "재생시키도록 구현될 수도 있다. 상술된 실시예들은 예시를 위한 것이며, 상술된 실시예들이 속하는 기술분야의 통상의 지식을 가진 자는 상술된 실시예들이 갖는 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체 적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 상술된 실시예들은 모든 면에서 예 시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 명세서를 통해 보호받고자 하는 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지 며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태를 포함하 는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0174403", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 명세서에 개시된 일 실시예에 따른 유사도 결정 장치를 설명하기 위한 블록도이다. 도 2는 본 명세서에 개시된 일 실시예에 따른 유사도 결정 장치를 설명하기 위한 예시도이다. 도 3 내지 도 4는 본 명세서에 기재된 일 실시예에 따른 유사도 결정 방법을 설명하기 위한 순서도이다."}
