{"patent_id": "10-2022-0173879", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0166854", "출원번호": "10-2022-0173879", "발명의 명칭": "쇼케이스 층별 상품 인식 방법 및 장치", "출원인": "(주) 인터마인즈", "발명자": "송중석"}}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "장치에 의해 수행되는 방법에 있어서,쇼케이스 층별로 전면 양측에 각각 배치된 복수의 카메라에 의해 촬영된 복수의 촬영 데이터를 획득하는 단계;및상기 복수의 촬영 데이터를 이용하여 해당 층의 중앙영역에 배치된 상품의 종류를 인식하는 단계;를 포함하고,상기 인식 단계는,상기 복수의 촬영 데이터 간 중복된 컬럼(column)을 추출하고, 상품 관련 데이터베이스를 이용하여 상기 추출된컬럼에 배치된 상품의 종류를 인식하는, 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법."}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 쇼케이스의 각각의 층은 n개의 컬럼을 포함하고(여기서, n은 자연수),상기 복수의 카메라 중 제1 카메라에 의해 촬영된 제1 촬영 데이터는 상기 n개의 컬럼 중 순차적인 순서로 n-p개의 컬럼을 포함하고(여기서, p는 n보다 작은 자연수), 상기 복수의 카메라 중 제2 카메라에 의해 촬영된 제2촬영 데이터는 상기 n개의 컬럼 중 역순으로 n-q개의 컬럼을 포함하는(여기서, q는 n보다 작은 자연수),쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법."}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 제1 카메라 및 상기 제2 카메라 각각은,상기 n-p개의 컬럼 및 상기 n-q개의 컬럼 간 m개의 컬럼이 중복되도록 양측에 대칭으로 배치되는,쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법."}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서,상기 인식 단계는,상기 제1 촬영 데이터 및 제2 촬영 데이터 간 상기 중복된 컬럼에 배치된 상품에 대하여, 상기 제1 촬영 데이터및 제2 촬영 데이터를 조합하여 조합 데이터를 생성하고, 상기 데이터베이스에서 상기 조합 데이터와 매칭되는상품을 탐색하고, 상기 탐색된 상품의 종류를 상기 중복된 컬럼에 배치된 상품의 종류로 결정하는,쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법."}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항에 있어서,상기 인식 단계는,상기 제1 촬영 데이터 및 제2 촬영 데이터 간 상기 중복된 컬럼에 배치된 상품에 대하여, 상기 데이터베이스에서 상기 제1 촬영 데이터와의 매칭률이 기 설정된 제1 값 이상인 상품들을 추출하고, 상기 추출된 상품들 중에서 상기 제2 촬영 데이터와의 매칭률이 기 설정된 제2 값 이상인 상품을 탐색하고, 상기 탐색된 상품의 종류를공개특허 10-2023-0166854-3-중복된 컬럼에 배치된 상품의 종류로 결정하는, 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법."}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,기 구축된 학습 모델을 기반으로 상기 복수의 촬영 데이터를 분석하여 해당 층에 배치된 복수의 상품 중에서 오배치된 상품을 인식하는 단계;를 더 포함하는,쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법."}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 학습 모델은, 상품의 진열 상태에 대한 오배치 유형 별 학습 데이터를 학습하여 구축되며,상기 진열 상태에 대한 오배치 유형은, 상기 상품이 x축, y축 및 z축 중 두 개의 축을 기준으로 회전된 경우를포함하는,쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법."}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6 항에 있어서,상기 학습 모델은, 상품의 진열 위치에 대한 오배치의 학습 데이터를 학습하여 구축되며,상기 진열 위치에 대한 오배치는, 상기 상품이 상기 상품에 부여된 컬럼에 배치되지 않은 경우를 나타내는,쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법."}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "컴퓨터와 결합되어, 제1 항 내지 제8 항 중 어느 한 항의 방법을 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 프로그램."}
{"patent_id": "10-2022-0173879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "쇼케이스 층별로 배치된 복수의 카메라와 통신을 수행하는 통신부;상기 복수의 카메라를 기반으로 상기 쇼케이스 내에 진열된 상품의 인식을 위한 적어도 하나의 프로세스를 저장하고 있는 메모리; 및상기 프로세스에 따라 동작하는 프로세서;를 포함하고,상기 프로세서는, 상기 프로세스를 기반으로,상기 통신부를 통해 상기 쇼케이스 층별로 전면 양측에 각각 배치된 상기 복수의 카메라에 의해 촬영된 복수의촬영 데이터를 획득하고,상기 복수의 촬영 데이터를 이용하여 해당 층의 중앙영역에 배치된 상품의 종류를 인식하고,상기 프로세서는 상기 인식 시에,상기 복수의 촬영 데이터 간 중복된 컬럼(column)을 추출하고, 상품 관련 데이터베이스를 이용하여 상기 추출된컬럼에 배치된 상품의 종류를 인식하는, 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 장치.공개특허 10-2023-0166854-4-"}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법 및 장치가 제공된다. 상기 방법은, 쇼케이스 층별로 전면 양측에 각각 배치된 복수의 카메라에 의해 촬영된 복수의 촬영 데이터를 획득하는 단계 및 상기 복수의 촬 영 데이터를 이용하여 해당 층의 중앙영역에 배치된 상품의 종류를 인식하는 단계를 포함하고, 상기 인식 단계는, 상기 복수의 촬영 데이터 간 중복된 컬럼(column)을 추출하고, 상품 관련 데이터베이스를 이용하여 상기 추출된 컬럼에 배치된 상품의 종류를 인식할 수 있다."}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 매장에서 제품을 구매하기 위해서는 구매자가 구매하고자 하는 제품을 선택하고, 선택한 제품의 계 산을 위해 계산대 등 계산장소로 제품을 가지고 간 상태에서 이를 판매하고 있는 판매자에게 비용을 지불하여 구매하는 방식을 채택하고 있다. 예를 들어, 편의점에서 커피를 구매하고자 하는 경우, 구매자는 편의점에서 구매하고자 하는 커피를 냉장고 등 제품수납부에서 취득한 후, 이를 계산대로 들고 간 뒤 판매자에게 건네주고, 판매자가 해당 제품에 대한 가격정 보를 바코드 등을 활용하여 판단한 후, 판단된 가격에 대한 금액을 결제하여 구매자에게 건네줌으로써 제품의 구입단계가 종료된다. 그런데, 상기와 같은 제품 구매 방식의 경우, 판매자가 필수적으로 매대에 대기해야 하기 때문에, 판매자가 사 정 상 자리를 비우는 경우에는 제품을 구매할 수 없는 문제가 있다. 또한, 구매자가 단시간에 많이 몰리거나 계 산을 위한 매대가 한 군데만 존재하는 경우에는, 구매자가 제품을 구매하기 위해 장시간 대기해야 하는 문제가 있다. 또한, 판매 매장측에서는 판매자를 고용해야 하기 때문에 인건비 부담이 가중되는 문제가 있다. 최근 이러한 문제를 극복하기 위하여 제품판매처에서는 키오스크 등 다양한 무인 판매 장치를 설치하여, 구매자 가 판매자에게 제품을 직접 가져가지 않고, 무인 판매 장치를 활용하여 바로 제품을 구매할 수 있는 상황이 늘 어나고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2021-0141234호, 2021.11.23."}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에 개시된 실시예는 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법 및 장치를 제공하는데 그 목적이 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 본 개시에 일 측면에 따른 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법은, 쇼케이스 층별로 전면 양측에 각각 배치된 복수의 카메라에 의해 촬영된 복수의 촬영 데이터를 획 득하는 단계 및 상기 복수의 촬영 데이터를 이용하여 해당 층의 중앙영역에 배치된 상품의 종류를 인식하는 단 계를 포함하고, 상기 인식 단계는, 상기 복수의 촬영 데이터 간 중복된 컬럼(column)을 추출하고, 상품 관련 데 이터베이스를 이용하여 상기 추출된 컬럼에 배치된 상품의 종류를 인식할 수 있다. 또한, 상기 쇼케이스의 각각의 층은 n개의 컬럼을 포함하고(여기서, n은 자연수), 상기 복수의 카메라 중 제1 카메라에 의해 촬영된 제1 촬영 데이터는 상기 n개의 컬럼 중 순차적인 순서로 n-p개의 컬럼을 포함하고(여기서, p는 n보다 작은 자연수), 상기 복수의 카메라 중 제2 카메라에 의해 촬영된 제2 촬영 데이터 는 상기 n개의 컬럼 중 역순으로 n-q개의 컬럼을 포함할 수 있다(여기서, q는 n보다 작은 자연수). 또한, 상기 제1 카메라 및 상기 제2 카메라 각각은, 상기 n-p개의 컬럼 및 상기 n-q개의 컬럼 간 m개의 컬럼이 중복되도록 양측에 대칭으로 배치될 수 있다. 또한, 상기 인식 단계는, 상기 제1 촬영 데이터 및 제2 촬영 데이터 간 상기 중복된 컬럼에 배치된 상품에 대하 여, 상기 제1 촬영 데이터 및 제2 촬영 데이터를 조합하여 조합 데이터를 생성하고, 상기 데이터베이스에서 상 기 조합 데이터와 매칭되는 상품을 탐색하고, 상기 탐색된 상품의 종류를 상기 중복된 컬럼에 배치된 상품의 종 류로 결정할 수 있다. 또한, 상기 인식 단계는, 상기 제1 촬영 데이터 및 제2 촬영 데이터 간 상기 중복된 컬럼에 배치된 상품에 대하 여, 상기 데이터베이스에서 상기 제1 촬영 데이터와의 매칭률이 기 설정된 제1 값 이상인 상품들을 추출하고, 상기 추출된 상품들 중에서 상기 제2 촬영 데이터와의 매칭률이 기 설정된 제2 값 이상인 상품을 탐색하고, 상 기 탐색된 상품의 종류를 중복된 컬럼에 배치된 상품의 종류로 결정할 수 있다. 또한, 상기 방법은, 기 구축된 학습 모델을 기반으로 상기 복수의 촬영 데이터를 분석하여 해당 층에 배치된 복 수의 상품 중에서 오배치된 상품을 인식하는 단계를 더 포함할 수 있다. 또한, 상기 학습 모델은, 상품의 진열 상태에 대한 오배치 유형 별 학습 데이터를 학습하여 구축되며, 상기 진 열 상태에 대한 오배치 유형은, 상기 상품이 x축, y축 및 z축 중 두 개의 축을 기준으로 회전된 경우를 포함할 수 있다. 또한, 상기 학습 모델은, 상품의 진열 위치에 대한 오배치의 학습 데이터를 학습하여 구축되며, 상기 진열 위치 에 대한 오배치는, 상기 상품이 상기 상품에 부여된 컬럼에 배치되지 않은 경우를 나타낼 수 있다. 또한, 본 개시의 다른 측면에 따른 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 장치는, 쇼케이스 층별 로 배치된 복수의 카메라와 통신을 수행하는 통신부, 상기 복수의 카메라를 기반으로 상기 쇼케이스 내에 진열 된 상품의 인식을 위한 적어도 하나의 프로세스를 저장하고 있는 메모리 및 상기 프로세스에 따라 동작하는 프 로세서를 포함하고, 상기 프로세서는, 상기 프로세스를 기반으로, 상기 통신부를 통해 상기 쇼케이스 층별로 전 면 양측에 각각 배치된 상기 복수의 카메라에 의해 촬영된 복수의 촬영 데이터를 획득하고, 상기 복수의 촬영 데이터를 이용하여 해당 층의 중앙영역에 배치된 상품의 종류를 인식하고, 상기 프로세서는 상기 인식 시에, 상 기 복수의 촬영 데이터 간 중복된 컬럼(column)을 추출하고, 상품 관련 데이터베이스를 이용하여 상기 추출된 컬럼에 배치된 상품의 종류를 인식할 수 있다. 이 외에도, 본 개시를 구현하기 위한 실행하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 더 제공될 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기 록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 전술한 과제 해결 수단에 의하면, 복수의 칼럼 각각에 진열된 상품 중에서 중간에 진열된 상품에 대 한 인식률을 높임으로써, 모든 컬럼에 진열된 상품 전체에 대한 인식이 가능해지고, 이에 따라 진열된 모든 상 품에 대한 관리가 효율적으로 이루어질 수 있다. 또한, 본 개시의 전술한 과제 해결 수단에 의하면, 층별 촬영 데이터를 이용하여 각 상품에 대한 오배치 여부를 판단할 수 있어, 상품 진열에 대한 실시간 모니터링이 가능해질 수 있다. 또한, 본 개시의 전술한 과제 해결 수단에 의하면, 쇼케이스 내 설치되는 카메라의 위치에 있어서 기존 방식과 대비하여 효과적이다. 즉, 카메라가 선반에 놓여진 상품들을 대각선으로 내려다볼 수 있는 위치에 설치됨으로써, 선반과 선반 사이(즉, 진열대의 각 층 사이)의 마진(margin)이 작아도 카메라 렌즈와 물체 사이 의 거리가 충분히 확보될 수 있고, 이에 따라 진열대 내 선반을 더 설치할 수 있게 되므로 용적률 측면에서 효 율성을 높일 수 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 개시가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 ‘부, 모듈, 부재, 블록’이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으 며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제 1, 제 2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 본 명세서에서 '본 개시에 따른 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 장치'는 연산처리를 수행 하여 사용자에게 결과를 제공할 수 있는 다양한 장치들이 모두 포함된다. 예를 들어, 본 개시에 따른 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 장치는, 컴퓨터, 서버 장치 및 휴대용 단말기를 모두 포함하거나, 또는 어느 하나의 형태가 될 수 있다. 여기에서, 상기 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱 (laptop), 태블릿 PC, 슬레이트 PC 등을 포함할 수 있다. 상기 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 애플리케이션 서버, 컴퓨팅 서버, 데이터베이스 서버, 파일 서버, 게임 서버, 메일 서버, 프록시 서버 및 웹 서버 등을 포함할 수 있다. 상기 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD) 등과 같은 웨어러블 장치를 포함할 수 있다. 도 1은 본 개시에 따른 따른 무인 판매 시스템을 개략적으로 나타낸 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 무인 판매 시스템은, 쇼케이스 층별 전면 양측에 배치된 카 메라를 기반으로 쇼케이스 내에 진열된 상품을 인식 하기 위한 무인 판매 장치 및 서버를 포함할 수 있다. 여기서, 도 1에 도시된 무인 판매 시스템은 하나의 예시일 뿐이며, 도 1에 도시된 구성요소보다 더 적은 수의 구성요소나 더 많은 구성요소를 포함할 수 있다. 무인 판매 장치는 특정한 종류의 상품들을 판매자 없이 판매하기 위한 장치로서, 판매하고자 하는 상품들 을 진열하는 진열대(즉, 쇼케이스) 형태로 구성되어 상기 진열된 상품들의 출입을 감지하고 재고를 판단하여, 최종적으로 구매자의 구매 상품에 대한 결제를 수행하도록 한다. 일 실시예에 있어서, 무인 판매 장치는 상품을 구매하고자 하는 사용자(즉, 구매자)가 도어를 개폐함에 따 라 내부에 진열된 상품들의 출입 여부를 감지하고, 그 결과를 서버로 전송할 수 있다. 즉, 무인 판매 장치는 무인 판매를 위한 다양한 기능을 수행하는데 필요한 연산처리를 수행하여 사용자에 게 결과를 제공할 수 있는 다양한 장치들이 모두 포함될 수 있다. 예를 들어, 무인 판매 장치는 각종 기기 또는 유무선 네트워크와 통신을 수행하기 위한 통신 모뎀 등의 통신 장치, 각종 프로그램과 데이터를 저장하기 위한 메모리, 프로그램을 실행하여 연산 및 제어하기 위한 마이크로프로세서 등을 구비하는 다양한 컴퓨팅 장치 를 포함할 수 있다. 무인 판매 장치는 내부에 상품들을 진열하는 진열대 형태로 구성될 수 있으며, 진열대 내부는 복수의 선반 이 적층되는 구조로 구성될 수 있다. 또한, 복수의 선반 각각은 복수의 컬럼(column)으로 구분되고, 복수의 컬 럼 각각에는 상품들을 배치할 수 있다. 무인 판매 장치 내에 배치되는 상품은 다양한 종류의 상품들을 포 함할 수 있다. 본 발명의 일 실시예에 있어서, 무인 판매 장치 내에 배치되는 상품은 부피에 비해서 무게 가 가벼운 상품(예: 일반 담배, 전자 담배, 과자 등)일 수 있다. 다만, 이는 하나의 예시일 뿐이고 반드시 이에 한정되는 것은 아니다. 일 실시예에 있어서, 무인 판매 장치 내 각 선반은 소정의 기울기를 가지도록 구성될 수 있으며, 이 경우 각 선반의 각 컬럼 상에 배치된 상품들은 상기 소정의 기울기에 의해서 선반 상의 앞쪽으로 밀려서 이동될 수 있도록 한다. 또한, 일 실시예로, 무인 판매 장치 내 각 선반은 복수개의 탄성부재를 더 구비할 수 있다. 즉, 각 선반 상에 구분된 복수개의 컬럼에 대응하여 복수개의 탄성부재가 설치될 수 있다. 예를 들어, 선반 상의 각 컬럼마 다 하나씩 탄성부재가 설치될 수 있고, 이때 탄성부재는 선반의 뒤쪽에 설치되어 선반의 앞쪽 방향으로 나아가 는 힘(즉, 탄성력)을 가지는 스프링 등을 이용하여 구성될 수 있다. 다시 말해, 탄성부재는 각 컬럼 상에 배치 된 가장 앞쪽의 상품이 빠질 때 마다 탄성력에 의해 각 컬럼 상에 배치된 나머지 상품들을 선반의 앞쪽으로 위 치되도록 미는 힘을 가할 수 있다. 무인 판매 장치는 각 선반의 각 컬럼 상에 배치된 상품들을 촬영할 수 있는 카메라를 구비할 수 있다. 카 메라는 무인 판매 장치 내의 각 선반별로 설치될 수 있으며, 각 선반에 진열된 상품들을 상부에서 대각선 방향으로 내려다보는 위치에 설치될 수 있다. 이때, 무인 판매 장치 내 선반과 선반 사이의 높이(즉, 진열 대 내 각 층의 높이), 선반 상의 컬럼의 수, 상품의 너비(상품의 종류에 따라 다름, 예컨대 전자담배가 일반 담 배보다 상품 너비가 클 수 있음) 등을 기반으로 카메라의 화각을 고려하여 최적의 카메라의 위치 및/또는 카메 라의 개수가 정해질 수 있다. 즉, 각 층의 높이, 상품의 너비 등에 따라 하나의 카메라가 인식할 수 있는 영역 (즉, 컬럼의 개수)이 제한되므로, 일 실시예로 카메라는 무인 판매 장치 내의 각 선반별로 전면 양측에 설 치될 수 있다. 보다 상세하게, 카메라는 무인 판매 장치 내의 각 선반별로 전면 좌측 상부 및 우측 상부에 서 대각선 방향으로 내려다보는 위치에 설치될 수 있다. 예를 들어, 각 선반별로 좌측 및 우측에 각각 카메라 (즉, 좌측 카메라 및 우측 카메라)가 설치될 수 있다. 다만, 이는 하나의 예시일 뿐이고 반드시 이에 한정되는 것은 아니다. 무인 판매 장치는 각 선반별로 각 컬럼에 진열(배치)될 상품에 대한 정보(예컨대, 상품명, 상품 가격, 상 품 크기 등)를 설정하고 저장할 수 있다. 일 예로, 무인 판매 장치는 서버로부터 각 선반별로 각 컬 럼에 배치될 상품에 대한 정보를 수신할 수도 있고, 서버의 요청에 따라 각 컬럼별로 배치될 상품에 대한 정보를 변경할 수도 있다. 서버는 클라이언트 또는 다른 웹서버의 작업수행 요청에 대응하는 작업 결과를 도출하여 제공하는 컴퓨터 시스템, 컴퓨터 소프트웨어(웹서버 프로그램)를 포함할 수 있다. 서버는 전술한 웹서버 프로그램 이외에, 웹서버상에서 동작하는 일련의 응용 프로그램(Application Program) 또는 장치 내부에 구축되어 있는 각종 데이터베이스를 포함할 수 있다. 예를 들어, 서버는 본 개시에 따른 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 장치의 형태가 될 수 있다. 서버는 네트워크를 경유하여 매장 별로 적어도 하나 이상의 무인 판매 장치와 연동할 수 있다. 일 예 로, 서버는 무인 판매 장치에서 판매되는 상품들에 대한 정보(예컨대, 전체 상품별 개수, 각 상품의 가격, 각 상품의 크기, 각 상품의 진열 위치, 식별 정보, 상품의 상/하/좌/우 이미지 등)를 관리할 수 있다. 서 버는 무인 판매 장치로 각 컬럼별로 배치될 상품에 대한 정보(예컨대, 상품명, 상품 가격, 상품 크기 등)를 전송하여 무인 판매 장치 내에 설정되도록 할 수 있다. 서버는 무인 판매 장치로부터 쇼케이스의 층별로 각각 백치된 복수의 카메라로터 복수의 촬영 데이터 를 수신하여 쇼케이스의 각 층별로 진열된 상품의 진열 상태를 파악하고 이를 관리할 수 있다. 서버는 구매자가 무인 판매 장치의 도어 개폐를 통해 외부로 반출시킨 구매 상품에 대한 정보(예: 구 매 상품의 상품명, 개수 등)를 무인 판매 장치로부터 수신하고, 이를 기반으로 상기 구매자의 구매 상품에 대한 결제 금액을 산출하여 결제장치로 전송할 수 있다. 이후, 구매자는 결제장치를 통해 구매한 상품에 대한 결제를 수행할 수 있다. 한편, 네트워크는 서버 및 적어도 하나 이상의 무인 판매 장치 간의 다양한 정보를 송수신할 수 있다. 네트워크는 다양한 형태의 통신망이 이용될 수 있으며, 예컨대, WLAN(Wireless LAN), 와이파이(Wi-Fi), 와이브로(Wibro), 와이맥스(Wimax), HSDPA(High Speed Downlink Packet Access) 등의 무선 통신방식 또는 이더 넷(Ethernet), xDSL(ADSL, VDSL), HFC(Hybrid Fiber Coax), FTTC(Fiber to The Curb), FTTH(Fiber To The Home) 등의 유선 통신방식이 이용될 수 있다. 네트워크는 상기에 제시된 통신방식에 한정되는 것은 아니며, 상술한 통신방식 이외에도 기타 널리 공지되었거 나 향후 개발될 모든 형태의 통신 방식을 포함할 수 있다. 도 2는 본 개시에 따른 무인 판매 장치와 서버에 포함된 구성을 개략적으로 나타낸 도면이다. 무인 판매 장치는 상품을 수납할 수 있는 로드셀, 도어부 및 카메라를 포함하는 상품수납 부와 서버와의 통신을 수행할 수 있는 제1 통신부 등을 포함하도록 마련될 수 있다. 서버는 메모리, 무인 판매 장치와 통신을 수행할 수 있는 제2 통신부 및 메모리와 통 신을 수행할 수 있는 적어도 하나의 프로세서 등을 포함하도록 마련될 수 있다. 한편 로드셀은 무인 판매 장치 내에 상품을 수납할 수 있는 수납공간을 의미할 수 있다. 로드셀(11 0)은 경사각(θ1)만큼 기울어져 있기 때문에 이용자가 상품을 수취해 가면 경사면을 타고 상품이 도어부 쪽으로 이동할 수 있다. 한편 도어부는 무인 판매 장치에 장착된 상품수납부의 문일 수 있다. 후술하는 바에 따라 상품 판매개수 산출 시 ABS모드의 절대연산을 수행하는 경우, 도어부의 문이 열릴 때와 문이 닫힐 때를 기준으 로 상기 연산이 수행될 수 있다. 한편 카메라는 무인 판매 장치의 쇼케이스 층별로 설치되어 진열된 상품의 영상을 촬영할 수 있다. 카메라에서 촬영된 상품의 촬영 데이터는 서버에 전달되어 프로세서에서 상기 수신한 촬영 데이 터를 기초로 진열 상품의 모니터링을 수행할 수 있다. 일 실시예로, 본 개시에 따른 카메라는 인공지능 기반의 머신비전 카메라를 의미할 수 있다. 머신비전 카메라는 렌즈와 이미지 센서, 메인보드 및 인터페이스 보드로 구성될 수 있으나, 이에 제한되는 것은 아니다. 또한, 렌 즈와 이미지 센서를 통해 만들어진 영상은 메인보드에서 필요에 따라 적합한 형태로 보정될수 있다. 이렇게 메 인보드에서 처리된 영상은 서버에 전송될 수 있다. 머신비전 카메라는 GigE Vision 카메라(Gigabit Ethernet Vision Camera), USB3.0 카메라, CameraLink 카메라, CoaXPress 카메라 등이 포함될 수 있다. 메모리는 본 장치의 다양한 기능을 지원하는 데이터와, 프로세서의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들(예를 들어, 음악 파일, 정지영상, 동영상 등)을 저장할 있고, 본 장치에서 구동 되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 본 장치의 동작을 위한 데 이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부 터 다운로드 될 수 있다. 메모리는 복수의 카메라를 기반으로 상기 쇼케이스 내에 진열된 상품의 인식을 위한 적어도 하나의 프로세 스를 저장할 수 있다. 이러한, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입 (Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 본 장치와는 분리되어 있으나, 유선 또는 무선으로 연결된 데이터베이스가 될 수도 있다. 적어도 하나의 프로세서는 본 장치 내의 구성요소들의 동작을 제어하기 위한 알고리즘 또는 알고리즘을 재 현한 프로그램에 대한 데이터를 저장하는 메모리, 및 메모리에 저장된 데이터를 이용하여 전술한 동작을 수행할 수 있다. 이때, 메모리와 프로세서는 각각 별개의 칩으로 구현될 수 있다. 또는, 메모리(21 0)와 프로세서는 단일 칩으로 구현될 수도 있다. 또한, 프로세서는 이하의 도 4 내지 도 7에서 설명되는 본 개시에 따른 다양한 실시 예들을 본 장치 상에 서 구현하기 위하여, 위에서 살펴본 구성요소들을 중 어느 하나 또는 복수를 조합하여 제어할 수 있다. 상기 구성요소들 중 무인 판매 장치의 제1 통신부 및 서버의 제2 통신부은 외부 장치와 통 신을 가능하게 하는 하나 이상의 구성 요소를 포함할 수 있으며, 예를 들어, 방송 수신 모듈, 유선통신 모듈, 무선통신 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나일 수 있다. 유선 통신 모듈은, 지역 통신(Local Area Network; LAN) 모듈, 광역 통신(Wide Area Network; WAN) 모듈 또는 부가가치 통신(Value Added Network; VAN) 모듈 등 다양한 유선 통신 모듈뿐만 아니라, USB(Universal Serial Bus), HDMI(High Definition Multimedia Interface), DVI(Digital Visual Interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 다양한 케이블 통신 모듈을 포함할 수 있다. 무선 통신 모듈은 와이파이(Wifi) 모듈, 와이브로(Wireless broadband) 모듈 외에도, GSM(global System for Mobile Communication), CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), UMTS(universal mobile telecommunications system), TDMA(Time Division Multiple Access), LTE(Long Term Evolution), 4G, 5G, 6G 등 다양한 무선 통신 방식을 지원하는 무선 통신 모듈을 포함할 수 있 다. 무선 통신 모듈은 이동통신 신호를 송신하는 안테나 및 송신기(Transmitter)를 포함하는 무선 통신 인터페이스 를 포함할 수 있다. 또한, 무선 통신 모듈은 제어부의 제어에 따라 무선 통신 인터페이스를 통해 제어부로부터 출력된 디지털 제어 신호를 아날로그 형태의 무선 신호로 변조하는 이동통신 신호 변환 모듈을 더 포함할 수 있 다. 무선 통신 모듈은 이동통신 신호를 수신하는 안테나 및 수신기(Receiver)를 포함하는 무선 통신 인터페이스를 포함할 수 있다. 또한, 무선 통신 모듈은 무선 통신 인터페이스를 통하여 수신한 아날로그 형태의 무선 신호를 디지털 제어 신호로 복조하기 위한 이동통신 신호 변환 모듈을 더 포함할 수 있다. 근거리 통신 모듈은 근거리 통신(Short range communication)을 위한 것으로서, 블루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근거리 통신을 지원할 수 있다. 도 3은 본 개시에 따른 복수의 컬럼으로 구분된 선반에 진열된 상품들과 상기 상품들을 촬영하기 위해 구비된 카메라를 위에서 내려다본 도면이다. 도 3을 참조하면, 진열대의 각 선반(즉, 쇼케이스의 각 층)은 복수의 컬럼(예: 컬럼1, 컬럼2, 컬럼3, …. , 컬 럼n)으로 구분될 수 있고, 각 컬럼(예: 컬럼1, 컬럼2, 컬럼3, …. , 컬럼n) 상에는 상품들이 배치될 수 있다. 이때, 각 컬럼별로는 다른 종류의 상품들이 배치될 수 있고, 동일 컬럼(즉, 하나의 컬럼)에는 동일한 상품들이 배치될 수 있다. 예를 들어, 컬럼1에는 A 상품들이 배치되고, 컬럼2에는 B 상품들이 배치되고, 컬럼3에는 C 상 품들이 배치되고, 컬럼4에는 D 상품들이 배치될 수 있다. 또한, 각 컬럼 상에 배치된 상품들은 선반의 앞쪽부터 배치되어 정렬될 수 있고, 예를 들어 구매자는 도어를 열어서 진열대 내의 선반 상에서 각 컬럼별로 가장 앞쪽에 배치된 상품을 선택하여 진열대 외부로 반출할 수 있다. 일 실시예로, 도 3에 도시된 것처럼, 카메라는 진열대의 선반에 진열된 상품을 상부에서 대각선 방향으로 내려다보도록 진열대 내부에 설치될 수 있고, 진열대 내의 각 선반별로 각각 설치될 수 있다. 이때, 진열대 내 의 선반과 선반 사이의 높이(즉, 진열대 내 각 층의 높이), 선반 상의 컬럼의 수, 상품의 너비(상품의 종류에 따라 다름, 예컨대 전자담배가 일반 담배보다 상품 너비가 클 수 있음) 중 적어도 하나를 기반으로 카메라(13 0)의 화각을 고려하여 최적의 카메라의 위치 및/또는 카메라의 개수가 정해질 수 있다. 일 예로서, 도 3에 도시 된 바와 같이, 각 층의 높이, 상품의 너비 등에 따라 하나의 카메라가 인식할 수 있는 영역(즉, 컬럼의 개수)을 고려하여, 선반의 좌측 상부 및 우측 상부에서 대각선 방향으로 내려다보는 위치에 2개의 카메라(즉, 좌측 카메 라 및 우측 카메라)가 설치될 수 있다. 또한, 카메라(즉, 좌측 카메라 및 우측 카메라)는 선반의 앞 쪽 영역에 배치된 상품들을 인식할 수 있도록 하는 위치인 선반 앞단의 좌측 상부 및 우측 상부에 설치될 수 있 다. 도 4는 본 개시에 따른 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법의 순서도이다. 도 4의 방법은 도 2에 개시된 서버에 의해 수행될 수 있다. 또한, 상술한 바와 같이 도 2에 개시된 서버는 본 개시 에 따른 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 장치의 형태가 될 수 있다. 또한, 이하에서는 도 4의 방법을 서버가 수행하는 것으로 설명하지만, 경우에 따라 도 4의 방법은 도 2에 개시된 무인 판매 장 치에 의해 수행될 수도 있다. 도 4를 참조하면, 서버의 프로세서는 쇼케이스 층별로 전면 양측에 각각 배치된 복수의 카메라에 의 해 촬영된 복수의 촬영 데이터를 획득할 수 있다(S110). 상술한 바와 같이, 무인 판매 장치는 쇼케이스의 각 층마다(즉, 진열대의 각 선반마다) 전면 좌측에 하나 의 카메라를 배치하고, 전면 우측에 다른 하나의 카메라를 배치할 수 있다. 또한, 무인 판매 장치는, 상술한 바 와 같이, 쇼케이스의 각 층마다 n개의 컬럼을 포함하고(여기서, n은 자연수), 각 컬럼에는 각각의 상품이 진열 될 수 있다. 도 5에 도시된 바와 같이, 각 층별로 양쪽 끝에 안쪽을 바라보는 방향으로 배치된 복수의 카메라는 각각 진열 상품의 영상을 촬영할 수 있다. 이렇게 생성된 복수의 촬영 데이터는 제2 통신부를 통해 서버로 수신 될 수 있다. 보다 상세하게, 복수의 카메라 중 좌측에 설치된 제1 카메라에 의해 촬영된 제1 촬영 데이터는 n개의 컬럼 중 순차적인 순서로 n-p개의 컬럼을 포함할 수 있다. 여기서, p는 n보다 작은 자연수일 수 있다. 또한, 복수의 카메라 중 우측에 설치된 제2 카메라에 의해 촬영된 제2 촬영 데이터는 n개의 컬럼 중 역순 으로 n-q개의 컬럼을 포함할 수 있다. 여기서, q는 n보다 작은 자연수일 수 있다. 도 5를 참조하면, n이 10이고, p가 4고, q가 4인 경우, 컬럼 1의 좌측에 배치된 제1 카메라에 의해 촬영된 제1 촬영 데이터는 컬럼 1부터 컬럼 6까지만 포함할 수 있고, 컬럼 10의 우측에 배치된 제2 카메라에 의해 촬영된 제2 촬영 데이터는 컬럼 10부터 컬럼 5까지만 포함할 수 있다. 즉, 제1 카메라는 상품 1부터 상품 6까지만 촬영할 수 있고, 제2 카메라는 상품 10부터 상품 5까지만 촬영할 수 있다. 상기에서는, p와 q가 동일한 값인 것으로 설명하였지만, 이에 제한되지 않고 p와 q는 다른 값일 수 있다. 이때, 제1 카메라 및 제2 카메라 각각은, 상기 n-p개의 컬럼 및 상기 n-q개의 컬럼 간 m개의 컬럼이 중복되도록 양측에 대칭으로 배치될 수 있다. 이는, 카메라가 층별로 전면 양측에 배치되기 때문에, 중앙영역 (즉, 총 10개의 컬럼이라면 중앙영역인 5번째, 6번째 컬럼)은 이미지가 작아서 인식률이 떨어질 수 있기 때문에, 중간 순번의 컬럼이 중복되도록 카메라를 배치시키고, 중복된 영역의 촬영 데이터를 활용하여 중앙영역 의 인식률을 높이기 위함이다. 중복으로 촬영될 컬럼의 개수(m)는 서버에 의해 미리 설정될 수 있다. 무인 판매 장치는 이러한 설정 정보에 따라 카메라의 배치를 변경하여 촬영 데이터를 생성할 수 있다. 도 6을 참조하면, n이 10이고, p가 4고, q가 4고, m이 2로 설정된 경우, 제1 촬영 데이터의 컬럼 5 및 컬럼 6의 해당하는 부분과, 제2 촬영 데이터의 컬럼 5 및 컬럼 6의 해당하는 부분이 중복될 수 있다. 도 4를 참조하면, 서버의 프로세서는 각 층별로 복수의 촬영 데이터를 이용하여 해당 층의 중앙영역 에 배치된 상품의 종류를 인식할 수 있다(S120).보다 상세하게, 서버의 프로세서는 복수의 촬영 데이터 간 중복된 컬럼(column)을 추출하고, 상품 관 련 데이터베이스를 이용하여 상기 추출된 컬럼에 배치된 상품의 종류를 인식할 수 있다. 상술한 바와 같이, 중복된 컬럼의 개수는 서버에 의해 미리 설정되기 때문에, 서버는 이러한 설정 정 보를 저장해놓고 있는다. 그리고, 복수의 촬영 데이터가 획득되면 저장된 설정 정보에 기초하여 중복된 컬럼을 추출할 수 있다. 서버의 프로세서는 중복된 컬럼에 포함된 상품 이미지를 상품 관련 데이터베이스에서 찾아서 해당 상 품의 종류를 파악할 수 있다. 여기서, 상품 관련 데이터베이스는 서버 내에 포함될 수도 있고, 서버 와 분리되어 있으나, 유선 또는 무선으로 연결될 수도 있다. 또한, 상품 관련 데이터베이스 무인 판매 장치 에 진열된 모든 상품에 대한 정보를 포함할 수 있다. 실시예에 따라, 서버의 프로세서는, 제1 촬영 데이터 및 제2 촬영 데이터 간 상기 중복된 컬럼에 배 치된 상품에 대하여, 제1 촬영 데이터 및 제2 촬영 데이터를 조합하여 조합 데이터를 생성하고, 상품 관련 데이 터베이스에서 상기 조합 데이터와 매칭되는 상품을 탐색하고, 상기 탐색된 상품의 종류를 상기 중복된 컬럼에 배치된 상품의 종류로 결정할 수 있다. 이때, 중복된 컬럼이 복수개인 경우, 각 촬영 데이터에서 동일한 컬럼의 상품 이미지끼리 조합 데이터를 생성할 수 있다. 도 6을 참조하면, 중복된 컬럼이 컬럼 5, 컬럼 6인 경우, 제1 촬영 데이터에서 컬럼 5에 해당하는 부분과 제2 촬영 데이터에서 컬럼 5에 해당하는 부분을 조합하여 상품 5에 대한 조합 데이터를 생성하고, 제2 촬영 데이터 에서 컬럼 6에 해당하는 부분과 제2 촬영 데이터에서 컬럼 6에 해당하는 부분을 조합하여 상품 6에 대한 조합 데이터를 생성할 수 있다. 그리고, 상품 5에 대한 조합 데이터를 이용하여 상기 데이터베이스 내에서 매칭되는 상품을 탐색하고, 탐색된 상품의 종류를 상품 5의 종류로 결정할 수 있다. 또한, 상품 6에 대한 조합 데이터를 이용하여 상기 데이터베이스 내에서 매칭되는 상품을 탐색하고, 탐색된 상품의 종류를 상품 6의 종류로 결정할 수 있다. 조합 데이터는 인식률이 낮은 두 개의 데이터를 중첩하여 생성될 수 있다. 이로 인해, 조합 데이터 내의 객체의 인식률을 더 높일 수 있다. 그리고, 서버의 프로세서는 상품 관련 데이터베이스에서 조합 데이터 내의 객체의 이미지와 매칭되는 상품을 탐색하고, 탐색된 상품의 종류를 상기 추출된 컬럼 내의 상품의 종류인 것으로 판단할 수 있다. 실시예에 따라, 서버의 프로세서는, 제1 촬영 데이터 및 제2 촬영 데이터 간 중복된 컬럼에 배치된 상품에 대하여, 상품 관련 데이터베이스에서 상기 제1 촬영 데이터와의 매칭률이 기 설정된 제1 값 이상인 상품 들을 추출하고, 상기 추출된 상품들 중에서 상기 제2 촬영 데이터와의 매칭률이 기 설정된 제2 값 이상인 상품 을 탐색하고, 상기 탐색된 상품의 종류를 중복된 컬럼에 배치된 상품의 종류로 결정할 수 있다. 도 6을 참조하면, 중복된 컬럼이 컬럼 5, 컬럼 6인 경우, 서버의 프로세서는, 상품 관련 데이터베이 스에 저장된 상품 정보에 기초하여, 제1 촬영 데이터에서 컬럼 5에 해당하는 이미지와의 매칭률이 제1 값 이상 (예를 들어, 80퍼센트 이상)인 상품들을 추출하고, 다시 추출들 상품들의 상품 정보에 기초하여, 제2 촬영 데이 터에서 컬럼 5에 해당하는 이미지와의 매칭률이 제2 값 이상(예를 들어, 80퍼센트 이상)인 상품을 탐색하고, 상 기 탐색된 상품의 종류를 상기 컬럼 5에 진열된 상품 5의 종류로 결정할 수 있다. 또한, 상품 관련 데이터베이 스에 저장된 상품 정보에 기초하여, 제1 촬영 데이터에서 컬럼 6에 해당하는 이미지와의 매칭률이 제1 값 이상 (예를 들어, 80퍼센트 이상)인 상품들을 추출하고, 다시 추출들 상품들의 상품 정보에 기초하여, 제2 촬영 데이 터에서 컬럼 6에 해당하는 이미지와의 매칭률이 제2 값 이상(예를 들어, 80퍼센트 이상)인 상품을 탐색하고, 상 기 탐색된 상품의 종류를 상기 컬럼 6에 진열된 상품 6의 종류로 결정할 수 있다. 실시예에 따라, 제2 촬영 데이터를 이용한 상품 탐색은, 제1 촬영 데이터를 이용하여 탐색된 복수의 상품들 중 에서 매칭률이 가장 높은 하나의 상품만을 추출하여 해당 컬럼에 진열된 상품의 종류를 결정할 수 있다. 한편, 본 개시에 따른 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법은, 기 구축된 학습 모델을 기 반으로 상기 복수의 촬영 데이터를 분석하여 해당 층에 배치된 복수의 상품 중에서 오배치된 상품을 인식하는 단계를 더 포함할 수 있다. 실시예에 따라, 상기 학습 모델은, 상품의 진열 상태에 대한 오배치 유형 별 학습 데이터를 학습하여 구축될 수 있다. 즉, 상품이 비뚤어지게 진열된 경우를 유형별로 학습한 학습 모델을 통해 상기 층별로 수신된 복수의 촬 영 데이터로부터 각 층에 진열된 상품 중에서 비뚤어지게 진열된 상품이 있는지를 파악할 수가 있다.여기서, 진열 상태에 대한 오배치 유형은, 상기 상품이 x축, y축 및 z축 중 두 개의 축을 기준으로 회전된 경우 를 포함할 수 있다. 제1 학습 데이터는, 도 7a에 도시된 바와 같이, 상품이 올바르게 배치된 경우의 데이터일 수 있다. 제2 학습 데이터는, 도 7b에 도시된 바와 같이, 상품이 xz 평면 기준으로 180도 회전한 경우 및 yz 평면 기준으 로 180도 회전한 경우의 데이터를 포함할 수 있다. 제3 학습 데이터는, 도 7c에 도시된 바와 같이, 상품이 xz 평면 기준으로 0도~90도 회전한 경우 및 xz 평면 기 준으로 90도~180도 회전한 경우의 데이터를 포함할 수 있다. 제4 학습 데이터는, 도 7d에 도시된 바와 같이, 상품이 yz 평면 기준 내측으로 0도~90도 회전한 경우 및 yz 평 면 기준 외측으로 0도~90도 회전한 경우의 데이터를 포함할 수 있다. 실시예에 따라, 상기 학습 모델은, 상품의 진열 위치에 대한 오배치의 학습 데이터를 학습하여 구축될 수 있다. 여기서, 진열 위치에 대한 오배치는, 상기 상품이 상기 상품에 부여된 컬럼에 배치되지 않은 경우를 나타낼 수 있다. 즉, 각 상품과 해당 상품이 배치되어야 할 위치를 매칭하여 학습된 학습 모델을 통해 상기 층별로 수신된 복수 의 촬영 데이터로부터 각 층에 진열된 상품 중에서 진열 위치가 잘못된 상품이 있는지를 파악할 수가 있다. 도 4는 단계 S110 및 단계 S120을 순차적으로 실행하는 것으로 기재하고 있으나, 이는 본 실시예의 기술 사상을"}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "예시적으로 설명한 것에 불과한 것으로서, 본 실시예가 속하는 기술분야에서 통상의 지식을 가진 자라면 본 실 시예의 본질적인 특성에서 벗어나지 않는 범위에서 도 4에 기재된 순서를 변경하여 실행하거나 단계 단계 S110 내지 및 S120을 병렬적으로 실행하는 것으로 다양하게 수정 및 변형하여 적용 가능할 것이므로, 도 4는 시계열 적인 순서로 한정되는 것은 아니다. 한편, 상술한 설명에서, 단계 S110 및 단계 S120은 본 개시의 구현예에 따라서, 추가적인 단계들로 더 분할되거 나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변 경될 수도 있다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2022-0173879", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2022-0173879", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시에 따른 따른 무인 판매 시스템을 개략적으로 나타낸 도면이다. 도 2는 본 개시에 따른 무인 판매 장치와 서버에 포함된 구성을 개략적으로 나타낸 도면이다. 도 3은 본 개시에 따른 복수의 컬럼으로 구분된 선반에 진열된 상품들과 상기 상품들을 촬영하기 위해 구비된 카메라를 위에서 내려다본 도면이다. 도 4는 본 개시에 따른 쇼케이스 층별 전면 양측에 배치된 카메라 기반 인식 방법의 순서도이다. 도 6은 본 개시에 따른 복수의 촬영 데이터 간 중복된 컬럼을 설명하기 위한 예시도이다. 도 7a 내지 도 7d는 본 개시에 따른 상품의 진열 상태에 대한 오배치 유형을 설명하기 위한 예시도이다."}
