{"patent_id": "10-2023-0177922", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0051527", "출원번호": "10-2023-0177922", "발명의 명칭": "안테나 및 이를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김광현"}}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,하우징(301);상기 하우징 내에 배치된 인쇄 회로 기판;상기 하우징 내에 위치하고, 제1 안테나 패턴이 형성된 안테나 인클로저를 포함하는 안테나(310);상기 안테나와 인접 배치된 스피커로서, 스피커 유닛, 및 상기 스피커 유닛을 수용하고 제2 안테나 패턴이 형성된 스피커 인클로저를 포함하는 스피커(320); 및상기 안테나 인클로저와 상기 스피커 인클로저를 연결하는 연결 부재로서, 상기 안테나 내에 위치한 제1 영역,상기 스피커 내에 위치한 제2 영역, 및 상기 제1 영역과 상기 제2 영역을 연결하는 제3 영역을 포함하는 연결부재(330);를 포함하고,상기 연결 부재는 상기 제1 안테나 패턴과 상기 제2 안테나 패턴을 전기적으로 연결하는 전도성 부분(335)을 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 제3 영역은 실리콘 또는 고무 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 및 제2 항 중 어느 한 항에 있어서,상기 안테나는 상기 제1 안테나 패턴과 상기 인쇄 회로 기판을 연결하는 안테나 케이블;을 더 포함하고,상기 스피커는 상기 스피커 유닛과 상기 인쇄 회로 기판을 연결하는 스피커 케이블;을 더 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 안테나 케이블과 상기 스피커 케이블은 중첩되지 않도록 배치된 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3 항에 있어서,상기 스피커 인클로저는 상기 스피커 케이블이 관통하도록 구성된 제1 개구를 더 포함하고,상기 안테나 인클로저는 상기 안테나 케이블이 관통하도록 구성된 제2 개구, 및 상기 스피커 케이블이 관통하도록 구성되고 상기 제2 개구와 이격 배치된 제3 개구를 더 포함하는 전자 장치.공개특허 10-2025-0051527-3-청구항 6 제1항 내지 제5 항 중 어느 한 항에 있어서,상기 안테나 인클로저는 상기 스피커와 대면하는 제2 면을 포함하고,상기 제1 영역은 상기 제2 면의 적어도 일부와 접하고,상기 스피커 인클로저는 상기 안테나와 대면하는 제5 면을 포함하고,상기 제2 영역은 상기 제5 면의 적어도 일부와 접하고,상기 제3 영역은 상기 제2 면에 형성된 제1 홀을 관통하여 상기 제1 영역과 연결되고, 상기 제5 면에 형성된 제2 홀을 관통하여 상기 제2 영역과 연결되는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 연결 부재의 상기 제3 영역은 상기 제1 안테나 패턴의 적어도 일부, 및 상기 제2 안테나 패턴의 적어도 일부와 중첩하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7 항 중 어느 한 항에 있어서,상기 안테나는 제1 고정 부재에 의해 상기 하우징에 고정되는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 제1 고정 부재는 테이프, 후크, 또는 스크류 중 어느 하나를 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9 항 중 어느 한 항에 있어서,상기 스피커는 제2 고정 부재에 의해 상기 하우징에 고정되고,상기 제2 고정 부재는 실리콘 또는 고무 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항 내지 제10 항 중 어느 한 항에 있어서,상기 스피커는,상기 스피커 인클로저 및 상기 스피커 유닛으로 둘러싸인 공명 공간, 및 상기 스피커 인클로저에 형성되고 상기 스피커 유닛에서 발생한 소리를 방사하도록 구성된 음향 홀을 더 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2025-0051527-4-제1 항 내지 제11 항 중 어느 한 항에 있어서,상기 안테나 인클로저의 일면은 상기 하우징의 가장자리에 인접 배치된 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1 항 내지 제12 항 중 어느 한 항에 있어서,상기 하우징은 적어도 하나의 도전성 부분을 포함하고,상기 제1 안테나 패턴은 상기 도전성 부분과 전기적으로 연결된 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1 항 내지 제13 항 중 어느 한 항에 있어서,상기 연결 부재는 상기 제1 안테나 패턴과 상기 제1 영역을 연결하는 제1 솔더 부재(334a), 및 상기 제2 안테나패턴과 상기 제2 영역을 연결하는 제2 솔더 부재(334b)를 더 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1 항 내지 제14 항 중 어느 한 항에 있어서,상기 제3 영역의 경도는 50도 이상인 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치에 있어서,하우징;상기 하우징 내에 배치된 인쇄 회로 기판;상기 하우징 내에 위치하고, 제1 안테나 패턴이 형성된 안테나 인클로저를 포함하는 안테나;상기 하우징 내에 위치하고, 상기 안테나와 인접 배치된 스피커로서, 스피커 유닛, 및 상기 스피커 유닛을 수용하고 제2 안테나 패턴이 형성된 스피커 인클로저를 포함하는 스피커; 및상기 안테나 인클로저와 상기 스피커 인클로저를 연결하는 연결 부재로서, 상기 제1 안테나 패턴과 상기 제2 안테나 패턴을 전기적으로 연결하는 전도성 부분을 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서,상기 안테나 내에 위치한 제1 영역, 상기 스피커 내에 위치한 제2 영역, 및 상기 제1 영역과 상기 제2 영역을연결하는 제3 영역을 포함하는 연결 부재;를 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서,상기 제3 영역은 실리콘 및 고무 중 적어도 하나를 포함하는 전자 장치. 공개특허 10-2025-0051527-5-청구항 19 제16항 내지 제18 항 중 어느 한 항에 있어서,상기 안테나는 상기 제1 안테나 패턴과 상기 인쇄 회로 기판을 연결하는 안테나 케이블;을 더 포함하고,상기 스피커는 상기 스피커 유닛과 상기 인쇄 회로 기판을 연결하고, 상기 안테나 케이블과 중첩되지 않도록 배치된 스피커 케이블;을 더 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서,상기 스피커 인클로저는 상기 스피커 케이블이 관통하도록 구성된 제1 개구를 더 포함하고,상기 안테나 인클로저는 상기 안테나 케이블이 관통하도록 구성된 제2 개구, 및 상기 스피커 케이블이 관통하도록 구성되고 상기 제2 개구와 이격 배치된 제3 개구를 더 포함하는 전자 장치."}
{"patent_id": "10-2023-0177922", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 전자 장치는, 하우징, 상기 하우징 내에 배치된 인쇄 회로 기판, 상기 하우징 내에 위치하고 제1 안테나 패턴이 형성된 안테나 인클로저를 포함하는 안테나, 상기 안테나와 인접 배치된 스피커로서, 스피커 유닛, 및 상기 스피커 유닛을 수용하고 제2 안테나 패턴이 형성된 스피커 인클로저를 포함하 는 스피커, 및 상기 안테나 인클로저와 상기 스피커 인클로저를 연결하는 연결 부재로서, 상기 안테나 내에 위치 한 제1 영역, 상기 스피커 내에 위치한 제2 영역, 및 상기 제1 영역과 상기 제2 영역을 연결하는 제3 영역을 포 함하는 연결 부재를 포함할 수 있다. 상기 연결 부재는 상기 제1 안테나 패턴과 상기 제2 안테나 패턴을 전기적 으로 연결하는 전도성 부분을 더 포함할 수 있다."}
{"patent_id": "10-2023-0177922", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 일 실시예는 안테나 및 이를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0177922", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보통신 기술과 반도체 기술의 눈부신 발전에 힘입어 각종 전자 장치들의 보급과 이용이 급속도로 증가하고 있 다. 최근의 전자 장치들은 휴대하고 다니며 통신할 수 있도록 개발되고 있다. 전자 장치라 함은, 가전제품으로부터, 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC, 영 상/음향 장치, 데스크톱/랩톱 컴퓨터, 차량용 내비게이션와 같이 탑재된 프로그램에 따라 특정 기능을 수행하는 장치를 의미할 수 있다. 예를 들면, 이러한 전자 장치들은 저장된 정보를 음향이나 영상으로 출력할 수 있다. 전자 장치의 집적도가 높아지고, 초고속, 대용량 무선통신이 보편화되면서, 최근에는, 이동통신 단말기와 같은 하나의 전자 장치에 다양한 기능이 탑재될 수 있다. 예를 들면, 통신 기능뿐만 아니라, 게임과 같은 엔터테인먼 트 기능, 음악/동영상 재생과 같은 멀티미디어 기능, 모바일 뱅킹 등을 위한 통신 및 보안 기능, 일정 관리나 전자 지갑 등의 기능이 하나의 전자 장치에 집약되고 있는 것이다. 이러한 전자 장치는 사용자가 편리하게 휴대 할 수 있도록 소형화되고 있다. 이동통신 서비스가 멀티미디어 서비스 영역까지 확장되면서, 음성 통화나 단문 메시지뿐만 아니라 멀티미디어 서비스를 사용자가 충분히 이용하기 위해서, 전자 장치의 디스플레이의 크기가 커질 수 있다."}
{"patent_id": "10-2023-0177922", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 전자 장치는, 하우징, 상기 하우징 내에 배치된 인쇄 회로 기판, 상기 하우징 내에 위치하고 제1 안테나 패턴이 형성된 안테나 인클로저를 포함하는 안테나, 상기 안테나와 인접 배치된 스피커로 서, 스피커 유닛, 및 상기 스피커 유닛을 수용하고 제2 안테나 패턴이 형성된 스피커 인클로저를 포함하는 스피 커, 및 상기 안테나 인클로저와 상기 스피커 인클로저를 연결하는 연결 부재로서, 상기 안테나 내에 위치한 제1 영역, 상기 스피커 내에 위치한 제2 영역, 및 상기 제1 영역과 상기 제2 영역을 연결하는 제3 영역을 포함하는 연결 부재를 포함할 수 있다. 상기 연결 부재는 상기 제1 안테나 패턴과 상기 제2 안테나 패턴을 전기적으로 연 결하는 전도성 부분을 더 포함할 수 있다.본 개시의 일 실시예에 따른 전자 장치는, 하우징, 상기 하우징 내에 배치된 인쇄 회로 기판, 상기 하우징 내에 위치하고 제1 안테나 패턴이 형성된 안테나 인클로저를 포함하는 안테나, 상기 안테나와 인접 배치된 스피커로 서, 스피커 유닛, 및 상기 스피커 유닛을 수용하고 제2 안테나 패턴이 형성된 스피커 인클로저를 포함하는 스피 커, 및 상기 안테나 인클로저와 상기 스피커 인클로저를 연결하고, 상기 제1 안테나 패턴과 상기 제2 안테나 패 턴을 전기적으로 연결하는 전도성 부분을 포함하는 연결 부재를 포함할 수 있다."}
{"patent_id": "10-2023-0177922", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서에 개시된 실시예들에 따른 전자 장치는 일 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한정하려는 것이 아니며, 해당 실시예의 일 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명 사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요 소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 일 실시예에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 일 실시예는 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어(예: 프로그램 )로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서)는, 저장 매 체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기 기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드 를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포 함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으 로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 일 실시예에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 일 실시예에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프 로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 일 실시예에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수 행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이 상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 1은 본 문서에 개시되는 일 실시예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하 여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입 력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 일 실시예에서, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있 다. 일 실시예에서, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈) 은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 일 데이터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 일 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련된 명 령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀 영역로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또 는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 일 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테 나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 일 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 일 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 일 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또 는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 일 실시예에 있어서, 외부의 전 자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이 용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 본 개시의 일 실시예들에 따른, 펼쳐진 상태의 전자 장치의 사시도이다. 도 3은 본 개시의 일 실시예들 에 따른, 접힌 상태의 전자 장치의 사시도이다. 도 2 및 도 3을 참조하면, 전자 장치는 하우징, 및 디스플레이를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 랩톱 컴퓨터, 노트북 컴퓨터 또는 휴대 단말기일 수 있다. 도 2 및 도 3의 전자 장치 의 구성은 도 1의 전자 장치의 구성과 전부 또는 일부가 동일할 수 있다. 일 실시예에 따르면, 하우징은, 전자 장치의 외관의 적어도 일부를 형성하거나, 전자 장치의 부 품(예: 디스플레이)을 지지할 수 있다. 예를 들어, 하우징은 디스플레이, 입력 장치, 또는 터치 패드 중 적어도 하나를 수용할 수 있다. 일 실시예에 따르면, 전자 장치는 개방 또는 폐쇄될 수 있다. 예를 들어, 하우징은 제1 하우징 및 제1 하우징에 대하여 회전 가능하도록 구성된 제2 하우징을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 제1 하우징 및 제2 하우징과 연결된 적어도 하나의 힌지 모듈을 포함할 수 있 다. 일 실시예에 따르면, 제1 하우징은 힌지 모듈을 이용하여 제2 하우징에 대하여 지정된 각도 범 위(예: 0 도 내지 360도)로 회전하도록 구성될 수 있다. 예를 들어, 전자 장치는 제1 상태(예: 도 2)(클램셀(clamshell) 모드)로 동작될 수 있다. 상기 제1 상태에서, 제1 하우징의 제1 전면(210a)과 제2 하우징 의 제2 전면(220a)사이의 각도는 약 90도 내지 130도 일 수 있다. 일 실시예에 따르면, 전자 장치는 제2 상태(예: 도 3)(타블렛(tablet) 모드)로 동작될 수 있다. 상기 제2 상태에서, 제1 하우징과 제2 하우 징 사이의 각도는 약 360도 일 수 있다. 일 실시예에 따르면, 제1 하우징의 제2 하우징에 대한 회전은, 제2 하우징의 제1 하우징에 대한 회전으로 해석될 수 있다. 일 실시예에 따르면, 하우징은 선택된 크기의 강성을 갖는 금속 재질이나 비금속 재질로 형성될 수 있다. 일 실시예에 따르면, 상기 금속 재질로 형성된 전자 장치의 적어도 일부분은 그라운드 면(ground plane)을 제공할 수 있으며, 인쇄 회로 기판(미도시)에 형성된 그라운드 라인과 전기적으로 연결될 수 있다. 예를 들어, 하우징은 용량성(capacitive) 부품을 통해, 상기 인쇄 회로 기판과 전기적으로 연결될 수 있다. 일 실시예에 따르면, 디스플레이는 적어도 일부 영역이 평면 및/또는 곡면으로 변형될 수 있는 플렉서블 디스플레이일 수 있다. 예를 들어, 디스플레이는 폴더블(foldable) 또는 롤러블(rollable) 디스플레이일 수 있다. 상기 디스플레이의 구성은 도 1의 디스플레이 모듈의 구성과 전부 또는 일부가 동일할 수 있다. 일 실시예에 따르면, 디스플레이는 제2 하우징에 수용될 수 있다. 예를 들어, 디스플레이(20 4)의 적어도 일부는 제2 하우징 내에 배치될 수 있다. 일 실시예에 따르면, 디스플레이의 적어도 일 부는 전자 장치의 외부로 시각적으로 노출될 수 있다. 일 실시예에 따르면, 제2 하우징은 디스플레이 부로 해석될 수 있다. 일 실시예에 따르면 디스플레이는, 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/ 또는 자기장 방식의 스타일러스 펜을 검출하도록 구성된 디지타이저와 결합되거나 인접하여 배치될 수 있다. 일 실시예에 따르면, 전자 장치는 사용자 입력(예: 압력)을 감지할 수 있는 입력 장치를 포함할 수 있다. 일 실시예에 따르면, 입력 장치는 제1 하우징에 수용될 수 있다. 예를 들어, 입력 장치는 제1 하우징 상에 배치될 수 있다. 일 실시예에 따르면, 전자 장치가 폐쇄된 상태에서, 입력 장치 의 적어도 일부는 디스플레이의 적어도 일부와 대면할 수 있다. 도 2의 입력 장치의 구성은 도 1의 입력 모듈의 구성과 전부 또는 일부가 동일할 수 있다. 예를 들어, 입력 장치는 키보드일 수 있 다. 일 실시예에 따르면, 제1 하우징은 본체부로 해석될 수 있다. 일 실시예에 따르면, 전자 장치는 사용자 입력을 감지 또는 수신하도록 설정된 터치 패드를 포함할 수 있다. 일 실시예에 따르면, 터치 패드는 용량성 터치 센서, 저항성 감지에 기초한 터치 센서, 광 터치 센서 또는 표면 음파 터치 센서를 포함할 수 있다. 예를 들어, 터치 패드는 사용자가 터치 패드에 가 하는 입력으로 인한 전류, 압력, 광, 및/또는 진동을 감지하고, 프로세서(예: 도 1의 프로세서) 및/또는 터치 패드는 감지된 전류, 압력, 광, 및/또는 진동의 변화에 기초하여, 사용자 입력을 판단할 수 있다. 일 실시예에 따르면, 터치 패드는 터치 디스플레이를 포함할 수 있다. 예를 들어, 터치 패드는 감압식 터치 스크린, 정전식 터치 스크린 및/또는 적외선식 터치 스크린을 포함할 수 있다. 일 실시예에 따르면, 상기 프로세서(예: 도 1의 프로세서) 및/또는 터치 패드는 사용자의 입력 위치 (예: XY 좌표)를 판단할 수 있다. 일 실시예에 따르면, 터치 패드는 터치 패드에 대한 압력을 감지할 수 있다. 예를 들어, 터치 패드는 스위치 부재(미도시) 및 적어도 하나의 힘 센서(미도시)를 이용하여, 두 께 방향(예: Z축 방향)의 힘을 감지할 수 있다. 일 실시예에 따르면, 터치 패드는 외부 객체(예: 사용자의 손가락 또는 스타일러스)가 터치 패드의 표면과 직접 접촉하거나 근접한 경우, 외부 객체를 감지할 수 있 다. 일 실시예에 따르면, 터치 패드는 제1 하우징에 수용될 수 있다. 예를 들어, 터치 패드는 제1 하우징에 연결되고, 적어도 일부가 제1 하우징의 외부로 노출될 수 있다. 일 실시예에 따르면, 터치 패드는 입력 장치와 인접할 수 있다. 일 실시예에 따르면, 전자 장치(20 0)가 폐쇄된 상태에서, 터치 패드의 적어도 일부는 디스플레이와 대면할 수 있다. 상기 터치 패드 의 구성은 도 1의 입력 모듈의 구성과 전부 또는 일부가 동일할 수 있다. 도 4는 본 개시의 일 실시예들에 따른, 하우징 내에 배치된 스피커 및 안테나를 나타낸 정면도 이다. 도 5는 본 개시의 일 실시예들에 따른, 하우징 내에 배치된 스피커 및 안테나를 나타낸 분해 사시도이다.도 4 및 도 5를 참조하면, 일 실시예에 따른 전자 장치(예: 도 2 및 도3의 전자 장치)는 하우징, 인 쇄 회로 기판, 안테나, 스피커, 및 배터리를 포함할 수 있다. 도 4 및 도 5의 하우징 의 구성은 도 2 및 도 3의 하우징의 구성과 전부 또는 일부와 동일할 수 있다. 도 4 및 도 5의 실시 예는 도 2 및 도 3의 실시예와 부분적으로 결합할 수 있다. 일 실시예에 따르면, 하우징은 도2 및 도 3의 제1 하우징과 전부 또는 일부가 동일할 수 있다. 일 실 시예에 따르면, 전자 장치의 심미성, 및 전자 장치가 접힌 상태에서의 두께를 줄이기 위하여 하우징 은 적어도 일부가 금속 재질로 형성될 수 있다. 일 실시예에 따르면, 하우징은 측면의 적어도 일부를 따라 분절된 적어도 하나 이상의 도전성 부분(301a) 을 포함할 수 있다. 예를 들어, 도전성 부분(301a)은, 하우징의 금속 재질로 형성된 프레임일 수 있으며, 안테나의 방사체로 활용할 수 있다. 일 실시예에서, 도전성 부분(301a)이 안테나의 방사체로 활용되기 위해, 도 전성 부분(301a)의 일단은 분절될 수 있다. 다만, 분절 부분은 하나의 예시에 해당하며, 안테나의 주파수 활용 범위에 따라 분절 부분은 다양하게 설계 변경할 수 있다. 일 실시예에 따르면, 전자 장치는 안테나를 더 포함할 수 있으며, 안테나의 적어도 일 구성요소 (예: 도전성 부분(301a))는 하우징의 일 영역에 위치할 수 있다. 일 실시예에 따르면, 안테나는 하우징 내에 위치할 수 있다. 예를 들어, 안테나는 하우징 의 가장자리에 인접 배치될 수 있다. 안테나는 하우징의 일측면과 대면하도록 배치될 수 있다. 안테 나는 하우징의 일측면에 인접 배치될 수 있다. 일 실시예에 따르면, 안테나는 스피커와 인접 배치될 수 있다. 예를 들어, 안테나는 스피커 의 상측 방향(+Y측 방향)에 배치될 수 있다. 일 실시예에 따르면, 안테나는 배터리의 측면에 배 치될 수 있다. 예를 들어, 배터리의 좌측 방향(-X축 방향)에 배치될 수 있다. 일 실시예에 따르면, 스피커는 하우징 내에 위치할 수 있다. 스피커는 하우징의 가장자리 에 인접 배치될 수 있다. 예를 들어, 스피커는 하우징의 일측면과 대면하도록 배치될 수 있다. 스피 커는 하우징의 일측면에 인접 배치될 수 있다. 일 실시예에 따르면, 스피커는 안테나와 인접 배치될 수 있다. 예를 들어, 스피커는 안테나 의 하측 방향(-Y측 방향)에 배치될 수 있다. 일 실시예에 따르면, 스피커는 배터리의 측면에 배 치될 수 있다. 예를 들어, 배터리의 좌측 방향(-X축 방향)에 배치될 수 있다. 일 실시예에 따르면, 스피커는 진동을 통한 노이즈 방지(또는 노이즈 감소) 및 다른 부품들과의 마찰 방지 (또는 마찰 감소)를 위해 하우징, 및 하우징 내의 다른 부품들(예: 안테나, 배터리)과 일 정한 간격으로 이격 배치될 수 있다. 일 실시예에 따르면, 인쇄 회로 기판은 안테나 및/또는 스피커와 전기적으로 연결될 수 있다. 도 6은 본 개시의 일 실시예들에 따른, 안테나를 나타낸 도면이다. 도 6을 참조하면, 일 실시예에 따른 안테나는 안테나 인클로저, 제1 안테나 패턴, 및 안테나 케 이블을 포함할 수 있다. 도 6의 안테나의 구성은 도 4 및 도 5의 안테나의 구성과 전부 또는 일 부와 동일할 수 있다. 도 6의 실시예는 도 4 및 도 5의 실시예와 부분적으로 결합할 수 있다. 일 실시예에 따르면, 안테나는 안테나 인클로저, 제1 안테나 패턴, 및 안테나 케이블을 포 함할 수 있다. 일 실시예에 따르면, 안테나 인클로저는 안테나의 외면의 적어도 일부를 형성할 수 있다. 안테나 인클로저는 안테나의 내부 구성요소들을 둘러싸거나 에워쌀 수 있다. 일 실시예에 따르면, 안테나 인 클로저는 전면 방향(+Z 방향)을 향하는 제1 면(311a), 및 제1 면(311a)과 수직으로 연결되고 스피커 의 일면과 대면하도록 배치된 제2 면(311b)을 포함할 수 있다. 예를 들어, 제1 면(311a)은 좌측 방향(-X측 방향)의 일부분, 및 우측 방향(+X축 방향)의 다른 일부분의 Y축 방향의 길이가 상이할 수 있다. 예를 들어, 제1 면(311a)은 상측 방향(+Y축 방향)의 일부분, 및 하측 방향(-Y축 방향)의 다른 일부분의 X축 방향의 길이가 상이 할 수 있다. 예를 들어, 제1 면(311a)은 대략'ㄱ'자 형상일 수 있다. 일 실시예에 따르면, 제2 면(311b)은 1개 또는 복수 개일 수 있다. 예를 들어, 제2 면(311b)은 X축과 평행한 제 2-1 면, 제2-1 면과 수직으로 연결되고 Y축과 평행한 제2-2 면, 제2-2 면과 수직으로 연결되고 X축과 평행한 제2-3 면으로 구성될 수 있다. 다만, 안테나 인클로저의 형상은 상기 실시예 에 제한되지 않으며, 다양하게 설계 변경될 수 있다. 일 실시예에 따르면, 제2 면(311b)은 연결 부재(예: 도 10의 연결 부재)의 적어도 하나의 제3 영역(예: 도 10의 제3 영역)이 관통하도록 구성된 적어도 하나의 제1 홀을 포함할 수 있다. 예를 들어, 연결 부재 (예: 도 10의 연결 부재)의 적어도 하나의 제3 영역(예: 도 10의 제3 영역)이 관통하도록 구성된 3개 의 제1 홀을 포함할 수 있다. 예를 들어, 제2-1 면, 제2-2 면, 제2-3 면은 각각 한 개 의 제1 홀을 포함할 수 있다. 다만, 홀의 개수, 및 위치는 상기 실시예에 제한되지 않으며, 다양하게 설계 변경할 수 있다. 일 실시예에 따르면, 안테나 인클로저의 표면에는 제1 안테나 패턴이 형성될 수 있다. 제1 안테나 패 턴은 안테나 인클로저의 표면의 적어도 일부에 형성될 수 있다. 예를 들어, 제1 안테나 패턴은 제1 면(311a) 및/또는 제2 면(311b)에 형성될 수 있다. 예를 들어, 제1 안테나 패턴은 제2 면(311b)에 형 성된 제1 홀의 내측 방향을 향하고, 상기 제2 면(311b)과 수직으로 배치된 제3 면(예: 도 14의 제3 면 (311c))에도 형성될 수 있다. 일 실시예에 따르면, 안테나 인클로저는 상측 방향에 위치한 제1 안테나 인클로저, 및 제1 안테나 인클로 저와 결합되고 하측 방향에 위치한 제2 안테나 인클로저를 포함할 수 있다. 일 실시예에 따르면, 안테나 인클로 저는 일체로 형성될 수 있다. 안테나 인클로저의 구성은 상기 실시예에 의해 제한되지 않으며, 다양 하게 설계 변경 가능하다. 일 실시예에 따르면, 안테나 케이블은 제1 안테나 패턴, 및 인쇄 회로 기판(예: 도 4의 인쇄 회로 기 판을 연결할 수 있다. 일 실시예에 따르면, 안테나 인클로저는 안테나 케이블이 관통하도록 구 성된 제2 개구를 포함할 수 있다. 일 실시예에 따르면, 안테나 케이블은 안테나 인클로저에 형 성된 제2 개구를 관통하도록 형성될 수 있다. 예를 들어, 안테나 케이블은 제2 개구를 기준으로 일부가 안테나 인클로저 내부에 배치되고, 나머지 일부는 안테나 인클로저 외부에 배치될 수 있다. 일 실시예에 따르면, 안테나 인클로저는 스피커 케이블이 관통하도록 구성된 제3 개구를 포함할 수 있다. 일 실시예에 따르면, 제2 개구와 제3 개구는 서로 이격되어 배치될 수 있다. 일 실시예에 따르면, 제2 개구를 관통하도록 구성된 안테나 케이블과 제3 개구를 관통하도록 구성된 스피커 케이블은 서로 중첩되지 않을 수 있다. 일 실시예에 따르면, 안테나는 GND 연결(contact) 부재(미도시)를 추가하여 무선 성능을 안정적으로 구현 할 수 있다. 도 7 및 도 8은 본 개시의 일 실시예들에 따른, 스피커를 나타낸 도면이다. 도 9는 본 개시의 일 실시예들 에 따른, 도 8의 스피커의 단면을 나타낸 도면이다. 도 7 내지 도 9를 참조하면, 일 실시예에 따른 스피커는 스피커 유닛, 스피커 인클로저, 제2 안 테나 패턴, 스피커 케이블, 공명 공간, 및 음향 홀을 포함할 수 있다. 도 7 내지 도 9의 스피커의 구성은 도 4 및 도 5의 스피커의 구성과 전부 또는 일부와 동일할 수 있다. 도 7 내지 도 9 의 실시예는 도 4 및 도 5의 실시예와 부분적으로 결합할 수 있다. 일 실시예에 따르면, 스피커 유닛은 전기적 신호에 기초하여 소리를 발생시키도록 구성될 수 있다. 일 실 시예에 따르면, 스피커 유닛은 전기 신호를 소리로 변환할 수 있다. 일 실시예에 따르면, 스피커 유닛 은 펄스 폭 변조(pulse width modulation, PWM)에 기초하여 진동판을 진동시키도록 구성된 코일(예: 보이 스 코일(voice coil))(미도시), 진동하도록 구성된 진동판(예: diaphragm), 전도성 재질로 형성되고, 음향 모듈 의 외부에서 전해진 신호(예: 전력)를 코일로 전달하기 위한 댐핑 부재(예: 스프링)(미도시), 자석(미도시), 또 는 자석에서 생성된 자기장을 집중시키기 위한 도전성의 플레이트(미도시) 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 스피커 유닛은 외부 앰프(amp)와 연결될 수 있다. 스피커 유닛은 진동판의 물리 적 상하운동, 및 음파의 떨림에 의해 진동이 발생할 수 있다. 일 실시예에 따르면, 스피커 인클로저는 스피커의 외면의 적어도 일부를 형성할 수 있다. 예를 들어, 스피커 인클로저는 스피커 유닛을 수용할 수 있다. 스피커 인클로저는 스피커의 내부 구성 요소들을 둘러싸거나 에워쌀 수 있다. 일 실시예에 따르면, 스피커 인클로저는 진동판을 보호하기 위한 보 호 커버(미도시), 스피커 유닛의 부품(예: 자석)을 보호하기 위한 요크(yoke), 또는 스피커 유닛에서 생성된 진동을 전자 장치의 외부로 전달하기 위한 음향 홀을 더 포함하는 구성일 수 있다. 예를 들어, 스 피커 인클로저는 스피커 유닛을 감싸고 있는 하우징 또는 케이싱을 의미할 수 있다. 일 실시예에 따르면, 스피커 인클로저는 전면 방향(+Z 방향)을 향하는 제4 면(예: 도 14의 제4 면(321a)), 및 제4 면(321a)과 수직으로 연결되고 스피커의 일면과 대면하도록 배치된 제5 면(예: 도 14의 제5 면 (321b))을 포함할 수 있다. 예를 들어, 제4 면(321a)은 좌측 방향(-X측 방향)의 일부분, 및 우측 방향(+X축 방 향)의 다른 일부분의 Y축 방향의 길이가 상이할 수 있다. 예를 들어, 제4 면(321a)은 상측 방향(+Y축 방향)의 일부분, 및 하측 방향(-Y축 방향)의 다른 일부분의 X축 방향의 길이가 상이할 수 있다. 예를 들어, 제4 면 (321a)은 대략'ㄱ'자 형상일 수 있다. 예를 들어, 제5 면(321b)은 1개 또는 복수 개일 수 있다. 예를 들어, 제5 면(321b)은 X축과 평행하고, 안테나의 제2-1 면(예: 도 12의 3111)과 대면하는 제5-1 면(예: 도 12의 3211), 제5-1 면(예: 도 12의 3211)과 수직으로 연결되고 Y축과 평행하고 안테나의 제2-2 면(예: 도 12의 3112)과 대면하는 제5-2 면(예: 도 12의 3212), 제5-2 면(예: 도 12의 3212)과 수직으로 연결되고 X축과 평행 하고, 안테나의 제2-3 면(예: 도 12의 3113)과 대면하는 제5-3 면(예: 도 12의 3213)으로 구성될 수 있다. 다만, 스피커 인클로저의 형상은 상기 실시예에 제한되지 않으며, 다양하게 설계 변경될 수 있다. 일 실시예에 따르면, 제5 면(321b)은 연결 부재의 적어도 하나의 제3 영역(예: 도 10의 333)이 관통하도록 구성된 적어도 하나의 제2 홀(예: 도 12의 329)을 포함할 수 있다. 예를 들어, 적어도 하나의 제3 영역이 관통하도록 구성된 3개의 제2 홀을 포함할 수 있다. 예를 들어, 제5-1 면(예: 도 12의 3211), 제5-2 면(예: 도 12의 3212), 제5-3 면(예: 도 12의 3213)은 각각 한 개의 제2 홀(예: 도 12의 329)을 포함할 수 있 다. 다만, 홀의 개수, 및 위치는 상기 실시예에 제한되지 않으며, 다양하게 설계 변경할 수 있다. 일 실시예에 따르면, 스피커 인클로저의 표면에는 제2 안테나 패턴이 형성될 수 있다. 제2 안테나 패 턴은 스피커 인클로저의 표면의 적어도 일부에 형성될 수 있다. 예를 들어, 제2 안테나 패턴은 제4 면(321a) 및/또는 제5 면(321b)에 형성될 수 있다. 예를 들어, 제2 안테나 패턴은 제5 면(321b)에 형 성된 제2 홀의 내측 방향을 향하고, 상기 제5 면(321b)과 수직으로 배치된 제6 면(예: 도 14의 321c)에도 형성될 수 있다. 스피커 인클로저의 표면에 제2 안테나 패턴을 형성하여 광대역 안테나 성능을 향상시킬 수 있다. 일 실시예에 따르면, 스피커 인클로저는 상측 방향에 위치한 제1 스피커 인클로저 및 제1 스피커 인클로저 와 결합되고 하측 방향에 위치한 제2 스피커 인클로저를 포함할 수 있다. 일 실시예에 따르면, 스피커 인클로저 는 일체로 형성될 수 있다. 스피커 인클로저의 구성은 상기 실시예에 의해 제한되지 않으며, 다양하 게 설계 변경 가능하다. 일 실시예에 따르면, 스피커 케이블은 스피커 유닛, 및 인쇄 회로 기판을 연결할 수 있다. 스피 커 인클로저는 스피커 케이블이 관통하도록 구성된 제1 개구를 포함할 수 있다. 스피커 케이블 은 스피커 인클로저에 형성된 제1 개구를 관통하도록 형성될 수 있다. 예를 들어, 스피커 케이 블은 제1 개구를 기준으로 일부가 스피커 인클로저 내부에 배치되고, 나머지 일부는 스피커 인 클로저 외부에 배치될 수 있다. 일 실시예에 따르면, 일 실시예에 따르면, 스피커 인클로저의 적어도 일부는 스피커 유닛에서 발생하 는 소리의 적어도 일부를 축적하기 위한 울림통으로 사용될 수 있다. 일 실시예에 따르면, 스피커는 스피 커 인클로저 내부에 형성된 공명 공간을 포함할 수 있다. 일 실시예에 따르면, 공명 공간은 스 피커 인클로저 내부에서 스피커 인클로저의 내면 및 스피커 유닛에 의해 둘러싸인 공간일 수 있 다. 일 실시예에 따르면, 공명 공간은 스피커 인클로저 내부의 빈 공간이며, 빈 공간에서 소리의 공 명이 발생될 수 있다. 스피커 유닛에서 생성된 진동의 적어도 일부의 진폭은 공명 공간에서 증대될 수 있다. 일 실시예에 따르면, 공명 공간은 스피커 유닛의 진동판이 원활히 구동하여 소리를 방사하 기 위한 최소한의 물리적 필수 공간일 수 있다. 공명 공간의 크기가 충분히 확보되어야 중저역대역의 음압 및 음질을 적절히 구현할 수 있다. 일 실시예에 따르면, 공명 공간은 스피커 인클로저, 및 스피커 유닛으로 둘러쌓일 수 있다. 공 명 공간은 스피커 인클로저의 외부와 단절될 수 있다. 본 개시에 따른 일 실시예는 안테나의 크 기를 줄이는 대신 스피커의 공명 공간의 크기를 확장시킬 수 있다. 공명 공간의 크기가 확장되는 경우, 스피커의 저역부의 음압이 증가하고, 스피커의 음질 및 성능이 향상될 수 있다. 일 실시예에 따르면, 음향 홀은 상기 스피커 인클로저에 형성될 수 있다. 음향 홀은 상기 스피 커 유닛에서 발생한 소리를 방사하도록 구성될 수 있다. 도 10은 본 개시의 일 실시예들에 따른, 연결 부재를 나타낸 도면이다. 도 11 및 도 12는 본 개시의 일 실 시예들에 따른, 연결 부재, 및 연결 부재와 연결된 스피커, 안테나를 나타낸 도면이다. 도 13 및 도 14는 본 개시의 일 실시예들에 따른, 연결 부재, 및 연결 부재와 연결된 스피커, 안테 나의 단면을 나타낸 도면이다. 도 10 내지 도 14를 참조하면, 일 실시예에 따른 전자 장치는 스피커, 안테나, 및 연결 부재를 포함할 수 있다. 도 10 내지 도 14의 스피커, 및 안테나의 구성은 도 4 내지 도 9의 스피커, 및 안테나의 구성과 전부 또는 일부와 동일할 수 있다. 도 10 내지 도 14의 실시예는 도 4 내지 도 9의 실시 예와 부분적으로 결합할 수 있다. 일 실시예에 따르면, 연결 부재는 안테나와 스피커를 물리적으로 연결할 수 있다. 예를 들어, 연결 부재는 안테나 인클로저와 스피커 인클로저를 연결할 수 있다. 일 실시예에 따르면, 연결 부재는 스피커 및/또는 안테나의 위치를 고정 할 뿐만 아니라, 스피커의 진동이 주변 부품 들로 전달되는 것을 방지 또는 감소시킬 수 있다. 일 실시예에 따르면, 연결 부재는 제1 안테나 패턴과 제2 안테나 패턴을 전기적으로 연결하는 전도성 부분을 더 포함할 수 있다. 일 실시예에 따르면, 전도성 부분은 연결 부재의 전부 또는 일부를 구성할 수 있다. 예를 들어, 전도성 부분은 연결 부재의 전부 또는 일부에 형성될 수 있다. 일 실시예에 따르면, 연결 부재의 전도성 부분에 LDS Spray와 같은 표면 전도성 처리(예: 도금 처 리)를 할 수 있다. 예를 들어, 연결 부재는 금속과 같은 전도성 재질을 포함할 수 있다. 일 실시예에 따르 면, 전도성 부분은 도전성 섬유(예: 도전성 가스켓) 및/또는 도전성 테이프를 포함할 수 있다. 일 실시예 에 따르면, 연결 부재는 제1 안테나 패턴뿐 아니라 스피커 인클로저의 표면에 형성된 제2 안테 나 패턴을 연결하여 광대역 안테나 성능을 향상시킬 수 있다. 일 실시예에 따르면, 연결 부재는 유연한 소재를 포함할 수 있다. 예를 들어, 연결 부재는 실리콘 및 고무 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 연결 부재는 도전성 실리콘을 포함할 수 있 다. 예를 들어, 연결 부재는 탄소(carbon)를 포함할 수 있다. 일 실시예에 따르면, 연결 부재는 안테나 내에 위치한 제1 영역, 상기 스피커 내에 위치한 제2 영역, 및 상기 제1 영역과 상기 제2 영역을 연결하는 제3 영역을 포함할 수 있다. 일 실시예에 따르면, 제1 영역은 안테나 인클로저의 제2 면(311b)과 인접 배치될 수 있다. 제1 영역 은 제2 면(311b)의 적어도 일부와 접할 수 있다. 제1 영역의 형상 및/또는 구조는 안테나 인클로저 의 제2 면(311b)의 형상 및/또는 구조와 실질적으로 유사할 수 있다. 일 실시예에 따르면, 제2 영역은 스피커 인클로저의 제5 면(321b)과 인접 배치될 수 있다. 제2 영역 은 제5 면(321b)의 적어도 일부와 접할 수 있다. 제2 영역의 형상 및/또는 구조는 스피커 인클로저 의 제5 면(321b)의 형상 및/또는 구조와 실질적으로 유사할 수 있다. 일 실시예에 따르면, 제3 영역(33 3)은 제1 영역, 및 제2 영역과 수직으로 배치될 수 있다. 일 실시예에 따르면, 제3 영역은 제1 영역의 제2 면(311b)에 형성된 제1 홀을 관통하여 제1 영 역과 연결되고, 제2 영역의 제5 면(321b)에 형성된 제2 홀을 관통하여 제2 영역과 연결될 수 있다. 일 실시예에 따르면, 제3 영역은 적어도 하나 또는 복수 개로 구성될 수 있다. 예를 들어, 제3 영역 은 3개일 수 있다. 일 실시예에 따르면 제3 영역은 제3-1 영역(333a), 제3-2 영역(333b) 및 제3-3 영역 (333c)를 포함할 수 있다. 제3-1 영역(333a), 제3-2 영역(333b) 및 제3-3 영역(333c)은 서로 수직 방향으로 배 치되거나 평행하게 배치될 수 있다. 예를 들어, 제3-1 영역(333a), 제3-2 영역(333b) 및/또는 제3-3 영역(333c) X축 방향 또는 Y축 방향으로 연장 형성되어 제1 영역의 제2 면(311b)과 제2 영역의 제5 면(321b)을 연결할 수 있다. 일 실시예에 따르면, 제3 영역은 제1 안테나 패턴의 적어도 일부, 및 제2 안테나 패턴의 적어도 일부와 중첩할 수 있다. 예를 들어, 제3 영역은 제1 홀의 내측면인 제3 면(311c)에 형성된 제1 안테 나 패턴과 중첩 배치될 수 있다. 예를 들어, 제3 영역은 제2 홀의 내측면인 제6 면(321c)에 형 성된 제2 안테나 패턴과 중첩 배치될 수 있다. 일 실시예에 따르면, 제3 영역은 유연한 소재를 포함할 수 있다. 예를 들어, 제3 영역은 실리콘 및 고무 중 적어도 하나를 포함할 수 있다. 예를 들어, 제3 영역의 경도는 대략 40도 이상일 수 있다. 예를 들어, 제3 영역의 경도는 대략 50도 이상일 수 있다. 제3 영역은 유연한 소재를 포함함으로서 스피커 의 방진 기능을 강화시킬 수 있다. 또한, 스피커의 무게 중심을 맞출 수 있을 뿐만 아니라, 스피커 케이블의 조립 편차로 스피커의 위치가 틀어지는 것을 방지 또는 감소시킬 수 있다. 일 실시예에 따 르면, 스피커와 안테나를 연결 부재를 매개체로 일체형 부품으로 단일화 할 수 있다. 이는 생산 공정에서 조립성이 개선되고, 비용이 절감될 수 있다. 도 15는 본 개시의 일 실시예들에 따른, 솔더 부재를 포함하는 연결 부재를 나타낸 도면이다. 도 15를 참조하면, 일 실시예에 따른 전자 장치는 스피커, 안테나, 및 연결 부재를 포함할 수 있다. 도 15의 스피커, 및 안테나의 구성은 도 4 내지 도 14의 스피커, 및 안테나의 구성 과 전부 또는 일부와 동일할 수 있다. 도 15의 실시예는 도 4 내지 도 14의 실시예와 부분적으로 결합할 수 있 다. 일 실시예에 따르면, 연결 부재는 제1 안테나 패턴과 상기 제1 영역을 연결하는 제1 솔더 부재 (334a), 및 상기 제2 안테나 패턴과 상기 제2 영역을 연결하는 제2 솔더 부재(334b)를 더 포함할 수 있다. 일 실시예에 따르면, 제1 솔더 부재(334a)는 제1 영역 및 안테나 인클로저와 접할 수 있다. 제 2 솔더 부재(334b)는 제2 영역 및 스피커 인클로저와 접할 수 있다. 일 실시예에 따르면, 솔더 부재 (예: 제1 솔더 부재(334a), 제2 솔더 부재(334b))에 의해 제1 안테나 패턴과 제2 안테나 패턴을 전기 적으로 연결시킬 수 있다. 도 16 및 도 17은 본 개시의 일 실시예들에 따른, 제1 고정 부재, 및 제2 고정 부재를 포함하는 전자 장치 를 나타낸 도면이다. 도 16 및 도 17을 참조하면, 일 실시예에 따른 전자 장치는 스피커, 안테나, 및 연결 부재를 포 함할 수 있다. 도 16 및 도 17의 스피커, 및 안테나의 구성은 도 4 내지 도 15의 스피커, 및 안 테나의 구성과 전부 또는 일부와 동일할 수 있다. 도 16 및 도 17의 실시예는 도 4 내지 도 15의 실시예와 부분적으로 결합할 수 있다. 일 실시예에 따르면, 상기 안테나는 제1 고정 부재(미도시)에 의해 상기 하우징에 고정될 수 있다. 예를 들어, 제1 고정 부재는 테이프, 후크, 스크류 중 어느 하나를 포함할 수 있다. 다만, 제1 고정 부재의 종 류 및 형상은 상기 실시예에 의해 제한되지 않으며, 다양하게 설계 변경될 수 있다. 일 실시예에 따르면, 스피커는 제2 고정 부재에 의해 상기 하우징에 고정될 수 있다. 예를 들어, 제2 고정 부재는 실리콘 및 고무(rubber) 중 적어도 하나를 포함할 수 있다. 스피커는 제2 고 정 부재을 방진 부재로 사용하여 고정 및 조립하여 스피커의 진동이 기구로 전달되는 것을 방지 또는 감소시킬 수 있다. 일 실시예에 따르면, 하우징은 돌출 부분를 포함할 수 있다. 돌출 부분는 제2 고정 부재과 대응되는 위치에 형성되고, 제2 고정 부재와 결합이 용이한 형태일 수 있다. 예를 들어, 제2 고정 부재 는 후크 형상일 수 있다. 하우징의 돌출 부분의 후크 사이에 제2 고정 부재를 끼워 넣어 고정시킬 수 있다. 도 18은 본 개시의 일 실시예들에 따른, 스피커 케이블과 안테나 케이블을 포함하는 전자 장치의 일 부를 나타낸 도면이다. 도 19는 본 개시의 일 실시예들에 따른, 스피커 케이블과 안테나 케이블을 확 대하여 나타낸 도면이다. 도 20은 본 개시의 일 실시예들에 따른, 스피커 케이블을 포함하는 스피커및 안테나를 나타낸 도면이다. 도 18 내지 도 20을 참조하면, 일 실시예에 따른 전자 장치는 스피커, 안테나, 및 연결 부재를 포함할 수 있다. 도 18 내지 도 20의 스피커, 및 안테나의 구성은 도 4 내지 도 17의 스피커, 및 안테나의 구성과 전부 또는 일부와 동일할 수 있다. 도 18 내지 도 20의 실시예는 도 4 내지 도 17의 실시예와 부분적으로 결합할 수 있다. 일 실시예에 따르면, 상기 안테나 케이블과 상기 스피커 케이블은 중첩되지 않도록 배치하여 안테나 성능을 향상시킬 수 있다. 일 실시예에 따르면, 상기 스피커 인클로저는 상기 스피커 케이블이 관통하도록 구성된 제1 개구 를 더 포함할 수 있다. 일 실시예에 따르면, 상기 안테나 인클로저는 상기 안테나 케이블이 관통하도록 구성된 제2 개구 , 및 상기 스피커 케이블이 관통하도록 구성되고 상기 제2 개구와 이격 배치된 제3 개구를 더 포함할 수 있다. 예를 들어, 제2 개구와 제3 개구는 +Z축 방향으로 이격되어 배치될 수 있다. 일 실시예에 따르면, 스피커 케이블이 안테나 인클로저에 의해 이중으로 고정됨으로써, 스피커 인클 로저가 스피커 케이블의 유동에 의해 움직이는 것을 방지 또는 감소시킬 수 있다. 일 실시예에 따르면, 스피커 케이블은 스피커 유닛 내에 배치된 진동계 구동을 위한 자석(magnet)과 일부 필요에 따라 음반사 영역인 메탈 부재(metal sheet)와 중첩되지 않도록 배치할 수 있다. 안테나 성능 저하를 방지 또는 감소시키기 위함일 수 있다. 일 실시예에 따르면, 스피커 케이블은 스피커 인클로저 내부에 위치하고 스피커 유닛과 연결된 내부 케이블링(cabling) 영역과 중첩되지 않도록 배치할 수 있다. 스피커 케이블 내부의 구리선이 금속(예: metal) 성분과 같은 영향을 주어 스피커 케이블이 피 딩 및/또는 매칭과 같은 안테나의 주요 구조를 지날 경우 성능 저하 및 편차 발생의 원인이 될 수 있다. 본 개시의 일 실시예에 따른 전자 장치는, 하우징, 상기 하우징 내에 배치된 인쇄 회로 기판, 상기 하우징 내에 위치하고 제1 안테나 패턴이 형성된 안테나 인클로저를 포함하는 안테나, 상기 안테나와 인접 배치된 스피커로 서, 스피커 유닛, 및 상기 스피커 유닛을 수용하고 제2 안테나 패턴이 형성된 스피커 인클로저를 포함하는 스피 커, 및 상기 안테나 인클로저와 상기 스피커 인클로저를 연결하는 연결 부재로서, 상기 안테나 내에 위치한 제1 영역, 상기 스피커 내에 위치한 제2 영역, 및 상기 제1 영역과 상기 제2 영역을 연결하는 제3 영역을 포함 하는 연결 부재를 포함할 수 있다. 상기 연결 부재는 상기 제1 안테나 패턴과 상기 제2 안테나 패턴을 전기적으 로 연결하는 전도성 부분을 더 포함할 수 있다. 일 실시예에 따르면, 상기 제3 영역은 실리콘 또는 고무 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 안테나는 상기 제1 안테나 패턴과 상기 인쇄 회로 기판을 연결하는 안테나 케이블을 더 포함하고, 상기 스피커는 상기 스피커 유닛과 상기 인쇄 회로 기판을 연결하는 스피커 케이블을 더 포함할 수 있다. 일 실시예에 따르면, 상기 안테나 케이블과 상기 스피커 케이블은 중첩되지 않도록 배치될 수 있다. 일 실시예에 따르면, 상기 스피커 인클로저는 상기 스피커 케이블이 관통하도록 구성된 제1 개구를 더 포함하고, 상기 안테나 인클로저는 상기 안테나 케이블이 관통하도록 구성된 제2 개구, 및 상기 스피커 케이블 이 관통하도록 구성되고 상기 제2 개구와 이격 배치된 제3 개구를 더 포함할 수 있다. 일 실시예에 따르면, 상기 안테나 인클로저는 상기 스피커와 대면하는 제2 면을 포함하고, 상기 제1 영역은 상 기 제2 면의 적어도 일부와 접하고, 상기 스피커 인클로저는 상기 안테나와 대면하는 제5 면을 포함하고, 상기 제2 영역은 상기 제5 면의 적어도 일부와 접하고, 상기 제3 영역은 상기 제2 면에 형성된 제1 홀을 관통하여 상 기 제1 영역과 연결되고, 상기 제5 면에 형성된 제2 홀을 관통하여 상기 제2 영역과 연결될 수 있다. 일 실시예에 따르면, 상기 연결 부재의 상기 제3 영역은 상기 제1 안테나 패턴의 적어도 일부, 및 상기 제2 안 테나 패턴의 적어도 일부와 중첩할 수 있다. 일 실시예에 따르면, 상기 안테나는 제1 고정 부재에 의해 상기 하우징에 고정될 수 있다. 일 실시예에 따르면, 상기 제1 고정 부재는 테이프, 후크, 또는 스크류 중 어느 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 스피커는 제2 고정 부재에 의해 상기 하우징에 고정되고, 상기 제2 고정 부재는 실리 콘 또는 고무 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 스피커는, 상기 스피커 인클로저 및 상기 스피커 유닛으로 둘러싸인 공명 공간, 및 상기 스피커 인클로저에 형성되고 상기 스피커 유닛에서 발생한 소리를 방사하도록 구성된 음향 홀을 더 포함할 수 있다. 일 실시예에 따르면, 상기 안테나 인클로저의 일면은 상기 하우징의 가장자리에 인접 배치될 수 있다. 일 실시예에 따르면, 상기 하우징은 적어도 하나의 도전성 부분을 포함하고, 상기 제1 안테나 패턴은 상기 도전 성 부분과 전기적으로 연결될 수 있다. 일 실시예에 따르면, 상기 연결 부재는 상기 제1 안테나 패턴과 상기 제1 영역을 연결하는 제1 솔더 부재, 및 상기 제2 안테나 패턴과 상기 제2 영역을 연결하는 제2 솔더 부재를 더 포함할 수 있다. 일 실시예에 따르면, 상기 제3 영역의 경도는 50도 이상일 수 있다. 본 개시의 일 실시예에 따른 전자 장치는, 하우징, 상기 하우징 내에 배치된 인쇄 회로 기판, 상기 하우징 내에 위치하고 제1 안테나 패턴이 형성된 안테나 인클로저를 포함하는 안테나, 상기 안테나와 인접 배치된 스피커로 서, 스피커 유닛, 및 상기 스피커 유닛을 수용하고 제2 안테나 패턴이 형성된 스피커 인클로저를 포함하는 스피 커, 및 상기 안테나 인클로저와 상기 스피커 인클로저를 연결하고, 상기 제1 안테나 패턴과 상기 제2 안테나 패 턴을 전기적으로 연결하는 전도성 부분을 포함하는 연결 부재를 포함할 수 있다. 일 실시예에 따르면, 상기 안테나 내에 위치한 제1 영역, 상기 스피커 내에 위치한 제2 영역, 및 상기 제1 영역 과 상기 제2 영역을 연결하는 제3 영역을 포함하는 연결 부재;를 포함할 수 있다. 일 실시예에 따르면, 상기 제3 영역은 실리콘 및 고무 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 안테나는 상기 제1 안테나 패턴과 상기 인쇄 회로 기판을 연결하는 안테나 케이블을 더 포함하고, 상기 스피커는 상기 스피커 유닛과 상기 인쇄 회로 기판을 연결하고, 상기 안테나 케이블과 중첩 되지 않도록 배치된 스피커 케이블을 더 포함할 수 있다. 일 실시예에 따르면, 상기 스피커 인클로저는 상기 스피커 케이블이 관통하도록 구성된 제1 개구를 더 포함하고, 상기 안테나 인클로저는 상기 안테나 케이블이 관통하도록 구성된 제2 개구, 및 상기 스피커 케이블 이 관통하도록 구성되고 상기 제2 개구와 이격 배치된 제3 개구를 더 포함할 수 있다. 최근 기술의 발달 및 전자 장치의 경량화, 소형화에 따라 스피커 및 안테나의 배치와 적절한 성능 확 보에 필요한 최적의 공간 확보가 어려울 수 있다. 노트 PC에서와 같이 고출력 고성능 스피커를 고정 할 경 우, 스피커 구동시 발생하는 진동에 의한 주변부 기구의 떨림이 발생하여, 사용자가 노트PC에서 각종 동영 상 및 미디어 음원등 재생시 기구 소음 노이즈가 발생할 수 있다. 본 개시의 일 실시예에 따른 전자 장치는, 스피커와 안테나를 일체형으로 구현하여 스피커와 안 테나의 적절한 공간을 확보하고, 방진 구조를 구현할 수 있다. 본 발명은, Speaker와 Antenna의 일체형 구성을 통해 일체화로 인한 공간을 효율적으로 사용하여, Speaker 내부 체적 및 Antenna Pattern 영역을 증가시키고 Speaker의 방진구조를 유지함으로써, 노트PC와 같은 제품군의 진동 및 방진 소음을 감소시키고 각각의 성능을 최대한 확보 및 유지하는데 그 목적이 있다. 또한 부품을 일체형 단 일 부품으로 구성함으로써 조립 공정을 단순화하는데 그 목적이 있다. 다만, 본 개시에서 해결하고자 하는 과제는 상기 언급된 과제에 한정되는 것이 아니며, 본 개시의 사상 및 영역 으로부터 벗어나지 않는 범위에서 다양하게 확장될 수 있을 것이다."}
{"patent_id": "10-2023-0177922", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 문서에 개시되는 일 실시예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 본 개시의 일 실시예들에 따른, 펼쳐진 상태의 전자 장치의 사시도이다. 도 3은 본 개시의 일 실시예들에 따른, 접힌 상태의 전자 장치의 사시도이다. 도 4는 본 개시의 일 실시예들에 따른, 하우징 내에 배치된 스피커 및 안테나를 나타낸 정면도이다. 도 5는 본 개시의 일 실시예들에 따른, 하우징 내에 배치된 스피커 및 안테나를 나타낸 분해 사시도이다. 도 6은 본 개시의 일 실시예들에 따른, 안테나를 나타낸 도면이다. 도 7 및 도 8은 본 개시의 일 실시예들에 따른, 스피커를 나타낸 도면이다. 도 9는 본 개시의 일 실시예들에 따른, 도 8의 스피커의 단면을 나타낸 도면이다. 도 10은 본 개시의 일 실시예들에 따른, 연결 부재를 나타낸 도면이다. 도 11 및 도 12는 본 개시의 일 실시예들에 따른, 연결 부재, 및 연결 부재와 연결된 스피커, 안테나를 나타낸 도면이다. 도 13 및 도 14는 본 개시의 일 실시예들에 따른, 연결 부재, 및 연결 부재와 연결된 스피커, 안테나의 단면을 나타낸 도면이다. 도 15는 본 개시의 일 실시예들에 따른, 솔더 부재를 포함하는 연결 부재를 나타낸 도면이다. 도 16 및 도 17은 본 개시의 일 실시예들에 따른, 제1 고정 부재, 및 제2 고정 부재를 포함하는 전자 장치를 나 타낸 도면이다. 도 18은 본 개시의 일 실시예들에 따른, 스피커 케이블과 안테나 케이블을 포함하는 전자 장치의 일부를 나타낸 도면이다. 도 19는 본 개시의 일 실시예들에 따른, 스피커 케이블과 안테나 케이블을 확대하여 나타낸 도면이다. 도 20은 본 개시의 일 실시예들에 따른, 스피커 케이블을 포함하는 스피커 및 안테나를 나타낸 도면이다."}
