{"patent_id": "10-1999-7008949", "section": "특허_기본정보", "subsection": "특허정보", "content": {"출원번호": "10-1999-7008949", "출원인": "벨사우스 인텔렉츄얼 프라퍼티 코오포레이숀    에이치.씨.헨리,주니어", "발명자": "디마르코안쏘니토마스"}}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "입력과,1개의 분할기 입력과 복수 개의 분할기 출력이 있는 분할기와,각각에 증폭기 입력과 증폭기 출력이 있고 각 증폭기 입력은 적어도 1개의 분할기 출력에 접속되는 복수 개의 선형 전력 증폭기 모듈과,복수 개의 조합기 입력과 1개의 조합기 출력이 있고 각 조합기 입력이 적어도 1개의 증폭기 출력에 접속되는 조합기와,적어도 1개의 제어 기능부 입력과 적어도 1개의 제어 기능부 출력이 있는 제어 기능부를 포함한 선형 전력 증폭 시스템으로서,상기 입력은 상기 분할기 입력에 접속되고,각 제어 기능부 출력은 적어도 1개의 증폭기에 접속되고,상기 제어 기능부가 적어도 1개의 제어 출력 상에서 미리 정해진 신호를 감지하면 상기 제어 기능부가 적어도 1개의 제어 출력 상의 미리 정해진 제어 신호를 적어도 1개의 증폭기에 제공함으로써 각 증폭기 모듈의 동작 상태는 상기 제어 기능부로부터의 미리 정해진 제어 신호에 응답하는 선형 전력 증폭 시스템.16-71019997008949청구항 2 제1항에서, 상기 시스템은 상기 분할기와 각 증폭기 모듈에 접속된 제2 제어 기능부를 추가로 포함하고, 상기 제2 제어 기능부는 각 증폭기 모듈의 동작 상태를 감지하고 각 증폭기 모듈의 동작 상태에 따라서 상기 분할기를 구성하는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서, 상기 제2 제어 기능부는 상기 조합기에 접속되는 것으로서, 상기 제2 제어 기능부는 각 증폭기 모듈의 동작 상태를 감지하고 각 증폭기 모듈의 동작 상태에 따라서 상기 조합기를 구성하는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에서, 상기 제어 기능부는 각 선형 전력 증폭기 모듈과 상기 분할기에 접속되는 것으로서, 상기 제어 기능부는 각 증폭기 모듈의 동작 상태를 감지하고 각 증폭기 모듈의 동작 상태에 따라서 상기 분할기를 구성하는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에서, 적어도 1개의 제어 기능부 입력이 적어도 한 지점에 접속됨으로써 상기 한 점에서의 신호가 적어도 1개의 제어 기능부 입력으로 전달되는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에서, 상기 조합기 출력은 적어도 1개의 제어 기능부 입력에 접속되는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에서, 상기 시스템은 적어도 1개의 공통 제어 출력과 적어도 1개의 공통 제어 입력이 있는 공통 제어 모듈을 추가로 포함한 것으로서, 적어도 1개의 상기 공통 제어 출력은 적어도 1개의 제어 기능부 입력에 접속되는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에서, 상기 시스템은 출력 라인을 추가로 포함하는 것으로서, 상기 출력 라인은 적어도 1개의 제어 기능부 입력에 접속되고 상기 출력 라인은 상기 상기 조합기 출력에 접속되는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에서, 상기 시스템은 적어도 1개의 공통 제어 출력과 적어도 1개의 공통 제어 입력이 있는 공통 제어 모듈을 추가로 포함한 것으로서, 적어도 1개의 공통 제어 출력은 적어도 1개의 제어 기능부 입력에 접속되는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에서, 적어도 1개의 공통 제어 입력은 수신기 입력에 결합되는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에서, 적어도 1개의 공통 제어 입력은 통신 버스에 접속되는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에서, 상기 통신 버스는 적어도 1개의 전송기에 접속되는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제7항에서, 상기 시스템은 수신기와 수신기 출력을 추가로 포함한 것으로서, 상기 수신기 출력은 적어도 1개의 공통 제어 입력과 교신하는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에서, 상기 시스템은 중앙 처리 사이트를 추가로 포함한 것으로서, 상기 사이트는 상기 수신기와 교신하는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에서, 상기 사이트는 상기 수신기와 무선 주파수 신호로 교신하는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에서, 상기 제어 기능부는 마이크로프로세서인 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제7항에서, 상기 공통 제어 모듈은 각 증폭기 모듈과 상기 분할기에 접속된 것으로서, 상기 공통 제어 모듈은 각 증폭기 모듈의 동작 상태를 감지하고 각 증폭기 모듈의 동작 상태에 따라서 상기 분할기를 구성하는 것인 선형 전력 증폭 시스템.16-81019997008949청구항 18 각 증폭기 모듈에 증폭기 입력, 증폭기 출력 및 증폭기 제어 포트가 있는 복수 개의 선형 전력 증폭기 모듈과,적어도 1개의 제어 기능부 입력과 적어도 1개의 제어 출력이 있는 제어 기능부를 포함한 선형 전력 증폭 시스템으로서,각 제어 출력은 적어도 1개의 증폭기 제어 포트에 접속되고,상기 제어 기능부는 적어도 1개의 제어 기능부 입력 상의 미리 정해진 신호를 감지하고 적어도 1개의 제어 출력 상의 미리 정해진 제어 신호를 적어도 1개의 증폭기 제어 포트에 전달하고,각 증폭기 모듈의 동작 상태가 해당하는 증폭기 제어 포트에 의해 수신된 신호에 응답하는 것인 선형 전력 증폭 시스템."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "선형 전력 증폭 시스템 내에 구비된 제어 기능부로서, 상기 시스템은 증폭기 모듈을 포함하고, 상기 제어 기능부는 상기 시스템 내의 점들을 평가하여 상기 시스템의 충분한 동작을 위하여 몇 개의 증폭기 모듈이 필요한지 결정하여 필요한 증폭기 모듈을 활성화시키고 불필요한 모듈을 불활성화시키는 것인 제어 기능부."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "증폭기 모듈을 포함한 선형 전력 증폭 시스템 내에서 제어 기능부 장치에 의해 실행되는 증폭기 모듈의 제어 방법으로서, 상기 방법은복수 개의 증폭기 모듈을 포함한 선형 전력 증폭 시스템과 관련된 점들을 평가하는 단계와,상기 시스템의 충분한 동작을 유지하기 위해서 어떤 증폭기 모듈이 활성 상태에 있을 필요가 있는지 결정하는 단계로서, 상기 제어 기능부가 상기 시스템의 충분한 동작을 정의하는 변수들로 사전에 프로그램되는 단계와,상기 시스템의 충분한 동작을 유지하기 위해서 활성 상태에 있어야 할 필요가 있는 모듈을 활성화시키는 단계와,상기 시스템의 충분한 동작을 유지하기 위해서 활성 상태에 있을 필요가 없는 모듈을 불활성화시키는 단계를 포함하는 방법."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에서, 활성 모듈과 불활성 모듈의 수에 따라서 상기 분할기를 구성하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에서, 활성 모듈과 불활성 모듈의 수에 따라서 상기 조합기를 구성하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "증폭기 모듈을 포함한 선형 전력 증폭 시스템 내에서 제어 기능부 장치에 의해 실행되는 증폭기 모듈의 제어 방법으로서, 상기 방법은복수의 증폭기 모듈을 포함한 선형 전력 증폭 시스템과 관련된 점들로부터 정보를 수집하는 단계와,상기 정보를 평가하여 상기 시스템의 충분한 동작을 유지하기 위해서는 어떤 증폭기 모듈이 활성 상태에 있을 필요가 있는지 결정하고 상기 제어 기능부는 상기 시스템의 충분한 동작을 정의하는 변수들로 사전에 프로그램되는 것인 정보의 평가 단계와,상기 시스템의 충분한 동작을 유지하기 위해서 활성 상태에 있을 필요가 있는 모듈을 활성화시키는 단계와,상기 시스템의 충분한 동작을 유지시키기 위하여 활성 상태에 있을 필요가 없는 모듈을 불활성화시키는 단계를 포함하는 방법."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에서, 활성 모듈과 불활성 모듈의 수에 따라서 상기 분할기를 구성하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에서, 활성 모듈과 불활성 모듈의 수에 따라서 상기 조합기를 구성하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-1999-7008949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "입력과,1개의 분할기 입력과 복수 개의 분할기 출력이 있는 분할기와,16-91019997008949각 증폭기 모듈에 증폭기 입력과 증폭기 출력이 있고 각 증폭기 입력은 적어도 1개의 분할기 출력에 접속된 복수 개의 선형 전력 증폭기 모듈과,복수 개의 조합기 입력과 1개의 조합기 출력이 있고 각 조합기 입력은 적어도 1개의 증폭기 출력에 접속된 조합기와,적어도 1개의 제어 기능부 입력과 적어도 1개의 제어 기능부 출력이 있는 제어 기능부를 포함한 가입자국으로서,상기 변조 시스템은 상기 입력에 접속되고,상기 조합기는 상기 무선 시스템에 접속되고,상기 무선 시스템은 상기 안테나에 접속되고,상기 입력은 상기 분할기 입력에 접속되고,각 제어 기능부 출력이 적어도 1개의 증폭기에 접속되고,상기 제어 기능부가 적어도 1개의 제어 기능부 입력 상의 미리 정해진 신호를 감지하고 적어도 1개의 제어 출력 상의 미리 정해진 제어 신호를 적어도 1개의 증폭기에 제공함으로써 각 증폭기 모듈의 동작 상태가 상기 제어 기능부로부터의 미리 정해진 제어 신호에 응답하는 것인 가입자국.도면16-101019997008949 도면116-111019997008949 도면216-121019997008949 도면316-131019997008949 도면416-141019997008949 도면516-151019997008949 도면616-161019997008949"}
{"patent_id": "10-1999-7008949", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 선형 증폭 시스템에서 활성 상태에 있는 증폭기 모듈의 수를 지능 제어하는 제품 및 시스템을 개시하고 있다. 이와 같은 제어를 수행함으로써 상기 시스템은 불필요한 전력 사용을 피할 수 있다. 본 발명은 상기 시스템을 감시하고 상기 시스템과 관련된 신호로부터의 정보를 수집하는데, 이 정보는 특히 신호 전력에 관련된 것이다. 제어 기능부는 상기 수집된 정보를 평가하여 상기 증폭 시스템을 충분히 동 작시키는 데에 몇 개의 모듈이 필요한지를 결정하거나 일정한 기능을 수행하도록 지시가 내려져야 하는지 를 결정한다. 일단 이 결정이 내려지면 상기 제어 기능부는 제어 신호를 상기 전력 증폭 모듈로 전달하여 필요한 또는 원하는 수만큼의 모듈을 활성화시키고 불필요한 또는 원하지 않는 수만큼의 모듈을 불활성화 시킨다. 또한 상기 제어 기능부는 필요한 또는 원하는 증폭기 모듈의 수에 따라서 상기 분할기와 조합기 를 구성한다. 이러한 수집, 평가 및 제어가 연속적으로 실행된다."}
{"patent_id": "10-1999-7008949", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 일반적으로 무선 전자 통신에 관한 것으로서, 특히 통신 신호를 증폭하는 데 있어서 전력을 보 존하는 분야에 관한 것이다. 16-11019997008949"}
{"patent_id": "10-1999-7008949", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "복수의 선형 증폭기를 포함하는 시스템은 여러 개의 장치들을 구비하고 있다. 예컨대, 다중 채널 4-모듈 선형 증폭 장치들이 셀룰러 전화 기지국 즉, “셀 사이트(sell cite)”에서 사용된다. 이와 같은 기지국 즉, 셀 사이트는 잘 알려져 있고 예를 들어 1992년 조지 칼호운(George Calhoun)이 쓴 “무선 접근 및 국 부 전화망(Wireless Access and the Local Telephone Network)”의 128 내지 135 페이지에 설명되어 있는 데, 이는 본 명세서의 일부로 포함한다. 이와 같은 증폭 시스템은 셀 사이트 내에서 서로 다른 주파수 즉, 채널 또는 캐리어의 복수 무선 주파수(RF) 신호를 증폭하는 데에 이용된다. 이와 같은 시스템은 통상 분할기(splitter), 복수 개의 선형 증폭기 모듈, 조합기(combiner), 분할기/조합기 제어 기능부, 모니터 및 제어 모듈을 포함하고 있다. 이와 같은 시스템의 예로는 다중 캐리어 전력 증폭기의 스펙트리안 (Spectrian) MC160A 계열과 선형 증폭 장치의 파워웨이브(PowerWave) MCA9000-400 계 열을 들 수 있다. 상기 시스템에서 “입력 신호”는 분할기에 입력된다. 이 입력 신호는 서로 다른 주파수를 갖는 1개 이상 의 무선 주파수 신호로 되어 있다. 즉, 이 입력 신호는 다중 채널 신호일 수 있다. 이들 무선 주파수는 진보된 이동 전화 서비스(AMPS: Advanced Mobile Phone Service), 시분할 다중 접속(T DMA), 코드 분할 다 중 접속(CDMA) 표준을 포함한 임의의 원하는 형식 또는 프로토콜을 갖는다. 상기 분할기는 상기 입력 신 호를 2개 이상의 결과 신호로 분할한다. 이 결과 신호는 상기 입력 신호와 동일한 주파수를 포함하지만 입력 신호의 전력 즉, 크기는 상기 결과 신호들 사이에서 동등하게 분할된다. 파워웨이브 MCA9000-400 계열의 4-모듈 선형 증폭 장치와 같은 통상의 4-모듈 증폭 장치 내에서 상기 분 할기는 4개의 각 출력이 4개의 선형 증폭기 모듈 중 어느 하나에 접속되는 것을 특징으로 한다. 상기 분 할기는 이 분할기에 접속되어 작동하는 선형 증폭기 모듈의 숫자에 따라서 구성된다. 예컨대, 마이크로프 로세서나 쉘프(shelf) 로직에 의해 구현되는 분할기/조합기 제어 기능부는 상기 분할기에 접속된 증폭기 모듈의 숫자와 운영을 감시하고 이에 따라 상기 분할기와 조합기를 구성한다. 4개의 모듈이 전부 작동하 는 4-모듈 시스템에서 상기 분할기/조합기 제어 기능부는 4개의 모듈에 대한 분할기를 구성함으로써 상기 분할기가 입력 신호를 4개의 결과 신호로 분할하게 되고 4개의 각 결과 신호는 입력 신호와 동일한 주파 수의 내용을 포함하고 전력은 1/4이 된다. 상기 분할기가 3개의 접속된 연산 증폭기 모듈에 따라서 구성 될 때 상기 분할기는 입력 신호를 3개의 결과 신호로 분할하는데, 이들 각각의 결과 신호는 전력이 입력 신호의 1/3로서 동일하다. 마찬가지로, 상기 분할기가 2개의 모듈에 대해서 구성될 때 상기 분할기는 입 력 신호를 2개의 신호로 분할하고, 분할기가 1개의 모듈에 대해서 구성될 때 상기 분할기는 상기 신호를 분할하지 않는다. 상기 4개의 각 모듈은 그 모듈에 입력된 신호를 원하는 레벨로 증폭시킨다. 이 증폭된 신호는 조합기에 접속된다. 상기 분할기/조합기 제어 기능부는 상기 분할기에 접속되고 작동중인 전력 모듈의 숫자에 따라 서 상기 조합기를 구성한다. 그러므로 4-모듈 시스템에서 상기 분할기/조합기 제어 기능 로직은 이와 같 은 시스템에서 상기 조합기가 작동되도록 구성한다. 따라서 상기 조합기는 상기 4개의 증폭된 신호를 1개 의 전송용 출력 신호로 조합한다. 통상 이렇게 조합된 출력은 안테나 인터페이스 회로를 통하여 전송 안 테나로 입력된다. 또한 이와 같은 시스템에서 감시 장치와 제어 장치는 각 모듈에 동작 전력을 제공하고 이를 제어하는 데 에 사용되며, 각 모듈을 감시하는 데에, 모든 모듈을 활성화시키거나 불활성화시키는 데에, 상기 시스템 이 변수 밖에서 작동하고 있음을 운영자에게 알려주는 데에 사용된다. 이 장치는 또한 상기 분할기/조합 기 제어 기능부와 함께 또는 그 대신에 상기 분할기와 조합기를 구성 및 재구성하는 데에 이용된다. 종래의 셀룰러 전화 셀 사이트에 사용되는 시스템에서는 상기 감시 장치 및 제어 장치가 각 전력 증폭기 모듈을 개별적으로 활성화시키거나 불활성화시키지 않는다. 모든 모듈이 활성화되거나 모든 모듈이 불활 성화된다. 종래의 셀 사이트에 채용된 다중 채널, 다중 증폭 선형 증폭 장치들은 상당량의 전력을 요구하고 결국 동 작시키는 데에 고가의 비용이 든다. 종래의 셀 사이트에서의 전원은 통상 24 V 내지 27 V 의 직류 전압 과 이 때 상기 시스템에 필요한 전류에서 상기 시스템에 전력을 공급한다. 상기 시스템에 필요한 전력은 통상 상기 시스템에 대한 가입자의 사용에 따라서 매일 시간에 대해 변화한다. 가입자의 요구량이 가장 높은 최고 시간 동안에 상기 시스템은 1500 내지 2500 Watts를 요구한다. 최대점을 벗어난 시간 동안에 상기 시스템의 전력 요구량은 대략 150 Watts 정도로서 최대 시간일 때의 요구량보다 현저히 작다. 4-모듈 선형 증폭 시스템을 동작시키는 데에 요구되는 전력의 대부분은 어떤 측면에서 보면 오버헤드 (overhead)로 여겨질 수 있는데, 이는 간단히 말해서 상기 시스템이 동작 중일 때 4개의 전력 증폭기 모듈 전부가 활성 상태에 있다는 것을 의미한다. 최대 시간 동안에는 4개의 전력 증폭기 전부가 통상 상기 시스템에 의해 조정되는 신호를 증폭하는 데 쓰이게 된다. 따라서 최대 시간 동안에는 4개의 전력 증폭기 전부를 활성 상태로 유지시킬 필요가 있다. 그러나 최대점을 벗어난 시간 동안에는 상기 시스템이 충분히 동작되기 위해서 1개 또는 2개의 전력 증폭기 모듈만을 필요로 할 수 있다. 따라서 최대점을 벗어난 시간 동안에는 1개 또는 2개의 증폭기 모듈만을 활성화 시킬 필요가 있다. 요구되는 증폭기 모듈만을 활성 상 태로 유지시키는 것은 상당히 적은 오버헤드 전력을 요구할 수 있다. 전술한 바와 같이, 종래의 시스템은 각 전력 증폭기 모듈을 활성화시키거나 불활성화시키는 등의 제어를 하지 않았다. 오히려 모든 모듈은 어느 특정 시간에 동일한 동작 상태를 유지한다. 예컨대, 종래의 4-모 듈 시스템에서는 4개의 모듈 전부가 최대 시간과 최대가 아닌 양쪽 시간 동안 활성 상태를 유지한다. 따 라서 모든 모듈이 활성 상태 또는 불활성 상태에 있기 때문에 상기 전력 증폭기 모듈은 상기 시스템을 충 분히 동작시키는 데에 필요한 것보다 더 많은 양의 전력을 사용한다. 따라서 종래의 시스템은 전력을 비 효율적으로 사용하고, 그 결과 작동시 필요한 것보다 더 고가의 비용을 초래한다."}
