{"patent_id": "10-2011-0010885", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2012-0099323", "출원번호": "10-2011-0010885", "발명의 명칭": "공기조화장치 및 공기조화장치의 제어방법", "출원인": "엘지전자 주식회사", "발명자": "박정일"}}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "공조공간 내 감지되는 적어도 하나의 열원에 대한 정보를 수집하는 적어도 하나의 열원감지부; 및열원감지부와 통신하여 열원 정보를 수신하는 통신모듈과,공기 토출을 개폐하는 적어도 하나의 베인(vane)과,수신된 열원 정보에 기초하여 개방할 베인을 선택하고, 선택된 베인의 개방각과 토출될 공기의 풍량 및 풍속을 다른 베인과 차별 제어하는 제어부를 포함하는 실내기;를 포함하는 공기조화장치."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 열원 정보는,열원의 위치, 열원의 방향, 열원과의 거리, 열원의 온도, 열원의 수량 등에 대한 정보 중 적어도 하나 이상을포함하는 것을 특징으로 하는 공기조화장치."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 열감지부는,실내기 내에 장착되는 구동모터,실내기 외면에 장착되는 고정 하우징,상기 구동모터의 회전축의 회전에 따라 상기 고정 하우징에 대하여 회전하게 장착되는 회전 하우징, 및상기 회전 하우징 내에 고정되는 열원감지센서를 포함하는 것을 특징으로 하는 공기조화장치."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 열감지 센서는,상기 회전 하우징에서 상기 구동모터의 회전축으로부터 소정각도를 형성하는 방향으로 열원을 감지하도록 배치되는 것을 특징으로 하는 공기조화장치."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 제어부는,상기 열원에 대한 정보가 열원의 방향 및 거리인 경우 실내기에서 토출된 공기가 열원에 도달하도록 열원의거리에 따라 열원이 위치하는 방향에 근접한 방향에 위치하는 베인의 개방각을 단계별로 또는 연속적으로 조절하는 것을 특징으로 하는 공기조화장치."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제어부는,복수 개의 열원이 존재하고, 일부 열원이 군집을 이룬 경우, 군집 열원에 대해 하나의 열원으로 취급하되, 상기 군집 열원에 대한 제어시 가중치 또는 추가 정보를 이용하는 것을 특징으로 하는 공기조화장치.공개특허 10-2012-0099323-2-청구항 7 제6항에 있어서,상기 가중치는 군집 열원을 개별 열원에 비해 풍량 내지 풍속(바람의 세기)을 더 세게 제공하도록 하기 위해차별 제어를 위한 값을 포함하고, 상기 추가 정보는 군집을 이루는 열원의 수량, 군집 열원의 평균 온도, 군집 열원의 평균 거리, 군집 열원의 평균 위치, 군집 열원 내 최외각 열원의 위치와 최내각 열원 위치 중 적어도 하나 이상을 포함하는 것을 특징으로 하는 공기조화장치."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 열원감지부는,적외선 센서를 포함하는 것을 특징으로 하는 공기조화장치."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공기 토출을 개폐하는 적어도 하나의 베인(vane);공조공간 내 적어도 하나의 열원에 대한 정보를 수집하는 적어도 하나의 열원감지부; 및수집된 열원 정보에 기초하여 특정 베인을 선택하고, 선택된 베인의 개방각과 토출될 공기의 풍량을 다른 베인과 차별 제어하는 제어부;가 포함된 실내기를 포함하는 공기조화장치."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공조공간 내 감지되는 적어도 하나의 열원에 대한 정보를 수집하는 단계; 및수신된 열원 정보에 기초하여 공기를 토출할 베인을 선택하고, 선택된 베인의 개방각과 토출될 공기의 풍량을다른 베인과 차별 제어하는 단계;를 포함하여 이루어지는 공기조화장치의 제어방법."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,외부 운전장치를 통해 실내기 또는 실내기의 베인을 차별 제어하기 위한 인공지능모드로 설정받는 단계;를 더포함하는 공기조화장치의 제어방법."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 열원 정보는,열원의 위치, 열원의 방향, 열원과의 거리, 열원의 온도, 열원의 수량 등에 대한 정보 중 적어도 하나 이상을포함하는 것을 특징으로 하는 공기조화장치의 제어방법."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 차별 제어 단계는,상기 열원에 대한 정보가 열원의 방향 및 거리인 경우 실내기에서 토출된 공기가 열원에 도달하도록 열원의거리에 따라 열원이 위치하는 방향에 근접한 방향에 위치하는 베인의 개방각을 단계별로 또는 연속적으로 조절하는 것을 특징으로 하는 공기조화장치의 제어방법."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 차별 제어 단계는,공개특허 10-2012-0099323-3-복수 개의 열원이 존재하고, 일부 열원이 군집을 이룬 경우, 군집 열원에 대해 하나의 열원으로 취급하되, 상기 군집 열원에 대한 제어시 가중치 또는 추가 정보를 이용하는 것을 특징으로 하는 공기조화장치의제어방법."}
{"patent_id": "10-2011-0010885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 가중치는 군집 열원을 개별 열원에 비해 풍량 내지 풍속을 더 세게 제공하도록 하기 위해 차별 제어를위한 값을 포함하고, 상기 추가 정보는 군집을 이루는 열원의 수량, 군집 열원의 평균 온도, 군집 열원의 평균 거리, 군집 열원의 평균 위치, 군집 열원 내 최외각 열원의 위치와 최내각 열원 위치 정보 중 적어도 하나이상을 포함하는 것을 특징으로 하는 공기조화장치의 제어방법.명 세 서기 술 분 야본 발명은 공기조화장치 및 공기조화장치의 제어방법에 관한 것이다. 보다 상세하게, 본 발명은 에너지의 낭 [0001]비를 최소화하고 전력 비용을 최소화할 수 있는 공기조화장치 및 공기조화장치의 제어방법에 관한 것이다.배 경 기 술공기조화장치는 실내 공기를 냉방, 난방, 환기 또는 정화하는 장치 등을 의미한다. 특히, 실내 공기를 냉방 [0002]또는 난방하기 위한 공기조화장치는 실내기와 실외기로 구성될 수 있다. 최근에 사용되는 공기조화장치는 실내기와 실외기가 일대일로 대응되지 않고, 하나의 실외기에 복수 개의 실내기가 연결되는 경우가 많다.사무용 건물의 경우, 하나의 공조공간이 하나의 실내기의 공조능력을 초과하는 경우가 많아, 하나의 공조공간 [0003]에 복수 개의 실내기가 구비되는 경우가 많다.하나의 공조공간에 복수 개의 실내기가 구비되고, 공조공간 내부에 소수의 사람만이 활동하고 있는 경우, 공 [0004]조공간 전체를 동일한 작동온도로 냉방 또는 난방하면 에너지의 낭비가 크고, 전력요금이 가변되는 지능형 전력망을 전제로 하는 경우, 불필요한 전력비용의 낭비가 발생될 수 있다.발명의 내용해결하려는 과제본 발명은 불필요한 전력비용의 낭비를 최소화하며, 공조공간 내 열원에 적응적으로 동작하는 공기조화장치 [0005]및 상기 공기조화장치의 제어방법을 제공하고자 하는 것을 해결하고자 하는 일과제로 한다.과제의 해결 수단상기 과제를 해결하기 위하여, 본 발명에 따른 공기조화장치의 일 예는, 공조공간 내 감지되는 적어도 하나의 [0006]열원에 대한 정보를 수집하는 적어도 하나의 열원감지부; 및 열원감지부와 통신하여 열원 정보를 수신하는 통신모듈과, 공기 토출을 개폐하는 적어도 하나의 베인(vane)과, 수신된 열원 정보에 기초하여 개방할 베인을선택하고, 선택된 베인의 개방각과 토출될 공기의 풍량 및 풍속을 다른 베인과 차별 제어하는 제어부를 포함하는 실내기;를 포함한다.이때, 상기 열원 정보는, 열원의 위치, 열원의 방향, 열원과의 거리, 열원의 온도, 열원의 수량 등에 대한 정 [0007]보 중 적어도 하나 이상을 포함할 수 있다.그리고 상기 열감지부는, 실내기 내에 장착되는 구동모터, 실내기 외면에 장착되는 고정 하우징, 상기 구동모 [0008]터의 회전축의 회전에 따라 상기 고정 하우징에 대하여 회전하게 장착되는 회전 하우징, 및 상기 회전 하우징내에 고정되는 열원감지센서를 포함할 수 있다.또한, 상기 열감지 센서는, 상기 회전 하우징에서 상기 구동모터의 회전축으로부터 소정각도를 형성하는 방향 [0009]으로 열원을 감지하도록 배치될 수 있다.그리고 상기 제어부는, 상기 열원에 대한 정보가 열원의 방향 및 거리인 경우 실내기에서 토출된 공기가 열원 [0010]에 도달하도록 열원의 거리에 따라 열원이 위치하는 방향에 근접한 방향에 위치하는 베인의 개방각을 단계별공개특허 10-2012-0099323-4-로 또는 연속적으로 조절할 수 있다.또한, 상기 제어부는, 복수 개의 열원이 존재하고, 일부 열원이 군집을 이룬 경우, 군집 열원에 대해 하나의 [0011]열원으로 취급하되, 상기 군집 열원에 대한 제어시 가중치 또는 추가 정보를 이용할 수 있다.그리고 상기 가중치는 군집 열원을 개별 열원에 비해 풍량 내지 풍속(바람의 세기)을 더 세게 제공하도록 하 [0012]기 위해 차별 제어를 위한 값을 포함하고, 상기 추가 정보는 군집을 이루는 열원의 수량, 군집 열원의 평균온도, 군집 열원의 평균 거리, 군집 열원의 평균 위치, 군집 열원 내 최외각 열원의 위치와 최내각 열원 위치중 적어도 하나 이상을 포함할 수 있다.또한, 상기 열원감지부는, 적외선 센서를 포함할 수 있다. [0013]본 발명에 따른 공기조화장치의 다른 예는, 공기 토출을 개폐하는 적어도 하나의 베인(vane); 공조공간 내 적 [0014]어도 하나의 열원에 대한 정보를 수집하는 적어도 하나의 열원감지부; 및 수집된 열원 정보에 기초하여 특정베인을 선택하고, 선택된 베인의 개방각과 토출될 공기의 풍량을 다른 베인과 차별 제어하는 제어부;가 포함된 실내기를 포함한다.본 발명에 따른 공기조화장치 제어방법의 일 예는, 공조공간 내 감지되는 적어도 하나의 열원에 대한 정보를 [0015]수집하는 단계; 및 수신된 열원 정보에 기초하여 공기를 토출할 베인을 선택하고, 선택된 베인의 개방각과 토출될 공기의 풍량을 다른 베인과 차별 제어하는 단계;를 포함하여 이루어진다.이때, 공기조화장치의 제어방법은 외부 운전장치를 통해 실내기 또는 실내기의 베인을 차별 제어하기 위한 인 [0016]공지능모드로 설정받는 단계;를 더 포함할 수 있다.그리고 상기 열원 정보는, 열원의 위치, 열원의 방향, 열원과의 거리, 열원의 온도, 열원의 수량 등에 대한 [0017]정보 중 적어도 하나 이상을 포함할 수 있다.또한, 상기 차별 제어 단계는, 상기 열원에 대한 정보가 열원의 방향 및 거리인 경우 실내기에서 토출된 공기 [0018]가 열원에 도달하도록 열원의 거리에 따라 열원이 위치하는 방향에 근접한 방향에 위치하는 베인의 개방각을단계별로 또는 연속적으로 조절할 수 있다.그리고 상기 차별 제어 단계는, 복수 개의 열원이 존재하고, 일부 열원이 군집을 이룬 경우, 군집 열원에 대 [0019]해 하나의 열원으로 취급하되, 상기 군집 열원에 대한 제어시 가중치 또는 추가 정보를 이용할 수 있다.또한, 상기 가중치는 군집 열원을 개별 열원에 비해 풍량 내지 풍속을 더 세게 제공하도록 하기 위해 차별 제 [0020]어를 위한 값을 포함하고, 상기 추가 정보는 군집을 이루는 열원의 수량, 군집 열원의 평균 온도, 군집 열원의 평균 거리, 군집 열원의 평균 위치, 군집 열원 내 최외각 열원의 위치와 최내각 열원 위치 정보 중 적어도하나 이상을 포함할 수 있다.발명의 효과본 발명에 따르면, [0021]첫째, 열원에 대해 자동으로 공기조화장치를 적응적으로 제어하여 사용자의 편의와 보다 빠른 냉/난방을 수행 [0022]하여 쾌적감을 향상시킬 수 있는 효과가 있다.둘째, 불필요한 냉/난방을 피하여 소비 전력을 절감할 수 있는 효과가 있다. [0023]셋째, 지능형 전력망과 연동하여 전력 비용을 최소화할 수 있는 효과가 있다. [0024]도면의 간단한 설명도 1은 본 발명에 따른 공기조화장치 구성의 일 예를 설명하기 위해 도시한 도면, [0025]도 2a는 본 발명에 따른 열원감지부의 일 예를 설명하기 위해 도시한 상세 구성도,도 2b는 상기 열원감지부의 열원감지 센싱의 일 예를 설명하기 위해 도시한 도면,도 3에서는 본 발명에 따른 공기조화장치의 실내기(200a)의 일 예를 설명하기 위해 도시한 도면,도 4(a) 내지 (f)는 본 발명에 따라 제어부의 제어에 따른 각 베인의 차별 제어를 설명하기 위해 도시한도면,공개특허 10-2012-0099323-5-도 5는 본 발명에 따른 공기조화장치 제어방법의 일 예를 설명하기 위해 도시한 순서도,도 6은 본 발명에 따른 공기조화장치의 작동상태의 일 예를 도시한 도면,도 7은 본 발명에 따른 공기조화장치의 작동상태의 다른 예를 도시한 도면,도 8 및 9는 본 발명에 따른 공기조화장치의 작동상태의 또 다른 예를 도시한 도면,도 10은 지능형 전력망 또는 차세대 전력망인 소위 '지능형 전력망(smart grid)'에 대한 개략도,도 11은 지능형 전력망의 주요 수요처인 가정에서의 전력공급네트워크 시스템을 도시한 개략도,도 12는 본 발명에 따른 공기조화장치의 제어방법의 일 예를 블록화한 블록선도, 그리고도 13은 시간에 따른 전력요금이 가변되는 상황에서의 전력요금의 그래프이다. 발명을 실시하기 위한 구체적인 내용이하에서는 첨부된 도면을 참조로 본 발명의 바람직한 실시예를 상세히 설명하기로 한다. 이에 앞서, 본 명세 [0026]서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 해석되어서는 아니되며, 발명자는 그자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서, 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일실시예에 불과할 뿐이고 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형예들이 있을수 있음을 이해하여야 한다.도 1은 본 발명에 따른 공기조화장치 구성의 일 예를 설명하기 위해 도시한 도면이다. [0027]도 1(a)는 실외기 및 실내기를 포함하는 스탠드형 공기조화장치의 일 예를 나타내고, 도 1(b)는 하나의 실외 [0028]기와 복수의 실내기를 포함하는 천장형 공기조화장치의 일 예를 나타낸다. 여기서, 실내기와 실외기는 냉매배관으로 연결되어 냉매의 순환에 따라 냉각 또는 가열된 공기가 실내기를 통해 송풍되어 실내 즉, 공조공간을냉방 또는 난방할 수 있다.도 1(a)를 참조하면, 공기조화장치(1000')는, 실외기(300')와 상기 실외기(300')에 연결된 하나의 실내기 [0029](200')를 포함한다. 도 1(a)에 도시된 실시예에서, 하나의 실내기는 하나의 공조공간을 냉방 또는 난방하기위해서 구비될 수 있다.실외기와 실내기는 일대일로 매칭될 수도 있으나, 최근에는 하나의 실외기에 복수의 실내기가 구비되는 멀티 [0030]공기조화장치가 점점 증가하고 있다.도 1(b)를 참조하면, 공기조화장치(1000)는 주로 공조공간이 큰 건물 등에 구비되며, 하나의 실외기(300)에 [0031]연결된 복수의 실내기(200, 9개의 실내기(200a 내지 200i))를 포함한다. 여기서, 실외기(300)의 개수는 건물의 크기 또는/및 공조공간의 크기나 개수에 따라 가변될 수 있다. 또한, 실내기의 개수는, 실외기(300)의 압축기 용량 또는 개수에 따라 가변될 수 있다. 또한, 공기조화장치(1000)는, 복수의 실외기와, 상기 각 실외기에 연결된 복수의 실내기를 포함할 수 있다. 여기서, 하나의 실외기에 연결된 각 실내기(200a 내지 200i)는독립적으로 운전될 수 있다. 또한, 복수 개의 실내기는 각각의 분리된 공조공간에 설치될 수도 있으며, 하나의 큰 공조공간을 동시에 냉방 또는 난방할 수 있다.상기에서 공기조화장치(1000)는, 실내기(200a 내지 200i) 및 실외기(300) 이외에도 환기유닛, 공기청정유닛, [0032]가습유닛, 제습유닛, 히터와 같은 유닛들 중 적어도 하나 이상을 더 포함할 수 있다. 또한, 공기조화장치(1000)는, 조명유닛이나 경보유닛 중 적어도 하나와 연결되어 상호 연동되어 동작될 수도 있다.실외기(300)는, 연결된 실내기(200)의 요구 또는 외부의 제어신호에 대응하여, 냉방모드 또는 난방모드로 동 [0033]작되며, 복수의 실내기로 냉매를 공급한다. 이러한 실외기(300)는 냉매를 압축시키는 역할을 하는 압축기, 압축기를 구동하는 압축기용 전동기, 압축된 냉매를 방열시키는 역할을 하는 실외 열교환기, 실외 열교환기의일측에 배치되어 냉매의 방열을 촉진시키는 실외팬과, 실외팬을 회전시키는 전동기로 이루어진 실외송풍기와, 응축된 냉매를 팽창하는 팽창기구, 압축된 냉매의 유로를 바꾸는 냉/난방 절환밸브, 기체화된 냉매를 잠시 저장하여 수분과 이물질을 제거한 뒤 일정한 압력의 냉매를 압축기로 공급하는 어큐뮬레이터 등을 포함할 수 있다. 그 밖에 실외기(300)는 다수의 센서, 밸브, 과냉각 장치 등을 더 포함할 수 있으며, 그에 대한설명은 하기에서 생략하기로 한다.공개특허 10-2012-0099323-6-이하에서는 본 발명에 따른 공기조화장치의 다양한 실시예를 설명한다. 다만, 본 명세서에서는 본 발명의 이 [0034]해를 돕고 설명의 편의를 위하여 열원감지부가 실내기와 분리된 공기조화장치와 열원감지부가 실내기에 장착된 공기조화장치로 구분하여 설명한다.우선 열원감지부가 실내기에 장착된 것이 아니라 실내기로부터 분리되어 별도의 위치에 구비된 공기조화장치 [0035]를 설명하면, 다음과 같다.본 발명에 따른 공기조화장치의 일 예는, 공조공간 내 감지되는 적어도 하나의 열원에 대한 정보를 수집하는 [0036]적어도 하나의 열원감지부 및 열원감지부와 통신하여 열원 정보를 수신하는 통신모듈과, 공기가 토출되는 적어도 하나의 베인(vane)과, 수신된 열원 정보에 기초하여 선택된 베인의 개방각과 토출될 공기의 풍량을 다른베인과 차별 제어하는 제어부를 포함하는 실내기를 포함할 수 있다. 상기 개방각이라 함은 예를 들어, 천정면에 대해 베인이 개방되면서 이루는 각도를 의미할 수 있다.여기서, 열원감지부는 적외선 센서를 포함할 수 있다. 이러한 적외선 센서는, 적외선을 이용해 온도, 압력, [0037]방사선의 세기 등의 물리량이나 화학량을 검지하여 신호 처리가 가능한 전기량으로 변환하는 센서를의미하며, 방범이나 화재 검지 등에 사용되고 있으나, 최근에는 열원의 위치를 감지하기 위하여 가전제품에도채용되는 추세이다.열원감지부는, 공조공간에서 감지되는 열원에 대해 정보 즉, 열원 정보를 수집한다. 여기서, 열원 정보라 함 [0038]은 예를 들어, 열원의 위치, 열원의 방향, 열원과의 거리, 열원의 온도, 열원의 수량 등에 대한 정보 중 적어도 하나 이상을 포함한다.열원은 하나의 공조공간 내에 복수 개일 수 있으며, 복수 개의 열원 전체 또는 그 중 일부는 군집을 이룰 수 [0039]도 있다. 또한, 복수 개의 열원 전체 또는 일부는 고정 열원과 이동 열원일 수 있다. 상기한 경우에 열원감지부는 수집되는 열원 정보를 다르게 취급할 수 있다.우선, 열원이 하나의 공조공간 내에서 복수 개 존재하나 군집을 이루지 않고 각각 개별적으로 동작하면, 열원 [0040]감지부는 각 열원에 대해 각각 열원 정보를 수집할 수 있다.그리고 열원이 하나의 공조공간 내에서 복수 개 존재하나 복수 개의 열원 전체 또는 일부가 군집을 이루면, [0041]열원감지부는 군집 열원을 단일 열원 개체로 정의하여 하나의 열원 정보를 수집할 수 있다. 상기에서 복수 개의 열원 중 일부만 군집을 이루고 나머지는 군집을 이루지 않고 개별적으로 동작하면, 열원감지부는 상기 군집을 이루지 않은 각 열원에 대해서는 개별적으로 열원 정보를 수집할 수 있다. 여기서, 군집이라 함은 예를들어, 열원감지부에서 수집한 각 열원의 위치 또는 각 열원과의 거리 등의 정보가 사용자에 의해 설정되거나자체적으로 미리 설정한 기준 범위 내의 열원이 복수 개인 경우를 의미한다. 또한, 열원감지부는 군집 열원과개별 열원에 대해 수집된 정보를 다르게 처리할 수 있다. 예를 들어, 열원감지부는 군집 열원에 대해서는 개별 열원과 달리 가중치 또는/및 추가정보를 제공할 수 있다. 이때, 추가 정보라 함은 예를 들어, 군집을 이루는 열원의 수량, 군집 열원의 평균 온도, 군집 열원의 평균 거리, 군집 열원의 평균 위치, 군집 열원 내 최외각 열원의 위치와 최내각 열원 위치 등을 포함한다. 또한, 가중치라 함은 예를 들어, 군집 열원을 개별 열원에 비해 풍량 내지 풍속(바람의 세기)을 더 세게 제공하도록 하기 위해 차별 제어를 위한 값을 의미한다. 이경우 가중치는 예를 들어, 군집을 이루는 열원의 수량을 기준으로 군집마다 다르게 제공할 수도 있다.또한, 열원감지부는 고정 열원에 대해서는 상술한 바와 같이 열원 정보를 수집하고, 이동 열원에 대해서는 감 [0042]지만 하고 해당 이동 열원이 고정 열원이 될 때까지 열원 정보를 수집하지 않을 수 있다. 여기서, 고정 열원이라 함은 예를 들어, 사용자의 설정 또는 자체적으로 미리 정한 시간 동안 미리 설정된 범위를 벗어나지 않는 경우를 의미할 수 있다. 열원감지부는 하나의 공조공간 내에 복수 개의 열원이 감지되고, 감지된 복수 개의 열원 중 일부는 고정 열원이나 일부가 이동 열원인 경우, 고정 열원에 대해서는 상술한 바와 같이 열원 정보를 수집하나 이동 열원에 대해서는 해당 공조공간 내에서 고정 열원이 될 때까지 해당 열원을 계속하여 감지하고 열원 정보를 수집하지 않는다. 만약 해당 공조공간 내에 이동 열원만 존재하는 경우에는, 공기조화장치는 미리 설정된 작동온도 등에 따라 해당 공조공간을 냉방 또는 난방할 수도 있다.하나의 공조공간에는 복수의 열원감지부가 구비될 수도 있다. 이 경우, 열원감지부는 해당 공조공간에 열원이 [0043]진입하면, 열원의 위치에 따라 각 열원감지부에서 감지된 열원에 대한 열원 정보를 수집할 수 있다. 이렇게수집된 열원 정보는 연결된 실내기로 제공된다. 이때, 열원감지부는 수집된 정보를 각각 연결된 적어도 하나의 실내기로 제공하면, 각 실내기에서는 열원 정보에 기초하여 자신의 동작 여부를 결정할 수 있다. 또한, 동작되는 각 실내기는 동작시킬 베인을 선택하고, 상기 열원 정보에 기초하여 베인의 각도와 베인을 통해 토출공개특허 10-2012-0099323-7-되는 공기의 풍량 내지 풍속을 제어할 수 있다. 또는 공기조화장치 내 특정 열원감지부를 대표 열원감지부롤선택하거나 별도의 중계기를 구비하여, 해당 공조공간 내 각 열원감지부에서 수집되는 열원 정보를 분류하고통합하여 해당 공조공간에 연결된 각 실내기로 열원 정보를 제공할 수도 있다.상기한 각 예에서 열원감지부는 하나의 공조공간 내에 복수 개가 존재하는 다양한 케이스에서 각 열원에 대한 [0044]열원 정보만을 수집하고, 수집된 정보의 처리는 실내기의 제어부에서 이를 대신할 수도 있다.상술한 열원감지부는, 외부 컨트롤러를 통한 사용자의 입력에 따라 설정되거나 또는 자체적으로 미리 설정된 [0045]기준에 따라 주기적으로 열원을 감지할 수도 있다. 또는 하나의 공조공간을 커버(cover)하는 열원감지부가 복수인 경우에는 일부 열원감지부만을 이용하여 열원이 감지되면, 나머지 열원감지부가 모두 동작되어 열원에대한 열원 정보를 수집할 수도 있다. 이 경우, 일부 열원감지부라 함은 예를 들어, 복수의 열원감지부 중 최외각에 위치한 열원 감지부를 의미할 수 있다.도 2a는 본 발명에 따른 열원감지부의 일 예를 설명하기 위해 도시한 상세 구성도이고, 도 2b는 상기 열원감 [0046]지부의 열원감지 센싱의 일 예를 설명하기 위해 도시한 도면이다.도 2a를 참조하면, 본 발명에 따른 열원감지부의 일 예는, 구동모터, 고정 하우징, 상기 구동모터의 회전축의 [0047]회전에 따라 상기 고정 하우징으로부터 회전하게 장착된 회전 하우징, 및 열원을 감지하는 열원감지센서부를포함하여 구성된다.상기 열원감지센서부는, 회전 하우징에 고정되는 제1 축, 제1 축으로부터 소정각도(α)로 기울어진 제2 축과, [0048]제2 축의 끝에 부착되어 소정각도(β)의 범위 내 열원을 감지하고, 열원 정보를 수집하는 열원감지센서를 포함하여 구성된다. 공기조화장치는 해당 공조공간의 크기, 열원감지부의 소정각도(β)의 범위, 개수, 위치, 성능 등을 고려하여 주어진 열원감지부로 해당 공조공간을 최대한 커버할 수 있는 제2 축의 소정각도(α)를 결정할 수 있다. 따라서, 열원감지센서부는, 회전 하우징에 고정되어, 구동 모터에 의한 회전 하우징의 회전에따라 회전하면서 예를 들어, 도 2b와 같이 열원을 센싱하여 감지할 수 있다.상술한 예에서는 열원감지부가 공기조화장치의 실내기에 부착된 것이 아니라 상기 실내기로부터 분리되어 구 [0049]성되므로, 해당 공조공간 내 각 실내기로 수집된 열원 정보를 송신하기 위해 유선이나 무선으로 연결될 수 있다. 특히, 무선(wireless)으로 열원감지부와 각 실내기가 통신하는 경우에는 무선통신모듈이 각각 더 구비되어야 한다. 여기서, 무선통신이라 함은 예를 들어, 지그비(ZigBee), 와이파이(Wi-Fi), 블루투스(Bluetooth)등 다양한 무선통신규격을 따를 수 있다. 특히, 지그비 통신규격은 IEEE 802.15.4(PHY, MAC)에 기반한 무선기술 규격을 의미하며, 비교적 저렴하고, 적은 데이터 전송량, 적은 전력 소모량, 보안성을 갖춘(secure) 네트워킹 등에 최적화되어 있는바, 공기조화장치의 무선통신에 효율적이어서 적합할 수 있다. 다만, 본 발명이상기한 예시에 한정되는 것은 아니다.도 3에서는 본 발명에 따른 공기조화장치의 실내기(200a)의 일 예를 설명하기 위해 도시한 도면이다. [0050]실내기(200a)는, 실내에 배치되어 실내 공기 및 냉매의 열교환에 의하여 실내를 냉/난방 기능을 수행하는 실 [0051]내 열교환기(도시되지 않음), 송풍팬(도시되지 않음)과 상기 송풍팬을 회전시키는 모터, 및 다수의 센서(도시되지 않음), 실내기의 동작을 제어하는 제어부 등을 포함한다.본 발명에 따른 공기조화장치의 실내기(200a)는, 열교환된 공기를 토출하는 토출구를 포함하고, 토출구는 토 [0052]출구를 여닫고 토출되는 공기의 방향을 제어하는 풍향조절수단이 구비된다.실내기(200a)는 실내기 팬의 회전속도를 제어하여 흡입되는 공기 및 토출되는 공기를 제어함으로써, 풍량 내 [0053]지 풍속을 조절한다.그리고, 실내기(200a)는, 각각 공기 흡입구와 좌측 토출구, 우측 토출구, 상부 토출구 등의 공기 토출구 중 [0054]적어도 하나를 여닫음과 아울러 공기를 안내하는 베인(250)이 적어도 1개 이상 설치될 수 있으며, 상기 베인(250)은 공기 흡입구와 공기 토출구를 여닫을 뿐 아니라, 흡입 공기와 토출 공기의 방향을 안내하도록 장착될수 있다. 도 3에서는 하나의 실내기에 4개의 베인이 구비된 경우를 예시하였다. 다만, 본 발명이 상기한 베인의 개수에 한정되는 것은 아니다.또한, 실내기(200a)는, 전술한 열원감지부와의 통신을 위한 통신모듈을 더 포함한다. 여기서, 통신모듈은 해 [0055]당 공조공간 내 배치된 각 열원감지부와 유선이나 무선으로 연결되어 상기 각 열원감지부에서 감지된 열원에대해 수집된 열원 정보를 수신한다. 특히, 실내기(200a)가 열원감지부와 무선(wireless)으로 통신하는 경우에는 전술한 바와 같이 지그비(ZigBee), 와이파이(Wi-Fi), 블루투스(Bluetooth) 등 다양한 무선통신규격을 따를공개특허 10-2012-0099323-8-수 있다.통신모듈을 통해 각 열원감지부에서 감지된 열원에 대해 수집한 열원 정보가 수신되면, 제어부는 수신된 열원 [0056]정보에 기초하여 실내기를 제어한다.도 4(a) 내지 (f)는 본 발명에 따라 제어부의 제어에 따른 각 베인의 차별 제어를 설명하기 위해 도시한 도면 [0057]이다. 도 4(a) 내지 (f)를 참조하면, 제어부는 우선 실내기에 구비된 각 베인 중 개방할 베인을 선택하고, 선택된 베인과 선택되지 않은 베인을 차별 제어한다. 이 경우, 선택되는 베인은 복수 개일 수 있다. 또한, 제어부는 선택된 복수 개의 베인들을 동일한 정도로 제어하거나 각각 베인을 차별 제어할 수 있다.제어부는 열원 정보와 기 저장되었거나 사용자에 의해 설정되는 정보를 비교하여, 특정 베인을 선택하고 선택 [0058]된 베인을 통해 토출될 공기의 풍량 내지 풍속을 결정하여 공기 토출구, 베인 등에 제어 신호를 전송하여 해당 열원에 대한 냉방 또는 난방이 이루어지도록 한다.상술한 내용은 실내기에 구비된 제어부에서 열원감지부에서 수집된 열원 정보에 기초하여 해당 실내기에 구비 [0059]된 베인의 개방각과 베인을 통해 토출될 공기의 풍량 내지 풍속을 제어하는 것에 대해 설명하였다. 이때, 제어부는 해당 실내기에 구비된 베인이 한 개인 경우에는, 해당 베인을 동작(개방) 여부, 동작시 개방각도 및동작시 토출될 풍량 내지 풍속을 제어한다. 또한, 제어부는 해당 실내기에 구비된 베인이 복수 개인 경우에는우선 베인의 동작 여부를 판단하여 동작시에는 복수 개의 베인 중 동작시킬 적어도 하나의 베인을 선택한다.이후 제어부는 선택된 베인에 대해 개방각도와 토출시킬 풍량 내지 풍속을 제어한다. 이 경우 제어부는 선택된 베인이 복수 개이면, 각 베인의 개방각도와 토출시킬 공기의 풍량 내지 풍속을 차별 제어할 수 있다.그 밖에 공기조화장치는 전술한 바와 달리, 해당 공조공간 내에 하나 또는 그 이상의 열원감지부와 하나 또는 [0060]그 이상의 실내기가 구비된 경우, 공기조화장치 내 별도의 제어모듈(통신모듈을 포함)을 통해 제어할 수도 있다. 예를 들어, 공기조화장치 내 별도 구비된 제어모듈은 통신모듈을 통해 각 열원감지부에서 감지되어 수집된 열원 정보를 수신하고, 수신된 열원 정보에 기초하여 해당 열원에 대하여 동작될 적어도 하나의 실내기를선택한다. 그리고 제어모듈은 선택된 실내기에 대해서만 열원감지부의 열원 정보를 그대로 전달하여 해당 실내기의 제어부에서 직접 각 베인을 제어하거나 또는 실내기의 제어부와 같이 상기 열원 정보를 직접 가공하여해당 실내기를 직접 제어할 수도 있다. 상기한 제어모듈은 예를 들어, 사용자가 직접 핸들링하는 운전장치일수도 있다.그 밖에 공기조화장치를 구성하는 운전장치도 통신모듈을 구비할 수 있다. 따라서, 운전장치가 해당 공조공간 [0061]에 위치한 경우에는 열원감지부의 수집 정보를 직접 수신할 수도 있으며, 수신된 열원감지부의 열원 정보에기초하여 직접 각 실내기를 제어할 수도 있다.이상 상술한 내용은 사용자가 운전장치를 통해 별도의 모드를 선택한 경우에만 동작할 수도 있다. 예를 들어, [0062]일반모드와 전술한 본 발명의 인공지능모드가 존재하고, 사용자가 인공지능모드를 선택하면, 전술한 바와 같이, 공기조화장치가 자동으로 동작될 수 있다. 상기에서 일반모드라 함은 예를 들어, 사용자가 운전장치 등을통해 미리 설정한 시간이나 작동온도에 따라 공조공간 내 모든 실내기가 동일하게 동작되는 경우를 의미할 수있다.다음으로, 열원감지부가 실내기에 장착된 공기조화장치를 설명하면, 다음과 같다. 다만, 이하에서는 전술한 [0063]내용과 중복되는 부분을 해당 부분의 내용을 원용하고 설명을 생략하며, 상이한 부분을 위주로 설명한다.본 발명에 따른 공기조화장치의 다른 예는, 공기 토출을 개폐하는 적어도 하나의 베인(vane), 공조공간 내 적 [0064]어도 하나의 열원에 대한 정보를 수집하는 적어도 하나의 열원감지부 및 수집된 열원 정보에 기초하여 선택된베인의 개방각과 토출될 공기의 풍량을 다른 베인과 차별 제어하는 제어부를 포함하는 실내기를 포함할 수 있다.전술한 예가 각 열원감지부가 각 실내기로부터 분리되어 개별 구비되는 공기조화기라면, 본 예시는 각 실내기 [0065]에 열원감지부가 구비되는 경우이다. 이 경우, 각 실내기에 장착되는 열원감지부의 수량, 위치 등은 미리 설정된 바에 따를 수 있다.이 경우에는 전술한 내용과 달리 열원감지부가 실내기에 장착된바, 통신모듈을 별도로 구비하지 않아도 된다. [0066]또한, 공조공간 내에 각 실내기는 장착된 열원감지부에서 감지되어 수집된 열원 정보에 의해서만 동작될 수 [0067]있다. 즉, 각 실내기는 열원 정보에 기초하여 개방할 베인을 선택하고, 선택된 베인에 대해 개방각과 토출될공기의 풍량 내지 풍속만을 제어하면 된다.공개특허 10-2012-0099323-9-도 5는 본 발명에 따른 공기조화장치 제어방법의 일 예를 설명하기 위해 도시한 순서도이다. [0068]본 발명에 따른 공기조화장치 제어방법의 일 예는, 공조공간 내 적어도 하나의 열원을 감지하는 단계, 감지된 [0069]열원에 대한 정보를 수집하는 단계 및 수집된 열원 정보에 기초하여 선택된 베인의 개방각과 토출될 공기의풍량을 다른 베인과 차별 제어하는 단계를 포함한다.우선, 사용자가 운전장치 등을 통해 인공지능모드를 설정하면(S501), 각 열원감지부는 공조공간을 예를 들어, [0070]도 2(b)와 같이 A/B 방향으로 n도/sec의 속도로 센싱(S502)하여 열원을 감지한다(S503).감지된 열원에 대하여 열원감지부는 열원 정보를 수집한다. 열원감지부 또는 실내기의 제어부는 열원 정보로 [0071]부터 열원의 위치, 각도, 거리 등을 계산한다(S504).제어부는 계산된 열원 정보에 기초하여 개방할 베인을 선택/변경하고(S505), 선택/변경된 베인의 개방각을 결 [0072]정한다(S505). 이후 제어부는 결정된 베인의 개방각으로 토출될 공기의 풍량 내지 풍속을 상기 열원 정보에기초하여 결정한다(S506).사용자에 의해 설정된 인공지능모드가 종료되었는지 판단하여(S507), 종료되었으면 이전 모드 즉, 상술한 일 [0073]반모드로 전환하여 동작한다.이하에서는 설명의 편의를 위해 실내기에 열원감지부가 장착된 경우를 예시하여 설명한다. 도 6은 본 발명에 [0074]따른 공기조화장치의 작동상태의 한 예를 도시한다. 도 6에 도시된 실시예는 복수 개의 실내기가 하나의 공조공간에 설치되는 경우의 공기조화장치의 구성도를 도시한다.도 6을 참조하면, 하나의 공조공간(A)에 총 9개의 실내기(200a 내지 200i)가 구비되는 경우를 도시한다. 여기 [0075]서 하나의 공조공간(A)는 총 9개의 공조영역(A1 내지 A9)으로 분할된다.각각의 공조영역(A1 내지 A9)은 주로 해당 공조영역에 구비된 실내기에 의하여 냉방 또는 난방 공조되는 영역 [0076]을 의미한다.물론, 특정 공조영역은 해당 공조영역 이외의 공조영역에 설치된 실내기에 의하여 공조될 수 있으나, 설명의 [0077]편의를 위해 주로 해당 공조영역에 설치된 실내기에 의하여 공조될 수 있다.전술한 바와 같이, 각각의 실내기(200a 내지 200i)는 각각 열원감지부(210a 내지 210i)를 구비한다. 따라서, [0078]각각의 공조영역에 열원의 유무를 감지할 수 있다.물론, 하나의 열원을 복수 개의 실내기에 구비된 열원감지센서(210a 내지 210i)에서 동시에 감지할 수도 [0079]있다. 즉, 각각의 공조영역의 경계 근방에 열원이 활동하는 경우, 각각의 공조영역에 구비되는 서로 다른 실내기의 열원감지부가 동시에 열원을 감지할 수 있다.따라서, 열원감지부(210a 내지 210i)에 의하여 공조공간 내의 열원의 위치도 대략 파악될 수 있으며, 공조공 [0080]간에서 활동하는 열원의 숫자도 대략 파악할 수 있다.실내기의 제어부는, 열원감지부(210a 내지 210i)에 의하여 감지된 열원과 근접한 적어도 1개 이상의 베인을 [0081]결정하고, 다른 베인과 차별 제어할 수 있다.그리고, 본 발명에 따른 공기조화장치를 구성하는 실내기는 사용자의 입력에 의하여 결정된 값과 다른 값으로 [0082]동작될 수도 있다. 예를 들어, 공조공간 내에서 활동하는 열원이 작동 정지된 공기조화장치를 작동시키는 경우, 공조공간 내부에 충분히 많은 열원이 활동하고 있는 경우가 아니라면, 실내기의 모든 베인을 동일하게 작동시키는 것은 전력의 낭비일 수 있기 때문이다.특히, 후술할 지능형 전력망 하에서 전력 비용이 시간 별로 가변되는 경우, 전력 비용이 최고치에 도달하는 [0083]전력비용 피크타임에서 사용자가 실내기의 모든 베인을 작동시키는 것은 전력의 낭비를 초래할 뿐만 아니라사용자가 느끼는 더위 또는 추위를 신속하게 해소하기 위한 심리적 욕구를 충분히 반영하지도 못할 수 있다.도 6에서는 우선 공조공간(A)에 열원이 진입하지 않아 열원을 감지하지 못한 경우이다. [0084]도 7은 본 발명에 따른 공기조화장치의 작동상태의 다른 예를 도시한다. 이하에서는 상술한 도 6에서 전술한 [0085]내용과 중복되는 설명은 전술한 내용을 참조하고, 이하에서는 전술한 내용과 상이한 부분을 위주로 설명한다.도 7을 참조하면, 공조공간(A)에 열원이 진입한 상태이다. 즉, 제5 공조영역(A5)에 열원이 진입하면, 제5 공 [0086]조영역(A5)에 장착된 제5 실내기(200e)의 열원감지부(210e)는 열원을 감지한다. 이 경우, 제5 실내기(200e)에공개특허 10-2012-0099323-10-구비된 무선통신모듈을 통해 열원감지부(210e)에 의하여 감지된 정보를 다른 실내기와 공유할 수 있다.이 경우, 실내기(200e)의 제어부는 열원감지부(201e)에서 감지된 열원에 대해 수집한 열원 정보를 수신하고, [0087]수신된 열원 정보에 기초하여 특정 베인을 선택한다. 도 7의 경우에는 평면도를 기준으로 우측 1개의 베인을선택한다. 제어부는 선택된 우측 베인의 베인 개방각(1 내지 n 스텝)을 결정하고, 상기 열원 정보에 기초하여개방되는 베인을 통해 토출된 공기의 풍량 내지 풍속을 결정하여 결정된 베인각으로 결정된 풍량 내지 풍속으로 공기가 열원에 대해 즉시 토출되도록 해당 구성에 제어 신호를 생성하여 전송한다.이는 넓은 공조공간 내에 소수의 열원만이 활동하고 있는 경우, 모든 실내기 내지 실내기의 베인을 전부 동작 [0088]시킴에 따른 전력의 낭비와 해당 열원에 대한 빠른 냉방과 난방을 위하여 효율적이지 못한바, 본 발명에 따라특정 실내기의 특정 베인만을 동작시킴으로써 상기한 문제를 쉽게 해결할 수 있다.도 8 및 도 9는 본 발명에 따른 공기조화장치의 작동상태의 다른 예를 도시한다. 다만, 이하에서는 상술한 도 [0089]6에서 전술한 내용과 중복되는 설명은 전술한 내용을 참조하고, 이하에서는 전술한 내용과 상이한 부분을 위주로 설명한다.도 8 및 9는 도 7에 도시된 작동상태와 달리, 복수 개의 실내기의 열원감지부에서 동시에 동일한 열원을 감지 [0090]한 경우, 공기조화장치의 제어방법의 예시이다.도 8 및 9를 참조하면, 하나의 공조공간(A)을 구성하는 복수 개의 공조영역(A1 내지 A9) 중 제5 공조영역(A [0091]5)과 제6 공조영역(A6)의 경계 부분에 열원이 활동하는 경우, 제5 실내기(200e) 및 제6 실내기(200f)에 각각구비된 열원감지부(210e, 210f)가 동시에 열원을 감지할 수 있다.동일한 열원이 복수 개의 실내기의 열원감지부(210e, 210f)에 의해 감지되면, 열원을 감지한 열원감지부가 장 [0092]착된 실내기인 제5 실내기(200e) 및 제6 실내기(200f)는 본 발명에 따른 다른 실내기 및 실내기 내 특정 베인을 다른 베인과 차별 제어할 수 있다. 이 경우, 제5 실내기(200e)에서 선택된 베인(우측 베인)과 제6 실내기(200f)에서 선택된 베인(좌측 베인) 역시 동일한 개방각과 풍량 내지 풍속으로 제어될 수도 있으며 차별 제어될 수도 있다.이와 같이, 사용자의 입력 또는 기본설정과 다르게 공기조화장치를 제어하는 이유는 전력낭비를 최소화하고, [0093]지능형 전력망에서의 전력요금 피크 타임에서의 전력의 효율적 사용에 의한 전력요금의 감소를 목표로 한다.도 10은 지능형 전력망 또는 차세대 전력망인 소위 '지능형 전력망(smart grid)'에 대한 개략도이다. [0094]도 10을 참조하면, 지능형 전력망은 화력발전, 원자력발전 또는 수력발전을 통하여 전력을 발생시키는 발전소 [0095]와, 신·재생에너지에 속하는 태양광 또는 풍력을 이용한 태양광발전소와 풍력발전소를 포함할 수 있다.상기 화력발전소, 원자력발전소 또는 수력발전소는 송전선을 통하여 전력소로 전력을 보내고, 전력소에서는 [0096]변전소 및 저장장치로 전기를 공급할 수 있다. 그리고, 태양광발전소와 풍력발전소에서 생산된 전기는 변전소로 공급될 수 있다. 한편, 변전소로 송전된 전기는 전력저장장치를 거쳐서 사무실이나 각 가정으로 분배될 수있다.한편, 일반 가정에서도 가정용 전력네트워크(HAN, Home Area Network, 도 6에서 상술)를 채용하는 경우에 일 [0097]반 가정의 자가 태양광 발전시설, 또는 PHEV(하이브리드 전기자동차, Plug in Hybrid Electric Vehicle)에 장착된 연료전지를 통하여 전기를 자체 공급할 수 있고, 여분의 전기는 외부에 되팔 수도 있다. 그리고, 사무실이나 가정에는 각 수요처에서 사용되는 전력 및 전기요금을 실시간으로 파악할 수 있는 소위 '스마트 계측장치'가 마련될 수 있다. 상기 스마트 계측장치를 통하여 사용자는 현재 사용되는 전력량 및 전기요금을 인지하여 상황에 따라 전력소모량이나 전기요금을 줄이는 방안을 강구할 수 있다.한편, 지능형 전력망에서 전술한 발전소, 전력소, 저장장치 및 전력을 사용하는 수요처는 양방향 통신이 가능 [0098]하다. 따라서, 수요처에서 일방적으로 전기를 받도록 하는 것만을 떠나서, 수요처의 상황을 저장장치,전력소, 발전소로 통지하여 수요처의 상황에 따라 전기 생산 및 전기분배를 할 수 있다. 따라서, 지능형 전력망에서는 수요처의 실시간 전력관리 및 소요전력의 실시간 예측을 담당하는 수요측 에너지관리장치(EMS:Energy Management System) 및 전력의 소모량을 실시간으로 계측하는 계측장치(AMI: Advanced Meteringinfrastructure)를 필요로 한다. 이러한 에너리관리장치 및 계측장치는 별개의 장치로 구성되거나, 또는 하나의 장치에 두 장치의 기능을 모두 수행하도록 구성될 수도 있다.지능형 전력망 하에서의 계측장치는 '오픈 아키텍쳐(open architecture)'를 근거로 하여 소비자를 통합하려는 [0099]기반기술로서 소비자에게는 전기를 효율적으로 사용하도록 하고, 전력공급자에게는 시스템상의 문제를 탐지하공개특허 10-2012-0099323-11-여 시스템을 효율적으로 운영할 수 있는 능력을 제공할 수 있다. 여기서, '오픈 아키텍쳐'란 일반적인 통신망과는 달리 지능형 전력망 시스템에서 가전제품의 제조업체에 상관없이 모든 전기기구가 서로 연결될 수 있도록 하는 기준을 의미한다.따라서, 지능형 전력망에서 사용되는 계측장치는 \"가격 대 장치(Prices to Devices)\" 와 같은 소비자 친화적 [0100]인 효율성 개념을 가능케 한다. 즉, 전력시장의 실시간 가격정보가 각 가정에 설치된 에너지관리장치(EMS)를통하여 전송될 수 있으며, 에너지관리장치(EMS)는 각 가정에 구비된 가전제품과 통신을 하며 제어할 수 있다.물론, 수요측 에너지관리장치(EMS)가 각각의 가전제품을 직접 제어할 수도 있고, 각각의 전기제품에 전기 요 [0101]금과 관련된 정보만 제공해 주는 것도 가능하다. 후자의 경우, 각각의 전기제품의 제어부는 제공된 요금정보에 따라 각각의 전기제품을 제어할 수도 있다.본 발명은 뒤에서 자세히 후술하겠으나, 공기조화장치 및 그 제어방법에 관한 것으로, 공기조화장치를 컨트롤 [0102]러는 상기 에너지관리장치에 의하여 제어될 수도 있다.이 경우, 상기 공기조화장치의 컨트롤러는 지능형 전력망의 수요측 에너지관리장치에 연결되어 에너지관리장 [0103]치에 의하여 제어될 수 있다.그리고, 상기 공기조화장치의 컨트롤러 및 상기 에너지관리장치는 유선 또는 무선으로 연결될 수 있다. [0104]따라서, 사용자는 수요측 에너지관리장치(EMS)에 의해 각각의 가전제품의 전력정보를 인식하고 이를 기초로 [0105]소모전력량이나 전기요금 한계설정 등과 같은 전력정보처리를 수행함으로써 에너지 및 비용을 절약할 수있다. 상기 수요측 에너지관리장치(EMS)와 양방향 통신을 하여 로컬에너지관리장치(Local EMS)에서 취합된 정보를 처리하는 중앙에너지관리장치(Central EMS)로 구성될 수 있다.또한, 지능형 전력망에서는 전력 공급자와 수요자 간의 전력정보에 관한 실시간 통신이 가능하게 되기 [0106]때문에, 종래와 달리 전력공급에 따른 다양한 수요자의 반응, 즉 \"실시간 전력망 반응\"이 가능하다. 예를 들어, 시간대에 따라 전력의 가격이 달라지거나, 전력공급회사에 따라 전력의 가격이 달라지는 경우에 이에 따라 수용자가 전력을 사용하는 시간 및 사용량 등이 달라질 수 있다. 또한, 수요자의 반응에 따라 전력 공급자측에서 전력 가격을 조정하거나, 전력 공급량 등을 조절할 수도 있다.도 11은 지능형 전력망의 주요 수요처인 가정에서의 전력공급네트워크 시스템(10)을 도시한 개략도이다. [0107]도 11을 참조하면, 전력공급네트워크 시스템(10)은 각 가정에 공급되는 전력 및/또는 전기요금을 실시간으로 [0108]측정할 수 있는 계측장치(20, 또는 스마트 미터라 칭함), 상기 계측장치(20) 및 가전제품(100)과 같은 복수개의 가전제품과 연결되고 이들의 동작을 제어하는 에너지관리장치(30, 수요측 에너지관리장치)를 구비할 수있다. 한편, 각 가정의 전기요금은 시간당 요금으로 과금되며, 전력소모량이 급격하게 증대되는 시간구간(전력요금 피크 구간)에서는 시간당 전기요금이 비싸지며, 전력소모량이 상대적으로 적은 심야시간과 같은 때에는 시간당 전기요금이 저렴해질 수 있다. 상기 전력요금 피크 구간은 고정된 것이 아니며, 전력공급자의 전력예비율 등에 따라 일별로 변동될 수 있다.수요측 에너지관리장치(30)는 가정 내부의 네트워크망을 통하여 냉장고(101), 세탁기 및 건조기(102), 공기조 [0109]화장치의 실내기(200), TV(105) 또는 조리기기(104)와 같은 전기제품과 연결되어, 이들과 양방향 통신하며,각각의 가전제품의 작동정보를 모니터링함과 동시에 각각의 가전제품을 제어할 수 있다.즉, 상기 에너지관리장치(30)는 전술한 바와 같이, 전기 요금 등에 관한 정보만을 전기제품의 제어부에 전달 [0110]할 수도 있고, 직접 각각의 전기제품을 제어할 수도 있다.즉, 각각의 가전제품이 제공된 전력정보를 이용하여 스스로 전력요금 피크타임에서의 제어방법을 결정할 수도 [0111]있고, 수요측 에너지관리장치가 직접 전력요금 정보를 사용하여 각각의 가전제품을 제어할 수도 있다.가정 내부에서의 통신은 무선 또는 PLC(전력선 통신)과 같은 유선을 통하여 이루어질 수 있다. 또한, 각 전기 [0112]제품들도 다른 전기제품들과 연결되어 통신이 가능해지도록 배치될 수 있다.가정 내부에서의 무선 통신방법은 지그비 무선통신일 수 있다. [0113]전술한 본 발명에 따른 공기조화장치의 컨트롤러(400)와 실내기는 무선통신모듈을 각각 구비하여, 무선으로 [0114]통신이 가능하므로 결국 상기 수요측 에너지관리장치(30)는 본 발명에 따른 공기조화장치의 컨트롤러(300)와무선 또는 유선으로 연결되어 전력요금과 관련된 정보를 제공하거나, 공기조화장치의 제어신호를 제공할 수있다.공개특허 10-2012-0099323-12-상기 수요측 에너지관리장치(30)와 공기조화장치의 컨트롤러(400) 역시 지그비 방식의 무선통신모듈을 채용하 [0115]여 무선으로 통신하도록 구성할 수 있다.따라서, 본 발명에 따른 공기조화장치는 일반적인 작동시에는 사용자의 입력 또는 기본설정에 따라 의도된 작 [0116]동온도, 풍속 등으로 정상 작동할 수 있으나, 만일 전력요금과 관련된 정보를 지능형 전력망으로부터 수신 가능한 경우, 전력요금이 미리 결정된 금액보다 커지는 구간, 즉 전력요금 피크 구간에서는 공기조화장치의 작동온도를 사용자의 입력 또는 기본 설정과 다르게 설정할 수 있다. 이러한 경우 본 발명에 따른 인공지능 모드로 동작하면, 전력 낭비를 최소화할 수 있다.물론, 본 발명에 따른 공기조화장치의 제어방법은 지능형 전력망과 무관하게 전력의 낭비를 최소화하며, 전력 [0117]비용을 최소화하기 위하여 사용될 수 있다.즉, 공기조화장치의 관리자의 재량에 따라 공기조화장치를 절약 모드로 작동되도록 구성할 수 있으며, 지능형 [0118]전력망 하에서는 미리 결정된 전력요금의 피크 구간에서만 선택적으로 공기조화장치를 전술한 방법으로 제어할 수 있다.도 12는 본 발명에 따른 공기조화장치의 제어방법의 한 예를 블록화한 블록선도이다. [0119]본 발명에 따른 공기조화장치의 제어방법은 미리 결정된 공조공간 내에 복수 개의 실내기가 설치된 공기조화 [0120]장치의 제어방법에 있어서, 기준 작동온도로 복수 개의 실내기를 작동시키는 초기 작동단계(S300), 상기 공조공간 내에 열원의 유무를 감지하는 열원 감지단계(S400) 및, 상기 열원 감지단계(S400)의 감지 결과에 따라일부 실내기의 베인 및 상기 베인의 개방각과 풍량 내지 풍속을 차별 제어하는 차별 공조단계(S500)를 포함한다.상기 초기 작동단계(S300)의 기준 작동온도는 사용자의 입력 또는 기본 작동온도보다 높거나(냉방) [0121]낮은(난방) 온도일 수 있다. 전술한 바와 같이, 사용자가 컨트롤러를 통해 기준 작동온도로 작동되도록 공기조화장치를 작동시키는 경우에도, 상기 컨트롤러는 기준 작동온도로서 기준 작동온도보다 높거나(냉방) 낮은(난방) 온도로 공기조화장치를 제어할 수 있다.그리고, 본 발명에 따른 공기조화장치의 실내기는 각각 열원감지센서를 구비할 수 있으며, 본 발명에 따른 공 [0122]기조화장치의 제어방법은 열원감지센서를 사용하여 공조공간 내에, 더욱 자세히는 공조공간을 구성하는 각각의 공조영역 내의 열원을 감지하는 열원 감지단계(S400)를 더 포함할 수 있으며, 상기 열원 감지단계(S400)에서 감지된 정보에 근거하여 일부 실내기의 베인 및 상기 베인의 개방각과 풍량 내지 풍속을 차별 제어하는 차별 공조단계(S500)를 포함할 수 있다.상기 차별 공조단계(S500)는 열원감지센서에 의하여 감지된 열원 정보를 사용하여 감지된 열원 근방의 실내기 [0123]의 베인 및 상기 베인의 개방각과 풍량 내지 풍속을 더 크게 제어하는 제어단계이다.이와 같은 차별 공조단계는 지능형 전력망을 전제로 수행될 수 있다. [0124]따라서, 상기 초기 공조단계 전에 지능형 전력망의 수요측 에너지관리장치로부터 전력요금 피크구간 여부를 [0125]조회하는 단계를 수행(S100)될 수 있으며, 전력요금 피크구간(S200)이라고 판단되는 경우에는 초기 작동단계(S300), 열원 감지단계(S400) 및 차별 공조단계(S500)가 순차적으로 수행되도록 할 수 있으며, 전력요금 피크구간 이외의 경우에는 사용자 입력 또는 기본 설정 베인 및 상기 베인의 개방각과 풍량 내지 풍속으로 각각의실내기를 제어하는 일반 작동단계(S300')로 실내기를 제어하도록 설정할 수 있다.따라서, 상기 운전장치(400)는 사용자의 요구 또는 전력요금에 따른 설정에 따라 본 발명에 따른 공기조화장 [0126]치의 제어방법에 따라 사용자 입력 또는 기본 설정 베인 및 상기 베인의 개방각과 풍량 내지 풍속으로로 각각의 실내기를 초기 작동단계(S300), 열원 감지단계(S400) 및 차별 공조단계(S500)가 순차적으로 수행되도록 공기조화장치를 순차적으로 제어하거나, 사용자의 입력 또는 기본 설정에 따라 설정된 베인 및 상기 베인의 개방각과 풍량 내지 풍속이 정확하게 반영되도록 각각의 실내기를 제어(S300')할 수 있다.도 13은 시간에 따른 전력요금이 가변되는 상황에서의 전력요금의 그래프이다. [0127]하루에 전력사용량이 큰 폭으로 증가하는 구간은 오후 1시 내지 3시경일 것이다. 이 시간을 경계로 전력 예비 [0128]율은 급격히 감소될 것이며, 단위전력당 전력요금 역시 크게 증가할 것이다.따라서, 미리 결정된 전력요금이 오후 1시 내지 3시 구간의 경계 전력요금인 경우 오후 1시 내지 3시 구간을 [0129]전력요금 피크구간(B구간)으로 규정한다.공개특허 10-2012-0099323-13-따라서, 전술한 공기조화장치의 제어방법에 따라 전력요금 피크구간(B구간)에서 공기조화장치를 제어할 수 있 [0130]다. 구체적으로 사용자의 입력 또는 기본 설정과 다르게 공기조화장치 내 실내기의 베인 및 상기 베인의 개방각과 풍량 내지 풍속을 제어할 수 있으며, 실내기에 구비된 열원감지센서를 통해 공조공간 내의 활동하는 열원을 감지하여, 전력낭비를 최소화하며 활동하는 열원의 불편을 최소화할 수 있다.또한, 이와 같은 절전 모드와 관련된 공기조화장치의 제어방법은 지능형 전력망과 무관하게 수행될 수도 [0131]있다.또한, 전력요금 피크구간(B구간)을 제외한 A구간 및 C구간에서는 전력요금의 부담이 적으므로, 사용자의 입력 [0132]또는 기본 설정에 따라 설정된 베인 및 상기 베인의 개방각과 풍량 내지 풍속이 정확하게 반영되도록 각각의실내기를 일반 작동모드로 제어할 수도 있다.본 명세서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술분야의 당업자는 이하에서 서술 [0133]하는 특허청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게수정 및 변경 실시할 수 있을 것이다. 그러므로 변형된 실시가 기본적으로 본 발명의 특허청구범위의 구성요소를 포함한다면 모두 본 발명의 기술적 범주에 포함된다고 보아야 한다.부호의 설명200 : 실내기 [0134]300 : 실외기400 : 운전장치도면도면1a공개특허 10-2012-0099323-14-도면1b도면2a도면2b공개특허 10-2012-0099323-15-도면3a도면3b도면4a도면4b도면4c공개특허 10-2012-0099323-16-도면4d도면4e도면4f공개특허 10-2012-0099323-17-도면5공개특허 10-2012-0099323-18-도면6공개특허 10-2012-0099323-19-도면7공개특허 10-2012-0099323-20-도면8도면9a공개특허 10-2012-0099323-21-도면9b도면10공개특허 10-2012-0099323-22-도면11공개특허 10-2012-0099323-23-도면12공개특허 10-2012-0099323-24-도면13공개특허 10-2012-0099323-25-"}
{"patent_id": "10-2011-0010885", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 에너지의 낭비를 최소화하고 전력 비용을 최소화할 수 있는 공기조화장치 및 공기조화장치의 제어 방법에 관한 것이다. 본 발명에 따른 공기조화장치 제어방법의 일 예는, 공조공간 내 감지되는 적어도 하나의 열원에 대한 정보를 수집하는 단계; 및 수신된 열원 정보에 기초하여 공기를 토출할 베인을 선택하고, 선택된 베인의 개방각과 토 출될 공기의 풍량을 다른 베인과 차별 제어하는 단계;를 포함하여 이루어진다. 이때, 공기조화장치의 제어방법 은 외부 운전장치를 통해 실내기 또는 실내기의 베인을 차별 제어하기 위한 인공지능모드로 설정받는 단계;를 더 포함할 수 있다."}
{"patent_id": "10-2011-0010885", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 공기조화장치 및 공기조화장치의 제어방법에 관한 것이다. 보다 상세하게, 본 발명은 에너지의 낭 비를 최소화하고 전력 비용을 최소화할 수 있는 공기조화장치 및 공기조화장치의 제어방법에 관한 것이다."}
{"patent_id": "10-2011-0010885", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "공기조화장치는 실내 공기를 냉방, 난방, 환기 또는 정화하는 장치 등을 의미한다. 특히, 실내 공기를 냉방 또는 난방하기 위한 공기조화장치는 실내기와 실외기로 구성될 수 있다. 최근에 사용되는 공기조화장치는 실 내기와 실외기가 일대일로 대응되지 않고, 하나의 실외기에 복수 개의 실내기가 연결되는 경우가 많다. 사무용 건물의 경우, 하나의 공조공간이 하나의 실내기의 공조능력을 초과하는 경우가 많아, 하나의 공조공간 에 복수 개의 실내기가 구비되는 경우가 많다. 하나의 공조공간에 복수 개의 실내기가 구비되고, 공조공간 내부에 소수의 사람만이 활동하고 있는 경우, 공 조공간 전체를 동일한 작동온도로 냉방 또는 난방하면 에너지의 낭비가 크고, 전력요금이 가변되는 지능형 전 력망을 전제로 하는 경우, 불필요한 전력비용의 낭비가 발생될 수 있다."}
{"patent_id": "10-2011-0010885", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 불필요한 전력비용의 낭비를 최소화하며, 공조공간 내 열원에 적응적으로 동작하는 공기조화장치 및 상기 공기조화장치의 제어방법을 제공하고자 하는 것을 해결하고자 하는 일과제로 한다."}
{"patent_id": "10-2011-0010885", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위하여, 본 발명에 따른 공기조화장치의 일 예는, 공조공간 내 감지되는 적어도 하나의 열원에 대한 정보를 수집하는 적어도 하나의 열원감지부; 및 열원감지부와 통신하여 열원 정보를 수신하는 통 신모듈과, 공기 토출을 개폐하는 적어도 하나의 베인(vane)과, 수신된 열원 정보에 기초하여 개방할 베인을 선택하고, 선택된 베인의 개방각과 토출될 공기의 풍량 및 풍속을 다른 베인과 차별 제어하는 제어부를 포함 하는 실내기;를 포함한다. 이때, 상기 열원 정보는, 열원의 위치, 열원의 방향, 열원과의 거리, 열원의 온도, 열원의 수량 등에 대한 정 보 중 적어도 하나 이상을 포함할 수 있다. 그리고 상기 열감지부는, 실내기 내에 장착되는 구동모터, 실내기 외면에 장착되는 고정 하우징, 상기 구동모 터의 회전축의 회전에 따라 상기 고정 하우징에 대하여 회전하게 장착되는 회전 하우징, 및 상기 회전 하우징 내에 고정되는 열원감지센서를 포함할 수 있다. 또한, 상기 열감지 센서는, 상기 회전 하우징에서 상기 구동모터의 회전축으로부터 소정각도를 형성하는 방향 으로 열원을 감지하도록 배치될 수 있다. 그리고 상기 제어부는, 상기 열원에 대한 정보가 열원의 방향 및 거리인 경우 실내기에서 토출된 공기가 열원 에 도달하도록 열원의 거리에 따라 열원이 위치하는 방향에 근접한 방향에 위치하는 베인의 개방각을 단계별로 또는 연속적으로 조절할 수 있다. 또한, 상기 제어부는, 복수 개의 열원이 존재하고, 일부 열원이 군집을 이룬 경우, 군집 열원에 대해 하나의 열원으로 취급하되, 상기 군집 열원에 대한 제어시 가중치 또는 추가 정보를 이용할 수 있다. 그리고 상기 가중치는 군집 열원을 개별 열원에 비해 풍량 내지 풍속(바람의 세기)을 더 세게 제공하도록 하 기 위해 차별 제어를 위한 값을 포함하고, 상기 추가 정보는 군집을 이루는 열원의 수량, 군집 열원의 평균 온도, 군집 열원의 평균 거리, 군집 열원의 평균 위치, 군집 열원 내 최외각 열원의 위치와 최내각 열원 위치 중 적어도 하나 이상을 포함할 수 있다. 또한, 상기 열원감지부는, 적외선 센서를 포함할 수 있다. 본 발명에 따른 공기조화장치의 다른 예는, 공기 토출을 개폐하는 적어도 하나의 베인(vane); 공조공간 내 적 어도 하나의 열원에 대한 정보를 수집하는 적어도 하나의 열원감지부; 및 수집된 열원 정보에 기초하여 특정 베인을 선택하고, 선택된 베인의 개방각과 토출될 공기의 풍량을 다른 베인과 차별 제어하는 제어부;가 포함 된 실내기를 포함한다. 본 발명에 따른 공기조화장치 제어방법의 일 예는, 공조공간 내 감지되는 적어도 하나의 열원에 대한 정보를 수집하는 단계; 및 수신된 열원 정보에 기초하여 공기를 토출할 베인을 선택하고, 선택된 베인의 개방각과 토 출될 공기의 풍량을 다른 베인과 차별 제어하는 단계;를 포함하여 이루어진다. 이때, 공기조화장치의 제어방법은 외부 운전장치를 통해 실내기 또는 실내기의 베인을 차별 제어하기 위한 인 공지능모드로 설정받는 단계;를 더 포함할 수 있다. 그리고 상기 열원 정보는, 열원의 위치, 열원의 방향, 열원과의 거리, 열원의 온도, 열원의 수량 등에 대한 정보 중 적어도 하나 이상을 포함할 수 있다. 또한, 상기 차별 제어 단계는, 상기 열원에 대한 정보가 열원의 방향 및 거리인 경우 실내기에서 토출된 공기 가 열원에 도달하도록 열원의 거리에 따라 열원이 위치하는 방향에 근접한 방향에 위치하는 베인의 개방각을 단계별로 또는 연속적으로 조절할 수 있다. 그리고 상기 차별 제어 단계는, 복수 개의 열원이 존재하고, 일부 열원이 군집을 이룬 경우, 군집 열원에 대 해 하나의 열원으로 취급하되, 상기 군집 열원에 대한 제어시 가중치 또는 추가 정보를 이용할 수 있다. 또한, 상기 가중치는 군집 열원을 개별 열원에 비해 풍량 내지 풍속을 더 세게 제공하도록 하기 위해 차별 제 어를 위한 값을 포함하고, 상기 추가 정보는 군집을 이루는 열원의 수량, 군집 열원의 평균 온도, 군집 열원 의 평균 거리, 군집 열원의 평균 위치, 군집 열원 내 최외각 열원의 위치와 최내각 열원 위치 정보 중 적어도 하나 이상을 포함할 수 있다."}
{"patent_id": "10-2011-0010885", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 첫째, 열원에 대해 자동으로 공기조화장치를 적응적으로 제어하여 사용자의 편의와 보다 빠른 냉/난방을 수행 하여 쾌적감을 향상시킬 수 있는 효과가 있다. 둘째, 불필요한 냉/난방을 피하여 소비 전력을 절감할 수 있는 효과가 있다. 셋째, 지능형 전력망과 연동하여 전력 비용을 최소화할 수 있는 효과가 있다."}
{"patent_id": "10-2011-0010885", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면을 참조로 본 발명의 바람직한 실시예를 상세히 설명하기로 한다. 이에 앞서, 본 명세 서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 해석되어서는 아니되며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하 여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서, 본 명세서에 기재된 실시 예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일실시예에 불과할 뿐이고 본 발명의 기술적 사상을 모 두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형예들이 있을 수 있음을 이해하여야 한다. 도 1은 본 발명에 따른 공기조화장치 구성의 일 예를 설명하기 위해 도시한 도면이다. 도 1(a)는 실외기 및 실내기를 포함하는 스탠드형 공기조화장치의 일 예를 나타내고, 도 1(b)는 하나의 실외 기와 복수의 실내기를 포함하는 천장형 공기조화장치의 일 예를 나타낸다. 여기서, 실내기와 실외기는 냉매배 관으로 연결되어 냉매의 순환에 따라 냉각 또는 가열된 공기가 실내기를 통해 송풍되어 실내 즉, 공조공간을 냉방 또는 난방할 수 있다. 도 1(a)를 참조하면, 공기조화장치(1000')는, 실외기(300')와 상기 실외기(300')에 연결된 하나의 실내기 (200')를 포함한다. 도 1(a)에 도시된 실시예에서, 하나의 실내기는 하나의 공조공간을 냉방 또는 난방하기 위해서 구비될 수 있다. 실외기와 실내기는 일대일로 매칭될 수도 있으나, 최근에는 하나의 실외기에 복수의 실내기가 구비되는 멀티 공기조화장치가 점점 증가하고 있다. 도 1(b)를 참조하면, 공기조화장치는 주로 공조공간이 큰 건물 등에 구비되며, 하나의 실외기에 연결된 복수의 실내기(200, 9개의 실내기(200a 내지 200i))를 포함한다. 여기서, 실외기의 개수는 건물 의 크기 또는/및 공조공간의 크기나 개수에 따라 가변될 수 있다. 또한, 실내기의 개수는, 실외기의 압 축기 용량 또는 개수에 따라 가변될 수 있다. 또한, 공기조화장치는, 복수의 실외기와, 상기 각 실외기 에 연결된 복수의 실내기를 포함할 수 있다. 여기서, 하나의 실외기에 연결된 각 실내기(200a 내지 200i)는 독립적으로 운전될 수 있다. 또한, 복수 개의 실내기는 각각의 분리된 공조공간에 설치될 수도 있으며, 하나 의 큰 공조공간을 동시에 냉방 또는 난방할 수 있다. 상기에서 공기조화장치는, 실내기(200a 내지 200i) 및 실외기 이외에도 환기유닛, 공기청정유닛, 가습유닛, 제습유닛, 히터와 같은 유닛들 중 적어도 하나 이상을 더 포함할 수 있다. 또한, 공기조화장치 는, 조명유닛이나 경보유닛 중 적어도 하나와 연결되어 상호 연동되어 동작될 수도 있다. 실외기는, 연결된 실내기의 요구 또는 외부의 제어신호에 대응하여, 냉방모드 또는 난방모드로 동 작되며, 복수의 실내기로 냉매를 공급한다. 이러한 실외기는 냉매를 압축시키는 역할을 하는 압축기, 압 축기를 구동하는 압축기용 전동기, 압축된 냉매를 방열시키는 역할을 하는 실외 열교환기, 실외 열교환기의 일측에 배치되어 냉매의 방열을 촉진시키는 실외팬과, 실외팬을 회전시키는 전동기로 이루어진 실외 송풍기와, 응축된 냉매를 팽창하는 팽창기구, 압축된 냉매의 유로를 바꾸는 냉/난방 절환밸브, 기체화된 냉매 를 잠시 저장하여 수분과 이물질을 제거한 뒤 일정한 압력의 냉매를 압축기로 공급하는 어큐뮬레이터 등을 포 함할 수 있다. 그 밖에 실외기는 다수의 센서, 밸브, 과냉각 장치 등을 더 포함할 수 있으며, 그에 대한 설명은 하기에서 생략하기로 한다.이하에서는 본 발명에 따른 공기조화장치의 다양한 실시예를 설명한다. 다만, 본 명세서에서는 본 발명의 이 해를 돕고 설명의 편의를 위하여 열원감지부가 실내기와 분리된 공기조화장치와 열원감지부가 실내기에 장착 된 공기조화장치로 구분하여 설명한다. 우선 열원감지부가 실내기에 장착된 것이 아니라 실내기로부터 분리되어 별도의 위치에 구비된 공기조화장치 를 설명하면, 다음과 같다. 본 발명에 따른 공기조화장치의 일 예는, 공조공간 내 감지되는 적어도 하나의 열원에 대한 정보를 수집하는 적어도 하나의 열원감지부 및 열원감지부와 통신하여 열원 정보를 수신하는 통신모듈과, 공기가 토출되는 적 어도 하나의 베인(vane)과, 수신된 열원 정보에 기초하여 선택된 베인의 개방각과 토출될 공기의 풍량을 다른 베인과 차별 제어하는 제어부를 포함하는 실내기를 포함할 수 있다. 상기 개방각이라 함은 예를 들어, 천정면 에 대해 베인이 개방되면서 이루는 각도를 의미할 수 있다. 여기서, 열원감지부는 적외선 센서를 포함할 수 있다. 이러한 적외선 센서는, 적외선을 이용해 온도, 압력, 방사선의 세기 등의 물리량이나 화학량을 검지하여 신호 처리가 가능한 전기량으로 변환하는 센서를 의미하며, 방범이나 화재 검지 등에 사용되고 있으나, 최근에는 열원의 위치를 감지하기 위하여 가전제품에도 채용되는 추세이다. 열원감지부는, 공조공간에서 감지되는 열원에 대해 정보 즉, 열원 정보를 수집한다. 여기서, 열원 정보라 함 은 예를 들어, 열원의 위치, 열원의 방향, 열원과의 거리, 열원의 온도, 열원의 수량 등에 대한 정보 중 적어 도 하나 이상을 포함한다. 열원은 하나의 공조공간 내에 복수 개일 수 있으며, 복수 개의 열원 전체 또는 그 중 일부는 군집을 이룰 수 도 있다. 또한, 복수 개의 열원 전체 또는 일부는 고정 열원과 이동 열원일 수 있다. 상기한 경우에 열원감지 부는 수집되는 열원 정보를 다르게 취급할 수 있다. 우선, 열원이 하나의 공조공간 내에서 복수 개 존재하나 군집을 이루지 않고 각각 개별적으로 동작하면, 열원 감지부는 각 열원에 대해 각각 열원 정보를 수집할 수 있다. 그리고 열원이 하나의 공조공간 내에서 복수 개 존재하나 복수 개의 열원 전체 또는 일부가 군집을 이루면, 열원감지부는 군집 열원을 단일 열원 개체로 정의하여 하나의 열원 정보를 수집할 수 있다. 상기에서 복수 개 의 열원 중 일부만 군집을 이루고 나머지는 군집을 이루지 않고 개별적으로 동작하면, 열원감지부는 상기 군 집을 이루지 않은 각 열원에 대해서는 개별적으로 열원 정보를 수집할 수 있다. 여기서, 군집이라 함은 예를 들어, 열원감지부에서 수집한 각 열원의 위치 또는 각 열원과의 거리 등의 정보가 사용자에 의해 설정되거나 자체적으로 미리 설정한 기준 범위 내의 열원이 복수 개인 경우를 의미한다. 또한, 열원감지부는 군집 열원과 개별 열원에 대해 수집된 정보를 다르게 처리할 수 있다. 예를 들어, 열원감지부는 군집 열원에 대해서는 개 별 열원과 달리 가중치 또는/및 추가정보를 제공할 수 있다. 이때, 추가 정보라 함은 예를 들어, 군집을 이루 는 열원의 수량, 군집 열원의 평균 온도, 군집 열원의 평균 거리, 군집 열원의 평균 위치, 군집 열원 내 최외 각 열원의 위치와 최내각 열원 위치 등을 포함한다. 또한, 가중치라 함은 예를 들어, 군집 열원을 개별 열원 에 비해 풍량 내지 풍속(바람의 세기)을 더 세게 제공하도록 하기 위해 차별 제어를 위한 값을 의미한다. 이 경우 가중치는 예를 들어, 군집을 이루는 열원의 수량을 기준으로 군집마다 다르게 제공할 수도 있다. 또한, 열원감지부는 고정 열원에 대해서는 상술한 바와 같이 열원 정보를 수집하고, 이동 열원에 대해서는 감 지만 하고 해당 이동 열원이 고정 열원이 될 때까지 열원 정보를 수집하지 않을 수 있다. 여기서, 고정 열원 이라 함은 예를 들어, 사용자의 설정 또는 자체적으로 미리 정한 시간 동안 미리 설정된 범위를 벗어나지 않 는 경우를 의미할 수 있다. 열원감지부는 하나의 공조공간 내에 복수 개의 열원이 감지되고, 감지된 복수 개 의 열원 중 일부는 고정 열원이나 일부가 이동 열원인 경우, 고정 열원에 대해서는 상술한 바와 같이 열원 정 보를 수집하나 이동 열원에 대해서는 해당 공조공간 내에서 고정 열원이 될 때까지 해당 열원을 계속하여 감 지하고 열원 정보를 수집하지 않는다. 만약 해당 공조공간 내에 이동 열원만 존재하는 경우에는, 공기조화장 치는 미리 설정된 작동온도 등에 따라 해당 공조공간을 냉방 또는 난방할 수도 있다. 하나의 공조공간에는 복수의 열원감지부가 구비될 수도 있다. 이 경우, 열원감지부는 해당 공조공간에 열원이 진입하면, 열원의 위치에 따라 각 열원감지부에서 감지된 열원에 대한 열원 정보를 수집할 수 있다. 이렇게 수집된 열원 정보는 연결된 실내기로 제공된다. 이때, 열원감지부는 수집된 정보를 각각 연결된 적어도 하나 의 실내기로 제공하면, 각 실내기에서는 열원 정보에 기초하여 자신의 동작 여부를 결정할 수 있다. 또한, 동 작되는 각 실내기는 동작시킬 베인을 선택하고, 상기 열원 정보에 기초하여 베인의 각도와 베인을 통해 토출되는 공기의 풍량 내지 풍속을 제어할 수 있다. 또는 공기조화장치 내 특정 열원감지부를 대표 열원감지부롤 선택하거나 별도의 중계기를 구비하여, 해당 공조공간 내 각 열원감지부에서 수집되는 열원 정보를 분류하고 통합하여 해당 공조공간에 연결된 각 실내기로 열원 정보를 제공할 수도 있다. 상기한 각 예에서 열원감지부는 하나의 공조공간 내에 복수 개가 존재하는 다양한 케이스에서 각 열원에 대한 열원 정보만을 수집하고, 수집된 정보의 처리는 실내기의 제어부에서 이를 대신할 수도 있다. 상술한 열원감지부는, 외부 컨트롤러를 통한 사용자의 입력에 따라 설정되거나 또는 자체적으로 미리 설정된 기준에 따라 주기적으로 열원을 감지할 수도 있다. 또는 하나의 공조공간을 커버(cover)하는 열원감지부가 복 수인 경우에는 일부 열원감지부만을 이용하여 열원이 감지되면, 나머지 열원감지부가 모두 동작되어 열원에 대한 열원 정보를 수집할 수도 있다. 이 경우, 일부 열원감지부라 함은 예를 들어, 복수의 열원감지부 중 최 외각에 위치한 열원 감지부를 의미할 수 있다. 도 2a는 본 발명에 따른 열원감지부의 일 예를 설명하기 위해 도시한 상세 구성도이고, 도 2b는 상기 열원감 지부의 열원감지 센싱의 일 예를 설명하기 위해 도시한 도면이다. 도 2a를 참조하면, 본 발명에 따른 열원감지부의 일 예는, 구동모터, 고정 하우징, 상기 구동모터의 회전축의 회전에 따라 상기 고정 하우징으로부터 회전하게 장착된 회전 하우징, 및 열원을 감지하는 열원감지센서부를 포함하여 구성된다. 상기 열원감지센서부는, 회전 하우징에 고정되는 제1 축, 제1 축으로부터 소정각도(α)로 기울어진 제2 축과, 제2 축의 끝에 부착되어 소정각도(β)의 범위 내 열원을 감지하고, 열원 정보를 수집하는 열원감지센서를 포 함하여 구성된다. 공기조화장치는 해당 공조공간의 크기, 열원감지부의 소정각도(β)의 범위, 개수, 위치, 성 능 등을 고려하여 주어진 열원감지부로 해당 공조공간을 최대한 커버할 수 있는 제2 축의 소정각도(α)를 결 정할 수 있다. 따라서, 열원감지센서부는, 회전 하우징에 고정되어, 구동 모터에 의한 회전 하우징의 회전에 따라 회전하면서 예를 들어, 도 2b와 같이 열원을 센싱하여 감지할 수 있다. 상술한 예에서는 열원감지부가 공기조화장치의 실내기에 부착된 것이 아니라 상기 실내기로부터 분리되어 구 성되므로, 해당 공조공간 내 각 실내기로 수집된 열원 정보를 송신하기 위해 유선이나 무선으로 연결될 수 있 다. 특히, 무선(wireless)으로 열원감지부와 각 실내기가 통신하는 경우에는 무선통신모듈이 각각 더 구비되 어야 한다. 여기서, 무선통신이라 함은 예를 들어, 지그비(ZigBee), 와이파이(Wi-Fi), 블루투스(Bluetooth) 등 다양한 무선통신규격을 따를 수 있다. 특히, 지그비 통신규격은 IEEE 802.15.4(PHY, MAC)에 기반한 무선 기술 규격을 의미하며, 비교적 저렴하고, 적은 데이터 전송량, 적은 전력 소모량, 보안성을 갖춘(secure) 네 트워킹 등에 최적화되어 있는바, 공기조화장치의 무선통신에 효율적이어서 적합할 수 있다. 다만, 본 발명이 상기한 예시에 한정되는 것은 아니다. 도 3에서는 본 발명에 따른 공기조화장치의 실내기(200a)의 일 예를 설명하기 위해 도시한 도면이다. 실내기(200a)는, 실내에 배치되어 실내 공기 및 냉매의 열교환에 의하여 실내를 냉/난방 기능을 수행하는 실 내 열교환기(도시되지 않음), 송풍팬(도시되지 않음)과 상기 송풍팬을 회전시키는 모터, 및 다수의 센서(도시 되지 않음), 실내기의 동작을 제어하는 제어부 등을 포함한다. 본 발명에 따른 공기조화장치의 실내기(200a)는, 열교환된 공기를 토출하는 토출구를 포함하고, 토출구는 토 출구를 여닫고 토출되는 공기의 방향을 제어하는 풍향조절수단이 구비된다. 실내기(200a)는 실내기 팬의 회전속도를 제어하여 흡입되는 공기 및 토출되는 공기를 제어함으로써, 풍량 내 지 풍속을 조절한다. 그리고, 실내기(200a)는, 각각 공기 흡입구와 좌측 토출구, 우측 토출구, 상부 토출구 등의 공기 토출구 중 적어도 하나를 여닫음과 아울러 공기를 안내하는 베인이 적어도 1개 이상 설치될 수 있으며, 상기 베인 은 공기 흡입구와 공기 토출구를 여닫을 뿐 아니라, 흡입 공기와 토출 공기의 방향을 안내하도록 장착될 수 있다. 도 3에서는 하나의 실내기에 4개의 베인이 구비된 경우를 예시하였다. 다만, 본 발명이 상기한 베인 의 개수에 한정되는 것은 아니다. 또한, 실내기(200a)는, 전술한 열원감지부와의 통신을 위한 통신모듈을 더 포함한다. 여기서, 통신모듈은 해 당 공조공간 내 배치된 각 열원감지부와 유선이나 무선으로 연결되어 상기 각 열원감지부에서 감지된 열원에 대해 수집된 열원 정보를 수신한다. 특히, 실내기(200a)가 열원감지부와 무선(wireless)으로 통신하는 경우에 는 전술한 바와 같이 지그비(ZigBee), 와이파이(Wi-Fi), 블루투스(Bluetooth) 등 다양한 무선통신규격을 따를수 있다. 통신모듈을 통해 각 열원감지부에서 감지된 열원에 대해 수집한 열원 정보가 수신되면, 제어부는 수신된 열원 정보에 기초하여 실내기를 제어한다. 도 4(a) 내지 (f)는 본 발명에 따라 제어부의 제어에 따른 각 베인의 차별 제어를 설명하기 위해 도시한 도면 이다. 도 4(a) 내지 (f)를 참조하면, 제어부는 우선 실내기에 구비된 각 베인 중 개방할 베인을 선택하고, 선 택된 베인과 선택되지 않은 베인을 차별 제어한다. 이 경우, 선택되는 베인은 복수 개일 수 있다. 또한, 제어 부는 선택된 복수 개의 베인들을 동일한 정도로 제어하거나 각각 베인을 차별 제어할 수 있다. 제어부는 열원 정보와 기 저장되었거나 사용자에 의해 설정되는 정보를 비교하여, 특정 베인을 선택하고 선택 된 베인을 통해 토출될 공기의 풍량 내지 풍속을 결정하여 공기 토출구, 베인 등에 제어 신호를 전송하여 해 당 열원에 대한 냉방 또는 난방이 이루어지도록 한다. 상술한 내용은 실내기에 구비된 제어부에서 열원감지부에서 수집된 열원 정보에 기초하여 해당 실내기에 구비 된 베인의 개방각과 베인을 통해 토출될 공기의 풍량 내지 풍속을 제어하는 것에 대해 설명하였다. 이때, 제 어부는 해당 실내기에 구비된 베인이 한 개인 경우에는, 해당 베인을 동작(개방) 여부, 동작시 개방각도 및 동작시 토출될 풍량 내지 풍속을 제어한다. 또한, 제어부는 해당 실내기에 구비된 베인이 복수 개인 경우에는 우선 베인의 동작 여부를 판단하여 동작시에는 복수 개의 베인 중 동작시킬 적어도 하나의 베인을 선택한다. 이후 제어부는 선택된 베인에 대해 개방각도와 토출시킬 풍량 내지 풍속을 제어한다. 이 경우 제어부는 선택 된 베인이 복수 개이면, 각 베인의 개방각도와 토출시킬 공기의 풍량 내지 풍속을 차별 제어할 수 있다. 그 밖에 공기조화장치는 전술한 바와 달리, 해당 공조공간 내에 하나 또는 그 이상의 열원감지부와 하나 또는 그 이상의 실내기가 구비된 경우, 공기조화장치 내 별도의 제어모듈(통신모듈을 포함)을 통해 제어할 수도 있 다. 예를 들어, 공기조화장치 내 별도 구비된 제어모듈은 통신모듈을 통해 각 열원감지부에서 감지되어 수집 된 열원 정보를 수신하고, 수신된 열원 정보에 기초하여 해당 열원에 대하여 동작될 적어도 하나의 실내기를 선택한다. 그리고 제어모듈은 선택된 실내기에 대해서만 열원감지부의 열원 정보를 그대로 전달하여 해당 실 내기의 제어부에서 직접 각 베인을 제어하거나 또는 실내기의 제어부와 같이 상기 열원 정보를 직접 가공하여 해당 실내기를 직접 제어할 수도 있다. 상기한 제어모듈은 예를 들어, 사용자가 직접 핸들링하는 운전장치일 수도 있다. 그 밖에 공기조화장치를 구성하는 운전장치도 통신모듈을 구비할 수 있다. 따라서, 운전장치가 해당 공조공간 에 위치한 경우에는 열원감지부의 수집 정보를 직접 수신할 수도 있으며, 수신된 열원감지부의 열원 정보에 기초하여 직접 각 실내기를 제어할 수도 있다. 이상 상술한 내용은 사용자가 운전장치를 통해 별도의 모드를 선택한 경우에만 동작할 수도 있다. 예를 들어, 일반모드와 전술한 본 발명의 인공지능모드가 존재하고, 사용자가 인공지능모드를 선택하면, 전술한 바와 같 이, 공기조화장치가 자동으로 동작될 수 있다. 상기에서 일반모드라 함은 예를 들어, 사용자가 운전장치 등을 통해 미리 설정한 시간이나 작동온도에 따라 공조공간 내 모든 실내기가 동일하게 동작되는 경우를 의미할 수 있다. 다음으로, 열원감지부가 실내기에 장착된 공기조화장치를 설명하면, 다음과 같다. 다만, 이하에서는 전술한 내용과 중복되는 부분을 해당 부분의 내용을 원용하고 설명을 생략하며, 상이한 부분을 위주로 설명한다. 본 발명에 따른 공기조화장치의 다른 예는, 공기 토출을 개폐하는 적어도 하나의 베인(vane), 공조공간 내 적 어도 하나의 열원에 대한 정보를 수집하는 적어도 하나의 열원감지부 및 수집된 열원 정보에 기초하여 선택된 베인의 개방각과 토출될 공기의 풍량을 다른 베인과 차별 제어하는 제어부를 포함하는 실내기를 포함할 수 있 다. 전술한 예가 각 열원감지부가 각 실내기로부터 분리되어 개별 구비되는 공기조화기라면, 본 예시는 각 실내기 에 열원감지부가 구비되는 경우이다. 이 경우, 각 실내기에 장착되는 열원감지부의 수량, 위치 등은 미리 설 정된 바에 따를 수 있다. 이 경우에는 전술한 내용과 달리 열원감지부가 실내기에 장착된바, 통신모듈을 별도로 구비하지 않아도 된다. 또한, 공조공간 내에 각 실내기는 장착된 열원감지부에서 감지되어 수집된 열원 정보에 의해서만 동작될 수 있다. 즉, 각 실내기는 열원 정보에 기초하여 개방할 베인을 선택하고, 선택된 베인에 대해 개방각과 토출될 공기의 풍량 내지 풍속만을 제어하면 된다.도 5는 본 발명에 따른 공기조화장치 제어방법의 일 예를 설명하기 위해 도시한 순서도이다. 본 발명에 따른 공기조화장치 제어방법의 일 예는, 공조공간 내 적어도 하나의 열원을 감지하는 단계, 감지된 열원에 대한 정보를 수집하는 단계 및 수집된 열원 정보에 기초하여 선택된 베인의 개방각과 토출될 공기의 풍량을 다른 베인과 차별 제어하는 단계를 포함한다. 우선, 사용자가 운전장치 등을 통해 인공지능모드를 설정하면(S501), 각 열원감지부는 공조공간을 예를 들어, 도 2(b)와 같이 A/B 방향으로 n도/sec의 속도로 센싱(S502)하여 열원을 감지한다(S503). 감지된 열원에 대하여 열원감지부는 열원 정보를 수집한다. 열원감지부 또는 실내기의 제어부는 열원 정보로 부터 열원의 위치, 각도, 거리 등을 계산한다(S504). 제어부는 계산된 열원 정보에 기초하여 개방할 베인을 선택/변경하고(S505), 선택/변경된 베인의 개방각을 결 정한다(S505). 이후 제어부는 결정된 베인의 개방각으로 토출될 공기의 풍량 내지 풍속을 상기 열원 정보에 기초하여 결정한다(S506). 사용자에 의해 설정된 인공지능모드가 종료되었는지 판단하여(S507), 종료되었으면 이전 모드 즉, 상술한 일 반모드로 전환하여 동작한다. 이하에서는 설명의 편의를 위해 실내기에 열원감지부가 장착된 경우를 예시하여 설명한다. 도 6은 본 발명에 따른 공기조화장치의 작동상태의 한 예를 도시한다. 도 6에 도시된 실시예는 복수 개의 실내기가 하나의 공조 공간에 설치되는 경우의 공기조화장치의 구성도를 도시한다. 도 6을 참조하면, 하나의 공조공간(A)에 총 9개의 실내기(200a 내지 200i)가 구비되는 경우를 도시한다. 여기 서 하나의 공조공간(A)는 총 9개의 공조영역(A1 내지 A9)으로 분할된다. 각각의 공조영역(A1 내지 A9)은 주로 해당 공조영역에 구비된 실내기에 의하여 냉방 또는 난방 공조되는 영역 을 의미한다. 물론, 특정 공조영역은 해당 공조영역 이외의 공조영역에 설치된 실내기에 의하여 공조될 수 있으나, 설명의 편의를 위해 주로 해당 공조영역에 설치된 실내기에 의하여 공조될 수 있다. 전술한 바와 같이, 각각의 실내기(200a 내지 200i)는 각각 열원감지부(210a 내지 210i)를 구비한다. 따라서, 각각의 공조영역에 열원의 유무를 감지할 수 있다. 물론, 하나의 열원을 복수 개의 실내기에 구비된 열원감지센서(210a 내지 210i)에서 동시에 감지할 수도 있다. 즉, 각각의 공조영역의 경계 근방에 열원이 활동하는 경우, 각각의 공조영역에 구비되는 서로 다른 실 내기의 열원감지부가 동시에 열원을 감지할 수 있다. 따라서, 열원감지부(210a 내지 210i)에 의하여 공조공간 내의 열원의 위치도 대략 파악될 수 있으며, 공조공 간에서 활동하는 열원의 숫자도 대략 파악할 수 있다. 실내기의 제어부는, 열원감지부(210a 내지 210i)에 의하여 감지된 열원과 근접한 적어도 1개 이상의 베인을 결정하고, 다른 베인과 차별 제어할 수 있다. 그리고, 본 발명에 따른 공기조화장치를 구성하는 실내기는 사용자의 입력에 의하여 결정된 값과 다른 값으로 동작될 수도 있다. 예를 들어, 공조공간 내에서 활동하는 열원이 작동 정지된 공기조화장치를 작동시키는 경 우, 공조공간 내부에 충분히 많은 열원이 활동하고 있는 경우가 아니라면, 실내기의 모든 베인을 동일하게 작 동시키는 것은 전력의 낭비일 수 있기 때문이다. 특히, 후술할 지능형 전력망 하에서 전력 비용이 시간 별로 가변되는 경우, 전력 비용이 최고치에 도달하는 전력비용 피크타임에서 사용자가 실내기의 모든 베인을 작동시키는 것은 전력의 낭비를 초래할 뿐만 아니라 사용자가 느끼는 더위 또는 추위를 신속하게 해소하기 위한 심리적 욕구를 충분히 반영하지도 못할 수 있다. 도 6에서는 우선 공조공간(A)에 열원이 진입하지 않아 열원을 감지하지 못한 경우이다. 도 7은 본 발명에 따른 공기조화장치의 작동상태의 다른 예를 도시한다. 이하에서는 상술한 도 6에서 전술한 내용과 중복되는 설명은 전술한 내용을 참조하고, 이하에서는 전술한 내용과 상이한 부분을 위주로 설명한다. 도 7을 참조하면, 공조공간(A)에 열원이 진입한 상태이다. 즉, 제5 공조영역(A5)에 열원이 진입하면, 제5 공 조영역(A5)에 장착된 제5 실내기(200e)의 열원감지부(210e)는 열원을 감지한다. 이 경우, 제5 실내기(200e)에구비된 무선통신모듈을 통해 열원감지부(210e)에 의하여 감지된 정보를 다른 실내기와 공유할 수 있다. 이 경우, 실내기(200e)의 제어부는 열원감지부(201e)에서 감지된 열원에 대해 수집한 열원 정보를 수신하고, 수신된 열원 정보에 기초하여 특정 베인을 선택한다. 도 7의 경우에는 평면도를 기준으로 우측 1개의 베인을 선택한다. 제어부는 선택된 우측 베인의 베인 개방각(1 내지 n 스텝)을 결정하고, 상기 열원 정보에 기초하여 개방되는 베인을 통해 토출된 공기의 풍량 내지 풍속을 결정하여 결정된 베인각으로 결정된 풍량 내지 풍속으 로 공기가 열원에 대해 즉시 토출되도록 해당 구성에 제어 신호를 생성하여 전송한다. 이는 넓은 공조공간 내에 소수의 열원만이 활동하고 있는 경우, 모든 실내기 내지 실내기의 베인을 전부 동작 시킴에 따른 전력의 낭비와 해당 열원에 대한 빠른 냉방과 난방을 위하여 효율적이지 못한바, 본 발명에 따라 특정 실내기의 특정 베인만을 동작시킴으로써 상기한 문제를 쉽게 해결할 수 있다. 도 8 및 도 9는 본 발명에 따른 공기조화장치의 작동상태의 다른 예를 도시한다. 다만, 이하에서는 상술한 도 6에서 전술한 내용과 중복되는 설명은 전술한 내용을 참조하고, 이하에서는 전술한 내용과 상이한 부분을 위 주로 설명한다. 도 8 및 9는 도 7에 도시된 작동상태와 달리, 복수 개의 실내기의 열원감지부에서 동시에 동일한 열원을 감지 한 경우, 공기조화장치의 제어방법의 예시이다. 도 8 및 9를 참조하면, 하나의 공조공간(A)을 구성하는 복수 개의 공조영역(A1 내지 A9) 중 제5 공조영역(A 5)과 제6 공조영역(A6)의 경계 부분에 열원이 활동하는 경우, 제5 실내기(200e) 및 제6 실내기(200f)에 각각 구비된 열원감지부(210e, 210f)가 동시에 열원을 감지할 수 있다. 동일한 열원이 복수 개의 실내기의 열원감지부(210e, 210f)에 의해 감지되면, 열원을 감지한 열원감지부가 장 착된 실내기인 제5 실내기(200e) 및 제6 실내기(200f)는 본 발명에 따른 다른 실내기 및 실내기 내 특정 베인 을 다른 베인과 차별 제어할 수 있다. 이 경우, 제5 실내기(200e)에서 선택된 베인(우측 베인)과 제6 실내기 (200f)에서 선택된 베인(좌측 베인) 역시 동일한 개방각과 풍량 내지 풍속으로 제어될 수도 있으며 차별 제어 될 수도 있다. 이와 같이, 사용자의 입력 또는 기본설정과 다르게 공기조화장치를 제어하는 이유는 전력낭비를 최소화하고, 지능형 전력망에서의 전력요금 피크 타임에서의 전력의 효율적 사용에 의한 전력요금의 감소를 목표로 한다. 도 10은 지능형 전력망 또는 차세대 전력망인 소위 '지능형 전력망(smart grid)'에 대한 개략도이다. 도 10을 참조하면, 지능형 전력망은 화력발전, 원자력발전 또는 수력발전을 통하여 전력을 발생시키는 발전소 와, 신·재생에너지에 속하는 태양광 또는 풍력을 이용한 태양광발전소와 풍력발전소를 포함할 수 있다. 상기 화력발전소, 원자력발전소 또는 수력발전소는 송전선을 통하여 전력소로 전력을 보내고, 전력소에서는 변전소 및 저장장치로 전기를 공급할 수 있다. 그리고, 태양광발전소와 풍력발전소에서 생산된 전기는 변전소 로 공급될 수 있다. 한편, 변전소로 송전된 전기는 전력저장장치를 거쳐서 사무실이나 각 가정으로 분배될 수 있다. 한편, 일반 가정에서도 가정용 전력네트워크(HAN, Home Area Network, 도 6에서 상술)를 채용하는 경우에 일 반 가정의 자가 태양광 발전시설, 또는 PHEV(하이브리드 전기자동차, Plug in Hybrid Electric Vehicle)에 장 착된 연료전지를 통하여 전기를 자체 공급할 수 있고, 여분의 전기는 외부에 되팔 수도 있다. 그리고, 사무실 이나 가정에는 각 수요처에서 사용되는 전력 및 전기요금을 실시간으로 파악할 수 있는 소위 '스마트 계측장 치'가 마련될 수 있다. 상기 스마트 계측장치를 통하여 사용자는 현재 사용되는 전력량 및 전기요금을 인지하 여 상황에 따라 전력소모량이나 전기요금을 줄이는 방안을 강구할 수 있다. 한편, 지능형 전력망에서 전술한 발전소, 전력소, 저장장치 및 전력을 사용하는 수요처는 양방향 통신이 가능 하다. 따라서, 수요처에서 일방적으로 전기를 받도록 하는 것만을 떠나서, 수요처의 상황을 저장장치, 전력소, 발전소로 통지하여 수요처의 상황에 따라 전기 생산 및 전기분배를 할 수 있다. 따라서, 지능형 전력 망에서는 수요처의 실시간 전력관리 및 소요전력의 실시간 예측을 담당하는 수요측 에너지관리장치(EMS: Energy Management System) 및 전력의 소모량을 실시간으로 계측하는 계측장치(AMI: Advanced Metering infrastructure)를 필요로 한다. 이러한 에너리관리장치 및 계측장치는 별개의 장치로 구성되거나, 또는 하나 의 장치에 두 장치의 기능을 모두 수행하도록 구성될 수도 있다. 지능형 전력망 하에서의 계측장치는 '오픈 아키텍쳐(open architecture)'를 근거로 하여 소비자를 통합하려는 기반기술로서 소비자에게는 전기를 효율적으로 사용하도록 하고, 전력공급자에게는 시스템상의 문제를 탐지하여 시스템을 효율적으로 운영할 수 있는 능력을 제공할 수 있다. 여기서, '오픈 아키텍쳐'란 일반적인 통신망 과는 달리 지능형 전력망 시스템에서 가전제품의 제조업체에 상관없이 모든 전기기구가 서로 연결될 수 있도 록 하는 기준을 의미한다. 따라서, 지능형 전력망에서 사용되는 계측장치는 \"가격 대 장치(Prices to Devices)\" 와 같은 소비자 친화적 인 효율성 개념을 가능케 한다. 즉, 전력시장의 실시간 가격정보가 각 가정에 설치된 에너지관리장치(EMS)를 통하여 전송될 수 있으며, 에너지관리장치(EMS)는 각 가정에 구비된 가전제품과 통신을 하며 제어할 수 있다. 물론, 수요측 에너지관리장치(EMS)가 각각의 가전제품을 직접 제어할 수도 있고, 각각의 전기제품에 전기 요 금과 관련된 정보만 제공해 주는 것도 가능하다. 후자의 경우, 각각의 전기제품의 제어부는 제공된 요금정보 에 따라 각각의 전기제품을 제어할 수도 있다. 본 발명은 뒤에서 자세히 후술하겠으나, 공기조화장치 및 그 제어방법에 관한 것으로, 공기조화장치를 컨트롤 러는 상기 에너지관리장치에 의하여 제어될 수도 있다. 이 경우, 상기 공기조화장치의 컨트롤러는 지능형 전력망의 수요측 에너지관리장치에 연결되어 에너지관리장 치에 의하여 제어될 수 있다. 그리고, 상기 공기조화장치의 컨트롤러 및 상기 에너지관리장치는 유선 또는 무선으로 연결될 수 있다. 따라서, 사용자는 수요측 에너지관리장치(EMS)에 의해 각각의 가전제품의 전력정보를 인식하고 이를 기초로 소모전력량이나 전기요금 한계설정 등과 같은 전력정보처리를 수행함으로써 에너지 및 비용을 절약할 수 있다. 상기 수요측 에너지관리장치(EMS)와 양방향 통신을 하여 로컬에너지관리장치(Local EMS)에서 취합된 정 보를 처리하는 중앙에너지관리장치(Central EMS)로 구성될 수 있다. 또한, 지능형 전력망에서는 전력 공급자와 수요자 간의 전력정보에 관한 실시간 통신이 가능하게 되기 때문에, 종래와 달리 전력공급에 따른 다양한 수요자의 반응, 즉 \"실시간 전력망 반응\"이 가능하다. 예를 들 어, 시간대에 따라 전력의 가격이 달라지거나, 전력공급회사에 따라 전력의 가격이 달라지는 경우에 이에 따 라 수용자가 전력을 사용하는 시간 및 사용량 등이 달라질 수 있다. 또한, 수요자의 반응에 따라 전력 공급자 측에서 전력 가격을 조정하거나, 전력 공급량 등을 조절할 수도 있다. 도 11은 지능형 전력망의 주요 수요처인 가정에서의 전력공급네트워크 시스템을 도시한 개략도이다. 도 11을 참조하면, 전력공급네트워크 시스템은 각 가정에 공급되는 전력 및/또는 전기요금을 실시간으로 측정할 수 있는 계측장치(20, 또는 스마트 미터라 칭함), 상기 계측장치 및 가전제품과 같은 복수 개의 가전제품과 연결되고 이들의 동작을 제어하는 에너지관리장치(30, 수요측 에너지관리장치)를 구비할 수 있다. 한편, 각 가정의 전기요금은 시간당 요금으로 과금되며, 전력소모량이 급격하게 증대되는 시간구간(전 력요금 피크 구간)에서는 시간당 전기요금이 비싸지며, 전력소모량이 상대적으로 적은 심야시간과 같은 때에 는 시간당 전기요금이 저렴해질 수 있다. 상기 전력요금 피크 구간은 고정된 것이 아니며, 전력공급자의 전력 예비율 등에 따라 일별로 변동될 수 있다. 수요측 에너지관리장치는 가정 내부의 네트워크망을 통하여 냉장고, 세탁기 및 건조기, 공기조 화장치의 실내기, TV 또는 조리기기와 같은 전기제품과 연결되어, 이들과 양방향 통신하며, 각각의 가전제품의 작동정보를 모니터링함과 동시에 각각의 가전제품을 제어할 수 있다. 즉, 상기 에너지관리장치는 전술한 바와 같이, 전기 요금 등에 관한 정보만을 전기제품의 제어부에 전달 할 수도 있고, 직접 각각의 전기제품을 제어할 수도 있다. 즉, 각각의 가전제품이 제공된 전력정보를 이용하여 스스로 전력요금 피크타임에서의 제어방법을 결정할 수도 있고, 수요측 에너지관리장치가 직접 전력요금 정보를 사용하여 각각의 가전제품을 제어할 수도 있다. 가정 내부에서의 통신은 무선 또는 PLC(전력선 통신)과 같은 유선을 통하여 이루어질 수 있다. 또한, 각 전기 제품들도 다른 전기제품들과 연결되어 통신이 가능해지도록 배치될 수 있다. 가정 내부에서의 무선 통신방법은 지그비 무선통신일 수 있다. 전술한 본 발명에 따른 공기조화장치의 컨트롤러와 실내기는 무선통신모듈을 각각 구비하여, 무선으로 통신이 가능하므로 결국 상기 수요측 에너지관리장치는 본 발명에 따른 공기조화장치의 컨트롤러와 무선 또는 유선으로 연결되어 전력요금과 관련된 정보를 제공하거나, 공기조화장치의 제어신호를 제공할 수 있다.상기 수요측 에너지관리장치와 공기조화장치의 컨트롤러 역시 지그비 방식의 무선통신모듈을 채용하 여 무선으로 통신하도록 구성할 수 있다. 따라서, 본 발명에 따른 공기조화장치는 일반적인 작동시에는 사용자의 입력 또는 기본설정에 따라 의도된 작 동온도, 풍속 등으로 정상 작동할 수 있으나, 만일 전력요금과 관련된 정보를 지능형 전력망으로부터 수신 가 능한 경우, 전력요금이 미리 결정된 금액보다 커지는 구간, 즉 전력요금 피크 구간에서는 공기조화장치의 작 동온도를 사용자의 입력 또는 기본 설정과 다르게 설정할 수 있다. 이러한 경우 본 발명에 따른 인공지능 모 드로 동작하면, 전력 낭비를 최소화할 수 있다. 물론, 본 발명에 따른 공기조화장치의 제어방법은 지능형 전력망과 무관하게 전력의 낭비를 최소화하며, 전력 비용을 최소화하기 위하여 사용될 수 있다. 즉, 공기조화장치의 관리자의 재량에 따라 공기조화장치를 절약 모드로 작동되도록 구성할 수 있으며, 지능형 전력망 하에서는 미리 결정된 전력요금의 피크 구간에서만 선택적으로 공기조화장치를 전술한 방법으로 제어 할 수 있다. 도 12는 본 발명에 따른 공기조화장치의 제어방법의 한 예를 블록화한 블록선도이다. 본 발명에 따른 공기조화장치의 제어방법은 미리 결정된 공조공간 내에 복수 개의 실내기가 설치된 공기조화 장치의 제어방법에 있어서, 기준 작동온도로 복수 개의 실내기를 작동시키는 초기 작동단계(S300), 상기 공조 공간 내에 열원의 유무를 감지하는 열원 감지단계(S400) 및, 상기 열원 감지단계(S400)의 감지 결과에 따라 일부 실내기의 베인 및 상기 베인의 개방각과 풍량 내지 풍속을 차별 제어하는 차별 공조단계(S500)를 포함한 다. 상기 초기 작동단계(S300)의 기준 작동온도는 사용자의 입력 또는 기본 작동온도보다 높거나(냉방) 낮은(난방) 온도일 수 있다. 전술한 바와 같이, 사용자가 컨트롤러를 통해 기준 작동온도로 작동되도록 공기 조화장치를 작동시키는 경우에도, 상기 컨트롤러는 기준 작동온도로서 기준 작동온도보다 높거나(냉방) 낮은 (난방) 온도로 공기조화장치를 제어할 수 있다. 그리고, 본 발명에 따른 공기조화장치의 실내기는 각각 열원감지센서를 구비할 수 있으며, 본 발명에 따른 공 기조화장치의 제어방법은 열원감지센서를 사용하여 공조공간 내에, 더욱 자세히는 공조공간을 구성하는 각각 의 공조영역 내의 열원을 감지하는 열원 감지단계(S400)를 더 포함할 수 있으며, 상기 열원 감지단계(S400)에 서 감지된 정보에 근거하여 일부 실내기의 베인 및 상기 베인의 개방각과 풍량 내지 풍속을 차별 제어하는 차 별 공조단계(S500)를 포함할 수 있다. 상기 차별 공조단계(S500)는 열원감지센서에 의하여 감지된 열원 정보를 사용하여 감지된 열원 근방의 실내기 의 베인 및 상기 베인의 개방각과 풍량 내지 풍속을 더 크게 제어하는 제어단계이다. 이와 같은 차별 공조단계는 지능형 전력망을 전제로 수행될 수 있다. 따라서, 상기 초기 공조단계 전에 지능형 전력망의 수요측 에너지관리장치로부터 전력요금 피크구간 여부를 조회하는 단계를 수행(S100)될 수 있으며, 전력요금 피크구간(S200)이라고 판단되는 경우에는 초기 작동단계 (S300), 열원 감지단계(S400) 및 차별 공조단계(S500)가 순차적으로 수행되도록 할 수 있으며, 전력요금 피크 구간 이외의 경우에는 사용자 입력 또는 기본 설정 베인 및 상기 베인의 개방각과 풍량 내지 풍속으로 각각의 실내기를 제어하는 일반 작동단계(S300')로 실내기를 제어하도록 설정할 수 있다. 따라서, 상기 운전장치는 사용자의 요구 또는 전력요금에 따른 설정에 따라 본 발명에 따른 공기조화장 치의 제어방법에 따라 사용자 입력 또는 기본 설정 베인 및 상기 베인의 개방각과 풍량 내지 풍속으로로 각각 의 실내기를 초기 작동단계(S300), 열원 감지단계(S400) 및 차별 공조단계(S500)가 순차적으로 수행되도록 공 기조화장치를 순차적으로 제어하거나, 사용자의 입력 또는 기본 설정에 따라 설정된 베인 및 상기 베인의 개 방각과 풍량 내지 풍속이 정확하게 반영되도록 각각의 실내기를 제어(S300')할 수 있다. 도 13은 시간에 따른 전력요금이 가변되는 상황에서의 전력요금의 그래프이다. 하루에 전력사용량이 큰 폭으로 증가하는 구간은 오후 1시 내지 3시경일 것이다. 이 시간을 경계로 전력 예비 율은 급격히 감소될 것이며, 단위전력당 전력요금 역시 크게 증가할 것이다. 따라서, 미리 결정된 전력요금이 오후 1시 내지 3시 구간의 경계 전력요금인 경우 오후 1시 내지 3시 구간을 전력요금 피크구간(B구간)으로 규정한다.따라서, 전술한 공기조화장치의 제어방법에 따라 전력요금 피크구간(B구간)에서 공기조화장치를 제어할 수 있 다. 구체적으로 사용자의 입력 또는 기본 설정과 다르게 공기조화장치 내 실내기의 베인 및 상기 베인의 개방 각과 풍량 내지 풍속을 제어할 수 있으며, 실내기에 구비된 열원감지센서를 통해 공조공간 내의 활동하는 열 원을 감지하여, 전력낭비를 최소화하며 활동하는 열원의 불편을 최소화할 수 있다. 또한, 이와 같은 절전 모드와 관련된 공기조화장치의 제어방법은 지능형 전력망과 무관하게 수행될 수도 있다. 또한, 전력요금 피크구간(B구간)을 제외한 A구간 및 C구간에서는 전력요금의 부담이 적으므로, 사용자의 입력 또는 기본 설정에 따라 설정된 베인 및 상기 베인의 개방각과 풍량 내지 풍속이 정확하게 반영되도록 각각의 실내기를 일반 작동모드로 제어할 수도 있다."}
{"patent_id": "10-2011-0010885", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술분야의 당업자는 이하에서 서술 하는 특허청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경 실시할 수 있을 것이다. 그러므로 변형된 실시가 기본적으로 본 발명의 특허청구범위의 구성요 소를 포함한다면 모두 본 발명의 기술적 범주에 포함된다고 보아야 한다."}
{"patent_id": "10-2011-0010885", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 공기조화장치 구성의 일 예를 설명하기 위해 도시한 도면, 도 2a는 본 발명에 따른 열원감지부의 일 예를 설명하기 위해 도시한 상세 구성도, 도 2b는 상기 열원감지부의 열원감지 센싱의 일 예를 설명하기 위해 도시한 도면, 도 3에서는 본 발명에 따른 공기조화장치의 실내기(200a)의 일 예를 설명하기 위해 도시한 도면, 도 4(a) 내지 (f)는 본 발명에 따라 제어부의 제어에 따른 각 베인의 차별 제어를 설명하기 위해 도시한 도면,도 5는 본 발명에 따른 공기조화장치 제어방법의 일 예를 설명하기 위해 도시한 순서도, 도 6은 본 발명에 따른 공기조화장치의 작동상태의 일 예를 도시한 도면, 도 7은 본 발명에 따른 공기조화장치의 작동상태의 다른 예를 도시한 도면, 도 8 및 9는 본 발명에 따른 공기조화장치의 작동상태의 또 다른 예를 도시한 도면, 도 10은 지능형 전력망 또는 차세대 전력망인 소위 '지능형 전력망(smart grid)'에 대한 개략도, 도 11은 지능형 전력망의 주요 수요처인 가정에서의 전력공급네트워크 시스템을 도시한 개략도, 도 12는 본 발명에 따른 공기조화장치의 제어방법의 일 예를 블록화한 블록선도, 그리고 도 13은 시간에 따른 전력요금이 가변되는 상황에서의 전력요금의 그래프이다."}
