{"patent_id": "10-2022-0155314", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0074076", "출원번호": "10-2022-0155314", "발명의 명칭": "포인트 클라우드 기반 도면 서비스 제공 및 자동 시준 방법, 장치 및 시스템", "출원인": "삼인이엔에스 주식회사", "발명자": "최철민"}}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 디바이스에서 포인트 클라우드 데이터 기반 도면 서비스 데이터 및 자동 시준 기능을 제공하는 방법에있어서,포인트 클라우드 데이터를 획득하는 단계;상기 획득한 포인트 클라우드 데이터 기반으로 생성된 실측 도면 데이터를 저장하는 단계;상기 저장된 실측 도면 데이터를 호출하는 단계;상기 호출된 도면 데이터에 포함된 적어도 하나 이상의 마킹 중 하나의 마킹을 선택하는 단계; 및상기 선택된 마킹에 상응하는 현장 위치에 자동 시준 정보가 제공되도록 제어하는 단계;를 포함하는,도면 서비스 데이터 및 자동 시준 기능 제공 방법."}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 실측 도면 데이터를 생성하는 단계는,상기 포인트 클라우드 데이터 기반으로 복수의 측정점을 생성하는 단계;상기 생성한 복수의 측정점 사이의 거리 데이터를 획득하는 단계;상기 획득한 거리 데이터에 기반 실측 차수를 확인하여 실측 데이터를 생성하는 단계; 및상기 생성 실측 데이터에 기초하여 도면화 작업을 수행하여 도면 데이터를 생성하는 단계;를 포함하는,도면 서비스 데이터 및 자동 시준 기능 제공 방법."}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 복수의 측정점을 생성하는 단계는,적어도 둘 이상의 면을 선택하는 단계를 포함하고,상기 면을 선택하는 단계는,하나 또는 그 이상의 포인트 클라우드들을 선택하기 위한 박스를 제공하되,상기 박스는 크기가 가변인,도면 서비스 데이터 및 자동 시준 기능 제공 방법."}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 선택된 포인트 클라우드를 이용하여 평균값을 계산하여 상기 각 면을 선택하는 단계를 더 포함하는, 도면 서비스 데이터 및 자동 시준 기능 제공 방법."}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,공개특허 10-2024-0074076-3-상기 선택된 포인트 클라우드들 중 임계치를 벗어난 포인트 클라우드는 노이즈로 정의하는,도면 서비스 데이터 및 자동 시준 기능 제공 방법."}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 노이즈로 정의된 포인트 클라우드는,상기 선택된 포인트 클라우드를 이용하여 평균값을 계산 시 제외되는,도면 서비스 데이터 및 자동 시준 기능 제공 방법."}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 거리 데이터에 기반 실측 차수를 확인하여 실측 데이터를 생성하는 단계는,상기 실측 데이터를 이용하여 BIM과 시공의 오차를 분석하는 단계를 포함하는,도면 서비스 데이터 및 자동 시준 기능 제공 방법."}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 오차를 분석하는 단계는,상기 오차 분석 결과에 기초하여 대상체의 치수 조절 또는 위치를 재설정하는 단계를 포함하는,도면 서비스 데이터 및 자동 시준 기능 제공 방법."}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "포인트 클라우드 데이터 기반 도면 서비스 데이터 및 자동 시준 기능을 제공하는 장치에 있어서,메모리; 및상기 메모리와 통신하는 프로세서를 포함하되,상기 프로세서는,포인트 클라우드 데이터를 획득하여, 상기 획득한 포인트 클라우드 데이터 기반으로 생성된 실측 도면 데이터를저장하고, 상기 저장된 실측 도면 데이터를 호출하여, 상기 호출된 도면 데이터에 포함된 적어도 하나 이상의마킹 중 하나의 마킹을 선택하고, 상기 선택된 마킹에 상응하는 현장 위치에 자동 시준 정보가 제공되도록 제어하는,도면 서비스 데이터 및 자동 시준 기능 제공 장치."}
{"patent_id": "10-2022-0155314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "포인트 클라우드 데이터 기반 도면 서비스 데이터 및 자동 시준 기능을 제공하는 시스템에 있어서,단말; 및상기 단말과 통신하여 신호를 주고받는 컴퓨팅 디바이스를 포함하되,상기 컴퓨팅 디바이스는,상기 단말의 요청에 따라, 포인트 클라우드 데이터를 획득하여, 상기 획득한 포인트 클라우드 데이터 기반으로생성된 실측 도면 데이터를 저장하고, 상기 저장된 실측 도면 데이터를 호출하여, 상기 호출된 도면 데이터에포함된 적어도 하나 이상의 마킹 중 하나의 마킹을 선택하고, 상기 선택된 마킹에 상응하는 현장 위치에 자동시준 정보가 제공되도록 제어하는 프로세서를 포함하는,공개특허 10-2024-0074076-4-도면 서비스 데이터 및 자동 시준 기능 제공 시스템."}
{"patent_id": "10-2022-0155314", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "포인트 클라우드 데이터 기반 도면 서비스 데이터를 제공하는 방법 및 도면 데이터를 기반 자동 시준, 장치 및 시스템이 개시된다. 본 개시의 일 면에 따른 컴퓨팅 디바이스에서 포인트 클라우드 데이터 기반 도면 서비스 데 이터 및 자동 시준 기능을 제공하는 방법은, 포인트 클라우드 데이터를 획득하는 단계; 상기 획득한 포인트 클라 우드 데이터 기반으로 생성된 실측 도면 데이터를 저장하는 단계; 상기 저장된 실측 도면 데이터를 호출하는 단 계; 상기 호출된 도면 데이터에 포함된 적어도 하나 이상의 마킹 중 하나의 마킹을 선택하는 단계; 및 상기 선택 된 마킹에 상응하는 현장 위치에 자동 시준 정보가 제공되도록 제어하는 단계;를 포함할 수 있다."}
{"patent_id": "10-2022-0155314", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 도면 서비스 제공 및 자동 시준에 관한 것으로, 보다 상세하게는 포인트 클라우드 기반으로 도면 서 비스를 제공하고 상기 도면 서비스 기반 자동 시준 기능을 제공하는 방법, 장치 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0155314", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 각기 다른 많은 공사 현장에 정도관리를 하지 않고 작업이 진행되고 있다. 즉, 모듈 또는 장치 등을 설치 하는 경우, 줄자와 같은 수단을 이용한 2차원 계측이나 단순 노하우(Know-how)만으로 공사를 진행함에 따라, 치 수 관리가 정확하게 되지 않고 있다. 문제는, 이와 같이 부정확한 치수 관리에 기반하여 공사를 진행하게 되면, 계속하여 수정 작업을 하여야 하고, 이로 인해 공기가 지연되고 인건비 증가뿐만 아니라 품질 저하의 문제가 발생하게 된다. 특히, BIM(Building Information Modeling) 모델 대비 현장 골조가 정확하게 타설되지 않기 때문에, 실측 기반 도면화 작업이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허공보 10-2009-0002073호 (2009.01.09.)"}
{"patent_id": "10-2022-0155314", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시가 해결하고자 하는 과제는, 포인트 클라우드 기반으로 도면화 서비스 및 도면 기반 자동 시준 기능을 제공하는 방법, 장치 및 시스템을 제공하는 것이다. 본 개시가 해결하고자 하는 다른 과제는, 실측 기반 도면화 작업 및 자동 시준 기능을 이용한 정도 관리를 통해 고품질의 빠른 공정 및 생산성을 향상시키는 방법, 장치 및 시스템을 제공하는 것이다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0155314", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 개시의 일 면에 따른 컴퓨팅 디바이스에서 포인트 클라우드 데이터 기반 도면 서비스 데이터 및 자동 시준 기능을 제공하는 방법은, 포인트 클라우드 데이터를 획득하는 단계; 상기 획득한 포인트 클라우드 데이터 기반으로 생성된 실측 도면 데이터를 저장하는 단계; 상기 저장된 실측 도면 데이터를 호출하는 단계; 상기 호출된 도면 데이터에 포함된 적어도 하나 이상의 마킹 중 하나의 마킹을 선택하는 단계; 및 상기 선택된 마킹에 상응하는 현장 위치에 자동 시준 정보가 제공되도록 제어하는 단계;를 포함할 수 있다. 본 개시의 일 면에 따른 포인트 클라우드 데이터 기반 도면 서비스 데이터 및 자동 시준 기능을 제공하는 장치 는, 메모리; 및 상기 메모리와 통신하는 프로세서를 포함하되, 상기 프로세서는, 포인트 클라우드 데이터를 획 득하여, 상기 획득한 포인트 클라우드 데이터 기반으로 생성된 실측 도면 데이터를 저장하고, 상기 저장된 실측 도면 데이터를 호출하여, 상기 호출된 도면 데이터에 포함된 적어도 하나 이상의 마킹 중 하나의 마킹을 선택하 고, 상기 선택된 마킹에 상응하는 현장 위치에 자동 시준 정보가 제공되도록 제어할 수 있다. 본 개시의 일 면에 따른 포인트 클라우드 데이터 기반 도면 서비스 데이터 및 자동 시준 기능을 제공하는 시스 템은, 단말; 및 상기 단말과 통신하여 신호를 주고받는 컴퓨팅 디바이스를 포함하되, 상기 컴퓨팅 디바이스는, 상기 단말의 요청에 따라, 포인트 클라우드 데이터를 획득하여, 상기 획득한 포인트 클라우드 데이터 기반으로생성된 실측 도면 데이터를 저장하고, 상기 저장된 실측 도면 데이터를 호출하여, 상기 호출된 도면 데이터에 포함된 적어도 하나 이상의 마킹 중 하나의 마킹을 선택하고, 상기 선택된 마킹에 상응하는 현장 위치에 자동 시준 정보가 제공되도록 제어하는 프로세서를 포함할 수 있다. 본 개시의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2022-0155314", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따르면, 다음과 같은 효과들을 가질 수 있다. 본 개시에 따르면, 실측 기반 도면으로 여러 공정에 치수 정보를 제공할 수 있는 효과가 있다. 본 개시에 따르면, 실측 기반 도면 작업 후, 누구나 손쉽게 자동 시준 기능에 기반하여 시공 현장에서 인간의 오류를 최소화하고 자동화를 통해 정확하고 빠른 3차원 계측 결과를 제공할 수 있는 효과가 있다. 본 개시에 따르면, 원 타임 세팅(One Time Setting), 공기 단축, 인건비 감소, 품질 보장 등을 통한 생산성을 향상시킬 수 있는 효과가 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0155314", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시의 개시가 완전하도록 하고, 본 개시가 속하는 기술 분야의 통상의 기술자에게 본 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 개시를 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 개시의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 개시가 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소들과의 상관관계를 용이하게 기술하기 위 해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작시 구성 요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤 집을 경우, 다른 구성요소의 \"아래(below)\"또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성 요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있 다. 이하, 첨부된 도면을 참조하여 본 개시의 실시예를 상세하게 설명한다. 본 명세서에서 본 개시에 따른 포인트 클라우드(Point Cloud) 기반 도면 서비스 제공 및 자동 시준 장치에는 연 산 처리를 수행하여 결과를 제공할 수 있는 다양한 장치들이 모두 포함된다. 예를 들어, 본 개시에 따른 도면 서비스 제공 및 자동 시준 장치는, 적어도 하나의 컴퓨터 또는 컴퓨팅 디바이스, 서버장치, 단말기 등을 모두 포함하거나 어느 하나의 형태가 될 수 있다. 여기에서, 상기 컴퓨터는 예를 들어, 웹 브라우저(Web Browser)가 탑재된 데스크톱(desktop), 랩톱(laptop), 태 블릿(Tablet) PC, 슬레이트(Slate) PC 등을 포함할 수 있다. 상기 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 어플리케이션 서버, 컴퓨팅 서버, 데이터베이스 서버, 파일 서버, 게임 서버, 메일 서버, 프록시 서버, 웹 서버 등을 포함할 수 있다. 상기 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선통신장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선통 신장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(HMD: Head-Mounted Device)와 같은 웨어러블 장치(wearable device)를 포함할 수 있다. 본 명세서에서 본 개시에 따른 포인트 클라우드 기반 도면 서비스 제공 및 자동 시준과 관련하여 정보 제공 제 어 모델(model)이 정의되거나 관련 플랫폼(platform)이 구축될 수 있는데, 그것은 빅데이터(big data)와 인공지 능(AI: Artificial Intelligence) 기술 기반의 컴퓨터에 의해 생성 및 제공될 수 있으며, 가상현실(Virtural Reality), 증강현실(Augmented Reality), 및 혼합현실(Mixed Reality)를 총칭하는 가상융합기술(eXtended Reality), 자동 시준 및 도면 서비스 제공 장치를 이용하는 사용자의 개인 정보의 보안을 위하여 블록체인 (Block-chain) 기술과 같은 ICT(Information and Communication Technology) 기술이 이용 또는 참조 결합되어 구현될 수 있다. 다만, 본 명세서에서는 이러한 ICT 기술에 대한 상세 설명은 공지기술을 참조하여 별도 설명은 생략한다. 본 명세서에서 기술되는 “포인트 클라우드”는 좌표계상에서의 데이터의 집합 특히, 3차원 공간 상에 퍼져 있 는 여러 포인트의 집합을 나타낼 수 있으며, 이러한 포인트 클라우드는 3차원 모델을 위하여 특히, 3차원 좌표 계(x, y, z)로 정의될 수 있다. 설명의 편의상, 본 명세서에서 포인트 클라우드를 획득하기 위한 과정 즉, 라이 다(Lidar) 센서, RGB-D 센서 등 3차원 측정 장비를 통해 포인트 클라우드를 생성하는 과정은 공지 기술을 참조 하고, 여기서 별도 상세 설명은 생략함을 미리 밝혀둔다. 도 1 은 본 개시의 일 실시 예에 따른 포인트 클라우드 기반 도면 서비스 제공 및 자동 시준 시스템을 도시 한 도면이다. 도 2는 도 1에 도시된 서버의 구성 블록도이다.본 개시의 일 실시예에 따른 포인트 클라우드 데이터 기반 도면 서비스 제공 및 자동 시준 시스템은, 단말 및 상기 단말과 통신하여 신호를 주고받는 컴퓨팅 디바이스를 포함하되, 상기 컴퓨팅 디바이스는, 상기 단말의 요 청에 따라, 포인트 클라우드 데이터를 획득하여, 상기 포인트 클라우드 데이터 기반으로 복수의 측정점을 생성 하고, 상기 복수의 측정점 사이의 거리 데이터를 획득하고, 상기 거리 데이터에 기반 실측 차수를 확인하여 실 측 데이터를 생성하여, 상기 실측 데이터에 기초하여 도면화 작업을 수행하여 도면 데이터를 제공하고, 상기 도 면 데이터 기반 자동 시준하는 프로세서를 포함할 수 있다. 도 1을 참조하면, 본 개시의 일 실시 예에 따른 포인트 클라우드 기반 도면 서비스 제공 및 자동 시준 시스템 은, 단말, 서버 및 DB을 포함하여 구현될 수 있다. 실시예에 따라서는, 포인트 클라우드 기반 도면 서비스 제공 및 자동 시준 시스템은, 도 1에 도시된 구성요 소 외에도 본 개시에 따른 동작 수행과 관련하여, 하나 또는 그 이상의 구성요소가 추가되어 구현될 수도 있다. 단말은, 전술한 단말기에 대응되는 구성으로, 서버에 의해 제공되는 포인트 클라우드 기반 도면 서비스 제공 및 자동 시준을 위한 플랫폼(이하, 편의상 ‘서비스 플랫폼’이라 함)을 액세스하고, 액세스한 서비스 플 랫폼 상에서 도면 서비스 및 자동 시준을 요청하기 위한 사용자 인터페이스를 제공할 수 있다. 단말은, 사용자 인터페이스에 따른 요청을 서버로 전송하고, 서버로부터 상기 요청에 대한 결과 즉, 도면 결과를 수신하여, 사용자에게 제공할 수 있다. 서버는 전술한 바와 같이, 서비스 플랫폼을 제공하여 본 개시에 따른 포인트 클라우드 기반 도면 서비스 제 공 및 자동 시준할 수 있다. 이러한 서버는 도 1의 시스템 내 다른 구성요소의 동작을 제어하는 구성요소로서, 컴퓨팅 디바이스 (computing device), 연산 프로세서, 처리 프로세서, 컨트롤러, 클라우드(Cloud) 서버 등 다양한 이름으로 불릴 수 있다. 서버는 단말을 통한 사용자의 요청에 대응하는 동작 즉, 연산, 처리 등 본 개시에 따른 포인트 클라우 드 기반 도면 서비스 제공 및 자동 시준을 위하여, 다양한 연산 프로세스를 수행하는 소프트웨어, 하드웨어 등 을 포함할 수 있다. 서버는 본 개시에 따른 도면 서비스 제공 및 자동 시준을 위하여, 대상체에 대한 스캐너(scanner)와 같은 외부 장치와 유, 무선으로 연결되어, 그에 의해 생성된 포인트 클라우드 데이터를 수집 또는 수신하여, 처리할 수 있다. 서버는 특히, 도 1의 시스템 내 단말에 의해 입력 또는 설정된 대상체에 대한 포인트 클라우드 기 반으로 3D 모델링(3-Dimensional modeling)을 수행하고, 도면 서비스 데이터 및/또는 자동 시준 결과 데이터를 생성하여 단말을 통하여 사용자(예를 들어, 관리자 등)에게 제공되도록 제어할 수 있다. DB는 서버에서 수집하거나 수신하는 데이터, 서버에서 처리되는 데이터 등을 일시 저장할 수 있다. 이러한 DB는 서버의 제어를 받아 데이터를 서버와 송수신할 수 있다. 실시예에 따라서, DB는 서버의 일 구성일 수도 있다. 도 2를 참조하면, 서버는 크게 메모리(memory)(미도시)와 프로세서를 포함하여 구성될 수 있다. 메모리는 내장 메모리일 수도 있고, 도 1의 DB에 해당할 수 있다. 프로세서는 통신모듈, 데이터수집모듈, 데이터처리모듈, 3D모델링모듈, 도면처리모듈 및 제어모듈을 포함하여 구성될 수 있다. 실시예에 따라서, 서버는 도 2에 도시된 구성요소 외에 하나 또는 그 이상의 구성요소를 더 포함하여 구현 될 수도 있다. 한편, 본 개시에 따른 서버는 도 2에 도시된 바에 한정되지 않으며, 도 2에 도시된 적어도 둘 이상의 구성이 하나의 모듈로 구현될 수도 있다. 통신모듈은, 단말 및 DB와 같은 도 1의 구성요소뿐만 아니라 외부(미도시)와의 통신 인터페이싱 환경을 지원할 수 있다. 이러한 통신 모듈은, 단말 또는 적어도 하나의 외부 소스(미도시)와의 통신을 가능하게 하는 적어도 나 이상의 구성 요소를 포함할 수 있는데 예를 들어, 유선통신모듈, 무선통신모듈, 근거리통신모듈, 위치정보모 듈 등 중 적어도 하나를 포함할 수 있다.상기에서, 유선통신모듈은, 지역 통신(Local Area Network; LAN) 모듈, 광역 통신(Wide Area Network; WAN) 모 듈 또는 부가가치 통신(Value Added Network; VAN) 모듈 등 다양한 유선 통신 모듈뿐만 아니라, USB(Universal Serial Bus), HDMI(High Definition Multimedia Interface), DVI(Digital Visual Interface), RS- 232(recommended standard-232), 전력선 통신, 또는 POTS(plain old telephone service) 등 다양한 케이블 통 신 모듈을 포함할 수 있다. 상기 무선통신모듈은 와이-파이(Wi-fi) 모듈, 와이브로(Wireless broadband) 모듈 외에도, GSM(global System for Mobile Communication), CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), UMTS(universal mobile telecommunications system), TDMA(Time Division Multiple Access), LTE(Long Term Evolution), 4G(eneration), 5G, 6G 등 다양한 무선통신 방식을 지원하는 무선통신모듈을 포함 할 수 있다. 상기 근거리통신모듈은 근거리 통신(Short range communication)을 위한 것으로서, 블루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근거리 통신을 지원할 수 있다. 상기 위치정보모듈은 예를 들어, 단말 위치(또는 현재 위치)를 획득하기 위한 모듈로서, 그의 대표적인 예 로는 GPS(Global Positioning System) 모듈 또는 Wi-Fi 모듈이 있다. 예를 들어, GPS 모듈을 활용하면, GPS 위 성에서 보내는 신호를 이용하여 단말의 위치를 획득할 수 있다. 다른 예로서, Wi-Fi 모듈을 활용하면, Wi- Fi 모듈과 무선 신호를 송신 또는 수신하는 무선 AP(Wireless Access Point)의 정보에 기반하여, 단말 위치 를 획득할 수 있다. 필요에 따라서, 위치정보모듈은 치환 또는 부가적으로 단말의 위치에 관한 데이터를 얻 기 위해 통신모듈의 다른 모듈 중 어느 기능을 수행할 수 있다. 위치정보모듈은 단말의 위치(또는 현 재 위치)를 획득하기 위해 이용되는 모듈로, 상기 단말의 위치를 직접적으로 계산하거나 획득하는 모듈로 한정되지는 않는다. 이러한 위치정보모듈은 단말에 내장되어 단말의 위치 정보를 서버에 제공할 수 도 있다. 데이터수집모듈은, 통신모듈을 통하여 외부(예를 들어, 스캐너 등)로부터 대상체에 대한 포인트 클라 우드 데이터를 수집(또는 수신)할 수 있다. 데이터처리모듈은, 데이터수집모듈에서 수집한 대상체의 포인트 클라우드 데이터를 3D 모델링을 위한 처리(또는 전처리) 동작을 수행할 수 있다. 3D모델링모듈은 데이터처리모듈을 통해 처리 또는 전처리된 데이터에 기반하여 3D 모델링 작업을 수 행할 수 있다. 도면처리모듈은 3D모델링모듈에서 수행된 3D 모델링 결과에 기반하여, 대상체에 대한 도면 서비스 데 이터를 생성할 수 있다. 제어모듈은 도면처리모듈에서 생성된 도면 서비스 데이터 기반 자동 시준을 관리 또는 제어할 수 있 다. 상기 자동 시준 기능은 제어모듈의 제어를 받아 다른 구성요소에서 수행될 수도 있다. 제어모듈은 서버를 구성하는 각 구성요소를 제어하여, 본 개시에 따른 포인트 클라우드 기반 도면 서 비스 제공 및 자동 시준 전 과정에 관여하여, 필요한 구성요소를 제어할 수 있다. 제어모듈은 단말에 생성된 대상체에 대한 도면 서비스 및 자동 시준 데이터를 전송하여, 사용자에게 제공하도록 제어할 수 있다. 제어모듈은 프로세서의 모든 구성요소들의 동작을 제어할 수 있으며, 그 과정에서 이용 가능한 다양한 알 고리즘(algorithm) 또는 알고리즘을 재현한 프로그램(program)에 대한 데이터를 저장하는 메모리, 및 상기 메모 리에 저장된 데이터를 이용하여 본 개시에 따라 대상체의 포인트 클라우드 기반 도면 서비스 제공 및 자동 시준 제어를 위한 다양한 동작을 수행할 수 있다. 도 1을 다시 참조하면, 단말은 서버에 의해 제공되는 서비스 플랫폼을 통해 사용자에게 도면 서비스 및 자동 시준 데이터를 제공함에 있어서, 어플리케이션(application) 또는 웹(web)을 통한 웹 서비스(web service) 형태로 제공할 수 있다. 단말에서 본 개시에 따라 대상체에 대한 포인트 클라우드 기반 도면 서비스 제공 및 자동 시준을 위한 서비 스 플랫폼을 이용할 수 있도록 지원하기 위해, 서버는 본 개시에 따른 다양한 데이터의 처리와 관련하여 알 고리즘이나 로직(logic) 또는/및 그에 관련된 API(Application Programming Interface)나 플러그-인(plug-in) 등을 단말에 제공할 수 있다. 도 3 내지 4는 본 개시의 일 실시예에 따른 치수 관리를 위한 거리 측정 방법을 설명하기 위해 도시한 도면이다. 도 3과 4는 본 개시의 일 실시예에 따른 치수 관리 방법을 설명하기 위해 도시한 도면이다. 종래에는 스캔(scan) 시, 획득한 점간 거리만 확인을 할 수 있을 뿐, 스캔 특성상 모서리 및 꼭지점의 점을 만 들 수 없었다. 또는, 종래 방식은 레이저(Laser)의 세기나 빛의 밝기에 따라 대상체(예를 들어, 구조물)의 위치 에 대한 오차가 존재하는데, 거리 측정은 모델링 이후에 이루어졌기에, 그러한 오차가 그대로 거리 측정에 포함 되는 문제점이 있었다. 반면, 도 3에 도시된 바와 같이, 서버는 포인트 클라우드 데이터로부터 3면을 선정한 후에, 3면이 만나는 꼭지점(311, 312)을 생성할 수 있으며, 이렇게 생성된 꼭지점간(311-312 사이) 거리를 측정하기에, 도 3의 (a) 와 같은 종래 기술에 비하여 매우 정확하게 거리를 측정할 수 있어, 치수를 정확하고 엄격하게 관리할 수 있다. 또한, 도 4에 도시된 바와 같이, 서버는 정확한 꼭지점 또는 모서리(411, 412, 421, 422, 431, 432)에서의 데이터를 제공하여, 꼭지점간 거리에 기초하여 예를 들어, 현장에서 2인으로 줄자로 실측하는 방법이나 종래 기 술을 개선할 수 있다. 도 4를 참조하면, 서버는 전체 형상을 가지고 있는 경우, 원하는 곳의 치수에 대해 실시간 확인할 수 있으며, 미 계측 구간 발생으로 인해 현장을 재방문하여 치수를 재측정할 필요도 없다. 본 개시의 일 실시예에서는, 3면이 만나는 꼭지점(예를 들어, 기준점)을 생성하기 위하여 먼저, 면 선택이 중요 한 바, 이러한 면 선택 시에 오차를 줄이기 위하여, 평면을 이루는 점들만 선택하여, 면을 만들게 하는 알고리 즘을 이용할 수 있다. 도 5 내지 10은 본 개시의 일 실시예에 따른 포인트 클라우드 데이터 기반 실측 도면화 프로세스를 설명하기 위 해 도시한 도면이다. 설명의 편의상, 본 개시는 도 5 내지 8의 도면의 순서대로 프로세스가 순차 진행되는 것을 일 실시예로 하나, 이에 한정되는 것은 아니다. 먼저, 도 5에서는 측정점 즉, 꼭지점 내지 측정 기준점을 생성하는 방법에 대해 기술한다. 예를 들어, 도 5는 전술한 알고리즘의 일 예시일 수 있다. 도 5의 (a)를 참조하면, 서버는 박스 안에 있는 포인트 클라우드를 이용하여 하나의 면을 선택할 수 있다. 실시예에 따라, 서버는 면 선택의 정확성 내지 정밀성을 높이기 위하여, 박스의 크기를 가변시킬 수 있다. 예를 들어, 서버는 박스의 크기를 가변시켜 복수의 포인트 클라우드(즉, 더 많은 포인트 클라우드)가 선택 되도록 제어할 수 있다. 한편, 서버는, 선택된 복수의 포인트 클라우드 중 임계치를 벗어난 포인트에 대해서는 이를 노이즈(noise) 로 정의하고, 면 선택을 위한 포인트 클라우드에서 제외할 수 있다. 서버는 선택된 포인트에 기초하여 평균 값을 산출하고, 산출된 평균값에 기초하여 평면을 선택할 수 있다. 서버는 전술한 과정을 각 면에 대해 반복 수행하여, 꼭지점 산출을 위해 필요한 적어도 2면이 만나는 평면 을 선택할 수 있다. 도 5의 (b)에서는 전술한 도 5의 (a)를 통해 선택된 특정 면에 대해 이를 식별 가능하도록 표시하기 위해 마크 가 도시되었다. 서버는 도 5의 (a)를 통해 산출된 평면에 대한 마크(예를 들어, 520)에 대하여, 식별자 정보를 부여할 수 있으며, 이러한 식별자 정보를 통해 추후 오차 보정이나 재선택 등에 참고할 수 있다. 이러한 마크는 해당 면이 꼭지점 산출을 위해 선택된 면들 중 하나라는 것을 가이드할 수 있다. 도 5의 (c)와 (d)에 도시된 바와 같이, 서버는 전술한 과정을 통하여 3개의 면(531-533)이 선택되면, 3면이 만나는 꼭지점을 생성할 수 있다. 이러한 꼭지점이 측정 포인트가 되는 것이다. 마찬가지로, 서버는 이렇게 생성된 꼭지점에 대해서도 식별자 정보를 부여할 수 있으며, 이 때 식별자 정보는 기준 3면 (또는 2면)에 대한 식별자 정보도 매핑하여, 추후 관리의 편리성을 기할 수 있다. 사용자는 이러한 식별자 정보 내지 식별자 정보의 매핑을 통해, 도 5를 통해 꼭지점이 생성되면, 면이나 꼭지점 중 적어도 하나를 선택하면, 매핑된 다른 정보도 함께 표시하여 식별의 편의성, 생성 작업에 대한 정보를 확인 할 수 있다. 서버는 도 5의 과정을 통하여, 적어도 2개의 꼭지점이 생성되면, 꼭지점간 거리를 측정하여, 치수 관리를 할 수 있다. 실시예에 따라, 서버는 복수의 꼭지점이 생성된 경우, 사용자에게 하나의 꼭지점이 선택되면, 이웃하는 꼭 지점에 대한 정보를 표시하여, 거리 측정을 위한 가이드를 제공할 수 있다. 한편, 꼭지점 간의 거리 측정은 반드시 이웃하는 꼭지점 사이에서만 이루어지지 않을 수 있다. 예를 들어, 제1 꼭지점과 제3 꼭지점 사이에 제2 꼭지점이 존재하는 경우, 서버는 사용자의 선택에 따라 제1 꼭지점과 제2 꼭지점이 아닌 제1 꼭지점과 제3 꼭지점 사이의 거리 측정도 가능하도록 서비스할 수 있다. 예컨대, 이를 통해 서버는 제1 꼭지점과 제2 꼭지점 그리고 제2 꼭지점과 제3 꼭지점 사이의 거리 측정 결과의 검증에 이용할 수도 있다. 서버는 도 5를 통해 복수의 꼭지점 데이터를 생성한 후에는, 도 6에 도시된 바와 같이, 실측 차수 (dimension)를 확인할 수 있다. 도 6과 7을 참조하면, 서버는 생성한 측정점을 이용하여 꼭지점간의 거리 측정 정보가 포함된 현장의 실측 정보 획득할 수 있다. 이 때, 생성된 측정점은 도면을 하기 위한 결합 포인트 또는 기준 포인트가 될 수도 있다. 서버는 실측 정보를 이용하여 BIM(Building Information Modeling)과 시공 데이터 사이의 오차 분석을 수 행할 수 있다. 서버는 오차 분석을 통하여 내부 마감재 치수 조절 또는 설치되는 장치의 위치 재설정 등에 대한 정보를 제 공할 수 있다. 서버는 도 5 내지 7을 통한 꼭지점 생성 및 실측 차수를 확인한 후, 실측 데이터 기반으로 도 8에 도시된 바와 같이, 자동 시준 및 도면화 작업을 수행할 수 있다. 도 8을 참조하면, 도 6의 실측 데이터를 기반으로 자동 시준 및 도면화 작업을 수행한 결과이다. 서버는 실측 데이터를 예를 들어, 선(line)으로 연결하여 도면화 작업을 수행할 수 있다. 서버는 BIM과 비교하여 시공되어야 할 포인트의 위치를 재설정할 수 있으며, 이후 위치 정보를 반영하거나 입력 작업을 진행할 수 있다. 서버는 도면화된 정보에 기초하여 현장 시공 포인트에 대한 자동 시준을 수행할 수 있다. 이러한 자동 시준 은 예를 들어, 사용자에 의한 단말로부터 자동 시준 기능 활성화에 의해 수행될 수 있다. 이 때, 서버 는 도면 기준으로 설치품의 위치 마킹을 시준하고, 마킹되어야 할 포인트를 시준할 수 있다. 서버는 도 8을 통해 실측 데이터 기반으로 도면화 작업을 수행한 결과, 도 9 내지 10과 같은 결과물을 생성 할 수 있다. 도 11은 본 개시의 일 실시예에 따른 실측 도면 데이터 기반 장치, 골조 등 설치 위치에 대한 자동 시준 기능을 설명하기 위해 도시한 도면이다. 도 12는 본 개시의 일 실시예에 따른 자동 시준 기능을 이용한 건설현장 모듈러 원 타임 세팅을 설명하기 위해 도시한 도면이다. 단말은 현장에서 도 11의 (a)와 같은 실측 도면화 설계 도면을 호출할 수 있다. 도 11의 (b)에 도시된 와 같이 장비를 이용하여 현물이 설치된 공간에 대한 기준점을 설정할 수 있다. 이는 예 를 들어, 실측 도면과 현장의 실제 공간 사이의 매칭을 통하여 설치 장소에 대한 자동 시준을 위한 사전 작업일 수 있다. 단말은 도 11의 (c)에 도시된 바와 같이, 상기 호출한 실측 도면상에 제공되는 적어도 하나 이상의 마킹 중 상기 현물을 설치할 마킹 선택 입력을 수신할 수 있다. 도 11의 (d)에 도시된 바와 같이, 상기 현물 설치 마킹 선택 입력에 상응하여 장비에서 자동 시준이 이루어질 수 있다. 즉, 장비는 레이저를 조사하여 현물이 설치될 공간 내 영역에 대하여 시준할 수 있다. 이 때, 상기 장 비는 적어도 설치될 현물의 에지(edge)에 해당하는 에지 영역에 대하여 시준할 수 있다. 따라서 현장에서 인력 이 없더라도 빠르고 정확하게 설치 장치의 그라운드를 시준할 수 있다. 이후, 현장에서는 도 11의 (e)에 도시된 바와 같이, 자동 시준된 위치에 먹 라인 마킹(line marking)을 표시할 수 있다. 도 11의 (e)를 참조하면, 먹 라인 마킹은 전술한 도 11의 (d)의 각 에지를 서로 연결하여 형성될 수 있다. 도 11의 (f)에서는, 설명의 편의를 위하여 먹 라인 마킹 위치에 가상으로 현물이 설치된 모습을 표시하였다. 도 11의 (a) 내지 (e) 과정을 통하여 설치할 현물 즉, 대상 장치에 대한 설치를 원 타임 세팅으로 완료할 수 있 다. 즉, 현장에서는, 별도의 추가 작업 없이 자동 시준 정보를 이용하여 한 번에 대상 장치를 정확한 위치에 설 치 완료할 수 있다. 추후, 단말은 서버에 요청하여, 설치에 대한 분석을 수행할 수 있다. 이러한 분석은 설치 과정에서 이 루어질 수도 있다. 도 12도 도 11과 동일하며 대상체만 상이하다. 도 12의 (a) 내지 (c)는 전술한 도 11의 (a) 내지 (c)와 대동소이한바, 전술한 내용을 참조하고, 중복 설명은 생략한다. 현장에서는, 도 12의 (d)에 도시된 바와 같이, 자동 시준(에지 시준)을 통하여 임베디드 플레이트(Embedded Plate)의 위치, 앵커 볼트(Anchor bolt)의 위치, 및 모듈러(Moduler)에 대한 정확한 설치 내지 시공을 통하여 정도 관리를 수행할 수 있다. 도 12의 (e)에서는, 현장에서 도 12의 (d)에서 자동 시준한 결과에 기초하여 실제 설치 내지 시공하는 모습을 도시한 것이다. 도 11과 같이, 도 12에서도 대상물의 차이가 있을 뿐, 실측 도면과 자동 시준 기능을 활용하여 원 타임 세팅을 진행할 수 있다. 도 13은 본 개시의 일 실시예에 따른 기준선 FL, 수직 라인, 직각 라인 자동 시준 기능을 설명하기 위해 도시한 도면이다. 도 13의 (a) 내지 (c) 역시 도 11의 (a) 내지 (c)와 대동소인한바, 전술한 내용을 참조하고, 중복 설명은 생략 한다. 현장에서는, 도 13의 (d)에 도시된 바와 같이, 각 컬럼(column)마다 정확한 F.L 기준선 및 수직 라인에 대해 자 동으로 시준 정보를 제공할 수 있다. 따라서, 각 칼럼에는 도 13의 (e)에 도시된 바와 같이, 자동 시준된 위치에 기준선 마킹이 이루어질 수 있다. 도 13의 (f)에서는, 도 13의 (d) 및 (e)를 통해 각 칼럼에 대해 기준선 마킹된 위치에 작업하는 것을 설명하기 위해 도시하였다. 따라서, 도 13을 참조하면, 현장에서 모든 공정(예를 들어, 타 업체 사이라도)에 대하여 자동 시준 정보에 기초 하여 동일한 기준선으로 작업을 수행할 수 있어 작업 시간을 단축하거나 공정을 단순화하여 효율을 높일 수 있 다. 도 14는 본 개시의 일 실시예에 따른 자동 시준 기능을 이용한 커튼월 원 타임 세팅을 설명하기 위해 도시한 도 면이다. 도 14의 (a) 및 (b)에 도시된 내용은, 도 11의 (a) 및 (c)에 도시된 내용과 대동소이한바, 그를 참조하고 여기 서 중복 설명은 생략한다. 다만, 도 14에서는 도 11의 (b)의 과정이 생략될 수 있으나, 이에 한정되는 것은 아니다. 현장에서는, 도 14의 (c)에 도시된 바와 같이, 장비를 이용하여 자동 시준 기능을 수행할 수 있으며, 이를 통해 구조물에 대한 수직 라인 및 각 층별 F.L 라인을 마킹할 수 있다. 도 14의 (d)에서는 전술한 도 14의 (c)와 구조물이 설치될 위치로, 이 역시 전술한 도 14의 (c)와 같이 장비를 이용하여 구조물이 설치될 위치에 대한 자동 시준을 수행하여 마킹할 수 있다. 도 14의 (e) 및 (f)에 도시된 바와 같이, 전술한 각 자동 시준 마킹 정보에 기초하여 커튼월 현장 골조에 맞게 맞춤 제작된 구조물을 제 위치에 설치할 수 있다. 도 14에서도 마찬가지로 자동 시준 기능을 이용하여 커튼월을 원 타임 세팅으로 시공할 수 있다. 도 15는 본 개시의 일 실시예에 따른 포인트 클라우드를 활용한 실측 데이터 기반 도면 서비스 데이터 제공 및 자동 시준 방법을 설명하기 위해 도시한 순서도이다. 도 15에서는, 서버에서 포인트 클라우드 데이터 기반 도면 서비스 데이터 제공 및 자동 시준하는 방법에 대 해 설명한다. 동작 S101에서, 서버는 포인트 클라우드 데이터를 획득할 수 있다. 동작 S103에서, 서버는 상기 포인트 클라우드 데이터 기반으로 복수의 측정점을 생성할 수 있다. 동작 S105에서, 서버는 상기 복수의 측정점 사이의 거리 데이터를 획득할 수 있다. 동작 S107에서, 서버는 상기 거리 데이터에 기반 실측 차수를 확인하여 실측 데이터를 생성할 수 있다. 동작 S109에서, 서버는 상기 실측 데이터에 기초하여 도면화 작업을 수행하여 도면 데이터를 제공 및 상기 실측 도면 데이터 기반 자동 시준할 수 있다. 서버는 상기 복수의 측정점을 생성하는 경우, 적어도 둘 이상의 면을 선택할 수 있다. 서버는 상기 면을 선택하는 경우, 하나 또는 그 이상의 포인트 클라우드들을 선택하기 위한 박스를 제공할 수 있으며, 상기 박스는 크기가 가변일 수 있다. 서버는 상기 선택된 포인트 클라우드를 이용하여 평균값을 계산하여 상기 각 면을 선택할 수 있다. 서버는 상기 선택된 포인트 클라우드들 중 임계치를 벗어난 포인트 클라우드는 노이즈로 정의할 수 있다. 서버는 상기 노이즈로 정의된 포인트 클라우드의 경우, 상기 선택된 포인트 클라우드를 이용하여 평균값을 계산 시 제외할 수 있다. 서버는 상기 거리 데이터에 기반 실측 차수를 확인하여 실측 데이터를 생성하는 경우, 상기 실측 데이터를 이용하여 BIM과 시공의 오차를 분석하는 단계를 포함할 수 있다. 서버는 상기 오차를 분석하는 경우, 상기 오차 분석 결과에 기초하여 대상체의 치수 조절 또는 위치를 재설 정할 수 있다. 이상 상술한 본 개시의 다양한 실시 예들 중 적어도 하나에 따른 본 개시에 따르면, 조선소, 건설 현장, 모듈러 공장, 외장 공사, 반도체 등과 같은 실측 기반 도면으로 여러 공정에 치수 정보를 제공할 수 있으며, 실측 기반 도면 작업 후 누구나 손쉽게 자동 시준 기능을 시공 현장에 도입하여 인간의 오류를 최소화하고 자동화를 통해 정확하고 빠른 3차원 계측 결과를 제공할 수 있어, 이를 통해 원 타임 세팅(One Time Setting), 공기 단축, 인 건비 감소, 품질 보장 등을 통한 생산성을 향상시킬 수 있다. 본 개시의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 개시가 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2022-0155314", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 개시의 실시예를 설명하였지만, 본 개시가 속하는 기술분야의 통상의 기술 자는 본 개시가 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다.부호의 설명 10: 단말 20: 서버 30: DB"}
{"patent_id": "10-2022-0155314", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 개시의 일 실시 예에 따른 포인트 클라우드 기반 도면 서비스 제공 및 자동 시준 시스템을 도시한 도면이다. 도 2는 도 1에 도시된 서버의 구성 블록도이다. 도 3과 4는 본 개시의 일 실시예에 따른 치수 관리를 위한 거리 측정 방법을 설명하기 위해 도시한 도면이다. 도 5 내지 10은 본 개시의 일 실시예에 따른 포인트 클라우드 데이터 기반 실측 도면화 프로세스를 설명하기 위 해 도시한 도면이다. 도 11은 본 개시의 일 실시예에 따른 실측 도면 데이터 기반 장치, 골조 등 설치 위치에 대한 자동 시준 기능을 설명하기 위해 도시한 도면이다. 도 12는 본 개시의 일 실시예에 따른 자동 시준 기능을 이용한 건설현장 모듈러 원 타임 세팅을 설명하기 위해 도시한 도면이다. 도 13은 본 개시의 일 실시예에 따른 기준선 FL, 수직 라인, 직각 라인 자동 시준 기능을 설명하기 위해 도시한 도면이다. 도 14는 본 개시의 일 실시예에 따른 자동 시준 기능을 이용한 커튼월 원 타임 세팅을 설명하기 위해 도시한 도 면이다. 도 15는 본 개시의 일 실시예에 따른 포인트 클라우드를 활용한 실측 데이터 기반 도면 서비스 데이터 제공 및 자동 시준 방법을 설명하기 위해 도시한 순서도이다."}
