{"patent_id": "10-2016-0157632", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0058535", "출원번호": "10-2016-0157632", "발명의 명칭": "여행자 쇼핑 서비스 시스템 및 그 방법", "출원인": "주식회사 크레인소프트웍스", "발명자": "양정원"}}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "여행지와 관련된 티켓 정보들을 저장하는 빅 데이터 저장부;여행자 단말기로부터 전송된 여행지에 대한 정보 및 상기 티켓 정보들을, 인공지능을 이용해 분석하여, 상기 여행지 방문 시 필요한 티켓 정보를 상기 여행자 단말기로 전송하며, 구매된 티켓에 대한 구매티켓정보를 상기 여행자 단말기로 전송하는 여행자 티켓 예약 서비스 제공부;구매된 티켓의 사용 요청이 온라인 상에서 수신되거나, 또는, 구매된 티켓의 정보가 판매자 단말기로 수신되면,상기 구매된 티켓의 사용을 승인하는 상품 구매 서비스 제공부;상기 여행자 단말기 및 상기 판매자 단말기와 통신을 수행하는 통신부; 및상기 빅 데이터 저장부, 상기 여행자 티켓 예약 서비스 제공부, 상기 상품 구매 서비스 제공부와 상기 통신부의기능을 제어하는 제어부를 포함하는 여행자 쇼핑 서비스 시스템."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 여행자 티켓 예약 서비스 제공부는,상기 여행자 단말기의 위치를 분석하며, 상기 티켓 정보들 중 상기 위치에 대응되는 티켓 정보를 상기 여행자단말기로 전송하는 여행자 쇼핑 서비스 시스템."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,협력사 단말기로부터 티켓 발행 요청이 수신되면, 상기 요청에 대응되는 티켓 정보를 생성하며, 생성된 티켓 정보를 상기 협력사 단말기의 관리자가 위치한 지역과 인접되어 있는 여행지를 방문하는 여행자들의 여행자 단말기들로 전송하는 실시간 티켓 발행 서비스 제공부를 더 포함하는 여행자 쇼핑 서비스 시스템."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 여행자 티켓 예약 서비스 제공부는 상기 협력사 단말기의 관리자가 위치한 지역과 인접되어 있는 여행지를방문하는 여행자들의 여행자 단말기들의 위치를 분석하며, 상기 실시간 티켓 발행 서비스 제공부는 상기 요청이 수신되기 전 또는 후에, 상기 협력사 단말기로 상기 여행자 단말기들의 위치 정보를 전송하는 여행자 쇼핑 서비스 시스템."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,여행자 단말기로부터 예약 가능한 판매자들의 리스트가 요청되면, 상기 여행자 단말기로 예약 가능한 판매자들의 리스트를 제공하고, 상기 여행자 단말기로부터 예약 요청이 수신되면 상기 예약 가능한 판매자가 이용하는판매자 단말기로 상기 예약 요청을 전송하고, 상기 판매자 단말기로부터 상기 예약 요청을 승인하는 정보가 수신되면 상기 여행자 단말기로 예약 확인 정보를 전송하는 실시간 슬롯 예약 서비스 제공부를 더 포함하는 여행자 쇼핑 서비스 시스템."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,공개특허 10-2018-0058535-3-상기 여행자 티켓 예약 서비스 제공부는 상기 예약 확인 정보를 수신한 상기 여행자 단말기의 위치를 분석하며,상기 실시간 슬롯 예약 서비스 제공부는, 상기 여행자 단말기의 위치 정보를 상기 예약 요청을 승인한 상기 판매자 단말기로 전송하는 여행자 쇼핑 서비스 시스템."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "여행지와 관련된 티켓 정보들을 저장하는 단계;여행자 단말기로부터 전송된 여행지에 대한 정보 및 상기 티켓 정보들을 인공지능을 이용해 분석하여, 상기 여행지 방문 시 필요한 티켓 정보를 상기 여행자 단말기로 전송하며, 구매된 티켓에 대한 구매티켓정보를 상기 여행자 단말기로 전송하는 단계; 및구매된 티켓의 사용 요청이 온라인 상에서 수신되거나, 또는, 구매된 티켓의 정보가 판매자 단말기로 수신되면,상기 구매된 티켓의 사용을 승인하는 단계를 포함하는 여행자 쇼핑 서비스 방법."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 여행자 단말기의 위치를 분석하며, 상기 티켓 정보들 중 상기 위치에 대응되는 티켓 정보를 상기 여행자단말기로 전송하는 단계를 더 포함하는 여행자 쇼핑 서비스 방법."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,협력사 단말기로부터 티켓 발행 요청이 수신되면, 상기 요청에 대응되는 티켓 정보를 생성하며, 생성된 티켓 정보를 상기 협력사 단말기의 관리자가 위치한 지역과 인접되어 있는 여행지를 방문하는 여행자들의 여행자 단말기들로 전송하는 단계를 더 포함하는 여행자 쇼핑 서비스 방법."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 협력사 단말기의 관리자가 위치한 지역과 인접되어 있는 여행지를 방문하는 여행자들의 여행자 단말기들의위치를 분석하는 단계; 및상기 요청이 수신되기 전 또는 후에, 상기 협력사 단말기로 상기 여행자 단말기들의 위치 정보를 전송하는 단계를 더 포함하는 여행자 쇼핑 서비스 방법."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7 항에 있어서,여행자 단말기로부터 예약 가능한 판매자들의 리스트가 요청되면, 상기 여행자 단말기로 예약 가능한 판매자들의 리스트를 제공하고, 상기 여행자 단말기로부터 예약 요청이 수신되면 상기 예약 가능한 판매자가 이용하는판매자 단말기로 상기 예약 요청을 전송하고, 상기 판매자 단말기로부터 상기 예약 요청을 승인하는 정보가 수신되면 상기 여행자 단말기로 예약 확인 정보를 전송하는 단계를 더 포함하는 여행자 쇼핑 서비스 방법."}
{"patent_id": "10-2016-0157632", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 예약 확인 정보를 수신한 상기 여행자 단말기의 위치를 분석하는 단계; 및,상기 여행자 단말기의 위치 정보를 상기 예약 요청을 승인한 상기 판매자 단말기로 전송하는 단계를 더 포함하는 여행자 쇼핑 서비스 방법."}
{"patent_id": "10-2016-0157632", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 목적은, 여행을 하고 있는 여행자에게, 여행자가 방문하고 있거나 또는 방문할 예정인 여행지에서 제 공되는 서비스와 관련된 티켓에 대한 정보를 제공할 수 있는, 여행자 쇼핑 서비스 시스템 및 그 방법을 제공하는 것이다. 이를 위해, 본 발명에 따른 여행자 쇼핑 서비스 시스템은, 여행지와 관련된 티켓 정보들을 저장하는 빅 (뒷면에 계속)"}
{"patent_id": "10-2016-0157632", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 여행을 하고 있는 여행자에게 쇼핑과 관련된 각종 정보를 제공해 줄 수 있는 여행자 쇼핑 서비스 시 스템 그 방법에 관한 것이다."}
{"patent_id": "10-2016-0157632", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어서, 산업의 발달로 인하여, 사람들이 많은 여유 시간을 갖게 됨에 따라, 취미생활로서 여행이 큰 부분 을 차지하고 있다. 또한, 세계 각국은 홍보 전쟁의 시대에 돌입하여, 산업뿐만 아니라 자국의 모든 자원을 상 품으로 인식하고, 이를 판매하기 위한 각고의 노력을 경주하고 있다. 여행지를 여행하는 여행자는 여행지에서 각종 서비스를 이용하며, 여행지에서 이루어지는 각종 행사에 참여할 수 있다. 그러나, 여행지가 낯설은 여행자 또는 여행지의 언어를 자유롭게 구사하지 못하는 여행자는 여행지에서 이루어 지는 각종 서비스를 원활하게 이용하지 못할 수 있다. 예를 들어, 여행지에서 제공되는 서비스를 이용하기 위해, 여행자는 티켓을 구매해야 한다. 그러나, 티켓의 구 매 경로를 정확하게 알지 못하는 여행자는 티켓을 구매하지 못해, 자신이 원하는 서비스를 제공 받지 못할 수도 있다. 또한, 여행지에서 제공되는 서비스를 미리 알지 못하는 여행자는, 여행지에서 자신이 원하는 서비스의 티켓을 구매하지 못해, 여행을 알차게 보내지 못할 수도 있다."}
{"patent_id": "10-2016-0157632", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기한 바와 같은 문제점을 해결하기 위해 제안된 본 발명의 목적은, 여행을 하고 있는 여행자에게, 여행자가 방문하고 있거나 또는 방문할 예정인 여행지에서 제공되는 서비스와 관련된 티켓에 대한 정보를 제공할 수 있는, 여행자 쇼핑 서비스 시스템 및 그 방법을 제공하는 것이다."}
{"patent_id": "10-2016-0157632", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 본 발명에 따른 여행자 쇼핑 서비스 시스템은, 여행지와 관련된 티켓 정보 들을 저장하는 빅 데이터 저장부; 여행자 단말기로부터 전송된 여행지에 대한 정보 및 상기 티켓 정보들을, 인 공지능을 이용해 분석하여, 상기 여행지 방문 시 필요한 티켓 정보를 상기 여행자 단말기로 전송하며, 구매된 티켓에 대한 구매티켓정보를 상기 여행자 단말기로 전송하는 여행자 티켓 예약 서비스 제공부; 구매된 티켓의 사용 요청이 온라인 상에서 수신되거나, 또는, 구매된 티켓의 정보가 판매자 단말기로 수신되면, 상기 구매된 티켓의 사용을 승인하는 상품 구매 서비스 제공부; 상기 여행자 단말기 및 상기 판매자 단말기와 통신을 수행하 는 통신부; 및 상기 빅 데이터 저장부, 상기 여행자 티켓 예약 서비스 제공부, 상기 상품 구매 서비스 제공부와 상기 통신부의 기능을 제어하는 제어부를 포함한다. 상술한 기술적 과제를 달성하기 위한 본 발명에 따른 여행자 쇼핑 서비스 방법은, 여행지와 관련된 티켓 정보들 을 저장하는 단계; 여행자 단말기로부터 전송된 여행지에 대한 정보 및 상기 티켓 정보들을 인공지능을 이용해 분석하여, 상기 여행지 방문 시 필요한 티켓 정보를 상기 여행자 단말기로 전송하며, 구매된 티켓에 대한 구매 티켓정보를 상기 여행자 단말기로 전송하는 단계; 및 구매된 티켓의 사용 요청이 온라인 상에서 수신되거나, 또 는, 구매된 티켓의 정보가 판매자 단말기로 수신되면, 상기 구매된 티켓의 사용을 승인하는 단계를 포함한다."}
{"patent_id": "10-2016-0157632", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 여행자는 자신이 방문하고 있거나 또는 방문할 예정인 여행지에서 제공되는 서비스를 미리 확인할 수 있으며, 상기 서비스와 관련된 티켓을 간편하게 구매할 수 있다."}
{"patent_id": "10-2016-0157632", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구 체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 본 발명의 구성요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이 러한 용어는 그 구성요소를 다른 구성요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기 재된 경우, 그 구성요소는 그 다른 구성요소에 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사 이에 또 다른 구성요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 도 1은 본 발명에 따른 여행자 쇼핑 서비스 시스템이 적용되는 통신 시스템의 구성을 나타낸 예시도이다. 본 발명에 따른 여행자 쇼핑 서비스 시스템이 적용되는 통신 시스템은, 도 1에 도시된 바와 같이, 여행을 계획하고 있거나 여행을 하고 있는 여행지와 관련된 티켓 정보들을 제공하는 본 발명에 따른 여행자 쇼핑 서비 스 시스템(이하, 간단히 서비스 시스템이라 함), 상기 서비스 시스템을 이용하여 여행지와 관련된 티켓 정보들을 수신하고자 하는 여행자가 이용하는 여행자 단말기, 상기 서비스 시스템을 통해 티켓을 판매 한 판매자가 이용하는 판매자 단말기 및 상기 서비스 시스템을 통해 티켓을 판매하고자 하는 협력사가 이용하는 협력사 단말기를 포함한다. 이하의 설명에서, 티켓은 상품권, 쿠폰 또는 일반적인 티켓 중 적어 도 어느 하나가 될 수 있다. 이하에서는, 도 1을 참조하여 본 발명의 전체적인 내용이 간단히 설명된다. 상기 서비스 시스템은 상기 여행자 단말기로 여행지 주변의 티켓을 보내주는 서비스를 제공한다. 상기 서비스 시스템은 여행자 단말기에서 실행되는 서비스앱으로 지역 화폐를 제공하는 서비스를 제공 할 수도 있다. 상기 서비스 시스템은 상기 협력사에 의해 운영되는 가맹점에서 스마트폰으로 읽혀지는 전자 쿠폰서비스를 제공할 수 있다. 여행자는 상기 서비스 시스템을 통해 티켓을 할인된 가격으로 구매할 수 있다. 여행자가 상기 여행자 단말기를 통해 상기 서비스 시스템으로 여행지들에 대한 정보를 전송하면, 상기 서비스 시스템은 상기 서비스 시스템에 의해 제공되는 서비스앱을 상기 여행자 단말기에 설치할 것 을 요청할 수 있다. 여행자가 상기 여행자 단말기에 상기 서비스앱을 설치한 후, 상기 서비스 시스템에 로그인하면, 상기 서비스 시스템은 상기 여행지들 주변에서 이용될 수 있는 티켓에 대한 정보(이하, 간단히 티켓 정보라 함) 를 상기 여행자 단말기로 전송한다. 여행자는 다양한 티켓 정보들을 확인한 후, 자신이 원하는 티켓을 상기 서비스 시스템을 통해 구매할 수 있 다. 상기 서비스 시스템은, 상기 여행자가 여행 전에 상기 여행지들에 대한 정보를 제공한 경우에는, 여행 전에 상기 티켓 정보들을 제공할 수 있다. 또한, 티켓 정보의 제공을 요청한 여행자가 여행지에서 여행을 하고 있는 경우, 상기 서비스 시스템은 상기 여행자 단말기의 위치 정보를 이용하여, 상기 여행지에서 이용될 수 있는 티켓 정보들을 제공할 수도 있다. 따라서, 여행자는 여행 전에 티켓을 미리 구매한 후 여행지에 상기 티켓을 이용하여 다양한 서비스를 제공 받을 수 있다. 여행지에서 대기시간 없이 인기 있는 서비스를 제대로 받기를 원하는 여행자는 상기 서비스 시스템을 통해, 예약 가능한 판매자들의 리스트를 확인할 수 있다. 또한, 상기 여행자는 상기 예약 가능한 판매자들 중 어느하나에 대해 슬롯 단위로 예약을 할 수도 있다. 여행자들이 몰리는 시즌에 매출을 올리기 위한 실시간 이벤트를 하고자 하는 협력사는, 상기 서비스 시스템(2 0)을 통해 상기 이벤트와 관련된 티켓을 발행할 수 있다. 예를 들어, 축제를 기획하는 협력사는 상기 서비스 시스템을 통해 실시간으로 티켓을 발행할 수 있으며, 이에 따라 수익을 얻을 수 있다. 상기한 바와 같이, 상기 서비스 시스템은 판매자들이 제공하는 티켓 정보를 여행자들에게 제공하며, 여행자 들은 상기 서비스 시스템을 통해 저렴한 티켓을 간편하게 구매할 수 있다. 또한, 각종 이벤트의 개최에 따른 티켓을 발행하고자 하는 협력사는 상기 서비스 시스템을 통해 티켓을 발 행할 수 있으며, 이에 따라, 많은 여행자들을 유도할 수 있다. 또한, 자신이 원하는 서비스를 미리 예약하고자 하는 여행자는 상기 서비스 시스템을 통해 예약 서비스를 이용할 수도 있다. 도 2는 본 발명에 따른 여행자 쇼핑 서비스 시스템의 구성을 나타낸 예시도이다. 상기 서비스 시스템은 인공지능(AI)을 이용하여 빅 데이터들을 각 사용자에 맞게 가공 및 처리할 수 있으며, 인공지능(AI)을 이용하여 각 사용자가 원하는 데이터들, 예를 들어, 여행자가 방문하고 있거나 또는 방 문할 예정인 여행지에서 제공되는 서비스와 관련된 티켓에 대한 정보들을 제공할 수 있다. 이를 위해, 상기 서비스 시스템은 빅 데이터 딥러닝 기술을 이용할 수 있으며, 이에 따라, 스마트 서비스를 제공할 수 있다. 여기서 스마트 서비스라는 의미는, 스마트폰의 스마트와, 빅 데이터 딥러닝 인공지능의 스마 트한 인식 능열을 합친 지능화 서비스를 의미한다. 빅 데이터 딥러닝 기술은 올림픽과 같은 거대 스포츠 이벤 트 관련 서비스를 스마트화하는 기술이 될 수 있으며, 일반 MICE 비즈니스에도 활용될 수 있다. 상기 서비스 시스템에 적용되는 인공지능이란, 인간과 유사하게 사고하는 컴퓨터 지능을 일컷는 포괄적 개 념이다. 상기 인공지능이 구현되기 위해서는, 머신러닝이 이용된다. 또한, 상기 머신러닝을 위해, 딥러닝 기 술이 적용될 수 있다. 즉, 상기 서비스 시스템은 머신러닝(Machin Learning)을 이용하여 인공지능 서비스를 제공할 수 있다. 상 기 머신러닝(Machine Learning)이란 데이터를 통해 컴퓨터를 학습시키거나, 컴퓨터가 스스로 학습하여 인공지능 의 성능(정확도, 속도, 응용범위 등)을 향상시키는 방법을 의미한다. 상기 딥러닝(Deep Learning)이란 인공신경망 이론을 기반으로, 인간의 뉴런과 유사한 입/출력 계층 및 복수의 은닉 계층을 활용하는 학습 방식이다. 상기 딥러닝은 복잡한 비선형 문제를 비(非)지도 방식 학습으로 해결하 는데 효과적이다. 상기 서비스 시스템은 딥러닝 이외에도 의사결정트리, 클러스터링 등 기타 다른 접근법들을 이용할 수 있다. 상기 서비스 시스템은, 상기 빅 데이터 기반 딥러닝 기술을 이용함으로써, 빅이벤트 참여자들의 이벤트 참 여 결정 과정에 대한 서비스를 제공할 수 있으며 또한, 참여자들에게 공항 도착, 이동, 숙박, 이벤트 티켓 예약, 쇼핑 등의 전 과정을 체계적으로 제공할 수 있다. 따라서, 본 발명을 이용하고자 하는 사용자는 기본적으로 스마트폰을 휴대하고 있으며, 상기 스마트폰을 통해 상기 서비스 시스템에 접속함으로써, 클라우드에 참여하고 각종 서비스를 제공받을 수 있다. 또한, 이하에서 설명되는, 상기 서비스 시스템을 구성하는 각 구성요소들 각각 역시, 상기 인공지능(AI)을 이용하여 각 사용자에게 최적화된 서비스를 제공할 수 있다. 본 발명에 따른 여행자 쇼핑 서비스 시스템은, 도 2에 도시된 바와 같이, 여행자 티켓 예약 서비스 제공부 , 상품 구매 서비스 제공부, 실시간 티켓 발행 서비스 제공부, 실시간 슬롯 예약 서비스 제공부 , 빅 데이터 저장부, 통신부(20a) 및 제어부(20b)를 포함한다. 첫 번째, 상기 빅 데이터 저장부는, 여행지와 관련된 티켓 정보들을 저장한다. 예를 들어, 상기 빅 데이터 저장부는, 여행지들에서 제공되는 다양한 티켓들에 대한 정보, 예를 들어, 티켓 정보들과 같은 빅 데이터들 을 저장한다. 이를 위해, 상기 빅 데이터 저장부는, 상기 여행자 티켓 예약 서비스 제공부로부터 전송된 티켓 정보들 을 저장할 수 있다. 상기 티켓에는, 놀이 시설의 이용 티켓, 호텔의 숙박을 위한 티켓, 관광 버스 또는 기차 등의 이용 티켓, 관광 지의 입장 티켓 등이 포함될 수 있다. 상기 티켓을 판매하는 자는 판매자라 한다. 상기 판매자는 상기 서비스 시스템의 관리자와 미리 업무 협약을 할 수 있다. 또한, 상기 서비스 시스템의 관리자와 업무 협약이 이루어지지 않은 판매자일지라도, 네트워크 등을 통해 상기 판매자가 판매하는 티켓이 구매될 수 있다면, 상기 서비스 시스템은 상기 판매자의 티켓과 관련된 티 켓 정보를 상기 빅 데이터 저장부에 저장한 후, 상기 여행자 티켓 예약 서비스 제공부를 통해 상기 티 켓 정보를 제공할 수 있다. 두 번째, 상기 여행자 티켓 예약 서비스 제공부는, 여행자 단말기로부터 전송된 여행지에 대한 정보 및 상기 티켓 정보들을 이용하여, 상기 여행지 방문 시 필요한 티켓 정보를 상기 여행자 단말기로 전송하며, 구매된 티켓에 대한 구매티켓정보를 상기 여행자 단말기로 전송한다. 상기 여행자 티켓 예약 서비스 제공부는, 상기 여행자 단말기의 위치를 분석하며, 상기 티켓 정보들 중 상기 위치에 대응되는 티켓 정보를 상기 여행자 단말기로 전송할 수 있다. 상기 여행자 티켓 예약 서비스 제공부의 기능은 구체적으로 다음과 같다. 여행자는 여행을 떠나기 전 또는 여행을 하는 도중에, 상기 서비스 시스템으로부터 상기 티켓 정보들을 제 공받을 수 있으며, 제공된 티켓 정보들을 확인한 후 원하는 티켓을 상기 서비스 시스템을 통해 구매할 수 있다. 상기 서비스 시스템은 상기 서비스앱으로 지역 화폐를 제공하는 서비스를 같이 제공할 수 있다. 상기 서비 스 시스템은 협력사에 의해 운영되는 가맹점에서 핸드폰으로 찍어 확인될 수 있는 전자 쿠폰 서비스를 제공 할 수도 있다. 상기 서비스 시스템에 의하면, 판매자는 여행자에게 미리 티켓을 판매할 수 있으므로 재고 관리 등을 통해 매출 증대 효과를 기대할 수 있다. 상기 서비스 시스템은 판매자에게로 이동하는 여행자에게 핀포인트 마케팅을 제공할 수 있다. 판매자는 예약 서비스를 통해 미리 티켓을 판매함으로써, 재고가 없어서 판매하지 못하는 경우를 방지할 수 있 으며, 따라서, 매출 증대를 기대할 수 있다. 판매자는 티켓 정보를 통한 판촉 활동을 할 수 있다. 일반적으로 티켓은 거주지 영역을 벗어나서는 이용되지 못한다. 그러나, 여행자는 상기 여행자 티켓 예약 서비 스 제공부를 통해 여행지에서 사용할 수 있는 티켓을 미리 구매함으로써, 여행 경비를 줄일 수 있다. 사용자는 상기 여행자 티켓 예약 서비스 제공부를 통해 티켓을 미리 구매할 수 있으며, 따라서, 여행을 가 서 구매해야 할 상품 또는 서비스를 확실하게 설정할 수 있다. 상기한 바와 같이, 여행자가 여행을 떠나기 전에, 상기 여행자 티켓 예약 서비스 제공부로 자신이 가고자 하는 여행지에 대한 정보를 전송하면, 상기 여행자 티켓 예약 서비스 제공부는 상기 여행지 주변에서 이용 될 수 있는 티켓들에 대한 티켓 정보들을 상기 여행자 단말기로 전송한다. 이 경우, 여행자는 상기 서비스앱을 자신의 여행자 단말기에 설치한 후, 자신이 원하는 티켓을 상기 여행자 티켓 예약 서비스 제공부를 통해 구매할 수 있다. 예를 들어서, 한국의 삼청동을 방문하고자 하는 외국인 여행자에게, 상기 여행자 티켓 예약 서비스 제공부 는, 삼청동 주변의 가맹점에서 제공하는 티켓들에 대한 티켓 정보들을 상기 외국인 여행자가 이용하는 여행자 단말기로 전송할 수 있다. 이 경우, 상기 외국인 여행자는 상기 티켓들 중 적어도 어느 하나를 미리 구매한 후, 삼청동을 방문할 수 있다. 또한, 상기 여행자 티켓 예약 서비스 제공부는, 상기 외국인 여행자가 이용하는 여행자 단말기를 통해 확인된 상기 외국인 여행자의 위치가 삼청동 주변이면, 상기 티켓 정보들을 제공할 수 있다. 즉, 상기 외국인 여행자는 삼청동을 직접 방문하고 있는 동안에 상기 티켓 정보들을 제공 받은 후 상기 티켓을 구매할 수 있다. 여행자는 상기 티켓을 이용하여 각종 상품을 실질적으로 구매하거나 시설물을 이용할 수 있다. 여행자가 상기 티켓을 구매하는 구체적인 방법은 다음과 같다. 예를 들어, 여행자가 상기 여행자 티켓 예약 서비스 제공부를 통해 티켓을 구매하면, 상기 티켓에 아이디가 할당되며, 상기 티켓에 할당된 아이디와, 상기 티켓을 구매한 여행자에 대한 정보가 매칭된다. 상기 과정을 통 해 매칭된 구매 정보는 상기 빅 데이터 저장부 또는 상기 여행자 티켓 예약 서비스 제공부에 저장된다. 상기 여행자 티켓 예약 서비스 제공부는 상기 구매 정보를 상기 여행자 단말기에서 실행되는 상기 서비 스앱으로 전송한다. 따라서, 여행자는 자신이 구매한 티켓을 눈으로 확인할 수 있다. 따라서, 구매된 티켓은, 상기 티켓을 구매한 여행자만이 확인할 수 있고, 상기 여행자만이 이용할 수 있다. 이 경우, 상기 티켓의 사용을 위한 비밀번호가 상기 구매 정보에 포함될 수도 있다. 그러나, 상기 여행자가 원한다면, 상기 티켓은 또 다른 여행자에게 양도될 수도 있다. 예를 들어, 여행자 단말기들 사이에서 근거리 통신, 예를 들어, NFC 통신을 통해 상기 구매 정보가 이동될 수도 있다. 따라서, 여행자에 의해 구매된 티켓은 또 다른 여행자에 의해 이용될 수 있다. 여행자가 상기 티켓을 구매하기 위해 현금으로 결제했으며, 티켓 구매 후 반품하고자 할 때, 반품이 받아들여지 지 않는다면 문제가 발생될 수 있다. 그러나, 여행자가 가상머니로 결제를 했다면, 반품거부의 문제로부터 자유로워 진질 수 있다. 이를 위해, 상기 서비스 시스템은, 본 출원인에 의해 출원된 출원번호 10-2015-0181975에 기재되어 있는 [여행자를 위한 금융 서비스 시스템 및 그 방법]을 이용할 수 있으며, 또한, 또 다른 가상머니 시스템을 이 용할 수 있다. 여행자가 가상머니로 티켓을 구매했다면, 상기 서비스 시스템은 반품 기간 종료 전에는 판매자에게 현금 지 급을 하지 않는다. 따라서, 판매자가 불합리하게 반품을 거절할 경우, 상기 서비스 시스템은 상기 판매자에게 현금을 지급하지 않음으로써, 구매자를 보호할 수 있으며, 따라서, 불합리한 반품거절이 근절될 수 있다. 세 번째, 상기 상품 구매 서비스 제공부는, 구매된 티켓의 사용 요청이 온라인 상에서 수신되거나, 또는, 구매된 티켓의 정보가 판매자 단말기로 수신되면, 상기 구매된 티켓의 사용을 승인한다. 상기 여행자 티켓 예약 서비스 제공부를 통해 티켓을 구매한 여행자는 여행지를 방문하는 중에, 상기 티켓 을 이용하여 실질적으로 물건을 구매하거나, 시설물 등을 이용할 수 있다. 상기 상품 구매 서비스 제공부 상기 티켓이 이용될 때, 상기 여행자 단말기의 위치 및 상기 티켓을 구 매한 여행자의 얼굴 인식을 통한 인증 과정을 수행할 수 있다. 티켓의 사용 방식은 온라인에서 사용되는 방식과 오프라인에서 사용되는 방식으로 나뉘어질 수 있다. 예를 들어, 티켓을 구매한 여행자는 온라인에서 상품을 직접 구매할 수도 있다. 즉, 여행자가 온라인 E- Commerce 서비스를 구매할 때에는 티켓을 이용해서 할인 혜택을 볼 수도 있다. 이 경우, 상기 상품 구매 서비 스 제공부는 상기 티켓이 이용되었음을 확인할 수 있다. 따라서, 상기 티켓이 불법적으로 재사용되는 것이 방지될 수 있다. 또한, 티켓을 구매한 여행자는 여행지에서 직접 판매자와 만난 후, 자신의 여행자 단말기에 저장된 상기 구 매 정보를 근거리 통신(예를 들어, NFC 통신)을 통해 상기 판매자가 이용하는 판매자 단말기로 전송할 수 있다. 이 경우, 상기 상품 구매 서비스 제공부는 상기 티켓이 이용되었음을 확인할 수 있다. 따라서, 상기 티켓 이 불법적으로 재사용되는 것이 방지될 수 있다. 그러나, 여행자는 티켓의 번호를 판매자에 제공함으로써, 상기 티켓을 이용할 수 있다. 상기 티켓의 번호를 제 공받은 판매자는 자신이 이용하는 판매자 단말기를 통해 상기 티켓의 번호를 상기 상품 구매 서비스 제공부로 전송한다. 상기 상품 구매 서비스 제공부는 상기 티켓의 번호가 정상적인 번호임을 인증한다. 따 라서, 판매자는 안심하고 물건을 판매할 수 있다. 본 발명에 의하면, 판매자와 여행자 모두, 스마트폰과 같은 단말기만 가지고 있으면 된다. 따라서, 판매자는 별도의 카드 리더를 구비할 필요가 없다. 여행자가 상기 티켓을 구매할 때, 자신의 얼굴 정보를 상기 여행자 티켓 예약 서비스 제공부 또는 상기 상 품 구매 서비스 제공부에 등록하면, 여행자가 판매자에 의해 운영되는 매장을 방문하는 것에 의해, 자동으 로 결제가 이루어질 수도 있다. 이 경우, 상기 매장에는 얼굴을 인식할 수 있는 장치들이 구비되어야 한다. 예를 들어, 호텔 숙박을 위한 티켓을 구매한 여행자가 자신의 얼굴 정보를 등록한 경우, 상기 호텔에서 상기 여 행자의 얼굴이 인식되면, 상기 상품 구매 서비스 제공부는 상기 여행자가 상기 티켓을 이용한 것으로 판단 할 수 있다. 이 경우, 상기 상품 구매 서비스 제공부는 상기 여행자가 이용하는 여행자 단말기의 위치를 추가적으로 확인할 수도 있다. 상기 상품 구매 서비스 제공부 또는 상기 여행자 티켓 예약 서비스 제공부는, 티켓을 구매한 여행자가 이용하는 여행자 단말기의 위치를 추적하여, 상기 여행자가 상기 티켓의 판매자의 매장 근처로 가고 있다는 것을 확인할 수 있다. 이 경우, 상기 상품 구매 서비스 제공부 또는 상기 여행자 티켓 예약 서비스 제공부는 상기 티켓을 판 매한 판매자가 이용하는 판매자 단말기로 상기 여행자가 상기 매장 근처로 가고 있다는 정보를 제공할 수 있다. 따라서, 예를 들어, 식당을 운영하는 판매자는 자신의 식당을 이용할 수 있는 여행자가 오고 있음을 확인할 수 있으며, 이에 따라, 음식을 제공할 준비를 미리 할 수 있다. 네 번째, 상기 실시간 티켓 발행 서비스 제공부는, 상기 협력사 단말기로부터 티켓 발행 요청이 수신되 면, 상기 요청에 대응되는 티켓 정보를 생성하며, 생성된 티켓 정보를 상기 협력사 단말기의 관리자가 위치 한 지역과 인접되어 있는 여행지를 방문하는 여행자들의 여행자 단말기들로 전송할 수 있다. 이 경우, 상기 여행자 티켓 예약 서비스 제공부가 상기 협력사 단말기의 관리자가 위치한 지역과 인접 되어 있는 여행지를 방문하는 여행자들의 여행자 단말기들의 위치를 분석할 수 있으며, 상기 실시간 티켓 발행 서비스 제공부는 상기 요청이 수신되기 전 또는 후에, 상기 협력사 단말기로 상기 여행자 단말기 들의 위치 정보를 전송할 수 있다. 상기 요청이 수신되기 전에, 상기 여행자 단말기들의 위치 정보를 수신한 상기 협력사 단말기의 관리자 는, 여행자들이 많다고 판단되면, 여행자들을 자신의 매장으로 유도하기 위해, 획기적인 가격 또는 조건으로 티 켓을 판매할 수 있다. 예를 들어, 상기 관리자는 얼마나 많은 여행객들이 자신의 매장의 주변에 있는지를 상기 협력사 단말기를 통해 확인할 수 있다. 이 경우, 상기 관리자는 티켓을 싸게 팔아서 많은 여행자들을 유인할 목적 또는 단순히 비즈니스 속도를 높이기 위한 목적으로, 상기 실시간 티켓 발행 서비스 제공부를 통해 티켓을 판매할 수 있다. 상기 실시간 티켓 발행 서비스 제공부를 통해 쿠폰이 발행되면, 상기 실시간 티켓 발행 서비스 제공부 는, 상기 관리자에 의해 운영되는 매장으로 시간상 접근 가능한 여행자들을 위주로, 상기 티켓이 발행되었음을 통지해 줄 수 있다. 상기 통지를 수신한 여행자는 상기 티켓을 구매한 후 상기 매장을 방문하여 상기 티켓을 이용할 수 있다. 이 경우, 티켓 구매와 함께 예약이 필요하다면, 여행자는 상기 실시간 티켓 발행 서비스 제공부 또는 상기 실시간 슬롯 예약 서비스 제공부를 통해 예약을 신청할 수 있다. 상기 요청이 수신된 후, 상기 여행자 단말기들의 위치 정보를 수신한 상기 협력사 단말기의 관리자는, 상기 여행자들의 숫자 등을 고려하여, 미리 여행자들을 마지할 준비를 할 수 있다. 다섯 번째, 상기 실시간 슬롯 예약 서비스 제공부는 여행자 단말기로부터 예약 가능한 판매자들의 리스 트가 요청되면, 상기 여행자 단말기로 예약 가능한 판매자들의 리스트를 상기 여행자 단말기로 제공한다. 상기 여행자 단말기로부터 예약 요청이 수신되면 상기 실시간 슬롯 예약 서비스 제공부는, 상기 예약 가능한 판매자가 이용하는 판매자 단말기로 상기 예약 요청을 전송한다. 상기 판매자 단말기로부터 상기 예약 요청을 승인하는 정보가 수신되면, 상기 실시간 슬롯 예약 서비스 제 공부는 상기 여행자 단말기로 예약 확인 정보를 전송한다. 이 경우, 상기 여행자 티켓 예약 서비스 제공부는 상기 예약 확인 정보를 수신한 상기 여행자 단말기의 위치를 분석하며, 상기 실시간 슬롯 예약 서비스 제공부는, 상기 여행자 단말기의 위치 정보를 상기 예 약 요청을 승인한 상기 판매자 단말기로 전송할 수 있다. 따라서, 상기 판매자 단말기를 이용하는 판 매자는 여행자들의 위치 및 인원수 등을 고려하여, 서비스를 제공할 준비를 할 수 있다. 예를 들어, 식당을 이용할 수 있는 티켓을 구매하였다고 하더라도, 여행지에서 실제로 식당을 방문한 경우, 식 당이 붐벼서, 한정된 시간 내에 식당을 이용하지 못하는 경우가 발생될 수 있다. 이를 방지하기 위해, 여행자는, 티켓을 구매한 후, 상기 실시간 슬롯 예약 서비스 제공부를 통해 자신이 티 켓을 이용할 구체적인 시간 등을 제시할 수 있으며, 이에 따라, 상기 티켓의 이용을 예약할 수 있다. 그러나, 모든 티켓에 대해 예약이 가능한 것이 아니므로, 상기 실시간 슬롯 예약 서비스 제공부는 예약이 가능한 판매자들의 리스트를 상기 여행자 단말기로 전송할 수 있다. 상기 실시간 슬롯 예약 서비스 제공부를 통해 예약한 여행자는 보다 더 확실하게 서비스를 즐길 수 있다. 또한, 판매자는 예약을 통해 미리 결제를 받을 수 있으며, 따라서, 비즈니스 효율을 높일 수 있다. 상기 실시간 슬롯 예약 서비스 제공부는 예약을 한 여행자의 위치 정보를 상기 판매자 단말기로 전송할 수 있다. 상기 예약은 다양한 방법으로 이용될 수 있다. 예를 들어, 여행자는 판매자가 지정한 날짜 이전에 예약할 수 있다. 보통 하루가 될 수 있다. 여행자가 티켓 구매 후 예약을 했기 때문에, 보다 더 할인된 가격으로 티켓을 구매할 수 있다. 티켓 구매와 함께 예약이 이루어진 경우, 여행자는 할인된 가격으로 티켓을 구매할 수 있다. 또한, 티켓을 구매한 후 예약 을 한 여행자는 할인된 가격만큼을 환불 받을 수 있다. 여행자는 현장 대기를 위한 예약을 할 수 있다. 이 경우, 여행자는 현장에 방문하여, 자신이 예약한 순서가 올 때까지 기다린다. 여행자는 네트워크에서 대기하다가 슬롯(Slot)이 비었을 경우 메시지를 받아서 예약을 할 수 있다. 대기자 리 스트는 판매자 및 여행자 모두에게 편의를 제공한다. 상기한 바와 같은 서비스는 한국처럼 예약 취소율이 높은 문화권에서는 더욱 유용하게 이용될 수 있다. 구체적인 예로서, 카센타 엔진오일 교환 서비스가 설명된다. 이 서비스의 경우 무료로 사용될 수 있는 서비스 이다. 상기 서비스는 여행자 및 판매자 모두에게 직접적인 패널티와 베니핏이 없는 서비스이다. 여행자는 특 정 체인의 엔진 오일 교환권을 구매하려 한다. 여행자는 엔진 오일 티켓을 검색하거나 상품 카테고리에서 선택 을 한다. 그러면, 엔진 오일 티켓 및 할인권이 화면에 출력된다. 여기서, 티켓들은 지역별로 필터링되거나 소 팅될 수 있다. 여행자는 티켓들 중에서 하나 이상을 구매한다. 상기 기능들은 앱 또는 웹을 통해 모두 구현될 수 있다. 예약할 때에 여행자는 주어진 조건하에서 상기 서비스 시스템에게 언제 어디서 예약이 가능하지 를 질문을 할 수 있다. 이 경우, 상기 서비스 시스템은 예약 가능한 카센터와 각 카센터별 슬롯의 리스트 를 여행자에게 제공을 한다. 제1단계는 예약 가능한 슬롯 리스트를 보는 단계이다. 여행자는 방문하고자는 하는 카센터를 지역별로 필터링 해서 선택을 좁힌다. 또는, 여행자는 예약 가능 시간별로 필터링을 해서 필터링된 정보들을 볼 수 있다. 제2단계는 방문 카센터를 검색 및 선택하는 단계이다. 여행자는 카센터 검색창에서 검색을 한다. 또는, 여행 자는 필터 옵션을 선택해서 필터링을 한다. 여행자는 방문 하고자는 카센터를 선택한다. 예약 장소는 카센터 선택에 따라 결정된다. 이 경우, 예약 시간만 전달이 되었고 예약하고자 하는 슬롯이 비어 있으면, 예매를 위 해서 여행자는 제3단계로 이동해서 예약을 진행한다. 만약에 장소만 파라미터로 전달이 되었으면 여행자는 제3 단계에서의 예약 가능 옵션을 보여주는 화면으로 이동하여 서비스를 제공받을 수 있다.제3단계는 예약을 선택하고 결제하는 단계이다. 실시간 슬롯 예약 서비스 제공부는 선택 옵션을 보여준다. 여행자는 예약 버튼을 누른다. 또는, 여행자는 대기자 리시트에 자신의 이름을 올려 놓고 대기 버튼을 누른다. 이에 따라, 예약이 상기 실시간 슬롯 예약 서비스 제공부에 등록된다. 제1 케이스로서, 정상적으로 예약이 이루어진 경우가 설명된다. 여행자는 예약을 한 이상, 판매자의 매장에 정 시에 도착할 것이 기대된다. 상기 실시간 슬롯 예약 서비스 제공부는 판매자가 선택한 옵션대로 SMS 또는 Email을 여행자 단말기로 전송할 수 있다. 예를 들어, 상기 실시간 슬롯 예약 서비스 제공부는 1주일 전 또는 하루전에 SMS를 보낼 수 있다. 메시지를 보냈을 경우 서비스 상태는 Notificaiton으로 변경된다. 메 시지가 전송되었으나, 여행자가 확인(Confirmation)을 8시간 내에 실행하지 않으면, 자동으로 확인 (Confirmation)이 될 수 있다. 만약, 여행자가 확인(Confirmation)을 하면 서비스 상태는 Confirmation으로 변경된다. 여행자가 동의를 하면, 여행자 단말기의 위치가 추적된다. 여행자가 이동을 하면, 상기 실시간 슬롯 예약 서비스 제공부로 여행자의 위치가 이동되었다는 정보가 수신된다. Confirmation이 되었으면 상 기 실시간 슬롯 예약 서비스 제공부는 여행자의 이동을 확인한 것만으로도 최종 에약을 확정할 수 있다. 이 경우, 여행자가 이동하는 것이 확인되었기에 서비스 상태 ID는 Moving으로 변경될 수 있다. 여행자가 매장 에 도착하면 서비스 상태가 도착으로 변경될 수 있다. 매장에 도착한 여행자는 사용자 단말기를 통해 티켓을 판매자에게 보여줄 수 있다. 스마트폰일 경우 RFID 스캔을 통해서 확인이 이루어질 수 있다. 서비스가 진행 중이면 서비스 상태는 서비스 중으로 변경될 수 있다. 서비스가 완료되면 서비스 상태는 완료 상태로 변경될 수 있다. 제2 케이스로서, 예약 취소 서비스가 설명된다. 제1 케이스와 다른 점은, 예약이 취소된다는 것이다. 취소에 는 두 가지 옵션이 있다. 하나는 Confirmation 상태 전에 취소가 이루어지는 것이며, 다른 하나는 Confirmation 이후에 취소가 이루어지는 것이다. 여행자가 Confirmation 이후에 취소를 하면 약정된 Cancel Fee를 지불해야 한다. 옵션에 따라 Cancel Fee가 없을 수도 있다. 취소가 발생한 시점에 곧바로 예약 슬롯이 비워질 수 있다. 사용자 선택에 따라 새로운 할인 티켓을 상기 서비스 시스템이 전송할 수도 있다. 만약 에, 이미 이동 중이거나, 도착이 늦은 여행자가 있을 경우 이러한 여행자를 위주로 슬롯이 채워질 수 있다. 다 른 대안으로, 상기 서비스 시스템은 대기자에게 예약 메시지를 보내서 슬롯을 채울 수 있다. 제3 케이스로서, 도착이 지연된 경우가 설명된다. 여행자의 도착이 지연된 경우, 상기 실시간 슬롯 예약 서비 스 제공부는 지연된 여행자를 현장 대기자 리스트에 등록시킬 수 있다. 또는, 지연된 여행자는 취소 패널 티를 물고 새로 등록을 할 수도 있다. 여섯 번째, 상기 통신부(20a)는 상기 여행자 단말기, 상기 판매자 단말기 및 상기 협력사 단말기와 통신을 수행하여, 각종 정보들을 송수신할 수 있다. 일곱 번째, 상기 제어부(20b)는 상기 여행자 티켓 예약 서비스 제공부, 상기 상품 구매 서비스 제공부, 상기 실시간 티켓 발행 서비스 제공부, 상기 실시간 슬롯 예약 서비스 제공부, 상기 빅 데이터 저장부 및 상기 통신부(20a)의 기능을 제어할 수 있다. 여덟 번째, 상기 서비스 시스템은 온라인 마켓 전환 서비스를 제공할 수 있다. 상기 온라인 마켓 전환 서비스는, 여행자가 매장을 보고 난 다음에 생각이 바뀌어서, 물건을 구매하고자 할 때, 여행자가 호텔에서 물건과 서비스를 구매하도록 할 수 있는 서비스이다. 상기 서비스를 이용하는 여행자는 상기 매장으로 다시 가지 않고서도, 온라인을 통해, 상기 매장에서 판매하는 상품을 구매를 할 수 있다. 이를 위해, 상기 매장에는 QR 코드 등을 사용해서 구매자가 쉽게 가게를 상기 서비스앱에 등록하도록 할 수 있 다. 상기 QR 코드 등을 등록한 여행자는 호텔에 돌아와서 온라인 쇼핑을 통해 상품을 구매할 수 있다. 매장의 관리자는 상기 서비스 시스템을 통해 온라인 가게를 무료로 열 수 있다. 배송지는 호텔, 공항, 또 는 해외의 자택, 직장이 될 수 있다. 우선, 판매자는 상기 서비스 시스템에 자신의 오프라인 매장을 등록한다. 이 경우, 온라인 매장도 자동으 로 등록된다. 판매자는 오프라인 매장에서 상품들을 판매하고, 상기 서비스 시스템에 상품들을 등록한다. 이 경우, 판매 자는 온라인 옵션 및 오프라인 옵션을 선택할 수 있다. 디폴트는 둘 다를 선택하는 것이다. 경우에 따라서는,오프라인 옵션 또는 온라인 옵션 중 어느 하나만이 선택될 수 있다. 이 경우, 상품의 공식 바코드 값도 등록된다. 여행자는 여행지에서의 임시 숙소를 상기 서비스시스템에 등록한다. 또한, 여행자는 돌아갈 항공편 또는 공항 을 등록할 수 있다. 여행자는 오프라인 매장에서 구매하고 싶은 상품에 대한 코드를 기록한다. 이 경우, 여행자는 상기 서비스앱을 이용해서 바코드 스캐닝을 할 수 있다. 이를 통해, 여행자는 상기 상품을 쇼핑 카트(Shopping Cart)에 등록할 수 있다. 상기 쇼핑 카트에 상품이 등록되었을 때, 오프라인 매장의 재고 관리 ㅅ시싯시스템은 재고 여부를 확인한다. 이를 위해서, 상기 서비스 시스템은 오프라인 매장의 재고 관리 시스템과 연동된다. 판매자는 가망 구매자의 쇼핑 카트 리스트에 등록된 재고 리스트를 갱신한다. 판매자는, 구매 단계에서의 판촉 을 위해서 적절한 재고 리스트를 갱신한다. 오프라인 매장을 떠난 구매자는 상기한 바와 같은 방법을 통해 온라인 상에서 상품을 구매한 후, 호텔, 공항 또 는 자택 등에서 상품을 전달 받을 수 있다. 아홉 번째, 상기 서비스 시스템은 여행지 식사 관리 서비스를 제공할 수 있다. 상기 여행지 식사 관리 서비스는 여행지에서 알러지 등의 식사 이슈를 해결해 줄 수 있다. 상기 여행지 식사 관리 서비스는, 유대인 또는 이슬람인들이 먹을 수 있는 음식인지를 확인해줄 수 있다. 상기 여행지 식사 관리 서비스는 필요에 따라 특수 수요를 위한 안내를 제공할 수 있다. 이를 위해, 상기 서비스 시스템은 메뉴와 메뉴의 재료 등을 상기 빅 데이터 저장부에 저장할 수 있다. 도 3은 본 발명에 따른 여행자 쇼핑서비스 방법의 일실시예 흐름도이다. 이하의 설명 중 도 1 및 도 2를 참조 하여 설명된 내용과 동일하거나 유사한 내용은 생략되거나 간단히 설명된다. 우선, 상기 서비스 시스템은 네트워크를 통해 수집된 티켓 정보들을 상기 빅 데이터 저장부에 저장한다 . 즉, 상기 서비스 시스템은 여행지와 관련된 티켓 정보들을 상기 빅 데이터 저장부에 저장한다. 다음, 상기 서비스 시스템은 상기 여행자 티켓 예약 서비스 제공부를 통해 티켓 예약 서비스를 제공한 다. 즉, 상기 서비스 시스템은 상기 여행자 단말기로부터 전송된 여행지에 대한 정보 및 상기 티켓 정보들 을 이용하여, 상기 여행지 방문 시 필요한 티켓 정보를 상기 여행자 단말기로 전송하며, 구매된 티켓에 대 한 구매티켓정보를 상기 여행자 단말기로 전송한다. 다음, 상기 서비스 시스템은 상기 상품 구매 서비스 제공부를 통해 상품 구매 서비스를 제공한다. 즉, 상기 서비스 시스템은 구매된 티켓의 사용 요청이 온라인 상에서 수신되거나, 또는, 구매된 티켓의 정 보가 판매자 단말기로 수신되면, 상기 구매된 티켓의 사용을 승인한다. 다음, 실시간으로 티켓을 발행하고자 하는 협력사는 상기 실시간 티켓 발행 서비스 제공부를 통해 실시간으 로 티켓을 발행할 수 있다. 마지막으로, 여행자는 상기 실시간 슬롯 예약 서비스 제공부를 통해, 실시간으로 슬롯을 예약할 수 있는 서 비스를 제공받을 수 있다. 이외에도, 상기 서비스 시스템은, 도 1 및 도 2를 참조하여 설명된 다양한 서비스를 제공할 수 있다. 이상에서, 본 발명의 실시예를 구성하는 모든 구성요소들이 하나로 결합되거나 결합되어 동작하는 것으로 설명 되었다고 해서, 본 발명이 반드시 이러한 실시예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모든 구성요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 이상에서 기재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성요소가 내재될 수 있음을 의미하는 것이므로, 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일 한 의미를 가진다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥 상의 의미와 일 치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2016-0157632", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 여행자 쇼핑 서비스 시스템이 적용되는 통신 시스템의 구성을 나타낸 예시도. 도 2는 본 발명에 따른 여행자 쇼핑 서비스 시스템의 구성을 나타낸 예시도. 도 3은 본 발명에 따른 여행자 쇼핑서비스 방법의 일실시예 흐름도."}
