{"patent_id": "10-2023-0132097", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0049134", "출원번호": "10-2023-0132097", "발명의 명칭": "CCTV 영상 분석 시스템 및 방법", "출원인": "한국전자기술연구원", "발명자": "양창모"}}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터에 의해 수행되는 방법에 있어서,복수의 CCTV로부터 수집된 영상을 대상으로 분석한 영상 분석 이벤트를 저장하는 단계;상기 영상 분석 이벤트를 상기 복수의 CCTV 및 타임라인을 기준으로 하는 다차원 형태로 영상 분석 이벤트 항목으로 출력하는 단계;사용자로부터 특정 영상 분석 이벤트에 대한 포커스 입력을 수신하는 단계; 및상기 포커스 입력에 대응하여 상기 영상 분석 이벤트 항목 내 상기 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임라인으로의 이동을 수행하는 단계를 포함하는,CCTV 영상 분석 방법."}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 영상 분석 이벤트를 상기 복수의 CCTV 및 타임라인을 기준으로 하는 다차원 형태로 영상 분석 이벤트 항목을 출력하는 단계는,상기 영상 분석 이벤트를 타임라인을 기준으로 하는 다차원 형태로 데이터베이스에 저장하는 것인,CCTV 영상 분석 방법."}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 복수의 CCTV로부터 수집된 영상을 대상으로 분석한 영상 분석 이벤트를 저장하는 단계는,상기 영상 분석 이벤트에 상응하는 CCTV의 식별정보 및 해당 영상의 URL 정보, 상기 영상 분석 이벤트의 시간정보를 포함하는 영상 분석 이벤트를 저장하되,상기 영상 분석 이벤트의 시간 정보는 상기 영상 분석 이벤트의 발생 시간 및 종료 시간, 상기 영상에서의 영상분석 이벤트 발생 시작 프레임 정보 및 종료 프레임 정보를 포함하는,CCTV 영상 분석 방법."}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 포커스 입력에 대응하여 상기 영상 분석 이벤트 항목 내 상기 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임라인으로의 이동을 수행하는 단계는,상기 포커스 입력이 상 또는 하로의 이동 입력인 경우, 현재 포커스된 영상 분석 이벤트와 동일 시간대에 발생한 이전 또는 이후 채널로의 영상 분석 이벤트로 포커스를 이동하는 것인,공개특허 10-2025-0049134-3-CCTV 영상 분석 방법."}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 포커스 입력에 대응하여 상기 영상 분석 이벤트 항목 내 상기 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임라인으로의 이동을 수행하는 단계는,상기 포커스 입력이 좌 또는 우로의 이동 입력인 경우, 현재 포커스된 영상 분석 이벤트와 동일 채널의 이전 또는 이후 영상 분석 이벤트로 포커스를 이동하는 것인,CCTV 영상 분석 방법."}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "복수의 CCTV로부터 촬영된 영상을 수신하는 통신부,상기 수집된 영상을 기반으로 영상 분석 이벤트를 분석하고, 상기 영상 분석 이벤트를 다차원 형태로 저장 및출력하기 위한 프로그램이 저장된 메모리 및상기 메모리에 저장된 프로그램을 실행시킴에 따라, 상기 수집된 영상을 대상으로 분석한 영상 분석 이벤트를저장하고, 상기 영상 분석 이벤트를 타임라인을 기준으로 하는 다차원 형태로 영상 분석 이벤트 항목으로 출력하며, 사용자로부터 특정 영상 분석 이벤트에 대한 포커스 입력을 수신함에 따라, 상기 포커스 입력에 대응하여영상 분석 이벤트 항목 내 상기 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임라인으로의 이동을 수행하는 프로세서를 포함하는,CCTV 영상 분석 시스템."}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 프로세서는 상기 영상 분석 이벤트를 타임라인을 기준으로 하는 다차원 형태로 데이터베이스에 저장하는것인,CCTV 영상 분석 시스템."}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는 상기 영상 분석 이벤트에 상응하는 CCTV의 식별정보 및 해당 영상의 URL 정보, 상기 영상 분석이벤트의 시간 정보를 포함하는 영상 분석 이벤트를 저장하되,상기 영상 분석 이벤트의 시간 정보는 상기 영상 분석 이벤트의 발생 시간 및 종료 시간, 상기 영상에서의 영상분석 이벤트 발생 시작 프레임 정보 및 종료 프레임 정보를 포함하는,CCTV 영상 분석 시스템."}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 프로세서는 상기 포커스 입력이 상 또는 하로의 이동 입력인 경우, 현재 포커스된 영상 분석 이벤트와 동공개특허 10-2025-0049134-4-일 시간대에 발생한 이전 또는 이후 채널로의 영상 분석 이벤트로 포커스를 이동하는 것인,CCTV 영상 분석 시스템."}
{"patent_id": "10-2023-0132097", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 프로세서는 상기 포커스 입력이 좌 또는 우로의 이동 입력인 경우, 현재 포커스된 영상 분석 이벤트와 동일 채널의 이전 또는 이후 영상 분석 이벤트로 포커스를 이동하는 것인,CCTV 영상 분석 시스템."}
{"patent_id": "10-2023-0132097", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 영상 분석 방법은 복수의 CCTV로부터 수집된 영상을 대상으로 분석한 영상 분석 이벤트를 저장하 는 단계; 상기 영상 분석 이벤트를 상기 복수의 CCTV 및 타임라인을 기준으로 하는 다차원 형태로 영상 분석 이 벤트 항목으로 출력하는 단계; 사용자로부터 특정 영상 분석 이벤트에 대한 포커스 입력을 수신하는 단계; 및 상 기 포커스 입력에 대응하여 상기 영상 분석 이벤트 항목 내 상기 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임 라인으로의 이동을 수행하는 단계를 포함한다."}
{"patent_id": "10-2023-0132097", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 CCTV 영상 분석 시스템 및 방법에 관한 것으로, 보다 구체적으로는 영상 분석 이벤트 항목을 다차원 형태로 저장 및 출력할 수 있는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0132097", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 실시간으로 입력되는 CCTV 영상을 분석하여, 재난, 재해, 사건, 사고와 같은 이벤트를 자동으로 인식하고 관제하는 지능형 CCTV 영상 분석 시스템 기술이 활발히 연구되고 있다. 종래의 지능형 CCTV 영상 분석 시스템에서는 CCTV 영상을 실시간으로 분석하여 이벤트를 감지한 후, 이러한 영 상분석 이벤트를 저장, 검색 및 표출하는 방식으로 운영되었다. 특히, 저장된 영상분석 이벤트를 관제사에게 표출할 때에는 관제사가 특정 CCTV를 선택하면 해당 CCTV에서 발생 한 영상분석 이벤트를 리스트 형태로 표시하거나, 관제사가 다량의 CCTV 영상에 대해 텍스트 쿼리를 기반으로 이벤트 검색을 수행하면 검색된 이벤트를 리스트 형태로 표출하는 방법이 주로 사용되었다. 그러나, 이러한 종래의 방법은 다량의 CCTV에서 발생한 영상분석 이벤트를 관제사가 한눈에 확인할 수 없는 단 점이 있어, CCTV 영상의 빠른 관제를 저해하는 원인이 되고 있다. 이로 인해 관제사가 빠른 대응을 제공하기 어 려우며, 중요한 이벤트를 놓치거나 늦게 인식할 가능성이 있다. 따라서, 관제사의 빠른 관제를 지원하기 위해서는 다량의 CCTV에서 발생한 영상분석 이벤트를 한눈에 확인하고 효과적으로 관리할 수 있는 새로운 형태의 CCTV 영상분석 이벤트 표현 방법이 필요합니다. 즉, 관제사에게 정보 를 시각적으로 보다 직관적으로 전달하며, 대량의 이벤트를 관리하면서도 빠르게 대응할 수 있는 기능을 제공할 필요가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1652856호 (2016.08.25)"}
{"patent_id": "10-2023-0132097", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 복수의 CCTV에 의해 촬영된 영상을 분석한 다수의 이벤트를 대상으로 다차원 형태의 리스트 로 출력함으로써 사용자가 용이하게 다수의 CCTV 및 시간에 따른 다수의 이벤트를 한눈에 확인하고 분석할 수 있도록 하는, CCTV 영상 분석 시스템 및 방법을 제공한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기 술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0132097", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 제1 측면에 따른 영상 분석 방법은 복수의 CCTV로부터 수집된 영상을 대상으로 분석한 영상 분석 이벤트를 저장하는 단계; 상기 영상 분석 이벤트를 상기 복수의 CCTV 및 타임라인을 기준으로 하는 다차원 형태로 영상 분석 이벤트 항목으로 출력하는 단계; 사용자로 부터 특정 영상 분석 이벤트에 대한 포커스 입력을 수신하는 단계; 및 상기 포커스 입력에 대응하여 상기 영상 분석 이벤트 항목 내 상기 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임라인으로의 이동을 수행하는 단계를 포 함한다. 본 발명의 일부 실시예에 있어서, 상기 영상 분석 이벤트를 상기 복수의 CCTV 및 타임라인을 기준으로 하는 다 차원 형태로 영상 분석 이벤트 항목을 출력하는 단계는, 상기 영상 분석 이벤트를 타임라인을 기준으로 하는 다 차원 형태로 데이터베이스에 저장할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 복수의 CCTV로부터 수집된 영상을 대상으로 분석한 영상 분석 이벤트를 저장하는 단계는, 상기 영상 분석 이벤트에 상응하는 CCTV의 식별정보 및 해당 영상의 URL 정보, 상기 영상 분 석 이벤트의 시간 정보를 포함하는 영상 분석 이벤트를 저장하되, 상기 영상 분석 이벤트의 시간 정보는 상기 영상 분석 이벤트의 발생 시간 및 종료 시간, 상기 영상에서의 영상 분석 이벤트 발생 시작 프레임 정보 및 종 료 프레임 정보를 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 포커스 입력에 대응하여 상기 영상 분석 이벤트 항목 내 상기 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임라인으로의 이동을 수행하는 단계는, 상기 포커스 입력이 상 또는 하로의 이동 입력인 경우, 현재 포커스된 영상 분석 이벤트와 동일 시간대에 발생한 이전 또는 이후 채널로의 영상 분 석 이벤트로 포커스를 이동할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 포커스 입력에 대응하여 상기 영상 분석 이벤트 항목 내 상기 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임라인으로의 이동을 수행하는 단계는, 상기 포커스 입력이 좌 또는 우로의 이동 입력인 경우, 현재 포커스된 영상 분석 이벤트와 동일 채널의 이전 또는 이후 영상 분석 이벤트로 포커스 를 이동할 수 있다. 또한, 본 발명의 일 실시예에 따른 영상 분석 시스템은 복수의 CCTV로부터 촬영된 영상을 수신하는 통신부, 상 기 수집된 영상을 기반으로 영상 분석 이벤트를 분석하고, 상기 영상 분석 이벤트를 다차원 형태로 저장 및 출 력하기 위한 프로그램이 저장된 메모리 및 상기 메모리에 저장된 프로그램을 실행시킴에 따라, 상기 수집된 영 상을 대상으로 분석한 영상 분석 이벤트를 저장하고, 상기 영상 분석 이벤트를 타임라인을 기준으로 하는 다차 원 형태로 영상 분석 이벤트 항목으로 출력하며, 사용자로부터 특정 영상 분석 이벤트에 대한 포커스 입력을 수 신함에 따라, 상기 포커스 입력에 대응하여 영상 분석 이벤트 항목 내 상기 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임라인으로의 이동을 수행하는 프로세서를 포함한다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는 상기 영상 분석 이벤트를 타임라인을 기준으로 하는 다차원 형태로 데이터베이스에 저장할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는 상기 영상 분석 이벤트에 상응하는 CCTV의 식별정보 및 해당 영상의 URL 정보, 상기 영상 분석 이벤트의 시간 정보를 포함하는 영상 분석 이벤트를 저장하되, 상기 영상 분 석 이벤트의 시간 정보는 상기 영상 분석 이벤트의 발생 시간 및 종료 시간, 상기 영상에서의 영상 분석 이벤트 발생 시작 프레임 정보 및 종료 프레임 정보를 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는 상기 포커스 입력이 상 또는 하로의 이동 입력인 경우, 현재 포커스된 영상 분석 이벤트와 동일 시간대에 발생한 이전 또는 이후 채널로의 영상 분석 이벤트로 포커스를 이 동할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는 상기 포커스 입력이 좌 또는 우로의 이동 입력인 경우, 현재 포커스된 영상 분석 이벤트와 동일 채널의 이전 또는 이후 영상 분석 이벤트로 포커스를 이동할 수 있다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2023-0132097", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 일 실시예에 의하면, 다량의 CCTV 카메라로부터 발생하는 데이터를 효율적으로 관리하고 시각 화할 수 있으며, 이를 통해 관제사는 여러 화면을 동시에 모니터링하고 이벤트를 실시간으로 추적하는 대신, 한 화면에서 다량의 CCTV 이벤트를 다차원 형태로 표시하여 더욱 직관적으로 이해할 수 있다. 이로써 관제사의 시 야가 덜 번잡해지고, 복잡한 환경에서의 작업 부담이 줄어들어 피로도가 감소하는 장점이 있다. 또한, 본 발명의 일 실시예는 실시간으로 발생하는 이벤트를 빠르게 감지하고, 그 정보를 사용자에게 시각적으 로 효과적으로 전달할 수 있다. 관제사는 이벤트를 신속하게 인식하고 필요한 조치를 더 신속하게 취할 수 있으 며, 사건이나 재난의 확산을 미연에 방지할 수 있다. 이로써 관제 작업의 효율성과 빠른 응답 시간이 향상될 수 있다. 또한, 본 발명의 일 실시예는 저장된 이벤트 데이터를 효과적으로 관리하고 시각화할 수 있으며, 관제사는 과거 에 발생한 재난, 재해, 사건 또는 사고와 관련된 정보를 빠르게 검색하고 분석할 수 있다. 이러한 능력은 사전 조사, 사건 재현, 증거 수집 및 정확한 결정을 지원하며, 관제사가 중요한 정보에 빠르게 접근하여 관리할 수 있도록 한다."}
{"patent_id": "10-2023-0132097", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0132097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하에서는 도 1을 참조하여 본 발명의 일 실시예에 따른 CCTV 영상 분석 시스템에 대해 설명하도록 한다. 도 1은 본 발명의 일 실시예에 따른 CCTV 영상 분석 시스템의 구성을 도시한 블록도이다. 본 발명의 일 실시예에 따른 CCTV 영상 분석 시스템은 입력부, 통신부, 표시부, 메모리 및 프로세서를 포함한다. 이때, 본 발명에서의 CCTV 영상 분석 시스템은 VMS일 수 있다. 입력부는 CCTV 영상 분석 시스템의 사용자 입력에 대응하여 입력데이터를 발생시킨다. 이때, 사용자 입력은 각 CCTV에 의해 촬영된 영상에 대한 선택 입력, CCTV 영상 분석 결과인 영상 분석 이벤트가 다차원으로표출된 영상 분석 이벤트 항목 내의 이동 입력, 그밖에 생성된 CCTV 영상 재생 목록을 기반으로 하는 영상 재생, 일시 정지, 영상 정보 요청, 종료 등의 제어 입력을 포함할 수 있다. 입력부는 적어도 하나의 입력수단을 포함한다. 입력부는 키보드(key board), 키패드(key pad), 돔 스 위치(dome switch), 터치패널(touch panel), 터치 키(touch key), 마우스(mouse), 메뉴 버튼(menu button) 등 을 포함할 수 있다. 통신부는 복수의 CCTV와 데이터를 송수신하며, 그밖에 데이터를 송수신하기 위해 서버나 데이터 수집 장치 등 외부장치와의 통신을 수행한다. 이와 같은 통신부는 유선 통신 모듈 및 무선 통신 모듈을 모두 포함할 수 있다. 유선 통신 모듈은 전력선 통신 장치, 전화선 통신 장치, 케이블 홈(MoCA), 이더넷(Ethernet), IEEE1294, 통합 유선 홈 네트워크 및 RS-485 제어 장치로 구현될 수 있다. 또한, 무선 통신 모듈은 WLAN(wireless LAN), Bluetooth, HDR WPAN, UWB, ZigBee, Impulse Radio, 60GHz WPAN, Binary-CDMA, 무선 USB 기술 및 무선 HDMI 기술, 그밖에 5G(5th generation communication), LTE-A(long term evolution-advanced), LTE(long term evolution), Wi-Fi(wireless fidelity) 등의 기능을 구현하기 위한 모듈로 구성될 수 있다. 표시부는 CCTV 영상 분석 시스템의 동작에 따른 표시 데이터를 표시한다. 일 예로 표시부는 다 차원 형태의 영상 분석이벤트 항목, 검출된 객체 목록, 추적 중인 객체 목록, 이들의 히스토리 목록, CCTV 영상 재생 목록, 그리고 CCTV 영상 및 CCTV 영상 재생 목록에 기반한 CCTV 영상을 화면 상에 표시할 수 있다. 표시부는 액정 디스플레이(LCD; liquid crystal display), 발광 다이오드(LED; light emitting diode) 디 스플레이, 유기 발광 다이오드(OLED; organic LED) 디스플레이, 마이크로 전자기계 시스템(MEMS; micro electro mechanical systems) 디스플레이 및 전자 종이(electronic paper) 디스플레이를 포함한다. 표시부 는 입력부와 결합되어 터치 스크린(touch screen)으로 구현될 수 있다. 메모리는 수집된 영상을 기반으로 영상 분석 이벤트를 분석하고, 영상 분석 이벤트를 다차원 형태로 저장 및 출력하기 위한 프로그램들을 저장한다. 여기에서, 메모리는 전원이 공급되지 않아도 저장된 정보를 계 속 유지하는 비휘발성 저장장치 및 휘발성 저장장치를 통칭하는 것이다. 예를 들어, 메모리는 콤팩트 플래 시(compact flash; CF) 카드, SD(secure digital) 카드, 메모리 스틱(memory stick), 솔리드 스테이트 드라이 브(solid-state drive; SSD) 및 마이크로(micro) SD 카드 등과 같은 낸드 플래시 메모리(NAND flash memory), 하드 디스크 드라이브(hard disk drive; HDD) 등과 같은 마그네틱 컴퓨터 기억 장치 및 CD-ROM, DVD-ROM 등과 같은 광학 디스크 드라이브(optical disc drive) 등을 포함할 수 있다. 프로세서는 프로그램 등 소프트웨어를 실행하여 CCTV 영상 분석 시스템의 적어도 하나의 다른 구성요 소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있 다. 프로세서는 영상 분석에 따른 영상 분석 이벤트를 다차원 형태로 저장하고, 이를 다차원 형태로 영상 분석 이벤트 항목으로 출력하며, 사용자의 선택 입력(이하, 포커스 입력)에 따라 영상 분석 이벤트 항목 내 이동을 통해 해당 이벤트를 선택한다. 한편, 본 발명의 일 실시예에서, 프로세서는 이벤트 분석 등을 위해, 인공지능(Artificial Intelligence) 알고리즘으로서 기계학습, 신경망 네트워크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용할 수 있다. 일 예로, 인공지능(Artificial Intelligence) 알고리즘으로서 기계학습, 신경망 네트워크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용할 수 있으며, 신경망 네트워크의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network)과 같은 모델 을 포함할 수 있다. 이하에서는 본 발명의 일 실시예에 따른 CCTV 영상 분석 시스템에 의해 수행되는 방법에 대해 설명하도록 한다. 도 2는 본 발명의 일 실시예에 따른 영상 분석 이벤트를 저장하는 단계를 설명하는 순서도이다. 먼저, 복수의 CCTV가 동작을 시작함에 따라 각각 영상을 실시간으로 촬영한다(S110). 복수의 CCTV는 여러 장소 및 위치에 설치되어 있으며, 각각의 감시 영역에서 발생하는 사건, 상황을 촬영한다. 다음으로, 재해, 재난 또는 사건, 사고와 관련한 이벤트가 발생하였는지 여부를 검출하기 위해 복수의 CCTV로부 터 수신한 영상을 분석한다(S120). 일 예로, 컴퓨터 비전, 딥러닝 알고리즘 등을 이용하여 영상 내 움직임, 물 체 감지, 패턴 인식 등을 통해 재난, 재해, 사건 또는 사고와 관련된 이벤트를 감지한다. 본 발명에서는 감지된이벤트를 영상 분석 이벤트라 한다. 다음으로, 이벤트 분석 결과 영상 분석 이벤트가 발생하였는지 여부를 판별하고(S130), 판별 결과 영상 분석 이 벤트가 감지되지 않은 경우에는 사용자의 종료 입력이 있었는지 여부를 판별하며(S140), 종료 입력이 있는 경우 영상 분석 이벤트의 데이터베이스로의 저장 과정을 종료한다. 이와 달리, 판별 결과 영상 분석 이벤트가 감지된 경우, 해당 영상 분석 이벤트의 상세 정보를 데이터베이스에 기록한다(S150). 이때, 프로세서는 영상 분석 이벤트에 상응하는 CCTV의 식별 정보 및 해당 영상의 URL 정 보, 영상 분석 이벤트의 시간 정보, 이벤트 종류 정보를 포함시킬 수 있다. 여기에서 영상 분석 이벤트의 시간 정보는 영상 분석 이벤트의 발생 시간 및 종료 시간(또는 영상 분석 이벤트의 지속 시간), 영상에서의 영상 분 석 이벤트 발생 시작 프레임 정보 및 종료 프레임 정보(또는 저장된 CCTV 영상을 기준으로 영상 분석 이벤트가 발생 또는 종료된 상대적 시간)를 포함할 수 있다. 이때, 프로세서는 영상 분석 이벤트를 데이터베이스에 저장시 다차원 형태로 이벤트 정보를 저장할 수 있 다. 일 실시예로, 다차원은 복수의 CCTV의 식별 정보와 복수의 영상 분석 이벤트의 타임라인을 구성 요소로 포 함할 수 있다. 이후, 사용자의 종료 입력이 있었는지 여부를 판별하며(S140), 종료 입력이 있는 경우 영상 분석 이벤트의 데이 터베이스로의 저장 과정을 종료한다. 도 3은 본 발명의 일 실시예에서의 영상 분석 이벤트 항목을 출력하는 과정을 설명하는 순서도이다. 도 4는 본 발명의 일 실시예에서 다차원 형태의 영상 분석 이벤트 항목을 표시한 일 예시를 도시한 도면이다. 먼저, 데이터베이스로부터 기 분석된 복수의 영상 분석 이벤트를 획득한다(S210). 전술한 바와 같이 영상 분석 이벤트 상에는 CCTV 식별자, 이벤트 발생 시간 정보, 이벤트 종류 정보 등이 포함될 수 있다. 다음으로, 영상 분석 이벤트를 복수의 CCTV 및 타임라인을 기준으로 하는 다차원 형태로 영상 분석 이벤트 항목 으로 출력한다(S220). 본 발명의 일 실시예는 영상 분석 이벤트를 타임라인을 가로축으로 하고 CCTV 식별 번호(또는 이름)를 세로축으 로 하는 영상 분석 이벤트 항목을 출력하거나, 반대로 CCTV 식별 번호를 가로축으로 하고 타임라인을 세로축으 로 하는 영상 분석 이벤트 항목을 출력할 수 있다. 이때, 본 발명의 일 실시예는 타임라인을 기준으로 영상 분석 이벤트를 표현하는 영상 분석 이벤트 항목의 경우, 이벤트가 발생하지 않은 구간에 대해서는 이벤트 발생 없음을 그래픽 또는 텍스트로 표현 가능하다. 또한, 본 발명의 일 실시예는 타임라인을 기준으로 영상 분석 이벤트를 표현시, 이벤트가 발생한 구간에 대해서 는 이벤트에 대한 간단 또는 상세 정보를 을 그래픽 또는 텍스트로 표현할 수 있다. 또한, 특정 이벤트에 대한 포커스를 통해 영상 분석 이벤트의 상세 정보를 확인할 수 있다. 다음으로, 사용자로부터 특정 영상 분석 이벤트에 대한 포커스 입력을 수신한다(S230). 그리고 포커스 입력에 대응하여 상기 영상 분석 이벤트 항목 내 복수의 CCTV로의 이동 또는 단일 CCTV 내 타임라인으로의 이동을 수행 한다(S240). 일 실시예로, 사용자의 포커스 입력이 '상'으로 판별시, 현재 포커스 영상 분석 이벤트와 동일 시간 대에 발생 한 이전 채널의 이벤트로 포커스를 이동시킨다(S241). 해당 포커스 이동이 완료된 후 다시 S230 단계로 되돌아 간다. 일 실시예로, 사용자의 포커스 입력이 '하'로 판별시, 현재 포커스 영상 분석 이벤트와 동일 시간 대에 발생한 이후 채널의 이벤트로 포커스를 이동시킨다(S242). 해당 포커스 이동이 완료된 후 다시 S230 단계로 되돌아간다. 일 실시예로, 사용자의 포커스 입력이 '좌'로 판별시, 현재 포커스 영상 분석 이벤트와 동일 채널의 이전 영상 분석 이벤트로 포커스를 이동시킨다(S243). 해당 포커스 이동이 완료된 후 다시 S230 단계로 되돌아간다. 일 실시예로, 사용자의 포커스 입력이 '우'로 판별시, 현재 포커스 영상 분석 이벤트와 동일 채널의 이후 영상 분석 이벤트로 포커스를 이동시킨다(S244). 해당 포커스 이동이 완료된 후 다시 S230 단계로 되돌아간다. 일 실시예로, 사용자의 입력이 '재생' 또는 '선택'으로 판별시, 현재 포커스된 영상 분석 이벤트에 해당하는 영 상을 재생한다(S245). 이때, 현재 포커스된 영상 분석 이벤트에 해당하는 영상 재생을 위해서는 현재 포커스된영상 분석 이벤트와 관련하여 데이터베이스의 CCTV 영상 URL 및 영상 분석 이벤트의 시간 정보가 사용될 수 있 다. 한편, 영상 재생시 Trick Play(Play, Pause, Fast Forward, Rewind, Stop)를 지원할 수 있다. 해당 영상 재생이 완료된 후에는 다시 S230 단계로 되돌아간다. 한편, 본 발명의 일 실시예에서 다차원 형태의 타임라인 및 CCTV 채널 정보를 기반으로 하는 2차원 형태로 설명 하였으나 반드시 이에 한정되는 것은 아니다. 즉, 타임라인과 CCTV 채널 정보를 각 축으로 설정한 후 장소, 이 벤트 중요도 등을 별도의 축으로 구성하여 영상 분석 이벤트 항목을 저장 및 출력할 수 있다. 또한, 본 발명의 일 실시예는 타임라인과 CCTV 채널 정보를 단순히 출력하는 것이 아니라, 각 영상 분석 이벤트 가 차지하는 시간 정보의 비율에 기초하여 영상 분석 이벤트 항목 내 각 영상 분석 이벤트의 포지션 및 크기 정 보를 가변하여 운영할 수 있다. 예를 들어, 도 4에서 CCTV 3의 연기 이벤트 또는 화재 이벤트가 전체 영상 분석 이벤트 중 가장 긴 타임라인을 갖으므로, 해당 이벤트의 크기가 타 영상 분석 이벤트 대비 비율적으로 더 크게 설정하여 표시할 수 있다. 영상 분석 이벤트 항목 내 각 영상 분석 이벤트의 정보는 썸네일을 포함하도록 구성될 수 있으며, 앞선 실시예 의 경우 영상 분석 이벤트 항목 내 각 영상 분석 이벤트의 썸네일의 크기가 조정되는 것일 수 있다. 또한, 본 발명의 일 실시예에서 각 영상 분석 이벤트의 경우 중요도(처리 시급성, 위험성, 설치 장소의 중요도 등)가 미리 설정되어 있을 수 있으며, 중요도를 더 반영하여 상기 크기를 조정할 수 있다. 그밖에, 본 발명의 일 실시예에서 영상 분석 이벤트 항목 내 구성되는 각 영상 분석 이벤트는 영상으로부터 분 석 탐지되는 모든 이벤트가 구성되는 것이 아닌 선별적으로 구성될 수도 있다. 일 실시예로, PTZ CCTV에 의해 촬영된 영상으로부터 분석된 영상 분석 이벤트의 경우, PTZ CCTV의 최소 주시 시 간 이상을 만족하는 영상을 대상으로 분석된 것이 포함되며 최소 주시 시간 미만을 만족한 영상에서 분석된 영 상 분석 이벤트는 포함되지 않도록 할 수 있다. 이때, 최소 주시 시간은 각 이벤트의 종류에 따라 구분 설정될 수 있으며, 복수의 이벤트가 동시에 발생되는 경우 최소 주시 시간은 이들의 합 또는 가중치에 의해 결정되는 최소 주시 시간일 수 있다. 한편, 각 이벤트별 최소 주시 시간은 전체 CCTV에 의해 촬영된 영상 및 이전 수집된 CCTV 영상으로부터 평균 이벤트 시작-종료 시간 정보와 이를 탐지하기 위한 PTZ CCTV의 이동 시간을 포함하는 주시 시간의 평균에 기초하여 설정될 수 있다. 최소 주시 시간은 전체 CCTV가 계속 운영됨에 따라 주기적으로 갱신될 수 있음은 물론이다. 한편, 상술한 설명에서, 단계 S110 내지 단계 S245은 본 발명의 구현예에 따라서, 추가적인 단계들로 더 분할되 거나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 아울러, 기타 생략된 내용이라 하더라도 도 1에 기술된 내용과 도 2 및 도 3에 기술된 내용 은 상호 적용된다. 이상에서 전술한 본 발명의 일 실시예들은, 하드웨어인 서버와 결합되어 실행되기 위해 프로그램(또는 어플리케 이션)으로 구현되어 매체에 저장될 수 있다. 상기 전술한 프로그램은, 상기 컴퓨터가 프로그램을 읽어 들여 프로그램으로 구현된 상기 방법들을 실행시키기 위하여, 상기 컴퓨터의 프로세서(CPU)가 상기 컴퓨터의 장치 인터페이스를 통해 읽힐 수 있는 C, C++, JAVA, 기 계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 상기 방법들을 실행하는 필요 한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Functional Code)를 포함할 수 있고, 상기 기능들을 상기 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수 있다. 또한, 이러한 코드는 상기 기능들을 상기 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 상기 컴퓨 터의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조되어야 하는지에 대한 메모리 참조관련 코드를 더 포함할 수 있다. 또한, 상기 컴퓨터의 프로세서가 상기 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠 한 다른 컴퓨터나 서버 등과 통신이 필요한 경우, 코드는 상기 컴퓨터의 통신 모듈을 이용하여 원격에 있는 어 떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는지 등 에 대한 통신 관련 코드를 더 포함할 수 있다. 상기 저장되는 매체는, 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반 영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상기 저 장되는 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있지만, 이에 제한되지 않는다. 즉, 상기 프로그램은 상기 컴퓨터가 접속할 수 있는 다양한 서버 상의 다양한 기록매체 또는 사용자의 상기 컴퓨터상의 다양한 기록매체에 저장될 수 있다. 또한, 상기 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장될 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2023-0132097", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0132097", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 CCTV 영상 분석 시스템의 구성을 도시한 블록도이다. 도 2는 본 발명의 일 실시예에 따른 영상 분석 이벤트를 저장하는 단계를 설명하는 순서도이다. 도 3은 본 발명의 일 실시예에서의 영상 분석 이벤트 항목을 출력하는 과정을 설명하는 순서도이다. 도 4는 본 발명의 일 실시예에서 다차원 형태의 영상 분석 이벤트 항목을 표시한 일 예시를 도시한 도면이다."}
