{"patent_id": "10-2023-0063320", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0165771", "출원번호": "10-2023-0063320", "발명의 명칭": "인공지능 기반 챗봇으로 유저 심리상담이 가능한 웰니스 및 힐링 수업 플랫폼 운영방법", "출원인": "주식회사 비헬씨", "발명자": "강정욱"}}
{"patent_id": "10-2023-0063320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "장치에 의해 수행되는, 인공지능 알고리즘에 기초하여 상담 서비스를 제공하는 방법에 있어서, 상기 방법은:고인의 음성 데이터를 수집하는 단계;상기 고인의 음성 데이터를 전처리하고, 상기 전처리된 고인의 음성 데이터에 대한 특징 데이터를 추출하는 단계;상기 추출된 특징 데이터로부터 획득할 수 있는 음소 유형의 개수가 제1 임계값을 초과하는지 여부를 판단하는단계;상기 음소의 개수가 상기 제1 임계값을 초과하는 것으로 판단된 경우, 상기 특징 데이터 및 상기 특징 데이터에대응되는 텍스트 데이터에 기초하여 입력 텍스트에 대응되는 고인 음성이 출력되도록 제1 AI 모델을 학습시키는단계;심리 상담 치료 및 인지 행동 치료를 위한 질문 텍스트 데이터베이스 및 답변 텍스트 데이터베이스에 기초하여질문 텍스트 또는 답변 텍스트를 출력하도록 학습된 제2 AI 모델의 출력 레이어에 상기 제1 AI 모델의 입력 레이어를 연결함으로써 전체 AI 모델을 획득하는 단계;심리 상담 치료 또는 인지 행동 치료를 위한 특정 질문이 포함된 제1 사용자 음성 데이터를 입력 데이터로 이용하여 상기 특정 질문에 대한 답변이 포함된 상기 고인의 음성을 출력하도록 상기 전체 AI 모델을 학습시키는 단계를 포함하고,상기 추출된 특징 데이터로부터 획득할 수 있는 음소 유형의 개수가 상기 제1 임계값을 이하인 것으로 판단된경우, 상기 고인의 음성과 연관된 제2 사용자의 음성 데이터에 기초하여 상기 제1 AI 모델이 학습되는, 방법."}
{"patent_id": "10-2023-0063320", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 챗봇으로 유저 심리상담이 가능한 웰니스 및 힐링 수업 플랫폼 운영방법에 관한 것이다."}
{"patent_id": "10-2023-0063320", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 챗봇으로 유저 심리상담이 가능한 웰니스 및 힐링 수업 플랫폼 운영방법에 관한 것이다."}
{"patent_id": "10-2023-0063320", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기술이 발전함에 따라, 디지털 디바이스의 활용도가 높아지고 있으며, 전자기기의 대중화에 힘입어, 온라인을 기반으로 제공되는 서비스에 대한 사용자들의 의존도가 점차적으로 높아지고 있다. 특히, 최근에는 온라인을 통 한 비대면 수업의 활용도가 점차적으로 높아지고 있다. 이에, 온라인을 기반 플랫폼에서는, 온라인 수업을 제공하는 방법에 대한 활발한 서비스 개발을 수행하고 있으 며, 최근 유저의 웰니스(건강)와 힐링(치유)에 대한 관심이 증가함에 따라 운동(요가, 피트니스, 명상 등)과 명 상과 미술과 요리 등에 대한 독립적인 교육 플랫폼이 성행하고 있는 실정이다. 그러나 운동과 명상과 미술과 요리 등은 독립적인 카테고리로 보이지만, 건강과 치유라는 관점에서 보았을 때 운동은 굳어있는 몸을 이완시키고 요가는 바른자세와 유연성과 근력 강화에 효과가 있으며 명상은 평온한 상태 로 온전히 자기 자신에게 집중하도록 하며 요리는 가족과 연인간의 관계를 증진 및 개선시키고 식단개선으로 건 강을 증징시키도록 하며, 미술은 드로잉과 색조합으로 유저의 감정 및 심리를 파악하는 것에 효과가 있다. 즉, 운동과 명상과 미술과 요리 등은 웰니스와 힐링 관점에서 독립된 카테고리가 아닌 토탈솔루션으로 제공되어야 할 필요성이 있다. 또한, 이러한 비대면 수업의 경우, 1:1 수업 또는 1:N 수업과 같이, 다양한 수업의 진행 방식이 존재할 수 있으 며, 사용자는 자신의 선호도 및 상황에 따라 적절한 수업을 선택고자 하는 니즈가 존재한다.나아가 유저에게 심리상담/치료와 같은 콘텐츠를 제공하면 유용한데, 이 경우, 심리 상담 서비스의 효과를 증대 시키기 위해서 인공지능을 기반으로 유저와 친밀했던 고인의 음성으로 챗봇 형태의 심리상담을 진행한다면 유저 의 심리치료 효과가 증대될 것이다."}
{"patent_id": "10-2023-0063320", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 인공지능 기반 챗봇으로 유저 심리상담이 가능한 웰니스 및 힐링 수업 플랫 폼 운영방법을 제공하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0063320", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 수업 플랫폼 운영방법은 장치에 의해 수행되는, 인공지능 알고리즘에 기초하여 상담 서비스를 제공하는 방법에 있어서, 상기 방법은: 고인의 음성 데이터를 수집하는 단계; 상기 고 인의 음성 데이터를 전처리하고, 상기 전처리된 고인의 음성 데이터에 대한 특징 데이터를 추출하는 단계; 상기 추출된 특징 데이터로부터 획득할 수 있는 음소 유형의 개수가 제1 임계값을 초과하는지 여부를 판단하는 단계; 상기 음소의 개수가 상기 제1 임계값을 초과하는 것으로 판단된 경우, 상기 특징 데이터 및 상기 특징 데이터에 대응되는 텍스트 데이터에 기초하여 입력 텍스트에 대응되는 고인 음성이 출력되도록 제1 AI 모델을 학습시키는 단계; 심리 상담 치료 및 인지 행동 치료를 위한 질문 텍스트 데이터베이스 및 답변 텍스트 데이터베이스에 기 초하여 질문 텍스트 또는 답변 텍스트를 출력하도록 학습된 제2 AI 모델의 출력 레이어에 상기 제1 AI 모델의 입력 레이어를 연결함으로써 전체 AI 모델을 획득하는 단계; 심리 상담 치료 또는 인지 행동 치료를 위한 특정 질문이 포함된 제1 사용자 음성 데이터를 입력 데이터로 이용하여 상기 특정 질문에 대한 답변이 포함된 상기 고인의 음성을 출력하도록 상기 전체 AI 모델을 학습시키는 단계를 포함하고, 상기 추출된 특징 데이터로부터 획득할 수 있는 음소 유형의 개수가 상기 제1 임계값을 이하인 것으로 판단된 경우, 상기 고인의 음성과 연관된 제2 사용자의 음성 데이터에 기초하여 상기 제1 AI 모델이 학습되는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2023-0063320", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 수업 플랫폼 운영방법에서는 운동/명상/미술/요리에 대한 통합 교육 플랫폼을 제공함으로써 웰니스와 힐링에 대한 토탈솔루션을 제공하는 효과가 있다. 또한, 본 발명의 수업 플랫폼 운영방법은 특정 주제에 대한 복수의 수업에 대한 수업 정보를, 수업 진행 방식에 따라 서로 구분하여 제공할 수 있다. 따라서, 수업을 이용하고자 하는 사용자는 자신이 수업 진행 방식에 해당 하는 수업을 보다 직관적으로 선택할 수 있다. 나아가 본 발명의 수업 플랫폼 운영방법에서는 인공지능 알고리즘에 기초한 고인의 음성 데이터를 이용하여 심 리 상담 서비스를 제공하는 방법이 제공될 수 있으며, 사용자에게 친숙한 고인의 목소리 데이터로 심리 상담 또 는 인지 행동 치료를 진행하는 AI 챗봇 관련 서비스가 제공됨으로써 심리 상담 효과가 증대할 수 있다."}
{"patent_id": "10-2023-0063320", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0063320", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 본 발명에서 설명되는 “수업(class)”는 교사 또는 강사 등과 같이 지식이나 기능을 가르쳐주는 주체가, 학생 또는 수강생과 같이 지식이나 기능을 배우고자 하는 주체에게 지식이나 기능을 전달하는 활동을 의미할 수 있다. 또한 수업은 배움의 대상이되는 학습 대상에 대한 학습을 촉진시키는 모든 활동을 의미할 수 있다. 이러 한 “수업”는 “수업”이라고도 표현될 수 있다. 본 발명에서는 설명의 편의를 위하여, 수업을 제공하는 자, 즉, 지식이나 기능을 가르쳐주는 주체(예를 들어, 교사 또는 강사)를 “수업 제공자”라고 명명하도록 한다. 나아가, “수업 제공자 측”은, 수업 제공자의 전자 기기 또는 수업 제공자 단말을 의미할 수 있다. 여기에서, 수업 제공자의 전자기기는, 수업 제공자의 제어 하에 있는 전자기기로서, 그 종류에는 제한이 없다. 나아가, 본 발명에서는 설명의 편의를 위하여, 수업을 제공받는 자, 즉, 지식이나 기능을 배우는 주체(예를 들 어, 학생 또는 수강생)를 “사용자”라고 명명하도록 한다. 나아가, “사용자 측”은, 사용자의 전자기기 또는 사용자 단말을 의미할 수 있다. 여기에서, 사용자의 전자기기는, 사용자의 제어 하에 있는 전자기기로서, 그 종 류에는 제한이 없다. 이하 첨부된 도면과 함께 본 발명에 대해 구체적으로 설명하기로 한다. 도 1은 본 발명에 따른 수업 플랫폼 시 스템을 설명하기 위한 개념도이다. 도 1에 도시된 것과 같이, 본 발명에 따른 수업 플랫폼 시스템은, 통신부, 저장부 및 제어부 중 적어도 하나를 포함하도록 구성될 수 있다. 이때 본 발명에 따른 수업 플랫폼 시스템은 상술한 구성 요소로 제한되는 것은 아니며, 본 명세서의 설명에 따른 기능과 동일 또는 유사한 역할을 수행하는 구성요 소를 더 포함할 수 있다. 한편, 통신부는 적어도 하나의 전자기기 또는 외부 서버와 통신하도록 이루어지며, 통신하는 대상의 통신 규격에 따라 다양한 통신 방식을 지원할 수 있다. 예를 들어, 통신부는, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), Wi-Fi(Wireless Fidelity) Direct, DLNA(Digital Living Network Alliance), WiBro(Wireless Broadband), WiMAX(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced), 5G(5th Generation Mobile Telecommunication), 블루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra-Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 전자기기 또는 외부 서버와 통신하도록 이루어질 수 있다. 다음으로 저장부는, 본 발명과 관련된 다양한 정보를 저장하도록 이루어질 수 있다. 본 발명에서 저장부 는 수업 제공 시스템 자체에 구비될 수 있다. 이와 다르게, 저장부의 적어도 일부는, 클라우드 서버(140, 또는 클라우드 저장소) 및 데이터베이스(database: DB) 중 적어도 하나를 의미할 수 있다. 즉, 저장 부는 본 발명에 따른 수업을 제공하기 위하여 필요한 정보가 저장되는 공간이면 충분하며, 물리적인 공간 에 대한 제약은 없는 것으로 이해될 수 있다. 이에, 이하에서는, 저장부, 클라우드 서버 및 데이터베이스 를 별도로 구분하지 않고, 모두 저장부라고 표현하도록 한다. 다음으로 제어부는 본 발명과 관련된 수업 플랫폼 시스템의 전반적인 동작을 제어하도록 이루어질 수 있다. 제어부는 위에서 살펴본 구성요소들을 통해 입력 또는 출력되는 신호, 데이터, 정보 등을 처리하거 나 사용자 측 또는 수업 제공자 측에게 적절한 정보 또는 기능을 제공 또는 처리할 수 있다. 한편, 본 발명에 따른 수업 제공 시스템은 전자기기와 연동되어 동작할 수 있다. 여기서 전자기기(1 0)는, 노트북(10a), 데스크탑(10b), 스마트폰(smart phone, 10c), 휴대폰, 태블릿 PC, 키오스크(KIOSK), 디지 털방송용 단말, PDA(Personal Digital Assistants), 및 PMP(Portable Multimedia Player) 중 적어도 하나를 포 함할 수 있다. 나아가, 전자기기는 사용자의 전자기기 또는 수업 제공자의 전자기기 일 수 있다. 이 경우, 본 발명에 따른 수업 제공 시스템은, 웹 브라우저(web browser)기반의 서비스로 제공되거나, 애 플리케이션 또는 소프트웨어로 구현될 수 있다. 이때, 수업 제공 시스템에 따른 애플리케이션 또는 소프트 웨어는, 전자기기에 설치될 수 있다. 본 발명에 따른 수업 제공 시스템의 통신부, 저장부 및 제어부는, 전자기기의 하드웨 어 구성을 활용하여, 수업 제공을 위한 일련의 기능을 수행할 수 있다. 예를 들어, 본 발명에 따른 수업 제공 시스템의 통신부, 저장부 및 제어부는, 전자기기 의 하드웨어 구성을 활용하여, 견적 생성을 위한 일련의 기능을 수행할 수 있다. 이 경우, 통신부는 전자기기의 통신부에 구비된 통신 모듈(예를 들어, 이동통신 모듈, 근거리 통신 모 듈, 무선 인터넷 모듈, 위치정보 모듈, 방송 수신 모듈 등)의 구성을 이용하여, 적어도 하나의 외부 서버(예를 들어, 도 1에 도시된 클라우드 서버 또는 데이터베이스(database: DB) 등)와 데이터를 송수신할 수 있다 (이하, 설명의 편의를 위하여, 데이터베이스 서버 또는 클라우드 서버를 “외부 서버”로 명명함). 이때, 통신부는 외부 서버에 저장된 수업과 관련된 정보를 수신할 수 있다. 나아가 저장부는 전자기기에 구비된(또는 삽입된) 메모리 또는 외부 서버를 이용하여, 본 발명에 따른 견적과 관련된 정보를 저장하도록 이루어질 수 있다. 제어부는, 전자기기에 구비된 CPU 및 클라우드 서버 중 적어도 하나를 활용하여, 각 구성에 대한 제어 및 본 발명과 관련된 전반적인 제어를 수행할 수 있다. 나아가, 제어부는 본 발명을 수행하기 위하여, 전 자기기의 구성 중 적어도 하나에 대한 제어 권한을 가질 수 있다. 나아가, 제어부는 전자기기의 디스플레이부를 제어하여, 본 발명에서 제공되는 수업 제공을 위한 정보를 디스플레이부 상에 제공할 수 있다. 이때, 제어부는 디스플레이부에 대한 직접 제어 또는 디스플레이부를 제어하는 전자기기의 제어부에 제어 명령을 전달함으로써 디스플레이부에 대한 제어를 간접적으로 수행할 수 있다. 이하에서는, 첨부된 도면과 함께, 본 발명에 따른 수업 제공 방법에 대하여, 보다 구체적으로 살펴본다. 도 2는 본 발명에 따른 수업 제공 방법을 설명하기 위한 흐름도이고, 도 3은 본 발명에 따른 수업을 검색하는 방법을 설명하기 위한 개념도이다. 나아가, 도 4a, 도 4b, 도 4c 및 도 5는 본 발명에 따른 수업 정보를 제공하 는 방법을 설명하기 위한 개념도들이다. 먼저, 도 2에 도시된 것과 같이, 본 발명에 따른 수업 제공 방법에 의하면, 사용자 단말로부터 주제 정보를 수 신하는 과정이 진행될 수 있다(S210). 여기에서, 주제 정보는, 수업의 주제에 대한 것으로서, 사용자가 수업을 통해 배우고 싶은 내용에 대한 것일 수 있다. 본 발명에서 수업의 주제는 매우 다양할 수 있다. 예를 들어, 도 3에 도시된 것과 같이, 수업의 주제는, 홈트(홈 트레이닝(home training), 공예, 공방, 음악, 악기, 드로잉, 뷰티, 패션, 홈쿠킹(home cooking),어학, 명상 등과 같이 배움의 대상이기만 하면 그 주제에 대한 특별한 한정은 없다. 본 발명에 따른 수업 제공 시스템에는 다양한 주제를 갖는 복수의 수업들이 등록되어 존재할 수 있다. 여 기에서, 수업의 등록은 수업 제공자 측에서 이루어질 수 있다. 즉, 수업 제공자는, 자신이 가르치는 주제에 대한 수업을 본 발명에 따른 수업 제공 시스템에 등록할 수 있다. 그리고, 사용자는, 수업 제공자에 의해 등록된 수업 중 적어도 하나를 선택하여, 수업 제공자로부터 수업 을 제공받을 수 있다. 한편, 이러한 주제 정보의 수신은 다양한 경로를 통하여 이루어질 수 있다. 사용자는, 사용자의 전자기기, 즉 사용자 단말을 통하여, 본 발명에 따른 수업 제공 시스템에서 제공되는 페이지를 통하여, 자신이 배우고 싶은 분야에 대한 주제 정보를 입력할 수 있다. 도 3에 도시된 것과 같이, 제어부는 사용자 단말로부터 주제 정보를 수신할 수 있다. 주제 정보는, 도 3에 도시된 것과 같이, 주제 정보를 입력하는 입력 영역을 통하여 수신될 수 있다. 다음으로, 본 발명에서는, 주제 정보와 관련하여 기 등록된 수업을 검색하는 과정이 진행될 수 있다(S220). 제어부는, 페이지를 통하여, 사용자 측으로부터 주제 정보가 수신되면, 저장부에서, 상기 수신 된 주제 정보에 대해 기 등록된 수업을 검색할 수 있다. 제어부는, 사용자 측으로부터 페이지의 입력 영역을 통해 검색 대상 정보가 입력되면, 상기 검 색 대상 정보와 관련된 수업의 주제를 특정할 수 있다. 예를 들어, 제어부는 도 4a에 도시된 것과 같이, 입력 영역에, “드로잉”이라는 정보가 입력되면, 해당 정보를 기반으로, 수업의 주제를 특정할 수 있다. 제어부는 적어도 하나의 언어 처리 알고리즘에 기 반하여, 입력된 검색 대상 정보에 대한 수업의 주제를 특정할 수 있다. 앞서 살펴본 것과 같이, 저장부에는, 서로 다른 복수의 수업이 등록되어 존재할 수 있다. 저장부에 저장된 서로 다른 복수의 수업은 서로 다른 주제이건, 일부는 서로 유사 또는 동일한 주제를 가질 수 있다. 한편, “저장부에 저장된 또는 등록된 수업”란, 수업과 관련된 정보가 저장 또는 등록되었음을 의미할 수 있다. 여기에서, 수업과 관련된 정보는 각각의 수업 마다 존재할 수 있다. 수업과 관련된 정보는, 수업 타입에 대한 정보, 수업의 주제에 대한 정보, 수업을 제공하는 수업 제공자와 관련된 정보(예를 들어, 교사 또는 강사의 프 로필 정보 등), 수업 계획 정보(예를 들어, 강의 계획서에 대한 정보), 수업에 대한 가격 정보(예를 들어, 수업 구매 금액 정보 등), 수업 제공 시간 정보, 수업 타입에 대한 정보, 수업 수강 조건에 대한 정보, 수업 내용에 대한 콘텐츠(예를 들어, 동영상 콘텐츠, 이미지 콘텐츠, 텍스트 콘텐츠 등) 등과 같이, 매우 다양할 수 있다. 나아가, 수업과 관련된 정보는 위에서 열거된 예시 외에도 존재할 수 있으며, 위의 예에 한정되지 않는다. 제어부는 저장부에 저장된 수업과 관련된 정보를 참조하여, 사용자 측으로부터 수신된 검색 대상 정보에 대응되는 적어도 하나의 수업을 검색할 수 있다. 예를 들어, 검색 대상 정보에 대응되는 수업의 주제가 “드로잉”인 경우, 제어부는 드로잉을 주제로 같은 적어도 하나의 수업을 검색할 수 있다. 이와 같이, 수업이 검색되면, 다음으로, 본 발명에서는 사용자 단말에, 검색된 수업에 대한 수업 정보가 포함된 페이지를 제공하는 과정이 진행될 수 있다(S230). 제어부는 사용자 단말로부터, 검색 대상 정보가 입력되면, 도 4a, 도 4b, 도 4c 및 도 5에 도시된 것과 같 이, 페이지 상에, 검색 결과로서 검색 대상 정보에 대응되는 특정 주제를 갖는 수업 정보를 제공할 수 있다. 수업 정보는, 검색된 수업에 대한 정보를 포함할 수 있다. 사용자는 수업 정보를 통하여, 자신이 배우고자 하는 수업에 대한 정보를 확인하고, 선택할 수 있다. 보다 구체적으로, 수업 정보는, 검색된 수업 각각을 대표하는 그래픽 객체를 포함할 수 있다. 제어부는 검 색된 수업이 복수개 존재하는 경우, 검색된 복수의 수업 각각에 대응되는 복수의 그래픽 객체를 생성할 수 있다. 그리고, 페이지에는 복수의 그래픽 객체가 포함될 수 있다.여기에서, 그래픽 객체는, 검색된 각각의 수업에 매칭되며, 그래픽 객체에는 수업에 대한 정보가 포함될 수 있 다. 예를 들어, 그래픽 객체에는 수업의 주제 정보, 수업의 명칭, 수업 타입, 수업 강사 정보, 수업 금액 등 수 업과 관련된 다양한 정보 중 적어도 하나를 포함할 수 있다. 예를 들어, 도 4a에 도시된 것과 같이, 사용자는, 페이지에 포함된 그래픽 객체를 통해, 어떤 수업들이 존 재하는지를 인지할 수 있다. 한편, 제어부는 검색된 수업을, 각각의 수업에 해당하는 수업 타입을 기준으로 정렬할 수 있다. 즉, 제어부는, 검색된 수업을 수업 타입을 기준으로, 분류 또는 정렬하고, 수업 타입에 따라 정렬된 형태 로 검색된 수업에 대한 정보를 제공할 수 있다. 제어부는, 각각의 수업에 대응되는 그래픽 객체를, 수업 타입에 따라 정렬하여, 페이지 상에 배치할 수 있다. 예를 들어, 도 4a에 도시된 것과 같이, 페이지에는, 검색된 수업 각각에 대응되는 그래픽 객체가, 수업 타 입을 기준으로 정렬되어 배치될 수 있다. 여기에서, “수업 타입(class type)”은 수업 종류, 수업 방식 등으로 다양하게 명명될 수 있다. 수업 타입은, 수업의 진행방식 또는 수업방식을 기준으로 수업을 분류하는 기준일 수 있다. 수업 타입은, 수업 각각의 수업 진행방식에 따라 구분되는 복수의 수업 타입을 포함할 수 있다. 여기에서, 수업 진행방식을 분류하는 기준은 매우 다양할 수 있다. 예를 들어, 수업 진행 방식은, 수업의 참여 인원 수, 수업을 제공하는 방식(예를 들어, 화상 채팅(또는 실시간 라이브, 실시간 화상 채팅 등), 동영상 콘텐 츠 제공 방식 등) 등과 같은 다양한 기준에 근거하여 다양하게 분류될 수 있다. 예를 들어, 제1 수업 타입은, 사용자 단말의 사용자와 수업 제공자와의 일대일 수업진행 방식일 수 있다. 제1 수업 타입의 수업진행 방식은 “일대일 라이브” 또는 “1:1 라이브”로도 명명될 수 있다. 이러한 일대일 수업 진행 방식에서는, 사용자 단말과 상기 수업 제공자의 전자기기 간에 화상 채팅 채널이 활성화될 수 있다. 화상 채팅 채널을 통해, 사용자 단말과 수업 제공자의 단말 간에는 영상, 텍스트 및 소리 중 적어도 하나에 대 한 데이터 송수신 될 수 있다. 이를 통해, 사용자 단말의 사용자는, 수업 제공자에 대한 영상 보고 소리를 들으 면서 실제 수업을 받는 것과 같은 효과를 얻을 수 있다. 이러한 일대일 수업 진행 방식은 사용자와 수업 제공자 간의 영상 및 소리를 기반으로 한 실시간 소통이 가능하다. 다음으로, 제2 수업 타입은, 수업에 포함된 복수의 서브 수업 중 사용자 단말에서 선택된 적어도 하나의 특정 서브 수업을 제공하는 수업진행 방식일 수 있다. 제2 수업 타입의 수업진행 방식은 “원포인트(또는 VOD 수업) ”로도 명명될 수 있다. 이 경우, 사용자 단말에는, 사용자 단말에 의해 선택된 상기 특정 서브 수업에 대응되 는 동영상 콘텐츠가 제공될 수 있다. 다음으로, 제3 수업 타입은, 사용자 단말의 사용자와 다른 사용자 및 수업 제공자와의 그룹 수업진행 방식일 수 있다. 제3 수업 타입의 수업진행 방식은 “그룹 수업”로도 명명될 수 있다. 이 경우, 상기 사용자 단말의 사용 자를 포함한 다른 사용자들은, 수업 제공자로부터 그룹 수업의 형태로 수업을 제공받을 수 있다. 이 경우, 상기 사용자 단말, 상기 다른 사용자의 전자기기 및 상기 수업 제공자의 전자기기 간에는 화상 채팅 채널이 활성화될 수 있다. 다음으로, 제4 수업 타입은, 사용자 단말에 동영상 콘텐츠를 제공하는 방식일 수 있다. 제4 수업 타입의 수업진 행 방식은 “VOD 보기”로도 명명될 수 있다. 이 경우, 사용자 단말은, 수업 제공자에 의해 등록된 동영상 콘텐 츠를 본 발명에 따른 수업 제공 시스템으로부터, 스트리밍 방식 또는 다운로드 방식을 통하여 제공받을 수 있다. 또한, 수업 타입은 위에서 살펴본 예들 외에도 다양할 수 있으며, 본 발명은 위의 수업 타입으로 한정되지 않는 다. 한편, 본 발명에서는, 수업 타입에 따라 과금 방식 또는 결제 방식이 상이할 수 있으며, 이에 대해서는 특별한 한정을 두지 않는다. 한편, 제어부는, 위에서 살펴본 것과 같이, 사용자 단말에서 입력된 검색 대상 정보에 대응되는 수업 주제 를 특정하고, 특정된 특정 주제에 대한 수업을 검색할 수 있다. 그리고, 검색된 수업을 수업의 타입에 따라 분 류할 수 있다. 그리고, 제어부는 수업 타입에 따라 분류된 수업을, 각각의 수업에 대응되는 그래픽 객체를이용하여 페이지 상에 제공할 수 있다. 일 예로, 도 4a에 도시된 것과 같이, 제어부는, 페이지 상에, 그래픽 객체를 수업 타입 별로 그룹핑 하여, 수업 타입 별로 서로 구분되게 페이지 상에 표시할 수 있다. 이러한 페이지는 사용자 단말의 디스플 레이 상에 표시될 수 있다. 도 4a에 도시된 것과 같이, 페이지의 일 영역에는 수업 타입 별로 수업에 대한 정보가 구분되어 제공 될 수 있다. 도시와 같이, 제1 영역에는 제1 수업 타입에 대응되는 수업의 그래픽 객체들(예를 들어, 각각 “기초 드로 잉”, “중급 드로잉”, “고급 드로잉”의 정보를 포함하는 이미지)이 제공될 수 있다. 나아가, 제1 영역에는, 제1 수업 타입의 수업 진행 방식을 나타내는 가이드 정보(예를 들어, “1:1 라이브 ”)가 함께 제공될 수 있다. 이를 통하여, 사용자는, 제1 수업 타입이 어떤 수업 진행 방식에 해당하고,제1 수 업 타입에 해당하는 수업이 어떤 것들이 있는지 쉽게 인지할 수 있다. 마찬가지로, 일 영역의 제2 영역에는 제2 수업 타입에 대응되는 수업의 그래픽 객체들(예를 들어, 각 각 “쪽집게 드로잉”, “꼼꼼 드로잉”, “밀착 드로잉”의 정보를 포함하는 이미지)이 제공될 수 있다. 나아가, 제2 영역에는, 제2 수업 타입의 수업 진행 방식을 나타내는 가이드 정보(예를 들어, “원포인트”)가 함께 제공될 수 있다. 이를 통하여, 사용자는, 제2 수업 타입이 어떤 수업 진행 방식에 해당하 고, 제2 수업 타입에 해당하는 수업이 어떤 것들이 있는지 쉽게 인지할 수 있다. 이러한 방식으로, 제3 영역에는 제3 수업 타입에 대응되는 수업의 그래픽 객체들 및 제4 영역에는 제 4 수업 타입에 대응되는 수업의 그래픽 객체들이 포함될 수 있다. 한편, 상기 일 영역에는 사용자가 선호하는 수업 타입의 정보가 다른 수업 타입의 정보보다 우선하여 제공 될 수 있다. 예를 들어, 사용자가 선호하는 수업 타입이 제1 수업 타입인 경우, 상기 일 영역에는, 제1 수 업 타입의 수업 정보가 가장 상단에 위치할 수 있다. 이러한 사용자의 선호도에 대한 정보는, 사용자 계정에 매칭된 사용자 히스토리 정보에 기반하여 결정될 수 있 다. 제어부는 사용자 히스토리 정보에 포함된 과거 사용자가 구매한 수업의 수업 타입을 분석하고, 분석결 과를 기반으로 사용자가 선호하는 수업 타입의 수업 정보를 다른 수업 타입의 수업 정보보다 우선하여 제공할 수 있다. 한편, 사용자 히스토리 정보에는, 과거 사용자가 구매한 수업의 구매 이력이 포함될 수 있다. 한편, 수업 타입에 따라 수업에 대한 정보를 제공하는 방식은 매우 다양할 수 있다. 도 4a에서 살펴본 것과 같 이, 제어부는 하나의 페이지(또는 단일 페이지, 410) 상에, 수업 타입 별로 서로 구분되게 수업에 대한 정 보를 제공할 수 있다. 나아가, 제어부는, 복수의 서브 페이지를 활용하여, 수업에 대한 정보를 제공할 수 있다. 여기에서, 복수 의 서브 페이지 중 적어도 일부는, 서로 다른 수업 타입에 각각 대응(또는 매칭)되는 페이지 일 수 있다. 메인 페이지에는 복수의 서브 페이지 중 어느 하나의 서브 페이지가 포함될 수 있다. 도 4b에 도시된 것과 같이, 메인 페이지에는 검색된 수업에 대한 정보(441a)가 수업 타입에 따른 분류 없이 모두 표시되는 것 또한 가능하다. 나아가, 메인 페이지는, 복수의 서로 다른 수업 타입 각각에 대응되는 복수의 서브 페이지 중 어느 하나의 서브 페이지를 포함할 수 있다. 상기 어느 하나의 서브 페이지에는, 검색된 수업 중, 상기 어느 하나의 서브 페 이지에 대응되는 특정 수업 타입에 해당하는 수업을 대표하는(매칭된 또는 나타내는) 그래픽 객체가 포함될 수 있다. 한편, 상기 페이지 상에 상기 복수의 서브 페이지 중 어느 서브 페이지를 표시할지 여부는, 사용자 단말에 서 상기 복수의 서브 페이지 각각에 매칭된 인디케이터(441, 442, 443, 444, 445) 중 어느 인디케이터가 선택되 는지에 따라 달라질 수 있다. 즉, 제어부는 사용자 단말로부터, 상기 인디케이터(441, 442, 443, 444, 445) 중 어느 하나에 대한 선택 정보를 수신하고, 수신된 선택 정보에 대응되는 인디케이터에 매칭된 서브 페이 지를 메인 페이지 상에 제공할 수 있다. 예를 들어, “1:1 라이브”라는 정보가 표시된 인디케이터가 사용자 단말에서 선택되는 경우, 사용자 단말 의 디스플레이에는, 상기 인디케이터에 매칭된 수업 타입의 수업 정보가 표시될 수 있다.한편, 제어부는, 메인 페이지 상에 복수의 서브 페이지 중 어느 서브 페이지를 우선하여 표시할지 여 부를 사용자의 선호도 정보(또는 사용자 히스토리 정보)에 근거하여 결정할 수 있다. 제어부는 사용자 히스토리 정보에 기반하여 사용자 선호 수업 타입을 특정하고, 상기 복수의 서브 페이지 중 상기 사용자 선호 수업 타입에 대응되는 서브 페이지를 다른 서브 페이지보다 우선하여 표시할 수 있다. 예를 들어, 사용자가 선호하는 수업 타입이 제1 수업 타입(예를 들어, 1:1 라이브의 수업 진행 방식)인 경우, 제어부는 검색된 수업에 대한 정보가 표시되는 메인 페이지 상에, 상기 제1 수업 타입에 매칭된 서브 페이지를 가장 먼저 표시할 수 있다. 이러한 사용자의 선호도에 대한 정보는, 사용자 계정에 매칭된 사용자 히스토리 정보에 기반하여 결정될 수 있 다. 제어부는 사용자 히스토리 정보에 포함된 과거 사용자가 구매한 수업의 수업 타입을 분석하고, 분석결 과를 기반으로 사용자가 선호하는 수업 타입의 수업 정보를 다른 수업 타입의 수업 정보보다 우선하여 제공할 수 있다. 한편, 사용자 히스토리 정보에는, 과거 사용자가 구매한 수업의 구매 이력이 포함될 수 있다. 즉, 상 기 사용자 히스토리 정보는, 사용자 단말에 로그인된 사용자 계정에서 과거 구매된 수업의 수업 타입 정보를 포 함할 수 있다. 한편, 제어부는, 수업을 기준으로, 수업의 타입에 대한 정보를 제공할 수 있다. 예를 들어, 동일한 주제 및 동일한 강사에 의해 서로 다른 수업 진행방식이 존재할 수 있다. 즉, 도 4c에 도시된 것과 같이, 특정 강사 가, “기초 드로잉”이라는 수업 주제에 대하여, 1:1 라이브, 원포인트, 그룹수업, VOD 보기와 같이, 다양한 수 업 진행 방식을 통해 수업을 제공할 수 있다. 이에, 제어부는 수업을 기준으로, 각각의 수업이 제공하는 수업 진행방식, 즉 수업 타입에 대한 정보를 제 공할 수 있다. 이 경우, 도 4c에 도시된 것과 같이, 검색된 수업에 대한 검색 결과가 출력되는 페이지에는, 검색된 수업 에 대한 정보 및 각각의 수업의 수업 진행방식에 대한 수업 타입의 정보(461, 462, 463, 464, 465, 466, 467) 가 함께 제공될 수 있다. 따라서, 사용자는, 검색된 수업 중 자신이 관심있는 수업이 어떤 수업 진행 방식을 제공하는지에 대한 정보를 한눈에 파악할 수 있고, 자신이 원하는 수업 진행 방식에 해당하는 수업 타입을 선택할 수 있다. 나아가, 수업 타입에 대한 정보는, 검색 결과로서 제공되는 것 뿐만 아니라, 다양한 경로를 통하여 제공될 수 있다. 본 발명에 따른 수업 제공 시스템에서는, 수업 제공자를 기준으로 구분되는 수업 페이지를 제 공할 수 있다. 이러한 수업 페이지는 특정 수업 제공자(예를 들어, “효스타” 강사)에 의하여 관리되는 페이지일 수 있다. 이러한 수업 페이지에는, 수업 제공자의 프로필 정보가 제공될 수 있다. 나아가, 수업 페이지에 는 수업 제공자가 제공하는 수업의 내용 “강의 계획서(또는 수업 계획, 수업 플랜)” 형식으로 제공될 수 있다. 또한, 수업 페이지에는, 수업 제공자에 의해 제공되는 수업 진행방식(또는 수업 방식, 531, 532, 533, 534)에 해당하는 수업 타입의 정보 가 제공될 수 있다. 따라서, 사용자는 특정 수업 제공자가 어떠한 수업 의 내용을 제공하고, 어떠한 진행방식으로 수업을 진행하는지를 한눈에 파악할 수 있다. 이상에서 살펴본 것과 같이, 본 발명에 따른 수업 제공 방법 및 시스템에서는 수업에 대한 정보를 수업의 타입 에 따라 구분하여 표시함으로써, 사용자가 자신이 선호하는 수업을 직관적으로 선택할 수 있도록 할 수 있다. 한편, 본 발명에서는, 사용자에 의해 특정 수업이 선택되면, 사용자에 의해 선택된 특정 수업을, 사용자에 의해 선택된 수업 타입에 따른 수업 진행방식으로 제공할 수 있다. 즉, 제어부는 사용자 단말에서, 수업에 대응 되는 그래픽 객체 중 어느 하나가 선택되면, 선택된 그래픽 객체에 대응되는 특정 수업의 수업 타입에 대응되는 수업 진행 방식에 따라, 상기 특정 수업을 제공할 수 있다. 이하에서는, 각각의 수업 타입 별로 어떠한 진행방식으로 수업이 제공되는지에 대하여 첨부된 도면과 함께 보다 구체적으로 살펴본다. 도 6a, 도 6b, 도 7a, 도 7b, 도 7c, 도 7d, 8a, 도 8b, 도 8c, 도 9a 및 도 9b는 서로 다른 수업 진행 방식에 따른 인터페이스 환경을 설명하기 위한 개념도들이다. 먼저, 제1 수업 타입을 제공하는 방법에 대하여 살펴보도록 한다. 사용자 단말의 사용자와 수업 제공자와의 일 대일 수업진행 방식일 수 있다. 제1 수업 타입의 수업진행 방식은 “일대일 라이브” 또는 “1:1 라이브”로도명명될 수 있다. 이러한 일대일 수업 진행 방식에서는, 사용자 단말과 상기 수업 제공자의 전자기기 간에 화상 채팅 채널이 활성화될 수 있다. 화상 채팅 채널을 통해, 사용자 단말과 수업 제공자의 단말 간에는 영상, 텍스트 및 소리 중 적어도 하나에 대 한 데이터 송수신 될 수 있다. 이를 통해, 사용자 단말의 사용자는, 수업 제공자에 대한 영상 보고 소리를 들으 면서 실제 수업을 받는 것과 같은 효과를 얻을 수 있다. 이러한 일대일 수업 진행 방식은 사용자와 수업 제공자 간의 영상 및 소리를 기반으로 한 실시간 소통이 가능하다. 한편, 사용자는, 제1 수업 타입에 따른 수업을 진행할 시간을 선택할 수 있다. 도 6a에 도시된 것과 같이, 제1 수업 타입의 수업을 제공하는 특정 수업 제공자의 페이지에는, 수업에 대한 정보(631, 632, 633, 634)와 함께, 각각의 수업을 진행하기 위한 시간을 결정하는 것을 보조하기 위한 기능 아이콘(631a, 631b, 632a)을 포 함할 수 있다. 사용자는, 사용자 단말을 통하여, 기능 아이콘(631a, 631b, 632a) 중 어느 하나를 선택함으로써, 수업의 시작 시간을 선택할 수 있다. 이러한 기능 아이콘은 각각의 단위 수업(631, 632, 633, 634) 마다 제공될 수 있다. 따라서, 사용자는, 수업 마 다 수업의 시작시간을 개별적으로 선택할 수 있다. 사용자 측에서, 기능 아이콘 중 제1 기능 아이콘(“지금 입 장”아이콘, 631a)이 선택되는 경우, 제어부는, 상기 제1 기능 아이콘(631a)이 선택되는 것에 응답하여, 수업 제공자 측과 사용자 단말 간의 화상 채팅 채널을 형성할 수 있다. 여기에서, 화상 채팅 채널이 형성된다고 함으로, 수업 제공자 측과 사용자 측이 화상 채팅이 가능하도록 통신연 결을 포함한 일련의 프로세스를 진행하는 것을 의미할 수 있다. 한편, 사용자 측에서, 기능 아이콘 중 제2 기능 아이콘(“예약하기”아이콘, 632a)이 선택되는 경우, 제어부 는, 사용자 측 단말에, 사용자로부터 수업 시작 시간을 선택받기 위한 화면정보를 제공할 수 있다. 한편, 도 6a에 도시된 것과 같이, 제어부는 바로 시작이 불가능한 수업의 경우, 제1 기능 아이콘(“지금 입장”아이콘, 631a, 632a)을 비활성화 할 수 있다. 도시와 같이, 제1 기능 아이콘(“지금 입장”아이콘, 631a, 632a)의 시각적 외관이 서로 다름을 확인할 수 있다. 이를 통해, 사용자는, 지금 바로 이용이 가능한 수업과, 불가능한 수업을 직관적으로 구분할 수 있다. 한편, 제1 수업 타입의 수업이 진행되는 경우, 도 6b에 도시된 것과 같이, 제어부는 사용자 단말에 수업 진행 페이지를 제공할 수 있다. 이러한 페이지에는, 화상 채팅에 따른 화면 정보가 제공될 수 있다. 이러한 화면 정보는 수업 제공자의 단말로부터 수신되는 정보가 제공될 수 있다. 나아가, 화면정보 는 수업 제공자의 카메라로부터 수신되는 영상이 제공될 수 있다. 한편, 화상 채팅의 진행 시간은 제한될 수 있다. 화상 채팅의 진행 시간은, 사용자가 구매한 수업의 종류, 등급 등에 근거하여 결정될 수 있다. 제어부는 진행되는 수업에 설정된 수업 진행 시간에 근거하여 수업의 진행 시간을 카운팅할 수 있다. 그리고, 설정된 수업 진행 시간이 도달한 경우, 화상 채팅을 종료시킬 수 있다. 이 경우, 제어부는 수업 종료 시간으로부터 기 설정된 시간(예를 들어, 10분) 전에, 수업이 기 설정된 시간 후에 종료됨을 알리는 가이드 정보를, 수업 제공자 측 및 사용자 측에 제공할 수 있다. 이 경우, 수업의 진행 시간은, 수업 제공자 측 및 사용자 측 중 적어도 하나의 요청에 근거하여 연장될 수 있다. 수업의 진행시간이 사용자 측의 요청에 의하여 연장되는 경우, 사용자는 추가적은 금액을 지불할 수 있다. 즉, 제어부는 수업 진행 시간의 연장을 위한 추가 상품을, 사용자 측에 제공할 수 있다. 나아가, 이러한 페이지에는, 수업에 대한 정보(수업 주제, 수업 참여자에 대한 정보 등, 650) 및 채팅 영 역 중 적어도 하나가 더 포함될 수 있다. 채팅 영역에는 화상 기반의 채팅이 아닌, 텍스트 기반의 텍 스트 채팅 영역이 포함될 수 있다. 따라서, 수업 제공자와 사용자는 영상, 소리, 텍스트 중 적어도 하나를 통하여 수업을 진행할 수 있다. 한편, 제어부는, 화상 채팅 채널을 통한 상기 사용자 단말과 상기 수업 제공자의 전자기기 간의 화상 채팅 이 종료되는 경우, 상기 화상 채팅에 대응되는 동영상 콘텐츠를 저장할 수 있다. 그리고, 제어부는, 상기 동영상 콘텐츠를 상기 사용자의 사용자 계정과 매칭된 사용자 히스토리 정보에 포함시킬 수 있다. 따라서, 사용 자는 수업이 종료되는 경우에도, 동영상 콘텐츠를 이용함으로써, 수업에 대한 복습을 진행할 수 있다. 다음으로, 제2 수업 타입을 제공하는 방법에 대하여 살펴보도록 한다. 제2 수업 타입은, 수업에 포함된 복수의 서브 수업 중 사용자 단말에서 선택된 적어도 하나의 특정 서브 수업을 제공하는 수업진행 방식일 수 있다. 제2수업 타입의 수업진행 방식은 “원포인트”로도 명명될 수 있다. 도 7a에 도시된 것과 같이, 사용자에 의해 특정 수업이 선택되면, 선택된 수업에 대응되는 수업 제공자의 페이 지가 사용자 단말에 제공될 수 있다. 이러한 페이지에는, 복수의 서브 수업에 대한 정보가 제공 될 수 있다. 그리고, 사용자 단말에는, 상기 복수의 서브 수업에 대한 정보를 통해, 사용자 단말에 의해 선택된 상기 특정 서브 수업(731, 732)에 대응되는 동영상 콘텐츠가 도 7b에 도시된 것과 같이 제공될 수 있다. 도 7b에 도시된 것과 같이, 제어부는 사용자에 의해 선택된 특정 서브 수업에 대한 동영상 콘텐츠를 사용 자측에 제공할 수 있다. 사용자는, 사용자 측 단말기는 다운로드 또는 스트리밍 방식을 통해, 동영상 콘텐츠를 재생할 수 있다. 한편, 제어부는, 사용자 단말과 상기 특정 서브 수업을 제공하는 수업 제공자의 전자기기 간에 채팅 채널 을 활성화할 수 있다. 즉, 제어부는 사용자가 수업 제공자로부터 채팅을 통하여, 궁금한 점을 질문하고, 수업에 대한 정보를 얻도록 할 수 있다. 채팅 채널은, 도 7b에 도시된 것과 같이, 채팅 기능에 대응되는 기능 아이콘(752, 754)이 사용자 측에서 선택되는 것에 근거하여 활성화될 수 있다. 채팅 기능은, 동영상 콘텐츠에 대한 재생이 완료된 후, 활성화될 수 있다. 나아가, 채팅 기능은 유료 또는 무료 서비스 타입 중 어느 하나로 제공될 수 있다. 예를 들어, 채팅 기능은, 유 료 서비스 타입일 수 있으며, 이 경우, 강사와의 채팅 서비스에 해당하는 상품을 구매한 사용자에 한해서, 채팅 기능이 활성화될 수 있다. 나아가, 채팅 기능은, 무료 서비스 타입일 수 있으며, 이 경우, 강사와의 채팅을 원하는 사용자에게 채팅 기능 이 활성화될 수 있다. 이러한 채팅 채널은, 화상 기반 및 텍스트 기반의 채팅 중 적어도 하나일 수 있다. 한편, 위에서 살펴본 것과 달리, 채팅 기능은, 동영상 콘텐츠의 재생 중이라도, 사용자 단말로부터 수신되는 요 청에 근거하여 활성화될 수 있다. 예를 들어, 사용자 단말에서 상기 동영상 콘텐츠가 재생 중인 상태에서 상기 채팅 채널이 활성화된 경우, 제어 부는 도 7c에 도시된 것과 같이, 사용자 측 단말에, 상기 동영상 콘텐츠의 재생 화면 및 상기 채팅 채널에 해당하는 채팅 화면을 함께 제공할 수 있다. 나아가, 제어부는 도 7d에 도시된 것과 같이, 수 업 제공 페이지를 적어도 두 영역(780, 791)루 구분하여, 제1 영역에서는 동영상 콘텐츠를 제공하고, 제2 영역에는 채팅을 제공할 수 있다. 한편, 사용자와 수업 제공자와의 채팅이 시작되는 시간 또한, 도 6a에서 살펴본 것과 같이, 지금 시작 또는 예 약의 방식으로 진행될 수 있다. 다음으로, 제3 수업 타입의 수업을 제공하는 방식에 대하여 살펴본다. 제3 수업 타입은, 사용자 단말의 사용자 와 다른 사용자 및 수업 제공자와의 그룹 수업진행 방식일 수 있다. 제3 수업 타입의 수업진행 방식은 “그룹 수업”로도 명명될 수 있다. 이 경우, 상기 사용자 단말의 사용자를 포함한 다른 사용자들은, 수업 제공자로부 터 그룹 수업의 형태로 수업을 제공받을 수 있다. 이 경우, 상기 사용자 단말, 상기 다른 사용자의 전자기기 및 상기 수업 제공자의 전자기기 간에는 화상 채팅 채널이 활성화될 수 있다. 도 8a에 도시된 것과 같이, 제3 수업 타입에 따른 수업 제공 페이지에는 수업이 진행되기 위한 조건 정보 가 포함될 수 있다. 즉, 그룹 수업의 특성 상, 복수의 사용자가 모집되지 않는 경우, 수업이 진행되지 않 을 수 있다. 따라서, 제어부는, 제3 수업 타입에 따른 특정 수업에 대한 화상 채팅 채널 활성화 여부를, 상기 특정 수 업을 구매한 사용자의 수에 근거하여 결정할 수 있다. 제어부는 특정 수업에서 설정된 목표 수강인원에 해 당하는 만큼 수업이 구매된 경우에 한하여, 화상 채팅 채널을 활성화할 수 있다. 한편, 이 경우, 특정 수업에 대한 수업 이용료(수강료)는, 특정 수업을 참여한 사용자들에 의해 분할하여 지불 될 수 있다. 한편, 제3 수업 타입에 따른 특정 수업에 대한 화상 채팅 채널이 활성화된 경우, 제어부는 도 8b 및 도 8c 에 도시된 것과 같이, 수업 제공 페이지 상에, 수업 제공자, 사용자 및 다른 사용자(수업 참여자) 각각에 대응되는 영상(851, 852, 853, 861, 862, 863)을 함께 제공할 수 있다. 도 8b 및 도 8c에 도시된 것과 같이,화면의 구성은 다양하게 변형될 수 있다. 이와 같이, 화상 채팅 채널을 통해 제공되는 화상 채팅 화면에는, 사용자 단말, 다른 사용자의 전자기기 및 상 기 수업 제공자의 전자기기 각각으로부터 수신되는 영상 정보가 함께 표시될 수 있다. 화상 채팅 채널을 통해 제공되는 화상 채팅 화면에는, 사용자 단말, 다른 사용자의 전자기기 및 상기 수업 제공자의 전자기기 각각의 카메라로부터 수신되는 영상 정보가 함께 표시될 수 있다. 따라서, 사용자는, 수업 제공자 및 여러 사용자들에 대한 영상을 함께 제공받음으로써, 여러 사용자들이 함께 수업하는 것과 같은 느낌을 받을 수 있다. 한편, 본 발명에 따른 수업 제공 시스템에서는, 그룹 수업과 연계하여 다른 타입의 수업을 추가적으로 제공할 수 있다. 예를 들어, 사용자는 그룹 수업 제공 중에 특정 부분을 집중하여 더 배우고 싶은 니즈가 존재할 수 있 다. 이러한 사용자의 니즈를 만족하기 위하여, 제어부는 수업 제공 페이지의 일 영역에, 다른 타입의 수업 을 구매하기 위한 기능 아이콘을 제공할 수 있다. 제어부는 현재 제공되고 있는 수업의 수업 제공자가, 현 재 진행되고 있는 수업의 수업 주제와 관련된 다른 타입의 수업을 제공하는지 검색하고, 검색 결과에 기반하여 적절한 기능 아이콘을 제공할 수 있다. 예를 들어, 수업 제공자가, 제1 타입의 수업을 추가적으로 제공하는 경 우, 기능 아이콘은, 제1 타입의 수업을 구매 또는 예약하기 위한 기능 아이콘일 수 있다. 이를 통해, 사용자는, 현재 제공되는 수업과 별도로 추가적인 수업을 이용할 수 있다. 이 경우, 제어부는, 사용자 측 단말기에서 기능 아이콘이 선택된 특정 시점에서, 그룹 수업에서 진행된 수업 내용의 정보를 추출할 수 있다. 제어부 는 상기 특정 시점에서의 화상 채팅의 내용을 동영상 콘텐츠로서 추출할 수 있다. 그리고, 제어부는 상기 화상 채팅의 내용에 따른 동영상 콘텐츠를, 사용자 측 및 수업 제공자 측 중 적어도 하나에 제공할 수 있다. 제 어부는, 상기 특정 시점에서 상기 기능 아이콘이 선택된 것을, 사용자가 상기 특정 시점에서 진행된 수업 내용에 대하여 추가적으로 배우고 싶은 니즈가 존재한다고 판단할 수 있다. 따라서, 수업 제공자 측은, 상기 동 영상 콘텐츠를 통하여, 사용자가 어느 부분을 궁금해 했는지에 대한 정보를 정확히 파악할 수 있다. 나아가, 제어부는 상기 기능 아이콘에 대한 선택 시, 사용자측으로부터 메모 정보를 입력받을 수 있다. 사 용자는, 어느 부분이 더 궁금한지, 또는 더 자세하게 배우고 싶은지에 대한 내용을 메모 정보로서 입력할 수 있 다. 이러한 메모 정보는 수업 제공자 측에 전달될 수 있다. 다음으로, 제4 수업 타입의 수업을 제공하는 방식에 대하여 살펴본다. 제4 수업 타입은, 사용자 단말에 동영상 콘텐츠를 제공하는 방식일 수 있다. 제4 수업 타입의 수업진행 방식은 “VOD 보기”로도 명명될 수 있다. 이 경 우, 사용자 단말은, 수업 제공자에 의해 등록된 동영상 콘텐츠를 본 발명에 따른 수업 플랫폼 시스템으로 부터, 스트리밍 방식 또는 다운로드 방식을 통하여 제공받을 수 있다. 도 9a에 도시된 것과 같이, 제4타입에 따 른 수업 제공 페이지에는, 적어도 하나의 수업(931, 932, 933)에 대한 동영상 콘텐츠를 구매할 수 있도록 하는 기능 아이콘(93a, 934)이 제공될 수 있다. 사용자는, 기능 아이콘을 통하여 적어도 하나에 대한 수업을 구 매하고, 구매한 수업에 대한 동영상 콘텐츠를 도 9b에 도시된 것과 같이 제공받을 수 있다. 한편, 특정 수업이 복수의 서브 수업들로 구성된 경우, 도 9a에 도시된 것과 같이, 제어부는, 복수의 서브 수업을 모두 구매한 사용자에게 할인된 금액으로 복수의 서브 수업을 제공할 수 있다. 한편, 도 9b에 도시된 것과 같이, 본 발명에 따른 수업 제공 시스템에서는 동영상 콘텐츠에 해당하는 수업을 구 매한 사용자에게, 수업 제공자와의 채팅을 제공할 수 있다. 따라서, 사용자는 동영상 콘텐츠를 통하여 특정 수 업을 수강한 뒤, 수업 제공자와의 채팅을 통하여, 궁금한 사항을 상담할 수 있다. 도시와 같이, 제어부는 사용자 측에서 채팅 채널 활성화를 위한 기능 아이콘이 선택되는 것에 근거하 여, 수업 제공자 측과의 채팅 채널을 활성화할 수 있다. 한편, 사용자와 수업 제공자와의 채팅이 시작되는 시간 은, 도 6a에서 살펴본 것과 같이, 지금 시작 또는 예약의 방식으로 진행될 수 있다. 위에서 살펴본 것과 같이, 본 발명에 따른 수업 제공 방법 및 시스템은, 특정 주제에 대한 복수의 수업에 대한 수업 정보를, 수업 진행 방식에 따라 서로 구분하여 제공할 수 있다. 따라서, 수업을 이용하고자 하는 사용자는 자신이 수업 진행 방식에 해당하는 수업을 보다 직관적으로 선택할 수 있다. 한편, 본 발명의 수업 플랫폼 운영방법에서는 인공지능 알고리즘에 기초한 특정인(일 예로, 고인, 유저의 아버 지 등)의 음성 데이터를 이용하여 심리 상담 서비스를 제공하여 유저의 심리를 정확하게 파악하여 맞춤형 수업 을 추천할 수도 있다.먼저, 장치는 고인의 음성 데이터를 수집할 수 있다(제1단계). 예로, 장치는 제1 사용자가 이용하는 단말 장치 로부터 고인의 생전 음성 데이터를 획득할 수 있다. 또 다른 예로, 장치는 제1 사용자가 이용하는 단말 장치로 부터 획득된 제1 사용자가 등장한 영상으로부터 제1 사용자의 음성 데이터를 추출할 수 있다. 또 다른 예로, 장치는 고인이 이용했던 단말 장치로부터 고인의 음성/영상 데이터를 추출할 수 있다. 즉, 제1 사용자가 이용하는 단말 장치는 장치가 제공하는 인공지능 알고리즘에 기초한 고인의 음성 데이터를 이 용하여 심리 상담 서비스를 제공하는 어플리케이션을 설치할 수 있다. 제1 사용자는 단말 장치에 표시되는 고 인의 음성 데이터를 합성/생성하기 위한 UI 화면 상에 고인의 생전 음성/영상 데이터를 입력할 수 있다. 그 다음, 장치는 고인의 음성 데이터를 전처리하고, 전처리된 고인의 음성 데이터에 대한 특징 데이터를 추출할 수 있다(제2단계). 장치는 고인의 음성 데이터를 처리하기 위하여 각종 전처리 동작을 수행할 수 있다. 예로, 장치는 수집된 고인의 음성 데이터의 노이즈를 제거하고, 샘플링/양자화 등을 수행하는 동작 등을 수행할 수 있 다. 그리고, 장치는 전처리된 고인의 음성 데이터로부터 특징 데이터를 추출할 수 있다. 예로, 장치는 전처리 된 고인의 음성 데이터가 각종 학습, 유사 측도, 분류 등에 활용될 수 있도록 해당 음성 데이터를 수치 배열로 데이터를 변환하여 특징 데이터를 추출할 수 있다. 그 다음, 장치는 추출된 특징 데이터로부터 획득할 수 있는 음소 유형의 개수가 제1 임계값을 초과하는지 여부 를 판단할 수 있다(제3단계). 구체적으로, 장치는 전처리된 고인의 음성 데이터로부터 추출된 특징 데이터를 이 용하여 고인의 음성을 생성하기 위해 필요한 음소 유형의 개수를 식별할 수 있다. 장치는 상기 음소 유형의 개 수가 제1 임계값을 초과하는지 여부를 판단할 수 있다. 여기서, 제1 임계값은 제1 사용자가 요구하는 고인의 음 성의 정밀도에 대응되는 수치에 기초하여 결정될 수 있다. 제1 사용자는 (제1 사용자가 이용하는) 단말 장치에 표시되는 고인의 음성 데이터를 합성/생성하기 위한 UI 화면 상에 제1 사용자가 요구하는 고인의 음성의 정밀도 에 대응되는 수치를 입력할 수 있다. 이때, 제1 사용자가 요구하는 고인의 음성의 정밀도에 대응되는 수치가 높 을수록 제1 임계값의 크기는 커질 수 있다. 제1 사용자가 요구하는 고인의 음성의 정밀도에 대응되는 수치가 낮을수록 제1 임계값의 크기는 작아질 수 있다. 음소의 개수가 제1 임계값을 초과하는 것으로 판단된 경우, 장치는 특징 데이터 및 특징 데이터에 대응되는 텍 스트 데이터에 기초하여 입력 텍스트에 대응되는 고인 음성이 출력되도록 제1 AI 모델을 학습시킬 수 있다(제4 단계). 음소의 개수가 제1 임계값을 초과한다는 것은 현재 추출된 특징 데이터를 통해서 고인의 음성을 생성/변환할 수 있다는 것을 의미할 수 있다. 이에 따라, 음소의 개수가 제1 임계값을 초과하는 것으로 판단된 경우, 장치는 특징 데이터 및 특징 데이터에 대응되는 텍스트 데이터(즉, 음성 성분을 가지는 특징 데이터를 텍스트로 변환하 였을 때의 데이터)에 기초하여 제1 AI 모델을 학습시킬 수 있다. 장치는 입력 텍스트에 대응되는 고인의 음성을 출력하도록 제1 AI 모델을 학습시킬 수 있다. 즉, 장치는 입력 텍스트를 고인의 음성으로 출력하는 TTS 모델로서 제1 AI 모델을 학습시킬 수 있다. 장치는 심리 상담 치료 및 인지 행동 치료를 위한 질문 텍스트 데이터베이스 및 답변 텍스트 데이터베이스에 기 초하여 질문 텍스트 또는 답변 텍스트를 출력하도록 학습된 제2 AI 모델의 출력 레이어에 제1 AI 모델의 입력 레이어를 연결함으로써 전체 AI 모델을 획득할 수 있다(제5단계). 그리고, 장치는 상담 치료 또는 인지 행동 치료를 위한 특정 질문이 포함된 제1 사용자 음성 데이터를 입력 데 이터로 이용하여 특정 질문에 대한 답변이 포함된 고인의 음성을 출력하도록 전체 AI 모델을 학습시킬 수 있다 (제6단계). 즉, 전이 학습 방식으로 전체 AI 모델이 학습될 수 있다. 구체적으로, 제2 AI 모델은 심리 상담 치 료 및 인지 행동 치료를 위한 질문 텍스트 데이터베이스 및 답변 텍스트 데이터베이스에 기초하여 질문 텍스트 또는 답변 텍스트를 출력하도록 학습될 수 있다. 예로, 질문 텍스트 데이터베이스로부터 특정 질문 텍스트가 입 력되면, 제2 AI 모델은 답변 텍스트 데이터베이스 중 특정 질문 텍스트에 대응되는 특정 답변 텍스트를 출력하 도록 학습될 수 있다. 또 다른 예로, 특정 답변 텍스트가 입력되면, 제2 AI 모델은 특정 답변 텍스트와 연관된 (또는/및 특정 답변 텍스트에 후속되는) 질문 텍스트를 출력하도록 학습될 수 있다. 이에 따라, 장치는 제2 AI 모델의 출력 레이어에 제1 AI 모델의 입력 레이어를 연결함으로써 전체 AI 모델을 구 성할 수 있다. 이에 따라, 제2 AI 모델의 출력 레이어에서 출력된 데이터는 제1 AI 모델의 입력 레이어에 입력 될 수 있다. 예로, 제2 AI 모델에서 출력된 답변/질문 텍스트가 제1 AI 모델에 입력됨으로써 제1 AI 모델이 해 당 답변/질문 텍스트가 고인의 음성으로 출력될 수 있다.추가적으로 또는 대안적으로, 전처리된 고인의 음성 데이터로부터 추출된 특징 데이터로부터 획득할 수 있는 음 소의 개수가 제1 임계값 이하인 것으로 판단된 경우, 장치는 고인의 음성과 연관된 제2 사용자의 음성 데이터에 기초하여 제1 AI 모델을 학습시킬 수 있다. 즉, 고인의 음성을 합성/생성할 수 있는 음소 유형의 개수가 제1 임계값 이하인 경우, 장치는 고인의 음성과 연 관된 다른 사용자의 음성 데이터를 이용하여 제1 AI 모델을 학습시킬 수 있다. 장치는 복수의 사용자의 음성 데이터로 구축된 음성 데이터베이스로부터 고인의 음성과의 유사도가 제2 임계값 을 초과하는 제2 사용자의 음성 데이터를 식별할 수 있다. 즉, 장치는 음성 데이터베이스로부터 고인의 음성과 유사한 제2 사용자의 음성을 식별할 수 있다. 예로, 장치는 음성 데이터베이스 상의 복수의 사용자의 음성 데이터로부터 특징 데이터를 추출하고, 복수의 사 용자의 음성 데이터의 특징 데이터와 고인의 음성 데이터로부터 추출된 특징 데이터 간의 유사도를 획득할 수 있다. 장치는 복수의 사용자의 음성 데이터 중 획득된 유사도가 제2 임계값을 초과하는 제2 사용자의 음성 데 이터를 식별할 수 있다. 장치는 제2 사용자의 음성 데이터로부터 추출된 특징 데이터로부터 획득할 수 없는 음소 유형과 관련된 보충 음 성 데이터를 추출할 수 있다. 장치는 특징 데이터 및 보충 음성 데이터를 합성하여 보정 음성 데이터를 획득할 수 있다. 즉, 장치는 음성의 유형의 개수가 부족한 고인의 음성 데이터에 다른 음성 데이터를 합성함으로써 보 정 음성 데이터를 추출할 수 있다. 예로, 보정 음성 데이터를 획득하기 위한 특징 데이터 및 보충 음성 데이터의 합성 비율은 A:B로 결정될 수 있 다. A는 고인의 음성 데이터로부터 추출된 특징 데이터로부터 획득할 수 있는 음소 유형의 개수에 제1 가중치 및 제2 가중치를 적용한 값이고, B는 고인의 음성 데이터로부터 추출된 특징 데이터로부터 획득할 수 없는 음소 유형의 개수에 제3 가중치 및 제4 가중치를 적용한 값일 수 있다. 예로, 고인의 음성 데이터로부터 추출된 특징 데이터로부터 획득할 수 있는 음소 유형의 개수에 제1 가중치 및 제2 가중치를 적용한 값이 A일 수 있으며, 고인의 음성 데이터로부터 추출된 특징 데이터로부터 획득할 수 없는 음소 유형의 개수에 제3 가중치 및 제4 가중치를 적용한 값이 B일 수 있다. 여기서, 제1 가중치는, 제1 사용자가 요구하는 상기 고인의 음성의 정밀도에 대응되는 수치에 기초하여 결정되 고, 제2 가중치는 고인의 음성의 고유도에 대응되는 수치에 기초하여 결정될 수 있다. 제3 가중치는 고인의 음성과 제2 음성 데이터 간의 유사도에 기초하여 결정되고, 제4 가중치는 제2 음성 데이터 의 고유도에 대응되는 수치에 기초하여 결정될 수 있다. 고인의 음성의 고유도에 대응되는 수치는 고인의 음성에 대응되는 음색 패턴에 기초하여 결정될 수 있다. 고인 의 음성의 특징 데이터는 고인의 음성의 음색 패턴을 나타내는 특징 벡터를 포함할 수 있다. 장치는 음성 데이 터베이스에 포함된 복수의 음성 각각의 음색 패턴을 나타내는 특징 벡터와 고인의 음성의 음색 패턴을 나타내는 특징 벡터 간의 연관도를 산출할 수 있다. 장치는 해당 연관도가 높을수록 제1 가중치를 낮은 값으로 결정할 수 있다. 장치는 해당 연관도가 낮을수록 제1 가중치를 높은 값으로 결정할 수 있다. 장치는 고인의 음성과 제2 음성 데이터 간의 유사도가 높을수록 제3 가중치를 높은 값으로 책정할 수 있다. 고 인의 음성과 제2 음성 데이터 간의 유사도가 높을 경우, 제2 음성 데이터의 비중을 높일 수 있다. 제2 음성의 고유도에 대응되는 수치는 고인의 음성의 고유도에 대응되는 수치와 유사한 방식으로 결정될 수 있 다. 상술된 제1 임계값 및 제2 임계값은 제1 사용자가 요구하는 고인의 음성의 정밀도에 대응되는 수치에 기초하여 결정될 수 있다. 제1 사용자가 요구하는 고인의 음성의 정밀도에 대응되는 수치가 높을수록, 장치는 제1 임계 값 및 제2 임계값을 더 높은 값으로 책정할 수 있다. 장치는 보정 음성 데이터 및 보정 음성 데이터에 대응되는 텍스트 데이터에 기초하여 제1 AI 모델이 학습시킬 수 있다. 그리고, 장치는 제2 AI 모델의 출력 레이어에 제1 AI 모델의 입력 레이어를 연결하여 전체 AI 모델을 학습시킬 수 있다. 여기서, 제1 사용자가 이용하는 단말 장치로부터 입력된 전체 AI 모델을 통해 출력된 고인의 목소리에 대한 평 가 점수가 제3 임계값 이하인 경우, A 값을 증가시킬 수 있다. 즉, 장치는 고인의 목소리의 특성이 더 반영되 도록 보정 음성 데이터를 생성할 수 있다. 그리고, 장치는 생성된 보정 음성 데이터에 기초하여 전체 AI 모델을 추가 학습시킬 수 있다."}
{"patent_id": "10-2023-0063320", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0063320", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 수업 플랫폼 시스템을 설명하기 위한 개념도이다. 도 2는 본 발명에 따른 수업 플랫폼 운영방법을 설명하기 위한 흐름도이다. 도 3은 본 발명에 따른 수업을 검색하는 방법을 설명하기 위한 개념도이다. 도 4a, 도 4b, 도 4c 및 도 5는 본 발명에 따른 수업 정보를 제공하는 방법을 설명하기 위한 개념도들이다. 도 6a, 도 6b, 도 7a, 도 7b, 도 7c, 도 7d, 8a, 도 8b, 도 8c, 도 9a 및 도 9b는 서로 다른 수업 진행 방식에 따른 인터페이스 환경을 설명하기 위한 개념도들이다."}
