{"patent_id": "10-2020-0087285", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0009057", "출원번호": "10-2020-0087285", "발명의 명칭": "인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템 및 이를 이용한 교량 모니터링 방", "출원인": "국토안전관리원", "발명자": "박성우"}}
{"patent_id": "10-2020-0087285", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 케이블에 의하여 지지되는 교량에 구비된 케이블의 일측에 설치되어 상기 케이블의 진동에 따른 가속도데이터를 측정하는 가속도계(100)와;상기 가속도계(100)에 의하여 측정된 상기 케이블의 진동에 따른 가속도 데이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정하는 인공지능부(200)와;선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 산출부(300)와;상기 산출부(300)에서 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기준 장력을비교하여 적정성 여부를 검증하는 비교부(400)를;포함한 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템."}
{"patent_id": "10-2020-0087285", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 비교부(400)에서 상기 케이블에 가해지는 장력에 대한 검증이 완료되면 반복적으로 상기 인공지능부(200)에서 재학습이 이루어지도록 하여 고유모드에 대한 패턴을 인식하도록 하는 인공지능 학습부(500)를 포함한 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템."}
{"patent_id": "10-2020-0087285", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 고유모드에 대한 패턴의 인식이 완료되면 검증 대상 주파수를 입력하여 상기 검증 대상 주파수에 대한 고유진동 모드와 동일 패턴 진동수를 산출함으로써 고유모드를 예측하여 교량의 관리가 지속적으로 이루어지도록하는 관리부(600)를 포함한 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템."}
{"patent_id": "10-2020-0087285", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 따른 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용한모니터링 방법으로서,교량의 케이블 일측에 설치된 가속도계를 이용하여 상기 교량을 지지하는 케이블의 진동에 따른 가속도 데이터를 측정하여 수집하는 제1단계(S1)와;가속도 데이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정하는 제2단계(S2)와;선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 제3단계(S3)와;산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기준 장력을 비교하여 적정성 여부를 검증하는 제4단계(S4)를;포함한 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용한 교량 모니터링방법."}
{"patent_id": "10-2020-0087285", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제2단계에서는 PP기법으로 계측된 응답신호를 퓨리에 변환시킴으로써 상기 유효 고유진동수를 선정하는 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용한 교량 모니터링 방법.공개특허 10-2022-0009057-3-청구항 6 제4항에 있어서,상기 제3단계에서 상기 케이블에 가해지는 장력을 계산시에는 , 또는 와 같은 수식이 사용되는 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용한 교량 모니터링 방법."}
{"patent_id": "10-2020-0087285", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 케이블에 가해지는 장력에 대한 검증이 완료되면 반복적으로 인공지능부에서 재학습이 이루어지도록 하여고유모드에 대한 진동수와 진폭의 분포 형상에 대한 패턴을 인식하도록 하는 제5단계(S5)를 진행하는 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용한 교량 모니터링 방법."}
{"patent_id": "10-2020-0087285", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 고유모드에 대한 패턴의 인식이 완료되면 검증 대상 주파수를 입력하여 상기 검증 대상 주파수에 대한 고유진동 모드와 동일 패턴 진동수를 산출함으로써 고유모드를 예측하여 교량의 관리가 지속적으로 이루어지도록하는 제6단계(S6)를 진행하는 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을이용한 교량 모니터링 방법."}
{"patent_id": "10-2020-0087285", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 복수의 케이블에 의하여 지지되는 케이블 지지 교량(사장교, 현수교)에 구비된 케이블의 일측에 설치 되어 상기 케이블의 진동에 따른 가속도 데이터를 측정하는 가속도계와; 상기 가속도계에 의하여 측정된 상기 케 이블의 진동에 따른 가속도 데이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필 (뒷면에 계속)"}
{"patent_id": "10-2020-0087285", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 건설 분야에 관한 것으로서, 상세하게는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템 및 이를 이용한 케이블 지지 교량 모니터링 방법에 관한 것이다."}
{"patent_id": "10-2020-0087285", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사장교, 현수교와 같은 케이블지지 교량은 국가사회간접시설의 핵심이 되는 도로의 주요 시설물로서, 설정한 설 계수명 동안 안전하게 기능을 수행할 수 있도록 설계되어, 공용기간 동안의 안정성과 사용성이 확보되도록 하고 있다. 이러한 교량은 시간이 경과함에 따라 교통 환경의 변화 및 재료의 열화 등과 같은 다양한 원인에 의해 손 상을 받게 되므로, 적절한 유지 관리를 통해 수명을 연장하는 것이 필요하다. 특히, 교량의 전체적인 거동을 나타내는 케이블에 가해지는 장력은, 교량의 성능 저하, 노후도를 판단하는 근거 로서 교량의 건전성 평가에 있어서 중요한 지표가 되므로, 교량의 케이블에 가해지는 장력을 주기적으로 모니터 링 하여 안전성을 확보하는 것은 중요한 과제가 되고 있다. 교량의 안정성을 확보하기 위한 종래의 기술을 살펴보면, 종래의 케이블 교량의 처짐 모니터링 시스템 및 케이 블 교량의 처짐 모니터링 방법(공개번호 제10-2018-0033680호)의 경우에는 타켓이 부착되는 케이블 교량을 촬영 한 영상으로부터 타켓 이미지를 획득하여 상기 타켓 이미지로부터 복수 개의 라인 인식을 통해 기준점을 자동 산출하여 케이블 교량의 처짐을 실시간으로 측정하도록 설계되어 있으나, 이러한 종래 기술은 획득한 이미지지 가 선명하지 않을 경우에는 교량의 이상여부에 대한 정확도가 저하된다는 문제점이 있다. 그리고, 종래의 교량 상시진동 모니터링 및 측정치 처리 방법(출원번호 제10-2018-0081657호)의 경우에는 다수 의 교량에 설치된 계측설비를 이용하여 지진 등 이상 상황 발생시에 진동센서에서 송출되는 시계열 원시정보를 누락없이 수집하여 수집된 정보를 통합 관리함으로써 정보의 활용도를 높일 수 있도록 설계되어 있으나, 이는 어느 하나의 교량에서 이상이 발생한 지점을 구체적으로 특정하여 이상 지점에 대한 유지 및 보수가 신속하게 이루어지도록 할 수 없다는 문제점이 있다. 따라서, 특수교 계측 시스템의 방대한 계측 데이터를 활용함으로써 고도의 분석기술의 적용을 활성화시킴과 동 시에 계측분석 기술자와 동등 이상의 분석 성능을 확보하여 기존 계측 분석에 의한 교량의 동적거동 분석 알고리즘의 기능적 신뢰성을 향상시키기 위한 필요성이 점점 대두되고 있는 실정이다."}
{"patent_id": "10-2020-0087285", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 도출된 것으로서, 케이블에 의하여 지지되는 교량(사장교, 현 수교)과 같은 방대한 구조물에서 케이블의 가속도 계측 데이터를 통하여 인공지능 기법을 활용하여 케이블의 거 동을 면밀하게 분석함으로써 교량의 전체적인 거동을 정확하게 모니터링하여 교량이 안정적으로 지지되도록 함 으로써 안전사고를 미연에 방지할 수 있도록 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 제시하는 것을 그 목적으로 한다."}
{"patent_id": "10-2020-0087285", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제의 해결을 위하여, 본 발명은 복수의 케이블에 의하여 지지되는 교량에 구비된 케이블의 일측에 설치 되어 상기 케이블의 진동에 따른 가속도 데이터를 측정하는 가속도계와; 상기 가속도계에 의하여 측정된 상기 케이블의 진동에 따른 가속도 데이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정하는 인공지능부와; 선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 산출부와; 상기 산출부에서 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기준 장력을 비교하여 적정성 여부를 검증하는 비교부를; 포함한 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 제시한다. 여기서, 상기 비교부에서 상기 케이블에 가해지는 장력에 대한 검증이 완료되면 반복적으로 상기 인공지능부에 서 재학습이 이루어지도록 하여 고유모드에 대한 패턴을 인식하도록 하는 인공지능 학습부를 포함할 수 있다. 그리고, 상기 고유모드에 대한 패턴의 인식이 완료되면 검증 대상 주파수를 입력하여 상기 검증 대상 주파수에 대한 고유진동 모드와 동일 패턴 진동수를 산출함으로써 고유모드를 예측하여 교량의 관리가 지속적으로 이루어 지도록 하는 관리부를 포함할 수 있다. 상기 과제의 해결을 위하여, 본 발명은 교량의 케이블 일측에 설치된 가속도계를 이용하여 상기 교량을 지지하 는 케이블의 진동에 따른 가속도 데이터를 측정하여 수집하는 제1단계와; 가속도 데이터에 인공지능 기법을 적 용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정하는 제2단계와; 선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 제3단계와; 산출된 상기 케 이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기준 장력을 비교하여 적정성 여부를 검증하는 제 4단계를; 포함한 것을 특징으로 하는 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용한 교량 모니터링 방법을 제시한다. 여기서, 상기 제2단계에서는 PP기법으로 계측된 응답신호를 퓨리에 변환시킴으로써 상기 유효 고유진동수를 선 정하도록 할 수 있다. 그리고, 상기 제3단계에서 상기 케이블에 가해지는 장력을 계산시에는 또는 와 같은 수식이 사용되도록 할 수 있다. 또한, 상기 케이블에 가해지는 장력에 대한 검증이 완료되면 반복적으로 인공지능부에서 재학습이 이루어지도록 하여 고유모드에 대한 패턴을 인식하도록 하는 제5단계를 진행하도록 할 수 있다. 아울러, 상기 고유모드에 대한 패턴의 인식이 완료되면 검증 대상 주파수를 입력하여 상기 검증 대상 주파수에 대한 고유진동 모드와 동일 패턴 진동수를 산출함으로써 고유모드를 예측하여 교량의 관리가 지속적으로 이루어 지도록 하는 제6단계를 진행할 수 있다."}
{"patent_id": "10-2020-0087285", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 케이블에 의하여 지지되는 교량과 같은 방대한 구조물에서 케이블의 가속도 계측 데이터를 통하여 케 이블의 거동을 면밀하게 분석함으로써 교량의 전체적인 거동을 정확하게 모니터링하여 교량이 안정적으로 지지되도록 함으로써 안전사고를 미연에 방지할 수 있도록 하는 효과가 있다. 그리고, 교량을 지지하는 케이블의 주파수를 이용하여 복수의 케이블의 고유진동수를 측정하고 이러한 고유진동 수를 기준으로 케이블에 가해지는 장력을 산출하여 교량을 실시간으로 모니터링함으로써 교량의 이상여부에 대 한 정확도를 높일 수 있는 효과가 있다. 또한, 하나의 교량을 지지하고 있는 복수의 케이블에 가해지는 장력을 개별 케이블에서 발생되는 주파수에 의하 여 산출되도록 하여 교량을 실시간으로 모니터링함으로써 교량의 이상이 발생한 지점을 더욱 구체적으로 특정하 여 상기 지점에 대한 유지 및 보수가 신속하게 이루어지도록 할 수 있는 효과가 있다."}
{"patent_id": "10-2020-0087285", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부도면을 참조하여 본 발명의 실시예에 관하여 상세히 설명한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템의 연결구조를 개략적으로 도시한 개략도이고, 도 2는 도 1의 인공지능부에서 가속도 데이터에 인공지능 기법을 적용하여 유효 고유동진수를 선정하는 과정을 도시한 개념도이며, 도 3은 본 발명의 일 실시예에 따른 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용하여 교량을 모니터링하는 과정을 개략적으로 도시한 개략도이고, 도 4는 도 3은 본 발명의 일 실시예에 따른 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용하여 케이블 지지 교량을 모니터링하는 과정을 순차적으로 기재한 흐름도이다. 이들 도면에 도시한 바와 같이, 본 발명에 의한 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템은, 복수의 케이블에 의하여 지지되는 지지 교량에 구비된 케이블의 일측에 설치되어 상기 케이블의 진동에 따른 가 속도 데이터를 측정하는 가속도계와; 상기 가속도계에 의하여 측정된 상기 케이블의 진동에 따른 가 속도 데이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정하는 인공지능부와; 선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 산출부와; 상기 산출부에서 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케 이블 관리에 사용되는 기준 장력을 비교하여 적정성 여부를 검증하는 비교부를; 포함하여 구성되어 있다. 교량에 구비된 케이블의 일측에 설치되는 가속도계는 교량을 지지하는 케이블의 고유진동수, 감쇠 등 주기 적 동적 특성을 확인하기 위하여 설치되는 장치이다. 인공지능부는 가속도계에 의하여 측정된 상기 케이블의 진동에 따른 가속도 데이터에 인공지능 기법 을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정하는 역할 을 한다. 인공지능부를 이용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모드별 유효 고유진동수를 선정시에는 PP기법으로 계측된 응답신호를 퓨리에 변환시킴으로써 상기 유효 고유진동수를 선정하게 된다. 도 2에 도시된 바와 같이, 교량 계측시스템의 가속도 데이터는 응답 신호를 이용하여 고유 특성치를 추출하는 방법이 적용되고 있으며, 고유치 추출기법은 PP기법(peak-picking)으로서 계측된 응답신호를 퓨리에 변환 (Fourier transformation)시켜서 스펙트럼의 첨두 주파수를 고유진동수로 취하게 된다. 주파수 분석 및 진동수 피크 추출 모듈을 이용하여 진동수의 피크치를 추출하고 여러 시간대의 진동수를 동일한 그래프에 표현하고, 이러한 과정을 시간대별로 확대하면 가속도계의 진동수 피크치가 유사한 진동수의 영역에분포되는 특성을 확인할 수 있다. 고유진동수는 케이블의 진동 특성에 의해 일정한 진동수에 대한 경계 범위를 형성하게 되며 고유진동수의 경계 범위는 인공지능 학습용 데이터의 구축을 위한 기준으로 활용될 수 있다. 이러한 케이블의 진동 특성은 에너지법칙에 근거하여 각 고유진동수는 모드 차수별로 등간격으로 분포하게 되는 데, 이러한 특성은 가속도계의 동적 특성 분석에 의해 확인되며 충분한 학습용 데이터가 만들어질 경우에 케이 블의 진동 모드에 대한 피크치는 명확해지게 된다. 산출부는 선정된 상기 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 역할을 한다. 상기 케이블에 가해지는 장력을 계산시에는 또는 와 같은 수 식이 사용되는데, 상기 수식은 아래의 장력과 고유진동수 관계를 활용한 수식으로부터 도출된다. - 아 래 -"}
{"patent_id": "10-2020-0087285", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, T는 장력, w는 단위길이당중량(kN/m), g는 중력가속도(9.82m/s2), L은 유효길이(m), f는 진동수, n은 진동모드이다. 또한, 다중모드를 사용하여 회귀분석을 통하여 T의 값을 구할 수 있으며 아래와 같은 수식을 이용한다."}
{"patent_id": "10-2020-0087285", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서 은 n차 모드에 대한 진동수, EI는 케이블의 휨강성으로서, 위의 식에 따라 a와 b를 구하면 그래프 상의 기울기(a)와 절편(b)을 통해 장력 T와 휨강성 EI를 산정할 수 있다. 한편, 비교부는 산출부에서 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용 되는 기준 장력을 비교하여 적정성 여부를 검증하는 역할을 한다. 도 3에 도시한 바와 같이, 인공지능 학습부는 상기 비교부에서 상기 케이블에 가해지는 장력에 대한 검증이 완료되면 반복적으로 상기 인공지능부에서 재학습이 이루어지도록 하여 고유모드에 대한 패턴을 인 식하도록 하는 역할을 한다. 인공지능 학습부에서 인공지능부에 학습이 이루어지도록 하는 과정은 케이블에 부착된 가속도계로부 터 원시데이터를 FFT에 의해 주파수로 변환하고 진동수와 진폭을 학습 데이터로 구성하여 이를 반복적으로 입력 하여 고유진동 모드에 대한 패턴을 인식하는 방법인 사용된다. 관리부는 상기 고유모드에 대한 패턴의 인식이 완료되면 검증 대상 주파수를 입력하여 상기 검증 대상 주 파수에 대한 고유진동 모드와 동일 패턴 진동수를 산출함으로써 고유진동 모드를 예측하여 교량의 관리가 지속 적으로 이루어지도록 하는 역할을 한다. 이러한 괸리부에서는 인공지능부에 의해 고유진동 모드에 해당하는 진동수의 패턴을 인식하여 학습이 이루어지도록 하고, 학습 모델에 검증용 주파수를 입력할 경우 고유진동 모드와 동일한 패턴의 진동수를 고유진 동 모드로 판정하는 방식이 사용된다. 상술한 바와 같은 구성을 갖는 본 발명의 일 실시예에 따른 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용하여 교량을 모니터링하는 과정을 도 4를 참조하여 설명하면 다음과 같다. 우선, 교량의 케이블 일측에 설치된 가속도계를 이용하여 상기 교량을 지지하는 케이블의 진동에 따른 가속도 데이터를 측정하여 수집하는 제1단계(S1)를 진행하게 된다. 그리고, 가속도 데이터에 인공지능 기법을 적용하여 추출된 주파수 중에서 비정상 고유 진동수를 필터링하여 모 드별 유효 고유진동수를 선정하는 제2단계(S2)를 진행하게 된다. 상기 제2단계에서는 상술한 바와 같이, PP기법으로 계측된 응답신호를 퓨리에 변환시킴으로써 상기 유효 고유진 동수를 선정하게 된다. 모드별 유효 고유진동수의 선정이 완료되면 선정된 상기 유효 고유진동수를 이용하여 상기 케이블에 가해지는 장력을 계산하는 제3단계(S3)를 진행하게 된다. 상기 제3단계에서 상기 케이블에 가해지는 장력을 계산시에는 , 또는 와 같은 수식이 사용된다. 그 후, 산출된 상기 케이블에 가해지는 장력과 기존의 상기 케이블 관리에 사용되는 기준 장력을 비교하여 적정 성 여부를 검증하는 제4단계(S4)를 진행한다. 그리고, 상기 케이블에 가해지는 장력에 대한 검증이 완료되면 반복적으로 인공지능부에서 재학습이 이루어지도 록 하여 고유모드에 대한 패턴을 인식하도록 하는 제5단계(S5)를 진행한다. 마지막으로 상기 고유모드에 대한 패턴의 인식이 완료되면 검증 대상 주파수를 입력하여 상기 검증 대상 주파수 에 대한 고유진동 모드와 동일 패턴 진동수를 산출함으로써 고유모드를 예측하여 교량의 관리가 지속적으로 이 루어지도록 하는 제6단계(S6)를 진행함으로써 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템 이용 하여 케이블 지지 교량을 모니터링하는 과정이 완료된다. 상술한 바와 같은 구성을 갖는 본 발명에 따른 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템은 케 이블에 의하여 지지되는 교량와 같은 방대한 구조물에서 케이블의 가속도 계측 데이터를 통하여 케이블의 거동 을 면밀하게 분석함으로써 교량의 전체적인 거동을 정확하게 모니터링하여 교량이 안정적으로 지지되도록 함으 로써 안전사고를 미연에 방지할 수 있게 된다. 이상은 본 발명에 의해 구현될 수 있는 바람직한 실시예의 일부에 관하여 설명한 것에 불과하므로, 주지된 바와 같이 본 발명의 범위는 위의 실시예에 한정되어 해석되어서는 안 될 것이며, 위에서 설명된 본 발명의 기술적 사상과 그 근본을 함께 하는 기술적 사상은 모두 본 발명의 범위에 포함된다고 할 것이다."}
{"patent_id": "10-2020-0087285", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템의 연결구조를 개략적으로 도시한 개략도이고, 도 2는 도 1의 인공지능부에서 가속도 데이터에 인공지능 기법을 적용하여 유효 고유동진수를 선정하는 과정을 도시한 개념도이며, 도 3은 본 발명의 일 실시예에 따른 인공지능 기법을 활용한 케이블지지 교량 모니터링 시스템을 이용하여 케이 블 지지 교량를 모니터링하는 과정을 개략적으로 도시한 개략도이고, 도 4는 도 3은 본 발명의 일 실시예에 따른 인공지능 기법을 활용한 케이블 지지 교량 모니터링 시스템을 이용 하여 교량을 모니터링하는 과정을 순차적으로 기재한 흐름도이다."}
