{"patent_id": "10-2016-0152213", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0054354", "출원번호": "10-2016-0152213", "발명의 명칭": "공작기계의 진동 적응제어방법", "출원인": "주식회사 대영테크", "발명자": "백대균"}}
{"patent_id": "10-2016-0152213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "(a) 공작기계, 공구 및 공작물의 정보를 인공지능에 입력하는 단계와;(b) 입력된 정보로부터 진동계로 모델링을 할 수 있도록 인공지능으로 학습하는 단계와;(c) 학습된 인공지능을 사용하여 실제 가공작업의 적응제어에서 입력정보로부터 다자유도 진동계에서 추가로 입력된 절삭력을 가진하여 변위 또는 가속도를 시뮬레이션하는 단계와;(d) 상기 진동 시뮬레이션으로 변위나 가속도를 예측하는 단계와;(e) 상기 변위나 가속도에 보상계수를 곱하여 변위 예측 보상값 또는 가속도 예측 보상값을 출력하는 단계와;(f) 상기 변위 예측 보상값 또는 상기 가속도 예측 보상값으로 변위 또는 가속도를 제어하는 단계;를 포함하는것을 특징으로 하는 공작기계의 진동 적응제어방법."}
{"patent_id": "10-2016-0152213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 단계 (c)에서, 절삭력 예측은,절삭조건과, CNC 프로그램에서 각각의 블록 코드와, 공구의 X, Y, Z의 좌표값과, 공구의 이송속도 및 주축의 회전속도의 데이터를 입력받아 계산하는 것을 특징으로 하는 공작기계의 진동 적응제어방법."}
{"patent_id": "10-2016-0152213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 단계 (f)의 가속도 제어는,(f1) 공작기계의 가속도 예측값을 상기 공작기계와 연결된 컴퓨터에서 예측하고, 상기 가속도 예측값에 보상계수를 곱하여 획득한 가속도 예측 보상값을 상기 컴퓨터의 제어보드에 입력하는 단계와;(f2) 상기 공작기계의 가속도센서가 측정한 가속도 측정값을 상기 컴퓨터의 제어보드에 입력하는 단계와;(f3) 상기 제어보드가 상기 가속도 측정값에 보상계수를 곱하여 가속도 측정 보상값을 계산하는 단계와;(f4) 상기 가속도 측정 보상값과 상기 가속도 예측 보상값을 비교하여, 상기 가속도 측정 보상값이 상기 가속도예측 보상값보다 큰지 판단하는 단계와;(f5) 상기 단계 (d)에서, 상기 가속도 측정 보상값이 상기 가속도 예측 보상값보다 큰 경우, 상기 공작기계의주축의 회전속도 및 이송축의 이송속도를 제어하기 위한 제어신호를 상기 메인 컨트롤러에 전송하여 진동이 감쇠되도록 하는 단계;를 포함하는 것을 특징으로 하는 공작기계의 진동 적응제어방법."}
{"patent_id": "10-2016-0152213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 (f5) 단계 이후에, 상기 컴퓨터는 상기 가속도 측정 보상값과 상기 가속도 예측 보상값을 화면에 표시하여진동 변화를 모니터링 하는 단계;를 더 포함하여 된 것을 특징으로 하는 공작기계의 진동 적응제어방법."}
{"patent_id": "10-2016-0152213", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 공작기계의 진동을 절삭 상황에 따라 적응제어하기 위한 공작기계의 진동 적응제어방법에 관한 것이다. 본 발명은 (a) 공작기계, 공구 및 공작물의 정보를 인공지능에 입력하는 단계와; (b) 입력된 정보로부터 진동계 (뒷면에 계속)"}
{"patent_id": "10-2016-0152213", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 공작기계의 진동을 절삭 상황에 따라 적응제어하기 위한 공작기계의 진동 적응제어방법에 관한 것이다."}
{"patent_id": "10-2016-0152213", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 공작기계는 메인 컨트롤러의 저장장치에 CNC프로그램을 저장하고 메인 컨트롤러가 주축과 이송축을 제어한다. 기존의 공작기계는 가공 중에 진동이 발생하게 되면 공작물의 표면조도를 나쁘게 하여 가공불량이 발생하고 경 우에 따라서는 공구가 파손되어 공작기계에 치명적인 손상을 가져오게 된다. 한편, 후술하는 본 발명의 선행문헌으로, 공개특허 제2014-0144343호(이하, 제1선행문헌이라 함)와, 등록특허 제10-1514147호(이하, 제2선행문헌이라 함)가 있다. 상기한 제1,2선행문헌들을 보면, 공작기계에 설치된 센서로부터 진동 정보를 수집하는 진동 데이터 수집 단계를 거쳐 수집된 진동 데이터에 근거하여 신호처리를 수행하여 채터(chatter) 진동을 판단하여, 이송속도를 조정하 는 단계(제1선행문헌 참조) 또는 세이킹(shaking)(제2선행문헌 참조)단계로 이루어져 있다. 그리고 이러한 일련의 단계는 하나의 컨트롤러에서 행해진다. 그런데, 상기한 종래의 채터 진동 제어 방법은, 절삭력, 절삭공구 길이, 절삭조건에 따라 다양하게 변하는 채터 진동을 제어하기에는 부적합하다."}
{"patent_id": "10-2016-0152213", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 창출된 것으로서, 공작기계에는 메인 컨트롤러를 구성하고, 공작기계와 연결되는 컴퓨터(PC)에는 컨트롤러를 구성하여 상기 컨트롤러는 공작기계의 센서들로부터 신호를 획 득하고 신호처리를 수행하여 채터 진동이라고 판명되면 출력신호를 공작기계에 통신하여 공작기계의 진동을 절 삭상황에 따라 적응 제어하도록 한 공작기계의 진동 적응제어방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2016-0152213", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 공작기계의 진동 적응제어방법은, (a) 공작기계, 공구 및 공작물 의 정보를 인공지능에 입력하는 단계와; (b) 입력된 정보로부터 진동계로 모델링을 할 수 있도록 인공지능으로 학습하는 단계와; (c) 학습된 인공지능을 사용하여 실제 가공작업의 적응제어에서 입력정보로부터 다자유도 진 동계에서 추가로 입력된 절삭력을 가진하여 변위 또는 가속도를 시뮬레이션하는 단계와; (d) 상기 진동 시뮬레 이션으로 변위나 가속도를 예측하는 단계와; (e) 상기 변위나 가속도에 보상계수를 곱하여 변위 예측 보상값 또 는 가속도 예측 보상값을 출력하는 단계와; (f) 상기 변위 예측 보상값 또는 상기 가속도 예측 보상값으로 변위 또는 가속도를 제어하는 단계;를 포함하는 것을 그 특징으로 한다. 본 발명에 있어서, 상기 단계 (c)에서, 절삭력 예측은, 절삭조건과, CNC 프로그램에서 각각의 블록 코드와, 공 구의 X, Y, Z의 좌표값과, 공구의 이송속도 및 주축의 회전속도의 데이터를 입력받아 계산한다. 상기 단계 (f)의 가속도 제어는, (f1) 공작기계의 가속도 예측값을 상기 공작기계와 연결된 컴퓨터에서 예측하 고, 상기 가속도 예측값에 보상계수를 곱하여 획득한 가속도 예측 보상값을 상기 컴퓨터의 제어보드에 입력하는 단계와; (f2) 상기 공작기계의 가속도센서가 측정한 가속도 측정값을 상기 제어보드에 입력하는 단계와; (f3) 상기 제어보드가 상기 가속도 측정값에 보상계수를 곱하여 가속도 측정 보상값을 계산하는 단계와; (f4) 상기 가속도 측정 보상값과 상기 가속도 예측 보상값을 비교하여, 상기 가속도 측정 보상값이 상기 가속도 예측 보상 값보다 큰지 판단하는 단계와; (f5) 상기 단계 (d)에서, 상기 가속도 측정 보상값이 상기 가속도 예측 보상값보 다 큰 경우, 상기 공작기계의 주축의 회전속도 및 이송축의 이송속도를 제어하기 위한 제어신호를 상기 메인 컨 트롤러에 전송하여 진동이 감쇠되도록 하는 단계;를 포함한다. 그리고 상기 (f5) 단계 이후에, 상기 컴퓨터는 상기 가속도 측정 보상값과 상기 가속도 예측 보상값을 화면에 표시하여 진동 변화를 모니터링 하는 단계;를 더 포함하게 된다."}
{"patent_id": "10-2016-0152213", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "종래에는 가속도센서의 신호만을 이용하여 모든 절삭조건에서 공작기계의 채터 진동이 심하면 공작기계의 주축 속도와 이송속도를 변화시켜 채터 진동을 제어하여 공작기계 진동 제어가 제대로 작동되지 않았지만, 본 발명의 실시예에 따르면, 소프트웨어에서 예측한 가속도와 실제 측정한 가속도를 비교하여 공작기계의 채터 진동 발생 유무를 판단하여 제어할 수 있다. 그리고 동일한 절삭조건에서 공구의 길이와 공작물의 형태에 따라 공작기계의 진동은 다양하게 변화하므로, 모 든 절삭조건에서 소프트웨어에서 진동을 예측하여 가공조건에 따라 적응제어할 수 있다. 따라서 채터 진동 발생 유무를 모든 절삭조건에서 정확하게 판단할 수 있으므로, 공작기계 진동제어 정밀도가 높고, 이러한 공작기계의 진동 제어에 따라 공작물의 가공 정밀도를 높이고, 공구 파손을 방지하여 공작기계를 보호할 수 있다."}
{"patent_id": "10-2016-0152213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도 1에는 본 발명에 따른 공작기계의 진동 적응제어방법이 적용된 공작기계의 진동 적응제어 시스템의 구성을 개략적으로 나타낸 구성도가 도시되어 있다. 그리고 도 2 및 도 3에는 본 발명에 따른 공작기계의 진동 적응제어방법을 순차적으로 도시한 순서도가 도시되 어 있다. 우선, 도 1을 참조하여, 본 발명에 따른 공작기계의 진동 적응제어방법이 적용된 공작기계의 진동 적응제어 시 스템의 구성을 설명하기로 한다. 공작기계에는 메인 컨트롤러가 구비되고, 컴퓨터(30, 이하, PC)라 함) 및 제어보드가 구비되며, 상 기 공작기계에는 다수의 센서가 구비되어 있다. 그리고 상기 제어보드는 PC 내에 구성될 수 있고, PC와 별도로 구성될 수 있다. 즉, 제어보드 를 PC에 내장할 수도 있고, PC에서 제어보드 역할을 수행할 수도 있다. 또한, 상기 제어보드는 공작기계의 센서들로부터 신호를 획득하고 신호처리를 수행하여 채터 진동이라 고 판명되면 출력신호를 공작기계에 통신하여 주축의 속도와 이송속도를 제어한다. 즉, 본 발명은 공작기계의 진동을 절삭상황에 따라 적응제어 한다. 그리고 상기 센서는 공작기계의 진동을 측정할 수 있는 진동센서로 가속도센서 또는 근접센서를 사용하 고, 절삭력을 측정할 수 있는 절삭력센서는 피에조 센서 또는 전류센서를 사용한다. 또한, 상기 PC는 공작기계의 물성치, 공구길이, 공구직경 등을 입력하여 진동시스템으로 모델링하고, 가공조건을 입력하여 예측된 절삭력을 진동시스템에 가진하여 공작기계의 허용 진동 예측값을 시뮬레이션한 다. 그리고 상기 허용 예측 진동값을 제어보드에 전달하여 절삭상황에 따라 진동을 제어하는 기준값으로 사용한 다. 또한, 공작기계의 메인 컨트롤러와 제어보드 및 PC는 상호통신을 통하여 정보를 주고받고, PC에서 예측된 채터 진동 기준값을 사용하여 제어보드에서 채터 진동 발생 유무를 판단하여 공작기계 주축과 이송축의 속도 제어값을 공작기계의 메인 컨트롤러에 전송한다. CNC 프로그램 라인번호와 현재 가공좌표를 공작기계에서 제어보드를 통하여 PC에 전달하여 절삭력 예측과 가속도 예측을 공작기계의 메인 컨트롤러와 동일한 CNC 블록에서 계산하게 한다.그리고 공작기계는 주축의 회전속도, 이송축의 이송속도를 조정하여 PC에서 예측한 허용값 이하에 머물 게 한다. 이러한 구성을 이용하여 본 발명에 따른 공작기계의 진동 적응제어방법을 순차적으로 도시한 도 2 및 도 3의 순 서도를 참조하여 설명한다. 우선, 도 2에 도시된 바와 같이, 공작기계, 공구 및 공작물의 정보를 인공지능에 입력한다.(단계 S1) 이어서, 입력된 정보로부터 진동계로 모델링을 할 수 있도록 인공지능으로 학습한다.(단계 S2) 그리고 학습된 인공지능을 사용하여 실제 가공작업의 적응제어에서 입력정보로부터 다자유도 진동계에서 추가로 입력된 절삭력을 가진하여 변위 또는 가속도를 시뮬레이션한다.(단계 S3) 또한, 상기 진동 시뮬레이션으로 변위나 가속도를 예측한다.(단계 S4,S5) 상기 변위나 가속도에 보상계수를 곱하여 변위 예측 보상값 또는 가속도 예측 보상값을 출력(또는 디스플레이) 한다.(단계 S6) 그리고 상기 변위 예측 보상값 또는 가속도 예측 보상값으로 변위 또는 가속도를 제어한다.(단계 S7) 상기 단계 S3에서, 절삭력 예측은, 절삭조건과, CNC 프로그램에서 각각의 블록 코드와, 공구의 X, Y, Z의 좌표 값과, 공구의 이송속도 및 주축의 회전속도의 데이터를 입력받아 계산한다.(단계 S3') 그리고 도 3에 도시된 바와 같이, 상기 단계 S7의 가속도 제어는, 우선, 공작기계의 가속도 예측값을 공작 기계와 연결된 PC에서 예측하고, 상기 가속도 예측값에 보상계수를 곱하여 획득한 가속도 예측 보상값 을 PC의 제어보드에 입력한다.(단계 S11) 이어서, 상기 공작기계의 가속도센서가 측정한 가속도 측정값을 PC의 제어보드에 입력한다.(단계 S12) 그리고 상기 제어보드가 가속도 측정값에 보상계수를 곱하여 가속도 측정 보상값을 계산한다.(단계 S13) 즉, PC에서 절삭력을 예측하고 진동계에서 가속도를 예측하고 보상값을 곱하여 가속도 예측 보상값을 계산 하여 제어보드에 전달하고, 가속도 센서로부터 가속도 측정값을 입력받아 가속도 측정값에 보상값을 곱하여 제어보드에서 가속도 측정 보상값을 계산한다. 또한, 상기 가속도 측정 보상값과 가속도 예측 보상값을 비교하여, 상기 가속도 측정 보상값이 가속도 예측 보 상값보다 큰지 판단한다.(단계 S14) 상기 단계 S14에서, 상기 가속도 측정 보상값이 가속도 예측 보상값보다 큰 경우, 공작기계의 주축의 회전 속도 및 이송축의 이송속도를 제어하기 위한 제어신호를 공작기계의 메인 컨트롤러에 전송하여 진동이 감쇠되도록 한다.(단계 S15) 즉, 상기 제어보드에서 가속도 예측 보상값과 가속도 측정 보상값을 비교하여 가속도 측정 보상값이 크면 공작기계의 주축과 이송축을 제어하기 위한 제어신호를 공작기계의 메인 컨트롤러에 전달한다. 이 전달방법은 RS232C, DIO, DA 신호로 공작기계로 전달한다. 그리고 상기 S15 단계 이후에, 상기 PC는 가속도 측정 보상값과 가속도 예측 보상값을 PC 화면에 표시 (디스플레이)하여 진동 변화를 모니터링 한다.(단계 S16) 즉, 측정값과 예측값은 PC 화면(또는 디스플레이)에 표시하여 절삭상황을 작업자가 모니터링할 수 있게 한 다. 이어서, 공작기계가 작동 중인지 판단하여, 작동 중이면 상기 단계 S11부터 재시작을 하고, 작동 중이지 않 으면 본 플로우를 종료한다.(단계 S17) 한편, 상기 단계 S14에서, 상기 가속도 측정 보상값이 가속도 예측 보상값보다 크지 않은 경우, 상기 단계 S15 를 수행하지 않고, 바로 상기 단계 16을 수행한다. 상기와 같이 본 발명은 도 4에 도시된 바와 같이, 공구의 직경 및 길이, 툴홀더의 직경 및 길이, 공작기계 중량 및 크기, 공작물의 중량 및 형상 정보 등을 입력하여 절삭시스템을 인공지능으로 진동계로 PC에서 모 델링을 한다. 그리고 모델링을 위한 입력정보는 입력 데이터시트(Data sheet)에서 작업자가 작성하거나 CAM소프트웨어에서 나 온 가공시트 파일(File)에서 입력한다. 또한, 입력된 정보로부터 다자유도 진동계로 모델링할 수 있도록 인공지능으로 학습한다. 그리고 학습된 인공지능을 사용하여 실제 가공작업의 적응제어에서 입력정보로부터 다자유도 진동계에서 추가로 입력된 절삭력을 가진하여 변위 또는 가속도를 시뮬레이션한다. 시뮬레이션한 변위나 가속도에 보상계수를 곱하여 진동 적응제어의 기준값으로 사용한다. 또한, 가속도 제어는 가속도 예측값에 보상계수를 곱한 가속도 예측 보상값을 입력한다. 그리고 진동센서로부터 측정한 가속도값에 마찬가지로 보상계수를 곱하여 측정 보상값을 계산한다. 만약 측 정 보상값이 예측 보상값이 더 크면 주축의 회전속도와 이송축의 이송속도 제어 신호를 메인 컨트롤러에 전 송하여 가속도가 감소하게 한다. 그리고 PC 화면에 측정 보상값과 예측 보상값을 표시하여 가속도 변화를 모니터링 한다. 그리고 진동계 모델링 방법 중 우선, 공작기계 전체를 진동계로 모델링하는 방법을 설명하면, 도 5에 도시 된 바와 같이, 공작기계 정보(공작기계 중량, 크기, 공작기계 타입(Type)), 공구 정보(공구직경, 공구길이, 툴홀더의 직경 및 길이, 툴홀더 타입(Type)), 공작물 정보(공작물의 중량, 공작물 높이) 및 공작물 지그부(Jig part) 정보(지그 중량, 지그 높이)를 인공지능에 입력하여 학습하게 하여 위에 설명한 바와 같은 방 법으로 제어를 한다. 또한, 공구부분과 공작물을 분리하여 진동계로 모델링하는 방법을 설명하면, 도 6에 도시된 바와 같이, 우선, 공구 부분을 진동계로 모델링하는 방법은 공작기계 정보(공작기계 중량, 크기, 공작기계 타입 (Type))와 공구 정보(공구직경, 공구길이, 툴홀더의 직경 및 길이, 툴홀더 타입(Type))를 인공지능에 입력하여 학습하게 하여 위에 설명한 바와 같은 방법으로 제어를 한다. 그리고 공작물 부분을 진동계로 모델링하는 방법은, 도 7에 도시된 바와 같이, 공작물 정보(공작물의 중량, 공 작물 높이)와 공작기계 지구부(지그 중량, 지그 높이) 정보를 인공지능에 입력하여 학습하게 하여 위에 설 명한 바와 같은 방법으로 제어를 한다. 상술한 바와 같이 본 발명은 도면에 도시된 일 실시예를 참고로 설명되었으나, 이는 예시적인 것에 불과하며,"}
{"patent_id": "10-2016-0152213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "당해 기술분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 실시예가 가능하다는 점을 이해 할 것이다. 따라서 본 발명의 진정한 보호 범위는 첨부된 청구범위에 의해서만 정해져야 할 것이다."}
{"patent_id": "10-2016-0152213", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 공작기계의 진동 적응제어방법이 적용된 공작기계의 진동 적응제어 시스템의 구성을 개 략적으로 나타낸 구성도. 도 2 및 도 3에는 본 발명에 따른 공작기계의 진동 적응제어방법을 순차적으로 도시한 순서도. 도 4 내지 도 7은 본 발명에 따른 공작기계의 진동 적응제어방법을 설명하기 위한 설명도."}
