{"patent_id": "10-2017-0178882", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0084181", "출원번호": "10-2017-0178882", "발명의 명칭": "사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템 및 그 제어방법", "출원인": "계명대학교 산학협력단", "발명자": "김윤년"}}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "수술등 시스템으로서,수술 부위를 조명하는 수술등 장치;사용자로부터 입력신호를 감지하는 센서 장치; 및상기 센서 장치에 감지된 입력신호에 따라, 상기 수술등 장치를 자동으로 제어하는 제어 장치를 포함하는 것을특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 수술등 장치는,수술 부위 조명을 위한 빛을 방출하는 방출부; 및수술등 시스템의 조명 위치를 조절할 수 있는 운동부를 포함하는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 방출부는,광원모듈;반사모듈; 및렌즈모듈을 포함하는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 운동부는,직선운동모듈;회전운동모듈; 및비틀림운동모듈을 포함하는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 수술등 장치는,수술대에 탈부착 가능하도록 구성되는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2019-0084181-3-제1항에 있어서, 상기 센서 장치는,상기 사용자의 특정 동작에 의해 감지를 시작하는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 특정 동작은,눈 깜빡임, 한 곳을 응시하는 것을 포함하는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 센서 장치는,상기 사용자로부터 동작 입력신호를 감지할 수 있는 동작감지 센서를 포함하는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 센서 장치는,상기 사용자로부터 소리 입력신호를 감지할 수 있는 소리감지 센서를 포함하는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 소리감지 센서는,상기 사용자로부터 감지된 소리 입력신호를 통해 수술등 장치의 조도, 밝기를 제어할 수 있는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 센서 장치는,상기 수술등 장치에 직접 결합되는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 상기 센서 장치는,수술용 안경의 일부분에 결합되는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서, 상기 센서 장치는,공개특허 10-2019-0084181-4-방출부의 제어를 위한 제1 센서부; 및운동부의 제어를 위한 제2 센서부를 포함하여 이루어지는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서, 상기 제어 장치는,인공지능으로 구성되는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서, 상기 제어 장치는,상기 수술등 장치, 또는 상기 센서 장치에 직접 결합되는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라자동으로 제어되는 수술등 시스템."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "수술등 시스템의 제어방법으로서,(1) 센서 장치가 사용자로부터 입력신호를 감지하는 단계;(2) 상기 단계 (1)에서 감지된 입력신호에 기초하여, 감지된 상황에 대한 정보를 해석하여 주변 상황을 자동으로 판단하는 단계; 및(3) 상기 단계 (2)에서 판단된 주변 상황에 따라 수술등 장치가 제어되는 단계를 포함하는 것을 특징으로 하는,사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 제어방법."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 수술등 장치는,수술 부위 조명을 위한 빛을 방출하는 방출부; 및 수술등 시스템의 조명 위치를 조절할 수 있는 운동부를 포함하는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 제어방법."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서, 상기 센서 장치는,상기 사용자로부터 동작 입력신호를 감지할 수 있는 동작감지 센서를 포함하여 이루어지는 것을 특징으로 하는,사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 제어방법."}
{"patent_id": "10-2017-0178882", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서, 상기 센서 장치는,상기 사용자로부터 소리 입력신호를 감지할 수 있는 소리감지 센서를 포함하여 이루어지는 것을 특징으로 하는,사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 제어방법.공개특허 10-2019-0084181-5-청구항 20 제16항에 있어서, 상기 제어 장치는,인공지능으로 구성되는 것을 특징으로 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 제어방법."}
{"patent_id": "10-2017-0178882", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에 관한 것으로서, 보다 구체적으로 는, 수술등 시스템으로서, 수술 부위를 조명하는 수술등 장치, 사용자로부터 입력신호를 감지하는 센서 장치, 및 상기 센서 장치에 감지된 입력신호에 따라, 상기 수술등 장치를 자동으로 제어하는 제어 장치를 포함하는 것을 (뒷면에 계속)"}
{"patent_id": "10-2017-0178882", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 수술등 시스템 및 제어방법에 관한 것으로서, 보다 구체적으로는 사용자로부터의 입력신호에 따라 자 동으로 제어되는 수술등 시스템 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2017-0178882", "section": "발명의_설명", "subsection": "배경기술", "item": 1, "content": "도 1은 수술용 수술등의 일반적인 사진이다. 수술용 수술등은 수술대나 치료대 위의 환자의 환부에 그림자가 생기지 않도록 하고, 환부를 균일한 밝기로 조명함으로써 수술을 용이하게 하기 위한 장치로서, 수술 중 환부의 위치, 절개부위의 깊이 또는 면적에 따라 수술을 원활히 진행하기 위해서는 수술등의 조사위치, 조사면적 및 조 사각도를 손쉽게 조절할 수 있어야 한다. 즉 수술 상황 및 절개부위의 3차원적 형상에 따라 수술이 진행되는 부위를 조사하기 위하여 조사위치를 조절하고, 광원에서 집광면(수술 부위 또는 절개 부위)으로 향하는 광 조사 각도를 조절하고, 또한, 수술 부위의 크기에 알맞게 광이 조사되는 면적을 조절할 필요가 있다. 수술 중 시술자의 시야를 밝히기 위하여 수술등의 광 조사위치, 조사각도 및 조사면적의 조절은 반드시 필요하 며, 이는 도 2에 도시된 바와 같이, 수술용 수술등의 손잡이를 시술자가 직접 만지거나, 도움의(assistant)의 조작이 필수적으로 요구된다. 이로 인한 수술 중 감염의 기회는 높아진다. 일반적으로 장기 이식 수술, 정형 외과적 임플란트 수술, 심장 수술, 뇌수술 등의 경우는 수술 부위 감염이 치 명적이 될 수 있는 수술들이다. 2014년 질병본부의 우리나라의 의료기관 수술실 감염 실태 및 환경조사를 통한 감염예방 전략 개발 학술연구 용역과제 보고서에 따르면, 우리나라의 수술 부위 감염률은 2~9.7%로 보고되고 있 다. 이러한 수술 부위 감염으로 인한 재원기간의 연장은 평균 5~20일, 의료비 추가 지급은 약 215만원이며, 전 체 비용 중 약 30%가 상처치료 및 약제비용으로 소요되고 있다. 특히, 수술 부위 감염을 효과적으로 예방하기 위한 수술실의 최초 시설기준이 필요하며, 수술 부위 감염예방을 위한 지침의 개발 및 적용을 통해 수술 부위 감염을 줄일 수 있는 방안이 요구되고 있다. 종래기술로서, 특허공보 제10-1712092호가 존재한다. 해당 등록특허에서는 수술등 장치가 게시되어 있다. 상 기 등록특허의 경우, 장기 이식 수술, 정형 외과적 임플란트 수술, 심장수술, 뇌수술의 경우의 수술 중 시술자 의 시야를 밝히기 위해 수술용 조명 손잡이를 반드시 조작해야 한다는 문제가 있다."}
{"patent_id": "10-2017-0178882", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존에 제안된 방법들의 상기와 같은 문제점들을 해결하기 위해 제안된 것으로서, 수술 부위를 조명 하는 수술등 장치, 사용자로부터 입력신호를 감지하는 센서 장치, 및 센서 장치에 감지된 입력신호에 따라, 상 기 수술등 장치를 자동으로 제어하는 제어 장치로 구성함으로써, 장기 이식 수술, 정형 외과적 임플란트 수술, 심장 수술, 뇌수술 등의 수술 중 시술자의 시야를 밝히기 위하여 수술용 조명 손잡이를 반드시 조작해야하는 문 제를 해결하여 수술 중 감염을 방지하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템을 제공하는 것을 그 목적으로 한다.또한, 본 발명은, 센서 장치가, 눈 깜빡임, 한 곳을 응시하는 것 등의 특정 동작에 의해 감지를 시작하게 하고, 제어 장치가 인공지능으로 구성되게 함으로써, 최신 IT 기술과 수술 로봇의 융합을 통한 제어로 시술의의 사용 의 편의성이 더욱 향상될 수 있는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템을 제공하 는 것을 다른 목적으로 한다."}
{"patent_id": "10-2017-0178882", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 특징에 따른, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술 등 시스템은, 수술등 시스템으로서, 수술 부위를 조명하는 수술등 장치; 사용자로부터 입력신호를 감지하는 센서 장치; 및 상기 센서 장치에 감지된 입력신호에 따라, 상기 수술등 장치를 자동으로 제어하는 제어 장치를 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 수술등 장치는, 수술 부위 조명을 위한 빛을 방출하는 방출부; 및 수술등 시스템의 조명 위치를 조절할 수 있는 운동부를 포함할 수 있다. 더 바람직하게는, 상기 방출부는, 광원모듈; 반사모듈; 및 렌즈모듈을 포함할 수 있다. 더 바람직하게는, 상기 운동부는, 직선운동모듈; 회전운동모듈; 및 비틀림운동모듈을 포함할 수 있다. 바람직하게는, 상기 수술등 장치는, 수술대에 탈부착 가능하도록 구성할 수 있다. 바람직하게는, 상기 센서 장치는, 상기 사용자의 특정 동작에 의해 감지를 시작할 수 있다. 더 바람직하게는, 상기 특정 동작은, 눈 깜빡임, 한 곳을 응시하는 것을 포함할 수 있다. 바람직하게는, 상기 센서 장치는, 상기 사용자로부터 동작 입력신호를 감지할 수 있는 동작감지 센서를 포함할 수 있다. 바람직하게, 상기 센서 장치는, 상기 사용자로부터 소리 입력신호를 감지할 수 있는 소리감지 센서를 포함할 수 있다. 더 바람직하게는, 상기 소리감지 센서는, 상기 사용자로부터 감지된 소리 입력신호를 통해 수술등 장치의 조도, 밝기를 제어할 수 있다. 바람직하게는, 상기 센서 장치는, 수술등 장치에 직접 결합될 수 있다. 바람직하게는, 상기 센서 장치는, 수술용 안경의 일부분에 결합될 수 있다. 바람직하게는, 상기 센서 창치는, 방출부의 제어를 위한 제1 센서부; 및 운동부의 제어를 위한 제2 센서부를 포함할 수 있다. 바람직하게는, 상기 제어 장치는, 인공지능으로 구성될 수 있다. 바람직하게, 상기 제어 장치는, 수술등 장치, 또는 센서 장치에 직접 결합될 수 있다. 또한, 상기한 목적을 달성하기 위한 본 발명의 다른 특징에 따른, 사용자로부터의 입력신호에 따라 자동으로 제 어되는 수술등 시스템의 제어방법은, 수술등 시스템의 제어방법으로서, 센서 장치가 사용자로부터 입력신호를 감지하는 단계; 상기 단계 에서 감지된 입력신호에 기초하여, 감지된 상황에 대한 정보를 해석하여 주변 상황을 자동으 로 판단하는 단계; 및 상기 단계 에서 판단된 주변 상황에 따라 수술등 장치가 제어되는 단계를 포함하는 것을 그 구성상의 특 징으로 한다. 바람직하게는, 상기 수술등 장치는, 수술 부위 조명을 위한 빛을 방출하는 방출부; 및 수술등 시스템의 조명 위치를 조절할 수 있는 운동부를 포함할 수 있다. 바람직하게는, 상기 센서 장치는, 상기 사용자로부터 동작 입력신호를 감지할 수 있는 동작감지 센서를 포함할 수 있다. 바람직하게는, 상기 센서 장치는, 상기 사용자로부터 소리 입력신호를 감지할 수 있는 소리감지 센서를 포함할 수 있다. 바람직하게는, 상기 제어 장치는, 인공지능으로 구성될 수 있다."}
{"patent_id": "10-2017-0178882", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안하고 있는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에 따르면, 수술 등 시스템이, 수술 부위를 조명하는 수술등 장치, 사용자로부터 입력신호를 감지하는 센서 장치, 및 센서 장치 에 감지된 입력신호에 따라, 상기 수술등 장치를 자동으로 제어하는 제어 장치로 구성함으로써, 장기 이식 수술, 정형 외과적 임플란트 수술, 심장 수술, 뇌수술 등의 수술 중 시술자의 시야를 밝히기 위하여 수술용 조 명 손잡이를 반드시 조작해야하는 문제를 해결하여 수술 중 감염을 방지할 수 있다. 또한, 본 발명에 따르면, 센서 장치가, 눈 깜빡임, 한 곳을 응시하는 것 등의 특정 동작에 의해 감지를 시작하 게 하고, 제어 장치가 인공지능으로 구성되게 함으로써, 최신 IT 기술과 수술 로봇의 융합을 통한 제어로 시술 의의 사용의 편의성이 더욱 향상될 수 있다."}
{"patent_id": "10-2017-0178882", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하 게 실시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명 함에 있어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체 에 걸쳐 동일 또는 유사한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 ‘연결’되어 있다고 할 때, 이는 ‘직접적으로 연결’되어 있는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 ‘간접적으로 연결’되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 ‘포함’한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 도 3은 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 구성을 도시한 도면이고, 도 4는 본 발명의 일실시예에 따른 사용자로부터 입력신호에 따라 자동으로 제어되는 수술등 시스템의 블록도를 도시한 도면이다. 도 3 및 도 4에 도시된 바와 같이, 본 발명의 일실시예에 따른 사용자로 부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템은, 수술 부위를 조명하는 수술등 장치, 사용자 로부터 입력신호를 감지하는 센서 장치, 및 센서 장치에 감지된 입력신호에 따라, 수술등 장치 를 자동으로 제어하는 제어 장치를 포함하여 구성될 수 있다. 수술등 장치는, 수술 동안 그림자 없는 밝은 빛을 제공하는 장치이다. 도 3에서 확인할 수 있는 바와 같 이, 수술등 장치는 센서 장치와 결합될 수 있으며 센서 장치가 사용자로부터 입력신호를 감지한 후, 센서 장치에 감지된 입력신호에 따라 제어 장치가 수술등 장치를 자동으로 제어하여 수술 부위를 조명한다. 또한, 수술등 장치는, 수술 부위 조명을 위한 방출부와 수술등 장치의 조명 위치를 조절할 수 있는 운동부를 포함할 수 있다. 도 5는 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 수 술등 장치의 방출부와 운동부를 설명하기 위하여 도시한 도면이다. 도 5에 도시된 바와 같이, 수술등 장치는, 수술 부위 조명을 위한 빛을 방출하는 방출부와 수술등 시스템의 조명 위치를 조절할 수 있는 운동부로 구성될 수 있다. 이때, 방출부는 광원모듈, 반사모듈, 및 렌즈모듈 로 구성되어 있어, 광원모듈으로부터 나온 빛을 반사모듈과 렌즈모듈로 집속하여 수술 부 위를 비추어 준다. 또한, 운동부는 직선운동모듈, 회전운동모듈, 및 비틀림운동모듈로 구 성되어 있어, 직선운동모듈로 수술등 장치의 길이를 조절할 수 있고, 회전운동모듈을 이용해 수 술등 장치가 회전이 가능하며, 비틀림운동모듈을 통해 수술등 장치의 각도를 조절할 수 있다. 이와 같이, 운동부는 직선운동모듈, 회전운동모듈, 및 비틀림운동모듈을 통해, 수술등 장 치의 방출부를 수술 중 필요한 특정 위치, 및 각도로 이동시킬 수 있다. 도 6은 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 수 술대에 탈부착 가능하다는 것을 설명하기 위해 도시한 도면이다. 도 6에 도시된 바와 같이, 수술등 장치 가 수술대에 홈을 통하여 쉽게 탈부착 될 수 있다. 수술등 장치를 수술대에 탈부착 가능하 도록 구성함으로써, 수술등 장치를 더욱 편리하게 이용할 수 있을 것이다. 수술등 장치가 수술대 에 탈부착 되는 방법으로는, 앞서 기술한 홈을 통한 탈부착에 한정되는 것은 아니다. 센서 장치는, 사용자로부터 입력신호를 감지하는 역할을 한다. 도 7은 본 발명의 일실시예에 따른 사용자 로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 사용자의 특정 동작에 의해 감시를 시작하는 것을 설명하기 위해 도시한 도면이다. 도 7에 도시된 바와 같이, 센서 장치는, 대기 상태에서 사용자의특정 동작을 인식함으로써, 감지를 시작한다. 이때, 사용자의 특정 동작은 미리 지정된 회수의 눈 깜빡임, 미 리 지정된 시간 동안 한곳을 응시하는 것 중 적어도 어느 하나의 동작일 수 있으나, 상기에 나열된 것으로 한정 하는 것은 아니다. 도 8은 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 동 작감지 센서와 소리감지 센서를 더 포함하는 구성을 도시한 도면이다. 도 8에 도시된 바와 같이, 사용자로부터 의 입력신호의 종류가 동작인 경우, 사용자로부터 동작입력신호를 감지할 수 있는 동작감지 센서를 포함할 수 있다. 동작입력신호로는 사용자의 손동작, 수술도구의 움직임 등이 될 수 있으나, 상기에 나열된 것으로 한정 하는 것은 아니다. 동작감지 센서로는 카메라 센서가 사용될 수 있다. 또한, 사용자로부터의 입력신호의 종류 가 소리인 경우, 사용자로부터 소리입력신호를 감지할 수 있는 소리감지 센서를 포함할 수 있다. 소리입력신호 로는 “밝게”, “어둡게”, “줌 인”, “줌 아웃” 등과 같은 사용자의 소리신호가 될 수 있으나, 상기에 나 열된 것으로 한정되는 것은 아니다. 소리감지 센서로는 마이크 센서가 사용될 수 있다. 센서 장치는, 도 3에서 확인할 수 있는 바와 같이, 수술등 장치와 직접 결합되어 이루어 질 수 있고, 도 9에서 확인할 수 있는 바와 같이. 수술용 안경의 일부분에 결합될 수도 있다. 센서 장치는, 방출 부의 제어를 위한 제1 센서부와, 운동부의 제어를 위한 제2 센서부를 포함할 수 있다. 제 1 센서부 및 제2 센서부는 동작감지 센서, 소리감지 센서 중 적어도 어느 하나일 수 있으나, 상기에 나열된 것으로만 한정되는 것은 아니다. 제1 센서부는, 수술등 장치의 방출부가 수술 상황에 알맞게 작동하기 위하여 필요한 정보를 감 지할 수 있다. 제1 센서부는, 수술을 시작할 때, 자동으로 광원모듈이 작동하도록 할 수 있으며, 수 술 도중 빛의 밝기, 초점 등을 자동으로 조절할 수 있도록 정보를 감지할 수 있다. 또한, 제2 센서부는, 수술등 장치의 운동부가 수술 상황에 알맞게 작동하기 위하여 필요한 정보를 감지할 수 있다. 제2 센서부는, 사용자의 동작을 감지해 수술 도중 위치의 변경이 필요한 경우 자동으로 위치를 변경할 수 있도 록 할 수 있다. 도 9는 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 센 서 장치가 수술용 안경의 일부분에 결합되어 이루어진 것을 나타내기 위해 도시한 도면이다. 도 9에 도시된 바와 같이, 센서 장치는 수술용 안경의 일부분에 결합함으로써, 사용자의 시야 방향을 보다 더 정확하게 감지할 수 있다. 수술용 안경의 일부분에 결합되는 센서 장치는, 동작감지 센서, 소리감지 센서 중 적어도 하나일 수 있으나, 상기에 나열된 것으로 한정하는 것은 아니다. 제어 장치는, 센서 장치에 감지된 입력신호에 따라, 수술등 장치를 제어하는 역할을 한다. 구 체적으로는, 제1 센서부, 및 제2 센서부에서 감지된 입력신호에 기초하여, 감지된 상황에 대한 정보 를 해석하여 주변 상황을 자동으로 판단한 후, 판단된 상황에 따라 수술등 장치의 방출부, 및 운동부 를 제어할 수 있다. 또한, 제어장치은 수술등 장치 또는 센서 장치과 결합되어 있을 수 있으나, 상기에 결합된 구성으로 한정하는 것은 아니다. 특히, 제어 장치는, 인공지능으로 구성될 수 있 다. 인공지능은 컴퓨터가 인간의 지능적인 행동을 따라 하며, 학습하고 생각하여 스스로 판단할 수 있도록 인 공적으로 구현한 것이다. 이는 단순히 컴퓨터에 명령어를 넣으면 대응되는 결과를 주는 것을 넘어서, 딥러닝을 통하여 사용자의 행동 패턴에 따라 다음 행동을 미리 예측하고 실행할 수 있다는 특징을 가진다. 제어 장치 를 인공지능으로 구성한다는 것은, 환자의 상태, 수술 종류, 수술 부위, 수술 과정 등의 정보를 학습시키 고, 센서 장치에서 감지된 입력신호에 따라 이미 학습된 정보를 바탕으로 앞으로의 수술 과정을 예측할 수 있도록 하여, 수술등 장치를 자동으로 제어할 수 있도록 구성한다는 의미이다. 예를 들면, 제어 장치를 인공지능으로 구성한다면, 동작감지 센서로 이루어진 센서 장치를 통해 사용 자의 특정 동작을 감지하게 되면, 수술이 시작한다는 것을 예측하여, 학습된 정보에 따라서 수술 부위로 수술등장치를 이동시키고, 방출부를 작동시키도록 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되 는 수술등 시스템의 제어가 가능할 것이다. 또 다른 예는, 소리감지 센서로 이루어진 센서 장치를 통해 사용자가 메스(SCALPEL), 석션(SUCTION) 등의 소리가 감지되면, 학습된 정보에 따라서 수술 진행 상황에 알맞게 자동으로 수술등 장치의 방출부와 운동부를 작동시키도록 하는, 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 제 어가 가능할 것이다. 도 10은 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 제어 방법의 흐름도를 도시한 도면이다. 도 10에 도시된 바와 같이, 본 발명의 일실시예에 따른 사용자로부터의 입 력신호에 따라 자동으로 제어되는 수술등 시스템의 제어방법은, 센서 장치가 사용자로부터 입력신호를 감지 하는 단계(S100), 단계 S100에서 센서 장치가 감지한 입력신호에 기초하여, 감지된 상황에 대한 정보를 해석하 여 주변상황을 자동으로 판단하는 단계(S200), 및 단계 S200에서 판단된 상황에 따라 수술등 장치가 제어 되는 단계(S300)를 포함하여 구성될 수 있다. 각각의 단계들과 관련된 상세한 내용들은, 앞서 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자 동으로 제어되는 수술등 시스템과 관련하여 충분히 설명되었으므로, 상세한 설명은 생략하기로 한다. 상술한 바와 같이, 본 발명에서 제안하고 있는 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스 템 및 제어방법에 따르면, 수술 부위를 조명하는 수술등 장치, 사용자로부터 입력신호를 감지하는 센서 장치, 및 센서 장치에 감지된 입력신호에 따라, 상기 수술등 장치를 자동으로 제어하는 제어 장치로 구성함으로써, 장 기 이식 수술, 정형 외과적 임플란트 수술, 심장 수술, 뇌수술 등의 수술 중 시술자의 시야를 밝히기 위하여 수 술용 조명 손잡이를 반드시 조작해야하는 문제를 해결하여 수술 중 감염을 방지할 수 있다. 또한, 센서 장치가, 눈 깜빡임, 한 곳을 응시하는 것 등의 특정 동작에 의해 감지를 시작하게 하고, 제어 장치가 인공지능 으로 구성되게 함으로써, 최신 IT 기술과 수술 로봇의 융합을 통한 제어로 시술의의 사용의 편의성을 더욱 향상 시킬 수 있다."}
{"patent_id": "10-2017-0178882", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 설명한 본 발명은 본 발명이 속한 기술분야에서 통상의 지식을 가진 자에 의하여 다양한 변형이나 응용이 가능하며, 본 발명에 따른 기술적 사상의 범위는 아래의 특허청구범위에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2017-0178882", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 수술용 수술등의 일반적인 사진. 도 2는 수술용 수술등의 손잡이와 수술용 수술등 손잡이를 잡고 있는 모습을 나타낸 사진. 도 3은 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 구성을 도시한 도면. 도 4는 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 블럭도 를 도시한 도면. 도 5는 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 수 술등 장치의 방출부와 운동부를 설명하기 위하여 도시한 도면. 도 6은 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 수 술대에 탈부착 가능하다는 것을 설명하기 위해 도시한 도면. 도 7은 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 사 용자의 특정 동작에 의해 감시를 시작하는 것을 설명하기 위해 도시한 도면. 도 8은 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 센 서 장치 중 동작감지 센서와 소리감지 센서를 설명하기 위해 도시한 도면. 도 9는 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템에서, 센 서 장치가 수술용 안경의 일부분에 결합되어 이루어진 것을 나타내기 위해 도시한 도면. 도 10은 본 발명의 일실시예에 따른 사용자로부터의 입력신호에 따라 자동으로 제어되는 수술등 시스템의 제어 방법의 흐름도를 도시한 도면."}
