{"patent_id": "10-2022-0146940", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0067164", "출원번호": "10-2022-0146940", "발명의 명칭": "가설 구조물 손상탐지 및 안전성 평가 시스템", "출원인": "인하대학교 산학협력단", "발명자": "이종한"}}
{"patent_id": "10-2022-0146940", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가설 구조물과,가설 구조물에 설치된 로드셀과,상기 로드셀로부터 측정된 데이터를 통하여 가설 구조물의 손상 및 안전성을 판단하는 손상 탐지부로 이루어지는 것을 특징으로 하는 가설 구조물 손상탐지 및 안전성 평가 시스템."}
{"patent_id": "10-2022-0146940", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 가설 구조물은 동일한 구조가 반복되는 구조계로 이루어지고, 상기 구조계를 구성하는 각 파이프가 연결되는 연결부와 지면에 지지되는 지지부에 설치된 로드셀을 통하여 수집된 시계열 데이터로 상기 손상 탐지부를 구성하는 인공지능을 학습하는 것을 특징으로 하는 가설 구조물 손상탐지 및 안전성 평가 시스템."}
{"patent_id": "10-2022-0146940", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 시계열 데이터는 시뮬레이션 장치에서 상기 구조계를 형성하고,상기 구조계의 연결부 및 지지부에 로드셀을 설치하여 시계열 데이터를 수집하며,상기 손상 탐지부는 시계열 데이터 중에서 구조계에 손상이 없는 상태인 무손상 데이터를 사용하여 학습되는 것을 특징으로 하는 가설 구조물 손상탐지 및 안전성 평가 시스템."}
{"patent_id": "10-2022-0146940", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 손상 탐지부의 손상 탐지 정확도를 판단하는 정확도 판단부가 더 구비되되,상기 정확도 판단부는 상기 시뮬레이션 장치에서 임의로 생성한 손상 정보가 포함된 상기 구조계의 연결부 및지지부에 로드셀을 설치하여 수집한 시계열 데이터인 손상 데이터를 상기 손상 탐지부에 전송하여 손상을 탐지하는 정확도를 도출하는 것을 특징으로 하는 가설 구조물 손상 탐지 및 안전성 평가 시스템."}
{"patent_id": "10-2022-0146940", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 정확도 판단부는 상기 손상 탐지부에서 각 로드셀 별로 수집된 손상 데이터를 통하여 손상을 탐지하도록하고, 각 로드셀 별로 손상 탐지 정확도를 도출하여 손상 탐지 정확도가 설정치 값보다 높은 값을 가지는 로드셀의 위치를 도출하는 것을 특징으로 하는 가설 구조물 손상 탐지 및 안전성 평가 시스템.공개특허 10-2024-0067164-3-청구항 6 제5항에 있어서,상기 정확도 판단부는 상기 시뮬레이션 장치를 통하여 손상 시나리오를 적용하되,상기 손상 시나리오는 상기 구조계를 구성하는 연결부의 임의 지점에 손상도를 10%, 30% 또는 50%로 하는 1번케이스와,상기 구조계를 구성하는 지지부의 임의 지점에 손상도를 10%, 30% 또는 50%로 하는 2번 케이스로 형성하는 것을특징으로 하는 가설 구조물 손상 탐지 및 안전성 평가 시스템."}
{"patent_id": "10-2022-0146940", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 로드셀은 상기 가설 구조물의 하부에 형성되는 지지부에 두개 이상이 설치되되, 상기 지지부의 중심부와 바깥쪽에 설치되는 것을 특징으로 하는 가설 구조물 손상 탐지 및 안전성 평가 시스템."}
{"patent_id": "10-2022-0146940", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 가설 구조물 손상탐지 및 안전성 평가 시스템에 관한 것으로서, 더욱 상세하게는 가설 구조물의 특정 부분에 로드셀을 설치하여 측정된 정보를 학습된 인공지능이 적용된 탐지 모듈에서 분석하여 가설 구조물의 손상 및 안전성을 판단하되, 가설 구조물의 어느 부분에 로드셀을 설치하여야 가장 높은 정확도를 유지할 수 있는 지 (뒷면에 계속)"}
{"patent_id": "10-2022-0146940", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가설 구조물 손상탐지 및 안전성 평가 시스템에 관한 것으로서, 더욱 상세하게는 가설 구조물의 특정 부분에 로드셀을 설치하여 측정된 정보를 학습된 인공지능이 적용된 탐지 모듈에서 분석하여 가설 구조물의 손 상 및 안전성을 판단하되, 가설 구조물의 어느 부분에 로드셀을 설치하여야 가장 높은 정확도를 유지할 수 있는 지를 확인하여 최소의 로드셀을 설치하여 높은 정확도를 유지할 수 있게 하는 가설 구조물 손상탐지 및 안전성 평가 시스템에 관한 것이다."}
{"patent_id": "10-2022-0146940", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "가설지지대란, 다층 구조물의 신축 또는 철거현장에서 상부 슬래브에 가해지는 하중 및 진동으로 인한 구조물의 균열, 붕괴 등을 방지하기 위하여 하층의 바닥면과 상층 슬래브의 저면 간에 일정 간격으로 다수가 가설하여 상 층 슬래브에 가해지는 하중을 분산 지탱함으로써 구조물의 균열 발생 및 붕괴를 방지함과 동시에 구조물의 신축 또는 철거 과정에서 상층 슬래브에서 각종 작업의 수행이 가능하도록 하는 대표적인 건축용 가설재로서 ‘동바 리’라고도 하는데, 본 발명은 이러한 가설지지대뿐만 아니라 비계 등의 상부 임시 구조물까지 포함한 가설 구 조물에 관한 것이다. 이 중 가설지지대의 설치를 위해서는 먼저 구조물의 구조분석을 통해 적합한 자재와 수량을 산출한 후, 가설지 지대의 설치가 이루어지게 된다. 그런데, 통상의 가설지지대는 그 자체의 강성만으로 구조물에 의해 가해지는 하중을 단순히 분산 지탱하는 것이 기 때문에 구조물에 의해 가해지는 정하중에 대해서는 안정적인 지지력을 발휘하는 반면, 지진이나 기타 복합적 인 요인으로 인해 발생하는 동하중이나 그로 인한 충격, 진동 및 특히 과도한 비대칭적인 정하중을 지탱하지 못 하여 가설지지대가 이탈하거나 손상, 파손되면서 구조물에 대한 지지력이 급격히 저하되어 구조물에 균열이 발 생하거나, 붕괴되는 등의 문제점이 있다. 이러한 현상은 비단 지진이나 기타 복합적인 요인으로 인해 발생하는 동하중이나 그로 인한 충격 및 진동에만 의한 것은 아니며, 가설지지대의 길이를 과도하게 길게 설치하는 경우에, 단면의 크기에 비해 길이가 긴 부재가 큰 압축력을 받을 때, 하중이 일정 크기에 이르면 부재가 갑자기 휘어지는 좌굴(buckling) 현상이 발생하면서 구조물에 대한 지지력이 급격히 저하되면서, 구조물이 붕괴되는 등의 문제점이 있다. 또한, 구조물의 구조 검토 후 적합한 자재와 수량을 산출하여 가설지지대의 설치가 이루어졌음에도 구조 검토 단계에서 반영될 수 없는 여러 불가피한 요인으로 인해 가설지지대의 설치 상태에 이상이 발생한 경우에도 관리 자나 작업자가 이를 쉽게 인지하지 못하여 가설지지대의 이상 발생이 지속되면서 결국 특정 위치의 가설지지대에서 구조물에 대한 지지력이 급격히 저하되는 경우에도 구조물이 붕괴되는 문제점이 있다. 그래서, 이러한 문제점을 해결하기 위하여 도 1 및 도 2에 도시된 바와 같은 한국등록특허 제10-2391482호에 기 재된 기술이 제안되었는데, 그 기술적 특징은 건축용으로 사용되는 통상의 구조물 구조분석 시뮬레이션 프로그 램을 이용한 구조물의 구조분석을 통해 상부 슬래브에 가해지는 하중값을 산출하고, 그 하중값에 따라 필요한 가설지지대의 설치영역(A), 설치위치, 설치규격, 설치수를 산출하는 구조분석단계(S10); 상기 산출된 설치 영역(A) 내의 상부 슬래브와 바닥면 간에 설치되는 가설지지대의 상단부와 상부 슬래브 간에 개재되는 지지 대모듈이 가설지지대에 가해지는 하중에 따라 신호강도가 조절되는 무선신호를 실시간으로 송신하는 무 선신호송신단계(S20); 상기 무선신호의 강도를 삼각측량 방식으로 측량하도록 산출된 설치영역(A) 내에 다수가 설치된 스캐닝모듈이 실시간으로 수신되는 무선신호의 신호강도정보를 생성하여 실시간으로 송신하는 신호 강도정보송신단계(S30); 상기 다수의 스캐닝모듈에서 송신되는 신호강도정보를 관리서버로 수신하고 분 석하여 가설지지대의 위치좌표를 생성하여 저장하는 위치좌표생성단계(S40); 상기 다수의 스캐닝모듈에 서 실시간으로 송신되는 신호강도정보를 관리서버에 사전 저장된 기준값과 비교하여 가설지지대의 설치 상태의 이상 유무를 분석하는 설치상태분석단계(S50); 상기 가설지지대의 설치상태 분석에 따른 이벤트메시 지를 관리서버에 사전 등록된 아이디 정보를 가지는 사용자단말기(M)로 송신하는 이벤트메시지송신단계 (S60);를 포함하는 것을 특징으로 한다. 그런데, 한국등록특허 제10-2391482호에 기재된 기술은 구조물에 설치된 다수의 가설지지대의 설치 상태 및 이 상 발생 여부를 관리자가 언제 어디서든 실시간으로 관리할 수 있게 하는 장점은 있으나, 가설지지대의 상태 및 이상 발생 여부에 대한 판단의 정확도가 높지 않아 안정적인 대처가 어려운 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2391482호(2022.04.22.등록)"}
{"patent_id": "10-2022-0146940", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 문제점을 해결하기 위하여 도출된 것으로서, 본 발명의 목적은 가설 구조물의 특정 부분에 로 드셀을 설치하여 측정된 정보를 학습된 인공지능이 적용된 손상 탐지부에서 분석하여 이상 여부를 판단하여 안 정성을 확인할 수 있는 가설 구조물 손상탐지 및 안전성 평가 시스템을 제공하는 것이다. 그리고, 본 발명의 다른 목적은 가설 구조물에 손상이 없는 상태인 무손상 데이터로 학습한 시스템을 통하여 가 설 구조물의 지지부에만 로드셀을 설치한 후, 연결부 또는 지지부 등에 손상이 발생한 경우에 각 로드셀에서 측 정한 정보를 통하여 이상 여부를 판단할 때, 최소의 로드셀을 설치하여 높은 정확도를 유지할 수 있는 가설 구 조물 손상탐지 및 안전성 평가 시스템을 제공하는 것이다."}
{"patent_id": "10-2022-0146940", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 문제점을 해결하기 위한 본 발명은; 가설 구조물과, 가설 구조물에 설치된 로드셀과, 상기 로드셀로부터 측정된 데이터를 통하여 가설 구조물의 손 상 및 안전성을 판단하는 손상 탐지부로 이루어지는 것을 특징으로 한다. 여기서, 상기 가설 구조물은 동일한 구조가 반복되는 구조계로 이루어지고, 상기 구조계를 구성하는 각 파이프 가 연결되는 연결부와 지면에 지지되는 지지부에 설치된 로드셀을 통하여 수집된 시계열 데이터로 상기 손상 탐 지부를 구성하는 인공지능을 학습하는 것을 특징으로 한다. 이때, 상기 시계열 데이터는 시뮬레이션 장치에서 상기 구조계를 형성하고, 상기 구조계의 연결부 및 지지부에 로드셀을 설치하여 시계열 데이터를 수집하며, 상기 손상 탐지부는 시계열 데이터 중에서 구조계에 손상이 없는 상태인 무손상 데이터를 사용하여 학습되는 것을 특징으로 한다. 그리고, 상기 손상 탐지부의 손상 탐지 정확도를 판단하는 정확도 판단부가 더 구비되되, 상기 정확도 판단부는 상기 시뮬레이션 장치에서 임의로 생성한 손상 정보가 포함된 상기 구조계의 연결부 및 지지부에 로드셀을 설치 하여 수집한 시계열 데이터인 손상 데이터를 상기 손상 탐지부에 전송하여 손상을 탐지하는 정확도를 도출하는 것을 특징으로 한다. 여기서, 상기 정확도 판단부는 상기 손상 탐지부에서 각 로드셀 별로 수집된 손상 데이터를 통하여 손상을 탐지 하도록 하고, 각 로드셀 별로 손상 탐지 정확도를 도출하여 손상 탐지 정확도가 설정치 값보다 높은 값을 가지 는 로드셀의 위치를 도출하는 것을 특징으로 한다. 이때, 상기 정확도 판단부는 상기 시뮬레이션 장치를 통하여 손상 시나리오를 적용하되, 상기 손상 시나리오는 상기 구조계를 구성하는 연결부의 임의 지점에 손상도를 10%, 30% 또는 50%로 하는 1번 케이스와, 상기 구조계 를 구성하는 지지부의 임의 지점에 손상도를 10%, 30% 또는 50%로 하는 2번 케이스로 형성하는 것을 특징으로 한다. 한편, 상기 로드셀은 상기 가설 구조물의 하부에 형성되는 지지부에 두개 이상이 설치되되, 상기 지지부의 중심 부와 바깥쪽에 설치되는 것을 특징으로 한다."}
{"patent_id": "10-2022-0146940", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 구성의 본 발명에 따르면, 가설 구조물의 특정 부분에 로드셀을 설치하여 측정된 정보를 학습된 인공지 능이 적용된 손상 탐지부에서 분석하여 이상 여부를 판단하여 안정성을 확인할 수 있는 효과가 있다. 그리고, 본 발명은 가설 구조물에 손상이 없는 상태인 무손상 데이터로 학습한 시스템을 통하여 가설 구조물의 지지부에만 로드셀을 설치한 후, 연결부 또는 지지부 등에 손상이 발생한 경우에 각 로드셀에서 측정한 정보를 통하여 이상 여부를 판단할 때, 최소의 로드셀을 설치하여 높은 정확도를 유지할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0146940", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 발명의 바람직한 실시 예를 보다 상세하게 설명한다. 도면상의 동일한 구성요 소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 그리고, 본 발 명은 다수의 상이한 형태로 구현될 수 있고, 기술된 실시 예에 한정되지 않음을 이해하여야 한다. 본 발명은 가설 구조물 손상탐지 및 안전성 평가 시스템에 관한 것으로 도 3 내지 도 8에 도시된 바와 같이 그 구성은 가설 구조물과 가설 구조물에 설치된 로드셀과 상기 로드셀로부터 측정된 데이터를 통하여 가 설 구조물의 손상 및 안전성을 판단하는 손상 탐지부로 이루어질 수 있다. 여기서, 상기 가설 구조물이란 영구 구조물의 축조를 위하여 임시로 설치하는 시설 또는 구조물로서, 비계, 동 바리, 작업 발판 등이 있다.그래서, 상기 가설 구조물에 로드셀을 설치하고, 상기 로드셀로부터 측정한 데이터를 기반으로 상기 손상 탐지부에서 상기 가설 구조물의 손상 여부를 판단하고 안전성을 판단하여 안전사고를 예방할 수 있게 된다. 그리고, 본 발명에서는 도 4 및 도 5에 도시된 바와 같이, 상기 가설 구조물은 동일한 형태가 반복되는 구조계 로서, 상기 구조계는 각 파이프가 연결되는 연결부와 지면에 지지되는 지지부로 이루어질 수 있다. 여기서, 상기 로드셀은 상기 구조계를 구성하는 상기 지지부와 연결부에 각각 설치될 수 있는데, 상기 로드셀을 통하여 수집된 시계열 데이터를 사용하여 상기 손상 탐지부를 구성하는 인공 지능을 학습시킬 수 있다. 한편, 상기 시계열 데이터는 별도로 구비되는 시뮬레이션 장치에서 상기 구조계를 형성할 수 있고, 상기 시뮬레이션 장치 상에서 구현된 상기 구조계의 연결부 및 지지부에 로드셀을 설 치하여 시계열 데이터를 수집할 수 있다. 여기서, 상기 구조계는 전술한 바와 같이 상기 연결부 및 지지부만으로 이루어질 수도 있고, 도 4에 도시된 바와 같이 가설 구조물의 강도를 보강하기 위한 가새재를 50% 설치한 상태 또는 상기 가새제 를 100% 설치한 상태에 대한 데이터도 각각 수집할 수 있다. 이때, 상기 손상 탐지부를 구성하는 인공지능은 상기 시뮬레이션 장치를 통하여 수집한 시계열 데이 터 중에서 구조계에 손상이 없는 상태인 무손상 데이터를 사용하여 학습될 수 있다. 그래서, 상기 손상 탐지부는 손상이 없는 상태의 구조계의 상태를 학습하게 되고, 이렇게 학습한 상 태와 다른 상태가 감지되면 손상이 발생한 상태 즉, 안전성에 문제가 있는 상황으로 판단할 수 있다. 추가로, 상기 손상 탐지부에 적용된 인공지능은 딥러닝 기반으로 이상을 감지하는 곳에 많이 사용되는 오 토엔코더(Auto-Encoder)의 일종인 SAE(Stacked Auto-Encoder)를 사용할 수 있는데, 전술한 무손상 데이터를 사 용하여 비지도학습(Unsupervised learning)을 통하여 손상 데이터의 탐지를 목표로 학습된 인공지능일 수 있다. 그리고, 본 발명에서는 정확도 판단부가 더 구비될 수 있는데, 상기 정확도 판단부는 상기 손상 탐지 부에서 판단한 손상 및 안전성에 대한 정확도를 판단할 수 있다. 여기서, 상기 정확도 판단부는 상기 시뮬레이션 장치에서 임의로 생성한 손상 정보가 포함된 상기 구 조계의 연결부 및 지지부에 로드셀을 설치하여 수집한 시계열 데이터인 손상 데이터를 상 기 손상 탐지부에 전송하여 손상을 탐지하는 정확도를 도출하게 된다. 즉, 상기 상기 정확도 판단부는 상기 손상 탐지부에서 각 로드셀 별로 수집된 손상 데이터를 통 하여 손상을 탐지하도록 하고, 각 로드셀 별로 손상 탐지 정확도를 도출할 수 있다. 그래서, 상기 정확도 판단부는 상기 구조계의 각 부분에 설치된 로드셀 별로 손상 탐지 정확도 를 확인할 수 있기 때문에 정확도가 낮은 위치의 로드셀은 제외하고 최소한의 정확도로 설정한 설정치 값 보다 높은 값을 가지는 로드셀의 위치를 도출하여 해당 위치를 내부에 구비되는 저장부(미도시)에 저장하 고 디스플레이부 등을 통하여 관리자에게 통지할 수 있다. 한편, 상기 정확도 판단부는 상기 시뮬레이션 장치를 통하여 손상이 있는 구조계의 시계열 데이 터를 수집하게 되는데, 상기 구조계의 손상을 획일적으로 형성하여 시계열 데이터를 수집하는 것이 아니라 상기 시뮬레이션 장치를 통하여 손상 시나리오를 적용하여 시계열 데이터를 수집할 수 있다. 여기서, 상기 손상 시나리오는 상기 구조계를 구성하는 연결부의 임의 지점에 손상도를 10%, 30% 또 는 50%로 하는 1번 케이스와 상기 구조계를 구성하는 지지부의 임의 지점에 손상도를 10%, 30% 또는 50%로 하는 2번 케이스로 형성할 수 있다. 이때, 1번 케이스 시나리오와 2번 케이스 시나리오는 상기 구조계를 구성하는 다수의 연결부 및 지지 부 중에서 손상을 형성할 부분은 랜덤으로 설정하고 각 부분에 적용되는 손상의 정도 역시 10%, 30% 또는 50% 중에서 랜덤으로 적용되도록 하여 다양한 사례가 적용될 수 있도록 한다. 그래서, 상기 정확도 판단부는 전술한 시나리오를 통하여 상기 구조계의 각 위치에 설치된 로드셀 별로 도출된 정확도를 살펴보면, 우선, 도 7에 도시된 바와 같이, 가새재를 설치하지 않은 경우에는5군데의 지지부에 설치된 로드셀에서 측정된 정확도의 평균은 94%에 달하지만, 연결부에 설치된 로드셀에서 측정된 정확도는 평균 43%이므로 정확도가 상당히 낮은 것을 알 수 있다. 또한, 도 8 및 도 9에 도시된 바와 같이 가새재를 50% 설치한 경우와 100% 설치한 경우에서의 정확도를 각 각 확인하여 보아도 지지부에서 측정한 정확도가 연결부에서 측정한 정확도보다 월등하게 높은 것을 확인할 수 있다. 이는 정확도가 높은 곳에 로드셀을 설치할 경우에는 정확도를 높일 수 있지만, 정확도가 낮은 곳과 정확도 가 높은 곳에 동시에 설치할 경우에는 서로 상반된 결과를 도출할 수 있어 오히려 정확도를 더욱 낮추게 되는 문제점이 있다. 그래서, 본 발명에서는 전술한 바와 같이 설정치 이상의 정확도를 보이는 위치를 도출하여 해당 위치에 최소한 의 로드셀을 설치하도록 함으로써, 손상 및 안정성 판단의 정확도를 높일 수 있을 뿐만 아니라 설치 비용 도 절감할 수 있게 된다. 즉, 전술한 실험의 결과로는 구조계의 지지부에 최소 두개 이상을 설치하는 것이 좋으며, 더욱이 구 조계를 구성하는 지지부의 내측과 외측(중심부와 바깥쪽)에 각각 설치하는 것이 바람직할 수 있다. 그리고, 본 발명에서는 전술한 바와 같이 가설 구조물에서 반복되는 구조인 구조계를 설정하여 로드셀 이 설치될 최적의 위치를 판단하였는데, 상기 구조계는 반복되는 단위인 단위 구조계를 사용할 수도 있고, 단위 구조계를 상방 및 측방으로 확장한 상태로 사용할 수도 있다. 추가로, 본 발명은 전술한 바와 같이 가설 구조물에 적용되지만, 가설 구조물 뿐만 아니라 다양한 구조물에 적 용하여 손상 및 안전성을 판단하기 위하여 로드셀을 설치할 최적의 위치를 도출할 수 있다. 이상에서 본 발명의 바람직한 실시 예를 설명하였으나, 본 발명의 권리범위는 이에 한정되지 않으며, 본 발명의 실시 예와 실질적으로 균등한 범위에 있는 것까지 본 발명의 권리 범위가 미치는 것으로 본 발명의 정신을 벗어"}
{"patent_id": "10-2022-0146940", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "나지 않는 범위 내에서 당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가 능한 것이다. 산업상 이용가능성 본 발명은 가설 구조물 손상탐지 및 안전성 평가 시스템에 관한 것으로서, 더욱 상세하게는 가설 구조물의 특정 부분에 로드셀을 설치하여 측정된 정보를 학습된 인공지능이 적용된 탐지 모듈에서 분석하여 가설 구조물의 손 상 및 안전성을 판단하되, 가설 구조물의 어느 부분에 로드셀을 설치하여야 가장 높은 정확도를 유지할 수 있는 지를 확인하여 최소의 로드셀을 설치하여 높은 정확도를 유지할 수 있게 하는 가설 구조물 손상탐지 및 안전성 평가 시스템에 관한 것이다."}
{"patent_id": "10-2022-0146940", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 가설지지대 원격 관리 방법의 블록도이다. 도 2는 종래의 가설지지대 원격 관리 방법의 구성도이다. 도 3은 본 발명에 따른 가설 구조물 손상탐지 및 안전성 평가 시스템의 블럭도이다. 도 4는 본 발명에 따른 가설 구조물 손상탐지 및 안전성 평가 시스템의 구조계의 예시도이다. 도 5는 본 발명에 따른 가설 구조물 손상탐지 및 안전성 평가 시스템의 구조계의 사시도이다. 도 6은 본 발명에 따른 가설 구조물 손상탐지 및 안전성 평가 시스템의 구조계에 가해지는 하중을 보여주는 예 시도이다. 도 7은 본 발명에 따른 가설 구조물 손상탐지 및 안전성 평가 시스템에서 가새재가 설치되지 않은 상태에서의 각 로드셀 별로 판단 정확도를 보여주는 상태도이다. 도 8은 본 발명에 따른 가설 구조물 손상탐지 및 안전성 평가 시스템에서 가새재가 50% 설치된 상태에서의 각 로드셀 별로 판단 정확도를 보여주는 상태도이다. 도 9는 본 발명에 따른 가설 구조물 손상탐지 및 안전성 평가 시스템에서 가새재가 100% 설치된 상태에서의 각 로드셀 별로 판단 정확도를 보여주는 상태도이다."}
