{"patent_id": "10-2022-0158268", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0076876", "출원번호": "10-2022-0158268", "발명의 명칭": "스마트팜에 대한 환경 정보 및 사양 정보 처리 방법 및 디바이스", "출원인": "박진영", "발명자": "박진영"}}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트팜에 대한 환경 정보 및 사양 정보 처리 방법에 있어서,축사 내부의 온도, 습도, 암모니아 농도 및 이산화탄소 농도 중 적어도 하나를 포함하는 환경 정보를 획득하는단계;가축의 사양 관리와 관련하여 사료량 정보 및 음수량 정보 중 적어도 하나를 포함하는 사양 정보를 획득하는 단계;사용자 인터페이스를 통해 획득된 환경 설정 값에 기초하여 복수의 터널 휀 중 하나 이상의 터널 휀에 대한 동작 요청을 송신하는 단계;상기 사용자 인터페이스를 통해 획득된 사양 설정 값에 기초하여 급이 모터를 포함하는 사양 장치에 대한 동작요청을 송신하는 단계; 및상기 환경 정보 또는 상기 사양 정보에 기초하여 복수의 알람 중 적어도 하나의 알람을 상기 사용자 인터페이스를 통해 제공하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 하나 이상의 터널 휀에 대한 동작 요청을 송신하는 단계는상기 복수의 터널 휀을 제 1 그룹 또는 제 2 그룹으로 중첩을 허용하여 그루핑하는 단계;상기 제 1 그룹에 대응하는 제 1 동작 온도, 상기 제 2 그룹에 대응하는 제 2 동작 온도와 상기 제 1 동작 온도와의 차이인 동작 간격 및 상기 제 1 그룹 및 상기 제 2 그룹의 동작 온도에 대한 오프셋을 나타내는 간격 조정을 결정하는 단계;상기 제 1 동작 온도 및 상기 간격 조정에 대응하는 제 1 온도 구간에서 상기 제 1 그룹에 대한 동작 요청을 송신하는 단계; 및상기 제 2 동작 온도 및 상기 간격 조정에 대응하는 제 2 온도 구간에서 상기 제 2 그룹에 대한 동작 요청을 송신하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 간격 조정은 상기 동작 간격의 절반보다 작고상기 제 1 동작 온도, 상기 동작 간격 및 상기 간격 조정은 상기 사용자 인터페이스에 기초하여 획득되는,방법."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 제 1 동작 온도가 상기 제 2 동작 온도보다 낮고,상기 제 1 그룹에 포함되는 제 1-1 터널 휀 및 제 1-2 터널 휀 간의 거리는 상기 복수의 터널 휀 각각의 거리중 가장 먼 거리이고,상기 제 2 그룹에 포함되는 제 2-1 터널 휀 및 제 2-2 터널 휀은 각각 상기 제 1-1 터널 휀 및 상기 제 1-2 터널 휀에서 각각 기설정 거리 이상 떨어져있고,공개특허 10-2024-0076876-3-상기 제 1-1 터널 휀의 단위 시간당 동작 시간이 기설정 시간 이상인 경우, 상기 제 2-1 터널 휀이 상기 제 1그룹에 포함되고, 상기 제 1-1 터널 휀은 상기 제 1 그룹에서 배제되는, 방법."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 복수의 알람 중 상기 적어도 하나의 알람을 상기 사용자 인터페이스를 통해 제공하는 단계는상기 음수량 정보에 기초하여 기계 결함 알람 및 질병 예상 알람 중 적어도 하나를 제공하는 단계를 포함하는,방법."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 기계 결함 알람 및 상기 질병 예상 알람 중 적어도 하나를 제공하는 단계는단위 시간당 음수량의 변화량이 기설정 변화량 이상인 경우 또는 시간의 흐름에 따른 음수량이 감소하는 경우,상기 기계 결함 알람을 제공하는 단계;상기 단위 시간당 음수량의 변화량이 상기 기설정 변화량 미만이면서 상기 시간의 흐름에 따른 음수량이 예측음수량 범위를 벗어나는 경우, 상기 질병 예상 알람을 제공하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스에 있어서,축사 내부의 온도, 습도, 암모니아 농도 및 이산화탄소 농도 중 적어도 하나를 포함하는 환경 정보를 획득하고,가축의 사양 관리와 관련하여 사료량 정보 및 음수량 정보 중 적어도 하나를 포함하는 사양 정보를 획득하는 센서부;사용자 인터페이스를 통해 획득된 환경 설정 값에 기초하여 복수의 터널 휀 중 하나 이상의 터널 휀에 대한 동작 요청을 송신하고,상기 사용자 인터페이스를 통해 획득된 사양 설정 값에 기초하여 급이 모터를 포함하는 사양 장치에 대한 동작요청을 송신하는 프로세서; 및상기 환경 정보 또는 상기 사양 정보에 기초하여 복수의 알람 중 적어도 하나의 알람을 제공하는 상기 사용자인터페이스;를 포함하는, 디바이스."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 프로세서는상기 복수의 터널 휀을 제 1 그룹 또는 제 2 그룹으로 중첩을 허용하여 그루핑하고, 상기 제 1 그룹에 대응하는 제 1 동작 온도, 상기 제 2 그룹에 대응하는 제 2 동작 온도와 상기 제 1 동작 온도와의 차이인 동작 간격 및 상기 제 1 그룹 및 상기 제 2 그룹의 동작 온도에 대한 오프셋을 나타내는 간격 조정을 결정하고,상기 제 1 동작 온도 및 상기 간격 조정에 대응하는 제 1 온도 구간에서 상기 제 1 그룹에 대한 동작 요청을 송신하고,상기 제 2 동작 온도 및 상기 간격 조정에 대응하는 제 2 온도 구간에서 상기 제 2 그룹에 대한 동작 요청을 송신하는, 디바이스."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,공개특허 10-2024-0076876-4-상기 간격 조정은 상기 동작 간격의 절반보다 작고상기 제 1 동작 온도, 상기 동작 간격 및 상기 간격 조정은 상기 사용자 인터페이스에 기초하여 획득되는, 디바이스."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 제 1 동작 온도가 상기 제 2 동작 온도보다 낮고,상기 제 1 그룹에 포함되는 제 1-1 터널 휀 및 제 1-2 터널 휀 간의 거리는 상기 복수의 터널 휀 각각의 거리중 가장 먼 거리이고,상기 제 2 그룹에 포함되는 제 2-1 터널 휀 및 제 2-2 터널 휀은 각각 상기 제 1-1 터널 휀 및 상기 제 1-2 터널 휀에서 각각 기설정 거리 이상 떨어져있고,상기 제 1-1 터널 휀의 단위 시간당 동작 시간이 기설정 시간 이상인 경우, 상기 제 2-1 터널 휀이 상기 제 1그룹에 포함되고, 상기 제 1-1 터널 휀은 상기 제 1 그룹에서 배제되는, 디바이스."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7 항에 있어서,상기 사용자 인터페이스는상기 음수량 정보에 기초하여 기계 결함 알람 및 질병 예상 알람 중 적어도 하나를 제공하는, 디바이스."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 사용자 인터페이스는단위 시간당 음수량의 변화량이 기설정 변화량 이상인 경우 또는 시간의 흐름에 따른 음수량이 감소하는 경우,상기 기계 결함 알람을 제공하고,상기 단위 시간당 음수량의 변화량이 상기 기설정 변화량 미만이면서 상기 시간의 흐름에 따른 음수량이 예측음수량 범위를 벗어나는 경우, 상기 질병 예상 알람을 제공하는, 디바이스."}
{"patent_id": "10-2022-0158268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항 내지 제 6 항 중 어느 한 항의 방법을 구현하기 위한 프로그램이 기록된 컴퓨터로 판독 가능한 비일시적 기록 매체."}
{"patent_id": "10-2022-0158268", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "축사 내부의 온도, 습도, 암모니아 농도 및 이산화탄소 농도 중 적어도 하나를 포함하는 환경 정보를 획득하는 단계; 가축의 사양 관리와 관련하여 사료량 정보 및 음수량 정보 중 적어도 하나를 포함하는 사양 정보를 획득하 는 단계; 사용자 인터페이스를 통해 획득된 환경 설정 값에 기초하여 복수의 터널 휀 중 하나 이상의 터널 휀에 대한 동작 요청을 송신하는 단계; 상기 사용자 인터페이스를 통해 획득된 사양 설정 값에 기초하여 급이 모터를 포함하는 사양 장치에 대한 동작 요청을 송신하는 단계; 및 상기 환경 정보 또는 상기 사양 정보에 기초하여 복 수의 알람 중 적어도 하나의 알람을 상기 사용자 인터페이스를 통해 제공하는 단계;를 포함하는, 방법 및 디바이 스가 개시된다."}
{"patent_id": "10-2022-0158268", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 스마트팜에 대한 환경 정보 및 사양 처리 방법 및 디바이스에 관한 것으로, 더욱 상세하게는, 축사 내부에 대한 환경 정보 및 가축의 사양 관리에 대한 사양 정보를 확인하여 복수의 터널 휀 또는 급이 모터가 동 작하도록함에 따라 축사 내부의 환경 및 가축에 대한 사양 관리가 처리될 수 있도록 하는 방법 및 디바이스에 관한 것이다."}
{"patent_id": "10-2022-0158268", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트팜(smart farm)은 농산물, 임산물, 축산물, 수산물의 생산, 가공, 유통 단계에서 정보통신기술을 접목한 지능화된 농업 시스템을 의미한다. 스마트팜은 ICT 기술을 활용하여 환경정보, 생육정보 등을 분석 및 예측하여 관리함으로써 생산비를 절감할 수 있다. 원격에서도 스마트팜을 관리할 수 있어 생산자에게 효율적인 시스템으 로 각광받고 있다. 우리 나라와 같이, 사계절이 뚜렷한 나라의 경우 생산성 향상을 위해서는 계절 별로 적절한사양 관리가 요구되며, 일교차가 심한 환절기에는 쾌적한 온도, 습도와 환기를 유지하여 최적의 사육 환경을 제 공함으로써 가축의 스트레스를 줄일 필요가 있다. 따라서, 가축을 키울만한 환경이 제공되어야 할 필요가 있다. 그러나 가축에게 적합한 환경을 제공해 주기 위해서는 직접 축사에 방문하여 환경을 조정하거나 가축의 사양 관 리를 해야한다는 불편함이 있었다. 인공지능 스마트팜 관리 시스템으로써, 스마트팜을 효율적으로 관리하기 위 해 환경제어 알고리즘을 이용하여 복수의 제어 대상 기기를 제어하는 등 환경 제어 알고리즘을 인공지능 알고리 즘을 이용하여 학습하고, 실시간으로 제어 대상 기기를 제어하도록 하는 시스템이 필요한 실정이다. 또한, 다양 한 환경 정보 관리 및 가축의 사양 관리 등의 사육 시스템을 이용하여 멀리에서도 축사를 관리할 수 있도록 하 여 가축이 적합한 환경에서 사육될 수 있도록 하는 사육 방법이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제 10-1294868 호 (2013.08.02) 원격 가축 모니터링 시스템 및 방법"}
{"patent_id": "10-2022-0158268", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에서 해결하고자 하는 과제는 스마트팜에 대한 환경 정보 및 사양 정보를 처리하는 서비스를 제공하는 시스템에 있어서, 비대면 가능한 가축 사육 시스템으로 사용자가 멀리서도 축사 내부의 환경을 관리하고 사육하 는 가축의 급식 및 급수 조절이 가능하도록 함으로써, 사용자가 간접적으로 가축을 키울 수 있고 가축에게 적합 한 환경에서 가축 사육이 가능하도록 하기 위한 것이다. 본 개시에서 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제 들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0158268", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로써, 본 개시의 제 1 측면에 따른 디바이스가 스마트팜에 대한 환경 정보 및 사양 정보 처리 방법에 있어서 축사 내부의 온도, 습도, 암모니아 농도 및 이산화탄소 농도 중 적어도 하나를 포함하는 환경 정보를 획득하는 단계; 가축의 사양 관리와 관련하여 사료량 정보 및 음수량 정보 중 적어도 하나를 포함하는 사양 정보를 획득하는 단계; 사용자 인터페이스를 통해 획득된 환경 설정 값에 기초하여 복수의 터널 휀 중 하나 이상의 터널 휀에 대한 동작 요청을 송신하는 단계; 상기 사용자 인터페이스 를 통해 획득된 사양 설정 값에 기초하여 급이 모터를 포함하는 사양 장치에 대한 동작 요청을 송신하는 단계; 및 상기 환경 정보 또는 상기 사양 정보에 기초하여 복수의 알람 중 적어도 하나의 알람을 상기 사용자 인터페 이스를 통해 제공하는 단계;를 포함할 수 있다. 또한, 상기 하나 이상의 터널 휀에 대한 동작 요청을 송신하는 단계는 상기 복수의 터널 휀을 제 1 그룹 또는 제 2 그룹으로 중첩을 허용하여 그루핑하는 단계; 상기 제 1 그룹에 대응하는 제 1 동작 온도, 상기 제 2 그룹 에 대응하는 제 2 동작 온도와 상기 제 1 동작 온도와의 차이인 동작 간격 및 상기 제 1 그룹 및 상기 제 2 그 룹의 동작 온도에 대한 오프셋을 나타내는 간격 조정을 결정하는 단계; 상기 제 1 동작 온도 및 상기 간격 조정 에 대응하는 제 1 온도 구간에서 상기 제 1 그룹에 대한 동작 요청을 송신하는 단계; 및 상기 제 2 동작 온도 및 상기 간격 조정에 대응하는 제 2 온도 구간에서 상기 제 2 그룹에 대한 동작 요청을 송신하는 단계;를 포함 할 수 있다. 또한, 상기 간격 조정은 상기 동작 간격의 절반보다 작고 상기 제 1 동작 온도, 상기 동작 간격 및 상기 간격 조정은 상기 사용자 인터페이스에 기초하여 획득될 수 있다. 또한, 상기 제 1 동작 온도가 상기 제 2 동작 온도보다 낮고, 상기 제 1 그룹에 포함되는 제 1-1 터널 휀 및 제 1-2 터널 휀 간의 거리는 상기 복수의 터널 휀 각각의 거리 중 가장 먼 거리이고, 상기 제 2 그룹에 포함되는 제 2-1 터널 휀 및 제 2-2 터널 휀은 각각 상기 제 1-1 터널 휀 및 상기 제 1-2 터널 휀에서 각각 기설정 거리 이상 떨어져있고, 상기 제 1-1 터널 휀의 단위 시간당 동작 시간이 기설정 시간 이상인 경우, 상기 제 2-1 터널 휀이 상기 제 1 그룹에 포함되고, 상기 제 1-1 터널 휀은 상기 제 1 그룹에서 배제될 수 있다.또한, 상기 복수의 알람 중 상기 적어도 하나의 알람을 상기 사용자 인터페이스를 통해 제공하는 단계는 상기 음수량 정보에 기초하여 기계 결함 알람 및 질병 예상 알람 중 적어도 하나를 제공하는 단계를 포함할 수 있다. 또한, 상기 기계 결함 알람 및 상기 질병 예상 알람 중 적어도 하나를 제공하는 단계는 단위 시간당 음수량의 변화량이 기설정 변화량 이상인 경우 또는 시간의 흐름에 따른 음수량이 감소하는 경우, 상기 기계 결함 알람을 제공하는 단계; 상기 단위 시간당 음수량의 변화량이 상기 기설정 변화량 미만이면서 상기 시간의 흐름에 따른 음수량이 예측 음수량 범위를 벗어나는 경우, 상기 질병 예상 알람을 제공하는 단계;를 포함할 수 있다. 본 개시의 제 2 측면에 따른 스마트팜에 대한 환경 정보 및 사양 정보 처리 하는 디바이스는, 축사 내부의 온도, 습도, 암모니아 농도 및 이산화탄소 농도 중 적어도 하나를 포함하는 환경 정보를 획득하고, 가축의 사양 관리와 관련하여 사료량 정보 및 음수량 정보 중 적어도 하나를 포함하는 사양 정보를 획득하는 센서부; 사용자 인터페이스를 통해 획득된 환경 설정 값에 기초하여 복수의 터널 휀 중 하나 이상의 터널 휀에 대한 동작 요청 을 송신하고, 상기 사용자 인터페이스를 통해 획득된 사양 설정 값에 기초하여 급이 모터를 포함하는 사양 장치 에 대한 동작 요청을 송신하는 프로세서; 및 상기 환경 정보 또는 상기 사양 정보에 기초하여 복수의 알람 중 적어도 하나의 알람을 제공하는 상기 사용자 인터페이스;를 포함할 수 있다. 또한, 상기 프로세서는 상기 복수의 터널 휀을 제 1 그룹 또는 제 2 그룹으로 중첩을 허용하여 그루핑하고, 상 기 제 1 그룹에 대응하는 제 1 동작 온도, 상기 제 2 그룹에 대응하는 제 2 동작 온도와 상기 제 1 동작 온도와 의 차이인 동작 간격 및 상기 제 1 그룹 및 상기 제 2 그룹의 동작 온도에 대한 오프셋을 나타내는 간격 조정을 결정하고, 상기 제 1 동작 온도 및 상기 간격 조정에 대응하는 제 1 온도 구간에서 상기 제 1 그룹에 대한 동작 요청을 송신하고, 상기 제 2 동작 온도 및 상기 간격 조정에 대응하는 제 2 온도 구간에서 상기 제 2 그룹에 대 한 동작 요청을 송신할 수 있다. 또한, 상기 간격 조정은 상기 동작 간격의 절반보다 작고 상기 제 1 동작 온도, 상기 동작 간격 및 상기 간격 조정은 상기 사용자 인터페이스에 기초하여 획득될 수 있다. 또한, 상기 제 1 동작 온도가 상기 제 2 동작 온도보다 낮고, 상기 제 1 그룹에 포함되는 제 1-1 터널 휀 및 제 1-2 터널 휀 간의 거리는 상기 복수의 터널 휀 각각의 거리 중 가장 먼 거리이고, 상기 제 2 그룹에 포함되는 제 2-1 터널 휀 및 제 2-2 터널 휀은 각각 상기 제 1-1 터널 휀 및 상기 제 1-2 터널 휀에서 각각 기설정 거리 이상 떨어져있고, 상기 제 1-1 터널 휀의 단위 시간당 동작 시간이 기설정 시간 이상인 경우, 상기 제 2-1 터널 휀이 상기 제 1 그룹에 포함되고, 상기 제 1-1 터널 휀은 상기 제 1 그룹에서 배제될 수 있다. 또한, 단위 시간당 음수량의 변화량이 기설정 변화량 이상인 경우 또는 시간의 흐름에 따른 음수량이 감소하는 경우, 상기 기계 결함 알람을 제공하고, 상기 단위 시간당 음수량의 변화량이 상기 기설정 변화량 미만이면서 상기 시간의 흐름에 따른 음수량이 예측 음수량 범위를 벗어나는 경우, 상기 질병 예상 알람을 제공할 수 있다. 본 개시의 제 3 측면에 따르면, 제 1측면의 방법을 구현하기 위한 프로그램이 기록된 컴퓨터로 판독 가능한 비 일시적 기록 매체를 제공할 수 있다."}
{"patent_id": "10-2022-0158268", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시 예에 따르면, 환경 정보 및 사양 정보를 처리하는데 있어, 센서를 통한 축사 내부의 환경 정 보 확인이 가능하고 가축의 사료량 및 음수량 정보에 대한 사양 정보 확인이 가능하다는 점에서 사용자는 축사 상황에 대한 직관적인 확인이 가능하기 때문에 편의성이 향상될 수 있다. 또한, 사용자로부터 축사 내 환경을 관리하기 위한 휀이 자동적으로 동작되도록 할 수 있어 관리에 대한 효율성 이 향상될 수 있다. 또한, 사용자가 휀이 동작되어야 하는 조건에 대한 정보를 입력하고 동작될 휀을 그루핑하여 매핑할 수 있다는 점에서 사용자 만족도가 향상될 수 있다. 또한, 온도에 따라 각 그룹 별 터널 휀을 가동할 수 있기 때문에 축사 내 환경을 관리하는데 효율성이 향상될 수 있다. 또한, 사료량에 따라 가축에 사료를 제공하는 급이 동작 프로세스가 수행될 수 있어 가축을 기르는데 사용자의 편의성이 향상될 수 있다. 또한, 음수량에 따라 가축의 질병 예상 및 기계 결함에 대한 알람을 제공하기 때문에 사용자는 실시간으로 상황 을 확인할 수 있다는 점에서 효율성이 향상될 수 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0158268", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술 되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 실시 예들에 제한되는 것이 아니 라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 개시가 완전 하도록 하고, 해당 기술 분야 에 속하는 통상의 기술자에게 본 개시의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 개시를 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 개시의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다."}
{"patent_id": "10-2022-0158268", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 해당 기술분야의 통상 의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소들과의 상관관계를 용이하게 기술하기 위 해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작 시 구 성요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤집을 경우, 다른 구성요소의 \"아래(below)\"또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있 다. 이하에서는 도면을 참조하여 실시 예들을 상세히 설명한다. 도 1 은 일 실시 예에 따른 스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스의 구성을 개략적으로 도시한 블록도이다. 도 1을 참조하면, 디바이스는 센서부, 프로세서 및 사용자 인터페이스를 포함할 수 있다. 일 실시 예에 따른 센서부는 축사 내부의 온도, 습도, 암모니아 농도 및 이산화탄소 농도 중 적어도 하나 를 포함하는 환경 정보를 획득할 수 있다. 또한, 센서부는 가축의 사양 관리와 관련하여 사료량 정보 및 음수량 정보 중 적어도 하나를 포함하는 사양 정보를 획득할 수 있다. 일 실시 예에 따른 프로세서는 사용자 인터페이스를 통해 획득된 환경 설정 값에 기초하여 복수의 터널 휀 중 하나 이상의 터널 휀에 대한 동작 요청을 송신할 수 있다. 또한, 프로세서는 사용자 인터페이스를 통해 획득된 사양 설정 값에 기초하여 급이 모터를 포함하는 사양 장치에 대한 동작 요청을 송신할 수 있다. 일 실시 예에 따른 사용자 인터페이스는 환경 정보 또는 사양 정보에 기초하여 복수의 알람 중 적어도 하 나의 알람을 제공할 수 있다. 또한, 센서부에서 복수의 센서로부터 환경 정보 및 사양 정보를 획득하고 프로세서에서 환경 설정 값 에 기초하여 휀에 대한 동작 요청을 송신하고, 사양 설정 값에 기초하여 사양 차이에 대한 동작 요청을 송신하 여 사용자 인터페이스에서 알람을 제공함에 따라 최종적으로 스마트팜에 대한 환경 및 사양 정보 관리가 처리되는 과정에서 인터넷망 또는 이동통신망 등과 같은 종래의 다양한 네트워크 조합에 의해 결합될 수 있으며, 이에 대해서는 특별한 제한이 없음을 유의해야 한다. 더하여, 도 1에 도시된 구성요소들 외에 다른 범용적인 구성요소가 스마트팜에 대한 환경 정보 및 사양 정보 처 리 디바이스에 더 포함될 수 있음을 관련 기술 분야에서 통상의 지식을 가진 자라면 이해할 수 있다. 예를 들면, 스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스는 복수의 센서로부터 획득한 환경 정보 및 사양 정보, 사용자 인터페이스를 통해 획득된 황경 설정 값 및 사양 설정 값에 대한 정보 등을 저장하는 메모리(미도시)를 더 포함할 수 있다. 또는 다른 실시 예에 따를 경우, 도 1에 도시된 구성요소들 중 일부 구성 요소는 생략될 수 있음을 관련 기술 분야에서 통상의 지식을 가진 자라면 이해할 수 있다. 일 실시 예에 따른 스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스는 사용자에 의해 이용될 수 있 고, 휴대폰, 스마트폰, PDA(Personal Digital Assistant), PMP(Portable Multimedia Player), 태블릿 PC 등과 같이 터치 스크린 패널이 구비된 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치와 연동될 수 있으며, 이 외에도 데스크탑 PC, 태블릿 PC, 랩탑 PC, 셋탑 박스를 포함하는 IPTV와 같이, 애플리케이션을 설치하고 실 행할 수 있는 기반이 마련된 장치에 포함되거나 연동될 수 있다. 스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스는 본 명세서에서 설명되는 기능을 실현시키기 위 한 컴퓨터 프로그램을 통해 동작하는 컴퓨터 등의 단말기로 구현될 수 있다. 일 실시 예에 따른 스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스는 환경 정보 및 사양 정보를 처리하는 시스템(미도시) 및 관련 서버(미도시)를 포함할 수 있으나, 이에 제한되지 않는다. 일 실시 예에 따른 서버는 스마트팜에 대한 환경 정보 및 사양 정보를 처리하는 서비스를 제공하는 애플리케이션을 지원할 수 있다. 이하에서는 일 실시 예에 따른 스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스가 독립적으로 축사 의 환경 및 가축의 식이에 대한 사양을 관리하는 실시 예를 중심으로 서술하도록 하지만, 전술한 것처럼, 서버 와의 연동을 통해 수행될 수도 있다. 즉, 일 실시 예에 따른 스마트팜에 대한 환경 정보 및 사양 정보 처리 디 바이스와 서버는 그 기능의 측면에서 통합 구현될 수 있고, 서버는 생략될 수도 있으며, 어느 하나의 실시 예에 제한되지 않음을 알 수 있다. 즉, 일 실시 예에서, 디바이스와 서버는 연동될 수 있으며 환경 정보 및 사양 정보 처리 장치로써 환경 및 사양을 관리하기 위한 구성은 서버에 의해 수행될 수 있으며 디바이스 에서 수행될 수도 있다. 예를 들면 디바이스는 서버로서 동작 할 수 있으며, 이하에서는 디바이스 로 통일하여 후술하도록 한다. 도 2 는 일 실시 예에 따른 스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스가 동작하는 각 단계를 도시한 흐름도이다. 단계 S210을 참조하면, 일 실시 예에 따른 디바이스는 축사 내부의 온도, 습도, 암모니아 농도 및 이산화 탄소 농도 중 적어도 하나를 포함하는 환경 정보를 획득할 수 있다. 일 실시 예에서, 환경 정보는 축사 내부에 대한 환경 정보에 대응되는 복수의 정보를 의미할 수 있다. 단계 S220을 참조하면, 일 실시 예에 따른 디바이스는 가축의 사양 관리와 관련하여 사료량 정보 및 음수 량 정보 중 적어도 하나를 포함하는 사양 정보를 획득할 수 있다. 일 실시 예에서, 사양 정보는 가축의 식이와 관련된 정보로 사료량 및 음수량에 대한 정보를 포함할 수 있다. 단계 S230을 참조하면, 일 실시 예에 따른 디바이스는 사용자 인터페이스를 통해 획득된 환경 설정 값에 기초하여 복수의 터널 휀 중 하나 이상의 터널 휀에 대한 동작 요청을 송신할 수 있다. 일 실시 예에서, 환경 설정 값은 사용자로부터 기설정된 설정 값을 의미할 수 있다. 환경 설정 값은 온도, 암모니아 농도 및 이산화탄 소의 값에 따라 휀이 동작되도록 하는 기준이 되는 값을 의미할 수 있다. 예를 들면, 디바이스는 사용자 인터페이스를 통해 입력되는 사용자 입력에 기초하여 환기가 되어야 하는(휀이 동작되어야 하는) 온도, 암 모니아 농도 및 이산화탄소의 기준 값을 환경 설정 값으로써 획득할 수 있다. 따라서, 온도, 암모니아 농도 및 이산화탄소의 값이 기설정된 환경 설정 값이 기설정 수준 이상으로 벗어날 경우 휀이 동작되도록 휀에 대한 동 작 요청을 송신할 수 있다. 단계 S230은 도 5를 참조하여 설명할 수 있다. 도 5를 참조하면, 디바이스는 사용자 인터페이스를 통해 휀에 대한 동작 설정 화면을 제공할 수 있다. 일 실시 예에서, 휀은 TG1 내지 TG8가 대응될 수 있고 디바이스는 사용자 입력에 기초하여 터널 휀 매핑을 수행할 수 있다. 사용자는 매핑 하고자 하는 휀을 클릭할 수 있고 원하는 그룹으로 매핑할 수 있다. 이 때, 복수의 터널에 매핑되는 휀은 중첩 이 허용될 수 있다. 예를 들면, 도 5에 도시된 바와 같이 2번째 그룹의 TG8과 6번째 그룹의 TG8은 동일한 휀일 수 있으며 중첩되어 서로 다른 그룹으로 매핑될 수 있다. 즉, 일 실시 예에 따른 디바이스는 복수의 터널 휀을 제 1 그룹 또는 제 2 그룹으로 중첩을 허용하여 그루핑할 수 있다. 또한, 디바이스는 사용자 인터페 이스를 통해 사용자 입력에 따른 제 1 동작 온도, 동작 간격, 간격 조정에 대한 정보를 획득할 수 있다. 일 실시 예에 따른 디바이스는 제 1 그룹에 대응하는 제 1 동작 온도, 제 2 그룹에 대응하는 제 2 동작 온 도와 제 1 동작 온도와의 차이인 동작 간격 및 제 1 그룹 및 제 2 그룹의 동작 온도에 대한 오프셋을 나타내는 간격 조정을 결정할 수 있다. 도 5를 참조하면, 사용자는 첫번째 그룹의 휀의 동작이 시작되어야 하는 제 1 동 작 온도를 입력할 수 있고, 그 다음 그룹의 휀의 동작이 시작되어야 하는 시점을 결정하기 위한 제 1 동작 온도 와의 간격이 되는 값인 동작 간격에 대응되는 값을 입력할 수 있다. 또한, 간격 조정은 각 그룹 별 휀이 동작되 어야 하는 범위를 결정할 수 있는 값으로 동작 온도가 결정된 이후 각 온도에서 +/-되는 값을 의미할 수 있다. 사용자는 동작 온도에 대한 오프셋을 나타내는 간격 조정에 대응되는 값을 입력할 수 있다. 예를 들면, 사용자 가 동작 온도를 18도로 입력한 경우 첫번째 그룹의 휀이 동작되어야 하는 기준 동작 온도 값은 18도가 대응될 수 있다. 또한, 동작 간격을 1도로 입력한 경우 첫번째 그룹 이후 등장하는 복수의 그룹에는 차례대로 18도에서 1도씩 상승된 온도 값이 대응될 수 있다. 따라서 그룹별 온도는 TG1=18도, TG2=19도, TG3=20도, TG4=21도ㆍㆍㆍ TG8=25도가 대응될 수 있다. 따라서, 사용자는 모든 그룹에 대응되는 온도를 별도로 각각 입력하지 않아도 되며 동작 간격만 입력함에 따라 8개의 그룹에 대응되는 온도가 자동적으로 결정될 수 있다. 또한, 간격 조정은 휀의 동작 범위에 대응되는 값으로 사용자가 간격 조정을 0.2로 입력한 경우 각 그룹별 동작 온도에서 0.2만큼 플러 스, 마이너스 된 값에 따라 휀의 동작 범위가 결정될 수 있다. 예를 들면, 동작 온도가 18도인 경우 17.8도일 때 해당 그룹의 휀이 정지될 수 있고 18.2도일 때 해당 그룹의 휀이 동작될 수 있다. 일 실시 예에서, 단순히 18도 이상일 경우 휀이 바로 동작되고 18미만일 경우 휀이 바로 정지되도록 하는 경우 온도에 따라 휀의 ON/OFF 가 반복적으로 동작됨에 따라 고장 확률이 높아질 수 있기 때문에 간격 조정을 통하여 휀이 동작되도록 하는 것 이 효율적일 수 있다. 따라서, 디바이스는 별도의 간격 조정에 대응되는 값을 사용자로부터 입력 받을 수 있다. 또한, 디바이스는 제 1 동작 온도 및 간격 조정에 대응하는 제 1 온도 구간에서 제 1 그룹에 대한 동작 요청을 송신할 수 있고 제 2 동작 온도 및 간격 조정에 대응하는 제 2 온도 구간에서 제 2 그룹에 대한 동 작 요청을 송신할 수 있다. 예를 들면, 제 1 그룹에 대한 제 1 동작 온도가 18도이고 간격 조정이 0.2인 경우 상술한 바와 같이 제 1 온도 구간은 18.2도 이상인 구간에 대응될 수 있다. 따라서, 디바이스는 18.2도 이 상인 구간(제 1 온도 구간)에서 제 1 그룹이 동작하도록 동작 요청을 송신할 수 있다. 또한, 제 2 그룹에 대한 제 2 동작 온도는 제 1 동작 온도에서 동작 간격만큼 플러스된 온도가 대응될 수 있고 제 1 동작 온도가 18도 이고 동작 간격이 1인 경우 제 2 동작 온도는 19도일 수 있다. 따라서, 제 2 온도 구간은 19.2도 이상인 구간에 대응될 수 있다. 따라서, 디바이스는 19.2도 이상인 구간(제 2 온도 구간)에서 제 2 그룹이 동작하도록 동 작 요청을 송신할 수 있다. 이에 따라, 사용자는 제 1 동작 온도, 동작 간격, 간격 조정에 대응하는 값만 입력 하면 복수의 터널 모든 그룹에 대해서 동작하는 온도 구간이 자동적으로 결정될 수 있다는 점에서 편의성이 향상될 수 있다. 일 실시 예에서, 간격 조정은 동작 간격의 절반보다 작을 수 있다. 또한, 제 1 동작 온도, 동작 간격 및 간격 조정은 상술한 바와 같이 사용자 인터페이스를 통해 사용자 입력으로 획득될 수 있다. 간격 조정은 미세한 온도 차이에 따른 휀의 동작 조건을 결정하기 위한 것인데 기설정 수준 이상으로 클 경우 무의미 한 값일 수 있다. 예를 들면, 간격 조정이 10이고 동작 온도가 18도일 경우 휀의 동작이 멈추는 동작 온도는 8 도에 대응되고 휀의 동작이 시작되는 동작 온도가 28도에 대응되게 되기 때문에 간격 조정의 값이 어느 수준 이 상으로 큰 경우 무의미한 값들이 도출 될 수 있다. 또한, 동작 간격과 간격 조정이 같은 값일 경우 처음에 제 1 동작 온도를 다르게 설정하는 것이 바람직할 수 있다. 예를 들면, 제 1 동작 온도가 18도이고 동작 간격 및 간 격 조정에 대응되는 값이 1인 경우 제 1 그룹은 19도에 동작하고 제 2 그룹은 20도에 동작되게 되는 경우가 발 생할 수 있다. 이는 동작 간격 및 간격 조정을 상이한 값으로 획득하는 이유에 있어 무의미해질 수 있다. 따라 서, 간격 조정의 값이 기설정 수준 이하로 작은 값이어야 시스템의 효율성이 향상될 수 있다. 따라서, 디바이스 는 간격 조정의 값은 동작 간격의 절반보다 작은 값으로 입력되도록 할 수 있다. 일 실시 예에 따라 제 1 동작 온도가 제 2 동작 온도보다 낮을 수 있고, 제 1 그룹에 포함되는 제 1-1 터널 휀 및 제 1-2 터널 휀 간의 거리는 복수의 터널 휀 각각의 거리 중 가장 먼 거리일 수 있다. 예를 들면, 제 1 그룹 에 포함되는 복수의 휀이 제 1 동작 온도에 기초하여 동작될 수 있는데 축사 또는 농장 등의 규모에 따라 가까 운 휀들만 동작하는 것은 효율성이 낮아질 수 있기 때문에 제 1 그룹 내 복수의 휀은 거리가 가장 먼 휀으로 구 성될 수 있다. 휀이 일렬로 정렬되어 있다고 가정한다면 제 1-1 터널 휀은 맨 앞에 존재하는 휀이 대응될 수 있 고 제 1-2 터널 휀은 맨 뒤에 존재하는 휀이 대응될 수 있다. 또한, 제 2 그룹에 포함되는 제 2-1 터널 휀 및 제 2-2 터널 휀은 각각 제 1-1 터널 휀 및 제 1-2 터널 휀에서 각각 기설정 거리 이상 떨어져 있을 수 있다. 예 를 들면, 제 1 그룹 내 복수의 휀이 동작하고 있는 상태에서 제 2 그룹에 포함되는 복수의 휀이 제 2 동작 온도 에 기초하여 동작될 수 있는데 제 1 그룹에 포함되는 휀과 제 2 그룹에 포함되는 휀의 거리가 너무 가까울 경우 환기하는데 있어 효율성이 낮아질 수 있기 때문에 기설정 거리 이상 떨어져 있도록 하는 것이 바람직할 수 있다. 따라서, 제 1그룹의 제 1-1 터널 휀과 제 2 그룹의 제 2-1 터널 휀의 거리가 기설정 거리 이상 떨어져 있 도록 하고, 제 1그룹의 제 1-2 터널 휀과 제 2 그룹의 제 2-2 터널 휀의 거리가 기설정 거리 이상 떨어져 있도 록 할 수 있다. 또한, 제 1-1 터널 휀의 단위 시간당 동작 시간이 기설정 시간 이상인 경우, 제 2-1 터널 휀이 제 1 그룹에 포함되고, 제 1-1 터널 휀은 제 1 그룹에서 배제될 수 있다. 예를 들면, 제 1 동작 온도에서 계속 휀이 동작되고 있을 경우 제 1 그룹 내의 휀이 계속해서 동작할 수 있고, 제 1 그룹 내의 휀은 가장 낮은 온도 부터 동작하기 때문에 복수의 제 2 내지 제 8 그룹 내의 휀이 동작할 때에도 계속해서 동작될 수 있다. 따라서, 제 1 그룹 내 휀의 사용량이 가장 많을 수 있고 고장의 확률이 높아질 수 있다. 따라서, 제 1 동작 온도가 18도 이고 현재 온도가 18.5도인 경우 제 1 그룹 내 휀이 계속해서 동작될 수 있는데 기설정 시간 이상 동작되었을 경우 다른 그룹의 휀이 제 1 그룹 내로 매핑되도록 하고 기존의 제 1 그룹 내 휀이 다른 그룹 내로 매핑되도록 하여 제 1 그룹에서 배제되도록 할 수 있다. 이와 같이, 사용자로부터 입력된 그루핑에 기초하여 휀의 동작이 수행될 수 있고, 이후에 디바이스는 한 그룹 내 휀이 기설정 시간 이상 동작된 것으로 판단되는 경우 휀 대체 프로세스를 수행할 수 있다. 본 명세서에서, 제 1 그룹 및 제 2 그룹으로 실시 예를 설명하였지만, 이는 제 1 그룹 내지 제 8 그룹 모든 그룹에 적용될 수 있음은 이해할 수 있을 것이다. 단계 S240을 참조하면, 일 실시 예에 따른 디바이스는 사용자 인터페이스를 통해 획득된 사양 설정 값에 기초하여 급이 모터를 포함하는 사양 장치에 대한 동작 요청을 송신할 수 있다. 단계 S240은 도 8 및 도 9를 참 조하여 설명할 수 있다. 도 8을 참조하면, 디바이스는 통합 관리 콘트롤러를 포함할 수 있고 사용자 인터 페이스 및 중량 표시기와의 이동통신을 통해 급이 모터의 동작이 수행되도록 할 수 있다. 일 실시 예에서, 디바이스는 정량 급이 동작 및 정시 급이 동작에 대한 동작 요청을 송신할 수 있다. 도 9를 참조하면, 디 바이스는 사용자 인터페이스를 통해 사용자 입력으로 동작 시간, 정지 시간, 급이량에 대한 정보를 획득할 수 있고, 정시 급이 및 정량 급이 등에 대한 선택 입력을 획득할 수 있다. 사료빈관리기는 현재 사료량 데이터를 설치된 전자저울 및/또는 센서를 통해 수집할 수 있고 디바이스는 사용자 인터페이스를 통 해 설정된 동작 시간과 급이량 데이터에 기초하여 설정된 시간에 설정된 사료량만큼 급이가 되도록 급이 동작 요청을 수행할 수 있다. 급이 모터를 동작시키면 사료빈 내부에 있는 사료들은 급이 파이프를 통해 축사 내부로 이송될 수 있고 사료량은 실시간으로 감소하게 된다. 디바이스는 사료량 데이터를 실시간으로 감시하면서 사용자가 설정한 급이량 만큼 감소하게 되면 급이 모터가 정지되도록 할 수 있다. 또한, 디바이스는 급이 동작 프로세스를 수행함에 따라 사료량 변화 그래프 및 테이블을 사용자 인터페이스를 통해 제공할 수 있 고 정상적인 정량 급이 동작이 실행 되었는지에 대한 모니터링이 가능하도록 할 수 있다. 단계 S250을 참조하면, 일 실시 예에 따른 디바이스는 환경 정보 또는 사양 정보에 기초하여 복수의 알람 중 적어도 하나의 알람을 사용자 인터페이스를 통해 제공할 수 있다. 단계 S250은 도 10을 참조하여 설명할 수 있다. 또한, 디바이스는 음수량 정보에 기초하여 기계 결함 알람 및 질병 예상 알람 중 적어도 하나 를 제공할 수 있다. 디바이스는 단위 시간당 음수량의 변화량이 기설정 변화량 이상인 경우 또는 시간의 흐름에 따른 음수량이 감소하는 경우, 기계 결함 알람을 제공할 수 있다. 또한, 단위 시간당 음수량의 변화량이 기설정 변화량 미만이면서 시간의 흐름에 따른 음수량이 예측 음수량 범위를 벗어나는 경우, 질병 예상 알람을 제공할 수 있다. 일 실시 예에서, 디바이스는 사용자 인터페이스를 통해 입력되는 1일 음수량에 대한 기설정 값에 따라 음수량 값이 기설정 값에 도달하게 되면 음수를 공급하는 음수 모터를 포함하는 사양 장치에 대한 동작 요청을 송신할 수 있다. 따라서, 음수 모터 제어에 따라 동작이 자동 제어될 수 있다. 또한, 정상적 인 음수량 그래프는 일정 기울기를 가지면서 증가하게 되어 있는데 음수량 그래프가 급격하게 증가하는 경우와 증가 추세가 멈추거나 떨어지는 경우에는 음수 파이프 라인의 기계적 결함을 예측할 수 있고 이에 따라 기계 결 함 알림을 제공할 수 있다. 또한, 완만한 증가 추세와 감소 추세의 경우, 가축의 질병 감병을 의심할 수 있어 질병 예상 알람을 제공할 수 있다. 도 10을 참조하면, 가축이 움직이는 시간에 대응되는 구간에 지속적인 증가 추세를 보일 수 있다. 이 때, 단위 시간당 음수량의 변화량이 기설정 변화량 이상인 경우 H로 표기된 그래프가 대응될 수 있고 단위 시간당 음수량의 변화량이 기설정 변화량 이하인 경우 L로 표기된 그래프가 대응될 수 있 다. 단위 시간당 음수량의 변화량이 기설정 변화량 이상인 H 그래프 이상으로 넘어가는 경우 평균 기준이 되는 음수량보다 너무 많은 음수량이 제공되는 것이기 때문에 파이프 라인 등의 누수 등을 의심할 수 있어 기계 결함 으로 예측할 수 있다. 또한, 시간의 흐름에 따른 음수량이 감소하는 경우 음수량은 시간이 지날수록 증가하는 것이 일반적인데 음수량이 감소하는 것은 측정이 잘못되고 있거나 음수가 제공되고 있지 않다는 것이기 때문에 기계 결함을 예측할 수 있고 이에 따라 기계 결함 알람을 제공할 수 있다. 또한, 단위 시간당 음수량의 변화량 이 기설정 변화량 미만인 L 그래프 이하로 내려가는 경우, 예측 음수량 범위를 벗어나는 경우로 평균 기준이 되 는 음수량보다 너무 적은 음수량이 제공되는 것일 수 있고 기울기가 완만해질 경우 평균 기준이 되는 음수량의 변화가 더딘 것이기 때문에 가축이 음수를 섭취하지 못하고 있는 경우에 대응될 수 있어 가축의 질병을 예측할 수 있고 이에 따라 질병 예상 알람을 제공할 수 있다. 또한, 디바이스는 H, L 라인에 근접하게 되면 우선 적으로 위험을 알리는 제1차 알람(예를 들면 진동 또는 메시지)을 제공할 수 있고, 벗어나게 되면 제2차 알람 (예를 들면 소리알람)을 제공할 수 있다. 그래프에서의 'H', 'L' 라인의 설정은 사용자 인터페이스를 통한 사용자 입력에 기초하여 설정될 수 있고 디바이스는 그래프를 사용자 인터페이스를 통해 제공할 수 있다. 따라서, 디바이스가 음수량 변화량에 따른 기계 결함 알람 및 질병 예상 알람을 제공하기 때문에 사 용자는 실시간으로 알람을 제공받을 수 있어 편의성이 향상될 수 있다. 도 3 은 일 실시 예에 따른 스마트팜 환경 정보 및 사양 정보 관리에 대한 자동화 시스템을 개략적으로 도시한 도면이다. 도 3을 참조하면, 디바이스는 통합관리 콘트롤러를 포함할 수 있고 사용자 인터페이스와 이동통신이 가능할 수 있다. 또한, 유무선 통신 모듈을 통하여 관리자 서버 시스템과 이동통신이 가능할 수 있다. 또한, 센 서부에 환경 관리 센서 모듈, 사양 관리 센서 모듈이 포함될 수 있고 환경 관리 모듈 및 사양 관리 모듈을 통해 환기 제어 장치, 악취 저감 장치, 사료빈관리기 및 음수관리기 동작을 제어할 수 있다. 따라서, 디바이스 에 포함되는 통합관리 콘트롤러는 센서모듈로부터 환경 정보와 사양 정보를 전송 받아 사용자 인터페이스 를 통해 사용자에게 제공하고 환경 제어 모듈에 동작 조건을 입력 받아 환기 장치, 악취 저감 장치 등과 같은 환경 관리 요소들을 제어할 수 있고, 사양관리기에 대한 동작 조건에 따라 사료빈관리기와 음수관리기의 동작을 제어할 수 있다. 도 4 는 일 실시 예에 따른 디바이스가 사용자 인터페이스를 통해 환경 정보 제공 및 환경 설정 값을 획득하는 일 예를 나타내는 도면이다. 도 4를 참조하면, 디바이스는 현재 축사 내부 환경 정보를 내부 온도, 내부 습도, 암모니아, 이산화탄소 란을 통해 제공할 수 있다. 또한, 디바이스는 사용자 입력에 기초하여 온도, 암모니아, 이산화탄소에 대한 환경 설정 값을 획득할 수 있다. 사용자는 휀이 동작되는 설정 값으로 환기 동작 설정란을 통해 암모니아, 이산 화탄소, 온도에 대응되는 설정 값을 입력할 수 있고, 악취 저감 장치가 동작되는 설정 값으로 악취 저감 동작 설정란을 통해 암모니아, 이산화탄소에 대응되는 설정 값을 입력할 수 있다. 또한, 경보가 동작되는 설정 값으 로 경보 동작 설정란을 통해 암모니아, 이산화탄소, 온도에 대응되는 설정 값을 입력할 수 있다. 디바이스(10 0)는 동작 범위를 결정할 수 있는 입력란을 제공할 수 있고 상술한 간격 조정 요소와 같이 입력되는 값에 기초 하여 각각의 휀, 악취 저감 장치, 경보가 동작되는 범위가 결정될 수 있다. 도 5 는 일 실시 예에 따른 디바이스가 사용자 인터페이스를 통해 휀에 대한 동작 설정 화면을 제공 하는 일 예를 나타내는 도면이다. 도5를 참조하면, 단계 S230에서 설명한 바와 같이, 사용자는 동작 온도, 동작간격, 간격 조정에 대응되는 값을 입력할 수 있고 복수의 터널 휀을 복수의 그룹 내 중첩을 허용하여 그루핑할 수 있다. 도 6 은 일 실시 예에 따른 디바이스가 사용자 인터페이스를 통해 환경 정보 및 사양 정보를 제공하 는 화면의 일 예를 나타내는 도면이다. 도 6을 참조하면, 디바이스는 축사 내부 또는 외부에 대응되는 온 도, 습도 및 풍속에 대한 정보를 제공할 수 있고 축사 내 암모니아, 이산화탄소에 대한 값을 제공할 수 있다. 또한, 사료량 및 음수량을 제공할 수 있고 휀의 동작 여부 및 동작되는 휀에 대한 정보를 상이한 색상(빨간색) 으로 나타냄에 따라 표시할 수 있다. 또한, 급이, 음수 등에 대한 정보를 안전할 경우 파란색, 위험할 경우 빨 간색으로 나타냄에 따라 사용자가 현재 축사 내 상황을 직관적으로 확인 가능하도록 할 수 있다. 도 7 은 일 실시 예에 따른 환경 관리 모듈에서의 동작을 설명하기 위한 도면이다. 도 7을 참조하면, 환경관리모듈은 사용자 인터페이스에서 사용자에 의해 입력된 동작 조건에 따라 통합관 리 콘트롤러에 의해 동작 조건이 설정될 수 있고 조건에 따라 해당되는 장치들의 실행 동작과 정지 동작을 실행 할 수 있다. 각 장치들의 실행은 센서 모듈에서 입력되는 센서 측정값과 사용자가 설정한 설정 값을 비교함에 따라 의해 결정 될 수 있고, 환경관리모듈은 접점제어모듈에 연결된 장치에 대한 실행을 결정할 수 있다. 각 장 치들의 접점은 미리 지정된 위치에 해당 장치들의 동작 전원을 연결하여 통합관리 콘트롤러의 제어 신호에 따라 실행될 수 있다. 도 8 은 일 실시 예에 따른 디바이스가 급이 동작 프로세스를 수행하는 일 예를 설명하기 위한 도면이다. 도 8으ㄹ 참조하면, 단계 S240에서 설명한 바와 같이, 디바이스는 사용자 인터페이스를 통해 설정된 동작 시간과 급이량 데이터에 기초하여 설정된 시간에 설정된 사료량만큼 급이가 되도록 급이 동작 요청을 수행 할 수 있다. 급이 모터를 동작시키면 사료빈 내부에 있는 사료들은 급이 파이프를 통해 축사 내부로 이송될 수 있고 사료량은 실시간으로 감소하게 된다. 디바이스는 사료량 데이터를 실시간으로 감시하면서 사용자가 설정한 급이량 만큼 감소하게 되면 급이 모터가 정지되도록 할 수 있다. 또한, 디바이스는 급이 동작 프로 세스를 수행함에 따라 사료량 변화 그래프 및 테이블을 사용자 인터페이스를 통해 제공할 수 있고 정상적 인 정량 급이 동작이 실행 되었는지에 대한 모니터링이 가능하도록 할 수 있다. 도 9 는 일 실시 예에 따른 디바이스가 사용자 인터페이스를 통해 급이 동작에 대한 설정 화면을 제공하는 일 예를 나타내는 도면이다. 도 9를 참조하면, 단계 S240에서 설명한 바와 같이, 디바이스는 사용자 인터 페이스를 통해 사용자 입력으로 동작 시간, 정지 시간, 급이량에 대한 정보를 획득할 수 있고, 정시 급이 및 정량 급이 등에 대한 선택 입력을 획득할 수 있다. 또한, 순번에 따라 입력된 복수의 급이량에 기초하여 하 루 총 급이량을 제공할 수 있고, 현재 남은 사료량에 대한 정보를 제공할 수 있다. 도 10 은 일 실시 예에 따른 시간에 따른 음수량의 변화량에 대한 정보를 제공하는 일 예를 도시한 도면이다. 도 10을 참조하면, 단계 S250에서 설명한 바와 같이, 디바이스는 H, L 라인에 근접하게 되면 우선적으로 위험을 알리는 제1차 알람(예를 들면 진동 또는 메시지)을 제공할 수 있고, 벗어나게 되면 제2차 알람(예를 들 면 소리알람)을 제공할 수 있다. 그래프에서의 'H', 'L' 라인의 설정은 사용자 인터페이스를 통한 사용자 입력에 기초하여 설정될 수 있고 디바이스는 그래프를 사용자 인터페이스를 통해 제공할 수 있다. 따 라서, 디바이스가 음수량 변화량에 따른 기계 결함 알람 및 질병 예상 알람을 제공하기 때문에 사용자는 실시간으로 알람을 제공받을 수 있어 편의성이 향상될 수 있다. 일 실시 예에 따르면, 환경 정보 및 사양 정보를 처리하는데 있어, 센서를 통한 축사 내부의 환경 정보 확인이 가능하고 가축의 사료량 및 음수량 정보에 대한 사양 정보 확인이 가능하다는 점에서 사용자는 축사 상황에 대 한 직관적인 확인이 가능하기 때문에 편의성이 향상될 수 있다. 또한, 사용자로부터 축사 내 환경을 관리하기 위한 휀이 자동적으로 동작되도록 할 수 있어 관리에 대한 효율성이 향상될 수 있고, 사용자가 휀이 동작되어야 하는 조건에 대한 정보를 입력하고 동작될 휀을 그루핑하여 매핑할 수 있다는 점에서 사용자 만족도가 향상될 수 있다. 또한, 온도에 따라 각 그룹 별 터널 휀을 가동할 수 있기 때문에 축사 내 환경을 관리하는데 효율성이 향상될 수 있고, 사료량에 따라 가축에 사료를 제공하는 급이 동작 프로세스가 수행될 수 있어 가축을 기르는데 사용자의 편의성이 향상될 수 있다. 또한, 음수량에 따라 가축의 질병 예상 및 기계 결함에 대한 알람을 제공하 기 때문에 사용자는 실시간으로 상황을 확인할 수 있다는 점에서 효율성이 향상될 수 있다. 본 개시의 다양한 실시 예들은 기기(machine)(예를 들어, 디스플레이 장치 또는 컴퓨터)에 의해 읽을 수 있는 저장 매체(storage medium)(예를 들어, 메모리)에 저장된 하나 이상의 인스트럭션들을 포함하는 소프트웨어로서 구현될 수 있다. 예를 들면, 기기의 프로세서(예를 들어, 프로세서)는, 저장 매체로부터 저장된 하나이상의 인스트럭션들 중 적어도 하나의 인스트럭션을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호 출된 적어도 하나의 인스트럭션에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 인스트럭션들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함 할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는 다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 개시에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치 들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리 와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 본 발명에 대하여 예시한 도면을 참조로 하여 설명하였으나 개시된 실시 예와 도면에 의해 한정되는 것은 아니 며 본 실시 예와 관련된 기술 분야에서 통상의 지식을 가진 자는 상기된 기재의 본질적인 특성에서 벗어나지 않 는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 방법들은 한정적인 관점 이 아니라 설명적인 관점에서 고려되어야 한다. 실시 예를 설명하며 본 발명의 구성에 따른 작용 효과를 명시적 으로 기재하여 설명하지 않았을지라도, 해당 구성에 의해 예측이 가능한 효과 또한 인정될 수 있다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발 명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0158268", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 일 실시 예에 따른 스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스의 구성을 개략적으로 도시 한 블록도이다. 도 2 는 일 실시 예에 따른 스마트팜에 대한 환경 정보 및 사양 정보 처리 디바이스가 동작하는 각 단계를 도시 한 흐름도이다. 도 3 은 일 실시 예에 따른 스마트팜 환경 정보 및 사양 정보 관리에 대한 자동화 시스템을 개략적으로 도시한 도면이다. 도 4 는 일 실시 예에 따른 디바이스가 사용자 인터페이스를 통해 환경 정보 제공 및 환경 설정 값을 획득하는 일 예를 나타내는 도면이다. 도 5 는 일 실시 예에 따른 디바이스가 사용자 인터페이스를 통해 휀에 대한 동작 설정 화면을 제공하는 일 예 를 나타내는 도면이다. 도 6 은 일 실시 예에 따른 디바이스가 사용자 인터페이스를 통해 환경 정보 및 사양 정보를 제공하는 화면의 일 예를 나타내는 도면이다. 도 7 은 일 실시 예에 따른 환경 관리 모듈에서의 동작을 설명하기 위한 도면이다. 도 8 은 일 실시 예에 따른 디바이스가 급이 동작을 수행하는 일 예를 설명하기 위한 도면이다. 도 9 는 일 실시 예에 따른 디바이스가 사용자 인터페이스를 통해 급이 동작에 대한 설정 화면을 제공하는 일 예를 나타내는 도면이다. 도 10 은 일 실시 예에 따른 시간에 따른 음수량의 변화량에 대한 정보를 제공하는 일 예를 도시한 도면이다."}
