{"patent_id": "10-2019-0088451", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0011244", "출원번호": "10-2019-0088451", "발명의 명칭": "자율주행장치 레이싱게임 제공방법과 레이싱장치 및 시스템", "출원인": "(주)케이시크", "발명자": "김영렬"}}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자율주행장치를 활용한 레이싱게임을 제공함에 있어서, 레이싱게임에 참여하는 특정 자율주행장치의 경로정보를 출력하는 단계;참가자 또는 팀이 수행해야 하는 사용자미션에 대한 미션수행정보를 입력받는 단계;상기 미션수행정보를 참고하여 상기 경로정보를 조정하는 단계;상기 조정된 경로정보를 자율주행장치의 주행에 적용하는 단계; 및상기 참가자 또는 팀의 주행결과를 판정하는 단계;를 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법."}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1항에 있어서,상기 사용자미션은 투표미션이고, 상기 미션수행정보는 복수 참가자의 투표결과이며,상기 경로정보를 조정하는 단계는 다수의 참가자의 집단지성을 활용하여 상기 경로정보를 조정하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법."}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항1항에 있어서,주행단말이 영상정보를 획득하여 게임서버, 사용자단말 또는 방송중계장치에 전송하는 단계;를 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항3항에 있어서,방송중계모듈은 상기 영상정보를 전송받아 출력하는 단계;를 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항3항에 있어서,사용자단말이 상기 영상정보를 전송받아 출력하는 단계;를 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1항에 있어서,주행단말 또는 사용자단말이 주행상태정보를 출력하는 단계;를 더 포함하는 것을 특징으로 하는 자율주행장치공개특허 10-2021-0011244-3-레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1항에 있어서,모형장치가 주행상태정보의 4D 효과를 출력하는 단계;를 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1항에 있어서,주행단말이 가상의 주행상태정보를 수신하는 단계;상기 주행단말에 연결된 주행자율장치가 상기 가상의 주행상태정보에 대응하는 4D효과를 출력하는 단계;를 더포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1항에 있어서,사용자단말이 게임서버로부터 영상정보를 전송받는 단계; 및사용자단말이 상기 영상정보를 출력하는 단계; 를 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1항에 있어서,사용자미션을 통해 특정 참가자 또는 팀에게 공격권 또는 회피권을 주는 단계를 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1항에 있어서,주행결과를 게임결과 판정에 반영하는 단계를 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1항에 있어서,상기 게임서버는 특정 주행미션의 수행결과 또는 특정 사용자미션의 수행결과를 게임결과 판정에 반영하는 단계를 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 1항에 있어서,공개특허 10-2021-0011244-4-상기 게임서버는 특정 참가자 또는 팀에 주어진 사용자미션에 대한 수행결과를 게임결과 판정에 반영하는 단계를 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 1항에 있어서,상기 게임서버는 사용자나 팀이 벌칙을 받거나 또는 공격권의 사용함에 따라 특정 주행단말의 경로정보가 조정되는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법."}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "자율주행장치를 활용한 레이싱게임을 제공함에 있어서, 레이싱 게임을 위한 경로정보를 출력하고,사용자미션의 미션수행정보를 기반으로 상기 경로정보를 조정하고,상기 조정된 경로정보를 기반으로 자율주행하고,상기 경로정보에 따라 주행했는지 주행결과를 판정하고,상기 레이싱 게임의 게임결과를 판정하는 것을 특징으로 하는 레이싱장치."}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15항에 있어서,주행상태정보의 4D 효과를 추가적으로 출력하는 것을 특징으로 하는 레이싱장치."}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "항에 있어서,사용자미션 수행정보를 입력받아 상기 게임서버에 전송하는 사용자단말을 더 포함하는 것을 특징으로 하는 자율주행장치 레이싱게임 시스템"}
{"patent_id": "10-2019-0088451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17항에 있어서,상기 게임서버는 주행상태정보를 모형장치에 전송하는 게임서버이고,상기 주행상태정보를 전송받아 4D효과를 출력하는 것을 특징으로 하는 모형장치를 더 포함하여 구성하는 것을특징으로 하는 자율주행장치 레이싱게임 시스템공개특허 10-2021-0011244-5-청구항 19"}
{"patent_id": "10-2019-0088451", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 자율주행차나 자율주행 드론과 같은 자율주행장치를 이용하여 안전한 레이싱게임을 즐길 수 있는 자율 주행장치 레이싱게임방법 및 레이싱장치과 시스템을 제공한다. 자율주행이 가능한 레이싱장치에 게임참여를 위한 탑승자들이 탑승하여 레이싱게임이 시작하면 레이싱장치는 경 (뒷면에 계속)"}
{"patent_id": "10-2019-0088451", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 둘 사용자 단말을 이용하는 참가자에게 자율주행 자동차, 자율주행 드론, 로보트 등의 자율주행장치 를 이용한 레이싱게임을 제공하기 위하여 자율주행장치 기반의 레이싱게임 제공방법 및 그 시스템에 관한 것이다. 좀 더 자세하게는 본 발명은 자율주행장치 기반의 레이싱게임에 참여하는 참가자는 참여 단말을 이용하여 참가 자미션을 수행하거나 사용자단말에 특정 사용자미션 수행결과를 입력받아 수행결과를 게임서버로 전송하고 상기 참가자의 미션수행 결과 정보를 전송 받은 게임서버는 사용자미션의 수행 평가에 따라 상기 참가자와 대응하는 자율주행장치 또는 이와 연결된 주행단말의 경로정보를 조정하는 방식으로 복수의 참가자에게 자율주행 레이싱 게임을 제공하는 방법 및 그 시스템에 관한 것이다. 또한, 본 발명은 상기 조정된 경로정보를 상기 주행단말이 수신하고 자율주행장치가 경로정보에 따른 주행을 완 료한 후 자율주행에 걸린 시간 또는 레이싱게임에 있어서 사용자미션이나 주행미션을 통해 획득한 점수나 포인 트, 경로정보의 완주여부를 고려하여 특정 참가자 또는 특정 팀의 순위나 승패를 결정하는 방식의 자율주행 레 이싱게임을 제공하는 방법 또는 시스템에 관한 것이다. 명세서 전반에서 참가자는 특정 팀의 소속으로 레이싱게임에 참여하는 개인 참가자를 뜻한다. 참가자는 팀을 통 해 적어도 하나 이상의 자율주행장치와 매칭되어 참여한다. 명세서에서 참가자는 팀을 대변하여 쓰이기도 하며, 팀은 한사람이상의 참가자가 소속된 레이싱게임 참여하는 기본 모듈이다. 명세서 전반에서 \"경쟁자\"란 동일 게임에 참여하는 특정 팀 또는 특정 참가와 승리나 순위를 놓고 경쟁하는 팀 이나 팀 소속의 참가자 또는 경쟁 기록을 가질수 있는 제 3자를 뜻한다. 여기에서 경쟁기록을 가질 수 있는 제 3자는 사람일 수도 있으며 AI 기술일 수도 있다. 즉 본 발명에서의 레이싱게임은 사람이 포함되는 팀이 AI로 움 직이는 팀과의 레이싱게임으로 매칭할 수도 있다. 명세서 전반에서 \"참가자의 자율주행장치\", 또는 \"팀의 자율주행장치\"와 같은 표현은 특정 참가가 혹은 특정 팀 에 매칭된 자율주행장치를 뜻한다. 자율주행차는 주행장치와 연결되거나 통합된 형태로 매칭된다. 명세서 전반에서 \"경쟁자의 자율주행장치\"는 특정 팀 또는 특정 개인참가자와 동일 게임에서 경쟁 위치에 있는 다른 팀 또는 다른 개인참가자에 매칭된 자율주행장치를 뜻한다. 명세서 전반에서 \"주행미션\"은 자율주행차가 레이싱게임 중에 수행해야하는 일을 의미하며 특정 위치나 사물을 포함하는 사진을 찍어야 하는 사진미션, 일정 시간동안 주행을 정지하는 정지미션, 사람이나 물건 또는 동물을 태우거나 내리게 하는 운송미션 등이 여기에 포함된다. 명세서 전반에서 \"모형장치\"란 특정 자율주행장치와 매칭되는 하나의 장치로 구동장치를 가지고 있으며 자율주 행장치의 주행상태정보를 4D효과로 출력하는 장치다. 명세서 전반에서 \"사용자미션\"은 특정 참가자가 수행해야하는 일로서 여러 사람이 투표로 의견를 결정하는 투표 미션, 퀴즈를 풀어야 하는 퀴즈미션, 여러 사람의 의견을 물어 결정하는 투표미션, 특정 요구조건의 사진을 찍 는 사진미션, 특정 행동을 수행해야 하는 행동미션 등이 있다. 명세서 전반에서 \"경로정보\"는 특정 자율주행장치가 레이싱게임에서 완주해야 하는 전체 및 각 구간의 주행목표 와 주행조건 등이 포함된 정보이다. 주행목표에 관한 정보는 특정 타겟지점, 주행거리, 제한시간, 주행미션이나 사용자미션의 수행횟수 또는 점수 등의 목표값으로 구성된다. 경로정보에 포함되는 주행조건에는 최고주행속도, 연료정보, 주행미션, 지도정보 등이 추가될 수 있다. 연료정 보나 최고주행속도 등은 특정 주행장치의 실제 연료정보나 실제 도로에서의 최대주행속도가 아니며 게임진행을 위해 관리되는 가상의 데이터이다. 명세서 전반에서 '타겟지점'은 자율주행장치가 가야할 위치와 관련된 정보를 가르킨다. 타겟지점은 건물이나 지 형지물의 주소나 좌표 등과 같은 고정된 위치로 나타낼 수 있고 또한, 움직이는 사람이나, 물체의 현재 위치 또 는 이동 가능한 미래의 위치로 나타낼 수 있다. 자율주행차가 특정 타겟지점을 주행목표로 설정하는 것은 특정 타겟지점으로부터의 유효거리 이내로 접근하거나 또는 이상으로 멀어지는 것 등으로 설정할 수 있다. 특정 타겟 지점의 유효한 거리는 km, m 등으로 표시되는 물리적인 거리이거나 도로나 접근경로 등으로 걸리는 데 필요한 지정된 일정시간 이내의 접근거리일 수 있다. 타겟지점은 주행유형에 따라 경유지점과 완료지점으로 불릴 수 있 다. 명세서 전반에서 \"주행상태정보\"는 자율주행장치의 주행속도, 노면에서의 진동, 자세정보, 가속 및 감속, 방향 변경, 실제 연료량, 주행시작, 주행종료, 현재위치 등의 자율주행장치의 실제 관련 정보와 레이싱게임에서 가상 으로 표시되는 장애물, 장애물과의 충돌, 장애물에 따른 가상의 요철 효과나 진동 등의 가상의 정보가 더 추가 된다. 명세서 전체에서 자율주행장치는 사람이 운전하지 않는 자율운행장치만을 뜻하지는 않는다. 특정 주행장치에 배 정된 사람이 직접 운전하더라도 게임의 참가자가 직접 운전에 관여하지 않는 형태로서 운전자와 주행장치가 결 합된 형태로서 자율주행장치로 간주한다. 본 명세서 전반에서 '사용자단말'은 게임서버와 네트워크 통신수단으로 데이터를 송수신하며, 참가자의 사용자 미션에 대한 미션수행정보를 입력받아 게임서버로 전송한다. 사용자단말은 레이싱게임과 관련된 정보를 출력하 는 기능를 갖춘다. 본 명세서 전반에서 '주행단말'은 게임서버에 네트워크 수단으로 데이터를 송수신하며 경로정보에 맞게 자율주 행장치가 운행하도록 하는 단말이다. 주행단말은 네트워크 수단으로 자율주행장치에 연결된 형태로 구성하거나 자율주행장치와 하나로 통합되도 록 구성할 수도 있다. 본 명세서 전반에서 '미션수행정보'는 사용자미션 또는 주행미션에 대해서 미션을 수행의 결과로 게임서버에 전 송되는 자료를 포함한 정보를 가르킨다. 심판이 있을 경우 심판이 입력한 결과값일 수 있으며, 퀴즈미션이나 투 표미션 또는 투표미션에서는 사용자가 선택한 답이 미션수행정보가 된다. 본 명세서 전반에서 '팀의 무엇', '주행단말의 무엇', '자율주행장치의 무엇' 등의 표현은 동일한 표현일 수 있 다. 레이싱게임에서의 팀과 주행단말과 자율주행장치는 하나씩 대등하게 연결되므로 '팀의 경로정보'라는 표현 은 팀과 연결된 '자율주행차의 경로정보'와 '주행단말의 경로정보'는 같은 의미로 쓰인다. '팀의 주행상태정 보'와 '자율주행장치의 주행상태정보', '주행단말의 주행상태정보'도 함께 연결된 팀과 자율주행장치와 주행단 말에 대하여 같은 의미로 쓰인다. 본 명세서 전반에서 '게임서버'는 자율주행장치의 레이싱게임을 운용하기 위한 게임운용모듈을 포함하고 있으며, 네트워크 방법으로 참가자 단말과 주행단말과 연결되어 있다. 게임운용모듈은 참가자의 사용자미션 수 행여부에 따라 자율주행장치의 경로정보를 조정하는 역할을 수행한다. 본 명세서 전반에서 '네트워크 통신수단'은 유무선의 네트워크 통신방법을 총칭한다. 유선 무선 구간에 혼재되 는 형태도 있을 수 있으며, 다양한 프로토콜을 사용할 수 있음은 물론이다. 인터넷, 5G통신, 4G LTE 통신, 블루 투스 등의 통신기법이나 이들의 조합된 형태를 일겉는다. 네트워크통신수단의 확장된 개념으로 주행단말이 음성 이나 음향으로 출력하고, 주행차량이 해당 음성이나 음향을 명령으로 입력받고 인식할 수 있는 형태의 구성도 포함된다고 볼 수 있다."}
{"patent_id": "10-2019-0088451", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래의 이 분야의 기술로는 자동차를 이용한 레이싱게임이 있다. 자동차 레이싱은 이미 세계적으로 널리 시행되 고 있다. 이러한 주행 경기는 주로 동일한 주행경로에서 차종 간의 성능이나 운전자의 운행기술을 견주는 형태 로 진행되며 완료지점을 먼저 통과하는 자동차가 승리하는 방식이다. 주어진 구간에서 자동차는 최대치의 속도를 내며 달리게 되어 일반 도로에서 경기를 진행하는 경우 사고의 위험 때문에 일반 자동차는 레이싱 구간에 진 입하지 못하도록 교통을 통제하는 것이 일반화되어 있다. 2017년에는 세계 최초의 레이싱 목적의 자율주행차인 로보카(Robocar)가 출시되어 일반자동차 경주에 출전하고 있다. 운전자의 직관에 의해 주행하는 일반자동차와 견줄 수 있는 레이싱 전용 자율주행차의 출현은 이분야 기 술발전을 더 촉진하고 있다. 최근에는 자율주행차들만 참여하는 레이싱게임이 개최되고 있다. 자율주행차 레이싱게임은 자율주행차가 동일한 경로정보에서 누가 빨리 주행을 완료하는지를 놓고 경주하는 형식으로 구성된다. 그러나 이러한 레이싱게임은 자율주행차의 자율주행성능을 견주기 위한 형태로 구성되어 있는 것이 일반적이다. 이러한 종래의 기술들은 운전기술이나 자동차의 성능을 비교하는 형태로 진행되어 있으며, 본 발명에서 이루려 고 하는 참가자가 미션수행을 통해 경쟁을 하고 그 결과로 자율주행장치의 경로정보를 조정하는 형태의 안전한 레이싱게임을 제공하기는 불가능하다."}
{"patent_id": "10-2019-0088451", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "자율주행차를 필두로 하는4차산업혁명의 촉발로 사람들이 많은 시간을 허비하는 운전이라는 노동에서 해방될 것으로 예측된다. 다른 분야에서도 인간의 노동시간은 크게 단축될 가능성이 커지고 있어 앞으로 더 많아진 여가 시간을 활용하는 것에 대한 고민이 대두되고 있다. 본 발명은 자율주행차, 자율주행드론 등의 자율주행장치를 활용하여 즐길 수 있는 안전한 레이싱게임을 제공하기 위해 고안되었다. 기존의 자동차 경주나 자율주행차 경주처럼 자동차의 주행성능이나 운전자의 운전실력을 기반으로 하는 레이싱 게임이 아니라, 참가자간의 집단지성이나 지성을 겨루는 경쟁을 기반으로 자율주행장치의 경로정보를 조정함으 로써 실제 자율주행장치는 교통법규를 준수하면서 안전하게 주행하도록 하는 레이싱게임을 제공하고자 한다. 레이싱게임을 위해 별도로 통제되지 않은 일반도로에서 일반 자동차들과 함께 주행하면서도 안전하게 수행할 수 있는 레이싱게임을 제공하고자 한다. 자율주행차의 경우 인공지능(AI)의 발전에 힘입어 도로의 상황과 신호체계를 인지하고 더욱 안전한 운행서비스 를 제공할 수 있게 되었다. 본 발명은 레이싱게임에 참여하는 참가자는 직접 자동차의 운전에 관여하지 않도록 함으로써 레이싱게임의 안정성을 높이고, 참가자의 활동을 매개로 자율주행차의 레이싱게임을 구현함으로써 안 전한 레이싱게임을 제공하고자 한다. 자율주행차를 활용한 게이미피케이션을 구성하기 위한 기술적 과제를 해결함으로서 많은 사람이 미래에 여가를 즐길 수 있도록 하고, 이 과정을 포함하는 수익사업을 실현하도록 하는 것이 본 발명이 해결하고자 하는 과제이 다."}
{"patent_id": "10-2019-0088451", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "위의 과제를 해결하기 위해서 본 발명은 자율주행장치를 활용한 레이싱게임을 제공함에 있어서, 레이싱게임에 참여하는 특정 자율주행장치의 경로정보를 출력하는 단계; 참가자 또는 팀이 수행해야 하는 사용자미션에 대한 미션수행정보를 입력받는 단계; 상기 미션수행정보를 참고하여 상기 경로정보를 조정하는 단계; 상기 조정된 경 로정보를 자율주행장치의 주행에 적용하는 단계; 및 상기 참가자 또는 팀의 주행결과를 판정하는 단계;를 포함 하는 것을 특징으로 하는 자율주행장치 레이싱게임 제공방법을 제시한다. 또한 본 발명은 다수의 참가자가 온라인을 통해 사용자미션을 수행하는 사용자단말, 사용자단말로부터 미션수행 정보를 전송받고 미션수행정보를 참고하여 자율주행장치의 경로정보를 조정하는 게임서버 및 게임서버로부터 조 정된 경로정보를 전송받아 자율주행장치의 주행에 반영하도록 하는 주행단말로 구성된 자율주행장치 기반의 레 이싱게임 제공방법 및 시스템을 제안한다. 추가적으로 자율주행장치의 주행상태정보와 경로정보를 수신받아 4D효과를 출력하는 모형장치를 더 포함하는 자 율주행장치 기반의 레이싱게임 제공방법 및 시스템을 제안한다.과제를 해결하기 위해서 본 발명은 사용자들이 여러 단계에 걸쳐 동시에 참여하는 퀴즈, 설문, 투표 등에 참여 하거나 온라인 광고를 시청하는 형태의 사용자미션을 수행하는 단계와; 다수 참가자의 집단지성으로 경로정보를 조정하는 단계를 추가적으로 제시한다. 게임 참가자가 퀴즈, 설문, 투표 등에 참여하고 이를 채점하거나 사용자 들의 답변이나 선택을 분석한 결과를 참고하는 방식으로 자율주행장치의 경로정보를 조정하는 단계를 포함한 형 태를 추가적으로 제안한다. 복수의 참가자를 대상으로 퀴즈 게임, 설문 또는 투표, 응원하기, 아이템 기능하기 등의 사용자미션을 수행하는 단계와 자율주행단말에 주행미션을 제공하는 단계와 이들 미션들의 미션수행 여부를 판단하는 단계 등을 추가적 으로 제시한다. 위의 과제를 해결하기 위하여 참가자가 자율주행장치에 탑승하고, 사용자모듈 또는 사용자단말로 사용자미션을 수행하고, 게임서버 또는 게임모듈이 주행경로를 조정하고 주행모듈 또는 주행모듈이 상기 조정된 주행경로에 따라 자율주행장치가 운행하도록 하는 자율주행장치 기반의 레이싱게임 제공 방법 및 그 시스템을 제안한다."}
{"patent_id": "10-2019-0088451", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 다수의 참가자가 참여하는 자율주행장치를 활용한 레이싱게임 제공할 수 있다. 즉, 다수의 참가자가 동시에 참여하는 시가지에서의 자율주행장치의 레이싱게임을 제공할 수 있다. 또한 본 발명을 TV 및 인터넷의 방송 기술과 연계하면 다수의 시청자 또는 출연진이 참가자가 되어 휴대폰을 사 용자단말로 사용하며 레이싱게임에 참여하도록 하고, 실제 이에 대응하는 자율주행차가 특정 도시를 운행하는 형태의 예능게임쇼를 제작할 수 있다. 4차 산업혁명에서 가장 주목받는 분야로 자율주행차와 자율주행드론 등이 있다. 자율주행차는 자동차의 소비형 태를 크게 바꾸게 될 것으로 예상되는데 자동차의 승차 공유가 빈번해지고 자동차 제작사나 전기자동차를 제작 하려는 전자회사들이 각축을 벌일 것으로 예측되지만 자동차 전체 소비량은 감소할 것으로 보인다. 이에 따라 자율주행차 및 자율주행 드론을 이용한 엔터테인먼트 비즈니스는 자동차 제작사나 전기자동차 생산을 계획하는 많은 기업들로부터 협찬을 받거나 공통으로 사업을 추진하기 용이한 측면이 있다. 또한, 여가생활에 자율주행차나 자율주행드론 등의 자율주행장치 기반의 레이싱게임에 참여하게 함으로써 해당 자율주행장치의 기능 경쟁을 통해 기술발전을 촉진시킬 수 있으며, 자율주행차의 소비를 증진시킬 수 있다."}
{"patent_id": "10-2019-0088451", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다음과 같은 여러가지 실시 예와 같이 구성할 수 있다. 본 발명의 첫번째 실시 예는 자율주행장치가 네트워크 통신 수단으로 주행단말과 데이터를 송수신하며, 게임에 참여하는 참가자가 사용하는 사용자단말이 네트워크 통신 수단으로 게임서버와 데이터를 송수신하며, 경로정보 조정모듈을 포함하는 게임서버가 통신네트워크 상에 있는 경우이다. 본 실시예의 변형으로 자율주행장치와 주행 단말이 하나의 기계로 구성되는 것도 바람직하다. 이경우 자율주행장치를 주행단말로 간주한다. 자율주행장치와 주행단말이 분리되어 있을 경우 통신수단으로 연결되는 방식 이외로도 자율주행장치가 사람에 의해 입력되는 입력장치를 가지고 있거나 사람이 주행을 하는 경우에 사람에게 최신의 경로정보를 업데이트하여 출력하는 장치를 구비하도록 한다. 본 발명의 두번째 실시예로, 자율주행장치가 네트워크 통신 수단으로 사용자단말과 데이터를 송수신하며, 경로 정보조정모듈을 포함하는 게임서버가 사용자단말에 포함되어 구성하는 경우이다. 특정 장소에 설치된 사용자단말을 이용하여 특정 참가자가 레이싱게임에 도전하도록 하고, 상기 사용자단말 에 레이싱게임을 위해 연결된 자율주행차를 매칭하게 하여 레이싱게임을 제공한다. 이때 사용자단말은 별도의 서버를 경유하지 않고 주행단말과 네트워크 통신 수단으로 데이터를 송수 신하도록 한다. 사용자단말에는 경로정보에 관한 정보를 준비하도록 하고 사용자가 수행해야 하는 사용자 미션을 미리 준비하도록 한다. 상기 사용자단말은 동일한 하나의 자율주행장치를 이용해서 시간을 달리하여 참여하는 다수의 참가자가 주 어진 경로정보를 완주하는데 걸린 시간이나 주행중 주행미션으로 얻은 점수 등으로 순위를 결정하는 형태의 게 임을 제공할 수 있다. 또는 동시에 다수의 경쟁자가 참여하는 자율주행장치-사용자단말의 조합을 이용하여 레이 싱게임을 제공할 수도 있다. 게임서버는 다양한 형태의 레이싱게임 구성에 대한 시나리오와 이에 대응하는 사용자미션, 주행미션 등을 구비하도록 한다. 이를 위해 주행상태정보, 경로정보 등과 같은 주요 정보들을 수시로 주행단말, 참가자단말, 방송중계장치 및 모형장치 등과 송수신하도록 한다. 특정 자율주행장치는 최소 하나 이상의 사용자단말에 대응하도록 하고, 특정 사용자단말은 최소 하나 이상의 자 율주행장치에 대응하도록 한다. 하나 또는 복수의 자율주행차가 특정 레이싱게임에 참여하게 하다. 레이싱게임의 또 다른 실시예로서 단일 자율주행차를 특정 참가자가 사용자단말을 이용하여 지정된 경로정 보를 지정된 시간 안에 완주하도록 하고 성공/실패로 게임을 결과를 결정할 수 있다. 레이싱게임의 또 다른 실시예로서 특정 도망팀을 추적하는 특정 참가팀이 사용자미션 수행을 통해 도망팀을 검 거하는 추격전 형태의 레이싱게임을 들 수 있다. 도망팀에 근접했는지, 얼마 거리 이하로 거리를 좁혔는지, 도 망팀의 차량을 카메라로 포착했는지의 여부 등으로 성공/실패를 판정하게 한다. 또는 상대적으로 걸린 시간이나 최종 거리의 차이 등을 고려한 순위를 결정하는 방식으로도 판정하도록 한다. 또 다른 레이싱게임의 구성 방식으로 단일 자율주행차를 특정 참가자가 사용자단말을 이용하여 지정된 경 로정보를 제한 시간에 통과하도록 하고 다수의 참가자가 순서대로 진행한 후 주행에 걸린 시간, 자율주행장치의 주행미션이나 참가자의 사용자미션으로 획득한 점수 등을 비교하여 순위를 정하거나 승패를 결정 짓도록 하는 것도 바람직하다. 이경우 이동해야 하는거리나 제한시간도 경로정보에 포함시켜야 한다. 또 다른 레이싱게임의 구성 방식으로 동일 차종의 자율주행차를 복수를 투입하고 동시에 여러 참가자들이 경쟁 적으로 동일 주행코스에서 경쟁하는 형식을 들 수 있다. 또 다른 레이싱게임의 구성 방식으로 서로 다른 차종의 자율주행차를 복수를 투입하고 동시에 여러 참가자들이 경쟁적으로 동일 주행코스에서 경쟁하는 형식을 들 수 있다. 또 다른 레이싱게임의 구성 방식으로 복수의 자율주행차를 복수를 투입하고 동시에 여러 참가자들이 경쟁적으로 서로다른 주행코스에서 경쟁하는 형식을 들 수 있다. 도1을 들어 본 발명의 구성을 설명하고자 한다. 도 1은 2주행단말이 각각 설치된 2기의 자율주행장치가 인터넷을 경유하는 네트워크 수단으로 개인참가자 1, 유저팀1 및 유저팀2가 레이싱게임에 동시에 참여하는 경우에서의 발명의 구성을 설명하고 있다. 인터넷 통신 수단으로 게임서버가 별도로 구성되어 있다. 도 1에서의 사용자단말은 스마트폰이나 태블릿PC, PC 등에 사용자 어플리케이션을 구동시키는 형태로 구성 하거나 단말용 전문 HW에 소프트웨어를 구동시키는 형태로 구성하는 것이 가능하다. 스마트폰이나 태블릿PC, PC 등에 사용자 어플리케이션을 탑재하기 위해서는 구동 가능한 응용 어플리케이션를 제작하고 인터넷을 통해 다운 로드 받아 설치한 후 사용할 수 있도록 하여 공급하도록 한다. 상기 응용어플리케이션은 사용자단말의 기능을 수행할 수 있도록 게임서버로부터 데이터를 수신하거나 게임서버 로 데이터를 전송하는 기능, 참가자의 미션수행정보을 입력받는 기능, 사용자에게 미션수행결과나 미션정보를 표시하거나 게임서버로부터 전송받은 영상이나 이미지 정보를 디스플레이할 수 있는 디스플레이 기능을 갖추는 것이 바람직하다. 상기 게임서버의 기능은 웹서버 역할로 구성하고, 사용자단말이나 주행단말 중 일부를 웹브라우저의 실행 으로 구현되도록 구성할 수 있다. 상기 게임서버로부터 전송 받는 영상에 제한된 규격은 없다. 360VR 영상이거나 실시간 스트리밍 영상 자료 를 지원하도록 구성한다. 도 1에서 게임서버는 PC, 태블릿PC, 스마트폰 등의 컴퓨팅 단말에 응용어플리케이션을 설치하여 구성하는 형태 로 구성하고, 게임서버 기능을 수행하도록 응용어플리케이션을 개발하여 설치함으로서 게임서버를 구성할 수 있 게 한다. 게임서버는 각 참가자의 사용자단말과 네트워크 통신수단으로 데이터를 송수신 할 수 있도록 한다. 게임서버은 특정 타겟지점에 대한 도착, 통과, 출발, 정지, 완주 여부 등을 판단하기 위해 다음의 네가지 방법 가운데 하나 이상을 조합하여 적절한 기능을 구비한다. 첫째, 특정 위치(도로, 다리, 건물 또는 특정 현장 등)에 측정 가능한 센서 및 카메라 등을 구비한 별도의 장치 를 구비하여 체크하고 결과를 게임서버에 전송하는 방식으로 구성한다. 둘째, 특정 타겟지점마다 심판이 확인판정하여 주행단말 또는 사용자단말 또는 또다른 단말을 이용하여 판정결 과를 전송하고 게임서버가 이를 수신하는 방식으로 구성한다. 셋째, 특정 위치에서 주행단말로부터 특정 위치를 식별할 수 있는 정보가 포함된 주행상태정보를 수신 받아 판 단하는 방법이다. 넷째, 위치가 시간에 따라 움직이는 사물의 위치이고 그 위치에 근접했는지의 여부로 판단한다. 이 때는 움직이 는 사물의 위치를 GPS 또는 주소 등의 정보를 수집하고, 자율주행단말의 현재 위치를 파악하여 도착이나 접근이 유효한지 판단하는 방법이다. 게임서버은 특정위치의 영역에 있거나, 특정 위치에 유효한 범주 안에 다다른게 확인되면 통과하거나 접근 한 것으로 처리하도록 한다. 유효한 범주는 물리적인 위치이거나 특정 유효시간에 도착할 수 있는 위치이거나 영상자료로 특정 타겟을 식별가능한 위치가운데 하나일 수 있다. 게임서버은 레이싱게임을 위해 게임서버에 접속한 각 팀의 참가자들을 대상으로 레이싱게임을 시작하 고 특정 팀이 완주했거나 중간에 참가자나 팀이 게임의 포기 또는 종료 의사, 시간 초과 및 자격상실 등으로 특 정 팀의 레이싱게임을 종료하게 한다. 게임서버는 360VR 영상이나 HD 영상을 사용자단말 혹은 주행단말에 전송하도록 한다. 이 때 영 상은 참가자의 자율주행장치로부터 전송받은 영상일 수 있으며, 상기 주행단말 또는 방송중계장치로부터 전송받 은 영상을 포함하는 영상이 된다. 도 1에서 자율주행장치에 부착된 주행단말은 게임서버와 네트워크 통신 수단으로 데이터를 송수신 받을 수 있게 구성한다. 주행단말은 HW적으로는 자율주행장치와 통합적으로 구성하는 방식도 가능하고, 별도로 구성하는 것도 가능하다. 또는 주행단말과 자율주행장치가 별도로 존재하되 주행단말의 기능을 자율주행장치와 보완적으 로 구성하는 것도 필요하다. 주행단말에는 디스플레이 표시와 입력장치가 구비하도록 하고, 주행단말의 기능을 수행할 수 있는 응용 어 플리케이션을 제작하여 설치하고 실행함으로서 주행단말의 기능을 수행하게 한다. 주행단말은 전용으로 준비된 HW장치와 SW로 작동되도록 하는 것도 가능하다. 주행단말은 추가적으로 자율주행장치의 충돌, 가속, 쏠림이 자율주행차 외부의 소리 및 조명 등과 연계된 주행상태정보를 기반으로한 4D효과를 낼 수 있는 구동모듈을 더 포함하도록 한다. 주행단말은 게임서버으로부터 가상의 4D효과와 관련된 주행상태정보를 수신하면 구동모듈을 작동하여 자율주행장치에 탑승한 사람들이 그 효과를 느끼도록 구성한다. 주행단말에는 GPS센서, 자유로센서, 카메라(360VR카메라 포함) 등의 기능을 추가하거나 자율주행차의 관련 센서 기능을 통해 운행환경과 관련 정보를 수집하여 주행상태정보에 포함하여 관리하고 게임서버 및 사용자단말 등과 공유하도록 한다. 주행단말이 자율주행차와 통합적으로 구성되기 어렵고, 네트워크 수단으로 연결이 불가능할 경우를 위해 주행단말에는 경로정보를 출력할 수 있는 수단을 구비하는 것이 좋다. 즉, 주행단말은 변경된 경로정 보를 사람이 인식하여 자율주행장치의 주행에 반영할 수 있도록 출력장치를 통해 출력한다. 주행단말에는 특정 타겟지점을 접근했는지 확인하는 수단을 구비하고 관련정보를 주행상태정보에 포함하여 관리한다. 주행단말은 자율주행차의 기기들을 활용하여 공유하는 방법을 사용하거나 스스로 전자태그 인식, GPS 및 학습에 의해 상징적인 건물이나 간판 등의 특정 사물을 인식할수 있는 AI기술을 응용하도록 한다. 주행단말은 자율주행장치의 주변환경, 즉 노면에 따른 진동이나 상승, 하강, 위치 또는 고도, 자세 및 방 향, 주변영상, 주변 소리 등을 측정하거나 입력받을 수 있는 있는 모듈을 더 포함하고 이로부터 주행상태정보를 획득하여 게임서버에 전송하도록 한다. 상기 주행상태정보에는 출발 및 정지, 이동속도, 현재 위치, 구간단위 경로정보를 주행한 결과정보를 더 포함한 다. 필요에 따라서 주행단말은 상기 주행상태정보를 사용자단말 또는 모형장치에 전송하도록 한다. 주행상태정보는 게임서버을 경유해서 사용자단말 및 모형장치에 전송하게 구성하거나 직접 전송 하게 구성해도 된다. 게임서버는 주행상태정보에 실제 주행단말에서 측정되거나 입력받은 것 이외로도 레이싱게임에서 벌칙과 관련된 가상의 주행상태정보를 더 포함하고 관련정보를 주행단말, 모형장치 또는 사용자단말과 송수신하여 공유하는 단계를 더 구성한다. 게임서버이 특정 주행단말에 벌칙이 적용하는 것은 특정 주행미션이나 사용자미션 실패에 따라 주거나, 경 장 참가자나 경쟁팀의 공격권 사용에 의해 수행되도록 한다. 상기 벌칙은 두단계의 이전 주행을 취소하여 자율주행장치가 다시 주행하게 하는 것이거나, 시간을 지체하거나, 연료를 차감하거나 하는 등의 방식으로 특정 자율주행장치의 주행에 불이익이 되는 방향으로 수행되도록 한다. 게임서버는 경로정보에 벌칙정보를 추가적으로 포함하도록 구성한다. 게임서버에서 벌칙정보는 벌칙을 통과해야하는 사용자미션 또는 주행미션이 포함된다. 벌칙으로는 특정 경 로정보에 길을 막는 바위 등의 장애물, 갑자기 길을 건너는 사람이나 동물 또는 갑자기 앞을 막는 대형의 저속 차량 같은 교통방해요소 등을 추가하는 방식으로 구성 될 수 있다. 상기 장애물에 대한 사용자미션으로 특정 행동을 반복하거나, 하트표시를 보내거나 해서 장애물을 제거하거나 회피권을 사용하여 장애물을 치우는 등의 사용자미션을 연결할 수 있다. 게임서버에 벌칙으로 폭탄이나 미사일 등의 공격으로 주행중 도로를 파괴하는 등의 방법을 구비하도록 한 다. 여기에서 나열한 것은 가상의 것으로 증강현실의 화면으로 출력되거나 4D효과를 출력되도록 한다. 게임서버는 경로정보에 공격권정보 및 회피권정보 더 포함할 수 있다. 공격권은 특정 팀이나 참가자가 경 쟁자 또는 경쟁자의 경로정보에 따른 주행을 방해할 요소를 포함한다. 공격권이나 회피권은 참가자들이 게임서 버에서 가상화폐나 포인트 등을 주고 구매 또는 교환하거나 또는 사용자미션이나 주행미션을 통해 획득할 수 있 도록 구성한다. 사용자는 자율주행장치의 주행 방해물을 제거하기 위해 혹은 제거하는 아이템을 구매하기 위해서 포인트 및 화 폐 등을 사용할 수 있는 단계를 더 구비한다. 상기 공격권 또는 회피권을 사용할 수 있도록 사용자단말에 필요한 적절한 입력장치와 입력절차를 구비한다. 상 기 공격권은 상기 벌칙을 특정 경쟁자에게 행사할 수 있도록 구비하는 것도 바람직하다. 상기 회피권은 상기 벌 칙이나 특정 주행미션을 생략하는 형태로 사용할 수 있도록 구성한다. 상기 가상의 주행상태정보는 실제 경로정보 상에는 없으나 가상으로 준비된 장애물, 바닥요철, 비내림, 동물 등 이나 이와 관련된 사건이나 현상을 표시하기 위해 포함한다. 사용자단말이나 방송중계장치에서는 실 제 화면에 가상의 장애물 등을 표시하는 증강현실(AR)등으로 출력하도록 한다. 모형장치는 상기 가상의 주행상태정보를 포함하는 특정 자율주행차의 주행상태정보와 관련된 진동효과, 좌 우쏠림, 전복, 충돌, 찌그러짐 등의 공간변형, 주변소음, 명암, 충격 등의 4D효과를 출력하도록 한다. 주행단말은 추가적으로 영상카메라 및 마이크 모듈을 더 포함하며, 필요한 경우 자율주행장치의 내부 또는 외부에서 음향데이터, 영상 및 동영상 등을 획득하여 게임서버, 사용자단말 또는 모형장치로 전송하도록 한다. 게임서버는 영상스트리밍 기능을 담당하는 별도의 서버를 추가적으로 구성하여 다수의 서버가 게임서버 역 할을 기능단위로 나누어 수행하도록 구성하는 것도 바람직하다. 하나의 응용어플리케이션을 스마트 단말에 설치하여 주행단말 또는 사용자단말로 사용하게 하는 것 도 가능하다. 본 발명에서는 주행단말과 사용자단말이 반드시 따로 분리된 형태로 제공될 필요는 없 으며, 본발명에서 해결하고자 하는 과제에서 지정된 역할을 수행할 때 주행단말 또는 사용자단말로 구분하는 의미로도 사용될 수 있다. 레이싱게임의 참가자는 게임서버로부터 도착한 퀴즈나 설문 등의 사용자미션을 전달받아 수행하여야 한다. 게임서버는 퀴즈게임이나 설문 등을 통해 자율주행장치를 특정 팀이나 특정 참가자에게 매칭시키거나 참여 기회를 박탈하도록 구성한다. 상기 게임서버는 특정 참가자가 주관식, 객관식, OX 등의 퀴즈정보를 사용자단말에 전송하고, 사용자단말 은 퀴즈정보를 전달받아 참가자가 퀴즈를 풀수 있는 입력수단을 제공하게 한다. 참가자가 답을 입력하면 사용자 단말은 입력된 답변을 포함하는 미션수행정보를 게임서버에 보낸다. 게임서버는 사용자단말로부터 전송 받은 미션수행정보를 참고하여 특정 경로정보를 조정하는 단계를 포함하도록 한다. 미션수행정보가 특정 퀴즈의 답변일 경우 상기 답변이 정답인지 확인하여 미션 수행여부를 판 단하고 경로정보를 유리하거나 불리하게 조정하도록 한다. 상기 게임서버가 미션수행여부를 판단하는 것은 특정 심판이 입력한 정보는 그대로 판단내용을 사용하도록 구성하는 것도 필요하다. 미션수행정보를 참고하는 다른 방법으로는 다수의 미션수행정보를 기반으로 많은 선택 을 받았거나 하는 것을 택하는 방식등으로 집단지성을 적용하는 것도 가능하다. 미션수행정보를 기반으로 한 집단지성을 활용하는 방법으로는 투표미션으로 많은 것 혹은 둘째 많은 것 등으로 지정하는 방식이나, 특정 사물과 연관된 제시어를 입력하도록 하고 많은 참가자가 입력한 특정제시어에 연결된 사항으로 결정하는 것이다. \"백제하면 떠오르는 도시를 입력하세요\"라는 사용자미션에 \"부여\"가 가장 많이 나오 면 목표지점으로 부여를 추가하거나, 이미 존재하는 목표지점에서 부여를 빼는 방식으로 처리할 수 있다. 게임서버는 다양한 방법으로 특정 주행단말의 경로정보를 조정할 수 있다. 최고 주행 속도를 지정하는 방 식, 주행만료시간을 연장하거나 소요 시간을 줄여주는 방식, 일정시간 주행을 정지하는 방식 특정 벌칙을 주거 나 공격권 주는 방식 등과 같은 방법을 통해 경로정보를 조정하도록 한다. 게임서버은 참가자의 집단지성을 활용하기 위해 투표미션을 수행하고 특정 운행지점에서 미리 지정된 방향 으로 운행하도록 하는 방식, 특정 목적지를 경유하도록 추가하거나 취소하는 방식, 다수의 경로정보 중 하나를 선택하여 운행하도록 하는 방식 등으로 상기 경로정보를 조정하도록 한다. 특정 운행 지점은 주행하는 가운데 거치게 되는 갈림길일 수 있으며 유턴하는 지점일 수 있으며, 미리 지정된 방향으로 운행하는 것은 2개 이상 갈래의 주행 경로 중 하나를 선택하는 것으로서 자율주행차에서는 좌회전 또 는 우회전으로 교차로를 통과하거나 유턴하여 되돌아가는 방법 가운데 하나일 수 있다. 게임서버은 벌칙이나 공격권의 활용 또는 돌발적인 상황으로써 가상의 사물 또는 장애물을 투입하거나 가 상의 사물과의 충돌이나 운전방해와 같은 사건 등을 조성하는 방식 등으로 상기 주행정보를 조정하게 한다. 투표미션 수행에서는 게임서버는 투표문항을 사용자단말에 전송하고 사용자단말은 상기 투표문 항을 전송받아 출력하고 사용자가 투표값을 입력받고 미션수행정보로서 게임서버에 전송한다. 게임서버는 상기 투표값을 전송받아 평균을 내거나 최고 값을 채택하는 등의 방법을 적용한 미션수행정보 의 판단과정을 거쳐 경로정보를 조정하도록 구성한다. 투표미션은 특정참가자, 특정팀 또는 다수의 팀에 소속된 참가자에게 받을 수 있도록 구성한다. 사용자미션에는 퀴즈 및 투표만으로 제한되지 않는다. 공간상에서 일정한 궤적의 모양을 그리는 것이 미션인 경 우 사용자단말이 공간의 궤적 움직임을 입력 받거나 측정할 수 있는 것이라면 일정한 오차범위에서 미션을 수행 한 것으로 판단하는 모션미션을 추가 구성한다. 사용자미션으로는 특정 위치에서의 사진을 찍는 방식, 특정 사물의 사진을 찍거나 특정인과 함께 사진을 찍는 등의 사진미션이나 증강현실(AR)로 특정위치나 사물에서 보여지는 스마트폰 기능을 이용해서 특정 AR 아이템을캡쳐하거나 클릭하는 방식 등의 행동미션 등을 추가적으로 구성한다. 사용자미션은 특정 노래의 일부를 부르는 방식을 적용할 수 있다. 마이크를 이용해 사람의 음성을 입력받아 게 임서버나 사용자 단말에서 판단하는 기능을 구비하도록 한다. 판정을 수행하는 사람이 판정결과를 입력하게 하 는 방식도 가능하다. 사진미션 수행을 위해서 참가자단말에 AR대응 이미지 표시 기능을 탑재하거나 사진이나 영상을 찍을 때 사 물 자동인식이나 위치정보를 추가로 확보하여 데이터화하는 기능을 추가하도록 한다. 모션미션에 대응하여 사용자단말에 좌표나 움직임을 측정할 수 있는 센서로 좌표 트래킹하는 기능 등을 더 포함할 수 있다. 추가적인 사용자미션을 위해 카메라,3D 카메라, 모션캡쳐 등의 장비를 구성하는 것도 필요하다. 게임서버은 일부 참가자가 실제 자율주행장치에 탑승할 경우, 자율주행차에 탑승한 참가자에게 별도의 사 용자미션을 수행하도록 한다. 이 경우 상기 참가자는 별도로 분리된 사용자단말을 사용하게 하거나 주행단 말과 함께 결합된 사용자단말의 기능을 사용하도록 구성한다. 주행단말과 사용자단말과 자율주행장치가 함께 결합되는 형태의 구성도 가능하다. 이런 경우 단일 혹 은 복수의 참가자는 자율주행장치에 탑승하여 사용자미션을 수행하며 레이싱게임을 즐기도록 제공한다. 사용자미션에 웃는 얼굴 사진이나, 특정 동물이나 식물과 함께 사진을 찍어 보내는 사진미션을 구성할 수 있다. 이경우 게임서버이나 사용자단말에 사람의 웃는 얼굴을 판단하는 이미지 분석 기능이 추가적으로 구 성되어야 한다. 사용자미션으로 일정한 음성 크기로 소리를 지르거나, 일부 구간의 노래를 부르거나 혹은 일부 구간의 음악을 연주하는 등의 행동미션을 추가한다. 이러한 미션을 게임에 적용하기 위해서는 음향이나 음성을 인식하여 판단 하는 기술 등을 추가적으로 구축하여야 한다. 게임서버는 미션 수행 사용자 터미널에서 판단하거나 그 결과만 게임서버로 전달하는 방법을 구성한다. 게임서버가 미션수행정보를 처리하는 다른 방법으로 터미널은 미션수행 과정에서 확보한 데이터를 게임서 버로 보내고 게임서버가 미션 수행 성공 여부를 판단하는 방법을 적용하는 것이 바람직하지만, 사용자단말(20 0)이 미션수행결과를 판정하거나 심판으로부터 입력받은 미션수행결과를 게임서버에 전달하고 게임서버 은 그 결과를 그대로 사용하도록 할 수도 있다. 상기 판단하는 과정에서는 사용자미션중에 웃는 사진 찍기에서 웃는 사람의 숫자로서 판단하거나, 누가 더 활짝 웃었는지, 누가 더 큰소리로 소리를 냈는지 등과 같이 측정된 값을 차등하여 결과를 판단할 수 있다. 게임서버은 개별 팀 및 개별 참가자별로 주행미션, 사용자미션, 주행 등과 관련된 점수를 누적하고 관리하 도록 한다. 게임서버는 상기 사용자미션 수행결과를 집계하고 분석하는 단계를 추가적으로 더 수행한다. 사용자미션이 투표일 때는 투표결과를 분석하여 많은 선택을 받았거나 지정하는 특정 순위의 선택을 받은 것을 결과로 채용하 게 할 수 있다. 사용자미션을 제일 먼저 완수한 참가자의 팀을 구분하는 등의 작업단계이다. 또는 퀴즈미션에서 어느팀이 더 많은 비율로 맞췄는지 또는 어느팀이 퀴즈미션의 획득점수가 많은지 등도 분석하도록 구성할 수 있 다. 게임서버에는 사용자미션 수행결과를 반영하는 단계를 더 포함한다. 이 단계는 게임서버가 참가자별, 팀별로 포인트나 공격권 및 회피권을 별도로 관리할 수 있는 수단을 구비하고 사용자미션 수행과 관련하여 특정 참가자나 팀에게 경품 및 현금 등의 이익을 제공하거나 그 결과를 공표하는 것 등이 될 수 있다. 게임서버는 특정 사용자미션이나 주행미션의 수행결과를 경로정보 조정에 반영하는 단계를 더 포함하도록 한다. 특정 퀴즈미션을 실패하면 특정 자율주행장치의 최고주행속도를 낮추도록 하거나 성공했을 때 복구해주는 방법도 적용 가능하다. 또는 경로정보의 연료정보를 높이거나 낮추는 방식으로 조정하는 것도 좋다. 게임서버는 사용자단말으로부터 가상의 화폐나 아이템 등으로 연료를 구매하도록 구비하고 연료를 구 매하면 특정 자율주행단말의 경로정보에 포함된 연료정보를 조정하게 한다. 게임서버는 특정 구간의 경로정보를 완수하지 못한 팀에게 벌칙을 적용할 수 있게 한다. 특정 구간의 경로 정보에 지정된 시간을 초과하면 초과되는 시간에 따라 연료가 감소하거나 새로운 경로를 추가하거나 장애물을추가하는 방식이 될 수 있다. 도 1에서 팀1과 팀2가 각각 자율주행장치1과 자율주행장치2와 연결하여 동시에 운행되는 레이싱게임에 대한 구 성을 사례로 본 발명을 구성할 수 있다. 여기에서 자율주행장치1과 자율주행장치2는 서로 다른 자동차 제조회사 에에서 제작한 다른 기종의 자율주행차이다. 사용자팀1은 user2, user3, user4 등 3명의 참가자가 있고 사용자팀2는 user5, user6 등 두명의 참가자가 포함 되어 있다. 게임서버는 서로다른 기종의 자율주행차를 2대를 각 팀에 배정하기 위하여 간단한 퀴즈미션을 제공한다. 퀴즈미션은 주관식이며 동시에 5명의 참가자의 사용자단말에 제시된다. 5명의 참가자는 각자 답이라고 생각되는 답을 입력하고, 사용자단말은 해당 답변을 게임서버로 전송한다. 게임서버는 최초로 정답을 답한 참가자의 팀에게 두개의 자율주행차 기종 가운데 먼저 선택할 수 있는 권한을 주도록 한다. User3가 정답을 맞췄다고 가정할 때 게임서버는 팀1에 소속된 전원에게 두 대의 자율주행장치 가운데 하나 를 선택할 수 있는 투표미션을 제시한다. 제한된 시간에 투표를 마감하고 게임서버는 많은 선택을 받은 차 종을 팀1에 배정하고 나머지 차종을 팀2에 배정한다. 게임서버는 이러한 미션수행방식을 통해 2개 이상의 경로정보에서 2개의 경로정보를 각 팀에 배정하도록 할 수 있다. 게임서버는 다수의 경로정보를 준비하고 보유하도록 한다. 경로정보는 하나 이상의 타겟지점을 주행목표에 포함하여 정할 수 있다. 타겟지점이 복수일 때 순서를 정할 수도 있으며 정하지 않을 수도 있다. 타겟지점이 하 나일 경우 이는 완료지점이다. 타겟지점이 복수이고 순서가 정해져 있다면 마지막 타겟지점은 완료지점이 되고 나머지 타겟지점은 경유지점이 된다. 게임서버는 복수의 타겟지점을 주행목표에 포함하고, 주행목표에는 이중 일부를 모두 주행하도록 하는 형 태로도 주행목표를 설정할 수 있다. 이 때 타겟지점의 순서가 정해져 있지 않다면 사용자미션을 통해 주행해야 할 타겟지점을 선택하거나 순서를 정하도록 한다. 게임서버은 경로정보에 주행거리, 제한시간, 주행미션 수행목표, 사용자미션 수행목표 등의 일부를 포함하 는 형태로 설정된 주행목표를 포함하도록 준비하도록 한다. 게임서버는 초기 연료정보 및 제한속도, 사용자미션, 주행주행미션, 지도정보 등에 관한 미션정보를 필요 에 따라 구성하여 경로정보에 포함하여 준비하도록 한다. 게임서버는 경로정보를 각각의 자율주행차에 배정하고, 자율주행차는 각각의 경로정보에 따라 주행을 시작 한다. 게임서버는 각 팀에 공격권 및 회피권을 지정할 수 있도록 한다. 공격권과 회피권은 사용자미션 또는 주행 미션을 통과할 때 선물로 얻도록 설계하는 것이 바람직하다. 레이싱게임에서 공격권은 각 팀은 상대팀에게 일정시간 운행을 중지하거나, 주행하는 동안 가상의 장애물을 만 나게 하거나 또는 특정 타겟지점 등을 추가하는 방식으로 상기 상대팀의 경로정보를 조정하여 상대팀의 주행을 방해한다. 레이싱게임에서 회피권은 일부 구간의 경로정보의 주행을 건너뛰게 하거나, 특정 장애물을 무효화하는 형태로 제공하게 한다. 공격권과 회피권은 팀1의 구성원 전부 또는 일부가 사용할 수 있도록 팀 소속의 사용자단말에 관련정보를 전송 하고, 사용자단말은 상기 공격권 사용할 수 있도록 공격 대상을 선택하거나 사용을 허가하는 출력 및 입력 기능을 구비한다. 게임서버는 팀마다 특정참가자를 팀의 리더로 지정하고 공격권과 회피권 또는 사용자미션이나 주행미션을 수행하는 대상이 되도록 구성하여야 한다. 특정 참가자가 팀의 리더로 결정되는 단계에서 투표 미션을 수행할 수도 있으며, 게임방송제작시 출연진 중 일부가 담당하도록 하는 것이 바람직하다. 공격권이나 회피권을 다수의 집단지성으로 결정하도록 게임서버는 추가적인 사용자미션으로 투표미션을 제 공할 수 있도록 한다. 투표결과를 기반으로 공격권과 회피권에 따른 내용을 반영한다. 사용자가 상대팀에게 공격권을 사용할 경우 사용자단말은 공격권 사용정보를 입력받아 게임서버에 전 송한다. 특정 팀의 사용자단말로부터 공격권 사용정보를 전송 받으면 해당 공격권의 사용이 가능한지 확인한 후 이를 승인하여 상대 팀의 경로정보를 조정하고 관련 정보를 주행단말에 전송한다. 주행단말은 상기 조정된 경로 정보를 전송 받아 자율주행차의 주행에 적용한다. 주행단말이 상기 경로정보를 상기 자율주행차의 주행에 적용하기 위하여 자율주행차와 주행단말을 일체화 시켜 하나로 구성하는 제 1방법, 자율주행차에 네트워크 통신수단으로 연결하고 조정된 경로정보를 송수신하여 자율주행차가 경로정보에 반영하는 제 2방법, 자율주행차의 운행에 관련한 사람이나 자율주행차가 인식할 수 있 는 영상이나 음향자료 등의 형태로 상기 조정된 경로정보를 출력하는 제 3방법 가운데 적어도 하나 이상의 방법 으로 구성한다. 주행단말과 자율주행차가 하나의 시스템으로 존재하는 경우 자율주행차의 경로정보를 저장하고 있는 메모 리나 저장장치의 정보를 대체하거나 변경하도록 한다. 상기 게임서버는 특정 주행단말에 처음부터 끝까지의 경로정보를 제공하도록 구성할 수 있다. 또 다 른 방법으로 게임서버는 전체 경로정보를 몇 개의 구간단위로 나눠 순차적으로 완주해야 할 구간의 경로정 보를 주행단말에 전송하는 방식으로 제공할 수 있도록 한다. 게임서버의 완주를 판단하는 것은 상기 주행단말이 지정된 경로정보의 주행목표를 일부 또는 전부를 달성 했을 때 완주한 것으로 판정하는 것이 일반적이다. 최종적인 타겟지점에 도착한 것으로 완주를 한것으로 판정하 도록 할 수 있다. 이경우에는 완주하는 동안 수행한 주행미션이나 사용자미션 등의 수행결과를 점수로 환산할 수 있도록 한다. 게임서버이 완주를 판단하는 방식에서 상기 주행단말이 일정거리 이상을 주행하거나 목표치로 설정된 점수나 참가자 미션 또는 주행미션 등을 완수하는 것으로도 완주한 것으로 판단하도록 게임을 구성할 수도 있다. 상기 주행단말이 상기 주행을 완주여부 판단하는 것은 각 게임의 구성방식에 맞도록 판정하도록 게임서버 을 구성하도록 한다. 게임서버이 여러 구간으로 구성된 경로정보 정보를 단계적으로 주행단말에 전송하는 방식으로 구성하 는 경우, 특정 자율주행차에 시간지체 벌칙을 가할 때, 특정 구간의 경로정보를 완주한 이후에 지체할 시간만큼 늦게 주행단말에게 다음 구간의 경로정보를 제공하는 방식으로 구성하는 것도 가능하다. 게임서버는 미션정보를 더 추가하여 특정 주행단말의 경로정보를 구성한다. 자동주행장치 혹은 주행단말이 수행해야할 미션정보는 특정 위치를 경유해서 도착하는 방식, 지정된 목표물의 사진을 찍어오도록 하는 방식, 특정 물건을 받아오게 하는 방식 등과 같이 현장에서 할 수 있는 것들을 포함한다. 게임서버은 특정 주행단말의 주행미션수행을 완료해서 성공 및 실패 또는 수행점수 등으로 환산하는 주행 미션 판단기능을 추가적으로 구비한다. 사진을 찍어오는 미션등에서는 사진을 자동으로 인지하고 판단하는 기능 을 포함한다. 또는 심판이 판정하도록 하고 심판이 입력한 정보를 주행단말을 통해 받아들여 이를 특정주행미션 수행결과 판단에 활용하게 한다. 게임서버는 상기 경로정보에 가상으로 설정되는 연료정보와 최고주행속도에 대한 정보를 더 추가한다. 여 기서 연료정보란 실제 자율주행차의 연료에 대한 정보가 아니다. 상기 연료정보는 자율주행차가 운행의 중단 및 재개, 또는 최고주행속도를 얼마로 할지에 대해서 결정할 수 있 도록 한다. 지정된 경로정보로 계속 주행할 때 연료를 차감하도록 한다. 실제 레이싱게임에서 연료정보는 포인 트나 다른 형식으로 표시할 수도 있다. 자율주행차는 상기 경로정보의 최고주행속도와 실제 주행하고 있는 도로의 법적인 최고주행속도 가운데 낮은 속 도로 주행하도록 한다. 연료가 일정량 이상일 때는 자율주행차의 최대운행속도를 양호하게 지정하고, 연료가 일정량 이하일 경우 최대 운행속도를 낮추도록 조정하게 한다. 게임서버는 게임에 참여하는 사람들이 연료량이 부족한 상황을 방지하도록 하는 참가자 미션을 사용자단말 에 전송한다. 사용자단말을 이용하여 참가자가 지정된 미션을 수행과 관련된 입력을 하면 사용자단말(20 0)은 해당 정보를 게임서버으로 전송하고 게임서버는 지정된 량의 연료를 보충하게 한다.게임서버가 연료보충을 위해 참가자가 참여하도록 제시하는 미션에는 퀴즈풀이, 광고보기, 특정 데이터 입 력하기, 미션사진찍기 등이 될 수 있다. 조건이 만족하는지의 여부에 따라서 연료를 보충하지 않거나 보충하는 연료량을 조절할 수 있도록 한다. 게임서버는 연료는 량을 단위로 하는 숫자로 표시되는 것이 바람직하지만 포인트, 하트나 별 등의 아이템 개수로도 표시할 수 있다. 연료, 포인트, 아이템 등을 복수의 방법으로 운영하는 것도 바람직하다. 게임서버는 레이싱게임에 참여중인 자율주행장치의 주행상태정보와 경로정보의 일부 또는 전부를 사용자단 말에 전송한다. 사용자단말은 상기 주행상태정보와 경로정보를 전송받아 출력하도록 한다. 게임서버는 게임진행과 관련된 영상자료를 사용자단말로 전송하도록 한다. 사용자단말은 상기 영상자료를 게임서버으로부터 수신하여 참가자가 볼 수 있도록 디스플레이에 표출 한다. 상기 영상자료에 가상현실의 장애물과 관련된 정보가 있을 경우 사용자단말의 디스플레이에 장애물 이 보이도록 표시하고 장애물을 없애기 위한 사용자들의 미션 수행과 관련된 정보를 입력받아 게임서버에 전송한다. 상기 장애물이 바위라고 할 때, 사람들은 바위를 끌어내거나 화면 터치 등으로 바위를 깨는 망치질을 하는 형태 로 표시하는 방식을 사용할 수 있다. 상기 장애물이 고양이라고 할 때 참가자가 고양이 사진을 찍어서 전송하고, 게임서버는 다수의 참가자로부 터 고양이 사진을 전송받은 후 고양이 장애물이 없어지는 것으로 할 수 있다. 상기 장애물과 제거하기 위해 참가자는 일정의 전자화폐나 포인트 등을 지불하는 방식으로 대가를 지불하는 방 식도 추가적으로 구성하게 한다. 장애물이 제거되지 않을 경우 레이싱게임에 참여하는 참가자나 참가팀은 벌칙을 받게 된다. 벌칙은 참가자격의 박탈, 게임의 종료, 일정 시간의 정지, 상기 자율주행차가 사람이 운전하는 일반자동차이거나 사람이 자율주행차에게 입력하는 경우라면 경우 사람이 인지할 수 있는 방법으로 상기 조정된 경로정보를 출력해준다. 특정 팀의 자율주행차가 상대 팀으로부터 주행 공격을 받는 경우 상대의 공격권을 사용과 관련된 정보를 상기 특정 팀의 팀원들의 사용자단말에 공지하는 것이 바람직하다. 만일 자율주행차가 3대 이상이고 상대팀이 2개 이상일 경우를 대비해서 사용자단말에는 공격할 상대팀을 선택하는 기능을 더 포함해야 한다. 게임서버는 사용자단말에 상대팀의 공격권에 사용되는 아이템을 확보할 수 있도록 미션정보를 제공한 다. 사용자가 미션을 완수하면 게임서버는 해당 팀이나 해당 참가자에게 공격권을 부여하고 공격권정보를 사용자단말에 전송한다. 사용자단말은 상기 공격권정보를 전송받고 사용자가 사용할 수 있도록 출력하고 공격권을 사용할 수 있도 록 입력도구를 구비한다. 사용자가 공격권을 사용하는 정보를 입력하면 사용자단말은 공격권을 적용할 대 상 자율주행장치의 정보와 공격권과 관련한 정보를 게임서버에 전송한다. 게임서버는 최종적으로 자율주행장치 기반의 레이싱게임의 결과를 판정하는 단계를 구성한다. 게임서버 가 레이싱게임의 결과를 판정하는 것은 다수의 자율주행차의 주행결과를 바탕으로 순위를 결정하는 방식, 경쟁 참가자와의 승리 및 패배로 결정하는 방식, 주행결과의 성공 또는 실패를 결정하는 등의 방식 가운데 하나 일 수 있다. 게임서버는 특정 주행단말의 주행결과를 판정하는 기능을 구비한다. 상기 주행결과의 판정은 구간단위마다 판정하도록 할 수 있으며 여러 단위의 구간 및 모든 주행구간을 완료한 형태에서 판정하도록 한다. 게임서버의 주행결과판정은 특정 타겟지점의 주행목표를 달성했는지, 주행미션을 성공했는지의 여부나 점수로 환산하는 형 태로 구성한다. 게임서버에서 특정 참가자에 매칭된 자율주행장치의 주행미션의 수행결과를 주행결과 판정에 반영하도록 한다. 즉 주행미션을 잘 수행했거나 짧은 시간으로 주행을 완료한 결과 등을 반영하여 주행결과를 판정한다. 게임서버은 최종적인 주행결과판정으로 특정 참가자가 우승했거나, 성공했거나, 특정 점수를 획득했거나, 특정 상품 수령에 선정되었거나, 특정 순위를 차지했거나 등으로 게임결과를 판정하도록 한다. 게임서버는 주행미션을 통과한 점수나 완주에 소요된 시간, 경로정보에 대한 완주의 정도, 일부 또는 전체 구간의 주행목표를 달성한 정도를 수치화하거나 성공 실패의 결과로 판정하는 등의 방식으로 주행결과를 게임결 과 판정에 반영하도록 한다. 게임서버는 특정 참가자 혹은 팀별로 사용자미션 수행결과를 따로 반영하여 점수 등을 관리하도록 하는 것 이 바람직하다. 또한 참가 팀별로의 사용자미션 수행결과를 반영하여 점수등을 관리하도록 한다. 아울러 레이 싱게임의 결과를 판정하는데 특정 사용자 또는 팀의 사용자미션 수행결과를 반영하도록 한다. 게임서버는 게임결과를 판정하고 순위나 결과정보를 자율주행장치 또는 자율주행장치에 매칭되는 참가팀이 나 참가자의 순위 및 성공 여부를 공표하는 방식 등으로 게임결과를 발표한다. 해당 게임결과의 정보는 인터넷 에 게재하거나 사용자단말로 전송함으로서 발표한다. 게임서버는 팀을 구성하는 다수의 참가자들의 판단을 모아 집단지성을 활용한 특정 주행단말의 경로정보를 조정하는 단계를 더 추가한다. 여기에서 집단지성은 여러 참가자들의 의견을 실시간적으로 분석하여 레이싱게임 에 반영하는 것으로 가장 간단한 방법으로는 투표미션을 통해 경쟁자를 선택하고 사용할 공격권을 선택하도록 하는 것 등이다. 또는 자신의 자율주행장치의 여러주행조건 중에 하나를 선택하도록 지원하는 것도 좋은 방법이 다. 게임서버의 집단지성을 활용한 경로정보를 조정하는 또다른 방법은 퀴즈미션을 활용하는 것이다. 특정 글 자나 철자가 포함된 서로다른 단어를 제시하도록 하고 먼저 성공시킨 팀에게 공격권을 주거나 가상의 연료를 보 충해주는 방식이다. 참가자는 사용자미션을 수행하면서 자신의 자율주행장치에 유리한 주행경가 적용되도록 노력한다. 사용자미션의 수행은 특정 퀴즈 문제의 정답을 맞혀야 하는 것일 수도 있으며, 특정 동작을 수행하거나, 소리 등을 흉내 내는 것일 수 있다. 참가자의 사용자미션수행은 사용자단말에 특정 입력장치를 이용한 입력하는 방식일 수도 있다. 사용자단말을 상하나 좌우로 흔드는 방식, 참가자 단말의 디스플레이에 표시된 특정 아이콘을 클릭하는 방식 등 을 이용하는 입력방식 등을 구성하도록 한다. 도2는 사용자단말의 모식도를 보여주고 있다. 도2의 모식도는 스마트폰을 활용한 사용자단말이며, 화면에는 디 스플레이와 입력기능이 함께 작동하는 터치패드가 있다. 별도로 마이크와 카메라 등의 필요한 입력 기능을 구성 하며 GPS 기능과 네트워크 기능을 더 포함하도록 한다. 일반적으로 스마트폰을 사용하면 이러한 기능이 준비되 어 있다. 사용자단말은 방송중계장치 및 운행단말 또는 게임서버로부터 전송받은 실시간 스트리밍 영역을 표시하는 라이브 쇼 구간이 있다. 그리고 사용자미션을 나타내는 구간과 사용자미션의 미션수행결과를 입력하는 구간이 있는 것을 확인할 수 있다. 사용자단말은 레이싱게임에 참여하고 있는 특정 자율주행차에 연결된 주행단말의 경로정보 및 주행상태정 보 등을 참가자가 인지할 수 있도록 디스플레이에 표출하도록 한다. 스마트폰의 진동 기능을 이용하여 주행상태 정보가운데 충돌이나 요철에 의한 진동 등을 표시하도록 한다. 도3은 또 다른 본 발명의 실시 예를 표시하고 있는데 게임스튜디오와 게임지역을 더 포함하고 있다. 게임스튜디오에는 각 자율주행차에 대응하는 모형장치과 방송중계장치을 더 포함하도록 한다. 모형장치와 방송중계장치은 각각 네트워크 통신 수단으로 게임서버, 주행단말 또는 사용자 단말과 연결되며 데이터를 송수신할 수 있도록 한다. 모형장치은 사람이 탑승하도록 제작한다. 모형장치는 진동, 방향전환, 가속, 감속 및 충격, 충돌, 소리 및 고도변화 등의 4D효과를 표출할 수 있는 구동장치을 더 포함하도록 한다. 모형장치은 자율주행장치의 주행상태정보를 게임서버나 주행단말에서 전송 받고 그에 따른 4D효 과를 구동장치을 통해 나타낸다. 자율주행장치는 실제 주행상태에 따라서 방향전환, 상승 및 하강, 자세변 환, 충격, 총돌 등의 주행상태정보를 출력 하도록 한다. 레이싱게임에서 사용자미션은 특정 사용자가 미션을 수행했는지를 판단하는 심판의 판정으로 미션수행 여부를 판단하게 할 수도 있다. 이런 경우 사용자단말에 심판이 미션수행여부를 포함하는 정보를 입력하고 게임서버에 전송하게 하고, 게임서버는 해당 정보를 수신받아 미션수행여부를 적용하게 한다. 게임서버가 사용자미션에 관한 심판을 활용하는데 있어서 특정 사용자단말에 심판이 인증단계를 통과해서 답변을 입력하게 하거나 심판이 사용하는 별도의 사용자단말을 구성하는 것이 바람직하다. 게임스튜디오에는 참가자가 게임에 참여할 수 있도록 사용자단말을 위치시킬 수 있으며 이 경우에도 사용 자단말은 네트워크 통신수단으로 서버와 연결하도록 한다. 영상중계장치에는 디스플레이 모듈과 스피커 모듈을 포함하여 스튜디오 내부의 사람들에게 영상과 음향을 출력한다. 영상중계장치는 주행단말이 촬영한 영상정보나 게임서버로부터 전달받은 영상정보를 출력한다. 영상중계장치은 카메라 모듈과 마이크 모듈을 더 포함할 수 있다. 카메라 모듈과 마이크 모듈은 스튜디오에서 레이싱게임에 참여하는 출연자들을 포함하는 방송영상을 촬영하고 획득한 영상이나 음향을 가공한 후 네트워크 수단으로 게임서버이나 사용자단말으로 전송하여 시청자 들이 레이싱게임에 관한 방송을 시청할 수 있도록 한다. 방송중계장치은 게임스튜디오에서 촬영된 영상이나 각종 레이싱게임과 관련된 정보를 포함하는 영상을 공 중파, 케이블 및 인터넷 TV 등으로 송출하도록 한다. 인터넷TV로 송출할 경우 게임서버는 별도의 스트리밍 서버를 추가로 구성하는 것이 바람직하다. 게임서버은 사용자미션이나 주행미션 등의 미션수행정보에 관련된 정보를 상기 방송중계장치에 전송 한다. 방송중계장치은 상기 미션수행정보에 관련된 데이터를 그래프나 테이블 등으로 영상화하고, 추가적 으로 구성된 영상자료를 사용자단말이 수신할 수 있도록 전송한다. 방송중계장치는 스튜디오에서 획득한 영상, 주행단말이 전송한 영상, 경로정보, 상태정보 또는 게임서버의 순위정보 등을 활용하여 게임진행에 관련한 영상을 생성하여 스트리밍하도록 한다. 게임서버을 경유하거나 혹은 직접 전송하는 방식으로 사용자단말에 게임진행에 관련한 영상을 전송하도록 한다. 사용자단말은 직접 네트워크를 통한 인터넷TV의 스트리밍 영상을 전송받아 표출하여 참가자들이 시청할 수 있도록 구성한다. 이때 사용자단말은 별도의 기능으로 분리된 추가 장치를 이용하여 TV방송 시청을 할 수 있도 록 할 수도 있다. 게임방송을 진행중이고 게임서버 대신 방송중계장치이 사용자단말로 전송하도록 구성하도록 할 수 있다. 방송중계장치을 사용할 경우 사용자단말은 하나의 기기로 구성하는 것도 가능하나 TV등의 장치와 별도로 사용할 수 있는 참가전용 사용자단말로 구분하여 구성하는 것도 가능하다. 이 때 방송중계장치를 게임서버로 간주한다. 레이싱게임은 스튜디오 안에 있는 출연자들만 참가할 수 있도록 구성할 수도 있으며, 스튜디오안에 있는 사람과 방송을 시청하는 사람이 팀을 구성하여 참가하도록 구성하는 것도 가능하다. 사용자단말은 주행상태정보 또는 경로정보를 수신받아 참가자들의 이해를 위해 정보의 일부를 출력하도록 한다. 도 3으로 불특정 다수의 시청자가 참여하는 형태의 게임방송을 위한 또 다른 실시예를 설명하고자 한다. 게임스튜디오에는 출연진, 진행자, 레이싱게임에 참가하는 방청객 등이 위치하고 있다. 레이싱게임 참가를 위해 사용자단말을 사용하는 사람들은 방청객이나 출연진이 된다. 각 가정에서는 레이싱게임에 참가하고자 하는 시청자들이 자신의 스마트폰이나 태블릿 등의 사용자단말장치에 사용자단말의 기능을 수행하는 어플리케이션을 설치하여 참여하도록 한다. 게임스튜디오의 출연진은 인기 연예인이고, 시청자들은 이들의 팬일 수 있다. 게임스튜디오에 출연진이 2개의 팀으로 구성되고 시청자들도 자신이 선호하는 팀을 선택하여 게임에 참여하도록 한다. 게임서버는 특정 팀에 벌칙이나 주행미션의 일종으로 집단지성을 활용하여 경로정보의 일부를 결정하는 것 을 선택하도록 구성한다. 즉 특정팀 소속의 모든 사용자단말에 다음에 나타날 교차로에서 특정 목표지점이 나 좌회전, 우회전 중 고르도록 여러 복수의 참가자가 투표하는 투표미션을 제시하고 그 결과로 경로정보나 방 향을 결정하도록 한다. 사용자단말을 사용하여 사용자들은 투표미션에 투표를 실시하고 게임서버는 투표결과를 분석하여 많 은 사람이 선택한 결과대로 특정팀의 경로정보를 조정한다. 상기 특정팀은 특정 참가자의 팀일 수 있으며 또는경쟁자의 팀일 수도 있다. 게임서버는 사용자에게 활동에 관련한 점수를 추가적으로 부여하고 계산하도록 한다. 즉, 사용자미션에 참 여했거나 특정 퀴즈의 답변을 잘 맞혔거나 하는 부분에서 개인참가자마다 점수를 누적하고 최종적으로 점수가 높은 개인참가자를 대상으로 보상을 한다. 게임서버가 개인참가자로 보상하는 것은 순위발표, 우승자발표, 온라인상품권이나 기념품 지급공지, 상금 지급공지, 상금지급, 선물지급 등의 방법가운데 선택적으로 구성한다. 게임서버는 시청자들이 자발적으로 자신이 소속된 팀의 승리에 기여할 수 있도록 다양한 형태의 게임을 사 용자미션으로 구성하여 제작하는 것이 바람직하다. 여기에는 퀴즈를 풀어야하는 퀴즈미션, 투표를 해야하는 투 표미션, 사진미션 이나 행동미션 등을 적용할 수 있다. 게임서버는 독립적인 인터넷 공간에 설치되는 것이 바람직하나, 본 발명의 실시를 위해서는 사용자단말에 포함되어 구성되거나 주행단말에 포함되어 구성되는 것도 가능하다. 상기 게임서버, 사용자단말, 주행단말, 모형장치 등은 별도로 구별된 단일 기기와 기능을 수행하는 SW 등으로 독립적으로 구성하고 네트워크 통신수단으로 각종정보를 송수신하도록 하는 것이 바람직하다. 한편 기능 단위로 분리된 2개 이상의 장치가 네트워크 통신 수단으로 연결되어 하나의 기능을 수행하도록 수성하는 것도 가능하다. 게임서버는 세부적인 기능에 따라 여러 개의 기기로 분리하여 구성되도록 할 수도 있다. 본 발명에서 게임서버, 사용자단말, 주행단말, 모형장치, 자율주행장치 등 필요에 따라서 두개 이상의 기능이 통합된 하나의 장치에 운영하도록 구성하는 것도 가능하다. 하나의 장치에서 각각의 기능을 수행할 때 게임서버, 사용자단말, 주행단말, 모형장치인 는 독립된 장치가 아닌 하나의 기능모듈이나 작동 부분으로 인식되어야 한다. 본 발명에서 상기 게임서버, 사용자단말, 주행단말, 모형 장치 등의 물리적인 구성 방식은 중요하지 않다. 본 발명에서 게임서버, 사용자단말, 주행단말, 모형장치, 자율주행장치 또는 방송중계장치 가운데 두개 이상의 기능단위가 하나의 시스템에 통합하여 구성되는 경우, 두 기능단위 사이에 자료를 전송하거나 전송받는 것은 네 트워크 통신수단 또는 메모리나 저장공간 등을 공유하거나, 프로세서간 통신을 통해 관련 자료를 전달하거나 전 달받는 형태로 구현된다. 도 4를 들어 본 발명의 또다른 실시예를 설명하고자 한다. 도4는 본 발명의 게임서버, 사용자단말, 운행단말의 모든 기능이 기본요소로서 구성된 레이싱자율주행차의 모식도가 그려져 있다. 여기에서 게임서버, 사용자단말, 운행단말 등은 그 기능을 수행하는 모듈이나 기능부로 구성되게 된다. 상기 레이싱자율주행차는 독립적으로 게임을 수행하도록 되어 있으며, 실제 동일 차량에 동시에 탑승한 사람들 을 팀의 구성원으로 하고, 동시 또는 이전에 이 게임에 참여했던 팀과의 기록경쟁을 이루도록 주행게임을 제공 하도록 구현한다. 상기 레이싱자율주행차에서 게임서버는 하나의 기능모듈로 레이싱자율주행차에 구성하도록 하는 것도 가능 하고, 별도의 게임서버로 분리해서 네트워크통신수단으로 레이싱자율주행차과 자료를 송수신하며 작동하도 록 구성하는 것도 바람직하다. 도 4에서 주행모듈, 게임모듈, 사용자단말은 각각 주행단말, 게임서버, 사용자단 말과 같은 의미로 사용되며 같은 역할을 수행하도록 한다. 자율주행이 가능한 레이싱장치에 게임참여를 위한 탑 승자들이 탑승하여 레이싱게임이 시작하면 레이싱장치는 경로정보를 표시하고 탑승자들에게 사용자미션을 수행 하도록 한다. 사용자미션 수행에 따라 미션수행정보가 입력되면 레이싱장치는 경로정보를 조정하고 해당 경로정 보에 맞춰 운행하도록 한다. 주행을 완료하고, 주행결과 및 사용자미션, 주행미션 등의 결과로 게임결과를 판정 하도록 한다. 이러한 자율주행 레이싱장치는 유명 광광지에서 가족단위로 집단지성을 이용하여 관광을 즐기는 게임으로 제공 할 수 있다. 상기 레이싱자율주행차에 추가적으로 4D 모듈을 더 추가한다. 4D모듈은 자율주행장치 레이싱게임에서 증강현실로 표현되는 각종 4D효과를 출력한다. 충격, 전복, 진동, 흔들림 등의 4D효과를 출력한다.도 4에는 표시하지 않았지만 상기 자율주행장치에는 증강현실을 표현하기 위한 디스플레이 등의 출력 기능 이 더 포함하는 것이 바람직하다. 상기 레이싱자율주행차의 다른 형태로 게임서버와 상용자단말만 독립적인 기기로 구성하는 것도 바람직하 다. 사용자단말은 주행모듈을 포함한 형태로서 사용자단말이 주행단말역할을 한다. 여기에서 사용자단말은 사용 자 스마트폰이고, 게임서버는 인터넷상에 위치하여 사용자가 게임서버를 통해 주행게임과 관련된 정보를 전송받 아 탑승한 참가자 혹은 참가팀이 사용자미션을 수행하며 레이싱게임을 즐기도록 구현할 수 있다. 본 발명에서 '주행상태정보' 및 '경로정보' 등은 본 명세서에 적시된 관련 세부사항 정보들을 모두 필수적으로 구성해야 하는 것은 아니고 실제 서비스를 구성하는데 필요한 일부의 구성정보만을 포함하도록 조합한 형태로 구성한다. 또한 이들 정보를 출력하는 것은 포함된 모든 정보 또는 일부의 정보를 출력하도록 한다."}
{"patent_id": "10-2019-0088451", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 시스템 구성도이다. 도 2는 게임 참가자들이 사용하는 사용자단말의 모식도이다. 도 3은 레이싱게임을 진행하는 게임스튜디오를 포함한 모식도이다. 도 4는 레이싱게임을 단독으로 제공하는 레이싱장치의 모식도이다."}
