{"patent_id": "10-2023-7033818", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0162630", "출원번호": "10-2023-7033818", "발명의 명칭": "온도계 신뢰성 향상을 위한 시스템 및 방법", "출원인": "헬렌 오브 트로이 리미티드", "발명자": "존슨 케빈 엠."}}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "온도 측정 신뢰성을 증가시키기 위한 시스템으로서, 피험자의 현재 측정된 온도에 대하여 사용자로부터 문의를 수신하도록 구성되며, 상기 현재 측정된 온도는 온도계에 의해 측정되고, 상기 문의는 사용자가 현재 측정된 온도가 의심스럽다는 것을 나타내는 온도 모듈; 상기 문의와 현재 측정된 온도를 기반으로 쿼리(query)를 생성하고, 쿼리에 대한 답변으로 응답을 수신하며, 히스토리 데이터 분석에서 상기 현재 측정된 온도를 분석하도록 구성되는 분석 모듈; 그리고 상기 응답 및 분석에 기초하여 문의와 연관된 추천을 생성하도록 구성되는 추천 모듈을 포함하는, 온도 측정 신뢰성 증가 시스템."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 히스토리 데이터는 세션(session)을 정의하는 소정의 시간만큼 현재 측정된 온도에 선행하는피험자에 대한 이전에 측정된 온도를 포함하며, 상기 피험자에 대해 이전에 측정된 온도는 피험자에 대한 프로필과 연관되는, 온도 측정 신뢰성 증가 시스템."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항 또는 2항에 있어서, 상기 분석은 히스토리 데이터 및 현재 측정된 온도의 추세선(trend line) 분석인,온도 측정 신뢰성 증가 시스템."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서, 상기 분석은 히스토리 데이터에 대한 변동성 값을 결정하고; 그리고 상기 변동성 임계값을초과하는 변동성 값에 대한 응답으로 피험자의 프로필을 확인하기 위한 쿼리를 생성함을 포함하는, 온도 측정신뢰성 증가 시스템."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항 또는 4항에 있어서, 상기 프로필은 피험자와 연관된 위치 데이터, 또는 피험자에 대한 인구통계학적 정보, 또는 피험자 온도에 대한 히스토리 정보를 포함하는, 온도 측정 신뢰성 증가 시스템."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2 항 또는 4항에 있어서, 상기 쿼리는 상기 프로파일의 확인을 요청하는, 온도 측정 신뢰성 증가 시스템."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4 항에 있어서, 상기 프로파일은 제1 해부학적 영역과 연관된 히스토리 데이터(historical data)의 제1 세트및 제1 해부학적 영역과 다른 제2 해부학적 영역과 연관된 히스토리 데이터의 제2 세트를 포함하는, 온도 측정신뢰성 증가 시스템."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서, 상기 쿼리는 현재 측정된 온도가 제1 해부학적 영역 또는 제2 해부학적 영역에서 측정되었는가를 사용자가 명시할 것을 요청하는, 온도 측정 신뢰성 증가 시스템."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서, 상기 추천은 상기 온도계를 조작함을 포함하는, 온도 측정 신뢰성 증가 시스템."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2023-0162630-3-온도 측정 신뢰성을 증가시키는 방법으로서, 사용자로부터 현재 측정된 온도에 대한 문의를 수신하는 단계 - 상기 현재 측정된 온도는 온도계에 의해 측정되고, 상기 문의는 사용자가 현재 측정된 온도를 의심한다는 것을 나타냄 -; 상기 문의 및 현재 측정된 온도를 기반으로 쿼리를 생성하는 단계; 상기 쿼리에 대한 답변으로 응답을 수신하는 단계; 히스토리 데이터의 분석에서 상기 현재 측정된 온도를 분석하는 단계; 그리고 상기 응답 및 분석에 기초하여 상기 문의와 연관된 추천을 생성하는 단계를 포함하는, 온도 측정 신뢰성 증가방법."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서, 상기 히스토리 데이터는 세션(session)을 정의하는 소정의 시간만큼 현재 측정된 온도보다선행하는 사용자에 대한 이전에 측정된 온도를 포함하는, 온도 측정 신뢰성 증가 방법."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항 또는 11항에 있어서, 상기 분석은 히스토리 데이터 및 현재 측정된 온도의 추세선(trend line) 분석인,온도 측정 신뢰성 증가 방법."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 분석은 히스토리 데이터에 대한 변동성 값을 결정하고; 그리고 상기 변동성 임계값을초과하는 변동성 값에 대한 응답으로 피험자의 프로필을 확인하기 위한 쿼리를 생성함을 포함하는, 온도 측정신뢰성 증가 방법."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항 또는 13항에 있어서, 상기 프로필은 피험자와 연관된 위치 데이터, 또는 피험자에 대한 인구통계학적 정보, 또는 피험자 온도에 대한 히스토리 정보를 포함하는, 온도 측정 신뢰성 증가 방법."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항 또는 13항에 있어서, 상기 프로파일은 피험자와 연관된 생리학적 데이터를 포함하는, 온도 측정 신뢰성증가 방법."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서, 상기 쿼리가 해결되었다는 사용자로부터의 확인 응답을 수신하는 단계를 더욱 포함하는, 온도측정 신뢰성 증가 방법."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 쿼리가 다수의 질문을 갖는 질문 시리즈를 포함하고, 상기 다수의 질문의 질문 시퀀스가이전 상호작용에 대한 확인 응답에 기초하는, 온도 측정 신뢰성 증가 방법."}
{"patent_id": "10-2023-7033818", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "프로세서를 갖는 컴퓨터에 의해 실행될 때, 사용자로부터 현재 측정된 온도에 대한 문의를 수신하고 - 상기 현재 측정된 온도는 온도계에 의해 측정되며,상기 문의는 사용자가 현재 측정된 온도를 의심한다는 것을 나타냄 -; 상기 문의 및 현재 측정된 온도를 기반으로 쿼리를 생성하며; 상기 쿼리에 대한 답변으로 응답을 수신하고; 히스토리 데이터의 분석에서 현재 측정된 온도를 분석하며; 그리고 공개특허 10-2023-0162630-4-상기 응답 및 분석에 기초하여 상기 문의와 연관된 추천(ecommendation)을 생성함을 포함하는, 컴퓨터가 온도측정 신뢰성을 증가시키기 위한 방법을 수행하도록 하는 명령어를 저장하는 비일시적 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2023-7033818", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "온도 측정 신뢰성을 증가시키기 위한 시스템 및 방법이 제공된다. 한 실시 예에서, 시스템은 온도 모듈, 분석 모 듈 및 추천 모듈을 포함한다. 상기 온도 모듈은 현재 측정된 온도에 대하여 사용자로부터 문의를 수신하도록 구 성된다. 상기 현재 측정된 온도는 온도계로부터 수신된다. 상기 문의는 사용자가 현재 측정된 온도가 의심스럽다 는 것을 나타낸다. 상기 분석 모듈은 상기 문의와 현재 측정된 온도를 기반으로 쿼리(query)를 생성하도록 구성 된다. 상기 분석 모듈은 쿼리에 대한 답변으로 응답을 수신하도록 구성된다. 상기 분석 모듈은 히스토리 데이터 분석에서 상기 현재 측정된 온도를 분석하도록 구성된다. 추천 모듈은 상기 응답 및 분석에 기초하여 문의와 연 관된 추천을 생성하도록 구성된다."}
{"patent_id": "10-2023-7033818", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "수은 온도계는 수십 년 동안 체온을 측정하는 표준이었다."}
{"patent_id": "10-2023-7033818", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 수은 온도계는 한쪽 끝에 수은이 들어 있는 벌브(동그란 부분)가 있고 다른 쪽 끝이 닫혀 있는 속이 빈 유리 원통으로 형성되어있다. 사용자의 체온을 측정하기 위해 벌브(동그란 부분) 끝을 사용자의 혀 아래 등 사용자에게 삽입했다. 수은 온도계의 배치는 불편하고 어색할 뿐만 아니라, 수은은 인체에 유독하기 때문에 위 험할 수 있으며, 실린더 또는 막대가 부러지면 사용자가 실수로 수은을 섭취할 수 있다."}
{"patent_id": "10-2023-7033818", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "최근에는, 전자 온도계가 널리 이용 가능하게 되었다. 전자 온도계는 전자 온도계에 포함된 센서에 기초하여 무수히 많은 방식으로 체온을 측정할 수 있다. 예를 들어, 전자 온도계는 사용자의 혀 아래에 삽입할 수 있도 록 한쪽 끝에 온도 감지 팁이 있을 수 있다. 또는 전자 온도계를 사용자의 관자놀이에 대고 이마를 따라 스와 이프할 수도 있다. 전자 온도계는 사용자를 겨냥하여 사용자의 체온을 측정하도록 트리거되는 비접촉식 온도계 일 수도 있다. 전자 온도계가 체온을 측정하는 방식에 따라 전자 온도계의 위치, 환경 등 여러 요인이 판독값 에 영향을 미칠 수 있다. 따라서 사용자는 전자 온도계의 센서를 기반으로 체온이 올바르게 측정되었는지 또는 측정된 체온이 다른 요인에 의해 영향을 받았는지 확신하지 못할 수 있다. 따라서 사용자는 전자 온도계의 센 서가 일반적으로 수은 온도계보다 더 정확함에도 불구하고 전자 온도계의 측정된 체온을 불신하기 시작할 수 있 다."}
{"patent_id": "10-2023-7033818", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시 예에 따르면, 온도 측정 신뢰성을 증가시키기 위한 시스템이 제공된다. 이 시스템은 온도 모듈, 분석 모듈 및 추천 모듈을 포함한다. 온도 모듈은 현재 측정된 온도에 대하여 사용자로부터 문의를 수신하도록 구성 된다. 현재 측정된 온도는 온도계에서 수신된다. 상기 문의는 사용자가 현재 측정된 온도가 의심스럽다는 것 을 나타낸다. 분석 모듈은 상기 문의와 현재 측정된 온도를 기반으로 쿼리(query)를 생성하도록 구성된다. 분 석 모듈은 또한 쿼리에 대한 답변으로 응답을 수신하도록 구성된다. 분석 모듈은 히스토리 데이터 분석에서 현 재 측정된 온도를 분석하도록 추가로 구성된다. 추천 모듈은 응답 및 분석에 기초하여 문의와 관련된 추천을 생 성하도록 구성된다. 본 발명 시스템에서, 히스토리 데이터는 세션을 정의하는 소정의 시간만큼 현재 측정된 온도에 선행하는 사용자 에 대한 이전에 측정된 온도를 포함할 수 있다. 사용자에 대해 이전에 측정된 온도는 사용자에 대한 프로필과 연관될 수 있다. 분석에는 히스토리 데이터 및 현재 측정된 온도에 대한 추세선(trend line) 분석 수행이 포함 될 수 있다. 본 발명 시스템 분석은 히스토리 데이터에 대한 변동성 값을 결정하고 변동성 임계값을 초과하는 변동성 값에 대한 응답으로 사용자의 프로필을 확인하기 위한 쿼리를 생성하는 것을 포함할 수 있다. 프로필에 는 사용자와 관련된 위치 데이터 및/또는 사용자에 대한 인구통계학적 정보도 포함될 수 있다. 쿼리가 취하는 경로는 이러한 요인들 중 하나 이상의 영향을 받을 수 있으며, 사용자는 가능한 한 빨리 해상도 및 보다 정확한 온도를 달성할 수 있다. 본 발명 시스템의 일부 실시 예에서, 상기 쿼리는 프로파일의 확인을 요청할 수 있다. 추가적으로 또는 대안적 으로, 프로파일은 또한 제1 해부학적 영역과 연관된 히스토리 데이터(historical data)의 제1 세트 및 제1 해부 학적 영역과 다른 제2 해부학적 영역과 연관된 히스토리 데이터의 제2 세트를 포함할 수 있다. 상기 쿼리에서 사용자는 현재 측정된 온도가 제1 해부학적 영역에서 측정된 것인지 또는 제2 해부학적 영역에서 측정된 것인지 명시하게 할 수 있다. 시스템의 추천은 응답에 기반한 히스토리 데이터의 첫 번째 세트 또는 히스토리 데이터의 두 번째 세트에 기반할 수 있다. 온도계를 조작하는 것을 포함하는 추천이 있을 수 있다. 다른 실시 예에 따르면, 온도 측정 신뢰성을 증가시키는 방법이 제공된다. 이 방법은 사용자로부터 현재 측정 된 온도에 대한 문의를 수신하는 단계를 포함한다. 현재 측정된 온도는 온도계로부터 수신된다. 상기 문의는 사용자가 현재 측정된 온도를 의심한다는 것을 나타낸다. 이 방법은 문의 및 현재 측정된 온도를 기반으로 쿼 리를 생성하는 것을 포함한다. 이 방법은 쿼리에 대한 답변으로 응답을 수신하는 단계를 더 포함한다. 상기 방법은, 히스토리 데이터의 분석에서 현재 측정된 온도를 분석하는 것을 더 포함한다. 상기 방법은, 상기 응답 및 분석에 기초하여 상기 문의와 관련된 추천을 생성하는 것을 더 포함한다. 본 발명 방법의 히스토리 데이터는 \"세션\"을 정의하는 소정의 시간만큼 현재 측정된 온도보다 선행하는 사용자 에 대한 이전에 측정된 온도를 포함할 수 있다. 이전에 측정된 사용자에 대한 온도는 사용자의 프로필과 연관 될 수 있다. 본 발명 분석에서는 히스토리 데이터 및 현재 측정된 온도에 대한 추세선 분석 수행이 포함될 수 있다. 상기 분석에는 히스토리 데이터의 변동성 값을 결정하고, 변동성 임계값을 초과하는 변동성 값에 대한 응답으로 사용자의 프로필을 확인하기 위한 쿼리 생성이 포함될 수 있다. 상기 프로파일은 또한 사용자에 대한 위치 데이터 및/또는 인구통계학적 정보를 포함할 수 있다. 또 다른 실시 예에 따르면, 프로세서를 갖는 컴퓨터에 의해 실행될 때, 컴퓨터가 온도 측정 신뢰성을 증가시키 기 위한 방법을 수행하도록 하는 명령어를 저장하는 비일시적 컴퓨터 판독가능 저장 매체가 제공된다. 이 방법 은 사용자로부터 현재 측정된 온도에 대한 문의를 수신하는 것을 포함한다. 현재 측정된 온도는 온도계로부터 수신된다. 상기 문의는 사용자가 현재 측정된 온도를 의심한다는 것을 나타낸다. 이 방법은 문의 및 현재 측 정된 온도를 기반으로 쿼리를 생성하는 것을 포함한다. 이 방법은 쿼리에 대한 답변으로 응답을 수신하는 단계 를 더 포함한다. 상기 방법은, 히스토리 데이터의 분석에서 현재 측정된 온도를 분석하는 것을 더 포함한다. 이 방법은 응답 및 분석에 기초하여 문의와 관련된 권장 사항을 생성하는 단계를 더 포함한다."}
{"patent_id": "10-2023-7033818", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "사용자가 예상하지 못한 온도 판독값을 얻을 때, 사용자는 전자 온도계로부터 측정된 온도를 신뢰하지 않을 수 있다. 대신, 사용자는 사용자 자신이 오류를 범했는지 또는 예기치 않은 온도 판독값이 온도계가 부적절하게 작동하기 때문인지 궁금해 지게 된다. 또한 사용자는 온도계의 정확도에 영향을 미치는 외부 요인에 대해 우려 할 수도 있다. 사용자는 때로는 \"정상적인 측정\"을 오해할 수도 있다. 사용자에게 전자 온도계로부터 측정된 온도에 대한 확신을 주기 위해, 본원에 설명된 시스템 및 방법은 사용자 에게 잠재적인 기여 요인들의 복잡한 집합을 단순화한다. 일반적으로, 본원에 설명된 시스템 및 방법은, 온도 계 및/또는 사용자가 질문에 대한 응답으로 제공하는 응답과 관련된 히스토리 데이터에 비추어 측정된 온도를분석한다. 그런 다음 사용자에게 권장 사항의 형태로 지침을 제공할 수 있다. 추천은 히스토리 데이터와 사용 자 응답을 기반으로 하므로 사용자에게 관련성이 높고 우선순위가 지정된 개인화된 안내가 제공되므로 혼란과 불확실성을 줄여 사용자 경험을 개선할 수 있다. 정의(DEFINITIONS) 다음은 본 명세서에서 사용되는 선택된 용어의 정의를 포함한다. 이러한 정의는 용어의 범위에 속하고 구현에 사용될 수 있는 다양한 예들 및/또는 구성 요소의 형태를 포함한다. 예시들은 제한적인 의도가 아니다. 또한, 본 명세서에서 논의되는 구성요소들은 다른 구성요소들과 결합되거나, 생략되거나, 다른 아키텍처로 구성될 수 있다. 본 명세서에서 사용되는 \"버스\"는, 컴퓨터 내부 또는 컴퓨터들 사이에서 다른 컴퓨터 컴포넌트들에 동작 가능하 게 연결되는 상호 연결된 아키텍처를 지칭한다. 버스는 컴퓨터 컴포넌트들 사이에서 데이터를 전송할 수 있다. 버스는 메모리 버스, 메모리 프로세서, 주변 장치 버스, 외부 버스, 크로스바 스위치 및/또는 로컬 버스 등이 될 수 있다. 버스는 또한 미디어 지향 시스템 전송(MOST), 제어기 영역 네트워크(CAN), 로컬 인터커넥트 네트 워크(LIN) 등과 같은 프로토콜을 사용하여 장치 내부의 컴포넌트들과 상호 연결될 수 있다. 본 명세서에서 사용되는 \"컴포넌트\"는 컴퓨터 관련 엔티티(예컨대, 하드웨어, 펌웨어, 실행 명령어, 이들의 조 합)를 지칭한다.) 컴퓨터 구성 요소에는 예를 들어 프로세서에서 실행되는 프로세스, 프로세서, 객체, 실행 파 일, 실행 스레드 및 컴퓨터가 포함될 수 있다. 컴퓨터 구성 요소는 프로세스 및/또는 스레드 내에 존재할 수 있다. 컴퓨터 구성요소는 한 컴퓨터에 로컬라이즈될 수도 있고 여러 컴퓨터에 분산될 수도 있다. 본 명세서에서 사용되는 \"컴퓨터 통신\"은 둘 이상의 통신 디바이스(예를 들어, 컴퓨터, 개인 디지털 어시스턴트, 휴대 전화, 네트워크 디바이스, 차량, 연결된 온도계, 인프라 디바이스, 도로변 장비) 사이의 통신 을 의미하며, 예를 들어, 네트워크 전송, 데이터 전송, 파일 전송, 애플릿 전송, 이메일, 하이퍼텍스트 전송 프 로토콜(HTTP) 전송 등과 같은 것이 될 수 있다. 컴퓨터 통신은 모든 유형의 유선 또는 무선 시스템 및/또는 모 든 유형의 구성을 갖는 네트워크(예: 근거리 통신망(LAN), 개인 영역 네트워크(PAN), 무선 개인 영역 네트워크 (WPAN), 무선 네트워크(WAN), 광역 네트워크(WAN), 대도시 지역 네트워크(MAN), 가상 사설망(VPN), 셀룰러 네트 워크, 토큰 링 네트워크, 지점간 네트워크, 애드혹 네트워크, 모바일 애드혹 네트워크, 차량용 애드혹 네트워크 (VANET) 등을 포함) 에서 발생할 수 있다. 컴퓨터 통신은 임의의 유형의 유선, 무선, 또는 네트워크 통신 프로토콜을 활용할 수 있는데, 여기에는 이더넷 (예컨대, IEEE 802.3), 와이파이(예컨대, IEEE 802.11), 육상 모바일용 통신 액세스(CALM), 와이맥스, 블루투 스, 지그비, 초광대역(UWAB), 다중 입력 및 다중 출력(MIMO), 통신 및/또는 셀룰러 네트워크 통신(예를 들어, SMS, MMS, 3G, 4G, LTE, 5G, GSM, CDMA, WAVE, CAT-M, LoRa), 위성, 전용 단거리 통신(DSRC) 등을 포함하지만 이에 국한되지 않는다. 본 명세서에서 사용되는 \"통신 인터페이스\"는 입력을 수신하기 위한 입력 및/또는 출력 장치 및/또는 데이터를 출력하기 위한 장치를 포함할 수 있다. 입력 및/또는 출력은 상이한 기능, 컴포넌트 및 시스템을 제어하기 위 한 것일 수 있다. 구체적으로, \"입력 장치\"라는 용어는 키보드, 마이크, 포인팅 및 선택 장치, 카메라, 이미징 장치, 비디오 카드, 디스플레이, 푸시 버튼, 회전식 손잡이 등을 포함하되 이에 국한되지 않는다. '입력 장 치'라는 용어에는 소프트웨어 및 하드웨어 기반 컨트롤, 인터페이스, 터치 스크린, 터치 패드 또는 플러그 앤 플레이 장치와 같은 다양한 유형의 메커니즘에 의해 표시될 수 있는 사용자 인터페이스 내에서 이루어지는 그래 픽 입력 컨트롤이 추가로 포함된다. \"출력 디바이스\"는 디스플레이 디바이스 및 정보 및 기능을 출력하기 위한 기타 디바이스를 포함하지만, 이에 한정되지 않는다. 본 명세서에서 사용되는 \"컴퓨터 판독가능 매체\"는, 명령어 및/또는 데이터를 저장하는 비일시적 매체를 지칭한 다. 컴퓨터 판독가능 매체는 비휘발성 매체 및 휘발성 매체를 포함하되 이에 국한되지 않는 형태를 취할 수 있 다. 비휘발성 미디어에는 예를 들어 광 디스크, 자기 디스크 등이 포함될 수 있다. 휘발성 미디어에는 예를 들어 반도체 메모리, 동적 메모리 등이 포함될 수 있다. 컴퓨터 판독 가능한 매체의 일반적인 형태는 플로피 디스크, 플렉시블 디스크, 하드 디스크, 자기 테이프, 다른 자기 매체, ASIC, CD, 다른 광학 매체, RAM, ROM, 메모리 칩 또는 카드, 메모리 스틱 및 컴퓨터, 프로세서 또는 다른 전자 장치가 읽을 수 있는 다른 매체를 포함 할 수 있지만 이에 국한되지 않는다. 본 명세서에서 사용되는 \"데이터베이스\"는 테이블을 지칭하는 데 사용된다. 다른 실시 예들에서, \"데이터베이스\"는 테이블의 세트를 지칭하기 위해 사용될 수 있다. 다른 실시 예들에서, \"데이터베이스\"는 데이터 저장소 및 이러한 데이터 저장소에 액세스 및/또는 이들을 조작하기 위한 방법의 세트를 지칭할 수 있다. 일 실시 예에서, 데이터베이스는 예를 들어, 디스크, 데이터 저장소 및/또는 메모리에 저장될 수 있다. 데이터 베이스는 로컬 또는 원격으로 저장될 수 있고 네트워크를 통해 액세스될 수 있다. 본 명세서에서 사용되는 \"데이터 저장소\"는, 예를 들어, 자기 디스크 드라이브, 솔리드 스테이트 디스크 드라이 브, 플로피 디스크 드라이브, 테이프 드라이브, 집(Zip) 드라이브, 플래시 메모리 카드, 및/또는 메모리 스틱일 수 있다. 또한, 디스크는 CD-ROM(컴팩트 디스크 롬), CD 기록 가능 드라이브(CD-R 드라이브), CD 재기록 가능 드라이브(CD-RW 드라이브) 및/또는 디지털 비디오 롬 드라이브(DVD 롬)일 수 있다. 디스크에는 컴퓨팅 디바이 스의 리소스를 제어하거나 할당하는 운영 체제가 저장될 수 있다. 본 명세서에서 사용되는 \"디스플레이\"는, 종종 정보를 표시하는 LED 디스플레이 패널, LCD 디스플레이 패널, CRT 디스플레이, 터치 스크린 디스플레이 등을 포함할 수 있지만, 이에 한정되지 않는다. 디스플레이는 사용자 로부터 입력(예: 터치 입력, 키보드 입력, 기타 다양한 입력 장치로부터의 입력 등)을 수신할 수 있다. 디스플 레이는 예를 들어 원격 시스템과 같은 다양한 장치를 통해 액세스할 수 있다. 디스플레이는 또한 물리적으로 휴대용 장치 또는 이동성 장치 상에 위치할 수도 있다. 본 명세서에서 사용되는 \"논리 회로\"는 명령어, 기계에서 실행 중인 명령어, 및/또는 다른 논리 회로, 모듈, 방 법 및/또는 시스템으로부터 동작을 유발(예컨대, 실행)하기 위한 명령어를 저장하는 비일시적 컴퓨터 판독가능 매체, 하드웨어 및 펌웨어를 포함하나, 이에 한정되지는 않는다. 논리 회로는 알고리즘에 의해 제어되는 프로 세서, 개별 논리(예: ASIC), 아날로그 회로, 디지털 회로, 프로그래밍된 논리 장치, 명령어를 포함하는 메모리 장치 등을 포함하거나 그 일부일 수 있다. 로직은 하나 이상의 게이트, 게이트의 조합 또는 기타 회로 구성 요 소를 포함할 수 있다. 다수의 로직이 설명되는 경우, 다수의 로직을 하나의 물리적 로직에 통합하는 것이 가능 할 수 있다. 유사하게, 단일 로직이 기술되는 경우, 그 단일 로직을 복수의 물리적 로직들 사이에 분배하는 것 이 가능할 수 있다. 본 명세서에서 사용되는 \"메모리\"는 휘발성 메모리 및/또는 비휘발성 메모리를 포함할 수 있다. 비휘발성 메모 리는 예를 들어, ROM(읽기 전용 메모리), PROM(프로그램 가능 읽기 전용 메모리), EPROM(지울 수 있는 PROM), 및 EEPROM(전기적으로 지울 수 있는 PROM)을 포함할 수 있다. 휘발성 메모리에는 예를 들어 RAM(랜덤 액세스 메모리), 동기식 RAM(SRAM), 동적 RAM(DRAM), 동기식 DRAM(SDRAM), 이중 데이터 전송률 SDRAM(DDRSDRAM), 직접 RAM 버스 RAM(DRRAM)이 포함될 수 있다. 상기 메모리에는 컴퓨팅 디바이스의 자원을 제어하거나 할당하는 운영 체제를 저장할 수 있다. 본 명세서에서 사용되는 \"모듈\"은 비일시적 컴퓨터 판독가능 매체를 포함하나 이에 한정되지 않으며, 상기 비일 시적 컴퓨터 판독가능 매체는 명령어, 머신에서 실행되는 명령어, 하드웨어, 펌웨어, 머신에서 실행되는 소프트 웨어, 및/또는 이들의 조합을 저장하여 기능 또는 동작을 수행하거나 다른 모듈, 방법 및/또는 시스템으로부터 기능 또는 동작을 유발하게 한다. 한 모듈은 또한 로직, 소프트웨어 제어 마이크로프로세서, 개별 로직 회로, 아날로그 회로, 디지털 회로, 프로그래밍된 로직 디바이스, 실행 명령을 포함하는 메모리 디바이스, 로직 게이 트, 게이트의 조합 및/또는 기타 회로 구성 요소를 포함할 수도 있다. 복수의 모듈이 하나의 모듈로 결합될 수 있고, 단일 모듈이 복수의 모듈들 사이에 분산될 수 있다. \"작동 가능한 연결\", 또는 엔티티들이 \"작동 가능하게 연결\"되는 연결은 신호, 물리적 통신 및/또는 논리적 통 신이 송신 및/또는 수신될 수 있는 연결이다. 작동 가능한 연결은 무선 인터페이스, 펌웨어 인터페이스, 물리 적 인터페이스, 데이터 인터페이스, 및/또는 전기 인터페이스를 포함할 수 있다. 본 명세서에서 사용되는 \"휴대용 디바이스\"는 일반적으로 사용자 입력(예컨대, 터치, 키보드)이 가능한 디스플 레이 스크린 및 컴퓨팅을 위한 프로세서를 구비하는 컴퓨팅 디바이스이다. 휴대용 디바이스는 핸드헬드 디바이 스, 모바일 디바이스, 스마트폰, 노트북, 태블릿, 전자책 리더, 스마트 스피커 등을 포함하나 이에 국한되지 않 는다. 일부 실시 예에서, '휴대용 디바이스'는 컴퓨팅용 프로세서 및/또는 원격으로 데이터를 수신 및 전송하 기 위한 통신 인터페이스를 포함하는 원격 디바이스를 지칭할 수 있다. 본 명세서에서 사용되는 \"프로세서\"는 신호를 처리하고 일반적인 컴퓨팅 및 연산 기능을 수행한다. 프로세서에 의해 처리되는 신호는 수신, 전송 및/또는 감지될 수 있는 디지털 신호, 데이터 신호, 컴퓨터 명령어, 프로세서 명령어, 메시지, 비트, 비트 스트림을 포함할 수 있다. 일반적으로, 프로세서는 복수의 단일 및 멀티코어 프 로세서 및 코프로세서 및 기타 복수의 단일 및 멀티코어 프로세서 및 코프로세서 아키텍처를 포함하는 다양한 프로세서일 수 있다. 프로세서는 동작 및/또는 알고리즘을 실행하기 위한 논리 회로를 포함할 수 있다. 프로세서는 또한 명령어, 작업 또는 실행 파일을 수행하기 위한 임의의 수의 모듈을 포함할 수 있다. 본 명세서에서 사용되는 \"사용자\"는 인간(예컨대, 성인, 어린이, 유아 등)과 같은 생물학적 존재일 수 있다. 본 명세서에서 사용되는 \"웨어러블 컴퓨팅 디바이스\"는, 사용자에게 착용되거나 부착될 수 있는 회로를 갖는 컴 퓨팅 디바이스 컴포넌트(예컨대, 프로세서)를 포함할 수 있지만, 이에 한정되지는 않는다. 즉, 웨어러블 컴퓨 팅 디바이스는 사용자의 개인 공간에 포함되는 컴퓨터이다. 웨어러블 컴퓨팅 디바이스는 디스플레이를 포함할 수 있으며 사용자의 다양한 매개변수를 감지하고 판단하기 위한 다양한 센서를 포함할 수 있다. 예를 들어 위 치, 동작 및 생리적 매개변수 등이 있다. 예시적인 웨어러블 컴퓨팅 디바이스에는 시계, 안경, 의류, 장갑, 모 자, 셔츠, 보석류, 반지, 귀걸이 목걸이, 암밴드, 목줄, 목걸이, 신발, 이어버드, 헤드폰 및 개인용 웰니스 장 치가 포함될 수 있지만 이에 국한되지 않는다. 시스템 개요(SYSTEM OVERVIEW) 이제 도면을 참조하면, 도면은 하나 이상의 예시적인 실시 예를 예시하기 위한 것이며, 이를 제한하기 위한 것 이 아니다. 도 1은 본 발명 한 특징에 따른 온도계 신뢰성을 증가시키기 위한 작동 환경의 예시적인 구성 요소 다이어그램이다. 작동 환경은 온도계, 컴퓨팅 디바이스 및 작동 시스템을 포함한다. 온도계, 컴퓨팅 디바이스 및 작동 시스템은 버스에 의해 상호 연결될 수 있다. 작동 환경 의 구성요소들뿐만 아니라, 본 명세서에서 논의되는 다른 시스템, 하드웨어 아키텍처, 및 소프트웨어 아키 텍처의 구성요소들은 다양한 실시 예들에 대해 결합되거나, 생략되거나, 상이한 아키텍처로 구성될 수 있다. 컴퓨팅 디바이스는 장치로 구현되거나 원격으로 저장될 수 있다. 컴퓨팅 디바이스는 온도계의 일부로서 구현될 수 있다. 컴퓨팅 디바이스는 온도계의 다른 잠재적 시스템들 중에서 텔레매틱스 유닛, 헤드 유닛, 또는 전자 제어 유닛의 일부로서 구현될 수 있다. 다른 실시 예들에서, 컴퓨팅 디바이스의 구성요소 및 기능은 휴대용 디바이스, 데이터베이스, 원격 서버 또는 네트워크(예컨대, 네트워크)를 통해 연결된 또 다른 디바이스와 같은 다른 디바이스로 구현될 수 있 다. 컴퓨팅 디바이스는 작동 환경의 컴포넌트들과 내부적으로 전자 신호를 송수신하기 위해 다양한 프로 토콜을 활용하는 유선 또는 무선 컴퓨터 통신을 제공할 수 있을 수 있다. 또한, 컴퓨팅 디바이스는 버스 (예컨대, 제어기 영역 네트워크(CAN) 또는 로컬 상호연결 네트워크(LIN) 프로토콜 버스)를 통해 내부 컴퓨 터 통신을 위해 작동 가능하게 연결되어 컴퓨팅 디바이스와 작동 환경의 구성 요소들 사이의 데이터 입력 및 출력을 용이하게 할 수 있다. 온도계는 온도를 측정하기 위한 센서를 포함한다. 예를 들어, 온도계는 사용자의 체온을 감지 하기 위한 센서를 포함할 수 있다. 센서들은 적외선 센서, 서미스터, 반도체 기반 온도 센서 등을 포함할 수 있다. 온도계의 센서는 온도계의 종류에 따라 온도계 상에 배치될 수 있다. 예를 들어, 온도 계가 고막 온도계라고 가정해 보겠다. 온도계는 도 2에 도시된 바와 같이, 사용자의 외이도 내 부의 온도를 측정하기 위한 적외선 센서(도시되지 않음)를 포함하는 프로브를 포함할 수 있다. 온도계 는 측정된 온도를 센서 데이터로 수신한다. 따라서, 센서들 및/또는 온도계는 사용자와 관련된 센서 데이터의 측정을 감지하고, 상기 데이터 측정을 나타내는 데이터 신호를 생성하도록 작동될 수 있다. 센서 데이터는 또한 다른 데이터 포맷(예컨대, 숫자)으로 변환되거나 온도계, 컴퓨팅 디바이스 및/또는 작동 시스템에 의해 데이터 메트릭 및 파라미터를 포함하는 새로운 센서 데이터를 생성하기 위해 사용될 수도 있다. 센서 데이터는 온도계로부터 측정된 온도를 포함한다. 센서 데이터는 주변 환경 데이터와 같은 환경으로부터의 온도 데이터를 더 포함할 수 있다. 예를 들어, 온도계는 온도계 의 환경의 온도를 측정하기 위한 센서를 포함할 수 있다. 컴퓨팅 디바이스는 프로세서, 메모리, 데이터 저장소 및 통신 인터페이스를 포함하며, 이들 각각은 버스 및/또는 다른 유선 및 무선 기술을 통해 컴퓨터 통신을 위해 작동 가능하게 연결된다. 통신 인터페이스는 컴퓨팅 디바이스의 구성요소와 다른 구성요소, 네트워크 및 데이터 소 스 사이의 데이터 입력 및 출력을 용이하게 하는 소프트웨어 및 하드웨어를 제공하며, 이들에 대하여는 이하 본 명세서에서 설명될 것이다. 또한, 컴퓨팅 디바이스는 온도 모듈, 분석 모듈 및 추천 모듈(12 4)을 또한 포함하며, 이들은 작동 환경의 구성요소들에 의해 촉진되는 온도 측정 신뢰성을 증가시키기 위 한 것이다. 컴퓨팅 디바이스는 또한 컴퓨터 통신을 위해(예를 들어, 버스 및/또는 통신 인터페이스를 통해) 하나 이상의 작동 시스템에 작동 가능하게 연결된다. 작동 시스템들은 온도계, 사용자에 의한 작동 및/또는 안전을 향상시키는 데 사용될 수 있는 임의의 자동 또는 수동 시스템을 포함할 수 있지만, 이에 국한되지는 않는다. 작동 시스템들은 실행 모듈을 포함한다. 실행 모듈은 온도계를 어느 정도 모니터링, 분석 및/또는 작동한다. 예를 들어, 실행 모듈은 이전 사용 통계와 같은 온도계에 대한 정보를 저장, 계산 및 제공할 수 있다. 작동 시스템은 또한 온도계와의 컴퓨터 통신을 위해 작 동 가능하게 연결되거나 이들을 포함한다. 예를 들어, 온도계의 하나 이상의 센서는 는 실행 모듈과 통합되어, 온도계의 위치 등과 같은 온도계의 특성을 모니터링 하도록 할 수 있다. 다른 실시 예에 서, 온도계는 하나 이상의 디바이스 또는 서비스(예컨대, 웨어러블 디바이스, 비웨어러블 디바이스, 클라 우드 서비스 등)와 통신하여 사용자의 위치가 주어진 때 실외 온도와 같은 환경의 특성을 모니터링 할 수 있다. 예를 들어, 온도계는 사용자의 온도 측정이 측정될 때 로컬 온도를 측정할 수 있다. 온도계, 컴퓨팅 디바이스 및/또는 작동 시스템은 또한 네트워크와 컴퓨터 통신을 위해 작 동 가능하게 연결된다. 네트워크는, 예를 들어, 데이터 네트워크, 인터넷, 광역 네트워크(WAN) 또는 로컬 영역(LAN) 네트워크이다. 네트워크는 다양한 원격 장치(예컨대, 데이터베이스, 웹 서버, 원격 서버, 애플 리케이션 서버, 중개 서버, 클라이언트 머신, 또는 다른 휴대용 장치)에 대한 통신 매체로서 기능한다. 작동 환경은 사용자에게 측정된 온도에 대한 컨텍스트를 제공하기 위해 사용자와 상호 작용함에 의해 온도 측정 신뢰성을 증가시킴으로써 사용자 경험을 향상시키는 것을 용이하게 한다. 또한, 본 발명 시스 템 및 방법은 측정된 온도에 관한 권장 사항을 제공하여 사용자가 온도계에 의해 측정된 온도에 대해 확신을 가질 수 있도록 한다. 이제, 전술한 본 발명 시스템 및 네트워크 구성을 사용하는 예시적인 방법을 설 명하는 상세한 실시 예가 하기에서 상세히 논의될 것이다. II. 온도계 신뢰성 증가 방법 도 3을 참조하여, 온도계 신뢰성을 증가시키기 위한 방법이 예시적인 실시 예에 따라 설명될 것이다. 도 3은 도 1, 도 2, 도 4 및 도 5를 참조하여 설명될 것이다. 설명을 간단하게 하기 위해, 본 발명 방법은 일련의 블록들로 설명될 것이지만, 이 같은 방법의 요소들은 상이한 아키텍처, 요소, 단계 및/또는 프로세 스로 구성될 수 있다. 블록에서, 본 발명 방법은 사용자로부터 피험자에 대한 현재 측정된 온도에 대한 문의를 수신하는 온도 모듈을 포함한다. 온도 모듈은 네트워크, 휴대용 디바이스, 또는 다른 형 태의 컴퓨터 통신을 통해 온도계로부터 현재 측정된 온도를 수신할 수 있다. 도 4의 도면에 도시된 문의는 사용자가 현재 측정된 온도를 의심한다는 것을 나타낸다. 사용자는 피험자의 체온을 측정인, 현재 온도 측정값을 수신한다. 현재 온도 측정은 온도계로부터 센 서 데이터로 수신될 수 있다. 일부 실시 예에서, 사용자와 피험자는 별개의 엔티티이다. 예를 들어, 사용자는 간병인일 수 있고, 피험자는 간병인이 책임지는 환자일 수 있다. 다른 실시 예들에서, 사 용자는 피험자일 수 있다. 예를 들어, 사용자는 자신의 체온을 측정하고 있을 수 있다. 사용자가 자신의 체온을 측정하고 있고, 따라서 피험자 및 사용자가 모두 피험자라고 가정한다. 사 용자는 도 2에 도시된 바와 같이, 온도계의 디스플레이 또는 도 5에 도시된 휴대용 장치의 디스 플레이에서 현재 측정된 온도를 수신할 수 있다. 사용자가 현재 측정된 온도에 대해 회의적인 경우, 사용자는 온도계 또는 휴대용 장치를 사용하여 문의를 입력할 수 있다. 사용자는 문 의를 사용자가 키워드를 제공하는 자유 단어 입력으로 입력할 수 있다. 다른 실시 예에서, 온도 모 듈은 사용자에게 사용자가 선택하는 문의 세트를 제공할 수 있고, 선택된 문의는 온도 모듈 에 의해 사용자로부터의 문의인 것으로 수신될 수 있다. 도 5를 참조하면, 문의 세트는 사용자가 온도계의 현재 측정된 온도에 대해 회의적인 이유를 설 명하는 다수의 문의 카테고리를 포함할 수 있다. 예를 들어, 사용자가 시설에 입장하기 위해 필요한 일상 적인 온도 측정을 하고 있고, 사용자가 괜찮다고 느낀다고 가정해 보자. 사용자는 현재 측정된 온도 가 정상 온도(예: 약 98.6°F)로 표시될 것으로 예상할 수 있다. 이 같은 예상과 달리, 사용자가 104.1° F의 현재 측정 온도를 수신하는 경우, 사용자는 현재 측정 온도가 너무 높다고 의심하기 때문에 사용자 는 회의적일 수 있다. 또는, 사용자가 기분이 좋지 않고 홍조가 있는 경우, 사용자는 예를 들 어, 100°F를 초과하는 더 높은 온도를 수신할 것으로 예상할 수 있다. 이 같은 예상과 달리, 사용자가 97.3°F의 현재 측정된 온도를 수신하는 경우, 사용자는 현재 측정된 온도가 너무 낮다고 의심하기 때문에회의적일 수 있다. 따라서, 문의 세트의 하나의 문의 카테고리는 현재 측정된 온도가 사용자의 예상 판독 값에 비해 너무 높거나 너무 낮은 경우 사용자가 선택할 수 있는 예기치 않은 판독값 카테고리일 수 있다. 이제 사용자와 피험자가 구별되는 예를 보기로 한다. 사용자가 어머니이고 피험자가 아이라고 가정 해 보자. 사용자는 피험자가 다른 체온을 가질 것으로 예상할 수 있다. 사용자가 아이가 허약하고, 떨고, 땀을 흘리는 것을 관찰하고 열이 있을 것으로 예상한다고 가정한다. 그러나 온도계로부터 수신된 현 재 측정된 온도는 98.6°F이다. 사용자로서 어머니는 \"예기치 않은 판독값\" 카테고리를 선택하여, 어 머니가 현재 측정된 온도가 너무 낮다고 의심한다는 것을 나타낼 수 있다. 문의 세트의 또 다른 문의 카테고리는 \"판독값 다양\" 카테고리를 포함할 수 있다. 판독값 다양 카테 고리는 사용자가 변동하는 다수의 온도 판독값을 측정할 때 사용자에 의해 선택될 수 있다. 예 를 들어, 사용자가 세 개의 온도를 측정하고 있다고 가정해 보자. 세 개의 온도는 이전에 측정된 첫 번째 온도 97.3°F, 이전에 측정된 두 번째 온도 102.5°F 및 현재 측정된 온도 98.6°F를 포함할 수 있다. 사용자 는 이전에 측정된 제1 온도에서 이전에 측정된 제2 온도로의 불규칙한 온도 상승으로 인해 현재 측정된 온 도에 대한 확신을 갖지 못할 수 있다. 추가적으로 또는 대안적으로, 사용자는 이전에 측정된 두 번째 온 도에서 현재 측정된 온도로의 온도가 불규칙적으로 하강하기 때문에 현재 측정된 온도에 대한 확신을 갖지 못할 수 있다. 또한, 사용자는 세 온도 사이의 변동이 당황스러울 수도 있다. 세 가지 온도와 관련된 이러한 시나리오들 중 일부 또는 전부에 기초하여, 사용자는 휴대용 장치의 디스플레이에서 \"판독값 다 양\" 카테고리를 선택할 수 있다. 온도 모듈은 또한 문의 세트에서 다른 결과 카테고리를 제공할 수도 있다. 사용자가 현재 측정된 온도를 감지하기 위해 다수의 디바이스를 사용하는 경우, 상이한 결과 카테고리가 사용자에 의해 선택될 수 있다. 예를 들어, 사용자가 대체 온도계(도시되지 않음)를 사용하여 자신의 온도를 측정 한다고 가정해 본다. 이때 사용자는 현재 측정된 온도로서 온도계로부터 다른 온도 판독값을 수신한 다. 상기 대체 온도계로부터 수신된 이전 측정 온도와 온도계로부터 수신된 현재 측정 온도가 다른 경우, 사용자는 다른 결과 카테고리를 선택하여 온도계 또는 대체 온도계 중 어느 디바이스가 더 정확 한 판독값을 제공했는지 확실하지 않음을 나타낼 수 있다. 문의 카테고리는 단지 예시적인 것일 뿐이며, 더 많거나, 더 적거나, 다른 문의 카테고리가 문의 세트에 포함될 수 있다. 온도 모듈은 온도계 또는 휴대용 디바이스의 디스플레이 상의 문의 카테 고리의 선택으로서 사용자로부터 문의를 수신할 수 있다. 또한, 문의 세트는 임의의 구성으로 표시될 수 있다. 예를 들어, 온도 모듈은 디스플레이와의 상호 작용에 기초하여 또는 오디오 입력으 로서 문의 카테고리의 선택을 수신할 수 있다. 일 실시 예에서, 사용자는 문의 카테고리를 청각적으로 선 택함으로써 온도 모듈에 응답하고, 문의 세트를 제공할 수 있다. 예를 들어, 사용자는 \"더 높 은 온도를 예상했다.\" 또는 \"더 낮은 판독값을 예상했다.\"라고 말할 수 있다. 온도 모듈은 예기치 않은 판독값 카테고리의 선택으로서 두 진술 중 하나를 처리할 수 있다. 마찬가지로, 온도 모듈은 다른 결과 카테고리로서 \"나의 다른 온도계가 나에게 다른 결과를 제공했다\"는 진술을 처리할 수 있다. 일 실시 예에서, 온도 모듈은 사용자로부터의 입력에 대한 응답으로 문의 세트를 제공할 수 있 다. 예를 들어, 사용자는 예를 들어, 휴대용 장치의 디스플레이상에서 가청 진술로서 또는 수 동 입력을 통해 \"내가 예상하지 못한 온도를 얻었다.\"라고 표현할 수 있다. 다른 실시 예로서, 온도 모듈(12 0)은 사용자와 연관된 히스토리 데이터에 기초하여 문의 세트를 제공할 수 있다. 히스토리 데이터는, 피험자가 별개의 실체인지 또는 사용자인지 여부에 관계없이, 피험자와 관련된 측정된 온도를 포함할 수 있다. 이 같은 히스토리 데이터는 타임스탬프 및/또는 측정된 온도에 대한 타임 라인과 같은 센서 데이터를 포함할 수 있다. 예를 들어, 온도 모듈은 온도계로부터 수신된 온도 측 정에 타임스탬프를 적용할 수 있다. 세 개의 온도가 수신된 상기 예로 돌아가서, 히스토리 데이터는 이전 에 측정된 첫 번째 온도, 이전에 측정된 두 번째 온도 및 피험자에 대한 현재 측정된 온도를 포함한다. 따라서, 피험자에 대해 수신된 측정값은 메모리 또는 데이터 저장소에 저장되고, 나중에 온도 모듈 에 의해 액세스될 수 있다. 다른 실시 예에서, 온도 모듈은 네트워크에 의해 액세스 가능한 원 격 서버(도시되지 않음) 또는 데이터베이스(도시되지 않음) 상의 히스토리 데이터에 액세스할 수 있다. 히스토리 데이터는 피험자 또는 사용자에 대한 프로파일과 관련하여 저장될 수 있다. 이 같은 프로 파일은 피험자와 관련된 위치 데이터(예컨대, 위치 데이터, 좌표, 위치의 날씨 정보, 주변 환경 데이터 등), 피험자에 대한 인구 통계 정보(예컨대, 연령, 성별, 인종 등) 및 건강 정보(예컨대, 건강 상태, 만성 질환, 현재 약물 복용, 체온 베이스라인 등), 및 히스토리 데이터를 포함할 수 있다. 상기 프로파일은 피험자, 사용 자 또는 제3자에 의해 유지될 수 있다. 사용자가 피험자인 환자의 체온을 측정하는 간호사라고 가정 해 보자. 간호사는 환자의 현재 체온 측정에 대해 확신이 없을 수 있다. 히스토리 데이터를 포함하는 프 로파일은 온도계를 조작하는 사람(여기서는 사용자가 아니라, 피험자)과 무관하다. 예를 들어, 병원 은 피험자에 대한 히스토리 데이터를 포함하는 환자 기록을 유지할 수 있다. 이 같은 방식으로, 사용자 는 피험자의 현재 온도 측정값을 수신한다. 실시 예들에서, 사용자가 자신의 체온을 측정하는 경우, 사용자가 피험자이기 때문에 프로파일은 사용자와 관련이 있다. 사용자가 피험자의 현재 측정된 온도를 수신하지만, 히스토리 데이터와 비교하여 현재 측정된 온도가 일치하지 않는다고 가정한다. 휴대용 장치는 불일치 알림을 표시하여 사용자에게 피험자에 대한 다양한 측정이 감지되었음을 알릴 수 있다. 불일치 알림은 디스플레이에 표시될 수 있고, 사용자 에 의해 문의)로서 선택될 수 있다. 따라서, 이 같이 조회로서 선택되면, 사용자로부터 피험자 에 대한 현재 측정된 온도에 대한 문의로서 불일치 알림이 온도 모듈에 의해 수신될 수 있다. 피험자의 현재 측정된 온도는 히스토리 데이터의 가장 최근 측정된 온도일 수 있다. 불일치 알림이 표시되는 것을 방지하기 위해, 상이한 측정 장치가 사용되거나 피험자의 상이한 해부학적 부위가 측정되는 경우, 히스토리 데이터는 측정 특성에 기초하여 온도 측정으로 분할될 수 있다. 측정 특 성에는 측정 유형, 사용된 장치, 측정된 해부학적 부위 등이 포함될 수 있다. 예를 들어, 피험자의 프로파일은 피험자의 제1 해부학적 영역과 연관된 히스토리 데이터의 제1 세트 및 제1 해부학적 영역과 다른 피험자의 제2 해부학적 영역과 연관된 히스토리 데이터의 제2 세트를 포함할 수 있다. 일 실시 예에서, 온도계는 피험자의 내이(inner ear)와 같은 제 1 해부학적 영역 및 피험자의 관자놀이와 같은 제 2 해부학적 영역으로부터 온도를 측정할 수 있는 적외선 온도계이다. 프로파일은 세트로 구성된 히스 토리 데이터를 포함할 수 있다. 예를 들어, 히스토리 데이터 세트는 내이를 통해 감지된 온도 측정에 대 한 히스토리 데이터의 제1 세트와 관자놀이를 통해 감지된 온도 측정에 대한 히스토리 데이터의 제2 세트 를 포함할 수 있다. 따라서, 히스토리 데이터의 세트는 해부학적 영역과 연관될 수 있다. 다른 예로서, 온도 모듈이 온도계와 같은 제1 디바이스로부터 제1 이전 측정값을 수신하고, 대체 온도계와 같은 제 2 디바이스로부터 제2 이전 측정값을 수신한다고 가정한다. 프로파일은 제1 디바이스로부터 수신된 온도 측정 에 대한 히스토리 데이터의 제1 세트 및 제2 디바이스로부터 수신된 온도 측정에 대한 히스토리 데이터 의 제2 세트를 포함할 수 있다. 따라서, 피험자의 프로파일은 피험자의 온도 측정뿐만 아니라 온도 측정 에 대한 특성을 포함할 수 있다. 따라서, 히스토리 데이터의 세트는 여러 다른 특성들 중에서도 도 6과 관련하여 설명될 프로파일, 디바이스, 세션과 연관될 수 있다. 온도 모듈은 메타데이터를 포함하는 히스토리 데이터의 특성에 기초하여 불일치 알림을 생성할 수 있다. 예를 들어, 하나의 해부학적 영역에서 측정된 온도 측정값은 다른 해부학적 영역에서 측정된 온도 측 정값과 비교할 때 불일치하는 것처럼 보일 수 있다. 따라서, 온도 모듈은 제 1 특성을 공유하는 온도 측 정이 소정의 양만큼 다를 때 불일치 알림을 사용자에게 제공할 수 있다. 블록에서, 본 발명 방법은 문의 및 현재 측정된 온도에 기초하여 사용자에 대한 쿼리 (query)를 생성하는 분석 모듈을 포함한다. 쿼리는 분석 모듈이 사용자로부터 문의 에 대한 보다 타겟화된 정보를 수신할 수 있게 한다. 쿼리는 사용자, 피험자, 현재 측정된 온 도, 피험자 및/또는 사용자의 프로파일, 또는 피험자 및/또는 사용자의 위치로 보내질 수 있다. 블 록에서, 본 발명 방법은 쿼리에 응답하여 사용자로부터의 응답을 수신하는 분석 모듈 을 포함한다. 응답은 예를 들어, 사용자가 키워드를 제공하는 자유 단어 입력과 같이, 문의와 유사한 방식으로 사용자에 의해 입력될 수 있다. 다른 실시 예에서, 분석 모듈은 사용자가 선 택할 수 있는 복수의 응답을 사용자에게 제공할 수 있다. 분석 모듈은 사용자로부터 선택된 답 변을 응답으로 수신한다. 이에 따라, 사용자는 문의에 기초한 문의 및 응답 세션에 참여할 수 있다. 블록으로 돌아가서, 일 실시 예에서, 분석 모듈에 의해 제공되는 쿼리는 문의 세트의 문의 카테 고리에 기초할 수 있다. 예를 들어, 사용자가 문의 세트로부터 예기치 않은 읽기 카테고리를 선택했다고 가정한다. 쿼리는 현재 측정된 온도가 낮거나 높아서 예기치 않은 것인지 여부를 결정하도록 정의될 수 있다. 예를 들어, 블록과 관련하여, 사용자는 디스플레이에서 그래픽을 제공받을 수있으며, 현재 측정된 온도가 너무 낮거나 너무 높은 것으로 정의하는 그래픽을 선택할 수 있다. 쿼리에서 \"현재 측정된 온도가 너무 높습니까?\"라는 문구가 있다고 가정해 보자. 응답은 \"예\"로 수신될 수 있다. 이러한 방식으로, 쿼리는 사용자에게 선택 가능한 초이스(choice)로 제공될 수 있다. 따라서, 블록 에서, 분석 모듈은 사용자가 현재 측정된 온도가 너무 낮거나 너무 높은 것과 연관된 그래픽 중 하나를 선택함에 의해 쿼리에 응답하여 사용자로부터 응답을 수신한다. 이러한 방식으로, 응답 은 사용자에 의해 이루어진 문의와 직접적으로 관련될 수 있다. 다른 예로서, 사용자가 판독값 변화 카테고리를 선택한다고 가정하자. 판독값 변화 카테고리와 연관된 쿼리는, 현재 온도 측정이 이전 온도 측정과 추세를 이루고 있는지 또는 이전 온도 측정과 편차를 이루고 있는지를 결정하도록 정의될 수 있다. 예를 들어, 블록과 관련하여, 사용자는 디스플레이 에서 그래픽을 제공받을 수 있으며, 현재 측정된 온도가 패턴을 따르거나 패턴을 따르지 않는 변칙적인 것으로 정의하는 그래픽 중에서 선택할 수 있다. 따라서, 블록에서, 분석 모듈은 패턴 또는 변칙을 선 택함에 의해 쿼리에 대한 응답으로 사용자로부터 응답을 수신한다. 따라서, 쿼리는 분석 모듈이 사용자의 경험에 대한 더 많은 정보를 수집할 수 있도록 허용한다. 쿼리는 또한 분석 모듈이 컴퓨팅 디바이스에서 이용할 수 없는 정보를 요청할 수 있게 한다. 앞서 설명된 실시 예로 돌아가서, 사용자가 대체 온도계(도시되지 않음)를 사용하여 자신의 온도를 측정하 고 이전에 측정된 온도를 수신한다고 가정해 보자. 다음으로, 사용자는 현재 측정된 온도를 수신한다. 블록과 관련하여, 쿼리는 대체 온도계로부터의 온도 데이터로 액세스를 요청할 수 있다. 이에 따라, 블록에서, 분석 모듈은 쿼리에 대한 응답으로 사용자로부터 대체 온도계로부터의 온도 데 이터에 대한 액세스 또는 거부에 대한 응답을 수신한다. 따라서, 쿼리는 또한 분석 모듈이 대체 온 도계, 온도계, 사용자, 피험자, 또는 사용자 또는 피험자의 환경의 상황에 대한 더 많은 정보를 수집하도록 허용할 수 있다. 다른 실시 예에서, 쿼리는 사용자가 히스토리 데이터 세트를 지정하는 요청 을 포함할 수 있다. 예를 들어, 쿼리는 현재 측정된 온도가 제1 해부학적 영역에서 측정되었는지 또는 제 2 해부학적 영역에서 측정되었는지를 지정하도록 사용자에게 요청하는 것을 포함할 수 있다. 블록에서, 본 발명 방법은 히스토리 데이터의 분석에서 현재 측정된 온도를 분석하는 분석 모듈을 포함한다. 분석은 현재 측정된 온도를 히스토리 데이터와 상호 연관시킨다. 예를 들어, 분석은 피험자의 측정된 온도가 상승 또는 하강 추세에 있는지 여부를 결정하기 위한 추세선 분석일 수 있다. 일부 실시 예에서, 분석은, 예를 들어, 추세선에 기초하여, 히스토리 데이터에 대한 변동성 값 을 결정하는 것을 포함할 수 있다. 분석은 변동성 임계값을 초과하는 변동성 값에 응답하여 사용자의 프 로파일을 확인하기 위해 쿼리를 생성하는 것을 더 포함할 수 있다. 분석은 프로파일에 기초하여 분 석에서 현재 측정된 온도를 분석하는 분석 모듈을 더 포함할 수 있다. 프로파일은 또한 위치 데이터 (예컨대, 위치 좌표, 주변 환경 온도, 지역 온도, 질병 또는 감염 사례율 등) 및/또는 사용자에 대한 인구통계 학적 정보를 포함할 수 있다. 인구통계학적 데이터는 연령, 인종, 민족, 고용 상태, 교육 수준, 소득, 및 주소 등과 같은 특성을 포함할 수 있다. 일부 실시 예에서, 분석 모듈은 생리학적 데이터를 수신하거나 식별하는 것을 포함할 수 있다. 생리학적 데이터는 심박수, 심박수 패턴, 혈압, 산소 함량 등과 같은 심장 정보를 포함할 수 있다. 생리학적 데이터는 또한 뇌파(EEG) 측정, 기능적 근적외선 분광법(fNIRS), 기능적 자기 공명 영상(fMRI) 등과 같은 뇌 정보를 포함 할 수 있다. 생리적 데이터에는 소화 정보, 호흡수 정보, 타액 분비 정보, 땀 정보, 동공 확장 정보, 체온, 근 육 긴장도 및 차량 탑승자의 자율 신경계 또는 기타 생물학적 시스템과 관련된 기타 종류의 정보도 포함될 수 있다. 생리학적 데이터는 사용자를 식별하는 데 사용되는 인식 데이터(예컨대, 생체 식별)를 더 포함할 수 있다. 예를 들어, 인식 데이터는 다른 유형의 인식 데이터 중에서 사용자와 연관된 미리 결정된 심박 수 패턴을 포함할 수 있다. 사용자의 프로파일은 인식 데이터에 기초하여 식별될 수 있다. 분석 모듈은 온도계로부터 센서 데이터로서 생리 데이터를 수신할 수 있다. 인식 데이터 및 다 른 유형의 생리 데이터는 다양한 위치(예컨대, 메모리, 데이터 저장소, 웨어러블 컴퓨팅 디바이스와 통합된 메모리, 원격 데이터베이스)에 추가적으로 또는 대체적으로 저장되고 분석 모듈에 의해 액세스될 수 있다. 분석 모듈의 분석은, 예를 들어, 최소 제곱 회귀 툴을 사용하여 비정상적인 온도 측정값을 더 식별할 수 있다. 분석은 예측 분석에 기초할 수 있다. 예를 들어, 분석은 히스토리 데이터, 쿼리 및 응답에 기초하여 예측된 측정 온도를 예측하고, 예측된 측정 온도를 현재 측정 온도와 비교할 수 있다.따라서, 분석은 쿼리 및 응답을 활용할 수 있다. 분석 모듈은 단계들을 병렬적으로 수행할 수 있다. 예를 들어, 도 4를 참조하면, 분석 모듈에 의해 문의 가 수신되면, 분석 모듈은 문의에 기초하여 쿼리를 생성하고, 블록(304 및 306)과 관련하 여 각각 설명된 바와 같이, 쿼리에 대한 응답으로서 사용자로부터 응답을 수신한다. 본 발명 실시 예에서, 블록과 관련하여 설명된 바와 같이, 히스토리 데이터에 기초한 현재 측정된 온도의 분 석은 추천을 생성하기 위해 쿼리 생성 및 응답의 수신과 병렬로 이루어질 수 있다. 추천은 본 발명 방법의 블록에서 추천 모듈에 의해 생성된다. 추천은 응답 및 분석에 기초한 문의와 연관된다. 추천은 현재 측정된 판독값에 대한 신뢰 수준을 나타낼 수 있 다. 예를 들어, 추천은 추천 모듈이 응답 및 분석에 기초하여 현재 측정된 판독값에 대해 확신하거나, 어느 정도 확신하거나, 또는 확신하지 않음을 나타낼 수 있다. 추천은 또한 제안(예컨대, 작동을 위한 팁, 온도계에 대한 정보 등)을 제공할 수 있다. 제안은 사용 자가 문의에 기초하여 현재 측정된 온도의 문제를 해결하는 데 도움을 줄 수 있다. 예를 들어, 추천 은 온도계 또는 휴대용 디바이스에 대해 수행될 수 있는 조정을 포함할 수 있다. 조정 (adjustments)은 실행 모듈에 기초할 수 있다. 일 실시 예에서, 추천은 온도계에 대한 정렬 지 침을 포함하는 디스플레이에 표시되는 알림일 수 있다. 추천은 텍스트, 오디오, 이미지, 비디오, 또 는 프로젝션 등이 될 수 있다. 예를 들어, 추천은 온도계가 피험자에 대해 어떻게 정렬되어야 하는 지를 설명하는 비디오일 수 있다. 일례로서, 추천은 히스토리 데이터의 제1 세트 또는 히스토리 데이터의 제2 세트에 더 기초할 수 있다. 예를 들어, 쿼리는 사용자에게 현재 측정된 온도가 관자놀이와 같은 제1 해부 학적 영역에서 측정된 것인지 또는 내이와 같은 제2 해부학적 영역에서 측정된 것인지를 지정하도록 요청할 수 있다. 장치를 조작하는 방법에 대한 추천은 응답을 기반으로 할 수 있다. 예를 들어, 다른 해부학 적 영역에서 측정을 수행하거나, 응답된 해부학적 영역에 대하여 장치를 정렬하는 방법이 추천될 수 있다. 추천은, 문의가 문의들의 집합에 기초할 때, 문의 카테고리와 관련된 이유 또는 문제를 추가적 으로 또는 대체적으로 나타낼 수 있다. 판독값 변화 카테고리가 사용자에 의해 선택되었다고 가정한 다. 추천은 다양한 판독값에 대한 가능한 이유를 제공할 수 있다. 예를 들어, 온도계가 귀 온도계 라고 가정하면, 추천은 외이도의 정렬이 일관되지 않아서 판독값이 달라질 수 있다고 명시할 수 있다. 추천은 또한 사용자 및/또는 피험자에 대한 정보를 포함할 수 있다. 예를 들어, 사용자가 현재 측정된 온도가 예기치 않은 판독 범주에 있다고 표시했다고 가정한다. 쿼리 및 응답은 사용자 에게 피험자의 행동, 환경 및 상태에 대해 질문할 수 있다. 일례로서, 쿼리는 피험자의 최근 활동에 대해 질문할 수 있다. 피험자가 방금 심혈관 운동을 마쳤다고 가정해 보자. 응답은 피험자의 현재 심박 수, 심혈관 운동의 활동 수준, 또는 활동 유형 등을 나타낼 수 있다. 그러면, 추천은 현재 측정된 온도가 비정상적인 것이 아니라, 피험자의 최근 활동으로 인한 것임을 나타낼 수 있다. 추천은 향후 측정이 수행되도록 추가로 조언할 수 있다. 예를 들어, 추천은 다음 측정값 을 측정하기 전에 피험자가 차분히 가라 앉을 수 있는 적절한 시간을 제공하기 위해, 예를 들어 20분과 같은 미 리 결정된 시간 내에 다음 측정값을 측정할 것을 포함할 수 있다. 이러한 방식으로, 추천은 사용자가 현재 온도 측정에 대해 확신이 없을 때 사용자를 지원한다. 추천에 기초하여, 사용자는 온도계로부터 측정된 온도에 대한 신뢰도를 증가시킬 수 있다. 추 천은 히스토리 데이터 및 사용자의 응답에 기초하기 때문에, 사용자는 관련성 있고, 우선순위가 지정된, 개인화된 안내를 제공받는다. 앞의 실시 예들에서는 하나의 쿼리(query)와 하나의 응답을 포함하지만, 분석 모듈은 추가 문의들을 생성 하고, 추가 문의들에 기초하여 추가 응답을 수신할 수 있다. 예를 들어, 도 6은 판독값 변화 카테고리의 쿼리에 기초한 일 실시 예를 예시한다. 여기서, 분석은 세션 제한에 기초할 수 있다. 예를 들어, 히스토리 데이터는 복수의 피험자에 대한 수백 개의 판독값을 포함할 수 있다. 분석이 현재 측정된 온도와 관련이 있는지 확인하기 위해, 분석은 히스토리 데이터의 하위 집합인 이전에 측정된 온도에 대해 수행될 수 있다. 예를 들어, 세션은 현재 측정된 온도 이전 10분에 해당하는 히스토리 데이터의 하 위 집합을 포함할 수 있다. 히스토리 데이터를 세션에 기초하여 이전에 측정된 온도로 제한함으로써, 이전 세션의 데이터는 분석에서 제외된다. 세션은 현재 측정된 온도 또는 현재 측정된 온도를 포함하는 타임라인에 선행하는 소정의 시간에 의해 정 의될 수 있다. 다른 예로서, 세션은 히스토리 데이터에서 이전에 측정된 온도의 클러스터에 의해 정 의될 수 있다. 예를 들어, 온도계는 산발적으로 사용되어 온도계와 연관된 히스토리 데이터가 사용에 따라 시간에 따라 달라질 수 있다. 일부 실시 예에서, 분석 모듈은 클러스터를 식별하기 위해 히 스토리 데이터를 분석할 수 있다. 세션은 현재 측정된 온도를 포함하는 이전에 측정된 온도의 클러 스터로 제한될 수 있다. 본 발명의 다른 실시 예에서, 세션은 피험자 또는 사용자의 프로파일에 기초할 수 있다. 예를 들어, 쿼리는 사용자에게 프로파일이 사용자와 연관되어 있는지 확인하도록 요청할 수 있다. 쿼리 는 또한 사용자에게 프로파일이 피험자와 연관되어 있는지 확인하도록 요청할 수도 있다. 이러한 방 식으로, 쿼리는 프로파일의 확인을 요청할 수 있다. 그런 다음, 현재 측정된 온도가 프로파일과 연관되어 있으므로, 히스토리 데이터가 특정 피험자 또는 사용자와 연관되도록 할 수 있다. 세션은 미리 결정 된 시간 또는 시간 의존 클러스터 동안 특정 피험자 또는 사용자와 연관된 온도 측정으로 제한될 수 있다. 상기 예들은 단일 쿼리(query) 및 응답을 설명하지만, 쿼리 및 응답 세션은 임의의 수의 쿼리들을 포함할 수 있 다. 도 7을 참조하면, 문의가 수신되면, 분석 모듈에 의해 질문 시리즈가 생성될 수 있다. 질문 시 리즈는 문의에 응답하는 데 필요한 정보를 식별하는 다수의 질문을 포함한다. 예를 들어, 질문 시리 즈의 하나 이상의 질문은 분석을 수행하는 데 필요한 정보를 식별할 수 있다. 질문 시리즈의 질문들에서 식별된 정보를 수신하기 위해, 분석 모듈은 쿼리 및 응답을 수신하는 것과 같은 하 나 이상의 쿼리 및 응답을 포함하는 쿼리 시리즈를 생성한다. 예를 들어, 질문 시리즈의 제 1 질문이 이전에 측정된 온도가 98.6°F 미만인지 여부를 결정할 것을 시도한다고 가정한다. 분석 모듈은 타임라인 및 히스토리 데이터에 액세스하여 제 1 질문(70 6)을 해결할 수 있다. 이 같은 해결에 기초하여, 쿼리 시리즈는 제1 쿼리를 포함할 수 있다. 여기서, 제 1 쿼리는 사용자가 98.6°F의 정상 수치를 예상했는지 여부에 관한 것이다. 제 1 쿼리 에 대한 응답으로, 분석 모듈은 제 1 긍정 응답 또는 제 1 부정 응답을 수신할 수 있다. 제 1 쿼리에 대한 응답으로 분석 모듈에 의해 제 1 긍정 응답이 수신되면, 추천 모듈은 제 1 추천과 같은 추천 시리즈의 추천을 생성한다. 제 1 쿼리에 대한 응답으로 분석 모듈 에 의해 제 1 부정 응답이 수신되면, 분석 모듈은 질문 시리즈의 제 2 질문으로 이동 한다. 제2 질문은 분석 모듈이 히스토리 데이터를 사용하여 다른 라운드의 분석을 수행하게 할 수 있다. 예를 들어, 분석 모듈은 타임라인에 액세스하여 제2 질문과 관련하여 분석을 수행할 수 있다. 따라서, 복수의 쿼리를 사용하는 것 외에도, 분석 모듈은 복수의 분석 라운드를 수행할 수 있다. 분석이 질문 시리즈의 세 번째 질문으로 계속된다고 가정한다. 제3 질문은 다른 유형의 히스토 리 데이터 또는 프로파일에 기초한 외부 온도에 액세스할 수 있다. 예를 들어, 분석 모듈은 피험자 또는 사용자에 대한 위치 온도 데이터를 포함할 수 있다. 제3 질문의 해결에 기초하여, 쿼리 시리즈는 제2 쿼리를 포함할 수 있다. 여기서, 제2 쿼리는 사용자 및/또는 피험자가 추운 환경으로부터 들어왔는지 여부에 관한 것이다. 제2 쿼리에 대한 응답으로, 분석 모듈은 제2 긍정 응 답 또는 제2 부정 응답을 수신할 수 있다. 제2 쿼리에 대한 응답으로 분석 모듈에 의해 제2 긍정 응답이 수신되면, 추천 모듈은 추천 시리즈의 제2 추천을 생성한다. 제2 부정 응답이 제2 쿼리에 대한 응답으로서 분석 모듈에 의해 수신되면, 분석 모듈은 질 문 시리즈의 다음 질문으로 이동한다. 이러한 방식으로, 분석 모듈의 쿼리, 응답 및 분석은 추천이 생성될 때까지 반복적으로 수행될 수 있다. 본 발명 방법의 또 다른 예는, 사용자가 제 1 이마 온도 96.8°F, 제 2 온도 97.3°F 및 제 3 온도 98.1°F를 수신하는 것을 포함할 수 있다. 사용자는 온도가 일정하지 않기 때문에 우려할 수 있고, 온도계 또는 휴대용 디바이스의 스크린을 터치하여 \"판독값이 다름\"을 입력할 수 있다. 이에 대한 한 가지 잠재적인 이유는 피험자가 외부의 추운 환경에서 들어와 서서히 따듯해지고 있으며, 피험자의 이마가 체온을 제 대로 반영하지 못하기 때문이다. 분석 모듈은 위치 데이터에 기초하여 사용자의 국소 온도를 결정할 수 있다. 이 같은 국소 온도를 기반으로, 분석 모듈은 국소 온도가 표준 실내 온도보다 임계값만큼 더 차 가운지 판단하는 것을 포함할 수 있다. 이에 따라, 쿼리는 사용자에게 피험자가 외부에서 들어왔는 지 여부를 쿼리할 수 있다. 사용자가 긍정적인 응답을 제공하는 경우, 첫 번째 추천은 피험자 가 온도계의 주변 온도에 적응할 수 있도록 소정의 시간을 기다리도록 하는 것일 수 있다. 이와 달리, 사용자가 부정적 응답을 제공하는 경우, 분석 모듈은 온도계가 다른 주변 환경에 있었는지 여부를 결정하기 위한 제2 쿼리를 생성할 수 있다. 본 발명 방법의 또 다른 예는, 사용자가 98.8°C의 제1 귀 온도, 98.3°C의 제2 귀 온도, 및 98.7° C의 제3 온도를 수신하는 것을 포함할 수 있다. 사용자는 온도가 일정하지 않기 때문에 우려할 수 있고, 온도계 또는 휴대용 장치의 스크린을 터치하여 \"판독값이 다름\"을 입력할 수 있다. 제1 쿼리 는 사용자가 온도계의 프로브를 제대로 삽입하고 있는지와 같은 온도계의 배치에 대한 정 보를 요청할 수 있다. 사용자가 긍정적인 응답을 제공하는 경우, 두 번째 쿼리는 사용자 가 귀를 왼쪽에서 오른쪽으로 전환했는지 여부를 물어볼 수 있다. 귀는 온도가 서로 다른 것으로 알려져 있기 때문에, 이것이 가능한 설명일 수 있다. 따라서, 추천은 일관성을 위해 사용자에게 왼쪽 귀만 사용 하거나, 또는 오른쪽 귀만 사용하라는 지침을 제공할 수 있다. 논의된 바와 같이, 질문의 유형 및 제시되는 순서는 이전 판독값, 하나 이상의 쿼리 및/또는 다른 파라미 터(예를 들어, 외부 온도, 시간, 피험자의 맥박, 피험자의 혈압 등)에 응답하는 사용자로부터의 하나 이상 의 응답 모두에 기초하여 변경될 수 있다. 또한, 질문 시리즈의 쿼리 유형 및 질문의 순서 및 결과 적인 추천은 특정 디바이스뿐만 아니라, 여러 위치의 많은 디바이스(예컨대, 온도계, 컴퓨팅 디바이 스 등)에 걸쳐서 이루어진 히스토리 쿼리의 통계적 분석에 의해 영향을 받을 수 있다. 이러한 분석 은 대규모 데이터 세트의 머신 러닝(learning) 및/또는 인공지능(AI) 알고리즘을 채용함으로써 더욱 향상될 수 있고, 따라서 질문 시리즈의 순서가 시간이 지남에 따라 더욱 효율적이 될 수 있으며, 사용자가 신뢰 할 수 있는 판독값에 신속하게 도달할 수 있게 해준다. 추천이 제공된 후, 컴퓨팅 디바이스는 사용자로부터 확인 응답을 수신할 수 있다. 확인 응답은 온도 계 또는 휴대용 장치의 화면에 표시되는 옵션일 수 있으며, 이는 사용자가 온도를 신뢰하고 의 심이 해결되었음을 나타낼 수 있게 한다. 사용자의 문의, 쿼리, 추천 및 사용자의 문제가 해결되었다는 확인 응답에 따라, 컴퓨팅 디바이스는 질문 시리즈에서 해당 질문 순서를 기억하고 우 선적으로 우선순위를 지정하여 향후 문제를 보다 신속하게 해결할 수 있다. 이러한 방식으로, 컴퓨팅 디바이스 는 여러 온도계에 걸친 사용자 및 피험자와의 이전 상호 작용으로부터 학습할 수 있다. 예를 들어, 질문 시리즈의 질문 시퀀스는 이전 상호작용의 이전 문의가 얼마나 빨리 해결되었는지에 기초할 수 있다. 따라 서, 쿼리 및 추천은 히스토리 데이터, 응답 및 사용자의 확인 응답의 분석에 의해 영향을 받는다. 도 8은 본 발명 한 특징에 따른 온도계 신뢰성을 증가시키기 위한 예시적인 프로세스 흐름을 도시한 것이다. 본 발명 방법의 예시적인 프로세스 흐름에서, 쿼리는 다수의 쿼리를 포함할 수 있다. 예를 들어, 쿼 리는 귀가 가려져 있는지, 귀 감염이 있는지, 해열제를 복용했는지 등과 같은 다수의 건강 정보 항목을 요 청할 수 있다. 쿼리는 또한 피험자 및/또는 사용자에 대한 정보(예: 최근 활동, 샤워, 운동 등)를 요청할 수도 있다. 쿼리가 휴대용 디바이스의 디스플레이에 표시된다고 가정해 보자. 쿼리 는 사용자가 선택할 수 있는 라디오 버튼 그룹으로 표시될 수 있다. 쿼리의 요청과 연관된 라 디오 버튼을 선택하는 것에 대한 응답으로, 추천 모듈에 의해 상응하는 추천이 생성된다. 본 발명의 일 특징에 따라, 도 9는 온도계 신뢰성을 증가시키기 위한 또 다른 예시적인 프로세스 흐름이다. 일 부 실시 예에서, 추천은 응답에 기초한 예상 온도를 포함할 수 있다. 예를 들어, 온도 모듈은 전술한 바와 같이, 현재 측정된 온도를 감지하기 위해 다수의 디바이스를 사용하는 사용자에 기초하여 상 이한 결과 카테고리의 문의를 수신할 수 있다. 귀 감지 온도계인 온도계로부터 현재 측정된 온도를 수신할 수 있다고 가정한다. 분석 모듈은 대체 온도계(예컨대, 이마, 팔 아래, 귀, 직장, 구강 등)의 제 조사, 모델 또는 유형과 같은 대체 온도계에 대한 정보를 요청할 수 있다. 사용자가 제공한 응답에 기초하여, 추천이 생성된다. 또한, 사용자가 대체 온도계가 구강 온도계라고 응답한다고 가정한다. 해당 추천은 현재 측정된 온도를 구강 온도의 상응하는 추정 온도로 변환하는 추정 온도를 포함할 수 있다. 본 발명의 또 다른 특징은, 본원 발명에서 제시된 기술의 일 측면을 구현하도록 구성된 프로세서-실행 가능한 명령어들을 포함하는 컴퓨터-판독 가능한 매체를 포함한다. 이러한 방식으로 고안된 컴퓨터 판독가능 매체 또 는 컴퓨터 판독가능 디바이스의 특징이 도 10에 도시되어 있으며, 여기서 구현은 컴퓨터 판독가능 데이터 가 인코딩된 CD-R, DVD-R, 플래시 드라이브, 하드 디스크 드라이브의 플래터 등과 같은 컴퓨터 판독가능 매체를 포함한다. 이 같이 인코딩된 컴퓨터 판독가능 데이터(예컨대, 도면 부호에 도시된 바와 같이 복수의 0 및 1을 포함하는 이진 데이터)는 차례로 본원 발명에 개시된 원칙 중 하나 이상에 따라 동작하도록 구성된 프로세서-실행 가능한 컴퓨터 명령어 세트를 포함한다. 이 같은 컴퓨터 판독가능 구현에서, 프로세서-실행 가능한 컴퓨터 명령어들은 도 3의 방법, 도 6의 방법, 도 7의 방법, 도 8의 방법 및/또는 도 9의 방법과 같은 본원 발명 방법을 수행하도록 구성될 수 있다. 본 발명의 다른 특징에서, 프로세서-실행 가능한 컴퓨터 명령어들은 도 1의 동작 환경과 같 은 시스템을 구현하도록 구성될 수 있다. 본원 발명에 제시된 기술들에 따라 동작하도록 구성되는 많은 컴퓨터 판독가능 매체들이 당업자에 의해 고안될 수 있다. 본 출원에서 사용되는 \"컴포넌트\", \"모듈\", \"시스템\", \"인터페이스\" 등의 용어는 일반적으로 하드웨어, 하드웨 어와 소프트웨어의 조합, 소프트웨어, 또는 실행 중인 소프트웨어와 같은 컴퓨터 관련 엔티티를 지칭하기 위한 것이다. 예를 들어, 구성 요소는 프로세서, 처리 장치, 객체, 실행 파일, 실행 스레드, 프로그램 또는 컴퓨터 에서 실행되는 프로세스가 될 수 있지만 이에 국한되지 않는다. 예를 들어, 컨트롤러에서 실행되는 애플리케이 션과 컨트롤러는 모두 컴포넌트일 수 있다. 프로세스 또는 실행 스레드 내에 존재하는 하나 이상의 컴포넌트 및 한 컴포넌트는 하나의 컴퓨터에서 로컬라이즈되거나 둘 이상의 컴퓨터 사이에 분산될 수 있다. 또한, 청구된 보호 대상 주제는 개시된 주제를 구현하기 위해 컴퓨터를 제어하기 위한 소프트웨어, 펌웨어, 하 드웨어 또는 이들의 임의의 조합을 생성하기 위해 표준 프로그래밍 또는 엔지니어링 기술을 사용하는 방법, 장 치 또는 제조물로서 구현된다. 본원 발명 명세서에서 사용된 \"'제조물(article of manufacture)\"이라는 용어는 컴퓨터 판독가능 장치, 캐리어(carrier) 또는 매체로부터 액세스할 수 있는 컴퓨터 프로그램을 포함하도록 의도 되었다. 물론, 청구된 보호 대상 주제의 범위 또는 발명 정신에서 벗어나지 않고 이러한 구성에 많은 수정이 이루어질 수 있다. \"컴퓨터 판독가능 미디어\"라는 용어는 통신 미디어를 포함한다. 통신 미디어는 일반적으로 반송파 또는 다른 전송 메커니즘과 같은 \"변조된 데이터 신호\" 내에 컴퓨터 판독 가능한 명령어 또는 다른 데이터를 구현하며, 임 의의 정보 전달 미디어를 포함한다. \"변조된 데이터 신호\"라는 용어에는 신호 내의 정보를 인코딩하는 방식으 로 하나 이상의 특징이 설정되거나 변경된 신호가 포함된다. 구조적 특징 또는 방법론적 행위와 관련된 언어로 보호 대상 주제가 설명되었지만, 첨부된 청구항의 보호 대상 주제가 반드시 상기 설명된 특정 특징 또는 행위로 제한되는 것은 아니라는 점을 이해해야 한다. 오히려, 위에 서 설명한 특정 특징 및 행위는 예시적인 측면으로서 개시된 것이다. 본원 발명 명세서에는 다양한 특징의 동 작이 제공된다. 하나 이상의 동작 또는 모든 동작이 설명되는 순서는 이러한 동작이 반드시 순서에 종속된다는 것을 암시하는 것으로 해석되어서는 안 된다. 이 같은 설명에 기초하여 다른 순서를 지정해도 좋다. 또한, 모 든 연산이 반드시 본원 명세서에 제공된 각 특징에 반드시 존재하는 것은 아니다. 본 발명 출원에서 사용되는 \"또는\"은 배타적인 \"또는\"이 아닌 포괄적인 \"또는\"을 의미하도록 의도된다. 또한, 포괄적인 \"또는\"은 임의의 조합(예를 들어, A, B 또는 이들의 임의의 조합)을 포함할 수 있다. 또한 본 발명 출원에서 사용되는 \"a\" 및 \"an\"은 달리 명시되지 않거나 문맥상 단수 형태를 가리키는 것이 분명하지 않은 한 일반적으로 \"하나 이상\"을 의미하는 것으로 해석된다. 또한, \"A\" 및/또는 \"B\" 중 적어도 하나는 일반적으로 \"A\" 또는 \"B\" 또는 \"A\" 및 \"B\" 모두 의미한다. 또한, \"포함하는\", \"갖는\", \"가지는\", \"와\" 또는 이들의 변형이 상세한 설명 또는 청구범위에 사용되는 경우, 이러한 용어는 \"포함하는\"이라는 용어와 유사한 방식으로 포괄적 인 것으로 의도된다. 또한, 달리 명시되지 않는 한, \"첫 번째\", \"두 번째\" 등은 시간적 측면, 공간적 측면, 순서 등을 암시하기 위한 것이 아니다. 오히려 이러한 용어는 기능, 요소, 항목 등에 대한 식별자, 이름 등으로 사용될 뿐이다. 예를 들어, 첫 번째 채널과 두 번째 채널은 일반적으로 채널 A와 채널 B 또는 두 개의 서로 다른 채널 또는 두 개의 동일한 채널 또는 같은 채널에 해당한다. 또한, \"포함하는(comprising)\", \"구성하다(comprises)\", \"포함하는 (including)\", \"포함하다(includes)\" 등은 일반적으로 \"포함하는(comprising)\" 또는 \"포함하는(including)\"을 의미하지만 이에 국한되지 않는다. 상기 설명한 실시 예들의 변형들 및 다른 특징들 및 기능들, 또는 이들의 대안들 또는 변형들은 다른 많은 다른 시스템 또는 애플리케이션과 바람직하게 결합될 수 있다는 것이 인식될 것이다. 또한, 당업자에 의해 현재 예 측할 수 없거나 예상하지 못한 다양한 대안, 수정, 변형 또는 개선이 후속적으로 이루어질 수 있으며, 이는 또 한 다음의 청구범위에 의해 포함되도록 의도된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2023-7033818", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명 한 특징에 따른 온도계 신뢰성 증가를 위한 시스템의 예시적인 동작 환경이다. 도 2는 본 발명 한 특징에 따른 온도계 신뢰성 증가를 위한 시스템의 예시적인 사용자 실시 예다. 도 3은 본 발명 한 특징에 따른 온도계 신뢰성을 증가시키기 위한 방법의 예시적인 공정 흐름도이다. 도 4는 본 발명 한 특징에 따른 온도계 신뢰성을 증가시키기 위한 방법의 예시적인 프레임 워크이다. 도 5는 본 발명 한 특징에 따른 온도계 신뢰성을 증가시키기 위한 시스템의 예시적인 휴대용 장치 실시 예다. 도 6은 본 발명 한 특징에 따른 온도계 신뢰성을 증가시키기 위한 분석에서 세션 제한을 위한 예시적인 공정 흐 름이다. 도 7은 본 발명 한 특징에 따른 온도계 신뢰성을 증가시키기 위한 반복 분석에 대한 예시적인 공정 흐름이다. 도 8은 본 발명 한 특징에 따른 온도계 신뢰성 증가와 관련된 다수의 요청을 갖는 쿼리(query)를 생성하기 위한 예시적인 프로세스 흐름이다. 도 9는 본 발명 한 특징에 따른 온도계 신뢰성을 증가시키기 위한 예상 온도를 제공하기 위한 예시적인 프로세 스 흐름이다. 도 10은 일 양상에 따라, 본원에 개시된 조항 중 하나 이상을 구현하도록 구성된 프로세서-실행 가능한 명령어 를 포함하는 컴퓨터-판독가능 매체 또는 컴퓨터-판독가능 디바이스의 예시적인 도면이다."}
