{"patent_id": "10-2020-0040431", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0121236", "출원번호": "10-2020-0040431", "발명의 명칭": "스마트 제어 장치", "출원인": "현대자동차주식회사", "발명자": "조재형"}}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스티어링 칼럼(steering column)으로부터 제1 방향으로 돌출되는 지지부;상기 지지부로부터 제2 방향으로 연장되는 연결부; 그리고,상기 연결부에 장착되어 제3 방향으로 다수의 조작계들이 배열되는 조작부를 포함하고,상기 각 조작계는,상기 연결부에 장착되거나 또는 상기 연결부로부터 분리되어 차량의 특정 기능을 제어하기 위한 사용자 입력을수신하는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 지지부는,X축 방향으로 돌출되고,상기 연결부는,Z축 방향으로 연장되며,상기 조작부는,Y축 방향으로 배열되는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 상기 지지부는,상기 스티어링 칼럼의 끝단에 배치된 스티어링 휠의 후방에 배치되어 상기 스티어링 휠 방향으로 경사지게 돌출되는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 지지부는,상기 스티어링 칼럼과의 연결 영역에 배치되어 상기 지지부가 후방으로 접혀지거나 또는 전방으로 펼쳐지도록상기 지지부를 회전시키는 방향 전환부가 배치되는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 상기 지지부는,상기 차량이 자율 주행 모드이면 상기 방향 전환부에 의해 후방으로 접혀지는 것을 특징으로 하는 스마트 제어장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서, 상기 지지부는,상기 연결부에 체결되도록 일측 끝단에 체결 돌기가 형성되는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 상기 지지부는,상기 스티어링 칼럼으로부터 돌출되는 다수의 지지바들을 포함하고,공개특허 10-2020-0121236-3-상기 지지바들은,서로 대칭되도록 배치되는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서, 상기 연결부는,상기 지지부에 체결되는 일 측면에 체결 홈이 형성되는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서, 상기 연결부는,상기 조작부가 배열되는 전면이 후방으로 휘어지는 곡률 반경을 갖는 곡면인 것을 특징으로 하는 스마트 제어장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서, 상기 연결부는,상기 스티어링 칼럼을 마주하는 측면이 외측 방향으로 휘어지는 곡률 반경을 갖는 곡면인 것을 특징으로 하는스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서, 상기 조작부는,상기 연결부의 전면을 따라 일정 간격으로 다수의 조작계들이 배열되는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항에 있어서, 상기 각 조작계는,전면에 배치되는 제1 스위치;상기 제1 스위치 주변에 위치하는 제2 스위치; 그리고,상기 제1, 제2 스위치를 감싸는 하우징을 포함하는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서, 상기 제1, 제2 스위치는,서로 다른 타입의 사용자 입력 스위치인 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1 항에 있어서, 상기 각 조작계는,다수의 사용자 입력 버튼들이 배열되고,상기 사용자 입력 버튼들은,사용자 설정에 따라 배열 위치가 변경되는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1 항에 있어서, 상기 각 조작계는,다수의 사용자 입력 버튼들이 배열되고,상기 사용자 입력 버튼들은,우선 순위에 따라 배열 위치 또는 버튼 크기가 변경되는 것을 특징으로 하는 스마트 제어 장치.공개특허 10-2020-0121236-4-청구항 16 제15 항에 있어서, 상기 각 조작계는,상기 우선 순위가 높은 사용자 입력 버튼을 중앙 영역에 배치하거나 또는 버튼 크기를 크게 변경하는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1 항에 있어서, 상기 각 조작계는,다수의 사용자 입력 버튼들이 배열되고,상기 사용자 입력 버튼들은,사용 불가인 다른 조작계에 포함된 사용자 입력 버튼으로 대체되는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1 항에 있어서, 상기 각 조작계는,다수의 사용자 입력 버튼들이 배열되고,상기 사용자 입력 버튼들 중 1개의 입력 버튼이 선택되면 상기 선택된 입력 버튼에 상응하는 차량의 제1 기능을제어하며,상기 사용자 입력 버튼들 중 적어도 2개의 입력 버튼이 동시에 선택되면 상기 동시에 선택된 입력 버튼들에 상응하는 차량의 제2 기능을 제어하는 것을 특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1 항에 있어서, 상기 각 조작계는,다른 조작계에 통신 연결하는 통신부를 포함하고,상기 통신부를 통해 상기 다른 조작계로 정보를 전송하거나 또는 상기 다른 조작부로부터 정보를 수신하는 것을특징으로 하는 스마트 제어 장치."}
{"patent_id": "10-2020-0040431", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "스티어링 칼럼(steering column);상기 스티어링 칼럼의 끝단에 배치된 스티어링 휠; 그리고,상기 스티어링 칼럼에 연결되어 상기 스티어링 휠의 주변에 배치되는 스마트 제어 장치를 포함하고,상기 스마트 제어 장치는,상기 스티어링 칼럼으로부터 제1 방향으로 돌출되는 지지부;상기 지지부로부터 제2 방향으로 연장되는 연결부; 그리고,상기 연결부에 장착되어 제3 방향으로 다수의 조작계들이 배열되는 조작부를 포함하며,상기 각 조작계는,상기 연결부에 장착되거나 또는 상기 연결부로부터 분리되어 차량의 특정 기능을 제어하기 위한 사용자 입력을수신하는 것을 특징으로 하는 차량."}
{"patent_id": "10-2020-0040431", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "차량의 스티어링 칼럼(steering column) 주변에 배치하여 차량의 다양한 기능을 제어할 수 있는 차량용 스마트 제어 장치에 관한 것으로, 스티어링 칼럼(steering column)으로부터 제1 방향으로 돌출되는 지지부, 지지부로부 터 제2 방향으로 연장되는 연결부, 그리고 연결부에 장착되어 제3 방향으로 다수의 조작계들이 배열되는 조작부 를 포함하고, 각 조작계는, 연결부에 장착되거나 또는 연결부로부터 분리되어 차량의 특정 기능을 제어하기 위한 사용자 입력을 수신할 수 있다. 여기서, 지지부는, X축 방향으로 돌출되고, 연결부는, Z축 방향으로 연장되며, 조작부는, Y축 방향으로 배열될 수 있다."}
{"patent_id": "10-2020-0040431", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량용 스마트 제어 장치에 관한 것으로, 더욱 상세하게는 차량의 스티어링 칼럼(steering column) 주변에 배치하여 차량의 다양한 기능을 제어할 수 있는 차량용 스마트 제어 장치에 관한 것이다."}
{"patent_id": "10-2020-0040431", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "미래형 멀티미디어 인공지능 차량은, 차량에 전기, 전자 및 정보통신 기술을 접목하여 차량을 보다 안전하고 안 락한 첨단 이동공간으로 실현하는 융합 기술, 차량을 첨단 정보기기로 진화시키는 정보 통신 기술 및 이에 상응 하는 유무형 멀티미디어 정보기술을 이용하여 실현할 수 있다. 또한, 안전 및 보안 영역의 기술과 지능형 기술은, 차량 네트워크를 기반으로 하여 멀티미디어 기술이 진화하여 보다 편리하게 운전자에게 최종 인포테인먼트(infotainment)를 제공하는 편안한 차량 및 편리한 차량으로 진화 할 것이다. 이와 같은 차량의 진화는, 필연적으로 운전자에 대한 정보 전달 기술의 발전으로 이어지고 있다. 한편, 운전자 정보 시스템(Driver Information System; DIS)은, 각종 멀티미디어 기기와 전자 제어 장치를 디지 털기술로 연결하는 차량용 네트워크 기술로서, 모니터 하나로 각종 멀티미디어 기기를 통제하고, 차량의 다양한 기능을 제어할 수 있다. 최근, 운전자 정보 시스템은, 사용자 인터페이스(UI)의 간소화를 위하여 차량에 사용되던 다수의 제어 버튼을 조그 다이얼(jog-dial) 등으로 대체하고 있다. 하지만, 제어 메뉴가 점점 증가하면서 많은 기능을 제어하기 위해서는, 더욱 많은 제어 버튼들이 필요하게 되므 로, 다수의 제어 버튼들이 효율적으로 배치되지 못하거나 또는 다수의 제어 버튼을 포함하는 차량 제어 장치가 복잡한 구조를 가질 경우, 운전자 편의성 및 안전성이 저하되는 문제가 발생할 수 있다. 따라서, 향후, 차량의 다양한 기능을 제어할 때, 운전자 편의성 및 안전성이 개선될 수 있는 차량용 스마트 제 어 장치의 개발이 요구되고 있다."}
{"patent_id": "10-2020-0040431", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 차량의 스티어링 칼럼(steering column) 주변에 장착 또는 분리가 가능한 다수의 조작계들을 배치함 으로써, 운전자가 편리하고 안전하게 차량의 다양한 기능들을 제어할 수 있는 차량용 스마트 제어 장치를 제공 하는데 있다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2020-0040431", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0040431", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 기술적 과제를 해결하기 위하여, 본 발명의 일 실시예에 따른 스마트 제어 장치는, 스티어링 칼럼 (steering column)으로부터 제1 방향으로 돌출되는 지지부, 지지부로부터 제2 방향으로 연장되는 연결부, 그리 고 연결부에 장착되어 제3 방향으로 다수의 조작계들이 배열되는 조작부를 포함하고, 각 조작계는, 연결부에 장 착되거나 또는 연결부로부터 분리되어 차량의 특정 기능을 제어하기 위한 사용자 입력을 수신할 수 있다. 여기서, 지지부는, X축 방향으로 돌출되고, 연결부는, Z축 방향으로 연장되며, 조작부는, Y축 방향으로 배열될 수 있다. 그리고, 지지부는, 스티어링 칼럼의 끝단에 배치된 스티어링 휠의 후방에 배치되어 스티어링 휠 방향으로 경사 지게 돌출될 수 있다. 또한, 지지부는, 스티어링 칼럼과의 연결 영역에 배치되어 지지부가 후방으로 접혀지거나 또는 전방으로 펼쳐지 도록 지지부를 회전시키는 방향 전환부가 배치될 수 있다. 이어, 지지부는, 스티어링 칼럼으로부터 돌출되는 다수의 지지바들을 포함하고, 지지바들은, 서로 대칭되도록 배치될 수 있다. 다음, 연결부는, 조작부가 배열되는 전면이 후방으로 휘어지는 곡률 반경을 갖는 곡면일 수 있다. 또한, 연결부는, 스티어링 칼럼을 마주하는 측면이 외측 방향으로 휘어지는 곡률 반경을 갖는 곡면일 수도 있다. 그리고, 연결부는, 조작계가 장착되는 영역에 배치되어 조작계를 좌/우/상/하 방향으로 회전시키는 방향 전환부 가 더 배치될 수 있다. 이어, 조작부는, 연결부의 전면을 따라 다수의 조작계들이 일정 간격으로 배열될 수 있다. 또한, 각 조작계는, 전면에 배치되는 제1 스위치, 제1 스위치 주변에 위치하는 제2 스위치, 그리고 제1, 제2 스 위치를 감싸는 하우징을 포함할 수 있다. 여기서, 제1, 제2 스위치는, 서로 다른 타입의 사용자 입력 스위치일 수 있다. 그리고, 각 조작계는, 다수의 사용자 입력 버튼들이 배열되고, 사용자 입력 버튼들은, 사용자 설정에 따라 배열 위치가 변경될 수 있다. 경우에 따라, 각 조작계는, 다수의 사용자 입력 버튼들이 배열되고, 사용자 입력 버튼들은, 우선 순위에 따라 배열 위치 또는 버튼 크기가 변경될 수 있다. 다른 경우로서, 각 조작계는, 다수의 사용자 입력 버튼들이 배열되고, 사용자 입력 버튼들은, 사용 불가인 다른 조작계에 포함된 사용자 입력 버튼으로 대체될 수 있다. 또 다른 경우로서, 각 조작계는, 다수의 사용자 입력 버튼들이 배열되고, 사용자 입력 버튼들 중 1개의 입력 버 튼이 선택되면 선택된 입력 버튼에 상응하는 차량의 제1 기능을 제어하며, 사용자 입력 버튼들 중 적어도 2개의 입력 버튼이 동시에 선택되면 동시에 선택된 입력 버튼들에 상응하는 차량의 제2 기능을 제어할 수 있다. 그리고, 각 조작계는, 다른 조작계에 통신 연결하는 통신부를 포함하고, 통신부를 통해 다른 조작계로 정보를 전송하거나 또는 다른 조작계로부터 정보를 수신할 수 있다. 또한, 본 발명의 일 실시예에 따른 차량은, 스티어링 칼럼(steering column), 스티어링 칼럼의 끝단에 배치된 스티어링 휠, 그리고 스티어링 칼럼에 연결되어 스티어링 휠의 주변에 배치되는 스마트 제어 장치를 포함하고, 스마트 제어 장치는, 스티어링 칼럼으로부터 제1 방향으로 돌출되는 지지부, 지지부로부터 제2 방향으로 연장되 는 연결부, 그리고 연결부에 장착되어 제3 방향으로 다수의 조작계들이 배열되는 조작부를 포함하며, 각 조작계 는, 연결부에 장착되거나 또는 연결부로부터 분리되어 차량의 특정 기능을 제어하기 위한 사용자 입력을 수신할 수 있다."}
{"patent_id": "10-2020-0040431", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같이 구성되는 본 발명의 적어도 하나의 실시예에 관련된 스마트 제어 장치는, 차량의 스티어링 칼럼 주 변에 장착 또는 분리가 가능한 다수의 조작계들을 배치함으로써, 운전자가 편리하고 안전하게 차량의 다양한 기 능들을 제어할 수 있다. 또한, 본 발명은, 운전자가 스티어링 휠로부터 손을 떼지 않고도 다수의 조작계를 안전하고 편리하게 조작할 수 있다. 또한, 본 발명은, 차량 전방을 향하는 운전자의 시야 범위 내에 조작계들이 위치하므로 운전 중 운전자의 주의 분산을 최소화할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2020-0040431", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0040431", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재 된 \"…부\", \"…기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드 웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 이하, 도 1 내지 도 19를 참조하여 본 발명의 실시예들에 적용될 수 있는 차량용 스마트 제어 장치 및 그를 포 함하는 차량에 대해 상세히 설명한다. 도 1 내지 도 3은 본 발명의 일 실시예에 따른 차량용 스마트 제어 장치를 설명하기 위한 도면로서, 도 1은 차 량용 스마트 제어 장치의 전면을 보여주는 도면이고, 도 2는 차량용 스마트 제어 장치의 상면을 보여주는 도면 이며, 도 3은 차량용 스마트 제어 장치의 분해도이다. 도 1 내지 도 3에 도시된 바와 같이, 본 발명의 차량용 스마트 제어 장치는, 지지부, 연결부, 그리고 조작부를 포함할 수 있다. 여기서, 지지부는, 스티어링 칼럼(steering column)으로부터 제1 방향으로 돌출되고, 연결부는, 지지부로부터 제2 방향으로 연장되며, 다수의 조작부는, 연결부에 장착되어 제3 방향으로 배열 될 수 있다. 즉, 지지부, 연결부, 그리고 조작부는, 각각 서로 다른 방향으로 배치될 수 있다. 일 예로, 지지부는, X축 방향으로 돌출되고, 연결부는, Z축 방향으로 연장되며, 조작부는, Y축 방향으로 배열될 수 있다. 그리고, 지지부는, 스티어링 칼럼의 끝단에 배치된 스티어링 휠의 후방에 배치되어 스티어링 휠 방향으로 경사지게 돌출될 수 있다. 그 이유는, 운전자 방향으로 조작부의 조작계들이 집중되도록 배치되어 운전자가 조작계들을 쉽고 편리하 게 조작할 수 있을 뿐만 아니라 조작계에 표시되는 정보의 시인성을 향상시켜 안전성을 높이기 위함이다. 일 예로, 지지부는, 스티어링 휠을 마주하는 지지부의 측면과 스티어링 칼럼의 표면 사이의 각도가 예각을 갖도록 경사지게 돌출될 수 있는데, 이에 한정되지는 않는다. 그리고, 지지부는, 스티어링 칼럼에 근접할수록 폭이 증가하는 바(bar) 형상을 가질 수 있다. 그 이유는, 지지부가 외부의 충격에도 안정적으로 스티어링 칼럼에 고정되어 위치 변동이나 휨 현상을 방지하기 위함이다. 또한, 지지부는, 스티어링 칼럼과의 연결 영역에 배치되어 지지부가 후방으로 접혀지거나 또는 전방으로 펼쳐지도록 지지부를 회전시키는 방향 전환부가 배치될 수도 있다. 그 이유는, 운전자가 직접 수동 운전을 하지 않는 경우 또는 조작계를 통한 차량 기능 제어가 필요하지 않는 경 우에 운전 공간 확보 및 스마트 제어 장치의 손상 방지를 위하여 지지부를 후방으로 접혀지게 하기 위함이 다. 일 예로, 지지부는, 차량이 자율 주행 모드이면 방향 전환부에 의해 후방으로 접혀질 수 있다. 여기서, 방향 전환부는, 운전자 입력 제어 신호 또는 자율 주행 모드에 상응하는 자동 제어 신호에 의해 구동될 수 있다. 그리고, 지지부는, 후방으로 접혀질 때, 지지부의 측면과 스티어링 칼럼의 표면이 서로 마주하도 록 접혀질 수 있는데, 이에 한정되지는 않는다. 또한, 지지부는, 외부로부터 특정 힘이 가해지면 몸체가 분리되는 적어도 하나의 분리면을 가질 수 있다. 여기서, 지지부는, 몸체가 분리될 때, 몸체의 분리면이 곡면을 가질 수 있다. 그 이유는, 지지부가 외부로 돌출된 지지바 형상을 가지므로, 외부 충격에 의해 부러질 경우, 부러진 면이 날카롭거나 절단면이 거칠면 운전자에게 상해를 입힐 수 있기 때문이다. 또한, 지지부는, 연결부에 체결되도록 일측 끝단에 체결 돌기가 형성될 수 있는데, 이에 한정되지는 않는다. 여기서, 체결 돌기는, 연결부의 체결 홈 내에 삽입되어 결합될 수 있다. 이어, 지지부는, 연결부에 체결되는 일측 끝단이 스티어링 칼럼에 연결된 스티어링 휠에 중 첩되지 않도록 노출될 수 있다. 그 이유는, 연결부에 체결되는 지지부의 일측 끝단이 스티어링 칼럼에 연결된 스티어링 휠에 중첩될 경우, 조작부의 조작계들 위치가 스티어링 휠에 근접하게 배치되어 조작계를 조작하고자 하는 운전자의 편의성이 저하되기 때문이다. 일 예로, 지지부의 길이는, 스티어링 휠의 반경보다 더 길 수 있다. 그 이유는, 지지부 일측 끝단의 연결부에 배치되는 조작부의 조작계들 위치를 운전자의 편의성 에 최적화하도록 배열하기 위함이다. 또한, 지지부는, 스티어링 칼럼으로부터 돌출되는 다수의 지지바들을 포함할 수 있다. 여기서, 지지바들은, 서로 대칭되도록 배치될 수 있다. 그 이유는, 지지부 일측 끝단의 연결부에 배치되는 조작계들이 운전자의 전방 시야 범위 이내에 위치 하도록 하여 운전자가 쉽고 편안하게 인지하도록 하기 위함이다. 예를 들면, 지지부는, 스티어링 칼럼의 중심축을 기준으로 좌측 방향으로 돌출되는 제1 지지바와, 스 티어링 칼럼의 중심축을 기준으로 우측 방향으로 돌출되는 제2 지지바를 포함할 수 있다. 여기서, 제1, 제2 지지바는, 서로 대칭일 수 있다. 다음, 연결부는, 지지부에 체결되는 일 측면에 체결 홈이 형성될 수 있는데, 이에 한정되지는 않는다. 여기서, 체결 홈은, 지지부의 일측 끝단에 형성되는 체결 돌기를 수용하여 결합될 수 있다. 그리고, 연결부는, 지지부의 돌출 방향에 대해 수직한 방향으로 배치되고, 전면 또는 측면이 모두 편 평한 평면일 수 있다. 경우에 따라, 연결부는, 조작부가 배열되는 전면이 후방으로 휘어지는 곡률 반경을 갖는 곡면일 수 있다. 그 이유는, 연결부의 전면에 배치되는 조작부의 조작계들이 운전자의 전방 시야 범위 이내에 위치하 도록 하여 운전자가 쉽고 편안하게 인지하도록 하기 위함이다. 예를 들면, 연결부는, 조작부가 배열되는 전면이 후방으로 휘어지는 제1 곡률 반경을 갖는 곡면이고, 전면에 대응하는 후면이 후방으로 휘어지는 제2 곡률 반경을 갖는 곡면일 수 있는데, 이에 한정되지는 않는다. 여기서, 전면의 제1 곡률 반경은, 후면의 제2 곡률 반경보다 더 클 수 있다. 그 이유는, 연결부의 구조가 외부 충격에도 부러지거나 이탈되지 않도록 구조적 강성을 갖게 하기 위함이 다. 또한, 연결부는, 스티어링 칼럼을 마주하는 측면이 외측 방향으로 휘어지는 곡률 반경을 갖는 곡면일 수 있다. 그 이유는, 연결부에 배치되는 조작부의 조작계들이 스티어링 휠의 주변부를 따라 운전자의 전방 시야 범위 이내에 위치하도록 하여 운전자가 쉽고 편안하게 인지하도록 하기 위함이다. 다음, 연결부는, 스티어링 칼럼에 연결된 스티어링 휠에 중첩되지 않도록 노출되도록 배치될 수 있다. 그 이유는, 연결부가 스티어링 휠에 중첩될 경우, 조작부의 조작계들 위치가 스티어링 휠 후 방에 배치되어 조작계를 조작하고자 하는 운전자의 편의성 및 시인성이 저하되기 때문이다. 경우에 따라, 연결부는, 조작부의 조작계가 장착되는 영역에 배치되어 조작계를 좌/우/상/하 방향으 로 회전시키는 방향 전환부가 배치될 수도 있다. 그 이유는, 운전자가 방향 전환부를 이용하여 조작계의 정보 표시 방향을 편리하게 조절할 수 있도록 운전자 편 의성을 제공하기 위함이다. 다음, 조작부의 각 조작계는, 연결부에 장착되거나 또는 연결부로부터 분리되어 차량의 특정 기 능을 제어하기 위한 사용자 입력을 수신할 수 있다. 여기서, 조작부는, 연결부의 전면을 따라 일정 간격으로 다수의 조작계들이 배열될 수 있다. 경우에 따라서, 조작부는, 운전자의 편의에 따라 서로 다른 간격으로 다수의 조작계들이 배열될 수도 있다. 그리고, 각 조작계는, 전면에 배치되는 제1 스위치, 제1 스위치 주변에 위치하는 제2 스위치, 그리고 제1, 제2 스위치를 감싸는 하우징을 포함할 수 있다. 여기서, 제1, 제2 스위치는, 서로 다른 타입의 사용자 입력 스위치일 수 있는데, 이에 한정되지는 않는다. 예를 들면, 제1 스위치는, 터치식 스위치이고, 제2 스위치는, 물리식 스위치일 수 있다. 여기서, 제1 스위치는, 다수의 터치 버튼을 포함할 수 있고, 제2 스위치는, 회전 방향에 따라 서로 다른 기능을 제어하는 로터리 스위치를 포함할 수도 있다. 경우에 따라, 제1, 제2 스위치는, 서로 동일한 타입의 사용자 입력 스위치일 수도 있다. 이어, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들은, 사용자 설정에 따 라 배열 위치가 변경될 수도 있다. 그 이유는, 운전자 편의성을 높이기 위함이다. 또한, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들은, 우선 순위에 따라 배열 위치 또는 버튼 크기가 변경될 수도 있다. 그 이유는, 운전자 편의성을 높이기 위함이다. 예를 들면, 각 조작계는, 우선 순위가 높은 사용자 입력 버튼을 중앙 영역에 배치하거나 또는 버튼 크기를 크게 변경할 수 있다. 또한, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들은, 사용 불가인 다른 조작계에 포함된 사용자 입력 버튼으로 대체될 수도 있다. 그 이유는, 일부 조작계가 고장이 난 경우, 고장난 조작계에 포함된 차량 제어 기능을 정상적인 조작계에서 사 용할 수 있도록 함으로써, 운전자 편의성을 높일 수 있기 때문이다. 또한, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들 중 1개의 입력 버튼이 선택되면 선택된 입력 버튼에 상응하는 차량의 제1 기능을 제어할 수 있고, 사용자 입력 버튼들 중 적어도 2개 의 입력 버튼이 동시에 선택되면 동시에 선택된 입력 버튼들에 상응하는 차량의 제2 기능을 제어할 수도 있다. 그 이유는, 하나의 조작계에 차량 제어를 위한 다양한 사용자 입력 버튼들을 최대한 많이 제공함으로써, 최소 개수의 조작계만으로도 최대의 제어 기능을 제공할 수 있어 효율성을 높이기 때문이다. 다음, 각 조작계는, 다른 조작계에 통신 연결하는 통신부를 포함할 수도 있는데, 통신부를 통해 다른 조작계로 정보를 전송하거나 또는 다른 조작계로부터 정보를 수신할 수 있다. 그 이유는, 운전자 편의성 및 조작계의 활용성을 높이기 위함이다. 이와 같이, 본 발명은, 차량의 스티어링 칼럼 주변에 장착 또는 분리가 가능한 다수의 조작계들을 배치함으로써, 운전자가 편리하고 안전하게 차량의 다양한 기능들을 제어할 수 있다. 또한, 본 발명은, 운전자가 스티어링 휠로부터 손을 떼지 않고도 다수의 조작계를 안전하고 편리하게 조작할 수 있다. 또한, 본 발명은, 차량 전방을 향하는 운전자의 시야 범위 내에 조작계들이 위치하므로 운전 중 운전자의 주의 분산을 최소화할 수 있다. 도 4 내지 도 6은 차량용 스마트 제어 장치의 지지부를 설명하기 위한 도면이다. 도 4에 도시된 바와 같이, 지지부는, 스티어링 칼럼으로부터 외측 방향으로 돌출될 수 있다. 여기서, 지지부는, 스티어링 휠을 마주하는 지지부의 측면과 스티어링 칼럼의 표면 사이의 각도 θ가 예각을 갖도록 경사지게 돌출될 수 있다. 그 이유는, 운전자 방향으로 조작계들이 집중되도록 배치되어 운전자가 조작계들을 쉽고 편리하게 조작할 수 있 을 뿐만 아니라 조작계에 표시되는 정보의 시인성을 향상시켜 안전성을 높이기 위함이다. 그리고, 지지부는, 스티어링 칼럼에 근접할수록 폭이 증가하는 바(bar) 형상을 가질 수 있다. 예를 들면, 지지부는, 외부 일측 끝단의 제1 폭 w1보다 스티어링 칼럼에 근접하는 타측 끝단의 제2 폭 w2이 더 넓은 구조를 가질 수 있다. 그 이유는, 지지부가 외부의 충격에도 안정적으로 스티어링 칼럼에 고정되어 위치 변동이나 휨 현상을 방지하기 위함이다. 한편, 도 5에 도시된 바와 같이, 지지부는, 스티어링 칼럼과의 연결 영역에 배치되어 지지부가 후방으로 접혀지거나 또는 전방으로 펼쳐지도록 지지부를 회전시키는 방향 전환부가 배치될 수 있다. 여기서, 지지부는, 후방으로 접혀질 때, 지지부의 측면과 스티어링 칼럼의 표면이 서로 마주하도록 접혀질 수 있는데, 이에 한정되지는 않는다. 또한, 지지부는, 차량이 자율 주행 모드이면 방향 전환부에 의해 후방으로 접혀질 수 있다. 여기서, 방향 전환부는, 운전자 입력 제어 신호 또는 자율 주행 모드에 상응하는 자동 제어 신호에 의해 구동될 수 있다. 이처럼, 방향 전환부를 배치하는 이유는, 운전자가 직접 수동 운전을 하지 않는 경우 또는 조작부의 조작계를 통한 차량 기능 제어가 필요하지 않는 경우에 운전 공간 확보 및 스마트 제어 장치의 손상 방지를 위 하여 지지부를 후방으로 접혀지게 하기 위함이다. 한편, 도 6에 도시된 바와 같이, 지지부는, 외부로부터 특정 힘이 가해지면 몸체가 분리되는 적어도 하나 의 분리면을 가질 수 있다. 여기서, 지지부는, 몸체가 분리될 때, 몸체의 분리면이 곡면을 가질 수 있다. 그 이유는, 지지부가 외부로 돌출된 지지바 형상을 가지므로, 외부 충격에 의해 부러질 경우, 부러진 면이 날카롭거나 절단면이 거칠면 운전자에게 상해를 입힐 수 있기 때문이다. 이와 같이, 본 발명의 지지부는, 지지대와 쉬라우드 연결 부위에 자율주행 모드일 때 운전자의 공간을 확보할 수 있는 방향으로 접힐 수 있는 구조를 가질 수 있다. 또한, 본 발명의 지지부는, 사고 시 충돌이 발생하여 부려졌을 때, 상해를 입힐 수 있는 날카로운 절단면이 발 생하지 않거나 운전자에게 닿지 않도록 설계할 수 있다. 예를 들면, 운전자에게 상해를 입힐 가능성이 없는 스티어링 휠 뒤편의 영역에서 부러지거나, 법규에 정의된 충 돌 테스트를 통과할 수 있는 강성을 갖도록 설계할 수 있다. 도 7은 차량용 스마트 제어 장치의 지지부와 연결부의 체결 과정을 설명하기 위한 도면이다. 도 7에 도시된 바와 같이, 지지부는, 연결부에 체결되도록 일측 끝단에 체결 돌기가 형성될 수 있다. 여기서, 체결 돌기는, 연결부의 체결 홈 내에 삽입되어 결합될 수 있다. 이때, 체결 돌기의 길이는, 체결 홈의 깊이를 고려하여 결정될 수 있다. 일 예로, 체결 돌기는, 결속력을 높이기 위하여 나사 형상을 가질 수도 있다. 하지만, 본 발명은, 지지부와 연결부의 체결을 위하여 체결 돌기 및 체결 홈 이외에도 다양한 체결 장치 또는 접착제 등을 이용하여 결합시킬 수도 있다. 도 8 및 도 9는 차량용 스마트 제어 장치의 연결부를 설명하기 위한 도면이다. 도 8에 도시된 바와 같이, 연결부는, 조작계가 배열되는 전면이 후방으로 휘어지는 곡률 반경을 갖는 곡면일 수 있다. 그 이유는, 연결부의 전면에 배치되는 조작계들이 운전자의 전방 시야 범위 이내에 위치하도록 하여 운전 자가 쉽고 편안하게 인지하도록 하기 위함이다. 예를 들면, 연결부는, 조작계가 배열되는 전면이 후방으로 휘어지는 제1 곡률 반경 R1을 갖는 곡면이 고, 전면에 대응하는 후면이 후방으로 휘어지는 제2 곡률 반경 R2을 갖는 곡면일 수 있다. 여기서, 전면의 제1 곡률 반경 R1은, 후면의 제2 곡률 반경 R2보다 더 클 수 있다. 그 이유는, 연결부의 구조가 외부 충격에도 부러지거나 이탈되지 않도록 구조적 강성을 갖게 하기 위함이 다. 또한, 도 9에 도시된 바와 같이, 연결부는, 스티어링 칼럼을 마주하는 측면이 외측 방향으로 휘어지 는 곡률 반경을 갖는 곡면일 수 있다. 그 이유는, 연결부에 배치되는 조작계들이 스티어링 휠의 주변부를 따라 운전자의 전방 시야 범위 이 내에 위치하도록 하여 운전자가 쉽고 편안하게 인지하도록 하기 위함이다. 다음, 연결부는, 스티어링 칼럼에 연결된 스티어링 휠에 중첩되지 않도록 노출되도록 배치될 수 있다. 그 이유는, 연결부가 스티어링 휠에 중첩될 경우, 조작부의 조작계들 위치가 스티어링 휠 후 방에 배치되어 조작계를 조작하고자 하는 운전자의 편의성 및 시인성이 저하되기 때문이다. 또한, 조작부는, 연결부의 전면을 따라 일정 간격으로 다수의 조작계들이 배열될 수 있다. 즉, 조작계들 사이의 간격 d1, d2는, 서로 동일할 수 있다. 경우에 따라, 조작부는, 운전자의 편의에 따라 서로 다른 간격으로 다수의 조작계들이 배열될 수도 있다. 도 10은 차량용 스마트 제어 장치의 조작부를 설명하기 위한 도면이다. 도 10에 도시된 바와 같이, 조작부의 각 조작계는, 전면에 배치되는 제1 스위치, 제1 스위치 주 변에 위치하는 제2 스위치, 그리고 제1, 제2 스위치(310, 320)를 감싸는 하우징을 포함할 수 있다. 여기서, 제1, 제2 스위치(310, 320)는, 서로 다른 타입의 사용자 입력 스위치일 수 있는데, 이에 한정되지는 않 는다. 예를 들면, 제1 스위치는, 터치식 스위치이고, 제2 스위치는, 물리식 스위치일 수 있다. 여기서, 제1 스위치는, 다수의 터치 버튼을 포함할 수 있고, 제2 스위치는, 회전 방향에 따라 서로 다른 기능을 제어하는 로터리 스위치를 포함할 수도 있다. 경우에 따라, 제1, 제2 스위치(310, 320)는, 서로 동일한 타입의 사용자 입력 스위치일 수도 있다. 그리고, 각 조작계는, 터치식 디스플레이를 통해 좌우 스와이핑, 상하 스와이핑, 터치 등의 입력 동작을 수행할 수 있으며, 이를 이용해 다수의 기능을 좁은 영역에서 사용 가능하다. 이어, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들은, 사용자 설정에 따 라 배열 위치가 변경될 수도 있다.그 이유는, 운전자 편의성을 높이기 위함이다. 또한, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들은, 우선 순위에 따라 배열 위치 또는 버튼 크기가 변경될 수도 있다. 그 이유는, 운전자 편의성을 높이기 위함이다. 예를 들면, 각 조작계는, 우선 순위가 높은 사용자 입력 버튼을 중앙 영역에 배치하거나 또는 버튼 크기를 크게 변경할 수 있다. 또한, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들은, 사용 불가인 다른 조작계에 포함된 사용자 입력 버튼으로 대체될 수도 있다. 그 이유는, 일부 조작계가 고장이 난 경우, 고장난 조작계에 포함된 차량 제어 기능을 정상적인 조작계에서 사 용할 수 있도록 함으로써, 운전자 편의성을 높일 수 있기 때문이다. 또한, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들 중 1개의 입력 버튼이 선택되면 선택된 입력 버튼에 상응하는 차량의 제1 기능을 제어할 수 있고, 사용자 입력 버튼들 중 적어도 2개 의 입력 버튼이 동시에 선택되면 동시에 선택된 입력 버튼들에 상응하는 차량의 제2 기능을 제어할 수도 있다. 그 이유는, 하나의 조작계에 차량 제어를 위한 다양한 사용자 입력 버튼들을 최대한 많이 제공함으로써, 최소 개수의 조작계만으로도 최대의 제어 기능을 제공할 수 있어 효율성을 높이기 때문이다. 이와 같이, 본 발명의 각 조작계 기능은, 기본 설정값 외에도 사용자가 설정하여 직접 커스터마이징 가능하며 상호 교환적이다. 또한, 중요도에서 선순위에 있는 핵심 기능(예를 들면, 시동버튼)이나 다른 조작계의 기능이 오류로 인해 사용 불가할 경우, 이 기능을 대체하여 디스플레이에 표시할 수도 있다. 또한, 조작계의 하나의 화면을 분할하여 사용할 수도 있고, 멀티 터치 등과 같이 다수의 조작계에 동시에 사용 자 입력을 수행하여 제3의 특정 기능을 사용할 수도 있다. 예를 들면, 상하로 배열되어 있는 1번 조작계와 2번 조작계에 각각 검지와 엄지를 대고 모으는 동작을 수행하면, 두 조작계의 기능이 스왑(swap)되는 방식으로 작동할 수 있다. 도 11(a) 내지 도 11(f)는 차량의 다양한 기능을 제어하는 조작계를 보여주는 도면이다. 도 11(a) 내지 도 11(f)에 도시된 바와 같이, 각 조작계는, 스마트 제어 장치에 장착되거나 또는 스마트 제어 장치로부터 분리되어 차량의 특정 기능을 제어하기 위한 사용자 입력을 수신할 수 있다. 여기서, 조작계는, 차량의 AVN(Audio, Video, Navigation) 기능, HVAC(Heating, Ventilation & Air Conditioning) 기능, LAMP 기능, WIPER 기능, DRIVE MODE 기능, C/PAD(CRESH PAD) LWR 기능 등과 같이 다양한 기능들을 제어할 수 있는 제어 입력 장치일 수 있다. 각 조작계는, 하나의 화면에 다수의 기능을 조작할 수 있는 사용자 입력 버튼들을 포함할 수 있다. 이와 같이, 본 발명은, 스티어링 칼럼(혹은 쉬라우드)에서 뻗어나온 지지대에 다수의 조작계를 수직 혹은 스티 어링 휠 곡면을 따라 배열한 어셉블리를 결합한 형태이다. 각 조작계의 표시/조작면은, 운전자가 시인할 수 있는 방향으로 향해 있으며, 시인성 및 조작성을 고려하여 적 절한 각도로 조금씩 조절되어 있다. 각 조작계는, 터치 디스플레이에 물리식 로터리 버튼을 결합한 형태를 기본으로 하며, 터치키+로터리, 하드키+ 로터리 등의 다양한 형태를 가질 수 있다. 또한, 각 조작계는, 스티어링 휠에서 손을 떼지 않고 조작할 수 있고, 정면에서 시선을 크게 돌리지 않아도 되 는 범위에 존재하기 때문에 운전 중 주의분산을 최소화하며 사용 가능하다. 도 12 내지 도 17은 조작계의 조작 방식을 설명하기 위한 도면이다. 도 12에 도시된 바와 같이, 차량의 AVN 기능 제어를 위한 조작계는, 회전 동작을 통해 볼륨을 제어할 수도 있고, 상하 스와이핑 동작을 통해 다른 기능을 선택할 수도 있다.또한, 차량의 AVN 기능 제어를 위한 조작계는, 터치 동작을 통해 특정 기능을 선택할 수도 있고, 좌우 스와이핑 동작을 통해 라디오 채널 변경을 제어할 수도 있다. 이어, 도 13에 도시된 바와 같이, 차량의 HVAC 기능 제어를 위한 조작계는, 터치 동작을 통해 특정 기능을 선택 할 수도 있고, 터치 동작을 통해 회전 모드 설정을 수행할 수도 있다. 또한, 차량의 HVAC 기능 제어를 위한 조작계는, 회전 동작을 통해 온도 조절 기능을 제어할 수도 있고, 회전 동 작을 통해 바람 세기를 제어할 수도 있다. 그리고, 도 14에 도시된 바와 같이, 차량의 램프 기능 제어를 위한 조작계는, 회전 동작을 통해 램프 모드 기능 을 선택할 수도 있고, 터치 동작을 통해 램프의 하이빔 기능을 수행할 수도 있다. 다음, 도 15에 도시된 바와 같이, 차량의 와이퍼 기능 제어를 위한 조작계는, 회전 동작을 통해 와이퍼 속도를 제어할 수도 있고, 터치 동작을 통해 다른 기능을 선택할 수도 있으며, 좌우 스와이핑 동작을 통해 차량 후면 와이퍼를 제어할 수도 있다. 그리고, 도 16에 도시된 바와 같이, 차량의 드라이브 모드 기능 제어를 위한 조작계는, 회전 동작을 통해 드라 이브 모드 기능을 선택할 수도 있고, 터치 동작을 통해 드라이브 모드 기능을 선택할 수도 있다. 이어, 도 17에 도시된 바와 같이, 차량의 C/PAD(CRESH PAD) LWR 기능 제어를 위한 조작계는, 회전 동작을 통해 래오스탯(rheostat) 기능을 제어할 수도 있고, 상하 스와이핑 동작을 통해 다른 기능을 선택할 수도 있으며, 좌 우 스와이핑 동작을 통해 선택된 기능 제어를 수행할 수도 있다. 이와 같이, 본 발명은, 좌우 스와이핑, 상하 스와이핑, 터치 등의 입력 동작 이외에도 다양한 입력 동작을 통해 조작계를 조작할 수 있다. 도 18은 조작계들 사이의 통신 과정을 설명하기 위한 도면이다. 도 18에 도시된 바와 같이, 각 조작계는, 하나의 제어기로 통합하여 전체 제어가 가능하거나, 또는 무선으로 서 로 통신하여 정보를 교환 및 상호작용 가능하도록 설계할 수도 있다. 여기서, 조작계는, 스마트 제어 장치의 연결부에서 탈착하여 단독으로 활용할 수도 있다. 그리고, 각 조작계는, 다른 조작계에 통신 연결하는 통신부를 포함할 수도 있는데, 통신부를 통해 다 른 조작계로 정보를 전송하거나 또는 다른 조작계로부터 정보를 수신할 수 있다. 그 이유는, 운전자 편의성 및 조작계의 활용성을 높이기 위함이다. 일 예로, 제1 조작계(300a)는, 통신부를 통해 제2 조작계(300b)로 정보를 전송하거나 또는 제2 조작계 (300b)로부터 정보를 수신할 수도 있다. 이와 같이, 본 발명은, 무선 통신을 통해 조작계들간에 서로 통신을 수행하여 정보를 교환 및 상호작용할 수도 있다. 또한, 본 발명의 각 조작계는, 다른 조작계에 의해 제어될 수도 있고, 다른 조작계를 직접 제어할 수도 있다. 도 19는 본 발명의 일 실시예에 따른 차량용 스마트 제어 장치를 포함하는 차량을 설명하기 위한 도면이다. 도 19에 도시된 바와 같이, 차량은, 스티어링 칼럼(steering column), 스티어링 칼럼의 끝단에 배치 된 스티어링 휠, 그리고 스티어링 칼럼에 연결되어 스티어링 휠의 주변에 배치되는 스마트 제어 장 치를 포함할 수 있다. 여기서, 스마트 제어 장치는, 스티어링 칼럼으로부터 제1 방향으로 돌출되는 지지부, 지지부로부터 제2 방향으로 연장되는 연결부, 그리고 연결부에 장착되어 제3 방향으로 배열되는 다수의 조작부를 포함할 수 있다. 일 예로, 지지부는, X축 방향으로 돌출되고, 연결부는, Z축 방향으로 연장되며, 조작부는, Y축 방향으로 배열될 수 있다. 그리고, 스마트 제어 장치의 지지부는, 스티어링 칼럼의 끝단에 배치된 스티어링 휠의 후방에 배치 되어 스티어링 휠 방향으로 경사지게 돌출될 수 있다. 그 이유는, 운전자 방향으로 조작계들이 집중되도록 배치되어 운전자가 조작계들을 쉽고 편리하게 조작할 수 있 을 뿐만 아니라 조작계에 표시되는 정보의 시인성을 향상시켜 안전성을 높이기 위함이다.또한, 스마트 제어 장치의 지지부는, 스티어링 칼럼과의 연결 영역에 배치되어 지지부가 후방으로 접혀 지거나 또는 전방으로 펼쳐지도록 지지부를 회전시키는 방향 전환부가 배치될 수도 있다. 그 이유는, 운전자가 직접 수동 운전을 하지 않는 경우 또는 조작계를 통한 차량 기능 제어가 필요하지 않는 경 우에 운전 공간 확보 및 스마트 제어 장치의 손상 방지를 위하여 지지부를 후방으로 접혀지게 하기 위함이다. 일 예로, 지지부는, 차량이 자율 주행 모드이면 방향 전환부에 의해 후방으로 접혀질 수 있다. 또한, 스마트 제어 장치의 지지부는, 스티어링 칼럼으로부터 돌출되는 다수의 지지바들을 포함할 수 있 다. 여기서, 지지바들은, 서로 대칭되도록 배치될 수 있다. 그 이유는, 지지부 일측 끝단의 연결부에 배치되는 조작계들이 운전자의 전방 시야 범위 이내에 위치하도록 하 여 운전자가 쉽고 편안하게 인지하도록 하기 위함이다. 이어, 스마트 제어 장치의 연결부는, 조작부가 배열되는 전면이 후방으로 휘어지는 곡률 반경을 갖는 곡면 일 수 있다. 그 이유는, 연결부의 전면에 배치되는 조작부의 조작계들이 운전자의 전방 시야 범위 이내에 위치하도록 하여 운전자가 쉽고 편안하게 인지하도록 하기 위함이다. 또한, 스마트 제어 장치의 연결부는, 스티어링 칼럼을 마주하는 측면이 외측 방향으로 휘어지는 곡률 반경을 갖는 곡면일 수 있다. 그 이유는, 연결부에 배치되는 조작부의 조작계들이 스티어링 휠의 주변부를 따라 운전자의 전방 시야 범위 이내에 위치하도록 하여 운전자가 쉽고 편안하게 인지하도록 하기 위함이다. 경우에 따라, 스마트 제어 장치의 연결부는, 조작부의 조작계가 장착되는 영역에 배치되어 조작계를 좌/우/ 상/하 방향으로 회전시키는 방향 전환부가 배치될 수도 있다. 그 이유는, 운전자가 방향 전환부를 이용하여 조작계의 정보 표시 방향을 편리하게 조절할 수 있도록 운전자 편 의성을 제공하기 위함이다. 다음, 스마트 제어 장치의 조작부는, 연결부에 장착되거나 또는 연결부로부터 분리되어 차량의 특정 기능을 제어하기 위한 사용자 입력을 수신할 수 있다. 이어, 조작부의 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들은, 사용자 설정에 따라 배열 위치가 변경될 수도 있다. 또한, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들은, 우선 순위에 따라 배열 위치 또는 버튼 크기가 변경될 수도 있다. 또한, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들은, 사용 불가인 다른 조작계에 포함된 사용자 입력 버튼으로 대체될 수도 있다. 또한, 각 조작계는, 다수의 사용자 입력 버튼들이 배열될 수 있는데, 사용자 입력 버튼들 중 1개의 입력 버튼이 선택되면 선택된 입력 버튼에 상응하는 차량의 제1 기능을 제어할 수 있고, 사용자 입력 버튼들 중 적어도 2개 의 입력 버튼이 동시에 선택되면 동시에 선택된 입력 버튼들에 상응하는 차량의 제2 기능을 제어할 수도 있다. 다음, 각 조작계는, 다른 조작계에 통신 연결하는 통신부를 포함할 수도 있는데, 통신부를 통해 다른 조작계로 정보를 전송하거나 또는 다른 조작계로부터 정보를 수신할 수 있다. 이와 같이, 본 발명은, 차량의 스티어링 칼럼 주변에 장착 또는 분리가 가능한 다수의 조작계들을 배치함으로써, 운전자가 편리하고 안전하게 차량의 다양한 기능들을 제어할 수 있다. 또한, 본 발명은, 운전자가 스티어링 휠로부터 손을 떼지 않고도 다수의 조작계를 안전하고 편리하게 조작할 수 있다. 또한, 본 발명은, 차량 전방을 향하는 운전자의 시야 범위 내에 조작계들이 위치하므로 운전 중 운전자의 주의 분산을 최소화할 수 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한 다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2020-0040431", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 내지 도 3은 본 발명의 일 실시예에 따른 차량용 스마트 제어 장치를 설명하기 위한 도면이다. 도 4 내지 도 6은 차량용 스마트 제어 장치의 지지부를 설명하기 위한 도면이다. 도 7은 차량용 스마트 제어 장치의 지지부와 연결부의 체결 과정을 설명하기 위한 도면이다. 도 8 및 도 9는 차량용 스마트 제어 장치의 연결부를 설명하기 위한 도면이다. 도 10은 차량용 스마트 제어 장치의 조작부를 설명하기 위한 도면이다.도 11(a) 내지 도 11(f)는 차량의 다양한 기능을 제어하는 조작계를 보여주는 도면이다. 도 12 내지 도 17은 조작계의 조작 방식을 설명하기 위한 도면이다. 도 18은 조작계들 사이의 통신 과정을 설명하기 위한 도면이다. 도 19는 본 발명의 일 실시예에 따른 차량용 스마트 제어 장치를 포함하는 차량을 설명하기 위한 도면이다."}
