{"patent_id": "10-2022-0078956", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0095777", "출원번호": "10-2022-0078956", "발명의 명칭": "인공지능 기반 해상교통관제 가이던스 제공 장치 및 제공 방법", "출원인": "제주대학교 산학협력단", "발명자": "김광일"}}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 기반 해상교통관제 가이던스 제공 장치에 있어서,해상교통정보를 실시간으로 수집하는 통신부;관제상황을 식별하기 위한 위험관리요소에 기초하여 상기 해상교통정보에 따른 제1관제상황을 식별하고,상기 관제상황에 대응하는 관제 가이던스를 식별하도록 학습된 딥러닝 모델에 기초하여 상기 제1관제상황에 대응하는 제1관제 가이던스를 식별하고,상기 제1관제 가이던스를 관제사 단말로 전송하는 프로세서를 포함하는 가이던스 제공 장치."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 관제 가이던스는,관제대상 정보, 관제대상에 제공할 알림정보, 관제상황 별 관제 개입 시기, 관제상황 이후 예상되는 적어도 하나의 시나리오, 법규 정보 중 적어도 어느 하나를 포함하는 것을 특징으로 하는 가이던스 제공 장치."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는,상기 해상교통정보에 기초하여 상기 위험관리요소를 추출하고,상기 위험관리요소, 상기 관제상황 및 상기 관제 가이던스를 학습데이터로 학습하여 상기 딥러닝 모델을 생성하는 가이던스 제공 장치."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는,상기 제1관제 가이던스에 대한 활용정보에 따라 상기 위험관리요소, 상기 관제상황 및 상기 관제 가이던스에 각각 가중치를 부여하여 학습하는 가이던스 제공 장치."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로세서는,상기 관제사 단말로부터 상기 제1관제 가이던스에 대한 활용정보를 수신하고,상기 활용정보에 기초하여 상기 딥러닝 모델의 가중치를 수정하는 가이던스 제공 장치."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 프로세서는,상기 해상교통정보에 포함되는 관제사의 음성을 인식하고,공개특허 10-2023-0095777-3-상기 음성으로부터 상기 제1관제 가이던스에 대한 활용정보를 식별하는 가이던스 제공 장치."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "인공지능 기반 해상교통관제 가이던스 제공장치에 의해 수행되는 가이던스 제공 방법에 있어서,해상교통정보를 실시간으로 수집하는 단계;관제상황을 식별하기 위한 위험관리요소에 기초하여 상기 해상교통정보에 따른 제1관제상황을 식별하는 단계;상기 관제상황에 대응하는 관제 가이던스를 식별하도록 학습된 딥러닝 모델에 기초하여 상기 제1관제상황에 대응하는 제1관제 가이던스를 식별하는 단계;상기 제1관제 가이던스를 관제사 단말로 전송하는 단계를 포함하는 가이던스 제공 방법."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 관제 가이던스는,관제대상 정보, 관제대상에 제공할 알림정보, 관제상황 별 관제 개입 시기, 관제상황 이후 예상되는 적어도 하나의 시나리오, 법규 정보 중 적어도 어느 하나를 포함하는 것을 특징으로 하는 가이던스 제공 방법."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 관제사 단말이 상기 알림정보에 대응하는 텍스트를 음성으로 변환시키는 단계;상기 관제사 단말이 상기 변환된 음성을 상기 관제대상에 전송하는 단계;를 포함하는 가이던스 제공 방법."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 제1관제 가이던스를 식별하는 단계는, 상기 해상교통정보에 기초하여 상기 위험관리요소를 추출하는 단계;상기 위험관리요소, 상기 관제상황 및 상기 관제 가이던스를 학습데이터로 학습하여 상기 딥러닝 모델을 생성하는 단계;를 포함하는 가이던스 제공 방법."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 딥러닝 모델을 생성하는 단계는,상기 제1관제 가이던스에 대한 활용정보에 따라 상기 위험관리요소, 상기 관제상황 및 상기 관제 가이던스에 각각 가중치를 부여하여 학습하는 단계;를 포함하는 가이던스 제공 방법."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 학습하는 단계는,상기 관제사 단말로부터 상기 제1관제 가이던스에 대한 활용정보를 수신하는 단계;상기 활용정보에 기초하여 상기 딥러닝 모델의 가중치를 수정하는 단계;를 포함하는 가이던스 제공 방법."}
{"patent_id": "10-2022-0078956", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 학습하는 단계는, 상기 해상교통정보에 포함되는 관제사의 음성을 인식하는 단계;공개특허 10-2023-0095777-4-상기 음성으로부터 상기 제1관제 가이던스에 대한 활용정보를 식별하는 단계;를 포함하는 가이던스 제공 방법."}
{"patent_id": "10-2022-0078956", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능 기반 해상교통관제 가이던스 제공 장치에 있어서, 해상교통정보를 실시간 으로 수집하는 통신부; 관제상황을 식별하기 위한 위험관리요소에 기초하여 상기 해상교통정보에 따른 제1관제상 황을 식별하고, 상기 관제상황에 대응하는 관제 가이던스를 식별하도록 학습된 딥러닝 모델에 기초하여 상기 제1 관제상황에 대응하는 제1관제 가이던스를 식별하고, 상기 제1관제 가이던스를 관제사 단말로 전송하는 프로세서 를 포함하는 가이던스 제공 장치;를 포함한다."}
{"patent_id": "10-2022-0078956", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 해상교통관제 가이던스 제공 장치 및 제공 방법에 관한 것이다."}
{"patent_id": "10-2022-0078956", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 해상물동량 증가, 조선경기 호황, 해양레저 및 여객수요증가, 어선 활동범위 확대 등으로 선박교통량은 점 점 증가하고 있으며, 이에 따라 선박 간 충돌 및 좌초사고가 증가하는 추세이다. 이를 방지하기 위해, 항만에는 항만을 통항 및 입출항 선박을 통제, 관리할 수 있는 해상교통관제(VTS) 센터가 있다. VTS 센터는 레이다 및 각종 통신시설을 이용해 VTS 관제구역을 운행하는 선박의 움직임을 관찰하고, 선박 과의 통신을 통해 안전한 항해를 위한 정보를 제공한다. VTS 센터에서 처리되는 모든 정보는 VTS 관제사가 직접 확인, 분석하여 선박에 사고 예방을 위한 정보제공 또는 지시가 이루어지고 있어, 관제사의 역할이 매우 중요하다. 하지만, 최근 여러 정보매체의 증가, 과도한 해상상 황 업무로 관제사가 처리해야 할 정비의 수가 증가하고, 관리 및 모니터링 해야 할 정보항목들이 늘어나고 있다. 특히, 관제사는 선박 교통량 폭주 시, 관제 취약시간대, 해양사고 등 비상상황 발생 시에 선박관제업무를 적절하게 처리하지 못해, 정부제공 누락, 오류 등 관제사의 인적오류가 발생할 가능성이 큰 상황이다. 그러나 VTS 관제사는 선박항해 및 관제경험에 의존하여 선박 교통관리를 수행하고 있으며, 이 경우 관제사의 인 지오류와 중장기 선박교통 예측에 한계가 있어 정확한 관제가 어려운 실정이다. 또한, VTS 관제구역은 선박의 교통밀도가 높아 근접 항해가 빈번하고, 각 항만마다 항로, 해상 장애물, 항로특 성, 입출항 선박특성 등이 상이함에도 불구하고, VTS 관제구역의 위험도를 평가하는 기존 관제사 지원 시스템은 대부분 주변 장애물 및 선박이 적은 원양해역의 추측항법 시스템(Dead Reckoning)을 사용하고 있다. 다만, 원양 해역의 추측항법 시스템의 경우 단시간 및 개별 선박에 대한 예측은 가능하나, 중장기 및 다중 선박에 대한 위 험도 평가에는 한계가 있다. 이처럼, 기존 VTS 관제사 지원 시스템은 선박 위치, 속력, 침로 등 실시간 정보를 기반으로 설정된 조건에서 벗 어난 경우 관제사에게 알람을 전달하는 기능에 머무르고 있으나, VTS 관제 상황은 다양한 요인 및 과거 패턴들 이 결합한 복합적인 결과이므로 VTS 관제사에게 효과적이고 신뢰 가능하며 신속한 의사결정지원이 가능한 기술 개발이 시급하다."}
{"patent_id": "10-2022-0078956", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 해상교통상황에서 관제사가 필요한 상황을 예측할 수 있는 관제 가이던스 제공 장치 및 제어 방법을 제공하는 것이다. 본 발명의 목적은 관제사의 의사결정을 지원하는 관제 가이던스를 제공하는 가이던스 제공 장치 및 제어방법을 제공하는 것이다. 본 발명의 목적은 정확도 높은 관제 가이던스를 도출하는 가이던스 제공 장치 및 제어방법을 제공하는 것이다."}
{"patent_id": "10-2022-0078956", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능 기반 해상교통관제 가이던스 제공 장치에 있어서, 해상교통정보를 실시간 으로 수집하는 통신부; 관제상황을 식별하기 위한 위험관리요소에 기초하여 상기 해상교통정보에 따른 제1관제 상황을 식별하고, 상기 관제상황에 대응하는 관제 가이던스를 식별하도록 학습된 딥러닝 모델에 기초하여 상기 제1관제상황에 대응하는 제1관제 가이던스를 식별하고, 상기 제1관제 가이던스를 관제사 단말로 전송하는 프로 세서를 포함하는 가이던스 제공 장치를 포함한다.상기 관제 가이던스는, 관제대상 정보, 관제대상에 제공할 알림정보, 관제상황 별 관제 개입 시기, 관제상황 이 후 예상되는 적어도 하나의 시나리오, 법규 정보 중 적어도 어느 하나를 포함할 수 있다. 상기 프로세서는, 상기 해상교통정보에 기초하여 상기 위험관리요소를 추출하고, 상기 위험관리요소, 상기 관제 상황 및 상기 관제 가이던스를 학습데이터로 학습하여 상기 딥러닝 모델을 생성할 수 있다. 상기 프로세서는, 상기 제1관제 가이던스에 대한 활용정보에 따라 상기 위험관리요소, 상기 관제상황 및 상기 관제 가이던스에 각각 가중치를 부여하여 학습할 수 있다. 상기 프로세서는, 상기 관제사 단말로부터 상기 제1관제 가이던스에 대한 활용정보를 수신하고, 상기 활용정보 에 기초하여 상기 딥러닝 모델의 가중치를 수정할 수 있다. 상기 프로세서는, 상기 해상교통정보에 포함되는 관제사의 음성을 인식하고, 상기 음성으로부터 상기 제1관제 가이던스에 대한 활용정보를 식별할 수 있다. 본 발명의 일 실시예에 따른 인공지능 기반 해상교통관제 가이던스 제공장치에 의해 수행되는 가이던스 제공 방 법에 있어서, 해상교통정보를 실시간으로 수집하는 단계; 관제상황을 식별하기 위한 위험관리요소에 기초하여 상기 해상교통정보에 따른 제1관제상황을 식별하는 단계; 상기 관제상황에 대응하는 관제 가이던스를 식별하도 록 학습된 딥러닝 모델에 기초하여 상기 제1관제상황에 대응하는 제1관제 가이던스를 식별하는 단계; 상기 제1 관제 가이던스를 관제사 단말로 전송하는 단계를 포함한다. 상기 관제 가이던스는, 관제대상 정보, 관제대상에 제공할 알림정보, 관제상황 별 관제 개입 시기, 관제상황 이 후 예상되는 적어도 하나의 시나리오, 법규 정보 중 적어도 어느 하나를 포함할 수 있다. 상기 관제사 단말이 상기 알림정보에 대응하는 텍스트를 음성으로 변환시키는 단계; 상기 관제사 단말이 상기 변환된 음성을 상기 관제대상에 전송하는 단계;를 포함할 수 있다. 상기 제1관제 가이던스를 식별하는 단계는, 상기 해상교통정보에 기초하여 상기 위험관리요소를 추출하는 단계; 상기 위험관리요소, 상기 관제상황 및 상기 관제 가이던스를 학습데이터로 학습하여 상기 딥러닝 모델을 생성하 는 단계;를 포함할 수 있다. 상기 딥러닝 모델을 생성하는 단계는, 상기 제1관제 가이던스에 대한 활용정보에 따라 상기 위험관리요소, 상기 관제상황 및 상기 관제 가이던스에 각각 가중치를 부여하여 학습하는 단계;를 포함할 수 있다. 상기 학습하는 단계는, 상기 관제사 단말로부터 상기 제1관제 가이던스에 대한 활용정보를 수신하는 단계; 상기 활용정보에 기초하여 상기 딥러닝 모델의 가중치를 수정하는 단계;를 포함할 수 있다. 상기 학습하는 단계는, 상기 해상교통정보에 포함되는 관제사의 음성을 인식하는 단계; 상기 음성으로부터 상기 제1관제 가이던스에 대한 활용정보를 식별하는 단계;를 포함할 수 있다."}
{"patent_id": "10-2022-0078956", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 가이던스 제공 장치는 관제사가 복잡한 상황에서 정보제공시기를 놓치지 않고 관제대상에 필요한 정보를 빠르게 제공할 수 있도록 지원한다. 본 발명의 일 실시예에 따르면, 가이던스 제공 장치는 딥러닝 모델 학습을 통해서 해상교통정보로부터 관제사에 게 정확한 관제상황 및 관제 가이던스를 제공할 수 있다. 본 발명의 일 실시예에 따르면, 관제사는 가이던스 제공 장치로부터 제공받은 관제 가이던스를 활용하여 과도한 해상상황 업무 및 관제오류(인적오류)를 줄일 수 있다."}
{"patent_id": "10-2022-0078956", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략할 수 있고, 명세서 전체를 통하여 동일 또는 유사한 구성 요소에 대해서는 동일한 참조 부 호를 사용할 수 있다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반 해상교통관제 가이던스 제공 장치를 포함하는 관제 시 스템을 도시한 도면이다. 도 1에 도시된 인공지능 기반 해상교통관제 가이던스 제공 시스템은, 해상교통정보 수집 센서, 인공지능 기반 해상교통관제 가이던스 제공 장치(이하, 가이던스 제공 장치라 한다.), 관제사 단말, 관제 대상을 포함한다. 이때, 본 발명의 일 실시예에 따르면, 해상교통정보 수집 센서에서 수집된 해상교 통정보를 가이던스 제공 장치에서 분석하여 관제 가이던스를 도출하고, 도출된 관제 가이던스는 관제사 단 말을 통해 관제대상으로 전달된다. 본 발명의 일 실시예에 따른 해상교통정보 수집 센서는 각종 장비를 이용하여 관제구역을 항해하는 선박 등 관제대상의 항행안전을 위한 정보(선박이동 및 음성교신정보)를 수집한다. 구체적으로 관제구역은 관제 사 단말이 설치된 수역에서 레이더 탐지범위와 선박의 통행량 및 이동경로를 고려하여 설정된 영역을 의미 한다. 관제구역 내에서 관제사 단말은 관제대상의 항행안전을 위해서 초단파(VHF) 무선전화 또는 그 밖에 통신수단을 이용하여 정보를 제공할 수 있다 본 발명의 일 실시예에 따른 해상교통정보 수집 센서는, 예를 들어, 레이더, CCTV, 선박자동식별시스템 (AIS), 방향탐지기(VHF-DF), 기상관측장비 등의 첨단 감시장비 뿐만 아니라, 무선통신장비(VHF, SSB 등), 자동 안내방송 장비 등의 통신장비를 포함한다. 본 발명의 일 실시예에 따른 가이던스 제공 장치는 해상교통정보 수집 센서가 수집한 정보를 이용해 서 관제사 단말에 제공하는 관제 가이던스를 식별하는 장치로써, 컴퓨터, 서버 등으로 구현될 수 있다. 본 발명의 일 실시예에 따른 관제사 단말은 가이던스 제공 장치에서 식별된 관제 가이던스를 전달받 아 관제사 단말의 표시부에 표시하고, 적절한 관제 가이던스를 관제대상에 제공하는 장치로써, 관제 사가 사용하는 PC 또는 모바일 단말기 등으로 구현될 수 있다. 본 발명의 일 실시예에 따른 관제대상은 안전하게 항만을 통항 및 입출항하기 위해 관제소의 관제를 필요 로 하는 선박으로, 화물선, 여객선, 어선 등을 포함한다. 해상교통정보 수집 센서가 수집하는 모든 정보를 확인, 분석하여 관제대상에 정보를 제공함에 있어 관제사의 역할이 매우 중요하다. 하지만 수집 센서의 다양화에 따른 정보량의 증가로 관리 및 모니터링 해 야 할 항목들이 계속적으로 늘어나고 있는 상황이다. 본 발명에서는 선박 교통량 폭주 시, 관제 취약시간대, 해 양사고 등 비상상황 발생 시에 관제상황을 자동 식별하고, 관제상황에 대응하는 관제 가이던스를 식별하여 관제 사 단말에 제공하는 인공지능 기반 해상교통관제 가이던스 제공장치를 제안한다. 이하 설명에서는 가이던스 제공 시스템을 구성하는 해상교통정보 수집 센서, 가이던스 제공 장치, 관 제사 단말의 각 구성, 해상교통정보로부터 관제 가이던스를 도출하는 프로세스, 관제사 단말에서 관 제 가이던스를 활용하는 실시예 및 관제 가이던스를 도출하는 딥러닝 모델의 학습 과정에 대해서 구체적으로 설 명한다. 도 2는 본 발명의 일 실시예에 따른 해상교통정보 수집 센서, 가이던스 제공 장치 및 관제사 단말 을 포함하는 가이던스 제공 시스템의 구성을 도시한 블럭도이다. 본 발명의 일 실시예에 따른 해상교통정보 수집 센서는 통신부 및 센서부를 포함한다. 통신부 는 무선통신장비(VHF, SSB 등), 자동안내방송 장비 등의 통신장비를 포함한다. 상기 무선통신장비는 주로 초단파 무선통신장비(VHF : Very High Frequency)를 이용하며, 150Mhz 대역의 주파수 를 이용하여 선박과 선박, 선박과 관제센터간 음성으로 교신이 가능하다. 또한, 디지털선택호출장치(VHF-DSC : Digital Selective Calling)는 선박이 조난, 긴급시 송신버튼을 누르면 선명, 위치 등이 디지털 신호로 발사되 는 장치이다.센서부는 레이더, CCTV, 선박자동식별시스템(AIS), 방향탐지기(VHF-DF), 기상관측장비 등 환경정보를 수집 한다. 상기 레이더는, 전파를 발사하여 물표에 부딪쳐 반사되어온 전파를 물표정보로 변환하여 모니터상에 영상이미지 로 나타내는 장치로, 20마일 범위내의 선박을 감지할 수 있다. 상기 CCTV는 영상정보를 획득하기 위한 장비로, 관제센터 연안 및 관제실 내부의 정보를 감지할 수 있다. 상기 선박자동식별시스템(AIS)은 선박의 항해안전 및 보안강화를 위하여 선박의 선명, 제원, 속력 등의 정보를 무선통신을 통하여 선박-선박, 선박-육상간 자동송수신할 수 있는 항해장비로 선박의 정확한 위치정보 수집 및 제공으로 항만관제에 활용하고 해양사고 발생 시 수색, 구조 등을 지원하는 시스템이다. 상기 방향탐지기(VHF-DF)는 관제센터와 선박 간에 이루어지는 VHF 신호로 교신중인 선박의 위치를 탐지하는 장 비로 20마일 범위내에 위치하는 선박을 탐지할 수 있다. 상기 기상관측장비는 선박 교통이 집중되는 항만에서 위험 기상 및 해양 현상을 감시하고, 선박의 안전한 운항 과 선적·하역 등에 유용한 정보 생산에 필요한 관측 자료를 생산하기 위한 것으로, 풍향, 풍속, 기온, 습도, 파고, 파주기, 수온 등을 관측하고 있다. 본 발명의 일 실시예에 따른 가이던스 제공 장치는 통신부, 메모리, 프로세서, 표시부 및 입력부를 포함한다. 본 발명의 일 실시예에 따르면, 통신부는 해상교통정보 수집 센서로부터 실시간으로 수집된 해상교통 정보, 예컨데, 관제교신 데이터, 선박교통 데이터, 해양환경 데이터, 입출항 지원 데이터 등을 수신한다. 수신 한 정보는 관제상황을 파악하고 관제사에게 관제 가이던스를 제공하기 위해 필요한 정보를 포함한다. 통신부는 해상교통정보 수집 센서, 관제사 단말 등 외부 장치와 통신을 수행한다. 통신부 는 해상교통정보 수집 센서로부터 관제교신 데이터, 선박교통 데이터, 해양환경 데이터, 입출항 지원 데이 터 등을 포함하는 해상교통정보를 수신한다. 또한, 통신부는 관제사 단말로부터 관제 가이던스에 대 한 활용정보를 수신한다. 이를 위해, 통신부는 초단파 무선통신장비(VHF : Very High Frequency System), 디지털선택호출장치(VHF-DSC : Digital Selective Calling) 등 해상교통관제를 위한 통신 뿐만 아니라, 5G(5th generation communication), LTE-A(long term evolutionadvanced), LTE(long term evolution), Wi- Fi(wireless fidelity) 등 일반적인 형태의 유,무선 통신을 수행할 수 있다. 본 발명의 일 실시예에 따르면, 메모리는 가이던스 제공 장치의 동작 프로그램들을 저장한다. 메모리 는 전원의 제공 유무와 무관하게 데이터(정보)를 보존할 수 있는 비휘발성 속성의 스토리지(storage)와, 프로세서에 의해 처리되기 위한 데이터가 로딩되며 전원이 제공되지 않으면 데이터를 보존할 수 없는 휘발 성 속성의 메모리(memory)를 포함한다. 스토리지에는 플래시메모리(flash-memory), HDD(hard-disc drive), SSD(solid-state drive) ROM(Read Only Memory) 등이 있으며, 메모리에는 버퍼(buffer), 램(RAM; Random Access Memory) 등이 있다. 메모리는 해상교통정보 수집 센서로부터 전달받은 해상교통정보를 저장할 수 있다. 예를 들어, 관제교신 데이터, 선박교통 데이터, 해양환경 데이터, 입출항 지원 데이터 등이 해상교통정보에 포함될 수 있다. 메모리는 해상교통정보로부터 관제상황을 식별하고 관제사의 관제 개입여부를 평가하는데 사용되는 위험관 리요소를 저장할 수 있다. 메모리는 관제사 개입이 필요한 경우 관제상황에 따라 관제사에게 제공되는 관제 가이던스를 저장할 수 있 다. 메모리는 해상교통정보로부터 관제 가이던스를 식별하는데 사용되는 인공지능 알고리즘에 관한 정보를 저 장할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 프로그램 등 소프트웨어를 실행하여 가이던스 제공 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처 리 또는 연산을 수행할 수 있다. 프로세서는 해상교통정보를 실시간으로 수신하고, 관제사의 관제 개입이 필요한 관제상황을 식별하기 위한 위험관리요소를 이용하여 해상교통정보로부터 제1관제상황을 추출한다. 또한, 관제상황에 대응하는 관제 가이던스를 식별하도록 학습된 인공지능 알고리즘에 기초하여 추론된 제1관제상황에 대응하는 제1관제 가이던스를 식 별하고, 식별된 제1관제 가이던스를 관제사 단말로 전송할 수 있다. 프로세서에서 동작하는 인공지능 알고리즘은 해상교통정보로부터 식별된 위험관리요소, 관제상황 및 관제 가이던스를 학습데이터로 학습하도록 구성되어 있다. 예를 들어, 인공지능 알고리즘으로는 기계학습, 신경망 네 트워크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용하여 수행할 수 있다. 신경망 네트워크의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network) 과 같은 모델을 포함할 수 있다. 표시부는 액정 디스플레이(LCD; liquid crystal display), 발광 다이오드(LED; light emitting diode) 디 스플레이, 유기 발광 다이오드(OLED; organic LED) 디스플레이, 마이크로 전자기계 시스템(MEMS; micro electro mechanical systems) 디스플레이 및 전자 종이(electronic paper) 디스플레이를 포함한다. 표시부 는 입력부와 결합되어 터치 스크린(touch screen)으로 구현될 수 있다. 입력부는 적어도 하나의 입력수단을 포함한다. 입력부는 키보드(key board), 키패드(key pad), 돔 스 위치(dome switch), 터치패널(touch panel), 터치 키(touch key), 마우스(mouse), 메뉴 버튼(menu button) 등 을 포함할 수 있다. 본 발명의 일 실시예에 따르면 관제사 단말은 표시부, 입력부 및 제어부을 포함한다. 상기 표시부는 관제 가이던스를 관제사에게 표시한다. 예를들어 표시부는 액정 디스플레이(LCD; liquid crystal display), 발광 다이오드(LED; light emitting diode) 디스플레이, 유기 발광 다이오드(OLED; organic LED) 디스플레이, 마이크로 전자기계 시스템(MEMS; micro electromechanical systems) 디스플레이 및 전자 종이(electronic paper) 디스플레이를 포함한다. 상기 입력부는 관제 가이던스를 참고하여 관제사가 관제대상에 전달하는 관제 정보에 관한 사용자 입 력을 수신한다. 예를들어 입력부는 키보드(key board), 키패드(key pad), 돔 스위치(dome switch), 터치 키(touch key), 마우스(mouse), 메뉴 버튼(menu button) 등을 포함할 수 있다. 또한, 입력부는 표시부 와 결합되어 터치 스크린(touch screen)으로 구현될 수 있다. 상기 제어부는 프로그램 등 소프트웨어를 실행하여 관제사 단말의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 상기 제어부는 관제 가이던스를 표시부에 표시하고, 입력부를 통해 관제대상에 전달할 관 제 가이던스를 선택하는 사용자 입력을 수신할 수 있다. 도 3은 본 발명의 일 실시예에 따른 가이던스 제공 장치의 동작 흐름도를 도시한 도면이다. 본 발명의 일 실시예에 따르면, 프로세서는 통신부를 통해 해상교통정보 수집 센서로부터 해상 교통정보를 실시간으로 수집한다(S10). 상기 해상교통정보는 관제교신 데이터, 선박교통 데이터, 해양환경 데이터, 입출항 지원 데이터 등, 현 관제상 황을 파악하고 관제사 단말을 통해 관제 가이던스를 제공하기 위해 필요한 정보를 포함한다. 본 발명의 일 실시예에서 상기 실시간으로 수집되는 해상교통정보는, 일정 주기별(예: 3초 단위)로 수집되는 정 보, 일정 기간동안(예: 선박이동량이 일정량 이상) 수집되는 정보, 혹은 관제사 단말로부터 요청이 있는 경우 수집되는 정보를 포함할 수 있다. 또한, 해상교통정보 수집 센서에 포함된 장치에서 수집할 정보가 있을 때마다 실시간으로 수집되는 정보를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 관제상황을 식별하기 위한 위험관리요소에 기초하여 해상교통 정보로부터 제1관제상황을 식별한다(S20). 본 발명의 일 실시예에서 관제상황은 해상교통정보와 위험관리요소에 기초하여, 관제사의 개입이 필요하다고 판 단되는 상황을 의미한다. 예를 들어 관제상황에는, 선박 충돌상황, 저시정 상황, 선박 진입 우선순서 조정 상황, 도선사 승하선 상황, 음주운항 상황, 항법위반 상황 등이 포함될 수 있다. 구체적으로, 제1관제상황은 실 시간으로 수집된 해상교통정보에 기초하여 식별된 어느 하나의 관제상황을 의미하고, 나아가 제1관제상황에 대 응하는 제1관제 가이던스를 도출하기 위해 후술하는 딥러닝 모델에 종속변수(레이블 데이터) 형태로 입력될 데 이터를 의미한다.본 발명의 일 실시예에서 위험관리요소는 해상교통정보에 기초하여 관제사가 관제상황임을 판별하고 관제에 개 입하여 관제대상에 가이던스를 제공하기 위해 평가에 사용되는 요소이다. 위험관리요소에는 예를 들어, 선박 충 돌위험도, 비정상 항해 위험도, 선박 교통밀도, 항내 서비스 상황 및 대상선박 이동, 항법 위반 여부, 음주운항 여부, 선박 관제 이력 등이 포함될 수 있다. 상기 위험관리요소는 가이던스 제공 장치의 메모리에 저장되어 있을 수 있다. 또한, 위험관리요소는 외부장치에 저장되어 연산이 필요할 때마다 외부장치에서 가이던스 제공 장치로 전송될 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 관제상황에 대응하는 관제 가이던스를 식별하도록 학습된 딥러 닝 모델에 기초하여 제1관제상황에 대응하는 제1관제 가이던스를 식별한다.(S30) 본 발명의 일 실시예에 따르면, 프로세서에 포함된 딥러닝 모델은 해상교통정보로부터 추출된 위험관리요 소, 위험관리요소를 기초로 식별된 관제상황 및 관제상황에 대응하여 관제사에게 제공된 관제 가이던스를 학습 데이터로 학습할 수 있다. 프로세서가 딥러닝 모델을 학습하는 경우의 동작에 관해서는 도 5와 관련하여 설명한다. 본 발명의 일 실시예에 따르면, 관제 가이던스는 관제상황에서 정보제공 누락 및 관제 오류로 인한 사고발생을 줄이기 위해 관제사에게 제공되는 정보다. 예를 들어, 관제 가이던스에는 상황별 관제 개입 시기, 관제사에게 제공되는 정보 목록, 항후 예상되는 시나리오 및 관제사 체크포인트, 해상교통법 및 관제법 위반시 처벌항목 정 보, 유사 교통상황 등의 정보가 포함될 수 있다. 구체적으로, 딥러닝 모델은 입력받은 제1관제상황에 대응하는 제1관제 가이던스를 도출하여 관제사 단말로 전송한다. 예를 들어, 상기 향후 예상되는 시나리오는 선박충돌사고가 예상되는 경우를 포함한다. 위험요소분석 결과 선박 충돌위험도가 높게 나타나는 제1관제상황으로 식별된 경우, 제1관제 가이던스에 해양수산부에서 제공하는 '기초 항법 8법칙' 및 '선박 탈출 가이드라인'을 포함시켜 관제사 단말로 제공한다. 이를 바탕으로, 관제사가 갑 작스럽게 제1관제상황에 맞닥뜨리면, 향후 예상되는 시나리오를 바탕으로 제1관제상황에 효율적으로 대응할 수 있다. 상기 제1관제상황을 식별하기 위해서는, 과거 선박 이동 데이터를 빅데이터 기반으로 분석하여 향후 선박 이동 경로를 예측할 수 있다. 또한, 디지털 트윈 기술을 이용하여 예측된 선박의 경로를 관제사 단말로 제공하고, 선 박 충돌위험도를 분석할 수 있다. 상기 충돌위험도 분석 결과를 바탕으로, 충돌 상황을 회피하기 위한 회피경로를 제공할 수 있다. 예를 들어, 회 피경로에는 선박의 침로 및 속도 정보를 포함할 수 있다. 또한, 침로 및 속도 변경에 따라 실시간으로 선박의 충돌 위험도를 산출하여 관제사 단말에 제공할 수 있다. 상기 '기초항법 8법칙'에는 연안 해역이나 좁은 수로를 항해하는 선박의 해양사고를 예방하기 위해 선박을 추월 하는 경우나 서로 마주치는 경우, 항로를 횡단하는 경우 등 선박 운항자가 지켜야 할 사항을 포함하고 있다. 상기 '선박 탈출 가이드라인'은 선박충돌사고가 발생할 만약의 상황을 대비하여, 구명뗏목의 작동 전 준비단계, 작동단계, 탑승단계로 구성되어 있다. 구체적으로, 작동 전 준비단계는 '구명뗏목 작동을 위해서는 먼저 연결된 가드레일을 벗긴 뒤 연결줄이 선박에 묶인 것을 확인하고 구명뗏목이 내려갈 방향에 장애물이 있는지 점검해야 한다.'를 포함한다. 작동단계는 '이후 구명뗏목을 고정시킨 안전핀을 위쪽으로 뽑은 뒤 T레버를 몸 쪽으로 당겨 뗏목을 떨어뜨리고 뗏목이 펼쳐질 때까지 연결줄을 잡아당긴다.'를 포함한다. 탑승단계는 '뗏목이 완전히 펼쳐 지면 뛰어내리거나 사다리를 이용해 탑승하고 전원 탑승이 확인되면 뗏목 안에 비치된 칼로 연결줄을 자른다.' 를 포함한다. 본 발명의 일 실시예에 따르면, 프로세서는 제1관제 가이던스를 관제사 단말로 전송한다(S40). 제1관 제 가이던스에는 제1관제상황에서 정보제공 누락 및 관제 오류로 인한 사고발생을 줄이기 위한 정보가 포함될 수 있다. 예를들어, 선박충돌사고가 예상되는 경우, 선박의 회피경로, 항법정보 및 사고 발생 시 탈출 가이드라 인을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 관제사는 해상교통상황을 신속하게 판단하고 실시간으로 확인하고 대응할 수 있 다. 또한, 관제상황 발생 시 관제 가이던스를 활용하여 적절한 조치를 취함으로써 정보제공 누락, 관제 오류 등 인적오류 발생을 최소화할 수 있다. 도 4는 본 발명의 일 실시예에 따른 관제 가이던스를 제공받은 관제사 단말에서의 동작을 도시한 도면이다. 본 발명의 일 실시예에 따르면, 제1관제 가이던스를 전달받은 관제사 단말에는 관제구역 내에 현 시점에서 가장 교신이 필요한 관제대상과 관제대상에 전달해야 하는 교신내용이 자동으로 표시된다. 관제사는 관제사 단말에 표시된 제1관제 가이던스를 확인하고, 관제상황에 맞는 정보를 선택하여 활용할 수 있다. 특히, 관제사 단말의 제어부는 표시부에 가이던스 장치로부터 수신한 관제 가이 던스를 자동으로 전송하는 자동전송 메뉴 아이콘을 표시할 수 있다. 입력부 혹은 입력부와 결합된 표시부 를 통해 자동전송 메뉴 아이콘을 선택하는 사용자 입력이 수신되면, 관제사 단말의 제어부는 TTS(Text-To-Speech)를 통해 제1관제 가이던스 내용이 음성으로 변환하고, 이를 관제대상에 전송할 수 있 다. 또한, 관제사의 관제상황 판단 결과 전달받은 제1관제 가이던스 외 추가적으로 관제대상에 전달이 필요한 정보 가 있어 수동교신이 필요한 경우, 관제사 단말을 통해 관제대상과 직접 교신을 취할 수 있다. 관제사 단말과 관제대상 간 교신내역은 관제사 단말에서 자동으로 수집되어 가이던스 제공 장치 로 전달된다. 가이던스 제공 장치는 전달받은 교신내역을 분석하여 관제 가이던스 도출하는 딥러닝 모델을 개선하는데 활용한다. 예를 들어, 인천 VTS에서 수집한 해상교통정보를 분석한 결과, 선박 1척의 진행방향에 인천항으로 입항하는 다 른 어선들이 확인되었다고 가정한다. 이 경우, 가이던스 제공 장치는 교신이 필요한 선박을 관제사 단말에 표시하고, \"인천 VTS 입니다. 귀선 선수 방향에 입항하는 유어선들이 많습니다. 주의하세요\"라는 알람을 포함하는 관제 가이던스를 제공할 수 있다. 이때, 알람의 종류는 하나의 예시일 뿐 어느 하나에 한정되지 않고, 가이던스 제공 장치에서 관제사 단말로 전달되는 모든 관제 가이던스를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 복잡한 상황에서 정보제공시기를 놓치지 않고 관제대상에 필요한 정보를 빠르게 제공할 수 있다. 도 5는 본 발명의 도 3의 S30에서 설명한 프로세서가 딥러닝 모델을 학습하고, 딥러닝 모델에 기초하여 식 별된 제1관제 가이던스를 관제사 단말로 제공하는 동작 흐름도를 도시한다. 본 발명의 일 실시예에 따르면, 해상교통정보 수집 센서는 선박자동식별장치, 기상장비, 방향탐지기, 레이 다 및 각종 통신장비를 이용해 관제구역 내 해상교통정보를 수집한다(S500). 예를 들어, 관제교신 데이터, 선박 교통 데이터, 해양환경 데이터, 입출항 지원 데이터 등을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 가이던스 제공 장치는 수집 센서로부터 해상교통정보를 수신하고, 딥 러닝 모델 학습에 사용할 수 있도록 해상교통정보 데이터를 전처리 하고, 전처리된 데이터로부터 위험관리요소 를 추출한다(S510). 데이터 전처리는 기존의 데이터를 인공지능 알고리즘에 맞는 데이터 구조로 바꾸는 과정을 의미한다. 예를 들어, 딥러닝 모델 학습에 불필요한 데이터를 제거하는 과정, 데이터 구조를 일치시키는 과정 등이 포함될 수 있다. 위험관리요소는 관제상황을 판별하고 관제사의 개입을 결정하는 요소를 의미한다. 예를 들어, 선박이 정해진 항 로를 벗어나 항해하고 있는 경우, \"비정상 항해 위험도\" 위험관리요소가 추출될 수 있다. 본 발명의 일 실시예에 따르면, 딥러닝 모델을 학습시키기 위한 학습 데이터로 위험관리요소, 관제상황, 관제 가이던스를 이용한다(S520). 본 발명의 일 실시예에 따르면, 프로세서는 위험관리요소, 관제상황, 관제 가이던스를 파라미터로 딥러닝 모델을 생성한다(S530). 본 발명의 일 실시예에 따르면, 딥러닝 모델에 입력되는 테스트 데이터는 해상교통정보 및 이에 기초하여 추출 된 위험관리요소이다(S540). 프로세서는 S530에서 생성한 딥러닝 모델을 이용하여 해상교통정보 및 위험관 리요소에 따라 관제사의 개입이 필요한 제1관제상황을 식별한다(S550). 본 발명의 일 실시예에 따르면, 프로세서는 딥러닝 모델을 이용하여 제1관제상황에 대응하는 제1관제 가이 던스를 식별하고, 관제사가 활용할 수 있도록 관제사 단말로 전송한다(S560).본 발명의 일 실시예에 따르면, 관제사 단말의 입력부를 통해 제1관제 가이던스에 대한 활용정보에 관한 사용자 입력을 수신할 수 있다(S570). 상기 활용정보는 가이던스 제공 장치가 관제사 단말에 제 공한 제1관제 가이던스와 실제 관제사 단말이 관제대상에 제공한 관제 결과를 비교해서 도출할 수 있 다. 본 발명의 일 실시예에 따르면, 가이던스 제공 장치는 관제사 단말로부터 제1관제 가이던스에 대한 활용정보를 수신하고, 활용정보에 기초하여 딥러닝 모델의 가중치를 수정할 수 있다(S580). 가이던스 제공 장치는 제1관제 가이던스에 대한 활용정보에 따라 위험관리요소, 관제상황 및 관제 가이던 스에 각각 가중치를 부여하여 딥러닝 모델을 학습할 수 있다. 구체적으로, 상기 활용정보 확인 결과 관제상황에 대한 판단이 잘못된 경우, 위험관리요소, 관제상황에 대한 가 중치를 조정할 수 있다. 또한, 상기 활용정보 확인 결과 관제 가이던스에 대한 판단이 잘못된 경우 관제 가이던 스에 대한 가중치를 조정할 수 있다. 구체적으로, 활용정보에 음성교신 정보가 포함되어 있을 경우, 딥러닝 모델에 적용하기 위한 학습데이터로 변환 하기 위해 음성인식부를 포함할 수 있다. 구체적으로, 음성인식부는 관제사 단말에 위치하거나, 가이던스 제공 장치에 위치할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 해상교통정보에 포함되는 관제사의 음성을 인식하고, 인식한 음성으로부터 제1관제 가이던스에 대한 활용정보를 식별할 수 있다. 활용정보는 관제사 단말로 전송되어 딥러닝 모델의 파라미터 가중치를 조정할 수 있다. 딥러닝 모델 학습 방법으로는 학습데이터에 활용정보를 함께 제공하는 지도학습을 사용할 수 있다. 본 발명의 일 실시예에 따르면, 가이던스 제공 장치는 딥러닝 모델 학습을 통해서 해상교통정보로부터 관 제사에게 정확한 관제상황 및 관제 가이던스를 제공할 수 있다."}
{"patent_id": "10-2022-0078956", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 가이던스 제공 장치를 포함하는 관제 시스템을 도시한 개략도이다. 도 2는 본 발명의 일 실시예에 따른 가이던스 제공 장치의 구성을 도시한 블럭도이다. 도 3은 본 발명의 일 실시예에 따른 가이던스 제공 장치의 동작 흐름도를 도시한 도면이다. 도 4는 본 발명의 일 실시예에 따른 관제 가이던스에 포함된 시나리오의 모습을 도시한 도면이다. 도 5는 본 발명의 일 실시예에 따른 딥러닝 모델의 학습 및 관제 가이던스 생성 프로세스를 도시한 도면이다."}
