{"patent_id": "10-2020-0177326", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0087019", "출원번호": "10-2020-0177326", "발명의 명칭": "인공지능 기반 물류 추적 관리 및 처리 방법", "출원인": "(주)스톤랩", "발명자": "송민구"}}
{"patent_id": "10-2020-0177326", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고정 장비 및 이동 장비에 부착된 카메라 모듈 및 마이크 모듈을 포함하는 기기를 이용하여 영상 및 음성 정보를 수집하여 취득하는 제1단계; 취득된 영상 및 음성 정보를 독립적으로 구분하여 노이즈 신호를 제거하고, 인공지능 연산과정에 의해 식별 가능한 패턴 형태로 자동 판별하는 제2단계;판별된 패턴 정보를 토대로 물류 및 작업자 형상을 분석하여 형상 인식 정보를 특정하는 제3단계;상기 제3단계의 결과로 구분된 단위 형상 간의 관계를 분석하여 관계 인식 정보를 특정하는 제4단계;상기 제3단계 및 제4단계의 결과에 대해 가중치 합산하여 최종 인식 정보를 교정하고 식별 정보를 결합하는 제5단계; 및 상기 제5단계의 결과를 이용하여 물류 처리작업 현장 내부 및 외부에서 물류 추적 관리 및 처리하는 제6단계;를포함하는 것을 특징으로 하는 인공지능 기반 물류 추적 관리 및 처리 방법."}
{"patent_id": "10-2020-0177326", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 인지 정보는 영상 또는 음성 형태이며, 인공지능 연산과정은 컨벌루셔널(convolutional) 연산이 수반되는필터를 이용하거나 입력 시점별로 구분된 N개의 단위 정보를 한 개의 순차적인 입력 단위로 설정하여 이에 대해비선형(non-linear) 함수에 의한 변환을 거치는 학습 구조를 수반하며 분류 또는 판별 태스크를 수행하여 식별가능한 패턴을 추정하는 것을 특징으로 하는 인공지능 기반 물류 추적 관리 및 처리 방법."}
{"patent_id": "10-2020-0177326", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 인지 정보는 고정 장비 및 이동 장비에 부착된 기기 내부의 어플리케이션 프로세서에서 처리하거나 네트워크를 통해 전송하여 원격 서버에서 처리하는 것을 특징으로 하는 인공지능 기반 물류 추적 관리 및 처리 방법."}
{"patent_id": "10-2020-0177326", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제2단계에서 취득된 영상 및 음성 정보는 독립적으로 구분되어 노이즈 신호가 제거되고 정규화를 거친 후인공지능 연산과정에 의해 식별 가능한 패턴 형태로 변환되며, 한 개의 영상 및 음성 내에서 여러 개의 객체 형상이 검출되는 것을 특징으로 하는 인공지능 기반 물류 추적 관리 및 처리 방법."}
{"patent_id": "10-2020-0177326", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제3단계에서 판별된 패턴 정보를 영상의 경우 P개의 픽셀 좌표로 특정된 영역을 한 개의 형상으로 지정하여 R차원 임베딩(embedding)으로 변환할 수 있으며, 사전 정의된 식별 라벨(label)와 매칭하거나 임의의 식별라벨을 부여하여 인 있는 한편, 음성의 경우 사전을 토대로 텍스트로 변환하여 그 정보의 단어(word), 문구(phrase) 또는 문장(sentence)를 라벨로 활용하는 것을 특징으로 하는 인공지능 기반 물류 추적 관리 및 처리방법."}
{"patent_id": "10-2020-0177326", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,공개특허 10-2022-0087019-3-상기 제4단계에서 단위 형상 간의 관계를 식별 라벨 및 형상의 임베딩 간 유사도를 기반으로 분석해 주는 것을특징으로 하는 인공지능 기반 물류 추적 관리 및 처리 방법."}
{"patent_id": "10-2020-0177326", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제5단계에서 제1단계에서 M개의 고정 장비로 취득되는 인지 정보에 대한 제3단계의 형상 인식 정보 및 제4단계의 관계 인식 정보와 제1단계에서 L개의 이동 장비로 취득되는 인지 정보에 대한 제3단계의 형상 인식 정보및 제4단계의 관계 인식 정보에 대해 사전 설정되거나 변경 가능한 신뢰도 가중치(가중치 범위: 0~1, 가중치 총합)를 부여한 후 선형 합산하여 제3단계의 형상 인식 정보 및 제4단계의 관계 인식 정보를 교정하여 최종 형상인식 정보 및 최종 관계 인식 정보를 도출하여 데이터베이스를 구성하거나 외부의 물류 관리 DB 등에 기록된 텍스트의 식별 정보와 결합하여 신규 데이터베이스로 확장하는 것을 특징으로 하는 인공지능 기반 물류 추적 관리및 처리 방법."}
{"patent_id": "10-2020-0177326", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제6단계에서 제5단계의 최종 형상 인식 정보 및 최종 관계 인식 정보를 활용하여 작업현장 내부 및 외부에서의 물류 추적 관리 및 처리를 위해 입출고 되는 물류의 외형검사 및 물류 패턴 분석, 사물 위치 특정 및 수량관리와 이상 물류 감지, 소체적 사물 식별 및 다품종 물류 분별을 해주는 기능을 제공하는 것을 특징으로 하는인공지능 기반 물류 추적 관리 및 처리 방법."}
{"patent_id": "10-2020-0177326", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 물류 추적 관리 및 처리 방법에 관한 것으로, 고정 장비 및 이동 장비에 부착된 카메라 모듈 및 마이크 모듈을 포함하는 기기를 이용하여 영상 및 음성 정보를 수집하여 취득하는 제1단계; 취득된 영상 및 음성 정보를 독립적으로 구분하여 노이즈 신호를 제거하고, 인공지능 연산과정에 의해 식별 가능한 패턴 형 태로 자동 판별하는 제2단계; 판별된 패턴 정보를 토대로 물류 및 작업자 형상을 분석하여 형상 인식 정보를 특 정하는 제3단계; 상기 제3단계의 결과로 구분된 단위 형상 간의 관계를 분석하여 관계 인식 정보를 특정하는 제4 단계; 상기 제3단계 및 제4단계의 결과에 대해 가중치 합산하여 최종 인식 정보를 교정하고 식별 정보를 결합하 는 제5단계; 및 상기 제5단계의 결과를 이용하여 물류 처리작업 현장 내부 및 외부에서 물류 추적 관리 및 처리 하는 제6단계;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2020-0177326", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 물류 추적 관리 및 처리 방법에 관한 것으로, 더욱 상세하게는 시청각 및 텍스트 정보 를 인식하고 설정된 목적에 맞게 작동하는 인공지능을 활용하는 물류 추적 관리 및 처리 방법에 관한 것이다."}
{"patent_id": "10-2020-0177326", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "특정 목적에 따라 다양한 정보를 해석할 수 있는 인공지능 기술과 복잡한 기계공정을 정교하게 처리할 수 있는 로보틱스 기술이 발달함에 따라, 각종 산업 분야에서 인공지능 기반 스마트 자동화 개념이 상세하게 정립되고 있다. 근래의 상용 인공지능 기술은 주로 딥러닝 알고리즘을 활용하여 영상, 음성, 텍스트 등 정보를 인식하고 목적에 따라 적합한 형태로 변환해주는 형태로 발전해왔는데, 이 기술로 창출되는 부가가치가 큰 자율주행 자동 차, 스마트 공장, 스마트 비서 등의 상용 제품을 우리 주변에서도 접할 수 있다. 반면, 로보틱스 기술은 2족 또 는 4족 보행 로봇 형태 등의 기계로서 상당한 노동력이 요구되거나 위험성이 있는 작업을 효과적으로 수행할 수 있도록 발전해왔으며, 부분적으로 근로자의 생산성, 작업효율성 향상 또는 안전 보호를 위한 웨어러블 형태의 기계 제조에도 활용되어 왔다. 한편, 현재의 물류 산업에서 물체를 인식하고 물류를 적절하게 분류하여 포장하고 이동하는 작업이 대체적으로 인간의 노동력에 의존하고 있다. 많은 양의 운반이 어려운 물체부터 세밀한 소체적 물체를 단시간에 분류하는 경우, 투입 인력의 한계 및 인적 오류(human error)로 인해 재물 파손, 재화 손실 등이 발생하며 해마다 증가하 는 인력 대비 물동량으로 인해 막대한 경제적, 산업적 손실이 야기되고 있다."}
{"patent_id": "10-2020-0177326", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 목적은 영상, 음성, 텍스트 정보의 데이터를 인식하여 설정된 목적에 맞게 인공지능을 활용하여 전반적인 제반 작업 효율성 및 물류 처리 유연성을 개선하고 취급 물류의 포 괄성을 증진하는 인공지능 기반 물류 추적 관리 및 처리 방법을 제공하는 데 있다."}
{"patent_id": "10-2020-0177326", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 인공지능 기반 물류 추적 관리 및 처리 방법은 고정 장비 및 이동 장비에 부착된 카메라 모듈 및 마이크 모듈을 포함하는 기기를 이용하여 영상 및 음성 정보를 수집하여 취득하 는 제1단계; 취득된 영상 및 음성 정보를 독립적으로 구분하여 노이즈 신호를 제거하고, 인공지능 연산과정에 의해 식별 가능한 패턴 형태로 자동 판별하는 제2단계; 판별된 패턴 정보를 토대로 물류 및 작업자 형상을 분석 하여 형상 인식 정보를 특정하는 제3단계; 상기 제3단계의 결과로 구분된 단위 형상 간의 관계를 분석하여 관계 인식 정보를 특정하는 제4단계; 상기 제3단계 및 제4단계의 결과에 대해 가중치 합산하여 최종 인식 정보를 교 정하고 식별 정보를 결합하는 제5단계; 및 상기 제5단계의 결과를 이용하여 물류 처리작업 현장 내부 및 외부에 서 물류 추적 관리 및 처리하는 제6단계;를 포함하는 것을 특징으로 한다. 상기 인지 정보는 영상 또는 음성 형태이며, 인공지능 연산과정은 컨벌루셔널(convolutional) 연산이 수반되는 필터를 이용하거나 입력 시점별로 구분된 N개의 단위 정보를 한 개의 순차적인 입력 단위로 설정하여 이에 대해 비선형(non-linear) 함수에 의한 변환을 거치는 학습 구조를 수반하며 분류 또는 판별 태스크를 수행하여 식별 가능한 패턴을 추정하는 것을 특징으로 한다. 상기 인지 정보는 고정 장비 및 이동 장비에 부착된 기기 내부의 어플리케이션 프로세서에서 처리하거나 네트워 크를 통해 전송하여 원격 서버에서 처리하는 것을 특징으로 한다. 상기 제2단계에서 취득된 영상 및 음성 정보는 독립적으로 구분되어 노이즈 신호가 제거되고 정규화를 거친 후 인공지능 연산과정에 의해 식별 가능한 패턴 형태로 변환되며, 한 개의 영상 및 음성 내에서 여러 개의 객체 형 상이 검출되는 것을 특징으로 한다. 상기 제3단계에서 판별된 패턴 정보를 영상의 경우 P개의 픽셀 좌표로 특정된 영역을 한 개의 형상으로 지정하 여 R차원 임베딩(embedding)으로 변환할 수 있으며, 사전 정의된 식별 라벨(label)와 매칭하거나 임의의 식별 라벨을 부여하여 인 있는 한편, 음성의 경우 사전을 토대로 텍스트로 변환하여 그 정보의 단어(word), 문구 (phrase) 또는 문장(sentence)를 라벨로 활용하는 것을 특징으로 한다. 상기 제4단계에서 단위 형상 간의 관계를 식별 라벨 및 형상의 임베딩 간 유사도를 기반으로 분석해 주는 것을 특징으로 한다. 상기 제5단계에서 제1단계에서 M개의 고정 장비로 취득되는 인지 정보에 대한 제3단계의 형상 인식 정보 및 제4 단계의 관계 인식 정보와 제1단계에서 L개의 이동 장비로 취득되는 인지 정보에 대한 제3단계의 형상 인식 정보 및 제4단계의 관계 인식 정보에 대해 사전 설정되거나 변경 가능한 신뢰도 가중치(가중치 범위: 0~1, 가중치 총 합)를 부여한 후 선형 합산하여 제3단계의 형상 인식 정보 및 제4단계의 관계 인식 정보를 교정하여 최종 형상 인식 정보 및 최종 관계 인식 정보를 도출하여 데이터베이스를 구성하거나 외부의 물류 관리 DB 등에 기록된 텍 스트의 식별 정보와 결합하여 신규 데이터베이스로 확장하는 것을 특징으로 한다. 상기 제6단계에서 제5단계의 최종 형상 인식 정보 및 최종 관계 인식 정보를 활용하여 작업현장 내부 및 외부에 서의 물류 추적 관리 및 처리를 위해 입출고 되는 물류의 외형검사 및 물류 패턴 분석, 사물 위치 특정 및 수량 관리와 이상 물류 감지, 소체적 사물 식별 및 다품종 물류 분별을 해주는 기능을 제공하는 것을 특징으로 한다."}
{"patent_id": "10-2020-0177326", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같이, 본 발명의 인공지능 기반 물류 추적 관리 및 처리 방법에 따르면 물류 추적 관리 및 처리에 있어 작업 프로세스에서 획득되는 각종 정보를 결합하여 목적에 따라 분석된 재생산 정보를 이용하여, 보다 폭넓은 종류의 물류에 대한 유연한 취급 및 처리를 가능하게 하며 작업자의 편의성을 개선하고 더 나아가 일부 작업을 기계로 대체할 수 있게 되므로 자동화 효율을 높이면서 전체적으로 물류 파손 등을 줄이고 단위 시간당 처리량 을 늘려 경제적 이익을 창출할 수 있는 산업적 효과를 기대할 수 있다."}
{"patent_id": "10-2020-0177326", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다.그러면 본 발명에 따른 인공지능 기반 물류 추적 관리 및 처리 시스템 및 방법의 바람직한 실시예를 자세히 설 명하기로 한다. 도 1은 본 발명에 따른 인공지능 기반 물류 추적 관리 및 처리 시스템의 구성도이다. 도 1을 참조하면, 본 발명에 따른 인공지능 기반 물류 추적 관리 및 처리 시스템은 수집부, 전처리부 , 판별부, 분석부, 교정부, 관리 및 처리부를 포함하여 구성된다. 상기 수집부는 고정 장비 및 이동 장비에 부착된 카메라 모듈 및 마이크 모듈을 포함하는 기기 를 이용하여 영상 및 음성 정보를 인지 정보로 수집하여 취득한다. 상기 인지 정보는 영상 또는 음성 형태이며, 상기 인공지능 연산과정은 컨벌루셔널(convolutional) 연산이 수반 되는 필터를 이용하거나 입력 시점별로 구분된 N개의 단위 정보를 한 개의 순차적인 입력 단위로 설정하여 이에 대해 비선형(non-linear) 함수에 의한 변환을 거치는 학습 구조를 수반하며 분류 또는 판별 태스크를 수행하여 식별 가능한 패턴을 추정할 수 있다. 한편, 상기 인지 정보는 M개의 고정 장비 또는 L개의 이동 장비에 부착된 기기 내부의 어플리케이션 프로세서에 서 처리하거나 네트워크를 통해 전송하여 원격 서버에서 처리할 수 있다. 상기 전처리부는 취득된 영상 및 음성 정보를 독립적으로 구분하여 노이즈 신호를 제거하는 등 전처리한다. 즉, 상기 전처리부는 취득된 영상 및 음성 정보는 독립적으로 구분되어 노이즈 신호가 제거되 고 정규화를 거친 후 인공지능 연산과정에 의해 식별 가능한 패턴 형태로 변환되며, 한 개의 영상 및 음성 내에 서 여러 개의 객체 형상이 검출될 수 있다. 상기 판별부는 인공지능 연산과정에 의해 식별 가능한 패턴 형태로 자동 판별한다. 상기 분석부는 판별된 패턴 정보를 토대로 물류 및 작업자 형상을 분석하여 형상 인식 정보를 특정하고, 특정한 형상 인식 정보로 구분된 단위 형상 간의 관계를 분석하여 관계 인식 정보를 특정한다. 여기서, 판별된 패턴 정보를 영상의 경우 P개의 픽셀 좌표로 특정된 영역을 한 개의 형상으로 지정하여 R차원 임베딩 (embedding)으로 변환할 수 있으며, 사전 정의된 식별 라벨(label)과 매칭하거나 임의의 식별 라벨을 부여하는 한편, 음성의 경우 사전을 토대로 텍스트로 변환하여 그 정보의 단어(word), 문구(phrase) 또는 문장(sentenc e)을 라벨로 활용할 수 있다. 한편, 단위 형상 간의 관계는 식별 라벨 및 형상의 임베딩 간 유사도를 기반으로 분석해 준다. 상기 교정부는 형상 인식 정보와 관계 인식 정보에 대해 가중치 합산하여 최종 인식 정보와 최종 관계 인 식 정보를 교정하고 식별 정보를 결합한다. 여기서, 최종 형상 인식 정보 및 최종 관계 인식 정보를 활용하여 작업현장 내부 및 외부에서의 물류 추적 관리 및 처리를 위해 입출고 되는 물류의 외형검사 및 물류 패턴 분석, 사물 위치 특정 및 수량 관리와 이상 물류 감지, 소체적 사물 식별 및 다품종 물류 분별을 해 줄 수 있다. 상기 관리 및 처리부는 최종 인식 정보와 최종 관계 인식 정보를 교정하고 식별 정보를 이용하여 물류 처 리작업 현장 내부 및 외부에서 물류 추적 관리 및 처리하며, 물류 처리작업 현장 외부에서 물류 추적 관리 및 처리할 수 있다. 도 2는 본 발명에 따른 인공지능 기반 물류 추적 관리 및 처리 방법의 흐름도이다. 도 2를 참조하면, 본 발명에 따른 인공지능 기반 물류 추적 관리 및 처리 방법은 먼저, 고정 장비 및 이동 장비 에 부착된 카메라 모듈 및 마이크 모듈을 포함하는 기기를 이용하여 영상 및 음성 정보를 수집하여 취득한다 (S110). 여기서, 상기 인지 정보는 영상 또는 음성 형태이며, 상기 인공지능 연산과정은 컨벌루셔널(convolutional) 연 산이 수반되는 필터를 이용하거나 입력 시점별로 구분된 N개의 단위 정보를 한 개의 순차적인 입력 단위로 설정 하여 이에 대해 비선형(non-linear) 함수에 의한 변환을 거치는 학습 구조를 수반하며 분류 또는 판별 태스크를 수행하여 식별 가능한 패턴을 추정할 수 있다. 한편, 상기 인지 정보는 M개의 고정 장비 또는 L개의 이동 장비에 부착된 기기 내부의 어플리케이션 프로세서에 서 처리하거나 네트워크를 통해 전송하여 원격 서버에서 처리할 수 있다. 이어서, 취득된 영상 및 음성 정보를 독립적으로 구분하여 노이즈 신호를 제거하는 등 전처리하고, 인공지능 연 산과정에 의해 식별 가능한 패턴 형태로 자동 판별한다(S120). 상기 S120 단계에서 취득된 영상 및 음성 정보는 독립적으로 구분되어 노이즈 신호가 제거되고, 정규화를 거친 후 인공지능 연산과정에 의해 식별 가능한 패턴 형태로 변환되며, 한 개의 영상 및 음성 내에서 여러 개의 객체 형상이 검출될 수 있다. 다음에, 상기 판별된 패턴 정보를 토대로 물류 및 작업자 형상을 분석하여 형상 인식 정보를 특정한다(S130). 상기 S130 단계에서 판별된 패턴 정보를 영상의 경우 P개의 픽셀 좌표로 특정된 영역을 한 개의 형상으로 지정 하여 R차원 임베딩(embedding)으로 변환할 수 있으며, 사전 정의된 식별 라벨(label)와 매칭하거나 임의의 식별 라벨을 부여하여 인 있는 한편, 음성의 경우 사전을 토대로 텍스트로 변환하여 그 정보의 단어(word), 문구 (phrase) 또는 문장(sentence)를 라벨로 활용할 수 있다. 다음으로, 상기 S130 단계의 결과로 구분된 단위 형상 간의 관계를 분석하여 관계 인식 정보를 특정한다(S140). 상기 제4단계에서 단위 형상 간의 관계를 식별 라벨 및 형상의 임베딩 간 유사도를 기반으로 분석해 줄 수 있다. 다음에, 상기 S130 단계 및 S140 단계의 결과에 대해 가중치 합산하여 최종 인식 정보를 교정하고 식별 정보를 결합한다(S150). 여기서, 상기 S150 단계에서 S110 단계에서 M개의 고정 장비로 취득되는 인지 정보에 대한 S130 단계의 형상 인 식 정보 및 S140 단계의 관계 인식 정보와 S110 단계에서 L개의 이동 장비로 취득되는 인지 정보에 대한 S130 단계의 형상 인식 정보 및 S140 단계의 관계 인식 정보에 대해 사전 설정되거나 변경 가능한 신뢰도 가중치(가 중치 범위: 0~1, 가중치 총합)를 부여한 후 선형 합산하여 S130 단계의 형상 인식 정보 및 S140 단계의 관계 인 식 정보를 교정하여 최종 형상 인식 정보 및 최종 관계 인식 정보를 도출하여 데이터베이스를 구성하거나 외부 의 물류 관리 DB 등에 기록된 텍스트의 식별 정보와 결합하여 신규 데이터베이스로 확장할 수 있다. 다음으로, 상기 S150 단계의 결과를 이용하여 물류 처리작업 현장 내부 및 외부에서 물류 추적 관리 및 처리한 다(S160). 상기 S160 단계에서 S150 단계의 최종 형상 인식 정보 및 최종 관계 인식 정보를 활용하여 작업현장 내부 및 외 부에서의 물류 추적 관리 및 처리를 위해 입출고 되는 물류의 외형검사 및 물류 패턴 분석, 사물 위치 특정 및 수량 관리와 이상 물류 감지, 소체적 사물 식별 및 다품종 물류 분별을 해주는 기능을 제공할 수 있다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2020-0177326", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 인공지능 기반 물류 추적 관리 및 처리 시스템의 구성도이다. 도 2는 본 발명에 따른 인공지능 기반 물류 추적 관리 및 처리 방법의 흐름도이다."}
