{"patent_id": "10-2015-0114141", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0019818", "출원번호": "10-2015-0114141", "발명의 명칭": "안테나 장치를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "정진우"}}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제 1 면 및 상기 제 1 면과 반대 방향으로 향하는 제 2 면을 포함하는 하우징;상기 하우징의 제 1 면을 통하여 노출된 디스플레이;상기 제 1 면 및 상기 제 2 면 사이에 배치된 그라운드 부재;상기 하우징의 내부 및/또는 상기 하우징의 일부에 적어도 일부 배치된 안테나 방사체;상기 안테나 방사체와 전기적으로 연결된 통신 회로;상기 하우징의 내부에 배치되거나, 상기 하우징의 제 2 면의 일부를 형성하는 도전성 부재(conductive member);및상기 그라운드 부재 및 상기 도전성 부재와 전기적으로 연결된 제어 회로를 포함하고,상기 제어 회로는,상기 안테나 방사체와 상기 통신 회로가 전기적으로 연결될 때, 상기 도전성 부재를 상기 그라운드 부재에 선택적으로 연결하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제어 회로는,상기 안테나 방사체가 상기 그라운드 부재에 전기적으로 연결되지만, 상기 도전성 부재에 전기적으로 연결되지않는 제 1 상태, 또는상기 안테나 방사체가 상기 그라운드 부재 및 상기 도전성 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제어 회로는,상기 전자 장치에 사용자가 근접했는지 여부에 적어도 일부 기초하여, 상기 제 1 상태 또는 제 2 상태 중 하나를 선택적으로 제공하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 제어 회로는,상기 안테나 방사체의 수신 감도를 모니터링하고,상기 모니터링된 수신 감도에 적어도 일부 기초하여, 상기 제 1 상태 또는 제 2 상태 중 하나를 선택적으로 제공개특허 10-2017-0019818-3-공하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 전자 장치는, 상기 전자 장치에 사용자가 근접했는지 여부를 나타내는 신호를 발생하는 센서를 더 포함하고,상기 제어 회로는, 상기 센서로부터의 신호에 적어도 일부 기초하여, 상기 제 1 상태 또는 제 2 상태 중 하나를선택적으로 제공하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2 항에 있어서,상기 전자장치는, 유저 인터페이스를 더 포함하고,상기 제어 회로는, 상기 유저 인터페이스를 통하여 수신된 사용자 입력에 적어도 일부 기초하여, 상기 제 1 상태 또는 제 2 상태 중 하나를 선택적으로 제공하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 2 항에 있어서,상기 전자 장치는, 무선 충전 회로를 더 포함하고,상기 제어 회로는,상기 제 1 상태에서, 상기 무선 충전 회로 및 상기 도전성 부재를 전기적으로 연결하고,상기 도전성 부재 및 상기 무선 충전 회로를 이용하여, 외부로부터 무선으로 전력을 수신하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 2 항에 있어서,상기 통신 회로는, 근거리 통신 회로를 포함하고,상기 제어 회로는,상기 제 1 상태에서, 상기 근거리 통신 회로 및 상기 도전성 부재를 전기적으로 연결하고,외부 장치와 상기 근거리 통신 회로를 이용하여 통신을 수행하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 2 항에 있어서,상기 통신 회로는, 마그네틱 신호에 기반한 통신 회로를 포함하고,상기 제어 회로는, 상기 제 1 상태에서, 상기 마그네틱 신호에 기반한 통신 회로 및 상기 도전성 부재를 전기적으로 연결하고,외부 장치와 상기 마그네틱 신호에 기반한 통신 회로를 이용하여 통신을 수행하는 장치.공개특허 10-2017-0019818-4-청구항 10 제 1 항에 있어서,상기 도전성 부재는,금속 플레이트, 코일형 금속 패턴, 또는 환형 금속 부재 중 적어도 하나를 포함하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 안테나 방사체는,상기 디스플레이를 적어도 일부 둘러싸는 형상을 가지는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 도전성 부재는 제 1 단부 및 제 2 단부를 포함하는 도전성 패턴을 포함하며,상기 제어 회로는, 상기 도전성 부재 상의 제 1 단부 및 제 2 단부를 상기 그라운드 부재에 선택적으로 전기적으로 연결하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서, 상기 도전성 부재는, 제 1 단부 및 제 2 단부를 포함하는 도전성 패턴을 포함하며,상기 제어 회로는, 상기 도전성 부재가 상기 그라운드 부재에 연결되지 않은 상태에서, 상기 제 1 단부 및 제 2단부를 전기적으로 연결하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서,상기 전자 장치는, 상기 하우징에 부착되고, 사용자의 신체의 일부에 탈착 가능하도록 구성된 결착구를 더 포함하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항에 있어서,상기 전자 장치는 인쇄회로기판(PCB)를 더 포함하고, 상기 그라운드 부재는 상기 PCB의 일부를 포함하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 1 항에 있어서, 상기 디스플레이는 OLED 디스플레이를 포함하며, 상기 OLED 디스플레이는 플렉서블 인쇄회로기판(FPCB)를 포함하고, 공개특허 10-2017-0019818-5-상기 FPCB는 상기 그라운드 부재를 포함하는 구조에 연결되는 부분을 포함하는 장치."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "전자 장치의 동작 방법에 있어서,제 1 항의 전자장치에 의하여, 상기 전자장치의 상기 안테나 방사체와 상기 통신 회로를 전기적으로 연결하는동작; 및제 1 항의 전자장치에 의하여, 상기 전자장치의 상기 도전성 부재를 상기 그라운드 부재에 연결하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은,상기 안테나 방사체가 상기 그라운드 부재에 전기적으로 연결되지만, 상기 도전성 부재에 전기적으로 연결되지않는 제 1 상태, 또는상기 안테나 방사체가 상기 그라운드 부재 및 상기 도전성 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공하는 방법."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은,상기 전자 장치가 사용자에게 근접했는지를 판단하는 동작; 및상기 판단에 기초하여, 상기 제 1 상태 또는 상기 제 2 상태 중 하나를 선택적으로 제공하는 동작을 포함하는방법."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은,상기 전자 장치가 사용자에게 근접했는지를 판단하는 동작; 및상기 판단에 기초하여, 상기 제 1 상태 또는 상기 제 2 상태 중 하나를 선택적으로 제공하는 동작을 포함하는방법."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 18 항에 있어서,상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은,상기 안테나 방사체의 수신 감도를 모니터링하는 동작; 및상기 모니터링된 수신 감도에 적어도 일부 기초하여, 상기 제 1 상태 또는 상기 제 2 상태 중 하나를 선택적으로 제공하는 동작을 포함하는 방법.공개특허 10-2017-0019818-6-청구항 22 제 18 항에 있어서,상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은,사용자 입력을 수신하는 동작; 및상기 사용자 입력을 기초하여, 상기 제 1 상태 또는 상기 제 2 상태 중 하나를 선택적으로 제공하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0114141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 18 항에 있어서,제 1 상태에서, 상기 도전성 부재를 적어도 일부 포함하고 외부로 신호를 전송하거나 외부로부터 신호를 수신하도록 구성된 전기적 경로를 제공하는 동작; 및상기 전기적 경로를 이용하여, 외부로부터 무선으로 전력을 수신하거나, 외부 장치와 근거리 통신을 하거나, 또는 외부로부터 NFC(Near Field Communication) 통신을 하거나, 또는 외부로 마그네틱 신호 기반의 통신을 하는동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0114141", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예에 따르면, 전자 장치는 제 1 면 및 상기 제 1 면과 반대 방향으로 향하는 제 2 면을 포함 하는 하우징과, 상기 하우징의 제 1 면을 통하여 노출된 디스플레이와, 상기 제 1 면 및 상기 제 2 면 사이에 배 치된 그라운드 부재와, 상기 하우징의 내부 및/또는 상기 하우징의 일부에 적어도 일부 배치된 안테나 방사체와, 상기 안테나 방사체와 전기적으로 연결된 통신 회로와, 상기 하우징의 내부에 배치되거나, 상기 하우징의 제 2 면의 일부를 형성하는 도전성 부재, 및 상기 그라운드 부재 및 상기 도전성 부재와 전기적으로 연결된 제어 회로 를 포함할 수 있다. 여기서, 상기 제어 회로는, 상기 안테나 방사체와 상기 통신 회로가 전기적으로 연결될 때, 상기 도전성 부재를 상기 그라운드 부재에 선택적으로 연결하도록 구성될 수 있다. 다양한 다른 실시 예들이 가 능하다."}
{"patent_id": "10-2015-0114141", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 안테나 성능을 확보하기 위한 안테나 장치를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2015-0114141", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 위치 추적 장치, 무선 인터넷, 해외 로밍 서비스 등 각각의 서비스에 맞는 적어도 하나의 안테나가 탑재될 수 있다. 전자 장치가 얇아지며 다기능을 위해 탑재되는 부품수의 증가에 따라 무선 이동 통신의 중요한 요소인 안테나 성능 확보가 어려울 수 있다."}
{"patent_id": "10-2015-0114141", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "디자인 측면에서 사용자 기기 자체의 두께가 얇아지고 안테나 실장 공간이 부족한 상황에서 인체와 근접한 위치 에 안테나가 실장되는 경우, 인체로 인하여 안테나 성능이 열화될 수 있다. 웨어러블(wearable) 기기의 경우 사 용자에 착용되어 사용되기 때문에, 인체로 인한 안테나 성능의 열화가 발생 할 수 있다. 본 발명의 다양한 실시 예들은 무선 통신 기능을 가지는 전자 장치의 크기 제약 또는 인체 영향 개선을 통해 안 테나 성능을 확보하기 위한 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2015-0114141", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 전자 장치는 제 1 면 및 상기 제 1 면과 반대 방향으로 향하는 제 2 면을 포함하 는 하우징과, 상기 하우징의 제 1 면을 통하여 노출된 디스플레이와, 상기 제 1 면 및 상기 제 2 면 사이에 배 치된 그라운드 부재(ground member)과, 상기 하우징의 내부 및/또는 상기 하우징의 일부에 적어도 일부 배치된 안테나 방사체와, 상기 안테나 방사체와 전기적으로 연결된 통신 회로와, 상기 하우징의 내부에 배치되거나, 상 기 하우징의 제 2 면의 일부를 형성하는 도전성 부재(conductive member), 및 상기 그라운드 부재 및 상기 도전성 부재와 전기적으로 연결된 제어 회로를 포함할 수 있다. 여기서, 상기 제어 회로는, 상기 안테나 방사체와 상기 통신 회로가 전기적으로 연결될 때, 상기 도전성 부재를 상기 그라운드 부재에 선택적으로 연결하도록 구 성될 수 있다."}
{"patent_id": "10-2015-0114141", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예들에 따른 전자 장치는, 인체로 인한 안테나 성능의 열화를 개선할 수 있다. 본 발명의 다양한 실시 예들에 따른 전자 장치는, 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예들에 따른 전자 장치는, 공간 제약을 해결함으로써 다양한 디자인을 제공할 수 있다."}
{"patent_id": "10-2015-0114141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시 예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구성요 소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어(hardware)적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현 은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로 세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU(central processing unit) 또는 AP(applicationprocessor))를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크 스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플 레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예들에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘 택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD) 등), 직물 또는 의류 일체형(예: 전자 의복), 신 체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나 를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템(GNSS, global navigation satellite system), EDR(event data recorder), FDR(flight data recorder), 자동차 인포 테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기 (avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things)(예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터 (toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예들에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전 자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예들에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 다양한 실시 예들에 따른 전자 장치를 포함하는 네트워크 환경을 도시하는 도면이다. 도 1을 참조하여, 다양한 실시 예들에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치 은 버스(bus) , 프로세서(processor), 메모리(memory) , 입출력 인터페이스(input/output interface) , 디스플레이(display) , 및 통신 인터페이스(communication interface) 를 포함할 수 있다. 어떤 실시 예에서는, 전자 장치 는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(110-170)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/또 는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치(central processing unit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신 에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 1)의 적어도 하나의 다른 구성요소에 관계된 명령(command) 또는 데이터(data)를 저장할 수 있다. 한 실시 예에 따르면, 메모리은 소프트웨어(software) 및/또는 프로그램(program)을 저장할 수 있다. 프로그램 은, 예를 들면, 커널(kernel) , 미들웨어(middleware), 어플리케이션 프로그래밍 인터페이스 (application programming interface(API)), 및/또는 어플리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일부는, 운영 시스템(operating system(OS))으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어 143, API 145, 또는 어플리케이션 프로그램147)에 구현 된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스 110, 프로세서 120, 또는 메모리 130 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로그램 에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터 페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따 라 처리할 수 있다. 예를 들면, 미들웨어 은 어플리케이션 프로그램 중 적어도 하나에 전자 장치 의 시스템 리소스(예: 버스 110, 프로세서 120, 또는 메모리 130 등)를 사용할 수 있는 우선 순위를 부여 할 수 있다. 예컨대, 미들웨어는 상기 적어도 하나에 부여된 우선 순위에 따라 상기 하나 이상의 작업 요 청들을 처리함으로써, 상기 하나 이상의 작업 요청들에 대한 스케쥴링(scheduling) 또는 로드 밸런싱(load balancing) 등을 수행할 수 있다. API는, 예를 들면, 어플리케이션이 커널 또는 미들웨어 에서 제공되는 기능을 제어하기 위 한 인터페이스로, 예를 들면, 파일 제어(file control), 창 제어(window control), 영상 처리(image processing), 또는 문자 제어(character control) 등을 위한 적어도 하나의 인터페이스 또는 함수(function) (예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(liquid crystal display(LCD)), 발광 다이오드(light- emitting diode(LED)) 디스플레이, 유기 발광 다이오드(organic light-emitting diode(OLED)) 디스플레이, 또 는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트 (text), 이미지(image), 비디오(video), 아이콘(icon), 또는 심볼(symbol) 등)을 디스플레이 할 수 있다. 디스 플레이는, 터치 스크린(touch screen)을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일 부를 이용한 터치(touch), 제스처(gesture), 근접(proximity), 또는 호버링(hovering) 입력을 수신할 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제1 외부 전자 장치, 제2 외부 전자 장치, 또는 서버 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제2 외부 전자 장치 104 또는 서버 106)와 통신할 수 있다. 무선 통신은, 예를 들면, 셀룰러 통신 프로토콜로서, 예를 들면, LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(global system for mobilecommunications) 등 중 적어도 하나를 사용할 수 있다. 또한, 무선 통신은, 예를 들면, 근거리 통신을 포 함할 수 있다. 근거리 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스(Bluetooth), NFC(near field communication), 또는 GNSS(global navigation satellite system) 등 중 적어도 하나를 포함할 수 있다. GNSS는 사용 지역 또는 대역폭 등에 따라, 예를 들면, GPS(global positioning system), Glonass(global navigation satellite system), Beidou Navigation satellite system(이하, \"Beidou\") 또는 Galileo, the European global satellite-based navigation system 중 적어도 하나를 포함할 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 혼용되어 사용(interchangeably used)될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 통신 네트워크 (telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 네트워크(telephone network) 중 적어도 하나를 포함할 수 있다. 제1 및 제2 외부 전자 장치(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 한 실시 예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시 예들에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치(102,104), 또는 서버에서 실행될 수 있다. 한 실시 예에 따르면, 전자 장치(10 1)가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치 102, 104, 또는 서버 106)에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치102, 104, 또는 서버 106)는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신 된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들 면, 클라우드 컴퓨팅(cloud computing), 분산 컴퓨팅(distributed computing), 또는 클라이언트-서버 컴퓨팅 (client-server computing) 기술이 이용될 수 있다. 도 2는 다양한 실시 예에 따른 전자 장치의 블록도이다. 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치 는 하나 이상의 프로세서(예: AP(application processor)), 통신 모듈, 가입자 식별 모듈 , 메모리, 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 어플리케이션 프로그램을 구동하여 프로세서에 연결된 다수 의 하드웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로 세서는, 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시 예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서는 도 2에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈 221)를 포함할 수도 있다. 프로세 서는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈은, 도 1의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모듈, Beidou 모듈, 또는 Galileo 모듈), NFC 모듈 및 RF(radio frequency) 모듈을 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신 네트워크를 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서 비스 등을 제공할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM(subscriber identification module) 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능 을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 각각은, 예를 들면, 해당하는 모듈 을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시 예에 따르면, 셀룰러 모 듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다.RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜시 버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또는 안테나(antenna) 등을 포함할 수 있다. 다른 실시 예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포 함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리 130)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(volatile memory)(예: DRAM(dynamic RAM(random access memory)), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile memory)(예: OTPROM(one time programmable ROM(read only memory)), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메 모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(MultiMediaCard) 또는 메모리 스틱(memory stick) 등을 더 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 전 자 장치와 기능적으로 및/또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(gesture sensor)(240A), 자이 로 센서(gyro sensor)(240B), 기압 센서(barometer)(240C), 마그네틱 센서(magnetic sensor)(240D), 가속도 센 서(acceleration sensor)(240E), 그립 센서(grip sensor)(240F), 근접 센서(proximity sensor)(240G), 컬러 센 서(color sensor)(240H)(예: RGB(red, green, blue) 센서), 생체 센서(medical sensor)(240I), 온/습도 센서 (temperature-humidity sensor)(240J), 조도 센서(illuminance sensor)(240K), 또는 UV(ultra violet) 센서 (240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로(additionally or alternatively), 센 서 모듈은, 예를 들면, 후각 센서(E-nose sensor), EMG 센서(electromyography sensor), EEG 센서 (electroencephalogram sensor), ECG 센서(electrocardiogram sensor), IR(infrared) 센서, 홍채 센서(iris scan sensor) 및/또는 지문 센서(finger scan sensor)를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어 도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치 은 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로 세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정전 식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드(keypad)를 포함할 수 있다. 초음파 입력 장치 는 마이크(예: 마이크 288)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응 하는 데이터를 확인할 수 있다. 디스플레이(예: 디스플레이 160)는 패널, 홀로그램 장치, 또는 프로젝터를 포함할 수 있다. 패널은, 도 1의 디스플레이와 동일 또는 유사한 구성을 포함할 수 있다. 패널은, 예를 들 면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널 은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상 을 허공에 보여줄 수 있다. 프로젝터는 스크린(screen)에 빛을 투사하여 영상을 디스플레이 할 수 있다. 스크린은, 예를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 디스플레이는 패널, 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 인 터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적 으로(additionally and alternatively), 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인 터페이스, SD(secure digital) 카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈 은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터 리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배 터리는, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서 210)의 특정 상태, 예를 들면, 부팅 상태, 메시 지 상태 또는 충전 상태 등을 디스플레이할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있 고, 진동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(MediaFloTM) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는 안테나 성능 유지 및/또는 전자파 인체 영향 저감을 위하여, 적어도 하나의 도전성 부재를 플로팅 그라운드(floating ground)로 구성하거나, 또는 전자 장치의 그라운 드에 전기적으로 연결할 수 있다. 제어 회로는 프로세스의 일부이거나, 또는 이와는 별도의 회로일 수 있 다. 또는, 제어 회로는 프로그램 형태로 제공될 수도 있다. 이에 관한 구체적인 내용은, 후술하는 도 4에서 설 명하겠다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시 예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시 예에 따른 전자 장치의 구성요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 도 3은 다양한 실시 예에 따른 프로그램 모듈의 블록도이다. 한 실시 예에 따르면, 프로그램 모듈(예: 프로그램 140)은 전자 장치(예: 전자 장치 101)에 관련된 자원을 제어하는 운영 체제(operating system(OS)) 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플 리케이션 프로그램 147)을 포함할 수 있다. 운영 체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈 (windows), 심비안(symbian), 타이젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface (API)), 및/또는 어플리케이션을 포함할 수 있다. 프로그램 모듈의 적 어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 전자 장치(102, 104), 서버 106등)로부터 다운로드(download) 가능하다. 커널(예: 커널 141)은, 예를 들면, 시스템 리소스 매니저 및/또는 디바이스 드라이버를 포함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시 예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등을 포 함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이 버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 또는 IPC(inter- process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API를 통해 다양한 기능들 을 어플리케이션으로 제공할 수 있다. 한 실시 예에 따르면, 미들웨어(예: 미들웨어 143)은 런타임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀 티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매 니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입출 력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기(life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미디어 매 니저는 다양한 미디어 파일들의 재생에 필요한 포맷(format)을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어 플리케이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리할 수 있다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 (battery) 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매 니저는 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저는, 예를 들면, WiFi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도 착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 디스플레이 또는 통지할 수 있다. 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는 사용자에게 제공 될 그래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 전자 장치 101)가 전화 기능을 포함한 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통 화 매니저(telephony manager)를 더 포함할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들웨 어는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미들웨 어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API 145)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제 공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼(platform) 별로 하나의 API 셋을 제공할 수 있 으며, 타이젠(tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램 147)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일 , 달력, 미디어 플레이어, 앨범, 시계, 건강 관리(health care)(예: 운동량 또는 혈 당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는하나 이상의 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치 101)와 외부 전자 장치(예: 전자 장치 (102, 104)) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의 상, \"정보 교환 어플리케이션\")을 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전 달(notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 (예: 전자 장치(102, 104))로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치(102, 104))의 적어 도 하나의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온(turn-on)/턴-오프(turn-off) 또는 디 스플레이의 밝기(또는, 해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제 공되는 서비스(예: 통화 서비스 또는 메시지 서비스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시 예에 따르면, 어플리케이션은 외부 전자 장치(예: 전자 장치(102, 104))의 속성)에 따라 지정된 어플리케이션(예: 모바일 의료 기기의 건강 관리 어플리케이션 등)을 포함할 수 있다. 한 실시 예에 따르면, 어 플리케이션은 외부 전자 장치(예: 서버 106 또는 전자 장치(102, 104))로부터 수신된 어플리케이션을 포함 할 수 있다. 한 실시 예에 따르면, 어플리케이션은 프리로드 어플리케이션(preloaded application) 또는 서버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시 예 에 따른 프로그램 모듈의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시 예들에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어(firmware), 하드웨어, 또 는 이들 중 적어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로 세서(예: 프로세서 210)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하 나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등을 포함할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어 중 하나 또는 둘 이상의 조 합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록 (logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있 다. 예를 들면, \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예들에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 기록 매체(computer-readable storage media)에 저장된 명령어 로 구현될 수 있다. 상기 명령어가 프로세서(예: 프로세서 120)에 의해 실행될 경우, 상기 하나 이상의 프로세 서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 기록 매체는, 예를 들면, 메모리 이 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digital versatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장 치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또 한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해 서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예 의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예들에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일 부가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예들에 따른 모듈, 프로그램모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법 으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있 다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 문서에서 기재된 기술의 범위를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 문서의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다. 이하에서, 첨부 도면을 참조하여 본 발명의 다양한 실시 예들에 따른 디스플레이 방법 및 장치에 대하여 살펴보 기로 한다. 하지만, 본 발명의 다양한 실시 예들이 하기에서 기술하는 내용에 의해 제한되거나 한정되는 것은 아니므로, 하기의 실시 예에 의거하여 다양한 실시 예들에 적용할 수 있음에 유의하여야 한다. 이하에서 설명되 는 본 발명의 다양한 실시 예들에서는 하드웨어적인 접근 방법을 예시로서 설명한다. 하지만, 본 발명의 다양한 실시 예들에서는 하드웨어와 소프트웨어를 모두 사용하는 기술을 포함하고 있으므로, 본 발명의 다양한 실시 예 들이 소프트웨어 기반의 접근 방법을 제외하는 것은 아니다. 도 4는 본 발명의 실시 예에 따른 전자 장치의 구성을 개략적으로 나타낸 도면이다. 본 발명의 다양한 실시 예 에 따르면, 전자 장치는 도 1의 전자 장치일 수 있다. 도 4를 참조하면, 전자 장치는 적어도 하나의 도전성 부재, 적어도 하나의 안테나 방사체, 적어 도 하나의 그라운드 부재, 통신 회로, 무선 충전 회로, 전력 관리 집적 회로, 메모리 및 제어 회로를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 도전성 부재는 전자 장치에 설치되는 다양한 형태의 금속 부재일 수 있다. 예를 들어, 적어도 하나의 도전성 부재는 전자 장치의 외관을 형성하는 하우징 의 내부에 배치되거나, 또는 하우징의 일면의 일부를 형성할 수 있다. 본 발명의 다양한 실시 예에 따르면, 하우징은 전자 장치의 정면을 형성하는 제 1 면과, 전자 장치의 후면을 형성하는 제 2 면을 포함할 수 있다. 적어도 하나의 도전성 부재는 제 2 면에 배치되거나, 또는 제 2 면의 일부를 형성할 수 있다. 도시하지 않은 전자 장치의 디스플레이는, 제 1 면을 통하여 노출될 수 있 다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 도전성 부재는 통신 회로, 무선 충전 회로 및 제어 회로가 실장되어 있는 도시하지 않은 인쇄회로기판(PCB)과 분리되어 있을 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 금속 플레이트, 코일형 금속 패턴 또는 환형 금속 부재 중 적어도 하나의 형태일 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 무선 충전 회로를 지원하기 위한 방사체(예: 무선 충전 코일)를 포함할 수 있다. 예를 들어 적어도 하나의 도전성 부재는 외부 장치로 무선 전력을 전송하거나, 또는 외부 장치로부터 무선으로 전력을 수신하는데 이용될 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 통신 회로의 다양한 형태의 통신 을 지원하기 위한 안테나 방사체를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 근거리 통신을 지원할 수 있다. 근거리 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스(Bluetooth), NFC(near field communication), 또는 GNSS(global navigation satellite system) 등 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 마그네틱 신호 송수신을 지원할 수 있 다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 통신 또는 무선 충전을 지원하지 않는 금속 패턴 또는 금속 부재일 수도 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 무선 충전 코일을 에워싸는 환형의 금속 패턴 또는 금 속 부재를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 도전성 부재는 제어 회로에 전기적으로 연결될 수 있 다. 적어도 하나의 도전성 부재는 제어 회로의 스위치(480-2)에 전기적으로 연결되어 있고, 프로세서 (480-1)가 스위치(480-2)를 제어하는 동작에 따라 적어도 하나의 그라운드 부재, 통신 회로 또는 무 선 충전 회로 중 하나에 전기적으로 연결되거나, 또는 전기적 플로팅 상태(floating status)로 구성될 수 있다. 여기서, 전기적 플로팅 상태는 다른 전기적 구성 요소에 전기적으로 연결되어 있지 않은 상태 를 가리킬 수 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 안테나 방사체는 다양한 형태의 통신을 지원할 수 있다. 예를 들어, 적어도 하나의 안테나 방사체는 셀룰러 통신에 이용될 수 있다. 셀룰러 통신은, 예를 들면, LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(global system for mobile communications) 등 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 안테나 방사체 중 적어도 일부는 동일한 통신 주파수 대역 또는 서로 다른 통신 주파수 대역에서 공진하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 안테나 방사체는 전자 장치의 다양한 위치에 배치될 수 있다. 예를 들어, 적어도 하나의 안테나 방사체는 전자 장치의 외관을 형성하는 하우징의 내부 및 /또는 하우징의 일부에 적어도 일부 배치될 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 안테나 방사체는 디스플레이(미도시)의 적어도 일부 둘러싸는 형상일 수 있다. 예를 들어, 적어도 하나의 안테나 방사체는 환형 금속 부재를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 하우징은 전자 장치의 외관을 형성하면서, 적어도 하나의 안테나 방 사체로 구성될 수 있다. 하우징이 금속으로 형성된 경우, 적어도 하나의 안테나 방사체는 하우징의 일부 금속 영역 또는 전체 금속 영역으로 구성될 수 있다. 또는, 하우징의 적어도 일부로 구성된 적어도 하나의 안테나 방사체는 노출될 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 안테나 방사체는 통신 회로, 무선 충전 회로 또는 제어 회로가 실장되어 있는 인쇄회로기판(PCB)에 실장될 수도 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 안테나 방사체는 통신 회로에 전기적으로 연결될 수 있다. 적어도 하나의 안테나 방사체는 도시하지 않은 인쇄회로기판(PCB)의 그라운드(이하, ‘그라운드’) 에 전기적으로 연결될 수 있다. 예를 들어, 적어도 하나의 안테나 방사체는 제 1 단부 및 제 2 단부를 포 함하는 도전성 패턴을 포함하고, 제 1 단부는 통신 회로에 전기적으로 연결되고, 제 2 단부는 인쇄회로기 판(PCB) 그라운드에 전기적으로 연결될 수 있다. 통신 회로는 적어도 하나의 안테나 방사체로 전류를 제공하고, 전류는 적어도 하나의 안테나 방사체의 도전성 패턴을 따라 순환되어 인쇄회로기판(PCB) 그라운 드로 유입되고, 무선 전자기파를 송수신 가능한 전송 라인이 형성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 안테나 방사체는 모노폴 안테나, 다이폴 안테나, IFA(inverted-F Antenna), PIFA(Planar Inverted-F Antenna), 루프(loop) 안테나 또는 슬롯(slot) 안테나 중 적어도 하나의 타입으로 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 그라운드 부재는 하우징의 제 1 면 및 제 2 면 사이에 배 치될 수 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 그라운드 부재는 전자 장치의 외관을 형성하는 하우 징의 내부 및/또는 하우징의 일부에 적어도 일부 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 그라운드 부재는 전자 장치의 인쇄회로기판(PCB)의 일부일 수 있다. 적어도 하나의 그라운드 부재는 인쇄회로기판(PCB) 그라운드를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 그라운드 부재는 인쇄회로기판(PCB) 그라운드로부터 분리되어 있을 수 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 그라운드 부재는 적어도 하나의 안테나 방사체에 전 기적으로 연결되어 있을 수 있다. 적어도 하나의 그라운드 부재는 적어도 하나의 안테나 방사체의 공 진을 위한 안테나 그라운드 역할을 할 수 있다. 본 발명의 일 실시 예에 따르면, 통신 회로는 상기 적어도 하나의 안테나 방사체에 전기적으로 연결 될 수 있다. 예를 들어 통신 회로는 제어 회로의 프로세서(480-1)에 전기적으로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 통신 회로는 적어도 하나의 안테나 방사체를 이용하는 다양한 형태 의 통신(예: 셀룰러 통신)을 지원할 수 있다. 통신 회로는 적어도 하나의 안테나 방사체를 통하여 무 선 주파수 신호를 송수신할 수 있다. 통신 회로는 적어도 하나의 안테나 방사체와 제어 회로사 이의 모든 RF 부품들을 포함할 수 있다. 예를 들어, 통신 회로는 RFIC(Radio Frequency Integrated Circuit), FEM(Front End Module)를 포함할 수 있다. RFIC(예: RF 트랜시버)는 기지국으로부터 전파를 수신하 고, 수신한 고주파를 프로세서(480-1) 에서 처리 가능한 저주파 대역(기저대역, Baseband)으로 변조시킬 수 있 다. 예를 들어RFIC는 프로세서(480-1)에서 처리한 저주파를 기지국 송신을 위해 고주파로 변조시킬 수 있다. 예 를 들어FEM은 전파 신호를 제어할 수 있는 송수신 장치일 수 있다. 예를 들어 FEM은 적어도 하나의 안테나 방사 체와 RFIC를 연결하고 송수신 신호를 분리할 수 있다. 예를 들어 FEM은 필터링 및 증폭 역할을 할 수 있고, 수신 신호를 필터링하는 필터를 내장한 수신단 프론트 엔드 모듈, 송신 신호를 증폭하는 전력 증폭 모듈 (PAM: Power Amplifier Module)을 내장한 송신단 프론트 엔드 모듈을 포함할 수 있다. 본 발명의 다양한 실시예에 따른 무선 신호의 수신에서, 통신 회로는 적어도 하나의 안테나 방사체로 부터 무선 신호를 수신하고, 수신한 무선 신호를 베이스밴드 신호로 변환하고, 변환한 베이스밴드 신호를 프로 세서(480-1)로 전송할 수 있다. 프로세서(480-1)는 수신한 베이스밴드 신호를 처리하고, 수신한 베이스밴드 신 호에 상응하는 전자 장치의 인적/기계적 인터페이스를 제어할 수 있다. 본 발명의 다양한 실시예에 따른 무선 신호의 송신에서, 프로세서(480-1)는 베이스밴드 신호를 생성하여 통신 회로로 출력할 수 있다. 통신 회로는 프로세서(480-1)로부터 베이스밴드 신호를 수신하고, 수신한 베 이스밴드 신호를 무선 신호로 변환하고, 적어도 하나의 안테나 방사체를 통해 공중으로 전송할 수 있다. 본 발명의 일 실시 예에 따르면, 통신 회로는 적어도 하나의 안테나 방사체를 이용하여 SIMO(Single Input Multiple Output), MISO(Multiple Input Single Output), 다이버시티(diversity) 또는 MIMO(Multiple Input Multiple Output) 중 적어도 하나의 통신 방식을 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상술한 바와 같이, 적어도 하나의 도전성 부재가 통신을 지원하기 위 한 적어도 하나의 안테나 방사체로 구성되는 경우, 통신 회로는 적어도 하나의 도전성 부재를 이용하 는 다양한 형태의 통신을 지원할 수 있다. 예를 들어, 통신 회로는 근거리 통신 회로를 포함하고, 적어도 하나의 도전성 부재를 이용하여 외부 장치와의 근거리 통신(예: WiFi, 블루투스, NFC, 또는 GNSS 등)을 지 원할 수 있다. 예를 들어, 통신 회로는 마그네틱 신호에 기반한 통신 회로를 포함하고, 적어도 하나의 도 전성 부재를 이용하여 외부 장치와의 마그네틱 신호 송수신(예: 전자 결제용 마그네틱 보안 전송(MST))을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 적어도 하나의 도전성 부재는 무선 충전을 지원하는 방사체일 수 있다. 무선 충전 회로는 적어도 하나의 도전성 부재를 이용하여 외부 장치로 무선으로 전력을 전송하거나, 또는 외부 장치로부터 무선으로 전력을 수신하는 구성일 수 있다. 무선 충전 회로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등으로 구성될 수 있다. 무선 충전 회로는 무선 충전을 위한 부 가적인 회로, 예를 들면, 공진 회로 또는 정류기 등을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 통신 또는 무선 충전을 지원하지 않는 금속 부재를 포함할 수도 있다. 본 발명의 일 실시 예에 따르면, 전력 관리 집적 회로(PMIC: Power Management Integrated Circuit)는 제 어 회로 및 통신 회로에 전기적으로 연결될 수 있다. 전력 관리 집적 회로는 시스템 내에서 전 력 사용을 효율적으로 관리하고 최적화할 수 있다. 예를 들면, 프로세서(480-1)는 처리해야 하는 부하(load)에 맞추어 그에 따른 신호를 전력 관리 집적 회로로 전송할 수 있다. 전력 관리 집적 회로는 프로세서 (480-1)에 공급하는 코어 전압을 그에 맞게 조장할 수 있다. 본 발명의 일 실시 예에 따르면, 전력 관리 집적 회로는, 무선 충전 회로가 제어 회로에 전기적 으로 연결될 때 배터리 충전 회로와 시스템 전원공급장치 간의 전력 배분을 최적화할 수 있다. 본 발명의 일 실시 예에 따르면, 메모리는 제어 회로의 프로세서(480-1)에 전기적으로 연결될 수 있 다. 메모리는 프로세서(480-1)가 실행할 수 있는 소프트웨어 관련 프로그램(명령어 세트)을 저장할 수 있 다. 메모리는 하나 이상의 자기 디스크 저장 장치와 같은 고속 랜덤 액세스 메모리 및/또는 비휘발성 메모 리, 하나 이상의 광 저장 장치 및/또는 플래시 메모리(예: NAND, NOR)를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 메모리는 제어 회로가 스위치(480-2)를 제어하기 위한 프로그램(이 하, '스위치 제어 프로그램')을 포함할 수 있다. 프로그램이란 용어는 명령어들의 집합 또는 명령어 세트(instruction set)로 표현하기도 한다. 스위치 제어 프로그램은, 적어도 하나의 방사체와 통신 회로 가 전기적으로 연결될 때, 적어도 하나의 도전성 부재를 적어도 하나의 그라운드 부재에 선택적으로 연결하도록 구성될 수 있다. 예를 들어, 스위치 제어 프로그램에 의해, 적어도 하나의 도전성 부재는 통신 회로 또는 무선 충전 회로에 전기적으로 연결되지 않고, 적어도 하나의 그라운드 부재(예: 인쇄 회로기판(PCB) 그라운드)에 전기적으로 연결될 수 있다. 예를 들어, 스위치 제어 프로그램에 의해, 적어도 하나 의 도전성 부재는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드) 또는 무선 충전 회 로에 전기적으로 연결되지 않고, 통신 회로에 전기적으로 연결될 수 있다. 예를 들어, 스위치 제어 프로그램에 의해, 적어도 하나의 도전성 부재는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드) 또는 통신 회로에 전기적으로 연결되지 않고, 무선 충전 회로에 전기적으로 연결될 수 있 다. 예를 들어, 스위치 제어 프로그램에 의해, 적어도 하나의 도전성 부재는 적어도 하나의 그라운드 부재 , 통신 회로 또는 무선 충전 회로에 전기적으로 연결되지 않고, 전기적 플로팅 상태로 구 성될 수 있다. 본 발명의 일 실시 예에 따르면, 스위치 제어 프로그램은, 전자 장치로부터 발생된 다양한 입력에 기반하 여 스위치(480-2)를 제어하도록 구성될 수 있다. 예를 들어, 스위치 제어 프로그램은, 전자 장치의 적어도 하나 이상의 센서로부터 획득된 정보의 적어도 일부에 기반하여 스위치(480-2)를 제어하도록 구성될 수 있다. 예를 들어, 스위치 제어 프로그램은, 전자 장치의 입력 장치로부터 발생된 사용자 입력의 적어도 일부에 기반하여 스위치(480-2)를 제어하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 프로세서(480-1) 및 스위치(480-2)를 포함할 수 있다. 프로 세서(480-1)는 메모리에 저장되어 있는 다양한 소프트웨어 프로그램(명령어 세트)을 실행하여 전자 장치 를 위한 여러 기능을 수행할 수 있다. 프로세서(480-1)는 메모리에 저장되어 있는 상기 스위치 제어 프로그램을 실행하여 스위치(480-2)를 제어하고, 이에 적합한 기능을 수행할 수 있다. 본 발명의 일 실시 예에 따르면, 프로세서(480-1)는 적어도 하나의 도전성 부재가 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되지 않도록 스위치(480-2)를 제어할 수 있다. 적어도 하나의 안테나 방사체는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전 기적으로 연결되어 있지만, 적어도 하나의 도전성 부재에 전기적으로 연결되지 않는 상태(이하, '제 1 상 태')에 있을 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 상태에서 도전성 부재는 안테나 그라운드로 사용되지 않고, 그 라운드 부재는 안테나 그라운드로 사용될 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 상태에서, 프로세서(480-1)는 적어도 하나의 도전성 부재가 통 신 회로에 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 예를 들어, 적어도 하나의 도전성 부 재가 근거리 통신에 이용되고, 근거리 통신이 활성화 상태로 설정된 경우, 프로세서(480-1)는 통신 회로 에 적어도 하나의 도전성 부재가 전기적으로 연결되도록 조정할 수 있다. 예를 들어, 적어도 하나의 도전성 부재가 마그네틱 신호 송수신 이용되고, 마그네틱 신호 송수신이 활성화 상태로 설정된 경우, 프로 세서(480-1)는 통신 회로에 적어도 하나의 도전성 부재가 전기적으로 연결되도록 조정할 수 있다. 프 로세서(480-1)는 적어도 하나의 도전성 부재 및 통신 회로를 이용하여 외부 장치와 해당 통신(예: 근 거리 통신 또는 마그네틱 신호 기반의 통신)을 수행할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 상태에서, 프로세서(480-1)는 적어도 하나의 도전성 부재가 무 선 충전 회로에 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 예를 들어, 적어도 하나의 도전 성 부재가 무선 충전에 이용되고, 무선 충전이 활성화 상태로 설정된 경우, 프로세서(480-1)는 적어도 하 나의 도전성 부재가 무선 충전 회로에 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 여기 서, 프로세서(480-1)는 무선 충전 회로를 이용하여 외부 장치에 무선으로 전력을 전송하거나, 또는 외부 장치로부터 무선으로 전력을 수신하도록 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 상태에서, 프로세서(480-1)는 적어도 하나의 도전성 부재가 전 기적 플로팅 상태로 구성되도록 스위치(480-2)를 제어할 수 있다. 예를 들어, 적어도 하나의 도전성 부재 는 제 1 단부 및 제 2 단부를 포함하는 도전성 패턴을 포함할 수 있고, 제 1 상태에서 프로세서(480-1)는 적어도 하나의 도전성 부재 상의 제 1 단부 및 제 2 단부가 전기적으로 연결되도록 스위치(480-2)를 제어 하여 적어도 하나의 도전성 부재를 전기적 플로팅 상태로 구성할 수 있다. 예를 들어, 적어도 하나의 도전성 부재는 NFC용 안테나 방사체를 포함할 수 있고, 제 1 상태에서 프로세서(480-1)는 NFC용 안테나 방사체의 + 단자 및 - 단자가 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 예를 들어, 적어도 하나의 도전성 부재는 무선 충전용 코일형 금속 패턴을 포함할 수 있고, 제 1 상태에서 프로세서(480-1)는 코일형 금속 패턴의 + 단자 및 - 단자가 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 본 발명의 일 실시 예에 따르면, 프로세서(480-1)는 적어도 하나의 도전성 부재가 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 적어도 하나의 안테나 방사체는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드) 및 적어도 하나의 도전성 부재에 전기적으로 연결된 상태(이하, '제 2 상태')에 있을 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 제 1 단부 및 제 2 단부를 포함하는 도 전성 패턴을 포함할 수 있고, 프로세서(480-1)는 적어도 하나의 도전성 부재 상의 제 1 단부 및 제 2 단부 중 적어도 하나가 그라운드 부재(예 : 인쇄회로기판(PCB) 그라운드)에 선택적으로 전기적으로 연결되도록 스위 치(380-2)를 제어하여 제 2 상태를 제공할 수 있다. 예를 들어, 적어도 하나의 도전성 부재는 NFC용 안테 나 방사체를 포함할 수 있고, 프로세서(480-1)는 NFC용 안테나 방사체의 + 단자 및 - 단자 중 어느 하나가 적어 도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되도록 스위치(480-2)를 제 어하거나, 또는 NFC용 안테나 방사체의 + 단자 및 - 단자 모두가 적어도 하나의 그라운드 부재(예: 인쇄회 로기판(PCB) 그라운드)에 전기적으로 연결되도록 스위치(480-2)를 제어하여 제 2 상태를 제공할 수 있다. 예를 들어, 적어도 하나의 도전성 부재는 무선 충전용 코일형 금속 패턴을 포함할 수 있고, 프로세서(480-1)는 프로세서(480-1)는 무선 충전용 코일형 금속 패턴의 + 단자 및 - 단자 중 어느 하나가 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되도록 스위치(480-2)를 제어하거나, 또는 무선 충전용 코일형 금속 패턴의 + 단자 및 - 단자 모두가 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되도록 스위치(380-2)를 제어하여 제 2 상태를 제공할 수도 있다. 본 발명의 다양한 실시 예에 따르면, 제 2 상태에서, 프로세서(480-1)는 적어도 하나의 도전성 부재가 통 신 회로에 전기적으로 연결되지 않도록 스위치(480-2)를 제어할 수 있다. 예를 들어, 적어도 하나의 도전 성 부재가 근거리 통신에 이용되지만, 근거리 통신이 비활성화 상태로 설정된 경우 프로세서(480-1)는 적 어도 하나의 도전성 부재가 통신 회로에 전기적으로 연결되지 않도록 스위치(480-2)를 제어할 수 있 다. 예를 들어, 적어도 하나의 도전성 부재가 마그네틱 신호 송수신에 이용되지만, 마그네틱 신호 송수신 이 비활성화 상태로 설정된 경우 프로세서(480-1)는 적어도 하나의 도전성 부재가 통신 회로에 전기 적으로 연결되지 않도록 스위치(480-2)를 제어할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 2 상태에서, 프로세서(480-1)는 적어도 하나의 도전성 부재가 무 선 충전 회로에 전기적으로 연결되지 않도록 스위치(480-2)를 제어할 수 있다. 예를 들어, 적어도 하나의 도전성 부재가 무선 충전에 이용되지만, 무선 충전이 비활성화 상태로 설정된 경우 프로세서(480-1)는 적 어도 하나의 도전성 부재가 무선 충전 회로에 전기적으로 연결되지 않도록 스위치(480-2)를 제어할 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 서로 다른 통신들을 지원하는 다수 개 의 안테나 방사체들을 포함할 수 있다. 예를 들어, 적어도 하나의 도전성 부재는 제 1 통신용 안테나 방사 체(예: 근거리 통신용 안테나 방사체) 및 제 2 통신용 안테나 방사체(예: 마그네틱 신호 송수신용 안테나 방사 체)를 포함할 수 있다. 여기서, 제 1 통신 및 제 2 통신은 사용자 입력에 의해 활성화 상태 또는 비활성화 상태 로 설정될 수 있다. 제 1 통신 및 제 2 통신이 모두 활성화 상태로 설정되는 경우, 프로세서(480-1)는 제 1 통 신용 안테나 방사체 및 제 2 통신용 안테나 방사체가 통신 회로에 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 제 1 통신 및 제 2 통신이 모두 비활성화 상태로 설정되는 경우, 프로세서(480-1)는 제 1 통신 용 안테나 방사체 및 제 2 통신용 안테나 방사체가 통신 회로에 전기적으로 연결되지 않도록 스위치(480- 2)를 제어할 수 있다. 제 1 통신 및 제 2 통신이 모두 비활성화 상태로 설정되는 경우, 프로세서(480-1)는 제 1 통신용 안테나 방사체 및 제 2 통신용 안테나 방사체 중 적어도 하나가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어, 제 1 통신이 활성화 상태로 설정되고, 제 2 통신이 비활성화 상태로 설정되는 경우, 프로세서(480- 1)는 적어도 하나의 도전성 부재의 제 1 통신용 안테나 방사체가 통신 회로에 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 프로세서(480-1)는 적어도 하나의 도전성 부재의 제 2 통신용 안테나 방 사체가 통신 회로에 전기적으로 연결되지 않고, 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 무선 충전용 제 1 안테나 방사체 및 근 거리 통신용 제 2 안테나 방사체를 포함할 수 있다. 여기서, 무선 충전 및 근거리 통신은, 사용자 입력에 의해 활성화 상태 또는 비활성화 상태로 설정될 수 있다. 무선 충전 및 근거리 통신이 모두 활성화 상태로 설정되는 경우, 프로세서(480-1)는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되고, 근거 리 통신용 제 2 안테나 방사체가 통신 회로에 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 예 를 들어 무선 충전 및 근거리 통신이 모두 비활성화 상태로 설정되는 경우, 프로세서(480-1)는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되지 않고, 근거리 통신용 제 2 안테나 방사체가 통 신 회로에 전기적으로 되지 않도록 스위치(480-2)를 제어할 수 있다. 예를 들어 무선 충전 및 근거리 통신 이 모두 비활성화 상태로 설정되는 경우, 프로세서(480-1)는 무선 충전용 제 1 안테나 방사체 및 근거리 통신용 제 2 안테나 방사체 중 적어도 하나가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라 운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태를 선택적으로 제공할 수 있 다. 예를 들어, 무선 충전이 활성화 상태로 설정되고, 근거리 통신이 비활성화 상태로 설정되는 경우, 프로세서 (480-1)는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되고, 근거리 통신용 제 2 안테나 방사체가 통신 회로에 전기적으로 연결되지 않도록 스위치(480-2)를 제어할 수 있다. 예를 들어 프 로세서(480-1)는 근거리 통신용 제 2 안테나 방사체가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적 어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어, 무선 충전이 비활성화 상태로 설정되고, 근거리 통신이 활성화 상태로 설정되는 경우, 프로세서 (480-1)는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되지 않고, 근거리 통신용 제 2 안테나 방사체가 통신 회로에 전기적으로 연결되도록 스위치(480-2)를 제어할 수 있다. 예를 들어 프 로세서(480-1)는 무선 충전용 제 1 안테나가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나 의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으 로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 프로세서(480-1)는 전자 장치에 사용자가 근접했는지 여부에 적어도 일부 기초하여, 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나 의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으 로 제공할 수 있다. 에를 들어 전자 장치는 전자 장치에 사용자가 근접했는지 여부를 나타내는 신호 를 발생할 수 있는 센서를 더 포함하고, 프로세서(480-1)는 센서로부터의 신호에 적어도 일부 기초하여, 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재 (예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있 다. 예를 들어, 전자 장치에 사용자가 근접한 것이 감지되는 경우, 프로세서(480-1)는 적어도 하나의 도전 성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 예를 들어, 프로세서(480-1)는 심박(Heart Rate Monitor, HRM) 센서, 운동 정보 센서, 온도 센서 또는 근접 센 서 중 적어도 하나의 센서로부터 획득한 정보 중 적어도 일부에 기반하여 전자 장치에 사용자가 근접해 있 는지 여부를 확인할 수 있다. 예를 들어 심박 센서를 통하여 심박이 측정되는 경우, 프로세서(480-1)는 전자 장 치에 사용자가 근접한 상태에 있다고 인식하고, 그렇지 않은 경우 전자 장치에 사용자가 근접하지 않 은 상태에 있다고 인식할 수 있다. 가속도 센서 또는 자이로 센서를 통하여 전자 장치의 움직임이 감지되 는 경우, 프로세서(480-1)는 전자 장치에 사용자가 근접한 상태에 있다고 인식하고, 그렇지 않은 경우 전 자 장치에 사용자가 근접하지 않은 상태에 있다고 인식할 수 있다. 예를 들어 온도 센서를 통하여 사용자 신체 온도에 준하는 범위의 온도가 유지되고 있음이 감지되는 경우, 프로세서(480-1)는 전자 장치에 사용 자가 근접한 상태에 있다고 인식하고, 그렇지 않은 경우 전자 장치에 사용자가 근접하지 않은 상태에 있다 고 인식할 수 있다. 예를 들어, 프로세서(480-1)는 적어도 하나의 안테나 방사체에 기반하여 획득한 회귀 전류량 또는 커패시 턴스 변화량의 적어도 일부에 기반하여 전자 장치에 사용자가 근접한 상태에 있는지 여부를 식별할 수도 있다.본 발명의 일 실시 예에 따르면, 프로세서(480-1)는 적어도 하나의 안테나 방사체의 수신 감도를 모니터링 하고, 모니터링된 수신 감도에 적어도 일부 기초하여, 적어도 하나의 도전성 부재가 전기적 플로팅 상태 로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기 적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어, 적어도 하나의 안테나 방사체 의 수신 감도가 기준 이하인 경우, 프로세서(480-1)는 적어도 하나의 도전성 부재가 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 프로세서(480-1)는 사용자 입력에 적어도 일부 기초하여, 적어도 하나의 도전 성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인 쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는 유저 인터페이스를 더 포함하고, 프로세서(480-1)는 유저 인 터페이스를 통하여 수신된 사용자 입력에 적어도 일부 기초하여, 적어도 하나의 도전성 부재가 전기적 플 로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어, 전자 장치는 안테나 성능 향상 모드를 제공하고, 사용자 입력에 의해 안테나 성능 향상 모드가 활성화되는 경우, 프로세서(480-1)는 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 한 실시 예에 따르면, 안테나 성능 향상 모드에서 프로세서(480- 1)는, 전자 장치에 사용자가 근접해 있는지 여부에 따라 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어 안테나 성능 향상 모드에서 전자 장치에 사용자가 근접해 있지 않음이 감지되는 경우, 프로세서(480-1)는 적어도 도전성 부재가 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태를 제공 할 수 있다. 다른 실시 예에 따르면, 프로세서(480-1)는, 상술한 바와 같이, 적어도 하나의 안테나 방사체(42 0)의 수신 감도를 기초로, 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수도 있다. 예를 들어, 전자 장치는 SAR(Specific Absorption Rate) 저감 모드를 제공하고, 사용자 입력에 의해 SAR 저감 모드가 활성화되는 경우, 프로세서(480-1)는 적어도 하나의 도전성 부재가 전기적 플로팅 상태 로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 한 실시 예에 따르면, SAR 저감 모드에서 프로세서 (480-1)는, 전자 장치에 사용자가 근접해 있는지 여부에 따라 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운 드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어 SAR 저감 모드에서 전 자 장치에 사용자가 근접해 있음이 감지되는 경우, 프로세서(480-1)는 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 예를 들어, 전자 장치는 착용 모드를 제공하고, 사용자 입력 또는 적어도 하나의 센서로부터 획득된 정보 의 적어도 일부에 기반하여 착용 모드가 활성화되는 경우, 프로세서(480-1)는 적어도 하나의 도전성 부재 가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 인쇄회로기판 (PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어 착용 모드 는, 전자 장치의 손목 착용을 가리키는 시계 모드, 전자 장치의 목 착용을 가리키는 목걸이 모드 등 을 포함할 수 있다. 한 실시 예에 따르면, 착용 모드에서 프로세서(480-1)는 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 적어도 하나의 도전성 부재는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 예를 들어, 전자 장치에 사 용자가 근접해 있는 경우, 전기적 플로팅 상태에 있는 적어도 하나의 도전성 부재는 전자 장치 로부터 발생된 전자파가 사용자 신체로 흡수되는 것을 줄일 수 있다. 이러한 전자파는 적어도 하나의 안테나 방 사체의 방사로 인하여 방출될 수 있다. 다양한 실시예에 따르면 전기적 플로팅 상태에 있는 적어도 하나의 도전성 부재는 전자 장치에 관한 SAR를 저감시킬 수 있다.본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 적어도 하나의 도전성 부재는 적어 도 하나의 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수도 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드에 전기적으로 연결되는 도전성 부재는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수 있다. 예를 들면, 전자 장치(40 0)는 웨어러블 전자 장치이고, 전자 장치가 사용자 신체에 착용되지 않은 상태인 경우, 전자 장치로 부터 전위체인 사용자 신체가 멀어지게 되면, 안테나 장치는 인체의 유전율을 고려한 설계를 진행하여, 인체 유 전율이 없는 상황에서는 적어도 하나의 안테나 방사체의 전기적 길이가 짧아져 상대적으로 높은 공진 주파 수를 가지게 되고, 이는 안테나 장치의 성능 열화의 요인이 될 수 있다. 다양한 실시예에 따르면 전자 장치 가 사용자 신체에 착용되지 않은 상태인 경우, 제 2 상태의 적어도 하나의 도전성 부재는 인쇄회로기 판(PCB) 그라운드에 전기적으로 연결되고, 이는 안테나 장치의 안테나 성능의 열화를 줄일 수 있다. 다양한 실 시예에 따르면 전자 장치를 사용자 신체에 착용하지 않은 상태이더라도, 안테나 장치의 안테나 성능은 유 지될 수 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 그라운드 부재(예: 인쇄회로기판(PCB) 그라운드)에 전 기적으로 연결되는 적어도 하나의 도전성 부재는 전자 장치로부터 발생된 전자파가 사용자 신체에 미 치는 영향을 줄일 수도 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 이 밖에 다양한 구성 요소들을 포함할 수 있다. 예를 들 어, 전자 장치는, 도시하지 않은 메모리(예: 도 2의 메모리 230), 센서 모듈(예: 도 2의 센서 모듈 240), 입력 장치(예: 도 2의 입력 장치 250), 디스플레이(예: 도 2의 디스플레이 260), 오디오 모듈(예: 도 2의 오디 오 모듈 280) 또는 카메라 모듈(예: 도 2의 카메라 모듈 291) 등을 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제어 회로는 적어도 하나의 스위치를 제어하는 것에 의하여 적어도 하나의 도전성 부재를 플로팅 그라운드로 구성하거나 또는 적어도 하나의 그라운드 부재(예: 인쇄회 로기판(PCB) 그라운드)에 전기적으로 연결시킬 수 있다. 이에 관하여는 후술하는 도 5 내지 12을 참조하여 설명 하겠다. 도 5 및 6은 본 발명의 다양한 실시 예에 따른 전자 장치의 구성을 도시한다. 본 발명의 다양한 실시 예에 따르 면, 전자 장치은 도 1의 전자 장치일 수 있다. 도 5 및 6을 참조하면, 전자 장치는 하우징(500-H), 디스플레이, 그라운드 부재(580-G), 도전성 부재 , 안테나 방사체 및 제어 회로를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 하우징(500-H)은 전자 장치의 외관을 형성하는 구성이고, 대체적으로 원 통형일 수 있다. 본 발명의 일 실시 예에 따르면, 하우징(500-H)은 제 1 면(500-H1) 및 상기 제 1 면(500-H1)과 반대 방향으로 향하는 제 2 면(500-H2)을 포함할 수 있다. 제 1 면(500-H1)은 전자 장치의 정면(F)을 형성하고, 제 2 면 (500-H2)은 전자 장치의 후면(B)을 형성할 수 있다. 상술한 바와 같이, 하우징(500-H)은 대체적으로 원통 형일 수 있다. 제 1 면(500-H1)은 전자 장치의 정면(F)에서 후면(B)으로 향하는 방향으로 바라보았을 때 대체적으로 원형일 수 있다. 제 2 면(500-H2) 또한 전자 장치의 후면(B)에서 정면(F)으로 향하는 방향으로 바라보았을 때 대체적으로 원형일 수 있다. 본 발명의 일 실시 예에 따르면, 하우징(500-H)은 대체적으로 원형일 수 있으나, 이에 국한되지 않고 디스플레 이의 형태에 따라 다양할 수 있다. 예를 들어, 디스플레이의 형태가 사각형인 경우, 하우징(500-H)은 대체적으로 이에 대응하는 사각 환형일 수 있다. 이에 관한 예는 후술하는 도 30에서 대략적으로 도시하고 있다. 본 발명의 일 실시 예에 따르면, 디스플레이의 형태가 대체적으로 플레이트 형상인 경우, 하우징(500-H)은 대체적으로 이에 대응하는 플레이트 형상일 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이의 형태가 대체적으로 만곡 형상(curved shape)인 경우, 하우 징(500-H)은 대체적으로 이에 대응하는 만곡 형상을 가질 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 면(500-H1)은 투명한 중앙 영역(500-H11) 및 투명 영역(500-H11)을 에워 싸는 엣지 영역(500-H12)을 포함할 수 있다. 투명한 중앙 영역(500-H11)은 대체적으로 원형일 수 있고, 엣지 영역(500-H12)은 환형일 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 면(500-H1)의 투명한 중앙 영역(500-H11)은 평면일 수 있고, 제 1 면 (500-H1)의 환형의 엣지 영역(500-H12)은 평면 또는 경사면일 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전기 신호를 이미지로 출력할 수 있다. 디스플레이는 하우징(500-H)의 제 1 면(500-H1)의 투명한 중앙 영역(500-H11)을 통해서 노출될 수 있다. 본 발명의 일 실시 예에 따르면, 그라운드 부재(580-G)는 하우징(500-H)의 제 1 면(500-H1) 및 제 2 면(500- H2) 사이에 배치될 수 있다. 예를 들어, 그라운드 부재(580-G)는 디스플레이 및 도전성 부재 사이에 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 그라운드 부재(580-G)는 인쇄회로기판(PCB)의 일부일 수 있다. 예를 들어, 그라운드 부재(580-G)는 인쇄회로기판(PCB) 그라운드(미도시)를 포함할 수 있다. 일 실시 예에 따르면, 인쇄회로기판(PCB)은 전자 장치의 다수의 전자 부품들이 실장되는 구성이고, 전자 장치의 실행 환경 을 설정하며 전자 장치내 전자 부품들의 데이터 입출력 교환을 지원할 수 있다. 예를 들어, 인쇄회로기판 (PCB)은 전자 장치의 정면(F)을 향하는 제 1 면 및 전자 장치의 후면(B)을 향하는 제 2 면을 포함할 수 있고, 그라운드 부재(580-G)(예: 인쇄회로기판(PCB) 그라운드)는 인쇄회로기판(PCB)의 제 1 면 및/또는 제 2 면에 배치될 수 있다. 또는, 그라운드 부재(580-G)(예: 인쇄회로기판(PCB) 그라운드)는 인쇄회로기판(PCB)의 제 1 면 및 제 2 면 사이에 배치되는 층일 수 있다. 본 발명의 다양한 실시 예에 따르면, 그라운드 부재(580-G)는, 인쇄회로기판(PCB)와는 별개의 접지 영역을 포함 하는 금속 패턴 또는 금속 부재일 수도 있다. 또는, 그라운드 부재(580-G)는 인쇄회로기판(PCB)와는 별개의 구 조물에 구성될 수도 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 하우징(500-H)의 내부에 배치될 수 있다. 또는, 도전성 부 재는 그라운드 부재(530580-G)(예: 인쇄회로기판(PCB) 그라운드) 및 하우징(500-H)의 제 2 면(500-H2) 사 이에 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 하우징(500-H)의 적어도 일부에 배치될 수 있다. 예를 들 어, 도전성 부재는 하우징(500-H)의 제 2 면(500-H2)의 일부를 형성할 수 있다. 또는, 도전성 부재는 하우징(500-H)의 제 1 면(500-H1) 및 제 2 면(500-H2) 사이의 전자 장치의 측면(S)을 형성하는 제 3 면 (500-H3)의 일부를 형성할 수 있다. 또는, 도전성 부재는 하우징(500-H)의 제 1 면(500-H1)의 일부를 형성 할 수도 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 그라운드 부재(530580-G)(예: 인쇄회로기판(PCB) 그라운드) 및 하우징(500-H)의 제 2 면(500-H2) 사이에 적어도 일부를 형성할 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는 하나의 도전성 부재를 포함할 수 있다. 예를 들어, 하 나의 도전성 부재는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신)을 지원할 수 있다. 또는, 하나의 도전성 부재는 무선 충전을 지원할 수도 있다. 또는, 하나의 도전성 부재는 통신 및 무선 충전을 지 원하지 않는 금속 패턴 또는 금속 부재일 수도 있다. 본 발명의 다양한 실시 예에 따르면, 적어도 하나의 도전성 부재는 다수의 도전성 부재들을 포함할 수 있 다. 예를 들어, 적어도 하나의 도전성 부재는 제 1 도전성 부재(510-1) 및 제 2 도전성 부재(510-1)를 포 함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(510-2)는, 예를 들면, 제 1 도전성 부재(510-1)를 적어도 일 부 둘러싸는 형상을 가질 수 있다. 또는, 제 2 도전성 부재(510-2)는 환형 금속 패턴 또는 금속 부재일 수 있다. 본 발명의 다양한 실시 예에 따르면, 하우징(500-H)은 제 1 면(500-H1) 및 제 2 면(500-H2) 사이의 전자 장치 의 측면(S)을 형성하는 제 3 면(500-H3)을 포함할 수 있다. 예를 들어, 도전성 부재(예: 제 2 도전성 부재 510-2)는 하우징(500-H)의 제 3 면(500-H3)의 일부를 형성할 수도 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 하우징(500-H)의 내부 및/또는 하우징(500-H)의 적어도 일부에 배치될 수 있다. 예를 들어, 하우징(500-H)은 금속 재질로 형성된 원통형 부분을 포함하고, 안테나 방사 체의 적어도 일부로 구성될 수 있다.본 발명의 일 실시 예에 따르면, 안테나 방사체는 하우징(500-H)의 적어도 일부를 포함할 수 있다. 예를 들어, 안테나 방사체는 하우징(500-H) 전체로 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 하우징(500-H)은 전자 장치의 외관을 형성하면서, 안테나 방사체로 구성될 수 있다. 하우징(500-H)이 금속으로 형성된 경우, 안테나 방사체는 하우징(500-H)의 일부 금속 영 역 또는 전체 금속 영역으로 구성될 수 있다. 또는, 하우징(500-H)의 적어도 일부로 구성된 안테나 방사체(52 0)는 노출될 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 그라운드 부재(580-G)(예: 인쇄회로기판(PCB) 그라운 드)가 실장되어 있는 인쇄회로기판(PCB)의 급전 부에 전기적으로 연결되고, 그라운드 부재(580-G)(예: 인 쇄회로기판(PCB) 그라운드)에 전기적으로 연결될 수 있다. 예를 들어, 그라운드 부재(580-G)(예: 인쇄회로기판 (PCB) 그라운드)는 안테나 방사체의 공진을 위한 안테나 그라운드 역할을 할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로(예: 도 4의 제어 회로 480)는 그라운드 부재(580-G)(예: 인쇄 회로기판(PCB) 그라운드)가 실장되어 있는 인쇄회로기판(PCB)에 실장될 수 있다. 제어 회로는 도전성 부재 및 그라운드 부재(580-G)(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 도전성 부재를 그라운드 부재(580-G)(예: 인쇄회로기판 (PCB) 그라운드)에 전기적으로 연결하지 않고, 전기적 플로팅 상태로 구성할 수 있다. 안테나 방사체는 그 라운드 부재(580-G)(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되어 있지만, 도전성 부재에 전기 적으로 연결되지 않는 상술한 제 1 상태에 있을 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 도전성 부재를 그라운드 부재(580-G)(예: 인쇄회로기판 (PCB) 그라운드)에 전기적으로 연결할 수 있다. 도전성 부재가 그라운드 부재(580-G)(예: 인쇄회로기판 (PCB) 그라운드)에 전기적으로 연결되는 경우, 안테나 방사체는 그라운드 부재(580-G)(예: 인쇄회로기판 (PCB) 그라운드) 및 도전성 부재에 전기적으로 연결되는 상술한 제 2 상태에 있을 수 있다. 예를 들어, 그 라운드 부재(580-G )(예: 인쇄회로기판(PCB) 그라운드 ) 및 도전성 부재는 안테나 방사체의 공진을 위한 안테나 그라운드 역할을 할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 다양한 형태의 통신(예: 근거리 통신 또는 마그네틱 송수신)을 지원하기 위한 안테나 방사체를 포함할 수 있다. 도전성 부재가 지원하는 통신이 활성화 상태로 설정된 경우, 제어 회로는 도전성 부재가 통신 회로(예: 도 4의 통신 회로 440)에 전기적으로 연결되 도록 조정할 수 있다. 또는, 도전성 부재가 지원하는 통신이 비활성화 상태로 설정된 경우, 제어 회로 는 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(580-G)(예: 인쇄회 로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 한 실시 예에 따르면, 제 1 도전성 부재(510-1)는 다양한 형태의 통신을 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 무선 충전을 지원하기 위한 방사체(예: 무선 충전 코 일)를 포함할 수도 있다. 일 실시 예에 따르면 도전성 부재가 지원하는 무선 충전이 활성화 상태로 설정된 경우, 제어 회로는 도전성 부재가 무선 충전 회로(예: 도 4의 무선 충전 회로 450)에 전기적으로 연 결되도록 조정할 수 있다. 또는, 도전성 부재가 지원하는 무선 충전이 비활성화 상태로 설정된 경우, 제어 회로는 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(580-G)(예: 인 쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 한 실시 예에 따르면, 제 1 도 전성 부재(510-1)는 무선 충전을 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 통신 및 무선 충전을 지원하지 않는 금속 패턴 또는 금속 부재를 포함할 수 있다. 한 실시 예에 따르면, 제 2 도전성 부재(510-2)는 통신 및 무선 충전을 지원하지 않을 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(510-1) 및 제 2 도전성 부재(510-2)는 모두 통신을 지원 하도록 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(510-1)는 통신을 지원하고, 제 2 도전성 부재(510-2)는 무선 충전을 지원하도록 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(510-1)는 무선 충전을 지원하고, 제 2 도전성 부재(510- 2)는 통신을 지원하도록 구성될 수 있다.본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(510-1)는 통신을 지원하고, 제 2 도전성 부재(510-2)는 무선 충전을 지원하도록 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(510-1) 및 제 2 도전성 부재(510-2)는 통신 및 무선 충 전 모두를 지원하지 않도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는, 전자 장치에 사용자가 근접했는지 여부에 적어도 일부 기초하여, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(580-G)(예: 인쇄 회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는 안테나 방사체의 수신 감도를 모니터링하고, 모니터링 된 수신 감도에 적어도 일부 기초하여, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그 라운드 부재(580-G)(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는 사용자 입력에 적어도 일부 기초하여, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(580-G)(예: 인쇄회로기판(PCB) 그라운드)에 전기 적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재는 전자 장치로부터 발 생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재는 안테나 방사체를 이 용하는 안테나 장치의 안테나 성능 유지를 지원할 수도 있다. 본 발명의 다양한 실시 예에 따르면, 그라운드 부재(580-G )(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연 결되는 도전성 부재는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 그라운드 부재(580-G)(예: 인쇄회로기판(PCB) 그라운드)에 전기적으로 연 결되는 도전성 부재는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수도 있 다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 금속 플레이트, 코일형 금속 패턴 또는 환형 금속 부재 중 적어도 하나의 형태일 수 있다. 도 7은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 7을 참조하면, 전자 장치는 디스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전성 부 재, 통신 회로 및 제어 회로를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장 치는 도 1의 전자 장치일 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전기 신호를 이미지로 출력할 수 있다. 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diode), AMOLED(Active Matrix Organic Emitting Diode), PDP(Plasma Display Panel), E-Paper 또는 EWD(Electro Wetting Display) 등을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 디스플레이는 터치 입력 또는 호버링(hovering) 입력을 수신하도록 구성될 수 있다. 예를 들어, 디스플레이는 터치 패널 또는 전자 펜을 위한 디지타이저(digitizer)(또는, 펜 센서)을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전자 장치의 외관을 형성하는 하우징(미도시)의 일면 을 통하여 노출될 수 있다. 예를 들어, 하우징은 전자 장치의 정면을 형성하는 제 1 면 및 상기 제 1 면과 반대 방향으로 향하고 전자 장치의 후면을 형성하는 제 2 면을 포함할 수 있다. 디스플레이는 하우징 의 제 1 면을 통하여 노출될 수 있다. 본 발명의 다양한 실시 예에 따르면, 디스플레이는 다양한 형상일 수 있다. 예를 들어, 디스플레이는, 도시된 바와 같이, 원형일 수 있다. 경우에 따라서, 디스플레이는 타원형, 삼각형 또 는 사각형 등일 수도 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 대체적으로 플레이트 형상일 수 있다. 본 발명의 다른 실시 예에 따르면, 디스플레이는 대체적으로 만곡 형상(curved shape)일 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 디스플레이 및 도전성 부재 사이에 배치 될 수 있다. 인쇄회로기판(PCB)은 다수의 전자 부품들 및 이들을 연결하는 전기 회로를 구성하는 부분으로, 전자 장치의 실행 환경을 설정하고, 그 정보를 유지해 주며, 전자 장치 내의 장치들의 데 이터 입출력 교환을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 그라운드 부재(780-G)(이하, '인쇄회로기판(PCB) 그 라운드') 및 급전 부(780-F)를 포함할 수 있다. 인쇄회로기판(PCB) 그라운드(780-G)는 안테나 방사체를 이 용하는 안테나 장치를 위한 안테나 그라운드로 사용될 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(780-G)는 도 4의 적어도 하나의 그라운드 부 재에 포함될 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 인쇄회로기판(PCB)에 전기적으로 연결될 수 있다. 안테나 방사체는 일 단부에 형성된 급전 부재(720-F) 및 타 단부에 형성된 접지 부재(720-G)를 포함할 수 있다. 안테나 방사체의 급전 부재(720-F)는 인쇄회로기판(PCB)의 급전 부(780-F)에 전기적으로 연결 되고, 안테나 방사체의 접지 부재(720-G)는 인쇄회로기판(PCB)의 인쇄회로기판(PCB) 그라운드(780- G)에 전기적으로 연결될 수 있다. 본 발명의 다양한 실시 예에 따르면, 안테나 방사체는 모노폴 안테나, 루프 안테나, IFA 또는 PIFA 등일 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 하우징의 내부 및/또는 하우징의 일부에 적어도 일부 배 치될 수 있다. 예를 들어, 안테나 방사체의 적어도 일부는 디스플레이 및 인쇄회로기판(PCB) 사 이에 배치되거나, 또는 디스플레이 및 인쇄회로기판(PCB) 사이에 배치되지 않을 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치의 외관을 형성하는 하우징(미도시)이 안테나 방사체로 구 성될 수 있다. 하우징이 금속으로 형성된 경우, 안테나 방사체는 하우징의 일부 금속 영역 또는 전체 금속 영역으로 구성될 수 있다. 또는, 하우징의 적어도 일부로 구성된 안테나 방사체는 노출될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 제어 회로에 전기적으로 연결될 수 있다. 도전성 부 재는 하우징의 내부 및/또는 하우징의 일부에 적어도 일부 배치될 수 있다. 예를 들어, 도전성 부재 는 하우징의 제 2 면의 일부를 형성할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 다수의 도전성 부재들을 포함할 수 있다. 예를 들어, 도전 성 부재는 제 1 도전성 부재(710-1) 및 제 2 도전성 부재(710-2)를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(710-2)는, 예를 들면, 제 1 도전성 부재(710-1)를 적어도 일 부 둘러싸는 형상을 가질 수 있다. 또는, 제 2 도전성 부재(710-2)는 환형 금속 패턴 또는 금속 부재일 수 있다. 본 발명의 일 실시 예에 따르면, 통신 회로는 안테나 방사체에 전기적으로 연결될 수 있다. 예를 들 어, 통신 회로는 안테나 방사체를 이용하여 다양한 형태의 통신(예: 셀룰러 통신)을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 도전성 부재에 전기적으로 연결될 수 있다. 제어 회로 는 전자 장치로부터 발생된 다양한 입력에 기반하여 도전성 부재의 제 1 도전성 부재(710-1) 및/또는 제 2 도전성 부재(710-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(710-1) 및/또는 제 2 도전성 부재(710-2)가 전기적 플로팅 상 태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터링 된 수신 감도에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(710-1) 및/또는 제 2 도전성 부재 (710-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(710-1) 및/또는 제 2 도전성 부재(710-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공 할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재의 제 1 도전성 부재(710-1) 및/또는 제 2 도전성 부재(710-2)는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재의 제 1 도전성 부재(710-1) 및/또는 제 2 도전성 부재(710-2)는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수도 있다. 도 8은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 본 발명의 다양한 실 시 예에 따르면, 전자 장치는 도 1의 전자 장치일 수 있다. 도 8을 참조하면, 전자 장치는 디스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전성 부 재, 통신 회로 및 제어 회로를 포함할 수 있다. 디스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전성 부재, 통신 회로 및 제어 회로는, 도 7의 디스플레이, 인쇄 회로기판(PCB), 안테나 방사체, 도전성 부재, 통신 회로 및 제어 회로와 유사하고, 이에 대한 설명은 생략한다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 그라운드 부재(880-G)(이하, '인쇄회로기판(PCB) 그 라운드')를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(880-G)는 도 4의 적어도 하나의 그라운드 부 재에 포함될 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 도전 성 부재의 제 1 도전성 부재(810-1) 및/또는 제 2 도전성 부재(810-2)가 인쇄회로기판(PCB) 그라운드(880- G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(810-1) 및/또는 제 2 도전성 부재(810-2)가 인쇄회로기판(PCB) 그라운드(880-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터링 된 수신 감도에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(810-1) 및/또는 제 2 도전성 부재 (810-2)가 인쇄회로기판(PCB) 그라운드(880-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(810-1) 및/또는 제 2 도전성 부재(810-2)가 인쇄회로기판(PCB) 그라운드(880-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(880-G)에 전기적으로 연결되는 도전성 부재 의 제 1 도전성 부재(810-1) 및/또는 제 2 도전성 부재(810-2)는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(880-G)에 전기적으로 연결되는 도전성 부재 의 제 1 도전성 부재(810-1) 및/또는 제 2 도전성 부재(810-2)는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수도 있다. 도 9는 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 9를 참조하면, 전자 장치는 디스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전성 부 재, 통신 회로 및 제어 회로를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장 치는 도 1의 전자 장치일 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전기 신호를 이미지로 출력할 수 있다. 본 발명의 다양한 실시 예에 따르면, 디스플레이는 터치 입력 또는 호버링 입력을 수신하도록 구성될 수 있다. 예를 들어, 디스플레이는 터치 패널 또는 전자 펜을 위한 디지타이저(또는, 펜 센서)을 포함할 수있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전자 장치의 외관을 형성하는 하우징(미도시)의 일면 을 통하여 노출될 수 있다. 예를 들어, 하우징은 전자 장치의 정면을 형성하는 제 1 면 및 상기 제 1 면과 반대 방향으로 향하고 전자 장치의 후면을 형성하는 제 2 면을 포함할 수 있다. 디스플레이는 하우징 의 제 1 면을 통하여 노출될 수 있다. 본 발명의 다양한 실시 예에 따르면, 디스플레이는 다양한 형상일 수 있다. 예를 들어, 디스플레이는, 도시된 바와 같이, 원형일 수 있다. 경우에 따라서, 디스플레이는 타원형, 삼각형 또 는 사각형 등일 수도 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 대체적으로 플레이트 형상일 수 있다. 본 발명의 다른 실시 예에 따르면, 디스플레이는 대체적으로 만곡 형상(curved shape)일 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 디스플레이 및 도전성 부재 사이에 배치 될 수 있다. 인쇄회로기판(PCB)은 다수의 전자 부품들 및 이들을 연결하는 전기 회로를 구성하는 부분으로, 전자 장치의 실행 환경을 설정하고, 그 정보를 유지해 주며, 전자 장치 내의 장치들의 데 이터 입출력 교환을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 그라운드 부재(980-G)(이하, '인쇄회로기판(PCB) 그 라운드') 및 급전 부(980-F)를 포함할 수 있다. 인쇄회로기판(PCB) 그라운드(980-G)는 안테나 방사체를 이 용하는 안테나 장치를 위한 안테나 그라운드로 사용될 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(980-G)는 도 4의 적어도 하나의 그라운드 부 재에 포함될 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 인쇄회로기판(PCB)에 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 안테나 방사체는 일 단부에 형성된 급전 부재(920-F) 및 타 단부에 형성된 접지 부 재(920-G)를 포함할 수 있다. 예를 들어 안테나 방사체의 급전 부재(920-F)는 인쇄회로기판(PCB)의 급전 부(980-F)에 전기적으로 연결되고, 안테나 방사체의 접지 부재(920-G)는 인쇄회로기판(PCB)의 인쇄회로기판(PCB) 그라운드(980-G)에 전기적으로 연결될 수 있다. 상기 접지 부재(920-G)의 접지 위치는 급전 부(980-F)에 근접할 수 있으며, 본 발명의 일 실시 예에 따르면, 안테나 방사체는 하우징의 내부 및/또는 하우징의 일부에 적어도 일부 배 치될 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치의 외관을 형성하는 하우징(미도시)이 안테나 방사체로 구 성될 수 있다. 하우징이 금속으로 형성된 경우, 안테나 방사체는 하우징의 일부 금속 영역 또는 전체 금속 영역으로 구성될 수 있다. 또는, 하우징의 적어도 일부로 구성된 안테나 방사체는 노출될 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 디스플레이를 적어도 일부 둘러싸는 형상을 가질 수 있다. 예를 들어, 안테나 방사체는 환형일 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체의 접지 부재(920-G)(또는, 인쇄회로기판(PCB) 및 인 쇄회로기판(PCB) 그라운드 (980-G) 간의 연결 포인트) 및 (인쇄회로기판(PCB)의 급전부(980-F) 사이의 거 리가 기준 이상인 경우, 안테나 방사체는 루프(loop) 안테나 방사체로 동작할 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체의 접지 부재(920-G)(또는, 인쇄회로기판(PCB) 980 및 인쇄 회로기판(PCB) 그라운드 980-G 간의 연결 포인트) 및 (인쇄회로기판(PCB)의 급전부(980-F) 사이의 거리가 기준 이하인 경우(예: 근접), IFA(Inverted F antenna) 안테나 방사체로 동작할 수 있다. 본 발명의 다양한 실시 예에 따르면, 안테나 방사체는 하나 이상의 주파수 대역에서 공진을 형성할 수 있 다. 또는, 안테나 방사체는 다수의 주파수 대역에서 다중 공진(multiple resonance)을 형성할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 제어 회로에 전기적으로 연결될 수 있다. 도전성 부 재는 하우징의 내부 및/또는 하우징의 일부에 적어도 일부 배치될 수 있다. 예를 들어, 도전성 부재 는 하우징의 제 2 면의 일부를 형성할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 다수의 도전성 부재들을 포함할 수 있다. 예를 들어, 도전 성 부재는 제 1 도전성 부재(910-1) 및 제 2 도전성 부재(910-2)를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(910-2)는, 예를 들면, 제 1 도전성 부재(910-1)를 적어도 일 부 둘러 싸는 형상을 가질 수 있다. 또는, 제 2 도전성 부재(910-2)는 환형 금속 패턴 또는 금속 부재일 수 있 다. 본 발명의 일 실시 예에 따르면, 통신 회로는 안테나 방사체에 전기적으로 연결될 수 있다. 통신 회 로는 안테나 방사체를 이용하여 다양한 형태의 통신(예: 셀룰러 통신)을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 도전성 부재에 전기적으로 연결될 수 있다. 제어 회로 는 전자 장치로부터 발생된 다양한 입력에 기반하여 도전성 부재의 제 1 도전성 부재(910-1) 및/또는 제 2 도전성 부재(910-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(910-1) 및/또는 제 2 도전성 부재(910-2)가 전기적 플로팅 상 태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터링 된 수신 감도에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(910-1) 및/또는 제 2 도전성 부재 (910-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(910-1) 및/또는 제 2 도전성 부재(910-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공 할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재의 제 1 도전성 부재(910-1) 및/또는 제 2 도전성 부재(910-2)는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재의 제 1 도전성 부재(910-1) 및/또는 제 2 도전성 부재(910-2)는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수도 있다. 도 10은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 도 1의 전자 장치일 수 있다. 도 10을 참조하면, 전자 장치는 디스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전 성 부재, 통신 회로 및 제어 회로를 포함할 수 있다. 디스플레이, 인쇄회로기판 (PCB), 안테나 방사체, 도전성 부재, 통신 회로 및 제어 회로는, 도 9의 디 스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전성 부재, 통신 회로 및 제어 회 로와 유사하고, 이에 대한 설명은 생략한다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 그라운드 부재(1080-G)(이하, ‘인쇄회로기판(PCB) 그라운드’)를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1080-G)는 도 4의 적어도 하나의 그라운드 부 재에 포함될 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 도 전성 부재의 제 1 도전성 부재(1010-1) 및/또는 제 2 도전성 부재(1010-2)가 인쇄회로기판(PCB) 그라운드 (1080-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일 부 기초하여, 도전성 부재의 제 1 도전성 부재(1010-1) 및/또는 제 2 도전성 부재(1010-2)가 인쇄회로기 판(PCB) 그라운드(1080-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터 링된 수신 감도에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(1010-1) 및/또는 제 2 도전성 부재(1010-2)가 인쇄회로기판(PCB) 그라운드(1080-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다.본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재 의 제 1 도전성 부재(1010-1) 및/또는 제 2 도전성 부재(1010-2)가 인쇄회로기판(PCB) 그라운드(1080-G)에 전기 적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1080-G)에 전기적으로 연결되는 도전성 부재 의 제 1 도전성 부재(1010-1) 및/또는 제 2 도전성 부재(1010-2)는 안테나 방사체를 이용하는 안테 나 장치의 안테나 성능 유지를 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1080-G)에 전기적으로 연결되는 도전성 부재 의 제 1 도전성 부재(1010-1) 및/또는 제 2 도전성 부재(1010-2)는 전자 장치로부터 발생된 전자파 가 사용자 신체에 미치는 영향을 줄일 수도 있다. 도 11은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 도 1의 전자 장치일 수 있다. 도 11을 참조하면, 전자 장치는 디스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전 성 부재, 통신 회로 및 제어 회로를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전기 신호를 이미지로 출력할 수 있다. 본 발명의 다양한 실시 예에 따르면, 디스플레이는 터치 입력 또는 호버링 입력을 수신하도록 구성될 수 있다. 예를 들어, 디스플레이는 터치 패널 또는 전자 펜을 위한 디지타이저(또는, 펜 센서)을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전자 장치의 외관을 형성하는 하우징(미도시)의 일 면을 통하여 노출될 수 있다. 예를 들어, 하우징은 전자 장치의 정면을 형성하는 제 1 면 및 상기 제 1 면과 반대 방향으로 향하고 전자 장치의 후면을 형성하는 제 2 면을 포함할 수 있다. 디스플레이는 하우징의 제 1 면을 통하여 노출될 수 있다. 본 발명의 다양한 실시 예에 따르면, 디스플레이는 다양한 형상일 수 있다. 예를 들어, 디스플레이(119 0)는, 도시된 바와 같이, 원형일 수 있다. 경우에 따라서, 디스플레이는 타원형, 삼각형 또는 사각형 등 일 수도 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 대체적으로 플레이트 형상일 수 있다. 본 발명의 다른 실시 예에 따르면, 디스플레이는 대체적으로 만곡 형상(curved shape)일 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)는 디스플레이 및 도전성 부재 사이에 배 치될 수 있다. 인쇄회로기판(PCB)는 다수의 전자 부품들 및 이들을 연결하는 전기 회로를 구성하는 부분 으로, 전자 장치의 실행 환경을 설정하고, 그 정보를 유지해 주며, 전자 장치 내의 장치들의 데이 터 입출력 교환을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)는 그라운드(1180-G)(이하, '인쇄회로기판(PCB) 그라 운드') 및 급전 부(1180-F)를 포함할 수 있다. 인쇄회로기판(PCB) 그라운드(1180-G)는 안테나 방사체를 이용하는 안테나 장치를 위한 안테나 그라운드로 사용될 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1180-G)는 도 4의 적어도 하나의 그라운드 부 재에 포함될 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 인쇄회로기판(PCB)에 전기적으로 연결될 수 있다. 예를 들어 안테나 방사체는 일 단부에 형성된 급전 부재(1120-F) 및 타 단부에 형성된 접지 부재 (1120-G)를 포함할 수 있다. 안테나 방사체의 급전 부재(1120-F)는 인쇄회로기판(PCB)의 급전 부 (1180-F)에 전기적으로 연결되고, 안테나 방사체의 접지 부재(1120-G)는 인쇄회로기판(PCB)의 인쇄 회로기판(PCB) 그라운드(1180-G)에 전기적으로 연결될 수 있다. 본 발명의 다양한 실시 예에 따르면, 안테나 방사체는 모노폴 안테나, 루프 안테나, IFA 또는 PIFA 등일 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 하우징의 내부 및/또는 하우징의 일부에 적어도 일부 배치될 수 있다. 예를 들어, 안테나 방사체의 적어도 일부는 디스플레이 및 인쇄회로기판(PCB) 사이에 배치되거나, 또는 디스플레이 및 인쇄회로기판(PCB) 사이에 배치되지 않을 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치의 외관을 형성하는 하우징(미도시)이 안테나 방사체로 구성될 수 있다. 하우징이 금속으로 형성된 경우, 안테나 방사체는 하우징의 일부 금속 영역 또는 전체 금속 영역으로 구성될 수 있다. 또는, 하우징의 적어도 일부로 구성된 안테나 방사체는 노출될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 제어 회로에 전기적으로 연결될 수 있다. 도전성 부재는 하우징의 내부 및/또는 하우징의 일부에 적어도 일부 배치될 수 있다. 예를 들어, 도전성 부재 는 하우징의 제 2 면의 일부를 형성할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 다수의 도전성 부재들을 포함할 수 있다. 예를 들어, 도 전성 부재는 제 1 도전성 부재(1110-1) 및 제 2 도전성 부재(1110-2)를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(1110-2)는, 예를 들면, 제 1 도전성 부재(1110-1)를 적어도 일부 둘러싸는 형상을 가질 수 있다. 또는, 제 2 도전성 부재(1110-2)는 환형 금속 패턴 또는 금속 부재일 수 있다. 본 발명의 일 실시 예에 따르면, 통신 회로는 안테나 방사체에 전기적으로 연결될 수 있다. 통신 회로는 안테나 방사체를 이용하여 다양한 형태의 통신(예: 셀룰러 통신)을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 도전성 부재에 전기적으로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1110-1)는 다양한 형태의 통신을 지원하는 안테나 방사체일 수 있다. 예를 들어, 제 1 도전성 부재(1110-1)는 근거리 통신용 안테나 방사체 또는 마그네틱 신호 송수신용 안테나 방사체 등을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1110-1)가 지원하는 통신이 비활성화 상태로 설정된 경우, 제어 회로는 제 1 도전성 부재가 통신 회로에 전기적으로 연결되지 않도록 조정할 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전성 부재(1110-1)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1110-1)는 무선 충전을 지원하는 방사체일 수 있다. 또 다른 예를 들어, 제 1 도전성 부재(1110-1)는 금속 플레이트, 코일형 금속 패턴, 또는 환형 금속 부재 중 적어도 하 나를 포함할 수 있다. 일 실시 예에 따르면, 코일형 금속 패턴은 근거리 통신(예: NFC)을 지원할 수 있다. 또는, 코일형 금속 패턴은 마그네틱 신호 송수신(MST)을 지원할 수 있다. 또는, 코일형 금속 패턴은 무선 충전 을 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 코일형 금속 패턴은, 근거리 통신, 마그네틱 신호 송수신 또는 무선 충전 중 적어도 하나 이상을 지원할 수도 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1110-1)가 지원하는 무선 충전이 비활성화 상태로 설정된 경 우, 제어 회로는 제 1 도전성 부재(1110-1)가 무선 충전 회로(예: 도 4의 450)에 전기적으로 연결되지 않도록 조정할 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전 성 부재(1110-1)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(1110-2)는 통신 및 무선 충전을 지원하지 않는 금속 부재일 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 2 도전성 부재(1110- 2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일 부 기초하여, 도전성 부재의 제 1 도전성 부재(1100-1) 및/또는 제 2 도전성 부재(1100-2)가 전기적 플로 팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터 링된 수신 감도에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(1100-1) 및/또는 제 2 도전성 부재(1100-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재 의 제 1 도전성 부재(1100-1) 및/또는 제 2 도전성 부재(1100-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제어 회로는 도전성 부재의 적어도 두 지점들이 서로 통전되 도록 하여 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 예를 들어, 제어 회로는 제 1 도전성 부재(1110-1)의 서로 분리된 제 1 지점(1110-11) 및 제 2 지점(1110-12) 사이를 전 기적으로 연결시킬 수 있다. 제 1 도전성 부재(1110-1)의 제 1 지점(1110-11) 및 제 2 지점(1110-12)이 통전되 는 경우, 폐루프 형태의 전기적 선로가 형성될 수 있다. 한 실시 예에 따르면, 제 1 도전성 부재(1110-1)는 근 거리 통신용 안테나 방사체(예: NFC 안테나 방사체)일 수 있고, 제어 회로는 근거리 통신용 안테나 방사 체의 + 단자와 - 단자 사이가 통전되도록 조정할 수 있다. 다른 실시 예에 따르면, 제 1 도전성 부재(1110-1)는 무선 충전용 안테나 방사체(또는 코일)일 수 있고, 제어 회로는 무선 충전용 안테나 방사체의 + 단자와 - 단자 사이가 통전되도록 조정할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재의 제 1 도전성 부재(1110- 1) 및/또는 제 2 도전성 부재(1110-2)는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재의 제 1 도전성 부재(1110- 1) 및/또는 제 2 도전성 부재(1110-2)는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지 원할 수도 있다. 도 12는 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 도 1의 전자 장치일 수 있다. 도 12를 참조하면, 전자 장치는 디스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전 성 부재, 통신 회로 및 제어 회로를 포함할 수 있다. 디스플레이, 인쇄회로기판 (PCB), 안테나 방사체, 도전성 부재, 통신 회로 및 제어 회로는, 도 11의 디 스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전성 부재, 통신 회로 및 제 어 회로와 유사하고, 이에 대한 설명은 생략한다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1210-1)가 지원하는 통신이 비활성화 상태로 설정된 경우, 제어 회로는 제 1 도전성 부재(1210-1)가 통신 회로에 전기적으로 연결되지 않도록 조정할 수 있 다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전성 부재(1210-1)가 인 쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1210-1)가 지원하는 무선 충전이 비활성화 상태로 설정된 경 우, 제어 회로는 제 1 도전성 부재(1210-1)가 무선 충전 회로(예: 도 4의 450)에 전기적으로 연결되지 않도록 조정할 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전 성 부재(1210-1)가 인쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(1210-2)는 통신 및 무선 충전을 지원하지 않는 금속 부재일 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 2 도전성 부재(1210- 2)가 인쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일 부 기초하여, 도전성 부재의 제 1 도전성 부재(1210-1) 및/또는 제 2 도전성 부재(1210-2)가 인쇄회로기 판(PCB) 그라운드(1280-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터 링된 수신 감도에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(1210-1) 및/또는 제 2 도전성 부재(1210-2)가 인쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재 의 제 1 도전성 부재(1210-1) 및/또는 제 2 도전성 부재(1210-2)가 인쇄회로기판(PCB) 그라운드(1280-G)에 전기 적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제어 회로는 도전성 부재의 적어도 두 지점들 중 적어도 하 나가 인쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되도록 조정하 수 있다. 예를 들어, 제어 회로는 제 1 도전성 부재(1210-1)의 서로 분리된 제 1 지점(1210-11) 및 제 2 지점(1210-12) 중 적어도 하 나가 인쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되도록 조정할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(1210-1)는 근거리 통신용 안테나 방사체(예: NFC 안테나 방사체)일 수 있고, 제어 회로는 근거리 통신용 안테나 방사체의 + 단자 및 - 단자 중 적어도 하나가 인 쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되도록 조정할 수 있다. 다른 실시 예에 따르면, 제 1 도 전성 부재(1210-1)는 무선 충전용 안테나 방사체(또는 코일)일 수 있고, 제어 회로는 무선 충전용 안테 나 방사체의 + 단자 및 - 단자 중 적어도 하나가 인쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되도록 조정할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되는 도전성 부재 의 제 1 도전성 부재(1210-1) 및/또는 제 2 도전성 부재(1210-2)는 안테나 방사체를 이용하는 안테 나 장치의 안테나 성능 유지를 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1280-G)에 전기적으로 연결되는 도전성 부재 의 제 1 도전성 부재(1210-1) 및/또는 제 2 도전성 부재(1210-2)는 전자 장치로부터 발생된 전자파 가 사용자 신체에 미치는 영향을 줄일 수도 있다. 도 13은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 도 1의 전자 장치일 수 있다. 도 13을 참조하면, 전자 장치는 디스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전 성 부재, 통신 회로 및 제어 회로를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전기 신호를 이미지로 출력할 수 있다. 본 발명의 다양한 실시 예에 따르면, 디스플레이는 터치 입력 또는 호버링 입력을 수신하도록 구성될 수 있다. 예를 들어, 디스플레이는 터치 패널 또는 전자 펜을 위한 디지타이저(또는, 펜 센서)을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전자 장치의 외관을 형성하는 하우징(미도시)의 일 면을 통하여 노출될 수 있다. 예를 들어, 하우징은 전자 장치의 정면을 형성하는 제 1 면 및 상기 제 1 면과 반대 방향으로 향하고 전자 장치의 후면을 형성하는 제 2 면을 포함할 수 있다. 디스플레이는 하우징의 제 1 면을 통하여 노출될 수 있다. 본 발명의 다양한 실시 예에 따르면, 디스플레이는 다양한 형상일 수 있다. 예를 들어, 디스플레이(139 0)는, 도시된 바와 같이, 원형일 수 있다. 경우에 따라서, 디스플레이는 타원형, 삼각형 또는 사각형 등 일 수도 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 대체적으로 플레이트 형상일 수 있다. 본 발명의 다른 실시 예에 따르면, 디스플레이는 대체적으로 만곡 형상(curved shape)일 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 디스플레이 및 도전성 부재 사이에 배 치될 수 있다. 인쇄회로기판(PCB)은 다수의 전자 부품들 및 이들을 연결하는 전기 회로를 구성하는 부분 으로, 전자 장치의 실행 환경을 설정하고, 그 정보를 유지해 주며, 전자 장치 내의 장치들의 데이 터 입출력 교환을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 그라운드 부재(1380-G)(이하, '인쇄회로기판(PCB) 그라운드') 및 급전 부(1380-F)를 포함할 수 있다. 인쇄회로기판(PCB) 그라운드(1380-G)는 안테나 방사체(112 0)를 이용하는 안테나 장치를 위한 안테나 그라운드로 사용될 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1380-G)는 도 4의 적어도 하나의 그라운드 부 재에 포함될 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 인쇄회로기판(PCB)에 전기적으로 연결될 수 있다. 안테나 방사체는 일 단부에 형성된 급전 부재(1320-F) 및 타 단부에 형성된 접지 부재(1320-G)를 포함할 수 있다. 안테나 방사체의 급전 부재(1320-F)는 인쇄회로기판(PCB)의 급전 부(1180-F)에 전 기적으로 연결되고, 안테나 방사체의 접지 부재(1320-G)는 인쇄회로기판(PCB)의 인쇄회로기판(PCB)그라운드(1380-G)에 전기적으로 연결될 수 있다. 본 발명의 다양한 실시 예에 따르면, 안테나 방사체는 모노폴 안테나, 루프 안테나, IFA 또는 PIFA 등일 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 하우징의 내부 및/또는 하우징의 일부에 적어도 일부 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치의 외관을 형성하는 하우징(미도시)이 안테나 방사체로 구성될 수 있다. 하우징이 금속으로 형성된 경우, 안테나 방사체는 하우징의 일부 금속 영역 또는 전체 금속 영역으로 구성될 수 있다. 또는, 하우징의 적어도 일부로 구성된 안테나 방사체는 노출될 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 디스플레이를 적어도 일부 둘러싸는 형상을 가질 수 있다. 예를 들어, 안테나 방사체는 환형일 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체의 접지 부재(1320-G)(또는, 인쇄회로기판(PCB) 및 인쇄회로기판(PCB) 그라운드(1380-G) 간의 연결 포인트) 및 (인쇄회로기판(PCB)의 급전부(1380-F) 사이의 거리가 기준 이상인 경우, 안테나 방사체 및 급전부와 접지부를 하나의 전기적 길이 약 λ/2로 동작하는 는 루프(loop) 안테나 방사체로 동작할 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체의 접지 부재(1320-G)(또는, 인쇄회로기판(PCB) 1380 및 인쇄회로기판(PCB) 그라운드 (1380-G) 간의 연결 포인트) 및 (인쇄회로기판(PCB)의 급전부(1380-F) 사이 의 거리가 기준 이하인 경우(예: 근접), 접지부와 급전부에서부터 가장 먼 거리의 방사체까지의 전기적 길이 약 λ/4로 동작하는 IFA(Inverted F antenna) 안테나 방사체로 동작할 수 있다. 본 발명의 다양한 실시 예에 따르면, 안테나 방사체는 하나 이상의 주파수 대역에서 공진을 형성할 수 있 다. 또는, 안테나 방사체는 다수의 주파수 대역에서 다중 공진(multiple resonance)을 형성할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 제어 회로에 전기적으로 연결될 수 있다. 도전성 부재는 하우징의 내부 및/또는 하우징의 일부에 적어도 일부 배치될 수 있다. 예를 들어, 도전성 부재 는 하우징의 제 2 면의 일부를 형성할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 다수의 도전성 부재들을 포함할 수 있다. 예를 들어, 도 전성 부재는 제 1 도전성 부재(1310-1) 및 제 2 도전성 부재(1310-2)를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(1310-2)는, 예를 들면, 제 1 도전성 부재(1310-1)를 적어도 일부 둘러싸는 형상을 가질 수 있다. 또는, 제 2 도전성 부재(1310-2)는 환형 금속 패턴 또는 금속 부재일 수 있다. 본 발명의 일 실시 예에 따르면, 통신 회로는 안테나 방사체에 전기적으로 연결될 수 있다. 통신 회로는 안테나 방사체를 이용하여 다양한 형태의 통신(예: 셀룰러 통신)을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 도전성 부재에 전기적으로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1310-1)는 다양한 형태의 통신을 지원하는 안테나 방사체일 수 있다. 예를 들어, 제 1 도전성 부재(1310-1)는 근거리 통신용 안테나 방사체 또는 마그네틱 신호 송수신용 안테나 방사체 등을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1310-1)가 지원하는 통신이 비활성화 상태로 설정된 경우, 제어 회로는 제 1 도전성 부재가 통신 회로에 전기적으로 연결되지 않도록 조정할 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전성 부재(1310-1)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1310-1)는 무선 충전을 지원하는 방사체일 수 있다. 또 다른 예를 들면, 제 1 도전성 부재(1310-1)는 금속 플레이트, 코일형 금속 패턴, 또는 환형 금속 부재 중 적어도 하 나를 포함할 수 있다. 일 실시 예에 따르면, 코일형 금속 패턴은 근거리 통신(예: NFC)을 지원할 수 있다. 또는, 코일형 금속 패턴은 마그네틱 신호 송수신(MST)을 지원할 수 있다. 또는, 코일형 금속 패턴은 무선 충전 을 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 코일형 금속 패턴은, 근거리 통신, 마그네틱 신호 송수신 또는 무선 충전 중 적어도 하나 이상을 지원할 수도 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1310-1)가 지원하는 무선 충전이 비활성화 상태로 설정된 경 우, 제어 회로는 제 1 도전성 부재(1310-1)가 무선 충전 회로(예: 도 4의 450)에 전기적으로 연결되지 않도록 조정할 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전 성 부재(1310-1)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(1310-2)는 통신 및 무선 충전을 지원하지 않는 금속 패턴 또 는 금속 부재일 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 2 도전 성 부재(1310-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일 부 기초하여, 도전성 부재의 제 1 도전성 부재(1310-1) 및/또는 제 2 도전성 부재(1310-2)가 전기적 플로 팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터 링된 수신 감도에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(1310-1) 및/또는 제 2 도전성 부재(1300-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재 의 제 1 도전성 부재(1310-1) 및/또는 제 2 도전성 부재(1310-2)가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제어 회로는 도전성 부재의 적어도 두 지점들이 서로 통전되 도록 하여 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 예를 들어, 제어 회로는 제 1 도전성 부재(1310-1)의 서로 분리된 제 1 지점(1310-11) 및 제 2 지점(1310-12) 사이를 전 기적으로 연결시킬 수 있다. 예를 들어 제 1 도전성 부재(1310-1)의 제 1 지점(1310-11) 및 제 2 지점(1310- 12)이 통전되는 경우, 폐루프 형태의 전기적 선로가 형성될 수 있다. 한 실시 예에 따르면, 제 1 도전성 부재 (1310-1)는 근거리 통신용 안테나 방사체(예: NFC 안테나 방사체)일 수 있고, 제어 회로는 근거리 통신 용 안테나 방사체의 + 단자와 - 단자 사이가 통전되도록 조정할 수 있다. 다른 실시 예에 따르면, 제 1 도전성 부재(1310-1)는 무선 충전용 안테나 방사체(또는 코일)일 수 있고, 제어 회로는 무선 충전용 안테나 방 사체의 + 단자와 - 단자 사이가 통전되도록 조정할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재의 제 1 도전성 부재(1310- 1) 및/또는 제 2 도전성 부재(1310-2)는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재의 제 1 도전성 부재(1310- 1) 및/또는 제 2 도전성 부재(1310-2)는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지 원할 수도 있다. 도 14는 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 도 1의 전자 장치일 수 있다. 도 14를 참조하면, 전자 장치는 디스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전 성 부재, 통신 회로 및 제어 회로를 포함할 수 있다. 디스플레이, 인쇄회로기판 (PCB), 안테나 방사체, 도전성 부재, 통신 회로 및 제어 회로는, 도 13의 디 스플레이, 인쇄회로기판(PCB), 안테나 방사체, 도전성 부재, 통신 회로 및 제 어 회로와 유사하고, 이에 대한 설명은 생략한다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1410-1)가 지원하는 통신이 비활성화 상태로 설정된 경우, 제어 회로는 제 1 도전성 부재(1410-1)가 통신 회로에 전기적으로 연결되지 않도록 조정할 수 있 다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전성 부재(1410-1)가 인 쇄회로기판(PCB) 그라운드(1480-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1410-1)가 지원하는 무선 충전이 비활성화 상태로 설정된 경 우, 제어 회로는 제 1 도전성 부재(1410-1)가 무선 충전 회로(예: 도 4의 450)에 전기적으로 연결되지 않도록 조정할 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전성 부재(1410-1)가 인쇄회로기판(PCB) 그라운드(1480-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(1410-2)는 통신 및 무선 충전을 지원하지 않는 금속 부재일 수 있다. 제어 회로는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 2 도전성 부재(1410- 2)가 인쇄회로기판(PCB) 그라운드(1480-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일 부 기초하여, 도전성 부재의 제 1 도전성 부재(1410-1) 및/또는 제 2 도전성 부재(1410-2)가 인쇄회로기 판(PCB) 그라운드(1480-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터 링된 수신 감도에 적어도 일부 기초하여, 도전성 부재의 제 1 도전성 부재(1410-1) 및/또는 제 2 도전성 부재(1410-2)가 인쇄회로기판(PCB) 그라운드(1480-G)에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재 의 제 1 도전성 부재(1410-1) 및/또는 제 2 도전성 부재(1410-2)가 인쇄회로기판(PCB) 그라운드(1480-G)에 전기 적으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제어 회로는 도전성 부재의 적어도 두 지점들 중 적어도 하 나가 인쇄회로기판(PCB) 그라운드(1480-G)에 전기적으로 연결되도록 조정할 수 있다. 예를 들어, 제어 회로 는 제 1 도전성 부재(1410-1)의 서로 분리된 제 1 지점(1410-11) 및 제 2 지점(1410-12) 사이를 전기적 으로 연결시킬 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(1410-1)는 근거리 통신용 안테나 방사체(예: NFC 안테나 방사체)일 수 있고, 제어 회로는 근거리 통신용 안테나 방사체의 + 단자 및 - 단자 중 적어도 하나가 인 쇄회로기판(PCB) 그라운드(1480-G)에 전기적으로 연결되도록 조정할 수 있다. 다른 실시 예에 따르면, 제 1 도 전성 부재(1410-1)는 무선 충전용 안테나 방사체(또는 코일)일 수 있고, 제어 회로는 무선 충전용 안테 나 방사체의 + 단자 및 - 단자 중 적어도 하나가 인쇄회로기판(PCB) 그라운드(1480-G)에 전기적으로 연결되도록 조정할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1480-G)에 전기적으로 연결되는 도전성 부재 의 제 1 도전성 부재(1410-1) 및/또는 제 2 도전성 부재(1410-2)는 안테나 방사체를 이용하는 안테 나 장치의 안테나 성능 유지를 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1480-G)에 전기적으로 연결되는 도전성 부재 의 제 1 도전성 부재(1410-1) 및/또는 제 2 도전성 부재(1410-2)는 전자 장치로부터 발생된 전자파 가 사용자 신체에 미치는 영향을 줄일 수도 있다. 도 15는 본 발명의 일 실시 예에 따른 전자 장치를 도시한다. 본 발명의 다양한 실시 예에 따르면, 전자 장치 는 도 1의 전자 장치일 수 있다. 도 15를 참조하면, 전자 장치는 하우징(1500-H), 윈도우, 디스플레이, 그라운드 부재(이하, 인쇄회로기판(PCB) 그라운드)(1580-G), 배터리, 도전성 부재 및 안테나 방사체를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 하우징(1500-H)는 전자 장치의 외관을 형성하는 구성이고, 대체적으로 원통형일 수 있다. 본 발명의 일 실시 예에 따르면, 하우징(1500-H)은 제 1 면(1500-H1) 및 상기 제 1 면(1500-H1)과 반대 방향으 로 향하는 제 2 면(1500-H2)을 포함할 수 있다. 예를 들어 제 1 면(1500-H1)은 전자 장치의 정면(F)을 형성하고, 제 2 면(1500-H2)은 전자 장치의 후면(B)을 형성할 수 있다. 상술한 바와 같이, 하우징(1500- H)은 대체적으로 원통형일 수 있다. 예를 들어 제 1 면(1500-H1)은 전자 장치의 정면(F)에서 후면(B)으로 향하는 방향으로 바라보았을 때 대체적으로 원형일 수 있다. 예를 들어 제 2 면(1500-H2) 또한 전자 장치 의 후면(B)에서 정면(F)으로 향하는 방향으로 바라보았을 때 대체적으로 원형일 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 면(1500-H1)은 투명한 중앙 영역(1500-H11) 및 투명 영역(1500-H11)을 에워싸는 엣지 영역(1500-H12)을 포함할 수 있다. 투명한 중앙 영역(1500-H11)은 대체적으로 원형일 수 있고, 엣지 영역(1500-H12)은 환형일 수 있다.본 발명의 일 실시 예에 따르면, 제 1 면(1500-H1)의 투명한 중앙 영역(1500-H11)은 평면일 수 있고, 제 1 면 (1500-H1)의 환형의 엣지 영역(500-H12)은 평면 또는 경사면일 수 있다. 본 발명의 일 실시 예에 따르면, 윈도우는 제 1 면(1500-H1)의 투명한 중앙 영역(1500-H11)을 형성할 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 전기 신호를 이미지로 출력할 수 있다. 디스플레이 는 윈도우 및 인쇄회로기판(PCB) 그라운드(1580-G) 사이에 배치될 수 있다. 디스플레이는 윈도우 를 통해서 노출될 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1580-G)는 하우징(1500-H)의 제 1 면(1500-H1) 및 제 2 면(1500-H2) 사이에 배치될 수 있다. 예를 들어, 인쇄회로기판(PCB) 그라운드(1580-G)는 NFC 안테나 방사 체(1510-A) 및 배터리 사이에 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1580-G)는 인쇄회로기판(PCB)(미도시)의 일부일 수 있다. 인쇄회로기판(PCB)는 전자 장치의 다수의 전자 부품들이 실장되는 구성이고, 전자 장치의 실행 환경을 설정하며 전자 장치내 전자 부품들의 데이터 입출력 교환을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 배터리는 인쇄회로기판(PCB) 그라운드(1580-G) 및 도전성 부재 사 이에 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 제 1 도전성 부재(1510-1), 제 2 도전성 부재(1510-2) 및 제 3 도전성 부재(1510-3)를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1510-1)는 하우징(1500-H)의 2 면(1500-H2) 및 배터리 사이에 배치될 수 있다. 예를 들어, 제 1 도전성 부재(1510-1)는 하우징(1500-H)의 제 2 면(1500-H2)의 적어도 일부일 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(1510-1)는 다양한 형태의 통신에 사용될 수 있다. 예를 들어, 제 1 도전성 부재(1510-1)는 근거리 통신을 지원하는 안테나 방사체일 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(1510-1)는 무선 충전을 지원하는 무선 충전 코일일 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(1510-2)는 하우징(1500-H)의 내부에 배치되거나, 또는 하우 징(1500-H)의 제 2 면(1500-H2)의 적어도 일부에 배치될 수 있다. 예를 들어, 제 2 도전성 부재(1510-2)는 하우 징(1500-H)의 제 2 면(1500-H2)의 일부를 형성할 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전성 부재(1510-2)는 환형일 수 있다. 예를 들어, 제 1 도전성 부재 (1510-1)는 환형의 제 2 도전성 부재(1510-2)에 의해 둘러싸여 있을 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 도전서 부재(1510-2)는 통신 및 무선 충전을 지원하지 않는 금속 패턴 또 는 금속 부재일 수 있다. 본 발명의 일 실시 예에 따르면, 제 3 도전성 부재(1510-3)는 하우징(1500-H)의 내부에 배치되거나, 또는 하우 징(1500-H)의 제 2 면(1500-H2)의 적어도 일부에 배치될 수 있다. 예를 들어, 제 3 도전성 부재(1510-3)는 디스 플레이 및 인쇄회로기판(PCB) 그라운드(1580-G) 사이에 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 제 3 도전성 부재(1510-3)는 다양한 통신을 지원하는 안테나 방사체일 수 있다. 예를 들어, 제 3 도전성 부재(1510-3)는 근거리 통신(예: NFC)을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 하우징(1500-H)의 내부 및/또는 하우징(1500-H)의 적어 도 일부 배치될 수 있다. 예를 들어, 하우징(1500-H)은 금속 재질로 형성된 원통형 부분을 포함하고, 안테나 방 사체의 적어도 일부로 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 하우징(1500-H)은 전자 장치의 외관을 형성하면서, 안테나 방사체(152 0)로 구성될 수 있다. 하우징(1500-H)이 금속으로 형성된 경우, 안테나 방사체는 하우징(1500-H)의 일부 금속 영역 또는 전체 금속 영역으로 구성될 수 있다. 또는, 하우징(1500-H)의 적어도 일부로 구성된 안테나 방 사체는 노출될 수 있다.본 발명의 일 실시 예에 따르면, 안테나 방사체는 인쇄회로기판(PCB) 그라운드(1580-G)가 실장되어 있는 인쇄회로기판(PCB)(미도시)의 급전 부에 전기적으로 연결되고, 인쇄회로기판(PCB) 그라운드(1580-G)에 전기적으 로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는, 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전성 부재(1510-1), 제 2 도전성 부재(1510-2) 또는 제 3 도전성 부재(1510-3) 중 적어도 하나가 전기적 플 로팅 상태로 구성되는 제 1 상태 또는 인쇄회로기판(PCB) 그라운드(1580-G)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(1510-1)가 무선 충전용 코일이고, 무선 충전이 비활성화 상태로 설정된 경우, 전자 장치는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 1 도전성 부 재(1510-1)가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 인쇄회로기판(PCB) 그라운드(1580-G)에 전기적으 로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 3 도전성 부재(1510-3)가 NFC 안테나 방사체이고, NFC 통신이 비활성화 상태로 설정된 경우, 전자 장치는 전자 장치로부터 발생된 다양한 입력에 기반하여 제 3 도전성 부 재(1510-3)가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 인쇄회로기판(PCB) 그라운드(1580-G)에 전기적으 로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는, 전자 장치에 사용자가 근접했는지 여부에 적어도 일 부 기초하여, 제 1 도전성 부재(1510-1), 제 2 도전성 부재(1510-2) 또는 제 3 도전성 부재(1510-3) 중 적어도 하나가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 인쇄회로기판(PCB) 그라운드(1580-G)에 전기적으로 연결 되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는 안테나 방사체의 수신 감도를 모니터링하고, 모니터 링된 수신 감도에 적어도 일부 기초하여, 제 1 도전성 부재(1510-1), 제 2 도전성 부재(1510-2) 또는 제 3 도전 성 부재(1510-3) 중 적어도 하나가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 인쇄회로기판(PCB) 그라운드 (1580-G)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는 사용자 입력에 적어도 일부 기초하여, 제 1 도전성 부재 (1510-1), 제 2 도전성 부재(1510-2) 또는 제 3 도전성 부재(1510-3) 중 적어도 하나가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 인쇄회로기판(PCB) 그라운드(1580-G)에 전기적으로 연결되는 제 2 상태 중 하나를 선 택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재 및/또는 NFC 안테나 방사체 (1510-A)는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 제 1 도전성 부재(1510-1), 제 2 도전성 부재 (1510-2) 또는 제 3 도전성 부재(1510-3) 중 적어도 하나는 안테나 방사체를 이용하는 안테나 장치의 안 테나 성능 유지를 지원할 수도 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1580-G)에 전기적으로 연결되는 제 1 도전성 부재(1510-1), 제 2 도전성 부재(1510-2) 또는 제 3 도전성 부재(1510-3) 중 적어도 하나는 안테나 방사체 를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1580-G)에 전기적으로 연결되는 제 1 도전성 부재(1510-1), 제 2 도전성 부재(1510-2) 또는 제 3 도전성 부재(1510-3) 중 적어도 하나는 전자 장치로 부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수도 있다. 도 16 및 도 17은 본 발명의 일 실시 예에 따른 전자 장치를 도시한다. 본 발명의 다양한 실시 예에 따르면, 전 자 장치는 도 1의 전자 장치일 수 있다. 도 16 및 17를 참조하면, 전자 장치는 대체적으로 통상의 시계와 유사한 형태일 수 있고, 사용자의 손목 에 착용 가능할 수 있다. 여기서, 전자 장치는 하우징, 안테나 방사체, 도전성 부재, 디스플레이, 브래킷(1710-5) 및 인쇄회로기판(PCB)를 포함할 수 있다. 본 발명의 다양한 예에 따르 면 전자 장치는 도 1의 전자 장치일 수 있다. 본 발명의 일 실시 예에 따르면, 하우징은 전자 장치의 외관을 형성할 수 있다. 예를 들어, 하우징 은 제 1 면(F) 및 제 1 면(F)과 반대 방향을 향하는 제 2 면(B)을 제공할 수 있다. 하우징은 제 1 면(F) 및 제 2 면(B) 사이의 제 3 면(S)을 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 하우징은 제 1 하우징(1710-1), 제 2 하우징(1710-2) 및 커버(1710- 3)를 포함할 수 있다. 제 1 하우징(1710-1), 제 2 하우징(1710-2) 및 커버(1710-3)이 결합되는 경우, 부품 실 장을 위한 공간이 마련될 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 하우징(1710-1)은 전자 장치의 제 1 면(F) 및 제 3 면(S)을 제공할 수 있다. 제 2 하우징(1710-2) 및 커버(1710-3)는 전자 장치의 제 2 면(B)을 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 하우징(1710-1)은 대체적으로 둥근 형태의 환형이고, 개구(1710-11)를 포 함할 수 있다. 또는, 제 1 하우징(1710-1)은 사각 환형, 사각 환형, 타원 환형 등의 다양한 모양일 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 하우징(1710-1)은 개구(1710-11)에 배치되는 윈도우(또는, 글라스)(1710- 15)를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 면(F)은 투명한 윈도우(1710-15)에 의해 구성되는 투명한 중앙 영역(F1) 및 투명한 중앙 영역(F1)을 에워싸는 환형의 엣지 영역(F2)을 포함할 수 있다. 디스플레이는 중앙 영역 (F1)을 통해서 노출될 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 하우징(1710-1)의 적어도 일부는 스트랩(strap) 연결 가능하도록 형성될 수 있다. 예를 들어, 제 1 하우징(1710-1)은 서로 반대 방향으로 연장되는 두 쌍의 연장 부들(1710-12, 1710- 13)을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 하우징(1710-1)은 제 3 면(S)에 형성된 하나 이상의 관통 공(1710-16)을 포함할 수 있다. 회전 방식의 입력 장치의 일환인 휠 버튼(1710-17)은 관통 공(1710-16)에 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 하우징(1710-2)은 제 1 하우징(1710-1)에 결합되고, 관통 부(1710-21)를 포함하는 대체적으로 환형일 수 있다. 예를 들어, 제 2 하우징(1710-2)은 환형의 엣지 부분(edge portion)(1710-2E)을 포함할 수 있다. 제 1 하우징(1710-1)은 제 2 하우징(1710-2)의 엣지 부분(1710-2E)에 결 합 가능한 환형의 엣지 부분(1710-1E)을 포함할 수 있다. 제 1 하우징(1710-1)의 엣지 부분(1710-1E) 및 제 2 하우징(1710-2)의 엣지 부분(1710-2E) 사이에는 결합 수단이 구성될 수 있다. 예를 들어, 결합 수단은 기구적 결합 형상, 접착제 등을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 커버(1710-3)는 제 2 하우징(1710-2)의 관통 부(1710-21)에 결합되고, 제 2 하 우징(1710-2)의 관통 부(1710-21)를 막을 수 있는 플레이트 형상일 수 있다. 제 2 하우징(1710-2) 및 커버 (1710-3)이 결합되는 경우, 전자 장치의 제 1 면(F)에서 제 2 면(B)으로 향하는 방향으로 대체적으로 오 목한 용기 형상이 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 제 2 하우징(1710-2)의 관통 부(1710-21)는 원형일 수 있고, 커버(1710-3)는 이에 대응하는 원형일 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 하우징의 내부 및/또는 하우징의 적어도 일부 배치될 수 있다. 예를 들어, 제 1 하우징(1710-1)의 적어도 일부는 금속 재질을 포함하고, 안테나 방사체 의 적어도 일부를 구성할 수 있다. 본 발명의 일 실시 예에 따르면, 하우징은 전자 장치의 외관을 형성하면서, 안테나 방사체로 구성될 수 있다. 하우징이 금속으로 형성된 경우, 안테나 방사체는 하우징의 일부 금속 영역 또는 전체 금속 영역으로 구성될 수 있다. 또는, 하우징의 적어도 일부로 구성된 안테나 방사체는 노출될 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 인쇄회로기판(PCB)의 급전부 및 접지부(미도시) 에 전기적으로 연결되어 무선 신호를 송신하거나 또는 수신하도록 공진할 수 있다. 여기서, 안테나 방사체 는 인쇄회로기판(PCB)의 급전부에 전기적으로 연결되도록 연장되는 급전 부재를 포함할 수 있다. 안테나 방사체는 인쇄회로기판(PCB)의 인쇄회로기판(PCB) 그라운드(1680-G)에 전기적으로 연결되도 록 연장되는 접지 부재를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1680-G)는 도 4의 그라운드 부재에 포함 될 수 있다.본 발명의 일 실시 예에 따르면, 안테나 방사체의 급전 부재 또는 접지 부재는 탄성을 가질 수 있다. 또 는, 인쇄회로기판(PCB)의 급전부 또는 접지부는 탄성을 가질 수 있다. 안테나 방사체의 급전 부재 및 접지 부재는 인쇄회로기판(PCB)의 급전부 및 인쇄회로기판(PCB) 그라운드(1680-G)에 탄성 지지 하에 전기적으로 접촉될 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 모노폴 안테나, 루프 안테나, IFA(Inverted-F Antenna), PIFA(Planar Inverted-F Antenna), 루프(loop) 안테나 또는 슬롯 안테나 등을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 안테나 방사체는 적어도 하나 이상의 통신에서 사용될 수 있다. 예를 들 어, 안테나 방사체는 셀룰러 통신에서 사용될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 하우징의 내부에 배치되거나, 또는 하우징의 일부에 적어도 일부 배치될 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 디스플레이 및 인쇄회로기판(PCB) 사이 에 배치되는 제 1 도전성 부재(1610-1)를 포함할 수 있다. 제 1 도전성 부재(1610-1)는 다양한 형태의 통신을 지원하는 안테나 방사체일 수 있다. 예를 들어, 제 1 도전성 부재(1610-1)는 근거리 통신(예: NFC 통신)을 지원 할 수 있다. 또는, 제 1 도전성 부재(1610-1)는 마그네틱 신호 송수신을 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 제 2 하우징(1720-2)에 배치되는 제 2 도전성 부재 (1610-2)를 포함할 수 있다. 예를 들어, 제 2 도전성 부재(1610-2)는 대체적으로 환형일 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 2 도전성 부재(1610-2)는 다양한 형태의 통신을 지원하는 안테나 방사 체일 수 있다. 예를 들어, 제 2 도전성 부재(1610-2)는 근거리 통신을 지원할 수 있다. 또는, 제 2 도전성 부재 (1610-2)는 마그네틱 신호 송수신을 지원할 수도 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 커버(1710-3)에 배치되는 제 3 도전성 부재(1610- 3)를 포함할 수 있다. 예를 들어, 제 3 도전성 부재(1610-3)는 다양한 형태의 통신을 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 3 도전성 부재(1610-3)는 무선 충전을 지원하기 위한 무선 충전용 코일 을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 커버(1710-3)에 배치되는 제 4 도전성 부재(1610- 4)를 포함할 수 있다. 예를 들어, 제 4 도전성 부재(1610-4)는 제 3 도전성 부재(1610-3)를 에워싸는 환형의 금 속 패턴 또는 금속 부재일 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 브래킷(1710-4)에 배치되는 도전성 패턴을 더 포함할 수도 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 윈도우(1710-15) 및 브래킷(1710-4) 사이에 배치될 수 있 다. 디스플레이는 인쇄회로기판(PCB)에 전기적으로 연결되고, 인쇄회로기판(PCB)로부터의 전 기적 신호에 대응하는 이미지를 표시할 수 있다. 디스플레이는 제 1 하우징(1710-1)의 윈도우(1710-15)를 통하여 노출될 수 있다. 디스플레이는 LCD(liquid-crystal display) 또는 OLED(organic light-emitting diode)(예를 들어, AM(active-matrix)-OLED) 등을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 인쇄회로기판(PCB)에 전기적으로 연결되는 전기적 연결 수단을 포함할 수 있다. 예를 들어, 디스플레이는 인쇄회로기판(PCB)에 전기적으로 연결되는 F인쇄회로기판(PCB)(Flexible Printed Circuit Board)(1690-F)를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 터치 입력 또는 호버링(hovering) 입력을 위한 터치 패널 을 더 포함할 수 있다. 디스플레이 에서 유발된 터치 입력 또는 호버링 입력은 인쇄회로기판(PCB) 로 전달될 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 디스플레이 일체형 터치 스크린을 제공할 수 있다. 예를 들면, 디스플레이는 AM-OLED 일체형 터치 스크린(OCTA: On-Cell TSP AMOLED)일 수 있다. 본 발명의 일 실시 예에 따르면, 브래킷(1710-4)은 전자 부품들을 설치 및 지지할 수 있는 구조물이고, 디스플 레이 및 인쇄회로기판(PCB) 사이에 배치될 수 있다. 디스플레이 및 인쇄회로기판(PCB)(168 0)은 브래킷(1710-4)에 의해 지지되어 강성을 확보할 수 있다.본 발명의 일 실시 예에 따르면, 브래킷(1710-4)은 디스플레이를 설치할 수 있는 부분으로 지원되는 제 1 설치면(1710-4S1) 및 인쇄회로기판(PCB)를 설치할 수 있는 부분으로 지원되는 제 2 설치면(1710-4S2)을 포함할 수 있다. 브래킷(1710-4)의 설치면들(1710-4S1, 1710-4S2)은 디스플레이 및 인쇄회로기판 (PCB)를 흔들림 없이 장착시킬 수 있는 형상(예: 홈 등)을 가질 수 있다. 본 발명의 일 실시 예에 따르면, 브래킷(1710-4)은 관통 부(1710-41)를 포함하고, 대체적으로 환형일 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 다수의 전자 부품들 및 이들을 연결하는 전기 선로 를 구성할 수 있다. 인쇄회로기판(PCB)은 전자 장치의 실행 환경을 설정하고, 그 정보를 유지해 주 며, 전자 장치 내의 장치들의 데이터 입출력 교환을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 디스플레이는 인쇄회로기판(PCB)에 전기적으로 연결하기 위한 커 넥터가 설치된 연장 부(미도시)를 포함할 수 있다. 또는, 인쇄회로기판(PCB)은 디스플레이에 전기 적으로 연결하기 위한 커넥터가 설치된 연장 부(미도시)를 포함할 수도 있다. 연장 부는 브래킷(1710-4)의 관통 부(1710-41)를 통하여 디스플레이 및 인쇄회로기판(PCB) 사이를 연결할 수 있다. 또는 연장 부는 브래킷(1710-4)의 측부 공간을 통하여 디스플레이 및 인쇄회로기판(PCB) 사이를 연결할 수도 있다. 이러한 연장 부는 FPC(Flexible Printed Circuit), 케이블(cable) 등을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 안테나 방사체에 전기적으로 연결된 통신 회 로(미도시)를 포함할 수 있다. 통신 회로는 안테나 방사체를 이용하는 통신을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재가 다양한 형태의 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하도록 구성된 경우, 통신 회로는 도전성 부재를 이용하는 통신을 지원할 수도 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재가 무선 충전을 지원하도록 구성된 경우, 전자 장치는 인쇄회로기판(PCB)에 실장된 무선 충전 회로(미도시)를 포함할 수 있다. 무선 충전 회로는 도전성 부재 를 이용하는 무선 충전을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 인쇄회로기판(PCB)은 도전성 부재 및 그라운드 부재에 전기 적으로 연결된 제어 회로(미도시)를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재가 다양한 형태의 통신을 지원하고, 도전성 부재 가 지원하는 통신이 활성화 상태로 설정된 경우, 제어 회로는 도전성 부재가 그라운드 부재에 전기 적으로 연결되지 않고, 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재가 다양한 형태의 통신을 지원하고, 도전성 부재 가 지원하는 통신이 비활성화 상태로 설정된 경우, 제어 회로는 도전성 부재가 통신 회로에 전기적으로 연결되지 않고, 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는, 예를 들면, 무선 충전용 제 1 안테나 방사체 및 근 거리 통신용 제 2 안테나 방사체를 포함할 수 있다. 여기서, 무선 충전 및 근거리 통신은, 사용자 입력에 의해 활성화 상태 또는 비활성화 상태로 설정될 수 있다. 예를 들어 무선 충전 및 근거리 통신이 모두 활성화 상태로 설정되는 경우, 제어 회로는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되고, 근거리 통신용 제 2 안테나 방사체가 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 예를 들어 무선 충전 및 근 거리 통신이 모두 비활성화 상태로 설정되는 경우, 제어 회로는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되지 않고, 근거리 통신용 제 2 안테나 방사체가 통신 회로에 전기적으로 되지 않도록 조정할 수 있다. 예를 들어 무선 충전 및 근거리 통신이 모두 비활성화 상태로 설정되는 경우, 제어 회로는 무 선 충전용 제 1 안테나 방사체 및 근거리 통신용 제 2 안테나 방사체 중 적어도 하나가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태를 선택적으로 제공할 수 있다. 예를 들어, 무선 충전이 활성화 상태로 설정되고, 근거리 통신이 비활성화 상태로 설정되는 경우, 제어 회로는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되고, 근거리 통신용 제 2 안테나 방사체 가 통신 회로에 전기적으로 연결되지 않도록 조정할 수 있다. 제어 회로는 근거리 통신용 제 2 안테나 방사체가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나 를 선택적으로 제공할 수 있다. 예를 들어, 무선 충전이 비활성화 상태로 설정되고, 근거리 통신이 활성화 상태로 설정되는 경우, 제어 회로는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되지 않고, 근거리 통신용 제 2 안테나 방 사체가 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 제어 회로는 무선 충전용 제 1 안테나가 전기적 플 로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적 으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재가 통신을 지원하지 않는 것으로 구성된 경우, 제어 회 로는 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태는, 안테나 방 사체가 인쇄회로기판(PCB) 그라운드(1680-G)에 전기적으로 연결된 상태일 수 있다. 제 1 상태에서 도전성 부재는 안테나 그라운드로 사용되지 않고, 인쇄회로기판(PCB) 그라운드(1680-G)는 안테나 그라운드로 사 용될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재가 인쇄회로기판(PCB) 그라운드(1680-G)에 전기적으로 연결 되는 제 2 상태는, 안테나 방사체가 인쇄회로기판(PCB) 그라운드(1680-G) 및 도전성 부재에 전기적 으로 연결된 상태일 수 있다. 제 2 상태에서 도전성 부재는, 인쇄회로기판(PCB) 그라운드(1680-G)와 함께 안테나 그라운드로 사용될 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일부 기초 하여, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 전자 장치는 전자 장치에 사용자가 근 접했는지 여부를 나타내는 신호를 발생할 수 있는 센서를 더 포함하고, 제어 회로는 센서로부터의 신호에 적어 도 일부 기초하여, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어, 전자 장치에 사용자가 근접한 것이 감지되는 경우, 제어 회로는 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태를 제 공할 수 있다. 센서는 온도 센서, 압력 센서, 자기 센서, 광 센서, 음향 센서, 근접 센서, 중력 센서, 가속도 센서, 자이로 센서 또는 지문센서 등을 포함할 수 있다. 센서는 인쇄회로기판(PCB), 브래킷(1710-4) 및 하우징 중 적어도 한 곳에 배치될 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터링된 수 신 감도에 적어도 일부 기초하여, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운 드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어, 안테나 방 사체의 수신 감도가 기준 이하인 경우, 제어 회로는 도전성 부재가 그라운드 부재에 전기적 으로 연결되는 제 2 상태를 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재가 전기 적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 전자 장치는 유저 인터페이스를 더 포함하고, 제어 회로는 유저 인터페이스 를 통하여 수신된 사용자 입력에 적어도 일부 기초하여, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수도 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1680-G)에 전기적으로 연결되는 도전성 부재 는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(1680-G)에 전기적으로 연결되는 도전성 부재 는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수도 있다. 도 18은 본 발명의 다양한 실시 예에 따른 전자 장치를 도시한다. 본 발명의 다양한 실시 예에 따르면, 전자 장 치는 도 1의 전자 장치일 수 있다. 도 18을 참조하면, 전자 장치는 도 16 및 17의 전자 장치일 수 있다. 손목 착용에 필요한 스트랩 은 전자 장치의 양쪽에 회전 가능하게 연결될 수 있다. 스트랩은 가요성을 가질 수 있다. 본 발명의 일 실시 예에 따르면, 스트랩은 도전성 부재를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 다양한 형태의 통신을 지원하는 제 1 도전성 부재(1810- 1)를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(1810-1)는 루프 안테나일 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 1 도전성 부재(1810-1) 스트랩 내부에 배치되거나, 또는 스트랩 의 일면 상에 배치될 수 있다. 또는, 제 1 도전성 부재(1810-1)는 스트랩의 적어도 일부일 수도 있 다. 본 발명의 일 실시 예에 따르면, 도전성 부재는 금속 부재를 포함하는 제 2 도전성 부재(1810-2)를 포함 할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제 2 도전성 부재(1810-2) 스트랩 내부에 배치되거나, 또는 스트랩 의 일면 상에 배치될 수 있다. 또는, 제 2 도전성 부재(1810-1)는 스트랩의 적어도 일부일 수도 있 다. 본 발명의 다양한 실시 예에 따르면, 스트랩은 도전성 부재를 비 도전성 물질로 피복하는 방식 (예: 인서트 사출 성형)으로 성형될 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치와 스트랩 사이의 연결 부분에는 도전성 부재를 전자 장치에 전기적으로 연결하기 위한 전기적 연결 수단(1800-1, 1800-2)이 설치될 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는 안테나 방사체(예: 도 17의 안테나 방사체 1720)에 전기적 으로 연결된 통신 회로(미도시)를 포함할 수 있다. 통신 회로는 안테나 방사체를 이용하는 통신을 지원할 수 있다. 본 발명의 일 실시 예에 따르면, 스트랩의 제 1 도전성 부재(1810-1)가 다양한 형태의 통신(예: 근거리 통신)을 지원하도록 구성된 경우, 통신 회로는 제 1 도전성 부재(1810-1)를 이용한 통신을 지원할 수도 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는 도전성 부재 및 그라운드 부재(예: 도 16의 인쇄회로 기판(PCB) 그라운드 1680-G)에 전기적으로 연결된 제어 회로(미도시)를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 스트랩의 제 1 도전성 부재(1810-1)가 지원하는 통신이 활성화 상태 로 설정된 경우, 제어 회로는 제 1 도전성 부재(1810-1)가 그라운드 부재(예: 도 17의 인쇄회로기판(PCB) 그라 운드(1780-G)에 전기적으로 연결되지 않고, 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 본 발명의 다양한 실시 예에 따르면, 스트랩의 제 1 도전성 부재(1810-1)가 지원하는 통신이 비활성화 상 태로 설정된 경우, 제어 회로는 제 1 도전성 부재(1810-1)가 통신 회로에 전기적으로 연결되지 않고, 전기적 플 로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 16의 인쇄회로기판(PCB) 그라운드 1680-G)에 전기 적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제어 회로는 제 2 도전성 부재(1810-2)가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 16의 인쇄회로기판(PCB) 그라운드 1680-G)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1810-1) 및/또는 제 2 도전성 부재(1810-2)가 전기적 플로팅 상태로 구성되는 제 1 상태는, 안테나 방사체(예: 도 16의 1620)가 인쇄회로기판(PCB) 그라운드(예: 도 16의 1680-G) 및 그라운드 부재(예: 도 16의 1630)에 전기적으로 연결된 상태일 수 있다. 제 1 상태에서 제 1 도전성 부재(1810-1) 및/또는 제 2 도전성 부재(1810-2)는 안테나 그라운드로 사용되지 않고, 그라운드 부재(예: 도 16 의 1630) 및 인쇄회로기판(PCB) 그라운드(예: 도 16의 1680-G)는 안테나 그라운드로 사용될 수 있다. 본 발명의 일 실시 예에 따르면, 제 1 도전성 부재(1810-1) 및/또는 제 2 도전성 부재(1810-2)가 그라운드 부재 (예: 도 16의 1630)에 전기적으로 연결되는 제 2 상태는, 안테나 방사체(예: 도 16의 1620)가 인쇄회로기판 (PCB) 그라운드(예: 도 16의 1680-G), 그라운드 부재(예: 도 16의 1630) 및 도전성 부재에 전기적으로연결된 상태일 수 있다. 제 2 상태에서 제 1 도전성 부재(1810-1) 및/또는 제 2 도전성 부재(1810-2)는, 인쇄회 로기판(PCB) 그라운드(예: 도 16의 1680-G) 및 그라운드 부재(예: 도 16의 1630)과 함께 안테나 그라운드로 사 용될 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 전자 장치에 사용자가 근접했는지 여부에 적어도 일부 기초 하여, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 16의 인쇄회 로기판(PCB) 그라운드 1680-G)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 안테나 방사체의 수신 감도를 모니터링하고, 모니터링된 수 신 감도에 적어도 일부 기초하여, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운 드 부재(예: 도 16의 인쇄회로기판(PCB) 그라운드 1680-G)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적 으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 제어 회로는 사용자 입력에 적어도 일부 기초하여, 도전성 부재가 전기 적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 16의 인쇄회로기판(PCB) 그라운드 1680-G)에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재는 안테나 방사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수도 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(예: 도 16의 1680-G)에 전기적으로 연결되는 도전성 부재는 안테나 방사체(예: 도 16의 1620)를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 인쇄회로기판(PCB) 그라운드(예: 도 16의 1680-G)에 전기적으로 연결되는 도전성 부재는 전자 장치로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수도 있다. 본 발명의 일 실시 예에 따르면, 전자 장치는, 제 1 면 및 상기 제 1 면과 반대 방향으로 향하는 제 2 면을 포 함하는 하우징과, 상기 하우징의 제 1 면을 통하여 노출된 디스플레이와, 상기 제 1 면 및 상기 제 2 면 사이에 배치된 그라운드 부재와, 상기 하우징의 내부 및/또는 상기 하우징의 일부에 적어도 일부 배치된 안테나 방사체 와, 상기 안테나 방사체와 전기적으로 연결된 통신 회로와, 상기 하우징의 내부에 배치되거나, 상기 하우징의 제 2 면의 일부를 형성하는 도전성 부재(conductive member), 및 상기 그라운드 부재 및 상기 도전성 부재와 전 기적으로 연결된 제어 회로를 포함할 수 있다. 여기서, 상기 제어 회로는, 상기 안테나 방사체와 상기 통신 회 로가 전기적으로 연결될 때, 상기 도전성 부재를 상기 그라운드 부재에 선택적으로 연결하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 제어 회로는 상기 안테나 방사체가 상기 그라운드 부재에 전기적으로 연 결되지만, 상기 도전성 부재에 전기적으로 연결되지 않는 제 1 상태, 또는 상기 안테나 방사체가 상기 그라운드 부재 및 상기 도전성 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 제어 회로는, 상기 전자 장치에 사용자가 근접했는지 여부에 적어도 일부 기초하여, 상기 제 1 상태 또는 제 2 상태 중 하나를 선택적으로 제공하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 제어 회로는 상기 안테나 방사체의 수신 감도를 모니터링하고, 상기 모니 터링된 수신 감도에 적어도 일부 기초하여, 상기 제 1 상태 또는 제 2 상태 중 하나를 선택적으로 제공하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 전자 장치는 상기 전자 장치에 사용자가 근접했는지 여부를 나타내는 신 호를 발생하는 센서를 더 포함하고, 상기 제어 회로는 상기 센서로부터의 신호에 적어도 일부 기초하여, 상기 제 1 상태 또는 제 2 상태 중 하나를 선택적으로 제공하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 전자 장치는 유저 인터페이스를 더 포함하고, 상기 제어 회로는 상기 유 저 인터페이스를 통하여 수신된 사용자 입력에 적어도 일부 기초하여 상기 제 1 상태 또는 제 2 상태 중 하나를 선택적으로 제공하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 전자 장치는 무선 충전 회로를 더 포함하고, 상기 제어 회로는 상기 제 1 상태에서 상기 무선 충전 회로 및 상기 도전성 부재를 전기적으로 연결하고, 상기 도전성 부재 및 상기 무선 충전 회로를 이용하여, 외부로부터 무선으로 전력을 수신할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 통신 회로는 근거리 통신 회로를 포함하고, 상기 제어 회로는 상기 제 1 상태에서, 상기 근거리 통신 회로 및 상기 도전성 부재를 전기적으로 연결하고, 외부 장치와 상기 근거리 통신 회로를 이용하여 통신을 수행할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 통신 회로는 마그네틱 신호에 기반한 통신 회로를 포함하고, 상기 제 1 상태에서 상기 마그네틱 신호에 기반한 통신 회로 및 상기 도전성 부재를 전기적으로 연결하고,상기 제어 회로 는 외부 장치와 상기 마그네틱 신호에 기반한 통신 회로를 이용하여 통신을 수행할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 도전성 부재는 금속 플레이트, 코일형 금속 패턴, 또는 환형 금속 부재 중 적어도 하나를 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 안테나 방사체는 상기 디스플레이를 적어도 일부 둘러싸는 형상을 가질 수 있다. 본 발명의 일 실시 예에 따르면, 상기 도전성 부재는 제 1 단부 및 제 2 단부를 포함하는 도전성 패턴을 포함하 며, 상기 제어 회로는 상기 도전성 부재 상의 제 1 단부 및 제 2 단부를 상기 그라운드 부재에 선택적으로 전기 적으로 연결하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 도전성 부재는 제 1 단부 및 제 2 단부를 포함하는 도전성 패턴을 포함하 며, 상기 제어 회로는 상기 도전성 부재가 상기 그라운드 부재에 연결되지 않은 상태에서 상기 제 1 단부 및 제 2 단부를 전기적으로 연결하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 전자 장치는 상기 하우징에 부착되고, 사용자의 신체의 일부에 탈착 가능 하도록 구성된 결착구를 더 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 전자 장치는 인쇄회로기판(PCB)를 더 포함하고, 상기 그라운드 부재는 상 기 PCB의 일부일 수 있다. 본 발명의 일 실시 예에 따르면, 상기 디스플레이는 OLED 디스플레이를 포함하며, 상기 OLED 디스플레이는 플렉 서블 인쇄회로기판(FPCB)를 포함하고, 상기 FPCB는 상기 그라운드 부재를 포함하는 구조에 연결되는 부분을 포 함할 수 있다. 도 19는 본 발명의 일 실시 예에 따른 전자 장치의 동작 절차의 순서도이다. 도 19의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠다. 도 19를 참조하면, 1901 동작에서 안테나 방사체와 통신 회로가 전기적으로 연결될 수 있다. 1903 동작에서, 제어 회로는 도전성 부재를 그라운드 부재에 선택적으로 연결할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재가 다양한 형태의 통신을 지원하고, 도전성 부재가 지원 하는 통신이 비활성화 상태로 설정된 경우, 제어 회로는 도전성 부재가 통신 회로에 전기적으로 연결 되지 않고, 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상 태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는 서로 다른 통신들을 지원하는 다수 개의 안테나 방사 체들을 포함할 수 있다. 예를 들어, 도전성 부재는 제 1 통신용 안테나 방사체(예: 근거리 통신용 안테나 방사체) 및 제 2 통신용 안테나 방사체(예: 마그네틱 신호 송수신용 안테나 방사체)를 포함할 수 있다. 여기서, 제 1 통신 및 제 2 통신은 사용자 입력에 의해 활성화 상태 또는 비활성화 상태로 설정될 수 있다. 제 1 통신 및 제 2 통신이 모두 활성화 상태로 설정되는 경우, 제어 회로는 제 1 통신용 안테나 방사체 및 제 2 통신 용 안테나 방사체가 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 제 1 통신 및 제 2 통신이 모두 비활성화 상태로 설정되는 경우, 제어 회로는 제 1 통신용 안테나 방사체 및 제 2 통신용 안테나 방사체가 통신 회로에 전기적으로 연결되지 않도록 조정할 수 있다. 제 1 통신 및 제 2 통신이 모두 비활성화 상태 로 설정되는 경우, 제어 회로는 제 1 통신용 안테나 방사체 및 제 2 통신용 안테나 방사체 중 적어도 하나 가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하 나를 선택적으로 제공할 수 있다. 예를 들어, 제 1 통신이 활성화 상태로 설정되고, 제 2 통신이 비활성화 상태로 설정되는 경우, 프로세서(480- 1)는 도전성 부재의 제 1 통신용 안테나 방사체가 통신 회로에 전기적으로 연결되도록 스위치(480- 2)를 제어할 수 있다. 프로세서(480-1)는 도전성 부재의 제 2 통신용 안테나 방사체가 통신 회로에 전기적으로 연결되지 않고, 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적 으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재는, 예를 들면, 무선 충전용 제 1 안테나 방사체 및 근거 리 통신용 제 2 안테나 방사체를 포함할 수 있다. 여기서, 무선 충전 및 근거리 통신은, 사용자 입력에 의해 활 성화 상태 또는 비활성화 상태로 설정될 수 있다. 무선 충전 및 근거리 통신이 모두 활성화 상태로 설정되는 경 우, 제어 회로는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되고, 근거리 통신용 제 2 안테나 방사체가 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 무선 충전 및 근거리 통신이 모두 비활성화 상태로 설정되는 경우, 제어 회로는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되지 않고, 근거리 통신용 제 2 안테나 방사체가 통신 회로에 전기적으로 되 지 않도록 조정할 수 있다. 무선 충전 및 근거리 통신이 모두 비활성화 상태로 설정되는 경우, 제어 회로 는 무선 충전용 제 1 안테나 방사체 및 근거리 통신용 제 2 안테나 방사체 중 적어도 하나가 전기적 플로팅 상 태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태를 선택적으로 제공할 수 있다. 예를 들어, 무선 충전이 활성화 상태로 설정되고, 근거리 통신이 비활성화 상태로 설정되는 경우, 제어 회로 는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되고, 근거리 통신용 제 2 안테나 방사체가 통신 회로에 전기적으로 연결되지 않도록 조정할 수 있다. 제어 회로는 근거리 통신용 제 2 안테 나 방사체가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어, 무선 충전이 비활성화 상태로 설정되고, 근거리 통신이 활성화 상태로 설정되는 경우, 제어 회로 는 무선 충전용 제 1 안테나 방사체가 무선 충전 회로에 전기적으로 연결되지 않고, 근거리 통신용 제 2 안테나 방사체가 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 제어 회로는 무선 충전용 제 1 안테 나가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재가 다양한 형태의 통신을 지원하지 않는 것으로 구성된 경우, 제어 회로는 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재 에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태는, 안테나 방사 체가 그라운드 부재(예 : 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결된 상태일 수 있다. 제 1 상태에서 도전성 부재는 안테나 그라운드로 사용되지 않고, 그라운드 부재(예 : 인쇄 회로기판(PCB) 그라운드)는 안테나 그라운드로 사용될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재가 그라운드 부재에 전기적으로 연결되는 제 2 상태는, 안테나 방사체가 그라운드 부재 및 도전성 부재에 전기적으로 연결된 상태일 수 있다. 제 2 상 태에서 도전성 부재는, 그라운드 부재과 함께 안테나 그라운드로 사용될 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재는 전자 장치로부터 발 생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 본 발명의 다양한 실시 예에 따르면, 전기적 플로팅 상태에 있는 도전성 부재는 안테나 방사체를 이 용하는 안테나 장치의 안테나 성능 유지를 지원할 수도 있다. 본 발명의 다양한 실시 예에 따르면, 그라운드 부재(430에 전기적으로 연결되는 도전성 부재는 안테나 방 사체를 이용하는 안테나 장치의 안테나 성능 유지를 지원할 수 있다. 본 발명의 다양한 실시 예에 따르면, 그라운드 부재에 전기적으로 연결되는 도전성 부재는 전자 장치 로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수도 있다. 도 20은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 19의 1903 동작 절차의 순서도이다. 도 20의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠다. 여기서, 도전성 부재 는 통신을 지원하지 않는 금속 부재일 수 있다.도 20을 참조하면, 2001 동작에서 전자 장치에 사용자가 근접하는 경우, 제어 회로는 이를 감지하고 2003 동작을 수행할 수 있다. 예를 들어, 전자 장치는 상기 전자 장치에 사용자 근접했는지 여부를 나타내는 신호를 발생하는 센서(예: 심박 센서, 온도 센서, 가속도 센서, 자이로 센서 또는 근접 센서 등)를 더 포함할 수 있다. 제어 회로는 센서로부터의 신호에 대응하여 전자 장치에 사용자가 근접했음을 확인 할 수 있다. 2003 동작에서, 제어 회로는 도전성 부재가 전기적 플로팅 상태로 구성되도록 조정할 수 있다. 2001 동작에서 전자 장치에 사용자가 근접하지 않음이 감지되는 경우, 제어 회로는 이를 감지하고 2005 동작을 수행할 수 있다. 2005 동작에서, 제어 회로는 도전성 부재가 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라 운드(580-G))에 전기적으로 연결되도록 조정할 수 있다. 도 21은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 19의 1903 동작 절차의 순서도이다. 도 21의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠다. 여기서, 도전성 부재 는 통신을 지원하지 않는 금속 부재일 수 있다. 2101 동작에서, 제어 회로는 안테나 방사체의 수신 감도를 측정할 수 있다. 2103 동작에서, 제어 회로는 수신 감도를 기초로 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어, 안테나 방사체의 수신 감도가 기준 이하인 경우, 제어 회로는 도전성 부재가 그라운 드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 도 22는 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작에 대한 순서도이다. 도 22의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠다. 여기서, 도전성 부재는 통신을 지원하지 않는 금속 부재일 수 있다. 도 22를 참조하면, 2201 동작에서, 제어 회로는 사용자 입력을 감지할 수 있다. 예를 들어, 전자 장치 는 유저 인터페이스를 더 포함하고, 제어 회로는 유저 인터페이스를 통하여 발생된 사용자 입력을 감 지할 수 있다. 2203 동작에서, 제어 회로는 사용자 입력을 기초로 도전성 부재를 전기적 플로팅 상태로 구성되도록 조정하거나, 또는 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되도 록 조정할 수 있다. 예를 들어, 전자 장치는 안테나 성능 향상 모드를 제공하고, 사용자 입력에 의해 안테나 성능 향상 모드가 활성화되는 경우, 제어 회로는 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 한 실시 예에 따 르면, 안테나 성능 향상 모드에서 제어 회로는, 전자 장치에 사용자가 근접해 있는지 여부에 따라 적 어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 안테나 성능 향상 모드에서 전자 장치에 사용자가 근접해 있지 않음이 경우, 제어 회로는 적어도 하나의 안테나 방사체가 그라운 드 부재에 전기적으로 연결되는 제 2 상태를 제공할 수 있다. 다른 실시 예에 따르면, 제어 회로는, 상술한 바와 같이, 적어도 하나의 안테나 방사체의 수신 감도를 기초로, 적어도 하나의 도전성 부재 가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수도 있다. 예를 들어, 전자 장치는 SAR 저감 모드를 제공하고, 사용자 입력에 의해 SAR 저감 모드가 활성화되는 경우, 제어 회로는 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또 는 적어도 하나의 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 한 실시 예에 따르면, SAR 저감 모드에서 제어 회로는, 전자 장치에 사용자가 근접해 있는지 여부에 따라 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그 라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. SAR 저감 모드에서 전자 장치에 사용자가 근접해 있음이 감지되는 경우, 제어 회로는 적어도 하나의 도전성 부재가전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 예를 들어, 전자 장치는 착용 모드를 제공하고, 사용자 입력 또는 적어도 하나의 센서로부터 획득된 정보 의 적어도 일부에 기반하여 착용 모드가 활성화되는 경우, 제어 회로는 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 예를 들어착용 모드는, 전자 장치의 손목 착용을 가리키 는 시계 모드, 전자 장치의 목 착용을 가리키는 목걸이 모드 등을 포함할 수 있다. 한 실시 예에 따르면, 착용 모드에서 프로세서(480-1)는 적어도 하나의 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태를 제공할 수 있다. 도 23은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작에 대한 순서도이다. 도 23의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠다. 여기서, 도전성 부재는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하는 안테나 방사체일 수 있다. 도 23을 참조하면, 2301 동작에서, 제어 회로는 도전성 부재가 지원하는 통신이 활성화 상태로 설정 되었는지 여부를 확인할 수 있다. 도전성 부재가 지원하는 통신이 활성화 상태로 설정된 경우, 제어 회로 는 2303 동작을 수행하고, 그렇지 않은 경우 2305 동작을 수행할 수 있다. 2303 동작에서, 제어 회로는 도전성 부재가 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 예를 들어, 도전성 부재가 근거리 통신(예: NFC 통신)을 지원하고, 근거리 통신이 활성화 상태로 설 정된 경우, 제어 회로는 도전성 부재가 근거리 통신을 지원하는 통신 회로에 전기적으로 연결되 도록 조정할 수 있다. 예를 들어, 도전성 부재가 마그네틱 신호 송수신을 지원하고, 마그네틱 신호 송수신 이 활성화 상태로 설정된 경우, 제어 회로는 도전성 부재가 마그네틱 신호 송수신을 지원하는 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 여기서, 제어 회로는 외부로 신호를 전송하거나 외부 로부터 신호를 수신하도록 구성된 도전성 부재 및 통신 회로 간의 제 1 전기적 경로를 제공할 수 있 다. 2305 동작에서, 제어 회로는 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되는 제 2 상태 중 하나를 선택적 으로 제공할 수 있다. 예를 들어, 도전성 부재가 그라운드 부재에 전기적으로 연결되는 경우, 제어 회로는 도전성 부재가 그라운드 부재에 전기적으로 연결되도록 구성된 제 2 전기적 경로를 제공 할 수 있다. 도 24는 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작에 대한 순서도이다. 도 23의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠다. 여기서, 도전성 부재는 무선 충전을 지원할 수 있다. 도 24를 참조하면, 2401 동작에서, 제어 회로는 도전성 부재가 지원하는 무선 충전이 활성화 상태로 설정되었는지 여부를 확인할 수 있다. 도전성 부재가 지원하는 무선 충전이 활성화 상태로 설정된 경우, 제어 회로는 2403 동작을 수행하고, 그렇지 않은 경우 2405 동작을 수행할 수 있다. 2403 동작에서, 제어 회로는 도전성 부재가 무선 충전 회로에 전기적으로 연결되도록 조정할 수 있다. 여기서, 제어 회로는 외부로부터 무선을 전력을 수신하거나 외부로 무선으로 전력을 전송하도록 구 성된 도전성 부재 및 무선 충전 회로 간의 제 3 전기적 경로를 제공할 수 있다. 2405 동작에서, 제어 회로는 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 적어도 하나의 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 도 25는 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 23의 2305 동작 또는 도 24의 2405 동작에 대한 순서도이다. 도 25의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠 다. 도 25를 참조하면, 2501 동작에서 전자 장치에 사용자가 근접하는 경우, 제어 회로는 이를 감지하고 2003 동작을 수행할 수 있다. 2503 동작에서, 제어 회로는 도전성 부재가 전기적 플로팅 상태로 구성되도록 조정할 수 있다. 2501 동작에서 전자 장치에 사용자가 근접하지 않음이 감지되는 경우, 제어 회로는 이를 감지하고 2005 동작을 수행할 수 있다. 2505 동작에서, 제어 회로는 도전성 부재가 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라 운드(580-G))에 전기적으로 연결되도록 조정할 수 있다. 도 26은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 23의 2305 동작 또는 도 24의 2405 동작에 대한 순서도이다. 도 26의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠 다. 2601 동작에서, 제어 회로는 안테나 방사체의 수신 감도를 측정할 수 있다. 2603 동작에서, 제어 회로는 수신 감도를 기초로 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공할 수 있다. 도 27은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 23의 2305 동작 또는 도 24의 2405 동작에 대한 순서도이다. 도 27의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠 다. 도 27을 참조하면, 2701 동작에서, 제어 회로는 사용자 입력을 감지할 수 있다. 예를 들어, 전자 장치 는 유저 인터페이스를 더 포함하고, 제어 회로는 유저 인터페이스를 통하여 발생된 사용자 입력을 감 지할 수 있다. 2703 동작에서, 제어 회로는 사용자 입력을 기초로 도전성 부재를 전기적 플로팅 상태로 구성되도록 조정하거나, 또는 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되도 록 조정할 수 있다. 도 28은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작에 대한 순서도이다. 도 28의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠다. 여기서, 도전성 부재는 제 1 통신(예: 근거리 통신)을 지원하는 제 1 도전성 부재 및 제 1 통신과는 다른 제 2 통신(예: 마그네틱 신호 송수신)을 지원하는 제 2 도전성 부재를 포함할 수 있다. 2801 동작에서, 제어 회로는 도전성 부재의 제 1 도전성 부재가 지원하는 제 1 통신이 활성화 상태로 설정되었는지 여부를 확인할 수 있다. 도전성 부재의 제 1 도전성 부재가 지원하는 제 1 통신이 활성화 상 태로 설정된 경우, 제어 회로는 2803 동작을 수행하고, 그렇지 않은 경우 2805 동작을 수행할 수 있다. 2803 동작에서, 제어 회로는 도전성 부재의 제 1 도전성 부재가 통신 회로에 전기적으로 연결되 도록 조정할 수 있다. 예를 들어, 도전성 부재의 제 1 도전성 부재가 근거리 통신(예: NFC 통신)을 지원하 고, 근거리 통신이 활성화 상태로 설정된 경우, 제어 회로는 도전성 부재의 제 1 도전성 부재가 근거 리 통신을 지원하는 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 2805 동작에서, 제어 회로는 도전성 부재의 제 1 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되는 제 2 상 태 중 하나를 선택적으로 제공할 수 있다. 2807 동작에서, 제어 회로는 도전성 부재의 제 2 도전성 부재가 지원하는 제 2 통신이 활성화 상태로 설정되었는지 여부를 확인할 수 있다. 도전성 부재의 제 2 도전성 부재가 지원하는 제 2 통신이 활성화 상 태로 설정된 경우, 제어 회로는 2809 동작을 수행하고, 그렇지 않은 경우 2811 동작을 수행할 수 있다. 2809 동작에서, 제어 회로는 도전성 부재의 제 2 도전성 부재가 통신 회로에 전기적으로 연결되 도록 조정할 수 있다. 예를 들어, 도전성 부재의 제 2 도전성 부재가 마그네틱 신호 송수신을 지원하고, 마그네틱 신호 송수신이 활성화 상태로 설정된 경우, 제어 회로는 도전성 부재의 제 2 도전성 부재가 마그네틱 신호 송수신을 지원하는 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 2811 동작에서, 제어 회로는 도전성 부재의 제 2 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되는 제 2 상 태 중 하나를 선택적으로 제공할 수 있다.본 발명의 다양한 실시 예에 따르면, 2805 동작 및/또는 2811 동작은, 상술한 도 25 내지 27 중 적어도 하나의 동작 절차를 통해 수행될 수 있다. 도 29는 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작에 대한 순서도이다. 도 28의 동작 절차는 앞서 상술한 도 4를 참조하여 설명하겠다. 여기서, 도전성 부재는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신)을 지원하는 제 1 도전성 부재 및 무선 충전을 지원하는 제 2 도전성 부재를 포함할 수 있다. 2901 동작에서, 제어 회로는 도전성 부재의 제 1 도전성 부재가 지원하는 통신이 활성화 상태로 설정 되었는지 여부를 확인할 수 있다. 도전성 부재의 제 1 도전성 부재가 지원하는 통신이 활성화 상태로 설정 된 경우, 제어 회로는 2903 동작을 수행하고, 그렇지 않은 경우 2905 동작을 수행할 수 있다. 2903 동작에서, 제어 회로는 도전성 부재의 제 1 도전성 부재가 통신 회로에 전기적으로 연결되 도록 조정할 수 있다. 예를 들어, 도전성 부재의 제 1 도전성 부재가 근거리 통신(예: NFC 통신)을 지원하 고, 근거리 통신이 활성화 상태로 설정된 경우, 제어 회로는 도전성 부재의 제 1 도전성 부재가 근거 리 통신을 지원하는 통신 회로에 전기적으로 연결되도록 조정할 수 있다. 예를 들어, 도전성 부재의 제 1 도전성 부재가 마그네틱 신호 송수신을 지원하고, 마그네틱 신호 송수신이 활성화 상태로 설정된 경우, 제 어 회로는 도전성 부재의 제 1 도전성 부재가 마그네틱 신호 송수신을 지원하는 통신 회로에 전 기적으로 연결되도록 조정할 수 있다. 2905 동작에서, 제어 회로는 도전성 부재의 제 1 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되는 제 2 상 태 중 하나를 선택적으로 제공할 수 있다. 2907 동작에서, 제어 회로는 도전성 부재의 제 2 도전성 부재가 지원하는 무선 충전이 활성화 상태로 설정되었는지 여부를 확인할 수 있다. 도전성 부재의 제 2 도전성 부재가 지원하는 무선 충전이 활성화 상 태로 설정된 경우, 제어 회로는 2909 동작을 수행하고, 그렇지 않은 경우 2911 동작을 수행할 수 있다. 2909 동작에서, 제어 회로는 도전성 부재의 제 2 도전성 부재가 무선 충전 회로에 전기적으로 연결되도록 조정할 수 있다. 2911 동작에서, 제어 회로는 도전성 부재의 제 2 도전성 부재가 전기적 플로팅 상태로 구성되는 제 1 상태 또는 그라운드 부재(예: 도 6의 인쇄회로기판(PCB) 그라운드(580-G))에 전기적으로 연결되는 제 2 상 태 중 하나를 선택적으로 제공할 수 있다. 본 발명의 다양한 실시 예에 따르면, 2905 동작 및/또는 2911 동작은, 상술한 도 25 내지 27 중 적어도 하나의 동작 절차를 통해 수행될 수 있다. 도 30은 본 발명의 다양한 실시 예에 따른 도전성 부재의 사용 유무에 따른 인체 영향을 도시한다. 도 30의 (A)를 참조하면, 전자 장치(3000-1)는 디스플레이(3090-1), 안테나 방사체(3020-1) 및 인쇄회로기판 (PCB)(3080-1)을 포함할 수 있다. 인쇄회로기판(PCB)(3080-1)은 급전부(미도시) 및 인쇄회로기판(PCB) 그라운드 (3080-1G)를 포함할 수 있다. 안테나 방사체(3020-1)는 인쇄회로기판(PCB)(3080-1)의 급전부 및 인쇄회로기판 (PCB) 그라운드(3080-1G)에 전기적으로 연결될 수 있다. 여기서, 전자 장치(3000-1)는 도전성 부재(예: 도 4의 도전성 부재 410)를 포함하지 않을 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치(3000-1)에 사용자가 근접한 경우, 안테나 방사체(3020-1)로부터 발 생된 전자파는 사용자 신체에 영향을 줄 수 있다. 예를 들어 사용자 신체의 영향에 따른 안테나 방사 성능이 저 하 될 수 있다. 도 30의 (B)를 참조하면, 본 발명의 일 실시 예에 따른 전자 장치(3000-2)는 디스플레이(3090-2), 안테나 방사 체(3020-2), 인쇄회로기판(PCB)(3080-2) 및 도전성 부재(3010-2)를 포함할 수 있다. 인쇄회로기판(PCB)(3080- 1)은 급전부(미도시) 및 인쇄회로기판(PCB) 그라운드(3080-1G)를 포함할 수 있다. 안테나 방사체(3020-1)는 인 쇄회로기판(PCB)(3080-1)의 급전부 및 인쇄회로기판(PCB) 그라운드(3080-1G)에 전기적으로 연결될 수 있다. 여 기서, 인쇄회로기판(PCB) 그라운드(3080-1G)는 안테나 방사체(3020-1)의 공진을 위한 안테나 그라운드로 사용될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재(3010-2)는 전기적 플로팅 상태(예: 도 4의 490)로 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재(3010-2)는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하지 않는 금속 부재일 수 있다. 또는, 도전성 부재(3010-2)는 무선 충전을 지원하지 않는 금속 부재 일 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재(3010-2)는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하는 안테나 방사체일 수 있다. 여기서, 도전성 부재(3010-2)가 지원하는 통신이 비활성화 상태로 설 정된 경우, 도전성 부재(3010-2)는 해당 통신 회로(예: 도 4의 통신 회로 440)에 전기적으로 연결되지 않고, 전 기적 플로팅 상태로 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재(3010-2)는 무선 충전을 지원하는 무선 충전 코일일 수 있다. 여기서, 도전성 부재(3010-2)가 지원하는 무선 충전이 비활성화 상태로 설정된 경우, 도전성 부재(3010-2)는 무 선 충전 회로(예: 도 4의 무선 충전 회로 450)에 전기적으로 연결되지 않고, 전기적 플로팅 상태로 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치(3000-2)에 사용자가 근접한 경우, 전기적 플로팅 상태의 도전성 부 재(3010-2)는 안테나 방사체(3020-2)로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 예를 들어, 전기적 플로팅 상태로 구성된 도전성 부재(3010-2)는 전자 장치(3000-2)에 관한 SAR를 저감시킬 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치(3000-2)에 사용자가 근접한 경우, 전기적 플로팅 상태의 도전성 부 재(3010-2)는 안테나 방사체(3020-2)의 안테나 방사 성능 유지를 지원할 수 있다. 예를 들어, 전자 장치(3000- 2)는 웨어러블 전자 장치이고, 전자 장치(3000-2)는 전자 장치(3000-2)가 사용자 신체에 착용된 상태에서 원하 는 안테나 방사 성능을 가지도록 설계될 수 있다. 한 실시 예에 따르면, 전자 장치(3000-2)가 사용자 신체에 착 용된 상태인 경우, 도전성 부재(3010-2)는 전기적 플로팅 상태로 구성되어 안테나 방사 성능 유지를 지원할 수 있다. 또는, 전기적 플로팅 상태의 도전성 부재(3010-2)는 전자파 인체 영향을 개선할 수 있다. 도 30의 (C)를 참조하면, 본 발명의 일 실시 예에 따른 전자 장치(3000-3)는 디스플레이(3090-3), 안테나 방사 체(3020-3), 인쇄회로기판(PCB)(3080-3) 및 도전성 부재(3010-3)를 포함할 수 있다. 인쇄회로기판(PCB)(3080- 3)은 급전부(미도시) 및 인쇄회로기판(PCB) 그라운드(3080-3G)를 포함할 수 있다. 안테나 방사체(3020-3)는 인 쇄회로기판(PCB)(3080-3)의 급전부 및 인쇄회로기판(PCB) 그라운드(3080-3G)에 전기적으로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재(3010-3)는 인쇄회로기판(PCB) 그라운드(3080-3G)에 전기적으로 연 결될 수 있다. 여기서, 도전성 부재(3010-3)는 인쇄회로기판(PCB) 그라운드(3080-3G)와 함께 안테나 방사체 (3020-3)의 공진을 위한 안테나 그라운드로 사용될 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재(3010-3)는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하지 않는 금속 부재일 수 있다. 또는, 도전성 부재(3010-3)는 무선 충전을 지원하지 않는 금속 부재 일 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재(3010-3)는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하는 안테나 방사체일 수 있다. 여기서, 도전성 부재(3010-3)가 지원하는 통신이 비활성화 상태로 설 정된 경우, 도전성 부재(3010-3)는 해당 통신 회로(예: 도 4의 통신 회로 440)에 전기적으로 연결되지 않고, 인 쇄회로기판(PCB) 그라운드(3080-3G)에 전기적으로 연결될 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재(3010-3)는 무선 충전을 지원하는 무선 충전 코일일 수 있다. 여기서, 도전성 부재(3010-3)가 지원하는 무선 충전이 비활성화 상태로 설정된 경우, 도전성 부재(3010-3)는 무 선 충전 회로(예: 도 4의 무선 충전 회로 450)에 전기적으로 연결되지 않고, 인쇄회로기판(PCB) 그라운드(3080- 3G)에 전기적으로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치(3000-3)에 사용자가 근접한 경우, 인쇄회로기판(PCB) 그라운드 (3080-3G)에 전기적으로 연결된 도전성 부재(3010-3)는 안테나 방사체(3020-3)로부터 발생된 전자파가 사용자 신체에 미치는 영향을 줄일 수 있다. 예를 들어 사용자 신체에 근접하여 발생한 안테나 방사 성능의 저하를 줄 일 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치(3000-3)에 사용자가 근접한 상태인 경우, 전기적 플로팅 상태의 도 전성 부재(3010-3)는 안테나 방사체(3020-3)의 안테나 방사 성능 유지를 지원할 수 있다. 예를 들면, 도 30의 (B)를 참조하여 상술한 바와 같이, 전자 장치(3000-2)는 웨어러블 전자 장치이고, 전자 장치(3000-2)는 사용자신체에 착용된 상태에서 원하는 안테나 방사 성능을 가지도록 설계될 수 있다. 전자 장치(3000-2)가 사용자 신 체에 착용되지 않은 상태로 변경되면, 전자 장치(3000-2)로부터 전위체인 사용자 신체가 멀어지게 되고, 안테나 방사체(3020-2)의 전기적 길이가 짧아져 상대적으로 높은 공진 주파수를 가지게 되고, 이는 안테나 장치의 성능 열화의 요인이 될 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치(3000-3)가 사용자 신체에 착용되지 않은 상태인 경우, 도전성 부재(3010-3)는 인쇄회로기판(PCB) 그라운드(3080-3G)에 전기적으로 연결되고, 상술 한 안테나 방사 성능의 열화를 줄일 수 있다. 다양한 실시 예에 따르면 전자 장치(3000-3)를 사용자 신체에 착 용하지 않은 상태이더라도, 안테나 성능은 유지될 수 있다. 도 31은 본 발명의 다양한 실시 예에 따른 도전성 부재를 이용하여 안테나 성능을 유지시키는 것에 대하여 설명 하기 위한 도면이다. 도 31의 (A) 및 (B)를 참조하면, 본 발명의 일 실시 예에 따른 전자 장치(3100-11)는 디스플레이(3190-11), 안 테나 방사체(3120-11), 인쇄회로기판(PCB)(3180-11) 및 도전성 부재(3110-11)를 포함할 수 있다. 인쇄회로기판 (PCB)(3180-11)은 급전부(미도시) 및 인쇄회로기판(PCB) 그라운드(3180-11G)를 포함할 수 있다. 안테나 방사체 (3120-11)는 인쇄회로기판(PCB)(3180-11)의 급전부 및 인쇄회로기판(PCB) 그라운드(3180-11G)에 전기적으로 연 결될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재(3110-11)는 전기적 플로팅 상태로 구성될 수 있다. 여기서, 도전 성 부재(3110-11)는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하지 않는 금속 부재일 수 있 다. 또는, 도전성 부재(3110-11)는 무선 충전을 지원하지 않는 금속 부재일 수 있다. 본 발명의 다른 실시 예에 따른 전자 장치(3100-12)는 디스플레이(3190-12), 안테나 방사체(3120-12), 인쇄회로 기판(PCB)(3180-12) 및 도전성 부재(3110-12)를 포함할 수 있다. 인쇄회로기판(PCB)(3180-12)은 급전부(미도시) 및 인쇄회로기판(PCB) 그라운드(3180-12G)를 포함할 수 있다. 안테나 방사체(3120-12)는 인쇄회 로기판(PCB)(3180-12)의 급전부 및 인쇄회로기판(PCB) 그라운드(3180-12G)에 전기적으로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재(3110-12)는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하는 안테나 방사체일 수 있다. 예를 들어, 도전성 부재(3110-12)가 지원하는 통신이 비활성화 상태 로 설정된 경우, 도전성 부재(3110-12)는 해당 통신 회로(예: 도 4의 통신 회로 440)에 전기적으로 연결되지 않 고, 전기적 플로팅 상태로 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재(3110-12)는 무선 충전을 지원하는 무선 충전 코일일 수 있다. 여기서, 도전성 부재(3110-12)가 지원하는 무선 충전이 비활성화 상태로 설정된 경우, 도전성 부재(3110-12)는 무선 충전 회로(예: 도 4의 무선 충전 회로 450)에 전기적으로 연결되지 않고, 전기적 플로팅 상태로 구성될 수 있다. 도 31의 (A)를 참조하면, 전자 장치(3100-11 또는 3100-12)에 사용자가 근접한 상태에서, 도전성 부재(3100-11 또는 3100-12)는 전기적 플로팅 상태로 구성될 수 있다. 예를 들면, 전자 장치(3100-11 또는 3100-12)는 웨어러 블 전자 장치일 수 있다. 전자 장치(3100-11 또는 3100-12)는 전자 장치(3100-11 또는 3100-12)가 사용자 신체 에 착용된 상태에서 원하는 안테나 방사 성능을 가지도록 설계될 수 있고, 이에 도전성 부재(3100-11 또는 3100-12)는 전기적 플로팅 상태로 구성되어 안테나 성능 유지를 지원할 수 있다. 도 31의 (B)를 참조하면, 도전성 부재(3100-11 또는 3100-12)가 전기적 플로팅 상태로 구성된 상태에서, 전자 장치(3100-11 또는 3100-12)에 사용자가 근접하지 않은 상태로 변경되면, 안테나 방사 성능은 저하 될 수 있다. 예를 들면, 상술한 바와 같이, 전자 장치(3100-11 또는 3100-12)에 사용자 신체가 근접된 상태에서는 안테나 방 사 성능 확보를 위하여 도전성 부재(3100-11 또는 3100-12)가 전기적 플로팅 상태로 구성되도록 설계될 수 있다. 도전성 부재(3100-11 또는 3100-12)가 전기적 플로팅 상태로 구성된 상태에서, 전자 장치(3100-11 또는 3100-12)가 사용자에 근접하지 않은 상태로 변경되면, 전자 장치(3100-11 또는 3100-12)로부터 전위체인 사용자 신체가 멀어지게 되고, 이는 안테나 방사 성능을 저하시킬 수 있다. 예를 들어, 도전성 부재(3100-11 또는 3100-12)가 전기적 플로팅 상태로 구성된 상태에서, 전자 장치(3100-11 또는 3100-12)가 사용자에 근접하지 않 은 상태로 변경되면, 주파수 이동이 유발될 수 있다. 도 31의 (C)를 참조하면, 본 발명의 일 실시 예에 따른 전자 장치(3100-21)는 디스플레이(3190-21), 안테나 방 사체(3120-21), 인쇄회로기판(PCB)(3180-21) 및 도전성 부재(3110-21)를 포함할 수 있다. 인쇄회로기판 (PCB)(3180-21)는 급전부(미도시) 및 인쇄회로기판(PCB) 그라운드(3180-21G)를 포함할 수 있다. 안테나 방사체 (3120-21)는 인쇄회로기판(PCB)(3180-21)의 급전부 및 인쇄회로기판(PCB) 그라운드(3180-21G)에 전기적으로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재(3110-21)는 인쇄회로기판(PCB) 그라운드(3180-21G)에 전기적으로 연결될 수 있다. 도전성 부재(3110-21)는 인쇄회로기판(PCB) 그라운드(3180-21G)와 안테나 방사체(3120-21)의 공진을 위한 안테나 그라운드로 사용될 수 있다. 여기서, 도전성 부재(3110-21)는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하지 않는 금속 부재일 수 있다. 또는, 도전성 부재(3110-21)는 무선 충전을 지원하지 않는 금속 부재일 수 있다. 본 발명의 다른 실시 예에 따른 전자 장치(3100-22)는 디스플레이(3190-22), 안테나 방사체(3120-22), 인쇄회로 기판(PCB)(3180-22) 및 도전성 부재(3110-22)를 포함할 수 있다. 인쇄회로기판(PCB)(3180-22)은 급전부(미도시) 및 인쇄회로기판(PCB) 그라운드(3180-22G)를 포함할 수 있다. 안테나 방사체(3120-22)는 인쇄회 로기판(PCB)(3180-22)의 급전부 및 인쇄회로기판(PCB) 그라운드(3180-22G)에 전기적으로 연결될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재(3110-22)는 인쇄회로기판(PCB) 그라운드(3180-22G)에 전기적으로 연결될 수 있다. 도전성 부재(3110-22)는 인쇄회로기판(PCB) 그라운드(3180-22G)와 안테나 방사체(3120-22)의 공진을 위한 안테나 그라운드로 사용될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재(3110-22)는 통신(예: 근거리 통신 또는 마그네틱 신호 송수신 등)을 지원하는 안테나 방사체일 수 있다. 예를 들어, 도전성 부재(3110-22)가 지원하는 통신이 비활성화 상태 로 설정된 경우, 도전성 부재(3110-22)는 해당 통신 회로(예: 도 4의 통신 회로 440)에 전기적으로 연결되지 않 고, 인쇄회로기판(PCB) 그라운드(3180-22G)에 전기적으로 연결되도록 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 도전성 부재(3110-22)는 무선 충전을 지원하는 무선 충전 코일일 수 있다. 여기서, 도전성 부재(3110-22)가 지원하는 무선 충전이 비활성화 상태로 설정된 경우, 도전성 부재(3110-22)는 무선 충전 회로(예: 도 4의 무선 충전 회로 450)에 전기적으로 연결되지 않고, 인쇄회로기판(PCB) 그라운드 (3180-22G)에 전기적으로 연결되도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 도전성 부재(3110-21 또는 3110-22)는 인쇄회로기판(PCB) 그라운드(3180-21G 또는 3180-22G)에 전기적으로 연결되어 추가적인 안테나 그라운드로 사용되고, 안테나 방사체(3120-21 또는 3120-22)의 안테나 방사 성능 유지를 도울 수 있다. 상술한 바와 같이, 도 31의 (B)를 참조하면, 도전성 부재 (3100-11 또는 3100-12)가 전기적 플로팅 상태로 구성된 상태에서, 전자 장치(3100-11 또는 3100-12)에 사용자 가 근접하지 않는 상태로 변경되면, 안테나 방사 성능은 저하 될 수 있다. 다양한 실시 예에 따르면, 전자 장치 (3100-21 또는 3100-22)가 사용자에 근접하지 않는 상태로 변경될 때, 전자 장치(3100-21, 3100-22)는 안테나 성능을 유지하도록 도전성 부재(3110-21 또는 3110-22)를 상기 전기적 플로팅 상태에서 추가적인 안테나 그라운 드로 구성되도록 조정할 수 있다. 본 발명의 일 실시 예에 따르면, 전자 장치의 동작 방법은, 상기 전자장치의 상기 안테나 방사체와 상기 통신 회로를 전기적으로 연결하는 동작 및 상기 전자장치의 상기 도전성 부재를 상기 그라운드 부재에 연결하는 동작 을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은, 상기 안테 나 방사체가 상기 그라운드 부재에 전기적으로 연결되지만, 상기 도전성 부재에 전기적으로 연결되지 않는 제 1 상태, 또는 상기 안테나 방사체가 상기 그라운드 부재 및 상기 도전성 부재에 전기적으로 연결되는 제 2 상태 중 하나를 선택적으로 제공하도록 구성될 수 있다. 본 발명의 일 실시 예에 따르면, 상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은, 상기 전자 장치가 사용자에게 근접했는지를 판단하는 동작 및 상기 판단에 기초하여, 상기 제 1 상태 또는 상기 제 2 상태 중 하나를 선택적으로 제공하는 동작을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은, 상기 전자 장치가 사용자에게 근접했는지를 판단하는 동작 및 상기 판단에 기초하여 상기 제 1 상태 또는 상기 제 2 상태 중 하나를 선택적으로 제공하는 동작을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은, 상기 안테 나 방사체의 수신 감도를 모니터링하는 동작 및 상기 모니터링된 수신 감도에 적어도 일부 기초하여, 상기 제 1 상태 또느 상기 제 2 상태 중 하나를 선택적으로 제공하는 동작을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 도전성 부재를 그라운드 부재에 선택적으로 연결하는 동작은, 사용자 입 력을 수신하는 동작 및 상기 사용자 입력을 기초하여, 상기 제 1 상태 또는 상기 제 2 상태 중 하나를 선택적으 로 제공하는 동작을 포함할 수 있다. 본 발명의 일 실시 예에 따르면, 상기 전자 장치의 동작 방법은, 제 1 상태에서 상기 도전성 부재를 적어도 일 부 포함하고 외부로 신호를 전송하거나 외부로부터 신호를 수신하도록 구성된 전기적 경로를 제공하는 동작 및 상기 전기적 경로를 이용하여, 외부로부터 무선으로 전력을 수신하거나, 외부 장치와 근거리 통신을 하거나, 또 는 외부로부터 NFC(Near Field Communication) 통신을 하거나, 또는 외부로 마그네틱 신호 기반의 통신을 하는 동작을 더 포함할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시 예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시 예에 따른 전자 장치의 구성요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시 예들은 본 발명의 실시 예에 따른 의 기술 내용을 쉽게 설명 하고 본 발명의 실시 예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시 예의 범위를 한정 하고자 하는 것은 아니다. 따라서 본 발명의 일 실시 예의 범위는 여기에 개시된 실시 예들 이외에도 본 발명의 일 실시 예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 일 실시 예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2015-0114141", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예들에 따른 전자 장치를 포함하는 네트워크 환경을 도시하는 도면이다. 도 2는 다양한 실시 예에 따른 전자 장치의 블록도이다. 도 3은 다양한 실시 예에 따른 프로그램 모듈의 블록도이다. 도 4는 본 발명의 실시 예에 따른 전자 장치의 구성을 개략적으로 나타낸 도면이다. 도 5 및 6은 본 발명의 다양한 실시 예에 따른 전자 장치의 구성을 도시한다. 도 7은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 8은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 9는 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 10은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 11은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 12는 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 13은 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 14는 본 발명의 다양한 실시 예에 따른 전자 장치의 동작을 설명하기 위한 예시 도이다. 도 15는 본 발명의 일 실시 예에 따른 전자 장치를 도시한다. 도 16 및 도 17은 본 발명의 일 실시 예에 따른 전자 장치를 도시한다. 도 18은 본 발명의 다양한 실시 예에 따른 전자 장치를 도시한다. 도 19는 본 발명의 일 실시 예에 따른 전자 장치의 동작 절차의 순서도이다. 도 20은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 19의 1903 동작 절차의 순서도이다. 도 21은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 19의 1903 동작 절차의 순서도이다. 도 22는 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작 절차의 순서도이다. 도 23은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작 절차의 순서도이다. 도 24는 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작 절차의 순서도이다.도 25는 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 23의 2305 동작 또는 도 24의 2405 동작 절차의 순서도이다. 도 26은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 23의 2305 동작 또는 도 24의 2405 동작 절차의 순서도이다. 도 27은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드 부재에 선택적으로 연결하는 도 23의 2305 동작 또는 도 24의 2405 동작 절차의 순서도이다. 도 28은 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작 절차의 순서도이다. 도 29는 본 발명의 다양한 실시 예에 따른 도전성 부재를 그라운드에 선택적으로 연결하는 도 19의 1903 동작 절차의 순서도이다. 도 30은 본 발명의 다양한 실시 예에 따른 도전성 부재의 사용 유무에 따른 인체 영향을 도시한다. 도 31은 본 발명의 다양한 실시 예에 따른 도전성 부재를 이용하여 안테나 성능을 유지시키는 것에 대하여 설명 하기 위한 도면이다."}
