{"patent_id": "20-2023-0000027", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "20-2023-0000241", "출원번호": "20-2023-0000027", "발명의 명칭": ": 물탱크를 형성한 회풍기제작방법", "출원인": "정삼주", "발명자": "외에는 본 발명 내부와 외부 전면에 자율주행장치, AI인공지능전자장치, 산소발생장치, 산소수"}}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지구대기공기와 건축물실내와 건축시설물 실내의 공해로 오염된 오염공기를 맑고 깨끗하게 정화하는 회풍기제작방법에 있어서 본 발명은 내부5단계 외부 3단계 물탱크 연결장치 2단계, 모두 10단계 적층식, 수평식 구조로 형성하여 완성하는 본 발명 물탱크를 형성한 회풍기제작방법을 발명하여 대기환경 속에 공해로 오염된 오염공기를나라에서 인정하는 음용수와 음용수가 없는 지역에서는 대체정화수로 한정해 오염공기를 정화하고 단수를 대비하여 물탱크를 형성하고 정화수 구조장치를 형성하여 설치지역이나 장소에 따라 이동식과 고정식을 정하여 설치장소에 맞게 회풍기제작방법으로 완성한 물탱크를 형성한 회풍기에서 깨끗한 물을 분출시켜 공해로 오염된 오염공시를 맑고 깨끗하게 정화하는 구성과 장치로 이루어지는 제작방법을 특징으로 하는물탱크를 형성한 회풍기제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서 수조 밑받침 위에 별도의 물유도판을 형성하여 유수식으로 흘러내리는 배수물을 고인물 없이 배수구로 배수하도록 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서 2번 흡입실 원통 전면에 여러가지 모형으로 오염공기 2번 흡입구를 1개 이상 다수를 형성해 흡입할 수 있도록 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서 정화분사실 내부 전면에 설치된 분사틀 물분출조리구에서 분출되는 물에 계속 빨려 들어오는 오염공기가 1차 타격되어 정화하고 다시 물반사판에 부딛쳐 반사하여 분사하는 물이 2차 타격하여 정화되도록 물반사판을 정교하게 형성하여 분출하는 물이 2차 정화를 하도록 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기제작 방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서 물방울차단실 내부전면에 각50°이상각이진 물방울 차단각대 양쪽 끝부분에 원형 배출구를 형성하여 물방울을 막아주도록 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서 정화공기흡입실을 형성하여 정화수로 분사되는 물이나 물방울이 수조로 떨어지고 흘러내려 정화된 공기가 공간에 모여 송풍기흡입력으로 빨려 올라가도록 공기 공간을 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서 송풍기모터실을 정화공기흡입실보다 원형 둘레를 같거나 더 작게 형성하여 정화공기가 배출구로급속히빨려 나가는 것을 천천히 배출되도록 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서 회풍배출기를 형성하여 오염공기가 정화된 정화공기가 1차 정화공기배출구로 적은 량이 저공으로 배출되고 2차 정화배출구조는 많은 량의 정화공기가 360°회풍배출기 내부에 형성된 회풍날에 의해 배출되는정화공기가 회오리바람을 발생시키며 배출하도록 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기 제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서 회풍기집을 형성하여 회풍기집 둘레에 오염공기흡입구를 형성하고 회풍기몸체 6단계에 씌워서공개실용신안 20-2023-0000241-3-밀폐된 공간을 만들어 1차 정화분사실을 형성하고 오염공기를 정화하는 정화분사실을 형성해 흡입구로 빨려 들어오는 오염공기를 정화하도록 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서 이동식 배, 선박선상에 오염공기정화회풍기 및 구매하여 준비된 배수정화조를 구비하여 해상에서나 강 위에서 공조하여 오염공기를 정화하도록 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기 제작방법."}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서 고정식 바지선 선상에 물탱크를 형성한 회풍기 및 구매하여 구비된 배수정화조를 준비하여 고정설치해 강위에서 오염공기를 정화하도록 제작한 것을 특징으로 하는 물탱크를 형성한 회풍기 제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서 물분출조리구를 형성해 정화수(100) (200)을 이용해 오염공기를 정화 할 수 있도록 제작한 것을특징으로 하는 물탱크를 형성한 회풍기 제작방법"}
{"patent_id": "20-2023-0000027", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서 본 발명자 외에는 본 발명 내부와 외부 전면에 자율주행장치, AI인공지능전자장치, 산소발생장치, 산소수십기, 이산화탄소수집기, 기체화합물수집기, 기체화합물배출기, 식물세포분해추출물, 화학적향, 식물향, 각종 소독제, 인체유해독극물를 희석하는 행위나 결합하는 행위나 연결하는 행위를 금지하고 나라에서 인정하는 수질3급수 미만인 물은 어떠한 경우라도 일체 본 발명의 정화수 사용을 금지하는 것을 특징으로 하는 물탱크를 형성한 회풍기 제작방법고안의 설명기 술 분 야본 발명의 물탱크를 형성한 오염공기정화회풍기제작방법은 내부 5단계 외부3단계 본 발명 근접거리에 보조물탱 [0001]크와 물탱크 연결장치 2단계 모두 10단계 적층식과 수평식으로 형성하고 보조물탱크를 한 개이상 형성하여 완성하고 육지에서는 각종 공해로 오염된 대기속에 오염공기를 나라에서 인정하는 음용수를 정화수로 사용해 오염공해를 정화하고 음용수가 없는 지역에서는 대체정화수를 이용해 오염공기를 정화하고 설치지역이나 장소에 따라이동식과 ㄱ정식과 회전식은 본 발명의 설치장소에 따라 선택하여 설치하면 효과가 증가된다. 또한 지금까지는지구에 공해로 오염된 공기를 하늘에서는 비와 눈과 바람으로 오염공기를 정화하고 땅에서는 흙, 돌,바위,강물,, 바다, 식물이 공해를 정화하였다. 본 발명은 깨끗한 물과 회풍력과 기압층을 이용해 오염공기를 정화하고 수돗물단수, 노후관교체, 정전, 절수, 동파, 급수중단, 모터고장등으로 단수시에 보조물탱크에 가득 체워져있는 물탱크의 물을 사용해 오염공기를 정화하는 보조물탱크가 있는 물탱크를 형성한 오염공기 정화 회풍기제작방법을 발명한 것이다.이어서 본 발명으로 공해로 오염된 대기속 오염공기정화와 지상과 지하 건축물 실내, 건축시설물 실내에서 오염 [0002]공기를 정화하고 바다 위를 넘어오는 오염공기는 이동식 배나 선박을이용해 정화하고 고정식 바지선 선상에고정하여 오염공기를 정화하고 이때 오염공기 정화수는 해수(海水)를 정화수로 이용해 정화하고 수질 2급수 이상인강위에서는 강 위를 넘어오는 오염공기를 이동식 배나 고정식 바지선에 물탱크를 형성한 오염공기정화회풍기를설치해서 강물을 정화수로 이용해 오염공기를 정화하고 더 효과적으로는 이동식 배에 본 발명품을 설치해 공해로 오염된 장소로 이동하여 빠른 대응을 하고 오염공기층을 따라 이동하며 맑고 깨끗이 정화하는 것이다. 또한육지에서 도로이동식 정화, 승강기식 이동정화, 도로이동식 정화와 승강기식 이동정화를 하나로 연결하여 하나로 시스템으로 오염공기를 정화하는 방법을 겸하여 사용이 가능하고, 단수시에 정화하는 보조물탱크가 있는 오염공기 정화회풍기 제작방법을 발명한 것이다.배 경 기 술일반적으로 대기공해를 제거하는 방법으로는 공해로 오염된 오염공기(1000)를 줄이기 위해서 저공해 차량을 개 [0003]발하고 황사의 발생근원지에 나무를 심고 노후된 차량을 폐차시키고 공해발생 산업을 줄이고 매연발생이 심한차량에 새금을 더 부과하고 차량 십부제 및 짝수, 홀수 운행을 시행하고 여러 가지 방법과 규제로 환경공해를줄이고자 노력하지만 공해는 더욱 확산되어 가고 있으며 국경을 넘어오는 공해로 오염된 오염공기(1000), 바다공개실용신안 20-2023-0000241-4-를 넘어오는 공해로 오염된 오염공기(1000), 강을 넘어오는 오염공기(1000), 산과 육지를 넘어오는 오염공기(1000)를 줄이려고만 하지 지금 이 순간에도 배출되는 오염공기(1000)를 정화하는 방법을 찾지 못했다. 여기서출원번호 : 10-2018-0091331와 출원번호 : 10-2019-0063625와 출원번호 : 10-2020-0047288과 출원번호 : 10-2021-0031852와 출원번호 : 10-2021-0119499는 본 발명 출원인과 동일인이다. 이때 편의상 본 발명의 명칭을 물탱크를 형성한 회풍기제작방법으로 통칭한다. 더 진보적 기술과 명확한 범위로 물탱크를 형성한 회풍기제작방법(1)을 발명한 것이다. 더욱이 기후변화와 지구위기에 직면한 현재(現在)의 실질적 위기를 극복하기 위해 공해로오염된 오염공기(1000)를 정화하는 내부 5단계 적층식에 외부3단계 적층식과 보조물탱크(31) 연결장치 구조로모두 10단계 적층식과 보조물탱크(13) 2단계의 정교한 구조 배치를 형성하고 이때 보조물탱크(31)는 1개 이상을형성하고 본 발명에 사용하는 정화수(100) (200)는 나라에서 인정하는 음용수(100), 수돗물(100-1), 샘물(100-2), 지하수(100-3), 암반수(100-4)와 음용수(100)가 없는 지역이나 장소에서는 대체정화수(200) : 해수(200-1)염분수(200-2) 수질 2급수 이상인 강물(200-3)을 한정해 정화수(100) (200)로 이용하고 맑은 물로 오염공기(1000)를 정화하는방식이다. 오염공기(1000)가 심한 지역에 정화수(100)(200)가 없을 때는 긴급정화수(200-4)를나라에서 인정하는 수질 3급수 이상인 강물을 한시적으로 정화수로 이용해 오염공기(1000)인 : 황사,,미세먼지, 초미세먼지, 이산화탄소, 자동차배출공해, 산업배출공해, 항공배출공해, 항선배출공해, 농기계배출공해, 지하철배출공해, 산불공해, 화재공해, 분징, 스모그현상, 바이러스, 인체유해세균등을 맑고 깨끗하게 정화하고 정화방식은 물탱크를 형성한 회풍기(1)에 구비된 배전판에 전원을 ON으로 작동하면 송풍기모터(14-1)가 작동되고 고압모터펌프(500)가 작동하고 고압모터펌프(500)의 수압으로 정밀하게 조립형성된 물분출조리구(16)에서 분출하는 분출수(100)(200)로 송풍기의 흡입력으로 오염공기(1000)를 빨아내려서 빨려들어오는 오염공기(1000)를 맑고 깨끗하게 정화해 송풍기의 흡입력과 배출력에 의해 360°회풍력을 발생시켜 회오리바람으로 정화공기(2000)를 배출하여 오염공기(1000)층을 저공으로 밀어내고 파고들어 계속 배출하는 회풍력정화공기(2000)는오염공기(1000)와 희석되어 맑아지고 계속 배출되는 정화공기(2000)층은 계속 확장하여 정화공기(2000)층을 계속 확장해 넓혀가고 오염공기(1000)층은 계속 작아지고 살아져 맑은 정화공기(2000)층이 형성된다. 또한 물탱크를 형성한 회풍기(1) 정한자리에 보조물탱크(31)를 1개이상 자리를 정하여 형성하고 수돗물 단수, 노후관교체,정전, 절수, 동파, 급수중단, 모터고장 등으로 단수시에는 보조물탱크(31)에 가득 체워져 있는 물탱크(31)의 정화수공급관(36) 밸브(600)를 열어 저장된 정화수(100)(200)를 사용 할수 있도록 보조물탱크(31)를 형성하여 오염공기(1000)를 정화할 수 있는 특징이 있다. 이때 물탱크 벨브를 열기전에 물탱크를 형성한 회풍기(1)로 들어오는 정화수관 벨브는 잠금으로 한다. 이어서 오염공기(1000)를 정화한 정화수 (100)9200)는 유수식(3000)으로정화한 물은 1단계 수조(4)에서 배수구(8)로 배출한다. 이어서 본 발명은 공해로 오염된 오염공기(1000)를 정화하는데 정화력이 빠른 물탱크를 형성한 회풍기제작방법(1)을 발명하게 된 것이다.선행기술문헌특허문헌(특허문헌 0001) 국내특허 특허문헌 KR : 공개번호 10-118546 [0004](특허문헌 0002) 특허문헌 KR : 공개번호 20-0248234 비특허문헌(비특허문헌 0001) 국내문헌 비특허문헌 KR : 공개번호 10-2018-001221 [0005](비특허문헌 0002) 비특허문헌 KR : 공개번호 특 2003-008606 고안의 내용해결하려는 과제본 발명의 재질은 철, 비철재질, 수지물재질로 제작하고 더 자세하게는 철대, H빔철재, 철판, 스텐철판, 스텐각 [0006]대, 스텐파이프, 스텐밸브, 아연재질, 알미늄재질, 스텐재질, 수지물재질, 철재수지혼용재질,비철수지혼용재질, F.R.P 티타늄재질로 제작하고 완성된다. 이때 보조물탱크(31)의 물탱크통은 설치장소에 따라구매하여 설치장소용량에 맞게 정화수보충관(33)과 정화수공급관(36)를 정한규격 길이대로 절단 제작하여 쇼켓공개실용신안 20-2023-0000241-5-(35)으로 연결 조립하여 물탱크(31)를 형성한다. 이어서 일반적으로 대기공해를 제거하는 방법으로는 공해로 오염된 오염공기(1000)를 줄이기 위해서 저공해 차량을 개발하고 황사의 발생근원지에 나무를 심고 노후된 차량을폐차시키고 공해발생 산업에 탄소발생을 줄이고 매연발생이 심한 차량에는 과태료, 세금을 더 부과하고 차량십무제 및 짝수 홀수 운행을 시행하는 것과 법률적 규제가 동원되고 있다. 다시 이어서 여러 가지 방법과 규제로환경공해를 줄이고자 노력하지만 공해는 더욱 확산되어 가고 있으며 국경을 넘어오는 공해로 오염된 오염공기(1000)는 황사, 미세먼지, 초미세먼지, 이산화탕소, 자돛아배출공해, 산업배출공해, 항고배출공해, 항선배출공해, 농기계배출공해, 지하철배출공해, 산불공해, 화재공해, 분진, 스모그현상, 바이러스, 인체유해세균 등을 정화해야 하나 정화방법이 없었다. 종래의 기술은 건물 내에서 공기를 정화는 필터방식, 습식방식 공기정화기, 공기청정기 필터식으로 정화하는 것으로 효과는 미미한 것이다.또한 바다를 넘어오는 공해로 오염된 오염공기, 강을 넘어오는 공해로 오염된 오염공기, 산과 육지를 넘어오는 [0007]오염공기 국경을 넘어오는 오염공기로 지구는 기후변화와 지구위기라는 현실에 직면하는 문제점이 발생된 것이다.과제의 해결 수단본 말명은 직면한 현대사회의 기후변화 지구위기의 원인이 된 공해로 오염된 오염공기(1000)를 육지에서 바다에 [0008]서 강에서 건축물 실내에서 지하건축물 실내와 대형건물 실내, 지하철역 내, 백화점 내, 병원내, 실내체육시설내, 터널내, 지하상가 내, 학교 교내, 군사훈련소 내, 대합실 내, 체육시설 경기자 내에 뿐 아니라 지구대기속에 오염공기(1000)가 발생한 지역에서 공해로 오염된 오염공기(1000)를 맑고 깨끗하게 정화하는 내부 5단계 외부 3단계 보조물탱크(31)와 보조물탱크연결장치 2단계로 구성되어 적층식 구조로 이루어지고 여기에 정화수(100)(200)단수, 고장등으로 정화수가 끈길때도 가동할수 있는 보조물탱크(31)를 형성하여 완성되는 물탱크를형성한 회풍기제작방법(1)를 발명하였다. 물탱크를 형성한 회풍기(1)에 사용되는 오염공기(1000) 정화수는 나라에서 인정하는 음용수(100)인 : 수돗물(100-1), 샘물(100-2), 지하수(100-3) 암반수(100-4)와 음용수(100)가없는 지역이나 장소에서는 대체정화수(200)인 : 해수(海水)(200-1), 염분수(200-2), 수질 2급수 이상인 강물(200-3)과 긴급정화수로 나라에서 인정하는 수질 3급이상인 강물(200-4)을 본 발명의 정화수로 한정하고 본 발명으로 정화하는 공해로 오염된 오염공기(1000)는 황사, 미세먼지, 초미세먼지, 이산화탄소, 자동차배출공해,산업배출공해, 항공배출공해, 항선배출공해, 농기계배출공해, 지하철배출공해, 산불공해, 화재공해, 분진, 스모그현상, 악취, 거북한 냄새, 바이러스, 인체유해세균 등을 맑고 깨끗하게 정화하는 것이다.다시 본 발명품은 고정식과 도로이동정화식과 승강기 이동식으로 사용할수 있고, 오염공기(1000)를 정화하는 방 [0009]법에 따라 정한 지역이나 장소에서 오염공기(1000)를 정화하고 바다를 넘어오는 공해로 오염된 오염공기(1000)는 이동식 배나 선박을 사용하여 선상 정한 위치에 고정하여 해수(200-1)를 정화수로 이용해 정화하고 고정식바지선 선상에 정한 위치에 고정하여 해수(海水)(200-1)를 정화수로 이용해 오염공기(1000)를 정화하고 수질 2급수 이상인 강물(200-3) 위에서 이동식 배 선상에 물탱크를 형성한 회풍기(1)를 정한 위치에 고정하여 이동하며 강물(200-3)을 정화수로 이용해 오염공기(1000)를 정화하고 고정식 바지선 선상에 고정하여 강물(200-3)를정화수로 이용해 정화하도록 물탱크를 형성한 회풍기(1)를 비철재질을 사용해 제작하고 수질물질을 사용해 제작하여 부식과 녹스는 것을 방지하는 물탱크를 형성한 회풍기제작방법(1-1)을 발명한 것이 특징이 있다.고안의 효과본 발명의 오염공기정화회풍기(1)의 효과는 대기 속 오염공기(1000)인 : 황사, 미세먼지, 초미세먼지, 자동차배 [0010]출공해, 산업배출공해, 항공배출공해, 항선배출공해, 농기계배출공해, 지하철배출공해, 분진, 이산화탄소, 산불공해, 화재공해, 스모그현상, 악취, 거북한 냄새, 바이러스, 인체유해세균 등을 맑고 깨끗하게 정화한다. 이어서 본 발명에 한정해 사용할 수 있는 정화수를 이용해 오염된 오염공기(1000)를 맑고 깨끗하게 정화하여 사람과자연에 정화된 맑은공기(2000)를 물탱크를 형성한 회풍기(1)가 설치된 지역 정화범위 내에 제공한다. 다시 본발명의 설치는 고정식 이동식 회전식으로 정화범위가 넓고 정화량이 크며 여기서 본 발명의 용량 : 대중형 1일정화면적은 약 높이 500m 넓이 12km에서 16km 규모의 숲산 공기를 생산한다. 이어서 본 발명을 설치하는 지역이나 장소는 육지, 바다, 강, 건축물 실내, 대형건축물 신내, 지하건축물 실내, 지하철역 내, 대합실 내, 백화점,병원, 학교, 터널 안, 각종 체육시설 경기장 등에서 공해로 오염된 오염공기(1000)를 정화하여 맑고 상쾌한 정화공기(2000)를 제공하고 바다를 넘어오는 오염공기(1000)를 이동식 배, 선박을 이용해 정화하고 이때 이용하는정화수는 해수(海水)(200-1)를 이용해 정화하는 효과가 있고, 강(江)을 넘어오는 오염공기(1000)는 이동식 배,선박을 이용해 정화하고 이때 이용하는 정화수는 강물(200-3)을 이용해 오염공기(1000)를 정화하는 효과가공개실용신안 20-2023-0000241-6-있다.이어서 깨끗한 물 (100) (200)을 본 발명의 정화수(100) (200)로 정하여 사용하는 것은 오염된 물은 오염균을 [0011]유발하고 오염공기(1000)를 더 오염되게 만들어 맑고 깨끗한 정화공기(2000)를 발생시키지 못하고 상쾌한 공기가 되지 못하기 때문이며, 정화하는 몾적인 기후변화 지구위기 극복과 인류와 자연에 깨끗하게 정화공기(2000)를 제공하지 못하는 문제가 발생하고 마스크를 쓰고 창문을 닫고 외출도 나들이도 자유롭게 하지 못하는 효과가적은 오염공기정화가 된다. 또한 우리 인류의 생명인 공기(1000)가 더 이상 나쁨으로 악화되지 안도록 새로운재앙을 예방하기 위해 나라에서 인정하는 음용수(100) 대체정화수(200)를 한정해 인류의 건강과 정화공기(2000)질을 위해 정화수(100) (200)를 한정해 오염공기를 정화하는 것이다. 이때 맑은 물은 공기중에 악취, 거북한냄새를 제거해 주는 효과가 있다. 이어서 여름철 폭염발생시 섭씨 영상 38℃의 고온에 온도를 물탱크를 형성한회풍기(1)에서 분출되는 저온에 정화수 온도로 정화된 저온의 정화공기(2000)가 고온에 온도를 섭씨 1℃에서 5℃ 이하로 낮추어 준다. 이때 보조물탱크(31)에 물은 정한 기간내에 사용하고 보충한다. 다시 겨울철 섭씨 영하15℃의 저온에 온도를 물탱크를 형성한 회풍기(1)에서 분출되는 고온의 정화수 온도로 정화된 고온의 정화공기(2000)가 저온에 한파 온도를 1℃에서 5℃이상 높여주어 한파 예방에 효과가 발생한다.도면의 간단한 설명도 1은 본 발명이 물탱크를 형성한 회풍기 전체 완성도 [0012]도 2는 본 발명의 회풍기집 정명도도 3은 본 발명의 회풍기집 단면도도 4는 본 발명의 물수조 정면도도 5은 본 발명의 오염공기 2번 흡입구 정면도도 6는 본 발명의 송풍기모터실 정면도도 7은 본 발명의 풍풍기 몸체 정면도도 8는 본 발명의 회풍배출기 정면도도 9은 본 발명의 물분사조리구 내부 옆면도도 10는 본 발명의 보조물탱크 일직선 정화수공급관 구조장치 정면도고안을 실시하기 위한 구체적인 내용본 발명을 첨부된 도면과 함께 구체적인 제작방법을 상세한 설명과 함께 제시한다. 본 발명을 제작할수 있는 재 [0013]질은 철재질, 비철재질, 수지물재질을 이용해 제작 할수 있고, 더 자세하게는 H빔철재, 각철재, 철판,스텐철판, 스텐각대, 스텐벨브, 아연철판, 아연각대, 아연밸브, 스텐파이프, 아연파이프, 알미늄재질,스텐재질, 아연재질, 철수지물혼용재질, 비철수지물혼용재질, 수지물재질, 티타늄재질 등으로 제작할 수 있다.본 발명을 제작하여 설치할 때는 설치할 지역이나 장소에 위치를 정하고 본 발명 물탱크를 형성한회풍기제작방법(1-1)의 용량 크기에 따라 설치현장에서 제작하는 방법과 시설설비를 구비한 공장에서 제작하는 방법이 있다.여기서 본 발명 제작방법은 공장에서 제작하는 방법으로 설명한다.다시 본 발명이 설치될 지역이나 장소에 위치가 정해지면 본 발명에 사용되는 전기, 전지,, 에너지를 사용할 동 [0014]력장치와 정화수를 정하여 구비하고 본 발명의 부대시설인 설치장소 위치에 정한 기초 콘크리트로 H빔지주설치,정화수관(7), 배수구(8), 전기선, 통신선, 매설 기반공사를 하고 기초 기반공사가 완료되면 정한 위치에 정한형태의 밑받침판(3)를 산소, 레이저, 프라즈마절단기로 절단을 하고 밑받침판(3)에 표시한 정한 위치 내부구조와 외부 구조에 각각 1개 이상 정한 크기의 정화수관구(7)와 배수구(8)를 절단기로 형성하고 용접으로 연결배관을 형성한다. 여기서 본"}
{"patent_id": "20-2023-0000027", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "대기자연환경 속 맑은 공기가 공해로 오염된 오염공기로 변화되여 심각한 현대인의 당면한 문제가 되어 기후변호 로 인한 지구위기에 직면한 것이다. 지구위기를 극복하기 위해서는 전 인류의 모든 지구인이 앞장서 공해를 줄이 고 공해로 오염된 공기를회복시키는 일이 지구인의 의무이고 사명이 되었다. 본 발명의 오염공기 정화회풍기 제 (뒷면에 계속)"}
{"patent_id": "20-2023-0000027", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 물탱크를 형성한 오염공기정화회풍기제작방법은 내부 5단계 외부3단계 본 발명 근접거리에 보조물탱 크와 물탱크 연결장치 2단계 모두 10단계 적층식과 수평식으로 형성하고 보조물탱크를 한 개이상 형성하여 완성 하고 육지에서는 각종 공해로 오염된 대기속에 오염공기를 나라에서 인정하는 음용수를 정화수로 사용해 오염공 해를 정화하고 음용수가 없는 지역에서는 대체정화수를 이용해 오염공기를 정화하고 설치지역이나 장소에 따라 이동식과 ㄱ정식과 회전식은 본 발명의 설치장소에 따라 선택하여 설치하면 효과가 증가된다. 또한 지금까지는 지구에 공해로 오염된 공기를 하늘에서는 비와 눈과 바람으로 오염공기를 정화하고 땅에서는 흙, 돌,바위, 강물,, 바다, 식물이 공해를 정화하였다. 본 발명은 깨끗한 물과 회풍력과 기압층을 이용해 오염공기를 정화하 고 수돗물단수, 노후관교체, 정전, 절수, 동파, 급수중단, 모터고장등으로 단수시에 보조물탱크에 가득 체워져 있는 물탱크의 물을 사용해 오염공기를 정화하는 보조물탱크가 있는 물탱크를 형성한 오염공기 정화 회풍기제작 방법을 발명한 것이다. 이어서 본 발명으로 공해로 오염된 대기속 오염공기정화와 지상과 지하 건축물 실내, 건축시설물 실내에서 오염 공기를 정화하고 바다 위를 넘어오는 오염공기는 이동식 배나 선박을이용해 정화하고 고정식 바지선 선상에고정 하여 오염공기를 정화하고 이때 오염공기 정화수는 해수(海水)를 정화수로 이용해 정화하고 수질 2급수 이상인 강위에서는 강 위를 넘어오는 오염공기를 이동식 배나 고정식 바지선에 물탱크를 형성한 오염공기정화회풍기를 설치해서 강물을 정화수로 이용해 오염공기를 정화하고 더 효과적으로는 이동식 배에 본 발명품을 설치해 공해 로 오염된 장소로 이동하여 빠른 대응을 하고 오염공기층을 따라 이동하며 맑고 깨끗이 정화하는 것이다. 또한 육지에서 도로이동식 정화, 승강기식 이동정화, 도로이동식 정화와 승강기식 이동정화를 하나로 연결하여 하나 로 시스템으로 오염공기를 정화하는 방법을 겸하여 사용이 가능하고, 단수시에 정화하는 보조물탱크가 있는 오 염공기 정화회풍기 제작방법을 발명한 것이다."}
{"patent_id": "20-2023-0000027", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 대기공해를 제거하는 방법으로는 공해로 오염된 오염공기를 줄이기 위해서 저공해 차량을 개 발하고 황사의 발생근원지에 나무를 심고 노후된 차량을 폐차시키고 공해발생 산업을 줄이고 매연발생이 심한 차량에 새금을 더 부과하고 차량 십부제 및 짝수, 홀수 운행을 시행하고 여러 가지 방법과 규제로 환경공해를 줄이고자 노력하지만 공해는 더욱 확산되어 가고 있으며 국경을 넘어오는 공해로 오염된 오염공기, 바다공개실용신안 20-2023-0000241 -4-를 넘어오는 공해로 오염된 오염공기, 강을 넘어오는 오염공기, 산과 육지를 넘어오는 오염공기 를 줄이려고만 하지 지금 이 순간에도 배출되는 오염공기를 정화하는 방법을 찾지 못했다. 여기서 출원번호 : 10-2018-0091331와 출원번호 : 10-2019-0063625와 출원번호 : 10-2020-0047288과 출원번호 : 10- 2021-0031852와 출원번호 : 10-2021-0119499는 본 발명 출원인과 동일인이다. 이때 편의상 본 발명의 명칭을 물 탱크를 형성한 회풍기제작방법으로 통칭한다. 더 진보적 기술과 명확한 범위로 물탱크를 형성한 회풍기제작방법 을 발명한 것이다. 더욱이 기후변화와 지구위기에 직면한 현재(現在)의 실질적 위기를 극복하기 위해 공해로 오염된 오염공기를 정화하는 내부 5단계 적층식에 외부3단계 적층식과 보조물탱크 연결장치 구조로 모두 10단계 적층식과 보조물탱크 2단계의 정교한 구조 배치를 형성하고 이때 보조물탱크는 1개 이상을 형성하고 본 발명에 사용하는 정화수 는 나라에서 인정하는 음용수, 수돗물(100-1), 샘물(100- 2), 지하수(100-3), 암반수(100-4)와 음용수가 없는 지역이나 장소에서는 대체정화수 : 해수(200-1) 염분수(200-2) 수질 2급수 이상인 강물(200-3)을 한정해 정화수 로 이용하고 맑은 물로 오염공기 를 정화하는방식이다. 오염공기가 심한 지역에 정화수가 없을 때는 긴급정화수(200-4)를 나라에서 인정하는 수질 3급수 이상인 강물을 한시적으로 정화수로 이용해 오염공기인 : 황사,, 미세먼지, 초미세먼지, 이산화탄소, 자동차배출공해, 산업배출공해, 항공배출공해, 항선배출공해, 농기계배출공 해, 지하철배출공해, 산불공해, 화재공해, 분징, 스모그현상, 바이러스, 인체유해세균등을 맑고 깨끗하게 정화 하고 정화방식은 물탱크를 형성한 회풍기에 구비된 배전판에 전원을 ON으로 작동하면 송풍기모터(14-1)가 작 동되고 고압모터펌프가 작동하고 고압모터펌프의 수압으로 정밀하게 조립형성된 물분출조리구에 서 분출하는 분출수로 송풍기의 흡입력으로 오염공기를 빨아내려서 빨려들어오는 오염공기 를 맑고 깨끗하게 정화해 송풍기의 흡입력과 배출력에 의해 360°회풍력을 발생시켜 회오리바람으로 정화 공기를 배출하여 오염공기층을 저공으로 밀어내고 파고들어 계속 배출하는 회풍력정화공기는 오염공기와 희석되어 맑아지고 계속 배출되는 정화공기층은 계속 확장하여 정화공기층을 계 속 확장해 넓혀가고 오염공기층은 계속 작아지고 살아져 맑은 정화공기층이 형성된다. 또한 물탱크 를 형성한 회풍기 정한자리에 보조물탱크를 1개이상 자리를 정하여 형성하고 수돗물 단수, 노후관교체, 정전, 절수, 동파, 급수중단, 모터고장 등으로 단수시에는 보조물탱크에 가득 체워져 있는 물탱크의 정 화수공급관 밸브를 열어 저장된 정화수를 사용 할수 있도록 보조물탱크를 형성하여 오 염공기를 정화할 수 있는 특징이 있다. 이때 물탱크 벨브를 열기전에 물탱크를 형성한 회풍기로 들어 오는 정화수관 벨브는 잠금으로 한다. 이어서 오염공기를 정화한 정화수 9200)는 유수식으로 정화한 물은 1단계 수조에서 배수구로 배출한다. 이어서 본 발명은 공해로 오염된 오염공기를 정화 하는데 정화력이 빠른 물탱크를 형성한 회풍기제작방법을 발명하게 된 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내특허 특허문헌 KR : 공개번호 10-118546 (특허문헌 0002) 특허문헌 KR : 공개번호 20-0248234 비특허문헌 (비특허문헌 0001) 국내문헌 비특허문헌 KR : 공개번호 10-2018-001221 (비특허문헌 0002) 비특허문헌 KR : 공개번호 특 2003-008606 고안의 내용"}
{"patent_id": "20-2023-0000027", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 재질은 철, 비철재질, 수지물재질로 제작하고 더 자세하게는 철대, H빔철재, 철판, 스텐철판, 스텐각 대, 스텐파이프, 스텐밸브, 아연재질, 알미늄재질, 스텐재질, 수지물재질, 철재수지혼용재질, 비철수지혼용재질, F.R.P 티타늄재질로 제작하고 완성된다. 이때 보조물탱크의 물탱크통은 설치장소에 따라 구매하여 설치장소용량에 맞게 정화수보충관과 정화수공급관를 정한규격 길이대로 절단 제작하여 쇼켓공개실용신안 20-2023-0000241 -5-으로 연결 조립하여 물탱크를 형성한다. 이어서 일반적으로 대기공해를 제거하는 방법으로는 공해로 오 염된 오염공기를 줄이기 위해서 저공해 차량을 개발하고 황사의 발생근원지에 나무를 심고 노후된 차량을 폐차시키고 공해발생 산업에 탄소발생을 줄이고 매연발생이 심한 차량에는 과태료, 세금을 더 부과하고 차량십 무제 및 짝수 홀수 운행을 시행하는 것과 법률적 규제가 동원되고 있다. 다시 이어서 여러 가지 방법과 규제로 환경공해를 줄이고자 노력하지만 공해는 더욱 확산되어 가고 있으며 국경을 넘어오는 공해로 오염된 오염공기 는 황사, 미세먼지, 초미세먼지, 이산화탕소, 자돛아배출공해, 산업배출공해, 항고배출공해, 항선배출공 해, 농기계배출공해, 지하철배출공해, 산불공해, 화재공해, 분진, 스모그현상, 바이러스, 인체유해세균 등을 정 화해야 하나 정화방법이 없었다. 종래의 기술은 건물 내에서 공기를 정화는 필터방식, 습식방식 공기정화기, 공 기청정기 필터식으로 정화하는 것으로 효과는 미미한 것이다. 또한 바다를 넘어오는 공해로 오염된 오염공기, 강을 넘어오는 공해로 오염된 오염공기, 산과 육지를 넘어오는 오염공기 국경을 넘어오는 오염공기로 지구는 기후변화와 지구위기라는 현실에 직면하는 문제점이 발생된 것이다."}
{"patent_id": "20-2023-0000027", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 말명은 직면한 현대사회의 기후변화 지구위기의 원인이 된 공해로 오염된 오염공기를 육지에서 바다에 서 강에서 건축물 실내에서 지하건축물 실내와 대형건물 실내, 지하철역 내, 백화점 내, 병원내, 실내체육시설 내, 터널내, 지하상가 내, 학교 교내, 군사훈련소 내, 대합실 내, 체육시설 경기자 내에 뿐 아니라 지구대기속 에 오염공기가 발생한 지역에서 공해로 오염된 오염공기를 맑고 깨끗하게 정화하는 내부 5단계 외 부 3단계 보조물탱크와 보조물탱크연결장치 2단계로 구성되어 적층식 구조로 이루어지고 여기에 정화수 단수, 고장등으로 정화수가 끈길때도 가동할수 있는 보조물탱크를 형성하여 완성되는 물탱크를 형성한 회풍기제작방법를 발명하였다. 물탱크를 형성한 회풍기에 사용되는 오염공기 정화수는 나라 에서 인정하는 음용수인 : 수돗물(100-1), 샘물(100-2), 지하수(100-3) 암반수(100-4)와 음용수가 없는 지역이나 장소에서는 대체정화수인 : 해수(海水)(200-1), 염분수(200-2), 수질 2급수 이상인 강물 (200-3)과 긴급정화수로 나라에서 인정하는 수질 3급이상인 강물(200-4)을 본 발명의 정화수로 한정하고 본 발 명으로 정화하는 공해로 오염된 오염공기는 황사, 미세먼지, 초미세먼지, 이산화탄소, 자동차배출공해, 산업배출공해, 항공배출공해, 항선배출공해, 농기계배출공해, 지하철배출공해, 산불공해, 화재공해, 분진, 스모 그현상, 악취, 거북한 냄새, 바이러스, 인체유해세균 등을 맑고 깨끗하게 정화하는 것이다. 다시 본 발명품은 고정식과 도로이동정화식과 승강기 이동식으로 사용할수 있고, 오염공기를 정화하는 방 법에 따라 정한 지역이나 장소에서 오염공기를 정화하고 바다를 넘어오는 공해로 오염된 오염공기 는 이동식 배나 선박을 사용하여 선상 정한 위치에 고정하여 해수(200-1)를 정화수로 이용해 정화하고 고정식 바지선 선상에 정한 위치에 고정하여 해수(海水)(200-1)를 정화수로 이용해 오염공기를 정화하고 수질 2 급수 이상인 강물(200-3) 위에서 이동식 배 선상에 물탱크를 형성한 회풍기를 정한 위치에 고정하여 이동하 며 강물(200-3)을 정화수로 이용해 오염공기를 정화하고 고정식 바지선 선상에 고정하여 강물(200-3)를 정화수로 이용해 정화하도록 물탱크를 형성한 회풍기를 비철재질을 사용해 제작하고 수질물질을 사용해 제작 하여 부식과 녹스는 것을 방지하는 물탱크를 형성한 회풍기제작방법(1-1)을 발명한 것이 특징이 있다. 고안의 효과 본 발명의 오염공기정화회풍기의 효과는 대기 속 오염공기인 : 황사, 미세먼지, 초미세먼지, 자동차배 출공해, 산업배출공해, 항공배출공해, 항선배출공해, 농기계배출공해, 지하철배출공해, 분진, 이산화탄소, 산불 공해, 화재공해, 스모그현상, 악취, 거북한 냄새, 바이러스, 인체유해세균 등을 맑고 깨끗하게 정화한다. 이어 서 본 발명에 한정해 사용할 수 있는 정화수를 이용해 오염된 오염공기를 맑고 깨끗하게 정화하여 사람과 자연에 정화된 맑은공기를 물탱크를 형성한 회풍기가 설치된 지역 정화범위 내에 제공한다. 다시 본 발명의 설치는 고정식 이동식 회전식으로 정화범위가 넓고 정화량이 크며 여기서 본 발명의 용량 : 대중형 1일 정화면적은 약 높이 500m 넓이 12km에서 16km 규모의 숲산 공기를 생산한다. 이어서 본 발명을 설치하는 지역이 나 장소는 육지, 바다, 강, 건축물 실내, 대형건축물 신내, 지하건축물 실내, 지하철역 내, 대합실 내, 백화점, 병원, 학교, 터널 안, 각종 체육시설 경기장 등에서 공해로 오염된 오염공기를 정화하여 맑고 상쾌한 정 화공기를 제공하고 바다를 넘어오는 오염공기를 이동식 배, 선박을 이용해 정화하고 이때 이용하는 정화수는 해수(海水)(200-1)를 이용해 정화하는 효과가 있고, 강(江)을 넘어오는 오염공기는 이동식 배, 선박을 이용해 정화하고 이때 이용하는 정화수는 강물(200-3)을 이용해 오염공기를 정화하는 효과가공개실용신안 20-2023-0000241 -6-있다. 이어서 깨끗한 물 을 본 발명의 정화수 로 정하여 사용하는 것은 오염된 물은 오염균을 유발하고 오염공기를 더 오염되게 만들어 맑고 깨끗한 정화공기를 발생시키지 못하고 상쾌한 공기 가 되지 못하기 때문이며, 정화하는 몾적인 기후변화 지구위기 극복과 인류와 자연에 깨끗하게 정화공기 를 제공하지 못하는 문제가 발생하고 마스크를 쓰고 창문을 닫고 외출도 나들이도 자유롭게 하지 못하는 효과가 적은 오염공기정화가 된다. 또한 우리 인류의 생명인 공기가 더 이상 나쁨으로 악화되지 안도록 새로운 재앙을 예방하기 위해 나라에서 인정하는 음용수 대체정화수를 한정해 인류의 건강과 정화공기(200 0)질을 위해 정화수 를 한정해 오염공기를 정화하는 것이다. 이때 맑은 물은 공기중에 악취, 거북한 냄새를 제거해 주는 효과가 있다. 이어서 여름철 폭염발생시 섭씨 영상 38℃의 고온에 온도를 물탱크를 형성한 회풍기에서 분출되는 저온에 정화수 온도로 정화된 저온의 정화공기가 고온에 온도를 섭씨 1℃에서 5 ℃ 이하로 낮추어 준다. 이때 보조물탱크에 물은 정한 기간내에 사용하고 보충한다. 다시 겨울철 섭씨 영하 15℃의 저온에 온도를 물탱크를 형성한 회풍기에서 분출되는 고온의 정화수 온도로 정화된 고온의 정화공기 가 저온에 한파 온도를 1℃에서 5℃이상 높여주어 한파 예방에 효과가 발생한다."}
