{"patent_id": "10-2023-0128134", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0045182", "출원번호": "10-2023-0128134", "발명의 명칭": "통합 사진 작가 예약 방법", "출원인": "김희영", "발명자": "김희영"}}
{"patent_id": "10-2023-0128134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버에 의해 수행되는 스타일링 추천 및 사진 작가 예약 방법에 있어서,통신부에 의해, 사용자 단말기로부터 서비스 이용자 수, 이용 카테고리, 서비스 이용 목적 및 서비스 이용 날짜를 포함한 기본 정보 값을 수신하는 단계;프로세서에 의해, RAM에 저장된 상기 기본 정보 값을 불러오고, 상기 기본 정보 값에 의하여 사용자 분석 데이터를 획득하는 단계;상기 프로세서에 의해, 상기 사용자 분석데이터 및 상기 기본 정보 값에 대응되는 제1 추천 리스트를 출력하는단계; 및상기 사용자 단말기로부터 상기 제1 추천 리스트에 포함된 작가 중 선택된 작가를 포함하는 선택 작가 리스트를수신하는 단계;를 포함하는, 통합 사진 작가 예약 방법."}
{"patent_id": "10-2023-0128134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "상기 제1 항에 있어서,상기 기본 정보 값을 수신 받는 단계는, 상기 사용자 단말기로부터 사용자의 얼굴 이미지 및 외형 이미지를 포함하는 사용자 이미지를 수신 받는 단계;헤어, 메이크업 및 패션을 포함한 상기 이용 카테고리 중 적어도 하나 이상의 카테고리에 대해 수신 받는 단계;및상기 이용 카테고리를 이용할 상기 서비스 이용자 수를 수신 받는 단계;를 포함하는 것을 특징으로 하는 통합 사진 작가 예약 방법."}
{"patent_id": "10-2023-0128134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "상기 제2 항에 있어서, 상기 분석 데이터를 연산하는 단계는,상기 얼굴 이미지에서 얼굴 형태, 눈 형태, 입 형태, 이목구비 형태 및 목 형태 중 적어도 하나를 추출하여 헤어 추천 스타일을 생성하는 단계; 상기 얼굴 이미지에서 머리의 색, 피부 색, 눈썹의 형태 중 적어도 하나를 추출하여 퍼스널 이미지 스타일을 생성하는 단계; 및상기 외형 이미지에서 체형, 어깨 형태, 상체 형태, 하체 형태, 팔 길이, 신체 비율 중 적어도 하나를 추출하여패션 추천 스타일을 생성하는 단계;를 포함하는 것을 특징으로 하는 통합 사진 작가 예약 방법."}
{"patent_id": "10-2023-0128134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "상기 제3항에 있어서,상기 제1 추천 리스트는,상기 서비스 이용 목적 및 상기 서비스 이용 날짜에 대응하는 목적 별 추천 장소 리스트와 계절 별 추천 장소리스트를 출력하고, 공개특허 10-2025-0045182-3-목적 별 추천 장소 리스트와 계절 별 추천 장소 리스트 중 적어도 하나의 추천 장소리스트에 포함되는 장소들을포함하는 장소 리스트를 포함하는 것을 특징으로 하는 통합 사진 작가 예약 방법."}
{"patent_id": "10-2023-0128134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "상기 제4항에 있어서,상기 제1 추천 리스트는,상기 장소 리스트에 포함되어 있는 장소 중에서 상기 장소 리스트가 헤어 스타일리스트의 활동 범위에대응되고, 상기 헤어 추천 스타일에 대응하는 헤어 스타일리스트 목록,상기 장소 리스트에 포함되어 있는 장소 중에서 상기 장소 리스트가 메이크업 아티스트의 활동 범위에대응되고, 상기 퍼스널 이미지 스타일에 대응하는 메이크업 아티스트 목록 및상기 장소 리스트에 포함되어 있는 장소 중에서 상기 장소 리스트가 패션 스타일리스트의 활동 범위에대응되고, 상기 패션 추천 스타일에 대응하는 패션 스타일리스트 목록을 더 포함하는 것을 특징으로 하는 통합 사진 작가 예약 방법."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일실시예에 따른 서버에 의해 수행되는 스타일링 추천 및 사진 작가 예약 방법은, 통신부에 의해, 사용자 단말기 로부터 서비스 이용자 수, 이용 카테고리, 서비스 이용 목적 및 서비스 이용 날짜를 포함한 기본 정보 값을 수신 받는 단계, 프로세서에 의해, RAM에 저장된 상기 기본 정보 값을 불러오고, 상기 기본 정보 값에 의하여 사용자 분석 데이터를 연산하는 단계, 상기 프로세서에 의해, 상기 사용자 분석데이터 및 상기 기본 정보 값에 대응되는 제1 추천 리스트를 출력하는 단계 및 상기 사용자 단말기로부터 상기 제1 추천 리스트에 포함된 작가 중 선택된 작가를 포함하는 선택 작가 리스트를 수신 받는 단계를 포함할 수 있습니다."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 기술적 사상은 통합 사진 작가 예약 방법에 관한 것으로, 더욱 상세하게는, 헤어 스타일리스트, 메이 크업 아티스트, 패션 스타일리스트를 예약함 과 동시에 사진 작가도 예약하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스냅 사진이란, 재빠르게 순간적인 장면을 포착하여 자연스러운 동작이나 표정이 담긴 사진을 의미한다. 대부분 의 사람들이 배경이 이쁘고, 특이한 곳에서 본인만의 사진을 찍기 원한다. 하지만, 사진 작가가 아닌 사람들은 직접 촬영하는 것에 대해서 어려움을 느끼기 쉽다. 따라서, 대부분의 스냅 사진 촬영을 원하는 사람들은 전문적 인 사진 작가에게 직접 연락하여 시간과 장소에 대해 얘기를 나누고 예약하는 방식이 대부분이다. 또한, 사진 작가마다 촬영하는 기법이나 촬영하는 스타일이 각기 다 다르기 때문에 사진 촬영을 원하는 사람들은 사진 작가 의 포트폴리오를 전부 살펴봐야하며, 살펴보고 연락하더라도 사진 작가와의 시간이 맞지 않으면 촬영할 수 없으 며 다시 다른 사진 작가를 찾기 위해 계속적인 검색과 포트폴리오 살펴보고, 연락해야한다. 또한, 사진을 위하여 머리, 메이크업, 옷 등을 준비하여야 하는데, 머리 및 메이크업은 전문가가 아니면 세팅하 기 어려워 이 또한 사진 작가를 예약한 것 처럼 직접 연락하여 시간과 장소를 예약해야 한다는 불편함이 있다. 더군다나 옷 같은 경우에도 일반 평상복으로 촬영할 사람 외 컨셉을 가지고 촬영을 원하고자 하는 촬영자의 경 우 옷을 따로 구매하거나 대여해야 한다. 하지만 이에 대해서도 직접 원하는 컨셉의 옷을 찾는 것도 힘들뿐더러, 옷을 대여 또는 구매한다고 해도 이에 대한 메이크업 및 머리를 해줄 메이크업 아티스트, 헤어 스 타일리스트를 구해야 한다는 보다 불편함이 있다. 즉, 스냅 사진을 찍기 위하여 본인의 원하는 컨셉에 맞춘 머리, 메이크업, 옷이 모두 준비가 되어 있어야 하고, 사진 작가도 준비되어 있어야 한다. 하지만 헤어 스타일리스트, 메이크업 아티스트, 패션 스타일리스트 및 전문 사진가 총 4명이 모두 가능한 날짜/시간도 맞아야 할뿐더러 해당 전문가 4인이 모두 가능한 장소여야한다. 이 모든 것을 직접 이용자가 연락하여 예약하기엔 그 과정이 너무 번거롭고 불편하다."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 기술적 사상이 해결하려는 과제는, 사용자에 맞는 헤어와 메이크업을 제공할 수 있는 전문가와 사용 자가 원하는 목적 및 컨셉에 따라 사진을 촬영하는 사진 전문가를 한 번에 예약 할 수 있는 통합 예약 방법을 제공하는 데에 있다."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시예에 따른 통합 사진 작가 예약 방법은 통신부에 의해, 사용자 단말기로부터 서비스 이용자 수, 이용 카테고리, 서비스 이용 목적 및 서비스 이용 날짜를 포함한 기본 정보 값을 수신 받는 단계, 프로세서에 의해, RAM에 저장된 상기 기본 정보 값을 불러오고, 상기 기본 정보 값에 의하여 사용자 분석 데이터를 획득하 는 단계, 상기 프로세서에 의해, 상기 사용자 분석 데이터 및 상기 기본 정보 값에 대응되는 제1 추천 리스트를 출력하는 단계 및 상기 사용자 단말기로부터 상기 제1 추천 리스트에 포함된 작가 중 선택된 작가를 포함하는 선택 작가 리스트를 수신 받는 단계를 포함할 수 있다. 일실시예에 따르면, 상기 기본 정보 값을 수신 받는 단계는 상기 사용자 단말기로부터 사용자의 얼굴 이미지 및 외형 이미지를 포함하는 사용자 이미지를 수신 받는 단계, 헤어, 메이크업 및 패션을 포함한 상기 이용 카테고 리 중 적어도 하나 이상의 카테고리에 대해 수신 받는 단계 및 상기 이용 카테고리를 이용할 상기 서비스 이용 자 수를 수신 받는 단계를 포함할 수 있다. 일실시예에 따르면, 상기 분석 데이터를 연산하는 단계는, 상기 얼굴 이미지에서 얼굴 형태, 눈 형태, 입 형태, 이목구비 형태 및 목 형태 중 적어도 하나를 추출하여 헤어 추천 스타일을 생성하는 단계, 상기 얼굴 이미지에 서 머리의 색, 피부 색, 눈썹의 형태 중 적어도 하나를 추출하여 퍼스널 이미지 스타일을 생성하는 단계 및 상 기 외형 이미지에서 체형, 어깨 형태, 상체 형태, 하체 형태, 팔 길이, 신체 비율 중 적어도 하나를 추출하여 패션 추천 스타일을 생성하는 단계를 포함할 수 있다. 일실시예에 따르면, 상기 제1 추천 리스트는, 상기 서비스 이용 목적 및 상기 서비스 이용 날짜에 대응하는 목 적 별 추천 장소 리스트와 계절 별 추천 장소 리스트를 출력하고, 목적 별 추천 장소 리스트와 계절 별 추천 장 소 리스트 중 적어도 하나의 추천 장소리스트에 포함되는 장소들을 포함하는 장소 리스트를 포함할 수 있다. 일실시예에 따르면, 상기 제1 추천 리스트는, 상기 장소 리스트에 포함되어 있는 장소 중에서 상기 장소 리스트 가 활동 범위에 대응되고, 상기 헤어 추천 스타일에 대응하는 헤어 스타일리스트 목록, 상기 장소 리스트에 포 함되어 있는 장소 중에서 상기 장소 리스트가 활동 범위에 대응되고, 상기 퍼스널 이미지 스타일에 대응하는 메 이크업 아티스트 목록 및 상기 장소 리스트에 포함되어 있는 장소 중에서 상기 장소 리스트가 활동 범위에 대응 되고, 상기 패션 추천 스타일에 대응하는 스타일리스트 목록을 더 포함할 수 있다."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예에 따른 통합 사진 예약 방법은 사용자가 원하는 컨셉 및 날짜에 맞춰 헤어, 메이크업 스타일 링을 제공할 수 있는 전문가를 예약할 수 있다. 또한, 사용자가 원하는 컨셉에 맞춘 사진 작가에 대해 추천 받고 예약할 수 있다. 본 개시의 예시적 실시예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 아니하며, 언급되지"}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아니한 다른 효과들은 이하의 기재로부터 본 개시의 예시적 실시예들이 속하는 기술분야에서 통상의 지식을 가 진 자에게 명확하게 도출되고 이해될 수 있다. 즉, 본 개시의 예시적 실시예들을 실시함에 따른 의도하지 아니"}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "한 효과들 역시 본 개시의 예시적 실시예들로부터 당해 기술분야의 통상의 지식을 가진 자에 의해 도출될 수 있 다."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에서 스냅 사진이란, 사진을 찍기 원하는 사용자가 원하는 컨셉/분위기로 사진 찍는 것에 대하여 어려움 을 느끼고 전문 사진가를 고용하여 찍은 사진을 일컬을 수 있다. 또한, 본 발명에서 서비스란 앞서 서술한 스냅 사진 촬영 외 스냅 사진을 촬영하기 위하여 사용자가 받을 수 있 는 헤어, 메이크업, 패션 스타일링을 일컬을 수 있다. 이때, 헤어 스타일링, 메이크업 스타일링, 패션 스타일링 및 사진 촬영은 모두 해당 분야에 대해 포트폴리오를 가지고 있는 전문가들이 제공해 주는 서비스를 의미한다. 본 개시에 대하여 구체적으로 설명하기에 앞서, 본 명세서 및 도면의 기재 방법에 대하여 설명한다. 먼저, 본 명세서 및 청구범위에서 사용되는 용어는 본 개시의 다양한 실시 예들에서의 기능을 고려하여 일반적 인 용어들을 선택하였다. 하지만, 이러한 용어들은 당해 기술 분야에 종사하는 기술자의 의도나 법률적 또는 기 술적 해석 및 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 일부 용어는 출원인이 임의로 선정한 용어 도 있다. 이러한 용어에 대해서는 본 명세서에서 정의된 의미로 해석될 수 있으며, 구체적인 용어 정의가 없으 면 본 명세서의 전반적인 내용 및 당해 기술 분야의 통상적인 기술 상식을 토대로 해석될 수도 있다. 또한, 본 명세서에 첨부된 각 도면에 기재된 동일한 참조번호 또는 부호는 실질적으로 동일한 기능을 수행하는 부품 또는 구성요소를 나타낸다. 설명 및 이해의 편의를 위해서 서로 다른 실시 예들에서도 동일한 참조번호 또 는 부호를 사용하여 설명한다. 즉, 복수의 도면에서 동일한 참조 번호를 가지는 구성요소를 모두 도시되어 있다 고 하더라도, 복수의 도면들이 하나의 실시 예를 의미하는 것은 아니다. 또한, 본 명세서 및 청구범위에서는 구성요소들 간의 구별을 위하여 \"제1\", \"제2\" 등과 같이 서수를 포함하는 용어가 사용될 수 있다. 이러한 서수는 동일 또는 유사한 구성요소들을 서로 구별하기 위하여 사용하는 것이며 이러한 서수 사용으로 인하여 용어의 의미가 한정 해석되어서는 안 된다. 일 예로, 이러한 서수와 결합된 구성 요소는 그 숫자에 의해 사용 순서나 배치 순서 등이 제한되어서는 안 된다. 필요에 따라서는, 각 서수들은 서로 교체되어 사용될 수도 있다. 본 명세서에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 실시 예에서 \"모듈\", \"유닛\", \"부(part)\" 등과 같은 용어는 적어도 하나의 기능이나 동작을 수행하는 구성요소를 지칭하기 위한 용어이며, 이러한 구성요소는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\", \"유닛\", \"부(part)\" 등은 각각이 개별적인 특정 한 하드웨어로 구현될 필요가 있는 경우를 제외하고는, 적어도 하나의 모듈이나 칩으로 일체화되어 적어도 하나 의 프로세서로 구현될 수 있다. 또한, 본 개시의 실시 예에서, 어떤 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적인 연결뿐 아니라, 다른 매체를 통한 간접적인 연결의 경우도 포함한다. 또한, 어떤 부분이 어떤 구성요소를 포함한다는 의미는, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것 을 의미한다. 이하에서, 첨부된 도면을 이용하여 본 발명의 다양한 실시 예들에 대하여 구체적으로 설명한다. 도 1은 본 개시의 실시예에 따른 서버의 구성을 도시화한 블록도이다. 도 1 및 도 2를 참조하면 서버는 입력 정보들에 대한 연산을 수행하는 서버 또는 전자 장치로 구성될 수 있 고, 프로세서, RAM(Random Access memory) , 스토리지 및 통신부를 포함할 수 있다. 프로세서는 서버의 전반적인 동작을 제어할 수 있다. 프로세서는 하나의 프로세서 코어(Single Core)를 포함하거나, 복수의 프로세서 코어들(Multi-Core)을 포함하는 CPU(Central Processing Unit)를 포함할 수 있다. 서버는 하나 이상의 프로세서를 포함할 수 있다. 프로세서는 스토리지에 저장된 프로그램, 데이터, 또는 명령들(instructions)을 처리 또는 실행할 수 있다. 예를 들어, 프로세서는 스토리지에 저장된 프로그램들을 실행함으로써 사용자의 얼굴 이미 및 외형 이미지로부터 사용자에게 잘 어울릴 수 있는 메이크업과 헤어 및 옷을 추천할 수 있는 추천 스타일들을 생성할 수 있다. 또한, 스냅 사진 촬영을 위한 전문가 예약을 원하는 사용자을 통해 입력된 응답/요청에 따른 응 답을 실행할 수 있다. RAM은 프로그램들, 데이터, 또는 명령들(instructions)을 일시적으로 저장할 수 있다. 예를 들어, 스토리 지에 저장된 프로그램들 및/또는 데이터는 프로세서의 제어 또는 부팅 코드에 따라 RAM에 일시 적으로 저장될 수 있다. 예컨대, RAM은 DRAM (Dynamic RAM), SRAM (Static RAM), SDRAM (Synchronous DRAM) 등을 포함한다. 스토리지는 데이터를 저장하기 위한 저장 장소로서, OS(Operating System), 각종 프로그램들, 및 각종 데 이터를 저장할 수 있다. 스토리지는 ROM (Read Only Memory), 플래시 메모리, PRAM (Phase-change RAM), MRAM (Magnetic RAM), RRAM (Resistive RAM), FRAM (Ferroelectric RAM) 등을 포함한다. 실시예에 있어서, 스 토리지는 HDD(Hard Disk Drive), SSD(Solid State Drive) 등으로 구현될 수 있다. 스토리지에 저장되는 정보로는 서비스(전문가 예약)를 이용할 사용자에 대한 정보 및 전문가에 대한 정보 가 저장 될 수 있다. 더욱 구체적으로 사용자 정보로는 서비스를 이용할 이용자의 수, 서비스 이용목적, 서비스 이용 날짜, 서비스 이용 지역, 이용자의 얼굴 이미지 및 외형 이미지가 포함 될 수 있다. 전문가 정보로는 전문 가의 전문 카테고리, 활동 반경, 전문가의 포트폴리오 정보가 포함될 수 있다. 이용자의 수는 사용자 단말기(미도시)로부터 입력되는 값이며, 이용자의 수는 적어도 1명 이상의 수로 지정될 수 있다. 또한, 이용자의 수는 어른 X명, 어린이 Y명과 같이 나이대를 설정하여 지정될 수 있으며, 어른은 노인 과 그렇지 않은 사람으로도 분류 될 수 있다. 또한, 이용자는 사람으로 한정하지 아니하며, 동물이 포함될 수 있다. 따라서, 사용자 단말기(미도시)로부터 서버은 이용자 수에 대해서 입력 받을 때, 동물이 포함되는지 에 대한 여부에 대해서도 입력 받을 수 있으며, 동물이 포함되는 경우 그에 대한 종류 및 해당 동물의 수도 입 력 받을 수 있다. 서비스 이용 지역은 대한민국 국내에 한정하지 아니하되, 국내로 예시로 설명하면, 시/도 및 구/읍까지 선택 가능하며, 선택된 시/도 및 또는 구/읍에 위치한 사진 명소, 관광지, 공원 등이 서비스 이용 지 역으로 선택되어 입력 받을 수 있다. 또한, 본 발명의 일실시예에 따라 사용자 단말기(미도시)로부터 사용자의 얼굴 이미지 및 외형 이미지를 제공 받을 수 있으며, 사용자에게 잘 어울리는/추천하는 스타일링을 추천할 수 있다. 이에 대한 구체적인 실시예는 후술하기로 한다. 서비스 이용 목적은 '결혼', '우정', '가족', '여행', '추억'과 같은 카테고리로 구성될 수 있으며, 만약 결혼 을 앞두고 있거나, 결혼식 이후 신혼 여행에서 촬영할 경우에는 '결혼' 카테고리로 선택될 수 있으며, 다같이 여행을 가서 가족끼리 찍는 스냅 사진이라면 '가족'이라는 카테고리가 선택될 수 있다. 즉, 사용자 단말기(미도 시)로부터 사용자의 스냅 사진 촬영 목적에 따른 서비스 이 목적을 입력 받을 수 있다. 서비스 이용 날짜는 사용자 단말기(미도시)로부터 입력 받는 정보로, 서비스를 이용할 날짜에 대한 정보로 YYYY-MM-DD의 형태로 이루어질 수 있으며, 이때, 입력 받은 이용 날짜에 따라 계절 정보가 자동으로 함께 설정 될 수 있다. 구체적으로, 입력 받은 날짜가 2023-08-31 이라면, 해당 날짜의 계절 정보는 여름으로 해당되어 2023-08-31-여름 이라는 정보로 변환되어 설정될 수 있다. 이때, 계절 정보는 3월~5월은 봄, 6월~8월은 여름, 9 월~11월 가을, 12월~2월은 겨울로 지정될 수 있다. 헤어를 전문적으로 하는 헤어 스타일리트의 전문 카테고리는 '헤어'가 될 수 있다. 즉, 헤어, 메이크업, 패션, 사진에 해당하는 각기 다른 전문가들은 본인의 전문 분야에 따라 전문 카테고리가 지정될 수 있다. 전문가의 활동 반경은 전문가가 활동이 가능하며, 이동이 가능한 위치로 전문가 단말기(미도시)로부터 입력 받 아 설정되는 정보일 수 있다. 더욱 구체적으로, 서울에 거주하며 서울, 인천, 경기도 내에서만 사진 촬영이 가 능한 사진 작가는 활동범위가 서울, 인천, 경기도가 될 수 있다. 즉, 전문가가 이동이 가능하며, 일이 가능한 지역을 나타낸 것이 될 수 있다. 또한, 헤어, 메이크업 전문가일 경우에는 전문가의 샵 외 지역으로 출장이 가 능한 지역에 대하여 활동 범위로 지정할 수 있다. 통신부는 서버의 데이터를 전송 및/또는 수신할 수 있다. 예컨대, 통신부는 다양한 통신 방식에 의해 데이터를 전송 및 수신할 수 있다. 예컨대, 통신부는 예를 들면, 3G, LTE, Wi-Fi, 블루투스, BLE(Bluetooth Low Energy), Zigbee, NFC(Near Field Communication), 초음파를 통한 통신 방법 등에 의해 통 신을 수행할 수 있으며, 유선 통신, 무선 통신 근거리 통신, 원거리 통신을 모두 포함할 수 있다. 따라서, 본 개시의 서버는 상기 구성들에 의해 연산을 수행할 수 있고, 데이터 또는 명령을 일시적으로 저 장하거나, 사용자 단말기(미도시), 전문가 단말기(미도시), 및 서버들과의 데이터 전송 및/또는 수신을 수행할 수 있다. 이하에서, 첨부된 도면을 이용하여 본 발명의 다양한 실시 예들에 대하여 구체적으로 설명한다. 도 2는 본 개시의 실시예에 따른 통합 사진 작가 예약 방법을 도시한 흐름도이다. 이하 본 명세서는, 도 1을 참조하여 설명될 수 있다. 본 발명의 일실시예에 따른 통합 사진 작가 예약 방법에는 기본 정보 값을 수신하는 단계(S110), 분석 데이터를 획득하는 단계(S120), 제1 추천 리스트를 출력하는 단계(S130) 및 작가 리스트를 수신 받는 단계(S140)을 포함 할 수 있다. 기본 정보 값을 수신하는 단계(S110)는 전문가 예약을 하기에 앞서 서비스를 이용할 이용자의 정보를 입력 받는 단계이다. 이때, 기본 정보 값은 서비스를 이용할 사용자의 수/사용자 간 관계(연인, 친구, 가족, 동료, 기타) 포함하는 제1 기본정보, 서비스 이용 날짜/서비스 이용 지역/서비스 이용 목적을 포함하는 제2 기본정보 및 사 용자 각각의 얼굴 이미지/사용자 각각의 외형 이미지/사용자 각각의 키, 몸무게 값을 포함하는 제3 기본정보를 포함할 수 있다. 이때, 입력 받은 기본 정보 값(서비스를 이용할 사용자의 수, 서비스 이용목적, 서비스 이용 날짜, 서비스 이용 지역, 사용자의 얼굴 이미지 및 외형 이미지)은 RAM에 저장될 수 있으며, RAM에 저장된 기본 정보 값 은 후술할 사용자 분석 데이터를 획득하는 단계(S120)에서 프로세서으로 불러와 사용자 분석 데이터를 획 득할 때 사용될 수 있다. 분석 데이터를 획득하는 단계(S120)는 앞선 단계(S110)에서 입력/수신한 기본 정보 값을 이용하여 후술할 제1 추천 리스트를 구성하기 위한 분석 데이터를 획득하는 단계일 수 있다. 한편, 헤어 추천 스타일 및 퍼스널 이미지 스타일은 사용자의 얼굴 이미지를 이용하여 생성될 수 있고, 패션 추 천 스타일은 사용자의 체형 이미지(또는 외형 이미지)를 이용하여 생성될 수 있다. 또한, 앞선 단계(S110)에서 입력받은 서비스를 이용할 이용자의 수가 1명 이상일 경우, 사용자 단말기(미도시)로부터 이용자 모두의 얼굴 이미지 및 외형 이미지를 입력 받을 수 있다. 또한, 복수명의 이용자일 경우, 각 사용자에 대한 각 얼굴 이미지 및 외형 이미지 마다, 헤어 추천 스타일, 퍼스널 이미지 스타일 및 패션 추천 스타일이 생성될 수 있다. 헤어 추천 스타일은 제1 얼굴분석 데이터를 이용하여 사용자에게 추천하는 적어도 하나 이상의 헤어 스타일을 포함할 수 있다. 이때, 제1 얼굴분석 데이터는 이용자의 얼굴 형태, 눈 형태, 입 형태, 이목구비 형태, 얼굴 이 목구비 비율 및 목 형태 중 적어도 하나를 포함할 수 있다. 퍼스널 이미지 스타일은 제2 얼굴분석 데이터를 이용하여 사용자에게 맞는 메이크업 방식(메이크업 색조, 메이 크업 방법 등)을 포함할 수 있다. 이때, 제2 얼굴분석 데이터는 이용자의 머리의 색, 피부 색, 눈썹의 형태, 눈 의 크기, 얼굴 이목구비 비율 중 적어도 하나를 포함할 수 있다. 패션 추천 스타일은 체형분석 데이터를 이용하여 사용자에게 추천하는 적어도 하나 이상의 패션 스타일을 포함 할 수 있다. 이때, 체형분석 데이터는 이용자의 체형, 어깨 형태, 상체 형태, 하체 형태, 팔 길이, 신체 비율, 키, 몸무게 중 적어도 하나를 포함할 수 있다. 이러한 헤어 추천 스타일, 퍼스널 이미지 스타일 및 패션 추천 스타일은 각각 얼굴 분석 모델, 퍼스널 분석 모 델 및 외형 분석 모델을 이용하여 생성될 수 있으며, 자세한 내용은 후술한다. 한편, 제1 얼굴분석 데이터는 프로세서에 의해 입력 받은 사용자 얼굴 이미지를 기초로 제1 추출 모델을 통 해 획득될 수 있다. 이때, 제1 추출 모델은 사용자의 외형을 포함하는 이미지 데이터(사용자 얼굴 이미지)가 입 력되면 적어도 하나의 제1 얼굴분석 데이터를 출력하도록 학습되거나 구성된 알고리즘, 뉴럴 네트워크 모델 및/ 또는 기계학습 모델일 수 있다. 예를 들어, 제1 추출 모델은 얼굴 이미지가 입력되면, 얼굴 형태, 눈 형태, 이 목구비 형태, 얼굴 이목구비 비율 및/또는 목 형태에 대한 데이터를 추출하도록 학습되거나 구성된 알고리즘 및 /또는 인공지능 모델일 수 있다. 또한, 앞선 단계(S110)에서 입력 받은 얼굴 이미지에서 제1 얼굴분석 데이터를 추출할 수 없는 경우 또는 얼굴 이미지에 사람이 포함되어 있지 않은 경우, 서버는 사용자 단말(미도시)로 얼굴 이미지를 재입력 및/또는 재촬영에 대한 안내 메시지를 전송할 수 있다. 헤어 추천 스타일은 앞선 제1 추출 모델로부터 추출된 제1 얼굴분석 데이터를 활용하여, 사용자에게 맞춤형으로 생성되는 추천 헤어스타일이 포함된 리포트정보일 수 있다. 구체적으로, 본 개시의 서버는 상기 제1 얼굴분석 데이터에 제1 기본정보 및 제2 기본정보를 결합하여 제1 입력 데이터를 생성할 수 있다. 즉, 본 개시의 서버 는 얼굴 형태, 눈 형태, 이목구비 형태, 얼굴 이목구비 비율 및 목 형태에 대한 정보에 사용자 수/사용자 간 관계 정보/이용 날짜/이용 지역을 결합한 제1 입력 데이터를 생성할 수 있다. 본 개시의 서버는 제1 입력 데이터를 제1 분석 모델에 입력하여 헤어 추천 스타일을 획득할 수 있다. 이때, 제1 분석 모델은 제1 입력 데이터가 입력되면 리포트 형태의 헤어 추천 스타일을 출력하도록 학습된 알고리즘, 뉴럴 네트워크 모델 및/또는 기계 학습 모델일 수 있다. 제1 분석 모델은 상기 제1 기본정보 및 제2 기본정보의 결합에 의해 변경될 수 있는 사용자의 수에 따른 복수의 입력데이터 set에 대하여 모두 학습된 것일 수 있다. 즉, 동일한 사용자에 대한 동일한 제1 얼굴분석 데이터라고 하더라도, 결합되는 제1 기본정보 및 제2 기본정보 가 결합됨에 따라 상이한 입력 데이터로 생성될 수 있으므로, 출력되는 헤어 추천 스타일이 상이할 수 있다. 본 실시예에 따르면, 본 개시의 예약 방법은 단순히 사용자의 얼굴 이미지를 통한 분석결과로 헤어 스타일을 추 천하는 것이 아닌, 함께하는 사용자의 수, 사용자와의 관계 및 날짜(계절), 지역(산, 바다, 들판 등)까지 고려 한 적절한 헤어 스타일을 추천할 수 있다는 효과가 있다. 제2 얼굴분석 데이터는 프로세서에 의해 입력 받은 사용자 얼굴 이미지를 기초로 제2 추출 모델을 통해 획 득될 수 있다. 이때, 제2 추출 모델은 사용자의 외형을 포함하는 이미지 데이터(얼굴 이미지)로부터 적어도 하 나의 제2 얼굴분석 데이터를 추출하도록 학습되거나 구성된 알고리즘, 뉴럴 네트워크 모델 및/또는 기계학습 모 델일 수 있다. 예를 들어, 제2 추출 모델은 얼굴 이미지가 입력되면, 머리의 색, 피부 색, 눈썹의 형태, 눈의 크기 및/또는 얼굴 이목구비 비율에 대한 데이터를 추출하도록 학습되거나 구성된 알고리즘 및/또는 인공지능 모델일 수 있다. 또한, 앞선 단계(S110)에서 입력 받은 얼굴 이미지에서 제2 얼굴분석 데이터를 추출할 수 없는 경우 또는 얼굴 이미지에 사람이 포함되어 있지 않은 경우, 서버는 사용자 단말(미도시)로 얼굴 이미지를 재입력 및/또는 재촬영에 대한 안내 메시지를 전송할 수 있다. 또한, 퍼스널 이미지 스타일은 제2 추출모델로부터 추출된 제2 얼굴분석 데이터를 활용하여, 사용자에게 맞춤형 으로 생성되는 추천 매이크업 스타일이 포함된 리포트 정보일 수 있다. 구체적으로, 본 개시의 서버는 상기 제2 얼굴분석 데이터에서 제3 기본 정보를 결합하여 제2 입력 데이터를 생성할 수 있다. 즉, 본 개시의 서버 는 머리의 색, 피부 색, 눈썹의 형태, 눈의 크키 및/또는 얼굴 이목구비 비율에 대한 정보에 사용자 얼굴 이미지/사용자 외형 이미지/사용자 키를 결합한 제2 입력 데이터를 생성할 수 있다. 본 개시의 서버는 제2 입력 데이터를 제2 분석 모델에 입력하여 퍼스널 이미지 스타일을 획득할 수 있다. 이때, 제2 분석 모델은 제2 입력 데이터가 입력되면 리포트 형태의 퍼스널 이미지 스타일을 출력하도록 학습된 알고리즘, 뉴럴 네트워크 모델 및/또는 기계 학습 모델일 수 있다. 제2 분석 모델은 상기 제1 기본정보 및 제3 기본정보의 결합에 의해 변경될 수 있는 복수의 입력데이터 set에 대하여 모두 학습된 것일 수 있다. 즉, 동일한 사용자에 대한 동일한 제2 얼굴분석 데이터라고 하더라도, 결합되는 제3 기본 정보가 결합됨에 따라 상이한 입력 데이터로 생성될 수 있으므로, 출력되는 퍼스널 이미지 스타일이 상이할 수 있다. 본 실시예에 따르면, 본 개시의 예약 방법은 종래 기술과 같이 단순히 사용자의 얼굴 이미지를 통한 분석결과로 퍼스널 이미지를 추천하는 것이 아닌, 사용자의 체형, 사용자의 키 및 몸무게를 고려하여 최적의 메이크업 방식 등의 퍼스널 이미지 스타일을 추천할 수 있다는 효과가 있다. 체형 분석 데이터는 프로세서에 의해 입력 받은 사용자의 외형 이미지를 기초로 제3 추출 모델을 통해 획득 될 수 있다. 이때, 제3 추출 모델은 사용자의 외형을 포함하는 외형 이미지(사용자 외형 이미지)가 입력되면 적 어도 하나의 체형 분석 데이터를 출력하도록 학습되거나 구성된 알고리즘, 뉴럴 네트워크 모델 및/또는 기계학 습 모델일 수 있다. 예를 들어, 제3 추출 모델은 외형 이미지가 입력되면, 체형, 어깨 형태, 상체 형태, 하체 형태, 팔 길이 및 또는 신체 비율에 대한 데이터를 추출하도록 학습되거나 구성된 알고리즘 및/또는 인공지능 모델일 수 있다. 또한, 앞선 단계(S110)에서 입력 받은 외형 이미지에서 체형 분석 데이터를 추출할 수 없는 경 우, 외형 이미지에 사람이 포함되어 있지 않은 경우, 서버는 사용자 단말(미도시)로 외형 이미지를 재입력 및/또는 재촬영에 대한 안내 메시지를 전송할 수 있다. 패션 추천 스타일은 앞선 제3 추출 모델로부터 추출된 체형 분석 데이터를 활용하여, 사용자에게 맞춤형으로 생 성되는 패션 추천 스타일이 포함된 리포트 정보일 수 있다. 구체적으로, 본 개시의 서버는 체형 분석 데이 터에 제1 기본정보, 제2 기본정보 및 제3 정보를 결합하여 제3 입력데이터를 생성할 수 있다. 즉, 본 개시의 서 버는 체형, 어깨 형태, 상체 형태, 상체 형태, 하체 형태, 팔 길이, 신체 비율, 키 및/또는 몸무게에 대한 정보에 사용자 수/사용자 간 관계 정보/이용 날짜/이용 지역/서비스 이용 목적/사용자 각각의 얼굴 이미지/사용자 각각의 외형 이미지/사용자 각각의 키를 결합한 제3 입력 데이터를 생성할 수 있다. 본 개시의 서버는 제3 입력 데이터를 제3 분석 모델에 입력하여 패션 추천 스타일을 획득할 수 있다. 이때, 제3 분석 모델은 제3 입력 데이터가 입력되면 리포트 형태의 패션 추천 스타일을 출력하도록 학습된 알고리즘, 뉴럴 네트워크 모델 및/또는 기계 학습 모델일 수 있다. 제3 분석 모델은 상기 제1 기본정보 내지 제3 기본정보 의 결합에 의해 변경될 수 있는 사용자의 수에 따른 복수의 입력데이터 set에 대하여 모두 학습된 것일 수 있다. 즉, 동일한 사용자에 대한 동일한 체형 분석 데이터라고 하더라도, 결합되는 제1 기본정보 내지 제3 기본정보가 결합됨에 따라 상이한 입력 데이터라로 생성될 수 있으므로, 출력되는 패션 추천 스타일이 상이할 수 있다. 본 실시예에 따르면, 본 개시의 예약 방법은 단순히 사용자의 외형 이미지를 통한 분석 결과로 패션 스타일을 추천하는 것이 아닌, 함께하는 사용자와의 관계 및 날짜(계절), 지역(산, 바다, 들판 등), 사용자의 키, 체형 등 까지 고려한 적절한 패션 스타일을 추천할 수 있다는 효과가 있다. 제1 추천 리스트를 출력하는 단계(S130)는 앞선 단계(110,120)에서 입력/획득/출력된 정보를 이용하여 사용자에 게 잘 어울리는 메이크업, 헤어, 패션에 대한 정보를 제공하고, 제2 기본정보에 기초하여 출력된 추천 장소 및 추천 장소에서 서비스 예약이 가능한 전문가 리스트를 출력하는 단계이다. 제1 추천리스트에는 앞선 단계(S120)에서 생성된 헤어 추천 스타일, 퍼스널 이미지 스타일 및 패션 추천 스타일 이 포함될 수 있다. 또한, 제1 추천리스트에는 제2 기본 정보에 대응하는 장소를 포함하는 장소 리스트가 포함 될 수 있으며, 해당 장소 리스트에서 서비스를 제공할 수 있는 전문가 리스트도 포함될 수 있다. 제1 추천 리스트에는 이용 목적 및/또는 날짜에 대응하는 장소 리스트가 포함될 수 있는데, 장소 리스트는 목적 에 따른 목적 별 추천 장소 리스트와 날짜에 따른 계절 별 추천 장소 리스트 중에서 겹치는 장소를 포함할 수 있다. 예를 들어, 목적에 따른 장소가 'A 공원', 'B 유원지', 'C 대공원'이고, 계절에 따른 장소가 'B 유원지', 'C 대공원', 'Y 유적지'라고 한다면, 장소 리스트는 목적별 추천 리스트와 계졀 별 추천 장소 리스트 모두에 포 함되는 'C 대공원'과 'B 유원지'로 이루어질 수 있다. 즉, 제1 추천리스트에 제공되는 장소의 리스트는 앞선 단 계(S110)에서 입력 받은 정보(목적/날짜)들을 모두 충족한 장소의 리스트만 제공 될 수 있다. 제1 추천 리스트에는 장소 리스트의 장소들 중 전문가의 활동 범위가 대응되고 헤어 추천 스타일에 대응하는 헤 어 스타일리스트(헤어 전문가)의 리스트가 포함할 수 있다. 헤어 전문가들은 활동할 수 있는 범위가 한정적일 수 있다. 왜냐하면 헤어를 손질/스타일링 하기위해서는 헤어 드라이어와 같은 전기가전이 필요할 수 있기 때문 에 헤어 전문가는 전문가의 샵에서 가까운 지역 외에는 출장을 가지 않을 수 있다. 따라서, 헤어 전문가는 활동 범위가 좁기 때문에 장소 리스트에 포함되는 장소들이 전문가의 샵에서 거리가 가깝거나 이동이 편리한 곳에서 만 이용이 가능할 수 있기 때문에 제1 추천 리스트에 포함된 장소가 헤어 스타일리스트의 활동반경이 아닌 경우 에는 이용이 제한 될 수 있다. 따라서, 제1 추천 리스트에 포함된 헤어 전문가 리스트는 장소 리스트의 각기 다 른 장소에서 직선거리 기준으로, 가장 가까운 헤어 전문가부터 목록이 정렬 될 수 있다. 즉, 사용자 단말기(미 도시)는 장소 리스트에 포함된 장소마다 직선거리로 가까운 헤어 전문가 리스트를 수신 받을 수 있다. 제1 추천 리스트에는 장소 리스트의 장소들 중 활동 범위가 대응하고 메이크업 추천 스타일에 대응하는 메이크 업 아티스트(메이크업 전문가)의 리스트를 포함 할 수 있다. 메이크업 전문가의 활동범위는 한정 적일 수 있다. 왜냐하면, 촬영 장소로 이동중에 부주의로 인하여 메이크업이 지워지는 것 또는 피부 유분에 의하며 메이크업이 지워질 수 있다. 따라서, 메이크업을 받는 사용자의 이동거리를 줄이기 위하여, 메이크업 전문가의 활동 범위도 한정적일 수 있다. 또한, 메이크업 전문가에 대한 정보에는 출장 가능 여부에 대한 정보도 포함될 수 있다. 즉, 제1 추천리스트에 포함된 메이크업 전문가리스트에는 활동범위에 해당하는 메이크업 전문가와 장소와 관계없이 출장이 가능한 메이크업 아티스트도 포함될 수 있다. 이때, 제1 추천 리스트에 포함된 메이크업 전문가리스트는 장소 리스트의 각기 다른 장소에서 직선 거리 기준으로, 가장 가까운 메이크업 전문가부터 목록이 정렬되어 출 력될 수 있다. 제1 추천 리스트에는 장소 리스트의 장소들 중 활동 범위가 대응하고 패션 추천 스타일에 대응하는 패션 스타일 리스트(패션 전문가)의 리스트를 포함할 수 있다. 이때, 패션 전문가에 대한 정보에는 택배 전달 여부가 포함 될 수 있다. 즉, 제1 추천 리스트에 포함되는 패션 전문가 리스트에는 패션 전문가의 활동 범위에 대응하는 패 션 전문가 리스트뿐만 아니라, 위치와 상관없이 옷을 택배로 전달 할 수 있는 패션 전문가 리스트도 포함될 수 있다. 제1 추천 리스트에는 장소 리스트의 장소들 중 활동 범위가 대응하는 사진 작가(사진 전문가)의 리스트를 포함 할 수 있다. 예를 들어, KIM 사진 작가의 활동 범위는 '서울 - 잠실'이라고 한정이 되어 있는데, 서비스 이용자 를 통하여 입력 받은 촬영 장소가 '서울 - 잠실'이면, 해당 서비스 이용자에게 출력할 제1 추천 리스트 중 사진 전문가 리스트에서 KIM 사진 작가가 포함되어 있을 수 있다. 하지만, 서비스 이용자를 통하여 입력 받은 촬영 장소가 '서울 - 성동구'라면 해당 서비스 이용자에게 출력할 제1 추천 리스트 중 사진 전문가 리스트에는 KIM 사진 작가가 포함되어 있지 않을 수 있다. 즉, 전문가 단말기(미도시)를 통하여 기 입력 받은 각 전문가마다의 활동 범위에 따라 사진 작가의 리스트에 포함되는 사진 작가의 목록이 변경될 수 있다. 또한, 모든 전문가들은 전문가 단말기(미도시)를 이용하여 서비스가 가능한 날짜와 불가능한 날짜에 대하여 설 정할 수 있다. 즉, 사용자(이용자)가 예약이 가능한 날짜에 대해서도 기 설정할 수 있다. 따라서, 사용자 단말 기(미도시)로부터 입력 받은 날짜가 전문가의 서비스 제공 가능 날짜와 동일한 경우에만 제1 추천 리스트에 해 당 전문가만 제1 추천 리스트에 포함될 수 있다. 선택 작가 리스트를 수신 받는 단계(S140)은 앞선 단계(S130)에서 송신한 제1 추천 리스트에 대하여, 사용자 단 말기(미도시)로부터 제1 추천 리스트에 포함되어 있던 각 카테고리별 작가 들 중에서 선택된 작가 리스트를 수 신 받는 단계이다. 이때, 선택 작가 리스트가 수신되면 사용자 단말기(미도시)로 선택 작가 리스트에 포함된 작 가와 사용자를 연결될 수 있도록 사용자 단말기(미도시)와 전문가 단말기(미도시)가 서버를 통하여 통신할 수 있다. 이에 대한 구체적인 내용은 후술하기로 한다. 이하에서는 도 3을 이용하여 제1 추천 리스트에 대해서 설명하기로 한다. 도 3은 본 개시의 일 실시예에 따라 헤어 추천 스타일링, 퍼스널 이미지 스타일 및 패션 추천 스타일링을 도시 화한 도면이고, 도 4는 본 개시의 일 실시예에 따라 추천 장소와 추천 장소와 활동범위가 대응되는 헤어/메이크 업/옷/사진 전문가 리스트를 도시화한 도면이다. 이하 본 명세서는, 도 1 내지 도 2를 참조하여 설명될 수 있다. 분석데이터를 연산하는 단계(S120)에서 앞선 단계(S110)에서 입력 받은 얼굴 이미지 및 외형 이미지로부터 헤어 추천 스타일링(300-a), 퍼스널 이미지 스타일(300-b), 패션 추천 스타일(300-c)을 생성할 수 있다."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "헤어 추천 스타일링(300-a)에는 입력 받은 얼굴 이미지 및 추천하는 스타일링 요약 및 적어도 하나 이상의 헤어 추천 팁이 포함되어 있을 수 있다. 이때, 헤어 추천 스타일링(300-a)은 앞선 단계(S110)에서 입력 받 은 얼굴 이미지로부터 얼굴 형태, 눈 형태, 입 형태, 이목구비 형태 및 목 형태 중 적어도 하나를 얼굴 분석 모 델을 이용하여 얼굴 이미지의 장점을 부각시키고 단점을 가릴 수 있는 헤어 스타일링을 포함할 수 있다. 또한, 헤어 추천 팁은 얼굴 분석 모델로부터 생성되는 추천 스타일링마다 RAM에 기 저장되어 있는 추천 멘 트일 수 있다."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "퍼스널 이미지 스타일링(300-b)은 입력 받는 얼굴 이미지 및 추천 스타일링 요약 및 적어도 하나 이상의 퍼스널 추천 팁이 포함되어 있을 수 있다. 이때, 퍼스널 이미지 스타일링(300-b)은 앞선 단계(S110)에서 입력 받은 얼굴 이미지로부터 머리의 색, 피부 색, 눈썹의 형태, 눈의 크기, 얼굴 이목구비 비율 중 적어도 하 나를 퍼스널 분석 모델을 이용하여 얼굴 이미지의 장점을 잘 살릴 수 있는 메이크업 팁 또는 의상 추천 색을 포 함한 다양한 스타일링을 포함할 수 있다. 또한, 퍼스널 추천 팁은 퍼스널 분석 모델로부터 생성되는 추천 스타일링마다 RAM에 기 저장되어 있는 추천 멘트 일 수 있다."}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "패션 추천 스타일링(300-c)은 입력 받은 외형 이미지 및 추천 스타일링 요약 및 적어도 하나 이상의 패션 추천 팁이 포함되어 있을 수 있다. 이때, 패션 추천 스타일링(300-c)은 앞선 단계(S110)에서 입력 받은 외 형 이미지로부터 체형, 어깨 형태, 상체 형태, 하체 형태, 팔 길이, 신체 비율, 키, 몸무게 중 적어도 하나를 외형 분석 모델을 이용하여 체형의 단점을 가리고 장점이 드러날 수 있는 다양한 스타일링을 포함할 수 있다. 이때, 패션 추천 팁은 외형 분석 모델로부터 생성되는 추천 스타일링 마다 RAM에 기 저장되어 있는 추천 멘트일 수 있다. 이때, 얼굴 분석 모델, 퍼스널 분석 모델 및 외형 분석 모델은 프로세서에 의해 입력 받은 얼굴/외형 이미 지에서 제1 얼굴분석 데이터, 제2 얼굴분석 데이터 및 체형분석 데이터를 추출하도록 학습되거나 구성된 알고리 즘, 뉴럴 네트워크 모델 및/또는 기계 학습모델일 수 있다. 이때, 추출된 제1 얼굴분석 데이터, 제2 얼굴분석 데이터 및 체형분석 데이터는 사용자의 장점을 잘 드러낼 수 있고, 단점을 감출 수 있는 다양한 분석 팁을 제공 해 줄 수 있는 헤어 추천 팁, 퍼스널 추천 팁 및 패션 추천 팁을 생성할 수 있는 정보가 될 수 있다. 이하에서는 도 4를 이용하여 제1 추천 리스트에 대해서 설명하기로 한다. 도 4는 본 개시의 일 실시예에 따라 추천 장소와 추천 장소와 활동범위가 대응되는 헤어/메이크업/옷/사진 전문 가 리스트를 도시화한 도면이다. 이하 본 명세서는, 도 1 내지 도 2를 참조하여 설명될 수 있다. 제1 추천리스트에는 앞선 단계(S110)에서 입력 받은 서비스 이용 목적 및/또는 날짜에 대응하는 장소를 포함하 는 장소 리스트(400-a)가 포함될 수 있으며, 해당 장소 리스트에서 서비스를 제공할 수 있는 전문가 리스트 (400-b,400-c,400-d)도 포함될 수 있다. 제1 추천 리스트에는 이용 목적 및/또는 날짜에 대응하는 장소 리스트(400-a)가 포함될 수 있는데, 장소 리스트 는 목적에 따른 목적 별 추천 장소 리스트와 날짜에 따른 계절 별 추천 장소 리스트 중에서 겹치는 장소를 포함 할 수 있다. 예를 들어, '우정'이라는 목적과 '제주도-제주시'위치 및 '2023-MM-DD-여름'이라는 목적/장소/날짜(계절) 로 앞선 단계(S110)에서 입력 받으면 프로세서은 입력 받은 위치에 대한 기 저장되어 있는 장소 들 중에서 '우정'이라는 목적에 대응되는 장소와 '2023-MM-DD-여름'에 대응되는 장소를 모두 출력할 수 있다. 이때, 목적 에 따른 장소가 'XX 목장', 'YY오름', 'OO 공원'및 'UU 바다'이고, 계절에 따른 장소가 'XX 목장', 'YY오름', 'OO 공원'및 'TT 해수욕장'이라고 한다면, 장소 리스트는 목적별 추천 리스트와 날짜/계절 별 추천 장소 리스트 모두에 포함되는 ‘XX 목장', 'YY오름'및'OO 공원'으로 이루어질 수 있다. 즉, 제1 추천리스트에 제공되는 장소 의 리스트는 앞선 단계(S110)에서 입력 제2 기본정보를 모두 충족한 장소의 리스트만 제공 될 수 있다. 또한, 제1 추천 리스트는 장소 리스트의 장소마다의 추천 전문가 리스트(400-b, 400-c, 400-d, 400-e)를 포함할 수 있다. 이때, 추천 전문가는 전문 카테고리마다 구성되어 헤어 전문가 리스트(400-b), 메이크업 전문 가 리스트(400-c), 의상 전문가 리스트(400-d) 및 사진 전문가 리스트(400-e)를 포함하여 구성될 수 있다. 헤어 전문가 리스트(400-b)는 장소 리스트의 장소마다 각기 다르게 출력될 수 있다. 또한, 헤어 전문 가 리스트(400-b)는 앞선 단계(S110)에서 입력 받은 서비스 이용 날짜에 이용 가능한(예약 가능한) 전문가 중에 서 장소에서 직선거리로 가장 가까운 전문가 순으로 정렬되어 출력될 수 있다. 더욱 구체적으로, 장소 별 헤어 전문가 리스트는 적어도 하나 이상의 전문가로 구성될 수 있으며, 헤어 전문가 샵(전문가 명,422-1), 이용 후기 별점(422-2), 장소-전문가 직선거리(422-3) 및 헤어 전문가 소개 멘트를 포함할 수 있다. 이때, 헤어 전문가 소개 멘트는 전문가 단말기(미도시)로부터 입력 받아 RAM에 기 저장되어 있는 정보일 수 있다. 전 문가 위치는 각 전문가 단말기(미도시)로부터 입력 받아 RAM에 기 저장되고, 장소-전문가 직선거리(422- 3)가 프로세서에 의해 장소별로 전문가 위치와 직선거리를 연산될 수 있다. 메이크업 전문가 리스트(400-c)는 장소 리스트의 장소마다 각기 다르게 출력될 수 있다. 또한, 메이 크업 전문가 리스트(400-c)는 앞선 단계(S110)에서 입력 받은 서비스 이용 날짜에 이용 가능한(예약 가능한) 전 문가 중에서 장소에서 직선거리로 가장 가까운 전문가 순으로 정렬되어 출력될 수 있다. 더욱 구체적으로, 장소 별 메이크업 전문가 리스트는 적어도 하나 이상의 전문가로 구성될 수 있으며, 메이크업 전문가 샵 (전문가 명,432-1), 이용 후기 별점(432-2), 장소-전문가 직선거리(432-3) 및 메이크업 전문가 소개 멘트를 포 함할 수 있다. 이때, 메이크업 전문가 소개 멘트는 각 메이크업 전문가 단말기(미도시)로부터 입력 받아 RAM에 기 저장되어 있는 정보일 수 있다. 전문가 위치는 전문가 단말기(미도시)로부터 입력 받아 RAM(20 0)에 기 저장되고, 장소-전문가 직선거리(432-3)가 프로세서에 의해 장소별로 전문가 위치와 직선거리를 연산될 수 있다. 패션 전문가 리스트(400-d)는 장소 리스트의 장소마다 각기 다르게 출력될 수 있다. 또한, 패션 전문 가 리스트(400-d)는 앞선 단계(S110)에서 입력 받은 서비스 이용 날짜에 이용 가능한(예약 가능한) 전문가 중에 서 장소에서 직선거리로 가장 가까운 전문가 순으로 정렬되어 출력될 수 있다. 더욱 구체적으로, 장소 별 패션 전문가 리스트는 적어도 하나 이상의 전문가로 구성될 수 있으며, 패션 전문가 샵(또는 전문가 명,434-1), 이용 후기 별점(442-2), 장소-전문가 직선거리(432-3) 및 패션 전문가 소개 멘트를 포함할 수 있다. 이때, 패션 전문가 소개 멘트는 각 메이크업 전문가 단말기(미도시)로부터 입력 받아 RAM에 기 저장되어 있는 정보일 수 있다. 전문가 위치는 전문가 단말기(미도시)로부터 입력 받아 RAM에 기 저장되고, 장소-전 문가 직선거리(432-3)가 프로세서에 의해 장소별로 전문가 위치와 직선거리를 연산될 수 있다. 이때, 패션 전문가는 의상 대여에 대해 택배가 가능할 경우 직선거리는 0km로 설정될 수 있다(442-3). 사진 전문가 리스트(400-e)는 장소 리스트의 장소마다 각기 다르게 출력 될 수 있다. 또한 사진 전문 가 리스트(400-e)는 앞선 단계(S110)에서 입력 받은 서비스 이용 날짜에 이용이 가능한(예약이 가능한) 전문가중에서 장소에서 직선 거리로 가장 가까운 전문가 순으로 정렬되어 출력 될 수 있다. 더욱 구체적으로, 장 소 별 사진 전문가 리스트는 적어도 한 명 이상의 전문가로 구성 될 수 있으며, 사진 전문가 명(452-1), 이용후기(452-2), 장소-전문가 직선거리(452-3), 사진 전문가 소개 멘트 및 작가 포트폴리오(452-4)를 포함할 수 있다. 이때, 사진 전문가 소개 멘트는 각 사진 전문가 단말기(미도시)로부터 입력 받아 RAM에 기 저장 되어 있는 정보 일 수 있다. 전문가 위치는 전문가 단말기(미도시)로부터 입력 받아 RAM에 기 저장되고, 장소-전문가 직선거리(432-3)가 프로세서에 의해 장소별로 전문가 위치와 직선거리를 연산될 수 있다. 작 가 포트폴리오(452-4)는 적어도 한장 이상의 사진으로 구성 될 수 있으며, 본인의 이전 사진 작업물을 전문가 단말기(미도시)를 이용하여 미리 업로드하고, RAM에 기 저장되어 있는 정보 일 수 있다. 이하에서는 도 5 내지 도6을 이용하여 사용자 단말기(미도시)와 전문가 단말기(미도시)가 통신하는 본 발명의 일실시예에 대해 설명하기로 한다. 도5는 사용자 단말기와 전문가 단말기와의 연결을 도시화한 블록도이고, 도6은 본 발명의 일실시예에 따라 사용 자 단말기와 복수의 전문가 단말기가 서로 정보를 주고 받는 과정에 대하여 도시화한 도면이다. 이하 본 명세서는 도1 내지 도4를 참조하여 설명될 수 있다. 서버, 사용자 단말 및 복수개의 전문가 단말(30-n)은 네트워크 망을 통하여 정보를 주고 받을 수 있다. 이때, 복수개의 전문가 단말(30-n)과 사용자 단말는 네트워크 망으로 연결되어 있으나, 직접적으로 정보를 주고 받지 못하나, 서버을 이용하여 서로 정보를 전달 받을 수 있다. 구체적으로 사용자 단말는 전문가 단말(30-n)에 전송하고자 하는 내용을 네트워크 망을 통하여 서버에 전달하면 서버에서 이를 받고 전문 가 단말(30-n)로 전달하는 방식으로 직접적으로 연결이 아닌 네트워크 망 및 서버를 이용하여 직간접적으로 정 보를 주고 받을 수 있다. 하지만, 설명을 위해 정보를 주고 받는 주체는 사용자 단말과 복수개의 전문가 단 말(30-n)으로 지정되어 설명 될 수 있다. 사용자 단말에서는 복수개의 전문가 단말(30-n)과 전문가 분야에 맞는 컨셉 및 디자인 등에 대한 정보를 주 고 받을 수 있다. 또한, 전문가 단말(30-n)에서 사용자 단말로 전송한 정보는 다른 전문가 단말(30-n)에서 확인할 수 없도록 차단 될 수 있다. 즉, 복수개의 전문가 단말(30-n)과 수신자 단말이 송수신한 정보는 수 신자 단말에서 모두 확인이 가능하지만, 전문가 단말(30-1)에서 수신자 단말으로 송/수신한 정보는 전 문가 단말(30-2)에서는 확인할 수 없다. 예시를 들어 설명을 하면, 사용자 단말에서는 복수개의 전문가 단말(30-n)과 주고 받은 정보에 대해서 한눈 에 확인할 수 있다(600-a). 하지만 전문가 단말(30-n)에서는 직접 전달/수신 받은 정보 외에는 차단될 수 있다. 사용자 단말에는 사진 전문가와 나눈 정보 내용(611,612)를 확인할 수 있으며, 사진 전문가 단말(미도시)에 서는 상기 정보(611,612) 외 정보는 차단되어 나타내질 수 있다(600-b). 메이크업 전문가 단말(미도시)를 통해 사용자 단말로 전송된 정보과 사용자 단말에서 메이크업 전문가 단말(미도시)로 전달된 정보(61 5)는 메이크업 전문가 단말(미도시)에서만 확인이 가능하다(600-c). 하지만, 사진 전문가 단말(미도시)에서는 확인이 불가능한 것을 알 수 있다(600-b). 헤어 전문가 단말(미도시)로부터 사용자 단말으로 전달된 정보 는 사용자 단말 및 메이크업 전문가 단말(미도시)에서는 확인이 가능하다(600-a, 600-d). 하지만, 메 이크업 전문가 단말(미도시)에서 전달된 정보는 메이크업 전문가 단말(미도시)가 아니면 차단되어 확인할 수 없다(600-b,600-c). 이상에서와 같이 도면과 명세서에서 예시적인 실시예들이 개시되었다. 본 명세서에서 특정한 용어를 사용하여 실시예들을 설명되었으나, 이는 단지 본 개시의 기술적 사상을 설명하기 위한 목적에서 사용된 것이지 의미 한"}
{"patent_id": "10-2023-0128134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "정이나 특허청구범위에 기재된 본 개시의 범위를 제한하기 위하여 사용된 것은 아니다. 그러므로 본 기술분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라 서, 본 개시의 진정한 기술적 보호범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2023-0128134", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시예에 따른 서버의 구성을 도시화한 블록도이다. 도 2는 본 개시의 실시예에 따른 통합 사진 작가 예약 방법을 도시한 흐름도이다. 도 3은 본 개시의 일 실시예에 따라 헤어 추천 스타일링, 퍼스널 이미지 스타일 및 패션 추천 스타일링을 도시 화한 도면이다. 도 4는 본 개시의 일 실시예에 따라 추천 장소와 추천 장소와 활동범위가 대응되는 헤어/메이크업/옷/사진 전문 가 리스트를 도시화한 도면이다. 도 5는 본 개시의 실시예에 따른 사용자 단말기와 전문가 단말기와의 연결을 도시화한 블록도이다. 도 6은 본 개시의 일실시예에 따라 사용자 단말기와 복수의 전문가 단말기가 서로 정보를 주고 받는 과정에 대 하여 도시화한 도면이다."}
