{"patent_id": "10-2023-0020765", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0127703", "출원번호": "10-2023-0020765", "발명의 명칭": "인공지능 기반 놀이시설용 터치 및 태그 시스템, 및 인공지능 기반 최적의 게임 패턴 생성 방", "출원인": "주식회사 텐씨엘", "발명자": "손주희"}}
{"patent_id": "10-2023-0020765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 몸에 착용되는 RFID(radio frequency identification)를 이용하는 태그;RFID 안테나 및 영상을 표시하는 디스플레이를 포함하고, 상기 RFID 안테나를 통해 상기 태그의 태그 식별 코드를 포함하는 태그 정보를 수신하는 태그 리더기;영상을 표시하는 디스플레이를 포함하고, 사용자의 터치를 인식하여 사용자의 터치를 상기 디스플레이에 표시하는 복수의 터치 패널;상기 사용자의 위치를 파악하는 카메라; 및상기 태그 리더기에 태깅된 태그 정보를 기초로 상기 사용자를 구별하고, 상기 복수의 터치 패널에 표시되는 영상을 독립적으로 제어하고, 상기 사용자의 터치 패널 터치 또는 상기 태그 리더기의 태깅에 따라 획득한 점수를각 사용자별로 누적시키고, 상기 카메라를 통해 얻은 상기 사용자의 위치를 고려하여 상기 복수의 터치 패널에인공지능 기반의 맞춤 패턴을 출력하는 중앙 서버;를 포함하는 인공지능 기반 놀이시설용 터치 및 태그 시스템."}
{"patent_id": "10-2023-0020765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 중앙 서버는 제1 색상을 포함하는 영상을 표시하는 터치 패널을 상기 사용자가 터치하면, 상기 사용자의포인트를 차감시키는 것을 특징으로 하는 인공지능 기반 놀이시설용 터치 및 태그 시스템."}
{"patent_id": "10-2023-0020765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 카메라는 놀이시설 내 사각지대가 없도록 각 벽면의 모서리에 설치되는 것을 특징으로 하는 인공지능 기반놀이시설용 터치 및 태그 시스템."}
{"patent_id": "10-2023-0020765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,패턴을 생성하는 패턴 생성용 단말기;를 더 포함하고,상기 중앙 서버는 상기 패턴 생성용 단말기로부터 수신한 패턴을 상기 복수의 터치 패널에 송신하여 표시하고,상기 패턴을 미리 설정된 카테고리로 분류하여, 인공지능을 통해 반복적으로 지도학습 하는 것을 특징으로 하는인공지능 기반 놀이시설용 터치 및 태그 시스템."}
{"patent_id": "10-2023-0020765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 중앙 서버는 상기 패턴 생성용 단말기로부터 패턴과 함께 패턴의 모양, 패턴의 진행 방향 및 패턴의 진행속도를 포함하는 패턴 정보를 수신하는 것을 특징으로 하는 인공지능 기반 놀이시설용 터치 및 태그 시스템."}
{"patent_id": "10-2023-0020765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 복수의 터치 패널은 놀이 시설의 바닥면에 일정한 간격으로 배치되고,공개특허 10-2024-0127703-3-상기 복수의 태그 리더기는 상기 놀이시설의 벽면에 배치되고,상기 중앙 서버는 상기 사용자가 바닥면에 배치된 제1색상이 표시된 터치 패널을 피하여 상기 벽면에 배치되어점등된 적어도 하나의 태그 리더기를 태깅하면 상기 사용자의 태그에 점수를 누적시키는 것을 특징으로 하는 인공지능 기반 놀이시설용 터치 및 태그 시스템."}
{"patent_id": "10-2023-0020765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "영상을 표시하는 디스플레이를 포함하고, 사용자의 터치를 인식하여 사용자의 터치를 상기 디스플레이에 표시하는 복수의 터치 패널;상기 사용자의 위치를 파악하는 카메라; 패턴을 생성하는 패턴 생성용 단말기; 및상기 복수의 터치 패널에 표시되는 영상을 독립적으로 제어하고, 상기 사용자의 터치 패널 터치에 따라 획득한점수를 각 사용자별로 누적시키고, 상기 카메라를 통해 얻은 상기 사용자의 위치를 고려하여 상기 복수의 터치패널에 인공지능 기반의 맞춤 패턴을 출력하는 중앙 서버;를 포함하는 놀이시설용 터치 시스템을 이용하여,상기 중앙 서버의 인공지능을 학습시킬 샘플 정보를 생성하는 단계;상기 샘플 정보를 바탕으로 상기 인공지능을 학습시키는 단계;학습된 상기 인공지능이 생성하는 상기 맞춤 패턴을 바탕으로 게임을 운영하는 단계; 및게임 운영을 통해 얻은 결과를 상기 중앙 서버에 상기 샘플 정보로 적용하는 단계;를 포함하는 인공지능 기반 최적의 게임 패턴 생성 방법."}
{"patent_id": "10-2023-0020765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 샘플 정보는 사용자의 순위, 태그 성공 횟수, 획득 점수, 플레이 시간, 성공률, 상기 패턴 생성용 단말기를 통해 생성한 상기 패턴 정보 및 상기 카메라를 통해 얻은 사용자의 위치 등을 포함하는 것을 특징으로 하는인공지능 기반 최적의 게임 패턴 생성 방법."}
{"patent_id": "10-2023-0020765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 게임 운영을 하는 단계는인공지능을 통해 상황별 최적의 맞춤 패턴 정보를 생성하는 단계;상기 맞춤 패턴 정보를 바탕으로 사용자에게 맞는 최적의 맞춤 패턴을 선택하는 단계; 및게임 운영을 통해 얻은 결과를 상기 중앙 서버에 저장하는 단계;를 포함하는 인공지능 기반 최적의 게임 패턴 생성 방법."}
{"patent_id": "10-2023-0020765", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기반 놀이시설용 터치 및 태그 시스템은 사용자의 몸에 착용되는 RFID(radio frequency identification)를 이용하는 태그, RFID 안테나 및 영상을 표시하는 디스플레이를 포함하고 상기 RFID 안테나를 통해 태그 정보를 수신하는 태그 리더기, 사용자의 터치를 인식하여 사용자의 터치를 상기 디스플레이에 표시하 는 복수의 터치 패널, 상기 사용자의 위치를 파악하는 카메라, 및 상기 카메라를 통해 얻은 상기 사용자의 위치 를 고려하여 상기 복수의 터치 패널에 인공지능 기반의 맞춤 패턴을 출력하는 중앙 서버를 포함한다."}
{"patent_id": "10-2023-0020765", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 놀이시설용 터치 및 태그 시스템, 및 인공지능 기반 최적의 게임 패턴 생성 방법에 관 한 것으로, 보다 상세하게는 놀이시설에 설치되어, 사용자에게 맞춤 패턴의 놀이를 제공하는 인공지능 기반 놀 이시설용 터치 및 태그 시스템, 및 상기 인공지능 기반 놀이시설용 터치 및 태그 시스템에 이용되는 인공지능 기반 최적의 게임 패턴 생성 방법에 관한 것이다."}
{"patent_id": "10-2023-0020765", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "키즈카페(kids cafe)는 어린이용 놀이시설로, 어린 자녀를 둔 엄마 또는 부모들 또는 일시적으로 어린이를 맡아 서 돌보고 있는 보호자가 부득이한 약속이 있을 때, 보호 중인 어린이를 약속장소에 데리고 나와서 어른들끼리 의 만남을 갖는 한편 어린이는 어린이대로 보호자의 가시권 내에서 자유롭게 놀 수 있도록 실내에 놀이시설을 갖춘 장소를 말한다. 이러한 놀이시설에는, 사출 또는 압출성형으로 규격화된 조립식 미끄럼틀 또는 원통 구조물을 이용한 미끄럼틀 과 사다리구조물 등이 설치된다. 그러나 상기 구조물들은 각각 독립된 상태로 설치되며, 유기적인 연결관계가 없어, 사용자인 어린이들의 흥미도를 끌어올리지 못하고 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-1490293호"}
{"patent_id": "10-2023-0020765", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명의 기술적 과제는 이러한 점에서 착안된 것으로, 본 발명의 목적은 놀이시설에서의 어린이들의 흥 미도를 높이고, 놀이뿐만 아니라, 운동, 교육적인 측면까지 만족시키기 위한 인공지능 기반 놀이시설용 터치 및 태그 시스템을 제공하는 것이다. 예를 들어, 인공지능을 통해 패턴을 파악함에 따라, 다양한 패턴의 놀이를 제 공하는 인공지능 기반 놀이시설용 터치 및 태그 시스템을 제공하는 것이다. 본 발명의 다른 목적은 상기 인공지능 기반 놀이시설용 터치 및 태그 시스템에 이용되는 인공지능 기반 최적의 게임 패턴 생성 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0020765", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 본 발명의 목적을 실현하기 위한 일 실시예에 따른 인공지능 기반 놀이시설용 터치 및 태그 시스템은 사 용자의 몸에 착용되는 RFID(radio frequency identification)를 이용하는 태그, RFID 안테나 및 영상을 표시하 는 디스플레이를 포함하고, 상기 RFID 안테나를 통해 상기 태그의 태그 식별 코드를 포함하는 태그 정보를 수신 하는 태그 리더기, 영상을 표시하는 디스플레이를 포함하고, 사용자의 터치를 인식하여 사용자의 터치를 상기 디스플레이에 표시하는 복수의 터치 패널, 상기 사용자의 위치를 파악하는 카메라, 및 상기 태그 리더기에 태깅 된 태그 정보를 기초로 상기 사용자를 구별하고, 상기 복수의 터치 패널에 표시되는 영상을 독립적으로 제어하 고, 상기 사용자의 터치 패널 터치 또는 상기 태그 리더기의 태깅에 따라 획득한 점수를 각 사용자별로 누적시 키고, 상기 카메라를 통해 얻은 상기 사용자의 위치를 고려하여 상기 복수의 터치 패널에 인공지능 기반의 맞춤 패턴을 출력하는 중앙 서버를 포함한다. 본 발명의 일 실시예에 있어서, 상기 중앙 서버는 제1 색상을 포함하는 영상을 표시하는 터치 패널을 상기 사용 자가 터치하면, 상기 사용자의 포인트를 차감시킬 수 있다. 본 발명의 일 실시예에 있어서, 상기 카메라는 놀이시설 내 사각지대가 없도록 각 벽면의 모서리에 설치될 수 있다. 본 발명의 일 실시예에 있어서, 인공지능 기반 놀이시설용 터치 및 태그 시스템은 패턴을 생성하는 패턴 생성용 단말기를 더 포함하고, 상기 중앙 서버는 상기 패턴 생성용 단말기로부터 수신한 패턴을 상기 복수의 터치 패널 에 송신하여 표시하고, 상기 패턴을 미리 설정된 카테고리로 분류하여, 인공지능을 통해 반복적으로 지도학습 할 수 있다. 본 발명의 일 실시예에 있어서, 상기 중앙 서버는 상기 패턴 생성용 단말기로부터 패턴과 함께 패턴의 모양, 패 턴의 진행 방향 및 패턴의 진행 속도를 포함하는 패턴 정보를 수신할 수 있다. 본 발명의 일 실시예에 있어서, 상기 복수의 터치 패널은 놀이 시설의 바닥면에 일정한 간격으로 배치되고, 상 기 복수의 태그 리더기는 상기 놀이시설의 벽면에 배치되고, 상기 중앙 서버는 상기 사용자가 바닥면에 배치된 제1색상이 표시된 터치 패널을 피하여 상기 벽면에 배치되어 점등된 적어도 하나의 태그 리더기를 태깅하면 상기 사용자의 태그에 점수를 누적시킬 수 있다. 상기한 본 발명의 목적을 실현하기 위한 일 실시예에 따른 인공지능 기반 최적의 게임 패턴 생성 방법은 영상을 표시하는 디스플레이를 포함하고, 사용자의 터치를 인식하여 사용자의 터치를 상기 디스플레이에 표시하는 복수 의 터치 패널, 상기 사용자의 위치를 파악하는 카메라, 패턴을 생성하는 패턴 생성용 단말기, 및 상기 복수의 터치 패널에 표시되는 영상을 독립적으로 제어하고, 상기 사용자의 터치 패널 터치에 따라 획득한 점수를 각 사 용자별로 누적시키고, 상기 카메라를 통해 얻은 상기 사용자의 위치를 고려하여 상기 복수의 터치 패널에 인공 지능 기반의 맞춤 패턴을 출력하는 중앙 서버를 포함하는 놀이시설용 터치 시스템을 이용하여, 상기 중앙 서버 의 인공지능을 학습시킬 샘플 정보를 생성하는 단계, 상기 샘플 정보를 바탕으로 상기 인공지능을 학습시키는 단계, 학습된 상기 인공지능이 생성하는 상기 맞춤 패턴을 바탕으로 게임을 운영하는 단계, 및 게임 운영을 통 해 얻은 결과를 상기 중앙 서버에 상기 샘플 정보로 적용하는 단계를 포함한다. 본 발명의 일 실시예에 있어서, 상기 샘플 정보는 사용자의 순위, 태그 성공 횟수, 획득 점수, 플레이 시간, 성 공률, 상기 패턴 생성용 단말기를 통해 생성한 상기 패턴 정보 및 상기 카메라를 통해 얻은 사용자의 위치 등을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 인공지능 기반 최적의 게임 패턴 생성 방법은 상기 게임 운영을 하는 단계인 인 공지능을 통해 상황별 최적의 맞춤 패턴 정보를 생성하는 단계, 상기 맞춤 패턴 정보를 바탕으로 사용자에게 맞 는 최적의 맞춤 패턴을 선택하는 단계, 및 게임 운영을 통해 얻은 결과를 상기 중앙 서버에 저장하는 단계를 포 함할 수 있다."}
{"patent_id": "10-2023-0020765", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 터치 패널을 터치하는 동작을 포함하는 복수의 게임을 제공할 수 있어, 여러 사 용자가 개별적으로 또는 독립적으로 게임을 참여할 수 있어 어린이들의 흥미도를 높일 수 있다. 뿐만 아니라, 인공지능을 통해 사용자의 능력치에 맞는 다양한 터치 패널의 패턴을 제공함으로써 사용자가 발휘할 수 있는 최 대치의 능력을 끌어올릴 수 있어 어린이들의 흥미를 유발시킬 수 있다. 즉, 인공지능 기반 터치 패널을 이용한 터치, 및 RFID를 이용한 태그 및 태그 리더기를 이용하여, 다양한 방식 의 게임을 진행할 수 있으며, 놀이시설에서의 어린이들의 흥미도를 높이고, 놀이뿐만 아니라, 운동, 교육적인 측면까지 만족시킬 수 있다."}
{"patent_id": "10-2023-0020765", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "다만, 본 발명의 효과는 상기 효과들로 한정되는 것이 아니며, 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위에서 다양하게 확장될 수 있을 것이다."}
{"patent_id": "10-2023-0020765", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면들을 참조하여 본 발명의 바람직한 실시예들을 보다 상세하게 설명하기로 한다. 본 발명은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 본문에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유 사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. \"및/또는\" 이라는 용어는 복수의 관련된 기재된 항목들 의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반 놀이시설용 터치 및 태그 시스템의 개념도이다. 도 1을 참조하면, 상기 인공지능 기반 놀이시설용 터치 및 태그 시스템은, 복수의 태그(TG), 복수의 태그 리더 기, 복수의 터치 패널, 중앙 서버, 메인 디스플레이, 로컬 단말기, 관리용 단말기, 출 입구 제어기, 패턴 생성용 단말기 및 카메라를 포함할 수 있다. 상기 복수의 태그(TG)은 제1 태그(TG1) 및 제2 태그(TG2) 등을 포함할 수 있다. 상기 복수의 태그 리더기은 제1 태그 리더기(10a), 제2 태그 리더기(10b) 및 제3 태그 리더기(10c) 등을 포함할 수 있다. 상기 복수의 터치 패널은 제1 터치 패널(70a) 및 제2 터치 패널(70b) 등을 포함할 수 있다. 상기 제1 태그(TG1)는 제1 사용자가 착용하여 사용할 수 있으며, 상기 제1 태그 식별 코드를 포함하는 태그 정 보를 저장할 수 있다. 상기 제1 태그(TG1)는 RFID(radio frequency identification)를 이용하는 태그로서, RFID 안테나와 칩(Chip)을 포함할 수 있다. 여기서, RFID 태그는 트랜스폰더(transponder)라고도 부르며, 고유 ID나 센서로부터 읽어 들인 데이터를 저장하고 있다가 리더가 요청하면 그 정보를 RFID 방식을 이용하여 전송하 는 장치를 말한다. 상기 칩에는 상기 제1 태그 식별 코드가 저장되고, 상기 태그 리더기는, 상기 제1 태그의 근 접, 즉 태깅(Tagging)을 통해, 상기 제1 태그(TG1)의 태깅 및 상기 제1 태그 식별 코드를 인식할 수 있다. 상기 제2 태그(TG2)는 상기 제1 태그(TG1)의 제1 사용자와 다른 제2 사용자가 착용하여 사용할 수 있으며, 상기 제2 태그(TG2)는 상기 제1 태그(TG1)의 상기 제1 태그 식별 코드와 다른 제2 태그 식별 코드를 포함하는 태그 정보를 저장할 수 있다. 이와 같은 상기 태그(TG)는 놀이시설을 이용하고자 하는 사용자마다 부여되는 것으로, 각 상기 태그(TG)마다 상 이한 식별코드를 포함한다. 다만, 상기 태그(TG)를 이용한 놀이시설 내 팀 게임을 실행이 가능하도록 하기 위하 여 동일한 팀 식별코드가 상기 복수의 사용자 태그(TG)에 포함될 수 있다. 예를 들어, 놀이시설 내 입장한 사용자가 10명이면, 상기 제1 태그(TG1) 내지 상기 제10 태그(TG10)가 상기 태 그 리더기에 태깅 가능한 상태일 수 있다. 이 때, 상기 중앙 서버는 상기 제1 태그(TG1)에 대하여는 빨 강 팀 식별코드를 부여할 수 있고, 상기 제2 태그(TG2)에 대하여는 파랑 팀 식별코드를 부여할 수 있다. 구체적 으로, 상기 중앙 서버는 각 팀이 동일한 사용자 수를 포함할 수 있도록, 상기 태그(TG)에 각 팀의 식별코드 를 번갈아 부여하는 것이 바람직하다. 즉, 상기 중앙 서버는 상기 제1 태그(TG1), 상기 제3 태그(TG3), 상 기 제5 태그(TG5), 상기 제7 태그(TG7), 및 상기 제9 태그(TG9)에 대하여 빨강 팀 식별코드를 부여하고, 상기 제2 태그(TG2), 상기 제4 태그(TG4), 상기 제6 태그(TG6), 상기 제8 태그(TG8), 및 상기 제10 태그(TG10)에 대 하여 파랑 팀 식별코드를 부여할 수 있다. 각각의 사용자는 자신이 어떤 팀 식별코드를 가졌는지 확인하기 위하여 후술할 상기 로컬 단말기를 통하여 실시간으로 확인할 수 있다. 이러한 팀 식별코드는 놀이시설의 관리자가 후술할 상기 관리용 단말기를 통하여 지정하는 것도 가능하다. 상기 제1 태그 리더기(10a)는 영상을 표시하기 위한 디스플레이, 상기 디스플레이 상에 배치되고, RFID 안테나 가 형성된 안테나 기판, 상기 안테나 기판 상에 배치되는 보호 플레이트, 상기 디스플레이 및 상기 안테나 기판 을 수용하는 수납 용기를 포함한다. 상기 제1 태그 리더기(10a)는 상기 태그(TG1, TG2, TG3)의 태깅을 인식할 수 있다. 구체적으로, 상기 제1 태그 리더기(10a)는 상기 태그(TG)가 상기 제1 태그 리더기(10a)에 근접함에 따 라, 상기 RFID 안테나를 통해 상기 태그(TG)의 태그 식별 코드를 포함하는 태그 정보를 수신하여, 상기 태그 (TG) 각각의 고유의 상기 태그 식별 코드 및 상기 태그(TG)의 태깅 여부를 인식할 수 있다. 예를 들어, 상기 제1 태그 리더기(10a)는 상기 제1 태그(TG1)가 태깅 시 상기 제1 태그(TG1) 고유의 태그 식별 코드를 인식하여 상기 제1 태그(TG1)가 태깅되었음을 상기 제1 태그 리더기(10a)의 디스플레이에 표시할 수 있 다. 마찬가지로, 상기 제1 태그 리더기(10a)는 상기 제2 태그(TG2)가 태깅 시 상기 제2 태그(TG2) 고유의 태그 식별 코드를 인식하여 상기 제2 태그(TG2)가 태깅되었음을 상기 제1 태그 리더기(10a)의 디스플레이에 표시할수 있다. 이러한 상기 복수의 태그 리더기는 서로 이격되어 설치된다. 예를 들어, 상기 제2 태그 리더기(10b)는 상기 제1 태그 리더기(10a)와 이격되어, 놀이시설의 다른 위치에 설치되며, 상기 제1 태그 리더기(10a)와 실질적으로 동일한 구성을 가질 수 있다. 마찬가지로, 상기 제3 태그 리더기(10c)는 상기 제1 및 제2 태그 리더기(10a, 10b)와 이격되어, 상기 놀이시설 의 또 다른 위치에 설치되며, 상기 제1 태그리더기(10a)와 실질적으로 동일한 구성을 가질 수 있다. 이러한 상기 복수의 태그 리더기는 상기 중앙 서버에 의하여 동작이 제어될 수 있다. 예를 들어, 상기 태그 리더기가 포함하는 디스플레이에 표시되는 화면은 상기 중앙 서버에 의하여 제어될 수 있다. 다만, 상기 복수의 태그 리더기는 이격되어 일정한 간격으로 놀이시설의 바닥면에 고정되어 설치될 수 있다. 상기 터치 패널은 상기 복수의 태그 리더기이 아닌 상기 복수의 터치 패널이 도 2에 도시된 바와 같이, 이격되어 일정한 간격으로 놀이시설의 바닥면에 고정되어 설치되는 것도 가능하다. 이 경우, 사용되는 상 기 터치 패널들은 복수개인 것으로 제1 터치 패널(70a), 제2 터치 패널(70b) 등을 포함할 수 있다. 상기 터치 패널은, LCD 또는 LED 등의 디스플레이와 사용자가 밟고 지나갈 때, 사용자의 터치를 인식할 수 있는 센서를 포함할 수 있다. 예를 들면, 감압식 터치 센서, 정전식 터치 센서, 적외선식 터치 센서, 물리적인 스위치 등의 센서와 디스플레이를 조합한 패널을 의미한다. 일 예로, 감압식 터치 센서를 포함하는 상기 터치 패널을 도 2의 바닥면에 이격되어 일정한 간격으로 설치 하면, 사용자가 밟고 지나간 위치의 상기 터치 패널의 화면을 변경하도록 할 수 있으며, 이에 따라 사용자 의 터치가 감지됨을 표시할 수 있다. 또한, 상기 터치 패널은 후술할 상기 중앙 서버의 인공지능이 선택한 사용자의 맞춤 패턴을 표시할 수 있다. 상기 맞춤 패턴으로 진행되어 나온 게임의 결과는 상기 중앙 서버에 다시 송신하여 게임 정보를 저장 할 수 있다. 상기 중앙 서버는 후술할 상기 패턴 생성용 단말기에서 생성한 패턴을 상기 복수의 터치 패널에 송 신할 수 있다. 또한, 상기 중앙 서버는 후술할 상기 관리용 단말기에 저장된 정보를 수신할 수 있다. 수신한 상기 정보를 바탕으로 상기 중앙 서버에서 인공지능을 학습시킨다. 이와 같이, 인공지능을 지도학습 을 시킴으로써, 각 사용자에게 맞춤 난이도를 설정하여 게임을 운영할 수 있다. 게임 운영 방법에 대한 상세한 내용은 도 6에 대한 설명에서 후술한다. 또한, 상기 중앙 서버는 복수의 태그 리더기 및 복수의 터치 패널에 대하여 일반 포인트 획득 리더 기 또는 감점 리더기로서 동작하도록 제어할 수 있다. 일반 포인트 획득 리더기란, 사용자가 태그 리더기에 자신의 태그(TG)를 태깅 성공하면, 해당 태그 리더기에 설정된 포인트가 상기 중앙 서버에 의해 태깅한 상기 태그(TG)에 누적된다. 일반 감점 리더기란, 사용자가 터치 패널을 터치(압력)하는 경우, 해당 터치 패널을 감지함에 따라 포인트(목숨)가 차감되는 것으로 설정할 수 있다. 이를 위하여, 상기 중앙 서버는 상기 복수의 태그 리더기(10a, 10b, 10c) 및 복수의 태그(TG1, TG2, TG3), 복수의 터치 패널(70a, 70b, 70c)과 유선 또는 무선 통신할 수 있다. 예를 들면, 상기 중앙 서버는 통신부 를 포함할 수 있으며, 상기 통신부는 무선 통신을 위한 블루투스(Bluetooth), BLE(Bluetooth Low Energy), WiFi, ZigBee, UWB 등 RF(Radio Frequency) 통신을 이용하여, 중계기(미도시)를 통해, 상기 태그 리더기와 정보를 송수신하거나, 상기 태그 리더기와 직접 통신할 수 있다. 다른 실시예에 있어서, 상기 중앙 서버 는 복수의 WiFi 중계기와 유선 통신하고, 상기 WiFi 중계기가 WiFi를 이용하여 상기 태그 리더기와 무 선 통신하도록 구성할 수도 있을 것이며, 나아가 상기 구성들 간의 유무선 통신 방식은 이에 한정되지 않는다. 상기 중앙 서버는 상기 태그 리더기로부터 상기 태그 정보를 수신하고, 수신된 상기 태그 정보를 이용 하여 태그 성공 여부를 판별할 수 있다. 이에 따라, 상기 중앙 서버는 태그 성공 여부 정보를 생성하고, 상 기 태그 성공 여부 정보를 상기 태그 리더기에 전송할 수 있다. 상기 태그 성공 여부 정보를 수신한 상기 태그 리더기는, 태그 성공인 경우, 태그 성공 이미지를 상기 태그 리더기의 상기 디스플레이에 표시하거나 또는 태그 성공 음원을 재생하도록 하여, 사용자가 태그의 성공 여 부를 손쉽게 확인할 수 있다.상기 메인 디스플레이는 대형 전광판에 해당한다. 상기 메인 디스플레 이는 상기 중앙 서버로부터 각 사용자의 닉네임, 순위, 상기 태그 식별 코드, 태그 성공 횟수, 획득 점수 및 플레이 시간 중 어느 하나 이 상에 대한 정보를 수신하여 표시할 수 있다. 또한, 상기 메인 디스플레이는 후술할 상기 관리용 단말기 등을 통해 관리자에 의해 입력되는 각종 공지 사항, 게임 종료 상황을 포함하는 진행 상황 등 다양한 정보를 표 시할 수 있다. 상기 로컬 단말기는 태그 인식부 및 디스플레이를 포함할 수 있다. 사용자 또는 관리자는, 상기 태그(TG)를 상기 태그 인식부에 태깅(tagging)함에 따라, 해당 사용자의 닉네임, 순위, 태그 식별 코드, 태그 성공 횟수, 획득 점수 및 플레이 시간 중 어느 하나 이상에 대한 정보가 상기 로컬 단말기의 디스플레이에 표시될 수 있으며, 이에 따라, 사용자가 상기 메인 디스플레이를 통하지 않고도, 필요에 따라 필요한 정보들을 확인할 수 있다. 상기 관리용 단말기는 상기 태그(TG)에 상기 태그 식별 코드를 부여하는 태그 입력기를 포함할 수 있다. 상 기 관리용 단말기는 해당 태그의 사용자의 닉네임을 상기 중앙 서버에 저장하고, 상기 중앙 서버의 운영 및 상기 메인 디스플레이의 표시 내용을 제어할 수 있다. 또한, 상기 관리용 단말기에는 인공지능을 학습시킬 정보를 저장할 수 있다. 상기 정보는 사용자의 순위, 태그 성공 횟수, 획득 점수, 플레이 시간 및 성공률 등을 포함할 수 있으며, 상기 관리용 단말기는 상기 중 앙 서버와 상기 정보를 교환할 수 있다. 상기 출입구 제어기는 태그 인식부를 포함할 수 있다. 사용자가 상기 태그(TG)를 상기 태그 인식부에 태깅 (tagging)함에 따라, 상기 출입구 제어기는 사용자의 출입 시간이 확인될 수 있으며, 상기 출입 시간에 관 한 정보를 상기 중앙 서버에 전송하여, 사용자의 플레이 시간을 정산할 수 있다. 상기 패턴 생성용 단말기는 무작위로 게임의 상기 패턴을 생성할 수 있으며, 상기 패턴은 인공지능을 통해 카테고리별로 자동으로 분류될 수 있다. 분류된 상기 패턴은 상기 중앙 서버에 송신하여, 각 사용자의 맞춤 패턴을 선택할 정보를 줄 수 있다. 선택된 맞춤 패턴은 각 사용자의 순위, 태그 성공 횟수, 획득 점수, 플레이 시간 및 성공률 등에 따라 상기 복수의 터치 패널에 표시될 수 있다. 상기 카메라는 사용자의 위치를 파악할 수 있도록 놀이시설 내 각 벽면의 모서리에 설치될 수 있다. 상기 카메라를 통해 얻은 정보는 상기 중앙 서버에 송신하여 인공지능을 학습시킬 데이터에 추가시킬 수 있 다. 상기 카메라 외에 적외선 센서, 열상 카메라 및 레이더를 통해 사용자의 위치를 파악할 수 있으며, 사 용자의 위치를 파악할 수 있는 방법은 이에 한정되지 않는다. 도 2는 도 1의 바닥면에 설치된 시스템의 일부를 구현한 예시도이다. 도 2를 참조하면, 각 벽면에는 복수개의 상기 태그 리더기들이 설치될 수 있다. 제1벽면(100a)과 제2벽면 (100b)에 설치된 복수개의 상기 태그 리더기들을 도시하였으나, 도시되지 않은 상기 제1벽면(100a)과 평행 한 제3벽면(100c), 및 상기 제2벽면(100b)와 평행한 제4벽면(100d)에도 복수개의 상기 태그 리더기들이 설 치될 수 있다. 또한, 각 벽면에 설치되는 복수개의 태그 리더기들의 위치는 도 2에서와 같이, 사용자가 태깅할 수 있도록 개별적이고 독립적인 높이로 설치되는 것도 가능하다. 다만, 도 2와는 달리 동일한 높이에 일정한 간격으로 설 치될 수도 있다. 상기 카메라는 놀이시설 내에 사각지대가 없도록 각 벽면의 모서리에 설치될 수 있다. 상기 카메라를 통해 상기 중앙 서버에서 사용자의 위치를 파악한 후, 알고리즘을 통해 사용자가 몰려 있는 구간을 제외한 상기 터치 패널의 특정한 위치에 패턴을 선정한다. 예를 들어 총 6명의 사용자 중 4명이 상기 터치 패널의 1행에 몰려 있을 경우, 상기 중앙 서버의 인공 지능이 상기 카메라를 통해 사용자의 위치를 파악한 후, 알고리즘으로 판단하여 상기 터치 패널의 1행 을 공격할 수 있도록 3행에 패턴을 생성한다. 도 3은 본 발명의 일 실시예에 따른 인공지능 기반 사용자에게 맞춤 패턴을 제공하는 방법을 설명하는 개략도이 다. 도 4는 도 3의 MLP 구조를 나타낸 도면이다. 도 3을 참조하면, 상기 인공지능 기반 사용자에게 맞춤 패턴을 제공하는 방법은 상기 중앙 서버에 샘플 정보를 생성하는 단계(S3000), 상기 중앙 서버에서 인공지능을 학습시키는 단계(S3100), 게임을 운영하는 단계(S3200)및 게임 운영을 통해 얻은 결과를 상기 중앙 서버에 운영데이터로 적용하는 단계(S3300)를 포함한다. 상기 중앙 서버에 샘플 정보를 생성하는 단계(S3000)에서는, 상기 관리용 단말기에 저장되어 있는 정보, 상기 패턴 생성용 단말기를 통해 생성한 패턴 정보 및 상기 카메라를 통해 얻은 정보를 취합하고 상기 샘플 정보에 사용되어, 인공지능을 학습시킬 입력값을 생성한다. 상기 관리용 단말기에 저장되어 있는 정보는 사용자의 순위, 태그 성공 횟수, 획득 점수, 플레이 시간 및 성공률 등을 포함할 수 있다. 상기 성공률은 해당 게임의 난이도와 직결되며, 해당 난이도는 관리자가 자체적으 로 상기 중앙 서버에 설정하거나 학습시킨 인공지능을 통해 결정될 수 있다. 상기 패턴 생성용 단말기 를 통해 생성한 패턴 정보는 패턴의 모양, 패턴의 진행 방향 및 패턴의 진행 속도 등을 포함할 수 있다. 상기 카메라를 통해 얻은 정보는 사용자의 위치를 포함할 수 있다. 상기 중앙 서버에서 인공지능을 학습시키는 단계(S3100)에서는, 상기 중앙 서버에 샘플 정보를 생성하 는 단계(S3000)에서 생성한 정보를 바탕으로 상기 중앙 서버에서 상기 정보를 확인하여 인공지능을 학습시 킨다. 상기 정보를 확인할 때는 MLP(Multi-Layer Perceptron)를 활용할 수 있다. 도 4를 참조하면, 상기 다층 신경망인 MLP의 구조를 나타낸다. 상기 MLP의 은닉층(hidden layer)의 개수나 노드의 개수 등은 도시된 내용에 한정되지 않고, 필요에 따라 적절하게 설계될 수 있을 것이다. 상기 게임을 운영하는 단계(S3200)에서는, 인공지능을 학습시킨 패턴을 바탕으로 게임을 운영할 수 있으며, 상 세한 내용은 도 6을 참조하며 이하 후술한다. 상기 게임 운영을 통해 얻은 결과를 상기 중앙 서버에 운영데이터로 적용하는 단계(S3300)에서는, 게임 운 영을 한 결과를 상기 중앙 서버에 저장함으로써, 사용자에 대한 정보 혹은 패턴 정보를 상기 중앙 서버(2 0)에서 인공지능을 학습시킬 데이터에 추가한다. 상기 사용자에 대한 정보는 각 사용자의 순위, 태그 성공 횟수, 획득 점수, 플레이 시간 및 성공률 등을 포함할 수 있다. 상기 패턴 정보는 패턴의 모양, 패턴의 진행 방 향 및 패턴의 진행 속도를 포함할 수 있다. 상기 상기 중앙 서버에서 인공지능을 학습시키는 단계(S3100) 내지 상기 게임 운영을 통해 얻은 결과를 상 기 중앙 서버에 운영데이터로 적용하는 단계(S3300)를 반복함에 따라, 각 사용자의 순위, 태그 성공 횟수, 획득 점수, 플레이 시간 및 성공률 등에 따라 각 사용자에게 맞는 패턴을 선택하는 데 정확도를 향상시킬 수 있 다. 도 5는 본 발명의 일 실시예에 따른 인공지능 기반 패턴을 분류하는 방법을 설명하는 개략도이다. 도 5를 참조하면, 상기 인공지능 기반 패턴을 분류하는 방법은 패턴 생성용 단말기가 복수의 패턴을 무작위로 생성하는 단계(S4000), 무작위로 생성된 상기 복수의 패턴을 카테고리별로 분류하는 단계(S4100), 분류된 상기 복수의 패턴을 바탕으로 인공지능을 학습시키는 단계(S4200), 다시 패턴 생성용 단말기가 복수의 패턴을 무작위 로 패턴을 생성하는 단계(S4300) 및 인공지능이 상기 복수의 패턴을 자동으로 분류하는 단계(S4400)를 포함한다. 상기 패턴 생성용 단말기가 복수의 패턴을 무작위로 생성하는 단계(S4000)에서는, 상기 패턴 생성용 단말기 에서 상기 복수의 패턴을 무작위로 생성한다. 상기 무작위로 생성된 상기 복수의 패턴을 카테고리별로 분류하는 단계(S4100)에서는, 무작위로 생성된 상기 복 수의 패턴을 상기 패턴 생성용 단말기에서 카테고리별로 분류한다. 상기 카테고리는 직선형과 대각선, 가로 형과 세로형, 단순형과 복잡형 및 분산형과 밀집형 등을 포함할 수 있으며 상기 카테고리의 종류는 이에 한정되 지 않는다. 상기 분류된 상기 복수의 패턴을 바탕으로 인공지능을 학습시키는 단계(S4200)에서는, 카테고리별로 분류한 상 기 복수의 패턴을 바탕으로 상기 패턴 생성용 단말기에서 인공지능을 학습시킨다. 상기 복수의 패턴을 학습 하는 단계에서 합성곱 신경망인 CNN(Convolutional Neural Network) 알고리즘을 사용할 수 있다. CNN은 이미지 분석을 위해 기계를 학습시키는데 유용한 알고리즘이다. 상기 다시 패턴 생성용 단말기가 복수의 패턴을 무작위로 패턴을 생성하는 단계(S4300)에서는, 상기 패턴용 단말기에서 복수의 터치 패턴을 다시 무작위로 생성한다. 상기 인공지능이 상기 복수의 패턴을 자동으로 분류하는 단계(S4400)에서는, 앞선 단계에서 학습한 정보를 바탕 으로 인공지능을 통해 상기 복수의 패턴을 카테고리별로 자동으로 분류할 수 있다.도 6은 도 3의 게임을 운영하는 방법을 설명하는 개략도이다. 도 6을 참조하면, 상기 게임을 운영하는 방법은 상황별로 인공지능을 통해 최적의 맞춤 패턴 정보를 생성하는 단계(S5000), 최적의 맞춤 패턴을 선택하는 단계(S5100) 및 게임 결과를 상기 중앙 서버에 저장하는 단계 (S5200)를 포함한다. 상기 상황별로 인공지능을 통해 최적의 맞춤 패턴 정보를 생성하는 단계(S5000)에서는, 각 사용자의 연령 및 게 임 빈도, 상기 패턴 생성용 단말기에서 저장한 카테고리, 패턴의 모양 및 속도, 상기 카메라를 통해 얻 은 사용자의 위치 및 성공률 등에 따라 인공지능이 게임의 난이도를 조절하여 상기 중앙 서버에서 각 사용 자의 맞춤 패턴을 생성한다. 예를 들어, 연령이 만 7세인 총 10명의 사용자가 도 2의 상기 터치 패널에서 상기 1행에 모여 있는 것을 상 기 카메라가 파악한다. 총 10명의 사용자 모두 10회 방문하여 숙련된 사용자라고 인공지능이 판단을 하면, 상기 중앙 서버에서는 상기 1행의 상기 터치 패널을 공격할 상기 복수의 맞춤 패턴을 난이도 10으로 생 성할 수 있다. 상기 최적의 맞춤 패턴을 선택하는 단계(S5100)에서는, 상기 중앙 서버에서 생성한 상기 복수의 맞춤 패턴 을 바탕으로 인공지능이 각 사용자의 맞춤 패턴을 선택한다. 예를 들어, 상기 중앙 서버에서 생성한 난이도 10인 상기 복수의 맞춤 패턴은 대각선, 세로형 및 복잡형으 로 이루어져 있다. 상기 중앙 서버에서 인공지능이 상기 복수의 맞춤 패턴 중 만 7세이고 숙련된 사용자의 맞춤 패턴을 선택한다. 상기 게임 결과를 상기 중앙 서버에 저장하는 단계(S5200)에서는, 상기 최적의 맞춤 패턴을 선택하는 단계 (S5100)에서 선택한 맞춤 패턴을 이용해 운영한 게임의 결과를 상기 중앙 서버에서 인공지능을 학습시킬 입 력값에 추가하여 저장한다. 사용자마다 게임에 대한 숙련도가 다르기 때문에, 맞춤 패턴을 제공하는데 정확도를 향상시키려면, 사용자의 데이터 혹은 패턴의 데이터가 계속 추가적으로 필요하다. 예를 들어, 만 7세이고 숙련된 사용자가 난이도 10인 맞춤 패턴을 10회의 기회 중 모두 실패하면, 인공지능은 상기 사용자에게 난이도가 어려웠다는 것으로 판단하여 다음 게임에서는 난이도 9인 복수의 맞춤 패턴을 생성할 수 있다. 도 7a 및 도 7b는 도 1의 인공지능 기반 놀이시설용 터치 및 태그시스템을 구현한 상황을 도시하였다. 도 7a를 참조하면, 상기 인공지능 기반 놀이시설용 터치 및 태그 시스템을 처음 실행시켰을 때의 상황을 도시하 였다. 사용자들 모두 파란색 터치 패널 위에 서있으며, 상기 카메라로 사용자의 위치를 파악하 고 있다. 사용자가 빨간색 터치 패널 위에 서있을 경우 포인트(목숨)가 차감되고, 그 외의 흰색 터 치 패널 위에 서있을 경우 포인트는 차감되지 않지만, 추가 포인트도 없다. 도 7b를 참조하면, 상기 인공지능 기반 놀이시설용 터치 및 태그 시스템을 처음 실행시킨 이후 바로 다음 패턴 을 공격했을 때의 상황을 도시하였다. 사용자 모두 상기 빨간색 터치 패널 위에 서있으며, 상기 카 메라로 사용자의 위치를 파악하고 있다. 상기 도 7a에 도시된 바와 같이, 사용자들이 모여 있을 때는 상기 터치 및 태그 시스템이 작동하면서 난이도가 10에 가까울수록 사용자가 모여 있는 상기 터치 패널 위주로 패턴을 공격한다. 상기 난이도는 각 사용자의 순위, 태그 성공 횟수, 획득 점수, 플레이 시간 및 성공률 등 사용자의 숙련도에 따라 관리자가 자체적으로 상기 중앙 서버에 설정하거나 학습시킨 인공지능을 통해 결정될 수 있다. 상기 도 7b에서는 사용자가 상기 빨간색 터치 패널 위에 서있으므로 포인트 가 차감된다. 이상 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0020765", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기반 놀이시설용 터치 및 태그 시스템의 개념도이다. 도 2는 도 1의 바닥면에 설치된 시스템의 일부를 구현한 예시도이다. 도 3은 본 발명의 일 실시예에 따른 인공지능 기반 사용자에게 맞춤 패턴을 제공하는 방법을 설명하는 개략도이 다. 도 4는 도 3의 MLP 구조를 나타낸 도면이다. 도 5는 본 발명의 일 실시예에 따른 인공지능 기반 패턴을 분류하는 방법을 설명하는 개략도이다. 도 6는 도 3의 게임을 운영하는 방법을 설명하는 개략도이다. 도 7a 및 도 7b는 도 1의 인공지능 기반 놀이시설용 터치 및 태그시스템을 구현한 상황을 도시하였다."}
