{"patent_id": "10-2021-0079868", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0169603", "출원번호": "10-2021-0079868", "발명의 명칭": "로봇과 인공지능 서비스 간의 자동화 통신 장치 및 이를 이용한 방법", "출원인": "한국전자통신연구원", "발명자": "송병열"}}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "로봇과 인공지능 서비스 간의 자동화 통신 장치가,로봇과 인공지능 서비스 사이에 정의된 매핑 규칙을 기반으로 브리지 코드(BRIDGE CODE) 및 컨테이너 정의파일을 생성하는 단계;상기 컨테이너 정의파일을 기반으로 독립된 형태의 브리지 컨테이너를 구동하는 단계;상기 브리지 컨테이너를 통해 상기 브리지 코드를 실행하는 단계; 및상기 브리지 코드를 기반으로 상기 로봇과 상기 인공지능 서비스 간에 메시지를 교환하여 자동화된 통신 환경을제공하는 단계를 포함하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 방법."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 브리지 코드는로봇 장치 메시지에 의해 요청된 서비스에 상응하게 상기 인공지능 서비스로 전송할 서비스 요청 메시지를 생성하고, 상기 인공지능 서비스로부터 수신된 서비스 결과 메시지를 기반으로 상기 로봇으로 전송할 로봇 이벤트메시지를 생성하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 방법."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 매핑 규칙은 ROS(ROBOT OPERATING SYSTEM) 기반의 로봇 응용 소프트웨어 메시지 정보 및 웹 기반의 인공지능 서비스 정보를고려하여 저작되는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 방법."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 로봇 응용 소프트웨어 메시지 정보는 메시지 구성 정보 및 데이터 구조 정의 파일을 포함하고, 상기 인공지능 서비스 정보는 서비스 경로 정보, 요청 헤더 파라미터(REQUEST HEADER PARAMETER) 정보, 요청 바디 파라미터(REQUEST BODY PARAMETER) 정보 및 응답(RESPONSE) 정보를 포함하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 방법."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 매핑 규칙은매핑 유형 설정 영역, 활용 대상 토픽 설정 영역 및 서비스 매핑 규칙 영역을 포함하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 방법."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,공개특허 10-2022-0169603-3-상기 생성하는 단계는상기 매핑 규칙을 파싱하여 상기 활용 대상 토픽 설정 영역에 포함된 토픽에 상응하는 데이터 타입 패키지를 획득하는 단계;상기 데이터 타입 패키지를 실행 의존 패키지 정보로 설정하여 브리지 코드 패키지 프로파일을 생성하는 단계;및상기 브리지 코드 패키지 프로파일을 기반으로 상기 브리지 코드에 상응하는 브리지 코드 블록을 생성하는 단계를 포함하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 방법."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 브리지 코드 블록은토픽 수신 모듈 설정 기능, 토픽 송신 모듈 설정 기능, 메시지 처리 콜백 기능 및 로봇 이벤트 메시지 구성 기능을 기반으로 상기 로봇과 상기 인공지능 서비스 간 메시지 교환을 수행하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 방법."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 구동하는 단계는컨테이너 생성 도구를 기반으로 도커(DOCKER)에 상기 컨테이너 정의파일을 입력하여 컨테이너 이미지를 빌드(BUILD)하는 단계; 및빌드된 컨테이너 이미지를 실행하여 상기 브리지 컨테이너의 구동을 요청하는 단계를 포함하는 것을 특징으로하는 로봇과 인공지능 서비스 간의 자동화 통신 방법."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 컨테이너 정의파일은상기 컨테이너 생성 도구로 상기 매핑 규칙을 입력하여 생성되고, 상기 브리지 코드와 함께 상기 브리지 코드의컴파일 및 구동 환경을 포함하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 방법."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "에 있어서,상기 매핑 규칙은 ROS(ROBOT OPERATING SYSTEM) 기반의 로봇 응용 소프트웨어 메시지 정보 및 웹 기반의 인공지능 서비스 정보를고려하여 저작되는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 장치."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 브리지 코드는로봇 장치 메시지에 의해 요청된 서비스에 상응하게 상기 인공지능 서비스로 전송할 서비스 요청 메시지를 생성하고, 상기 인공지능 서비스로부터 수신된 서비스 결과 메시지를 기반으로 상기 로봇으로 전송할 로봇 이벤트메시지를 생성하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 장치.공개특허 10-2022-0169603-4-청구항 12"}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,상기 로봇 응용 소프트웨어 메시지 정보는 메시지 구성 정보 및 데이터 구조 정의 파일을 포함하고, 상기 인공지능 서비스 정보는 서비스 경로 정보, 요청 헤더 파라미터(REQUEST HEADER PARAMETER) 정보, 요청 바디 파라미터(REQUEST BODY PARAMETER) 정보 및 응답(RESPONSE) 정보를 포함하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 장치."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 10에 있어서,상기 매핑 규칙은매핑 유형 설정 영역, 활용 대상 토픽 설정 영역 및 서비스 매핑 규칙 영역을 포함하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 장치."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서,상기 프로세서는상기 매핑 규칙을 파싱하여 상기 활용 대상 토픽 설정 영역에 포함된 토픽에 상응하는 데이터 타입 패키지를 획득하고, 상기 데이터 타입 패키지를 실행 의존 패키지 정보로 설정하여 브리지 코드 패키지 프로파일을 생성하고, 상기 브리지 코드 패키지 프로파일을 기반으로 상기 브리지 코드에 상응하는 브리지 코드 블록을 생성하는것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 장치."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서,상기 브리지 코드 블록은토픽 수신 모듈 설정 기능, 토픽 송신 모듈 설정 기능, 메시지 처리 콜백 기능 및 로봇 이벤트 메시지 구성 기능을 기반으로 상기 로봇과 상기 인공지능 서비스 간 메시지 교환을 수행하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 장치."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 10에 있어서,상기 프로세서는컨테이너 생성 도구를 기반으로 도커(DOCKER)에 상기 컨테이너 정의파일을 입력하여 컨테이너 이미지를 빌드(BUILD)하고, 빌드된 컨테이너 이미지를 실행하여 상기 브리지 컨테이너의 구동을 요청하는 것을 특징으로 하는로봇과 인공지능 서비스 간의 자동화 통신 장치."}
{"patent_id": "10-2021-0079868", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,공개특허 10-2022-0169603-5-상기 컨테이너 정의파일은상기 컨테이너 생성 도구로 상기 매핑 규칙을 입력하여 생성되고, 상기 브리지 코드와 함께 상기 브리지 코드의컴파일 및 구동 환경을 포함하는 것을 특징으로 하는 로봇과 인공지능 서비스 간의 자동화 통신 장치."}
{"patent_id": "10-2021-0079868", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "로봇과 인공지능 서비스 간의 자동화 통신 장치 및 이를 이용한 방법이 개시된다. 본 발명의 일실시예에 따른 자동화 통신 방법은 로봇과 인공지능 서비스 간의 자동화 통신 장치가, 로봇과 인공지능 서비스 사이에 정의된 매핑 규칙을 기반으로 브리지 코드(BRIDGE CODE) 및 컨테이너 정의파일을 생성하는 단계; 상기 컨테이너 정의파 일을 기반으로 독립된 형태의 브리지 컨테이너를 구동하는 단계; 상기 브리지 컨테이너를 통해 상기 브리지 코드 를 실행하는 단계; 및 상기 브리지 코드를 기반으로 상기 로봇과 상기 인공지능 서비스 간에 메시지를 교환하여 자동화된 통신 환경을 제공하는 단계를 포함한다."}
{"patent_id": "10-2021-0079868", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 로봇과 인공지능 서비스 간의 자동화 통신 기술에 관한 것으로, 특히 다양한 인공지능을 융합하여 서 비스를 제공하는 로봇에서 웹 서비스 형태로 제공되는 인공지능 서비스를 활용하기 위해서 로봇 전용 프레임워 크 기반의 로봇 응용 소프트웨어 모듈과 인공지능 서비스 사이의 통신 구성을 자동화하는 기술에 관한 것이다."}
{"patent_id": "10-2021-0079868", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇은 내장된 장치나 센서로부터 수집 또는 생성되는 다양한 센서 정보를 기반으로 다양한 인공지능 기능을 융 합하여 서비스를 제공한다. 예를 들어, 음성 인식, 자연어 처리, 사물 인식, 사용자 인식, 행동 인식, 외형특징 인식, 위치 인식, 이동 경로 생성, 관절 궤적 생성, 조작 정보 생성 등의 인공지능 기반 기능들을 융합하여 제 공할 수 있다. 최신의 인공지능 모듈들은 인공 신경망(Artificial Neural Network) 기반 기계학습의 발달을 통해 성능이 크게 향상되고 있으며, 점점 더 많은 신경망 기반의 인공지능 모듈들이 출시되고 있다. 최근 신경망 기반의 인공지능 모듈들은 인공지능 알고리즘을 개발하기 위해 TensorFlow, pyTorch, Keras 등 다 양한 인공지능 프레임워크와 인공지능 알고리즘에 필요한 다양한 외부 패키지들을 활용하여 구성되는 경우가 많 다. 또한, 인공지능의 성능이 높아질수록 더 많은 자원을 필요로 하는 경우도 많다. 따라서, 상대적으로 작은 컴퓨팅 파워를 가지는 로봇에 인공지능 알고리즘을 내장하여 서비스를 제공하는 것보다는 높은 성능을 제공할 수 있는 클라우드 컴퓨팅 환경에서 REST 기반의 웹 서비스 형태로 인공지능 서비스를 제공하는 경우가 많아지고 있다. 이 때, 로봇에서 웹 서비스 형태로 제공되는 인공지능 서비스를 활용하기 위해서, 전용 프로토콜 형태로 전달되 는 장치 정보 메시지로부터 데이터를 추출하여 웹 기반 지능 서비스를 호출하고 그 결과를 이벤트 메시지로 전 송하는 별도의 응용 프로그램 모듈을 필요로 하는데, 이러한 응용 프로그램 모듈은 개발자가 직접 하드 코딩하 여 구동해야 하는 불편함이 존재하였다. 즉, 전용 로봇 프로토콜에서 사용하는 메시지나 사용할 인공지능 서비스의 URL 정보, 파라미터 등에 따라 매번 개발자가 하드 코딩을 수행하여 소프트웨어 모듈을 제작해야 한다는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개 특허 제10-2021-0012400호, 2021년 2월 3일 공개(명칭: 프로그래밍 코드 자동생성을 통한 백엔드 구축 방법)"}
{"patent_id": "10-2021-0079868", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 로봇의 장치 정보 메시지와 웹 서비스 파라미터 간의 간단한 매핑 규칙을 설정하는 것만으로 로봇 AI 개발자 또는 로봇 응용 소프트웨어 개발자에 의한 별도의 코드 개발 없이 웹 서비스 형태로 제공되는 인공지능 서비스와 전용 프로토콜을 사용하는 로봇 응용 소프트웨어 간 통신 구성을 자동화하는 것이다. 또한, 본 발명의 목적은 로봇의 구동 환경 또는 개발 환경에 변화가 발생하는 경우에도 낮은 비용으로 로봇과 인공지능 서비스 간의 통신을 구성하는 방안을 제공하는 것이다."}
{"patent_id": "10-2021-0079868", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명에 따른 로봇과 인공지능 서비스 간의 자동화 통신 방법은, 로봇과 인공지 능 서비스 간의 자동화 통신 장치가, 로봇과 인공지능 서비스 사이에 정의된 매핑 규칙을 기반으로 브리지 코드 (BRIDGE CODE) 및 컨테이너 정의파일을 생성하는 단계; 상기 컨테이너 정의파일을 기반으로 독립된 형태의 브리 지 컨테이너를 구동하는 단계; 상기 브리지 컨테이너를 통해 상기 브리지 코드를 실행하는 단계; 및 상기 브리 지 코드를 기반으로 상기 로봇과 상기 인공지능 서비스 간에 메시지를 교환하여 자동화된 통신 환경을 제공하는 단계를 포함한다. 이 때, 브리지 코드는 로봇 장치 메시지에 의해 요청된 서비스에 상응하게 상기 인공지능 서비스로 전송할 서비 스 요청 메시지를 생성하고, 상기 인공지능 서비스로부터 수신된 서비스 결과 메시지를 기반으로 상기 로봇으로 전송할 로봇 이벤트 메시지를 생성할 수 있다. 이 때, 매핑 규칙은 ROS(ROBOT OPERATING SYSTEM) 기반의 로봇 응용 소프트웨어 메시지 정보 및 웹 기반의 인공 지능 서비스 정보를 고려하여 저작될 수 있다. 이 때, 로봇 응용 소프트웨어 메시지 정보는 메시지 구성 정보 및 데이터 구조 정의 파일을 포함하고, 상기 인 공지능 서비스 정보는 서비스 경로 정보, 요청 헤더 파라미터(REQUEST HEADER PARAMETER) 정보, 요청 바디 파라 미터(REQUEST BODY PARAMETER) 정보 및 응답(RESPONSE) 정보를 포함할 수 있다. 이 때, 매핑 규칙은 매핑 유형 설정 영역, 활용 대상 토픽 설정 영역 및 서비스 매핑 규칙 영역을 포함할 수 있 다. 이 때, 생성하는 단계는 상기 매핑 규칙을 파싱하여 상기 활용 대상 토픽 설정 영역에 포함된 토픽에 상응하는 데이터 타입 패키지를 획득하는 단계; 상기 데이터 타입 패키지를 실행 의존 패키지 정보로 설정하여 브리지 코 드 패키지 프로파일을 생성하는 단계; 및 상기 브리지 코드 패키지 프로파일을 기반으로 상기 브리지 코드에 상 응하는 브리지 코드 블록을 생성하는 단계를 포함할 수 있다. 이 때, 브리지 코드 블록은 토픽 수신 모듈 설정 기능, 토픽 송신 모듈 설정 기능, 메시지 처리 콜백 기능 및 로봇 이벤트 메시지 구성 기능을 기반으로 상기 로봇과 상기 인공지능 서비스 간 메시지 교환을 수행할 수 있다. 이 때, 구동하는 단계는 컨테이너 생성 도구를 기반으로 도커(DOCKER)에 상기 컨테이너 정의파일을 입력하여 컨 테이너 이미지를 빌드(BUILD)하는 단계; 및 빌드된 컨테이너 이미지를 실행하여 상기 브리지 컨테이너의 구동을 요청하는 단계를 포함할 수 있다. 이 때, 컨테이너 정의파일은 상기 컨테이너 생성 도구로 상기 매핑 규칙을 입력하여 생성되고, 상기 브리지 코 드와 함께 상기 브리지 코드의 컴파일 및 구동 환경을 포함할 수 있다. 또한, 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 장치는, 로봇과 인공지능 서비스 사이에 정의된 매핑 규칙을 기반으로 브리지 코드(BRIDGE CODE) 및 컨테이너 정의파일을 생성하고, 상기 컨테이 너 정의파일을 기반으로 독립된 형태의 브리지 컨테이너를 구동하고, 상기 브리지 컨테이너를 통해 상기 브리지 코드를 실행하고, 상기 브리지 코드를 기반으로 상기 로봇과 상기 인공지능 서비스 간에 메시지를 교환하여 자 동화된 통신 환경을 제공하는 프로세서; 및 상기 매핑 규칙을 저장하는 메모리를 포함한다. 이 때, 브리지 코드는 로봇 장치 메시지에 의해 요청된 서비스에 상응하게 상기 인공지능 서비스로 전송할 서비 스 요청 메시지를 생성하고, 상기 인공지능 서비스로부터 수신된 서비스 결과 메시지를 기반으로 상기 로봇으로 전송할 로봇 이벤트 메시지를 생성할 수 있다. 이 때, 매핑 규칙은 ROS(ROBOT OPERATING SYSTEM) 기반의 로봇 응용 소프트웨어 메시지 정보 및 웹 기반의 인공 지능 서비스 정보를 고려하여 저작될 수 있다. 이 때, 로봇 응용 소프트웨어 메시지 정보는 메시지 구성 정보 및 데이터 구조 정의 파일을 포함하고, 상기 인 공지능 서비스 정보는 서비스 경로 정보, 요청 헤더 파라미터(REQUEST HEADER PARAMETER) 정보, 요청 바디 파라 미터(REQUEST BODY PARAMETER) 정보 및 응답(RESPONSE) 정보를 포함할 수 있다. 이 때, 매핑 규칙은 매핑 유형 설정 영역, 활용 대상 토픽 설정 영역 및 서비스 매핑 규칙 영역을 포함할 수 있 다.이 때, 프로세서는 상기 매핑 규칙을 파싱하여 상기 활용 대상 토픽 설정 영역에 포함된 토픽에 상응하는 데이 터 타입 패키지를 획득하고, 상기 데이터 타입 패키지를 실행 의존 패키지 정보로 설정하여 브리지 코드 패키지 프로파일을 생성하고, 상기 브리지 코드 패키지 프로파일을 기반으로 상기 브리지 코드에 상응하는 브리지 코드 블록을 생성할 수 있다. 이 때, 브리지 코드 블록은 토픽 수신 모듈 설정 기능, 토픽 송신 모듈 설정 기능, 메시지 처리 콜백 기능 및 로봇 이벤트 메시지 구성 기능을 기반으로 상기 로봇과 상기 인공지능 서비스 간 메시지 교환을 수행할 수 있다. 이 때, 프로세서는 컨테이너 생성 도구를 기반으로 도커(DOCKER)에 상기 컨테이너 정의파일을 입력하여 컨테이 너 이미지를 빌드(BUILD)하고, 빌드된 컨테이너 이미지를 실행하여 상기 브리지 컨테이너의 구동을 요청할 수 있다. 이 때, 컨테이너 정의파일은 상기 컨테이너 생성 도구로 상기 매핑 규칙을 입력하여 생성되고, 상기 브리지 코 드와 함께 상기 브리지 코드의 컴파일 및 구동 환경을 포함할 수 있다."}
{"patent_id": "10-2021-0079868", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 로봇의 장치 정보 메시지와 웹 서비스 파라미터 간의 간단한 매핑 규칙을 설정하는 것만으로 로봇 AI 개발자 또는 로봇 응용 소프트웨어 개발자에 의한 별도의 코드 개발 없이 웹 서비스 형태로 제공되는 인공지능 서비스와 전용 프로토콜을 사용하는 로봇 응용 소프트웨어 간 통신 구성을 자동화할 수 있다. 또한, 본 발명은 로봇의 구동 환경 또는 개발 환경에 변화가 발생하는 경우에도 낮은 비용으로 로봇과 인공지능 서비스 간의 통신을 구성하는 방안을 제공할 수 있다."}
{"patent_id": "10-2021-0079868", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 여기서, 반복되는 설명, 본 발명의 요지를 불 필요하게 흐릴 수 있는 공지 기능, 및 구성에 대한 상세한 설명은 생략한다. 본 발명의 실시형태는 당 업계에서 평균적인 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위해서 제공되는 것이다. 따라서, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다.이하, 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 시스템을 나타낸 도면이다. 도 1을 참조하면, 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 시스템은 자동화 통신 장치, 전용 프로토콜을 사용하는 로봇 및 웹 기반의 인공지능 서비스를 포함한다. 이 때, 로봇은 로봇 소프트웨어 모듈을 의미할 수 있다. 자동화 통신 장치는 로봇과 인공지능 서비스 사이에 정의된 매핑 규칙을 기반으로 브리지 코드 (BRIDGE CODE) 및 컨테이너 정의파일을 생성한다. 이 때, 매핑 규칙은 ROS(ROBOT OPERATING SYSTEM) 기반의 로봇 응용 소프트웨어 메시지 정보 및 웹 기반의 인공 지능 서비스 정보를 고려하여 저작될 수 있다. 이 때, 로봇 응용 소프트웨어 메시지 정보는 메시지 구성 정보 및 데이터 구조 정의 파일을 포함하고, 인공지능 서비스 정보는 서비스 경로 정보, 요청 헤더 파라미터(REQUEST HEADER PARAMETER) 정보, 요청 바디 파라미터 (REQUEST BODY PARAMETER) 정보 및 응답(RESPONSE) 정보를 포함할 수 있다. 이 때, 매핑 규칙은 매핑 유형 설정 영역, 활용 대상 토픽 설정 영역 및 서비스 매핑 규칙 영역을 포함할 수 있 다. 이 때, 매핑 규칙을 파싱하여 활용 대상 토픽 설정 영역에 포함된 토픽에 상응하는 데이터 타입 패키지를 획득 하고, 데이터 타입 패키지를 실행 의존 패키지 정보로 설정하여 브리지 코드 패키지 프로파일을 생성하고, 브리 지 코드 패키지 프로파일을 기반으로 브리지 코드에 상응하는 브리지 코드 블록을 생성할 수 있다. 또한, 자동화 통신 장치는 컨테이너 정의 파일을 기반으로 독립된 형태의 브리지 컨테이너를 구동한다. 이 때, 컨테이너 생성 도구를 기반으로 도커(DOCKER)에 컨테이너 정의파일을 입력하여 컨테이너 이미지를 빌드 (BUILD)하고, 빌드된 컨테이너 이미지를 실행하여 브리지 컨테이너의 구동을 요청할 수 있다. 이 때, 컨테이너 정의파일은 컨테이너 생성 도구로 매핑 규칙을 입력하여 생성되고, 브리지 코드와 함께 브리지 코드의 컴파일 및 구동 환경을 포함할 수 있다. 또한, 자동화 통신 장치는 브리지 컨테이너를 통해 브리지 코드를 실행한다. 또한, 자동화 통신 장치는 브리지 코드를 기반으로 로봇과 인공지능 서비스 간에 메시지를 교환 하여 자동화된 통신 환경을 제공한다. 이 때, 브리지 코드는 로봇 장치 메시지에 의해 요청된 서비스에 상응하게 인공지능 서비스로 전송할 서비 스 요청 메시지를 생성하고, 인공지능 서비스로부터 수신된 서비스 결과 메시지를 기반으로 로봇으로 전송할 로봇 이벤트 메시지를 생성할 수 있다. 이 때, 브리지 코드 블록은 토픽 수신 모듈 설정 기능, 토픽 송신 모듈 설정 기능, 메시지 처리 콜백 기능 및 로봇 이벤트 메시지 구성 기능을 기반으로 로봇과 인공지능 서비스 간 메시지 교환을 수행할 수 있다. 도 2는 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 방법을 나타낸 동작 흐름도이다. 도 2를 참조하면, 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 방법은, 로봇과 인공지 능 서비스 간의 자동화 통신 장치가, 로봇과 인공지능 서비스 사이에 정의된 매핑 규칙을 기반으로 브리지 코드 (BRIDGE CODE) 및 컨테이너 정의파일을 생성한다(S210). 이 때, 매핑 규칙은 ROS(ROBOT OPERATING SYSTEM) 기반의 로봇 응용 소프트웨어 메시지 정보 및 웹 기반의 인공 지능 서비스 정보를 고려하여 저작될 수 있다. 예를 들어, 도 3에 도시된 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 시스템을 참조 하면, 매핑 규칙 파일(MAPPING FILE)은 인공지능 서비스를 제공하는 제공자로부터 획득한 인공지능 서비스 정보와 로봇에 대한 로봇 응용 소프트웨어 메시지 정보를 고려하여 저작될 수 있다. 이 때, 매핑 규칙은 매핑 유형 설정 영역, 활용 대상 토픽 설정 영역 및 서비스 매핑 규칙 영역을 포함할 수 있 다. 예를 들어, 도 4를 참조하면, 본 발명의 일실시예에 따른 매핑 규칙은 통상적으로 \"이름(key):값(value)\" 형태로 표현할 수 있으며, 작성 형식은 yaml, xml, json 등 구조 표현이 가능한 파일 형식을 사용하여 작성될 수 있다. 매핑 유형 설정 영역은 해당 매핑 규칙에 적용되는 유형 값을 설정하기 위한 것으로, ROS, MQTT, REST, DDS, gRPC 등의 값을 결합하여 사용할 수 있다. 예를 들어, 도 4에 도시된 매핑 유형 설정 영역을 참조하면, 매핑 유형 설정 필드의 이름(key)인 \"bind_type\"에 ROS와 REST간 매핑 규칙을 의미하는 값(value)으로\"ros2rest\"를 설정할 수 있다. 활용 대상 토픽 설정 영역은 해당 매핑 규칙에서 활용하는 로봇 장치 메시지 및 로봇 이벤트 메시지에 관 한 정보를 포함할 수 있다. 예를 들어, 도 4를 참조하면, 활용 대상 토픽 설정 영역에 해당하는 필드의 이름(key)인 \"topics\"에 각각 의 메시지 주제(토픽)를 나타내는 값을 \"name\" 필드에 설정할 수 있다. 또한, 각각의 메시지가 사용하는 데이터 타입은 \"type\"필드에 설정할 수 있고, 데이터 타입에 대한 정의 파일의 위치는 \"path\"에 설정할 수 있다. 서비스 매핑 규칙 영역에서는 매핑 규칙이 적용될 각각의 대상 인공지능 서비스에 대해서, 인공지능 서비 스 접근 경로, 서비스 요청 메시지의 구성 요소 별 매핑 규칙, 인공지능 서비스 요청 결과를 로봇에 게 전달하기 위한 로봇 이벤트 메시지 구성 요소 별 매핑 규칙을 설정할 수 있다. 인공지능 서비스 접근 경로는 REST 형태로 제공되는 인공지능 서비스에 대해 해당 서비스를 제공하는 호스 트의 주소를 시스템 운용 시 결정하기 위해 \"${변수값}\"형태의 시스템 변수를 활용하여 나타낼 수 있다. 서비스 요청 메시지의 구성 요소 별 매핑 규칙은 서비스 요청 메시지의 헤더 구성 요소에 대한 매핑 규칙 , 요청 경로에 대한 매핑 규칙 및 메시지 데이터에 대한 매핑 규칙으로 구성될 수 있다. 로봇 이벤트 메시지 구성 요소 별 매핑 규칙은 인공지능 서비스 요청 결과로부터 구성할 각각의 로봇 이벤 트 메시지에 대해 타겟 토픽과 해당 토픽 데이터의 각 구성 요소에 대한 타겟 토픽 매핑 규칙으로 구 성될 수 있다. 이 때, 서비스 요청 메시지의 구성 요소 별 매핑 규칙 및 로봇 이벤트 메시지 구성 요소 별 매핑 규칙 에 포함되는 각각의 매핑 규칙에는 문자열을 활용한 상수, 변수, 정규 표현식 등이 활용될 수 있다. 도 4를 참조하여 서비스 요청 메시지의 구성 요소 별 매핑 규칙을 설명하면, 서비스 요청 메시지의 헤더 구성 요소에 대한 매핑 규칙은 서비스 요청 메시지의 HTTP 헤더에 들어갈 타겟 변수의 이름을 설정하기 위 한 name필드에\"API-KEY\"로 설정할 수 있고, 해당 값을 시스템 운용 시 결정하기 위해 시스템 변수값(예: $ServiceClientSecret)으로 설정할 수 있다. 이 때, 요청 경로에 대한 매핑 규칙의 \"name\"에 해당하는 필드 값을 표현하기 위해 \"${변수값}\"인 문자열 이 포함된 URL 형태의 문자열로 설정할 수 있다. 이 때, 요청 경로에 대한 매핑 규칙에서 변수명 \"name\"에 사용된 문자열은 인공지능 서비스 접근 경로에 사용되는 변수에 대응될 수 있다. 도 4에서는 인공지능 서 비스 접근 경로의 변수 \"${param_id}\"에 해당되는 \"name\"을 \"param_id\"로 설정하고 해당 값을 \"30\"으로 설정하였다. 이 때, 메시지 데이터에 대한 매핑 규칙에서는 도 5에 도시된 것과 같이 서비스 요청 메시지의 메시지 바 디를 구성하는 각각의 파라미터를 \"name\"에 설정할 수 있고, 해당 값을 가져오기 위한 규칙을 \"from\"에 설 정할 수 있다. 도 4 내지 도 5를 참조하면, 메시지 바디의 \"first\" 파라미터의 값을 로봇 장치 메시지의 구성 요소 \"b\"로 설정하였고, 메시지 바디의 \"second\" 파라미터의 값을 로봇 장치 메시지의 구성 요소 \" C\"로 설정한 것을 알 수 있다. 또한, 도 4를 참조하여 로봇 이벤트 메시지 구성 요소 별 매핑 규칙을 설명하면, 인공지능 서비스 요청 결 과로부터 로봇에 전달할 로봇 이벤트 메시지의 타겟 토픽을 설정할 수 있고, 해당 토픽의 각 구성 요소를 구성하기 위한 타겟 토픽 매핑 규칙을 \"returns\"에 설정할 수 있다. 도 4, 도 5 및 도 7을 참조하면, 타겟 토픽을 \"my_response_topic\"으로 설정하였고, 해당 토픽의 구성 요소중 \"num\"은 인공지능 서비스의 응답 결과의 값 중에 \"result\" 파라미터 값으로 설정하고, \"time\"은 응답 결과의 값 중에\"datetime\" 파라미터 값으로 설정하였다. 이 때, 컨테이너 정의파일은 컨테이너 생성 도구로 매핑 규칙을 입력하여 생성되고, 브리지 코드와 함께 브리지 코드의 컴파일 및 구동 환경을 포함할 수 있다. 예를 들어, 도 3을 참조하면, 본 발명의 일실시예에 따른 자동화 통신 장치에 해당하는 AUTOMATED ROBOT-AI COMMUNICATION COMPOSITION TOOL로 매핑 규칙 파일을 입력하여 매핑 규칙에 해당하는 브리지 코드 (GENERATED ROS-REST BRIDGE CODE)와 브리지 코드의 컴파일 및 구동 환경이 포함된 컨테이너 정의파일 (GENERATED DOCKERFILES)을 생성할 수 있다. 또한, 도 14 내지 도 15를 참조하면, 컨테이너 정의파일은 브리지 코드와 데이터 타입 패키지 구성 코드 가 포함된 임시 저장 디렉토리의 구조를 컨테이너 이미지에 추가하는 명령과 데이터 패키지 구성 코드와 브리지 코드에 대한 컴파일 명령 및 브리지 컨테이너 실행 시 자동으로 브리지 코드를 실행하는 명령을 포함할 수 있다. 이 때, 매핑 규칙을 파싱하여 활용 대상 토픽 설정 영역에 포함된 토픽에 상응하는 데이터 타입 패키지를 획득 할 수 있다. 예를 들어, 도 3에 도시된 AUTOMATED ROBOT-AI COMMUNICATION COMPOSITION TOOL은 매핑 규칙 파일의 파일 형식에 따라 YAML 로더, XML 로더 등을 이용하여 매핑 규칙을 파싱할 수 있고, 매핑 규칙에 따라 생성될 브리지 코드, 타입 데이터, 컨테이너 코드를 저장할 임시 저장 디렉토리를 설정할 수 있다. 이 때, 매핑 규칙 파일의 파싱을 통해 활용 대상 토픽 설정 영역에 설정된 각각의 토픽들에 대한 설정 값 을 획득할 수 있다. 이 후, 획득한 설정 값에서 데이터 타입의 패키지 이름과 데이터 타입 정의 파일 위치를 획득하여 데이터 타입 패키지 디렉토리 구조에 상응하게 데이터 타입 정의 파일을 복사하여 저장할 수 있다. 예를 들어, 도 8을 참조하면, 임시 저장 디렉토리(예: temp)의 타입 데이터 설정 경로(예: temp/build/types)에 데이터 타입 패키지 디렉토리 구조에 맞게 데이터 타입 정의 파일을 복사하여 저장할 수 있다. 이 때, 데이터 타입 패키지의 컴파일을 위한 데이터 타입 패키지 빌드 스크립트(810, 910)와 데이터 타입 패키지 프로파일(830, 1010)을 생성하여 저장할 수 있다. 이 후, 임시 저장 디렉토리(예:temp)에 브리지 코드가 저장될 디렉토리(예:/temp/build/src)를 도 11에 도시된 것과 같은 브리지 코드 디렉토리 구조에 맞게 설정하고, 브리지 코드를 실행하는데 필요한 코드 언어별 부속 파일들(python 의 경우 setup.cfg, setup.py, __init__.py)을 생성할 수 있다. 이 때, 데이터 타입 패키지를 실행 의존 패키지 정보로 설정하여 브리지 코드 패키지 프로파일을 생성할 수 있 다. 예를 들어, 도 12를 참조하면, 활용 대상 토픽 설정 영역에 포함된 각각의 토픽들에 대한 데이터 타입 패키지를 실행 의존 패키지 정보로 설정한 브리지 코드 패키지 프로파일(1110, 1210)을 생성할 수 있다. 이 때, 브리지 코드 패키지 프로파일을 기반으로 브리지 코드에 상응하는 브리지 코드 블록을 생성할 수 있다. 브리지 코드 블록은 추후 도 13을 통해 상세하게 설명하도록 한다. 이 때, 인공지능 서비스 정보는 서비스 경로 정보, 요청 헤더 파라미터(REQUEST HEADER PARAMETER) 정보, 요청 바디 파라미터(REQUEST BODY PARAMETER) 정보 및 응답(RESPONSE) 정보를 포함할 수 있다. 이 때, 도 5에 도시된 것과 같은, 공개되거나 알려진 인공지능 서비스들에 대한 서비스 경로 정보, 요청 헤더 파라미터 정보, 요청 바디 파라미터 정보 및 응답 정보를 사전에 해당 인공지능 서비스 제 공자들로부터 제공받아 알고 있는 것으로 가정할 수 있다. 이 때, 로봇 응용 소프트웨어 메시지 정보는 메시지 구성 정보 및 데이터 구조 정의 파일을 포함할 수 있다. 이 때, 도 6에 도시된 것과 같은, 로봇의 센서, 액추에이터 등으로부터 수신되는 로봇 장치 메시지의 구성 정보 와 로봇 장치 메시지의 데이터 구조 정의 파일을 사전에 알고 있는 것으로 가정할 수 있다. 또한, 도 7에 도시된 것과 같은, 인공지능 서비스 요청의 결과로 로봇의 행동 결정에 활용하는 로봇 이벤트 메시지의 구 성 정보와 로봇 이벤트 메시지의 데이터 구조 정의 파일을 사전에 알고 있는 것으로 가정할 수 있다. 또한, 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 방법은, 로봇과 인공지능 서비스 간의 자동화 통신 장치가, 컨테이너 정의파일을 기반으로 독립된 형태의 브리지 컨테이너를 구동한다(S220). 이 때, 컨테이너 생성 도구를 기반으로 도커(DOCKER)에 컨테이너 정의파일을 입력하여 컨테이너 이미지를 빌드 (BUILD)할 수 있다. 이 때, 빌드된 컨테이너 이미지를 실행하여 브리지 컨테이너의 구동을 요청할 수 있다. 예를 들어, 도 3을 참조하면, AUTOMATED ROBOT-AI COMMUNICATION COMPOSITION TOOL은 도커(DOCKER)의 BUILD 명령을 실행하여 컨테이너 정의파일로부터 컨테이너 이미지를 생성할 수 있다. 이 후, 도커의 RUN 명령을 실행하여 브리지 코드가 포함된 브리지 컨테이너를 구동할 수 있다. 예를 들어, 컨테이너 이미지 빌드에 오류가 발생하였는지 여부를 확인하고, 오류가 없는 경우에 컨테이너 이미 지 빌드에서 사용했던 이미지 이름을 입력으로 브리지 컨테이너의 실행을 요청할 수 있다. 또한, 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 방법은, 로봇과 인공지능 서비스 간의 자동화 통신 장치가, 브리지 컨테이너를 통해 브리지 코드를 실행한다(S230). 또한, 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 방법은, 로봇과 인공지능 서비스 간의 자동화 통신 장치가, 브리지 코드를 기반으로 로봇과 인공지능 서비스 간에 메시지를 교환하여 자동화된 통신 환경을 제공한다(S240). 이 때, 브리지 코드는 로봇 장치 메시지에 의해 요청된 서비스에 상응하게 인공지능 서비스로 전송할 서비스 요 청 메시지를 생성하고, 인공지능 서비스로부터 수신된 서비스 결과 메시지를 기반으로 로봇으로 전송할 로봇 이 벤트 메시지를 생성할 수 있다. 예를 들어, 도 3을 참조하면, 독립된 컨테이너 형태로 실행된 브리지 컨테이너는 로봇에서 로봇의 전용 프 로토콜(ROS) 형태로 전달되는 로봇 장치 메시지를 수신하고, 로봇 장치 메시지를 인공지능 서비스로 전송할 서비스 요청 메시지로 변환하여 인공지능 서비스를 호출할 수 있다. 이 후, 인공지능 서비스 로부터 서비스 결과 메시지가 수신되면, 수신된 서비스 결과 메시지의 내용을 매핑 규칙에 따라 로봇 이벤트 메시지로 구성하여 로봇으로 전달할 수 있다. 이 때, 브리지 코드 블록은 토픽 수신 모듈 설정 기능, 토픽 송신 모듈 설정 기능, 메시지 처리 콜백 기능 및 로봇 이벤트 메시지 구성 기능을 기반으로 로봇과 인공지능 서비스 간 메시지 교환을 수행할 수 있다. 예를 들어, 본 발명의 일실시예에 따르면 인공지능 서비스에 대한 접근 경로 각각에 대해 도 13에 도시된 것과 같은 브리지 코드 블록을 생성할 수 있다. 도 13을 참조하면, 브리지 코드 블록은 토픽 수신 모듈 설정 코드 블록, 토픽 송신 모듈 설정 코드 블록, 메시지 처리 콜백 함수 코드 블록, 로봇 이벤트 메시지 구성 코드 블록으로 구성될 수 있다. 토픽 수신 모듈 설정 코드 블록은 도 4에 도시된 서비스 요청 메시지의 구성 요소 별 매핑 규칙에서 사용하는 토픽들 각각에 상응하게 활용 대상 토픽 설정 영역에서 가져온 수신할 메시지의 데이터 타입, 수 신할 메시지의 토픽 이름과 메시지 처리 콜백 함수명을 이용하여 생성될 수 있다. 이 때, 메시지 처리 콜백 함 수명은 코드 내에서 유일한 이름을 가지도록 설정될 수 있다. 토픽 송신 모듈 설정 코드 블록은 도 4에 도시된 로봇 이벤트 메시지 구성 요소 별 매핑 규칙에 설 정된 타겟 토픽 각각에 상응하게 활용 대상 토픽 설정 영역에서 가져온 송신할 메시지의 데이터 타입, 송신할 메시지의 토픽이름을 이용하여 생성될 수 있다. 메시지 처리 콜백 함수 코드 블록은 토픽 수신 모듈 설정 코드 블록에서 설정한 메시지 처리 콜백 함수명에 대해 각각 생성될 수 있다. 이 때, 메시지 처리 콜백 함수 코드 블록은 경로 파라미터 설정 코드 블록, 데이터 파라미터 설정 코드 블록, 서비스 요청 메시지 생성 코드 블록 및 서비스 요청 메시지 헤더 코드 블록으로 구성될 수 있다. 경로 파라미터 설정 코드 블록은 도 4에 도시된 인공지능 서비스 접근 경로의 설정 값에서 발견된 각각의 변수 중 경로 구성 요소 매핑 규칙에 설정된 값이 있는 변수의 경우에는 해당 값을 이용하도록 생 성될 수 있다. 또한, 인공지능 서비스 접근 경로의 설정 값에서 발견된 각각의 변수 중 경로 구성 요소 매 핑 규칙에 설정된 값이 없는 변수의 경우에는 시스템 설정값을 가져오도록 생성될 수도 있다. 데이터 파라미터 설정 코드 블록은 도 4에 도시된 메시지 데이터 매핑 규칙에 설정된 정보 중 \"from\"에 설정된 변수(ex: {Value}), 상수(ex: \"12\") 또는 로봇 장치 메시지의 구성 요소(ex: my_request_topic.b)로부터 서비스 요청 메시지의 메시지 바디의 각 구성 요소를 설정하도록 생성될 수 있다. 서비스 요청 메시지 생성 코드 블록은 도 4에 도시된 인공지능 서비스 접근 경로의 값으로 \"url\" 값 을 설정하고, 앞서 설정된 경로 파라미터 설정값과 데이터 파라미터 설정값을 활용하여, 경로에 상응하는 값과 메시지 바디가 포함된 메시지 모듈을 만들도록 생성될 수 있다. 서비스 요청 메시지 헤더 코드 블록은 메시지 모듈에 메시지 전송 프로토콜 별로 활용되는 헤더 값을 설 정하고, 도 4에 도시된 헤더 구성 요소 매핑 규칙에서 \"name\"으로 설정된 헤더 변수들에 대해 \"from\"에 설 정된 변수(ex: {Value}), 상수(ex: \"12\") 또는 로봇 장치 메시지의 구성 요소(ex: my_request_topic.b)로부터 서비스 요청 메시지의 메시지 헤더의 각 구성요소를 설정하도록 생성될 수 있다. 로봇 이벤트 메시지 구성 코드 블록은 도 4에 도시된 로봇 이벤트 메시지의 타겟 토픽으로 설정된 토픽에 대해 활용 대상 토픽 설정 영역에서 가져온 수신할 메시지의 데이터 타입에 해당하는 데이터 모듈 (ex: outData)을 생성할 수 있다. 또한, 타겟 토픽 매핑 규칙에 따라 데이터 모듈의 각 구성 요소에 대해 서비스 결과 메시지의 각 구성요소를 매핑하고, 완성된 로봇 이벤트 메시지를 로봇으로 전송하도록 생성될 수 있다. 이와 같은 자동화 통신 방법을 통해 로봇의 장치 정보 메시지와 웹 서비스 파라미터 간의 간단한 매핑 규칙을 설정하는 것만으로 로봇 AI 개발자 또는 로봇 응용 소프트웨어 개발자에 의한 별도의 코드 개발 없이 웹 서비스 형태로 제공되는 인공지능 서비스와 전용 프로토콜을 사용하는 로봇 응용 소프트웨어 간 통신 구성을 자동화할 수 있다. 또한, 로봇의 구동 환경 또는 개발 환경에 변화가 발생하는 경우에도 낮은 비용으로 로봇과 인공지능 서비스 간 의 통신을 구성할 수 있다. 도 16은 본 발명의 일실시예에 따른 자동화 통신 방법 중 브리지 컨테이너를 실행하는 과정을 상세하게 나타낸 동작 흐름도이다. 도 16을 참조하면, 본 발명의 일실시예에 따른 자동화 통신 방법 중 브리지 컨테이너를 실행하는 과정은 먼저 매핑 규칙 파일을 파싱할 수 있다(S1610). 예를 들어, 매핑 규칙 파일의 파일 형식에 따라 YAML 로더, JSON 로더, XML로더 등을 이용하여 매핑 규칙을 파 싱하고, 파싱된 매핑 규칙에 따라 생성되는 브리지 코드, 타입 데이터, 컨테이너 코드를 저장할 임시 저장 디렉 토리를 설정할 수 있다. 이 후, 활용 대상 토픽 설정 영역에 포함된 토픽에 상응하게 데이터 타입 패키지 구성 코드를 생성할 수 있다 (S1620). 예를 들어, 파싱을 통해 활용 대상 토픽 설정 영역에 설정된 각각의 토픽들에 대한 설정 값을 획득할 수 있다. 이 후, 획득한 설정 값에서 데이터 타입의 패키지 이름과 데이터 타입 정의 파일 위치를 획득하여 데이터 타입 패키지 디렉토리 구조에 상응하게 데이터 타입 정의 파일을 복사하여 저장할 수 있다. 이 후, 브리지 코드 생성 준비를 수행할 수 있다(S1630). 예를 들어, 임시 저장 디렉토리(예:temp)에 브리지 코드가 저장될 디렉토리(예:/temp/build/src)를 브리지 코드 디렉토리 구조에 맞게 설정하고, 브리지 코드를 실행하는데 필요한 코드 언어별 부속 파일들(python 의 경우 setup.cfg, setup.py, __init__.py)을 생성할 수 있다. 이 후, 활용 대상 토픽 설정 영역에 포함된 각각의 토 픽들에 대한 데이터 타입 패키지를 실행 의존 패키지 정보로 설정한 브리지 코드 패키지 프로파일을 생성할 수 있다.이 후, 인공지능 서비스에 대한 접근 경로 각각에 대해 브리지 코드 블록을 생성할 수 있다(S1640). 이 때, 브리지 코드 블록은 토픽 수신 모듈 설정 코드 블록, 토픽 송신 모듈 설정 코드 블록, 메시지 처리 콜백 함수 코드 블록 및 로봇 이벤트 메시지 구성 코드 블록을 포함할 수 있다. 이 후, 컨테이너 정의파일을 생성할 수 있다(S1650). 이 때, 컨테이너 정의파일은 브리지 코드와 데이터 타입 패키지 구성 코드가 포함된 임시 저장 디렉토리의 구조 를 컨테이너 이미지에 추가하는 명령과 데이터 패키지 구성 코드와 브리지 코드에 대한 컴파일 명령과 브리지 컨테이너 실행 시 자동으로 브리지 코드를 실행하는 명령을 포함할 수 있다. 이 후, 컨테이너 이미지를 생성할 수 있다(S1660). 예를 들어, 컨테이너 생성 도구로 컨테이너 정의파일을 입력하여 컨테이너 이미지의 빌드를 요청할 수 있다. 이 후, 컨테이너 이미지를 실행하여 브리지 컨테이너를 실행할 수 있다(S1670). 이 때, 컨테이너 이미지 빌드에 오류가 없는 경우에 컨테이너 이미지 빌드에 사용했던 이미지 이름을 입력으로 브리지 컨테이너의 실행을 요청할 수 있다. 도 17은 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 장치를 나타낸 도면이다. 도 17을 참조하면, 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 장치는 컴퓨터로 읽을 수 있는 기록매체와 같은 컴퓨터 시스템에 상응하게 구현될 수 있다. 도 17에 도시된 바와 같이, 컴퓨터 시스템은 버스를 통하여 서로 통신하는 하나 이상의 프로세서, 메모리, 사용자 입력 장치, 사용자 출력 장치 및 스토리지를 포함할 수 있다. 또한, 컴퓨터 시스템은 네트 워크에 연결되는 네트워크 인터페이스를 더 포함할 수 있다. 프로세서는 중앙 처리 장치 또 는 메모리나 스토리지에 저장된 프로세싱 인스트럭션들을 실행하는 반도체 장치일 수 있다. 메모 리 및 스토리지는 다양한 형태의 휘발성 또는 비휘발성 저장 매체일 수 있다. 예를 들어, 메모리 는 ROM이나 RAM을 포함할 수 있다. 따라서, 본 발명의 실시예는 컴퓨터로 구현된 방법이나 컴퓨터에서 실행 가능한 명령어들이 기록된 비일시적인 컴퓨터에서 읽을 수 있는 매체로 구현될 수 있다. 컴퓨터에서 읽을 수 있는 명령어들이 프로세서에 의해서 수 행될 때, 컴퓨터에서 읽을 수 있는 명령어들은 본 발명의 적어도 한 가지 측면에 따른 방법을 수행할 수 있다. 프로세서는 로봇과 인공지능 서비스 사이에 정의된 매핑 규칙을 기반으로 브리지 코드(BRIDGE CODE) 및 컨테이너 정의파일을 생성한다. 이 때, 매핑 규칙은 ROS(ROBOT OPERATING SYSTEM) 기반의 로봇 응용 소프트웨어 메시지 정보 및 웹 기반의 인공 지능 서비스 정보를 고려하여 저작될 수 있다. 이 때, 매핑 규칙은 매핑 유형 설정 영역, 활용 대상 토픽 설정 영역 및 서비스 매핑 규칙 영역을 포함할 수 있 다. 이 때, 매핑 규칙을 파싱하여 활용 대상 토픽 설정 영역에 포함된 토픽에 상응하는 데이터 타입 패키지를 획득 할 수 있다. 이 때, 데이터 타입 패키지를 실행 의존 패키지 정보로 설정하여 브리지 코드 패키지 프로파일을 생성할 수 있 다. 이 때, 브리지 코드 패키지 프로파일을 기반으로 브리지 코드에 상응하는 브리지 코드 블록을 생성할 수 있다. 이 때, 로봇 응용 소프트웨어 메시지 정보는 메시지 구성 정보 및 데이터 구조 정의 파일을 포함하고, 인공지능 서비스 정보는 서비스 경로 정보, 요청 헤더 파라미터(REQUEST HEADER PARAMETER) 정보, 요청 바디 파라미터 (REQUEST BODY PARAMETER) 정보 및 응답(RESPONSE) 정보를 포함할 수 있다. 이 때, 컨테이너 정의파일은 컨테이너 생성 도구로 매핑 규칙을 입력하여 생성되고, 브리지 코드와 함께 브리지 코드의 컴파일 및 구동 환경을 포함할 수 있다. 또한, 프로세서는 컨테이너 정의파일을 기반으로 독립된 형태의 브리지 컨테이너를 구동한다. 이 때, 컨테이너 생성 도구를 기반으로 도커(DOCKER)에 컨테이너 정의파일을 입력하여 컨테이너 이미지를 빌드 (BUILD)하고, 빌드된 컨테이너 이미지를 실행하여 브리지 컨테이너의 구동을 요청할 수 있다. 또한, 프로세서는브리지 컨테이너를 통해 브리지 코드를 실행한다. 이 때, 브리지 코드는 로봇 장치 메시지에 의해 요청된 서비스에 상응하게 인공지능 서비스로 전송할 서비스 요 청 메시지를 생성하고, 인공지능 서비스로부터 수신된 서비스 결과 메시지를 기반으로 로봇으로 전송할 로봇 이 벤트 메시지를 생성할 수 있다. 이 때, 브리지 코드 블록은 토픽 수신 모듈 설정 기능, 토픽 송신 모듈 설정 기능, 메시지 처리 콜백 기능 및 로봇 이벤트 메시지 구성 기능을 기반으로 로봇과 상기 인공지능 서비스 간 메시지 교환을 수행할 수 있다. 또한, 프로세서는 브리지 코드를 기반으로 로봇과 인공지능 서비스 간에 메시지를 교환하여 자동화된 통 신 환경을 제공한다. 메모리는 매핑 규칙을 저장한다. 또한, 메모리는 상술한 바와 같이 본 발명의 일실시예에 따른 자동화 통신 장치에서 발생하는 다양한 정 보를 저장한다. 실시예에 따라, 메모리는 자동화 통신 장치와 독립적으로 구성되어 로봇과 인공지능 서비스 간의 자동화 통신을 위한 기능을 지원할 수 있다. 이 때, 메모리는 별도의 대용량 스토리지로 동작할 수 있고, 동작 수행을 위한 제어 기능을 포함할 수도 있다. 한편, 로봇과 인공지능 서비스 간의 자동화 통신 장치는 메모리가 탑재되어 그 장치 내에서 정보를 저장할 수 있다. 일 구현예의 경우, 메모리는 컴퓨터로 판독 가능한 매체이다. 일 구현 예에서, 메모리는 휘발성 메모리 유닛일 수 있으며, 다른 구현예의 경우, 메모리는 비휘발성 메모리 유닛일 수도 있다. 일 구현예의 경우, 저장 장치는 컴퓨터로 판독 가능한 매체이다. 다양한 서로 다른 구현 예에서, 저장장치는 예컨대 하드디스크 장치, 광학디스크 장치, 혹은 어떤 다른 대용량 저장장치를 포함할 수도 있다. 이와 같은 자동화 통신 장치를 이용함으로써 로봇의 장치 정보 메시지와 웹 서비스 파라미터 간의 간단한 매핑 규칙을 설정하는 것만으로 로봇 AI 개발자 또는 로봇 응용 소프트웨어 개발자에 의한 별도의 코드 개발 없이 웹 서비스 형태로 제공되는 인공지능 서비스와 전용 프로토콜을 사용하는 로봇 응용 소프트웨어 간 통신 구성을 자 동화할 수 있다. 또한, 로봇의 구동 환경 또는 개발 환경에 변화가 발생하는 경우에도 낮은 비용으로 로봇과 인공지능 서비스 간 의 통신을 구성할 수 있다. 이상에서와 같이 본 발명에 따른 로봇과 인공지능 서비스 간의 자동화 통신 장치 및 이를 이용한 방법은 상기한 바와 같이 설명된 실시예들의 구성과 방법이 한정되게 적용될 수 있는 것이 아니라, 상기 실시예들은 다양한 변 형이 이루어질 수 있도록 각 실시예들의 전부 또는 일부가 선택적으로 조합되어 구성될 수도 있다."}
{"patent_id": "10-2021-0079868", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 시스템을 나타낸 도면이다. 도 2는 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 방법을 나타낸 동작 흐름도이다. 도 3은 본 발명에 따른 로봇과 인공지능 서비스 간의 자동화 통신 과정을 상세하게 나타낸 도면이다. 도 4는 본 발명에 따른 매핑 규칙의 일 예를 나타낸 도면이다. 도 5는 본 발명에 따른 웹 기반의 인공지능 서비스 정보의 일 예를 나타낸 도면이다. 도 6 내지 도 7은 본 발명에 따른 로봇 응용 소프트웨어 메시지 정보의 일 예를 나타낸 도면이다. 도 8 내지 도 10은 본 발명에 따른 데이터 타입 패키지 빌드 스크립트 및 데이터 타입 패키지 프로파일의 일 예 를 나타낸 도면이다. 도 11 내지 도 12는 본 발명에 따른 브리지 코드 패키지 빌드 스크립트 및 브리지 코드 패키지 프로파일의 일 예를 나타낸 도면이다. 도 13은 본 발명에 따른 브리지 코드 블록의 일 예를 나타낸 도면이다. 도 14는 본 발명에 따른 컨테이너 정의 파일의 일 예를 나타낸 도면이다. 도 15는 본 발명에 따라 최종 생성된 임시 저장 디렉토리의 일 예를 나타낸 도면이다. 도 16은 본 발명의 일실시예에 따른 자동화 통신 방법 중 브리지 컨테이너를 실행하는 과정을 상세하게 나타낸 동작 흐름도이다. 도 17은 본 발명의 일실시예에 따른 로봇과 인공지능 서비스 간의 자동화 통신 장치를 나타낸 도면이다."}
