{"patent_id": "10-2021-0137295", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0053923", "출원번호": "10-2021-0137295", "발명의 명칭": "개인의 특성을 고려한 일기예보", "출원인": "이정환", "발명자": "이정환"}}
{"patent_id": "10-2021-0137295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "일기예보에 있어서,개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 개인이 느낀 체감온도를 데이터로 만들고, 인공지능으로 학습 시키도록 구성한 (2)개인 맞춤 일기예보로 구성 된 것을 특징으로 하는 개인의 특성을 고려한일기예보."}
{"patent_id": "10-2021-0137295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,(2)개인 맞춤 일기예보를 통하여 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 개인이 느낀 체감온도를 데이터로 만들고, 인공지능으로 학습 시키도록 구성함을 특징으로 하는 개인의 특성을 고려한 일기예보."}
{"patent_id": "10-2021-0137295", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 개인의 특성을 고려한 일기예보에 관한 것으로서 개인 맞춤 일기예보에 의하여 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 함으로써 개개인마다 느끼는 체감온도가 다른 문제점을 해소하도록 함으로써 기존의 개개인마다 느끼는 체감온도가 다른 문제점을 해소 하도록 한 것이다. 즉 본 발명은, 일기예보에 있어서 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 개인이 느낀 체감온도 를 데이터로 만들고, 인공지능으로 학습 시키도록 구성한 개인 맞춤 일기예보로 구성한 것이다. 따라서, 본 발명은 개인 맞춤 일기예보에 의하여 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 함으로 써 개개인마다 느끼는 체감온도가 다른 문제점을 해소하도록 함으로써 기존의 개개인마다 느끼는 체감온도가 다 른 문제점을 해소하도록 한 효과를 갖는 것이다."}
{"patent_id": "10-2021-0137295", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 개인의 특성을 고려한 일기예보에 관한 것으로서, 더욱 상세하게는 일기예보에 있어서, 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 개인이 느낀 체감온도를 데이터로 만들고, 인공지능으 로 학습 시키도록 구성한 개인 맞춤 일기예보로 구성 하여서, 개인 맞춤 일기예보에 의하여 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 함으로써 개개인마다 느 끼는 체감온도가 다른 문제점을 해소하도록 함을 목적으로 한 것이다."}
{"patent_id": "10-2021-0137295", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 일기예보는 원하는 날짜의 기상을 예측 후 알림하는 것이다. 상기한 바와 같이 일기예보는 위치, 기상으로 구성된 것이다. 이상과 같은 일기예보는 개인이 어디 있는 지를 알아내고, 해당 위치의 기상을 예측 후 알림하는 것이다. 그러나 상기한 바와 같은 종래의 일기예보는 개개인마다 느끼는 체감온도가 다른 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허 출원 제 1020110062911 호"}
{"patent_id": "10-2021-0137295", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은 종래의 일기예보가 개개인마다 느끼는 체감온도가 다른 문제점을 해결하기 위한 것이다."}
{"patent_id": "10-2021-0137295", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "즉, 본 발명은 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 개인이 느낀 체감온도를 데이터로 만들 고, 인공지능으로 학습 시키도록 구성한 개인 맞춤 일기예보로 구성한 것이다."}
{"patent_id": "10-2021-0137295", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "따라서 본 발명은 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 개인이 느낀 체감온도를 데이터로 만 들고, 인공지능으로 학습 시키도록 구성한 개인 맞춤 일기예보로 구성 함으로써, 개인 맞춤 일기예보에 의하여 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 함으로써 개개인마다 느끼는 체감온도가 다른 문제점을 해소하도록 한 효과를 갖는 것이다."}
{"patent_id": "10-2021-0137295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "즉, 본 발명은 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 개인이 느낀 체감온도를 데이터로 만들 고, 인공지능으로 학습 시키도록 구성한 개인 맞춤 일기예보로 구성 된 것이다. 여기서, 개인 맞춤 일기예보는 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 개인이 느낀 체감온 도를 데이터로 만들고, 인공지능으로 학습 시키도록 구성한 것이다. 이하, 본 발명의 사용과정에 대하여 설명하면 다음과 같다. 상기한 바와 같이 본 발명은 일기예보에 있어서 개개인의 특성을 더욱 고려하여 일기 예보를 할 수 있게 개인이 느낀 체감온도를 데이터로 만들고, 인공지능으로 학습 시키도록 구성한 개인 맞춤 일기예보로 구성된 본 발 명을 적용하여 실시하게 되면, 개개인마다 느끼는 체감온도가 다른 문제점을 해소하도록 한 것이다. 또한 본 발명의 실시에 있어, 개인이 느낀 체감온도를 데이터로 만들고, 인공지능으로 학습 시키도록 구성한 개인 맞춤 일기예보로 구성한 본 발명을 적용하여 실시하게 되면, 개개인의 특성을 더욱 고려하여 일기 예보 를 할 수 있게 될 것이다."}
{"patent_id": "10-2021-0137295", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1: 위치 기반하여 기상을 1차로 예상하고, 그다음 개인의 특성 데이터를 고려하여 최종적으로 체감온도를 포 함한 일기예보를 해줍니다."}
