{"patent_id": "10-2023-0066141", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0168598", "출원번호": "10-2023-0066141", "발명의 명칭": "인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램", "출원인": "(주)마이크로에듀", "발명자": "홍원경"}}
{"patent_id": "10-2023-0066141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 기반 국가자격증 학습 서비스 제공 방법에 있어서,미리 설정된 챕터 (chapter) 구분에 따라, 각 챕터 별로 하나 이상의 후보 지식을 포함하도록 지식 베이스를 구성하는, 지식 베이스 구성 단계;사용자의 테스트 결과로부터, 오답 문항에 대한 질문 정보 및 선택지 정보를 획득하는, 오답 문항 정보 획득 단계;상기 오답 문항에 대한 질문 정보 및 선택지 정보로부터 복수의 키워드 정보를 추출하고, 상기 추출된 복수의키워드 정보에 기반한 웹 크롤링을 수행하여 상기 오답 문항에 대해 미리 설정된 개수의 추가 후보 지식을 생성하는, 추가 후보 지식 생성 단계;상기 지식 베이스에 포함된 상기 오답 문항과 관련된 챕터에 대응하는 하나 이상의 후보 지식 및 상기 미리 설정된 개수의 추가 후보 지식 각각에 대해 적용되는 평가 점수에 기초하여 1순위로 판단된 최우선 후보 지식을선정하는, 최우선 후보 지식 선정 단계; 및상기 선정된 최우선 후보 지식에 기반하여, 상기 오답 문항에 대한 해설 서비스를 제공하거나 상기 오답 문항에대한 유사 문항을 생성하여 제공하는, 학습 서비스 제공 단계를 포함하는 것을 특징으로 하는, 인공지능 기반국가자격증 학습 서비스 제공 방법."}
{"patent_id": "10-2023-0066141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 지식 베이스 구성 단계는,시험 과목별로 미리 설정된 하나 이상의 챕터 정보를 획득하는 단계; 별도로 획득된 복수의 문항들 각각에 대한 질문 정보 및 선택지 정보에 기반하여 상기 복수의 문항들 각각에 대한 키워드 정보를 추출하고, 상기 추출된 키워드에 기반한 웹 크롤링을 수행하여 상기 복수의 문항들 각각에 대한 하나 이상의 후보 지식을 생성하는 단계; 및상기 복수의 문항들 각각에 대한 하나 이상의 후보 지식에 대해 대응하는 시험 과목 및 대응하는 챕터를 식별하고, 상기 복수의 문항들 각각에 대한 하나 이상의 후보 지식이 상기 식별된 과목 및 식별된 챕터에 포함되도록상기 지식 베이스를 구성하는 단계를 포함하는 것을 특징으로 하는, 인공지능 기반 국가자격증 학습 서비스 제공 방법."}
{"patent_id": "10-2023-0066141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 추출된 복수의 키워드 정보는 상기 오답 문항에 대한 출제 의도 파악, 검색 키워드 결정 중 적어도 하나이상을 위해 활용되고,상기 미리 설정된 개수는 3개인 것을 특징으로 하는, 인공지능 기반 국가자격증 학습 서비스 제공 방법."}
{"patent_id": "10-2023-0066141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 오답 문항에 대해 미리 설정된 개수의 추가 후보 지식은,상기 추출된 복수의 키워드 정보에 기반한 웹 크롤링을 수행하여 획득되는 텍스트 데이터를 일정한 글자수 범위로 요약 정리된 문서 형태로 구성되는 것을 특징으로 하는, 인공지능 기반 국가자격증 학습 서비스 제공 방법.공개특허 10-2024-0168598-3-청구항 5 제 1항에 있어서,상기 평가 점수는,대응하는 후보 지식 또는 대응하는 추가 후보 지식에 대한 회원 평가 점수, 전문가의 평가 점수 중 적어도 하나이상에 기반하여 결정되는 것을 특징으로 하는, 인공지능 기반 국가자격증 학습 서비스 제공 방법."}
{"patent_id": "10-2023-0066141", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "컴퓨터 장치 또는 사용자 장치와 결합되어, 제1 항 내지 제5항 중 어느 한 항의 방법을 실행시키기 위하여 매체에 저장된, 인공지능 기반 국가자격증 학습 서비스 제공 프로그램."}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램을 제공한다. 일 예로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법은, 미리 설정된 챕터 (chapter) 구분에 따라, 각 챕터 별로 하 나 이상의 후보 지식을 포함하도록 지식 베이스를 구성하는, 지식 베이스 구성 단계; 사용자의 테스트 결과로부 (뒷면에 계속)"}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 (artificial intelligence; AI) 기반 국가자격증 학습 서비스 제공 방법 및 프로그램에 관 한 것이다. 보다 상세하게, 본 발명은 AI 기반 키워드 추출 및 정보 크롤링을 통해 지식 베이스 (knowledge base)를 구축하고, 이를 활용하여 사용자 맞춤형 학습 서비스를 제공하는 방법 및 프로그램에 관한 것이다."}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 코로나 19 상황을 거치며 초등학교부터 대학교 수업 뿐만 아니라 다양한 교육 시스템까지 비대면 수업 시 스템이 적용되고 있고, 이에 따른 평가 시스템 또한 비대면으로 운영/관리되고 있다. 다만, 대부분의 시스템들은 사용자인 국가자격증 학습자에게 틀린 문제에 대한 피드백 없이 시험/테스트의 결과 인 평가 점수만을 단순 제공하거나, 또는 해당 문제에 대한 출제자의 간단한 해설을 단순 제공하는데 그치고 있 다. 이로 인해, 많은 국가자격증 학습자들은 시험/테스트를 통해 자신에게 부족한 점이 무엇인지를 확인하지 못 하는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 공보 제 10-2022-0018680 호 (2022.02.15)"}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 상술한 종래의 문제점을 해결하기 위한 것으로서, 인공 지능 기반의 키워드 추출 및 지식 크 롤링을 통해 국가자격증 학습자 개인에게 맞춤형 학습 서비스를 제공할 수 있는, 인공지능 기반 국가자격증 학 습 서비스 제공 방법 및 프로그램을 제공하는 것이다."}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 목적을 해결하기 위한 일 실시예에 따르면, 인공지능 기반 국가자격증 학습 서비스 제공 방법은, 미 리 설정된 챕터 (chapter) 구분에 따라, 각 챕터 별로 하나 이상의 후보 지식을 포함하도록 지식 베이스를 구성 하는, 지식 베이스 구성 단계; 사용자의 테스트 결과로부터, 오답 문항에 대한 질문 정보 및 선택지 정보를 획 득하는, 오답 문항 정보 획득 단계; 상기 오답 문항에 대한 질문 정보 및 선택지 정보로부터 복수의 키워드 정 보를 추출하고, 상기 추출된 복수의 키워드 정보에 기반한 웹 크롤링을 수행하여 상기 오답 문항에 대해 미리 설정된 개수의 추가 후보 지식을 생성하는, 추가 후보 지식 생성 단계; 상기 지식 베이스에 포함된 상기 오답 문항과 관련된 챕터에 대응하는 하나 이상의 후보 지식 및 상기 미리 설정된 개수의 추가 후보 지식 각각에 대 해 적용되는 평가 점수에 기초하여 1순위로 판단된 최우선 후보 지식을 선정하는, 최우선 후보 지식 선정 단계; 및 상기 선정된 최우선 후보 지식에 기반하여, 상기 오답 문항에 대한 해설 서비스를 제공하거나 상기 오답 문항에 대한 유사 문항을 생성하여 제공하는, 학습 서비스 제공 단계를 포함한다. 본 발명에 있어, 상기 지식 베이스 구성 단계는, 시험 과목별로 미리 설정된 하나 이상의 챕터 정보를 획득하는 단계; 별도로 획득된 복수의 문항들 각각에 대한 질문 정보 및 선택지 정보에 기반하여 상기 복수의 문항들 각 각에 대한 키워드 정보를 추출하고, 상기 추출된 키워드에 기반한 웹 크롤링을 수행하여 상기 복수의 문항들 각 각에 대한 하나 이상의 후보 지식을 생성하는 단계; 및 상기 복수의 문항들 각각에 대한 하나 이상의 후보 지식 에 대해 대응하는 시험 과목 및 대응하는 챕터를 식별하고, 상기 복수의 문항들 각각에 대한 하나 이상의 후보 지식이 상기 식별된 과목 및 식별된 챕터에 포함되도록 상기 지식 베이스를 구성하는 단계를 포함할 수 있다. 본 발명에 있어, 상기 추출된 복수의 키워드 정보는 상기 오답 문항에 대한 출제 의도 파악, 검색 키워드 결정 중 적어도 하나 이상을 위해 활용되고, 상기 미리 설정된 개수는 3개일 수 있다. 본 발명에 있어, 상기 오답 문항에 대해 미리 설정된 개수의 추가 후보 지식은, 상기 추출된 복수의 키워드 정"}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "보에 기반한 웹 크롤링을 수행하여 획득되는 텍스트 데이터를 일정한 글자수 범위로 요약 정리된 문서 형태로 구성될 수 있다. 본 발명에 있어, 상기 평가 점수는, 대응하는 후보 지식 또는 대응하는 추가 후보 지식에 대한 회원 평가 점수, 전문가의 평가 점수 중 적어도 하나 이상에 기반하여 결정될 수 있다. 본 발명의 목적을 해결하기 위한 다른 실시예에 따르면, 인공지능 기반 국가자격증 학습 서비스 제공 프로그램 은 컴퓨터 장치 또는 사용자 장치와 결합되어, 상술한 인공지능 기반 국가자격증 학습 서비스 제공 방법을 실행 시키기 위하여 매체에 저장된다."}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사용자 (회원, 학습자)는 오답 문항에 대한 최선의 해설 서비스 및/또는 맞춤형 유사 문제 서비스를 제공받을 수 있고, 이를 통해 사용자는 종래 대비 높은 학습 효과를 기대할 수 있다. 또한, 본 발명에 따르면, 서비스 제공자는 특정 과목/문항에 적합한 후보 정보 (또는 해설 정보)를 지식 베이스 업데이트를 통해 항상 최신의 정보로 구성할 수 있는 바, 사용자 (회원)에게 항상 최적의 학습 서비스를 제공할 수 있다."}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램 의 일 실시예를 설명한다. 이때, 본 발명은 실시예에 의해 제한되거나 한정되는 것은 아니다. 또한, 본 발명을 설명함에 있어서, 공지된 기능 혹은 구성에 대해 구체적인 설명은 본 발명의 요지를 명확하게 하기 위해 생략될 수 있다. 도 1은 본 발명이 적용 가능한 다양한 분야들을 나타낸 도면이다. 도 1에 도시된 바와 같이, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램은 다 양한 콘텐츠에 적용될 수 있고, 이에 따라 도 1과 같이 다양한 수요 및 공급에 활용될 수 있다. 보다 구체적으로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램은, 국가자격증 문제은행, 방송대학교 중간/기말시험 문제은행, 학점은행/사이버대 수강후기, 내일배움/평생교육바우처, 원격대 학별 학습 커뮤니티 등에 적용될 수 있다. 추가적으로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램은 다양한 콘텐츠에 활용되어 국가자격증 모의고사, 국가자격증 수업도구 등에도 활용될 수 있다.컨텐츠 측면에서, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램은, 인공지능 기반 키워드 추출 및 후보지식 크롤링 기법 및 학습경험 지식베이스에 기반하여, AI 기반 학습경험 분석 서비스 를 제공할 수 있고, 이에 기반하여 맞춤형 콘텐츠, 지능형 학습 분석, 교육 상담 AI 챗봇 등의 서비스에도 활용 될 수 있을 것으로 기대된다. 이러한 다양한 활용예 및 확장예를 고려할 때, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방 법 및 프로그램은, 출판사, 학원, 교육 전문가 등의 공급처를 통해, 방송대학, 학점은행제, 사이버 대학 등의 다양한 수요처에 제공될 수 있을 것이다. 이하에서는 도면을 참고하여 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램에 대해 상세히 설명한다. 이때, 후술하는 인공지능 기반 국가자격증 학습 서비스 제공 방법은 사용자 (회원)의 사 용자 장치 (또는 컴퓨터 장치)와 유무선 네트워크를 통해 연결되는 컴퓨터 서버에 의해 수행될 수 있다고 가정 한다. 다시 말해, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램은 상기 컴퓨터 서버의 제어에 따라 상기 사용자 (회원)의 사용자 장치 (또는 컴퓨터 장치) 상에서 구현될 수 있다고 가정한다. 도 2는 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법을 위한 전체 메커니즘을 간단히 나타 낸 도면이고, 도 3은 본 발명의 일 실시예에 따른 인공지능 기반 국가자격증 학습 서비스를 제공하는 방법을 간 단히 나타낸 흐름도이다. 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 미리 설정된 챕터 (chapter) 구분에 따라, 각 챕터 별로 하나 이상의 후보 지식을 포함하도록 지식 베이스를 구성한다 (S310). 본 발명에 있어, 지식 베이스는 집단 지성 시스템에 기초한 위키피디아 형식으로 구축될 수 있다. 다시 말해, 상기 지식 베이스는 고정된 (fix) 챕터 구성이 아닌 참여자들의 의견에 따라 변경 가능한 (changeable) 챕터 구 성을 갖도록 구축될 수 있다. 이에 따라, 상술한 '미리 설정된 챕터 구분'이라 함은, 위키피디아 형식과 같이 해당 시점 기준으로 설정된/결정된 챕터 구분을 의미할 수 있다. 따라서, 상술한 '미리 설정된 챕터 구분'이라 함은, 식별되는 시점에 따라 변경될 수 있다. 본 발명에 있어, 챕터(chapter)라 함은 시험 과목별 교과 내용을 일정 기준으로 구분하는 단위를 의미할 수 있 다. 본 발명에 적용 가능한 일 예로, 각 시험과목 별 챕터의 총 개수는 15개 정도 (예: 13개 ~ 17개)로 설정될 수 있다. 다만, 이는 일 예에 불과하며, 챕터의 개수는 각 시험 과목의 특성, 각 시험 과목에 대한 주요 고과서 의 목차 구성 등에 따라 다양하게 설정될 수도 있다. 본 발명에 있어, 각 챕터의 이름인 챕터명은 대부분의 교육 종사자 또는 국가자격증 학습자들이 쉽게 파악할 수 있도록 주요 저작물 (예: 유명한 교과서, 저명한 저자의 저작물 등)의 챕터명을 인용하여 구성될 수 있다. 이러 한 인용은 특정 시험 과목에 대한 초기 챕터 구성시에만 적용될 수 있고, 상술한 바와 같이 본 발명에 따른 지 식 베이스는 위키피디아 형식으로 구축되는 바, 이후 챕터 구성 및/또는 이에 따른 각 챕터명은 참여자들의 참 여에 따라 변경될 수 있다. 다만, 무분별한 변경을 방지하는 차원에서, 상기 챕터명 선정은 시스템에 의해 인증 된 사람 (예: 해당 시험 과목과 관련된 석사 학위 이상 소지자, 해당 시험 과목과 관련된 자격증 소지자 등)에 한하여 수행되도록 제한될 수도 있다. 상술한 바와 같은 지식 베이스를 구성하기 위해, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 구체적으로 다음과 같은 동작을 수행할 수 있다. 먼저, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 시험 과목별로 미리 설정된 하나 이상의 챕터 정보를 획득할 수 있다. 이때, 시험 과목별로 미리 설정된 하나 이상의 챕터 정보라 함은 상술한 바와 같이 해당 시점 기준으로 인공지능 기반 국가자격증 학습 서비스 제공 프로그램에 설정된 하나 이상의 챕 터 정보를 의미할 수 있다. 이어, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 별도로 복수의 문항들을 획득할 수 있다. 이때, 별도의 복수의 문항들이라 함은 특정 시험 과목의 특정 챕터로 구분된 문항들을 포함할 수 있다. 다시 말해, 상기 별도의 복수의 문항들은 지식 베이스를 구축하기 위한 기초 문항들일 수 있다. 다른 실 시예로 또는 추가 실시예로, 상기 별도의 복수의 문항들은 관련 시험 과목 및/또는 관련 챕터 정보가 없는 (즉, 시험 과목 및/또는 관련 챕터 정보에 대한 인덱스 정보가 없는) 트레이닝 문항들을 포함할 수 있다. 이때, 상술 한 기초 문항들 또는 트레이닝 문항들 여부에 따라 상이한 동작들에 대해서는 이후에 상세히 설명한다. 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 상술한 바와 같은 별도로 획득된 복수 의 문항들 각각에 대한 질문 정보 및 선택지 정보에 기반하여 상기 복수의 문항들 각각에 대한 키워드 정보를 추출할 수 있다. 이때, 상술한 기초 문항들에 대해서는 관련 시험 과목 및/또는 관련 챕터 정보를 알고 있는 바, 상기 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 상기 관련 시험 과목 정보 (예: 시험 과목명, 관련 자격증 명칭 등) 및/또는 관련 챕터 정보 (예: 챕터명 등)를 상기 키워드 정보로 추출할 수 있다. 반면, 상술한 트레이닝 문항들에 대해서는 (기초 문항들의 경우와 달리) 관련 시험 과목 및/또는 관련 챕터 정보를 모 르는 바, 상기 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 상기 문항들에 대한 질문 정보 및 선택 지 정보로부터 관련 시험 과목 정보 및/또는 관련 챕터 정보를 추출/추론하고, 상기 추출/추론된 관련 시험 과 목 정보 및/또는 관련 챕터 정보를 상기 키워드 정보로 추출할 수 있다. 본 발명에 따른 인공지능 기반 국가자 격증 학습 서비스 제공 프로그램은, 상술한 방법에 따라 추출된 키워드에 기반한 웹 크롤링을 수행하여 상기 복 수의 문항들 각각에 대한 하나 이상의 후보 지식을 생성할 수 있다. 이때, 특정 문항에 대한 질문 정보 및 선택 지 정보로부터 추출되는 키워드 정보는 최대 3개로 제한 설정될 수 있다. 다만, 이는 일 실시예에 불과하며, 특 정 문항에 대한 질문 정보 및 선택지 정보로부터 추출되는 키워드 정보는 해당 문항에 대한 선택지 정보의 개수 (예: 5지 선다의 경우 5개)로 제한 설정될 수도 있다. 본 발명에 있어, 추출된 키워드에 기반한 웹 크롤링을 수행한다라고 함은, 상술한 방식에 따라 추출된 키워드 정보를 기반으로 웹페이지에서 관련 내용을 크롤링하고, 각 문항 별로 일정 개수 (예: 3개)의 웹페이지 크롤링 을 선정하는 것을 포함할 수 있다. 다시 말해, 본 발명에 있어, 추출된 키워드에 기반한 웹 크롤링을 수행한다 라고 함은, 상술한 방식에 따라 추출된 키워드 정보를 모두 또는 일부 사용하여 검색된 결과 값들 중 일정 개수 (예: 최대 3개)의 결과 값을 선정하는 것을 포함할 수 있다. 추가적인 실시예로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 상술한 방식에 따"}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "라 크롤링된 내용을 일정한 글자수 범위로 요약 정리할 수 있다. 이어, 요약 정리된 문서 (데이터)를 후보 지식 으로 생성할 수 있다. 이어, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 상술한 복수의 문항들 각각에 대한 하나 이상의 후보 지식에 대해 대응하는 시험 과목 및 대응하는 챕터를 식별하고, 상기 복수의 문항들 각 각에 대한 하나 이상의 후보 지식이 상기 식별된 과목 및 식별된 챕터에 포함되도록 지식 베이스를 구성할 수 있다. 보다 구체적으로, 상술한 복수의 문항들이 상술한 기초 문항들이라면 상기 인공지능 기반 국가자격증 학 습 서비스 제공 프로그램은 관련 시험 과목 및/또는 관련 챕터 정보를 알고 있는 바, 상기 인공지능 기반 국가 자격증 학습 서비스 제공 프로그램은 상기 관련 시험 과목 정보 (예: 시험 과목명, 관련 자격증 명칭 등) 및/또 는 관련 챕터 정보 (예: 챕터명 등)를 식별하여 이를 기초로 대응하는 후보 지식이 상기 식별된 과목 및 식별된 챕터에 포함되도록 상기 지식 베이스를 구성할 수 있다. 반면, 상술한 복수의 문항들이 상술한 트레이닝 문항들 이라면 상기 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 상술한 과정을 통해 해당 문항에 대한 관 련 시험 과목 정보 및/또는 관련 챕터 정보를 추출/추론한 바, 상기 인공지능 기반 국가자격증 학습 서비스 제 공 프로그램은 상기 추출/추론된 관련 시험 과목 정보 및/또는 관련 챕터 정보를 식별하여 이를 기초로 대응하 는 후보 지식이 상기 식별된 과목 및 식별된 챕터에 포함되도록 상기 지식 베이스를 구성할 수 있다. 상술한 지식 베이스 구성 단계와 별개로 또는 독립적으로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비 스 제공 프로그램은 사용자 (회원)의 테스트 결과로부터, 오답 문항에 대한 질문 정보 및 선택지 정보를 획득할 수 있다 (S320). 보다 구체적인 예로, 상기 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 사용자 (회 원)의 오답노트로부터 오답 문항에 대한 질문 정보 및 선택지 정보를 획득할 수 있다. 이어, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 오답 문항에 대한 질문 정보 및 선택지 정보로부터 복수의 키워드 정보를 추출하고, 상기 추출된 복수의 키워드 정보에 기반한 웹 크롤링을 수 행하여 상기 오답 문항에 대해 미리 설정된 개수의 추가 후보 지식을 생성할 수 있다 (S330). 본 발명에 적용 가능한 실시예에서, 상술한 오답 문항에 대한 질문 정보 및 선택지 정보로부터 복수의 키워드 정보를 추출하고 이에 기반한 웹 크롤링을 수행하여 추가 후보 지식을 생성하는 구체적인 동작은 앞서 상술한 트레이닝 문항을 이용하여 키워드를 추출하고 이에 기반한 웹 크롤링을 수행하여 후보 지식을 생성하는 동작과 동일할 수 있다. 보다 구체적으로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 상 기 추출된 복수의 키워드 정보를 오답 문항에 대한 출제 의도 파악, 검색 키워드 결정 중 적어도 하나 이상을 위해 활용할 수 있다. 바람직하게는, 상기 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 키워드 정보 를 통해 파악된 출제 의도에 기반하여 결정된 검색 키워드를 이용하여 웹 크롤링을 수행하고, 이에 따른 결과를 이용하여 오답 문항에 대해 미리 설정된 개수의 추가 후보 지식을 생성할 수 있다. 이때, 상기 미리 설정된 개수는 3개로 제한될 수 있으나, 실시예에 따라 상기 미리 설정된 개수는 선택지의 개수 (예: 5지 선다의 경우 5 개)로 설정될 수도 있다. 또한, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 오답 문항에 대한 추가 후보 지 식을 생성함에 있어, 상술한 방식에 따라 추출된 복수의 키워드 정보에 기반한 웹 크롤링을 수행하여 획득되는"}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "텍스트 데이터를 일정한 글자수 범위로 요약 정리된 문서 형태로 구성되도록 상기 추가 후보 지식을 생성할 수 있다. 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 지식 베이스에 포함된 상술한 오답 문 항과 관련된 챕터에 대응하는 하나 이상의 후보 지식 및 상술한 방식에 따라 생성된 (미리 설정된 개수의) 추가 후보 지식 각각에 대해 적용되는 평가 점수에 기초하여 1순위로 판단된 최우선 후보 지식을 선정할 수 있다 (S340). 보다 구체적으로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 상술한 방식에 따라 구축된 지식 베이스 중 오답 문항과 관련된 챕터 내 후보 지식 및 오답 문항에 대한 웹 크롤링 을 통해 획득된 추가 후보 지식 각각에 대해 적용되는 평가 점수를 식별하고, 상기 식별된 평가 점수를 비교하 여 이 중 1순위로 판단된 최우선 후보 지식을 선정할 수 있다. 본 발명에 있어, 상술한 평가 점수는, 대응하는 후보 지식 또는 대응하는 추가 후보 지식에 대한 회원 평가 점 수, 전문가의 평가 점수 중 적어도 하나 이상에 기반하여 결정될 수 있다. 보다 구체적인 실시예에 따르면, 각 후보 지식 또는 추가 후보 지식에 대한 회원 평가 (예: 호/불호 표시, 5점 척도 평가 등) 및 전문가의 평가를 종합적으로 반영한 지표가 상기 평가 점수로 활용될 수 있다. 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 상술한 방법을 통해 선정된 최우선 후 보 지식에 기반하여, 오답 문항에 대한 해설 서비스를 제공하거나 상기 오답 문항에 대한 유사 문항을 생성하여 제공함으로써 사용자에게 맞춤형 학습 서비스를 제공할 수 있다 (S350). 이하에서는 본 발명에 적용 가능한 구체적인 예시를 제시하여 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법 및 프로그램에 대해 상세히 설명한다. 국가자격증의 한 종류인 사회복지사 1급의 경우, {인간행동과사회환경, 사회복지조사론, 사회복지실천론, 사회 복지실천기술론, 지역사회복지론, 사회복지정책론, 사회복지행정론, 사회복지법제론} 등 총 8개 시험 과목을 필 요로 한다. 이 중, 첫번째 수험 과목인 '인간행동과사회환경' 과목을 예시로 하면, 본 발명에 따른 인공지능 기 반 국가자격증 학습 서비스 제공 방법 및 프로그램은 다음과 같이 수행될 수 있다. 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, '인간행동과사회환경' 과목에 대하여, 미리 설정된 챕터 (chapter) 구분에 따라, 각 챕터 별로 하나 이상의 후보 지식을 포함하도록 지식 베이스를 구 성할 수 있다. 일 예로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 어느 방송대 학교의 학습 목차인 아래의 챕터 구분을 참고하여 해당 과목에 대한 지식 베이스를 구성할 수 있다. 1강. 인간과 인간행동의 이해 2강. 인간행동의 형성과 사회환경 3강. 인간행동의 연구와 실천 4강. 정신분석적 이론 5강. 행동주의 이론 6강. 사회적 학습이론 7강. 인본주의 이론 8강. 사회환경에 대한 관점과 생태체계이론 9강. 가족과 집단 10강. 조직과 지역공동체 11강. 건강한 성격, 스트레스와 적응 12강. 부적응행동의 개념과 유형 13강. 아동기의 사회환경과 부적응행동 14강. 청소년기의 사회환경과 부적응행동 15강. 청장년기 및 중년기의 사회환경과 부적응행동 이때, '인간행동과사회환경' 과목에 대한 지식 베이스를 구성한다고 함은, 상술한 바와 같이 각 챕터 별로 기초 문항들 및/또는 트레이닝 문항들에 기초한 키워드 정보 추출 및 웹 크롤링에 기반하여 생성된 하나 이상의 후보 지식을 포함하도록 상기 지식 베이스를 구성하는 것을 의미할 수 있다. 이어, 사용자의 테스트 결과 (예: 오답 노트)로부터 아래와 같은 오답 정보가 획득되었다고 가정한다. 참고로, 아래 문항은 2022년 사회복지사 1급 인간행동과사회환경 1번 문제에 해당한다. 1. 인간발달의 원리에 관한 설명으로 옳지 않은 것은? ① 발달에는 최적의 시기가 존재하지 않는다. ② 발달의 각 영역은 상호 밀접한 연관이 있다. ③ 일정한 순서와 방향이 있어서 예측 가능하다. ④ 대근육이 있는 중심부위에서 소근육의 말초부위 순으로 발달한다. ⑤ 연속적 과정이지만 발달의 속도는 일정하지 않다. 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 상술한 오답 정보로부터 인간행동과 사회환경, 인간발달의 원리 등의 키워드를 추출할 수 있다. 이어, 상기 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 추출된 키워드를 이용하여 다음과 같은 결과를 추출하고 이를 활용하여 추가 후보 지식을 생 성할 수 있다. (예: 웹크롤링 결과) https://blog.naver.com/heuck_ya/60116993400 https://vkdlfl11.tistory.com/419 http://www.igukak.co.kr/right/1-9.html (웹크롤링 결과 1)"}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "(웹크롤링 결과 2) 이처럼, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 오답 분석을 통해 키워드를 추출하고, 추출된 키워드에 기반하여 크롤링을 수행할 수 있다. 보다 구체적인 예로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 문제은행식 시험 문제의 각 문항별로 키워드를 추출하여 지식 베이스를 구축하고, (오답 문항의 경우) 이에 대응하는 학습 서비 스를 사용자에게 제공할 수 있다. 이처럼, 본 발명에 있어 키워드 추출이란 각 시험문제의 각 문항의 질문 및 선다지로 구성된 텍스트 데이터를 대표하는 주요 키워드를 추출하는 작업을 의미할 수 있다. 이렇게 추출된 키 워드는 각 문항의 질문의 요구 내용 또는 출제 의도를 파악하거나 검색하기 위해 사용될 수 있다. 상술한 바와 같이, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 추출된 키워드를 기반으로 웹페 이지에서 관련 내용을 크롤링할 수 있다. 이때, 상기 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 시험문제 문항별로 3개의 웹페이지 크로링을 선정할 수 있다. 추가적으로, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은 상술한 바와 같이 선정된"}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "크롤링 내용을 일정한 글자수 범위로 요약 정리하고, 요약 정리된 문서를 대상으로 우선 순위를 정함과 동시에 이를 지식 베이스에 저장할 수 있다. 이어, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그 램은 해설 설명에 대한 가중치 부여 및 후보지식 순위 결정을 통해 최선의 후보 지식을 선정하고, 이에 기반한 학습 서비스를 사용자에게 제공할 수 있다. 보다 구체적인 예로, 상기 따른 인공지능 기반 국가자격증 학습 서 비스 제공 프로그램은, 정답 해설에 대한 회원(좋아요 또는 5점 척도 평가) 및 전문가의 평가를 반영한 우선 순 위를 반영하여 후보지식 1개를 선정하고, 상기 선정된 후보 지식을 사용자에게 제공하거나 상기 선정된 후보 지 식을 이용하여 사용자 맞춤형 유사 문제를 생성/추천할 수 있다. 또한, 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 컴퓨터 장치 또는 사용자 장치 와 결합되어, 상술한 인공지능 기반 국가자격증 학습 서비스 제공 방법을 실행시키기 위하여 매체에 저장될 수 있다.상술한 인공지능 기반 국가자격증 학습 서비스 제공 프로그램은, 컴퓨터 장치, 서버, 사용자 장치 중 적어도 하 나 이상 또는 그 조합이 프로그램을 읽어 들여 프로그램으로 구현된 상기 방법들을 실행시키기 위하여, 상기 인 공지능 기반 국가자격증 학습 서비스 제공 프로그램이 구현된 장치의 프로세서(CPU)가 상기 인공지능 기반 국가 자격증 학습 서비스 제공 프로그램이 구현된 장치의 장치 인터페이스를 통해 읽힐 수 있는 C, C++, JAVA, 기계 어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 상기 방법들을 실행하는 필요한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Functional Code)를 포함할 수 있고, 상기 기능들을 상기 인 공지능 기반 국가자격증 학습 서비스 제공 프로그램이 구현된 장치의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수 있다. 또한, 이러한 코드는 상기 기능들을 상기 인공지능 기반 국가자격증 학습 서비스 제공 프로그램이 구현된 장치의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 상기 인공지능 기반 국가자격증 학습 서비스 제공 프로그램이 구현된 장치의 내부 또는 외부 메모리의 어느 위 치(주소 번지)에서 참조되어야 하는지에 대한 메모리 참조 관련 코드를 더 포함할 수 있다. 또한, 상기 인공지 능 기반 국가자격증 학습 서비스 제공 프로그램이 구현된 장치의 프로세서가 상기 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠한 다른 컴퓨터 장치, 서버 등과 통신이 필요한 경우, 코드는 상기 인공지능 기반 국 가자격증 학습 서비스 제공 프로그램이 구현된 장치의 통신 모듈을 이용하여 원격에 있는 어떠한 다른 컴퓨터 장치, 서버 등과 어떻게 통신해야 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는지 등에 대한 통신 관련 코드를 더 포함할 수 있다. 상기 저장되는 매체는, 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반 영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상기 저 장되는 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있지만, 이에 제한되지 않는다. 즉, 상기 프로그램은 상기 컴퓨터가 접속할 수 있는 다양한 서버 상의 다양한 기록매체 또는 사용자의 상기 컴퓨터상의 다양한 기록매체에 저장될 수 있다. 또한, 상기 매체는 네트워크로 연결된 컴퓨터 시 스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장될 수 있다."}
{"patent_id": "10-2023-0066141", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "상술한 바와 같이 도면을 참조하여 본 발명의 바람직한 실시예를 설명하였지만, 해당 기술분야의 숙련된 당업자 라면, 하기의 청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하 게 수정 또는 변경시킬 수 있다."}
{"patent_id": "10-2023-0066141", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명이 적용 가능한 다양한 분야들을 나타낸 도면이다. 도 2는 본 발명에 따른 인공지능 기반 국가자격증 학습 서비스 제공 방법을 위한 전체 메커니즘을 간단히 나타 낸 도면이다. 도 3은 본 발명의 일 실시예에 따른 인공지능 기반 국가자격증 학습 서비스를 제공하는 방법을 간단히 나타낸 흐름도이다."}
