{"patent_id": "10-2018-0068151", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0143544", "출원번호": "10-2018-0068151", "발명의 명칭": "인공지능 스마트 귀마개", "출원인": "주식회사 수현테크", "발명자": "이종진"}}
{"patent_id": "10-2018-0068151", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 스마트 귀마개로서, 상기 인공지능 스마트 귀마개를 착용한 사용자가 속한 환경 조건에 대한 정보를 수집하기 위한 환경조건정보 수집부; 상기 수집된 환경조건정보를 분석하고, 분석된 결과를 분류(classfication)하기 위한 정보분석부;상기 분류된 환경조건정보에 기초하여 상기 사용자가 속한 환경 조건의 이상변화 유무 또는 상기 사용자가 상기환경 조건 하에 놓여진 경과 시간을 추정하기 위한 동작환경 판단부; 상기 동작환경 판단부에 의한 판단 결과에 따라 상기 귀마개의 사용자 또는 사전 설정된 대상에게 소정의 경보(alarm)를 통지하기 위한 알림신호를 발생시키는 알림신호 발생부;상기 알림신호에 따라 상기 소정의 경보를 출력하기 위한 출력부; 및상기 알림신호를 상기 사전 설정된 대상에게 전달하기 위한 통신부를 포함하고, 상기 환경조건정보에는 온도, 습도, 사운드, 진동, 풍향, 풍속, 주변 기체의 종류 및 농도가 포함되는 것을 특징으로 하는 인공지능 스마트 귀마개."}
{"patent_id": "10-2018-0068151", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 환경조건정보 수집부에는 상기 사용자가 속한 환경의 온도 및 습도를 측정하기 위한 온도습도센서 모듈; 상기 귀마개의 외부로부터의 사운드를 수신하기 위한 마이크로폰 모듈; 상기 귀마개에 대하여 인가된 진동을 감지하기 위한 진동감지센서 모듈; 상기 귀마개로 전달된 풍향 및 풍속을 감지하기 위한 기류감지센서 모듈;상기 귀마개를 착용한 사용자가 속한 환경에서의 기체의 종류 및 농도를 감지하기 위한 기체감지센서 모듈이 포함되는 것을 특징으로 하는 인공지능 스마트 귀마개."}
{"patent_id": "10-2018-0068151", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 정보분석부에서는 상기 환경조건정보 수집부를 통하여 수집된 환경조건정보를 기계학습(machine learning)을 통하여 실시간으로 또는 정기적으로 분석하고, 분석된 결과를 분류하는 것을 특징으로 하는 인공지능 스마트 귀마개."}
{"patent_id": "10-2018-0068151", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 정보분석부에서는 상기 환경조건정보의 수집 빈도에 따라 가중치를 부여하여 기계학습이 수행되고, 상기 동작환경 판단부에서는 상기 정보분석부를 통하여 분류된 환경조건정보에 기초하여 상기 사용자가 속한 환경 조건의 이상변화 유무를 판정하거나 상기 사용자가 상기 환경 조건 하에 놓여진 경과 시간을 추정하여 회차공개특허 10-2019-0143544-3-별로 구분하여 관리하는 것을 특징으로 하는 인공지능 스마트 귀마개."}
{"patent_id": "10-2018-0068151", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 알림신호 발생부에서는 상기 귀마개의 사용자에게 소정의 경보를 통지함으로써 직접 경고를 하거나 또는사전 설정된 대상에게 상기 소정의 경보를 통지하기 위하여 알림신호가 발생되는 것을 특징으로 하는 인공지능스마트 귀마개."}
{"patent_id": "10-2018-0068151", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 귀마개의 사용자로부터 인가된 입력 신호를 수신하기 위한 사용자입력 수신부;를 더 포함하고,상기 알림신호 발생부를 통하여 발생된 알림신호는 상기 사용자로부터 인가된 입력 신호에 의하여 통제 가능한것을 특징으로 하는 인공지능 스마트 귀마개."}
{"patent_id": "10-2018-0068151", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 출력부에서는 상기 알림신호에 따라서 상기 사용자에게 출력될 사운드의 조작 및 진동 인가 중 적어도 하나를 수행함으로써 경보를 출력하고, 상기 사운드의 조작은 사운드를 변조하거나 사운드의 출력량을 증감시키거나 사운드의 출력 패턴을 조작하는 것인 인공지능 스마트 귀마개."}
{"patent_id": "10-2018-0068151", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "인공지능 스마트 귀마개의 동작 방법으로서, 상기 인공지능 스마트 귀마개를 착용한 사용자가 속한 환경 조건에 대한 정보를 수집하는 단계; 상기 수집된 환경조건정보를 분석하고, 분석된 결과를 분류(classfication)하는 단계;상기 분류된 환경조건정보에 기초하여 상기 사용자가 속한 환경 조건의 이상변화 유무 또는 상기 사용자가 상기환경 조건 하에 놓여진 경과 시간을 추정하는 단계; 상기 동작환경 판단부에 의한 판단 결과에 따라 상기 귀마개의 사용자 또는 사전 설정된 대상에게 소정의 경보(alarm)를 통지하기 위한 알림신호를 발생시키는 단계;상기 알림신호에 따라 상기 소정의 경보를 출력하는 단계; 및상기 알림신호를 상기 사전 설정된 대상에게 전달하는 단계를 포함하고, 상기 환경조건정보에는 온도, 습도, 사운드, 진동, 풍향, 풍속, 주변 기체의 종류 및 농도가 포함되는 것을 특징으로 하는 인공지능 스마트 귀마개의 동작 방법."}
{"patent_id": "10-2018-0068151", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항의 방법을 구현하기 위한 프로그램이 기록된 컴퓨터로 판독 가능한 기록 매체.공개특허 10-2019-0143544-4-"}
{"patent_id": "10-2018-0068151", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능 스마트 귀마개는, 인공지능 스마트 귀마개를 착용한 사용자가 속한 환경 조건에 대한 정보를 수집하기 위한 환경조건정보 수집부, 수집된 환경조건정보를 분석하고 분석된 결과를 분류 (classfication)하기 위한 정보분석부, 분류된 환경조건정보에 기초하여 사용자가 속한 환경 조건의 이상변화 유 무 또는 사용자가 환경 조건 하에 놓여진 경과 시간을 추정하기 위한 동작환경 판단부, 동작환경 판단부에 의한 판단 결과에 따라 귀마개의 사용자 또는 사전 설정된 대상에게 소정의 경보(alarm)를 통지하기 위한 알림신호를 발생시키는 알림신호 발생부, 알림신호에 따라 소정의 경보를 출력하기 위한 출력부 및 알림신호를 사전 설정된 대상에게 전달하기 위한 통신부를 포함할 수 있다."}
{"patent_id": "10-2018-0068151", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 스마트 귀마개에 관한 것으로, 더욱 상세하게는 사용자의 스마트 귀마개의 사용 환경을 소 정의 기간 동안 분석하고, 분석된 결과에 기초하여 사용자 등에게 경보(alarm) 등의 알림 통지를 하기 위한 인 공지능 스마트 귀마개에 관한 것이다."}
{"patent_id": "10-2018-0068151", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "갱도, 조선소, 자동차 등에서와 같이 일정한 소리 레벨(dB)의 타격음, 마찰음 등이 발생될 수 있는 작업 환경 하에서의 작업자는 다양한 종류의 소음을 차폐하거나 줄이기 위하여 단순한 형태의 귀마개를 사용하곤 한다. 이 러한 귀마개의 사용은 작업자의 난청 등과 같은 산업재해를 예방하기 위하여 사용이 독려(권장)되어오고 있다. 다만, 스펀지 등의 기초적인 차음 소재만을 사용한 단순한 형태의 귀마개는 작업장 등에서 발생되는 소음을 차 단하는데는 효과가 있을 수 있지만, 작업자간 대화, 주변 환경에서의 벌어지는 이상 상황(예컨대, 위험 상황) 등의 각종 경보음 등도 마찬가지로 차단하기 때문에 대화 또는 주변 상황의 인지를 위하여 귀마개를 벗어야만 하는 등의 번거로움을 발생시키고, 이러한 번거로움은 작업자들로 하여금 귀마개의 착용을 등한시 하거나 한쪽 귀에만 귀마개를 착용하는 등의 변칙적인 사용 양상을 초래하고 있다. 이에 따라 작업자들에게는 양이 (binaural) 전부 난청이 발생하거나 한 쪽 귀에 대하여 난청이 발생하는 등의 건강상의 이상이 종종 발생되게 된다. 이러한 작업자들의 난청 발생은 작업자 개인 뿐만 아니라, 작업환경을 제공하는 기업에게도 업무 효율 저하, 생 산성 감퇴하는 파생적인 문제점을 야기하곤 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 대한민국 공개특허공보 제10-2015-0021290호 (공개일자: 2015.3.2)"}
{"patent_id": "10-2018-0068151", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 갱도, 조선소 등 소음이 발생될 수 있는 작업환경 하에서 작업자가 귀마개를 착용할 경우, 비상상황 발생 시, 작업자(즉, 귀마개 착용자)는 비상상황이 발생되었음을 인지할 수 있는 속도가 귀마개 미착용자 등에 비하여 상대적으로 더뎌질 수 있다는 점에서, 빠르고 정확하게 작업자에게 작업환경의 변화를 통지하여 인지할 수 있도록 하고자 한다."}
{"patent_id": "10-2018-0068151", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예로써, 인공지능 스마트 귀마개 및 그 동작 방법이 제공될 수 있다. 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개는, 인공지능 스마트 귀마개를 착용한 사용자가 속한 환경 조건에 대한 정보를 수집하기 위한 환경조건정보 수집부, 수집된 환경조건정보를 분석하고 분석된 결과를 분류 (classfication)하기 위한 정보분석부, 분류된 환경조건정보에 기초하여 사용자가 속한 환경 조건의 이상변화 유무 또는 사용자가 환경 조건 하에 놓여진 경과 시간을 추정하기 위한 동작환경 판단부, 동작환경 판단부에 의 한 판단 결과에 따라 귀마개의 사용자 또는 사전 설정된 대상에게 소정의 경보(alarm)를 통지하기 위한 알림신 호를 발생시키는 알림신호 발생부, 알림신호에 따라 소정의 경보를 출력하기 위한 출력부 및 알림신호를 사전설정된 대상에게 전달하기 위한 통신부를 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 환경조건정보에는 온도, 습도, 사운드, 진동, 풍향, 풍속, 주변 기체의 종류 및 농도가 포함될 수 있다. 환경조건정보 수집부에는 귀마개를 착용한 사용자가 속한 환경의 온도 및 습도를 측정하기 위한 온도습도센서 모듈, 귀마개의 외부로부터의 사운드를 수신하기 위한 마이크로폰 모듈, 귀마개에 대하여 인가된 진동을 감지하 기 위한 진동감지센서 모듈, 귀마개로 전달된 풍향 및 풍속을 감지하기 위한 기류감지센서 모듈, 귀마개를 착용 한 사용자가 속한 환경에서의 기체의 종류 및 농도를 감지하기 위한 기체감지센서 모듈이 포함될 수 있다. 정보분석부에서는 환경조건정보 수집부를 통하여 수집된 환경조건정보를 기계학습(machine learning)을 통하여 실시간으로 또는 정기적으로 분석하고, 분석된 결과를 분류할 수 있다. 정보분석부에서는 환경조건정보의 수집 빈도에 따라 가중치를 부여하여 기계학습이 수행되고, 동작환경 판단부 에서는 정보분석부를 통하여 분류된 환경조건정보에 기초하여 사용자가 속한 환경 조건의 이상변화 유무를 판정 하거나 사용자가 환경 조건 하에 놓여진 경과 시간을 추정하여 회차별로 구분하여 관리할 수 있다. 알림신호 발생부에서는 귀마개의 사용자에게 소정의 경보를 통지함으로써 직접 경고를 하거나 또는 사전 설정된 대상에게 소정의 경보를 통지하기 위하여 알림신호가 발생될 수 있다. 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개는, 귀마개의 사용자로부터 인가된 입력 신호를 수신하기 위한 사용자입력 수신부를 더 포함하고, 알림신호 발생부를 통하여 발생된 알림신호는 사용자로부터 인가된 입 력 신호에 의하여 통제될 수 있다. 또한, 출력부에서는 알림신호에 따라서 사용자에게 출력될 사운드의 조작 및 진동 인가 중 적어도 하나를 수행 함으로써 경보를 출력하고, 사운드의 조작은 사운드를 변조하거나 사운드의 출력량을 증감시키거나 사운드의 출 력 패턴을 조작하는 것일 수 있다. 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개의 동작 방법은, 인공지능 스마트 귀마개를 착용한 사용자 가 속한 환경 조건에 대한 정보를 수집하는 단계, 수집된 환경조건정보를 분석하고, 분석된 결과를 분류 (classfication)하는 단계, 분류된 환경조건정보에 기초하여 사용자가 속한 환경 조건의 이상변화 유무 또는 사 용자가 환경 조건 하에 놓여진 경과 시간을 추정하는 단계, 동작환경 판단부에 의한 판단 결과에 따라 귀마개의 사용자 또는 사전 설정된 대상에게 소정의 경보(alarm)를 통지하기 위한 알림신호를 발생시키는 단계, 알림신호 에 따라 소정의 경보를 출력하는 단계 및 알림신호를 사전 설정된 대상에게 전달하는 단계를 포함하고, 환경조 건정보에는 온도, 습도, 사운드, 진동, 풍향, 풍속, 주변 기체의 종류 및 농도가 포함될 수 있다. 한편, 본 발명의 일 실시예로써, 전술한 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체가 제공될 수 있다."}
{"patent_id": "10-2018-0068151", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능 스마트 귀마개를 사용하면, 소음이 발생되는 등의 각종 산업현장에서도 비상상황에 대하여 귀마개 착용자가 보다 빠르게 인지함으로써 산업재해 발생 등을 효과적으로 방지할 수 있다. 또한, 사용자의 작업 환경 주변에 대한 데이터를 수집, 분석, 분류함으로써 비상상황 발생 여부에 대하여 빠르 고 정확하게 판단할 수 있고, 기계학습 등을 통하여 주변환경정보의 데이터를 처리하므로 상황 예측의 오류발생 가능성을 효과적으로 낮출 수 있다. 특정의 작업자 뿐만 아니라, 노인, 유아 등 일반인도 사용이 쉽도록 직관적이고 인체공학적으로 설계되어 있으 므로, 장기간 사용하더라도 귀에 불편함과 무리를 주지 않으며 귀마개를 통하여 각종 사운드를 상황에 맞게 효 과적으로 전달할 수 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개는 네트워크를 통하여 타 작업자 또는 작업자 그룹과 통신할 수 있고, 소방서, 경찰서 등 관련 기관으로 경보 또는 응급상황 발생 알림 메시지 등이 사전 설정에 따 라 자동적으로 발생되게 할 수도 있으므로, 비상상황의 빠르고 적절한 수습을 지원할 수 있다."}
{"patent_id": "10-2018-0068151", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 명세서 전체에서 어떤 부분 이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, \"그 중간에 다른 소자를 사이에 두고\" 연결되어 있는 경우도 포함한다. 갱도, 조선소, 자동차 조립 공장, 화학 시서물 처리 공장 등에서의 작업자는 각종 소음 및 유해환경에 노출될 수 있다. 이에 따라, 기존에는 소음에 의한 난청 발생을 낮추기 위하여 작업자들에게 스펀지 등의 차음소재로 제작된 가장 단순한 형태의 귀마개를 지급하거나, 적정 작업 시간을 설정하고 작업자의 자발적 의지에 따라 작 업이 진행될 수 있도록 하는 등의 임시방편적 운영지침으로 작업이 진행되도록 하였다. 이러한 환경 하에서는 작업자는 주변 작업자와의 의사소통 상의 불편함 등을 이유로 귀마개를 착용하지 않아서 난청 발생 가능성을 높 이거나, 유독 가스의 종류 및 해당 유독 가스의 현재의 공간상 농도 등을 자신의 감각기관으로는 정확하게 인지 할 수는 없기 때문에 유독 가스에 그대로 노출되거나, 화재, 충돌 등 각종 산업 재해의 발생가능성을 쉽사리 예 측하기 어려워 전술한 산업재해 발생 위험성에 항상 노출되어 있는 실정이다. 또한, 산업 현장에서의 작업자 뿐만 아니라, 노인, 유아, 청소년 등의 일상생활에서 발생될 수 있는 안전 사고 도 예측을 통하여 미리 예방할 필요가 있다. 본 명세서에서는 전술한 위험성 및 기존 산업 현장에서의 문제점에 보다 적극적이고 효과적으로 대처하기 위한 일 방안으로써, 인공지능 스마트 귀마개를 제안하고자 한다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개를 이용한 통신 과정의 개략도이고, 도 2는 본 발명 의 일 실시예에 따른 인공지능 스마트 귀마개의 블록도이며, 도 3은 본 발명의 일 실시예에 따른 환경조건정보 수집부의 상세 블록도이다. 또한, 도 4는 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개의 예시적인 형태 (이어폰)를 나타낸다. 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개는 사용자의 주변환경조건에 대하여 실시간 또는 주기적으로 탐지하여 수집된 데이터를 기계학습 등을 통하여 분석함으로써 사용자의 행동 패턴, 환경조건의 변화 여부, 변화 가능성 등을 파악(예측)할 수 있다. 파악된 결과에 기초하여, 사용자의 주변 환경조건의 변화 여부를 결정할 수 있다. 주변 환경조건의 변화 여부는 급박한 데이터 값의 변화(ex. 주변 온도의 급상승, 급하 강 등)또는 데이터의 비이상적 변화 등에 따라 판단할 수 있다. 비상 상황 등이 발생되면, 귀마개는 미리 설정된 패턴의 사운드 송출 등을 통하여 사용자에게 비상 상황이 발생되었음을 알릴 수 있다. 예를 들어, 사 용자의 주변에 유독 가스의 농도가 높아지는 것으로 감지된다면, 귀마개 사용자에게 \"유독 가스 감지. 즉시 대 피 요망\" 등과 같은 경고문을 음성으로써 출력할 수도 있다. 또한, 주변의 다른 작업자 등에게도 비상 상황 발생 등에 대하여 경보 알림을 통지할 수 있다. 나아가, 작업관제소(컨트롤타워) 뿐만 아니라, 소방서, 경찰 서, 각종 유관 국가기관 등으로도 비상 상황 발생 등에 대하여 경보 알림을 통지할 수 있다. 다시 말해서, 비상 상황 등의 발생 가능성이 매우 높거나, 비상 상황의 발생 시, 사용자 뿐만 아니라 관계 대상(3,5,7)에게 경보를 통지함으로써 인지력을 높이고, 수습 조치를 빠르고 효율적으로 할 수 있게 유도할 수 있다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개는, 인공지능 스마트 귀마개(100 0)를 착용한 사용자가 속한 환경 조건에 대한 정보를 수집하기 위한 환경조건정보 수집부, 수집된 환경 조건정보를 분석하고 분석된 결과를 분류(classfication)하기 위한 정보분석부, 분류된 환경조건정보에 기 초하여 사용자가 속한 환경 조건의 이상변화 유무 또는 사용자가 환경 조건 하에 놓여진 경과 시간을 추 정하기 위한 동작환경 판단부, 동작환경 판단부에 의한 판단 결과에 따라 귀마개의 사용자 또는 사전 설정된 대상(3,5,7)에게 소정의 경보(alarm)를 통지하기 위한 알림신호를 발생시키는 알림신호 발생 부, 알림신호에 따라 소정의 경보를 출력하기 위한 출력부 및 알림신호를 사전 설정된 대상에게 전달 하기 위한 통신부를 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 환경조건정보에는 온도, 습도, 사 운드, 진동, 풍향, 풍속, 주변 기체의 종류 및 농도가 포함될 수 있다. 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개의 사용자는 조선소 작업자, 자동차 조립 작업자, 갱 도 작업자, 화학 공장(시설) 작업자, 콘서트 등 대단위 사운드 발생 환경 하의 작업자, 군사 사격장, 비행 시설, 철도 주변 등 지속적이거나 일시적이고 집중적인 사운드 발생 환경 하의 작업자 등일 수 있다. 이러한 각 각의 작업자의 작업 환경은 조금씩 상이할 수 있지만, 각종 작업 환경 하에서 발생될 수 있는 소음, 물체 또는 작업자 간 충돌, 시설의 붕괴, 화상, 화재 등에 대하여 그 발생을 예방하거나, 발생된 상황의 수습 조치를 빠르 게 취할 필요가 있다. 조선소, 자동차 조립 등의 근로 환경에서의 위험 상황 발생 요인으로써는 소음, 충돌, 추락, 화재 등을 꼽을 수 있다. 이러한 요인에 대하여는 데이터 수집 및 모델링을 통하여 상황 발생을 예방하는 것이 필수적이다. 본 발 명의 일 실시예에 따른 인공지능 스마트 귀마개를 활용하면 위험 상황 발생 가능성을 비교적 정확하게 예 측하거나, 발생된 상황을 빠르게 전파(통지)할 수 있다. 또한, 갱도 근로 환경에서의 위험 상황 발생 요인으로 써는 유독 가스, 붕괴, 충돌, 화재 등을 꼽을 수 있다. 유사하게, 화학 공장 근로 환경에서는 가스 누출, 화재, 화상 등을 위험 상황 발생 요인으로써 꼽을 수 있다. 콘서트장 등 대단위 소음이 발생될 수 있는 환경이나, 군 사격장, 비행장, 철로 보수, 유지 등의 작업 환경에서의 위험 상황 발생 요인도 위와 유사하게 소음, 충돌, 추 락, 붕괴, 화재 등을 꼽을 수 있다. 이와 같이 작업 환경 또는 일상 생활에서 위험 상황이 발생되는 요인은 대 체로 공통적이므로, 각각의 요인별 또는 각각의 작업 환경별로 환경조건정보를 분류할 수 있다. 수집된 환경조 건정보를 기계학습을 통하여 분석하고 분류함으로써 예측 및 판단 결과의 신뢰성을 보다 높일 수 있다. 이와 관 련해서는 후술하여 상세히 살펴보기로 한다. 환경조건정보 수집부에서는 인공지능 스마트 귀마개를 착용한 사용자가 속한 환경 조건에 대한 정보를 실시간으로 수집하거나, 소정의 시간 간격(예컨대, 일주일 또는 한 달 단위 등)으로 묶어서 데이터를 수 집할 수도 있다. 다시 말해서, 작업자가 정기적으로 작업을 수행하는 경우(ex. 화학 시설의 탱크 내부 청소 등)에는 해당 시간 간격 만큼 정기적으로 환경조건정보를 수집할 수도 있다. 환경조건정보 수집부에는 귀마개를 착용한 사용자가 속한 환경의 온도 및 습도를 측정하기 위한 온도습도센서 모듈, 귀마개의 외부로부터의 사운드를 수신하기 위한 마이크로폰 모듈, 귀마개에 대하 여 인가된 진동을 감지하기 위한 진동감지센서 모듈, 귀마개로 전달된 풍향 및 풍속을 감지하기 위한 기류 감지센서 모듈, 귀마개를 착용한 사용자가 속한 환경에서의 기체의 종류 및 농도를 감지하기 위한 기체감 지센서 모듈이 포함될 수 있다. 전술한 바와 같이, 환경조건정보에는 온도, 습도, 사운드, 진동, 풍향, 풍 속, 주변 기체의 종류 및 농도가 포함될 수 있는데, 이와 같은 정보 항목은 예시적인 것으로, 작업 환경 등에 따라 환경조건정보의 항목이 상기 예시들에 더하여 추가될 수도 있다. 환경조건정보 수집부를 통하여 수집된 정보는 데이터베이스에 저장되어 관리될 수 있다. 도 2에서는 데이터베이스가 인공지능 스마트 귀마개에 포함되어 있는 것으로 도시되어 있지만, 데이터베이스 는 귀마개로부터 분리되어 별도로 마련되어 있을 수도 있고, 이러한 경우 통신부를 통하여 귀 마개와 데이터베이스간 정보가 송수신될 수 있다. 정보분석부에서는 환경조건정보 수집부를 통하여 수집된 환경조건정보를 기계학습(machine learnin g)을 통하여 실시간으로 또는 정기적으로 분석하고, 분석된 결과를 분류할 수 있다. 이러한 분류를 통하여 귀마 개는 비상 상황의 발생 가능성을 예측하거나 비상 상황의 발생 여부를 결정할 수 있다. 기계학습은 인공신경망(artificial neural network, ANN), 서포트 벡터 머신(support vector machine, SVM), 결정 트리 학습법(decision tree learning) 또는 패턴인식(pattern recognition) 중 적어도 하나의 방식으로써 진행될 수 있다. 그 외 다양한 기계학습 방식이 정보분석부에서 활용될 수도 있다. 본 발명의 일 실시예에 따르면, 정보분석부에서는 환경조건정보의 수집 빈도에 따라 가중치를 부여하여 기 계학습이 수행될 수 있다. 작업자 등의 환경 조건은 대체로 획기적으로 대폭 변화하지는 않는다는 점에서 환경 조건정보의 데이터 수집 빈도에 따라, 자주 수집되는 환경조건정보 항목 및 해당 데이터에 대하여는 가중치를 부여한 후 기계학습이 수행되게 할 수 있다. 예를 들어, 조선소 용접 작업자의 작업 환경에서는 자신의 용접 작 업 시 발생되는 소음과 일정 레벨(예컨대, 제 1 기준값)의 주변 소음(ex. 타격음 등)이 빈번하게 수집될 수 있 다. 따라서, 이러한 수집된 환경조건정보에 대하여는 가중치를 부여(예컨대, 1.5배, 2배 등 소정의 가중치 배수 부여) 하여 데이터값을 조정할 수 있다. 이러한 가중치는 작업 환경에 따라 상이하게 미리 설정되어 있을 수 있 다. 또한, 기계 학습을 통하여 작업 환경별로 환경조건정보에 대하여 가중치가 상이하게 결정되어 사용될 수도 있다. 제 1 기준값의 결정도 또한 기계학습을 통하여 결정될 수 있다. 이러한 조정된 데이터 값에 기초하여 기계학습 이 수행될 수 있으므로, 작업자의 작업 환경에 대한 소음 패턴이 비교적 빠르고 정확하게 예측(결정)될 수 있다. 전술한 예의 환경 하에서는 불규칙적 소음(예컨대, 갑자기 소리가 튀는 경우 등) 또는 제 1 기준값 초과 의 소음은 특이적 환경조건정보이므로, 이는 비상 상황이 발생될 가능성이 높거나 비상 상황이 발생되었다는 결 정 요소로 활용될 수 있다. 또한, 비상 상황의 발생 여부 등은 유해 가스의 감지, 가스 농도의 변화 등을 통하 여도 판단될 수 있다. 동작환경 판단부에서는 정보분석부를 통하여 분류된 환경조건정보에 기초하여 사용자가 속한 환경 조건의 이상변화 유무를 판정하거나 사용자가 환경 조건 하에 놓여진 경과 시간을 추정하여 회차별로 구분하 여 관리할 수 있다. 전술한 바와 같이, 기계학습을 통한 데이터 처리에 의하여 비상 상황의 발생 유무 등이 예 측(판정)될 수 있고 이와 동시에 사용자가 특정의 환경 조건 하에 놓여진 경과 시간이 추정될 수 있다. 사용 자의 환경 조건 하 경과 시간은 환경조건정보의 수집 상태에 따라 시간 추정이 개시되거나 종료될 수 있다. 예 를 들면, 사용자가 조용한 곳에서 일정 레벨의 소음이 발생되는 곳으로 이동한다면, 소음이 환경조건정보로써 수집되기 시작하고, 그에 따라 사용자의 소음 환경에 놓여진 경과 시간의 추정이 개시된다. 이후 사용자가 다시 조용한 곳으로 이동하거나, 일시적이지 않은 더 큰 소음이 지속적으로 발생되는 공간으로 이동한다면 환경조건 정보의 수집 상태가 변경되므로, 앞서 개시된 경과 시간 추정이 종료될 수 있다. 또한, 이와 동시에 해당 옮긴 장소에서 새롭게 경과 시간의 추정이 개시될 수 있다. 이러한 반복적인 방식으로 사용자가 환경 조건 하에 놓여진 경과 시간이 추정되어 회차별로 구분되어 관리될 수 있다. 회차별로 구분된 경과 시간의 추정 데이터는 데이터베이스에 저장될 수 있고, 이러한 회차별 사용자의 특정 장소 존재 경과 시간은 정보분석부에 서 기계학습을 통하여 사용자별로 패턴화되고, 분류된 후 데이터베이스에 저장되어 있을 수 있다. 다시 도 2를 참조하면, 알림신호 발생부에서는 귀마개의 사용자에게 소정의 경보를 통지함으로써 직접 경고를 하거나 또는 사전 설정된 대상에게 소정의 경보를 통지하기 위하여 알림신호가 발생될 수 있다. 전 술한 예에서와 같이, 사용자가 머무르고 있는 공간에서 유독 가스 등의 농도가 점차 높아지는 경우, 알림신호 발생부는 사용자의 즉각적인 대피를 유도하기 위한 경보 신호를 생성할 수 있다. 사용자는 이러한 경보 신 호에 따른 알림에 의하여 비상 상황의 발생 가능성 및 발생 여부에 대하여 빠르게 인지할 수 있다. 또한, 사용 자에 의하여 사전 설정된 대상(예컨대, 3, 5, 7 등)으로 소정의 경보를 통지함으로써 비상 상황에 대하여 효율 적으로 대처하게 할 수 있다. 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개는, 귀마개의 사용자로부터 인가된 입력 신 호를 수신하기 위한 사용자입력 수신부를 더 포함하고, 알림신호 발생부를 통하여 발생된 알림신호는 사용자로부터 인가된 입력 신호에 의하여 통제될 수 있다. 사용자는 자신의 판단에 따라 경보를 해제할수도 있다. 도 4를 참조하면, 사용자는 본인 스스로의 상황 판단에 따라 사용자입력 수신부로 입력 신 호를 인가함으로써, 발생된 알림신호를 제거(해제)할 수 있다. 사용자에 의한 알림신호의 제거(해제)에 의하여 타 대상(예컨대, 3, 5, 7 등)으로는 알림신호가 전달되지 않을 수도 있다. 다시 말해서, 사용자에 의한 외부 입력신호의 인가 여부에 따라, 비상 상황의 심각성, 신속 처리 필요성이 재차 판단(체크)될 수 있으므로, 경보 통지의 신뢰성을 보다 향상시킬 수 있다. 또한, 출력부에서는 알림신호에 따라서 사용자에게 출력될 사운드의 조작 및 진동 인가 중 적어도 하나 를 수행함으로써 경보를 출력하고, 사운드의 조작은 사운드를 변조하거나 사운드의 출력량을 증감시키거나 사운 드의 출력 패턴을 조작하는 것일 수 있다. 알림신호에 기초하여 출력부를 통한 경보의 출력은 고주파수 사 운드에서 저주파수 사운드로 또는 그 역으로의 사운드의 변조로써 수행될 수 있다. 또한, 경보의 출력은 위험 요소 관련 사운드의 출력을 증가(ex. 소리를 키움)시키거나 감소(ex. 소리를 줄임)시킴으로써 수행될 수 있다. 경보 출력을 위한 사운드는 다양한 패턴으로 사용자에게 출력될 수도 있다. 예를 들어, 물체가 사용자의 오른 편에서 접근하는 것으로 예측(판단)된다면, 우측의 귀마개를 통하여 경보 사운드가 점진적으로 커지게 출 력되게 할 수 있다. 또한 이와 동시에 우측의 귀마개 부분에서 진동일 발생되도록 할 수 있다. 경보 사운 드의 패턴은 예를 들면, \"삐\" - 포즈(pause)1 - \"삐삐\"- 포즈2 - \"삐삐삐\" - 포즈 3 - . . . 등일 수 있고, 포 즈의 시간 간격은 포즈 1 > 포즈 2 > 포즈 3의 순서일 수 있으며, 포즈의 시간 간격은 사용자에 의하여 미리 설 정되거나, 기계 학습을 통하여 해당 상황에 가장 적합한 것으로 결정됨으로써 설정될 수도 있다. 도 4를 참조하면, 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개는 몸체부와 지지부로 형성된 넥밴드 형상일 수 있다. 출력부는 연결선을 통하여 몸체부와 연결될 수 있고, 몸체부 에는 환경조건정보 수집부 등이 상호 연결되어 포함되어 있을 수 있다. 통신부는 몸체부 내의 미도시의 타 구성요소(ex. 전원부 등)와 유선 또는 무선으로 연결되어 있을 수 있다. 도 4는 이어폰 형상 의 예시적인 형태로, 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개는 그 외 다른 형상으로도 구현 될 수도 있다. 도 5는 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개의 동작 방법을 나타낸 순서도이다. 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개의 동작 방법은, 인공지능 스마트 귀마개를 착 용한 사용자가 속한 환경 조건에 대한 정보를 수집하는 단계(S100), 수집된 환경조건정보를 분석하고, 분석 된 결과를 분류(classfication)하는 단계(S200), 분류된 환경조건정보에 기초하여 사용자가 속한 환경 조건 의 이상변화 유무 또는 사용자가 환경 조건 하에 놓여진 경과 시간을 추정하는 단계(S300), 동작환경 판단부 에 의한 판단 결과에 따라 귀마개의 사용자 또는 사전 설정된 대상(3,5,7)에게 소정의 경보 (alarm)를 통지하기 위한 알림신호를 발생시키는 단계(S400), 알림신호에 따라 소정의 경보를 출력하는 단계 (S500) 및 알림신호를 사전 설정된 대상에게 전달하는 단계(S600)를 포함하고, 환경조건정보에는 온도, 습도, 사운드, 진동, 풍향, 풍속, 주변 기체의 종류 및 농도가 포함될 수 있다. 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개의 동작 방법과 관련하여서는 전술한 장치(예컨대, 귀마 개)에 대한 내용이 적용될 수 있다. 따라서, 방법과 관련하여, 전술한 장치에 대한 내용과 동일한 내용에 대하 여는 설명을 생략하였다. 한편, 전술한 방법은 컴퓨터에서 실행될 수 있는 프로그램으로 작성 가능하고, 컴퓨터 판독 가능 매체를 이용하 여 상기 프로그램을 동작시키는 범용 디지털 컴퓨터에서 구현될 수 있다. 또한, 상술한 방법에서 사용된 데이터 의 구조는 컴퓨터 판독 가능 매체에 여러 수단을 통하여 기록될 수 있다. 본 발명의 다양한 방법들을 수행하기 위한 실행 가능한 컴퓨터 프로그램이나 코드를 기록하는 기록 매체는, 반송파(carrier waves)나 신호들과 같이 일시적인 대상들은 포함하는 것으로 이해되지는 않아야 한다. 상기 컴퓨터 판독 가능 매체는 마그네틱 저장매체 (예를 들면, 롬, 플로피 디스크, 하드 디스크 등), 광학적 판독 매체(예를 들면, 시디롬, DVD 등)와 같은 저장 매체를 포함할 수 있다."}
{"patent_id": "10-2018-0068151", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2018-0068151", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개를 이용한 통신 과정의 개략도이다. 도 2는 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개의 블록도이다. 도 3은 본 발명의 일 실시예에 따른 환경조건정보 수집부의 상세 블록도이다. 도 4는 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개의 예시적인 형태(이어폰)를 나타낸다. 도 5는 본 발명의 일 실시예에 따른 인공지능 스마트 귀마개의 동작 방법을 나타낸 순서도이다."}
