{"patent_id": "10-2017-0123612", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0034963", "출원번호": "10-2017-0123612", "발명의 명칭": "전력용 변압기의 결함을 판별하기 위한 유중가스 패턴 분석 장치 및 방법", "출원인": "한국전력공사", "발명자": "권동진"}}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전력용 변압기의 내부결함을 판별하기 위한 유중가스 패턴 분석 장치에 있어서,전력용 변압기의 고장 데이터와 내부점검 데이터 및 유중가스 분석 데이터를 통합하여 중앙 집중식으로 데이터베이스를 구축하기 위한 데이터 베이스부;상기 고장 데이터와 상기 내부점검 데이터를 내부결함의 부위 및 원인으로 분류하기 위한 내부결함 분류부;상기 유중가스 분석 데이터를 상기 고장 데이터와 상기 내부점검 데이터로부터 분류된 내부결함의 부위 및 원인에 따른 유중가스 패턴으로 분류하기 위한 유중가스 패턴 분류부; 및상기 내부결함의 부위 및 원인에 따라 분류된 유중가스 패턴을 기반으로, 판별이 필요한 전력용 변압기의 유중가스 패턴을 인식하고, 상기 인식한 유중가스 패턴에 따른 내부결함의 부위 및 원인을 판별하여 표시하는 유중가스 패턴 인식 프로그램을 설계 및 학습시키는 유중가스 패턴 인식부를 포함하는 유중가스 패턴 분석 장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 내부결함 분류부는,상기 고장 데이터 중에서 내부결함에 의한 고장 데이터를 선별하고, 상기 선별한 고장 데이터를 고장의 부위 및원인으로 분류하기 위한 고장 데이터 분류부; 및상기 내부점검 데이터 중에서 유중가스가 발생하는 내부점검 데이터를 선별하고, 상기 선별한 내부점검 데이터를 내부결함의 부위 및 원인으로 분류하기 위한 내부점검 데이터 분류부를 포함하는 것을 특징으로 하는 유중가스 패턴 분석 장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 내부결함 분류부는,상기 고장 데이터로부터 분류된 고장의 부위 및 원인과 상기 내부점검 데이터로부터 분류된 내부결함의 부위 및원인을 통합함으로써, 최종적인 내부결함의 부위 및 원인을 분류해내는 것을 특징으로 하는 유중가스 패턴 분석장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 내부결함 분류부는,상기 내부점검 데이터로부터 분류된 내부결함의 부위 및 원인 중에서 고장으로 진전되는 내부결함의 부위 및 원인을 선별하고, 상기 선별한 내부결함의 부위 및 원인이 상기 고장 데이터로부터 분류된 고장의 부위 및 원인과중복되는지 여부를 판단하고, 중복되는 경우, 서로 통합하는 것을 특징으로 하는 유중가스 패턴 분석 장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 유중가스 패턴 분류부는,상기 유중가스 분석 데이터 중에서 상기 고장 데이터와 상기 내부점검 데이터로부터 분류된 내부결함의 부위 및원인에 해당하는 전력용 변압기의 정보와 일치하는 전력용 변압기의 유중가스 분석 데이터를 선별하여 유중가스공개특허 10-2019-0034963-2-패턴으로 분류하는 것을 특징으로 하는 유중가스 패턴 분석 장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 유중가스 패턴 분류부는,상기 내부결함의 부위 및 원인에 따라 분류된 유중가스 패턴을 이용하여 유중가스의 성분이 가로축에 배열되고,각 성분에 따른 농도가 세로축에 배열된 유중가스 패턴도를 작성하는 것을 특징으로 하는 유중가스 패턴 분석장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 유중가스 패턴 분류부는,최대농도를 갖는 유중가스의 농도를 1.0으로 변환하고, 이를 기준으로 나머지 유중가스의 농도를 변환하여 상기세로축에 배열하는 것을 특징으로 하는 유중가스 패턴 분석 장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 유중가스 패턴 인식 프로그램은 유중가스 패턴을 입력 데이터로 입력받고, 내부결함의 부위 및 원인을 결과 데이터로 출력하는 인공지능기반의 유중가스 패턴 인식 프로그램인 것을 특징으로 하는 유중가스 패턴 분석장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 유중가스 패턴 인식부는,상기 유중가스 패턴 인식 프로그램의 연결가중치를 조절함으로써, 상기 유중가스 패턴 인식 프로그램의 오차를적정수준으로 조절하는 것을 특징으로 하는 유중가스 패턴 분석 장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,상기 유중가스 패턴 인식부는, 상기 데이터 베이스부에 업데이트되는 고장 데이터, 내부점검 데이터 및 유중가스 분석 데이터를 상기 유중가스패턴 인식 프로그램에 실시간으로 학습시키고, 피드백하는 것을 특징으로 하는 유중가스 패턴 분석 장치."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전력용 변압기의 내부결함을 판별하기 위한 유중가스 패턴 분석 방법에 있어서,(a) 전력용 변압기의 고장 데이터와 내부점검 데이터 및 유중가스 분석 데이터를 통합하여 중앙 집중식으로 데이터베이스를 구축하는 단계;(b) 상기 고장 데이터와 상기 내부점검 데이터를 내부결함의 부위 및 원인으로 분류하는 단계;(c) 상기 유중가스 분석 데이터를 상기 고장 데이터와 상기 내부점검 데이터로부터 분류된 내부결함의 부위 및원인에 따른 유중가스 패턴으로 분류하는 단계;(d) 상기 내부결함의 부위 및 원인에 따라 분류된 유중가스 패턴을 기반으로, 인공지능기반의 유중가스 패턴 인식 프로그램을 설계하고, 학습시키는 단계;(e) 상기 유중가스 패턴 인식 프로그램에 판별이 필요한 전력용 변압기의 유중가스 패턴을 입력하는 단계; 및(f) 상기 입력된 유중가스 패턴에 따른 내부결함의 부위 및 원인을 판별하는 단계를 포함하는 유중가스 패턴 분공개특허 10-2019-0034963-3-석 방법."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 (b) 단계는,상기 고장 데이터 중에서 내부결함에 의한 고장 데이터를 선별한 뒤, 상기 선별한 고장 데이터를 고장의 부위및 원인으로 분류하고, 상기 내부점검 데이터 중에서 유중가스가 발생하는 내부점검 데이터를 선별한 뒤, 상기 선별한 내부점검 데이터를 내부결함의 부위 및 원인으로 분류하는 것을 특징으로 하는 유중가스 패턴 분석 방법."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 (b) 단계는,상기 고장 데이터로부터 분류된 고장의 부위 및 원인과 상기 내부점검 데이터로부터 분류된 내부결함의 부위 및원인을 통합함으로써, 최종적인 내부결함의 부위 및 원인을 분류해내는 것을 특징으로 하는 유중가스 패턴 분석방법."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 (b) 단계는,상기 내부점검 데이터로부터 분류된 내부결함의 부위 및 원인 중에서 고장으로 진전되는 내부결함의 부위 및 원인을 선별하고, 상기 선별한 내부결함의 부위 및 원인이 상기 고장 데이터로부터 분류된 고장의 부위 및 원인과중복되는지 여부를 판단하고, 중복되는 경우, 서로 통합하는 것을 특징으로 하는 유중가스 패턴 분석 방법."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 (c) 단계는,상기 유중가스 분석 데이터 중에서 상기 고장 데이터와 상기 내부점검 데이터로부터 분류된 내부결함의 부위 및원인에 해당하는 전력용 변압기 정보와 일치하는 전력용 변압기의 유중가스 분석 데이터를 선별하여 유중가스패턴으로 분류하는 것을 특징으로 유중가스 패턴 분석 방법."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 (d) 단계는,상기 유중가스 패턴 인식 프로그램의 연결가중치를 조절함으로써, 상기 유중가스 패턴 인식 프로그램의 오차를적정수준으로 조절하는 것을 특징으로 유중가스 패턴 분석 방법."}
{"patent_id": "10-2017-0123612", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항 내지 제16항 중 어느 한 항에 있어서,상기 (f) 단계 이후,(g) 업데이트되는 고장 데이터, 내부점검 데이터 및 유중가스 분석 데이터를 상기 유중가스 패턴 인식 프로그램에 실시간으로 학습시키고, 피드백하는 단계를 더 포함하는 것을 특징으로 하는 유중가스 패턴 분석 방법."}
{"patent_id": "10-2017-0123612", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 내부점검이 필요한 전력용 변압기의 유중가스 패턴을 인식하여 상기 전력용 변압기의 내부결함의 부위 및 원인을 판별하기 위한 유중가스 패턴 분석 장치 및 방법에 관한 것으로, 실제로 전력용 변압기에 발생하는 고 장 데이터와 내부점검 데이터를 FMEA(Failure Mode and Effect Analysis) 및 DMEA(Defect Mode and Effect Analysis)의 분석방법을 적용하여 분석함으로써, 유중가스를 발생시키는 내부결함의 부위 및 원인으로 분류하고, 이를 기반으로 인공지능기반의 유중가스 패턴 인식 프로그램을 설계 및 학습시킴으로써, 판별이 필요한 전력용 변압기의 유중가스 패턴이 입력되면, 이를 인식하여 내부결함의 부위 및 원인을 정확하게 판별하는 것을 특징으 로 한다."}
{"patent_id": "10-2017-0123612", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 유중가스 패턴 분석에 관한 것으로, 보다 상세하게는 내부점검이 필요한 전력용 변압기의 유중가스 패턴을 인식하여 상기 전력용 변압기의 내부결함의 부위 및 원인을 판별하기 위한 유중가스 패턴 분석 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2017-0123612", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 전력용 변압기는 특 고압을 고압으로 강압하여 배전용 변압기에 전력을 공급하는 주 변압기로서, 대 용량의 부하가 필요한 곳에 주로 사용되고 있다. 유중가스 분석 기술은 전력용 변압기의 결함을 판별하고, 건전성을 평가하는데 가장 널리 이용되는 진단 방법으 로, 실제 이를 이용하여 전력용 변압기의 유중가스를 정기적으로 분석함으로써, 그 고장을 방지하고 있다. 유중가스 분석 방법의 절차는 먼저, 유중가스의 농도 또는 증가량이 기준치를 초과하는지 여부를 판단하고, 기 준치를 초과할 경우에는 분석주기를 단축하여 추적 분석을 하며, 유중가스 농도가 기준치 대비 높은 경우에는 결함의 종류를 판별하고, 전력용 변압기의 내부를 정밀 점검한다. 여기서 유중가스 분석 기준치와 추적 분석 주기는 국제적으로 다르게 설정하고 있으며, 국제적으로 유중가스 분 석의 표준은 IEC 60599, IEEE C57.104 등이 대표적이다. 보다 구체적으로 IEC 60599에서는 전력용 변압기에서 수집한 유중가스 분석 데이터의 90%를 정상으로 판단하고, 상위 10%를 기준치로 제시하며, 이 기준치를 초과하면 분석주기를 단축하고, 유중가스 농도가 심할 경우에는 즉 각적인 조치를 취하도록 권고하고 있다. 또한, 결함유형을 PD(부분방전), D1(저에너지 방전), D2(고에너지 방전) 등의 절연유 또는 절연지의 방전으로 인한 결함과 T1(300℃ 이하), T2(300~700℃), T3(700℃ 이상) 등의 열적 결함으로 판정하고, 결함 유형의 평가 방법으로 IEC Code 및 Duval's Triangle을 사용하고 있다. 그리고 IEEE C57.104에서는 상태에 따라 \"Condition 1 - Condition 4\"의 기준치를 제시하고, 이 기준치를 초과 하면 TDCG(Total Dissolved Combustible Gas)의 증가량에 따라 분석주기를 단축하고, 결함의 종류를 판정한다. 또한, 결함 유형을 절연유 부분방전, 절연유 아크, 절연유 과열 및 절연지 과열로 인한 결함으로 판정하고, 결 함 유형의 평가 방법으로 Key Gas Method, Doernenburg Ratio Method 및 Roger Ratio Method를 사용하고 있다. 한편, 한전에서는 정상, 요주의Ⅰ, 요주의Ⅱ, 이상 및 위험의 4단계로 기준치를 설정하고 있다. 여기서 요주의 Ⅰ은 이상 징후가 있는 것으로 추정, 요주의Ⅱ는 이상이 있는 것으로 추정, 이상은 이상이 있는 것으로 확실시 및 위험은 즉시 운전을 정지한 후, 변압기 내부를 정밀 점검하는 것으로 정의한다. 그리고 한전에서는 모든 전력용 변압기를 대상으로 유중가스를 매년 분석하여 유중가스 농도가 요주의Ⅰ으로 판 정되면 6개월, 요주의Ⅱ로 판정되면 3개월, 이상으로 판정되면 1개월로 분석주기를 단축한다. 또한, 요주의Ⅱ 또는 이상이 3회 이상 연속으로 발생하고, TCG가 1,000ppm을 초과하는 경우와 위험으로 판정되는 경우에는 변압 기 내부를 정밀 점검한다. 그러나 CO 또는 CO2 가스가 요주의Ⅱ로 판정된 경우를 제외하고는 변압기 내부를 정밀 점검하지 않으며, CO 1,200ppm, CO2 7,000ppm을 동시에 초과하는 경우에만 내부를 정밀 점검한다. 또한, 결함 유형을 절연유 부분방전, 절연유 아크, 절연유 과열(저온/중온/고온), 고체 절연물 과열과 같이 5가 지로 판단하고, 결함 유형의 평가 방법으로 가스 패턴에 의한 방법, 가스 조성비에 의한 방법 및 특징 가스에 의한 방법을 사용하고 있다. 즉, 전 세계적으로 유중가스 분석 표준의 결함 유형은 유중가스의 농도, 각 가스간의 비율 및 조성비 등과 같은 여러 가지 방법으로 전력용 변압기의 내부결함 유형을 판별하고 있다. 하지만, 방전과 과열로만 판별하고 있으므로, 이렇게 판별한 내부결함 유형이 현장 내부 점검 시 나타나는 내부 결함 유형과 크게 상이하여 현장에 적용하기 어렵다는 문제가 있다. 또한, 전력용 변압기의 내부점검공간이 협소하고, 중신이 절연지로 가려져 있어서 정밀점검 시 결함의 부위 및 원인을 확인하지 못하는 사례가 빈번하여 결함의 부위 및 원인을 확인하지 못한 상태에서 절연유를 필터링하거 나 전력용 변압기를 교체하는 사례가 발생하고 있다. 현장에서 내부점검 시 확인이 불가능한 결함 중에서 특히, 전력용 변압기의 권선 내부의 결함은 절연파괴 고장 으로 진전될 수 있으므로 권선 내부의 결함이 있는 전력용 변압기는 즉시 운전에서 제외해야 하며, 수리(재권선) 또는 변압기 교체 등의 조치를 취해야 하기 때문에, 권선 내부의 결함으로 추정되는 경우에는 공 장으로 이송한 후 변압기를 해체하여 결함을 확인하여야 한다. 하지만, 이로 인해 발생하는 운송비용과 수리(재권선)비용이 새로운 전력용 변압기의 가격에 비하여 저렴하지 않을 뿐 아니라, 새로운 변압기와 비교하여 성능이 보장되지 않는다는 단점이 있다. 따라서 전력용 변압기의 내부점검을 수행하기 이전에 미리 내부결함의 부위 및 원인을 판별하여 중요 사고의 원 인이면서 육안으로 확인할 수 있는 권선 내부의 결함을 미리 예측할 수 있다면, 고장을 사전에 방지하고, 운전 의 신뢰성을 증가시킬 수 있을 것으로 예상된다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국등록특허공보 제10-1362898호"}
{"patent_id": "10-2017-0123612", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 상기와 같은 문제를 해결하고자, 본 발명은 유중가스 분석 결과, 내부점검이 필요한 전력용 변압기의 유중 가스 패턴을 인식하여 상기 전력용 변압기의 내부결함의 부위 및 원인을 판별하기 위한 유중가스 패턴 분석 장 치 및 방법을 제공하는 데 목적이 있다."}
{"patent_id": "10-2017-0123612", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 유중가스 패턴 분석 장치는 전력용 변압기의 고장 데이터와 내부 점검 데이터 및 유중가스 분석 데이터를 통합하여 중앙 집중식으로 데이터베이스를 구축하기 위한 데이터 베이 스부, 고장 데이터와 내부점검 데이터를 내부결함의 부위 및 원인으로 분류하기 위한 내부결함 분류부, 유중가 스 분석 데이터를 고장 데이터와 내부점검 데이터로부터 분류된 내부결함의 부위 및 원인에 따른 유중가스 패턴 으로 분류하기 위한 유중가스 패턴 분류부, 내부결함의 부위 및 원인에 따라 분류된 유중가스 패턴을 기반으로, 판별이 필요한 전력용 변압기의 유중가스 패턴을 인식하고, 인식한 유중가스 패턴에 따른 내부결함의 부위 및 원인을 판별하여 표시하는 유중가스 패턴 인식 프로그램을 설계 및 학습시키는 유중가스 패턴 인식부를 포함하 는 것을 특징으로 한다. 또한, 내부결함 분류부는 고장 데이터 중에서 내부결함에 의한 고장 데이터를 선별하고, 선별한 고장 데이터를 고장의 부위 및 원인으로 분류하기 위한 고장 데이터 분류부 및 내부점검 데이터 중에서 유중가스가 발생하는 내부점검 데이터를 선별하고, 선별한 내부점검 데이터를 내부결함의 부위 및 원인으로 분류하기 위한 내부점검 데이터 분류부를 포함하는 것을 특징으로 한다. 또한, 내부결함 분류부는 고장 데이터로부터 분류된 고장의 부위 및 원인과 내부점검 데이터로부터 분류된 내부 결함의 부위 및 원인을 통합함으로써, 최종적인 내부결함의 부위 및 원인을 분류해내는 것을 특징으로 한다. 또한, 내부결함 분류부는 내부점검 데이터로부터 분류된 내부결함의 부위 및 원인 중에서 고장으로 진전되는 내 부결함의 부위 및 원인을 선별하고, 선별한 내부결함의 부위 및 원인이 고장 데이터로부터 분류된 고장의 부위 및 원인과 중복되는지 여부를 판단하고, 중복되는 경우, 서로 통합하는 것을 특징으로 한다. 또한, 유중가스 패턴 분류부는 유중가스 분석 데이터 중에서 고장 데이터와 내부점검 데이터로부터 분류된 내부 결함의 부위 및 원인에 해당하는 전력용 변압기 정보와 일치하는 전력용 변압기의 유중가스 분석 데이터를 선별 하여 유중가스 패턴으로 분류하는 것을 특징으로 한다. 또한, 유중가스 패턴 분류부는 내부결함의 부위 및 원인에 따라 분류된 유중가스 패턴을 이용하여 유중가스의 성분이 가로축에 배열되고, 각 성분에 따른 농도가 세로축에 배열된 유중가스 패턴도를 작성하는 것을 특징으로 한다. 또한, 유중가스 패턴 분류부는 최대농도를 갖는 유중가스의 농도를 1.0으로 변환하고, 이를 기준으로 나머지 유 중가스의 농도를 변환하여 세로축에 배열하는 것을 특징으로 한다. 또한, 유중가스 패턴 인식 프로그램은 유중가스 패턴을 입력 데이터로 입력받고, 내부결함의 부위 및 원인을 결 과 데이터로 출력하는 것을 특징으로 한다. 또한, 유중가스 패턴 인식부는 유중가스 패턴 인식 프로그램의 연결가중치를 조절함으로써, 유중가스 패턴 인식 프로그램의 오차를 적정수준으로 조절하는 것을 특징으로 한다. 또한, 유중가스 패턴 인식부는 데이터 베이스부에 업데이트되는 고장 데이터, 내부점검 데이터 및 유중가스 분 석 데이터를 유중가스 패턴 인식 프로그램에 실시간으로 학습시키고, 피드백하는 것을 특징으로 한다. 본 발명의 유중가스 패턴 분석 방법은 (a) 전력용 변압기의 고장 데이터와 내부점검 데이터 및 유중가스 분석 데이터를 통합하여 중앙 집중식으로 데이터베이스를 구축하는 단계, (b) 고장 데이터와 내부점검 데이터를 내부 결함의 부위 및 원인으로 분류하는 단계, (c) 유중가스 분석 데이터를 고장 데이터와 내부점검 데이터로부터 분 류된 내부결함의 부위 및 원인에 따른 유중가스 패턴으로 분류하는 단계, (d) 내부결함의 부위 및 원인에 따라 분류된 유중가스 패턴을 기반으로, 인공지능기반의 유중가스 패턴 인식 프로그램을 설계하고, 학습시키는 단계, (e) 유중가스 패턴 인식 프로그램에 판별이 필요한 전력용 변압기의 유중가스 패턴을 입력하는 단계 및 (f) 입 력된 유중가스 패턴에 따른 내부결함의 부위 및 원인을 판별하는 단계를 포함하는 것을 특징으로 한다. 또한, (f) 단계 이후, (g) 업데이트되는 고장 데이터, 내부점검 데이터 및 유중가스 분석 데이터를 유중가스 패 턴 인식 프로그램에 실시간으로 학습시키고, 피드백하는 단계를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2017-0123612", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 유중가스 패턴 분석 장치 및 방법은 실제로 전력용 변압기에 발생하는 고장 데이터와 내부점검 데이 터를 FMEA(Failure Mode and Effect Analysis) 및 DMEA(Defect Mode and Effect Analysis)의 분석방법을 적용 하여 분석함으로써, 유중가스를 발생시키는 내부결함의 부위 및 원인으로 분류하고, 이를 기반으로 인공지능기 반의 유중가스 패턴 인식 프로그램을 설계 및 학습시킴으로써, 판별이 필요한 전력용 변압기의 유중가스 패턴이 입력되면, 이를 인식하여 내부결함의 부위 및 원인을 정확하게 판별할 수 있다. 이를 통해 내부점검 시, 확인이 불가능하였던 내부결함까지도 판별이 가능함으로써, 불필요한 절연유 필터링, 변압기 수리 및 교체 등을 감소시켜 유지보수비용을 감소시키고, 최적의 유지보수를 통해 설비 신뢰도를 향상시 키며, 나아가 불시 정전을 방지함으로써, 경제성과 함께 변압기의 성능의 신뢰도를 극대화할 수 있는 효과가 있 다."}
{"patent_id": "10-2017-0123612", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명을 충분히 이해하기 위해서 본 발명의 바람직한 실시 예를 첨부된 도면을 참조하여 설명한다. 본 발명의 실시 예는 여러 가지 형태로 변형될 수 있으며, 본 발명의 범위가 아래에서 상세히 설명하는 실시 예로 한정되는 것으로 해석되어서는 안 된다. 본 실시 예는 당 업계에서 평균적인 지식을 가진 자에게 본 발명을 보 다 완전하게 설명하기 위해서 제공되는 것이다. 따라서 도면에서의 요소의 형상 등은 보다 명확한 설명을 강조 하기 위해서 과장되어 표현될 수 있다. 각 도면에서 동일한 구성은 동일한 참조부호로 도시한 경우가 있음을 유 의하여야 한다. 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 공지 기능 및 구성에 대한 상세한 기술 은 생략된다. 본 발명은 전력용 변압기의 내부결함을 판별하기 위해 유중가스 패턴을 분석하는 장치 및 방법에 관한 것으로, 도 1은 본 발명의 실시 예에 따른 유중가스 패턴 분석 장치를 개략적으로 보여주는 블록도이다. 이하, 도 1을 참조하여 본 발명을 설명한다. 도 1에 도시된 바와 같이, 본 발명의 유중가스 패턴 분석 장치는 데이터 베이스부, 내부결함 분류부, 유중가스 패턴 분류부 및 유중가스 패턴 인식부를 포함하여 구성된다.데이터 베이스부는 전력용 변압기의 고장 데이터와 내부점검 데이터 및 유중가스 분석 데이터 를 통합하여 중앙 집중식으로 데이터 베이스를 구축하는 곳으로, 대규모의 정형 및 하드카피 형식의 비정 형 데이터 형태의 빅-데이터(big data)로 데이터(110,120,130)들을 저장하고, 관리한다. 상기 고장 데이터는 실제 전력용 변압기에 발생하는 고장에 관한 데이터로, 보다 구체적으로는 전력용 변 압기의 제작년도, 제작사, 상수, 정격전압, 정격용량, 유보전 방식, 고장 일시, 고장 부위, 고장 원인에 관한 데이터를 포함하며, 정전시간, 정전호수, 고장파급 관련 자료 등을 더 포함할 수 있다. 상기 내부점검 데이터는 실제 전력용 변압기의 내부점검 시 발생하였던 내부점검에 관한 데이터로, 보다 구체적으로는 전력용 변압기의 내부점검 사유, 정밀점검 사유, 점검 일시, 결함 부위, 결함 원인, 조치내역 등 에 관한 데이터를 포함한다. 상기 유중가스 분석 데이터는 실제 전력용 변압기에 발생하였던 유중가스에 관한 데이터로, 보다 구체적으 로는 유중가스 분석일자, 유중가스 분석사유, H2 가스 농도, C2H2 가스 농도, C2H4 가스 농도, C2H6 가스 농도, CH4 가스 농도, C3H8 가스 농도, TCG(Total Combustible Gas) 농도, CO 가스 농도, CO2 가스 농도, 각 가스 간의 비율, 조성비, 각 가스 간의 증가량, 증가속도 및 가스분석 관리 기준에 따른 판정결과 및 On-line 유중가스 monitoring 데이터 등에 관한 데이터를 포함한다. 내부결함 분류부는 데이터 베이스부에 저장되어 있는 데이터(110,120)를 전력용 변압기의 내부결함의 부위 및 원인으로 분류하는 곳으로, 도 1과 같이, 고장 데이터 분류부와 내부점검 데이터 분류부를 포함하여 구성된다. 고장 데이터 분류부는 데이터 베이스부에 저장되어 있는 고장 데이터를 고장의 부위 및 원인으 로 분류하기 위한 곳으로, FMEA(Failure Mode and Effect Analysis) 분석방법을 적용하여 고장 데이터를 분석하여 분류하는 것이 바람직하다. 보다 구체적으로 고장 데이터 분류부는 고장 데이터 중에서 외부결함에 의한 고장 데이터를 제외하고, 내부결함에 의한 고장 데이터만을 선별한 뒤, 상기 선별한 고장 데이터를 분석하여 고장의 부위 및 원인으로 분류한다. 한편, 고장 데이터 분류부는 데이터 베이스부에 저장되어 있는 고장 데이터 외에도 이론적으로 발생 가능한 전력용 변압기의 모든 고장에 관한 데이터를 더 입력받아 이를 고장의 부위 및 원인으로 분류할 수 도 있다. 내부점검 데이터 분류부는 데이터 베이스부에 저장되어 있는 내부점검 데이터를 내부결함의 부 위 및 원인으로 분류하는 곳으로, DMEA(Defect Mode and Effect Analysis) 분석방법을 적용하여 내부점검 데이 터를 분석하여 분류하는 것이 바람직하다. 보다 구체적으로 내부점검 데이터 분류부는 내부점검 데이터 중에서 유중가스가 발생하지 않았거나, 유중가스가 발생하지 않는 내부점검 데이터를 제외하고, 유중가스가 발생하는 내부점검 데이터만을 선별한 뒤, 상기 선별한 내부점검 데이터를 분석하여 내부결함의 부위 및 원인으로 분류한다. 이와 같이 고장 데이터 분류부가 고장 데이터를 고장의 부위 및 원인으로 분류하고, 내부점검 데이터 분류부가 내부점검 데이터를 내부결함의 부위 및 원인으로 분류하였으면, 내부결함 분류부는 FMEA 분석방법과 DMEA 분석방법을 종합적으로 적용하여 고장 데이터로부터 분류된 고장의 부위 및 원인과 내부점검 데이터로부터 분류된 내부결함의 부위 및 원인을 통합함으로써, 최종적인 내부결함의 부위 및 원 인을 분류해내는 것이 바람직하다. 여기서, 내부결함 분류부는 고장 데이터로부터 분류된 고장의 부위 및 원인 중에서 실제 발생할 수 있는 고장의 부위 및 원인을 선별하고, 내부점검 데이터로부터 분류된 내부결함의 부위 및 원인 중에서 실 제 발생할 수 있는 내부결함의 부위 및 원인을 선별한 뒤, 통합하는 것이 바람직하다. 또한, 내부결함 분류부는 고장 데이터로부터 분류된 고장의 부위 및 원인과 내부점검 데이터로 부터 분류된 내부결함의 부위 및 원인이 서로 중복되는지 여부를 확인한다. 보다 구체적으로 내부결함 분류부는 내부점검 데이터로부터 분류된 내부결함의 부위 및 원인 중에서 고장으로 진전되지 않는 내부결함의 부위 및 원인을 제외하고, 고장으로 진전되는 내부결함의 부위 및 원인만을 선별한 뒤, 고장 데이터로부터 분류된 고장의 부위 및 원인과 비교함으로써, 중복 여부를 확인하고, 중복되는 경우, 이들을 서로 통합하여 데이터를 간소화하는 것이 바람직하다. 여기서, 중복이란, 고장이 발생하는 메커니즘이 서로 일치하거나 유사함을 의미한다. 유중가스 패턴 분류부는 데이터 베이스부에 저장되어 있는 유중가스 분석 데이터를 유중가스 패 턴으로 분류하기 위한 곳으로, 내부결함 분류부에 의해 고장 데이터와 내부점검 데이터로부터 최종적으로 분류되어 나온 내부결함의 부위 및 원인에 따라 유중가스 분석 데이터를 유중가스 패턴으로 분 류한다. 보다 구체적으로 유중가스 패턴 분류부는 먼저, 유중가스 분석 데이터 중에서 고장 데이터와 내 부점검 데이터로부터 최종적으로 분류되어 나온 내부결함의 부위 및 원인에 해당하는 전력용 변압기 정보 와 일치하는 전력용 변압기의 유중가스 분석 데이터만을 선별한 뒤, 이를 유중가스 패턴으로 분류한다. 그 다음으로, 유중가스 분석 데이터로부터 분류된 유중가스 패턴을 유중가스 패턴 인식부가 유중가스 패턴 인식 프로그램의 학습 데이터로 사용할 수 있도록 변환한 유중가스 패턴도를 작성한다. 보다 구체적으로 유중가스 분석 데이터는 유중가스 분석 데이터로부터 분류된 유중가스 패턴을 기반 으로, 이를 이용하여 유중가스의 성분 즉, H2 가스, C2H2 가스, C2H4 가스, C2H6 가스, CH4 가스, C3H8 가스, CO 가스, CO2 가스 등을 가로축에 배열되고, 각 성분에 따른 농도가 세로축에 배열된 유중가스 패턴도를 작성한다. 여기서, 세로축에는 유중가스의 각 성분에 따른 농도가 그대로 배열되지 않고, 최대농도를 갖는 유중가스의 농 도를 1.0으로 변환하고, 이를 기준으로 나머지 유중가스의 농도를 변환하여 배열함으로써, 모든 유중가스의 농 도 데이터가 0부터 1.0까지 정규화된 유중가스 패턴도를 작성하는 것이 바람직하다. 유중가스 패턴 인식부는 유중가스 패턴 분류부에서 내부결함의 부위 및 원인에 따라 분류된 유중가스 패턴을 기반으로 인공지능기반의 유중가스 패턴 인식 프로그램을 설계 및 학습시키는 곳이다. 이를 통해 최종적으로 판별이 필요한 전력용 변압기의 유중가스 패턴이 유중가스 패턴 인식 프로그램에 입력되 면, 상기 유중가스 패턴 인식 프로그램이 이를 인식하고, 인식한 유중가스 패턴에 따른 내부결함의 부위 및 원 인을 판별한 뒤, 그 결과를 표시할 수 있도록 한다. 이를 위해, 보다 구체적으로 유중가스 패턴 인식부는 유중가스 패턴 분류부에서 내부결함의 부위 및 원인에 따라 분류된 유중가스 패턴을 유중가스 패턴 인식 프로그램의 입력 데이터로 사용하고, 내부결함의 부위 및 원인을 결과 데이터로 사용하여 인공지능기반의 유중가스 패턴 인식 프로그램을 설계한다. 여기서, 유중가스 패턴 인식 프로그램의 설계는 모델링 단계, 학습 단계, 인식률 평가 단계의 설계 사이클을 적 용하여 설계한다. 상기 모델링 단계는 유중가스 패턴을 인식하기 위한 여러 접근법과 알고리즘을 이용하여 어떻게, 어떠한 방식으 로 구성할 것인가를 결정하는 단계로, 각 클래스에 속한 패턴 집합의 통계적 분포에서 생성되는 결정 경계를 기 반으로 미지의 패턴이 속한 클래스를 결정하는 통계적 접근법, 패턴의 구조적인 유사성을 조사하고, 이를 이용 하여 분류를 행하는 구조적 접근법 및 패턴의 분류를 입력 자극에 대한 처리단위로 이루어진 망의 응답과정으로 분류하는 신경망적 접근법 등을 이용할 수 있으며, 입력층, 은닉층 및 출력층의 노드의 개수 및 층수 등을 결정 하여 설계한다. 상기 학습 단계는 유중가스 패턴 분류부에서 내부결함의 부위 및 원인에 따라 분류된 유중가스 패턴으로부 터 선택된 모델을 학습을 통해 데이터로 표현하는 완전한 모델로 만드는 단계로, 지도, 비지도, 강화학습 등이 포함될 수 있다. 상기 인식률 평가 단계는 학습된 모델이 결과와 부합하는지를 평가하는 단계로, 과도추정 또는 일반화 여부에 대한 평가를 진행한다. 유중가스 패턴 인식부는 이와 같이 설계한 인공지능기반의 유중가스 패턴 인식 프로그램을 지속적으로 학 습시킴으로써, 최적의 유중가스 패턴 인식 프로그램이 되도록 한다. 보다 구체적으로 유중가스 패턴 인식부는 유중가스 패턴 인식 프로그램의 입력패턴과 결과패턴의 연결가중 치를 계산하고, 이를 조절함으로써, 유중가스 패턴 인식 프로그램의 오차를 적정수준으로 조절하여 유중가스 패 턴 인식 프로그램의 정확도 및 신뢰도를 확보한다. 여기서, 유중가스 패턴 인식 프로그램의 오차는 입력된 유중가스 패턴에 대한 내부결함의 부위 및 원인과 출력 된 유중가스 패턴에 대한 내부결함의 부위 및 원인이 동일한지를 비교하여 동일하지 않았을 때, 그 차이가 된다. 따라서 이와 같은 유중가스 패턴 인식 프로그램의 오차가 적정수준인지 여부를 확인하여 적정수준이면 학습을 종료하고, 그렇지 않으면 적정수준이 될 때까지 학습을 반복적으로 수행한다. 나아가, 유중가스 패턴 인식부는 데이터 베이스부에 새롭게 업데이트되는 고장 데이터, 내부점 검 데이터 및 유중가스 분석 데이터를 실시간으로 학습하고, 피드백(feed-back)함으로써, 판별이 필 요한 전력용 변압기의 유중가스 패턴을 입력하였을 때, 입력한 유중가스 패턴이 유중가스 패턴 인식 프로그램에 학습 되지 않은 유중가스 패턴일 가능성을 극히 최소화하여 유중가스 패턴 인식 프로그램의 신뢰도를 극대화한 다. 도 2는 지금까지 설명한 본 발명의 유중가스 패턴 분석 장치의 유중가스 패턴 분석 방법을 보여주는 순서도로, 이하, 도 2를 참조하여 본 발명을 설명하되, 앞서 설명한 것과 유사하거나 동일한 내용은 생략한다. 도 2에 도시된 바와 같이, 본 발명의 유중가스 패턴 분석 장치는 (a) 전력용 변압기의 고장 데이터, 내부 점검 데이터 및 유중가스 분석 데이터를 통합하여 중앙 집중식으로 데이터베이스를 구축하는 단계, (b) 고장 데이터와 내부점검 데이터를 내부결함의 부위 및 원인으로 분류하는 단계, (c) 유중가스 분 석 데이터를 고장 데이터와 내부점검 데이터로부터 분류된 내부결함의 부위 및 원인에 따른 유 중가스 패턴으로 분류하는 단계, (d) 유중가스 패턴을 기반으로 인공지능기반의 유중가스 패턴 인식 프로그램을 설계 및 학습시키는 단계, (e) 유중가스 패턴 인식 프로그램에 판별이 필요한 전력용 변압기의 유중가스 패턴을 입력하는 단계 및 (f) 입력된 유중가스 패턴을 인식하고, 인식한 유중가스 패턴에 따른 내부결함의 부위 및 원 인을 판별하고, 그 결과를 표시하는 단계를 포함하여 진행된다. 한편, 상기 (f) 입력된 유중가스 패턴을 인식하고, 인식한 유중가스 패턴에 따른 내부결함의 부위 및 원인을 판 별하고, 그 결과를 표시하는 단계 이후, (g) 새롭게 업데이트되는 고장 데이터, 내부점검 데이터 및 유중가스 분석 데이터를 실시간으로 유중가스 패턴 인식 프로그램에 학습시키고, 피드백(feed-back)하는 단계를 더 진행함으로써, 유중가스 패턴 인식 프로그램의 신뢰도를 극대화한다. 본 발명인 전력용 변압기의 결함을 판별하기 위한 유중가스 패턴 분석 장치 및 방법의 실시 예는 본 발명이 속 하는 기술 분야에서 통상의 지식을 가진 당업자가 본 발명을 용이하게 실시할 수 있도록 하는 바람직한 실시 예 일 뿐, 전술한 실시 예 및 첨부한 도면에 한정되는 것은 아니므로 이로 인해 본 발명의 권리범위가 한정되는 것 은 아니다. 따라서 본 발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다. 또한, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 여러 가지 치환, 변형 및 변경이 가능하 다는 것이 당업자에게 있어 명백할 것이며, 당업자에 의해 용이하게 변경 가능한 부분도 본 발명의 권리범위에 포함됨은 자명하다."}
{"patent_id": "10-2017-0123612", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 유중가스 패턴 분석 장치의 블록도이다. 도 2는 본 발명의 유중가스 패턴 분석 방법의 순서도이다."}
