{"patent_id": "10-2022-0181797", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0099883", "출원번호": "10-2022-0181797", "발명의 명칭": "인공지능 기반 창작 문구 생성 시스템 및 그 방법", "출원인": "씨제이올리브네트웍스 주식회사", "발명자": "정우혁"}}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "단어, 문장, 단락을 포함하는 창작 문구를 생성할 키워드와 상기 키워드의 콘텐츠 도메인을 입력 및 전송하며,상기 창작 문구를 수신받아 디스플레이하는 사용자 단말; 콘텐츠 도메인별로 텍스트 정보로 이루어지는 데이터를 수집 및 정제하고, 정제된 데이터를 딥러닝 모델을 통해학습이 이루어지도록 하이퍼 파라미터의 세팅이 이루어지도록 구성되며, 학습이 완료된 학습 모델 정보 및 상기학습 모델의 레이어와 가중치를 저장하는 학습서버; 상기 사용자 단말 및 학습서버와 네트워크로 연결되며, 상기 사용자 단말로부터 키워드 및 콘텐츠 도메인이 수신되면, 상기 학습서버에 저장된 학습모델을 기반으로 창작 문구를 생성하는 창작 문구 생성 서버;를 포함하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 학습서버는, 웹 서버와 네트워크로 연결되며, 상기 웹 서버에 의해 구동하는 웹 페이지를 통해 출력되는 텍스트 정보를 포함하는 데이터를 수집하는 데이터 수집부; 상기 데이터 수집부에서 수집한 데이터를 수신받아 미리 설정된 정제 조건에 따라 데이터를 정제하는 데이터 정제부; 상기 데이터 수집부에서 수집한 데이터와 상기 데이터 정제부에서 정제한 정제 데이터를 저장하는 데이터 저장부; 및 상기 데이터 저장부에 저장된 저장 데이터들을 딥러닝 모델을 통해 반복 학습하여 상기 저장 데이터의 다음에입력될 단어의 예측하고, 학습이 완료된 학습 모델에 대한 레이어와 가중치 정보를 포함하는 학습 모델 정보를상기 데이터 저장부로 전송하여 저장이 이루어지도록 구성되는 데이터 학습부;를 포함하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 데이터 수집부는, 상기 창작 문구 생성 서버에 저장된 창작 문구에 대한 창작 데이터들을 수신받아 수집하는 것을 특징으로 하는인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 데이터 수집부는, 텍스트 정보의 수집을 위한 수집 설정값들을 설정할 수 있도록 구성되는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템.공개특허 10-2024-0099883-3-청구항 5 제2항에 있어서, 상기 데이터 수집부는, 웹 페이지를 호스팅하는 다른 웹 서버를 찾기 위해 네트워크를 검색하는 통신모듈을 더 포함하는 것을 특징으로하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 데이터 정제부는, 상기 데이터 수집부에서 수집한 데이터를 정제하기 위해 문단구분, 특수문자 제거 및 삽입 여부, 불용어 제거,띄어쓰기 여부를 포함하는 정제 조건을 설정하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서, 상기 데이터 정제부는, 상기 데이터 수집부에서 수집한 데이터를 미리 설정된 콘텐츠 도메인 별로 분류한 후, 분류된 콘텐츠 도메인 별로 정제가 이루어지도록 구성되는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 창작 문구 생성 서버는, 상기 사용자 단말로부터 상기 키워드에 대한 정보를 수신받으며, 상기 학습 서버에 저장된 학습 모델을 기반으로 수신받은 키워드와 관련된 1차 창작 문구를 생성하는 창작 문구 생성부; 상기 1차 창작 문구를 수신받으며, 수신받은 1차 창작 문구가 이전에 창작된 창작 문구와 중복, 또는 유사한지여부를 확인하고, 확인 결과에 대한 유사도 측정 결과 정보를 생성하는 유사도 측정부; 상기 유사도 측정 결과 정보를 수신받고, 수신받은 유사도 측정 결과 정보를 분석하여 상기 1차 창작 문구에서변환이 이루어질 단어, 문장, 또는 단락이 존재하는지 여부를 확인한 후, 최종 창작 문구를 생성하는 창작 문구변환 및 출력부; 및 상기 창작 문구 생성부 및 창작 문구 변환 및 출력부에서 생성한 창작단어, 창작문장, 창작단락, 창작 텍스트를포함하는 창작 문구와, 어휘 정보 리스트로 이루어지는 어휘 정보 데이터와, 사전 정의 단어 데이터가 저장되는데이터베이스;를 포함하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 창작 문구 생성부는, 공개특허 10-2024-0099883-4-상기 사용자 단말로 생성할 1차 창작 문구의 콘텐츠 도메인에 대한 정보를 요청하여 수신받고, 상기 콘텐츠 도메인에 대응되는 1차 창작 문구를 생성하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 창작 문구 생성부는, 상기 키워드에 생성할 1차 창작 문구에서 제외할 제외 단어가 존재하는지 여부를 확인하고, 상기 제외 단어가존재하지 않는 경우에는 상기 키워드와 관련성을 가지는 1차 창작 문구의 생성하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 창작 문구 생성부는, 상기 제외 단어가 존재하는 경우, 상기 학습서버에서 학습이 완료된 딥러닝 학습 모델과 상기 제외 단어를 포함하는 제외 단어 리스트 정보를 기반으로 해당 제외 단어가 포함되지 않은 1차 창작 문구를 생성하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 창작 문구 생성부에는, 상기 제외 단어를 포함하여 형성될 수 있는 단어 조합, 또는 단어의 형식에 대한 값을 계산하고, 계산 결과값을기반으로 제외 후보 단어를 생성한 후, 데이터베이스에 저장된 어휘 정보 데이터와 비교하여 상기 어휘 정보 데이터에 존재하는 단어들만 선별하고, 선별한 단어들로 이루어지는 제외 단어 리스트 정보를 생성하여 상기 창작문구 생성부로 전송하는 제외 단어 설정 모듈;이 더 구성되는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서, 상기 유사도 측정부는, 1차 창작 문구를 문장별(Line by line), 또는 문단별(Paragraph)로 분리하고, 분리된 단어별 1차 창작 문구, 또는 문장별 1차 창작 문구에 대한 유사도를 계산하여 유사도 측정 결과 정보를 생성하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 유사도 측정부는, 상기 1차 창작 문구를 문장별로 분리하는 경우, 학습에 활용된 데이터를 기반으로 문장을 분리할 수 있으며, 문장 분리 기준은 구두점을 기반으로 수행하되, 구두점이 존재하지 않는 경우에는, 행 단위로 문장의 분리하는 것공개특허 10-2024-0099883-5-을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서, 상기 유사도 측정부는, 상기 1차 창작 문구를 문단별로 분리하는 경우에는 학습에 활용된 데이터에서 시작과 끝으로 구분된 내용을 문단 단위로 정의하고 정의된 문단들을 각각의 세트로 지정하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서, 상기 유사도 측정부는, 분리된 문장별 1차 창작 문구, 또는 분리된 문단별 1차 창작 문구를 tokenizer를 이용하여 문장, 또는 문단을토큰단위로 분리하여 문장별, 또는 문단별 토큰을 생성하고, 분리한 토큰을 벡터화한 후, 데이터베이스에 저장된 기존의 창작 문구들과 비교하여 유사도를 계산하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제8항에 있어서, 상기 유사도 측정부는, 1차 창작 문구에 포함된 문장, 또는 문단들 중에서 유사도가 높은 순으로 내림차순으로 정렬하여 리스트화하여유사도 리스트 정보를 생성하고, 상기 유사도 리스트 정보를 포함하는 유사도 측정 결과 정보를 생성하는 것을특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제8항에 있어서, 상기 창작 문구 변환 및 출력부는, 상기 1차 창작 문구의 단어, 문장, 또는 단락에 대하여 변환 여부를 결정하는 유사도 기준값의 설정이 이루어지도록 구성되는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 창작 문구 변환 및 출력부는, 유사도 기준값 보다 1차 창작 문구의 유사도가 낮은 경우에는 1차 창작 문구를 최종 창작 문구로 판단하는 것을특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "공개특허 10-2024-0099883-6-제18항에 있어서, 상기 창작 문구 변환 및 출력부는, 상기 1차 창작 문구의 유사도가 유사도 기준값 보다 높은 경우, 상기 1차 창작 문구에 있어서, 유사도가 높은단어, 문장, 또는 단락을 변환하고, 변환한 창작 문구를 상기 유사도 측정부로 전송하여 해당 창작 문구에 대한유사도의 측정이 이루어지도록 구성되는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "사용자 단말, 학습서버 및 창작 문구 생성 서버를 포함하는 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법에 있어서, (a) 상기 학습서버를 통해 딥러닝 모델 학습을 수행하고, 창작 문구를 생성할 학습 모델을 저장하는 단계;(b) 상기 창작 문구 생성 서버에서 상기 사용자 단말로부터 창작 문구를 생성할 키워드를 수신받고, 상기 학습서버와 연동하여 상기 학습 모델을 공유받으며, 상기 키워드와 학습 모델을 기반으로 1차 창작 문구를생성하되, 상기 키워드에 제외할 단어가 존재하는지 여부를 확인하고, 상기 키워드에 제외할 단어가 존재하지않는 경우에 상기 학습 모델을 기반으로 상기 1차 창작 문구를 생성하는 단계; (c) 상기 창작 문구 생성 서버에서 1차 창작 문구가 이전에 창작된 창작 문구와 중복, 또는 유사한지 여부를 확인하고, 확인 결과에 대한 유사도 측정 결과 정보를 생성하는 단계; (d) 상기 창작 문구 생성 서버에서 상기 유사도 측정 결과 정보를 분석하여, 상기 유사도 측정 결과 정보가 유사도 기준값 보다 낮은 경우, 유사도 측정 결과 정보를 기반으로 최종 창작 문구를 생성하는 단계; (e) 생성된 상기 1차 창작 문구와 최종 창작 문구를 저장하는 단계; 를 포함하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서, 상기 (a) 단계는, (a1) 상기 학습 서버에서 웹 서버로부터 제공되는 텍스트 정보를 포함하는 데이터를 수집하는 데이터 수집단계; (a2) 수집한 데이터를 설정된 정제 조건에 따라 데이터를 정제하고, 정제된 정제 데이터를 저장하는 데이터 정제단계; (a3) 정제된 정제 데이터의 다음에 입력될 단어의 예측이 이루어지도록 딥러닝 모델을 통해 반복 학습하는 데이터 학습단계; 및 (a4) 학습이 이루어진 학습 결과 정보 및 학습 모델에 대한 정보를 저장하고, 상기 창작 문구 생성 서버에서 1차 창작 문구의 생성이 이루어지는 경우, 저장된 정보들을 공유하는 데이터 저장단계;를 포함하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제21항에 있어서, 상기 (b) 단계는, 창작 문구 생성 서버에서 상기 키워드를 분석하여 창작 문구의 콘텐츠 도메인에 대한 정보가 포함되어 있는지여부를 확인하고, 키워드에 콘텐츠 도메인 정보가 포함되어 있지 않은 경우, 상기 사용자 단말로 콘텐츠 도메인정보를 요청하여 수신받는 단계를 더 수행하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템을 이공개특허 10-2024-0099883-7-용한 창작 문구 생성 방법."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제21항에 있어서, 상기 (b) 단계는, 상기 제외 단어가 존재하는 경우, 제외 단어 리스트 정보를 생성하여 상기 학습서버에서 학습이 완료된 딥러닝학습 모델을 기반으로 상기 제외 단어 리스트 정보에 포함되어 있는 단어들을 제외한 1차 창작 문구를 생성하는것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서, 상기 (b) 단계는, 상기 창작 문구 생성 서버에서 상기 제외 단어를 포함하여 형성될 수 있는 단어 조합, 또는 단어의 형식에 대한값을 계산하여, 계산 결과값을 도출하고, 상기 계산 결과값을 기반으로 제외 후보 단어를 생성한 후, 어휘 정보데이터와 비교하여 상기 어휘 정보 데이터에 존재하는 단어들만 선별하며, 선별한 단어들로 이루어지는 제외 단어 리스트 정보를 생성하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성방법."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제21항에 있어서, 상기 (c) 단계는, (c1) 상기 1차 창작 문구를 문장별(Line by line), 또는 문단별(Paragraph)로 분리하는 단계; (c2) 분리된 단어별 1차 창작 문구, 또는 문장별 1차 창작 문구를 tokenizer를 이용하여 문장, 또는 문단을 토큰단위로 분리하여 문장별, 또는 문단별 토큰을 생성하고, 분리한 토큰을 벡터화한 후, 기존의 창작 문구들과비교하여 유사도를 계산하여 계산 결과값을 도출하는 단계;(c3) 계산 결과값을 기반으로 1차 창작 문구에 포함된 문장, 또는 문단들 중에서 유사도가 높은 순으로 내림차순으로 정렬하여 유사도 측정 결과 정보를 생성하는 단계;를 포함하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법."}
{"patent_id": "10-2022-0181797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제21항에 있어서, 상기 (d) 단계는, (d1) 상기 유사도 측정 결과 정보가 유사도 기준값을 만족하는지 여부를 확인하여 상기 1차 창작 문구에서 변환이 이루어질 단어, 문장, 또는 단락이 존재하는지 여부를 확인하는 단계; (d2) 상기 유사도 측정 결과 정보가 유사도 기준값 보다 높은 경우, 상기 1차 창작 문구 중에서, 유사도가 높은단어, 문장, 또는 단락을 변환하여 상기 1차 창작 문구를 재생성하는 단계; (d3) 재생성된 1차 창작 문구에 대한 유사도를 재측정하는 단계; (d4) 재생성된 1차 창작 문구에 대한 유사도 측정 결과 정보가 유사도 기준값 보다 낮은 경우 재생성된 유사도공개특허 10-2024-0099883-8-측정 결과 정보를 기반으로 최종 창작 문구를 생성하는 단계;를 더 포함하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법."}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 단어, 문장, 단락을 포함하는 창작 문구를 생성할 키워드와 상기 키워드의 콘텐츠 도메인을 입력 및 전송하며, 상기 창작 문구를 수신받아 디스플레이하는 사용자 단말; 콘텐츠 도메인별로 텍스트 정보로 이루어지 는 데이터를 수집 및 정제하고, 정제된 데이터를 딥러닝 모델을 통해 학습이 이루어지도록 하이퍼 파라미터의 세 팅이 이루어지도록 구성되며, 학습이 완료된 학습 모델 정보 및 상기 학습 모델의 레이어와 가중치를 저장하는 학습서버; 상기 사용자 단말 및 학습서버와 네트워크로 연결되며, 상기 사용자 단말로부터 키워드 및 콘텐츠 도 메인이 수신되면, 상기 학습서버에 저장된 학습모델을 기반으로 창작 문구를 생성하는 창작 문구 생성 서버;를 포함하는 것을 특징으로 하는 인공지능 기반 창작 문구 생성 시스템 및 이 시스템을 이용한 창작 문구 생성 방법 을 제공하는 것이다."}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 창작 문구 생성 시스템 및 그 방법에 관한 것으로, 더욱 상세하게는 시, 소설, 카피라 이터 등을 포함하는 콘텐츠 도메인(contents domain)에 대하여 비전문가도 간단한 키워드, 또는 문장의 입력을 통해 해당 콘텐츠 도메인에 대한 새로운 내용을 생성하여 제공함으로써, 비전문가에게 창작을 위한 새로운 아이 디어를 제공할 뿐만 아니라 창작의 어려움을 해소하기 위한 도움을 줄 수 있음은 물론, 작가로서의 창작 활동을 위한 보조 역할을 제공 할 수 있는 인공지능 기반 창작 문구 생성 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 창작은 인간 사회의 중요한 생산 활동 중 하나이며, 현재의 인터넷 시대에서 창작에 의해 생성된 대량의 정보 소비 콘텐츠가 일상 소비의 핵심 구성 부분으로 되고 있으며, 특히 시, 가사, 소설 등의 창작 분야 와 캐치프레이즈, 카피라이터 등의 홍보 마케팅에 활용되는 용어는 주제에 맞게 작가의 의도가 반영되는 창작물 에 의해 생성된 콘텐츠로 활용되고 있다. 그러나 단순한 키워드 단어 또는 문장을 활용하여 문맥을 고려한 문장을 구성하고, 이들을 구조적으로 결합하여 선정한 도메인에 맞게 생성하는데 어려움이 있으며, 작가의 의도를 적절한 논거에 따라 새로운 내용을 창작하는 것은 더욱 어렵다. 특히, 익숙하지 않은 비 전문가들은 새로운 영감을 얻고 창작하는데 어려운 문제점이 있었다. 이에, 대한민국 공개특허 제10-2021-0116379호에는, 텍스트 창작 방법에 있어서, 코퍼스 데이터를 획득하는 단 계; 상기 코퍼스 데이터를 레이블링하여, 제1 창작 제약 요소를 획득하는 단계; 제1 창작 목표를 획득하는 단계; 및, 상기 코퍼스 데이터 및 상기 제1 창작 제약 요소를 창작 모델에 입력하여 상기 제1 창작 목표에 매칭 하는 제1창작 텍스트를 생성하는 단계;를 포함하며, 상기 창작 모델을 훈련하기 위하여 복수의 훈련 코퍼스 및 상기 훈련 코퍼스에 대응하는 훈련 창작 텍스트를 획득하는 단계; 상기 훈련 코퍼스를 레이블링하여 상기 훈련 코퍼스의 훈련 제약 요소를 획득하는 단계; 및 상기 훈련 코퍼스, 상기 훈련 제약 요소 및 상기 훈련 창작 텍스 트를 훈련 샘플로 초기 상기 창작 모델에 입력하여 훈련을 수행하여 훈련된 상기 창작 모델을 생성하는 단계;를 포함하는 텍스트 창작 방법이 게재된 바 있다. 이와 같은 선행기술문헌의 경우, 사전에 설정된 규칙들을 바탕으로 입력 문장 또는 단어에 대응하는 출력 텍스 트를 생성하는 것으로서, 규칙을 기반으로 텍스트를 생성하는 접근 방식에서는, 사람이 모든 규칙을 사전에 일 일이 생성해야 하기 때문에 수 많은 언어로 이루어지는 인간의 언어들의 경우, 예외와 불확실성을 가진다는 점 에서 명확한 한계가 있을 수밖에 없다. 한편, 머신 러닝 기술이 발전하고 다양한 분야에 적용되면서, 인공 신경망에 기반한 텍스트 생성 방법론들이 연 구되고 있으며, 일 예로, 대한민국 공개특허 제10-2022-0064948호에는, 컴퓨팅 장치가 텍스트 생성 모델을 이용 하여 입력 텍스트로부터 출력 텍스트를 생성하는 방법으로서, 복수의 군집으로 분할된 말뭉치를 상기 텍스트 생 성 모델에 입력하고, 상기 텍스트 생성 모델의 출력을 이용하여 상기 출력 텍스트에 포함될 제1 타깃 토큰이 속 하는 타깃 군집을 예측하는 단계; 및 상기 타깃 군집을 이용하여 상기 제1 타깃 토큰을 예측하는 단계를 포함하 되, 상기 복수의 군집들은 각각의 군집에 포함된 토큰들의 상대 도수의 분포가 학습 대상 말뭉치 전체에 포함된 토큰들의 상대 도수의 분포보다 균일한 텍스트 생성 방법이 게재된 바 있다. 하지만, 전술한 선행기술문헌의 경우, 키워드나 문장 기반으로 관련된 모든 내용을 생성하는 것으로, 이는 생성 한 내용에 대해 중복성 검사와 같은 피드백이 제공되지 않아 표절 우려가 있을뿐만 아니라 내용의 독창성을 위 한 희소 단어를 생성하지 못하는 문제점이 있고, 이는 결국 작가의 의도를 적절한 논거에 따라 새로운 내용을 창작하기 어려운 기존의 문제점을 여전히 가지고 있는 문제점이 있다."}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "여기서 전술한 배경기술 또는 종래기술은 본 발명의 기술적 의의를 이해하는데 도움이 되기 위한 것일 뿐, 본 발명의 출원 전에 이 발명이 속하는 기술분야에서 널리 알려진 기술을 의미하는 것은 아니다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2021-0116379호 (특허문헌 0002) 대한민국 공개특허 제10-2022-0064948호"}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적 과제는 시, 소설, 카피라이터 등을 포함하는 콘텐츠 도메인에 대하여 비전문가 도 간단한 키워드, 또는 문장의 입력을 통해 해당 콘텐츠 도메인에 대한 새로운 내용을 생성하여 제공함으로써, 비전문가에게 창작을 위한 새로운 아이디어를 제공할 뿐만 아니라 창작의 어려움을 해소하기 위한 도움을 줄 수 있음은 물론, 작가로서의 창작 활동을 위한 보조 역할을 제공 할 수 있는 인공지능 기반 창작 문구 생성 시스템 및 그 방법을 제공하는데 그 목적이 있다. 또한, 본 발명이 이루고자 하는 기술적 과제는 인공지능을 통해 생성한 내용에 대해 중복 또는 유사 비율을 체 크하여 자동으로 문장을 대체하며, 희소단어를 생성하여 독창성있는 내용을 구성할 수 있는 인공지능 기반 창작 문구 생성 시스템 및 그 방법을 제공하는데 그 목적이 있다. 또한, 본 발명이 이루고자 하는 기술적 과제는 콘텐츠 도메인의 목적에 따른 완성도를 향상시킬 수 있고, 전문 가 또는 비전문가들의 창작의 어려움을 해소함으로써 저비용, 고효율의 인공지능 기반 창작 문구 생성 시스템 및 그 방법을 제공하는데 그 목적이 있다. 다만, 본 발명의 목적은 이에만 제한되는 것은 아니며, 명시적으로 언급하지 않더라도"}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이나 실 시 형태로부터 파악될 수 있는 목적이나 효과도 이에 포함됨은 물론이다."}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "과제의 해결 수단 이러한 과제를 해결하기 위하여 본 발명에 따른 인공지능 기반 창작 문구 생성 시스템은, 단어, 문장, 단락을 포함하는 창작 문구를 생성할 키워드와 상기 키워드의 콘텐츠 도메인을 입력 및 전송하며, 상기 창작 문구를 수 신받아 디스플레이하는 사용자 단말; 콘텐츠 도메인별로 텍스트 정보로 이루어지는 데이터를 수집 및 정제하고, 정제된 데이터를 딥러닝 모델을 통해 학습이 이루어지도록 하이퍼 파라미터의 세팅이 이루어지도록 구성되며, 학습이 완료된 학습 모델 정보 및 상기 학습 모델의 레이어와 가중치를 저장하는 학습서버; 상기 사용자 단말 및 학습서버와 네트워크로 연결되며, 상기 사용자 단말로부터 키워드 및 콘텐츠 도메인이 수신되면, 상기 학습 서버에 저장된 학습모델을 기반으로 창작 문구를 생성하는 창작 문구 생성 서버;를 포함하는 것을 특징으로 한 다. 일 실시예에 있어서, 상기 학습서버는, 웹 서버와 네트워크로 연결되며, 상기 웹 서버에 의해 구동하는 웹 페이 지를 통해 출력되는 텍스트 정보를 포함하는 데이터를 수집하는 데이터 수집부; 상기 데이터 수집부에서 수집한 데이터를 수신받아 미리 설정된 정제 조건에 따라 데이터를 정제하는 데이터 정제부; 상기 데이터 수집부에서 수집한 데이터와 상기 데이터 정제부에서 정제한 정제 데이터를 저장하는 데이터 저장부; 및 상기 데이터 저장 부에 저장된 저장 데이터들을 딥러닝 모델을 통해 반복 학습하여 상기 저장 데이터의 다음에 입력될 단어의 예 측하고, 학습이 완료된 학습 모델에 대한 레이어와 가중치 정보를 포함하는 학습 모델 정보를 상기 데이터 저장 부로 전송하여 저장이 이루어지도록 구성되는 데이터 학습부;를 포함하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 데이터 수집부는, 상기 창작 문구 생성 서버에 저장된 창작 문구에 대한 창작 데이터 들을 수신받아 수집하는 것을 특징으로 한다.일 실시예에 있어서, 상기 데이터 수집부는, 텍스트 정보의 수집을 위한 수집 설정값들을 설정할 수 있도록 구 성되는 것을 특징으로 한다. 일 실시예에 있어서, 상기 데이터 수집부는, 웹 페이지를 호스팅하는 다른 웹 서버를 찾기 위해 네트워크를 검 색하는 통신모듈을 더 포함하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 데이터 정제부는, 상기 데이터 수집부에서 수집한 데이터를 정제하기 위해 문단구분, 특수문자 제거 및 삽입 여부, 불용어 제거, 띄어쓰기 여부를 포함하는 정제 조건을 설정하는 것을 특징으로 한 다. 일 실시예에 있어서, 상기 데이터 정제부는, 상기 데이터 수집부에서 수집한 데이터를 미리 설정된 콘텐츠 도메 인 별로 분류한 후, 분류된 콘텐츠 도메인 별로 정제가 이루어지도록 구성되는 것을 특징으로 한다. 일 실시예에 있어서, 상기 창작 문구 생성 서버는, 상기 사용자 단말로부터 상기 키워드에 대한 정보를 수신받 으며, 상기 학습 서버에 저장된 학습 모델을 기반으로 수신받은 키워드와 관련된 1차 창작 문구를 생성하는 창 작 문구 생성부; 상기 1차 창작 문구를 수신받으며, 수신받은 1차 창작 문구가 이전에 창작된 창작 문구와 중복, 또는 유사한지 여부를 확인하고, 확인 결과에 대한 유사도 측정 결과 정보를 생성하는 유사도 측정부; 상 기 유사도 측정 결과 정보를 수신받고, 수신받은 유사도 측정 결과 정보를 분석하여 상기 1차 창작 문구에서 변 환이 이루어질 단어, 문장, 또는 단락이 존재하는지 여부를 확인한 후, 최종 창작 문구를 생성하는 창작 문구 변환 및 출력부; 및 상기 창작 문구 생성부 및 창작 문구 변환 및 출력부에서 생성한 창작단어, 창작문장, 창작 단락, 창작 텍스트를 포함하는 창작 문구와, 어휘 정보 리스트로 이루어지는 어휘 정보 데이터와, 사전 정의 단 어 데이터가 저장되는 데이터베이스;를 포함하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 창작 문구 생성부는, 상기 사용자 단말로 생성할 1차 창작 문구의 콘텐츠 도메인에 대한 정보를 요청하여 수신받고, 상기 콘텐츠 도메인에 대응되는 1차 창작 문구를 생성하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 창작 문구 생성부는, 상기 키워드에 생성할 1차 창작 문구에서 제외할 제외 단어가 존재하는지 여부를 확인하고, 상기 제외 단어가 존재하지 않는 경우에는 상기 키워드와 관련성을 가지는 1차 창 작 문구의 생성하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 창작 문구 생성부는, 상기 제외 단어가 존재하는 경우, 상기 학습서버에서 학습이 완 료된 딥러닝 학습 모델과 상기 제외 단어를 포함하는 제외 단어 리스트 정보를 기반으로 해당 제외 단어가 포함 되지 않은 1차 창작 문구를 생성하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 창작 문구 생성부에는, 상기 제외 단어를 포함하여 형성될 수 있는 단어 조합, 또는 단어의 형식에 대한 값을 계산하고, 계산 결과값을 기반으로 제외 후보 단어를 생성한 후, 데이터베이스에 저장 된 어휘 정보 데이터와 비교하여 상기 어휘 정보 데이터에 존재하는 단어들만 선별하고, 선별한 단어들로 이루 어지는 제외 단어 리스트 정보를 생성하여 상기 창작 문구 생성부로 전송하는 제외 단어 설정 모듈;이 더 구성 되는 것을 특징으로 한다. 일 실시예에 있어서, 상기 유사도 측정부는, 1차 창작 문구를 문장별(Line by line), 또는 문단별(Paragraph)로 분리하고, 분리된 단어별 1차 창작 문구, 또는 문장별 1차 창작 문구에 대한 유사도를 계산하여 유사도 측정 결 과 정보를 생성하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 유사도 측정부는, 상기 1차 창작 문구를 문장별로 분리하는 경우, 학습에 활용된 데 이터를 기반으로 문장을 분리할 수 있으며, 문장 분리 기준은 구두점을 기반으로 수행하되, 구두점이 존재하지 않는 경우에는, 행 단위로 문장의 분리하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 유사도 측정부는, 상기 1차 창작 문구를 문단별로 분리하는 경우에는 학습에 활용된 데이터에서 시작과 끝으로 구분된 내용을 문단 단위로 정의하고 정의된 문단들을 각각의 세트로 지정하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 유사도 측정부는, 분리된 문장별 1차 창작 문구, 또는 분리된 문단별 1차 창작 문구 를 tokenizer를 이용하여 문장, 또는 문단을 토큰단위로 분리하여 문장별, 또는 문단별 토큰을 생성하고, 분리 한 토큰을 벡터화한 후, 데이터베이스에 저장된 기존의 창작 문구들과 비교하여 유사도를 계산하는 것을 특징으 로 한다.일 실시예에 있어서, 상기 유사도 측정부는, 1차 창작 문구에 포함된 문장, 또는 문단들 중에서 유사도가 높은 순으로 내림차순으로 정렬하여 리스트화하여 유사도 리스트 정보를 생성하고, 상기 유사도 리스트 정보를 포함 하는 유사도 측정 결과 정보를 생성하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 창작 문구 변환 및 출력부는, 상기 1차 창작 문구의 단어, 문장, 또는 단락에 대하여 변환 여부를 결정하는 유사도 기준값의 설정이 이루어지도록 구성되는 것을 특징으로 한다. 일 실시예에 있어서, 상기 창작 문구 변환 및 출력부는, 유사도 기준값 보다 1차 창작 문구의 유사도가 낮은 경 우에는 1차 창작 문구를 최종 창작 문구로 판단하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 창작 문구 변환 및 출력부는, 상기 1차 창작 문구의 유사도가 유사도 기준값 보다 높 은 경우, 상기 1차 창작 문구에 있어서, 유사도가 높은 단어, 문장, 또는 단락을 변환하고, 변환한 창작 문구를 상기 유사도 측정부로 전송하여 해당 창작 문구에 대한 유사도의 측정이 이루어지도록 구성되는 것을 특징으로 한다. 다른 일 실시예에 있어서, 본 발명에 따른 인공지능 기반 창작 문구 생성 방법은, 사용자 단말, 학습서버 및 창 작 문구 생성 서버를 포함하는 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법에 있어서, (a) 상기 학습서버를 통해 딥러닝 모델 학습을 수행하고, 창작 문구를 생성할 학습 모델을 저장하는 단계; (b) 상기 창작 문구 생성 서버에서 상기 사용자 단말로부터 창작 문구를 생성할 키워드를 수신받고, 상기 학습서버 와 연동하여 상기 학습 모델을 공유받으며, 상기 키워드와 학습 모델을 기반으로 1차 창작 문구를 생성하되, 상 기 키워드에 제외할 단어가 존재하는지 여부를 확인하고, 상기 키워드에 제외할 단어가 존재하지 않는 경우에 상기 학습 모델을 기반으로 상기 1차 창작 문구를 생성하는 단계; (c) 상기 창작 문구 생성 서버에서 1차 창작 문구가 이전에 창작된 창작 문구와 중복, 또는 유사한지 여부를 확인하고, 확인 결과에 대한 유사도 측정 결과 정보를 생성하는 단계; (d) 상기 창작 문구 생성 서버에서 상기 유사도 측정 결과 정보를 분석하여, 상기 유사 도 측정 결과 정보가 유사도 기준값 보다 낮은 경우, 유사도 측정 결과 정보를 기반으로 최종 창작 문구를 생성 하는 단계; (e) 생성된 상기 1차 창작 문구와 최종 창작 문구를 저장하는 단계;를 포함하는 것을 특징으로 한다. 다른 일 실시예에 있어서, 상기 (a) 단계는, (a1) 상기 학습 서버에서 웹 서버로부터 제공되는 텍스트 정보를 포함하는 데이터를 수집하는 데이터 수집단계; (a2) 수집한 데이터를 설정된 정제 조건에 따라 데이터를 정제하 고, 정제된 정제 데이터를 저장하는 데이터 정제단계; (a3) 정제된 정제 데이터의 다음에 입력될 단어의 예측이 이루어지도록 딥러닝 모델을 통해 반복 학습하는 데이터 학습단계; 및 (a4) 학습이 이루어진 학습 결과 정보 및 학습 모델에 대한 정보를 저장하고, 상기 창작 문구 생성 서버에서 1차 창작 문구의 생성이 이루어지는 경우, 저장된 정보들을 공유하는 데이터 저장단계;를 포함하는 것을 특징으로 한다. 다른 일 실시예에 있어서, 상기 (b) 단계는, 창작 문구 생성 서버에서 상기 키워드를 분석하여 창작 문구의 콘 텐츠 도메인에 대한 정보가 포함되어 있는지 여부를 확인하고, 키워드에 콘텐츠 도메인 정보가 포함되어 있지 않은 경우, 상기 사용자 단말로 콘텐츠 도메인 정보를 요청하여 수신받는 단계를 더 수행하는 것을 특징으로 한 다. 다른 일 실시예에 있어서, 상기 (b) 단계는, 상기 제외 단어가 존재하는 경우, 제외 단어 리스트 정보를 생성하 여 상기 학습서버에서 학습이 완료된 딥러닝 학습 모델을 기반으로 상기 제외 단어 리스트 정보에 포함되어 있 는 단어들을 제외한 1차 창작 문구를 생성하는 것을 특징으로 한다. 다른 일 실시예에 있어서, 상기 (b) 단계는, 상기 창작 문구 생성 서버에서 상기 제외 단어를 포함하여 형성될 수 있는 단어 조합, 또는 단어의 형식에 대한 값을 계산하여, 계산 결과값을 도출하고, 상기 계산 결과값을 기 반으로 제외 후보 단어를 생성한 후, 어휘 정보 데이터와 비교하여 상기 어휘 정보 데이터에 존재하는 단어들만 선별하며, 선별한 단어들로 이루어지는 제외 단어 리스트 정보를 생성하는 것을 특징으로 한다. 다른 일 실시예에 있어서, 상기 (c) 단계는, (c1) 상기 1차 창작 문구를 문장별(Line by line), 또는 문단별 (Paragraph)로 분리하는 단계; (c2) 분리된 단어별 1차 창작 문구, 또는 문장별 1차 창작 문구를 tokenizer를 이용하여 문장, 또는 문단을 토큰단위로 분리하여 문장별, 또는 문단별 토큰을 생성하고, 분리한 토큰을 벡터화 한 후, 기존의 창작 문구들과 비교하여 유사도를 계산하여 계산 결과값을 도출하는 단계; (c3) 계산 결과값을 기반으로 1차 창작 문구에 포함된 문장, 또는 문단들 중에서 유사도가 높은 순으로 내림차순으로 정렬하여 유사 도 측정 결과 정보를 생성하는 단계;를 포함하는 것을 특징으로 한다.다른 일 실시예에 있어서, 상기 (d) 단계는, (d1) 상기 유사도 측정 결과 정보가 유사도 기준값을 만족하는지 여부를 확인하여 상기 1차 창작 문구에서 변환이 이루어질 단어, 문장, 또는 단락이 존재하는지 여부를 확인하 는 단계; (d2) 상기 유사도 측정 결과 정보가 유사도 기준값 보다 높은 경우, 상기 1차 창작 문구 중에서, 유사 도가 높은 단어, 문장, 또는 단락을 변환하여 상기 1차 창작 문구를 재생성하는 단계; (d3) 재생성된 1차 창작 문구에 대한 유사도를 재측정하는 단계; (d4) 재생성된 1차 창작 문구에 대한 유사도 측정 결과 정보가 유사도 기준값 보다 낮은 경우 재생성된 유사도 측정 결과 정보를 기반으로 최종 창작 문구를 생성하는 단계;를 더 포 함하는 것을 특징으로 한다. 위에서 언급된 본 발명의 기술적 과제 외에도, 본 발명의 다른 특징 및 이점들이 이하에서 기술되거나, 그러한"}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "기술 및 설명으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것 이다."}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 본 발명에 따르면 다음과 같은 효과가 있다. 본 발명에 따른 인공지능 기반 창작 문구 생성 시스템 및 그 방법은 시, 소설, 카피라이터 등을 포함하는 콘텐 츠 도메인에 대하여 비전문가도 간단한 키워드, 또는 문장의 입력을 통해 해당 콘텐츠 도메인에 대한 새로운 내 용을 생성하여 제공함으로써, 비전문가에게 창작을 위한 새로운 아이디어를 제공할 수 있는 효과가 있다 또한, 본 발명에 따른 인공지능 기반 창작 문구 생성 시스템 및 그 방법은 창작의 어려움을 해소하기 위한 도움 을 줄 수 있음은 물론, 작가로서의 창작 활동을 위한 보조 역할을 제공 할 수 있는 효과가 있다. 본 발명에 따른 인공지능 기반 창작 문구 생성 시스템 및 그 방법은 인공지능을 통해 생성한 내용에 대해 중복 또는 유사 비율을 체크하여 자동으로 문장을 대체하며, 희소단어를 생성하여 독창성있는 내용을 구성할 수 있는 효과가 있다. 본 발명에 따른 인공지능 기반 창작 문구 생성 시스템 및 그 방법은 저비용, 고효율의 시스템을 제공함으로써, 콘텐츠 도메인의 목적에 따른 완성도를 향상시킬 수 있고, 전문가 또는 비전문가들의 창작의 어려움을 해소할 수 있어 경제적 이익을 창출할 수 있는 효과가 있다. 더불어, 본 발명의 다양하면서도 유익한 장점과 효과는 상술한 내용에 한정되지 않으며, 본 발명의 구체적인 실 시 형태를 설명하는 과정에서 보다 쉽게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0181797", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 우선 각 도면의 구성요소들에 참조 부호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 이하에서 기재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성 요소가 내재될 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요 소를 더 포함할 수 있는 것으로 해석되어야 하며, 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 또한, 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 식별부호를 사용할 수 있 다. 이러한 식별부호는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것이고, 설명의 편의를 위하여 사용되 는 것일 뿐, 그 식별부호에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\" 된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성 요소 사이에 또 다른 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 또한, 본 발명에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단 말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수 있다. 마찬가지로, 서버가 수행하는 것으로 기술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 또한, 본 발명의 각 실시예에 기재된 각각의 서버는, 단말, 장치 또는 디바이스와 네트워크를 통해 통신하여 명 령, 코드, 파일, 콘텐츠, 서비스 등을 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장치들로 구현되는 시스템일 수 있으며, 메모리, 프로세서, 통신 인터페이스, 입출력 인터페이스 및 데이터베이스를 포함할 수 있다. 특히, 본 발명의 각 실시예에 따른 시스템을 실행시키기 위한 수단으로는 어플리케이션(Application), 또는 웹 서버일 수 있으며, 이 어플리케이션, 또는 웹 서버를 기록한 기록매체를 읽을 수 있는 수단인 단말로는, 일반적 인 데스크 탑이나 노트북 등의 일반 PC 뿐만 아니라, 스마트 폰, 태블릿 PC, 등의 모바일 단말기를 포함할 수 있다. 이하, 첨부된 도면을 참고하여 본 발명의 실시예들을 상세히 설명하도록 한다. 도시된 바와 같이, 본 발명의 인공지능 기반 창작 문구 생성 시스템은 창작 문구를 생성할 키워드를 입력하고, 입력한 키워드를 전송하며, 생성된 창작 문구를 수신받아 디스플레이하는 사용자 단말, 콘텐츠 도메인별 데이터를 수집 및 정제하고, 정제된 데이터를 딥러닝 모델을 통해 학습이 이루어지도록 하이퍼 파라미터의 세팅 이 이루어지도록 구성되며, 최적화된 콘텐츠 도메인별 모델의 레이어와 가중치를 저장하는 학습서버, 사용 자 단말 및 학습서버와 네트워크로 연결되며, 사용자 단말로부터 키워드가 수신되면, 학습서버 에 저장된 콘텐츠 도메인별 모델을 기반으로 창작 문구를 생성하는 창작 문구 생성 서버를 포함하여 구성된다. 여기서, 사용자 단말에는 사용자가 생성하고자 하는 창작 문구를 생성하고자 하는 입력 키워드와, 창작 문 구에서 제외하고자 하는 제외 키워드를 각각 입력할 수 있는 키워드 UI가 구성될 수 있다. 여기서, 창작 문구는 단어 뿐만 아니라, 문장이나, 문장들로 이루어지는 단락을 포함할 수 있을 것이다. 학습서버는 웹 서버와 네트워크로 연결되며, 이 웹 서버에 의해 구동하는 웹 페이지를 통해 출력되는 문자, 문장 등을 포함하는 텍스트 정보를 수집하는 데이터 수집부와, 텍스트 정보로 이루어지는 데이터를 데이터 수집부로부터 수신받아 미리 설정된 정제 조건에 따라 데이터를 정제하고, 정제가 이루어진 정제 데이터를 데이터 저장부로 전송하여 저장이 이루어지도록 하는 데이터 정제부와, 데이터 저장부(24 0)에 저장된 저장 데이터들을 제공받으며, 이 저장 데이터들을 딥러닝 모델을 통해 반복 학습하여 상기 저장 데 이터의 다음에 입력될 단어의 예측하는 데이터 학습부와, 데이터 수집부 및 데이터 정제부를 통 해 수집 및 정제된 데이터들이 저장되며, 데이터 학습부의 요청에 따라 저장된 데이터들을 제공하는 데이터 저장부를 포함하여 구성된다. 데이터 수집부는 OCR, crawling 등과 같은 데이터 수집 시스템으로 이루어지며, 웹 서버와 네트워크로 연 결되어 이 웹 서버에서 호스팅하는 웹 페이지로부터 텍스트 정보를 수집한다. 이러한 데이터 수집부는 상기 웹 페이지를 통해 표시되는 텍스트 정보 뿐만 아니라, 후술할 창작 문구 생 성 서버에 구성되는 데이터베이스와 네트워크로 연결되어 이 데이터베이스에 저장된 창작 데이 터들을 수신받을 수 있으며, 수신받은 창작 데이터에 포함된 창작 문구에 대한 정보를 수집할 수 있다. 이에 따라 웹 페이지에 기재되는 통상의 텍스트 정보 뿐만 아니라, 창작 문구 생성 서버를 통해 생성되는 창작 문구(또는 창작 데이터) 역시 수집하여 데이터 학습부를 통해 재학습이 이루어지도록 할 수 있을 것 이다. 이러한 데이터 수집부는, 텍스트 정보의 수집을 위한 수집 설정값들을 설정할 수 있도록 구성될 수 있으며, 수집이 이루어진 텍스트 정보를 데이터 저장부로 전송하여 저장이 이루어지도록 구성된다. 이때, 수집 설정값은 수집할 텍스트 정보에서의 키워드, 기사 게재기간, 페이지 및 수집 범위 설정 등과 같은 데이터 수집을 위한 설정값과, 출력조건, 키워드의 최소 빈도수 설정 등과 같은 옵션값으로 이루어지도록 구성 될 수 있으나, 이에 한정하는 것은 아니다. 이와 같은 데이터 수집부는 데이터 학습에 필요한 데이터 세트를 수집하기 위해 설정된 수집 설정값을 바 탕으로 수집 가능한 기사를 검색하고, 검색된 모든 기사의 텍스트 정보를 수집하여, 데이터 정제부로 전송 한다. 여기서, 데이터 수집부는 수집 설정값들을 기반으로 URL을 생성하고, 생성한 URL을 사용하여 웹 페이지에 게재된 기사를 검색하여, 검색된 기사의 목록 및 기사 본문을 포함하는 HTML 파일을 웹 서버로부터 제공받으며, 제공받은 HTML 파일 내용 중 기사의 제목 및 내용에 해당하는 텍스트 정보를 추출하고, 추출된 텍스트 정보들을 데이터 정제부로 전송할 수 있으나, 이에 한정하는 것은 아니다. 한편, 데이터 수집부는, 웹 페이지를 호스팅하는 다른 웹 서버를 찾기 위해 네트워크를 검색하는 통신모듈 을 더 포함할 수 있으며, 이 통신모듈을 통해 검색된 웹 크롤러를 호스팅하도록 구성될 수 있다. 또한, 데이터 수집부는 상기 통신모듈을 통해 검색된 다른 웹 서버가 알지 못하는 웹 페이지를 검출할 수 있으며, 알지 못하는 웹 페이지에 관한 새로운 정보에 대한 변동, 또는 상태를 편집할 수도 있을 것이다. 데이터 정제부는, 데이터 수집부의 수행 결과로 수집한 텍스트 정보를 기반으로 데이터 전처리를 수 행하여 수집된 텍스트 정보들 중에서 학습에 불필요한 텍스트 정보를 정제하는 구성요소로서, 정제조건에 따라 텍스트 정보의 분석을 수행하고, 분석 결과 정보를 데이터 학습부 및 데이터 저장부로 각각 전송한다. 이러한 데이터 정제부는, 상기 데이터 수집부에서 수집한 수집 텍스트 정보로 구성되는 수집 데이터 를 정제하기 위한 정제조건을 설정하고, 정제조건을 기반으로 수집 데이터의 정제가 이루어지도록 구성된다. 이때, 본 발명의 데이터 정제부는 수집 데이터의 정제 조건으로 문단구분, 특수문자 제거 및 삽입 여부, 불용어 제거, 띄어쓰기 등을 설정할 수 있을 것이다. 여기서, 문단구분은 수집 데이터에 포함된 텍스트 정보들을 문단별로 구분하는 것이다. 또한, 특수문자 제거 및 삽입 여부는 상기 텍스트 정보에 포함된 특수문자 중에서 제거할 특수문자와 삽입할 특 수문자를 설정한다. 이때, 삽입할 특수문자는 “BOS”, “EOS”, 또는 사전 정의된 특수문자일 수 있다. 또한, 제거할 특수문자의 경우에는 !, @, #, $, %, &, * 등일 수 있으나, 이에 한정하는 것은 아니다. 또한, 띄어쓰기의 설정은 특수문자가 제거된 수집 데이터에서 두칸 이상의 공백을 수정하고, 행의 구분이 이루 어지도록 구성된다. 데이터 정제부는 수집된 데이터를 미리 설정된 콘텐츠 도메인 별로 분류한 후, 분류된 콘텐츠 도메인 별로 정제가 이루어지도록 구성될 수 있다. 데이터 학습부는 데이터 정제부를 통해 정제된 정제 데이터를 수신받으며, 수신받은 정제 데이터를 언어모델을 기반으로 하는 딥러닝 모델로 반복 학습하여 정제 텍스트 정보에 포함된 키워드들 간의 관계 범위, 희소단어의 요소, 맥락 등의 분석이 이루어지도록 하고, 분석 결과를 기반으로 해당 정제 데이터의 다음에 입력 될 단어의 예측이 이루어지도록 구성된다. 데이터 학습부는 딥러닝 학습 모델을 기반으로 하이퍼 파라미터의 세팅이 이루어지도록 구성되며, 학습 결 과에 따라 최적화된 학습 모델에 대한 레이어와 가중치 정보를 포함하는 학습 모델에 대한 정보를 데이터 저장 부로 전송하여 저장이 이루어지도록 구성되고, 창작 문구 생성 서버를 통해 데이터 저장부에 저 장된 학습모델의 레이어와 가중치를 기반으로 창작 문구의 생성이 이루어지도록 구성된다. 여기서, 언어모델이란 어진 단어들로부터 그 다음에 등장할 단어의 확률을 예측하는 방식으로, 다량의 말뭉치 (corpus)를 기반으로 학습하며, 활용할 태스크에 맞게 모델을 튜닝하여 활용할 수 있는 것이다. 이와 같은 본 발명의 데이터 학습부는 딥러닝 인공 신경망에 적용하여 출력값을 얻는 것으로, 출력값들에 대응하는 트레이닝 에러(오차)들을 계산하고, 트레이닝을 통해 계산된 에러를 최소화하기 위해 딥러닝 모델 내 에 존재하는 노드들의 연결관계를 최적화하여 모델을 학습시키는 것이다. 이때, 데이터 학습부는 사용자가 정의한 학습조건에 따라 학습을 수행한 후, 최적화된 모델의 레이어와 주 요 가중치 (weight)를 저장한다. 여기서, 학습조건으로는 실행횟수, 학습비율, 배치크기 등을 포함하는 하이퍼파라미터일 수 있으나, 이에 한정 하는 것은 아니다. 본 발명의 데이터 학습부는 Generative pretrained transformers (GTP)를 주요 생성 모델로 활용하였으나, 이에 한정하는 것은 아니며, GPT 기반 변형된 다양한 언어모델을 활용하여 성능을 향상시킬 수도 있을 것이다. 한편, 데이터 저장부는 데이터 수집부에 의해 수집된 텍스트 정보(또는 데이터)와, 데이터 정제부 에서 정제가 이루어진 정제된 텍스트 정보를 저장하고, 데이터 학습부를 통해 학습이 이루어진 학습 결과 정보 및 학습 모델에 대한 정보를 저장할 수 있다. 이러한 데이터 저장부는 창작 문구 생성 서버의 창작 문구 생성부에서 1차 창작 문구의 생성이 이루어지는 경우, 이 장착 문구 생성부와 네트워크로 연결되어 데이터 학습부를 통해 최적화된 학습 모델 및 이 학습모델의 레이어와 주요 가중치에 대한 정보에 대한 공유가 이루어지도록 구성될 수 있다. 여기서, 데이터 저장부는 저장되는 정보들을 콘텐츠 도메인별로 분류하여 저장이 이루어짐이 바람직할 것 이다. 창작 문구 생성 서버는 사용자 단말로부터 창작 문구를 생성할 키워드에 대한 정보를 수신받으며, 학 습서버에서 학습이 완료된 딥러닝 학습 모델을 기반으로 수신받은 키워드 정보와 관련된 1차 창작 문구를 생성하고, 생성한 1차 창작 문구의 유사도를 측정하여 유사도 측정 결과 정보를 생성하며, 유사도 측정 결과 정 보를 기반으로 최종 창작 문구를 생성하는 것으로, 창작 문구 생성부와, 유사도 측정부와 창작 문구 변환 및 출력부와, 데이터베이스를 포함하여 구성된다. 창작 문구 생성부는 사용자 단말과 네트워크로 연결되며, 사용자 단말로부터 생성할 창작 문구 에 대한 키워드를 수신받으며, 학습 서버에서 학습이 이루어진 학습 모델을 기반으로 수신받은 키워드와 관련된 창작 문구를 생성하고, 생성한 창작 문구를 유사도 측정부로 전송한다. 여기서, 창작 문구 생성부는 사용자 단말로부터 키워드가 수신되는 경우, 학습 서버와 네트워크 로 연결되어 데이터 저장부에 저장된 학습모델 및 이 학습모델의 레이어와 주요 가중치에 대한 정보의 공 유가 이루어지도록 요청할 수 있다. 이러한 창작 문구 생성부는 창작 문구의 생성시 사용자 단말로 생성할 창작 문구의 콘텐츠 도메인에 대한 정보를 요청하여 수신받을 수 있다. 이때, 사용자 단말에서는 생성할 창작 문구에 대한 키워드를 전송할 때, 콘텐츠 도메인에 대한 정보를 함 께 전송함이 바람직하나, 이에 한정하는 것은 아니다. 또한, 창작 문구 생성부는 사용자 단말로부터 수신받은 키워드에 제외할 단어가 존재하는지 여부를 확인하고, 사용자 단말로부터 수신받은 키워드에 제외할 단어가 존재하지 않는 경우에는 학습서버에 서 학습이 완료된 딥러닝 학습 모델을 기반으로 키워드와 관련성을 가지는 1차 창작 문구의 생성이 이루어지도 록 한다. 또한, 창작 문구 생성부는 제외 단어가 존재하는 경우에는 학습서버에서 학습이 완료된 딥러닝 학습 모델을 기반으로 해당 제외 단어가 포함되지 않은 1차 창작 문구의 생성이 이루어지도록 한다. 이때, 창작 문구 생성부는 제외 단어의 제외 범위에 대한 설정이 이루어지는 제외 단어 설정 모듈이 더 구성될 수 있다. 제외 단어 설정 모듈은 제외 단어가 창작 문구 생성부로 수신되는 경우에 활성화될 수 있으며, 상기 제외 단어를 포함하여 형성될 수 있는 단어 조합, 또는 단어의 형식에 대한 값을 계산하고, 계산 결과값을 기반 으로 제외 후보 단어를 생성한 후, 데이터베이스에 저장된 어휘 정보 데이터와 비교하여 이 어휘 정보 데 이터에 존재하는 단어들만 선별하고, 선별한 단어들로 이루어지는 제외 단어 리스트 정보를 생성하여 창작 문구 생성부로 전송한다. 여기서, 제외 단어 설정 모듈은 학습 서버의 데이터 학습부를 통해 이미 학습된 tokenizer를 이 용하여 제외 단어를 포함하여 형성될 수 있는 단어 조합, 또는 단어의 형식에 대한 값을 계산할 수 있으나, 이 에 한정하는 것은 아니다. 예를 들어, 도 7에 도시된 바와 같이, 상기 제외 단어가 \"자신\"인 경우, 제외 단어 설정 모듈은 상기 \"자 신\"을 포함하여 형성될 수 있는 단어의 조합, 또는 형식에 대한 값을 계산하여 계산 결과값을 도출한다. 이때, 제외 단어 설정 모듈은 상기 계산 결과값의 도출시 데이터베이스에 저장된 사전 정의 데이터 중, \"조사\"에 의해 사전 정의된 데이터를 기반으로 띄어쓰기와 결합하여 조합 가능한 단어의 수, 형성 가능한 문장 형식의 수에 대한 값을 계산하여 계산 결과값을 도출하고, 도출한 계산 결과값을 상기 tokenizer를 이용하 여 모든 조합 및 형식으로 이루어지는 제외 단어 리스트 정보를 생성하여 창작 문구 생성부로 전송하는 것 이다. 즉, 제외 단어 설정 모듈은 제외 단어(예: 자신)을 제외하기 위해서 공백문자(띄어쓰기, 개행문자)와 조사 를 결합한 단어들을 생성하고, 이 단어들로 이루어지는 제외 단어 리스트 정보를 생성하는 것이다. 한편, 창작 문구 생성부는 제외 단어 설정 모듈로부터 제외 단어 리스트 정보가 전송되면, 이 제외 단어 리스트 정보를 학습서버에서 학습이 완료된 딥러닝 학습 모델에 적용(또는 입력)하여 1차 창작 문구 의 생성이 이루어지도록 구성되는 것이다. 유사도 측정부는 창작 문구 생성부에서 생성한 1차 창작 문구가 이전에 창작된 창작 문구와 중복, 또 는 유사한지 여부를 확인하고, 확인 결과에 대한 유사도 측정 결과 정보를 생성하여 창작 문구 변환 및 출력부 로 전송한다. 이러한 유사도 측정부는 유사도를 측정하기 위하여 1차 창작 문구를 문장별(Line by line), 또는 문단별 (Paragraph)로 분리하고, 분리된 단어별 1차 창작 문구, 또는 문장별 1차 창작 문구에 대한 유사도를 계산하여 유사도 측정 결과 정보를 생성하고, 생성한 유사도 측정 결과 정보를 창작 문구 변환 및 출력부로 전송하 는 것이다. 이때, 유사도 측정부는 1차 창작 문구를 문장별로 분리하는 경우, 학습에 활용된 데이터를 기반으로 문장 을 분리할 수 있으며, 문장 분리 기준은 구두점을 기반으로 수행하되, 구두점이 존재하지 않는 경우에는, 행 단 위로 문장의 분리가 이루어지도록 구성된다. 또한, 유사도 측정부는 문단별로 1차 창작 문구를 분리하는 경우에는 학습에 활용된 데이터에서 시작과 끝 으로 구분된 내용을 문단 단위로 정의하고 정의된 문단들을 각각의 세트로 지정한다. 이울러, 유사도 측정부는 분리된 문장별 1차 창작 문구, 또는 분리된 문단별 1차 창작 문구를 데이터 학습 부를 통해 이미 학습된 tokenizer를 이용하여 문장, 또는 문단을 토큰단위로 분리하여 문장별, 또는 문단 별 토큰을 생성하고, 분리한 토큰을 벡터화한 후, 데이터베이스에 저장된 기존의 창작 문구들과 비교하여 유사도를 계산한다. 한편, 본 발명의 유사도 측정부는 1차 창작 문구에 포함된 문장, 또는 문단들 중에서 유사도가 가장 높은 순으로 내림차순으로 정렬하여 리스트화하고, 이 유사도 리스트 정보를 포함하는 유사도 측정 결과 정보를 생성 할 수 있다. 창작 문구 변환 및 출력부는 유사도 측정부로부터 수신받은 유사도 측정 결과 정보를 기반으로 최종 창작 문구를 생성하고, 생성한 최종 착장 문구를 사용자 단말 및 데이터베이스로 전송한다. 이러한 창작 문구 변환 및 출력부는 유사도 측정 결과 정보를 분석하여 1차 창작 문구에서 변환이 이루어 질 단어, 문장, 또는 단락이 존재하는지 여부를 확인한 후, 최종 창작 문구의 생성이 이루어지도록 구성된다. 이때, 창작 문구 변환 및 출력부는 1차 창작 문구의 변환 여부에 대한 기준값, 다시말해 유사도 기준값의 설정이 이루어지도록 구성될 수 있다. 여기서, 유사도 기준값은 1차 창작 문구의 단어, 문장, 또는 단락에 대하 여 변환 여부를 결정하는 값으로, 이 유사도 기준값 보다 1차 창작 문구의 유사도가 낮은 경우에는 1차 창작 문 구를 최종 창작 문구로 판단하여 사용자 단말 및 데이터베이스로 전송한다. 하지만, 1차 창작 문구의 유사도가 유사도 기준값 보다 높은 경우에는 이 1차 창작 문구에 있어서, 유사도가 높 은 단어, 문장, 또는 단락을 변환하고, 변환한 창작 문구를 유사도 측정부로 전송하여 해당 창작 문구에 대한 유사도의 측정이 이루어지도록 구성된다. 이와 같이 구성된 창작 문구 변환 및 출력부는 전술한 신규단어, 문장 및 단락을 포함하는 최종 창작 문구 을 생성함에 있어서 상기한 유사도 기준값을 만족하거나, 또는 사용자 단말로부터 전송되는 사용자가 정의 한 반복횟수를 만족할때까지 반복적으로 수행될 수 있다. 한편, 창작 문구 변환 및 출력부는 1차 창작 문구에 포함되어 있는 명사를 토크나이저 모델을 활용하여 추 출하고, 변경 설정값에 따라 데이터베이스에 저장되어 있는 명사 사전 정의 데이터에서 랜덤으로 선택한다. 이때, 변경 설정값은 변경할 명사의 개수(number), 또는 비율(rate)에 대한 값으로 이루어질 수 있으며, 개수로 설정이 이루어진 경우에는 설정된 수치값 만큼 추출한 명사를 변경하고, 비율로 설정이 이루어진 경우에는 추출 한 총 명사의 개수에 있어서 적어도 10% ~100%의 비율로 변경이 이루어지도록 구성될 수 있다. 이러한 변경 설정값은 사용자에 의해 변경이 가능하며, 사용자 단말을 통해 변경에 대한 데이터를 창작 문 구 변환 및 출력부에서 수신받아 변경이 이루어질 수 있도록 구성된다. 또한, 창작 문구 변환 및 출력부는 변경할 명사의 선택이 완료되면, 선택한 명사와 연결될 단어를 조합하 여 신규한 단어를 생성하고, 생성한 신규 단어를 이용하여 신규 문장 및 신규 단락을 생성한 후, 생성한 신규 단어, 문장 및 단락을 유사도 측정부로 전송하는 것이다. 이러한 창작 문구 변환 및 출력부는 선택한 명사와의 연결될 단어들을 선택하여 조합할 때, 데이터베이스 에 저장된 형용사, 부사, 조사 사전 정의 데이터와 조합이 이루어지도록 구성됨이 바람직할 것이다. 아울러, 창작 문구 변환 및 출력부는 선택한 명사를 데이터베이스에 저장된 명사 사전 정의 데이터의 분류에 따라 분류하고, 분류가 이루어진 명사와 부합되는 형용사 또는 부사를 결합하여 신규한 단어를 생성할 수 있을 것이다. 데이터베이스는 창작 문구 생성부 및 창작 문구 변환 및 출력부에서 생성한 창작단어, 창작문장, 창작단락, 창작 텍스트를 포함하는 창작 문구(또는, 창작 데이터)가 저장된다. 또한, 데이터베이스는 어휘 정보 리스트로 이루어지는 어휘 정보 데이터와 사전 정의 단어 데이터가 저장 된다. 여기서, 사전 정의 단어 데이터는 명사, 형용사, 부사, 조사에 대한 사전 정의 데이터일 수 있으며, 사용자 정 의 기반의 사전 정의 단어로 이루어질 수도 있다. 여기서, 조사 사전 정의 데이터는 데이터베이스에 저장되는 것으로, 은, 는, 이, 가 등을 포함한 427개의 단어로 구성될 수 있으나, 이에 한정하는 것은 아니다. 이하에서는, 본 발명의 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법에 대하여 도 4 내 지 도 6을 참조하여 설명하도록 한다. 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법은 학습서버를 통해 딥러닝 모델 학습 을 수행하고, 창작 문구를 생성할 최적화된 학습 모델을 저장하는 단계를 수행한다. 여기서, 딥러닝 모델 학습 단계는, 도 4에 도시된 바와 같이, 학습 서버의 데이터 수집부를 통해 웹 서버로부터 제공되는 텍스트 정보를 포함하는 데이터를 수집하는 데이터 수집단계를 수행한다.(S410) 데이터 수집단계(S410)는, 웹 서버와 네트워크로 연결되어 이 웹 서버에서 호스팅하는 웹 페이지로부터 텍스트 정보와, 창작 문구 생성 서버의 데이터베이스에 저장되어 있는 기존의 창작 문구(또는 창작 데이터) 를 수집하는 단계이다. 이러한 데이터 수집단계(S410)는, 수집할 텍스트 정보에서의 키워드, 기사 게재기간, 페이지 및 수집 범위 설정 등과 같은 데이터 수집을 위한 설정값과, 출력조건, 키워드의 최소 빈도수 설정 등과 같은 옵션값으로 이루어지 는 수집 설정값을 기준으로 텍스트 정보를 포함하는 데이터를 수집할 수 있다. 이후, 딥러닝 모델 학습 단계는, 수집된 데이터를 데이터 정제부에서 수신받아 설정된 정제 조건에 따라 데이터를 정제하는 데이터 정제단계를 수행한다.(S420) 데이터 정제단계(S420)는, 문단구분, 특수문자 제거 및 삽입 여부, 불용어 제거, 띄어쓰기 여부로 이루어지는 정제 조건을 설정하고, 수집된 데이터를 콘텐츠 도메인 별로 분류한 후, 설정한 정제 조건을 기반으로 분류된 콘텐츠 도메인 별로 정제할 수 있다. 이러한 데이터 정제단계(S420)는, 정제된 정제 데이터를 데이터 저장부로 전송하여 저장하는 단계를 더 수 행할 수 있다. 다음으로, 딥러닝 학습 단계는, S420 단계에 의해 정제된 정제 데이터의 다음에 입력될 단어의 예측이 이루어지 도록 데이터 학습부에서 딥러닝 모델을 통해 반복 학습하는 데이터 학습단계를 수행한다.(S430) 이후, 데이터 학습부를 통해 학습이 이루어진 학습 결과 정보 및 학습 모델에 대한 정보를 저장하고, 창작 문구 생성 서버의 창작 문구 생성부에서 1차 창작 문구의 생성이 이루어지는 경우, 이 장착 문구 생 성부와 네트워크로 연결되어 저장된 정보들을 공유하는 데이터 저장단계를 수행한다.(S440) 한편, 인공지능 기반 창작 문구 생성 시스템을 이용한 창작 문구 생성 방법은 사용자 단말로부터 창작 문 구와 관련된 키워드를 창작 문구 생성 서버에서 수신받는 경우, 수신받은 키워드를 기반으로 창작 문구를 생성하는 창작 문구 생성 단계를 수행한다. 창작 문구 생성 단계는, 창작 문구 생성시 학습 서버와 네트워크로 연결되어 데이터 저장부에 저장되 어 있는 학습 모델과 창작 문구 생성 서버의 창작 문구 생성부를 연동하는 단계를 더 수행할 수 있다. 이러한 창작 문구 생성 단계는, 창작 문구 생성 서버의 창작 문구 생성부에서 키워드를 수신받아 분 석하는 단계를 수행한다.(S510) 키워드 분석 단계(S510)는, 사용자 단말로부터 전송된 키워드에 창작 문구의 콘텐츠 도메인에 대한 정보가 포함되어 있는지 여부를 확인하고, 키워드에 콘텐츠 도메인 정보가 포함되어 있지 않은 경우, 사용자 단말(10 0)로 콘텐츠 도메인 정보를 요청하여 수신받는 단계이다. 이후, 창작 문구 생성부에서 사용자 단말로부터 수신받은 키워드에 제외할 단어가 존재하는지 여부를 확인하는 단계를 수행하고,(S520) 사용자 단말로부터 수신받은 키워드에 제외할 단어가 존재하지 않는 경우에는 학습서버에서 학습이 완료된 딥러닝 학습 모델을 기반으로 키워드 및 콘텐츠 도메인과 관련성을 가 지는 1차 창작 문구를 생성한다.(S530) 하지만, 제외 단어가 존재하는 경우에는 제외 단어 리스트 정보를 제외 단어 설정 모듈로부터 수신받는 단 계를 수행하고,(S540) 이 제외 단어 리스트 정보와 학습서버에서 학습이 완료된 딥러닝 학습 모델을 기반 으로 상기 제외 단어 리스트 정보에 포함되어 있는 단어들을 제외한 1차 창작 문구를 생성한다. 여기서, 제외 단어 리스트 정보를 수신받는 단계(S540)는 도 6에 도시된 바와 같이, 제외 단어 설정 모듈 에 의해 제외 단어를 포함하여 형성될 수 있는 단어 조합, 또는 단어의 형식에 대한 값을 계산하고, 계산 결과 값을 도출하는 제외 단어 분석 단계를 수행한다.(S610) 이후, 계산 결과값을 기반으로 제외 후보 단어를 생성한 후, 데이터베이스에 저장된 어휘 정보 데이터와 비교하여 이 어휘 정보 데이터에 존재하는 단어들만 선별하는 제외 단어 선별 단계를 수행한다.(S620) 이후, 선별한 단어들로 이루어지는 제외 단어 리스트 정보를 생성하여 창작 문구 생성부로 전송하는 제외 단어 리스트 정보 생성 단계를 수행한다.(S630) 다음으로, 창작 문구 생성부를 통해 생성된 1차 창작 문구를 유사도 측정부에서 수신받아 1차 창작 문구가 이전에 창작된 창작 문구와 중복, 또는 유사한지 여부를 확인하고, 확인 결과에 대한 유사도 측정 결과 정보를 생성하여 창작 문구 변환 및 출력부로 전송하는 단계를 수행한다.(S550) 여기서, S550 단계는 유사도를 측정하기 위하여 1차 창작 문구를 문장별(Line by line), 또는 문단별 (Paragraph)로 분리하고, 분리된 단어별 1차 창작 문구, 또는 문장별 1차 창작 문구에 대한 유사도를 계산하여 유사도 측정 결과 정보를 생성하는 단계를 수행할 수 있다. 또한, S550 단계는 분리된 문장별 1차 창작 문구, 또는 분리된 문단별 1차 창작 문구에 대한 유사도의 계산시, 데이터 학습부를 통해 이미 학습된 tokenizer를 이용하여 문장, 또는 문단을 토큰단위로 분리하여 문장별, 또는 문단별 토큰을 생성하고, 분리한 토큰을 벡터화한 후, 데이터베이스에 저장된 기존의 창작 문구들과 비교하여 유사도를 계산하는 단계를 수행할 수 있다. 또한, S550 단계는 유사도 리스트 정보의 생성시 1차 창작 문구에 포함된 문장, 또는 문단들 중에서 유사도가 가장 높은 순으로 내림차순으로 정렬하여 리스트화하고, 이 유사도 리스트 정보를 포함하는 유사도 측정 결과 정보를 생성하는 단계를 수행할 수 있다. 다음으로, 창작 문구 변환 및 출력부를 통해 유사도 측정 결과 정보가 유사도 기준값을 만족하는지 여부를 확인하여 창작 문구 생성부에 의해 생성된 1차 창작 문구에서 변환이 이루어질 단어, 문장, 또는 단락이 존재하는지 여부를 확인하는 단계를 수행한다.(S560) 이때, 유사도 측정 결과 정보가 유사도 기준값을 만족하는 경우, 즉 유사도 기준값 보다 낮은 경우에는 유사도 측정부로부터 수신받은 유사도 측정 결과 정보를 기반으로 최종 창작 문구를 생성하고, 생성한 최종 착장 문구를 사용자 단말 및 데이터베이스로 전송하는 단계를 수행한다.(S570) 하지만, 유사도 측정 결과 정보가 유사도 기준값을 만족하지 못하는 경우, 즉 유사도 기준값 보다 높은 경우에 는, 1차 창작 문구에 있어서, 유사도가 높은 단어, 문장, 또는 단락을 변환하고, 변환한 창작 문구를 유사도 측 정부로 전송하여 해당 창작 문구에 대한 유사도를 재측정하고, 유사도 기준값 보다 낮은 경우 재생성된 유 사도 측정 결과 정보를 기반으로 최종 창작 문구를 생성하는 단계를 수행한다.(S580) 이때, S580 단계는, 1차 창작 문구에 포함되어 있는 명사를 토크나이저 모델을 활용하여 추출하고, 변경 설정값 에 따라 데이터베이스에 저장되어 있는 명사 사전 정의 데이터에서 랜덤으로 선택하는 단계를 수행한다. S580 단계는, 창작 문구 변환 및 출력부를 통해 변경할 명사의 선택이 완료되면, 선택한 명사와 연결될 단 어를 조합하여 신규한 단어를 생성하고, 생성한 신규 단어를 이용하여 신규 문장 및 신규 단락을 생성한 후, 생 성한 신규 단어, 문장 및 단락을 유사도 측정부로 전송하는 단계를 수행한다. 또한, S580 단계는, 신규단어, 문장 및 단락을 포함하는 최종 창작 문구의 생성시 유사도 기준값을 만족하거나, 또는 사용자 단말로부터 전송되는 사용자가 정의한 반복횟수를 만족할때까지 반복적으로 수행할 수 있다. 이때, 상기 S580 단계는, 상기 유사도 기준값, 또는 사용자가 정의한 반복횟수에 대한 만족 여부에 따라 상기 S550 단계 내지 S570 단계를 반복적으로 수행하도록 할 수 있다. 한편, 본 발명에 기재된 네트워크는 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크의 일 예에는 RF, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5GPP(5rd Generation Partnership Project) 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 블루투스(Bluetooth) 네트워크, NFC 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0181797", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기반 창작 문구 생성 시스템을 개략적으로 나타낸 구성 블록도, 도 2는 본 발명의 일 실시예에 따른 학습서버를 개략적으로 나타낸 구성 블록도, 도 3은 본 발명의 일 실시예에 따른 창작 문구 생성 서버를 개략적으로 나타낸 구성 블록도, 도 4는 본 발명의 일 실시예에 따른 창작 문구 생성 방법에 있어서 수집 데이터를 이용한 학습 과정을 나타낸 순서도, 도 5 및 도 6은 본 발명의 일 실시예에 따른 창작 문구 생성 방법에 있어서 창작 문구를 생성하는 과정을 나타 낸 순서도, 도 7은 본 발명의 일 실시예에 따른 제외 단어 설정 모듈을 통해 제외 단어 리스트 정보의 생성 결과를 나타낸 예시도, 도 8 및 도 9는 본 발명의 일 실시예에 따른 인공지능 기반 창작 문구 생성 시스템의 사용자 단말을 통해 디스 플레이되는 키워드 UI부를 개략적으로 나타낸 예시도, 도 10 및 도 11은 본 발명의 일 실시예에 따른 인공지능 기반 창작 문구 생성 시스템에 의해 유사도 측정 결과 정보를 기반으로 창작 문구를 변환하는 과정을 나타낸 도면이다."}
