{"patent_id": "10-2023-0015115", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0122217", "출원번호": "10-2023-0015115", "발명의 명칭": "관리 사각지대에 위치하는 문화유산에 대한 집단 지성 기반의 문화재 보존, 관리 및 활용 시", "출원인": "(주)라드피온", "발명자": "김명진"}}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "심산유곡, 격오지 또는 도서산간을 포함하는 관리 사각지대에 위치하는 관리사각지대 문화재의 보존, 관리 및활용 시스템으로서, 설치된 앱을 통해서, 상기 관리사각지대 문화재에 대해서 다양한 각도 상으로 촬영된 정지화상 또는 동영상을상기 시스템에 업로드하는 복수의 개인 단말장치; 각 관리사각지대 문화재마다 고유하게 할당된 문화재 고유번호마다, 상기 복수의 개인 단말장치로부터 수신한서로 다른 시점(時點)의 상기 관리사각지대 문화재의 정지화상 또는 동영상을 시계열적으로 매칭하고 정리하여데이터베이스로 축적하는 관리사각지대 문화재 시계열 데이터부; 및 상기 관리사각지대 문화재 시계열 데이터부에 축적된 관리사각지대 문화재의 정지화상 또는 동영상을 이미지 처리하여, 각 관리사각지대 문화재마다 시계열적인 형상의 변화, 위치의 변화, 색상의 변화, 질감의 변화, 구조적변형, 금속 재질의 관리사각지대 문화재의 경우 녹이 스는 경과 정보를 포함한 관리사각지대 문화재의 노후 또는 손상와 관련한 관리사각지대 문화재의 시계열 분석결과를 제공하는 관리사각지대 문화재 시계열 분석결과 제공부;를 포함하는, 문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 개인 단말장치에 설치된 앱에는, 각 관리사각지대 문화재마다 업로드할 경우 제공되는 리워드를 각각 표시하는 리워드 표시부; 및 특정 관리사각지대 문화재에 대한 정지화상 또는 동영상을 상기 시스템에 업로드할 경우 리워드를 제공하는 리워드 제공부;를포함하는, 문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 제공되는 리워드는, 각 관리사각지대 문화재의 단위 기간 당 업로드 수를 나타내는 업로드 빈도, 업로드되는 것이 정지화상인지 동영상인지 여부, 정지화상의 경우 정지화상의 수, 동영상의 경우 동영상의 시간적 길이,및 업로드되는 정지화상 또는 동영상의 촬영 각도의 다양성 중 적어도 하나 이상에 기초하여, 가변되도록 설정하는 것을 특징으로 하는, 문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 개인 단말장치에 설치된 앱이 등산용 앱, 여행용 앱 또는 관광용 앱이거나 등산용 앱, 여행용 앱 또는 관광용 앱과 연동하는 앱으로서, 상기 개인 단말장치를 소지한 사용자의 등산 경로, 여행 경로 또는 관광 경로와 함께, 관리사각지대 문화재의공개특허 10-2024-0122217-3-위치 표시, 상기 관리사각지대 문화재를 거쳐가지 않을 경우 등산 경로, 여행 경로 또는 관광 경로, 상기 관리사각지대 문화재를 거쳐갈 경우의 등산 경로, 여행 경로 또는 관광 경로의 대체 경로, 해당 관리사각지대 문화재에 대한 정지화상 또는 동영상 업로드 시의 리워드, 가장 최근에 업로드된 소정의 정지화상 또는 동영상, 해당 관리사각지대 문화재의 설명이나 역사적 의미를 포함하는 관리사각지대 문화재의 정보를 같이 표시하는 것을특징으로 하는, 문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 관리사각지대 문화재 시계열 분석결과 제공부는, 특정 관리사각지대 문화재에 대한 시계열적인 문화재 노후 또는 손상과 관련한 관리사각지대 문화재 시계열 분석결과 및 유지 보수를 포함한 관리사각지대 문화재의 보존 및 관리에 대한 보고서를 자동 생성하거나, 또는 자동 생성한 관리사각지대 문화재의 보존 및 관리에 대한 보고서를 정부의 관련 담당자의 이메일로 전송하거나,또는 정부의 서버로 전송하거나 또는 지방자치단체의 관련 담당자의 이메일로 자동 전송하거나 또는 지방자치단체의 서버로 전송하는 것을 특징으로 하는, 문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템의 상기 민간 문화재를 가치 평가하는 민간 문화재 가치 평가부의 요청에 따라서, 상기 관리사각지대 문화재 시계열 데이터부 및 상기 관리사각지대 문화재 시계열 분석결과 제공부에 기초하여,상기 가치 평가하는 상기 민간 문화재와 가장 유사한 형상을 가지는 상기 관리사각지대 문화재의 정보 및 데이터를 제공하고, 상기 사이버 수장고 시스템은, 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재를 위탁받아서 관리 및 보존하는 물리적 수장고;상기 물리적 수장고에 위탁된 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진을 이용하여 시스템 사용자가상기 민간 문화재를 열람하고, 대여 신청하는 것이 가능한 사이버 수장고; 및상기 물리적 수장고 및 상기 사이버 수장고를 연동하여 제어하고 관리하는 제어부;를 포함하고,상기 제어부는, 상기 민간 문화재가 상기 물리적 수장고에 위탁되거나, 또는 상기 물리적 수장고로부터 상기 민간 문화재가 대여되는 경우, 자동적으로 상기 사이버 수장고가 연동하여 업데이트 되어 최신화되도록 하고, 그리고 상기 시스템 사용자로부터 상기 사이버 수장고에 상기 민간 문화재의 대여 신청을 받는 경우, 상기 물리적수장고에서 연동하여 상기 민간 문화재가 대여되도록 처리하는, 문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 관리사각지대 문화재는, 국가지정문화재 또는 시도지정문화재로 지정되지 않은 비지정문화재인 것을 특징으로 하는, 공개특허 10-2024-0122217-4-문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서, 상기 관리사각지대 문화재 시계열 분석결과 제공부는, 상기 관리사각지대 문화재 시계열 데이터부가 보유한 정지화상 또는 동영상의 이미지 처리를 기초로 하여, 상기관리사각지대 문화재의 노후 또는 손상을 상기 관리사각지대 문화재의 보존상태를 평가하여 양호한 상태의 A등급부터 손상이 심화된 F등급까지 6개 등급으로 구분하여 상기 관리사각지대 문화재를 평가하고, 상기 관리사각지대 문화재 시계열 데이터부가 보유한 정지화상 또는 동영상의 시계열적 시점 별 상기 관리사각지대 문화재의손상부위 이미지를 시간 순서대로 손상 등급과 함께 같이 제공하는 것을 특징으로 하는, 문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 A등급은 상기 관리사각지대 문화재의 노후 또는 손상 정도가 양호한 것이고, 상기 B등급은 상기 관리사각지대 문화재의 노후 또는 손상 정도가 경미한 수리가 필요한 것이고, 상기 C등급은 상기 관리사각지대 문화재의노후 또는 손상 정도가 주의관찰이 필요한 것이고, 상기 D등급은 상기 관리사각지대 문화재의 노후 또는 손상정도가 정밀관찰이 필요한 것이고, 상기 E등급은 상기 관리사각지대 문화재의 노후 또는 손상 정도가 수리가 필요한 것이고, 상기 F등급은 상기 관리사각지대 문화재의 노후 또는 손상 정도가 즉시조치가 필요한 것이고, 상기 관리사각지대 문화재 시계열 분석결과 제공부에서는, 상기 관리사각지대 문화재가 상기 A등급 및 상기 B등급인 경우 상기 관리사각지대 문화재는 3년 내지 5년 주기로 정기 조사만 수행하면 되는 등급으로 판단하고, 상기 관리사각지대 문화재가 상기 C등급, 상기 D등급 및 상기 E등급인 경우 상기 관리사각지대 문화재는 미리 설정한 소정의 주기 별로 지속적인 모니터링이 되어야 하는등급으로 판단하고, 상기 관리사각지대 문화재가 상기 F등급인 경우 상기 관리사각지대 문화재는 바로 수리가필요한 등급으로 판단하는 것을 특징으로 하는, 문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서, 상기 관리사각지대 문화재가 동일한 위치에서 동일한 구도로 반복적으로 촬영될 수 있도록, 상기 앱을 통해서비교군 정지화상이나 비교군 동영상을 같이 제공하되, 정지화상 또는 동영상 촬영하는 메뉴에서 사용자가 오버랩되어 볼 수 있게 반투명하게 비교군 정지화상이나 비교군 동영상을 제공하고, 상기 관리사각지대 문화재 시계열 분석결과 제공부의 정보를 기초로 하여, 상기 관리사각지대 문화재의 노후 또는 손상 위치를, 정지화상이나 비교군 동영상을 촬영하는 메뉴에서 사용자가 시각적으로 인지할 수 있도록, 다른 색상을 포함하여 다르게 이미지 처리하여 반투명하게 상기 비교군 정지화상이나 비교군 동영상을 오버랩하여제공하는 것을 특징으로 하는, 문화재 보존, 관리 및 활용 시스템."}
{"patent_id": "10-2023-0015115", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 문화재 보존, 관리 및 활용 시스템은, 심산유곡, 격오지 또는 도서산간을 포함하는 관리 사각지대에 위치하는 관리사각지대 문화재의 보존, 관리 및 활용 시스템으로서, 설치된 앱을 통해서, 상기 관리사각지대 문 화재에 대해서 다양한 각도 상으로 촬영된 정지화상 또는 동영상을 상기 시스템에 업로드하는 복수의 개인 단말 (뒷면에 계속)"}
{"patent_id": "10-2023-0015115", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 문화재 보존, 관리 및 활용 시스템에 관한 것으로, 보다 상세하게는, 선발된 전문 담당자만이 지정문 화재가 위치한 현장에 직접 방문하여 영상자료를 수집하는 방식으로 운영되어 영상자료 사이의 시간적 간격이 매우 길어지는 종래의 문화재 모니터링의 문제점을 해결하고, 집단지성의 힘으로 앱 이용자 또는 사용자 누구나 문화재, 특히 관리사각지대 문화재의 정지화상 또는 동영상을 촬영하여 전송하고 리워드를 제공받는 크라우드 소싱 형태이며, 관리사각지대 문화재의 정지화상 또는 동영상의 시간적 간격이 증가하면 사용자에게 제공하는 리워드의 크기를 증가시켜 사용자의 능동적인 문화재 방문 유도를 촉진하고, 관리사각지대 문화재의 손상 발달 과 구조적 변형을 식별하기 위한 식별자를 활용하여 문화유산 손상의 진행성을 함께 검토할 수 있는 플랫폼을 제공하는, 관리 사각지대에 위치하는 문화유산에 대한 집단 지성 기반의 문화재 보존, 관리 및 활용 시스템에 관한 것이다."}
{"patent_id": "10-2023-0015115", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "문화유산은 민족의 역사와 정신이 담겨있는 유형 또는 무형의 모든 것으로 후대에 물려주어야 할 전대의 소산을 말한다. 접근성이 좋거나 문화유산의 뛰어난 역사성으로 관람객이 다수 방문하는 문화유산은 손상의 발생이 비교적 쉽게 발견되며 관람객이 촬영한 영상자료가 많아 데이터 크롤링을 통한 이미지 확보가 쉽다. 화재, 지진, 산사태, 집 중호우 등 사건 또는 사고의 발생은 문화재 관리자가 인지하여 문화유산에 대한 점검을 수행하기에 용이하다. 이에 반하여, 정적인 하중에 순간적인 손상이나 장기간에 걸쳐 발생하는 변형 등은 인식하기 어려운 문제를 갖 고 있다. 또한, 비지정문화재나 문중, 단체, 개인이 소유한 문화유산, 격오지 또는 도서산간에 위치한 문화유산 등 문화유산 관리 사각지대에 위치한 문화재의 경우에는 이러한 문제점이 더욱 심화된다. 관련한 종래의 특허문헌으로는, 대한민국 특허 제10-2473042호(2022년 12월 2일 공고, 발명의 명칭 : 드론과 지 상사진을 이용한 문화재의 영상 취득 방법 및 시스템(method and system for obtaining image of cultural properties using drone and photo))에서는, 드론의 비행에서 고도 분석, 진동 분석, 및 항공상태 분석의 종합 적인 분석 처리를 통해 문화재의 현실감 있는 3차원 스캔 데이터를 취득하고자 하는 드론과 지상사진을 이용한 문화재의 영상 취득 방법 및 시스템을 개시하고 있다. 하지만, 대한민국 특허 제10-2473042호에서 사용하는 드론의 경우, 격오지 또는 도서산간 등 문화재가 위치하는 지역으로 드론이 접근하는데 물리적 한계가 존재하며, 국토부 및 국방부의 비행허가 등의 문제로 문화재 보존 및 관리에 적용하는 것이 쉽지 않았다. 이와 같은 종래 기술의 문제점에 착안하여 아래에서 서술하는 발명을 하 게 되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허 제10-2473042호(2022년 12월 2일 공고, 발명의 명칭 : 드론과 지상사진을 이용 한 문화재의 영상 취득 방법 및 시스템(method and system for obtaining image of cultural properties using drone and photo))"}
{"patent_id": "10-2023-0015115", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위하여 창출된 것으로, 본 발명의 목적은, 선발된 전문 담당자만이 지정문 화재가 위치한 현장에 직접 방문하여 영상자료를 수집하는 방식으로 운영되어 영상자료 사이의 시간적 간격이 매우 길어지는 종래의 문화재 모니터링의 문제점을 해결하고, 집단지성의 힘으로 앱 이용자 또는 사용자 누구나 문화재, 특히 관리사각지대 문화재의 정지화상 또는 동영상을 촬영하여 전송하고 리워드를 제공받는 크라우드 소싱 형태이며, 관리사각지대 문화재의 정지화상 또는 동영상의 시간적 간격이 증가하면 사용자에게 제공하는 리워드의 크기를 증가시켜 사용자의 능동적인 문화재 방문 유도를 촉진하고, 관리사각지대 문화재의 손상 발달과 구조적 변형을 식별하기 위한 식별자를 활용하여 문화유산 손상의 진행성을 함께 검토할 수 있는 플랫폼을 제공하는, 관리 사각지대에 위치하는 문화유산에 대한 집단 지성 기반의 문화재 보존, 관리 및 활용 시스템을 제공하는 것에 있다."}
{"patent_id": "10-2023-0015115", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위한 본 발명의 바람직한 일 실시예에 따른 문화재 보존, 관리 및 활용 시스템은, 심산 유곡, 격오지 또는 도서산간을 포함하는 관리 사각지대에 위치하는 관리사각지대 문화재의 보존, 관리 및 활용 시스템으로서, 설치된 앱을 통해서, 상기 관리사각지대 문화재에 대해서 다양한 각도 상으로 촬영된 정지화상 또는 동영상을 상기 시스템에 업로드하는 복수의 개인 단말장치; 각 관리사각지대 문화재마다 고유하게 할당된 문화재 고유번호마다, 상기 복수의 개인 단말장치로부터 수신한 서로 다른 시점(時點)의 상기 관리사각지대 문 화재의 정지화상 또는 동영상을 시계열적으로 매칭하고 정리하여 데이터베이스로 축적하는 관리사각지대 문화재 시계열 데이터부; 및 상기 관리사각지대 문화재 시계열 데이터부에 축적된 관리사각지대 문화재의 정지화상 또 는 동영상을 이미지 처리하여, 각 관리사각지대 문화재마다 시계열적인 형상의 변화, 위치의 변화, 색상의 변화, 질감의 변화, 구조적 변형, 금속 재질의 관리사각지대 문화재의 경우 녹이 스는 경과 정보를 포함한 관리 사각지대 문화재의 노후 또는 손상와 관련한 관리사각지대 문화재의 시계열 분석결과를 제공하는 관리사각지대 문화재 시계열 분석결과 제공부;를 포함한다. 여기서, 상기 개인 단말장치에 설치된 앱에는, 각 관리사각지대 문화재마다 업로드할 경우 제공되는 리워드를 각각 표시하는 리워드 표시부; 및 특정 관리사각지대 문화재에 대한 정지화상 또는 동영상을 상기 시스템에 업 로드할 경우 리워드를 제공하는 리워드 제공부;를 포함할 수 있다. 또한, 상기 제공되는 리워드는, 각 관리사각지대 문화재의 단위 기간 당 업로드 수를 나타내는 업로드 빈도, 업 로드되는 것이 정지화상인지 동영상인지 여부, 정지화상의 경우 정지화상의 수, 동영상의 경우 동영상의 시간적 길이, 및 업로드되는 정지화상 또는 동영상의 촬영 각도의 다양성 중 적어도 하나 이상에 기초하여, 가변되도록 설정하는 것이 바람직하다. 또한, 상기 개인 단말장치에 설치된 앱이 등산용 앱, 여행용 앱 또는 관광용 앱이거나 등산용 앱, 여행용 앱 또 는 관광용 앱과 연동하는 앱으로서, 상기 개인 단말장치를 소지한 사용자의 등산 경로, 여행 경로 또는 관광 경 로와 함께, 관리사각지대 문화재의 위치 표시, 상기 관리사각지대 문화재를 거쳐가지 않을 경우 등산 경로, 여 행 경로 또는 관광 경로, 상기 관리사각지대 문화재를 거쳐갈 경우의 등산 경로, 여행 경로 또는 관광 경로의 대체 경로, 해당 관리사각지대 문화재에 대한 정지화상 또는 동영상 업로드 시의 리워드, 가장 최근에 업로드된 소정의 정지화상 또는 동영상, 해당 관리사각지대 문화재의 설명이나 역사적 의미를 포함하는 관리사각지대 문 화재의 정보를 같이 표시하는 것이 바람직하다. 또한, 상기 관리사각지대 문화재 시계열 분석결과 제공부는, 특정 관리사각지대 문화재에 대한 시계열적인 문화 재 노후 또는 손상과 관련한 관리사각지대 문화재 시계열 분석결과 및 유지 보수를 포함한 관리사각지대 문화재 의 보존 및 관리에 대한 보고서를 자동 생성하거나, 또는 자동 생성한 관리사각지대 문화재의 보존 및 관리에 대한 보고서를 정부의 관련 담당자의 이메일로 전송하거나, 또는 정부의 서버로 전송하거나 또는 지방자치단체 의 관련 담당자의 이메일로 자동 전송하거나 또는 지방자치단체의 서버로 전송할 수 있다. 또한, 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재의 보존과 유통을 위한 사이버 수장 고 시스템의 상기 민간 문화재를 가치 평가하는 민간 문화재 가치 평가부의 요청에 따라서, 상기 관리사각지대 문화재 시계열 데이터부 및 상기 관리사각지대 문화재 시계열 분석결과 제공부에 기초하여, 상기 가치 평가하는 상기 민간 문화재와 가장 유사한 형상을 가지는 상기 관리사각지대 문화재의 정보 및 데이터를 제공하고, 상기 사이버 수장고 시스템은, 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재를 위탁받아서 관 리 및 보존하는 물리적 수장고; 상기 물리적 수장고에 위탁된 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진을 이용하여 시스템 사용자가 상기 민간 문화재를 열람하고, 대여 신청하는 것이 가능한 사이버 수장고; 및 상기 물리적 수장고 및 상기 사이버 수장고를 연동하여 제어하고 관리하는 제어부;를 포함하고, 상기 제어부는, 상기 민간 문화재가 상기 물리적 수장고에 위탁되거나, 또는 상기 물리적 수장고로부터 상기 민간 문화재가 대 여되는 경우, 자동적으로 상기 사이버 수장고가 연동하여 업데이트 되어 최신화되도록 하고, 그리고 상기 시스 템 사용자로부터 상기 사이버 수장고에 상기 민간 문화재의 대여 신청을 받는 경우, 상기 물리적 수장고에서 연 동하여 상기 민간 문화재가 대여되도록 처리할 수 있다. 또한, 상기 관리사각지대 문화재는, 국가지정문화재 또는 시도지정문화재로 지정되지 않은 비지정문화재일 수 있다. 또한, 상기 관리사각지대 문화재 시계열 분석결과 제공부는, 상기 관리사각지대 문화재 시계열 데이터부가 보유 한 정지화상 또는 동영상의 이미지 처리를 기초로 하여, 상기 관리사각지대 문화재의 노후 또는 손상을 상기 관 리사각지대 문화재의 보존상태를 평가하여 양호한 상태의 A등급부터 손상이 심화된 F등급까지 6개 등급으로 구 분하여 상기 관리사각지대 문화재를 평가하고, 상기 관리사각지대 문화재 시계열 데이터부가 보유한 정지화상 또는 동영상의 시계열적 시점 별 상기 관리사각지대 문화재의 손상부위 이미지를 시간 순서대로 손상 등급과 함 께 같이 제공하는 것이 바람직하다. 여기서, 상기 A등급은 상기 관리사각지대 문화재의 노후 또는 손상 정도가 양호한 것이고, 상기 B등급은 상기 관리사각지대 문화재의 노후 또는 손상 정도가 경미한 수리가 필요한 것이고, 상기 C등급은 상기 관리사각지대 문화재의 노후 또는 손상 정도가 주의관찰이 필요한 것이고, 상기 D등급은 상기 관리사각지대 문화재의 노후 또 는 손상 정도가 정밀관찰이 필요한 것이고, 상기 E등급은 상기 관리사각지대 문화재의 노후 또는 손상 정도가 수리가 필요한 것이고, 상기 F등급은 상기 관리사각지대 문화재의 노후 또는 손상 정도가 즉시조치가 필요한 것 이고, 상기 관리사각지대 문화재 시계열 분석결과 제공부에서는, 상기 관리사각지대 문화재가 상기 A등급 및 상 기 B등급인 경우 상기 관리사각지대 문화재는 3년 내지 5년 주기로 정기 조사만 수행하면 되는 등급으로 판단하 고, 상기 관리사각지대 문화재가 상기 C등급, 상기 D등급 및 상기 E등급인 경우 상기 관리사각지대 문화재는 미 리 설정한 소정의 주기 별로 지속적인 모니터링이 되어야 하는 등급으로 판단하고, 상기 관리사각지대 문화재가 상기 F등급인 경우 상기 관리사각지대 문화재는 바로 수리가 필요한 등급으로 판단한다. 또한, 상기 관리사각지대 문화재가 동일한 위치에서 동일한 구도로 반복적으로 촬영될 수 있도록, 상기 앱을 통 해서 비교군 정지화상이나 비교군 동영상을 같이 제공하되, 정지화상 또는 동영상 촬영하는 메뉴에서 사용자가 오버랩되어 볼 수 있게 반투명하게 비교군 정지화상이나 비교군 동영상을 제공하고, 상기 관리사각지대 문화재 시계열 분석결과 제공부의 정보를 기초로 하여, 상기 관리사각지대 문화재의 노후 또는 손상 위치를, 정지화상 이나 비교군 동영상을 촬영하는 메뉴에서 사용자가 시각적으로 인지할 수 있도록, 다른 색상을 포함하여 다르게 이미지 처리하여 반투명하게 상기 비교군 정지화상이나 비교군 동영상을 오버랩하여 제공하는 것이 바람직하다."}
{"patent_id": "10-2023-0015115", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 문화재 보존, 관리 및 활용 시스템에 의하면, 첫째, 선발된 전문 담당자만이 문화재가 위치하는 현장에 직접 방문하여 영상자료를 수집하는 방식으로 운영되 어 영상자료 사이의 시간적 간격이 매우 길어지는 종래의 문화재 모니터링의 문제점을 해결할 수 있다. 둘째, 집단지성의 힘으로 앱 이용자 또는 사용자 누구나 문화재의 정지화상 또는 동영상을 촬영하여 전송하고 리워드를 제공받는 크라우드 소싱 형태이며, 관리사각지대 문화재의 정지화상 또는 동영상의 시간적 간격이 증 가하면 제공하는 리워드의 크기를 증가시켜 사용자의 능동적인 문화재 방문 유도를 촉진할 수 있다. 즉, 본 발명에 따른 문화재 보존, 관리 및 활용 시스템에서는 사용자가 문화재에 대한 정보나 데이터의 소비자 임과 함께 생산자의 역할을 수행하는 멀티 사이드 플랫폼이 된다. 시스템의 운영자나 플랫폼 사업자는 모니터링 자료를 필요로 하는 공공기관과 문화유산의 정보와 리워드를 필요로 하는 국민에게 서로 다른 가치를 제공하는 연결 창구의 역할을 수행할 수 있다. 궁극적으로 사용자와 양방향 소통이 가능한 창구가 될 것으로 기대된다. 셋째, 관리사각지대 문화재의 손상 발달과 구조적 변형을 식별하기 위한 식별자를 활용하여 문화유산 손상의 진 행성을 함께 검토할 수 있는 플랫폼을 제공할 수 있다. 넷째, 본 발명에 따른 문화재에 대한 보고서는 문화재청, 국립문화재연구원, 돌봄사업단 및 지방자치단체 등 공 공기관에서 보존정책 수립의 기초자료로 활용할 수 있다. 다섯째, 모니터링 수행 과정에서 손상에 대한 기록을 남겨둘 수 있으며, 위험도를 고려하여 리워드 가변을 통해 서 모니터링 주기를 조정하는 것이 가능하다. 여섯째, 관리사각지대 문화재의 빅데이터 생성을 기여할 것으로 기대된다. 일곱째, 비지정문화재 가운데 전문가들조차 인지못한 새로운 비지정문화재를 발굴하는 계기가 될 수 있다."}
{"patent_id": "10-2023-0015115", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하면서 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 이에 앞서, 본 명 세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 아니 되며, 발 명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙 에 입각하여, 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서, 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시예에 불과할 뿐이 고 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양 한 균등물과 변형예들이 있을 수 있음을 이해하여야 한다. (문화재 보존, 관리 및 활용 시스템) 도 1은 종래의 모니터링 시스템(현행 모니터링 시스템)과 본 발명의 바람직한 실시예에 따른 문화재 보존, 관리 및 활용 시스템을 대비하여 개략적으로 나타낸 도면이고, 도 2는 본 발명의 바람직한 실시예에 따른 문화재 보 존, 관리 및 활용 시스템의 구성을 나타낸 개략도이다. 도 1 및 도 2에 도시된 것과 같이, 본 발명에 따른 문화재 보존, 관리 및 활용 시스템은, 심산유곡, 격오지 또 는 도서산간을 포함하여 문화재 관리가 어려운 관리 사각지대에 위치하는 관리사각지대 문화재의 보존, 관리 및 활용 시스템이다. 여기서 관리사각지대 문화재는, 국가지정문화재 또는 시도지정문화재로 지정되지 않은 비지정문화재일 수 있다. 국가지정문화재 또는 시도지정문화재의 경우, 담당자가 지정되어 정기적으로 방문하여 관리하는 대상이 되지만, 비지정문화재, 특히 심산유곡, 격오지 또는 도서산간을 포함하여 문화재 관리가 어려운 관리 사각지대에 위치하 는 비지정문화재는 관리가 제대로 되고 있지 않은채 방치되어 있는게 현실이다. 본 발명에 따른 문화재 보존, 관리 및 활용 시스템은, 복수의 개인 단말장치, 관리사각지대 문화재 시계열 데이 터부, 및 관리사각지대 문화재 시계열 분석결과 제공부를 포함한다. 여기서, 복수의 개인 단말장치는, 설치된 앱을 통해서, 관리사각지대 문화재에 대해서 다양한 각도 상으로 촬영 된 정지화상 또는 동영상을 문화재 보존, 관리 및 활용 시스템에 업로드하는 구성으로, 주로 스마트폰 또는 아 이패드, 갤럭시 패드 등일 가능성이 높지만, 경우에 따라서 노트북이나 컴퓨터가 될 수도 있다. 복수의 개인 단말 장치에서 설치된 앱을 통해서, 관리사각지대 문화재의 정지화상 또는 동영상을 획득하는 것을 언급하였으나, 데이터 크롤링을 통해서 정지화상 또는 동영상을 수집하면서, 역으로 해당 정지화상 또는 동영상 의 저작권을 가진 주체에 앱 설치를 제안하여 본 발명에 따른 앱 사용을 유도하는 것도 가능하다. 관리사각지대 문화재가 동일한 위치에서 동일한 구도로 반복적으로 촬영될 수 있도록 할 필요가 있다. 개인 단 말장치에 설치된 앱을 통해서, 비교군 정지화상이나 비교군 동영상을 같이 제공하되, 정지화상 또는 동영상 촬 영하는 메뉴에서 사용자가 오버랩되어 볼 수 있게 반투명하게 비교군 정지화상이나 비교군 동영상을 제공할 수 있다. 경우에 따라서는 사용자가 비교군 정지화상이나 비교군 동영상의 투명도를 조정하는 것이 가능하다. 비교군 정지화상이나 비교군 동영상은 이미 업로드된 해당 관리사각지대 문화재의 정지화상 또는 동영상 가운데, 해상도가 제일 높거나, 또는 이미지 처리를 통해서 관리사각지대 문화재의 노후 또는 손상 정도를 가장 잘 평가할 수 있었던 정지화상 또는 동영상일 수도 있다. 또는 문화재 보존, 관리 및 활용 시스템의 설계자가 미리 모범 정지화상 또는 모범 동영상으로 촬영한 것으로 설정할 수도 있다. 나아가, 관리사각지대 문화재의 노후 또는 손상 위치를 지속적으로 모니터링할 수 있도록, 관리사각지대 문화재 시계열 분석결과 제공부의 정보를 기초로 하여, 특히, 관리사각지대 문화재의 노후 또는 손상 위치를, 정지화상 이나 비교군 동영상을 촬영하는 메뉴에서 사용자가 잘 시각적으로 인지할 수 있도록, 다른 색상을 포함하여 오 버랩되는 비교군 정화상이나 비교군 동영상과는 다르게 이미지 처리(예를 들어, 문화유산 변형 식별자 표시)하 여 반투명하게 상기 비교군 정지화상이나 비교군 동영상을 오버랩하여 제공하는 것이 바람직하다. 이를 통해서, 관리사각지대 문화재의 노후 또는 손상 위치를 지속적으로 모니터링하는 것이 가능하다. 또한, 문화재 주위에 마련된 고정틀을 이용하여 관리사각지대 문화재의 구조적 변형에 의한 미세한 거동파악에 유리하게 할 수도 있다. 참고로, 도 5는 고정틀을 활용한 동일지점 촬영과 문화유산 변형 식별자, 변형식별자의 세부 사진을 도시한 것이다. 문화재 보존, 관리 및 활용 시스템의 초기에는 비교군 정지화상 또는 비교군 동영상이 존재하지 않을 수 있으므 로, 문화재 보존, 관리 및 활용 시스템의 설계자가 미리 촬영한 모범 정지화상 또는 모범 동영상을 활용하되, 이후 사용자가 업로드한 동영상이나 정지화상 중 해상도가 가장 높은 정지화상 또는 동영상으로 교체하거나, 가 장 최근 업로드 동영상 또는 정지화상으로 교체하거나, 또는 이미지 처리를 통해서 관리사각지대 문화재의 노후 또는 손상 정도를 가장 잘 평가할 수 있었던 정지화상 또는 동영상으로 교체하는 것도 가능하다. 개인 단말장치에 설치된 앱에는, 각 관리사각지대 문화재마다 업로드할 경우 개인단말장치의 사용장에게 제공되 는 리워드를 각각 표시하는 리워드 표시부 및 특정 관리사각지대 문화재에 대한 정지화상 또는 동영상을 시스템 에 업로드할 경우 리워드를 제공하는 리워드 제공부를 포함한다. 그 외 해당 관리사각지대 문화재의 관리등급이 나 손상등급을 같이 표시하는 것도 가능하다. 사용자의 앱 조작에 따라서, 해당 관리사각지대 문화재의 손상현 황과 이전에 수집한 모니터링 자료(정지화상 또는 동영상 등)을 확인하고 사용자가 앱의 카메라 메뉴 또는 카메 라 기능을 통해서 촬영한 것을 앱으로 불러오기 하는 것이 가능하다. 사용자는 기존에 누적 또는 축적된 모니터링 자료를 참고하여 동일한 구도를 유지하여 사진(정지화상)이나 동영 상을 촬영하며, 촬영한 자료는 촬영한 시각 정보, 위치 정보, 촬영에 사용한 장비의 종류 등을 함께 저장하는 것도 가능하다. 또한, 사용자가 현장에서 관리사각지대 문화재 및 주변 시설물에 발생한 추가적인 손상에 대한 신고 메뉴를 구현하여, 문화재에 발생한 피해에 대해 빠른 후속조치를 가능하게 할 수 있다. 사용자는 관리사각 지대 문화재의 손상부에 대한 사진 외에도 전경이나 주변 환경에 대한 사진을 추가로 촬영할 수 있으며, 앱을 통해서 업로드함으로써 이에 따른 추가적인 리워드를 지급받을 수 있다. 부가메뉴로는 사용자의 개인 페이지를 구현하여 본인이 참여한 모니터링의 리스트와 이를 통해 취득한 리워드를 가시적으로 제공함으로써 시민 문화유 산 지키미 활동의 자부심 부여할 수 있다. 제공되는 리워드는, 각 관리사각지대 문화재의 단위 기간 당 업로드 수를 나타내는 업로드 빈도, 업로드되는 것 이 정지화상인지 동영상인지 여부, 정지화상의 경우 정지화상의 수, 동영상의 경우 동영상의 시간적 길이, 및 업로드되는 정지화상 또는 동영상의 촬영 각도의 다양성 중 적어도 하나 이상에 기초하여, 가변되도록 설정할 수 있다. 기본 설정으로 해당 관리사각지대 문화재에 2개월당 1회 방문하도록 설정할 수 있다. 문화재 모니터링 데이터 또는 정보, 특히 정지화상 또는 동영상의 획득에 따라 사용자 또는 사용자의 개인단말장치에 앱을 통해서 제공 하는 리워드의 크기를 모니터링 자료의 획득 주기 또는 빈도에 따라 조절하는 것이 가능하다. 참고로, 도 3은 본 발명에서의 리워드가 가변되는 것을 설명하는 도면이다. 후술하는 관리사각지대 문화재의 노후 또는 손상 정도의 (관리)등급에 따라 리워드의 최소 금액이나 리워드의 금액 증가폭을 달리 설정하거나, 또는 기간별로 리워드를 차등 설정하는 것이 가능하다. 마지막 모니터링 자료 (정지화상 또는 동영상)가 수집된 시점을 기준으로 설정한 한계 주기에 접근할 수록 최대 리워드로 증가 또는 상승하도록 설정할 수 있다. 상대적으로 접근이 용이한 문화재는 적은 리워드에도 모니터링 자료가 쉽게 수집될 수 있다. 하지만, 관리사각 지대 문화재의 경우 접근이 힘들수록, 즉 관리사각지대 문화재의 접근도를 평가(일례로서, 단위 기간 당 방문자 수로 해당 문화재의 접근도를 평가)하여, 접근도가 낮을수록, 즉 단위 기간 당 방문자 수가 낮을수록 리워드가 점차 증가하게 설계하여, 사용자가 리워드 획득으로 인한 경제적 가치가 해당 관리사각지대 문화재의 방문에 들 어가는 제반 비용보다 크다고 판단하면, 모니터링 자료의 수집을 위해 사용자가 방문할 가능성이 높아질 것이다. 또한, 산불이나 지진 등 대규모 자연재해가 발생한 이후에는 해당 재해 발생지역을 중심으로 인위적으로 리워드 를 증가시켜, 관리사각지대 문화재의 재해 피해상황을 파악할 수 있도록 유도할 수 있다. 또한, 제공되는 리워드는, 각 관리사각지대 문화재의 단위 기간 당 업로드 수를 나타내는 업로드 빈도, 업로드 되는 것이 정지화상인지 동영상인지 여부, 정지화상의 경우 정지화상의 수, 동영상의 경우 동영상의 시간적 길 이, 및 업로드되는 정지화상 또는 동영상의 촬영 각도의 다양성 중 적어도 하나 이상에 기초하여, 가변되도록 설정하게 할 수 있다. 한편, 리워드 지급에 앞서서 본 발명에 따른 시스템에 선행하여 평가하는 것이 업로드된 정지화상 또는 동영상 의 데이터 적합성 평가 기술이다. 참고로, 도 8은 모니터링 자료의 데이터 적합성 평가 기술을 설명한 도면이다. 도 8에 도시된 바와 같이, 이용자가 촬영한 모니터링 데이터에 리워드를 지급하는 형태로 운영되는데, 일부 이 용자는 위치정보조작, 외부이미지 사용, 중복이미지 업로드 등 부당한 방법으로 리워드를 챙길 여지가 있다. 또 한 촬영한 모니터링 데이터의 구도나 촬영위치가 이전에 촬영한 기준자료와 상이할 경우 시계열 데이터의 비교 분석에 어려움이 발생할 수 있다. 따라서 수집한 모니터링 자료의 순수성과 적합성을 평가할 수 있는 알고리즘 을 개발하여, 본 발명에 따른 시스템에 업로드된 자료를 필터링할 수 있도록 데이터 적합성 평가기술을 이용하 게 된다. 또한, 개인 단말장치에 설치된 앱이 등산용 앱, 여행용 앱 또는 관광용 앱이거나, 등산용 앱, 여행용 앱 또는 관광용 앱과 연동하는 앱일 수 있다. 개인 단말장치를 소지한 사용자의 등산 경로, 여행 경로 또는 관광 경로와 함께, 관리사각지대 문화재의 위치 표시, 관리사각지대 문화재를 거쳐가지 않을 경우 등산 경로, 여행 경로 또 는 관광 경로, 관리사각지대 문화재를 거쳐갈 경우의 등산 경로, 여행 경로 또는 관광 경로의 대체 경로, 해당 관리사각지대 문화재에 대한 정지화상 또는 동영상 업로드 시의 리워드, 가장 최근에 업로드된 소정의 정지화상 또는 동영상, 해당 관리사각지대 문화재의 설명이나 역사적 의미를 포함하는 관리사각지대 문화재의 정보를 같 이 표시할 수 있다. 다음으로, 관리사각지대 문화재 시계열 데이터부는, 각 관리사각지대 문화재마다 고유하게 할당된 문화재 고유 번호마다, 복수의 개인 단말장치로부터 수신한 서로 다른 시점(時點)의 관리사각지대 문화재의 정지화상 또는 동영상을 시계열적으로 매칭하고 정리하여 데이터베이스로 축적하는 구성이다. 다음으로, 관리사각지대 문화재 시계열 분석결과 제공부는, 관리사각지대 문화재 시계열 데이터부에 축적된 관 리사각지대 문화재의 정지화상 또는 동영상을 이미지 처리하여, 각 관리사각지대 문화재마다 시계열적인 형상의 변화, 위치의 변화, 색상의 변화, 질감의 변화, 구조적 변형, 금속 재질의 관리사각지대 문화재의 경우 녹이 스 는 경과 정보를 포함한 관리사각지대 문화재의 노후 또는 손상와 관련한 관리사각지대 문화재의 시계열 분석결 과를 제공하는 구성이다. 또한, 관리사각지대 문화재 시계열 분석결과 제공부는, 특정 관리사각지대 문화재에 대한 시계열적인 문화재 노 후 또는 손상과 관련한 관리사각지대 문화재 시계열 분석결과 및 유지 보수를 포함한 관리사각지대 문화재의 보 존 및 관리에 대한 보고서를 자동 생성하거나, 또는 자동 생성한 관리사각지대 문화재의 보존 및 관리에 대한 보고서를 정부의 관련 담당자의 이메일로 전송하거나, 또는 정부의 서버로 전송하거나 또는 지방자치단체의 관 련 담당자의 이메일로 자동 전송하거나 또는 지방자치단체의 서버로 전송할 수 있다. 참고로, 우리나라 정부의 중점 추진과제로서 디지털 플랫폼 정부를 지향하고 있다. 인공지능, 데이터, 플랫폼 기반의 과학적 국정운영을 가능케 하는 정부 시스템의 디지털 대전환을 꾀하고 있는데, 본 발명에 따른 관리사 각지대 문화재에 대한 정보를 디지털 플랫폼 정부, 즉 중앙정부의 서버나 이메일 시스템과 지방자치단체의 서버 나 이메일과 연계하여 운영하는 것도 가능하다. 또한, 관리사각지대 문화재 시계열 분석결과 제공부는, 관리사각지대 문화재 시계열 데이터부가 보유한 정지화 상 또는 동영상의 이미지 처리를 기초로 하여, 관리사각지대 문화재의 노후 또는 손상을 관리사각지대 문화재의 보존상태를 평가하여 양호한 상태의 A등급부터 손상이 심화된 F등급까지 6개 등급으로 구분하여 관리사각지대 문화재를 평가하고, 관리사각지대 문화재 시계열 데이터부가 보유한 정지화상 또는 동영상의 시계열적 시점 별 관리사각지대 문화재의 손상부위 이미지를 시간 순서대로 손상 등급과 함께 같이 제공하는 것이 바람직하다. 도 4는 본 발명에 따라서 설정한 손상 등급 A등급~F등급에 대해서 설명하는 도면이다. 도 4에 도시된 바와 같이, 상술한 손상 등급 A등급은 관리사각지대 문화재의 노후 또는 손상 정도가 양호한 것이고, 손상 등급 B등 급은 관리사각지대 문화재의 노후 또는 손상 정도가 경미한 수리가 필요한 것이고, 손상 등급 C등급은 관리사각 지대 문화재의 노후 또는 손상 정도가 주의관찰이 필요한 것이고, 손상 등급 D등급은 관리사각지대 문화재의 노 후 또는 손상 정도가 정밀관찰이 필요한 것이고, 손상 등급 E등급은 관리사각지대 문화재의 노후 또는 손상 정 도가 수리가 필요한 것이고, 손상 등급 F등급은 관리사각지대 문화재의 노후 또는 손상 정도가 즉시조치가 필요 한 등급이다. 여기서, 관리사각지대 문화재 시계열 분석결과 제공부에서는, 관리사각지대 문화재가 상술한 A등급 및 상기 B등 급인 경우 관리사각지대 문화재는 3년 내지 5년 주기로 정기 조사만 수행하면 되는 등급으로 판단하고, 관리사 각지대 문화재가 C등급, D등급 및 E등급인 경우 관리사각지대 문화재는 미리 설정한 소정의 주기 별로 지속적인 모니터링이 되어야 하는 등급으로 판단하고, 관리사각지대 문화재가 F등급인 경우 관리사각지대 문화재는 바로 수리가 필요한 등급으로 판단한다. 관리사각지대 문화재의 손상부 변화 감지기술에 대해서 설명하면, 이미지 유사도 분석 기능을 활용하여 시계열 에 따른 손상부의 이미지 변화양상을 감지하고, 길이를 추정할 수 있는 스케일이 존재할 경우, 길이나 면적의 변화를 이미지 프로세싱(이미지 처리)를 통해서 계산할 수 있다. 이와 같은 관리사각지대 문화재의 손상부 변화 를 대중에게 공개하는 것은 사회적 혼란을 야기할 가능성이 있어서, 공공기관과 지방자치단체 등 모니터링 데이 터의 수요처의 서버나 담당자 이메일로만 제공하는 것을 고려할 수 있다. 참고로, 도 6은 문화재의 손상부의 이 미지 변화 감지 기술을 설명한 도면이다. 한편 유사도 평가 기술과 관련해서는, 촬영한 정지화상 또는 동영상의 문화재의 전경, 손상부, 주변환경 및 기 타 신고사항 등으로 구분하여, 인공지능 기술을 활용하여 자동 분류기능을 구현할 수 있다. 빅데이터를 활용한 인공지능 알고리즘 제작에는 학습을 위한 대규모의 자료와 데이터 라벨링 작업이 선행되어야 하며, 본 발명에 따른 시스템에서 수집한 자료는 대상의 명칭, 형상정보 등이 명확하게 명기된 자료로 간단한 가공을 거쳐 직접 적으로 활용 가능하다. 누적 또는 축적된 사진자료또는 동영상 자료를 활용하여 사진을 통해 관리사각지대 문화 재의 종류를 식별하는 사진인식 기술을 이용한다. 참고로, 도 7은 유사도 평가 기술을 설명한 도면이다. 한편, 민간 문화재에 대한 사이버 수장고 시스템에 대해서 살펴본다. 사이버 수장고 시스템은, 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재를 위탁받아서 관리 및 보존하는 물리적 수장고, 물리적 수장고에 위탁된 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진을 이용하여 시스템 사용자가 민간 문화재 를 열람하고, 대여 신청하는 것이 가능한 사이버 수장고, 및 물리적 수장고 및 사이버 수장고를 연동하여 제어 하고 관리하는 제어부를 포함한다. 여기서 제어부는, 민간 문화재가 물리적 수장고에 위탁되거나, 또는 물리적 수장고로부터 민간 문화재가 대여되 는 경우, 자동적으로 사이버 수장고가 연동하여 업데이트 되어 최신화되도록 하고, 그리고 시스템 사용자로부터 사이버 수장고에 민간 문화재의 대여 신청을 받는 경우, 물리적 수장고에서 연동하여 민간 문화재가 대여되도록 처리한다. 이와 같은 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템의 상기 민간 문화재를 가치 평가할 때, 사이버 수장고 시스템의 민간 문화재 가치 평가부의 요청 에 따라서, 관리사각지대 문화재 시계열 데이터부 및 관리사각지대 문화재 시계열 분석결과 제공부에 기초하여, 가치 평가하는 민간 문화재와 가장 유사한 형상을 가지는 관리사각지대 문화재의 정보 및 데이터를 제공한다. 이를 통해서, 사이버 수장고 시스템의 민간 문화재 가치 평가에서, 본 발명의 관리사각지대 문화재의 가치 평가 액 등의 정보 및 데이터를 활용하는 것이 가능하다. (다른 유관기관의 정보 통합) 지정문화재의 경우, 문화재 모니터링을 주기적으로 법령에 따라서 수행하고 있다. 이와 같이 주기적으로 수집하 여 축적된 지정문화재의 데이터(정지화상 또는 동영상, 문화재에 대한 서지 정보, 역사적 의의 정보 등)를, 본 발명에 따른 문화재 보존, 관리 및 활용 시스템으로 통합하여 제공하는 것도 가능하다. (새로운 문화재 발견) 나아가, 심산유곡이나 도서산간에 위치하여 제대로 발견되지 못한 비지정문화재 가운데 전문가들조차 인지못한 새로운 비지정문화재를 발굴하는 계기가 될 수 있다. 앱에서는 새로운 문화재 발견이 가능하게 하는 신고나 알 림 업로드부를 추가적으로 메뉴에 둘 수 있다. (사이버 수장고 시스템) 본 발명에서 언급하는 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템은, 물리적 수장고, 사이버 수장 고, 제어부, 비용 책정부, 보험 연계부 등을 포함한다. 여기서, 물리적 수장고는, 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재를 위탁받아서 실제로 관리 및 보존하는 시스템으로, 위탁 관리 및 보존되는 물리적인 장치와 IoT(사물인터넷)로 연계된 시스 템을 말한다. 이 물리적 수장고에 위탁된 민간 문화재에 대해서는 3차원 영상 또는 고화질의 2차원 사진을 촬영하여 저장하는 데, 이것은 사이버 수장고에서 본 시스템의 사용자가 해당 민간 문화재를 사이버나 디지털적으로 열람하고자 할 때나, 대여 신청을 할 때, 가상의 공간에서 구현하는데 활용된다. 상술한 바와 같이, 사이버 수장고는 물리적 수장고에 위탁된 민간 문화재의 3차원 영상 또는 고화질의 2차원 사 진을 이용하여 시스템 사용자가 민간 문화재를 열람하고, 대여 신청하는 것이 가능한 구성이다. 또한, 사이버 수장고를 통해서 개인별로 맞춤형의 수장고를 구현하는 것이 가능하다. 개인별로 다른 인터페이스, 사이버 수장고 상의 레이아웃, 색상 등을 개인별로 커스터마이징하는 것이 가능하다. 다음으로, 제어부는 상술한 물리적 수장고 및 사이버 수장고를 연동하여 제어하고 관리하는 구성이다. 제어부는, 민간 문화재가 물리적 수장고에 위탁되거나, 또는 물리적 수장고로부터 해당 민간 문화재가 대여되는 경우, 자동적으로 사이버 수장고가 연동하여 업데이트 되어 최신화되도록 하고, 그리고 시스템 사용자로부터 사 이버 수장고에 민간 문화재의 대여 신청을 받는 경우, 물리적 수장고에서 연동하여 민간 문화재가 대여되도록 처리한다. 민간 문화재가 대여되도록 처리하는 것은, 사이버 수장고에서 대여 신청이 접수되는 경우, 해당 민간 문화재의 대여를 위한 배송을 담당하는 복수의 미리 등록된 문화재 전문 배송 회사의 시스템에 몇 가지 조건을 포함한 배 송 의뢰의 청약을 보내고, 해당 배송 의뢰의 조건 등을 포함하여 배송 의뢰의 청약을 수락하는 문화재 전문 배 송 회사의 답신을 선착순으로 판단하여, 최종적으로 배송 계약이 디지털적으로, 온라인에서 성립되도록 한다. 이와 같은 사이버 수장고에는, 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진, 민간 문화재의 이름, 형상 수치계측 정보, 소유자 정보, 특성 분석 성적서의 정보, 연대 분석 성적서의 정보, 구입 정보, 및 문화재 전문 가의 감정 정보를 포함한 민간 문화재의 정보를 저장하는 민간 문화재 정보 저장부를 더 포함하는 것이 바람직 하다. 또한, 사이버 수장고에 저장된 민간 문화재마다 고유하게 객체를 식별하는데 사용되는 디지털 객체 식별자를 별 도로 부여하고, 제어부는 이와 같은 디지털 객체 식별자에 따라서 물리적 수장고 및 사이버 수장고를 연동하여 제어하고 관리하는 것이 바람직하다. 또한, 민간 문화재를 가치 평가하는 민간 문화재 가치 평가부를 더 포함할 수 있다. 민간 문화재 가치 평가부는, 제 1 민간 문화재 가치 평가부 내지 제 3 민간 문화재 가치 평가부를 포함할 수 있다. 관련해서, 본 출원인의 대한민국 특허 제10-2432105호(발명의 명칭 : 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스 템)를 참조한다. 이상과 같이, 본 발명은 비록 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 이것에 의해 한정되지 않"}
{"patent_id": "10-2023-0015115", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "으며 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 본 발명의 기술 사상과 아래에 기재될 청구범위의 균등 범위 내에서 다양한 수정 및 변형이 가능함은 물론이다."}
{"patent_id": "10-2023-0015115", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 모니터링 시스템(현행 모니터링 시스템)과 본 발명의 바람직한 실시예에 따른 문화재 보존, 관리 및 활용 시스템을 대비하여 개략적으로 나타낸 도면이다. 도 2는 본 발명의 바람직한 실시예에 따른 문화재 보존, 관리 및 활용 시스템의 구성을 나타낸 개략도이다. 도 3은 본 발명에서의 리워드가 가변되는 것을 설명하는 도면이다. 도 4는 본 발명에 따라서 설정한 손상 등급 A등급~F등급에 대해서 설명하는 도면이다. 도 5는 고정틀을 활용한 동일지점 촬영과 문화유산 변형 식별자, 변형식별자의 세부 사진을 도시한 것이다. 도 6은 문화재의 손상부의 이미지 변화 감지 기술을 설명한 도면이다. 도 7은 유사도 평가 기술을 설명한 도면이다. 도 8은 모니터링 자료의 데이터 적합성 평가 기술을 설명한 도면이다."}
