{"patent_id": "10-2021-0145390", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0060803", "출원번호": "10-2021-0145390", "발명의 명칭": "빅데이터 분석을 통한 유망기술 추출 장치 및 그 방법", "출원인": "콤비로 주식회사", "발명자": "이윤주"}}
{"patent_id": "10-2021-0145390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "특허정보를 전달받아 전처리를 수행하는 특허정보 데이터 전처리부(100)와;상기 특허정보 데이터 전처리부(100)에서 전처리한 데이터를 정규화하는 데이터 정규화부(200)와;상기 데이터 정규화부(200)에서 정규화한 데이터에 대해 LSTM을 이용하여 적합모델을 선정하는 적합모델 선정부(300)와;상기 적합모델 선정부(300)에서 선정한 적합모델을 이용하여 특허 분야별 미래 성장성을 예측하여 결과값을 출력하는 유망기술 예측부(400);를 포함하여 구성된 것을 특징으로 하는 빅데이터 분석을 통한 유망기술 추출 장치."}
{"patent_id": "10-2021-0145390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 특허정보 데이터 전처리부(100)는, 전달받은 특허정보의 데이터형태를 확인하고, 유망기술 예측에 사용할 데이터의 행을 추출하는 데이터형태 확인부(110)와;상기 데이터형태 확인부(110)에서 추출한 데이터 행에 대해 누락데이터가 있는지를 확인하는 누락데이터 확인부(120)와;상기 누락데이터 확인부(120)에서 확인한 누락데이터에 대해 중앙값 또는 근사값으로 대체하여 결측치를 보간하는 결측치 보간부(130)와;상기 결측치 보간부(130)의 결과를 시각화하여 주어진 데이터를 시각적으로 확인할 수 있게 하는 데이터 시각화부(140);를 포함하여 구성된 것을 특징으로 하는 빅데이터 분석을 통한 유망기술 추출 장치."}
{"patent_id": "10-2021-0145390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 데이터 정규화부(200)는, 상기 특허정보 데이터 전처리부(100)에서 전처리한 데이터에 대해 LSTM 적용을 위한 변수를 설정하는 변수 설정부(210)와; 상기 변수 설정부(210)의 결과를 입력받고, 예측하고자 하는 미래시점의 데이터를 생성하는 예측시점 생성부(220)와;상기 예측시점 생성부(220)의 데이터를 전달받고, 전달받은 특허정보인 학습데이터를 트레인 세트(train set)와테스트 세트(test set)로 분할하는 학습데이터 분할부(230)와;상기 학습데이터 분할부(230)의 결과를 입력받고, 민맥스 스케일러(MinMax Scalar)를 이용하여 데이터를 정규화하는 정규화 처리부(240);공개특허 10-2023-0060803-3-를 포함하여 구성된 것을 특징으로 하는 빅데이터 분석을 통한 유망기술 추출 장치."}
{"patent_id": "10-2021-0145390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 적합모델 선정부(300)는, 상기 데이터 정규화부(200)의 결과를 입력받고, LSTM 분석을 위한 데이터 구조로 변환시키는 데이터 구조 변환부(310)와;상기 데이터 구조 변환부(310)의 결과를 입력받고, 미리 구축한 모델 레이어(layer)를 이용하여 트레인 세트에대한 모델을 컴파일하여 학습하는 모델 컴파일부(320)와;상기 모델 컴파일부(320)의 결과를 입력받고, LSTM의 Optimizer, Epochs, 또는 TimeDistributed 중에서 하나이상의 값을 조절하여 상기 학습데이터 분할부(230)에서 분할한 트레인 세트에 대해 LSTM을 수행하는 LSTM 데이터 학습부(330)와;상기 LSTM 데이터 학습부(330)의 결과를 이용하여 상기 학습데이터 분할부(230)에서 분할한 테스트 세트에 대해예측 정확도가 가장 높은 최적모델을 적합모델로 선정하는 최적모델 선정부(340);를 포함하여 구성된 것을 특징으로 하는 빅데이터 분석을 통한 유망기술 추출 장치."}
{"patent_id": "10-2021-0145390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "빅데이터 분석을 통한 유망기술 추출 장치의 특허정보 데이터 전처리부(100)에서 특허정보를 전달받아 전처리를수행하는 특허정보 데이터 전처리단계(ST1)와;상기 특허정보 데이터 전처리단계에서 전처리한 데이터를 데이터 정규화부(200)에서 정규화하는 데이터 정규화단계(ST2)와;상기 데이터 정규화단계에서 정규화한 데이터에 대해 적합모델 선정부(300)에서 LSTM을 이용하여 적합모델을 선정하는 적합모델 선정단계(ST3)와;상기 적합모델 선정단계에서 선정한 적합모델을 이용하여 유망기술 예측부(400)에서 특허 분야별 미래 성장성을예측하여 결과값을 출력하는 유망기술 예측단계(ST4);를 포함하여 수행하는 것을 특징으로 하는 빅데이터 분석을 통한 유망기술 추출 방법."}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 빅데이터 분석을 통한 유망기술 추출 장치 및 그 방법을 제공하기 위한 것으로, 특허정보를 전달받아 전처리를 수행하는 특허정보 데이터 전처리부와; 상기 특허정보 데이터 전처리부에서 전처리한 데이터 를 정규화하는 데이터 정규화부와; 상기 데이터 정규화부에서 정규화한 데이터에 대해 LSTM을 이용하 여 적합모델을 선정하는 적합모델 선정부와; 상기 적합모델 선정부에서 선정한 적합모델을 이용하여 특허 분야별 미래 성장성을 예측하여 결과값을 출력하는 유망기술 예측부;를 포함하여 구성함으로서, 빅데 이터 모델 중에서 LSTM을 이용하여 과거 특허정보 데이터를 순환적으로 분석하고, RNN의 은닉 상태에 셀 상태 값 을 추가하여 예측의 정확도를 향상시킨 LSTM을 적용하여 유망기술을 추출할 수 있다."}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 빅데이터 분석을 통한 유망기술 추출에 관한 것으로, 특히 빅데이터 모델 중에서 LSTM(Long Short- Term Memory, 장단기 메모리)을 이용하여 과거 특허정보 데이터를 순환적으로 분석하고, RNN(Recurrent Neural Network, 순환 신경망)의 은닉 상태(hidden state)에 셀 상태(cell state) 값을 추가하여 예측의 정확도를 향 상시킨 LSTM을 적용하여 유망기술을 추출하기에 적당하도록 한 빅데이터 분석을 통한 유망기술 추출 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 유망기술은 새로운 사업 또는 기존 사업을 변화시킬 잠재력이 있는 과학적 기반의 혁신을 일으킬 기 술로 정의된다. 기업의 일반적 특성으로는 상대적인 자본조달의 어려움으로 인한 한정된 자원, 저생산성, 과당경쟁 등을 들 수 있다. 물론 이는 일반적인 특성으로서 개별 기업의 특성 및 산업 특성에 따라 그 편차가 크다. 중소기업은 제한 된 기술역량을 보유하고 있으며, 한정된 자원 하에서 상이한 기술-제품 영역으로의 전환이 어려운 기술 및 마케 팅 역량을 가진 기업집단으로 정의한다. 이러한 자원기반 관점에서 중소기업에게 유망한 기술이란 기존의 보유 기술-제품을 바탕으로 한정된 자원을 활용하여 최대한의 효과를 낼 수 있는 기술로, 기술접근성이 높고, 한정된 기술역량을 지원 받을 수 있는 수준으로 연구개발 활동이 활발한 기술로 정의할 수 있다. 기업 수준에서의 유망기술 탐색은 국가수준 또는 산업수준에서의 유망기술 탐색과 차이가 있다. 기본적으로 특 정기술 포트폴리오를 중심으로 혁신 가능한 기술개발 방향을 지원받는 것으로 정의할 수 있다. 특히 중소기업의 경우에는 신규 유망영역보다 기존 영역에서의 발전방향에 대한 탐색에 관심이 많다. 종래기술 중에서 한국전기연구원에서 출원한 “특허 정보를 이용한 유망 기술 판단 방법 및 시스템”(대한민국 공개특허 제 10-2015-0054427 호)에서는 특허 정보 데이터베이스에 저장된 문헌들을 분석하여 특정 기간 내에 출원된 특허 문헌 상의 주요 키워드와 주요 출원인 정보를 비교 분석하여 유망 기술을 판단하는 방법 및 시스템 을 개시한 바 있다. 그러나 종래기술은 특허 정보를 이용하여 유망 기술을 판단하는데는 의미가 있으나, 미래에 부상할 유망기술 분 야를 정확하게 예측하기에는 한계가 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2015-0054427 A"}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은 상기와 같은 종래의 제반 문제점을 해결하기 위해 제안된 것으로, 본 발명의 목적은 빅데이터 모델 중에서 LSTM을 이용하여 과거 특허정보 데이터를 순환적으로 분석하고, RNN의 은닉 상태에 셀 상태 값을 추가하여 예측의 정확도를 향상시킨 LSTM을 적용하여 유망기술을 추출할 수 있는 빅데이터 분석을 통한 유망기 술 추출 장치 및 그 방법을 제공하는 데 있다."}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "과제의해결수단", "item": 1, "content": "도 1은 본 발명의 일 실시예에 의한 빅데이터 분석을 통한 유망기술 추출 장치의 블록구성도이다. 이에 도시된 바와 같이, 특허정보를 전달받아 전처리를 수행하는 특허정보 데이터 전처리부와; 상기 특허 정보 데이터 전처리부에서 전처리한 데이터를 정규화하는 데이터 정규화부와; 상기 데이터 정규화부 에서 정규화한 데이터에 대해 LSTM을 이용하여 적합모델을 선정하는 적합모델 선정부와; 상기 적합모 델 선정부에서 선정한 적합모델을 이용하여 특허 분야별 미래 성장성을 예측하여 결과값을 출력하는 유망 기술 예측부;를 포함하여 구성된 것을 특징으로 한다. 도 2는 도 1에서 특허정보 데이터 전처리부의 상세블록도이다. 이에 도시된 바와 같이, 상기 특허정보 데이터 전처리부는, 전달받은 특허정보의 데이터형태를 확인하고, 유망기술 예측에 사용할 데이터의 행을 추출하는 데이터형태 확인부와; 상기 데이터형태 확인부에서 추출한 데이터 행에 대해 누락데이터가 있는지를 확인하는 누락데이터 확인부와; 상기 누락데이터 확인부 에서 확인한 누락데이터에 대해 중앙값 또는 근사값으로 대체하여 결측치를 보간하는 결측치 보간부 와; 상기 결측치 보간부의 결과를 시각화하여 주어진 데이터를 시각적으로 확인할 수 있게 하는 데이터 시 각화부;를 포함하여 구성된 것을 특징으로 한다. 도 3은 도 1에서 데이터 정규화부의 상세블록도이다. 이에 도시된 바와 같이, 상기 데이터 정규화부는, 상기 특허정보 데이터 전처리부에서 전처리한 데이 터에 대해 LSTM 적용을 위한 변수를 설정하는 변수 설정부와; 상기 변수 설정부의 결과를 입력받고, 예측하고자 하는 미래시점의 데이터를 생성하는 예측시점 생성부와; 상기 예측시점 생성부의 데이터 를 전달받고, 전달받은 특허정보인 학습데이터를 트레인 세트(train set)와 테스트 세트(test set)로 분할하는 학습데이터 분할부와; 상기 학습데이터 분할부의 결과를 입력받고, 민맥스 스케일러(MinMax Scalar) 를 이용하여 데이터를 정규화하는 정규화 처리부;를 포함하여 구성된 것을 특징으로 한다.ㅌ 도 4는 도 1에서 적합모델 선정부의 상세블록도이고, 도 5는 도 4에서 LSTM 데이터 학습부의 개념도이다. 이에 도시된 바와 같이, 상기 적합모델 선정부는, 상기 데이터 정규화부의 결과를 입력받고, LSTM 분 석을 위한 데이터 구조로 변환시키는 데이터 구조 변환부와; 상기 데이터 구조 변환부의 결과를 입력 받고, 미리 구축한 모델 레이어(layer)를 이용하여 트레인 세트에 대한 모델을 컴파일하여 학습하는 모델 컴파 일부와; 상기 모델 컴파일부의 결과를 입력받고, LSTM의 Optimizer, Epochs, 또는 TimeDistributed 중에서 하나 이상의 값을 조절하여 상기 학습데이터 분할부에서 분할한 트레인 세트에 대해 LSTM을 수행하 는 LSTM 데이터 학습부와; 상기 LSTM 데이터 학습부의 결과를 이용하여 상기 학습데이터 분할부(23 0)에서 분할한 테스트 세트에 대해 예측 정확도가 가장 높은 최적모델을 적합모델로 선정하는 최적모델 선정부 ;를 포함하여 구성된 것을 특징으로 한다. 도 6은 본 발명의 일 실시예에 의한 빅데이터 분석을 통한 유망기술 추출 방법을 보인 흐름도이다. 이에 도시된 바와 같이, 빅데이터 분석을 통한 유망기술 추출 장치의 특허정보 데이터 전처리부에서 특허 정보를 전달받아 전처리를 수행하는 특허정보 데이터 전처리단계(ST1)와; 상기 특허정보 데이터 전처리단계에서 전처리한 데이터를 데이터 정규화부에서 정규화하는 데이터 정규화단계(ST2)와; 상기 데이터 정규화단계에 서 정규화한 데이터에 대해 적합모델 선정부에서 LSTM을 이용하여 적합모델을 선정하는 적합모델 선정단계 (ST3)와; 상기 적합모델 선정단계에서 선정한 적합모델을 이용하여 유망기술 예측부에서 특허 분야별 미래 성장성을 예측하여 결과값을 출력하는 유망기술 예측단계(ST4);를 포함하여 수행하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의한 빅데이터 분석을 통한 유망기술 추출 장치 및 그 방법은 빅데이터 모델 중에서 LSTM을 이용하여 과거 특허정보 데이터를 순환적으로 분석하고, RNN의 은닉 상태에 셀 상태 값을 추가하여 예측의 정확도를 향상 시킨 LSTM을 적용하여 유망기술을 추출할 수 있는 효과가 있다."}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이와 같이 구성된 본 발명에 의한 빅데이터 분석을 통한 유망기술 추출 장치 및 그 방법의 바람직한 실시예를 첨부한 도면에 의거하여 상세히 설명하면 다음과 같다. 하기에서 본 발명을 설명함에 있어 관련된 공지 기능 또 는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설 명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서, 이는 사용 자, 운용자의 의도 또는 판례 등에 따라 달라질 수 있으며, 이에 따라 각 용어의 의미는 본 명세서 전반에 걸친 내용을 토대로 해석되어야 할 것이다.먼저 본 발명은 빅데이터 모델 중에서 LSTM을 이용하여 과거 특허정보 데이터를 순환적으로 분석하고, RNN의 은 닉 상태에 셀 상태 값을 추가하여 예측의 정확도를 향상시킨 LSTM을 적용하여 유망기술을 추출하고자 한 것이다. 도 1은 본 발명의 일 실시예에 의한 빅데이터 분석을 통한 유망기술 추출 장치의 블록구성도이다. 특허정보 데이터 전처리부는 특허정보를 전달받아 전처리를 수행한다. 특허정보 데이터 전처리부에서 전달받는 특허정보는 연도별 특허출원건수, 출원인 국적, 기술분류, 발명자, 출원인 등의 정보가 포함된다. 또한 특허정보를 전달받기 위하여 하나 이상의 국가, 국가 연합 또는 단체의 특허 정보 데이터베이스를 사용할 수 있다. 기술분류는 IPC 또는 CPC를 활용할 수 있다."}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "IPC(International Patent Classification, 국제특허분류)는 발명의 기술분야를 나타내는 국제적으로 통일된 특허분류체계로, 한국 특허청은 특허문헌의 분류, 검색을 용이하게 하도록 국내의 모든 출원건에 대하여 IPC를 부여하고 있다. CPC(Cooperative Patent Classification, 협력적 특허분류)는 IPC(International Patent Classification, 국 제특허분류)보다 세분화된 특허분류체계로서 IPC(7만여 개소)보다 많은 26만여 개의 특허분류 개소를 갖고 있다. CPC는 효율적인 선행기술조사를 위해 미국특허청과 유럽특허청의 주도로 2012년 개발되어, 2021년 현재 전 세계 중 30개 국가가 특허문헌을 CPC로 분류하고 있으며, 특허문헌과 비특허문헌을 포함하여 전 세계 6000만 건 이상의 문헌이 CPC로 분류되어 있다. 우리나라는 2015년 1월 이후 신규출원에 CPC, IPC를 함께 부여하고 있 다."}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "한국 특허청에서는 4차 산업혁명 관련 16대 기술분야 특허분류 체계를 구축하여 데이터를 제공하고 있다. 4차"}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "산업혁명과 관련된 종전 7대 기술분야(인공지능(AI), 빅데이터, 클라우드, 사물인터넷(IoT), 지능형로봇, 자율"}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "주행차, 3D프린팅)를 16대 기술분야(인공지능(AI), 빅데이터, 클라우드컴퓨팅, 차세대통신, 사물인터넷(IoT), 지능형로봇, 자율주행차, 드론, 가상증강현실, 스마트시티, 맞춤형헬스케어, 혁신신약, 지능형반도체, 첨단소재, 신재생에너지, 3D프린팅)로 확대 및 개선하여 선진특허분류(CPC) 체계에 부가하여 수립하였다. 이러한 기술분류는 연도별 특허출원건수를 추출하고, 이에 대해 LSTM을 이용하여 기술분류별 미래의 특허출원건 수 성장성을 예측하고, 성장성이 높은 기술분류 분야를 유망기술 분야로 추출하여 선정할 수 있게 된다. 이처럼 특허정보 데이터 전처리부는 각종 특허정보 데이터를 수집하여 전처리하여, 특허정보의 빅데이터를 처리하기 위한 전처리를 수행한다. 데이터 정규화부는 특허정보 데이터 전처리부에서 전처리한 데이터를 정규화한다. 정규화는 비정상성 의 비정규분포 자료를 정규분포로 변환하기 위함이다. 특허정보 데이터의 정규화는 이상이 있는 관계를 재구성 하여 작고 잘 조직된 관계를 생성하는 것이다. 이를 통해 유망기술 예측을 위한 적합모델을 선정할 때 데이터를 잘 다룰 수 있게 된다. 적합모델 선정부는 데이터 정규화부에서 정규화한 데이터에 대해 LSTM을 이용하여 적합모델을 선정한 다. 본 발명에서 적용하는 LSTM(Long Short-Term Memory, 장단기 메모리)은 인공 신경망 중에서 유닛간의 연결이 순 환적 구조를 갖는 RNN(Recurrent Neural Network, 순환 신경망)의 히든 state에 cell-state를 추가한 구조로서, 역전파시 기울기 값이 급격하게 사라지거나 증가하는 문제를 방지한다. LSTM은 RNN이 감당해야 할 긴 구간 기억 문제를 보완한 것으로, 이동경로 예측이나 추이 예측에 주로 사용되고 있다. 도 5에서는 LSTM의 개념의 보여주고 있다. 그래서 LSTM은 은닉층의 메모리 셀에 입력 게이트, 망각 게이트, 출 력 게이트를 추가하여 불필요한 기억을 지우고, 기억해야 할 것들을 정한다. LSTM은 은닉 상태(hidden state)의 계산식이 전통적 RNN 보다 복잡해져, 셀 상태(cell state) 값을 추가한다. t시점의 셀 상태를 Ct로 표현한다. LSTM은 RNN과 비교하여 긴 시퀀스의 입력을 처리하는데 탁월한 성능을 나타낸다."}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "유망기술 예측부는 적합모델 선정부에서 선정한 적합모델을 이용하여 특허 분야별 미래 성장성을 예 측하여 결과값을 출력한다. 그래서 기술분야별 특허출원건수의 성장성을 예측하여 성장성이 높은 기술분야를 유"}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "망기술분야로 추출하는 결과값을 출력할 수 있게 된다. 도 2는 도 1에서 특허정보 데이터 전처리부의 상세블록도이다. 특허정보 데이터 전처리부에서 데이터형태 확인부는 전달받은 특허정보의 데이터형태를 확인하고, 유 망기술 추출에 사용할 데이터의 행을 추출한다. 전달받은 특허정보는 각종 데이터로 구성될 수 있다. 그래서 전 달받은 특허정보의 데이터 행을 확인하여 유망기술 예측에 사용할 데이터의 행을 추출한다. 누락데이터 확인부는 데이터형태 확인부에서 추출한 데이터 행에 대해 누락데이터가 있는지를 확인한 다. 누락데이터는 결측치 또는 이상치가 될 수 있다. 결측치는 누락된 값, 비어있는 값을 말한다. 이상치는 논 리적으로 존재할 수 없는 값이거나 극단적으로 크거나 작은 극단치일 수 있다. 결측치 보간부는 누락데이터 확인부에서 확인한 누락데이터에 대해 중앙값 또는 근사값으로 대체하여 결측치를 보간한다. 현장에서 만들어지는 특허정보의 실제 데이터들은 수집 과정의 오류로 인해 결측치를 포함 하고 있을 수 있다. 그래서 이런 결측치들을 확인하고 제거하거나 보간한다. 결측치를 제거할 수도 있는데, 이 경우 너무 많은 데이터가 손실되어 데이터가 왜곡될 수도 있다. 그래서 결측치를 다른 값으로 대체하는 보간을 수행할 수 있다. 결측치 보간은 특정한 단일값으로 보간하거나, 또는 결측치 바로 이전의 값으로 보간하거나, 또는 결측치 바로 뒤의 값으로 보간할 수도 있다. 결측치를 다른 값으로 대체할 경우, 평균값과 같은 대푯값을 구하여 모든 결측치를 하나의 값으로 일괄 대체하 거나, 각 결측치의 값의 예측값을 추정해 대체할 수도 있다. 또는 중앙값 또는 근사값을 구하여 보간할 수도 있 다. 이상치들을 결측 처리하여 제거하던가 평균값으로 대체하거나 중앙값이나 근사값으로 보간할 수도 있다. 결측치 보간시, 중앙값을 대체할 경우에는 특허정보 데이터의 중앙값으로 결측치를 대체하는 것이다. 각 연도에 해당하는 열(row)의 평균과 중앙값으로 대체할 수 있다. 이때 대상 연도별 범주를 확인하고, 해당 범주내의 기 준으로 설정하여 값을 보간한다. 이때 대상 연도별 범주를 확인할 때 연도별 범주 데이터의 세이프(shape) 편차 를 확인하여, 편차가 수용할 수 있는 범주 이내이면 중앙값으로 보간하고, 세이프(shape)의 편차가 기준치 이상 으로 큰 것으로 확인되면 중앙값으로 보간하는 것을 기각하여, 중앙값 보간을 사용하지 않는다. 또한 근사값으로 보간시, 최 근사값의 특허출원건수로 특허출원건수 값을 대체한다. 즉, 중앙값 대신 가장 근사 치 값으로 대체한다. 이를 위해 연도별 반복을 수행하고, 결측치를 확인하여 근사값으로 대체하여 보간할 수 있 다. 데이터 시각화부는 결측치 보간부의 결과를 시각화하여 주어진 데이터를 시각적으로 확인할 수 있게 한다. 그래서 데이터의 시각화를 통해 결측치의 존재여부, 데이터의 이상 여부 등을 확인하여 특허정보 예측을 수행할 때 데이터 오류가 발생하지 않도록 확인한다. 도 3은 도 1에서 데이터 정규화부의 상세블록도이다. 데이터 정규화부에서 변수 설정부는 특허정보 데이터 전처리부에서 전처리한 데이터에 대해 LSTM 적용을 위한 변수를 설정한다. 다음 연도의 값을 예측하기 위해서, 년 단위의 다음 연도 변수를 생성한다. 예측시점 생성부는 변수 설정부의 결과를 입력받고, 예측하고자 하는 미래시점의 데이터를 생성한다. 그래서 다음 연도의 값을 예측하기 위해서, 년 단위의 다음 연도 데이터를 생성한다. 학습데이터 분할부는 예측시점 생성부의 데이터를 전달받고, 전달받은 특허정보인 학습데이터를 트레 인 세트(train set)와 테스트 세트(test set)로 분할한다. 학습데이터 세트(100%)는 트레인 세트 70%(또는 80%), 테스트 세트 30%(또는 20%)로 분할 수 있다. 이때 최근 데이터로 검증하기 위해서 무작위 추출이 아닌 순 차적 추출을 적용한다. 또한 학습데이터는 train, validation, test set으로 구분할 수도 있다. 그래서 train set 중의 일부를 validation set으로 구분하여 “train : validation : test = 60% : 20% : 20%”로 구성할 수 도 있다. 다만 본 발명의 일 실시예에서는 validation set를 적용한 경우는 제외하고, train set와 test set로 만 분할한 경우에 대해서만 설명한다. 정규화 처리부는 학습데이터 분할부의 결과를 입력받고, 민맥스 스케일러(MinMax Scalar)를 이용하여 데이터를 정규화한다. 스케일러(Scalar)는 다차원의 값들을 비교 분석하기 쉽게 만들어주며, 자료의 오버플로우 (overflow)나 언더플로우(underflow)를 방지하고, 독립 변수의 공분산 행렬의 조건수(condition number)를 감소시켜 최적화 과정에서의 안정성 및 수렵 속도를 향상시키는 것이다. 이러한 스케일러는 StandardScaler, MinMaxScaler, MaxAbsScaler, RobustScaler 등을 사용할 수 있다. - StandardScaler : 기본 스케일. 평균과 표준편차 사용 - MinMaxScaler : 최대/최소값이 각각 1, 0이 되도록 스케일링 - MaxAbsScaler : 최대절대값과 0이 각각 1, 0이 되도록 스케일링 - RobustScaler : 중앙값(median)과 IQR(interquartile range) 사용. 아웃라이어의 영향을 최소화 본 발명의 일 실시예에서는 민맥스 스케일러를 사용하는 경우를 예로 들었다. 민맥스 스케일러는 모든 feature 값이 0~1 사이에 있도록 데이터를 재조정한다. 다만 이상치가 있는 경우 변환된 값이 매우 좁은 범위로 압축될 수 있다. MinMaxScaler는 특정값에 집중되어 있는 데이터가 그렇지 않은 데이터 분포보다 1 표준편차에 의한 스 케일 변화값이 커지게 된다. 한쪽으로 쏠림 현상이 있는 데이터 분포는 형태가 거의 유지된 채 범위값이 조절되 는 결과를 보인다. 도 4는 도 1에서 적합모델 선정부의 상세블록도이고, 도 5는 도 4에서 LSTM 데이터 학습부의 개념도이다. 적합모델 선정부에서 데이터 구조 변환부는 데이터 정규화부의 결과를 입력받고, LSTM 분석을 위한 데이터 구조로 변환시킨다. 이를 통해 특허정보 데이터에 대해 LSTM으로 미래 유망기술 분야를 추출할 수 있게 한다. 모델 컴파일부는 데이터 구조 변환부의 결과를 입력받고, 미리 구축한 모델 레이어(layer)를 이용하 여 트레인 세트에 대한 모델을 컴파일하여 학습한다. 모델 레이어는 ‘layer_input, layer_LSTM, layer_output, model_1’과 같이 구현할 수 있다. 모델 컴파일을 통해 실제 모델을 생성하는데, 다음과 같이 모 델 컴파일을 수행할 수 있다. (아래의 예는 python 언어를 이용하여 구축한 것임) - model_1.complie(optimizer = ‘adam’, loss = ‘mse’) - model_1._name = ‘LSTM_Model’ - model_1.summary() LSTM 데이터 학습부는 모델 컴파일부의 결과를 입력받고, LSTM의 Optimizer, Epochs, 또는 TimeDistributed 중에서 하나 이상의 값을 조절하여 학습데이터 분할부에서 분할한 트레인 세트에 대해 LSTM을 수행한다. 대표적인 딥러닝 알고리즘에는 Auto-encoder, Restricted Boltzmann Machine(RBM), Convolutional Neural Network(CNN), RNN, LSTM 등이 있다. Auto-encoder 및 RBM은 초기에 제안된 모델이고, 자가 학습이라는 장점이 있지만 성능은 제한적이다. 현재 대부 분의 딥러닝 시스템들은 CNN 또는 RNN을 기반으로 한다. CNN은 이미지 신호 처리 및 컴퓨터 비전 분야에서 없어서는 안 될 알고리즘이 되었으며, RNN은 순차적인 의미 정보를 처리하는데 적합하므로 음성 신호 처리 및 음성 인식에서 우수한 성능을 보인다. 최근에는 이러한 초기 알고리즘을 보완하거나 개선하는 많은 좋은 알고리즘들이 제시되고 있다. RNN은 출력값의 일부가 입력 값에 다시 포함되는 연속성 개념의 신경 회로망을 의미한다. RNN은 주로 음성 신호 처리 및 문자열 처리에 사용된다. 이러한 종류의 신경망은 시계열 데이터를 처리하기 위해 제안되었지만, 장기 간에 걸쳐 발생되는 패턴을 인식하지 못하는 문제점이 발견되었다. 이 문제를 해결하기 위해서, Long Short- Term Memory(LSTM)과 Gated Recurrent Unit(GRU) 등의 알고리즘이 제시되었다. LSTM은 가중치 뿐 아니라 메모리에 대한 추가 정보를 셀 상태에 저장하고 시계열 패턴의 길이도 조정한다. GRU 는 LSTM의 출력 게이트를 제거하기 때문에 성능은 동일하게 유지하면서 보다 간단해졌다. 도 5에서는 LSTM의 개념을 보인 것이다. LSTM 모델은 Hochreiter & Schmidhuber에 처음 제안되었다. RNN 과 LSTM의 가장 큰 차이점은 모델 안에 여러 개의 gate를 추가하여 input, output 그리고 memory 간 흐르는 정 보를 좀 더 섬세하게 제어했다는 점이다. LSTM에는 input gate, output gate, forget gate, update gate가 있 는데, 어떤 정보를 받아들이고, 내보내고, 잊어버리고, 저장할지를 학습하는 모델이다. 본 발명의 일 실시예에서는 LSTM의 Optimizer, Epochs, TimeDistributed 3가지를 조합하여 8가지 모델 중 최고 정확도의 모델을 찾았다. 이 예시는 다음의 표 1과 같다. 표 1 LSTM의 Optimizer, Epochs, TimeDistributed 3가지 조합 예 모델 No.Optimizer EpochsTimeDistributedMAPE 1 Adam 200 X 91.83495620485067 2 Adam 1000 X 81.55310165298111 3 Adam 200 O 88.54479521547788 4 Adam 1000 O 81.40406211604217 5 RMSprop 200 X 88.92700124664482 6 RMSprop 1000 X 82.90107571599704 7 RMSprop 200 O 87.98766542960315 8 RMSprop 1000 O 82.67937315827841 여기서 Optimizer는 파라미터를 갱신시켜 최적값을 찾아가는 것이다. 또한 Optimizer에는 GD(Gradient descent), SGD(Stochastic Gradient Descent), Momentum, NAG(Nesterov Accelerated Gradient), Nadam(Nesterov-accelerated Adaptive Moment Adam), Adam(Adaptive Moment Estimation), Adagrad(Adaptive Gradient), RMSprop, AdaDelta(Adaptive Delta) 등이 있다. 본 발명의 일 실시예에서는 RMSprop, Adam을 사용 하였으나, 이외에도 다른 Optimizer를 사용할 수 있다. Optimizer에서 RMSprop는 Adagrad의 계산식에 지수이동평균을 적용한 것이다. Adagrad(Adaptive Gradient, 아 다그라드)는 탐색 거리에 대한 문제를 해결하고자 등장한 최적화 알고리즘으로서, 변수별 맞춤형(Adaptive) 학 습률을 주는 방식이다. Adam(Adaptive momentum estimation)은 모멘텀(Momentum)과 RMSprop의 장점을 조합한 방식이다. 모멘텀(Momentum)은 Gradient descent(GD) 기반의 최적화 알고리즘이고, RMSprop은 기울기를 단순 누적하지 않고 지수 가중 이동 평균 Exponentially weighted moving average 를 사용하여 최신 기울기들이 더 크게 반영되도록 한 알고리즘이다. Epoch은 인공 신경망에서 전체 데이터에 대해 순전파와 역전파가 끝난 상태를 말한다. 즉, 순전파와 역전파에 대한 반복횟수를 의미한다. TimeDistributed는 입력의 모든 시간적 슬라이스에 대해 내부 선언 레이어를 적용한 것이다. MAPE(Mean Absolute Percentage Error, 평균절대비오차)는 MAE(Mean Absolute Error, 평균절대오차)를 퍼센트 로 변환한 것이다. 값이 클 수록 실제 값과 예측 값의 차이가 크다는 것을 의미한다. MAPE의 값이 작으면 최고 정확도를 갖는 모델이라고 할 수 있다. 따라서 표 1의 예에서는 모델 No 4의 MAPE 값이 가장 낮아 최고 정확도의 모델로 선정할 수 있다. 최적모델 선정부는 LSTM 데이터 학습부의 결과를 이용하여 학습데이터 분할부에서 분할한 테스 트 세트에 대해 예측 정확도가 가장 높은 최적모델을 적합모델로 선정한다. 이렇게 선정된 최적모델을 이용하여 유망기술 예측부에서는 기술분류별 미래 특허출원건수를 예측하여 결"}
{"patent_id": "10-2021-0145390", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "과값을 출력한다. 그래서 기술분야별 특허출원건수의 성장성을 예측하여 성장성이 높은 기술분야를 유망기술분 야로 추출하는 결과값을 출력할 수 있게 된다. 도 6은 본 발명의 일 실시예에 의한 빅데이터 분석을 통한 유망기술 추출 방법을 보인 흐름도이다. 특허정보 데이터 전처리단계(ST1)에서는 빅데이터 분석을 통한 유망기술 추출 장치의 특허정보 데이터 전처리부 에서 특허정보를 전달받아 전처리를 수행한다. 데이터 정규화단계(ST2)에서는 특허정보 데이터 전처리단계에서 전처리한 데이터를 데이터 정규화부에서 정규화한다. 적합모델 선정단계(ST3)에서는 데이터 정규화단계에서 정규화한 데이터에 대해 적합모델 선정부에서 LSTM 을 이용하여 적합모델을 선정한다.유망기술 예측단계(ST4)에서는 적합모델 선정단계에서 선정한 적합모델을 이용하여 유망기술 예측부에서 특허 분야별 미래 성장성을 예측하여 결과값을 출력한다. 이처럼 본 발명은 빅데이터 모델 중에서 LSTM을 이용하여 과거 특허정보 데이터를 순환적으로 분석하고, RNN의 은닉 상태에 셀 상태 값을 추가하여 예측의 정확도를 향상시킨 LSTM을 적용하여 유망기술을 추출하게 된다. 이상에서 실시예를 들어 본 발명을 더욱 상세하게 설명하였으나, 본 발명은 반드시 이러한 실시예로 국한되는 것은 아니고, 본 발명의 기술사상을 벗어나지 않는 범위 내에서 다양하게 변형실시될 수 있다. 따라서 본 발명 에 개시된 실시예들은 본 발명의 기술적 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시 예에 의하여 본 발명의 기술적 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호범위는 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술적 사상은 본 발명의 권리범위에 포함되는 것으로 해석 되어야 할 것이다."}
{"patent_id": "10-2021-0145390", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 의한 빅데이터 분석을 통한 유망기술 추출 장치의 블록구성도이다. 도 2는 도 1에서 특허정보 데이터 전처리부의 상세블록도이다. 도 3은 도 1에서 데이터 정규화부의 상세블록도이다. 도 4는 도 1에서 적합모델 선정부의 상세블록도이다. 도 5는 도 4에서 LSTM 데이터 학습부의 개념도이다. 도 6은 본 발명의 일 실시예에 의한 빅데이터 분석을 통한 유망기술 추출 방법을 보인 흐름도이다."}
