{"patent_id": "10-2023-0133582", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0050494", "출원번호": "10-2023-0133582", "발명의 명칭": "환경 적응형 방음 귀덮개 및 환경 적응적 소음 제거 방법", "출원인": "삼성중공업 주식회사", "발명자": "장화랑"}}
{"patent_id": "10-2023-0133582", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부 소리를 유입하는 수음부에서 상기 외부 소리에 상응하도록 출력하는 전기적 소리 신호를 미리 기계 학습된인식 모델에 적용하여, 상기 전기적 소리 신호를 구성하는 소리 요소들에 관한 소리 요소 인식 정보를 생성하는소음 인식부;상기 소리 요소 인식 정보를 참조하여, 상기 소리 요소 인식 정보에서 작업 소음으로 분류된 소리 요소들 각각에 대해 미리 저장된 상쇄 신호를 상기 전기적 소리 신호에 합성하여, 상기 작업 소음으로 분류된 소리 요소들이 제거된 상기 전기적 소리 신호가 스피커부를 통해 출력되도록 하는 적응적 처리부를 포함하되,상기 상쇄 신호는 상기 작업 소음으로 분류된 소리 요소와 크기는 같지만 파형은 반대인 역 위상 신호인, 환경적응형 방음 귀덮개."}
{"patent_id": "10-2023-0133582", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 소리 요소 인식 정보에는 분류 항목으로서 상기 작업 소음 이외에 안전 소음과 목소리 소음이 더포함되고, 상기 소음 인식부는 상기 인식 모델에 의해 상기 전기적 소리 신호에 포함되는 것으로 인식된 소리 요소들 각각을 상기 작업 소음, 상기 안전 소음 및 상기 목소리 소음 중에서 어느 하나로 분류하여 상기 소리 요소 인식 정보를 생성하는, 환경 적응형 방음 귀덮개."}
{"patent_id": "10-2023-0133582", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 적응적 처리부는 상기 안전 소음 및 상기 목소리 소음으로 분류된 소리 요소들은 미리 지정된 증폭 크기로증폭되어 상기 스피커부를 통해 출력되도록 처리하는, 환경 적응형 방음 귀덮개."}
{"patent_id": "10-2023-0133582", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 소리 요소 인식 정보에서 상기 안전 소음으로 분류된 소리 요소에 상응하는 음성의 안내 멘트가 상기 스피커부를 통해 출력되도록 처리하는 음성 안내부를 더 포함하는, 환경 적응형 방음 귀덮개."}
{"patent_id": "10-2023-0133582", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "환경 적응적 소음 제거 방법을 수행하도록 하기 위해 컴퓨터-판독 가능 매체에 저장된 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램은 컴퓨터로 하여금 이하의 단계들을 수행하도록 하며, 상기 단계들은,외부 소리를 유입하는 수음부에서 상기 외부 소리에 상응하도록 출력하는 전기적 소리 신호를 미리 기계 학습된인식 모델에 적용하여, 상기 전기적 소리 신호를 구성하는 소리 요소들에 관한 소리 요소 인식 정보를 생성하는단계; 및상기 소리 요소 인식 정보에서 작업 소음으로 분류된 소리 요소들이 제거된 상기 전기적 소리 신호가 스피커부를 통해 출력되도록 하기 위해, 상기 작업 소음으로 분류된 소리 요소들에 대해 미리 저장된 상쇄 신호를 상기전기적 소리 신호에 합성하는 단계를 포함하되,상기 소리 요소 인식 정보는 상기 인식 모델에 의해 상기 전기적 소리 신호에 포함되는 것으로 인식된 소리 요소들 각각이 상기 작업 소음, 안전 소음 및 목소리 소음 중에서 어느 하나로 분류되어 생성되고,상기 상쇄 신호는 상기 작업 소음으로 분류된 소리 요소와 크기는 같지만 파형은 반대인 역 위상 신호인, 컴퓨공개특허 10-2025-0050494-3-터-판독 가능 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0133582", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "환경 적응형 방음 귀덮개 및 환경 적응적 소음 제거 방법이 개시된다. 방음 귀덮개는, 외부 소리를 유입하는 수 음부에서 상기 외부 소리에 상응하도록 출력하는 전기적 소리 신호를 미리 기계 학습된 인식 모델에 적용하여, 상기 전기적 소리 신호를 구성하는 소리 요소들에 관한 소리 요소 인식 정보를 생성하는 소음 인식부; 상기 소리 요소 인식 정보를 참조하여, 상기 소리 요소 인식 정보에서 작업 소음으로 분류된 소리 요소들 각각에 대해 미리 저장된 상쇄 신호를 상기 전기적 소리 신호에 합성하여, 상기 작업 소음으로 분류된 소리 요소들이 제거된 상기 전기적 소리 신호가 스피커부를 통해 출력되도록 하는 적응적 처리부를 포함한다."}
{"patent_id": "10-2023-0133582", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 환경 적응형 방음 귀덮개 및 환경 적응적 소음 제거 방법에 관한 것이다."}
{"patent_id": "10-2023-0133582", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "조선소 등의 작업장에서는 다양한 소음이 존재하고, 이러한 작업장 소음은 현장 작업자들의 청각 질환과 정신적 스트레스를 유발한다. 따라서, 소음이 심한 작업장에서 작업하는 현장 작업자들은 작업장에서 발생되는 소음으로부터의 산업재해를 방 지하기 위해 귀마개 착용이 의무화되어 있고, 대부분의 현장 작업자들은 방음 귀덮개를 착용한 상태에서 지정된 작업을 실시한다. 도 1에 도시된 바와 같이, 방음 귀덮개를 착용하고 작업하는 경우, 현장 작업자의 청력은 보호될 수 있 지만, 주변의 모든 소리가 차단되는 현상이 발생된다. 이로 인해, 도 1에 도시된 바와 같이, 작업장에서 이동하 며 운용되는 자동차, 중장비, 크레인 등과 같은 이동형 위험 설비의 접근 소리를 방음 귀덮개를 착용한 현장 작업자가 듣지 못하여 안전 사고로 이어지는 원인이 되고 있다."}
{"patent_id": "10-2023-0133582", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "전술한 배경기술과 관련 도면을 참조하여 후술될 종래기술은 고안자가 본 고안의 도출을 위해 보유하고 있었거 나, 본 고안의 도출 과정에서 습득한 기술 정보로서, 반드시 본 고안의 출원 전에 일반 공중에게 공개된 공지기 술이라 할 수는 없다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1901490호"}
{"patent_id": "10-2023-0133582", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 방음 귀덮개를 착용하고 소음이 심한 작업장에서 작업하는 현장 작업자들에게 작업 소음과 같이 유해 한 소음은 차단하되, 크레인이나 지게차 등인 이동형 위험 설비의 접근 경고음이나 작동 사이렌은 들리도록 함 으로써, 현장 작업자의 청각 질환 및 스트레스를 감소시키면서도 안전 사고 예방에 기여할 수 있는, 환경 적응 형 방음 귀덮개 및 환경 적응적 소음 제거 방법을 제공하기 위한 것이다. 본 발명은 작업하는 현장 작업자가 방음 귀덮개를 착용하고 작업할지라도 주변에서 작업하는 다른 현장 작업자 들과의 협업을 위한 목소리나 구조 신호 등은 들리도록 함으로써, 원활한 협력 작업이 가능할 뿐 아니라, 주변 의 위급 상황 발생시 신속한 대응 처리가 가능하도록 하는, 환경 적응형 방음 귀덮개 및 환경 적응적 소음 제거 방법을 제공하기 위한 것이다. 본 발명의 이외의 해결하고자 하는 과제들은 하기의 설명을 통해 쉽게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0133582", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 외부 소리를 유입하는 수음부에서 상기 외부 소리에 상응하도록 출력하는 전기적 소리 신호를 미리 기계 학습된 인식 모델에 적용하여, 상기 전기적 소리 신호를 구성하는 소리 요소들에 관한 소리 요소 인식 정보를 생성하는 소음 인식부; 상기 소리 요소 인식 정보를 참조하여, 상기 소리 요소 인식 정 보에서 작업 소음으로 분류된 소리 요소들 각각에 대해 미리 저장된 상쇄 신호를 상기 전기적 소리 신호에 합성 하여, 상기 작업 소음으로 분류된 소리 요소들이 제거된 상기 전기적 소리 신호가 스피커부를 통해 출력되도록 하는 적응적 처리부를 포함하되, 상기 상쇄 신호는 상기 작업 소음으로 분류된 소리 요소와 크기는 같지만 파형 은 반대인 역 위상 신호인, 환경 적응형 방음 귀덮개가 제공된다. 상기 소리 요소 인식 정보에는 분류 항목으로서 상기 작업 소음 이외에 안전 소음과 목소리 소음이 더 포함되고, 상기 소음 인식부는 상기 인식 모델에 의해 상기 전기적 소리 신호에 포함되는 것으로 인식된 소리 요소들 각각을 상기 작업 소음, 상기 안전 소음 및 상기 목소리 소음 중에서 어느 하나로 분류하여 상기 소리 요소 인식 정보를 생성할 수 있다. 상기 적응적 처리부는 상기 안전 소음 및 상기 목소리 소음으로 분류된 소리 요소들은 미리 지정된 증폭 크기로 증폭되어 상기 스피커부를 통해 출력되도록 처리할 수 있다. 상기 환경 적응형 방음 귀덮개는, 상기 소리 요소 인식 정보에서 상기 안전 소음으로 분류된 소리 요소에 상응 하는 음성의 안내 멘트가 상기 스피커부를 통해 출력되도록 처리하는 음성 안내부를 더 포함할 수도 있다. 본 발명의 다른 측면에 따르면, 환경 적응적 소음 제거 방법을 수행하도록 하기 위해 컴퓨터-판독 가능 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 컴퓨터로 하여금 이하의 단계들을 수행하도록 하며, 상 기 단계들은, 외부 소리를 유입하는 수음부에서 상기 외부 소리에 상응하도록 출력하는 전기적 소리 신호를 미 리 기계 학습된 인식 모델에 적용하여, 상기 전기적 소리 신호를 구성하는 소리 요소들에 관한 소리 요소 인식 정보를 생성하는 단계; 및 상기 소리 요소 인식 정보에서 작업 소음으로 분류된 소리 요소들이 제거된 상기 전 기적 소리 신호가 스피커부를 통해 출력되도록 하기 위해, 상기 작업 소음으로 분류된 소리 요소들에 대해 미리 저장된 상쇄 신호를 상기 전기적 소리 신호에 합성하는 단계를 포함하되, 상기 소리 요소 인식 정보는 상기 인 식 모델에 의해 상기 전기적 소리 신호에 포함되는 것으로 인식된 소리 요소들 각각이 상기 작업 소음, 안전 소 음 및 목소리 소음 중에서 어느 하나로 분류되어 생성되고, 상기 상쇄 신호는 상기 작업 소음으로 분류된 소리 요소와 크기는 같지만 파형은 반대인 역 위상 신호인, 컴퓨터-판독 가능 매체에 저장된 컴퓨터 프로그램이 제공 된다. 전술한 것 외의 다른 측면, 특징, 이점이 이하의 도면, 청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2023-0133582", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 방음 귀덮개를 착용하고 소음이 심한 작업장에서 작업하는 현장 작업자들에게 작업 소음과 같이 유해한 소음은 차단하되, 크레인이나 지게차 등인 이동형 위험 설비의 접근 경고음이나 작동 사이 렌은 들리도록 함으로써, 현장 작업자의 청각 질환 및 스트레스를 감소시키면서도 안전 사고 예방에 기여하는 효과가 있다. 또한, 작업하는 현장 작업자가 방음 귀덮개를 착용하고 작업할지라도 주변에서 작업하는 다른 현장 작업자들과 의 협업을 위한 목소리나 구조 신호 등은 들리도록 함으로써, 원활한 협력 작업이 가능할 뿐 아니라, 주변의 위 급 상황 발생시 신속한 대응 처리가 가능해지는 효과도 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2023-0133582", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0133582", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아 니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도 2는 본 발명의 일 실시예에 따른 방음 귀덮개의 블록 구성도이고, 도 3은 본 발명의 일 실시예에 따른 방음 귀덮개의 동작 관계를 설명하기 위한 도면이다. 도 2 및 도 3을 참조하면, 작업 환경에 적응적으로 동작하는 방음 귀덮개는 수음부, 작업 소음 제거 유닛 및 스피커부를 포함할 수 있다. 도 2에는 방음 귀덮개가 현장 작업자의 머리에 걸어주는 걸이부가 양측의 덮개부를 연결되도록 형성된 형상으로 도시되었으나, 방음 귀덮개의 형상은 현장 작업자의 양쪽 귀를 덮는 양측의 덮개부 가 안전모에 고정 설치(도 1 참조)되는 등으로 형상이 다양할 수 있다. 방음 귀덮개의 구성으로서 전술한 수음부, 소음 인식부, 적응적 제거부, 소음신호 DB 및 스피커부 각각은 걸이부 혹은 덮개부의 필요 위치에 배치될 수 있다. 수음부는 외부로부터 소리(즉, 소리 음파)를 유입받아 전기적 소리 신호로 출력한다. 수음부는 예를 들어 마이크로폰일 수 있고, 덮개부에 하나 이상으로 배치될 수 있다. 작업 소음 제거 유닛은 소음 인식부, 적응적 처리부 및 소음신호 DB를 포함할 수 있다. 여기서, 작업 소음 제거 유닛의 하나 이상의 구성 요소(예를 들어, 소음 인식부, 적응적 처리부 등) 는 지정된 역할을 수행하는 일종의 모듈로 구현될 수 있다. 여기서, 모듈은 예를 들어 소프트웨어 형태로 구현 되거나, FPGA(Field Programmable Gate Array) 또는 주문형 반도체(ASIC, Application Specific Integrated Circuit) 등과 같은 하드웨어 구성으로 구현되거나, 이들의 조합으로 구현될 수 있다. 물론, 모듈은 소프트웨어 또는 하드웨어에 한정되지 않고, 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고, 하나 또는 그 이상 의 프로세서들을 실행시키도록 구성될 수도 있다. 구성요소들과 모듈들에서 제공되는 기능은 더 적은 수의 구성 요소들 및 모듈들로 결합되거나 추가적인 구성요소들과 모듈들로 더 분리될 수도 있다. 소음 인식부는 수음부에서 제공되는 외부 소리에 상응하는 전기적 소리 신호를 미리 기계 학습된 인 식 모델에 적용하여, 외부 소리를 구성하는 소리 요소들에 관한 인식 모델의 인식 결과에 상응하는 소리 요소 인식 정보를 생성한다. 여기서, 인식 모델은 작업장에서 발생되는 다양한 소리 요소들을 미리 기계 학습한 후, 수음부에서 제공되는 전기적 소리 신호가 어떤 소리 요소들로 구성되었는지에 관한 인식 결과를 제공하도록, 인공지능 기반 의 내장형 AI 모듈로 구현될 수 있다. 이를 위해, 인식 모델은 소리 요소들 각각에 대한 기계 학습도 진행 하며, 둘 이상의 소리 요소가 조합된 다양한 경우에 대해서도 기계 학습을 진행할 수 있다. 인식 모델이 기계 학습되는 소리 요소들은 작업장에서 발생되는 다양한 소리들이며, 예를 들어 부재간의 충돌음, 사상 작업 소음, 용접 작업 소음, 가우징 작업 소음, 작업자/요구조자 목소리, 구조 신호, 크레인 작동 사이렌, 지게차 접근 경고음, 트랜스포트 접근 경고음 등으로 다양할 수 있다. 인식 모델은 예를 들어 완전 합성곱 신경망(Fully Convolutional Neural network), 합성곱 신경망 (Convolutional Neural Network), 순환 신경망(Recurrent Neural Network), 제한 볼츠만 머신(Restricted Boltzmann Machine), 심층 신뢰 신경망(Deep Belief neural Network) 등 중 하나 이상의 딥러닝 기반의 모델로 생성될 수도 있다. 물론, 딥러닝 기법 이외의 머신 러닝 기법으로 구현되거나, 딥러닝 기법과 머신 러닝 기법이 결합된 하이브리드 형태의 모델로 생성될 수도 있다. 또한, 인식 모델을 학습하는 방법도 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning) 등으로 다양할 수 있다. 소음 인식부는 인식 모델의 인식 결과에 따른 소리 요소들을 미리 지정된 기준에 따라 분류하여 소리 요소 인식 정보를 생성할 수 있다(도 3 참조). 예를 들어, 소음 인식부는 인식 모델이 인식한 소리 요소들 각각을 작업 소음, 안전 소음 및 목소리 소음으로 분류하여 소리 요소 인식 정보를 생성하도록 미리 설정될 수 있다. 여기서, 작업 소음은 예를 들어 부재간의 충돌음, 사상 작업 소음, 용접 작업 소음, 가우징 작업 소음 등과 같 이, 현장 작업자의 청각 질환과 스트레스만을 가중시키는 소음으로 미리 설정될 수 있다. 이와 달리, 안전 소음은 예를 들어 크레인 작동 사이렌, 지게차 접근 경고음, 트랜스포트 접근 경고음, 구조 신 호 등과 같이, 현장 작업자의 안전 사고를 예방할 목적으로 주의를 환기시키는 소음으로 미리 설정될 수 있다. 또한, 목소리 소음은 예를 들어 주변에서 작업하는 다른 현장 작업자의 목소리나 구조를 요하는 다른 현장 작업 자의 목소리 등과 같이, 다른 현장 작업자들과의 협력 작업을 의도하거나, 구조를 요청하는 소음으로 미리 설정 될 수 있다. 물론, 목소리 소음은 목소리뿐 아니라, 작업 소음이나 안전 소음과 같이 반복성을 가지지 않아 특 별히 제거될 필요가 없는 다른 소음들이 모두 포함되도록 미리 설정될 수도 있음은 당연하다. 적응적 처리부는 소음 인식부로부터 제공된 소리 요소 인식 정보를 이용하여, 수음부로부터 입 력되는 외부 소리에 상응하는 전기적 소리 신호에서 작업 소음을 제거한다. 작업 소음은 예를 들어 부재간의 충 돌음, 사상 작업 소음, 용접 작업 소음, 가우징 작업 소음 등일 수 있다. 적응적 처리부는 소음 요소 인식 정보에 포함된 작업 소음에 속하는 소리 요소들 각각에 상응하는 상쇄 신 호를 소음신호 DB에서 추출하고, 추출된 상쇄 신호를 전기적 소리 신호에 더함으로써 전기적 소리 신호에 서 작업 소음에 속하는 소리 요소들을 상쇄 처리한다. 소음신호 DB에 미리 저장된 상쇄 신호는 예를 들어 작업장에서 발생되는 소음들 중에서 반복적으로 발생되 는 작업 소음에 해당되는 소리 요소와 크기는 같지만 파형은 반대인 역 위상 신호(antiphase signal)일 수 있다. 또한, 적응적 처리부는 소음 요소 인식 정보에 포함된 안전 소음과 목소리 소음은 증폭하여 스피커부(10 9)를 통해 출력되도록 할 수도 있다. 이를 위해, 적응적 처리부는 상쇄 신호를 적용하여 작업 소음이 상쇄된 전기적 소리 신호를 증폭하는 증폭 기(도시되지 않음)로 입력할 수 있으며, 증폭기에 의해 증폭된 전기적 소리 신호가 스피커부를 통해 출력 된다. 이때, 증폭기에서 수행하는 신호 증폭의 크기는 미리 설정되거나, 방음 귀덮개를 착용한 현장 작업 자에 의해 조절될 수 있을 것이다. 도시되지는 않았으나, 방음 귀덮개에는 음성 안내부가 더 포함될 수도 있다. 음성 안내부는 소음 인식부에서 생성한 소리 요소 인식 정보를 참조하여, 소리 요소 인식 정보의 안전 소 음에 포함된 소리 요소들을 인식하고, 인식된 소리 요소에 대한 안내 멘트가 스피커부를 통해 출력되도록 처리할 수 있다. 예를 들어, 소리 요소 인식 정보의 안전 소음으로 크레인 작동 사이렌이 포함된 경우, 음성 안 내부는 '주변에서 크레인이 작동중입니다. 작업에 주의하세요' 등의 안내 멘트가 스피커부를 통해 출력되 도록 처리할 수 있다. 이를 위해, 소리 요소 인식 정보의 안전 소음으로 포함 가능한 소리 요소에 대한 안내 멘트가 저장부(도시되지 않음)에 미리 저장될 수 있다. 도 4는 본 발명의 일 실시예에 따른 환경 적응적 소음 제거 방법을 나타낸 순서도이다. 도 4를 참조하면, 단계 410에서, 방음 귀덮개의 수음부를 통해 외부의 소리(즉, 소리 음파)가 유입되 어 전기적 소리 신호로 출력된다. 단계 420에서, 작업 소음 제거 유닛은 외부 소리에 상응하도록 수음부에서 제공되는 전기적 소리 신호를 미리 기계 학습된 인식 모델에 적용하여, 전기적 소리 신호를 구성하는 소리 요소들을 각각 인식한다. 여기서, 인식 모델은 작업장에서 발생되는 다양한 소리 요소들을 미리 기계 학습한 후, 수음부에서 제공되는 전기적 소리 신호가 어떤 소리 요소들로 구성되었는지에 관한 인식 결과를 제공하도록, 인공지능 기반 의 내장형 AI 모듈로 구현될 수 있다. 이를 위해, 인식 모델은 소리 요소들 각각에 대한 기계 학습도 진행 하며, 둘 이상의 소리 요소가 조합된 경우에 대해서도 기계 학습을 진행할 수 있다. 인식 모델에 의해 각각 인식되는 소리 요소들은 예를 들어 부재간의 충돌음, 사상 작업 소음, 용접 작업 소음, 가우징 작업 소음, 작업자/요구조자 목소리, 구조 신호, 크레인 작동 사이렌, 지게차 접근 경고음, 트랜 스포트 접근 경고음 등일 수 있다. 단계 430에서, 작업 소음 제거 유닛은 전기적 소리 신호를 인식한 인식 모델의 인식 결과에 상응하는 소리 요소 인식 정보를 생성한다. 이때, 작업 소음 제거 유닛은 인식 모델에 의해 인식된 소리 요소들을 작업 소음(예를 들어, 부재간의 충돌음, 사상 작업 소음, 용접 작업 소음, 가우징 작업 소음 등), 안전 소음(예를 들어, 크레인 작동 사이렌, 지게차 접 근 경고음, 트랜스포트 접근 경고음, 구조 신호 등) 및 목소리 소음(예를 들어, 주변에서 작업하는 다른 현장 작업자의 목소리, 구조를 요하는 다른 현장 작업자의 목소리 등)으로 분류하여 소리 요소 인식 정보를 생성할수 있다. 단계 440에서, 작업 소음 제거 유닛은 소리 요소 인식 정보에 작업 소음으로 분류된 소리 요소들에 대응되는 상 쇄 신호를 소음신호 DB에서 추출하고, 추출된 상쇄 신호를 수음부에서 제공된 전기적 소리 신호에 합 성하여, 전기적 소리 신호에서 작업 신호를 상쇄 처리한다. 소음신호 DB에 미리 저장된 상쇄 신호는 예를 들어 작업장에서 발생되는 소음들 중에서 반복적으로 발생되 는 작업 소음에 해당되는 소리 요소와 크기는 같지만 파형은 반대인 역 위상 신호(antiphase signal)일 수 있다. 작업 신호가 상쇄 처리된 전기적 소리 신호는 스피커부를 통해 출력되어, 방음 귀덮개를 착용한 현장 작업자에게 제공된다(단계 450). 작업 신호가 상쇄 처리된 전기적 소리 신호는 안전 소음과 목소리 소음을 포함하고 있으며, 스피커부를 통 해 출력되기 이전에 증폭기에 의해 미리 지정된 또는 현장 작업자에 의해 조절된 증폭 크기로 증폭 처리될 수도 있음은 당연하다. 전술한 바와 같이, 환경 적응형 방음 귀덮개 및 환경 적응적 소음 제거 방법은, 방음 귀덮개를 착용하고 소음이 심한 작업장에서 작업하는 현장 작업자들에게 작업 소음과 같이 유해한 소음은 차단하되, 크레인이나 지 게차 등인 이동형 위험 설비의 접근 경고음이나 작동 사이렌은 들리도록 하여, 현장 작업자의 청각 질환 및 스트레스를 감소시키면서도 안전 사고 예방에 기여하는 특징이 있다. 또한, 작업하는 현장 작업자가 방음 귀덮개를 착용하고 작업할지라도 주변에서 작업하는 다른 현장 작업자들과 의 협업을 위한 목소리나 구조 신호 등은 들리도록 하여, 원활한 협력 작업이 가능할 뿐 아니라, 주변의 위급 상황 발생시 신속한 대응 처리가 가능해지는 특징도 있다. 본 발명의 실시예에 따르면, 방음 귀덮개를 착용하고 소음이 심한 작업장에서 작업하는 현장 작업자들에게 작업 소음과 같이 유해한 소음은 차단하되, 크레인이나 지게차 등인 이동형 위험 설비의 접근 경고음이나 작동 사이 렌은 들리도록 함으로써, 현장 작업자의 청각 질환 및 스트레스를 감소시키면서도 안전 사고 예방에 기여하는 효과가 있다. 상기에서는 본 발명의 실시예를 참조하여 설명하였지만, 해당 기술 분야에서 통상의 지식을 가진 자라면 하기의 청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변 경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0133582", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 작업장에서 이동형 위험 설비에 의한 안전 사고 발생 사례를 예시한 도면. 도 2는 본 발명의 일 실시예에 따른 방음 귀덮개의 블록 구성도. 도 3은 본 발명의 일 실시예에 따른 방음 귀덮개의 동작 관계를 설명하기 위한 도면. 도 4는 본 발명의 일 실시예에 따른 환경 적응적 소음 제거 방법을 나타낸 순서도."}
