{"patent_id": "10-2021-0193248", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0102823", "출원번호": "10-2021-0193248", "발명의 명칭": "가변 매칭 회로를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "허원형"}}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서,상기 가변 매칭 회로는:상기 제1 선로의 제1 지점에서 분기되는 제2 선로를 통해 상기 전자 부품과 전기적으로 연결되는 스위치;상기 스위치 및 상기 접지부에 전기적으로 연결되는 제3 선로;상기 스위치 및 상기 접지부에 전기적으로 연결되는 제4 선로;상기 제3 선로에 직렬 연결되는 제1 엘리먼트;상기 제1 엘리먼트 및 상기 접지부 사이에서 상기 제3 선로에 병렬 연결되는 제2 엘리먼트;상기 제4 선로에 직렬 연결되는 제3 엘리먼트; 및상기 제3 엘리먼트 및 상기 접지부 사이에서 상기 제4 선로에 병렬 연결되는 제4 엘리먼트;를 포함하고, 상기 스위치는 상기 전자 부품을 상기 제3 선로 또는 제4 선로에 선택적으로 전기적으로 연결하도록 구성되고상기 전자 부품이 상기 스위치를 통해 상기 제1 엘리먼트 및 상기 제2 엘리먼트에 전기적으로 연결되는 경우,상기 전자 부품은 제1 주파수에 해당하는 자체 공진 주파수를 가지고,상기 전자 부품이 상기 스위치를 통해 상기 제3 엘리먼트 및 상기 제4 엘리먼트에 전기적으로 연결되는 경우,상기 전자 부품은 상기 제1 주파수와 상이한 제2 주파수에 해당하는 자체 공진 주파수를 갖는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 가변 매칭 회로에 의해 변경된 상기 전자 부품의 자체 공진 주파수는 상기 무선 통신 신호의 주파수 대역과 중첩되지 않는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,전력 관리 회로를 포함하고,상기 가변 매칭 회로는 제1 엘리먼트 및 제2 엘리먼트를 포함하고,상기 제1 엘리먼트의 제1 단자는 상기 제1 선로의 제1 지점에서 분기되는 제2 선로를 통해 상기 전자 부품에 전기적으로 연결되고,상기 제1 엘리먼트의 제2 단자는 상기 제2 엘리먼트에 전기적으로 연결되고,상기 제2 엘리먼트의 제1 단자는 상기 제1 엘리먼트 및 상기 전력 관리 회로에 전기적으로 연결되고,상기 제2 엘리먼트의 제2 단자는 상기 접지부에 전기적으로 연결되고,상기 제2 엘리먼트는 상기 전력 관리 회로로부터 인가되는 전압에 따라 상이한 커패시턴스(capacitance)를갖는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 제1 엘리먼트는 캐패시터를 포함하고,상기 제2 엘리먼트는 버랙터(varactor)를 포함하는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 제1 선로에서 상기 제1 지점 및 상기 접지부 사이에 배치되는 비드(bead) 또는 인덕터(inductor)를 포함하는, 전자 장치. 공개특허 10-2023-0102823-3-청구항 6"}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 제1 엘리먼트는 제1 인덕터를 포함하고,상기 제2 엘리먼트는 제1 캐패시터를 포함하고,상기 제3 엘리먼트는 제2 인덕터를 포함하고,상기 제4 엘리먼트는 제2 캐패시터를 포함하는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 하우징의 적어도 일부는 상기 안테나의 상기 도전성 부분을 포함하는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 6에 있어서,상기 가변 매칭 회로는, 상기 스위치 및 상기 접지부와 전기적으로 연결되는 복수의 럼프드 엘리먼트(lumpedelement)를 포함하는 매칭 회로를 포함하고,상기 스위치는, 상기 전자 부품에 상기 제3 선로, 상기 제4 선로, 또는 상기 매칭 회로를 선택적으로 전기적으로 연결하도록 구성되고,상기 전자 부품이 상기 스위치를 통해 상기 매칭 회로와 전기적으로 연결된 경우, 상기 전자 부품은 상기 제1주파수 및 상기 제2 주파수와 상이한 제3 주파수에 해당하는 자체 공진 주파수를 갖는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 제1 주파수는 상기 제2 주파수보다 작고,공개특허 10-2023-0102823-4-상기 제3 주파수는 상기 제1 주파수보다 작은, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 6에 있어서,상기 가변 매칭 회로는 플로팅 단자(floating terminal)를 포함하고,상기 스위치는 상기 전자 부품을 상기 제3 선로, 상기 제4 선로, 또는 상기 플로팅 단자에 선택적으로 전기적으로 연결하도록 구성되고,상기 전자 부품이 상기 스위치를 통해 상기 플로팅 단자에 전기적으로 연결된 경우, 상기 전자 부품은 상기 제1주파수 및 상기 제2 주파수보다 작은 제3 주파수에 해당하는 자체 공진 주파수를 갖는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 6에 있어서,상기 제1 선로에서, 상기 제1 지점 및 상기 접지부 사이에 배치되는 비드 또는 인덕터를 포함하는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 1에 있어서,상기 전자 부품은 상기 제1 선로를 통해 상기 접지부에 전기적으로 연결되는 그라운드 단자(ground terminal)를포함하는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,상기 그라운드 단자는 아날로그 그라운드 단자인 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 1에 있어서,상기 전자 부품은 적어도 하나의 카메라를 포함하는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치에 있어서,도전성 부분을 포함하는 하우징;상기 도전성 부분을 포함하는 안테나;상기 하우징 내에 배치되고, 도전성 레이어를 적어도 부분적으로 포함하는 접지부를 포함하는 인쇄 회로 기판;상기 안테나에 인접하도록 상기 하우징 내에 배치되고, 제1 선로를 통해 상기 인쇄 회로 기판의 상기 접지부에전기적으로 연결되는 전자 부품;상기 제1 선로 및 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결되는 가변 매칭 회로; 및상기 안테나를 이용하여 무선 통신 신호를 송신하도록 설정되는 무선 통신 회로;상기 전자 부품, 상기 가변 매칭 회로, 및 상기 무선 통신 회로와 작동적으로 연결되는 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는:상기 안테나 및 상기 전자 부품이 모두 동작 중인 지 여부를 판단하고, 상기 판단에 기반하여 상기 안테나를 이용하여 통신 중인 주파수 대역과 상기 전자 부품의 자체 공진 주파수가중첩되지 않도록, 상기 가변 매칭 회로를 이용하여 상기 전자 부품의 자체 공진 주파수를 변경하도록 설정되는,공개특허 10-2023-0102823-5-전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 적어도 하나의 프로세서는:상기 안테나를 이용하여 통신 중인 주파수 대역과 상기 전자 부품의 제1 주파수에 해당하는 자체 공진 주파수가중첩되는 지 여부를 결정하고,상기 결정에 기반하여 상기 가변 매칭 회로를 제어하도록 설정되는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 적어도 하나의 프로세서는:상기 안테나를 이용하여 통신 중인 주파수 대역과 상기 전자 부품의 자체 공진 주파수가 중첩되는 경우, 상기가변 매칭 회로로 하여금 상기 주파수 대역과 중첩되지 않도록 상기 전자 부품의 자체 공진 주파수를 변경하도록 하고, 또는상기 안테나를 이용하여 통신 중인 주파수 대역과 상기 전자 부품의 자체 공진 주파수가 중첩되지 않는 경우,상기 전자 부품의 자체 공진 주파수를 유지하도록 설정되는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서,전력 관리 회로를 포함하고,상기 가변 매칭 회로는 캐패시터(capacitor) 및 버랙터(varactor)를 포함하고,상기 캐패시터의 제1 단자는 상기 제1 선로의 제1 지점에서 분기되는 제2 선로를 통해 상기 전자 부품에 전기적으로 연결되고,상기 캐패시터의 제2 단자는 상기 버랙터에 전기적으로 연결되고,상기 버랙터의 제1 단자는 상기 캐패시터 및 상기 전력 관리 회로에 전기적으로 연결되고,상기 버랙터의 제2 단자는 상기 접지부에 전기적으로 연결되고,상기 전력 관리 회로와 작동적으로 연결되는 상기 적어도 하나의 프로세서는, 상기 전자 부품의 자체 공진 주파수를 변경하기 위해 상기 전력 관리 회로를 이용하여 상기 버랙터에 가변 전압을 인가하도록 설정되는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 1에 있어서,상기 가변 매칭 회로는:상기 제1 선로 및 상기 제1 선로에서 분기되는 제2 선로를 상기 전자 부품에 전기적으로 연결되는 스위치;상기 스위치 및 상기 접지부에 전기적으로 연결되는 제1 매칭 회로;상기 스위치 및 상기 접지부에 전기적으로 연결되는 제2 매칭 회로; 및 상기 스위치에 전기적으로 연결되는 플로팅 단자를 포함하고,상기 스위치는 상기 전자 부품을 상기 제1 매칭 회로, 상기 제2 매칭 회로, 또는 상기 플로팅 단자에 전기적으로 연결하도록 구성되고, 상기 스위치와 작동적으로 연결된 상기 적어도 하나의 프로세서는, 공개특허 10-2023-0102823-6-상기 전자 부품이 제1 주파수에 해당하는 자체 공진 주파수를 갖도록, 상기 전자 부품이 상기 플로팅 단자와 전기적으로 연결되도록 상기 스위치를 제어하거나,상기 전자 부품이 상기 제1 주파수보다 높은 제2 주파수에 해당하는 자체 공진 주파수를 갖도록, 상기 전자 부품이 상기 제1 매칭 회로와 전기적으로 연결되도록 상기 스위치를 제어하거나, 또는 상기 전자 부품이 상기 제2 주파수보다 높은 제3 주파수에 해당하는 자체 공진 주파수를 갖도록, 상기 전자 부품이 상기 제2 매칭 회로와 전기적으로 연결되도록 상기 스위치를 제어하도록 설정되는, 전자 장치."}
{"patent_id": "10-2021-0193248", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 전자 장치는, 하우징, 도전성 부분을 포함하는 안테나, 상기 하우징 내에 배치되고, 도전 성 레이어를 적어도 부분적으로 포함하는 접지부를 포함하는 인쇄 회로 기판, 상기 안테나에 인접하도록 상기 하 우징 내에 배치되고, 제1 선로를 통해 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결되는 전자 부품, 상 기 제1 선로 및 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결되는 가변 매칭 회로, 및 상기 안테나를 이용하여 무선 통신 신호를 송신하도록 설정되는 적어도 하나의 프로세서를 포함하고, 상기 가변 매칭 회로는, 상기 전자 부품의 자체 공진 주파수를 변경 가능하도록 구성될 수 있다. 이 외에도 다양한 실시 예가 가능하다."}
{"patent_id": "10-2021-0193248", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 실시 예들은, 가변 매칭 회로를 포함하는 전자 장치에 관련된다."}
{"patent_id": "10-2021-0193248", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 폰과 같은 전자 장치는 사용자에게 다양한 기능을 제공하기 위한 다양한 전자 부품들을 포함할 수 있다. 예를 들어, 전자 장치는 전화 통화, 사용자 간 데이터 송수신, 웹 서핑 등의 기능을 제공하기 위해 무선 통신을 수행하는 안테나들을 포함할 수 있다. 상기 안테나들은 예를 들어 전자 장치의 상단과 하단에 각각 마련될 수 있다. EN-DC(E-UTRA-NR dual connectivity) 또는 LTE CA(carrier aggregation)와 같이 복수의 안테나들을 이용한 무선 통신 기술이 개발됨 에 따라 전자 장치의 상하단 안테나의 동시 송출 동작이 요구되는 상황이 증가되고 있다."}
{"patent_id": "10-2021-0193248", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는 안테나 이외에도 다양한 전자 부품들을 포함할 수 있다. 예를 들어, 전자 장치는 카메라를 포함할 수 있다. 카메라와 같은 전자 장치의 전자 부품은 예를 들어 상단 안테나에 인접하게 배치될 수 있다. 이 경우 전자 장치의 상단 안테나로부터 송출되는 신호가 해당 전자 부품에 유기될 수 있고, 이는 안테나 및 전자 부품 의 성능 모두에 악영향을 미칠 수 있다. 노이즈의 유기를 방지하기 위해 절연체 또는 도전성 물질로 형성되어 해당 전자 부품을 둘러싸는 차폐 구조를 통해 노이즈(noise)의 유기를 차단하거나 노이즈를 전자 부품이 아닌 다른 곳으로 유도하는 방법이 적용될 수 있다. 그러나 이러한 차폐 구조를 적용하더라도 전자 부품 자체의 공진 주파수가 안테나가 송출하는 신호의 주파수 또는 그 배수 주파수와 겹치게 되는 경우, 스퓨리어스(spurious) 성 분 또는 다른 노이즈 성분이 해당 전자 부품으로 유입될 수 있다. 이로 인해 해당 전자 부품이 오작동할 수 있 고, 다른 안테나의 성능이 저하될 수 있다. 본 개시에 따르면, 안테나 및 상기 안테나와 인접한 전자 부품 사이의 격리도(isolation)를 향상시킬 수 있는, 가변 매칭 회로를 포함하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2021-0193248", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 전자 장치는, 하우징, 도전성 부분을 포함하는 안테나, 상기 하우징 내에 배치되 고, 도전성 레이어를 적어도 부분적으로 포함하는 접지부를 포함하는 인쇄 회로 기판, 상기 안테나에 인접하도 록 상기 하우징 내에 배치되고, 제1 선로를 통해 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결되는 전 자 부품, 상기 제1 선로 및 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결되는 가변 매칭 회로, 및 상 기 안테나를 이용하여 무선 통신 신호를 송신하도록 설정되는 적어도 하나의 프로세서를 포함하고, 상기 가변 매칭 회로는, 상기 전자 부품의 자체 공진 주파수를 변경 가능하도록 구성될 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는, 도전성 부분을 포함하는 하우징, 상기 도전성 부분을 포함하는 안테 나, 상기 하우징 내에 배치되고, 도전성 레이어를 적어도 부분적으로 포함하는 접지부를 포함하는 인쇄 회로 기 판, 상기 안테나에 인접하도록 상기 하우징 내에 배치되고, 제1 선로를 통해 상기 인쇄 회로 기판의 상기 접지 부에 전기적으로 연결되는 전자 부품, 상기 제1 선로 및 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결 되는 가변 매칭 회로, 및 상기 안테나를 이용하여 무선 통신 신호를 송신하도록 설정되는 무선 통신 회로, 상기 전자 부품, 상기 가변 매칭 회로, 및 상기 무선 통신 회로와 작동적으로 연결되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는, 상기 안테나 및 상기 전자 부품이 모두 동작 중인 지 여부를 판단하고, 상기 판단에 기반하여 상기 안테나를 이용하여 통신 중인 주파수 대역과 상기 전자 부품의 자체 공진 주파수가 중첩되지 않도록, 상기 가변 매칭 회로를 이용하여 상기 전자 부품의 자체 공진 주파수를 변경하도록 설정될 수 있다."}
{"patent_id": "10-2021-0193248", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 실시 예들에 따르면, 안테나 및 상기 안테나와 인접한 전자 부품 사이의 격리도(isolatio n)를 향상시킬 수 있다. 본 문서에 개시되는 실시 예들에 따르면, 가변 매칭 회로를 이용하여 안테나 및 상기 안테나와 인접한 전자 부 품 사이의 격리도를 향상시킬 수 있다. 본 문서에 개시되는 실시 예들에 따르면, 가변 매칭 회로를 통해 전자 부품의 자체 공진 주파수를 변경함으로써 안테나 및 상기 안테나와 인접한 전자 부품 사이의 격리도를 향상시킬 수 있다. 본 문서에 개시되는 실시 예들에 따르면, 안테나 및 상기 안테나에 인접한 전자 부품 사이의 격리도를 향상시킴 으로써, 전자 부품의 오작동을 방지 및/또는 감소시킬 수 있고 안테나 성능을 향상시킬 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2021-0193248", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도 1은 일 실시 예에 따른 전자 장치를 나타내는 도면이다. 도 1을 참조하면, 일 실시 예에 따른 전자 장치는, 전자 장치의 외관을 형성하는 하우징을 포함할 수 있다. 예를 들어, 하우징은 제1 면(또는 전면)(100A), 제2 면(또는 후면)(100B), 및 제1 면(100A) 및 제2 면 (100B) 사이의 공간을 둘러싸는 제3 면(또는 측면)(100C)을 포함할 수 있다. 일 실시 예에서, 하우징은, 제1 면 (100A), 제2 면(100B) 및/또는 제3 면(100C)들 중 적어도 일부를 형성하는 구조(예: 도 2의 프레임 구조(14 0))를 지칭할 수도 있다. 일 실시 예에 따른 전자 장치는, 실질적으로 투명한 전면 플레이트를 포함할 수 있다. 일 실시 예에 서, 전면 플레이트는 제1 면(100A)의 적어도 일부를 형성할 수 있다. 일 실시 예에서, 전면 플레이트(10 2)는, 예를 들어, 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트를 포함할 수 있으 나, 이에 제한되는 것은 아니다. 일 실시 예에 따른 전자 장치는, 실질적으로 불투명한 후면 플레이트를 포함할 수 있다. 일 실시 예 에서, 후면 플레이트는 제2 면(100B)의 적어도 일부를 형성할 수 있다. 일 실시 예에서, 후면 플레이트 는 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 일 실시 예에 따른 전자 장치는 측면 베젤 구조(또는 측면 부재)(예: 도 2의 프레임 구조의 측 벽)를 포함할 수 있다. 일 실시 예에서, 측면 베젤 구조는 전면 플레이트 및/또는 후면 플레이 트와 결합되어, 전자 장치의 제3 면(100C)의 적어도 일부를 형성할 수 있다. 예를 들어, 측면 베젤 구조는 전자 장치의 제3 면(100C)을 전부 형성할 수도 있고, 다른 예를 들어, 측면 베젤 구조는 전면 플레이트 및/또는 후면 플레이트와 함께 전자 장치의 제3 면(100C)을 형성할 수도 있다. 도시된 실시 예와 달리, 전자 장치의 제3 면(100C)이 전면 플레이트 및/또는 후면 플레이트에 의해 부분적으로 형성되는 경우, 전면 플레이트 및/또는 후면 플레이트는 그 가장자리에서 후면 플레 이트 및/또는 전면 플레이트를 향하여 휘어져 심리스하게(seamless) 연장되는 영역을 포함할 수 있다. 상기 전면 플레이트 및/또는 후면 플레이트의 상기 연장되는 영역은, 예를 들어, 전자 장치 의 긴 엣지(long edge)의 양단에 위치할 수 있으나, 상술한 예에 의해 제한되는 것은 아니다. 일 실시 예에서, 측면 베젤 구조는 금속 및/또는 폴리머를 포함할 수 있다. 일 실시 예에서, 후면 플레이 트 및 측면 베젤 구조는 일체로 형성될 수 있고, 동일한 물질(예: 알루미늄과 같은 금속 물질)을 포 함할 수 있으나, 이에 제한되는 것은 아니다. 예를 들어, 후면 플레이트 및 측면 베젤 구조는 별개의 구성으로 형성되거나 및/또는 서로 상이한 물질을 포함할 수도 있다. 일 실시 예에서, 전자 장치는 디스플레이, 오디오 모듈(103, 104, 107), 센서 모듈(미도시), 카메라 모듈(105, 112, 113), 키 입력 장치, 발광 소자(미도시), 및/또는 커넥터 홀 중 적어도 하나를 포함 할 수 있다. 다른 실시 예에서, 전자 장치는, 상기 구성요소들 중 적어도 하나(예: 키 입력 장치 또 는 발광 소자(미도시))를 생략하거나, 다른 구성요소를 추가적으로 포함할 수 있다. 일 실시 예에서, 디스플레이(예: 도 12의 디스플레이 모듈는 전면 플레이트의 상당 부분을 통 하여 시각적으로 노출될 수 있다. 예를 들어, 디스플레이의 적어도 일부는 제1 면(100A)을 형성하는 전면 플레이트를 통하여 보일 수 있다. 일 실시 예에서, 디스플레이는 전면 플레이트의 배면에 배치 될 수 있다. 일 실시 예에서, 디스플레이의 외곽 형상은, 디스플레이에 인접한 전면 플레이트의 외곽 형상과 대체로 동일하게 형성될 수 있다. 일 실시 예에서, 디스플레이가 시각적으로 노출되는 면적을 확장하기 위 하여, 디스플레이의 외곽과 전면 플레이트의 외곽 간의 간격은 대체로 동일하게 형성될 수 있다. 일 실시 예에서, 디스플레이(또는 전자 장치의 제1 면(100A))는 화면 표시 영역(101A)을 포함할 수 있다. 일 실시 예에서, 디스플레이는 화면 표시 영역(101A)을 통해 사용자에게 시각적 정보를 제공할 수 있다. 도시된 실시 예에서는, 제1 면(100A)을 정면으로 바라보았을 때, 화면 표시 영역(101A)이 제1 면(100A)의 외곽과 이격되어 제1 면(100A)의 내측에 위치하는 것으로 도시되었으나, 이에 제한되는 것은 아니다. 다른 실시 예에서, 제1 면(100A)을 정면으로 바라보았을 때, 화면 표시 영역(101A)의 가장자리의 적어도 일부는 제1 면(100A)(또는 전면 플레이트)의 가장자리와 실질적으로 일치될 수도 있다. 일 실시 예에서, 화면 표시 영역(101A)은 사용자의 생체 정보를 획득하도록 구성된 센싱 영역(101B)을 포함할 수 있다. 여기서, \"화면 표시 영역(101A)이 센싱 영역(101B)을 포함함\"의 의미는 센싱 영역(101B)의 적어도 일 부가 화면 표시 영역(101A)에 겹쳐질 수 있는 것(overlapped)으로 이해될 수 있다. 예를 들어, 센싱 영역(101 B)은 화면 표시 영역(101A)의 다른 영역과 마찬가지로 디스플레이에 의해 시각 정보를 표시할 수 있고, 추 가적으로 사용자의 생체 정보(예: 지문)를 획득할 수 있는 영역을 의미할 수 있다. 다른 실시 예에서, 센싱 영 역(101B)은 키 입력 장치에 형성될 수도 있다. 일 실시 예에서, 디스플레이는 제1 카메라 모듈(예: 도 12의 카메라 모듈)이 위치하는 영역을 포함할 수 있다. 일 실시 예에서, 디스플레이의 상기 영역에는 개구부가 형성되고, 제1 카메라 모듈 (예: 펀치 홀 카메라)은 제1 면(100A)을 향하도록 상기 개구부 내에 적어도 부분적으로 배치될 수 있다. 이 경 우, 화면 표시 영역(101A)은 상기 개구부의 가장자리의 적어도 일부를 둘러쌀 수 있다. 다른 실시 예에서, 제1 카메라 모듈(예: 언더 디스플레이 카메라(under display camera, UDC))은 디스플레이의 상기 영역과 중첩되도록 디스플레이 아래에 배치될 수 있다. 이 경우, 디스플레이는 상기 영역을 통해 사용자에게 시각적 정보를 제공할 수 있고, 추가적으로 제1 카메라 모듈은 디스플레이의 상기 영역을 통해 제1 면(100A)을 향하는 방향에 대응되는 이미지를 획득할 수 있다. 일 실시 예에서, 디스플레이는, 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/또는 자기장 방식의 스타일러스 펜을 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 일 실시 예에서, 오디오 모듈(103, 104, 107)(예: 도 12의 오디오 모듈)은 마이크 홀(103, 104) 및 스피 커 홀을 포함할 수 있다. 일 실시 예에서, 마이크 홀(103, 104)은 제3 면(100C)의 일부 영역에 형성된 제1 마이크 홀 및 제2 면 (100B)의 일부 영역에 형성된 제2 마이크 홀을 포함할 수 있다. 마이크 홀(103, 104)의 내부에는 외부의 소리를 획득하기 위한 마이크(미도시)가 배치될 수 있다. 마이크는 소리의 방향을 감지할 수 있도록 복수개의 마이크를 포함할 수 있다. 일 실시 예에서, 제2 면(100B)의 일부 영역에 형성된 제2 마이크 홀은, 카메라 모듈(105, 112, 113)에 인 접하도록 배치될 수 있다. 예를 들어, 제2 마이크 홀은 카메라 모듈(105, 112, 113)의 동작에 따라 소리를 획득할 수 있다. 다만 이에 제한되는 것은 아니다. 일 실시 예에서, 스피커 홀은, 외부 스피커 홀 및 통화용 리시버 홀(미도시)을 포함할 수 있다. 외부 스피커 홀은 전자 장치의 제3 면(100C)의 일부에 형성될 수 있다. 다른 실시 예에서, 외부 스피커 홀 은 마이크 홀과 하나의 홀로 구현될 수 있다. 도시되지 않았으나, 통화용 리시버 홀(미도시)은 제3 면(100C)의 다른 일부에 형성될 수 있다. 예를 들어, 통화용 리시버 홀은, 제3 면(100C)에서 외부 스피커 홀 의 반대편에 형성될 수 있다. 예를 들어, 도 1의 도시를 기준으로, 외부 스피커 홀은 전자 장치(10 0)의 하단부에 해당하는 제3 면(100C)에 형성되고, 통화용 리시버 홀은 전자 장치의 상단부에 해당하는 제 3 면(100C)에 형성될 수 있다. 다만 이에 제한되는 것은 아니며, 다른 실시 예에서, 통화용 리시버 홀은 제3 면 (100C)이 아닌 위치에 형성될 수도 있다. 예를 들어, 통화용 리시버 홀은 전면 플레이트(또는, 디스플레이 )와 측면 베젤 구조 사이의 이격된 공간에 의해 형성될 수도 있다. 일 실시 예에서, 전자 장치는 외부 스피커 홀 및/또는 통화용 리시버 홀(미도시)을 통해 하우징의 외 부로 소리를 출력하도록 구성되는 적어도 하나의 스피커(미도시)를 포함할 수 있다. 일 실시 예에서, 센서 모듈(미도시)(예: 도 12의 센서 모듈)은, 전자 장치의 내부의 작동 상태, 또 는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 예를 들어, 센서 모듈은, 근접 센서, HRM 센서, 지문 센서, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 카메라 모듈(105, 112, 113)(예: 도 12의 카메라 모듈)은, 전자 장치의 제1 면 (100A)을 향하도록 배치된 제1 카메라 모듈, 제2 면(100B)을 향하도록 배치되는 제2 카메라 모듈, 및 플래시를 포함할 수 있다. 일 실시 예에서, 제2 카메라 모듈은 복수의 카메라들(예: 듀얼 카메라, 트리플 카메라 또는 쿼드 카메라) 를 포함할 수 있다. 다만, 제2 카메라 모듈이 반드시 복수의 카메라들을 포함하는 것으로 한정되는 것은 아니며, 하나의 카메라를 포함할 수도 있다. 일 실시 예에서, 제1 카메라 모듈 및 제2 카메라 모듈은, 하나 또는 복수의 렌즈들, 이미지 센서, 및 /또는 이미지 시그널 프로세서를 포함할 수 있다. 일 실시 예에서, 플래시는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 다 른 실시 예에서, 2개 이상의 렌즈들(적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 배치될 수 있다. 일 실시 예에서, 키 입력 장치(예: 도 12의 입력 모듈)는 전자 장치의 제3 면(100C)에 배치될 수 있다. 다른 실시 예에서, 전자 장치는 키 입력 장치 중 일부 또는 전부를 포함하지 않을 수 있고, 포함되지 않은 키 입력 장치는 디스플레이 상에 소프트 키와 같은 다른 형태로 구현될 수 있다. 일 실시 예에서, 커넥터 홀은 외부 장치의 커넥터가 수용될 수 있도록 전자 장치의 제3 면(100C)에 형성될 수 있다. 커넥터 홀 내에는 외부 장치의 커넥터와 전기적으로 연결되는 연결 단자(예: 도 12의 연 결 단자)가 배치될 수 있다. 일 실시 예에 따른 전자 장치는 상기 연결 단자를 통해 송수신되는 전 기적인 신호를 처리하기 위한 인터페이스 모듈(예: 도 12의 인터페이스)을 포함할 수 있다. 일 실시 예에서, 전자 장치는 발광 소자(미도시)를 포함할 수 있다. 예를 들어, 상기 발광 소자(미도시)는 하우징의 제1 면(100A)에 배치될 수 있다. 상기 발광 소자(미도시)는 전자 장치의 상태 정보를 광 형태로 제공할 수 있다. 다른 실시 예에서, 상기 발광 소자(미도시)는 제1 카메라 모듈의 동작과 연동되는 광원을 제공할 수 있다. 예를 들어, 상기 발광 소자(미도시)는, LED, IR LED 및/또는 제논 램프를 포함할 수 있다. 도 2는 일 실시 예에 따른 전자 장치의 분해 사시도이다. 이하에서, 전술한 구성과 동일한 참조 부호를 갖는 구성에 대해 중복되는 설명은 생략한다. 도 2를 참조하면, 일 실시 예에 따른 전자 장치는, 프레임 구조, 제1 인쇄 회로 기판, 제2 인쇄 회로 기판, 커버 플레이트, 및 배터리를 포함할 수 있다. 일 실시 예에서, 프레임 구조는, 전자 장치의 외관(예: 도 1의 제3 면(100C))을 형성하는 측벽 및 상기 측벽으로부터 내측으로 연장되는 지지 부분을 포함할 수 있다. 일 실시 예에서, 프레임 구조 는 디스플레이 및 후면 플레이트 사이에 배치될 수 있다. 일 실시 예에서, 프레임 구조의 측벽은 후면 플레이트 및 전면 플레이트(및/또는 디스플레이) 사이의 공간을 둘러쌀 수 있 고, 프레임 구조의 지지 부분은, 상기 공간 내에서 측벽으로부터 연장될 수 있다. 일 실시 예에서, 프레임 구조는 전자 장치에 포함된 다른 구성요소들을 지지하거나 수용할 수 있다. 예를 들어, 일 방향(예: +z 방향)을 향하는 프레임 구조의 일 면에는 디스플레이가 배치될 수 있고, 디스플레이는 프레임 구조의 지지 부분에 의해 지지될 수 있다. 다른 예를 들어, 프레임 구조 의 상기 일 방향과 반대 방향(예: -z 방향)을 향하는 타 면에는 제1 인쇄 회로 기판, 제2 인쇄 회로 기판, 배터리, 및 제2 카메라 모듈이 배치될 수 있다. 제1 인쇄 회로 기판, 제2 인쇄 회로 기판, 배터리 및 제2 카메라 모듈은 프레임 구조의 측벽 및/또는 지지 부분에 의해 정의되는 리세스에 각각 안착될 수 있다. 일 실시 예에서, 제1 인쇄 회로 기판, 제2 인쇄 회로 기판 및 배터리는 프레임 구조와 각 각 결합될 수 있다. 예를 들어, 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판은, 스크류(screw)와 같은 결합 부재를 통해, 프레임 구조에 고정 배치될 수 있다. 예를 들어, 배터리는 접착 부재(예: 양면 테 이프)를 통해 프레임 구조에 고정 배치될 수 있다. 그러나, 상술한 예에 의해 제한되는 것은 아니다. 일 실시 예에서, 커버 플레이트는 제1 인쇄 회로 기판 및 후면 플레이트 사이에 배치될 수 있다. 일 실시 예에서, 제1 인쇄 회로 기판 상에는 커버 플레이트가 배치될 수 있다. 예를 들어, 커 버 플레이트는 제1 인쇄 회로 기판의 -z 방향을 향하는 면에 배치될 수 있다. 일 실시 예에서, 커버 플레이트는, z 축을 기준으로, 제1 인쇄 회로 기판과 적어도 부분적으로 중첩 될 수 있다. 일 실시 예에서, 커버 플레이트는 제1 인쇄 회로 기판의 적어도 일부 영역을 덮을 수 있 다. 이를 통해, 커버 플레이트는 제1 인쇄 회로 기판을 물리적인 충격으로부터 보호하거나, 제1 인쇄 회로 기판에 결합된 커넥터(예: 도 3a의 커넥터)의 이탈을 방지할 수 있다. 일 실시 예에서, 커버 플레이트는, 결합 부재(예: 스크류)를 통해 제1 인쇄 회로 기판에 고정 배치되 거나, 또는 상기 결합 부재를 통해 제1 인쇄 회로 기판과 함께 프레임 구조에 결합될 수 있다. 일 실시 예에서, 디스플레이는 프레임 구조 및 전면 플레이트 사이에 배치될 수 있다. 예를 들 어, 디스플레이의 일 측(예: +z 방향)에는 전면 플레이트가 배치되고, 타 측(예: -z 방향)에는 프레 임 구조가 배치될 수 있다. 일 실시 예에서, 전면 플레이트는 디스플레이와 결합될 수 있다. 예를 들어, 전면 플레이트 및 디스플레이는, 그 사이에 개재되는 광학용 접착 부재(예: optically clear adhesive(OCA) 또는 optically clear resin(OCR))를 통해 서로 접착될 수 있다. 일 실시 예에서, 전면 플레이트는 프레임 구조와 결합될 수 있다. 예를 들어, 전면 플레이트는, z 축 방향으로 바라보았을 때, 디스플레이 바깥으로 연장되는 외곽부를 포함할 수 있고, 전면 플레이트 의 상기 외곽부와 프레임 구조(예: 측벽) 사이에 배치되는 접착 부재(예: 양면 테이프)를 통해, 프레임 구조와 접착될 수 있다. 다만 상술한 예에 의해 제한되는 것은 아니다. 일 실시 예에서, 제1 인쇄 회로 기판 및/또는 제2 인쇄 회로 기판에는, 프로세서(예: 도 12의 프로세 서), 메모리(예: 도 12의 메모리), 및/또는 인터페이스(예: 도 12의 인터페이스)가 장착될 수 있다. 프로세서는, 예를 들어, 중앙처리장치, 어플리케이션 프로세서, 그래픽 처리 장치, 이미지 시그널 프 로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서 중 하나 또는 그 이상을 포함할 수 있다. 메모리는, 예를 들어, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 및/또는 오디 오 인터페이스를 포함할 수 있다. 인터페이스는 전자 장치를 외부 전자 장치와 전기적 또는 물리적으로 연 결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 일 실시 예에서, 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판은 연결 부재(예: 연성 인쇄 회로 기판)를 통해 서로 작동 적으로 또는 전기적으로 연결될 수 있다. 일 실시 예에서, 배터리(예: 도 12의 배터리)는 전자 장치의 적어도 하나의 구성 요소에 전력 을 공급할 수 있다. 예를 들면, 배터리는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 배 터리의 적어도 일부는 제1 인쇄 회로 기판 및/또는 제2 인쇄 회로 기판과 실질적으로 동일 평면 상에 배치될 수 있다. 일 실시 예에 따른 전자 장치는, 안테나 모듈(미도시)(예: 도 12의 안테나 모듈)를 포함할 수 있다. 일 실시 예에서, 안테나 모듈은, 후면 플레이트와 배터리 사이에 배치될 수 있다. 안테나 모듈은, 예 를 들어, NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 안테나 모듈은, 예를 들어, 외부 장치와 근거리 통신을 하거나, 외부 장치와 전력을 무선으로 송수신 할 수 있다. 일 실시 예에서, 제1 카메라 모듈(예: 전면 카메라)은 렌즈가 전면 플레이트(예: 도 1의 전면(100 A))의 일부 영역(예: 카메라 영역)을 통해 외부 광을 수신할 수 있도록 프레임 구조의 적어도 일부 (예: 지지 부분)에 배치될 수 있다. 일 실시 예에서, 제2 카메라 모듈(예: 후면 카메라)은 프레임 구조 및 후면 플레이트 사이에 배 치될 수 있다. 일 실시 예에서, 제2 카메라 모듈은 연결 부재(예: 커넥터)를 통해 제1 인쇄 회로 기판 에 전기적으로 연결될 수 있다. 일 실시 예에서, 제2 카메라 모듈은 렌즈가 전자 장치의 후면 플레이트의 카메라 영역을 통해 외부 광을 수신할 수 있도록 배치될 수 있다. 일 실시 예에서, 카메라 영역은 후면 플레이트의 표면(예: 도 1의 후면(100B))에 형성될 수 있다. 일 실시 예에서, 카메라 영역은 제2 카메라 모듈의 렌즈로 외부의 광이 입사 될 수 있도록 적어도 부분 적으로 투명하게 형성될 수 있다. 일 실시 예에서, 카메라 영역의 적어도 일부는 후면 플레이트의 상 기 표면으로부터 소정의 높이로 돌출될 수 있다. 다만, 이에 한정되는 것은 아니며, 다른 실시 예에서, 카메라 영역은 후면 플레이트의 표면과 실질적으로 동일한 평면을 형성할 수도 있다. 일 실시 예에서, 전자 장치의 하우징은, 전자 장치의 외관의 적어도 일부를 형성하는 구성 또는 구조 를 의미할 수 있다. 이러한 점에서, 전자 장치의 외관을 형성하는 전면 플레이트, 프레임 구조, 및/또는 후면 플레이트 중 적어도 일부는 전자 장치의 하우징으로 참조될 수 있다. 도 3a는 일 실시 예에 따른 전자 장치를 나타내는 도면이다. 도 3b는 일 실시 예에 따른, 전자 부품과 상기 전자 부품이 연결되는 인쇄 회로 기판을 나타낸다. 도 4a은 전자 부품의 자체 공진 주파수(self-resonance frequency, SRF)를 나타내는 스미스 차트(smith char t)이다. 도 4b는 전자 부품의 S-파라미터(S11)를 나타내는 그래프이다. 도 3a를 참조하면, 일 실시 예에 따른 전자 장치(예: 도 2의 전자 장치)의 측벽은 제1 측벽 (141a), 제2 측벽(141b), 제3 측벽(141c), 및 제4 측벽(141d)을 포함할 수 있다. 제1 측벽(141a)은 제2 측벽 (141b)과 서로 마주볼 수 있다. 제3 측벽(141c)은 제4 측벽(141d)과 서로 마주볼 수 있다. 제3 측벽(141c)은 제 1 측벽(141a)의 일단부로부터 제2 측벽(141b)의 일단부까지 연장될 수 있다. 제4 측벽(141d)은 제1 측벽(141a) 의 타단부로부터 제2 측벽(141b)의 타단부까지 연장될 수 있다. 제1 내지 제4 측벽들(141a, 141b, 141c, 141 d)을 적어도 부분적으로 포함하는 프레임 구조의 형상은 실질적으로 직사각형일 수 있으나, 도시된 예에 의해 한정되는 것은 아니다. 일 실시 예에서, 프레임 구조의 측벽은 전기적으로 비 도전성 물질(예: 수지) 및/또는 전기적으로 도 전성 물질(예: 금속)을 포함할 수 있다. 측벽의 적어도 일부는 전자 장치의 안테나 구조를 형성할 수 있다. 예를 들어, 제1 측벽(141a)은 제1 비 도전성 부분(G1)에 의해 서로 이격된 제1 안테나(A1) 및 제2 안테나 (A2)를 형성할 수 있다. 다른 예를 들어, 제2 측벽(141b)이 제2 비 도전성 부분(G2)에 의해 서로 분리되어 제3 안테나(A3) 및 제4 안테나(A4)가 형성될 수 있다. 제3 안테나(A3)는 제2 측벽(141b)의 일부 및 상기 제2 측벽 (141b)의 일부로부터 연장되는 제3 측벽(141c)의 일부를 포함할 수 있다. 제4 안테나(A4)는 제2 측벽(141b)의 다른 일부를 포함할 수 있다. 제1 내지 제4 안테나들(A1, A2, A3, A4)에 해당하는 측벽의 부분들은 안테나 방사체로 동작하는 도전성 물질을 포함할 수 있다. 일 실시 예에 따른 전자 장치는 무선 통신 회로, 전자 부품, 가변 매칭 회로, 및 프로세서 를 포함할 수 있다. 일 실시 예에서, 무선 통신 회로(예: 도 12의 무선 통신 모듈)는 제1 인쇄 회로 기판 상에 배 치될 수 있다. 일 실시 예에서, 무선 통신 회로는 제1 내지 제4 안테나들(A1, A2, A3, A4)과 각각 전기적 으로 연결될 수 있다. 예를 들어, 무선 통신 회로는 제1 인쇄 회로 기판이 제공하는 도전성 트레이스 들(conductive traces) 및 상기 도전성 트레이스들과 전기적으로 연결되는 연결 부재(예: C-Clip, 동축 케이 블)를 통해 제1 내지 제4 안테나들(A1, A2, A3, A3)과 각각 전기적으로 연결될 수 있다. 일 실시 예에서, 무선 통신 회로는 제1 내지 제4 안테나들(A1, A2, A3, A4)을 이용하여, 지정된 대역의 무 선 신호를 송신 및/또는 수신할 수 있다. 예를 들어, 무선 통신 회로는 제2 안테나(A2) 및 제4 안테나(A 4)에 각각 급전하여, 지정된 대역의 무선 신호를 송신할 수 있다. 일 실시 예에서, 측벽에 의해 형성되는 제1 내지 제4 안테나들(A1, A2, A3, A4) 각각의 길이 및/또는 형상은 수신하고자 하는 무선 신호의 특성(예: 주 파수)에 따라 달라질 수 있으며, 도시된 예에 의해 한정되는 것은 아니다. 일 실시 예에서, 전자 부품은 전자 장치의 안테나 구조로 동작하는 측벽과 인접하도록 배치될 수 있다. 예를 들어, 전자 부품은 제2 안테나(A2)에 해당하는 제1 측벽(141a)과 인접할 수 있다. 다른 예를 들 어, 전자 부품은 제3 안테나(A3) 및 제4 안테나(A4)에 해당하는 제2 측벽(141b) 보다, 제1 안테나(A1) 및 제2 안테나(A2)에 해당하는 제1 측벽(141a)에 더 인접할 수 있다. 일 실시 예에서, 전자 부품은 제1 인쇄 회로 기판에 배치되어 제1 인쇄 회로 기판에 적어도 부분 적으로 지지될 수 있다. 다른 실시 예에서, 전자 부품은 제1 인쇄 회로 기판과 전기적으로 연결되지만, 프레임 구조에 의해 지지될 수도 있다. 도 3a 및 도 3b를 참조하면, 전자 부품은 예를 들어, 카메라 모듈(예: 도 12의 카메라 모듈)을 포함 할 수 있다. 일 실시 예에서, 전자 부품은 케이싱(casing) 및 상기 케이싱에 수용되는 카메라 조립 체를 포함할 수 있다. 케이싱은 전기적으로 전도성 물질(예: 금속) 및/또는 전기적으로 절연성 물질(예: 수지)을 포함할 수 있다. 카메라 조립체는 적어도 하나의 렌즈, 상기 적어도 하나의 렌즈를 이동 시키기 위한 액추에이터(actuator), 적어도 하나의 이미지 센서, 이미지 시그널 프로세서(image signal processor), 및 이들이 작동적으로 배치되는 기판을 포함할 수 있다. 상기 카메라 조립체의 상기 적어도 하 나의 렌즈는 케이싱에 형성된 개구를 통해 노출될 수 있다. 상기 기판은 부분적으로 플렉서블한 부분을 포함하는 경-연성 인쇄 회로 기판(rigid-flexible printed circuit board)를 포함할 수 있으나, 이에 제한되는 것은 아니다. 전자 부품은 상기 기판으로부터 케이싱 외부로 연장되는 연결 부재 및 연결 부재(3 2)의 단 부에 마련된 커넥터를 포함할 수 있다. 일 실시 예에서, 전자 부품은 제1 인쇄 회로 기판과 전기적으로 연결될 수 있다. 예를 들어, 전자 부 품은 연결 부재 및 상기 연결 부재에 배치된 커넥터를 통해, 제1 인쇄 회로 기판에 마련 된 커넥터(34')에 전기적으로 연결될 수 있다. 예를 들어, 전자 부품의 커넥터는 플러그(plug)를 포함 할 수 있고, 제1 인쇄 회로 기판의 커넥터(34')는 상기 플러그에 대응되는 리셉터클(receptacle)을 포함할 수 있다. 상기 플러그가 제1 인쇄 회로 기판에 마련된 리셉터클과 결합됨으로써, 여기에 각각 포함된 단자 들이 서로 접속될 수 있다. 예를 들어, 커넥터의 단자들 중 단자(T1)는 커넥터(34')의 단자들 중 단자(T 1')에 접속되어 서로 전기적으로 연결될 수 있다. 전자 부품과 제1 인쇄 회로 기판이 플러그-리셉터클 을 포함하는 커넥터들(34, 34')을 통해 서로 전기적으로 연결되는 것으로 설명하였으나, 이에 제한되는 것은 아 니며, 통상의 기술자에게 용이한 다양한 전기적 접속 방법이 적용될 수 있다. 또한, 도 3b를 참조하여, 전자 부 품은 카메라 모듈을 포함할 수 있는 것으로 설명하였으나, 전자 부품이 카메라 모듈로 한정되는 것은 아니다. 예를 들어, 전자 부품은 도 12에 도시된 구성 요소들 중 적어도 하나 이상을 포함하는 구성으로 이 해될 수도 있다. 이하에서, 전자 부품의 단자(T1)와 제1 인쇄 회로 기판의 단자(T1')을 구분하지 않고 단자(T1)로 설명한다. 도 3a를 참조하면, 일 실시 예에 따른 제1 인쇄 회로 기판은 복수의 도전성 레이어 및 비 도전성 레이어를 포함할 수 있다. 예를 들어, 제1 인쇄 회로 기판의 상기 도전성 레이어는 전기적으로 도전성 물질, 예컨대 구리를 포함할 수 있다. 일 실시 예에서, 제1 인쇄 회로 기판은 상기 복수의 도전성 레이어의 적어도 일부 를 포함하는 접지부를 포함할 수 있다. 일 실시 예에서, 접지부는 전자 부품과 제1 선로(P1)를 통해 전기적으로 연결되어, 전자 부품의 동 작에 필요한 기준 전압을 제공할 수 있다. 일 실시 예에서, 제1 선로(P1)는, 전자 부품이 접지부와 전 기적으로 연결되기 위하여, 제1 인쇄 회로 기판이 제공하는 도전성 물질(예: 구리)로 형성된 도전성 트레 이스를 포함할 수 있다. 상기 도전성 트레이스는 전자 부품이 접속되는 제1 인쇄 회로 기판의 단자 (T1')로부터 접지부까지 연장될 수 있다. 일 실시 예에서, 가변 매칭 회로는 제1 인쇄 회로 기판에 배치될 수 있다. 가변 매칭 회로는 제1 선로(P1)로부터 분기되는 제2 선로(P2)를 통해, 전자 부품과 전기적으로 연결될 수 있다. 일 실시 예에서, 제2 선로(P2)는 제1 인쇄 회로 기판의 도전성 물질(예: 구리)로 형성된 트레이스를 포함할 수 있다. 일 실시 예에서, 프로세서는 제1 인쇄 회로 기판 상에 배치될 수 있다. 일 실시 예에서, 프로세서 는 가변 매칭 회로, 무선 통신 회로 및 전자 부품과 작동적으로 또는 전기적으로 연결될 수 있다. 일 실시 예에서, 프로세서는 가변 매칭 회로, 무선 통신 회로, 및 전자 부품의 동작을 제어할 수 있다. 전자 부품은 자체 공진 주파수(self-resonance frequency, SRF)를 가질 수 있다. 예를 들어, 도 4a 및 도 4b를 참조하면, 전자 부품은 약 1.5 GHz의 SRF를 가질 수 있다. 전자 부품의 자체 공진 주파수가, 전자 부품과 인접한 제1 안테나(A1) 및 제2 안테나(A2)를 이용하여 송신하는 무선 신호의 주파수 대역(예: 1.5GHz를 포함하는 중간 주파수 대역) 또는 그 주파수의 하모닉(harmonic) 성분(예: 송신 신호의 배수 주파수) 과 겹치게 되는 경우, 송신 신호의 스퓨리어스(spurious) 성분 또는 노이즈(noise)가 전자 부품으로 유입될 수 있다. 또한 제1 안테나(A1) 및 제2 안테나(A2)를 통해 방출되는 송신 신호의 성분이 대기(air)를 통해 전자 부품으로 유기될 수 있다. 이러한 전자 부품과 제1, 제2 안테나들(A1, A2) 사이의 간섭에 의해 격리도 (isolation)가 저하될 수 있다. 또한 전자 부품과 제1, 제2 안테나들(A1, A2) 사이의 간섭에 의해 전자 부 품이 오작동 되는 등 전자 부품의 성능에 나쁜 영향을 미칠 수 있으며, 제1 안테나(A1) 및 제2 안테나 (A2)의 성능이 저하될 수 있다. 일 실시 예에 따른 전자 장치의 가변 매칭 회로는 전자 부품의 자체 공진 주파수를 이동(shift)시 킬 수 있다. 이를 통해, 일 실시 예에 따른 전자 장치의 가변 매칭 회로는 제1, 제2 안테나들(A1, A2) 및 전자 부품 사이의 격리도를 향상시킬 수 있다. 다만, 전자 부품과 간섭될 수 있는 안테나로서, 하우징의 도전성 부분으로 형성되는 안테나(예: 프레임 구 조의 제2 안테나(A2))로 설명하였으나, 이에 제한되는 것은 아니다. 예를 들어, 전자 장치의 하우징과 구분되는 다른 안테나(예: 패치 안테나와 같은 마이크로스트립 안테나)가 전자 부품과 인접하게 배치되 는 등으로 상호 간섭이 발생할 수 있는 경우에도, 본 개시의 실시 예가 실질적으로 동일하게, 유사하게, 또는 대응하는 방식으로 적용될 수 있다. 도 5는 일 실시 예에 따른, 가변 매칭 회로를 포함하는 전자 장치의 예시적인 블록도이다. 도 5를 참조하면, 일 실시 예에 따른 전자 장치는 전력 관리 회로(power management integrated circuit, PMIC)를 포함할 수 있다. 전력 관리 회로는 예를 들어, 전자 장치에 공급되는 전력을 관리하기 위한 전력 관리 회로 (예: 도 12의 전력 관리 모듈) 또는 전자 부품에 공급되는 전력을 관리하기 위한 전력 관리 회로를 포함할 수 있다. 일 실시 예에서, 전력 관리 회로는 제1 인쇄 회로 기판에 배치될 수 있다. 일 실시 예에서, 단자(T1)는 전자 부품의 그라운드 단자(또는 핀)을 포함할 수 있다. 예를 들어, 단자(T1) 는 전자 부품의 아날로그 그라운드 핀 또는 디지털 그라운드 핀을 포함할 수 있다. 일 실시 예에서, 단자 (T1)는 제1 선로(P1)를 통해 접지부에 전기적으로 연결될 수 있다. 다른 실시 예에서, 전자 부품의 접지를 위한 단자는, 도시와 달리 복수 개로 마련될 수도 있다. 이 경우, 제1 선로(P1)는 상기 복수 개로 마련된 단자들 전부에 전기적으로 연결될 수 있다. 예를 들어, 제1 선로(P1)는 복수 개로 마련된 아날로그 그라운드 핀들 전부에 전기적으로 연결되거나 또는 디지털 그라운드 핀들 전부에 전 기적으로 연결될 수 있다. 일 실시 예에서, 고주파 성분을 차단하기 위한 컴포넌트(component)는 제1 선로(P1)에서, 단자(T1) 및 접지 부 사이에 배치될 수 있다. 예를 들어, 컴포넌트는 비드(bead) 또는 인덕터(inductor)를 포함할 수 있 다. 일 실시 예에서, 가변 매칭 회로는 전자 부품에 전기적으로 연결될 수 있다. 일 실시 예에서, 가변 매 칭 회로는, 단자(T1) 및 컴포넌트 사이의 제1 선로(P1)의 제1 분기점(S1)에서 분기되는 제2 선로(P2)를 통해, 전자 부품의 단자(T1)에 전기적으로 연결될 수 있다. 일 실시 예에서, 가변 매칭 회로는 제4 선로(P4)를 통해 전력 관리 회로와 전기적으로 연결될 수 있다. 일 실시 예에서, 가변 매칭 회로는 제1 엘리먼트 및 제2 엘리먼트를 포함할 수 있다. 일 실시 예에 서, 제1 엘리먼트는 제2 선로(P2) 및 제1 선로(P1)를 통해 전자 부품의 단자(T1)와 전기적으로 연결될 수 있다. 예를 들어, 제1 엘리먼트의 제1 단자는 제2 선로(P2) 및 제1 선로(P1)를 통해 전자 부품의 단 자(T1)와 전기적으로 연결될 수 있다. 일 실시 예에서, 제1 엘리먼트는 제3 선로(P3)를 통해 제2 엘리먼트 와 전기적으로 연결될 수 있다. 예를 들어, 제1 엘리먼트의 제2 단자는 제3 선로(P3)를 통해 제2 엘리 먼트와 전기적으로 연결될 수 있다. 일 실시 예에서, 제1 엘리먼트 및 제2 엘리먼트는 제2 선로 (P2) 및 제3 선로(P3)에 직렬로 연결될 수 있다. 일 실시 예에서, 제3 선로(P3) 및 제4 선로(P4)는 제1 인쇄 회 로 기판의 도전성 물질(예: 구리)로 형성된 트레이스를 포함할 수 있다. 일 실시 예에서, 제4 선로(P4)는, 제1 엘리먼트 및 제2 엘리먼트 사이의 제3 선로(P3)의 제2 분기점 (S2)에서 분기될 수 있다. 일 실시 예에서, 제2 엘리먼트는 제3 선로(P3) 및 제4 선로(P4)를 통해 전력 관 리 회로와 전기적으로 연결될 수 있다. 일 실시 예에서, 제2 엘리먼트는 접지부와 전기적으로 연 결될 수 있다. 예를 들어, 제2 엘리먼트의 제1 단자는 전력 관리 회로 및 제1 엘리먼트와 전기적 으로 연결되고, 제2 엘리먼트의 제2 단자는 접지부에 전기적으로 연결될 수 있다. 일 실시 예에서, 제1 엘리먼트는 직류 성분을 차단하기 위한 것으로서, 예를 들어, 캐패시터(capacitor)를 포함할 수 있다. 일 실시 예에서, 전력 관리 회로는 전자 장치의 배터리(예: 도 12의 배터리) 를 이용하여, 가변 매칭 회로의 제2 엘리먼트에 가변 전압을 인가할 수 있다. 예를 들어, 도시되지 않 았으나 전력 관리 회로와 전기적으로 연결된 프로세서(예: 도 3a의 프로세서)는 전력 관리 회로 및 전력 관리 회로에 의해 제2 엘리먼트에 인가되는 전압을 제어할 수 있다. 일 실시 예에서, 제2 엘리먼트는 전력 관리 회로를 통해 인가되는 전압에 따라 가변 커패시턴스 (capacitance)를 갖는 엘리먼트로서, 예를 들어 버랙터(varactor)를 포함할 수 있다. 일 실시 예에서, 제2 엘리 먼트에 인가되는 전압(VR)에 따른 제2 엘리먼트의 커패시턴스(CT)의 일 예는 하기 표 1과 같다. 표 1 VR CT[pF] 0 72.4 0.5 55.3 1 44.9 1.5 36.9 2 29.9 2.5 22.9 3 16.3 3.5 11.8 4 9.3 4.5 7.9 5 7 5.5 6.4 6 6 6.5 5.7 7 5.5 7.5 5.3 8 5.1 일 실시 예에서, 가변 매칭 회로의 제2 엘리먼트가 갖는 커패시턴스에 따라 전자 부품의 자체 공진 주파수가 달라질 수 있다. 예를 들어, 제2 엘리먼트의 커패시턴스가 증가할수록 전자 부품의 자체 공진 주파수가 증가할 수 있다. 도 6은 일 실시 예에 따른 안테나의 S-파라미터(S21)를 나타내는 그래프들이다. 도 6의 그래프는 가변 매칭 회로에 의해 전자 부품의 자체 공진 주파수가 쉬프팅되지 않은 상태의 전자 부품과 제1, 제2 안테나들(A1, A2) 간 S21을 나타내는 그래프일 수 있다. 도 6의 그래프는 가변 매칭 회로에 의해 전자 부품의 자체 공진 주파수가 업 쉬프팅된 상태에서 전자 부품과 제1, 제2 안 테나들(A1, A2) 간 S21을 나타내는 그래프일 수 있다. 하기 표 2는 그래프 및 그래프에 표시된 지점들에 해당하는 주파수 및 S21을 나타낸다. 표 2 구분 1 2 3 4 5 6 7 8 주파수[MHz] 17401950249025902690335038004150 S21 [dB]그래프-40.55-35.37-43.9-46.28-47.52-62.4-45.24-44.92 그래프-48.97-56.89-37.84-38.44-39.78-58.25-48.81-43.91 차이 -8.42-21.526.067.847.744.15-3.571.01 도 6 및 상기 표 2를 참조하면, 전자 부품의 자체 공진 주파수가 업 쉬프팅되는 경우, MB(mid band)(예: 1GHz 내지 2GHz)에 해당하는 주파수 대역에서 격리도가 향상될 수 있다. 예를 들어, 전자 부품의 자체 공진 주파수가 업 쉬프팅 되는 경우, 격리도는 제1 지점에 해당하는 주파수인 1740 MHz에서 약 8 dB 향상되고, 제 2 지점에 해당하는 주파수인 1950 MHz에서 약 22 dB 향상될 수 있다. 또한, 전자 부품의 자체 공진 주파 수가 쉬프팅 되지 않는 경우, HB(high band)(예: 2GHz 내지 3GHz)에 해당하는 주파수 대역에서 격리도가 향상될 수 있다. 예를 들어, 전자 부품의 자체 공진 주파수가 쉬프팅 되지 않는 경우, 격리도는 제3 지점, 제4 지점, 및 제5 지점에 해당하는 주파수인 2490 MHz, 2590 MHz, 및 2690 MHz에서 각각 약 6 dB, 약 8 dB, 및 약 8 dB 향상될 수 있다. 이는 전자 부품의 자체 공진 주파수가, 제1, 제2 안테나들(A1, A2)을 이용하여 송출되는 주파수 대역(예: 상기 중간 대역(MB) 또는 상기 고 대역(HB))과 멀어지기 때문일 수 있다. 도 7은 일 실시 예에 따른, 통신 대역에 따른 전자 부품의 자체 공진 주파수를 나타내는 그래프이다. 도 7의 그래프들 (701, 702, 703)은 전자 부품의 S-파라미터(S11)를 나타낸다. 도 7에서, 전자 부품의 자체 공진 주파수 는 S11 그래프가 가장 낮은 지점에 해당하는 주파수일 수 있다. 예를 들어, 전자 부품의 제1 자체 공진 주파 수는 그래프의 S11 값이 가장 낮은 제1 주파수(f1)일 수 있다. 전자 부품의 제2 자체 공진 주파수는 그래프의 S11 값이 가장 낮은 제2 주파수(f2)일 수 있다. 전자 부품의 제3 자체 공진 주파수는 그래프 의 S11 값이 가장 낮은 제3 주파수(f3)일 수 있다. 도 7을 참조하면, 일 실시 예에 따른 전자 장치는 가변 매칭 회로의 제2 엘리먼트에 인가되는 전 압을 변경함으로써, 전자 부품의 자체 공진 주파수를 변경할 수 있다. 일 실시 예에 따른 전자 장치는 통신 주파수 대역에 따라, 전자 부품의 자체 공진 주파수를 변경할 수 있다. 예를 들어, 전자 장치는 전자 부품과 인접한 제1 안테나(A1) 및/또는 제2 안테나(A2)를 이용하여 송출하는 무선 신호의 주파수 대역 에 따라, 전자 부품의 자체 공진 주파수를 변경할 수 있다. 예를 들어, 전자 장치는 제1 안테나(A1) 및/또는 제2 안테나(A2)를 이용하여 송출하는 무선 신호의 주파수 대역과 중첩되지 않도록, 전자 부품의 자 체 공진 주파수를 변경할 수 있다. 일 실시 예에서, 도 7에 도시된 바와 같이, 전자 장치는, 제1 대역에서 무선 통신을 수행 중인 경우, 전자 부품의 자체 공진 주파수를 하향 시프트(down shift) 또는 상향 시프트(up shift)하여 자체 공진 주파 수를 제1 주파수(f1)에서 제2 주파수(f2) 또는 제3 주파수(f3)로 변경할 수 있다. 제2 주파수(f2) 및 제3 주파 수(f3)는 제1 대역과 중첩되지 않을 수 있다. 다른 예를 들어, 전자 장치는, 제1 대역에서 무선 통신 수행 중인 경우, 전자 부품의 자체 공진 주파수를 제2 주파수(f2) 또는 제3 주파수(f3)로 유지할 수 있다. 제1 대역은, 예를 들어, 3GPP 표준에 따른 FR1(frequency range 1)의 n1 밴드의 uplink 대역인 1920MHz 내지 1980MHz일 수 있으나, 이에 제한되는 것은 아니다. 일 실시 예에서, 전자 장치는, 제2 대역에서 무선 통신을 수행 중인 경우, 전자 부품의 자체 공진 주파수를 제2 주파수(f2)에서 제1 주파수(f1) 또는 제3 주파수(f3)로 변경할 수 있다. 제1 주파수(f1) 및 제3 주파수(f3)는 제2 대역과 중첩되지 않을 수 있다. 다른 예를 들어, 전자 장치는, 제2 대역에서 무 선 통신 수행 중인 경우, 전자 부품의 자체 공진 주파수를 제1 주파수(f1) 또는 제3 주파수(f3)로 유지할 수 있다. 제2 대역은 예를 들어, 3GPP 표준에 따른 FR1의 n3 밴드의 uplink 대역인 1710MHz 내지 1785MHz 일 수 있으나, 이에 제한되는 것은 아니다. 일 실시 예에서, 전자 장치는, 제3 대역에서 무선 통신을 수행 중인 경우, 전자 부품의 자체 공진 주파수를 제3 주파수(f3)에서 제1 주파수(f1) 또는 제2 주파수(f2)로 변경할 수 있다. 제1 주파수(f1) 및 제2 주파수(f2)는 제3 대역과 중첩되지 않을 수 있다. 다른 예를 들어, 전자 장치는, 제3 대역에서 무 선 통신 수행 중인 경우, 전자 부품의 자체 공진 주파수를 제1 주파수(f1) 또는 제2 주파수(f2)로 유지할 수 있다. 제3 대역은 예를 들어, 3GPP 표준에 따른 FR1의 n41 밴드의 uplink 대역인 2496MHz 내지 2690MHz 일 수 있으나, 이에 제한되는 것은 아니다. 일 실시 예에서, 전자 장치는, 제1 대역 및 제2 대역에서 무선 통신을 수행 중인 경우, 전자 부품 의 자체 공진 주파수를 제1 주파수(f1) 또는 제2 주파수(f2)에서 제3 주파수(f3)로 변경하거나, 또는 제3 주파수(f3)로 유지할 수 있다. 일 실시 예에서, 전자 장치는, 제1 대역 및 제3 대역에서 무선 통신을 수행 중인 경우, 전자 부품 의 자체 공진 주파수를 제1 주파수(f1) 또는 제3 주파수(f3)에서 제2 주파수(f2)로 변경하거나, 또는 제2 주파수(f2)로 유지할 수 있다. 일 실시 예에서, 전자 장치는, 제2 대역 및 제3 대역에서 무선 통신을 수행 중인 경우, 전자 부품 의 자체 공진 주파수를 제2 주파수(f2) 또는 제3 주파수(f3)에서 제1 주파수(f1)로 변경하거나, 또는 제1 주파수(f1)로 유지할 수 있다. 도 8a는 일 실시 예에 따른 전자 장치의 전자 부품과 비교 실시 예에 따른 전자 장치의 전자 부품의 신호 특성 을 나타내는 그래프들이다. 도 8a의 그래프는 일 실시 예에 따른, 전자 장치의 전자 부품의 MIPI(mobile Industry processor interface) 신호 파형을 나타낸다. 도 8a의 그래프는 비교 실시 예에 따 른, 전자 장치의 전자 부품의 MIPI 신호 파형을 나타낸다. 일 실시 예에 따른 전자 장치는 전자 부품 의 자체 공진 주파수를 변경시키기 위한 가변 매칭 회로를 포함할 수 있고, 비교 실시 예에 따른 전자 장치 는 가변 매칭 회로를 포함하지 않을 수 있다. 도 8b는 일 실시 예에 따른 전자 장치의 전자 부품과 비교 실시 예에 따른 전자 장치의 전자 부품의 신호 특성 을 나타내는 그래프들이다. 도 8b의 그래프는 일 실시 예에 따른 전자 장치의 전자 부품의 I2C (inter-integrated circuit) 통신 프로토콜에 따른 SDA(serial data) 신호의 파형(805a) 및 SCL(serial clock)신호의 파형(805b)을 나타낸다. 도 8b의 그래프는 비교 실시 예에 따른 전자 장치의 전자 부품의 I2C 통신 의 SDA 신호의 파형(807a) 및 SCL 신호의 파형(807b)을 나타낸다. 일 실시 예에 따른 전자 장치는 전자 부 품의 자체 공진 주파수를 변경시키기 위한 가변 매칭 회로를 포함할 수 있고, 비교 실시 예에 따른 전 자 장치는 가변 매칭 회로를 포함하지 않을 수 있다. 도 8a 및 도 8b를 참조하면, 일 실시 예에 따른 전자 장치와 비교 실시 예에 따른 전자 장치의 신호 전달 특성은 실질적으로 동일할 수 있다. 일 실시 예에 따른 전자 장치는 가변 매칭 회로를 포함하더라도, 전자 부품과 연관된 신호의 전달 특성이 달라지지 않을 수 있다. 일 실시 예에 따른 전자 장치는 가변 매칭 회로를 통해 전자 부품의 자체 공진 주파수를 튜닝하더라도, 전자 부품의 동작에 요구되는 신 호들의 특성이 유지될 수 있다. 이는 전자 부품 및 가변 매칭 회로가 연결되는 접지부가, 전자 장 치의 다양한 부품들의 기준 전압을 제공하기 위한 것으로서 가장 큰 시스템 그라운드이기 때문일 수 있다. 도 9a는 다른 실시 예에 따른 가변 매칭 회로를 포함하는 전자 장치의 블록도이다. 도 9b는 다른 실시 예에 따 른 가변 매칭 회로를 포함하는 전자 장치의 블록도이다. 도 9a를 참조하면, 일 실시 예에 따른 전자 장치(예: 도 3a의 전자 장치)의 가변 매칭 회로는 전 자 부품과 전기적으로 연결될 수 있다. 예를 들어, 가변 매칭 회로는 전자 부품의 커넥터와 전 기적으로 연결될 수 있다. 예를 들어, 가변 매칭 회로는 커넥터의 단자(T1)와 전기적으로 연결될 수 있 다. 일 실시 예에서, 가변 매칭 회로는, 단자(T1)로부터 연장되는 제1 선로(P1) 및 상기 제1 선로(P1)의 제1 분 기점(S1)에서 분기되는 제2 선로(P2)를 통해, 전자 부품과 전기적으로 연결될 수 있다. 일 실시 예에서, 가변 매칭 회로는 스위치, 제1 엘리먼트, 제2 엘리먼트, 제3 엘리먼트, 및 제4 엘리먼트를 포함할 수 있다. 일 실시 예에서, 스위치(또는 스위치 회로)는 SPDT(single pole double throw) 스위치를 포함할 수 있다. 예를 들어, 스위치는 제2 선로(P2)를 통해 제1 선로(P1)의 제1 분기점(S1)에 전기적으로 연결될 수 있다. 스위치는 제1 분기점(S1)을 제3 선로(P3) 또는 제4 선로(P4)에 선택적으로 전기적으로 연결할 수 있다. 스 위치의 동작에 따라, 전자 부품의 단자(T1)는 제3 선로(P3) 또는 제4 선로(P4)에 선택적으로 전기적으 로 연결될 수 있다. 일 실시 예에서, 가변 매칭 회로의 스위치는, 도시되지 않은 무선 통신 회로(예: 도 3a의 무선 통신 회로) 및/또는 프로세서(예: 도 3a의 프로세서)와 전기적으로 연결되어, 상기 무 선 통신 회로 및/또는 상기 프로세서에 의해 제어될 수 있다. 일 실시 예에서, 제1 엘리먼트는 제2 엘리먼트 및 접지부와 전기적으로 연결될 수 있다. 예를 들어, 제1 엘리먼트의 제1 단자는 스위치와 전기적으로 연결되고, 제1 엘리먼트의 제2 단자는 제2 엘리먼트 및 접지부와 전기적으로 연결될 수 있다. 일 실시 예에서, 제1 엘리먼트는 제3 선로(P3) 에 직렬로 연결될 수 있다. 일 실시 예에서, 제2 엘리먼트는 제3 선로(P3)에 병렬로 연결될 수 있다. 일 실 시 예에서, 제2 엘리먼트는 제1 엘리먼트 및 접지부에 전기적으로 연결될 수 있다. 일 실시 예에서, 제3 엘리먼트는 제4 엘리먼트 및 접지부와 전기적으로 연결될 수 있다. 예를 들어, 제3 엘리먼트의 제1 단자는 스위치와 전기적으로 연결되고, 제3 엘리먼트의 제2 단자는 제4 엘리먼트 및 접지부와 전기적으로 연결될 수 있다. 일 실시 예에서, 제3 엘리먼트는 제4 선로(P4) 에 직렬로 연결될 수 있다. 일 실시 예에서, 제4 엘리먼트는 제4 선로(P4)에 병렬로 연결될 수 있다. 일 실 시 예에서, 제4 엘리먼트는 제3 엘리먼트 및 접지부에 전기적으로 연결될 수 있다. 일 실시 예에서, 제1 엘리먼트, 제2 엘리먼트, 제3 엘리먼트, 및 제4 엘리먼트 각각은 럼프드 엘리먼트(lumped element)를 포함할 수 있다. 예를 들어, 제1 엘리먼트는 제1 인덕터를 포함할 수 있고, 제 2 엘리먼트는 제1 캐패시터를 포함할 수 있다. 제3 엘리먼트는 제2 인덕터를 포함할 수 있고 제4 엘리 먼트는 제2 캐패시터를 포함할 수 있다. 일 실시 예에서, 제1 엘리먼트 및 제2 엘리먼트는, 여기에 전기적으로 연결된 전자 부품이 제1 자 체 공진 주파수를 갖도록 설정될 수 있다. 제3 엘리먼트 및 제4 엘리먼트는, 여기에 전기적으로 연결된 전자 부품이 상기 제1 자체 공진 주파수와 다른 자체 공진 주파수를 갖도록 설정될 수 있다. 예를 들어, 제 3 선로(P3)에 대응되는 제1 엘리먼트 및 제2 엘리먼트는, 제4 선로(P4)에 대응되는 제3 엘리먼트 및 제4 엘리먼트와 상이한 임피던스 특성을 가질 수 있다. 예를 들어, 제1 엘리먼트의 인덕턴스는 제3 엘리먼트의 인덕턴스와 상이할 수 있다. 예를 들어, 제2 엘리먼트의 커패시턴스는 제4 엘리먼트의커패시턴스와 상이할 수 있다. 다른 예를 들어, 제1 엘리먼트 및 제2 엘리먼트 각각의 소자 값은, 제3 엘리먼트 및 제4 엘리먼트가 정의하는 임피던스 특성과 달라지도록 설정될 수 있다. 다만 상술한 예에 의해 제한되는 것은 아니다. 일 실시 예에서, 스위치의 동작에 따라, 전자 부품의 단자(T1)는 제3 선로(P3)에 대응되는 제1 엘리먼 트 및 제2 엘리먼트와 전기적으로 연결되거나, 또는 제4 선로(P4)에 대응되는 제3 엘리먼트 및 제4 엘리먼트에 전기적으로 연결될 수 있다. 스위치의 동작에 따라, 전자 부품의 자체 공진 주파수가 달라질 수 있다. 예를 들어, 전자 부품의 단자(T1)가 제3 선로(P3)에 연결되는 경우, 전자 부품은 상기 제1 자체 공진 주파수를 가질 수 있고, 제4 선로(P4)에 연결되는 경우, 전자 부품은 상기 제1 자체 공진 주 파수(예: 도 7의 제1 주파수(f1))보다 큰 제3 자체 공진 주파수(예: 도 7의 제3 주파수(f3))를 가질 수 있다. 본 개시에서, 일 실시 예에 따른, 전자 부품 및 접지부에 전기적으로 연결되는 제3 선로(P3), 제1 엘리 먼트 및 제2 엘리먼트는 제1 매칭 회로로 참조될 수 있다. 본 개시에서, 일 실시 예에 따른, 전자 부품 및 접지부에 전기적으로 연결되는 제4 선로(P4), 제3 엘리 먼트 및 제4 엘리먼트는 제2 매칭 회로로 참조될 수 있다. 다른 실시 예에서, 가변 매칭 회로는 도시되지 않은 제3 매칭 회로를 더 포함할 수 있다. 이 경우, 상기 제 3 매칭 회로는 스위치를 통해 선택적으로 전자 부품의 단자(T1)에 전기적으로 연결될 수 있다. 스위치 는 SPTT(single pole triple throw) 스위치로 구성될 수 있다. 일 실시 예에서, 상기 제3 매칭 회로는 복 수의 럼프드 소자들을 포함할 수 있다. 전자 부품이 스위치를 통해 상기 제3 매칭 회로에 연결되는 경 우, 전자 부품은 상기 제1 자체 공진 주파수보다 작은 제2 자체 공진 주파수(예: 도 7의 제2 주파수(f2))를 가질 수 있다. 또는, 전자 부품이 스위치를 통해 상기 제3 매칭 회로에 연결되는 경우, 전자 부품 은 상기 제3 자체 공진 주파수보다 큰 제4 자체 공진 주파수를 가질 수도 있다. 다른 실시 예에서, 도 9b를 참조하면, 전자 장치(900-1)(예: 도 3a의 전자 장치)의 가변 매칭 회로(20- 1)는 스위치(21-1) 및 플로팅 단자(floating terminal)를 포함할 수 있다. 일 실시 예에서, 스위치(21- 1)는 SPTT 스위치로 구성되어, 전자 부품의 단자(T1)를 제3 선로(P3), 제4 선로(P4) 또는 플로팅 단자 에 선택적으로 전기적으로 연결할 수 있다. 일 실시 예에서, 전자 부품의 단자(T1)가 플로팅 단자에 전 기적으로 연결되는 경우, 전자 부품은 상기 제2 자체 공진 주파수(예: 도 7의 제2 주파수(f2))를 가질 수 있다. 상술한 것과 같이, 가변 매칭 회로(20-1)는 도시되지 않은 상기 제3 매칭 회로를 더 포함할 수도 있다. 이 경우, 스위치(21-1)는 전자 부품의 단자(T1)를 제3 선로(P3), 제4 선로(P4), 플로팅 단자(T1) 또는 상기 제 3 매칭 회로에 연결 가능하도록 구성될 수 있다. 예를 들어, 스위치(21-1)는 SPQT(single pole quadruple throw) 스위치 또는 SPDT 스위치와 DPDT(double pole double throw) 스위치가 조합된 스위치를 포함할 수 있으 나 이에 제한되는 것은 아니다. 일 실시 예에서, 상기 제3 매칭 회로는 스위치(21-1)를 통해 전자 부품의 단자(T1)와 선택적으로 전기적으로 연결될 수 있다. 상기 제3 매칭 회로는 복수의 럼프드 소자들을 포함할 수 있다. 상기 제3 매칭 회로는, 상기 제3 매칭 회로와 연결된 전자 부품이 상기 제3 자체 공진 주파수(예: 도 7의 제3 주파수(f3)) 보다 큰 상기 제4 자체 공진 주파수를 갖도록 구성될 수 있다. 본 개시의 일 실시 예에 따른 전자 장치(예: 도 3a의 전자 장치)는, 하우징(예: 도 3a의 프레임 구조 ), 도전성 부분을 포함하는 안테나(예: 도 3a의 제1 안테나(A1) 또는 제2 안테나(A2)), 상기 하우징 내에 배치되고, 도전성 레이어를 적어도 부분적으로 포함하는 접지부(예: 도 3a의 접지부)를 포함하는 인쇄 회로 기판(예: 도 3a의 제1 인쇄 회로 기판), 상기 안테나에 인접하도록 상기 하우징 내에 배치되고, 제1 선로 (예: 도 3a의 제1 선로(P1))를 통해 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결되는 전자 부품(예: 도 3a의 전자 부품), 상기 제1 선로 및 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결되는 가변 매 칭 회로(예: 도 3a의 가변 매칭 회로), 및 상기 안테나를 이용하여 무선 통신 신호를 송신하도록 설정되는 적어도 하나의 프로세서(예: 도 3a의 무선 통신 회로)를 포함하고, 상기 가변 매칭 회로는, 상기 전자 부 품의 자체 공진 주파수를 변경 가능하도록 구성될 수 있다. 일 실시 예에서, 상기 가변 매칭 회로에 의해 변경된 상기 전자 부품의 자체 공진 주파수는 상기 무선 통신 신 호의 주파수 대역과 중첩되지 않을 수 있다. 일 실시 예에 따른 상기 전자 장치는, 전력 관리 회로(예: 도 5의 전력 관리 회로)를 포함하고, 상기 가변 매칭 회로는 제1 엘리먼트(예: 도 5의 제1 엘리먼트) 및 제2 엘리먼트(예: 도 5의 제2 엘리먼트)를 포함하고, 상기 제1 엘리먼트의 제1 단자는 상기 제1 선로의 제1 지점(예: 도 5의 제1 분기점(S1))에서 분기되는 제2 선로(예: 도 5의 제2 선로(P2))를 통해 상기 전자 부품에 전기적으로 연결되고, 상기 제1 엘리먼트의 제2 단자는 상기 제2 엘리먼트에 전기적으로 연결되고, 상기 제2 엘리먼트의 제1 단자는 상기 제1 엘리먼트 및 상기 전력 관리 회로에 전기적으로 연결되고, 상기 제2 엘리먼트의 제2 단자는 상기 접지부에 전기적으로 연결되고, 상기 제2 엘리먼트는 상기 전력 관리 회로로부터 인가되는 전압에 따라 상이한 커패시턴스(capacitance)를 가질 수 있다. 일 실시 예에서, 상기 제1 엘리먼트는 캐패시터를 포함하고, 상기 제2 엘리먼트는 버랙터(varactor)를 포함할 수 있다. 일 실시 예에서, 상기 제1 선로에서 상기 제1 지점 및 상기 접지부 사이에 배치되는 비드(bead) 또는 인덕터 (inductor)를 포함할 수 있다. 일 실시 예에서, 상기 가변 매칭 회로는, 상기 제1 선로의 제1 지점에서 분기되는 제2 선로를 통해 상기 전자 부품과 전기적으로 연결되는 스위치(예: 도 9a의 스위치), 상기 스위치 및 상기 접지부에 전기적으로 연결 되는 제3 선로(예: 도 9a의 제3 선로(P3)), 상기 스위치 및 상기 접지부에 전기적으로 연결되는 제4 선로(예: 도 9a의 제4 선로(P4)), 상기 제3 선로에 직렬 연결되는 제1 엘리먼트(예: 도 9a의 제1 엘리먼트), 상기 제 1 엘리먼트 및 상기 접지부 사이에서 상기 제3 선로에 병렬 연결되는 제2 엘리먼트(예: 도 9a의 제2 엘리먼트 ), 상기 제4 선로에 직렬 연결되는 제3 엘리먼트(예: 도 9a의 제3 엘리먼트), 및 상기 제3 엘리먼트 및 상기 접지부 사이에서 상기 제4 선로에 병렬 연결되는 제4 엘리먼트(예: 도 9a의 제4 엘리먼트)를 포함할 수 있다. 상기 스위치는 상기 전자 부품을 상기 제3 선로 또는 제4 선로에 선택적으로 전기적으로 연결하도록 구성될 수 있고, 상기 전자 부품이 상기 스위치를 통해 상기 제1 엘리먼트 및 상기 제2 엘리먼트에 전기적으로 연결되는 경우, 상기 전자 부품은 제1 주파수에 해당하는 자체 공진 주파수를 가지고, 상기 전자 부품이 상기 스위치를 통해 상기 제3 엘리먼트 및 상기 제4 엘리먼트에 전기적으로 연결되는 경우, 상기 전자 부품은 상기 제1 주파수와 상이한 제2 주파수에 해당하는 자체 공진 주파수를 가질 수 있다. 일 실시 예에서, 상기 제1 엘리먼트는 제1 인덕터를 포함하고, 상기 제2 엘리먼트는 제1 캐패시터를 포함하고, 상기 제3 엘리먼트는 제2 인덕터를 포함하고, 상기 제4 엘리먼트는 제2 캐패시터를 포함할 수 있다. 일 실시 예에서, 상기 하우징의 적어도 일부는 상기 안테나의 상기 도전성 부분을 포함할 수 있다. 일 실시 예에서, 상기 가변 매칭 회로는, 상기 스위치 및 상기 접지부와 전기적으로 연결되는 복수의 럼프드 엘 리먼트(lumped element)를 포함하는 매칭 회로를 포함하고, 상기 스위치는, 상기 전자 부품에 상기 제3 선로, 상기 제4 선로, 또는 상기 매칭 회로를 선택적으로 전기적으로 연결하도록 구성되고, 상기 전자 부품이 상기 스 위치를 통해 상기 매칭 회로와 전기적으로 연결된 경우, 상기 전자 부품은 상기 제1 주파수 및 상기 제2 주파수 와 상이한 제3 주파수에 해당하는 자체 공진 주파수를 가질 수 있다. 일 실시 예에서, 상기 제1 주파수는 상기 제2 주파수보다 작고, 상기 제3 주파수는 상기 제1 주파수보다 작을 수 있다. 일 실시 예에서, 상기 가변 매칭 회로는 플로팅 단자(floating terminal)(예: 도 9b의 플로팅 단자)를 포함 하고, 상기 스위치는 상기 전자 부품을 상기 제3 선로, 상기 제4 선로, 또는 상기 플로팅 단자에 선택적으로 전 기적으로 연결하도록 구성되고, 상기 전자 부품이 상기 스위치를 통해 상기 플로팅 단자에 전기적으로 연결된 경우, 상기 전자 부품은 상기 제1 주파수 및 상기 제2 주파수보다 작은 제3 주파수에 해당하는 자체 공진 주파 수를 가질 수 있다. 일 실시 예에서, 상기 제1 선로에서, 상기 제1 지점 및 상기 접지부 사이에 배치되는 비드 또는 인덕터를 포함 할 수 있다. 일 실시 예에서, 상기 전자 부품은 상기 제1 선로를 통해 상기 접지부에 전기적으로 연결되는 그라운드 단자 (ground terminal)(예: 도 3b의 단자(T1))를 포함할 수 있다. 일 실시 예에서, 상기 그라운드 단자는 아날로그 그라운드 단자일 수 있다. 일 실시 예에서, 상기 전자 부품은 적어도 하나의 카메라(예: 도 12의 카메라 모듈)를 포함할 수 있다. 도 10은 일 실시 예에 따른 전자 장치의 일 예를 나타내는 블록도이다. 도 10을 참조하면, 일 실시 예에 따른 전자 장치는 가변 매칭 회로 및 메모리(예: 도 12의 메모리)를 포함할 수 있다. 도 10에도시된 전자 장치는, 도 5의 전자 장치, 도 9a의 전자 장치, 또는 도 9b의 전자 장치(900- 1)에 대응될 수 있다. 예를 들어, 전자 장치에 대해서는, 도 5의 전자 장치, 도 9a의 전자 장치 , 또는 도 9b의 전자 장치(900-1)를 참조하여 제공된 설명이 실질적으로 동일하게, 유사하게, 또는 대응하 는 방식으로 적용될 수 있다. 일 실시 예에 따른, 가변 매칭 회로는 도 5의 가변 매칭 회로, 도 9a의 가변 매칭 회로, 또는 도 9b의 가변 매칭 회로(20-1)와 대응될 수 있다. 예를 들어, 가변 매칭 회로에 대해서는, 도 5의 가변 매칭 회로, 도 9a의 가변 매칭 회로, 또는 도 9b의 가변 매칭 회로(20-1)를 참조하여 제공된 설명이 실질적 으로 동일하게, 유사하게, 또는 대응하는 방식으로 적용될 수 있다. 일 실시 예에서, 가변 매칭 회로가 도 5의 가변 매칭 회로를 포함하는 경우, 가변 매칭 회로는 전 력 관리 회로와 작동적으로 또는 전기적으로 연결될 수 있다. 일 실시 예에서, 프로세서(예: 도 12의 프로세서)는 적어도 하나의 프로세서(예: 프로세싱 회로 (processing circuitry))를 포함할 수 있다. 일 실시 예에서, 프로세서는 무선 통신 회로, 전자 부 품, 가변 매칭 회로, 전력 관리 회로 및 메모리와 작동적으로 또는 전기적으로 연결될 수 있다. 일 실시 예에서, 프로세서는 메모리에 저장된 인스트럭션들을 실행할 수 있다. 일 실시 예에 따른 전자 장치는 메모리에 저장된 인스트럭션들을 프로세서를 이용하여 실행함으로써, 전자 부품, 가변 매칭 회로, 전력 관리 회로, 무선 통신 회로, 및 무선 통신 회로와 전기적 으로 연결된 제1, 제2 안테나들(A1, A2)을 제어할 수 있다. 이하 도 11을 참조하여, 전자 장치의 동작을 설명한다. 본 문서에서 전자 장치의 동작으로 설명되 는 동작은 프로세서의 동작으로 참조될 수 있다. 도 11은 일 실시 예에 따른 전자 장치의 동작을 나타내는 순서도이다. 도 11을 참조하면, 동작 1101에서, 일 실시 예에 따른 전자 장치는 제1 안테나(A1) 및/또는 제2 안테나 (A2)와; 전자 부품이 모두 동작 중인지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 제1 안테나(A1) 및/또는 제2 안테나(A2)를 이용하여 무선 신호를 송신하고 있는 상태에서, 전자 부품 (예: 카메라)이 비활성화 상태에서 활성화 상태로 변경되는 지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 제1 안테나(A1) 및/또는 제2 안테나(A2)를 이용하여 무선 통신이 수립 (establish)된 상태에서, 전자 부품의 인에이블 이벤트(enable event)를 검출하거나 또는 상기 인에이블 이 벤트에 기반한 신호를 수신하는 경우, 제1 안테나(A1) 및/또는 제2 안테나(A2)와; 전자 부품이 모두 동작 중인 것으로 판단할 수 있다. 다른 예를 들어, 전자 장치는 전자 부품이 동작 중인 상태에서, 제1 안테나(A1) 및/또는 제2 안테나 (A2)를 이용하여 무선 통신이 수립되었는지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 전자 부품 이 활성화된 상태에서, 제1 안테나(A1) 및/또는 제2 안테나(A2)를 이용하여 무선 신호를 송신하는 경우, 제 1 안테나(A1) 및/또는 제2 안테나(A2)와; 전자 부품이 모두 동작 중인 것으로 판단할 수 있다. 전자 장치는 동작 1101에서 제1 안테나(A1) 및/또는 제2 안테나(A2)와; 전자 부품이 모두 동작 중인 것으로 판단한 경우, 동작 1103을 수행할 수 있다. 동작 1103에서, 일 실시 예에 따른 전자 장치는 제1 안테나(A1) 및/또는 제2 안테나(A2)를 이용하여 통신 중인 주파수 대역과 전자 부품의 자체 공진 주파수(SRF)가 중첩되는 지 여부를 결정할 수 있다. 예를 들어, 전자 장치는 제1 안테나(A1) 및/또는 제2 안테나(A2)를 이용하여 수립된 무선 통신 주파수 대역과 전자 부품의 자체 공진 주파수가 중첩되는 지 판단할 수 있다. 예를 들어, 도 5에 도시된 바와 같이, 일 실시 예에 따른 전자 장치는 메모리에 저장된, 가변 매칭 회로의 인가 전압에 따른 제2 엘리먼트의 커패시턴스 및/또는 전자 부품의 자체 공진 주파수에 대 한 인덱스 데이터에 기반하여, 현재 통신 중인 주파수 대역과 전자 부품의 자체 공진 주파수가 중첩되는 지 여부를 결정할 수 있다. 예를 들어, 전자 장치는 상기 인덱스 데이터에 기반하여 제2 엘리먼트에 인 가된 전압 및 및 이에 따른 자체 공진 주파수를 식별하고, 상기 식별된 자체 공진 주파수가 현재 통신 중인 주 파수 대역 내에 포함되는 지 여부를 판단할 수 있다. 다른 예를 들어, 도 9a에 도시된 바와 같이, 일 실시 예에 따른 전자 장치는 메모리에 저장된, 가 변 매칭 회로의 스위치의 동작 상태에 따른 전자 부품의 자체 공진 주파수에 대한 데이터에 기반하여, 현재 통신 중인 주파수 대역과 전자 부품의 자체 공진 주파수가 중첩되는 지 여부를 결정할 수 있다. 예를 들어, 전자 장치는 상기 인덱스 데이터에 기반하여 스위치의 동작 상태에 따른 전자 부품의 자체 공진 주파수를 식별하고, 상기 식별된 자체 공진 주파수가 현재 통신 중인 주파수 대역 내에 포함되는 지 여부를 판단할 수 있다. 다른 예를 들어, 도 9b에 도시된 바와 같이, 일 실시 예에 따른 전자 장치는 메모리에 저장된, 가 변 매칭 회로(20-1)의 스위치(21-1)의 동작 상태에 따른 전자 부품의 자체 공진 주파수에 대한 데이터에 기 반하여, 현재 통신 중인 주파수 대역과 전자 부품의 자체 공진 주파수가 중첩되는 지 여부를 결정할 수 있 다. 예를 들어, 전자 장치는 상기 인덱스 데이터에 기반하여 스위치(21-1)의 동작 상태에 따른 전자 부품 의 자체 공진 주파수를 식별하고, 상기 식별된 자체 공진 주파수가 현재 통신 중인 주파수 대역 내에 포함 되는 지 여부를 판단할 수 있다. 예를 들어, 도 7에 도시된 바와 같이, 일 실시 예에 따른 전자 장치는 제1 안테나(A1) 및/또는 제2 안테 나(A2)를 이용하여 제1 대역에서 통신 중이고, 전자 부품의 자체 공진 주파수가 제1 주파수(f1)인 경우, 제1 안테나(A1) 및/또는 제2 안테나(A2)를 이용하여 통신 중인 주파수 대역과 전자 부품의 자체 공진 주파수(SRF)가 중첩되는 것으로 결정할 수 있다. 이 경우, 전자 장치는 동작 1105를 수행할 수 있고, 그 렇지 않은 경우 동작을 종료할 수 있다. 다른 실시 예에서, 도시된 바와 달리, 전자 장치가 동작 1103에 서 “아니오(NO)”로 판단한 경우, 전자 장치는 동작을 종료하지 않고 동작 1103을 다시 수행할 수도 있 다. 다른 실시 예에서, 도시된 바와 달리, 전자 장치가 동작 1103에서 “아니오(NO)”로 판단한 경우, 전 자 장치는 전자 부품의 자체 공진 주파수를 변경하지 않고 유지할 수 있다. 동작 1105에서, 일 실시 예에 따른 전자 장치는 가변 매칭 회로를 이용하여, 전자 부품의 자체 공진 주파수(SRF)를 변경할 수 있다. 예를 들어, 일 실시 예에 따른 전자 장치는 동작 1105에서, 가변 매 칭 회로를 이용하여, 통신 중인 주파수 대역과 중첩되지 않도록 전자 부품의 자체 공진 주파수(SRF)를 변경할 수 있다. 예를 들어, 도 5를 참조하면, 전자 장치는 전력 관리 회로를 통해 가변 매칭 회로에 인가되는 전압을 변경하여, 전자 부품의 자체 공진 주파수를 변경할 수 있다. 예를 들어, 전자 장치는 메모리 에 저장된, 통신 밴드, 채널, 및 주파수에 따른 인가 전압 값을 나타내는 인덱스 데이터에 기반하여, 매 칭 회로의 제2 엘리먼트에 인가되는 전압을 변경할 수 있다. 상기 인가 전압이 변경됨에 따라 전자 부 품의 자체 공진 주파수가 변경될 수 있다. 예를 들어, 도 5 및 도 7을 참조하면, 전자 장치는 제1 대 역에서 통신 중인 상태에서, 전자 부품의 자체 공진 주파수가 제1 주파수(f1)에서 제2 주파수(f2) 또는 제3 주파수(f3)로 변경되도록, 전력 관리 회로 및 가변 매칭 회로를 제어할 수 있다. 다른 예를 들어, 도 9a 및 도 9b를 참조하면, 전자 장치는 가변 매칭 회로의 스위치 또는 가변 매칭 회로(20-1)의 스위치(21-1)를 제어함으로써, 전자 부품의 자체 공진 주파수를 변경할 수 있다. 예를 들어, 전자 장치는 메모리에 저장된, 통신 밴드, 채널, 및 주파수에 따른 스위치(21, 21-1)의 동작 상태를 나타내는 인덱스 데이터에 기반하여, 전자 부품의 단자(T1) 및 가변 매칭 회로(20, 20-1)의 전기적 연결 관계를 변경하기 위한 제어 신호를 스위치(21, 21-1)로 송신할 수 있다. 스위치(21, 21-1)는 상기 제어 신 호에 응답하여, 전자 부품의 단자(T1)를 다른 선로와 전기적으로 연결할 수 있다. 예를 들어, 도 7 및 도 9a를 참조하면, 전자 장치는 제1 대역에서 통신 중인 상태에서, 전자 부품의 단자(T1)가 제3 선 로(P3)에서 제4 선로(P4)와 연결되도록 스위치를 제어할 수 있다. 다른 예를 들어, 도 7 및 도 9b를 참조하 면, 전자 장치는 제1 대역에서 통신 중인 상태에서, 전자 부품의 단자(T1)가 제3 선로(P3)에서 제4 선로(P4) 또는 플로팅 단자에 연결되도록 스위치(21-1)를 제어할 수 있다. 일 실시 예에서, 동작 1103 및 동작 1105는 동작 1107로 참조될 수 있다. 예를 들어, 동작 1107에서, 전자 장치 는 상기 판단(예: 동작 1101)에 기반하여, 제1 안테나(A1) 및/또는 제2 안테나(A2)를 이용하여 통신 중인 주파수 대역과 전자 부품의 자체 공진 주파수가 중첩되지 않도록, 가변 매칭 회로를 이용하여 전자 부 품의 자체 공진 주파수를 변경할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치(예: 도 3a의 전자 장치)는, 도전성 부분을 포함하는 하우징(예: 도 3a의 프레임 구조), 상기 도전성 부분을 포함하는 안테나(예: 도 3a의 제1 안테나(A1) 또는 제2 안테나 (A2)), 상기 하우징 내에 배치되고, 도전성 레이어를 적어도 부분적으로 포함하는 접지부(예: 도 3a의 접지부 )를 포함하는 인쇄 회로 기판(예: 도 3a의 제1 인쇄 회로 기판), 상기 안테나에 인접하도록 상기 하우 징 내에 배치되고, 제1 선로(예: 도 3a의 제1 선로(P1))를 통해 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결되는 전자 부품(예: 도 3a의 전자 부품), 상기 제1 선로 및 상기 인쇄 회로 기판의 상기 접지부에 전기적으로 연결되는 가변 매칭 회로(예: 도 3a의 가변 매칭 회로), 및 상기 안테나를 이용하여 무선 통신 신호를 송신하도록 설정되는 무선 통신 회로(예: 도 3a의 무선 통신 회로), 상기 전자 부품, 상기 가변 매 칭 회로, 및 상기 무선 통신 회로와 작동적으로 연결되는 적어도 하나의 프로세서(예: 도 3a의 프로세서) 를 포함하고, 상기 적어도 하나의 프로세서는, 상기 안테나 및 상기 전자 부품이 모두 동작 중인 지 여부를 판 단(예: 도 11의 동작 1101)하고, 상기 판단에 기반하여 상기 안테나를 이용하여 통신 중인 주파수 대역과 상기 전자 부품의 자체 공진 주파수가 중첩되지 않도록, 상기 가변 매칭 회로를 이용하여 상기 전자 부품의 자체 공 진 주파수를 변경(예: 도 11의 동작 1107)하도록 설정될 수 있다. 일 실시 예에서, 상기 적어도 하나의 프로세서는, 상기 안테나를 이용하여 통신 중인 주파수 대역과 상기 전자 부품의 제1 주파수에 해당하는 자체 공진 주파수가 중첩되는 지 여부를 결정(예: 도 11의 동작 1103)하고, 상기 결정에 기반하여 상기 가변 매칭 회로를 제어하도록 설정될 수 있다. 일 실시 예에서, 상기 적어도 하나의 프로세서는, 상기 안테나를 이용하여 통신 중인 주파수 대역과 상기 전자 부품의 자체 공진 주파수가 중첩되는 경우(예: 도 11의 동작 1103의 “YES”), 상기 가변 매칭 회로로 하여금 상기 주파수 대역과 중첩되지 않도록 상기 전자 부품의 자체 공진 주파수를 변경(예: 도 11의 동작 1105)하도록 하고, 또는 상기 안테나를 이용하여 통신 중인 주파수 대역과 상기 전자 부품의 자체 공진 주파수가 중첩되지 않는 경우, 상기 전자 부품의 자체 공진 주파수를 유지하도록 설정될 수 있다. 일 실시 예에 따른 상기 전자 장치는, 상기 전력 관리 회로를 포함할 수 있다. 상기 가변 매칭 회로는 캐패시터 (capacitor) 및 버랙터(varactor)를 포함할 수 있다. 상기 캐패시터의 상기 제1 단자는 상기 제1 선로의 상기 제1 지점에서 분기되는 상기 제2 선로를 통해 상기 전자 부품에 전기적으로 연결되고, 상기 캐패시터의 제2 단 자는 상기 버랙터에 전기적으로 연결될 수 있다. 상기 버랙터의 제1 단자는 상기 캐패시터 및 상기 전력 관리 회로에 전기적으로 연결되고, 상기 버랙터의 제2 단자는 상기 접지부에 전기적으로 연결될 수 있다. 상기 전력 관리 회로와 작동적으로 연결되는 상기 적어도 하나의 프로세서는, 상기 전자 부품의 자체 공진 주파수를 변경 하기 위해 상기 전력 관리 회로를 이용하여 상기 버랙터에 가변 전압을 인가하도록 설정될 수 있다. 일 실시 예에서, 상기 가변 매칭 회로는, 상기 제1 선로 및 상기 제1 선로에서 분기되는 상기 제2 선로를 상기 전자 부품에 전기적으로 연결되는 상기 스위치, 상기 스위치 및 상기 접지부에 전기적으로 연결되는 제1 매칭 회로, 상기 스위치 및 상기 접지부에 전기적으로 연결되는 제2 매칭 회로, 및 상기 스위치에 전기적으로 연결되 는 플로팅 단자를 포함할 수 있다. 상기 스위치는 상기 전자 부품을 상기 제1 매칭 회로, 상기 제2 매칭 회로, 또는 상기 플로팅 단자에 전기적으로 연결하도록 구성될 수 있다. 상기 스위치와 작동적으로 연결된 상기 적어 도 하나의 프로세서는, 상기 전자 부품이 제1 주파수에 해당하는 자체 공진 주파수를 갖도록, 상기 전자 부품이 상기 플로팅 단자와 전기적으로 연결되도록 상기 스위치를 제어하거나, 상기 전자 부품이 상기 제1 주파수보다 높은 제2 주파수에 해당하는 자체 공진 주파수를 갖도록, 상기 전자 부품이 상기 제1 매칭 회로와 전기적으로 연결되도록 상기 스위치를 제어하거나, 또는 상기 전자 부품이 상기 제2 주파수보다 높은 제3 주파수에 해당하 는 자체 공진 주파수를 갖도록, 상기 전자 부품이 상기 제2 매칭 회로와 전기적으로 연결되도록 상기 스위치를 제어하도록 설정될 수 있다. 도 12은, 다양한 실시 예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 12을 참조하 면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하 여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나 와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버 를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모 듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실 시 예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로 세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘 발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비 휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서 (예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거 나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관 련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예 에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포 함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준 지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피 커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다.센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커 넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들 면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배 터리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있 다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예 에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, Wi-Fi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같 은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전 자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워 크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외 부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하 여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치 와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1202, 또는 1204) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행 되는 동작들의 전부 또는 일부는 외부의 전자 장치들(1202, 1204, 또는 1208) 중 하나 이상의 외부의 전자 장치 들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다 른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행 시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치 로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답 의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴 퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서 버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장 치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아 이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \" 제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분 하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤 (예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이 런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시 예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포 함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circui t)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치 들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구 성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3a 도면3b 도면4a 도면4b 도면5 도면6 도면7 도면8a 도면8b 도면9a 도면9b 도면10 도면11 도면12"}
{"patent_id": "10-2021-0193248", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 전자 장치를 나타내는 도면이다. 도 2는 일 실시 예에 따른 전자 장치의 분해 사시도이다. 도 3a는일 실시 예에 따른 전자 장치를 나타내는 도면이다. 도 3b는 일 실시 예에 따른, 전자 부품과 상기 전자 부품이 연결되는 인쇄 회로 기판을 나타낸다. 도 4a은 전자 부품의 자체 공진 주파수(self-resonance frequency, SRF)를 나타내는 스미스 차트(smith char t)이다. 도 4b는 전자 부품의 S-파라미터(S11)를 나타내는 그래프이다. 도 5는 일 실시 예에 따른, 가변 매칭 회로를 포함하는 전자 장치의 예시적인 블록도이다. 도 6은 일 실시 예에 따른 안테나의 S-파라미터(S21)를 나타내는 그래프들이다. 도 7은 일 실시 예에 따른, 통신 대역에 따른 전자 부품의 자체 공진 주파수를 나타내는 그래프이다. 도 8a는 일 실시 예에 따른 전자 장치의 전자 부품과 비교 실시 예에 따른 전자 장치의 전자 부품의 신호 특성 을 나타내는 그래프들이다. 도 8b는 일 실시 예에 따른 전자 장치의 전자 부품과 비교 실시 예에 따른 전자 장치의 전자 부품의 신호 특성 을 나타내는 그래프들이다. 도 9a는 다른 실시 예에 따른 가변 매칭 회로를 포함하는 전자 장치의 블록도이다. 도 9b는 다른 실시 예에 따른 가변 매칭 회로를 포함하는 전자 장치의 블록도이다. 도 10은 일 실시 예에 따른 전자 장치의 일 예를 나타내는 블록도이다. 도 11은 일 실시 예에 따른 전자 장치의 동작을 나타내는 순서도이다. 도 12은 다양한 실시 예에 따른 네트워크 환경 내의 전자 장치를 나타낸다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
