{"patent_id": "10-2020-0027333", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0112139", "출원번호": "10-2020-0027333", "발명의 명칭": "축사 모니터링 장치 및 이의 제어방법", "출원인": "한국전자통신연구원", "발명자": "박대헌"}}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "축사를 이루는 구조물의 내측면에 고정되는 받침부;상기 받침부에 배치되고, 축사 내부의 대기환경 정보를 취득하는 데이터측정부; 및상기 데이터측정부에 배치되고, 축사 내부의 영상 정보 및 음성 정보를 취득하는 제어부를 포함하고, 상기 받침부와 상기 데이터측정부 및 상기 제어부는 상호 수직방향으로 적층되고, 축사 외부의 공기가 상기 데이터측정부 및 상기 제어부의 내부로 유입되는 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 데이터측정부는,몸체를 이루는 수용부;상기 수용부의 내부에 수납되어 축사 내부의 대기환경 정보를 취득하는 다수개의 측정센서;상기 수용부의 내부와 외부가 상호 연통되도록 상기 수용부를 개폐시키는 개폐부;상기 개폐부를 선택적으로 개폐시키는 구동부; 및상기 수용부의 외관을 보호하는 보호대를 포함하는 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 수용부는,상면에 상기 제어부가 삽입되는 삽입홈이 형성된 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 다수개의 상기 측정센서는,축사 내부의 온도, 습도, 이산화탄소 및 암모니아를 각각 측정하는 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 개폐부는,내측면에 상기 측정센서가 거치되는 고정부가 형성된 것공개특허 10-2021-0112139-3-인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 보호대는,상기 수용부의 외주면으로부터 거리를 두고 이격되어 고정된 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 보호대의 상기 수용부로부터 이격된 거리는 상기 수용부로부터 개방된 상기 개폐부와 접하지 않는 거리만큼 이격된 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 데이터측정부는, 다수개로 이루어지고, 상호 수직방향으로 적층된 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제3항에 있어서, 상기 제어부는,몸체를 이루는 몸체부;상기 몸체부의 하면으로부터 연장되어 상기 수용부의 삽입홈에 삽입되는 삽입부;상기 몸체부에 고정되어 축사 내부의 영상 정보를 취득하는 다수개의 촬영부;상기 몸체부에 고정되어 축사 내부의 음성을 취득하는 다수개의 마이크;상기 데이터측정부로부터 취득한 대기환경 정보와 상기 촬영부로부터 취득한 영상 정보 및 상기 마이크로부터취득한 음성 정보를 수집하는 미들웨어; 및상기 몸체부의 상면에 장착되어 상기 수용부 및 상기 몸체부에 축사 외부의 공기를 유입시키는 환기팬을 포함하는 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 몸체부의 면적은 상기 수용부의 면적보다 크고, 상기 촬영부는, 상기 몸체부의 하면에서 상기 삽입부와 겹치지 않는 영역에 배치된 것공개특허 10-2021-0112139-4-인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 마이크는, 지향성 마이크로 이루어진 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 삽입부의 하면에는 상기 수용부와 상기 몸체부가 상호 연통되도록 연통공이 형성된 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서, 상기 제어부는,상기 수용부 및 상기 몸체부의 내부 온도를 제어하는 전열 공조기를 더 포함하는 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 전열 공조기는,상기 수용부 및 상기 몸체부의 내부를 이슬점 이상의 온도로 유지시키는 것인 축사 모니터링 장치."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "축사를 이루는 구조물에 고정되는 받침부와, 축사 내부의 대기환경 정보를 취득하는 데이터측정부 및 축사 내부의 영상 정보 및 음성 정보를 취득하는 제어부로 이루어진 축사 모니터링 장치; 상기 제어부의 촬영부를 통해 촬영된 영상 정보가 저장되는 네트워크 영상 레코더(NVR); 상기 데이터측정부와 상기 제어부로부터 각각 취득한 대기환경 정보 및 음성 정보가 저장되는 데이터베이스;상기 축사 모니터링 장치로부터 취득한 대기환경 정보와 영상 정보 및 음성 정보를 수집하여 상기 데이터베이스에 저장하는 미들웨어를 포함하고, 상기 받침부와 상기 데이터측정부 및 상기 제어부는 상호 수직방향으로 적층되고, 축사 외부의 공기가 상기 데이터측정부 및 상기 제어부의 내부로 유입되는 것인 축사 모니터링 시스템."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 공개특허 10-2021-0112139-5-상기 네트워크 영상 레코더는, 상기 촬영부로부터 TCP/IP통신을 통해 축사 내부의 영상 정보가 저장되고,상기 데이터베이스는, 데이터측정부로부터 유/무선 통신을 통해 상기 대기환경 정보 및 상기 제어부의 마이크로부터 AUX단자를 통해 축사 내부의 음성 정보가 저장되는 것인 축사 모니터링 시스템."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서, 상기 데이터측정부는,몸체를 이루는 수용부;상기 수용부의 내부와 외부가 상호 연통되도록 상기 수용부를 개폐시키는 개폐부; 및상기 개폐부를 선택적으로 개폐시키는 구동부;를 포함하며, 상기 미들웨어는 기설정된 주기에 따라 상기 개폐부의 개방 또는 폐쇄신호를 상기 구동부에 제공하는 것인 축사 모니터링 시스템."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "개폐부에 고정된 다수개의 측정센서가 축사 내부의 대기환경을 측정하도록 미들웨어가 구동부에 개폐부 개방 요청 메시지를 전송하여 개폐부의 개방을 요청하는 단계; 개폐부 개방 요청 메시지에 대하여 개폐부 개방을 동작 후 개폐부의 상태를 응답하는 구동부로부터 개폐부의 개방 응답 메시지를 수신하는 단계; 수신된 개폐부의 개방 응답 메시지를 통해 획득한 개폐부의 상태를 데이터베이스에 업데이트하는 단계; 구동부가 개폐부 개방 상태임을 확인 후 상기 측정센서에 센서 값 요청 메시지를 전달하는 단계; 상기 측정센서로부터 센서 값을 응답 메시지로 수신하는 단계; 수신된 센서 값을 데이터베이스에 저장하는 단계; 상기 센서 값을 저장 후 구동부에 개폐부 폐쇄 요청 메시지를 전송하여 개폐부의 폐쇄를 요청하는 단계;상기 개폐부로부터 구동부를 폐쇄 상태로 변경 후 개폐부 상태를 포함하는 응답 메시지를 수신하는 단계; 및 데이터베이스에 개폐부 상태를 업데이트 하는 단계를 포함하는 것인 축사 모니터링 제어방법."}
{"patent_id": "10-2020-0027333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 개폐부 개방 동작 시, 축사 외부의 공기를 유입시키는 환기팬의 동작이 멈추고, 상기 개폐부의 폐쇄 동작 시, 상기 환기팬이 동작하여 축사 외부의 공기를 데이터측정부 및 제어부의 내부로 유입시키는 것인 축사 모니터링 제어방법."}
{"patent_id": "10-2020-0027333", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 축사 내부 환경을 모니터링 할 수 있는 축사 모니터링 장치에 관한 것으로서, 축사를 이루는 구조물의 내측면에 고정되는 받침부; 상기 받침부에 배치되고, 축사 내부의 대기환경 정보를 취득하는 데이터측정부; 및 상기 데이터측정부에 배치되고, 축사 내부의 영상 정보 및 음성 정보를 취득하는 제어부를 포함하고, 상기 받침 부와 상기 데이터측정부 및 상기 제어부는 상호 수직방향으로 적층되고, 축사 외부의 공기가 상기 데이터측정부 및 상기 제어부의 내부로 유입된다."}
{"patent_id": "10-2020-0027333", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 축사 모니터링 장치 및 이의 제어방법에 관한 것으로서, 더욱 상세하게는 축사 내부 환경을 모니터링 할 수 있는 축사 모니터링 장치 및 이의 제어방법에 관한 것이다."}
{"patent_id": "10-2020-0027333", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 과학기술정통부의 정의에 따른 스마트팜은 농업기술에 사물인터넷, 빅데이터, 인공지능 기술이 적용 된 자율주행 농기계, 지능형 로봇, 농장자율제어 등과 같은 4차 산업혁명 기술을 접목한 것으로서, 크게 스마트 온실, 스마트과수원, 스마트 축사 등으로 구분한다. 스마트팜을 구성하는 센서는 농가에서는 환경 데이터를 기반으로 제어와 관련된 의사결정을 하기에 스마트팜 구 성에 매우 기초적이고 중요한 요소이다. 우리나라 양돈 농가는 감소하고 있지만 증가하는 축산물에 대한 수요를 만족시키기 위하여 대규모의 축산농가가 증가하는 추세이며, 축산농가가 대형화됨에 따라 축사에서 발생하는 악취문제로 인한 지역주민의 민원이 크게 증가하고 있는 추세이다. 한편, 최소 환기를 시행하는 겨울철 축사 내부는 축산 농가의 악취뿐만 아니라 축사 내에서 발생하는 분진으로 인해 축사 환경 모니터링을 위해 설치된 센서 및 카메라 등의 고장이 잦고 이로 인해 센서의 오작동으로 인한 데이터 신뢰성 약화 및 센서 수리에 인력 및 비용이 많이 소요되고 있다."}
{"patent_id": "10-2020-0027333", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술 한 문제점을 해결하고자 하는 것으로서, 열악한 축사 내부 환경을 모니터링 하는데 있어 센서 고장을 방지할 수 있고, 축사 모니터링을 위한 각종 장비들로부터 발생되는 비용을 감소시키고, 쉽게 설치할 수 있는 축사 모니터링 장치 및 이의 제어방법을 제공하는데 있다."}
{"patent_id": "10-2020-0027333", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예에 의한 축사 모니터링 장치는, 축사를 이루는 구조물의 내측면에 고정되는 받침부; 상기 받 침부에 배치되고, 축사 내부의 대기환경 정보를 취득하는 데이터측정부; 및 상기 데이터측정부에 배치되고, 축 사 내부의 영상 정보 및 음성 정보를 취득하는 제어부를 포함하고, 상기 받침부와 상기 데이터측정부 및 상기 제어부는 상호 수직방향으로 적층되고, 축사 외부의 공기가 상기 데이터측정부 및 상기 제어부의 내부로 유입된 다. 상기 데이터측정부는, 몸체를 이루는 수용부; 상기 수용부의 내부에 수납되어 축사 내부의 대기환경 정보를 취 득하는 다수개의 측정센서; 상기 수용부의 내부와 외부가 상호 연통되도록 상기 수용부를 개폐시키는 개폐부; 상기 개폐부를 선택적으로 개폐시키는 구동부; 및 상기 수용부의 외관을 보호하는 보호대를 포함한다. 상기 수용부는, 상면에 상기 제어부가 삽입되는 삽입홈이 형성된다. 다수개의 상기 측정센서는, 축사 내부의 온도, 습도, 이산화탄소 및 암모니아를 각각 측정한다. 상기 개폐부는, 내측면에 상기 측정센서가 거치되는 고정부가 형성된다. 상기 보호대는, 상기 수용부의 외주면으로부터 거리를 두고 이격되어 고정된다. 상기 보호대의 상기 수용부로부터 이격된 거리는 상기 수용부로부터 개방된 상기 개폐부와 접하지 않는 거리만 큼 이격된다. 상기 데이터측정부는, 다수개로 이루어지고, 상호 수직방향으로 적층된다. 상기 제어부는, 몸체를 이루는 몸체부; 상기 몸체부의 하면으로부터 연장되어 상기 수용부의 삽입홈에 삽입되는 삽입부; 상기 몸체부에 고정되어 축사 내부의 영상 정보를 취득하는 다수개의 촬영부; 상기 몸체부에 고정되어축사 내부의 음성을 취득하는 다수개의 마이크; 상기 데이터측정부로부터 취득한 대기환경 정보와 상기 촬영부 로부터 취득한 영상 정보 및 상기 마이크로부터 취득한 음성 정보를 수집하는 미들웨어; 및 상기 몸체부의 상면 에 장착되어 상기 수용부 및 상기 몸체부에 축사 외부의 공기를 유입시키는 환기팬을 포함한다. 상기 몸체부의 면적은 상기 수용부의 면적보다 크고, 상기 촬영부는, 상기 몸체부의 하면에서 상기 삽입부와 겹 치지 않는 영역에 배치된다. 상기 마이크는, 지향성 마이크로 이루어진다. 상기 삽입부의 하면에는 상기 수용부와 상기 몸체부가 상호 연통되도록 연통공이 형성된다. 상기 제어부는, 상기 수용부 및 상기 몸체부의 내부 온도를 제어하는 전열 공조기를 더 포함한다. 상기 전열 공조기는, 상기 수용부 및 상기 몸체부의 내부를 이슬점 이상의 온도로 유지시킨다. 그리고, 본 발명의 일실시예에 의한 축사 모니터링 시스템은, 축사를 이루는 구조물에 고정되는 받침부와, 축사 내부의 대기환경 정보를 취득하는 데이터측정부 및 축사 내부의 영상 정보 및 음성 정보를 취득하는 제어부로 이루어진 축사 모니터링 장치; 상기 제어부의 촬영부를 통해 촬영된 영상 정보가 저장되는 네트워크 영상 레코 더(NVR); 상기 데이터측정부와 상기 제어부로부터 각각 취득한 대기환경 정보 및 음성 정보가 저장되는 데이터 베이스; 상기 축사 모니터링 장치로부터 취득한 대기환경 정보와 영상 정보 및 음성 정보를 수집하여 상기 데이 터베이스에 저장하는 미들웨어를 포함하고, 상기 받침부와 상기 데이터측정부 및 상기 제어부는 상호 수직방향 으로 적층되고, 축사 외부의 공기가 상기 데이터측정부 및 상기 제어부의 내부로 유입된다. 상기 네트워크 영상 레코더는, 상기 촬영부로부터 TCP/IP통신을 통해 축사 내부의 영상 정보가 저장되고, 상기 데이터베이스는, 데이터측정부로부터 유/무선 통신을 통해 상기 대기환경 정보 및 상기 제어부의 마이크로부터 AUX단자를 통해 축사 내부의 음성 정보가 저장된다. 상기 데이터측정부는, 몸체를 이루는 수용부; 상기 수용부의 내부와 외부가 상호 연통되도록 상기 수용부를 개 폐시키는 개폐부; 및 상기 개폐부를 선택적으로 개폐시키는 구동부;를 포함하며, 상기 미들웨어는 기설정된 주 기에 따라 상기 개폐부의 개방 또는 폐쇄신호를 상기 구동부에 제공한다. 또한, 본 발명의 일실시예에 의한 축사 모니터링 제어방법은, 개폐부에 고정된 다수개의 측정센서가 축사 내부 의 대기환경을 측정하도록 미들웨어가 구동부에 개폐부 개방 요청 메시지를 전송하여 개폐부의 개방을 요청하는 단계; 개폐부 개방 요청 메시지에 대하여 개폐부 개방을 동작 후 개폐부의 상태를 응답하는 구동부로부터 개폐 부의 개방 응답 메시지를 수신하는 단계; 수신된 개폐부의 개방 응답 메시지를 통해 획득한 개폐부의 상태를 데 이터베이스에 업데이트하는 단계; 구동부가 개폐부 개방 상태임을 확인 후 상기 측정센서에 센서 값 요청 메시 지를 전달하는 단계; 상기 측정센서로부터 센서 값을 응답 메시지로 수신하는 단계; 수신된 센서 값을 데이터베 이스에 저장하는 단계; 상기 센서 값을 저장 후 구동부에 개폐부 폐쇄 요청 메시지를 전송하여 개폐부의 폐쇄를 요청하는 단계; 상기 개폐부로부터 구동부를 폐쇄 상태로 변경 후 개폐부 상태를 포함하는 응답 메시지를 수신 하는 단계; 및 데이터베이스에 개폐부 상태를 업데이트 하는 단계를 포함한다. 상기 개폐부 개방 동작 시, 축사 외부의 공기를 유입시키는 환기팬의 동작이 멈추고, 상기 개폐부의 폐쇄 동작 시, 상기 환기팬이 동작하여 축사 외부의 공기를 데이터측정부 및 제어부의 내부로 유입시킨다."}
{"patent_id": "10-2020-0027333", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 축사 모니터링 장치 및 이의 제어방법은 환기팬이 개폐부의 개방에 따라 외부의 깨끗한 공기를 축사 모니터링 장치의 내부로 유입시켜 측정센서에 깨끗한 공기가 접할 수 있도록 함으로써, 측정센서 등의 수 명을 효과적으로 연장시킬 수 있는 효과가 있다."}
{"patent_id": "10-2020-0027333", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는"}
{"patent_id": "10-2020-0027333", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 기재에 의해 정의된다. 한편, 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명 을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한 다. 명세서에서 사용되는 \"포함한다(comprises)\" 또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자 이외의 하나 이상의 다른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는 다. 이하, 본 발명의 바람직한 실시예를 첨부된 도면을 참조하여 상세히 설명한다. 도 1은 본 발명의 일실시예에 따른 축사 모니터링 장치를 나타낸 사시도이고, 도 2는 본 발명의 일실시예에 따 른 축사 모니터링 장치의 데이터측정부를 나타낸 사시단면도이며, 도 3 및 도 4는 본 발명의 일실시예에 따른 데이터측정부를 나타낸 작동도이고, 도 5는 본 발명의 다른 실시예에 따른 데이터측정부를 나타낸 분해단면도이 고, 도 6은 본 발명의 일실시예에 따른 축사 모니터링 장치의 제어부를 나타낸 사시도이고, 도 7은 본 발명의 일실시예에 따른 축사 모니터링 장치의 제어부를 나타낸 저면사시도이고, 도 8은 본 발명의 일실시예에 따른 축 사 모니터링 장치를 나타낸 사시단면도이다. 도 1 내지 도 8을 참조하면 본 발명의 일실시예에 따른 축사 모니터링 장치는 받침부와 데이터측정부 및 제어부를 포함한다. 받침부는 축사를 이루는 구조물의 내측면에 고정되는 것으로서, 축사 내부의 환경을 모니터링 하는 데이터 측정부 및 제어부를 지지한다. 이러한 받침부는 축사 구조물에 고정브라켓을 매개로 하여 고정할 수 있지만, 이에 한정하지 않고, 축사 환경에 따라 용접 등과 같은 다른 방법을 이용하여 고정시킬 수 있다. 그리고, 받침부는 평면상 사각 형상의 케이스로 이루어질 수 있어 필요에 따라 수납공간으로 형성하여 축 사 관리에 필요한 기자재 등을 수납할 수 있다. 데이터측정부는 받침부에 배치된 것으로서, 축사 내부의 대기환경 정보를 취득한다. 이러한 데이터측정부는 받침부와 평면상 동일한 형상 및 크기로 이루어지고, 받침부의 상면에 용접 또는 고정브라켓을 매개로 하여 고정될 수 있다. 이로 인해 데이터측정부는 받침부에 견고하게 고정될 수 있다. 즉, 데이터측정부는 받침부의 상면에 배치되는 것으로서 수직방향으로 배치된다. 이러한 데이터측정부는 수용부와 개폐부와 구동부와 측정센서들 및 보호대를 포 함한다.수용부는 데이터측정부의 몸체를 이루는 것으로서 받침부와 같이 평면상 사각형상의 케이스로 이루어진다. 그리고, 수용부는 받침부의 상부에 적층된다. 즉, 데이터측정부는 축사에 있는 가축들의 직접적인 접촉이 방지되어 가축에 의해 데이터측정부가 손 상되는 것을 방지할 수 있다. 이러한 수용부는 상면에 삽입홈이 형성된다. 삽입홈은 수용부의 상면에 형성된 홈으로써, 제어부가 수용부에 용이하게 삽입되도록 제어 부를 가이드한다. 즉, 삽입홈은 수용부에 제어부가 용이하게 결합될 수 있도록 한다. 한편, 도면에는 삽입홈을 수용부의 평면 형상과 동일하게 형성된 것으로 도시하였지만, 평면상 원형, 다각형 또는 부정형 등 다양한 형상으로 이루어질 수 있다. 개폐부는 수용부의 정면, 구체적으로 수용부에서 축사 내부를 향하는 면에 형성됨이 바람직하다. 그리고, 개폐부는 도 2 내지 도 4에 도시된 바와 같이 수용부의 내부와 외부가 상호 연통되도록 수용 부를 개폐시킨다. 이로 인해 개폐부는 축사 내부의 대기환경 정보를 용이하게 취득할 수 있다. 이러한 개폐부에는 수용부의 내부를 향하는 면에 고정부가 배치된다. 고정부는 바(BAR) 형상으로 이루어진 것으로서, 개폐부의 내측면에 고정된다. 그리고, 이러한 고정부에는 다수개로 이루어진 측정센서들이 거치된다. 즉, 고정부는 측정센서들이 개폐부에 용이하게 고정될 수 있도록 한다. 측정센서는 다수개로 이루어진 것으로서, 수용부의 내부에 수납되어 축사 내부의 대기환경 정보를 취 득한다. 구체적으로 측정센서는 상술한 바와 같이 수용부를 개폐하는 개폐부 내측면에 장착된 고정부 에 고정된다. 한편, 측정센서는 수용부의 내부에 밀폐된 공간에 배치되어 있는 것으로서, 센서의 측정감도가 낮을 수밖에 없다. 또한, 측정센서의 측정감도를 높이기 위해 측정센서를 수용부의 외부에 고정시킬 경우, 축사 내 부의 이물질 또는 축사 내부의 대기환경 등에 의해 오염되거나 이로 인한 작동오류가 발생하는 경우가 있다. 그런데, 본 발명은 상술한 바와 같이 측정센서가 수용부의 내부에 수납되어 있다. 그리고, 측정센서는 수용부에 고정되는 개폐부가 개방될 때, 측정센서가 작동하여 축사 내 부의 대기환경 정보를 취득한다. 이로 인해 본 발명은 측정센서가 작동할 때는 개폐부가 수용부로부터 개방되어 측정센서가 외부로 노출됨으로써, 측정감도를 높일 수 있고, 측정센서가 작동하지 않을 때는 개폐부가 폐쇄됨으 로써, 축사 내부의 이물질들로부터 측정센서를 효과적으로 보호할 수 있다. 이러한 측정센서는 상술한 바와 같이 다수개로 이루어진 것으로서, 온도센서와 습도센서와 이산화탄소센서 및 암모니아센서가 각각 독립적인 형태로 이루어진다. 온도센서는 축사 내부의 온도를 측정하고, 습도센서는 축사 내부의 습도를 측정한다. 따라서, 온도센서 및 습도센서로 인해 축사 내부의 온도 및 습도정보를 정확하게 취득할 수 있어, 이에 따른 축 사 내부 공기의 성분을 용이하게 측정할 수 있고, 이러한 온도 및 습도 정보를 토대로 하여 축사 내부의 대기환 경을 정확하게 파악할 수 있다. 이산화탄소센서는 축사 내부에 형성된 이산화탄소의 농도를 측정하고, 암모니아센서는 축사 내부에 형성된 암모 니아의 농도를 측정한다. 축사 내부에서 발생되는 악취는 주로 이산화탄소 및 암모니아에 의해 발생되는데, 쾌적한 축사를 위해 이산화탄 소 및 암모니아의 농도는 필수적으로 관리해야 하며, 본 발명은 이산화탄소센서 및 암모니아센서를 통해 축사 내부의 이산화탄소 및 암모니아의 농도정보를 정확하게 취득하여 축사 내부에 악취가 발생되는 것을 효과적으로 방지할 수 있다. 한편, 본 발명에서 측정센서는 온도, 습도, 이산화탄소, 암모니아센서로 이루어진 것으로 설명하였지만, 이 외에도, 축사의 환경에 따라 기압, 조도, UV, 풍속, 풍향, 강우, 일산화탄소, 산소, 질소산화가스, 이산화황, 유기화합물질, 미세먼지농도, 전도도, 산성도, 소음센서 등으로 이루어질 수 있다. 이로 인해 본 발명은 축사 내부의 대기환경을 더욱 효과적으로 관리할 수 있다. 구동부는 수용부의 내부에 배치되고, 외부로부터 전원을 인가받아 개폐부를 선택적으로 개폐시 킨다. 이러한 구동부는 도 2내지 도 4에 도시된 바와 같이 개폐부를 가압하여 개폐하는 실린더(126_1), 상 기 실린더(126_1)의 타단이 고정되어 실린더(126_1)를 작동시키는 모터부(126_2) 및 수용부에서 상기 개폐 부와 대면하는 방향의 면에 배치되고, 실린더(126_1) 및 모터부(126_2) 안착되는 지지대(126_3)로 이루어 진다. 보호대는 축사 내부에 있는 가축들로부터 수용부의 외관을 보호하는 것으로서, 수용부에 고정된 다. 그리고, 보호대는 바람직하게는 수용부에서 개폐부가 배치된 방향에 형성된다. 이로 인해 보호대는 축사 내부의 가축이 데이터측정부에 접하는 것을 차단하여 데이터측정부의 내부에 수용된 측정센서가 손상되는 것을 효과적으로 방지할 수 있다. 이러한 보호대는 수용부의 외주면, 즉, 개폐부로부터 거리를 두고 이격되어 고정된다. 구체적으로 수용부로부터 보호대가 이격되는 거리는 수용부로부터 개방된 개폐부가 수용부 로부터 개방될 떼, 개폐부와 상호 접하지 않는 거리만큼 이격된다. 이로 인해 개폐부는 수용부로부터 개방될 때, 보호대의 간섭 없이 용이하게 개방될 수 있다. 한편, 상기와 같은 구성으로 이루어진 데이터측정부는 본 발명의 다른 실시예에서 도 5에 도시된 바와 같 이 사용환경에 따라 다수개로 이루어질 수 있다. 구체적으로 데이터측정부는 수용부 내부에 수용된 측정센서가 축사 내부의 대기환경에 따라서 적합한 측정위치에 배치될 수 있도록 다수개로 이루어져 레고블럭과 같이 수직방향으로 적층될 수 있다. 따라서, 데이터측정부는 축사 내부의 대기환경에 따라 측정센서의 높이를 달리하여 각각 축사 내부를 측정하거나, 각각의 위치에 배치된 측정센서가 동시에 축사 내부를 측정할 수 있다. 이로 인해 데이터측정부는 축사 내부의 대기환경에 따른 적합한 대기환경 정보 데이터를 효율적으로 취득 할 수 있다. 그리고, 다수개로 이루어진 데이터측정부는 상호 용이하게 적층될 수 있도록 수용부의 상부에 적층홈 , 하부에 적층돌기가 형성될 수 있다. 즉, 최하단에 배치된 첫번째 수용부(121_1) 상부에 두번째 수용부(121_2)가 적층될 때, 첫번째 수용부(121_1)의 상부에 형성된 적층홈에 두번째 수용부(121_2)의 하부에 형성된 적층돌기가 삽입된다. 그리고, 두번째 수용부(121_2) 상부에 세번째 수용부(121_3)가 적층될 때, 두번째 수용부(121_2)의 상부에 형성 된 적층홈에 세번째 수용부(121_3)의 하부에 형성된 적층돌기가 삽입된다. 상기와 같이 다수개의 수용부는 적층홈 및 적층돌기의 결합에 의해 용이하게 적층될 수 있다. 한편, 상기와 같이 데이터측정부가 다수개로 이루어진 경우, 삽입홈은 최상단에 배치된 수용부 (121_n)의 상부에 형성된다. 그리고, 최상단에 배치된 수용부(121_n)에 형성된 삽입부는 적층홈과 동일한 형상으로 형성됨이 바람 직하다. 이로 인해 최상단에 배치된 수용부(121_n)에 제어부가 용이하게 결합될 수 있도록 한다. 제어부는 데이터측정부에 배치된 것으로서, 축사 내부의 영상 정보 및 음성 정보를 취득한다. 그리고 제어부는 데이터측정부와 상호 별도의 고정부재, 예컨대 나사결합, 용접결합 등을 통해 상호 결합된다. 이러한 제어부는 받침부 및 데이터측정부와 동일한 형상으로 형성될 수 있다. 즉, 제어부는 데이터측정부의 상면에 배치되는 것으로서 수직방향으로 배치된다. 따라서, 본 발명의 축사 모니터링 장치는 받침부와 데이터측정부 및 제어부가 상호 수직방 향으로 적층된다. 이로 인해 본 발명은 축사 내부의 모니터링을 위한 축사 내부의 대기환경 정보 및 축사 내부의 영상 정보와 음 성 정보를 함께 취득할 수 있음으로써, 센서 설치 및 CCTV 설치 비용을 효과적으로 절감할 수 있다. 이러한 제어부는 도 6 및 도 7에 도시된 바와 같이 몸체부와 삽입부와 촬영부와 마이크 및 환기팬을 포함한다. 몸체부는 제어부의 몸체를 이루는 것으로서 받침부 및 데이터측정부와 동일한 형상으로 형 성될 수 있고, 이와 달리 평면상 원형, 다각형 또는 부정형 등 다양한 형상으로 이루어질 수 있다. 이러한 몸체부는 도 7에 도시된 바와 같이 하면에 삽입부가 형성된다. 삽입부는 몸체부의 하면으로부터 연장된 것으로서, 삽입홈과 대응되는 형상으로 형성된다. 이러한 삽입부는 도 8에 도시된 바와 같이 몸체부가 데이터측정부의 수용부에 삽입될 때, 삽입홈에 삽입되어 몸체부를 용이하게 가이드한다. 한편, 몸체부는 수용부의 면적보다 큰 크기로 이루어진다. 즉, 삽입부가 삽입홈에 삽입될 때, 몸체부가 수용부에 걸쳐질 수 있다. 따라서, 몸체부의 면적이 수용부의 면적보다 큰 크기로 이루어짐으로써, 제어부와 데이터측정부 는 상호 별도의 고정부재, 예컨대 나사결합 용접결합 등을 이용하지 않고, 제어부 자체의 무게를 이 용하여 수용부에 걸쳐질 수도 있다. 이로 인해 본 발명은 축사 내부의 모니터링을 위한 축사 내부의 대기환경 정보를 취득하는 데이터측정부 및 축사 내부의 영상 정보와 음성 정보를 취득하는 제어부를 빠르고 신속하게 설치할 수 있어, 조립시간을 감소시킬 수 있다. 촬영부는 다수개로 이루어진 것으로서, 몸체부에 고정되어 축사 내부의 영상 정보를 취득한다. 구체적으로 촬영부는 도 7에 도시된 바와 같이 수용부의 면적보다 크게 형성된 몸체부의 하면에 고정된 것으로서, 몸체부의 하면에서 삽입부와 겹치지 않는 영역에 배치된다. 이러한 촬영부는 IP카메라로 이루어질 수 있으며, 이에 한정하지 않고 축사 내부를 촬영할 수 있다면 다양 한 형태의 카메라로 이루어질 수 있다. 마이크는 도 7에 도시된 바와 같이 다수개로 이루어진 것으로서, 몸체부에 고정되어 축사 내부의 음 성을 취득한다. 구체적으로 마이크는 수용부의 면적보다 크게 형성된 몸체부의 하면에 고정된 것으로서, 몸체부 의 하면에서 삽입부 및 촬영부와 겹치지 않는 영역에 배치된다. 이러한 마이크는 지향성 마이크로 이루어질 수 있으며, 이에 한정하지 않고 축사 내부의 음성을 취득 할 수 있다면 형태의 마이크로 이루어질 수 있다. 환기팬은 몸체부의 상면에 장착되어 수용부 및 몸체부에 외부 공기를 유입시킨다. 이러한 환기팬은 축사 외부로 노출됨이 바람직하다. 그리고, 몸체부의 하면에 연장된 삽입부에는 연통공이 형성된다. 이로 인해 환기팬에 의해 몸체부의 상면으로부터 유입된 외부의 공기가 수용부까지 용이하게 전 달될 수 있다. 즉, 환기팬은 도 8에 도시된 바와 같이 개폐부의 개방에 따라 축사 외부에 비해서 열악한 환경인 축 사 내부의 대기환경에 노출된 측정센서가 환기팬을 통해 외부의 깨끗한 공기가 수용부 및 몸체 부의 내부로 유입됨으로써, 수용부 내부에 배치된 측정센서에 깨끗한 공기를 접할 수 있도록 한 다. 이로 인해, 환기팬은, 측정센서 등의 수명을 효과적으로 연장시킬 수 있다. 한편, 환기팬은 수용부의 개폐부가 수용부를 폐쇄하면 동작한다. 그리고, 환기팬은 수용부의 개폐부가 수용부로부터 개방되면 동작을 멈춘다. 즉, 환기팬은 개폐부가 수용부를 폐쇄하여 수용부가 밀폐될 때, 외부의 신선한 공기를 수 용부의 내부에 공급할 수 있고, 개폐부가 수용부로부터 개방되면 상기 개폐부를 통해 외부 의 공기가 수용부 내부에 공급됨으로 환기팬을 구동시키기 위한 불필요한 전력을 줄일 수 있다. 한편, 제어부는 수용부 및 몸체부 내부에 이슬이 생기는 것을 방지하기 위해 전열 공조기 를 더 포함할 수 있다. 전열 공조기는 수용부 및 몸체부의 내부 온도를 제어하는 것으로서, 수용부 및 몸체부 의 내부를 이슬점 이상의 온도로 유지할 수 있도록 한다. 한편, 제어부는 축사 모니터링 장치의 전체적인 작동여부를 제어하는 전원부를 더 포함할 수 있다. 즉, 전원부의 제어에 의해 데이터측정부의 측정센서, 구동부, 촬영부, 마이크, 환기 팬, 전열 공조기 등이 선택적으로 작동된다. 이하에서는 도면을 참조하여 상기와 같이 구성되는 본 발명의 일실시예에 따른 축사 모니터링 시스템을 상세히 설명하기로 한다. 도 9는 본 발명의 일실시예에 따른 축사 모니터링 시스템을 나타낸 기능블록도이다. 도 9를 참조하면, 축사 모니터링 시스템은 축사 모니터링 장치와, 네트워크 영상 레코더(NVR: Network Video Recorder)와 데이터베이스 및 미들웨어를 포함한다. 축사 모니터링 장치는 축사 내부의 대기환경과 영상 정보 및 음성 정보를 취득하는 것으로서, 축사를 이루 는 구조물에 고정되는 받침부와, 축사 내부의 대기환경 정보를 취득하는 데이터측정부 및 축사 내부 의 영상 정보 및 음성 정보를 취득하는 제어부로 이루어진다. 네트워크 영상 레코더는 제어부의 촬영부를 통해 촬영된 영상 정보가 저장된다. 이러한 네트워크 영상 레코더는 촬영부로부터 TCP/IP통신을 통해 스위치 허브를 거쳐 축사 내부 의 영상 정보가 저장된다. 한편 본 발명에서는 촬영부를 통해 촬영된 영상 정보가 TCP/IP통신을 통해 네트워크 영상 레코더로 저장되는 것으로 설명하였지만, 축사 내부의 영상 정보를 촬영할 수 있다면, 다양한 통신방식을 통하여 저장될 수 있다. 데이터베이스는 데이터측정부와 제어부로부터 각각 취득한 대기환경 정보 및 음성 정보가 저장 된다. 데이터베이스는 데이터측정부로부터 유/무선 통신을 통해 대기환경 정보 및 제어부의 마이크 로부터 AUX단자를 통해 축사 내부의 음성 정보가 저장된다. 미들웨어는 몸체부의 내부에 수납된 것으로서, 데이터측정부로부터 취득한 대기환경 정보와 촬 영부로부터 취득한 영상 정보 및 마이크로부터 취득한 음성 정보를 수집하고, 수집한 상기 정보들을 데이터베이스에 저장한다. 그리고, 미들웨어는 상기 정보들을 토대로 하여 기설정된 주기에 따라 데이터측정부를 이루는 수용부 를 개폐하는 개폐부의 개방 또는 폐쇄신호를 구동부에 제공한다. 한편, 제어부를 이루는 몸체부의 상부에는 환기팬이 장착된다. 환기팬은 개폐부의 개방 또는 폐쇄신호에 따라 작동한다. 구체적으로 기설정된 주기에 의해 개폐부가 개방되면 환기팬의 동작이 멈추고, 개폐부가 폐쇄되 면 환기팬이 작동한다. 즉, 환기팬은 개폐부가 데이터측정부를 이루는 수용부를 폐쇄하여 수용부가 밀폐될 때, 외부의 신선한 공기를 수용부의 내부에 공급할 수 있어 개폐부의 개방에 따라 축사 외부에 비해 서 열악한 환경인 축사 내부의 대기환경에 노출된 측정센서가 깨끗한 공기를 접할 수 있도록 한다. 이로 인해, 환기팬은, 측정센서 등의 수명을 효과적으로 연장시킬 수 있다. 이하에서는 도면을 참조하여 상기와 같이 구성되는 본 발명의 일실시예에 따른 축사 모니터링 제어방법을 상세 히 설명하기로 한다. 도 10은 본 발명의 일실시예에 따른 축사 모니터링 제어방법을 나타낸 신호 흐름도이다. 도 10을 참조하면, 먼저 개폐부에 고정된 다수개의 측정센서가 축사 내부의 대기환경을 측정하도록 미들웨어가 구동부에 개폐부 개방 요청 메시지를 전송하여 개폐부의 개방을 요청(S910)한 다. 그리고, 개폐부 개방 요청 메시지에 대하여 개폐부 개방 동작 후 개폐부의 상태를 응답하는 구 동부로부터 개폐부의 개방 응답 메시지를 수신(S920)한다. 이어서, 수신된 개폐부의 개방 응답 메시지를 통해 획득한 개폐부의 상태를 데이터베이스에 업 데이트(S930)한다. 그리고, 구동부가 개폐부 개방 상태임을 확인 후 상기 측정센서에 센서 값 요청 메시지를 전달 (S940)한다. 한편, 개폐부가 폐쇄될 때 작동중이던 축사 외부의 공기를 유입시키는 환기팬은 개폐부 개방 동 작 시, 환기팬의 동작이 멈춘다. 이어서, 상기 측정센서로부터 센서 값을 응답 메시지로 수신(S950)한다. 수신된 센서 값을 데이터베이스에 저장(S960)한다. 상기 센서 값을 저장 후 구동부에 개폐부 폐쇄 요청 메시지를 전달(S970)하고, 상기 개폐부로부 터 구동부를 폐쇄 상태로 변경 후 개폐부 상태를 포함하는 응답 메시지를 수신(S980)한다. 데이터베이스에 개폐부 상태를 업데이트(S990) 한다. 한편, 개폐부가 개방되어 동작이 멈춘 환기팬은 개폐부의 폐쇄 동작 시, 환기팬이 작동한 다. 이로 인해 환기팬은 축사 외부의 공기를 데이터측정부 및 제어부의 내부로 유입시킴으로써, 외 부의 신선한 공기를 수용부의 내부에 공급할 수 있어 개폐부의 개방에 따라 축사 외부에 비해서 열악 한 환경인 축사 내부의 대기환경에 노출된 측정센서가 깨끗한 공기를 접할 수 있도록 한다. 즉, 환기팬은, 측정센서 등의 수명을 효과적으로 연장시킬 수 있다. 이상에서 상술한 바와 같이 본 발명은 환기팬이 개폐부의 개방에 따라 외부의 깨끗한 공기가 축사 모 니터링 장치의 내부로 유입되어 측정센서에 깨끗한 공기를 접할 수 있도록 함으로써, 측정센서 등의 수명을 효과적으로 연장시킬 수 있다.본 발명은 전술한 실시예에 국한하지 않고, 본 발명의 기술사상이 허용되는 범위내에서 다양하게 변형하여 실시 할 수 있다."}
{"patent_id": "10-2020-0027333", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 축사 모니터링 장치를 나타낸 사시도. 도 2는 본 발명의 일실시예에 따른 축사 모니터링 장치의 데이터측정부를 나타낸 사시단면도. 도 3 및 도 4는 본 발명의 일실시예에 따른 데이터측정부를 나타낸 작동도. 도 5는 본 발명의 다른 실시예에 따른 데이터측정부를 나타낸 분해단면도. 도 6은 본 발명의 일실시예에 따른 축사 모니터링 장치의 제어부를 나타낸 사시도. 도 7은 본 발명의 일실시예에 따른 축사 모니터링 장치의 제어부를 나타낸 저면사시도. 도 8은 본 발명의 일실시예에 따른 축사 모니터링 장치를 나타낸 사시단면도. 도 9는 본 발명의 일실시예에 따른 축사 모니터링 시스템을 나타낸 기능블록도. 도 10은 본 발명의 일실시예에 따른 축사 모니터링 제어방법을 나타낸 신호 흐름도."}
