{"patent_id": "10-2022-0189230", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0106407", "출원번호": "10-2022-0189230", "발명의 명칭": "맞춤형 테스트 로봇", "출원인": "조선대학교산학협력단", "발명자": "김세진"}}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서비스 로봇이 서비스 작업을 수행할 실내 공간 내에 이동하며 해당 실내 공간에 대한 공간 정보를 생성하는 맞춤형 테스트 로봇에 있어서, 상기 실내 공간 내에서 이동하는 로봇 본체;상기 로봇 본체에 마련되어 상기 실내공간에 대한 공간 정보를 생성하는 센서유닛; 및 상기 센서유닛에서 생성된 공간 정보를 전송하는 통신모듈;을 구비하고,상기 센서유닛은 기입력된 상기 서비스 로봇의 특징 정보에 대응되게 변형되는,맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 센서유닛은상기 로봇 본체 주위의 영상을 촬영할 수 있도록 상기 로봇 본체에 설치되는 영상촬영부; 및상기 로봇 본체에 마련되어 상기 실내 공간 내에 위치한 장애물을 감지하는 장애물 감지부;를 구비하는,맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 영상촬영부는상기 로봇 본체에 설치되며, 상하방향으로 연장된 지지로드;상기 지지로드에 상하방향으로 이동가능하게 설치되는 승강블럭과, 상기 승강블럭에 설치되어 상기 로봇 본체주위를 촬영하는 다수의 촬영 카메라가 마련된 촬영모듈; 및상기 승강블럭을 승강시키는 승강부재;를 구비하는,맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 촬영 카메라들은 상기 승강블럭의 중심을 기준으로 방사상으로 배치되는,맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항 또는 제4항에 있어서, 공개특허 10-2024-0106407-3-상기 촬영모듈은 복수 개가 상하 방향을 따라 상호 이격되게 상기 지지로드에 설치되는,맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항 또는 제4항에 있어서, 상기 촬영 카메라들은 상기 지지로드의 길이방향에 대해 교차하는 방향을 따라 상기 승강블럭에 인접되거나 멀어지도록 설치되고,상기 촬영모듈은 상기 촬영 카메라들을 각각 상기 승강블럭에 인접시키거나 이격시키는 이격 작동부재;를 더 구비하는, 맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 특징 정보는 상기 서비스 로봇의 외형에 대한 정보를 포함하고,상기 특징 정보를 토대로 상기 서비스 로봇에서의 외형에 대응되게 해당 촬영 카메라가 위치하도록 상기 승강부재 및 이격 작동부재를 제어하는 센서 제어부;를 더 구비하는,맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서, 상기 장애물 감지부는상기 로봇 본체에 설치되어 상기 로봇 본체 주위의 장애물을 감지하는 하단 센싱모듈; 및상기 지지로드의 상단에 설치되어 상기 지지로드 상부에서 상기 실내 공간 내의 장애물을 감지하는 상단 센싱모듈;을 구비하는,맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제9항에 있어서, 상기 하단 센싱모듈은 상기 로봇 본체 주위의 장애물을 감지하기 위해 상기 로봇 본체의 전방, 후방 및 좌우 측방에 각각 설치된 다수의 하부센서를 구비하는, 맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 하단 센싱모듈은상기 로봇 본체의 전방에 설치되어 상기 로봇 본체 전방의 장애물을 감지하는 전면 중앙 하부센서;공개특허 10-2024-0106407-4-상기 로봇 본체 전방의 장애물을 감지하기 위해 상기 전면 중앙 하부센서를 기준으로 좌우방향으로 각각 이격된위치의 상기 로봇 본체에, 좌우방향을 따라 이동 가능하게 설치되는 복수의 전면 서브 하부센서;상기 로봇 본체의 후방에 설치되어 상기 로봇 본체 후방의 장애물을 감지하는 후면 중앙 하부센서;상기 로봇 본체 후방의 장애물을 감지하기 위해 상기 후면 중앙 하부센서를 기준으로 좌우방향으로 각각 이격된위치의 상기 로봇 본체에, 좌우방향을 따라 이동 가능하게 설치되는 복수의 후면 서브 하부센서;상기 전면 중앙 하부센서에 대해 상기 전면 서브 하부센서들을 각각 인접 또는 이격시키거나 상기 후면 중앙 하부센서에 대해 상기 후면 서브 하부센서들 각각 인접 또는 이격시키는 제1 센서 이동부재;를 구비하는, 맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 하단 센싱 모듈은 상기 로봇 본체의 좌우 측방에 설치되어 상기 로봇 본체 좌우 측방의 장애물을 감지하는 복수의 측면 중앙 하부센서;상기 로봇 본체 좌우 측방의 장애물을 감지하기 위해 상기 측면 중앙 하부센서를 기준으로 전후방향으로 각각이격된 위치의 상기 로봇 본체에, 전후방향을 따라 이동 가능하게 설치되는 다수의 측면 서브 하부센서; 및상기 측면 중앙 하부센서에 대해 상기 측면 서브 하부센서들을 각각 인접 또는 이격시키는 제1 센서 이동부재;를 구비하는, 맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항 또는 제11항에 있어서, 상기 특징 정보는 상기 서비스 로봇의 외형에 대한 정보를 포함하고,상기 특징 정보를 토대로 상기 서비스 로봇에서의 외형에 대응되게 상기 하단 센싱 모듈의 센서들이 위치하도록상기 제1 센서 이동부재를 제어하는 센서 제어부;를 더 구비하는, 맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서, 상기 상단 센싱모듈은상기 지지로드의 상단에 설치되는 지지블럭; 및상기 지지블럭의 전방, 후방, 상부 및 좌우 측방에 각각 설치되어 해당 로봇 본체 상부의 장애물을 감지하는 다수의 상부 측정센서;를 구비하는, 맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 공개특허 10-2024-0106407-5-상기 지지블럭은 상기 지지로드의 상단에 대해 상방으로 이동가능하게 지지되며, 상기 상단 센싱모듈은 상기 지지블럭을 상기 지지로드에 대해 승강시키는 제2 센서 이동부재;를 더 구비하는,맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서, 상기 지지블럭은상기 지지로드의 상단에 설치되며, 외측면에 상기 상부 측정센서가 설치되는 베이스부재;상기 베이스부재의 전방에, 전후방향으로 이동가능하게 설치되며, 외측면에 상기 상부 측정센서가 설치되는 전방 서브 부재;상기 베이스부재의 후방에, 전후방향으로 이동가능하게 설치되며, 외측면에 상기 상부 측정센서가 설치되는 후방 서브 부재;상기 전방 서브부재의 좌우 측방에, 좌우방향으로 이동가능하게 각각 설치되며, 외측면에 상기 상부 측정센서가설치되는 복수의 제1 측방 서브 부재;상기 베이스부재의 좌우 측방에, 좌우방향으로 이동가능하게 각각 설치되며, 외측면에 상기 상부 측정센서가 설치되는 복수의 제2 측방 서브 부재;상기 후방 서브부재의 좌우 측방에, 좌우방향으로 이동가능하게 각각 설치되며, 외측면에 상기 상부 측정센서가설치되는 복수의 제3 측방 서브 부재;를 구비하는,맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 상단 센싱모듈은 상기 베이스부재에 대해 상기 전방 서브부재 및 후방 서브부재를 각각 인접 또는 이격시키거나 상기 전방 서브부재에 대해 상기 제1 측방 서브부재들을 각각 인접 또는 이격시키거나 상기 베이스부재에 대해 상기 제2 측방 서브부재들을 각각 인접 또는 이격시키거나 상기 후방 서브부재에 대해 상기 제3 측방서브부재들을 각각 인접 또는 이격시키는 제2 센서 이동부재;를 더 구비하는, 맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14항 또는 제16항에 있어서, 상기 특징 정보는 상기 서비스 로봇의 외형에 대한 정보를 포함하고,상기 특징 정보를 토대로 상기 서비스 로봇에서의 외형에 대응되게 상기 상부 측정센서들이 위치하도록 상기 제2 센서 이동부재를 제어하는 센서 제어모듈;을 더 구비하는, 맞춤형 테스트 로봇."}
{"patent_id": "10-2022-0189230", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 서비스 로봇이 서비스 작업을 수행할 실내 공간 내에 이동하며 해당 실내 공간에 대한 공간 정보를 생 성하는 맞춤형 테스트 로봇에 있어서, 상기 실내 공간 내에서 이동하는 로봇 본체와, 상기 로봇 본체에 마련되어 상기 실내공간에 대한 공간 정보를 생성하는 센서유닛과, 상기 센서유닛에서 생성된 공간 정보를 전송하는 통신 모듈을 구비하고, 상기 센서유닛은 기입력된 상기 서비스 로봇의 특징 정보에 대응되게 변형된다. 본 발명에 따른 맞춤형 테스트 로봇은 서비스 로봇의 특징 정보에 대응되게 변형되어 실내 공간 내에서 공간 정 보를 획득하고, 테스트 작업을 수행하므로 서비스 로봇이 서비스 작업을 보다 정확하게 수행할 수 있는 지도 정 보를 획득할 수 있는 장점이 있다."}
{"patent_id": "10-2022-0189230", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 맞춤형 테스트 로봇에 관한 것으로서, 서비스 로봇이 서비스 작업을 수행할 실내 공간 내에서 이동하 며 해당 실내 공간에 대한 정보를 수집하고, 이동 경로를 테스트할 수 있는 맞춤형 테스트 로봇에 관한 것이다."}
{"patent_id": "10-2022-0189230", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4차 산업혁명 시대가 도래하면서 인공지능(AI) 기술은 다양한 산업분야에 융합되고 있으며, 단순하고 반복되는 업무(또는 작업)는 사람을 대신하여 로봇이 대체할 것으로 예상된다. 로봇은 실외 뿐만 아니라 넓은 실내 공간을 갖는 환경(쇼핑몰, 호텔 및 리조트, 오피스 빌딩, 병원 등)에서도 인간을 대신하여 다양한 서비스를 제공할 수 있을 것이다. 이를 위해, 자율주행 로봇은 현재 위치부터 목적지까지의 이동 경로 탐색을 위한 지도가 필요하며, 이 지도에는 로봇이 이동 중에 충돌 예방을 위한 장애물 정보가 포함되어야 한다. 하지만, 실내 자율주행 로봇을 위한 지도 생성은 다양한 서비스 로봇의 특징을 고려해야만 최적의 경로 탐색이 가능하다. 또한, 특정 서비스를 제공하는 로봇이 건물 환경에 원활하게 동작하는지는 해당 로봇을 구입하기 전에 테스트가 필요하다. 즉, 대형 병원에서 병실환자를 위한 식판 이동 로봇은 다른 로봇들과 비교해 부피가 크기 때문에 병 원의 복도 넓이와 회전 이동 가능성까지 고려해야 한다. 만약, 이와 같은 테스트가 없이 서비스 로봇을 구입했 을 때, 제대로 이용하지 못하는 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1985699호: 실내지도 작성 방법 및 그 장치"}
{"patent_id": "10-2022-0189230", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 개선하기 위해 창안된 것으로서, 실내 공간 내에 이동하며 공간 정보를 획득하 고, 실내 지도 정보를 테스트할 수 있는 맞춤형 테스트 로봇을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2022-0189230", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명에 따른 맞춤형 테스트 로봇은 서비스 로봇이 서비스 작업을 수행할 실내 공 간 내에 이동하며 해당 실내 공간에 대한 공간 정보를 생성하는 맞춤형 테스트 로봇에 있어서, 상기 실내 공간 내에서 이동하는 로봇 본체와, 상기 로봇 본체에 마련되어 상기 실내공간에 대한 공간 정보를 생성하는 센서유 닛과, 상기 센서유닛에서 생성된 공간 정보를 전송하는 통신모듈을 구비하고, 상기 센서유닛은 기입력된 상기 서비스 로봇의 특징 정보에 대응되게 변형된다. 상기 센서유닛은 상기 로봇 본체 주위의 영상을 촬영할 수 있도록 상기 로봇 본체에 설치되는 영상촬영부와, 상 기 로봇 본체에 마련되어 상기 실내 공간 내에 위치한 장애물을 감지하는 장애물 감지부를 구비한다. 상기 영상촬영부는 상기 로봇 본체에 설치되며, 상하방향으로 연장된 지지로드와, 상기 지지로드에 상하방향으 로 이동가능하게 설치되는 승강블럭과, 상기 승강블럭에 설치되어 상기 로봇 본체 주위를 촬영하는 다수의 촬영 카메라가 마련된 촬영모듈과, 상기 승강블럭을 승강시키는 승강부재를 구비한다. 상기 촬영 카메라들은 상기 승강블럭의 중심을 기준으로 방사상으로 배치되는 것이 바람직하다. 상기 촬영모듈은 복수 개가 상하 방향을 따라 상호 이격되게 상기 지지로드에 설치되어 있다. 상기 촬영 카메라들은 상기 지지로드의 길이방향에 대해 교차하는 방향을 따라 상기 승강블럭에 인접되거나 멀 어지도록 설치되고, 상기 촬영모듈은 상기 촬영 카메라들을 각각 상기 승강블럭에 인접시키거나 이격시키는 이 격 작동부재를 더 구비한다. 상기 특징 정보는 상기 서비스 로봇의 외형에 대한 정보를 포함하고, 상기 특징 정보를 토대로 상기 서비스 로 봇에서의 외형에 대응되게 해당 촬영 카메라가 위치하도록 상기 승강 부재 및 이격 작동부재를 제어하는 센서 제어부를 더 구비하는 것이 바람직하다. 상기 장애물 감지부는 상기 로봇 본체에 설치되어 상기 로봇 본체 주위의 장애물을 감지하는 하단 센싱모듈과, 상기 지지로드의 상단에 설치되어 상기 지지로드 상부에서 상기 실내 공간 내의 장애물을 감지하는 상단 센싱모 듈을 구비한다. 상기 하단 센싱모듈은 상기 로봇 본체 주위의 장애물을 감지하기 위해 상기 로봇 본체의 전방, 후방 및 좌우 측 방에 각각 설치된 다수의 하부센서를 구비한다. 상기 하단 센싱모듈은 상기 로봇 본체의 전방에 설치되어 상기 로봇 본체 전방의 장애물을 감지하는 전면 중앙 하부센서와, 상기 로봇 본체 전방의 장애물을 감지하기 위해 상기 전면 중앙 하부센서를 기준으로 좌우방향으로 각각 이격된 위치의 상기 로봇 본체에, 좌우방향을 따라 이동 가능하게 설치되는 복수의 전면 서브 하부센서와, 상기 로봇 본체의 후방에 설치되어 상기 로봇 본체 후방의 장애물을 감지하는 후면 중앙 하부센서와, 상기 로봇 본체 후방의 장애물을 감지하기 위해 상기 후면 중앙 하부센서를 기준으로 좌우방향으로 각각 이격된 위치의 상 기 로봇 본체에, 좌우방향을 따라 이동 가능하게 설치되는 복수의 후면 서브 하부센서와, 상기 전면 중앙 하부 센서에 대해 상기 전면 서브 하부센서들을 각각 인접 또는 이격시키거나 상기 후면 중앙 하부센서에 대해 상기 후면 서브 하부센서들 각각 인접 또는 이격시키는 제1 센서 이동부재를 구비한다. 상기 하단 센싱 모듈은 상기 로봇 본체의 좌우 측방에 설치되어 상기 로봇 본체 좌우 측방의 장애물을 감지하는 복수의 측면 중앙 하부센서와, 상기 로봇 본체 좌우 측방의 장애물을 감지하기 위해 상기 측면 중앙 하부센서를 기준으로 전후방향으로 각각 이격된 위치의 상기 로봇 본체에, 전후방향을 따라 이동 가능하게 설치되는 다수의 측면 서브 하부센서와, 상기 측면 중앙 하부센서에 대해 상기 측면 서브 하부센서들을 각각 인접 또는 이격시키 는 제1 센서 이동부재를 구비한다. 상기 특징 정보는 상기 서비스 로봇의 외형에 대한 정보를 포함하고, 상기 특징 정보를 토대로 상기 서비스 로 봇에서의 외형에 대응되게 상기 하단 센싱 모듈의 센서들이 위치하도록 상기 제1 센서 이동부재를 제어하는 센 서 제어부를 더 구비한다. 상기 상단 센싱모듈은 상기 지지로드의 상단에 설치되는 지지블럭과, 상기 지지블럭의 전방, 후방, 상부 및 좌 우 측방에 각각 설치되어 해당 로봇 본체 상부의 장애물을 감지하는 다수의 상부 측정센서를 구비한다. 상기 지지블럭은 상기 지지로드의 상단에 대해 상방으로 이동가능하게 지지되며, 상기 상단 센싱모듈은 상기 지 지블럭을 상기 지지로드에 대해 승강시키는 제2 센서 이동부재를 더 구비할 수도 있다. 상기 지지블럭은 상기 지지로드의 상단에 설치되며, 외측면에 상기 상부 측정센서가 설치되는 베이스부재와, 상 기 베이스부재의 전방에, 전후방향으로 이동가능하게 설치되며, 외측면에 상기 상부 측정센서가 설치되는 전방 서브 부재와, 상기 베이스부재의 후방에, 전후방향으로 이동가능하게 설치되며, 외측면에 상기 상부 측정센서가 설치되는 후방 서브 부재와, 상기 전방 서브부재의 좌우 측방에, 좌우방향으로 이동가능하게 각각 설치되며, 외 측면에 상기 상부 측정센서가 설치되는 복수의 제1 측방 서브 부재와, 상기 베이스부재의 좌우 측방에, 좌우방 향으로 이동가능하게 각각 설치되며, 외측면에 상기 상부 측정센서가 설치되는 복수의 제2 측방 서브 부재와, 상기 후방 서브부재의 좌우 측방에, 좌우방향으로 이동가능하게 각각 설치되며, 외측면에 상기 상부 측정센서가 설치되는 복수의 제3 측방 서브 부재를 구비한다. 상기 상단 센싱모듈은 상기 베이스부재에 대해 상기 전방 서브부재 및 후방 서브부재를 각각 인접 또는 이격시 키거나 상기 전방 서브부재에 대해 상기 제1 측방 서브부재들을 각각 인접 또는 이격시키거나 상기 베이스부재 에 대해 상기 제2 측방 서브부재들을 각각 인접 또는 이격시키거나 상기 후방 서브부재에 대해 상기 제3 측방 서브부재들을 각각 인접 또는 이격시키는 제2 센서 이동부재를 더 구비할 수 있다. 상기 특징 정보는 상기 서비스 로봇의 외형에 대한 정보를 포함하고, 상기 특징 정보를 토대로 상기 서비스 로 봇에서의 외형에 대응되게 상기 상부 측정센서들이 위치하도록 상기 제2 센서 이동부재를 제어하는 센서 제어모 듈을 더 구비할 수 있다."}
{"patent_id": "10-2022-0189230", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 맞춤형 테스트 로봇은 서비스 로봇의 특징 정보에 대응되게 변형되어 실내 공간 내에서 공간 정 보를 획득하고, 테스트 작업을 수행하므로 서비스 로봇이 서비스 작업을 보다 정확하게 수행할 수 있는 지도 정 보를 획득할 수 있는 장점이 있다."}
{"patent_id": "10-2022-0189230", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 발명의 실시예에 따른 맞춤형 테스트 로봇에 대해 상세히 설명한다. 본 발명 은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는 바, 특정 실시 예들을 도면에 예시하고 본문에 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면 을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 첨부된 도면에 있어서, 구조물들의 치수 는 본 발명의 명확성을 기하기 위하여 실제보다 확대하여 도시한 것이다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유 사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 본 발명에 따른 맞춤형 테스트 로봇은 서비스 로봇이 실내 공간 내에서 자율주행하며 서비스 작업을 수행할 수 있도록 해당 서비스 로봇에 제공되는 지도 정보를 생성하는 서비스 로봇 맞춤형 실내 지도 생성 시스템에 이용 되는 로봇이다. 서비스 로봇 맞춤형 실내 지도 생성 시스템과 함께 본 발명의 맞춤형 테스트 로봇을 상세히 설 명하면 하기와 같다. 도 1 내지 도 7에는 본 발명에 따른 서비스 로봇 맞춤형 실내 지도 생성 시스템이 도시되어 있다. 도면을 참조하면, 서비스 로봇이 서비스 작업을 수행할 실내 공간 내에 이동하며 해당 실내 공간에 대한 공간 정보를 생성하는 맞춤형 테스트 로봇와, 상기 맞춤형 테스트 로봇에서 제공되는 공간 정보를 토대로 상기 실내 공간에서 상기 서비스 로봇이 해당 서비스 작업을 수행하기 위한 작동정보를 생성하는 로 봇 제어서버를 구비한다. 상기 맞춤형 테스트 로봇은 상기 실내 공간 내에서 이동하는 로봇 본체와, 상기 로봇 본체에 마 련되어 상기 실내 공간에 대한 공간 정보를 생성하는 센서유닛과, 상기 센서유닛에서 생성된 공간 정 보를 전송하는 제1 통신모듈과, 상기 로봇 본체의 작동을 제어하는 제1 작동 제어유닛을 구비한 다. 상기 로봇 본체는 메인바디와, 상기 메인바디를 이동시키는 이동유닛을 구비한다. 상기 메인바디는 사각 단면을 갖는 구조물로 형성되며, 상부에 상기 센서유닛이 설치되어 있다. 메인 바디의 하부에는 상기 이동유닛이 설치된다. 한편, 메인바디는 이에 한정하는 것이 아니라 원통 형 또는 타원형 등과 같은 다양한 형상으로 형성될 수 있다. 이동유닛은 상기 메인바디를 실내 공간 내에서 이동시키는 것으로서, 무한궤도 또는 다수의 구동휠과 같은 구동수단이 적용된다. 해당 이동유닛은 메인바디를 다방향으로 이동시키기 위해 종래에 일반적 으로 사용되는 구동수단이 적용되므로 상세한 설명은 생략한다. 센서유닛은 해당 로봇 본체 주위의 영상을 촬영할 수 있도록 로봇 본체에 설치되는 영상촬영부 와, 상기 로봇 본체에 마련되어 상기 실내 공간 내에 위치한 장애물을 감지하는 장애물 감지부 를 구비한다. 상기 영상촬영부는 상기 로봇 본체에 설치되며 상하방향으로 연장된 지지로드와, 상기 지지로드 에 마련되는 촬영모듈과, 상기 촬영모듈을 승강시키는 승강부재(미도시)를 구비한다. 지지로드는 메인바디의 상면 중앙부에 설치되며, 상하방향으로 연장된 환봉형으로 형성된다. 상단부 에는 후술되는 장애물 감지부의 상단 센싱모듈이 설치된다. 상기 촬영모듈은 지지로드에 상하방향으로 이동가능하게 설치되는 승강블럭과, 상기 승강블럭 에 설치되어 상기 로봇 본체 주위를 촬영하는 다수의 촬영 카메라를 구비한다. 상기 승강블럭은 사각 단면을 갖는 육면체로 형성되며, 중앙에 상기 지지로드가 관통되는 관통구가 형성된다. 해당 승강블럭은 지지로드를 따라 승강가능하게 지지된다. 촬영 카메라는 상기 승강블럭의 중심을 기준으로 방사상으로 배치되는 것으로서, 해당 승강블럭(23 3)의 전면, 후면, 좌우측면에 각각 설치되어 승강블럭을 기준으로 사방을 촬영한다. 한편, 도 8에는 승강블럭의 또 다른 실시 예가 도시되어 있다. 앞서 도시된 도면에서와 동일한 기능을 하는 요소는 동일 참조부호로 표기한다. 도면을 참조하면, 승강블럭은 팔각형의 단면을 갖는 구조물로 형성된다. 해당 승강블럭의 측면에는 8 개의 촬영카메라가, 원주방향을 따라 상호 이격되게 배치된다. 상술된 승강블럭은 보다 많은 수의 촬영카 메라가 설치되어 다양한 각도에서 영상을 촬영하므로 실내공간에 대한 다양한 공간 정보를 생성할 수 있다. 승강부재는 도면에 도시되진 않았지만, 상단이 승강블럭에 설치되고, 하단이 메인바디에 설치되며, 상하길이가 신축되는 유압 실린더와 같은 액츄에이터가 적용된다. 한편, 승강부재는 이에 한정하는 것이 아니라 해당 승강블럭을 상하방향으로 이동시킬 수 있는 이동수단이면 무엇이든 적용가능하다. 장애물 감지부는 상기 로봇 본체에 설치되어 상기 로봇 본체 주위의 장애물을 감지하는 하단 센 싱모듈과, 상기 지지로드의 상단에 설치되어 상기 지지로드 상부에서 상기 실내 공간 내의 장애 물을 감지하는 상단 센싱모듈을 구비한다. 상기 하단 센싱모듈은 상기 로봇 본체 주위의 장애물을 감지하기 위해 상기 로봇 본체의 전방, 후방 및 좌우 측방에 각각 설치된 다수의 하부센서를 구비한다. 상기 하부센서는 다수개가 메인바디 의 전면, 후면 및 좌우측면에 설치된다. 해당 하부센서는 장애물을 감지할 수 있는 초음파 센서, 라 이다 센서 등 공지된 다양한 센서들을 적용할 수 있다. 상단 센싱모듈은 지지로드의 상단에 설치되는 지지블럭과, 상기 지지블럭에 설치되는 다수 의 상부 측정센서를 구비한다. 상기 지지블럭은 하면 중앙부에, 상기 지지로드의 상단이 고정되며, 사각단면을 갖는 육면체로 형성 된다. 상부 측정센서는 다수개가 지지블럭의 전면, 후면, 좌우측면 및 상면에 설치된다. 해당 상부 측정센서는 장애물을 감지할 수 있는 초음파 센서, 라이다 센서 등 공지된 다양한 센서들을 적용할 수 있 다. 한편, 장애물 감지부는 도면에 도시되진 않았지만, 실내 공간 내의 상기 로봇 본체의 위치 정보를 생 성할 수 있는 지피에스(GPS) 모듈과 같은 위치정보 생성수단이 마련되고, 위치정보 생성수단에서 제공되는 정보 를 토대로 감지된 장애물의 위치 정보를 생성하며, 생성된 장애물의 위치 정보를 하단 센싱모듈 및 상단 센싱모듈의 감지 정보와 함께 로봇 제어서버에 전송할 수 있다. 제1 작동 제어유닛은 제1 정보처리모듈, 특징 정보 데이터 베이스, 센서 제어모듈, 제1 정 보 저장부, 제1 경로 설정모듈, 제1 이동 제어 모듈을 구비한다. 제1 정보처리모듈은 촬영모듈의 촬영 카메라들에 촬영된 영상들과, 장애물 감지부에서 측 정된 감지 정보를 수집하고, 수집된 영상 및 감지 정보를 제1 통신모듈을 통해 로봇 제어서버에 전송 한다. 여기서, 제1 통신모듈은 무선 통신망을 통해 로봇 제어서버와 데이터 통신을 수행하는 것으로 서, 데이터 통신을 위해 종래에 일반적으로 사용되는 통신수단이 적용되므로 상세한 설명은 생략한다. 특징 정보 데이터 베이스는 제1 통신모듈을 통해 로봇 제어서버에서 전송된 서비스 로봇의 특징 정보를 수신하여 저장한다. 여기서, 서비스 로봇의 특징 정보는 서비스 로봇의 종류, 전후폭, 좌우폭, 높이, 부피 등과 같은 외형 정보, 서비스 로봇에서의 메인 카메라 위치에 대한 정보 또는 서 비스 로봇에서의 장애물을 감지하기 위한 감지센서들의 위치에 대한 정보 등이 포함된다. 센서 제어모듈은 특징 정보 데이터 베이스에 저장된 서비스 로봇의 특징정보에 대응되게 승강부 재를 작동시킨다. 상기 센서 제어모듈은 서비스 로봇의 높이에 대응되게 촬영 카메라가 위치하 게 해당 승강부재를 제어한다. 즉, 센서 제어모듈은 서비스 로봇이 비교적 큰 높이를 가지면, 해당 촬영 카메라가 비교적 높이 위치하고, 서비스 로봇의 높이가 비교적 낮으면, 해당 촬영 카메라 가 비교적 낮게 위치하도록 해당 승강부재를 제어한다. 또한, 상기 센서 제어모듈은 특징 정보를 토대로 서비스 로봇에서의 메인 카메라의 위치에 대응 되는 위치 즉, 높이에 촬영 카메라가 위치하도록 해당 승강부재를 작동시킬 수도 있다. 제1 정보 저장부는 로봇 제어서버에서 전송된 정보를 저장하는 것으로서, 제1 입체 정보 데이터 베이 스, 제1 평면 정보 데이터 베이스, 제1 장애물 정보 데이터 베이스를 구비한다. 제1 입체 정보 데이터 베이스는 후술되는 입체 지도 정보가 저장된다. 제1 입체 정보 데이터 베이스 는 제1 통신모듈을 통해 로봇 제어서버에서 전송되는 입체 지도 정보를 수신하여 저장한다. 제1 평면 정보 데이터 베이스는 후술되는 2차원 지도 정보가 저장된다. 제1 평면 정보 데이터 베이스(25 2)는 제1 통신모듈을 통해 로봇 제어서버에서 전송되는 2차원 지도 정보를 수신하여 저장한다. 제1 장애물 정보 데이터 베이스는 후술되는 장애물 정보가 저장된다. 여기서, 제1 장애물 정보 데이터 베 이스는 제1 통신모듈을 통해 로봇 제어서버에서 전송되는 장애물 정보를 저장한다. 제1 경로 설정모듈은 제1 정보 저장부에 저장된 정보를 토대로 실내 공간 내에서 테스트를 수행하는 로봇 본체가 이동되는 테스트 경로를 생성한다. 여기서, 제1 경로 설정모듈은 제1 평면 정보 데이터 베이스에 저장된 2차원 지도 정보를 토대로 실내 환경 내의 초기 경로를 생성하고, 제1 입체 정보 데이터 베이스에 저장된 입체 지도 정보 및 제1 장애물 정보 데이터 베이스에 저장된 장애물 정보를 토대로 초기 경로를 보정하여 해당 맞춤형 테스트 로봇이 장애물을 회피하며 실내 공간 내를 이동할 수 있는 테스 트 경로를 생성한다. 또한, 제1 경로 설정모듈은 생성된 테스트 경로를 제1 이동 제어 모듈에 제공한 다. 제1 이동 제어 모듈은 실내 공간 내에 맞춤형 테스트 로봇이 이동되도록 해당 로봇 본체의 이동 유닛을 제어한다. 여기서, 제1 이동 제어 모듈은 초기 작동 모드 또는 테스트 모드 중 어느 한 모드 로 해당 이동유닛을 작동시킨다. 상기 초기 작동 모드는 실내 지도를 생성하기 위해 해당 실내 공간에 대한 공간 정보를 획득하기 위해 맞춤형 테스트 로봇이 작동하는 모드이다. 제1 이동 제어 모듈은 로봇 제어서버를 통해 초기 작동 모드가 설정되면, 실내 공간에 기입력 설정 경로를 따라 이동하도록 로봇 본체를 제어하고, 센서유닛을 작동시킨다. 여기서, 제1 이동 제어 모듈은 제1 통신모듈을 이용하여 센서유닛의 영상 정보 및 감지 정보를 로봇 제어서버에 전송한다. 이때, 제1 이동 제어 모듈은 장애물 감지부에서 장애물 이 감지되면, 해당 장애물에 로봇 본체가 충돌하는 것을 방지하기 위해 로봇 본체가 해당 장애물을 회피하여 이동하도록 초기 경로를 수정할 수 있다. 한편, 제1 이동 제어 모듈은 로봇 제어서버를 테스트 모드가 설정되면, 상기 제1 경로 설정모듈(24 5)에서 생성된 테스트 경로를 따라 이동되도록 상기 로봇 본체를 제어하고, 센서유닛을 통해 획득한 영상 및 감지 정보를 제1 통신모듈을 통해 로봇 제어서버에 전송한다. 이때, 제1 이동 제어 모듈 은 테스트 경로에 대한 정보도 로봇 제어서버에 전송하는 것이 바람직하다. 상기 로봇 제어서버는 로봇 정보 데이터 베이스, 지도 생성부, 지도 저장부, 서비스 운영 모듈, 테스트 제어 모듈, 서비스 제어 모듈, 및 정보 전송 모듈을 구비한다. 로봇 정보 데이터 베이스는 관리자에 의해 입력된 다수의 서비스 로봇의 특징 정보가 저장되어 있다. 관리자는 해당 실내 공간 내에 서비스 작업을 수행할 서비스 로봇에 대한 특징 정보를 미리 로봇 정보 데 이터 베이스에 입력하는 것이 바람직하다. 지도 생성부는 3차원 지도 생성 모듈, 2차원 지도 생성 모듈 및 장애물 정보 생성 모듈을 구비한다. 3차원 지도 생성 모듈은 맞춤형 테스트 로봇의 영상촬영부에서 제공되는 다수의 영상 정보를 토 대로 실내 공간에 대한 입체 지도 정보를 생성한다. 상기 입체 지도 정보는 실내 공간에 대한 3차원 입체 정보 가 적용된다. 해당 3차원 지도 생성 모듈은 다양한 각도에서 촬영된 영상들을 토대로 입체 지도 정보를 생 성하기 위해 종래에 일반적으로 사용되는 영상 분석 수단이 적용되므로 상세한 설명은 생략한다. 3차원 지도 생 성 모듈은 생성된 입체 지도 정보를 지도 저장부에 저장한다. 한편, 3차원 지도 생성 모듈은 테스트 모드 즉, 상기 테스트 경로를 따라 이동되는 상기 맞춤형 테스트 로 봇의 영상촬영부에서 영상 정보가 전송되면, 해당 영상 정보를 토대로 상기 입체 지도 정보를 보정한 다. 이때, 3차원 지도 생성 모듈은 보정된 입체 지도 정보를 지도 저장부에 저장하는 것이 바람직하 다. 2차원 지도 생성 모듈은 3차원 지도 생성 모듈에서 생성된 입체 지도 정보를 이용하여 상기 실내 공 간에 대한 2차원 지도 정보를 생성한다. 해당 2차원 지도 정보는 해당 실내 공간에 대한 평면도인 것이 바람직 하다. 그리고, 2차원 지도 생성모듈은 생성된 2차원 지도 정보를 지도 지정부에 저장한다. 한편, 2차원 지도 생성 모듈은 테스트 모드 즉, 상기 상기 테스트 경로를 따라 이동되는 상기 맞춤형 테스 트 로봇의 영상촬영부에서 영상 정보가 전송되면, 상기 3차원 지도 생성 모듈에 의해 보정된 입 체 지도 정보를 토대로 상기 2차원 지도 정보를 보정하고, 보정된 2차원 지도 정보를 지도 저장부에 저장 한다. 장애물 정보 생성 모듈은 장애물 감지부에서 제공되는 정보 및 입체 지도 정보를 토대로 실내 공간 내의 장물에 대한 장애물 정보를 생성한다. 해당 장애물 정보는 실내 공간 내의 장애물의 위치, 크기 등에 대한 정보가 포함된다. 상기 장애물 정보 생성 모듈은 생성된 장애물 정보를 지도 저장부에 저장한다. 한편, 장애물 정보 생성 모듈은 테스트 모드 즉, 상기 테스트 경로를 따라 이동되는 상기 맞춤형 테스트 로봇의 장애물 감지부에서 정보가 전송되면, 해당 정보 및 3차원 지도 생성 모듈에서 보정된 입 체 지도 정보를 토대로 상기 장애물 정보를 보정하고, 보정된 장애물 정보를 지도 저장부에 저장한다. 정보 전송 모듈은 3차원 지도 생성 모듈에서 생성된 입체 지도 정보, 2차원 지도 생성 모듈에서 생성 된 2차원 지도 정보 및 장애물 정보 생성 모듈에서 생성된 장애물 정보를 상기 맞춤형 테스트 로봇에 전송한다. 또한, 정보 전송 모듈은 3차원 지도 생성 모듈에서 보정된 상기 입체 지도 정보, 2차원 지도 생 성 모듈에서 보정된 2차원 지도 정보 및 장애물 정보 생성 모듈에서 보정된 장애물 정보를 상기 서비 스 로봇에 전송한다. 지도 저장부는 3차원 지도 생성 모듈에서 생성 또는 보정된 입체 지도 정보가 저장되는 제2 입체 정 보 데이터 베이스와, 2차원 지도 생성 모듈에서 생성 또는 보정된 2차원 지도 정보가 저장되는 제2 평면 정보 데이터 베이스와, 상기 장애물 정보 생성 모듈에서 생성 또는 보정된 장애물 정보가 자정되는 제2 장애물 정보 데이터 베이스를 구비한다. 서비스 운영모듈은 다수의 서비스 로봇에게 다양한 서비스 작업을 지시하고 관리한다. 여기서, 서비 스 작업은 운반물 운반, 청소 등이 적용된다. 관리자는 서비스 로봇이 수행할 서비스 작업에 대한 작업 정 보를 서비스 운영모듈은 해당 작업 정보에 포함된 서비스 작업을 수행한 서비스 로봇을 선정하고, 선 정된 서비스 로봇에게 해당 서비스 작업을 지시한다. 테스트 제어 모듈은 상기 맞춤형 테스트 로봇의 작동에 대한 작동 명령을 해당 맞춤형 테스트 로봇 에 전송한다. 여기서, 관리자는 맞춤형 테스트 로봇의 작동신호를 테스트 제어 모듈에 입력하고, 해당 테스트 제어 모듈은 작동신호가 입력되면 맞춤형 테스트 로봇을 작동시킨다. 이때, 테스트 제어 모듈은 관리자로부터 작동명령이 입력되면, 해당 맞춤형 테스트 로봇이 초기 작동 모드로 작동하도록 제1 모드 선택 정보를 해당 맞춤형 테스트 로봇에 전송한다. 맞춤형 테스트 로봇 의 제1 이동 제어 모듈은 제1 모드 선택 정보를 수신하면 해당 맞춤 테스트 로봇을 초기 작동 모드로 작동 시킨다. 맞춤형 테스트 로봇이 초기 작동 모드로 실내 공간의 모든 영역을 지나면 제1 이동 제어 모듈은 테스 트 제어 모듈로 초기 모드 완료 신호를 전송한다. 테스트 제어 모듈은 상기 초기 모드 완료 신호를 수신하면, 맞춤형 테스트 로봇으로 입체 지도 정보, 2차원 지도 정보 및 장애물 정보가 전송되도록 정보 전송모듈을 제어하고, 해당 테스트 로봇이 테스트 모드로 작동하도록 제2 모드 선택 정보를 전송한다. 여 기서, 이동 제어모듈은 제2 모드 선택 정보를 수신하면, 해당 맞춤 테스트 로봇을 테스트 모드로 작동시킨다. 서비스 제어 모듈은 시비스 운영모듈에서 입력된 서비스 작업을 수행할 수 있도록 서비스 로봇에 작 동 신호를 전송한다. 이때, 서비스 제어 모듈은 서비스 로봇으로 입체 지도 정보, 2차원 지도 정보 및 장애물 정보가 전송되도록 정보 전송모듈을 제어한다. 한편, 상기 서비스 로봇은 도면에 도시되진 않았지만, 실내 공간 내에서 이동하는 서비스 본체와, 상 기 서비스 본체에 마련되어 서비스 작업을 수행하는 작업유닛과, 상기 서비스 본체에 설치되어 실내 공간에 대한 공간 정보를 생성하는 공간 감지부과, 공간 감지부에서 생성된 공간 정보를 로봇 제어서버에 전송하는 제2 통신모듈과, 상기 서비스 본체의 작동을 제어하는 제2 작동 제어유닛 을 구비한다. 상기 서비스 본체는 실내 공간에서 다방향으로 이동될 수 있는 이동 수단이 마련되는 것으로서, 설정된 공 간 내에서 이동되어 작업을 수행하기 위해 종래에 일반적으로 사용되는 로봇이 적용되므로 상세한 설명은 생략 한다. 작업유닛은 도면에 도시되진 않았지만, 실내 공간에서 서비스 작업을 수행하는 것으로서, 운반물을 운반하 기 위한 로봇 암, 실내공간을 청소하기 위한 청소 수단 등과 같이 서비스 작업에 따라 다양한 작업 장치가 적용 될 수 있다. 공간 감지부는 서비스 본체 주위를 촬영하기 위해 상기 서비스 본체에 설치되는 다수의 메인 카 메라와, 상기 서비스 본체 주위의 장애물을 감지하기 위한 다수의 감지센서를 구비한다. 상기 메인 카메라는 도면에 도시되진 않았지만, 다수개가 서비스 본체의 전방, 후방 및 좌우 측방에 각각 설치된다. 감지센서는 장애물을 감지할 수 있는 초음파 센서, 라이다 센서 등 공지된 다양한 센서들 이 적용된다. 여기서, 감지센서는 다수개가 서비스 본체의 상부, 전방, 후방 및 좌우 측방에 각각 설 치되는 것이 바람직하다. 제2 작동 제어유닛은 제2 정보처리모듈, 제2 정보 저장부, 제2 경로 설정모듈 및 제2 이동 제어 모듈을 구비한다. 제2 정보처리모듈은 메인 카메라들에서 촬영된 영상들과, 감지센서에서 측정된 측정 데이터를 수집하고, 수집된 영상 및 측정 데이터를 제2 통신모듈을 통해 로봇 제어서버에 전송한다. 여기서, 제2 통신모듈은 무선 통신망을 통해 로봇 제어서버와 데이터 통신을 수행하는 것으로서, 데이터 통신 을 위해 종래에 일반적으로 사용되는 통신수단이 적용되므로 상세한 설명은 생략한다. 제2 정보 저장부는 상기 로봇 제어서버에서 전송된 입체 지도 정보가 저장되는 제3 입체 정보 데이터 베이스와, 상기 로봇 제어서버에서 전송된 2차원 지도 정보가 저장되는 제3 평면 정보 데이터 베이스와, 상기 로봇 제어서버에서 전송된 장애물 정보가 자정되는 제3 장애물 정보 데이터 베이스를 구비한다. 제2 경로 설정모듈은 제2 정보 저장부에 저장된 정보를 토대로 실내 공간 내에서 서비스 작업을 수행 하는 서비스 로봇이 이동하는 이동 경로를 생성한다. 여기서, 제2 경로 설정모듈은 제2 평면 정보 데 이터 베이스에 저장된 2차원 지도 정보를 토대로 실내 환경 내의 초기 경로를 생성하고, 제2 입체 정보 데 이터 베이스에 저장된 입체 지도 정보 및 제2 장애물 정보 데이터 베이스에 저장된 장애물 정보를 토 대로 초기 경로를 보정하여 해당 서비스 로봇이 장애물을 회피하며 실내 공간 내에서 서비스 작업을 수행 할 수 있는 이동경로를 생성한다. 또한, 제2 경로 설정모듈은 생성된 이동경로를 제2 이동 제어 모듈(44 4)에 제공한다. 여기서, 제2 경로 설정모듈은 기입력된 상기 서비스 로봇의 외형 정보, 상기 실내 공간 내의 장애물 및 해 당 실내 공간 내의 이동 가능 영역에 대한 정보에 따라 상기 이동경로를 변경할 수 있다. 해당 서비스 로봇의 외형 정보는 로봇의 부피, 넓이, 높이, 크기 등이 포함된다. 또한, 상기 이동 가능 영역은 상기 실내 공간 내에 서 로봇의 이동 통로에 해당하는 영역이 적용되고, 이동 가능 영역에 대한 정보에는 해당 이동 가능 영역의 너 비, 넓이, 높이 등이 포함된다. 상술된 바와 같이 제2 경로 설정모듈은 로봇의 부피(넓이, 높이, 크기 등), 장애물, 이동 통로의 넓이와 높이 등에 따라 이동 경로를 상이하게 생성한다. 제2 이동 제어 모듈은 로봇 제어서버로부터 작동신호가 수신되면 서비스 로봇이 이동경로를 따 라 실내 공간을 이동하며 서비스 작업을 수행할 수 있도록 서비스 본체 및 작업유닛을 제어한다. 또 한, 제2 이동 제어 모듈은 공간 감지부의 영상 및 측정 데이터를 로봇 제어서버로 전송할 수 있 도록 제2 정보처리모듈을 제어한다. 한편, 상기 로봇 제어서버의 3차원 지도 생성 모듈은 상기 서비스 로봇에서 제공되는 메인 카메 라의 영상을 토대로 상기 입체 지도 정보를 보정하여 제2 입체 정보 데이터 베이스에 저장한다. 또한, 로봇 제어서버의 2차원 지도 생성 모듈은 보정된 상기 입체 지도 정보를 토대로 상기 2차원 지 도 정보를 보정하여 제2 평면 정보 데이터 베이스에 저장하고, 상기 장애물 정보 생성 모듈은 메인 카메라들의 영상 및 상기 서비스 로봇의 감지센서들의 측정 데이터를 토대로 상기 장애물 정보 를 보정하여 제2 장애물 정보 데이터 베이스에 저장한다. 한편, 상술된 서비스 로봇 맞춤형 실내 지도 생성 시스템의 작동을 상세히 설명하면 다음과 같다. 관리자가 맞춤형 테스트 로봇의 작동 신호를 로봇 제어서버에 입력하면, 로봇 제어서버의 테스 트 제어 모듈은 맞춤형 테스트 로봇이 초기 작동 모드로 작동하도록 제1 모드 선택 정보를 맞춤형 테 스트 로봇에 전송한다. 맞춤형 테스트 로봇은 로봇 제어서버로부터 상기 제1 모드 선택 정보가 입력되면 맞춤 테스트 로봇을 초기 작동 모드로 작동시킨다. 여기서, 맞춤형 테스트 로봇의 제1 이동 제어 모듈은 실내 공간 내에 서, 기입력된 설정 경로를 따라 이동하도록 로봇 본체를 제어하고, 센서유닛을 작동시킨다. 여기서, 제1 이동 제어 모듈은 제1 통신모듈을 통해 센서유닛의 영상 정보 및 감지 정보를 로봇 제어서 버에 전송한다. 맞춤형 테스트 로봇이 초기 작동 모드로 실내 공간의 모든 영역을 지나면 제1 이동 제어 모듈은 테스트 제어 모듈로 초기 모드 완료 신호를 전송한다. 여기서, 로봇 제어서버의 지도 생성부는 맞춤형 테스트 로봇에서 제공되는 다수의 영상 정보를 토대로 실내 공간에 대한 입체 지도 정보를 생성하고, 해당 입체 지도 정보를 토대로 2차원 지도 정보를 생성한 다. 또한, 해당 지도 생성부는 맞춤형 테스트 로봇의 감지 정보 및 입체 지도 정보를 토대로 장애물 정보를 생성한다. 다음, 테스트 제어 모듈은 상기 초기 모드 완료 신호를 수신하면, 맞춤형 테스트 로봇으로 입체 지도 정보, 2차원 지도 정보 및 장애물 정보가 전송되도록 정보 전송모듈을 제어하고, 해당 테스트 로봇이 테스 트 모드로 작동하도록 제2 모드 선택 정보를 전송한다. 이동 제어모듈은 제2 모드 선택 정보를 수신하면, 해당 맞춤 테스트 로봇을 테스트 모드로 작동시킨다. 이때, 맞춤형 테스트 로봇의 제1 경로 설정모듈은 2차원 지도 정보를 토대로 실내 환경 내의 초기 경 로를 생성하고, 제1 입체 정보 데이터 베이스에 저장된 입체 지도 정보 및 제1 장애물 정보 데이터 베이스 에 저장된 장애물 정보를 토대로 초기 경로를 보정하여 해당 맞춤형 테스트 로봇이 장애물을 회피하 며 실내 공간 내를 이동할 수 있는 테스트 경로를 생성한다. 다음, 제1 이동 제어 모듈은 로봇 제어서버를 상기 테스트 경로를 따라 이동되도록 상기 로봇 본체를 제어하고, 센서유닛을 통해 획득한 영상 및 감지 정보를 제1 통신모듈을 통해 로봇 제어서버에 전송한다. 다음, 로봇 제어서버의 지도 생성부는 맞춤형 테스트 로봇의 센서유닛에서 전송된 영상 및 감지 정보를 토대로 입체 지도 정보, 2차원 지도 정보 및 장애물 정보를 보정한다. 그리고, 로봇 제어서버(30 0)는 보정된 입체 지도 정보, 2차원 지도 정보 및 장애물 정보를 서비스 로봇에 전송한다. 서비스 로봇의 제2 경로 설정모듈은 로봇 제어서버로부터 수신된 입체 지도 정보, 2차원 지도 정보 및 장애물 정보를 토대로 해당 서비스 로봇이 장애물을 회피하며 실내 공간 내에서 서비스 작업을 수 행할 수 있는 이동경로를 생성한다. 제2 이동 제어 모듈은 로봇 제어서버로부터 작동신호가 수신되면 서비스 로봇이 이동경로를 따라 실내 공간을 이동하며 서비스 작업을 수행할 수 있도록 서비스 본체 및 작업유닛을 제어한다. 또한, 제2 이동 제어 모듈은 서비스 로봇의 공간 감지부의 영상 및 측정 데이터를 로봇 제어서버로 전송할 수 있도록 제2 정보처리모듈을 제어한다. 이때, 로봇 제어서버의 지도 생성부는 서비스 로봇의 공간 감지부에서 전송된 영상 및 감 지 정보를 토대로 입체 지도 정보, 2차원 지도 정보 및 장애물 정보를 보정하고, 보정된 입체 지도 정보, 2차원 지도 정보 및 장애물 정보를 지도 저장부에 저장한다. 한편, 도 9에는 본 발명의 또 다른 실시 예에 따른 영상촬영부가 도시되어 있다. 도면을 참조하면, 상기 영상촬영부의 촬영모듈은 복수개가 상하방향으로 상호 이격되게 상기 지지로 드에 지지된다. 이때, 승강부재는 도면에 도시되진 않았지만, 복수개가 상기 촬영모듈들의 승강블럭 에 각각 설치되어 해당 승강블럭을 승강시킨다. 상술된 바와 같이 구성된 영상촬영부는 상하방향으로 이격된 복수의 촬영모듈이 마련되고, 승강부재 를 이용하여 각 촬영모듈의 높이를 상이하게 변경할 수 있으므로 보다 다양한 방향에서의 실내 공간에 대 한 영상을 획득할 수 있다는 장점이 있다. 한편, 도 10에는 본 발명의 또 다른 실시 예에 따른 영상촬영부가 도시되어 있다. 도면을 참조하면, 상기 촬영 카메라들은 상기 지지로드의 길이방향에 대해 교차하는 방향을 따라 상 기 승강블럭에 인접되거나 멀어지도록 설치된다. 촬영 카메라는 승강블럭에 대해 전후방향 또는 좌우방향으로 이동가능하게 설치된다. 한편, 도 11과 같이 팔각단면을 같은 승강블럭의 각 측면에도 각각 촬영 카메라가 인접되거나 멀어지 도록 설치될 수 있다. 이때, 촬영모듈은 상기 촬영 카메라들을 각각 승강블럭에 인접시키거나 이격시키는 이격 작동부 재를 더 구비한다. 이격 작동부재는 일단이 촬영 카메라에 고정되고, 타단은 승강블럭에 고정되는 다수의 이격 액 츄에이터를 구비한다. 해당 이격 액츄에이터는 일단에서 타단까지의 길이가 신축되는 것으로서, 스크 류잭 또는 유압 실린더 등과 같은 신축수단이 적용된다. 해당 이격 작동부재는 센서 제어모듈에 의해 작동이 제어된다. 상기 센서 제어모듈은 서비스 로봇의 특징 정보에 대응되게 해당 촬영 카메라들이 위치하도록 이격 작동부재를 작동시킬 수 있다. 이때, 센서 제어모듈은 서비스 로봇의 전후폭 또는 좌우폭 이 비교적 크면 촬영 카메라가 승강블럭으로부터 멀어지도록 이격 작동부재를 작동시키고, 서비 스 로봇의 전후폭 또는 좌우폭이 비교적 작으면 촬영 카메라가 승강블럭에 인접되도록 이격 작 동부재를 작동시킨다. 또한, 센서 제어모듈은 특징 정보를 토대로 서비스 로봇에서의 메인 카메 라의 전후방향 또는 좌우방향 위치를 판별하고, 해당 메인 카메라의 위치에 대응되게 해당 촬영 카메 라가 위치하도록 이격 작동부재를 작동시킬 수 있다. 상술된 바와 같이 구성된 영상 촬영부는 다수의 촬영 카메라를 로봇 본체로부터 전후방향 또는 좌우 방향으로 인접되거나 멀어지게 이동시킬 수 있으므로 다양한 외형을 갖는 서비스 로봇에 대응되게 해당 맞 춤형 테스트 로봇을 변형할 수 있어 서비스 로봇에 보다 적합한 영상 정보를 획득할 수 있다는 장점 이 있다. 한편, 도 12 및 도 13에는 본 발명의 또 다른 실시 예에 따른 하단 센싱 모듈이 도시되어 있다. 도면을 참조하면, 상기 하단 센싱 모듈은 전면 중앙 하부센서, 전면 서브 하부센서, 후면 중앙 하부센서(미도시), 후면 서브 하부센서(미도시), 측면 중앙 하부센서, 측면 서브 하부센서 및 제1 센 서 이동부재를 구비한다. 한편, 메인 바디는 하단 센싱 모듈의 센서들을 상호 슬라이딩 가능하게 지지할 수 있도록 상기 제1 센서 이동부재에 의해 상호 인접되거나 이격되게 지지된 메인 블럭, 전방 서브 블럭, 복수의 제 1 측방 서브 블럭, 후방 서브 블럭, 복수의 제2 측방 서브 블럭, 복수의 제3 측방 서브 블럭 을 구비한다. 메인 블럭은 하부에 이동유닛이 설치되며, 상면 중앙에 상기 지지로드가 고정되어 있다. 전방 서브 블럭은 메인 블럭의 전면에, 전후방향으로 슬라이딩 가능하게 지지된다. 제1 측방 서브 블럭 은 전방 서브 블럭의 좌우측면에, 각각 좌우방향으로 슬라이딩 가능하게 지지된다. 후방 서브 블럭 은 메인 블럭의 후면에, 전후방향으로 슬라이딩 가능하게 지지된다. 제2 측방 서브 블럭은 후방 서브 블럭의 좌우측면에, 각각 좌우방향으로 슬라이딩 가능하게 지지된다. 제3 측방 서브 블럭은 메 인 블럭의 좌우측면에, 각각 좌우방향으로 슬라이딩 가능하게 지지된다. 전면 중앙 하부센서는 상기 로봇 본체의 전방에 설치되어 상기 로봇 본체 전방의 장애물을 감지 한다. 여기서, 전면 중앙 하부센서는 메인 블럭의 전면 중앙부에 설치되는 것이 바람직하다. 전면 서브 하부센서들은 상기 로봇 본체 전방의 장애물을 감지하기 위해 상기 전면 중앙 하부센서 를 기준으로 좌우방향으로 각각 이격된 위치의 상기 로봇 본체에, 좌우방향을 따라 이동 가능하게 설 치된다. 여기서, 전면 서브 하부센서들은 제1 측방 서브 블럭들의 전면에 각각 설치되는 것이 바람직 하다. 후면 중앙 하부센서는 상기 로봇 본체의 후방에 설치되어 상기 로봇 본체 후방의 장애물을 감지한다. 상기 후면 중앙 하부센서는 후방 서브 블럭의 후면 중앙부에 설치되는 것이 바람직하다. 후면 서브 하부센서는 상기 로봇 본체 후방의 장애물을 감지하기 위해 상기 후면 중앙 하부센서를 기준으 로 좌우방향으로 각각 이격된 위치의 상기 로봇 본체에, 좌우방향을 따라 이동 가능하게 설치된다. 이때, 후면 서브 하부센서들은 제2 측방 서브 블럭들의 후면에 각각 설치되는 것이 바람직하다. 측면 중앙 하부센서들은 상기 로봇 본체의 좌우 측방에 설치되어 상기 로봇 본체 좌우 측방의 장애물을 감지한다. 여기서, 측면 중앙 하부센서들은 제3 측방 서브 블럭들의 좌우측면에 각각 설치 되는 것이 바람직하다. 측면 서브 하부센서들은 상기 로봇 본체 좌우 측방의 장애물을 감지하기 위해 상기 측면 중앙 하부센 서를 기준으로 전후방향으로 각각 이격된 위치의 상기 로봇 본체에, 전후방향을 따라 이동 가능하게 설치된다. 여기서, 측면 서브 하부센서들은 제3 측방 서브 블럭들의 좌우측면에 각각 설치되는 것이 바람직하다. 상기 전면 중앙 하부센서, 전면 서브 하부센서, 후면 중앙 하부센서, 후면 서브 하부센서, 측면 중앙 하부센서, 측면 서브 하부센서는 장애물을 감지할 수 있는 초음파 센서, 라이다 센서 등 공지된 다양 한 센서들을 적용할 수 있다. 상기 제1 센서 이동부재는 제1 전방 액츄에이터, 제1 후방 액츄에이터, 복수의 제1 측방 액츄에 이터, 복수의 제2 측방 액츄에이터 및 복수의 제3 측방 액츄에이터(미도시)를 구비한다. 제1 전방 액츄에이터는 전단이 전방 서브 블럭에 설치되고, 후단이 메인 블럭이 설치되어 전후 방향 길이가 신축된다. 제1 후방 액츄에이터는 전단이 메인 블럭에 설치되고, 후단이 후방 서브 블럭 에 설치되어 전후방향 길이가 신축된다. 제1 측방 액츄에이터들은 일단이 전방 서브 블럭에 설 치되고, 타단이 제1 측방 서브 블럭에 설치되며, 일단에서 타단까지의 길이가 신축된다. 제2 측방 액츄에 이터들은 일단이 메인 블럭에 설치되고, 타단이 제3 측방 서브 블럭에 설치되며, 일단에서 타단 까지의 길이가 신축된다. 제3 측방 액츄에이터들은 일단이 후방 서브 블럭에 설치되고, 타단은 제2 측방 서브 블럭에 설치되며, 일단에서 타단까지의 길이가 신축된다. 상술된 제1 센서 이동부재는 센서 제 어모듈에 의해 작동이 제어된다. 상기 센서 제어모듈은 서비스 로봇의 특징 정보에 대응되게 해당 하부센서들이 위치하도록 제1 센서 이동부재를 작동시킬 수 있다. 이때, 센서 제어모듈은 상기 메인바디가, 서비스 로봇의 전후폭 또는 좌우폭에 대응되는 전후 폭 또는 좌우 폭을 갖도록 해당 제1 센서 이동부재의 액츄에이터들을 작동시킨다. 또한, 센서 제어모듈은 특징 정보를 토대로 서비스 로봇에서의 감지센서들의 위치 에 하단 센싱 모듈의 하부센서들이 위치하도록 이격 작동부재를 작동시킬 수도 있다. 상술된 바와 같이 구성된 하부 센싱모듈은 다수의 하부센서들을, 서비스 로봇의 특징 정보에 대응되게 배 치할 수 있으므로 서비스 로봇에 보다 적합한 실내 공간에 대한 공간 정보를 획득할 수 있다는 장점이 있 다. 한편, 도 14에는 본 발명의 또 다른 실시 예에 따른 상단 센싱모듈이 도시되어 있다. 도면을 참조하면, 상기 지지블럭은 상기 지지로드의 상단에 대해 상방으로 이동가능하게 지지된다. 이때, 상기 상단 센싱모듈은 상기 지지블럭을 상기 지지로드에 대해 승강시키는 제2 센서 이동 부재(미도시)를 더 구비한다. 제2 센서 이동부재는 도면에 도시되진 않았지만, 상단이 지지블럭에 설치되고, 하단은 지지로드(23 1)의 상부에 설치되며, 상하 길이가 신축되는 단위 신축부재를 구비한다. 상기 단위 신축부재는, 스크류잭 또는 유압 실린더 등과 같은 신축수단이 적용된다. 해당 제2 센서 이동부재는 센서 제어모듈에 의해 작동 이 제어된다. 상기 센서 제어모듈은 서비스 로봇의 특징 정보에 대응되게 상부 측정센서들이 위치하도록 제2 센서 이동부재를 작동시킬 수 있다. 이때, 센서 제어모듈은 상부 측정센서가 서비스 로봇 의 최상단 위치에 대응되는 높이에 위치하도록 상기 제2 센서 이동부재를 작동시킨다. 또한, 센서 제어모 듈은 특징 정보를 토대로 서비스 로봇에서의 감지센서들의 위치에 상부 측정센서들이 위치 하도록 제2 이격 작동부재를 작동시킬 수도 있다. 상술된 상단 센싱모듈은 상부 측정센서를 서비스 로봇의 최상단부에 대응되는 높이에 위치시킬 수 있으므로 서비스 로봇에 보다 적합한 실내 공간에 대한 공간 정보를 획득할 수 있다는 장점이 있다. 한편, 도 15에는 본 발명의 또 다른 실시 예에 따른 상단 센싱모듈이 도시되어 있다. 도면을 참조하면 상기 상단 센싱모듈의 지지블럭이, 다수의 상부 측정센서를 상호 인접되거나 이격되게 지지하도록 형성되어 있다. 상기 지지블럭은 제2 센서 이동부재에 의해 상호 슬라이딩 가능 하게 지지되는 베이스부재, 전방 서브 부재, 후방 서브 부재, 복수의 제1 측방 서브 부재, 복수의 제2 측방 서브 부재 및 복수의 제3 측방 서브 부재를 구비한다. 상기 베이스부재는 하면 중앙부에 지지로드의 상단부가 고정되며, 직육면체 형태로 형성되어 있다. 베이스부재의 상면에, 상기 상부 측정센서가 설치되어 있다. 전방 서브 부재는 베이스부재의 전면에, 전후방향으로 슬라이딩 가능하게 지지된다. 전방 서브 부재 의 전면에, 상기 상부 측정센서가 설치되어 있다. 후방 서브 부재는 베이스부재의 후면에, 전후방향으로 이동가능하게 설치된다. 후방 서브 부재의 후면에는 상부 측정센서가 설치되어 있다. 제1 측방 서브 부재는 전방 서브 부재의 좌우 측면에, 각각 좌우방향으로 이동가능하게 설치된다. 여 기서, 제1 측방 서브 부재는 육면체로 형성되며, 하면을 제외한 나머지 외측면에 상부 측정센서가 설 치되어 있다. 제2 측방 서브 부재는 베이스부재의 좌우 측면에, 좌우방향으로 이동가능하게 설치된다. 여기서, 제2 측방 서브 부재는 육면체로 형성되며, 하면을 제외한 나머지 외측면에 상부 측정센서가 설치되어 있 다. 제3 측방 서브 부재는 후방 서브 부재의 좌우 측면에, 각각 좌우방향으로 이동가능하게 설치된다. 여 기서, 제3 측방 서브 부재는 육면체로 형성되며, 하면을 제외한 나머지 외측면에 상부 측정센서가 설 치되어 있다. 한편, 제2 센서 이동부재는 상기 베이스부재에 대해 상기 전방 서브부재 및 후방 서브부재를 각각 인 접 또는 이격시키거나 상기 전방 서브부재에 대해 상기 제1 측방 서브부재들을 각각 인접 또는 이격시키거나 상 기 베이스부재에 대해 상기 제2 측방 서브부재들을 각각 인접 또는 이격시키거나 상기 후방 서브부재에 대 해 상기 제3 측방 서브부재들을 각각 인접 또는 이격시킨다. 상기 제2 센서 이동부재는 제2 전방 액츄에이 터, 제2 후방 액츄에이터, 복수의 제4 측방 액츄에이터, 복수의 제5 측방 액츄에이터, 및복수의 제6 측방 액츄에이터를 더 구비한다. 제2 전방 액츄에이터는 전단이 전방 서브 부재에 설치되고, 후단이 베이스부재에 설치되어 전후 방향 길이가 신축된다. 제2 후방 액츄에이터는 전단이 베이스부재에 설치되고, 후단이 후방 서브 부 재에 설치되어 전후방향 길이가 신축된다. 제4 측방 액츄에이터들은 일단이 전방 서브 부재에 설치되고, 타단은 제1 측방 서브 부재에 설치되며, 일단에서 타단까지의 길이가 신축된다. 제5 측방 액츄 에이터들은 일단이 베이스부재에 설치되고, 타단이 제2 측방 서브 부재에 설치되며, 일단에서 타단까지의 길이가 신축된다. 제6 측방 액츄에이터들은 일단이 후방 서브 부재에 설치되고, 타단은 제6 측방 서브 부재에 설치되며, 일단에서 타단까지의 길이가 신축된다. 상술된 제2 센서 이동부재는 센서 제어모듈에 의해 작동된다. 상기 센서 제어모듈은 서비스 로봇의 특징 정보에 대응되게 상부 측정센서들이 위치하도록 제2 센서 이동부재를 작동시킬 수 있다. 이때, 센서 제어모듈은 상기 지지블럭이, 서비스 로봇(40 0)의 전후폭 또는 좌우폭에 대응되는 전후 폭 또는 좌우 폭을 갖도록 해당 제2 센서 이동부재의 액츄에이 터들을 작동시킨다. 또한, 센서 제어모듈은 특징 정보를 토대로 서비스 로봇에서의 감지센서들 의 위치에 상부 측정센서들이 위치하도록 제2 센서 작동부재를 작동시킬 수도 있다. 상술된 바와 같이 구성된 상부 센싱모듈은 다수의 상부 측정센서들을, 서비스 로봇의 특징 정보에 대 응되게 배치할 수 있으므로 서비스 로봇에 보다 적합한 실내 공간에 대한 공간 정보를 획득할 수 있다는 장점이 있다."}
{"patent_id": "10-2022-0189230", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "제시된 실시예들에 대한 설명은 임의의 본 발명의 기술분야에서 통상의 지식을 가진 자가 본 발명을 이용하거나 또는 실시할 수 있도록 제공된다. 이러한 실시예들에 대한 다양한 변형들은 본 발명의 기술 분야에서 통상의 지 식을 가진자에게 명백할 것이며, 여기에 정의된 일반적인 원리들은 본 발명의 범위를 벗어남이 없이 다른 실시 예들에 적용될 수 있다. 그리하여, 본 발명은 여기에 제시된 실시예들로 한정되는 것이 아니라, 여기에 제시된 원리들 및 신규한 특징들과 일관되는 최광의의 범위에서 해석되어야 할 것이다."}
{"patent_id": "10-2022-0189230", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 맞춤형 테스트 로봇을 이용한 서비스 로봇 맞춤형 실내 지도 생성 시스템에 대한 개념도 이고, 도 2는 도 1의 서비스 로봇 맞춤형 실내 지도 생성 시스템의 맞춤형 테스트 로봇에 대한 블럭도이고, 도 3은 도 1의 서비스 로봇 맞춤형 실내 지도 생성 시스템의 로봇 제어서버에 대한 블럭도이고, 도 4는 도 1의 서비스 로봇 맞춤형 실내 지도 생성 시스템의 서비스 로봇에 대한 블럭도이고, 도 5 및 도 6은 도 1의 서비스 로봇 맞춤형 실내 지도 생성 시스템의 맞춤형 테스트 로봇에 대한 평면도이고, 도 7은 도 1의 서비스 로봇 맞춤형 실내 지도 생성 시스템의 촬영모듈에 대한 평면도이고, 도 8은 본 발명의 또 다른 실시 예에 따른 촬영모듈에 대한 평면도이고, 도 9는 본 발명의 또 다른 실시 예에 따른 맞춤형 테스트 로봇에 대한 평면도이고, 도 10은 본 발명의 또 다른 실시 예에 따른 촬영모듈에 대한 평면도이고, 도 11은 본 발명의 또 다른 실시 예에 따른 촬영모듈에 대한 평면도이고, 도 12 및 도 13은 본 발명의 또 다른 실시 예에 따른 하단 센싱모듈에 대한 측면도이고, 도 14는 본 발명의 또 다른 실시 예에 따른 상단 센싱모듈에 대한 사시도이고, 도 15는 본 발명의 또 다른 실시 예에 따른 상단 센싱모듈에 대한 사시도이다."}
