{"patent_id": "10-2015-0087462", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0149802", "출원번호": "10-2015-0087462", "발명의 명칭": "컴퓨터 기반의 작업 현황 모니터링 시스템 및 이의 작업 근거 데이터 수집 방법", "출원인": "(주)씽크포비엘", "발명자": "박지환"}}
{"patent_id": "10-2015-0087462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 실행 파일을 기반으로 사용자가 현재 수행하는 작업을 확인한 후, 상기 작업이 수행됨에 의해 발생하는이벤트 데이터 모두를 수집하는 데이터 수집 단계;상기 작업에 대응되는 데이터 필터링 조건을 기반으로 상기 이벤트 데이터를 필터링하여 유효 데이터만을 추출하는 데이터 필터링 단계;시스템 부하를 확인한 후, 상기 시스템 부하에 따라 상기 데이터 수집 단계의 데이터 수집 주기와 상기 데이터필터링 단계의 데이터 필터링 주기를 조정하는 부하 확인 단계;상기 유효 데이터를 기반으로 작업 근거 데이터를 산출한 후, 사용자에게 안내하고 동의 여부를 문의하는 작업근거 데이터 산출 단계;사용자가 상기 작업 근거 데이터에 대해 동의한 경우에는 상기 작업 근거 데이터를 저장 및 출력하되, 그렇지않으면 수정 사항 입력을 요청하는 작업 근거 데이터 출력 단계; 및 상기 수정 사항을 반영하여 상기 작업 근거 데이터를 수정한 후 상기 모니터링 서버에 제출하되, 상기 수정 사항을 반영하여 상기 데이터 필터링 조건을 인공 지능 방식으로 재학습시키는 필터링 조건 보정 단계를 포함하는작업 근거 데이터 수집 방법."}
{"patent_id": "10-2015-0087462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 데이터 필터링 조건은데이터 필터링 대상이 되는 파일 확장자, 프로세스, 폴더 형식, 파일 저장 경로 정보, 프로토콜, 및 프로그램중 적어도 하나에 대한 정보를 포함하는 것을 특징으로 하는 작업 근거 데이터 수집 방법."}
{"patent_id": "10-2015-0087462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 부하 확인 단계는CPU 리소스, 저장 매체 리소스, 및 네트워크 리소스를 기반으로 시스템 부하를 확인하며, 상기 CPU 리소스를 모니터링 및 분석하여 상기 필터링 주기를 조정하고, 상기 저장 매체 리소스와 상기 네트워크 리소스를 기반으로상기 데이터 수집 주기를 조정하는 것을 특징으로 하는 작업 근거 데이터 수집 방법."}
{"patent_id": "10-2015-0087462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 부하 확인 단계는상기 저장 매체 리소스를 모니터링 및 분석하여, 상기 작업 근거 데이터의 저장 주기 또는 용량을 조정하는 기능을 더 포함하는 것을 특징으로 하는 작업 근거 데이터 수집 방법."}
{"patent_id": "10-2015-0087462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 작업 진행, 대기, 종료 여부를 수동 선택할 수 있는 작업 관리창을 추가로 제공하고, 상기 작업 관리창을 통해입력되는 사용자 제어값에 따라 작업 근거 데이터의 수집 여부를 결정하는 단계를 더 포함하는 것을 특징으로하는 작업 근거 데이터 수집 방법."}
{"patent_id": "10-2015-0087462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 데이터 수집 단계는 상기 사용자 실행 파일의 파일명 형식을 기반으로 상기 작업을 확인할 수 있으며, 공개특허 10-2016-0149802-3-상기 파일명 형식은 프로젝트 코드, 작업명, 및 부가 정보 순으로 구성되는 것을 특징으로 하는 작업 근거 데이터 수집 방법."}
{"patent_id": "10-2015-0087462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제7항 중 어느 한 항에 기재된 작업 근거 데이터 수집 장치를 실행하는 프로그램을 기록한 컴퓨터로읽을 수 있는 기록매체."}
{"patent_id": "10-2015-0087462", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "사용자 실행 파일을 기반으로 사용자가 현재 수행하는 작업을 확인하는 작업 확인부;기 설정된 데이터 수집 주기에 따라 상기 작업이 수행됨에 의해 발생하는 이벤트 데이터 모두를 수집하는 데이터 수집부;기 설정된 필터링 주기에 따라 상기 작업에 대응되는 데이터 필터링 조건을 기반으로 상기 이벤트 데이터를 필터링하여 유효 데이터만을 추출하는 데이터 필터링부;시스템 부하를 확인한 후, 상기 시스템 부하에 따라 상기 데이터 수집 주기와 상기 데이터 필터링 주기를 조정하는 시스템 부하 확인부;상기 유효 데이터를 기반으로 작업 근거 데이터를 산출한 후, 사용자에게 안내하고 동의 여부를 문의하는 작업근거 데이터 산출부;사용자가 상기 작업 근거 데이터에 대해 동의한 경우에는 상기 작업 근거 데이터를 저장 및 출력하되, 그렇지않으면 수정 사항 입력을 요청하고 이에 응답하여 입력되는 상기 수정 사항을 반영하여 상기 작업 근거 데이터를 수정한 후 저장 및 출력하는 작업 근거 데이터 출력부; 및 상기 수정 사항을 반영하여 상기 작업에 대응되는 데이터 필터링 조건을 인공 지능 방식으로 재학습시키는 필터링 조건 학습부를 포함하는 작업 근거 데이터 수집 장치."}
{"patent_id": "10-2015-0087462", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 컴퓨터 기반의 작업 현황 모니터링 시스템 및 이의 작업 근거 데이터 수집 방법에 관한 것으로, 상기 방법은 사용자 실행 파일을 기반으로 사용자가 현재 수행하는 작업을 확인한 후, 상기 작업이 수행됨에 의해 발 생하는 이벤트 데이터 모두를 수집하는 데이터 수집 단계; 상기 작업에 대응되는 데이터 필터링 조건을 기반으로 (뒷면에 계속)"}
{"patent_id": "10-2015-0087462", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 작업 현황 모니터링 기술에 관한 것으로, 특히 시스템 부하를 최소화하면서 컴퓨터 기반으로 수행되 는 작업 현황을 보다 신뢰성 있게 모니터링할 수 있도록 하는 컴퓨터 기반의 작업 현황 모니터링 시스템 및 이 의 작업 근거 데이터 수집 방법에 관한 것이다."}
{"patent_id": "10-2015-0087462", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "조직에서 구성원들의 의욕을 불러일으키는 것은 조직 발전은 물론 조직 구성원 개인의 발전을 위해서도 매우 중 요한 의미가 있다. 이를 위해서는 조직 구성원에 업무 스케줄, 업무 현황을 효과적으로 안내하는 것과, 조직 구 성원의 업무 성과를 객관적으로 평가하고 이를 기반으로 적절한 보상을 지급하는 것이 매우 중요하다. 만약, 동기 부여 수단으로 도입된 제도가 그 기능을 제대로 수행하지 않는다면, 이 또한 비효율성을 양상하게 될 것이며, 구성원들의 동기 부여에 실패하여 조직 생산성을 저해하는 요소로 작용할 수 있다. 따라서 대부분의 조직이 전사적 자원 관리(ERP) 시스템을 도입하고, 이를 통해 업무 현황 및 직원별 업무 성과 분석 작업을 수행하였으나 이는 세부적인 작업 지시 및 그에 따른 구체적 작업 현황을 반영하기가 어렵고 직원 별 업무 성과 분석에 있어서도 세밀한 분석이 기하는데 문제점을 가진다. 이에 국내공개번호 10-2004-0100474에서는 제품 생산을 위한 작업 공정별 세부 작업 지시, 작업 실적의 정확한 집계 및 분석이 가능한 작업 현황 및 작업 실적 관리 시스템을 제공하고 있으나, 이는 제조 공정 라인 기반의 직무에 한한 것으로, 컴퓨터 위주로 수행되는 직무 분석에는 적합하지 못한 단점이 있다. 즉, 개인 작업 위주로 수행되는 컴퓨터 작업의 경우, 개인이 업무에 관련된 작업을 수행하는지 사적인 작업을 하고 있는지 명확히 파악하기 어려우며, 이에 따라 컴퓨터 기반으로 수행되는 직무를 효율적으로 관리 및 분석"}
{"patent_id": "10-2015-0087462", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "하기가 거의 불가능한 문제가 있다. 발명의 내용"}
{"patent_id": "10-2015-0087462", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 상기와 같은 문제점을 해결하기 위한 것으로서, 본 발명은 시스템 부하는 최소화하되, 작업 현황을 파악하 기 위한 작업 근거 데이터를 보다 정확하고 세밀하게 수집 및 제공할 수 있도록 함으로써, 컴퓨터 기반으로 수 행되는 작업 현황을 보다 신뢰성 있게 모니터링할 수 있도록 하는 컴퓨터 기반의 작업 현황 모니터링 시스템 및 이의 작업 근거 데이터 수집 방법을 제공하고자 한다. 본 발명의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로 부터 본 발명이 속하는 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2015-0087462", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 수단으로서, 본 발명의 일 실시 형태에 따르면, 사용자 실행 파일을 기반으로 사용 자가 현재 수행하는 작업을 확인한 후, 상기 작업이 수행됨에 의해 발생하는 이벤트 데이터 모두를 수집하는 데 이터 수집 단계; 상기 작업에 대응되는 데이터 필터링 조건을 기반으로 상기 이벤트 데이터를 필터링하여 유효 데이터만을 추출하는 데이터 필터링 단계; 시스템 부하를 확인한 후, 상기 시스템 부하에 따라 상기 데이터 수 집 단계의 데이터 수집 주기와 상기 데이터 필터링 단계의 데이터 필터링 주기를 조정하는 부하 확인 단계; 상 기 유효 데이터를 기반으로 작업 근거 데이터를 산출한 후, 사용자에게 안내하고 동의 여부를 문의하는 작업 근 거 데이터 산출 단계; 사용자가 상기 작업 근거 데이터에 대해 동의한 경우에는 상기 작업 근거 데이터를 저장 및 출력하되, 그렇지 않으면 수정 사항 입력을 요청하는 작업 근거 데이터 출력 단계; 및 상기 수정 사항을 반 영하여 상기 작업 근거 데이터를 수정한 후 상기 모니터링 서버에 제출하되, 상기 수정 사항을 반영하여 상기 데이터 필터링 조건을 인공 지능 방식으로 재학습시키는 필터링 조건 보정 단계를 포함하는 작업 근거 데이터 수집 방법을 제공한다. 상기 데이터 필터링 조건은 데이터 필터링 대상이 되는 파일 확장자, 프로세스, 폴더 형식, 파일 저장 경로 정 보, 프로토콜, 및 프로그램 중 적어도 하나에 대한 정보를 포함하는 것을 특징으로 한다. 상기 부하 확인 단계는 CPU 리소스, 저장 매체 리소스, 및 네트워크 리소스를 기반으로 시스템 부하를 확인하며, 상기 CPU 리소스를 모니터링 및 분석하여 상기 필터링 주기를 조정하고, 상기 저장 매체 리소스와 상 기 네트워크 리소스를 기반으로 상기 데이터 수집 주기를 조정하는 것을 특징으로 한다. 상기 부하 확인 단계는 상기 저장 매체 리소스를 모니터링 및 분석하여, 상기 작업 근거 데이터의 저장 주기 또 는 용량을 조정하는 기능을 더 포함하는 것을 특징으로 한다. 또한, 상기 방법은 작업 진행, 대기, 종료 여부를 수동 선택할 수 있는 작업 관리창을 추가로 제공하고, 상기 작업 관리창을 통해 입력되는 사용자 제어값에 따라 작업 근거 데이터의 수집 여부를 결정하는 단계를 더 포함 하는 것을 특징으로 한다. 상기 데이터 수집 단계는 상기 사용자 실행 파일의 파일명 형식을 기반으로 상기 작업을 확인할 수 있으며, 상 기 파일명 형식은 프로젝트 코드, 작업명, 및 부가 정보 순으로 구성되는 것을 특징으로 한다. 상기 과제를 해결하기 위한 수단으로서, 본 발명의 다른 실시 형태에 따르면, 사용자 실행 파일을 기반으로 사 용자가 현재 수행하는 작업을 확인하는 작업 확인부; 기 설정된 데이터 수집 주기에 따라 상기 작업이 수행됨에 의해 발생하는 이벤트 데이터 모두를 수집하는 데이터 수집부; 기 설정된 필터링 주기에 따라 상기 작업에 대응 되는 데이터 필터링 조건을 기반으로 상기 이벤트 데이터를 필터링하여 유효 데이터만을 추출하는 데이터 필터 링부; 시스템 부하를 확인한 후, 상기 시스템 부하에 따라 상기 데이터 수집 주기와 상기 데이터 필터링 주기를 조정하는 시스템 부하 확인부; 상기 유효 데이터를 기반으로 작업 근거 데이터를 산출한 후, 사용자에게 안내하 고 동의 여부를 문의하는 작업 근거 데이터 산출부; 사용자가 상기 작업 근거 데이터에 대해 동의한 경우에는 상기 작업 근거 데이터를 저장 및 출력하되, 그렇지 않으면 수정 사항 입력을 요청하고 이에 응답하여 입력되는 상기 수정 사항을 반영하여 상기 작업 근거 데이터를 수정한 후 저장 및 출력하는 작업 근거 데이터 출력부; 및 상기 수정 사항을 반영하여 상기 작업에 대응되는 데이터 필터링 조건을 인공 지능 방식으로 재학습시키는 필터링 조건 학습부를 포함하는 작업 근거 데이터 수집 장치를 제공한다."}
{"patent_id": "10-2015-0087462", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 컴퓨터 기반으로 수행되는 작업의 현황을 파악하기 위한 작업 근거 데이터를 보다 정확하고 세밀하게 수집 및 제공할 수 있도록 함으로써, 작업 모니터링 동작의 신뢰도를 획기적으로 증대시켜 줄 수 있도록 한다. 또한, 시스템 부하를 기반으로 작업 근거 데이터 획득을 위한 데이터 수집 주기와 필터링 주기를 능동적으로 조 정함으로써, 작업 근거 데이터 획득 동작으로 사용자의 작업 속도가 저하되는 부가적으로 문제의 발생을 사전 에 차단하도록 한다. 또한, 자동 산출된 작업 근거 데이터를 사용자 확인 후 저장 및 출력하도록 하며, 사용자의 요청하여 작업 근거 데이터를 수정할 수 있도록 함으로써, 사용자의도를 최대한 반영한 작업 근거 데이터를 제공할 수 있도록 한다. 또한, 사용자 수정 사항을 통해 상기 인공 신경망을 재학습하는 방식으로 데이터 필터링 조건이 보정될 수 있도 록 함으로써, 관리자가 미처 생각지 못한 변수에 대해 보다 유연하게 대처할 수 있게 되는 효과도 제공할 수 있 도록 한다."}
{"patent_id": "10-2015-0087462", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적 및 효과, 그리고 그것들을 달성하기 위한 기술적 구성들은 첨부되는 도면과 함께 상세하게 후술 되어 있는 실시예들을 참조하면 명확해질 것이다. 본 발명을 설명함에 있어서 공지 기능 또는 구성에 대한 구체 적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 직원, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있 다. 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가 진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐 이다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도1은 본 발명의 일 실시예에 따른 컴퓨터 기반의 작업 현황 모니터링 시스템을 도시한 도면이다. 도1을 참고하면, 본 발명의 시스템은 크게 다수의 사용자 단말과, 다수의 사용자 단말을 통해 다수 사 용자의 작업 현황 등을 일괄 모니터링할 수 있는 모니터링 서버 등을 포함할 수 있다. 본 발명의 사용자 단말은 컴퓨터, 노트북 등과 같이 소정의 프로그램과 파일을 실행할 수 있는 기존의 각종 컴퓨팅 장치로 구현될 수 있으며, 특히 작업 근거 데이터 수집 장치를 추가 구비하고, 이를 통해 사용자가 현재 수행하고 있는 작업이 무엇인지, 해당 작업을 얼마 동안 얼마나 집중도 있게 수행하는지 등을 파악하여 모 니터링 서버 등에 통보할 수 있도록 한다. 그러면, 모니터링 서버는 사용자 단말, 특히 작업 근거 데이터 수집 장치에 제공하는 정보를 기반 으로 사용자별 작업 내역(예를 들어, 작업명, 작업 소요 시간, 작업 진척율 등)을 산출하여 관리자에 시청각적 으로 안내하거나 데이터베이스화하여 저장하도록 한다. 또한, 필요한 경우에는, 사용자별 작업 내역을 기반으로 사용자 각각의 성과 및 소요 비용, 더 나아가 회사, 프로젝트, 및 직원 단위별 작업 현황 등을 추가적으로 산출 하고, 안내 또는 저장할 수도 있도록 한다. 도2는 본 발명의 일 실시예에 따른 작업 근거 데이터 수집 장치의 상세 구성을 도시한 도면이다. 도2를 참고하면, 본 발명의 작업 근거 데이터 수집 장치는 제어부, 모니터링 규칙 저장부, 통신 부 및 작업 근거 데이터 DB(DataBase) 등을 포함하고, 제어부는 다시 작업 확인부, 데이 터 수집부, 데이터 필터링부, 시스템 부하 확인부, 작업 근거 데이터 산출부, 작업 근거 데이터 출력부, 필터링 조건 학습부 등을 포함할 수 있다. 이하, 각 구성 요소의 기능을 상세히 살펴보면 다음과 같다. 작업 확인부는 사용자가 특정 파일을 선택하여 실행 요청하면, 해당 파일의 파일명 형식을 기반으로 사용 자가 현재 실행한 파일에 대응되는 작업을 식별하도록 한다. 참고로, 작업 식별을 위한 파일명 형식은 작업 근거 데이터 수집 동작 이전에 관리자 등에 의해 정의될 수 있으 며, 예를 들어, \"[SOCRATES] 작업3 v0.1.docx\"과 같이 프로젝트 코드, 작업명, 및 부가 정보 순으로 구성될 수 있다. 여기서, \"SOCRATES\"는 프로젝트 코드이며, \"작업3\"는 작업명, \"v0.1\"는 부가 정보일 수 있으며, 부가 정 보는 다시 작업 버전 정보, 작업 세부 항목, 작업 일자 등으로 구성될 수 있다. 이에 본 발명의 작업 확인부는 사용자가 특정 파일을 생성 및 작업한 후 파일명을 기입할 때마다, 해당 파 일명이 상기의 파일명 형식에 부합되는 지 확인한 후, 별도의 팝업창을 통해 파일명 형식 위반 등을 즉각적으로 통보할 수 있도록 한다. 또한, 파일명 형식 위반을 통보하기 위한 팝업창에 무시 또는 수정 메뉴를 추가 제공하 여, 현재 입력한 파일명을 그대로 유지하거나, 현재 입력한 파일명을 즉각 수정할 수도 있도록 해준다. 데이터 수집부는 기 설정된 데이터 수집 주기에 따라 작업이 수행됨에 의해 발생하는 파일 작업 이벤트, 네트워크 작업 이벤트, 디바이스(예를 들어, 키보드, 마우스, USB 등) 작업 이벤트 등을 주기적으로 수집하도록 한다. 또한 데이터 수집부는 작업 진행, 대기, 종료 여부를 수동 선택할 수 있는 작업 관리창을 도3에서와 같이 추가로 제공하고, 사용자가 작업 관리창을 통해 직접 작업 근거 데이터의 수집 여부를 결정할 수도 있도록 한다. 즉, 파일 실행 여부만을 기반으로 작업 진행 여부를 자동 체크할 수도 있으나, 필요한 경우 사용자 제어 값을 통해 작업 진행 여부를 더블 체크할 수도 있도록 한다. 데이터 필터링부는 작업 각각에 대응되는 데이터 필터링 조건을 구비한다. 그리고 기 설정된 데이터 필터 링 주기에 따라, 현재 수행 중인 작업에 대응되는 데이터 필터링 조건을 기반으로 데이터 수집부에 의해 수집된 이벤트 데이터를 필터링하여 유효 데이터만을 추출하도록 한다. 참고로, 데이터 필터링 조건은 표1에 나타난 바와 같이, 데이터 필터링 대상이 되는 파일 확장자, 프로세스, 폴 더 형식, 파일 저장 경로 정보, 프로토콜, 및 프로그램 중 적어도 하나에 대한 정보를 포함할 수 있다. 표 1 No. 항목 형태 예시 1파일 확장자 제한 -임시 파일 확장자 -실행 파일 확장자 -라이브러리 파일 확장자-임시 파일 확장자 : tmp, temp 등 -실행 파일 확장자 : exe 등 -라이브러리 파일 확장자 : dll 등 2프로세스 제한 -시스템 프로세스 -네트워크 프로세스 -로컬 프로세스-시스템 프로세스 : svchost, system 등 -네트워크 프로세스 : conhost.exe3파일 형식 제한 -설치 파일 형식 -압축 파일 형식-설치 파일 형식 : cab 파일, setup 파 일, install 파일 등 -압축 파일 형식 : zip, 7zip, rar 등 4파일 경로 제한 -시스템 경로 -임시 경로-시스템 경로 포함 문자열 : Program Files, Windows 등 -임시 경로 포함 문자열 : temp 등 5관심 프로토콜 관심 프로토콜 : TCP, HTTP 등 6프로그램 제한 -오피스 프로그램 -네트워크 프로그램 -디자인 프로그램-오피스 프로그램 : Excel, PPT, WORD, HWP 등 -네트워크 프로그램 : KakaoTalk, NateOnMain, Chrome, explorer 등 -디자인 프로그램 : photoshop, mspaint 등 시스템 부하 확인부는 CPU 리소스, 저장 매체 리소스, 및 네트워크 리소스를 기반으로 시스템 부하를 확인 한 후, 시스템 부하에 따라 데이터 수집부의 데이터 수집 주기와 데이터 필터링부의 필터링 주기를 조정하도록 한다. 이때, 저장 매체는 사용자 단말에 내장된 각종 저장 매체 일 수 있으며, 대표적인 예로는 HDD(hard disk drive), SSD(Solid State Disk or Solid State Drive)이 있다. 더욱 상세하게는 시스템 부하 확인부는 이하의 표2에서와 같이, CPU 리소스를 모니터링 및 분석하여 필터 링 주기를 조정하고, 저장 매체 리소스와 네트워크 리소스를 기반으로 상기 데이터 수집 주기를 조정할 수 있다. 표 2 No. 항목 예시 1 HDD 리소스 모니터링하여 수집 주기 조절허용 HDD 리소스 Limit : 10% 허용 범위 초과 시 : OO초당 1회로 제한 2 CPU 리소스 모니터링하여 분석 및 필터링 주 기 자동 조정허용 CPU 리소스 Limit : 10% 허용 범위 초과 시 : OO초당 1회로 제한 3 캐싱(시간 or 용량 or 하이브리드) 캐싱 주기 설정 : OO 분 후 저장 캐싱 용량 설정 : OO Mb 수집 시 저장 하이브리드 설정 : OO 분 후 또는 OO Mb 수집 시 저장 4 네트워크 리소스 모니터링 및 수집 주기 자 동 조정허용 네트워크 리소스 Limit : 10% 허용 범위 초과 시 : OO초당 1회로 제한 작업 근거 데이터 산출부는 데이터 필터링부를 통해 추출된 유효 데이터를 기반으로 작업 시간, 작업 타입, 이용 프로그램, 파일명 등으로 구성되는 작업 근거 데이터를 산출하도록 한다. 또한, 작업 근거 데이터 산출부는 사용자가 현재 작업을 종료할 때 마다, 도4와 같이 구성되는 작업 근거 데이터 안내창을 통해 산출된 작업 근거 데이터를 사용자에게 안내하고, 작업 근거 데이터에 대한 동의 및 수정 여부 등을 문의할 수 있도록 한다."}
{"patent_id": "10-2015-0087462", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "작업 근거 데이터 출력부는 사용자가 작업 근거 데이터에 대해 동의한 경우에는 작업 근거 데이터 산출부 에 의해 산출된 작업 근거 데이터를 통신부를 통해 외부 장치, 즉 모니터링 서버에 즉각 제공하 거나, 자신의 로컬 데이터베이스, 즉 작업 근거 데이터 DB에 임시 저장한 후 차후 모니터링 서버가 요 청할 때에 제공할 수 있도록 한다. 반면, 사용자가 작업 근거 데이터에 대해 수정 요청한 경우에는 사용자에게 수정 사항 입력을 추가 요청하고, 이에 응답하여 사용자가 입력하는 수정 사항을 반영하여 작업 근거 데이터를 수정한 후 다음의 작업이 수행될 수 있도록 한다. 더하여, 본 발명은 필터링 조건 학습부를 추가 구비하고, 이를 통해 작업 근거 데이터 산출부를 통해 파악된 사용자 수정 사항을 반영하여 데이터 필터링부의 데이터 필터링 조건을 보정할 수도 있도록 한다. 특히, 본 발명에서는 인간의 뇌를 모델로 삼아 컴퓨터가 스스로 반복적인 학습 과정을 거쳐 패턴을 찾아내고 이 를 일반화하는 인공 신경망을 기반으로 데이터 필터링 알고리즘이 구현되도록 하고, 필터링 조건 학습부는 사용자 수정 사항을 통해 상기 인공 신경망을 재학습하는 방식으로 데이터 필터링 알고리즘, 즉 필터링 조건이 보정될 수 있도록 한다. 그 결과, 본 발명의 데이터 필터링 조건은 인공 신경망 고유의 특징에 따라 관리자가 미처 생각지 못한 변수에 대해 보다 유연하게 대처할 수 있게 되는 효과를 제공할 수 있게 된다. 통신부는 유선 또는 무선 통신 모듈을 구비하고, 이를 통해 외부 장치, 즉 모니터링 서버과의 데이터 통신을 지원한다. 작업 근거 데이터 DB(DataBase)는 작업 근거 데이터 출력부의 제어하여 작업 근거 데이터를 데이터베 이스화하여 일시 저장하도록 한다. 도5는 본 발명의 일 실시예에 따른 작업 근거 데이터 수집 방법을 설명하기 위한 도면이다. 만약, 사용자가 사용자 단말내 특정 파일을 선택 및 실행하면, 작업 근거 데이터 수집 장치는 사용자 실행 파일을 기반으로 사용자가 현재 수행하는 작업이 어떤 작업인지를 확인하도록 한다(S1). 그리고 작업이 수행됨에 의해 발생하는 각종 이벤트 데이터 모두를 주기적으로 수집하도록 한다. 이때, 이벤트 데이터는 파일 작업 이벤트, 네트워크 작업 이벤트, 디바이스(예를 들어, 키보드, 마우스, USB 등) 작업 이벤트 등 일 수 있다(S2). 그리고 현재 수행되는 작업에 대응되는 데이터 필터링 조건을 검색 및 획득하고, 이를 기반으로 단계 S2를 통해 수집된 이벤트 데이터를 필터링하여 유효 데이터만을 추출하도록 한다(S3). 또한, 이와 동시에 현재 작업에 의해 발생되는 CPU 리소스, 저장 매체 리소스, 및 네트워크 리소스를 기반으로 시스템 부하를 확인한 후, CPU 리소스, 저장 매체 리소스, 및 네트워크 리소스 중 적어도 하나 이상이 사전에 설정된 기준치 이상으로 사용되는지 확인한다. 즉, 시스템 부하의 적절성을 확인하도록 한다(S4). 단계 S4의 확인 결과, CPU 리소스, 저장 매체 리소스, 및 네트워크 리소스 중 적어도 하나 이상이 사전에 설정 된 기준치 이상으로 사용됨이 확인되면, 앞서 설명된 표2의 시스템 부하 조정 기준에 따라 필터링 주기, 데이터 수집 주기 중 적어도 하나를 조정하도록 한다(S5). 한편, 단계 S4의 확인 결과, 시스템 부하가 적절하고 판단되면, 단계 S3을 통해 추출된 유효 데이터를 기반으로 작업 근거 데이터를 산출하도록 한다(S6). 상기의 단계 S1 내지 S6은 현재 작업이 종료할 때까지 반복하여 수행되며, 만약, 현재 수행되던 작업이 종료되 었음 확인하면(S7), 작업 근거 데이터 안내창을 통해 단계 S6을 통해 산출된 작업 근거 데이터를 사용자에게 안 내하고, 동의 또는 수정 여부를 문의하도록 한다(S8). 단계 S8의 작업 근거 데이터 안내 결과, 사용자가 작업 근거 데이터 수집 장치에 의해 자동 산출된 작업 근거 데이터에 동의한다면(S9), 작업 근거 데이터 수집 장치는 단계 S6을 통해 산출된 작업 근거 데이터를 장치 내부 에 저장하거나, 외부 장치, 즉 모니터링 서버로 즉각 전송하도록 한다(S10). 반면, S8의 작업 근거 데이터 안내 결과, 사용자가 작업 근거 데이터 수집 장치에 의해 자동 산출된 작업 근거 데이터에 대한 수정을 요청한다면(S9), 작업 근거 데이터 수집 장치는 작업 근거 데이터 수정 툴을 제공하여, 사용자가 임의로 작업 근거 데이터를 삭제, 추가 또는 수정할 수 있도록 한다. 그리고 사용자 수정 사항을 반영 하여 작업 근거 데이터를 수정한 후, 이를 장치 내부에 저장하거나, 외부 장치, 즉 모니터링 서버로 즉각 전송하도록 한다(S11). 그리고 사용자의 수정 사항(예를 들어, 작업 타입, 작업 프로세스 등)을 반영하여 데이터 필터링 조건을 인공 지능 방식으로 재학습시킨 후, 현재 작업에 대한 작업 근거 데이터 수집 방법을 최종 종료하도록 한다(S12). 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범 위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권 리범위에 포함되는 것으로 해석되어야 할 것이다. 이상과 같이 본 발명은 비록 한정된 실시예와 도면에 의해 설명되었으나, 본 발명이 상기의 실시예에 한정되는 것은 아니며, 이는 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서 본 발명의 사상은 아래에 기재된 특허청구범위에 의해서만 파악되어야 하고, 이와 균 등하거나 또는 등가적인 변형 모두는 본 발명 사상의 범주에 속한다 할 것이다. 또한, 본 발명에 따른 작업 근거 데이터 수집 방법은 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록 장치를 포함한다. 기록매체의 예로는 ROM, RAM, CD ROM, 자기 테이프, 플 로피 디스크, 광 데이터 저장장치, 하드 디스크, 플래시 드라이브 등이 있으며, 또한 캐리어 웨이브(예를 들어 인터넷을 통한 전송)의 형태로 구현되는 것도 포함한다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연 결된 컴퓨터 시스템에 분산되어 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다."}
{"patent_id": "10-2015-0087462", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명의 일 실시예에 따른 컴퓨터 기반의 작업 현황 모니터링 시스템을 도시한 도면이다. 도2는 본 발명의 일 실시예에 따른 작업 근거 데이터 수집 장치의 상세 구성을 도시한 도면이다. 도3은 본 발명의 일 실시예에 따른 작업 근거 데이터 수집 장치를 제공 제공되는 작업 관리창의 일예를 도시한 도면이다. 도4는 본 발명의 일 실시예에 따른 작업 근거 데이터 수집 장치를 제공 제공되는 작업 근거 데이터 안내창의 일 예를 도시한 도면이다. 도5는 본 발명의 일 실시예에 따른 작업 근거 데이터 수집 방법을 설명하기 위한 도면이다."}
