{"patent_id": "10-2021-0191611", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0101479", "출원번호": "10-2021-0191611", "발명의 명칭": "온수 매트를 이용한 수면 음악 추천 방법 및 시스템", "출원인": "주식회사 경동나비엔", "발명자": "이영훈"}}
{"patent_id": "10-2021-0191611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 체온에 따라 조절된 온수 매트의 온도, 사용자의 수면 중 동작 또는 코고는 소리를 수집하여 사용자수면 패턴을 수집하는 단계;학습된 인공 지능을 이용하여 상기 사용자 수면 패턴에 대응하는 음악을 추천하는 단계; 및수면 종료 후 추천된 음악에 대해 입력된 피드백에 따라 사용자 수면 패턴 및 상기 피드백을 매칭하여 저장하는단계;를 포함하는 온수 매트를 이용한 수면 음악 추천 방법."}
{"patent_id": "10-2021-0191611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 매칭된 사용자 수면 패턴 및 상기 피드백을 분석하여 학습 데이터로 변환하고, 상기 학습 데이터를 이용하여 상기 인공 지능을 학습시키는 단계;를 더 포함하는 온수 매트를 이용한 수면 음악 추천 방법."}
{"patent_id": "10-2021-0191611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 음악을 추천하는 단계에서,추천된 상기 음악은 상기 사용자 수면 패턴과 비슷한 수면 패턴에 매칭된 피드백 점수가 기설정된 값 이상인 것이며,기설정된 시간에 상기 사용자 수면 패턴과 비슷한 수면 패턴에 매칭된 피드백 점수가 가장 높은 음악부터 순차적으로 추천하는 온수 매트를 이용한 수면 음악 추천 방법."}
{"patent_id": "10-2021-0191611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 사용자 수면 패턴을 분석하여 상기 수면 패턴 중 숙면 상태에서의 온도와 대응되도록 상기 온수 매트 온도를 추가로 조절하는 단계를 더 포함하는 온수 매트를 이용한 수면 음악 추천 방법."}
{"patent_id": "10-2021-0191611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 음악과 상기 온도는 시간대 별로 조절 가능한 것을 특징으로 하는 온수 매트를 이용한 수면 음악 추천 방법."}
{"patent_id": "10-2021-0191611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항 내지 제5 항 중 어느 한 항에 따른 방법을 컴퓨터 상에서 수행하기 위한 컴퓨터 프로그램을 기록한 컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2021-0191611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0101479-3-사용자의 수면 중 체온에 따라 온도를 조절하는 온수 매트; 및상기 온수 매트와 통신하며, 제1 항 내지 제5 항 중 어느 한 항에 따른 방법을 컴퓨터 상에서 수행하기 위한 컴퓨터 프로그램을 포함하는 스마트 기기;를 포함하며,상기 스마트 기기는 사용자의 수면 중 동작을 감지하는 가속도 센서와, 상기 사용자의 소리를 수집하는 마이크와, 음악을 재생하는 스피커를 포함하는온수 매트를 이용한 수면 음악 추천 시스템."}
{"patent_id": "10-2021-0191611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 스마트 기기는 수면 종료 후 추천된 음악에 대한 피드백을 입력 받아 사용자 수면 패턴 및 상기 피드백을매칭하며, 매칭된 사용자 수면 패턴 및 상기 피드백을 이용하여 학습된 인공 지능을 제공받아 사용자 수면 패턴에 대응하는 음악을 추천하도록 구성된온수 매트를 이용한 수면 음악 추천 시스템."}
{"patent_id": "10-2021-0191611", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 온수 매트를 이용한 수면 음악 추천 방법 및 시스템에 관한 것으로, 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 방법은 사용자의 체온에 따라 조절된 온수 매트의 온도, 사용자의 수면 중 동작 또는 코고는 소리를 수집하여 사용자 수면 패턴을 수집하는 단계; 학습된 인공 지능을 이용하여 상기 사용자 수 면 패턴에 대응하는 음악을 추천하는 단계; 및 수면 종료 후 추천된 음악에 대해 입력된 피드백에 따라 사용자 수면 패턴 및 상기 피드백을 매칭하여 저장하는 단계;를 포함할 수 있다."}
{"patent_id": "10-2021-0191611", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 온수 매트를 이용한 수면 음악 추천 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2021-0191611", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 현대인들은 많은 활동량과 스트레스 등으로 인해 수면장애 환자가 급증하고 있으며, 수면장애에 의해 집중 력과 사고력, 기억력 등이 떨어져 건강 악화 및 실생활에서의 활동장애 또한 유발될 수 있다. 따라서, 깊은 숙면을 제공하기 위하여 다양한 장치 및 방법이 개발되고 있으며, 종래 특허문헌에서는 사물통신 을 통해 수면 및 쾌적한 환경 정보를 전용 어플(APP)의 실행을 통해 능동적으로 조절하여 원활한 수면 환경을 조성할 수 있는 발명을 개시하였다. 특히, 종래 특허문헌 1은 사용자가 원하는 습도, 온도, 조도 등은 수동으로 미리 설정해야 했으며, 코골이 방지 를 통해 숙면을 유도하도록 매트리스에 연결된 마사지 모터를 제어하여 구동하는 기술을 개시하고 있었다. 그러나, 사람의 숙면에 가장 직접적인 영향을 미치는 요소 중 하나는 온도와 같은 촉각적 요소 및 소리와 같은 청각적 요소이며, 종래 특허문헌만으로는 사용자의 숙면을 위해서 자동으로 사용자의 청각적 제어 및 자동 온도 제어를 수행할 수가 없었다. 또한, 사용자마다 숙면을 유도하는 음악이나 온도가 상이한 바 각각의 사용자에게 맞춘 음악 및 온도 제어를 제 공할 수 없어 사용자 맞춤 음악 및 온도 제어를 수행할 수 없는 문제점이 있었다. (특허문헌 1) KR 10-2019590 B1"}
{"patent_id": "10-2021-0191611", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 온수 매트를 이용하여 사용자의 수면 패턴을 분석하고 상기 수면 패턴에 따라 사용자 숙면을 위한 맞 춤 음악을 추천하는 온수 매트를 이용한 수면 음악 추천 방법 및 시스템을 제공하고자 한다."}
{"patent_id": "10-2021-0191611", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 방법은 사용자의 체온에 따라 조절된 온수 매 트의 온도, 사용자의 수면 중 동작 또는 코고는 소리를 수집하여 사용자 수면 패턴을 수집하는 단계; 학습된 인공 지능을 이용하여 상기 사용자 수면 패턴에 대응하는 음악을 추천하는 단계; 및 수면 종료 후 추천된 음악에 대해 입력된 피드백에 따라 사용자 수면 패턴 및 상기 피드백을 매칭하여 저장하는 단계;를 포함할 수 있다. 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 시스템은 사용자의 수면 중 체온에 따라 온도 를 조절하는 온수 매트; 및 상기 온수 매트와 통신하며, 상술한 방법을 컴퓨터 상에서 수행하기 위한 컴퓨터 프 로그램을 포함하는 스마트 기기;를 포함하며, 상기 스마트 기기는 사용자의 수면 중 동작을 감지하는 가속도 센 서와, 상기 사용자의 소리를 수집하는 마이크와, 음악을 재생하는 스피커를 포함할 수 있다. 또한, 상술한 온수 매트를 이용한 수면 음악 추천 방법을 컴퓨터 상에서 실행하기 위한 컴퓨터 프로그램을 기록 한 컴퓨터 판독 가능 기록 매체를 제공할 수 있다."}
{"patent_id": "10-2021-0191611", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면 사용자의 수면 패턴에 따라 사용자 체온 조절을 수행하고, 맞춤형 수면 음악을 제공하여 사용자의 숙면을 유도할 수 있는 효과를 제공한다. 또한, 사용자 수면 패턴 및 사용자 피드백 데이터들을 지속적으로 수집, 분석, 학습을 수행함으로써 수면에 따 른 빅 데이터 처리를 위한 정보를 제공하고, 최적상태의 수면관리를 유도할 있는 음악을 제공한다."}
{"patent_id": "10-2021-0191611", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 각 단계의 시간적 선후는 나열한 순서에 국한되지 않으며, 각 단계의 시간적 순서를 통상의 기술자에 게 자명한 정도로 대체, 변경, 생략 가능하다. 도 1 내지 3은 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 시스템의 구성 개략도를 도시한 것이다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따르면 온수 매트를 이용한 수면 음악 추천 시스템은 수 면 중인 사용자의 체온 변화에 따라 온도를 조절하는 온수 매트, 사용자의 뒤척임과 같은 수면 중 동작 또 는 코고는 소리를 측정하고, 음악을 재생하는 스마트 기기, 상기 스마트 기기 및 온수 매트로부 터 사용자의 수면 패턴을 수집하고, 상기 수면 패턴을 분석하여 사용자 맞춤 수면 음악을 추천하는 서버를 포함할 수 있다. 본 발명의 일 실시예에 따른 스마트 기기는 스마트폰과 같은 핸드헬드기기일 수도 있고, 스마트워치와 같 은 웨어러블 기기일 수도 있으며, 그 종류가 제한되지 않는다. 도 2에 도시된 바와 같이, 본 발명의 일 실시예에 따른 스마트 기기는 사용자의 수면 중 동작 또는 움직임 을 감지하는 가속도 센서, 사용자의 수면 중 코고는 소리, 이 가는 소리 등 수면 중 발생하는 소리를 수음 하는 마이크를 포함할 수 있다. 이때, 상기 가속도 센서는 사용자의 움직임을 어느 방향에서든 감지할 수 있도록 3축 가속도 센서를 사용 할 수 있다.또는, 사용자 맞춤형의 수면 음악을 재생하는 스피커 및 상기 가속도 센서 및 마이크에서 획득 한 정보를 수집하고, 사용자 맞춤형의 수면 음악을 추천하고, 이에 대한 사용자의 피드백을 획득하는 애플리케 이션을 더 포함할 수 있다. 더하여 본 발명의 일 실시예에 따른 애플리케이션은 사용자에게 수면과 관련된 질문을 제공하고 그에 대한 답변을 입력 받을 수 있으며, 가속도 센서 및 마이크에서 획득한 정보 및 사용자의 피드백과 함께 답 변 데이터를 수집할 수 있다. 또한, 본 발명의 일 실시예에 따른 서버는 온수 매트의 온도 변화 데이터와 스마트 기기의 움직 임 데이터 또는 소리 데이터를 수집하는 데이터 수집 모듈, 이를 사용자의 수면 패턴이나 사용자의 수면 음악에 대한 피드백에 따라 분류하고 학습 데이터로 사용되도록 전처리하는 데이터 분석 모듈, 상기 데이 터 분석 모듈에서 분류 및 전처리된 학습 데이터를 이용하여 사용자 수면 패턴 및 사용자 피드백을 고려한 수면 음악을 추천하도록 학습하는 데이터 학습 모듈을 포함할 수 있다. 또한, 상기 데이터 학습 모듈에서 학습된 인공 지능을 장착하여 사용자 맞춤 수면을 위한 환경 정보를 추 천하는 추천 모듈을 더 포함할 수 있다. 일 실시예로서, 사용자 수면 패턴에 맞춘 수면 음악을 추천할 수 있다. 상술한 모듈은 기능에 따라 분류한 것이며 하나의 소프트웨어 또는 하드웨어에 집적되어 구현될 수 있고 각각 별개의 모듈로 구현될 수도 있다. 구체적으로, 데이터 분석 모듈은 데이터 수집 모듈로부터 수집된 데이터를 전달 받고, 수집된 사용자 의 수면 패턴 및 피드백을 세분화하여 분류할 수 있다. 분류 기준은 다양한 기준에 따라 재설정될 수 있으며, 예를 들어, 숙면 구간 유무, 숙면 시간대 등에 따라 분류할 수 있다. 즉, 데이터 분석 모듈은 사용자의 수면 상태를 분석하여 패턴에 대한 정보를 획득해야 한다. 사용자의 수면 패턴 중 숙면과 관련된 복수의 특징을 추출하고, 상기 복수의 특징에 따라 비슷한 수면 패턴을 가진 데이터끼리 분류할 수 있다. 또한, 데이터 학습 모듈은 RNN(Recurrent Neural Network) 또는 LSTM(Long Short-Term Memory) 등의 인공 지능 알고리즘을 이용하여 학습 모델 훈련 및 테스트를 진행할 수 있으며, 수집된 데이터 중 일부는 학습 데이 터로 사용하고, 다른 일부는 검증용 데이터로 사용할 수 있다. 더하여, 데이터 학습 모듈은 수집된 데이터를 입력 받아 각 데이터의 종류와 관련된 가중치를 조절하여 사 용자 숙면 유도 가능성이 가장 높은 음악을 출력할 수 있다. 즉, 애플리케이션에서 수집된 데이터를 추출하여 데이터 레이크(data lake)를 분석 및 분류하여 변환 (transformation)하고 데이터 정리(data cleaning)하여 머신 러닝을 위한 학습 데이터로 사용할 수 있다. 이에 따라 추천 모듈은 사용자 숙면에 도움이 될 환경 정보를 추천할 수 있으며, 일 예시로서 수면 음악을 추천할 수 있다. 여기서, 음악은 반드시 한 곡으로 마무리되는 작곡 음원은 아닐 수 있으며, 단순 반복 소리나 바람소리나 물소 리와 같은 풍경 소리, 책 읽는 소리와 같은 인위적으로 제작된 소리 등일 수 있다. 상기 음악은 데이터베이스에 저장된 음원에서 선택될 수 있으며, 다른 서버의 음원을 공유 받을 수도 있다. 또한, 수면 음악을 추천할 때 애플리케이션에서 푸시 알림(push notification)을 통해 사용자에게 디스플 레이할 수 있다. 따라서, 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 시스템은 온수 매트와 스마 트 기기에서 획득한 데이터를 이용하여 학습된 인공 지능을 제공 받아 사용자의 스마트 기기의 애플 리케이션으로 수면 음악을 추천할 수 있다. 본 발명의 일 실시예에 따른 온수 매트는 체온 변화에 맞춰 온도를 조절해주는 수면 모드 기능을 탑재하고 있으며, 원하는 시간대 별 온도를 설정하는 맞춤 예약 기능을 구비할 수 있다. 따라서, 온수 매트에서 사용자의 수면 패턴 데이터를 수집하여 제어하는 구성을 하고 있으며, 여기에 사용 자의 움직임을 측정하는 가속도 센서 및 사용자의 코고는 소리 등을 수집하는 마이크를 이용하여 추가적인 데이터를 수집함으로써 수면 음악을 추천할 수 있다. 이때, 꼭 스마트 기기에 가속도 센서 및 마이크를 한정할 필요는 없으며, 별도로 구비된 가속도 센서 및 마이크를 통해서 사용자 수면 패턴을 수집하고 이를 온수 매트에 전달하여 사용자 수면 패턴 정보를 수집 및 제어할 수 있다. 도 4는 본 발명이 일 실시예에 따른 스마트 기기의 사용 예시도로서, 도 4(a)에 도시된 바와 같이, 스마트 기기 내의 애플리케이션을 통해 수면 음악에 대한 사용자 피드백을 받을 수 있다. 도 4(a)에 도시된 바와 같이, 오늘의 수면 상태 및 이때 재생된 수면 음악이 추천할만 한 지 수면 음악 추천 점 수를 받을 수 있다. 이를 통해 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 시스템은 스마트 기기와 온수 매트에서 수집한 수면 패턴과, 애플리케이션(1400을 통해 입력된 수면 상태 및 사용자가 평가한 수면 음악 추전 점수를 고려하여 동일 유사한 수면 패턴을 가진 사용자에게 추천할 수면 음악 리스트를 학습할 수 있 다. 또한, 도 4(b)에 도시된 바와 같이, 애플리케이션에 저장된 수면 음악 종류 중 사용자 맞춤 수면 음악 리 스트를 상기 사용자 수면 패턴, 입력된 사용자 피드백을 이용하여 학습된 인공 지능으로부터 추천받을 수 있다. 상기 수면 음악 리스트는 애플리케이션에 저장된 음악에 한정될 수도 있으나 다른 클라우드 또는 서버에 저장된 음악을 공유 받을 수 있으며, 추천할 수면 음악 리스트는 유사한 장르, 유사한 비트, 유사한 작곡가 등 의 정보를 이용할 수 있다. 도 5 및 도 6은 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 방법의 플로우 차트를 도 시한 것이다. 도 5에 도시된 바와 같이, 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 방법은 사용자 의 체온에 따라 조절된 온수 매트의 온도, 사용자의 수면 중 동작 또는 코고는 소리를 수집하여 사용자 수 면 패턴을 수집하는 단계(S510), 학습된 인공 지능을 이용하여 상기 사용자 수면 패턴에 대응하는 음악을 추천 하는 단계(S520), 및 수면 종료 후 추천된 음악에 대한 사용자의 피드백을 받아 사용자 수면 패턴 및 상기 사용 자의 피드백을 매칭하여 저장하는 단계(S530)를 포함할 수 있다. 상술한 방법은 스마트 기기 내에 저장된 애플리케이션에서 실행 및 구현될 수 있다. 구체적으로, 도 6에 도시된 바와 같이, 스마트 기기 내에 저장된 애플리케이션을 시작하고(S601), 추 천된 수면 음악 리스트 중 적어도 하나의 수면 음악을 선택할 수 있다(S602). 그러고 나서 사용자가 취침을 수행하면, 사용자 수면 중 동작, 사용자 수면 중 발생하는 소리, 사용자의 체온 변화 등을 포함하는 수면 데이터를 수집할 수 있다(S603). 이후 사용자가 수면을 종료하면 애플리케이션에 서 수면 종료를 선택하고(S604) 수면 중 재생되었던 수면 음악에 대한 평가가 입력될 수 있다(S605). 여기서 수면 데이터 및 수면 음악에 대한 평가를 매칭하여 이를 서버로 전송할 수 있다. 또한, 본 발명의 일 실시예에 따르면, 상기 매칭된 사용자 수면 패턴 및 사용자의 피드백을 학습 데이터로 하여 상기 인공 지능을 학습시키는 단계(S540)를 더 포함할 수 있다. 단순히 사용자의 취향을 고려하여 사용자 피드백에 따라 음악을 추천하는 것이 아니라 매칭된 수면 패턴에서 사 용자 체온 변화나 움직임이 거의 없고 코고는 등의 소리가 나지 않은 숙면 구간을 분석하고, 상기 숙면 구간에 서 재생된 음악, 이에 대해 입력된 사용자의 피드백에 대한 가중치를 두어 인공 지능을 학습시킬 수 있다. 이때, 상기 음악을 추천하는 단계(S520)에서, 추천된 상기 음악은 상기 사용자 수면 패턴과 비슷한 수면 패턴을 가진 사용자의 피드백 점수가 기설정된 값 이상인 것이며, 기설정된 시간에 상기 사용자 수면 패턴과 비슷한 수 면 패턴을 가진 사용자의 피드백 점수가 가장 높은 음악부터 순차적으로 추천할 수 있다. 상술한 바와 같이, 수면 시간대, 그 중 숙면에 드는 숙면 구간 등의 유사성을 분석하고 동일 유사한 수면 패턴 을 가진 사용자들의 피드백 점수가 가장 높은 음악부터 순차적으로 추천할 수 있다. 예를 들어, 3점 이상의 점수를 받은 수면 음악만 추천하고, 5점부터 4.5점, 4점으로 순차적으로 음악 리스트를 제안할 수 있다.더하여, 본 발명의 일 실시예에 따르면 상기 사용자 수면 패턴을 분석하여 상기 수면 패턴 중 숙면 상태에서의 온도와 대응되도록 상기 온수 매트 온도를 추가로 조절하는 단계를 더 포함할 수 있다. 수면 음악으로 청각적 환경을 통한 수면 환경을 조성하는 것뿐만 아니라 온수 매트도 사용자가 숙면을 할 때의 온도와 유사하게 체온을 조절하여 촉각적 환경을 추가 조성할 수 있다. 또한, 상기 음악과 상기 온도는 시간대 별로 조절 가능하다. 수면 기간 내내 동일한 온도와 음악으로 제어하는 것이 아니라 설정된 시간대 별로 변화를 주어 제어할 수 있다. 따라서, 애플리케이션을 이용하는 사용자의 수면 상태를 분석하고 온수 매트를 통해 수면 시간 동안 숙면 온도, 수면모드 정보를 이용하여 사용자에게 맞춤 온도를 분석하고 이에 따라 사용자가 가장 깊게 잠든 시 간을 검출하며, 수면 시에 선택한 수면 음악 및 사용자가 가장 깊게 잠든 시간에 따라 사용자 맞춤 수면 음악을 제공할 수 있다. 또한, 온수 매트에서 제공하는 체온 변화에 맞춘 온도 조절하는 수면모드 기능과 애플리케이션을 통 한 수면 음악 재생을 통해 사용자에게 양질의 수면을 제공할 수 있다. 상술한 본 발명의 일 실시 형태에 따른 온수 매트를 이용한 수면 음악 추천 방법은, 컴퓨터에서 실행되기 위한 프로그램으로 제작되어 컴퓨터가 읽을 수 있는 기록 매체에 저장될 수 있다. 컴퓨터가 읽을 수 있는 기록 매체 의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등을 포함한다. 또한, 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고 상기 방법을 구현하기 위한 기능적인(function) 프로그램, 코드 및 코"}
{"patent_id": "10-2021-0191611", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "드 세그먼트들은 본 발명이 속하는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 또한, 본 발명을 설명함에 있어, '~부' 또는 '모듈'은 다양한 방식, 예를 들면 프로세서, 프로세서에 의해 수행 되는 프로그램 명령들, 소프트웨어 모듈, 마이크로 코드, 컴퓨터 프로그램 생성물, 로직 회로, 애플리케이션 전 용 집적 회로, 펌웨어 등에 의해 구현될 수 있다. 또한, 상술한 구성요소, 장치 또는 시스템이 프로그램 또는 소프트웨어로 이루어진 구성요소를 포함한다고 기재 된 경우 명시적인 언급이 없더라도 그 구성요소, 장치 또는 시스템은 그 프로그램 또는 소프트웨어가 실행 또는 동작하는데 필요한 하드웨어나 다른 프로그램 또는 소프트웨어를 포함하는 것으로 이해되어야 하며, 상기 하드 웨어는 메모리 또는 CPU 등이 될 수 있고, 소프트웨어는 운영체제나 하드웨어를 구동하는데 필요한 드라이버 등 을 포함하는 것으로 이해되어야 한다. 본 발명은 상술한 실시형태 및 첨부된 도면에 의해 한정되지 아니한다. 첨부된 청구범위에 의해 권리범위를 한 정하고자 하며, 청구범위에 기재된 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양한 형태의 치환,"}
{"patent_id": "10-2021-0191611", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "변형 및 변경할 수 있다는 것은 당 기술분야의 통상의 지식을 가진 자에게 자명할 것이다."}
{"patent_id": "10-2021-0191611", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 시스템의 구성 개략도를 도시한 것이다. 도 2는 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 시스템에 사용된 스마트 기기의 구성을 간략하게 도시한 블록도이다. 도 3은 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 시스템에 사용된 서버의 구성을 간략하 게 도시한 블록도이다. 도 4는 본 발명이 일 실시예에 따른 스마트 기기의 사용 예시도이다. 도 5는 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 방법의 플로우 차트를 도시한 것이다. 도 6은 본 발명의 일 실시예에 따른 온수 매트를 이용한 수면 음악 추천 방법의 구체적인 제어 과정을 도시한 것이다."}
