{"patent_id": "10-2019-0050129", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0126300", "출원번호": "10-2019-0050129", "발명의 명칭": "노약자 케어를 위한 모니터링 방법", "출원인": "김동완", "발명자": "김동완"}}
{"patent_id": "10-2019-0050129", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "객체로부터 반사되는 무선신호의 반사파를 검출하여, 상기 객체의 위치정보를 획득하는 단계;상기 위치정보의 변화량을 모니터링하여, 시간에 따른 상기 객체의 이동을 파악하는 단계; 및상기 위치정보에 따라 다르게 설정되는 위치정보 가중치에 비례하는 임계시간 동안, 상기 객체가 이동하지 않을때 이벤트를 생성하는 단계를 포함하는 노약자 케어를 위한 모니터링 방법."}
{"patent_id": "10-2019-0050129", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 객체의 위치정보를 획득하는 단계는, 상기 객체가 모니터링 대상 영역 내에서 위치한 지점을 2차원 좌표로 산출하는 것을 특징으로 하는 노약자 케어를 위한 모니터링 방법."}
{"patent_id": "10-2019-0050129", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 임계시간은, 상기 객체의 주변 환경 및 변수에 대한 메타정보에 따라 달라지는 메타정보 가중치에 비례하여 설정되는 노약자케어를 위한 모니터링 방법."}
{"patent_id": "10-2019-0050129", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 위치정보 가중치 및 상기 메타정보 가중치는, 시계열적인 상기 위치정보 및 시계열적인 상기 메타정보를 누적하여 학습한 결과를 바탕으로 수정되는 노약자케어를 위한 모니터링 방법."}
{"patent_id": "10-2019-0050129", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 이벤트가 발생하였을 때,상기 반사파를 바탕으로 상기 객체의 생체정보를 해석하는 단계를 더 포함하는 노약자 케어를 위한 모니터링 방법."}
{"patent_id": "10-2019-0050129", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 객체의 생체정보를 해석하는 단계는,상기 반사파에서 주변 주파수를 검출하고, 상기 주변 주파수를 바탕으로 상기 객체의 심박수를 해석하는 것을특징으로 하는 노약자 케어를 위한 모니터링 방법."}
{"patent_id": "10-2019-0050129", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 의한 노약자 케어를 위한 모니터링 방법은 객체로부터 반사되는 무선신호의 반사파를 검출하여 객체의 위치정보를 획득하는 단계, 위치정보의 변화량을 모니터링하여 시간에 따른 객체의 이동을 파악하는 단계, 및 위 치정보에 따라 다르게 설정되는 위치정보 가중치에 비례하는 임계시간 동안, 객체가 이동하지 않을 때 이벤트를 생성하는 단계를 포함한다."}
{"patent_id": "10-2019-0050129", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 노약자 케어를 위한 모니터링 방법에 관한 것으로, 특히 노약자의 건강 이상 상태를 모니터링 할 수 있는 방법에 관한 것이다."}
{"patent_id": "10-2019-0050129", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "가족의 규모가 작아지고, 고령화 사회에 접어들면서 보호자 없이 혼자서 생활하는 노약자들이 증가하고 있다. 혼자서 생활하는 노약자들은 건강 이상 및 위급 상황에 취약한 상태에 방치되기 때문에, 이에 대한 대책이 강구 되고 있다. 폐쇄회로 텔레비전(Closed Circuit Television; 이하, CCTV)이 발전하고 보급화되면서, 노약자들의 건강 상태를 모니터링하기 위해서 거주 공간에 설치된 CCTV를 이용하는 방법이 제안된 바 있다. CCTV와 같이 영상을 바탕으 로 노약자를 모니터링하는 방법은 모니터링 대상의 사생활을 상당히 침해하게 된다. 그리고, 영상 촬영을 이용 한 모니터링 방법은 장애물로 인한 음영지역이 발생하기 때문에 모니터링 대상 영역에 한계를 갖는다. 또한 주 변 조도나 빛 반사로 인해서 영상 촬영이 불가능한 상황이 발생할 수 있기 때문에, 영상 촬영을 이용한 모니터 링 방법은 지속적으로 대상을 모니터링 할 수 없는 단점을 갖는다. 영상 촬영 이외에 음성 신호를 이용하여 노약자를 모니터링하는 방법이 제안되었지만, 음성 신호를 이용할 경우 에도 모니터링 대상자의 사생활 침해 문제는 여전히 해결되지 않는다. 또한 음성 신호를 이용한 방법은 주변 소음으로 인해서 심한 노이즈를 갖기 때문에 정확도가 낮을 뿐만 아니라, 모니터링 대상자가 소리없이 쓰러진 경우에는 대처가 불가능한 문제점을 갖는다. 근래에는 스마트폰 및 신체 부착형 단말기(wearable device)와 같은 휴대용 장치를 이용하여 노약자의 건강 상 태를 모니터링하는 방법이 제안되기도 한다. 휴대용 장치는 모니터링 대상자에게 불편함을 줄 수 있고, 모니터 링 대상자는 지속적으로 휴대용 장치에 전원 공급을 해야하는 단점을 갖는다."}
{"patent_id": "10-2019-0050129", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제 및 다른 문제를 해결하는 것을 목적으로 한다. 본 발명은 모니터링 대상자의 사생활 침해를 최소화할 수 있는 노약자 케어를 위한 모니터링 방법을 제공하기 위한 것이다. 또한, 본 발명은 음영지역을 없애면서, 지속적으로 정확하게 노약자의 건강 상태를 모니터링 할 수 있는 방법을 제공하기 위한 것이다. 또한, 본"}
{"patent_id": "10-2019-0050129", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위해, 본 발명에 의한 노약자 케어를 위한 모니터링 방법은 객체로부터 반사되는 무선신호의 반사파를 검출하여 객체의 위치정보를 획득하는 단계, 위치정보의 변화량을 모니터링하여 시간에 따 른 객체의 이동을 파악하는 단계, 및 위치정보에 따라 다르게 설정되는 위치정보 가중치에 비례하는 임계시간 동안, 객체가 이동하지 않을 때 이벤트를 생성하는 단계를 포함한다."}
{"patent_id": "10-2019-0050129", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 객체를 모니터링 하는 과정에서 영상 촬영이나 음성 신호를 이용하지 않기 때문에, 객체의 사생활 침 해를 최소화할 수 있다. 또한, 본 발명은 영상 촬영을 이용하지 않기 때문에, 모니터링 대상의 주변 조도 및 빛 반사로 인해서 객체의 상태를 모니터링하기 곤란한 문제점을 해소할 수 있다. 본 발명은 음성 신호를 이용하지 않기 때문에, 주변의 소음으로 인해서 객체의 상태를 모니터링 하기 곤란한 문제점을 해소할 수 있다. 또한, 처프 레이더 방식을 이 용하기 때문에 장애물 영향을 받지않고 객체를 모니터링 할 수 있다. 결과적으로, 본 발명은 방해 요소의 영향 을 받지 않고, 음영지역 없이 객체를 모니터링 할 수 있다. 또한, 본"}
{"patent_id": "10-2019-0050129", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 설명하는 기술은 다양한 변경을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들을 도 면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 이하 설명하는 기술을 특정한 실시 형태에 대해 한정하 려는 것이 아니며, 이하 설명하는 기술의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함 하는 것으로 이해되어야 한다. 제1, 제2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 해당 구성요소들은 상기 용어 들에 의해 한정되지는 않으며, 단지 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예 를 들어, 이하 설명하는 기술의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서 사용되는 용어에서 단수의 표현은 문맥상 명백하게 다르게 해석되지 않는 한 복수의 표현을 포함 하는 것으로 이해되어야 하고, \"포함한다\" 등의 용어는 설시된 특징, 개수, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 의미하는 것이지, 하나 또는 그 이상의 다른 특징들이나 개수, 단계 동작 구성요 소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는 것으로 이해되어야 한다. 도면에 대한 상세한 설명을 하기에 앞서, 본 명세서에서의 구성부들에 대한 구분은 각 구성부가 담당하는 주기 능 별로 구분한 것에 불과함을 명확히 하고자 한다. 즉, 이하에서 설명할 2개 이상의 구성부가 하나의 구성부로 합쳐지거나 또는 하나의 구성부가 보다 세분화된 기능별로 2개 이상으로 분화되어 구비될 수도 있다. 그리고 이 하에서 설명할 구성부 각각은 자신이 담당하는 주기능 이외에도 다른 구성부가 담당하는 기능 중 일부 또는 전 부의 기능을 추가적으로 수행할 수도 있으며, 구성부 각각이 담당하는 주기능 중 일부 기능이 다른 구성부에 의 해 전담되어 수행될 수도 있음은 물론이다. 또, 방법 또는 동작 방법을 수행함에 있어서, 상기 방법을 이루는 각 과정들은 문맥상 명백하게 특정 순서를 기 재하지 않은 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 과정들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 헬스 케어를 위한 모니터링 시스템 도 1은 본 발명에 의한 헬스 케어를 위한 모니터링 시스템을 나타내는 도면이다. 도 1을 참조하면, 본 발명에 의한 헬스 케어를 위한 모니터링 시스템은 제1 및 제2 무선신호 송수신기들 (110,120) 및 신호 해석부를 포함한다. 제1 무선신호 송수신기는 제1 송신부 및 제1 수신부를 포함하고, 제2 무선신호 송수신기는 제2 송신부 및 제2 수신부를 포함한다. 제1 송신부는 Tx1 신호를 송출하고, 제1 수신부 는 Tx1 신호가 객체로부터 반사되는 Rx1 신호를 수신한다. 이와 유사하게, 제2 송신부는 Tx2 신호를 송출하고, 제2 수신부는 Tx2 신호가 객체로부터 반사되는 Rx2 신호를 수신한다. Tx(Transmission)는 전송 신호를 나타내고, Rx(Reception)는 수신 신호를 나타낸다. 즉, Tx 1 신호 및 Tx 2 신호는 각각 전송 신호 1, 전송 신호 2를 나타내고, Rx 1 및 Rx 2는 각각 수신 신호 1, 수신 신호 2를 나타낸다. 신호 해석부는 신호 처리부, 위치정보 산출부, 이벤트 결정부 및 생체정보 해석부를 포함한다. 신호 처리부는 Tx 신호들(Tx1,Tx2) 및 Rx 신호들(Rx1,Rx2)을 증폭하는 증폭부(Amplifier) 및 증폭부에서 증폭된 신호들 중에서 유효 신호를 추출하는 디지털 신호 처리부(Digital Signal Process)를 포함할 수 있다. 증폭부는 저잡음 증폭기(Low Noise Amplifier; LNA)를 이용할 수 있다. 위치정보 산출부는 신호 처리부로부터의 Tx1 신호 및 Rx1 신호를 바탕으로 제1 무선신호 송수신기 와 객체 간의 이격거리를 산출하고, Tx2 신호 및 Rx2 신호를 바탕으로 제2 무선신호 송수신기와 객체 간의 이격거리를 산출한다. 본 명세서에서 객체는 자연인을 지칭하고, 특히 모니터링의 대상이 되는 노약자를 지칭한다. 그리고, 위치정보 산출부는 객체와 제1 및 제2 무선신호 송수신기들(110,120) 간의 이격거리를 바탕으 로, 객체의 위치정보(Pxy)를 산출한다. 위치정보(Pxy)는 모니터링 대상 영역 내에서 객체의 위치를 표 시하는 2차원 좌표를 지칭한다. 이벤트 결정부는 위치정보 산출부로부터 위치정보(Pxy)를 전달받고, 위치정보(Pxy)의 변화량에 따라 이벤트 발생 여부를 결정한다. 특히, 이벤트 결정부는 위치정보(Pxy) 및 메타정보에 따라 다르게 설정된 가중치를 고려하여 이벤트 발생 여부를 결정한다. 이벤트는 위치정보(Pxy)를 바탕으로 모니터링 한 객체의 위치가 일정 시간 동안 한 곳에 머무를 때에 생성될 수 있다. 생체정보 해석부는 이벤트가 발생할 때, 객체의 생체정보를 해석한다. 객체의 생체정보는 Rx 신 호들(Rx1,Rx2)의 특정 주파수를 바탕으로 획득하고, 획득한 생체정보의 이상 유무를 해석한다. 이벤트 결정부 가 획득하는 생체정보는 심박수 등이 될 수 있다. 생체정보 해석부는 해석한 신체정보에 따라 구호 조치를 취할 수 있다. 구호조치는 구호기관에 호출하는 동작을 포함할 수 있으며, 이때, 이벤트 결정부가 획득한 신체정보가 구호기관에 전달될 수도 있다. 노약자 케어를 위한 모니터링 방법 도 2는 본 발명에 의한 노약자 케어를 위한 모니터링 방법을 나타내는 도면이다. 도 1 및 도 2를 참조하여, 본 발명에 의한 노약자 케어를 위한 모니터랑 방법을 구체적으로 살펴보면 다음과 같 다. 제1 단계(S210)에서, 위치정보 산출부는 무선신호의 반사파를 바탕으로 객체의 위치정보(Pxy)를 획득 한다. 객체의 위치정보(Pxy)를 획득하기 위해서, 위치정보 산출부는 제1 무선신호 송수신기와 객체 간의 이격거리 및 제2 무선신호 송수신기와 객체 간의 이격거리를 산출한다. 먼저, 제1 무선신호 송수신기와 객체 간의 이격거리를 산출하는 방법을 살펴보면 다음과 같다. 제1 무선신호 송수신기는 객체와의 이격거리를 산출하기 위해서, Tx1 신호를 송출하고, Rx1 신호들을 수신한다. 도 3은 제1 송신부가 송출하는 Tx1 신호의 실시 예를 나타내는 도면이고, 도 4는 Tx1 신호 및 제1 수신부가 수신하는 Rx1 신호들을 나타내는 도면이다. 도 3 및 도 4를 참조하면, 제1 송신부는 시간에 따라 주파수가 가변하는 쳐프 신호(Chirp Signal)를 Tx1 신호로 송출할 수 있다. 제1 수신부가 수신하는 Rx1 신호들은 Tx1 신호와 마찬가지로 시간에 따라 주파수 가 달라지며, Tx1 신호가 지연된 것과 같다. Tx1 신호는 서로 이격거리가 다른 다양한 물체들에 의해서 반사되 기 때문에, 도 4에서와 같이 제1 수신부는 다수의 Rx1 신호들을 수신할 수 있다. Tx1 신호와 Rx1 신호들 은 시간에 따라 주파수가 달라지기 때문에, 특정 시점에 수신되는 Rx1 신호의 주파수는 어느 시점의 Tx1 신호가 지연된 것이지 알 수 있다. 이와 유사하게, 제2 송신부는 Tx2 신호를 송출하고, 제2 수신부는 Rx2 신호를 수신한다. 신호 처리부는 제1 무선신호 송수신기로부터의 Tx1 신호 및 Rx1 신호들과 함께 제2 무선신호 송수신 기로부터의 Tx2 신호 및 Rx2 신호들을 제공받는다. 신호 처리부는 Tx 신호들(Tx1,Tx2) 및 Rx 신호들(Rx1,Rx2)을 증폭하고, 증폭된 신호들 중에서 유효 신호를 추출한다. 위치정보 산출부는 신호 처리부를 경유한 Tx 신호들(Tx1,Tx2) 및 Rx 신호들(Rx1,Rx2)을 제공받는다. 위치정보 산출부는 다수의 Rx1 신호들 중에서 어느 하나의 신호를 객체로부터 반사되는 반사파로 추정 한다. 위치정보 산출부는 Rx1 신호들이 지연되는 변화량을 바탕으로 객체로부터의 반사파를 추정한다. 객체는 자연인이기 때문에 조금씩이라도 지속적으로 움직이고, 객체로부터의 반사파는 지연 되는 정도가 지속적으로 달라진다. 따라서, 위치정보 산출부는 지속적으로 지연되는 정도가 달라지는 Rx1 신호가 객체로부터 반사되는 반사파인 것으로 추정한다. 이하, 본 명세서에서 Rx1 신호 및 Rx2 신호는 객 체로부터 반사되는 반사파를 지칭하기로 한다. 위치정보 산출부는 Rx1 신호가 Tx1 신호로부터 지연되는 정도를 바탕으로 제1 무선신호 송수신기와 객체 간의 제1 이격거리를 산출한다. 위치정보 산출부는 도 5에서와 같이, 시간에 따라 제1 이격거리 (d1)의 변화를 산출할 수 있다. 이와 같은 방법으로 위치정보 산출부는 Tx2 신호 및 Rx2 신호를 바탕으로, 제2 무선신호 송수신기와 객체 간의 제2 이격거리를 변화를 산출할 수 있다. 위치정보 산출부는 제1 및 제2 이격거리를 바탕으로 객체의 위치정보(Pxy)를 산출한다. 위치정보 (Pxy)는 모니터링 대상 영역 내에서 객체의 위치를 표시하는 2차원 좌표에 해당할 수 있다. 도 6 및 도 7은 위치정보 산출부가 위치정보를 산출하는 실시 예를 설명하기 위한 도면이다. 도 6은 모니터링 대상 영역을 도시하고 있고, 도 7은 모니터링 대상 영역을 2차원 좌표로 변환한 것을 도시하고 있다. 도 6 및 도 7을 참조하면, 제1 무선신호 송수신기의 위치는 좌표상에서 \"x1\" 좌표로 표시되고, 제2 무선신 호 송수신기의 위치는 좌표상에서 \"x2\" 좌표로 표시된다. x1 좌표 및 x2 좌표 간의 이격거리(ds)는 위치 정보 산출부에 미리 저장된다. 위치정보 산출부는 임의의 타이밍에서 제1 이격거리(d1)와 제2 이격거리(d2)를 바탕으로 객체의 위치 정보(Pxy)에 해당하는 2차원 좌표를 산출한다. 위치정보 산출부는 임의의 타이밍에서 객체의 위치정 보(Pxy)를 산출할 수 있고, 시계열적으로 연속적인 객체의 위치정보(Pxy)를 일정 시간 단위로 산출한다. 제2 단계(S220)에서, 이벤트 결정부는 위치정보(Pxy)의 변화량을 바탕으로 객체의 움직임을 모니터링 한다. 이벤트 결정부는 2회의 타이밍에서 각각 산출된 위치정보(Pxy)들을 연결하는 벡터를 생성할 수 있고, 벡터 의 크기를 위치정보(Pxy)의 변화량으로 결정할 수 있다. 위치정보 산출부는 무선신호를 해석하는 분해능 에 따라 1 밀리미터(mm) 내외의 위치정보(Pxy)의 변화량을 파악할 수 있다. 본 발명의 실시 예에서 이벤트는 객체가 이동하는지 여부에 따라 결정되기 때문에, 위치정보(Pxy)의 변화량이 수 센티미터(cm) 이하일 때에 는 객체가 이동하지 않는 것으로 간주할 수 있다. 이벤트 결정부는 미리 설정된 이동 임계치를 바탕 으로, 위치정보(Pxy)의 변화량이 이동 임계치 이상일 때 객체가 이동한다고 판단한다. 제3 단계(S230)에서, 이벤트 결정부는 임계시간 동안 객체의 이동이 없는지를 모니터링한다. 제4 단계(S240)에서, 이벤트 결정부는 객체가 이동하지 않는 상태가 임계시간에 도달할 때에 이벤트를 발생시킨다. 즉, 이벤트 결정부는 객체가 특정 장소에서 머무르는 기간이 필요 이상으로 길어질 때, 객체의 신체에 이상이 있다고 판단하여 이벤트를 결정한다. 모니터링 대상 영역, 예컨대 주거 공간 내에서 객체의 활동 시간은 상이하다. 예컨대, 침대가 놓여져 있는 방에서는 오랜 시간동안 머무를 수 있고, 화장실이나 현관 앞에서는 상대적으로 머무르는 시간이 짧다. 따라서, 이벤트 결정의 기준이 되는 임계시간은 객체의 위치정보(Pxy)에 따라 달라진다. 즉, 이벤트 결정 부는 위치정보(Pxy)에 따라 위치정보 가중치(Wp)를 다르게 하여 임계시간을 설정한다. 다음의 표 1은 위치정보에 따라 설정되는 위치정보 가중치의 일례를 나타내는 표이다. 표 1 위치정보 위치정보 가중치(Wp) 방1(침대) 200 방2 72 거실 36 욕실 6 이벤트 결정부는 기준시간(T_ref)과 위치정보 가중치(Wp)의 곱한 결과를 임계시간(T_th)으로 설정할 수 있 다. 즉, \"T_refХWp\"로 연산된 결과를 임계시간(T_th)으로 설정할 수 있다. 기준시간(T_ref)이 100(초)로 설 정되면, 화장실에 속하는 좌표에 대한 임계시간은 \"600초=10분\"에 해당한다. 즉, 이벤트 결정부는 객체 의 위치정보(Pxy)가 화장실에 속한 상태에서 10분 동안 이동하지 않는 상태라고 판단할 때, 이벤트를 발생 시킨다. 표 1은 본 발명을 설명하기 위한 개략적인 가중치를 나타낸 것이고, 모니터링 대상 영역은 표 1에 표기된 것보 다 세분화 된 영역으로 분류될 수 있다. 예컨대, 객체는 욕실 내에서도 욕조와 세면대를 이용할 때의 시간 이 상이할 수 있기 때문에, 욕실내의 영역을 세분화하여 가중치를 부여할 수 있다. 마찬가지로, 침대가 놓인 \"방1\"의 가중치는 침대가 위치한 영역과 침대 이외의 영역에 대한 가중치가 달라질 수 있다. 이벤트 결정부는 임계시간(T_th)을 산출하는 과정에서 메타정보를 고려할 수 있다. 메타정보는 월 (month), 일(day), 시간, 날씨, 온도 등을 포함할 수 있다. 이벤트 결정부는 메타정보들 각각에 대한 메타정보 가중치(Wm)를 부여하고, 메타정보 가중치(Wm)가 고려된 임계시간(T_th)을 산출할 수 있다. 예컨대, 이벤트 결정부는 기준시간(T_ref), 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)에 비례하도록 임계시간(T_th)을 산출할 수 있다. 즉, \"T_refХWpХWm\"의 연산을 통해서 임계시간(T_th)을 산출할 수 있다. 임의의 메타정보 가중치(Wm)는 모든 위치정보(Pxy)에 대해서 동일하거나, 각각의 위치정보(Pxy)에 따라 메타정 보 가중치(Wm)도 달라질 수 있다. 또는 메타정보 가중치(wm)는 특정 위치정보(Pxy)에 한해서만 고려될 수 있다. 또한, 임의의 위치정보(Pxy)에 따라서 둘 이상의 메타정보들이 반영될 수도 있다. 다음의 표 2는 시간에 대한 메타정보 가중치의 일례를 나타내는 표이다. 표 2 위치정보 메타정보 가중치(Wm) 08:00~22:00 08:00~09:00 방1(침대) 0.1 ... 방2 ... ... 거실 ... ... 욕실 ... 1.5 표 2를 참조하면, 위치정보가 \"침대\" 영역에 속할 경우, 08시부터 22시 내에서 메타정보 가중치(Wm)는 \"0.1\"의 크기를 갖는다. 이는 취침 시간 이외에는 객체가 침대 영역에 오랜 시간 머무르지 않는다는 것을 고려하여, 해당 시간 범위에서 임계시간(T_th)을 10% 줄이기 위한 것이다.위치정보가 \"욕실\" 영역에 속할 경우, 08시부터 09시 내에서 메타정보 가중치(Wm)는 \"1.5\"의 크기를 갖는다. 이는 오전 시간 동안 객체가 욕실 이용하는 시간을 고려하여, 해당 시간 범위에서 임계시간(T_th)을 늘리기 위한 것이다. 이처럼, 메타정보 가중치(Wm)는 객체가 특정 시간에서 특정 장소 내에 머무르는 시간을 고려하여 임계시간 (T_th)을 조절하도록 설정될 수 있다. 이와 유사하게 메타정보 가중치(Wm)는 메타정보에 따라 객체가 특정 장소에 머무르는 시간이 달라지는 것을 고려하여 설정될 수 있다. 상술한 바와 같이, 이벤트 결정부는 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)를 이용하여 이벤트 발생 의 기준이 되는 임계시간(T_th)을 산출한다. 특히, 이벤트 결정부는 인공지능 기반으로 위치정보(Pxy) 및 메타정보들을 학습하고, 이를 바탕으로 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)를 실시간으로 수정할 수 있다. 객체의 생활패턴은 수시로 달라질 수 있고, 모니터링 대상이 되는 공간의 구조 또한 달라질 수 있다. 따라 서 객체의 생활패턴 및 모니터링 대상의 공간을 고려하여 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)를 설정한다고 할지라도, 시간이 지나면서 이벤트 발생을 결정하는 정확도가 저하될 수 있다. 이벤트 결정부는 시계열적으로 변하는 위치정보(Pxy)를 축적하고, 이를 학습하여 객체의 이동 패턴을 분석할 수 있다. 이벤트 결정부는 이와 같이 인공지능기반으로 학습된 객체의 이동 패턴을 고려하여 위치정보 가중치(Wp)를 수정할 수 있다. 또한, 이벤트 결정부는 객체의 이동 패턴을 학습하는 동시에 메타정보들의 변화를 학습한다. 그리고 이벤트 결정부는 객체의 이동 패턴에 메타정보들이 관여하는 것을 분석하고, 이를 바탕으로 메타정보 가중치(Wm)를 수정할 수 있다. 이벤트 결정부는 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)를 수정하는 과정에서 다른 객체의 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)를 고려할 수 있다. 이벤트 결정부는 다른 객체들의 나이, 성별, 생활 패턴 등을 고려하여 객체들 간의 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)를 학습하고, 이를 반영할 수 있 다. 특히, 이벤트 결정부는 이벤트가 발생하였을 때와, 이벤트 발생에 따라 객체의 생체정보를 해석한 결 과를 추가로 학습하여 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)를 수정할 수 있다. 상술한 바와 같은 AI 프로세싱을 수행하기 위해서, 본 발명의 이벤트 결정부는 AI 장치를 포함할 수 있다. 본 발명의 실시 예에 따른 AI 장치는 AI 프로세싱을 수행할 수 있는 AI 모듈을 포함하는 전자 기기 또는 AI 모듈을 포함하는 서버 등을 포함할 수 있다. 또한, AI 장치는 이벤트 결정부의 적어도 일부의 구성으 로 포함되어 AI 프로세싱 중 적어도 일부를 함께 수행하도록 구비될 수도 있다. AI 프로세싱은, 이벤트 결정부의 제어와 관련된 모든 동작들을 포함할 수 있다. 예를 들어, 이벤트 결정 부는 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)를 AI 프로세싱 하여 처리/판단하고, 이벤트 결정을 할 수 있다. AI 장치는 AI 프로세싱 결과를 직접 이용하는 클라이언트 디바이스이거나, AI 프로세싱 결과를 다른 기기에 제공하는 클라우드 환경의 디바이스일 수도 있다. 도 8을 참조하면, 본 발명에 따른 AI 장치는 AI 프로세서, 메모리 및/또는 통신부를 포함할 수 있다. AI 장치는 신경망을 학습할 수 있는 컴퓨팅 장치로서, 서버, 데스크탑 PC, 노트북 PC, 태블릿 PC 등과 같은 다양한 전자 장치로 구현될 수 있다. AI 프로세서는 메모리에 저장된 프로그램을 이용하여 신경망을 학습할 수 있다. 특히, AI 프로세서(2 1)는 위치정보 가중치(Wp) 및 메타정보 가중치(Wm)를 인식하기 위한 신경망을 학습할 수 있다. 여기서, 위치정 보 가중치(Wp) 및 메타정보 가중치(Wm)를 인식하기 위한 신경망은 인간의 뇌 구조를 컴퓨터 상에서 모의하도록 설계될 수 있으며, 인간의 신경망의 뉴런(neuron)을 모의하는 복수의 네트워크 노드들을 포함할 수 있다. 복수 의 네트워크 모드들은 뉴런이 시냅스(synapse)를 통해 신호를 주고 받는 뉴런의 시냅틱 활동을 모의하도록 각각연결 관계에 따라 데이터를 주고 받을 수 있다. 여기서 신경망은 신경망 모델에서 발전한 딥러닝 모델을 포함 할 수 있다. 딥 러닝 모델에서 복수의 네트워크 노드들은 서로 다른 레이어에 위치하면서 컨볼루션 (convolution) 연결 관계에 따라 데이터를 주고 받을 수 있다. 신경망 모델의 예는 심층 신경망(DNN, deep neural networks), 합성곱 신경망(CNN, convolutional deep neural networks), 순환 신경망(RNN, Recurrent Boltzmann Machine), 제한 볼츠만 머신(RBM, Restricted Boltzmann Machine), 심층 신뢰 신경망(DBN, deep belief networks), 심층 Q-네트워크(Deep Q-Network)와 같은 다양한 딥 러닝 기법들을 포함하며, 컴퓨터비젼, 음성인식, 자연어처리, 음성/신호처리 등의 분야에 적용될 수 있다. 한편, 전술한 바와 같은 기능을 수행하는 프로세서는 범용 프로세서(예를 들어, CPU)일 수 있으나, 인공지능 학 습을 위한 AI 전용 프로세서(예를 들어, GPU)일 수 있다. 메모리는 AI 장치의 동작에 필요한 각종 프로그램 및 데이터를 저장할 수 있다. 메모리는 비 휘발 성 메모리, 휘발성 메모리, 플래시 메모리(flash-memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드 라이브(SDD) 등으로 구현할 수 있다. 메모리는 AI 프로세서에 의해 액세스되며, AI 프로세서에 의 한 데이터의 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 또한, 메모리는 본 발명의 일 실시예에 따른 데이터 분류/인식을 위한 학습 알고리즘을 통해 생성된 신경망 모델(예를 들어, 딥 러닝 모델)을 저장할 수 있다. 한편, AI 프로세서는 데이터 분류/인식을 위한 신경망을 학습하는 데이터 학습부를 포함할 수 있다. 데 이터 학습부는 데이터 분류/인식을 판단하기 위하여 어떤 학습 데이터를 이용할지, 학습 데이터를 이용하여 데이터를 어떻게 분류하고 인식할지에 관한 기준을 학습할 수 있다. 데이터 학습부는 학습에 이용될 학습 데이터를 획득하고, 획득된 학습데이터를 딥러닝 모델에 적용함으로써, 딥러닝 모델을 학습할 수 있다. 데이터 학습부는 적어도 하나의 하드웨어 칩 형태로 제작되어 AI 장치에 탑재될 수 있다. 예를 들어, 데이터 학습부는 인공지능(AI)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 범용 프로세서(CPU) 또 는 그래픽 전용 프로세서(GPU)의 일부로 제작되어 AI 장치에 탑재될 수도 있다. 또한, 데이터 학습부 는 소프트웨어 모듈로 구현될 수 있다. 소프트웨어 모듈(또는 인스트럭션(instruction)을 포함하는 프로그램 모 듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록 매체 (non-transitory computer readable media)에 저장될 수 있다. 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 애플리케이션에 의해 제공될 수 있다. 데이터 학습부는 학습 데이터 획득부 및 모델 학습부를 포함할 수 있다. 학습 데이터 획득부는 데이터를 분류하고 인식하기 위한 신경망 모델에 필요한 학습 데이터를 획득할 수 있 다. 예를 들어, 학습 데이터 획득부는 학습 데이터로서, 신경망 모델에 입력하기 위한 위치정보 가중치 (Wp) 및 메타정보 가중치(Wm)를 획득할 수 있다. 모델 학습부는 획득된 학습 데이터를 이용하여, 신경망 모델이 소정의 데이터를 어떻게 분류할지에 관한 판 단 기준을 가지도록 학습할 수 있다. 이 때 모델 학습부는 학습 데이터 중 적어도 일부를 판단 기준으로 이 용하는 지도 학습(supervised learning)을 통하여, 신경망 모델을 학습시킬 수 있다. 또는 모델 학습부는 지도 없이 학습 데이터를 이용하여 스스로 학습함으로써, 판단 기준을 발견하는 비지도 학습(unsupervised learning)을 통해 신경망 모델을 학습시킬 수 있다. 또한, 모델 학습부는 학습에 따른 상황 판단의 결과가 올바른지에 대한 피드백을 이용하여 강화 학습(reinforcement learning)을 통하여, 신경망 모델을 학습시킬 수 있다. 또한, 모델 학습부는 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient decent)을 포함하는 학습 알고리즘을 이용하여 신경망 모델을 학습시킬 수 있다. 신경망 모델이 학습되면, 모델 학습부는 학습된 신경망 모델을 메모리에 저장할 수 있다. 모델 학습부(2 4)는 학습된 신경망 모델을 AI 장치와 유선 또는 무선 네트워크로 연결된 서버의 메모리에 저장할 수도 있 다. 데이터 학습부는 인식 모델의 분석 결과를 향상시키거나, 인식 모델의 생성에 필요한 리소스 또는 시간을 절약하기 위해 학습 데이터 전처리부(미도시) 및 학습 데이터 선택부(미도시)를 더 포함할 수도 있다. 학습 데이터 전처리부는 획득된 데이터가 상황 판단을 위한 학습에 이용될 수 있도록, 획득된 데이터를 전처리 할 수 있다. 예를 들어, 학습 데이터 전처리부는, 모델 학습부가 이미지 인식을 위한 학습을 위하여 획득 된 학습 데이터를 이용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다.또한, 학습 데이터 선택부는, 학습 데이터 획득부에서 획득된 학습 데이터 또는 전처리부에서 전처리된 학 습 데이터 중 학습에 필요한 데이터를 선택할 수 있다. 선택된 학습 데이터는 모델 학습부에 제공될 수 있 다. 예를 들어, 학습 데이터 선택부는 위치정보 산출부가 획득한 위치정보 중에서 특정 영역을 중심으로 학습 데이터를 선택할 수도 있다. 또한, 데이터 학습부는 신경망 모델의 분석 결과를 향상시키기 위하여 모델 평가부(미도시)를 더 포함할 수 도 있다. 모델 평가부는, 신경망 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 분석 결과가 소정 기준을 만족하지 못하는 경우, 모델 학습부로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터는 인식 모델을 평가하기 위한 기 정의된 데이터일 수 있다. 일 예로, 모델 평가부는 평가 데이터에 대한 학습된 인식 모델의 분석 결과 중, 분석 결과가 정확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정되 임계치를 초과 하는 경우, 소정 기준을 만족하지 못한 것으로 평가할 수 있다. 통신부는 외부로부터 메타정보를 수신하고, 또한 AI 프로세싱 결과를 외부로 전송할 수 있다. 예컨대, 통 신부는 기상관측서버를 통해서 날씨 등의 메타정보를 수신할 수 있다. 또한, 생체정보 해석부의 결과 에 따라, 통신부를 통해서 구호기관에 구호조치가 전달될 수 있다. 한편, 도 8에 도시된 AI 장치는 AI 프로세서와 메모리, 통신부 등으로 기능적으로 구분하여 설 명하였지만, 전술한 구성요소들이 하나의 모듈로 통합되어 AI 모듈로 호칭될 수도 있다. 또한, 도 8에 도시된 AI 장치는 하나의 실시 예에 해당하며, AI 프로세싱을 위해서 추가적인 구성이 더해줄 수도 있고, 임의의 구성은 생략될 수도 있다. 제5 단계(S250)에서, 생체정보 해석부는 이벤트가 발생하였을 때, 객체의 생체정보를 해석한다. 생체 정보 해석 방법 도 9는 생체정보 해석부가 생체정보를 해석하는 실시 예를 나타내는 도면이다. 도 9를 참조하면, 생체정보 해석부는 반사파를 바탕으로 생체정보를 해석한다. 예컨대, Rx1 신호는 메인 주파수(fm)와 주변 주파수(fs)를 포함할 수 있다. 메인 주파수(fm)는 앞서 설명된 객체의 움직임을 파악하 는 데에 이용된다. Rx1 신호는 객체의 움직임 이외에도, 객체의 심박수 또는 호흡 등에 따라서 미세한 주변 주파수(fs)가 혼합된다. 주변 주파수(fs)는 객체의 위치정보(Pxy)를 산출하는 과정에서 노이즈 (noise)로 간주되지만, 생체정보 해석부는 주변 주파수(fs)의 특정 주파수 성분을 검출하고, 이를 바탕으 로 객체의 심박수 등의 생체정보를 획득할 수 있다. 생체정보 해석부는 생체정보 변화량이 순간적으로 크게 변할 경우, 객체의 건강 이상이 도래하였다고 판단하고 알람을 생성한다. 생체정보 해석부는 인공지능 기반으로 생체정보를 학습하고, 이를 바탕으로 알람을 생성할 수 있다. 또한, 생체정보 해석부는 생체정보를 학습하는 과정에서, 다른 객체들의 생체정보 학습 결과를 고려할 수 있다. 제6 단계(S260)에서, 생체정보 해석부로부터 객체의 건강 이상 징후에 대한 알람이 생성되었을 때, 신 호 해석부는 구제기간에 호출하는 등의 구호조치를 취한다. 살펴본 바와 같이, 본 발명은 레이더 방식으로 객체의 건강 상태를 모니터링 할 수 있다. 본 발명은 영상 촬영이나 음성 신호를 바탕으로 객체를 모니터링 하는 것이 아니기 때문에, 객체의 사 생활 침해를 최소화할 수 있다. 또한, 본 발명은 영상 촬영을 이용하지 않기 때문에, 모니터링 대상의 주변 조도 및 빛 반사로 인해서 객체(1 0)의 상태를 모니터링하기 곤란한 문제점을 해소할 수 있다. 본 발명은 음성 신호를 이용하지 않기 때문에, 주 변의 소음으로 인해서 객체의 상태를 모니터링 하기 곤란한 문제점을 해소할 수 있다. 또한, 처프 레이더 와 같은 무선신호는 제1 및 제2 무선신호 송수신기들(110,120)과 객체 사이에 장애물 영향을 받지않고 객체 를 모니터링 할 수 있다. 이처럼 본 발명은 방해 요소의 영향을 받지 않고, 음영지역 없이 객체를 모 니터링 할 수 있다. 또한, 본 발명을 실시하기 위해서 객체는 추가적인 장치를 신체에 부착시키거나 보유할 필요가 없기 때문에, 객체는 불편함을 느끼지 않을 수 있다. 본 발명의 실시 예 및 본 명세서에 첨부된 도면은 전술한 기술에 포함되는 기술적 사상의 일부를 명확하게 나타 내고 있는 것에 불과하며, 전술한 기술의 명세서 및 도면에 포함된 기술적 사상의 범위 내에서 당업자가 용이하 게 유추할 수 있는 변형 예와 구체적인 실시 예는 모두 전술한 기술의 권리범위에 포함되는 것이 자명하다고 할 것이다."}
{"patent_id": "10-2019-0050129", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 의한 헬스 케어를 위한 모니터링 시스템을 나타내는 도면이다. 도 2는 본 발명에 의한 노약자 케어를 위한 모니터링 방법을 나타내는 도면이다. 도 3은 제1 송신부가 송출하는 Tx1 신호의 실시 예를 나타내는 도면이다. 도 4는 Tx1 신호 및 Rx1 신호들을 나타내는 도면이다. 도 5는 시간에 따른 제1 이격거리 변화의 일례를 나타내는 도면이다. 도 6 및 도 7은 위치정보 산출부가 위치정보를 산출하는 실시 예를 설명하기 위한 도면이다. 도 8은 이벤트 결정부에 속한 인공지능 장치의 구성을 나타내는 도면이다. 도 9는 생체정보 해석부가 생체정보를 해석하는 실시 예를 나타내는 도면이다."}
