{"patent_id": "10-2023-0132595", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0049758", "출원번호": "10-2023-0132595", "발명의 명칭": "터널 분진 저감장치", "출원인": "한국철도기술연구원", "발명자": "정우태"}}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "먼지 포집 모듈을 이용하여 지하철 터널 내에서 발생되는 미세먼지를 포집하는 터널 분진 저감장치에 있어서,지하철 터널 내에 배치되며, 상기 지하철 터널 내에 발생되는 미세먼지가 포함된 공기를 내부공간으로 유입시키기 위한 유입부와, 상기 먼지 포집 모듈에 의해 미세먼지가 제거된 공기를 상기 지하철 터널 내로 토출시키기위한 토출부가 구비된 본체;상기 본체의 내부공간상 상기 유입부의 후단 측에 배치되며, 복수의 필라멘트를 이용하여 상기 유입부를 통해상기 본체의 내부공간으로 유입되는 미세먼지가 포함된 공기로부터 미세먼지를 포집하는 상기 먼지 포집 모듈;상기 본체의 내부공간상 상기 먼지 포집 모듈과 상기 토출부의 사이에 배치되고, 상기 미세먼지가 포함된 공기를 상기 먼지 포집 모듈로 급기시키며, 상기 미세먼지가 제거된 공기를 상기 토출부로 배기시키는 송풍팬; 및상기 본체의 내부공간상 상기 먼지 포집 모듈과 상기 송풍팬의 사이 이격공간에 설치되어 필라멘트 다발 부재의차압을 측정하는 차압센서;를 포함하는 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 먼지 포집 모듈은,상기 유입부를 통과하는 미세먼지가 포함된 공기의 유입을 위한 제1 개구부와 상기 미세먼지가 제거된 공기를상기 송풍팬으로 배출시키기 위한 제2 개구부가 마주보는 두 측면에 구비되고, 측면부로 둘러싸진 내부공간이형성되는 케이스;상기 복수의 필라멘트가 상기 제1 개구부로부터 상기 제2 개구부를 향하는 길이 방향에 대해 소정의 각도 범위이내로 배열된 필라멘트 다발 부재; 및상기 복수의 필라멘트 다발 부재가 상기 케이스의 내부공간상에 배열되도록 상기 필라멘트 다발 부재를 고정시키는 홀더부;를 포함하는 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 필라멘트 다발 부재는,상기 복수의 필라멘트가 상기 케이스의 내부공간상에서 상기 제1 개구부를 통과하는 미세먼지가 포함된 공기로부터 미세먼지를 포집하는 3차원 필터인 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 필라멘트 다발 부재는,상기 복수의 필라멘트가 상기 홀더부와 결합된 일측으로부터 상기 홀더부로부터 멀어지는 타측으로 갈수록 사이의 간격이 벌어지는 부채꼴의 형태로 배열되는 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 케이스는,상기 제1 개구부를 형성하는 측면부의 일단에 상기 홀더부의 양단이 끼움결합될 끼움결합홈이 복수로 형성되는공개특허 10-2025-0049758-3-것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 홀더부는,양단이 상기 복수의 끼움결합홈에 끼움결합되도록 복수개로 구비되며, 각 홀더부가 슬라이딩 방식을 기반으로각 끼움결합홈으로부터 탈부착되는 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 먼지 포집 모듈은,상기 유입부를 통과하는 미세먼지가 포함된 공기의 유입을 위한 제1 개구부와 상기 미세먼지가 제거된 공기를상기 송풍팬으로 배출시키기 위한 제2 개구부가 마주보는 두 측면에 구비되고, 측면부로 둘러싸진 내부공간이형성되는 케이스;상기 복수의 필라멘트가 상기 제1 개구부로부터 상기 제2 개구부를 향하는 길이 방향인 제1 방향과 직교하면서상기 케이스의 높이에 대응하는 제2 방향에 대해 소정의 각도 범위 이내로 배열된 종방향 필라멘트 다발 부재;상기 복수의 필라멘트가 상기 제1 방향과 직교하면서 상기 케이스의 폭에 대응하는 제3 방향에 대해 소정의 각도 범위 이내로 배열된 횡방향 필라멘트 다발 부재;상기 종방향 필라멘트 다발 부재가 상기 케이스의 내부공간상에 배열되도록 상기 종방향 필라멘트 다발 부재를고정시키는 제1 홀더부; 및상기 횡방향 필라멘트 다발 부재가 상기 케이스의 내부공간상에 배열되도록 상기 횡방향 필라멘트 다발 부재를고정시키는 제2 홀더부;를 포함하는 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 종방향 및 횡방향 필라멘트 다발 부재는,상기 복수의 필라멘트가 상기 케이스의 내부공간상에서 상기 제1 개구부를 통과하는 미세먼지가 포함된 공기로부터 미세먼지를 포집하는 3차원 필터인 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 종방향 및 횡방향 필라멘트 다발 부재는,상기 복수의 필라멘트가 상기 제1, 2 홀더부와 결합된 일측으로부터 상기 제1, 2 홀더부로부터 멀어지는 타측으로 갈수록 사이의 간격이 벌어지는 부채꼴의 형태로 배열되는 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서,상기 케이스는,상기 측면부의 너비면에 상기 제1, 2 홀더부의 양단이 삽입될 삽입홈이 복수로 형성되는 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,공개특허 10-2025-0049758-4-상기 제1, 2 홀더부는,양단이 상기 복수의 삽입홈에 삽입되도록 복수개로 구비되며, 각각의 제1, 2 홀더부가 슬라이딩 방식을 기반으로 상기 복수의 삽입홈에 삽입되는 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 본체는,상기 유입부 및 토출부가 공기의 이송경로를 3방향으로 제공하는 것을 특징으로 하는 터널 분진 저감장치."}
{"patent_id": "10-2023-0132595", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 터널 분진 저감장치는, 먼지 포집 모듈을 이용하여 지하철 터널 내에서 발생되는 미 세먼지를 포집하는 터널 분진 저감장치에 있어서, 지하철 터널 내에 배치되며, 상기 지하철 터널 내에 발생되는 미세먼지가 포함된 공기를 내부공간으로 유입시키기 위한 유입부와, 상기 먼지 포집 모듈에 의해 미세먼지가 제 (뒷면에 계속)"}
{"patent_id": "10-2023-0132595", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 터널 분진 저감장치에 관한 것으로, 더욱 상세하게는 필라멘트를 이용한 3차원 먼지 포집 기술을 기 반으로 밀폐된 구조의 지하철 터널 내에서 발생되는 미세먼지를 포집할 수 있는 터널 분진 저감장치에 관한 것 이다."}
{"patent_id": "10-2023-0132595", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지하철역사 내 스크린도어 설치 후 승강장 및 지하상가의 오염물질과 미세먼지 농도는 감소했으나, 밀폐공간이 되어버린 지하철 터널 내의 미세먼지는 증가하고 있으며, 이러한 미세먼지는 지하철 객차 내로 유입되어 승객의 호흡기 안전을 위협하고 있는 실정이다. 이러한 각종 지하철 터널의 환경에서 발생하는 분진과 같은 미세먼지에 대한 대책으로 강제 환기시스템, 물 분 사시스템, 필터시스템의 장치가 있다. 강제 환기시스템은 외부로 나가는 오염물질을 별도로 처리해야하는 시설 마련 등 비용적 측면의 문제점이 있으 며, 시설이 마련되지 못할 시 2차적인 오염을 유발하는 문제점이 있다. 물 분사시스템은 물탱크 레일차량을 이용하여 고압의 물을 분사하는 방법이나, 물 분사후 48시간 이내에 증발되 어 물을 연속적으로 분사해야하는 불편함이 있으며, 지하철 운행시간을 고려하여 새벽의 짧은 시간에 작업을 해 야하므로 지하철 터널 내의 미세먼지 저감의 효율성이 떨어지는 문제점이 있다. 필터시스템은 도 1 및 도 2에 도시된 바와 같이 구현될 수 있으며, 도 1은 부직포 프리필터를 도시한 도면이고, 도 2는 부직포 프리필터의 여과집진 방식을 설명하기 위한 도면이다. 도 1 및 도 2를 참조하면, 필터시스템은 통상적으로 부직포 필터를 전단에 고정되도록 부착하는데, 부직포 필터는 프레임에 부직포를 고정시키며, 필요시 보조 프레임을 통해 부직포를 추가적 으로 고정하는 단순한 구조를 가지고 있다. 또한, 부직포의 면은 도 2에 도시된 바와 같이 2차원적인 평면 에 해당하며, 마이크로미터 스케일의 섬유층(마이크로 섬유)으로 이루어져 있고, 이러한 마이크로 섬유가 랜덤 방사되어 있는 특징을 가지고 있으며, 마이크로 섬유의 직경은 수㎛ 내지 수백㎛의 크기를 가지고 있다. 또한, 부직포 필터는 미세먼지가 포함된 공기가 부직포의 2차원적 평면을 통과하는 과정에서 미세먼지를 포 집하는 방식을 취하고 있기 때문에 부직포 자체의 여과집진 기능에 의존하게 된다. 그러나 부직포 필터는 오래 사용할수록 미세먼지를 포집하는 부직포에 포집된 먼지가 많아지게 되어 공기가 통과하는 기공이 막히게 되거나, 필터 차압 증가로 공기의 통과 유량이 감소하게 되고, 이로 인해 추가 에너지가 소비될 뿐만 아니라 누기(Leak)가 발생하게 된다. 이에 의해 필터시스템은 부직포 필터의 잦은 교체가 이루어져야 하며, 잦은 교체로 인한 자재 및 인건비 비용이 증가하는 문제점이 있다. 이러한 분진 저감 시스템인 강제 환기시스템, 물 분사시스템, 필터시스템을 비용적 측면에서 비교하자면, 필터 시스템이 가장 적은 비용으로 지하철 터널 내에서 발생되는 미세먼지를 저감시킬 수 있다. 이에 따라, 다른 분진 저감 시스템보다 비용적 측면에서 유리한 필터시스템의 문제점을 개선하여, 지하철 터널 내에서 발생되는 미세먼지를 보다 효율적으로 저감시킬 수 있는 방안이 연구될 필요가 있다. 선행기술문헌특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-2275517호(2021.07.05 등록) (특허문헌 0002) 대한민국 공개특허공보 제10-2009-0118587호(2009.11.18 공개) (특허문헌 0003) 대한민국 공개특허공보 제10-2004-0096819호(2004.11.17 공개)"}
{"patent_id": "10-2023-0132595", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 종래 필터시스템의 문제점을 개선하기 위해 안출된 것으로서, 본 발명의 목적은 필터 막힘 현상을 최소화시키면서 지하철 터널 내에서 발생되는 미세먼지를 최대한 포집하기 위해 필라멘트를 이용한 3차 원 먼지 포집 기술을 기반으로 밀폐된 구조의 지하철 터널 내에서 발생되는 미세먼지를 포집할 수 있는 터널 분 진 저감장치를 제공함에 있다. 다만, 본 발명에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급하지 않"}
{"patent_id": "10-2023-0132595", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명 확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0132595", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 기술적 수단으로서 본 발명의 일 실시예에 따른 터널 분진 저감장치는, 먼지 포집 모듈을 이용하여 지하철 터널 내에서 발생되는 미세먼지를 포집하는 터널 분진 저감장치에 있어서, 지하철 터널 내에 배치되며, 상기 지하철 터널 내에 발생되는 미세먼지가 포함된 공기를 내부공간으로 유입시키기 위한 유입부와, 상기 먼지 포집 모듈에 의해 미세먼지가 제거된 공기를 상기 지하철 터널 내로 토출시키기 위한 토출 부가 구비된 본체; 상기 본체의 내부공간상 상기 유입부의 후단 측에 배치되며, 복수의 필라멘트를 이용하여 상 기 유입부를 통해 상기 본체의 내부공간으로 유입되는 미세먼지가 포함된 공기로부터 미세먼지를 포집하는 상기 먼지 포집 모듈; 상기 본체의 내부공간상 상기 먼지 포집 모듈과 상기 토출부의 사이에 배치되고, 상기 미세먼 지가 포함된 공기를 상기 먼지 포집 모듈로 급기시키며, 상기 미세먼지가 제거된 공기를 상기 토출부로 배기시 키는 송풍팬; 및 상기 본체의 내부공간상 상기 먼지 포집 모듈과 상기 송풍팬의 사이 이격공간에 설치되어 필라 멘트 다발 부재의 차압을 측정하는 차압센서;를 포함할 수 있다."}
{"patent_id": "10-2023-0132595", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 의하면, 필라멘트 다발 타입의 필라멘트 다발 부재를 3차원 공간에 배치하여 먼지 포집 모듈의 장시간 사용이 가능하면서 필터 막힘 현상이 거의 발생하지 않으며, 필요시 세척에 의해 필라멘트 다발 부재를 재활용할 수 있으므로, 필터의 반영구적인 사용이 가능하여 필터의 교체 비용을 최소화할 수 있는 장점 이 있다. 본 발명의 일 실시예에 의하면, 공기의 흐름에 따라 필라멘트 다발 타입의 필라멘트 다발 부재에 구비된 각 필 라멘트가 다른 필라멘트와 서로 마찰되면서 발생하는 대전 정전기에 의해서 지하철 터널 내에서 발생되는 미세 먼지의 포집 성능이 향상될 수 있다. 본 발명의 일 실시예에 의하면, 각 필라멘트를 적어도 두 개 이상의 대전서열 차이가 큰 재질의 섬유를 조합하 여 구성함으로써, 효과적인 정전기 발생을 유도하여 지하철 터널 내에서 발생되는 미세먼지의 포집 성능이 향상 될 수 있다. 다만, 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효"}
{"patent_id": "10-2023-0132595", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0132595", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명에 관한 설명은 구조적 내지 기능 적 설명을 위한 실시예에 불과하므로, 본 발명의 권리범위는 본문에 설명된 실시예에 의하여 제한되는 것으로 해석되어서는 아니 된다. 즉, 실시예는 다양한 변경이 가능하고 여러 가지 형태를 가질 수 있으므로 본 발명의 권리범위는 기술적 사상을 실현할 수 있는 균등물들을 포함하는 것으로 이해되어야 한다. 또한, 본 발명에서 제 시된 목적 또는 효과는 특정 실시예가 이를 전부 포함하여야 한다거나 그러한 효과만을 포함하여야 한다는 의미 는 아니므로, 본 발명의 권리범위는 이에 의하여 제한되는 것으로 이해되어서는 아니 될 것이다. 본 발명에서 서술되는 용어의 의미는 다음과 같이 이해되어야 할 것이다. \"제1\", \"제2\" 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위한 것으로, 이들 용어들에 의해 권리범위가 한정되어서는 아니 된다. 예를 들어, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에 는, 그 다른 구성요소에 직접적으로 연결될 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어 야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다고 언급된 때에는 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 한편, 구성요소들 간의 관계를 설명하는 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 이웃하는\"과 \"~에 직접 이웃하는\" 등도 마찬가지로 해석되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, \"포함 하다\" 또는 \"가지다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 여기서 사용되는 모든 용어들은 다르게 정의되지 않는 한, 본 발명이 속하는 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 용어들은 관 련 기술의 문맥상 가지는 의미와 일치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한 이 상적이거나 과도하게 형식적인 의미를 지니는 것으로 해석될 수 없다. 본 발명의 일 실시예에 따른 터널 분진 저감장치는 도면에 미도시되었으나, 지하철 터널 내에서 지하철 등 의 차량이 선로를 따라 주행할 때 지하철 터널 내에서 발생(비산)되는 미세먼지(D)를 포집하기 위해 선로 주변 에 설치되는 것이 바람직하다. 도 3은 본 발명의 일 실시예에 따른 터널 분진 저감장치의 내부구조를 도시한 측면도이고, 도 4는 본 발명의 일 실시예에 따른 터널 분진 저감장치의 내부구조를 도시한 평면도이다. 도 3 및 도 4를 참조하면, 터널 분진 저감장치는 필라멘트를 이용한 3차원 먼지 포집 기술을 기반으로 지 하철 터널 내에서 발생되는 미세먼지(D)를 포집하기 위해 본체, 먼지 포집 모듈, 송풍팬 및 차 압센서를 포함한다. 일 실시예에서, 본체는 터널 분진 저감장치의 외형을 이루는 장치로서 도면에 미도시되었으나, 지하 철 터널 내에서 발생되는 미세먼지(D)가 내부공간에 유입(흡입)되도록 지하철 터널 내 지면에 배치될 수 있다. 이러한 본체는 지하철 터널 내에 발생되는 미세먼지(D)가 포함된 공기를 내부공간으로 유입시키기 위한 유 입부와, 먼지 포집 모듈에 의해 미세먼지(D)가 제거된 공기를 지하철 터널 내로 토출시키기 위한 토 출부가 구비된다. 또한, 본체는 유입부와 토출부가 각각 도 2에 도시된 바와 같이 공기의 이송경로를 3방향(3wa y)으로 제공할 수 있다. 즉, 미세먼지(D)가 포함된 공기는 유입부의 3방향 이송경로를 따라 본체의 내부공간에 유입될 수 있으며, 미세먼지(D)가 제거된 공기는 토출부의 3방향 이송경로를 따라 지하철 터널 내로 배출될 수 있다. 일 실시예에서, 먼지 포집 모듈은 본체의 내부공간상 유입부의 후단 측에 배치되며, 복수의 필 라멘트(1221, 1222)를 이용하여 유입부를 통해 본체의 내부공간으로 유입되는 미세먼지(D)가 포함된 공기로부터 미세먼지(D)를 포집한다. 도 5는 본 발명의 일 실시예에 따른 복수의 필라멘트 다발 부재의 배치 방식을 설명하기 위한 도면이다. 도 5를 참조하면, 먼지 포집 모듈은 케이스 및 필라멘트 다발 부재가 구비된다. 일 실시예에서, 케이스는 유입부를 통과하는 미세먼지(D)가 포함된 공기의 유입을 위한 제1 개구부 (121a)가 일측에 구비되며, 미세먼지(D)가 제거된 공기를 송풍팬으로 배출시키기 위한 제2 개구부(121b)가 타측에 구비된다. 즉, 제1 개구부(121a)와 제2 개구부(121b)는 케이스를 이루는 측면부상에서 마주보는 두 측면에 구비될 수 있다. 이때, 케이스는 측면부로 둘러싸진 내부공간이 형성되는데, 케이스의 내부공간은 필라멘트 다발 부재 에 의해 미세먼지(D)가 포집되는 공간으로서 소정의 길이(가로 길이), 폭(두께), 높이(세로 길이)를 가지 는 3차원적인 공간일 수 있다. 일 실시예에서, 케이스의 재질은 금속 재질, 수지 재질 등 강성을 갖는 재질로 이루어질 수 있으나, 이를 한정하지는 아니한다. 일 실시예에서, 필라멘트 다발 부재는 본 발명의 전체 도면상에서 편의상 일부 개수만 도시하였으나, 도면 에 도시된 것보다 많은 개수로 먼지 포집 모듈에 구비되는 것이 바람직하며, 이러한 복수의 필라멘트 다발 부재는 케이스의 내부공간상에서 미세먼지(D)를 포집하기 위한 복수의 필라멘트(1221, 1222)가 구비 된다. 일 실시예에서, 복수의 필라멘트(1221, 1222)는 직경이 0.1 내지 0.5 mm인 매크로 섬유로 구성될 수 있다. 이는, 종래의 부직포 프리필터에 있어서 부직포의 면을 이루는 섬유가 수㎛ 내지 수백㎛의 직경 크기를 갖는 마이크로 섬유로 이루어지는 것과 구분되는 것으로, 매크로 섬유를 사용하는 경우 필터의 내구성이 향 상되므로 필터 수명이 연장될 수 있을 뿐 아니라, 극한의 외부 환경에도 적용 가능하다는 장점을 가진다. 또한, 복수의 필라멘트(1221, 1222)는 매크로 섬유로 구성되는 것으로 한정되는 것은 아니며, 매크로 섬유와 마 이크로 섬유가 혼용되어 두 섬유의 장점을 모두 갖도록 설계될 수 있다. 구체적인 일예로, 복수의 제1 필라멘트는 매크로 섬유로 설계됨과 동시에 복수의 제2 필라멘트는 마이크로 섬유로 설계되고, 매크로 섬유와 마이크로 섬유의 비율은 0.5:1 내지 3:1이 될 수 있다. 이와 같이, 복수의 필라멘트(1221, 1222)가 매크로 섬유와 마이크로 섬유가 혼용될 때, 내구성 향상과 더불어 미세먼지(D)의 포집이 가능한 마이크로 섬유의 장점도 확보할 수 있다는 점에서, 일 실시예에서는 복수의 필라 멘트(1221, 1222)가 매크로 섬유와 마이크로 섬유가 혼용되는 방식으로 설계되는 것이 바람직하다. 일 실시예에서, 필라멘트 다발 부재는 복수의 필라멘트(1221, 1222)가 제1 개구부(121a)로부터 제2 개구부 (121b)를 향하는 길이 방향에 대해 소정의 각도 범위 이내로 배열될 수 있다. 이때, 소정의 각도 범위는 제1 개구부(121a)로부터 제2 개구부(121b)를 향하는 길이 방향에 대해 -30°내지 30 °에 포함되는 각도를 의미하나, 이를 한정하지는 아니한다. 일 실시예에서, 필라멘트 다발 부재는 복수의 필라멘트(1221, 1222)가 케이스의 내부공간상에서 제1 개구부(121a)를 통과하는 미세먼지(D)가 포함된 공기로부터 미세먼지(D)를 포집하는 3차원 필터일 수 있다. 본 발명에서, 필라멘트 다발 부재가 3차원 필터인 것은 복수의 필라멘트(1221, 1222)가 케이스의 내 부공간을 차지하는 형태로 케이스의 내부공간상에 배열되기 때문이다. 이러한 필라멘트 다발 부재는 복수의 필라멘트(1221, 1222)가 케이스의 내부공간에 유입되는 공기에 포함된 미세먼지(D)의 여과 집진을 수행하여 미세먼지(D)를 포집할 수 있으며, 여과 집진 뿐만 아니라 공기의 흐름에 따른 복수의 필라멘트(1221, 1222) 간 마찰에 의해 생성된 대전 정전기를 이용하여 미세먼지(D)를 포집 할 수도 있다. 일 실시예에서, 필라멘트 다발 부재는 대전 정전기를 이용하여 미세먼지(D)를 포집하기 위해 복수의 필라 멘트(1221, 1222)가 대전 서열의 차이가 큰 적어도 두 개의 상이한 재질의 섬유 조합으로 이루어질 수 있다. 구체적인 일예로, 복수의 제1 필라멘트는 양극(+) 대전체용 섬유와 음극(-) 대전체용 섬유의 조합으로 이 루어질 수 있으며, 양극(+) 대전체용 섬유는 나일론 및 레이온 중 적어도 하나 또는 나일론 및 레이온의 조합일 수 있고, 음극(-) 대전체용 섬유는 테프론, 폴리염화비닐, 셀로판, 셀룰로이드, 폴리에틸렌, 아크릴, 폴리에스 텔 중 적어도 하나 또는 2종 이상의 조합일 수 있다. 일 실시예에서, 복수의 필라멘트(1221, 1222)는 직선모 또는 컬링을 갖는 파선 형태로 제조될 수 있으며, 파선 형태인 경우에는 각 필라멘트(1221, 1222)의 사이에 미세먼지(D)를 포집하는 능력이 향상되어 미세먼지(D)가 송 풍팬으로 유입되는 양을 감소시킬 수 있을 뿐만 아니라, 각 필라멘트(1221, 1222)가 케이스의 내부공 간으로 유입되는 공기에 의해 미세하게 변위되면서 대전 정전기를 발생시켜 미세먼지(D)를 포집하는 효율이 극 대화될 수 있다. 일 실시예에서, 필라멘트 다발 부재는 필요시 세척에 의해 재활용이 가능하며, 이를 통해 필터의 교체 비 용을 최소화하는 장점을 갖는다. 한편, 3차원 필터인 필라멘트 다발 부재를 구비한 먼지 포집 모듈과 종래의 부직포 프리필터에 대한 실험 데이터는 도 6에 도시된 바와 같다. 도 6은 도 5에 도시된 먼지 포집 모듈과 기존의 부직포 프리필터의 외기 누적 투입량 대비 차압의 상관 관계를 나타내는 실험 데이터이다. 도 6을 참조하면, 본 발명의 먼지 포집 모듈과 종래의 부직포 프리필터의 성능 실험 데이터는 x축이 외기 누적 투입량(단위: g)으로 구성되고, y축이 차압(단위: Pa)로 구성될 수 있으며, 이러한 구체적인 실험 데 이터의 값은 이하의 [표 1]과 같다. 표 1 부직포 프리필터 먼지 포집 모듈 외기 누적 투입량(g) 차압(Pa) 외기 누적 투입량(g) 차압(Pa)0 95 0 135 10 109 4 130 20 130 8 135 30 141 12 130 40 159 22 135 50 179 32 130 80 220 42 135 100 280 52 130 - - 62 135 - - 72 140 - - 82 145 - - 92 150 - - 102 145 도 6 및 [표 1]을 참조하면, 먼지 포집 모듈은 외기 누적 투입량이 증가하여 미세먼지(D)의 포집량이 증가 하는 경우에도 차압이 일정 범위 내에서 유지되고 있음을 알 수 있다. 이와 같이, 먼지 포집 모듈의 차압이 일정 범위 내에서 유지되는 것은 3차원 필터인 필라멘트 다발 부재 가 3차원 공간인 케이스의 내부공간상에서 미세먼지(D)를 포집하기 때문에 가능하고, 먼지 포집 모듈 은 차압이 일정 범위 내에서 유지됨에 따라 기능이 반영구적으로 유지되어 장시간 사용이 가능하다. 이와 비교하여, 종래의 부직포 프리필터는 외기 누적 투입량이 증가할수록 미세먼지(D)의 포집량이 증가함 과 동시에 미세먼지(D)에 의해 부직포상에 형성된 기공이 막혀 차압이 급격하게 증가하게 되며, 이로 인해 필터로서의 기능이 현저하게 떨어져 잦은 교체가 필요하다. 일 실시예에서, 먼지 포집 모듈은 홀더부가 도 7에 도시된 바와 같이 구비된다. 도 7은 본 발명의 일 실시예에 따른 먼지 포집 모듈을 개략적으로 도시한 도면이다. 도 7을 참조하면, 홀더부는 복수의 필라멘트 다발 부재를 고정시키기 위해 복수의 필라멘트 다발 부 재와 동일 개수만큼 먼지 포집 모듈에 구비될 수 있다. 즉, 본 발명의 홀더부는 복수의 홀더부 로 이해되는 것이 바람직하다. 이러한 복수의 홀더부는 먼지 포집 모듈상에서 제1 개구부(121a)와 제2 개구부(121b) 중 제1 개구부 (121a)에 근접한 위치에 배치되며, 복수의 필라멘트(1221, 1222)의 일측과 결합되어 복수의 필라멘트(1221, 1222)가 케이스의 내부공간상에 배열되도록 한다. 도 8은 본 발명의 일 실시예에 따른 먼지 포집 모듈의 분해도이고, 도 9는 본 발명의 일 실시예에 따른 먼지 포 집 모듈의 사시도이다. 도 8를 참조하면, 먼지 포집 모듈은 제1 프레임 커버와 제2 프레임 커버가 설치될 수 있다. 제1 프레임 커버는 도 9에 도시된 바와 같이 제1 개구부(121a)를 형성하는 케이스의 측면부 일단에 결합되며, 제2 프레임 커버는 제2 개구부(121b)를 형성하는 케이스의 측면부 타단에 결합된다. 제1, 2 프레임 커버(124, 125)는 케이스의 측면부와 결합됨으로써, 복수의 필라멘트 다발 부재의 설 치 위치의 미관을 해치지 않도록 함과 동시에 복수의 필라멘트 다발 부재를 보호할 수 있다. 도 8을 참조하면, 케이스는 각 홀더부의 양단이 삽입될 고정홈(121c)이 측면부의 너비면에 형성된다. 일 실시예에서, 고정홈(121c)은 각 홀더부의 양단을 고정시키기 위해 복수의 홀더부가 구비되는 개수 의 2배만큼 케이스상에 형성되는 것이 바람직하며, 각 홀더부의 양단이 삽입되는 것을 통해 복수의 홀더부를 고정시킬 수 있다. 이때, 케이스는 도면에는 미도시되었으나, 홀더부의 양단을 고정시키는 고정 구조가 각각의 고정홈 (121c)에 형성됨으로써, 복수의 홀더부를 각각 고정시킬 수도 있다. 또한, 복수의 홀더부는 슬라이딩 방식으로 고정홈(121c)으로부터 탈부착됨으로써, 케이스에 배치되거 나 케이스로부터 분리될 수 있다.본 발명에서, 케이스는 복수의 홀더부를 먼지 포집 모듈에 고정시키는 방식을 고정홈(121c)으로 한정하지 아니하며, 변형예로서 고정홈(121c)을 대체하여 형성된 끼움결합홈(121d)을 통해 복수의 홀더부 를 먼지 포집 모듈상에 고정시킬 수도 있다. 도 10은 변형된 케이스에 형성되는 끼움결합홈을 도시한 도면이다. 도 10의 (a) 및 (b)를 참조하면, 케이스는 제1 개구부(121a)를 형성하는 측면부의 일단에 홀더부의 양단이 끼움결합될 끼움결합홈(121d)이 복수로 형성된다. 일 실시예에서, 끼움결합홈(121d)은 홀더부의 양단을 파지하는 것이 가능한 형태로 케이스의 측면부 일단상에 형성된다. 또한, 끼움결합홈(121d)은 각 홀더부의 양단을 고정시키기 위해 복수의 홀더부가 구비되는 개수의 2 배만큼 케이스상에 형성되는 것이 바람직하며, 각 홀더부의 양단이 삽입되는 것을 통해 복수의 홀더 부를 고정시킬 수 있다. 이때, 케이스는 도면에는 미도시되었으나, 홀더부의 양단을 고정시키는 고정 구조가 각각의 끼움결합 홈(121d)에 형성됨으로써, 복수의 홀더부를 각각 고정시킬 수도 있다. 또한, 복수의 홀더부는 슬라이딩 방식으로 끼움결합홈(121d)으로부터 탈부착됨으로써, 케이스에 배치 되거나 케이스로부터 분리될 수 있다. 본 발명에서, 먼지 포집 모듈은 복수의 홀더부가 일렬로 배치되는 것으로 한정되지 아니하며, 도 11 에 도시된 바와 같이 형태가 변형될 수도 있다. 도 11은 본 발명의 일 실시예에 따른 먼지 포집 모듈의 제1 변형예를 도시한 도면이며, 도 12는 도 11의 a-a 단 면을 도시한 도면이다. 도 11 및 도 12에서는 설명의 편의를 위해 필라멘트 다발 부재의 개수를 일부만 도 시하였다. 도 11을 참조하면, 제1 변형예의 먼지 포집 모듈(120a)은 복수의 홀더부가 제1 개구부(121a) 측에 근접한 복수의 제1 홀더부(123a)와, 상기 제1 홀더부(123a)보다 제2 개구부(121b) 측에 근접한 복수의 제2 홀더부 (123b)로 이루어질 수 있다. 일 실시예에서, 복수의 제1 홀더부(123a)는 복수의 제2 홀더부(123b) 사이의 간격마다 복수의 필라멘트가 배열되도록 이격되고, 상기 복수의 제2 홀더부(123b)는 상기 복수의 제1 홀더부(123a) 사이의 간격마다 복수의 제2 필라멘트가 배열되도록 이격될 수 있다. 도 12를 참조하면, 제1 변형예의 먼지 포집 모듈(120a)에서 복수의 필라멘트 다발 부재는 복수의 필라멘트 (1221, 1222)가 먼지 포집 모듈(120a)상에서 제1, 2 홀더부(123a, 123b)와 결합된 일측으로부터 멀어지는 타측 으로 갈수록 사이의 간격이 벌어지는 부채꼴의 형태로 배열될 수 있다. 이러한 복수의 필라멘트 다발 부재는 제1 홀더부(123a)에 결합된 부채꼴 형태인 복수의 제1 필라멘트 와 제2 홀더부(123b)에 결합된 부채꼴 형태인 복수의 제2 필라멘트가 도 12에 도시된 바와 같이 일 부가 엮이는 것을 통해 케이스의 내부공간상에 빈 공간이 발생되지 않도록 촘촘하게 배열될 수 있다. 또한, 복수의 필라멘트 다발 부재는 부채꼴 형태인 복수의 필라멘트(1221, 1222)가 접촉에 의한 대전 정전 기를 발생시킬 수 있다. 본 발명에서, 복수의 필라멘트 다발 부재가 부채꼴의 형태로 배열되는 것은 상술한 먼지 포집 모듈에 서도 동일하게 반영될 수 있으며, 이를 통해 먼지 포집 모듈도 복수의 필라멘트(1221, 1222)가 케이스 의 내부공간상에 빈 공간이 발생되지 않도록 촘촘하게 배열될 수 있다. 도 13은 본 발명의 일 실시예에 따른 먼지 포집 모듈의 제2 변형예를 도시한 도면이며, 도 14는 도 13의 a-a 단 면을 도시한 도면이다. 도 13 및 도 14에서는 설명의 편의를 위해 필라멘트 다발 부재의 개수를 일부만 도 시하였다. 도 13을 참조하면, 제2 변형예의 먼지 포집 모듈(120b)은 제1 변형예의 먼지 포집 모듈(120a)과 형태가 동일하 되, 커버가 추가되어 복수의 제1 홀더부(123a) 및 제2 홀더부(123b)의 외측면에 결합될 수 있다. 도 14를 참조하면, 커버는 복수의 제1, 2 홀더부(123a, 123b)를 보호할 뿐만 아니라, 케이스로 유입 되는 미세먼지(D)가 포함된 공기를 통해 유동이 발생되는 복수의 필라멘트(1221, 1222)와의 마찰이 발생될 수 있으며, 이러한 마찰에 의해 미세먼지(D)를 포집하기 위한 대전 정전기를 발생시키는 것이 가능한 재질(예: 실 리콘)으로 제조될 수 있다. 즉, 제2 변형예의 먼지 포집 모듈(120b)은 제1 홀더부(123a)에 결합된 복수의 필라멘트(1221, 1222)와 제2 홀더 부(123b)에 결합된 복수의 필라멘트(1221, 1222) 간 마찰에 의한 대전 정전기와 상기 제1, 2 홀더부(123a, 123b)에 각각 결합된 복수의 필라멘트(1221, 1222)와 커버 간 마찰에 의한 대전 정전기를 발생시킬 수 있 으며, 이를 통해 제2 변형예의 먼지 포집 모듈(120b)은 상술한 먼지 포집 모듈(120, 120a)과 비교하여, 미세먼 지(D)가 포함된 공기로부터 미세먼지(D)의 포집 효과가 증진될 수 있다. 이하에서는, 상술한 본 발명의 일 실시예에 따른 먼지 포집 모듈(120, 120a, 120b)와 차이점을 중심으로 본 발 명의 다른 실시예에 따른 먼지 포집 모듈(120c)에 대해 자세히 설명하도록 하겠다. 즉, 이하에서 본 발명의 일 실시예에 따른 먼지 포집 모듈(120, 120a, 120b)에서 언급된 구성요소 및 기술적 특 징과 동일한 다른 실시예의 구성요소 및 기술적 특징에 대한 설명은 편의상 생략하도록 하겠다. 도 15는 본 발명의 다른 실시예에 따른 먼지 포집 모듈을 개략적으로 도시한 도면이다. 도 15를 참조하면, 본 발명의 다른 실시예에 따른 먼지 포집 모듈(120c)은 케이스의 내부공간에 종방향 필 라멘트 다발 부재(122a, 122c, 122e) 및 횡방향 필라멘트 다발 부재(122b, 122d, 122f)가 구비된다. 다른 실시예에서, 종방향 필라멘트 다발 부재(122a, 122c, 122e)는 복수의 필라멘트(1221, 1222)가 제1 개구부 (121a)로부터 제2 개구부(121b)를 향하는 길이 방향인 제1 방향(도 15에서 y축 방향)과 직교하면서 케이스(12 1)의 높이에 대응하는 제2 방향(도 15에서 z축 방향)에 대해 소정의 각도 범위 이내로 배열될 수 있다. 또한, 종방향 필라멘트 다발 부재(122a, 122c, 122e)는 제1 홀더부(123c)를 통해 케이스의 내부공간에 배 열될 수 있으며, 복수의 필라멘트(1221, 1222)가 제1 개구부(121a)를 따라 케이스의 내부공간으로 유입되 는 미세먼지(D)가 포함된 공기로부터 미세먼지(D)를 포집할 수 있다. 다른 실시예에서, 횡방향 필라멘트 다발 부재(122b, 122d, 122f)는 제1 방향과 직교하면서 케이스의 폭에 대응하는 제3 방향(도 15에서 x축 방향)에 대해 소정의 각도 범위 이내로 배열될 수 있다. 또한, 횡방향 필라멘트 다발 부재(122b, 122d, 122f)는 제2 홀더부(123d)를 통해 케이스의 내부공간에 배 열될 수 있으며, 복수의 필라멘트(1221, 1222)가 제1 개구부(121a)를 따라 케이스의 내부공간으로 유입되 는 미세먼지(D)가 포함된 공기로부터 미세먼지(D)를 포집할 수 있다. 다른 실시예에서, 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)를 케이스의 내부공간에 배열시키기 위 한 소정의 각도라 함은 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)를 기울이게 하는 틸팅 각도를 의미하 며, 소정의 각도(틸딩 각도) 범위는 5°이내의 틸팅 각도일 수 있으나, 이를 한정하지는 아니한다. 또한, 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)는 복수의 필라멘트(1221, 1222)가 케이스의 내부 공간상에 제1 개구부(121a)를 통과하는 미세먼지(D)가 포함된 공기로부터 미세먼지(D)를 포집하는 3차원 필터일 수 있다. 여기서, 종방향 및 횡방향 필라멘트 다발 부재(122a~122f) 3차원 필터인 것은 복수의 필라멘트(1221, 1222)가 케이스의 내부공간을 차지하는 형태로 케이스의 내부공간에 배열되기 때문이다. 다른 실시예에서, 제1 홀더부(123c)는 종방향 필라멘트 다발 부재(122a, 122c, 122e)를 고정시켜 상기 종방향 필라멘트 다발 부재(122a, 122c, 122e)가 케이스의 내부공산상에 배열되도록 한다. 또한, 제2 홀더부(123d)는 횡방향 필라멘트 다발 부재(122b, 122d, 122f)를 고정시켜 상기 횡방향 필라멘트 다 발 부재(122b, 122d, 122f)가 케이스의 내부공산상에 배열되도록 한다. 다른 실시예에서, 제1, 2 홀더부(123c, 123d)는 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)를 이루는 복 수의 필라멘트(1221, 1222)의 일측과 결합 및 각각의 삽입홈(121e)에 양단이 삽입되도록 복수개로 구비되는 것 이 바람직하며, 슬라이딩 방식을 기반으로 삽입홈(121e)에 양단이 삽입됨으로써 케이스에 배치되거나 케이 스로부터 분리될 수 있다. 도 16은 일측 프레임 커버 및 타측 프레임 커버가 설치된 먼지 포집 모듈의 사시도이다. 도 16을 참조하면, 먼지 포집 모듈(120c)은 일측 프레임 커버와 타측 프레임 커버가 설치될 수 있다. 일측 프레임 커버는 도 16에 도시된 바와 같이 제1 개구부(121a)를 형성하는 케이스의 측면부 일단에 결합되며, 타측 프레임 커버는 제2 개구부(121b)를 형성하는 케이스의 측면부 타단에 결합될 수 있다. 일측 및 타측 프레임 커버(127, 128)는 케이스의 측면부와 결합됨으로써, 복수의 필라멘트 다발 부재(12 2)의 설치 위치의 미관을 해치지 않도록 함과 동시에 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)를 보호 할 수 있다. 도 17은 본 발명의 다른 실시예에 따른 필라멘트 다발 부재의 공기통과유량을 개략적으로 도시한 도면이다. 도 17을 참조하면, 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)는 복수의 필라멘트(1221, 1222)가 제1, 2 홀더부(123c, 123d)와 결합된 일측으로부터 제1, 2 홀더부(123c, 123d)로부터 멀어지는 타측으로 갈수록 사이의 간격이 벌어지는 부채꼴의 형태로 배열될 수 있다. 다른 실시예에서, 복수의 제1 필라멘트와 제2 필라멘트는 길이(L_F)가 동일할 수 있으며, 일 예로 는 90 mm 내지 100 mm일 수 있다. 또한, 복수의 제1 필라멘트와 제2 필라멘트는 타측(말단)의 폭(T_F)이 동일할 수 있으며, 일 예로 는 25 mm 내지 40 mm일 수 있다. 그리고 제1, 2 홀더부(123c, 123d)의 폭(T_S)은 일 예로 3 mm 내지 5 mm일 수 있다. 이때, 제1, 2 홀더부(123c, 123d)의 폭(T_S)에 대한 타측(말단)의 복수의 제1 필라멘트와 제2 필라멘트 의 타측 폭(T_F)의 비는, 즉 T_F / T_S는 7 내지 8일 수 있다. 또한, 복수의 제1 필라멘트와 제2 필라멘트의 타측 폭(T_F)에 대한 복수의 제1 필라멘트와 제2 필라멘트의 길이(L_F)의 비는, L_F / T_F는 2.5 내지 4일 수 있다. 이러한 비율은 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)의 미세먼지(D) 포집 효율을 최적화할 수 있는 비율일 수 있으나 이를 한정하는 것은 아니며, 상술한 일 실시예의 먼지 포집 모듈(120, 120a, 120b)에 구비된 필라멘트 다발 부재에도 동일하게 적용될 수 있다. 한편, 복수의 필라멘트(1221, 1222)의 각 영역별 공기통과유량에 대해서는 도 17에 도시된 바와 같이 복수의 제 1 필라멘트를 기준으로 하여 설명하도록 하겠다. 도 17을 참조하면, 복수의 제1 필라멘트는 제1 홀더부(123a)에 결합된 일측으로부터 폭(T_F)이 가장 넓은 타측까지의 각 영역마다 공기통과유량이 달라질 수 있다. 즉, x축의 다공성(porosity)을 0(block) 내지 1(ope n)이라고 할 때, 복수의 제1 필라멘트는 제1 홀더부(123a)로부터 멀어지는 타측으로 갈수록 다공성이 늘 어나게 됨에 따라 공기통과유량이 증가하게 된다. 그리고 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)는 케이스의 내부공간상에 복수의 필라멘트(1221, 1222)가 종방향 및 횡방향으로 교차되도록 하기 때문에 케이스의 내부공간에 복잡한 유로를 생성함으로써, 미세먼지(D)를 포집하는 효과가 극대화될 수 있다. 다른 실시예에서, 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)에 구비된 복수의 필라멘트(1221, 1222)는 직경이 0.25 내지 0.5 mm, 바람직하게는 0.3 mm인 매크로 섬유로 구성될 수 있다. 또한, 복수의 필라멘트(1221, 1222)는 매크로 섬유와 마이크로 섬유가 혼용되어 두 섬유의 장점을 모두 갖도록 설계될 수 있다. 구체적인 일예로, 복수의 제1 필라멘트는 매크로 섬유로 설계됨과 동시에 복수의 제2 필라멘트는 마이크로 섬유로 설계되고, 매크로 섬유와 마이크로 섬유의 비율은 0.5:1 내지 3:1이 될 수 있다. 그리고 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)는 대전 정전기를 이용하여 미세먼지(D)를 포집하기 위 해 복수의 필라멘트(1221, 1222)가 대전 서열의 차이가 큰 적어도 두 개의 상이한 재질의 섬유 조합으로 이루어 질 수 있다.구체적인 일예로, 복수의 제1 필라멘트는 양극(+) 대전체용 섬유와 음극(-) 대전체용 섬유의 조합으로 이 루어질 수 있으며, 양극(+) 대전체용 섬유는 나일론 및 레이온 중 적어도 하나 또는 나일론 및 레이온의 조합일 수 있고, 음극(-) 대전체용 섬유는 테프론, 폴리염화비닐, 셀로판, 셀룰로이드, 폴리에틸렌, 아크릴, 폴리에스 텔 중 적어도 하나 또는 2종 이상의 조합일 수 있다. 다른 실시예에서, 복수의 필라멘트(1221, 1222)는 직선모 또는 컬링을 갖는 파선 형태로 제조될 수 있으며, 파 선 형태인 경우에는 각 필라멘트(1221, 1222)의 사이에 미세먼지(D)를 포집하는 능력이 향상되어 미세먼지(D)가 송풍팬으로 유입되는 양을 감소시킬 수 있을 뿐만 아니라, 각 필라멘트(1221, 1222)가 케이스의 내부 공간으로 유입되는 공기에 의해 미세하게 변위되면서 대전 정전기를 발생시켜 미세먼지(D)를 포집하는 효율이 극대화될 수 있다. 다른 실시예에서, 제1, 2 홀더부(123c, 123d)는 도면에 미도시되었으나 미세먼지(D)가 포함된 공기를 통해 유동 이 발생되는 복수의 필라멘트(1221, 1222)와의 마찰에 따라 대전 정전기를 발생시키는 일 실시예에서 상술한 커 버가 외측면에 결합될 수 있다. 도 18 및 도 19는 본 발명의 다른 실시예에 따른 필라멘트 다발 부재의 배치 구조를 설명하기 위한 도면이다. 도 18 및 도 19를 참조하면, 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)는 적어도 4개 바람직하게는 6개 의 필라멘트 다발 부재를 포함할 수 있다. 구체적인 일 예로, 제1 필라멘트 다발 부재(122a)는 케이스 내부공간의 상측 영역을 커버하고, 제2 필라멘 트 다발 부재(122b)는 상기 제1 필라멘트 다발 부재(122a)의 후단에 설치되어 케이스 내부공간의 좌측 영 역을 커버하고, 제3 필라멘트 다발 부재(122c)는 상기 제2 필라멘트 다발 부재(122b)의 후단에 설치되어 케이스 내부공간의 하측 영역을 커버하며, 제4 필라멘트 다발 부재(122d)는 상기 제3 필라멘트 다발 부재(122c) 의 후단에 설치되어 케이스 내부공간의 우측 영역을 커버할 수 있다. 또한, 설계에 따른 필요 시, 제5 필 라멘트 다발 부재(122e)는 제상기 제4 필라멘트 다발 부재(122d)의 후단에 설치되어 케이스 내부공간의 상 측 영역을 커버할 수 있고, 제6 필라멘트 다발 부재(122f)는 상기 제5 필라멘트 다발 부재(122e)의 후단에 설치 되어 케이스 내부공간의 좌측 영역을 커버할 수 있다. 더 나아가, 추가적인 필라멘트 다발 부재가 케이스 의 내부공간에 더 설치될 수 있으며, 이때 더 설치되는 필라멘트 다발 부재의 개수는 한정하지 아니한다. 도 19를 참조하면, 케이스는 제1 홀더부(123c)와 제2 홀더부(123d)의 양단이 삽입될 삽입홈(121e)이 측면 부의 너비면에 복수로 형성될 수 있다. 다른 실시예에서, 삽입홈(121e)은 종방향 및 횡방향 필라멘트 다발 부재(122a~122f)의 틸팅 각도와 동일한 틸팅 각도를 갖도록 일측에서 타측으로 갈수록 폭이 넓어지는 형태로 형성되는 것이 바람직하다. 또한, 케이스는 도면에는 미도시되었으나, 각각의 삽입홈(121e)에는 홀더부의 양단을 고정시키는 고 정 구조가 형성되어 복수의 제1, 2 홀더부(123a, 123d)를 각각 고정시킬 수도 있다. 도 20은 본 발명의 다른 실시예에 따른 먼지 포집 모듈의 제1 변형예를 도시한 도면이다. 도 20을 참조하면, 먼지 포집 모듈(120c)의 제1 변형예인 변형 먼지 포집 모듈(120d)은 도 15에 도시된 케이스 보다 크기가 축소되는 복수의 케이스가 탈부착을 통해 직육면체 내지는 사각 기둥 형상을 가지는 형 태로 배치되는 케이스 모듈이 구비될 수 있다. 케이스 모듈은 다양한 본체의 내부공간 규격에 맞춰 먼지 포집 모듈(120d)을 터널 분진 저감장치 에 배치할 수 있으므로, 시공 용이성 면에서 장점을 갖는다. 이하에서는, 일 실시예의 먼지 포집 모듈을 기준으로 하여 터널 분진 저감장치의 나머지 구성요소에 대해 설명하도록 하겠다. 다시 도 3을 참조하면, 송풍팬은 본체의 내부공간상 먼지 포집 모듈과 토출부(111b)의 사이에 배치되고, 미세먼지(D)가 포함된 공기를 먼지 포집 모듈로 급기시키며, 제1 내부관을 통해 이송되는 미세먼지(D)가 제거된 공기를 토출부(111b)로 배출시킨다. 이때, 송풍팬에 의해 배출되는 미세먼지(D)가 제거된 공기는 제2 내부관을 통해 토출부(11b)로 이송 될 수 있다. 도 3을 참조하면, 차압센서는 본체의 내부공간상 먼지 포집 모듈과 송풍팬의 사이 이격공 간에 설치되어 필라멘트 다발 부재의 차압을 측정할 수 있다. 일 실시예에서, 차압센서는 측정한 필라멘트 다발 부재의 차압에 대한 정보를 터널 분진 저감장치 를 관리 및 필라멘트 다발 부재의 교체를 담당하는 관리자에게 제공할 수 있으며, 이를 위해 터널 분 진 저감 장치는 도 21에 도시된 바와 같이 교체시기 판단부가 구비될 수 있다. 도 21은 교체시기 판단부 및 필라멘트 다발 부재의 교체 시기를 판단하기 위한 방식을 설명하기 위한 블록도이 다. 도 21을 참조하면, 교체시기 판단부는 차압센서로부터 필라멘트 다발 부재의 차압에 대한 정보 를 전송받게 되면, 자동으로 필라멘트 다발 부재의 차압에 대한 정보를 이용하여 필라멘트 다발 부재(12 2)의 교체 시기를 결정하도록 학습된 인공지능 모델이 탑재될 수 있다. 이러한 교체시기 판단부는 결정한 필라멘트 다발 부재의 교체 시기를 관리자가 구비한 스마트폰, 태 블릿, PC 등의 단말에 전송할 수 있으며, 상기 단말은 교체시기 판단부로부터 필라멘트 다발 부 재의 교체 시기를 메시지 형태로 전송받게 되고, 관리자는 단말에 표시된 메시지를 기반으로 필라멘 트 다발 부재의 교체 시기를 판단하여 필라멘트 다발 부재의 교체를 수행할 수 있다. 상술한 바와 같이 개시된 본 발명의 바람직한 실시예들에 대한 상세한 설명은 당업자가 본 발명을 구현하고 실 시할 수 있도록 제공되었다. 상기에서는 본 발명의 바람직한 실시예들을 참조하여 설명하였지만, 해당 기술 분 야의 숙련된 당업자는 본 발명의 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시 킬 수 있음을 이해할 수 있을 것이다. 예를 들어, 당업자는 상술한 실시예들에 기재된 각 구성을 서로 조합하는 방식으로 이용할 수 있다. 따라서, 본 발명은 여기에 나타난 실시형태들에 제한되려는 것이 아니라, 여기서 개 시된 원리들 및 신규한 특징들과 일치하는 최광의 범위를 부여하려는 것이다. 본 발명은 본 발명의 기술적 사상 및 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니 되고 예시적인 것으로 고려되 어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내 에서의 모든 변경은 본 발명의 범위에 포함된다. 본 발명은 여기에 나타난 실시형태들에 제한되려는 것이 아니 라, 여기서 개시된 원리들 및 신규한 특징들과 일치하는 최광의 범위를 부여하려는 것이다. 또한, 특허청구범위 에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함할 수 있다."}
{"patent_id": "10-2023-0132595", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 부직포 프리필터를 도시한 도면이다. 도 2는 부직포 프리필터의 여과집진 방식을 설명하기 위한 도면이다. 도 3은 본 발명의 일 실시예에 따른 터널 분진 저감장치의 내부구조를 도시한 측면도이다. 도 4는 본 발명의 일 실시예에 따른 터널 분진 저감장치의 내부구조를 도시한 평면도이다. 도 5는 본 발명의 일 실시예에 따른 복수의 필라멘트 다발 부재의 배치 방식을 설명하기 위한 도면이다. 도 6은 도 5에 도시된 먼지 포집 모듈과 기존의 부직포 프리필터의 외기 누적 투입량 대비 차압의 상관 관계를 나타내는 실험 데이터이다. 도 7은 본 발명의 일 실시예에 따른 먼지 포집 모듈을 개략적으로 도시한 도면이다. 도 8은 본 발명의 일 실시예에 따른 먼지 포집 모듈의 분해도이다. 도 9는 본 발명의 일 실시예에 따른 먼지 포집 모듈의 사시도이다. 도 10은 변형된 케이스에 형성되는 끼움결합홈을 도시한 도면이다. 도 11은 본 발명의 일 실시예에 따른 먼지 포집 모듈의 제1 변형예를 도시한 도면이다. 도 12는 도 11의 a-a 단면을 도시한 도면이다. 도 13은 본 발명의 일 실시예에 따른 먼지 포집 모듈의 제2 변형예를 도시한 도면이다. 도 14는 도 13의 a-a 단면을 도시한 도면이다. 도 15는 본 발명의 다른 실시예에 따른 먼지 포집 모듈을 개략적으로 도시한 도면이다. 도 16은 일측 프레임 커버 및 타측 프레임 커버가 설치된 먼지 포집 모듈의 사시도이다. 도 17은 본 발명의 다른 실시예에 따른 필라멘트 다발 부재의 공기통과유량을 개략적으로 도시한 도면이다. 도 18 및 도 19는 본 발명의 다른 실시예에 따른 필라멘트 다발 부재의 배치 구조를 설명하기 위한 도면이다. 도 20은 본 발명의 다른 실시예에 따른 먼지 포집 모듈의 제1 변형예를 도시한 도면이다. 도 21은 교체시기 판단부 및 필라멘트 다발 부재의 교체 시기를 판단하기 위한 방식을 설명하기 위한 블록도이 다."}
