{"patent_id": "10-2021-0032066", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0002074", "출원번호": "10-2021-0032066", "발명의 명칭": "인공지능 더블모션 데스크", "출원인": "(주)솔비앤솔비니", "발명자": "김종호"}}
{"patent_id": "10-2021-0032066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 더블모션 데스크에 있어서,제1상판, 및 상기 제1상판을 바닥으로부터 지지하며, 상기 제1상판의 높이를 조절할 수 있는 제1구동부가 포함된 제1지지부를 포함하는 제1데스크;상기 제1상판과 동일 평면 상인 경우 전면측이 상기 제1상판의 후면측과 소정 거리 이내로 근접하게 위치하며,상기 제1상판과 동일 평면 상 또는 상기 동일 평면으로부터 소정의 높이만큼 높은 제1위치부터 상기 제1위치 보다 높거나 낮은 제2위치까지 높이 조절이 가능한 제2상판, 및 상기 제2상판의 높이를 조절할 수 있는 제2구동부가 포함된 제2지지부를 포함하는 제2데스크;상기 제1지지부 및 상기 제2지지부의 하단부를 연결하여 지면으로부터 지지하는 제3지지부;상기 제2데스크의 전면에 배치되는 측판;상기 인공지능 더블모션 데스크의 후면측에 소정의 높이를 가지도록 배치되는 가림판;상기 측판 소정의 위치에 형성되는 영상장치;상기 제1데스크의 전면 소정의 위치에 형성되며, 상기 제1구동부 및 상기 제2구동부를 각각 제어하여 상기 제1상판과 상기 제2상판의 높이를 각각 조절할 수 있는 높이 조절부;상기 제1데스크의 하부에 형성되어 사용자의 단말기를 거치할 수 있는 거치부;네트워크 연결이 가능한 통신부; 및상기 높이 조절부의 기능 또는 상기 사용자의 단말기의 기능을 포함하는 상기 인공지능 더블모션 데스크의 기능을 제어하는 제어부를 포함하며,상기 제어부는,상기 영상장치를 통해 사용자를 인식한 인식결과, 또는 사용자의 휴대 단말기에 설치된 애플리케이션 시스템으로부터 전송되는 인증결과에 기초하여 미리 등록된 등록 사용자인지 여부를 판단하여, 판단결과 등록 사용자인 경우 또는 상기 등록 사용자의 사용의도가 인식되는 경우, 상기 높이 조절부 또는 상기애플리케이션 시스템을 통한 높이 조절 및 상기 사용자의 단말기의 정상 동작이 가능하도록 제어하거나, 또는 상기 제1상판 또는 제2상판 중 적어도 하나의 높이를 자동으로 미리 정해진 높이-상기 미리 정해진 높이는 소정의 디폴트 높이 또는 인식된 등록 사용자에 상응하는 사용자별 높이를 포함-가 되도록 조절하는 것을 특징으로하며,상기 사용자의 단말기의 동작 중 상기 영상장치를 통해 등록되지 않은 사용자가 인식되는 경우, 상기 사용자의단말기의 적어도 일부 기능이 작동하지 않도록 제어하고,상기 영상장치 및 상기 통신부를 통해 적어도 하나의 다른 제2인공지능 더블모션 데스크 또는 적어도 하나의 다른 사용자의 단말기들과 화상회의 또는 영상통화가 가능하도록 제어하는 것을 특징으로 하는 인공지능 더블모션데스크."}
{"patent_id": "10-2021-0032066", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 더블모션 데스크가 개시된다. 본 발명의 실시 예에 따른 인공지능 더블모션 데스크는, 제1상판과 상기 제1상판을 바닥으로부터 지지하며, 상기 제1상판의 높이를 조절할 수 있는 제1구동부가 포함된 제1지지부를 포함 하는 제1데스크, 상기 제1상판과 동일 평면 상인 경우 상기 제1상판의 후면측과 소정 거리 이내로 근접하게 위치 (뒷면에 계속)"}
{"patent_id": "10-2021-0032066", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 더블모션 데스크에 관한 것으로, 보다 상세하게는 물리적으로 구분되는 제1데스크와 제2데 스크가 구비되고, 각 데스크의 상판들(예컨대, 제1상판 및 제2상판))을 작업 영역과 받침대 영역(예컨대, 모니터 받침대)과 같이 필요에 따른 영역으로 구분하여 사용 가능하면서, 제1상판 및 제2상판 각각의 높낮이를 사용 자가 원하는대로 조절 가능하도록 하여 사용자의 편의성을 향상시키면서, 미리 등록된 사용자만 책상의 높이를 조절할 수 있도록 하거나, 데스크와 연결된 사용자의 단말기를 정상적으로 구동할 수 있도록 함으로써 보안성을 향상시킬 수 있는 기술적 사상에 관한 것이다."}
{"patent_id": "10-2021-0032066", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 사용하는 데스크(책상)은 대부분 처음 설치시 높이가 고정되어 있으며, 대다수의 사용자들이 데스크 와 함께 사용하는 의자의 높낮이만을 조절하여 데스크를 이용하게 되어 사용자별로 눈높이나 신체조건에 적합하 도록 데스크를 사용하기에는 어려움이 따르고 있다. 특히 학생이나 사무직 직장인의 경우 하루의 절반 이상을 공용장소인 학교나 사무실의 의자에 앉아 데스크 앞에 서 지내게 되는데, 통상적인 높이로 일괄적으로 배치되는 이러한 데스크의 높이를 개개인에 맞출 수 없어 불편 함을 야기함은 물론 신체적인 부작용과 이에 따른 질환이 증가하는 추세이다. 또한 업무는 물론이고 학생들의 공부에도 컴퓨터가 필수 물품이 되어 가고 있는데, 이때 데스크 위에는 모니터 가 올라가게 된다. 같은 종류의 데스크를 이용하더라도, 사용자 개개인의 신체 특성에 따라 누군가는 데스크가 낮아서 불편함을 느 끼거나, 누군가는 데스크가 높아서 불편함을 느낄 수 있다. 이는 마우스, 키보드, 또는 기타 필기구 등을 사용 하는 작업 영역의 높이가 불편할 수 있고, 데스크 위에 있는 모니터에 눈높이를 맞추기가 어려워 불편함을 느낄 수도 있다. 특히 모니터의 높이는 사용자의 자세를 결정하는 중요한 요인 중 하나가 될 수 있는데, 불편한 높이 에서 계속 작업을 하다보면 목/허리 디스크, 거북목증후군, 손목의 터널 증후군 등 각종 질환이 유발될 수 있어 데스크 자체의 높이는 물론 모니터의 높이를 사용자 눈높이에 적절하게 맞추는 것이 매우 중요할 수 있다. 일반적으로 사용자가 의자에 앉아 데스크를 바라보면, 통상의 모니터들의 높이가 살짝 낮은 편이어서 사용자의 자세가 불편해지는 일이 많다. 이를 위해 종래에는 모니터용 받침대를 별도로 구입하여 모니터의 높이를 눈높이 에 맞추게 되는데, 이러한 종래의 모니터용 받침대는 일괄적으로 정해진 하나의 높이로만 높이 조절이 될 뿐, 사용자 개인별 맞춤 높이 설정이 사실상 불가능한 실정이다. 한편 일부 기업 등에서는 의자를 없애고 서서 일하는 문화가 알려지고 있는데, 이러한 경우에도 사용자가 하루 종일 서서 업무를 처리하기 보다는 서있는 상태와 앉은 상태를 오가며 업무를 처리하는 경우가 많다. 이러한 경 우, 사용자의 자세 즉, 서 있는 자세와 의자에 앉는 자세에서 각각 사용자의 눈높이 등 신체조건이 변화하게 되 는데, 이때마다 일일이 데스크의 높이를 조절하는 것은 대단히 어렵고 번거로운 일이 될 수 있다. 따라서 사용자 개개인에 적합한 데스크 자체의 높이 조절은 물론, 데스크 상의 모니터의 높이를 별도로 조절 가 능하게 함으로써 보다 사용자에게 개인화되고 최적화된 데스크의 높이를 조절할 수 있도록 하는 기술적 사상이 요구된다. 또한, 미리 등록된 사용자가 아니면 데스크의 높이를 조절할 수 없도록 하거나, 데스크와 연결된 사용자의 단말 기(예컨대, 컴퓨터 등) 기능을 제한함으로써 사용자의 개인 맞춤 설정이 임의로 변경되거나 보안에 민감한 작업 내용이 노출되지 않도록 하는 기술적 사상이 요구된다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허(공개번호 10-2020-0000703, \"기립 및 좌식 겸용 높이 조절 책상\")"}
{"patent_id": "10-2021-0032066", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적인 과제는, 물리적으로 구분되는 제1데스크와 제2데스크를 가 구비되고, 각 데스크의 상판들(예컨대, 제1상판 및 제2상판))을 작업 영역과 받침대 영역(예컨대, 모니터 받침대)과 같이 필 요에 따른 영역으로 구분하여 사용 가능하면서, 제1상판 및 제2상판 각각의 높낮이를 사용자가 원하는대로 조절가능하도록 하는 기술적 사상을 제공하는 것이다. 또한, 미리 등록된 사용자만 책상의 높이를 조절할 수 있도록 하거나, 연결된 사용자의 단말기를 정상적으로 구 동할 수 있도록 함으로써 보안성을 향상시킬 수 있는 기술적 사상을 제공하는 것이다."}
{"patent_id": "10-2021-0032066", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적인 과제를 해결하기 위한 본 발명의 실시 예에 따른 인공지능 더블모션 데스크는, 제1상판, 및 상기 제1상판을 바닥으로부터 지지하며, 상기 제1상판의 높이를 조절할 수 있는 제1구동부가 포함된 제1지지부를 포 함하는 제1데스크, 상기 제1상판과 동일 평면 상인 경우 상기 제1상판의 후면측과 소정 거리 이내로 근접하게 위치하며, 상기 제1상판과 동일 평면 상 또는 상기 동일 평면으로부터 소정의 높이만큼 높은 제1위치부터 상기 제1위치 보다 높거나 낮은 제2위치까지 높이 조절이 가능한 제2상판 및 상기 제2상판의 높이를 조절할 수 있는 제2구동부가 포함된 제2지지부를 포함하는 제2데스크, 상기 제1지지부 및 상기 제2지지부의 하단부를 연결하여 지면으로부터 지지하는 제3지지부, 상기 제2데스크의 전면에 배치되는 측판, 상기 인공지능 더블모션 데스크의 후면측에 소정의 높이를 가지도록 배치되는 가림판, 상기 측판 소정의 위치에 형성되는 영상장치, 상기 제1데스 크의 전면 소정의 위치에 형성되며, 상기 제1구동부 및 상기 제2구동부를 각각 제어하여 상기 제1상판과 상기 제2상판의 높이를 각각 조절할 수 있는 높이 조절부, 상기 제1데스크의 하부에 형성되어 사용자의 단말기를 거 치할 수 있는 거치부, 네트워크 연결이 가능한 통신부, 및 상기 높이 조절부의 기능 또는 상기 사용자의 단말기 의 기능을 포함하는 상기 인공지능 더블모션 데스크의 기능을 제어하는 제어부를 포함하며, 상기 제어부는, 상 기 영상장치를 통해 사용자를 인식한 인식결과, 또는 사용자의 휴대 단말기에 설치된 애플리케이션 시스템으로 부터 전송되는 인증결과에 기초하여 미리 등록된 등록 사용자인지 여부를 판단하여, 판단결과 등록 사용자인 경 우 또는 상기 등록 사용자의 사용의도가 인식되는 경우, 상기 높이 조절부 또는 상기 애플리케이션 시스템을 통 한 높이 조절 및 상기 사용자의 단말기의 정상 동작이 가능하도록 제어하거나, 또는 상기 제1상판 또는 제2상판 중 적어도 하나의 높이를 자동으로 미리 정해진 높이-상기 미리 정해진 높이는 소정의 디폴트 높이 또는 인식된 등록 사용자에 상응하는 사용자별 높이를 포함-가 되도록 조절하는 것을 특징으로 하며, 상기 사용자의 단말기 의 동작 중 상기 영상장치를 통해 등록되지 않은 사용자가 인식되는 경우, 상기 사용자의 단말기의 적어도 일부 기능이 작동하지 않도록 제어하고, 상기 영상장치 및 상기 통신부를 통해 적어도 하나의 다른 제2인공지능 더블 모션 데스크 또는 적어도 하나의 다른 사용자의 단말기들과 화상회의 또는 영상통화가 가능하도록 제어하는 것 을 특징으로 할 수 이TEk."}
{"patent_id": "10-2021-0032066", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 기술적 사상에 의하면, 물리적으로 구분되는 제1데스크와 제2데스크를 가 구비되고, 각 데스크의 상 판들(예컨대, 제1상판 및 제2상판))을 작업 영역과 받침대 영역(예컨대, 모니터 받침대)과 같이 필요에 따른 영 역으로 구분하여 사용 가능하면서, 제1상판 및 제2상판 각각의 높낮이를 사용자가 원하는대로 조절 가능하므로 데스크에서 작업하는 사용자 개개인에 최적화하기 용이한 효과가 있다. 또한, 미리 등록된 사용자만 책상의 높이를 조절할 수 있도록 하거나, 연결된 사용자의 단말기를 정상적으로 구 동할 수 있도록 함으로써 보안성을 향상시킬 수 있는 효과가 있다."}
{"patent_id": "10-2021-0032066", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명과 본 발명의 동작상의 이점 및 본 발명의 실시에 의하여 달성되는 목적을 충분히 이해하기 위해서는 본 발명의 바람직한 실시 예를 예시하는 첨부도면 및 첨부도면에 기재된 내용을 참조하여야만 한다. 본 명세서에서 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상 기 용어들에 의해 한정되어서는 안된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적 으로 사용될 수 있다. 또한 본 명세서에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 또한 본 명세서에 있어서, '포함하다' 또는 '가지다' 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하, 첨부된 도면들을 참조하여 본 발명의 실시 예들을 중심으로 본 발명을 상세히 설명한다. 각 도면에 제시 된 동일한 참조부호는 동일한 부재를 나타낸다. 도 1은 본 발명의 실시 예에 따른 인공지능 더블모션 데스크의 구성을 나타내며, 도 2는 본 발명의 실시 예에 따른 인공지능 더블모션 데스크의 거치부의 구현 예를 나타내고, 도 3은 본 발명의 실시 예에 따른 인공지능 더 블모션 데스크와 사용자의 휴대 단말기 간의 연결을 나타낸다. 도 1을 참조하면, 본 발명의 실시 예에 따른 인공지능 더블모션 데스크는 제1상판, 상기 제1상판 을 지지하며, 상기 제1상판의 높이를 조절할 수 있는 제1구동부(미도시)가 포함된 제1지지부를 포함 하는 제1데스크, 상기 제1데스크의 제1상판과 동일 평면 상인 경우, 전면측이 상기 제1상판 의 후면측과 소정 거리 이내로 근접하게 위치하며, 상기 제1상판과 동일 평면 상 또는 상기 동일 평 면으로부터 소정의 높이만큼 높은 제1위치부터 상기 제1위치 보다 높거나 낮은 제2위치까지 높이 조절이 가능한 제2상판과, 상기 제2상판의 높이를 조절할 수 있는 제2구동부(미도시)가 포함된 제2지지부를 포 함하는 제2데스크를 포함할 수 있다. 본 발명의 기술적 사상에 의하면, 상기 제1데스크 및 상기 제2데스크는 각각 통상의 데스크 상에서 일반 업무를 수행할 수 있는 작업 영역과, 모니터 등 소정의 장치를 올려 둘 수 있는 받침대 영역으로 구분될 수 있 다. 이하, 본 명세서에서는 상기 받침대 영역 즉, 상기 제2데스크에 모니터와 같은 디스플레이 장치가 위 치하고, 후술할 본 발명의 구성에 따라 상기 제2상판의 높이가 조절되며 상기 디스플레이 장치와 사용자의 눈높이를 맞추는 경우를 예로 들어 설명하지만 본 발명이 반드시 이에 한정되는 것은 아니다. 예를 들어, 상기 제2데스크는 모니터 등과 같은 디스플레이 장치뿐 아니라, 작업 영역으로 구분될 수 있는 상기 제1데스크 와 영역/높이 등의 구분이 필요한 경우에 사용자의 눈높이를 맞출 필요가 있으면 어떠한 종류의 물체가 위 치해도 무방할 수 있다. 또한 본 발명의 기술적 사상에 의하면, 받침대 영역인 상기 제2데스크는 종래와 같이 상기 제1데스크(10 0)의 제1상판 상에 위치한 제2상판의 높이가 조절되는 것이 아니라, 제1데스크와는 별도의 데스 크로 이루어지는 특징을 가질 수 있다. 이는 상기 제1데스크 및 상기 제2데스크 각각의 높이 조절이 명확하게 구분될 수 있을 뿐 아니라, 필요에 따라 일반적으로 받침대 영역인 상기 제2데스크의 높이가 작 업 영역인 제1데스크에 비해 낮은 높이가 되도록 높이를 조절하는 것도 가능하게 되어 활용 범위가 보다 넓어질 수 있는 효과를 가질 수 있다. 예를 들어, 사용자는 필요에 따라 용이하게 제2상판에 놓인 물품(예 컨대, 모니터 등)이 자신의 시야에 들어오지 않도록 할 수도 있고, 사용자가 데스크 상판의 후면측에 거치하고 싶지만 크기나 높이가 커서 데스크 상판 위에 놓기 어려운 물품도 데스크 사용(즉, 제1상판 사용)에 방해 되지 않도록 거치할 수도 있게 되어 종래의 일반적인 데스크에 비해 본 발명의 실시 예에 따른 인공지능 더블모 션 데스크의 활용범위가 크게 증가할 수 있다. 이하 본 명세서에서, 설명의 편의를 위해 상기 제2데스크는 상기 제1데스크의 후면측에 위치하는 경 우를 예로 들어 설명하지만 반드시 이에 한정되지는 않는다. 본 명세서에서 상기 제1데스크 및 상기 제2데스크 와 같은 용어는 단순히 각각의 상판과 지지부를 가지는 데스크들을 구분하기 위한 용도로 사용될 수 있으며, 구 현 예에 따라 상대적으로 전면에 위치하는 데스크가 제2데스크, 후면측에 위치하는 데스크가 제1데스크 가 될 수 있음은 물론이다.또한 상기 제1상판 및 상기 제2상판은 각각 동일 평면 상에 위치하는 경우(즉, 상기 제1상판 및 상기 제2상판의 높이가 소정의 오차범위 내에서 동일한 경우), 상기 제1상판의 후면측과 상기 제2상 판의 전면측은 일정 거리 이내로 근접하도록 구현될 수 있다. 구현 예에 따라, 상기 제1상판 및 상기 제2상판은 동일 평면 상에서 각각의 후면측과 전면측이 밀착될 수 있도록 구현될 수도 있다. 이는 상기 제 1상판 및 상기 제2상판이 동일 평면 상에 위치하는 경우 상기 제1상판 및 상기 제2상판을 합친 전체 인공지능 더블모션 데스크의 표면에 홈이나 요철이 가급적 발생하지 않도록 하여 사용자의 편의를 향상시키기 위함일 수 있다. 또한 상기 인공지능 더블모션 데스크는 상기 제1구동부(미도시) 및 상기 제2구동부(미도시)를 각각 제어하여 상기 제1상판 및 상기 제2상판의 높이를 각각 조절할 수 있는 높이 조절부, 및/또는 소정의 영 상장치를 통해 사용자를 인식하고, 인식결과에 기초하여 상기 높이 조절부의 기능을 제어할 수 있는 제어부(미도시)를 더 포함할 수 있다. 구현 예에 따라, 상기 제어부(미도시)는 사용자의 단말기(예컨대, 컴퓨터 등), 및/또는 도 3에 도시된 바와 같이 사용자의 휴대 단말기(예컨대, 스마트 폰, 태블릿 PC 등)와 연결되어, 본 발명의 기술적 사상을 구현하기 위한 동작들을 수행할 수도 있다. 이에 대해서는 후술하도록 한다. 한편 상기 높이 조절부는 도면에 도시된 바와 같이 상기 인공지능 더블모션 데스크의 전면부 소정 위치 에 형성될 수 있으며, 상기 제1구동부(미도시) 및/또는 상기 제2구동부(미도시)의 동작을 각각 조절할 수 있는 별도의 스위치들(예컨대, 410, 420)을 포함할 수 있다. 사용자는 상기 스위치들(예컨대, 410, 420)을 각각 조작 함으로써 상기 제1데스크 및 상기 제2데스크의 높이를 필요에 따라 조절할 수 있다. 구현 예에 따라 서는 상기 제1데스크 및 상기 제2데스크의 높이는 상기 제어부(미도시)에 의해 자동으로 조절될 수도 있다. 이에 대해서는 후술하도록 한다. 또한 구현 예에 따라, 상기 높이 조절부는 상기 제1데스크 및 상기 제2데스크의 높이를 각각 조 절하는 상기 스위치들(예컨대, 410, 420) 외에, 상기 제1데스크 및 상기 제2데스크의 높이를 동시에 조절하기 위한 동시 조절 스위치(미도시)를 더 포함하고 있을 수 있다. 상기 동시 조절 스위치(미도시)는 다양한 형태로 구현될 수 있다. 예를 들어, 상기 동시 조절 스위치(미도시)는 상기 높이 조절부에서 상기 스위치들(예컨대, 410, 420)과 별개의 다른 스위치로 구현될 수 있다. 또는 상 기 동시 조절 스위치(미도시)는 사용자가 조작하는 경우 상기 스위치들(예컨대, 410, 420)이 동시에 작동할 수 있도록, 상기 스위치들(예컨대, 410, 420)을 필요에 따라 물리적으로 연결하는 형태로 구현될 수도 있다. 이러한 동시 조절 스위치(미도시)의 작동은 반드시 상기 제1데스크와 상기 제2데스크의 높이가 동일, 예컨대 상기 제1상판 및 상기 제2상판의 높이가 동일 평면 상에 위치할 필요는 없다. 상기 제1상판 및 상기 제2상판이 동일 평면 상에 위치하는 경우는 물론, 상기 제1상판 및 상기 제2상판의 높이가 각각 다른 경우에서도 상기 동시 조절 스위치(미도시)의 구동이 가능할 수 있다. 예를 들어, 상기 제1상판이 소정의 제1높이에 위치하고, 상기 제2상판이 상기 제1높이에 비해 높은 제2높 이에 위치하는 경우, 상기 동시 조절 스위치(미도시)가 구동되면 상기 제1높이와 상기 제2높이 사이 간격을 유 지한 채 상기 제1상판 및 상기 제2상판의 높이가 동시에 조절될 수 있다. 상기 제어부(미도시)는, 상기 영상장치를 통해 사용자를 인식한 인식결과에 따라 상기 높이 조절부를 통한 높이 조절 여부를 결정할 수 있다. 일 실시 예에 의하면, 상기 제어부(미도시)는 상기 영상장치를 통해 인식된 사용자가 미리 등록된 등록 사 용자인 경우, 상기 높이 조절부를 통한 높이 조절이 가능하도록 제어할 수 있다. 반대로, 상기 제어부(미 도시)는 인식결과 미리 등록된 등록 사용자가 아닌 경우에는, 상기 높이 조절부를 통한 높이 조절이 불가 능하도록 할 수 있다. 소정의 영상장치(예컨대, 카메라 등)에 의해 촬영되는 영상정보로부터 사람의 얼굴 등과 같은 소정의 오브젝트 를 추출하고 감지하는 기술적 사상에 대해서는 널리 알려져 있으므로, 본 명세서에서 상세한 설명은 생략하도록 한다. 상기 영상장치는 영상이나 사진을 촬영할 수 있는 카메라로 구현될 수 있다. 바람직하게는, 상기 영상장치 는 상기 제어부(미도시), 사용자의 휴대 단말기나 상기 인공지능 더블모션 데스크에 사용자가 두고 사 용하는 PC, 노트북 등과 같은 사용자의 단말기와 유선 또는 무선으로 연결될 수 있다. 따라서, 상기 영상 장치를 통해 촬영되는 촬영정보가 상기 제어부(미도시)나 사용자의 휴대 단말기에 설치된 소정의 애플리케이션 시스템, 사용자의 단말기 및/또는 소정의 외부 시스템으로 전송되어 촬영정보에 대한 분석이 이루어지거나, 촬영정보를 이용하여 다른 제2인공지능 더블모션 데스크 또는 다른 사용자의 사용자의 단말기/휴 대 단말기를 통해 다자간 화상회의나 영상통화가 수행될 수도 있다. 이를 위해, 상기 인공지능 더블모션 데스크는 네트워크 연결이 가능한 통신부(미도시)를 더 포함하고 있을 수 있다. 또한 구현 예에 따라, 상기 제어부(미도시)는 상기 높이 조절부를 통한 높이 조절 여부뿐 아니라, 상기 제 1구동부(미도시) 및/또는 상기 제2구동부(미도시)의 동작을 직접 제어하여, 사용자가 상기 높이 조절부를 조작하지 않더라도 상기 제1상판 및/또는 상기 제2상판의 높이를 자동으로 조절할 수도 있다. 예를 들어, 상기 제어부(미도시)는 전술한 바와 같이 상기 영상장치를 통해 인식된 사용자가 등록 사용자 인 경우, 상기 제1상판 및/또는 상기 제2상판의 높이를 미리 정해진 높이가 되도록 자동으로 조절할 수도 있다. 상기 미리 정해진 높이는 미리 지정된 소정의 디폴트 높이일수도 있고, 또는 인식된 등록 사용자에 상응하는 사용자별 높이일 수도 있다. 후자의 경우, 상기 제어부(미도시)는 등록된 등록 사용자별로 정해진 상 기 제1상판 및/또는 상기 제2상판의 높이를 미리 저장하고 있을 수 있다. 구현 예에 따라서는, 디폴트 높이로 상기 제2상판이 상승하고, 후술할 측판에 설치된 영상장치 를 통해 사용자의 현재 눈높이를 추출한 후, 상기 제어부(미도시)가 추출된 눈높이에 따라 일반적으로 가장 적 합한 각 상판들의 높이를 산출하여 각 상판들의 높이를 조절할 수도 있다. 일 실시 예에 의하면, 상기 제어부(미도시)는 사용자의 사용의도를 인식할 수 있다. 예컨대 상기 제어부(미도시)는 상기 영상장치를 통해 촬영되는 사용자가 일정 시간 이상 상기 인공지능 더블모션 데스 크 앞에 머물러 있는 경우, 상기 사용자가 인공지능 더블모션 데스크를 사용할 의도가 있다고 인식할 수 있다. 구현 예에 따라서는, 상기 제어부(미도시)가 사용자가 인공지능 더블모션 데스크 앞에 머물러 있는지 여부를 판단하는 것은 상기 영상장치가 아니라 별도의 센서(예컨대, 인체 감지 센서, 적외선 센서, 광 센서 등)를 통해 센싱된 센싱결과를 통해 수행될 수도 있다. 예컨대, 상기 센서에 의해 사용자가 일정 시간 이상 상기 인공지능 더블모션 데스크 앞에 있음이 감지되는 경우, 사용자가 인공지능 더블모션 데스크를 사용하려는 의도가 있음을 인식할 수도 있다. 또는 상기 제어부(미도시)가 상기 영상장치를 통해 촬영되는 촬영정보를 통해, 사용자가 인공지능 더블모 션 데스크 정면을 일정 시간 이상 바라보면서 머물러 있는 경우 사용의도가 있다고 인식할 수도 있다. 이처럼 상기 제어부(미도시)가 사용자의 사용의도를 인식하는 경우에는, 사용자가 인공지능 더블모션 데스크 를 사용할 의도 없이 단순히 인공지능 더블모션 데스크 인근에 있는 경우에도 상기 인공지능 더블모션 데 스크가 작동하는 것을 방지하여 불필요한 에너지 소모를 방지할 수 있는 효과를 가질 수 있다. 한편 전술한 바와 같이, 상기 제어부(미도시)는 사용자의 단말기 및/또는 사용자의 휴대 단말기와 연 결될 수 있다. 상기 제어부(미도시)가 상기 사용자의 단말기와 연결되는 경우, 상기 제어부(미도시)는 상기 영상장치 를 통해 등록 사용자가 인식되는 경우 상기 높이 조절부를 통한 높이 조절 외에도, 상기 사용자의 단 말기의 정상 동작이 가능하도록 제어할 수도 있다. 예컨대, 상기 인공지능 더블모션 데스크에 컴퓨터를 놓고 사용하는 경우, 해당 컴퓨터는 등록 사용자가 인식되지 않는 경우 구동되지 않거나, 또는 모니터 등의 디 스플레이 장치에 화면이 디스플레이되지 않도록 구현될 수 있다. 실시 예에 따라, 등록 사용자가 인식되어 상기 사용자의 단말기가 정상 작동하는 중에도, 상기 영상장치 를 통해 등록 사용자가 아닌 다른 사용자가 인식되는 경우, 상기 제어부(미도시)는 상기 사용자의 단말기 의 적어도 일부 기능이 작동하지 않도록(예컨대, 모니터에 화면이 디스플레이되지 않도록) 구현될 수도 있 다. 이러한 경우, 보안이 중요한 작업을 수행하는데 인가되지 않은 인원이 작업 내용을 볼 수 없도록 하여 보안 을 한층 강화할 수 있는 효과를 가질 수 있다. 상기 사용자의 단말기는 도 3에 도시된 바와 같이 상기 인공지능 더블모션 데스크에 구비되는 거치부 에 의해 거치될 수 있다. 상기 제어부(미도시)가 사용자의 휴대 단말기와 연결되는 경우에는, 상기 제어부(미도시)는 상기 휴대 단 말기에 설치된 애플리케이션 시스템을 통해 등록 사용자인지 여부를 판단하거나, 상기 애플리케이션 시스 템을 통해 상기 제1상판 및/또는 상기 제2상판의 높이가 조절되도록 할 수도 있다. 상기 제어부(미도시)가 등록 사용자인지 여부를 판단하는 방식은 다양할 수 있는데, 예컨대 상기 제어부(미도시)는 전술한 바와 같이 상기 영상장치를 통해 촬영되는 사용자의 얼굴을 인식한 인식결과를 이용하여 사용자를 인식할 수 있다. 또는, 상기 영상장치를 통해 촬영되는 촬영정보로부터 사용자의 홍채 를 추출하고 홍채 인식을 통해 미리 등록된 사용자인지, 어떤 사용자인지 여부를 판별할 수도 있다. 또한 사용 자의 휴대 단말기(애플리케이션 시스템)와 연동되는 경우에는, 상기 애플리케이션 시스템을 통해 지문인식이나 사용자 정보 입력 등 기존에 존재하는 다양한 방식이 사용자 인증을 위해 사용될 수도 있으며, 이처럼 상기 애 플리케이션 시스템을 통해 인증된 인증결과를 상기 애플리케이션 시스템으로부터 수신하고, 수신된 인증결과를 이용하여 등록 사용자인지 여부를 판단할 수 있다. 실시 예에 따라, 상기 제어부(미도시)가 상기 애플리케이션 시스템으로부터 상기 제1구동부(미도시) 및/또는 상 기 제2구동부(미도시)의 제어를 위한 제어신호를 수신하고, 수신된 제어신호에 상응하도록 상기 제1구동부(미도 시) 및/또는 상기 제2구동부(미도시)를 제어함으로써 사용자가 자신의 휴대 단말기를 통해 상기 제1상판 및/또는 상기 제2상판의 높이를 조절할 수 있도록 구현될 수도 있다. 한편 본 발명의 기술적 사상에 의하면, 상기 제어부(미도시)는 상기 영상장치를 통한 사용자의 인식 및/또 는 인식된 사용자가 등록 사용자인지 여부를 판단하는 과정을 학습하며 보다 정밀하고 정확한 인식 및/또는 판 단이 가능하도록 구현될 수도 있다. 이러한 경우 상기 제어부(미도시)는 학습을 위해 필요한 리소스와 알고리즘 을 구비하고 있을 수 있다. 이처럼 인공지능을 이용한 머신러닝에 대한 기술적 사상은 널리 알려져 있으므로, 본 명세서에서 상세한 설명은 생략하도록 한다. 한편 구현 예에 따라서는, 상기 제1상판 및/또는 상기 제2상판에는 사용자의 편의를 위한 편의장치가 설치되어 있을 수도 있다. 예를 들어, 상기 제1상판 및/또는 상기 제2상판 상의 소정의 위치에 사용자의 휴대 단말기를 충전할 수 있는 무선 충전 패널이 설치되어 있을 수 있다. 물론, 무선 충전 패널뿐 아니라 전원 플러그를 이용할 수 있 는 콘센트나, USB단자 등 사용자의 편의를 위한 각종 편의장치가 다양하게 설치될 수도 있다. 한편, 상기 인공지능 더블모션 데스크는 상기 제2데스크의 전면에 배치되는 측판, 및/또는 상기 인공지능 더블모션 데스크의 후면측에 소정의 높이를 가지도록 배치되는 가림판을 더 포함할 수 있다. 상기 측판이 형성된 경우, 상기 영상장치는 상기 측판에서 상기 인공지능 더블모션 데스크의 전면 방향을 촬영할 수 있도록 형성될 수 있다. 또한 상기 측판은 상기 제2데스크의 제2상판 높 이가 상기 제1데스크의 제1상판의 높이에 비해 높아지도록 상승했을 때, 상기 제1상판의 후면측 에 빈 공간이 나타나 상기 제1상판 상에 놓인 물품들이 낙하하거나, 사용자의 시야가 상기 인공지능 더블 모션 데스크의 뒷쪽으로 분산되는 것을 방지하는 역할을 수행할 수도 있다. 상기 가림판 역시 상기 인공지능 더블모션 데스크를 이용하는 사용자의 시선 분산을 억제하면서, 다른 사람들이 데스크를 넘보는 것을 방지할 수 있다. 한편 도 4 및 도 5는 본 발명의 실시 예에 따른 인공지능 더블모션 데스크의 구동부를 설명하기 위한 도면이다. 도면을 참조하면, 본 발명의 실시 예에 따른 인공지능 더블모션 데스크의 지지부 즉, 제1지지부 및/또 는 제2지지부는 다단으로 구성될 수 있으며, 각 단들은 어느 일 측방향의 단 내로 삽입이 가능하도록 형성 되어, 상기 제1구동부(미도시) 및/또는 상기 제2구동부(미도시)의 구동에 의해 각 단이 삽입 또는 이탈되면서 소정의 제1범위 내에서 높이가 조절될 수 있다. 예를 들면, 상기 제1지지부는 도 4 및 도 5에 도시된 바와 같이, 하측 단의 적어도 일부가 상측 단 내로 삽입이 가능하도록 형성되거나, 또는 상측 단의 적어도 일부가 하측 단 내로 삽입이 가능하도록 형성될 수도 있 다. 구현 예에 따라, 상기 제1지지부는 다단으로 구성되지 않고 내부가 빈 기둥과 상기 기둥 내에 삽입되어 피 스톤과 같이 상기 제1구동부(미도시) 및/또는 제2구동부(미도시)에 의해 상하 왕복할 수 있는 축의 형태로 구현 될 수도 있다. 어떠한 경우든, 상기 제1지지부는 상기 제1구동부(미도시) 및/또는 제2구동부(미도시)의 구동에 따라 높이 가 조절될 수 있도록 형성될 수 있다. 상기 제1구동부(미도시) 및/또는 상기 제2구동부(미도시)는 다양한 형태로 구현될 수 있다. 예를 들면, 도 4에 도시된 바와 같이 상기 제1구동부(미도시)는 상기 제1지지부의 내부에서 구동되는 구동 수단(예컨대, 모터)과, 상기 모터의 회전에 의해 길이(높이)가 조절되는 길이조절수단으로 구성될 수 있다. 이러한 경우, 상기 구동수단(예컨대, 모터)의 회전축에는 상기 길이조절수단과 맞물리는 톱니바퀴 형상이 형성되어 있을 수 있으며, 상기 제어부(미도시)의 제어에 따라 상기 구동수단(예컨대, 모터)이 어 느 한 방향으로 회전(①)하면, 회전 방향에 따라 상기 길이조절수단이 상기 제1지지부를 밀어 올리거 나 내리면서(②) 상기 제1지지부의 길이 조절이 수행될 수 있다. 다른 실시 예에 의하면, 상기 제1구동부(미도시)는 도 5에 도시된 바와 같이 유압 실린더 또는 공압 실린더의 형태로 구현될 수도 있다. 이러한 경우, 상기 유압 실린더 또는 공압 실린더는 소정의 제어신호에 따라 팽창하 거나 수축하면서 상기 제1지지부의 길이를 조절할 수 있다. 이 외에도, 상기 제어부(미도시)나 사용자의 휴대 단말기, 및/또는 상기 높이 조절부로부터 전송되는 제어신호에 따라 구동이 가능하면서, 어느 축의 길이가 조절이 가능한 형태라면 상기 제1구동부(미도시)는 어떠 한 형태로 구현되어도 무방할 수 있다. 도면에는 상기 제1구동부(미도시)에 대한 구성이 도시되어 있지만, 상기 제2구동부(미도시) 역시 상기 제1구동 부(미도시)와 동일하게 구성되어 있을 수 있다. 다만, 상기 제1구동부(미도시) 및 상기 제2구동부(미도시)의 구 동 범위는 서로 다를 수 있다 이에 따라, 상기 제2지지부 역시 상기 제1지지부와 동일한 구성으로 높이가 조절되도록 구현될 수 있 다. 다만, 상기 제2지지부는 높이가 조절되는 범위가 상기 제1지지부와 다른 소정의 제2범위 내일 수 있다. 물론, 구현 예에 따라서는 상기 제1지지부 및 상기 제2지지부가 동일한 범위 내에서 높이가 조 절되도록 구현될 수도 있다. 도 7은 본 발명의 실시 예에 따른 인공지능 더블모션 데스크와 애플리케이션 시스템 간의 연동을 설명하기 위한 도면이다. 도 7을 참조하면, 본 발명의 실시 예에 따른 인공지능 더블모션 데스크는 전술한 바와 같이 사용자의 휴대 단말기와 네트워크를 통해 연결되어 본 발명의 기술적 사상을 구현하기 위한 동작들을 수행할 수 있다. 도 면에는 사용자의 휴대 단말기(애플리케이션 시스템)와 블루투스를 통해 연결되는 경우가 도시되어 있지만 본 발 명이 이에 한정되지는 않는다. 상기 인공지능 더블모션 데스크는 상기 애플리케이션 시스템과 블루투스 외에 도 NFC 등과 같은 다양한 근거리 무선통신 네트워크를 통해 연결될 수도 있고, 와이파이나 이동통신 네트워크, 또는 인터넷망을 통해 연결될 수도 있다. 어떠한 경우든, 상기 인공지능 더블모션 데스크와 상기 애플리케이 션 시스템은 네트워크를 통해 서로 연결되어 필요한 데이터를 송수신할 수 있다. 이를 위해, 상기 사용자의 휴대 단말기는 미리 애플리케이션 시스템이 설치되어 있을 수 있다. 사용자는 상기 애플리케이션 시스템을 통해, 상기 인공지능 더블모션 데스크의 각 상판들(예컨대, 제1상판 및/또는 제 2상판)의 높이를 원격으로 조절하거나, 인공지능 더블모션 데스크의 사용을 위해 자신에게 최적화된 높 이가 세팅된 높이 정보를 저장할 수도 있다. 전술한 바와 같이 상기 제어부(미도시)가 사용자를 인식하면, 상기 제어부(미도시)는 상기 애플리케이션 시스템 을 통해 사용자 정보를 전달받고, 미리 등록된 사용자인 경우 사용자에게 최적화된 높이로 상기 제1상판과 상기 제2상판의 높이를 조절할 수 있다. 사용자의 등록은 상기 애플리케이션 시스템을 통해 사용자가 직접 등록할 수도 있고, 동일한 사용자가 일정 횟 수 이상 반복적으로 인공지능 더블모션 데스크를 사용하는 경우 상기 제어부(미도시)에 의해 자동으로 수행 될 수도 있다. 사용자에게 최적화된 높이 역시, 사용자가 상기 제1상판 및 상기 제2상판 각각의 높이를 상기 제어부 (미도시)에 저장할 수도 있고, 상기 애플리케이션 시스템을 통해 저장할 수도 있다. 또는, 상기 제어부(미도 시)가 동일한 사용자가 반복적으로 설정하는 높이를 해당 사용자에게 최적화된 높이로 저장할 수도 있다. 또한 사용자는 상기 애플리케이션 시스템을 통해 등록된 사용자임을 인증할 수도 있고, 전술한 바와 같이 상기 영상장치를 통해 상기 제어부(미도시)가 등록된 사용자인지 여부를 인증할 수도 있다.한편, 상기 인공지능 더블모션 데스크는 공유 오피스나 독서실, 도서관 등 다수가 이용하는 시설에서 사용이 가능할 수 있다. 이러한 경우, 상기 인공지능 더블모션 데스크는 키오스크와의 연결, 연동을 통해 정해진 기 능을 수행할 수 있다. 도 8은 본 발명의 실시 예에 따른 인공지능 더블모션 데스크와 키오스크 간의 연동을 설명하기 위한 도면이다. 도 8을 참조하면, 상기 인공지능 더블모션 데스크는 키오스크와 네트워크를 통해 연결될 수 있다. 도 7에서 전술한 바와 같이, 도면에는 상기 키오스크와 상기 인공지능 더블모션 데스크가 블루투스를 통해 연결된 경 우가 도시되어 있으나, 이 외에도 다양한 네트워크를 통해 연결될 수 있음은 물론이다. 이처럼 상기 인공지능 더블모션 데스크와 상기 키오스크와의 연결되는 경우, 사용자는 상기 키오스크를 통해 어느 자리가 현재 공석인지 여부를 용이하게 알 수 있다. 또한 전술한 바와 같은 사용자 인증을 통해 특정 사용 자의 착석 여부를 알 수도 있으므로, 스마트 오피스 등과 같은 공유 좌석제가 시행되는 공간에서 상기 인공지능 더블모션 데스크의 활용도가 더욱 높아질 수 있다. 이러한 경우에도, 사용자가 상기 키오스크를 통해 빈 자리를 찾아 인공지능 더블모션 데스크를 사용하려 하 면, 전술한 바와 같은 과정을 통해 사용자를 인식하고 각 상판들의 높이가 조절될 수 있다."}
{"patent_id": "10-2021-0032066", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타나며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2021-0032066", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위하여 각 도면의 간단한 설명이 제공된다. 도 1은 본 발명의 실시 예에 따른 인공지능 더블모션 데스크의 구성을 나타낸다. 도 2는 본 발명의 실시 예에 따른 인공지능 더블모션 데스크의 거치부의 구현 예를 나타낸다. 도 3은 본 발명의 실시 예에 따른 인공지능 더블모션 데스크와 사용자의 휴대 단말기 간의 연결을 나타낸다. 도 4 및 도 5는 본 발명의 실시 예에 따른 인공지능 더블모션 데스크의 구동부를 설명하기 위한 도면이다. 도 6은 본 발명의 실시 예에 따른 인공지능 더블모션 데스크와 애플리케이션 시스템 간의 연동을 설명하기 위한 도면이다. 도 7은 본 발명의 실시 예에 따른 인공지능 더블모션 데스크와 키오스크 간의 연동을 설명하기 위한 도면이다."}
