{"patent_id": "10-2019-0100947", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0104272", "출원번호": "10-2019-0100947", "발명의 명칭": "차량 운전과 관련된 정보를 제공하는 방법 및 장치", "출원인": "엘지전자 주식회사", "발명자": "박민규"}}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "연산장치에서 차량 운행 정보 제공하는 방법에 있어서, 운전자와 대응하는 차량 운행 히스토리 정보를 획득하는 단계; 상기 획득된 히스토리 정보를 기반으로 차량 주행 정보를 예측하는 단계; 및상기 예측된 정보가 특정 조건을 만족하는 경우, 상기 예측된 정보를 기반으로 확인된 상기 차량의 주행 관련정보를 대상 차량에게 전송하는 단계를 포함하는 차량 운행 정보 제공방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 차량 주행 정보를 예측하는 단계는 상기 차량의 네비게이션 경로 안내 정보 및 상기 차량의 현재 운행 정보를 기반으로 상기 차량 주행 정보를 예측하는 단계를 포함하는 차량 운행 정보 제공방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 차량 주행 정보를 예측하는 단계는 상기 차량이 진행 방향에 있는 갈림길 정보를 확인하는 단계; 상기 차량의 주행 차로 정보를 확인하는 단계; 및 상기 주행 차로가 상기 갈림길에서 상기 경로 안내 정보가 지시하는 경로에 대응하지 않는 경우, 상기 경로 안내 정보가 지시하는 경로 방향으로 차선 변경이 있을 것을 예측하는 단계를 포함하는 차량 운행 정보 제공방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 차량 주행 정보를 예측하는 단계는 상기 차량이 갈림길에서 상기 경로 안내 정보와 상이한 방향으로 진행하였는지 확인하는 단계; 및 상기 경로 안내 정보와 상이한 방향으로 진행하고, 상기 갈림길이 특정 종류의 갈림길에 대응하는 경우, 상기차량의 속도 변경이 있을 것을 예측하는 단계를 포함하는 차량 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 차량 운행 히스토리 정보는 상기 운전자가 현재 차량이 운행하는 경로를 운행한 히스토리가 있는지 여부에대한 정보를 포함하는 것을 특징으로 하는 차량 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 차량 주행 정보를 예측하는 단계는 상기 운전자가 현재 차량이 운행하는 경로를 운행한 히스토리가 없는 경우, 현재 주행 도로의 복잡도 정보, 상공개특허 10-2019-0104272-3-기 차량이 목적지에 인접하였는지 여부에 대한 정보 및 네비게이션이 안내한 경로를 이탈한 횟수에 대한 정보중 적어도 하나를 기반으로 차량 주행 정보를 예측하는 단계를 포함하는 것을 특징으로 하는 차량 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 차량이 운행 중인 실제 도로 정보를 확인하는 단계; 및상기 차량과 관련된 네비게이션의 맵 정보를 확인하는 단계를 더 포함하고, 상기 차량 주행 정보는 상기 실제 도로 정보 및 상기 맵 정보를 추가로 고려하여 예측되는 것을 특징으로 하는차량 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 차량 주행 정보를 예측하는 단계는 상기 운전자의 운전 패턴 정보, 상기 차량이 운행하는 도로 정보 및 상기 차량이 운행할 경로 정보를 기반으로상기 차량 주행 정보를 예측하는 단계를 포함하는 차량 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 차량의 주행 패턴과 관련된 정보를 상기 대상 차량에게 전송하는 단계는상기 차량을 식별할 수 있는 정보를 포함하는 메시지를 상기 대상 차량에 전송하는 단계를 포함하며, 상기 메시지는 상기 차량의 주행 패턴의 종류와 관련된 정보, 상기 차량의 주행 방향과 관련된 정보, 상기 주행패턴으로 주행할 가능성에 대한 정보 및 상기 메시지에 대응하는 시간 정보 중 적어도 하나를 포함하는 것을 특징으로 하는 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 차량 운행 히스토리 정보, 상기 차량이 안내되는 경로 정보 및 상기 차량의 현재 운행 정보 중 적어도 하나를 기반으로 상기 차량의 주행 패턴과 관련된 정보를 전송할 상기 대상 차량을 확인하는 단계를 더 포함하는운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 서버로부터 수신한 정보를 기반으로 상기 차량의 주행 패턴과 관련된 정보를 전송할 상기 대상 차량을 확인하는단계를 더 포함하고, 상기 서버로부터 수신한 정보는 상기 차량이 안내되는 경로 정보와 대응하는 대상 차량에 대한 정보를 포함하는것을 특징으로 하는 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 상기 차량의 주행 패턴 정보에 대응하여 상기 차량이 운행하는지 확인하는 단계; 및 상기 확인 결과를 기반으로 상기 차량의 주행 패턴 정보를 추가적으로 상기 대상 차량에게 전송하는 단계를 더포함하는 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2019-0104272-4-제1항에 있어서, 상기 차량의 주행 관련 정보는 상기 차량이 이동에 대응하는 방향정보, 상기 차량의 속도 변화 정보 및 상기 차량이 상기 방향 및 속도로 이동할 확률 정보 중 적어도 하나를 포함하는 것을 특징으로 하는 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서, 다른 차량의 주행 경로 안내 정보를 수신하는 단계; 상기 다른 차량의 주행 차선 정보, 상기 다른 차량의 속도 정보 및 상기 다른 차량의 방향 정보 중 적어도 하나를 획득하는 단계; 및 상기 다른 차량의 주행 예측 정보가 상기 특정 조건을 만족하는 경우, 상기 주행 예측 정보를 제공하는 단계를더 포함하는 것을 특징으로 하는 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서, 상기 예측된 정보를 기반으로 상기 차량이 주행하는지 확인하는 단계; 및 상기 확인 결과를 기초로 상기 히스토리 정보를 업데이트 하는 단계를 더 포함하는 것을 특징으로 하는 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서, 상기 차량 주행 정보는 상기 히스토리 정보를 기반으로 인공 지능을 통해 학습된 모듈을 사용하여 확인되는 것을 특징으로 하는 운행 정보 제공 방법."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "운행정보를 제공하는 연산장치에 있어서, 다른 차량과 통신할 수 있는 통신부; 및 상기 통신부를 제어하고, 운전자와 대응하는 차량 운행 히스토리 정보를 획득하고, 상기 획득된 히스토리 정보를 기반으로 차량 주행 정보를 예측하고, 상기 예측된 정보가 특정 조건을 만족하는 경우, 상기 예측된 정보를기반으로 확인된 상기 차량의 주행 관련 정보를 대상 차량에게 전송하는 제어부를 포함하는 연산장치."}
{"patent_id": "10-2019-0100947", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "운행 정보를 표시하는 연산장치에 있어서, 디스플레이부; 통신부; 및 상기 통신부를 통해 다른 차량의 주행 관련 정보를 포함하는 운행 정보를 수신하고, 상기 수신한 운행 정보를기반으로 상기 다른 차량의 운행과 관련된 정보를 디스플레이부에 표시하도록 제어하는 제어부를 포함하며, 상기 운행 정보는 상기 다른차량의 운전자에 대응하는 히스토리 정보를 기반으로 예측된 상기 다른 차량의 주행정보를 포함하는 것을 특징으로 하는 연산장치."}
{"patent_id": "10-2019-0100947", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 자율 주행 차량, 사용자 단말기 및 서버 중 하나 이상이 인공 지능(Artificial Intelligence) 모듈, 드론(Unmanned Aerial Vehicle, UAV), 로봇, 증강 현실(Augmented Reality, AR) 장치, 가상 현실(virtual reality, VR), 5G 서비스와 관련된 장치 등과 연계 혹은 융복합될 수 있다. 상술한 과제를 달성하기 위하여, 본 명세서의 일 실시 예에 따르는 연산장치에서 차량 운행 정보 제공하는 방법은 운전자와 대응하는 차량 운행 히스 토리 정보를 획득하는 단계; 상기 획득된 히스토리 정보를 기반으로 차량 주행 정보를 예측하는 단계; 및 상기 예측된 정보가 특정 조건을 만족하는 경우, 상기 예측된 정보를 기반으로 확인된 상기 차량의 주행 관련 정보를 대상 차량에게 전송하는 단계를 포함한다."}
{"patent_id": "10-2019-0100947", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서의 실시 예는 차량과 관련된 연산장치가 해당 차량의 운전 관련 정보를 다른 주체에 제공하는 방법 및 장치에 관한 것이다. 보다 구체적으로 본 명세서의 실시 예는 차량과 관련된 연산장치가 운전자관련 정보 및 네 비게이션 정보 중 적어도 하나를 기반으로 해당 차량의 운전과 관련된 정보를 다른 주체에 제공하는 방법 및 장 치에 관한 것이다."}
{"patent_id": "10-2019-0100947", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "차량의 운행과 관련해서 차량과 관련된 연산장치가 사용자가 입력한 정보 및 외부에서 수신한 정보를 기반으로 운전자에게 운전 경로 및 이에 관련된 보조 정보를 제공하는 네비게이션과 같은 기기들이 제공되고 있다. 또한 최근에는 차량 대 차량(vehicle to vehicle, V2V) 또는 차량 대 사물(vehicle to everything, V2X)의 통신을 통해 차량과 관련된 정보를 다른 차량 또는 다른 주체와의 정보를 제공할 수 있다. 이와 같이 운전 편의를 위해 사용자에게 정보를 제공할 수 있으며, 이와 같은 정보는 차량의 센서에서 수집한 정보를 포함할 수 있다. 차량은 이와 같은 정보를 제공받아서 운전에 활용할 수 있으며, 서버와 같은 장치들은 차량으로부터 수신한 정보를 저장 및 가공하여 차량 운행과 관련된 통계적 특징정보를 도출하여 활용할 수 있다. 시스템을 통해 차량에 추가적인 정보를 제공함으로써 차량의 안전 사고를 방지하고 방지하고 운전자가 이 와 같은 정보의 보조를 통해 사용성이 향상될 수 있다. 그러나 단순히 센서를 통해 수집된 정보나 이를 통해 수 집된 통계적인 정보만을 활용하여 도출된 정보를 제공함으로써 보다 구체적인 정보를 제공할 필요성이 대두되고 있다."}
{"patent_id": "10-2019-0100947", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서의 실시 예는 상술한 문제점을 해결하기 위하여 제안된 것으로 차량의 운전자와 관련된 정보를 활용하 여, 차후 차량이 운행될 정보를 예측하여 이를 다른 사용자 혹은 서버에 전송하는 방법 및 장치를 제공하는 것 을 목적으로 한다. 또한 본 명세서의 실시 예는 차량 경로 안내 정보 및 현재 차량의 상태를 기반으로 해당 차 량이 운행될 정보를 예측하고, 예측된 정보를 다른 차량 또는 서버에 전송하는 방법 및 장치를 제공하는 것을 목적으로 한다. 또한 운전자의 운행 히스토리를 기반으로 해당 차량이 운행될 정보를 예측하고, 예측된 정보를 다른 차량 또는 서버에 전송하는 방법 및 장치를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2019-0100947", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 달성하기 위하여, 본 명세서의 일 실시 예에 따르는 연산장치에서 차량 운행 정보 제공하는 방법 은 운전자와 대응하는 차량 운행 히스토리 정보를 획득하는 단계; 상기 획득된 히스토리 정보를 기반으로 차량 주행 정보를 예측하는 단계; 및 상기 예측된 정보가 특정 조건을 만족하는 경우, 상기 예측된 정보를 기반으로 확인된 상기 차량의 주행 관련 정보를 대상 차량에게 전송하는 단계를 포함한다. 본 명세서의 다른 실시 예에 따르는 운행정보를 제공하는 연산장치는 다른 차량과 통신할 수 있는 통신부; 및 상기 통신부를 제어하고, 운전자와 대응하는 차량 운행 히스토리 정보를 획득하고, 상기 획득된 히스토리 정보 를 기반으로 차량 주행 정보를 예측하고, 상기 예측된 정보가 특정 조건을 만족하는 경우, 상기 예측된 정보를 기반으로 확인된 상기 차량의 주행 관련 정보를 대상 차량에게 전송하는 제어부를 포함한다. 본 명세서의 또 다른 실시 예에 따르는 운행 정보를 표시하는 연산장치는 디스플레이부; 통신부; 및 상기 통신 부를 통해 다른 차량의 주행 관련 정보를 포함하는 운행 정보를 수신하고, 상기 수신한 운행 정보를 기반으로 상기 다른 차량의 운행과 관련된 정보를 디스플레이부에 표시하도록 제어하는 제어부를 포함하며, 상기 운행 정 보는 상기 다른차량의 운전자에 대응하는 히스토리 정보를 기반으로 예측된 상기 다른 차량의 주행 정보를 포함 하는 것을 특징으로 한다."}
{"patent_id": "10-2019-0100947", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 명세서의 실시 예에 따르면 차량 경로 안내 정보, 현재 차량의 상태, 운전자의 운행 히스토리 등을 활용하여, 차량이 운행될 정보를 예측하고 이와 같은 정보를 다른 차량 또는 서버에 제공하여, 해당 차량과 관 련된 사고의 확률을 줄일 수 있는 효과가 있다. 또한 이와 같은 정보에 따라 다른 차량이 반응하는 결과를 수집 하여 차후 차량간의 정보 교환을 보다 효율적으로 할 수 있는 효과가 있다."}
{"patent_id": "10-2019-0100947", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시 예를 첨부된 도면을 참조하여 상세하게 설명한다. 실시 예를 설명함에 있어서 본 발명이 속하는 기술 분야에 익히 알려져 있고 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2019-0100947", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이 때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행 될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가 능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들 을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA또는 ASIC과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아 니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재 생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성 요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저 들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공 되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또한 실시 예에서 제어부로 언급되는 것은 해당 장치를 제어하기 위한 동작을 하는 구성으로 적어도 하나의 프로세서를 포함할 수 있다. 인공 지능은 인공적인 지능 또는 이를 만들 수 있는 방법론을 연구하는 분야를 의미하며, 머신 러닝(기계 학습, Machine Learning)은 인공 지능 분야에서 다루는 다양한 문제를 정의하고 그것을 해결하는 방법론을 연구하는 분야를 의미한다. 머신 러닝은 어떠한 작업에 대하여 꾸준한 경험을 통해 그 작업에 대한 성능을 높이는 알고리 즘으로 정의하기도 한다. 인공 신경망(ANN: Artificial Neural Network)은 머신 러닝에서 사용되는 모델로써, 시냅스의 결합으로 네트워 크를 형성한 인공 뉴런(노드)들로 구성되는, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공 신경 망은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 인공 신경망은 입력층(Input Layer), 출력층(Output Layer), 그리고 선택적으로 하나 이상의 은닉층(Hidden Layer)를 포함할 수 있다. 각 층은 하나 이상의 뉴런을 포함하고, 인공 신경망은 뉴런과 뉴런을 연결하는 시냅 스를 포함할 수 있다. 인공 신경망에서 각 뉴런은 시냅스를 통해 입력되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함수값을 출력할 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향 등이 포함된 다. 그리고, 하이퍼파라미터는 머신 러닝 알고리즘에서 학습 전에 설정되어야 하는 파라미터를 의미하며, 학습 률(Learning Rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포함된다. 인공 신경망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수 는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신 러닝은 학습 방식에 따라 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning)으로 분류할 수 있다. 지도 학습은 학습 데이터에 대한 레이블(label)이 주어진 상태에서 인공 신경망을 학습시키는 방법을 의미하며, 레이블이란 학습 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결과 값)을 의미할 수 있다. 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않는 상태에서 인공 신경망을 학습시키 는 방법을 의미할 수 있다. 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화 하는 행동 혹은 행동 순서를 선택하도록 학습시키는 학습 방법을 의미할 수 있다. 인공 신경망 중에서 복수의 은닉층을 포함하는 심층 신경망(DNN: Deep Neural Network)으로 구현되는 머신 러닝 을 딥 러닝(심층 학습, Deep Learning)이라 부르기도 하며, 딥 러닝은 머신 러닝의 일부이다. 이하에서, 머신 러닝은 딥 러닝을 포함하는 의미로 사용된다. 자율 주행은 스스로 주행하는 기술을 의미하며, 자율 주행 차량은 사용자의 조작 없이 또는 사용자의 최소한의 조작으로 주행하는 차량(Vehicle)을 의미한다. 예컨대, 자율 주행에는 주행중인 차선을 유지하는 기술, 어댑티브 크루즈 컨트롤과 같이 속도를 자동으로 조절 하는 기술, 정해진 경로를 따라 자동으로 주행하는 기술, 목적지가 설정되면 자동으로 경로를 설정하여 주행하는 기술 등이 모두 포함될 수 있다. 차량은 내연 기관만을 구비하는 차량, 내연 기관과 전기 모터를 함께 구비하는 하이브리드 차량, 그리고 전기 모터만을 구비하는 전기 차량을 모두 포괄하며, 자동차뿐만 아니라 기차, 오토바이 등을 포함할 수 있다. 이때, 자율 주행 차량은 자율 주행 기능을 가진 로봇으로 볼 수 있다. 도 1은 본 발명의 일 실시 예에 따른 AI 장치를 나타낸다. AI 장치는 TV, 프로젝터, 휴대폰, 스마트폰, 데스크탑 컴퓨터, 노트북, 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 태블릿 PC, 웨어러블 장치, 셋톱박스(STB), DMB 수신기, 라디오, 세탁기, 냉장고, 데스크탑 컴퓨터, 디지털 사이니지, 로봇, 차량 등 과 같은, 고정형 기기 또는 이동 가능한 기기 등으로 구현될 수 있다. 도 1을 참조하면, 단말기는 통신부, 입력부, 러닝 프로세서, 센싱부, 출력부, 메모리 및 프로세서 등을 포함할 수 있다. 실시 예에서 언급되는 연산장치는 단말에 대응될 수 있다. 통신부는 유무선 통신 기술을 이용하여 다른 AI 장치(100a 내지 100e)나 AI 서버 등의 외부 장치들과 데이터를 송수신할 수 있다. 예컨대, 통신부는 외부 장치들과 센서 정보, 사용자 입력, 학습 모델, 제어 신호 등을 송수신할 수 있다. 이때, 통신부가 이용하는 통신 기술에는 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), LTE(Long Term Evolution), 5G, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), 블 루투스(Bluetooth), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), ZigBee, NFC(Near Field Communication) 등이 있다. 실시 예에서 통신부를 통해 단말기는 통신 시스 템에 접속할 수 있으며, 다른 단말기와 통신을 직접적으로 수행하거나 네트워크를 통해 다른 단말기 및 서버 중 적어도 하나와 통신을 수행할 수 있다. 실시 예에서 통신부는 V2V(vehicle to vehicle) 및 V2X(vehicle to every thing) 통신을 사용하여 다른 단말기 및 서버 중 적어도 하나와 통신을 수행할 수 있다. 입력부는 다양한 종류의 데이터를 획득할 수 있다. 이때, 입력부는 영상 신호 입력을 위한 카메라, 오디오 신호를 수신하기 위한 마이크로폰, 사용자로부터 정보를 입력 받기 위한 사용자 입력부 등을 포함할 수 있다. 여기서, 카메라나 마이크로폰을 센서로 취급하여, 카메라나 마이크로폰으로부터 획득한 신호를 센싱 데이터 또는 센서 정보라고 할 수도 있다. 입력부는 모델 학습을 위한 학습 데이터 및 학습 모델을 이용하여 출력을 획득할 때 사용될 입력 데이터 등을 획득할 수 있다. 입력부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 프로세서 또는 러닝 프로세서는 입력 데이터에 대하여 전처리로써 입력 특징점(input feature)을 추출할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망으로 구성된 모델을 학습시킬 수 있다. 여기서, 학습 된 인공 신경망을 학습 모델이라 칭할 수 있다. 학습 모델은 학습 데이터가 아닌 새로운 입력 데이터에 대하여 결과 값을 추론해 내는데 사용될 수 있고, 추론된 값은 어떠한 동작을 수행하기 위한 판단의 기초로 이용될 수 있다. 이때, 러닝 프로세서는 AI 서버의 러닝 프로세서과 함께 AI 프로세싱을 수행할 수 있다. 이때, 러닝 프로세서는 AI 장치에 통합되거나 구현된 메모리를 포함할 수 있다. 또는, 러닝 프로세서 는 메모리, AI 장치에 직접 결합된 외부 메모리 또는 외부 장치에서 유지되는 메모리를 사용하 여 구현될 수도 있다. 실시 예에서 차량 내 이미지 분석을 통해 사용자 및 물품 중 적어도 하나를 판단할 수 있 다. 센싱부는 다양한 센서들을 이용하여 AI 장치 내부 정보, AI 장치의 주변 환경 정보 및 사용자 정보 중 적어도 하나를 획득할 수 있다. 이때, 센싱부에 포함되는 센서에는 근접 센서, 조도 센서, 가속도 센서, 자기 센서, 자이로 센서, 관성 센 서, RGB 센서, IR 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰, 라이다, 레이더 등이 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시킬 수 있다. 이때, 출력부에는 시각 정보를 출력하는 디스플레이부, 청각 정보를 출력하는 스피커, 촉각 정보를 출력하 는 햅틱 모듈 등이 포함될 수 있다. 메모리는 AI 장치의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 예컨대, 메모리는 입력 부에서 획득한 입력 데이터, 학습 데이터, 학습 모델, 학습 히스토리 등을 저장할 수 있다. 프로세서는 데이터 분석 알고리즘 또는 머신 러닝 알고리즘을 사용하여 결정되거나 생성된 정보에 기초하 여, AI 장치의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. 그리고, 프로세서는 AI 장치(10 0)의 구성 요소들을 제어하여 결정된 동작을 수행할 수 있다. 이를 위해, 프로세서는 러닝 프로세서 또는 메모리의 데이터를 요청, 검색, 수신 또는 활용할 수 있고, 상기 적어도 하나의 실행 가능한 동작 중 예측되는 동작이나, 바람직한 것으로 판단되는 동작을 실행 하도록 AI 장치의 구성 요소들을 제어할 수 있다. 이때, 프로세서는 결정된 동작을 수행하기 위하여 외부 장치의 연계가 필요한 경우, 해당 외부 장치를 제 어하기 위한 제어 신호를 생성하고, 생성한 제어 신호를 해당 외부 장치에 전송할 수 있다. 프로세서는 사용자 입력에 대하여 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 사용자의 요구 사 항을 결정할 수 있다. 이때, 프로세서는 음성 입력을 문자열로 변환하기 위한 STT(Speech To Text) 엔진 또는 자연어의 의도 정 보를 획득하기 위한 자연어 처리(NLP: Natural Language Processing) 엔진 중에서 적어도 하나 이상을 이용하여, 사용자 입력에 상응하는 의도 정보를 획득할 수 있다. 이때, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 적어도 일부가 머신 러닝 알고리즘에 따라 학습된 인 공 신경망으로 구성될 수 있다. 그리고, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 러닝 프로세서 에 의해 학습된 것이나, AI 서버의 러닝 프로세서에 의해 학습된 것이거나, 또는 이들의 분산 처리에 의해 학습된 것일 수 있다. 프로세서는 AI 장치의 동작 내용이나 동작에 대한 사용자의 피드백 등을 포함하는 이력 정보를 수집 하여 메모리 또는 러닝 프로세서에 저장하거나, AI 서버 등의 외부 장치에 전송할 수 있다. 수 집된 이력 정보는 학습 모델을 갱신하는데 이용될 수 있다. 프로세서는 메모리에 저장된 응용 프로그램을 구동하기 위하여, AI 장치의 구성 요소들 중 적어 도 일부를 제어할 수 있다. 나아가, 프로세서는 상기 응용 프로그램의 구동을 위하여, AI 장치에 포 함된 구성 요소들 중 둘 이상을 서로 조합하여 동작시킬 수 있다. 도 2는 본 발명의 일 실시 예에 따른 AI 서버를 나타낸다. 도 2를 참조하면, AI 서버는 머신 러닝 알고리즘을 이용하여 인공 신경망을 학습시키거나 학습된 인공 신 경망을 이용하는 장치를 의미할 수 있다. 여기서, AI 서버는 복수의 서버들로 구성되어 분산 처리를 수행 할 수도 있고, 5G 네트워크로 정의될 수 있다. 이때, AI 서버는 AI 장치의 일부의 구성으로 포함되어, AI 프로세싱 중 적어도 일부를 함께 수행할 수도 있다. AI 서버는 통신부, 메모리, 러닝 프로세서 및 프로세서 등을 포함할 수 있다. 통신부는 AI 장치 등의 외부 장치와 데이터를 송수신할 수 있다. 메모리는 모델 저장부를 포함할 수 있다. 모델 저장부는 러닝 프로세서을 통하여 학습 중 인 또는 학습된 모델(또는 인공 신경망, 231a)을 저장할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망(231a)을 학습시킬 수 있다. 학습 모델은 인공 신경 망의 AI 서버에 탑재된 상태에서 이용되거나, AI 장치 등의 외부 장치에 탑재되어 이용될 수도 있다. 학습 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 전부가 소프트웨어로 구현되는 경우 학습 모델을 구성하는 하나 이상의 명령어(instruction)는 메모리 에 저장될 수 있다. 프로세서는 학습 모델을 이용하여 새로운 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기 초한 응답이나 제어 명령을 생성할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 AI 시스템을 나타낸다. 도 3을 참조하면, AI 시스템은 AI 서버, 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰 (100d) 또는 가전(100e) 중에서 적어도 하나 이상이 클라우드 네트워크와 연결된다. 여기서, AI 기술이 적 용된 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰(100d) 또는 가전(100e) 등을 AI 장치(100a 내지 100e)라 칭할 수 있다. 클라우드 네트워크는 클라우드 컴퓨팅 인프라의 일부를 구성하거나 클라우드 컴퓨팅 인프라 안에 존재하는 네트워크를 의미할 수 있다. 여기서, 클라우드 네트워크는 3G 네트워크, 4G 또는 LTE(Long Term Evolution) 네트워크 또는 5G 네트워크 등을 이용하여 구성될 수 있다. 즉, AI 시스템을 구성하는 각 장치들(100a 내지 100e, 200)은 클라우드 네트워크를 통해 서로 연결될 수 있다. 특히, 각 장치들(100a 내지 100e, 200)은 기지국을 통해서 서로 통신할 수도 있지만, 기지국을 통하지 않 고 직접 서로 통신할 수도 있다. AI 서버는 AI 프로세싱을 수행하는 서버와 빅 데이터에 대한 연산을 수행하는 서버를 포함할 수 있다. AI 서버는 AI 시스템을 구성하는 AI 장치들인 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스 마트폰(100d) 또는 가전(100e) 중에서 적어도 하나 이상과 클라우드 네트워크을 통하여 연결되고, 연결된 AI 장치들(100a 내지 100e)의 AI 프로세싱을 적어도 일부를 도울 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)를 대신하여 머신 러닝 알고리즘에 따라 인공 신경망을 학습시킬 수 있고, 학습 모델을 직접 저장하거나 AI 장치(100a 내지 100e)에 전송할 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)로부터 입력 데이터를 수신하고, 학습 모델을 이용하여 수신한 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성하여 AI 장치 (100a 내지 100e)로 전송할 수 있다. 또는, AI 장치(100a 내지 100e)는 직접 학습 모델을 이용하여 입력 데이터에 대하여 결과 값을 추론하고, 추론 한 결과 값에 기초한 응답이나 제어 명령을 생성할 수도 있다. 이하에서는, 상술한 기술이 적용되는 AI 장치(100a 내지 100e)의 다양한 실시 예들을 설명한다. 여기서, 도 3에 도시된 AI 장치(100a 내지 100e)는 도 1에 도시된 AI 장치의 구체적인 실시 예로 볼 수 있다. 자율 주행 차량(100b)은 AI 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있다. 자율 주행 차량(100b)은 자율 주행 기능을 제어하기 위한 자율 주행 제어 모듈을 포함할 수 있고, 자율 주행 제 어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 자율 주행 제어 모듈은 자율 주 행 차량(100b)의 구성으로써 내부에 포함될 수도 있지만, 자율 주행 차량(100b)의 외부에 별도의 하드웨어로 구 성되어 연결될 수도 있다. 자율 주행 차량(100b)은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 자율 주행 차량(100b)의 상 태 정보를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계 획을 결정하거나, 동작을 결정할 수 있다. 실시 예에서 자율 주행 차량(100b)는 차량 내 물품을 사용자에게 전 달할 위치를 결정하고, 이와 같은 정보를 사용자에게 제안할 수 있다. 여기서, 자율 주행 차량(100b)은 이동 경로 및 주행 계획을 결정하기 위하여, 로봇(100a)과 마찬가지로, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 특히, 자율 주행 차량(100b)은 시야가 가려지는 영역이나 일정 거리 이상의 영역에 대한 환경이나 객체는 외부 장치들로부터 센서 정보를 수신하여 인식하거나, 외부 장치들로부터 직접 인식된 정보를 수신할 수 있다. 자율 주행 차량(100b)은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수 행할 수 있다. 예컨대, 자율 주행 차량(100b)은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인 식된 주변 환경 정보 또는 객체 정보를 이용하여 주행 동선을 결정할 수 있다. 여기서, 학습 모델은 자율 주행 차량(100b)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, 자율 주행 차량(100b)은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서 버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 자율 주행 차량(100b)은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계획에 따라 자율 주행 차량(100b)을 주행시킬 수 있다. 맵 데이터에는 자율 주행 차량(100b)이 주행하는 공간(예컨대, 도로)에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예컨대, 맵 데이터에는 가로등, 바위, 건물 등의 고정 객체들과 차량, 보행자 등의 이 동 가능한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위 치 등이 포함될 수 있다. 또한, 자율 주행 차량(100b)은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있다. 이때, 자율 주행 차량(100b)은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. 도 4는 본 명세서의 일 실시 예에 따른 연산장치에서 운행 관련 정보를 확인하고 운전자의 돌발 행동이 예측하 고, 이와 같은 정보를 다른 차량에 제공하는 방법을 나타내는 순서도이다. 도 4를 참조하면, 실시 예에서 연산장치가 차량 운행 관련 정보를 확인하고, 이를 다른 차량에 전송하는 방법이 개시된다. 단계 410에서 연산장치는 운전자에 대응하는 히스토리 정보를 확인할 수 있다. 실시 예에서 히스토리 정보는 해 당 차량의 운전자가 현재 차량이 위치하는 영역의 운전 경험정보를 포함할 수 있다. 또한 히스토리 정보는 해당 차량의 운전자가 현재 차량이 위치하는 영역과 유사한 영역에서 어떤 방식으로 운전하였는지에 대한 정보를 포 함할 수 있다. 이와 같은 히스토리 정보를 통해 현재 차량이 위치한 환경에서 운전자의 동작을 예측할 수 있다. 단계 415에서 연산장치는 차량 운행 정보를 확인할 수 있다. 실시 예에서 운행 정보는 현재 차량과 관련해서 제 공되고 있는 경로 안내 정보를 포함할 수 있다. 일 예로 경로 안내 정보는 네비게이션이 제공하는 정보로서 목 적지까지의 경로를 안내하는 정보를 포함할 수 있다. 또한 실시 예에서 차량 운행 정보는 차량의 현재 위치 및 속도를 포함할 수 있다. 실시 예에서 차량의 위치는 3 차원 좌표상에서 차량의 위치 정보, 도로 상에서 차량이 위치한 차선에 대한 정보, 차량의 속도 정보 및 차량의 진행 방향 정보 중 적어도 하나를 포함할 수 있다. 이외에도 차량 운행 정보는 차량의 현재 상태 정보를 포함할 수 있다. 단계 420에서 연산장치는 확인된 정보 중 적어도 하나를 기반으로 돌발행동이 예측되는지를 판단할 수 있다. 실 시 예에서 돌발행동은 차량의 현재 운행 상태에서 운전자의 조작에 따라 차량의 운행에 급격한 변화가 생길 수 있는 경우를 포함할 수 있다. 일 예로 급격한 차선의 변경, 급격한 속도의 변경, 진행 방향의 불 일정성과 같은 경우를 포함할 수 있다. 또한 실시 예에서 돌발행동은 주변 차량의 진행에 영향을 미칠 수 있는 차량 조작 행위 를 포함할 수 있다. 실시 예에서 연산장치는 사용자의 운전 히스토리 및 차량 운행 정보 중 적어도 하나를 기반으로 돌발 행동이 예 측되는지 판단할 수 있다. 실시 예에서 연산장치는 이전 단계에서 확인한 정보 중 적어도 일부를 기반으로 돌발행동이 일어날 가능성을 확 인할 수 있다. 실시 예에서 돌발행동이 일어날 가능성이 특정 범위에 속할 경우 돌발행동이 일어난다고 예측할 수 있다. 일 예로 돌발행동이 일어날 가능성이 절반 이상일 경우에 돌발행동이 일어난다고 판단할 수 있으나 이 와 같은 구체적인 수치는 변경하여 적용 가능하다. 단계 425에서 연산장치는 예측되는 돌발행동에 관한 정보를 확인할 수 있다. 실시 예에서 돌발행동의 정보는 돌 발행동에 따라 예상되는 차량 속도의 변경 및 방향의 변경에 대한 정보 중 적어도 하나를 포함할 수 있다. 또한 실시 예에서 돌발행동 정보는 해당 돌발행동이 일어날 수 있는 가능성에 대한 정보를 포함할 수 있다. 단계 430에서 연산장치는 상기 확인한 돌발행동에 관한 정보를 기반으로 운행 정보 메시지를 확인할 수 있다. 실시 예에서 연산장치는 돌발행동에 따라 예상되는 차량 속도의 변경 및 방향의 변경에 대한 정보 및 돌발행동 이 일어날 수 있는 가능성에 대한 정보 중 적어도 하나를 포함하는 운행 정보 메시지를 생성할 수 있다. 실시 예에서 운행 정보 메시지는 현재 차량의 위치, 현재 차량의 주행과 관련된 정보 및 차량에서 일어날 수 있는 돌 발 행동에 관한 정보 중 적어도 하나를 포함할 수 있다. 일 예로 실시 예에서 운행 정보 메시지는 상기 차량이 이동할 수 있는 방향 및 속도에 대한 정보를 포함할 수 있다. 실시 예에서 운행 정보 메시지는 현재 차량의 위치 정보, 현재 차량의 속도 정보, 돌발 행동에 따른 차량 의 이동 정보 및 돌발 행동에 따른 차량의 속도 정보 중 적어도 하나를 포함할 수 있다. 단계 435에서 연산장치는 운행 정보 메시지를 전송 대상 차량을 확인할 수 있다. 일 예에서 별도의 대상 차량을 확인하는 대신 차량 주변에 브로드캐스트(broadcast)를 통해 운행 정보 메시지를 전송할 수도 있다. 실시 예에서 전송 대량 차량은 운행 정보 메시지는 차량의 돌발 행동에 따라 영향을 받을 수 있는 차량을 포함 할 수 있다. 이 경우 연산장치는 돌발행동에 관한 정보 및 주변 차량의 정보를 기반으로 전송 대량 차량을 결정 할 수 있다. 실시 예에서 주변 차량 정보는 주변 차량의 위치 정보, 속도정보 및 주변 차량이 자율주행인지 여 부에 대한 정보 중 적어도 하나를 포함할 수 있다. 일 예로 돌발 행동에 따라 차량의 차선이 변경될 가능성이 있을 경우, 연산장치는 차량이 이동할 차선에 주행하는 차량 중 일정 범위내에 있는 차량을 전송 대량 차량으로 확인할 수 있다. 또한 실시 예에서 차량과 통신 가능한 서버를 메시지 전송 대상으로 확인할 수도 있다. 또한 실시 예에서 대상 차량은 서버를 통해 수신된 정보를 기반으로 결정될 수 있다. 이때 서버는 도로의 상황 을 기반으로 상기 메시지가 전송될 대상 차량을 판단하고 이에 대한 정보를 해당 차량에 제공할 수 있다. 단계 440에서 연산장치는 확인된 대상 차량에 운행 정보 메시지를 전송할 수 있다. 실시 예에서 연산장치는 운 행 정보 메시지를 복수회 대상 차량에 전송할 수 있으며, 복수회 전송 대상 차량은 전송 메시지에 대해 응답 메 시지가 수신된 차량을 포함할 수 있다. 실시 예에서 연산장치는 차량에 대응할 수 있으며, 일 예로 차량 내부에 설치된 SoC(system on chip) 형태의 연 산장치일 수 있다. 이와 같은 연산장치는 차량의 센서를 통해 수집한 정보를 기반으로 추가적인 정보를 확인할 수 있으며, 이와 같이 확인된 정보를 기반으로 차량의 동작을 제어하거나 다른 노드와 통신을 수행할 수 있다. 실시 예에서 다른 차량은 연산장치를 포함하는 차량일 수 있으며, 송신의 대상이 차량에 제한되지 않으며 실시 예의 연산장치는 특정 서버를 대상으로 메시지를 전송할 수 있다. 한편 실시 예에서 차량의 연산장치는 차량의 주행 예정 경로 정보를 다른 차량에 전송할 수 있다. 일 예로 연산 장치는 차량의 주행 예정 경로 정보, 차량의 진행 방향에 대한 정보, 차량의 주행 차선 정보, 차량의 속도 및 운전자의 운전 히스토리 정보 중 적어도 하나를 포함하는 운행 정보 메시지를 다른 차량에 전송할 수 있다. 실 시 예에서 차량의 진행 방향에 대한 정보, 차량의 속도 정보 및 차량의 주행 차선 정보는 다른 차량이 해당 차 량의 이미지 센서를 통해 상기 차량의 정보를 식별하여는 방식으로 획득될 수 있다. 다른 차량은 주행 정보 메 시지를 기초로 상기 다른 차량의 센서를 통해 획득된 정보를 기반으로 상기 주행 정보 메시지를 전송한 다른 차 량이 돌발 행동을 할 가능성을 판단할 수 있다. 일 예로 주행 정보 메시지를 수신한 다른 차량이, 주행 정보 메 시지를 기반으로 주행 정보 메시지를 전송한 다른 차량이 주행 경로로 진행하기 위해 급격한 차선 변경을 할 가 능성이 높은 것으로 판단될 경우 판단될 경우, 상기 주행 정보 메시지를 수신한 다른 차량은 이를 감지하고, 사 용자에게 해당 정보를 제공하거나 다른 차량 및 서버 중 적어도 하나에 해당 정보를 전송하는 동작을 수행할 수 있다. 이와 같이 주행 정보 메시지를 다른 차량 또는 서버에 전송하고, 해당 주행 정보 메시지에 다른 차량이 해당 차량의 돌발행동 여부를 판단할 수 있는 정보를 포함시킴으로써 다른 차량이 해당 차량의 돌발 행동의 위 험성 여부를 판단하고 이에 대한 정보를 다른 차량의 운전자 또는 다른 차량 및 서버 중 적어도 하나에 제공함 으로써 사용성이 향상될 수 있다. 또한 실시 예에서 차량의 연산 장치는 운행 정보 메시지를 생성하고, 실제로 운전자가 운행정보 메시지에 포함된 정보와 관련된 돌발행동을 하는지 여부를 판단하고 이를 기반으로 차후 돌 발행동 가능성 여부를 판단할 수 있다. 또한 실시 예에서 운행 히스토리 정보를 기반으로 운전자의 기존 운행 데이터를 획득한 AI 모듈이 획득한 정보 를 기반으로 학습을 수행하고, 특정 상황에서 운전자가 돌발행동을 할지 여부를 판단할 수 있다. 이와 같이 운 행 정보 메시지에 포함된 정보는 AI 모듈이 기존 운전 히스토리 정보를 기반으로 현재 상황을 고려하여 도출한 정보일 수 있다. 도 5는 본 명세서의 일 실시 예에 따른 연산장치가 타 차량에서 운행 정보를 수신한 경우 이에 대응한 동작을 설명한 순서도이다. 도 5를 참조하면, 차량의 연산장치가 타 차량으로부터 수신한 운행 정보 메시지를 기반으로 차량을 제어하는 방 법이 도시된다. 단계 510에서 연산장치는 타 차량으로부터 운행 정보 메시지를 수신할 수 있다. 실시 예에서 상기 운행 정보 메 시지는 타 차량의 운행과 관련된 정보를 포함할 수 있다. 일 예로 운행과 관련된 정보는 타 차량의 현재 운행 정보와 타 차량의 속도 및 방향 중 적어도 하나의 변경 정보를 포함할 수 있다. 일 예로 운행 정보 메시지는 타 차량의 돌발 행동이 일어날 가능성, 상기 돌발 행동에 따라 예상되는 타 차량의 운행 방향 및 속도 정보 중 적어도 하나를 포함할 수 있으며, 상기 운행 방향 및 속도 정보는 타 차량의 현재 위치 및 속도를 기반으로 변경되는 방향 및 속도에 대한 벡터 정보를 포함할 수 있다. 단계 515에서 연산장치는 상기 수신한 정보를 기반으로 타 차량의 운행 정보가 연산장치에 대응하는 차량의 주 행에 영향이 있는지 여부를 확인할 수 있다. 일 예로 상기 운행 정보 메시지에 포함된 정보를 기반으로 타 차량 이 이동 가능한 위치와 현재 연산장치에 대응하는 차량의 위치가 대응되는 경우 현재 주행에 영향이 있는 것으 로 판단할 수 있다. 또한 일 예에서 차량이 수동 주행 모드일 경우 운전자의 시야 상에 상기 타 차량이 이동해 서 들어오게 될 경우 현재 주행에 영향이 있는 것으로 판단할 수도 있다. 단계 520에서 연산장치는 연산장치에 대응하는 차량이 자율주행 모드인지 확인할 수 있다. 자율 주행 모드일 경우 단계 525에서 연산장치는 운행 정보 메시지를 기반으로 연산장치에 대응하는 차량의 조 작을 수행할 수 있다. 또한 이와 관련된 정보를 탑승객에 제공할 수 있다. 실시 예에서 탑승객에 정보를 제공하 는 동작은 선택적으로 수행될 수 있다. 수동 주행 모드일 경우 단계 530에서 연산장치는 운행 정보 메시지를 기반으로 타 차량과 관련된 정보를 운전자 에게 제공할 수 있다. 일 예로 연산장치는 운행 정보 메시지를 기반으로 타 차량이 이동 가능한 방향과 속도에 대한 정보를 사용자에게 디스플레이 하여 제공할 수 있다. 일 예로 연산장치는 운행 정보 메시지를 기반으로 타 차량의 이동이 예상되는 경로 상에 증강 현실을 통해 차량의 이미지를 표시해 줄 수 있다. 실시 예에서 타 차량으로부터 수신된 운행 정보 메시지는 타 차량으로부터 직접 수신된 메시지일 수 있으며, 이 때 네트워크가 메시지 전송을 중계할 수 있다. 또한 실시 예에서 운행 정보 메시지는 별도의 서버로부터 수신될 수 있다. 상기 별도의 서버는 타 차량의 운행과 관련된 정보를 기반으로 운행 정보 메시지를 생성할 수 있다. 또한 실시 예에서 차량의 연산장치는 다른 차량으로부터 운행 정보 메시지를 수신하고, 해당 메시지를 기반으로 다른 차량이 돌발행동을 할 가능성이 있는지 여부를 판단할 수 있다. 일 예로 운행 정보 메시지는 다른 차량의 진행 경로에 대한 정보 및 다른 차량의 운전 히스토리 정보를 포함하고, 이를 수신한 차량은 상기 주행 정보 메 시지를 기반으로 다른 차량의 돌발행동 가능성을 판단할 수 있다. 또한 이와 같은 판단 결과를 기반으로 차량의 운전자에게 관련된 정보를 제공하는 동작 및 다른 차량 혹은 서버에 판단 결과에 관련된 정보를 전송하는 동작 중 적어도 하나를 수행할 수 있다. 또한 실시 예에서 차량의 연산 장치는 운행 정보 메시지를 수신하고, 실제로 운행 정보 메시지를 전송한 차량이 돌발행동을 수행하였는지 여부를 감지할 수 있다. 일 예로 운행 정보 메시지를 수신한 차량의 센서를 통해 운행 정보 메시지를 전송한 차량이 돌발행동을 하는지 여부를 확인할 수 있다. 운행 정보 메시지를 수신한 차량에 대 응하는 연산장치는 이와 같은 정보를 기반으로 피드백 정보를 운행 정보 메시지를 전송한 차량에 대응하는 연산 장치에 전송할 수 있다. 또한 상기 피드백 정보는 별도의 서버에 전송될 수 있다. 이와 같은 피드백 정보를 기 반으로 운전자의 운전 히스토리 정보가 업데이트 될 수 있으며, 업데이트된 히스토리 정보를 기반으로 차후 돌 발행동이 일어날지 여부가 판단될 수 있다. 도 6은 본 명세서의 일 실시 예에 따른 돌발 상황을 설명하기 위한 도면이다. 도 6을 참조하면 주행중인 차량이 안내되는 경로 인근에서 급격한 차선 변경이 일어날 수 있는 환경이 도시된다. 실시 예에서 차량은 1차선에서 주행중이고, 차량의 네비게이션에서 안내되는 경로는 도로의 출구 방 향인 경우이다. 차량이 안내되는 경로로 진행하기 위해서는 1차선에서 출구 방향으로 급격한 차선 변 경이 일어날 수 있다. 이때 차량과 관련된 연산장치는 차량의 현재 위치, 안내되는 경로 정보, 차량의 현재 속도 및 차량의 운전 히스토리 정보를 기반으로 차량이 차후 이동할 방향을 예상할 수 있다. 이 때 차량은 출구 방향으로 진입할 수 있도록 속도를 줄이고 급격히 차선을 변경할 것으로 예상되며, 연산장치는 이와 관련된 정보를 포함 하는 운행 정보 메시지를 생성하여 다른 노드에 전송할 수 있다. 또한 실시 예에서 차량의 현재 위치, 안내되는 경로 정보, 차량의 현재 속도 및 차량의 운전 히스토리 정 보를 기반으로 급격한 차선 변경이 일어날 가능성을 예측할 수 있다. 실시 예에서 이와 같은 가능성을 기반으로 다른 노드에 운행 정보 메시지를 전송할지 여부를 결정할 수 있다. 또한 실시 예에서 운행 정보 메시지에 가능 성에 대한 정보도 포함시켜 다른 노드에 전송할 수 있다. 도 7은 본 명세서의 다른 실시 예에 따른 돌발 상황을 설명하기 위한 도면이다. 도 7을 참조하면, 주행중인 차량이 안내되는 경로 인근에서 급격한 차선 변경이 일어날 수 있는 환경이 도시된 다. 실시 예에서 차량은 차량의 네비게이션에서 안내되는 경로는 도로의 출구로 나가지 못하고 지나친 상 태이다. 이 경우 차량이 급정거 할 수 있다. 이때 차량과 관련된 연산장치는 차량의 현재 위치, 안내되는 경로 정보, 차량의 현재 속도 및 차량의 운전 히스토리 정보를 기반으로 차량 차후 속도 변화를 예측할 수 있다. 실시 예에서 차량이 급제동 할 것으로 예상되는 경우, 연산장치는 이와 관련된 정보를 포함하는 운행 정보 메시지를 생성하여 다른 노드에 전송 할 수 있다. 또한 실시 예에서 차량의 현재 위치, 안내되는 경로 정보, 차량의 현재 속도 및 차량의 운전 히스토리 정 보를 기반으로 급격한 속도 변경이 일어날 가능성을 예측할 수 있다. 실시 예에서 이와 같은 가능성을 기반으로 다른 노드에 운행 정보 메시지를 전송할지 여부를 결정할 수 있다. 또한 실시 예에서 운행 정보 메시지에 가능 성에 대한 정보도 포함시켜 다른 노드에 전송할 수 있다. 또한 실시 예에서 차량이 주행하는 현재 도로가 특정 도로에 해당하는 경우 위의 실시 예에 대응하는 동작을 수 행할 수 있다. 보다 구체적으로 상기 도로가 고속도로에 해당하고 도로의 출구가 고속도로를 벗어나거나, 다른 고속도로로 진입하는 진출입로에 해당하는 경우 위의 실시 예에 대응하는 동작을 수행할 수 있다. 도 8은 본 명세서의 일 실시 예에 따른 네비게이션의 정보에 따른 돌발 상황을 설명하기 위한 도면이다. 도 8을 참조하면 네비게이션의 정보와 실제 도로의 정보가 다른 경우가 도시되고 있다. 실시 예에서 좌측 지도는 네비게이션에 안내되는 지도 정보이고, 현재 GPS 상 차량의 위치이 지도상에 도 시되나 현재 차량이 운행되고 있는 도로의 정보가 업데이트 되지 않아서, 네비게이션이 안내하는 지도상에는 도 로가 아닌 위에 차량의 위치가 도시된다. 실시 예에서 우측 지도는 실제 차량이 주행하고 있는 도로를 도시한 지도이다. 실시 예에서 도로 은 신규 개통된 도로로 네비게이션에 업데이트 되지 않은 상항이다. 실시 예에서 차량의 운전자는 네비게이션에서 안내되지 않는 도로를 주행하게 되고, 이 경우 운전자 는 안내 정보의 도움을 받지 못하는바, 평소에 비해 돌발 행동을 할 가능성이 보다 높아지게 된다. 이 경우 연 산장치는 돌발행동의 가능성이 존재한다는 내용의 운행 정보 메시지를 다른 노드에 전달할 수 있다. 실시 예에 서 이와 같은 메시지를 전달받은 타 차량에 대응하는 연산장치는 해당 차량을 주의 차량으로 인식할 수 있 다. 이 경우 돌발행동의 가능성이 높은바 타 차량에 대응하는 연산장치는 해당 차량과의 거리를 다른 차량 에 비해 보다 넓게 유지하는 등의 동작을 할 수 있도록 정보를 제공할 수 있다. 실시 예에서 이와 같은 환경에서 돌발 상황이 발생할지에 대한 가능성은 차량 운전자의 운전 경험에 대한 정보 를 기반으로 결정될 수 있다. 실시 예에서 연산장치는 차량의 운전자가 운전 경력이 오래된 경우 운전자의 운전 경력이 오래 되지 않은 경우와 대비하여 동일한 환경에서도 돌발 상황이 발생할 가능성을 낮게 예상할 수 있다. 또한 실시 예에서 연산장치는 차량의 운전자가 동일한 경로 상에서 운전한 경험이 특정 횟수 이상 될 경우 돌발 상황이 발생할 가능성을 낮게 예측할 수 있다. 이 때 특정 횟수는 차량의 운전자의 운전 경험에 따라 다르게 판 단할 수 있다. 도 9는 본 명세서의 다른 실시 예에 따른 운전자의 히스토리 정보를 기반으로 다른 차량에 정보를 제공하는 방 법을 나타내는 순서도이다. 도 9를 참조하면, 차량과 대응되는 연산장치가 주행 히스토리를 기반으로 운행 정보 메시지를 생성하고, 다른 차량에 전송하는 방법이 개시된다. 단계 910에서 연산장치는 현재 차량이 주행중인 지역 정보를 확인할 수 있다. 보다 구체적으로 실시 예에서 연 산장치는 현재 차량이 위치하는 지역 및 주행 경로와 관련된 정보를 기반으로 지역 정보를 확인할 수 있다. 단계 915에서 연산장치는 확인된 지역에 대해 운전자의 주행 히스토리 정보를 확인할 수 있다. 실시 예에서 주 행 히스토리 정보는 현재 운전자가 해당 지역에서 운전을 해본 경험이 있는지 여부를 포함할 수 있으며, 경험의 횟수, 가장 최근 운전한 시기에 대한 정보도 확인할 수 있다. 상기 정보는 연산장치에 대응하는 저장부에 저장된 정보 또는 외부의 노드에 저장된 정보를 기반으로 확인될 수 있다. 단계 920에서 연산장치는 운전자가 확인된 주행 지역에서 운전 횟수가 특정 횟수 이하인지를 판단할 수 있다. 실시 예의 연산장치는 이전 단계에서 확인한 정보 중 적어도 일부를 기반으로 주행중인 지역에서 운전자가 이전 에 운전을 한 횟수가 특정한 횟수 이하인지 판단할 수 있다. 실시 예에서 특정한 횟수는 확인된 지역과 관련된 정보에 따라 결정될 수 있다. 일 예로 사고가 빈번하거나, 연결된 도로의 개수가 일정 개수 이상인 경우 특정 횟수를 다른 지역에 비해 높게 설정할 수 있다. 또한 추가적으로 도로가 개통 된 것과 상황이 있을 경우에도 특 정 횟수를 다른 지역에 비해 높게 설정할 수 있다. 또한 실시 예에서 도로의 복잡도가 일정 이상일 경우 특정 횟수를 다른 지역에 비해 높게 설정할 수 있다. 일정 횟수 이하가 아닐 경우, 운전자가 해당 지역에서 운전이 익숙하다고 판단하고 계속 해당 지역에 대한 모니 터링을 수행할 수 있다. 일정 횟수 이하일 경우 단계 925에서 연산장치는 현재 주행하는 지역의 도로정보, 안내되는 경로정보 및 현재 안내 경로상에서 차량의 주행 정보를 확인할 수 있다. 실시 예에서 지역의 도로정보는 도로의 위치 정보 및 도 로의 교통량 정보 중 하나를 포함할 수 있다. 현재 안내 경로상에서 차량의 주행 정보는 차량의 위치, 도로에서 차량이 위치하는 차선의 위치 및 차량의 속도 중 적어도 하나를 포함할 수 있다. 단계 930에서 연산장치는 확인된 정보를 기반으로 운행 정보 메시지를 확인할 수 있다. 또한 실시 예에서 연산 장치는 운전자의 주행 히스토리 정보를 고려하여 운행 정보 메시지를 확인할 수 있다. 실시 예에서 운행 정보 메시지는 차량이 운행되는 정보를 포함할 수 있다. 일 예로 운전자가 익숙하지 않은 도로에서 운전할 경우 돌발 행동이 일어날 가능성이 높고 이와 같은 정보가 운행 정보 메시지에 포함될 수 있다. 또한 운전자의 주행 히스 토리 정보를 기반으로 확인된 익숙하지 않은 도로에서 통상적으로 했던 행동 정보 역시 운행 정보 메시지에 포 함될 수 있다. 또한 실시 예에서 이전에 확인한 정보 중 적어도 일부를 기반으로 돌발행동을 할 가능성에 대한 정보 역시 운행 정보 메시지에 포함될 수 있다. 단계 935에서 연산장치는 운행 정보 메시지가 전송될 대상 차량을 확인할 수 있다. 실시 예에서 별도의 확인 절 차 없이 인접한 차량 전부에 운행 정보 메시지를 브로드 캐스트 할 수 있다. 또한 실시 예에서 이전 단계에서 확인된 정보 중 적어도 일부를 기반으로 대상 차량을 확인할 수 있다. 일 예로 상기 운행 정보 메시지 상에 포 함된 정보에 의해 영향을 받을 수 있는 차량을 대상 차량으로 확인할 수 있다. 단계 940에서 연산장치는 확인된 대상 차량에 운행 정보 메시지를 전송할 수 있다. 실시 예에서 연산장치는 운 행 정보 메시지를 반복적으로 대상 차량에 전송할 수 있다. 이와 같이 운전자의 경험에 기반하여 운행 정보 메시지를 생성하고 이를 기반으로 다른 차량에 운행 정보 메시 지를 제공함으로써 해당 지역에서 경험이 적은 운전자의 운전으로 인해 다른 차량에게 영향을 끼칠 수 있는지 여부에 대한 정보를 다른 차량이 미리 알 수 있게 된다. 또한 이와 같은 정보를 기반으로 다른 차량의 운전자는 미리 대응하는 운전을 할 수 있으며, 자율 주행의 경우에는 이와 같은 정보를 반영하여 자율 주행과 관련된 파 라메터를 조절할 수 있다. 도 10은 본 명세서의 또 다른 실시 예에 따른 운전자의 운전 패턴 정보를 기반으로 다른 차량에 정보를 제공하 는 방법을 나타내는 순서도이다. 도 10을 참조하면, 연산장치가 운전자에 대응하는 운전 패턴 정보를 확인하고, 확인된 정보를 기반으로 운행정 보 메시지를 전송하는 방법이 개시된다. 단계 1010에서 연산장치는 차량이 안내되는 경로 정보 및 현재 주행 위치에 대한 정보를 확인할 수 있다. 안내 되는 경로는 목적지까지의 경로 정보를 포함할 수 있다. 주행위치는 목적지와의 위치관계를 포함할 수 있다. 또 한 실시 예에서 주행위치는 경로 상에서 다음으로 안내되는 도로와의 위치 관계 정보를 포함할 수 있다. 일 예 로 직진 후 유턴을 해서 돌아온 다음 다시 우회전 해야 하는 경로 안내 정보일 경우 다시 우회전해서 들어가는 도로 정보와 현재 차량의 위치 관계 정보가 주행 위치 정보에 포함될 수 있다. 단계 1015에서 연산장치는 운전자의 운전 패턴 정보를 확인할 수 있다. 실시 예에서 운전 패턴 정보는 운전자가 현재 위치한 도로와 같은 경우에 정해진 경로를 벗어나서 운전하는 경향에 대한 정보를 포함할 수 있다. 또한 운전 패턴 정보는 운전자가 교통 법규를 위반하는 경향에 대한 정보를 포함할 수 있다. 단계 1020에서 연산장치는 이전 단계에서 확인 정보 중 적어도 하나를 기반으로 해당 위치에서 경로 안내 및 교 통 법규 중 적어도 하나를 위반할 가능성이 특정 값 이상인지를 판단할 수 있다. 실시 예에서 연산장치는 운전자의 운전 히스토리 정보를 기반으로 해당 주행 위치에서 교통 법규를 위반하여 주행할 가능성을 판단할 수 있 다. 실시 예에서 교통 법규를 위반하는 것은 중앙선 침범, 허용되지 않는 좌회전 또는 우회전 중 적어도 하나를 포함할 수 있으며, 열거되지 않았지만 다른 차량이 예상하기 어려운 교통법규 위반행위를 포함할 수 있다. 특정 값 이상이 아닐 경우, 연산장치는 계속 모니터링을 수행할 수 있다. 특정 값 이상이라고 판단될 경우, 단계 1025에서 연산장치는 획득된 정보 및 위반 가능성 중 적어도 하나를 기 반으로 운행 정보 메시지를 생성할 수 있다. 보다 구체적으로 운행 정보 메시지는 상기 획득한 정보를 기반으로 차량의 운전자가 운행할 수 있는 방향 및 속도 정보 중 적어도 하나를 포함할 수 있다. 실시 예에서 운행 정보 메시지는 해당 방향으로 운행할 수 있는 가능성에 대한 정보를 포함할 수 있다. 단계 1030에서 연산장치는 운행 정보 메시지가 전송될 대상 차량을 확인할 수 있다. 실시 예에서 대상 차량은 운전자의 차량과 일정 거리 범위 내에 있는 차량을 포함할 수 있다. 또한 상기 운행 정보 메시지에 포함된 정보 에 대응하게 차량이 운행될 경우 운행에 영향을 받을 수 있는 다른 차량도 대상 차량에 포함될 수 있다. 단계 1035에서 연산장치는 확인된 대상 차량에 운행 정보 메시지를 전송할 수 있다. 이와 같이 현재 차량이 위치하는 영역과 운전자의 운전 패턴에 대한 정보를 기반으로 다른 차량이 예상하기 어 려운 운행을 할 가능성을 판단하고 이와 같은 정보를 다른 차량에 제공함으로써 사고를 예방할 수 있다. 도 11은 본 명세서의 실시 예에 따른 연산장치를 설명하기 위한 도면이다. 도 11을 참조하면, 실시 예의 연산장치는 통신부, 센서부, 저장부, 네비게이션부 및 연산장치제어부을 포함할 수 있다. 통신부은 연산장치와 다른 노드와 정보를 송수신할 수 있다. 일 예로 통신부를 통해 연산장치와 대 응하는 차량, 다른 차량, 셀룰러 통신 시스템 및 서버 중 적어도 하나와 통신을 수행할 수 있다. 또한 통신부 는 GPS와 연동을 통해 차량의 위치를 획득하기 위한 정보를 수신할 수 있다. 센서부는 연산장치와 대응하는 차량과 관련된 정보를 수신할 수 있다. 보다 구체적으로 센서부는 이미지 정보, 소리 정보, 위치 정보 및 가속도 정보를 획득할 수 있는 센서를 포함한다. 이와 같은 센서부 를 통해 연산장치는 차량과 관련된 정보를 실시간으로 획득할 수 있다. 저장부는 비 휘발성 메모리를 포함할 수 있으며, 연산장치와 관련된 정보를 저장할 수 있다. 저장부 는 연산장치를 제어하기 위한 정보, 통신부를 통해 송수신되는 정보 및 네비게이션부를 구동 하기 위한 정보 중 적어도 하나를 저장할 수 있다. 또한 이외에도 실시 예에서 연산장치의 동작에 대응하는 정 보를 저장할 수 있다. 네비게이션부는 차량에 경로 안내를 제공할 수 있으며, 주변 교통 정보를 제공할 수 있다. 실시 예에서 네비게이션부는 통상적인 네비게이션 시스템일 수 있으며, 추가적으로 연산장치 제어부의 제어를 받으며 연산장치의 다른 노드로부터 수신된 정보를 활용하여 사용자에게 차량 운행과 관련된 정보를 제공할 수 있다. 연산장치제어부는 연산장치 동작 전반을 제어할 수 있으며, 명세서의 실시 예에서 설명된 연산장치와 관 련된 동작 전반을 수행할 수 있다. 한편 실시 예에서 네비게이션부는 연산장치제어부의 제어에 의해 소프트웨어적으로 구현될 수도 있 다. 한편, 본 명세서와 도면에는 본 발명의 바람직한 실시 예에 대하여 개시하였으며, 비록 특정 용어들이 사용되었 으나, 이는 단지 본 발명의 기술 내용을 쉽게 설명하고 발명의 이해를 돕기 위한 일반적인 의미에서 사용된 것 이지, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시 예 외에도 본 발명의 기술적 사상에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 자명한 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2019-0100947", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 명세서의 일 실시 예에 따른 AI 장치를 나타낸다. 도 2는 본 명세서의 일 실시 예에 따른 AI 서버를 나타낸다. 도 3은 본 명세서의 일 실시 예에 따른 AI 시스템을 나타낸다. 도 4는 본 명세서의 일 실시 예에 따른 연산장치에서 운행 관련 정보를 확인하고 운전자의 돌발 행동이 예측하 고, 이와 같은 정보를 다른 차량에 제공하는 방법을 나타내는 순서도이다. 도 5는 본 명세서의 일 실시 예에 따른 연산장치가 타 차량에서 운행 정보를 수신한 경우 이에 대응한 동작을 설명한 순서도이다. 도 6은 본 명세서의 일 실시 예에 따른 돌발 상황을 설명하기 위한 도면이다. 도 7은 본 명세서의 다른 실시 예에 따른 돌발 상황을 설명하기 위한 도면이다. 도 8은 본 명세서의 일 실시 예에 따른 네비게이션의 정보에 따른 돌발 상황을 설명하기 위한 도면이다. 도 9는 본 명세서의 다른 실시 예에 따른 운전자의 히스토리 정보를 기반으로 다른 차량에 정보를 제공하는 방 법을 나타내는 순서도이다. 도 10은 본 명세서의 또 다른 실시 예에 따른 운전자의 운전 패턴 정보를 기반으로 다른 차량에 정보를 제공하 는 방법을 나타내는 순서도이다. 도 11은 본 명세서의 실시 예에 따른 연산장치를 설명하기 위한 도면이다."}
