{"patent_id": "10-2023-0056136", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0071996", "출원번호": "10-2023-0056136", "발명의 명칭": "선박의 운항을 최적화하는 방법 및 장치", "출원인": "에이치디한국조선해양 주식회사", "발명자": "고윤애"}}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "선박의 운항을 최적화하는 방법에 있어서,선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 상기 선박의 운항 경로에 관한 추천 항해정보를 생성하는 단계;상기 추천 항해 정보에 기초하여, 상기 선박의 BOG 발생량 및 상기 선박의 탱크 압력 값을 예측하는 단계; 및상기 BOG 발생량 및 상기 탱크 압력 값에 기초하여, 상기 선박의 동작 제어에 관련된 최적 항해 정보를 획득하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 운항 계획 정보는,출발시간, 도착시간 및 장소의 위치 정보를 포함하고,상기 생성하는 단계는,상기 운항 계획 정보에 기초하여, 상기 선박의 운항 경로에 관한 환경 정보를 획득하는 단계; 및상기 운항 계획 정보 및 상기 환경 정보에 기초하여, 상기 선박의 운항 경로에 관한 연료 소모량 및 BOG 발생량을 기준으로 상기 추천 항해 정보를 생성하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 추천 항해 정보는,상기 운항 경로에 관한 항해 구간별 위치 정보, 항해 구간별 속도 정보 및 항해 구간별 환경 정보 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 예측하는 단계는,상기 항해 구간별 위치 정보, 상기 항해 구간별 속도 정보 및 상기 항해 구간별 환경 정보에 기초하여, 상기 선박의 BOG 발생량을 예측하는 단계; 및상기 항해 구간별 위치 정보, 상기 항해 구간별 속도 정보, 상기 항해 구간별 환경 정보 및 기 설정된 액화가스소모량에 기초하여, 상기 선박의 탱크 압력 값을 예측하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 최적 항해 정보를 획득하는 단계는,상기 BOG 발생량 및 상기 탱크 압력 값에 기초하여, 상기 선박의 동작 제어에 관련된 제n 차 중간 항해 정보를생성하는 단계; 및상기 제n 차 중간 항해 정보 및 제n+1 차 중간 항해 정보의 비교에 기초하여, 기 설정된 임계 값을 기준으로 상공개특허 10-2024-0071996-3-기 제n+1 차 중간 항해 정보를 상기 최적 항해 정보로 확정하는 단계;를 포함하고,상기 n+1 차 중간 항해 정보는,상기 n 차 중간 항해 정보에 포함된 항해 구간별 속도 정보 및 액화가스 소모량 중 적어도 하나의 갱신 값에 기초하여 생성되는 것이고,상기 n은, 1 이상의 자연수인, 방법."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 확정하는 단계는,상기 제n 차 중간 항해 정보 및 상기 제n+1 차 중간 항해 정보에 기초하여 산출된 차이 값이 기 설정된 임계 값보다 이하인 것에 응답하여, 상기 제n+1 차 중간 항해 정보를 상기 최적 항해 정보로 확정하는 단계; 및상기 차이 값이 기 설정된 임계 값을 초과하는 것에 응답하여, 상기 제n+1 차 중간 항해 정보에 포함된 항해 구간별 속도 정보 및 액화가스 소모량 중 적어도 하나를 갱신함으로써 제n+2 차 중간 항해 정보를 생성하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 최적 항해 정보는,상기 선박의 BOG 발생량, 상기 선박의 탱크 압력 값, 상기 선박의 항해 구간별 속도 정보, 상기 선박의 액화가스 소모량 및 상기 선박에 설치된 장비의 사용량 중 적어도 하나를 포함하는 것인, 방법."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 최적 항해 정보를 이용하여 기 설정된 운전 방식으로 상기 선박을 제어하는 단계;를 더 포함하고,상기 운전 방식은,상기 선박의 액화가스 소모량을 최소화하는 운전 방식을 포함하는, 방법."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 따른 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "적어도 하나의 메모리; 및적어도 하나의 프로세서;를 포함하고,상기 프로세서는,선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 상기 선박의 운항 경로에 관한 추천 항해정보를 생성하고,상기 추천 항해 정보에 기초하여, 상기 선박의 BOG 발생량 및 상기 선박의 탱크 압력 값을 예측하고,상기 BOG 발생량 및 상기 탱크 압력 값에 기초하여, 상기 선박의 동작 제어에 관련된 최적 항해 정보를 획득하는, 컴퓨팅 장치."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 운항 계획 정보는,공개특허 10-2024-0071996-4-출발시간, 도착시간 및 장소의 위치 정보를 포함하고,상기 프로세서는,상기 운항 계획 정보에 기초하여, 상기 선박의 운항 경로에 관한 환경 정보를 획득하고,상기 운항 계획 정보 및 상기 환경 정보에 기초하여, 상기 선박의 운항 경로에 관한 연료 소모량 및 BOG 발생량을 기준으로 상기 추천 항해 정보를 생성하는, 컴퓨팅 장치."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10 항에 있어서,상기 추천 항해 정보는,상기 운항 경로에 관한 항해 구간별 위치 정보, 항해 구간별 속도 정보 및 항해 구간별 환경 정보 중 적어도 하나를 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 프로세서는,상기 항해 구간별 위치 정보, 상기 항해 구간별 속도 정보 및 상기 항해 구간별 환경 정보에 기초하여, 상기 선박의 BOG 발생량을 예측하고,상기 항해 구간별 위치 정보, 상기 항해 구간별 속도 정보, 상기 항해 구간별 환경 정보 및 기 설정된 액화가스소모량에 기초하여, 상기 선박의 탱크 압력 값을 예측하는, 컴퓨팅 장치."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10 항에 있어서,상기 프로세서는,상기 BOG 발생량 및 탱크 압력 값에 기초하여, 상기 선박의 동작 제어에 관련된 제n 차 중간 항해 정보를 생성하고,상기 제n 차 중간 항해 정보 및 제n+1 차 중간 항해 정보의 비교에 기초하여, 기 설정된 임계 값을 기준으로 상기 제n+1 차 중간 항해 정보를 상기 최적 항해 정보로 확정하고,상기 n+1 차 중간 항해 정보는,상기 n 차 중간 항해 정보에 포함된 항해 구간별 속도 정보 및 액화가스 소모량 중 적어도 하나의 갱신 값에 기초하여 생성되고,상기 n은, 1 이상의 자연수인, 컴퓨팅 장치."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서,상기 프로세서는,상기 제n 차 중간 항해 정보 및 제n+1 차 중간 항해 정보에 기초하여 산출된 차이 값이 기 설정된 임계 값보다이하인 것에 응답하여, 상기 제n+1 차 중간 항해 정보를 상기 최적 항해 정보로 확정하고,상기 차이 값이 기 설정된 임계 값을 초과하는 것에 응답하여, 상기 제n+1 차 중간 항해 정보에 포함된 항해 구간별 속도 정보 및 액화가스 소모량 중 적어도 하나를 갱신함으로써 제n+2 차 중간 항해 정보를 생성하는, 컴퓨팅 장치."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10 항에 있어서,공개특허 10-2024-0071996-5-상기 최적 항해 정보는,상기 선박의 BOG 발생량, 상기 선박의 탱크 압력 값, 상기 선박의 항해 구간별 속도 정보, 상기 선박의 액화가스 소모량 및 상기 선박에 설치된 장비의 사용량 중 적어도 하나를 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2023-0056136", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10 항에 있어서,상기 프로세서는,상기 최적 항해 정보를 이용하여 기 설정된 운전 방식으로 상기 선박을 제어하고,상기 운전 방식은,상기 선박의 액화가스 소모량을 최소화하는 운전 방식을 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 선박의 운항을 최적화하는 방법 및 장치에 관한 것이다. 본 개시의 일 실시 예에 따른 방법은, 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 선박의 운항 경로에 관한 추천 항해 정보를 생성하 고, 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측하고, BOG 발생량 및 탱크 압 력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보를 획득할 수 있다."}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 선박의 운항을 최적화하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 선박이 액화가스를 운반하는 데 있어서 액화가스 탱크에서 자연적으로 기화되는 가스가 발생하는데, 이것을 BOG(Boil-Off Gas)라고 한다. BOG가 발생하면 탱크 내부의 압력이 상승하고, 탱크 내부의 압력이 상승하면 액화가스 탱크의 안전성이 감소하 여 탱크가 폭발할 위험이 있다. 이러한 위험을 방지하기 위해 BOG를 방출하는데, 이 과정에서 환경오염을 일으 킬 수 있으며 액화가스를 낭비하게 된다. 한편, 탱크 내부의 압력을 유지하기 위해 BOG를 선박의 추진 엔진 또는 발전 엔진의 연료로 사용하고, 연료의 사용에도 불구하고 남는 경우에는 재액화 장치를 통해 액화하여 화물 탱크에 저장하거나, 연소 장치(Gas combustion unit, GCU)를 통해 제거할 수 있다. 따라서, 액화가스를 운반하는 동안 발생하는 BOG 발생량, 선박의 속도, 전력량, BOG 처리 방식, 운항 경로에 따 른 해역의 위치나 기후 변화 등에 따라서 선박의 운항 비용은 매우 상이하여, 경제적인 운항을 계획함에 있어서 예측하기 어려운 문제점이 있다. 특히, 선박마다 화물 운영 시스템(Cargo handling system, CHS)가 상이하고, 경제적인 운전 방식을 분석하기에 위와 같은 복잡성이 따르며, 운항 경로에 따라 BOG 발생량이 다른 바, 선박의 운전자에게 있어 액화가스 소모량을 최소화하는 최적의 운전을 행하기 어렵다는 문제점이 있다. 이에 따라, 액 화가스 소모량을 최소화하는 운전 방식으로 액화가스 운반선을 효율적으로 제어하기 위한 방법의 필요성이 제기 된다."}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "전술한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다."}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 선박의 운항을 최적화하는 방법 및 장치를 제공하는 데 있다. 또한, 상기 방법을 컴퓨터에서 실행시 키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공하는 데 있다. 본 발명이 해결하고자 하는 과제는 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 발명의 다른 과 제 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시 예에 의해보다 분명하게 이해될 것이다. 또한, 본 발명이 해결하고자 하는 과제 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 개시의 제1 측면은, 선박의 운항을 최적화하는 방 법에 있어서, 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 선박의 운항 경로에 관한 추 천 항해 정보를 생성하는 단계; 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측 하는 단계; 및 BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보를 획득하는 단계;를 포함하는, 방법을 제공할 수 있다. 본 개시의 제2 측면은, 적어도 하나의 메모리; 및 적어도 하나의 프로세서;를 포함하고, 프로세서는, 선박의 출 발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 선박의 운항 경로에 관한 추천 항해 정보를 생성하 고, 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측하고, BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보를 획득하는, 컴퓨팅 장치를 제공할 수 있다. 본 개시의 제3 측면은, 제1 측면에 따른 방법을 컴퓨터에서 실행하기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공할 수 있다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램이 저장된 컴퓨터로 판독 가능한 기록매체가 더 제공될 수 있다. 전술한 것 외의 다른 측면, 특징, 이점이 이하의 도면, 특허청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 개시의 과제 해결 수단에 의하면, 본 개시에서는 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 선박의 운항 경로에 관한 추천 항해 정보를 생성하고, 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측하고, BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보를 획득함으로써, 선박의 액화가스 소모량을 최소화하는 경제적 운항이 가능하다. 또한, 본 개시의 과제 해결 수단에 의하면, 선박의 운항 경로에 관한 위치별 기상기후 정보, 조류 정보, 해상 정보 및 해류 정보 중 하나 이상을 포함하는 환경 정보에 기초하여 BOG 발생량 및 탱크 압력 값을 예측하고, 예 측된 BOG 발생량 및 탱크 압력 값에 기초하여 최적 항해 정보를 획득하여 전체 항해 운전을 계산함으로써, 선박 의 출발지에서 도착지까지의 화물 관리의 방향성을 제시할 수 있고, 예측한 탱크 압력 값에 기초하여 안전한 화 물 처리를 가능하게 할 수 있다. 또한, 본 개시의 과제 해결 수단에 의하면, 운항 경로에 관한 선박 속도 및 액화가스 소모량을 갱신하여 최적 항해 정보를 획득함으로써, 운전자에게 선박의 운전 가이드를 제공하여 운항을 보조하고, GCU 소각량 및 엔진의 연료 가스량을 낮춤으로써 탄소세 저감 효과를 제공할 수 있다."}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 다양한 실시예가 첨부된 도면과 연관되어 기재된다. 본 개시의 다양한 실시예는 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기 재되어 있다. 그러나 이는 본 개시의 다양한 실시예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 개 시의 다양한 실시예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 개시의 다양한 실시예에서 사용될 수 있는 \"포함한다.\" 또는 \"포함할 수 있다.\" 등의 표현은 개시 (disclosure)된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 개시의 다양한 실시예에서, \"포함하다.\" 또는 \"가지다.\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것 이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존 재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 다양한 실시예에서 \"또는\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 개시의 다양한 실시예에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 실시예들의 다 양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구 성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분하 기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 개시의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1 구성요소 는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 본 개시의 실시 예에서 \"모듈\", \"유닛\", \"부(part)\" 등과 같은 용어는 적어도 하나의 기능이나 동작을 수행하는 구성요소를 지칭하기 위한 용어이며, 이러한 구성요소는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\", \"유닛\", \"부(part)\" 등은 각각이 개별적인 특정 한 하드웨어로 구현될 필요가 있는 경우를 제외하고는, 적어도 하나의 모듈이나 칩으로 일체화되어 적어도 하나 의 프로세서로 구현될 수 있다. 본 개시의 다양한 실시예에서 사용한 용어는 단지 특정일 실시예를 설명하기 위해 사용된 것으로, 본 개시의 다 양한 실시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현 을 포함한다.다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시의 다양한 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 개시의 다양한 실시예에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명에서, 액화가스는, 액화천연가스(LNG) 또는 액화석유가스(LPG), 에틸렌, 암모니아, 수소 등과 같이 일반 적으로 액체 상태로 보관되는 모든 가스 연료를 포괄하는 의미로 사용될 수 있으며, 가열이나 가압에 의해 액체 상태가 아닌 경우 등도 편의상 액화가스로 표현할 수 있다. 이는 증발가스도 마찬가지로 적용될 수 있다. 여기에서, LNG는 편의상 액체 상태인 NG(Natural Gas)뿐만 아니라, 초임계 상태 등인 천연가스(NG)를 모두 포괄 하는 의미로 사용될 수 있으며, 증발가스는 기체 상태의 증발가스뿐만 아니라 액화된 증발가스를 포함하는 의미 로 사용될 수 있다. 또한, 가스 소모량은, 액화가스의 소모량 및 BOG의 소모량을 모두 포괄하는 의미로 사용될 수 있으며, 액화가스 의 소모량 또는 BOG의 소모량 각각을 지칭하는 의미로 사용될 수도 있다. 여기에서, BOG(Boil-Off Gas)란, 선박의 탱크에서 자연적으로 증발 및 기화하는 천연가스를 의미한다. 일반적으 로, 액화가스는 초저온 액체 상태로 운반되는데 액화가스를 저장하는 선박의 탱크들은 초저온을 유지하기 위해 단열구조로 이루어져 있다. 그러나 탱크의 외부의 온도는 약 40℃정도로 선박의 탱크의 내·외부의 온도차이는 약 200℃ 이상 차이가 나기 때문에 외부로부터의 열유입을 완전히 차단할 수 없다. 이렇게 탱크 내부로의 열유 입 때문에 발생하는 BOG는 경제적인 문제로 이어진다. 이하에서, 첨부된 도면을 이용하여 본 발명의 다양한 실시 예들에 대하여 구체적으로 설명한다. 도 1은 일 실시예에 따른 선박의 운항을 최적화하는 시스템의 일 예를 설명하기 위한 도면이다. 도 1을 참조하면, 시스템은 사용자 단말 및 서버를 포함한다. 예를 들어, 사용자 단말과 서버 는 유선 또는 무선 통신 방식으로 연결되어 상호 간에 데이터(예를 들어, 운항 계획 정보, 추천 항해 정보, BOG 발생량, 탱크 압력 값, 최적 항해 정보 등)를 송수신할 수 있다. 설명의 편의를 위하여, 도 1에는 시스템에 사용자 단말 및 서버가 포함되는 것으로 도시하였으나, 이에 한정되지 않는다. 예를 들어, 시스템에는 다른 외부 디바이스(미도시)가 포함될 수 있으며, 이하에서 설명될 사용자 단말 및 서버의 동작이 단일 디바이스(예를 들어, 사용자 단말 또는 서버) 또는 다수의 디바이스들에 의하여 구현될 수도 있다. 사용자 단말은 디스플레이 장치 및 사용자 입력을 수신하는 장치(예를 들어, 키보드, 마우스 등)를 구비하 고, 메모리와 프로세서를 포함하는 컴퓨팅 장치일 수 있다. 예를 들어, 디스플레이 장치는 터치 스크린으로 구 현되어 사용자 입력을 수신할 수 있다. 예를 들어, 사용자 단말은 노트북(notebook) PC, 데스크탑(desktop) PC, 랩탑(laptop), 테블릿 컴퓨터(tablet computer), 스마트 폰 등이 해당될 수 있으나, 이에 한정되지 않는다. 서버는 사용자 단말을 포함하여 외부 디바이스(미도시)와 통신하는 장치일 수 있다. 일 예로서, 서버 는 운항 계획 정보, 추천 항해 정보, BOG 발생량, 탱크 압력 값, 최적 항해 정보 등을 포함하는 다양한 데 이터를 저장하는 장치일 수 있다. 또는, 서버는 메모리와 프로세서를 포함하고, 자체적인 연산 능력을 갖춘 컴퓨팅 장치일 수 있다. 일 예로 서, 서버는 도 1 내지 도 36을 참조하여 후술할 사용자 단말의 동작들 중 적어도 일부를 수행할 수 있 다. 예를 들어, 서버는 클라우드(cloud) 서버일 수도 있으나, 이에 한정되지 않는다. 사용자 단말은 선박의 동작 제어에 관련된 최적 항해 정보를 획득할 수 있다. 예를 들어, 사용자 단말 은 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여 선박의 운항 경로에 관한 추천 항해 정 보를 생성할 수 있다. 그리고, 사용자 단말은 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박의 탱 크 압력 값을 예측할 수 있다. 그리고, 사용자 단말은 BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동 작 제어에 관련된 최적 항해 정보를 획득할 수 있다. 한편, 사용자 단말은 최적 항해 정보를 이용하여 기 설정된 운전 방식으로 선박을 제어할 수 있다. 예를 들 어, 사용자 단말은 학습된 최적 항해 정보를 이용하여, 선박의 액화가스 소모량을 최소화하는 운전 방식으로 선박을 제어할 수 있다. 예를 들어, 사용자 단말은 사용자 단말에 설치된 애플리케이션(application)을 통하여 선박의 동작 제 어에 관련된 최적 항해 정보를 획득하고, 최적 항해 정보를 이용하여 기 설정된 운전 방식으로 선박을 제어할 수 있다. 여기에서, 애플리케이션은 사용자의 운항 계획 및 제어 활동을 목적으로 설치된 소프트웨어 프로 그램일 수 있다. 예를 들어, 애플리케이션을 통하여 사용자는 추천 항해 정보 생성, BOG 발생량 예측, 탱크 압력 값 예측, 최적 항해 정보 획득, 선박의 운전 등 다양한 운항 계획 및 제어 활동을 수행할 수 있다. 한편, 설명의 편의를 위하여, 명세서의 전반에 걸쳐 사용자 단말이 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 선박의 운항 경로에 관한 추천 항해 정보를 생성하고, 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측하고, BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보를 획득하는 것으로 설명하였으나, 이에 한정되지 않는다. 예를 들어, 사용자 단 말에 의하여 수행되는 동작들의 적어도 일부는 서버에 의하여 수행될 수 있다. 다시 말해, 이하에서 도 1 내지 도 36을 참조하여 설명되는 사용자 단말의 동작들 중 적어도 일부는 서버 에 의하여 수행될 수 있다. 예를 들어, 서버는 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보 에 기초하여, 선박의 운항 경로에 관한 추천 항해 정보를 생성하고, 추천 항해 정보에 기초하여, 선박의 BOG 발 생량 및 선박의 탱크 압력 값을 예측하고, BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보를 획득할 수 있다. 그리고, 서버는 최적 항해 정보를 이용하여 기 설정된 운전 방식으로 선 박을 제어할 수 있다. 도 2는 일 실시예에 따른 사용자 단말의 일 예를 도시한 구성도이다. 도 2를 참조하면, 사용자 단말은 프로세서, 메모리, 입출력 인터페이스 및 통신 모듈(14 0)을 포함한다. 설명의 편의를 위하여, 도 2에는 본 발명과 관련된 구성요소들 만이 도시되어 있다. 따라서, 도 2에 도시된 구성요소들 외에 다른 범용적인 구성요소들이 사용자 단말에 더 포함될 수 있다. 또한, 도 2에 도시된 프로세서, 메모리, 입출력 인터페이스 및 통신 모듈은 독립된 장치로 구현될 수도 있음은 본 발명과 관련된 기술 분야에서의 통상의 지식을 가진 자에게 자명하다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리할 수 있 다. 여기에서, 명령은 메모리 또는 외부 장치(예를 들어, 서버 등)로부터 제공될 수 있다. 또한, 프로 세서는 사용자 단말에 포함된 다른 구성요소들의 동작을 전반적으로 제어할 수 있다. 먼저, 프로세서는 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 선박의 운항 경로 에 관한 추천 항해 정보를 생성한다. 예를 들어, 프로세서는 선박의 출발 장소에서의 출발시간, 선박의 도 착 장소에서의 도착시간 및 장소들의 위치 정보에 기초하여, 선박의 운항 경로에 관한 추천 항해 정보를 생성할 수 있다. 출발 장소 및 도착 장소는, 선박이 운항하는 해역 중 임의의 지역 또는 항구 등이 포함될 수 있으며, 상술한 예 들에 한정되지 않는다. 운항 계획 정보는, 선박의 운항 계획에 관련된 정보를 지칭할 수 있다. 예를 들면, 운항 계획 정보는, 선박의 출발 장소에서의 출발시간, 선박의 도착 장소에서의 도착시간, 출발 장소의 위도 및 경도, 도착 장소의 위도 및 경도, 도착 장소에서의 선박의 탱크 요구 조건 중 하나 이상을 포함할 수 있다. 한편, 운항 계획 정보는, 사용자의 입력에 의해 수신될 수 있으나, 기 설정된 정보를 지칭할 수 있다. 예를 들 면, 사용자가 선박의 출발 장소 및 도착 장소를 설정하면, 설정된 출발 장소 및 도착 장소에 대응하여, 선박의 도착 시간, 출발 장소의 위도 및 경도, 도착 장소의 위도 및 경도, 도착 장소에서의 선박의 탱크 요구 조건 등 이 기 설정된 정보로부터 수신될 수 있다. 한편, 운항 계획 정보는, 상술한 예들에 한정되지 않는다. 추천 항해 정보는, 운항 계획 정보에 기초하여 생성된 운항 경로에 관한 정보로서, 운항 경로에 관한 선박의 항 해 구간별 위치 정보, 선박의 항해 구간별 속도 정보 및 선박의 항해 구간별 환경 정보 중 하나 이상을 포함할 수 있다. 위치 정보는, 선박의 항해 구간별 위도 및 경도를 포함하고, 속도 정보는, 선박의 항해 구간별 속도를 포함하고, 환경 정보는, 선박의 항해 구간별 기상기후 정보, 조류 정보, 해상 정보 및 해류 정보 중 하나 이상 을 포함할 수 있다. 한편, 추천 항해 정보는, 출/도착 장소의 위치 및 선박의 출/도착 시간에 기초하여 위치별 기상기후 정보 및 해 상 정보를 획득하고, 위치별 기상기후 정보 및 해상 정보에 기초하여 산출한 선박의 추진 저항 및 BOG 발생량을고려하여 생성된 운항 경로에 관한 정보일 수 있다. 다만, 추천 항해 정보는, 상술한 예들에 한정되지 않는다. 운항 경로는, 연비가 가장 낮은 항로일 수 있다. 예를 들면, 선박의 추진 저항 및 BOG 발생량이 최소로 발생하 는 경로일 수 있으나, 이에 한정되지 않는다. 한편, 프로세서는 운항 계획 정보를 추천 항해 정보 생성 모델에 입력 데이터로 입력함으로써, 추천 항해 정보를 출력 데이터로 획득할 수 있다. 일 예로서, 프로세서는 선박의 장소에 관한 출/도착 시간 및 출/도 착 장소의 위치 정보를 추천 항해 정보 생성 모델에 입력함으로써, 추천 항해 정보를 획득할 수 있다. 여기에서, 추천 항해 정보 생성 모델은, 선박의 추진 엔진의 속도-연료량 성능 함수, 선박의 발전 엔진의 전력 량-연료량 성능 함수, 선박의 압축기/펌프/재액화장치/GCU/과냉각기(subcooler) 전력량-연료량 성능 함수, 축발 전기(shaft generator)의 속도-발전량 성능 함수 등의 정보를 포함하는 모델일 수 있다. 다른 예로서, 추천 항 해 정보는, 후술하는 바와 같이 항해정보 생성모델을 이용하여 획득될 수 있으며, 이에 한정되지 않는다. 한편, 프로세서는 운항 계획 정보에 기초하여, 선박의 운항 경로에 관한 환경 정보를 획득할 수 있다. 그 리고, 프로세서는 운항 계획 정보 및 환경 정보에 기초하여, 선박의 운항 경로에 관한 연료 소모량 및 BOG 발생량을 기준으로 추천 항해 정보를 생성할 수 있다. 일 예로서, 프로세서는 선박의 출/도착 시간, 출/도 착 장소의 위도 및 경도, 도착 장소의 탱크 요구 조건에 기초하여 위치별 기상기후 정보 및 해상 정보를 획득하 고, 선박의 출/도착 시간, 출/도착 장소의 위도 및 경도, 도착 장소의 탱크 요구 조건 및 위치별 기상기후 정보 및 해상 정보에 기초하여 선박의 추진 저항 및 BOG 발생량을 예측함으로써 선박의 추진 저항 및 BOG 발생량이 최소로 발생하는 운항 경로에 관한 추천 항해 정보를 생성할 수 있다. 그리고, 프로세서는 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측할 수 있다. 구체적으로, 프로세서는 항해 구간별 위치 정보, 항해 구간별 속도 정보 및 항해 구간별 환경 정보 에 기초하여, 선박의 BOG 발생량을 예측할 수 있다. 그리고, 프로세서는 항해 구간별 위치 정보, 항해 구 간별 속도 정보, 항해 구간별 환경 정보 및 기 설정된 액화가스 소모량에 기초하여, 선박의 탱크 압력 값을 예 측할 수 있다. 한편, 프로세서는 예측 모델을 이용하여 선박의 BOG 발생량을 획득할 수 있다. 일 예로서, 프로세서 는 항해 구간별 위치 정보, 항해 구간별 속도 정보 및 항해 구간별 환경 정보를 예측 모델에 입력 데이터로 입 력함으로써, 선박의 BOG 발생량을 출력 데이터로 획득할 수 있다. 다른 예로서, 프로세서는 후술하는 BOG 발생량 예측 모델을 이용하여 BOG 발생량 예측 값을 획득할 수 있다. 한편, 프로세서는 예측 모델을 이용하여 선박의 탱크 압력 값을 획득할 수 있다. 일 예로서, 프로세서 는 항해 구간별 위치 정보, 항해 구간별 속도 정보, 항해 구간별 환경 정보 및 기 설정된 액화가스 소모량 을 예측 모델에 입력 데이터로 입력함으로써, 선박의 탱크 압력 값을 출력 데이터로 획득할 수 있다. 다른 예로 서, 프로세서는 후술하는 탱크압력 예측 모델을 이용하여 탱크 압력 값을 획득할 수 있다. 액화가스 소모량은, 추진엔진의 가스 소모량, 발전엔진의 가스 소모량, 가스연소장치의 가스 소모량 및 재액화 장치의 가스 소모량에 기초하여 도출된 것일 수 있다. 일 예로서, 액화가스 소모량은, 추진엔진의 가스 소모량, 발전엔진의 가스 소모량, 연소장치(GCU)의 가스 소모량, 재액화장치의 가스 소모량, 압축기의 가스 소모량, 펌 프의 가스 소모량 중 하나 이상의 합일 수 있다. 다른 예로서, 액화가스 소모량은, 선박 자체의 가스 소모량 및 선박에 설치된 장비의 가스 소모량의 합일 수 있으나, 이에 한정되지 않는다. 그리고, 프로세서는 BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보 를 획득할 수 있다. 예를 들면, 프로세서는, 항차 중 최소 액화가스 소모량을 기준으로 선박의 구간별 속 도 및 선박에 설치된 장비의 사용량을 예측할 수 있다. 여기에서 장비는, 선박에 설치된 추진엔진(Main engine), 발전엔진(Generator engine), 가스연소장치(Gas combustion unit), 재액화장치(Reliquefaction), 축 발전기 및 과냉각기 등을 포함할 수 있다. 그리고, 프로세서는 예측된 선박의 구간별 속도에 기초하여 선 박의 추진 엔진의 연료량을 산출하고, 예측된 장비의 사용량에 기초하여 장비의 가스 소모량을 산출할 수 있다. 그리고, 프로세서는 산출된 추진 엔진의 연료량 및 장비의 가스 소모량에 기초하여, 액화가스 소모량을 결 정할 수 있다. 최종적으로, 프로세서는, 선박의 BOG 발생량, 선박의 탱크 압력 값, 선박의 항해 구간별 속도, 선박의 액화가스 소모량 및 선박에 설치된 장비의 사용량을 포함하는 최적 항해 정보를 획득할 수 있다. 한편, 프로세서는 BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 제n 차 중간 항해 정보를 생성할 수 있다. 그리고, 프로세서는 제n 차 중간 항해 정보 및 제n+1 차 중간 항해 정보의 비교에 기초하여, 기 설정된 임계 값을 기준으로 제n+1 차 중간 항해 정보를 최적 항해 정보로 확정할 수 있다. 여기에서 n은, 1 이상의 자연수일 수 있다. 제n 차 중간 항해 정보를 생성하는 방법은, 상술한 최적 항해 정보를 생성하는 방법과 동일할 수 있다. 중간 항 해정보는 선박의 BOG 발생량, 선박의 탱크 압력 값, 선박의 항해 구간별 속도, 선박의 액화가스 소모량 및 선박 에 설치된 장비의 사용량을 포함할 수 있다. 예를 들면, 프로세서는, 항차 중 액화가스 소모량이 최소가 되도록 선박의 구간별 속도 및 선박에 설치된 장비의 사용량을 예측할 수 있다. 여기에서 장비는, 선박에 설치 된 추진엔진(Main engine), 발전엔진(Generator engine), 가스연소장치(Gas combustion unit), 재액화장치 (Reliquefaction), 축발전기 및 과냉각기 등을 포함할 수 있다. 그리고, 프로세서는 예측된 선박의 구간별 속도에 기초하여 선박의 추진 엔진의 연료량을 산출하고, 예측된 장비의 사용량에 기초하여 장비의 가스 소모량 을 산출할 수 있다. 그리고, 프로세서는 산출된 추진 엔진의 연료량 및 장비의 가스 소모량에 기초하여, 액화가스 소모량을 결정할 수 있다. 최종적으로, 프로세서는, 선박의 BOG 발생량, 선박의 탱크 압력 값, 선박의 항해 구간별 속도, 선박의 액화가스 소모량 및 선박에 설치된 장비의 사용량을 포함하는 제1차 중간 항해 정보 를 획득할 수 있다. 다만, 중간 항해 정보를 획득하는 방법은 상술한 예에 한정되지 않는다. 제n+1 차 중간 항해 정보는, n 차 중간 항해 정보에 포함된 항해 구간별 속도 정보 및 액화가스 소모량 중 하나 이상의 갱신 값에 기초하여 생성되는 것일 수 있다. 일 예로서, 제n+1차 중간 항해 정보는, n 차 중간 항해 정 보에 포함된 항해 구간별 속도 정보의 갱신 값에 기초하여, 상술한 바와 같이 선박의 BOG 발생량 및 선박의 탱 크 압력 값을 예측하고, 예측된 BOG 발생량 및 탱크 압력 값에 기초하여 획득된 선박의 동작 제어에 관련된 제 n+1차 중간 항해 정보일 수 있다. 여기에서, 항해 구간별 속도 정보의 갱신 값은, 제n+1차 중간 항해 정보에 포 함된 항해 구간별 속도일 수 있다. 프로세서는, 제n 차 중간 항해 정보에 포함된 항해 구간별 속도 및 액화가스 소모량 중 하나 이상을 갱신 값으로 사용하여, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측하고, 예측된 BOG 발생량 및 탱크 압력 값 에 기초하여 선박의 동작 제어에 관련된 제n+1 차 중간 항해 정보를 획득할 수 있다. 한편, 프로세서는, 제n 차 중간 항해 정보 및 제n+1 차 중간 항해 정보에 기초하여 산출된 차이 값이 기 설정된 임계 값보다 이하인 것에 응답하여, 제n+1 차 중간 항해 정보를 최적 항해 정보로 확정할 수 있다. 그리 고, 프로세서는, 차이 값이 기 설정된 임계 값을 초과하는 것에 응답하여, 제n+1 차 중간 항해 정보에 포 함된 항해 구간별 속도 정보 및 액화가스 소모량 중 하나 이상을 갱신함으로써 제n+2 차 중간 항해 정보를 생성 할 수 있다. 한편, 프로세서는 최적 항해 정보를 이용하여 기 설정된 운전 방식으로 선박을 제어할 수 있다. 여기에서, 운전 방식은, 선박의 액화가스 소모량을 최소화하는 운전 방식을 포함할 수 있다. 상술한 생성 모델 및 예측 모델 각각은, 학습된 머신러닝 모델일 수 있다. 예를 들어, 예측 모델은 인공 신경망 을 이용하는 딥러닝 모델일 수 있다. 머신러닝 모델은, 기계학습(Machine Learning) 기술과 인지과학에서 생물학적 신경망의 구조에 기초하여 구현된 통계학적 학습 알고리즘 또는 그 알고리즘을 실행하는 구조를 의미한다. 예를 들어, 머신러닝 모델은 생물학적 신경망 에서와 같이 시냅스의 결합으로 네트워크를 형성한 인공 뉴런인 노드(Node)들이 시냅스의 가중치를 반복적으로 조정하여, 특정 입력에 대응한 올바른 출력과 추론된 출력 사이 의 오차가 감소되도록 학습함으로써, 문제 해결 능력을 가지는 모델을 나타낼 수 있다. 예를 들어, 머신러닝 모 델은 기계학습, 딥러닝 등의 인공지능 학습법에 사용되는 임의의 확률 모델, 뉴럴 네트워크 모델 등을 포함할 수 있다. 예를 들어, 머신러닝 모델은 다층의 노드들과 이들 사이의 연결로 구성된 다층 퍼셉트론(MLP: multilayer perceptron)으로 구현될 수 있다. 본 발명의 일 실시예에 따른 머신러닝 모델은 MLP를 포함하는 다양한 인공신 경망 모델 구조들 중 하나를 이용하여 구현될 수 있다. 예를 들어, 머신러닝 모델은 외부로부터 입력 신호 또는 데이터를 수신하는 입력 레이어, 입력 데이터에 대응한 출력 신호 또는 데이터를 출력하는 출력 레이어, 입력 레이어와 출력 레이어 사이에 위치하며 입력 레이어로부터 신호를 받아 특성을 추출하여 출력 레이어로 전달하 는 하나 이상의 은닉 레이어로 구성될 수 있다. 출력 레이어는 은닉 레이어로부터 신호 또는 데이터를 수신하여 외부로 출력한다. 일 실시예에 따른 프로세서가 동작하는 구체적인 예들은 도 4 내지 도 36을 참조하여 설명한다. 프로세서는 다수의 논리 게이트들의 어레이로 구현될 수도 있고, 범용적인 마이크로 프로세서와 이 마이크 로 프로세서에서 실행될 수 있는 프로그램이 저장된 메모리의 조합으로 구현될 수도 있다. 예를 들어, 프로세서 는 범용 프로세서, 중앙 처리 장치(CPU), 마이크로프로세서, 디지털 신호 프로세서(DSP), 제어기, 마이크 로제어기, 상태 머신 등을 포함할 수 한다. 일부 환경에서, 프로세서는 주문형 반도체(ASIC), 프로그램 가 능 로직 디바이스(PLD), 필드 프로그램 가능 게이트 어레이(FPGA) 등을 포함할 수도 있다. 예를 들어, 프로세서 는 디지털 신호 프로세서(DSP)와 마이크로프로세서의 조합, 복수의 마이크로프로세서들의 조합, 디지털 신 호 프로세서(DSP) 코어와 결합된 하나 이상의 마이크로프로세서들의 조합, 또는 임의의 다른 그러한 구성들의 조합과 같은 처리 디바이스들의 조합을 지칭할 수도 있다. 메모리는 비-일시적인 임의의 컴퓨터 판독 가능한 기록매체를 포함할 수 있다. 일 예로서, 메모리는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모 리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device)를 포함할 수 있다. 다른 예로서, ROM, SSD, 플래시 메모리, 디스크 드라이브 등과 같은 비소멸성 대용량 저장 장치는 메모리와는 구분되는 별도의 영구 저장 장치일 수 있다. 또한, 메모리에는 운영체제(OS)와 적어도 하나의 프로그램 코 드(예를 들어, 도 4 내지 도 36을 참조하여 후술할 동작을 프로세서가 수행하기 위한 코드)가 저장될 수 있다. 이러한 소프트웨어 구성요소들은 메모리와는 별도의 컴퓨터에서 판독 가능한 기록매체로부터 로딩될 수 있 다. 이러한 별도의 컴퓨터에서 판독 가능한 기록매체는 사용자 단말에 직접 연결될 수 있는 기록 매체일 수 있고, 예를 들어, 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 컴퓨터에서 판 독 가능한 기록매체를 포함할 수 있다. 또는, 소프트웨어 구성요소들은 컴퓨터에서 판독 가능한 기록매체가 아 닌 통신 모듈을 통해 메모리에 로딩될 수도 있다. 예를 들어, 적어도 하나의 프로그램은 개발자들 또 는 어플리케이션의 설치 파일을 배포하는 파일 배포 시스템이 통신 모듈을 통해 제공하는 파일들에 의해 설치되는 컴퓨터 프로그램(예를 들어, 도 4 내지 도 9을 참조하여 후술할 동작을 프로세서가 수행하기 위 한 컴퓨터 프로그램 등)에 기반하여 메모리에 로딩될 수 있다. 입출력 인터페이스는 사용자 단말과 연결되거나 사용자 단말에 포함될 수 있는 입력 또는 출력 을 위한 장치(예를 들어, 키보드, 마우스 등)와의 인터페이스를 위한 수단일 수 있다. 입출력 인터페이스 가 프로세서와 별도로 구성될 수 있으나, 이에 한정되지 않으며, 입출력 인터페이스가 프로세서(11 0)에 포함되도록 구성될 수도 있다. 통신 모듈은 네트워크를 통해 서버와 사용자 단말이 서로 통신하기 위한 구성 또는 기능을 제공 할 수 있다. 또한, 통신 모듈은 사용자 단말이 다른 외부 디바이스와 통신하기 위한 구성 또는 기능 을 제공할 수 있다. 예를 들어, 프로세서의 제어에 따라 제공되는 제어 신호, 명령, 데이터 등이 통신 모 듈과 네트워크를 거쳐 서버 및/또는 외부 디바이스로 전송될 수 있다. 한편, 도 2에는 도시되지 않았으나, 사용자 단말은 디스플레이 장치를 더 포함할 수 있다. 예를 들어, 디 스플레이 장치는 터치 스크린으로 구현될 수도 있다. 또는, 사용자 단말은 독립적인 디스플레이 장치와 유 선 또는 무선 통신 방식으로 연결되어 상호 간에 데이터를 송수신할 수 있다. 예를 들어, 디스플레이 장치를 통 하여 추천 항해 정보 또는 최적 항해 정보 등이 제공될 수 있다. 도 3은 일 실시예에 따른 서버의 일 예를 도시한 구성도이다. 도 3을 참조하면, 서버는 프로세서, 메모리 및 통신 모듈을 포함한다. 설명의 편의를 위하 여, 도 3에는 본 발명과 관련된 구성요소들만이 도시되어 있다. 따라서, 도 3에 도시된 구성요소들 외에 다른 범용적인 구성요소들이 서버에 더 포함될 수 있다. 또한 도 3에 도시된 프로세서, 메모리 및 통 신 모듈은 독립된 장치로 구현될 수 있음은 본 발명과 관련된 기술 분야에서의 통상의 지식을 가진 자에게 자명하다. 프로세서는, 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 선박의 운항 경로에 관 한 추천 항해 정보를 생성할 수 있다. 또한, 프로세서는, 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측할 수 있다. 또한, 프로세서는, BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보를 획득할 수 있다. 또한, 프로세서는, 최적 항해 정보를 이용 하여 기 설정된 운전 방식으로 선박을 제어할 수 있다. 다시 말해, 도 2를 참조하여 상술한 프로세서의 동작 중 적어도 하나가 프로세서에 의하여 수행될 수 있다. 이 경우, 사용자 단말은 서버로부터 전송된 정보를 디스플레이 장치를 통하여 출력할 수 있다.한편, 프로세서의 구현 예는 도 2를 참조하여 상술한 프로세서의 구현 예와 동일하므로, 구체적인 설 명은 생략한다. 메모리에는 프로세서의 동작에 필요한 데이터, 프로세서의 동작에 따라 생성된 데이터 등 다양 한 데이터가 저장될 수 있다. 또한, 메모리에는 운영체제(OS)와 적어도 하나의 프로그램(예를 들어, 프로 세서가 동작하는데 필요한 프로그램 등)이 저장될 수 있다. 한편, 메모리의 구현 예는 도 2를 참조하여 상술한 메모리의 구현 예와 동일하므로, 구체적인 설명은 생략한다. 통신 모듈은 네트워크를 통해 서버와 사용자 단말이 서로 통신하기 위한 구성 또는 기능을 제공 할 수 있다. 또한, 통신 모듈은 서버가 다른 외부 디바이스와 통신하기 위한 구성 도는 기능을 제공 할 수 있다. 예를 들어, 프로세서의 제어에 따라 제공되는 제어 신호, 명령, 데이터 등이 통신 모듈 과 네트워크를 거쳐 사용자 단말 및/또는 외부 디바이스로 전송될 수 있다. 도 4는 일 실시예에 따른 선박의 운항을 최적화하는 방법의 일 예를 설명하기 위한 흐름도이다. 도 4를 참조하면, 선박의 운항을 최적화하는 방법은 도 1 및 도 2에 도시된 사용자 단말(10, 100) 또는 프로세 서에서 시계열적으로 처리되는 단계들로 구성된다. 따라서, 이하에서 생략된 내용이라고 하더라도 도 1 및 도 2에 도시된 사용자 단말(10, 100) 또는 프로세서에 관하여 이상에서 기술된 내용은 도 4의 선박의 운항 을 최적화하는 방법에도 적용될 수 있다. 또한, 도 1 및 도 3를 참조하여 상술한 바와 같이, 도 4의 선박의 운항을 최적화하는 방법의 단계들 중 적어도 하나는 서버(20, 200) 또는 프로세서에서 처리될 수 있다. 310 단계에서, 프로세서는 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 선박의 운 항 경로에 관한 추천 항해 정보를 생성한다. 일 예로서, 프로세서는 선박의 출발 장소에서의 출발시간, 선박의 도착 장소에서의 도착시간, 출발 장소의 위도 및 경도, 도착 장소의 위도 및 경도를 추천 항해 정보 생성 모델에 입력 데이터로 입력함으로써, 추천 항 해 정보를 출력 데이터로 생성할 수 있다. 선박의 추진 엔진의 속도-연료량 성능 함수, 선박의 발전 엔진의 전 력량-연료량 성능 함수, 선박의 압축기/펌프/재액화장치/GCU/과냉각기(subcooler) 전력량-연료량 성능 함수, 축 발전기(shaft generator)의 속도-발전량 성능 함수 등의 정보를 포함하는 추천 항해 정보 생성 모델은, 선박의 추진 저항에 따른 선박의 저항 성능을 분석함으로써 가장 연비가 낮은 항로를 도출할 수 있다. 여기에서 연비는, 선박의 단위 주행 거리 또는 단위 시간당 소비하는 연료의 양을 지칭할 수 있다. 다른 예로서, 프로세서는 선박의 출발 장소에서의 출발시간, 선박의 도착 장소에서의 도착시간, 출발 장소 의 위도 및 경도, 도착 장소의 위도 및 경도, 도착 장소의 탱크 요구 조건에 기초하여, 위치별 기상기후 정보 및 해상 정보를 획득하고, 선박의 출/도착 시간, 출/도착 장소의 위도 및 경도, 도착 장소의 탱크 요구 조건, 위치별 기상기후 정보 및 해상 정보에 기초하여 선박의 추진 저항 및 BOG 발생량을 예측함으로써 선박의 추진 저항 및 BOG 발생량이 최소로 발생하는 운항 경로에 관한 추천 항해 정보를 생성할 수 있다. 이하 도 5를 참조하여, 프로세서가 운항 계획 정보에 기초하여 추천 항해 정보를 생성하는 일 예를 설명한다. 도 5는 일 실시예에 따른 프로세서가 운항 계획 정보에 기초하여 추천 항해 정보를 생성하는 일 예를 설명하기 위한 흐름도이다. 도 5를 참조하면, 410 단계에서, 프로세서는 운항 계획 정보에 기초하여, 선박의 운항 경로에 관한 환경 정보를 획득한다. 예를 들면, 프로세서는 선박의 출발 장소에서의 출발시간, 선박의 도착 장소에서의 도착 시간, 출발 장소의 위도 및 경도, 도착 장소의 위도 및 경도, 도착 장소에서의 선박의 탱크 요구 조건 중 하나 이상에 기초하여, 선박의 운항 경로에 관한 환경 정보를 획득할 수 있다. 여기에서 환경 정보는, 선박의 운항 경로에 포함된 위치별 기상기후 정보, 조류 정보, 해상 정보 및 해류 정보 중 하나 이상을 포함할 수 있다. 한편, 환경 정보는, 선박의 운항 경로에서의 환경에 관한 정보를 지칭할 수 있 으며, 상술한 예들에 한정되지 않는다. 420 단계에서, 프로세서는 운항 계획 정보 및 환경 정보에 기초하여, 선박의 운항 경로에 관한 연료 소모 량 및 BOG 발생량을 기준으로 추천 항해 정보를 생성한다. 예를 들면, 프로세서는 선박의 출/도착 시간, 출/도착 장소의 위도 및 경도, 도착 장소의 탱크 요구 조건, 위치별 기상기후 정보 및 해상 정보에 기초하여 선박의 추진 저항 및 BOG 발생량을 예측함으로써 선박의 추진 저항 및 BOG 발생량이 최소로 발생하는 운항 경로에 관한 추천 항해 정보를 생성할 수 있다. 여기에서, 프로세서는 BOG 발생량을 예측함에 있어서, 외기 온도 변화를 고려하여 선박의 BOG 발생량을 예측할 수 있다. 다시 도 4를 참조하면, 320 단계에서, 프로세서는 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박 의 탱크 압력 값을 예측한다. 획득된 BOG 발생량 및 탱크 압력 값은, 항해 구간별 시계열 데이터일 수 있으나, 이에 한정되지 않는다. 일 예로서, 프로세서는 추천 항해 정보에 포함된 항해 구간별 위치 정보 및 상기 항해 구간별 속도 정보에 기초하여 선박의 BOG 발생량을 예측하고, 기 설정된 액화가스 소모량에 기초하여 선박의 탱크 압력 값을 예측할 수 있다. 다른 예로서, 프로세서는 예측 모델을 이용하여, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 획득할 수 있다. 다만, 선박의 BOG 발생량 및 선박의 탱크 압력 값을 획득하는 방법은, 상술한 예들에 한정되지 않는다. 이하 도 6을 참조하여, 프로세서가 추천 항해 정보에 기초하여 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예 측하는 일 예를 설명한다. 도 6은 일 실시예에 따른 프로세서가 추천 항해 정보에 기초하여 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측하는 일 예를 설명하기 위한 흐름도이다. 도 6을 참조하면, 510 단계에서, 프로세서는 항해 구간별 위치 정보, 항해 구간별 속도 정보 및 항해 구간 별 환경 정보에 기초하여, 선박의 BOG 발생량을 예측한다. 일 예로서, 프로세서는 항해 구간별 위치 정보, 항해 구간별 속도 정보 및 항해 구간별 환경 정보를 예측 모델에 입력 데이터로 입력함으로써, 선박의 BOG 발생량을 출력 데이터로 획득할 수 있다. 다른 예로서, 프로세 서는 후술하는 BOG 발생량 예측 모델을 이용하여 BOG 발생량을 획득할 수 있다. 여기에서, BOG 발생량 예 측모델은, 복수의 딥러닝 모델을 포함하는 것으로써, 선박의 운항데이터를 이용하여 시간에 따른 BOG 발생량을 예측한다. 또한, BOG 발생량 예측 모델은 탱크 내에서의 액화가스 수위에 따른 복수의 항해모드들 각각에 대응 하는 복수의 딥러닝 모델을 포함할 수 있다. 다만, BOG 발생량을 획득하는 방법은, 상술한 예들에 한정되지 않 는다. 520 단계에서, 프로세서는 항해 구간별 위치 정보, 항해 구간별 속도 정보, 항해 구간별 환경 정보 및 기 설정된 액화가스 소모량에 기초하여, 선박의 탱크 압력 값을 예측한다. 일 예로서, 프로세서는 항해 구간별 위치 정보, 항해 구간별 속도 정보, 항해 구간별 환경 정보 및 기 설 정된 액화가스 소모량을 예측 모델에 입력 데이터로 입력함으로써, 선박의 탱크 압력 값을 출력 데이터로 획득 할 수 있다. 다른 예로서, 프로세서는 후술하는 탱크압력 예측 모델을 이용하여 탱크 압력 값을 획득할 수 있다. 여기에서, 탱크압력 예측 모델은 시간에 따른 선박의 탱크압력 예측 값을 출력한다. 또한, 탱크압력 예측 모델은 탱크 내에서의 액화가스 수위에 따른 복수의 항해모드들 각각에 대응하는 복수의 딥러닝 모델을 포함할 수 있다. 다만, 탱크 압력 값을 획득하는 방법은, 상술한 예들에 한정되지 않는다. 다시 도 4를 참조하면, 330 단계에서, 프로세서는 BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보를 획득한다. 일 예로서, 프로세서는, 항차 중 최소 액화가스 소모량을 기준으로 선박의 구간별 속도 및 선박에 설치된 장비의 사용량을 예측할 수 있다. 그리고, 프로세서는 예측된 선박의 구간별 속도에 기초하여 선박의 추진 엔진의 연료량을 산출하고, 예측된 장비의 사용량에 기초하여 장비의 가스 소모량을 산출할 수 있다. 그리고, 프로세서는 산출된 추진 엔진의 연료량 및 장비의 가스 소모량에 기초하여, 액화가스 소모량을 결정할 수 있다. 최종적으로, 프로세서는, 선박의 BOG 발생량, 선박의 탱크 압력 값, 선박의 항해 구간별 속도, 선박의 액 화가스 소모량 및 선박에 설치된 장비의 사용량을 포함하는 최적 항해 정보를 획득할 수 있다. 다른 예로서, 프로세서는 후술하는 운전 최적화모델을 이용하여 제약 조건을 고려한 최적 항해 정보를 생 성할 수 있다. 다만, 최적 항해 정보를 생성하는 방법은, 상술한 예들에 한정되지 않는다. 이하 도 7을 참조하여, 프로세서가 BOG 발생량 및 탱크 압력 값에 기초하여 최적 항해 정보를 획득하는 예를 설 명한다. 도 7은 일 실시예에 따른 프로세서가 BOG 발생량 및 탱크 압력 값에 기초하여 최적 항해 정보를 획득하는 일 예 를 설명하기 위한 흐름도이다. 도 7을 참조하면, 610 단계에서, 프로세서는 BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 제n 차 중간 항해 정보를 생성한다. 일 예로서, 프로세서는, 항차 중 액화가스 소모량이 최소가 되도록 선박의 구간별 속도 및 선박에 설치된 장비의 사용량을 예측할 수 있다. 여기에서 장비는, 선박에 설치된 추진엔진(Main engine), 발전엔진(Generator engine), 가스연소장치(Gas combustion unit), 재액화장치(Reliquefaction), 축발전기 및 과냉각기 등을 포함 할 수 있다. 그리고, 프로세서는 예측된 선박의 구간별 속도에 기초하여 선박의 추진 엔진의 연료량을 산 출하고, 예측된 장비의 사용량에 기초하여 장비의 가스 소모량을 산출할 수 있다. 그리고, 프로세서는 산 출된 추진 엔진의 연료량 및 장비의 가스 소모량에 기초하여, 액화가스 소모량을 결정할 수 있다. 최종적으로, 프로세서는, 선박의 BOG 발생량, 선박의 탱크 압력 값, 선박의 항해 구간별 속도, 선박의 액화가스 소모량 및 선박에 설치된 장비의 사용량을 포함하는 제n 차 중간 항해 정보를 획득할 수 있다. 다른 예로서, 프로세서는 후술하는 운전 최적화모델을 이용하여 제약 조건을 고려한 제n 차 중간 항해 정 보를 생성할 수 있다. 다만, 제n 차 중간 항해 정보를 생성하는 방법은, 상술한 예들에 한정되지 않는다. 620 단계에서, 프로세서는 제n 차 중간 항해 정보 및 제n+1 차 중간 항해 정보의 비교에 기초하여, 기 설 정된 임계 값을 기준으로 제n+1 차 중간 항해 정보를 최적 항해 정보로 확정한다. 일 예로서, 프로세서는 제n 차 중간 항해 정보에 포함된 구간별 속도 및 제n+1 차 중간 항해 정보에 포함 된 구간별 속도의 비교에 기초하여, 기 설정된 임계 값을 기준으로 제n+1 차 주간 항해 정보를 최적 항해 정보 로 확정할 수 있다. 다른 예로서, 프로세서는 제n 차 중간 항해 정보에 포함된 액화가스 소모량 및 제n+1 차 중간 항해 정보에 포함된 액화가스 소모량의 비교에 기초하여, 기 설정된 임계 값을 기준으로 제n+1 차 주간 항해 정보를 최적 항 해 정보로 확정할 수 있다. 다만, 최적 항해 정보로 확정하는 방법은, 상술한 예들에 한정되지 않는다. 이하 도 8을 참조하여, 프로세서가 BOG 발생량 및 탱크 압력 값에 기초하여 최적 항해 정보를 획득하는 예를 설 명한다. 도 8은 일 실시예에 따른 프로세서가 BOG 발생량 및 탱크 압력 값에 기초하여 최적 항해 정보를 획득하는 다른 예를 설명하기 위한 흐름도이다. 도 8을 참조하면, 710 단계에서, 프로세서는 제n 차 중간 항해 정보 및 제n+1 차 중간 항해 정보에 기초하 여 산출된 차이 값이 기 설정된 임계 값보다 이하인 것에 응답하여, 제n+1 차 중간 항해 정보를 최적 항해 정보 로 확정한다. 일 예로서, 프로세서는 제n 차 중간 항해 정보에 포함된 구간별 속도 및 제n+1 차 중간 항해 정보에 포함 된 구간별 속도에 기초하여 차이 값을 산출할 수 있다. 그리고, 프로세서는 산출된 차이 값이 0.01보다 이 하인 것에 응답하여, 제n+1 차 중간 항해 정보를 최적 항해 정보로 확정할 수 있다. 다른 예로서, 프로세서는 제n 차 중간 항해 정보에 포함된 액화가스 소모량 및 제n+1 차 중간 항해 정보에 포함된 액화가스 소모량에 기초하여 차이 값을 산출할 수 있다. 그리고, 프로세서는 산출된 차이 값이 0.01보다 이하인 것에 응답하여, 제n+1 차 중간 항해 정보를 최적 항해 정보로 확정할 수 있다. 다만, 최적 항해 정보로 확정하는 방법은, 상술한 예들에 한정되지 않는다. 720 단계에서, 프로세서는 차이 값이 기 설정된 임계 값을 초과하는 것에 응답하여, 제n+1 차 중간 항해 정보에 포함된 항해 구간별 속도 정보 및 액화가스 소모량 중 적어도 하나를 갱신함으로써 제n+2 차 중간 항해 정보를 생성한다.일 예로서, 프로세서는 제n 차 중간 항해 정보에 포함된 구간별 속도 및 제n+1 차 중간 항해 정보에 포함 된 구간별 속도의 차이 값이 0.01을 초과하는 경우, 제n+1 차 중간 항해 정보에 포함된 항해 구간별 속도를 갱 신함으로써, 제n+2 차 중간 항해 정보를 생성할 수 있다. 프로세서는 제n+1 차 중간 항해 정보에 포함된 항해 구간별 속도에 기초하여, 상술한 바와 같이 선박의 BOG 발생량을 예측하고, 선박의 탱크 압력 값을 예측하 고, 예측한 BOG 발생량 및 탱크 압력 값에 기초하여 선박의 동작 제어에 관련된 제n+2차 중간 항해 정보를 획득 할 수 있다. 여기에서, 항해 구간별 속도가 갱신됨에 따라, 선박의 속도에 따른 추진 엔진의 가스 소모량 및 발 전 엔진의 가스 소모량이 갱신되므로, 액화가스 소모량 또한 갱신된다. 즉, 제n+2 차 중간 항해 정보는, 구간별 속도 및 액화가스 소모량의 갱신 값에 기초하여 생성된 정보일 수 있다. 다른 예로서, 프로세서는 제n 차 중간 항해 정보에 포함된 액화가스 소모량 및 제n+1 차 중간 항해 정보에 포함된 액화가스 소모량의 차이 값이 0.01을 초과하는 경우, 제n+1 차 중간 항해 정보에 포함된 항해 액화가스 소모량을 갱신함으로써, 제n+2 차 중간 항해 정보를 생성할 수 있다. 프로세서는 제n+1 차 중간 항해 정보 에 포함된 액화가스 소모량에 기초하여, 상술한 바와 같이 선박의 탱크 압력 값을 예측하고, 예측한 BOG 발생량 및 탱크 압력 값에 기초하여 선박의 동작 제어에 관련된 제n+2차 중간 항해 정보를 획득할 수 있다. 즉, 제n+2 차 중간 항해 정보는, 액화가스 소모량의 갱신 값에 기초하여 생성된 정보일 수 있다. 상술한 기 설정된 값은, 사용자 또는 개발자가 설정한 값이거나, 제n 차 중간 항해 정보를 반복적으로 생성함에 따라 프로세서가 획득한 값일 수 있다. 일 예로서, 프로세서는, 최적 항해 정보를 획득하고, 최적 항 해 정보에 대응하는 정답 값을 설정하고, 최적 항해 정보와 정답 값을 대응하여 기 설정된 값을 획득할 수 있다. 다른 예로서, 프로세서는, 최적 항해 정보를 획득하고, 손실함수를 이용함으로써 최적 항해 정보를 정답 값에 대응한 오차를 산출하고, 산출된 오차를 기초로 기 설정된 값을 획득할 수 있다. 이하 도 9를 참조하여, 선박의 운항을 최적화하는 방법의 다른 예를 설명한다. 도 9는 일 실시예에 따른 선박의 운항을 최적화하는 방법의 다른 예를 설명하기 위한 흐름도이다. 도 9의 810 단계 내지 830 단계 각각은, 도 4의 310 단계 내지 330 단계에 대응된다. 따라서, 810 단계 내지 830 단계에 대하여 중복되는 내용은 아래에서 생략한다. 840 단계에서, 프로세서는 최적 항해 정보를 이용하여 기 설정된 운전 방식으로 선박을 제어한다. 여기에 서, 운전방식은 선박의 액화가스 소모량을 최소화하는 운전 방식을 포함할 수 있다. 프로세서는 최적 항해 정보를 획득함에 있어서, 항차 중 최소 액화가스 소모량을 기준으로 선박의 구간별 속도 및 선박에 설치된 장비의 사용량을 예측하고, 예측된 선박의 구간별 속도에 기초하여 선박의 추진 엔진의 연료량을 산출하고, 예측된 장비의 사용량에 기초하여 장비의 가스 소모량을 산출할 수 있다. 그리고, 프로세서 는 산출된 추진 엔진의 연료량 및 장비의 가스 소모량에 기초하여, 액화가스 소모량을 결정할 수 있다. 따 라서, 최적 항해 정보에 포함된 선박의 BOG 발생량, 선박의 탱크 압력 값, 선박의 항해 구간별 속도, 선박의 액 화가스 소모량 및 선박에 설치된 장비의 사용량은 항차 중 최소 액화가스 소모량을 기준으로 생성된 값일 수 있 다. 즉, 프로세서는 상술한 방법에 의해 획득한 최적 항해 정보를 이용하여 선박을 제어하는 경우, 선박의 액화가스 소모량을 최소화하는 운전 방식으로 선박을 제어할 수 있다. 도 10은 일 실시예에 따른 BOG 발생량을 예측하는 방법의 일 예를 설명하기 위한 도면이다. 도 10을 참조하면, 적어도 하나의 탱크를 포함하는 선박의 일 예가 도시되어 있다. 선박의 운항 과정에서 탱크 내에서는 BOG가 발생할 수 있다. BOG를 처리하는 방법으로, 추진엔진(Main Engine) 또는 발전엔진(Generator Engine)의 연료로 사용하는 방법, 재액화(Reliquefaction)시키는 방법, GCU(Gas Combustion Unit)에서 소각시키는 방법 등이 있다. 위와 같은 방 법으로 BOG를 효율적으로 처리하기 위해 BOG의 발생량을 예측하는 것이 필요하다. 종래에는 BOG 발생량은 운항경로의 기상 상태, 온도, 슬로싱(Sloshing) 등에 따라 수시로 변화하므로 정확한 BOG 발생량을 예측하는 데에는 한계가 있었다. 일 실시예에 따른 선박의 BOG 발생량을 예측하는 방법에 따르면, 선박의 운항 데이터 중에서 BOG 발생량 예측 모델의 입력 데이터가 선정된다. 그리고, 입력 데이터를 통하여 BOG 발생량 예측 모델이 학습되고, 학습된 예측 모델을 통하여 BOG 발생량이 예측된다. 따라서, 화물운송계약서에서 보증한 BOG 발생량에 맞추어 액화가스 운반선의 운항이 가능할 수 있다. 또한, 선 박의 운항 시에 기상 상황이 변화하므로, 선박으로부터의 BOG 발생량과 기상 상황과의 상관관계를 도출될 수 있 다. 이하, 도 2 및 도 11 내지 도 17을 참조하여, 본 개시의 일 실시예에 따른 선박의 BOG 발생량을 예측하는 방법 및 장치에 대해 상세히 서술한다. 도 2를 참조하면, 통신 모듈은 외부 서버 또는 외부 장치로부터 기존 운항 데이터에 대한 정보, 현재 운항 데이터에 대한 정보, 날씨 정보 등을 수신할 수 있다. 또한, 메모리에는 기존의 운항 데이터, 현재 운항 데이터, 날씨 정보, 프로세서의 동작에 따라 생성된 데이터 등 다양한 데이터가 저장될 수 있다. 프로세서는, 메모리에 저장된 프로그램들을 실행함으로써, 장치의 동작을 제어할 수 있다. 일 예로, 프로세서는 도 11 내지 도 17을 참조하여 서술하는, 선박의 BOG 발생량을 예측하는 방법 중 적어도 일부를 수행할 수 있다. 다시 말해, 프로세서는, 입력 데이터 선정 모델을 이용하여 기존의 운항 데이터 중에서 BOG 발생량 예측 모델의 입력 데이터를 선정하고, 입력 데이터를 이용하여 복수의 딥러닝 모델들을 포함하는 BOG 발생량 예측 모 델을 학습하고, 선박의 현재 운항 데이터를 이용하여 학습된 BOG 발생량 예측 모델로부터 BOG 발생량을 예측할 수 있다. 프로세서는 입력 데이터 선정 모델을 이용하여 기존의 운항 데이터 중에서 BOG 발생량 예측 모델의 입력 데이터를 선정할 수 있다. 예를 들어, 프로세서는 일부의 기 저장된 운항 데이터와 BOG 발생량 간의 상관계수를 계산하고, 계산된 상 관계수를 이용하여 입력 데이터 선정 모델을 학습하며, 학습된 입력 데이터 선정 모델을 이용하여 상관계수가 소정의 수치 이상인 데이터를 입력 데이터로 선정할 수 있다. 또한, 복수의 딥러닝 모델들 중 적어도 하나는 스태킹 모델(Stacking Model)을 포함하고, 스태킹 모델은 복수의 서브 딥러닝 모델들을 포함할 수 있다. 프로세서는 입력 데이터를 이용하여 복수의 딥러닝 모델들을 포함하는 BOG 발생량 예측 모델을 학습할 수 있다. 예를 들어, 프로세서는 학습을 위한 정답 데이터를 산출하고, 입력 데이터와 산출된 정답 데이터를 이용하여 학습하며, 다른 일부의 기 저장된 운항 데이터를 이용하여 BOG 발생량 예측 모델을 검증할 수 있다. 여기에서, 정답 데이터는, 가스 소모량, 가스 온도 변화 값 및 단열재 온도 변화 값 중 적어도 어느 하나를 이 용하여 산출될 수 있다. 프로세서는 선박의 현재 운항 데이터를 이용하여 학습된 BOG 발생량 예측 모델로부터 BOG 발생량을 예측할 수 있다. 예를 들어, 프로세서는 복수의 딥러닝 모델들 각각의 최초 BOG 발생량 예측 값들을 출력하고, 최 초 BOG 발생량 예측 값들 각각에 서로 다른 가중치를 적용하여 최종 BOG 발생량 예측 값을 연산할 수 있다. 여기에서, 프로세서는 최초 BOG 발생량 예측 값들 중 스태킹 모델로부터 출력된 최초 BOG 발생량 예측 값 에 가장 높은 가중치를 적용할 수 있다. 이하, 도 11 내지 도 17을 참조하여 본 개시의 일 실시예에 따른 선박의 BOG 발생량을 예측하는 방법에 대해 상 세히 서술한다. 도 11은 일 실시예에 따른 선박의 BOG 발생량을 예측하는 방법의 일 예를 설명하기 위한 흐름도이다. 도 11을 참조하면, 선박의 BOG 발생량을 예측하는 방법은 단계 1110 내지 1130을 포함할 수 있다. 다만, 이에 제한되는 것은 아니고, 도 11에 도시되는 단계들 외에 다른 범용적인 단계들이 선박의 BOG 발생량을 예측하는 방법에 더 포함될 수 있다. 또한, 도 2 및 도 10을 참조하여 상술한 바와 같이, 도 11에 도시된 흐름도의 단계 들 중 적어도 하나는 프로세서에서 처리될 수 있다. 단계 1110에서 프로세서는 입력 데이터 선정 모델을 이용하여 기존의 운항 데이터 중에서 BOG 발생량 예측 모델의 입력 데이터를 선정할 수 있다. 예를 들어, 프로세서는 기존의 운항 데이터와 BOG 발생량 간의 상관계수를 계산하고, 계산된 상관계수를 이용하여 입력 데이터 선정 모델을 학습하고, 학습된 입력 데이터 선정 모델을 이용하여 상관계수가 소정의 수 치 이상인 데이터를 입력 데이터로 선정할 수 있다. 먼저, 프로세서는 상관계수를 계산한다. 예를 들어, 프로세서는 기존의 운항 데이터와 BOG 발생량 간 의 선형 상관계수를 계산할 수 있다. 그리고, 프로세서는 기존의 운항 데이터 중에서 선형 상관계수가 0.1 이상인 데이터를 입력 데이터 선정 모델의 학습 데이터로 이용할 수 있다. 여기에서, 선형 상관 계수는 피어슨 상관계수(Pearson correlation coefficient)를 의미할 수 있다. 피어슨 상관계수는 두 변수의 공분산을 표준 편 차의 곱으로 나눈 값을 의미한다. 다만, 프로세서가 계산하는 선형 상관계수의 예는 상술한 피어슨 상관계 수에 한정되지 않는다. 프로세서는 입력 데이터 선정 모델을 학습한다. 예를 들어, 프로세서는 학습된 입력 데이터 선정 모 델을 이용하여 기존의 운항 데이터 중에서 입력 데이터를 선정할 수 있다. 여기에서, 딥러닝 모델은, 기계 학습(Machine Learning) 기술과 인지과학에서, 심층 신경망(Deep Neural Network)을 기반으로 계층화된 알고리즘 구조를 사용하는 기계 학습 알고리즘의 집합을 의미한다. 예를 들어, 딥러닝 모델은, 외부로부터 입력 신호 또는 데이터를 수신하는입력층(input layer)과 입력 데이터에 대응한 출력 신호 또는 데이터를 출력하는 출력층(output layer), 입력층과 출력층 사이에 위치하며 입력층으로 부터 신호를 받아 특성을 추출하여 출력층으로 전달하는 적어도 하나의 은닉층(hidden layer)으로 구성될 수 있 다. 출력층은 은닉층으로부터 신호 또는 데이터를 수신하여 외부로 출력한다. 따라서, 입력 데이터 선정 모델은 일부의 기 저장된 운항 데이터를 수신하고, 선형 상관계수가 0.1 이상인 데이 터(예를 들어, 가스 소모량 등)를 추출하도록 학습될 수 있다. 또한, 프로세서는 입력 데이터를 선정한다. 예를 들어, 프로세서는 가스 소모량, 화물 적재량(예를 들어, 탱크 내의 액화가스 수위) 등이 포함되는 입력 데이터를 선정할 수 있다. 여기에서, 가스 소모량은 추진 엔진(Main Engine), 발전엔진(Generator Engine), 가스연소장치(Gas Combustion Unit) 및 재액화장치 (Reliquefaction)에서의 가스 소모량을 이용하여 계산될 수 있다. 또한, 프로세서는 가스 소모량, 화물 적 재량(예를 들어, 탱크 내의 액화가스 수위), 수온, 기온, 기압, 선박의 속도, 파도의 높이 및 너울의 높이 등이 포함되는 입력 데이터를 선정할 수 있다. 이하, 도 12를 참조하여, 프로세서가 가스 소모량을 계산하는 일 예를 설명한다. 도 12는 일 실시예에 따른 선박의 가스 소모량을 계산하는 일 예를 설명하기 위한 도면이다. 도 12를 참조하면, 프로세서는 추진엔진의 가스 소모량, 발전엔진의 가스 소모량, 가스연소장 치의 가스 소모량 및 재액화장치의 가스 소모량을 이용하여 가스 소모량을 계산한다. 일 예 시로, 추진엔진의 가스 소모량, 발전엔진의 가스 소모량 및 가스연소장치의 가스 소모량을 합한 값과 재액화장치의 가스 소모량의 차이를 계산할 수 있다. 종래 가스 기화량을 입력 데이터로 이용하는 경우에는, 기화된 가스를 사용했는지 여부, 배출했는지 여부, 재액 화했는지 여부 등에 대한 정보가 없어 정확한 BOG 발생량을 예측할 수 없었다. 따라서, 가스 기화량이 아닌 가스 소모량을 계산하여 입력 데이터로 이용함으로써 시간 단위의 BOG 발생 량을 예측할 수 있으며, 선박의 효율적인 운항이 가능할 수 있다. 또한, 화물운송계약서에서 정한 BOG 발생량 기준을 충족하는지 여부를 실시간으로 확인할 수 있다. 다시 도 11을 참조하면, 단계 1120에서 프로세서는 입력 데이터를 이용하여 복수의 딥러닝 모델들을 포함 하는 BOG 발생량 예측 모델을 학습할 수 있다. 예를 들어, 복수의 딥러닝 모델들 중 적어도 하나는 스태킹 모델(Stacking Model)을 포함할 수 있다. 또한, 스 태킹 모델은 서브 딥러닝 모델들을 포함할 수 있다. 여기에서, 스태킹 모델은, 복수의 서브 딥러닝 모델들의 출력 데이터를 하나의 딥러닝 모델의 학습 데이터로 이 용하는 알고리즘을 의미한다. 이하, 도 13a 내지 도 13c를 참조하여, BOG 발생량 예측 모델의 일 예를 설명한다. 도 13a는 일 실시예에 따른 스태킹 모델의 일 예를 도시한 구성도이다. 도 13a를 참조하면, 스태킹 모델은 제1 서브 딥러닝 모델 내지 제n 서브 딥러닝 모델 및 제 n+1 서브 딥러닝 모델을 포함할 수 있다. 여기에서, n은 3 이상의 자연수이다. 일 예시로, 제1 서브 딥러 닝 모델 내지 제n+1 서브 딥러닝 모델은 각각 같은 딥러닝 모델일 수 있다. 또한, 제1 서브 딥러닝 모델 내지 제n+1 서브 딥러닝 모델은 각각 다른 딥러닝 모델일 수 있다. 다른 예시로, 제1 서브 딥러닝 모델 내지 제n 서브 딥러닝 모델 중 적어도 하나는 복수의 딥러닝 모델을 포함할 수 있다. 예를 들어, 프로세서는 동일한 학습 데이터를 이용하여 제1 서브 딥러닝 모델 내지 제n 서브 딥러닝 모델을 학습한다. 학습된 각 서브 딥러닝 모델들(1311, 1312)로부터 제1 예측 값 내지 제n 예측 값 이 출력된다. 출력된 제1 예측 값 내지 제n 예측 값은 제n+1 서브 딥러닝 모델의 학습 데이터로 이용된다. 그리고, 제n+1 서브 딥러닝 모델의 출력 데이터는 선박의 BOG 발생량 예측 모 델의 제m 최초 출력 값으로 이용된다. 도 13b는 일 실시예에 따른 선박의 BOG 발생량 예측 모델의 일 예를 도시한 구성도이다. 도 13b를 참조하면, 선박의 BOG 발생량 예측 모델은 제1 딥러닝 모델 내지 제m 딥러닝 모델 을 포함할 수 있다. 여기에서, m은 4 이상의 자연수이다. 예를 들어, 제1 딥러닝 모델 내지 제m 딥 러닝 모델 중 적어도 하나는 스태킹 모델일 수 있다. 선박의 BOG 발생량 예측 모델은 복수의 딥러닝 모델들을 포함하므로, 선박의 BOG 발생량의 예측 정확도를 향상 시킬 수 있다. 예를 들어, 복수의 딥러닝 모델들 각각의 예측 결과를 이용하기 때문에 다양성(Diversity)을 확보할 수 있다. 따라서, 다양한 예측 결과들을 이용하면 복수의 딥러닝 모델들을 포함하는 선박의 BOG 발생량 예측 모델의 일반 화(Generalization) 성능이 향상될 수 있다. 여기에서, 일반화란, 딥러닝 모델이 학습 데이터 이외의 새로운 데이터에 대해서도 정확한 예측을 수행하는 능 력을 의미한다. 다시 말해, 과대적합(Overfitting) 또는 과소적합(Underfitting)되지 않고 새로운 데이터에 대 해서도 정확도를 유지하는 것을 의미한다. 여기에서, 과대적합은 딥러닝 모델이 학습 데이터에만 높은 정확도를 보이고 학습 데이터 이외의 데이터에는 낮은 정확도를 보이는 것을 의미하며, 과소적합은 딥러닝 모델이 학습 데이터를 충분히 학습하지 못해 학습 데이터와 학습 데이터 이외의 데이터 모두에서 낮을 정확도를 보이는 것을 의미한다. 또한, 각 예측 결과는 서로 독립적이므로 하나의 예측 값이 정확도가 떨어지는 경우에도 정확도가 높은 다른 복 수의 예측 값들을 이용하여 정확도를 향상시킬 수 있다. 도 13c는 일 실시예에 따른 스태킹 모델을 포함하는 선박의 BOG 발생량 예측 모델을 간략히 도시한 도면이다. 도 13c를 참조하면, 도 13c의 제m 딥러닝 모델은 도 13b의 제m 딥러닝 모델과 대응되며, 도 13c의 스태킹 모델은 도 13a의 스태킹 모델과 대응된다. 마찬가지로, 도 13a의 제m 최초 출력 값, 도 13b의 제m 최초 출력 값 및 도 13c의 제m 최초 출력 값(1333, 1334)은 모두 대응된다. 예를 들어, 프로세서는 학습을 위한 정답 데이터를 산출하고, 입력 데이터와 산출된 정답 데이터를 이용하 여 BOG 발생량 예측 모델을 학습하며, 다른 일부의 기 저장된 운항 데이터를 이용하여 BOG 발생량 예측 모델을 검증할 수 있다. 예를 들어, 프로세서는 가스 소모량, 가스 온도 변화 값 및 단열재 온도 변화 값 중 적어도 어느 하나를 이용하여 정답 데이터를 산출할 수 있다. 먼저, 프로세서는 정답 데이터를 산출하고, 산출된 정답 데이터와 입력 데이터를 이용하여 BOG 발생량 예 측 모델을 학습한다. 예를 들어, 프로세서는 지도 학습을 위한 정답 데이터를 산출할 수 있다. 프로세서 가 BOG 발생량 예측 모델을 정답 데이터를 이용하여 지도 학습함으로써 모델의 정확도가 향상될 수 있다. 여기에서, 지도 학습(Supervised Learning)이란, 훈련 데이터(Training Data)를 이용하여 학습하여 출력 데이 터가 정답 데이터에 가까운 값을 출력할 수 있도록 하는 기계 학습(Machine Learning)의 한 방법이다. 또한, 검 증 데이터(Test Data)를 이용하여 지도 학습된 모델의 성능을 평가한다. 이하, 도 14를 참조하여, 프로세서가 정답 데이터를 산출하는 일 예를 설명한다. 도 14는 일 실시예에 따른 학습을 위한 정답 데이터를 산출하는 일 예를 설명하기 위한 도면이다. 도 14를 참조하면, 프로세서는 가스 소모량, 가스 온도 변화 값 및 단열재 온도 변화 값 을 이용하여 정답 데이터를 산출할 수 있다. 일 예시로, 프로세서는 가스 소모량과 가스 온도 변화 값을 합한 값과 단열재 온도 변화 값의 차이를 정답 데이터로 산출할 수 있다. 다른 예 시로, 프로세서는 가스 소모량, 가스 온도 변화 값, 단열재 온도 변화 값 및 가스 배출량(Liquefied Gas Consumption)을 이용하여 정답 데이터를 산출할 수 있다. 여기에서, 탱크 내부의 가스 온도는 탱크 외부 온도의 영향을 받으므로, 가스 온도 변화 값은, 탱크 내부 의 가스 온도와 탱크 외부의 온도를 모두 고려한 가스 온도 변화 값일 수 있다. 그리고, 프로세서는 다른 일부의 기 저장된 운항 데이터를 이용하여 BOG 발생량 예측 모델을 검증할 수 있 다. 예를 들어, 기 저장된 운항 데이터를 입력 데이터 선정 모델의 학습 데이터와 선박의 BOG 발생량 예측 모델 의 검증 데이터로 분리할 수 있다. 또한, 선박의 BOG 발생량 예측 모델을 검증함으로써 모델의 성능을 평가하고, 추가로 학습을 할 수 있다. 이하, 도 15a 내지 도 15b를 참조하여, 프로세서이 기 저장된 운항 데이터를 학습 데이터와 검증 데이터로 분리하는 일 예를 설명한다. 도 15a는 일 실시예에 따른 프로세서가 메모리에 저장된 데이터 중 소실 데이터(Loss data)를 제거하 는 것을 설명하기 위한 도면이다. 도 15a를 참조하면, 프로세서는 메모리에 기 저장된 운항 데이터 중 소실 데이터를 제거 한다. 소실 데이터는 기 저장된 운항 데이터 중 계측 오류에 의해 데이터가 저장되지 않은 부분을 의미한다. 소실 데이터는 모델의 정확도에 영향을 미칠 수 있기 때문에 프로세서는 소실 데이터 를 제거할 수 있다. 도 15b는 일 실시예에 따른 기 저장된 운항 데이터의 일부 데이터를 입력 데이터 선정 모델의 학습 데이터로, 다른 일부 데이터를 선박의 BOG 발생량 예측 모델의 검증 데이터로 분리하는 일 예를 설명하기 위한 도면이다. 그리고, 프로세서는 소실 데이터를 제거한 기 저장된 운항 데이터를 입력 데이터 선정 모델의 학습 데이터와 선박의 BOG 발생량 예측 모델의 검증 데이터로 분리한다. 여기에서, 기 저장된 운항 데이터를 학습 데이터와 검증 데이터로 분리하는 것은, 모델이 충 분히 학습되지 않은 상태 또는 모델이 과적합(Over fitting) 상태를 방지하기 위함이다. 여기에서, 과적합은, 모델이 훈련 데이터에 대해 과도하게 학습하는 경우, 훈련 데이터가 입력되면 정확도가 매우 높지만, 다른 데이 터가 입력되면 모델의 정확도가 매우 낮아지는 것을 의미한다. 다시 도 11을 참조하면, 단계 1130에서 프로세서는 선박의 현재 운항 데이터를 이용하여 학습된 BOG 발생 량 예측 모델로부터 BOG 발생량을 예측할 수 있다. 먼저, 프로세서는 선박의 현재 운항 데이터를 획득한다. 예를 들어, 선박의 현재 운항 데이터는 추진 엔진 에서의 가스 소모량, 발전 엔진에서의 가스 소모량, 가스연소장치에서의 가스 소모량, 재액화장치에서의 가스 소모량, 탱크 내의 온도, 탱크 내의 압력, 화물 적재량(예를 들어, 탱크 내의 액화가스 수위), 수온, 기온, 기 압, 파도의 높이 및 선박의 가스 소모량 등을 포함할 수 있다. 다만, 이는 예시적인 것일 뿐이며, 선박의 현재 운항 데이터는 이에 한정되지 않는다. 또한, 통신 모듈는 기상정보센터로부터 기온, 기압, 파도의 높이 등 에 대한 데이터를 획득할 수 있다. 이하, 도 16a 내지 16b를 참조하여, 프로세서가 선박의 현재 운항 데이터를 획득하는 일 예를 설명한다. 도 16a는 일 실시예에 따른 선박의 외부에서 선박의 현재 운항 데이터를 획득하는 일 예를 설명하기 위한 도면 이다. 도 16a를 참조하면, 프로세서는 선박의 외부에서 선박의 현재 운항 데이터를 획득할 수 있다. 일 예 시로, 프로세서는 선박의 외부에서 수온, 파도의 높이, 등에 대한 데이터를 획득할 수 있다. 도 16b는 일 실시예에 따른 선박의 내부에서 선박의 현재 운항 데이터를 획득하는 일 예를 설명하기 위한 도면 이다. 도 16b를 참조하면, 프로세서는 선박의 내부에서 선박의 현재 운항 데이터를 획득할 수 있다. 구체 적으로, 선박의 내부에 있는 탱크에서 탱크 내의 온도, 탱크 내의 압력 및 화물 적재량 등의 데이 터를 획득할 수 있다. 또한, 추진 엔진에서 추진 엔진에서의 가스 소모량, 발전 엔진에서 발전 엔 진의 가스 소모량, 가스연소장치에서 가스 소모량 및 재액화장치에서 가스 소모량 등의 데이터를 획득할 수 있다. 다만, 이는 예시적인 것일 뿐이며, 상술한 선박의 현재 운항 데이터를 획득하는 장소는 이에"}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 않는다. 또한, 설명의 편의를 위해 도 16b에는 설명에 필요한 선박의 장비만을 도시하였으므로, 선박의 장비에는 과냉각장치, 연료공급펌프, 축발전기 등이 더 포함될 수 있음은 본 발명과 관련된 기술분야의 통상의 기술자에게 자명하다. 예를 들어, 프로세서는 복수의 딥러닝 모델들 각각의 최초 BOG 발생량 예측 값들을 출력하고, 최초 BOG 발 생량 예측 값들 각각에 서로 다른 가중치를 적용하여 최종 BOG 발생량 예측 값을 연산할 수 있다. 예를 들어, 프로세서는 최초 BOG 발생량 예측 값들 중 스태킹 모델로부터 출력된 최초 BOG 발생량 예측 값 에 가장 높은 가중치를 적용할 수 있다. 먼저, 프로세서는 복수의 딥러닝 모델들 각각의 최초 BOG 발생량 예측 값들을 출력할 수 있다. 예를 들어, 프로세서는 선박의 BOG 발생량 예측 모델에 포함되는 제1 딥러닝 모델 내지 제m 딥러닝 모델의 출력 값으 로써 제1 최초 출력 값 내지 제m 최초 출력 값을 출력할 수 있다. 또한, 제m 딥러닝 모델은 스태킹 모델일 수 있다. 그리고, 프로세서는 최초 BOG 발생량 예측 값들 각각에 서로 다른 가중치를 적용하여 최종 BOG 발생량 예 측 값을 연산할 수 있다. 또한, 프로세서는 스태킹 모델로부터 출력된 최초 BOG 발생량 예측 값에 가장 높 은 가중치를 적용할 수 있다. 여기에서, 가중치(Weight)는 각 데이터의 중요도를 표현하는 것으로, 데이터마다 가중치를 적용하여 모델의 학 습 정확도를 향상시킬 수 있다. 따라서, 데이터의 중요도가 높을수록 높은 가중치를 적용할 수 있다. 일 예로서, 프로세서는 최초 BOG 발생량 예측 값들 각각에 서로 같은 가중치를 적용하여 최종 BOG 발생량 예측 값을 연산할 수 있다. 다른 예로서, 프로세서는 최초 BOG 발생량 예측 값들 각각에 서로 다른 가중치 를 적용하여 최종 BOG 발생량 예측 값을 연산할 수 있다. 또 다른 예로서, 프로세서는 최초 BOG 발생량 예 측 값들 중 스태킹 모델로부터 출력된 최초 BOG 발생량 예측 값에 가장 높은 가중치를 적용할 수 있다. 스태킹 모델은 서브 딥러닝 모델을 포함하므로 중요도가 높을 수 있는 바, 스태킹 모델로부터 출력된 최초 BOG 발생량 예측 모델에 높은 가중치를 적용할 수 있다. 이하 도 17을 참조하여, 선박의 BOG 발생량 예측 모델로부터 BOG 발생량을 예측하는 일 예를 설명한다. 도 17은 일 실시예에 따른 최초 BOG 발생량 예측 값들에 가중치를 적용하여 최종 BOG 발생량 예측 값을 연산하 는 일 예를 설명하기 위한 도면이다. 도 17을 참조하면, 프로세서는 선박의 BOG 발생량 예측 모델에 포함되는 제1 딥러닝 모델 내 지 제m 딥러닝 모델의 최초 출력 값들을 출력할 수 있다. 여기에서, 제m 딥러닝 모델은 스태킹 모 델일 수 있다. 또한, 제m 최초 출력 값은 스태킹 모델로부터 출력된 최초 출력 값일 수 있다. 선박의 BOG 발생량 예측 모델에 포함되는 제1 딥러닝 모델 내지 제m 딥러닝 모델의 최초 출 력 값들 중 스태킹 모델, 즉 제m 딥러닝 모델의 정확도가 가장 높을 수 있다. 제1 최초 출력 값 내지 제m 최초 출력 값에 가중치 내지 가중치 를 적용할 수 있다. 가중치 내지 가중치 는 각각 같은 값일 수 있다. 또한, 가중치 내지 가중치 는 각각 다른 값일 수 있다. 가중치 내지 가중치 중에서 스태킹 모델로부터 출력 된 제m 최초 출력 값의 가중치 이 가장 큰 값일 수 있다. 따라서, 프로세서는 선박의 BOG 발생량 예측 모델로부터 실제 BOG 발생량에 가까운 최종 출력 값, 즉 BOG 발생량 예측 값을 획득할 수 있다. 도 18은 일 실시예에 따른 선박의 탱크 압력을 예측하는 방법의 일 예를 설명하기 위한 도면이다. 도 18을 참조하면, 적어도 하나의 탱크를 포함하는 선박의 일 예가 도시되어 있다. 선박의 운항 과정에서 탱크 내에서는 BOG가 발생할 수 있고, 이로 인해 탱크 내부의 압력이 증가할 수 있다. 이와 같이, BOG가 발생하여 탱크에 적재된 액화가스의 부피가 늘어나고, 결국 탱크 내부의 압력이 증가한다. 탱크 내부의 압력이 증가하면, 탱크의 안전성이 감소하여 탱크가 폭발할 가능성이 있다. 이러한 위험을 방지하기 위해 BOG를 방출하는데, 이 과정에서 환경오염을 일으킬 수 있다. 종래에는, 탱크의 압력은 운항경로의 기상 상태, 온도, 슬로싱(Sloshing) 등에 따라 수시로 변화하므로 정확한 탱크의 압력을 예측하는 데에는 한계가 있었다. 일 실시예에 따른 선박의 탱크 압력을 예측하는 방법에 따르면, 기 저장된 실제 운항 데이터를 이용하여 복수의 딥러닝 모델을 학습한다. 그리고, 탱크 내에서의 액화가스의 수위에 따라 복수의 항해 모드들 중 하나를 선택하 고, 선택된 항해 모드에 대응하는 딥러닝 모델을 이용하여 선박의 탱크의 압력을 예측한다. 따라서, 탱크 내부의 실시간 압력을 예측하여 미래 상황에 대한 대처가 가능할 수 있다. 또한, 본 발명의 과제 해결 수단에 의하면, 선박의 운항에 필요한 장비들의 사용량을 효율적으로 제어할 수 있다. 이하, 도 2 및 도 19 내지 도 24를 참조하여 본 개시의 일 실시예에 따른 선박의 탱크 압력을 예측하는 방법 및 장치에 대해 상세히 서술한다. 도 2를 참조하면, 통신 모듈은 외부 서버 또는 외부 장치로부터 기존 운항 데이터에 대한 정보, 현재 운항 데이터에 대한 정보, 추천 항해 정보, 날씨 정보 등을 수신할 수 있다. 또한, 메모리에는 기존의 운항 데 이터, 현재 운항 데이터, 추천 항해 정보, 날씨 정보, 프로세서의 동작에 따라 생성된 데이터 등 다양한 데이터가 저장될 수 있다. 프로세서는, 메모리에 저장된 프로그램들을 실행함으로써, 장치의 동작을 제어할 수 있다. 일 예로, 프로세서는 도 19 내지 도 24를 참조하여 서술하는, 선박의 탱크 압력을 예측하는 방법 중 적어도 일부를 수행할 수 있다. 다시 말해, 프로세서는, 기 저장된 실제 운항 데이터를 이용하여 선박의 항해에 대한 복수의 항해 모드들 각각에 대응하는 딥러닝 모델을 학습하고, 탱크 내에서의 액화가스의 수위에 따라 복수의 항해 모드들 중 하나 를 선택하며, 선택된 항해 모드에 대응하는 딥러닝 모델을 이용하여 추천 항해 정보로부터 탱크의 압력을 예측 할 수 있다. 먼저, 프로세서는 기 저장된 실제 운항 데이터를 이용하여 선박의 항해에 대한 복수의 항해 모드들 각각에 대응하는 딥러닝 모델을 학습할 수 있다. 예를 들어, 프로세서는 학습을 위한 정답 데이터를 획득하고, 기 저장된 실제 운항 데이터 중 일부와 정답 데이터를 이용하여 복수의 항해 모드들 각각에 대응하는 딥러닝 모델을 학습하며, 기 저장된 실제 운항 데이터 중 다른 일부를 이용하여 학습된 딥러닝 모델을 검증할 수 있다. 여기에서, 학습은, 정답 데이터와 딥러닝 모델의 출력 데이터 사이의 오차 및 역전파(Back propagation) 알고리 즘을 이용하여 수행될 수 있다. 또한, 프로세서는 탱크 내에서의 액화가스의 수위에 따라 복수의 항해 모드들 중 하나를 선택할 수 있다. 예를 들어, 프로세서는 탱크 내에서의 액화가스의 수위를 측정하고, 수위가 소정 높이 이상인 경우에는 복 수의 항해 모드들 중 제1 모드를 선택하며, 수위가 소정 높이 미만인 경우에는 복수의 항해 모드들 중 제2 모드 를 선택할 수 있다. 프로세서는 선택된 항해 모드에 대응하는 딥러닝 모델을 이용하여 추천 항해 정보로부터 탱크의 압력을 예 측할 수 있다. 예를 들어, 프로세서는 선박의 추천 항해 정보를 획득하고, 추천 항해 정보를 입력 데이터로 사용하여 복 수의 중간 값들을 획득하며, 복수의 중간 값들에 가중치를 적용하여 탱크의 압력 예측 값을 획득할 수 있다. 도 19는 일 실시예에 따른 선박의 탱크 압력을 예측하는 방법의 일 예를 설명하기 위한 흐름도이다. 도 19를 참조하면, 선박의 탱크 압력을 예측하는 방법은 단계 1910 내지 1930을 포함할 수 있다. 다만, 이에 제 한되는 것은 아니고, 도 19에 도시되는 단계들 외에 다른 범용적인 단계들이 선박의 탱크 압력을 예측하는 방법 에 더 포함될 수 있다. 또한, 도 2 및 도 18을 참조하여 상술한 바와 같이, 도 19에 도시된 흐름도의 단계들 중 적어도 하나는 프로세서에서 처리될 수 있다. 단계 1910에서 프로세서는 기 저장된 실제 운항 데이터를 이용하여 선박의 항해에 대한 복수의 항해 모드 들 각각에 대응하는 딥러닝 모델을 학습할 수 있다. 예를 들어, 프로세서는 학습을 위한 정답 데이터를 획득하고, 기 저장된 실제 운항 데이터 중 일부와 정답 데이터를 이용하여 복수의 항해 모드들 각각에 대응하는 딥러닝 모델을 학습하며, 기 저장된 실제 운항 데이터중 다른 일부를 이용하여 학습된 딥러닝 모델을 검증할 수 있다. 여기에서, 정답 데이터란, 딥러닝 모델을 지도학습(Supervised Learning)하기 위해 필요한 데이터로써, 딥러닝 모델이 예측하고자 하는 대상을 의미한다. 정답 데이터는 딥러닝 모델의 학습 과정에서 딥러닝 모델의 성능을 측정하고, 딥러닝 모델이 예측한 결과를 평가하는 데 사용된다. 또한, 지도학습은, 입력 데이터와 정답 데이터 사이의 관계를 학습하여, 새로운 입력 데이터가 입력되면 새로운 입력 데이터에 대한 결과를 예측하는 것을 목표로 하는 기계학습(Machine Learning) 방법 중 하나이다. 먼저, 프로세서는 학습을 위한 정답 데이터를 획득한다. 예를 들어, 프로세서는 정답 데이터로써 기 저장된 실제 운항 데이터 중 현재 항해와 유사한 항해 조건에 서의 실제 탱크 압력 값을 획득할 수 있다. 또한, 항해 조건은 날씨 정보, 구간별 항해 속도, 총 평균 속도 및 입/출항 시 탱크 내의 액화가스의 양 등을 포함할 수 있다. 예를 들어, 기 저장된 실제 운항 데이터는 선박의 위도, 경도, 액화가스 배출량, 속도, 파고, 파도 주기, 파도 방향, 너울 높이, 너울 주기, 너울 방향, 풍속, 기온, 기압 및 수온을 포함할 수 있다. 일 예시로, 실제 탱크 압력 값은 항해 구간별 탱크 압력 값일 수 있다. 다른 예시로, 실제 탱크 압력 값은 운항 시의 평균 탱크 압력 값일 수 있다. 예를 들어, 프로세서는 기 저장된 실제 운항 데이터 중 일부와 정답 데이터를 이용하여 복수의 항해 모드 들 각각에 대응하는 딥러닝 모델을 학습한다. 따라서, 복수의 항해 모드들 각각에 대응하는 딥러닝 모델은 추천 항해 정보로부터 탱크의 압력을 예측하 도록 학습될 수 있다. 예를 들어, 프로세서는 기 저장된 실제 운항 데이터를 분리하여 학습 데이터와 검증 데이터로 사용할 수 있다. 이하, 도 20a를 참조하여, 프로세서가 기 저장된 실제 운항 데이터의 일부를 학습 데이터로, 다른 일부를 검증 데이터로 분리하는 일 예를 설명한다. 도 20a는 일 실시예에 따른 기 저장된 실제 운항 데이터의 일부를 학습 데이터로 분리하고, 다른 일부를 검증 데이터로 분리하는 일 예를 설명하기 위한 도면이다. 도 20a를 참조하면, 프로세서는 기 저장된 실제 운항 데이터를 기 저장된 실제 운항 데이터의 일부 와 기 저장된 실제 운항 데이터의 다른 일부로 분리한다. 분리된 기 저장된 실제 운항 데이터의 일 부는 딥러닝 모델의 학습 데이터로 사용되며, 다른 일부는 딥러닝 모델의 검증 데이터로 사용된다. 이하, 도 20b를 참조하여, 프로세서가 기 저장된 실제 운항 데이터를 가공하는 과정의 일 예를 상세 히 설명한다. 도 20b는 일 실시예에 따른 기 저장된 실제 운항 데이터를 가공하는 과정의 일 예를 설명하기 위한 도면이다. 도 20b를 참조하면, 프로세서는 노이즈 필터(Noise filter)를 이용하여 기 저장된 실제 운항 데이터(202 1)의 노이즈를 필터링한다. 여기에서, 노이즈 필터는, 사비츠키-골레이 필터(Savitzky-Golay filter)를 의미할 수 있다. 다만, 프로세서가 이용하는 노이즈 필터의 예는 상술한 사비츠키-골레이 필터에 한정되지 아니한 다. 프로세서는 노이즈를 필터링한 데이터를 정규화한다. 여기에서, 데이터 정규화 (Normalization)란, 딥러닝 모델을 학습할 때 입력 데이터의 스케일(Scale)을 조정하여 학습 속도를 높이 고, 딥러닝 모델의 성능을 개선하는 전처리(Preprocessing)과정 중 하나이다. 일 예시로, 데이터 정규화는 Min-Max 정규화 기법을 이용할 수 있다. Min-Max 정규화 기법은, 입력 데이 터의 값을 0과 1 사이의 범위로 변환하는 기법이다. 다른 예시로, 데이터 정규화는 표준 정규화 (Standardization) 기법을 이용할 수 있다. 표준 정규화 기법은 입력 데이터 값의 평균이 0이고, 분산이 1인 분 포로 변환하는 기법이다. 다만, 프로세서가 이용하는 정규화 기법의 예는 상술한 Min-Max 정규화 기법 또 는 표준 정규화 기법에 한정되지 아니한다. 프로세서는 정규화된 데이터를 항차에 따라 나눈다. 여기에서, 항차는, 항해의 차수를 의미한다. 또한, 프로세서는 나눠진 항차 별 데이터를 텐서(Tensor) 형태로 변환한다. 여기에서, 텐서 란, 다차원 배열(Multi-dimensional array)을 나타내는 수학적인 개념으로, 벡터(Vector)는 1차원 배열 을 나타내고, 행렬(Matrix)은 2차원 배열을 나타내며, 텐서는 3차원 이상의 배열을 나타낸다. 따라서, 딥 러닝 모델은 텐서를 이용해 입력 데이터와 딥러닝 모델의 파라미터를 나타낼 수 있다. 프로세서는 하나의 배치(Batch)를 10개의 텐서로 구성할 수 있다. 여기에서, 배치란, 딥러닝 모델의 입력 데이터를 한 번에 처리할 수 있는 입력 데이터의 집합을 의미한다. 일반적으로, 하나의 배 치는 여러 개의 입력 데이터를 포함하며, 각 입력 데이터는 모두 동일한 크기를 갖는다. 배치를 사 용함으로써, 딥러닝 모델의 일반화 성능을 개선하고, 효율적인 계산이 가능하다. 따라서, 프로세서는 배치 를 구성함으로써 딥러닝 모델을 반복 학습할 때 학습의 효율이 향상될 수 있다. 프로세서는 가공된 실제 운항 데이터를 이용함으로써 딥러닝 모델의 학습 효율을 향상시킬 수 있고, 딥러닝 모델의 예측 정확도를 높일 수 있다. 또한, 프로세서는 정답 데이터와 딥러닝 모델의 출력 데이터 사이의 오차 및 역전파(Back propagation) 알 고리즘을 이용하여 딥러닝 모델을 학습할 수 있다. 여기에서, 역전파 알고리즘이란, 지도학습 분야에서 사용되는 딥러닝 모델을 학습시키기 위한 알고리즘이다. 역 전파 알고리즘은 출력 데이터와 정답 데이터 사이의 오차를 계산하고, 계산된 오차를 이용하여 가중치(Weight) 와 편향(Bias)를 계산한다. 그리고, 계산된 가중치와 편향을 업데이트하여 출력 데이터와 정답 데이터 사이의 오차를 최소화하는 알고리즘이다. 이하, 도 21을 참조하여, 프로세서가 역전파 알고리즘을 이용하여 딥러닝 모델을 학습하는 일 예를 설명한 다. 도 21은 일 실시예에 따른 선박의 탱크 압력을 예측하는 딥러닝 모델을 학습하는 과정의 일 예를 설명하기 위한 도면이다. 도 21을 참조하면, 프로세서는 딥러닝 모델의 출력 데이터와 정답 데이터을 획득한다. 그리고, 프로세서는 손실함수를 사용하여 출력 데이터와 정답 데이터 사이의 오차를 산 출한다. 프로세서는 오차의 가중치와 편향을 계산하고, 역전파 알고리즘을 이용하여 가중치를 수정하는 과정을 반복함으로써 딥러닝 모델을 학습한다. 프로세서는 역전파 알고리즘을 이용하는 과정에서 가중치가 소실되는 문제를 예방하기 위해 사비에 르 초기화(Xavier Initialization) 방법을 이용하여 가중치를 초기화한다. 여기에서, 사비에르 초기화는, 가중 치를 초기화하는 방법 중 하나로써, 정규 분포(Normal Distribution)를 이용하여 가중치를 초기화한다. 다만, 프로세서가 이용하는 가중치를 초기화하는 방법의 예는 상술한 사비에르 초기화 방법에 한정되지 아니한다. 또한, 프로세서는 역전파 알고리즘을 이용할 때 최적의 가중치 값을 찾기 위해 RMSprop(Root Mean Square Propagation) 기법을 사용한다. 여기에서, RMSprop은, 딥러닝 모델을 빠르고 안정적으로 학습할 수 있도 록 도와주는 알고리즘으로써, 각 파라미터마다 최적의 가중치를 제공하여 효율적인 학습을 할 수 있다. 다만, 프로세서가 이용하는 최적의 가중치 값을 찾는 방법의 예는 상술한 RMSprop 기법에 한정되지 아니한다. 프로세서는 기 저장된 실제 운항 데이터 중 다른 일부를 이용하여 학습된 딥러닝 모델을 검증 할 수 있다. 여기에서, 검증이란, 딥러닝 모델의 성능을 평가하고, 딥러닝 모델이 일반화되었는지 확인하는 과정이다. 다시 말해, 과대적합(Overfitting) 또는 과소적합(Underfitting)을 방지하기 위한 과정이다. 상술한 프로세서가 딥러닝 모델을 학습하는 단계는, 선박의 항해에 대한 복수의 항해모드들 각각에 대응하는 딥러닝 모델들에 동일하게 적용될 수 있다. 다시 도 19를 참조하면, 단계 1920에서 프로세서는 탱크 내에서의 액화가스의 수위에 따라 복수의 항해 모 드들 중 하나를 선택할 수 있다. 예를 들어, 프로세서는 탱크 내에서의 액화가스의 수위를 측정하고, 수위가 소정 높이 이상인 경우에는 복 수의 항해 모드들 중 제1 모드를 선택하고, 상기 수위가 상기 소정 높이 미만인 경우에는 상기 복수의 항해 모드들 중 제2 모드를 선택할 수 있다. 이하, 도 22 내지 도 23을 참조하여, 프로세서가 액화가스의 수위에 따라서 복수의 항해 모드들 중 제1 모 드 또는 제2 모드를 선택하는 일 예를 설명한다. 도 22는 일 실시예에 따른 탱크 내에서의 액화가스의 수위가 소정 높이 이상인지 여부에 따른 항해 모드를 판단 하는 일 예를 설명하기 위한 도면이다. 도 22를 참조하면, 프로세서는 탱크 내에서의 액화가스의 수위를 측정하여, 액화가스의 수위가 소정 높이 이상인 경우인지, 액화가스의 수위가 소정 높이 미만인 경우인지 판단한다. 예를 들어, 소정 높이는 탱크의 절반 높이일 수 있다. 따라서, 프로세서는 액화가스의 수위가 탱크의 절반 높 이 이상인 경우에는 만선항해(Laden voyage)로 판단할 수 있으며, 액화가스의 수위가 탱크의 절반 높이 미만인 경우에는 공선항해(Ballast voyage)로 판단할 수 있다. 도 23은 일 실시예에 따른 탱크 내에서의 액화가스의 수위에 따른 복수의 항해 모드들 각각에 대응하는 딥러닝 모델의 일 예를 설명하기 위한 도면이다. 도 23을 참조하면, 프로세서는 액화가스의 수위가 탱크의 절반 높이 이상인 경우에는 제1 모드 를 선택하며, 액화가스의 수위가 탱크의 절반 높이 미만인 경우에는 제2 모드를 선택한다. 예를 들어, 제1 모드는 만선항해 모드, 제2 모드는 공선항해 모드일 수 있다. 또한, 제1 모드 의 딥러닝 모델은 LSTM 알고리즘을 사용할 수 있으며, 제2 모드의 딥러닝 모델은 GRU 알고리즘을 사용할 수 있다. 다만, 각 딥러닝 모델(2350, 2360)이 사용하는 알고리즘은 상술한 LSTM 알고리즘 및 GRU 알고리즘에 한정되지 아니한다. 다시 도 19를 참조하면, 단계 1930에서 프로세서는 선택된 항해 모드에 대응하는 딥러닝 모델을 이용하여 추천 항해 정보로부터 탱크의 압력을 예측할 수 있다. 예를 들어, 프로세서는 선박의 추천 항해 정보를 획득하고, 추천 항해 정보를 입력 데이터로 사용하여 복 수의 중간 값들을 획득하며, 복수의 중간 값들에 가중치를 적용하여 탱크의 압력 예측 값을 획득할 수 있다. 먼저, 프로세서는 선박의 추천 항해 정보를 획득한다. 프로세서는 도 4 내지 도 5를 참조하여 상술한 방법으로 추천 항해정보를 획득할 수 있다. 프로세서는 추천 항해 정보를 입력 데이터로 사용하여 복수의 중간 값들을 획득하고, 복수의 중간 값들에 가중치를 적용하여 탱크의 압력 예측 값을 획득할 수 있다. 이하, 도 24를 참조하여, 프로세서가 복수의 중간 값들에 가중치를 적용하여 탱크의 압력 예측 값을 획득 하는 일 예를 설명한다. 도 24는 일 실시예에 따른 복수의 중간 값들에 가중치를 적용하여 탱크의 압력 예측 값을 획득하는 일 예를 설 명하기 위한 도면이다. 도 24를 참조하면, 프로세서는 추천 항해 정보를 딥러닝 모델의 입력 데이터로 사용하여 중간 값을 획득할 수 있다. 일 예시로, 제1 모드인 경우, 즉, 만선항해 모드인 경우, 딥러닝 모델은 LSTM 알고리즘을 사용할 수 있다. 다른 예시로, 제2 모드인 경우, 즉, 공선항해 모드인 경우, 딥러닝 모델 은 GRU 알고리즘을 사용할 수 있다. 다만, 딥러닝 모델이 사용하는 알고리즘은 상술한 LSTM 알고리 즘 및 GRU 알고리즘에 한정되지 아니한다. 또한, 프로세서는 중간 값에 가중치를 적용하여 탱크의 압력 예측 값을 획득할 수 있다. 예를 들어, 프로세서는 Linear layer를 이용하여 중간 값에 가중치를 적용함으로써 탱 크의 압력 예측 값을 획득할 수 있다. 다만, 프로세서가 중간 값에 가중치를 적용하기 위한 방법은 Linear layer를 사용하는 방법에 한정되지 아니한다. 따라서, 프로세서는 선박의 탱크 내에서의 액화가스의 수위에 따라 다른 딥러닝 모델을 이용 하여 선박의 탱크 압력 값을 예측할 수 있다. 즉, 프로세서는 각 항해 모드마다 다른 딥러닝 모델을 이용하여 선박의 탱크 압력을 예측함으로써, 선박의 탱크 압력 예측 정확도를 향상시킬 수 있다. 도 25는 일 실시예에 따른 선박의 운항을 최적화하는 방법의 일 예를 설명하기 위한 도면이다. 도 25를 참조하면, 운항 최적화 모델은 BOG 발생량 및 탱크압력 값을 이용하여 선박의 제약조건 을 고려한 최적 항해정보를 획득할 수 있다. 여기에서, 운항 최적화 모델은 일 실시예에 따 른 선박의 운항을 최적화하는 방법을 구현하는데 이용되는 모델로서, 도 1 내지 도 9를 참조하여 상술한 선박의 운항을 최적화하는 방법을 구현하는 모델일 수 있다. 따라서, 이하 도 1 내지 도 9를 참조하여 상술한 선박의 운항을 최적화하는 방법을 구현하는 모델과의 차이점을 위주로 설명한다. 일 실시예에 따른 선박의 운항을 최적화하는 방법에 따르면, 선박의 추천 항해정보를 사용하여 선박의 BOG 발생 량과 선박의 탱크압력을 예측한다. 그리고, 예측된 BOG 발생량 및 탱크압력 값을 이용하여 선박의 제약조건 (Constraint)을 만족하는 항해 구간별 최적 항해정보를 획득하고, 획득한 항해 구간별 최적 항해정보를 이용하 여 선박의 동작을 제어한다. 여기에서, 제약조건의 구체적인 내용은 후술한다. 따라서, 일 실시예에 따른 선박의 운항을 최적화하는 방법에 의할 경우, 항해 구간별 최적 항해정보를 이용하여 선박의 가스 소모량을 최소화하는 경제적인 운항을 할 수 있다. 이하, 도 2 및 도 26 내지 도 28b를 참조하여 본 개시의 일 실시예에 따른 선박의 운항을 최적화하는 방법 및 장치에 대해 상세히 서술한다. 여기에서, 장치는 사용자 단말을 의미할 수 있다. 도 2를 참조하면, 통신 모듈은 외부 서버 또는 외부 장치로부터 기존 운항 데이터에 대한 정보, 현재 운항 데이터에 대한 정보, 추천 항해정보, 운항계획, 날씨정보 등을 수신할 수 있다. 또한, 메모리에는 기존의 운항 데이터, 현재 운항 데이터, 추천 항해정보, 운항계획, 날씨정보, 프로세서의 동작에 따라 생성된 데 이터 등 다양한 데이터가 저장될 수 있다. 프로세서는, 메모리에 저장된 프로그램들을 실행함으로써, 장치의 동작을 제어할 수 있다. 일 예로, 프로세서는 도 26 내지 도 28b를 참조하여 서술하는, 선박의 운항을 최적화하는 방법 중 적어도 일 부를 수행할 수 있다. 다시 말해, 프로세서는, 선박의 BOG 발생량 및 선박의 탱크압력 값을 이용하여 항해 구간별 최적 항해정보 를 획득하고, 선박의 제약조건(Constraint)을 고려하여 최적 항해정보를 업데이트하며, 업데이트된 최적 항해정 보를 이용하여 선박의 동작을 제어할 수 있다. 프로세서는 선박의 BOG 발생량 및 선박의 탱크압력 값을 이용하여 항해 구간별 최적 항해정보를 획득할 수 있다. 또한, 프로세서는 선박의 제약조건(Constraint)을 고려하여 최적 항해정보를 업데이트 할 수 있다. 여기에서, 제약조건은, 질량, 에너지, 전력량, 장비의 최대/최소 액화가스 소모량, 장비의 효율, 추진엔진(Main Engine)의 효율, 발전엔진(Generator Engine)의 효율, 축발전기의 효율, 탱크의 압력, 상기 선박의 최고/최저 속도 및 상기 선박의 평균 속도 사이의 관계 중 적어도 하나에 기초하여 설정될 수 있다. 예를 들어, 프로세서는 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는지 여부에 따 라 서로 다른 방식으로 최적 항해정보를 획득할 수 있다. 일 예시로, 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 경우, 프로세서는 BOG 발 생량, 탱크압력 값 및 추천 항해정보를 이용하여 최적 항해정보를 획득할 수 있고, 추천 항해정보는 기 설정된 날씨정보를 포함할 수 있다. 또한, 프로세서는 제n+1차 중간 항해정보에 포함된 가스 소모량과 제n차 중간 항해정보에 포함된 가스 소 모량의 차이를 계산하고, 차이가 기 설정된 범위에 포함되는지 여부를 판단하며, 판단 결과에 기초하여 제n+1차 중간 항해정보를 최적 항해정보로 확정할 수 있다. 여기에서, n은 1 이상의 자연수이고, 제n+1차 중간 항해정보 는 제n차 중간 항해정보에 포함된 적어도 하나의 파라미터 갱신 값에 기초하여 생성될 수 있다. 다른 예시로, 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하지 않는 경우, 프로세서는 BOG 발생량, 탱크압력 값 및 추천 항해정보를 이용하여 최적 항해정보를 획득할 수 있고, 추천 항해정보는 선박 의 운항에 따라 업데이트된 날씨정보를 포함할 수 있다. 또한, 프로세서는 제n+1차 중간 항해정보에 포함된 가스 소모량과 제n차 중간 항해정보에 포함된 가스 소 모량의 차이를 계산하고, 차이가 기 설정된 범위에 포함되는지 여부를 판단하며, 판단 결과에 기초하여 제n+1차 중간 항해정보를 최적 항해정보로 확정할 수 있다. 여기에서, n은 1 이상의 자연수이고, 제n+1차 중간 항해정보 는 제n차 중간 항해정보에 포함된 적어도 하나의 파라미터 갱신 값에 기초하여 생성될 수 있다. 또한, 프로세서는 업데이트된 최적 항해정보를 이용하여 선박의 동작을 제어할 수 있다. 예를 들어, 프로 세서는 최적 항해정보를 이용하여 설정된 운전방식으로 선박을 제어할 수 있고, 운전방식은 선박의 가스소모량을 최소화하는 운전방식을 포함할 수 있다. 도 26은 일 실시예에 따른 선박의 운항을 최적화하는 방법의 일 예를 설명하기 위한 흐름도이다. 도 26을 참조하면, 선박의 운항을 최적화하는 방법은 단계 2610 내지 2630을 포함할 수 있다. 다만, 이에 제한 되는 것은 아니고, 도 26에 도시되는 단계들 외에 다른 범용적인 단계들이 선박의 운항을 최적화하는 방법에 더 포함될 수 있다. 또한, 도 2 및 도 25를 참조하여 상술한 바와 같이, 도 26에 도시된 흐름도의 단계들 중 적어 도 하나는 프로세서에서 처리될 수 있다. 단계 2610에서 프로세서는 선박의 BOG 발생량 및 선박의 탱크압력 값을 이용하여 항해 구간별 최적 항해정 보를 획득할 수 있다. 먼저, 프로세서는 선박의 BOG 발생량을 예측할 수 있다. 일 예시로, 프로세서는 도 6을 참조하여 상 술한 방법으로 선박의 BOG 발생량을 예측할 수 있다. 다른 예시로, 프로세서는 도 2 및 도 10 내지 도 17 을 참조하여 상술한 선박의 BOG 발생량을 예측하는 방법 및 장치를 이용하여 선박의 BOG 발생량을 예측할 수 있 다. 다만, 선박의 BOG 발생량을 예측하는 방법은 상술한 방법들에 한정되지 아니한다. 또한, 프로세서는 선박의 탱크압력을 예측할 수 있다. 일 예시로, 도 6을 참조하여 상술한 방법으로 선박 의 탱크압력을 예측할 수 있다. 다른 예시로, 도 2 및 도 18 내지 도 24를 참조하여 상술한 선박의 탱크압력을 예측하는 방법 및 장치를 이용하여 선박의 탱크압력을 예측할 수 있다. 다만, 선박의 탱크압력을 예측하는 방법 은 상술한 방법들에 한정되지 아니한다. 프로세서는 선박의 BOG 발생량 및 선박의 탱크압력 값을 이용하여 항해 구간별 최적 항해정보를 획득할 수 있다. 예를 들어, 프로세서는 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는지 여부 에 따라 서로 다른 방식으로 최적 항해정보를 획득할 수 있다. 여기에서, 추천 항해정보는, 항해사가 선박을 출발지에서부터 도착지까지 효율적으로 운항하기 위한 추천 항해 정보일 수 있으며, 프로세서는 도 4 내지 도 5를 참조하여 상술한 방법으로 추천 항해정보를 생성할 수 있 다. 추천 항해정보는 도 4 내지 도 5를 참조하여 상술한 추천 항해정보는 물론, 항해 구간별 속도, 선박의 총 평균 속도, 시간에 따른 선박의 위도/경도 및 시간에 따른 날씨정보를 추가로 포함할 수 있다. 다만, 추천 항해 정보를 생성하는 방법은 상술한 방법에 한정되지 아니하며, 추천 항해정보는 상술한 추천 항해정보에 한정되지 아니한다. 이하, 도 27을 참조하여, 프로세서가 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 지 여부에 따라 서로 다른 방식으로 구분되는 일 예를 설명한다. 도 27은 일 실시예에 따른 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는지 여부에 따라 서로 다른 방식으로 최적 항해정보를 획득하는 일 예를 설명하기 위한 도면이다. 도 27을 참조하면, 프로세서는 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는지 여 부에 따라 서로 다른 방식으로 최적 항해정보를 획득할 수 있다. 일 예시로, 프로세서는 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 경우에 는 추천 항해정보에 포함된 항해 구간별 속도로 항해한다. 여기에서, 추천 항해정보에 포함된 항해 구간별 속도 는, 모든 항해 구간의 속도가 같을 수 있다. 또한, 추천 항해정보에 포함된 항해 구간별 속도는, 모든 항해 구 간의 속도가 다를 수 있다. 또한, 추천 항해정보에 포함된 항해 구간별 속도는, 일부 항해 구간의 속도만 같을 수 있다. 다른 예시로, 프로세서는 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하지 않는 경우 에는 최적 항해정보에 포함된 항해 구간별 속도로 항해한다. 여기에서, 최적 항해정보에 포함된 항해 구 간별 속도는, 모든 항해 구간의 속도가 같을 수 있다. 또한, 최적 항해정보에 포함된 항해 구간별 속도는, 모든 항해 구간의 속도가 다를 수 있다. 또한, 최적 항해정보에 포함된 항해 구간별 속도는, 일부 항해 구간의 속도 만 같을 수 있다. 다만, 프로세서가 추천 항해정보에 포함된 항해 구간별 속도를 이용하지 않는 경우 에도, 추천 항해정보에 포함된 총 평균 속도를 이용할 수 있다. 이하, 프로세서가 최적 항해정보를 획득하는 과정을 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 경우와 이용하지 않는 경우로 나누어 상세히 설명한다. 예를 들어, 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 경우, 프로세서는 BOG 발 생량, 탱크압력 값 및 추천 항해정보를 이용하여 최적 항해정보를 획득할 수 있고, 추천 항해정보는 기 설정된 날씨정보를 포함할 수 있다. 또한, 프로세서는 제n+1차 중간 항해정보에 포함된 가스 소모량과 제n차 중간 항해정보에 포함된 가스 소 모량의 차이를 계산하고, 차이가 기 설정된 범위에 포함되는지 판단하며, 판단 결과에 기초하여 제n+1차 중간 항해정보를 최적 항해정보로 확정할 수 있다. 여기에서, 제n+2차 중간 항해정보는 제n+1차 중간 항해정보에 포 함된 적어도 하나의 파라미터 갱신 값에 기초하여 생성될 수 있다. 단, n은 1 이상의 자연수이다. 이하, 도 28a를 참조하여, 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 경우, 프로세서 가 최적 운항정보를 획득하는 일 예를 설명한다. 도 28a는 일 실시예에 따른 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 경우의 최적 항해정보를 획득하는 일 예를 설명하기 위한 흐름도이다. 도 28a를 참조하면, 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 경우, 프로세서 는 추천 항해정보, 선박의 BOG 발생량 예측 값 및 선박의 탱크압력 예측 값을 이용하여 최적 항해정보를 획득할 수 있다. 먼저, 단계 2811에서, 프로세서는 추천 항해정보를 획득한다. 여기에서, 추천 항해정보는 상술한 추천 항해정보를 그대로 포함할 수 있다. 단계 2812에서, 프로세서는 상술한 방법들로 선박의 BOG 발생량 및 선박의 탱크압력을 예측할 수 있다. 여기에서, BOG 발생량은 풍속, 파도 의 높이, 너울의 높이 등 기상 상황에 따라서 달라질 수 있다. 따라서, BOG 발생량 예측 값 및 탱크압력 예측 값 역시 기상 상황에 따라 달라질 수 있다. 단계 2813에서, 프로세서는 추천 항해정보, 선박의 BOG 발생량 예측 값 및 선박의 탱크압력 예측 값을 이 용하여 중간 항해정보를 획득한다. 여기에서, 중간 항해정보는 항해 구간별 선박의 최적 속도, 선박의 가스 소 모량 및 선박에 설치된 장비의 사용량을 포함할 수 있다. 여기에서, 장비는, 선박에 설치된 과냉각장치 (Subcooler), 엔진 축발전기(Shaft generator), 추진엔진(Main engine), 발전엔진(Generator engine), 가스연 소장치(Gas combustion unit) 및 재액화장치(Reliquefaction) 등을 포함할 수 있다. 또한, 가스 소모량은, 추 진엔진의 가스 소모량, 발전엔진의 가스 소모량, 가스연소장치의 가스 소모량 및 재액화장치의 가스 소모량을 이용하여 계산할 수 있다. 단계 2814에서, 프로세서는 제n+1차 중간 항해정보에 포함된 가스 소모량과 제n차 중간 항해정보에 포함된 가스 소모량의 차이를 계산한다. 또한, 프로세서는 제n+1차 가스 소모량과 제n차 가스 소모량의 차이가 기 설정된 범위에 포함되는지 판단할 수 있다. 여기에서, 기 설정된 범위는 0에서 0.01 미만일 수 있다. 제n+1차 가스 소모량과 제n차 가스 소모량의 차이가 기 설정된 범위에 포함되지 않는 경우, 프로세서는 단 계 2812부터 다시 수행한다. 단계 2815에서, 프로세서는 제n+1차 중간 항해정보에 포함된 선박의 최적 속도를 이용하지 않으므로, 추천 항해정보에 포함된 날씨정보가 변경되지 않는다. 따라서, 프로세서는 제n+2차 중간 항해정보를 획득할 때 추천 항해정보에 포함된 기 설정된 날씨정보를 이용한다. 프로세서가 단계 2812를 다시 수행하는 경우, 제n+2차 중간 항해정보는 제n+1차 중간 항해정보에 포함된 적어도 하나의 파라미터의 갱신 값에 기초하여 생성될 수 있다. 예를 들어, 적어도 하나의 파라미터는, 가스 소 모량일 수 있다. 예를 들어, 프로세서가 단계 2812를 다시 수행할 때, 제n차 가스 소모량 대신 제n+1차 가스 소모량을 사용 함으로써 선박의 BOG 발생량 예측 값이 변경될 수 있다. 또한, 선박의 BOG 발생량 예측 값이 변경됨으로써 중간 항해정보가 변경될 수 있다. 단계 2816에서, 제n+1차 가스 소모량과 제n차 가스 소모량의 차이가 기 설정된 범위에 포함되는 경우, 프로세서 는 제n+1차 중간 항해정보를 최적 항해정보로 확정할 수 있다. 여기에서, 최적 항해정보는 선박의 BOG 발 생량 예측 값, 선박의 탱크압력 예측 값과 제n+1차 중간 항해정보에 포함된 선박의 가스 소모량, 선박의 최적 속도 및 선박에 설치된 장비의 사용량을 포함할 수 있다. 예를 들어, 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하지 않는 경우, 프로세서는 BOG 발생량, 탱크압력 값 및 추천 항해정보를 이용하여 최적 항해정보를 획득할 수 있고, 추천 항해정보는 선박의 운항에 따라 업데이트된 날씨정보를 포함할 수 있다. 또한, 프로세서는 제n+1차 중간 항해정보에 포함된 가스 소모량과 제n차 중간 항해정보에 포함된 가스 소 모량의 차이를 계산하고, 차이가 기 설정된 범위에 포함되는지 판단하며, 판단 결과에 기초하여 제n+1차 중간 항해정보를 최적 항해정보로 확정할 수 있다. 여기에서, 제n+2차 중간 항해정보는 제n+1차 중간 항해정보에 포 함된 적어도 하나의 파라미터 갱신 값에 기초하여 생성될 수 있다. 단, n은 1 이상의 자연수이다. 이하, 도 28b를 참조하여, 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하지 않는 경우, 프 로세서가 최적 운항정보를 획득하는 일 예를 설명한다. 도 28b는 일 실시예에 따른 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하지 않는 경우의 최적 항해정보를 획득하는 일 예를 설명하기 위한 흐름도이다. 도 28b를 참조하면, 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하지 않는 경우, 프 로세서는 추천 항해정보, 선박의 BOG 발생량 예측 값 및 선박의 탱크압력 예측 값을 이용하여 최적 항해정 보를 획득할 수 있다. 먼저, 단계 2821에서, 프로세서는 추천 항해정보를 획득한다. 여기에서, 추천 항해정보는 상술한 추천 항해정보를 그대로 포함할 수 있으며, 선박의 운항에 따라 업데이트된 날씨정보 등을 더 포함할 수 있다. 단계 2822에서, 프로세서는 상술한 방법들로 선박의 BOG 발생량 및 선 박의 탱크압력을 예측할 수 있다. 여기에서, BOG 발생량은 풍속, 파도의 높이, 너울의 높이 등 기상 상황에 따 라서 달라질 수 있다. 따라서, BOG 발생량 예측 값 및 탱크압력 예측 값 역시 기상 상황에 따라 달라질 수 있다. 단계 2823에서, 프로세서는 추천 항해정보, 선박의 BOG 발생량 예측 값 및 선박의 탱크압력 예측 값을 이 용하여 중간 항해정보를 획득한다. 여기에서, 중간 항해정보는 항해 구간별 선박의 최적 속도, 선박의 가스 소 모량 및 선박에 설치된 장비의 사용량을 포함할 수 있다. 여기에서, 장비는, 선박에 설치된 과냉각장치, 엔진 축발전기, 발전엔진, 추진엔진, 가스연소장치 및 재액화장치 등을 포함할 수 있다. 단계 2824에서, 프로세서는 제n+1차 중간 항해정보에 포함된 가스 소모량과 제n차 중간 항해정보에 포함된 가스 소모량의 차이를 계산한다. 또한, 프로세서는 제n+1차 가스 소모량과 제n차 가스 소모량의 차이가 기 설정된 범위에 포함되는지 판단할 수 있다. 여기에서, 기 설정된 범위는 0에서 0.01 미만일 수 있다. 제n+1차 가스 소모량과 제n차 가스 소모량의 차이가 기 설정된 범위에 포함되지 않는 경우, 프로세서는 단 계 3021부터 다시 수행한다. 프로세서가 단계 2821를 다시 수행하는 경우, 제n+2차 중간 항해정보는 제n+1차 중간 항해정보에 포함된 적어도 하나의 파라미터의 갱신 값에 기초하여 생성될 수 있다. 일 예시로, 적어도 하나의 파라미터는, 가스 소 모량일 수 있다. 다른 예시로, 적어도 하나의 파라미터는 항해 구간별 항해 구간별 최적 속도일 수 있다. 단계 2825에서, 프로세서는 제n+1차 중간 항해정보에 포함된 항해 구간별 선박의 최적 속도를 사용한다. 따라서, 제n+1차 중간 항해정보에 포함된 선박의 최적 속도와 추천 항해정보에 포함된 항해 구간별 선박의 속도 가 다를 수 있다. 선박의 속도가 달라지는 경우, 시간에 따른 선박의 위도 및 경도가 달라질 수 있다. 따라서, 날씨정보 역시 추천 항해정보에 포함된 날씨정보와 다를 수 있다. 또한, 날씨정보가 달라지면 선박의 BOG 발생 량 및 선박의 탱크압력이 변경될 수 있다. 예를 들어, 단계 2825에서, 프로세서는 제n+1차 중간 항해정보에 포함된 선박의 최적 속도를 이용하여 날 씨정보를 업데이트한다. 또한, 프로세서는 단계 2822를 다시 수행할 때 업데이트된 날씨정보를 사용한다. 예를 들어, 프로세서가 단계 2822를 다시 수행할 때, 제n차 가스 소모량 대신 제n+1차 가스 소모량을 사용 함으로써 선박의 BOG 발생량 예측 값이 변경될 수 있다. 따라서, 선박의 BOG 발생량 예측 값이 변경됨으로써 중 간 항해정보가 변경될 수 있다. 또한, 프로세서가 단계 2822를 다시 수행할 때, 추천 항해정보에 포함된 날씨정보 대신 업데이트된 날씨정보를 사용함으로써 선박의 탱크압력 값이 변경될 수 있고, 선박의 탱크압력 값 이 변경됨으로써 중간 항해정보가 변경될 수 있다. 단계 2826에서, 제n+1차 가스 소모량과 제n차 가스 소모량의 차이가 기 설정된 범위에 포함되는 경우, 프로세서 는 제n+1차 중간 항해정보를 최적 항해정보로 확정할 수 있다. 여기에서, 최적 항해정보는 선박의 BOG 발 생량 예측 값, 선박의 탱크압력 예측 값과 제n+1차 중간 항해정보에 포함된 선박의 가스 소모량, 선박의 최적속도 및 선박에 설치된 장비의 사용량을 포함할 수 있다. 다시 도 26을 참조하면, 단계 2620에서 프로세서는 선박의 제약조건(Constraint)을 고려하여 최적 항해정 보를 업데이트 할 수 있다. 여기에서, 제약조건은, 질량, 에너지, 전력량, 장비의 최대/최소 액화가스 소모량, 장비의 효율, 추진엔진(Main Engine)의 효율, 발전엔진(Generator Engine)의 효율, 축발전기의 효율, 탱크의 압 력, 상기 선박의 최고/최저 속도 및 상기 선박의 평균 속도 사이의 관계 중 적어도 하나에 기초하여 설정될 수 있다. 다시 말해, 제약조건은, 질량조건, 에너지조건, 전력량조건, 장비의 최대/최소 액화가스 소모량조건, 장비의 효 율조건, 추진엔진(Main Engine)의 효율조건, 발전엔진(Generator Engine)의 효율조건, 축발전기의 효율조건, 탱 크의 압력조건, 선박의 최고/최저 속도조건 및 선박의 평균 속도조건 등을 포함할 수 있으며, 이하 각 제약조건 에 대하여 구체적으로 설명한다. 예를 들어, 질량조건은 선박에 설치된 장비에서 소모되는 BOG의 질량에 기초하여 설정될 수 있다. 여기에서, 소 모되는 BOG의 질량은, 추진엔진(Main engine)과 발전엔진(Generator engine)에서 사용되는 BOG의 질량, 가스연 소장치(Gas combustion unit)에서 배출되는 BOG의 질량 및 재액화장치(Reliquefaction)에서 재액화되는 BOG의 질량 사이의 관계를 고려하여 산출될 수 있다. 예를 들어, 에너지조건은 선박의 항해 구간별 탱크 압력 변화량의 차이 값에 기초하여 설정될 수 있다. 여기에 서, 선박의 항해 구간별 탱크 압력 변화량의 차이 값은 항해 구간별 BOG 발생량, 탱크로 반환되는 BOG의 양, 탱 크로 반환되는 액화가스의 양 및 선박에 설치된 장비의 BOG 소모량 사이의 관계를 고려하여 산출될 수 있다. 예를 들어, 전력량조건은 선박에 설치된 장비의 전력량에 기초하여 설정될 수 있다. 여기에서 선박에 설치된 장 비의 전력량은 압축기(Compressor), 가스연소장치, 재액화장치, 과냉각기(Subcooler) 및 가스연료펌프(Fuel gas pump) 각각의 사용량 사이의 관계를 고려하여 산출될 수 있다. 예를 들어, 장비의 최대/최소 액화가스 소모량조건은 턴다운비율(Turndown ratio)에 기초하여 설정될 수 있다. 각 장비에서 요구되는 액화가스 소모량이 장비의 최소 액화가스 소모량조건보다 큰 경우에는, 장비는 최소 액화 가스 소모량으로 동작한다. 예를 들어, 장비의 효율조건은 각 장비에서 사용되는 액화가스 사용량에 따른 장비의 전력 변화량에 기초하여 설정될 수 있다. 여기에서, 장비의 효율은, 장비에서 사용되는 액화가스 사용량 대비 장비의 성능을 의미한다. 일 예시로, 압축기의 성능은 압축 목표 압력을 의미할 수 있다. 다른 예시로, 재액화장치의 성능은 재액화 목표 온도를 의미할 수 있다. 예를 들어, 추진엔진의 효율조건은 선박의 속도와 필요한 액화가스 연료의 양에 기초하여 설정될 수 있다. 여기 에서, 선박의 속도는 최적 항해정보에 포함된 항해 구간별 최적 속도일 수 있다. 또한, 필요한 액화가스 연료는 LNG 가스 또는 BOG일 수 있다. 예를 들어, 발전엔진의 효율조건은 선박에 설치된 장비의 전력량과 선박의 기본 소모 전력에 기초하여 설정될 수 있다. 여기에서, 선박에 설치된 장비의 전력량은 모든 장비의 전력량을 합산한 것일 수 있다. 또한, 선박의 기본 소모 전력은 선박에서 기본적으로 사용되는 전력을 의미할 수 있다. 예를 들어, 축발전기의 효율조건은 추진엔진의 회전속도에 따른 축발전기의 전기 발전량에 기초하여 설정될 수 있다. 여기에서, 축발전기의 전기 발전량과 발전엔진의 전기 발전량의 합은 선박의 총 전기 발전량이 될 수 있 다. 예를 들어, 탱크의 압력조건은 탱크압력의 최대값과 최소값에 기초하여 설정될 수 있다. 여기에서, 탱크의 압력 은 만선항해(Laden voyage)와 공선항해(Ballast voyage)에서의 탱크의 압력을 각각 다른 방법으로 획득할 수 있 다. 예를 들어, 선박의 최고/최저 속도조건은 엔진의 성능에 기초하여 설정될 수 있다. 여기에서, 최저 속도 이하로 항해하는 경우는 속도가 0으로써 선박은 정지한다. 예를 들어, 선박의 평균 속도조건은 선박의 항해 구간별 속도에 기초하여 설정될 수 있다. 일 예시로, 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 경우에는 각 구간별 속도들의 평균이 전체 운항시 간과 전체 운항거리로부터 산출된 총 평균속도와 동일할 수 있다. 다른 예시로, 선박의 운항에 최적 항해정보에 포함된 항해 구간별 속도를 이용하는 경우에도 각 구간별 속도들의 평균이 전체 운항시간과 전체 운항거리로부터 산출된 총 평균속도와 동일할 수 있다. 따라서, 프로세서는 상술한 각 제약조건을 고려하여, 각 제약조건을 만족하는 최적 항해정보를 업데이트 할 수 있다. 다시 도 26을 참조하면, 단계 2630에서 프로세서는 업데이트된 최적 항해정보를 이용하여 선박의 동작을 제어할 수 있다. 예를 들어, 프로세서는 최적 항해정보를 이용하여 설정된 운전방식으로 선박을 제어할 수 있다. 여기에서, 운전방식은 선박의 가스 소모량을 최소화하는 운전방식을 포함할 수 있다. 예를 들어, 프로세서가 최적 항해정보를 이용하여 선박의 동작을 제어하는 경우, 선박의 가스 소모량은 최 소화될 수 있다. 다시 말해, 프로세서는 선박의 가스 소모량을 최소화하는 운전방식으로 선박을 제어할 수 있다. 따라서, 프로세서는 제약조건을 고려하여 업데이트되는 최적 항해정보를 이용하여 선박의 가스 소모량을 최소화하는 운전방식으로 선박을 제어할 수 있다. 도 29는 일 실시예에 따른 선박의 운항을 제어하는 시스템의 일 예를 설명하기 위한 도면이다. 선박은 사용자 단말 및 서버를 포함할 수 있다. 예를 들어, 사용자 단말과 서버(324 0)는 유선 또는 무선 통신 방식으로 연결되어 상호 간에 데이터(예를 들어, 운항 정보)를 송수신할 수 있다. 설명의 편의를 위하여, 도 29에는 시스템이 사용자 단말 및 서버를 포함하는 것으로 도시하 였으나, 이에 한정되지 않는다. 예를 들어, 시스템에는 다른 외부 디바이스(미도시)가 포함될 수 있으며, 이하에서 설명될 사용자 단말 및 서버의 동작이 단일 디바이스(예를 들어, 사용자 단말 또는 서버) 또는 보다 많은 디바이스들에 의하여 구현될 수도 있다. 사용자 단말은 디스플레이 장치 및/또는 사용자 입력을 수신하는 장치(예를 들어, 키보드, 마우스 등)를 구비하고, 메모리와 프로세서를 포함하는 컴퓨팅 장치일 수 있다. 예를 들어, 사용자 단말은 노트북 (notebook) PC, 데스크탑(desktop) PC, 랩탑(laptop), 테블릿 컴퓨터(tablet computer), 스마트 폰 등이 해당 될 수 있으나, 이에 한정되지 않는다. 서버는, 사용자 단말을 포함하는 외부 디바이스(미도시)와 서로 간에 통신하거나, 다른 디바이스와 통신할 수 있는 통신 모듈을 포함할 수 있다. 통신 모듈은 네트워크를 통해 사용자 단말을 포함하는 외부 디바이스(미도시)와 통신할 수 있다. 예를 들어, 네트워크는 부가가치 통신망(Value Added Network; VAN), 이동 통신망(mobile radio communication network), 위성 통신망 및/또는 이들의 상호 조합을 포함할 수 있다. 네트 워크는 도 29에 도시된 각 구성들이 서로 원활하게 통신을 할 수 있도록 하는 포괄적인 의미의 데이터 통신망이 며, 유선 통신망 또는 무선 통신망을 포함할 수 있다. 일 예로서, 서버는 사용자 단말로 기 설정된 운항 정보 및 기 설정된 항로 정보를 전송할 수 있다. 또는, 서버는 메모리와 프로세서를 포함하고, 자체적인 연산 능력을 갖춘 컴퓨팅 장치일 수 있다. 예를 들어, 서버는 운항 정보 및 항로 정 보를 포함하여 다양한 데이터를 저장할 수 있다. 종래에는, 선박의 운전자는 통합 제어 장치인 IAS(Integrated Automation System)를 기반으로 탱크 의 압력 및 탱크에서 증발된 액화가스량 등을 제어하였다. 그러나, IAS는 운항 과정에서의 기상 변 화에 따른 탱크의 압력 변화 및 탱크에서 증발된 액화가스량 변화를 정확하게 예측하지 못하였다. 이로 인해, 선박의 운전자는 탱크의 압력을 제어하기 위해 증발 가스의 사용량을 판단하는 과정을 선박의 운항동안 반복하여 수행하였다. 이는, 선박의 비경제적인 운항을 야기하였다. 일 실시예에 따른 사용자 단말은 선박의 운항 제어를 위한 적어도 하나의 예측값 및 선박의 경제 운항 지표를 산출할 수 있다. 또한, 사용자 단말은 선박의 운항에 따라 실시간으로 측 정된 측정값을 획득하여, 예측값 및 경제 운항 지표와 측정값을 비교할 수 있다. 이에 따라, 사용자 단말은 측정값을 예측값 및 경제 운항 지표와 비교한 결과를 이용하여 선박 을 제어하기에, 운전자의 판단을 최소화할 수 있다. 이로써, 운전자에게 과도한 판단을 요구함으로써 야 기되는 비경제적인 운항이라는 문제점을 해결할 수 있다. 또한, 운전자는 IAS를 이용하지 않더라도, 경제적인 운항이 진행되고 있는지 운항 도중에 확인할 수 있다. 선박은 탱크를 포함할 수 있다. 또한, 도착 장소의 내부에는 탱크가 위치할 수 있다. 따라서, 선박이 운항하는 경우, 탱크는 해상에 위치하고, 탱크는 육상에 위치할 수 있다. 예 를 들어, 탱크 및 탱크는 이중 벽 구조를 가질 수 있으며, 내부 탱크와 외부 탱크로 구성될 수 있 다. 내부 탱크는 액화가스를 보관하는 공간이다. 외부 탱크는 내부 탱크를 둘러 쌓고 있으며, 액화가스의 보온 의 역할을 한다. 선박은 기 설정된 항로를 통해 도착 장소로 이동한다. 항로를 설정하는 구체적인 방법 은 도 33에서 후술한다. 이하, 도 2 및 도 30 내지 도 36을 참조하여, 사용자 단말이 동작하는 예를 설명한다. 다시 도 2를 참조하면, 도 2의 사용자 단말은 도 29의 사용자 단말과 동일한 장치일 수 있다. 프로세서는 서버로부터 선박의 기 설정된 운항 정보 및 기 설정된 항로 정보를 획득할 수 있다. 예를 들어, 프로세서는 서버로부터 도착 장소 도착 시의 탱크의 압력, 선박의 입출항 정보, 총 운항 거리, 총 운항 시간, 평균 속도 및 기상 정보를 획득할 수 있다. 또한, 프로세서는 기 설정된 적어도 하나의 시점에 대한 선박의 위도, 경도 및 속도를 획득할 수 있다. 그리고, 프로세서는 운항 정보 및 항로 정보를 이용하여 선박의 운항 제어를 위한 적어도 하 나의 예측값을 산출할 수 있다. 예를 들어, 프로세서는 탱크 내부의 압력 예측값, 탱크에서 증발된 액화가스량의 예측값, 탱크에서 펌프로 승압된 액화가스가 기화기로부터 선박 내부의 장치 에 공급되는 유량의 예측값 및 탱크에서 증발된 액화가스가 압축기로부터 선박 내부의 장치에 공급 되는 유량의 예측값 중 적어도 하나의 예측값을 산출할 수 있다. 그리고, 프로세서는 예측값을 선박의 운항에 따라 실시간으로 획득된 측정값과 비교하여 선박(322 0)을 제어할 수 있다. 한편, 도 2에는 도시되지 않았으나, 사용자 단말은 디스플레이 장치를 더 포함할 수 있다. 또는, 사용자 단말은 독립적인 디스플레이 장치와 유선 또는 무선 통신 방식으로 연결되어 상호 간에 데이터를 송수신할 수 있다. 예를 들어, 디스플레이 장치를 통하여 예측값을 측정값과 비교한 결과 등이 사용자에게 제공될 수 있 다. 도 30은 일 실시예에 따른 서버의 일 예를 도시한 구성도이다. 서버는 프로세서, 메모리 및 통신 모듈을 포함한다. 설명의 편의를 위하여, 도 30에는 본 발명과 관련된 구성요소들만이 도시되어 있다. 따라서, 도 30에 도시된 구성요소들 외에 다른 범용적인 구성 요소들이 서버에 더 포함될 수 있다. 또한, 도 30에 도시된 프로세서, 메모리 및 통신 모듈 은 독립된 장치로 구현될 수도 있음은 본 발명과 관련된 기술 분야에서의 통상의 지식을 가진 자에게 자 명하다. 또한, 도 30의 서버는 도 29의 서버와 동일한 장치일 수 있다. 프로세서는 운항 정보를 이용하여 항로 정보를 설정할 수 있다. 또한, 프로세서는 운항 정보 및 항 로 정보 등을 사용자 단말에 전송할 수 있다. 메모리에는 운항 정보 및 항로 정보 등이 저장될 수 있다. 또한, 메모리에는 운영체제(OS)와 적어도 하나의 프로그램(예를 들어, 프로세서가 동작하는데 필요한 프로그램 등)이 저장될 수 있다. 통신 모듈은 네트워크를 통해 서버와 사용자 단말이 서로 통신하기 위한 구성 또는 기능을 제공할 수 있다. 또한, 통신 모듈은 서버가 다른 외부 디바이스와 통신하기 위한 구성 또는 기능을 제공할 수 있다. 예를 들어, 프로세서의 제어에 따라 제공되는 제어 신호, 명령, 데이터 등이 통신 모듈 과 네트워크를 거쳐 사용자 단말 및/또는 외부 디바이스로 전송될 수 있다. 도 31은 일 실시예에 따른 선박의 운항을 제어하는 방법의 일 예를 설명하기 위한 흐름도이다. 선박의 운항을 제어하는 방법은 도 2 및 도 32에 도시된 사용자 단말(3210, 100) 또는 프로세서에서 시계열적으로 처리되는 단계들로 구성된다. 따라서, 이하에서 생략된 내용이라고 하더라도 도 2 및 도 29에 도 시된 사용자 단말(100, 3210) 또는 프로세서에 관하여 이상에서 기술된 내용은 도 29의 선박의 운항 을 제어하는 방법에도 적용될 수 있다. 3410 단계에서, 프로세서는 선박의 기 설정된 운항 정보를 서버로부터 획득한다. 예를 들어, 운항 정보에는 선박의 입출항 정보, 총 운항 거리, 총 운항 시간 평균 속도 및 기상 정보가 포함될 수 있다. 또한, 운항 정보는 선박이 도착 장소에 도착이 예정된 시점에서의 선박에 포함된 탱크의 압력을 포함할 수 있다. 도착이 예정된 시점에서의 탱크의 압력은 도착 장소에 마련된 탱크 압력 및 기 설정된 압력 중 어느 하나에 대응될 수 있다. 3420 단계에서, 프로세서는 운항 정보를 이용하여 설정된 선박의 항로 정보를 서버로부터 획 득한다. 예를 들어, 항로 정보에는 기 설정된 적어도 하나의 시점에 대한 선박의 위도, 경도 및 속도 중 적어도 하나가 포함될 수 있다. 이하, 도 32 내지 도 33을 참조하여, 운항 정보 및 항로 정보에 대해 구체적으로 설명한다. 도 32는 일 실시예에 따른 선박의 기 설정된 운항 정보가 디스플레이되는 화면의 일 예를 도시한 도면이다. 도 32에는 다양한 운항 정보가 출력된 화면의 일 예가 도시되어 있다. 구체적으로, 화면의 영역들 (3511, 3512, 3513, 3514)에는 다양한 운항 정보가 구분되어 표시될 수 있다. 그러나, 화면의 레이아웃 및 운항 정보의 출력 영역은 도 32에 도시된 예에 한정되지 않는다. 영역에는 선박이 출발할 장소의 명칭, 선박의 출항 시간 및 출발 장소 내부의 액화가스 화물 탱크의 압력이 표시될 수 있다. 예를 들어, 탱크의 출발 시의 압력은 출발 장소 내부의 액화가스 화물 탱 크의 압력과 대응될 수 있다. 또한, 영역에는 선박의 총 운항 거리, 총 운항 시간 및 평균 속도가 표시될 수 있다. 예를 들어, 총 운항거리는 선박이 출발 장소에서 출항한 시점부터 도착 장소에 도착한 시점까지 이동한 거리로 산출될 수 있다. 또한, 총 운항 시간은 선박이 출발 장소에서 출항한 시점부터 도착 장소에 도착한 시점까지 소요된 시간으로 산출될 수 있다. 또한, 평균 속도는 총 운항 거리를 총 운항 시간으로 나누어 산출될 수 있다. 또한, 영역에는 선박의 도착 장소의 명칭, 선박의 도착 장소에 도착할 시간 및 탱크의 압력이 표시될 수 있다. 예를 들어, 탱크의 도착 시의 압력은, 탱크의 압력 및 기 설정된 압력 중 어느 하나와 대응될 수 있다. 그러나, 운항 정보는 탱크의 압력을 포함하지 않을 수 있다. 이 경우에, 프로세서는 탱크의 압력을 소정의 값(예를 들어, 100mbarg) 가정하여 예측값을 산출할 수 있다. 또한, 영역에는 총 운항 거리 대비 실시간으로 획득한 선박의 출항 시부터 측정 시까지의 운항 거 리를 백분율로 나타낸 정보가 표시될 수 있다. 또한, 도 32에는 도시되지 않았으나, 운항 정보에는 기상 정보가 포함될 수 있다. 예를 들어, 기상 정보는 선박 이 출발 장소에서 출항한 시점부터 도착 장소에 도착한 시점까지의 항로의 기상 정보를 의미 할 수 있다. 또한, 기상 정보는 기압, 기온 및 파고 등을 포함할 수 있다. 도 33은 일 실시예에 따른 선박의 수동 설정된 항로 및 항로 최적화 기능을 통해 자동 설정된 항로 중 어느 하 나를 획득할 수 있는 화면의 일 예를 도시한 도면이다. 도 33은 프로세서가 항로 정보를 획득할 수 있는 화면의 일 예가 도시되어 있다. 구체적으로, 화면 의 영역들(3611, 3612, 3613, 3614)에는 다양한 선택 영역이 표시될 수 있다. 그러나, 화면의 레 이아웃 및 선택 정보의 출력 영역은 도 33에 도시된 예에 한정되지 않는다. 프로세서는 서버로부터 선박의 수동 설정된 항로 및 항로 최적화 기능을 통해 자동 설정된 항 로 중 어느 하나를 획득할 수 있다. 여기에서, 수동 설정된 항로 및 자동 설정된 항로는 기 설정된 운항 정보를 이용하여 설정된다. 예를 들어, 사용자가 영역을 선택하면, 프로세서는 이에 응답하여 비활성화되어 있던 영역 및 영역을 활성화할 수 있다. 사용자가 활성화된 영역을 선택하면, 프로세서는 서버에 ISS(Integrated Smartship Solution)를 통해 자동 설정된 항로에 대한 항로 정보의 전송을 요청할 수 있다. 이 에 따라, 프로세서는 서버로부터 항로 정보를 획득할 수 있다. 또한, 사용자가 활성화된 영역을 선택하면, 프로세서는 이에 응답하여 서버에 ECDIS(Electronic Chart Display Information System)를 통해 자동 설정된 항로에 대한 항로 정보의 전송을 요청할 수 있다. 이에 따라, 프로세서는 서버로부터 항로 정보를 획득할 수 있다. 또한, 사용자가 영역을 선택한 경우, 프로세서는 이에 응답하여 서버에 수동 설정된 항로에 대한 항로 정보의 전송을 요청할 수 있다. 이에 따라, 프로세서는 서버로부터 항로 정보를 획득할 수 있다. 항로 최적화 기능이란, 선박의 운항에서 경로 및 속도를 최적화하여, 액화가스 연료 소비를 최소화하고 운항 시간을 최적화하는 기술이다. 항로 최적화를 위해서는 선박의 위치, 속도, 기상 정보 등의 다양한 요소가 고려된다. ISS 및 ECDIS는 항로 최적화 기능을 포함하는 프로그램들 중 하나에 해당한다. ISS는 선박의 운항을 관리하고 장치의 운영을 관리하는 시스템으로서, 선박의 주요 데이터를 실시 간으로 수집하여 엔진을 비롯한 주요 기기 분석 서비스와 운항 최적화 기능을 제공하는 프로그램이다. 또한, ECDIS는 사용자에게 항해 정보 및 해역에 관한 지도를 제공하는 프로그램이다. 또한, 선박의 수동 설정된 항로에 대한 정보 및 항로 최적화 기능을 통해 자동 설정된 항로에 대한 정보 는 기 설정된 적어도 하나의 시점에 대한 선박의 위도, 경도 및 속도를 포함한다. 예를 들어, 서버는 선박의 출항 시점 이후, N개의 시점을 설정할 수 있다. 예를 들어, 시점의 개수 는 소정의 주기에 따라 미리 설정될 수도 있고, 사용자의 입력에 따라 조정될 수 있다. 또한, 0번째 시점은 선 박이 출발 장소에서 출발하는 시점과 대응될 수 있고, N번째 시점은 선박이 도착 장소에 도착하는 시점과 대응될 수 있다. 항로 정보는 N개의 시점 중 적어도 어느 하나의 시점에 대한 선박의 위도, 경도 및 속도 중 적어도 하나를 포함할 수 있다. 여기에서, N은 1 이상의 자연수를 의미한다. 예를 들어, 주기가 2일이고 총 운항 시간이 24일인 경우, 항로 정보에는 총 12개의 지점에 대한 선박의 정보를 포함할 수 있다. 항로 정보는 선박의 출항 이후 2일마다의 선박의 위도, 경도 및 속도에 관 한 정보를 포함할 수 있다. 또한, 12번째 시점에서의 탱크의 압력은 도착 장소의 탱크의 압력과 대 응될 수 있다. 다시 도 31을 참조하면, 3430 단계에서, 프로세서는 운항 정보 및 항로 정보를 이용하여 선박(322 0)의 운항 제어를 위한 적어도 하나의 예측값을 산출한다. 예를 들어, 예측값은 탱크의 내부 압력 예측값, 탱크에서 증발된 액화가스량의 예측값 및 탱크 에서 증발된 액화가스가 압축기로부터 선박 내부의 장치에 공급되는 유량의 예측값 중 적어도 어느 하나를 포함할 수 있다. 예를 들어, 장치는 탱크 내부에 포함된 압축기, 탱크 내부에 포함된 기화 기, 가스연소장치, 재액화 장치, 추진 엔진 및 발전 엔진 중 적어도 하나를 포함할 수 있다. 이하, 도 34를 참조하여, 운항 정보 및 항로 정보를 이용하여 선박의 운항 제어를 위한 탱크 내부의 압력 예측값을 산출하는 과정에 대해 설명한다. 도 34는 일 실시예에 따른 액화가스 화물 탱크의 압력 예측값을 산출하는 방법에 대한 일 예를 설명하기 위한 도면이다. 3710 단계에서, 프로세서는 서버로부터 도착 장소의 탱크 내부의 기 설정된 압력을 획득할 수 있다. 만약, 탱크의 압력이 설정되지 않았을 경우에는, 프로세서는 탱크의 압력을 소정의 값(예를 들어, 100mbarg)으로 가정하여 탱크의 압력 예측값을 산출할 수 있다. 3720 단계에서, 프로세서는 선박의 총 운항 시간을 소정의 시구간을 주기로 하여, N개의 시점으로 분할할 수 있다. 시점의 개수(즉, N)는 총 운항 시간을 주기로 나누어 나온 값으로 결정된다. 예를 들어, 시점 의 개수는 미리 결정되어 있을 수도 있고, 사용자가 임의로 결정할 수도 있다. 여기에서, N은 1 이상의 자연수 를 의미한다, 3730 단계에서, 프로세서는 N 번째 시점에서의 탱크의 압력을 도착 장소의 탱크의 압력 및 기 설정된 압력 중 어느 하나에 대응되는 것으로 산정할 수 있다. 3740 단계에서, 프로세서는 이전 시점의 탱크의 압력과 대비하여 각 시점에서의 탱크의 압력 변화량을 산출할 수 있다. 예를 들어, 프로세서가 이전 시점의 탱크의 압력 대비 각 시점 별 탱크 의 압력 변화량을 산출할 때, 탱크 압력 변화량은 아래 수학식 1과 같다.수학식 1"}
{"patent_id": "10-2023-0056136", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "프로세서는 α, β 및 γ값을 선박의 화물 특성, 탱크의 압력 변화 특성, 탱크 형상의 특성 등을 고려하여 설정할 수 있다. 탱크에서 증발한 액화가스의 증발에너지, 탱크에 유입된 가스 의 에너지 및 탱크에서 배출된 가스의 에너지는 상수로써, 선박의 가스 소모처의 질량 유량계에 따 라 결정될 수 있다. 예를 들어, 가스 소모처는 추진 엔진, 발전 엔진, 가스연소장치 및 재액화장치를 포함할 수 있다. 3750 단계에서, 프로세서는, 540 단계에서 계산한 각 시점의 탱크 압력 변화량을 기초로 하여, 각 시점에서의 탱크의 내부 압력 예측값을 산출할 수 있다. 다시 도 31을 참조하면, 3430 단계에서, 프로세서가 산출하는 예측값에는 탱크에서 증발된 액화가스 량의 예측값이 포함될 수 있다. 종래에는, 탱크에서 증발된 액화가스량의 예측값은 탱크 내부 액화가스의 온도와 같은 예측 불가능 한 데이터를 단순 수식에 대입하여 산출되었다. 이러한 방법은 증발된 액화가스량의 정확한 예측이 불가능하다 는 문제점이 있다. 예측의 부정확성이라는 종래 기술의 문제점을 해결하기 위해, 프로세서는 딥러닝 모델을 이용하여 증발된 액화가스량의 예측값을 산출할 수 있다. 이 경우, 딥러닝 모델은 운항 정보 및 항로 정보와 같은 학습 데이터를 이용하여, 증발된 액화가스량의 예측값을 산출하도록 학습될 수 있다. 또한, 탱크에서 증발된 액화가스량을 산출하는 딥러닝 모델은 사용자 단말에 저장되어 동작할 수 있다. 3440 단계에서, 프로세서는 예측값을 이용하여 선박의 경제 운항 지표를 산출할 수 있다. 여기에서, 경제 운항 지표는 탱크 내부에서의 액화가스 손실량, 선박의 엔진이 사용한 액화 가스 소모량, 가스연소장치에 의한 액화가스 소각량, 탱크 내부에서의 액화가스 재액화 유량 및 일일 기 화율(BOR, Boil-off Rate) 중 적어도 어느 하나를 포함할 수 있다. 예를 들어, 프로세서는 운항 정보, 항로 정보, 탱크에서 증발된 액화가스량의 예측값 및 탱크(323 0)의 압력 예측값을 이용하여 경제 운항 지표를 산출할 수 있다. 예를 들어, 프로세서는 운전 최적화 해석 모델을 이용하여 경제 운항 지표를 산출할 수 있다. 운전 최적화 해석 모델은 탱크, 엔진 및 가스연소장치 등의 장치에 공급되는 액화가스 유량 및 각 장치가 소모하는 액화가스 유량을 결정하여 액화가스 손실량을 줄이기 위한 모델이다. 예를 들어, 프로세서는 운전 최적화 해석 모델을 통해 운항 정보, 항로 정보, 탱크의 압력 예측값 및 탱크에서 증발된 액화가스량 예측값을 이용하여, 경제 운항 지표를 산출할 수 있다. 또한, 운전 최적화 해석 모델은 여러 제약 조건을 고려하여 경제 운항 지표를 산출할 수 있다. 예를 들어, 모델은 질량, 에너지, 전력량, 장치의 최대/최소 액화가스 소모량, 장비의 효율, 추진 엔진의 효율, 발전 엔진의 효율, 축발전기의 효율, 탱크의 압력, 선박의 최고/최저 속도 및 선박의 평균 속도 사이의 관계를 고려하여 경제 운항 지표를 산출할 수 있다. 또한, 경제 운항 지표를 산출하는 운전 최적화 해석 모델은 사용자 단말에 저장되어 동작할 수 있 다. 3450 단계에서, 프로세서는 선박의 운항에 따라 실시간으로 획득된 측정값을 예측값 및 경제 운항 지표와 비교하여, 비교한 결과를 디스플레이 할 수 있다.3460 단계에서, 프로세서는 비교한 결과를 이용하여 선박을 제어할 수 있다. 이하, 도 35a 내지 도 35c을 참조하여, 프로세서가 측정값을 예측값 및 경제 운항 지표와 비교한 결과의 일 예를 설명한다. 도 35a는 일 실시예에 따른 액화가스 화물 탱크 내부 압력 예측값을 측정값과 비교한 결과 및 평균 속도를 측정 값과 비교한 결과의 일 예를 도시한 도면이다. 도 35a에 도시된 바와 같이, 예측값을 측정값과 비교한 결과는 그래프의 형태로 산출될 수 있으나, 예측 값을 측정값과 비교한 결과를 나타내는 방식은 그래프에 한정되지는 않는다. 그래프에서 제 1 점선은 탱크 내부 압력 예측값을 나타내고, 제 1 실선은 탱크 내부 압력 측정값을 나타낸다. 프로세서는 탱크의 압력이 탱크의 내부 압력 예측값을 기준으로 설정된 압력 제어 영역 내의 압력에 포함되도록 선박을 제어할 수 있다. 예를 들어, 선박이 만선항해를 하는 경우, 압력 제어 영역은 60mbarg이상 190mbarg이하의 영역을 의미할 수 있다. 프로세서는 선박의 탱크의 압력이 압력 제어 영역을 초과하는 경우, 탱크의 압력이 감 소하도록 선박을 제어할 수 있다. 예를 들어, 프로세서는 탱크가 가스연소장치로 증발된 액화 가스를 공급하는 유량을 증가시킴으로써, 탱크의 압력을 감소시킬 수 있다. 또한, 프로세서는 액화 가스를 공급하는 장치와 액화가스를 공급받는 장치의 조합을 변경하여, 탱크의 압력을 감소시킬 수 있다. 또한, 측정값이 예측값 미만인 경우, 탱크의 압력을 증가시키기 위하여, 프로세서는 탱크가 가스연소장치, 추진 엔진, 발전 엔진 및 재액화 장치로 공급되는 액화가스량이 감소하도록 탱크를 제어할 수 있다. 그래프에서 제 2 점선은 선박의 속도 예측값을 나타내고, 제 2 실선은 선박의 속도 측정값을 나타낸다. 프로세서는 측정값이 예측값에 대응되도록 선박을 제어할 수 있다. 예를 들어, 측정값이 예측값을 초과하는 경우, 프로세서는 선박의 속도가 감소하도록 선박을 제어할 수 있다. 또한, 측정값 이 예측값 미만인 경우, 프로세서는 선박의 속도가 증가하도록 선박을 제어할 수 있다. 그래프에서 제 3 점선은 선박 내부 추진 엔진의 부하율 예측값을 나타내고, 제 3 실선(381 6)은 선박 내부 추진 엔진의 부하율 측정값을 나타낸다. 프로세서는 선박의 내부 추진 엔진의 부하율이 예측값에 대응되도록 선박을 제어할 수 있다. 예를 들어, 프로세서는 액화가스를 공급하는 장치와 액화가스를 공급받는 장치의 조합을 변경할 수 있다. 또한, 프로세서는 액화가스를 공급하는 장치의 공급 유량을 제어할 수 있다. 예를 들어, 선박의 내부 추진 엔진의 부하율이 예측값을 초과하는 경우, 프로세서는 탱크가 추진 엔진으로 공급하는 액화가스 유량을 증가시키도록 선박을 제어할 수 있다. 또한, 선박의 내부 추진 엔진의 부하율이 예측값 미만인 경우, 프로세서는 탱크가 추진 엔진으로 공급하는 액화가스 유 량을 감소시키도록 선박을 제어할 수 있다. 도 35b는 일 실시예에 따른 액화가스 화물 탱크에서 증발된 액화가스량의 예측값을 측정값과 비교한 결과의 일 예를 도시한 도면이다. 도 35b에 도시된 바와 같이, 예측값을 측정값과 비교한 결과는 그래프의 형태로 출력될 수 있으나, 예측 값을 측정값과 비교한 결과를 나타내는 방식은 그래프에 한정되지는 않는다. 그래프에서, 제 1 점선은 탱크에서 증발된 액화가스량의 예측값을 나타내고, 제 1 실선 은 탱크에서 증발된 액화가스량의 측정값을 나타낸다. 예를 들어, 프로세서는 증발된 액화가스량의 예측값을 딥러닝 모델을 통해 산출할 수 있다. 프로세서는 증발된 액화가스량의 예측값에 따라 선박을 제어할 수 있다. 예를 들어, 프로세서 는 예측값에 따라, 증발된 액화가스를 공급하는 장치의 종류를 제어할 수 있다. 또한, 프로세서는 증발된 액화가스를 공급하는 장치의 공급 유량을 제어할 수 있다.예를 들어, 프로세서는 예측값에 따라, 증발된 액화가스의 공급 장치를 탱크에 포함된 압축기로 제 한하도록 선박을 제어할 수 있다. 또한, 프로세서는 예측값에 따라, 압축기가 선박의 장치로 공급하는 증발된 액화가스량의 유량을 2500kg/h가 되도록 선박을 제어할 수 있다. 또한, 프로세서는 예측값에 따라, 압축기가 가스연소장치로 공급하는 증발된 액화가스량의 유량이 1000kg/h가 되고, 압축기가 추 진 엔진 및 발전 엔진으로 공급하는 증발된 액화가스량의 유량이 1500kg/h가 되도록, 선박을 제어할 수 있다. 그래프에서, 제 1 영역은 탱크 내부에 포함된 압축기가 가스연소장치로 공급하는 증발된 액 화가스의 유량 예측값을 나타낸다. 제 2 영역은 탱크 내부에 포함된 압축기가 추진 엔진 및 발전 엔진으로 공급하는 증발된 액화가스의 유량 예측값을 나타낸다. 또한, 그래프에 도시되지 않았으나, 예측값에는 압축기가 재액화장치로 공급하는 증발된 액화가스의 유량 예측값, 탱크 내부에 포함된 기화기가 추진 엔진 및 발전 엔진으로 공급하는 증발된 액화가스의 유량 예 측값 및 탱크 내부에 포함된 탱크가 과냉각장치로 공급하는 증발된 액화가스의 유량 예측값을 포함할 수 있다. 도 35c는 일 실시예에 따른 선박의 경제 운항 지표를 측정값과 비교한 결과의 일 예를 도시한 도면이다. 도 35c에 도시된 바와 같이, 경제 운항 지표를 측정값과 비교한 결과는 표의 형태로 산출될 수 있 으나, 경제 운항 지표를 측정값과 비교한 결과를 나타내는 방식은 표에 한정되지는 않는다. 제 1 항목은 탱크 내부에서의 액화가스 손실량을 의미한다. 예를 들어, 프로세서는 제 1 항목 의 측정값을 선박의 출항 시부터 측정 시까지 탱크가 추진 엔진으로 공급하는 액화가스의 유 량의 누적값, 탱크가 발전 엔진으로 공급하는 액화가스 유량의 누적값 및 탱크가 가스연소장치로 공급하는 액화가스 유량의 누적값의 합으로 산출할 수 있다. 또한, 제 2 항목은 선박의 엔진이 사용하는 액화가스 소모량을 의미한다. 예를 들어, 프로세서 는 제 2 항목의 측정값을 출항 시부터 측정 시까지 탱크가 추진 엔진으로 공급하는 액화가스 유량의 누적값 및 탱크가 발전 엔진으로 공급하는 액화가스 유량의 누적값의 합으로 산출할 수 있다. 또한, 제 3 항목은 선박의 가스연소장치에 의한 액화가스 소각량을 의미한다. 예를 들어, 프로세서 는 제 3 항목의 측정값을 출항 시부터 측정 시까지 탱크가 가스연소장치로 공급하는 액화가스 의 유량의 누적값으로 산출할 수 있다. 또한, 제 4 항목는 탱크 내부에서의 재액화 유량을 의미한다. 예를 들어, 프로세서는 제 4 항 목의 측정값을 출항 시부터 측정 시까지 재액화 장치를 통과하는 액화가스 유량의 누적값으로 산출할 수 있다. 또한, 제 5 항목는 일일 기화율 의미한다. 예를 들어, 프로세서는 제 5 항목의 측정값을 출항 시부터 측정 시까지 탱크에 저장된 총 액화가스의 부피 대비 액화가스 증발량의 하루 평균값으로 산출할 수 있다. 도 36은 일 실시예에 따른 프로세서에 의하여 디스플레이되는 화면의 일 예를 도시한 도면이다. 도 36에는, 도 29 내지 도 35c를 참조하여 상술한 방법이 실행되는 프로그램의 실행 화면의 일 예가 도시 되어 있다. 예를 들어, 영역에는 선박의 기 설정된 운항 정보가 표시될 수 있다. 구체적으로, 선박의 도 착 장소 도착 시의 탱크의 압력, 입출항 정보, 총 운항 거리, 총 운항 시간, 평균 속도 및 기상 정보 중 적어도 하나가 표시될 수 있다. 또한, 영역에는 프로세서가 항로 정보를 획득할 수 있는 화면이 표시될 수 있다. 프로세서는 서버로부터 선박의 수동 설정된 항로 및 항로 최적화 기능을 통해 자동 설정된 항로 중 어느 하나 를 획득할 수 있다. 또한, 영역에는 탱크의 압력 예측값을 측정값과 비교한 결과, 선박의 평균 속도를 측정값과 비교한 결과 및 탱크의 압력 예측값을 측정값과 비교한 결과가 표시될 수 있다. 또한, 영역에는 탱크에서 증발된 액화가스량의 예측값을 측정값과 비교한 결과, 탱크 내부 압축기가 발전 엔진 및 추진 엔진에 공급하는 액화가스의 유량 예측값 및 탱크 내부 압축기가 가스연소장치에 공급하는 액화가스의 유량 예측값이 표시될 수 있다. 또한, 영역에는 경제 운항 지표를 측정값과 비교한 결과가 표시될 수 있다. 구체적으로, 경제 운항 지표는 탱크 내부에서의 액화가스 손실량, 선박의 엔진이 사용한 액화가스 소모량, 가스연소 장치에 의한 액화가스 소각량, 탱크 내부에서의 액화가스 재액화 유량 및 일일 기화율 중 적어도 하나를 포함할 수 있다. 또한, 영역에는 선박 내부의 장치에 실시간으로 공급되는 유량과 기 설정된 유량을 비교한 결과를 표시될 수 있다. 추가로, 장치의 전원 공급 여부가 표시될 수 있다. 구체적으로, 장치는 탱크 내부에 포 함된 압축기, 탱크 내부에 포함된 기화기, 가스연소장치 및 재액화 장치 등이 포함할 수 있다. 상술한 바에 따르면, 본 발명은 선박의 출발 장소와 도착 장소에 관련된 운항 계획 정보에 기초하여, 선박의 운 항 경로에 관한 추천 항해 정보를 생성하고, 추천 항해 정보에 기초하여, 선박의 BOG 발생량 및 선박의 탱크 압 력 값을 예측하고, BOG 발생량 및 탱크 압력 값에 기초하여, 선박의 동작 제어에 관련된 최적 항해 정보를 획득 한다. 또한, 본 발명은 최적 항해 정보를 이용하여 기 설정된 운전 방식으로 상기 선박을 제어할 수 있다. 상술한 바에 따르면, 본 발명은 선박의 운항 경로에 관한 위치별 기상기후 정보, 조류 정보, 해상 정보, 해류 정보 중 하나 이상을 포함하는 환경 정보에 기초하여 BOG 발생량 및 탱크 압력 값을 예측하고, 예측된 BOG 발생 량 및 탱크 압력 값에 기초하여 최적 항해 정보를 획득하여 전체 항해 운전을 계산함으로써, 선박의 출발지에서 도착지까지의 화물 관리의 방향성을 제시할 수 있고, 예측한 탱크 압력 값에 기초하여 안전한 화물 처리를 가능 하게 할 수 있다. 또한, 본 발명은 항해 중 연료가 많이 필요한 위치에서는 연료를 많이 소모하여 탱크 압력을 낮추고, 연료가 적 게 필요한 위치에서는 연료를 적게 소모하여 탱크 압력을 높임으로써, 최종 목표 탱크 압력을 유지할 수 있는 항해 방법을 제시할 수 있다. 또한, 본 발명은 최적 항해 정보에 기초하여 액화가스 소모량을 최소화하는 운전 방식으로 선박을 제어함으로써, 운전자에게 선박의 운전 가이드를 제공하여 운항을 보조할 수 있고, GCU 소각량 및 엔진의 연료 가스량을 낮춤으로써 탄소세 저감 효과를 제공할 수 있다. 또한, 본 발명은 익숙하지 않은 선박의 운항 경로에서의 BOG 발생량 및 탱크 압력 값을 예측함으로써, 운항에 관한 운전자의 결정을 도울 수 있다. 한편, 상술한 방법은 컴퓨터에서 실행될 수 있는 프로그램으로 작성 가능하고, 컴퓨터로 읽을 수 있는 기록매체 를 이용하여 상기 프로그램을 동작시키는 범용 디지털 컴퓨터에서 구현될 수 있다. 또한, 상술한 방법에서 사용 된 데이터의 구조는 컴퓨터로 읽을 수 있는 기록매체에 여러 수단을 통하여 기록될 수 있다. 상기 컴퓨터로 읽 을 수 있는 기록매체는 마그네틱 저장매체(예를 들면, 롬, 램, USB, 플로피 디스크, 하드 디스크 등), 광학적 판독 매체(예를 들면, 시디롬, 디브이디 등)와 같은 저장매체를 포함한다. 한편, 상술한 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽 을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들 간에 직접, 온라인으로 배포(예: 다운로드 또 는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플 리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장 되거나, 임시적으로 생성될 수 있다. 본 실시예와 관련된 기술 분야에서 통상의 지식을 가진 자는 상기된 기재의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 방법들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 하며, 권리 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점을 포함하는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13a 도면13b 도면13c 도면14 도면15a 도면15b 도면16a 도면16b 도면17 도면18 도면19 도면20a 도면20b 도면21 도면22 도면23 도면24 도면25 도면26 도면27 도면28a 도면28b 도면29 도면30 도면31 도면32 도면33 도면34 도면35a 도면35b 도면35c 도면36"}
{"patent_id": "10-2023-0056136", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 선박의 운항을 최적화하는 시스템의 일 예를 설명하기 위한 도면이다. 도 2는 일 실시예에 따른 사용자 단말의 일 예를 도시한 구성도이다. 도 3는 일 실시예에 따른 서버의 일 예를 도시한 구성도이다. 도 4는 일 실시예에 따른 선박의 운항을 최적화하는 방법의 일 예를 설명하기 위한 흐름도이다. 도 5는 일 실시예에 따른 프로세서가 운항 계획 정보에 기초하여 추천 항해 정보를 생성하는 일 예를 설명하기 위한 흐름도이다. 도 6은 일 실시예에 따른 프로세서가 추천 항해 정보에 기초하여 선박의 BOG 발생량 및 선박의 탱크 압력 값을 예측하는 일 예를 설명하기 위한 흐름도이다. 도 7은 일 실시예에 따른 프로세서가 BOG 발생량 및 탱크 압력 값에 기초하여 최적 항해 정보를 획득하는 일 예 를 설명하기 위한 흐름도이다.도 8은 일 실시예에 따른 프로세서가 BOG 발생량 및 탱크 압력 값에 기초하여 최적 항해 정보를 획득하는 다른 예를 설명하기 위한 흐름도이다. 도 9는 일 실시예에 따른 선박의 운항을 최적화하는 방법의 다른 예를 설명하기 위한 흐름도이다. 도 10은 일 실시예에 따른 BOG 발생량을 예측하는 방법의 일 예를 설명하기 위한 도면이다. 도 11은 일 실시예에 따른 선박의 BOG 발생량을 예측하는 방법의 일 예를 설명하기 위한 흐름도이다. 도 12는 일 실시예에 따른 선박의 가스 소모량을 계산하는 일 예를 설명하기 위한 도면이다. 도 13a는 일 실시예에 따른 스태킹 모델의 일 예를 도시한 구성도이다. 도 13b는 일 실시예에 따른 선박의 BOG 발생량 예측 모델의 일 예를 도시한 구성도이다. 도 13c는 일 실시예에 따른 스태킹 모델을 포함하는 선박의 BOG 발생량 예측 모델을 간략히 도시한 도면이다. 도 14는 일 실시예에 따른 학습을 위한 정답 데이터를 산출하는 일 예를 설명하기 위한 도면이다. 도 15a는 일 실시예에 따른 프로세서가 메모리에 저장된 데이터 중 소실 데이터(Loss data)를 제거하 는 것을 설명하기 위한 도면이다. 도 15b는 일 실시예에 따른 기 저장된 운항 데이터의 일부 데이터를 입력 데이터 선정 모델의 학습 데이터로, 다른 일부 데이터를 선박의 BOG 발생량 예측 모델의 검증 데이터로 분리하는 일 예를 설명하기 위한 도면이다. 도 16a는 일 실시예에 따른 선박의 외부에서 선박의 현재 운항 데이터를 획득하는 일 예를 설명하기 위한 도면 이다. 도 16b는 일 실시예에 따른 선박의 내부에서 선박의 현재 운항 데이터를 획득하는 일 예를 설명하기 위한 도면 이다. 도 17은 일 실시예에 따른 최초 BOG 발생량 예측 값들에 가중치를 적용하여 최종 BOG 발생량 예측 값을 연산하 는 일 예를 설명하기 위한 도면이다. 도 18은 일 실시예에 따른 선박의 탱크 압력을 예측하는 방법의 일 예를 설명하기 위한 도면이다. 도 19는 일 실시예에 따른 선박의 탱크 압력을 예측하는 방법의 일 예를 설명하기 위한 흐름도이다. 도 20a는 일 실시예에 따른 기 저장된 실제 운항 데이터의 일부를 학습 데이터로 분리하고, 다른 일부를 검증 데이터로 분리하는 일 예를 설명하기 위한 도면이다. 도 20b는 일 실시예에 따른 기 저장된 실제 운항 데이터를 가공하는 과정의 일 예를 설명하기 위한 도면이다. 도 21은 일 실시예에 따른 선박의 탱크 압력을 예측하는 딥러닝 모델을 학습하는 과정의 일 예를 설명하기 위한 도면이다. 도 22는 일 실시예에 따른 탱크 내에서의 액화가스의 수위가 소정 높이 이상인지 여부에 따른 항해 모드를 판단 하는 일 예를 설명하기 위한 도면이다. 도 23은 일 실시예에 따른 탱크 내에서의 액화가스의 수위에 따른 복수의 항해 모드들 각각에 대응하는 딥러닝 모델의 일 예를 설명하기 위한 도면이다. 도 24는 일 실시예에 따른 복수의 중간 값들에 가중치를 적용하여 탱크의 압력 예측 값을 획득하는 일 예를 설 명하기 위한 도면이다. 도 25는 일 실시예에 따른 선박의 운항을 최적화하는 방법의 일 예를 설명하기 위한 도면이다. 도 26은 일 실시예에 따른 선박의 운항을 최적화하는 방법의 일 예를 설명하기 위한 흐름도이다. 도 27은 일 실시예에 따른 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는지 여부에 따라 서로 다른 방식으로 최적 항해정보를 획득하는 일 예를 설명하기 위한 도면이다. 도 28a는 일 실시예에 따른 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하는 경우의 최적 항해정보를 획득하는 일 예를 설명하기 위한 흐름도이다. 도 28b는 일 실시예에 따른 선박의 운항에 추천 항해정보에 포함된 항해 구간별 속도를 이용하지 않는 경우의최적 항해정보를 획득하는 일 예를 설명하기 위한 흐름도이다. 도 29는 일 실시예에 따른 선박의 운항을 제어하는 시스템의 일 예를 설명하기 위한 도면이다. 도 30은 일 실시예에 따른 서버의 일 예를 도시한 구성도이다. 도 31은 일 실시예에 따른 선박의 운항을 제어하는 방법의 일 예를 설명하기 위한 흐름도이다. 도 32는 일 실시예에 따른 선박의 기 설정된 운항 정보가 디스플레이되는 화면의 일 예를 도시한 도면이다. 도 33은 일 실시예에 따른 선박의 수동 설정된 항로 및 항로 최적화 기능을 통해 자동 설정된 항로 중 어느 하 나를 획득할 수 있는 화면의 일 예를 도시한 도면이다. 도 34는 일 실시예에 따른 액화가스 화물 탱크의 압력 예측값을 산출하는 방법에 대한 일 예를 설명하기 위한 도면이다. 도 35a는 일 실시예에 따른 액화가스 화물 탱크 내부 압력 예측값을 측정값과 비교한 결과 및 평균 속도를 측정 값과 비교한 결과의 일 예를 도시한 도면이다. 도 35b는 일 실시예에 따른 액화가스 화물 탱크에서 증발된 액화가스량의 예측값을 측정값과 비교한 결과의 일 예를 도시한 도면이다. 도 35c는 일 실시예에 따른 선박의 경제 운항 지표를 측정값과 비교한 결과의 일 예를 도시한 도면이다. 도 36은 일 실시예에 따른 프로세서에 의하여 디스플레이되는 화면의 일 예를 도시한 도면이다."}
