{"patent_id": "10-2017-0151450", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0054641", "출원번호": "10-2017-0151450", "발명의 명칭": "인공지능 기반의 드론의 동역학 모델링 생성 방법", "출원인": "주식회사 셈웨어", "발명자": "김광진"}}
{"patent_id": "10-2017-0151450", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "드론의 움직임을 표현하는 드론의 동역학 모델링 생성 방법에 있어서,(1) 수학적으로 가상의 동역학 모델링을 생성하는 단계;(2) 상기 단계 (1)에서 생성한 상기 가상의 동역학 모델링으로부터 입력 데이터 및 출력 데이터를 얻는 단계;및(3) 상기 단계 (2)에서 얻은 상기 입력 데이터 및 상기 출력 데이터를 이용하여 인공지능 기반으로 상기 가상의동역학 모델링을 추정함으로써 동역학 모델링을 생성하는 단계를 포함하는 것을 특징으로 하는, 인공지능 기반의 드론의 동역학 모델링 생성 방법."}
{"patent_id": "10-2017-0151450", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,(4) 상기 단계 (1)에서 생성한 상기 가상의 동역학 모델링과 상기 단계 (3)에서 생성한 동역학 모델링 사이의정확도를 비교하여 상기 동역학 모델링에 대한 강화 학습이 이루어지는 단계를 더 포함하는 것을 특징으로하는, 인공지능 기반의 드론의 동역학 모델링 생성 방법."}
{"patent_id": "10-2017-0151450", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,(5) 드론으로부터 얻은 입력 데이터 및 출력 데이터를 기반으로 상기 단계 (4)에서 학습한 동역학 모델링을 검증하는 단계를 더 포함하는 것을 특징으로 하는, 인공지능 기반의 드론의 동역학 모델링 생성 방법."}
{"patent_id": "10-2017-0151450", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 단계 (3)은,기계 학습을 통해 상기 입력 데이터 및 상기 출력 데이터를 이용하여 상기 가상의 동역학 모델링을 추정하는 것을 특징으로 하는, 인공지능 기반의 드론의 동역학 모델링 생성 방법."}
{"patent_id": "10-2017-0151450", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 단계 (3)은,신경망 모델을 사용하는 것을 특징으로 하는, 인공지능 기반의 드론의 동역학 모델링 생성 방법."}
{"patent_id": "10-2017-0151450", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 단계 (4)는,보상 함수의 기대값을 최대화하도록 상기 동역학 모델링에 대한 강화 학습이 이루어지는 것을 특징으로 하는,인공지능 기반의 드론의 동역학 모델링 생성 방법.공개특허 10-2019-0054641-3-청구항 7 제6항에 있어서, 상기 보상 함수는,상기 단계 (1)에서 생성한 상기 가상의 동역학 모델링과 상기 단계 (3)에서 생성한 동역학 모델링 사이의 정확도를 비교하여 보상을 결정하는 것을 특징으로 하는, 인공지능 기반의 드론의 동역학 모델링 생성 방법."}
{"patent_id": "10-2017-0151450", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 단계 (1)은,쿼드 로터 구조를 가진 드론에 대한 가상의 동역학 모델링을 생성하는 것을 특징으로 하는, 인공지능 기반의 드론의 동역학 모델링 생성 방법."}
{"patent_id": "10-2017-0151450", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반의 드론의 동역학 모델링 생성 방법에 관한 것으로서, 보다 구체적으로는 드론의 움직임 을 표현하는 드론의 동역학 모델링 생성 방법에 있어서, 수학적으로 가상의 동역학 모델링을 생성하는 단계; 상기 단계 에서 생성한 상기 가상의 동역학 모델링으로부터 입력 데이터 및 출력 데이터를 얻는 단계; (뒷면에 계속)"}
{"patent_id": "10-2017-0151450", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 드론의 동역학 모델링 생성 방법에 관한 것으로서, 보다 구체적으로는 인공지능 기반의 드론의 동역 학 모델링 생성 방법에 관한 것이다."}
{"patent_id": "10-2017-0151450", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "드론(Drone)은 무선 전파로 조종할 수 있는 무인 항공기로서, 일반적으로 4개의 로터로 구동되는 헬리콥터 형태 의 비행체를 말한다. 드론에는 카메라, 센서, 통신 시스템 등을 탑재할 수 있어, 과거에는 주로 군사용으로 운 용되었다. 그러나 드론이 민간용으로 제작되어 보급되기 시작하면서, 군사용 이외에도 고공 촬영과 배달 등의 목적으로도 널리 사용되고 있다. 특히, 드론은 사람이 탑승하지 않은 채 원거리에서 조종할 수 있기 때문에, 지상에서 접근이 곤란하거나 위험한 지역에서도 안전하게 운영할 수 있고, 다른 항공기에 비해 상대적으로 제작 및 제어가 쉬우므로 무인 항공기 분 야의 연구 대상으로 많은 관심을 받고 있는 상황이다. 도 1은 쿼드 로터 구조의 드론을 도시한 도면이다. 도 1에 도시된 바와 같이, 드론의 구조 중 쿼드 로터(Quad Rotor)는 4개의 모터 출력으로 드론을 구동하는 방식이다. 이러한 쿼드 로터는 다른 비행체의 구조에 비해 많 은 장점을 가진다. 쿼드 로터의 가장 큰 장점으로는 비행 전에 트림(Trim)을 맞추어야 할 필요가 없고, 기계적 인 진동도 크지 않으며, 피로에 의한 부품 파손의 확률도 낮다. 따라서 일반적으로 대부분의 드론은 쿼드 로터 구조를 기반으로 제작되고 있다. 도 2는 수학적으로 표현한 드론의 동역학 모델링을 도시한 도면이다. 드론의 구조 중 쿼드 로터의 제어에 대해 서는 많은 연구자들에 의해 연구가 이루어져 왔다. 도 2를 참조하면, 드론의 동역학 모델링은 드론의 물리적 특성을 고려하여 수학적으로 드론의 움직임을 설명할 수 있는 모델로서, 여러 입력 변수에 의해 드론의 움직임 을 설명하기 위한 모델이다. 이러한 모델링에서는 드론을 외력이 가해도 크기나 형태가 변하지 않는 이상적인 물체인 강체(Rigid body)로 간주한다. 또한, 드론의 움직임은 병진 운동(Translational motion)과 회전 운동 (Rotational motion)에 의해 결정되도록 한다. 부가적으로, 항력(Drag force)과 감쇠공력모멘트(Damping aero moment)를 통해 유체(공기) 내에서 비행체의 저항 성분을 고려할 수 있다. 그러나 기존의 수학적인 드론의 동역학 모델링에서는 어떤 데이터를 드론의 입출력 데이터로 취해야 정확한 동 역학 모델링이 얻어질 수 있는지에 대한 실질적인 연구 결과가 없는 실정이다. 따라서 어떠한 데이터를 입출력데이터로 하면, 보다 정확한 드론의 동역학 모델링을 생성할 수 있는지 분석하기 어렵다는 문제점이 있었다. 더욱이, 드론의 동역학 모델링을 위해 드론의 입출력 데이터를 취득하려는 경우 드론에 대한 데이터를 실시간으 로 얻기가 매우 어렵다는 문제점이 있었다. 데이터를 얻기 위해서는 드론에 데이터 수집을 위한 별도의 센서를 탑재해야 하므로, 드론에 변형을 가할 수밖에 없게 된다. 그러나 이러한 경우 본래의 드론에 대한 모델링이 아 닌, 데이터 수집을 위한 센서가 탑재된 상태의 드론에 대한 데이터를 얻게 된다. 따라서 본래 상태의 드론에 대한 정확한 모델링을 생성할 수 없다는 문제점이 있다."}
{"patent_id": "10-2017-0151450", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "해당 기술분야와 관련된 선행기술로서, 대한민국 공개특허 제10-2017-0111921호 ‘무인 비행체 제어 방법 및 시 스템’ 등이 제안된 바 있다."}
{"patent_id": "10-2017-0151450", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존에 제안된 방법들의 상기와 같은 문제점들을 해결하기 위해 제안된 것으로서, 드론의 동역학 모 델링 생성 시 초기에 드론의 데이터 취득이 어려운 상황에서 학습 및 추론을 위한 가상의 동역학 모델을 생성하 고, 가상의 동역학 모델로부터 가상의 입출력 데이터를 취득하여 인공지능 기반의 모델 학습을 통해 보다 정확 한 드론의 동역학 모델링을 생성하고 검증할 수 있는, 인공지능 기반의 드론의 동역학 모델링 생성 방법을 제공 하는 것을 목적으로 한다. 또한, 본 발명은, 가상의 동역학 모델로부터 입력 데이터 및 출력 데이터를 얻음으로써, 드론으로부터 데이터를 실시간으로 취득할 필요가 없고, 드론에 데이터 취득을 위한 별도의 센서를 탑재하거나 변형을 가하지 않고도 본래 상태에서의 드론의 동역학 모델링을 생성하고 검증할 수 있는, 인공지능 기반의 드론의 동역학 모델링 생 성 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2017-0151450", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 특징에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법은, 드론의 움직임을 표현하는 드론의 동역학 모델링 생성 방법에 있어서, 수학적으로 가상의 동역학 모델링을 생성하는 단계; 상기 단계 에서 생성한 상기 가상의 동역학 모델링으로부터 입력 데이터 및 출력 데이터를 얻는 단계; 및 상기 단계 에서 얻은 상기 입력 데이터 및 상기 출력 데이터를 이용하여 인공지능 기반으로 상기 가상의 동역학 모델링을 추정함으로써 동역학 모델링을 생성하는 단계를 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 단계 에서 생성한 상기 가상의 동역학 모델링과 상기 단계 에서 생성한 동역학 모델링 사이의 정확도를 비교하여 상기 동역학 모델링에 대한 강화 학습이 이루어지는 단계를 더 포함할 수 있다. 더욱 바람직하게는, 드론으로부터 얻은 입력 데이터 및 출력 데이터를 기반으로 상기 단계 에서 학습한 동역학 모델링을 검 증하는 단계를 더 포함할 수 있다. 바람직하게는, 상기 단계 은, 기계 학습을 통해 상기 입력 데이터 및 상기 출력 데이터를 이용하여 상기 가상의 동역학 모델링을 추정할 수 있다. 더욱 바람직하게는, 상기 단계 은, 신경망 모델을 사용할 수 있다. 더욱 바람직하게는, 상기 단계 는, 보상 함수의 기대값을 최대화하도록 상기 동역학 모델링에 대한 강화 학습이 이루어질 수 있다. 더욱 바람직하게는, 상기 보상 함수는, 상기 단계 에서 생성한 상기 가상의 동역학 모델링과 상기 단계 에서 생성한 동역학 모델링 사이의 정확 도를 비교하여 보상을 결정할 수 있다. 바람직하게는, 상기 단계 은, 쿼드 로터 구조를 가진 드론에 대한 가상의 동역학 모델링을 생성할 수 있다."}
{"patent_id": "10-2017-0151450", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안하고 있는 인공지능 기반의 드론의 동역학 모델링 생성 방법에 따르면, 드론의 동역학 모델링 생성 시 초기에 드론의 데이터 취득이 어려운 상황에서 학습 및 추론을 위한 가상의 동역학 모델을 생성하고, 가상의 동역학 모델로부터 가상의 입출력 데이터를 취득하여 인공지능 기반의 모델 학습을 통해 보다 정확한 드 론의 동역학 모델링을 생성하고 검증할 수 있다. 또한, 본 발명에서 제안하고 있는 인공지능 기반의 드론의 동역학 모델링 생성 방법에 따르면, 가상의 동역학 모델로부터 입력 데이터 및 출력 데이터를 얻음으로써, 드론으로부터 데이터를 실시간으로 취득할 필요가 없고, 드론에 데이터 취득을 위한 별도의 센서를 탑재하거나 변형을 가하지 않고도 본래 상태에서의 드론의 동역학 모 델링을 생성하고 검증할 수 있다."}
{"patent_id": "10-2017-0151450", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하 게 실시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명 함에 있어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체 에 걸쳐 동일 또는 유사한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 ‘연결’되어 있다고 할 때, 이는 ‘직접적으로 연결’되어 있는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 ‘간접적으로 연결’되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 ‘포함’한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 도 3은 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 개략적인 순서를 도시 한 도면이다. 도 3에 도시된 바와 같이, 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법은, 입력 데이터가 주어지면 출력 데이터를 출력하는 드론의 동역학 모델링을 생성할 수 있다. 이때, 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법은, 인공지능을 이용하여 드론의 입출력 데이터를 취득한 후, 기계 학습을 통해 드론의 동역학 특성을 모델링할 수 있다. 드론의 입출력 데이터 를 이용하여 기계 학습을 통해 드론의 동역학 모델링이 학습되고 추론됨으로써, 본 발명은 보다 정확한 드론의 동역학 모델링을 생성할 수 있다. 즉, 초기에 드론의 데이터 취득이 어려운 상황에서 동역학 모델링의 학습 및 추론을 위해 가상의 동역학 모델링을 생성하고, 이러한 가상의 동역학 모델링을 기반으로 입출력 데이터를 취득 하여 인공지능을 통해 동역학 모델링에 대한 학습 및 추론이 이루어짐으로써, 드론에 별도의 데이터 취득을 위 한 센서를 탑재하지 않고도 드론의 동역학 모델링을 생성할 수 있다. 도 4는 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 구성을 도시한 도면이 다. 도 4에 도시된 바와 같이, 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법 은, 수학적으로 가상의 동역학 모델링을 생성하는 단계(S100), 단계 S100에서 생성한 가상의 동역학 모델링으로 부터 입력 데이터 및 출력 데이터를 얻는 단계(S200), 및 단계 S200에서 얻은 입력 데이터 및 출력 데이터를 이 용하여 인공지능 기반으로 모델링을 추정함으로써 동역학 모델링을 생성하는 단계(S300)를 포함할 수 있다. 또 한, 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법은, 단계 S100에서 생성한 가 상의 동역학 모델링과 단계 S300에서 생성한 동역학 모델링 사이의 정확도를 비교하여 동역학 모델링에 대한 강 화 학습이 이루어지는 단계(S400), 및 드론으로부터 얻은 입력 데이터 및 출력 데이터를 기반으로 단계 S400에 서 학습한 동역학 모델링을 검증하는 단계(S500)를 더 포함할 수 있다. 이하에서는, 본 발명의 일 실시예에 따 른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 각각의 구성에 대해 상세히 설명하기로 한다. 도 5는 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 단계 S100에서 생성되 는 동역학 모델링을 예시한 도면이다. 도 5에 도시된 바와 같이, 단계 S100에서는, 수학적으로 가상의 동역학 모델링을 생성할 수 있다. 단계 S100에서 생성하는 가상의 동역학 모델링은 드론의 물리적 특성을 고려하여 수 학적으로 표현한 드론의 동역학 모델링일 수 있다. 단계 S100에서 생성되는 가상의 동역학 모델링은, 쿼드 로터 기반의 동역학 방정식으로서, 위치 에너지, 병진 운동 에너지 및 회전 운동 에너지의 관계식을 이용하여 생성될 수 있다. 그러나 가상의 동역학 모델링은, 수학 적으로 드론의 동역학을 설명할 수 있는 모델이라면, 그 구체적인 실시예로 한정되지 않는다. 이러한 가상의 동역학 모델링은, ‘쿼드-로터 무인항공기 설계 및 제어 기법 연구’ 등에 대한 논문을 참조하여 선택될 수 있 다. 한편, 단계 S100에서는, 쿼드 로터(Quad Rotor) 구조를 가진 드론에 대한 가상의 동역학 모델링을 생성할 수 있 다. 일반적으로 대부분의 드론은 쿼드 로터 구조를 가지고 있으며, 모터가 6개인 헥사 로터(Hexa Rotor) 또는 8개인 옥타 로터(Octa Rotor) 구조를 가진 드론의 경우, 쿼드 로터 구조에 리던던시(Redundancy)만을 추가한 구조에 해당한다. 따라서 쿼드 로터 구조의 가상의 동역학 모델링을 기반으로 하여 리던던시를 추가함으로써 헥 사 로터 또는 옥타 로터 구조의 드론에 대해서도 가상의 동역학 모델링을 생성할 수 있다. 즉, 단계 S100에서 생성하는 가상의 동역학 모델링은 쿼드 로터 구조를 가진 드론에 한정되는 것은 아니며, 수학적으로 가상의 동 역학 모델링을 생성할 수 있다면 어떤 구조의 드론에도 적용될 수 있다. 단계 S200에서는, 단계 S100에서 생성한 가상의 동역학 모델링으로부터 입력 데이터 및 출력 데이터를 얻을 수 있다. 단계 S200에서는, 단계 S100에서 생성한 가상의 동역학 모델링으로부터 다양한 입력 데이터 및 출력 데 이터를 얻을 수 있다. 이러한 입력 데이터 및 출력 데이터는, 후술하는 단계에서 동역학 모델링에 대한 학습 및 추론을 위한 데이터로 사용될 수 있다. 즉, 단계 S200은, 동역학 모델링에 대한 학습 및 추론을 위한 전처 리 단계에 해당할 수 있다. 한편, 단계 S200에서 얻는 입력 데이터 및 출력 데이터는 단계 S100에서 생성한 가 상의 동역학 모델링에 따라 상이할 수 있다. 가상의 동역학 모델링에 따라서는 입력 데이터로 입력되는 변수와, 출력 변수로 출력되는 변수가 상이할 수 있기 때문이다. 도 6은 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 단계 S300에서 생성되 는 동역학 모델링을 예시한 도면이다. 단계 S300에서는, 단계 S200에서 얻은 입력 데이터 및 출력 데이터를 이 용하여 인공지능 기반으로 가상의 동역학 모델링을 추정함으로써 동역학 모델링을 생성할 수 있다. 보다 구체 적으로, 단계 S300에서는, 기계 학습을 통해 입력 데이터 및 출력 데이터를 이용하여 가상의 동역학 모델링을 추정할 수 있다. 즉, 단계 S300에서는 단계 S200에서 얻은 입력 데이터 및 출력 데이터에 대한 기계 학습을 이 루어짐으로써 가상의 동역학 모델링을 추정할 수 있다. 그러나 단계 S300에서 추정하는 동역학 모델링은, 단계 S100에서 생성한 가상의 동역학 모델링과는 상이할 수 있다. 단계 S300에서는, 단계 S200에서 얻은 입력 데이터 및 출력 데이터를 이용하여 가상의 동역학 모델링에 대한 추정이 이루어지지만, 단계 S300에서 추정되는 동역학 모델링은 입출력 데이터의 과적합(Overfitting)을 고려하여 추정되므로 가상의 동역학 모델링과는 완전히 일치하지 않을 수도 있다. 즉, 단계 S300에서는, 단계 S200에서 얻은 입력 데이터에 따라 단계 S200에서 얻은 출력 데이터를 정확히 출력하는 동역학 모델링을 생성하 는 것이 아니라, 단계 S200에서 얻은 입력 데이터 및 출력 데이터 집합에 포함된 패턴을 추정하여 동역학 모델 링을 생성할 수 있다. 만약 단계 S300에서 단계 S200에서 얻은 출력 데이터를 정확히 출력하는 동역학 모델링 을 추정한다면, 단계 S200에서 얻지 못한 입력 데이터 및 출력 데이터 범위의 경우, 추정된 동역학 모델링이 드 론의 동역학을 제대로 설명할 수 없기 때문이다. 따라서 실제 드론에 대한 입력 데이터가 단계 S300에서 추정 된 동역학 모델링에 입력되는 경우, 추정된 패턴에 따라 가상의 동역학 모델링과는 다른 출력 데이터를 출력할 수 있다. 도 6을 참조하면, 단계 S300에서는, 신경망 모델을 사용할 수 있다. 즉, 단계 S300에서는, 일반적인 수학적 모 델링이 아니라, 신경망 모델을 사용하여 가상의 동역학 모델링에 대한 추정이 이루어질 수 있다. 보다 구체적 으로, 단계 S300에서는, 단계 S200에서 얻은 입력 데이터 및 출력 데이터를 이용하여 은닉층(Hidden layer)을 생성하고, 가중치를 조정함으로써 동역학 모델링을 생성할 수 있다. 도 6에 도시된 예시에서는, 신경망 모델에 서 은닉층은 1개이나 이에 한정되는 것은 아니며, 은닉층은 복수개로 형성될 수도 있다. 즉, 단계 S300에서는, 단계 S200에서 얻은 입력 데이터를 신경망 모델의 Input Data로 입력하여, 단계 S200에서 얻은 출력 데이터를 출력하도록 입력 데이터에 포함된 변수에 따라 가중치와 은닉층을 생성할 수 있다. 도 7은 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 단계 S400에서 강화 학 습이 이루어지는 모습을 도시한 도면이다. 단계 S400에서는, 단계 S100에서 생성한 가상의 동역학 모델링과 단 계 S300에서 생성한 동역학 모델링 사이의 정확도를 비교하여 동역학 모델링에 대한 강화 학습이 이루어질 수 있다. 이때, 단계 S400에서는, 보상 함수의 기대값을 최대화하도록 동역학 모델링에 대한 강화 학습이 이루어 질 수 있다. 여기서, 강화 학습은, 추정된 동역학 모델링의 결과에 대해 보상으로 피드백을 제공함으로써 이루 어질 수 있다.보상 함수는, 단계 S100에서 생성한 가상의 동역학 모델링과 상기 단계 S300에서 생성한 동역학 모델링 사이의 정확도를 비교하여 보상을 결정할 수 있다. 도 7을 참조하면, 실시예에 따라서는, 단계 S400에서는, 가상의 동 역학 모델링의 정확도가 인공지능 기반 동역학 모델링의 정확도보다 높은 경우, -1의 보상을 얻을 수 있다. 반 대로, 가상의 동역학 모델링의 정확도가 인공지능 기반 동역학 모델링의 정확도보다 낮은 경우, +1의 보상을 얻 을 수 있다. 즉, 단계 S400에서는, 추정된 동역학 모델링에 대한 피드백을 보상의 형태로 제공함으로써, 보상 함수의 보상에 따른 기대값을 최대화하도록 동역학 모델링의 학습에 대한 방향성을 결정할 수 있다. 따라서 단 계 S400에서는, 동역학 모델링에 대한 강화 학습을 통해 학습에 대한 피드백을 제공하고, 그 결과 보다 정확한 동역학 모델링을 추정할 수 있다. 단계 S500에서는, 드론으로부터 얻은 입력 데이터 및 출력 데이터를 기반으로 단계 S400에서 학습한 동역학 모 델링을 검증할 수 있다. 실시예에 따라서는, 단계 S500에서 실제 드론으로부터 얻은 입력 데이터 및 출력 데이 터를 이용하여 동역학 모델링에 대한 강화 학습이 이루어질 수 있다. 즉, 보상 함수는, 가상의 동역학 모델링 과 동역학 모델링 사이의 정확도를 비교하여 보상을 결정하는 실시예로 한정되지는 않는다. 실시예에 따라서는, 보상 함수를 통해 동역학 모델링에 따른 데이터와 실제 드론으로부터 얻은 데이터와의 정확 도가 높을수록 보상을 제공함으로써 동역학 모델링에 대한 강화 학습이 이루어질 수 있다. 따라서 실제 드론으 로부터 얻은 데이터를 기반으로, 드론의 움직임을 보다 정확하게 반영할 수 있는 동역학 모델링을 학습하도록 피드백을 제공할 수 있다. 전술한 바와 같이, 본 발명에서 제안하고 있는 인공지능 기반의 드론의 동역학 모델링 생성 방법에 따르면, 드 론의 동역학 모델링 생성 시 초기에 드론의 데이터 취득이 어려운 상황에서 학습 및 추론을 위한 가상의 동역학 모델을 생성하고, 가상의 동역학 모델로부터 가상의 입출력 데이터를 취득하여 인공지능 기반의 모델 학습을 통 해 보다 정확한 드론의 동역학 모델링을 생성하고 검증할 수 있다. 또한, 본 발명에서 제안하고 있는 인공지능 기반의 드론의 동역학 모델링 생성 방법에 따르면, 가상의 동역학 모델로부터 입력 데이터 및 출력 데이터를 얻 음으로써, 드론으로부터 데이터를 실시간으로 취득할 필요가 없고, 드론에 데이터 취득을 위한 별도의 센서를 탑재하거나 변형을 가하지 않고도 본래 상태에서의 드론의 동역학 모델링을 생성하고 검증할 수 있다."}
{"patent_id": "10-2017-0151450", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 설명한 본 발명은 본 발명이 속한 기술분야에서 통상의 지식을 가진 자에 의하여 다양한 변형이나 응용이 가능하며, 본 발명에 따른 기술적 사상의 범위는 아래의 청구범위에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2017-0151450", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 쿼드 로터 구조의 드론을 도시한 도면. 도 2는 수학적으로 표현한 드론의 동역학 모델링을 도시한 도면. 도 3은 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 개략적인 순서를 도시 한 도면. 도 4는 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 구성을 도시한 도면. 도 5는 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 단계 S100에서 생성되 는 동역학 모델링을 예시한 도면. 도 6은 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 단계 S300에서 생성되 는 동역학 모델링을 예시한 도면. 도 7은 본 발명의 일 실시예에 따른 인공지능 기반의 드론의 동역학 모델링 생성 방법의 단계 S400에서 강화 학 습이 이루어지는 모습을 도시한 도면."}
