{"patent_id": "10-2023-0024569", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0088515", "출원번호": "10-2023-0024569", "발명의 명칭": "현실 공간 기반의 가상현실 게임 서비스 제공방법", "출원인": "인중현", "발명자": "인중현"}}
{"patent_id": "10-2023-0024569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "프로세서 및 메모리를 포함하는 서버가 현실 공간 기반의 가상현실게임 서비스를 제공하는 방법에 있어서,(a) 무인 이동체로부터 특정 현실 공간에 대한 영상 데이터를 획득하는 단계;(b) 상기 획득한 영상 데이터를 기반으로 상기 특정 현실 공간에 대한 맵 데이터를 생성하는 단계; 및(c) 상기 생성한 맵 데이터를 사용자 단말에 전송하는 단계;를 포함하고,상기 맵 데이터는,상기 특정 현실 공간이 가상의3차원 이미지 데이터로 변환된 데이터인 것을 특징으로 하는,현실 공간 기반의 가상현실 게임 서비스 제공방법."}
{"patent_id": "10-2023-0024569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제2항에 있어서,상기 특정 현실 공간은,상기 무인 이동체가 영상을 촬영한 시점부터 영상 촬영이 종료된 시점까지의 촬영된 공간인 것을 특징으로하는,현실 공간 기반의 가상현실 게임 서비스 제공방법."}
{"patent_id": "10-2023-0024569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 (b)단계는,(b-1) 상기 획득한 영상 데이터 내의 객체를 구분하는 단계;(b-2) 상기 구분한 객체를 객체 변환 알고리즘을 활용하여 가상 객체로 변환하는 단계; 및(b-3) 상기 변환된 가상 객체를 기반으로 맵 데이터를 생성하는 단계;를 포함하는,현실 공간 기반의 가상현실 게임 서비스 제공방법."}
{"patent_id": "10-2023-0024569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 객체 변환 알고리즘은,상기 객체를 상기 객체의 외관과 유사한 가상 객체로 변환하는 알고리즘인 것을 특징으로 하는,현실 공간 기반의 가상현실 게임 서비스 제공방법.공개특허 10-2024-0088515-3-청구항 5 제3항에 있어서,상기 객체 변환 알고리즘은,상기 사용자 단말에 의해 특정 주제가 선택된 경우, 상기 객체를 상기 객체의 외관과 유사한 가상 객체 중 상기특정 주제에 관련된 가상 객체로 변환하는 알고리즘인 것을 특징으로 하는,"}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 프로세서 및 메모리를 포함하는 서버가 현실 공간 기반의 가상현실게임 서비스를 제공하는 방법에 있어서, (a) 무인 이동체로부터 특정 현실 공간에 대한 영상 데이터를 획득하는 단계, (b) 상기 획득한 영상 데이터를 기반으로 상기 특정 현실 공간에 대한 맵 데이터를 생성하는 단계 및 (c) 상기 생성한 맵 데이터를 사용자 단말에 전송하는 단계를 포함하고, 상기 맵 데이터는, 상기 특정 현실 공간이 가상의3차원 이미 지 데이터로 변환된 데이터인 것을 특징으로 한다."}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 현실 공간 기반의 가상현실 게임 서비스 제공방법에 관한 것이다. 보다 자세하게는 무인 이동체로부 터 특정 현실 공간(예. 사무실, 침실 등)에 대한 영상 데이터를 획득하면, 영상 데이터 내에 포함되어 있는 실 물의 객체(예. 책상)를 가상의 객체(예. 건물)로 변환하여 가상의 맵 데이터를 생성하고, 생성한 맵 데이터를 가상현실 게임 서비스가 실행되는 사용자 단말에 전달하여, 사용자들에게 현실 공간 기반의 가상현실 게임 서비 스 제공하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온라인 게임은 인터넷과 같은 온라인 네트워크를 통해 진행되는 게임을 말한다. 온라인 게임은 사용자의 메타버스(Metaverse)인 사용자의 아바타(Avatar)가 가상의 현실 속에서 몬스터를 사냥 하는 사냥꾼이 되거나, 자동차를 경주하는 레이서가 될 수 있도록 하여, 현실 세계의 사용자가 실제로 경험하기 힘든 새로운 경험을 온라인 상으로 체험할 수 있도록 한다. 이렇게 사용자가 현실 세계의 사용자가 실제로 경험하기 어려운 경험을 체험할 수 있도록 하는 것은 마치 현실 세계와 같이 생동감 있게 제작된 '게임 맵'덕분일 것이다. 게임 맵은 게임 개발 단계에서 개발자 또는 게임 그래픽 디자이너에 의하여 제작된 데이터로서, 게임의 현장감 과 몰입감을 향상시키기 위하여 게임의 배경, 주제에 맞게 제작된 데이터일 것이다. 종래의 게임 맵 생성 방법으로는 앞서 언급한 바와 같이 개발자 또는 게임 그래픽 디자이너에 의하여 생성되고 있으며, 더 나아가 사용자의 게임 결과에 의하여 랜덤으로 맵이 생성되는 방법도 개발되었다(대한민국 공개특허 공보 10-2021-0061691). 다만, 종래의 게임 맵 생성 방법은 게임 개발자의 입맛으로만 제작되었기에 사용자의 취향에 따라 호불호(好不 好)가 갈렸으며, 게임 개발자들이 생성한 게임의 맵이 실제와 너무 상이하여 괴리감을 느끼거나 몰입감을 저하 시키는 문제점도 발생하였다. 본 발명은 이와 같은 문제점에 착안하여 도출된 것으로, 이상에서 살핀 기술적 문제점을 해소시킬 수 있음은 물"}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "론, 본 기술분야에서 통상의 지식을 가진 자가 용이하게 고안할 수 없는 추가적인 기술요소들을 제공하기 위해 발명되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제 10-2021-0061691호(2021.05.28)"}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "발명의 내용"}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는 사용자가 게임 맵으로 설정하고자 하는 현실 공간의 영상 데이터를 획득하고, 영상 데이터를 기반으로 게임 맵을 생성하여 사용자가 익숙한 공간에서 새로운 경험을 체험할 수 있 도록 하는 현실 공간 기반의 가상현실 게임 서비스 제공방법을 제공하는 것이다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위한 본 발명의 일 실시 예에 따른 프로세서 및 메모리를 포함하는 서버가 현실 공간 기반의 가상현실게임 서비스를 제공하는 방법은 (a) 무인 이동체로부터 특정 현실 공간에 대한 영상 데이 터를 획득하는 단계, (b) 상기 획득한 영상 데이터를 기반으로 상기 특정 현실 공간에 대한 맵 데이터를 생성하 는 단계 및 (c) 상기 생성한 맵 데이터를 사용자 단말에 전송하는 단계를 포함하고, 상기 맵 데이터는, 상기 특 정 현실 공간이 가상의3차원 이미지 데이터로 변환된 데이터인 것을 특징으로 할 수 있다. 일 실시 예에 따르면, 상기 특정 현실 공간은, 상기 무인 이동체가 영상을 촬영한 시점부터 영상 촬영이 종료된 시점까지의 촬영된 공간인 것을 특징으로 할 수 있다. 일 실시 예에 따르면, 상기 (b)단계는, (b-1) 상기 획득한 영상 데이터 내의 객체를 구분하는 단계, (b-2) 상기 구분한 객체를 객체 변환 알고리즘을 활용하여 가상 객체로 변환하는 단계 및 (b-3) 상기 변환된 가상 객체를 기반으로 맵 데이터를 생성하는 단계를 포함할 수 있다. 일 실시 예에 따르면, 상기 객체 변환 알고리즘은, 상기 객체를 상기 객체의 외관과 유사한 가상 객체로 변환하 는 알고리즘인 것을 특징으로 할 수 있다. 일 실시 예에 따르면, 상기 객체 변환 알고리즘은, 상기 사용자 단말에 의해 특정 주제가 선택된 경우, 상기 객 체를 상기 객체의 외관과 유사한 가상 객체 중 상기 특정 주제에 관련된 가상 객체로 변환하는 알고리즘인 것을 특징으로 할 수 있다."}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따르면, 사용자가 게임 맵으로 설정하고자 하는 현실 공간의 영상 데이터를 획득하고, 영상 데이터를 기반으로 게임 맵을 생성함으로써, 사용자가 본인 취향에 맞는 게임 맵을 설정할 수 있다는 또 다른 재미를 제공할 수 있는 효과가 있다. 또한, 서버가 현실 공간의 영상 데이터를 기반으로 게임 맵을 생성할 때에 영상 데이터 내의 객체를 상기 객체 와 유사한 형상과 구조를 가지는 가상의 객체로 변환하여 게임 맵을 생성함으로써, 사용자가 평상시 자주 보던 공간이어서 익숙하지만, 이러한 익숙한 공간 속에서 다양한 객체들을 느끼고 체험할 수 있도록 하여 사용자의 흥미를 유발할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재 로부터 통상의 기술자에게 명확하게 이해 될 수 있을 것이다."}
{"patent_id": "10-2023-0024569", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예를 상세히 설명한다. 본 발명의 이점 및 특징, 그리 고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것 이다. 그러나 본 발명은 이하에서 게시되는 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한, 이상적으 로 또는 과도하게 해석되지 않을 것이다. 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는 (comprising)\"은 언급된 구성 요소, 단계, 동 작 및/또는 소자는 하나 이상의 다른 구성 요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 도 1은 본 발명의 제1 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스를 제공하는 서버가 포함하 는 전체 구성을 나타낸 도면이다. 그러나 이는 본 발명의 목적을 달성하기 위한 바람직한 실시 예일 뿐이며, 필요에 따라 일부 구성이 추가되거나 삭제될 수 있고, 어느 한 구성이 수행하는 역할을 다른 구성이 함께 수행할 수도 있음은 물론이다. 본 발명의 제1 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스를 제공하는 서버는 프로세서, 네트워크 인터페이스, 메모리, 스토리지 및 이들을 연결하는 데이터 버스를 포함할 수 있다. 프로세서는 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processer Unit), MCU(Micro Controller Unit) 또는 본 발명이 속하는 기술 분야에서 널리 알려져 있는 형태의 프로세서 중 어느 하나일 수 있다. 아울러, 프로세서는 본 발명의 제2 실시 예에 따른 현실 공 간 기반의 가상현실 게임 서비스 제공방법을 수행하기 위한 적어도 하나의 애플리케이션 또는 프로그램에 대한 연산을 수행할 수 있으며, 인공지능 프로세서로 구현함이 바람직하다 할 것이다. 네트워크 인터페이스는 본 발명의 제1 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스를 제공하는 서버의 유무선 인터넷 통신을 지원하며, 그 밖의 공지의 통신 방식을 지원할 수도 있다. 따라서 네트워크 인터페이스는 그에 따른 통신 모듈을 포함하여 구성될 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장하며, 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가 상현실 게임 서비스 제공방법을 수행하기 위해 스토리지로부터 하나 이상의 컴퓨터 프로그램을 로드할 수 있다. 도 1에서는 메모리의 하나로 RAM을 도시하였으나 이와 더불어 다양한 저장 매체를 메모리로 이용할 수 있음은 물론이다. 스토리지는 하나 이상의 컴퓨터 프로그램 및 대용량 네트워크 데이터를 비임시적으로 저장할 수 있 다. 이러한 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 발명이 속하는 기술 분야에서 널리 알려져 있는 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체 중 어느 하나 일 수 있다. 컴퓨터 프로그램은 메모리에 로드되어, 하나 이상의 프로세서에 의해 (A) 무인 이동체로부터 특정 현실 공간에 대한 영상 데이터를 획득하는 프로세스, (B) 상기 획득한 영상 데이터를 기반으로 상기 특정 현실 공간에 대한 맵 데이터를 생성하는 프로세스 및 (C) 상기 생성한 맵 데이터를 사용자 단말에 전송하는 프로세스 를 실행할 수 있다. 지금까지 간단하게 언급한 컴퓨터 프로그램이 수행하는 오퍼레이션은 컴퓨터 프로그램의 일 기능으로 볼 수 있으며, 보다 자세한 설명은 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공 방법에 대한 설명에서 후술하도록 한다. 데이터 버스는 이상 설명한 프로세서, 네트워크 인터페이스, 메모리 및 스토리지 사이의 명령 및/또는 정보의 이동 경로가 된다. 이상 설명한 본 발명의 제1 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스를 제공하는 서버는 네 트워크 기능을 보유한 물리적으로 독립된 전자 장치일 수 있으나, 사용자 단말 또는 학습 데이터 제공 서 버(미도시)로부터 사용자 데이터 또는 학습 데이터를 수신해야 할 수 있으므로 해당 서버의 일 기능으로 구현할 수도 있으며, 이 경우 해당 서버는 유형의 물리적인 서버일 수도 있고, 가상의 클라우드(Cloud) 서버일 수도 있 음은 물론이라 할 것이다. 이하, 본 발명의 제2 실시 예에서 자주 언급되는 사용자 단말의 하드웨어적 특징을 살펴보고, 본 발명의 제2실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공방법에 대한 개념을 간략히 살펴보도록 한다. 먼저, 본 상세한 설명에서 언급되는 사용자 단말은 다음과 같은 하드웨어적 특징을 가질 수 있다. 사용자 단말과 관련하여, 본 상세한 설명에서 언급되는 사용자 단말은 사용자가 보유하거나 소지하고 다니 는 장치를 일컫는 것으로, 여기에는 스마트폰, PDA, 태블릿PC 등과 같이 휴대가 가능한 단말기는 물론 홈PC 등 과 같은 설치 형 단말기도 포함될 수 있다. 이러한 사용자 단말을 구성적 측면(예. 프로세서, 메모리 등)은 도1에 도시된 서버의 전체 구성과 일 부 유사하기에 중복 설명을 방지하고자 사용자 단말의 구성적 측면에 대한 설명은 생략하도록 한다. 참고로, 본 상세한 설명에서는 발명의 이해를 돕기 위하여 사용자 단말이 스마트폰, 또는 태블릿PC인 경우를 상 정 하여 설명하기로 한다. 이 경우, 상기 사용자 단말은 디스플레이 및 터치 감응형 표면을 포함할 수 있으며, 나아가 부수적으로 물리적 키보드, 마우스 및/또는 조이스틱과 같은 하나 이상의 다른 물리적 사용자 입력용 수 단이 더 연결될 수도 있다. 또한 상기 사용자 단말은 소리나 음성을 감지하고 녹음할 수 있는 수단을 더 포함할 수도 있다. 한편, 사용자 단말 상에서 실행되는 다양한 어플리케이션들은, 옵션적으로, 터치 감응형 표 면과 같은 적어도 하나 의 보편적인 물리적 사용자 입력용 수단을 사용할 수 있다. 터치 감응형 표면의 하나 이 상의 기능뿐만 아니라 단말 상에 표시되는 대응하는 정보는 하나의 어플리케이션으로부터 다음 어플리케이션으 로 그리고/또는 개별 어플리케이션 내에서 옵션적으로 조정되거나 변경될 수 있다. 이러한 방식으로, 사용자 단 말의 (터치 감응형 표면과 같은) 보편적인 물리적 아키텍처는, 옵션적으로, 사용자에게 직관적이고 명료한 사용 자 인터페이스들을 이용 하여 다양한 어플리케이션들을 지원할 수 있다. 한편, 본 발명에서 설명하는 사용자 단말은 호스트 단말과 게스트 단말로 나뉘어 표현될 수 있다. 구체적 으로, 본 발명은 사용자 1인에게 현실 공간 기반의 가상현실 게임 서비스를 제공할 수 있을 뿐만 아니라 복수의 사용자들이 하나의 게임 맵에 초대되어 상기 현실 공간 기반의 가상현실 게임 서비스를 즐길 수 있도록 하는 멀 티 게임 서비스일 수도 있는바, 본 발명의 사용자 단말은 특정 현실 공간에 대한 게임 맵을 설정하고, 설 정된 게임 맵을 기반으로 한 게임에 게스트 단말을 초대하는 호스트 단말과 호스트 단말에 의하여 초대된 게스 트 단말로 나뉘어 표현될 수 있다.이 때, 호스트 단말이 본인이 원하는 게임 맵을 설정하는 방법은 이하 설명할 제2 실시 예에 따른 현실 공간 기 반의 가상현실 게임 서비스 제공방법을 통하여 설명하도록 한다. 다른 한편, 본 발명에서 말하는 사용자 단말은 후술할 무인 이동체를 리모트 컨트롤하는 단말이 될 수 있다. 다시 말해, 사용자 단말은 원격으로 무인 이동체의 동작을 제어하는 단말이라고도 말할 수 있다. 도2는 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공방법을 개념적으로 이해하기 위하여 나타낸 도면이다. 도2를 참고하면, 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스를 제공하는 서버(이하 서버라 약칭함)는 무인 이동체로부터 특정 현실 공간에 대한 영상 데이터를 획득하면(①), 영상 데이 터 내에 포함되어 있는 실물의 객체를 가상의 객체로 변환하여 가상의 맵 데이터를 생성하고, 생성한 맵 데이터 를 가상현실 게임 서비스가 실행되는 사용자 단말에 전달하여(②), 사용자들에게 현실 공간 기반의 가상현 실 게임 서비스 제공하는 서버이다. 참고로, 여기서 말하는 맵 데이터는 상기 특정 현실 공간이 가상의3차원 이미지 데이터로 변환된 데이터를 말할 수 있으며, 쉽게 말해, 현실 공간을 기반으로 생성된 게임 맵 데이터라고도 말할 수 있다. 이러한 본 발명의 서버가 사용자들에게 현실 공간 기반의 가상현실 게임 서비스 제공하는 방법에 대하여 구체적으로 살펴보기 이전에 본 발명의 무인 이동체의 전체 구성과 본 발명에서 자주 사용되는 용어에 대 하여 간략히 살펴보도록 한다. 도3은 본 발명의 제2 실시 예에 따른 무인 이동체의 전체 구성을 모식도로 나타낸 도면이다. [무인 이동체] 도3을 참고하면, 본 발명의 무인 이동체는 카메라, 통신부, 자율주행 실행부, 구동부 및 제어부를 포함할 수 있다. 카메라는 공간, 피사체 등을 촬영하여 영상 데이터를 생성하는 구성요소이다. 카메라는 후술할 구동부에 의하여 공간, 피사체를 다각도로 촬영할 수 있으며, 정지된 이미지 데이터 또는 움직이는 영상 데이터를 생성할 수 있다. 카메라에 의하여 생성된 영상 데이터는 이후에 서버가 영상 데이터 내의 객체를 구분하는 데이터 리 소스로서 활용될 수 있다. 아울러, 카메라는 서버가 피사체(또는 객체)의 특징을 판단할 수 있는 데이터 리소스를 생성할 수 있 다. 구체적으로 카메라는 적외선 열 감지 카메라, 모션 감지 카메라 등을 포함할 수 있어, 서버가 획 득한 영상 데이터의 형상과 구조를 통하여 객체를 구분하는 것이 아니라 객체의 열 또는 객체의 모션들을 감지 하여 해당 객체가 무엇인지 판단할 수 있도록 객체의 특징을 판단한 수 있는 데이터 리소스를 생성하여 서버 에 전달할 수 있다. 통신부는 무인 이동체가 서버와 사용자 단말과의 데이터 교환이 가능하도록 마련된 구성요 소이다. 구체적으로, 통신부는 서버에 영상 데이터를 송신하거나. 사용자 단말로부터 구동을 위 한 제어 신호를 수신할 수 있다. 본 발명의 무인 이동체는 사용자 단말의 구동 제어 신호에 의하여 구동이 제어될 수 있을 뿐만 아니 라, 사용자 단말이 특정 현실 공간의 거리 범위를 지정하면, 자율주행 실행부를 통하여 상기 지정된 특정 현실 공간 거리 범위를 무인 이동체 스스로 자율주행하여 영상 데이터를 획득할 수 있다. 참고로, 앞서 무인 이동체가 사용자 단말이 특정 현실 공간의 거리 범위를 지정하면, 자율주행 실행 부가 자율주행을 실시한다고 하였지만, 이뿐만 아니라 사용자가 무인 이동체의 작동 시작을 요청하면, 무인 이동체는3차원 레이더 센서를 활용하여 주변 공간을 스스로 인식하여 특정 현실 공간의 거 리 범위를 지정하고, 상기 지정한 특정 현실 공간 거리 범위를 무인 이동체 자율주행하여 영상 데이터를 획득할 수 있다. 자율주행 실행부는 무인 이동체가 자율주행을 수행하기 위하여 또는 양질의 영상 데이터를 획득할 수 있도록 하기 위하여 객체 인식부 및 객체 추적부를 포함할 수 있다.객체 인식부는 특정 현실 공간의 영상 데이터를 획득하고자 객체 그 자체를 구분하고 인식하는 역할을 수 행할 뿐만 아니라 무인 이동체가 자율주행할 때에 객체 또는 사용자들과 충돌하지 않도록 객체(여기서는 장애물로 이해할 수 있음)를 인식하는 역할을 수행하는 구성요소이다. 객체 추적부는 양질의 영상 데이터를 획득하기 위하여 객체 인식부을 통하여 인식한 객체를 자동으로 추적하여 객체를 다각도로 촬영할 수 있도록 하는 구성요소이다. 구체적으로, 본 발명의 서버는 사용자에 게 3차원 가상 객체가 포함된 맵 데이터를 게임 서비스 화면 상에 출력해야 하고, 3차원 가상 객체가 무인 이동 체로부터 획득한 영상 데이터의 객체와 유사한 형상 및 구조를 가지는 객체인바, 사용자에게 양질의 3차원 가상 객체를 제공하려면 무인 이동체가 영상 데이터를 획득할 때에 객체를 정밀하고 면밀하게 촬영할 필요 가 있기에 본 발명의 객체 추적부는 객체 인식부가 인식한 객체를 추적하여 상기 추적한 객체에 인접 한 위치로 접근하고, 카메라가 객체를 전/후/좌/우 면밀히 촬영할 수 있도록 한다. 구동부는 무인 이동체가 사용자 단말의 구동 제어에 의한 구동 또는 자율주행을 위한 구동을 실 시할 수 있도록 하는 구성요소이며, 모터 및 바퀴를 포함할 수 있다. 본 발명의 모터 및 바퀴는 기 공지된 기술에 의하여 설명이 가능한바, 본 발명의 설명에서는 모터 및 바퀴에 대한 자세한 설명을 생략하도록 한다. 한편, 본 발명의 무인 이동체는 단순 지면에 대한 이동뿐만 아니라 수면을 따라 이동하는 수상 무인 이동 체로 활용될 수 있으며, 더 나아가 비행이 가능한 항공 무인 이동체로서도 활용될 수 있는바, 무인 이동체의 구동부는 앞서 설명한 모터 및 바퀴를 포함하는 것에 한정되지 않으며, 무인 이 동체가 육/해/공을 이동할 수 있는 구성요소(예. 프로펠러 등)라면 본 발명의 구동부에 포함될 수 있 다. 제어부는, 카메라, 통신부, 자율주행 실행부 및 구동부 각각에 동작 가능하게 결합되 어, 이들의 동작을 제어할 수 있다. 제어부는, 하드웨어적으로, ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 마이크로 프로세서 (microprocessors), 기타 기능 수행을 위한 전기적 유닛 중 적어도 하나를 포함할 수 있다. 다시 말해, 제어부 는 무인 이동체에 마련된 구성요소들의 작동을 제어하기 위하여 제어 신호를 생성하고 전송한다. 도4는 본 발명의 제2 실시 예에 따른 무인 이동체가 특정 현실 공간에 대한 영상 데이터를 획득하는 모습 을 나타낸 도면이다. [특정 현실 공간] 본 발명에서 말하는 특정 현실 공간이란 무인 이동체가 영상을 촬영한 시점(P)부터 영상 촬영이 종료된 시 점(Q)까지의 촬영된 공간을 말할 수 있다. 특정 현실 공간은 이후에 사용자에게 제공되는 가상 현실 게임 상의 게임 맵을 말할 수 있으며, 게임 맵을 설정 하고자 하는 호스트 단말이 지정한 공간이라고도 말할 수 있다. 예를 들어, 게임 맵을 설정하고자 하는 사용자 단말(300, 여기서는 호스트 단말)이 본인의 사무실을 게임 맵으로 설정하고자 할 때에는 본인의 사무실 전체 또 는 일부가 본 발명의 특정 현실 공간이 될 수 있다. 참고로, 상기 사용자의 사무실에 배치된 의자. 컴퓨터, 책 상 등은 본 발명에서 말하는 영상 데이터 내에 포함된 객체이다. 도4의(A) 및 (B)는 본 발명의 무인 이동체가 특정 현실 공간의 영상 데이터를 획득할 때의 다양한 이동 경 로를 나타낸 도면이다. 무인 이동체는 도4의 (A)에 도시된 바와 같이 특정 현실 공간의 전체 영역을 순환하여 영상을 촬영한 시점 (P1)부터 영상 촬영이 종료된 시점(Q2)까지 촬영된 공간 또는 객체의 영상 데이터를 획득할 수 있다. 한편, 무인 이동체는 도4의 (B)에 도시된 바와 같이 특정 현실 공간의 전체 영역을 이동하지 않고 상기 특 정 현실 공간의 최단 거리(P2지점에서 Q2지점까지의 거리)를 연산하여 연산된 최단 거리를 이동하면서 공간 또 는 객체의 영상 데이터를 획득할 수 있다. 이 때의 무인 이동체는 연산된 최단 거리를 기준으로 이동하되, 객체 또는 공간에 대한 영상 데이터를 충분히 획득하지 못하였다고 판단(예. 형상 또는 구조를 인식할 수 없다 고 판단 등)한 경우, 객체 추적부를 통하여 인식한 객체 또는 공간에 인접한 위치에 접근하여 접근한 위치 에서 카메라가 해당 객체 또는 공간을 전/후/좌/우 면밀히 촬영할 수 있도록 하고, 다시 진행 중 이었던최단 거리에 회귀하여 특정 현실 공간에 대한 영상 데이터를 획득할 수 있다. 도5는 본 발명의 제2 실시 예에 따른 서버가 획득한 영상 데이터를 기반으로 불완전 특정 현실 공간 또는 불완전 객체를 추정하는 과정을 간단한 모식도로 나타낸 도면이다. 본 발명의 무인 이동체가 특정 현실 공간에 대한 영상 데이터를 획득할 때에 예기치 않은 이벤트(예. 객체 주위에 사람이 지나감, 사물들이 엉켜서 배치됨)에 의하여 일부 객체 또는 공간이 불완전한 상태로 영상 데이터 에 포함될 수 있는바, 본 발명의 서버는 사용자 단말에 영상 데이터에 대한 재획득을 요청하거나, 획 득한 불완전 특정 현실 공간 또는 불완전 객체를 과거에 학습한 데이터를 기반으로 상기 불완전한 특정 현실 공 간 또는 객체를 완전한 특정 현실 공간 또는 객체로 추정하여 추정한 특정 현실 공간 또는 객체를 기반으로 맵 데이터를 생성할 수 있다. 도5를 참고하면, 서버의 불완전 특정 현실 공간 또는 불완전 객체를 자동으로 추정하기 위해서는 무인 이 동체로부터 영상 데이터를 획득하고(①), 획득한 영상 데이터 내에 불완전 특정 현실 공간 또는 불완전 객 체를 감지한다(②). 참고로, 도5에서는 무인 이동체가 획득한 특정 현실 공간이 사용자의 개인 방이라는 것과 무인 이동체 가 개인 방의 설치된 컴퓨터를 촬영할 때에 사용자가 움직이면서 무인 이동체의 카메라 시야를 방해하였다는 것을 전제로 설명하도록 한다. 이후에, 서버는 사용자 단말에 특정 현실 공간에 대한 영상 데이터를 재획득하라는 요청을 전송하거 나(③), 과거 학습한 데이터를 기반으로 상기 ② 단계에서 감지한 불완전 객체가 컴퓨터이라고 추정하여(③) 추 정한 객체를 기반으로 맵 데이터를 생성한다. 참고로, 도5에서는 본 발명의 서버가 불완전 객체를 추정하는 방법의 예를 설명하였으며, 이하 불완전 특 정 현실 공간을 추정하는 방법의 예를 설명하자면, 본 발명의 서버는 유명한 공간(예. 사용자들이 자주 게 임 맵으로 설정하는 특정 현실 공간), 과거 사용자가 맵 데이터로 설정한 특정 현실 공간에 대한 데이터를 기록 및 저장할 수 있으며, 이 때, 사용자가 본인의 사무실을 과거에 맵 데이터로서 활용하였고, 사용자가 후속적으 로 본인의 사무실의 영상 데이터를 서버에 전송하였다는 것을 전제로, 서버가 상기 사무실 영상 데이 터 내에 불완전 특정 현실 공간을 감지하였을 경우, 상기 불완전 특정 현실 공간을 과거 사무실의 맵 데이터을 기반으로 완전한 특정 현실 공간을 추정할 수 있다. 도6은 본 발명의 제2 실시 예에 따른 서버가 객체 변환 알고리즘을 통하여 획득한 영상 데이터 내의 객체 를 가상 객체로 변환하는 과정을 나타낸 도면이다. [객체 변환 알고리즘] 본 발명의 서버는 디지털 트윈 기술을 활용하여 무인 이동체가 촬영한 특정 현실 공간에 포함된 객체 를 그대로 반영한 가상의 맵 데이터를 생성할 수 있으며, 더 나아가 객체를 상기 객체의 외관(형상 또는 구조) 과 유사한 가상 객체로 변환하여 사용자의 흥미를 유발할 수 있다. 쉽게 말해. 만일 사용자가 강의실을 특정 현 실 공간으로 지정하였을 경우, 서버는 강의실 내의 책상 및 의자의 객체가 그대로 반영된 가상의 맵 데이 터를 생성할 수 있으며, 상기 책상과 유사한 형상의 건물, 의자와 유사한 표지판 등의 가상 객체로 변환하여 가 상의 맵 데이터를 생성할 수 있다. 도6을 참고하면, 본 발명의 서버가 무인 이동체로부터 영상 데이터를 획득하였고, 획득한 영상 데이 터 내에 제1 객체(10a) 및 제2 객체(10b)을 구분하였으며, 제1 객체(10a)가 '물병'이고 제2 객체(10b)가 '공'이 라고 감지하였다는 것을 전제로, 서버는 맵 데이터를 생성할 시, 객체 변환 알고리즘을 통하여 제1 및 제2 객체(10a, 10b) 각각이 서버 데이터 베이스 내에 기 학습된 데이터(예, 사과, 도넛, 볼링핀) 중에서 '물병'인 제1 객체(10a)가 기 학습된 데이터인 '볼링핀'과 형상과 구조가 유사하다고 판단하고, 제1 객체(10a) 를 '볼링핀'의 가상 객체로 변환하고, 제2 객체(10b)를 '사과'의 가상 객체로 변환할 수 있다. 이러한 객체 변환 알고리즘은 현재 위치한 공간의 구조와 비슷하지만 이전에 배치되었던 객체와 상이한 가상의 객체가 출력되도록 하여, 사용자가 게임을 통하여 익숙하지만 새로운 공간을 체험할 수 있도록 한다. 도7은 본 발명의 제2 실시 예에 따른 서버가 객체 변환 알고리즘을 통하여 획득한 영상 데이터 내의 객체 를 가상 객체로 변환하는 또 다른 과정을 나타낸 도면이다. 앞서 설명한 바에 의하면, 객체 변환 알고리즘은 객체를 상기 객체의 외관과 유사한 가상 객체로 변환하는 알고 리즘이다. 이 때의 가상 객체는 서버 데이터 베이스 내에 저장된 학습 데이터이며, 학습 데이터 중 상기 객체와 가장 유사한 형상 및 구조를 가지는 데이터일 것이다. 이렇듯이, 실제 현실 공간에 배치된 객체(예. 책상, 의자)와 유사한 가상의 객체가 게임 화면 상에 출력되면 사 용자가 익숙하지만 새로운 공간을 게임을 통하여 체험할 수 있어 사용자의 흥미를 유발할 수 있다. 다만, 사용자의 몰입감을 향상시키기 위해서는 객체 변환 알고리즘에 의하여 변환된 가상 객체가 일관성 또는 통일성이 있어야 하는 것이 바람직하므로, 객체 변환 알고리즘은 사용자 단말이 특정 주제(예. 동물, 과일, 바다, 전쟁 등)를 선택한 경우, 객체를 상기 객체의 외관과 유사한 가상 객체 중 상기 특정 주제에 관련 된 가상 객체로 변환할 수 있다. 여기서 말하는 특정 주제는 동물, 과일 등과 같이 객체 그 자체를 분류하는 객체 카테고리이거나, 바다, 산 등 과 같은 배경 카테고리이거나, 전쟁, 호러 등과 같은 상황에 대한 카테고리를 말할 수 있다. 도7을 참고하면, 서버가 무인 이동체로부터 영상 데이터를 획득하였고, 사용자 단말로부터 특정 주제로서 '동물'을 선택 입력 받았으며, 획득한 영상 데이터 내에 제1 객체(10a) 및 제2 객체(10b)가 있다고 구 분하였고, 제1 객체(10a)가 4개의 책상 다리가 마련된 '책상'이고 제2 객체(10b)가 원형의 '의자'라고 감지하였 다는 것을 전제로, 서버는 맵 데이터를 생성할 시, 객체 변환 알고리즘은 서버 데이터 베이스 내에 기 학습된 데이터 중 상기 특정 주제인 '동물'과 관련된 데이터이면서, 4개의 책상 다리를 가지는 '책상'인 제1 객체(10a)가 사족보행을 하는 '강아지'와 유사한 형상과 구조를 가지며, 원형의 '의자'인 제2 객체(10b)가 전체 적으로 원형의 형상을 가지는 '곰'과 유사한 형상과 구조를 가진다고 판단함으로써, 제1 객체(10a)를 '강아지' 의 가상 객체로 변환하고, 제2 객체(10b)를 '곰'의 가상 객체로 변환할 수 있다. [가상 객체] 한편, 본 발명에서 말하는 가상 객체는 영상 데이터 내의 객체가 게임 화면 상에 출력되는 가상의 객체로 변환 것이다. 영상 데이터 내의 객체는 디지털 트윈 기술을 통하여 객체의 형상과 구조가 그대로 유지된 채로 가상의 객체로 변환되어 게임 화면 상에 출력될 수 있으며(예. 공(객체)→ 공(2차원 또는 3차원의 가상 객체)), 객체 변환 알 고리즘에 의하여 객체의 형상과 구조와 유사한 가상의 객체로 변환될 수 있다(예. 공(객체)→ 사과(가상 객 체)). 다른 한편, 게임 화면 상에 출력된 가상 객체는 서버에 의하여 물리 엔진이 적용되어 게임 상의 사용자(예. 아바타)가 가상 객체를 들어 올리거나, 만지거나 사용할 수 있도록 구현될 수 있으며, 더 나아가, 게임 상의 사용자가 물리엔진이 적용된 객체를 사용하면 소정의 이벤트 효과가 발생되도록 할 수 있다. 구체적 인 예로, 사용자가 특정 주제로서 전쟁 또는 슈팅을 선택하였고, 사용자 본인의 사무실에 대한 영상 데이터를 서버에 전송하였다는 것을 전제로, 서버는 '책상'을 '게임 상의 사용자가 피신할 수 있는 건물의 가 상 객체'로 변환하거나 '사무실 책상에 놓여진 볼펜'이 '총'의 가상 객체로 변환될 수 있으며, 게임 상의 사용 자가 총을 들어 방아쇠를 당기면, 총이 격발되고 탄착 지점에 위치한 타 사용자가 쓰러지는 이벤트가 발생되도 록 게임 서비스를 제공할 수 있다. 이상 본 발명의 제2 실시 예에 따른 무인 이동체의 전체 구성과 본 발명에서 자주 이용하는 용어에 대하여 살펴보았다. 다음으로, 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공방법을 구체적으로 살펴 보도록 한다. 도8은 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공방법을 구체적으로 나타낸 도 면이다. 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공방법은 먼저, 서버가 무인 이 동체로부터 특정 현실 공간에 대한 영상 데이터를 획득하는 단계(S101)에서 시작한다. S101 단계에서 획득한 영상 데이터에는 공간의 범위, 형상 또는 구조에 대한 정보를 포함할 뿐만 아니라 공간 내에 배치된 객체(예. 공간이 사무실이라면, 객체는 책상, 의자, 볼펜이 될 수 있음)에 대한 정보가 포함되어 있을 수 있다. 또한, S101 단계에서 설명하는 특정 현실 공간이란 무인 이동체가 영상을 촬영한 시점(P: 도4 참고)부터 영상 촬영이 종료된 시점(Q)까지의 촬영된 공간을 말할 수 있다. 이후에, 서버는 S101 단계에서 무인 이동체로부터 획득한 영상 데이터를 특정 현실 공간에 대한 맵 데이터를 생성한다(S102). S102 단계는 사용자 단말이 사무실, 개인 방, 복도 등의 현실 공간을 게임 맵을 설정하고자 할 때에 사용 자가 무인 이동체를 통하여 상기 현실 공간에 대한 영상 데이터를 서버에 전송하면, 서버가 상 기 현실 공간을 기반으로 게임 맵을 생성하는 단계이다. 참고로, S102 단계에서 말하는 맵 데이터는 특정 현실 공간이 가상의3차원 이미지 데이터로 변환된 데이터를 말 할 수 있으며, 다시 말해, 맵 데이터는 현실 공간을 기반으로 생성된 게임 맵 데이터라고도 말할 수 있다. 다음으로, 서버는 사용자 단말이 맵 데이터를 기반으로 게임을 즐길 수 있도록 S102 단계에서 생성한 맵 데이터를 사용자 단말에 전송한다(S103). 도9는 본 발명의 제2 실시 예에 따른 서버가 영상 데이터를 기반으로 특정 현실 공간에 대한 맵 데이터를 생성하는 단계(S102)를 구체적으로 나타낸 도면이다. 도9를 참고하면, S102 단계는 영상 데이터 내의 객체를 구분하는 단계(S102a), 구분한 객체를 객체 변환 알고리 즘을 활용하여 가상 객체로 변환하는 단계(S102b) 및 가상 객체를 기반으로 맵 데이터를 생성하는 단계(S102c) 를 포함할 수 있다. S102a 단계는 S101 단계에서 무인 이동체로부터 획득한 영상 데이터 내의 객체를 구분하는 단계로서, 영상 데이터가 사용자의 방에 대한 영상 데이터인 경우, S102a 단계는 서버가 사용자의 방에 대한 영상 데이터 내에는 침대, 책상, 의자 등의 객체를 감지하고 구분하는 단계라고 볼 수 있다. 한편, 앞서 설명한 바에 의하면, 무인 이동체가 영상 데이터를 획득하는 과정에서도 객체를 구분할 수 있 으며, 객체를 구분한 사실에 대한 데이터 리소스를 서버에 전송할 수 있는바, S102a 단계는 서버가 자체적으로 영상 데이터 내의 객체를 구분하지 않고, 무인 이동체가 영상 데이터 내의 객체를 구분한 데이 터를 확실한지 다시 한번 검증하는 단계로 실시 될 수 있다. S102b 단계는 서버가 객체 변환 알고리즘을 활용하여S102a 단계에서 구분된 객체를 상기 객체와 유사한 형 상과 구조를 가지는 가상의 객체로 변환하는 단계이다. S102b 단계에서의 객체 변환 알고리즘은 사용자의 선택에 의하여 실시되지 않을 수 있다. 구체적으로, 사용자가 게임 맵으로 활용하고 싶은 특정 현실 공간을 그대로 반영한 게임 맵을 이용하고 싶을 때에는 서버가 객체 변환 알고리즘을 사용하지 않고 특성 현실 공간에 포함된 객체를 상기 객체의 형상과 구조가 그대로 반영된 디 지털 트윈의 가상 객체로 변환할 수 있다. S102c 단계는 S102b 단계에서 생성된 가상 객체를 기반으로 게임 맵인 맵 데이터를 생성하는 단계이며, 생성된 맵 데이터는 서버에 의하여 사용자 단말에 전송된다. 사용자 단말에 전송된 맵 데이터는 게임 서비스 내의 게임 맵으로서 활용될 수 있다. 이상 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공방법을 구체적으로 살펴보았다. 다음으로 본 발명의 제3 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공방법을 살펴보도록 한다. 중복 서술을 방지하기 위해 자세히 설명하지는 않았지만, 본 발명의 제1 실시 예에 따른 현실 공간 기반의 가상 현실 게임 서비스를 제공하는 서버와 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비 스 제공방법은 동일한 기술적 특징을 포함하는 본 발명의 제3 실시 예에 따른 매체에 저장된 컴퓨터 프로그램으 로 구현할 수 있다. 이 경우 매체에 저장된 컴퓨터 프로그램은 컴퓨팅 장치와 결합하여, (AA) 무인 이동체로부 터 특정 현실 공간에 대한 영상 데이터를 획득하는 단계, (BB) 상기 획득한 영상 데이터를 기반으로 상기 특정 현실 공간에 대한 맵 데이터를 생성하는 단계 및 (CC) 상기 생성한 맵 데이터를 사용자 단말에 전송하는 단계를 실행하되, 중복 서술을 방지하기 위해 자세한 설명은 생략하지만 본 발명의 제1 실시 예에 따른 현실 공간 기반 의 가상현실 게임 서비스를 제공하는 서버와 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게 임 서비스 제공방법과 동일한 효과를 도출할 수 있을 것이다. 이상 첨부된 도면을 참조하여 본 발명의 실시 예들을 설명하였지만, 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0024569", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 발명의 제1 실시 예에 현실 공간 기반의 가상현실 게임 서비스를 제공하는 서버가 포함하는 전체 구 성을 나타낸 도면이다. 도2는 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공방법을 개념적으로 이해하기 위하여 나타낸 도면이다. 도3은 본 발명의 제2 실시 예에 따른 무인 이동체의 전체 구성을 모식도로 나타낸 도면이다.도4는 본 발명의 제2 실시 예에 따른 무인 이동체가 특정 현실 공간에 대한 영상 데이터를 획득하는 모습을 나 타낸 도면이다. 도5는 본 발명의 제2 실시 예에 따른 서버가 획득한 영상 데이터를 기반으로 불완전 특정 현실 공간 또는 불완 전 객체를 추정하는 과정을 간단한 모식도로 나타낸 도면이다. 도6은 본 발명의 제2 실시 예에 따른 서버가 객체 변환 알고리즘을 통하여 획득한 영상 데이터 내의 객체를 가 상 객체로 변환하는 과정을 나타낸 도면이다. 도7은 본 발명의 제2 실시 예에 따른 서버가 객체 변환 알고리즘을 통하여 획득한 영상 데이터 내의 객체를 가 상 객체로 변환하는 또 다른 과정을 나타낸 도면이다. 도8은 본 발명의 제2 실시 예에 따른 현실 공간 기반의 가상현실 게임 서비스 제공방법을 구체적으로 나타낸 도 면이다. 도9는 본 발명의 제2 실시 예에 따른 서버가 영상 데이터를 기반으로 특정 현실 공간에 대한 맵 데이터를 생성하는 단계(S102)를 구체적으로 나타낸 도면이다."}
