{"patent_id": "10-2021-0060568", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0153248", "출원번호": "10-2021-0060568", "발명의 명칭": "인공지능 기술기반 실시간 미세 혈류 분석 방법", "출원인": "부산대학교 산학협력단", "발명자": "손경모"}}
{"patent_id": "10-2021-0060568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "근적외선 카메라에 의하여, 임의의 환자를 대상으로 인도시아닌 그린(Indocyanin green, ICG)이 주입된 조직이촬영된 ICG 영상이 실시간으로 획득되는 ICG 영상 획득단계;프로세서에 의하여, 상기 ICG 영상이 전처리되는 ICG 영상 전처리단계;상기 프로세서에 의하여, 전처리된 상기 ICG 영상으로부터 시간에 따른 ICG 형광밝기의 변화를 표시한 ICG 패턴이 인식되는 ICG 패턴 인식단계; 상기 프로세서에 의하여, 인공지능 기술기반으로 ICG 학습영상을 포함하는 데이터 셋이 이용되어 분석모델이 생성되는 분석모델 생성단계; 및상기 프로세서에 의하여, 상기 분석모델을 이용하여 상기 ICG 패턴으로부터 위험도를 포함하는 분석결과가 출력되는 분석결과 출력단계;를 포함하는 인공지능 기술기반 실시간 미세 혈류 분석 방법."}
{"patent_id": "10-2021-0060568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 ICG 영상 전처리단계는, 상기 ICG 영상으로부터 색상(H), 채도(S), 명도(V)가 추출되는 HSV 추출단계; 상기 ICG 영상의 색상(H), 채도(S)가 각 기준치와 비교되는 비교단계;상기 ICG 영상의 색상(H)과 색상 기준치의 차의 절대값과 상기 근적외선 영상의 채도(S)와 태도 기준치의 차의절대값 중 적어도 하나가 1과 같거나 1에 오차범위 이내로 근접하면 새로운 명도(V’)가 산출되는 명도 산출단계; 및 상기 새로운 명도(V’)와 상기 ICG 영상의 색상(H), 채도(S)를 이용하여 상기 ICG 영상의 노이즈가 제거되는 노이즈 제거단계;를 포함하는 인공지능 기술기반 실시간 미세 혈류 분석 방법."}
{"patent_id": "10-2021-0060568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 ICG 패턴 인식단계는,상기 ICG 영상의 지연시간(Latency) 이후에 ICG 형광발현시점이 추정되는 ICG 형광발현시점 추정단계;를 포함하는 것을 특징으로 하는 인공지능 기술기반 실시간 미세 혈류 분석 방법."}
{"patent_id": "10-2021-0060568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서, 상기 ICG 패턴 인식단계는,상기 ICG 형광발현시점으로부터 기 설정된 시간동안 상기 ICG 영상에서 문합부 주변의 확인하고자 하는 조직의일부가 하나 이상의 관심영역(Region of Interest; ROI)으로 설정되는 관심영역 설정단계;를 더 포함하는 것을특징으로 하는 인공지능 기술기반 실시간 미세 혈류 분석 방법."}
{"patent_id": "10-2021-0060568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서, 상기 분석결과 출력단계는,공개특허 10-2022-0153248-3-상기 관심영역 설정단계로부터 설정된 관심영역(ROI)별로 시간에 따른 상기 위험도가 컬러 맵으로 표시되는 것을 특징으로 하는 인공지능 기술기반 실시간 미세 혈류 분석 방법."}
{"patent_id": "10-2021-0060568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서, 상기 분석모델 생성단계는,상기 ICG 학습영상이 전처리되는 ICG 학습영상 전처리단계;전처리된 상기 ICG 학습영상으로부터 ICG 학습패턴이 인식되는 ICG 학습패턴 인식단계;유사성에 기반하여 ICG 학습패턴이 클러스터링(Clustering)된 후 ICG 학습패턴집합이 생성되는 ICG 학습패턴집합 생성단계;상기 ICG 학습패턴집합이 정상상태, 양호상태 및 위험상태 중 하나로 라벨링(Labeling)되는 라벨링 단계;라벨링된 상기 ICG 학습패턴집합을 학습시킨 후 예비분석모델이 생성되고, 상기 예비분석모델이 이용되어 ICG테스트영상이 분석되는 ICG 테스트영상 분석단계; 및ICG 테스트영상에 대한 분석결과에 기초하여 상기 예비분석모델의 정확도가 기 설정된 정확도 이상일 경우 상기예비분석모델이 상기 분석모델로 결정되는 분석모델 결정단계;를 포함하고,상기 분석모델 결정단계는, 상기 예비분석모델이 기 설정된 정확도 미만일 경우 상기 ICG 테스트 영상 분석단계로 회귀되는 것을 특징으로 하는 인공지능 기술기반 실시간 미세 혈류 분석 방법."}
{"patent_id": "10-2021-0060568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서, 상기 ICG 학습패턴집합 생성단계는,임의의 상기 ICG 학습패턴집합 내 포함되는 ICG 학습패턴에 대한 분산값이 산출되고, 상기 분산값이 기 설정된 분산값 범위이내이면 상기 ICG 학습패턴의 클러스터링(Clustering) 정확도가 높은 것으로 판단되는 것을 특징으로 하는 인공지능 기술기반 실시간 미세 혈류 분석 방법."}
{"patent_id": "10-2021-0060568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서, 상기 라벨링 단계는, 임의의 ICG 학습패턴집합에 포함된 ICG 학습패턴의 수에 대한 문합부 합병증을 진단받은 환자의 ICG 학습패턴중에서 해당 ICG 학습패턴집합에 포함된 ICG 학습패턴과 유사한 ICG 학습패턴의 수의 비율에 따라서 임의의 ICG학습패턴집합이 정상상태, 양호상태 및 위험상태 중 하나로 분류되는 것을 특징으로 하는 인공지능 기술기반 실시간 미세 혈류 분석 방법."}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기술기반 실시간 미세 혈류 분석 방법에 관한 것으로, 보다 구체적으로 근적외선 카메라에 의하여, 임의의 환자를 대상으로 인도시아닌 그린(Indocyanin green, ICG)이 주입된 조직이 촬영된 ICG 영상이 실시간으로 획득되는 ICG 영상 획득단계, 프로세서에 의하여, 상기 ICG 영상이 전처리되는 ICG 영상 전처리단계, 프로세서에 의하여, 전처리된 상기 ICG 영상으로부터 시간에 따른 ICG 형광밝기의 변화를 표시한 ICG 패턴이 인 식되는 ICG 패턴 인식단계, 프로세서에 의하여, 인공지능 기술기반으로 ICG 학습영상을 포함하는 데이터 셋이 이 용되어 분석모델이 생성되는 분석모델 생성단계 및 프로세서에 의하여, 상기 분석모델을 이용하여 상기 ICG 패턴 으로부터 위험도를 포함하는 분석결과가 출력되는 분석결과 출력단계를 포함하는 인공지능 기술기반 실시간 미세 혈류 분석 방법에 관한 것이다."}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기술기반 실시간 미세 혈류 분석 방법에 관한 것으로, 보다 구체적으로 인공지능 기술기반 으로 인도시아닌 그린(Indocyanine Green; ICG)을 이용한 혈관 조영술 영상이 분석된 후 실시간 미세 혈류 상태 가 확인되는 인공지능 기술기반 실시간 미세 혈류 분석 방법에 관한 것이다."}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "대장·직장암 수술 시 문합 부위의 관류 불량으로 문합부 합병증이 발생할 수 있다. 문합부 합병증 중에서 급성 저관류는 문합 누출 혹은 괴사로 이어질 수 있고 심하면 패혈증이나 다발성 장기부전으로 인해 사망에 이를 수 있다. 문합부 합병증은 인도시아닌 그린(Indocyanine Green; ICG)을 이용한 혈관 조영술로 미세혈류를 분석하여 합병 증 여부를 예측하였다. 다만, 현재까지는 충분한 경험을 가진 외과의사의 육안을 통한 주관적인 평가로 이루어 지거나 몇몇의 정량적 매개변수를 이용하여 분석한다. 관련문헌 1은 ICG 형광 동역학 분석을 이용한 뇌혈류 분석 장치 및 방법에 관한 것으로, 이미지 센서의 전기적 신호를 입력받아 뇌표면에서 관측되는 형광신호의 동역학을 분석하고 뇌혈류를 측정하여 혈류 지도를 생성할 수 있다. 관련문헌 2는 인도시아닌 그린 혈중 농도 역학을 이용한 조직 관류 분석장치 및 그를 이용한 조직 관류 분석방법에 관한 것으로, ICG 형광의 세기에 따라 해당 조직이 정상인지 허혈인지를 분석할 수 있으나, 다만, 관련문헌 1 내지 2는 환자의 복잡한 혈관구조 및 환경적 요인에 의하여 발생된 인도시아닌 그린(ICG)의 다양한 근적외선 형광패턴을 세밀하게 구분하지 못하는 한계가 있다. 또한, 정량적 매개변수를 이용한 분석방법 은 상당한 시간이 소요되어 수술 중 실시간 미세 혈류 분석이 어려워 실제 임상적용에는 한계가 있다. 따라서 수술 중 인도시아닌 그린(ICG)을 이용한 혈관 조영술 영상을 분석하여 문합부의 미세 혈류 상태를 실시 간으로 확인할 수 있는 방안이 요구되고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-1166165 (특허문헌 0002) KR 10-0867977"}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로 미세 혈류 상태를 분석한 분석결과의 정확성과 일관성을 향상시키고, 수술 중 문합하고자 하는 조직의 미세 혈류 상태를 실시간으로 파악하여 의료진의 판단을 보조할 수 있도록 인공지능 기술기반으로 문합부 합병증으로 진단된 환자의 ICG 학습영상을 포함하는 데이터 셋이 이용 되어 분석모델이 생성된 후 상기 ICG 패턴으로부터 위험도를 포함하는 분석결과가 출력되는 인공지능 기술기반 실시간 미세 혈류 분석 방법을 얻고자 하는 것을 목적으로 한다."}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 인공지능 기술기반 실시간 미세 혈류 분석 방법은 근적외선 카메라에 의하여, 임의의 환자를 대상으로 인도시아닌 그린(Indocyanin green, ICG)이 주입된 조직이 촬영된 ICG 영상이 실시간으로 획득되는 ICG 영상 획득단계; 프로세서에 의하여, 상기 ICG 영상이 전처리되는 ICG 영상 전처리단계; 프로세서에 의하여, 전처리된 상기 ICG 영상으로부터 시간에 따른 ICG 형광밝기의 변화를 표시한 ICG 패턴이 인식되는 ICG 패턴 인식단계; 프로세서에 의하여, 인공지능 기술기반으로 ICG 학습영상을 포함하는 데이터 셋이 이용되어 분석모델이 생성되는 분석모델 생성단계; 및 프로세서에 의하여, 상기 분석모델을 이용하 여 상기 ICG 패턴으로부터 위험도를 포함하는 분석결과가 출력되는 분석결과 출력단계;를 제공한다."}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본 발명에 의하면 인공지능 기술기반으로 문합부 합병증으로 진단된 환자의 ICG 학습영상을 포함하 는 데이터 셋이 이용되어 분석모델이 생성된 후 상기 ICG 패턴으로부터 위험도를 포함하는 분석결과가 출력되도 록 구비함으로써, 미세 혈류 상태를 분석한 분석결과의 정확성과 일관성을 향상시킬 수 있는 효과가 있다. 또한, 본 발명은 수술 중 문합하고자 하는 조직의 미세 혈류 상태를 실시간으로 파악할 수 있고, 의료진의 판단 을 보조할 수 있어 문합부 합병증의 발병률이 낮아지는 효과가 있다."}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들 을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 다르게 정의되지 않는 한 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반 적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 인공지능 기술기반 실시간 미세 혈류 분석 방법에 관한 것이다. 도 2는 본 발명의 ICG 영상 전처리단계(S200)에 대한 세 부흐름도이다. 도 3은 본 발명의 분석모델 생성단계(S400)에 대한 세부흐름도이다. 한편, 본 발명의 인공지능 기술기반 실시간 미세 혈류 분석 방법은 근적외선 카메라 및 프로세서에 의하여 구현될 수 있다. 상기 근적외선 카메라는 가시광선보다 긴 파장의 광선으로 사람의 눈 또는 일반적 인 카메라로 촬영할 수 없는 광선을 촬영할 수 있으므로, ICG 형광 발현 시 암록색의 색소가 촬영될 수 있다. 그리고 상기 근적외선 카메라는 내시경 카메라로 구현일 수 있고 대장과 5cm 내지 15cm에 위치하여 인도시 아닌 그린(ICG)이 주입된 부위를 소정 시간동안 촬영할 수 있다. 그리고 상기 프로세서는 가장 바람직하게 시뮬레이터일 수 있고, 상기 근적외선 카메라와 유선으로 연결되어 실시간으로 상기 ICG 영상을 촬영을 획 득할 수 있다. 그리고 본원발명의 알고리즘이 프로그램에 구현되어 저장될 수 있다. 도 1을 보면, 본 발명의 인공지능 기술기반 실시간 미세 혈류 분석 방법은 ICG 영상 획득단계(S100), ICG 영상 전처리단계(S200), ICG 패턴 인식단계(S300), 분석모델 생성단계(S400) 및 분석결과 출력단계(S500)를 포함한다. 보다 구체적으로, 상기 ICG 영상 획득단계(S100)는 근적외선 카메라에 의하여, 임의의 환자를 대상으로 인 도시아닌 그린(Indocyanin green, ICG)이 주입된 조직이 촬영된 ICG 영상이 실시간으로 획득된다. 일반적으로 ICG 형광 조영술이 수행되기 위하여, 조영제인 인도시아닌 그린(ICG)은 증류수에 희석되고 수 mg의 최소용량이 정맥의 말초혈관에 천천히 주입될 수 있다. 그리고 정맥 내 인도시아닌 그린(ICG)은 혈관 내 글로불 린 또는 알부민에 결합되어 혈관에 남게 되고, 혈류가 시각적으로 확인될 수 있도록 하는 매개체 역할을 할 수 있다. 여기서, 조영제인 인도시아닌 그린(ICG)은 암록색의 색소로서, 부작용이 거의 없어 형광 발현을 확인하기 위해 외과적 수술에 용이하게 사용될 수 있다. 즉, 상기 ICG 영상 획득단계(S100)는 근적외선 카메라를 통해서 인도시아닌 그린(ICG)이 발현하는 형광이 촬영된 상기 ICG 영상이 획득될 수 있다. 다음으로, 상기 ICG 영상 전처리단계(S200)는 프로세서에 의하여, 상기 ICG 영상이 전처리된다. 이는, 상 기 ICG 영상은 상기 근적외선 카메라를 통해서 문합부 주위의 확인하고자 하는 조직만이 촬영되는 것이 아 닌 주변 환경의 영향으로 배경 잡음 및 형광등 등의 광원 반사도 함께 촬영될 수 있기 때문에 상기 ICG 영상 전 처리단계(S200)는 필수적인 과정이다. 먼저, 상기 ICG 영상 전처리단계(S200)는 색상(H), 채도(S), 명도(V)를 기반으로 한 색공간변환을 통해서 ICG 형광 추출이 수행되어 배경 및 광원반사와 같은 요소가 제거될 수 있다. 가장 바람직하게 하기 [수학식 1]로 상 기 ICG 영상 전처리단계(S200)가 표현될 수 있고, 색상 채널별 다른 임계값이 적용될 수 있고, 최종적으로 ICG 형광만이 추출될 수 있다. 수학식 1"}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, I(n,m,k)는 전처리된 상기 ICG 영상이고, n과 m은 촬영 해상도 N×M에 따라 0<n<N, 0<m<M 범위이내의 상기 ICG 영상의 해상도이고, k는 촬영 프레임 레이트(Rf)에 따라 0<k<Rf 범위이내의 상기 ICG 영상의 프레임 레 이트이고, ir, ig, ib는 각각 상기 ICG 영상의 빨강, 초록, 파랑 채널이다. 보다 구체적으로, 상기 ICG 영상 전처리단계(S200)는 매트랩(Matlab) 프로그램을 기반으로 하고, 하기 [수학식 2]로 가우시안 블러(Gaussian blur) 연산을 상기 ICG 영상에 적용하여 상기 ICG 성분만이 추출될 수 있다. 수학식 2"}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, I는 상기 상기 ICG 영상 획득단계(S100)로부터 획득된 상기 ICG 영상이고, 는 표준편차 을 가지는 가우시안 마스크(Gaussian mask)이고, 는 가우시안 블러(Gaussian blur)가 적용된 상기 ICG 영상이다. 기호 ‘*’는 회선연산자(Convolution Operator)로, 연산의 한 방법이다. 일반적으로 가우시안 블러(Gaussian blur)는 가우시안 마스크(Gaussian mask)를 사용하는 영상필터의 한 종류로, 이미지의 저주파수 부분은 유지하고, 고주파수 부분은 모두 사라지게 함으로써, 이미지에서 사물과 사 물 사이의 경계와 같은 고주파수 부분이 흐릿하게 처리되도록 한다. 그리고 가우시안 블러(Gaussian blur)는 표 준편차를 조절하여 흐릿한 정도를 조절할 수 있다. 따라서 상기 ICG 영상 전처리단계(S200)는 상기 근적외선 영상에 가우시안 블러(Gaussian blur)를 이용하여 고 주파수 부분을 흐릿하게 처리되도록 하여 상기 ICG 영상으로부터 상기 ICG 성분만을 추출할 수 있다. 또한 도 2를 보면, 상기 ICG 영상 전처리단계(S200)는 상기 ICG 영상으로부터 색상(H), 채도(S), 명도(V)가 추 출되는 HSV 추출단계(S210), 상기 ICG 영상의 색상(H), 채도(S)가 각 기준치와 비교되는 비교단계(S220), 상기 ICG 영상의 색상(H)과 기준치의 차의 절대값과 상기 근적외선 영상의 채도(S)와 기준치의 차의 절대값이 1과 같 거나 1에 오차범위 이내로 근접하면 새로운 명도(V’)가 산출되는 명도 산출단계(S230) 및 상기 새로운 명도(V ’)와 상기 ICG 영상의 색상(H), 채도(S)를 이용하여 상기 ICG 영상의 노이즈가 제거되는 노이즈 제거단계 (S240)를 포함할 수 있다. 이에 따라, 상기 ICG 영상 전처리단계(S200)는 추출된 ICG 성분이 보다 선명하게 상기 ICG 영상으로부터 확인될 수 있도록 추가적으로 노이즈가 제거되도록 할 수 있다. 보다 구체적으로, 상기 HSV 추출단계(S210)는 상기 프로세서에 의하여, 상기 ICG 영상으로부터 색상(H), 채도(S), 명도(V)가 추출될 수 있다. 상기 ICG 영상은 RGB 기반이므로 HSV 기반으로 변환되어 색상(H), 채도 (S), 명도(V)가 추출될 수 있다. 추출된 색상(H)은 IH, 추출된 채도(S)는 IS, 추출된 명도(V)는 IV로 표시될 수 있다. 다음으로, 상기 비교단계(S220)는 상기 프로세서에 의하여, 상기 HSV 추출단계(S210)로부터 추출된 색상 (IH)과 채도(IS)가 각 기준치와 비교될 수 있다. 상기 색상 기준치는 href, 상기 채도 기준치는 sref로 표시될 수있고, 이는 상기 프로세서에 기 설정된 값일 수 있다. 그리고 상기 비교단계(S220)는 상기 ICG 영상으로부 터 추출된 색상(IH)과 색상 기준치(href)의 차의 절대값과 상기 ICG 영상으로부터 추출된 채도(IS)와 채도 기준치 (sref)의 차의 절대값이 각각 비교될 수 있다. 여기서, 상기 비교단계(S220)는 상기 ICG 영상으로부터 추출된 색상(IH)과 색상 기준치(href)의 차의 절대값이 0 과 같거나 0에 근접하면 ICG 영상으로부터 추출된 색상(IH)이 색상 기준치(href)와 유사한 것으로 판단될 수 있 고, 1과 같거나 1에 근접하면 상기 ICG 영상으로부터 추출된 색상(IH)이 색상 기준치(href)와 상이한 것으로 판 단될 수 있다. 이와 같이, 상기 비교단계(S220)는 상기 ICG 영상으로부터 추출된 채도(IS)와 채도 기준치(sref)의 차의 절대값 이 0과 같거나 0에 근접하면 ICG 영상으로부터 추출된 채도(IS)가 채도 기준치(sref)와 유사한 것이고, 1과 같거 나 1에 근접하면 상기 ICG 영상으로부터 추출된 채도(IS)가 채도 기준치(sref)와 상이한 것이다. 반면에, 상기 비교단계(S220)는 상기 ICG 영상의 색상(H)과 색상 기준치의 차의 절대값과 상기 ICG 영상의 채도 (S)와 채도 기준치의 차의 절대값이 모두 0과 같거나 0에 근접하면 상기 ICG 영상 획득단계(S100)로부터 상기 ICG 영상이 그대로 출력될 수 있다. 즉, 상기 비교단계(S220)는 각각의 절대값이 0과 같거나 0에 근접하면 기준 치와 유사하다고 판단됨으로 ICG 성분이 추출된 상기 ICG 영상에서 추가적으로 노이즈가 제거될 필요가 없고, 이에 따라 상기 명도 산출단계(S230)와 상기 노이즈 제거단계(S240)를 거치지 않을 수 있다. 다음으로, 상기 명도 산출단계(S230)는 상기 ICG 영상의 색상과 색상 기준치의 차의 절대값과 상기 ICG 영상의 채도와 채도 기준치의 차의 절대값 중 적어도 하나가 1과 같거나 1에 근접하면 새로운 명도(V’)가 산출될 수 있다. 상기 새로운 명도(V’)가 로 표시되고, 하기 [수학식 3]으로 산출될 수 있다. 수학식 3"}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, 는 상기 ICG 영상으로부터 추출된 색상(IH)과 색상 기준치(href)의 차의 절대값이고, 상기 는 상기 ICG 영상으로부터 추출된 채도(IS)와 채도 기준치(sref)의 차의 절대값이다. 다음으로, 상기 노이즈 제거단계(S240)는 상기 새로운 명도(V’)와 상기 ICG 영상의 색상(H), 채도(S)를 이용하 여 상기 ICG 영상의 노이즈가 제거될 수 있다. 즉, 상기 노이즈 제거단계(S240)는 상기 HSV 추출단계(S210)에서 RGB 기반의 영상이 HSV 기반으로 변환된 것과는 반대로, 상기 명도 산출단계(S230)로부터 산출된 새로운 명도 와 상기 ICG 영상의 색상(IH), 채도(IS)를 이용하여 다시 RGB 기반의 영상으로 변환될 수 있다. 따라서 상기 노이즈 제거단계(S240)로부터 노이즈가 제거되어 추출된 ICG 성분이 보다 선명하게 확인될 수 있는 ICG 영상이 최종적으로 도출될 수 있다. 다음으로, 상기 ICG 패턴 인식단계(S300)는 프로세서에 의하여, 전처리된 상기 ICG 영상으로부터 시간(T) 에 따른 ICG 형광밝기(I)의 변화를 표시한 ICG 패턴이 인식된다. 일반적으로 혈액 순환이 원활하지 않으면 ICG 형광밝기(I)가 어둡고, 혈액 순환이 원활하면 ICG 형광밝기(I)가 밝다. 그러나 ICG 형광밝기(I)는 조직 두께, 근적외선 카메라와 조직 간의 촬영거리, 근적외선 조명의 종 류 등 많은 요인에 의해 영향을 받을 수 있으므로 ICG 형광밝기(I)만이 이용되어 혈액 순환의 정량적 평가가 어 렵다. 이러한 문제점을 해결하기 위해서 본원발명은 상기 ICG 패턴 인식단계(S300)로부터 시간(T)에 따른 ICG 형광밝기(I)의 변화가 표시된 ICG 패턴이 인식될 수 있다. 여기서, 상기 ICG 영상이 2분 내지 3분과 같이 일정길이를 가진다면 인도시아닌 그린(ICG)이 주입된 후 확인하 고자 하는 조직에 도달하여 ICG 성분 또는 ICG 형광이 발현되기까지 지연시간(Latency)이 존재할 수 있다. 즉, 상기 ICG 패턴 인식단계(S300)는 상기 프로세서에 의하여, 상기 지연시간(Latency) 이후에 ICG 형광이 발 현되는 시점인 ICG 형광발현시점이 추정되는 ICG 형광발현시점 추정단계(S310)를 포함할 수 있다.다시 말하면, 지연시간(Latency) 동안 얻은 ICG 형광밝기(I)의 변화는 의미가 없는 값이고, 지연시간(Latency) 이후 상기 ICG 성분이 확인하고자 하는 조직에 도달하여 상기 ICG 형광발현시점으로부터 ICG 형광밝기(I)의 변 화가 미세혈류를 분석하는데 핵심적인 요소가 될 수 있다. 보다 구체적으로, 우선 상기 ICG 형광발현시점 추정단계(S310)는 상기 ICG 영상의 배경밝기(IB)가 추정될 수 있 도록 하기 [수학식 4]가 이용되어 상기 ICG 영상의 시작시점으로부터 수초 간 ICG 형광밝기(I)의 변화에 대한 평균값이 산출될 수 있다. 수학식 4"}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, n과 m은 촬영 해상도 N×M에 따라 0<n<N, 0<m<M 범위이내의 상기 ICG 영상의 해상도이고, k는 촬영 프 레임 비율(Rf)에 따라 0<k<Rf 범위이내의 상기 ICG 영상의 프레임 비율이고, fg(k)는 촬영 프레임 비율(Rf)에 따 른 ICG 형광밝기(I)의 변화를 표시한 ICG 패턴이다. 즉, 상기 지연시간(Latency) 동안 얻은 형광밝기(I)의 변화는 의미가 없는 값이므로 상기 ICG 영상의 배경밝기 (IB)가 추정되는데 사용될 수 있고, 이에 따라 상기 ICG 형광밝기(I)의 변화에 대한 평균값을 구하는 구간은 상 기 지연시간(Latency)에 포함될 수 있다. 임상적으로, 상기 지연시간(Latency)은 상기 ICG 패턴의 시작시점으로부터 35초 내지 45초 범위 이내일 수 있고, 가장 바람직하게 40초일 수 있다. 따라서 가장 바람직하게, 상기 ICG 형광발현시점 추정단계(S310)는 상 기 ICG 영상의 배경밝기(IB)가 추정될 수 있도록 상기 ICG 영상의 시작시점으로부터 5초 내지 15초간의 ICG 형 광밝기(I)의 변화에 대한 평균값이 산출될 수 있다. 또한, 상기 ICG 형광발현시점 추정단계(S310)는 하기 [수학식 5]에 상기 [수학식 4]로부터 산출된 평균값이 입 력되어 제1 문턱값이 산출될 수 있고, 상기 제1 문턱값이 기준이 되어 상기 평균값이 이진화될 수 있다. 수학식 5"}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "그리고 상기 ICG 형광발현시점 추정단계(S310)는 노이즈 제거 및 명확한 구간설정이 가능하도록 엣지 검출 마스 크(Me)와 이진수인 fb(k)의 상호상관(Cross-Correlation)을 통하여 상기 ICG 형광발현시점(kl)이 산출될 수 있다. 이는, 하기 [수학식 6]과 같다. 수학식 6"}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서, 상기 엣지 검출 마스크(Me)의 총 길이(l)일 수 있고 -1이 l/2개, 1이 l/2개로 구성될 수 있다. 상기 ICG 형광발현시점 추정단계(S310)는 상기 [수학식 6]을 통해 fb(k)에서 연속적인 0에서 연속적인 1의 값 으로 변화하는 구간의 위치를 찾을 수 있고, 상기 ICG 형광발현시점이 최종적으로 추정될 수 있다. 또한, 상기 ICG 패턴 인식단계(S300)는 상기 프로세서에 의하여, 문합부 주변의 확인하고자 하는 조직의 일부가 하나 이상의 관심영역(Region of Interest; ROI)으로 설정되는 관심영역 설정단계(S320)를 더 포함할 수 있다. 이는, 앞서 언급했듯이 상기 ICG 영상은 배경 등 문합부 주변의 확인하고자 하는 조직 이외의 것이 함께 촬영되 게 되는데, 이는 무의미한 연산량을 늘려 분석속도를 느리게 하는 원인이 되므로 실시간 분석을 실현하는데 어 려울 수 있다. 따라서 문합부 주변의 확인하고자 하는 조직의 일부가 하나 이상의 관심영역(Region of Interest; ROI)으로 설정되는 것이 상당히 중요하다. 이때, 상기 관심영역(ROI)의 크기는 상기 ICG 영상의 품질에 따라 결정될 수 있다. 만약, 상기 ICG 영상이 상기 근적외선 카메라에 의하여 흔들리고 어둡게 촬영되면 임의의 관심영역(ROI)은 픽셀단위를 기준으로 크기가 커질 수 있다. 반면에 상기 근적외선 카메라에 의하여 밝게 촬영되면 임의의 관심영역(ROI)은 픽셀단위를 기준으로 크기가 작아질 수 있다. 보다 구체적으로, 상기 관심영역 설정단계(S320)는 상기 ICG 형광발현시점 추정단계(S310)로부터 추정된 상기 ICG 형광발현시점으로부터 기 설정된 시간동안의 상기 ICG 영상을 대상으로 상기 ICG 영상에 촬영된 위치별 시 간(T)에 따른 밝기변화량(Idiff(n,m))인 ICG 로컬패턴이 산출될 수 있다. 이는, 하기 [수학식 7]로 산출될 수 있 다. 수학식 7"}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "여기서, n과 m은 촬영 해상도 N×M에 따라 0<n<N, 0<m<M 범위이내의 상기 ICG 영상의 해상도이고, k는 촬영 프 레임 비율(Rf)에 따라 0<k<Rf 범위이내의 상기 ICG 영상의 프레임 비율이고, Is는 임의의 위치에서의 형광밝기이 다. 그리고 상기 관심영역 설정단계(S320)는 시간(T)에 따른 밝기변화량(Idiff(n,m))의 최대값의 10%가 제2 문턱값으 로 설정될 수 있고, 상기 위치별 시간(T)에 따른 밝기변화량(Idiff(n,m))이 상기 제2 문턱값보다 크거나 같은 위 치가 상기 관심영역(ROI)으로 최종적으로 설정될 수 있다. 그리고 설정된 관심영역(ROI)으로부터 상기 ICG 로컬 패턴이 획득될 수 있다. 도 4는 본 발명의 일실시예에 따른 관심영역(ROI)별 ICG 로컬패턴을 표시한 도면이다. 도 4를 보면, 가장 바람 직하게 상기 ICG 패턴 인식단계(S300)는 상기 관심영역 설정단계(S320)로부터 추출된 다수 개의 관심영역(ROI) 에 대한 ICG 로컬패턴이 각각 인식될 수 있다. 또한, ICG 패턴 인식단계(S300)는 상기 ICG 로컬패턴으로부터 정량적 파라미터가 추출될 수 있고, 이는 차후 상 기 분석결과 출력단계(S500)로부터 상기 분석모델에 기 학습된 ICG 학습패턴과 상기 ICG 로컬패턴의 유사성이 판단되는데 상기 정량적 파라미터가 사용될 수 있다. 상기 정량적 파라미터는 Tmax, T1/2max, Fmax, 시간비율(Time Ratio; TR), 상승경사도(Rising slope; RS)가 포함될 수 있다. Tmax는 임의의 관심영역(ROI)으로부터 인식된 ICG 로컬패턴에서의 최대변화량(Fmax)이 발현되는 구간이 고, T1/2max는 최대변화량(Fmax)이 발현되는 구간의 1/2되는 구간이고, 최대변화량(Fmax)은 최대 형광밝기(Imax)에서 최소형광밝기(Imin)를 차한 값이고, 시간비율(TR)은 Tmax에 대한 T1/2max 비율을 표시한 값이고, 상승경사도(RS)는 Tmax에 대한 Fmax 비율을 표시한 값이다. 여기서, 종래와 같이 상기 정량적 파라미터만으로 미세 혈류의 상태가 분석된다면 상기 근적외선 카메라의 흔들림 및 떨림, 노이즈 등이 복합적으로 작용됨으로써 발생될 수 있는 상기 ICG 로컬패턴의 오차에 대응하지 못하는 단점이 있고 이 따라 분석결과의 오류율 역시 높을 수 있다. 도 5는 본 발명의 일실시예에 따른 본원발명에 따른 분석결과(a)와 종래 파라미터에 따른 분석결과(b, c, d)를 표시한 도면이다. 도 5를 보면, 본원발명의 인공지능 기술기반으로 생성된 분석결과(a)는 종래 파라미터에 따른 분석결과(b, c, d)에서 정상상태로 분석된 부분을 보다 세밀하게 분석하여 종래 파라미터에 따른 분석결과(b, c, d)에서 정상상태만으로 분석된 부분이 정상상태와 양호상태로 구별될 수 있고, 정상상태 또는 양호상태라고 분석된 부분이 위험상태인 부분으로 분석되는 것을 확인할 수 있다. 따라서 본원발명은 보다 정확도가 향상된 분석결과를 제공할 수 있는 현저한 효과가 있다. 다음으로, 상기 분석모델 생성단계(S400)는 프로세서에 의하여, 인공지능 기술기반으로 ICG 학습영상을 포 함하는 데이터 셋이 이용되어 분석모델이 생성된다. 정확도가 높은 상기 분석모델이 생성되기 위해서, 상기 분석모델 생성단계(S400)는 ICG 학습영상 전처리단계 (S410), ICG 학습패턴 인식단계(S420), ICG 학습패턴집합 생성단계(S430), 라벨링 단계(S440), ICG 테스트영상 분석단계(S450) 및 분석모델 결정단계(S450)를 포함할 수 있다. 보다 구체적으로, 도 3을 보면 상기 ICG 학습영상 전처리단계(S410)는 상기 ICG 학습영상이 전처리될 수 있다. 상기 ICG 학습영상은 문합부 합병증으로 진단된 환자로부터 기 획득된 영상이거나 문합부 합병증으로 진단되지 않은 환자로부터 기 획득된 영상일 수 있다. 즉, 상기 ICG 영상 획득단계(S100)로부터 획득된 상기 임의의 환자 의 상기 ICG 영상은 결과값이 없는 데이터이고, 상기 ICG 학습영상은 결과값이 포함된 데이터이다. 그리고 상기 ICG 학습영상 전처리단계(S410)는 전처리되는 대상이 상이할 뿐 상기 ICG 영상 전처리단계(S200)와 동일하다. 다음으로, 상기 ICG 학습패턴 인식단계(S420)는 전처리된 상기 ICG 학습영상으로부터 ICG 학습패턴이 인식될 수 있다. 상기 ICG 학습패턴 인식단계(S420)는 대상이 상이할 뿐 상기 ICG 패턴 인식단계(S300)와 동일하다. 다음으로, 상기 ICG 학습패턴집합 생성단계(S430)는 유사성에 기반하여 ICG 학습패턴이 클러스터링(Clusterin g)된 후 ICG 학습패턴집합이 생성될 수 있다. 도 6은 본 발명의 일실시예에 따른 다수 개의 ICG 학습패턴이 클러스터링(Clustering)되는 것을 표시한 도면이 다. 도 6을 보면, 문합부 합병증을 진단받은 환자 NP명으로부터 상기 ICG 학습영상 NP개가 획득될 수 있고, 하나 의 ICG 학습영상으로부터 Nc개의 관심영역(ROI)에 대한 Nc개의 ICG 학습패턴이 생성될 수 있다. 여기서 상기 ICG 학습패턴은 상기 ICG 학습영상 전반에 대한 ICG 패턴이 아닌, 상기 ICG 학습영상 내 관심영역(ROI)에 대한 ICG 패턴으로 가장 바람직하게 상기 ICG 학습영상으로부터 인식된 ICG 로컬패턴일 수 있다. 그리고 상기 ICG 학습패턴 인식단계(S420)는 NP×Nc개의 ICG 학습패턴이 생성될 수 있는데, ICG 학습패턴의 수에 비해 ICG 학습패턴집합의 수가 상대적으로 적으므로 학습될 시 학습의 정확도가 낮아질 수 있고, 만약 이를 해 결하기 위해 신경망 층의 수를 늘리면 연산량이 기하급수적으로 많아져서 실시간 분석에 부적합할 수 있다. 이를 해결하기 위하여 본원발명은 상기 ICG 학습패턴집합 생성단계(S430)로부터 유사성에 기반하여 다수 개의 ICG 학습패턴이 클러스터링(Clustering)될 수 있다. 예컨대, 10000개의 ICG 학습패턴이 25개의 ICG 학습패턴집 합으로 클러스터링(Clustering)될 수 있다. 가장 바람직하게, 자가 조직 지도(Self-Orgnizing Map; SOM) 구조 기반으로 클러스터링(Clustering)이 수행될 수 있고, 상기 ICG 학습패턴에 대한 각각의 상기 정량적 파라미터를 이용하여 상기 ICG 학습패턴 간의 유사성이 판단될 수 있다. 이때, 상기 ICG 학습패턴집합 생성단계(S430)는 임의의 상기 ICG 학습패턴집합 내 포함되는 ICG 학습패턴에 대 한 분산값이 산출되고, 상기 분산값이 기 설정된 분산값 범위이내이면 상기 ICG 학습패턴의 클러스터링 (Clustering) 정확도가 높은 것으로 판단될 수 있다. 반면에 상기 분산값이 기 설정된 분산값 범위를 초과하면 상기 ICG 학습패턴의 클러스터링(Clustering) 정확도가 낮은 것으로 판단되고 상기 ICG 학습패턴집합이 재생성 될 수 있다. 예컨대, 25개의 ICG 학습패턴집합 중에서 임의의 ICG 학습패턴집합에 포함된 다수 개의 ICG 학습패턴에 대한 분 산값이 산출될 수 있다. 즉, 25개의 분산값이 각각의 ICG 학습패턴집합으로부터 산출될 수 있다. 그리고 상기 분산값이 기 설정된 분산값 범위이내이면 유사한 ICG 학습패턴끼리 적합하게 클러스터링(Clustering)된 것으로 판단될 수 있고, 25개의 분산값 중에서 적어도 하나가 기 설정된 분산값을 초과한다면 상기 ICG 학습패턴집합이 재생성될 수 있다. 상기 ICG 학습패턴집합이 재생성되는데 있어서, 상기 ICG 학습패턴집합 생성단계(S430)는 임의의 상기 ICG 학습 패턴집합 내 포함되는 ICG 학습패턴에 대한 분산값이 기 설정된 분산값을 초과하면 학습패턴집합의 수를 늘려 클러스터링(Clustering)이 재진행될 수 있다. 만약, 상기 학습패턴집합의 수가 적을 경우 상기 예비예측모델 내 신경망이 과소적합(Underfitting)되어 적절한 패턴 분류가 어려운 문제점이 있고, 학습패턴집합의 수가 많을 경 우 과대적합(Overfitting)되어 상기 ICG 영상이 입력되었을 때 분류 성능이 현저히 낮아지는 문제점이 있다. 따 라서 상기 ICG 학습패턴집합 생성단계(S430)는 우선적으로 적은 수의 학습패턴집합으로 클러스터링(Clusterin g)된 후 기 설정된 분산값이 초과되면 기 설정된 한 단계 더 큰 수의 학습패턴집합으로 클러스터링(Clusterin g)되어 학습패턴집합의 수의 적절성이 반복적으로 판단될 수 있다. 다음으로, 상기 라벨링 단계(S440)는 상기 ICG 학습패턴집합이 정상상태, 양호상태 및 위험상태 중 하나로 라벨 링(Labeling)될 수 있다. 즉, 25개의 ICG 학습패턴집합이 각각 3가지 상태 중 하나로 라벨링될 수 있다. 상기 ICG 학습패턴집합이 정상상태, 양호상태 및 위험상태 중 하나로 라벨링(Labeling)되는 기준에 대해서 설명 해보면, 상기 라벨링 단계(S440)는 임의의 ICG 학습패턴집합에 포함된 ICG 학습패턴의 수에 대한 문합부 합병증 을 진단받은 환자의 ICG 학습패턴 중에서 해당 ICG 학습패턴집합에 포함된 ICG 학습패턴과 유사한 ICG 학습패턴 의 수의 비율에 따라서 임의의 ICG 학습패턴집합이 정상상태, 양호상태 및 위험상태 중 하나로 분류될 수 있다. 예컨대, ICG 학습영상을 포함하는 데이터 셋에는 문합부 합병증을 진단받은 환자와 문합부 합병증을 진단받지 않은 환자 모두에 대한 ICG 학습영상이 포함될 수 있다. 즉, ICG 학습영상을 포함하는 데이터 셋으로부터 10000 개의 ICG 학습패턴이 인식될 수 있고, 그 중에 문합부 합병증을 진단받은 환자의 ICG 학습패턴이 1400개가 인식 될 수 있다. 그리고 상기 ICG 학습패턴집합은 25개일 수 있다. 그리고 25개 중에서 임의의 ICG 학습패턴집합에 포함된 ICG 학습패턴의 수는 10000개 중에서 384개일 수 있고, 문합부 합병증을 진단받은 환자의 ICG 학습패턴 이 1400개 중에서 10개일 수 있다. 이에 따라 상기 비율은 10/384로 약 2%의 값으로 산출될 수 있다. 즉, 상기 라벨링 단계(S440)는 임의의 ICG 학습패턴집합에 대하여 상기 비율이 50% 이상일 경우 위험상태로 라 벨링될 수 있고, 10% 내지 50% 미만일 경우 양호상태로 라벨링될 수 있고, 10% 미만일 경우 정상상태로 라벨링 될 수 있다. 다음으로, 상기 ICG 테스트영상 분석단계(S450)는 라벨링된 상기 ICG 학습패턴집합을 학습시킨 후 예비분석모델 이 생성되고, 상기 예비분석모델이 이용되어 ICG 테스트영상이 분석될 수 있다. 상기 ICG 테스트영상 역시 상기 학습영상과 동일하게 결과값이 있는 데이터일 수 있다. 즉, 상기 ICG 테스트 영상은 상기 ICG 학습영상과 동일하게 전처리 및 패턴 인식 과정을 거친 후 상기 예비분석 모델에 입력되고 상기 예비분석모델을 통해서 결과값이 도출될 수 있다. 다음으로, 상기 분석모델 결정단계(S460)는 상기 ICG 테스트영상에 대한 분석결과에 기초하여 상기 예비분석모 델의 정확도(DS)가 기 설정된 정확도 (DPRE)이상일 경우 상기 예비분석모델이 상기 분석모델로 결정될 수 있다. 반면에, 상기 분석모델 결정단계(S460)는 상기 예비분석모델의 정확도(DS)가 기 설정된 정확도(DPRE) 미만일 경 우 상기 ICG 테스트영상 분석단계(S450)로 반복적으로 회귀될 수 있다. 즉, 상기 분석모델 결정단계(S460)는 예 비분석모델로부터 유의미한 결과값이 산출될 수 있는지 여부가 입증되기 위함이다. 다음으로, 분석결과 출력단계(S500)는 상기 프로세서에 의하여, 상기 분석모델을 이용하여 상기 ICG 패턴 으로부터 위험도를 포함하는 분석결과가 출력된다. 여기서, 상기 위험도는 상기 라벨링 단계(S440)로부터 임의 의 ICG 학습패턴집합이 정상상태, 양호상태 및 위험상태 중 하나로 분류됨에 따라 정상상태, 양호상태 및 위험 상태가 포함될 수 있다.또한, 상기 분석결과 출력단계(S500)는 상기 ICG 영상에 촬영된 조직의 위치별로 시간에 따른 상기 위험도가 컬 러 맵으로 표시되고, 상기 컬러 맵은, 상기 ICG 영상에 합성될 수 있다. 본원발명으로부터 출력된 분석결과인 도 5의 (a)를 보면, 상기 분석결과 출력단계(S500)는 수술 중 의료진에 의 하여 미세 혈류 상태를 직관적으로 확인할 수 있도록 상기 관심영역 설정단계(S320)로부터 설정된 관심영역 (ROI)별로 시간에 따른 상기 위험도가 컬러 맵으로 표시될 수 있다. 상기 컬러 맵은 가장 바람직하게 상기 ICG 영상의 백색광 이미지에 합성될 수 있다. 그리고 상기 컬러 맵은 각각의 관심영역(ROI)에 대하여 정상상태, 양 호상태 및 위험상태가 각각 빨간색, 녹색 및 파란색으로 표시될 수 있다. 종래에는 상기 ICG 영상 내에서 ICG 형광이 밝게 보일 경우 미세 혈류 상태가 양호한 것으로 추정될 수 있고, 그렇지 않을 경우 미세 혈류 상태가 불량한 것으로 추정될 수 있다. 다만, 의료진의 임상경험만으로는 ICG 영상 내 ICG 형광의 불명확한 가시화로 ICG 형광의 미묘한 변화를 시각적으로 관찰하여 미세 혈류 상태를 구별하는 것은 어려운 문제점이 있다. 즉, 본원발명은 시각적으로 관찰하기 어려운 미세 혈류 상태를 실시간으로 용이하 게 구별할 수 있는 현저한 효과가 있다, 또한, 종래 정량적 평가를 위해 다양한 매개변수를 기반으로 관류를 분석하는 방법의 경우 혈관의 해부학적 구 조의 차이 또는 상기 근적외선 카메라로 촬영된 ICG 영상 내 노이즈로 인해 정량적 매개 변수에 따른 분석 결과가 매번 상이할 수 있는 반면, 본 발명은 인공지능 기술기반으로 ICG 영상을 실시간으로 분석함으로써 정확 성과 일관성을 보다 향상시킬 수 있고, 수술 시 의료진의 문합부 진단을 보조할 수 있는 현저한 효과가 있다."}
{"patent_id": "10-2021-0060568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2021-0060568", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 인공지능 기술기반 실시간 미세 혈류 분석 방법에 관한 것이다. 도 2는 본 발명의 ICG 영상 전처리단계에 대한 세부흐름도이다. 도 3은 본 발명의 분석모델 생성단계에 대한 세부흐름도이다. 도 4는 본 발명의 일실시예에 따른 관심영역(ROI)별 ICG 로컬패턴을 표시한 도면이다. 도 5는 본 발명의 일실시예에 따른 본원발명에 따른 분석결과(a)와 종래 파라미터에 따른 분석결과(b, c, d)를 표시한 도면이다. 도 6은 본 발명의 일실시예에 따른 다수 개의 ICG 학습패턴이 클러스터링(Clustering)되는 것을 표시한 도면이 다."}
