{"patent_id": "10-1998-0011064", "section": "특허_기본정보", "subsection": "특허정보", "content": {"출원번호": "10-1998-0011064", "출원인": "삼성전자 주식회사    윤종용", "발명자": "현윤종"}}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "문자 표시 장치에 있어서,사용자의 요구에 따라 해당되는 폰트의 특성 코드와 문자 코드를 발생하여 출력하는 마이콤; 상기 마이콤으로부터 출력되는 상기 특성 코드와 상기 문자 코드를 입력하여 저장하는 임시 메모리;복수의 폰트 데이터들을 저장하고 있으며, 상기 임시 메모리에 저장되어 있는 상기 문자 코드와 비디오 어드레스에 의해서 엑세스 되어 상기 복수의 폰트 데이터들 중에서 해당되는 폰트 데이터를 출력하는 저장 메모리;상기 임시 메모리에 저장되어 있는 상기 문자 코드가 소정 값 이하인 경우에만 인에이블 되어, 상기 문자 코드를 이용하여 상기 저장 메모리를 엑세스 하여 상기 저장 메모리로부터 출력되는 폰트 데이터에 대하여 상기 특성 코드에서 지정하는 해당되는 동작들을 처리하여 이들을 시리얼 비디오 알, 지, 비, 및 강도 신호로서 출력하는 정상 폰트 처리부; 및상기 임시 메모리에 저장되어 있는 상기 문자 코드가 소정 값 보다 큰 경우에만 인에이블 되어, 상기 문자 코드에 따라 상기 저장 메모리를 구성하고 있는 폰트 데이터 중에서 사용자의 요구에 의해 미리 설정되어 있는 해당되는 폰트 데이터들을 시리얼 비디오 알, 지, 비, 및 강도 신호 중에서 해당되는 신호로서 각각 출력하는 멀티 칼러 폰트 처리부를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 멀티 칼러 폰트 처리부는 사용자의 요구에 따라 상기 마이콤으로부터 해당되는 복수의 데이터들을 입력하여 이들을 각각 상기 저장 메모리를 구성하고 있는 폰트 데이터 중에서 해당되는 폰트 데이터를 지정하는 상기 비디오 어드레스로서 저장하고 있으며, 상기 문자 코드에 의해서 엑세스 되어 상기 비디오 어드레스들 중에서 해당되는 16-8공개특허특1999-0076265비디오 어드레스들을 출력하는 칼러 룩-업 테이블; 및상기 임시 메모리에 저장되어 있는 상기 문자 코드가 소정 값 보다 큰 경우에만 인에이블 되어, 상기 문자 코드를 이용하여 상기 칼러 룩-업 테이블을 엑세스하고, 상기 칼러 룩-업 테이블로부터 출력되는 해당되는 비디오 어드레스들을 이용하여 상기 저장 메모리를 엑세스 하여 출력되는 해당되는 폰트 데이터들을 시리얼 비디오 알, 지, 비, 및 강도 신호 중에서 해당되는 신호로서 출력하는 처리부를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "문자 표시 장치에 있어서,사용자의 요구에 따라 해당되는 폰트의 시리얼 데이터와 시리얼 클럭을 발생하여 출력하는 마이콤; 상기 마이콤으로부터 출력되는 상기 시리얼 데이터와 시리얼 클럭을 입력하여 이에 따라 해당되는 모드 레지스터 신호와 데이터를 발생하여 출력하는 시리얼 인터페이스;상기 시리얼 인터페이스로부터 출력되는 상기 데이터를 입력하여 저장하는 임시 메모리;복수의 폰트 데이터들을 저장하고 있으며, 상기 임시 메모리에 저장되어 있는 상기 데이터에 의해서 엑세스 되어 상기 복수의 폰트 데이터들 중에서 해당되는 폰트 데이터를 출력하는 저장 메모리;상기 저장 메모리로부터 출력되는 폰트 데이터를 입력하여 이를 시리얼 신호로 변환하여 출력하는 피소부;인공 지능 착색 신호가 인에이블 되어 있는 경우에만 인에이블 되어, 상기 시리얼 인터페이스로부터 출력되는 상기 모드 레지스터 신호를 입력하여 상기 모드 레지스터 신호 중에서 문자색 신호를 바탕색 신호에 따라 다시 설정하여 출력하는 레지스터 칼러 설정부; 상기 레지스터 칼러 설정부로부터 출력되는 상기 모드 레지스터 신호와 상기 피소부로부터 출력되는 신호를 입력하여 이에 따라 해당되는 시리얼 비디오 데이터를 발생시켜 출력하는 칼러 신호 발생부를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 레지스터 칼러 설정부는 상기 인공 지능 착색 신호가 인에이블 되어 있는 경우에만 인에이블 되어, 상기 시리얼 인터페이스로부터 출력되는 상기 모드 레지스터 신호의 바탕색 신호에 따라 상기 문자색 신호를 상기 바탕색 신호와 보색 관계에 있는 문자색 신호로서 설정하여 출력하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 모드 레지스터 신호는 3 비트 크기의 문자색 신호를 가지는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 모드 레지스터 신호는 3 비트 크기의 바탕색 신호를 가지는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 상기 레지스터 칼러 설정부는 상기 인공 지능 착색 신호가 인에이블 되어 있는 경우에만 인에이블 되어, 상기 바탕색 신호에 따라 상기 문자색 신호의 제 1 내지 제 3 문자색 비트를 각각, 해당되는 값으로 설정하여 이를 새로운 문자색 신호인 제 1 내지 제 3 업-문자색 비트로서 출력하는 제 1 내지 제 3 문자색 설정부를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 제 1 문자색 설정부는각각, 상기 바탕색 신호를 구성하고 있는 제 1 내지 제 3 바탕색 비트의 조합 중에서 해당되는 조합을 입력하여 이들을 논리합하고 인버팅 하여 출력하는 제 1 내지 제 8 NOR 게이트;상기 제 1 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 1 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 1 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 1 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 1 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 문자색 신호의 제 1 문자색 비트를 그대로 출력하는 제 1 멀티플렉서;상기 제 2 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 2 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 2 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 1 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 2 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 1 멀티플렉서로부터 출력되는 신호를 출력하는 제 2 멀티플렉서;상기 제 3 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 3 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 3 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 1 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 3 NOR 게이트로부터 출16-9공개특허특1999-0076265력되는 신호가 로우 레벨일 경우에는 상기 제 2 멀티플렉서로부터 출력되는 신호를 출력하는 제 3 멀티플렉서;상기 제 4 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 4 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 4 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 1 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 4 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 3 멀티플렉서로부터 출력되는 신호를 출력하는 제 4 멀티플렉서;상기 제 5 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 5 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 5 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 1 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 5 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 4 멀티플렉서로부터 출력되는 신호를 출력하는 제 5 멀티플렉서;상기 제 6 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 6 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 6 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 1 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 6 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 5 멀티플렉서로부터 출력되는 신호를 출력하는 제 6 멀티플렉서;상기 제 7 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 7 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 7 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 1 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 7 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 6 멀티플렉서로부터 출력되는 신호를 출력하는 제 7 멀티플렉서;상기 제 8 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 8 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 8 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 1 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 8 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 7 멀티플렉서로부터 출력되는 신호를 출력하는 제 8 멀티플렉서;상기 인공 지능 착색 신호에 의해서 제어되어, 상기 인공 지능 착색 신호가 하이 레벨로 인에이블 되어 있는 경우에는 상기 제 8 멀티플렉서로부터 출력되는 신호를 상기 제 1 업-문자색 비트로서 출력하고, 상기 인공 지능 착색 신호가 로우 레벨로 디스에이블 되어 있는 경우에는 상기 문자색 신호의 제 1 문자색 비트를 그대로 출력하는 제 9 멀티플렉서를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 제 2 문자색 설정부는상기 제 1 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 1 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 1 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 2 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 1 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 문자색 신호의 제 2 문자색 비트를 그대로 출력하는 제 11 멀티플렉서;상기 제 2 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 2 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 2 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 2 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 2 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 11 멀티플렉서로부터 출력되는 신호를 출력하는 제 12 멀티플렉서;상기 제 3 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 3 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 3 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 2 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 3 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 12 멀티플렉서로부터 출력되는 신호를 출력하는 제 13 멀티플렉서;상기 제 4 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 4 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 4 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 2 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 4 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 13 멀티플렉서로부터 출력되는 신호를 출력하는 제 14 멀티플렉서;상기 제 5 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 5 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 5 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 2 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 5 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 14 멀티플렉서로부터 출력되는 신호를 출력하는 제 15 멀티플렉서;상기 제 6 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 6 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 6 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 2 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 6 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 15 멀티플렉서로부터 출력되는 신호를 출력하는 제 16 멀16-10공개특허특1999-0076265티플렉서;상기 제 7 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 7 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 7 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 2 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 7 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 16 멀티플렉서로부터 출력되는 신호를 출력하는 제 17 멀티플렉서;상기 제 8 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 8 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 8 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 2 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 8 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 17 멀티플렉서로부터 출력되는 신호를 출력하는 제 18 멀티플렉서;상기 인공 지능 착색 신호에 의해서 제어되어, 상기 인공 지능 착색 신호가 하이 레벨로 인에이블 되어 있는 경우에는 상기 제 18 멀티플렉서로부터 출력되는 신호를 상기 제 2 업-문자색 비트로서 출력하고, 상기 인공 지능 착색 신호가 로우 레벨로 디스에이블 되어 있는 경우에는 상기 문자색 신호의 제 2 문자색 비트를 그대로 출력하는 제 19 멀티플렉서를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서, 상기 제 3 문자색 설정부는상기 제 1 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 1 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 1 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 3 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 1 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 문자색 신호의 제 3 문자색 비트를 그대로 출력하는 제 21 멀티플렉서;상기 제 2 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 2 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 2 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 3 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 2 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 21 멀티플렉서로부터 출력되는 신호를 출력하는 제 22 멀티플렉서;상기 제 3 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 3 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 3 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 3 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 3 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 22 멀티플렉서로부터 출력되는 신호를 출력하는 제 23 멀티플렉서;상기 제 4 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 4 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 4 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 3 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 4 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 23 멀티플렉서로부터 출력되는 신호를 출력하는 제 24 멀티플렉서;상기 제 5 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 5 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 5 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 3 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 5 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 24 멀티플렉서로부터 출력되는 신호를 출력하는 제 25 멀티플렉서;상기 제 6 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 6 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 6 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 3 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 6 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 25 멀티플렉서로부터 출력되는 신호를 출력하는 제 26 멀티플렉서;상기 제 7 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 7 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 7 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 3 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 7 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 26 멀티플렉서로부터 출력되는 신호를 출력하는 제 27 멀티플렉서;상기 제 8 NOR 게이트로부터 출력되는 신호에 의해서 제어되어, 상기 제 8 NOR 게이트로부터 출력되는 신호가 하이 레벨일 경우에는 상기 제 8 NOR 게이트에 입력되는 제 1 내지 제 3 바탕색 비트의 조합에 대하여 상기 제 3 업-문자색 비트로서 설정되어 있는 신호를 출력하고, 상기 제 8 NOR 게이트로부터 출력되는 신호가 로우 레벨일 경우에는 상기 제 27 멀티플렉서로부터 출력되는 신호를 출력하는 제 28 멀티플렉서;상기 인공 지능 착색 신호에 의해서 제어되어, 상기 인공 지능 착색 신호가 하이 레벨로 인에이블 되어 있는 경우에는 상기 제 28 멀티플렉서로부터 출력되는 신호를 상기 제 3 업-문자색 비트로서 출력하고, 상기 인공 지능 착색 신호가 로우 레벨로 디스에이블 되어 있는 경우에는 상기 문자색 신호의 제 3 문자색 비트를 그대로 출력하는 제 29 멀티플렉서를 구비하는 것을 특징으로 하는 문자 표시 장치.16-11공개특허특1999-0076265청구항 11 문자 표시 장치에 있어서, 사용자의 요구에 따라 해당되는 제 1 내지 제 3 문자색 신호들, 제 1 내지 제 3 바탕색 신호들, 래스터 인에이블 신호, 및 캐릭터 인에이블 신호를 발생하여 출력하는 비디오 신호 발생부; 및상기 비디오 신호 발생부로부터 출력되는 상기 제 1 내지 제 3 문자색 신호, 상기 제 1 내지 제 3 바탕색 신호, 상기 래스터 인에이블 신호, 및 상기 캐릭터 인에이블 신호를 입력하여, 상기 제 1 내지 제 3 바탕색 신호를 싱크 펄스 신호의 주기에 따라 반전하여, 상기 제 1 내지 제 3 바탕색 신호에 의해서 블링킹 효과를 가지는 신호들을 각각 제 1 내지 제 3 비디오 신호로서 출력하는 블링킹 동작부를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서, 상기 블링킹 동작부는 각각, 상기 비디오 신호 발생부로부터 출력되는 상기 제 1 내지 제 3 문자색 신호들 중에서 해당되는 문자색 신호, 상기 제 1 내지 제 3 바탕색 신호 중에서 해당되는 바탕색 신호, 상기 래스터 인에이블 신호, 및 상기 캐릭터 인에이블 신호를 입력하여, 상기 제 1 내지 제 3 바탕색 신호 중에서 해당되는 바탕색 신호를 상기 싱크 펄스 신호의 주기로 반전하여, 상기 제 1 내지 제 3 바탕색 신호 중에서 해당되는 바탕색 신호에 의해서 블링킹 효과를 가지는 신호들을 상기 제 1 내지 제 3 비디오 신호 중에서 해당되는 비디오 신호로서 출력하는 제 1 내지 제 3 블링킹 동작부를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서, 상기 제 1 블링킹 동작부는, 상기 래스터 인에이블 신호를 입력하여 이를 인버팅 하여 출력하는 제 1 인버터;상기 싱크 펄스 신호에 의해서 제어되어, 상기 래스터 인에이블 신호와 상기 제 1 인버터로부터 출력되는 신호를 입력하여 이들을 멀티플렉싱하여 출력하는 제 1 멀티플렉서;상기 제 1 멀티플렉서로부터 출력되는 신호와 상기 제 1 바탕색 신호를 입력하여 이들을 논리 곱하여 출력하는 제 1 AND 게이트;상기 캐릭터 인에이블 신호와 상기 제 1 문자색 신호를 입력하여 이들을 논리 곱하여 출력하는 제 2 AND 게이트; 및상기 제 1 AND 게이트와 상기 제 2 AND 게이트로부터 출력되는 신호들을 입력하여 이들을 논리 합하여 이를 상기 제 1 비디오 신호로서 출력하는 제 1 OR 게이트를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서, 상기 제2 블링킹 동작부는, 상기 래스터 인에이블 신호를 입력하여 이를 인버팅 하여 출력하는 제 2 인버터;상기 싱크 펄스 신호에 의해서 제어되어, 상기 래스터 인에이블 신호와 상기 제 2 인버터로부터 출력되는 신호를 입력하여 이들을 멀티플렉싱하여 출력하는 제 2 멀티플렉서;상기 제 2 멀티플렉서로부터 출력되는 신호와 상기 제 2 바탕색 신호를 입력하여 이들을 논리 곱하여 출력하는 제 3 AND 게이트;상기 캐릭터 인에이블 신호와 상기 제 2 문자색 신호를 입력하여 이들을 논리 곱하여 출력하는 제 4 AND 게이트; 및상기 제 3 AND 게이트와 상기 제 4 AND 게이트로부터 출력되는 신호들을 입력하여 이들을 논리 합하여 이를 상기 제 2 비디오 신호로서 출력하는 제 2 OR 게이트를 구비하는 것을 특징으로 하는 문자 표시 장치."}
{"patent_id": "10-1998-0011064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서, 상기 제 3 블링킹 동작부는, 상기 래스터 인에이블 신호를 입력하여 이를 인버팅 하여 출력하는 제 3 인버터;상기 싱크 펄스 신호에 의해서 제어되어, 상기 래스터 인에이블 신호와 상기 제 3 인버터로부터 출력되는 신호를 입력하여 이들을 멀티플렉싱하여 출력하는 제 3 멀티플렉서;상기 제 3 멀티플렉서로부터 출력되는 신호와 상기 제 3 바탕색 신호를 입력하여 이들을 논리 곱하여 출력하는 제 5 AND 게이트;상기 캐릭터 인에이블 신호와 상기 제 3 문자색 신호를 입력하여 이들을 논리 곱하여 출력하는 제 6 AND 게이트; 및상기 제 5 AND 게이트와 상기 제 6 AND 게이트로부터 출력되는 신호들을 입력하여 이들을 논리 합하여 이를 상기 제 3 비디오 신호로서 출력하는 제 3 OR 게이트를 구비하는 것을 특징으로 하는 문자 표시 장16-12공개특허특1999-0076265치.도면 도면1 도면2 도면316-13공개특허특1999-0076265 도면416-14공개특허특1999-0076265 도면516-15공개특허특1999-0076265 도면6 도면7 도면816-16공개특허특1999-0076265"}
{"patent_id": "10-1998-0011064", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사용자의 요구에 따라 해당되는 폰트의 특성 코드와 문자 코드를 발생하여 출력하는 마이콤, 마이콤으로 부터 출력되는 특성 코드와 문자 코드를 입력하여 저장하는 임시 메모리, 복수의 폰트 데이터들을 저장 하고 있으며, 임시 메모리에 저장되어 있는 문자 코드와 비디오 어드레스에 의해서 엑세스 되어 복수의 폰트 데이터들 중에서 해당되는 폰트 데이터를 출력하는 저장 메모리, 임시 메모리에 저장되어 있는 상 기 문자 코드가 소정 값 보다 큰 경우에만 인에이블 되어, 문자 코드에 따라 저장 메모리를 구성하고 있 는 폰트 데이터 중에서 사용자의 요구에 의해 미리 설정되어 있는 해당되는 폰트 데이터들을 시리얼 비 디오 알, 지, 비, 및 강도 신호 중에서 해당되는 신호로서 각각 출력하는 멀티 칼러 폰트 처리부를 구비 하는 것을 특징으로 하는 문자 표시 장치가 개시되어 있다. 본 발명에 의하면 칩 사이즈를 증가시키지 않으면서, 한 개의 폰트에 여러 가지 색을 설정할 수 있는 멀티 칼라 폰트 기능, 문자색을 바탕색에 따 라 자동적으로 가장 적절하게 설정하는 인공 지능 문자 착색 기능, 및 새로운 블링킹 효과를 나타내는 블링킹 기능 등을 구비하여 모니터의 해상도가 높아짐에 따른 사용자의 다양한 요구를 만족시킬 수 있는 효과를 가진다."}
