{"patent_id": "10-2023-0016454", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0123710", "출원번호": "10-2023-0016454", "발명의 명칭": "인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템 및 그 방법", "출원인": "주식회사 다한에프에이", "발명자": "이민재"}}
{"patent_id": "10-2023-0016454", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템에 있어서,사용자의 제어에 따라 노출되는 제1 컨텐츠 정보를 실시간으로 변경하여 출력하고, 주변상황을 인식하여 인식된주변상황정보를 분석 및 학습한 결과에 따른 제2 컨텐츠 정보를 출력하기 위한 스마트 디스플레이 장치(100);사용자로부터 상기 스마트 디스플레이 장치를 제어하기 위한 출력 제어 신호를 입력받기 위한 사용자 단말기(110); 및상기 사용자 단말기를 통해 입력받은 상기 출력 제어 신호를 상기 스마트 디스플레이 장치로 전송하고, 상기 스마트 디스플레이 장치로부터 분석 및 학습한 결과를 전달받고, 상기 제2 컨텐츠 정보의 출력 이력을 수신하여저장하기 위한 디스플레이관리서버(120)를 포함하고,상기 스마트 디스플레이 장치(100)는,주변상황을 감지하기 위한 다수의 입력부(101 내지 104);상기 제1 컨텐츠 정보 또는 상기 제2 컨텐츠 정보를 출력하는 다수의 출력부(106 내지 109); 및상기 출력 제어 신호에 따른 상기 제1 컨텐츠 정보를 상기 다수의 출력부로 출력하도록 제어하고, 상기 다수의입력부를 통해 획득한 영상을 인공지능 기반으로 인식, 분석 및 학습하여, 그 결과에 따른 상기 제2 컨텐츠 정보를 상기 다수의 출력부로 출력하도록 제어하기 위한 상기 디스플레이 제어부(105)를 포함하고,상기 디스플레이 제어부(105)는,상기 디스플레이관리서버, 상기 다수의 입력부, 및 상기 다수의 출력부와 데이터를 송수신하기 위한 송수신부(201);인공지능 기반 알고리즘에 따라 상기 다수의 입력부로부터 전달받은 데이터로부터 주변상황을 인식하기 위한 인식부(204);상기 인공지능 기반 알고리즘에 따라 주변상황의 인식 결과를 분석하여 출력할 제2 컨텐츠 정보를 결정하기 위한 분석부(205);상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과 및 출력된 제2 컨텐츠 정보를 학습하기 위한 학습부(206);출력할 제2 컨텐츠 정보 및 상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과, 및 출력된 제2 컨텐츠 정보의 출력 이력을 저장하고 있는 저장부(203); 및상기 송수신부(201), 상기 인식부(204), 상기 분석부(205), 상기 학습부(206) 및 상기 저장부(203)를 포함한 각구성요소를 제어하기 위한 제어부(202)를 포함하고,상기 인식부(204)는,공개특허 10-2024-0123710-3-객체 탐지(Object Detection) 기술 및 합성곱신경망(CNN: Convolutional Neural Network) 기술을 이용하여 상기 영상에 포함된 사물을 인식하는 것을 특징으로 하고,상기 분석부(205)는,상기 인식한 사물의 키워드를 추출하고, 상기 추출된 키워드를 이용하여 상기 다수의 출력부에 출력할 제2 컨텐츠 정보를 검색하는 것을 특징으로 하고,상기 학습부(206)는,출력된 제2 컨텐츠 정보를 학습하여, 상기 출력된 제2 컨텐츠 정보에 대한 새로운 키워드를 분류 및 업데이트하는 것을 특징으로 하고,상기 디스플레이 제어부(105)는,상기 디스플레이관리서버(120)와 구별되어, 상기 스마트 디스플레이 장치에 구비되며, 상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과에 따라 출력할 제2 컨텐츠 정보를 상기 저장부에서 검색하여 상기 다수의 출력부를 통해 출력되도록 하고, 출력된 제2 컨텐츠 정보의 출력 이력, 새롭게 분류 및 업데이트된 키워드를 상기 디스플레이관리서버(120)로 전송하는 것을 특징으로 하는 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어시스템."}
{"patent_id": "10-2023-0016454", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 컨텐츠 정보 및 상기 제2 컨텐츠 정보는,닷넷(.NET) 프레임워크에 기반한 프로그래밍 언어, 및 마이크로소프트 파운데이션 클래스(MFC : MicrosoftFoundation Class) 라이브러리를 사용하여 설계된 디스플레이프로그램에 의해 상기 다수의 출력부로 표시되는것을 특징으로 하는 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템."}
{"patent_id": "10-2023-0016454", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1의 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템에 포함된 스마트 디스플레이 장치의제어 방법에 있어서,디스플레이관리서버를 통해 사용자 단말기로부터 전달받은 출력 제어 신호에 따른 제1 컨텐츠 정보를 다수의 출력부를 통해 출력하는 제1컨텐츠정보출력단계(S520);다수의 입력부를 통해 주변상황을 감지 및 입력받는 입력단계(S530); 및인공지능 기반 알고리즘에 따라 상기 주변상황을 인식하고, 인식된 주변상황정보를 분석 및 학습한 결과에 따른제2 컨텐츠 정보를 상기 다수의 출력부를 통해 출력하는 제2컨텐츠정보출력단계(S540)를 포함하고,상기 제2컨텐츠정보출력단계(S540)는,상기 인공지능 기반 알고리즘에 따라 상기 다수의 입력부로부터 전달받은 영상으로부터 주변상황을 인식하는 인식단계(S541);상기 인공지능 기반 알고리즘에 따라 주변상황의 인식 결과를 분석하여 출력할 제2 컨텐츠 정보와 관련된 키워드를 추출하는 분석단계(S542);추출된 키워드를 이용하여 출력할 제2 컨텐츠 정보를 검색하는 검색단계(S543);상기 다수의 출력부를 통해 상기 검색된 제2 컨텐츠 정보를 출력하는 출력단계(S544);공개특허 10-2024-0123710-4-상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과, 및 출력된 제2 컨텐츠 정보를 학습하는 학습단계(S545); 및 상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과, 출력된 제2 컨텐츠 정보의 출력 이력, 새롭게 분류 및업데이트된 키워드를 상기 디스플레이관리서버로 전송하는 전송단계(S550)를 포함하고,상기 인식단계(S541)는,객체 탐지(Object Detection) 기술 및 합성곱신경망(CNN: Convolutional Neural Network) 기술을 이용하여 상기 영상에 포함된 사물을 인식하는 것을 특징으로 하는 것을 특징으로 하는 인공지능 기반 스마트 디스플레이장치의 제어 방법."}
{"patent_id": "10-2023-0016454", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제5항에 있어서,상기 제1 컨텐츠 정보 및 상기 제2 컨텐츠 정보는,닷넷(.NET) 프레임워크에 기반한 프로그래밍 언어, 및 마이크로소프트 파운데이션 클래스(MFC : MicrosoftFoundation Class) 라이브러리를 사용하여 설계된 디스플레이프로그램에 의해 상기 다수의 출력부로 표시되는것을 특징으로 하는 인공지능 기반 스마트 디스플레이 장치의 제어 방법."}
{"patent_id": "10-2023-0016454", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템 및 그 방법에 관한 것으로서, 더욱 상 세하게는 사용자 단말기의 제어에 따라 노출되는 컨텐츠 정보를 실시간으로 변경하는 것이 가능하며, 각 출력부 에 구비된 입력부를 통해 획득한 영상으로부터 주변상황을 인식하여 인식된 정보를 분석 및 학습함으로써 인공지 능 기반의 분석 결과에 따른 컨텐츠 정보를 출력하는 것이 가능한 인공지능 기반 스마트 디스플레이 장치를 포함 하는 제어 시스템 및 그 방법을 제공한다."}
{"patent_id": "10-2023-0016454", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템 및 그 방법에 관한 것으로서, 더욱 상세하게는 사용자 단말기의 제어에 따라 노출되는 컨텐츠 정보를 실시간으로 변경하는 것이 가능하며, 각 출력 부에 구비된 입력부를 통해 획득한 영상으로부터 주변상황을 인식하여 인식된 정보를 분석 및 학습함으로써 인 공지능 기반의 분석 결과에 따른 컨텐츠 정보를 출력하는 것이 가능한 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0016454", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "과거에는 대형 전광판이나 고급형 텔레비전에서나 볼 수 있었던 대형 디스플레이들이 현대에는 일반 공 공장소나 일반 소매점 등에서도 수십 수백 개씩 장착되어 활용될 만큼 디스플레이장치의 기술개발이 빠르게 이루어졌으며, 그 가격대도 충분히 다양하게 활용될 수 있을 만큼 저렴해졌다. 종래에는 LED 전광판이 다양한 중소형의 광고 디스플레이어로 되었는데, 예를 들면 상점의 쇼 윈도우 (show window) 등에 상점의 상품을 광고하기 위해 이용되고 있다. 이뿐만 아니라, 백화점이나 대형 쇼핑몰에서 안내나 매장 정보를 위한 디스플레이로도 이용되며, 엘리베 이터 등 의 공공 장소에서도 LED 전광판이 다양한 정보를 제공하기 위한 용도로 이용되고 있다. 그런데, 종래의 LED 전광판은 LED 전광판에 내장된 메모리에 미리 저장된 몇 가지의 문구만을 디스플레 이하거나 미리 정해진 영상만을 고정적으로 디스플레이하도록 구성되어 있다. 메모리에 저장된 내용만을 디스플레이하는 경우에는 전원을 끌 때까지 동일한 내용만을 반복하여 디스플 레이하 는 단점이 있다. 이에, LED 전광판을 통해 좀 더 다양한 컨텐츠를 제공하기 위해 유선으로 키패드(key pad)와 연결하여 컨텐츠를 변경하여 디스플레이하거나 무선 방식으로서는 리모트 컨트롤(remote control)을 이용하여 문구를 사용자가 직 접 변경하여 송신하는 방식이 이용되었다. 한국등록특허 [10-1029858]에서는 키패드를 이용한 유선 방식을 개시 하고 있으며, 한국등록특허 [10-0918083]에서는 적외선 리모트 컨트롤 방식을 개시하고 있다. 그런데, 키패드나 적외선 리모트 컨트롤 방식은 사용자의 문구 입력이 제한된다는 불편함이 있다. 예를 들어, 거리의 상점에서 행인들에게 신속하게 할인 정보를 알려야 할 경우 사용자가 손쉽고 편리하 게 문구 나 컨텐츠를 변경하기가 쉽지 않다는 문제점이 있다. 유선인 경우에는 LED 전광판이 키패드 또는 PC와 거리가 먼 경우 유선 정보 전송이 곤란할 경우도 있다. 한편, 등록실용공보 20-0332267은 블루투스 무선 어댑터를 이용한 전광판 표시장치 방식도 개시하고 있 으나, 여 전히 스마트폰 등을 이용한 문구 입력과 수정이 아니므로 문구 입력이나 컨텐츠의 변경에 제한이 있다는 단점이 있다. 또한, 스마트폰이 아닌 주로 PC 등으로부터 블루투스 무선 어댑터를 연결하여 이용하고 있으므로, 근거 리 통신 의 통신 반경의 제약으로 인해 차량에 부착되는 이동형 LED 전광판에는 적용되기 어렵다는 한계가 있다. 특히, 차량에 이동형 LED 전광판을 통해 광고 컨텐츠를 디스플레이하는 경우에는 지역과 시간의 특성을 반영한 광고 컨텐츠를 디스플레이할 필요가 있는데, 기존에는 신속하게 컨텐츠나 문구를 변경할 수 없고 이미 메모리에 저장 된 획일적인 광고 컨텐츠와 문구만 디스플레이 할 수 있을 뿐이었다. 즉, LED 전광판과 컨트롤러를 통해서 상황에 맞는 정보를 적절하게 지속적으로 변경하는 것이 기존의 방 식으로 는 적합하지 않다. 이에, 한국등록특허[10-1676908]에서는, 스마트폰을 이용한 실시간 LED 전광판 시스템 및 그 출력 방법 을 개시 하고 있다. 한편, LED 전광판 자체의 용도는 고객들에게 일방적으로 정보나 광고 컨텐츠 등을 제공하는 것이지만, 주변상황 에 대하여 고려하거나 주변상황을 분석하여 그 결과에 따른 안내 정보나 필요한 컨텐츠를 제공하는 것은 불가능 하다."}
{"patent_id": "10-2023-0016454", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상기한 바와 같은 문제점을 해결하기 위하여 안출된 것으로, 본 발명의 목적은 사용 자 단말 기의 제어에 따라 노출되는 컨텐츠 정보를 실시간으로 변경하는 것이 가능하며, 각 출력부에 구비된 입력부를 통해 획득한 영상으로부터 주변상황을 인식하여 인식된 정보를 분석 및 학습함으로써 인공지능 기반의 분석 결 과에 따른 컨텐츠 정보를 출력하는 것이 가능한 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템 및 그 방법을 제공하는 것이다. 본 발명의 실 시예들의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적 들은 아"}
{"patent_id": "10-2023-0016454", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0016454", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템에 있어서, 사용자의 제어에 따라 노출되는 제1 컨텐츠 정보를 실시간으로 변경하여 출력 하고, 주변상황을 인식하여 인식된 주변상황정보를 분석 및 학습한 결과에 따른 제2 컨텐츠 정보를 출력하기 위 한 스마트 디스플레이 장치; 사용자로부터 상기 스마트 디스플레이 장치를 제어하기 위한 출력 제어 신호 를 입력받기 위한 사용자 단말기; 및 상기 사용자 단말기를 통해 입력받은 상기 출력 제어 신호를 상기 스 마트 디스플레이 장치로 전송하고, 상기 스마트 디스플레이 장치로부터 분석 및 학습한 결과를 전달받고, 상기 제2 컨텐츠 정보의 출력 이력을 수신하여 저장하기 위한 디스플레이관리서버를 포함하고, 상기 스마트 디 스플레이 장치는, 주변상황을 감지하기 위한 다수의 입력부(101 내지 104); 상기 제1 컨텐츠 정보 또는 상 기 제2 컨텐츠 정보를 출력하는 다수의 출력부(106 내지 109); 및 상기 출력 제어 신호에 따른 상기 제1 컨텐츠 정보를 상기 다수의 출력부로 출력하도록 제어하고, 상기 다수의 입력부를 통해 획득한 영상을 인공지능 기반으 로 인식, 분석 및 학습하여, 그 결과에 따른 상기 제2 컨텐츠 정보를 상기 다수의 출력부로 출력하도록 제어하 기 위한 상기 디스플레이 제어부를 포함하는 것을 특징으로 한다. 상기 디스플레이 제어부는, 상기 디스플레이관리서버, 상기 다수의 입력부, 및 상기 다수의 출력부 와 데이 터를 송수신하기 위한 송수신부; 인공지능 기반 알고리즘에 따라 상기 다수의 입력부로부터 전달받은 데이 터로부터 주변상황을 인식하기 위한 인식부; 상기 인공지능 기반 알고리즘에 따라 주변상황의 인식 결과를 분석하여 출력할 제2 컨텐츠 정보를 결정하기 위한 분석부; 상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과 및 출력된 제2 컨텐츠 정보를 학습하기 위한 학습부; 출력할 제2 컨텐츠 정보 및 상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과, 및 출력된 제2 컨텐츠 정보의 출력 이력을 저장하고 있는 저장부 ; 및 상기 송수신부, 상기 인식부, 상기 분석부, 상기 학습부 및 상기 저장부 를 포함한 각 구성요소를 제어하기 위한 제어부를 포함하는 것을 특징으로 한다. 상기 인식부는, 객체 탐지(Object Detection) 기술 및 합성곱신경망(CNN: Convolutional Neural Network) 기술을 이용하여 상기 영상에 포함된 사물을 인식하는 것을 특징으로 하고, 상기 분석부는, 상기 인식한 사물의 키워드를 추출하고, 상기 추출된 키워드를 이용하여 상기 다수의 출력부에 출력할 제2 컨텐츠 정보를 검 색하는 것을 특징으로 한다. 상기 학습부는, 출력된 제2 컨텐츠 정보를 학습하여, 상기 출력된 제2 컨텐츠 정보에 대한 새로운 키워드 를 분류 및 업데이트하는 것을 특징으로 한다. 또한, 상기한 바와 같은 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스 플레이 장치의 제어 방법에 있어서, 디스플레이관리서버를 통해 사용자 단말기로부터 전달받은 출력 제어 신호에 따른 제1 컨텐츠 정보를 다수의 출력부를 통해 출력하는 제1컨텐츠정보출력단계(S520); 다수의 입력부를 통해 주변상 황을 감지 및 입력받는 입력단계(S530); 및 인공지능 기반 알고리즘에 따라 상기 주변상황을 인식하고, 인식된 주변상황정보를 분석 및 학습한 결과에 따른 제2 컨텐츠 정보를 상기 다수의 출력부를 통해 출력하는 제2컨텐츠 정보출력단계(S540)를 포함하고, 상기 제2컨텐츠정보출력단계(S540)는, 상기 인공지능 기반 알고리즘에 따라 상 기 다수의 입력부로부터 전달받은 영상으로부터 주변상황을 인식하는 인식단계(S541); 상기 인공지능 기반 알고 리즘에 따라 주변상황의 인식 결과를 분석하여 출력할 제2 컨텐츠 정보와 관련된 키워드를 추출하는 분석단계 (S542); 추출된 키워드를 이용하여 출력할 제2 컨텐츠 정보를 검색하는 검색단계(S543); 상기 다수의 출력부를 통해 상기 검색된 제2 컨텐츠 정보를 출력하는 출력단계(S544); 및 상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과, 및 출력된 제2 컨텐츠 정보를 학습하는 학습단계(S545)를 포함하는 것을 특징으로 한다. 상기 인공지능 기반 스마트 디스플레이 장치의 제어 방법은, 상기 인공지능 기반 알고리즘에 따라 분석 된 분석 결과, 출력된 제2 컨테츠 정보의 출력 이력, 새롭게 분류 및 업데이트된 키워드를 상기 디스플레이관리서버로 전송하는 전송단계(S550)를 더 포함하는 것을 특징으로 한다. 상기 인식단계(S541)는, 객체 탐지(Object Detection) 기술 및 합성곱신경망(CNN: Convolutional Neural Network) 기술을 이용하여 상기 영상에 포함된 사물을 인식하는 것을 특징으로 한다. 상기 제1 컨텐츠 정보 및 상기 제2 컨텐츠 정보는, 닷넷(.NET) 프로그래밍, 및 마이크로소프트 파운데이 션 클래 스(MFC : Microsoft Foundation Class) 라이브러리를 사용하여 설계된 디스플레이프로그램에 의해 상기 다수의 출력부로 표시되는 것을 특징으로 한다. 본 발명의 일 실시예에 따르면, 상기 인공지능 기반 스마트 디스플레이 장치의 제어 방법을 구현하기 위 한 프로 그램이 저장된 컴퓨터 판독 가능한 기록매체가 제공되는 것을 특징으로 한다. 아울러, 본 발명의 일 실시예에 따르면, 상기 인공지능 기반 스마트 디스플레이 장치의 제어 방법을 구 현하기 위해, 컴퓨터 판독 가능한 기록매체에 저장된 프로그램이 제공되는 것을 특징으로 한다."}
{"patent_id": "10-2023-0016454", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템 및 그 방법 에 의하 면, 사용자(스마트 디스플레이 장치 소유자)가사용자 단말기를 통해 스마트 디스플레이 장치에 출력할 정보(문 구, 광고 파일, 오디오 광고 파일 등)를 직접 입력하고 송신하여 다수의 출력부(예: 스크린 형태 전광판)에 출 력되도록 함으로써, 사용자가 원하는 문구나 광고를 실시간으로 편리하게 편집하여 변경할 수 있는 효과가 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템 및 그 방법 에 의하면, 다수의 입력부를 통해 획득한 영상으로부터 주변상황을 인식하여 인식된 정보를 분석 및 학습함으로 써 인공지능 기반 알고리즘에 따른 적합한 컨텐츠 정보(예: 광고 컨텐츠)를 다수의 출력부를 통해 적재적소에서 노출하여 광고 효율을 높일 수 있는 효과가 있다. 또한, 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템 및 그 방법 에 의하면, 기존에는 각 출력부마다 통신모듈이 설치되어 있어 다수의 출력부를 제어하기 위해서는 통신비용이 출력부의 개수만큼 소요되는 단점이 있었으나, 하나의 사용자 단말기로 다수의 출력부(예를 들어, 전광판, 광고 매체)를 한 번에 제어하는 것이 가능하므로, 통신비용이 한 번만 소요되므로 경제적인 효과가 있다."}
{"patent_id": "10-2023-0016454", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들을 도면에 예 시하고 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성 요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때 에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 명세서에서 사용되는 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하 려는 의 도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 공정, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 공정, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 일반적으 로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미가 있 는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명을 더욱 상세하게 설명한다. 이에 앞서, 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정하여 해석되어서는 아니 되며, 발명자는 그 자신의 발명을 가 장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여, 본 발명의 기술 적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 또한, 사용되는 기술 용어 및 과학 용어에 있어서 다"}
{"patent_id": "10-2023-0016454", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "른 정의가 없다면, 이 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 통상적으로 이해하고 있는 의미를 가지며, 하기의 설명 및 첨부 도면에서 본 발명의 요지를 불필요하게 흐릴 수 있는 공지 기능 및 구성에 대한 설명은 생략한다. 다음에 소개되는 도면들은 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 예로서 제공되는 것이다. 따라서, 본 발명은 이하 제시되는 도면들에 한정되지 않고 다른 형태로 구체화될 수도 있다. 또한, 명세서 전반에 걸쳐서 동일한 참조번호들은 동일한 구성요소들을 나타낸다. 도면들 중 동일한 구성 요소들은 가능한 한 어느 곳에서든지 동일한 부호들로 나타내고 있음에 유의해야 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템의 구성도이 다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치를 포함하 는 제어 시스템은, 스마트 디스플레이 장치, 사용자 단말기, 및 디스플레이관리서버를 포함한다. 상기 스마트 디스플레이 장치는 다수의 출력부 및 다수의 입력부를 구비하며 사용자의 제어에 따라 노출되 는 제1 컨텐츠 정보를 실시간으로 변경하여 출력하고, 주변상황을 인식하여 인식된 주변상황정보를 분석 및 학 습한 결과에 따른 제2 컨텐츠 정보를 출력한다. 상기 사용자 단말기는 사용자가 상기 스마트 디스플레이 장치에 구비된 다수의 출력부에 디스 플레이 되는 컨텐츠 정보를 설정 및 제어하기 위한 출력 제어 신호를 입력받는다. 상기 출력 제어 신호는, 사용자 단말 기의 식별자, 스마트 디스플레이 장치의 식별자, 각 출력부의 식별자, 출력부에 출력될 내용, 각 출력부에 출력 된 내용에 해당하는 식별자, 및 출력되는 시간 등을 포함할 수 있다. 디스플레이관리서버는 통신 네트워크를 통하여 다수의 사용자 단말기와 통신하며, 상기 사용 자 단말 기로부터 해당 스마트 디스플레이 장치를 제어하는데 필요한 데이터를 수신받거나, 상기 사용자 단말 기로부터 전달받은 데이터를 상기 해당 스마트 디스플레이 장치로 전송할 수 있다. 상세하게는, 상기 디스플레이관리서버는 상기 사용자 단말기를 통해 입력받은 상기 출력 제어 신호를상기 스마트 디스플레이 장치로 전송하고, 상기 스마트 디스플레이 장치로부터 분석 및 학습한 결과 를 전달받고, 상기 제2 컨텐츠 정보의 출력 이력을 수신하여 저장한다. 또한, 상기 디스플레이관리서버는 상기 스마트 디스플레이 장치로부터 전달받은 인공지능 기반 제2 컨텐츠 정보 출력 이력 및 이와 관련된 분석 결과를 사용자 단말기로 전송할 수 있다. 여기서, 통신 네트워크는 유선 및 무선 등과 같은 그 통신 양태를 가리지 않고 구성될 수 있으며, 근거 리 통신 망(LAN: Local Area Network), 도시권 통신망(MAN: Metropolitan Area Network), 광역 통신망(WAN: Wide Area Network), 저전력광대역무선통신망(LPW: ANLow-Power Wide-Area Network), 및 로라(LoRa, Long Range) 등 다양 한 통신망으로 구성될 수 있다. 바람직하게는, 본 발명에서 말하는 통신 네트워크는 공지의 월드와이드웹(WWW; World Wide Web)일 수도 있다. 상기 사용자 단말기는 해당 스마트 디스플레이 장치를 제어하기 위해서 사용자가 통신 네트워 크를 통 하여 디스플레이관리서버에 접속한 후 통신할 수 있도록 하는 기능을 포함하는 디지털 기기로서, 개인용 컴퓨터(예를 들어, 데스크탑 컴퓨터, 노트북 컴퓨터 등), 워크스테이션, PDA, 웹 패드, 이동 전화기 등과 같이 메모리 수단을 구비하고 마이크로 프로세서를 탑재하여 연산 능력을 갖춘 디지털 기기라면 얼마든지 본 발명에 따른 사용자 단말기로서 채택될 수 있다. 사용자 단말기는 단말기 내에 설치된 어플리케이션(API)을 통해 상기 스마트 디스플레이 장치(10 0)를 제어 할 수 있으며, 통신 네트워크를 통한 웹페이지에 접속하여 상기 스마트 디스플레이 장치를 제어할 수 있다. 또한, 상기 사용자 단말기는 컨텐츠 제공자(광고주)의 단말기가 될 수 있다. 상기 사용자 단말기 는 단말기 내에 설치된 어플리케이션(API) 또는 웹페이지를 통해 상기 디스플레이관리서버에 접속하여 새롭게 제공되는 컨텐츠 정보를 업로드하는 것이 가능하다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치를 포함하 는 제어 시스템은 다수의 스마트 디스플레이 장치를 포함하여 구성될 수 있으며, 사용자 단말기도 다수 구비될 수 있지만, 설명의 편의를 위해 하나의 스마트 디스플레이 장치를 예로 들어 설명하기로 한다. 상기 스마트 디스플레이 장치는 다수의 입력부(101 내지 104), 디스플레이 제어부, 및 다수의 출력부(106 내지 109)를 포함한다. 한편, 여기서는 다수의 입력부는 제1 입력부 내지 제4 입력부를 포함하는 것으로 설명하였으 며, 다수 의 출력부는 제1 출력부 내지 제4 출력부를 포함하는 것으로 설명하였으나, 다수의 입력부 및 다수의 출력부의 개수는 이에 한정되지 않는다. 상기 다수의 입력부(101 내지 104)는 출력부가 설치된 장소의 주변상황을 감지한다. 제1 입력부 내 지 제4 입력부 각각은 주변 상황을 인식하기 위한 카메라 및 다수의 센서들을 포함할 수 있다. 상기 다수의 출력부(106 내지 109)는 상기 제1 컨텐츠 정보 또는 상기 제2 컨텐츠 정보를 출력한다. 제1 출력부 내지 제4 출력부 각각은 종래의 일반적인 LED 전광판 형태의 표시부 또는 스크린 형태의 표시부가 될 수 있다. 상기 디스플레이 제어부는 일종의 컴퓨터로, 상기 사용자 단말기의 제어에 따른 출력 제어 정 보를 수 신하면, 상기 출력 제어 신호에 따른 상기 제1 컨텐츠 정보를 상기 다수의 출력부(106 내지 109)로 출력하도록 제어하고, 상기 다수의 입력부(101 내지 104)를 통해 획득한 영상을 인공지능 기반으로 인식, 분석 및 학습하여, 그 결과에 따른 상기 제2 컨텐츠 정보를 상기 다수의 출력부(106 내지 109)로 출력하도록 제어한다. 일예로, 상기 디스플레이 제어부는 라즈베리파이로 구현될 수 있다. 라즈베리파이는 영국의 라즈베리파이 재단이 학교에서의 기초 컴퓨터 과학 교육용 프로젝트의 목적으로 개발한 신용카드 크기의 초소형/초저가 PC이다. 2006년에 개념이 형성되고 재단이 만들어져 2012년 처음 제품이 나온 이후 2013년 1월 초에 백만 대가 판매되었다. 라즈베리파이의 특징은 아두이노와 달리 키보드, 마우스, 모니터 만 연결하면 PC가 될 수 있다. 즉 일반 데스크톱과 유사하다는 것이 강조되는 제품이다. Linux OS를 기반으로 하고 세부적인 설정을 제공함으로써 초보 프로그래머에 맞춤형 환경을 제공한다. 디스플레이 제어프로그램은 일 예로 가장 많이 사용되는 닷넷(.NET) 프로그래밍, 및 마이크로소프트 파 운데이션 클래스(MFC : Microsoft Foundation Class) 라이브러리를 사용하여 설계될 수 있다. 마이크로소프트 파운데이션 클래스 라이브러리(MFC Library)는 C++용 프로그램 라이브러리로, 윈도용 응용 프로그램의 통합 개발 환경인 마 이크로소프트 비주얼 C++에 부속되는 클래스 라이브러리이다. 본 발명에 따른 스마트 디스플레이 장치의 디스플레이 제어부는 다수개의 출력부(106 내지 109)와 연 결되어 있어, 다수의 출력부(106 내지 109)를 한 번에 제어하는 것이 가능하다. 기존에는 각 출력부마다 통신모듈이 설치되어 있어 다수의 출력부를 제어하기 위해서는 통신비용이 출력 부의 개 수만큼 소요되는 단점이 있었으나, 하나의 사용자 단말기로 다수의 출력부(예를 들어, 전광판, 광고 매 체)를 한 번에 제어하는 것이 가능하므로, 통신비용이 한 번만 소요된다. 도 2는 도 1의 디스플레이 제어부의 상세 구성도이다. 도 2에 도시된 바와 같이, 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치를 포함하 는 제어 시스템의 디스플레이 제어부는 송수신부, 제어부, 저장부, 인식부, 분석부 및 학습부를 포함한다. 상기 송수신부는 상기 디스플레이관리서버, 상기 다수의 입력부(101 내지 104), 및 상기 다수 의 출력 부(106 내지 109)와 데이터를 송수신한다. 예를 들어, 상기 사용자 단말기로부터 출력 제어 신호 및 새로 업데이트 되는 컨텐츠 정보(광고 등)들을 상기 디스플레이관리서버로부터 통신망을 통해 수신하고, 설치된 지역의 주변상황에 따라 인공지능 알고리즘 기 반 출력된 컨텐츠 정보에 대한 출력 이력 및 그에 대한 분석 결과를 디스플레이관리서버로 전송할 수 있다. 상기 저장부는 상기 송수신부를 통해 수신한 사용자의 출력 제어 신호, 상기 사용자의 출력 제어 신 호에 따라 출력할 제1 컨텐츠 정보, 출력할 제2 컨텐츠 정보들(문구, 광고, 영상광고 등), 상기 인공지능 기반 알고리즘에 따른 주변상황 인식 결과, 분석 결과 및 학습 내용을 저장하고 있으며, 출력된 제2 컨텐츠 정보의 출력 이력을 저장한다. 상기 인식부는 인공지능 기반 알고리즘에 따라 상기 다수의 입력부(101 내지 104)로부터 전달받은 데이터 로부터 주변상황을 인식한다. 상기 분석부는 상기 인공지능 기반 알고리즘에 따라 주변상황의 인식 결과를 분석하여 출력할 제2 컨텐츠 정보를 결정한다. 상기 학습부는 상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과 및 출력된 제2 컨텐츠 정보 를 학습 한다. 상기 제어부는 상기 송수신부, 상기 인식부, 상기 분석부, 상기 학습부 및 상기 저장 부를 포함한 각 구성요소를 제어한다. 상기 송수신부, 상기 제어부, 상기 저장부, 상기 인식부, 상기 분석부, 및 상기 학습 부는 그 중 적어도 일부가 상기 스마트 디스플레이 장치와 통신하는 프로그램 모듈들일 수 있다. 이 러한 프로그램 모듈들은 운영 시스템, 응용 프로그램 모듈 및 기타 프로그램 모듈의 형태로 상기 스마트 디스플 레이 장치에 포함될 수 있으며, 물리적으로는 여러 가지 공지의 기억 장치 상에 저장될 수 있다. 또한, 이 러한 프로그램 모듈들은 상기 스마트 디스플레이 장치와 통신 가능한 원격 기억 장치에 저장될 수도 있다. 한편, 이러한 프로그램 모듈들은 본 발명에 따라 후술할 특정 업무를 수행하거나 특정 추상 데이터 유형을 실행 하는 루틴, 서브루틴, 프로그램, 오브젝트, 컴포넌트, 데이터 구조 등을 포괄하지만, 이에 제한되지는 않는다. 상기 인식부는, 객체 탐지(Object Detection) 기술 및 합성곱신경망(CNN: Convolutional Neural Network) 기술을 이용하여 입력부를 통해 전달받은 영상에 포함된 사물을 인식한다. 객체 탐지(Object Detection)는, 컴퓨터 비전과 이미지 프로세싱에 연관된 기술로 외부로부터 들여온 영 상, 이 미지 중 특정 개체를 추적 및 인식하는 기술이다. 객체 탐지 기술을 이용하여 얼굴인식기술이 상용화될 수 있었 다. 합성곱신경망(CNN: Convolutional Neural Network)은 심층 신경망(DNN: Deep Neural Network)의 한 종 류로, 하 나 또는 여러 개의 콘볼루션 계층(convolutional layer)과 통합 계층(pooling layer), 완전하게 연결된 계층 (fully connected layer)들로 구성된 신경망이다. 합성곱신경망은 2차원 데이터의 학습에 적합한 구조를 가지고 있으며, 역전달(Backpropagation algorithm)을 통해 훈련될 수 있다. 영상 내 객체 분류, 객체 탐지 등 다양한 응용 분야에 폭넓게 활용되는 DNN의 대표적 모델 중 하나이다. 합성곱신경망(CNN)은 이전기술인 다층신경망 (MLNN : Multi-Layer Neural Network)의 단점을 보완한 기술로 3차원데이터를 입력하고 3차원 데이터 형식으로 출력하여 형상유지에 용이하며 입력데이터의 크기, 회전, 변형과 같은 데이터 본질에 영향을 주지 않는 변화가 있을 경우 발생하는 문제점을 보완한 기술이다. 합성곱신경망(CNN)에 대해서는 도 4를 참조하여 자세히 설명하 기로 한다. 상기 분석부는, 상기 인식한 사물의 키워드를 추출하고, 상기 추출된 키워드를 이용하여 상기 다수 의 출력 부에 출력할 제2 컨텐츠 정보를 검색한다. 상기 학습부는, 출력된 제2 컨텐츠 정보를 학습하여, 상기 출력된 제2 컨텐츠 정보에 대한 새로운 키워드 를 분류 및 업데이트한다. 또한, 학습부에서 새롭게 분류 및 업데이트된 컨텐츠 정보에 대한 키워드는 상기 송수신부를 통해 디 스플레이관리서버로 전송되어 저장된다. 도 3은 본 발명에 적용되는 합성곱신경망에 대하여 설명하기 위한 설명도이다. 도 3은 1989년 LeCun et al. 의 Convolutional Neural Networks을 참조하였다. 도 3에 도시된 바와 같이, 합성곱신경망(CNN)은 지역 수용 영역(local receptive field) 단계, 합성곱 (convolution) 단계 및 풀링(pooling) 단계를 포함하여 구성된다. 지역 수용 영역 단계에서, 첫 번째 레이어의 영역에 해당하는 뉴런은 다음 레이어의 하나의 뉴런으로 표 현된다. 지역 연관성을 이용하는 이유는 일반적으로 이미지의 특징이 한데 모여있고 연관성이 강하기 때문이다. 예를 들 어, 얼굴에서 눈을 찾으려면 눈에 해당하는 픽셀이 비슷한 좌표에 모여 있어서 특성을 추출하기가 쉽다. 합성곱신경망(CNN)의 특징 중 하나는 지역 연결성으로 데이터의 일부분이 다른 부분과 연관성이 있을 수 있다고 가정하는 것이다. 히든 레이어(hidden layer)는 지역 수용 영역에 해당하는 데이터를 받아들여 그 외의 부분은 참조 하지 않는다. 지역적으로 연결된 여러 개의 계층을 추가한 뒤에 입력 데이터를 처리한다면 딥러닝 기본 원 리에 따라 추상화 성능이 증가한다. 배열형태의 데이터에서 지역 연관성을 이용하는 이유는 일반적으로 입력 데 이터인 이미지는 특징이 한군데 모여 있기 때문이다. 합성곱Convolution 단계에서는, 픽셀 영역별로 시프트를 해가면서 다음 레이어의 뉴런과 연결하는 작업 을 진행 한다. 예를 들어, 28x28픽셀의 이미지를 5x5영역으로 나누면 은닉레이어의 크기는 24x24픽셀이 된다. 은닉레이 어의 각 뉴런은 편향값bias과 5x5의 가중치값을 가지고 있다. 이 값들은 입력데이터마다 위치가 변경되어도 같 은 특징을 인식한다. 서로 공유하는 이유로 각각 공유가중치(shared weights)와 공유편향(shared biases)이라고 부른다. 합성곱 레이어는 여러개의 특징지도(feature map)를 가진다. 즉, 3개의 특징 지도를 가진다면 3x24x24 로써 각각 5x5(25개)의 가중치 값*3과 1개 bias값 *3 해서 총 78개의 값만 있으면 된다. 풀링 단계에서는, 풀링 레이어는 합성곱 레이어의 특징을 압축한 특징 지도를 형성한다. 일반적으로 합 성곱 레 이어의 2x2영역을 하나의 뉴런으로 만들어 3x12x12의 정보로 이루어질 수 있다. 마지막 출력 레이어는 최대값 풀링 레이어의 모든 뉴런과 완전 연결되어 출력 값이 어떤 클래스에 해당하는지 파악되는데 사용한다. 도 4는 도 2의 인식부에 수행되는 인식 결과를 설명하기 위한 일실시예 설명도이다. 본 발명에 따른 인식부는 일예로, 구글의 텐서 플로우(Tensor Flow)를 사용할 수 있다. 텐서 플로우는 데이터 플로 그래프를 활용해 수치 계산을 하여, 딥 러닝(Deep Learning)과 머신 러닝 (Machine Learning) 등에 활용하기 위해 개발된 오픈소스 소프트웨어이다. 도 4는 텐서 플로우(Tensor flow)를 활용한 객체 탐지(Object Detection) 결과의 일예를 나타낸다. 도 4는 구 글의 리서치 블로그(Google Research Blog)에 발표된 내용에서 참조하였다. 사각형 내부가 인식한 물체이며 그 위에 주석으로 인식 결과와 정확도를 나타내고 있다. \"인식결과 : 정 확도\"로 표시되어 있으며, 예를 들어,\"person : 99% \"로 표시되어 있다. 도 5는 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치의 제어 방법의 흐름도이다. 먼저, 디스플레이관리서버를 통해 사용자 단말기로부터 출력 제어 신호를 입력받았는지 판단 한다 (S510). 상기 판단 단계(S510)의 판단 결과, 사용자 단말기로부터 출력 제어 신호를 입력받았으면, 전달받 은 출력 제어 신호에 따라 다수의 출력부(106 내지 109)를 통해 상기 출력 제어 신호에 대응하는 제1 컨텐츠 정보를 출 력한다(S520). 한편, 상기 판단 단계(S510)의 판단 결과, 사용자 단말기로부터 출력 제어 신호를 입력받지 않았으 면, 다 수의 입력부(101 내지 104)를 통해 주변상황을 감지 및 입력받는다(S530). 이후, 인공지능 기반 알고리즘에 따라 상기 주변상황을 인식하고, 인식된 주변상황정보를 분석 및 학습 한 결과 에 따른 제2 컨텐츠 정보를 상기 다수의 출력부를 통해 출력한다(S540). 상기 \"S540\"단계(제2컨텐츠정보출력단계)는 하기 상세 단계를 포함한다. 상기 인공지능 기반 알고리즘에 따라 상기 다수의 입력부(101 내지 104)로부터 전달받은 주변상황을 인 식한다 (S541). 상기 인식단계(S541)에서는, 객체 탐지(Object Detection) 기술 및 합성곱신경망(CNN: Convolutional Neural Network) 기술을 이용하여 상기 영상에 포함된 사물을 인식할 수 있다. 예를 들어, 텐서 플로우를 통해 상기 영 상에 포함된 사물을 인식할 수 있다 이후, 상기 인공지능 기반 알고리즘에 따라 주변상황의 인식 결과를 분석하여 출력할 제2 컨텐츠 정보와 관련된 키워드를 추출한다(S542). 추출된 키워드를 이용하여 출력할 제2 컨텐츠 정보를 검색한다(S543). 여기서, 추출된 키워드를 상기 디 스플레 이관리서버로 전송하여, 그에 대응하는 제2컨텐츠 정보를 검색할 수도 있고, 저장부에 저장되어 있는 키워드와 그에 해당하는 컨텐츠 정보로부터 검색할 수도 있다. 이후, 상기 다수의 출력부(106 내지 109)를 통해 상기 검색된 제2 컨텐츠 정보를 출력한다(S544). 상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과 및 출력된 제2 컨텐츠 정보를 학습한다(S545). 이후, 상기 인공지능 기반 알고리즘에 따라 분석된 분석 결과, 출력된 제2 컨테츠 정보의 출력 이력, 새 롭게 분 류 및 업데이트된 키워드를 상기 디스플레이관리서버로 전송한다(S550). 상기 디스플레이관리서버로 전달된 데이터는 날짜나 시간과 같은 특정기준에 따라 마련하여 저장될 수 있 으며, 일정 기간 데이터를 누적하여 저장한 이후, 누적된 데이터에 대한 분석 결과를 컨텐츠 제공자(사용자, 광 고주)에게 제공할 수도 있다. 한편, 상기 제1 컨텐츠 정보 및 상기 제2 컨텐츠 정보는, 닷넷(.NET) 프로그래밍, 및 마이크로소프트 파 운데이 션 클래스(MFC : Microsoft Foundation Class) 라이브러리를 사용하여 설계된 디스플레이프로그램에 의해 상기 다수의 출력부(106 내지 109)로 표시될 수 있다. 이상에서 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치의 제어 방법에 대하여 설 명하였지 만, 인공지능 기반 스마트 디스플레이 장치의 제어 방법을 구현하기 위한 프로그램이 저장된 컴퓨터 판독 가능 한 기록매체 및 인공지능 기반 스마트 디스플레이 장치의 제어 방법을 구현하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 프로그램 역시 구현 가능함은 물론이다. 즉, 상술한 인공지능 기반 스마트 디스플레이 장치의 제어 방법은 이를 구현하기 위한 명령어들의 프로 그램이 유형적으로 구현됨으로써, 컴퓨터를 통해 판독될 수 있는 기록매체에 포함되어 제공될 수도 있음을 당업자들이 쉽게 이해할 수 있을 것이다. 다시 말해, 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어, 컴퓨터 판독 가능한 기록매체에 기록될 수 있다. 상기 컴퓨터 판독 가능한 기록매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터 판독 가능한 기록 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당 업자에게 공지되어 사용 가능한 것일 수도 있다. 상기 컴퓨터 판독 가능한 기록매체의 예에는 하드 디스크, 플 로피 디스크 및 자기테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램 (RAM), 플래시 메모리, USB 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장 치가 포함된다. 상기 컴퓨터 판독 가능한 기록매체는 프로그램 명령, 데이터 구조 등을 지정하는 신호를 전송하 는 반송파를 포함하는 광 또는 금속선, 도파관 등의 전송 매체일 수도 있다. 프로그램 명령의 예에는 컴파일러 에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨 어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 본 발명은 상기한 실시예에 한정되지 아니하며, 적용범위가 다양함은 물론이고, 청구범위에서 청구하는 본 발명 의 요지를 벗어남이 없이 다양한 변형 실시가 가능한 것은 물론이다."}
{"patent_id": "10-2023-0016454", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치를 포함하는 제어 시스템의 구성도. 도 2는 도 1의 디스플레이 제어부의 상세 구성도. 도 3은 본 발명에 적용되는 합성곱신경망에 대하여 설명하기 위한 설명도. 도 4는 도 2의 인식부에 수행되는 인식 결과를 설명하기 위한 설명도. 도 5는 본 발명의 일 실시예에 따른 인공지능 기반 스마트 디스플레이 장치의 제어 방법의 흐름도."}
