{"patent_id": "10-2017-0162726", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0063729", "출원번호": "10-2017-0162726", "발명의 명칭": "사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한", "출원인": "주식회사 넥토마이닝", "발명자": "박승흠"}}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나 이상의 카메라와 디지털 비디오 레코더(NVR) 및 영상 분석 소프트웨어를 구비하는 CCTV 카메라 시스템; 재난 상황을 감지한 센서 데이터를 전송하는 적어도 하나 이상의 IoT 기반 센서; 상기 IoT 기반 센서로부터 감지된 센서 패킷 데이터들을 무선 센서 네트워크(USN, WSN, 6LoWPAN, MQTT), Wi-Fi, NB-IoT를 이용한 센서 네트워크, 이동통신망(LTE), LoRa 네트워크, 이더넷 중 어느 하나의 네트워크를 통해 수신받아 프로토콜을 변환하여서버로 전송하는 IoT 게이트웨이; 및 상기 어느 하나의 네트워크를 통해 상기 IoT 기반 센서로부터 감지된 센서 데이터들을 수집하여 저장하며, 센서데이터 모니터링 및 센서노드 정보 관리 및 제어 시스템을 구비하며, 센서 데이터를 수집하여 빅 데이터를 분석하는 IoT 기반 센서 네트워크와 연결되는 모비우스 서버, 상기 CCTV 카메라 시스템과 연결되고 인공 지능의 딥러닝 기반의 영상의 객체를 검출하여 재난 상황 영상분석/상황인지/영상의 객체를 추적하는 영상 분석 서버와,사회 재난 발생 유형별 빅 데이터 분석하여 재난 대응 조치를 취하는 IDS 관제 시스템을 포함하며, IDS 관제 시스템은 다수의 IDS 로컬 관제 시스템과 IDS 통합 관제 시스템으로 구성되며, IDS 로컬 관제 시스템은 IDS 폴과 연동되는, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 센서들은 강우 센서, 수위 센서, 유속 센서, 풍속 센서, 위험 지역에 설치된 마이크 센서, 화재 감지센서, 가스 감지 센서, 인체 감지 센서를 사용하며, 센서 네트워크(USN, WSN, 6LoWPAN, MQTT), Wi-Fi 무선 랜,이동통신망(LTE-M), NB-IoT, LoRa 네트워크 중 어느 하나 이상의 네트워크를 통해 게이트웨이를 통해 상기 모비우스 서버의 인명 지킴이 시스템과 재난 대응 시스템으로 센서 데이터 인 강우량, 하천 수위, 유속, 풍속 정보,마이크 센서 정보(비명 소리), 화재 감지 정보, 가스 감지 정보, 인체 감지 정보를 전송하며,상기 모비우스 서버는 마이크 센서를 이용한 비명소리에 의한 이벤트 감지 기능을 제공하는, 사회재난 대응을위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 적어도 하나 이상의 IoT 기반 센서는 센싱 정보를 감지하는 측정부; 센서 측정을 위해 각 기능을 제어하는 제어부; 상기 제어부와 연결되며 센서 데이터를 저장하는 저장부; 무선 센서 네트워크(USN, WSN, 6LoWPAN, MQTT), Wi-Fi, NB-IoT를 이용한 센서 네트워크, 이동통신망(LTE),LoRa 네트워크, 이더넷(Ethernet) 중 어느 하나의 통신 프로토콜을 통해 센서 데이터를 전송하는 무선 통신부; IoT 프로토콜을 제공하는 프로토콜 스택부; 및 디바이스 드라이버; 및 센서 노드에 전원을 공급하는 전원 공급부를 포함하며, IoT 기반 센서 네트워크 통신 프로토콜을 연동하기 위한 센서 어댑터를 더 포함할 수 있으며, 상기 센서 데이터는 센서 노드ID, 센서 장치 ID, 센서 데이터 값을 포함하는 사회재난 대응을 위한 융복합기술기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템.공개특허 10-2019-0063729-3-청구항 4 제3항에 있어서, 상시 전원 공급부는 태양 전지 어레이와 충전 콘트롤러와 DC-DC 컨버터와 축전지를 구비하며, 태양열을 사용하여 소정의 정격 전원을 공급하는 태양전지부를 더 포함하는 사회재난 대응을 위한 융복합기술 기반의 카메라와센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 지향성 스피커는 지상의 폴대에 고정된 고정형 가변출력 지향성 스피커(고정형 지향성 스피커)와, 및/또는이동 차량의 폴대에 고정된 가변출력 지향성 스피커(이동형 지향성 스피커)를 구비하며, 상기 지향성 스피커는 방사각도와 팬/틸트 조절이 가능하며, 모터제어신호 수신기와 상기 모터에 의해 지향성스피커의 단계별 방사 각도를 조절하고 단계별 음압 레벨을 조절하여 가청 대역 음성 신호(가청 신호) 및 비가청 대역 신호(비가청 신호)를 출력하는 실내 각 지역에 설치된 방사각도와 팬/틸트 조절이 가능한 지향성 스피커 인 것을 특징으로 하며, 상기 지향성 스피커의 방사각도와 팬/틸트 조절을 위한 지향성 스피커 다중 제어 시스템을 더 구비하는, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 지향성 스피커 다중 제어 시스템은 카메라와 IR LED가 설치된 PTZ 제어기의 방사 각도와 팬/틸트를 조절하며 스피커의 볼륨을 조정하는 지향성 스피커 제어기, 상기 지향성 스피커 제어기에 의해 설정된 볼륨에 따라 음향이 출력되는 지향성 스피커 앰프, 전원을 공급하는 전원 공급부를 구비하는, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 지향성 스피커는 스피커 앰프 일체형 AMP로 설계하여 음압 레벨 출력 향상하여 90dB 이하 음압레벨, 750m최대 도달거리, 80m 음성 도달거리 향상, 최대 ±90° 방사각도, 방사 각도 자동 조절 시스템, 단계별 방사 각도 수동 조절, 영상 정보 및 센서 정보와 연계되는 음성 정보 제공, 투명 방수 커버가 사용되는, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 영상 분석 서버는 상기 CCTV 카메라 시스템과 연동되며, 행동인지 기반 영상 내 객체 추적을 위한 딥러닝기술 중 합성곱 신경망(CNN) 구조의 특징맵 정보를 객체의 특징 정보를 사용하여 이전 영상, 현재 영상, 이전영상의 객체의 영역정보를 입력으로 받고 현재의 객체의 위치 정보를 결과로 출력하여 영상 내의 객체를 추적하는, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 영상 분석 서버는 영상의 객체를 추출하고 행동 인지 모델의 객체를 추적하기 위해 CNN 구조의 중간 몇 개의 convolutional layer에서 객체 위치영역과 종류 정보를 포함하는 특징지도를 추출하고, Pooling layer를 통과함에 따라 특징지도의 크기가 작아지는데 각기 다른 크기의 특징지도에서 객체 위치영역 정보를 추출하기 때문에 크기(scale)에 강인한 객체를 검출하며, 영상 객체의 행동 인지 모델이 저장된 CNN 학습데이터와연계되며, 재난 감지 및 대응은 실시간성과 빠른 처리속도가 중요하므로 영상 내의 객체 검출의 처리속도가 빠공개특허 10-2019-0063729-4-른 SSD(Single Shot multi-box Detector) 또는 Faster RCNN 알고리즘을 사용하는, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 IDS 관제 시스템은 다수의 IDS 로컬 관제 시스템과 IDS 통합 관제 시스템으로 구성되며, 상기 IDS 로컬 관제 시스템은 모비우스 서버, 영상 분석 서버, 재난 대응 IDS 기반 인명 지킴이 시스템, 위험지역 인근 이동통신 단말기들로 재난 안내 문자 전송하는 피난 유도 시스템과 지향성 스피커를 통해 재난 경고방송과 대피 유도 기술을 제공하는 재난 대응 시스템, 지향성 스피커 다중 제어 시스템을 구비하며, 상기 재난 대응 시스템과 이동통신망의 SMS 서버와 연결되며, 상기 재난 대응 시스템과 연동된 지향성 스피커로부터 비가청 신호를 피난유도 앱(App)이 설치된 스마트 기기로 수신받아 출력하고, 상기 재난 대응 시스템으로부터 SMS 서버를 통해 상기 재난 예상 지역의 셀 커버리지에 있는 이동전화번호들로 재난 경보 문자를전송하는, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 피난 유도 시스템과 연동된 지향성 스피커로부터 가청 신호/비가청 신호를 스마트 기기의 스피커로 출력하며, 재난 지역의 위치와 재난 안내 문자를 통해 안전 지역으로 피난을 유도하는 피난유도 앱(App)이 설치된 스마트 기기로 전송하는, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 피난 유도 운영 시스템과 이동통신망을 통해 연결되며, 상기 피난 유도 시스템과 연동된 지향성 스피커로부터 가청 신호/비가청 신호를 스마트폰의 스피커로 출력하며, 해당 재난 지역의 재난 위치와 재난 상황 정보와피난 유도 경로를 제공받는 피난유도 앱(App)이 설치된 스마트 기기를 더 포함하며, 상기 스마트 기기는 스마트폰을 사용하며, 상기 모비우스 서버로부터 스마트폰의 피난유도 앱(지향성 스피커 기반 음원 방향 탐지용 안드로이드 기반 App)을 통해 비가청 대역의 안내 방송 수신 및 피난 유도를 제공받는, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 모비우스 서버는 상기 IDS 로컬관제 시스템의 일부분으로써 IDS 통합관제 시스템과 연동되어 영상과 음성,센서 데이터를 포함하는 각종 데이터를 전송하며, 상기 IDS 로컬 관제 시스템은 상기 모비우스 서버와 시계열 데이터베이스(TSDB), 영상 분석 서버(Video Server)의 영상, 센서 데이터와 음원 데이터를 모니터링하는 모니터링부, 컨트롤 모듈을 구비하며, 통신 미들웨어를통해 IDS 함체와 연동되고, 센서와 음원, 영상 데이터 수집과 분석 및 모니터링 기능, 상기 영상 분석 서버에의해 인공 지능의 딥러닝 기반의 영상의 객체를 검출하여 재난 상황 영상분석/상황인지/영상의 객체 추적 기능,지향성 스피커 제어를 위한 컨트럴 기능, 카메라 및 적외선 IR 조작을 위한 컨트럴 기능, Pan/Tilt 조작을 위한컨트럴 기능, 구난자 및 IDS 폴, 센서 위치 확인을 위한 모니터링 기능, 카메라로부터 획득되는 실시간 영상 확인 및 분석 기능, 모비우스 서버로부터 수신되는 실시간 센서 데이터확인 기능, 과거 센서 데이터 조회 기능,재난 문자를 전송하여 피난을 유도하는 피난 유도 시스템과 지향성 스피커를 통해 이동 차량 재난 경고 방송을제공하는 재난 대응 시스템에 연동하여 각각 피난 유도 기능(재난 문자 전송)과 재난 대응 기능(이동 차량 재난경고 방송)을 제공하며, IDS 폴 연동 기능을 제공하며, 상기 IDS 통합관제 시스템은 여러 지역에 분산된 설치된 다수의 IDS 로컬 관제 시스템과 연결되며, 각각의 IDS로컬 관제 시스템으로부터 재난 상황 정보를 수신하여 IDS 로컬관제 시스템 모니터링 기능을 제공하는, 사회재공개특허 10-2019-0063729-5-난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 IDS 폴은 실시간 영상 정보 획득을 위한 카메라, 야간 영상 촬영을 위한 IR LED, 구난자에게 경보방송 송출을 위한 지향성 스피커, 위험 지역 일상 주변 감시 및 구난자 타겟팅을 위한 Pan/Tilt 조절, 통신 미들웨어를통해 상기 IDS 로컬 관제 시스템의 일부분으로 사용되는 상기 모비우스 서버와 연결되는, 사회재난 대응을 위한융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 IDS 로컬관제 시스템은 관제 시스템, IDS 폴 제어기 함체와 IDS 폴 구난 함체를 포함하는 상기 IDS 폴을구비하며, 상기 관제 시스템은 IDS 로컬관제 시스템 서버(모비우스 서버), 스트리밍 서버, 상기 CCTV 카메라 시스템과 연동되는 상기 영상 분석 서버를 포함하며, 상기 IDS 폴 제어기 함체는 방사각도와 팬틸트를 제어하는 카메라와 IR LED가 탑재된 PTZ 제어기를 제어하며지향성 스피커의 볼륨을 조정하는 지향성 스피커 제어기, 설정된 볼륨에 따라 음향이 출력되는 지향성 스피커앰프, 전원을 공급하는 전원 공급부를 구비하며, 상기 IDS 폴 구난 함체는 상기 IDS 로컬 관제 시스템 서버(모비우스 서버)와 연결되며, 상기 지향성 스피커 제어기와 연결되는 상기 PTZ 제어기와, 상기 PTZ 제어기와 연결된 카메라와 IR LED를 구비하며, 상기 IDS 폴 제어기 함체의 상기 지향성 스피커 앰프와 연동되는 지향성 스피커 출력부를 구비하는, 사회재난대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템."}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템 은 ICT 기술을 사용하여 사회 재난을 감지하는 CCTV 카메라, 융복합 센서, IoT 센서 네트워크(USN, WSN, 6LoWPAN, Wi-Fi, NB-IoT, LTE, LoRa 네트워크), IoT 게이트웨이를 포함하는 사회재난 대응 IoT 센서 플랫폼 기 (뒷면에 계속)"}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사회재난 대응을 위한 인명지킴이 시스템에 관한 것으로, 보다 상세하게는 ICT 기술을 사용하여 재난 을 감지하는 CCTV 카메라, 융복합 센서, IoT 센서 네트워크(USN, WSN, 6LoWPAN, MQTT, Wi-Fi, NB-IoT, LTE, LoRa 네트워크), IoT 게이트웨이를 포함하는 사회재난 대응 IoT 센서 플랫폼 기술을 개발하고, 모비우스 서버, IDS 통합 관제 시스템과 IDS 로컬 관제 시스템, 영상 관제 시스템의 인공 지능 기반의 재난 상황 영상분석/상황 인지/영상의 객체 추적, 센서 데이터 모니터링, 위험 지역의 마이크 센서를 이용한 비명소리에 의한 이벤트 감 지 기능을 제공하며, 사회 재난 발생 유형 빅데이터 분석, 재난 대응 IDS 기반 인명 지킴이 시스템을 제공하며, 지향성 스피커를 사용한 재난 경고 방송과 대피 유도 기술을 제공하며, 센서 네트워크와 가변 출력이 가능한 지 향성 스피커 시스템을 사용한 피난유도 시스템, 스마트폰의 비가청 주파수를 활용한 유도 App을 제공하는, 사회 재난 대응을 위한 융복합기술 기반의 카메라, 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템에 관 한 것이다."}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사회재난의 발생 횟수 및 규모의 증가에 따라 직접 피해뿐만 아니라, 간접 피해로 인한 경제적 피해 규모 급증 하고 있으며, 이를 복구하기 위한 국가나 민간의 경제적 비용도 급증하고 있다. 재난의 발생유형이 매우 복잡해졌을 뿐만 아니라 기후변화 등 예측 불가능한 불확실성 요소들이 증가하고 있어 정보통신기술들을 사용해 종합적으로 대응하는 체계를 구축할 필요가 있으며, 예방중심의 재난대응 체계구축이 절실히 요구되고 있다. 사회재난 대응체계에 대하여, 안전 관련 정책의 결정은 \"재난 및 안전관리 기본법\" 제9조에 따라 국무총리가 위 원장이 되는 \"중앙안전관리위원회\"를 설치하여 재난 및 안전관리 정책을 심의하도록 하고 있으며, 실무검토를 위하여 하위에 국민안전처 장관이 주관하는 안전정책조정위원회, 지역단위 재난안전정책 검토를 위한 지역위원회를 각각 두고 있다. 자연재해를 비롯하여 대규모 사회재난에 대해서는 \"재난 및 안전관리 기본법\"제 14조에 따라 국민안전처 장관이 본부장이 되는 \"중앙재난안전 대책본부\"를 설치하여 재해대응 실무를 총괄하도록 하고 있으며, 사고수습을 위한 중앙 및 지역 사고수습본부를 설치하여 시도 및 시군구 단위의 재난안전 대책본부를 지휘할 수 있도록 하고 있 다. 또한. 재난정보의 공유를 위하여 중앙 재난안전 상황실과 지역단위 시도 재난안전상황실과 시군구 재난안전상황 실을 연결시켜 재난상황 정보를 공유하도록 체계를 구성하고 있다. 이를 위해, 기술적 측면에서, 사회재난의 조기·사전 대비를 위한 통신, 영상, 센서 등의 ICT 요소 기술을 사용 한 첨단 정보통신 기술을 재난안전 분야에 도입하여 적은 비용으로 효과적인 사회재난 예방체계를 구축할 필요 가 있다. 지자체의 방재관련 예산 및 인력 부족으로 실질적인 현장중심의 재난관리가 이뤄지기 어려우므로 자동 화 및 정보 기술을 활용하여 재난다발 지역을 효과적으로 관리하는 재난대응 체계 구축이 요구된다. 재난발생시 1차 재난에 대한 적절한 대응조치가 이뤄지지 못하는 경우 2차 재난으로 이어지는 경우가 많아 조기 경보 및 초기대응이 가능한 재난 관리체계가 필요하다. 다중이용 시설의 증가로 경우에 따라서는 사람들이 밀집한 장소로부터 많은 사람들을 일시에 대피시켜야 하는 문제가 발생하며, ICT 기술을 활용하여 효과적으로 피난을 유도하는 방법을 개발할 필요가 있다. 일본, 미국, 유럽 등의 선진국에서는 재난피해에 대응하여 CCTV, 지향성 스피커, IoT(Internet of Things) 기반 의 재난 경보 및 대응 시스템, 국가 방재 시스템을 구축하여 대국민 서비스 적용하는 추세이다. 국가재난관리시스템(NDMS)은 국가재난관리 전담기관인 소방방재청에서 구축, 활용중인 국가 재난관리체계와 재 난관리통신 시스템을 구축하며, 국가 재난에 체계적인 예방, 대비, 신속한 대응, 복구 지원 및 긴급 구조, 화재 등은 119 서비스 전과정을 정보화하여 대국민 재난안전 서비스를 제공한다. 자동우량 경보 시설 산불감지 통합 경보망 시설, 재난 안전무선망, 소방 영상위성 통신망을 하위 시스템으로 두고 있으며, ku 대역 위성인 무궁화 위성 5호를 사용하여 국가 전역의 재난, 재해 지역 현장을 실시간으로 감시하는 목적으로 위성 전용망도 구축 운영하고 있다. 인명피해 가능성이 매우 높은 고층빌딩 화재, 지하철 화재, 쇼핑센터, 지하상가 등의 화재 및 가스폭발 사고가 발생하는 재난 지역의 공공 시설에 대하여 인명피해를 최소화하는 피난 유도 및 재난대응 방안 필요하다. 또한, 사고발생대비 사망자 발생 빈도가 높은 홍수, 폭풍, 해일 등의 수난재해의 경우, 발생원인은 태풍과 태풍, 해일, 쓰나미, 강풍, 집중호우, 홍수, 강물 범람, 유속이 빠른 급류, 지반 붕괴/축대 붕괴, 산사태, 세월 호 등의 대형 유람선의 전복, 실족, 낚시, 다슬기 채취 등이 주요원인으로 조사되었으며, 계절은 하절기에 많이 발생하였으며, 발생장소로는 강, 계곡, 다슬기 채취장, 캠핑장 등으로 조사되었다. 특히, 사회재난 가운데 수난 재해는 발생건수 대비 사망자 발생비율이 17.2%로써, 화재(0.6%), 추락(4.4%) 등과 비교하여 사망자 발생 비율이 월등히 높아 특별한 관리방안이 필요하다. 사회재난 사고는 다양한 형태로 발생하며, 사망자가 지속 증가하고 있으나 대책 미비로 막대한 사회적 손실비용 이 발생하고 있는 실정이다. 사고 위험지역은 안전요원이 상주하기도 하지만 사람을 일일이 감시하기 어려울 뿐만 아니라, 하절기에 홍수와 집중호우시에 강, 계곡, 다슬기 채취, 캠핑장 등에서 수시로 일어나는 입수 금지 지역 물놀이 사고, 익사, 수난 사고, 도로교통, 화재, 유해 가스 폭발, 해양 사고, 추락 등 주로 순찰에 의존하여 효과적인 대처가 어려운 상 황이며, 특히 사람이 적은 계곡, 캠핑장 등은 사고가 나도 즉각적인 인지가 어려우며, 사고예방 전파가 적절히 이뤄지지 못하고 있다. 2012년 사회재난 발생건수는 30만 여건으로 천재지변으로 일어나는 자연 재해 보다는 월등히 많으며, 2012년에 발생된 사회재난은 총 303,707건으로 383,129명의 인명피해(사망:7,322명, 부상:375,807명)가 발생 지속적으로 증가 추세에 있다. 표1은 사회재난별 발생건수 추이[자료출처: 국민안전처, (구)소방방재청 방재연보 2012]를 나타낸다. 표 1 구분 2010년 2011년 2012년 3년 평균 도로교통 226,863 221,711 223,656 224,076 화재 41,863 43,875 43,249 42,995 수난 2,267 2,393 3,954 2,871 해양 1,627 1,750 1,632 1,669 추락 1,365 2,699 10,119 4,727 총 발생건수 280,607 286,851 303,707 290,388 표2는 사회재난별 인명피해(사망) 추이[자료출처: 국민안전처, (구)소방방재청 소방방재통계연보 2013]를 나타 낸다. 표 2 구분 2010년 2011년 2012년 3년 평균 도로교통 5,505 5,229 5,392 5,375 화재 304 263 257 274 수난 360 489 632 493 해양 85 38 64 52 추락 104 189 333 208 총 사망자수 6,758 6,709 7,322 6,929 재난 사고는 신속한 초기 대응으로 사고 피해를 최소화할 수 있는 인명 보호 및 구조 시스템 개발을 통하여 사 회재난대응 관리체계 구축이 필요하다. 사회재난사고 경감을 위하여 재난 사고의 유형을 조사 및 분석하여 사고예방 및 초기 대응이 가능한 시스템을 개발해야 한다. 영상 및 기타 센서를 융합하여 언제, 어디서나 발생할 수 있는 재난 상황을 네트워크를 활용하 여 사고 감지, 상황 인식, 정보 제공, 대응까지 가능한 ICT 기반의 사회재난 예방 및 대응 시스템 개발이 필요 하다. 재난, 재해 현장 상황을 본부 및 관련기관이 실시간으로 상황파악 및 대응을 위한 방안으로 지향성 스피 커, 영상 및 물리센서 융복합 기술을 활용하여 사회재난사고 예방 및 감소를 위한 시스템이 필요하다. [국내외 기술 동향] ○ 영상센서를 이용한 지능형 융복합 시스템 통합관제센터는 영상 분석 솔루션을 개발하여 영상 분석 및 빅데이터 기반의 지능형 영상 관제 센터 구축 솔루 션을 사용한다. 영상정보를 사용해 범죄 징후를 조기에 포착하고, 선제적으로 조치할 수 있는 대응체계를 갖추고 있으며, 감시 장비를 통해 다양한 정보수집 및 분석을 통해 대민 서비스를 향상시킬 수 있는 인프라를 제공한다. 지능형 통합관제 및 영상분석 솔루션을 개발하여 방범 영상 정보, 실시간 교통정보, 기상정보, 지리정보 및 건 물 정보를 포함하는 빅데이터를 통해 공공안전 분야의 서비스 강화에 기여한다. 지능형 영상관제 솔루션은 영상 데이터 분석을 기반으로 교통, 산업, 재난 방재 및 방범 등 다양한 분야에 활용 한다. 교차로나 횡단보도, 도로 및 교각 등에 설치된 카메라에 전송되는 영상을 지능형 영상분석 기술을 통하여 불법 주정차 단속, 교통사고에 대응한다. 산업 현장에서 발생되는 화학가스 누출이나 폭발사고 등의 산업재해 예방은 물론 첨단 제조공정의 모니터링을 한다. 지능형 영상분석을 통해 영상 데이터만으로 정밀하게 이상 상황이나 사전 징후를 발견한다. 방범 분야는 방치된 사람이나 물품 감지, 미아 및 치매노인의 감지 등 매우 광범위한 공공 및 생활 안전 분야에 활용한다. ○ 지향성 스피커 일부 선진국에서 고출력 음향 기술을 활용하여 조류 퇴치, 해적 방어에 사용되고 있다.국내에서는 경고 방송 등 에 일부 활용되고 있다. ○ 지능형 영상 수위 감지 시스템 지능형 CCTV를 수위감지에 사용하여 강, 하천 등 수위를 실시간으로 분석하고 경보 단계를 구분하여 관리하는 시스템을 제공한다. ○ 교량 투신 자살 감시 시스템 교량에서 발생하는 투신 상황을 실시간 모니터링 하고, 상황 발생시 경보체계를 가동하여 신속하게 구조대 투입 하며, 서울시 한강 교량 2곳에서 운영되고 있다. ○ 유해화학물질 통합관리 시스템 산단 지리정보를 입체화하고 유해화학물질 정보 등을 시스템화하여 실시간 기상정보 적용과 물질별 확산 시뮬레 이션 분석 기법을 도입한다. 사업장이 취급하는 화학물질 정보 및 사업장별 맞춤 정보와 사고 대응을 위한 방재정보를 제공한다. 이와 관련된 선행기술1로써, 특허 공개번호 10-2016-0097708에서는 \"통합형 센서모듈을 이용한 상시 환경제어 및 재난대응 관제시스템\"이 개시되어 있다. 통합형 센서모듈을 이용한 상시 환경제어 및 재난대응 관제시스템은 단위 건축물에 설치되어 단위 건축물 내의 환경 정보를 센싱하는 센서노드, 인터노드, 싱크노드를 포함하는 센서모듈과, 단위 건축물 각각에 마련되어 센 서모듈로부터 정보를 제공받아 관리하는 관제 시스템부와, 센서모듈 또는 관제 시스템부로부터 정보를 제공받아 관리하는 U-City 통합운영센터부를 포함한다. 이와 같이 구성되는 통합형 센서모듈을 이용한 상시 환경제어 및 재난대응 관제시스템은, 다중 센싱 노드에 의해 통합적인 센싱이 가능하고, 빠른 재난 정보 교환 및 분석이 용 이하며 스마트 빌딩 구축을 통해 U-City 통합운영센터와 건물 중앙통제부나 유지관리, 재난관제업체 등의 다수 의 관제시스템과의 연계에 의해 도시 전반의 지능적이고 안전한 통합플랫폼을 구축할 수 있다. 이와 관련된 선행기술2로써, 특허 등록번호 10-17431380000에서는 \"사물지능통신을 기반으로 하는 재난대응시스 템 및 방법\"이 공개되어 있다. 사물지능통신을 기반으로 하는 재난대응시스템은 유해화학가스 확산, 원유유출, 플랜트폭발, 방사능누출사고 등 의 다양한 인재사고의 확산으로 인한 피해범위의 광역화와 누적적 장기화로 인한 불특정 다수의 주민과 생물환 경에 심대한 영향을 주는 인적재난에 대해, 빅데이터를 기반으로 사고상황 발생 전부터 지속적으로 체크함으로 써, 고확산, 고위험이 수반되는 유해화학물질의 관리를 체계적으로 수립 및 해당 지역 주민들에게 안내하여 사 고발생 전부터 해당 지역 주민들에게 신속하게 대응 및 대처할 수 있게 안내하여 야기될 수 있는 위험성을 극소 화시킴과 더불어 실제로 재난사고가 발생한 상태에서 지역 소속자들이 그 재난사고가 발생된 지역을 인지하고, 그 재난사고가 전파되는 지역을 회피하면서 안전한 지역까지 최단경로로 이동하게 안내하여 줌으로써, 재난사고 발생후에도 인명피해를 최소화시켜줄 뿐만 아니라 사고발생지역에 위치하는 소속자들이 보유한 단말과 중앙관제 시스템 간의 무선인터넷망이 재난사고로 인해 본연의 구실을 수행하지 못하더라도 사고발생지역에 위치하는 소 속자들의 위치를 확인하고 이를 통해, 소속자들이 안전하게 탈출할 수 있는 경로를 소속자들에게 제공하여 주는 사물지능통신을 기반으로 하는 재난대응시스템 및 방법에 관한 것으로, 산업시설 주변지역의 상황을 감지하여 기설정된 주기마다 지역별 방재용 주변상황정보를 생성하고, 이를 TCP/IP 인터넷통신모듈을 이용하여 TCP/IP 기반 인터넷망을 통해 전송하는 사물지능 방재센서 관리부재들과; 상기 사물지능 방재센서 관리부 재들이 설치된 산업시설 주변지역에 속하는 소속자가 소유한 단말로서, 해당 소속자의 위치를 나타내는 산 업시설 주변지역 소속자 위치좌표정보를 무선인터넷 통신모듈을 이용하여 무선인터넷망을 통해 송신하는 산업시설 주변지역 소속자용 단말과; 상기 산업시설 주변지역을 나타내는 지도 상에 상기 사물지능 방재센 서 관리부재들의 위치가 표시된 산업시설 주변지역 사물지능 방재센서 위치 안내용 지도정보가 저장된 산 업시설 주변지역 사물지능 방재센서 위치 안내용 지도 목록정보 DB를 포함하는 DB부; 재난분석엔진 및 안전이동경로 생성엔진;을 갖는 것으로, 상기 재난분석엔진을 운영하여, 상기 사물지능 방 재센서 관리부재로부터 TCP/IP 기반 인터넷망을 통해 기설정된 주기마다 방재용 주변상황정보들을 전송받 고, 그 전송된 방재용 주변황상정보들을 분석하여 사고가 감지된 경우 그 사고가 감지된 방재용 주변상황정보를 전송한 해당 사물지능 방재센서 관리부재를 인지하며, 상기 산업시설 주변지역 소속자용 단말들로부터 무선인터넷망을 통해 산업시설 주변지역 소속자 위치좌표정보들을 전송받고, 상기 안전이동경로 생성엔진 을 운영하여, 상기 산업시설 주변지역 사물지능 방재센서 위치 안내용 지도 목록정보 DB에서 산업시 설 주변지역 사물지능 방재센서 위치 안내용 지도정보를 추출하여 그 추출된 산업시설 주변지역 사물지능 방재 센서 위치 안내용 지도정보 상에 상기 사고가 감지된 방재용 주변상황정보를 전송한 해당 사물지능 방재센서 관 리부재를 중심으로 사고위험반경(r1)을 설정하며, 상기 추출된 산업시설 주변지역 사물지능 방재센서 위치 안내용 지도정보 상에 상기 사고가 감지된 방재용 주변상황정보를 전송한 해당 사물지능 방재센서 관리부재 로부터 안전한 지역을 나타내는 안전지역(SZ)을 선정한 후 상기 전송된 산업시설 주변지역 소속자 위치좌 표정보들을 참조하여 상기 추출된 산업시설 주변지역 사물지능 방재센서 위치 안내용 지도정보 상의 사고위험반 경(r1)의 외(外)에 위치하는 소속자들을 인지하며, 그 인지된 해당 소속자들의 위치에서 상기 안전지역(SZ)까지 최단으로 이동하는 경로인 위험전파 회피기반 최단경로(MR)를 검색하여 상기 추출된 산업시설 주변지역 사물지 능 방재센서 위치 안내용 지도정보 상에 표시하고 이를, 상기 사고위험반경(r1)의 외(外)에 위치하는 소속자들 의 산업시설 주변지역 소속자용 단말로 통보하는 재난대응서버;에 있어서, BLE통신모듈(530b,530c)과 RSSI 측정모듈(520b,520c)을 갖는 한 쌍의 위치측정용 슬레이브측 설치지점별 근거리 위치안내단말(500b,500c) 및 BLE통신모듈(530a)과 RSSI 측정모듈(520a)을 갖는 위치측정용 마스터측 설치지점별 근거리 위치안내단말 (500a)이 한 조로 이루어져 산업시설 주변지역마다 분포설치되는 설치지점별 근거리 위치안내단말군;을 포 함하고, 상기 위치측정용 마스터측 설치지점별 근거리 위치안내단말(500a)에는 한 조로 이루어진 한 쌍의 위치 측정용 슬레이브측 설치지점별 근거리 위치안내단말(500b,500c) 및 위치측정용 마스터측 설치지점별 근거리 위 치안내단말(500a)을 삼점(三點)으로 연결하여 이루어지는 영역을 포함하는 설치지점지역을 나타내는 설치지점별 주변지도정보가 저장된 설치지점별 주변지도 목록정보 DB(511a)를 더 포함하며, 상기 재난대응서버는 상기 방재용 주변상황정보들의 분석된 값이 사고발생 예측상황감지에 해당하는 경우 기설정주기마다 상기 산업시설 주변지역 소속자용 단말로 무선인터넷망이 정상작동된다는 것을 안내하는 무선인터넷망 정상작동안내신호 를 전송하며, 상기 산업시설 주변지역 소속자용 단말은 상기 재난대응서버로부터 무선인터넷망을 통 해 기설정주기마다 전송되는 무선인터넷망 정상작동안내신호가 전송되지 않는 경우 사용자 식별정보 및 서버단 절 안내정보를 포함하는 무선단절 안내신호를 블루투스 통신모듈을 이용하여 근거리통신망을 통해 전송하 고, 상기 설치지점별 근거리 위치안내단말군을 이루는 것으로, 산업시설 주변지역마다 분포설치된 한 조를 이루는 한 쌍의 위치측정용 슬레이브측 설치지점별 근거리 위치안내단말(500b,500c) 및 위치측정용 마스터측 설 치지점별 근거리 위치안내단말(500a) 중 상기 산업시설 주변지역 소속자용 단말로부터 근거리통신망을 통 해 전송되는 무선단절 안내신호가 수신가능한 근거리지역에 위치하는 한 조를 이루는 한 쌍의 위치측정용 슬레 이브측 설치지점별 근거리 위치안내단말(500b,500c)의 BLE통신모듈(530b,530c)과 위치측정용 마스터측 설치지점 별 근거리 위치안내단말(500a)의 BLE통신모듈(530a)에서 상기 무선단절 안내신호를 각각 수신하며, 상기 무선단 절 안내신호를 수신한 상기 한 쌍의 위치측정용 슬레이브측 설치지점별 근거리 위치안내단말(500b,500c)은 RSSI 측정모듈(520b,520c)을 운영하여 그 수신된 무선단절 안내신호의 세기(RSSI)를 측정하고, 그 측정된 값인 한 쌍 의 슬레이브측 세기측정정보를 BLE통신모듈(530b,530c)을 이용하여 근거리통신망을 통해 한 조를 이루는 상기 위치측정용 마스터측 설치지점별 근거리 위치안내단말(500a)로 전송하고, 상기 한 쌍의 위치측정용 슬레이브측 설치지점별 근거리 위치안내단말(500b,500c)과 한 조를 이루는 상기 위치측정용 마스터측 설치지점별 근거리 위 치안내단말(500a)은 RSSI 측정모듈(520a)을 운영하여 그 수신된 무선단절 안내신호의 세기(RSSI)를 측정하고, 그 측정된 값인 마스터측 세기측정정보와 상기 BLE통신모듈(530a)을 통해 수신되는 한 쌍의 슬레이브측 세기측 정정보를 토대로 상기 무선단절 안내신호를 수신한 해당 위치측정용 마스터측 설치지점별 근거리 위치안내단말 (500a) 및 한 쌍의 위치측정용 슬레이브측 설치지점별 근거리 위치안내단말(500b,500c)의 삼점(三點)으로 연결 되는 설치지점지역에서 상기 무선단절 안내신호를 송신한 상기 산업시설 주변지역 소속자용 단말의 위치를 나타내는 설치지점별 소속자 위치좌표정보를 생성하며, 상기 설치지점별 주변지도 목록정보 DB(511a)에서 상기 설치지점별 소속자 위치좌표정보가 포함되는 설치지점별 주변지도정보를 추출하여 그 추출된 설치지점별 주변지 도정보 상에 상기 설치지점별 소속자 위치좌표정보를 참조하여 지근거리용 탈출경로를 표시하여 탈출안내용 설 치지점별 주변지도정보로 가공하며, 그 가공된 탈출안내용 설치지점별 주변지도정보에 상기 사용자 식별정보를 취합하고 이를, 블루투스 통신모듈(530a)을 이용하여 근거리통신망을 통해 전송하고, 상기 산업시설 주변지역 소속자용 단말은 상기 위치측정용 마스터측 설치지점별 근거리 위치안내단말(500a)로부터 근거리통신망을 통해 전송되는 탈출안내용 설치지점별 주변지도정보를 블루투스 통신모듈을 통해 수신하고, 그 수신된 탈 출안내용 설치지점별 주변지도정보에 취합된 사용자 식별정보를 토대로 사용자 식별을 수행한 후 탈출안내용 설 치지점별 주변지도정보를 출력 안내하는 시스템 및 이를 이용한 방법을 제공한다. 이와 관련된 선행기술2로써, 특허 등록번호 10-08000230000에서는 \"재난대응 자원 관리 시스템 및 방법\"이 개시 되어 있다. 재난대응 자원 관리 시스템은 재난현장의 어느 한 개별 구역에 투입되는 자원을 관리하는 재난대응 자원 관리 시스템으로써, 투입되는 자원이 가지고 있는 보유 정보를 무선으로 체크하는 체크 포인트기; 투입되는 자원에 대하여 투입임무를 포함한 투입 정보를 입력하는 입력부; 및 체크 포인트기 및 입력부로부터의 정보에 근거하여 해당하는 개별 구역에 투입되는 자원에 대한 현황 정보를 만들어 출력하는 처리부를 포함한다. 이러한 본 발명 에 의하면, 재난현장의 인적·물적 투입자원의 현황을 현장 및 원격지의 상황실의 수준별 지휘자가 전술적 및 전략적으로 판단할 수 있도록 데이터베이스화하고 단계적으로 연산 가공함으로써, 투입자원의 희생을 적극적으 로 막게 된다. 그러나, 사회재난 사례 분석을 통한 재난 특성 분석 및 대응 시나리오 개발하며, 재난 대응 대책을 마련하기 위 해, 태풍, 해일은 기상청의 조기 예경보 시스템에 의해 미리 재난을 막도록 조치를 취하지만, 홍수, 강물 범람, 풍수해, 계곡 급류 등의 수난 재해는 사회적 재난예방 기술과 ICT 기술이 적용된 재난 대응 시스템이 필요하지 만 재산과 인명 피해를 방지하는 시스템이 아직 구비되고 않은 실정이다. 그러므로, 사회재난 대응전략 개발, ICT 기술을 사용하여 지능형 카메라와 재난정보 탐지 융복합 센서 노드와 IoT 기반 센서 네트워크 구축, 게이트웨이와 연동된 재난대응 시스템, IDS 통합 관제 시스템과 IDS 로컬 관제 시스템, 영상 관제 시스템의 인공 지능 기반의 재난 상황 영상분석/상황인지/영상 추적, 사회 재난 발생 유형 분석, 재난에 대응하여 신속하게 IDS 기반 인명 지킴이 시나리오, 지향성 스ㅍ피커를 사용한 재난 경고 방송과 재난 발생시 대피 피난 유도 기술이 필요하게 되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허 공개번호 10-2016-0097708 (공개일자 2016년 08월 18일), \"통합형 센서모듈을 이용한 상 시 환경제어 및 재난대응 관제시스템\", 한국과학기술원, (주)도원엔지니어링건축사사무소 (특허문헌 0002) 특허 등록번호 10-17431380000 (등록일자 2017년 05월 29일), \"사물지능통신을 기반으로 하는 재난대응시스템 및 방법\", (주)바인테크 (특허문헌 0003) 특허 등록번호 10-08000230000 (등록일자 2008년 01월 25일), \"재난대응 자원 관리 시스템 및 방법\", 소방방재청"}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래 기술의 문제점을 해결하기 위한 본 발명의 목적은 ICT 기술을 사용하여 재난을 감지하는 CCTV 카메라, 융 복합 센서, IoT 센서 네트워크(USN, WSN, 6LoWPAN, MQTT, Wi-Fi, NB-IoT, LTE, LoRa 네트워크), IoT 게이트웨 이를 포함하는 사회재난 대응 IoT 센서 플랫폼 기술을 개발하고, 모비우스 서버, IDS 통합 관제 시스템과 IDS 로컬 관제 시스템, 영상 관제 시스템의 인공 지능 기반의 재난 상황 영상분석/상황인지/영상의 객체 추적, 센서 데이터 모니터링, 위험 지역의 마이크 센서를 이용한 비명소리에 의한 이벤트 감지 기능을 제공하며, 사회 재난 발생 유형 빅데이터 분석, 재난 대응 IDS 기반 인명 지킴이 시스템을 제공하며, 재난 경고 방송과 대피 유도 기 술을 제공하며, 센서 네트워크와 가변 출력이 가능한 지향성 스피커 시스템을 사용한 피난유도 시스템, 스마트 폰의 비가청 주파수를 활용한 유도 App을 제공하는, 사회재난 대응을 위한 융복합기술 기반의 카메라, 센서 네 트워크와 지향성 스피커를 사용한 인명지킴이 시스템을 제공한다."}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 목적을 달성하기 위해, 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지킴이 시스템은, 적어도 하나 이상의 카메라와 디지털 비디오 레코더(NVR) 및 영상 분석 소프트웨어를 구비하는 CCTV 카메라 시스템; 재난 상황을 감지한 센서 데이터를 전송하는 적어도 하나 이상의 IoT 기반 센서; 상기 IoT 기반 센서로부터 감지된 센서 패킷 데이터들을 무선 센서 네트워크(USN, WSN, 6LoWPAN, MQTT), Wi-Fi, NB-IoT를 이용한 센서 네트워크, 이동통신망(LTE), LoRa 네트워크, 이더넷(Ethernet)중 어느 하나의 네트워크를 통해 수신받아 프로토콜을 변환하여 서버로 전송하는 IoT 게이트웨이; 및 상기 어느 하나의 네트워크를 통해 상기 IoT 기반 센서로부터 감지된 센서 데이터들을 수집하여 저장하며, 센서 데이터 모 니터링 및 센서노드 정보 관리 및 제어 시스템을 구비하며, 센서 데이터 수집하여 빅 데이터를 분석하는 IoT 기 반 센서 네트워크와 연결되는 모비우스 서버, 상기 CCTV 카메라 시스템과 연결되고 인공 지능의 딥러닝 기반의 영상의 객체를 검출하여 재난 상황 영상분석/상황인지/영상의 객체 추적하는 영상 분석 서버와, 사회 재난 발생 유형별 빅 데이터를 분석하여 재난 대응 조치를 취하는 IDS 관제 시스템을 포함하며, IDS 관제 시스템은 다수의 IDS 로컬 관제 시스템과 IDS 통합 관제 시스템으로 구성되며, IDS 로컬 관제 시스템 은 IDS 폴과 연동된다."}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 사회재난 대응을 위한 융복합기술 기반의 카메라, 센서 네트워크와 지향성 스피커를 사용한 인 명지킴이 시스템은 ICT 기술을 사용하여 사회 재난을 감지하는 CCTV 카메라, 융복합 센서, IoT 센서 네트워크 (USN, WSN, 6LoWPAN, Wi-Fi, NB-IoT, LTE, LoRa 네트워크), IoT 게이트웨이를 포함하는 사회재난 대응 IoT 센 서 플랫폼 기술을 개발하고, 모비우스 서버, IDS 통합 관제 시스템과 IDS 로컬 관제 시스템, 영상 관제 시스템 의 인공 지능 기반의 재난 상황 영상분석/상황인지/영상의 객체 추적, 센서 데이터 모니터링, 위험 지역의 마이 크 센서를 이용한 비명소리에 의한 이벤트 감지 기능을 제공하며, 사회 재난 발생 유형 빅데이터 분석, 재난 대 응 IDS 기반 인명 지킴이 시스템을 제공하며, 재난 경고 방송과 대피 유도 기술을 제공하며, 센서 네트워크와 가변 출력이 가능한 지향성 스피커 시스템을 사용한 피난유도 시스템, 스마트폰의 비가청 주파수를 활용한 유도 App을 제공한다. 본 시스템은 재난 유형별, 지역별 재난 발생 현황 분석에 따른 시범 지역 선정 및 테스트베드 시스템을 구축하 고, 사회재난 종류별·특성별 기 구축된 방재시스템과의 연계사회재난 종류별·특성별 기 구축된 방재시스템과 연계하며, 향후, 사회재난 사고 발생 시 활용 가능한 이동형 관제 시스템을 개발할 예정이다. 사회 재난 관련 법·제도를 개선하고, U-City 통합 플랫폼과 IDS 시스템과의 연계를 통해 국가방재 시스템 구축 을 위한 중앙부처 및 유관기관, 지자체 시스템 연계하여 재난 발생시에 신속하게 대응하여 많은 인명과 재산을 보호하는데 사용된다."}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부된 도면을 참조하여 발명의 구성 및 동작을 상세하게 설명한다. 본 발명의 사회재난 대응을 위한 융복합기술 기반의 카메라, 센서 네트워크와 지향성 스피커를 사용한 인명지킴 이 시스템은 ICT 기술을 사용하여 사회 재난을 감지하는 CCTV 카메라, 융복합 센서, IoT 센서 네트워크(USN, WSN, 6LoWPAN, MQTT, Wi-Fi, NB-IoT, LTE, LoRa 네트워크), IoT 게이트웨이를 포함하는 사회재난 대응 IoT 센 서 플랫폼 기술을 개발하고, 모비우스 서버, IDS 통합 관제 시스템과 IDS 로컬 관제 시스템, 영상 관제 시스템 의 인공 지능 기반의 재난 상황 영상분석/상황인지/영상 추적, 센서 데이터 모니터링, 위험 지역의 마이크 센서 를 이용한 비명소리에 의한 이벤트 감지 기능을 제공하며, 사회 재난 발생 유형 빅데이터 분석, 재난 대응 IDS 기반 인명 지킴이 시스템을 제공하며, 재난 경고 방송과 대피 유도 기술을 제공하며, 센서 네트워크와 가변 출 력이 가능한 지향성 스피커 시스템을 사용한 피난유도 시스템, 스마트폰의 비가청 주파수를 활용한 유도 App을 제공한다."}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명은 각종 재난·재해 현장에서 발생하는 유효 데이터 수집을 통해 위험 요소 방지 및 재난 상황 전파 체 계를 구축에 관한 것이다. - 사회재난사고 자료 수집 및 빅 데이터 분석을 통한 재난 유형, 사고원인과 특성분석 - 영상센서의 기술적 한계를 융복합 센서(영상, 물리, 음향)와 지향성 스피커를 연계하여 조기경보 및 재난 상 황 전파기술 - CCTV 및 방송 시스템을 사용한 지능형 방송·예방 기술 - 지향성 스피커 및 센서 네트워크를 사용하여 각종 재난 상황에서 안전하고 신속한 피난 유도시스템 - CCTV, 카메라, 스피커, 마이크, 센서 등 재난 측정 각종 장비 사용 - 인명 지킴이 시스템, 피난 유도 시스템 - 사회재난 사고 발생 시 활용 가능한 이동형 관제 시스템 개발 - U-City 통합 플랫폼과 IDS 시스템과의 연계 - 사회재난 종류별·특성별 기 구축된 방재시스템과의 연계 - 재난 유형별, 지역별 재난 발생 현황 분석에 따른 시범 지역 선정 및 테스트베드 시스템 구축 - 국가방재 시스템 구축을 위한 중앙부처 및 유관기관, 지자체 시스템 연계 - 법·제도 개선 ○ 1차년도 : <융복합 센서 활용 시스템 설계 및 활용방안 수립> ·융복합 센서, 각종 시스템 및 장비 등을 활용한 스마트 시스템 구축방안 검토 사회재난 예방 가능범위 검토 ·Seamless Tracking 등 각종 알고리즘 개발 방안 연구 <지향성 스피커 활용 시스템 설계 및 활용방안 수립> ·지향성 스피커를 활용한 사회재난 예방 가능범위 검토 ·재난 유형별, 지역별, 장소별 등 각종 유형에 따른 지향성 스피커 모듈화 및 경량화 검토 <CCTV 카메라 활용방안> ·재난 유형별·지역별·장소별 등 유형에 따른 활용방안 검토·분석 지자체 시스템 적용을 위한 관련 법·제도 및 인증 검토 ○ 2차년도: IoT 기반 융복합 센서네트워크 기술을 사용한 Seamless Tracking 기술 기반의 지향성 스피커 활용 시스템 개발 - 사고 예방에서 사고 발생시 대응까지 통합관리 시나리오 개발 ·지향성 스피커를 활용한 순환사고발생시 예방에서 대응수습까지 통합표준운용절차(SOP) 개발 ·시스템 독립 운영 및 통합운영 시나리오 개발 - IoT 기반 융복합 센서네트워크 기술을 사용한 Seamless Tracking 기술 개발 <센싱기술 및 전송 모듈개발> ·압축 및 전송을 위한 IP Board 개발 ·카메라 모듈 개발 ·MANET 기반의 복합센서 개발 ·IoT 기반 센서 네트워크 기술 개발 ·Seamless Tracking 기술개발 ·센서 융복합을 통한 상황인지 기술개발 <가변출력이 가능한 지향성 스피커 기술 개발> ·음향센서 연동을 통한 구난용 가변 출력 변환 지향성 스피커 ·재난 상황을 고려한 가변출력/방사각도 조절이 가능한 지향성 스피커 ·구난용 지향성 스피커의 경량화, 소형화 ·지능형 무인 방송 기술을 통한 재난 예방 방안 개발 ·안전 사각 지역을 위한 이동형 관제 시스템 개발 ·피난 유도형(가청/비가청) 다중 지향성 스피커 개발 - 재난 관리 시스템, 인명 지킴이 시스템, 피난 유도 시스템 설계 ·센서네트워크 기술을 이용한 다중이용시설에 대한 위험요소 감지기술 개발 및 피난 유도 알고리즘 개발 ·시각 및 청각의 인지기능 기반 시스템 설계 및 개발 ○ 3차년도: 시스템 기능 개선 및 고도화, 타 관제센터 연계방안 - 융복합 센서(영상, 물리, 음향) 기반의 연계 시스템 고도화 <지향성 스피커 기술 개발> ·다중 비가청 주파수 대응 가능한 지향성 스피커 개발 및 고도화 ·빔포밍(Beamforming) 기반의 지향성 스피커 개발 <센싱 기술 개발> ·융복합 센서를 통한 Seamless Tracking 기발 기술 고도화 ·IDS 통합 관제 시스템 서버, 시스템 개발 ·IoT 기반의 센서 네트워크 통합 시스템 개발 - 시각과 청각을 이용한 인지기능 기반의 센서 네트워크와 지향성 스피커를 사용한 피난 유도 시스템 개발 - 스마트폰의 비가청 주파수를 활용한 유도 APP개발(가청/비가청 주파수를 활용한 피난 유도 상세 설계, 비가청 신호의 특성 분석) □ 센서 노드 1. 센서노드 2종 제작 : 타입-1(기본형), 타입-2(근접형) 2. 방수 성능 : IP67 3. 센서성능 - 수위 : 0.3~1.5 m 범위 및 0.2 m 분해능 - 기상센서 : 기온, 풍향풍속 - 통신 : Wifi mesh 네트워크 통신 탑재 - 지향성 마이크 : 비명 등 이벤트(주변 잡음 대비 변화 dB 기준 설정) 감지 - 지향성 카메라 : 이벤트 연동 스틸영상 촬영 및 송신 - 센서노드 안전센서 : 진동, 기울기 감지 □ Wi-Fi 메쉬 네트워크와 IoT 기반의 센서 네트워크 기술 개발 - 센서노드 간 통신 유효 거리 : 50m 이상 - Wi-Fi mesh 네트워크 구성 노드 갯수 : 5개 이상 □ 영상분석 기반의 재난 상황인지 및 Seamless Tracking 기술 개발 1. 융복합 센서를 통한 상황인지 기술 개발 - 영상 데이터 분석을 통한 객체 검출 및 행동인지 기술 활용 위험 지역 검출 - 객체 검출 및 추적 기술을 통한 이벤트 검출 - 객체 검출/추적 기술 및 행동인지 기술을 통한 수상 위험 상황인지 검출 2. Seamless Tracking 기술 개발 - 영상 기반 객체 검출 및 추적 기술 구현 도 2는 본 발명에 따른 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사 용한 인명지킴이 시스템 구성도이다. 본 발명의 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사용한 인명지 킴이 시스템은, 적어도 하나 이상의 카메라와 디지털 비디오 레코더(NVR, Network Video Recoder) 및 영상 분석 소프트웨어를 구비하는 CCTV 카메라 시스템; 재난 상황을 감지한 센서 데이터를 전송하는 적어도 하나 이상의 IoT 기반 센서; 상기 센서로부터 감지된 센서 데이터들을 무선 센서 네트워크(USN, WSN, 6LoWPAN, MQTT), Wi- Fi, NB-IoT를 이용한 센서 네트워크, 이동통신망(LTE), LoRa 네트워크, 이더넷(Ethernet) 중 어느 하나의 네트 워크를 통해 수신받아 프로토콜을 변환하여 서버로 전송하는 IoT 게이트웨이; 및 무선 센서 네트워크(USN, WSN, 6LoWPAN, MQTT), Wi-Fi, NB-IoT를 이용한 센서 네트워크, 이동통신망(LTE), LoRa 네트워크, 이더넷(Ethernet) 중 어느 하나의 네트워크를 통해 상기 센서로부터 감지된 센서 데이터들을 수집하여 저장하며, 센서 데이터 모 니터링 및 센서노드 정보 관리 및 제어 시스템을 구비하며, 센서 데이터 수집하여 모니터링하고 빅 데이터를 분 석하는 IoT 기반 센서 네트워크와 연결되는 모비우스 서버, 상기 CCTV 카메라 시스템과 연결되며 인공 지능의 딥러닝 기반의 영상의 객체를 검출하여 재난 상황 영상분석/상황인지/영상의 객체를 추적하는 CCTV카메라 시스 템과 연결되는 영상 분석 서버와, 사회 재난 발생 유형별 빅 데이터를 분석하여 재난 대응 조치를 취하는 IDS 관제 시스템을 포함하며, IDS 관제 시스템은 다수의 IDS 로컬 관제 시스템과 IDS 통합 관제 시스템으로 구성되며, IDS 로컬 관제 시스템 은 IDS 폴과 연동되는 것을 특징으로 한다. IDS 관제 시스템은 IoT 센서 네트워크 기반의 모비우스 서버, 인공 지능의 딥러닝 기반의 영상의 객체를 검출 하여 재난 상황 영상분석/상황인지/영상의 객체를 추적하는 영상 분석 서버, 재난 대응 IDS 기반 인명 지킴이 시나리오를 제공하는 인명 지킴이 시스템, 위험 지역 인근 이동통신 단말기들로 재난 안내 문자 전송하는 피난 유도 시스템과 방사각도와 팬틸트 조절이 가능한 지향성 스피커를 통해 재난 경고 방송과 대피 유도 기술을 제 공하는 재난 대응 시스템을 구비하는 IDS 관제 시스템을 더 포함한다. 상기 모비우스 서버는 IDS 로컬관제 시스템의 일부분으로써 IDS 통합관제 시스템과 연동되어 센서 데이터, 영상, 음향 정보 등의 각종 모니터링 데이터를 전송한다. IDS 로컬관제 시스템은 모비우스 서버와 시계열 데이터베이스(TSDB), 영상 분석 서버(Video Server)의 영상, 센 서 데이터와 음원 데이터, 영상을 모니터링하는 모니터링부, 컨트롤 모듈을 구비하며, 통신 미들웨어를 통해 IDS 함체와 연동되고, 센서와 음원, 영상 데이터 수집과 분석 및 모니터링 기능, 영상 분석 서버에 의해 인공 지능의 딥러닝 기반의 객체를 검출하여 재난 상황 영상분석/상황인지/영상의 객체 추적 기능, 지향성 스피커 제 어를 위한 컨트럴 기능, 카메라 및 적외선 IR 조작을 위한 컨트럴 기능, Pan/Tilt 조작을 위한 컨트럴 기능, 구 난자 및 IDS 폴, 센서 위치 확인을 위한 모니터링 기능, 카메라로부터 획득되는 실시간 영상 확인 및 분석 기능, 모비우스 서버로부터 수신되는 실시간 센서 데이터확인 기능, 과거 센서 데이터 조회 기능, 재난 문자를 전송하여 피난을 유도하는 피난 유도 시스템과 지향성 스피커와 카메라를 구비한 이동 차량 재난 경고 방송을 제공하는 재난 대응 시스템에 연동하여 각각 피난 유도 기능(재난 문자 전송)과 재난 대응 기능(이동 차량 재난 경고 방송)을 제공하며, IDS 폴 연동 기능을 제공하며, 상기 IDS 통합관제 시스템은 여러 지역에 분산된 설치된 다수의 IDS 로컬 관제 시스템과 연결되며, 각각의 IDS 로컬 관제 시스템으로부터 재난 상황 정보를 수신하여 IDS 로컬관제 시스템 모니터링 기능을 제공하며, IDS 폴은 실시간 영상 정보 획득을 위한 카메라, 야간 영상 촬영을 위한 IR LED, 구난자에게 경보방송 송출을 위한 지향성 스피커, 위험 지역 일상 주변 감시 및 구난자 타겟팅을 위한 Pan/Tilt 조절, 통신 미들웨어를 통해 IDS 로컬 관제 시스템의 일부분으로 사용되는 모비우스 서버와 연결된다. 1. 연구 목표 사회재난에 대한 발생현황 및 원인에 대한 종합적이고 면밀한 분석을 통하여 재난에 관한 사회적 요구 및 재난 대응능력 향상에 필요한 사항을 검토 ICT 기술을 활용한 실효적인 재난예방 및 인명사고 감축기술의 개발을 위하여 인명지킴이시스템 개발전략 마련 및 시스템 개발에 필요한 요소기술 개발 사고대비 사망자 발생비율이 높은 수난사고 및 인명피해 가능성이 높은 다중이용시설에서의 피난유도를 중심으 로 인명지킴이 시스템 요소기술 및 시스템 개발 도 3은 IDS 인명지킴이 시스템 화면이다. 도 4는 핵심 기술별 테스트베드 적용방안을 나타낸 화면이다. 재난 대응 인명 지킴이 시스템에 관한 시스템 적합성과 성능검증을 위하여 지자체 및 관련기관을 대상으로 실증 시범사업 실시 또한, 연구를 통해 개발된 시스템이 지자체의 재난 및 안전관리체계와 연계 활용될 수 있도록 국 가 재난관리 시스템 연계 및 확장 활용에 대한 검증을 실시하여 지자체 재난안전관리시스템 모델로 제시 나. 최종 연구목표 ○ 사회재난 대응전략 개발 및 시범사업 관리 - 사회재난 유형별 대응 기본전략 수립 - IDS 기반 인명지킴이 시나리오 및 매뉴얼 개발 ○ 사회재난 감시 및 대응을 위한 IDS 센서 네트워크 플랫폼 제공 -사회재난을 유발하는 요인들을 사전 예측하거나 실시간으로 탐지할 수 있는 센서 조합으로 구성된 지능형 센서 노드 - 센서 노드들로부터 취득된 정보를 서버로 전달하기 위한 Mesh 또는 Mobile Ad-hoc 통신 네트워크 - 센서 노드들로부터 취득된 정보를 저장 관리하는 IoT 센서 네트워크와 연동된 인명 지킴이 및 재난 대응 시스 템으로 사용되는 모비우스 서버(MOBIUS server) 구축 및 운영을 통해 재난 관련 빅 데이터 분석 활용, 국가 및 지자체 재난 관제 시스템과 연계 [핵심 연구개발 기술] ○ 지능형 센서 노드 기술 - 사회재난별 유형에 맞춰 재난 발생의 사전 예측과 탐지를 위해 음향, 수위, 유속, 강우, 화재 등과 같은 필요 한 감지대상을 선정하고 이에 적합한 센서선정 및 융복합화 센서모듈 개발 - 센서 노드의 시스템 강건성과 센서 계측의 정확성과 신뢰성을 높이기 위한 센서 노드의 자가 진단 및 시스템 에러 제어 기술 - 주변 환경과 재난 정보 수집 및 전달 기능을 포함하고 수집된 정보를 통해 이벤트 분류 및 긴급한 상황 인지 등의 센서 노드의 지능화 알고리즘 탑재 - Seamless tracking과 지향성 스피커의 경보 및 피난 유도와 연계를 위한 음향정보 수집 및 전달 센서 노드는 강우 센서, 수위 센서, 유속 센서, 풍속 센서, 음향 센서, 마이크 센서, 가스 센서, 화재 감지 센 서, 인체 감지 센서를 구비하는 IoT 기반 센서 네트워크와 연동된 인명 지킴이 시스템(재난 대응 시스템) 및 피 난유도 시스템을 구축하여 사용한다. 센서는 방수처리 및 내환경성을 제공한다. 또한, 센서노드는 CCTV 카메라의 또는 센서 노드 자체 카메라의 스틸영상 촬영과 전송 기능, 센서노드 마이크 센서 경우 마이크 신호 분석 및 이벤트 감지 기능, 센서노드 배터리 방전 경고 기능을 제공하며, IoT 기반의 센 서 네트워크를 통해 모비우스 서버와 연동된다. IoT 기반 재난 대응 및 인명 지킴이 시스템은 유선 전원, 배터리 또는 비상 전원 공급 체계 강우 센서, 수위 센 서, 유속 센서, 풍속 센서, 음향 센서, 가스 센서, 화재 감지 센서, 인체 감지 센서를 사용하였다. 강우 센서는 센서 노드 설치 지역의 강우량을 실시간으로 측정해 예측에 사용된다. 수위 센서는 초음파 수위 센서 또는 레이더 수위 센서를 사용하며, 하천의 수위를 측정한다. 유속 센서는 전자파 표면유속계를 사용하며 하천의 유속을 측정해 수위, 강우량과의 같이 사용된다. 유속 센서 는 전자파 표면유속계를 사용하며, 수면의 유속을 운동하는 물체에 의하여 산란된 전자파의 주파수가 변하게 되 는 현상인 도플러 효과를 이용하여 측정하는 비접촉식 유속센서이다. 도플러 주파수는 fd=(2v/λ)cosθ으로 유 속은 v=(λ/cosθ)fd 이 된다. 여기서, fd는 도플러 주파수이고, v는 물체의 속도, λ는 전파의 파장, 그리고 θ 는 물체의 속도 방향과 전파의 진행방향이 이루는 각으로써 20°~ 50°범위의 값을 사용한다. 풍속 센서는 바람의 속도 측정을 통해 재난 분석에 사용된다. 음향 센서는 사고 상황 인지, 지향성 스피커 구동을 위한 적어도 하나 이상의 고신뢰성 마이크로폰을 사용한다. 화재 감지 센서는 공공시설에서 화재를 감지하여 피난유도를 하기 위해 사용된다. ○ 센서 노드 간의 통신 네트워크 기술 - 기지국과 같은 중재자의 도움 없이 능동적인 연결설정이 가능하고 네트워크의 참여 또는 이탈이 자유롭고 통 신망 구성이 가능하여 빈번하게 네트워크 토폴로지를 변화시키는 Mesh 또는 MANET(Mobile Ad-hoc Network) 센서 네트워크 구성 - 모비우스 서버(Mobius server) 기반 IoT 로컬 관제 시스템과, 이와 연결되는 IoT 통합 관제 시스템 구성 - 재난 정보의 수집 및 저장, 활용을 위한 인터넷 모비우스 서버 및 통합 관제 시스템과의 연계 사회재난 빅 데이터 분석 및 예측을 위한 정보의 축적 및 제공 도 5a는 IoT 기반 재난 정보 시스템 구성도이다. 도 5b는 폴대와 지향성 스피커를 사용한 이동차량 기반 재난 대응 시스템 구성도이다. 폴대와 지향성 스피커를 사용한 이동차량 기반 재난 대응 시스템은 해안가, 강변, 하천, 계곡에서 폴대에 장치 ID가 할당된 센서가 고정설치되고, 강우량, 하천 수위, 유속, 풍속을 측정하는 각 지역에 설치된 복수의 센서들 (71,72,73); 상기 센서들(71,72,73)로부터 상기 장치 ID와 강우량, 하천수위, 유속, 풍속 정보를 취합하는 싱크 노드와, 상기 싱크 노드로부터 상기 장치 ID와 강우량, 하천수위, 유속, 풍속 정보를 무선 센서 네트워크(WSN) 를 통해 수신받아 이를 전송하는 게이트웨이; 및 상기 게이트웨이로부터 랜(LAN) 또는 무선 랜(Wi- Fi)을 통해 상기 장치 ID와 강우량, 하천수위, 유속, 풍속 정보를 수신받아 저장하며, 재난안전 상황실의 관제 센터의 컴퓨터의 모니터에 표시되며 재난안전 상황실의 관제 센터의 컴퓨터의 모니터에 재난 상황이 표시되며, 강우량, 하천수위, 유속, 풍속 데이터가 특정 기준치 이상이 되면 조기 경보 및 재난 상황 전파체계를 통해 긴급 대피하도록 해당 재난 예상 지역의 셀 커버리지에 있는 이동전화번호들로 재난 경보 문자를 전송 하고, 원격 재난 대피 방송 신호를 통신망을 통해 고정형 가변 출력 지향성 스피커로 출력하며, 재난 예상 지역으로 이동 차량을 출동시켜 이동 차량의 폴대에 고정된 지향성 스피커로 재난 대피 방송 신호가 출력 되도록 제어하며, 재난 관련 데이터를 수집 및 분석하여 사고 발생 원인과 통계 분석 데이터를 제공하고, 빅 데 이터 분석을 통한 재난대응을 위한 재난 대응 시스템; 및 고정형 폴대에 부착되거나, 이동 차량의 폴 대의 부착되며, 상기 재난 대응 시스템과 비상 재난 통신망(LTE. Wi-Fi)을 통해 원격 재난 안내 방송 을 출력하고, 방사 각도가 조절되는 가변 출력 지향성 스피커를 포함한다. 지향성 스피커는 지상의 폴대에 고정된 고정형 가변출력 지향성 스피커(고정형 지향성 스피커)(190-1)와, 이동 차량의 폴대에 고정된 가변출력 지향성 스피커(이동형 지향성 스피커)(190-2)를 구비하며, 상기 지향성 스피커는 방사각도와 팬/틸트 조절이 가능하며, 모터제어신호 수신기와 상기 모터에 의해 지향성 스피커의 단계별 방사 각도를 조절하고 단계별 음압 레벨을 조절하여 가청 대역 음성 신호(가청 신호) 및 비가 청 대역 신호(비가청 신호)를 출력하는 실내 각 지역에 설치된 방사각도와 팬/틸트 조절이 가능한 지향성 스피 커 인 것을 특징으로 하며, 상기 지향성 스피커의 방사각도와 팬/틸트 조절을 위한 지향성 스피커 다중 제어 시 스템을 더 구비하며, 상기 지향성 스피커 다중 제어 시스템은 카메라와 IR LED가 설치된 PTZ 제어기의 방사 각도와 팬/틸트를 조절하 며 스피커의 볼륨을 조정하는 지향성 스피커 제어기, 상기 지향성 스피커 제어기에 의해 설정된 볼륨에 따라 음 향이 출력되는 지향성 스피커 앰프, 전원을 공급하는 전원 공급부를 구비한다. 이동 차랑은 카메라와, 방사각도와 팬/틸트 조절이 가능한 지향성 스피커를 구비하며, Wi-Fi 통신부 또는 RF 무 선 통신부를 구비하는 무선 CCTV 카메라를 구비할 수 있다. 상기 재난 대응 시스템과 이동통신망을 통해 연결되며, 피난유도 앱(App)이 설치된 이동통신 단말기(예, 스마트폰)를 더 포함하며, 태풍, 해일, 강풍, 폭우 등의 수난 재해가 예상될 경우 재난 대비 조치로써, 재난 대응 시스템으로부터 재난 경 보 문자를 수신받고, 이동 차량의 폴대에 고정된 지향성 스피커로부터 20Hz ~ 20kHz 가청 대역의 재난 대 피 음성 방송을 송출하고, 해당 지역에 설치된 폴대 고정형 지향성 스피커로부터 비가청 신호 주파수를 해 당 지역의 스마트 기기(스마트폰)로 전송하여 표시되도록 함으로써, 재난 위험 지역으로부터 안전 지역으로 대 피를 유도한다. 센서들은 IoT 기반 센서 노드(IoT 인명 지킴이 센서 모듈)로써 강우 센서, 수위 센서, 유속 센서, 풍속 센서, 마이크 센서, 화재 감지 센서, 가스 감지 센서, 인체 감지 센서(PIR 센서)를 사용하며, 무선 센서 네트워크 (WSN)과 게이트웨이를 통해 재난 대응 시스템으로 감지된 강우량, 하천 수위, 유속, 풍속 정보, 마이크의 소리 정보, 화재 감지 정보, 가스 누출 감지 정보, 인체 감지 정보를 전송한다. 또한, 재난정보 탐지 융복합 지능형 센서들은 무선 통신부(Wi-Fi 통신부, NB-IoT 통신부, LTE 통신부 또는 LoRa RF 통신부)가 탑재된 경우, 강우 센서, 수위 센서, 유속 센서, 풍속 센서, 마이크 센서, 화재 감지 센서, 가스 감지 센서, 인체 감지 센서(PIR 센서)에 의해 감지된 강우량, 하천 수위, 유속, 풍속 정보, 마이크 소리 정보, 화재 감지 정보, 가스 누출 감지 정보, 인체 감지 정보를 센서 네트워크(USN, WSN, 6LoWPAN, MQTT), 이동통신망 (LTE) 또는 Wi-Fi 무선 랜, NB-IoT 기반 센서 네트워크, LoRa 네트워크 중 어느 하나의 네트워크를 통해 모비우 스 서버의 재난 대응 시스템(인명 지킴이 시스템)으로 전송한다. 또한, 센서는 위험 지역, 사고 다발 지역의 카메라의 스틸영상을 촬영하여 모비우스 서버로 후 전송 기술을 개 발하여 마이크 센서를 이용한 비명소리 등 큰 소리에 의한 이벤트 감지 기능을 제공한다. 재난 대응 시스템은 IDS 로컬 관제 시스템으로써 IDS 통합 관제 시스템과 연결되며, 국가 재난관리 시스템 에서 관리되는 기상 정보, 태풍 정보, 관측 정보, 적설 정보를 제공하는 기상 예경보 시스템, 강우량 에 따라 해당 하천의 수위와 유속을 관리하는 홍수 모니터링 시스템 및 수위 모니터링 시스템, 지진 관측 정보를 제공하고 지진 재해에 대응하는 재난 정보 및 피해 정보를 관리하는 지진 방재관리 시스템과 연동되고, 국가 방재 시스템, 지자체에 운영하는 지역 방재 시스템과 연동되며, 각종 재난 탐지 정보와 재난 정 보를 수신하며, IDS 로컬 관제 시스템의 관제 센터와 IDS 통합 관제 시스템의 관제 센터의 모니터에 표시된다. 기상 예경보 시스템은 기상 위성과 기상 레이더 및 기상 측정 장치로 측정된 태충의 이동 경로, 태풍, 해 일, 강풍, 폭우(집중 호우), 눈/적설 기상 정보 및 관측 정보를 재난 대응 시스템으로 제공한다. 재난 대응 시스템은 GIS 서버와 연동되고, 태풍, 해일, 폭우에 따른 수해 또는 지진에 따른 재난 지 역 지도가 표시되며, 홍수 지도가 표시된다. 재난 대응 시스템은 재난 관련 비정형 데이터의 분석, 키워드 및 기초 추론조건에 의한 재난관련데이터를 수집 및 분석하여 사고 발생 원인 분석 자료와 통계 분석 데이터를 제공하며, 구조적 History 데이터를 통해 재 난/사고 유형별, 시간대별, 지역별, 규모별 등 각종 다차원 분석관점에서 사고의 발생에 대한 통계 분석을 실시 하며, 기관에서 제공하는 각종원인 분석자료와 History 통계분석자료의 연관분석을 제공한다. 관제 센터의 재난 안전 상황실에서는 PC에서는 웹 기반 서버상 수집된 센서 정보 모니터링 및 센서로부터의 재 난이 예측되는 특정 조건에 따른 알람 통보와 관련 제어 솔루션을 제공하며, 해당 재난 예상 지역의 셀 커버리 지에 있는 이동전화번호들로 긴급 재난 경보 문자를 전송하며, 지향성 스피커를 탑재된 이동 차량을 재난 경고 방송을 통해 안전 지역으로 피난 대피를 유도한다. 재난 대응 시스템은 관리자용 서비스 서버 구축 및 관리용 모니터링 웹(Web)과, 알람 및 제어용 Android 또는 iOS 기반 스마트폰 앱(App)을 개발하였다. IDS 폴(IDS 폴대)와 지향성 스피커를 사용한 이동차량 기반 재난 대응 방법은, 각 지역에 설치된 장치 ID가 할 당된 복수의 센서들로부터 장치 ID와 강우량, 하천수위, 유속, 풍속 정보를 측정하는 단계; 상기 복수의 센서들 로부터 측정된 상기 장치 ID와 강우량, 하천수위, 유속, 풍속 정보를 무선 센서 네트워크(WSN) 또는 이동통신망 또는 무선 랜(Wi-Fi)을 통해 수신받아 저장하며, 관제 센터의 컴퓨터의 모니터에 표시되고, 상기 재난 대응 시 스템이 강우량, 하천수위, 유속, 풍속 데이터가 특정 기준치 이상이 되면 긴급 대피하도록 해당 재난 예상 지역 의 셀 커버리지에 있는 이동전화번호들로 재난 경보 문자를 전송하고, 원격 재난 대피 방송 데이터를 통신망을 통해 고정형 가변 출력 지향성 스피커로 출력하도록 제어하며, 재난 예상 지역으로 출동한 이동차량의 지향성 스피커로 재난 대피 방송이 출력되도록 제어하며, 재난 관련 데이터를 수집 및 분석하여 사고 발생 원인과 통계 분석 데이터를 제공하는 단계; 및 상기 재난 대응 시스템과 비상 재난 통신망을 통해 원격 재난 안내 방송을 수 신된 지상의 폴대에 부착된 고정형 지향성 스피커로 출력하거나, 또는 이동 차량의 폴대의 부착된 이동형 지향 성 스피커를 통해 재난 안내 음성을 출력하는 단계를 포함하며, 상기 고정형/이동형 지향성 스피커는 모터제어신호 수신기와 상기 모터에 의해 지향성 스피커의 단계별 방사 각 도를 조절하고 단계별 음압 레벨을 조절하여 가청 대역 음성 신호(가청 신호) 및 비가청 대역 신호(비가청 신호)를 출력하는 실내 각 지역에 설치된 방사각도와 팬/틸트 조절이 가능한 지향성 스피커를 사용하는 것을 특 징으로 한다. 상기 방법은 상기 재난 대응 시스템이 기상 정보, 태풍 정보, 관측 정보, 적설 정보를 제공하는 기상 예경보 시 스템과; 강우량에 따라 하천의 수위와 유속을 관리하는 홍수 모니터링 시스템 및 수위 모니터링 시스템과; 및/ 또는 지진 관측 정보를 제공하고 지진 재해에 대응하는 재난 정보 및 피해 정보를 관리하는 지진 방재관리 시스 템과 연동되고, 각종 관측 정보와 재난 정보를 수신하여 상기 관제 센터의 컴퓨터의 모니터에 표시되며, 재난 정보 수신시에 재난 예상 지역으로 출동한 이동차량의 지향성 스피커로 재난 대피 방송이 출력되도록 하는 단계 를 더 포함한다. 상기 방법은 상기 재난 대응 시스템이 재난 지역을 지도 상에 표시하는 GIS 서버와 연동되며, 태풍, 해일, 강풍, 폭우에 따른 수해 또는 지진 경보에 따른 재난 지역 지도가 표시되며, 홍수 지도가 표시되는 단계를 더 포함한다. 상기 센서들은 강우 센서, 수위 센서, 유속 센서, 풍속 센서, 위험 지역에 설치된 마이크 센서, 화재 감지 센서, 가스 감지 센서, 인체 감지 센서를 사용하며, 무선 센서 네트워크(WSN)과 게이트웨이를 통해 또는 센서 네트워크(USN, WSN, 6LoWPAN, MQTT), Wi-Fi 무선 랜, 이동통신망(LTE-M), NB-IoT, LoRa 네트워크 중 어느 하나 이상의 네트워크를 통해 게이트웨이를 통해 모비우스 서버의 인명 지킴이(재난 대응 시스템)으로 강우량, 하천 수위, 유속, 풍속 정보, 마이크 센서 정보(비명 소리), 화재 감지 정보, 가스 감지 정보, 인체 감지 정보를 전 송한다. 상기 센서들은 무선 통신부(6LoWPAN, MQTT, Wi-Fi, LTE, NB-IoT, LTE-M, LoRa)가 탑재된 경우, 강우 센서, 수 위 센서, 유속 센서, 풍속 센서, 위험 지역에 설치된 마이크 센서, 화재 감지 센서, 가스 감지 센서, 인체 감지 센서에 의해 감지된 강우량, 하천 수위, 유속, 풍속 정보, 마이크 센서 데이터(비명 소리), 화재 감지 정보, 가 스 감지 정보, 인체 감지 정보를 센서 네트워크(WSN, 6LoWPAN, MQTT), Wi-Fi 무선 랜, 이동통신망(LTE-M), NB- IoT, LoRa 네트워크 중 어느 하나 이상의 네트워크를 통해 게이트웨이를 통해 모비우스 서버, 영상 분석 서버,인명 지킴이 시스템, 피난 유도 시스템 및 재난 대응 시스템을 구비하는 IDS 로컬 관제 시스템으로 전송한다. 상기 IDS 로컬관제 시스템은 IDS 통합관제 시스템과 연동되어 영상과 음성, 센서 데이터를 포함하는 각종 데이 터를 전송하며, 상기 IDS 로컬관제 시스템은 모비우스 서버, 영상 분석 서버 및 인명 지킴이 시스템, 피난 유도 시스템 및 재난 대응 시스템을 구비하고, IDS 로컬관제 시스템은 모비우스 서버와 시계열 데이터베이스(TSDB), 영상 분석 서버(Video Server), 센서와 음 원, 영상을 포함하는 재난 모니터링부, 컨트롤 모듈을 구비하며, 통신 미들웨어를 통해 IDS 함체와 연동되고, 센서와 음원, 영상 데이터 수집과 분석 및 모니터링 기능, 영상 분석 서버에 의해 인공 지능의 딥러닝 기반의 객체를 검출하여 재난 상황 영상분석/상황인지/영상의 객체 추적 기능, 지향성 스피커 제어를 위한 컨트럴 기능, 카메라 및 적외선 IR 조작을 위한 컨트럴 기능, Pan/Tilt 조작을 위한 컨트럴 기능, 구난자 및 IDS 폴, 센서 위치 확인을 위한 모니터링 기능, 카메라로부터 획득되는 실시간 영상 확인 및 분석 기능, 모비우스 서버 로부터 수신되는 실시간 센서 데이터확인 기능, 과거 센서 데이터 조회 기능, 재난 문자를 전송하여 피난을 유 도하는 피난 유도 시스템과 이동 차량 재난 경고 방송을 제공하는 재난 대응 시스템에 연동하여 각각 피난 유도 기능(재난 문자 전송)과 재난 대응 기능(이동 차량 재난 경고 방송)을 제공하며, IDS 폴 연동 기능을 제공하며, 상기 IDS 통합관제 시스템은 여러 지역에 분산된 설치된 다수의 IDS 로컬 관제 시스템과 연결되며, 각각의 IDS 로컬 관제 시스템으로부터 재난 상황 정보를 수신하고 IDS 로컬관제 시스템 모니터링을 하며, IDS 폴은 실시간 영상 정보 획득을 위한 카메라, 야간 영상 촬영을 위한 IR LED, 구난자에게 경보방송 송출을 위한 지향성 스피커, 위험 지역 일상 주변 감시 및 구난자 타겟팅을 위한 Pan/Tilt 조절, 통신 미들웨어를 통해 IDS 로컬 관제 시스템의 일부분으로 사용되는 모비우스 서버와 연결된다. 상기 IDS 관제 시스템은 다수의 IDS 로컬 관제 시스템과 IDS 통합 관제 시스템으로 구성된다. 상기 IDS 로컬 관제 시스템은 모비우스 서버, 영상 분석 서버, 인명 지킴이 시스템, 피난 유도 시스템, 재난 대 응 시스템, 지향성 스피커 다중 제어 시스템을 구비한다. 상기 모비우스 서버는 인명 지킴이 시스템, 피난 유도 시스템, 재난 대응 시스템, 지향성 스피커 다중 제어 시 스템과 연동되며, 상기 재난 대응 시스템과 이동통신망을 통해 SMS 서버가 연결되며, 상기 재난 대응 시스템과 연동된 지향성 스피커로부터 비가청 신호를 피난유도 앱(App)이 설치된 스마트 기기로 수신받아 출력하고, 상기 재난 대응 시스템으로부터 SMS 서버를 통해 상기 재난 예상 지역의 셀 커버리지에 있는 이동전화번호들로 재난 경보 문자를 전송하고, 무선 CCTV 카메라와 지향성 스피커와 이동 차량의 재난 발생 경고 방송을 출력한다. 상기 피난 유도 시스템과 연동된 지향성 스피커로부터 가청 신호/비가청 신호를 스마트 기기의 스피커로 출력하 며, 해당 재난 지역의 재난 위치와 재난 안내 문자를 통해 안전 지역으로 피난을 유도하는 피난유도 앱(App)이 설치된 스마트 기기로 전송한다. 상기 피난 유도 운영 시스템과 이동통신망을 통해 연결되며, 상기 피난 유도 시스템과 연동된 지향성 스피커로 부터 가청 신호/비가청 신호를 스마트폰의 스피커로 출력하며, 해당 재난 지역의 재난 위치와 재난 상황 정보와 피난 유도 경로를 제공받는 피난유도 앱(App)이 설치된 스마트 기기를 더 포함하며, 스마트 기기는 스마트폰을 사용하며, 상기 모비우스 서버로부터 스마트폰의 피난유도 앱(지향성 스피커 기반 음 원 방향 탐지용 안드로이드 기반 App)을 통해 비가청 대역의 안내 방송 수신 및 피난 유도를 제공받는다. 도 5c는 센서 노드의 구성 예를 보인 도면이다. 도 5d는 복합 센서 노드의 시스템 구성을 보인 도면이다. 상기 적어도 하나 이상의 IoT 기반 센서는 센싱 정보를 감지하는 측정부; 센서 측정을 위해 각 기능을 제어하는 제어부; 상기 제어부와 연결되며 센서 데 이터를 저장하는 저장부; 무선 센서 네트워크(WSN, 6LoWPAN, MQTT), Wi-Fi, NB-IoT를 이용한 센서 네트워크, 이동통신망(LTE), LoRa 네트워크, 이더넷(Etheenet) 중 어느 하나의 통신 프로토콜을 통해 센서 데이터를 전송 하는 무선 통신부; IoT 프로토콜(예, MQTT 프로토콜)을 제공하는 프로토콜 스택부, ARM 기반의 리눅스 운영체제 를 기반으로 디바이스를 구동하게 하는 디바이스 드라이버, 및 센서 노드에 전원을 공급하는 전원 공급부를 포 함하며, IoT 기반 센서 네트워크 통신 프로토콜(MQTT, NB-IoT)을 연동하기 위한 센서 어댑터를 더 포함할 수 있 으며, 상기 센서 데이터는 센서 노드ID, 센서 장치 ID, 센서 데이터 값을 포함한다. 상시 전원 공급부는 태양 전지 어레이와 충전 콘트롤러와 DC-DC 컨버터와 축전지를 구비하며, 태양열을 사용하 여 소정의 정격 전원을 공급하는 태양전지부를 더 포함한다. 도 5e는 복합 센서 노드-센서 노드 드라이버 테스트를 보인 도면이다. 도 5f는 센서 노드의 유형과 구성을 보인 도면이다. 도 5g는 복합 센서 노드 설치 구성도이다. 도 5h는 본 발명의 실시예에 따른 MQTT 프로토콜을 사용하는 IoT 센서, 센서 네트워크 게이트웨이, 모비우스 서 버, IoT 모니터링 UI, IoT 관리 UI의 기능을 나타낸 도면이다. (실시예) * 센서 모듈 - 마이크 센서 : KB500 마이크 앰프 모듈 - 카메라 센서 : Sony IMX219 이미지 센서 * 센서 어댑터 - oneM2M 플랫폼과 통신 연결을 위해 MQTT 서비스 등록 - 센서 모듈로부터 마이크, 카메라 센서 값을 읽어서 메모리에 저장 - 마이크, 카메라 센서 값 읽는 주기 : 1 분 (스마트 알고리즘 적용) * 모비우스 플랫폼 게이트웨이 - MQTT로 연결된 마이크, 카메라 센서를 모비우스 서버에 등록 - 마이크, 카메라 디바이스에서 데이터를 받아 모비우스 서버로 전송 * 모비우스 플랫폼 서버 - 등록된 마이크, 카메라 디바이스의 센서 데이터 저장, 관리, 제어 - Open API를 통하여 외부 클라이언트가 센서 데이터 접근 * IoT 모니터링 / 분석 GUI - TSDB(시계열 데이터베이스)를 이용하여 마이크, 카메라센서 데이터 저장, 관리 - 센서 데이터를 시각적으로 모니터링하고, 분석하는 도구 제공 * IoT 관리 GUI - IoT 관리 정보 DB에 IoT 센서 디바이스에 관한 정보 저장, 관리 - IoT 센서 디바이스 정보와 센서 데이터를 결합하여 모니터링 [기술 및 시스템의 역할] ○ 사회재난 유형별 분석 및 대응 전략수립 - 사회재난 유형별 대응 기본전략을 수립하고 구체적 대응 시나리오 제공 - 재난 상황에 대한 IDS 기반 인명지킴이 시나리오 및 매뉴얼을 개발 ○ 재난 사고 현장에 설치되어 주변 환경 정보 수집 및 실시간 감시를 위한 융·복합 센서노드를 개발하고 메 쉬 센서 네트워크 및 IoT 네트워크를 제공 - 수난사고 대비용 센서 노드는 강우, 유속, 수위, 음향 등 센서 탑재 ○ 영상분석 및 seamless tracking을 위해 현장 정보(음향, 강우, 유속 등)을 실시간으로 정보 제공 ○ 지향성 스피커의 경보 및 피난유도를 위해 현장 정보(음향, 가스, 화재 등)을 실시간으로 정보 제공 ○ 센서 노드로부터 수집된 재난 정보를 모비우스 서버(Mobius Server)에 저장 및 정보 제공, 재난 관제 센터와 연계 ○ 메쉬 네트워크 기반의 복합센서 노드 개발 - 메쉬 네트워크 기반의 센서 노드, IoT 기반의 센서 네트워크 기술 개발 - 메쉬 네트워크 기반의 동적 센서노드 통신 기술 개발 - NB-IoT를 이용한 센서 네트워크와 인터넷 연결 구현 - 유속 및 수위센서 개발 - 센서노드 기구 및 펨웨어 재설계 및 - 센서노드 스마트 알고리즘 실장 테스트 및 신뢰성 검증 - 센서노드 마이크 신호 분석 및 이벤트 감지 기능 개발 - 센서노드 배터리 방전 경고 기능 개발 - 모비우스 플랫폼 기반 센서 데이터 수집과 센서 제어 시스템 구현 - 센서 데이터 모니터링 시스템 개발 - 센서노드 정보 관리 및 제어 시스템 개발 ○ 상황 인지 및 영상 추적 - 센서 융복합을 통한 상황인지 기술 개발 - Seamless Tracking 기술 개발 ○ 가변출력이 가능한 지향성 스피커 기술 개발 - 구난용 가변출력 지향성스피커 개발 - 지향성 스피커 다중제어 시스템 개발 ○ IDS 시스템 및 폴 제작 - IDS 통합관제 시스템 개발 - IDS 로컬관제 시스템 개발 - 테스트를 위한 IDS 폴 제작 1.2 센서 노드 센서 노드의 제어 모듈은 센서 장치를 제어하고 센서 데이터를 읽어서 IoT 센서 네트워크를 통해 모비우스 서버 로 전달한다. 제어 모듈은 전원 공급부, PA 전원 회로, SDRAM Memory 회로, PLL 회로, GPIO Interfaces, LED 상태 표시 회로 를 구비한다. * 제어 모듈 규격 - CPU : ARM Cortex A53 1.2 GHz (Broadcom BCM2837) - Memory : 1 GB SDRAM - Storage : 16 GB SD - Power Supply : 5 V, 300 mA (average) - Dimension : 85.60 mm ×56.5 mm ×17 mm - Interfaces : GPIO, I2C, SPI 나. 센서 모듈 ○ 기상 센서 : Airmar WeatherStation PB200 도 6은 기상 센서를 보인 도면이다. 기상 센서는 물놀이 지역의 다양한 기상 정보를 실시간으로 수집하기 위한 센서이다. - 진동 센서와 자세 센서는 시설물이 안정적인 자세로 설치되어 있는지 점검 ○ 수위 센서 : FS-IR02 광학 수위 센서 도 7은 광학 수위 센서를 보인 도면이다. 수위 센서는 수위 관측계로써, 교량 중간에 설치된 수위 센서를 사용 하며, 물놀이 장소 인근 상류 지역의 다리 구조물에 설치하여 수위 변화를 측정하기 위한 센서이다. ○ 강우 센서 : Hydreon Rain Gauge Model RG-11 도 8은 강우 센서를 보인 도면이다. 강우 센서는 홍수, 집중호우에 의해 입수 금지 지역, 급류가 발생하는 위험 지역에 비가 내릴 때 물놀이는 위험하므로 물놀이 장소의 현지 강우 상태를 인식하기 위한 센서이다. * Input Voltage : 9 ~ 30VDC, 50V surge - Reverse polarity protected to 50V * Current Drain : 15 mA nominal. (No outputs on, not raining, no heater) - about 1.5 mA in micro-power sleep mode. - 50 mA with output on. - 55 mA - With heater on, 24V dc input. * Output : Relay closure, Normally Open and Normally Closed contacts. - Max load 1A, 24 VDC. * Operating Temperature range : -40 ℃ to +60 ℃ ○ 인체 감지 센서 : SEEED PIR Motion Sensor 도 9는 인체 감지 센서를 보인 도면이다. 인체 감지 센서는 위험 지역에 사람이 출입하는 것을 인식하기 위한 적외선 PIR 센서이다. - Operating Voltage : 3V ~ 5V - Operating Current(VCC = 3V) : 100uA - Operating Current(VCC = 5V) : 150uA - Measuring Range : 0.1 - 6m - Default detecting distance : 3m - Holding Time : 1 25s - Working Wave Length : 7 ~ 14um - Detecting Angle : 120 degrees 센서 노드는 MQTT 프로토콜을 사용하는 경우, 복합 센서 노드 oneM2M TAS 어댑터 모듈이 구현된다. - TAS 어댑터 MQTT 프로토콜을 기반으로 oneM2M Thyme 게이트웨이와 연동하기 위한 인터페이스 모듈 - TAS 어댑터(예, 센서 어댑터)에서 데이터 수집 모듈에서 데이터 수집 주기 관리 - TAS 어댑터에서 장치 제어 모듈에서 장치 세팅 설정과 디바이스 드라이버 초기화 호출 - TAS 어댑터에서 스마트 전송 알고리즘에 따라 IoT 네트워크로 보내는 센서 데이터 제어 및 관리 - oneM2M TAS 어댑터 설치 및 실행 방법 - oneM2M TAS 어댑터 프로그램은 node.js 기반으로 개발되었으므로, 실행하기 위해 node.js 프로그램 설치 필요 1.3 IoT 기반 센서 네트워크 1.3.1 메쉬 네트워크 구현 가. Wi-Fi Mesh network 성능 테스트 라즈베리파이를 메쉬 라우터(mesh router)로 활용하는 형태로 구성 라즈베리파이 3개가 각각 AP(Access Point) 역할을 수행할 뿐만 아니라 서로 또 다른 무선 네트워크를 통해 연 결됨으로써, 하나의 AP에 연결된 모바일 기기가 다른 AP에 연결된 모바일 기기에 직접 연결(direct communication), 즉, 인터넷 연결 없이 AP들끼리 패킷을 전달 이를 위해, 각 라즈베리파이는 최소 2개의 무선랜 인터페이스(무선랜카드) 필요. 하나는 모바일 기기들을 연결 하며, 다른 하나는 메쉬 라우터들끼리 연결 도 10은 Wi-Fi 메쉬 네트워크 구성도이다. Wi-Fi 메쉬 네트워크 구성은 라즈베리파이 초기 설정 후, 안정적인 사용을 위해 Locale, time, keyboard layout, SD카드 전체 용량 활용을 위한 resize 설정 1.3.2 LoRa 네트워크 구현 가. NB IoT (Narrowband Internet of Things) 도 11은 NB-IoT 네트워크 구조를 보인 도면이다. - NB-IoT terminal (가령, 스마트 가스 미터, 스마트 물 미터) : terminals와 NB-IoT module로 구성되고, NB-IoT modules를 사용해서 Uu 인터페이스를 이용하여 eNodeB(기지 국)와 통신 - NB-IoT module : terminals이 NB-IoT 무선 통신 프로토콜에 따라 NB-IoT 네트워크와 통신 - Terminal (가령, 스마트 가스 미터, 스마트 물 미터) : NB-IoT modules과 UART 통신 - eNodeB : NB-IoT 단말은 Uu 인터페이스를 통해 네트워크 액세스 메시지를 처리하고, 셀(cell)을 관리하고, 처 리를 위해 상위 계층 네트워크 요소(NE, Network Element)로 비 액세스 계층(NAS, Non-Access Stratum) 데이터 를 전달하며, NaodeB는 S1-Lite 인터페이스를 통해 IoT EPC에 연결 - IoT EPC : NAS 계층에서 NB-IoT terminals과 정보를 교환하고 프로세싱을 위해 NB-IoT 서비스와 관련된 데이 터를 IoT Platform으로 전달 - IoT platform : 다변화 된 무선 액세스 네트워크로부터의 상이한 유형의 IoT 데이터를 수집하고 데이터 유형 에 기초한 처리를 위해 필요한 데이터를 요구된 서비스 애플리케이션에 전송 - Application server : IoT 데이터를 수집하고, 고객 요구 사항에 따라 데이터 처리 LoRa 기술은 LoRa Alliance 단체에서 기술 규격을 제정하고, 대규모 저전력 장거리 무선통신으로, 이론적으로 LoRa는 전력 소모가 매우 적어 배터리 수명은 10년 이상이다. LoRa의 최대 전송율은 5.47kbps, 셀 커버리지는 10km이며, 통신 가능거리는 도심지역에서는 2～15km, Line of Sight가 확보된 지역에서 30km, 지하는 1～2km, 실내에서는 2～3km이다. 대역폭은 125kHz, 최대송신전력은 14dBm이며 주파수 ISM 밴드에서 동작하고 전송속도는 낮으며 수신감도가 최대 -138dBm가 되도록 대역 확산 방식으로 설계된다. 도 12는 LoRa와 타 기술(Sigfox, LTE MTC, LTE NB IoT)을 비교한 도면이다. 도 13은 LoRa 통신 레이어를 나타낸 도면이다. Physical Layer 통신은 단말과 기지국간 모뎀 칩간에 수행이 되며 MAC Layer 통신은 단말과 네트워크 서버 간에 수행된다. LoRa는 Bandpass Modulation으로 Chip Spread Spectrum 기술을 사용하고 있다. Chip Spread Spectrum 기술은 Long Range, Low Power를 가능하게 하는 LoRa 기술의 핵심적인 부분이다. LoRa의 Long range star는 장거리 연결 시 배터리 수명을 유지하는데 가장 적합하다. LoRa 네트워크에서 노드는 특정 게이트웨이와 관련이 없으며, 각 노드가 전송하는 데이터는 일반적으로 여러 게이트웨이에서 수신한다. 각 게이트웨이는 수신한 패킷을 셀룰러망, 이더넷(Ethernet), Wi-Fi를 통해 센서 노드에서 클라우드 기반 모비 우스 서버로 전달한다. 또한, Intelligence과 complexity가 네트워크 서버(모비우스 서버)로 푸쉬되는데, 네트워크를 관리하고 중복된 패킷을 검사하며 보안성 검사를 수행하며 최적의 게이트웨이로의 스케줄링을 수행한다. 네트워크 수용량의 측면에서 분석해보면, Long Range Star network를 실행 가능하게 하려면 게이트웨이는 대용 량 노드로부터의 메시지를 수신할 수 있는 기능이 있어야 한다. LoRa 네트워크의 높은 네트워크 수용량은 다중 채널의 동시 메시지를 수신할 수 있도록 게이트웨이에서 다중 채 널 다중 모뎀 transceiver를 사용하여 이루어진다. 네트워크 수용량에 영향을 미치는 중요한 요소는 동시 채널 수, 데이터 속도 (대기 시간), 페이로드 길이 및 노 드 전송 빈도이다. 이 중 데이터 속도의 측면에서, 게이트웨이는 동일한 채널에서 동시에 여러 개의 서로 다른 데이터 속도로 수신할 수 있다. 만약, 어떤 노드가 good link이며 게이트웨이에 가까우면, 항상 가장 낮은 데이 터 전송 속도를 사용하고, 필요로 하는 정도보다 오랜 기간 가용 스펙트럼을 점유한다. 데이터 전송 속도를 높 이면, 대기 시간이 단축되고 다른 노드가 전송가능한 잠재적인 공간이 넓어진다. 이러한 기능을 통해 LoRa 네트워크는 매우 큰 네트워크 수용량을 가지며 네트워크를 확장할 수 있어 최소한의 인프라로 네트워크를 구축할 수 있다. LoRa 네트워크는 비동기식이며, event-driven 방식 또는 scheduled 방식의 여부에 관계없이 어디서나 데이터를 보낼 준비가 되면 통신이 가능하며, 최근 GSMA에서 LPWAN 공간을 다루는 다양한 기술을 비교한 결과, LoRa는 다 른 모든 기술 옵션에 비해 3 ∼ 5 배의 우위를 보이고 있다. 1.3.3 센서 모니터링 시스템 구현 가. 센서노드 정보 모니터링 도 14a는 각종 센서 노들로부터 센서 데이터를 센서 네트워크를 통해 수신한 모비우스 서버의 센서 데이터 수신 로그, IoT 모니터링 시스템 화면 그래프(좌), 센서 데이터값(우) 화면이다. 마이크센서 데이터는 influx DB에 데이터를 저장하고, Grafana 기반의 IoT 모니터링 시스템을 통해 다양한 그래 프로 확인한다. 도 14b는 센서 노드ID, 센서 장치 ID, 센서 데이터 값을 추출하여 모비우스 서버에 DB에 저장하는 센서 네트워 크를 통해 IoT 게이트웨이 데이터 처리 모듈 상세 구현 화면이다. 도 14c는 센서 노드가 게이트웨이를 통해 모비우스 서버로 센서 데이터를 전송하는 IoT 센서 네트워크 통신 프 로토콜(MQTT 프토토콜)의 예를 보인도면이다. IoT 센서 네트워크 프로토콜로써 MQTT 프로토콜을 사용하는 경우, 복합 센서 노드는 게이트웨이를 통해 모비우 스 서버로 MQTT 서비스(oneM2M 서비스 등록)를 등록하고, IoT 관리 GUI로 센서 등록을 알리며, IoT 관리 GUI 에 서는 센서 정보가 입력되고, IoT 관리 정보DB에 센서 관련 정보를 저장한다. 복합 센서 노드->게이트웨이->모비우스 서버-> 시계열DB(TSDB) 센서 데이터를 전송하여 저장하며, IoT 모니터링 분석 소프트웨어 또는 IoT 관리 GUI는 TSDB의 센서 데이터를 획득하여 센서 데이터를 모니터링한다. 모비우스 서버는 센서 상태 정보를 IoT GUI로 제공한다. IoT GUI는 모비우스 서버-> 게이트웨이-> 복합 센서 노드로 센서 제어 요청을 전송하며, 복합 센서 노드에서 센 서 설정이 변경된다. 도 14d는 방사각도와 팬틸트 조절이 가능한 가변 출력 지향성 스피커 시스템 구성도이다. 지향성 스피커를 IDS 시스템에서 구난용 가변출력 지향성 스피커로 활용하기 위하여 음향센서 연동과 지향성 스피커 다중제어 시스템 을 개발하였다. 또한, IDS 폴을 제작하여 IDS 로컬 관제 시스템(모비우스 서버)에서 통합 제어가 가능한 카메라, 지향성 스피커, 적외선 IR LED, PTZ 제어기(팬틸트 제어기)를 하나의 시스템으로 구성하여 개발하였다. 예를들면, 강우 센서, 유속 센서, 풍속 센서, 수위 센서, 음향 센서 등의 IoT 기반 센서로부터 감지된 센 서 패킷 데이터들을 무선 센서 네트워크(USN, WSN, 6LoWPAN, MQTT), Wi-Fi, NB-IoT를 이용한 센서 네트워크, 이동통신망(LTE), LoRa 네트워크, 이더넷(Ethernet) 중 어느 하나의 네트워크를 통해 수신받아 프로토콜을 변환 하여 서버로 전송하는 IoT 게이트웨이; 및 상기 어느 하나의 네트워크를 통해 상기 IoT 기반 센서로부터 감지된 센서 패킷 데이터들을 수집하여 저장하며, 센서 데이터 모니터링 및 센서노드 정보 관리 및 제어하는 IDS 로컬 관제 시스템의 관제 시스템을 구비하며, IDS 로컬관제 시스템은 관제 시스템, IDS 폴 제어기 함체와 IDS 폴 구난 함체를 포함하는 IDS 폴을 구비하며, 관제 시스템은 IDS 로컬 관제 시스템 서버(모비우스 서버), 스트리밍 서버, CCTV 카메라 시스템 과 연동되는 영상 분석 서버를 포함하며, IDS 폴 제어기 함체는 지향성 스피커의 볼륨을 조정하는 지향성 스피커 제어기, 설정된 볼륨에 따라 음향이 출력되는 지향성 스피커 앰프, 전원을 공급하는 전원 공급부를 구비하며, IDS 폴 구난 함체는 IDS 로컬 관제 시스템 서버(모비우스 서버)와 연결되며, 지향성 스피커 제어기 와 연결되는 PTZ 제어기와, PTZ 제어기와 연결된 카메라와 IR LED를 구비하며, IDS 폴 제어기 함체의 지향성 스피커 앰프와 연동되는 지향성 스피커 출력부를 구비한다. 지향성 스피커 다중 제어 시스템은 스피커의 볼륨을 조정하는 지향성 스피커 제어기, 설정된 볼륨에 따라 음향 이 출력되는 지향성 스피커 앰프, 전원을 공급하는 전원 공급부를 구비한다. 도 14e 내지 도 14h는 지향성 스피커의 특징을 나타낸 도면이다. 표 3"}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "* 시스템의 주요기능 가. 지향성 스피커 시스템 - 음향센서 정보 취득으로 주변 소음상황을 고려한 자동음압레벨 조절 - 영상정보 및 센서정보 취득으로 객체 수에 따른 자동 방사 지향각도 조절, 패ㅌ틸트 조절 나. 모비우스 서버 기반의 IDS 로컬관제 시스템 - 모비우스 서버와 시계열 데이터베이스(TSDB), 영상 분석 서버(Video Server), 센서와 음원, 영상을 포함하는 재난 모니터링부, 컨트롤 모듈을 구비하며, 통신 미들웨어를 통해 IDS 폴 함체와 연동된다. - 센서와 음원, 영상 데이터 수집 및 분석, 모니터링 기능 - 지향성 스피커 제어를 위한 컨트럴 기능 - 카메라 및 적외선 IR 조작을 위한 컨트럴 기능 - Pan/Tilt 조작을 위한 컨트럴 기능 - 구난자 및 IDS 폴, 센서 위치 확인을 위한 모니터링 기능 - 카메라로부터 획득되는 실시간 영상 확인 기능 - 모비우스 서버 플랫폼으로부터 들어오는 실시간 센서 데이터확인 기능 - 과거 센서 데이터 조회 기능 - 피난 유도 기능(재난 문자 전송)과 재난 대응 기능(이동 차량 재난 경고 방송)"}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "다. IDS 통합관제 시스템 - 여러 지역에 분산된 설치된 IDS 로컬 관제 시스템과 연결 - 통합운영요원에 의한 IDS 로컬관제 시스템 모니터링 기능 라. IDS 폴 IDS 폴은 실시간 영상 정보 획득을 위한 카메라, 야간 영상 촬영을 위한 IR LED, 구난자에게 경보방송 송출을 위한 지향성 스피커, 위험 지역 일상 주변 감시 및 구난자 타겟팅을 위한 Pan/Tilt 조절, 통신 미들웨어를 통해 IDS 로컬 관제 시스템으로 사용되는 모비우스 서버와 연결된다. 도 14i는 지향성 스피커의 외형을 보인 도면이다. 도 14j는 센서와 카메라, 지향성 스피커의 전송 정보를 나타낸 통신 프로토콜 정의 파일이다. 시스템별 사용자 시나리오 1) IDS 통합관제 시스템 평시모드 [IDS 통합관제 시스템 운영요원] [IDS 통합관제 시스템]을 통하여 [IDS 통합관제 시스템]의 각 사이트에 위치한 [IDS 로컬관제 시스템]의 고장 유무에 따라 [시스템 관리자]의 파견여부를 결정한다. [IDS 통합관제 시스템]을 통하여 [IDS 로컬관제 시스템]의 운영상황을 모니터링한다. [IDS 통합관제 시스템]이 관할하는 사이트의 지도상에 [IDS 로컬관제 시스템]의 위치가 POI로 표시되어 있다. 모니터링은 [IDS 로컬관제 시스템]에서 운용중인 [IDS 카메라]의 영상과 센서데이터 값 등을 통하여 수행한다. 정기/비정기적으로 구난기록에 대한 리포트를 작성한다. 정기/비정기적으로 과거 데이터(센서데이터, 영상데이 터, 구난기록)를 바탕으로 리포트를 작성한다. 지향성 스피커 음원, 재난대응절차 매뉴얼에 대한 수정/삭제/추 가에 대한 업무를 수행한다. 상황발생모드 [IDS 통합관제 시스템 운영요원] [IDS 로컬관제 시스템]이 설치된 사이트에서 재난 사고가 발생하게 되면 [IDS 통합관제 시스템 운영요원]에게 [IDS 통합관제 시스템]의 지도상에 표시되어 있는 [IDS 로컬관제 시스템]의 위치를 나타내는 POI의 색상이 변경 되며 알람이 표출된다. 평시는 녹색, 상황발생 시는 적색의 깜빡임으로 표시된다. 알람이 표출되는 POI를 클릭하여 [IDS 로컬관제 시스템]의 [IDS 카메라]영상을 통해 상황을 파악하고 유관기관 에 재난상황발생에 대한 정보를 공유한다. [IDS 통합관제 시스템 운영요원]은 상황에 따라 유관기관의 협조요청 및 추가구조장비 현장출동 요청업무를 수 행한다. [IDS 로컬관제 시스템]의 시스템 등의 이상으로 제어가 필요한 상황이 발생하게 되면 [IDS 통합관제 시스템 운 영요원]은 [IDS 로컬관제 시스템]에 원격접속을 실시하여 구난활동 업무를 수행한다.[IDS 통합관제 시스템 운영요원]에 의한 [IDS 로컬관제 시스템]의 원격제어는 웹을 통한 직접 접속을 실시하여 시스템의 제어권을 가져와서 운영한다. 긴급상황 발생에 따른 시스템 제어 운영의 매뉴얼은 상황에 맞는 재난대응 절차 매뉴얼을 따른다. 시스템관리 모드 [시스템 관리자] [IDS 통합관제 시스템]에서 [IDS 로컬관제 시스템]의 제어 로그, [IDS 로컬관제 시스템]의 로그/센서데이터/영 상데이터를 관리한다. 정기/비정기 적으로 DB의 관리업무(백업 및 삭제)를 수행한다. [IDS 통합관제 시스템]과 [IDS 로컬관제 시스템]간의 네트워크 문제 발생 시 점검과 보완 업무를 수행한다. [IDS 통합관제 시스템 운영요원]의 요청에의한 [IDS 로컬관제 시스템]의 점검 및 수리 업무를 수행한다. 2) IDS 로컬관제 시스템 : 무인 평시모드 [IDS 로컬관제 시스템] [IDS 폴]의 [IDS 카메라]를 통해 감시지역을 지속적으로 촬영한다. [IDS 카메라]는 [팬틸트]에의해 자동으로 일정한 시간으로 좌우회전을 하며, 감시지역을 촬영한다. [영상분석 서버]에서는 [모비우스 서버 플랫폼]을 통해 들어오는 센서 데이터를 이용하여 감시지역의 위험도 구 분을 [안전구역], [주의구역], [위험구역]의 3단계로 구분하여 사이트 감시에 활용한다. 위험도 구분에 따라 객체가 안전구역을 벗어나서 주의구역 또는 위험구역으로 진입하는지에 대한 인지를 하고, 진입하는 객체가 발생하면 이벤트 상황 발생에 대한 정보를 [관제 서버]에 전달한다. 이벤트 상황 발생에 대한 정보를 받은 [관제 서버]는 [재난대응절차 매뉴얼]에 따라서 상황 대처를 시작한다. [재난대응절차 매뉴얼]은 [IDS 통합관제 시스템 운영요원]에 의해 사전에 정의된 재난상황별 대처 방안을 제공 한다. 상황발생모드 [IDS 로컬관제 시스템] 사전에 [모비우스 서버 플랫폼]으로부터 들어오는 센서 데이터에 의해 [영상분석 서버]가 설정한 감시지역의 위 험도 구분에 따라 객채가 [안전구역]에서 [주의구역]의로 진입함을 [IDS 카메라]를 통해 촬영된 정보가 [영상분 석 서버]에서 인지를 하고 이벤트 발생에 대한 정보를 [로컬관제 서버]로 전송한다.이후 객체는 [구난자]로 분 류가 되고 개별 ID가 분류된다. [구난자]는 [IDS 카메라]의 영상 중심에 위치하게 되고, 자동적으로 [지향성 스피커]와 일직선 상에 놓이게 된 다. 급류, 물살 등에 의하여 [구난자]가 하류로 이동하게 되면 카메라는 자동으로 [구난자]를 따라서 회전하게 된다. 이벤트 발생 정보를 받은 [로컬관제 서버]에서는 사전에 정의된 [재난대응절차 매뉴얼]에 따라서 진행한다. [로컬관제 서버]에서는 이벤트 발생 정보를 수신 이후 [IDS 통합관제 시스템]에 알람을 보내준다. [로컬관제 서버]에서 HW를 제어하여 팬틸트를 조작 [IDS 카메라]와 [구난자]가 일직선 상에 오도록 정렬을 실시 하고, [지향성 스피커]에서 경보방송을 송출한다. [로컬관제 서버]에서 [재난대응절차 매뉴얼]에 따라서 구난활동을 실시하고서부터의 모든 활동에 대한 로그를 DB에 저장한다. [로컬관제 서버]에서는 상황이 종료된 이후 평시모드로 전환된다. 상황 종료는 [구난자]가 감시지역의 위험도 구분에 따른 [안전구역]으로의 이동이 완료된 시점으로 한다. [구난자] 재난상황 발생 시 [지향성 스피커]를 통해 나오는 경보방송의 정보를 확인하고 [안전구역]까지 피난행동을 취한 다. 시스템관리 모드 [시스템 관리자] [IDS 통합관제 시스템]에 포함 운영 3) 영상분석서버 평시모드 [영상분석서버] [모비우스 플랫폼]을 통해서 들어오는 센서 정보를 바탕으로 감시지역의 위험도 구분을 [안전구역], [주의구 역], [위험구역]으로 구분 설정한다. [IDS 카메라]를 통해 들어오는 영상을 통해 이벤트 발생 여부에 대하여 분 석 한다. 상황발생모드 [영상분석서버] [IDS 카메라]를 통해 들어오는 영상을 통해 이벤트 발생여부를 감지하고, 그에 대한 정보를 [로컬관제 서버]로 전송한다. 안전구역]에서 [주의구역]으로 진입하는 객체에 대하여 상황을 인지하고 그에 대한 정보를 [로컬관제 서버]로 전송한다. [주의구역]에서 [위험구역]으로 진입하는 객체에 대하여 상황을 인지하고 그에대한 정보를 [로컬관제 서버]로 전송한다. 감지된 영상의 객체의 아이디와 아이디별 위치정보도 함께 전송한다. 객체의 아이디와 위치정보는 [로컬관제 서버]에서 받아 지도상에 [구난자]의 위치를 표시하기 위함이다. 시스템관리모드 [시스템 관리자] [IDS 통합관제 시스템]에 포함 운영 도 32a, 32b 및 33은 관제 시스템에서 모니터링 UI 화면을 보인 도면이다. 4) IDS 폴 평시모드 [CCTV] - [IDS 로컬관제 시스템]에 포함 [지향성스피커] - [IDS 로컬관제 시스템]에 포함 [팬틸트 조절] - [IDS 로컬관제 시스템]에 포함 상황발생모드 [CCTV] [IDS 로컬관제 시스템]에 포함 [지향성스피커] [IDS 로컬관제 시스템]에 포함 [팬틸트 조절] [IDS 로컬관제 시스템]에 포함 시스템관리모드 시스템 관리자는 IDS 통합관제 시스템에 포함하여 운영한다. 가. IDS 로컬관제 시스템 - IDS 로컬관제 시스템이 설치되어 있는 사이트의 지도를 2D로 가시화 - 로컬사이트 하드웨어 위치정보 가시화 - 2D 지도상에 하드웨어의 위치를 하드웨어 종류별 아이디별 위치를 나타냄 - 로컬사이트 하드웨어 속성정보 가시화 - 지도상에서 가시화되어 있는 하드웨어 아이디를 선택하면 선택된 하드웨어의 속성정보가 출력 - 하드웨어 연결상태 정보 가시화 - 로컬사이트에 설치된 하드웨어의 네트워크 연결상태 정보를 제공 - 구난자 및 구난활동 가시화 - 구난자 발생에 의해 카메라에 의한 구난자의 위치정보를 받아와서 로컬사이트 지도상에서 구난자의 위치를 POI 등으로 가시화 - 스트리밍 영상 가시화 - 카메라를 통해 들어오는 실시간 영상을 가시화 - 센서데이터 가시화 모비우스 서버 플랫폼을 통해 수신되고 있는 센서 데이터를 사용자의 선택에 따라 가시화, 기간별, 종류별, 센 서별로 분류할 수 있으며, 테이블과 차트의 형태로 가시화, 가시화된 테이블 또는 차트는 출력(print) 또는 다 운로드(엑셀 형식) 할 수 있다 - 음원선택 정보 가시화 - 현재 몇 번 지향성 스피커에서 몇번의 음원이 송출되고 있는지 가시화, 음원 DB에 저장되어 있는 음원들에 각 각 번호를 부여하여 가시화 - 방사지향각도 선택 가시화 - 현재 선택된 지향성 스피커가 몇단계 방사지향각도로 되어 있는지 가시화 - 음압레벨 선택 가시화 - 선택된 지향성 스피커의 음압레벨이 어느 정도 인지 가시화 - 적합재난대응절차 매뉴얼 가시화 - 영상분석 모듈에서 넘어오는 상황인지 정보에 따라 DB에 저장되어 있는 재난대응 절차 매뉴얼 중 이벤트 상황 과 자장 적합한 매뉴얼을 선별하여 가시화 2) 소프트웨어 컨트럴 - Playback : 영상 DB에 저장되어 있는 과거 영상정보를 운영자의 선택에 따라 재생 - 센서데이터 조회 : 모비우스 서버 플랫폼으로부터 들어오는 센서 데이터를 기간별, 종류별, 센서별로 분류하 여 가시화하기 위하여 센서를 선택할 수 있음 - 재난대응절차 매뉴얼 설정 - 상황에 따른 재난대응절차 매뉴얼을 수정하고, 새롭게 생성할 수 있음 3) 외부연동 서비스 - IDS 로컬 관제 시스템과 IDS 통합관제 시스템 연동 - 여러 지역에 분산된 IDS 로컬 관제 시스템의 로컬사이트들이 IDS 통합관제 시스템에서 모니터링과 제어를 할 수 있게 시스템이 연동된다. 4) 하드웨어 컨트럴 - 팬틸트 컨트럴: 카메라와 지향성 스피커가 부착된 함체의 팬틸트를 조작하여 팬틸트를 상하/좌우 구동을하여 카메라를 통해 주변을 확인할 수 있음 - 지향성스피커 다중제어: 로컬 사이트에 설치된 지향성 스피커 각각에서 별도의 음원이 송출될 수 있도록 제어 - 음압레벨 컨트럴: 지향성스피커의 음압레벨을 조절하기 위하여 시스템에서 엠프로 음압조절 신호를 전송할 수 있다 - 방사지향각도 컨트럴: 로컬사이트 시스템에서 지향성 스피커의 방사지향각도를 조절하기 위한 신호를 전송할 수 있음 - 음원 컨트럴: 적합재난대응절차 매뉴얼에 따라서 송출할 음원의 종류가 결정되고 나면, 해당 지향성 스피커에 서 음원을 송출 - IDS 카메라 컨트럴 IDS 카메라의 줌인/줌아웃을 IDS 로컬관제 시스템에서 컨트럴 할 수 있음 나. IDS 통합관제 시스템 1) 모니터링 - IDS 로컬관제 시스템 통합 모니터링 - IDS 통합관제 시스템이 관리하는 지역의 지도위에 로컬관제 시스템이 설치된 위치가 POI로 표시됨 - IDS 로컬관제 시스템 영상 모니터링 - 지도상에 표시된 로컬관제 시스템을(POI로 표시되어 있음) 선택하면 해당 사이트의 IDS 카메라 영상이 나타남 - 로컬 하드웨어 연결상태 모니터링 - 선택된 로컬사이트에 설치되어 있는 하드웨어들의 네트워크 연결상태를 모니터링 - 로컬사이트 센서 데이터 모니터링 - 선택된 로컬사이트에서 모비우스 플랫폼을 이용해 수집되고 있는 센서데이터들을 모니터링 - IDS 로컬 관제 시스템의 로컬사이트 Playback 모니터링 - 선택된 로컬사이트의 영상 DB에 저장되어 있는 과거 영상정보를 필요에 따라 확인할 수 있음 - 로컬사이트 재난대응절차매뉴얼 모니터링 - 선택된 로컬사이트에서 운용되고 있는 재난대응절차 매뉴얼을 모니터링 도 14k는 분석 영상 에뮬레이터 화면이다. 모비우스 서버는 인명 지킴이 시스템과 피난 유도 시스템, 재난 대응 시스템은 재난 지역을 지도 상에 표시하는 GIS 서버와 연동되며, 태풍, 해일, 강풍, 폭우에 따른 수해 또는 지진 경보에 따른 재난 지역 지도가 표시된다. 상기 재난 대응 시스템과 이동통신망을 통해 연결되며, 피난유도 앱(App)이 설치된 스마트 기기(이동통신 단말 기, 스마트폰)를 더 포함하며, 태풍, 해일, 폭우, 홍수의 수난 재해가 예상될 경우 재난 대비 조치로써, 재난 대응 시스템으로부터 해당 재난 예상 지역의 이동 전화번호들로 재난 경보 문자를 전송하고, 이동 차량의 폴대에 고정된 지향성 스피커로부터 20Hz ~ 20kHz 가청 대역의 재난 대피 음성 방송을 송출하며, 해당 지역의 고정형 지향성 스피커로부터 비가청 신호 주파수를 해당 지역의 스마트 기기로 전송하여, 비가청 신호 주파수를 통해 안전 지역으로 피난을 유도한 다. 모비우스 서버는 인명 지킴이 시스템, 피난 유도 시스템, 재난 대응 시스템을 구비하며, 재난 대응 시스템과 이 동통신망의 SMS 서버와 연결되며, 상기 재난 대응 시스템과 연동된 지향성 스피커로부터 비가청 신호를 피난유 도 앱(App)이 설치된 스마트 기기(스마트폰, 이동통신 단말기)로 수신받아 출력하고, 상기 재난 대응 시스템으 로부터 SMS 서버를 통해 상기 재난 예상 지역의 셀 커버리지에 있는 스마트기기의 이동전화번호들로 재난 경보 문자를 전송한다. 예를 들면, 상기 지향성 스피커는 스피커 앰프 일체형 AMP 재설계로 음압 레벨 출력 향상하여 30dB 이하 음압레 벨, 750m 최대 도달거리 향상, 50m 음성 도달거리 향상, 최대 ±90° 방사각도, 방사 각도 자동 조절 시스템,단계별 방사 각도 수동 조절, 영상 정보 및 센서 연계 시스템, 방수, 방진, 진동 저감 기술이 적용된다. 1.4 상황인지 및 영상추적 1.4.1 센서 융·복합을 통한 상황인지 기술 개발 ○ 객체 검출 및 추적 - 컴퓨터 비전에서 객체 검출은 영상 내 어떤 종류의 객체가 어느 위치에 있는지 찾아내는 기술이다. 따라서, 분류(classification)와 지역화(localization)의 두 가지 문제를 해결해야 한다. 도 15는 객체 검출의 예를 보인 도면이다. 영상 분석 서버는 상기 CCTV 카메라 시스템과 연동되며, 행동 인지 기반 영상 내 객체 추적을 위한 딥러닝 기술 중 합성곱 신경망(CNN) 구조의 특징맵 정보를 객체의 특징 정보를 사용하여 이전 영상, 현재 영상, 이전 영상의 객체의 영역정보를 입력으로 받고 현재의 객체의 위치 정보를 결과로 출력하여 영상 내의 객체를 추적한다. 영상 분석 서버는 영상의 객체를 추출하고 행동 인지 모델의 객체를 추적하기 위해 CNN 구조의 중간 몇 개의 convolutional layer에서 객체 위치영역과 종류 정보를 포함하는 특징지도를 추출하고, Pooling layer를 통과함 에 따라 특징지도의 크기가 작아지는데 각기 다른 크기의 특징지도에서 객체 위치영역 정보를 추출하기 때문에 크기(scale)에 강인한 객체를 검출하며, 영상 객체의 행동 인지 모델이 저장된 CNN 학습데이터와 연계되고, 재 난 감지 및 대응은 실시간성과 빠른 처리속도가 중요하므로 영상 내의 객체 검출의 처리속도가 빠른 SSD(Single Shot multi-box Detector) 또는 Faster RCNN 알고리즘을 사용한다. 영상 분석 서버는 상기 CCTV 카메라 시스템과 연동되며, 행동 인지 기반 영상 내 객체 추적을 위한 딥러닝 기술 중 합성곱 신경망(CNN) 구조의 특징맵 정보를 객체의 특징 정보를 사용하여 이전 영상, 현재 영상, 이전 영상의 객체의 영역정보를 입력으로 받고 현재의 객체의 위치 정보를 결과로 출력하여 영상 내의 객체를 추적한다. 영상 분석 서버는 영상의 객체를 추출하고 행동 인지 모델의 객체를 추적하기 위해 CNN 구조의 중간 몇 개의 convolutional layer에서 객체 위치영역과 종류 정보를 포함하는 특징지도를 추출하고, Pooling layer를 통과함 에 따라 특징지도의 크기가 작아지는데 각기 다른 크기의 특징지도에서 객체 위치영역 정보를 추출하기 때문에 크기(scale)에 강인한 객체를 검출하며, 영상 객체의 행동 인지 모델이 저장된 CNN 학습데이터와 연계되고, 재 난 감지 및 대응은 실시간성과 빠른 처리속도가 중요하므로 영상 내의 객체 검출의 처리속도가 빠른 SSD(Single Shot multi-box Detector) 또는 Faster RCNN 알고리즘을 사용한다. 상기 영상 분석 서버는 영상 내의 객체 검출의 처리속도가 빠른 SSD(Single Shot multi-box Detector) 또는 Faster RCNN 알고리즘을 사용한다. 상기 영상 분석 서버는 영상의 객체를 추출하고 행동 인지 모델의 객체를 추적하기 위해 CNN 구조의 중간 몇 개 의 convolutional layer에서 객체 위치영역과 종류 정보를 포함하는 특징지도를 추출하고, Pooling layer를 통 과함에 따라 특징지도의 크기가 작아지는데 각기 다른 크기의 특징지도에서 객체 위치영역 정보를 추출하기 때 문에 크기(scale)에 강인한 객체를 검출하며, 영상 객체의 행동 인지 모델이 저장된 CNN 학습데이터와 연계되어 위험 지역 이동하는 객체 및 특정 시간 동안 이상 행위 객체를 추출하여 알람을 발생한다. IDS 관제 시스템은 다수의 IDS 로컬 관제 시스템과 IDS 통합 관제 시스템으로 구성되며, 상기 IDS 로컬 관제 시스템은 모비우스 서버, 영상 분석 서버에 의해 인공 지능의 딥러닝 기술을 적용하여 객체 를 추출하고 그 객체를 추적하며, 그 객체의 수난 사고/익사 사고 이상 징후, 사고 다발 지역, 위험 지역 이상 상황 이벤트에 따른 상황에서의 행동인지를 학습 데이터베이스에서 정의하고, 영상 내 객체가 사고 다발 지역 또는 위험 지역으로 이동하거나 위험 지역 내에서 사라짐, 달리기, 걷기, 넘어짐, 특정 시간 이상 동안 잠김, 구조 요청 상황 등의 영상의 객체의 행동인지를 통해 위험 지역의 영상 내 객체의 사고 발생 징후를 발견하고, 재난 대응 IDS 기반 인명 지킴이 시스템에 의해 안전요원에 긴급 문자 메시지를 전송하여 안전 조치를 취하게 한다. ○ 객체 검출(object detection)을 위한 딥러닝 모델(deep learning model) - 2012년 AlexNet 이후로 딥러닝 기반 객체 분류 기술은 계속 발전하여 인간의 분류능력보다 뛰어날 정도로 발 전하였다. 따라서 객체 검출에서 객체의 위치 지역화가 중요하다. 초기 객체 검출에서는 selective search,sliding window 등의 방법으로 영상 내 모든 후보 영역들을 추출하고 이 영역을 각각 딥러닝 구조에 통과시켜 분류하는 방식이었다. 하지만, 이런 처리방식은 현저하게 느렸기 때문에 객체검출에서 처리속도를 향상시키기 위한 방법론이 계속 연구되었다. 객체검출에서 성능이 좋은 딥러닝 모델로 Faster RCNN과 Single Shot multi- box Detector(SSD)가 있다. 두 가지 모델 모두 지역화 과정이 영상의 특징(feature)을 추출하는 과정에 연장선이거나 통합되는 구조를 갖는 다. 이러한 구조를 통해 딥러닝을 이용한 실시간 객체검출이 가능해졌다. 일반적으로 검출성능은 Faster RCNN이 조금 더 뛰어나고 처리속도는 SSD가 더 빠르다. - Faster RCNN(Region based Convolutional Neural Network) 도 16은 Faster RCNN을 보인 도면이다. 영상의 특징(feature)을 추출하는 합성곱 신경망(CNN)의 마지막 convolutional layer에 후보영역을 추출하는 region proposal network가 이어진다. 하나의 sliding window에서 객체의 스케일(scale)과 비율(aspect rati o)을 고려한 k개의 anchor box를 고려한다. Faster RCNN은 RPN(Region Proposal Network)을 구성하여 기존의 Fast RCNN과 컨볼루션 특징을 공유하여 병합 한 것이다. Fast RCNN은 이미지 하나에 CNN 계산 한번을 통해 물체 추정 영역을 모두 추론한다. Fast RCNN은 전체 영상과 객체들을 입력받고, 전체 영상에 대한 CNN의 특징 지도(feature map)를 획득한다. ROI(Region of Interest) 풀링층은 각각의 개체에 대하여 특징지도(feature map)로부터 고정된 길이의 특징벡터 를 추출한다. 각각의 특징벡터는 FC(Fully Connected)층을 통해 하나의 시퀀스가 되어, 소프트맥스(Softmax)를 통한 확률 추정과 경계 박스의 위치를 출력한다. 풀링(Pooling)은 다양한 위치에서 특징의 통계를 집계하여 이미지의 해상도를 줄일 수 있는 하위 샘플링 프로세 스이며, 풀링은 회전, 노이즈 및 왜곡과 같은 이미지 변형에 견고성을 향상시켜, 풀링에는 최대값 풀링과 평균 값 풀링 두 가지 방법이 사용된다. 하나의 CNN 분류기는 컨볼류션층과 풀링층이 반복되며 구조에 따라 아향한 기능의 층들이 추가될 수 있다. 입력 이미지에 대하여 컨볼류션과 풀링 과정을 거쳐 추출된 특징은 다양한 분류기들(예, SVM 분류기)을 적용시켜 분 류될 수 있다. ○ Single Shot multi-box Detector(SSD) CNN 구조의 중간 몇 개의 convolutional layer에서 객체 위치영역과 종류 정보를 포함하는 특징지도(feature map)를 추출한다. Pooling layer를 통과함에 따라 특징지도의 크기가 작아지는데 각기 다른 크기의 특징지도에 서 객체 위치영역 정보를 추출하기 때문에 크기(scale)에 강인한 객체 검출이 가능하다(큰 특징지도에서는 작은 객체, 작은 특징지도에서는 큰 객체를 추출). 도 17은 SSD(Single Shot multi-box Detector) 구조, 도 18은 SSD에서 특징지도 크기에 따른 객체 추출 예를 보인 도면이다. (a)의 ROI 후보 영역의 이미지에서, (b) 8 x 8 특징 지도, (b) 4 x 4 특징 지도를 나타낸다."}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "○ 객체 검출 결과 - 사람 객체 검출 COCO, Pascal VOC 데이터베이스는 정지영상이고 비교적 영상 내 큰 객체들이 포함되어 있다. CCTV 영상에서는 사람 객체의 크기가 작고 사람 객체의 움직임으로 인한 블러 현상이 발생하므로 이를 보완하기 위해 추가적인 학습데이터가 필요하다. 따라서, 자체 데이터베이스를 구축하고 학습시켜서 단점을 보완하였다. 재난 감지 및 대응은 실시간성이 매우 중요하므로 영상 내의 객체 검출의 처리속도를 우선시하여 SSD(Single Shot multi-box Detector) 구조를 사용한다. 도 19는 COCO 데이터베이스만 학습한 모델을 CCTV 영상에 적용한 예, 구축한 데이터베이스를 추가 학습시킨 모 델을 CCTV 영상에 적용한 예를 보인 도면이다. ○ 객체 추적 객체 추적기술은 객체 검출기술을 통해 검출된 객체를 여러 시간에 걸쳐 따라가며 변경되는 위치를 감지하는 기 술이다. 기존의 연구에서는 이전 프레임의 객체의 영역정보를 이용하여 특징을 추출하고 다음 프레임에서 그 특징과 가 장 유사한 영역을 찾는 기법들이 가장 많이 사용되었다. ○ 객체 추적을 위한 딥러닝 모델 최근, 딥러닝 기술 중 입력층(input layer), 은닉층(hidden layer), 출력층(output layer)의 다층 구조로 구성 된 합성곱 신경망(CNN) 구조의 특징맵 정보를 객체의 특징 정보로 이용하는 방법들이 연구되고 있다. 전체적인 딥러닝 구조는 이전 영상, 현재 영상, 이전 영상의 객체의 영역정보를 입력으로 받고 현재의 객체의 위치 정보 를 결과로 출력한다. 현재는 5층의 convolution layer와 3층의 fully_connected layer로 이루어져 있다. 객체 추적을 학습하기 위해 객체 추적용 데이터베이스를 사용하여, 다음 프레임에서의 정답 위치와 네트워크의 출력 위치의 오차를 계산하 여 학습한다. 학습이 완료된 네트워크는 객체 검출 네트워크와 연동하여 이전 프레임의 객체의 정보를 전달받아 현재 프레임 에서의 객체의 위치를 출력할 수 있다. 도 20은 객체 추적을 위한 딥러닝 구조를 보인 도면이다. ○ 객체 추적 결과 도 21은 객체 추적 결과를 보인 도면이다. 1.4.2 Seamless Tracking 기술 개발 가. Re-identification 기술 결과 재난 감지 및 대응을 위해 검출한 객체들을 계속 추적하여 신분을 확인하는 기술이 필요하다. ○ Person re-identification을 위한 CNN 구조 - 두 가지 영상의 쌍을 입력으로 하여 같은 인물인지 또는 다른 인물인지 판별하도록 학습을 진행한다. - 공통된 학습 파라미터를 갖는 tied convolutional layer 사용한다. - Tied convolutional layer를 각각 통과하여 나온 특징지도 간의 차이를 이용하는 cross-Input Neighborhood Differences 과정을 거쳐 두 영상이 같은 신분인지 아닌지를 나타내는 특징을 추출한다. 도 22는 Person re-identification을 위한 CNN(Convolutional Neural Network, 합성곱 신경망) 구조를 보인 도 면이다. 참고로, 기존 Multi-Layer Neural Network의 문제점은 변수의 개수, 네트워크 크기, 학습시간 세가지 문제가 발 생할 수 있다. 예를 들면, MLNN을 이용하여 16 * 16 크기의 필기체를 인식하는 네트워크를 만든다고 하면, hidden layer가 한 층이고 100개의 뉴런을 가지고 있는 경우, 이 네트워크에 필요한 가중치(weight)와 편향 (bias)는 총 28326개가 필요하게 된다. 만약, hidden layer를 한층 더 사용할 경우 파라미터 개수는 매우 많아 지게 된다. 또한, 글자를 전체적으로 2픽셀씩 이동하게 되면 새로운 학습데이터로 처리해야 하는 문제점이 있을 뿐만아니라, 글자의 크기, 회전, 변형이 있게 되면, 이에 대한 새로운 학습데이터를 입력해야 하는 문제가 있다. 글자의 형상은 고려하지 않고, raw data를 직접 처리하기 때문에 많은 양의 학습데이터가 필요하고, 따라 서 학습시간이 길어지게 된다. 이와 달리, CNN(Convolutional Neural Network, 합성곱 신경망)의 구조는 완전연결계층(Fully-Connected Layer)과는 다른점이 있다. Fully-Connected Layer에서는 Affine계층으로 구현했지만, CNN에서는 합성곱 계층 (Convolutional Layer)과 풀링 계층(Pooling Layer)가 추가된다. * 합성곱 계층(Convolutional Layer, Conv Layer) 이러한 MLNN의 문제를 해결하기 위해 만든 것이 합성곱 계층이다. 필기체나 MNIST 데이터 같은 이미지 데이터는 채널, 세로, 가로 이렇게 3차원으로 구성된 데이터이다. Affine 계층에서는 3차원 데이터를 1차원 데이터 (784=28*28)로 바꿔 입력했지만, 합성곱에서는 3차원 데이터(1, 28, 28)를 입력하고 3차원의 데이터로 출력하므 로 형상을 유지할 수 있다. CNN에서는 이러한 입출력 데이터를 특징맵(Feautre Map)이라고 한다. * 합성곱 계층 - 연산 합성곱 계층에서 연산이 이루어진다. 데이터와 필터의 모양을 (높이, 너비)로 나타내고, 윈도우(Window)라고 부 른다. 예를들면, 입력데이터는 (4, 4), 필터는 (3, 3)이고, 필터가 바로 Conv Layer의 가중치에 해당한다. 합성곱 연산은 필터의 윈도우(Window, 윈도우 사이즈 예 (3,3))를 일정한 간격으로 이동해가며 계산한다. 합성 곱 연산은 입력데이터와 필터 간에 서로 대응하는 원소끼리 곱한 후 총합을 구하게 되며, 이것을 Fused Multiply-Add(FMA)라고 한다. 편향은 필터를 적용한 후에 더해주게 된다. * 합성곱 계층 - 패딩(Padding) 패딩(Padding)은 합성곱 연산을 수행하기 전, 입력데이터 주변을 특정값으로 채워 늘리는 것을 말한다. 패딩 (Padding)은 주로 출력데이터의 공간적(Spatial)크기를 조절하기 위해 사용한다. 패딩을 할 때, 채울 값은 hyperparameter로 어떤 값을 채울지 결정할 수 있다. 주로 zero-padding을 사용한다. 패딩을 사용하는 이유는 패딩을 사용하지 않을 경우, 데이터의 Spatial 크기는 Conv Layer를 지날 때 마다 작아 지게 되므로, 가장자리의 정보들이 사라지는 문제가 발생하기 때문에 패딩을 사용한다. * 합성곱 계층 - 스트라이드(Stride) 스트라이드는 입력데이터에 필터를 적용할 때 이동할 간격을 조절하는 것, 즉 필터가 이동할 간격을 말한다. 스 트라이드 또한 출력 데이터의 크기를 조절하기 위해 사용한다. 스트라이드(Stride)는 보통 1과 같이 작은 값이 더 잘 작동하며, Stride가 1일 경우 입력 데이터의 spatial 크기는 pooling 계층에서만 조절하게 할 수 있다. * 합성곱 계층 - 출력크기 계산 패딩과 스트라이드를 적용하고, 입력데이터와 필터의 크기가 주어졌을 때 출력 데이터의 크기를 구하는 식은 아 래 식과 같다."}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "* 풀링 계층(Pooling Layer) 상기 합성곱 계층에 대해 알아보았다. CNN의 또 다른 계층인 풀링계층(Pooling Layer)을 설명한다. 풀링 계층은 합성곱 계층의 패딩과 스트라이드처럼 데이터의 공간적 크기를 축소하는데 사용한다. 주로 합성곱 계층(Conv Layer)에서 출력데이터의 크기를 입력데이터의 크기 그대로 유지하고, 풀링계층(Pool 에서만 크기를 조절한다. 풀링에는 Max-Pooling과 Average pooling이 있는데 Max-Pooling은 해당영역에서 최대값을 찾는 방법 이고, Average-Pooling은 해당영역의 평균값을 계산하는 방법이다. 이미지 인식 분야에서는 주로 Max-Pooling을 사용한다. 또한, 풀링계층에서는 풀링의 윈도우 크기와 스트라이드 값은 같은 값으로 설정한다. ○ CUHK-03 데이터베이스 실험결과 무작위로 추출한 validation에 대하여 84.6%의 정확도를 갖는다. 도 23은 CUHK-03 데이터베이스(같은 행은 동일인물)를 보인 도면이다. 1.4.3 빅데이터 획득 및 테스트 도 24는 객체 검출을 위한 빅데이터 데이터베이스 취득하는 화면이다. - 객체 검출을 위한 공개 데이터베이스 사용 : Common Objects in Context Dataset(COCO), Pascal Visual Object Classes(VOC) - 블랙박스나 CCTV 영상을 이용한 데이터베이스 취득: 영상 내 객체의 종류와 위치영역 정보를 직접 주석 - 사전에 훈련된 딥러닝(deep learning) 모델을 이용하여 객체 검출 진행 후 보정: 오 검출 영역 제거 및 검출 되지 않은 영역 지정 도 25는 오 검출 영역 제거 화면이다. * 영상 획득시, 수난 사고/익사 사고 이상 징후 카메라 촬영 행동별 움직임 a. 사라짐 행동 시연(좌면, 우면, 후면, 전면) 5명 이상 - 수영을 하다가 사라짐(잠수해서 보이지 않음) - 허벅지 수위 천천히 걷다가 갑자기 사라짐(잠수해서 보이지 않음) - 가슴 수위 천천히 걷다가 사라짐(잠수해서 보이지 않음) b. 익수 부유 상황 - 얼굴이 물에 잠긴 상태로 부유하는 상황 - 얼굴이 물에 잠김 상태로 부유 후 허부적거리는 상황 - 얼굴이 하늘을 보고 부유하는 상황 c. 튜브 익수 상황 - 튜브를 몸에 끼우고 전면 익수 부유 상황 - 튜브를 몸에 끼우고 전면 익수 허부적 팔이 움직이는 상황 - 튜브를 몸에 끼우고 상체가 잠겨 하체만 움직이는 상황 d. 2명의 물장난 후 1명이 익수 부유상황) e. 2명의 물장난 후 튜브 익수 상황 f. 1명의 위험구역 배회(각 인원 각 방향별로) - 발목 수위 배회 - 허리 수위 배회 - 가슴 수위 배회 g. 4인 이상 각각 위험구역 배회(겹침, 1명 잠수 사라짐 ) - 발목 수위 배회 1명 갑자기 사라짐 - 허리 수위 배회 1명 갑자기 사라짐 - 가슴 수위 배회 1명 갑자기 사라짐 도 26은 CCTV 카메라에서 바라본 하천 사진이다. 도 27은 입수 금지 위험 지역 CCTV 카메라 촬영 사진이다. 도 28은 해질녁 개인 입수, 위험 지역 이동 CCTV 카메라 촬영 사진이다. * 이상상황 이벤트에 따른 다양한 상황에서의 행동인지 정의, 위험 지역으로 이동 * 위험 지역 내에서 사라짐, 달리기, 걷기, 넘어짐 등의 행동인지를 위한 딥러닝 모델 선정 - CNN + LSTM 기반 모델 - 3D CNN 기반 모델 - 행동인지 모델의 성능 테스트 * Re-identification 개발을 위한 세부적 기술 내용 추가 - CCTV 카메라 영상의 객체 검출기를 통해 추출된 사람 영역을 합성곱신경망(CNN)의 입력으로 통과시켜 특징을 추출한다. 추출된 특징을 사용하여 학습을 통해 동일인물 유무를 추정한다. * Seamless Tracking 기술을 위한 기반 기술 개발 - 객체 검출을 위한 딥러닝 모델 선정 - 정확도 우선 모델 : InceptionResnetV2 기반 FasterRCNN - 속도 우선 모델 1 : MobileNet 기반 SSD - 속도 우선 모델 2 : YOLO_V2 - 딥러닝 모델 개발 및 테스트 - 기존 데이터를 이용 객체 검출기 학습 - 카메라 연동 및 검출 속도 측정 InceptionResnetV2 기반 FasterRCNN : 약 800ms MobileNet 기반 SSD : 약 35ms YOLO_V2 : 약 40ms 1.5 IDS 시스템의 사회재난 활용 전략 : 물놀이 안전사고 태풍, 해일, 쓰나미, 홍수, 수난 사고, 익사 사고, 재난 현장 위험 지역과 사고 다발 발생 지역에서 사고 예방 을 위해 CCTV, 센서, 지향성 스피커를 사용한 시스템을 사용한다. CCTV 카메라를 사용한 재난 사고발생 현장의 환경 및 상황감시, IoT 기반 센서/센서 네트워크를 통해 다양한 센서를 활용한 모비우스 서버의 정보수집 및 분 석, 태중, 집중호우, 급류발생 위험 지역을 감시하여 경보해주는 지향성 스피커를 설치 운영하여 안전 지역으로 피난을 유도하는 피난 유도 기술, 모비우스 서버는 수집된 데이터를 기초로 빅 데이터를 분석하여 재난 유형을 분류하고 기존 사고 사례를 분석하며 카메라 영상 정보와 센서 데이터를 수집하여 빅 데이터 분석을 통해 재난 상황에 신속하게 대응하며 재난 현장의 특성을 파악하여 재난 대응 시스템 및 인명 지킴이 시스템으로써 사용될 예정이다. 1.5.1 물놀이 안전사고 관리 현황 분석 가. 물놀이 안전사고의 특징 행정안전부의 발표에 따르면 우리나라에서는 과거 7년간(2009~2015)에 물놀이 사고는 285건, 익사 등은 29,382 건이 발생하였다. 특히 물놀이 안전사고는 6~8월에 집중적으로 발생하고 있으며, 그 밖의 익사사고도 7, 8월에 많이 발생하는 특성을 갖고 있다. 즉, 여름철에 집중적으로 관리하는 것이 무엇보다 중요하다. 효과적인 수난사 고 관리방안에 대한 검토를 위해 실제 사고자들과 관련성이 높은 지역119센터 담당자, 의료기관 종사자 및 수상 구조 전문가 등에 대한 의견조사를 실시하였다. 그 결과, 수난사고의 경우 익수자가 2~3분내에 응급조치를 받지 못하면 사망에 이를 확률이 매우 높다. 또한, 신고를 받고 119응급대원이 현장에 출동하게 되는 경우 아무리 빨 라도 도착에 10분 이상의 시간이 소요되는 경우가 대부분이 이어서 수난사고의 경우 실질적인 구조 및 응급처치 가 불가능하다. 그리고, 익사사고가 발생하는 수심은 의외로 깊지 않은 곳에서 많이 발생하며 익수자와 일반인 의 물놀이를 구분하기 어려운 문제 등이 지적되었다. 세부적인 면담 조사내용은 표4와 같이 조사하였다. 최근 지자체 및 지역재난본부에서는 여름철에 빈번히 발생하는 수난사고에 대하여 사고 다발지역을 중심으로 인 력과 장비를 집중적으로 배치하여 수난 사고관리를 실시하고 있다. 또한, 지역 자원봉사단체 등과 연계하여 부 족한 인력을 지원 받는 경우도 있으며, 사고 다발지역을 중심으로 인력을 우선 배치한 결과 최근 물놀이 사고 등으로 인한 사망자 수가 과거에 비해 많이 감소하여 최근에는 년간 물놀이 사망자수가 30~40명 수준으로 낮아 졌다. 우리나라에서 여름철 물놀이 사고가 가장 많이 발생하는 곳은 경기도 가평군이며, 다음으로는 경기도 남양주시 였다. 두 지역은 서울에서 지리적으로 가깝고 수려한 경치를 가진 산과 강, 계곡 등이 많은 특성으로 행락객이 많이 찾는 곳이다. 가평군은 물놀이사고 감축을 위해 다양한 노력을 기울인 경과 사망자가 대폭 감소하여년에 8 명의 사망자만 발생하였다. 지자체의 수난사고 관리체계와 재난 대응이 필요하다. 매년 사망자가 발생하여 가평 군에서는 아에 접근금지구역으로 지정하여 사고발생을 방지하고 있었다. 조사한 사고다발지역은 큰 바위 뒤에서 와류가 발생하며 수심이 갑자기 깊어지는 곳으로써 구조전문가의 의견에 따르면 수영실력이 좋아도 아래로 잡아당기는 물의 흐름 때문에 빠져나오기 매우 어려운 지역이라는 의견을 제시하였다. 따라서, 하상이 매년 조금씩 바뀌는 어려움이 있지만 사전에 이런 위험지역을 조사해 표지판을 설치 하고 지도화한다면 사고예방과 관리에 큰 도움이 될 수 있을 것이다. 도 29는 태양전지판을 구비한 기상 센서와 수위 관측계, 지향성 스피커와 카메라를 구비한 사진이다. 도 30은 재난 경고 방송 지향성 스피커와 인명구조함과 안전 요원이 상주하는 사진이다. 도 31은 사고 발생 지역과 사고 다발 위험 지역과 특정지역은 안전 표지판을 구비하고 접근 금지구역으로 설정 하여 관리하는 사진이다. 수난 구조 장비는 인명구조함, 물놀이위험지역 표지판, 물놀이금지(지역) 표지판, 물놀이경고 표지판, 사망사고 발생지역 표지판, 익사사고위험지역 표지판, 위험구역지정안내 표지판, 도강 위험 경고판, 안전수칙 표지판를 구비하며, 지자체에서는 사고가 발생한 지역과 위험지역 등을 세분화하여 표지판을 설치하여 사람들에게 물놀이 위험성을 알리고 있다. 물놀이 사고 이외에 다슬기 체취나 어로활동 중에 발생하는 사고 그리고 산과 계곡이 많아 급류가 발생하는 경 우 강을 건너다 사고가 많이 발생하고 있다. 이런 곳에는 급류발생의 위험을 경보하는 경보계 만으로는 관리에 어려움이 많아 CCTV 카메라를 설치하여 모니터링 하고 있다. * IDS 시스템 개발 및 활용 방향 ○ 실시예에서 조사한 국립공원관리공단과 가평군에서는 수난사고 예방을 위하여 다양한 표지판의 설치, 경고방 송용 스피커 시스템의 설치운영을 하고 있다. 또한, 사고 다발 지역 및 위험 지역에 일부 모니터링이 필요한 장 소에는 CCTV 카메라 시스템을 활용하고는 있으나 전체적으로 수난사고 대비용으로 CCTV를 활용하는 경우는 드문 것으로 조사되었다. 또한, 현재까지 현장에 적용된 시스템은 IDS 시스템과 같이 영상 및 센서 그리고 지향성 스 피커를 사용하여 양방향 통신과 관제가 가능하거나 유사한 시스템은 활용되고 있지 않았다. 전문가 자문을 통해 영상정보만을 활용해 물에 빠진 사람을 명확히 식별한다는 것은 매우 어려운 것으로 의견 조사 되었으나 몇 가지 익수자를 식별할 수 있는 패턴들은 조사되었다. 예를 들면, 10초 이상 수면아래에 사람 이 위치하는 경우는 사고발생 가능성이 높은 것으로 판단할 수 있다. 따라서, 사고 다발 지역과 위험지역 접근 에 대한 경고, 인지행위 기반의 영상의 객체 추적을 통한 사고발생 판단 등의 기능을 고도화하면 효과적이다."}
{"patent_id": "10-2017-0162726", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "사고자를 발견하더라도 구조 및 신속히 응급조치를 해야 하며, 물놀이 사고의 경우 익수자가 사고발생부터 사망 에 이르는 시간이 매우 짧아 신고를 통해 구조대가 출동하여 대응하기 어려운 사고이다. 따라서, IDS 관제 시스 템이 현장에서 사람이 사고가 나는 것을 감시하고 위험성을 알려주는데 그치지 않고 적극적인 경고방송 및 초기 재난 대응 조치를 강구할 필요가 있다. IDS 관제 시스템이 현장에 적용되기 위해서는 기존 CCTV나 센서들이 개인정보보호에 따른 설치운용이 큰 제약이 따르는 문제를 먼저 해결할 필요가 있다. 또한, 특정지역에 설치하는 경우에도 자연공원법과 같이 재난안전과 필요성에 따라 지자체 및 관련기관에서 자체적으로 적용할 수 있도록 관련 법령과 법제도 개선 등의 규제개혁이 필요하다. 본 발명에 따른 실시예들은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨 터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 컴퓨터 판독 가능 기록 매체는 스토리지, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 모든 형태의 하드웨어 장치가 포함될 수 있다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것, 기계어 코드뿐만 아니라 인터프리터를 사용하 여 컴퓨터에 의해 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 이러한 하드웨어 장치는 본 발명의 동작 을 수행하기 위해 하나 이상의 소프트웨어 모듈로써 작동하도록 구성될 수 있다. 이상에서 설명한 바와 같이, 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야에서 통상의 지식을 가진자가 하기의 특허청구범위에 기재된 본 발명의 기술적 사상 및 영역으로부터 벗어나지 않는 범위 내 에서 본 발명을 다양하게 수정 또는 변형하여 실시할 수 있음을 이해할 수 있을 것이다. 부호의 설명100: 센서 300: 모비우스 서버 700: IDS 로컬 관제 시스템 711: IDS 로컬관제 서버 712: 스트리밍 서버 714: 영상 분석 서버 720: IDS 폴 제어기 함체 723: 지향성 스피커 제어기 724: 지향성 스피커 앰프 730: IDS폴 구난 함체 731: 카메라 732: IR LED 733: 지향성 스피커 출력부"}
{"patent_id": "10-2017-0162726", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 사물지능통신을 기반으로 하는 재난대응시스템을 나타낸 전체구성도이다. 도 2는 본 발명에 따른 사회재난 대응을 위한 융복합기술 기반의 카메라와 센서 네트워크와 지향성 스피커를 사 용한 인명지킴이 시스템 구성도이다. 도 3a는 사회재난 및 자연재해 피ㅍ해발생 추이를 보인 그래프이다. 도 3b는 IDS 인명지킴이 시스템 화면이다. 도 4는 핵심 기술별 테스트베드 적용방안을 나타낸 화면이다. 도 5a는 IoT 기반 재난 정보 시스템 구성도이다. 도 5b는 폴대와 지향성 스피커를 사용한 이동차량 기반 재난 대응 시스템 구성도이다. 도 5c는 센서 노드의 구성 예를 보인 도면이다. 도 5d는 복합 센서 노드의 시스템 구성을 보인 도면이다. 도 5e는 복합 센서 노드-센서 노드 드라이버 테스트를 보인 도면이다. 도 5f는 센서 노드의 유형과 구성을 보인 도면이다. 도 5g는 복합 센서 노드 설치 구성도이다. 도 5h는 본 발명의 실시예에 따른 MQTT 프로토콜을 사용하는 IoT 센서, 센서 네트워크 게이트웨이, 모비우스 서 버, IoT 모니터링 UI, IoT 관리 UI의 기능을 나타낸 도면이다. 도 6은 기상 센서의 외형을 보인 도면이다. 도 7은 광학 수위 센서를 보인 도면이다. 도 8은 강우 센서를 보인 도면이다. 도 9는 인체 감지 센서를 보인 도면이다. 도 10은 Wi-Fi 메쉬 네트워크 구성도이다. 도 11은 NB-IoT 네트워크 구조를 보인 도면이다. 도 12는 LoRa와 타 기술(Sigfox, LTE MTC, LTE NB IoT)을 비교한 도면이다. 도 13은 LoRa 통신 레이어를 나타낸 도면이다. 도 14a는 각종 센서 노들로부터 센서 데이터를 센서 네트워크를 통해 수신한 모비우스 서버의 센서 데이터 수신 로그, IoT 모니터링 시스템 화면 그래프(좌), 센서 데이터값(우) 화면이다. 도 14b는 센서 노드ID, 센서 장치 ID, 센서 데이터 값을 추출하여 모비우스 서버에 DB에 저장하는 센서 네트워 크를 통해 IoT 게이트웨이 데이터 처리 모듈 상세 구현 화면이다. 도 14c는 센서 노드가 게이트웨이를 통해 모비우스 서버로 센서 데이터를 전송하는 IoT 센서 네트워크 통신 프 로토콜(MQTT 프토토콜)의 예를 보인도면이다. 도 14d는 방사각도와 팬틸트 조절이 가능한 가변 출력 지향성 스피커 시스템 구성도이다. 도 14e 내지 도 14h는 지향성 스피커의 특징을 나타낸 도면이다. 도 14i는 지향성 스피커의 외형을 보인 도면이다. 도 14j는 센서와 카메라, 지향성 스피커의 전송 정보를 나타낸 통신 프로토콜 정의 파일이다. 도 14k는 분석 영상 에뮬레이터 화면이다. 도 15는 객체 검출의 예를 보인 도면이다. 도 16은 Faster RCNN을 보인 도면이다. 도 17은 SSD(Single Shot multi-box Detector) 구조를 보인 도면이다. 도 18은 SSD에서 특징지도 크기에 따른 객체 추출 예를 보인 도면이다. 도 19는 COCO 데이터베이스만 학습한 모델을 CCTV 영상에 적용한 예, 구축한 데이터베이스를 추가 학습시킨 모 델을 CCTV 영상에 적용한 예를 보인 도면이다. 도 20은 객체 추적을 위한 딥러닝 구조를 보인 도면이다. 도 21은 객체 추적 결과를 보인 도면이다. 도 22는 Person re-identification을 위한 CNN(Convolutional Neural Network) 구조를 보인 도면이다. 도 23은 CUHK-03 데이터베이스(같은 행은 동일인물)를 보인 도면이다. 도 24는 객체 검출을 위한 빅데이터 데이터베이스 취득하는 화면이다. 도 25는 오 검출 영역 제거 화면이다. 도 26은 CCTV 카메라에서 바라본 하천 사진이다. 도 27은 입수 금지 위험 지역 CCTV 카메라 촬영 사진이다. 도 28은 해질녁 개인 입수, 위험 지역 이동 CCTV 카메라 촬영 사진이다. 도 29는 태양전지판을 구비한 기상 센서와 수위 관측계, 지향성 스피커와 카메라를 구비한 사진이다. 도 30은 재난 경고 방송 지향성 스피커와 인명구조함과 안전 요원이 상주하는 사진이다. 도 31은 사고 발생 지역과 사고 다발 위험 지역과 특정지역은 안전 표지판을 구비하고 접근 금지구역으로 설정 하여 관리하는 사진이다. 도 32a, 32b 및 33은 관제 시스템에서 모니터링 UI 화면을 보인 도면이다."}
