{"patent_id": "10-2023-0006049", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0114082", "출원번호": "10-2023-0006049", "발명의 명칭": "딥러닝", "출원인": "세종대학교산학협력단", "발명자": "이재욱"}}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "난방배관 자동설계 시스템에 의해 수행되는 난방배관 자동설계 방법에 있어서, 난방배관이 미포함된 건축평면도를 난방배관 경로 딥러닝 모델에 입력받는 단계; 상기 난방배관 경로 딥러닝 모델을 이용하여 상기 난방배관이 미포함된 건축평면도로부터 난방배관 경로를 예측하는 단계; 및상기 예측된 난방배관 경로를 포함하는 난방배관 설계안을 자동으로 생성하는 단계 를 포함하는 난방배관 자동설계 방법."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 입력받는 단계는, 상기 난방배관이 미포함된 건축평면도에 대한 데이터 전처리를 통해 상기 난방배관 경로 딥러닝 모델의 입력 데이터를 생성하는 단계를 포함하는 난방배관 자동설계 방법."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 입력받는 단계는, 상기 난방배관이 미포함된 건축평면도에서 도면 요소들을 인식하는 단계를 포함하는 난방배관 자동설계 방법."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 입력받는 단계는, 상기 인식된 도면 요소들 중 난방배관 요소들을 분류하여 요소별로 색상을 지정하고, 상기 분류된 난방배관 요소들에 따라 구분된 공간별로 그리드를 생성하는 단계를 포함하는 난방배관 자동설계 방법."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 예측하는 단계는,상기 난방배관이 미포함된 건축평면도에 대한 데이터 전처리를 통해 입력 데이터로서 생성된 공간별로 그리드가생성된 건축평면도를 이용하여 상기 난방배관이 미포함된 건축평면도로부터 난방배관 경로를 예측하는 단계를 포함하는 난방배관 자동설계 방법."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,공개특허 10-2024-0114082-3-상기 생성하는 단계는,도면화를 통해 상기 난방배관이 미포함된 건축평면도에 상기 예측된 난방배관 경로에 따라 난방배관을 작성하는단계를 포함하는 난방배관 자동설계 방법."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 난방배관 경로 딥러닝 모델은, 난방배관 경로를 예측하기 위해 Pix2Pix-GAN로 구성된 것으로,난방배관 미포함 데이터 및 난방배관 포함 데이터를 이용하여 배관경로 데이터베이스를 구축하는 단계; 및 상기 구축된 배관경로 데이터베이스를 이용한 난방배관 경로의 학습을 통해 난방배관 경로를 예측하는 단계를 통해 구축된 것을 특징으로 하는 난방배관 자동설계 방법."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항, 제2항, 제5항 내지 제7항 중 어느 한 항의 난방배관 자동설계 방법을 상기 난방배관 자동설계 시스템에실행시키기 위해 비-일시적인 컴퓨터 판독가능한 기록 매체에 저장되는 컴퓨터 프로그램."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "난방배관 자동설계 시스템에 있어서, 난방배관이 미포함된 건축평면도를 난방배관 경로 딥러닝 모델에 입력받는 평면도 입력부; 상기 난방배관 경로 딥러닝 모델을 이용하여 상기 난방배관이 미포함된 건축평면도로부터 난방배관 경로를 예측하는 경로 예측부; 및상기 예측된 난방배관 경로를 포함하는 난방배관 설계안을 자동으로 생성하는 설계안 생성부를 포함하는 난방배관 자동설계 시스템."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 평면도 입력부는,상기 난방배관이 미포함된 건축평면도에 대한 데이터 전처리를 통해 상기 난방배관 경로 딥러닝 모델의 입력 데이터를 생성하는 것을 특징으로 하는 난방배관 자동설계 시스템."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 평면도 입력부는,상기 난방배관이 미포함된 건축평면도에서 도면 요소들을 인식하는 것을 특징으로 하는 난방배관 자동설계 시스템."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 평면도 입력부는,상기 인식된 도면 요소들 중 난방배관 요소들을 분류하여 요소별로 색상을 지정하고, 상기 분류된 난방배관 요공개특허 10-2024-0114082-4-소들에 따라 구분된 공간별로 그리드를 생성하는 것을 특징으로 하는 난방배관 자동설계 시스템."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 경로 예측부는,상기 난방배관이 미포함된 건축평면도에 대한 데이터 전처리를 통해 입력 데이터로서 생성된 공간별로 그리드가생성된 건축평면도를 이용하여 상기 난방배관이 미포함된 건축평면도로부터 난방배관 경로를 예측하는 것을 특징으로 하는 난방배관 자동설계 시스템."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 설계안 생성부는,도면화를 통해 상기 난방배관이 미포함된 건축평면도에 상기 예측된 난방배관 경로에 따라 난방배관을 작성하는 것을 특징으로 하는 난방배관 자동설계 시스템."}
{"patent_id": "10-2023-0006049", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제8항에 있어서,상기 난방배관 경로 딥러닝 모델은, 난방배관 경로를 예측하기 위해 Pix2Pix-GAN로 구성된 것으로,난방배관 미포함 데이터 및 난방배관 포함 데이터를 이용하여 배관경로 데이터베이스를 구축하는 동작; 및 상기 구축된 배관경로 데이터베이스를 이용한 난방배관 경로의 학습을 통해 난방배관 경로를 예측하는 동작를 통해 구축된 것을 특징으로 하는 난방배관 자동설계 시스템."}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "딥러닝(Pix2Pix-GAN)을 활용한 건축물 난방배관 자동설계 방법 및 시스템이 개시된다. 일 실시예에 따른 난방배 관 자동설계 시스템에 의해 수행되는 난방배관 자동설계 방법은, 난방배관이 미포함된 건축평면도를 난방배관 경 로 딥러닝 모델에 입력받는 단계; 상기 난방배관 경로 딥러닝 모델을 이용하여 상기 난방배관이 미포함된 건축평 면도로부터 난방배관 경로를 예측하는 단계; 및 상기 예측된 난방배관 경로를 포함하는 난방배관 설계안을 자동 으로 생성하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명은 건축물의 난방배관 설계 기술에 관한 것이다."}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "건축물의 바닥 난방배관은 거주자에게 쾌적한 열적환경을 제공하는 중요한 요소로서, 열의 손실을 줄이기 위한 단열층과 효율적인 열전달을 위한 배관층으로 구성된다. 단열층의 경우 단열재의 열관류저항, 강도 등에 대한 설계기준이 제시되어 있지만, 배관층의 경우 명확한 설계기준이 제시되어 있지 않다. 이는 건축물의 용도(예를 들면, 아파트, 어린이집, 노인시설 등)와 재실자 특성(예를 들면, 성인, 어린이, 노인 등)에 따라 요구되는 열 적 특성을 충족하기 위해 다양한 조닝 방식, 배관 간격, 배관 길이 등이 존재하기 때문이다. 예를 들어, 노인 의 경우 일반 성인보다 면역력이 떨어지고 거동이 불편하여 실내에 머무르는 시간이 많으므로 유사한 평면 형태 라 할지라도 노인시설에는 아파트와 달리 배관 간격을 좁혀 더 많은 난방배관을 설계하여야 한다. 이러한 특징 들로 인하여 일반적으로 바닥 난방배관 설계는 설계자의 지식과 경험을 바탕으로 한 수작업에 의해 진행된다. 기존의 수작업 중심의 설계방식이 가진 한계점은 다음과 같다. 첫째, 수작업으로 인해 많은 시간과 비용이 소 요된다. 둘째, 건축물의 용도와 재실자 특성에 따라 상이한 요구조건을 고려한 다양한 설계안이 도출되어야 하 며 이는 설계자의 전문적인 지식과 경험을 필요로 한다. 셋째, 동일한 조건이라 할지라도 설계자의 지식과 경"}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "험에 따라 설계안의 편차가 발생될 수 있다.발명의 내용"}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "난방배관 경로 딥러닝 모델을 이용하여 건축 난방배관 설계를 자동화하는 방법 및 시스템을 제공할 수 있다."}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "난방배관 자동설계 시스템에 의해 수행되는 난방배관 자동설계 방법은, 난방배관이 미포함된 건축평면도를 난방 배관 경로 딥러닝 모델에 입력받는 단계; 상기 난방배관 경로 딥러닝 모델을 이용하여 상기 난방배관이 미포함 된 건축평면도로부터 난방배관 경로를 예측하는 단계; 및 상기 예측된 난방배관 경로를 포함하는 난방배관 설계 안을 자동으로 생성하는 단계를 포함할 수 있다. 상기 입력받는 단계는, 상기 난방배관이 미포함된 건축평면도에 대한 데이터 전처리를 통해 상기 난방배관 경로 딥러닝 모델의 입력 데이터를 생성하는 단계를 포함할 수 있다. 상기 입력받는 단계는, 상기 난방배관이 미포함된 건축평면도에서 도면 요소들을 인식하는 단계를 포함할 수 있 다. 상기 입력받는 단계는, 상기 인식된 도면 요소들 중 난방배관 요소들을 분류하여 요소별로 색상을 지정하고, 상 기 분류된 난방배관 요소들에 따라 구분된 공간별로 그리드를 생성하는 단계를 포함할 수 있다. 상기 예측하는 단계는, 상기 난방배관이 미포함된 건축평면도에 대한 데이터 전처리를 통해 입력 데이터로서 생 성된 공간별로 그리드가 생성된 건축평면도를 이용하여 상기 난방배관이 미포함된 건축평면도로부터 난방배관 경로를 예측하는 단계를 포함할 수 있다. 상기 생성하는 단계는, 도면화를 통해 상기 난방배관이 미포함된 건축평면도에 상기 예측된 난방배관 경로에 따 라 난방배관을 작성하는 단계를 포함할 수 있다. 상기 난방배관 경로 딥러닝 모델은, 난방배관 경로를 예측하기 위해 Pix2Pix-GAN로 구성된 것으로, 난방배관 미 포함 데이터 및 난방배관 포함 데이터를 이용하여 배관경로 데이터베이스를 구축하는 단계; 및 상기 구축된 배 관경로 데이터베이스를 이용한 난방배관 경로의 학습을 통해 난방배관 경로를 예측하는 단계를 통해 구축된 것 일 수 있다. 난방배관 자동설계 방법을 상기 난방배관 자동설계 시스템에 실행시키기 위해 비-일시적인 컴퓨터 판독가능한 기록 매체에 저장되는 컴퓨터 프로그램을 포함할 수 있다. 난방배관 자동설계 시스템은, 난방배관이 미포함된 건축평면도를 난방배관 경로 딥러닝 모델에 입력받는 평면도 입력부; 상기 난방배관 경로 딥러닝 모델을 이용하여 상기 난방배관이 미포함된 건축평면도로부터 난방배관 경 로를 예측하는 경로 예측부; 및 상기 예측된 난방배관 경로를 포함하는 난방배관 설계안을 자동으로 생성하는 설계안 생성부를 포함할 수 있다."}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 조건의 바닥 난방배관 설계안을 자동으로 생성함으로써, 기존 수작업 중심의 설계방식이 지닌 한계를 해 결할 수 있다. 수작업에 소요되는 시간과 비용을 획기적으로 줄일 수 있고, 건물의 용도 혹은 재실자의 특성에 따라 상이한 요구조건이 반영된 다양한 난방배관 설계가 가능하며, 설계자의 지식과 경험에 따라 달라지는 난방 배관 설계안의 편차를 최소화할 수 있다."}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예를 첨부한 도면을 참조하여 상세히 설명한다. 실시예에서는 수작업 중심의 설계 방식의 한계점을 극복하기 위해 인공지능 기반 건축 설계 자동화 설계 기술에 대하여 설명하기로 한다. 기존의 난방배관 설계도면을 이용하여 난방배관 설계 딥러닝 모델을 학습한 후, 건축 물에 따라 열적 특성을 만족시키는 난방배관의 경로를 포함하는 새로운 설계안을 자동으로 생성할 수 있다. 도 1은 일 실시예에 있어서, 난방배관 자동설계의 개괄적인 동작을 설명하기 위한 도면이다. 난방배관 자동설계 시스템은 난방배관이 미포함된 2차원 건축평면도에 대한 건축 난방배관 설계 자동 화를 통해 난방배관이 포함된 2차원 건축평면도를 획득할 수 있다. 난방배관 자동설계 시스템은 데이터 전처리, 도면화를 포함하는 건축 난방배관 설계 자동화를 수행할 수 있다. 난방배관 자 동설계 시스템은 2차원 건축평면도가 주어지면 난방배관 요소들을 고려하여 난방배관을 자동으로 작성할 수 있다. 난방배관 요소란 난방배관을 작성할 시 고려해야 할 대상을 의미하여, 예를 들면, 공간의 크기를 결 정하는 벽, 아파트에 확장형과 비확장형을 구분하는 중문 및 창문, 화장실에 배관 위치를 결정하는 욕실 설비, 배관의 시작점과 종점을 지정하는 분배기 등이 해당될 수 있다. 난방배관 자동설계 시스템은 난방배관 경로 딥러닝 모델을 이용하여 건축 난방배관 설계를 자동화할 수 있다. 이때, 난방배관 경로 딥러닝 모델은 다양한 네트워크 기반으로 구성되어 난방배관이 포함된 데 이터 또는 난방배관이 미포함된 데이터 중 하나 이상의 데이터를 이용하여 난방배관 경로를 예측하도록 학습된 것일 수 있다. 난방배관 자동설계 시스템은 난방배관이 미포함된2차원 건축평면도에 대한 데이터 전처리를 통 해 난방배관 경로 딥러닝 모델의 입력 데이터를 생성할 수 있다. 난방배관 자동설계 시스템은 생성 된 입력 데이터에 대해 난방배관 경로 딥러닝 모델을 이용하여 난방배관 경로를 예측할 수 있다. 난방배 관 자동설계 시스템은 난방배관 경로 딥러닝 모델을 이용하여 예측된 난방배관 경로를 도면화할 수 있다. 난방배관 자동설계 시스템은 난방배관이 포함된 2차원 건축평면도를 획득할 수 있다. 도 2는 일 실시예에 있어서, 난방배관 자동설계의 구체적인 동작을 설명하기 위한 도면이다. 난방배관 자동설계 시스템은 난방배관이 미포함된 2차원 건축평면도에 대해 난방배관 경로 딥러닝 모 델을 통해 난방배관 설계안을 자동으로 생성할 수 있다. 실시예에서는 난방배관 경로 딥러닝 모델로 Pix2Pix-GAN를 예를 들어 설명하기로 한다. 우선적으로, 발명의 이해를 돕기 위해 GAN에 대하여 설명하기로 한다. 생성적 대립 신경망(Generative Adversarial Network; GAN)이란, 생성자와 판별자가 경쟁하면서 실제와 가까운 이미지를 자동으로 생성해내는 기계학습 방식이다. 생성적 대립 신경망(GAN)은 확률 분포를 학습하는 생성자와 서로 다른 집합을 구분하는 판 별자로 구성될 수 있으며, 생성자는 가짜 예제를 만들어 판별자를 최대한 속일 수 있도록 훈련하며, 판별자는 생성자가 제시하는 가짜 예제를 최대한 정확하게 구분할 수 있도록 훈련한다. 이와 같이, 판별자를 속일 수 있 도록 생성자를 훈련하는 방식을 대립적 프로세스라고 한다. 생성적 대립 신경망(GAN)은 생성자와 판별자를 대 립적 프로세스를 통해 발전시키는 과정으로 실제 예제와 매우 비슷한 유사품(실제 같은 가짜)를 생성한다. 보다 상세하게는, Pix2Pix-GAN은 이미지를 입력받아 다른 형태의 이미지로 변환하는 대표적인 이미지 변환 모델 이다. 구체적으로, 픽셀(pixel)을 다른 픽셀로 변환하는 것을 의미하며, 변환되는 요소는 픽셀의 크기와 색상 중 색상에 해당한다. 색상을 변환하기 위해 사전에 라벨링 작업을 통해 이미지의 요소들을 각기 다른 색상으로 구분한다. 예를 들면, 건물의 요소들이 RGB 값, 즉, 벽이 R:0, G:0, B:0, 창 중간 문이 R: 248, G: 153, B: 30, 욕실 가구가 R: 16, G: 86, B: 137, 온수 분배기가 R: 16, G: 86, B: 137, 입/출력이 R:0, G:0, B: 255, 현관이 R: 169, G: 83, B: 160, 배관이 R: 255, G: 0, B: 0로 변환될 수 있다. 이후, 라벨링된 이미지를 Pix2Pix-GAN이 학습하고 새로운 이미지가 주어지면 학습한 결과에 따라 요소 간에 상대적 위치를 고려하여 다양한 색상을 가지는 복수 개의 이미지를 생성하게 된다. 실시예에서는 Pix2Pix-GAN의 특성을 이용하여 라벨링된 건축평면도에서 요소들 간의 상대적 위치를 고려하여 난방배관을 자동으로 설계할 수 있다. 또한, 건물의 목적 또는 사용자의 니즈(예를 들면, 상황)에 따라 난방배관 설계가 다르게 수행될 수 있다. Pix2Pix-GAN는 특정 조건에서 이미지를 학습하고 생성할 수 있다. Pix2Pix-GAN를 이용하여 이미지 별로 조건이 설정되고, 다양한 난방배관 설계가 빠르게 수행될 수 있다. 예를 들면, 판별자에 대한 실측과, 생성자에 대한 입력이 생성될 수 있다. 이때, 건물 내부의 전체 공간 또는 일부 공간(예를 들면, 방)으로 범위가 제한될 수 있다. 생성자는 일정하지 않은 벽 두께, 창 요소, 특정 색의 배경, 간격을 포함하는 조건에 따라 라벨링을 수 행할 수 있고, 판별자는 배관, 입출력, 특정 색의 배경, 간격을 포함하는 조건에 따라 라벨링을 수행할 수 있다. 난방배관 자동설계 시스템은 Pix2Pix-GAN에 입력할 수 있는 데이터를 생성하기 위해, 난방배관 요소별로 색상을 지정하고 공간별로 그리드를 생성하는 데이터 전처리를 수행할 수 있다. 난방배관 자동설계 시스 템은 난방배관이 미포함된 2차원 건축평면도에서 도면 요소들을 인식하고, 인식된 도면 요소들 중 난방배 관 요소(예를 들면, 벽, 분배기)들을 분류하여 요소별로 색상을 지정하고, 분류된 난방배관 요소들에 따라 구분 된 공간별로 그리드를 생성함으로써 입력 데이터를 생성할 수 있다. 난방배관 자동설계 시스템은 데이터 전처리가 완료된 2차원 건축평면도를 Pix2Pix-GAN에 입력하여 난방배관의 경로를 예측할 수 있다. 이때, Pix2Pix-GAN은 난방배관 요소가 분류되고 그리드가 생성된 2D 건축평면도를 이용하여 구축된 배관경로 DB를 학 습하며, 학습을 기반으로 난방배관 경로를 예측하도록 구축된 것일 수 있다. Pix2Pix-GAN은 기존의 2차원 건축 평면도(난방배관 설계가 완료된 건축평면도)에 대한 학습을 바탕으로 새롭게 주어진 2차원 건축평면도(데이터 전처리가 완료된 건축평면도) 상에 난방배관의 경로를 예측할 수 있다. 난방배관 자동설계 시스템은 예측 된 결과의 도면화를 위해, Pix2Pix-GAN을 통해 예측된 난방배관 경로를 따라 난방배관을 작성할 수 있다. 난방배관 자동설계 시스템은 Pix2Pix-GAN을 통해 예측된 난방배관 경로를 예측 결과로서 인식하고, 인식된 난방배관 경로를 분류한 후, 난방배관이 미포함된 2차원 건축평면도에 예측된 난방배관 경로를 작성할 수 있다. 난방배관 자동설계 시스템은 난방배관이 포함된 2차원 건축평면도를 획득할 수 있다. 도 3은 일 실시예에 있어서, 난방배관 자동설계 모델의 동작을 설명하기 위한 도면이다. 난방배관 경로 딥러닝 모델(Pix2Pix-GAN)은 데이터 전처리가 완료된 난방배관 요소별로 색상이 지정되고 그리드 가 생성된 2차원 건축평면도에 난방배관이 포함된 데이터와 미포함된 데이터를 학습할 수 있다. 이때, 그리드 가 생성된 2차원 건축평면도, 난방배관이 포함된 데이터, 난방배관이 미포함된 데이터 및 학습을 통해 도출될 난방배관 경로 예측 결과에 공간의 외부와 내부를 구분하기 위해 공간 외부에 색상이 칠해질 수 있다. 이후, 데이터 전처리를 통해 그리드가 생성된 새로운 2차원 건축평면도를 난방배관 경로 딥러닝 모델(Pix2Pix-GAN) 모 델에 입력받아 학습한 정보를 기반으로 데이터 전처리를 통해 그리드가 생성된 새로운 2차원 건축평면도에 대한 난방배관의 경로를 예측할 수 있다. 도 4는 일 실시예에 있어서, 난방배관 자동설계 시스템의 구성을 설명하기 위한 블록도이고, 도 5는 일 실시예 에 있어서, 난방배관 자동설계 방법을 설명하기 위한 흐름도이다. 난방배관 자동설계 시스템의 프로세서는 평면도 입력부, 경로 예측부 및 설계안 생성부를 포함할 수 있다. 이러한 프로세서의 구성요소들은 난방배관 자동설계 시스템에 저장된 프로그램 코드가 제공하 는 제어 명령에 따라 프로세서에 의해 수행되는 서로 다른 기능들(different functions)의 표현들일 수 있다. 프로세서 및 프로세서의 구성요소들은 도 5의 난방배관 자동설계 방법이 포함하는 단계들(510 내지 530)을 수행 하도록 난방배관 자동설계 시스템을 제어할 수 있다. 이때, 프로세서 및 프로세서의 구성요소들은 메모리가 포 함하는 운영체제의 코드와 적어도 하나의 프로그램의 코드에 따른 명령(instruction)을 실행하도록 구현될 수 있다. 프로세서는 난방배관 자동설계 방법을 위한 프로그램의 파일에 저장된 프로그램 코드를 메모리에 로딩할 수 있 다. 예를 들면, 난방배관 자동설계 시스템에서 프로그램이 실행되면, 프로세서는 운영체제의 제어에 따라 프로 그램의 파일로부터 프로그램 코드를 메모리에 로딩하도록 난방배관 자동설계 시스템을 제어할 수 있다. 이때, 프로세서는 프로세서는 평면도 입력부, 경로 예측부 및 설계안 생성부 각각은 메모리에 로딩된 프로그램 코드 중 대응하는 부분의 명령을 실행하여 이후 단계들(510 내지 530)을 실행하기 위한 프로세서의 서 로 다른 기능적 표현들일 수 있다. 단계에서 평면도 입력부는 난방배관이 미포함된 건축평면도를 난방배관 경로 딥러닝 모델에 입력받을 수 있다. 이때, 건축평면도는 N+1(N은 자연수) 차원의 건축평면도를 포함한다. 평면도 입력부는 난방배 관이 미포함된 건축평면도에 대한 데이터 전처리를 통해 난방배관 경로 딥러닝 모델의 입력 데이터를 생성할 수 있다. 평면도 입력부는 난방배관이 미포함된 건축평면도에서 도면 요소들을 인식할 수 있다. 평면도 입 력부는 인식된 도면 요소들 중 난방배관 요소들을 분류하여 요소별로 색상을 지정하고, 분류된 난방배관 요소들에 따라 구분된 공간별로 그리드를 생성할 수 있다. 단계에서 경로 예측부는 난방배관 경로 딥러닝 모델을 이용하여 난방배관이 미포함된 건축평면도로부 터 난방배관 경로를 예측할 수 있다. 경로 예측부는 난방배관이 미포함된 건축평면도에 대한 데이터 전처 리를 통해 입력 데이터로서 생성된 공간별로 그리드가 생성된 건축평면도를 이용하여 난방배관이 미포함된 건축 평면도로부터 난방배관 경로를 예측할 수 있다. 예를 들면, 경로 예측부는 난방배관이 미포함된 건축평면 도에서 사용자의 니즈 또는 건물의 용도에 알맞은 난방배관 경로를 예측할 수 있다. 사전에, 경로 예측부(42 0)는 사용자의 니즈 또는 건물의 용도/사용자의 니즈 또는 건물의 용도와 관련된 조건을 입력받기 위한 유저 인 터페이스를 제공할 수 있고, 제공된 유저 인터페이스를 통해 선택 또는 입력된 조건 정보에 따라 난방배관 경로 를 예측할 수 있다. 단계에서 설계안 생성부는 예측된 난방배관 경로를 포함하는 난방배관 설계안을 자동으로 생성할 수 있다. 설계안 생성부는 도면화를 통해 난방배관이 미포함된 건축평면도에 예측된 난방배관 경로에 따라 난방배관을 작성할 수 있다. 설계안 생성부는 난방배관 경로 딥러닝 모델을 통해 예측된 난방배관 경로를 예측 결과로서 인식하고, 인식된 난방배관 경로를 분류한 후, 난방배관이 미포함된 건축평면도에 예측된 난방배 관 경로를 작성할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터 는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를"}
{"patent_id": "10-2023-0006049", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "포함한다. 이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2023-0006049", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 있어서, 난방배관 자동설계의 개괄적인 동작을 설명하기 위한 도면이다. 도 2는 일 실시예에 있어서, 난방배관 자동설계의 구체적인 동작을 설명하기 위한 도면이다.도 3은 일 실시예에 있어서, 난방배관 자동설계 모델의 동작을 설명하기 위한 도면이다. 도 4는 일 실시예에 있어서, 난방배관 자동설계 시스템의 구성을 설명하기 위한 블록도이다. 도 5는 일 실시예에 있어서, 난방배관 자동설계 방법을 설명하기 위한 흐름도이다."}
