{"patent_id": "10-2023-0084830", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0164326", "출원번호": "10-2023-0084830", "발명의 명칭": "정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법 및 장치", "출원인": "울산과학기술원", "발명자": "임정호"}}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "분석 장치가 제1 정보를 입력 받는 단계; 상기 분석 장치가 상기 제1 정보를 분석 모델에 입력하는 단계; 및상기 분석 장치가 상기 분석 모델의 출력값을 기반으로 에어로졸 광학 두께를 분석하는 단계;를 포함하되, 상기 제1 정보는 밝기 온도(Brightness Temperature) 정보, 구름(Cloud) 정보, 가 강수량(Precipitable Water)정보, 온도(Temperature) 정보, 이슬점 온도(Dew point Temperature) 정보, 상대 습도(Relative Humidity) 정보, 풍속(Wind Speed) 정보, 풍향(Wind direction) 정보, 시정(Visibility) 정보, 대기 경계 고도(PlanetaryBoundary Layer Height) 정보, 대기압 정보(Surface Pressure),토지 피복 비율(Land Cover Ratio) 정보, 정규화 식생 지수(Normalized Difference Vegetation Index, NDVI) 정보, 태양 천정 각(Solar Zenith Angle, SZA)정보, 날짜(Day) 정보 및 시간(Hour) 정보를 포함하고,상기 분석 모델은 상기 제1 정보를 기반으로 주간 또는 야간의 에어로졸 광학 두께를 추론하는 모델인, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 밝기 온도 정보는 채널 별 밝기 온도의 차이, 채널 별 밝기 온도의 비율 및 미리 설정된 과거 시간 동안측정된 밝기 온도 중 최대 값과 현재 측정된 밝기 온도의 차이 중 적어도 하나를 포함하는, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 밝기 온도 정보는 지구로부터 방출(emissive)된 빛을 밝기 온도 정보로 변환한 정보를 포함하는, 정지궤도위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 풍향 정보는 바람의 U-컴포넌트(U-component of wind, U-wind) 및 바람의 V-컴포넌트(V-component ofwind, V-wind) 중 적어도 하나를 포함하는, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 날짜 정보는 -1 내지 1 사이의 값을 가지되, 겨울 시즌에 다가갈수록 -1값을 가지고 여름 시즌에 다가갈수록 1의 값을 가지는, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 토지 피복 비율 정보는 초목(Vegetation)의 토지 피복 비율(Land cover Ratio, LC), 수역(water)의 토지피복 비율 및 시가화지역(Urban)의 토지 피복 비율 중 적어도 하나를 포함하는, 정지궤도 위성 자료를 활용한주/야간 에어로졸 광학 두께 분석 방법.공개특허 10-2024-0164326-3-청구항 7 제1항에 있어서,상기 분석 모델은 LBGM (Light Gradient Boosting Machine) 또는 RF(Random Forest)기반의 학습 모델인, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 정보를 입력 받는 입력장치; 상기 제1 정보를 분석 모델에 입력하고, 상기 분석 모델의 출력값을 기반으로 에어로졸 광학 두께를 분석하는연산장치; 및상기 제1 정보 및 상기 분석 모델을 저장하는 연산장치;를 포함하되, 상기 제1 정보는 밝기 온도(Brightness Temperature) 정보, 구름(Cloud) 정보, 가 강수량(Precipitable Water)정보, 온도(Temperature) 정보, 이슬점 온도(Dew point Temperature) 정보, 상대 습도(Relative Humidity) 정보, 풍속(Wind Speed) 정보, 풍향(Wind direction) 정보, 시정(Visibility) 정보, 대기 경계 고도(PlanetaryBoundary Layer Height) 정보, 대기압 정보(Surface Pressure),토지 피복 비율(Land Cover Ratio) 정보, 정규화 식생 지수(Normalized Difference Vegetation Index, NDVI) 정보, 태양 천정 각(Solar Zenith Angle, SZA)정보, 날짜(Day) 정보 및 시간(Hour) 정보를 포함하고,상기 분석 모델은 상기 제1 정보를 기반으로 주간 또는 야간의 에어로졸 광학 두께를 추론하는 모델인, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 장치."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 밝기 온도 정보는 채널 별 밝기 온도의 차이, 채널 별 밝기 온도의 비율 및 미리 설정된 과거 시간 동안측정된 밝기 온도 중 최대 값과 현재 측정된 밝기 온도의 차이 중 적어도 하나를 포함하는, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 장치."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 밝기 온도 정보는 지구로부터 방출(emissive)된 빛을 밝기 온도 정보로 변환한 정보를 포함하는, 정지궤도위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 장치."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서, 상기 풍향 정보는 바람의 U-컴포넌트(U-component of wind, U-wind) 및 바람의 V-컴포넌트(V-component ofwind, V-wind) 중 적어도 하나를 포함하는, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 장치."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 날짜 정보는 -1 내지 1 사이의 값을 가지되, 겨울 시즌에 다가갈수록 -1값을 가지고 여름 시즌에 다가갈수록 1의 값을 가지는, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 장치."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,상기 토지 피복 비율 정보는 초목(Vegetation)의 토지 피복 비율(Land cover Ratio, LC), 수역(water)의 토지피복 비율 및 시가화지역(Urban)의 토지 피복 비율 중 적어도 하나를 포함하는, 정지궤도 위성 자료를 활용한공개특허 10-2024-0164326-4-주/야간 에어로졸 광학 두께 분석 장치."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서,상기 분석 모델은 LBGM (Light Gradient Boosting Machine) 또는 RF(Random Forest)기반의 학습 모델인, 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 장치."}
{"patent_id": "10-2023-0084830", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 7항 중 어느 하나의 항에 기재된 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법을 실행하기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2023-0084830", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법은 분석 장치가 제1 정보를 입력 받는 단계; 상기 분석 장치가 상기 제1 정보를 분석 모델에 입력하는 단계; 및 상기 분석 장치가 상기 분석 모델의 출력값을 기반으로 에어로졸 광학 두께를 분석하는 단계;를 포함한다."}
{"patent_id": "10-2023-0084830", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이하 설명하는 기술은 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법에 대한 것이다."}
{"patent_id": "10-2023-0084830", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "태양 빛은 대기 중에 존재하는 에어로졸(Aerosol) 입자에 의하여 흡수되거나 산란될 수 있다. 에어로졸 광학 두 께(또는 에어로졸 광학 깊이)는 빛이 에어로졸을 통과하는 동안의 산란되거나 흡수되는 정도를 의미한다. 에어 로졸 광학 두께는 대기에 존재하는 미세먼지가 많을수록 그 값이 커지게 된다. 미세먼지에 의하여 빛이 산란되 거나 흡수되는 정도가 커질 수 있기 때문이다. 따라서 에어로졸 광학 두께는 대기의 질과 관련이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허공보 10-2021-0018737"}
{"patent_id": "10-2023-0084830", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래 정지궤도 위성등에서 측정한 값을 기반으로 에어로졸 광학 두께를 추정하는 방법들이 있었다. 종래 방법은 태양 복사의 감쇠 정도를 이용하여 에어로졸 광학 두께를 추정하였다. 하지만 이러한 종래 방법들은 주간 시간 에 대해 연속적으로 관측할 수 있지만 야간에는 태양 복사가 없어 야간에 에어로졸 광학 두께를 추정할 수 없는 문제가 있었다. 이하 설명하는 기술은 입력 받은 정보를 기반으로 주간 뿐만 아니라 야간에서도 에어로졸 광학 두께를 추정할 수 있는 방법을 제공하고자 한다."}
{"patent_id": "10-2023-0084830", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법은 분석 장치가 제1 정보를 입력 받는 단계; 상기 분석 장치가 상기 제1 정보를 분석 모델에 입력하는 단계; 및 상기 분석 장치가 상기 분석 모델의 출력값을 기반으로 에어로졸 광학 두께를 분석하는 단계;를 포함한다. 상기 제1 정보는 주간 또는 야간에 측정한 정보를 포함할 수 있다. 상기 제1 정보는 밝기 온도(Brightness Temperature) 정보, 구름(Cloud) 정보, 가 강수량(Precipitable Water) 정보, 온도(Temperature) 정보, 이슬점 온도(Dew point Temperature) 정보, 상대 습도(Relative Humidity) 정 보, 풍속(Wind Speed) 정보, 풍향(Wind direction) 정보, 시정(Visibility) 정보, 대기 경계 고도(Planetary Boundary Layer Height) 정보, 대기압 정보(Surface Pressure), 토지 피복 비율(Land Cover Ratio) 정보, 정규화 식생 지수(Normalized Difference Vegetation Index, NDVI) 정보, 태양 천정 각(Solar Zenith Angle, SZA) 정보, 날짜(Day) 정보 및 시간(Hour) 정보를 포함할 수 있다. 상기 분석 모델은 상기 제1 정보를 기반으로 주간 또는 야간의 에어로졸 광학 두께를 추론하는 모델일 수 있다."}
{"patent_id": "10-2023-0084830", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이하 설명하는 기술을 이용하면 정지궤도 위성 자료를 기반으로 에어로졸 광학 두께를 분석할 수 있다. 또한 이 하 설명하는 기술을 이용하면 주간 뿐만 아니라 야간에도 에어로졸 광학 두께를 측정할 수 있다."}
{"patent_id": "10-2023-0084830", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 설명하는 기술은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있다. 명세서의 도면에 이하 설 명하는 기술의 특정 실시 형태가 기재될 수 있다. 그러나, 이는 이하 설명하는 기술의 설명을 위한 것이며 이하 설명하는 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니다. 따라서 이하 설명하는 기술의 사상 및 기술 범위에 포함되는 모든 변경 물, 균등 물 내지 대체 물이 이하 설명하는 기술에 포함하는 것으로 이해되어야 한 다. 다양한 구성요소들을 설명하기 위해서 제1, 제2, A, B 등의 용어가 사용될 수 있다. 하지만 상기 용어는 단지 하나의 구성요소를 다른 구성요소들과 구별하기 위해서 사용될 뿐, 상기 용어로 해당 구성요소들을 한정하려고 하는 것이 아니다. 예를 들어, 이하 설명하는 기술의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성 요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. “및/또는” 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 이하 사용되는 용어에서 단수의 표현은 문맥상 명백하게 다르게 해석되지 않는 한 복수의 표현을 포함하는 것으 로 이해되어야 하고, \"포함한다\" 등의 용어는 기재된 특징, 개수, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 의미하는 것이지, 하나 또는 그 이상의 다른 특징들이나 개수, 단계 동작 구성요소, 부분 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는 것으로 이해되어야 한다. 도면에 대한 상세한 설명을 하기에 앞서, 본 명세서에서의 구성부들에 대한 구분은 각 구성부가 담당하는 주기 능 별로 구분한 것에 불과함을 명확히 하고자 한다. 즉, 이하에서 설명할 2개 이상의 구성부가 하나의 구성부로합쳐지거나 또는 하나의 구성부가 보다 세분화된 기능별로 2개 이상으로 분화되어 구비될 수도 있다. 그리고 이 하에서 설명할 구성 부 각각은 자신이 담당하는 주기능 이외에도 다른 구성부가 담당하는 기능 중 일부 또는 전 부의 기능을 추가적으로 수행할 수도 있으며, 구성부 각각이 담당하는 주기능 중 일부 기능이 다른 구성부에 의 해 전담되어 수행될 수도 있음은 물론이다. 또, 방법 또는 동작 방법을 수행함에 있어서, 상기 방법을 이루는 각 과정들은 문맥상 명백하게 특정 순서를 기 재하지 않은 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 과정들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 이하 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 장치(이하, 분석 장치)가 정지궤도 위성 자료를 활용해 주/야간 에어로졸 광학 두께를 분석하는 전체적인 과정을 설명한다. 도1은 분석 장치가 정지궤도 위성 자료를 활용해 주/야간 에어로졸 광학 두께를 분석하는 전체적인 과정을 보여준다. 분석 장치는 제1 정보를 입력 받을 수 있다. 분석 장치는 제1 정보를 분석 모델에 입력할 수 있다. 분석 장치는 분석 모델의 출력값을 기반으로 에어로졸 광학 두께를 분석할 수 있다. 제1 정보는 주간 또는 야간에 측정된 정보일 수 있다. 제1 정보는 밝기 온도(Brightness Temperature) 정보, 구름(Cloud) 정보, 가 강수량(Precipitable Water) 정보, 온도(Temperature) 정보, 이슬점 온도(Dew point Temperature) 정보, 상대 습도(Relative Humidity) 정 보, 풍속(Wind Speed) 정보, 풍향(Wind direction) 정보, 시정(Visibility) 정보, 대기 경계 고도(Planetary Boundary Layer Height) 정보, 대기압 정보(Surface Pressure), 토지 피복 비율(Land Cover Ratio) 정보, 정규 화 식생 지수(Normalized Difference Vegetation Index, NDVI) 정보, 태양 천정 각(Solar Zenith Angle, SZA) 정보, 날짜(Day) 정보 및 시간(Hour) 정보 를 포함할 수 있다. 분석 모델은 제1 정보를 기반으로 주간 또는 야간의 에어로졸 광학 두께를 추론하는 모델일 수 있다. 이하 정지궤도 위성 자료를 활용해 주/야간 에어로졸 광학 두께를 분석하는 방법을 구체적으로 설명한다. 도2는 분석 장치가 정지궤도 위성 자료를 활용해 주/야간 에어로졸 광학 두께를 분석하는 방법의 실시예 중 하 나이다. 분석 장치는 제1 정보를 입력 받을 수 있다. 제1 정보는 주간 뿐만 아니라 야간에도 측정할 수 있는 정보를 포함할 수 있다. 제1 정보는 인공위성에서 측정 된 자료를 포함할 수 있다. 제1 정보는 분석 모델이 에어로졸 광학 두께를 분석 할 때 이용되는 정보를 포함할 수 있다. 일 실시예로 제1 정보는 밝기 온도(Brightness Temperature) 정보를 포함할 수 있다. 구체적으로 밝기 온도 정 보는 지구로부터 방출된(Emissive)된 빛을 밝기 온도 정보로 변환한 정보를 포함할 수 있다. 이는 지구 복사에 의한 빛일 수 있다. 지구로부터 방출된 빛은 낮뿐만 아니라 밤에도 측정할 수 있다. 이는 태양으로부터 반사된 정보를 이용하여 낮에만 측정된 데이터를 이용하는 경우와 다를 수 있다. 밝기 온도를 측정하기 위하여 GK- 2A(Geostationary Korea Multi-Purpose Satellite-2A)로 부터 측정한 데이터를 이용할 수도 있다. 일 실시예로 제1 정보는 전처리 된 밝기 온도 정보를 포함할 수 있다. 구체적으로 제1 정보는 채널 별 밝기 온 도의 차이, 채널 별 밝기 온도의 비율 및 미리 설정된 과거 기간 동안 측정된 밝기 온도 중 최대 값과 현재 측 정된 밝기 온도의 차이 중 적어도 하나를 포함할 수 있다. 채널은 밝기 온도를 측정하는 파장대에 대한 것을 포함할 수 있다. 다시 말해 센서의 각 채널별로 측정하는 빛 의 파장대가 다를 수 있다. 예를 들어 GK-2A의 AMI의 경우 총 16개의 채널이 있으며, 각 채널 별 서로 다른 파 장대의 빛을 측정할 수 있다. (채널: 1 (vis) 0.47 μm, 채널: 2 (vis) 0.51 μm, 채널: 3 (vis) 0.64 μm, 채 널: 4 (vis) 0.86 μm, 채널: 5 (NIR) 1.38 μm, 채널: 6 (NIR) 1.6 μm, 채널: 7 (SWIR) 3.8 μm, 채널: 8 (WV) 6.3 μm, 채널: 9 (WV) 6.9 μm, 채널: 10 (WV) 7.3 μm, 채널: 11 (IR) 8.7 μm, 채널: 12 (IR) 9.6 μ m, 채널: 13 (IR) 10.5 μm, 채널: 14 (IR) 11.2 μm, 채널: 15 (IR) 12.3 μm, 채널: 16 (IR) 13.3 μm)채널 별 밝기 온도 차이는 하나의 채널에서 측정된 밝기 온도와 다른 채널에서 측정된 밝기 온도의 차이를 포함 할 수 있다. 예를 들어 채널 별 밝기 온도 차이는 7번 채널과 13번 채널에서 측정된 밝기 온도 차이(ch07 - ch13), 13번 채널과 15번 채널에서 측정된 밝기 온도 차이(ch13 - ch15), 11번 채널과 13번 채널에서 측정된 밝 기 온도 차이(ch11 - ch13) 중 적어도 하나를 포함할 수 있다. 채널 별 밝기 온도 비율은 하나의 채널에서 측정된 밝기 온도와 다른 채널에서 측정된 밝기 온도의 비율을 포함 할 수 있다. 예를 들어 채널 별 밝기 온도 비율은 13번 채널과 11번 채널에서 측정된 밝기 온도 비율 (ch13/ch11), 13번 채널과 15번 채널에서 측정된 밝기 온도 비율(ch13/ch15)를 포함할 수 있다. 미리 설정된 과거 기간 동안 측정된 밝기 온도 중 최대 값과 현재 측정된 밝기 온도의 차이는 하나의 채널에서 측정된 과거 밝기 온도 정보 중 가장 큰 값과 현재 측정된 밝기 온도의 차이를 포함할 수 있다. 예를 들어 미리 설정된 과거 기간은 30일이 될 수 있다. 즉 30일 동안 측정된 밝기 온도 값 중에서 가장 높은 값을 선택 한 뒤, 선택된 값과 현재 측정된 밝기 온도값과의 차이를 계산할 수 있다. 일 실시예로 제1 정보는 구름(Cloud) 정보 및 가 강수량(Precipitable Water) 정보를 포함할 수 있다. 구름 정 보는 해당 위치에 구름이 어느정도 있었는지에 대한 정보를 포함할 수 있다. 구름이 많은 경우 위성이 관찰한 값이 불안정할 수도 있기에 활용된다. 가 강수량 정보는 단위 면적당 연직 기주 내 수증기가 응결하여 모두 강 수로 내린다고 가정했을때의 양을 포함할 수 있다. 일 실시예로 제1 정보는 온도(Temperature) 정보, 이슬점 온도(Dew point Temperature) 정보, 상대 습도 (Relative Humidity) 정보, 풍속(Wind Speed) 정보, 풍향(Wind direction) 정보, 시정(Visibility) 정보, 대기 경계 고도(Planetary Boundary Layer Height) 정보 및 대기압 정보(Surface Pressure)를 포함할 수 있다. 풍향 정보는 바람의 U-컴포넌트(U-component of wind, U-wind) 및 바람의 V-컴포넌트(V-component of wind, V-wind) 중 적어도 하나를 포함할 수 있다. 이를 위해 지역예보모델(RDAPS)로부터 획득한 데이터를 이용할 수 있다. 일 실시예로 제1 정보는 토지 피복 비율(Land Cover Ratio) 정보를 포함할 수 있다. 토지 피복 비율은 초목 (Vegetation)의 토지 피복 비율(Land cover Ratio, LC), 수역(water)의 토지 피복 비율 및 시가화지역(Urban) 의 토지 피복 비율 중 적어도 하나를 포함할 수 있다. 이를 위해 MODIS로부터 획득한 데이터를 이용할 수 있다. 일 실시예로 제1정보는 정규화 식생 지수(Normalized Difference Vegetation Index, NDVI) 정보를 포함할 수 있다. 정규화 식생 지수는 파장 중 적색과 근 적외선(NIR) 파장을 이용하는 지수로써, 식생이 얼마나 밀집되어 있는지를 파악하는데 이용될 수 있다. 일 실시예로 제1 정보는 태양 천정각 정보(Solar Zenith Angle, SZA)를 포함할 수 있다. 일 실시예로 제1 정보는 날짜에 대한 정보를 포함할 수 있다. 구체적으로 제1 정보는 일년 중 현재 날짜가 언제 인지에 대한 정보를 포함할 수 있다. 예를 들어 날짜에 대한 정보는 -1 내지 1사이의 값을 가지되, 겨울 시즌에 다가갈수록 -1의 값을 가지고 여름 시즌에 다가갈수록 1의 값을 가질 수 있다. 일 실시예로 제1 정보는 시간에 대한 정보를 포함할 수 있다. 시간에 대한 정보는 하루 중 현재 시간이 언제 인 지에 대한 정보를 포함할 수 있다. 예를 들어 시간에 대한 정보는 -1 내지 1 사이의 값을 가질 수 있다. 분석 장치는 제1 정보를 분석 모델에 입력할 수 있다. 분석 모델은 입력 받은 정보를 기반으로 에어로졸 광학 두께를 분석하도록 학습된 모델을 포함할 수 있다. 분석 모델은 기계학습에 기반한 모델일 수 있다. 구체적으로 분석 모델은 LBGM (Light Gradient Boosting Machine) 또는 RF(Random Forest)기반의 학습 모델일 수 있다. 분석 장치는 분석 모델의 출력값을 기반으로 에어로졸 광학 두께를 분석할 수 있다. 에어로졸 광학 두께(또는 에어로졸 광학 깊이)는 빛이 에어로졸을 통과하는 동안 산란되거나 흡수되는 정도를 의미한다. 에어로졸 광학 깊이는 빛이 산란되거나 흡수되는 정도가 커질수록 그 값이 커진다. 에어로졸 광학 두 께는 대기에 존재하는 미세먼지와의 높은 상관관계를 가진다. 미세먼지가 높아질수록 에어로졸 광학 깊이는 커 지기 때문이다. 분석 장치가 분석하는 에어로졸 광학 두께는 550nm 파장대에서의 에어로졸 광학 두께 일 수 있 다. 이하 전술한 분석 모델에 추가적인 정보를 더 이용하여 주간에서의 에어로졸 광학 두께를 분석하는 방법을 설명 한다. 즉 분석 장치는 전술한 제1 정보 뿐만 아니라 제2 정보를 분석 모델에 추가적으로 입력하여 에어로졸 광 학 두께를 분석할 수 있다. 이때 제2 정보는 주간에서만 측정될 수 있는 정보이기 때문에 분석 장치가 제2 정보 까지 이용한다면 주간에서의 에어로졸 광학 두께를 분석할 수 있다. 도3은 분석 장치가 정지궤도 위성 자료를 활용해 주간에서의 에어로졸 광학 두께를 분석하는 방법의 실시예 이다. 분석 장치는 제1 정보 및 제2 정보를 입력 받을 수 있다. 제1 정보는 도2등에서 설명한 정보일 수 있다. 제2 정보는 주간에 측정할 수 있는 정보를 포함할 수 있다. 제2 정보는 인공위성에서 측정된 자료를 포함할 수 있다. 제2 정보는 분석 모델이 에어로졸 광학 두께를 분석할 때 이용되는 정보를 포함할 수 있다. 일 실시예로 제2 정보는 반사도에 대한 정보를 포함할 수 있다. 구체적으로 반사도에 대한 정보는 태양에서 방 출된 빛이 지구 대기에서 반사된 정도에 대한 정보를 포함할 수 있다. 반사도는 태양 빛이 있어야 측정될 수 있 으므로, 반사도에 대한 정보는 주간에서 측정된 반사도에 대한 정보만을 포함할 수 있다. 반사도를 측정하기 위 하여 GK-2A(Geostationary Korea Multi-Purpose Satellite-2A)로 부터 측정한 데이터를 이용할 수도 있다. 반사도에 대한 정보는 대기 상층부(Top of Atmosphere, TOA)에서의 반사도 정보를 포함할 수 있다. 반사도에 대한 정보는 미리 설정된 과거 기간 동안 측정된 반사도 중 최소 값과 현재 측정된 반사도의 차이를 포함할 수 있다. 예를 들어 미리 설정된 기간은 30일이 될 수 있다. 즉 30일 동안 측정된 반사도 값 중에서 가 장 낮은 값을 선택 한 뒤, 선택된 값과 현재 측정된 반사도에 대한 차이를 포함할 수 있다. 분석 장치는 제1 정보 및 제2 정보를 분석 모델에 입력할 수 있다. 분석 모델은 도2등에서 설명한 모델일 수 있다. 분석 장치는 분석 모델의 출력값을 기반으로 주간에서의 에어로졸 광학 두께를 분석할 수 있다. 이하 연구원이 분석 모델을 구축하고, 구축한 분석 모델을 이용해 에어로졸 광학 두께를 측정한 실험결과에 대 해 살펴본다. 도4는 연구원이 모델을 구축할 때 이용한 데이터를 보여준다. 연구원은 6가지의 소스(GK-2A L1B, GK-2A L2, UM-RDAPS, MODIS, JAXA/ALOS, Auxiliary)로부터 데이터를 확보하 였다. 각 데이터는 서로 다른 공간 해상도(Spatial Resolution)을 가질 수 있다. GK-2A L1B로 부터 확보한 데이터는 TOA반사도 관련 변수 및 밝기 온도에 대한 정보를 포함한다. 구체적으로 최 근 대기 상층부에서 측정한 반사도와 과거 30일 동안 측정된 반사도 중 최소값과의 차이(TOA reflectance differences with recent 30-day minimum)를 포함할 수 있다. 또는 채널 별 밝기 온도의 차이(BT difference between channels)를 포함할 수 있다. 또는 채널 별 밝기 온도의 비율(BT ratios between channels)을 포함할 수 있다. 또는 측정된 밝기 온도와 최근 30일 동안의 최대값과의 차이(BT differences with recent 30-day maximum)를 포함할 수 있다. GK-2A L2로 부터 확보한 데이터는 구름에 대한 정보(Cloud)와 가강수량(Total Precipitable Water, TPW)에 대 한 정보를 포함한다. UM-RDAPS(Regional Data Assimilation and Prediction System)로 부터 확보한 데이터는 기상 변수에 대한 데이 터를 포함한다. 구체적으로 온도(Temperature), 이슬점 온도(Dew Point Temperature, DEW), 상대 습도 (Relative Humidity, RH), 풍속(Wind Speed, WS), 바람의 U-컴포넌트(U-component of wind, U-wind), 바람의 V-컴포넌트(V-component of wind, V-wind), 가시성(Visibility), 대기 경계 고도(Planetary Boundary Layer Height, PBLH) 및 대기압(Surface Pressure, Psrf)에 대한 정보를 포함한다. MODIS로부터 확보한 데이터는 초목(Vegetation)의 토지 피복 비율(Land cover Ratio, LC), 수역(water)의 토지 피복 비율, 시가화지역(Urban)의 토지 피복 비율 및 정규식생지수(Normalized Difference Vegetation Index, NDVI)를 포함한다. JAXA/ALOS로부터 확보한 데이터는 Digital Surface Model (DSM) 를 포함한다. Auxiliary data로부터 확보한 데이터는 태양 천장각(Solar Zenith Angle, SZA), 일년의 날짜(Day of Year, DOY), 하루의 시간(Hour of Day, HOD)을 포함한다. DOY는 겨울시즌에는 -1, 여름시즌에는 1의 값을 가질 수 있 도록 변환되어 이용되었다. HOD는 -1 및 1의 값을 가질 수 있도록 변환되었다. 도5는 GK-2A LB의 채널 별 파장대와 공간 해상도에 대한 데이터를 보여준다. GK-2A L1B로부터 확보한 데이터는 16개의 채널로부터 측정한 데이터를 포함할 수 있다. 16개의 채널은 서로 다른 파장대를 의미할 수 있다. 16개 채널 중 6개는 반사도에 대한 채널이며 이중 4개는 가 시광선(Visible), 나머지 2개는 근적외선(near-infrared, NIR)에 대한 것이다. 반사도에 대한 채널은 태양빛이 있는 주간에만 측정할 수 있다. 채널 1 내지 4는 가시광선 영역(Vis)을 측정한다. 채널 5 및 6은 근 적외선 영 역(NIR)을 측정한다. 16개 채널 중 10개는 방출(emissive)에 대한 것이며 이 중 4개는 단파 적외선(SWIR) 및 중파장(WR), 나머지 6개 는 장파장(long-wavelength) 적외선에 대한 것이다. 방출에 대한 것은 주간뿐만 아니라 야간에도 측정될 수 있 다. 채널 6은 단파 적외선 영역(SWIR)을 측정한다. 채널 8 내지 10은 중파장 적외선영역을 측정한다. 채널 11 내지 16은 장파장 적외선 영역을 측정한다. 도6은 연구원이 분석 모델을 구축한 전체적인 과정을 보여준다. 연구원은 데이터를 기반으로 2종류의 모델을 각각 RF(Random Forest) 및 LGBM(Light Gradient Boosting Machine)로 구축하였다. 첫번째는 BT모델이다. BT모델은 주간 및 야간 시간에 동일한 입력변수를 사용하는 모델이다. BT모델은 GK-2A L1B에서 밝기 변수(BT)와 관련된 변수를 이용한다. 또한 BT모델은 GK-2A L2, RDAPS, MODIS, JAXA/ALOS 및 Auxilairy data)와 관련된 변수를 이용한다. BT모델이 이용하는 변수는 주간 뿐만 아니라 야간에서도 측정할 수 있다. 두번째는 주간 TOA모델이다. 주간 TOA모델은 BT모델이 이용한 변수에 더해서 GK-2A L1B에서 TOA반사도 관련 변 수들을 추가로 사용한다. 주간 TOA모델에서 이용하는 데이터 중 TOA반사도에 대한 변수는 주간에만 측정할 수 있다. 연구원은 레퍼런스 데이터로 AERONET AOD를 이용하였다. 연구원은 교차 검증 방식을 이용해 모델을 검증하였다. 구체적으로 5의 배수가 아닌 날짜의 데이터는 학습 데이 터로 이용하였고 5의 배수인 날짜의 데이터는 테스트 데이터로 이용하였다. 도7 내지 도9는 분석 모델의 성능을 평가한 결과이다. 도7은 BT모델의 성능을 평가한 결과이다. 하루종일(all), 낮시간(day), 밤시간(night)인 경우로 나누어서 성능 이 평가되었다. 또한 교차검증(RDCV), 시간적으로 분리된 데이터 및 공간적으로 분리된 데이터를 이용해 성능을 평가하였다. LGBM기반의 모델의 R2이 RF기반의 모델보다 높은 것을 확인할 수 있다. 또한 LGBM기반의 모델의 RMSE (root mean square error) 및 MAE(mean absolute error)가 RF기반의 모델보다 낮은 것을 확인할 수 있다. 도8은 주간 TOA모델의 성능을 평가한 결과이다. 각각 교차 검증(RDCV), 시간적으로 분리된 데이터 및 공간적으 로 분리된 데이터를 이용해 성능을 평가하였다. LGBM 모델의 R2가 RF기반의 모델보다 높은 것을 확인할 수 있다. 또한 RMSE, rMSE(relative RMSE), MAE 모두 LGBM 모델이 RF기반 모델보다 낮은 것을 확인할 수 있다. 도9는 BT모델 및 주간 TOA모델을 교차 검증한 결과를 Scatter plot으로 표현한 결과이다. 도9의 (a)는 BT모델 을 LGBM 및 RF로 구축 한 뒤 주간(daytime) 및 야간(Nighttime)에서 에어로졸 광학 두께를 측정한 결과이다. 도 9의 (b)는 주간 TOA모델을 LGBM 및 RF기반 모델로 구축한 뒤 에어로졸 광학 두께를 측정한 결과이다. x축은 지 상에서 측정한 에어로졸 광학 두께(AOD)값이며, y축은 모델이 추론한 에어로졸 광학 두께(AOD) 값이다. 전체적으로 LGBM기반의 모델이 RF기반의 모델보다 성능이 좋다는 것을 확인할 수 있다. 도10은 LGBM 기반으로 구축한 모델의 성능을 평가한 결과이다. 구체적으로 BT모델과 주간 TOA모델에 대한 교차 검증 결과, DOY기반 테스트 결과 및 관측소 기반 테스트 결과이다. 10배 교차 검증 결과 BT모델의 R2는 야간시간이 주간시간보다 높다는 것을 확인할 수 있다. RMSE 및 MAE는 야간 시간이 높다는 것을 확인할 수 있다. DOY기반 테스트 결과 BT모델의 R2는 주간시간과 야간시간이 비슷하다는 것을 확인할 수 있다. RMSE 및 MAE는 주 간시간이 높다는 것을 확인할 수 있다. 관측소 기반 테스트 결과 BT모델의 R2주간시간이 야간시간보다 높은 것을 확인할 수 있다. BT기반 모델과 주간 TOA기반 모델을 비교한 결과 주간 TOA모델의 R2 은 BT모델보다 높다는 것을 확인할 수 있다. 도11은 설명가능한 인공지능 기법을 이용해 LGBM기반의 분석 모델을 해석한 결과이다. 도11의 (a)는 BT 모델을 해석한 결과이다. 도11의 (b)는 주간 TOA 모델을 해석한 결과이다. 실험에 이용된 설명가능한 인공지능 기법은 SHapley Additive exPlanations이다. 양 모델에서 TPW, AOD는 분석 모델이 에어로졸 광학 두께를 결정하는데 중요한 영향을 주는 변수로 파악되었다. 양 모델에서 NDVI, LC ratio 및 DSM은 에어로졸 광학 두께를 측정하는데 중요한 변수로 파악되었다. BT기반 모델에서 BTD2 및 BTD1은 에어로졸 광학 두께를 결정하는데 높은 영향을 주는 변수로 파악되었다. 반면 에 TOA기반 모델에서 TOA에 대한 정보가 에어로졸 광학 두께를 결정하는데 높은 영향을 주는 변수로 파악하였다. 또한 기상 변수보다는 식생지수, 토지피복, 고도 등의 지리적 변수들이 영향이 더 높은 것을 확인 할 수 있다. 이하 분석 장치에 대해 설명한다. 도12는 분석 장치의 실시예 중 하나의 구성이다. 분석 장치는 도1에서 설명한 분석 장치에 해당할 수 있다. 분석 장치는 전술한 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법을 수행하는 장치일 수 있다. 분석 장치는 물리적으로 다양한 형태로 구현될 수 있다. 예를 들어 분석 장치는 PC, 노트북, 스마트 기기, 서버 또는 데이터처리 전용 칩셋 등의 형태를 가질 수 있다. 분석 장치는 입력장치, 저장장치, 연산장치, 출력장치, 인터페이스 장치 및 통 신장치를 포함할 수 있다. 입력장치는 일정한 명령 또는 데이터를 입력 받는 인터페이스 장치(키보드, 마우스, 터치스크린 등)를 포 함할 수도 있다. 입력장치는 별도의 저장장치(USB, CD, 하드디스크 등)를 통하여 정보를 입력 받는 구성을 포함할 수도 있다. 입력장치는 입력 받는 데이터를 별도의 측정장치를 통하여 입력 받거나, 별도의 DB를 통하여 입력 받을 수도 있다. 입력장치는 유선 또는 무선 통신을 통해 데이터를 입력 받을 수 있다. 입력장치는 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법을 수행하는데 필요한 정 보 및 모델을 입력 받을 수 있다. 입력장치는 제1 정보를 입력 받을 수 있다. 입력장치는 밝기 온도 (Brightness Temperature) 정보, 구름(Cloud) 정보, 가 강수량(Precipitable Water) 정보, 온도(Temperature) 정보, 이슬점 온도(Dew point Temperature) 정보, 상대 습도(Relative Humidity) 정보, 풍속(Wind Speed) 정보, 풍향(Wind direction) 정보, 시정(Visibility) 정보, 대기 경계 고도(Planetary Boundary Layer Height) 정보, 대기압 정보(Surface Pressure),토지 피복 비율(Land Cover Ratio) 정보, 정규화 식생 지수(Normalized Difference Vegetation Index, NDVI) 정보, 태양 천정 각(Solar Zenith Angle, SZA) 정보, 날짜(Day) 정보 및시간(Hour) 정보를 입력 받을 수 있다. 입력장치은 분석 모델을 입력 받을 수 있다. 저장장치는 입력장치를 통해 입력 받은 정보를 저장할 수 있다. 저장장치는 연산장치가 연 산하는 과정에서 생성되는 정보를 저장할 수 있다. 즉 저장장치는 메모리를 포함할 수 있다. 저장장치 는 연산장치가 계산한 결과를 저장할 수 있다. 저장장치는 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법을 수행하는데 필요한 정 보 및 모델을 저장할 수 있다. 저장장치는 제1 정보를 저장할 수 있다. 저장장치는 밝기 온도 (Brightness Temperature) 정보, 구름(Cloud) 정보, 가 강수량(Precipitable Water) 정보, 온도(Temperature) 정보, 이슬점 온도(Dew point Temperature) 정보, 상대 습도(Relative Humidity) 정보, 풍속(Wind Speed) 정보, 풍향(Wind direction) 정보, 시정(Visibility) 정보, 대기 경계 고도(Planetary Boundary Layer Height) 정보, 대기압 정보(Surface Pressure),토지 피복 비율(Land Cover Ratio) 정보, 정규화 식생 지수(Normalized Difference Vegetation Index, NDVI) 정보, 태양 천정 각(Solar Zenith Angle, SZA) 정보, 날짜(Day) 정보 및 시간(Hour) 정보를 저장할 수 있다. 저장장치는 분석 모델을 저장할 수 있다. 연산장치는 데이터를 처리하고, 일정한 연산을 처리하는 프로세서, AP, 프로그램이 임베디드된 칩과 같은 장치일 수 있다. 연산장치는 분석 장치를 제어하는 제어신호를 생성할 수 있다. 연산장치는 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법을 수행하는데 필요한 연 산을 수행할 수 있다. 연산장치는 제1 정보를 분석 모델에 입력할 수 있다. 연산장치는 분석 모델의 출력값을 기반으로 에 어로졸 광학 두께를 분석할 수 있다. 출력장치는 일정한 정보를 출력하는 장치가 될 수도 있다. 출력장치는 데이터 과정에 필요한 인터페 이스, 입력된 데이터, 분석결과 등을 출력할 수도 있다. 출력장치는 디스플레이, 문서를 출력하는 장치, 등과 같이 물리적으로 다양한 형태로 구현될 수도 있다. 인터페이스 장치는 외부로부터 일정한 명령 및 데이터를 입력 받는 장치일 수 있다. 인터페이스 장치(45 0)는 물리적으로 연결된 입력 장치 또는 외부 저장장치로부터 제1 정보를 입력 받을 수 있다. 인터페이스 장치 는 분석 장치를 제어하기 위한 제어신호를 입력 받을 수 있다. 인터페이스 장치는 분석 장치 가 분석한 결과를 출력할 수 있다. 통신장치는 유선 또는 무선 네트워크를 통해 일정한 정보를 수신하고 전송하는 구성을 의미할 수 있다. 통 신장치는 분석 장치를 제어하는데 필요한 제어 신호를 수신할 수 있다. 통신장치는 분석 장치 가 분석한 결과를 전송할 수 있다. 전술한 정지궤도 위성 자료를 활용한 주/야간 에어로졸 광학 두께 분석 방법은 컴퓨터에서 실행될 수 있는 실행 가능한 알고리즘을 포함하는 프로그램(또는 어플리케이션)으로 구현될 수 있다. 상기 프로그램은 일시적 또는 비일시적 판독 가능 매체(non-transitory computer readable medium)에 저장되어 제공될 수 있다. 비일시적 판독 가능 매체는 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 어플리케이션 또는 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM (read-only memory), PROM (programmable read only memory), EPROM(Erasable PROM, EPROM) 또는 EEPROM(Electrically EPROM) 또는 플래시 메모리 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있 다. 일시적 판독 가능 매체는 스태틱 램(Static RAM，SRAM), 다이내믹 램(Dynamic RAM，DRAM), 싱크로너스 디램 (Synchronous DRAM，SDRAM), 2배속 SDRAM(Double Data Rate SDRAM，DDR SDRAM), 증강형 SDRAM(Enhanced SDRAM ，ESDRAM), 동기화 DRAM(Synclink DRAM，SLDRAM) 및 직접 램버스 램(Direct Rambus RAM，DRRAM) 과 같은 다양 한 RAM을 의미한다. 본 실시예 및 본 명세서에 첨부된 도면은 전술한 기술에 포함되는 기술적 사상의 일부를 명확하게 나타내고 있 는 것에 불과하며, 전술한 기술의 명세서 및 도면에 포함된 기술적 사상의 범위 내에서 당업자가 용이하게 유추할 수 있는 변형 예와 구체적인 실시예는 모두 전술한 기술의 권리범위에 포함되는 것이 자명하다고 할 것이다."}
{"patent_id": "10-2023-0084830", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 분석 장치가 정지궤도 위성위성 자료를 활용해 주/야간 에어로졸 광학 두께를 분석하는 전체적인 과 정을 보여준다. 도2는 분석 장치가 정지궤도 위성위성 자료를 활용해 주/야간 에어로졸 광학 두께를 분석하는 방법의 실시예 중 하나이다. 도3은 분석 장치가 정지궤도 위성위성 자료를 활용해 주간에서의 에어로졸 광학 두께를 분석하는 방법의 실시예 이다. 도4는 연구원이 모델을 구축할 때 이용한 데이터를 보여준다. 도5는 GK-2A LB의 채널 별 파장대와 공간 해상도에 대한 데이터를 보여준다. 도6은 연구원이 분석 모델을 구축한 전체적인 과정을 보여준다. 도7 내지 도9는 분석 모델의 성능을 평가한 결과이다. 도7은 BT모델의 성능을 평가한 결과이다. 도8은 주간 TOA모델의 성능을 평가한 결과이다. 도9는 BT모델 및 주간 TOA모델을 교차 검증한 결과를 Scatter plot으로 표현한 결과이다. 도10은 LGBM 기반으로 구축한 모델의 성능을 평가한 결과이다. 도11은 설명가능한 인공지능 기법을 이용해 LGBM기반의 분석 모델을 해석한 결과이다. 도12는 분석 장치의 실시예 중 하나의 구성이다."}
