{"patent_id": "10-2022-0153426", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0072396", "출원번호": "10-2022-0153426", "발명의 명칭": "가명처리기법 추천 인공지능 알고리즘", "출원인": "(주)이지서티", "발명자": "홍성현"}}
{"patent_id": "10-2022-0153426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기존 축적된 가명처리 기법 적용 데이터로부터 특징정보 추출 단계; 학습데이터 생성 단계; 학습데이터 전처리 단계 - 워드임베딩 및 One-Hot-Encoding 기법을 통한 수치화 -; 인공지능 모델 학습 단계 - Gradient Boosting 모델 학습 -; 인공지능 모델 정확도 검증 단계 - 예상 결과와 실제 결과의 비교를 통한 정확도 산출 - ; 가명처리 대상 데이터로부터 얻어낼 수 있는 특징정보 수집 단계; 인공지능 모델에 데이터 입력 단계; 및 가명처리 기법 추천 단계;를 포함하는 가명처리기법 추천 인공지능 알고리즘 방법."}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 가명처리기법 추천 인공지능 알고리즘에 관한 것으로, 기존 축적된 가명처리 기법 적용 데이터로부터 특징정보 추출 단계; 학습데이터 생성 단계; 학습데이터 전처리 단계 - 워드임베딩 및 One-Hot-Encoding 기법을 통한 수치화 -; 인공지능 모델 학습 단계 - Gradient Boosting 모델 학습 -; 인공지능 모델 정확도 검증 단계 - 예상 결과와 실제 결과의 비교를 통한 정확도 산출 - ; 가명처리 대상 데이터로부터 얻어낼 수 있는 특징정보 수 집 단계; 인공지능 모델에 데이터 입력 단계; 및 가명처리 기법 추천 단계를 포함한다. 본 발명에 의하면 가명처 리 기법에 대한 지식이 없는 비전문가도 가명정보를 쉽게 만들고 활용할 수 있게 되므로, 가명정보를 활용한 여 러 사업들이 활성화 될 수 있다."}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가명처리기법 추천 인공지능 알고리즘에 관한 것이다."}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자의 선택에 의해 가명처리 기법을 선택하여 가명처리를 수행하는 가명처리 기술이 공지되어 있다."}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는 가명처리 기법에 대한 지식이 없는 비전문가도 가명정보를 쉽게 활용 할 수 있도록, 기존의 전문가들이 선택한 데이터셋을 학습하여 가명처리 기법을 추천해주는 인공지능 알고리즘 을 제공하는 것이다."}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 기술적 과제를 해결하기 위한 가명처리기법 추천 인공지능 알고리즘은 기존 축적된 가명처리 기 법 적용 데이터로부터 특징정보 추출 단계; 학습데이터 생성 단계; 학습데이터 전처리 단계 - 워드임베딩 및 One-Hot-Encoding 기법을 통한 수치화 -; 인공지능 모델 학습 단계 - Gradient Boosting 모델 학습 -; 인공지 능 모델 정확도 검증 단계 - 예상 결과와 실제 결과의 비교를 통한 정확도 산출 - ; 가명처리 대상 데이터로부 터 얻어낼 수 있는 특징정보 수집 단계; 인공지능 모델에 데이터 입력 단계; 및 가명처리 기법 추천 단계를 포 함한다."}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면 가명처리 기법에 대한 지식이 없는 비전문가도 가명정보를 쉽게 만들고 활용할 수 있게 되므 로, 가명정보를 활용한 여러 사업들이 활성화 될 수 있다."}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 본 명세서에서 \"컴퓨팅 장치\"는 연산처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들이 모두 포함된다. 예를 들어, 컴퓨팅 장치는 데스크 탑 PC, 노트북(Note Book) 컴퓨터, 서버 컴퓨터 뿐만 아니라 스마 트폰(Smart phone), 태블릿 PC, 셀룰러폰(Cellular phone), 피씨에스폰(PCS phone; Personal Communication Service phone), 동기식/비동기식 IMT-2000(International Mobile Telecommunication-2000)의 이동 단말기, 팜 PC(Palm Personal Computer), 개인용 디지털 보조기(PDA; Personal Digital Assistant) 등도 해당될 수 있다. 본 기술은 다음과 같은 방법을 통해 구현된다. 1. 기존 축적된 가명처리 기법 적용 데이터로부터 특징정보 추출 가명처리는 개인정보를 가공하여 가명정보로 만드는 과정을 의미한다. 가명정보란 추가적인 정보가 없으면 개인 을 식별하지 못하도록 만든 정보이며, 통계작성, 과학적연구, 공익적기록 등의 목적으로만 자유롭게 활용될 수 있다. 가명처리에는 삭제, 통계, 일반화, 암호화, 무작위화 등의 기법이 있으며, 이 기법들은 적용하는 방법에 따라 더욱 세분화될 수 있다. 2. 학습데이터 생성 학습에 사용될 하나의 데이터 테이블을 생성하고, 해당 데이터 테이블에 다양한 컬럼명을 입력한 뒤 해당 컬럼 명에 대해 산업분류, 개인정보유형, 문자/숫자 타입을 결정한다. 그 다음 각각의 컬럼명에 맞는 추천 가명처리 기법을 결정한다. 3. 학습데이터 전처리 - 워드임베딩 및 One-Hot-Encoding 기법을 통한 수치화 생성된 학습데이터의 전처리를 위해서는 워드임베딩 기법과 One-Hot-Encoding 기법이 필요하다. 워드임베딩 기 법은 단어를 학습하여 수치형 벡터로 변환해주는 비지도학습 자연어처리 기법으로, 워드임베딩의 여러 기법 가 운데 FastText 기법을 활용하면 한글에 대응이 가능하면서 학습하지 못한 문자에 대해서도 강력한 성능을 발휘 할 수 있다. 이 기법은 주변 단어의 개념을 단어의 단위가 아닌 글자 단위로 나눈다는 특징이 있다. 또한 One- Hot-Encoding 기법은 딥러닝에서 단어를 표현하는 가장 기본적인 표현 방법으로, 우선 각 단어에 고유한 정수를 부여하고(정수 인코딩), 표현하고 싶은 단어의 고유한 정수를 인덱스로 간주하여 해당 위치에 1을 부여하고 나 머지 다른 단어들의 인덱스에는 0을 부여한다. 이를 활용하면 한글로 작성된 문장도 숫자 0 또는 1이 활용된 수 치형 데이터로 변환할 수 있다. 4. 인공지능 모델 학습 - Gradient Boosting 모델 학습 Gradient Boostiong Algorithm(GBM)은 회귀분석 또는 분류분석을 수행할 수 있는 예측모형으로, 기울기 (Gradient)를 활용하여 Boosting을 하는 알고리즘이다. Boosting이란 약한 분류기를 결합하여 강한 분류기를 만 드는 것을 말한다. 즉, A 분류기를 만들어서 해당 분류기를 바탕으로 B 분류기를 만들고, 이후 C 분류기를 만든 후 최종적으로 만들어진 분류기들을 모두 결합하여 최종 모델을 만든다.5. 인공지능 모델 정확도 검증 - 예상 결과와 실제 결과의 비교를 통한 정확도 산출 가명처리기법 추천 인공지능의 학습 성능은 아래 표에 명시된 것과 같다. 학습 시 정확도가 100%이고, 테스트 정확도도 100%인 것은 데이터의 다양성이 부족하기 때문이다. 학습에 소요된 시간은 약 2시간 10분으로 이는 10 만개 정도의 데이터를 CPU만으로 학습했기 때문이다. 만약 GPU를 활용한 학습이 이뤄질 경우 학습 속도는 더욱 빠르게 개선될 수 있다."}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "6. 가명처리 대상 데이터로부터 얻어낼 수 있는 특징정보 수집 7. 인공지능 모델에 데이터 입력 8. 가명처리 기법 추천 8.1 입력 데이터 구성 가명처리기법 추천 과정에서의 입력 데이터는 학습 데이터와 같은 형태이지만 레이블인 가명처리기법이 빠져있 다는 차이가 있다. 입력 데이터는 가명처리 기술지원 서버에서 http 통신을 통해 가명처리기법 추천 인공지능 서버에 요청을 보내면서 함께 전송된다. 가명처리 기술지원 서버에서 요청하는 데이터는 산업분류, 컬럼명, 예 시데이터, 데이터 타입으로 구성되어 있는데, 이는 위에서 설명했듯이 예시 데이터를 통해 개인정보 유형을 검 출하는 기능이 라이브러리에 포함되어 있기 때문이다. 인공지능 메인 모듈로 입력될 때는 한 차례 가공되어 산 업분류, 컬럼명, 개인정보유형, 데이터 타입으로 재구성된 데이터가 입력된다. 8.2 메인 모듈 가명처리 기술지원 서버에서 송신한 추천 요청과 입력 데이터는 메인 모듈에서 수신한다. 메인 모듈은 항상 요 청을 기다리고 있다가 요청이 올 경우 함께 송신된 입력 데이터를 인공지능 모듈에 입력한다. 가명처리기법 추 천 인공지능이 학습 중일 때에는 메인 모듈이 가명처리 기술지원 서버의 요청을 수신할 수 없다. 8.3 가명처리기법 추천 메인 모듈에서 수신한 입력 데이터는 인공지능 모듈의 가명처리기법 추천 메서드에 파라미터로써 입력되고, 해 당 메서드는 입력받은 데이터를 전처리하고 사전에 학습된 인공지능 모델에 입력해서 각 컬럼별 추천 기법을 산 출하고 반환한다. 인공지능 모듈에서 반환한 추천 기법은 메인 모듈에 의해 가명처리 기술지원 서버로 송신된다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 인스트럭션(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨팅 장치 또는 특수 목적 컴퓨팅 장치를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응 답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사"}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "용되는 것으로 설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처 리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 인스트럭션(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있 다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2022-0153426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다.도면 도면1"}
{"patent_id": "10-2022-0153426", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 가명처리기법 추천 인공지능 알고리즘 방법의 흐름도이다."}
