{"patent_id": "10-2020-0167459", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0078192", "출원번호": "10-2020-0167459", "발명의 명칭": "플랙서블 전자 장치 및 이의 아바타 서비스 운용 방법", "출원인": "삼성전자주식회사", "발명자": "박미지"}}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "플랙서블 전자 장치에 있어서, 제1 하우징;상기 제1 하우징에 대하여 제1 방향 또는 제2 방향으로 이동이 가능하도록 배치되는 제2 하우징; 상기 제2 하우징을 상기 제1 하우징에 대하여 이동시키도록 구동되는 구동 장치;상기 제2 하우징이 상기 제1 하우징에 대해 제1 방향으로 이동 시 제1 표시 영역을 가지며, 상기 구동 장치에의해 상기 제2 하우징이 상기 제1 하우징으로부터 제2 방향으로 이동 시 상기 제1 표시 영역 및 제2 표시 영역으로 확장되는 디스플레이; 및 상기 디스플레이 및 상기 구동 장치와 작동적으로 연결되는 프로세서;를 포함하고,상기 프로세서는, 아바타 서비스 실행 시에, 상기 디스플레이에서 시각적 정보가 표시될 활성화 영역이 상기 제1 표시 영역인 경우, 상기 제1 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 아바타를 표현할 가상의 제1 공간을도출하고, 아바타의 특성 정보를 기반으로 상기 제1 공간 내에서 표현 가능한 제1 자세의 아바타를 제공하고, 상기 디스플레이의 활성화 영역이 제1 표시 영역에서 제2 표시 영역의 적어도 일부까지 확장된 것에 기반하여,상기 제1 표시 영역 및 제2 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 가상의 제2 공간을 도출하고, 상기 아바타의 특성 정보를 기반으로 상기 제2 공간 내에서 표현 가능한 제2 자세의 아바타 및 확장 서비스 기능 중 적어도 하나를 제공하도록 설정된 플랙서블전자 장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는, 배경 이미지를 획득하고, 상기 제 1 공간은, 상기 배경 이미지에서 제1 표시 영역에 대응하는 크기로 크롭된 제1 잘라내기 영역의 공간요소를 통해 도출하고, 상기 제2 공간은, 상기 배경 이미지에서 제1 표시 영역 및 제2 표시 영역에 대응하는 크기로 크롭된 제2 잘라내기 영역의 공간 요소를 통해 도출 하도록 더 설정된 플랙서블 전자 장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 배경 이미지는 카메라를 통해 획득한 현실 이미지 또는 랜더링된 가상 현실 공간 이미지를 포함하는 플랙서블 전자 장치,"}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 공간 요소는 바닥, 벽, 천장, 물체 중 적어도 하나를 포함하고, 상기 프로세서는 공개특허 10-2022-0078192-3-상기 공간 요소의 크기, 면적, 높이, 거리 중 적어도 하나를 분석하여 배경 이미지에서 상기 아바타가 위치할바닥 면적을 계산하고, 상기 바닥 면적을 기준으로 제1 공간 또는 제2 공간의 x축, y축 및 z축 값을 결정하도록 설정된 플랙서블 전자장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 아바타 특성 정보는, 아바타 다리, 팔, 바디 및 얼굴의 사이즈, 아바타 모션, 아바타 애니메이션 활동 또는 아바타 자세 중 적어도 하나에 대한 정보를 포함하는 플랙서블 전자 장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 프로세서는, 상기 활성화 영역이 제1 표시 영역인 것에 기반하여, 상기 제1 공간 내에서 표현 가능한 아바타 컨텐츠들을 선별하여 제1 아바타 서비스 사용자 인터페이스를 구성하고, 상기 제1 아바타 서비스 사용자 인터페이스에 상기제1 자세의 아바타를 제공하고,상기 활성화 영역이 상기 제1 표시 영역에서 상기 제2 표시 영역의 적어도 일부까지 확장된 것에 기반하여, 상기 제2 공간 내에서 표현 가능한 아바타 컨텐츠들을 선별하여 제2 아바타 서비스 사용자 인터페이스를구성하고, 상기 제2 아바타 서비스 사용자 인터페이스에 상기 제2 자세의 아바타를 제공하도록 더 설정된 플랙서블 전자 장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 프로세서는, 상기 제2 아바타 서비스 사용자 인터페이스는 확장된 활성화 영역에 대응하는 확장 서비스 기능을 추가로 제공하도록 더 설정된 플랙서블 전자 장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 확장 서비스 기능은, 메인 아바타 이외에 다른 아바타를 추가로 표시할 수 있는 다른 아바타 표시 기능, 메인 아타바의 복제 클론을제공할 수 있는 클론 기능, 아바타와 상호 인터렉션을 통해 추가 기능을 실행할 수 있는 아바타 인터렉션 기능중 적어도 하나를 포함하는 플랙서블 전자 장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서, 상기 제1 아바타 서비스 사용자 인터페이스는, 상기 제1 공간 내에서 표현 가능한 모션 항목들을 포함하고, 상기 제2 아바타 서비스 사용자 인터페이스는 제2 공간 내에서 표현 가능한 모션 항목들을 포함하고, 상기 프로세서는, 상기 제1 아바타 서비스 사용자 인터페이스에서 상기 제1 공간 내에서 표현 불가능한 모션 항목들이 포함되는경우, 상기 제1 공간 내에서 표현 가능한 모션 항목들과 상기 표현 불가능한 모션 항목들을 시각적으로 다르게처리하도록 더 설정된 플랙서블 전자 장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,공개특허 10-2022-0078192-4-상기 프로세서는, 상기 제1 아바타 서비스 사용자 인터페이스에서 상기 제1 공간 내에서 표현 불가능한 모션 항목들이 포함되는경우, 모션 항목들 중 일부가 표현 불가능하다는 것을 안내하는 정보 또는 상기 디스플레이를 제1 표시 영역에서 제2 표시 영역의 적어도 일부까지 확장하도록 안내하는 정보를 제공하도록 더 설정된 플랙서블 전자 장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "플랙서블 전자 장치에 있어서, 제1 하우징;상기 제1 하우징에 대하여 제1 방향 또는 제2 방향으로 이동이 가능하도록 배치되는 제2 하우징; 상기 제2 하우징을 상기 제1 하우징에 대하여 이동시키도록 구동되는 구동 장치;상기 제2 하우징이 상기 제1 하우징에 대해 제1 방향으로 이동 시 제1 표시 영역을 가지며, 상기 구동 장치에의해 상기 제2 하우징이 상기 제1 하우징으로부터 제2 방향으로 이동 시 상기 제1 표시 영역 및 제2 표시 영역으로 확장되는 디스플레이; 및상기 디스플레이 및 상기 구동 장치와 작동적으로 연결되는 프로세서;를 포함하고,상기 프로세서는, 아바타 서비스 실행 시에 표시될 배경 이미지를 획득하고, 플랙서블 전자 장치의 상태에 기반하여 상기 디스플레이에서 시각적 정보가 표시될 활성화 영역의 면적을 트래킹하고, 상기 활성화 영역의 면적에 대응하여 상기 획득된 배경 이미지에서 잘라내기 영역을 결정하고, 상기 잘라내기 영역 내에 포함된 공간 요소를 분석하여 아바타를 표현할 가상의 공간 범위를 도출하고, 상기 아바타의 특성 정보를 기반으로 상기 공간 범위 내에서 표현 가능한 아바타 컨텐츠들을 선별하여 아바타서비스 UI를 생성하고,상기 생성된 아바타 서비스 UI를 상기 잘리 내기 영역에 대응하는 배경 이미지에 제공하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "플랙서블 전자 장치의 아바타 운용 방법에 있어서, 제1 하우징에 대해 제2 하우징이 제1 방향으로 이동 시 제1 표시 영역을 가지며, 상기 제2 하우징이 상기 제1하우징으로부터 제2 방향으로 이동 시 상기 제1 표시 영역 및 제2 표시 영역으로 확장되는 디스플레이를 통해 아바타 서비스를 실행하는 요청을 수신하는 동작; 상기 디스플레이에서 시각적 정보가 표시될 활성화 영역이 상기 제1 표시 영역인 경우, 상기 아바타 서비스 실행 요청에 응답하여 상기 제1 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 아바타를 표현할 가상의 제1 공간을 도출하는 동작; 아바타의 특성 정보를 기반으로 상기 제1 공간 내에서 표현 가능한 제1 자세의 아바타를 상기 제1 표시 영역인활성화 영역에 표시하는 동작;상기 디스플레이의 활성화 영역이 제1 표시 영역에서 제2 표시 영역의 적어도 일부까지 확장된 것에 기반하여,상기 제1 및 제2 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 가상의 제2 공간을 도출하는 동작; 및상기 아바타의 특성 정보를 기반으로 상기 제2 공간 내에서 표현 가능한 제2 자세의 아바타 및 확장 서비스 기능 중 적어도 하나를 상기 제1 표시 영역 및 제2 표시 영역에 대응하는 활성화 영역에 표시하는 동작을 포함하는 방법."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2022-0078192-5-제12항에 있어서, 상기 제 1 공간을 도출하는 동작은, 상기 배경 이미지에서 제1 표시 영역에 대응하는 크기로 크롭된 제1 잘라내기 영역 내의 공간 요소를 분석하여도출하고, 상기 제2 공간을 도출하는 동작은, 상기 배경 이미지에서 제1 표시 영역 및 제2 표시 영역에 대응하는 크기로 크롭된 제2 잘라내기 영역 내의 공간요소를 분석하여 도출하는 방법."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 배경 이미지는 카메라를 통해 획득한 현실 이미지 또는 랜더링된 가상 현실 공간 이미지를 포함하는 방법."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서, 상기 공간 요소는 바닥, 벽, 천장, 물체 중 적어도 하나를 포함하고, 상기 제1 공간 또는 제2 공간을 도출하는 동작은, 상기 공간 요소의 크기 면적, 높이, 거리 중 적어도 하나를 분석하여 배경 이미지에서 상기 아바타가 위치할 바닥 면적을 계산하고, 상기 상기 바닥 면적을 기준으로 제1 공간 또는 제2 공간의 x축, y축 및 z축 값을 결정하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서, 상기 아바타 특성 정보는, 아바타 다리, 팔, 바디 및 얼굴의 사이즈, 아바타 모션, 아바타 애니메이션 활동 또는 아바타 자세 중 적어도 하나에 대한 정보를 포함하는 방법."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서, 상기 디스플레이의 활성화 영역이 제1 표시 영역인 것에 기반하여, 상기 제1 공간 내에서 표현 가능한 아바타컨텐츠들을 선별하여 제1 아바타 서비스 사용자 인터페이스를 구성하는 동작; 및 상기 디스플레이의 활성화 영역이 상기 제1 표시 영역에서 상기 제2 표시 영역의 적어도 일부까지 확장된 것에기반하여, 상기 제2 공간 내에서 표현 가능한 아바타 컨텐츠들을 선별하여 제2 아바타 서비스 사용자 인터페이스를 구성하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 제2 아바타 서비스 사용자 인터페이스는 확장된 활성화 영역에 대응하는 확장 서비스 기능을 더 포함하고, 상기 확장 서비스 기능은, 메인 아바타 이외에 다른 아바타를 추가로 표시할 수 있는 다른 아바타 표시 기능,아타바의 복제 클론을 제공할 수 있는 클론 기능, 아바타와 상호 인터랙션을 통해 추가 기능을 실행할 수 있는아바타 인터랙션 기능 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서, 상기 제1 아바타 서비스 사용자 인터페이스는, 상기 제1 공간 내에서 표현 가능한 모션 항목들을 포함하고, 상기 제2 아바타 서비스 사용자 인터페이스는 상기 제2 공간 내에서 표현 가능한 모션 항목들을 포함하고, 공개특허 10-2022-0078192-6-상기 제1 아바타 서비스 사용자 인터페이스를 구성하는 동작은, 상기 제1 공간 내에서 표현 불가능한 모션 항목들이 포함되는 경우, 상기 제1 공간 내에서 표현 가능한 모션 항목들과 상기 표현 불가능한 모션 항목들을 시각적으로 다르게 표시하도록 구성하는 방법."}
{"patent_id": "10-2020-0167459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 제1 아바타 서비스 사용자 인터페이스를 구성하는 동작은, 상기 제1 아바타 서비스 사용자 인터페이스에 상기 제1 공간 내에서 표현 불가능한 모션 항목들이 포함되는 경우, 모션 항목들 중 일부가 표현 불가능하다는 것을 안내하는 정보 또는 상기 디스플레이를 제1 표시 영역에서제2 표시 영역의 적어도 일부까지 확장하도록 안내하는 정보를 더 포함하여 구성하는 방법."}
{"patent_id": "10-2020-0167459", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따르면 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 제1 방향 또는 제2 방향으로 이동 이 가능하도록 배치되는 제2 하우징, 상기 제2 하우징을 상기 제1 하우징에 대하여 이동시키도록 구동되는 구동 장치, 상기 제2 하우징이 상기 제1 하우징에 대해 제1 방향으로 이동 시 제1 표시 영역을 가지며, 상기 구동 장 (뒷면에 계속)"}
{"patent_id": "10-2020-0167459", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시예들은 확장이 가능한 디시플레이를 포함하는 플랙서블 전자 장치 및 이의 아바타 운용 방법에 관한 것이다."}
{"patent_id": "10-2020-0167459", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 아바타(avatar) 촬영 또는 아바타에 얼굴 표정, 동작 또는 텍스트를 적용하여 사용자가 자신의 감 정을 간접적으로 표현하도록 하는 아바타 서비스를 사용자에게 제공할 수 있다. 예를 들어, 아바타는 가상 현실 또는 증강 현실 플랫폼, 또는 온라인 게임 서비스에서 활용되고 있다. 한편, 전자 장치는 더 새롭고 다양한 기능을 원하는 사용자의 니즈(needs)에 부합하기 위하여, 디스플레이를 확 장하거나, 디스플레이의 활용도를 개선시키기 위한 구조로 진화되고 있다. 최근 슬라이딩 방식 또는 롤러 방식 으로 디스플레이를 확장시킬 수 있는 플랙서블 전자 장치가 출시되고 있다. 플랙서블 전자 장치는 제1 하우징 및 제2 하우징에 의해 형성된 공간 내에 플랙서블 디스플레이를 배치하며, 플 랙서블 디스플레이가 제1 하우징 및 제2 하우징 상호 간의 슬라이딩 운동에 의해 확장되거나 축소될 수 있다. 이로 인해, 플랙서블 전자 장치의 경우 디스플레이에 있어서 시각적 정보가 표시될 표시 영역이 축소되거나 확 장될 수 있다."}
{"patent_id": "10-2020-0167459", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "디스플레이 크기가 제한적인 또는 고정(fix)된 전자 장치는 아바타를 표현할 수 있는 범위가 한정적이므로, 행 동 범위가 좁은 모션(motion) 또는 애니메이션 활동(animation activity)으로 서비스를 제공해야 하는 한계가 존재할 수 있다. 플랙서블 전자 장치의 경우 시각적 정보가 표시되는 활성화 영역이 확장됨에 따라 아바타로 표현할 수 있는 행 동 범위가 확장되므로 이에 맞는 아바타 서비스를 지원하는 방안이 필요할 수 있다. 다양한 실시예에서 전자 장치에서 물리적으로 디스플레이가 확장됨에 따라 아바타를 표현할 수 있는 행동 범위 를 증가시키고, 증가된 행동 범위 내에서 표현 가능한 확장된 아바타 컨텐츠를 제공할 수 있다."}
{"patent_id": "10-2020-0167459", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따르면 플랙서블 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 제1 방향 또는 제2 방향 으로 이동이 가능하도록 배치되는 제2 하우징, 상기 제2 하우징을 상기 제1 하우징에 대하여 이동시키도록 구동 되는 구동 장치, 상기 제2 하우징이 상기 제1 하우징에 대해 제1 방향으로 이동 시 제1 표시 영역을 가지며, 상 기 구동 장치에 의해 상기 제2 하우징이 상기 제1 하우징으로부터 제2 방향으로 이동 시 상기 제1 표시 영역 및 제2 표시 영역으로 확장되는 디스플레이 및 상기 디스플레이 및 상기 구동 장치와 작동적으로 연결되는 프로세 서를 포함하고, 상기 프로세서는, 아바타 서비스 실행 시에, 상기 디스플레이에서 시각적 정보가 표시될 활성화영역이 상기 제1 표시 영역인 경우, 상기 제1 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 아 바타를 표현할 가상의 제1 공간을 도출하고, 아바타의 특성 정보를 기반으로 상기 제1 공간 내에서 표현 가능한 제1 자세의 아바타를 제공하고, 상기 디스플레이의 활성화 영역이 제1 표시 영역에서 제2 표시 영역의 적어도 일부까지 확장된 것에 기반하여, 상기 제1 및 제2 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 가상의 제2 공간을 도출하고, 상기 아바타의 특성 정보를 기반으로 상기 제2 공간 내에서 표현 가능한 제2 자세 의 아바타 및 확장 서비스 기능 중 적어도 하나를 제공하도록 설정될 수 있다. 다양한 실시예에 따르면 플랙서블 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 제1 방향 또는 제2 방향 으로 이동이 가능하도록 배치되는 제2 하우징, 상기 제2하우징을 상기 제1 하우징에 대하여 이동시키도록 구동 되는 구동 장치, 상기 제2 하우징이 상기 제1 하우징에 대해 제1 방향으로 이동 시 제1 표시 영역을 가지며, 상 기 구동 장치에 의해 상기 제2 하우징이 상기 제1하우징으로부터 제2 방향으로 이동 시 상기 제1 표시 영역 및 제2 표시 영역으로 확장되는 디스플레이, 및 상기 디스플레이 및 상기 구동 장치와 작동적으로 연결되는 프로세 서를 포함하고, 상기 프로세서는, 아바타 서비스 실행 시에 표시될 배경 이미지를 획득하고, 전자 장치의 상태 에 기반하여 상기 디스플레이에서 시각적 정보가 표시될 활성화 영역의 면적을 트래킹하고, 상기 활성화 영역의 면적에 대응하여 상기 획득된 배경 이미지에서 잘라내기 영역을 결정하고, 상기 결정된 잘라내기 영역 내에 포 함된 공간 요소를 분석하여 아바타를 표현할 가상의 공간 범위를 도출하고, 상기 아바타의 특성 정보를 기반으 로 상기 공간 범위 내에서 표현 가능한 아바타 컨텐츠들을 선별하여 아바타 서비스 사용자 인터페이스(user interface)를 생성하고, 상기 생성된 아바타 서비스 사용자 인터페이스를 상기 잘리 내기 영역에 배경 이미지에 제공하도록 설정될 수 있다. 다양한 실시예에 따르면 플랙서블 전자 장치의 아바타 운용 방법은, 제1 하우징에 대해 제2 하우징이 제1 방향 으로 이동 시 제1 표시 영역을 가지며, 상기 제2 하우징이 상기 제1하우징으로부터 제2 방향으로 이동 시 상기 제1 표시 영역 및 제2 표시 영역으로 확장되는 디스플레이를 통해 아바타 서비스를 실행하는 요청을 수신하는 동작, 상기 디스플레이에서 시각적 정보가 표시될 활성화 영역이 상기 제1 표시 영역인 경우, 상기 아바타 서비 스 실행 요청에 응답하여 상기 제1 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 아바타를 표현 할 가상의 제1 공간을 도출하는 동작, 아바타의 특성 정보를 기반으로 상기 제1공간 내에서 표현 가능한 제1 자 세의 아바타를 상기 제1 표시 영역인 활성화 영역에 표시하는 동작, 상기 디스플레이의 활성화 영역이 제1 표시 영역에서 제2 표시 영역의 적어도 일부까지 확장된 것에 기반하여, 상기 제1 및 제2 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 가상의 제2 공간을 도출하는 동작 및 상기 아바타의 특성 정보를 기반으로 상 기 제2 공간 내에서 표현 가능한 제2 자세의 아바타 및 확장 서비스 기능 중 적어도 하나를 상기 제1 표시 영역 및 제2 표시 영역에 대응하는 활성화 영역에 표시하는 동작을 포함할 수 있다."}
{"patent_id": "10-2020-0167459", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예에 따르면, 플랙서블 전자 장치에 있어서 디스플레이의 확장 정보에 따라 아타바의 행동 범위를 변경하여 변경된 행동 범위에 적합하거나 확장된아바타 컨텐츠들로 전환함으로써 상황에 따라 적합한 아바타 서 비스를 사용자에게 제공할 수 있다."}
{"patent_id": "10-2020-0167459", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 도1 은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하 여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입 력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치 에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모 듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전 부 또는 일부는 외부의 전자 장치들(102,104, 또는108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a는 일 실시예에 따른 닫힌 상태(closed state)의 전자 장치에 관한 전면 사시도이다. 도 2b는 일 실 시예에 따른 닫힌 상태의 전자 장치에 관한 후면 사시도이다. 도 3a는 일 실시예에 따른 열린 상태(open state)의 전자 장치에 관한 전면 사시도이다. 도 3b는 일 실시예에 따른 열린 상태의 전자 장치에 관 한 후면 사시도이다. 다양한 실시예에 따르면, 도 2a의 전자 장치는 도 1의 전자 장치를 포함할 수 있다. 도 2a, 2b, 3a, 및 3b를 참조하면, 일 실시예에서, 전자 장치는 슬라이딩 방식으로 화면을 확장시킬 수 있도록 구현될 수 있다. 예를 들어, 화면은 플랙서블 디스플레이 중 외부로 보여지고 있는 영역 일 수 있다. 도 2a 및 2b는 화면이 확장되지 않은 상태의 전자 장치를 도시하고, 도 3a 및 3b는 화 면이 확장된 상태의 전자 장치를 도시한다. 화면이 확장되지 않은 상태는 디스플레이의 슬라이딩 운동(sliding motion)을 위한 슬라이딩 플레이트가 슬라이드 아웃(slide-out)되지 않은 상태로서 이하 '닫힌 상태'로 지칭될 수 있다. 화면이 확장된 상태는 슬라이딩 플레이트의 슬라이드 아웃에 의해 화면이 더 이상 확장되지 않는 최대로 확장된 상태로서 이하 '열린 상태'로 지칭될 수 있다. 예를 들어, 슬라이드 아웃은 전자 장치가 닫힌 상태에서 열린 상태로 전환될 때 슬라이딩 플레이트가 제 1 방향(예: +x 축 방향)으로 적어도 일부 이동하는 것일 수 있다. 다양한 실시예에 따르면, 열린 상태는 닫힌 상 태와 비교하여 화면이 확장된 상태로서 정의될 수 있고, 슬라이딩 플레이트의 이동 위치에 따라 다 양한 사이즈의 화면을 제공할 수 있다. 다양한 실시예에 따르면, 중간 상태(intermediated state)는 도 2a의 닫 힌 상태 및 도 3a의 열린 상태 사이의 상태를 가리킬 수 있다. 화면은 시각적으로 노출되어 이미지를 출 력 가능하게 하는 플랙서블 디스플레이의 활성화 영역(active area)(또는 표시 영역, 표시 면적)을 포함할 수 있고, 전자 장치는 슬라이딩 플레이트의 이동 또는 플랙서블 디스플레이의 이동에 따라 활성 화 영역)(또는 표시 영역, 표시 면적)을 조절할 수 있다. 이하 설명에서, 열린 상태는 화면이 최대로 확 장된 상태를 가리킬 수 있다. 어떤 실시예에서, 도 2a의 전자 장치에 슬라이딩 운동 가능하게 배치되어 화 면을 제공하는 플랙서블 디스플레이는 '슬라이드 아웃 디스플레이(slide-out display) 또는 '익스펜 더블 디스플레이(expandable display)'로 지칭될 수도 있다. 일 실시예에 따르면, 전자 장치는 플랙서블 디스플레이와 관련된 슬라이딩 구조를 포함할 수 있다. 예를 들어, 외력에 의해 플랙서블 디스플레이가 설정된 거리로 이동되면, 슬라이딩 구조에 포함된 탄력 구 조로 인해, 더 이상의 외력 없이도 닫힌 상태에서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환될 수 있 다 (예: 반자동 슬라이드 동작). 어떤 실시예에 따르면, 전자 장치에 포함된 입력 장치를 통해 신호가 발생되면, 플랙서블 디스플레이(23 0)와 연결된 모터와 같은 구동 장치(예: 도 1의 구동 장치로 인해 전자 장치는 닫힌 상태에서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환할 수 있다. 예를 들어, 하드웨어 버튼, 또는 화면을 통해 제공되 는 소프트웨어 버튼을 통해 신호가 발생되면, 전자 장치는 닫힌 상태에서 열린 상태로, 또는 열린 상태에 서 닫힌 상태로 전환될 수 있다. 다양한 실시예에 따르면, 압력 센서와 같은 다양한 센서로부터 신호가 발생되면, 전자 장치는 닫힌 상태에 서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환될 수 있다. 예를 들어, 전자 장치를 손으로 휴대하 거나 파지할 때 손의 일부(예: 손 바닥 또는 손가락)가 전자 장치의 지정된 구간 내를 가압하는 스퀴즈 제 스처(squeeze gesture)가 센서를 감지될 수 있고, 이에 대응하여 전자 장치는 닫힌 상태에서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환될 수 있다. 일 실시예에 따르면, 디스플레이는 제 2 구간(②도 3a 참조)을 포함할 수 있다. 제 2 구간(②은 전자 장치 의 닫힌 상태에서 열린 상태로 전환될 때 화면의 확장된 부분을 포함할 수 있다. 전자 장치가 닫힌 상태에서 열린 상태로 전환될 때, 제 2 구간(②은 미끄러지듯 전자 장치의 내부 공간으로부터 인출되 고, 이로 인해 화면이 확장될 수 있다. 전자 장치가 열린 상태에서 닫힌 상태로 전환될 때, 제 2 구 간(②의 적어도 일부는 미끄러지듯 전자 장치의 내부 공간으로 인입되고, 이로 인해 화면이 축소될 수 있다. 전자 장치가 열린 상태에서 닫힌 상태로 전환될 때, 제 2 구간(②의 적어도 일부는 휘어지면서 전자 장치의 내부 공간으로 이동될 수 있다. 예를 들어, 플랙서블 디스플레이는 폴리이미드 (PI(polyimide)), 또는 폴리에스터(PET(polyester))를 포함하는 폴리머 소재로 형성된 유연한 기판(예: 플라스 틱 기판)을 포함할 수 있다. 제 2 구간(②은 전자 장치가 열린 상태 및 닫힌 상태 사이를 전환할 때 플랙 서블 디스플레이에서 휘어지는 부분으로서, 예를 들어, 벤더블 구간(bendable section)으로 지칭될 수도 있다. 이하 설명에서는, 제 2 구간(②은 벤더블 구간으로 지칭하겠다. 일 실시예에 따르면, 전자 장치는 하우징, 슬라이딩 플레이트, 또는 플랙서블 디스플레이 를 포함할 수 있다. 하우징(또는, 케이스(case))은, 예를 들어, 백 커버(back cover), 제 1 사이드 커버(side cover), 또는 제 2 사이드 커버를 포함할 수 있다. 백 커버, 제 1 사이드 커버, 또는 제 2 사이드 커버는 전자 장치의 내부에 위치된 지지 부재(미도시)에 연결될 수 있고, 전자 장치의 외관을 적어도 일부 형성할 수 있다. 백 커버는, 예를 들어, 전자 장치의 후면(101B)을 적어도 일부 형성할 수 있다. 일 실시예에서, 백 커버는 실질적으로 불투명할 수 있다. 예를 들어, 백 커버는 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의해 형성될 수 있다. 어떤 실시예에 따르면, 플랙서블 디스플레이의 벤더블 구간(②이 하우징의 내 부 공간에 인입된 상태(예: 닫힌 상태)에서, 벤더블 구간(②의 적어도 일부는 백 커버를 통해 외부로부터 보일 수 있게 배치될 수도 있다. 이러한 경우, 백 커버는 투명 소재 및/또는 반투명 소재로 형성될 수 있 다. 일 실시예에 따르면, 백 커버는 평면부(212a), 및 평면부(212a)를 사이에 두고 서로 반대 편에 위치된 곡 면부들(212b, 212c)을 포함할 수 있다. 곡면부들(212b, 212c)은 백 커버의 양쪽 상대적으로 긴 에지들(미 도시)에 각각 인접하여 형성되고, 백 커버와는 반대 편에 위치된 화면 쪽으로 휘어져 심리스하게 연장될 수 있다. 어떤 실시예에 따르면, 백 커버는 곡면부들(212b, 212c) 중 하나를 포함하거나 곡면부들(212b, 212c) 없이 구현될 수 있다. 일 실시예에 따르면, 제 1 사이드 커버 및 제 2 사이드 커버는 서로 반대 편에 위치될 수 있다. 예를 들어, 제 1 사이드 커버 및 제 2 사이드 커버는 슬라이딩 플레이트의 슬라이드 아웃의 제 1 방 향(예: +x 축 방향)과는 직교하는 제 2 방향(예: y 축 방향)으로 플랙서블 디스플레이를 사이에 두고 서로 반대 편에 위치될 수 있다. 제 1 사이드 커버는 전자 장치의 제 1 측면(213a)의 적어도 일부를 형성 할 수 있고, 제 2 사이드 커버는 제 1 측면(213a)과는 반대 방향으로 향하는 전자 장치의 제 2 측면 (214a)의 적어도 일부를 형성할 수 있다. 제 1 사이드 커버는 제 1 측면(213a)의 에지로부터 연장된 제 1 테두리부(또는, 제 1 림(rim))(213b)를 포함할 수 있다. 예를 들어, 제 1 테두리부(213b)는 전자 장치의 일측 베젤(bezel)을 적어도 일부 형성할 수 있다. 제 2 사이드 커버는 제 2 측면(214a)의 에지로부터 연장 된 제 2 테두리부(또는, 제 2 림)(214b)를 포함할 수 있다. 예를 들어, 제 2 테두리부(214b)는 전자 장치 의 타측 베젤을 적어도 일부 형성할 수 있다. 일 실시예에 따르면, 도 2a의 닫힌 상태에서 제 1 테두리부(213 b)의 표면, 제 2 테두리부(214b)의 표면, 및 슬라이딩 플레이트의 표면은 매끄럽게 연결되어, 화면 의 제 1 곡면부(230b) 쪽에 대응하는 일측 곡면부(미도시)를 형성할 수 있다. 다양한 실시예에 따르면, 제 1 테 두리부(213b)의 표면 또는 제 2 테두리부(214b)의 표면은 제 1 곡면부(230b)와는 반대 편에 위치된 화면 의 제 2 곡면부(230c) 쪽에 대응하는 타측 곡면부(미도시)를 포함할 수 있다. 일 실시예에 따르면, 슬라이딩 플레이트는 전자 장치의 내부에 위치된 지지 부재(미도시) 상에서 슬 라이딩 운동을 할 수 있다. 플랙서블 디스플레이의 적어도 일부는 슬라이딩 플레이트에 배치될 수 있 고, 도 2a의 닫힌 상태 또는 도 3a의 열린 상태는 상기 지지 부재 상에서의 슬라이딩 플레이트의 위치에 기초하여 형성될 수 있다. 일 실시예에 따르면, 플랙서블 디스플레이는 접착 부재(또는 점착 부재)(미도시)를 통해 슬라이딩 플레이트에 부착될 수 있다. 일 실시예에 따르면, 상기 접착 부재는 열반 응 접착 부재, 광반응 접착 부재, 일반 접착제 및/또는 양면 테이프를 포함할 수 있다. 어떤 실시예에 따르면, 플랙서블 디스플레이는 슬라이딩 플레이트에 형성된 리세스(recess)에 슬라이딩 방식으로 삽입되어 슬라이딩 플레이트에 배치 및 고정될 수 있다. 슬라이딩 플레이트는 플랙서블 디스플레이의 적 어도 일부를 지지하는 역할을 하며, 어떤 실시예에서는 디스플레이 지지 구조로 지칭될 수도 있다. 일 실시예에 따르면, 슬라이딩 플레이트는 전자 장치의 외면(예: 외부로 노출되어 전자 장치의 외관을 형성하는 면)을 형성하는 제 3 테두리부(220b)를 포함할 수 있다. 예를 들어, 제 3 테두리부(220b)는 도 2a의 닫힌 상태에서 제 1 테두리부(213b) 및 제 2 테두리부(214b)와 함께 화면 주변의 베젤을 형성할 수 있다. 제 3 테두리부(220b)는, 닫힌 상태에서, 제 1 사이드 커버의 일단부 및 제 2 사이드 커버의 일단부를 연결하도록 제 2 방향(예: y 축 방향)으로 연장될 수 있다. 예를 들어, 도 2a의 닫힌 상태에서 제 3 테두리부 (220b)의 표면은 제 1 테두리부(213b)의 표면 및/또는 제 2 테두리부(214b)의 표면과 매끄럽게 연결될 수 있다. 일 실시예에 따르면, 슬라이딩 플레이트의 슬라이드 아웃으로 인해, 벤더블 구간(②의 적어도 일부는 전자 장치의 내부로부터 밖으로 나오면서 도 3a에서와 같이 화면이 확장된 상태(예: 열린 상태)가 제공될 수 있다. 일 실시예에 따르면, 도 2a의 닫힌 상태에서, 화면은 평면부(230a), 및 평면부(230a)를 사이에 두고 서로 반대 편에 위치된 제 1 곡면부(230b) 및/또는 제 2 곡면부(230c)를 포함할 수 있다. 예를 들어, 제 1 곡면부 (230b) 및 제 2 곡면부(230c)는 평면부(230a)를 사이에 두고 실질적으로 대칭(symmetrical)일 수 있다. 예를 들어, 도 2a의 닫힌 상태에서, 제 1 곡면부(230b) 및/또는 제 2 곡면부(230c)는 백 커버의 곡면부들(212b, 212c)과 각각 대응하여 위치될 수 있고, 백 커버 쪽으로 휘어진 형태일 수 있다. 도 2a의 닫힌 상태에서 도 3a의 열린 상태로 전환되면, 평면부(230a)는 확장될 수 있다. 예를 들면, 도 2a의 닫힌 상태에서 제 2 곡면 부(230c)를 형성하는 벤더블 구간(②의 일부 영역은, 도 2a의 닫힌 상태에서 도 3a의 열린 상태로 전환될 때 확 장된 평면부(230a)에 포함되며 벤더블 구간(②의 다른 영역으로 형성될 수 있다. 일 실시예에 따르면, 전자 장치는, 벤더블 구간(②의 인입 또는 인출을 위한 오프닝(미도시), 및/또는 오 프닝에 위치된 풀리(pulley)(미도시)를 포함할 수 있다. 풀리는 벤더블 구간(②에 대응하여 위치될 수 있고, 도 2a의 닫힌 상태 및 도 3a의 열린 상태 사이의 전환에서 풀리의 회전을 통해 벤더블 구간(②의 이동 및 그 이동 방향이 안내될 수 있다. 제 1 곡면부(230b)는 슬라이딩 플레이트의 일면에 형성된 곡면에 대응하여 형성될 수 있다. 제 2 곡면부(230c)는 벤더블 구간(②중 풀리의 곡면에 대응하는 부분에 의해 형성될 수 있다. 제 1 곡 면부(230c)는 전자 장치의 닫힌 상태 또는 열린 상태에서 제 2 곡면부(230b)의 반대 편에 위치되어 화면 의 심미성을 향상시킬 수 있다. 어떤 실시예에 따르면, 제 1 곡면부(230b) 없이 평면부(230a)가 확장된 형태로 구현될 수도 있다. 일 실시예에 따르면, 플랙서블 디스플레이는 터치 감지 회로(예: 터치 센서)를 더 포함할 수 있다. 다양한 실시예에 따르면(미도시), 플랙서블 디스플레이는 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/또 는 자기장 방식의 펜 입력 장치(예: 스타일러스 펜)를 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 예를 들면, 디지타이저는 펜 입력 장치로부터 인가된 전자기 유도 방식의 공진 주파수를 검출할 수 있도 록 유전체 기판상에 배치되는 코일 부재를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 마이크 홀(예: 도 1의 입력 모듈), 스피커 홀(예: 도 1 의 음향 출력 모듈), 커넥터 홀(에: 도 1의 연결 단자), 카메라 모듈(예: 도 1의 카메라 모듈), 또는 플래시를 포함할 수 있다. 다양한 실시예에 따르면, 플래시는 카메라 모듈에 포함하여 구현될 수도 있다. 어떤 실시예에서, 전자 장치는 구성 요소들 중 적어도 하나를 생략하거나 다 른 구성 요소를 추가적으로 포함할 수 있다. 마이크 홀은, 예를 들어, 전자 장치의 내부에 위치된 마이크(미도시)에 대응하여 제 2 측면(214a)의 적어도 일부에 형성될 수 있다. 마이크 홀의 위치는 도 2a의 실시예에 국한되지 않고 다양할 수 있다. 어 떤 실시예에 따르면, 전자 장치는 소리의 방향을 감지할 수 있는 복수의 마이크들을 포함할 수 있다. 스피커 홀은, 예를 들어, 전자 장치의 내부에 위치된 스피커에 대응하여 제 2 측면(214a)의 적어도 일부에 형성될 수 있다. 스피커 홀의 위치는 도 2a의 실시예에 국한되지 않고 다양할 수 있다. 다양한 실 시예에 따르면, 전자 장치는 통화용 리시버 홀을 포함할 수 있다. 어떤 실시예에서는 마이크 홀 및 스피커 홀이 하나의 홀로 구현되거나, 피에조 스피커와 같이 스피커 홀이 생략될 수 있다. 커넥터 홀은, 예를 들어, 전자 장치의 내부에 위치된 커넥터(예: USB 커넥터)에 대응하여 제 2 측면 (214a)의 적어도 일부에 형성될 수 있다. 전자 장치는 커넥터 홀을 통해 커넥터와 전기적으로 연결된 외부 전자 장치와 전력 및/또는 데이터를 송신 및/또는 수신할 수 있다. 커넥터 홀의 위치는 도 2a의 실시 예에 국한되지 않고 다양할 수 있다. 카메라 모듈 및 플래시는, 예를 들어, 전자 장치의 후면(101B)에 위치될 수 있다. 카메라 모듈 은 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 플래시 는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 어떤 실시예에서는, 2개 이 상의 렌즈들(적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 위치될 수 있다. 다양한 실시예에 따르면, 도 2b 또는 3b의 실시예에 국한되지 않고, 전자 장치는 복수의 카메라 모 듈들을 포함할 수 있다. 카메라 모듈은 복수의 카메라 모듈들 중 하나일 수 있다. 예를 들면, 전자 장치 는 각각 다른 속성(예: 화각) 또는 기능을 가진 복수의 카메라 모듈들(예: 듀얼 카메라, 또는 트리플 카메 라)을 포함할 수 있다. 예를 들면, 서로 다른 화각을 갖는 렌즈를 포함하는 카메라 모듈(예: 카메라 모듈(25 4))이 복수 개로 구성될 수 있고, 전자 장치는 사용자의 선택에 기반하여, 전자 장치에서 수행되는 카메라 모듈의 화각을 변경하도록 제어할 수 있다. 또한, 복수의 카메라 모듈들은, 광각 카메라, 망원 카메라, 컬러 카메라, 흑백(monochrome) 카메라, 또는 IR(infrared) 카메라(예: TOF(time of flight) camera, structured light camera) 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, IR 카메라는 센서 모듈(미도 시)의 적어도 일부로 동작될 수 있다. 다양한 실시예에 따르면(미도시), 전자 장치는 화면이 향하는 방향으로 놓인 전자 장치의 일면 (예: 전면(101A))을 통해 광을 수신된 광을 기초로 이미지 신호를 생성하는 카메라 모듈(예: 전면 카메라)을 더 포함할 수 있다. 예를 들어, 카메라 모듈은, 도 2b 또는 3b의 실시예에 국한되지 않고, 플랙서블 디스플레 이에 형성된 오프닝(예: 관통 홀, 또는 노치(notch))과 정렬되어 하우징의 내부에 위치될 수 있다. 카메라 모듈은 상기 오프닝, 및 상기 오프닝과 중첩된 투명 커버의 일부 영역을 통해 광을 수신하여 이미 지 신호를 생성할 수 있다. 상기 투명 커버는 플랙서블 디스플레이를 외부로부터 보호하는 역할을 하며, 예를 들어, 폴리이미드 또는 울트라신글라스(UTG(ultra thin glass)와 같은 물질을 포함할 수 있다. 어떤 실시예에 따르면, 도 2b 또는 3b의 실시예에 국한되지 않고, 카메라 모듈은 플랙서블 디스플레이 의 화면의 적어도 일부의 하단에 배치될 수 있고, 카메라 모듈의 위치가 시각적으로 구별(또는 노출)되지 않고 관련 기능(예: 이미지 촬영)을 수행할 수 있다. 이 경우, 예를 들어, 화면의 위에서 볼 때(예: -z 축 방향으로 볼 때), 카메라 모듈은 화면의 적어도 일부에 중첩되게 배치되어, 외부로 노 출되지 않으면서, 외부 피사체의 이미지를 획득할 수 있다. 다양한 실시예에 따르면(미도시), 전자 장치는 키 입력 장치(예: 도 1의 입력 모듈)를 더 포함할 수 있다. 키 입력 장치는, 예를 들어, 제 1 사이드 커버에 의해 형성된 전자 장치의 제 1 측면(213a)에 위치될 수 있다. 어떤 실시예에서(미도시), 키 입력 장치는 적어도 하나의 센서 모듈을 포함할 수 있다. 다양한 실시예에 따르면(미도시), 전자 장치는 다양한 센서 모듈(예: 도 1의 센서 모듈)을 포함할 수 있다. 센서 모듈은 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데 이터 값을 생성할 수 있다. 예를 들어(미도시), 센서 모듈은 화면이 향하는 방향으로 놓인 전자 장치 의 전면(101A)을 통해 광을 수신된 광을 기초로 외부 물체의 근접에 관한 신호를 생성하는 근접 센서를 포 함할 수 있다. 다른 예를 들어(미도시), 센서 모듈은 전자 장치의 전면(101A) 또는 후면(101B)을 통해 수 신된 광을 기초로 생체에 관한 정보를 검출하기 위한 지문 센서, 또는 HRM 센서와 같은 다양한 생체 센서를 포 함할 수 있다. 전자 장치는 다양한 다른 센서 모듈, 예를 들어, 제스처 센서, 자이로 센서, 기압 센서, 마 그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 도 2a, 2b, 3a, 및 3c의 실시예에 국한되지 않고, 전자 장치는 슬라이딩 플레이 트의 슬라이드 아웃시 제 3 테두리부(220b) 쪽에서 화면이 확장되는 구조로 구현될 수도 있다. 예를 들어, 도 2a의 닫힌 상태에서 제 1 곡면부(230b)를 형성하는 플랙서블 디스플레이의 일부 영역은, 도 2a의 닫힌 상태에서 도 3a의 열린 상태로 전환될 때 확장된 평면부(230a)에 포함되며, 플랙서블 디스플레이의 다른영역으로 형성될 수 있다. 도 4는 일 실시예에 따른 도 2a의 전자 장치에 관한 전개 사시도이다. 도 4를 참조하면, 일 실시예에서, 전자 장치는 백 커버, 제 1 사이드 커버, 제 2 사이드 커버 , 지지 부재 조립체, 풀리(pulley), 슬라이딩 플레이트, 플랙서블 디스플레이, 지지 시트(support sheet), 멀티 바 구조(muti-bar structure)(또는 멀티 바 조립체), 또는 인쇄 회로 기 판(예: PCB(printed circuit board), FPCB(flexible PCB) 또는 RFPCB(rigid-flexible PCB))을 포함할 수 있다. 도 4의 도면 부호들 중 일부에 대한 중복 설명을 생략한다. 일 실시예에 따르면, 지지 부재 조립체(또는, 지지 구조물)는 하중을 견딜 수 있는 프레임 구조로서 전자 장치의 내구성 또는 강성에 기여할 수 있다. 지지 부재 조립체의 적어도 일부는 비금속 물질(예: 폴 리머) 또는 금속 물질을 포함할 수 있다. 백 커버, 제 1 사이드 커버, 또는 제 2 사이드 커버를 포함하는 하우징(도 2a 참조), 풀리, 슬라이딩 플레이트, 플랙서블 디스플레이, 지지 시트 , 멀티 바 구조, 또는 인쇄 회로 기판은 지지 부재 조립체에 배치 또는 결합될 수 있다. 일 실시예에 따르면, 지지 부재 조립체는 제 1 지지 부재, 제 2 지지 부재, 제 3 지지 부재 , 제 4 지지 부재, 또는 제 5 지지 부재를 포함할 수 있다. 제 1 지지 부재(또는 제 1 브라켓(bracket))는, 예를 들어, 플레이트 형태일 수 있다. 슬라이딩 플레이트 는 제 1 지지 부재의 일면(410a)에 배치될 수 있다. 제 2 지지 부재(또는 제 2 브라켓)는, 예를 들어, z 축 방향으로 볼 때, 제 1 지지 부재의 적어도 일부와 중첩된 플레이트 형태일 수 있고, 또는 제 1 지지 부재 및/또는 제 3 지지 부재와 결합될 수 있다. 제 2 지지 부재는 제 1 지지 부재 및 제 3 지지 부재 사이에 위치될 수 있다. 제 3 지지 부재는 제 2 지지 부재를 사이에 두고 제 1 지지 부재 및/또는 제 2 지지 부재와 결합될 수 있다. 인쇄 회로 기판은 제 1 지지 부재 및 제 2 지지 부재 사이에서 제 2 지지 부재에 배치될 수 있다. 제 4 지지 부재는 제 1 지지 부 재, 제 2 지지 부재, 및 제 3 지지 부재가 결합된 조립체(또는 구조)(미도시)의 일측에 결합될 수 있다. 제 5 지지 부재는 제 1 지지 부재, 제 2 지지 부재, 및 제 3 지지 부재가 결합 된 조립체(또는 구조)(미도시)의 타측에 결합될 수 있고, 제 4 지지 부재와는 반대 편에 위치될 수 있다. 제 1 사이드 커버는 제 4 지지 부재 쪽에서 지지 부재 조립체와 결합될 수 있다. 제 2 사이드 커버는 제 5 지지 부재 쪽에서 지지 부재 조립체와 결합될 수 있다. 백 커버는 제 3 지지 부재 쪽에서 지지 부재 조립체와 결합될 수 있다. 제 1 지지 부재, 제 2 지지 부재, 제 3 지지 부재, 제 4 지지 부재, 또는 제 5 지지 부재의 적어도 일부는 금속 물질 및/또는 비금속 물질(예: 폴리머)을 포함할 수 있다. 다양한 실시예에 따르면, 제 1 지지 부재, 제 2 지지 부재, 제 3 지지 부재, 제 4 지지 부재, 및 제 5 지지 부재 중 적어도 둘 이상은 일체로 구현될 수 있다. 어떤 실시예에 따르면, 지지 부재 조립체는 제 1 지지 부재, 제 2 지지 부재, 제 3 지지 부재 , 제 4 지지 부재, 및 제 5 지지 부재 중 적어도 일부를 형성하는 구조를 지칭할 수도 있다. 어 떤 실시예에 따르면, 제 1 지지 부재, 제 2 지지 부재, 제 3 지지 부재, 제 4 지지 부재, 및 제 5 지지 부재 중 일부는 생략될 수도 있다. 제 1 지지 부재는, 예를 들어, 제 4 지지 부재와 대면하는 제 1 측면(미도시), 제 5 지지 부재 와 대면하고 제 1 측면과는 반대 편에 위치된 제 2 측면(410c), 제 1 측면의 일단부 및 제 2 측면(410c)의 일단 부를 연결하는 제 3 측면(미도시), 또는 제 1 측면의 타단부 및 제 2 측면(410c)의 타단부를 연결하고 제 3 측 면과는 반대 편에 위치된 제 4 측면(410d)을 포함할 수 있다. 일 실시예에 따르면, 풀리는 제 1 지지 부재 의 제 3 측면 근처에 위치될 수 있다. 또 다른 예로, 슬라이드 아웃되는 방향이 반대로 형성된 전자 장치 의 경우, 풀리는 제 1 지지 부재의 제 4 측면(410d) 근처에 위치될 수도 있다. 풀리는 제 5 지 지 부재로부터 제 4 지지 부재로 향하는 방향(예: +y 축 방향)으로 연장된 실린더 형태의 롤러 (roller)를 포함할 수 있다. 풀리는 롤러와 연결된 제 1 회전 축(rotation shaft)(미도시) 및 제 2 회전 축을 포함할 수 있고, 제 1 회전 축 및 제 2 회전 축은 롤러를 사이에 두고 서로 반 대 편에 위치될 수 있다. 제 1 회전 축은 롤러 및 제 1 사이드 커버 사이에 위치될 수 있고, 제 4 지 지 부재와 연결될 수 있다. 제 2 회전 축은 롤러 및 제 2 사이드 커버 사이에 위치될 수 있고, 제 5 지지 부재와 연결될 수 있다. 제 4 지지 부재는 제 1 회전 축이 삽입되는 제 1 관통 홀 을 포함할 수 있고, 제 5 지지 부재는 제 2 회전 축이 삽입되는 제 2 관통 홀을 포함할 수 있다. 롤러는 제 4 지지 부재에 배치된 제 1 회전 축 및 제 5 지지 부재에 배치된 제 2 회전 축을 기초로 회전이 가능할 수 있다. 일 실시예에 따르면, 슬라이딩 플레이트는 제 1 지지 부재 상에서 슬라이딩 운동 가능하게 지지 부재 조립체에 배치될 수 있다. 예를 들어, 제 1 지지 부재 및 슬라이딩 플레이트 사이에는 이들 간 의 결합 및 슬라이딩 플레이트의 이동을 지원 및 안내하기 위한 슬라이딩 구조가 마련될 수 있다. 일 실시 예에 따르면, 슬라이딩 구조는 적어도 하나의 탄력 구조를 포함할 수 있다. 외력에 의해 슬라이딩 플레이 트가 설정된 거리로 이동되면, 적어도 하나의 탄력 구조로 인해, 더 이상의 외력 없이도 도 2a의 닫 힌 상태에서 도 3a의 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환될 수 있다. 적어도 하나의 탄력 구조 는, 예를 들어, 토션 스프링(torsion spring)과 같은 다양한 탄력 부재를 포함할 수 있다. 예를 들어, 탄 력 구조로서 토션 스프링은, 슬라이딩 플레이트와 연결된 일단부, 제 1 지지 부재와 연결된 타 단부, 및 상기 일단부 및 상기 타단부 사이의 스프링부를 포함할 수 있다. 외력에 의해 슬라이딩 플레이트(22 0)가 슬라이드 아웃의 제 1 방향(예: +x 축 방향)으로 설정된 거리로 이동되면, 상기 타단부에 대한 상기 일단 부의 위치가 변경되어 슬라이딩 플레이트는 더 이상의 외력 없이도 상기 스프링부의 탄력으로 인해 상기 제 1 방향으로 이동될 수 있고, 이로 인해 도 2a의 닫힌 상태에서 도 3a의 열린 상태로 전환될 수 있다. 외력에 의해 슬라이딩 플레이트가 상기 제 1 방향의 반대의 제 2 방향(예: -x 축 방향)으로 설정된 거리로 이동되 면, 상기 타단부에 대한 상기 일단부의 위치가 변경되어 슬라이딩 플레이트는 더 이상의 외력 없이도 상기 스프링부의 탄력으로 인해 상기 제 2 방향으로 이동될 수 있고, 이로 인해 도 3a의 열린 상태에서 도 2a의 닫힌 상태로 전환될 수 있다. 다양한 실시예에 따르면, 하우징은 지지 부재 조립체의 적어도 일부를 더 포함하여 정의될 수 있다. 예를 들어, 하우징은 제 1 방향(예: +z 축 방향)으로 향하는 일면(예: 제 1 지지 부재에 의해 형성된 일면(410a)), 및 제 1 면(410a)과는 반대인 제 2 방향(예: -z 축 방향)으로 향하는 타면(예: 도 2b의 후면 (101B))을 포함할 수 있다. 디스플레이 지지 구조는 제 1 방향과는 수직하는 제 3 방향(예: x 축 방향)으 로 슬라이딩 가능하게 하우징의 일면(예: 제 1 지지 부재에 의해 형성된 일면(410a))에 배치될 수 있 다.일 실시예에 따르면, 플랙서블 디스플레이는 벤더블 구간(②으로부터 연장된 제 1 구간(①을 포함할 수 있다. 제 1 구간(①은 슬라이딩 플레이트에 배치될 수 있다. 도 2a의 닫힌 상태에서 도 3a의 열린 상태로 전환될 때, 슬라이딩 플레이트의 이동으로 인해 제 1 구간(①과 연결된 벤더블 구간(②은 미끄러지듯 밖으 로 나오면서 화면(도 3a의 화면 참조)이 확장될 수 있다. 도 2a의 열린 상태에서 도 3a의 닫힌 상태로 전 환될 때, 슬라이딩 플레이트의 이동으로 인해, 벤더블 구간(②은 전자 장치의 안으로 적어도 일부 들 어가면서 화면(도 2a의 화면 참조)이 축소될 수 있다. 지지 부재 조립체는 벤더블 구간(②의 인입 또는 인출을 위한 오프닝(미도시)을 포함할 수 있고, 풀리는 상기 오프닝에 위치될 수 있다. 오프닝은 제 1 지지 부재 및 제 3 지지 부재 사이의 일측 갭(gap)을 포함하며, 오프닝과 인접한 제 3 지지 부재 의 일부는 롤러의 곡면에 대응하는 곡형일 수 있다. 풀리는 벤더블 구간(②에 대응하여 위 치될 수 있고, 도 2a의 닫힌 상태 및 도 3a의 열린 상태 사이의 전환에서 벤더블 구간(②의 이동으로 풀리(46 0)는 회전될 수 있다. 일 실시예에 따르면, 지지 시트(sheet)는 플랙서블 디스플레이의 배면에 부착될 수 있다. 플랙서블 디스플레이의 배면은, 복수의 픽셀들을 포함하는 디스플레이 패널로부터 빛이 방출되는 면과는 반대 편에 위치된 면을 가리킬 수 있다. 지지 시트는 플랙서블 디스플레이의 내구성에 기여할 수 있다. 지지 시 트는 도 2a의 닫힌 상태 및 도 3a 열린 상태 사이의 전환에서 발생할 수 있는 하중 또는 스트레스가 플랙 서블 디스플레이에 미치는 영향을 줄일 수 있다. 지지 시트는, 슬라이딩 플레이트가 이동될 때 이로부터 전달되는 힘에 의해 플랙서블 디스플레이가 파손되는 것을 방지할 수 있다. 도시하지 않았으나, 플랙서블 디스플레이는 복수의 픽셀들(pixels)을 포함하는 제 1 층과, 제 1 층과 결합된 제 2 층을 포함할 수 있다. 제 1 층은, 예를 들어, OLED(organic light emitting diode), 또는 micro LED(light emitting diod e)와 같은 발광 소자로 구현되는 복수의 픽셀들을 포함하는 발광 층(예: 디스플레이 패널), 및 이 밖의 다양한 층들(예: 편광 층과 같이, 화면의 화질 개선 또는 야외 시인성을 개선하기 위한 광학 층)을 포함할 수 있다. 일 실시예에 따르면, 광학 층은 발광 층의 광원으로부터 발생되고 일정한 방향으로 진동하는 빛을 선택적으로 통과 시킬 수 있다. 일 실시예에 따르면, 화면의 위에서 볼 때(예: -z 축 방향으로 볼 때), 전자 장치에 포함된 적어도 하나의 전자 부품(예: 카메라 모듈, 또는 센서 모듈)과 적어도 일부 중첩되는 플랙서블 디스플레 이의 일부 영역에는 복수의 픽셀들이 배치되지 않을 수 있다. 어떤 실시예에 따르면, 화면의 위에서 볼 때, 전자 장치에 포함된 적어도 하나의 전자 부품(예: 카메라 모듈, 또는 센서 모듈)과 적어도 일부 중 첩되는 플랙서블 디스플레이의 일부 영역은 다른 영역 대비 다른 픽셀 구조 및/또는 배선 구조를 포함할 수 있다. 예를 들어, 상기 적어도 하나의 전자 부품(예: 카메라 모듈, 또는 센서 모듈)과 적어도 일부 중첩되는플랙서블 디스플레이의 일부 영역은 다른 영역 대비 다른 픽셀 밀도를 가질 수 있다. 예를 들어, 상기 적 어도 하나의 전자 부품(예: 카메라 모듈, 또는 센서 모듈)과 적어도 일부 중첩되는 플랙서블 디스플레이의 일부 영역은, 오프닝을 포함하지 않더라도, 픽셀 구조 및/또는 배선 구조의 변경에 의해 형성된 실질적으로 투 명한 영역으로 구현될 수 있다. 제 2 층은 제 1 층을 지지하고 보호하는 역할(예: 완충 부재(cushion)), 빛을 차폐하는 역할, 전자기파를 흡수 또는 차폐하는 역할, 또는 열을 확산, 분산, 또는 방열하는 역할을 위한 다양 한 층들을 포함할 수 있다. 일 실시예에 따르면, 제 2 층의 적어도 일부는 도전성 부재(예: 금속 플레이트)로써, 전자 장치의 강성 보강에 도움을 줄 수 있고, 주변 노이즈를 차폐하며, 주변의 열 방출 부 품(예: 디스플레이 구동 회로)으로부터 방출되는 열을 분산시키기 위하여 사용될 수 있다. 일 실시예에 따르면, 도전성 부재는 구리(Cu(copper)), 알루미늄(Al(aluminum)), SUS(stainless steel) 또는 CLAD(예: SUS와 Al이 교번하여 배치된 적층 부재) 중 적어도 하나를 포함할 수 있다. 지지 시트는 플랙서블 디스플레이의 제 2 층을 적어도 일부 커버하여 제 2 층의 배면에 부착될 수 있 다. 지지 시트는 다양한 금속 물질 및/또는 비금속 물질(예: 폴리머)로 형성될 수 있다. 일 실시예에 따르 면, 지지 시트는 스테인리스 스틸(stainless steel)을 포함할 수 있다. 어떤 실시예에 따르면, 지지 시트 는 엔지니어링 플라스틱(engineering plastic)을 포함할 수 있다. 어떤 실시예에 따르면, 지지 시트 는 플랙서블 디스플레이와 일체로 구현될 수 있다. 일 실시예에 따르면, 지지 시트는, 플랙서블 디스 플레이가 휘어져 배치되는 부분(예: 도 3a 또는 4의 벤더블 구간(②도 2a 또는 3a의 제 1 곡면부(230b))과 적어도 일부 중첩된 격자 구조(lattice structure)(미도시)를 포함할 수 있다. 격자 구조는 복수의 오프닝들 (openings) 또는 복수의 슬릿들(slits)을 포함할 수 있고, 플랙서블 디스플레이의 굴곡성에 기여할 수 있 다. 다양한 실시예에 따르면, 지지 시트는, 격자 구조를 대체하여, 복수의 리세스들(recess)을 포함하는 리세스 패턴(미도시)을 포함할 수 있고, 리세스 패턴은 플랙서블 디스플레이의 굴곡성에 기여할 수 있다. 다양한 실시예에 따르면, 격자 구조 또는 리세스 패턴은 도 2a 또는 3a의 평면부(230a)의 적어도 일부로 확장될 수도 있다. 다양한 실시예에 따르면, 격자 구조 또는 리세스 패턴을 포함하는 지지 시트, 또는 이에 상응 하는 도전성 부재는 복수 개의 층으로 형성될 수도 있다. 일 실시예에 따르면, 멀티 바 구조는 슬라이딩 플레이트와 연결될 수 있고, 지지 시트와 대면하 는 제 1 면, 및 제 1 면과는 반대 편에 위치된 제 2 면을 포함할 수 있다. 슬라이딩 플레이트 의 이동 시 멀티 바 구조는 제 2 면과 마찰되어 회전하는 롤러에 의해 그 이동 및 방향이 안내될 수 있다. 일 실시예에 따르면, 제 2 면은, 풀리의 제 2 회전 축에서 제 1 회전 축(미도 시)으로 향하는 방향(예: +y 축 방향)으로 연장된 바(bar)(미도시)가 복수 개 배열된 형태를 포함할 수 있다. 멀티 바 구조는 복수의 바들 사이의 상대적으로 얇은 두께를 가지는 부분들에서 휘어질 수 있다. 다양한 실시예에서, 이러한 멀티 바 구조는 '가요성 트랙(flexible track)' 또는 '힌지 레일(hinge rail)'와 같 은 다른 용어로 지칭될 수도 있다. 일 실시예에 따르면, 도 2a의 닫힌 상태 또는 도 3a의 열린 상태에서, 멀티 바 구조의 적어도 일부는 화면 (도 2a 또는 3a 참조)과 중첩되게 위치되고, 플랙서블 디스플레이의 벤더블 구간(②이 들뜸 없이 플 랙서블 디스플레이의 제 1 구간(①과 매끄럽게 연결된 형태로 유지되도록 벤더블 구간(②을 지지할 수 있 다. 멀티 바 구조는, 도 2a의 닫힌 상태 및 도 3a의 열린 상태 사이의 전환에서 벤더블 구간(②이 들뜸 없 이 제 1 구간(①과 매끄럽게 연결된 형태를 유지하면서 이동 가능하게 기여할 수 있다. 일 실시예에 따르면, 지지 시트는 플랙서블 디스플레이를 통해 전자 장치의 내부에 위치된 요소 들(예: 멀티 바 구조)이 실질적으로 보이지 않게 할 수 있다. 화면이 확장된 상태(예: 도 3a의 열린 상태)에서 플랙서블 디스플레이 및/또는 지지 시트의 탄력으로 인한 들뜸으로 인해 매끄럽지 않은 화면이 제공될 수 있다. 다양한 실시예에 따르면, 이를 방지하기 위하여 플 랙서블 디스플레이 및/또는 지지 시트에 대한 장력 구조(미도시)가 마련될 수 있다. 장력 구조는 장 력의 유지하면서 원활한 슬라이드 동작에 기여할 수 있다. 일 실시예에 따르면, 인쇄 회로 기판에는, 프로세서(예: 도 1의 프로세서), 메모리(예: 도 1의 메모 리), 및/또는 인터페이스(예: 도 1의 인터페이스)가 장착될 수 있다. 프로세서는, 예를 들어, 중앙처 리장치, 어플리케이션 프로세서, 그래픽 처리 장치, 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니 케이션 프로세서 중 하나 또는 그 이상을 포함할 수 있다. 메모리는, 예를 들어, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 및/또는 오디오 인터페이스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치를 외부 전자 장치와 전 기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 전자 장치는 인쇄 회로 기판에 배치되거나 인쇄 회로 기판과 전기적으로 연결된 이 밖의 다양한 요소들을 포함할 수 있다. 예를 들어, 전자 장치는 제 1 지지 부재 및 제 2 지지 부재 사이, 또 는 제 2 지지 부재 및 백 커버 사이에 위치된 배터리(미도시)를 포함할 수 있다. 배터리(미도시)는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충전 불가능한 1차 전지, 또는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 배터리(미도시)는 전자 장치 내부 에 일체로 배치될 수 있거나, 전자 장치로부터 탈부착 가능하게 배치될 수도 있다. 일 실시예에 따르면, 전자 장치는, 제 1 지지 부재 및 제 2 지지 부재 사이, 또는 제 2 지지 부재 및 백 커버 사이에 위치된 안테나(미도시)를 포함할 수 있다. 안테나(미도시)는, 예를 들어, NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 안테나(미도시)는, 예를 들어, 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수 신 할 수 있다. 다른 실시예에서는, 제 1 사이드 커버 및/또는 제 2 사이드 커버의 일부 또는 그 조 합에 의하여 안테나 구조가 형성될 수 있다. 일 실시예에 따르면, 전자 장치는 플랙서블 디스플레이 및 인쇄 회로 기판을 전기적으로 연결하 는 연성 인쇄 회로 기판(FPCB(flexible printed circuit board))을 포함할 수 있다. 예를 들어, 연성 인 쇄 회로 기판은 슬라이딩 플레이트에 형성된 오프닝(미도시) 및 제 1 지지 부재에 형성된 오프 닝(미도시)을 통해 인쇄 회로 기판과 전기적으로 연결될 수 있다. 도 5는 다양한 실시예에 따른 전자 장치의 블록 구성도이다. 도 5를 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치는 디스플레이, 프로세서 (예: 도 1의 프로세서), 구동 장치, 센서 및 메모리를 포함할 수 있다. 전자 장치는 도 1의 전자 장치의 구성 및/또는 기능 중 적어도 일부를 더 포함할 수 있으며, 도 1과 중복되는 구성 요 소를 포함할 수 있다. 도 5의 전자 장치는 슬라이딩 방식 또는 롤러 방식으로 시각적 정보가 표시될 활성화 영역(또는 표시 영역)이 가변되도록 구현된 플렉시블 전자 장치(예: 도 2a, 2b, 3a, 3b 및 도 4의 전자 장치)일 수 있다. 일 실시예에 따르면, 전자 장치는 가상 현실, 증강 현실 또는 혼합 현실에 아바타를 적용하는 기능, 이미 지 내의 공간 요소를 분석하는 기능, 아바타 활동 반경을 의미하는 가상의 3D(3 dimensional) 공간을 도출하는 기능, 3D 공간에 맞는 아바타 컨텐츠 서비스를 제공하는 기능 중 적어도 하나를 지원할 수 있다. 상기 기능들은 아바타 어플리케이션, 가상 현실 어플리케이션, 증강 현실 어플리케이션 또는 혼합 현실 어플리케이션을 통해 제공될 수 있다. 또는, 상기 기능들은 카메라 어플리케이션이 제공하는 기능들 중 하나(예: 앱인앱(app in app))로서 제공될 수 있다. 디스플레이는 외부로 노출되는 제1 표시 영역(A1)과 전자 장치 상태에 따라 내부로 인입되거나 외부 로 인출되는 제2 표시 영역(A2)을 포함할 수 있다. 앞서 설명한 바와 같이, 디스플레이는 전자 장치의 상태에 기반하여, 디스플레이에서 시각적 정 보(예: 실행 화면)가 표시될 활성화 영역이 결정될 수 있다. 예를 들어, 전자 장치가 제2 표시 영역(A2)이 내부로 인입되는 제1 상태(예: 닫힌 상태)인 경우, 활성화 영역은 제1 표시 영역(A1)으로 결정되고 제1 표시 영 역(A1)에 시각적 정보가 표시될 수 있다. 다른 예를 들어, 전자 장치가 제2 표시 영역(A2)이 외부로 인출 되는 제2 상태(에: 오픈 상태)인 경우, 활성화 영역은 디스플레이의 전체 영역(예: 제1 표시 영역(A1) 및 제2 표시 영역(A1))으로 결정되고, 전체 영역에 시각적 정보가 표시될 수 있다. 어떤 실시예에 따르면, 디스플레이는 사용자 입력 또는 입력 누적 횟수에 따라 전자 장치 외부로 노 출되는 제2 표시 영역(A2)의 면적이 가변 될 수 있다. 예를 들어, 디스플레이는 제2 표시 영역(A2)이 단계 적으로 노출되도록 구현될 수도 있다. 구동 장치는 디스플레이의 적어도 일부가 전자 장치의 하우징 내부 공간으로 인입되거나 인출되 도록 제어하는 구성일 수 있다. 예를 들어, 구동 장치는 회동 조립체, 슬라이딩 모터로 구현될 수 있으나, 이에 한정하는 것은 아니다. 어떤 실시예에 따르면, 전자 장치는 외력(예: 전자 장치를 가압하는 스퀴즈 제스처(squeeze gesture))에 의해 구동 장치를 제어할 수 있다. 전자 장치는 구동 장치의 탄력 구조로 인해 더 이상의 외력 없이도 닫힌 상태에서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환(예: 반자동 슬라이드 동 작)될 수 있다. 어떤 실시예에 따르면 전자 장치는 입력 장치(예: 하드웨어 버튼 또는 화면을 통해 제공되는 소프트웨어 버튼)을 통해 발생된 신호가 발생되면, 구동 장치가 동작하여 닫힌 상태에서 열린 상태로, 또는 열린 상태 에서 닫힌 상태로 전환될 수 있다. 센서는 전자 장치의 상태(예: 제1 상태, 제2 상태)를 인식하기 위해 사용되는 데이터를 생성할 수 있 다. 센서는 구동 장치에 부착되어 구동 장치의 회전 각도에 대응하는 데이터를 생성하여 출력하 는 센서(예: 인코더(encoder), 홀(hall) 센서))를 포함할 수 있다. 다른 예를 들어, 센서는 디스플레이 의 지정된 부분(예: 제2 표시 영역(A2)의 일부)에 배치되어 벤더블 구간(②의 곡률에 대응하는 데이터를 생성하는 센서를 포함할 수도 있다. 메모리는 아바타 서비스와 관련된 데이터를 저장할 수 있다. 메모리는 활성화 영역으로 설정된 디스 플레이의 일부((예: 제1 표시 영역(A1))를 통해 제1 아바타 컨텐츠를 제공하고, 전자 장치가 디스플 레이의 일부로부터 연장된 다른 일부(예: 제2 표시 영역(A2))로 확장된 것에 기반하여 제1 아바타 컨텐츠 를 제2 아바타 컨텐츠로 전환하여 제공하는 기능을 프로세서가 수행하도록 하는 인스트럭션들 (instructions)을 저장할 수 있다. 프로세서는 디스플레이, 구동 장치, 센서 및 메모리와 작동적으로 연결될 수 있다. 프로세서는, 센서 또는 구동 장치로부터 수신된 데이터에 기반하여 전자 장치의 상태 변화 를 인식하고, 실시간으로 반응하여 활성화 영역을 결정할 수 있다. 실시간 반응의 일 예로서, 프로세서는, 활성화 영역의 면적을 트래킹(tracking)할 수 있다. 프로세서는 제2 표시 영역(A2)이 외부로 노출되는 부 분을 인식하고, 활성화 영역을 제1 표시 영역(A1)에서 제2 표시 영역(A2)의 노출 부분까지 확장할 수 있다. 일 실시예에 따르면, 프로세서는, 이미지 관리 모듈, 공간 분석 모듈 및 아바타 컨텐츠 관리 모 듈을 포함할 수 있다. 상기 모듈들은 프로세서(예: 어플리케이션 프로세서 또는 이미지 처리 프로세 서)의 하드웨어 모듈로 구성될 수 있다. 상기 모듈들(521,523,525) 중에서 적어도 하나는 프로세서와 다른 별도 의 하드웨어로서 전자 장치에 구성될 수도 있다. 또는, 상기 모듈들(521,523,525)은 소프트웨어(예: 프로그램 )로 구현될 수도 있으며, 프로세서는 상기 소프트웨어에서 구현된 인스트럭션들을 기반으로 동작들을 실행할 수 있다. 이미지 관리 모듈은 아바타(예: AR(augmented reality) 아바타)와 관련된 가상 현실, 증강 현실 또는 혼합 현실의 배경 이미지(또는 배경 영상)를 획득하고, 디스플레이, 구동 장치 또는 센서로부터 활성 화 영역 정보를 획득하고, 활성화 영역의 면적을 트래킹할 수 있다. 이미지 관리 모듈은 전자 장치의 상태 변화에 따라 변화되는 활성화 영역에 실시간으로 반응하여 배 경 이미지 내에서 현재 디스플레이의 활성화 영역의 면적에 맞는 잘라내기(cutoff, cropping) 영역(또는 뷰(view) 영역)을 결정할 수 있다. 배경 이미지는 가상 현실 공간 이미지(예: 360도 가상 현실 공간) 또는 카메 라로부터 획득되는 현실 이미지(real image) 일 수 있으나, 이에 한정되는 것은 아니다. 공간 분석 모듈은 잘라내기 영역 내의 공간 요소(예: 바닥, 벽, 천장, 물체)를 인식하고, 각 공간 요소의 파라미터(예: 크기, 면적, 높이, 거리)를 분석할 수 있다. 공간 분석 모듈은 잘라내기 영역의 공간 요소를 기반으로 배경 이미지의 일부(예: 잘라내기 영역)에서 아바타를 위치시킬 가상의 3D 공간(예: 아바타 활동 영역)을 도출할 수 있다. 예를 들어, 공간 분석 모듈은 잘라내기 영역 내에 바닥면적을 기반으로 가상의 3D 공간을 위한 x, y, z축 값을 결정할 수 있다. 아바타 컨텐츠 관리 모듈은 3D 공간의 크기를 기반으로3D 공간 내에서 표현이 가능한 아바타 컨텐츠들을 선별하야 아바타 서비스 사용자 인터페이스(UI; user interface)를 구성하여 디스플레이에 제공할 수 있다. 아바타 컨텐츠 관리 모듈은 아바타와 관련된 기능을 지원하기 위한 UI 환경을 전자 장치의 상 태에 따라 결정된 디스플레이의 활성화 영역에 제공할 수 있다. 아바타 컨텐츠 관리 모듈은 아바타(예: 디폴트 아바타 또는 사용자에 의해 지정된 아타바)의 특성 정보(예: 아바타 다리, 팔, 바디 및 얼굴의 사이즈, 아바타 모션, 아바타 애니메이션 활동, 아바타 자세)를 기 반으로 가상의 3D 공간 내에 아바타를 위치시키고, 가상의 3D 공간 내에서 표현 가능한 아바타 컨텐츠들을 선별 할 수 있다. 예를 들어, 아바타 컨텐츠 관리 모듈은 가상의 3D 공간의 특정 위치(예: 중심)에 아바타를 배 치시키고, 아바타 모션, 자세 또는 애니메이션 활동 중 아바타의 다리와 팔이 가상의 3D 공간 외부로 벗어나지 않는 아바타 컨텐츠들로 선별할 수 있다. 아바타 컨텐츠 관리 모듈은 전자 장치의 상태 변화에 따라 변화되는 활성화 영역에 실시간으로 반응 하여 가상의 3D 공간을 변경하고, 이에 대응하여 실시간으로 아바타 컨텐츠들을 선별하고, 선별된 아바타 컨텐 츠들로 아바타 서비스 UI를 구성하여 디스플레이에 제공할 수 있다. 아바타 컨텐츠 관리 모듈은 전자 장치의 상태 변화에 따라 확장된는 활성화 영역에 실시간으로 반응 하여 확장된 활성화 영역에 맞는 확장 서비스 기능(예: 메인 아바타 추가 표시 기능, 아바타 인터렉션 기능, 복 제 기능)을 제공할 수 있다. 다양한 실시예에 따르면 플렉서블 전자 장치(예: 도 1의 전자 장치, 도 5의 ㅈ아전자 장치)는, 제1 하우징, 상기 제1 하우징에 대하여 제1 방향 또는 제2 방향으로 이동이 가능하도록 배치되는 제2 하우징, 상기 제2 하우징을 상기 제1 하우징에 대하여 이동시키도록 구동되는 구동 장치(예: 도 5의 구동 장치), 상기 제2 하우징이 상기 제1 하우징에 대해 제1 방향으로 이동 시 제1 표시 영역을 가지며, 상기 구동 장치에 의해 상기 제2 하우징이 상기 제1 하우징으로부터 제2 방향으로 이동 시 상기 제1 표시 영역 및 제2 표시 영역으로 확장되는 디스플레이(예: 도 1의 디스플레이 모듈, 도 5의 디스플레이) 및 상기 디스플레이 및 상기 구동 장치와 작동적으로 연결되는 프로세서(예: 도 1의 프로세서), 도 5의 프로세서)를 포함하고, 상 기 프로세서는, 아바타 서비스 실행 시에, 상기 디스플레이에서 시각적 정보가 표시될 활성화 영역이 상기 제1 표시 영역인 경우, 상기 제1 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 아바타를 표현할 가 상의 제1 공간을 도출하고, 아바타의 특성 정보를 기반으로 상기 제1 공간 내에서 표현 가능한 제1 자세의 아바 타를 제공하고, 상기 디스플레이의 활성화 영역이 제1 표시 영역에서 제2 표시 영역의 적어도 일부까지 확장된 것에 기반하여, 상기 제1 및 제2 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 가상의 제2 공간 을 도출하고, 상기 아바타의 특성 정보를 기반으로 상기 제2 공간 내에서 표현 가능한 제2 자세의 아바타 및 확 장 서비스 기능 중 적어도 하나를 제공하도록 설정될 수 있다. 다양한 실시예에 따르면 플렉서블 전자 장치(예: 도 1의 전자 장치, 도 5의 ㅈ아전자 장치)는, 제1 하우징, 상기 제1 하우징에 대하여 제1 방향 또는 제2 방향으로 이동이 가능하도록 배치되는 제2 하우징, 상기 제2 하우징을 상기 제1 하우징에 대하여 이동시키도록 구동되는 구동 장치(예: 도 5의 구동 장치), 상기 제2 하우징이 상기 제1 하우징에 대해 제1 방향으로 이동 시 제1 표시 영역을 가지며, 상기 구동 장치에 의해 상기 제2 하우징이 상기 제1 하우징으로부터 제2 방향으로 이동 시 상기 제1 표시 영역 및 제2 표시 영역으로 확장되는 디스플레이(예: 도 1의 디스플레이 모듈, 도 5의 디스플레이) 및 상기 디스플레이 및 상기 구동 장치와 작동적으로 연결되는 프로세서(예: 도 1의 프로세서), 도 5의 프로세서)를 포함하고, 상 기 프로세서(120,520)는, 아바타 서비스 실행 시에 표시될 배경 이미지를 획득하고, 전자 장치의 상태에 기반하 여 상기 디스플레이에서 시각적 정보가 표시될 활성화 영역의 면적을 트래킹하고, 상기 활성화 영역의 면적에 대응하여 상기 획득된 배경 이미지에서 잘라내기 영역을 결정하고, 상기 결정된 잘라내기 영역 내에 포함된 공 간 요소를 분석하여 아바타를 표현할 가상의 공간 범위를 도출하고, 상기 아바타의 특성 정보를 기반으로 상기 공간 범위 내에서 표현 가능한 아바타 컨텐츠들을 선별하여 아바타 서비스 UI를 생성하고, 상기 생성된 아바타 서비스 UI를 상기 잘리 내기 영역에 배경 이미지에 제공하도록 설정될 수 있다. 다양한 실시예에 따르면 상기 프로세서(120,520)는, 배경 이미지를 획득하고, 상기 제 1 공간은, 상기 배경 이 미지에서 제1 표시 영역에 대응하는 크기로 제1 잘라내기 영역을 결정하고, 상기 제1 잘라내기 영역 내의 공간 요소를 분석하여 도출하고, 상기 제2 공간은 상기 배경 이미지에서 제1 표시 영역 및 제2 표시 영역에 대응하는 크기로 제2 잘라내기 영역을 결정하고, 상기 제2 잘라내기 영역 내의 공간 요소를 분석하여 도출하도록 더 설정 될 수 있다. 다양한 실시예에 따르면 상기 배경 이미지는 카메라를 통해 획득한 현실 이미지 또는 랜더링된 가상 현실 공간 이미지를 포함할 수 있다. 다양한 실시예에 따르면 상기 공간 요소는 바닥, 벽, 천장, 물체 중 적어도 하나를 포함하고, 상기 프로세서는 상기 공간 요소의 크리, 면적, 높이, 거리 중 적어도 하나를 분석하여 배경 이미지에서 상기 아바타가 위치할 바닥 면적을 계산하고, 상기 바닥 면적을 기준으로 제1 공간 또는 제2 공간의 x축, y축 및 z축 값을 결정하도록설정될 수 있다. 다양한 실시예에 따르면 상기 아바타 특성 정보는, 아바타 다리, 팔, 바디 및 얼굴의 사이즈, 아바타 모션, 아 바타 애니메이션 활동 또는 아바타 자세 중 적어도 하나에 대한 정보를 포함할 수 있다. 다양한 실시예에 따르면 상기 프로세서(120,520)는, 상기 활성화 영역이 제1 표시 영역인 것에 기반하여, 상기 제1 공간 내에서 표현 가능한 아바타 컨텐츠들을 선별하여 제1 아바타 서비스 사용자 인터페이스를 구성하고, 상기 제1 아바타 서비스 사용자 인터페이스에 상기 제1 자세의 아바타를 제공하고, 상기 활성화 영역이 상기 제 1 표시 영역에서 상기 제2 표시 영역의 적어도 일부까지 확장된 것에 기반하여, 상기 제2 공간 내에서 표현 가 능한 아바타 컨텐츠들을 선별하여 제2 아바타 서비스 사용자 인터페이스를 구성하고, 상기 제2 아바타 서비스 사용자 인터페이스에 상기 제2 자세의 아바타를 제공하도록 더 설정될 수 있다. 다양한 실시예에 따르면 상기 프로세서(120,520)는 상기 제2 아바타 서비스 사용자 인터페이스는 확장된 활성화 영역에 대응하는 확장 서비스 기능을 추가로 제공하도록 더 설정될 수 있다. 다양한 실시예에 따르면 상기 확장 서비스 기능은 메인 아바타 이외에 다른 아바타를 추가로 표시할 수 있는 다 른 아바타 표시 기능, 메인 아타바의 복제 클론을 제공할 수 있는 클론 기능, 아바타와 상호 인터렉션을 통해 추가 기능을 실행할 수 있는 아바타 인터렉션 기능 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면 상기 제1 아바타 서비스 사용자 인터페이스는, 상기 제1 공간 내에서 표현 가능한 모션 항목들을 포함하고, 상기 제2 아바타 서비스 사용자 인터페이스는 제2 공간 내에서 표현 가능한 모션 항목들을 포함하고, 상기 프로세서(120,520)는, 상기 제1 아바타 서비스 사용자 인터페이스에서 상기 제1 공간 내에서 표 현 불가능한 모션 항목들이 포함되는 경우, 상기 제1 공간 내에서 표현 가능한 모션 항목들과 상기 표현 불가능 한 모션 항목들을 시각적으로 다르게 처리하도록 더 설정될 수 있다. 다양한 실시예에 따르면 상기 프로세서(120,520)는 상기 제1 아바타 서비스 사용자 인터페이스에서 상기 제1 공 간 내에서 표현 불가능한 모션 항목들이 포함되는 경우, 모션 항목들 중 일부가 표현 불가능하다는 것을 안내하 는 정보 또는 상기 디스플레이를 제1 표시 영역에서 제2 표시 영역의 적어도 일부까지 확장하도록 안내하는 정 보를 제공하도록 더 설정될 수 있다. 도 6은 다양한 실시예에 따른 플랙서블 전자 장치의 아바타 운용 방법을 도시한다. 도 6을 참조하면, 일 실시예에 따른 전자 장치의 프로세서(예: 도 1의 프로세서, 도 5의 프로세서 )는, 610 동작에서, 전자 장치에 설치된 아바타와 관련된 서비스 실행 요청을 감지할 수 있다. 예를 들어, 사용자가 아바타 어플리케이션(예: 아바타 애니메이션 앱, 증강 현실 앱, 가상 현실 앱)을 터치하면, 아바타와 관련된 어플리케이션의 실행 프로세스가 시작될 수 있다. 아바타 애니메이션 앱은 아바타 캐릭터, 이모지/애니메이션 스티커, 아바타와 관련된 기능을 지원하는 어플리케이션으로 이해될 수 있다. 615 동작에서, 프로세서는 아바타 앱 화면에 표시될 배경 이미지를 획득할 수 있다. 예를 들어, 배경이미지는 컨텐츠 타입에 대응하는 이미지일 수 있으며, 카메라를 이용한 현실 이미지, 서버 또 는 전자 장치로부터 렌더링된 가상 현실 배경 이미지일 수 있다. 일 실시예에 따르면, 증강 현실 서비스인 경우, 프로세서는 카메라를 활성화하고, 카메라로부터 획득한 프리뷰 영상을 배경 이미지로서 획득할 수 있다. 다른 실시예에 따르면, 가상 현실 서비스인 경우, 프로세서는 가상 현실 공간 컨텐츠를 랜더링하고 랜더링 가상 현실 공간 이미지를 배경 이미지로서 획득할 수 있다. 620동작에서, 프로세서는 전자 장치 상태에 기반하여 디스플레이의 활성화 영역의 면적을 트래킹할 수 있 다. 앞서 도 2를 참조하여 설명된 바와 같이, 디스플레이에 있어서 시각적 정보가 표시될 활성화 영역은, 전자 장치의 상태에 따라, 제1표시 영역(A1), 제1표시 영역(A1)과 제2표시 영역(A2)의 일부, 또는 디스플레이의 전체 영역(예: 제1표시 영역(A1) 및 제2표시 영역(A2))으로 결정될 수 있다. 프로세서는 디스플레이, 구동 장치 또는 센서로부터 수시된 데이터를 이용하여 전자 장치의 상태를 인식할 수 있고, 전자 장치의 상태에 기반하여 결정된 활성화 영역의 면적을 트래킹할 수 있다. 예를 들어, 프로 세서는 제1 표시 영역(A1)의 면적과, 디스플레이에서 제2 표시 영역(A2)이 확장된 정도에 따라 제1 표시 영역 및 제2 표시 영역을 포함하는 면적을 트래킹할 수 있다. 630 동작에서, 프로세서는 트래킹된 활성화 영역의 면적에 대응하여 배경 이미지의 잘라내기 영역(또는 CROP 영역)을 결정할 수 있다. 잘라내기 영역은 배경 이미지의 일부일 수 있다. 잘라내기 영역은 전체 배경 이 미지에서 시각적 정보가 표시될 활성활 영역의 크기에 대응하는 뷰 영역일 수 있다. 640 동작에서, 프로세서는 잘라내기 영역 내의 공간 요소를 분석하여 아바타를 표현할 가상의 3D 공간을 도출할 수 있다. 가상의 3D 공간은 아바타를 디스플레이에 위치 또는 배치시키기 위한 임의의 공간으로, 시각적 요소로 디스플레이에 표현되지 않을 수 있으나, 이에 한정하지 않으며, 사용자 요청에 따라 시각적 요소로 표현 될 수 도 있다. 일 실시예에 따르면, 프로세서는 잘라내기 영역 내의 공간 요소(예: 바닥, 벽, 천장, 물체)를 인식하고, 각 공간 요소의 파라미터 값(예: 크기, 면적, 높이, 거리)을 분석할 수 있다. 예를 들어, 프로세서는 잘라 내기 영역 내에 바닥면의 면적을 기반으로 가상의 3D 공간을 위한 x, y, z축 값을 결정할 수 있다. 650 동작에서, 프로세서는 아바타 특성 정보를 기반으로 3D 공간 내에서 표현 가능한 아바타 컨텐츠를 선 별할 수 있다. 일 실시예에 따르면, 프로세서는 디폴트 아바타 또는 사용자에 의해 지정된 아타바의 특성 정보(예: 아바 타 다리, 팔, 바디 및 얼굴의 사이즈, 아바타 모션, 아바타 애니메이션 활동, 아바타 자세)를 기반으로, 잘라내 기 영역의 가상의 3D 공간 내에 아바타를 위치시키고, 도출된 가상의 3D 공간 내에서 표현 가능한 아바타 컨텐 츠들을 선별할 수 있다. 아바타 컨텐츠들은 아타바의 모션, 동작, 애니메이션 행동, 또는 기능 중 적어도 하나 를 포함할 수 있다. 660 동작에서, 프로세서는 선별된 아바타 컨텐츠들을 기반으로 현재 디스플레이 크기에 대응하는 아바타 서비스 UI를 생성하고 디스플레이의 활성화 영역에 생성된 아바타 서비스 UI를 표시할 수 있다. 일 실시예에 따르면, 프로세서는 잘리 내기 영역의 배경 이미지가 디스플레이에 표시되고, 잘라 내기 영역 에서 도출된 가상의 3D 공간에 따라 선별된 제1 자세의 아바타 컨텐츠가 표시될 수 있다. 일 실시예에 따르면, 프로세서는 가상의 3D 공간에 따라 선별된 아바타 컨텐츠들 중 랜덤하게 또는 우선 순위로 지정된 컨텐츠가 표시될 수 있다. 도 7은 일 실시예에 따른 플랙서블 전자 장치에서 아바타 운용 방법을 나타낸다. 도 7을 참조하면, 일 실시예에 따른 전자 장치의 프로세서(예: 도 1의 프로세서, 도 5의 프로세서 )는, 710 동작에서, 전자 장치에 설치된 아바타와 관련된 서비스 실행 요청을 감지할 수 있다. 715 동작에서, 프로세서는 아바타 앱 화면에 표시될 배경 이미지를 획득할 수 있다. 예를 들어, 배경 이미 지는 컨텐츠 타입에 대응하는 이미지일 수 있으며, 카메라를 이용한 현실 이미지, 서버 또는 전자 장치로부터 렌더링된 가상 현실 배경 이미지일 수 있다. 720 동작에서, 프로세서는 전자 장치 상태에 기반하여 디스플레이의 활성화 영역의 면적을 트래킹할 수 있 다. 프로세서는 디스플레이, 구동 장치 또는 센서로부터 수신된 데이터를 이용하여 전자 장치의 상태를 인식할 수 있고, 전자 장치의 상태에 기반하여 결정된 활성화 영역의 면적을 트래킹할 수 있다. 730 동작에서, 프로세서는 트래킹된 활성화 영역(예: 제1 활성화 영역)의 면적에 대응하는 배경 이미지에 서 공간 요소를 분석하여 가상의 제1 3D 공간을 도출할 수 있다. 가상의 3D 공간은 아바타를 디스플레이에 위치 또는 배치시키기 위한 임의의 공간으로, 시각적 요소로 디스플레이에 표현되지 않을 수 있으나, 이에 한정하지 않으며, 사용자 요청에 따라 시각적 요소로 표현될 수 도 있다. 프로세서는 공간 요소(예: 바닥, 벽, 천장, 물체)를 인식하고, 각 공간 요소의 파라미터 값(예: 크기, 면 적, 높이, 거리)을 분석할 수 있다. 예를 들어, 프로세서는 잘라내기 영역 내에 바닥면의 면적을 기반으로 가상의 3D 공간을 위한 x, y, z축 값을 결정할 수 있다. 일 실시예에 따르면, 프로세서는 실시간으로 반응하여 제1 활성화 영역의 크기에 맞는 배경 이미지를 디스 플레이에 제공할 수 있다. 프로세서는 제1 활성화 영역의 크기에 맞는 배경 이미지를 획득하거나 랜더링하 여 디스플레이에 제공할 수 있다. 다른 실시예에 따르면, 프로세서는 획득된 배경 이미지를 기반으로 트래킹된 제1 활성화 영역의 면적에 맞 는 잘라내기 영역을 결정하고 잘라내기 영역 내의 공간 요소를 분석하여 가상의 제1 3D 공간을 도출할 수 있다. 735 동작에서, 프로세서는 아바타 특성 정보를 기반으로 제1 3D 공간 내에서 표현될 아바타 컨텐츠를 선별 하여 제1 활성화 영역에 대응하는 제1 아바타 서비스 UI를 제공할 수 있다. 제1 아바타 서비스 UI는 제1 3D 공 간 내에서 표현되는 제1 자세의 아바타를 포함할 수 있다. 프로세서는 디폴트 아바타 또는 사용자에 의해 지정된 아타바의 특성 정보(예: 아바타 다리, 팔, 바디 및 얼굴의 사이즈, 아바타 모션, 아바타 애니메이션 활동, 아바타 자세)를 기반으로, 제1 3D 공간 내에 아바타를 위치시키고, 제1 3D 공간 내에서 표현 가능한 아바타 컨텐츠들을 선별할 수 있다. 아바타 컨텐츠들은 아타바의 모션, 동작, 애니메이션 행동, 또는 기능 중 적어도 하나를 포함할 수 있다. 프로세서는 선별된 아바타 컨 텐츠들을 기반으로 아바타 서비스 UI를 생성할 수 있다. 740 동작에서, 프로세서는 활성화 영역의 면적 변화를 감지할 수 있다. 750 동작에서, 프로세서는 활성화 영역의 변화에 기반하여 변경된 제2 활성화 영역의 면적을 트래킹할 수 있다. 일 실시예에 따르면, 프로세서는 전자 장치가 제1 상태에서 제2 상태로 변화하는 것에 실시간으로 반 응하여 활성화 영역을 결정하고 활성화 영역의 면적을 실시간으로 트래킹할 수 있다. 프로세서는 전자 장 치가 닫힌 상태에서 열린 상태 또는 열린 상태에서 닫힌 상태로 변경되는 것을 감지하고, 확장 정도 또는 축소 정도에 반응하여 활성화 영역을 결정할 수 있다. 760 동작에서, 프로세서는 변경된 제2 활성화 영역의 면적에 대응하는 배경 이미지에서 공간 요소를 분석 하여 가상의 제2 3D 공간을 도출할 수 있다. 프로세서는 공간 요소(예: 바닥, 벽, 천장, 물체)를 인식하고, 각 공간 요소의 파라미터 값(예: 크기, 면 적, 높이, 거리)을 분석할 수 있다. 예를 들어, 프로세서는 잘라내기 영역 내에 바닥면의 면적을 기반으로 가상의 3D 공간을 위한 x, y, z축 값을 결정할 수 있다. 일 실시예에 따르면, 프로세서는 실시간으로 반응하여 변경된 제2 활성화 영역의 크기 맞는 배경 이미지를 디스플레이에 제공할 수 있다. 프로세서는 제2 활성화 영역의 크기에 맞는 배경 이미지를 획득하거나 랜더 링하여 디스플레이에 제공할 수 있다. 다른 실시예에 따르면, 프로세서는 변경된 제2 활성화 영역의 면적에 맞는 잘라내기 영역을 결정하고 잘라 내기 영역 내의 공간 요소를 분석하여 가상의 제2 3D 공간을 도출할 수 있다. 765 동작에서, 프로세서는 아바타 특성 정보를 기반으로 제2 3D 공간 내에서 표현될 아바타 컨텐츠 및 확 장 서비스 기능을 선별하여 제2 활성화 영역에 대응하는 제2 아바타 서비스 UI를 생성할 수 있다. 제2 아바타 서비스 UI는 제2 3D 공간 내에서 표현되는 제2 자세의 아바타를 포함할 수 있다. 프로세서는 실시간으로 반응하여 디폴트 아바타 또는 사용자에 의해 지정된 아타바의 특성 정보(예: 아바 타 다리, 팔, 바디 및 얼굴의 사이즈, 아바타 모션, 아바타 애니메이션 활동, 아바타 자세)를 기반으로 제2 3D 공간 내에 아바타를 위치시키고, 제2 3D 공간 내에서 표현 가능한 아바타 컨텐츠들을 선별할 수 있다. 프로세서 는 제1 활성화 영역에서 제2 활성화 영역에 변화한 것에 기반하여, 제2 활성화 영역에 맞는 확장 서비스 기능을 제공할 수 있다. 확장 서비스 기능은, 메인 아바타 이외에 다른 아바타를 추가로 표시할 수 있는 다른 아바타 표시 기능, 아타바의 복제 클론을 제공할 수 있는 클론 기능, 아바타와 상호 인터랙션을 통해 추가 기능 을 실행할 수 있는 아바타 인터랙션 기능 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 770 동작에서, 프로세서는 전자 장치가 제1 상태에서 제2 상태에 변경된 것에 반응하여, 제1 아바타 서비스 UI를 제2 아바타 서비스 UI로 변환하여 디스플레이에 출력할 수 있다. 도 8은 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 8을 참조하면, 일 실시에에 따른 전자 장치는 전자 장치의 상태(예: 제1 상태 또는 제2 상태)에 기반하여 시각적 정보가 표시될 활성화 영역을 가변하고, 활성화 영역의 크기에 맞춰 아바타 서비스를 가변적으 로 제공할 수 있다. 일 실시예에 따르면, 프로세서(예: 도 1의 프로세서, 도 5의 프로세서)는, 전자 장치가 닫힌 상 태(예: 제1 상태)인 것에 기반하여 <8001>에 도시된 바와 같이, 디스플레이의 제1 표시 영역(A1)을 활성화영역으로 결정하고, 제1 자세의 아바타를 제1 표시 영역(Al)의 디스플레이를 통해 제공할 수 있다. 예를 들어, 전자 장치의 프로세서는 제1 표시 영역(A1)의 크기에 대응하는 배경 이미지(예: 가상 이미지 또는 카메라 프리뷰 이미지의 일부)로부터 가상의 제1 3D 공간을 도출하고, 제1 3D 공간을 벗어 나지 않으면서 표현 가능한 제1 자세의 아바타를 제공할 수 있다. 제1 자세의 아바타는 제1 3D 공간의 활동 범위 내에서 표현 가능한 자세로 표현되어 있으나, 이에 한정하 지 않는다. 예를 들어, 제1 자세는 활성화 영역(제1 표시 영역(A1)) 외부로 아바타의 다리와 팔이 벗어나지 않 는 자세일 수 있다. 전자 장치의 상태가 닫힌 상태(예: 제1상태)에서 열린 상태(예: 제2상태)로 전환된 것에 기반하여, 활성화 영역은 제1 표시 영역(A1)에서 디스플레이의 전체 영역(제1 표시 영역(A1) 및 제2 표시 영역(A2))으로 확 장될 수 있다. 전자 장치의 프로세서는 제1 표시 영역(A1) 및 제2 표시 영역(A2)을 활성화 영역으로 결정된 것에 반응하 여 제1 표시 영역(A1) 및 제2 표시 영역(A2)에서 표현 가능한 제2 자세의 아바타로 변경하여 제1 표시 영 역(A1) 및 제2 표시 영역(A2)의 디스플레이를 통해 제공할 수 있다. 예를 들어, 전자 장치의 프로세서는 변경하여 제1 표시 영역(A1) 및 제2 표시 영역(A2)의 크기에 대응하는 배경 이미지(예: 가상 이미지 또는 카메라 프리뷰 이미지의 일부)로부터 가상의 제2 3D 공간을 도출 하고, 제2 3D 공간을 벗어나지 않으면서 표현 가능한 제2 자세의 아바타로 전환하여 제공할 수 있다. 도 9는 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 9를 참조하면, 일 실시에에 따른 전자 장치의 프로세서(예: 도 1의 프로세서, 도 5의 프로세서 는 가상 현실 서비스를 지원할 수 있다. 전자 장치의 프로세서는 가상 현실 서비스 실행 시 <9001>에 도시된 바와 같이 가상 현실 컨텐츠를 랜더링할 수 있다. 예를 들어, 가상 현실 컨텐츠는 360도 영상으로 구현될 수 있다. 예를 들어, 366도 영 상은 360도 파노라마 촬영 기법 또는 스티칭(stitching) 편집 기법을 통해 제작될 수 있으나, 이에 한정하는 것 은 아니다. 전자 장치가 닫힌 상태일 경우, 프로세서는 <9001>에 도시된 가상 현실 컨텐츠 공간을 제1 활성화 영역 에 대응하는 섹션뷰(section view)로 잘라내기할 수 있다. 프로세서는 <9002>에 도시된 바와 같이, 섹션뷰(section view)로 잘라진 제1 조각 이미지 내에서 아바타를 표현할 3차원의 제1 가상 공간을 도출할 수 있다. 제1 가상 공간은 제1 x,y, z 축 값을 가질 수 있다. 프로세서는 제1 조각 이미지의 제1가상 공간 범위 내에서 표현되는 아바타 컨텐츠를 선별하여 <900 3>에 도시된 바와 같이, 제1 자세의 아바타를 표시할 수 있다. 프로세서는 전자 장치가 닫힌 상태에서 열린 상태에 변화된 것에 기반하여, 활성화 영역이 제1 활성화 영 역에서 제2 활성화 영역으로 변경된 것을 감지할 수 있다. <9004>에 도시된 바와 같이, 가상 현실 컨텐츠 공간을 제2 활성화 영역에 대응하는 크기로 잘라내고, 잘라진 제2 조각 이미지 내에서 아바타를 표현할 3차원의 제2 가상 공간을 도출할 수 있다. 제2 가 상 공간은x', y', z' 축 값을 가질 수 있다. 프로세서는 제2 조각 이미지의 제2가상 공간의 범 위 내에서 표현되는 아바타 컨텐츠를 선별하여 제2 자세의 아바타를 표시할 수 있다. 도 10은 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 10을 참조하면, 일 실시에에 따른 전자 장치의 프로세서(예: 도 1의 프로세서, 도 5의 프로세서 는 증강 현실 서비스 또는 혼합 현실 서비스를 지원할 수 있다. 프로세서는 <10001>에 도시된 바와 같이, 증강 현실 서비스 또는 혼합 현실 서비스 실행 시 카메라를 실행하여 현실 이미지(real image)를 획득할 수 있다. 예를 들어, <10001>에 도시된 현실 이미지는 카메라 이미지 센서의 화각에 의해 획득 가능한 범위 또는 사이즈 일 수 있다. 전자 장치가 닫힌 상태에서 증강 현실 서비스 실행 시 프로세서는 <10002>에 도시된 현실 이미지에서 제1 활성화 영역에 대응하는 섹션뷰(section view)로 잘라내기할 수 있다. 프로세서는 <10003>에 도시된 바와 같이, 제1 활성화 영역에 대응하는 크기로 잘려진 제1 조각 이미지 내에서 아바타를 표현할 3차원의 제1 가상 공간을 도출할 수 있다. 제1 가상 공간은 제1 x,y, z 축 값을 가질 수 있다. 프로세서는 제1 조각 이미지의 제1가상 공간의 범위 내에서 표현되는 아바타 컨텐츠를 선별하여 <10004>에 도시된 바와 같이, 제1 자세의 아바타를 표시할 수 있다. 프로세서는 전자 장치가 닫힌 상태에서 열린 상태에 변화된 것에 기반하여, 활성화 영역이 제1 활성화 영 역에서 제2 활성화 영역으로 변경된 것을 감지할 수 있다. <10005>에 도시된 바와 같이, 현실 이미지에서 제2 활성화 영역에 대응하는 크기로 잘라낸 제 2 조 각 이미지로부터 아바타를 표현할 3차원의 제2 가상 공간을 도출할 수 있다. 제2 가상 공간 은x', y', z' 축 값을 가질 수 있다. 프로세서는 제2 조각 이미지의 제2가상 공간의 범위 내에서 표현되는 아바타 컨텐츠를 선별하여 제2 자세의 아바타를 표시할 수 있다. 이하의 도면들에서 도 10과 중복되는 구성들에 대해서는 생략되거나 간략히 기재하기로 한다. 도 11은 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 11을 참조하면, 일 실시에에 따른 전자 장치의 프로세서(예: 도 1의 프로세서, 도 5의 프로세서 는 전자 장치가 닫힌 상태인 것에 기반하여, 제1 아바타 서비스 UI를 통해 <110001> 에 도시된 바와 같이, 제1 자세의 아바타를 제공할 수 있다. 제1 아바타 서비스 UI 화면는 제1 활성화 영역의 크기에 대응하여 선별된 아바타 컨텐츠들로 구성될 수 있다. 제1 아바타 서비스 UI 화면는 제1 자세의 아바타, 아바타 추가 항목, 아바타 리스트 항목들 (1140,1141)을 포함할 수 있다. 제1 자세의 아바타는 제1 활성화 영역의 크기에 따라 선별된 아바타 컨텐 츠일 수 있다. 사용자가 아바타 추가 항목을 선택(예: 터치)할 경우, 프로세서는 아바타를 새롭게 추가할 수 있는 메뉴로 진입할 수 있다. 아바타 리스트 항목들(1140,1141) 중 선택된 아바타는 메인 아바타로 지정될 수 있다. 사용자가 제1 상태에서 메인 아바타 예를 들어, 제1 자세의 아바타를 선택(예: 터치)할 경우, 프로세서는 제1 활성화 영역의 크기에서 표현 가능한 아바타 컨텐츠들로 구성된 모션 UI를 제공할 수 있다. 일 실시예에 따르면, 모션 UI는 전자 장치가 닫힌 상태인 것에 반응하여, 제1 활성화 영역의 크기에 서 표현 가능한 모션항목들로 구성될 수 있으나, 이에 한정하는 것은 아니다. 어떤 실시예에 따르면, 프로세서는 모션 UI에 제1 활성화 영역의 크기에서 표현 불가능한 모션 항목들이 포함되는 경우, 표현 가능한 모션 항목들과 시각적으로 다르게 표시(예: 빗줄 표시)할 수 있다. 또는 프 로세서는 모션 UI에 제1 활성화 영역의 크기에서 표현 불가능한 모션 항목들이 포함되는 경우, 모션 항목 들 중 일부가 표현 불가능하다는 것을 안내하는 정보 또는 디스플레이를 제1 표시 영역에서 제2 표시 영 역의 적어도 일부까지 확장하도록 안내하는 정보를 제공할 수도 있다. 프로세서는 전자 장치가 닫힌 상태에서 열린 상태로 변화하는 것에 실시간으로 반응하여, <11002>에 도시 된 바와 같이, 제2 아바타 서비스 UI 화면으로 전환하여 제2 자세의 아바타를 제공할 수 있다. 제2 아바타 서비스 UI 화면은 변화된 활성화 영역의 크기에 대응하여 선별된 아바타 컨텐츠들로 구성될 수 있다. 제2 아바타 서비스 UI 화면은 제1 자세의 아바타에서 제2 자세의 아바타로 전환될 수 있으며, 변화된 활성화 영역의 크기에 대응하여 배경 이미지(또는 변화된 활성화 영역의 크기로 잘라진 조각 이미지)로 전환될 수 있다. 아바타 추가 항목, 아바타 리스트 항목들(1140,1141)은 제1 아바타 서비스 UI 화면과 동일할 수 있다. 제2 아바타 서비스 UI 화면에서 사용자가 제2 자세의 아바타를 선택(예: 터치)할 경우, 프로세서는 변경된 활성화 영역의 크기에서 표현 가능한 아바타 컨텐츠들로 구성된 모션 UI를 제공할 수 있다. 이 경 우, 모션 UI는 전자 장치가 열린 상태인 것에 반응하여, 닫힌 상태에서 표현 불가능한 모션 항목들 이 표현 가능한 상태로 활성화되도록 구성될 수 있다. 사용자는 열린 상태에서 표현 가능한 모션 항목 을 선택(예: 터치)하여 변경된 활성화 영역에서 아바타를 다양하게 표현할 수 있다. 도 12는 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 12를 참조하면, 일 실시에에 따른 전자 장치의 프로세서(예: 도 1의 프로세서, 도 5의 프로세서 는 전자 장치가 제1 상태에서 제2 상태로 전환된 것에 기반하여 다른 아바타 표시 기능을 제공할 수 있다. 전자 장치가 닫힌 상태인 것에 기반하여, 프로세서는 <11001>에 도시된 바와 같이, 제1 활성화 영역을 통 해 제1 자세의 아바타를 포함하는 제1 아바타 서비스 UI 화면을 제공할 수 있다. 프로세서는 전자 장치가 닫힌 상태에서 열린 상태로 변화하는 것에 실시간으로 반응하여, <12002>에 도시 된 바와 같이, 제2 아바타 서비스 UI 화면로 전환하여 제2 자세의 아바타 및 제2 아바타 서비스 UI 화면 을 제2 활성화 영역의 디스플레이에 제공할 수 있다. 다른 아바타 추가 표시 UI는 안내 정보, 아바타 리스트, 추가 취소 항목 및 추가 승인 항목을 포함할 수 있다. 사용자가 메인 아바타로 표시할 아바타를 선택(예: 터치)하는 경우, 프로세서는 제2 아바타 서비스 UI 화면에 다른 아바타을 제공할 수 있다., 어떤 실시예에 따르면, 프로세서는 전자 장치가 닫힌 상태에서 열린 상태로 변화하는 것에 실시간으로 반 응하여, 디스플레이에 표시된 아바타(예: 메인 아바타)를 복제한 클론 아바타를 추가로 제공할 수도 있다. 이 경우, 클론 아바타의 수는 활성화 영역이 변화된 크기(또는 확장된 정도)에 따라 가변될 수 있다. 도 13 및 도 14는 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다 도 13 및 도 14를 참조하면, 일 실시예에 따른 전자 장치의 프로세서(예: 도 1의 프로세서, 도 5의 프로세서는 전자 장치가 제1 상태에서 제2 상태로 전환된 것에 기반하여 아바타 인터렉션 기능을 제 공할 수 있다. 일 실시에에 따른 전자 장치가 도 13에 도시된 바와 같이, 업 롤러블 전자 장치인 경우, 닫힌 상태에서 디 스플레이는 제1 표시 영역(A1)을 활성화 영역으로 결정할 수 있다. 전자 장치가 닫힌 상태인 것에 기반하 여, 프로세서는 <13001>에 도시된 바와 같이, 제1 표시 영역(A1)을 통해 제1 자세의 아바타를 포함하는 제1 아바타 서비스 UI 화면을 제공할 수 있다 프로세서는 전자 장치가 닫힌 상태에서 위로 업 롤링된 열린 상태로 변화하는 것에 실시간으로 반응하여, 디스플레이는 제1 표시 영역(A1) 및 제2 표시 영역(A2)을 활성화 영역으로 결정할 수 있다. 전자 장치가 열린 상태에서 닫힌 상태로 변환하는 것에 실시간으로 반응하여 <13002>에 도시된 바와 같이, 제2 아바타 서비 스 UI 화면으로 전환하여 제2 자세의 아바타를 제1 표시 영역(A1) 및 제2 표시 영역(A2)을 통해 제 공할 수 있다. 일 실시예에 따르면, 프로세서는 시각적 정보가 표시될 활성화 영역의 면적이 확장됨에 따라 아바타와 관련된 확장 서비스 기능 예를 들어, 아바타 사용자 인터렉션 기능 항목을 제공할 수 있다. 사용자가 아바타의 손을 움직여 아바타 사용자 인터렉션 기능 항목을 선택하는 경우, 프로세서는 아바타 사용자 인터렉션 기능 항목에 지정된 기능을 실행할 수 있다. 어떤 실시예에 따르면, 전자 장치가 도 14에 도시된 바와 같이, 사이드 롤러블 전자 장치인 경우 전자 장 치가 닫힌 상태인 것에 기반하여, 프로세서는 <14001>에 도시된 바와 같이, 제1 자세의 아바타를 포 함하는 제1 아바타 서비스 UI 화면을 제공할 수 있다. 프로세서는 전자 장치가 닫힌 상태에서 사이 드로 롤링된 열린 상태로 변화하는 것에 실시간으로 반응하여, 제2 아바타 서비스 UI 화면로 전환하여 제 2 자세의 아바타, 옷장 인터렉션 항목 및 화장 인터렉션 항목을 제공할 수 있다. 예를 들어, 사용자가 아바타의 손을 움직여 옷장 인터렉션 항목을 선택하거나, 옷장 인터렉션 항목(143 0)으로 이동한 경우, 프로세서는 아바타 옷장 기능을 실행하여 아바타의 옷을 변경할 수 있는 메뉴로 진입할 수 있다. 다른 예를 들어, 사용자가 아바타의 손을 움직여 옷장 인터렉션 항목을 선택하거나 화장 인터렉션 항목으로 이동한 경우, 프로세서는 아바타 화장 기능을 실행하여 아바타의 얼굴을 변경할 수 있는 메뉴로 진입할 수 있다. 다양한 실시예에 따른 플렉서블 전자 장치(예: 도 1의 전자 장치, 도 5의 전자 장치)의 아바타 운용 방법은, 제1 하우징에 대해 제2 하우징이 제1 방향으로 이동 시 제1 표시 영역을 가지며, 상기 제2 하우징이 상 기 제1하우징으로부터 제2 방향으로 이동 시 상기 제1 표시 영역 및 제2 표시 영역으로 확장되는 디스플레이(예: 도 1의 디스플레이 모듈, 도 5의 디스플레이) 통해 아바타 서비스를 실행하는 요청을 수신하는 동작, 상기 디스플레이에서 시각적 정보가 표시될 활성화 영역이 상기 제1 표시 영역인 경우, 상기 아바타 서비스 실행 요청에 응답하여 상기 제1 표시 영역에 대응하는 배경 이미지에서 공간 요소를 분석하여 아바 타를 표현할 가상의 제1 공간을 도출하는 동작, 아바타의 특성 정보를 기반으로 상기 제1공간 내에서 표현 가능 한 제1 자세의 아바타를 상기 제1 표시 영역인 활성화 영역에 표시하는 동작, 상기 디스플레이의 활성화 영역이 제1 표시 영역에서 제2 표시 영역의 적어도 일부까지 확장된 것에 기반하여, 상기 제1 및 제2 표시 영역에 대응 하는 배경 이미지에서 공간 요소를 분석하여 가상의 제2 공간을 도출하는 동작 및 상기 아바타의 특성 정보를 기반으로 상기 제2 공간 내에서 표현 가능한 제2 자세의 아바타 및 확장 서비스 기능 중 적어도 하나를 상기 제 1 표시 영역 및 제2 표시 영역에 대응하는 활성화 영역에 표시하는 동작을 포함하는 방법을 포함할 수 있다. 다양한 실시예에 따르면 상기 제 1 공간을 도출하는 동작은, 상기 배경 이미지에서 제1 표시 영역에 대응하는 크기로 제1 잘라내기 영역을 결정하고, 상기 제1 잘라내기 영역 내의 공간 요소를 분석하여 도출하고, 상기 제2 공간을 도출하는 동작은, 상기 배경 이미지에서 제1 표시 영역 및 제2 표시 영역에 대응하는 크기로 제2 잘라내 기 영역을 결정하고, 상기 제2 잘라내기 영역 내의 공간 요소를 분석하여 도출할 수 있다. 다양한 실시예에 따르면 상기 배경 이미지는 카메라를 통해 획득한 현실 이미지 또는 랜더링된 가상 현실 공간 이미지를 포함함할 수 있다. 다양한 실시예에 따르면 상기 공간 요소는 바닥, 벽, 천장, 물체 중 적어도 하나를 포함하고, 상기 제1 공간 또 는 제2 공간을 도출하는 동작은, 상기 공간 요소의 크기 면적, 높이, 거리 중 적어도 하나를 분석하여 배경 이 미지에서 상기 아바타가 위치할 바닥 면적을 계산하고, 상기 상기 바닥 면적을 기준으로 제1 공간 또는 제2 공 간의 x축, y축 및 z축 값을 결정하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면 상기 아바타 특성 정보는, 아바타 다리, 팔, 바디 및 얼굴의 사이즈, 아바타 모션, 아 바타 애니메이션 활동 또는 아바타 자세 중 적어도 하나에 대한 정보를 포함할 수 있다. 다양한 실시예에 따르면 상기 디스플레이의 활성화 영역이 제1 표시 영역인 것에 기반하여, 상기 제1 공간 내에 서 표현 가능한 아바타 컨텐츠들을 선별하여 제1 아바타 서비스 사용자 인터페이스를 구성하는 동작 및 상기 디 스플레이의 활성화 영역이 상기 제1 표시 영역에서 상기 제2 표시 영역의 적어도 일부까지 확장된 것에 기반하 여, 상기 제2 공간 내에서 표현 가능한 아바타 컨텐츠들을 선별하여 제2 아바타 서비스 사용자 인터페이스를 구 성하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면 상기 제2 아바타 서비스 사용자 인터페이스는 확장된 활성화 영역에 대응하는 확장 서 비스 기능을 더 포함하고, 상기 확장 서비스 기능은, 메인 아바타 이외에 다른 아바타를 추가로 표시할 수 있는 다른 아바타 표시 기능, 아타바의 복제 클론을 제공할 수 있는 클론 기능, 아바타와 상호 인터랙션을 통해 추가 기능을 실행할 수 있는 아바타 인터랙션 기능 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면 상기 제1 아바타 서비스 사용자 인터페이스는, 상기 제1 공간 내에서 표현 가능한 모션 항목들을 포함하고, 상기 제2 아바타 서비스 사용자 인터페이스는 상기 제2 공간 내에서 표현 가능한 모션 항목 들을 포함하고, 상기 제1 아바타 서비스 사용자 인터페이스를 구성하는 동작은, 상기 제1 공간 내에서 표현 불 가능한 모션 항목들이 포함되는 경우, 상기 제1 공간 내에서 표현 가능한 모션 항목들과 상기 표현 불가능한 모 션 항목들을 시각적으로 다르게 표시하도록 구성할 수 있다. 상기 제1 아바타 서비스 사용자 인터페이스를 구성하는 동작은, 상기 제1 아바타 서비스 사용자 인터페이스에 상기 제1 공간 내에서 표현 불가능한 모션 항목들이 포함되는 경우, 모션 항목들 중 일부가 표현 불가능하다는 것을 안내하는 정보 또는 상기 디스플레이를 제1 표시 영역에서 제2 표시 영역의 적어도 일부까지 확장하도록 안내하는 정보를 더 포함하여 구성할 수 있다. 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모 듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태 로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다."}
{"patent_id": "10-2020-0167459", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a는 일 실시예에 따른 닫힌 상태(closed state)의 전자 장치에 관한 전면 사시도이다. 도 2b는 일 실시예에 따른 닫힌 상태의 전자 장치에 관한 후면 사시도이다. 도 3a는 일 실시예에 따른 열린 상태(open state)의 전자 장치에 관한 전면 사시도이다. 도 3b는 일 실시예에 따른 열린 상태의 전자 장치에 관한 후면 사시도이다 도 4는 일 실시예에 따른 도 2a의 전자 장치에 관한 전개 사시도이다. 도 5는 일 실시예에 따른 전자 장치의 블록도이다. 도 6은 일 실시예에 따른 플랙서블 전자 장치에서 아바타 운용 방법을 나타낸다. 도 7은 일 실시예에 따른 플랙서블 전자 장치에서 아바타 운용 방법을 나타낸다.도 8은 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 9는 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 10은 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 11은 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 12는 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 13은 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다. 도 14는 일 실시예에 따른 플랙서블 전자 장치의 아바타 운용 화면의 예시를 나타낸다."}
