{"patent_id": "10-2019-0074135", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0145299", "출원번호": "10-2019-0074135", "발명의 명칭": "온라인 면접 동영상 분석 및 소셜미디어 정보분석 기반 지능형 채용지원 플랫폼", "출원인": "주식회사 웨이브온", "발명자": "박규태"}}
{"patent_id": "10-2019-0074135", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "면접 지원자가 서비스 서버로부터 질문정보를 수신하여 이에 대응하는 면접 영상을 촬영한 동영상 데이타를 형성하여 이를 송신하는 면접 단말기;네트워크를 통해 상기 동영상 데이타를 수신하여 저장하고, 상기 동영상 데이타를 가공편집하고, 가공편집된 동영상 데이타를 면접관 단말에 송신하는 서비스 서버; 및 네트워크를 통해 상기 서비스 서버로부터 상기 가공편집된 동영상 데이타를 수신하는 면접관 단말기를 포함하는 온라인 면접시스템에 있어서,발굴하고자 하는 인재와 관련된 키워드 및 상기 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과,특허, 근무처, 출신 학교 중 하나 이상을 포함하는 인재 정보 요청 신호를 입력받는 신호 입력부;논문 검색 사이트, 소셜 네트워크 서비스 게시물, 블로그 게시물, 인명 사전 사이트, 신문 기사, 인맥 정보전문사이트, 대학 동문 정보를 제공하는 대학교 사이트, 분야별 전문 보고서 제공 사이트, 공개 특허 검색 사이트중 하나 이상을 포함하는 사이트로부터 상기 인재의 과거 및 현재 공개된 정보를 추적하여 관련업무의 지속성및 연관성 있는 데이터가 포함된 상기 키워드에 상응하는 인재 관련 빅데이터를 수신하는 인재 정보 수집부;상기 인재 정보 요청 신호에 포함된 상기 키워드, 상기 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력,성과, 특허, 근무처, 출신 학교 중 하나 이상을 통해 검색될 수 있는 형태로 상기 인재 관련 빅데이터를 변환하고, 상기 인재 관련 빅데이터를 분석하여 상기 인재 정보 요청 신호에 상응하는 인재 현황 정보를 생성하는 인재 정보 처리부;변환된 상기 인재 관련 빅데이터를 저장하는 인재 정보 저장부; 및상기 인재 현황 정보를 출력하는 인재 정보 출력부를 포함하고,상기 인재 정보 출력부는 상기 인재 정보 요청 신호에 포함된 상기 키워드, 상기 인재의 연구 분야, 업무 분야,성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상의 기준에 의해 상기 인재 현황 정보를벤다이어그램 형태로 시각화하여 인력의 분포를 세분화하여 출력하는 것으로서,발굴하고자 하는 인재와 관련된 키워드 및 상기 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과,특허, 근무처, 출신 학교 중 하나 이상을 포함하는 인재 정보 요청 신호를 신호 입력부에서 입력받는 단계;논문 검색 사이트, 소셜 네트워크 서비스 게시물, 블로그 게시물, 인명 사전 사이트, 신문 기사, 인맥 정보 전문 사이트, 대학 동문 정보를 제공하는 대학교 사이트, 분야별 전문 보고서 제공 사이트, 공개 특허 검색 사이트 중 하나 이상을 포함하는 사이트를 검색하여 상기 인재의 과거 및 현재 공개된 정보를 추적하고 관련업무의지속성 및 연관성 있는 데이터가 포함된 키워드에 상응하는 인재 관련 빅데이터를 인재 정보 수집부에서 수집하는 단계;상기 신호 입력부에서 입력받은 상기 인재 정보 요청 신호에 포함된 상기 키워드, 상기 인재의 연구 분야, 업무분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상을 통해 검색될 수 있는 형태로 상기 인재 관련 빅데이터를 변환하고 변환된 상기 인재 관련 빅데이터를 인재 정보 처리부에서 인재정보 저장부에 저장하는 단계; 및상기 인재 정보 저장부에 저장된 상기 인재 관련 빅데이터를 상기 인재 정보 처리부에서 분석하여 상기 인재 정보 요청 신호에 상응하는 인재 현황 정보를 생성하고 생성된 상기 인재 현황 정보를 인재 정보 출력부에서 출력하는 단계를 포함하고,상기 정보를 출력하는 단계는 상기 인재 정보 요청 신호에 포함된 상기 키워드, 상기 인재의 연구 분야, 업무분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상의 기준에 의해 인력의 분포를 세분화하는 벤다이어그램의 형태로 시각화 된 상기 인재 현황 정보를 출력하며,상기 서비스 서버는, 동영상 데이타의 음성 데이타를 검출하여 상기 검출된 음성데이타를 텍스트 데이타로 변환공개특허 10-2020-0145299-3-하여 텍스트 데이타를 인덱스하고, 상기 인덱스된 텍스트 데이타와 대응되는 상기 동영상 데이타를 연계하여 인덱스화하여, 텍스트 데이타와 동영상 데이타를 매칭하는 데이타 매칭부;상기 텍스트 데이타의 특성을 평가하는 데이타 판별부;상기 데이타 판별부의 평가에 따라 상기 텍스트 데이타를 선택하고, 상기 선택된 텍스트 데이타의 인덱스와 대응되는 동영상 데이타를 추출하는 데이타 추출부; 및상기 데이타 추출부를 통해 얻어진 동영상 데이타들을 병합하는 데이타 병합부를 더 포함하며,상기 면접관 단말기는, 상기 서비스 서버에 특정 키워드를 포함하는 동영상 구간이 포함되도록 동영상 데이타의가공편집을 요청하는 데이타 편집 요청부를 포함하되, 상기 데이타 매칭부에서 상기 텍스트 데이타를 인덱스하는 방식은 시간을 함수로 인덱스하되 텍스트의 어절 단위로 이루어지며,상기 데이타 판별부는 어절 단위로 인덱스된 시간의 간격을 함수로 하여 평가하여 아이들 타임을 평가하며, 또한 텍스트 테이타에 특정 키워드가 포함되었는지 여부를 평가하며, 상기 데이타 추출부는 동영상 데이타를 추출하기 위한 텍스트 데이타를 선택함에 있어서, 텍스트 데이타 중 아이들 타임 부분으로 평가된 부분은 제외하고,특정 키워드를 포함하는 텍스트 데이타는 특정 키워드가 포함된 어절을 포함하는 문장 단위로 텍스트 데이타가선택되어, 선택된 텍스트 데이타의 인덱스와 대응되는 동영상 데이타를 추출하는 온라인 면접 동영상 분석 및소셜미디어 정보분석 기반 지능형 채용지원 플랫폼."}
{"patent_id": "10-2019-0074135", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 인재 관련 빅데이터를 변환하고 저장하는 단계는 하둡, HBASE, NoSql(Cassandra) 중 하나 이상을 이용하는온라인 면접 동영상 분석 및 소셜미디어 정보분석 기반 지능형 채용지원 플랫폼."}
{"patent_id": "10-2019-0074135", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 인재 관련 빅데이터를 온톨로지 기반의 빅데이터 분석 방법에 의해 분석하는 온라인 면접 동영상 분석 및소셜미디어 정보분석 기반 지능형 채용지원 플랫폼."}
{"patent_id": "10-2019-0074135", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 정보를 출력하는 단계는 상기 인재 정보 요청 신호에 포함된 상기 키워드, 상기 인재의 연구 분야, 업무분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상의 기준에 의해 그래프의 형태로시각화 된 상기 인재 현황 정보를 출력하는 온라인 면접 동영상 분석 및 소셜미디어 정보분석 기반 지능형 채용지원 플랫폼."}
{"patent_id": "10-2019-0074135", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 면접 지원자가 서비스 서버로부터 질문정보를 수신하여 이에 대응하는 면접 영상을 촬영한 동영상 데 이타를 형성하여 이를 송신하는 면접 단말기; 네트워크를 통해 상기 동영상 데이타를 수신하여 저장하고, 상기 동영상 데이타를 가공편집하고, 가공편집된 동영상 데이타를 면접관 단말에 송신하는 서비스 서버; 및 네트워크 (뒷면에 계속)"}
{"patent_id": "10-2019-0074135", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 온라 면접을 통해 동영상을 분석하고, 소셜미디어 정보분석 기반으로 하여 인재를 평가하는 데이터를 생성하여 인재 채용에 도움을 주는 온라인 면접 동영상 분석 및 소셜미디어 정보분석 기반 지능형 채용지원 플 랫폼에 관한 것이다."}
{"patent_id": "10-2019-0074135", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 기업들의 신입사원 채용 방식이 서류와 필기시험 위주에서 면접평가, 적성평가 등의 방식으로 많이 바뀌고 있다. 이러한 이유는 면접을 통해 면접지원자와 면접관이 인성 및 사고 등을 종합적으로 파악하거나 피력할 수 있기 때문이다. 또한, 다양한 경영환경 변화에 따라 창의적이고 능동적인 인재의 필요성이 강조되는 상황에서 이를 파악하기 위한 방법으로 면접의 중요성이 이전에 비해 더욱 커지고 있다. 종래의 경우, 다수의 지원자들로부터 이력서와 구직을 희망하는 업종, 지역 정보 등을 웹사이트에 등록받고, 다 수의 구인회사로부터 채용 정보 등을 제공받아 각 면접자에게 접합한 채용 정보를 제공하도록 되어 있다. 웹사이트로부터 서류면접을 통과한 지원자는 해당 구인 회사에 직접 방문하여 오프라인 면접을 받아 채용 여부 를 결정받게 된다. 그러나, 지원자가 구인회사에 직접 방문해야 하며, 지원자와 구인회사의 거리가 멀리 떨어져 있는 경우 그 이동에 따른 불편함이 상당하게 된다. 또한 면접자도 채용규모의 많고 적음에 상관없이 지원자에 대한 오프라인 면접을 준비해야 하기 때문에, 시간 및 비용상 적지 않은 부담이 있게 된다. 따라서, 면접지원자와 면접관이 시간 및 비용을 절감하고, 면접의 효과도 우수한 시스템이 필요한 실정이다. 통 신기술의 발달에 따라 원격지의 단말간에 영상과 음성에 의한 영상 면접이 그 대안으로 떠올랐다. 면접지원자의 단말기와 이를 통한 동영상의 등록, 등록된 동영상을 수신, 확인하는 면접관 단말기를 기본으로 구성하는 형태 로서, 이와 관련된 특허출원이 다수 이루어졌다. 공개특허 KR10-2004-0006879호에서는, 다수의 구직자에게 구인회사별 채용정보를 제공함과 더불어 구인 및 구직 을 위한 면접 동영상이나 자기소개 동영상을 용이하게 제작하고 이를 다수의 구인회사에 실시간 제공할 수 있도 록 된 동영상 인터뷰 박수와 이를 이용한 온라인 면접 시스템을 개시하고 있다. 등록특허 KR10-0453838호에서는 온라인상 구인, 구직 처리단계와, 온라인상의 면접수행 및 정보 관리에 대한 전 반적인 온라인 면접 시스템의 구성을 개시하고 있다. 공개특허 KR10-2002-0069973호에서는 인터넷망을 통하여 접속되는 서버에서 구인을 원하는 다수의 기업이나 기 관의 업체 사업자들의 정보를 수집하여 취업을 원하는 다수의 개인 사용자들에게 원서와 이력서와 자기소개서 및 면접의 내용까지 제작하여 전송할 수 있도록 한 인터넷을 이용한 동영상 이력서 및 화상면접 서비스방법을 개시하고 있다. 그 외에도, 면접 동영상을 평가하는 다양한 방식들을 채택하는 구성을 가지는 특허들도 출원되 고 있다. 한편, 동영상 면접과 관련한 특허들은 미리 입력된 질문들을 동영상 또는 문자화된 화면 등으로 제공받고서, 이 에 대한 응답을 하는 형태로 대부분 이루어지고 있다. 이 경우, 면접 지원자의 동영상은 면접질문의 내용이나, 질문을 파악하기 위해 소요되는 핸들링 타임(handling time)등의 시간들을 포함하고 있게 된다. 질문에 대한 답변을 위해 소요되는 시간 동안 실제 면접지원자가 말을 하지 않고 있는 구간도 존재하게 된다. 즉, 소위 아이들 타임(idle time;유휴시간)이 발생하게 된다. 그러한 이유로, 면접지원자의 동영상을 수신, 검 토하는 면접관의 입장에서는 불필요한 시간들을 낭비할 수 있다. 동영상 면접의 구체적인 과정에서, 면접지원자에 대한 평가 질문들에 대하여 일정한 답변시간을 제시하는 경우 그 답변시간을 다 채우지 못하는 경우 답변하는 과정에서도 아이들 타임이 발생할 수 있다. 답변을 완료하였다는 신호를 입력하는 동안에도 아이들 타임이 발생할 수 있다. 평가 컨텐츠를 평가 항목별로 카테고리화하여 질문을 제공할 때, 이에 대한 설명을 하는 과정에서도 실제 면접관의 입장에서는 불필요한 아이 들 타임들도 발생할 수 있다. 최근에는 인증수단의 활성화로 인해, 실제 지원면접자에 대한 질문요청을 휴대전화의 SMS를 통해 진행하거나, SMS의 인증번호를 누르게 하여 본인 확인 절차 등을 거치는 경우도 있다. 이러한 시간들은 면접관의 입장에서 면접지원자의 면접 영상을 평가하는 과정에서 아이들 타임이 될 수 있다. 구인하는 기업이나 기관의 입장에서, 질문과 동떨어진 답변의 내용들이나 또는 중요시되는 키워드를 포함하지 않는 답변내용은 불필요한 부분일 수 있고, 이를 포함하는 영상 구간은 면접관의 입장에서 불필요한 검토시간일 수 있다. 역으로, 특정 키워드가 포함된 영상구간은 면접관의 입장에서 중요한 영상 구간일 수 있을 것이다. 한편, 구인 하는 기업이나 기관의 입장에서는 수준에 미달하는 면접지원자를 보다 빠르게 찾아서 이를 제외할 필요가 있을 수도 있고, 보다 심층면접이나 오프라인 면접을 추가로 실시하여야 할 대상자에 대하여는 보다 면밀하게 동영상 면접영상을 고찰할 필요도 있을 것이다. 결국은, 동영상 면접의 효율성을 위하여, 면접관의 입장에서 불필요한 아이들 타임이 제거된 상태의 면접 동영 상이 제공될 필요가 있다. 또는, 효율성과 아울러 면접의 정확성을 위해 특정 구간을 다시 찾아보거나, 보다 요 약된 형태의 면접 자료가 제공될 필요가 있다."}
{"patent_id": "10-2019-0074135", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2019-0074135", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 면접관의 입장에서 불필요한 아이들 타임이 제거된 상태의 면접 동영상을 제공하는 면접시 스템을 제 공하는 것으로서, 면접 평가의 정확성과 효율성을 위해 필요한 영상 부분을 추출하여 제공할 수 있는 온라인 면 접 동영상 분석 및 소셜미디어 정보분석 기반 지능형 채용지원 플랫폼을 제공하는 것이다."}
{"patent_id": "10-2019-0074135", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 온라인 면접 동영상 분석 및 소셜미디어 정보분석 기반 지능형 채용지원 플랫폼은, 면접 지원자 가 서비스 서버로부터 질문정보를 수신하여 이에 대응하는 면접 영상을 촬영한 동영상 데이타를 형성하여 이를 송신하는 면접 단말기; 네트워크를 통해 상기 동영상 데이타를 수신하여 저장하고, 상기 동영상 데이타를 가공 편집하고, 가공편집된 동영상 데이타를 면접관 단말에 송신하는 서비스 서버; 및 네트워크를 통해 상기 서비스 서버로부터 상기 가공편집된 동영상 데이타를 수신하는 면접관 단말기를 포함하는 온라인 면접시스템에 있어서, 발굴하고자 하는 인재와 관련된 키워드 및 상기 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상을 포함하는 인재 정보 요청 신호를 입력받는 신호 입력부; 논문 검색 사 이트, 소셜 네트워크 서비스 게시물, 블로그 게시물, 인명 사전 사이트, 신문 기사, 인맥 정보전문 사이트, 대 학 동문 정보를 제공하는 대학교 사이트, 분야별 전문 보고서 제공 사이트, 공개 특허 검색 사이트 중 하나 이 상을 포함하는 사이트로부터 상기 인재의 과거 및 현재 공개된 정보를 추적하여 관련업무의 지속성 및 연관성 있는 데이터가 포함된 상기 키워드에 상응하는 인재 관련 빅데이터를 수신하는 인재 정보 수집부; 상기 인재 정 보 요청 신호에 포함된 상기 키워드, 상기 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상을 통해 검색될 수 있는 형태로 상기 인재 관련 빅데이터를 변환하고, 상기 인 재 관련 빅데이터를 분석하여 상기 인재 정보 요청 신호에 상응하는 인재 현황 정보를 생성하는 인재 정보 처리 부; 변환된 상기 인재 관련 빅데이터를 저장하는 인재 정보 저장부; 및 상기 인재 현황 정보를 출력하는 인재 정보 출력부를 포함하고, 상기 인재 정보 출력부는 상기 인재 정보 요청 신호에 포함된 상기 키워드, 상기 인재 의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상의 기준에 의 해 상기 인재 현황 정보를 벤다이어그램 형태로 시각화하여 인력의 분포를 세분화하여 출력하는 것으로서, 발굴 하고자 하는 인재와 관련된 키워드 및 상기 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상을 포함하는 인재 정보 요청 신호를 신호 입력부에서 입력받는 단계; 논 문 검색 사이트, 소셜 네트워크 서비스 게시물, 블로그 게시물, 인명 사전 사이트, 신문 기사, 인맥 정보 전문 사이트, 대학 동문 정보를 제공하는 대학교 사이트, 분야별 전문 보고서 제공 사이트, 공개 특허 검색 사이트 중 하나 이상을 포함하는 사이트를 검색하여 상기 인재의 과거 및 현재 공개된 정보를 추적하고 관련업무의 지 속성 및 연관성 있는 데이터가 포함된 키워드에 상응하는 인재 관련 빅데이터를 인재 정보 수집부에서 수집하는 단계; 상기 신호 입력부에서 입력받은 상기 인재 정보 요청 신호에 포함된 상기 키워드, 상기 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상을 통해 검색될 수 있 는 형태로 상기 인재 관련 빅데이터를 변환하고 변환된 상기 인재 관련 빅데이터를 인재 정보 처리부에서 인재 정보 저장부에 저장하는 단계; 및 상기 인재 정보 저장부에 저장된 상기 인재 관련 빅데이터를 상기 인재 정보 처리부에서 분석하여 상기 인재 정보 요청 신호에 상응하는 인재 현황 정보를 생성하고 생성된 상기 인재 현황 정보를 인재 정보 출력부에서 출력하는 단계를 포함하고, 상기 정보를 출력하는 단계는 상기 인재 정보 요청 신 호에 포함된 상기 키워드, 상기 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상의 기준에 의해 인력의 분포를 세분화하는 벤다이어그램의 형태로 시각화 된 상기 인재 현황 정보를 출력하며, 상기 서비스 서버는, 동영상 데이타의 음성 데이타를 검출하여 상기 검출된 음성데이타 를 텍스트 데이타로 변환하여 텍스트 데이타를 인덱스하고, 상기 인덱스된 텍스트 데이타와 대응되는 상기 동영 상 데이타를 연계하여 인덱스화하여, 텍스트 데이타와 동영상 데이타를 매칭하는 데이타 매칭부; 상기 텍스트 데이타의 특성을 평가하는 데이타 판별부; 상기 데이타 판별부의 평가에 따라 상기 텍스트 데이타를 선택하고, 상기 선택된 텍스트 데이타의 인덱스와 대응되는 동영상 데이타를 추출하는 데이타 추출부; 및 상기 데이타 추 출부를 통해 얻어진 동영상 데이타들을 병합하는 데이타 병합부를 더 포함하며, 상기 면접관 단말기는, 상기 서 비스 서버에 특정 키워드를 포함하는 동영상 구간이 포함되도록 동영상 데이타의 가공편집을 요청하는 데이타 편집 요청부를 포함하되, 상기 데이타 매칭부에서 상기 텍스트 데이타를 인덱스하는 방식은 시간을 함수로 인덱 스하되 텍스트의 어절 단위로 이루어지며, 상기 데이타 판별부는 어절 단위로 인덱스된 시간의 간격을 함수로 하여 평가하여 아이들 타임을 평가하며, 또한 텍스트 테이타에 특정 키워드가 포함되었는지 여부를 평가하며, 상기 데이타 추출부는 동영상 데이타를 추출하기 위한 텍스트 데이타를 선택함에 있어서, 텍스트 데이타 중 아 이들 타임 부분으로 평가된 부분은 제외하고, 특정 키워드를 포함하는 텍스트 데이타는 특정 키워드가 포함된어절을 포함하는 문장 단위로 텍스트 데이타가 선택되어, 선택된 텍스트 데이타의 인덱스와 대응되는 동영상 데 이타를 추출한다."}
{"patent_id": "10-2019-0074135", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 면접관의 입장에서 불필요한 아이들 타임이 제거된 상태의 면접 동영상을 제공하는 면접시 스템을 제 공하는 것으로서, 면접 평가의 정확성과 효율성을 위해 필요한 영상 부분을 추출하여 제공할 수 있는 온라인 면 접 동영상 분석 및 소셜미디어 정보분석 기반 지능형 채용지원 플랫폼을 제공할 수 있다."}
{"patent_id": "10-2019-0074135", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 컴퓨터가 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현될 수 있고, 컴퓨터가 읽을 수 있는 기록 매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록 장치를 포함 한다. 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터저 장 장치 등이 있다. 또한, 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산 방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 사용되는 모든 용어들은 다르게 정의되지 않는 한, 본 발명이 속하는 분야에서 통상의 지식을 가진 자에의해 일 반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 용어들은 관련 기술 의 문맥상 가지는 의미와 일치하는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한 이상적이 거나 과도하게 형식적인 의미를 지니는 것으로 해석될 수 없다. 본 발명의 실시예들을 설명하기에 앞서 이하에서 사용할 용어들과 개념들을 간략히 설명하도록 한다. 시맨틱 웹 (semantic web)은 현재의 인터넷과 같은 분산 환경에서 리소스(웹 문서, 각종 파일, 서비스 등)에 대한 정보와 자원 사이의 관계-의미 정보(semanteme)를 기계, 즉 컴퓨터가 처리할 수 있는 온톨로지(ontology)의 형태로 표 현하고, 이를 자동화된 기계가 처리하도록 하는 프레임워크이자 기술이다. 온톨로지란 사람들이 사물에 대해 생각하는 바를 추상화하고 공유화한 모델로서, 개념의 유형이나 사용상의 제 약 조건들이 명시적으로 정의되고, 정형화된 기술을 말한다. 즉 온톨로지는, 컴퓨터가 단어의 개념을 이해해 처 리하는 등 논리적 추론을 가능케 하는 기술이다. 컴퓨터 과학 분야에서 온톨로지는 특정한 영역을 표현하는 데이터 모델로서 특정한 영역(domain)에 속하는 개념 과 개념 사이의 관계를 기술하는 정형(formal)화된 어휘의 집합으로 정의된다. 특히 온톨로지는 시맨틱 웹을 구 현할 수 있는 도구로서, 지식 개념을 의미적으로 연결할 수 있는 도구로 사용된다. 웹 정보 검색은 웹을 통해 접근할 수 있는 모든 전자자원을 대상으로 하는 검색을 가능하게 하였다. 온톨로지는 특히 컴퓨터에서 사람이 갖고 있는 사물에 대한 개념을 일종의 데이터베이스의 형태로 가공하여 처리할 수 있도록 해 준다. 인터넷의 급속한 발달로 인해 검색 대상 범위가 확대됨에 따라 보다 정교한 검색을 필요로 하게 되 었으며, 지능화된 정보검색 시스템 개발을 촉진하는 계기가 되었다. 이런 계기를 바탕으로 웹 자원을 효과적으 로 관리할 수 있는 정보검색의 새로운 도구의 필요성이 대두되었고, 온톨로지가 각광을 받게 되었다. 온톨로지는 자연어의 기계 번역과 인공지능 분야에서 활용되며, 최근에는 특정 분야의 인터넷 자원과 그 사이의 관계를 기술하는 온톨로지를 사용하는 시맨틱 웹과 이것에서 파생된 시맨틱 웹 서비스 등의 핵심 요소로서 주목 받고 있다. 기계가 의미에 따라 정보를 추론하여 사용자에게 제공하는 환경을 시맨틱 웹이라고 한다면 그 중 이렇게 기계가 의미를 해석하는데 도움이 되는 뼈대를 온톨로지라고도 할 수 있다. 정보 기술에서의 온톨로지(Ontology)는 어 떤 특정 영역 내에 있는 ‘실체’와 ‘그 실체가 의미하는 것’(또는 데이터와 그 데이터가 뜻하는 ‘의미’) 사이의 상호 작용의 작업 모델을 말하며, 실체와 가상(그것의 웹 표현) 사이의 윤활유가 필요하다. 이것을 웹상 에서 공유하기 위한 표준들과 Best Practice들의 집합체를 말한다고도 볼 수 있다. 시맨틱 웹 기술은 사람의 머리 속에 있는 언어에 대한 이해를 컴퓨터 언어로 표현하고 이것을 컴퓨터가 사용 할수 있게 만드는 것인데, 특별한 분산환경을 갖춘 웹에 구현하자는 것이다. 이것은 기계가 정보검색과 같은 사람의 요구를 더 잘 이해하고 적절하게 반응하도록 만들기 위해서이다. 사람과 기계 사이에 진정한 커뮤니케이션이 가능하기 위해서는 사람이 이해하는 수준으로 기계도 언어를 이해할 수 있어야 한다. 세상에 있는 각각의 사물이나 사건들을 경험하면서 이들 속에 들어있는 특징을 파악해서 이해 하는 방식을 개념화라고 하는데, 온톨로지는 컴퓨터에서도 사람이 갖고 있는 개념과 같은 것을 일종의 데이터베 이스와 같은 형태로 만드는 기술이라 할수 있다. 프로그램과 인간이 지식을 공유하는데 도움을 주기 위한 온톨 로지는, 정보시스템의 대상이 되는 자원의 개념을 명확하게 정의하고 상세하게 기술하여 보다 정확한 정보를 찾 을 수 있도록 하는데 목적이 있다. 시맨틱 웹은 XML(Extensible Markup Language)에 기반한 시맨틱 마크업 언어로써 표현될 수 있다. 이러한 시맨 틱 웹에서는 주체(subject), 술어(predicate), 객체(object)의 트리플(triple) 형태로 개념을 표현하며, 다시 각각의 주체, 술어, 객체는 XML의 URI(Uniform Resource Identifier)로 표현될 수 있다. 현재 시맨틱 웹 온톨 로지를 기술하는 표준 언어로 W3C에서 제안한 RDF, RDF-Schema, OWL, SW RL 그리고 ISO에서 제안한 TopicMaps 등이 있다. 온톨로지의 구성 요소는 클래스(class), 인스턴스(instance), 관계(relation), 속성(property)으로 구분 할 수 있다. 클래스(Class)는 일반적으로 우리가 사물이나 개념 등에 붙이는 이름을 말한다고 설명할 수 있다. 인스턴스(Instance)는 사물이나 개념의 구체물이나 사건 등의 실질적인 형태로 나타난 그 자체를 의미한다. 클 래스와 인스턴스의 구분은 응용과 사용목적, 상황에 따라서 매우 달라질 수 있다. 즉, 같은 표현의 개체가 어떠 한 경우에는 클래스가 되었다가 다른 경우에는 인스턴스가 될 수 있다. 그리고 속성(Property)은 클래스나 인스 턴스의 특정한 성질, 성향 등을 나타내기 위하여 클래스나 인스턴스를 특정한 값(value)와 연결시킨 것이다. 관계(Relation)는 클래스, 인스턴스 간에 존재하는 관계들을 칭하며, 일반적으로 분류 관계(taxonomic relation)와 비분류 관계(non-taxonomic relation)으로 구분할 수 있다. 분류 관계(taxonomic relation)는 클 래스, 인스턴스들의 개념분류를 위하여 보다 상위개념과 하위 개념들로 구분하여 계층적으로 표현하는 관계이다. 그리고 비분류 관계(non-taxonomic relation)는 분류 관계(Taxonomic Relation)가 아닌 관계를 말한 다. 예를 들어, \"운동으로 인해 건강해진다\"는 것은 인과관계(cause-result)를 이용하여 표현한다. 도 1은 본 발명의 일 실시예에 따라 인재 정보를 수집할 수 있는 여러 소스와 연결을 유지하는 인재 정보 처리 장치를 나타낸 도면이다. 도 1을 참조하면, 인재 정보 처리 장치는 다양한 사이트로부터 인재 관련 정보를 수집할 수 있다. 여기서 는 일반 포털 사이트, 소셜 네트워크 서비스 사이트, 국내외 논문 검색 사이트, 구인 구직 전문 사이트, 전문 보고서를 유료 또는 무료로 제공하는 각종 사이트들과 연동하여 인재 정보 처리 장치가 인재 관련 정보를 수신 하여 수집하는 것으로 예를 들었다. 여기서 소셜 네트워크 서비스에는 페이스북, 인스타그램, 링크드인 등을 포 함할 수 있으며, 그 종류에 제한은 없다. 인재 정보 처리 장치가 연결될 수 있는 사이트나 그 서버에는 제한이 없으며, 해당 사이트나 서버로부터 받을 수 있는 정보의 내용이나 종류에도 특별한 제한이 있지 않다. 연동하고자 하는 논문 검색 사이트 또는 보 고서 검색 사이트가 유료 사이트라면 미리 이에 대한 요금을 지불하는 단계가 추가될 수 있다. 이 외에도, 인재정보 처리 장치는 각종 블로그, 홈페이지, 인터넷 인명 사전, 인터넷 신문 기사, 인맥 정보 전문 사이트, 대학 동문 정보를 제공하는 대학교 사이트, 공개 특허 검색 사이트 중 하나 이상의 사이트와 연결을 유지하면서 인재 관련 정보를 수신할 수 있다. 도 2는 도 1에 있는 인재 정보 처리 장치를 설명하는 블록도이다. 도 2를 참조하면, 인재 정보 처리 장치는 신호 입력부, 인재 정보 수집부, 인재 정보 처리부 , 인재 정보 저장부 및 인재 정보 출력부를 포함할 수 있다. 신호 입력부는 발굴하고자 하는 인재에 대한 정보를 요청하는 인재 정보 요청 신호를 입력받을 수 있다. 이러한 인재 정보 요청 신호는 인재 검색을 위한 키워드를 입력받는 형대로 입력될 수 있다. 키워드의 입력 자 체가 인재 정보 요청 신호로 인식될 수도 있고, 키워드 입력 및 검색 이후 별도의 인재 정보요청 신호가 입력될 수도 있다. 이공계 또는 유망기술 내 특수 연구 분야에서 과거의 연구결과(논문, 저널) 등의 저자 정보와 해당저자들이 현 재 종사하고 있는 업무분야 및 관련 소셜 네트워크 서비스 등을 검색하여, 관련업무의 지속성이 있는 경우 해당 인력을 본 발명의 실시예에 따른 인재 풀에 등록하고, 해당 인제 정보를 구인관련 기업의 인사정보와 매칭시켜 헤드헌팅이나 인재초빙 등의 기초자료로 활용할 수 있다. 소셜 네트워크 서비스나 기타 정보를 기반으로 하여 인력 데이터 베이스를 구성하고 이를 기반으로 한 구인 및 구직 프로그램에 대하여 일부 언급된 공지기술이 있으나, 본 발명의 실시예와 같이 해당 인력이 과거 전문적인 연구과제나 업무를 수행할 때 발생되었던 논문, 저널 등과 같은 기초정보는 물론 현재 공개된 소셜 네트워크서 비스를 통해 게시된 내용과 관련 업무까지 모두 추적하여 연관성있는 데이터로 비교하는 기술은 아직 공개된 바 가 없다. 인재 정보 요청 신호는 위에서 언급한 바와 같이, 발굴 또는 채용하고자 하는 인재에 대한 키워드를 포함할 수 있다. 그리고 키워드 이외에도, 상기 인재의 연구 분야, 업무 분야, 기술 분야, 채용 심사의 대상이 되는 인재 의 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상의 정보를 포함할 수 있다. 여기서 지 역 정보라 함은 해당 인재의 출신지, 근무지, 연구지, 거주지 등에 대한 정보일 수 있다. 해당 인재가 석사급인 지 박사급인지, 주요 저널에 게재된 논문은 몇 편인지, 그 논문은 무엇인지, 특허가 있는지, 있다면 해당 특허 의 번호가 무엇인지 등의 보다 자세한 정보도 인재 정보 요청 신호에 포함될 수 있다. 이와 같은 정보가 인재 정보 요청 신호에 포함되지 않더라도, 본 발명의 일 실시예에 따르면, 후술할 데이터 수 집 및 분석 과정에서 이러한 정보가 함께 수집되고 관리되는 것이 가능할 수 있다. 인재 정보 수집부는 앞서 언급한 바와 같이 다양한 사이트나 그 서버로부터 인재 관련 정보를 추출하여 수 집할 수 있다. 특히 해당 인재가 논문을 게재하거나 특허 출원을 한 경우에, 인재 정보 수집부는 해당 논문이나 특허 문서 전체를 인재 관련 자료로서, 이들 자료는 문서 전체가 저장될 수 있다. 즉 인재 관련 정보는 상당히 큰 용량의 데이터일 수 있다. 예컨대 소셜 네트워크 서비스에 따른 게시물들로부터 인재 관련 정보를 수집하는 경우, 해당 인재의 업무 또는 전공과 관련된 게시물이 모두 검색되어 인재 정보 수신부를 통해 수신될 수 있으며 이 경우 인재 관련 정 보는 빅데이터의 형태를 가질 수 있다. 논문 역시, 해당 인재가 논문의 주 저자인 경우는 물론 부 저자인 경우, 다른 논문의 레퍼런스로 활용된 경우 모두 분류되어 해당 데이터가 모두 인재 관련 정보로서 인재 정보처리 장 치로 전송될 수 있다. 인재 정보 처리부는 인재 발굴 또는 채용을 위한 키워드, 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교 중 하나 이상을 통해 검색될 수 있는 형태로 상기 인재 관련 빅데 이터를 변환할 수 있다. 또한 인재 정보 처리부는 인재 관련 빅데이터를 분석하여 상기 인재 정보 요청 신 호에 상응하는 인재 현황 정보를 생성할 수 있다. 인재 정보 처리부가 수집된 인재 관련 빅데이터를 변환함에 있어서, 하둡, HBASE, NoSql(Cassandra) 등이 이용될 수 있다. 하둡은 여러 개의 저렴한 컴퓨터를 마치 하나인 것처럼 묶어 대용량 데이터를 처리하는 기술이 다. 하둡은 수천대의 분산된 x86 장비에 대용량 파일을 저장할 수 있는 기능을 제공하는 분산파일 시스템과, 저 장된 파일 데이터를 분산된 서버의 CPU와 메모리 자원을 이용해 쉽고 빠르게 분석할 수 있는 컴퓨팅 플랫폼인 맵리듀스로 구성돼 있다. 하둡을 이용하면 대용량 데이터를 비교적 저렴한 비용으로 빠르게 처리할 수 있다. 이 외에도, 인재 정보 처리부는 데이터 수집을 위해서는 플럼을 이용하여 데이터 발생원으로부터 인재 관 련 데이터를 수집해 하둡 파일 시스템에 안정적으로 저장할 수 있다. 또한 인재 정보 처리부는 엘라스틱서 치를 이용하여 인재 관련 빅데이터에 대한 검색을 수행할 수 있다. 그리고 인재 정보 처리부는 HBASE나 카 산드라를 이용해 인재 관련 대용량 데이터를 분산된 서버에 구조적으로 저장함으로서 실시간 고속 저장이 가능 하고, 조회 기능이 구비된 구조적 데이터 저장소를 제공할 수 있다. 인재 정보 처리부가 인재 관련 정보 또는 인재 관련 빅데이터를 분석한다 함은 온톨로지 기반의 빅데이터 분석 방법을 채용함으로써, 구직자 관련 데이터가 구인기업이 원하는 조건에 해당하는지를 빠르게 분석해 낼 수 있다. 예컨대 구인 담당자가 인재 정보를 얻기 위해 키워드를 입력할 때, 입력되는 키워드가 추가될수록 인재 정보 처리 장치는 구인 담당자가 원하는 인재 정보를 정확히 파악할 수 있고, 노이즈가 제거되어 보다 정 확도가 높고 사용자의 니즈에 부합하는 인재 현황 정보를 생성하여 제공할 수 있게 된다. 인재 정보 처리부는 분석된 인재 관련 빅데이터를 기반으로, 인재 정보 요청 신호에서 요청받은 바에 부합 하는 인재 현황 정보를 생성한다. 인재 현황 정보는 특정 분야의 인재풀이 어떻게 형성되어 있는지를 나타내는 정보일 수 있다. 학위 또는 경력에 따라 특정 분야의 석사급, 박사급 인력이 몇명인지, 30대 전문 인력과 40대 전문인력은 각각 몇명인지, 어느 지 역에 분포하는지, 성별은 어떻게 되는지, 그리고 그 인력들은 각각 누구인지 등이 인재 현황 정보에 포함될 수 있다. 즉 인력 현황 정보는 기 입력받은 인재 정보 요청 신호에 포함되어 있던 키워드, 인재의 연구 분야, 업무 분야, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신학교, 구직 정보 중 하나 이상의 정보를 포함하며, 이 들 중 하나 이상의 기준에 의해 분류 또는 정렬된 정보일 수 있다. 인재 현황 정보는 어떤 키워드로 검색 시 검색 결과에 도출되는 인력인지, 전문 연구 분야, 업무분야 또는 세부 전공은 무엇인지, 인력의 연령대나 주요 경력, 현재 근무처가 어디인지, 현재 어떤 직장에 구직중인지 등에 대 한 정보를 포함할 수 있다. 인재 현황 정보는 밴다이어그램, 막대그래프, 띠그래프 등으로 시각화된 그래프 형태의 정보로 출력될 수 있다. 이에 대해서는 이후 도 5 및 도 6에서 부가적으로 설명하도록 한다. 인재 정보 처리 장치의 인재 정보 저장부는 변환된 인재 관련 정보 또는 인재 관련 빅데이터를 저장 한다. 그리고 인재 정보 저장부에 저장된 인재 관련 빅데이터는 주기적으로 업데이트 될 수 있다. 인재 정보 출력부는 인재 현황 정보를 출력한다. 앞서 설명한 바와 같이 인재 현황 정보는 인재의 분포나 각 인재들의 현재 상황에 대한 가독성 있는 정보를 제공할 수 있으며, 이를 위해 그래프 등의 형태로 시각화된 정보일 수 있다. 도 3은 도 1 및 도 2에서 설명한 본 발명의 일 실시예에 따른 인재 정보 처리 장치가 인재 정보를 수집하고 처 리하여 출력하는 과정을 설명하는 순서도이다. 인재 정보 처리 장치의 신호 입력부는 인재 정보 요청 신호를 입력받는다(S210). 인재 정보 요청 신 호는 앞서 설명한 바와 마찬가지로, 발굴하고자 하는 인재를 검색하기 위한 키워드일 수 있으며, 해당 인재의 연구 분야, 업무 분야, 세부 전공, 성명, 지역, 연령, 경력, 성과, 특허, 근무처, 출신 학교, 구직 여부 등에 대한 정보를 포함할 수 있다. 신호 입력부가 인재 정보 요청 신호를 입력받으면, 인재 정보 수집부는 일반 포털 사이트, 페이스북 이나 인스타그램, 링크드인과 같은 소셜 네트워크 서비스 사이트, 국내외 논문 검색 사이트, 구인 구직 전문 사 이트, 전문 보고서를 유료 또는 무료로 제공하는 각종 사이트 또는 그 서버로부터 해당 인재와 관련된 모든 정 보와 데이터를 전송받음으로써 인재 관련 정보를 수 집할 수 있다(S220). 여기서 인재 관련 정보는 대용량의 빅 데이터일 수 있다. 이후 수집한 정보는 추후에도 검색될 수 있는 형태로 변환되어 저장될 수 있으며(S230), 특히 빅데이터의 변환 과 분석에 필요한 여러 가지 도구들이 사용될 수 있다. 여기서는 예컨대 하둡, 카산드라, HBASE 등이 사용될 수 있다. 인재 정보 처리부가 인재 현황 정보를 생성하기 위해 변환된 인재 관련 정보를 분석함에 있어, 온톨로지에 기반한 빅데이터 분석 방법을 사용할 수 있다. 온톨로지에 기반한 빅데이터 분석 방법에 따르면, 사용자가 입력 한 키워드가 다른 분야의 용어와 혼동되거나 혼합되지 않으며, 키워드의 조합에 의해 사용자의 니즈를 유추하여, 사용자가 의도한 구직 대상자를 보다 정확하게 추출해낼 수 있게 된다. 이러한 과정을 통해 인재 정보 처리부는 인재 현황 정보를 생성할 수 있다(S240). 인재 정보 출력부는 위에서 생성된 인재 현황 정보를 출력한다(S250). 여기서 출력되는 인재 현황 정보는 채용 여부를 심사받을 인력들의 리스트일 수도 있고, 인력들의 분포나 경력 사항, 구직 여부, 현재 업무 등을 파악할 수 있는 그래프 등의 형태일 수도 있다. 도 4는 본 발명의 일 실시예에 따라 온톨로지 기반의 빅데이터 분석 방법에 의해 인재 관련 빅데이터를 수집하 고 처리하는 과정을 도시한 도면이다. 구인 담당자가 본 발명의 실시예에 따른 인재 정보 처리 장치 또는 방법을 통해 “3D 영상” 관련 전문 인력을 채용하고자 하는 경우, 온톨로지 기반의 분석 방법을 통해 결과를 도출하는 과정을 예시적으로 나타낸다. 사용자가 “3D” 만을 검색어로 입력하는 경우, 이는 3D 프린팅에 관한 검색 요청인지, 3D 영상에 대한 검색 요 청인지, 3D 홀로그램에 대한 검색 요청인지가 불분명하다. 이는 “3D 영상”으로 다시 검색되는 경우 사용자의 원래 의도와 무관한 검색 결과들은 자동으로 제거될 수 있다. 3D 영상 분야 안에서도 세부 분야들을 함께 검색하여, “3D 영상 변환”, “3D 영상 생성”, “3D 영상 디스플 레이 기기” 등을 함께 검색하며, 각각의 세부 분야에 대한 전문 인력을 결과로 도출하게 된다. 이로써 본 발명 의 실시예에 따르면 인재 정보 처리 장치는 사용자가 요구하는 바에 보다 정확하게 부합하는 인력 검색 결 과를 제공함은 물론, 보다 세분화된 검색에 대한 결과도 함께 제공할 수 있다. 그리고 인재 정보 처리 장치 는, 각각의 인력들에 대해 검색되는 모든 논문이나 기사, 보고서, 소셜 네트워크 서비스 게시물 등 방대한 양의 데이터를 빠른 시간 내에 저장하고 분석함으로써 정확하면서도 풍부한 인재 현황 정보를 생성하여 제공할 수 있게 된다. 도 5 및 도 6은 본 발명의 일 실시예에 따라 인재 현황 정보가 출력되는 모습을 도시한 도면이다. 도 5는 특정 업무 분야에 대한 국내외 전문 인력의 분포를 나타내며, 도 6은 국내 전문 인력의 분포를 나타낸다. 예컨대 도 5 및 도 6이 암세포 추적 기술에 대한 국내외 전문가의 근무 현황 별 분포를 나타내는 인 재 현황 정보라고 가정할 때, 도 5의 첫번째 벤다이어그램은 유럽 지역의 일반 기업 근무인력, 연구소 근 무인력, 대학교 근무인력의 분포를 나타낸다. 도 5의 두번째 벤다이어그램은 같은 분야의 인력에 대해아시아 지역의 일반 기업 근무인력, 연구소 근무인 력, 대학교 근무인력의 분포를 나타낼 수 있다. 마찬가지로 도 5의 세번째 벤다이어그램은 같은 분야 의 인력에 대해 북미 지역의 일반 기업 근무인력, 대학교 근무인력, 연구소 근무인력의 분포를 나타낼 수 있다. 각각의 벤다이어그램의 위치와 크기를 달리함으로써 각 지역에 분포하는 전문 인력의 수를 가시적으로 표현할 수 있으며, 각각의 벤다이어그램 안에서 연령, 경력, 성별, 근무처 등의 기준에 따라 인력의 분포를 세분화하여 나타낼 수 있다. 도 6에 도시된 국내 전문인력 분포를 나타내는 인재 현황 정보 역시 마찬가지로 해석될 수 있다. 도 6에 예시된 바에 따르면, 서울 경기 지역과 대전, 광주를 비교했을 때 각각의 벤다이어그램의 크기를 비교함 으로써 전문 인력의 분포 수를 한눈에 비교할 수 있다. 또한 각각의 벤다이어그램은 근무처, 연령, 성별, 경력, 세부 전공, 학위 등의 정보로 세분화될 수 있다. 도 6에 도시된 국내 인재 현황 정보 역시 근무처 유형에 따라 세분된다고 가정하였을 때, 암세포 추적 기술에 대한 서울 경기 지역에서의 국내 거주 전문 인력은 도 6의 첫번째 벤다이어그램을 통해 대학교 근무인력, 연구소 근무인력, 일반 기업 근무인력의 분포를 나타낼 수 있다. 암세포 추적 기술에 대한 대전, 충청 지역에서의 국내 거주 전문 인력은 도 6의 두번째 벤다이어그램을 통해 대 학교 근무인력, 연구소 근무인력, 일반 기업 근무인력의 분포를 나타낼 수 있다. 마찬가지로 암 세포 추적 기술에 대한 광주 지역에서의 국내 거주 전문 인력은 도 6의 세번째 벤다이어그램을 통해 대학교 근 무인력, 연구소 근무인력의 분포를 나타낼 수 있다. 도 7은 본 발명의 온라인 면접시스템을 설명하기 위한 기본 구성도이다. 본 발명의 온라인 면접 시스템은 면접단말기, 서비스 서버, 면접관 단말기를 포함하여 이루어지 며, 서비스 서버를 중심으로 네트워크를 통해 연결된다.서비스 서버는 면접 단말기에 면접을 위한 질문을 송신하게 된다. 면접 지원자는 면접 단말기를 통해 서비스 서버로부터 질문 정보 내지 지시사항에 받아, 이에 따라 면접 영상을 촬영하여 동영상 데이터를 형 성한다. 이러한 기본적인 구성은 온라인 면접 시스템의 일반적인 구성과 흐름이며, 본 발명 또한 이러한 구성을 가진다. 서비스 서버는 면접 단말기를 통해 질문 이외에도 면접 지원자의 필수적인 인적사항, 이력사항 등 구 직과정에서 일반적으로 요청하는 사항 등도 요청할 수 있음은 자명하다. 또한 이러한 자료를 면접관이 열람할 수 있도록 하는 등의 내용도 일반적으로 당업자입장에서 자명한 사실들이 며 이와 관련한 구체적인화면구성, 질문 체계, 입력 체계, 구체적 흐름도 등은 매우 다양하게 구성할 수 있을 것이며, 이러한 사항은 본발명의 핵심적인 기술적 구성을 모호하지 않게 하기 위해 생략한다. 서비스 서버는 면접 단말기로부터 받은 동영상 데이타를 저장하고, 상기 면접관 단말기에 송신 하게 된다. 면접관 단말기는 동영상 데이타를 받아 면접 평가를 하게 된다. 면접관 단말기는 면접을 위한 질문사항 내지 앞서 언급된 여러 가지 사항을 서비스 서버에 전송하여 서비스 서버로 하여금 면 접 단말기에 여러 가지 사항을 디스플레이하게 한다. 이러한 과정 역시 동영상 면접 시스템의 일반적인 흐 름도라고 할 수 있다. 본 발명의 핵심적인 기술 사상은 면접 단말기로 부터 받은 동영상 데이터를 어떻게 가공 편집하여, 면접관 단말기에 송신함으로써, 면접의 효율성과 정확성을 확보할 수 있게 하는 방식에 있다. 도 8은 본 발명의 면접 단말기의 구성도이다. 면접 단말기는 기본적으로 제어부, 통신모듈, 디스플레이모듈, 동영상모듈, 카메라모 듈, 저장모듈을 가질 수 있으며, 필요에 따라 다른 모듈 부분을 구성할 수 있다. 제어부는 각각 의 모듈들의 기능을 조율하고 제어한다. 각각의 모듈들은 공지되어 있는 형태의 것들이 채택가능하다. 면접 단말기는 기 설정된 장소에 설치된 단말기일 수도 있고, 면접 시스템의 플랫폼을 갖는 프로그램이 설 치된 데스크탑 컴퓨터이나 휴대가 가능한 스마트폰 같은 이동 단말기일 수 있으며, 복수개가 가능하다. 전체적인 면접 시스템은 플랫폼화되어 있는 형태가 바람직하며, 이러한 플랫폼이 면접 단말기에 설치되어 서비스 서버와 연동되게 될 것이다. 면접 단말기에서 생성하는 동영상 데이타는 영상 데이타와 음성 데이 타를 포함하고 있으며, 영상 데이타와 음성 데이타가 서로 대응되게 서로 인덱스 되어 있을 수 있다. 인덱스 방식은 시간을 매개로 인덱스 될 수 있으며, 또는 다양한 코딩 방식으로 인덱스 될 수 있다. 영상 데이 타와 음성 데이타가 결합된 형태로 서비스 서버로 송신되거나, 또는 분리되어 송신될 수도 있고, 결합된 형태의 것도 서비스 서버 내에서 분리될 수 있음은 자명하다. 면접 단말기에서 서비스 서버로 보내는 동영상 데이타는 질문에 대한 답변 부분만의 촬영만이 아니라, 면접질문의 내용이나, 질문을 파악하기 위해 소요되는 핸들링 타임(handling time)등의 시간들을 포함 되거나, 답변을 하지 못하고 있는 시간들이 있을 수 있고, 이러한 시간들은 아이들 타임(idle time;유휴시간)을 포함할 수 있게 된다. 면접 단말기의 제어부를 통해 촬영 시기의 시작과 종결을 지시함으로써 답변부분만을 촬영한다고 하 여도 다양한 형태의 아이들 타임은 발생하게 된다. 서비스 서버에서 개별 질문에 대한 답변시간을 설정하 여 이 경우에만 촬영하게 하는 방식을 사용하게 되는 경우라도 역시 다양한 형태의 아이들 타임이 발생할 수 있 다. 플랫폼의 방식을 개선하여 면접 단말기의 플로우를 조절 내지 제어한다고 하여도, 결국, 면접 단말기(10 0)에서 서비스 서버로 보내지는 동영상 데이타는 다양한 종류의 아이들 타임을 포함할 수 밖에 없다. 플랫 폼 방식을 개선하여 최소한의 아이들 타임을 갖게 할 수는 있겠으나, 이 경우, 면접지원자는 면접 응답 이외의 여러 가지 행위를 하여야 하고 이는 면접에 집중하지 못하게 하므로, 오히려 서비스 서버를 통해 동영상 데이타를 가공 편집하는 것이 바람직할 것으로 생각된다. 플랫폼의 형태는 일정한 질문을 영상이나 텍스트로 화면에 디스플레이하고, 이에 대한 답변을 일정시간 부여하 는 형태로 다음 질문으로 진행하는 형태가 될 것이다. 물론 다양한 형태의 플랫폼 설계가 가능할 것이지만, 여 전히 아이들 타임이 발생된다는 사실은 변함이 없을 것이다. 도 9는 본 발명의 서비스 서버의 구성도로서, 동영상 데이타의 가공 편집을 실행하는 핵심적인 부분이다. 본 발 명의 온라인 면접 시스템의 서비스 서버는 데이타 매칭부, 데이타 판별부, 데이타 추출부 및 데이타 병합부를 포함하고 있다. 데이타 매칭부는 수신받은 동영상 데이타에서 음성 데이타를 검출하여 상기 검출된 음성데이타를 텍스트 데이타로 변환하고, 해당 텍스트 데이타를 인덱스하되, 상기 인덱스는 상기 텍스트 데이타와 대응되는 상기 동 영상 데이타와 연계되어 인덱스 되게 하여야 한다. 이렇게 함으로써, 텍스트 데이타와 동영상 데이타는 연관성 있게 매칭되게 된다. 데이타 매칭부는 상기 과정을 수행하기 위한 보다 구체적인 기능부들(211, 212,)을 포함할 수 있다. 예컨대, 영상(video) 데이타와 음성(audio) 데이타를 포함하는 동영상 데이타에서, 음성 부분만을 검출하여 이 를 텍스트 데이타로 변환하기 위한 기능부를 포함할 수 있다. 이러한 기능을 수행하기 위한 모듈은 음성 데이타 를 검출하는 오픈 소스(예를 들면, FFmpeg 라이브러리), 음성 인식에 관한 다양한 오픈 소스(예를 들면, HTK 오 픈 소스)를 활용할 수 있으며, 이러한 부분은 공지의 사항으로 구체적으로 언급하지는 않는다. 상기 텍스트 데이타를 인덱스하는 방식은 여러가지 방식들이 있을 수 있다. 가장 편리한 방식은 시간을 함수로 인덱스 하는 방식일 것이다. 텍스트 데이타에 대한 대응되는 시간을 인덱스하고, 해당 인덱스는 동영상 데이타 의 인덱스와 대응되게 매핑화 내지 사상화함으로써, 텍스트 데이타와 동영상 데이타는 서로 매칭되어진다. 따라서, 텍스트 데이타의 가공 편집 형태를 동영상 데이타에 적용할 수 있게 된다. 시간을 함수로 인덱스 하는 경우에, 인덱스를 음절 단위나, 또는 어절 단위로 할 수도 있을 것이다. 즉, 텍스트 데이타의 어떤 위치의 음절 은 특정 시간의 인덱스를 가지게 되고, 해당 인덱스와 대응되는 동영상 데이타의 인덱스를 통해 가공 편집할 동 영상 데이타의 위치를 검출할 수 있게 된다. 데이타 판별부는 텍스트 데이타의 여러가지 특성을 평가하는 부분으로, 본 발명에서 동영상 데이타의 가공 편집의 기준은 텍스트 데이타의 특성을 파악하는데서 시작된다. 동영상 데이타의 가공편집을 위해 음성을 음향 음성학(acoustic phonetics)으로 분석하여 심리적 자신감이나 감정상태 등을 분석하는 것도 가능하다고 하나, 오류의 가능성이 높으며 객관적 기준이 정립되지 않은 상태이다. 또는 동영상 데이타의 가공편집을 위해 영상내의 면접 지원자의 움직임, 표정, 자세 등을 분석하여 이를 특정 기준에 맞춰 분석하는 것도 영상분석기술의 발달로 가능하다고 하나, 이 역시 오류의 가능성이 높고 객관적 기 준을 세우기 어렵다고 생각된다. 본 발명에서는 텍스트 데이타의 특성 파악을 통해, 아이들 타임 부분의 동영상을 제외하는 가공 편집을 함으로 써 면접관이 면접 평가를 하는 시간등을 줄일 수 있게 하는 것도 하나의 기술적 과제로 하고 있다. 그리고, 텍 스트 데이타의 특성 파악을 통해, 특정 답변을 포함하는 부분을 검색하는 가공 편집을 하여 보여주거나, 면접 질문에 대한 답변의 핵심적 사항만을 모아 하이라이트 형태로 가공 편집을 하여 보여주는 것도 가능하게 한다. 또한, 텍스트 데이타의 특성 분석을 통해 시스템적으로 평가항목에 대한 점수를 부여하는 방식등을 통해 면접 평가를 수행하는 것도 가능하다. 데이타 판별부는 텍스트 데이타를 분석하여 아이들 타임 부분을 평가할 수 있다. 플랫폼 내에서 아이들 타 임을 어떻게 정의하느냐에 따라 매우 다양한 아이들 타임을 평가할 수 있다. 가장 쉽게 생각할 수 있는 것은 질 문과 답변사이의 시간이 될 수 있다. 또한, 질문이 개시되는 시간도 면접관의 입장에서는 아이들 타임이 될 수 있다. 왜냐하면, 면접관은 이미 질문의 내용을 알고 있기 때문에 동영상 데이타에서 해당 부분은 불필요한 부분 일 수 있기 때문이다. 특정질문에 대한 답변시간을 제한하는 형태로 플랫폼이 설계되었다면, 답변시간이 지나지 않은 상황에서 이미 답변을 마쳤다면, 답변하지 않고 있는 시간 또한 아이들 타임이 될 수 있다. 앞서 언급하였듯이 텍스트 데이타 를 시간의 함수로 인덱스 한 경우, 각각의 인덱스 사이의 시간의 간격을 함수로 하여 평가함으로써 이러한 아이 들 타임을 찾아낼 수 있다. 물론, 다른 여러 가지 알고리즘을 통해 아이들 타임을 찾아 내는 것도 가능할 것이다. 예를 들면, 텍스트 데이 타의 분석 내지 평가에 있어서, 문장 단위 또는 어절 단위를 함수로 하여 평가할 수 있을 것이다. 문장은 기본 적으로 특정 생각을 내포하는 단위로 이해되기 때문에 문장 사이의 간격은 아이들 타임이 될 수 있다. 어절의 경우에도 생각이 포함되는 단어를 포함하고 있을 수 있으므로, 보다 많은 연구를 통해 어절 분석의 방식이 객관 화된다면 충분히 사용가능한 함수가 될 것이다. 데이타 추출부는 데이타 판별부의 평가에 따라 동영상 데이타의 특정 부분을 추출할 수 있고, 추출된 동영상 데이타를 필요에 따라 선택하거나 버릴 수 있는 기능을 한다. 동영상 데이타의 특정 부분을 추출하기 위 한 전제는 텍스트 데이타의 평가 내지 분석이 전제되어야 하므로, 순서상으로는 텍스트 데이타의 추출이 먼저이 루어질 것이고, 추출된 텍스트 데이타의 인덱스와 대응되는 동영상 데이타의 인덱스를 찾아 동영상 데이타를 추 출하게 될 것이다. 앞서 언급된 아이들 타임의 평가를 예로 들면, 아이들 타임에 해당하는 부분과 대응되는 동영상 데이타를 버리 거나, 또는 아이들 타임이 아닌 부분에 해당하는 부분과 대응되는 동영상 데이타를 추출하게 될 것이다. 데이타 병합부는 데이타 추출부를 통해 얻어진 동영상 데이타들을 병하여 새로운 동영상 데이타를 구 성하는 역할을 한다. 데이타 병합에 대한 오픈 소스를 활용하여 병합모듈을 구성할 수 있음은 물론이며, 이러한 사항은 발명의 요지를 모호하지 않게 하기 위해 생략한다. 기타 서비스 서버는 여러가지 기능부를 포함할 수 있다. 상기 추출하여 병합된 새로운 동영상 데이타에 대하여 코딩을 하여 새로운 이름으로 저장하는 DB를 포함할 수 있으며, 그 밖에 온라인 면접 시스템의 편리성을 위해 구현될 수 있는 다양한 플랫폼의 기능을 위한 요소들을 구비할 수 있음은 물론이다. 도 10은 본 발명의 면접관 단말기의 구성도로서, 온라인 면접 시스템을 위한 다양한 기능을 갖춘 모듈을 구비할 수 있다. 본 발명에서는 특히, 서비스 서버 대하여 동영상 데이타를 필요에 맞게 가공을 하도록 요청하는 데이타 편 집 요청부를 구비하고 있다. 데이타 편집 요청부가 특정 조건을 만족하는 요청을 하게되는 경우, 텍 스트 데이타와 요청 조건을 대비하여 평가함으로서 특정 조건 구간의 텍스트 데이타 구간을 찾을 수 있고, 마찬 가지 방식으로 요청 조건을 만족하는 동영상 데이타를 추출하여 이를 병합하여 제공할 수 있을 것이다. 면접관 단말기는 기업이나 공공기관의 특정서버와 연동되는 형태의 단말기일 수도 있다. 기업이나 공공기 관이 복수일 있고, 단수인 경우라면 면접관 단말기는 복수개의 형태일 수 있다. 상기 데이타 편집 요청부는 특별히 면접 단말기를 통해 동영상 데이타가 서비스 서버에 저장된 이후 이의 가공 편집을 요청하는 경우일 수 있다. 특정 키워드를 포함하는 동영상 구간을 요청하는 경우, 앞서 설명한 바와 마찬가지로, 텍스트 데이타와 대비하여 텍스트 데이타를 추출한 후에 이에 대응되는 동영상 데이타 를 추출하는 방식이 될 것이다. 키워드를 포함하는 동영상 구간의 설정의 경우, 선택되는 텍스트 데이타는 음절이나, 어절 단위가 아니라 최소 문장단위로 선택되어야 할 것이다. 좀 더 확장하여 문단 단위의 것이 바람직할 것이다. 이를 찾아내는 알고리즘 은 시간 간격을 함수로 하는 알고리즘이 바람직할 것이다. 생각이나 사상이 전환되는 시기에 어느 정도의 시간 간격이 있을 수 있고, 이러한 시간 간격을 파악하는 알고리즘을 통해 텍스트 데이타의 선택단위를 결정할 수도 있을 것이다. 최근에는 텍스트 데이타의 의미 분석 기술이 발달하여, 특정 키워드를 포함하는 부분과 연관성이 있는 텍스트를 추출하는 기술도 발달하였기 때문에 이러한 기술을 이에 응용할 수도 있을 것이며, 이러한 부분 은 본 발명의 기술적 사상내의 것으로 해석되어야 할 것이다. 한편, 통상적으로 면접단말기를 통한 면접 지원자의 면접이 이루어지기 전에 면접관 단말기 내지 면접 관단말기와 연동되는 다른 서버를 통해 서비스 서버에 질문사항 내지 기타 사항이 이미 전달된다. 따라서, 면접관 단말기의 데이타 편집 요청부에서 기 저장된 질문지와 이에 대응하는 평가항목을 만 족하는 동영상 구간을 요청할 수 있다. 이 경우, 면접관 단말기에서 받아 볼 수 있는 동영상 데이타는 면 접 지원자의 답변의 하일라이트만을 추출한 형태의 동영상 데이타일 수 있다. 데이타 판별부의 평가 방법 이나, 데이타 추출부의 추출방식은 앞서 언급한 형태의 것들이 응용될 수 있을 것이다. 온라인 면접 시스템의 플랫폼의 구현 방식의 변화를 통해, 미리 서비스 서버에서 하일라이트 영상을 추출 하는 알고리즘을 구비하도록 하여 하일라이트 영상을 별도로 저장하는 방식도 가능하다. 데이타 편집 요청부 는 면접관 단말기를 통해 해당 동영상 데이타를 선택할 수 있다. 필요에 따라서는 아이들 타임이 포 함된 원본의 동영상 데이타를 통해 보다 심도있는 선택을 할 필요성이 있을 경우라면, 원본 동영상 데이타를 선 택할 수 있을 것이다. 기 저장된 질문지의 요지를 추출하고, 텍스트 데이타를 대비 비교하여 이의 일치 정도의 판별을 통해 면접 지원자의 역량을 수치화하는 형태도 가능할 것이다. 텍스트 데이타의 특성을 평가하는 데이타 판별부를 통해 이러한 기능의 수행이 가능할 것이다. 따라서, 데 이타 판별의 알고리즘에 따라 면접 자동평가시스템의 형태나 오토 헤드헌팅 시스템에 적용할 수도 있으며, 질문과 평가항목의 선정에 따라 구직자 매칭시스템에 적용도 가능하다. NCS(National competency stanadards; 국가직무능력표준)은 그 분류체계 및 구성이 매우 잘 이루어져 있기 때 문에 본 발명의 기술개념을 사용하여 온라인 면접시스템에 적용하는 경우라면, 정확성과 효율성이 높아진 면접 자동평가시스템으로의 구현도 가능할 것으로 보인다. 적용 형태에 따라 실제 채용은 물론, 면접트레이닝용으로도 충분히 적용할 수 있다. 그리고, 데이타 판별부 를 통해 욕설 등의 불건전한 요소를 포함하는 경우를 추출하여 이를 평가항목에 추가할 수도 있을 것이다. 본 발명은 면접 지원자가 서비스 서버로부터 질문정보를 수신하여 이에 대응하는 면접 영상을 촬영한 동영상 데 이타를 형성하며, 네트워크를 통해 상기 동영상 데이타를 수신하여 저장하고 상기 동영상 데이타를 가공편집하 며, 네트워크를 통해 상기 서비스 서버로부터 상기 가공편집된 동영상 데이타를 수신하되, 상기 동영상 데이타 를 가공편집하는 측면에서는, 상기 동영상 데이타의 음성 데이타를 검출하여 상기 검출된 음성데이타를 텍스트 데이타로 변환하고 텍스트 데이타를 인덱스 하며, 상기 인덱스된 텍스트 데이타와 대응되는 상기 동영상 데이타 를 연계하여 인덱스화하여 텍스트 데아타와 동영상 데이타를 매칭하고 상기 텍스트 데이타의 특성을 평가하며, 상기 데이타 특성의 평가에 따라 텍스트 데이타를 선택하고 상기 선택된 텍스트 데이타의 인덱스와 대응되는 동 영상 데이타를 추출하며, 상기 추출된 동영상 데이타들을 병합하는 플랫폼을 구축할 수 있다."}
{"patent_id": "10-2019-0074135", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따라 인재 정보를 수집할 수 있는 여러 소스와 연결을 유지하는 인재 정보 처리 장치를 나타낸 도면, 도 2는 도 1의 인재 정보 처리 장치를 설명하는 블록도, 도 3은 도 2의 인재 정보 처리 장치가 정보를 수집 및 처리하여 인재 관련 정보를 생성하는 과정을 설명하는 순 서도, 도 4는 인재 관련 빅데이터를 추출하고 분석하는 과정을 나타낸 도면, 도 5는 본 발명의 일 실시예에 따라 생성 및 출력된 인재 현황 정보의 예시를 나타낸 도면, 도 6은 본 발명의 일 실시예에 따라 생성 및 출력된 인재 현황 정보의 다른 예시를 나타낸 도면, 도 7은 본 발명의 온라인 면접시스템을 설명하기 위한 기본 구성도, 도 8은 본 발명의 면접 단말기의 구성도, 도 9는 본 발명의 서비스 서버의 구성도, 도 10 본 발명의 면접관 단말기의 구성도이다."}
