{"patent_id": "10-2021-0062223", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0154541", "출원번호": "10-2021-0062223", "발명의 명칭": "호흡 감지 기반의 차량용 다중화자 분별 방법 및 지능형 차량", "출원인": "한국자동차연구원", "발명자": "이예쁜"}}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량내 탑승자 정보를 개별 감지하는 탑승자 감지 모듈;차량 내 음성을 인식하는 음성인식 모듈; 및상기 음성으로부터 음성명령을 인식하고, 상기 음성을 인식할 때 감지된 탑승자 정보를 이용하여 화자의 위치를판단하고, 상기 화자의 위치를 이용하여 상기 인식된 음성명령을 분석하고, 상기 인식된 음성명령에 대응하는제어명령을 생성하는 제어모듈을 포함하는 차량 제어 장치."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 탑승자 감지 모듈은,차량 내 개별 탑승자 각각의 생체정보를 감지하는 차량 제어 장치."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 탑승자 감지 모듈은,각 탑승 위치에 장착된 레이더를 이용하여 해당 위치에 탑승한 탑승자의 호흡을 감지하거나, 각 탑승 위치에 장착된 각 좌석벨트의 압력 변화를 이용하여 각 탑승자의 호흡을 감지하는 차량 제어 장치."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어모듈은,상기 음성을 인식할 때, 해당 음성을 발화시 생성되는 호흡패턴이 감지되는 탑승자의 탑승 위치를 화자의 위치로 판단하는 차량 제어 장치."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제어모듈은,복수의 음성이 인식되는 경우, 각 음성을 구별하여 각 음성에 대응하는 상기 탑승자 정보의 변화가 감지되는 탑승자의 위치를 각 음성을 발화한 화자의 위치로 판단하는 차량 제어 장치."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "차량내 탑승자를 개별 감지하는 탑승자 감지 모듈;차량 내 음성을 인식하는 음성인식 모듈; 및상기 음성으로부터 음성명령을 인식하고, 상기 음성을 인식할 때 감지된 탑승자의 변화를 이용하여 화자의 위치를 판단하고, 상기 화자의 위치를 이용하여 상기 인식된 음성명령을 분석하고, 상기 인식된 음성명령에 대응하는 제어명령을 생성하는 제어모듈을 포함하는 지능형 차량."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,공개특허 10-2022-0154541-3-상기 탑승자 감지 모듈은,각 탑승 위치에 장착된 레이더를 이용하여 해당 위치에 탑승한 탑승자의 호흡을 감지하거나, 각 탑승 위치에 장착된 각 좌석벨트의 압력 변화를 이용하여 각 탑승자의 호흡을 감지하고,상기 제어모듈은,상기 음성을 인식할 때, 해당 음성을 발화시 생성되는 호흡패턴이 감지되는 탑승자의 탑승 위치를 화자의 위치로 감지하는 지능형 차량."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "차량내 탑승자 정보를 개별 감지하는 단계;차량 내 음성을 인식하는 단계;상기 음성으로부터 음성명령을 인식하는 단계;상기 음성을 인식할 때 감지된 탑승자 정보를 이용하여 화자의 위치를 판단하는 단계;상기 화자의 위치를 이용하여 상기 인식된 음성명령을 분석하는 단계; 및상기 인식된 음성명령에 대응하는 제어명령을 생성하는 단계를 포함하는 차량 제어 방법."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 차량내 탑승자 정보를 개별 감지하는 단계는,각 탑승 위치에 장착된 레이더를 이용하여 해당 위치에 탑승한 탑승자의 호흡을 감지하거나, 각 탑승 위치에 장착된 각 좌석벨트의 압력 변화를 이용하여 각 탑승자의 호흡을 감지하는 차량 제어 방법."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 화자의 위치를 판단하는 단계는,상기 음성을 인식할 때, 해당 음성을 발화시 생성되는 호흡패턴이 감지되는 탑승자의 탑승 위치를 화자의 위치로 판단하는 차량 제어 방법."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 화자의 위치를 판단하는 단계는,복수의 음성이 인식되는 경우, 각 음성을 구별하여 각 음성에 대응하는 상기 탑승자 정보의 변화가 감지되는 탑승자의 위치를 각 음성을 발화한 화자의 위치로 판단하는 차량 제어 방법."}
{"patent_id": "10-2021-0062223", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항 내지 제10항 중에 어느 한 항의 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수있는 기록매체."}
{"patent_id": "10-2021-0062223", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 차량 제어 장치는 차량내 탑승자 정보를 개별 감지하는 탑승자 감지 모듈, 차량 내 음성을 인식하는 음성인식 모듈, 및 상기 음성으로부터 음성명령을 인식하고, 상기 음성을 인식할 때 감지된 탑 승자 정보를 이용하여 화자의 위치를 판단하고, 상기 화자의 위치를 이용하여 상기 인식된 음성명령을 분석하고, 상기 인식된 음성명령에 대응하는 제어명령을 생성하는 제어모듈을 포함한다."}
{"patent_id": "10-2021-0062223", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량 제어 장치, 차량 제어 방법 및 지능형 차량에 관한 것으로, 보다 구체적으로 탑승자의 정보를 기반으로 다중화자를 분별하여 음성 명령에 따라 차량 제어를 제공하는 차량 제어 장치, 차량 제어 방법 및 이 를 적용한 지능형 차량에 관한 발명이다."}
{"patent_id": "10-2021-0062223", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능기술이 발전하며, 자율형 차량 등 지능형 차량에 대한 연구가 활발히 진행되고 있다. 차량 탑승자의 음 성을 인식하여, 음성명령에 따라 차량 내 구성요소를 제어하는 음성인식 기능이 지능형 차량에 적용되고 있다. 또, 차량내 탑승자 생체신호 계측기술이 발전하면서, 탑승자 정보를 이용하여 상황에 맞는 편의 기능을 제공하 기 위한 지능형 차량 서비스 개발이 활발하다. 차량 내 탑승자가 다수이고, 다수가 말을 하고 있는 상황에서 차량에 명령을 발화하고 있는 화자가 누구인지를 구분하지 못하는 경우, 화자가 아닌 다른 탑승자에 대해 음성명령에 따른 제어가 이루어지는 등 문제가 발생할 수 있다. 따라서, 음성명령을 내리는 화자의 위치를 분별하여 화자의 의도에 맞게 차량을 제어하는 기술이 필요하다."}
{"patent_id": "10-2021-0062223", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는, 탑승자의 정보를 기반으로 다중화자를 분별하여 음성 명령에 따라 차량 제어를 제공하는 차량 제어 장치, 차량 제어 방법 및 이를 적용한 지능형 차량을 제공하는 것이다."}
{"patent_id": "10-2021-0062223", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 해결하기 위하여, 본 발명의 일 실시예에 따른 차량 제어 장치는 차량내 탑승자 정보를 개 별 감지하는 탑승자 감지 모듈; 차량 내 음성을 인식하는 음성인식 모듈; 및 상기 음성으로부터 음성명령을 인 식하고, 상기 음성을 인식할 때 감지된 탑승자 정보를 이용하여 화자의 위치를 판단하고, 상기 화자의 위치를 이용하여 상기 인식된 음성명령을 분석하고, 상기 인식된 음성명령에 대응하는 제어명령을 생성하는 제어모듈을 포함한다. 또한, 상기 탑승자 감지 모듈은, 차량 내 개별 탑승자 각각의 생체정보를 감지할 수 있다. 또한, 상기 탑승자 감지 모듈은, 각 탑승 위치에 장착된 레이더를 이용하여 해당 위치에 탑승한 탑승자의 호흡 을 감지하거나, 각 탑승 위치에 장착된 각 좌석벨트의 압력 변화를 이용하여 각 탑승자의 호흡을 감지할 수 있 다. 또한, 상기 제어모듈은, 상기 음성을 인식할 때, 해당 음성을 발화시 생성되는 호흡패턴이 감지되는 탑승자의 탑승 위치를 화자의 위치로 판단할 수 있다. 또한, 상기 제어모듈은, 복수의 음성이 인식되는 경우, 각 음성을 구별하여 각 음성에 대응하는 상기 탑승자 정 보의 변화가 감지되는 탑승자의 위치를 각 음성을 발화한 화자의 위치로 판단할 수 있다. 상기 기술적 과제를 해결하기 위하여, 본 발명의 일 실시예에 따른 지능형 차량은 차량내 탑승자를 개별 감지하 는 탑승자 감지 모듈; 차량 내 음성을 인식하는 음성인식 모듈; 및 상기 음성으로부터 음성명령을 인식하고, 상 기 음성을 인식할 때 감지된 탑승자의 변화를 이용하여 화자의 위치를 판단하고, 상기 화자의 위치를 이용하여 상기 인식된 음성명령을 분석하고, 상기 인식된 음성명령에 대응하는 제어명령을 생성하는 제어모듈을 포함한다. 또한, 상기 탑승자 감지 모듈은, 각 탑승 위치에 장착된 레이더를 이용하여 해당 위치에 탑승한 탑승자의 호흡 을 감지하거나, 각 탑승 위치에 장착된 각 좌석벨트의 압력 변화를 이용하여 각 탑승자의 호흡을 감지하고, 상 기 제어모듈은, 상기 음성을 인식할 때, 해당 음성을 발화시 생성되는 호흡패턴이 감지되는 탑승자의 탑승 위치 를 화자의 위치로 감지할 수 있다. 상기 기술적 과제를 해결하기 위하여, 본 발명의 일 실시예에 따른 차량 제어 방법은 차량내 탑승자 정보를 개 별 감지하는 단계; 차량 내 음성을 인식하는 단계; 상기 음성으로부터 음성명령을 인식하는 단계; 상기 음성을 인식할 때 감지된 탑승자 정보를 이용하여 화자의 위치를 판단하는 단계; 상기 화자의 위치를 이용하여 상기 인 식된 음성명령을 분석하는 단계; 및 상기 인식된 음성명령에 대응하는 제어명령을 생성하는 단계를 포함한다. 또한, 상기 차량내 탑승자 정보를 개별 감지하는 단계는, 각 탑승 위치에 장착된 레이더를 이용하여 해당 위치 에 탑승한 탑승자의 호흡을 감지하거나, 각 탑승 위치에 장착된 각 좌석벨트의 압력 변화를 이용하여 각 탑승자의 호흡을 감지할 수 있다. 또한, 상기 화자의 위치를 판단하는 단계는, 상기 음성을 인식할 때, 해당 음성을 발화시 생성되는 호흡패턴이 감지되는 탑승자의 탑승 위치를 화자의 위치로 판단할 수 있다. 또한, 상기 화자의 위치를 판단하는 단계는, 복수의 음성이 인식되는 경우, 각 음성을 구별하여 각 음성에 대응 하는 상기 탑승자 정보의 변화가 감지되는 탑승자의 위치를 각 음성을 발화한 화자의 위치로 판단할 수 있다."}
{"patent_id": "10-2021-0062223", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 화자의 탑승위치를 기반으로 음성 명령에 적합한 차량 제어를 제공할 수 있다. 또한, 다중화자의 음성명령에서 화자를 분별하여 발화자의 의도를 정확히 판단할 수 있다."}
{"patent_id": "10-2021-0062223", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 기술 사상은 설명되는 일부 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 기술 사상 범위 내에서라면, 실시 예들간 그 구성 요소들 중 하나 이상을 선택적으로 결합 또는 치환하여 사용할 수 있다. 또한, 본 발명의 실시예에서 사용되는 용어(기술 및 과학적 용어를 포함)는, 명백하게 특별히 정의되어 기술되"}
{"patent_id": "10-2021-0062223", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "지 않는 한, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 일반적으로 이해될 수 있는 의미로 해 석될 수 있으며, 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미를 고려 하여 그 의미를 해석할 수 있을 것이다. 또한, 본 발명의 실시예에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함할 수 있고, \"A 및(와) B, C 중 적어 도 하나(또는 한 개 이상)\"로 기재되는 경우 A, B, C로 조합할 수 있는 모든 조합 중 하나 이상을 포함할 수 있 다. 또한, 본 발명의 실시 예의 구성 요소를 설명하는데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성요소 의 본질이나 차례 또는 순서 등으로 한정되지 않는다. 그리고, 어떤 구성 요소가 다른 구성 요소에 '연결', '결합', 또는 '접속'된다고 기재된 경우, 그 구성 요소는 그 다른 구성 요소에 직접적으로 '연결', '결합', 또는 '접속'되는 경우뿐만 아니라, 그 구성 요소와 그 다른 구성 요소 사이에 있는 또 다른 구성 요소로 인해 '연결', '결합', 또는 '접속'되는 경우도 포함할 수 있다. 또한, 각 구성 요소의 \"상(위)\" 또는 \"하(아래)\"에 형성 또는 배치되는 것으로 기재되는 경우, \"상(위)\" 또는 \"하(아래)\"는 두 개의 구성 요소들이 서로 직접 접촉되는 경우뿐만 아니라, 하나 이상의 또 다른 구성 요소가 두 개의 구성 요소들 사이에 형성 또는 배치되는 경우도 포함한다. 또한, \"상(위)\" 또는 \"하(아래)\"로 표현되는 경우 하나의 구성 요소를 기준으로 위쪽 방향뿐만 아니라 아래쪽 방향의 의미도 포함될 수 있다. 도 1은 본 발명의 일 실시예에 따른 차량 제어 장치의 블록도이다. 본 발명의 일 실시예에 따른 차량 제어 장치는 탑승자 감지 모듈, 음성인식 모듈, 및 제어모듈 로 구성된다. 본 발명의 실시예에 따른 차량 제어 장치는 지능형 차량을 제어할 수 있다. 여기서, 지능형 차량은 탑승자의 음 성 명령 내지 인터페이스를 통한 명령에 따라 차량을 제어하는 차량으로, 운전자 없이 차량을 운행하는 자율형 차량일 수 있다. 지능형 차량이외에 음성 명령에 따라 차량 내지 차량의 구성요소를 제어하는 차량이면 본 발명 의 실시예에 따른 차량 제어 장치가 적용될 수 있음은 당연하다. 탑승자 감지 모듈은 차량내 탑승자 정보를 개별 감지한다. 보다 구체적으로, 탑승자 감지 모듈은 차량 내 탑승하고 있는 탑승자들을 개별 감지하여, 현재, 탑승 자들의 탑승자 정보 내지 탑승자 정보의 변화를 각각 감지한다. 여기서, 탑승자는 차량 내 탑승한 자를 의미하고, 제1 탑승자 및 제2 탑승자와 같이, 복수의 탑승자 가 탑승 중인 경우, 각각의 탑승자에 대한 탑승자 정보를 개별 감지한다. 여기서, 복수의 탑승자를 제1 탑승자 및 제2 탑승자로 도시하였으나, 차량의 탑승인원에 따라 한 명의 탑승자일 수 있고, 3명 이상의 탑 승자일 수 있다. 복수의 탑승자 중 특정 탑승 위치에 위치한 탑승자에 대해서만 탑승자 정보를 감지할 수도 있 다. 예를 들어, 창가에 앉은 탑승자에 대해서만 개별 감지할 수 있다. 탑승자는 운전자 또는 동승자일 수 있고, 운전자가 없는 자율형 차량의 경우, 모두 탑승자일 수 있다. 탑승자 감지 모듈은 차량 내 개별 탑승자 각각의 생체정보를 감지할 수 있다. 탑승자 감지 모듈은 탑 승자를 구분하여 화자를 판단하기 위하여, 탑승자가 발화를 할때, 변화가 발생하는 생체정보를 감지한다. 화자 가 말을 할때, 입을 통해 음성이 외부로 전달되는바, 탑승자의 호흡을 감지할 수 있다. 이외에, 탑승자의 움직 임이나, 체온 등 탑승자의 다양한 생체정보를 감지할 수도 있다. 음성과 관련이 없는 생체정보는 탑승자를 모니 터링하는 정보로 이용될 수 있다. 탑승자 감지 모듈은 실시간 또는 미리 설정된 주기로 탑승자의 생체정보 를 감지할 수 있다. 또는, 음성인식 모듈이 음성을 인식할 때, 탑승자의 탑승자 정보를 감지할 수도 있다. 탑승자 감지 모듈은 탑승자를 구분하여 화자를 판단하기 위하여, 각 탑승자의 호흡을 감지함에 있어서, 각 탑승 위치에 장착된 레이더를 이용하여 해당 위치에 탑승한 탑승자의 호흡을 감지하거나, 각 탑승 위치에 장착 된 각 좌석벨트의 압력 변화를 이용하여 각 탑승자의 호흡을 감지할 수 있다. 탑승자가 말을 하지 않을 때와 말을 하는 발화시 호흡이 달라진다. 탑승자 감지 모듈은 레이더(radar)를 이용하여 탑승자의 호흡을 감지할 수 있다. 이때, 레이더는 초광대역 UWB(Ultra-Wide Band) 레이더를 이용하여 탑승자의 호흡을 감지할 수 있다. 초광대역 레이더 신호를 탑승자에 송신후 반사되어 수신되는 신호를 이용하여 탑승자의 실제 위치와 모양을 확인할 수 있고, 호흡시 변하는 모양 또는 호흡시 입이나 코에서 방출되는 기체의 움직임을 감지하여 탑승자의 호흡을 감지할 수 있다. 이외에, 라이다(Lidar), 카메라 등 차량 내 탑승 위치를 감지하는 다양한 센서 내지 장치들을 이용하여 탑승자의 호흡을 감지할 수 있다. 또한, 탑승자 감지 모듈은 좌석벨트의 압력 변화를 이용하여 탑승자의 호흡을 감지할 수 있다. 탑승자가 탑승 위치에 탑승하여 좌석벨트를 착용하면, 좌석벨트는 탑승자의 신체에 밀착되며, 호흡시, 좌석벨트에 가해지 는 압력이 호흡에 따라 달라지는 것을 이용하여 탑승자의 호흡을 감지할 수 있다. 탑승자가 생체정보를 감지하는 웨어러블 디바이스를 장착하고 있는 경우, 해당 웨어러블 디바이스와의 통신을 통해 해당 탑승자의 생체정보를 감지할 수도 있다. 탑승자 감지 모듈은 탑승자의 탑승 위치를 구분하여 탑승자의 정보를 감지할 수 있다. 탑승자 감지 모듈 은 화자가 어느 탑승 위치에 탑승한 탑승자인지를 구분하기 위해 탑승자 정보를 감지하는바, 탑승자의 탑 승 위치를 구분하여 각 탑승자의 정보를 감지한다. 즉, 제1 탑승 위치에 탑승한 제1 탑승자의 탑승자 정보 와 제2 탑승 위치에 탑승한 제2 탑승자의 탑승자 정보를 구분한다. 음성인식 모듈은 차량 내 음성을 인식한다. 보다 구체적으로, 음성인식 모듈은 차량 내에서 감지되는 소리 중 음성에 해당하는 소리를 감지하여, 음성 을 인식한다. 음성을 인식하면 제어모듈로 인식된 음성을 전송한다. 음성인식 모듈은 마이크로 형성 되어, 차량 내에 장착될 수 있다. 음성인식 모듈은 차량 전체에 하나 이상 장착되거나, 탑승 위치별로 장 착될 수 있다. 음성인식 모듈은 음성을 인식시, 인식된 음성 이외의 소리는 노이즈로 처리하거나, 음성이 발생하는 방향으로 빔 포밍을 수행하여 음성의 정확성을 높일 수 있다. 음성인식 모듈은 인식되는 음성이복수인 경우, 각 음성을 구분하여 인식할 수 있다. 제어모듈은 상기 음성으로부터 음성명령을 인식하고, 상기 음성을 인식할 때 감지된 탑승자 정보를 이용하 여 화자의 위치를 판단하고, 상기 화자의 위치를 이용하여 상기 인식된 음성명령을 분석하고, 상기 인식된 음성 명령에 대응하는 제어명령을 생성한다. 보다 구체적으로, 제어모듈은 탑승자 감지 모듈로부터 각 탑승자(210, 220)의 탑승자 정보를 수신하 고, 음성인식 모듈로부터 인식된 음성을 수신한다. 제어모듈은 인식된 음성으로부터 음성명령을 인식 한다. 음성에 대한 자연어 처리를 통해, 음성을 텍스트로 변환하여, 음성명령으로 인식할 수 있다. 음성은 음성 인식 모듈로부터 수신하는 것으로, 어떤 탑승자가 화자인지에 대한 정보를 포함하고 있지 않다. 제어모듈 은 탑승자 감지 모듈로부터 수신한 탑승자 정보를 이용하여 화자의 위치를 판단한다. 음성인식 모듈이 음성을 인식하는 시점에 화자에 해당하는 탑승자의 탑승자 정보에 변화가 발생하는바, 제 어모듈은 음성을 발화시 생성되는 호흡의 변화가 확인되는 탑승자 정보에 해당하는 탑승자를 화자로 판단 할 수 있다. 즉, 음성 인식 시점과 탑승자 정보의 동기화를 통해 화자를 감지할 수 있다. 제어모듈은 상기 음성을 인식할 때, 해당 음성을 발화시 생성되는 호흡패턴이 감지되는 탑승자의 탑승 위 치를 화자의 위치로 판단할 수 있다. 음성에 포함되는 음절의 길이, 높낮이, 음절 사이의 간격 등에 따라 호흡 패턴이 달라지는바, 해당 음성을 발화시 생성되는 호흡패턴을 도출하고, 해당 호흡패턴이 감지되는 탑승자의 탑 승 위치를 화자의 위치로 판단할 수 있다. 제어모듈은 복수의 음성이 인식되는 경우, 각 음성을 구별하여 각 음성에 대응하는 상기 탑승자 정보의 변 화가 감지되는 탑승자의 위치를 각 음성을 발화한 화자의 위치로 판단할 수 있다. 한 명의 탑승자가 아닌 복수 의 탑승자(210, 220)가 모두 말을 하는 다중화자가 있는 경우, 음성인식 모듈은 복수의 음성을 각각 인식 하거나, 전체 음성을 하나의 음성으로 인식할 수 있다. 제어모듈은 음성을 구분하거나, 음성인식 모듈 로부터 수신하는 각각의 음성을 각각 탑승자의 정보들과 비교하여 각 음성의 화자를 구분할 수 있다. 각 음성을 구별하고, 각 음성에 대응하는 호흡패턴이 감지되는 각각의 탑승자의 탑승 위치를 각 음성의 화자의 위 치로 판단할 수 있다. 제어모듈은 화자의 위치를 이용하여 인식된 음성명령을 분석할 수 있다. 음성명령이 동일하더라도 각 탑승 위치마다 제어해야 하는 차량의 구성요소가 달라질 수 있는바, 화자의 위치는 음성명령을 정확히 감지하는 중요 한 요소이다. 예를 들어, 인식된 음성명령이 '창문 열어줘'인 경우, 어떤 탑승 위치의 창문을 열지를 알 수 없 다. 이때, 탑승자 정보를 이용하여 '창문 열어줘'를 말한 화자의 위치를 알 수 있는바, 음성명령에서 창문이 특 정되지 않았다 하더라도 화자가 탑승한 위치의 창문을 열라는 음성명령으로 판단할 수 있고, 그에 대응하도록 해당 위치의 윈도우을 개방하는 제어명령을 생성하여, 해당 윈도우의 개방하는 모터를 동작시켜 윈도우를 개방 할 수 있다. 또한, 뒷자리 우측 탑승자가 '소리 좀 키워줘'라고 말하는 경우, '소리 좀 키워줘'라는 음성명령을 인식하고, 탑승자의 정보를 이용하여 화자가 뒷자리 우측 탑승자인 것으로 판단할 수 있고, 뒷자리 우측 볼륨만 키워줄 수 있다. 또한, 운전석의 탑승자가 ‘목적지를 집으로 바꿔줘’라고 말하는 경우 , ‘목적지를 집으로 바꿔줘’라는 음성 명령을 인식하고, 탑승자 정보를 이용하여 화자가 운전자인 것으로 판단할 수 있고, 목적지를 변경해 줄 수 있 다. 단, 운전석 이외의 탑승자가 동일한 명령을 했을 경우, 탑승자 정보를 이용하여 화자가 동승자인 것으로 판 단할 수 있고, 목적지 변경과 같은 주행에 있어 중요한 명령은 받아들이지 않을 수 있다. 또한, 운전석의 탑승자가 ‘갓길로 정차해줘’라고 말하는 경우, ‘갓길로 정차해줘’라는 음성명령으로 인식하 고, 탑승자 정보를 이용하여 화자가 운전자인 것으로 판단할 수 있고, 갓길로 정차해 줄 수 있다. 마찬가지로 운전석 이외의 탑승자가 동일한 명령을 했을 경우, 탑승자 정보를 이용하여 화자가 동승자인 것으로 판단할 수 있고, 갓길 정차와 같은 주행에 있어 중요한 명령은 받아들이지 않을 수 있다. 이와 같이, 음성명령을 인식함에 있어서, 화자의 위치를 판단하여, 화자의 위치를 고려하여 음성명령을 분석하 는바, 화자의 의도를 정확히 판단할 수 있고, 그에 따라 적합한 차량 제어가 가능하다. 도 2는 본 발명의 일 실시예에 따른 차량 제어 과정을 설명하기 위한 것으로, 탑승자 중 한 명 이상이 발화(S 1)를 하면, 음성인식 모듈로 소리가 입력(S2)된다. 이때, 탑승자 감지 모듈은 차량내 호흡신호를 감 지(S3)하고 있고, 입력된 소리와 감지된 호흡신호를 이용하여 화자의 탑승 위치를 인식(S5)하고, 입력된 소리는자연어 처리(S4)를 통해 음성명령으로 인식된다. 화자의 탑승 위치를 고려하여 음성명령으로부터 화자 명령 의 도를 판단(S6)하고, 판단 결과에 따라 차량을 제어(S7)할 수 있다. 도 3은 본 발명의 일 실시예에 따른 지능형 차량의 블록도이다. 본 발명의 일 실시예에 따른 지능형 차량 은 탑승자 감지 모듈, 음성인식 모듈, 및 제어모듈로 구성되고, 탑승자의 편의를 제공하는 다양 한 구성요소들을 포함할 수 있다. 여기서, 지능형 차량은 자율형 차량일 수 있다. 본 발명의 일 실시예에 따른 지능형 차량의 구성들에 대한 상세한 설명은 도 1 내지 도 2의 차량 제어 장치에 대한 상세한 설명에 대응하는바, 이하 중복되는 설명은 생략하도록 한다. 탑승자 감지 모듈은 차량내 탑승자를 개별 감지한다. 탑승자 감지 모듈은 차량내 탑승자인 제1 탑승 자 및 제2 탑승자를 개별 감지할 수 있다. 음성인식 모듈은 차량 내 음성을 인식한다. 제어모듈 은 상기 음성으로부터 음성명령을 인식하고, 상기 음성을 인식할 때 감지된 탑승자의 변화를 이용하여 화 자의 위치를 판단하고, 상기 화자의 위치를 이용하여 상기 인식된 음성명령을 분석하고, 상기 인식된 음성명령 에 대응하는 제어명령을 생성한다. 탑승자 감지 모듈은 각 탑승 위치에 장착된 레이더를 이용하여 해당 위치에 탑승한 탑승자의 호흡을 감지 하거나, 각 탑승 위치에 장착된 각 좌석벨트의 압력 변화를 이용하여 각 탑승자의 호흡을 감지하고, 제어모듈 은 상기 음성을 인식할 때, 해당 음성을 발화시 생성되는 호흡패턴이 감지되는 탑승자의 탑승 위치를 화자 의 위치로 감지할 수 있다. 도 4는 본 발명의 일 실시예에 따른 차량 제어 방법의 흐름도이고, 도 5 내지 도 7는 본 발명의 다른 실시예에 따른 차량 제어 방법의 흐름도이다. 도 4 내지 도 7의 각 단계에 대한 상세한 설명은 도 1 내지 도 2의 차량 제 어 장치에 대한 상세한 설명에 대응되는바, 이하 중복되는 설명은 생략하도록 한다. 음성 명령에 따라 차량을 제어하기 위하여, S11 단계에서 차량내 탑승자 정보를 개별 감지한다. 실시간 또는 주 기적으로 차량내 탑승자 정보를 개별 감지할 수 있다. 차량내 탑승자 정보를 개별 감지하는 단계는 탑승자의 호 흡을 감지할 수 있고, 구체적으로, 각 탑승 위치에 장착된 레이더를 이용하여 해당 위치에 탑승한 탑승자의 호 흡을 감지하거나, 각 탑승 위치에 장착된 각 좌석벨트의 압력 변화를 이용하여 각 탑승자의 호흡을 감지하는 S21 단계를 통해 수행될 수 있다. S12 단계에서 차량 내 음성을 인식하면, S13 단계에서 상기 음성으로부터 음성명령을 인식하고, S14 단계에서 상기 음성을 인식할 때 감지된 탑승자 정보를 이용하여 화자의 위치를 판단한다. 화자의 위치를 판단하는 단계 는, S34 단계와 같이, 상기 음성을 인식할 때, 해당 음성을 발화시 생성되는 호흡패턴이 감지되는 탑승자의 탑 승 위치를 화자의 위치로 판단할 수 있고, 복수의 음성이 인식되는 경우, S44 단계와 같이, 각 음성을 구별하여 각 음성에 대응하는 상기 탑승자 정보의 변화가 감지되는 탑승자의 위치를 각 음성을 발화한 화자의 위치로 판 단할 수 있다. 이후, S15 단계에서 상기 화자의 위치를 이용하여 상기 인식된 음성명령을 분석하고, S16 단계에서 상기 인식된 음성명령에 대응하는 제어명령을 생성한다. 한편, 본 발명의 실시예들은 컴퓨터로 읽을 수 있는 기록 매체에 컴퓨터가 읽을 수 있는 코드로 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록 매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있으며, 또한, 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산 방 식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고 본 발명을 구현하기 위한 기능적인 (functional) 프로그램, 코드 및 코드 세그먼트들은 본 발명이 속하는 기술 분야의 프로그래머들에 의하여 용이 하게 추론될 수 있다. 본 실시 예와 관련된 기술 분야에서 통상의 지식을 가진 자는 상기된 기재의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 방법들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있 으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다.부호의 설명 110, 310: 탑승자 감지 모듈 120, 320: 음성인식 모듈 130, 330: 제어모듈 210, 220, 340, 350: 탑승자"}
{"patent_id": "10-2021-0062223", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 차량 제어 장치의 블록도이다. 도 2는 본 발명의 일 실시예에 따른 차량 제어 과정을 설명하기 위한 도면이다. 도 3은 본 발명의 일 실시예에 따른 지능형 차량의 블록도이다. 도 4는 본 발명의 일 실시예에 따른 차량 제어 방법의 흐름도이다. 도 5 내지 도 7는 본 발명의 다른 실시예에 따른 차량 제어 방법의 흐름도이다."}
