{"patent_id": "10-2019-7014831", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0075101", "출원번호": "10-2019-7014831", "발명의 명칭": "로봇의 거래 시스템 및 거래 방법", "출원인": "카와사키 주코교 카부시키 카이샤", "발명자": "하시모토, 야스히코"}}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "내지 청구항 4 중 어느 하나의 항에 있어서,상기 수주부가 상기 로봇을 수주하여, 상기 로봇의 조립 부품 일식(一式)을 포함하는 납품 리스트를 생성하는것을 특징으로 하는, 로봇의 거래 시스템."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 기본 로봇에 적합한 작업 분류를 포함하는 상기 기본 로봇에 관한 정보가 저장된 기본 로봇 데이터베이스;상기 고객 단말기로부터 상기 기본 로봇의 선택을 접수 받기 전에, 상기 로봇이 실시하는 작업 분류에 관한 작업 분류 정보를 상기 고객 단말기로부터 접수 받고, 상기 작업 분류 정보에 기초하여 상기 작업 분류에 적합한하나 또는 복수의 기본 로봇을 상기 기본 로봇 데이터베이스로부터 탐색하고, 탐색된 상기 기본 로봇을 상기 고객 단말기에 출력 표시시키는 기본 로봇 탐색부; 를 더 구비하는 것을 특징으로 하는, 로봇의 거래 시스템."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1 또는 청구항 2에 있어서, 상기 특별 주문 사양 결정부는, 상기 가변 사양 항목과, 해당 가변 사양 항목 중 적어도 하나에 대한 요구 사양정보의 입력요구를 상기 고객 단말기에 출력 표시시키고, 상기 요구 사양 정보를 상기 고객 단말기로부터 접수받고, 접수 받은 상기 요구 사양 정보에 기초하여 상기 특별 주문 사양을 결정하는 것을 특징으로 하는, 로봇의거래 시스템."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1 또는 청구항 2에 있어서,상기 특별 주문 사양 결정부는 상기 로봇의 작업 대상에 관한 작업 대상 정보와, 상기 로봇이 상기 작업 대상에대해 실시하는 작업에 관한 작업 내용 정보를 상기 고객 단말로부터 접수하고, 상기 작업 대상 정보 및 상기 작업 내용 정보에 기초하여 상기 특별 주문 사양을 결정하는 것을 특징으로 하는, 로봇의 거래 시스템.공개특허 10-2019-0075101-3-청구항 5"}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1 내지 청구항 5 중 어느 하나의 항에 있어서, 상기 가변 사양 항목이 동작 범위, 동작 자세, 동작 진동 특성, 동작 속도, 위치 결정 정밀도, 궤적 정밀도, 발생력, 운반가능 중량 및 가격 중 적어도 하나를 포함하는 것을 특징으로 하는, 로봇의 거래 시스템."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "로봇의 거래를 수행하는 로봇의 거래 방법에 있어서,고객에게 상기 로봇의 기초가 되는 기본 로봇의 선택을 재촉하고,상기 기본 로봇의 선택을 접수하고, 상기 기본 로봇의 소정의 기본 사양 중 가변 사양에 관한 정보군으로부터선택된 상기 기본 로봇의 가변 사양 항목을 추출하고,상기 기본 사양으로부터 상기 가변 사양 항목 중 적어도 하나가 변경된 특별 주문 사양을 결정하고,상기 기본 로봇의 구성 부품 및 상기 기본 로봇에 장착 가능한 부품에 관한 정보군으로부터, 상기 특별 주문 사양을 실현하는 상기 로봇을 구성하는 부품을 탐색하고,상기 고객에게 상기 기본 로봇에 탐색된 상기 부품을 실장한 상기 로봇의 가상체를 제시하고,상기 고객에게 상기 로봇의 발주의 입력을 재촉하고,상기 로봇의 발주를 접수하여, 상기 로봇을 수주하는 것을 특징으로 하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 고객에게 상기 기본 로봇의 선택을 재촉하기 전에, 상기 고객에게 상기 로봇이 실시할 작업 분류에 관한작업 분류 정보의 제공을 재촉하고, 상기 작업 분류 정보를 접수하여, 상기 기본 로봇에 적합한 작업 분류를 포함하는 상기 기본 로봇에 관한 정보군으로부터 상기 작업 분류에 적합한 하나 또는 복수의 상기 기본 로봇을 탐색하고,상기 고객에 탐색된 상기 기본 로봇을 제시하는 것을 특징으로 하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7 또는 청구항 8에 있어서,상기 특별 주문 사양을 결정하는 것이 상기 고객에게 상기 가변 사양 항목 중 적어도 하나에 대한 요구 사양 정보의 제공을 재촉하고, 상기 요구 사양 정보를 접수 받아, 상기 요구 사양 정보에 기초하여 상기 특별 주문 사양을 결정하는 것을 포함하는 것을 특징으로 하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2019-0075101-4-청구항 7 또는 청구항 8에 있어서,상기 특별 주문 사양을 결정하는 것이, 상기 로봇의 작업 대상에 관한 작업 대상 정보와, 상기 로봇이 상기 작업 대상에 대해 실시하는 작업에 관한 작업 내용 정보와의 제공을 상기 고객에게 재촉하고, 상기 작업 대상 정보 및 상기 작업 내용 정보를 접수 받아, 상기 작업 대상 정보 및 상기 작업 내용 정보에 기초하여 상기 특별주문 사양을 결정하는 것을 포함하는 것을 특징으로 하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 7 내지 청구항 10 중 어느 하나의 항에 있어서,상기 로봇을 수주하여 상기 로봇의 조립 부품 일식(一式)을 포함하는 납품 리스트를 생성하는 것을 특징으로 하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 7 내지 청구항 11 중 어느 하나의 항에 있어서,상기 로봇을 상기 로봇 조립 부품 일식이 패키지된 조립 키트 상태에서 상기 고객에게 발송하는 것을 특징으로하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 7 내지 청구항 12 중 어느 하나의 항에 있어서,상기 가변 사양 항목이 동작 범위, 동작 자세, 동작 진동 특성, 동작 속도, 위치 결정 정밀도, 궤적 정밀도, 발생력, 운반가능 중량 및 가격 중 적어도 하나를 포함하는 것을 특징으로 하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제어 유닛, 적어도 1 개의 가동 유닛으로 이루어지는 암(arm)부, 및 엔드 이펙터 유닛의 연설체를 기본 로봇으로 하고, 상기 기본 로봇의 적어도 1 개의 가변 사양 항목을 포함하는 상기 기본 로봇의 가변 사양에 관한 정보가 기억된 가변 사양 데이터베이스;상기 가동 유닛에 관한 정보가 저장된 가동 유닛 데이터베이스;상기 가변 사양이 변경된 상기 가동 유닛의 조합에 관한 정보가 기억된 부품 적합성 검토결과 데이터베이스;상기 가변 사양 데이터베이스로부터 상기 기본 로봇에 대응하는 상기 가변 사양 항목을 읽어내어 고객 단말기에표시시키고, 상기 가변 사양 항목 중 적어도 하나가 변경된 특별 주문 사양을 상기 고객 단말기로부터 접수하는특별 주문 사양 결정부;상기 가동 유닛 데이터베이스 및 상기 부품 적합성 검토결과 데이터베이스에 저장된 정보에 따라, 상기 특별 주문 사양을 실현하는 상기 가동 유닛의 조합을 탐색하는 적합성 검토부;상기 제어 유닛, 탐색된 상기 가동 유닛의 조합 및 상기 엔드 이펙터 유닛의 연설체인 로봇의 가상체를 상기 고객 단말기에 출력 표시시키는 로봇 제시부;상기 고객 단말로부터 상기 로봇의 구성 유닛의 일식(一式) 또는 일부의 발주를 접수 받아 수주하는 수주부; 를구비하는 것을 특징으로 하는, 로봇의 거래 시스템."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2019-0075101-5-청구항 14에 있어서,상기 기본 로봇에 적합한 작업 분류를 포함하는 상기 기본 로봇에 관한 정보가 저장된 기본 로봇 데이터베이스;상기 고객 단말기로부터 상기 로봇이 실시할 작업 분류에 관한 작업 분류 정보를 접수 받아, 상기 작업 분류 정보에 기초하여 상기 작업 분류에 적합한 또는 복수의 상기 기본 로봇을 상기 기본 로봇 데이터베이스로부터 탐색하고, 탐색된 상기 기본 로봇을 상기 고객 단말기에 출력 표시시키는 기본 로봇 탐색부; 를 더 구비하는 것을특징으로 하는, 로봇의 거래 시스템."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 14 또는 청구항 15에 있어서, 고객이 소유하는 로봇의 구성 유닛과, 상기 로봇의 구성 유닛을 비교하여 상기 로봇을 실현하기 위해 상기 고객이 소유하는 로봇의 구성 유닛에 추가되는 유닛을 추출하고, 상기 추가되는 유닛에 관한 정보를 상기 고객 단말기에 출력 표시시키는 추가 유닛 제시부를 더 포함하는 것을 특징으로 하는, 로봇의 거래 시스템."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제어 유닛, 적어도 1 개의 가동 유닛으로 이루어지는 암부, 및 엔드 이펙터 유닛의 연설체를 기본 로봇으로 하고, 상기 기본 로봇에 대해 적어도 하나의 가변 사양 항목을 고객에게 제시하고,상기 가변 사양 항목 중 적어도 하나가 변경된 특별 주문 사양을 접수 받고, 상기 특별 주문 사양을 실현하는상기 가동 유닛의 조합을 탐색하고,상기 제어 유닛, 탐색된 상기 가동 유닛의 조합으로 이루어지는 상기 암부 및 상기 엔드 이펙터 유닛의 연설체인 로봇의 가상체를 상기 고객에게 제시하고,상기 고객으로부터 상기 로봇의 구성 유닛의 일식(一式) 또는 일부의 발주를 접수 받고 수주하는 것을 특징으로하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 로봇이 실시하는 작업 분류에 관한 작업 분류 정보를 접수하여, 상기 기본 로봇에 적합한 작업 분류를 포함하는 상기 기본 로봇에 관한 정보군(情報群)으로부터 상기 작업 분류에 적합한 하나 또는 복수의 상기 기본로봇을 탐색하고,탐색된 상기 기본 로봇을 상기 고객에게 제시하는 것을 특징으로 하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 17 또는 청구항 18에 있어서, 고객이 소유하는 로봇의 구성 유닛과, 상기 로봇의 구성 유닛을 비교하여 상기 로봇을 실현하기 위해 상기 고객이 소유하는 로봇의 구성 유닛에 추가되는 유닛을 추출하고, 상기 추가되는 유닛에 관한 정보를 상기 고객에게제시하는 것을 특징으로 하는, 로봇의 거래 방법."}
{"patent_id": "10-2019-7014831", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 데이터를 송수신함으로써 고객에게 로봇의 기초가 되는 기본 로봇의 선택을 재촉하고, 기본 로봇의 선택을 접수 받아, 기본 로봇의 소정의 기본 사양 중 가변 사양에 관한 정보로부터 선택된 기본 로봇의 가변 사양 항목 을 가변 사양 데이터베이스로부터 추출하여, 기본 사양으로부터 가변 사양 항목 중 적어도 하나가 변경된 특별 주문 사양을 결정하고, 기본 로봇의 구성 부품 및 기본 로봇에 장착 가능한 부품에 관한 정보 중에서 특별 주문 사양을 실현하는 로봇을 구성하는 부품을 탐색하고, 고객에게 기본 로봇에 탐색된 부품을 실장한 로봇의 가상체 를 제시하고, 고객에게 로봇의 주문(발주)의 입력을 재촉하여, 로봇의 주문(발주)을 접수 받고, 로봇을 수주한다."}
{"patent_id": "10-2019-7014831", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 로봇의 상거래를 수행하는 로봇의 거래 시스템 및 거래방법에 관한 것이다."}
{"patent_id": "10-2019-7014831", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래, 고객이 사양(仕樣)을 결정하는 커스텀 로봇(custom robot)의 상거래는, (i) 고객이 요구 사양을 결정하고, (ii) 요구 사양에 따라 로봇 제조업체가 커스텀 로봇의 기초가 되는 기본 로봇 및 그 기본 로봇 에 장착되는 부품을 결정하고, (iii) 이런 식으로 하여 커스터마이즈된(customized) 로봇을 로봇 제조업체가 고객 에게 제안하고, (iv) 그 제안을 고객이 받아들여서 발주(發注)하고, (v) 수주(受注)한 로봇 제조업체가 커스텀 로봇을 고객에게 인도하는 절차로 행해진다. 일반적으로 커스텀 로봇은 조립된 완성품으로서 고객에게 인도된다. 최근에는 상기(上記)와 같은 커스텀 로봇이나 그 부품·프로그램을 전자 상거래의 대상으로 하는 기술이 제안되 고 있다. 예를 들어, 특허문헌 1, 2에서는 이런 종류의 기술이 개시되고 있다. 특허문헌1의 상품 수주 시스템은 반려 동물(pet)형 로봇을 상품으로 하여, 그것에 대해 전자 상거래를 하는 상 품 수주 시스템이 기재되어 있다. 이 상품 수주 시스템에서는 사용자 단말의 모니터에 가상 로봇을 표시시키고, 사용자의 조작에 의해 가상 로봇의 학습 기능을 진전시키고, 진전시킨 학습 데이터를 제조업체가 받고, 그 학습 데이터를 기억시킨 로봇을 사용자에게 판매한다. 또, 특허문헌2의 산업용 로봇 및 소프트웨어 판매 방법으로는 로봇이 로봇 암(robot arm)과, 로봇 암을 제어하 는 제어 장치와, 로봇 암을 교시하는 교시용 단말 장치를 구비하여, 사용자가 원하는 소프트웨어 기능을 인터넷 을 통해 교시용 단말 장치로 다운로드(download) 할 수 있도록 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허문헌1: 특개2003-203171호 공보 (특허문헌 0002) 특허문헌2: 특개2002-254371호 공보"}
{"patent_id": "10-2019-7014831", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래의 로봇 상거래에서 고객의 요구 사양에 대응하여 기본 로봇과 그 기본 로봇에 장착되는 부품 등과의 적합 성(매칭)을 검토하는 기술은 로봇 제조업체의 노하우이며, 고도의 기술이나 이해를 요한다. 이 적합성 검토작업 은, 설계와 동작 보상 등의 번잡한 처리가 반복되기 때문에 시간과 노동을 요하고, 더욱이 비용도 불어난다. 또, 특히 커스텀 로봇에서는 제품을 고객에게 제공함에 있어서, 제품마다 다른 조립부착, 배선이나 배관 등의 작업이나 동작 확인 등이 따르기 때문에, 조립 및 설치에 비용이 늘어난다. 한편, 고객에게는 요구 사양에 따라 커스터마이즈된 커스텀 로봇을 부담 없이 시험해보고, 그 결과 납득이 가면 저렴하게 취득하고 싶다는 요구가 있다. 그러나, 종래의 로봇 상거래에서는 상기와 같은 비용 상승으로 이어지 는 다양한 요소가 뒤따르기 때문에 이러한 고객의 요구에 응할 수 없었다. 본 발명은 이상의 사정을 감안하여 이루어진 것이고, 그 목적은 고객의 요구 사양에 따라 커스터마이즈된 커스 텀 로봇을 고객이 부담 없이 시험하면서 저렴하게 취득할 수 있도록 하는 것이다."}
{"patent_id": "10-2019-7014831", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시태양(一態樣)에 관계되는 로봇의 거래 시스템은: 상기 로봇의 기초가 되는 기본 로봇마다 그 기본 로봇의 소정의 기본 사양 중 가변 사양에 대한 정보가 기억된 가변 사양 데이터베이스; 고객 단말로부터 상기 기본 로봇의 선택을 받아, 상기 가변 사양 데이터베이스로부터 선택된 상기 기본 로봇의 가변 사양 항목을 추출하고, 상기 기본 사양으로부터 상기 가변 사양 항목 중 적어도 하나 이상이 변경된 특별 주문 사양을 결정하는 특별 주문 사양 결정부;상기 기본 로봇의 구성부품 및 상기 기본 로봇에 장착 가능한 부품에 관한 정보가 기억된 부품 데이터베이스; 상기 부품 데이터베이스에 기억된 부품 중에서 상기 특별 주문 사양을 실현하는 상기 로봇을 구성하는 부품의 조합을 탐색하는 적합성 검토부; 상기 기본 로봇에 탐색된 상기 부품을 실장(實裝)한 상기 로봇의 가상체(假想體)를 상기 고객 단말기에 출력 표 시시키는 커스텀 로봇 제시부; 상기 고객 단말기로부터 상기 로봇의 주문(발주)을 받고, 상기 로봇을 수주(受注)하는 수주부를 구비하는 것을 특징으로 하고 있다. 또한, 본 발명의 다른 일 실시태양(一態樣)에 관계되는 로봇의 거래 방법은 네트워크를 통해 전자 데이터를 송 수신함으로써 로봇의 거래를 행하는 로봇의 거래 방법에 있어서, 고객에게 상기 로봇의 기초가 되는 기본 로봇의 선택을 재촉하고, 상기 기본 로봇의 선택을 받아, 상기 기본 로봇의 소정의 기본 사양 중 가변 사양에 관한 정보군으로부터 선택 된 상기 기본 로봇의 가변 사양 항목을 추출하고, 상기 기본 사양으로부터 상기 가변 사양 항목 중 적어도 하나가 바뀐 특별 주문 사양을 결정하고, 상기 기본 로봇의 구성부품 및 상기 기본 로봇에 장착 가능한 부품에 관한 정보군으로부터, 상기 특별 주문 사 양을 실현하는 상기 로봇을 구성하는 부품을 탐색하고, 상기 고객에게 상기 기본 로봇에 탐색된 상기 부품을 실장(實裝)한 상기 로봇의 가상체를 제시하고, 상기 고객에게 상기 로봇의 주문 입력을 재촉하고, 상기 로봇의 주문을 받아, 상기 로봇을 수주하는 것을 특징으로 하고 있다. 또, 본 발명의 다른 일 실시 태양(一態樣)에 관계되는 로봇의 거래 시스템은: 제어 유닛, 적어도 1개의 가동 유닛으로 이루어지는 암(arm)부 및 엔드 이펙터 유닛의 연설체(連設體: 연속적으 로 이어져 설치된 것)를 기본 로봇으로 하고, 상기 기본 로봇의 적어도 1개의 가변 사양 항목을 포함하는 상기 기본 로봇의 가변 사양에 관한 정보가 기억된 가변 사양 데이터베이스; 상기 가동 유닛에 관한 정보가 저장된 가동유닛 데이터베이스; 상기 가변 사양이 변경된 상기 가동 유닛의 조합에 관한 정보가 기억된 부품 적합성 검토 결과 데이터베이스; 상기 가변 사양 데이터베이스로부터 상기 기본 로봇에 대응하는 상기 가변 사양 항목을 읽어내어 고객 단말에 표시시키고, 상기 가변 사양 항목 중 적어도 하나가 변경된 특별 주문 사양을 상기 고객 단말기로부터 받는 특 별 주문 사양 결정부; 상기 가동 유닛 데이터베이스 및 상기 부품 적합성 검토 결과 데이터베이스에 저장된 정보에 따라 상기 특별 주 문 사양을 실현하는 상기 가동 유닛의 조합을 탐색하는 적합성 검토부; 상기 제어 유닛, 상기 탐색된 가동 유닛의 조합 및 상기 엔드 이펙터 유닛의 연설체(連設體)인 로봇의 가상체를 상기 고객 단말기에 출력 표시시키는 로봇 제시부; 상기 고객 단말기로부터 상기 로봇의 구성 유닛의 일식(一式: 한 벌 또는 그 전부) 또는 일부의 주문(발주)을 받아 수주하는 수주부를 구비하는 것을 특징으로 하고 있다. 또, 본 발명의 다른 일 실시태양(一態樣)에 관계되는 로봇의 거래 방법은 제어 유닛, 적어도 1개의 가동 유닛으로 이루어지는 암(arm)부 및 엔드 이펙터 유닛의 연설체를 기본 로봇으로 하고, 상기 기본 로봇에 대해 적어도 하나의 가변 사양 항목을 고객에게 제시하고; 상기 가변 사양 항목 중 적어도 하나가 변경된 특별 주문 사양을 받고, 상기 특별 주문 사양을 실현하는 상기 가동 유닛의 조합을 탐색하고; 상기 제어 유닛, 탐색된 상기 가동 유닛의 조합으로 이루어지는 상기 암부 및 상기 엔드 이펙터 유닛의 연설체 인 로봇의 가상체를 상기 고객에게 제시하고;상기 고객으로부터 상기 로봇의 구성 유닛의 일식 또는 일부의 주문을 받고 수주하는 것을 특징으로 하고 있다. 상기 로봇의 거래 시스템 및 거래 방법에 의하면, 로봇에 대한 전문 지식을 갖지 아니한 고객이라도 자신의 요 구 사양에 따라 커스터마이즈된 로봇을 주문할 수 있다. 또, 로봇의 발주 전에 로봇의 가상체가 고객에게 제공 되므로 고객은 발주 전에 로봇을 부담 없이 시험할 수 있다. 또, 로봇 부품의 적합성 검토 및 설계 등에 인간이 개입하지 아니하는 분만큼, 비용을 절감할 수 있으며, 로봇 제조업체는 로봇을 저렴하게 제공하고, 또한 고객은 커스텀 로봇을 저렴하게 취득할 수 있다."}
{"patent_id": "10-2019-7014831", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 고객의 요구하는 사양에 따라 커스터마이즈된 커스텀 로봇을 고객이 부담 없이 시험해보고, 동시에, 저렴하게 취득할 수 있다."}
{"patent_id": "10-2019-7014831", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 관계되는 로봇의 거래 시스템은 네트워크를 통해 전자 데이터를 송수신함으로써 로봇의 전자 상거래 를 행하는 시스템이다. 상거래의 대상이 되는 로봇은 적어도 1 개의 로봇 암(arm)과, 로봇 암의 동작을 제어하 는 컨트롤러를 포함하고, 더욱이, 로봇 암의 손끝부에 장착되는 엔드 이펙터를 포함하고 있어도 좋다. 이하, 본 발명의 제 1 실시형태 및 제2 실시형태를 설명한다. [제 1 실시형태] 본 발명의 제 1 실시형태에 관계되는 거래 시스템 1에 대해 설명한다. 도 1은 본 발명의 제 1 실시형태에 관계되는 로봇의 거래 시스템 1의 네트워크 구성을 나타내는 도면이다. 도 1 에 보여주는 로봇의 거래 시스템은 인터넷 등의 네트워크에 의해 접속된 복수의 고객 단말기와, 시스 템 운영 서버와, 로봇 제조업체 단말기를 포함한다. 고객 단말기와 시스템 운영 서버는 네트워크 를 통해 서로 통신 가능하게 접속되어 있다. 또, 로봇 제조업체 단말기와 시스템 운영 서버는 네트워 크를 통해 통신 가능하게 접속되어 있다. 또한, 본 실시형태에서는 예시하지 않지만, 로봇 제조업체 단말기 와 고객 단말기는 네트워크를 통해 서로 통신 가능하게 접속되어 있어도 좋다. 도 2는 시스템 운영 서버의 상세한 구성의 일례를 나타내는 도면이다. 도 2에서 보여주는 시스템 운영 서버 는, 네트워크와의 정보의 송수신을 제어하는 인터페이스와, 인터페이스에 접속되고, 로봇의 거 래에 관계되는 각종 처리를 실행하는 프로세서와, 프로세서에 접속된 기록매체 판독(判讀)장치를 포함한다. 프로세서는 기본 로봇 데이터베이스, 가변 사양 데이터베이스, 시뮬레이션 툴(tool) 데이터베이 스, 부품 데이터베이스, 부품 적합성 검토 결과 데이터베이스, 프로그램 데이터베이스 등 의 각 데이터베이스가 구축된 저장 장치가 접속되어 있다. 프로세서는 이들 기억 장치에 기억된 정보를 판 독(判讀)하거나 이들 기억 장치에 정보를 기억시키거나 할 수 있다. 기본 로봇 데이터베이스는, 로봇의 기초가 되는 각종 기본 로봇에 관한 정보를 기본 로봇마다 저장한다. 기본 로봇에 관한 정보는 기본 로봇의 식별 번호나 그 기본 로봇에 적합한 작업 분류를 포함하는 그 기본 로봇 의 성능이나 외관 등의 정보를 포함한다. 또한, 로봇의 작업 분류에는, 예를 들면 대분류로서 옥외 작업, 옥내 작업, 고소(高所) 작업, 특수 환경 작업 등이 있으며, 소분류로서 경량물의 반송(搬送), 중량물의 반송, 접수· 안내 등의 서비스 제공, 드라이버 등의 작업 공구를 사용한 체결 가공, 절삭·연삭·연마 등의 기계 가공, 용접 ·도장(塗裝) 등의 특수기구를 사용한 가공 등이 있다. 단, 로봇의 작업 분류는 상기(上記)에 한정되지 않는다. 가변 사양 데이터베이스는 기본 로봇의 소정의 기본 사양 중 가변 사양에 관한 정보를 기본 로봇마다 격납 (저장)한다. 가변 사양 데이터베이스는, 예를 들어, 기본 로봇의 식별 번호에 기초해서, 대응하는 가변 사 양에 관한 정보를 추출할 수 있다. 기본 로봇의 소정의 기본 사양은 고정 사양과 가변 사양을 포함한다. 그 중 가변 사양의 각 항목은 고객의 요망에 따라 설정할 수 있다. 기본 로봇의 가변 사양 항목에는 동작 범위, 동작 자세, 동작 진동특성, 동작 속도, 위치 결정 정밀도, 궤적 정밀도, 발생력, 운반가능 중량 및 가격 중 적어도 하나가 포함되어 좋다. 기본 로봇의 가변 사양 항목은 기본 로봇마다 차이가 있을 수 있다. 가변 사양 항목 중, 동작 범위란, 로봇 암(arm)의 손목 구부림 축의 회전 중심의 동작 범위이다. 기본 로봇마다 최대 동작 범위와 최소 동작 범위가 규정되어 있고, 동작 범위의 요구 사양을 최대 동작 범위와 최소 동작 범위 사이에서 설정할 수 있다. 가변 사양 항목 중, 동작 자세란, 로봇이 작업을 행할 때의 로봇 암의 자세이다. 동작 범위의 요구 사양, 예를 들면, 워크(work)를 상방향(上方向)으로 지지(支持), 워크를 하방향(下方向)으로 매달기 등의 항목에서 선택할 수 있다. 가변 사양 항목 중 동작 진동 특성이란, 로봇 암이 이동할 때의 손끝부의 진동 주파수에 대한 것이다. 기본 로 봇마다 동작 진동 특성에 관한 복수의 수치가 규정되어 있고, 동작 진동 특성의 요구 사양을 소정의 수치(數値) 중에서 선택할 수 있다. 가변 사양 항목 중 동작 속도란, 로봇 암이 이동할 때 손끝부의 이동 속도이다. 기본 로봇마다 동작 속도 범위 가 규정되어 있고, 동작 속도의 요구 사양을 소정의 동작 속도 범위 중에서 설정할 수 있다. 가변 사양 항목 중 위치 결정 정밀도란, 로봇 암의 손끝부가 지령 위치로 이동한 때의, 지령 위치와 실제의 손 끝부의 위치와의 편차에 대한 것이다. 기본 로봇마다 위치 결정 정밀도에 관한 수치 범위가 규정되어 있고, 위 치 결정 정밀도 요구 사양을 소정의 수치 범위로부터 설정할 수 있다. 가변 사양 항목 중 궤적 정밀도란, 로봇 암의 손끝부가 기준 위치에서 지령 위치로 이동할 때의, 지령 궤적과 실제 손끝부의 궤적과의 편차에 대한 것이다. 기본 로봇마다 궤적 정밀도에 관한 수치 범위가 규정되어 있고, 궤적 정밀도의 요구 사양을 소정의 수치 범위로부터 설정할 수 있다. 가변 사양 항목 중 발생력이란, 로봇 암의 손끝부에 발생시킬 수 있는 힘·모멘트에 대한 것이다. 기본 로봇마 다 발생력에 관한 수치 범위가 규정되어 있고, 발생력의 요구 사양을 소정의 수치 범위로부터 설정할 수 있다. 가변 사양 항목 중 운반가능 중량이란, 로봇 암이 운반가능한 워크의 최대 중량이다. 기본 로봇마다 운반가능 중량에 관한 수치 범위가 규정되어 있고, 운반가능 중량의 요구 사양을 소정의 수치 범위로부터 설정할 수 있다. 가변 사양 항목 중 가격이란, 로봇의 판매 가격이다. 기본 로봇마다 복수의 가격대가 규정되어 있고, 가격의 요 구 사양을 복수의 가격대로부터 선택할 수 있다. 부품 데이터베이스는 기본 로봇의 구성부품 및 기본 로봇에 장착 가능한 부품에 관한 정보를 부품마다 저 장한다. 기본 로봇의 구성부품은 기대(基台), 링크 부재, 관절 부재, 관절 구동 장치, 컨트롤러 등의 기본적인 구성 부품을 포함한다. 링크 부재끼리 관절 부재를 통해 연결됨으로써 로봇 암이 형성된다. 로봇 암의 각 관절 에는 그 관절을 구동하는 관절 구동 장치가 설치된다. 부품 데이터베이스에, 크기와 형상이 다른 복수 종류의 기대(基台)에 관한 정보가 저장된다. 또, 부품 데 이터베이스에 소재나 외형이 다른 복수 종류의 링크 부재에 관한 정보가 저장된다. 복수 종류의 링크 부재 의 각각은 원칙적으로 링크 부재의 길이(긴 쪽 방향의 치수)가 소정의 범위 내에서 가변이다. 기능과 외형이 다 른 복수 종류의 관절 부재에 관한 정보가 부품 데이터베이스에 저장된다. 복수 종류의 관절 부재는 관절의 접속 방향이나 접속 태양(態樣) 등이 서로 차이가 있어도 좋다. 또, 링크 부재로의 관절 부재의 부착 위치는 소 정의 범위 내에서 가변이어도 좋다. 관절 구동 장치로서 복수 종류의 액츄에이터나, 액츄에이터와 대응하는 동 력 전달기구 등에 관한 정보가 부품 데이터베이스에 저장된다. 복수 종류의 컨트롤러에 관한 정보가 부품 데이터베이스에 저장된다. 복수 종류의 컨트롤러는 서로 다른 성능을 가진다. 기본 로봇에 장착 가능한 부품으로서, 예를 들면, 도장(塗裝) 건(gun), 용접(溶接) 건(gun) 흡착 핸드, 재치(載 置: 물건 등을 기대나 장치에 실어 놓은 것) 핸드, 파지(把持: 물건 등을 꽉 붙잡는 것) 핸드 등의 복수 종류의 엔드 이펙터에 관한 정보가 부품 데이터베이스에 저장된다. 또, 기본 로봇에 장착 가능한 부품으로서, 예 를 들면, 에어(공기) 배관, 유압 배관, 배선 등의 복수 종류의 드레싱(dressing)에 관한 정보가 부품 데이터베 이스에 저장된다. 부품 적합성 검토 결과 데이터베이스는, 후술하는 특별 주문 사양을 만족하는 부품 데이터베이스에 저장된 부품 정보의 조합에 관한 정보를 저장한다. 부품 적합성 검토 결과 데이터베이스에 저장되는 정보 는, 종래, 로봇 제조업체의 담당자가 행하여 온 적합성 검토의 작업 결과를 데이터베이스화 한 것이어도 좋다. 또한, 부품 적합성 검토 결과 데이터베이스에 저장되는 정보는, 다양한 조건에서 행해진 부품의 적합성 검 토의 시뮬레이션 결과라도 좋다. 또한, 후술하는 부품 적합성 처리의 결과는 부품 적합성 검토 결과 데이터베이 스에 순차적(順次的)으로 추가된다. 프로그램 데이터베이스는, 예를 들어, 기본 로봇 탐색 프로그램, 특별 주문 사양 결정 프로그램, 적합성 검토 프로그램, 커스텀 로봇 제시 프로그램, 수주(受注) 프로그램 등의 로봇의 거래에 관계되는 각종 처리를 실 행하기 위한 각종 프로그램을 저장한다. 로봇의 거래 시스템 1에서의 각종 처리는, 특별히 언급되지 않는 한, 프로그램 데이터베이스에 저장된 각 종 프로그램이 프로세서에서 실행되는 것에 의해 이루어진다. 바꾸어 말하면, 프로세서가 프로그램 데 이터베이스에 저장된 프로그램을 실행함으로써, 프로세서가 그 프로그램의 내용에 따라 처리를 행하는 처리부로서 기능한다. 단, 프로세서에 접속된 기록 매체 판독장치가 기록 매체에 저장된 프로그램을 읽 어내어, 프로세서가 그 프로그램을 실행함으로써 처리가 이루어져도 좋다. 또, 각종 프로그램의 일부 또는 전부가 네트워크를 통해 고객 단말기로 전송되어, 고객 단말기에서 실행됨으로써 처리가 이루어져도 좋다. 시뮬레이션 툴(tool) 데이터베이스는, 동작 시뮬레이션 프로그램, 외관 시뮬레이션 프로그램, 코스트(비용) 시뮬레이션 프로그램 등의 시뮬레이션 툴(tool)을 저장한다. 프로세서에 의해 각 시뮬레이션 프로그램이 시뮬레이션 툴 데이터베이스로부터 읽어져서 실행되는 것에 의해, 프로세서가 시뮬레이터 로서 기능한다. 외관(外觀) 시뮬레이션 프로그램은 기본 로봇에 적합성 검토된 부품을 실장한 커스텀 로봇의 가상체의 외관을 예측한다. 예측된 커스텀 로봇의 가상체의 외관이 고객 단말기상에 표시 출력되면 된다. 동작 시뮬레이션 프 로그램은 커스텀 로봇의 가상체를 모델링하고 그 모델의 행동을 예측한다. 커스텀 로봇의 가상체의 예측된 행동 은 고객 단말기에 표시되어도 좋다. 비용 시뮬레이션 프로그램은, 커스텀 로봇의 가상체를 구성하는 부품의가격이나 배송료 등에서 예상 비용을 산출한다. 산출된 예측 비용은 고객 단말기에 표시 출력된다. 다음에, 도 3의 시퀀스 다이어그램을 이용하여 본 실시형태에 관계되는 로봇의 거래 방법을 설명한다. 또한, 특 별히 언급하지 않는 한, 고객 단말기, 시스템 운영 서버 및 로봇 제조업체 단말기 사이의 정보의 주고 받기는 네트워크을 통한 데이터의 송수신에 의해 행하여진다. 먼저, 고객은 고객 단말기를 이용하여 시스템 운영 서버에 액세스하여, 구입을 희망하는 로봇의 기초가 되는 기본 로봇의 탐색 요구를 송신한다 (단계 S1). 이 탐색 요구에 대해, 시스템 운영 서버는 기본 로봇 탐 색 프로그램을 실행하여 기본 로봇 탐색 화면(도 4 참조)을 고객 단말기에 송신하고 (단계 S2), 고객 단 말기의 표시 장치 (모니터 등)에 표시 출력시킨다 (단계 S3). 도 4는, 고객 단말기에 표시된 기본 로봇 탐색 화면의 일례를 보여주는 도면이다. 고객은, 고객 단말기 에 표시된 기본로봇 탐색화면의 유도(誘導)에 따라 구입하는 로봇에서 수행할 작업의 작업 분류 정보를 고객 단말기에 입력한다. 고객 단말기는 입력된 작업 분류 정보를 시스템 운영 서버로 전송한다(단계 S4). 시스템 운영 서버에서는 작업 분류 정보를 취득하고 기본로봇 탬색 프로그램을 실행하여 취득한 작업 분류 정보에 따라 기본로봇 탐색처리를 수행한다(단계 S5). 시스템 운영 서버는 기본 로봇 탐색 처리에서, 기본 로봇 데이터베이스에 저장된 기본 로봇 정보로부터 그 작업 분류 정보에 적합한 것, 즉, 작업 분류 정보에 관계되는 작업을 실행할 수 있는 기본 로봇을 탐색한다. 시스템 운영 서버는 이 탐색에 의해 하나 또 는 복수의 기본 로봇을 탐색하고, 이들 기본 로봇의 특성이나 외관을 포함시킨 기본로봇 탐색결과 화면정보를 고객 단말기에 송신하고(단계 S6), 기본로봇 탐색결과 화면(도 5 참조)을 고객 단말기에 출력 표시시 킨다 (단계 S7). 또한, 기본 로봇 탐색에 즈음하여 인공 지능 기술에 기초하는 질문 응답 시스템이 적용되어도 좋다. 즉, 시스템 운영 서버는 고객에게 자연 언어로 질문하도록 고객 단말기에 질문을 표시 출력 및/또는 음성 출력시켜서, 고객이 고객 단말기에 입력한 자연 언어에 대한 답신의 접수를 반복하여, 고객의 요구에 따라 기본 로봇을 탐색해도 좋다. 도 5는 기본로봇 탐색결과 화면의 일례를 보여주는 도면이다. 기본로봇 탐색결과 화면에서는 하나 또는 복수의 기본 로봇이 그 특성과 외관을 포함시킨 정보로서 나타나고 있다. 더 나아가, 기본로봇 탐색결과 화면 에는 탐색된 기본 로봇을 채용할 것인지 어떤지, 또는 탐색된 기본 로봇 중 어느 것을 채용할 지의 기본 로 봇 선택정보의 입력부가 설치되어 있다. 고객이 탐색된 기본 로봇을 채용하지 아니하는 경우는, 기본로봇 탐색 화면으로 되돌아가서, 기본 로봇의 탐색 처리를 다시 반복한다. 고객이 탐색된 기본 로봇을 채용하는 경우는, 고객 단말기는 고객이 입력한 기본로봇 선택정보를 시스템 운 영서버로 보낸다(단계 S8). 기본로봇 선택정보를 취득한 시스템 운영서버는 특별주문 사양결정 프로그램 을 실행하여 특별주문 사양결정 처리를 수행한다. 시스템 운영서버는, 특별주문 사양결정 처리에서, 먼저 기 본로봇 선택정보(또는 작업 분류정보 및 기본로봇 선택정보)로부터 기본 로봇에 관련된 가변 사양 항목을 가변 사양 데이터베이스에서 추출한다(단계 S9). 또한, 기본 로봇에 관련된 가변 사양 항목 중, 기득(旣得)의 작업 분류 정보와 관련성이 없는 것은 추출 대상에서 제외되어도 좋다. 시스템 운영 서버는, 추출한 가변 사양의 각 항목과 이들 가변 사양 항목 중 적어도 하나의 사양을 포함하는 요구사양 정보의 입력요구를 병합해서 또는 개별적으로 표시시키는 요구사항 입력화면 정보를 고객 단말기로 송신하고(단계 S10), 요구사항 입력화면(도 6 참조)을 고객 단말기에 출력 표시시킨다 (단계 S11). 도 6은 고객 단말기에 표시되는 요구사항 입력화면의 일례이다. 요구사항 입력화면은 선택된 기본로 봇의 가변 사양 항목과 그 가변 사양 항목으로의 요구사양 정보 입력부가 설치되어 있다. 요구사양 정보 입력부 는 예를 들어, 가변 사양 항목의 가변 범위에 대응한 슬라이더로 되어 있고, 고객은 화면상에서 슬라이더를 이 동시켜 각 가변 사양 항목에 대한 요구 사양 정보를 입력한다. 또한, 제시되는 가변 사양 항목에는, 작동 범위, 동작 자세, 동작 진동 특성, 동작 속도, 위치 결정 정밀도, 궤 적 정밀도, 발생력, 운반가능 중량, 및 가격 중 적어도 하나가 포함되어 있다. 각 가변 사양 항목은, 링크 부재 의 길이, 모터 출력, … 과 같이 로봇의 구성 부품을 직접적으로 이끌어내는 것이 아니라, 동작 범위, 운반가능 중량, … 과 같이, 고객이 로봇에게 시키는 작업(동작)을 직감적으로 이해할 수 있는 항목으로 되어 있다. 고객 단말기는 입력된 요구사양 정보를, 시스템 운영서버로 보낸다(단계 S12). 요구사양 정보를 취득한 시스템 운영서버는, 요구사양 정보가 입력된 가변 사양 항목에 관해서는 그 요구 사항 정보를 채용하여, 나 머지의 가변 사양 항목에 대해서는 소정의 표준 사양을 채용한 로봇의 특별 주문 사양을 결정한다 (단계 S13).즉, 로봇의 특별 주문 사양은, 기본 로봇에다 고유의 기본 사양을 기반으로 하여, 기본 사양 중 일부 또는 전부 의 가변 사양 항목이 요구 사항으로 대체된 것이다. 또한, 상기에서는, 고객이 제공한 요구 사양 정보가 로봇의 특별 주문 사양과 직접적으로 대응하고 있다. 단, 시스템 운영 서버가 고객이 제공한 작업 대상 정보 및 작업 내용 정보에 따라 연산을 수행하여, 로봇의 특별 주문 사양을 결정하여도 좋다. 작업 대상 정보는 로봇의 작업 대상에 관한 정보로서, 예를 들어, 작업 대상의 치수, 개수, 무게 및 외형 중 적어도 하나의 정보를 포함한다. 또, 작업 내용 정보는 로봇이 작업 대상에 대해 서 실시하는 작업에 대한 정보이며, 예를 들어, 로봇의 작업 공정, 반송(搬送) 거리, 반송 개소(箇所) 및 사용 공구 중 적어도 하나의 정보를 포함한다. 예를 들어, 시스템 운영 서버는 로봇의 특별 주문 사양을 결정함에 즈음하여, 고객에게 질문하게끔 고객 단말기에 질문을 표시 출력 및/또는 음성 출력시켜, 고객이 고객 단말 기에 입력한 답신의 접수를 반복하여, 작업 대상 정보 및 작업 내용 정보를 취득하고, 취득한 작업 대상 정 보 및 작업 내용 정보에 따라 특별 주문 사양을 결정해도 좋다. 시스템 운영 서버는, 예를 들어, 작업 대상 정보가 2개의 1리터의 물이 들어간 병에서, 작업 내용 정보가 1 미터의 반송 및 정렬의 경우에, 운반가능 중량 을 2 킬로그램, 동작 범위를 1 미터, 위치 결정 정밀도를 중간 정도, 궤적 정밀도를 중간 정도 … 라는 것과 같 이, 가변 사양 항목 중 하나에 관해서 요구 사항을 정하고, 이들 요구 사항이 포함되도록 로봇의 특별 주문 사 양을 결정한다. 또한, 작업 대상 정보 및 작업 내용 정보의 조합으로부터 요구 사양 (또는 직접적으로 특별 주 문 사양)을 결정하는 처리에 관해서는, 예를 들어, 미리 다수의 교사(敎師) 데이터로부터 반복적으로 학습하여 규칙을 분석하고, 그 규칙을 처리하는 데이터에 적용시키는 것으로, 요구 사양 (또는, 직접적으로 특별 주문 사 양)을 결정할 수 있다. 상기와 같이 로봇의 특별주문 사양결정 시스템 운영서버는 적합성 검토 프로그램을 실행하고, 부품 적합성 검토 처리를 수행한다(단계 S14). 시스템 운영 서버는, 부품 적합성 검토 처리에서 특별 주문 사양을 실현하 도록 부품 적합성 검토 결과 데이터베이스를 참조하여, 부품 데이터베이스에 기억된 부품 중에서 기 본 로봇의 구성 부품을 포함하는 로봇의 구성부품의 조합을 탐색한다. 시스템 운영 서버는, 부품 적합성 검토 결과 데이터베이스를 참조하여 특별 주문 사양에 대응하는 데이 터를 탐색하고, 대응하는 데이터가 있으면 그 데이터를 바탕으로 로봇의 구성 부품의 조합을 결정한다. 또, 시 스템 운영 서버는 부품 적합성 검토 결과 데이터베이스를 참조하여 특별 주문 사양에 대응하는 데이터 가 없으면, 부품 적합성 검토 결과 데이터베이스에 기억된 데이터를 학습하여 규칙을 분석하고, 이 규칙을 특별 주문 사양에 적용시킴으로써 특별 주문 사양을 만족하게 되는 데이터를 예측하고, 로봇의 구성부품의 조합 을 결정한다. 예를 들어, 시스템 운영 서버는, 부품 적합성 검토 처리에서, 동작 범위의 요구 사양과 운반가능 중량의 요 구 사양을 병합해서 제공하게끔 링크 부재의 소재, 링크 부재의 길이, 관절 부재, 및 관절 구동 장치를 포함하 는 부품의 조합 및 구성을 탐색한다. 또, 예를 들어, 시스템 운영 서버는, 부품 적합성 검토 처리에서, 위치 결정 정밀도의 특별 주문 사양과 동작 속도의 특별 주문 사양을 병합해서 실현하게끔, 링크 부재의 소재, 관절 부재, 관절 구동 장치, 및 컨트롤러를 포함하는 부품의 조합 및 구성을 탐색한다. 시스템 운영 서버는, 로봇의 구성부품의 탐색을 완료하면 커스텀 로봇 제시 프로그램을 실행하고, 커스텀 로 봇 제시처리를 수행한다. 시스템 운영 서버는 커스텀 로봇 제시 처리에서 커스텀 로봇 제시 화면 정보를 고 객 단말기로 전송하고(단계 S15), 고객 단말기에 커스텀 로봇 제시화면(도 7 참조)을 표시 출력시킨 다(단계 S16). 여기서, 시스템 운영 서버는 시뮬레이션 툴 데이터베이스에 기억된 시뮬레이션 툴을 이 용하여, 기본 로봇에 탐색된 부품을 실장한 로봇의 가상체를 고객 단말기로 출력 표시시킬 수 있다. 도 7은, 커스텀 로봇 제시화면의 일례이다. 커스텀 로봇 제시화면은 상기와 같이 고객의 요구 사양에 따라 커스터마이즈된 특별 주문 사양의 로봇 가상체가 표시된다. 이 가상체는 정지화상(靜止畵像)으로서 표시되 어도 좋고, 작업을 행하는 동영상으로 표시되어도 좋고, 고객의 조작에 따라 화면상에서 움직이도록 표시되어도 좋다. 이와 같이, 고객은 커스텀 로봇 제시화면을 시인(視認)하고, 또, 화면상의 로봇 가상체를 움직이게 하는 것에 의해, 자신의 요구 사양에 따라 커스터마이즈된 커스텀 로봇을 부담 없이 시험할 수 있다. 또한, 커스텀 로봇 제시화면(이것은 로봇의 가상체가 표시된 화면과 다른 화면이라도 좋다)에는 로봇의 견 적 금액이 표시된다. 이와 같이, 고객은 로봇을 구입하기 전에 로봇의 가격을 알 수 있다. 더욱이, 커스텀 로봇 제시화면(이것은 로봇의 가상체나 견적이 표시된 화면과 다른 화면이라도 좋다)에는, 표시한 로봇의 발주(發注) 입력부가 설치되어 있다. 고객은 로봇의 가상체를 시험하고 나서, 로봇의 구입을 결정할 수 있다. 고객이 로봇을 구입하는 경우는, 발주(發注) 입력부에 주문을 입력하고 발주 정보가 고객 단말기 에서 시스템 운영 서버로 보내진다(단계 S17). 또한, 발주 정보에는 커스텀 로봇 제시화면에 제시된 로봇을 특정하는 정보나 수신처나 사용자 등의 고객에 관한 정보, 지불 방법 등의 지불 정보가 포함되어 있다. 발주 정보를 수취한 시스템 운영 서버는, 수주(受注) 프로그램을 실행하여, 로봇의 수주 처리를 행한다(단계 S18). 시스템 운영 서버는 주문 처리에서 수주한 로봇의 조립 부품 일식(一式: 한 벌 또는 그 전부)을 포함 하는 납품 리스트 정보를 생성한다. 또한, 각 조립 부품은 고객이 로봇을 조립할 때의 조립 단위가 되고 있다. 생성된 납품 리스트 정보는, 시스템 운영 서버로부터 로봇 제조업체 단말기로 보내진다. 납품 리스트 정보를 접수한 로봇 제조업체 단말기는, 조립 부품의 제조 스케줄 정보를 생성한다. 조립 부품 및 그 제조 스케줄 정보는, 로봇 제조업체의 제조 부문으로 전달된다. 또, 조립 부품의 제조 스케줄 정보는, 고 객 단말기가 액세스 가능한 어드레스 및 액세스 키와 함께 고객 단말기로 보내진다. 로봇 제조업체의 제조 부문에서는, 조립 부품의 가공 장소에 웹 카메라(도 1 참조)가 설치되어 있다. 그리 고 고객 단말기는 조립 부품의 제조 스케줄 정보에 타이밍을 맞추고, 로봇 제조업체의 제조 부문의 웹 카메 라에 액세스함으로써 조립 부품의 가공 현장의 영상을 고객 단말기의 화면에 비출 수 있다. 고객은 고객 단말기의 화면에 비치는 조립 부품의 가공 현장의 영상을 보는 것에 의해, 가공의 진척이나 상태를 알 수 있 다. 도 8은, 로봇 조립 부품의 일례를 나타내는 도면이고, 도 9는, 도 8의 조립 부품이 조립되어 이루어질 로봇을 나타낸 도면이다. 또한, 도 8 및 도 9에서는, 컨트롤러는 생략되어 있다. 도 8 및 도 9에 나타내는 로봇은, 기대와, 기대에 선회 가능하게 지지된 선회대(旋回臺)와, 관 절 부재를 통해 연결된 제1 링크와, 제1 링크에 관절 부재를 통해 연결된 제2 링크와, 제2 링크의 선단부 (즉, 로봇 팔의 손끝부)에 관절 부재를 통해 연결된 엔드 이펙터와, 관절 구동장치 (91,92)를 포함한다. 기대에는 인터페이스가 설치되어 있고, 여기에 배선을 통해 컨트롤러(도시 생략) 가 접속된다. 제1 링크 및 제2 링크는 각(角) 파이프로 구성되어 있으며, 제조 시에 각(角) 파이프 절단 길이를 변경 하는 것에 의해, 링크의 길이를 용이하게 조정할 수 있다. 또, 제1 링크와 제2 링크를 연결하는 관절 부재 는 끼워 맞추기 또는 나사 끼워 맞추기에 의해 제2 링크에 고정된다. 따라서, 제2 링크의 제조 시 에 제2 링크에 형성하는 나사구멍의 위치 또는 끼워 맞추기 형상부의 위치를 변경함으로써, 제2 링크로 의 관절 부재의 부착 위치(즉, 제1 링크의 연결 위치)를 용이하게 변경할 수 있다. 상기와 같이 로봇 은, 고객의 요구 사양에 따라 부품뿐만 아니라 부품 자체의 형상도 커스터마이즈될 수 있도록 되어 있다. 상기의 로봇은, 조립 부품의 상태, 즉 미완성품 상태에서, 도 10에 나타내는 것과 같은 포장 상자에 채 워진다. 그리고 조립 부품 일식(一式)이 패키지된 조립 키트로서 로봇 제조업체로부터 고객에게 발송된다. 로봇 의 동작 프로그램은 그 프로그램을 저장한 기록 매체로서 고객에게 인도되어도 좋고, 미리 컨트롤러에 설치되어 있어도 좋다. 로봇 조립 키트를 받은 고객은, 첨부된 조립도를 참조하면서 조립 부품을 조합하여 로봇을 완성시킨다. 또한, 로봇의 조립 작업에 즈음하여, 나사 조임이나 끼워 맞추기, 접착처럼 비교적 취급하기 용이한 고정 수단을 이용 하면 완성되도록 로봇의 각 조립 부품이 구성되어 있다. 이와 같이, 로봇은 고객자신이 용이하게 조립할 수 있 도록 구성되어 있으며, 조립 부품 일식(一式)을 갖춘 조립 키트로서 고객에게 인도된다. 즉, 로봇은 DIY (Do It Yourself) 로봇 조립 키트로서 고객에게 인도되고, 다른 부품을 입수하는 일 없이 그 자리에서 조립할 수 있다. 이상 설명한 바와 같이, 본 실시형태의 로봇의 거래 시스템은 로봇의 거래를 행하는 로봇의 거래 시스템으로 서, 로봇의 기초가 되는 기본 로봇마다 그 기본 로봇의 소정의 기본 사양 중 가변 사양에 관한 정보가 기억된 가변 사양 데이터베이스; 고객 단말기에서 기본 로봇의 선택을 받고 가변 사양 데이터베이스에서 선택된 기본 로봇의 가변 사양 항목 을 추출하고, 기본 사양에서 가변 사양 항목 중 적어도 하나가 변경된 특별 주문 사양을 결정하는 특별 주문 사 양 결정부; 기본 로봇의 구성부품 및 기본 로봇에 장착 가능한 부품에 관한 정보가 기억된 부품 데이터베이스; 부품 데이터베이스에 기억된 부품 중에서 특별 주문 사양을 실현하는 로봇을 구성하는 부품의 조합을 탐색 하는 적합성 검토부; 기본 로봇에 탐색된 부품을 실장한 로봇의 가상체를 고객 단말기로 출력 표시하는 커스텀 로봇 제시부; 고객 단말기에서 로봇의 주문을 받아, 로봇을 수주하는 수주부;를 구비하는 것을 특징으로 하고 있다. 또한, 본 실시형태에서는 특별 주문사양 결정 프로그램을 실행하는 시스템 운영 서버의 프로세서가 특별 주문사양 결정부로서 기능하고, 적합성 검토 프로그램을 실행하는 시스템 운영서버의 프로세서가 적합성 검토부로서 기능하고, 커스텀 로봇 제시 프로그램을 실행하는 시스템 운영서버의 프로세서가 커스텀 로 봇 제시부로서 기능하고, 수주 프로그램을 실행하는 시스템 운영 서버의 프로세서가 수주부(受注部)로서 기능하고 있다. 단, 가변 사양 제시부, 적합성 검토부 및 커스텀 로봇 제시부 중 적어도 하나의 기능부가, 고객 단말기가 대응하는 프로그램을 다운로드하고 실행함으로써 실현되고 있다. 또, 본 실시형태에 관계되는 로봇의 거래 시스템은 시스템 운영 서버와 고객 단말기 사이에서 네트워 크를 통해 전자 데이터를 송수신하는 것을 전제로 하고 있지만, 로봇의 거래 시스템은 하나의 컴퓨터 내 에서의 처리에 의해 실현되어도 좋다. 마찬가지로, 본 실시형태에 관계되는 로봇의 거래 방법은, 고객에게 로봇의 기초가 되는 기본 로봇의 선택을 재 촉하고, 기본 로봇의 선택을 받아서, 기본 로봇의 소정의 기본 사양 중 가변 사양에 관한 정보군(情報群)으로부 터 선택된 기본 로봇의 가변 사양 항목을 추출하여, 기본 사양으로부터 가변 사양 항목 중 적어도 하나가 변경 된 특별 주문 사양을 결정하고, 기본 로봇의 구성부품 및 기본 로봇에 장착 가능한 부품에 관한 정보군으로부터 특별 주문 사양을 실현하는 로봇을 구성하는 부품을 탐색하고, 고객에게 기본 로봇에다 탐색된 부품을 실장(實 裝)한 로봇의 가상체를 제시하고, 고객에게 로봇의 발주 입력을 재촉하고, 로봇의 주문을 받아, 로봇을 수주하 는 것을 특징으로 하고 있다. 상기 로봇의 거래 시스템 및 거래 방법에 의하면, 고객이 요구하는 사양에 따라 커스터마이즈된 커스텀 로봇 의 가상체가 고객에게 제시되므로, 고객은 커스텀 로봇을 부담 없이 시험할 수 있다. 또, 네트워크를 통한 전자 데이터를 송수신하는 것에 의해, 고객의 요구하는 사양에 커스터마이즈된 로봇의 구성이 결정되므로, 로봇 의 부품 적합성 검토 및 설계 등에 인간이 개입하지 않는 분만큼, 비용을 삭감할 수 있고, 로봇 제조업체는 로 봇을 저렴하게 제공하고, 또 고객은 커스텀 로봇을 저렴하게 취득할 수 있다. 또, 본 실시형태에 관계되는 로봇의 거래 시스템은 기본 로봇에 적합한 작업 분류를 포함하는 기본 로봇에 관한 정보가 저장된 기본 로봇 데이터베이스와, 고객 단말기에서 기본 로봇의 선택을 받기 전에, 고객 단말기에서 로봇이 실시하는 작업에 관한 작업 분류 정보를 받아, 작업 분류 정보에 따라 작업 분류에 적합 한 하나 또는 복수의 기본 로봇을 기본 로봇 데이터베이스에서 탐색하고, 탐색된 기본 로봇을 고객 단말기로 출력 표시시키는, 기본 로봇 탐색부를 더 구비하고 있다. 또한, 본 실시형태에서는, 기본 로봇 탐색 프로그램을 실행하는 시스템 운영 서버의 프로세서가 기본 로 봇 탐색부로서 기능하고 있다. 단, 고객 단말기가 대응하는 프로그램을 다운로드 하여 실행함으로써, 기본 로봇 탐색부로서 기능해도 좋다. 마찬가지로, 본 실시형태에 관계되는 로봇의 거래 방법은, 고객에게 기본 로봇의 선택을 재촉하기 전에, 고객에 게 로봇이 실시할 작업 분류에 관한 작업 분류 정보의 입력을 재촉하고, 작업 분류 정보를 받고, 기본 로봇에 적합한 작업 분류를 포함하는 기본 로봇에 관한 정보군에서 작업 분류에 적합한 하나 또는 복수의 기본 로봇을 탐색하고, 고객에게 탐색된 기본 로봇을 제시하는 공정을 포함한다. 이와 같이, 로봇에게 행하게 할 작업에 따라, 복수의 기본 로봇 중에서 작업에 적합한 기본 로봇이 고객에게 제 안된다. 따라서, 고객은 로봇에 관한 지식을 가지고 있지 않아도 로봇에게 행하게 할 작업 내용에 적합한 기본 로봇을 선택할 수 있다. 또한, 기본 로봇을 탐색하는 기능부 및 공정은 로봇 제조업체가 제안하는 기본 로봇이 1태양(一態樣)인 경우에는 생략되어도 좋다. 또, 본 실시형태에 관계되는 로봇의 거래 시스템에서, 특별 주문 사양 결정부(특별주문 사양결정 프로그램을 실행하는 시스템 운영 서버의 프로세서)는, 가변 사양 항목과, 그 가변 사양 항목 중 적어도 하나에 대 한 요구 사양 정보의 입력 요구를 고객 단말기에 출력 표시하고, 고객 단말기로부터 요구 사양 정보를 받 고, 받은 요구 사양 정보에 따라 특별 주문 사양을 결정한다. 이것에 의하면, 고객은 원하는 가변 사양 항목을 요구 사양이라고 할 수 있다.단, 특별 주문 사양 결정부는, 로봇의 작업 대상에 관한 작업 대상 정보와, 로봇이 작업 대상에 대해 실시하는 작업에 관한 작업 내용 정보를 고객 단말기로부터 받고, 작업 대상 정보 및 작업 내용 정보에 근거하여 특별 주문 사양을 결정해도 좋다. 이것에 의하면, 고객에게 로봇에 관한 지식이 없어도 특별 주문 사양 결정부는, 고 객의 직감(直感)을 바탕으로 로봇의 특별 주문 사양을 결정할 수 있다. 또, 본 실시형태에 관계되는 로봇의 거래 시스템에서 수주부는 로봇을 수주하여 로봇 조립 부품 일식(一式) 을 포함하는 납품 리스트를 생성한다. 마찬가지로, 본 실시형태에 관계되는 로봇의 거래 방법은 로봇을 수주하여, 로봇의 조립 부품 일식(一式)을 포 함하는 납품 리스트를 생성하는 공정을 더 포함한다. 이 경우, 로봇이 로봇 조립 부품 일식이 패키지된 조립 키 트의 상태에서 고객에게 발송되어도 좋다. 이와 같이, 로봇이 조립 부품 일식(一式)으로서 고객에게 인도되는 것에 의하면, 고객은 다른 부품을 입수하거 나 할 필요 없이 그 장소에서 로봇을 조립할 수 있다. 또, 근년의 세계 정세에 따르면, 고도의 기술을 가진 조 립 제품(예를 들어, 로봇)은 테러 방지의 관점에서 수출이 제한되고, 국내에 반입하는 경우에 세밀한 검사를 받 으며, 그 검사 결과에 따라서는 분해 조사의 대상이 되는 일도 있다. 이에 대해, 본건과 같이 조립 키트 상태로 국내에 반입되는 경우에는 개별 부품의 구성은 일견(一見)해서 분명하고, 분해 조사의 대상이 되지 않고 세관을 통과할 수 있다. 또, 본 실시형태에 나타낸 로봇의 거래 시스템 및 거래 방법에서는, 가변 사양 항목이 동작범위, 동작 자세, 동작 진동 특성, 동작 속도, 위치 결정 정밀도, 궤적 정밀도, 발생력, 운반가능 중량 및 가격 중 적어도 하나를 포함한다. 이와 같이, 가변 사양 항목이 고객이 로봇에게 시키는 작업(동작)을 직감적으로 이해할 수 있을 것 같은 항목으 로 되어 있기 때문에, 고객이 로봇의 구조에 관한 지식을 갖지 않아도, 원하는 작업을 수행할 로봇을 발주(發注)할 수 있다. [제2 실시형태] 본 발명의 제2 실시형태에 관계되는 거래 시스템에 대해 설명한다. [로봇의 구성] 도 11은, 본 발명의 제2 실시형태에 관계되는 로봇의 거래 시스템의 상거래의 대상이 되는 로봇의 일 례를 나타내고 있다. 도 11에 나타내는 바와 같이, 로봇은 제어 유닛과, 적어도 하나의 가동 유닛 (182,183)과, 엔드 이펙터 유닛과의 연설체(연속적으로 이어져 설치된 것)이다. 가동 유닛(182,183)은 회 전 유닛과 구부림 유닛을 포함한다. 로봇은 벽걸이용 베이스, 천정 매달기용 베이스, 플로어 (floor)설치용 베이스, 클립형 베이스 등의 제어 유닛을 보지(保持)하는 베이스(도시 생략)과 함께 사용된 다. 클립형 베이스는, 로봇을 받침대와 프레임 등에 부착하기 위한 클립을 갖는다. 제어 유닛은 원주(圓柱)모양을 나타내고 로봇의 동작을 제어하는 컨트롤러나 전원 공급 장치(모두 도 시 생략)가 내장되어 있다. 제어 유닛의 한쪽 끝면에는 원형의 접속 인터페이스가 설치되어 있다. 회전 유닛은, 겹쳐 놓은 2개의 짧은 원주(圓柱)를 그들 중심선을 회동(回動: 양방향으로 회전하는 것) 중 심으로서 회동 가능하게 연결된 것이고, 전체적으로 원주(圓柱)모양을 나타내고 있다. 회전 유닛은 2 개의 짧은 원주(圓柱) 중 일방(一方)에 대해서 타방(他方)을 회전시키기 위한 모터, 감속기 및 모터 드라이버 (모두 도시 생략)가 내장되어 있다. 회전 유닛의 양 끝면에는 원형의 접속 인터페이스가 설치되어 있다. 구부림 유닛은 원통모양의 2 개의 링크가 구부림 관절로 연결된 것이다. 다시 말해, 구부림 유닛은 2 개의 링크가 이들 긴 쪽 길이방향과 직교하는 회동 축을 중심으로 해서 회동 가능하게 연결된 것이다. 구부림 유닛에는 2 개의 링크 중 일방에 대해서 타방을 회전시키기 위한 모터, 감속기 및 모터 드라이버 (모두 도 시 생략)가 내장되어 있다. 구부림 유닛의 각 링크의 관절과 반대쪽의 끝면에는 원형의 접속 인터페이스가 설치되어 있다. 엔드 이펙터 유닛은 원형의 접속 인터페이스가 설치된 기부(基部)와 툴(tool)부로 이루어진다. 기부(基部)에는 툴(tool)부를 동작시키기 위한 모터, 감속기 및 모터 드라이버 (모두 도시 생략)가 내장되어 있다. 도 11에 보여주는 엔드 이펙터 유닛은 워크를 파지(把持)하는 척(chuck)이지만, 엔드 이펙 터의 툴부의 태양(態樣)은 이에 한정되지 않는다.로봇은 고객의 요망에 따라 구성 유닛을 바꿀 수 있는 커스터마이즈 가능한 로봇이다. 각 유닛(181~184)에 설치된 접속 인터페이스는, 공통적이거나 또는 대응하고 있으며, 각 유닛(181~184)의 접속 인터페이스끼리 자유 롭게 연결할 수 있다. 예를 들어, 회전 유닛에는 제어 유닛, 다른 회전 유닛, 구부림 유닛 및 엔드 이펙터 유닛을 선택적으로 연결할 수 있다. 또, 예를 들어, 구부림 유닛에는 제어 유닛 , 회전 유닛, 다른 구부림 유닛 및 엔드 이펙터 유닛을 선택적으로 연결할 수 있다. 도 11에 예시(例示)되는 로봇은, 제어 유닛, 제1 회전 유닛 제1의 구부림 유닛, 제2의 구 부림 유닛, 제3의 구부림 유닛, 제2 회전 유닛 및 엔드 이펙터 유닛의 순서로 각 유닛이 직렬로 연결된 수직 다관절형의 5축 로봇이다. 이 로봇의 암(arm)부(즉, 적어도 1 개의 가동 유닛에서 구 성되는 부분)를 구성 변경하는 것에 의해, 로봇의 자유도나 동작 범위 등을 변경할 수 있다. 예를 들면, 도 12에 예시(例示)되는 로봇(108')은, 제어 유닛, 제1 구부림 유닛, 제2의 구부림 유닛 , 제3 구부림 유닛 및 엔드 이펙터 유닛의 순서로 각 유닛이 직렬로 연결된 수평 다관절형의 3 축 로봇이다. 로봇(108')의 엔드 이펙터 유닛의 툴부는, 예를 들면 기판 등의 경량의 작업을 아래에 서 떠 올리고 보지(保持)하는 워크 반송용 블레이드(blade)이다. 도 11에서 나타내는 로봇과 도 12에 보여주는 로봇(108')이란, 제어 유닛 및 103조(組)의 구부림 유 닛이 공통된다. 도 11에서 나타내는 로봇의 구성 유닛의 일부 또는 전부를 이용하여 수평 다관절형으 로 변형할 수 있다. 마찬가지로, 도 12에 보여주는 로봇(108')의 구성 유닛에 몇 개의 유닛 (예를 들어, 회전 유닛)을 추가하여 수평 다관절형으로 변형할 수 있다. [로봇 거래 시스템의 구성] 본 실시형태에 관계되는 로봇 거래 시스템은, 상기 로봇의 상거래를 행하는 것이다. 로봇은 고 객의 요망에 따라 커스터마이즈할 수 있지만, 로봇 전문 지식을 갖지 아니한 고객에게는, 요망에 따른 동작을 행하는 로봇을 어떻게 구성하면 좋은지를 적절한 가이드 없이 검토하는 것이 어렵다. 이에, 로봇의 거래 시스템에서는 이러한 전문 지식을 갖지 아니한 고객이라도 요구 사양에 커스터마이즈된 커스텀 로봇을 용 이하게 설계하고, 부담 없이 시험하고, 동시에, 저렴하게 취득할 수 있도록 하고 있다. 도 13은, 본 발명의 제2 실시형태에 관계되는 로봇의 거래 시스템의 네트워크 구성을 나타내는 도면이다. 도 13에 나타내는 바와 같이, 로봇의 거래 시스템은 인터넷 등의 네트워크에 의해 접속된 고객 단말 기와, 시스템 운영 서버와, 로봇 제조업체 단말기를 포함한다. 네트워크를 통함으로써, 고 객 단말기와 시스템 운영 서버와의 사이에서 데이터의 송수신이 가능하다. 또, 네트워크를 통함 으로써, 로봇 제조업체 단말기와 시스템 운영 서버와의 사이에서 데이터의 송수신이 가능하다. 또한, 본 실시형태에서는 예시하지 않지만, 네트워크를 통해 로봇 제조업체 단말기와 고객 단말기와의 사이에서 데이터의 송수신이 행해져도 좋다. 도 14는, 시스템 운영 서버의 상세한 구성의 일례를 나타내는 도면이다. 도 14에 나타내는 바와 같이, 시 스템 운영 서버는, 통신 인터페이스와, 처리 장치와, 저장 장치(M1~M9)를 구비하고 있다. 또한, 도 14에서 부호(M1~M9)가 붙여진 프레임이 기억 장치를 나타내며, 그 프레임에 기재되어 있는 내용이 기억 장치 에 기억되어 있는 정보를 나타낸다. 처리 장치는, CPU 등의 연산부와, ROM 및 RAM 등의 기억부 등을 갖는 컴퓨터이고, CPU가 기억부나 저장 장 치(M7, M9)에 미리 기억되어 있는 소정의 프로그램을 실행함으로써 로봇의 거래에 관계되는 각종 처리를 실행한 다. 통신 인터페이스는, 처리 장치에 의해 제어됨으로써 네트워크를 통한 정보의 송수신을 제어한다. 저장 장치(M1~M9)는 로봇의 거래에 관계되는 각종 처리에 이용되는 데이터나 프로그램 등이 기억되어 있다. 처 리 장치는 이들 저장 장치(M1~M9)에 기억된 정보를 읽어내거나, 이들 저장 장치(M1~M9)로 정보를 기억시키 거나 할 수 있다. 저장 장치(M1)에는 고객 정보가 저장된 고객 정보 데이터베이스가 구축되어 있다. 고객 정보는, 고객 ID, 고객 성명, 고객 주소, 구입 이력 등을 포함한다. 구입 이력은 고객이 소유한 로봇의 구성 유닛에 관한 정보를 포함 한다. 처리 장치는 고객 ID를 기반으로 고객 정보 데이터베이스에 저장된 고객 정보를 읽어낼 수 있다. 저장 장치(M2)에는 기본 로봇 정보가 기억된 기본 로봇 데이터베이스가 구축되어 있다. 기본 로봇 정보는 수직 다관절형의 기본 로봇 정보와 수평 다관절형의 기본 로봇 정보를 포함한다. 수직 다관절형의 기본 로봇 정보는, 기본 로봇의 식별 번호와 로봇의 기본 구성을 포함한다. 또, 수평 다관절형의 기본 로봇 정보는, 기본 로봇의 식별 번호와 로봇의 기본 구성을 포함한다. 로봇의 기본 구성은 로봇의 최소 구성인 제어 유닛, 구부림 유 닛, 및 엔드 이펙터 유닛의 연설(連設) 구성을 포함한다. 나아가, 기본 로봇 정보는 기본 로봇에 적 합한 작업 분류 등의 성능 정보를 포함한다. 로봇의 작업 분류에는 예를 들면, 경량물의 반송, 접수·안내 등의 서비스 제공, 드라이버 등의 작업 공구를 사용한 체결 가공, 절삭·연삭·연마 등의 기계 가공, 용접·도장 등 의 특수 기구를 사용한 가공 등이 있다. 단, 로봇의 작업 분류는 상기(上記)에 한정되지 않는다. 저장 장치(M3)에는 가동 유닛인 회전 유닛 및 구부림 유닛에 관한 정보가 저장된 가동 유닛 데이터베 이스가 구축되어있다. 회전 유닛, 및 구부림 유닛은 모두 원칙적으로 1종류이지만, 모터 출력이 다른 고출력 타입, 유닛 길이가 다른 긴 타입 등의 복수 종류의 것이 준비되어도 좋다. 저장 장치(M4)에는 엔드 이펙터 유닛에 관한 정보가 기억된 엔드 이펙터 유닛 데이터베이스가 구축되어 있 다. 엔드 이펙터 유닛에는, 예를 들어, 도장(塗裝) 건(gun), 용접 건, 흡착 핸드, 재치(載置) 핸드, 파지 (把持) 핸드 등의 툴(tool)부의 서로 다른 복수의 종류의 것이 준비되어 있다. 저장 장치(M5)에는, 엔드 이펙터 유닛에 대응하는 드레싱 부품(예를 들어, 공기 배관, 유압 배관, 배선 등)에 관한 정보가, 엔드 이펙터 유닛의 종류에 관련지어서 기억된 드레싱 부품 데이터베이스가 구축되어 있다. 이들 드레싱 부품은, 로봇에 장착 가능하다. 저장 장치(M6)에는, 기본 로봇의 사양 중 가변 사양에 관한 정보를 기본 로봇마다 저장한 가변 사양 데이터베이 스가 구축되어 있다. 처리 장치는, 예를 들어, 기본 로봇의 식별 번호에 따라, 대응하는 가변 사양에 관한 정보를 가변 사양 데이터베이스로부터 읽어낼 수 있다. 가변 사양에 관한 정보는, 기본 로봇의 가변 사양 항목 과, 각 항목의 초기값을 포함한다. 기본 로봇의 가변 사양 항목은, 예를 들어, 축수(軸數), 동작 범위를 포함한 다. 또한, 회전 유닛 및/또는 구부림 유닛이 모터 출력의 서로 다른 복수의 종류가 준비되어 있는 경 우에는, 가변 사양 항목은, 더욱더 동작 진동 특성, 동작 속도, 위치 결정 정밀도, 궤적 정밀도, 발생력, 운반 가능 중량 및 가격대 중 적어도 하나를 포함해도 좋다. 기본 로봇의 가변 사양 항목은 기본 로봇마다 차이가 있 을 수 있다. 가변 사양 항목 중 축수(軸數)란, 로봇의 관절수(關節數)이며, 이에 따라 로봇을 구성하는 유닛의 수가 변화한 다. 가변 사양 항목 중 동작 범위란, 예를 들어, 제어 유닛에 주어진 로봇 좌표 원점으로부터의 엔드 이펙터 유닛에 주어진 핸드 기준점의 동작 범위이다. 가변 사양 항목 중 동작 자세란, 로봇이 작업을 행할 때의 엔드 이펙터 유닛의 자세이다. 동작 자세의 요 구 사양을, 예를 들면, 워크를 상방향(上方向)으로 지지, 워크를 하방향(下方向)으로 매달기 등의 항목에서 선 택할 수 있다. 가변 사양 항목 중 작동 진동 특성이란, 로봇이 동작 할 때의 핸드 기준점의 진동 주파수에 대한 것이다. 기본 로봇마다 동작 진동 특성에 관한 복수의 수치가 규정되어 있으며, 동작 진동 특성의 요구 사양을 소정의 값 중 에서 선택할 수 있다. 가변 사양 항목 중 동작 속도란, 로봇이 동작 할 때의 핸드 기준점의 이동 속도이다. 기본 로봇마다 동작 속도 범위가 규정되어 있으며, 동작 속도의 요구 사양을 소정의 동작 속도 범위에서 설정할 수 있다. 가변 사양 항목 중 위치 결정 정밀도란, 핸드 기준점이 지령 위치로 이동한 때의 지령 위치와 실제 핸드 기준점 의 위치와의 편차에 대한 것이다. 기본 로봇마다 위치 결정 정밀도에 관한 수치 범위가 규정되어 있으며, 위치 결정 정밀도의 요구 사양을 소정의 수치 범위로부터 설정할 수 있다. 가변 사양 항목 중 궤적 정밀도란, 핸드 기준점이 기준 위치에서 지령 위치로 이동할 때의 지령 궤적과 실제 손 끝부의 궤적과의 편차에 대한 것이다. 기본 로봇마다 궤적 정밀도에 관한 수치 범위가 규정되어 있으며, 궤적 정밀도의 요구 사양을 소정의 수치 범위로부터 설정할 수 있다. 가변 사양 항목 중 발생력이란, 핸드 기준점에 발생시킬 수 있는 힘·모멘트이다. 기본 로봇마다 발생력에 관한 수치 범위가 규정되어 있으며, 발생력의 요구 사양을 소정의 수치 범위로부터 설정할 수 있다. 가변 사양 항목 중 운반 가능 중량이란, 로봇이 운반할 수 있는 워크의 최대 중량이다. 기본 로봇마다 운반 가 능 중량에 관한 수치 범위가 규정되어 있으며, 운반 가능 중량의 요구 사양을 소정의 수치 범위로부터 설정할 수 있다. 가변 사양 항목 중 가격대(價格帶)란, 로봇의 판매 가격의 가격대이다. 기본 로봇마다 복수의 가격대가 규정되 어 있으며, 가격의 요구 사양을 복수의 가격대로부터 선택할 수 있다. 저장 장치(M7)에는, 동작 시뮬레이션 프로그램, 비용 시뮬레이션 프로그램 등의 시뮬레이션 툴(tool)이 기억되 어 있다. 처리 장치에 의해 각 시뮬레이션 프로그램이 저장장치(M7)로부터 읽어져서 실행됨으로써 처리 장 치가 시뮬레이터로서 기능한다. 동작 시뮬레이션 프로그램은, 로봇의 가상체를 모델링하고 그 모델의 행동을 예측한다. 로봇의 가상체의 예측된 행동은, 고객 단말기상에서 표시되어도 좋다. 비용 시뮬레이션 프로그램은, 로봇의 가상체를 구성하는 부 품의 가격이나 배송료 등에서 예상 비용을 산출한다. 산출된 예측 비용은, 고객 단말기상에서 표시 출력된 다. 저장 장치(M8)에는, 후술하는 특별 주문 사양을 만족하는 가동 유닛의 조합, 가동 유닛과 엔드 이펙터 유닛의 조합에 관한 정보를 저장하는 부품 적합성 검토결과 데이터베이스가 구축되어 있다. 부품 적합성 검토결과 데이 터베이스에 저장되는 정보는, 종래, 로봇 제조업체의 담당자가 수행해 온 적합성 검토의 작업 결과를 데이터베 이스화 한 것이어서 좋다. 또, 부품 적합성 검토결과 데이터베이스에 저장되는 정보는, 다양한 조건에서 행해진 부품의 적합성 검토의 시뮬레이션 결과라도 좋다. 또한, 후술하는 부품 적합성 처리의 결과는 부품 적합성 검토 결과 데이터베이스로 순차적으로 추가된다. 저장 장치(M9)에는, 예를 들어, 기본 로봇 탐색 프로그램, 특별 주문 사양 결정 프로그램, 적합성 검토 프로그 램, 로봇 제시 프로그램, 수주 프로그램, 추가 유닛 제시 프로그램 등의 로봇의 거래에 관계되는 각종 처리를 실행하기 위한 각종 프로그램이 기억되어 있다. 로봇 거래 시스템에서의 각종 처리는, 특별히 언급이 없는 한, 저장 장치(M9)에 저장된 각종 프로그램이 처리 장치에서 실행됨으로써 이루어진다. 환언하면, 처리 장치가 소정의 프로그램을 실행함으로써, 처리 장치가 그 프로그램의 내용에 따라 처리를 수행하는 처리부로서 기능한다. 구체적으로는 처리 장치 는 이들 프로그램을 실행하는 것에 의해, 기본 로봇 탐색부, 특별 주문 사양 결정부, 적합성 검 토부, 로봇 제시부, 수주부, 추가 유닛 제시부의 각 기능부로서 기능한다. 단, 각종 프로 그램의 일부 또는 전부가 네트워크를 통해 고객 단말기에 보내지고, 고객 단말기에서 실행됨으 로써, 고객 단말기가 처리 장치의 기능의 일부를 대체하여도 좋다. 다음으로, 도 15의 시퀀스 다이어그램을 이용하여 본 실시형태에 관계되는 로봇의 거래 방법을 설명한다. 또한, 특별히 언급이 없는 한, 고객 단말기, 시스템 운영 서버 및 로봇 제조업체 단말기 사이의 정보 의 주고 받기는 네트워크를 통한 데이터의 송수신에 의해 행해진다. 먼저, 고객은 고객 단말기를 이용하여 시스템 운영 서버에 액세스하여 구입을 희망하는 로봇의 기초 가 되는 기본 로봇의 탐색 요구를 송신한다(단계 S101). 이 탐색 요구에 대해, 시스템 운영 서버는, 기본 로봇 탐색 프로그램을 실행하여, 기본 로봇 탐색화면(도 16 참조)을 고객 단말기로 송신하고(단계 S102), 고객 단말기의 표시 장치(모니터 등)에 표시 출력시킨다(단계 S103). 도 16은, 고객 단말기에 표시된 기본 로봇 탐색 화면의 일례를 나타내는 도면이다. 고객은 고객 단말 기에 표시된 기본 로봇 탐색 화면의 유도(誘導)에 따라, 구입할 로봇에서 수행할 작업의 작업 분류 정보를 고객 단말기에 입력한다. 고객 단말기는 입력된 작업 분류 정보를 시스템 운영 서버에 보낸다(단계 S104). 시스템 운영 서버에서는 작업 분류 정보를 취득하고, 기본 로봇 탐색 프로그램을 실행 하고, 취득한 작업 분류 정보에 따라 기본 로봇 탐색 처리를 수행한다(단계 S105). 시스템 운영 서버는 기 본 로봇 탐색 처리에서, 기본 로봇 데이터베이스에 포함된 기본 로봇 정보로부터 그 작업 분류 정보에 적합한 것, 즉, 작업 분류 정보에 관계되는 작업을 수행할 수 있는 기본 로봇을 탐색한다. 시스템 운영 서버는, 이 탐색에 의해, 하나 또는 복수의 기본 로봇을 탐색하고, 이들 기본 로봇의 특성이나 외관을 포함시킨 기본 로 봇 탐색결과 화면정보를 고객 단말기로 송신하고(단계 S106), 기본 로봇 탐색결과 화면(도 17 참조) 을 고객 단말기에 출력 표시시킨다 (단계 S107). 또한, 기본 로봇의 탐색에 즈음하여, 인공지능 기술을 기반으로 하는 질문 응답 시스템이 적용되어도 좋다. 즉, 시스템 운영 서버는, 고객에게 자연 언어로 질문하도록 고객 단말기에 질문을 표시 출력 및/또는 음 성 출력시켜서, 고객이 고객 단말기에 입력한 자연 언어의 답신을 접수하고, 이것을 반복함으로써 고객의요구에 따른 기본 로봇을 탐색해도 좋다. 도 17은, 기본 로봇 탐색결과 화면의 일례를 나타내는 도면이다. 기본 로봇 탐색 결과 화면에서는 하 나 또는 복수의 기본 로봇이 그 특성이나 외관을 포함시킨 정보로서 나타나고 있다. 도 17에 보여주는 예에서는, 제어 유닛, 구부림 유닛 및 엔드 이펙터 유닛이 연접(連接)되어 이루어진 수직 다관 절형의 기본 로봇과, 제어 유닛, 구부림 유닛 및 엔드 이펙터 유닛이 연접되어 이루어지는 수평 다관절형의 기본 로봇이 나타나고 있다. 더 나아가, 기본 로봇 탐색결과 화면에는 탐색된 기본 로봇 중 어느 것 을 채용할 것인가의 기본 로봇 선택정보의 입력부가 설치되어 있다. 고객이 탐색된 기본 로봇을 채용하지 않는 경우는, 기본 로봇 탐색 화면에 되돌아가서 다시 기본 로봇 탐색 처리를 다시 반복한다. 고객이 탐색된 기본 로봇을 채용하는 경우, 고객 단말기는 고객이 입력한 기본 로봇 선택정보를 시스템 운 영 서버로 보낸다(단계 S108). 또한, 단계 S101~단계 S107을 생략하고, 시스템 운영 서버는 기본 로 봇 탐색결과 화면을 고객 단말기에 표시시키는 대신에, 복수 타입의 기본 로봇을 고객 단말기에 표시시켜서, 고객에게 기본 로봇의 선택정보의 입력을 재촉하도록 해도 좋다. 기본 로봇 선택정보를 취득한 시스템 운영 서버는, 특별 주문 사양결정 프로그램을 실행하여, 특별 주문 사양결정 처리를 수행한다. 시스템 운영 서버는, 특별 주문 사양결정 처리에서, 먼저 기본 로봇 선택정보 (또는 작업 분류 정보 및 기본 로봇 선택정보)로부터 기본 로봇에 관련된 가변 사양 항목을 가변 사양 데이터베 이스로부터 추출한다(단계 S109). 또한, 기본 로봇에 관련된 가변 사양 항목 중 기득(旣得)의 작업 분류 정보와 관련성이 없는 것은 추출 대상에서 제외되어도 좋다. 시스템 운영 서버는, 추출한 가변 사양의 각 항목과, 이들 가변 사양 항목 중 적어도 하나의 사양을 포함 한 요구 사양 정보의 입력요구를 병합하거나 또는 개별적으로 표시시키는 요구사항 입력화면 정보를 고객 단말 기로 송신하고(단계 S110), 요구사항 입력화면(도 18 참조)을 고객 단말기에 출력 표시시킨다 (단계 S111). 도 18은, 고객 단말에 표시되는 요구사항 입력화면의 일례이다. 요구사항 입력화면에는, 선택된 기본 로봇의 가변 사양 항목과 그 가변 사양 항목에의 요구사양 정보 입력부가 설치되어 있다. 요구사양 정보 입력부는, 예를 들어, 그 가변 사양 항목의 가변 범위에 대응한 슬라이더로 되어 있고, 고객은 화면상에서 슬라 이더를 이동시켜서 각 가변 사양 항목에 대한 요구사양 정보를 입력한다. 또한, 제시되는 가변 사양 항목은, 축수(軸數) 및 동작 범위 중 적어도 하나를 포함한다. 회전 유닛과 구 부림 유닛에 모터 출력이 서로 다른 복수의 종류가 있는 경우에는, 제시되는 가변 사양 항목은 축수, 동작 범위, 동작 자세, 동작 진동 특성, 동작 속도, 위치 결정 정밀도, 궤적 정밀도, 발생력, 운반가능 중량 및 가격 중 적어도 하나를 포함해도 좋다. 또한, 가변 사양 항목은, 링크부재의 길이, 모터 출력, … 와 같이 로봇의 구 성 유닛을 직접적으로 도출해내는 것이 아니라, 동작 범위, 운반가능 중량, … 와 같이, 고객이 로봇에게 시키 는 작업(동작)을 직감적으로 이해할 수 있는 것 같은 항목으로 되어 있다. 고객 단말기는, 입력된 요구사양 정보 시스템 운영서버로 보낸다(단계 S112). 요구 사양 정보를 취득 한 시스템 운영서버는 요구 사양 정보가 입력된 가변 사양 항목에 관해서는 그 요구 사항 정보를 채용하고, 나머지의 가변 사양 항목에 대해서는 소정의 표준 사양을 채용한 로봇의 특별 주문 사양을 결정한다 (단계 S113). 즉, 로봇의 특별 주문 사양은, 기본 로봇에 고유의 기본 사양을 베이스로 하고, 기본 사양 중 일 부 또는 전부의 가변 사양 항목이 요구 사항으로 대체(代替)된 것이다. 상기와 같이, 로봇의 특별 주문 사양을 결정한 시스템 운영서버는, 적합성 검토 프로그램을 실행하고, 부 품 적합성 검토 처리를 수행한다(단계 S114). 시스템 운영서버는, 부품 적합성 검토 처리에서, 특별 주문 사양을 실현하도록, 부품 적합성 검토결과 데이터베이스를 참조하여, 가동 유닛 데이터베이스, 엔드 이펙터 유 닛 데이터베이스에 기억된 유닛 중에서 기본 로봇의 구성 유닛을 포함하는 로봇의 구성 유닛의 조합을 탐색한다. 또한, 탐색된 로봇의 구성 유닛은, 기본 로봇의 구성 유닛과 완전히 똑같아도 좋다. 시스템 운영 서버는, 부품 적합성 검토결과 데이터베이스를 참조하여, 특별 주문 사양과 대응하는 데이터 를 탐색하고, 대응하는 데이터가 있으면, 그 데이터를 바탕으로 로봇의 구성 유닛의 조합을 결정한다. 또, 시스 템 운영 서버는, 부품 적합성 검토결과 데이터베이스를 참조하여, 특별 주문 사양과 대응하는 데이터가 없 으면, 부품 적합성 검토결과 데이터베이스에 저장된 데이터를 학습하여 규칙을 분석하고, 이 규칙을 특별 주문 사양에 적용시킴으로써 특별 주문 사양을 만족하는 것 같은 데이터를 예측하고, 로봇의 구성 유닛의 조합을 결 정한다.예를 들어, 시스템 운영 서버는, 부품 적합성 검토 처리에서, 동작 범위의 요구 사항을 실현하도록, 엔드 이펙터 유닛의 종류, 회전 유닛의 개수, 구부림 유닛의 개수, 회전 유닛 및 구부림 유닛 의 연설(連設)구성을 포함하는 구성 유닛의 조합을 탐색한다. 시스템 운영 서버는, 로봇의 구성 유닛의 탐색을 완료하면, 로봇 제시 프로그램을 실행하여, 로봇 제시 처 리를 수행한다. 시스템 운영 서버는, 로봇 제시 처리에서 로봇 제시 화면정보를 고객 단말기로 송신 하고(단계 S115), 고객 단말기에 로봇 제시 화면(도 19 참조)를 표시 출력시킨다(단계 S116). 여기서, 시스템 운영 서버는, 시뮬레이션 툴(tool)을 이용하여, 기본 로봇에 탐색된 부품을 실장한 로봇의 가상체를 고객 단말기에 출력 표시시킬 수 있다. 도 19은, 로봇 제시 화면의 일례이다. 로봇 제시 화면에서는, 상기와 같이 고객의 요구 사양에 따라 커스터마이즈된 특별 주문 사양의 로봇의 가상체가 표시된다. 이 가상체는 정지화상으로서 표시되어도 좋고, 작 업을 수행하는 동영상으로 표시되어도 좋고, 고객의 조작에 따라 화면상에서 움직이도록 표시되어도 좋다. 이와 같이, 고객은, 로봇 제시 화면을 시인(視認)하고, 또 화면상의 로봇 가상체를 움직이게 함으로써 자신의 요구 사양에 의해 커스터마이즈된 로봇을 부담 없이 시험할 수 있다. 또, 로봇 제시 화면(이것은 로봇의 가상체가 표시된 화면과 다른 화면이라도 좋다)에는 로봇의 견적 금액 이 표시된다. 이와 같이, 고객은 로봇을 구입하기 전에 로봇의 가격을 알 수 있다. 더욱이, 로봇 제시 화면(이것은 로봇의 가상체나 견적이 표시된 화면과 다른 화면이라도 좋다)에는, 표시 한 로봇의 발주(發注) 입력부가 설치되어 있다. 고객은 로봇의 가상체를 시험하고 나서, 로봇의 구입을 결정할 수 있다. 고객이 로봇을 구입하는 경우는, 발주 입력부에 고객 정보를 포함하는 발주 정보를 입력하여 발주 버 튼을 클릭하면, 그 발주 정보가 고객 단말기에서 시스템 운영 서버로 보내진다(단계 S117). 이 발주 정보에는 로봇 제시 화면에서 제시된 로봇의 구성 유닛 일식(一式)에 추가해서, 배송지와 고객 ID 등의 고 객에 관한 정보, 지불 방법 등의 결제 정보가 포함되어 있어 좋다. 로봇의 구성 유닛은 고객이 로봇을 조립할 때의 조립 단위가 되고 있다. 이와 같이, 고객은 로봇의 구성 유닛 일식(동작 프로그램이나 드레싱 부품을 포함)을 구입할 수 있다. 여기에서, 고객이 이미 다른 태양(態樣)의 로봇을 소유하는 경우에는, 소유하고 있는 로봇에 약간의 부품을 추 가하여, 유닛을 다시 구성하는 것으로, 이번 구입하려고 하고 있는 로봇을 실현할 수 있다. 그래서, 고객은 로 봇을 유닛 단위로 구입할 수도 있다. 이 경우, 로봇 제시 화면에 마련된 고객 ID 입력부에 전번의 로봇 구 입시에 이용한 고객 ID를 입력하여, 유닛의 추가 구입 버튼을 클릭하면, 추가 구입 정보가 고객 단말기에 서 시스템 운영 서버로 보내진다. 추가 구입 정보를 취득한 시스템 운영 서버는, 추가 유닛 제시 프로그램을 실행하고, 추가 유닛 제시 처리 를 수행한다. 추가 유닛 제시 처리에서는, 고객 ID를 기반으로 고객 정보 데이터베이스에서 고객이 소유하고 있 는 로봇의 구성 유닛에 관한 정보가 읽어지고, 이에 따라 고객이 이번의 로봇을 실현하기 위해 추가하는 유닛이 추출되어, 추가할 유닛이나 부품을 리스트업(list up)한 추가 유닛 정보가 고객 단말기로 보내진다. 추가 유닛 정보를 취득한 고객 단말기에서는, 예컨대, 도 20에 나타낸 바와 같은 추가 유닛 제시 화면이 표시된다. 예를 들어, 고객이 도 12에 보여주는 로봇(108')을 소유하고 있으며, 도 11에 보여주는 로봇을 이번에 구 입하는 경우에는, 추가할 유닛 등은, 2 조의 회전 유닛과, 엔드 이펙터 유닛과, 동작 프로그램을 포 함한다. 고객이 추가할 유닛 등을 구입하는 경우는, 추가 유닛 제시화면에 마련된 발주(發注) 버튼을 클릭 하면 그 발주 정보가 고객 단말기에서 시스템 운영 서버로 보내진다. 이 발주 정보에는, 추가 유닛 제시화면에서 제시된 추가의 유닛 등에 더해서, 배송지나 고객 ID 등의 고객에 관한 정보, 지불 방법 등의 지불 정보가 포함되어 있어도 좋다. 발주 정보를 받은 시스템 운영 서버는, 발주 정보를 고객 정보 데이터베이스에 저장함과 동시에, 수주 프 로그램을 실행하고, 로봇의 수주 처리를 수행한다(단계 S118). 시스템 운영 서버는, 수주 처리에서, 발주 정보에 따라 납품 리스트 정보를 생성한다. 납품 리스트 정보는, 고객에게 제공하는 로봇의 구성 유닛의 리스트 를 포함한다. 로봇의 조립 단위는 유닛이며, 로봇은 제어 유닛, 회전 유닛, 구부림 유닛, 및 엔 드 이펙터 유닛이 유닛의 상태로 고객에게 제공된다. 생성된 납품 리스트 정보는, 시스템 운영 서버에서 로봇 제조업체 단말기로 보내진다. 로봇 제조업체 단말기가 납품 리스트 정보를 접수하면, 로봇 제조업체에서는, 납품 리스트에 있는 구성 유닛을 포장하여고객이 지정한 목적지로 송부한다. 로봇은, 구성 유닛 일식(一式)이 패키지된 조립 키트로서, 혹은 고객이 요구한 하나 또는 복수의 추가 유닛 등 으로서, 로봇 제조업체로부터 고객에게 제공된다. 로봇의 동작 프로그램은 그 프로그램을 저장한 기록 매체로서 고객에게 인도되어도 좋고, 미리 컨트롤러에 인스톨(install)되어 있어도 좋다. 로봇의 구성 유닛을 받은 고객은, 첨부된 조립도를 참조하면서, 구성 유닛을 조합하여 로봇을 완성시킨다. 또한, 로봇의 조립 작업에 즈음하여, 나사 조임, 끼워 맞추기, 접착처럼 비교적 취급하기 용이한 고정 수단을 이용하면 완료되도록 로봇의 각 유닛이 설계되어 있다. 이와 같이, 로봇은 고객 스스로 용이하게 조립할 수 있 도록 구성되어 있다. 이상(以上)에 설명한 바와 같이, 본 실시형태의 로봇 거래 시스템은, 제어 유닛, 적어도 1 개의 가동 유닛(182,183)으로 이루어지는 암(arm)부, 및 엔드 이펙터 유닛의 연설체를 기본 로봇으로 하여, 기본 로 봇의 적어도 1 개의 가변 사양 항목을 포함하는 기본 로봇의 가변 사양에 관한 정보가 기억된 가변 사양 데이터 베이스(저장 장치 M6); 가동 유닛(182,183)에 관한 정보가 기억된 가동 유닛 데이터베이스(저장 장치 M3); 가변 사양이 변경된 가동 유닛(182,183)의 조합에 관한 정보가 기억된 부품 적합성 검토결과 데이터베이스(저장 장치 M8); 가변 사양 데이터베이스에서 기본 로봇에 대응하는 가변 사양 항목을 읽어내어 고객 단말기에 표시시키고, 가변 사양 항목 중 적어도 하나가 변경된 특별 주문 사양을 고객 단말기로부터 받은 특별 주문 사양 결정 부; 가동 유닛 데이터베이스 및 부품 적합성 검토결과 데이터베이스에 저장된 정보에 따라, 특별 주문 사양을 실현 하는 가동 유닛(182,183)의 조합을 탐색하는 적합성 검토부; 제어 유닛, 탐색된 가동 유닛(182,183)의 조합, 및 엔드 이펙터 유닛의 연설체인 로봇의 가상체를 고 객 단말기로 출력 표시시키는 로봇 제시부; 고객 단말기에서 로봇의 구성 유닛의 일식 또는 일부의 주문을 받아 수주(受注)하는 수주부; 를 구비 한다. 상기 실시형태에서는, 적합성 검토부는, 가동 유닛(182,183), 엔드 이펙터 유닛의 조합을 검토하지만, 엔드 이펙터 유닛의 종류가 미리 결정되어 있고, 적합성 검토부가 가동 유닛(182 183)의 조합만을 검토해도 좋다. 가동 유닛(182,183)의 조합은 회전 유닛의 개수, 구부림 유닛의 개수, 각 유닛의 연접(連接) 순서 등의 정보를 포함한다. 또, 본 실시형태의 로봇의 거래 방법은: 제어 유닛, 적어도 1 개의 가동 유닛(182,183)으로 이루어지는 암부, 및 엔드 이펙터 유닛의 연설체 를 기본 로봇으로 하고, 기본 로봇에 대해 적어도 하나의 가변 사양 항목을 고객에게 제시하고, 가변 사양 항목 중 적어도 하나가 변경된 특별 주문 사양을 접수하고, 특별 주문 사양을 실현하는 가동 유닛 (182,183)의 조합을 탐색하고, 제어 유닛, 탐색된 가동 유닛(182,183)의 조합으로 이루어진 암부, 및 엔드 이펙터 유닛의 연설체인 로봇의 가상체를 고객에게 제시하고, 고객으로부터 로봇의 구성 유닛의 일식 또는 일부의 주문을 접수하고 수주한다. 상기 로봇의 거래 시스템 및 거래 방법에 의하면, 로봇의 전문 지식을 갖지 아니한 고객이라도, 자신의 요 구하는 사양에 따라 커스터마이즈된 로봇을 주문(발주)할 수 있다. 또, 로봇의 주문 전에, 로봇의 가상체가 고 객에게 제시되므로, 고객은 발주(주문) 전에 로봇을 부담 없이 시험할 수 있다. 또, 로봇의 부품 적합성 검토 및 설계 등에 사람이 개입하지 않는 분만큼, 비용을 삭감할 수 있으며, 로봇 제조업체는 로봇을 저렴하게 제공 하고, 또, 고객은 커스텀 로봇을 저렴하게 취득할 수 있다. 또, 본 실시형태에 관계되는 로봇의 거래 시스템은, 기본 로봇에 적합한 작업 분류를 포함하는 기본 로봇 에 관한 정보가 저장된 기본 로봇 데이터베이스(저장 장치 M2)와, 고객 단말기에서 로봇이 실시하는 작업 분류에 관한 작업 분류 정보를 접수하고, 작업 분류 정보에 따라 작업 분류에 적합한 또는 복수의 기본 로봇을기본 로봇 데이터베이스로부터 탐색하고, 탐색된 기본 로봇을 고객 단말기에 출력 표시시키는, 기본 로봇 탐색 부를 더 구비한다. 마찬가지로, 본 실시형태에 관계되는 로봇의 탐색 방법은, 로봇이 실시하는 작업 분류에 관한 작업 분류 정보를 접수 받고, 기본 로봇에 적합한 작업 분류를 포함한 기본 로봇에 관한 정보군(群)(기본 로봇 데이터베이스에 저 장된 기본 로봇 정보)으로부터 작업 분류에 적합한 또는 복수의 기본 로봇을 탐색하고, 탐색된 기본 로봇을 고 객에게 제시한다. 이와 같이, 고객이 로봇에게 요구하는 작업에 적합한 기본 로봇이 고객에게 제안되기 때문에, 로봇의 전문 지식 을 갖지 아니한 고객이라도, 자신의 요구하는 사양에 호적한(매우 적합한) 기본 로봇을 선택할 수 있다. 또, 본 실시형태에 관계되는 로봇의 거래 시스템은, 고객이 소유하는 로봇의 구성 유닛과, 로봇의 구성 유 닛과 비교하여, 로봇을 실현하기 위해 고객이 소유하는 로봇의 구성 유닛에 추가되는 유닛을 추출하고, 추가되 는 유닛에 관한 정보를 고객 단말기로 출력 표시시키는 추가 유닛 제시부를 더 포함한다. 마찬가지로, 본 실시형태에 관계되는 로봇의 거래 방법은, 고객이 소유하는 로봇의 구성 유닛과, 로봇의 구성 유닛과 비교하여, 로봇을 실현하기 위해 고객이 소유하는 로봇의 구성 유닛에 추가되는 유닛을 추출하고, 추가 되는 유닛에 관한 정보를 고객에게 제시한다. 거래되는 로봇은, 구성 유닛을 구조 변경하거나, 구성 유닛에 더욱더 장치를 추가하거나 하는 것에 의해, 다른 태양의 로봇으로 구조 변경할 수 있다. 그래서, 이와 같이 고객이 이미 소유하고 있는 로봇의 구성 유닛을 이용 하고, 새롭게 고객이 원하는 로봇을 구성함으로써, 고객은 자원을 유효하게 이용할 수 있다. 이상으로 본 발명의 매우 바람직한 실시형태를 설명하였으나, 본 발명의 정신을 벗어나지 않는 범위에서, 상기 실시형태의 구체적인 구조 및/또는 기능의 세부 사항을 변경한 것도 본 발명에 포함될 수 있다. 상기의 구성은, 예를 들어, 이하와 같이 변경할 수 있다. 예를 들어, 상기 실시형태에 관계되는 로봇의 거래 시스템(1,101)은, 로봇의 전자 상거래를 수행하는 것이다. 단, 로봇의 거래 시스템(1,101)은, 전자 상거래에 구속되지 않고, 로봇 제조업체의 판매 촉진 툴로서 이용할 수 도 있다. 이 경우, 로봇의 거래 시스템(1,101)의 구성 요소(프로그램이나 데이터 등)가 하나의 포터블 (portable) 컴퓨터에 인스톨(install)되어 있어도 좋다."}
{"patent_id": "10-2019-7014831", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 제1 실시형태에 관계되는 로봇의 거래 시스템의 네트워크 구성을 나타내는 도면이다. 도 2는 시스템 운영 서버의 상세한 구성의 일례를 나타내는 도면이다. 도 3은 로봇의 거래 방법의 시퀀스 다이어그램이다. 도 4는 기본 로봇 탐색 화면의 일례를 나타내는 도면이다. 도 5는 기본 로봇 탐색 결과 화면의 일례를 나타내는 도면이다. 도 6은 요구 사양 입력 화면의 일례이다. 도 7은 커스텀 로봇 제시 화면의 일례이다. 도 8은 로봇 조립 부품의 일례를 나타내는 도면이다. 도 9는 도 8의 조립 부품이 조립되어 이루어지는 로봇을 나타낸 도면이다. 도 10는 포장용 상자의 일례를 나타내는 도면이다. 도 11은 본 발명의 제2 실시형태에 관계되는 로봇 거래 시스템의 상거래의 대상이 되는 로봇의 일례를 나타내는 도면이다. 도 12는 본 발명의 제2 실시형태에 관계되는 로봇 거래 시스템의 상거래의 대상이 되는 로봇의 다른 일례를 나 타내는 도면이다. 도 13은 본 발명의 제2 실시형태에 관계되는 로봇 거래 시스템의 네트워크 구성을 나타내는 도면이다. 도 14는 시스템 운영 서버의 상세한 구성의 일례를 나타내는 도면이다. 도 15는 로봇의 거래 방법의 시퀀스 다이어그램이다. 도 16은 기본 로봇 탐색 화면의 일례를 나타내는 도면이다. 도 17은 기본 로봇 탐색 결과 화면의 일례를 나타내는 도면이다. 도 18은 요구 사양 입력 화면의 일례이다. 도 19는 로봇 제시 화면의 일례이다. 도 20은 추가 유닛 제시 화면의 일례이다."}
