{"patent_id": "10-2023-0018032", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0125801", "출원번호": "10-2023-0018032", "발명의 명칭": "지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법 및 고장 진단 장치", "출원인": "현대자동차주식회사", "발명자": "정동원"}}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지도학습 기반 인공지능을 이용한 변속기의 고장 여부를 진단하는 방법으로서,진단 장치가 차량의 제어 장치와 CAN(Controller Area Network) 통신을 통해 상기 차량의 변속 제어 주행 데이터를 획득하는 단계;상기 주행 데이터를 전처리하는 단계;상기 주행 데이터에 포함된 엔진 속도 신호의 변곡점을 이용하여 변속 제어 구간별 시간을 추출하는 단계;상기 변속 제어 구간별 시간, 상기 주행 데이터에 포함된 상기 차량의 가속도 신호의 최대값과 최소값의 차이및 상기 가속도 신호의 시간당 최대 변화량 값을 특징 값으로 추출하는 단계; 및상기 특징 값을 입력으로 하여 지도 학습(supervised learning) 기반 인공지능(artificial intelligence)을 이용한 학습을 통해 상기 변속기의 정상 또는 비정상 여부를 판단하는 단계를 포함하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 변속기의 정상 또는 비정상 여부를 판단하는 단계에 의해 정상으로 판단되면, 상기 진단 장치가 정상 판단결과를 표시하고, 진단을 종료하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 변속기의 정상 또는 비정상 여부를 판단하는 단계에 의해 비정상으로 판단되면, 상기 변속기의 제어 보정에 의해 상기 변속기에 의한 변속감의 개선이 가능한지 여부를 판단하는 단계를 더 포함하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 변속기의 정상 또는 비정상 여부를 판단하는 단계는 비정상인 경우 복수 개의 비정상 유형으로 분류하여판단하는 것을 특징으로 하고,상기 비정상 유형은 변속 제어 구간 중 변속 준비 구간에서의 비정상 유형인 제1 비정상 유형(NG1), 실 변속 구간 시작 직전의 비정상 유형인 제2 비정상 유형(NG2) 및 제3 비정상 유형(NG3), 변속 완료 구간 시작 직전의 비정상 유형인 제4 비정상 유형(NG4)을 포함하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 변속감의 개선이 가능한지 여부를 판단하는 단계는,상기 비정상 유형이 상기 제1 비정상 유형(NG1)인지 여부를 판단하는 단계; 및상기 제1 비정상 유형(NG1)에 해당하는 것으로 판단되면, 상기 변속기의 교체가 필요한 것으로 결정하는 단계를공개특허 10-2024-0125801-3-더 포함하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 변속감의 개선이 가능한지 여부를 판단하는 단계는,상기 제1 비정상 유형(NG1)에 해당하지 않는 것으로 판단되면, 제1 교체 조건에 해당하는지 여부를 판단하는 단계를 더 포함하고,상기 제1 교체 조건에 해당하는 것으로 판단되면, 상기 변속기의 교체가 필요한 것으로 결정하는 단계를 수행하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 제1 교체 조건에 해당하는지 여부를 판단하는 단계는,상기 변속 준비 구간의 시간이 제1 설정시간을 초과하는 경우, 상기 변속 준비구간의 시간이 제2 설정시간 미만인 경우, 상기 변속 준비 구간의 상기 가속도 신호의 시간당 최대 변화량이 제1 설정 변화량을 초과하는 경우및 상기 변속 준비 구간의 상기 가속도 신호의 최대값과 최소값의 차이가 제1 설정 차이값을 초과하는 경우 중어느 하나에 해당하면 상기 제1 교체 조건을 만족하는 것으로 판단하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서,상기 변속감의 개선이 가능한지 여부를 판단하는 단계는,상기 제1 교체 조건에 해당하는지 여부를 판단하는 단계에 의해 상기 제1 교체 조건에 해당하지 않는 것으로 판단되면, 상기 비정상 유형이 상기 제4 비정상 유형(NG4)인지 여부를 판단하는 단계를 더 포함하고,상기 제4 비정상 유형(NG4)에 해당하는 것으로 판단되면, 상기 변속기의 교체가 필요한 것으로 결정하는 단계를수행하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 변속감의 개선이 가능한지 여부를 판단하는 단계는,상기 제4 비정상 유형(NG4)에 해당하지 않는 것으로 판단되면, 제2 교체 조건에 해당하는지 여부를 판단하는 단계를 더 포함하고,상기 제2 교체 조건에 해당하는 것으로 판단되면, 상기 변속기의 교체가 필요한 것으로 결정하는 단계를 수행하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 제2 교체 조건에 해당하는지 여부를 판단하는 단계는,상기 실 변속 구간의 시간이 제3 설정시간을 초과하는 경우, 상기 실 변속 구간의 상기 가속도 신호의 시간당공개특허 10-2024-0125801-4-최대 변화량이 제2 설정 변화량을 초과하는 경우 및 상기 실 변속 구간의 상기 가속도 신호의 최대값과 최소값의 차이가 제2 설정 차이값을 초과하는 경우 중 어느 하나에 해당하면 상기 제2 교체 조건을 만족하는 것으로판단하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 9에 있어서,상기 변속감의 개선이 가능한지 여부를 판단하는 단계는,상기 제2 교체 조건에 해당하는지 여부를 판단하는 단계에 의해 상기 제2 교체 조건에 해당하지 않는 것으로 판단되면, 상기 변속기의 제어 보정에 의해 상기 변속기에 의한 변속감의 개선이 가능한 것으로 결정하는 단계를더 포함하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 변속기의 정상 또는 비정상 여부를 판단하는 단계에 의한 비정상 판단 결과 및 상기 변속기의 교체가 필요한 것으로 결정하는 단계 또는 상기 변속감의 개선이 가능한 것으로 결정하는 단계에 의해 결정된 결과를 상기진단 장치가 표시하는 단계를 더 포함하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서,상기 변속기의 제어 보정에 의해 상기 변속기에 의한 변속감의 개선이 가능한 것으로 결정되면, 변속기 제어 유닛(TCU)에 저장된 변속 제어가 문제되는 변속의 학습값들을 초기화하는 단계;상기 문제되는 변속의 결합측 클러치를 제어하는 솔레노이드를 보정 대상으로 결정하는 단계;(계측된 변속 준비구간 시간 - 설정 값)/설정 값으로 계산되는 응답성을 계산하여, 상기 응답성에 대응되도록설정된 보정값을 결정하는 단계; 및상기 비정상 유형에 따라 결정된 변속 제어 구간의 제어 전류 값에 상기 보정값을 더하여 보정하는 단계를 포함하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,상기 보정하는 단계 후 초기화된 상기 학습값들과 상기 제어 전류 값의 보정에 따라 상기 변속기 제어 유닛의리프로그래밍(Flashing)을 수행하는 단계를 더 포함하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "지도학습 기반 인공지능을 이용한 변속기의 고장 여부를 진단하는 장치로서,차량의 제어 장치와 CAN(Controller Area Network) 통신을 통해 상기 차량의 변속 제어 주행 데이터를 획득 및전처리하고,상기 주행 데이터에 포함된 엔진 속도 신호의 변곡점을 이용하여 변속 제어 구간별 시간을 추출하여, 상기 변속제어 구간별 시간, 상기 주행 데이터에 포함된 상기 차량의 가속도 신호의 최대값과 최소값의 차이 및 상기 가속도 신호의 시간당 최대 변화량 값을 특징 값으로 추출하며,공개특허 10-2024-0125801-5-상기 특징 값을 입력으로 하여 지도 학습(supervised learning) 기반 인공지능(artificial intelligence)을 이용한 학습을 통해 상기 변속기의 정상 또는 비정상 여부를 판단하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서,상기 변속기의 정상 또는 비정상 여부를 판단한 결과, 비정상인 경우 복수 개의 비정상 유형으로 분류하여 판단하는 것을 특징으로 하고,상기 비정상 유형은 변속 제어 구간 중 변속 준비 구간에서의 비정상 유형인 제1 비정상 유형(NG1), 실 변속 구간 시작 직전의 비정상 유형인 제2 비정상 유형(NG2) 및 제3 비정상 유형(NG3), 변속 완료 구간 시작 직전의 비정상 유형인 제4 비정상 유형(NG4)을 포함하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 변속기의 정상 또는 비정상 여부를 판단한 결과 비정상인 경우, 상기 비정상 유형이 상기 제1 비정상 유형(NG1)인지 여부를 판단하고,상기 제1 비정상 유형(NG1)에 해당하는 것으로 판단되면, 상기 변속기의 교체가 필요한 것으로 결정하며, 상기제1 비정상 유형(NG1)에 해당하지 않는 것으로 판단되면 제1 교체 조건을 만족하는지 여부를 판단하는 것을 특징으로 하며,상기 변속 준비 구간의 시간이 제1 설정시간을 초과하는 경우, 상기 변속 준비구간의 시간이 제2 설정시간 미만인 경우, 상기 변속 준비 구간의 상기 가속도 신호의 시간당 최대 변화량이 제1 설정 변화량을 초과하는 경우및 상기 변속 준비 구간의 상기 가속도 신호의 최대값과 최소값의 차이가 제1 설정 차이값을 초과하는 경우 중어느 하나에 해당하면 상기 제1 교체 조건을 만족하는 것으로 판단하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 제1 교체 조건을 만족하는지 여부를 판단한 겨로가 상기 제1 교체 조건을 만족하지 않는 것으로 판단되면,상기 비정상 유형이 상기 제4 비정상 유형(NG4)인지 여부를 판단하고,상기 제4 비정상 유형(NG4)에 해당하는 것으로 판단되면, 상기 변속기의 교체가 필요한 것으로 결정하며, 상기제4 비정상 유형(NG4)에 해당하지 않는 것으로 판단되면 제2 교체 조건을 만족하는지 여부를 판단하는 것을 특징으로 하며,상기 실 변속 구간의 시간이 제3 설정시간을 초과하는 경우, 상기 실 변속 구간의 상기 가속도 신호의 시간당최대 변화량이 제2 설정 변화량을 초과하는 경우 및 상기 실 변속 구간의 상기 가속도 신호의 최대값과 최소값의 차이가 제2 설정 차이값을 초과하는 경우 중 어느 하나에 해당하면 상기 제2 교체 조건을 만족하는 것으로판단하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 18에 있어서,상기 제2 교체 조건을 만족하지 않는 것으로 판단되면, 상기 변속기의 제어 보정에 의해 상기 변속기에 의한 변속감의 개선이 가능한 것으로 결정하는 것을 특징으로 하며,상기 변속감의 개선이 가능한 것으로 결정되면, 변속기 제어 유닛(TCU)에 저장된 변속 제어가 문제되는 변속의공개특허 10-2024-0125801-6-학습값들을 초기화하고,상기 문제되는 변속의 결합측 클러치를 제어하는 솔레노이드를 보정 대상으로 결정하며,(계측된 변속 준비구간 시간 - 설정 값)/설정 값으로 계산되는 응답성을 계산하여, 상기 응답성에 대응되도록설정된 보정값을 결정하고,상기 비정상 유형에 따라 결정된 변속 제어 구간의 제어 전류 값에 상기 보정값을 더하여 보정하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치."}
{"patent_id": "10-2023-0018032", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 19에 있어서,초기화된 상기 학습값들과 상기 제어 전류 값의 보정에 따라 상기 변속기 제어 유닛의 리프로그래밍(Flashing)을 수행하는 것을 특징으로 하는,지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치."}
{"patent_id": "10-2023-0018032", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 지도학습 기반 인공지능을 이용한 변속기의 고장 여부를 진단하는 방법으로서, 진단 장치가 차량의 제 어 장치와 CAN(Controller Area Network) 통신을 통해 상기 차량의 변속 제어 주행 데이터를 획득하는 단계, 상 기 주행 데이터를 전처리하는 단계, 상기 주행 데이터에 포함된 엔진 속도 신호의 변곡점을 이용하여 변속 제어 (뒷면에 계속)"}
{"patent_id": "10-2023-0018032", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자동차 변속기의 고장을 진단하는 방법 및 장치로서, 지도학습 기반의 인공지능을 이용한 진단 방법 및 진단 장치에 관한 것이다."}
{"patent_id": "10-2023-0018032", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자동변속감이란 자동변속기의 변속 클러치 결함으로 인해 발생하는 가속도 변동, 엔진 속도 변화로 인한 소리 등을 운전자가 느끼는 것을 의미한다. 운전자는 주로 가속도 변동을 통해 변속감을 느끼게 되며, 운전자 감성에 의존한 변속감 판단을 통해 변속기 이상 유무를 판단하게 된다. 예를 들어 운전자의 감성 기준으로 충격성 변속 감이 발생하거나, 변속이 느릴 시 변속기에 고장이 발생했다고 인지한다. 각 OEM(Original Equipment Manufacturing)에서는 변속감 튜닝, 다양한 사람들의 평가 및 개선의 과정을 통해 자동변속기의 적절한 변속감을 확보한다. 하지만 H/W(hardware) 제조 편차가 존재하기 때문에 대량 생산한 차량 의 일부 차량은 개발 당시의 변속감보다 수준이 낮은 변속감이 발생할 수 있으며, 운전자의 감성 기준에 따라 개발 수준의 변속감도 충격성 혹은 느린 변속감으로 판정될 수 있다. 그래서, 운전자의 자동 변속감 클레임 발생 시, 정량적인 평가 방법 외에는 감성 기준으로 인한 문제인지 H/W 문제인지 구분할 수 있는 방법이 없기에 단지 H/W 교체를 할 수밖에 없게 된다. 이러한 문제를 방지하고자 현재 정비 부문에서는 휴대용 진단장비(GDS, Global Diagnosis System)를 통해 6속 및 8속의 자동 다단 변속기의 데이터를 계측하여 변속감이 문제가 없는지(OK), 문제가 있는지(NG)를 판단 후 부 품이나 변속기 전체를 교체해야 하는지를 알려주는 로직을 개발하여 서비스 중에 있다. 해당 로직에서 변속감 문제가 있는지 판정하는 방법은 진단 장비를 차량 조수석 바닥에 위치시킨 후 진단 장비의 가속도 센서를 이용 하여 가속도 값을 측정 후, 로드 노이즈를 제거하는 등의 데이터 신호처리 후 충격 절대량 값을 추출 뒤 차속 에 따른 충격 절대량이 임계 값(Threshold)을 넘어가게 되면 문제가 있는 것으로 판단하는 것이다. 즉, 종래의 변속감 판정 기술은 진단 장비의 가속도 센서 값을 이용하여 신호 처리를 통해 충격 절대 량을 계산 한 뒤 임계 값을 넘었는지 여부를 판단하는 방법이다. 하지만 해당 방법은 아래와 같은 한계점을 가진다. 1) 동일한 가속도이더라도 진단 장비 설치 위치에 영향을 받아 가속도 측정 값이 달라질 수 있다. 2) 6속 변속기의 경우 H/W 구조에 의한 변속 시 가속도 변동량이 크기 때문에 이를 고려한 판정 임계 값 또한 커서, 진단 장비가 필요 없을 수준의 H/W 고장과 같은 명백한 고장 외에 고객 불만 수준의 변속감에 대하여 정 확한 판정 어렵다. 즉, H/W 구조에 의해서 가속도 Drop이 발생하나, H/W 고장이나 제어가 H/W에 최적화 되지 않을 시 충격성 가속 도 변동이 발생하나, 전륜 6속 기준 걸림감 크게 발생했음에도(인위 설정) 현재 방식으로는 감지가 불가하다.3) 임계 값 기준으로 판단하므로 변속 제어 진행에 따른 충격 발생 시점에 대한 판단이 불가능하여 상세 판정이 불가하다. 4) 동일한 변속기를 사용하는 차량이더라도, 차급에 따라 고객의 기대 변속감 수준이 다르기에 임계값의 구분이 어렵다."}
{"patent_id": "10-2023-0018032", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이상의 배경기술에 기재된 사항은 발명의 배경에 대한 이해를 돕기 위한 것으로서, 이 기술이 속하는 분야에서 통상의 지식을 가진 자에게 이미 알려진 종래기술이 아닌 사항을 포함할 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-0191572호"}
{"patent_id": "10-2023-0018032", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하고자 안출된 것으로서, 본 발명은 진단 기기 내부의 가속도 센서를 이용하여 임계값 방식으로 판정하는 방법 대신 차량에 장착된 가속도 센서의 센서값 및 차량 상태량 신호들을 활용하여 지도학습된 인공지능 모델을 이용하여 변속기의 고장 여부를 진단하는 방법 및 진단 장치를 제공하는 데 그 목 적이 있다."}
{"patent_id": "10-2023-0018032", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 관점에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법은, 지도학습 기반 인공지 능을 이용한 변속기의 고장 여부를 진단하는 방법으로서, 진단 장치가 차량의 제어 장치와 CAN(Controller Area Network) 통신을 통해 상기 차량의 변속 제어 주행 데이터를 획득하는 단계, 상기 주행 데이터를 전처리하는 단 계, 상기 주행 데이터에 포함된 엔진 속도 신호의 변곡점을 이용하여 변속 제어 구간별 시간을 추출하는 단계, 상기 변속 제어 구간별 시간, 상기 주행 데이터에 포함된 상기 차량의 가속도 신호의 최대값과 최소값의 차이 및 상기 가속도 신호의 시간당 최대 변화량 값을 특징 값으로 추출하는 단계 및 상기 특징 값을 입력으로 하여 지도 학습(supervised learning) 기반 인공지능(artificial intelligence)을 이용한 학습을 통해 상기 변속기 의 정상 또는 비정상 여부를 판단하는 단계를 포함한다. 그리고, 상기 변속기의 정상 또는 비정상 여부를 판단하는 단계에 의해 정상으로 판단되면, 상기 진단 장치가 정상 판단 결과를 표시하고, 진단을 종료하는 것을 특징으로 한다. 또는, 상기 변속기의 정상 또는 비정상 여부를 판단하는 단계에 의해 비정상으로 판단되면, 상기 변속기의 제어 보정에 의해 상기 변속기에 의한 변속감의 개선이 가능한지 여부를 판단하는 단계를 더 포함한다. 그리고, 상기 변속기의 정상 또는 비정상 여부를 판단하는 단계는 비정상인 경우 복수 개의 비정상 유형으로 분 류하여 판단하는 것을 특징으로 하고, 상기 비정상 유형은 변속 제어 구간 중 변속 준비 구간에서의 비정상 유 형인 제1 비정상 유형(NG1), 실 변속 구간 시작 직전의 비정상 유형인 제2 비정상 유형(NG2) 및 제3 비정상 유 형(NG3), 변속 완료 구간 시작 직전의 비정상 유형인 제4 비정상 유형(NG4)을 포함하는 것을 특징으로 한다. 또한, 상기 변속감의 개선이 가능한지 여부를 판단하는 단계는, 상기 비정상 유형이 상기 제1 비정상 유형(NG 1)인지 여부를 판단하는 단계 및 상기 제1 비정상 유형(NG1)에 해당하는 것으로 판단되면, 상기 변속기의 교체 가 필요한 것으로 결정하는 단계를 더 포함한다. 그리고, 상기 변속감의 개선이 가능한지 여부를 판단하는 단계는, 상기 제1 비정상 유형(NG1)에 해당하지 않는 것으로 판단되면, 제1 교체 조건에 해당하는지 여부를 판단하는 단계를 더 포함하고, 상기 제1 교체 조건에 해 당하는 것으로 판단되면, 상기 변속기의 교체가 필요한 것으로 결정하는 단계를 수행하는 것을 특징으로 한다. 여기서, 상기 제1 교체 조건에 해당하는지 여부를 판단하는 단계는, 상기 변속 준비 구간의 시간이 제1 설정시 간을 초과하는 경우, 상기 변속 준비구간의 시간이 제2 설정시간 미만인 경우, 상기 변속 준비 구간의 상기 가 속도 신호의 시간당 최대 변화량이 제1 설정 변화량을 초과하는 경우 및 상기 변속 준비 구간의 상기 가속도 신호의 최대값과 최소값의 차이가 제1 설정 차이값을 초과하는 경우 중 어느 하나에 해당하면 상기 제1 교체 조건 을 만족하는 것으로 판단하는 것을 특징으로 한다. 그리고, 상기 변속감의 개선이 가능한지 여부를 판단하는 단계는, 상기 제1 교체 조건에 해당하는지 여부를 판 단하는 단계에 의해 상기 제1 교체 조건에 해당하지 않는 것으로 판단되면, 상기 비정상 유형이 상기 제4 비정 상 유형(NG4)인지 여부를 판단하는 단계를 더 포함하고, 상기 제4 비정상 유형(NG4)에 해당하는 것으로 판단되 면, 상기 변속기의 교체가 필요한 것으로 결정하는 단계를 수행하는 것을 특징으로 한다. 또한, 상기 변속감의 개선이 가능한지 여부를 판단하는 단계는, 상기 제4 비정상 유형(NG4)에 해당하지 않는 것으로 판단되면, 제2 교체 조건에 해당하는지 여부를 판단하는 단계를 더 포함하고, 상기 제2 교체 조건에 해당 하는 것으로 판단되면, 상기 변속기의 교체가 필요한 것으로 결정하는 단계를 수행하는 것을 특징으로 한다. 여기서, 상기 제2 교체 조건에 해당하는지 여부를 판단하는 단계는, 상기 실 변속 구간의 시간이 제3 설정시간 을 초과하는 경우, 상기 실 변속 구간의 상기 가속도 신호의 시간당 최대 변화량이 제2 설정 변화량을 초과하는 경우 및 상기 실 변속 구간의 상기 가속도 신호의 최대값과 최소값의 차이가 제2 설정 차이값을 초과하는 경우 중 어느 하나에 해당하면 상기 제2 교체 조건을 만족하는 것으로 판단하는 것을 특징으로 한다. 그리고, 상기 변속감의 개선이 가능한지 여부를 판단하는 단계는, 상기 제2 교체 조건에 해당하는지 여부를 판 단하는 단계에 의해 상기 제2 교체 조건에 해당하지 않는 것으로 판단되면, 상기 변속기의 제어 보정에 의해 상 기 변속기에 의한 변속감의 개선이 가능한 것으로 결정하는 단계를 더 포함할 수 있다. 그리고, 상기 변속기의 정상 또는 비정상 여부를 판단하는 단계에 의한 비정상 판단 결과 및 상기 변속기의 교 체가 필요한 것으로 결정하는 단계 또는 상기 변속감의 개선이 가능한 것으로 결정하는 단계에 의해 결정된 결 과를 상기 진단 장치가 표시하는 단계를 더 포함한다. 나아가, 상기 변속기의 제어 보정에 의해 상기 변속기에 의한 변속감의 개선이 가능한 것으로 결정되면, 변속기 제어 유닛(TCU)에 저장된 변속 제어가 문제되는 변속의 학습값들을 초기화하는 단계, 상기 문제되는 변속의 결 합측 클러치를 제어하는 솔레노이드를 보정 대상으로 결정하는 단계, (계측된 변속 준비구간 시간 - 설정 값)/ 설정 값으로 계산되는 응답성을 계산하여, 상기 응답성에 대응되도록 설정된 보정값을 결정하는 단계 및 상기 비정상 유형에 따라 결정된 변속 제어 구간의 제어 전류 값에 상기 보정값을 더하여 보정하는 단계를 포함할 수 있다. 그리고, 상기 보정하는 단계 후 초기화된 상기 학습값들과 상기 제어 전류 값의 보정에 따라 상기 변속기 제어 유닛의 리프로그래밍(Flashing)을 수행하는 단계를 더 포함할 수 있다. 다음으로, 본 발명의 일 관점에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치는, 지도학습 기반 인공지능을 이용한 변속기의 고장 여부를 진단하는 장치로서, 차량의 제어 장치와 CAN(Controller Area Network) 통신을 통해 상기 차량의 변속 제어 주행 데이터를 획득 및 전처리하고, 상기 주행 데이터에 포함된 엔진 속도 신호의 변곡점을 이용하여 변속 제어 구간별 시간을 추출하여, 상기 변속 제어 구간별 시간, 상기 주 행 데이터에 포함된 상기 차량의 가속도 신호의 최대값과 최소값의 차이 및 상기 가속도 신호의 시간당 최대 변 화량 값을 특징 값으로 추출하며, 상기 특징 값을 입력으로 하여 지도 학습(supervised learning) 기반 인공지 능(artificial intelligence)을 이용한 학습을 통해 상기 변속기의 정상 또는 비정상 여부를 판단하는 것을 특 징으로 한다. 그리고, 상기 변속기의 정상 또는 비정상 여부를 판단한 결과, 비정상인 경우 복수 개의 비정상 유형으로 분류 하여 판단하는 것을 특징으로 하고, 상기 비정상 유형은 변속 제어 구간 중 변속 준비 구간에서의 비정상 유형 인 제1 비정상 유형(NG1), 실 변속 구간 시작 직전의 비정상 유형인 제2 비정상 유형(NG2) 및 제3 비정상 유형 (NG3), 변속 완료 구간 시작 직전의 비정상 유형인 제4 비정상 유형(NG4)을 포함하는 것을 특징으로 한다. 또한, 상기 변속기의 정상 또는 비정상 여부를 판단한 결과 비정상인 경우, 상기 비정상 유형이 상기 제1 비정 상 유형(NG1)인지 여부를 판단하고, 상기 제1 비정상 유형(NG1)에 해당하는 것으로 판단되면, 상기 변속기의 교 체가 필요한 것으로 결정하며, 상기 제1 비정상 유형(NG1)에 해당하지 않는 것으로 판단되면 제1 교체 조건을 만족하는지 여부를 판단하는 것을 특징으로 하며, 상기 변속 준비 구간의 시간이 제1 설정시간을 초과하는 경우, 상기 변속 준비구간의 시간이 제2 설정시간 미만인 경우, 상기 변속 준비 구간의 상기 가속도 신호의 시 간당 최대 변화량이 제1 설정 변화량을 초과하는 경우 및 상기 변속 준비 구간의 상기 가속도 신호의 최대값과 최소값의 차이가 제1 설정 차이값을 초과하는 경우 중 어느 하나에 해당하면 상기 제1 교체 조건을 만족하는 것으로 판단하는 것을 특징으로 한다. 그리고, 상기 제1 교체 조건을 만족하는지 여부를 판단한 겨로가 상기 제1 교체 조건을 만족하지 않는 것으로 판단되면, 상기 비정상 유형이 상기 제4 비정상 유형(NG4)인지 여부를 판단하고, 상기 제4 비정상 유형(NG4)에 해당하는 것으로 판단되면, 상기 변속기의 교체가 필요한 것으로 결정하며, 상기 제4 비정상 유형(NG4)에 해당 하지 않는 것으로 판단되면 제2 교체 조건을 만족하는지 여부를 판단하는 것을 특징으로 하며, 상기 실 변속 구 간의 시간이 제3 설정시간을 초과하는 경우, 상기 실 변속 구간의 상기 가속도 신호의 시간당 최대 변화량이 제 2 설정 변화량을 초과하는 경우 및 상기 실 변속 구간의 상기 가속도 신호의 최대값과 최소값의 차이가 제2 설 정 차이값을 초과하는 경우 중 어느 하나에 해당하면 상기 제2 교체 조건을 만족하는 것으로 판단하는 것을 특 징으로 한다. 또한, 상기 제2 교체 조건을 만족하지 않는 것으로 판단되면, 상기 변속기의 제어 보정에 의해 상기 변속기에 의한 변속감의 개선이 가능한 것으로 결정하는 것을 특징으로 하며, 상기 변속감의 개선이 가능한 것으로 결정 되면, 변속기 제어 유닛(TCU)에 저장된 변속 제어가 문제되는 변속의 학습값들을 초기화하고, 상기 문제되는 변 속의 결합측 클러치를 제어하는 솔레노이드를 보정 대상으로 결정하며, (계측된 변속 준비구간 시간 - 설정 값)/설정 값으로 계산되는 응답성을 계산하여, 상기 응답성에 대응되도록 설정된 보정값을 결정하고, 상기 비정 상 유형에 따라 결정된 변속 제어 구간의 제어 전류 값에 상기 보정값을 더하여 보정하는 것을 특징으로 한다. 나아가, 초기화된 상기 학습값들과 상기 제어 전류 값의 보정에 따라 상기 변속기 제어 유닛의 리프로그래밍 (Flashing)을 수행하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0018032", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 자동변속기의 변속감의 명확한 판정이 어려운 점을 개선하기 위한 것이다. 기존에는 진단 장비의 가속도 센서를 이용하여 임계 값보다 값이 클 시 고장으로 판별하여 H/W 교체 필요 여부 를 안내하는 방식이었다. 이에 반해 본 발명은 진단 장비를 이용하여 종가속도 값을 포함한 차량 주행데이터를 계측하여 지도학습 기반 인공지능을 이용하여 판정을 수행한다. 따라서, 비정상 여부에 대한 세부 판정을 통해 H/W 교체나 제어 보정으로 개선 가능한지 판단한 후, 제어 보정 으로 개선 가능 시 학습 값 초기화 및 솔레노이드 전류 보정 값 변경으로 문제를 해결할 수 있다. 그러므로, 기존 기술 대비 더 높은 정확도를 가지며 단순히 정상/비정상이 아닌 비정상 세부 분류가 가능하고, 기존 기술 대비 H/W나 부품 교체 방법 외에 제어 보정으로 문제를 해결할 수도 있게 한다. 따라서, 진단장비 사용자가 개발자(전문가) 수준의 정확한 평가를 할 수 있게 되며, 제어 보정으로 문제 해결 시 H/W 교체 방법 대비 보증 수리 비용이나 고객의 수리비용이 줄어들게 되고, 별도의 부품 추가 없이 로직 추 가만으로 적용이 가능하게 한다."}
{"patent_id": "10-2023-0018032", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명과 본 발명의 동작상의 이점 및 본 발명의 실시에 의하여 달성되는 목적을 충분히 이해하기 위해서는 본 발명의 바람직한 실시 예를 예시하는 첨부 도면 및 첨부 도면에 기재된 내용을 참조하여야만 한다. 본 발명의 바람직한 실시 예를 설명함에 있어서, 본 발명의 요지를 불필요하게 흐릴 수 있는 공지의 기술이나 반복적인 설명은 그 설명을 줄이거나 생략하기로 한다. 도 1은 본 발명의 일 실시예에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치에 의한 진단 과 정을 도시한 것이며, 도 2는 본 발명의 응용 실시예에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진 단 장치에 의한 진단 과정을 도시한 것이다. 이하, 도 1 및 도 2를 참조하여 본 발명의 실시예에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법 및 고장 진단 장치를 설명하기로 한다. 본 발명은 진단 기기 내부의 가속도 센서를 이용하여 임계값 방식으로 판정하는 방법 대신, 각 차종별로 동일하 게 장착되어 있는 차량 가속도 센서의 센서값 및 차량 상태량 신호들을 활용하여 지도학습된 인공지능 모델을 이용하여 판정하는 방법이다. 즉, 개발 시 개발자가 라벨링 한 데이터로 지도 학습 기반 인공지능 모델을 훈련시킨 뒤, 정비나 평가 인원이 진단 기기의 차량 CAN(Controller Area Network) 통신 계측 기능을 통해 차량 가속도 센서 값과 차량 상태량 신 호들을 동시 계측하고, 진단 장비나 서버의 연산력을 통해 지도학습된 인공지능 모델을 활용하여 문제 CASE 여 부를 판정 및 세부 분류하는 방식이다. 이 후 고장으로 판된될 시 제어를 보정할 지 H/W 교체 할지를 판정한 후, 제어로 보정 가능하다고 판단될 시 변속기나 변속기의 부품을 교체하는 대신 TCU(변속기 제어 유닛)의 변속 제어 학습 값을 초기화 시키고 솔레노이드 전류 제어량을 조정하여 변속 제어 학습이 최적으로 수행하게 하여 충격을 개선하는 방식이다. 이를 위해 본 발명의 진단장치는 CAN 통신을 통해 차량의 주행데이터를 계측하고, 연산, 학습 및 결과 표시가 가능한 장치로 구현된다. 그리고, 연산, 학습을 위한 진단 서버를 포함한 진단 시스템으로서 구현될 수 있다. 진단 장치 또는 진단 시스템에 의한 작동 순서는 다음과 같으며 고장 진단 결과에 따라 제어 보정 방법이 추가 로 진행될 수 있다. 1) 진단 장치를 통해 문제가 있다고 판단되는 변속의 변속 제어 시의 주행 데이터를 3회 이상 계측한다. 주행 데이터는 엔진 속도, 토크컨버터 속도, 종가속도, 악셀(accelerator) 개도량, 엔진 토크량, 변속기 출력 속도, 변속기 온도, 엔진 온도 등일 수 있다. 이러한 주행 데이터는 차량에 장착된 해당하는 각 센서로부터 계측되어, 차량 제어 장치가 이를 수신하며, 진단 장치는 차량의 제어 장치와 CAN 통신을 통해 이러한 주행 데이터를 수신한다. 2) 진단 장치는 주행 데이터를 수신하여 이후 과정에 따라 연산(데이터 전처리, 변속의 OK/NG판정, NG 시 제어 보정으로 문제 개선 가능한지 판정, 제어 보정량 결정)하며, 메모리 크기 한계 등 경우에 따라 진단 서버로 주 행 데이터를 송부하여 진단 서버에 의해 연산 수행 후에 결과물을 진단 장치가 수신할 수도 있다. 3) 인공지능 모델 활용을 위한 차량 주행 데이터를 전처리한다.(신호 값 및 계측 시간에 대하여 특정 설정 값으 로 최대값과 최소값의 정규화 및 Down Sampling) 4) 제어 보정 여부 판단을 위한 전처리된 데이터의 제어 구간별 시간, 가속도 신호의 특징 값을 미리 계산한다. 5) 전처리된 가공 데이터를 지도 학습(supervised learning)된 인공지능(artificial intelligence) 모델 (Random, Forest, DNN 등)에 입력하여 정상인지 비정상인지 세부 분류한다. 3회 이상 계측된 데이터에 대하여 2회 이상 판정되는 케이스로 최종 판정한다. 6) 비정상 케이스로 판정될 시, 4)의 계산 값을 임계값 기반 판정 방식을 통해, H/W 교체나 제어 보정으로 충격 해결 가능한지 판단한다. 진단 서버에서 연산하는 경우 판정 결과와 H/W 교체 필요나 제어 보정 필요 결과를 통신으로 진단 장체에 송부 한다. 7) 진단 장치를 통해 세부 판정 결과 및 H/W 교체나 제어 보정으로 문제 해결가능한지를 표시한다. 8) 제어 보정 결정 시 변속기 제어 유닛(TCU, Transmission Control Unit) 내에, 비휘발성 메모리에 저장된 문 제되는 변속의 변속 학습값들을 모두 초기화 수행한다. 9) 8) 과정 이후 전류 제어 보정 대상을 결정하고, 4)의 제어 구간별 시간 활용하여 솔레노이드 전류 제어 보정 량을 결정한다. 10) 8) 및 9)에 해당하는 내용에 대하여 변속기 제어 유닛 내 비휘발성 메모리에 Flashing(리프로그래밍)을 수 행한다.(TCU Flashing) 이는 각 차량의 변속기 H/W 에 맞게 최적화된 변속기 제어 유닛용 제어 데이터를 깔아주는 효과이다. 도 3 내지 도 6을 참조하여, 주행 데이터의 전처리 및 연산 과정을 보다 구체적으로 살펴본다. 도 3은 본 발명의 진단 방법의 주행 데이터 전처리 과정의 일부를 도시한 것으로서, 변속 클러치 제어 시간에 대하여 일정한 시간(설정값)으로 정규화(Normalization)을 수행한다. 변속 클러치 제어의 경우 변속단, 클러치 종류, 변속 제어 시점에 따라 제어 시간이 다르므로, 인공지능 모델 활용 및 충격 발생 시점 인지를 위하여 데이터를 일정한 시간 값으로 일치시키는 시간 정규화를 수행하는 것이다. 정규화된 시간은 다음과 같다. 정규화된 시간 = 계측을 통해 얻어진 데이터의 sampling 시간 × 설정 시간/계측된 변속 총 제어 시간 예를 들어, 1.63초의 1단->2단 변속 데이터를 2초 짜리 변속 데이터로 정규화 하는 경우, 원래 시간 0초에서 계측된 데이터 -> 정규화된 시간 0초에 배치된다.(0 × 2/1.63 = 0) 원래 시간 0.5초에서 계측된 데이터 -> 정규화된 시간 0.613초에 배치된다.(0.5 × 2/1.63 = 0.613) 원래 시간 1.63초에서 계측된 데이터 -> 정규화된 시간 2초에 배치된다.(1.63 × 2/1.63 = 2) 이와 같이 정규화된 데이터에 대하여 진단 장치의 메모리 및 연산 속도를 위하여, 데이터의 수를 줄이는 Down sampling을 수행한다. 예를 들어, 10ms별로 획득된 데이터를 50ms로 획득된 데이터로 만듦으로써 다음과 같이 데이터 Sampling 횟수를 낮추는 것이다. 표 1 시간 0ms (초기 값)10ms20ms30ms40ms50ms60ms70ms80ms90ms100ms 획득 주 기별 데 이터값10ms10001100120013001400150016001700180019002000 50ms1000 1500 2000 10ms로 1.63s 계측 시 163개 데이터로 구성되나, 50ms로 2s 정규화된 데이터 down sampling 수행 시 40개의 데 이터로 구성이 된다. 다음, 주행 데이터의 전처리 방법은 신호 크기 값들에 대하여 정규화(Normalization)를 수행한다. 인공지능의 판정에 사용하기 위해 데이터 값의 크기를 1로 수정하는 것이다. 정규화된 값은 다음과 같다. 정규화된 값 = 계측을 통해 얻어진 신호의 값 × 1/신호의 최대 값 예를 들어, 엔진속도 4500rpm(원래 값) -> 0.81(정규화 된 값, 4500rpm × 1/5500rpm) 이를 통해 각 신호별 일관된 최대, 최소 값을 적용하여 크기 정규화를 수행하고, 각 신호별 크기 정규화를 위한 최대/최소 값의 예시는 다음과 같다. 표 2 주행 데이터 MAX. MIN. 엔진 속도 5500 1200 토크컨버터 속도 5500 1200 차량 종가속도 3.5 -0.5 악셀 개도량 60 20 엔진 토크량 160 15 변속기 출력 속도 2500 300 변속기 온도 105 60 엔진 온도 120 23 그리고, 각 인공지능 종류에 맞추어 정규화된 데이터 형으로 변환할 수 있다. 즉, 인공지능 별 필요로 하는 데 이터 입력 형태가 다르기 때문이다. 예를 들어, DNN 및 머신러닝 모델 : 1D 형태, RNN(순환신경망): 시계열 데이터 형태(2D), CNN(합성곱 신경망) : 이미지 데이터 형태(2D) 등이다. 표 3은 1D 형태, 표 4는 2D 시계열을 나타낸 것이다. 표 3 - 엔진속도 토크컨버터 속도 · · · 칼럼 1행 1~40열 1행 41~80열 · · · 데이터#11 · · ·40 1 · · · 40 · · · 표 4 - 엔진속도 토크컨버터 속도 · · · 칼럼 1행 1~40열 2행 1~40열 · · · 데이터#11 · · ·40 1 · · ·40 · · · 다음, 도 4는 본 발명의 진단 방법의 제어 구간 및 가속도 신호의 특징 값 계산을 나타낸 것이다. 전처리된 데이터의 제어 구간별 시간 및 가속도 신호의 특징 값 계산은 먼저, 1) 엔진 속도 신호의 변곡점을 이 용하여 제어 구간을 분류한다. CAN 통신 계측 신호로는 변속기 제어 유닛의 클러치 제어 구간을 알 수 없으므로, 클러치 제어시 변곡점을 가지 는 엔진 신호를 이용하여 제어 구간을 분류한다. 이는 도시와 같이 변곡점(기울기의 부호가 바뀌는 점) 발생 시 구간이 바뀐 것으로 판단한다. 그리고, 2) 제어 구간별 [시간, 가속도 센서의 최대 최소 차이 값, 가속도 센서의 최대 시간당 변화량 값] 계산 및 기록한다. 이는 클러치 제어 불만에 관련한 특징값들을 추출하여, H/W교체나 제어 보정 판단에 사용하기 위함이다. 이후, 이와 같이 전처리된 데이터(차량 상태 신호값들 및 차량 가속도 값)를 지도 학습된 인공지능 모델에 입력 하여 정상인지 비정상인지 세부 분류하는데, 인공지능 판정의 출력 형태는 OK인지 NG(Not Good)인지가 다음과 같이 확률로 출력된다. ex> OK : NG1 : NG2 : NG3 : NG4 = 0.1 : 0.7 : 0.1 : 0.1 NG1 OK : NG1 : NG2 : NG3 : NG4 = 0.5 : 0.1 : 0.3 : 0.1 OK 즉, 2회 이상 동일 판정 나올 시 해당 케이스로 최종 판정하고, 동일 케이스가 나오지 않을 시 주행 데이터 획 득 단계로 되돌아간다. 참고로, 인공지능 모델의 정확도는 표 5와 같으며, 정확도가 높을수록 연산시간 및 메모리 사용량이 커지므로, 진단장치의 H/W 성능을 고려하여 선택할 수 있다. 표 5 모델 모델 계열 정확도(%) Gradient Boost ML 94.8 Random Forest ML 95.1 LSTM(BASE) RNN+DNN 97.0 2D CNN CNN+DNN 97.3 DNN DNN 97.6 1D CNN CNN+DNN 98.9 그리고, NG1~NG4로 지도 학습된 결과는 예를 들어 표 6과 같다. 표 6 종류 용어 충격 구간 특징 NG1 Fill shock 변속 중비 구간 유압 제어 전 준비 상태 시 H/W 문제 NG2 Tie up shock 실 변속 시작 전 변속시 유압 과다로 가 속도 변동 큼 NG3 Flate 실 변속 시작 전 변속기 유압 부족으로 엔진 속도 급상승 NG4 변속 말기 shock 변속 완료 시작 전 엔진 RPM 하강 후 유압 과다로 충격 이와 같이 비정상 판정 후, 특징값 기반 임계값 판정 방식을 통해 제어 보정으로 충격 해결 가능한지를 판단한 다. NG2~4의 경우 H/W고장으로 인해 제어구간이 매우 짧거나 긴 경우 및 충격이 매우 큰 경우 외에는 제어 보정 가 능으로 판단하고, NG1의 경우 H/W 고장에 의해 발생하는 요인으로 제어 보정으로 해결 불가능한 경우이다. 그리고, NG4의 경우 NG2의 요인이나 엔진의 기능 고장에 의해서 발생하므로 NG2의 H/W 고장 여부도 점검 필요하 다. 이에 따른 구체적인 제어는 후술하도록 한다. NG1 내지 NG4의 종류에 따라 제어 보정 가능한 경우, 제어 구간별 시간을 활용하여 솔레노이드 제어 전류량을 보정한다. 비정상 Case로 판정된 경우는 변속기 제어유닛 자체의 변속 학습이 H/W 성능 대비하여 과학습되거나 과소학습되 어 최적점에 수렴하지 못하는 경우이므로, 각 변속과 관련된 솔레노이드에 대한 제어 지령-솔레노이드 제어 전 류량 Map에 보정 값을 더하여, NG 종류에 맞추어 솔레노이드 응답성을 보완해주는 효과를 주어 최적점에 수렴할 확률을 높이도록 보정하는 것이다. 먼저, 제어 보정 대상을 각 변속에서 결합측 클러치를 담당하는 솔레노이드로 결정한다. 예를 들어, 6속 변속기 기준 34 변속 : OD(Over Drive) 클러치가 결합측 클러치이며, OD 클러치를 담당하는 솔 레노이드이다. 그리고, 제어 보정값을 결정한다. 제어 보정값은 응답성 계산 후 응답성에 따른 적용 Map에 따라 보정값을 결정 한 후, 제어 지령-제어 전류 값 Map에서 NG 종류에 맞추어 특정 위치의 값에 보정 값을 더해 준다. 특정 위치 값만 바꿔주는 이유는 문제 제어 영역 외의 제어 값 변경 영향성을 줄이고, 변경량을 적게 하여 비휘 발성 메모리의 Flashing 속도를 높이기 위함이다. 응답성은 다음과 같으며, NG 종류에 따라 다음과 같이 보정한다. 응답성 = (계측된 변속 준비구간 시간- 설정 값)/설정 값 NG2 or NG3 : 변속 준비구간에 해당하는 압력 범위의 제어 전류 값에 보정 Map 값 적용(응답성 계산 시 NG2는 음수 값, NG3는 양수 값 나옴) NG4 : 실 변속구간에 해당하는 압력 범위의 제어 전류 값에 보정 Map 값 적용(응답성 계산 시 NG4는 음수 값 나 옴) 응답성에 따른 솔레노이드 전류 보정값 예시는 다음과 같다. 표 7 응답성 -1-0.5-0.3-0.20 0.20.30.51 보정 전류 (mA)-50-20-100 0 0 10 20 50 이와 같이 전류 보정값 결정 후 제어 구간별 시간을 활용하여 솔레노이드 제어 전류량을 보정한다. 도 5는 응답성에 따른 솔레노이드 전류 보정 결과의 예시 및 NG2, NG3 케이스 제어 유압 대역의 솔레노이드 전 류 보정 결과의 예시이다. 이와 같이 응답성에 따른 제어 전류 보정 시의 효과는 도 6 및 도 7과 같다. 응답성 빠를 시 : 기존 대비 더 낮은 제어 전류 입력되어, 응답성 낮춰주는 효과가 있다. 응답성 느릴 시 : 기존 대비 더 높은 제어 전류 입력되어, 응답성 높여주는 효과가 있다. 이하에서는, 이상과 같이 설명한 내용과, 도 8 및 도 9를 참조하여 본 발명의 일 실시예에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법을 순차적으로 설명한다. 먼저 진단 장치가 차량의 제어 장치와 CAN 통신을 통해 차량의 변속 제어 주행 데이터를 3회 이상 획득한다 (S110). 진단 장치는 수신한 주행 데이터를 전처리한다(S120). 주행 데이터의 전처리는 1)변속 클러치 제어 시간(계측 시간)을 일정한 시간(설정값)으로 정규화하고, 2)정규화 된 데이터를 다운 샘플링(Down sampling)한다. 그리고, 3)주행 데이터의 신호 크기 값을 정규화하며, 4)인공지능 종류에 맞추어 정규화된 데이터 형태로 변환 할 수 있다. 이와 같이 전처리된 데이터의 제어 구간별 시간, 가속도 신호의 특징 값을 계산한다. 즉, 엔진 속도 신호의 변곡점을 이용하여 변속 제어 구간별 시간을 추출하고(S130), 제어 구간별 시간, 가속도 신호의 최대값과 최소값의 차이 및 가속도 신호의 시간당 최대 변화량 값을 특징 값으로 추출한다(S140). 그런 다음, 추출된 특징 값을 입력으로 하여 지도 학습 기반 인공지능을 이용한 학습을 통해 변속기의 정상, 비 정상 여부를 판단하여 분류한다(S150). 비정상 유형은 제1 비정상 유형(NG1), 제2 비정상 유형(NG2), 제3 비정상 유형(NG3), 제4 비정상 유형(NG4) 등 으로 분류될 수 있으며, 각 유형에 대한 확률로 출력된다. 그래서, 2회 이상 동일 유형으로 판정되는지 여부를 판단하여(S160), 2회 이상 동일 유형 판정시 해당 유형으로 최종 판정한다. 판정된 유형이 비정상 유형(NG)인지를 판단하여(S170), 정상 유형(OK)이면 진단 장치가 정상 결과를 표시하고 (S180), 제어가 종료된다. 이상의 단계를 통해 비정상 유형으로 판단되면, 제어 보정에 의해 충격 해결이 가능한지 여부를 판단하고 (S210), 비정상(NG) 판정 결과 및 H/W 교체 필요한지 또는 제어 보정 가능한지의 결과를 표시한다(S220). 도 8은 S210의 제어 보정 가능 여부에 대한 판단 과정이다. S211은 S170에 대응되는 단계로서, 인공지능 판정결과 NG로 판정되면(S211), 제1 비정상 유형(NG1)인지 여부를 판단한다(S212). 제1 비정상 유형(NG1), 제2 비정상 유형(NG2), 제3 비정상 유형(NG3), 제4 비정상 유형(NG4) 중 제1 비정상 유 형(NG1)은 변속 준비 구간에서의 비정상 유형이며, 제4 비정상 유형(NG4)은 변속 완료 구간 시작 직전의 비정상 유형에 해당한다. 그리고, 제2 비정상 유형(NG2) 및 제3 비정상 유형(NG3)은 실 변속 구간 시작 직전의 비정상 유형에 해당한다. 또한, 제1 비정상 유형(NG1)과 제4 비정상 유형(NG4)은 H/W 즉 변속기 교체가 필요한 비정상 유형이며, 제2 비 정상 유형(NG2) 및 제3 비정상 유형(NG3)은 변속기 교체가 필요하지 않고 제어 보정으로 개선이 가능한 유형에 해당한다. 따라서, 비정상 유형이 NG1인지 여부를 판단하여(S212), NG1에 해당하면 H/W 교체 필요로 판단하며(S216), 이러 한 판단 결과는 S220에 따라 표시되게 한다. S212 판단 결과 NG1이 아니면, 제1 교체 조건에 해당하는지 여부를 판단한다(S213). 제1 교체조건의 만족은 다음의 조건 중 하나를 만족하면 만족하게 된다. 즉, NG1으로 판정되지는 않았지만, 변속준비구간의 시간이 제1 설정시간을 초과하는 경우, 변속준비구간의 시간 이 제2 설정시간 미만인 경우, 변속 준비구간의 가속도 신호의 시간당 최대 변화량이 제1 설정 변화량을 초과하 는 경우, 변속 준비구간의 가속도 신호의 최대값과 최소값의 차이가 제1 설정 차이값을 초과하는 경우 중 어느 하나에 해당하면 H/W 교체가 필요한 것으로 판단한다(S216). S213 판단 결과, 제1 교체조건에 해당하지 않으면, 비정상 유형이 NG4인지 여부를 판단하여(S214), NG4에 해당 하면 H/W 교체 필요로 판단한다(S216). S214 판단 결과 NG4가 아니면, 제2 교체 조건에 해당하는지 여부를 판단한다(S215). 제2 교체조건의 만족은 다음의 조건 중 하나를 만족하면 만족하게 된다. 즉, NG4로 판정되지는 않았지만, 실 변속 구간의 시간이 제3 설정시간을 초과하는 경우, 실 변속 구간의 가속도 신호의 시간당 최대 변화량이 제2 설정 변화량을 초과하는 경우, 실 변속 구간의 가속도 신호의 최대값과 최소 값의 차이가 제2 설정 차이값을 초과하는 경우 중 어느 하나에 해당하면 H/W 교체가 필요한 것으로 판단한다 (S216). 그러나, 제2 교체 조건을 만족하지 않으면, 제어 보정으로 개선 가능한 것으로 판단한다(S217). 제어 보정으로 개선 가능한 경우의 제어 보정 방법은 도 10에 별도로 도시하였다. 즉, 지도학습 기반 인공지능 판정 결과 및 제어 보정을 통한 개선 가능여부를 확인하고(S310), 제어 보정을 통 해 개선 가능한지를 판단하여(S320) 제어 보정을 통해 개선 가능한 것으로 판단되면, 문제 변속의 솔레노이드 학습 및 변속 학습값들의 초기화를 결정한다(S330). 즉, 변속기 제어 유닛(TCU)에 저장된 변속 제어가 문제되는 변속의 학습값들을 모두 초기화하는 것이다. 그리고, 문제 변속 결합측 클러치를 제어하는 솔레노이드를 보정 대상으로 결정한다(S340). 그런 다음, 제어 보정값을 결정한다. 즉, 응답성 계산 후 응답성에 따라 대응되게 설정된 보정값을 결정한다 (S350). 응답성은 (계측된 변속 준비구간 시간 - 설정 값)/설정 값 으로 계산된다. 제어 보정값이 결정되면, 제어 지령-제어 전류 값 Map에서 제어 전류에 보정값을 더해주며, 비정상(NG) 유형에 따라 전류보정 적용구간을 결정하여, 결정된 변속 제어 구간에 제어 전류 값을 보정한다(S360). 그런 다음, 학습값 초기화 및 제어 전류량 보정에 따른 TCU 리프로그래밍(Flashing)을 수행한다(S370). 본 발명은 이상과 같이 지도학습 기반 인공지능을 통해 고장 진단 및 보정 여부의 결정이 가능하게 함으로써 진 단 측면 및 소비자 측면에서 보다 효율적으로 이용할 수 있다. 이상과 같은 본 발명은 예시된 도면을 참조하여 설명되었지만, 기재된 실시 예에 한정되는 것이 아니고, 본 발 명의 사상 및 범위를 벗어나지 않고 다양하게 수정 및 변형될 수 있음은 이 기술의 분야에서 통상의 지식을 가 진 자에게 자명하다. 따라서 그러한 수정 예 또는 변형 예들은 본 발명의 특허청구범위에 속한다 하여야 할 것 이며, 본 발명의 권리범위는 첨부된 특허청구범위에 기초하여 해석되어야 할 것이다."}
{"patent_id": "10-2023-0018032", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치에 의한 진단 과 정을 도시한 것이다. 도 2는 본 발명의 응용 실시예에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진단 장치에 의한 진단 과정을 도시한 것이다. 도 3은 본 발명의 진단 방법의 주행 데이터 전처리 과정의 일부를 도시한 것이다. 도 4는 본 발명의 진단 방법의 제어 구간 및 가속도 신호의 특징 값 계산을 나타낸 것이다. 도 5는 응답성에 따른 솔레노이드 전류 보정 결과 및 NG2, NG3 케이스 제어 유압 대역의 솔레노이드 전류 보정 결과의 예시이다. 도 6 및 도 7은 응답성에 따른 제어 전류 보정시 효과를 도시한 것이다. 도 8 및 도 9는 본 발명의 일 실시예에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법을 도시 한 것이다.도 10은 본 발명의 일 실시예에 의한 지도학습 기반 인공지능을 이용한 변속기의 고장 진단 방법을 통한 변속 충격 개선 방법을 도시한 것이다."}
