{"patent_id": "10-2023-0042959", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0147264", "출원번호": "10-2023-0042959", "발명의 명칭": "PD 진단장비 성능 검증 시스템 및 방법", "출원인": "한국전력공사", "발명자": "강문호"}}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "모사 개폐기들 및 모사 선로들을 구비하는 배전 계통 모사 시스템;상기 배전 계통 모사 시스템의 특정 개소들에서 의도적인 PD를 발생시키는 PD 발생기들;상기 배전 계통 모사 시스템의 특정 측정 개소들에 PD 검출을 위한 센서를 부착할 수 있는 센서 장착부들;각 센서 장착부에 부착된 센서들의 센싱 신호들을 상기 배전 계통 모사 시스템의 내부에서 수집하는 로컬 유닛;및 상기 배전 계통 모사 시스템의 특정 측정 개소에서 PD 측정을 수행한 검증 대상 PD 진단장비의 진단 결과와, 상기 로컬 유닛에서 수집된 센싱 신호들에 기반한 진단 결과를 비교하는 방식으로, 상기 검증 대상 PD 진단장비의성능을 검증하는 검증 장치를 포함하는 PD 진단장비 성능 검증 시스템."}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 센서 장착부들은, 모사 개폐기의 내부나 접지선 및 모사 선로의 중간 접속재에 마련된 PD 진단장비 성능 검증 시스템."}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 센서 장착부들에 부착된 HFCT 센서, UHF 센서, TEV 센서, AE 초음파 센서 중 적어도 하나 이상의 센서들을 더 포함하는 PD 진단장비 성능 검증 시스템."}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 HFCT 센서는 각 개폐기의 접지선에 설치되며, 상기 UHF, TEV, AE센서는 개폐기 본체 전면부에 자석 부착식으로 설치되는 PD 진단장비 성능 검증 시스템."}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 로컬 유닛의 외면에 부착되며, 상기 배전 계통 모사 시스템의 코로나 노이즈를 검출하는 노이즈 전자파 센서를 더 포함하는 PD 진단장비 성능 검증 시스템.공개특허 10-2024-0147264-3-청구항 6 제1항에 있어서,상기 로컬 유닛은, 센서들과 서지 보호 기능과 측정용 임피던스를 가지는 동축 케이블로 상기 센서들과 연결된 PD 진단장비 성능검증 시스템."}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,광케이블을 통해 상기 검증 장치와 연결되며, 상기 로컬 유닛이 수집한 센싱 신호로서 출력하는 전기적 신호를광 신호로 변환하는 광신호 변환기를 더 포함하는 PD 진단장비 성능 검증 시스템."}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 검증 장치는,상기 로컬 유닛에 접속하여 운영자가 세팅 값을 실시간 제어하는 리얼타임 모드를 지원하는 PD 진단장비 성능검증 시스템."}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "모사 개폐기들 및 모사 선로들을 구비하는 배전 계통 모사 시스템에, 특정 개소들에서 의도적인 PD를 발생시키는 PD 발생기들 및 특정 측정 개소들에 PD 검출을 위한 센서들을 구성하는 단계;상기 센서들의 센싱 신호들을 상기 배전 계통 모사 시스템의 내부에서 수집하는 단계; 수집된 상기 센싱 신호들을 분석하여 PD 진단을 수행하는 단계; 및 상기 배전 계통 모사 시스템의 특정 측정 개소에서 PD 측정을 수행한 검증 대상 PD 진단장비의 진단 결과와, 상기 PD 진단을 수행하는 단계에서의 진단 결과를 비교하는 방식으로, 상기 검증 대상 PD 진단장비의 성능을 검증하는 단계를 포함하는 PD 진단장비 성능 검증 방법."}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 센싱 신호들을 상기 배전 계통 모사 시스템의 내부에서 수집하는 단계는,상기 배전 계통 모사 시스템의 내부의 로컬 유닛에서 상기 센싱 신호들을 수집하는 단계;상기 로컬 유닛이 수집한 센싱 신호로서의 전기적 신호를 광 신호로 변환하는 단계; 및상기 광 신호를 광케이블을 통해 상기 배전 계통 모사 시스템의 외부의 검증 장치로 전송하는 단계를 포함하는 PD 진단장비 성능 검증 방법.공개특허 10-2024-0147264-4-청구항 11 제10항에 있어서,상기 PD 검출을 위한 센서에서 PD를 검출한 센싱 신호를 생성하는 단계; 및 노이즈 센서에서 상기 배전 계통 모사 시스템의 노이즈를 검출한 센싱 신호를 생성하는 단계를 더 포함하는 PD 진단장비 성능 검증 방법."}
{"patent_id": "10-2023-0042959", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 검증 장치가 상기 로컬 유닛에 접속하여 운영자가 세팅 값을 실시간 제어하는 단계를 더 포함하는 PD 진단장비 성능 검증 방법."}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 PD 진단장비 성능 검증 시스템은, 모사 개폐기들 및 모사 선로들을 구비하는 배전 계통 모사 시스템; 상기 배전 계통 모사 시스템의 특정 개소들에서 의도적인 PD를 발생시키는 PD 발생기들; 상기 배전 계통 모사 시 스템의 특정 측정 개소들에 PD 검출을 위한 센서를 부착할 수 있는 센서 장착부들; 각 센서 장착부에 부착된 센 서들의 센싱 신호들을 상기 배전 계통 모사 시스템의 내부에서 수집하는 로컬 유닛; 및 상기 배전 계통 모사 시 스템의 특정 측정 개소에서 PD 측정을 수행한 검증 대상 PD 진단장비의 진단 결과와, 상기 로컬 유닛에서 수집된 센싱 신호들에 기반한 진단 결과를 비교하는 방식으로, 상기 검증 대상 PD 진단장비의 성능을 검증하는 검증 장 치를 포함할 수 있다."}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 특히 휴대용(on-site) PD 진단장비에 대한 공신력있는 성능검증을 수행할 수 있는 PD 진단장비 성능 검증 시스템 및 방법에 관한 것이다.."}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 설치 후 13년이 지난 지중케이블에 적용 중인 VLF(Very Low Fewquency) 사선진단은 휴전작업에 장시간이 소요되고 하절기 부하절체의 어려움으로 증가하는 노후케이블의 인력진단에 한계발생이 예상되며, 설치 후 3년 이내 지중케이블의 고장율이 증가하고 있어, 이를 해소하기 위해 중장기적으로 신뢰도가 높은 상시 감시진단의 확대가 요구된다. 지상개폐기의 경우, 현재 TEV(Transient Earth Voltage, 미소전위차 측정) 진단장비가 적용되고 있으나, 국내외 에 신호검출 및 분석기법이 상이한 다양한 진단 장비들이 적용되고 있어, 진단 신뢰성이 높은 장비의 선별 적용 이 필요하다. 그러나, 전 세계적으로 현장에서 운영 중인 지중 배전설비를 대상으로 하는 진단장비에 대한 객관적인 평가방법 및 규격 그리고 평가인프라 구성 방법의 부재로 새로운 진단장비 및 분석기술의 도입이 지연되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록공보 10-1280763호 (특허문헌 0002)"}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 현장에서 운영 중인 배전 설비를 대상으로 하는 진단 장비에 대한 평가 방법에 객관성/공신력을 부여 할 수 있는 PD 진단장비 성능 검증 시스템 및 방법을 제공하고자 한다. 구체적으로, 본 발명은 다양한 PD진단장비의 성능을 정량적으로 검증하기 위한 시스템에 적용하며 지상개폐기 및 지중배전케이블로 구성된 모의선로를 구축하고 휴대용 인력 진단장비와 동시에 PD (Partial Discharge, 부분 방전) 현상을 측정하고 그 결과를 비교함으로써 휴대용 진단장비의 PD검출 및 절연이상 설비 적출 정확도를 정 량적으로 평가하는 PD 진단장비 성능 검증 시스템 및 방법을 제공하고자 한다. 이에 따라, 표준 결함신호 발생장치와 지중 배전설비 진단장비 신호검출 및 진단 정확도 판단 알고리즘 등 성능 검증기술 개발과 검증설비 구축을 통해 판단 정확도가 높은 진단장비를 선별 도입함으로써 지중 배전설비 진단 신뢰도 향상 및 설비교체 비용 최소화를 달성하고자 한다."}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따른 PD 진단장비 성능 검증 시스템은, 모사 개폐기들 및 모사 선로들을 구비하는 배전 계 통 모사 시스템; 상기 배전 계통 모사 시스템의 특정 개소들에서 의도적인 PD를 발생시키는 PD 발생기들; 상기 배전 계통 모사 시스템의 특정 측정 개소들에 PD 검출을 위한 센서를 부착할 수 있는 센서 장착부들; 각 센서 장착부에 부착된 센서들의 센싱 신호들을 상기 배전 계통 모사 시스템의 내부에서 수집하는 로컬 유닛; 및 상기 배전 계통 모사 시스템의 특정 측정 개소에서 PD 측정을 수행한 검증 대상 PD 진단장비의 진단 결과와, 상기 로 컬 유닛에서 수집된 센싱 신호들에 기반한 진단 결과를 비교하는 방식으로, 상기 검증 대상 PD 진단장비의 성능 을 검증하는 검증 장치를 포함할 수 있다. 여기서, 상기 센서 장착부들은, 모사 개폐기의 내부나 접지선 및 모사 선로의 중간 접속재에 마련될 수 있다. 여기서, 상기 센서 장착부들에 부착된 HFCT 센서, UHF 센서, TEV 센서, AE 초음파 센서 중 적어도 하나 이상의 센서들을 더 포함할 수 있다. 여기서, 상기 HFCT 센서는 각 개폐기의 접지선에 설치되며, 상기 UHF, TEV, AE센서는 개폐기 본체 전면부에 자 석 부착식으로 설치될 수 있다. 여기서, 상기 로컬 유닛의 외면에 부착되며, 상기 배전 계통 모사 시스템의 코로나 노이즈를 검출하는 노이즈 전자파 센서를 더 포함할 수 있다. 여기서, 상기 로컬 유닛은, 센서들과 서지 보호 기능과 측정용 임피던스를 가지는 동축 케이블로 상기 센서들과 연결될 수 있다. 여기서, 광케이블을 통해 상기 검증 장치와 연결되며, 상기 로컬 유닛이 수집한 센싱 신호로서 출력하는 전기적 신호를 광 신호로 변환하는 광신호 변환기를 더 포함할 수 있다. 여기서, 상기 검증 장치는, 상기 로컬 유닛에 접속하여 운영자가 세팅 값을 실시간 제어하는 리얼타임 모드를 지원할 수 있다. 본 발명의 다른 측면에 따른 PD 진단장비 성능 검증 방법은, 모사 개폐기들 및 모사 선로들을 구비하는 배전 계 통 모사 시스템에, 특정 개소들에서 의도적인 PD를 발생시키는 PD 발생기들 및 특정 측정 개소들에 PD 검출을 위한 센서들을 구성하는 단계; 상기 센서들의 센싱 신호들을 상기 배전 계통 모사 시스템의 내부에서 수집하는 단계; 수집된 상기 센싱 신호들을 분석하여 PD 진단을 수행하는 단계; 및 상기 배전 계통 모사 시스템의 특정 측정 개소에서 PD 측정을 수행한 검증 대상 PD 진단장비의 진단 결과와, 상기 PD 진단을 수행하는 단계에서의 진단 결과를 비교하는 방식으로, 상기 검증 대상 PD 진단장비의 성능을 검증하는 단계를 포함할 수 있다. 여기서, 상기 센싱 신호들을 상기 배전 계통 모사 시스템의 내부에서 수집하는 단계는, 상기 배전 계통 모사 시 스템의 내부의 로컬 유닛에서 상기 센싱 신호들을 수집하는 단계; 상기 로컬 유닛이 수집한 센싱 신호로서의 전 기적 신호를 광 신호로 변환하는 단계; 및 상기 광 신호를 광케이블을 통해 상기 배전 계통 모사 시스템의 외부 의 검증 장치로 전송하는 단계를 포함할 수 있다. 여기서, 상기 PD 검출을 위한 센서에서 PD를 검출한 센싱 신호를 생성하는 단계; 및 노이즈 센서에서 상기 배전 계통 모사 시스템의 노이즈를 검출한 센싱 신호를 생성하는 단계를 더 포함할 수 있다.여기서, 상기 검증 장치가 상기 로컬 유닛에 접속하여 운영자가 세팅 값을 실시간 제어하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 구성의 본 발명의 사상에 따른 PD 진단장비 성능 검증 시스템 및/또는 방법을 실시하면, 현장에서 운영 중인 배전 설비를 대상으로 하는 진단 장비에 대한 객관적인 평가 방법을 제공하는 이점이 있다."}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 설명함에 있어서 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요 소들은 용어들에 의해 한정되지 않을 수 있다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적 으로만 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 연결되어 있다거나 접속되어 있다고 언급되는 경우는, 그 다른 구성요소에 직 접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해 될 수 있다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 명세서에서, 포함하다 또는 구비하다 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것으로서, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해될 수 있다. 또한, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 본 발명에서는 다양한 PD 진단장비의 성능을 정량적으로 검증하기 위한 시스템에 적용하며 지상개폐기 및 지중 배전케이블로 구성된 모의선로를 구축하고 휴대용 인력 진단장비와 동시에 PD(Partial Discharge, 부분방전) 현 상을 측정하고 그 결과를 비교함으로써 휴대용 진단장비의 PD 검출 및 절연이상 설비 적출 정확도를 정량적으로 평가하는 시스템을 제공한다. 즉, PD 진단장비 성능 평가를 위한 시험장으로서 배전 계통 모사 시스템과, PD 진단 성능에 대한 레퍼런스를 제 공하는 레퍼런스 PD 진단 시스템과, 대상 PD 진단장비의 PD 진단 결과와 상기 레퍼런스 PD 진단 시스템의 진단 결과를 비교하는 방식의 검증 장치(진단 서버)로 이루어지는 시스템을 제시한다. 다음, 시스템 구성에 요구되는 구체적인 구조 일반 내용을 기술한다. 휴대용 PD 진단장비 성능검증 시스템의 각각의 구성품은 시험 환경에 적합하도록 충분한 기계적, 전기적 강도를 갖고 통상의 온도 및 습도변화, 진동, 충격에 견딜 수 있는 구조이다. 휴대용 PD 진단장비 성능검증 시스템은 상용전원(국내 220V)을 사용하여야 하며, 정전대비 UPS가 구비되어 있다. 휴대용 PD 진단장비 성능검증 시스템의 센서 및 각각의 구성품들 취부 시 지상개폐기 및 배전케이블 중간접속부 에 설치할 수 있는 구조이다. 휴대용 PD 진단장비 성능검증 시스템의 구성품 중 먼지 등 이물질의 유입 우려가 있거나, 외부 접촉에 의하여 동작에 영향을 미칠 우려가 있을 수 있으므로 구성품을 보호할 수 있게 외함이 설치되어야 하며, 시스템의 유지, 보수를 생각하여 용이한 구조인 것이 유리하다. 또한, 휴대용 PD 진단장비 성능검증 시스템에 있어서, 성능검증 시스템의 목적은 노이즈가 많은 환경에서 진성 PD가 발생하는 개소를 운영자의 개입 없이 자동으로 표시 및 PD 발생 유형 판단을 해주어야 하며, PD 발생 개소 가 1개소가 아닌 다중 개소 발생 시에도 분석이 가능하여야 한다. 도 1은 상술한 시스템으로서 본 발명의 사상에 따른 PD 진단장비 성능 검증 시스템의 일 실시예를 도시한 개요 도이다. 도시한 PD 진단장비 성능 검증 시스템은, 모사 개폐기들 및 모사 선로들을 구비하는 배전 계통 모사 시스템 ; 상기 배전 계통 모사 시스템의 특정 개소들에서 의도적인 PD를 발생시키는 PD 발생기들(111 ~ 11N); 상기 배전 계통 모사 시스템의 특정 측정 개소들에 PD 검출을 위한 센서(221 ~ 22N)를 부착할 수 있는 센 서 장착부들(201 ~ 20N); 각 센서 장착부에 부착된 센서들의 센싱 신호들을 상기 배전 계통 모사 시스템의 내부에서 수집하는 로컬 유닛; 및 상기 배전 계통 모사 시스템의 특정 측정 개소에서 PD 측정을 수행한 검 증 대상 PD 진단장비의 진단 결과와, 상기 로컬 유닛에서 수집된 센싱 신호들에 기반한 진단 결과를 비교하는 방식으로, 상기 검증 대상 PD 진단장비의 성능을 검증하는 검증 장치를 포함할 수 있다. 도 1의 본 발명의 사상에 따른 PD 진단장비 성능 검증 시스템의 하드웨어는 센서부, 로컬 유닛 관련 부분 들, 검증 장치(진단 Unit부)로 구분될 수 있다. 도 2는 시험장으로서 배전 계통 모사 시스템의 구축 형태에 대한 예시도이다. 도 3은 레퍼런스 PD 진단 시스템의 일 예에 따른 전체 시스템 구성도이다. 도 3의 예시에 따른 레퍼런스 PD 진단 시스템은, 시험장의 이상설비 지상개폐기 및 배전케이블 중간접속부 결함 에서 발생되는 PD 신호를 검출하여 운영자에게 알람 정보를 제공하는 진단시스템으로 PD 검출 하드웨어와 이상 발생 종합 분석 소프트웨어로 구성될 수 있다. 부분방전 검출 하드웨어는 아주 미소한 부분방전 신호를 검출하여야 하므로 고감도의 검출감도를 가지고 있어야 하며 외부에서 유입되는 노이즈의 영향을 최소화하여 PD 신호를 구분하는 기능을 가질 수 있다.다음, 각 사례별 이상 위치 판단을 위해, 시험장에 선택적으로 조합될 수 있는 시스템 구성들에 대하여 살펴보 겠다. 도 4는 이상 설비 위치 판단의 기본 시스템 구성을 나타낸다. 도시한 기본 시스템에서는, 각각의 개폐기(111 ~ 114) 및 중간접속 공통 접지에 유도성 HFCT(High Frequency Current Transformer)를 설치하여 구성하였고, 도시하지는 않았지만 노이즈를 제거할 수 있도록 별도의 노이즈 센서를 추가적으로 설치할 수 있다. 도시한 로컬 유닛은 각각의 설비별로 동시 분석을 위하여 개폐기 전용 Local Unit #01, 중간접속재(131 ~ 134) 전용 Local Unit #02로 구분하여 구성할 수 있으며, 4Ch 동시 패턴 및 펄스 분석을 통한 발생 설비 판단을 할 수 있다. 도시하지는 않았지만, 도 1의 센서 장착부들(201 ~ 20N)은, 모사 개폐기(111 ~ 114)의 내부나 접지선 및 모사 선로의 중간 접속재(131 ~ 134)에 마련됨을 알 수 있다. 도 5는 개폐기 이상 발생시 UHF센서 추가 분석을 위한 시스템 구성을 나타낸다. 도 5는 앞서 구성된 기본 시스템에서 개폐기로 판단했을 시 추가 검증을 위한 UHF센서 각각의 개폐기 본체에 취 부한다. 취부 위치는 본체 전면부에 설치하며 UHF 측정 시스템 또한 노이즈 제거를 위하여 별도 노이즈 검출용 센서를 설치하였다. 특이 사항은 기본 Local Unit의 샘플링(100Ms/s)으로는 UHF 대역 500MHz~1.5GHz 대역 펄스를 측정할 수 없기 때문에 펄스의 Peak만을 취득할 수 있는 별도 Video Detector 모듈을 추가하여 측 정하도록 구성할 수 있다. 도 5는 센싱 신호의 해상도가 높게 요구될 때 적용하기에 유리하다. 도 6a 및 6b는 TEV, AE 센서를 추가하여 분석하는 시스템 구성을 나타낸다. 도 6은 기존 다양한 개폐기 진단 장비에서 활용하는 센서 측정 구성으로써 실제 발생 위치에서 TEV 및 AE센서 측정 및 분석함으로써 이상신호 발생 개폐기에서 실제 어떻게 측정되는지 추가 분석 구성이며 각 센서 출력에 최적화할 수 있도록 Local Unit를 별도로 구성할 수 있다. 도 7은 중간접속 이상 발생시 추가 분석을 위한 시스템 구성을 나타낸다. 도 7은 앞서 구성된 기본 시스템에서 중간접속으로 판단했을 시 추가 검증을 위한 HFCT센서 측정 구성으로써 중 간접속에서는 상 판단이 중요한 분석 팩터이다. 센서 설치 구성은 각각의 케이블 본선 A, B, C상에 각각 설치하 는 구성이며 Local Unit 채널을 고려하여 2회선당 Local Unit 1대씩(251, 252) 구성하였다. 또한 노이즈 제거할 수 있도록 노이즈 검출용 센서를 별도 구성할 수 있다. 다음, 상기 센서 장착부들(201 ~ 20N)에 부착될 수 있는 센서들에 대하여 알아보겠다. 본 발명의 사상에 따라 다양한 종류의 PD 검출 센서들을 부착할 수 있을 뿐만 아니라, 추가적으로 노이즈 판정 및 필터링을 위해 노이 즈 센서도 부착할 수 있다. 관점에 따라서는 상기 센서 장착부들(201 ~ 20N)에 부착된 센서들도 본 발명의 사상 에 따른 PD 진단장비 성능 검증 시스템의 구성요소로 구분할 수도 있다. HW적 관점에서 PD 진단장비 성능 검증 시스템의 구성요소로서의 센서부는 예컨대 PD 신호 센서, 노이즈 신호 센 서, 임피던스로 구성될 수 있다. PD 진단 시 사용되는 대표적인 PD 센서는 HFCT센서이고, 측정감도가 우수한 장점을 가지며 UHF, TEV, AE 센서의 경우 다양한 진단 장비에서 적용하는 센서로써 PD 발생시 추가 분석 및 측정 비교를 위한 센서이다. 대표적인 HFCT 센서는 각 설비의 접지선에 적용하며 추가적인 센서인 UHF, TEV, AE센서는 지상개폐기 본체 전면 부에 자석 부착식으로 설치할 수 있다. 노이즈 검출센서는 다이폴 안테나 타입이며 외부에서 발생되는 코로나 노이즈를 검출한다. 각종 센서들의 측정 방식을 포함한 대표적인 사양을 정리하면 아래 표1과 같다. 표 1"}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다음, 시험장 내부에서 각종 센서들의 센싱 신호들을 수집하는 로컬 유닛에 대하여 도 3을 참조하여 살펴 보겠다. 로컬 유닛(Local Unit)은 시험장의 각 개소에 부착(설치)된 PD 센서에서 검출된 신호를 필터링하고 증폭하 여 디지털 변환하여, 검증 장치로 전송하는 통신 기능을 가진다. 아래 표 2와 같이 국내외 PD 장비 검출부 는 주파수분석 방식과 시간영역 분석 방식으로 구분될 수 있다. 표 2"}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "주파수 분석 방법은 측정감도가 우수하고 운영이 용이하다는 장점을 가지고 있으며 펄스분석 방식은 위치추정과 같은 PD분석 장점을 가진다. 하지만, 본 시스템 특성상 현장 진단과는 다른 정해진 시험 설비 안에서 분석을 시행해야 하기 때문에 시간영역 분석에 초점을 맞추어 펄스만을 가지고 부분방전 펄스를 구분할 수 있는 분석이 우선적으로 가능하도록 설계하는 것이다소 유리하다. 측정주파수 대역은 1~50MHz HF대역이며 주파수분석과 펄스형태분석, 노이즈 게이팅, 위치추정 기능을 가진다. 적용될 수 있는 디지털 프로세서는 100MS/s이상의 고속 디지털 데이터 처리하기 위한 고성능 FPGA와 DSP로 제작 되었고, 8상 동시측정이 가능한 것이면 무방하다. 로컬 유닛은 시험장에 부착된 각종 PD 센서에서 검출된 신호를 받아 노이즈를 제거하고 필터링하고 증폭하 여 디지털 데이터로 변환한 후 메인 유닛인 검증 장치로 전송하는 데이터 처리 프로세서로 구현될 수 있다. 데이터 전송을 위해 광케이블을 통해 상기 검증 장치와 연결되며, 이를 위해, 상기 로컬 유닛이 수집한 센싱 신호로서 출력하는 전기적 신호를 광 신호로 변환하는 광신호 변환기를 더 포함한다. 한편, 상기 로컬 유닛은, 시험장에 부착된 센서들과는 서지 보호 기능과 측정용 임피던스를 가지는 동축 케이블을 통해 연결될 수 있다. 또한, 상기 로컬 유닛의 외면에는, 상기 배전 계통 모사 시스템의 코로나 노이즈를 검출하는 노이즈 전자파 센서가 부착될 수 있다. 노이즈 센싱 신호는 PD 검출에 직접적으로 관련이 있지 않고, 노이즈 제거용으 로 참고되는 용도를 가지는 바, 상기 배전 계통 모사 시스템의 내부에 위치하는 상기 로컬 유닛의 외 면에 바로 부착하는 것이 시험 수행의 편의성 및 경제성 측면에서 유리하다. 상기 로컬 유닛의 사양을 예시하면 하기 표 3과 같다. 핵심기능은 주파수영역 분석(Frequency Domain Analysis), 시간영역 분석(Time Domain analysis) 기능이며 주 파수 영역 분석은 검출된 신호를 FFT 분석하여 1~50MHz주파수 성분을 구분하는 기능이며 시간영역분석은 100MS/s의 샘플링으로 PD펄스 형태를 측정하는 기능을 한다. 주요 특징은 PD 채널 6개와 노이즈 검출채널 2로 구성되며 각 채널을 각각 100MS/s의 고성능 프로세서가 독립적 으로 설계되어 6채널 동시 측정이 가능하다. 따라서 A, B, C, 노이즈 채널에서 동시측정된 신호의 크기, 주파수, 펄스형태 등을 분석하여 신뢰성 있는 분석이 가능하다. 보다 개선된 구현의 경우 로컬 유닛의 주파수 세팅을 포함한 모든 세팅/설정은 검증 장치에서 원격으 로 제어될 수 있다.표 3"}
{"patent_id": "10-2023-0042959", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "다음, 상기 로컬 유닛에 대비될 수 있는 진단 Unit으로서 검증 장치에 대하여 살펴보겠다. 도 8은 상기 검증 장치에 구현될 수 있는 HMI 구성 방안을 나타낸 연계 구조도이다. 상기 검증 장치는, 각각의 검출부에서 전송된 데이터를 데이터베이스에 저장하고, 사용자에게 분석결과를 보여주어야 하며 PD신호 검출 시 알람 신호를 전송한다. 예컨대, 검증 장치는 진단 분석 서버와 운영자 PC로 구성되며 분석 서버에 데이터베이스가 있으며 자동패 턴인식 S/W를 운용할 수 있다. 운영자 PC는 다수 진단 Unit의 선로정보가 표시되며 이벤트 및 경보 발생 이력을 확인할 수 있다. 자동 PD 패턴분석은 뉴럴 네트워크를 이용하며 PD신호가 검출되면 자동적으로 PD 여부 및 결함 의 종류, 열화 정도를 판단하여 알람 신호를 전송한다. 상기 검증 장치에 구비되는 PD 모니터링 시스템의 소프트웨어는 모니터링 모드와 리얼타임모드로 구성 될 수 있다. 모니터링 모드에서는, 자동 탑제된 개소 판단 알고리즘이 개소를 판단하고 최종적으로 부분방전 패턴 분석 소프 트웨어가 결함 유형을 판단하여 알람을 전송한다. 측정된 이벤트 데이터는 데이터베이스에 저장된다. 리얼타임 모드에서는 각각의 로컬 유닛(Local Unit)을 접속하여 운영자가 셋팅 값을 컨트롤하여 실시간으로 제 어가 가능한 모드이다. 초기 모니터링 장비 셋팅 시나 장비 감도 시험시 사용된다. 도 9는 도 1에 도시한 PD 진단장비 성능 검증 시스템에 수행되는 본 발명의 사상에 따른 PD 진단장비 성능 검증 방법의 일 실시예를 도시한 흐름도이다. 도시한 PD 진단장비 성능 검증 방법은, 모사 개폐기들 및 모사 선로들을 구비하는 배전 계통 모사 시스템(도 1 의 100)에, 특정 개소들에서 의도적인 PD를 발생시키는 PD 발생기들(111 ~ 11N) 및 특정 측정 개소들에 PD 검출 을 위한 센서들(221 ~ 22N)을 구성하는 단계(S100); 상기 센서들의 센싱 신호들을 상기 배전 계통 모사 시스템 의 내부에서 수집하는 단계(S220); 수집된 상기 센싱 신호들을 분석하여 PD 진단을 수행하는 단계(S240); 및 상 기 배전 계통 모사 시스템의 특정 측정 개소에서 PD 측정을 수행한 검증 대상 PD 진단장비의 진단 결과와, 상기 PD 진단을 수행하는 단계(S240)에서의 진단 결과를 비교하는 방식으로, 상기 검증 대상 PD 진단장비의 성능을 검증하는 단계(S280)를 포함할 수 있다. 도면에서는, 상기 배전 계통 모사 시스템 상의 특정 측정 개소에서 검증 대상인 휴대용 PD 진단장비로 PD 측정 하는 단계(S250); 및 도 1의 검증 장치가 로컬 유닛에 접속하여 운영자가 세팅 값을 실시간 제어하는 단계(21 0)를 함께 표현하였다. 도시하지는 않았지만, 상기 센싱 신호들을 상기 배전 계통 모사 시스템의 내부에서 수집하는 단계(S220)는, 센 싱의 세부 과정을 수행하는 하드웨어 관점에서, 상기 배전 계통 모사 시스템의 내부의 로컬 유닛에서 상기 센싱 신호들을 수집하는 단계; 상기 로컬 유닛이 수집한 센싱 신호로서의 전기적 신호를 광 신호로 변환하는 단계; 및 상기 광 신호를 광케이블을 통해 상기 배전 계통 모사 시스템의 외부의 검증 장치로 전 송하는 단계를 포함할 수 있다. 이 관점에서, 상기 S240 단계 및 S280 단계는 상기 검증 장치에서 수행된 다. 또한, 상기 센싱 신호들을 수집하는 단계 이전에, 상기 PD 검출을 위한 센서에서 PD를 검출한 센싱 신호를 생성 하는 단계를 수행할 수 있으며, 구현에 따라서는 추가적으로 노이즈 센서에서 상기 배전 계통 모사 시스템의 노 이즈를 검출한 센싱 신호를 생성하는 단계를 수행할 수 있다. PD 검출 기술 분야에서 노이즈 센싱 신호를 적용 하는 방법은 다양한 방식으로 공지된 바, 그 상세 설명은 생략한다. 본 발명의 사상에 따른 성능검증 시스템에 구비되는 레퍼런스 PD 진단 시스템이 달성할 것이 요구되는 목적은 노이즈가 많은 환경에서 진성 PD가 발생하는 개소를 운영자의 개입 없이 자동으로 표시 및 PD 발생 유형 판단을 해주는 것이다. 또한, PD발생 개소가 1개소가 아닌 다중 개소 발생 시에도 분석이 가능하여야 한다. 다음, 도시한 흐름도의 PD 진단장비 성능 검증 방법의 휴대용 PD 진단장비 성능검증상 각 자동 판단 방안(알고 리즘)에 대하여 설명하겠다. 도 10a는 S240 단계의 통합 분석 절차 및 결과 화면으로서, S280 단계에서 제공될 수 있는 PD 발생 설비 자동판 단 결과 화면이며, 도 10b는 설비별 자동판단 전/ 후 PRPD 분석결과 화면이다. 시험 설비 특성상 기존 상용 모니터링 시스템의 주파수 분석이 기본이 되는 방식으로는 한계가 있다고 판단되어 방전원에서 방전이 발생하여 전파되었을 때 전파 경로 및 매질에 따라서 펄스 주파수 및 모양이 변화하는 특성 에 집중하여 핵심 알고리즘 첫 번째 부분방전 펄스 기반 자동판단 알고리즘을 적용하였다(S240). S240 단계에서 적용된 알고리즘을 통해 PD 발생, PD 유입 펄스 분류가 가능하고 PD 발생 펄스만을 추출하여 PRPS매핑 등을 통한 유형판단이 가능하다. 또한, 지상개폐기 및 중간접속 개소에 특화된 절차를 추가하여 운영 자에게 PD 진단장치 성능 평가에 참고될 수 있는 추가정보를 제공할 수 있다. 특히, 중간접속 개소 같은 경우 1 회선이 3상으로 구성되어 있어 상 판단에 특화된 알고리즘을 적용하여 상 판단을 추가적으로 시행할 수 있다. 예컨대, S240 단계에서는, 부분방전 펄스 기반 자동판단은 부분방전 펄스 파형 및 펄스 FFT의 핵심 파라미터를 추출하고 추출된 파라미터를 AI 인공지능 알고리즘을 통해 자동 분류할 수 있다. 각 파라미터들은 시험 구성 설 비에서 발생할 수 있는 모든 경우의 수를 고려하여 PD 및 노이즈를 발생시켜 각각의 개소에 설치된 센서를 통해 펄스를 취득하고 DB화를 선행하여 진행하고 최적화 작업을 진행할 수 있다. 도 11은 PRPS Rawdata 전처리를 예시한 개념도이다. 도 12는 머신러닝 방식의 과정들을 예시한 개념도이다. 도 13은 딥러닝 방식의 과정들 및 결과를 예시한 개념도이다. 구현에 따라, S240 단계는 인공지능의 알고리즘을 반영할 수 있다. 예컨대, PRPS Rawdata 전처리후, 인공지능으 로 유형 판단을 수행할 수 있다. 전처리 과정에서는, 앞서 시행한 부분방전 펄스 기반 자동 판단 알고리즘에서 PD 발생으로 판단된 펄스만을 가 지고 PRPS (Phase Resolved Pulse Sequence) Rawdata를 생성하고 도 11과 같이 유형판단 학습에 적용할수 있는 파라미터들을 추출할 수 있다. 추출한 데이터의 형태는 PRPD (Phase Resolved Partial Discharge), PSA (Pulse Sequence Analysis)이며 추가 적으로 집적량 및 통계량 파라미터를 추출하여 AI 알고리즘 학습 팩터로 활용할 수 있다. 인공지능 유형 판단 알고리즘은 머신러닝 방식과 딥러닝 방식을 적용할 수 있다. 도 12는 머신러닝 방식의 예시 를 나타낸 것이다. 학습 전 검증 방법을 선정하고 검증용 데이터를 이용해서 최적 결과 도출을 하는 방식이다. 특히 패턴 데이터의 주요 분석 인자 선정에 따라서 최적의 결과를 얻을 수 있다. 자사는 앞서 분석한 PRPS Rawdata 전처리 데이터를 바탕으로 학습을 수행 후 판단한다. 데이터가 방대해지고 많아질수록 신뢰성이 향상하 는 도 13과 같은 딥러닝 방식을 적용하는 것이 유리할 수 있다."}
{"patent_id": "10-2023-0042959", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 상술한 시스템으로서 본 발명의 사상에 따른 PD 진단장비 성능 검증 시스템의 일 실시예를 도시한 개요 도. 도 2는 시험장으로서 배전 계통 모사 시스템의 구축 형태에 대한 예시도. 도 3은 레퍼런스 PD 진단 시스템의 일 예에 따른 전체 시스템 구성도. 도 4는 이상 설비 위치 판단의 기본 시험 시스템 구성도. 도 5는 개폐기 이상 발생시 UHF센서 추가 분석을 위한 시험 시스템 구성도. 도 6a 및 6b는 TEV, AE 센서를 추가하여 분석하는 시험 시스템 구성도. 도 7은 중간접속 이상 발생시 추가 분석을 위한 시험 시스템 구성도. 도 8은 검증 장치에 구현될 수 있는 HMI 구성 방안을 나타낸 연계 구조도. 도 9는 본 발명의 사상에 따른 PD 진단장비 성능 검증 방법의 일 실시예를 도시한 흐름도. 도 10a는 통합 분석 절차 및 결과 화면으로서, PD 발생 설비 자동판단 결과 화면. 도 10b는 설비별 자동판단 전/ 후 PRPD 분석결과 화면. 도 11은 PRPS Rawdata 전처리를 예시한 개념도. 도 12는 머신러닝 방식의 과정들을 예시한 개념도. 도 13은 딥러닝 방식의 과정들 및 결과를 예시한 개념도."}
