{"patent_id": "10-2008-0018545", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2009-0093174", "출원번호": "10-2008-0018545", "출원인": "연세대학교 산학협력단", "발명자": "박준홍"}}
{"patent_id": "10-2008-0018545", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지하수 오염에 영향을 미치는 인자들 각각의 값(data)들에 대하여 연관분석(association analysis), 챠트분석(chart analysis), 상관계수분석(correlation analysis), 군집분석(clustering analysis), 요인분석(factoranalysis)을 수행함으로써 수집된 데이터들을 표준화 변환하고 추출하는 데이터 표준화 단계와,상기 표준화된 데이터들에 대하여 t-test, chi-square test를 이용하여 변수의 유의성을 검정함으로써 무의미한변수를 제외하고 의미있는 입력변수를 선택하는 입력변수 선택단계를 포함하는 제1단계;상기 제1단계에 의해 추출된 데이터를 이용하여 로지스틱 회귀분석을 실시하는 회귀분석단계와, 상기 제1단계에의해 추출된 데이터를 이용하여 의사결정나무기법을 적용하는 의사결정나무기법 적용단계와, 상기 제1단계에 의해 추출된 데이터를 이용하여 인공신경망기법을 적용하는 인공신경망기법 적용단계로 구성되는 제2단계와; 상기 제2단계에서 적용된 개별 기법들을 앙상블 방법론(Ensemble Method)으로써 통합하고, 각각의 변수들을 평가기준에 의해 범주화하는 통합화단계로 구성되는 것을 특징으로 하는 지하수오염 취약성 평가방법."}
{"patent_id": "10-2008-0018545", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항의 방법에 의해 이루어지는 및 지하수오염 취약성 평가시스템.명 세 서발명의 상세한 설명 기 술 분 야본 발명은 지하수 오염취약성을 평가하기 위한 방법 및 그 시스템에 관한 것이다. <1>여기서, 지하수오염 취약성이란, 지하수와 관련된 기후, 지질학적 특성 및 토양적 특성 등을 근거으로 하여 표 <2>토층이 오염되었을 때 빗물침투에 의해 지하수가 오염될 가능성이 어느 정도인지를 평가하는 지표로서, 해당 지하수 지역의 수문, 지질, 지형적 특성을 총체적으로 나타내는 개념적 지표이므로, 직접적으로 측정장치에 의해측정할 수 있는 지표가 아니다. 본 발명은, 지하수 오염에 영향을 미치는 데이터를 변환, 추출하여 로지스틱 회귀분석기법, 인공신경망기법, 의 <3>사결정나무기법 등 개별적인 평가방법에 의해 평가한 후에 각 평가결과를 통합하여 최종적으로 등급을 평가하는방법 및 그 시스템을 제안한다. 배 경 기 술세계적으로 수질오염문제의 중요성이 부각되면서 정부, 기업, 학계 및 일반국민들의 수질오염과 관련한 각종 분 <4>석방법에 대한 수요가 급증하고 있다. 수질오염 중에서 특히 지하수 오염은 눈에 보이지 않기 때문에, 하천이나 바다 등의 오염보다 그 폐해에 대한 <5>논의가 많이 부족한 실정이다. 그러나, 지하수는 지표에 있는 지표수보다 그 흐름이 느려 1년에 1~5km 정도 이동하는 것이 보통이기 때문에 일단 오염이 되면 오랫동안 그 지역을 포함한 인근 지역에 영향을 주게 된다. 지하수법 제18조 및 제19조에 따르면, 환경부장관은 전국의 지하수에 대한 수질오염실태를 측정하여 건설부장관 <6>에게 보고하도록 하고 있으며, 환경부령으로 수질기준을 정하도록 하고 있다. 그러나, 각 지역마다 지하수의 오염 취약성이 어느 정도인지를 정확히 평가할 수 있는 방법 및 그 시스템이 알려져 있지 않아, 일선 행정 업무나각 지방자치단체의 지하수 보전 대책 수립에 어려움을 겪고 있다.특히, 우리나라는 현재 지하수오염 취약성에 영향을 미치는 인자들에 대한 전문가들 사이의 이견으로 인해서 정 <7>책기반에 활용할 수 있는 지하수오염 취약성을 산정할 수 있는 전문기술력이 부재한 실정이다. 따라서, 지하수오염 취약성을 결정하는 환경 인자들에 대한 관련 국내 전문가들 간의 개념적 정립의 필요할 뿐 <8>만 아니라, 지하수 오염 취약성 결정하는 인자들의 등급화 과정, 인자들 간의 통계적 유의성 평가, 결정 인자들간의 가중치 선정, 현장자료를 이용한 모형의 검증방법 등이 국가별로, 또는 연구자별로 현격한 차이가 있으므- 3 -공개특허 10-2009-0093174로, 표준화된 평가방법의 개발이 절실히 요구되고 있다.전 세계적으로 지하수 오염취약성 지표를 산정하는 방법으로서 DRASTIC 모형을 주로 활용하고 있으며, GIS기반 <9>으로 해서 지리정보와 함께 분석하는 기술들이 잘 알려져 있다. 이러한 GIS기반의 DRASTIC 모형을 이용한 기술을 이용해서 지하수 오염관리 정책에 활용하고자 하는 방안에 대한 연구들이 미국, 일본, 프랑스, 그리스, 헝가리 등 다양한 국외 연구진들과 국내 연구진들 의해서 제시되고 있고, 현장자료를 기반으로 한 검증평가 연구들이 많이 발표되고 있다.DRASTIC 모형은, 7가지 인자들(지하수면의 깊이, 순수 충진량, 대수층 매질, 토양 매질, 지형 경사율, 비포화대 <10>매질, 대수층의 수리 전도도)과 각 인자들 간의 가중치를 입력변수로 하여, Y=aX1+bX2+cX3+...... 과 같은 선형다변수방정식 형태의 모형을 이용하여 지하수 오염 취약성을 산출하는 방식으로서, 이 7가지 인자들의 등급화과정, 인자 간 통계적 유의성 평가, 인자가 가중치 선정방법, 모형의 검증방법 등이 국가별로, 연구자별로 차이가 있어 평가결과에 대한 객관성 및 신뢰성이 낮은 문제점이 있다.이렇듯 DRASTIC 모형기반의 평가방법이 표준화되지 않은 이유로는 각 지질지형별 특성이 다양하다는 점도 있지 <11>만, 지질지형별로 표준화를 지하수오염취약성 산정의 전과정을 대상으로 한 시도가 없었기 때문이라고 해석되고있다.DRASTIC모형은 다음과 같은 단순화된 가정들에 기초하여 평가하는 방법이다. <12>(1)오염원은 지표에 위치함 <13>(2)오염물질의 지하유입은 강수량에 의존함 <14>(3)오염물질은 물과 같은 유동성을 가짐 <15>(4)평가지역은 0.4 km2 이상이어야 함 <16>상기 가정들 중에서 (1)번, (2)번과 (3)번은 상당히 단순화된 가정이며, 오염원은 지표가 아닌 지중에도 존재하 <17>며, 오염물질 중 중력에 의해서 침투하는 물질들도 있으며, 유해유기물질들 중에서는 물과 같은 유동성을 갖지않은 경우들도 많지만, 이러한 인자들이 제대로 반영되지 못하는 문제점이 있다.상기와 같은 가정들의 단순화를 극복하기 위해 제안된 평가방법으로는, 예로서 MODFLOW나 MODPATH와 같은 지하 <18>수 거동모형들이 있다. 이들 평가방법은 상기의 단순화된 가정을 보완하기 위해 제안된 평가방법이나, DRASTIC모형과 같이 지하수 오염취약성 산정기술에 체계적으로 접목되지 못하고 있는 실정이다.지하수오염 취약성은 해당 지하수 지역의 수문, 지질, 지형적 특성을 총체적으로 나타내는 개념적 지표로서, 직 <19>접적으로 측정장치에 의해 측정할 수 있는 지표가 아니다.이러한 DRASTIC모형의 한계를 극복하고자 최근 들어서 미국과 유럽의 연구자들이 다양한 다변수통계기법이나 모 <20>형에 대한 선험지식이 필요 없는 인공지능 기법들의 활용이 제안되기 시작하였음또한, 기존의 지하수오염 취약성 산정 모형인 DRASTIC모델은, 수문지질지형과 오염원 특성에 대한 단순한 가정 <21>에 기초하고 있으므로, 실질 현장에서 볼 수 있는 다양한 오염물질과 오염원 특성에 따른 지하수 오염물질 거동을 반영하는 지하수 오염 취약성 산정방법의 개발이 절실히 요구되고 있다. 특히, DRASTIC 모델은 실제 지하수 오염취약성을 단순한 선형 알고리즘만을 사용함으로써 산출하기 때문에 왜곡 <22>(bias)이 발생되는 문제를 내포하고 있다. 실제로 거의 대다수의 자연현상계는 비선형방정식으로 해석되고 있음에도 불구하고, 선형방정식으로 이러한 자연현상을 해석하는 경우에는 많은 오차와 왜곡이 발생될 수밖에 없는한계가 있다. 발명의 내용 해결 하고자하는 과제본 발명은 상기와 같은 문제점을 감안하여 창안된 발명으로서, 다변수 통계기법과 통제된(supervised) 인공지능 <23>기법(의사결정나무기법과 인공신경망기법)을 결합한 앙상블적 접근방식을 적용함으로써 보다 정확성 있는 지하수 오염취약성을 예측할 수 있는 방법 및 그 시스템을 제안하는 것을 목적으로 한다.- 4 -공개특허 10-2009-0093174 과제 해결수단상기한 목적을 달성하기 위하여, 본 발명에 의한 지하수 오염취약성 평가방법은, <24>지하수 오염에 영향을 미치는 인자들 각각의 값(data)들에 대하여 연관분석(association analysis), 챠트분석 <25>(chart analysis), 상관계수분석(correlation analysis), 군집분석(clustering analysis), 요인분석(factoranalysis)을 수행함으로써 수집된 데이터들을 표준화 변환하고 추출하는 데이터 표준화 단계와,상기 표준화된 데이터들에 대하여 t-test, chi-square test를 이용하여 변수의 유의성을 검정함으로써 무의미한 <26>변수를 제외하고 의미있는 입력변수를 선택하는 입력변수 선택단계를 포함하는 제1단계;상기 제1단계에 의해 추출된 데이터를 이용하여 로지스틱 회귀분석을 실시하는 회귀분석단계와, 상기 제1단계에 <27>의해 추출된 데이터를 이용하여 의사결정나무기법을 적용하는 의사결정나무기법 적용단계와, 상기 제1단계에 의해 추출된 데이터를 이용하여 인공신경망기법을 적용하는 인공신경망기법 적용단계로 구성되는 제2단계와; 상기 제2단계에서 적용된 개별 기법들을 앗앙블 방법론(Ensemble Method)으로써 통합하고, 각각의 변수들을 평 <28>가기준에 의해 범주화하는 통합화단계로 구성되는 것을 특징으로 한다. 효 과오염된 현장자료를 통해서 실질적으로 오염에 취약한 지역과 그렇지 않은 경우를 학습한 알고리즘, 즉 다변수통 <29>계기법과 통제된(supervised) 인공지능기법을 결합한 앙상블 알고리즘 개발을 통하여 지하수 오염취약성 예측력을 향상하는 것이 가능하다.또한, 지하수 오염취약성을 파악한 후에는 지하수 오염유해성(Risk)을 결정하는 주요 수문지질지형특성과 오염 <30>원특성 인자들을 도출하고 인과관계에 관한 가설적 모형을 도출할 수 있으므로, 예측 신뢰성이 향상될 수 있다. 발명의 실시를 위한 구체적인 내용본 발명에 있어서, 지하수 오염 취약성 평가를 위한 시스템을 구축하기 위해서는, 먼저 지하수 오염방지를 위한 <31>토양/지하수 정보 활용을 위한 관계형 데이터베이스(이하 'GDB(Groundwater Database)'라고 함)가 설계되어야한다.GDB설계를 위해, 국립환경관리공단 등 현재 공공기관에서 관리하고 있는 토양/지하수 속성 DB를 확인하여 리스 <32>트를 작성하고, 관련 테이블의 속성정보를 파악하고 등급화를 위한 GDB테이블을 설계하되, 주제별 토양/지하수지도의 내용을 검토하고 오염등급도를 생성할 수 있도록 레이어(Layer)를 설계하여야 한다.지하수 오염방지를 위한 토양/지하수 정보 활용을 위한 GDB 구축과정은 다음과 같다. <33>먼저, 정보에 대한 요구분석과정으로서, 새로운 수질오염방지 정보관리 시스템이 어떠한 용도로 사용될 것인지, <34>사용자가 원하는 정보가 무엇인지 등을 분석하여야 한다. 이 과정에는 데이터베이스의 미래 확장성이 함께 고려되면 더욱 바람직하다.다음으로, 토양/지하수 데이터의 개념적 스키마를 개발하는 단계이다. 여기서, 개념적 스키마란, DB 전체에 모 <35>든 데이터 요소들과 이것들과의 관계들을 보여주는 논리적 기술로서, 각각의 속성들을 명확히 정의하고 토양/지하수 관련 개체인자와 연관성을 구성하게 된다. 물론, 각 사용자들은 토양/지하수 관련 변수들에 대해 각기 다른 관점(view)을 가지고 있을 수 있으므로, 다수의 관점(view)을 하나의 개념적 스키마(Schema)로 통합하는 과정이 필요할 것이다.다음 단계는 관계성(Relationship) 및 정규화(Normalization) 작업단계로서, 스키마와 관련된 관점(view)이 작 <36>성되면 개체 테이블들은 속성들과 함께 정의되며, 시스템 테이블의 관계성을 가시화하기 위해 개체관계도(Entity-Relationship Diagram)를 작성하게 되는데, 새로운 샘플이 들어오면 속성을 파악하여 효율적인 데이터구조를 생성하는 정규화 작업을 수행하게 되며, 이러한 정규화된 속성을 가지고 개체관계 인식하게 된다.다음 단계는 설계 검토 프로세스(feedback)단계로서, 필요한 정보가 포함되어 있고 사용가능한지 확인하기 위한 <37>검토과정을 의미한다. 데이터베이스의 미래 확장을 위한 작업도 본 작업에 포함된다.이하에서는 상기 과정에 의해 구축된 GDB를 기반으로 하여, 로지스틱 회귀분석, 인공신경망, 의사결정나무 등의 <38>데이터마이닝기법을 앙상블 방법론(Ensemble mothod)을 이용하여 지하수 오염취약성을 평가하는 방법에 관하여- 5 -공개특허 10-2009-0093174설명한다.본 발명에 의한 지하수 오염 취약성 평가방법은 크게, 탐색적 데이터 분석(Exploratory data analysis)단계와, <39>각 방법론 적용단계와, 통합방법론 적용단계로 이루어지는데, 이하에서는 각 단계에 관하여 상세하게 설명한다.1. 제1단계 : 탐색적 데이터 분석(Exploratory data analysis)단계 <40>제1단계는 지하수 오염에 영향을 미치는 데이터의 표준화 변환 및 추출단계로서, 연관분석(association <41>analysis), 챠트분석(chart analysis), 상관계수분석(correlation analysis), 군집분석(clustering analysis),요인분석(factor analysis) 실시하며, 입력변수의 선택은 t-test, chi-square test를 이용하여 변수의 유의성검정을 거쳐 선택한다. Stepwise, forward, backward 회귀분석 방법 사용될 수 있다.2. 제2단계: 개별방법론 적용단계 <42>제2단계는 개별적인 방법론을 적용하는 단계로서, 상기 제1단계에서 추출한 데이터를 이용하여 로지스틱 회귀분 <43>석, 인공신경망, 의사결정나무 각각의 지하수 오염취약성 모델을 구축한다.각 방법론을 검증하기 위한 기준을 설정하기 위해 정분류율(Hit ratio)을 사용하는 것이 바람직하다. <44>이하에서는 로지스틱 회귀분석기법, 인공신경망기법, 의사결정나무기법에 대하여 간략히 설명한다. <45><로지스틱 회귀분석> <46>분류를 하는데 있어서, 가장 흔한 경우는 이분법을 기준으로 분류하는 것인데, 예를 들어 해당지역의 지하수가 <47>오염되었는가?(0) 정상상태인가?(1)로 분류할 수 있다. 그러나 이항 확률을 가진 종속변수를 통계적으로 설명하고자 할 때, 일반적인 회귀분석은 적용하기에 어려움이 <48>있다. 일반적인 회귀분석에서는 종속변수를 연속 변수의 형태로 가정하는데 반해, 이항 분류 문제에서는 종속변수가 이항변수이므로 오차의 분포가 정규분포를 따른다는 회귀분석의 일반적인 가정에 위배되기 때문이다. 또한일반적인 회귀분석을 사용할 경우에는 예상 값이 0과 1사이에만 국한되지 않는다는 문제점 역시 발생할 수있다.이에 반해, 로지스틱 회귀분석은 값이 연속적인 값을 갖더라도 로지스틱 함수의 결과 값은 마치 정규분포의 누 <49>적확률분포와 유사하게 0과 1사이의 값을 갖도록 설계되어 있기 때문에 이분법적인 분류문제를 해결하는 모형으로 적합하다.이분법적 분류문제가 아닌 경우는 두 개의 변수들을 동시에 독립변수로 고려한 다항(multinominal) 로지스틱 회 <50>귀분석을 사용함으로써 문제 해결이 가능하므로 등급을 나누는 경우에 특히 적합한 통계적 모형이다.어떤 사건이 일어날 확률에 1값을, 일어나지 않을 확률에 0값을 준 종속변수를 사용한다고 하면 다음 수학식 1 <51>이 성립한다.수학식 1<52>이 때, Z는 다음과 같은 수학식 2가 성립된다. <53>수학식 2<54>여기서, X1,X2,......Xp는 입력변수를 나타내며, 수학적으로 Logit함수는 0에서 1 사이의 값을 가질 수밖에 없 <55>다. 도 3은 이러한 Logit함수를 그래프로 도시한 것이다.<인공신경망기법> <56>인공신경망기법은 인간 두뇌의 신경세포를 모델링 하여 지능을 구현하고자 하는 기법으로서, 신경망은 병행적으 <57>- 6 -공개특허 10-2009-0093174로 상호작용하는 여러 개의 계산요소들로 이루어져 있으며, 신경망의 계산능력은 다량의 계산요소들이 병행적으로 계산을 수행함으로써 얻어진다.신경망은 학습 데이터를 통하여 가중치를 학습하고, 그 데이터에 대한 특성을 일반화시킴으로써 학습 기능을 수 <58>행한다. 인공신경망기법은 입력층(Input layer)의 각 노드(node)에 입력 패턴을 주면, 이 신호는 각 노드에서 변환되어 <59>은닉층(hidden layer)에 전달되고 최후에 출력층(output layer)에서 신호를 출력하게 되는데, 이 출력값과 기대값을 비교하여 차이를 줄여나가는 방향으로 가중치를 조절한다.인공 신경망은, 학습이 끝난 후 모형구축에 사용되지 않는 데이터에 대해서 학습에 의해 형성된 가중치에 따라 <60>예측 값을 산출할 수 있는 특징이 있으며, 계량적인 분석 이외에도 문자인식, 신호처리 등에도 이용될 수 있는유연성(Flexibility)을 갖고 있으며, 또한, 환경 데이터와 같이 비선형적이고 잡음(noise)이 많은 영역에서도적합한 모형을 구축할 수 있어서 비선형 분석모형의 구축 가능하다는 특징이 있다.도 4는 인공신경망기법의 개념을 설명하는 설명도이다. <61><의사결정나무기법> <62>의사결정나무기법은 분류 또는 예측을 목적으로 하는 어떤 경우에도 사용될 수 있는 기법으로, 분석의 정확도보 <63>다는 귀납적 추론으로서의 설명이 필요한 경우에 더 유용하게 사용된다. 의사결정나무의 종류에는 분류 기준에따라 CART, CHAID, C4.5 등이 있는데, 엔트로피(Entropy)지수를 이용하여 분류하는 C4.5가 가장 널리 쓰이고 있다.의사결정나무기법은 입출력간의 관계를 나무 구조 모형으로 계층화하여, 특정 출력에 대한 원인을 쉽게 파악하 <64>는데 주로 이용되고 있다. 도 5는 의사결정나무기법을 설명하는 설명도이다.의사결정나무기법은 분류(Classification, Stratification) 및 세분화(Segmentation)가 가능한 모델로서, 관측 <65>개체를 여러 예측 변수들에 근거하여 목표 변수의 범주를 몇 개의 등급으로 분류하고자 하는 경우, 데이터를 비슷한 특성을 갖는 몇 개의 그룹으로 분할하여 각 그룹별 특성을 발견하는 경우 또는 각 고객이 어떤 집단에 속하는지를 파악하고자 하는 경우에 특히 유용한 모델이다.또한, 의사결정나무기법은 데이터들로부터 규칙을 찾아내고 이를 이용하여 미래의 사건을 예측하고자 하는 경우 <66>에도 주로 활용되며, 매우 많은 수의 예측 변수 중에서 목표 변수에 큰 영향을 미치는 변수들을 골라내고자 하는 경우, 여러 개의 예측 변수들이 결합하여 목표 변수에 작용하는 규칙(교호작용효과)를 파악하고자 하는경우, 범주형 목표 변수의 범주를 소수의 몇 개로 병합하거나 연속형 목표 변수를 몇 개의 등급으로 이산화하고자 하는 경우에도 많이 활용되고 있다.3. 제3단계: 통합방법론 적용단계 <67>상기 제2단계에서 설정된 개별 모델들을 앙상블 방법론(Ensemble method)으로 통합하는 단계로서, 본 발명의 가 <68>장 핵심적인 과정에 해당한다. 이 단계는 구축된 통합모델을 통하여 각각의 변수들은 5단계 평가기준에 의해 범주화하는 것을 포함할 수도 있으며, Feedback을 통한 지속적인 업데이트 과정은 시스템의 자기 진화를 가능하게한다.상기 제3단계는 본 발명에서의 가장 핵심적인 과정으로서, 앙상블 방법론(Ensemble method)이라고 표현하기로 <69>한다. 본 발명에서의 앙상블 방법론(Ensemble method)은, 하나의 분류기(classifier)가 사용된 샘플자료에 따라결과가 다르게 나올 수 있다는 점을 감안하여, 하나의 데이터로부터 Bootstrap resampling 방법에 의해 여러 번추출된 자료를 바탕으로 추정된 분류 결과를 simple majority voting이나, weighted voting에 의하여 최선의결과를 도출해 내는 방법이다.도 6은 본 발명에 의한 앙상블 방법론(Ensemble Method)으로서 분류기 조합을 설명하는 설명도이며, 도 7은 앙 <70>상블 방법론에 있어서 훈련데이터 조합을 설명하는 설명도이다.Ensemble의 대표적인 알고리즘에는 Breiman이 제안한 Bagging(Bootstrap Aggregation) 기법과 <71>Arching(Adaptive Resample and combining)이 사용되고 있다. 각 Bagging, arcing 분석용(training) 자료에서재표본(Resampling) 기법으로 얻어진 데이터에 의해 각 분류기가 형성된다는 점에서 공통점을 가지고 있지만,Bagging은 관측 값이 동일한 가중치를 갖는 분포에서 표본을 추출하는 반면, Arcing은 관측값의 가증치가 변하는 분포에서 표본을 추출한다는 점에서 차이점을 가지고 있다.- 7 -공개특허 10-2009-0093174즉, Bagging(Bootstrap Aggregation)기법은, 하나의 데이터셋(data set)으로부터 Bootstrap resample을 K개 만 <72>들어 각각의 데이터셋에 분류기를 적용하여 K개의 분류기를 학습시키며, 그 결과를 Voting method를 통해 최종적인 하나의 분류결과를 얻어내는 방법으로, 결과 값의 분산을 줄여 분류 예측률을 높여주는 방법이다.Bagging기법은 여러 단일 분류기를 통합하는 방법은 목표변수가 연속형일 때와 범주형일 때 다르게 적용되는데, <73>연속형일 경우 평균을 사용하며, 범주형일 결우 다중 투표(Majority vote) 방법을 사용한다. 예를 들어, 입력변수 X와 종속변수 Y로 구성된 데이터에 K번째의 Bootstrap resample을 실시하였고, 분류기 의 <74>범주가 class 1(=비오염), class 2(=오염)라 하면, 새로운 데이터가 들어왔을 경우 아래 수학식 3을 이용하여해당 데이터의 최종 분류 값이 선정되는 것이다.수학식 3<75>Bagging 기법의 자세한 진행순서는 다음과 같다. <76><Step 1> <77>C(x,t)를 입력 값 t에서 출력 값을 k-vector로 가지는 분류기라고 가정 <78>여기서 x=(x1,x2,.....xN)으로 분석용 자료이고, xi=(ti,yi)를 가리키며, ti는 입력 값, yi는 출력값이다.(k- <79>vector는 하나의 성분만 1의 값을 가지고 나머지 k-1개는 0의 값을 가짐)<step2> <80>동일한 확률을 가지고 복원 추출을 통해서 크기가 N인 bootstrap sample x*1, x*2,....x*B를 생성하여, 원래의 데 <81>이터 집합을 대체하여 각각 학습시킨다.<step3> <82>임의의 관찰치 분류결과는 다음 수학식 2와 같이 정의되는 분류기에 의해서 가장 큰 선택결과를 가지는 그룹으 <83>로 분류한다. 즉, 하기 수학식 4를 통해 가장 많이 선택되는 그룹으로 해당 데이터를 분류한다.수학식 4<84>Arcing(Adaptive Resampling and Combining)기법은, 학습자료로부터 K개의 Bootstrap resample을 추출한 뒤, <85>이를 이용한 분류기를 생성하고, 그 결과를 다음번 Bootstrap Resample을 추출하는데 적용하는 방법으로 진행된다. 즉, 분류기의 성능에 따라 Weighted voting 실시하며, 이전 Bootstrap sample에서 오분류된 관찰치는 가중치를 <86>높게 주어서, 다음 bootstrap sample시에 선택되도록 하는 확률을 높여 줌으로써 이전에 오분류된 관찰치를 정분류할 가능성이 높은 분류기 생성하도록 하는 기법으로서, 일반적으로 Arcing은 많은 선행연구에서 Bagging보다 더 좋은 분류결과를 보인다.Arcing 기법의 자세한 진행순서는 다음과 같다. <87><step1> <88>Training 데이터의 있는 N개의 값측치에서 각 관측치가 추출될 확률을 P(i)=1/N으로 같은 값을 적용하여 <89>Bootstrap resample을 실시(i=1,2,...,N)한다.<step2> <90>- 8 -공개특허 10-2009-0093174N개의 관측치를 가지는 k번째 Bootstrap resample로 학습된 분류기 Ck(X)를 형성(X=입력변수)한다. <91><step3> <92>i번째 경우에 대해 분류기 Ck(X)를 이용하여 분류한 결과가 오분류되었을 경우, 1의 값을, 정분류 되었을 경우 <93>0의 값을 갖는 더미변수 d(i)를 정의한다.<step4> <94>분류기 Ck(X)의 오분류율 εk와 P(i)를 갱신하는데 필요한 값 βk를 아래와 같은 수학식 5에 근거하여 계산한다. <95>수학식 5<96>만일, k번째 스텝(step)의 오분류율 εk가 0이거나 1/2보다 크면, P(i)=1/N이며, 스텝(step) 1에서 시작한다. <97><step5> <98>값 βk를 바탕으로 k+1번째 bootstrap resample에서 관측치 I가 샘플링될 확률을 다음 수학식 6과 같이 계산한 <99>다.수학식 6<100><step6> <101>이와 같은 과정을 K번 반복한 후, 각 분류기의 분류결과에 log(βk)의 가중치를 주어 가중 평균한 값을 취하게 <102>된다. 산업이용 가능성기술적 측면에서 개선된 본 발명에 의한 지하수 오염취약성 평가방법 및 그 시스템은 한국의 특수성을 고려한 <103>한국형 평가방법 및 시스템이라 할 수 있다. 기존의 외국 평가방법 및 시스템에 비해 국내 지하수 환경에 대한실증 연구를 바탕으로 모델의 현장 적용성을 향상시킬 것이다. 또한 본 발명에서 제안된 방법은 다양한 다변량통계기법, 인공지능 방법론을 통합적으로 사용함으로써 향상된 예측력을 바탕으로, 체계적이고 예측가능한 지하수 자원 관리를 가능하게 할 것으로 기대된다.도면의 간단한 설명도 1은 본 발명에 의한 지하수 오염취약성 평가시스템의 데이터베이스 구축과정 설명도 <104>도 2는 본 발명에 의한 지하수 오염취약성 평가방법 설명도 <105>도 3은 로지스틱 회귀분석을 설명하기 위한 그래프 <106>도 4는 인공신경망기법 설명도 <107>도 5는 의사결정나무기법 설명도 <108>도 6은 본 발명에 의한 앙상블 방법론(Ensemble Method)을 설명하는 설명도 <109>도 7은 앙상블 방법론에 있어서 각 분류기에 의한 결과값을 조합하는 과정을 설명하는 설명도 <110>- 9 -공개특허 10-2009-0093174도면 도면1 도면2- 10 -공개특허 10-2009-0093174 도면3 도면4- 11 -공개특허 10-2009-0093174 도면5 도면6- 12 -공개특허 10-2009-0093174 도면7- 13 -공개특허 10-2009-0093174"}
{"patent_id": "10-2008-0018545", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 지하수 오염취약성(지하수와 관련된 기후, 지질학적 특성 및 토양적 특성 등을 근거으로 하여 표토층 이 오염되었을 때 빗물침투에 의해 지하수가 오염될 가능성이 어느 정도인지를 평가하는 지표)을 평가하는 방법 및 그 시스템에 관한 것으로서, 지하수 오염에 영향을 미치는 데이터를 변환, 추출하여 로지스틱 회귀분석기법, 인공신경망기법, 의사결정나무기법 등 개별적인 평가방법에 의해 평가한 후에 각 평가결과를 통합하여 최종적으 로 등급을 평가하는 방법을 제안한다. 오염된 현장자료를 통해서 실질적으로 오염에 취약한 지역과 그렇지 않은 경우를 학습한 알고리즘, 즉 다변수통 계기법과 통제된(supervised) 인공지능기법을 결합한 앙상블 알고리즘 개발을 통하여 지하수 오염취약성 예측력 을 향상하는 것이 가능하다."}
{"patent_id": "10-2008-0018545", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지하수 오염취약성을 평가하기 위한 방법 및 그 시스템에 관한 것이다. <1> 여기서, 지하수오염 취약성이란, 지하수와 관련된 기후, 지질학적 특성 및 토양적 특성 등을 근거으로 하여 표 <2> 토층이 오염되었을 때 빗물침투에 의해 지하수가 오염될 가능성이 어느 정도인지를 평가하는 지표로서, 해당 지 하수 지역의 수문, 지질, 지형적 특성을 총체적으로 나타내는 개념적 지표이므로, 직접적으로 측정장치에 의해 측정할 수 있는 지표가 아니다. 본 발명은, 지하수 오염에 영향을 미치는 데이터를 변환, 추출하여 로지스틱 회귀분석기법, 인공신경망기법, 의 <3> 사결정나무기법 등 개별적인 평가방법에 의해 평가한 후에 각 평가결과를 통합하여 최종적으로 등급을 평가하는 방법 및 그 시스템을 제안한다."}
{"patent_id": "10-2008-0018545", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "세계적으로 수질오염문제의 중요성이 부각되면서 정부, 기업, 학계 및 일반국민들의 수질오염과 관련한 각종 분 <4> 석방법에 대한 수요가 급증하고 있다. 수질오염 중에서 특히 지하수 오염은 눈에 보이지 않기 때문에, 하천이나 바다 등의 오염보다 그 폐해에 대한 <5> 논의가 많이 부족한 실정이다. 그러나, 지하수는 지표에 있는 지표수보다 그 흐름이 느려 1년에 1~5km 정도 이 동하는 것이 보통이기 때문에 일단 오염이 되면 오랫동안 그 지역을 포함한 인근 지역에 영향을 주게 된다. 지하수법 제18조 및 제19조에 따르면, 환경부장관은 전국의 지하수에 대한 수질오염실태를 측정하여 건설부장관 <6> 에게 보고하도록 하고 있으며, 환경부령으로 수질기준을 정하도록 하고 있다. 그러나, 각 지역마다 지하수의 오 염 취약성이 어느 정도인지를 정확히 평가할 수 있는 방법 및 그 시스템이 알려져 있지 않아, 일선 행정 업무나 각 지방자치단체의 지하수 보전 대책 수립에 어려움을 겪고 있다. 특히, 우리나라는 현재 지하수오염 취약성에 영향을 미치는 인자들에 대한 전문가들 사이의 이견으로 인해서 정 <7> 책기반에 활용할 수 있는 지하수오염 취약성을 산정할 수 있는 전문기술력이 부재한 실정이다. 따라서, 지하수오염 취약성을 결정하는 환경 인자들에 대한 관련 국내 전문가들 간의 개념적 정립의 필요할 뿐 <8> 만 아니라, 지하수 오염 취약성 결정하는 인자들의 등급화 과정, 인자들 간의 통계적 유의성 평가, 결정 인자들 간의 가중치 선정, 현장자료를 이용한 모형의 검증방법 등이 국가별로, 또는 연구자별로 현격한 차이가 있으므 - 3 -공개특허 10-2009-0093174로, 표준화된 평가방법의 개발이 절실히 요구되고 있다. 전 세계적으로 지하수 오염취약성 지표를 산정하는 방법으로서 DRASTIC 모형을 주로 활용하고 있으며, GIS기반 <9> 으로 해서 지리정보와 함께 분석하는 기술들이 잘 알려져 있다. 이러한 GIS기반의 DRASTIC 모형을 이용한 기술 을 이용해서 지하수 오염관리 정책에 활용하고자 하는 방안에 대한 연구들이 미국, 일본, 프랑스, 그리스, 헝가 리 등 다양한 국외 연구진들과 국내 연구진들 의해서 제시되고 있고, 현장자료를 기반으로 한 검증평가 연구들 이 많이 발표되고 있다. DRASTIC 모형은, 7가지 인자들(지하수면의 깊이, 순수 충진량, 대수층 매질, 토양 매질, 지형 경사율, 비포화대 <10> 매질, 대수층의 수리 전도도)과 각 인자들 간의 가중치를 입력변수로 하여, Y=aX1+bX2+cX3+...... 과 같은 선형 다변수방정식 형태의 모형을 이용하여 지하수 오염 취약성을 산출하는 방식으로서, 이 7가지 인자들의 등급화 과정, 인자 간 통계적 유의성 평가, 인자가 가중치 선정방법, 모형의 검증방법 등이 국가별로, 연구자별로 차이 가 있어 평가결과에 대한 객관성 및 신뢰성이 낮은 문제점이 있다. 이렇듯 DRASTIC 모형기반의 평가방법이 표준화되지 않은 이유로는 각 지질지형별 특성이 다양하다는 점도 있지 <11> 만, 지질지형별로 표준화를 지하수오염취약성 산정의 전과정을 대상으로 한 시도가 없었기 때문이라고 해석되고 있다. DRASTIC모형은 다음과 같은 단순화된 가정들에 기초하여 평가하는 방법이다. <12> 오염원은 지표에 위치함 <13> 오염물질의 지하유입은 강수량에 의존함 <14> 오염물질은 물과 같은 유동성을 가짐 <15> 평가지역은 0.4 km2 이상이어야 함 <16> 상기 가정들 중에서 번, 번과 번은 상당히 단순화된 가정이며, 오염원은 지표가 아닌 지중에도 존재하 <17> 며, 오염물질 중 중력에 의해서 침투하는 물질들도 있으며, 유해유기물질들 중에서는 물과 같은 유동성을 갖지 않은 경우들도 많지만, 이러한 인자들이 제대로 반영되지 못하는 문제점이 있다. 상기와 같은 가정들의 단순화를 극복하기 위해 제안된 평가방법으로는, 예로서 MODFLOW나 MODPATH와 같은 지하 <18> 수 거동모형들이 있다. 이들 평가방법은 상기의 단순화된 가정을 보완하기 위해 제안된 평가방법이나, DRASTIC 모형과 같이 지하수 오염취약성 산정기술에 체계적으로 접목되지 못하고 있는 실정이다. 지하수오염 취약성은 해당 지하수 지역의 수문, 지질, 지형적 특성을 총체적으로 나타내는 개념적 지표로서, 직 <19> 접적으로 측정장치에 의해 측정할 수 있는 지표가 아니다. 이러한 DRASTIC모형의 한계를 극복하고자 최근 들어서 미국과 유럽의 연구자들이 다양한 다변수통계기법이나 모 <20> 형에 대한 선험지식이 필요 없는 인공지능 기법들의 활용이 제안되기 시작하였음 또한, 기존의 지하수오염 취약성 산정 모형인 DRASTIC모델은, 수문지질지형과 오염원 특성에 대한 단순한 가정 <21> 에 기초하고 있으므로, 실질 현장에서 볼 수 있는 다양한 오염물질과 오염원 특성에 따른 지하수 오염물질 거동 을 반영하는 지하수 오염 취약성 산정방법의 개발이 절실히 요구되고 있다. 특히, DRASTIC 모델은 실제 지하수 오염취약성을 단순한 선형 알고리즘만을 사용함으로써 산출하기 때문에 왜곡 <22> (bias)이 발생되는 문제를 내포하고 있다. 실제로 거의 대다수의 자연현상계는 비선형방정식으로 해석되고 있음 에도 불구하고, 선형방정식으로 이러한 자연현상을 해석하는 경우에는 많은 오차와 왜곡이 발생될 수밖에 없는 한계가 있다."}
{"patent_id": "10-2008-0018545", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용 해결 하고자하는 과제 본 발명은 상기와 같은 문제점을 감안하여 창안된 발명으로서, 다변수 통계기법과 통제된(supervised) 인공지능 <23> 기법(의사결정나무기법과 인공신경망기법)을 결합한 앙상블적 접근방식을 적용함으로써 보다 정확성 있는 지하 수 오염취약성을 예측할 수 있는 방법 및 그 시스템을 제안하는 것을 목적으로 한다. - 4 -공개특허 10-2009-0093174 과제 해결수단 상기한 목적을 달성하기 위하여, 본 발명에 의한 지하수 오염취약성 평가방법은, <24> 지하수 오염에 영향을 미치는 인자들 각각의 값(data)들에 대하여 연관분석(association analysis), 챠트분석 <25> (chart analysis), 상관계수분석(correlation analysis), 군집분석(clustering analysis), 요인분석(factor analysis)을 수행함으로써 수집된 데이터들을 표준화 변환하고 추출하는 데이터 표준화 단계와, 상기 표준화된 데이터들에 대하여 t-test, chi-square test를 이용하여 변수의 유의성을 검정함으로써 무의미한 <26> 변수를 제외하고 의미있는 입력변수를 선택하는 입력변수 선택단계를 포함하는 제1단계; 상기 제1단계에 의해 추출된 데이터를 이용하여 로지스틱 회귀분석을 실시하는 회귀분석단계와, 상기 제1단계에 <27> 의해 추출된 데이터를 이용하여 의사결정나무기법을 적용하는 의사결정나무기법 적용단계와, 상기 제1단계에 의 해 추출된 데이터를 이용하여 인공신경망기법을 적용하는 인공신경망기법 적용단계로 구성되는 제2단계와; 상기 제2단계에서 적용된 개별 기법들을 앗앙블 방법론(Ensemble Method)으로써 통합하고, 각각의 변수들을 평 <28> 가기준에 의해 범주화하는 통합화단계로 구성되는 것을 특징으로 한다. 효 과 오염된 현장자료를 통해서 실질적으로 오염에 취약한 지역과 그렇지 않은 경우를 학습한 알고리즘, 즉 다변수통 <29> 계기법과 통제된(supervised) 인공지능기법을 결합한 앙상블 알고리즘 개발을 통하여 지하수 오염취약성 예측력 을 향상하는 것이 가능하다. 또한, 지하수 오염취약성을 파악한 후에는 지하수 오염유해성(Risk)을 결정하는 주요 수문지질지형특성과 오염 <30> 원특성 인자들을 도출하고 인과관계에 관한 가설적 모형을 도출할 수 있으므로, 예측 신뢰성이 향상될 수 있다. 발명의 실시를 위한 구체적인 내용 본 발명에 있어서, 지하수 오염 취약성 평가를 위한 시스템을 구축하기 위해서는, 먼저 지하수 오염방지를 위한 <31> 토양/지하수 정보 활용을 위한 관계형 데이터베이스(이하 'GDB(Groundwater Database)'라고 함)가 설계되어야 한다. GDB설계를 위해, 국립환경관리공단 등 현재 공공기관에서 관리하고 있는 토양/지하수 속성 DB를 확인하여 리스 <32> 트를 작성하고, 관련 테이블의 속성정보를 파악하고 등급화를 위한 GDB테이블을 설계하되, 주제별 토양/지하수 지도의 내용을 검토하고 오염등급도를 생성할 수 있도록 레이어(Layer)를 설계하여야 한다. 지하수 오염방지를 위한 토양/지하수 정보 활용을 위한 GDB 구축과정은 다음과 같다. <33> 먼저, 정보에 대한 요구분석과정으로서, 새로운 수질오염방지 정보관리 시스템이 어떠한 용도로 사용될 것인지, <34> 사용자가 원하는 정보가 무엇인지 등을 분석하여야 한다. 이 과정에는 데이터베이스의 미래 확장성이 함께 고려 되면 더욱 바람직하다. 다음으로, 토양/지하수 데이터의 개념적 스키마를 개발하는 단계이다. 여기서, 개념적 스키마란, DB 전체에 모 <35> 든 데이터 요소들과 이것들과의 관계들을 보여주는 논리적 기술로서, 각각의 속성들을 명확히 정의하고 토양/지 하수 관련 개체인자와 연관성을 구성하게 된다. 물론, 각 사용자들은 토양/지하수 관련 변수들에 대해 각기 다 른 관점(view)을 가지고 있을 수 있으므로, 다수의 관점(view)을 하나의 개념적 스키마(Schema)로 통합하는 과 정이 필요할 것이다. 다음 단계는 관계성(Relationship) 및 정규화(Normalization) 작업단계로서, 스키마와 관련된 관점(view)이 작 <36> 성되면 개체 테이블들은 속성들과 함께 정의되며, 시스템 테이블의 관계성을 가시화하기 위해 개체관계도 (Entity-Relationship Diagram)를 작성하게 되는데, 새로운 샘플이 들어오면 속성을 파악하여 효율적인 데이터 구조를 생성하는 정규화 작업을 수행하게 되며, 이러한 정규화된 속성을 가지고 개체관계 인식하게 된다. 다음 단계는 설계 검토 프로세스(feedback)단계로서, 필요한 정보가 포함되어 있고 사용가능한지 확인하기 위한 <37> 검토과정을 의미한다. 데이터베이스의 미래 확장을 위한 작업도 본 작업에 포함된다. 이하에서는 상기 과정에 의해 구축된 GDB를 기반으로 하여, 로지스틱 회귀분석, 인공신경망, 의사결정나무 등의 <38> 데이터마이닝기법을 앙상블 방법론(Ensemble mothod)을 이용하여 지하수 오염취약성을 평가하는 방법에 관하여 - 5 -공개특허 10-2009-0093174설명한다. 본 발명에 의한 지하수 오염 취약성 평가방법은 크게, 탐색적 데이터 분석(Exploratory data analysis)단계와, <39> 각 방법론 적용단계와, 통합방법론 적용단계로 이루어지는데, 이하에서는 각 단계에 관하여 상세하게 설명한다. 1. 제1단계 : 탐색적 데이터 분석(Exploratory data analysis)단계 <40> 제1단계는 지하수 오염에 영향을 미치는 데이터의 표준화 변환 및 추출단계로서, 연관분석(association <41> analysis), 챠트분석(chart analysis), 상관계수분석(correlation analysis), 군집분석(clustering analysis), 요인분석(factor analysis) 실시하며, 입력변수의 선택은 t-test, chi-square test를 이용하여 변수의 유의성 검정을 거쳐 선택한다. Stepwise, forward, backward 회귀분석 방법 사용될 수 있다. 2. 제2단계: 개별방법론 적용단계 <42> 제2단계는 개별적인 방법론을 적용하는 단계로서, 상기 제1단계에서 추출한 데이터를 이용하여 로지스틱 회귀분 <43> 석, 인공신경망, 의사결정나무 각각의 지하수 오염취약성 모델을 구축한다. 각 방법론을 검증하기 위한 기준을 설정하기 위해 정분류율(Hit ratio)을 사용하는 것이 바람직하다. <44> 이하에서는 로지스틱 회귀분석기법, 인공신경망기법, 의사결정나무기법에 대하여 간략히 설명한다. <45> <로지스틱 회귀분석> <46> 분류를 하는데 있어서, 가장 흔한 경우는 이분법을 기준으로 분류하는 것인데, 예를 들어 해당지역의 지하수가 <47> 오염되었는가? 정상상태인가?로 분류할 수 있다. 그러나 이항 확률을 가진 종속변수를 통계적으로 설명하고자 할 때, 일반적인 회귀분석은 적용하기에 어려움이 <48> 있다. 일반적인 회귀분석에서는 종속변수를 연속 변수의 형태로 가정하는데 반해, 이항 분류 문제에서는 종속변 수가 이항변수이므로 오차의 분포가 정규분포를 따른다는 회귀분석의 일반적인 가정에 위배되기 때문이다. 또한 일반적인 회귀분석을 사용할 경우에는 예상 값이 0과 1사이에만 국한되지 않는다는 문제점 역시 발생할 수 있다. 이에 반해, 로지스틱 회귀분석은 값이 연속적인 값을 갖더라도 로지스틱 함수의 결과 값은 마치 정규분포의 누 <49> 적확률분포와 유사하게 0과 1사이의 값을 갖도록 설계되어 있기 때문에 이분법적인 분류문제를 해결하는 모형으 로 적합하다. 이분법적 분류문제가 아닌 경우는 두 개의 변수들을 동시에 독립변수로 고려한 다항(multinominal) 로지스틱 회 <50> 귀분석을 사용함으로써 문제 해결이 가능하므로 등급을 나누는 경우에 특히 적합한 통계적 모형이다. 어떤 사건이 일어날 확률에 1값을, 일어나지 않을 확률에 0값을 준 종속변수를 사용한다고 하면 다음 수학식 1 <51> 이 성립한다. 수학식 1 <52> 이 때, Z는 다음과 같은 수학식 2가 성립된다. <53> 수학식 2 <54> 여기서, X1,X2,......Xp는 입력변수를 나타내며, 수학적으로 Logit함수는 0에서 1 사이의 값을 가질 수밖에 없 <55> 다. 도 3은 이러한 Logit함수를 그래프로 도시한 것이다. <인공신경망기법> <56> 인공신경망기법은 인간 두뇌의 신경세포를 모델링 하여 지능을 구현하고자 하는 기법으로서, 신경망은 병행적으 <57> - 6 -공개특허 10-2009-0093174로 상호작용하는 여러 개의 계산요소들로 이루어져 있으며, 신경망의 계산능력은 다량의 계산요소들이 병행적으 로 계산을 수행함으로써 얻어진다. 신경망은 학습 데이터를 통하여 가중치를 학습하고, 그 데이터에 대한 특성을 일반화시킴으로써 학습 기능을 수 <58> 행한다. 인공신경망기법은 입력층(Input layer)의 각 노드(node)에 입력 패턴을 주면, 이 신호는 각 노드에서 변환되어 <59> 은닉층(hidden layer)에 전달되고 최후에 출력층(output layer)에서 신호를 출력하게 되는데, 이 출력값과 기대 값을 비교하여 차이를 줄여나가는 방향으로 가중치를 조절한다. 인공 신경망은, 학습이 끝난 후 모형구축에 사용되지 않는 데이터에 대해서 학습에 의해 형성된 가중치에 따라 <60> 예측 값을 산출할 수 있는 특징이 있으며, 계량적인 분석 이외에도 문자인식, 신호처리 등에도 이용될 수 있는 유연성(Flexibility)을 갖고 있으며, 또한, 환경 데이터와 같이 비선형적이고 잡음(noise)이 많은 영역에서도 적합한 모형을 구축할 수 있어서 비선형 분석모형의 구축 가능하다는 특징이 있다. 도 4는 인공신경망기법의 개념을 설명하는 설명도이다. <61> <의사결정나무기법> <62> 의사결정나무기법은 분류 또는 예측을 목적으로 하는 어떤 경우에도 사용될 수 있는 기법으로, 분석의 정확도보 <63> 다는 귀납적 추론으로서의 설명이 필요한 경우에 더 유용하게 사용된다. 의사결정나무의 종류에는 분류 기준에 따라 CART, CHAID, C4.5 등이 있는데, 엔트로피(Entropy)지수를 이용하여 분류하는 C4.5가 가장 널리 쓰이고 있 다. 의사결정나무기법은 입출력간의 관계를 나무 구조 모형으로 계층화하여, 특정 출력에 대한 원인을 쉽게 파악하 <64> 는데 주로 이용되고 있다. 도 5는 의사결정나무기법을 설명하는 설명도이다. 의사결정나무기법은 분류(Classification, Stratification) 및 세분화(Segmentation)가 가능한 모델로서, 관측 <65> 개체를 여러 예측 변수들에 근거하여 목표 변수의 범주를 몇 개의 등급으로 분류하고자 하는 경우, 데이터를 비 슷한 특성을 갖는 몇 개의 그룹으로 분할하여 각 그룹별 특성을 발견하는 경우 또는 각 고객이 어떤 집단에 속 하는지를 파악하고자 하는 경우에 특히 유용한 모델이다. 또한, 의사결정나무기법은 데이터들로부터 규칙을 찾아내고 이를 이용하여 미래의 사건을 예측하고자 하는 경우 <66> 에도 주로 활용되며, 매우 많은 수의 예측 변수 중에서 목표 변수에 큰 영향을 미치는 변수들을 골라내고자 하 는 경우, 여러 개의 예측 변수들이 결합하여 목표 변수에 작용하는 규칙(교호작용효과)를 파악하고자 하는 경우, 범주형 목표 변수의 범주를 소수의 몇 개로 병합하거나 연속형 목표 변수를 몇 개의 등급으로 이산화하고 자 하는 경우에도 많이 활용되고 있다. 3. 제3단계: 통합방법론 적용단계 <67> 상기 제2단계에서 설정된 개별 모델들을 앙상블 방법론(Ensemble method)으로 통합하는 단계로서, 본 발명의 가 <68> 장 핵심적인 과정에 해당한다. 이 단계는 구축된 통합모델을 통하여 각각의 변수들은 5단계 평가기준에 의해 범 주화하는 것을 포함할 수도 있으며, Feedback을 통한 지속적인 업데이트 과정은 시스템의 자기 진화를 가능하게 한다. 상기 제3단계는 본 발명에서의 가장 핵심적인 과정으로서, 앙상블 방법론(Ensemble method)이라고 표현하기로 <69> 한다. 본 발명에서의 앙상블 방법론(Ensemble method)은, 하나의 분류기(classifier)가 사용된 샘플자료에 따라 결과가 다르게 나올 수 있다는 점을 감안하여, 하나의 데이터로부터 Bootstrap resampling 방법에 의해 여러 번 추출된 자료를 바탕으로 추정된 분류 결과를 simple majority voting이나, weighted voting에 의하여 최선의 결과를 도출해 내는 방법이다. 도 6은 본 발명에 의한 앙상블 방법론(Ensemble Method)으로서 분류기 조합을 설명하는 설명도이며, 도 7은 앙 <70> 상블 방법론에 있어서 훈련데이터 조합을 설명하는 설명도이다. Ensemble의 대표적인 알고리즘에는 Breiman이 제안한 Bagging(Bootstrap Aggregation) 기법과 <71> Arching(Adaptive Resample and combining)이 사용되고 있다. 각 Bagging, arcing 분석용(training) 자료에서 재표본(Resampling) 기법으로 얻어진 데이터에 의해 각 분류기가 형성된다는 점에서 공통점을 가지고 있지만, Bagging은 관측 값이 동일한 가중치를 갖는 분포에서 표본을 추출하는 반면, Arcing은 관측값의 가증치가 변하 는 분포에서 표본을 추출한다는 점에서 차이점을 가지고 있다. - 7 -공개특허 10-2009-0093174즉, Bagging(Bootstrap Aggregation)기법은, 하나의 데이터셋(data set)으로부터 Bootstrap resample을 K개 만 <72> 들어 각각의 데이터셋에 분류기를 적용하여 K개의 분류기를 학습시키며, 그 결과를 Voting method를 통해 최종 적인 하나의 분류결과를 얻어내는 방법으로, 결과 값의 분산을 줄여 분류 예측률을 높여주는 방법이다. Bagging기법은 여러 단일 분류기를 통합하는 방법은 목표변수가 연속형일 때와 범주형일 때 다르게 적용되는데, <73> 연속형일 경우 평균을 사용하며, 범주형일 결우 다중 투표(Majority vote) 방법을 사용한다. 예를 들어, 입력변수 X와 종속변수 Y로 구성된 데이터에 K번째의 Bootstrap resample을 실시하였고, 분류기 의 <74> 범주가 class 1(=비오염), class 2(=오염)라 하면, 새로운 데이터가 들어왔을 경우 아래 수학식 3을 이용하여 해당 데이터의 최종 분류 값이 선정되는 것이다. 수학식 3 <75> Bagging 기법의 자세한 진행순서는 다음과 같다. <76> <Step 1> <77> C(x,t)를 입력 값 t에서 출력 값을 k-vector로 가지는 분류기라고 가정 <78> 여기서 x=(x1,x2,.....xN)으로 분석용 자료이고, xi=(ti,yi)를 가리키며, ti는 입력 값, yi는 출력값이다.(k- <79> vector는 하나의 성분만 1의 값을 가지고 나머지 k-1개는 0의 값을 가짐) <step2> <80> 동일한 확률을 가지고 복원 추출을 통해서 크기가 N인 bootstrap sample x*1, x*2,....x*B를 생성하여, 원래의 데 <81> 이터 집합을 대체하여 각각 학습시킨다. <step3> <82> 임의의 관찰치 분류결과는 다음 수학식 2와 같이 정의되는 분류기에 의해서 가장 큰 선택결과를 가지는 그룹으 <83> 로 분류한다. 즉, 하기 수학식 4를 통해 가장 많이 선택되는 그룹으로 해당 데이터를 분류한다. 수학식 4 <84> Arcing(Adaptive Resampling and Combining)기법은, 학습자료로부터 K개의 Bootstrap resample을 추출한 뒤, <85> 이를 이용한 분류기를 생성하고, 그 결과를 다음번 Bootstrap Resample을 추출하는데 적용하는 방법으로 진행된 다. 즉, 분류기의 성능에 따라 Weighted voting 실시하며, 이전 Bootstrap sample에서 오분류된 관찰치는 가중치를 <86> 높게 주어서, 다음 bootstrap sample시에 선택되도록 하는 확률을 높여 줌으로써 이전에 오분류된 관찰치를 정 분류할 가능성이 높은 분류기 생성하도록 하는 기법으로서, 일반적으로 Arcing은 많은 선행연구에서 Bagging보 다 더 좋은 분류결과를 보인다. Arcing 기법의 자세한 진행순서는 다음과 같다. <87> <step1> <88> Training 데이터의 있는 N개의 값측치에서 각 관측치가 추출될 확률을 P(i)=1/N으로 같은 값을 적용하여 <89> Bootstrap resample을 실시(i=1,2,...,N)한다. <step2> <90> - 8 -공개특허 10-2009-0093174N개의 관측치를 가지는 k번째 Bootstrap resample로 학습된 분류기 Ck(X)를 형성(X=입력변수)한다. <91> <step3> <92> i번째 경우에 대해 분류기 Ck(X)를 이용하여 분류한 결과가 오분류되었을 경우, 1의 값을, 정분류 되었을 경우 <93> 0의 값을 갖는 더미변수 d(i)를 정의한다. <step4> <94> 분류기 Ck(X)의 오분류율 εk와 P(i)를 갱신하는데 필요한 값 βk를 아래와 같은 수학식 5에 근거하여 계산한다. <95> 수학식 5 <96> 만일, k번째 스텝(step)의 오분류율 εk가 0이거나 1/2보다 크면, P(i)=1/N이며, 스텝(step) 1에서 시작한다. <97> <step5> <98> 값 βk를 바탕으로 k+1번째 bootstrap resample에서 관측치 I가 샘플링될 확률을 다음 수학식 6과 같이 계산한 <99> 다. 수학식 6 <100> <step6> <101> 이와 같은 과정을 K번 반복한 후, 각 분류기의 분류결과에 log(βk)의 가중치를 주어 가중 평균한 값을 취하게 <102> 된다. 산업이용 가능성 기술적 측면에서 개선된 본 발명에 의한 지하수 오염취약성 평가방법 및 그 시스템은 한국의 특수성을 고려한 <103> 한국형 평가방법 및 시스템이라 할 수 있다. 기존의 외국 평가방법 및 시스템에 비해 국내 지하수 환경에 대한 실증 연구를 바탕으로 모델의 현장 적용성을 향상시킬 것이다. 또한 본 발명에서 제안된 방법은 다양한 다변량 통계기법, 인공지능 방법론을 통합적으로 사용함으로써 향상된 예측력을 바탕으로, 체계적이고 예측가능한 지하 수 자원 관리를 가능하게 할 것으로 기대된다."}
