{"patent_id": "10-2023-0000235", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0108926", "출원번호": "10-2023-0000235", "발명의 명칭": "ＱＲ 코드인식 시설 원예 로봇 및 이를 이용한 빅데이터 생성 시스템", "출원인": "경북대학교 산학협력단", "발명자": "하유신"}}
{"patent_id": "10-2023-0000235", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "원예 시설 내에서 자율주행을 수행하는 원예 로봇; 및 원예 로봇에서 수집된 데이터가 저장되는 작물 데이터서버를 포함하고, 상기 원예 로봇은 원예 시설 내의 온도, 습도, 조도 및 이산화탄소 중 적어도 하나를 포함하는 환경 데이터를 수집하기 위한 환경센서; 및상기 QR 코드를 인식하는 동시에 상기 원예 시설내 작물을 인식하여 작물을 촬영하여 작물 데이터를 생성하는카메라를 포함하고,상기 원예 로봇은 QR 코드를 인식하여 원예 시설 내에서 자율주행을 수행하고, 상기 수집된 환경 데이터 및 작물 데이터를 작물 데이터서버로 전송하고,상기 작물 데이터서버는 수집된 환경 데이터와 작물 데이터를 누적시켜 빅데이터를 생성하는 것을 특징으로 하는 원예 작물의 빅데이터 생성 시스템."}
{"patent_id": "10-2023-0000235", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 원예 작물의 빅데이터 생성 시스템은 상기 누적 데이터를 통해 작물의 이력을 관리하고 작물의 생육 상태를 진단 및 예측하고, 상기 작물 데이터서버에 접속된 사용자 단말에 작물 이력 및 작물의 생육 상태를 제공하도록 구성된 것을 특징으로 하는 원예 작물의 빅데이터 생성 시스템."}
{"patent_id": "10-2023-0000235", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 원예 로봇은, 작물이 적재하기 위해 원예 로봇에 결합되는 적재함 모듈을 더 포함하고,상기 적재함 모듈이 결합되는 원예 로봇의 모듈 결합부에는 적재함 모듈에 적재되는 작물의 중량을 측정하기 위한 로드셀 센서가 설치된 것을 특징으로 하는 원예 작물의 빅데이터 생성 시스템."}
{"patent_id": "10-2023-0000235", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 카메라는 원예 로봇의 상부에 노출되어 제공되고, 상기 카메라는 본체 하부에 설치된 액추에이터에 연결되어 360°회전가능하고 상하로 엘리베이션 가능하도록 구동되는 것을 특징으로 하는 원예 작물의 빅데이터 생성 시스템.공개특허 10-2024-0108926-3-청구항 5 제1항에 있어서,상기 원예 로봇은 원예 시설 내의 QR 코드 제공 수단으로부터 제공되는 QR 코드를 인식하여 자율주행을 수행하고, 상기 QR 코드 제공 수단은 전자잉크 디스플레이인 것을 특징으로 하는원예 작물의 빅데이터 생성 시스템."}
{"patent_id": "10-2023-0000235", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 QR 코드인식 시설 원예 로봇 및 이를 이용한 빅데이터 생성 시스템에 관한 것으로 본 발명의 일양태에 따르면 원예 시설 내에서 자율주행을 수행하는 원예 로봇; 및 원예 로봇에서 수집된 데이터가 저장되는 작물 데 이터서버를 포함하고, 상기 원예 로봇은 원예 시설 내의 온도, 습도, 조도 및 이산화탄소 중 적어도 하나를 포함 하는 환경 데이터를 수집하기 위한 환경 센서; 및 상기 QR 코드를 인식하는 동시에 상기 원예 시설내 작물을 인 식하여 작물을 촬영하여 작물 데이터를 생성하는 카메라를 포함하고, 상기 원예 로봇은 QR 코드를 인식하여 원예 시설 내에서 자율주행을 수행하고, 상기 수집된 환경 데이터 및 작물 데이터를 작물 데이터서버로 전송하고, 상 기 작물 데이터서버는 수집된 환경 데이터와 작물 데이터를 누적시켜 빅데이터를 생성한다."}
{"patent_id": "10-2023-0000235", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 QR 코드인식 시설 원예 로봇에 관한 것으로, 보다 구체적으로는 QQ 코드를 이용하여 시설 내를 자율 주행하며 작업을 수행하는 동시에 자율주행시 재배 환경 및 작물정보를 수집하여 빅데이터를 생성하는 QR 코드 인식 시설 원예 로봇 및 이를 이용한 빅데이터 생성 시스템에 관한 것이다."}
{"patent_id": "10-2023-0000235", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 많은 국내기업들은 시설 농업에서 이익 극대화, 효율성 증가를 위해 다양한 방식의 자율 시설 농업 시스템을 도입하고 있다. 이에 시설 농업 기술의 관심도와 필요성이 높아지면서 또한 시설농업에서의 인력난과 고령화로 인해, 무인차량 또는 무인로봇(AGV, Automatic Guided Vehicle)을 이용한 자동화 기술에 대한 관심이 높아지고 있다. 이러한 종래의 무인로봇의 자율 주행을 위해서는 실시간으로 자기위치를 파악하고, 경로를 추종하는 것이 우선 적으로 고려되어야 한다. 대표적인 방법으로 자기-자이로 유도(Magnet-Gyro Guidance), 유선유도 (WireGuidance)와 같은 유도방식이 이용되었으나, 설치 및 유지보수에 대한 비용이 크기 때문에 목적에 따라 유 동적으로 작업환경을 변경하기가 어려운 문제점이 있었다. 또한, 종래에는 무인로봇이 화물을 적재하는 경우 너무 많은 화물이 적재되는 경우 자율주행이 불가능하게 되는 문제점이 있었다. 또한 국내등록특허 제10-1772631호에는 이동경로의 바닥면 상에 배치된 RFID태그 또는 QR 코드를 인식하여 위치 를 추종하며 자율 주행하는 자율주행 물류로봇이 개발되었지만 QR 코드의 경우 인쇄된 종이를 이용함에 따라 경 로등을 변경하고자 할 때 새롭게 QR 코드를 인쇄하고 다시 이동경로의 바닥면에 설치해야 하는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-1772631호 (등록일: 2017년08월23일)"}
{"patent_id": "10-2023-0000235", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점에 기반하여 안출된 발명으로 설치 및 유지보수가 용이한 QR 코드인식 시설 원예 로봇 및 이를 이용한 빅데이터 생성 시스템을 제공하는 것을 목적으로 한다. 또한 본 발명은 무인로봇이 적절한 화물을 적재할 수 있도록 하는 QR 코드인식 시설 원예 로봇 및 이를 이용한 빅데이터 생성 시스템을 제공하는 것을 목적으로 한다. 또한 본 발명은 무인로봇이 경로 등을 변경하고자 새롭게 QR 코드를 인쇄할 필요가 없이 간편하게 변경할 수 있 는 QR 코드인식 시설 원예 로봇 및 이를 이용한 빅데이터 생성 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0000235", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 과제를 해결하기 위해 본 발명의 일양태에 따르면 원예 시설 내에서 자율주행을 수행하는 원예 로봇; 및 원예 로봇에서 수집된 데이터가 저장되는 작물 데이터서버를 포함하고, 상기 원예 로봇은 원예 시설 내의 온도, 습도, 조도 및 이산화탄소 중 적어도 하나를 포함하는 환경 데이터를 수집하기 위한 환경 센서; 및 상기 QR 코 드를 인식하는 동시에 상기 원예 시설내 작물을 인식하여 작물을 촬영하여 작물 데이터를 생성하는 카메라를 포 함하고, 상기 원예 로봇은 QR 코드를 인식하여 원예 시설 내에서 자율주행을 수행하고, 상기 수집된 환경 데이 터 및 작물 데이터를 작물 데이터서버로 전송하고, 상기 작물 데이터서버는 수집된 환경 데이터와 작물 데이터 를 누적시켜 빅데이터를 생성하는 것을 특징으로 하는 원예 작물의 빅데이터 생성 시스템이 제공된다. 전술한 양태에서 원예 작물의 빅데이터 생성 시스템은 상기 누적 데이터를 통해 작물의 이력을 관리하고 작물의 생육 상태를 진단 및 예측하고, 상기 작물 데이터서버에 접속된 사용자 단말에 작물 이력 및 작물의 생육 상태 를 제공하도록 구성된다. 또한 전술한 양태중 어느 하나에서 원예 로봇은, 작물이 적재하기 위해 원예 로봇에 결합되는 적재함 모듈을 더 포함하고, 상기 적재함 모듈이 결합되는 원예 로봇의 모듈 결합부에는 적재함 모듈에 적재되는 작물의 중량을 측정하기 위한 로드셀 센서가 설치된다. 또한 전술한 양태중 어느 하나에서 카메라는 원예 로봇의 상부에 노출되어 제공되고, 상기 카메라는 본체 하부 에 설치된 액추에이터에 연결되어 360°회전가능하고 상하로 엘리베이션 가능하도록 구동된다. 또한 전술한 양태중 어느 하나에서 원예 로봇은 원예 시설 내의 QR 코드 제공 수단으로부터 제공되는 QR 코드를 인식하여 자율주행을 수행하고, 상기 QR 코드 제공 수단은 전자잉크 디스플레이인 것이 바람직하다."}
{"patent_id": "10-2023-0000235", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같은 본 발명에 따르면 비교적 저렴한 QR 코드를 통해 원예 로봇의 자율 주행을 가능하게 할 수 있고, 또 한 자율 주행 도중 원예 시설 내의 작물 정보와 환경 정보를 수집하여 데이터서버에 전송함으로써 원예 시설에 서 작물 생육에 필요한 빅데이터를 생성할 수 있게 된다. 또한 본 발명에 따르면 원예 로봇에 로드셀 센서를 제공함으로써 적절한 화물을 원예 로봇에 적재하는 것이 가 능하게 되고, 원예 로봇이 경로 등을 변경하고자 할 때 전자잉크의 QR 코드를 변경함으로써 간편하게 경로를 조 절할 수 있게 된다."}
{"patent_id": "10-2023-0000235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에 개시되어 있는 본 발명의 개념에 따른 실시예들에 대해서 특정한 구조적 또는 기능적 설명들은 단 지 본 발명의 개념에 따른 실시예들을 설명하기 위한 목적으로 예시된 것으로서, 본 발명의 개념에 따른 실시예 들은 다양한 형태로 실시될 수 있으며 본 명세서에 설명된 실시예들에 한정되지 않는다. 본 발명의 개념에 따른 실시예들은 다양한 변경들을 가할 수 있고 여러 가지 형태들을 가질 수 있으므로 실시예 들을 도면에 예시하고 본 명세서에 상세하게 설명하고자 한다. 그러나, 이는 본 발명의 개념에 따른 실시예들을 특정한 개시형태들에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 변경, 균등물, 또 는 대체물을 포함한다. 이하, 실시예들을 첨부된 도면을 참조하여 상세하게 설명한다. 그러나, 특허출원의 범위 가 이러한 실시예들에 의해 제한되거나 한정되는 것은 아니다. 도 1은 본 발명의 QR 코드인식 시설 원예 로봇 및 이를 이용한 빅데이터 생성 시스템의 일례를 개략적으로 도시 한 도면이다. 도 1에 도시된 바와 같이 작물육성 빅데이터 생성 시스템은 빅데이터 수집을 위한 QR 코드인식 시 설 원예 로봇 및 QR 코드인식 시설 원예 로봇에서 수집된 데이터가 저장되는 작물 데이터서버를 포함하 고, QR 코드인식 시설 원예 로봇 및 작물 데이터서버는 네트워크를 통해 서로 연결된다. 또한 도 1에 도시된 바와 같이 빅데이터 생성 시스템은 사용자 단말을 더 포함한다. 사용자 단말은 네트워크를 통해 작물 데이터서버에 접속가능하고 작물 데이터서버에서 제공되는 데이터를 수신하거나, 작물 데이터서버 에서 빅데이터에 기반하여 분석된 작의 이력 및 작물의 생육 상태를 진단 및 예측을 수신하도록 서버와 통신하는 애플리케이션이 설치될 수 있다. 여기서 사용자 단말기는 네트워크를 통해 데이터서버에 접속가능한 단말을 의미한다. 구체적으로 전술한 단 말은 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(Desktop), 랩톱(Laptop) 등을 포 함할 수 있다. 이때, 전술한 단말들은 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치일 수 있으며, 네 비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(CodeDivision Multiple Access)-2000, W-CDMA(W- Code Division Multiple Access), Wibro(Wireless BroadbandInternet) 단말, 스마트폰(smartphone), 스마트 패드(smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수도 있으며, 여기서 바람하게 사용자 단말기는 애플리케이션이 설치가능한 스마트폰인 것이 바람직하다.네트워크는 전술한 구성요소들 사이에서 정보 교환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크의 일 예에는 RF, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5GPP(5th Generation Partnership Project) 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 블루투스(Bluetooth) 네트워크, NFC 네트워크, 위성 방 송 네트워크, 아날로그 방송 네트워크, DMB(Digital MultimediaBroadcasting) 네트워크 등이 포함되나 이에 한 정되지는 않는다. QR 코드인식 시설 원예 로봇는 비닐하우스나 작물 플랜트와 같은 원예 시설 내에서 QR 코드를 인식하여 자 율주행을 수행하고 자율주행 도중 온도, 습도, 조도, 이산화탄소 량과 같은 작물 성장에 요구되는 환경 데이터 를 측정하고, 또한 작물의 생육 상태를 촬영하도록 구성되고, 측정된 환경 데이터 및 촬영된 작물 생육 데이터 (사진 또는 비디오)를 작물 데이터서버에 전송하도록 구성된다. 작물 데이터서버는 QR 코드인식 시설 원예 로봇에서 전송된 원예 시설내 환경 데이터 및 작물 생육 데 이터에 기반하여 작물의 생육 상태를 진단 및 예측하는 인공지능(인공신경망 또는 딥러닝 또는 머신러닝) 기반 의 작물 생육 예측 모듈을 포함하고, 작물 생육 예측 모듈을 통해 작물의 생육과 관련된 정보를 생성하여 사용 자 단말에 제공하도록 구성된다. 도 2는 전술한 바와 같은 빅데이터 생성 시스템에서 이용되는 QR 코드인식 시설 원예 로봇의 본체를 나타내는 도면이다. 도 2에 도시된 바와 같이 QR 코드인식 시설 원예 로봇의 본체에는 원예 로봇(1 0)을 구동시키기 위한 모터등과 같은 구동수단에 연결된 바퀴부; 상기 본체의 전방부에 제공되는 카 메라; 상기 본체의 전방부 상측에 배치되는 디스플레이부; 상기 본체의 상부에 배치되어 적재함 모듈 및/방재기 모듈 등이 결합되는 모듈 결합부가 제공된다. 도 3은 바퀴부의 구동 방식을 설명하기 위한 도면이다. 도시된 바와 같이 바퀴부는 회전가능한 4개의 바퀴로 이루어져 있으며, 각각의 바퀴의 중심축은 구동모터의 회전축에 연결되어 독립적으로 구동가 능하다. 그러나 본 발명은 이에 한정되는 것은 아니고 전류 바퀴 2개와 후륜 바퀴 2개가 각각 전륜과 후륜을 구 동하는 2개의 구동모터에 연결되는 구조로 이루어질 수도 있다. 한편 도시하지는 않았지만 구동모터의 슬림 현 상, 바닥면의 상태에 따라 4개의 모터의 실제 구동 적산 거리의 차이를 보완하기 위한 엔코더가 더 제공될 수도 있다. 도 4는 카메라의 구동 방식을 설명하기 위한 도면이다. 카메라는 본체 전방부 상부에 노출되어 제공되어 있지만 도시된 바와 같이 본체 하부에 액추에이터에 연결되어 360°회전 운동 가능하고 상하로 엘리베이션 운동이 가능하도록 설계된다. 카메라는 주행 중 QR 코드를 인식하는 동시에 주변의 작물을 인 식하여 촬영을 수행하도록 딥러닝을 통해 학습된 작물인식 학습모델을 포함할 수도 있다. 도 2에 도시된 바와 같이 QR 코드인식 시설 원예 로봇은 본체의 일부분에 LCD와 같은 디스플레이 수단 을 더 포함할 수 있다. 디스플레이 수단은 후술하는 로드셀에 의해 측정되는 무게를 표시하도록 제공된다. 또한 보다 많은 정보를 제공하기 위해 QR 코드인식 시설 원예 로봇의 전방부에는 대화면 디스플 레이가 더 제공될 수도 있고, 대화면 디스플레이에는 환경 센서로부터 수집되는 환경 데이터, 예를 들면 온도, 습도, 조도, 일산화탄소와 같은 작물의 생육에 필요한 데이터를 실시간으로 표시하거나, QR 코 드인식 시설 원예 로봇의 상태 정보, 예를 들면 주행속도, 배터리 상태, 로봇 진단 정보 등을 표시할 수도 있다. 또한 QR 코드인식 시설 원예 로봇은 작물의 운반 작업, 방제 작업, 후확작업과 같은 작물 작업을 지원하도 록 구성된다. 작물 작업을 수행하기 위해 복수의 작업 모듈이 제공된다. 도 5는 원예 로봇의 본체에 결합되는 작업 모듈의 일례를 나타내는 도면이다. 도 5의 (a)는 적재함 모듈을 나타내는 도면이고, 도 5의 (b)는 방제 모 듈을 나타내는 도면이다. 적재함 모듈(165a) 및 방제모듈(165b) 모두 하단부에 레그 형상의 결합부(140a)가 제 공되고, 레그 형상의 결합부(140a)는 본체의 모듈 결합부에 끼워져 결합된다. 도 6은 QR 코드인식 시설 원예 로봇의 본체에 적재함 모듈(165a)이 설치된 상태를 나타내는 도면이다. 적재함 모듈(165a)의 레그 형상의 결합부(140a)가 본체의 모듈 결합부가 끼워져 결합된다. 본체의 상 부에 형성된 4개의 모듈 결합부 중 적어도 하나 이상에는 그 내부에 로드셀 센서이 제공된다. 로드셀 센서는 상부로부터 적재함 모듈(165a)에 의해 가압되는 중량을 측정하도록 구성되고 측정된 무게는 디스플 레이부에 표시한다. 또한 적재함 모듈(165a)에서는 적재 기준량이 체워지면 이를 디스플레이부에 표 시하여 사용자에게 표시함으로써 적재함에 작물이 과적되는 것을 방지하고 과적으로 인해 자율주행이 정지되는 것을 방지한다. 도 7은 QR 코드인식 시설 원예 로봇에 제공되는 QR 코드 제공 수단을 설명하기 위한 도면이다. 도 8에 도시된 바와 같이 QR 코드 제공 수단은 전자잉크 디스플레이를 통해 QR 코드가 제공된다. 전자잉크 디스플레이는 디스플레이의 하나의 분류로, 흔히 평판 디스플레이에 사용되는 LCD나 OLED와는 달리 별도의 구동없이 정지 화상을 유지하는 특성을 갖는다. 전자잉크 디스플레이는 백라이트가 필요없기 때문에 OLED처럼 얇게 만들 수 있고, 반사 캡슐이 필름으로 공급되다 보니 접거나 휘어지는 화면도 비교적 쉽게 구현할 수 있다. 또한 전자잉크 디스플레이는 대기 상 태에서 전력 소비량이 매우 적다. 전자잉크 디스플레이는 화소가 발광하는 형식이 아니며 픽셀의 내용이 변화할 때만 전기를 이용하기 때문에 정지 화면을 계속 띄워놓을 때는 전기가 필요없다. 보통 전자잉크 디스플 레이의 경우 한 번 충전하면 거의 한 달이나 사용할 수 있을 정도로 유지보수 성능이 좋다. 또한 전자잉크 디스 플레이는 백라이트나 유기물질의 수명에 비하면 거의 반영구적이라고 할 수 있다. 또한 전자잉크 디스플레 이는 시야각과 밝은 곳에서의 시인성이 좋다. LCD가 정면 시야가 아닐 경우 명암비와 휘도가 급강하하는 것과 달리 전자잉크 디스플레이는 종이와 같이 시야각이라는 개념이 없다. 또한 화면 밑의 회로가 반사 캡슐에 완전히 가려지므로 미라솔 등 다른 반사성 디스플레이에 비해서도 자연스럽다. 또 LCD와 반대로 주변의 빛이 밝 고 강할 수록 명암비가 좋아져 시인성이 좋아진다. 이와 같은 전자잉크의 성질은 QR 코드를 인식하는 시설 원예 로봇에 QR 코드를 제공하는 수단으로 매우 적합한 특성을 가진다. 이와 같이 QR 코드인식 시설 원예 로봇 는 QR 코드 판독을 통해 현재 위치 정보 및 다음 경로까지의 거리 정보를 수신하고, 수신된 현재 위치 정보 와 다음경로까지의 거리 정보를 가지고 다음 타겟(다음 QR 코드)으로 이동을 진행한다. 도 8은 원예 시설 내에서의 QR 코드인식 시설 원예 로봇의 이동 방법을 설명하기 위한 설명도이다. QR 코드 인식 시설 원예 로봇는 시작 지점의 제1 QR 코드를 판독한다. 제1 QR 코드로부터 QR 코드인식 시설 원예 로 봇은 현재의 위치 정보, 다음 타겟의 위치 정보 및 다음 타겟 까지의 거리 정보를 판독한다. QR 코드인식 시설 원예 로봇은 QR 코드를 인식함으로써 방향 및 위치를 파악하고 QR 코드 위치를 원예 로봇에 저장된 맵 데이터로 합성하여 다음 타겟까지의 경로를 파악한다. 이동중 오차범위를 더 줄이기 위한 보조 엔코더를 부착하 여 엔코더신호를 분석하여 이동 중 거리를 파악할 수 있다. 원예 시설의 경우 통상적으로 직선의 이동 경로를 가지고 있지만 원예 로봇을 정확하게 직선으로 이동시키 는 것은 매우 어렵다. 원예 로봇의 자율 주행을 위해서는 다음 타겟 지점까지 설정된 경로를 이탈하지 않아 야 한다. 이는 원예 로봇의 현재 위치 파악과 위치 인식 보정을 고려해야함의미 한다. 특히 제1 경로와 제2 경 로, 제2 경로와 제3 경로와 같이 원예 로봇이 회전 이동을 해야 하는 경우 정확한 위치에서 정확하게 회전하지 않으면 원예 로봇은 경로를 이탈하여 자율주행하지 못하는 경우가 발생하게 된다. 도 9는 전술한 바와 같이 원예 로봇의 위치 경로를 보정하기 위한 하나의 방법을 나타내는 도면이다. 도 9의 (a)는 원예 로봇이 정확한 위치에서 다음 타겟에 접근하여 QR 코드를 판독하는 경우를 나타낸다. 이 경우 QR 코 드는 전체 판독 영역 내의 중심에 위치한 기준 판독 위치에서 판독된다. 카메라의 경우 고정된 화각을 가지고 있기 때문에 카메라 화각을 고려하여 타겟까지의 거리가 파악될 수 있으며, 이를 고려하여 원예 로봇의 회전 위 치가 결정될 수 있다. 예를 들면 도 9의 (b)의 경우 QR 코드가 판독되었지만 이는 기준 판독 위치의 기준 면적 보다 작은 면적을 차지하고 있으며 이는 원예 로봇이 로봇의 회전 위치에 충분히 접근하지 못했음을 의미한다. 또한 반대로 도 9의 (c)의 경우 QR 코드가 판독되었지만 이는 기준 판독 위치의 기준 면적보다 큰 면적을 차지 하고 있으며 이는 원예 로봇이 로봇의 회전 위치를 지나쳐 이동하였음을 의미한다. 도 10은 원예 로봇의 위치 경로를 보정하기 위한 다른 방법을 나타내는 도면이다. 이는 QR 코드의 취득되는 전 체 판독 위치에서 기준 판독 위치를 기준으로하여 실제 판독 위치의 좌표를 비교하고 그 차이만큼 보정을 수행 하여 원예로봇의 자세를 보정함으로써, 도 9의 (a)와 같이 기준 판독위치에 실제판독위치가 위치되도록 보정을 수행한다. 따라서 도 8에 도시된 바와 같은 주행 경로에서, QR 코드인식 시설 원예 로봇은 전술한 바와 같은 QR 코드 판독 위치에 기반한 주행 보정을 통해 제1 회전 위치, 제2 위치에서 정확하게 회전하는 것이 가능하게 되고 직 진 주행의 안정성이 향상될 수 있다. 원예 로봇는 구간 구간마다 정해진 경로(예를 들면 제1 경로, 제2 경로, 제3 경로)를 이동하면서 카메라를 이용하여 작물을 인식하고 인식된 작물에 대한 촬영을 수행하는 동시에 환경 센서부를 통해 원예 시설내의 환경 데이터를 수집한다. 또한 원예 로봇은 작물 인식 과정에서 미리학습된 작물인식 학습모델을 통해 이상 작물 (예를 들면 병충해 작물)을 검출하거나 환경 검출값이 기준값을 벗어난 경우(온도, 습도, 조도, 이산화탄소) 원 예 시설에 문제가 발생한 것으로 판단하여 이를 데이터서버에 즉시 전송하고 데이터서버에서는 사용자 에게 이를 통보하도록 구성된다. 도 11은 전술한 바와 같은 원예 로봇의 내부 제어부의 구성을 나타내는 도면이다. 도 11에 도시된 바와 같 이 원예 로봇은 카메라로부터 촬영된 영상으로부터 QR 코드를 인식하는 QR 코드 인식부, 카메라 로부터 촬영된 영상으로부터 작물을 인식하는 작물 인식부(또는 딥러닝 기반 작물 인식 모델)을 포함한다. QR 코드 인식부는 촬영된 QR 코드로부터 현재의 위치, 다음 타겟의 위치, 및 다음 타겟까지의 거리와 같은 정보를 추출하고 추출된 정보를 경로 설정부에 전달하도록 구성되고 작물 인식부는 인식된 작물에 대 한 촬영 데이터를 수신하여 작물데이터 수집부로 전달하도록 구성된다. 경로 설정부는 QR 코드로부터 현재의 위치, 다음 타겟의 위치, 및 다음 타겟까지의 거리 정보와 자신이 가 진 맵 데이터를 이용하여 다음 경로를 계산하고 주행부에 경로를 전달한다. 주행부는 계산된 경로에 기반하여 현재 바퀴 조향각을 조향각 입력부를 통해 전달받고 필요한 경우 현재 조향각도를 조향각 조절부 를 통해 조절을 수행한다. 로드셀 센서로부터의 중량 정보는 이상 판단부로 전달되고 이상 판단 부는 현재의 중량 정보를 디스플레이에 표시하도록 구성된다. 환경 센서로부터의 검출된 환경 데이터 값은 환경 데이터 수집부로 전달되고 환경 데이터 수집부 에서 수집된 데이터는 이상 판단부으로 전달된다. 이상 판단부는 수집된 환경 데이터를 통신부 를 통해 데이터서버로 전송하는 반면 수집된 환경 데이터 중 어느 하나라도 이상 데이터가 검출되면 이를 데이터서버에 즉시 전달하고 데이터서버는 이를 사용자의 애플리케이션으로 알림한다. 작물데이터 수집부는 작물인식부로부터 인식되어 촬영된 작물의 영상을 수신하고 수집된 작물의 영상 을 통신부를 통해 데이터서버로 전송하는 반면 수집된 작물 영상 중 이상 작물이 검출되면 이를 데이터서 버에 즉시 전달하고 데이터서버는 이를 사용자의 애플리케이션으로 알림한다.QR 코드 기반 자세 보정부는 도 9 내지 도 10을 참조하여 설명한 바와 같이 QR 코드의 기준판독위치와 실 제판독위치, 기준판독위치에서의 면적을 비교하여 원예 로봇의 위치 및 자세를 보정하도록 바퀴 조향각 조 절부에 명령하고 바퀴 조향각 조절부는 바퀴 조향각을 조절하면서 원예 로봇의 위치를 조정한다. 도 12는 본 발명의 QR 코드인식 시설 원예 로봇의 다른 실시예를 나타낸 도면이다. 도시된 바와 같이 QR 코 드인식 시설 원예 로봇은 제1 카메라, 제2 카메라(124a) 및 제3 카메라(124b)를 포함한다. 제1 카메라 는 원예 시설 내의 작물을 인식하여 촬영하기 위한 작물촬영 카메라이고 제2 카메라(124a) 및 제3 카 메라(124b)는 QR 코드를 촬영하기 위한 QR 코드 인식 카메라이다. 제2 및 제3 카메라(124a,124b)는 화각조절가 능한 확대-줌 카메라인 것이 바람직하고, 제2 및 제3 카메라(124a,124b)의 광축은 공간상에 일렬로 정렬되어 있 다. QR 코드인식 시설 원예 로봇은 확대-줌 카메라인 제2 및 제3 카메라(124a,124b)를 이용하여 원예 로봇의 전 방에 위치된 QR 코드와 후방(타겟 위치)에 위치된 QR 코드를 동시에 촬영하고 보정을 수행하도록 구성된다. 도 8에 도시된 바와 같이 QR 코드들은 경로의 직선상에 배치되기 때문에, 도 13에 도시된 바와 같이 QR 코드인 식 시설 원예 로봇이 경로의 일직선 상에 일치되면 제2 및 제3 카메라(124a,124b)의 광축이 공간상에 일렬 로 정렬됨에 따라 QR 코드인식 시설 원예 로봇은 경로의 중앙에 위치된다. QR 코드인식 시설 원예 로봇은 시작점 QR 코드를 촬영하는 전방의 제2 카메라(124a)로부터 경로설정에 필요 한 정보를 수신한 후 제3 카메라(124b)를 통해 목적지의 QR 코드를 탐색한다. 이때 제3 카메라(124b)는 최대 확 대줌(N) 비율로 구동되어 QR 코드의 정확한 위치를 파악하게 한다. 도 14는 제2 카메라(124a)의 기준판독위치에 QR 코드가 일치되어 있지만 제3 카메라(124b)의 기준판독위치의 중심에 어긋나 있음을 알 수 있다. 따라서 QR 기반 자세 보정부는 제3 카메라(124b)로부터 촬영되는 타겟 QR 코드가 기준판독위치에 정렬되도록 조향각 조절부를 통해 원예 로봇의 위치 및 자세를 조절하면서 주행을 시작한다. QR 코드인식 시설 원예 로봇 는 다음 타겟 QR 까지의 주행 경로를 주행하면서 전면 및 후면에 설치된 QR 코드 인식 카메라를 통해 QR 코 드를 지속적으로 인식하고 QR 코드의 중심이 기준판독위치의 중심에 위치하도록 원예 로봇의 위치 및 자세 를 조절함으로써 QR 코드인식 시설 원예 로봇의 직진 안정성을 보장한다. 이와 같은 본 발명에 따르면 비교적 저렴한 QR 코드를 통해 원예 로봇의 자율 주행을 가능하게 할 수 있고, 또 한 자율 주행 도중 원예 시설 내의 작물 정보와 환경 정보를 수집하여 데이터서버에 전송함으로써 원예 시설에 서 작물 생육에 필요한 빅데이터를 생성할 수 있게 된다. 또한 본 발명에 따르면 원예 로봇에 로드셀 센서를 제공함으로써 적절한 화물을 원예 로봇에 적재하는 것이 가 능하게 되고, 원예 로봇이 경로 등을 변경하고자 할 때 전자잉크의 QR 코드를 변경함으로써 간편하게 경로를 조 절할 수 있게 된다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로세 서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨 터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명"}
{"patent_id": "10-2023-0000235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알수 있다. 예를 들어, 처리 장치는 복수 개의 프 로세서 또는 하나의 프로세서 및하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor) 와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively)처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터 는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속하 는 것으로 해석되어야만 한다."}
{"patent_id": "10-2023-0000235", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 QR 코드인식 시설 원예 로봇 및 이를 이용한 빅데이터 생성 시스템의 일례를 개략적으로 도시 한 도면; 도 2는 빅데이터 생성 시스템에서 이용되는 QR 코드인식 시설 원예 로봇의 본체를 개략적으로 나타내는 도면; 도 3은 바퀴부의 구동 방식을 설명하기 위한 도면; 도 4는 카메라의 구동 방식을 설명하기 위한 도면;도 5는 본체에 결합되는 작업 모듈의 일례를 나타내는 도면; 도 6은 원예 로봇의 본체에 적재함 모듈이 설치된 상태를 나타내는 도면; 도 7은 QR 코드 제공 수단에 대해 설명하기 위한 도면; 도 8은 원예 시설 내에서의 QR 코드인식 시설 원예 로봇의 이동 방법을 설명하기 위한 설명도; 도 9는 원예 로봇의 위치 경로를 보정하기 위한 하나의 방법을 나타내는 도면; 도 10은 원예 로봇의 위치 경로를 보정하기 위한 다른 방법을 나타내는 도면; 도 11은 원예 로봇의 내부 제어부의 구성을 나타내는 도면; 도 12는 본 발명의 QR 코드인식 시설 원예 로봇의 다른 실시예를 나타낸 도면; 도 13은 2개의 카메라를 이용하여 원예 로봇의 위치 경로를 보정하기 위한 방법을 나타내는 도면; 및 도 14는 2개의 카메라를 이용하여 원예 로봇의 위치 경로를 보정하기 위한 또 다른 방법을 나타내는 도면이다."}
