{"patent_id": "10-2021-0090218", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0009608", "출원번호": "10-2021-0090218", "발명의 명칭": "롤러블 디스플레이를 포함하는 전자 장치 및 필기 인식 방법", "출원인": "삼성전자주식회사", "발명자": "곽태원"}}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,롤러블 디스플레이;메모리; 및상기 롤러블 디스플레이 및 상기 메모리와 작동적으로(operatively) 연결된 프로세서를 포함하고,상기 프로세서는,상기 롤러블 디스플레이에 적어도 하나의 스트로크(stroke)로 이루어진 콘텐츠(contents)를 표시하고,사용자의 디스플레이 확장 요청에 대응하여 상기 롤러블 디스플레이를 확장하고,상기 롤러블 디스플레이의 확장을 수행하는 동안,제1시점에 상기 콘텐츠의 제1영역에 포함된 적어도 하나의 스트로크를 분석하고,분석한 스트로크에 대응하는 제1텍스트를 상기 콘텐츠의 일 측에 표시하고,제2시점에 상기 제1영역을 포함하는 제2영역에 포함된 적어도 하나의 스트로크를 분석하고,분석한 스트로크에 대응하는 제2텍스트를 상기 콘텐츠의 일 측에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 프로세서는,상기 제1시점으로부터 기준 시간만큼 경과한 시점을 상기 제2시점으로 결정하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 프로세서는,상기 콘텐츠에 포함된 스트로크의 양에 기초하여 상기 기준 시간을 결정하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서,상기 프로세서는,상기 기준 시간 동안 상기 롤러블 디스플레이가 확장한 길이에 기초하여, 상기 롤러블 디스플레이가 확장하는방향으로 상기 제1영역을 확장하여 상기 제2영역을 결정하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2023-0009608-3-제4항에 있어서,상기 롤러블 디스플레이는 좌우 또는 상하로 확장하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 프로세서는,상기 콘텐츠를 구성하는 스트로크를 정해진 기준에 따라 적어도 하나의 단어 영역으로 구분하도록 설정된 전자장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 프로세서는,상기 콘텐츠에 포함된 적어도 하나의 단어 영역을 맵핑하여 적어도 하나의 라인(line)을 생성하고, 및상기 적어도 하나의 라인에 대한 정보에 기초하여 라인 리스트(line list)를 생성하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 프로세서는,상기 라인 리스트에 기초하여, 상기 콘텐츠에서 분석하고자 하는 영역을 벗어나지 않는 적어도 하나의 단어 영역을 라인 별로 획득하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서,상기 프로세서는,상기 획득한 단어 영역에 포함된 스트로크 기초하여 생성한 텍스트를 라인 별로 상기 콘텐츠의 일 측에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항에 있어서,상기 프로세서는,상기 콘텐츠의 모든 라인에 대한 스트로크 분석을 하나의 스레드에서 수행하거나,또는 각 라인에 대응하는 별개의 스레드에서 수행하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1항에 있어서,공개특허 10-2023-0009608-4-상기 프로세서는,상기 제1시점에 생성한 상기 제1텍스트에 대한 정보를 상기 메모리에 저장하고,상기 제2시점에 상기 제1텍스트에 대한 정보를 이용하여 상기 제2텍스트를 생성하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "롤러블 디스플레이를 이용한 필기 인식 방법에 있어서,롤러블 디스플레이에 적어도 하나의 스트로크로 이루어진 콘텐츠를 표시하는 동작, 및사용자의 디스플레이 확장 요청에 대응하여 상기 롤러블 디스플레이를 확장하는 동작을 포함하고,상기 롤러블 디스플레이의 확장을 수행하는 동안,제1시점에 상기 콘텐츠의 제1영역에 포함된 적어도 하나의 스트로크를 분석하는 동작,분석한 스트로크에 대응하는 제1텍스트를 상기 콘텐츠의 일 측에 표시하는 동작,제2시점에 상기 제1영역을 포함하는 제2영역에 포함된 적어도 하나의 스트로크를 분석하는 동작, 및분석한 스트로크에 대응하는 제2텍스트를 상기 콘텐츠의 일 측에 표시하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12항에 있어서,상기 제2시점은 상기 제1시점으로부터 기준 시간만큼 경과한 시점인 방법."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 콘텐츠에 포함된 스트로크의 양에 기초하여 상기 기준 시간을 결정하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13항에 있어서,상기 제2영역에 포함된 적어도 하나의 스트로크를 인식하는 동작은,상기 기준 시간 동안 상기 롤러블 디스플레이가 확장한 길이에 기초하여, 상기 롤러블 디스플레이가 확장하는방향으로 상기 제1영역을 확장하여 상기 제2영역을 결정하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 롤러블 디스플레이는 좌우 또는 상하로 확장하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 12항에 있어서,상기 콘텐츠의 스트로크를 분석하는 동작은,공개특허 10-2023-0009608-5-상기 콘텐츠를 구성하는 스트로크를 정해진 기준에 따라 적어도 하나의 단어 영역으로 구분하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17항에 있어서,상기 콘텐츠의 스트로크를 분석하는 동작은,상기 콘텐츠에 포함된 적어도 하나의 단어 영역을 맵핑하여 적어도 하나의 라인(line)을 생성하고, 및상기 적어도 하나의 라인에 대한 정보에 기초하여 라인 리스트(line list)를 생성하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서,상기 콘텐츠의 스트로크를 분석하는 동작은,상기 라인 리스트에 기초하여, 상기 콘텐츠에서 분석하고자 하는 영역을 벗어나지 않는 적어도 하나의 단어 영역을 라인 별로 획득하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0090218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 12항에 있어서,상기 콘텐츠의 스트로크를 분석하는 동작은,상기 콘텐츠의 모든 라인에 대한 스트로크 분석을 하나의 스레드에서 수행하거나,또는 각 라인에 대응하는 별개의 스레드에서 수행하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0090218", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따른 전자 장치는, 롤러블 디스플레이, 메모리, 및 상기 롤러블 디스플레이 및 상기 메모리와 작동적으로(operatively) 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 롤러블 디스플레이에 적어도 하나 의 스트로크(stroke)로 이루어진 콘텐츠(contents)를 표시하고, 사용자의 디스플레이 확장 요청에 대응하여 상기 롤러블 디스플레이를 확장하고, 상기 롤러블 디스플레이의 확장을 수행하는 동안, 제1시점에 상기 콘텐츠의 제1 영역에 포함된 적어도 하나의 스트로크를 분석하고, 분석한 스트로크에 대응하는 제1텍스트를 상기 콘텐츠의 일 측에 표시하고, 제2시점에 상기 제1영역을 포함하는 제2영역에 포함된 적어도 하나의 스트로크를 분석하고, 분석 한 스트로크에 대응하는 제2텍스트를 상기 콘텐츠의 일 측에 표시할 수 있다. 그 외에 다양한 실시예가 가능하다."}
{"patent_id": "10-2021-0090218", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서는 전자 장치에 관한 것이며, 예를 들어 롤러블 디스플레이를 포함하는 전자 장치에서 필기를 인식하는 방법에 관한 발명이다."}
{"patent_id": "10-2021-0090218", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이동통신 기술 및 하드웨어/소프트웨어 기술의 발달에 따라 휴대용 전자 장치(이하, 전자 장치)는 종래의 통화 기능에서 나아가 다양한 기능들을 구현할 수 있게 되었다. 전자 장치는 터치 센서를 내장할 수 있으며, 터치 센 서를 이용하여 디스플레이에 대한 사용자 터치 입력 또는 제스처를 감지할 수 있다. 전자 장치는 디바이스에 대 한 사용자 입력을 감지하여 스트로크(stroke)를 디스플레이 상에 표시할 수 있다. 또한, 전자 장치는 가로 방향(또는 세로 방향)으로 슬라이드하여 디스플레이를 확장할 수 있는 롤러블 디바이스 일 수 있다. 전자 장치는 사용자 입력 또는 버튼 입력에 대응하여 롤러블 디스플레이를 확장할 수 있으며, 이와 연계하여 사용할 수 있는 다양한 기능을 제공할 수 있다. 예를 들어, 전자 장치는 롤러블 디스플레이가 확장됨 에 따라 발생하는 디스플레이의 확장 영역에 추가적인 문자 또는 그래픽 객체를 표시할 수 있다. 전자 장치는 사용자가 입력한 필기를 인식하여 이를 텍스트화(handwriting recognition, HWR)할 수 있다. 다양한 실시예에 따르면, 전자 장치에서 제공할 수 있는 필기 인식 기술은 이미지 또는 그림 파일에 포함된 문 자를 텍스트화하는 오프라인 필기 인식(offline handwriting recognition), 및 PDA 또는 디지타이저(digitizer)와 같은 포인팅 디바이스(pointing device)의 팁 움직임(tip movement)을 감지하여 이를 텍스트화 하는 온라인 필기 인식(online handwriting recognition)을 포함할 수 있다."}
{"patent_id": "10-2021-0090218", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래의 롤러블 디바이스에서 스트로크를 인식할 때, 롤러블 디스플레이가 모두 확장된 이후에 텍스트를 분석하 여 디스플레이에 표시했다. 단어 인식기술을 이용하여, 화면이 넓어지는 시간 동안 문장을 분석한 후 디스플레 이의 확장이 완료된 이후 한꺼번에 표시하였다. 이로 인하여 디스플레이가 확장되는 동안 생성한 텍스트를 표시 할 수 없어 딜레이(delay)가 발생하는 문제가 있었다. 또한, 화면 내에 표시된 모든 스트로크를 한번에 분석하기 때문에 하드웨어 성능이 떨어지거나, 화면 내의 스트 로크 양이 많은 경우에는 결과 출력이 늦어지거나 버퍼링이 걸리는 문제점이 있었다. 본 문서의 다양한 실시예들은 상기와 같이 롤러블 디바이스에서 디스플레이의 확장과 함께 필기 인식을 수행하 는 경우, 프로세서 자원을 효율적으로 활용하여 신속한 결과 출력을 진행하는 방법을 제공함에 그 목적이 있다."}
{"patent_id": "10-2021-0090218", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따른 전자 장치는, 롤러블 디스플레이, 메모리, 및 상기 롤러블 디스플레이 및 상기 메모리와 작동적으로(operatively) 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 롤러블 디스플레이에 적어도 하 나의 스트로크(stroke)로 이루어진 콘텐츠(contents)를 표시하고, 사용자의 디스플레이 확장 요청에 대응하여 상기 롤러블 디스플레이를 확장하고, 상기 롤러블 디스플레이의 확장을 수행하는 동안, 제1시점에 상기 콘텐츠 의 제1영역에 포함된 적어도 하나의 스트로크를 분석하고, 분석한 스트로크에 대응하는 제1텍스트를 상기 콘텐 츠의 일 측에 표시하고, 제2시점에 상기 제1영역을 포함하는 제2영역에 포함된 적어도 하나의 스트로크를 분석 하고, 분석한 스트로크에 대응하는 제2텍스트를 상기 콘텐츠의 일 측에 표시할 수 있다. 다양한 실시예에 따른 롤러블 디스플레이를 이용한 필기 인식 방법은, 롤러블 디스플레이에 적어도 하나의 스트 로크로 이루어진 콘텐츠를 표시하는 동작, 및 사용자의 디스플레이 확장 요청에 대응하여 상기 롤러블 디스플레 이를 확장하는 동작을 포함하고, 상기 롤러블 디스플레이의 확장을 수행하는 동안, 제1시점에 상기 콘텐츠의 제 1영역에 포함된 적어도 하나의 스트로크를 분석하는 동작, 분석한 스트로크에 대응하는 제1텍스트를 상기 콘텐 츠의 일 측에 표시하는 동작, 제2시점에 상기 제1영역을 포함하는 제2영역에 포함된 적어도 하나의 스트로크를 분석하는 동작, 및 분석한 스트로크에 대응하는 제2텍스트를 상기 콘텐츠의 일 측에 표시하는 동작을 포함할 수 있다."}
{"patent_id": "10-2021-0090218", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예에 따르면, 전자 장치는 롤러블 디스플레이가 확장되는 동안 주어진 영역을 분석하고 각 라인 별 단어 영역 단위로 스트로크를 인식하여 수행 결과를 보여줌으로써, 주어진 영역에 대한 결과를 빠르게 출력할 수 있다. 이에 따라 전자 장치는 처리해야 할 스트로크가 많을 때, 전자 장치의 로드(load)가 심하거나 사양이 떨어지는 경우에도 사용자에게 심리스(seamless) 디스플레이를 제공할 수 있다. 그 외에 본 전자 장치의 다양한 실시예들로 인하여 얻을 수 있거나 예측되는 효과에 대해서는 전자 장치의 실시 예에 대한 상세한 설명에서 직접적으로 또는 암시적으로 개시하도록 한다. 예컨대, 전자 장치의 다양한 실시예 들에 따라 예측되는 다양한 효과에 대해서는 후술될 상세한 설명 내에서 개시될 것이다."}
{"patent_id": "10-2021-0090218", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시 예를 첨부된 도면에 의거하여 상세히 설명한다."}
{"patent_id": "10-2021-0090218", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "실시 예를 설명함에 있어서 본 발명이 속하는 기술분야에 익히 알려져 있고 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 또한, 실질적으로 동일한 구성과 기능을 가진 구성 요소들에 대해서는 상세한 설명을 생략하도록 한다. 마찬가지의 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 또는 개략적으로 도시되었으며, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 따라서 본 발명은 첨부한 도면에 그려진 상 대적인 크기나 간격에 의해 제한되어지지 않는다. 도 1은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서 버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메 모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통 신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장 치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안 테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가 적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상 기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전 자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제 공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용 한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다.본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2a는 일 실시예에 따른 닫힌 상태(closed state)의 전자 장치에 관한 전면 사시도이다. 도 2b는 일 실 시예에 따른 닫힌 상태의 전자 장치에 관한 후면 사시도이다. 도 3a는 일 실시예에 따른 열린 상태(open state)의 전자 장치에 관한 전면 사시도이다. 도 3b는 일 실시예에 따른 열린 상태의 전자 장치에 관 한 후면 사시도이다. 다양한 실시예에 따르면, 도 2a의 전자 장치는 도 1의 전자 장치를 포함할 수 있다. 도 2a, 2b, 3a, 및 3b를 참조하면, 일 실시예에서, 전자 장치는 슬라이딩 방식으로 화면을 확장시킬 수 있도록 구현될 수 있다. 예를 들어, 화면은 플렉서블 디스플레이 중 외부로 보여지고 있는 영역 일 수 있다. 도 2a 및 2b는 화면이 확장되지 않은 상태의 전자 장치를 도시하고, 도 3a 및 3b는 화 면이 확장된 상태의 전자 장치를 도시한다. 화면이 확장되지 않은 상태는 디스플레이의 슬라이딩 운동(sliding motion)을 위한 슬라이딩 플레이트가 슬라이드 아웃(slide-out)되지 않은 상태로서 이하 '닫힌 상태'로 지칭될 수 있다. 화면이 확장된 상태는 슬라이딩 플레이트의 슬라이드 아웃에 의해 화면이 더 이상 확장되지 않는 최대로 확장 된 상태로서 이하 '열린 상태'로 지칭될 수 있다. 예를 들어, 슬라이드 아웃은 전자 장치가 닫힌 상태에서 열린 상태로 전환될 때 슬라이딩 플레이트가 제 1 방향(예: +x 축 방향)으로 적어도 일부 이동하는 것일 수 있다. 다양한 실시예에 따르면, 열린 상태는 닫힌 상 태와 비교하여 화면이 확장된 상태로서 정의될 수 있고, 슬라이딩 플레이트의 이동 위치에 따라 다양한 사이즈의 화면을 제공할 수 있다. 다양한 실시예에 따르면, 중간 상태(intermediated state)는 도 2a의 닫 힌 상태 및 도 3a의 열린 상태 사이의 상태를 가리킬 수 있다. 화면 은 시각적으로 노출되어 이미지를 출 력 가능하게 하는 플렉서블 디스플레이의 액티브 영역(active area)을 포함할 수 있고, 전자 장치는 슬라이딩 플레이트의 이동 또는 플렉서블 디스플레이의 이동에 따라 액티브 영역을 조절할 수 있다. 이하 설명에서, 열린 상태는 화면이 최대로 확장된 상태를 가리킬 수 있다. 어떤 실시예에서, 도 2a의 전 자 장치에 슬라이딩 운동 가 능하게 배치되어 화면을 제공하는 플렉서블 디스플레이는 '슬라이 드 아웃 디스플레이(slide-out display) 또는 '익스펜더블 디스플레이(expandable display)'로 지칭될 수도 있 다. 일 실시예에 따르면, 전자 장치는 플렉서블 디스플레이와 관련된 슬라이딩 구조를 포함할 수 있다. 예를 들어, 외력에 의해 플렉서블 디스플레이가 설정된 거리로 이동되면, 슬라이딩 구조에 포함된 탄력 구 조로 인해, 더 이상의 외력 없이도 닫힌 상태에서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환될 수 있 다(예: 반자동 슬라이드 동작). 어떤 실시예에 따르면, 전자 장치에 포함된 입력 장치를 통해 신호가 발생되면, 플렉서블 디스플레이(23 0)와 연결된 모터와 같은 구동 장치로 인해 전자 장치는 닫힌 상태에서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환할 수 있다. 예를 들어, 하드웨어 버튼, 또는 화면을 통해 제공되는 소프트웨어 버튼을 통해 신호가 발생되면, 전자 장치는 닫힌 상태에서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환될 수 있 다. 다양한 실시예에 따르면, 압력 센서와 같은 다양한 센서로부터 신호가 발생되면, 전자 장치는 닫힌 상태에 서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환될 수 있다. 예를 들어, 전자 장치를 손으로 휴대하 거나 파지할 때 손의 일부(예: 손 바닥 또는 손가락)가 전자 장치의 지정된 구간 내를 가압하는 스퀴즈 제 스처(squeeze gesture)가 센서를 감지될 수 있고, 이에 대응하여 전자 장치는 닫힌 상태에서 열린 상태로, 또는 열린 상태에서 닫힌 상태로 전환될 수 있다. 일 실시예에 따르면, 디스플레이는 제 2 구간(②)(도 3a 참조)을 포함할 수 있다. 제 2 구간(②)은 전자 장치의 닫힌 상태에서 열린 상태로 전환될 때 화면의 확장된 부분을 포함할 수 있다. 전자 장치 가 닫힌 상태에서 열린 상태로 전환될 때, 제 2 구간(②)은 미끄러지듯 전자 장치의 내부 공간으로부 터 인출되고, 이로 인해 화면이 확장될 수 있다. 전자 장치가 열린 상태에서 닫힌 상태로 전환될 때, 제 2 구간(②)의 적어도 일부는 미끄러지듯 전자 장치의 내부 공간으로 인입되고, 이로 인해 화면 이 축소될 수 있다. 전자 장치가 열린 상태에서 닫힌 상태로 전환될 때, 제 2 구간 (②)의 적어도 일부는 휘어지면서 전자 장치의 내부 공간으로 이동될 수 있다. 예를 들어, 플렉서블 디스플레이는 폴리이미드(PI(polyimide)), 또는 폴리에스터(PET(polyester))를 포함하는 폴리머 소재로 형성된 유연한 기판 (예: 플라스틱 기판)을 포함할 수 있다. 제 2 구간(②)은 전자 장치가 열린 상태 및 닫힌 상태 사이를 전 환할 때 플렉서블 디스플레이에서 휘어지는 부분으로서, 예를 들어, 벤더블 구간(bendable section)으로 지칭될 수도 있다. 이하 설명에서는, 제 2 구간(②)은 벤더블 구간으로 지칭하겠다. 일 실시예에 따르면, 전자 장치는 하우징, 슬라이딩 플레이트, 또는 플렉서블 디스플레이 를 포함할 수 있다. 하우징(또는, 케이스(case))은, 예를 들어, 백 커버(back cover), 제 1 사이드 커버(side cover), 또는 제 2 사이드 커버를 포함할 수 있다. 백 커버, 제 1 사이드 커버, 또는 제 2 사이드 커버는 전자 장치의 내부에 위치된 지지 부재(미도시)에 연결될 수 있고, 전자 장치의 외관을 적어도 일부 형성할 수 있다. 백 커버는, 예를 들어, 전자 장치의 후면(200B)을 적어도 일부 형성할 수 있다. 일 실시예에서, 백 커버는 실질적으로 불투명할 수 있다. 예를 들어, 백 커버는 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의해 형성될 수 있다. 어떤 실시예에 따르면, 플렉서블 디스플레이의 벤더블 구간(②)이 하우징의 내부 공 간에 인입된 상태(예: 닫힌 상태)에서, 벤더블 구간(②)의 적어도 일부는 백 커버를 통해 외부로부터 보일 수 있게 배치될 수도 있다. 이러한 경우, 백 커버는 투명 소재 및/또는 반투명 소재로 형성될 수 있다. 일 실시예에 따르면, 백 커버는 평면부(212a), 및 평면부 (212a)를 사이에 두고 서로 반대편에 위치된 곡 면부들(212b, 212c)을 포함할 수 있다. 곡면부들(212b, 212c)은 백 커버의 양쪽 상대적으로 긴 에지들(미도시)에 각각 인접하여 형성되고, 백 커버와는 반대 편에 위치된 화면 쪽으로 휘어져 심리스하게 연장될 수 있다. 어떤 실시예에 따르면, 백 커버는 곡면부들(212b, 212c) 중 하나를 포함하거나 곡면부들(212b, 212c) 없이 구현될 수 있다. 일 실시예에 따르면, 제 1 사이드 커버 및 제 2 사이드 커버는 서로 반대편에 위치될 수 있다. 예를 들어, 제 1 사이드 커버 및 제 2 사이드 커버는 슬라이딩 플레이트의 슬라이드 아웃의 제 1 방 향(예: +x 축 방향)과는 직교하는 제 2 방향(예: y 축 방향)으로 플렉서블 디스플레이를 사이에 두고 서로 반대편에 위치될 수 있다. 제 1 사이드 커버는 전자 장치의 제 1 측면(213a)의 적어도 일부를 형성할 수 있고, 제 2 사이드 커버는 제 1 측면(213a)과는 반대 방향으로 향하는 전자 장치의 제 2 측면 (214a)의 적어도 일부를 형성할 수 있다. 제 1 사이드 커버는 제 1 측면(213a)의 에지로부터 연장된 제 1 테두리부(또는, 제 1 림(rim))(213b)를 포함할 수 있다. 예를 들어, 제 1 테두리부(213b)는 전자 장치의 일측 베젤(bezel)을 적어도 일부 형성할 수 있다. 제 2 사이드 커버는 제 2 측면(214a)의 에지로부터 연장 된 제 2 테두리부(또는, 제 2 림)(214b)를 포함할 수 있다. 예를 들어, 제 2 테두리부(214b)는 전자 장치 의 타측 베젤을 적어도 일부 형성할 수 있다. 일 실시예에 따르면, 도 2a의 닫힌 상태에서 제 1 테두리부(213 b)의 표면, 제 2 테두리부(214b)의 표면, 및 슬라이딩 플레이트의 표면은 매끄럽게 연결되어, 화면 의 제 1 곡면부(230b) 쪽에 대응하는 일측 곡면부(미도시)를 형성할 수 있다. 다양한 실시예에 따르면, 제 1 테 두리부(213b)의 표면 또는 제 2 테두리부(214b)의 표면은 제 1 곡면부(230b)와는 반대편에 위치된 화면의 제 2 곡면부(230c) 쪽에 대응하는 타측 곡면부(미도시)를 포함할 수 있다. 일 실시예에 따르면, 슬라이딩 플레이트는 전자 장치의 내부에 위치된 지지 부재(미도시) 상에서 슬 라이딩 운동을 할 수 있다. 플렉서블 디스플레이의 적어도 일부는 슬라이딩 플레이트에 배치될 수 있 고, 도 2a의 닫힌 상태 또는 도 3a의 열린 상태는 상기 지지 부재 상에서의 슬라이딩 플레이트의 위치에 기초하여 형성될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 접착 부재(또는 점착 부재)(미도시)를 통해 슬라이딩 플레이트(12 0)에 부착될 수 있다. 일 실시예에 따르면, 상기 접착 부재는 열반 응 접착 부재, 광반응 접착 부재, 일반 접착제 및/또는 양면 테이프를 포함할 수 있다. 어떤 실시예에 따르면, 플렉서블 디스플레이는 슬라이딩 플레이트에 형성된 리세스(recess)에 슬라이딩 방식으로 삽입되어 슬라이딩 플레이트에 배치 및 고정될 수 있다. 슬라이딩 플레이트는 플렉서블 디스플레이의 적 어도 일부를 지지하는 역할을 하며, 어떤 실시예에서는 디스플레이 지지 구조로 지칭될 수도 있다. 일 실시예에 따르면, 슬라이딩 플레이트는 전자 장치의 외면(예: 외부로 노출되어 전자 장치의 외관을 형성하는 면)을 형성하는 제 3 테두리부(220b)를 포함할 수 있다. 예를 들어, 제 3 테두리부(220b)는 도 2a의 닫힌 상태에서 제 1 테두리부(213b) 및 제 2 테두리부(214b)와 함께 화면 주변의 베젤을 형성할 수 있다. 제 3 테두리부(220b)는, 닫힌 상태에서, 제 1 사이드 커버의 일단부 및 제 2 사이드 커버의 일단부를 연결하도록 제 2 방향(예: y 축 방향)으로 연장될 수 있다. 예를 들어, 도 2a의 닫힌 상태에서 제 3 테두리부 (220b)의 표면은 제 1 테두리부(213b)의 표면 및/또는 제 2 테두리부(214b)의 표면과 매끄럽게 연결될 수 있다. 일 실시예에 따르면, 슬라이딩 플레이트의 슬라이드 아웃으로 인해, 벤더블 구간(②)의 적어도 일부는 전 자 장치의 내부로부터 밖으로 나오면서 도 3a에서와 같이 화면이 확장된 상태(예: 열린 상태)가 제 공될 수 있다. 일 실시예에 따르면, 도 2a의 닫힌 상태에서, 화면은 평면부(230a), 및 평면부(230a)를 사이에 두고 서로 반대편에 위치된 제 1 곡면부(230b) 및/또는 제 2 곡면부(230c)를 포함할 수 있다. 예를 들어, 제 1 곡면부 (230b) 및 제 2 곡면부(230c)는 평면부(230a)를 사이에 두고 실질적으로 대칭(symmetrical)일 수 있다. 예를 들어, 도 2a의 닫힌 상태에서, 제 1 곡면부(230b) 및/또는 제 2 곡면부(230c)는 백 커버의 곡면부들(212b, 212c)과 각각 대응하여 위치될 수 있고, 백 커버 쪽으로 휘어진 형태일 수 있다. 도 2a의 닫힌 상태에서 도 3a의 열린 상태로 전환되면, 평면부(230a)는 확장될 수 있다. 예를 들면, 도 2a의 닫힌 상태에서 제 2 곡면 부(230c)를 형성하는 벤더블 구간(②)의 일부 영역은, 도 2a의 닫힌 상태에서 도 3a의 열린 상태로 전환될 때 확장된 평면부(230a)에 포함되며 벤더블 구간(②)의 다른 영역으로 형성될 수 있다. 일 실시예에 따르면, 전자 장치는, 벤더블 구간(②)의 인입 또는 인출을 위한 오프닝(미도시), 및/또는 오 프닝에 위치된 풀리(pulley)(미도시)를 포함할 수 있다. 풀리는 벤더블 구간(②)에 대응하여 위치될 수 있고, 도 2a의 닫힌 상태 및 도 3a의 열린 상태 사이의 전환에서 풀리의 회전을 통해 벤더블 구간(②)의 이동 및 그 이동 방향이 안내될 수 있다. 제 1 곡면부(230b)는 슬라이딩 플레이트의 일면에 형성된 곡면에 대응하여 형성될 수 있다. 제 2 곡면부(230c)는 벤더블 구간(②) 중 풀리의 곡면에 대응하는 부분에 의해 형성될 수있다. 제 1 곡면부(230c)는 전자 장치의 닫힌 상태 또는 열린 상태에서 제 2 곡면부(230b)의 반대편에 위 치되어 화면의 심미성을 향상시킬 수 있다. 어떤 실시예에 따르면, 제 1 곡면부(230b) 없이 평면부(230 a)가 확장된 형태로 구현될 수도 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 터치 감지 회로 (예: 터치 센서)를 더 포함할 수 있다. 다양 한 실시예에 따르면(미도시), 플렉서블 디스플레이는 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/ 또는 자기장 방식의 펜 입력 장치(예: 스타일러스 펜)를 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 예를 들면, 디지타이저는 펜 입력 장치로부터 인가된 전자기 유도 방식의 공진 주파수를 검출할 수 있도 록 유전체 기판상에 배치되는 코일 부재를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 마이크 홀(예: 도 1의 입력 모듈), 스피커 홀(예: 도 1 의 음향 출력 모듈), 커넥터 홀 (예: 도 1의 연결 단자), 카메라 모듈(예: 도 1의 카메라 모듈 ), 또는 플래시를 포함할 수 있다. 다양한 실시예에 따르면, 플래시 는 카메라 모듈 에 포함하여 구현될 수도 있다. 어떤 실시예에서, 전자 장치는 구성 요소들 중 적어도 하나를 생략하거나 다른 구성 요소를 추가적으로 포함할 수 있다. 마이크 홀은, 예를 들어, 전자 장치의 내부에 위치된 마이크(미도시)에 대응하여 제 2 측면(214a)의 적어도 일부에 형성될 수 있다. 마이크 홀의 위치는 도 2a의 실시예에 국한되지 않고 다양할 수 있다. 어 떤 실시 예에 따르면, 전자 장치는 소리의 방향을 감지할 수 있는 복수의 마이크들을 포함할 수 있다. 스피커 홀은, 예를 들어, 전자 장치의 내부에 위치된 스피커에 대응하여 제 2 측면(214a)의 적어도 일부에 형성될 수 있다. 스피커 홀 의 위치는 도 2a의 실시예에 국한되지 않고 다양할 수 있다. 다양한 실 시예에 따르면, 전자 장치는 통화용 리시버 홀을 포함할 수 있다. 어떤 실시예에서는 마이크 홀 및 스피커 홀이 하나의 홀로 구현되거나, 피에조 스피커와 같이 스피커 홀이 생략될 수 있다. 커넥터 홀은, 예를 들어, 전자 장치의 내부에 위치된 커넥터(예: USB 커넥터)에 대응하여 제 2 측면 (214a)의 적어도 일부에 형성될 수 있다. 전자 장치는 커넥터 홀을 통해 커넥터와 전기적으로 연결된 외부 전 자 장치와 전력 및/또는 데이터를 송신 및/또는 수신할 수 있다. 커넥터 홀의 위치는 도 2a의 실 시예에 국한되지 않고 다양할 수 있다. 카메라 모듈 및 플래시는, 예를 들어, 전자 장치의 후면(200B)에 위치될 수 있다. 카메라 모듈 은 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 플래시 는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 어떤 실시예 에서는, 2개 이상의 렌즈들(적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 위치될 수 있 다. 다양한 실시예에 따르면, 도 2b 또는 3b의 실시예에 국한되지 않고, 전자 장치는 복수의 카메라 모듈 들을 포함할 수 있다. 카메라 모듈은 복수의 카메라 모듈들 중 하나일 수 있다. 예를 들면, 전자 장치 는 각각 다른 속성(예: 화각) 또는 기능을 가진 복수의 카메라 모듈들(예: 듀얼 카메라, 또는 트리플 카메 라)을 포함할 수 있다. 예를 들면, 서로 다른 화각을 갖는 렌즈를 포함하는 카메라 모듈(예: 카메라 모듈(25 4))이 복수 개로 구성될 수 있고, 전자 장치는 사용자의 선택에 기반하여, 전자 장치에서 수행되는 카메라 모듈의 화각을 변경하도록 제어할 수 있다. 또한, 복수의 카메라 모듈들은, 광각 카메라, 망원 카메라, 컬러 카메라, 흑백(monochrome) 카메라, 또는 IR(infrared) 카메라(예: TOF(time of flight) camera, structured light camera) 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, IR 카메라는 센서 모듈(미도 시)의 적어도 일부로 동작될 수 있다. 다양한 실시예에 따르면(미도시), 전자 장치는 화면이 향하는 방향으로 놓인 전자 장치의 일면 (예: 전면(200A))을 통해 광을 수신된 광을 기초로 이미지 신호를 생성하는 카메라 모듈(예: 전면 카메라)을 더 포함할 수 있다. 예를 들어, 카메라 모듈은, 도 2b 또는 3b의 실시예에 국한되지 않고, 플렉서블 디스플레 이에 형성된 오프닝(예: 관통 홀, 또는 노치(notch))과 정렬되어 하우징의 내부에 위치될 수 있다. 카메라 모듈은 상기 오프닝, 및 상기 오프닝과 중첩된 투명 커버의 일부 영역을 통해 광을 수신하여 이미 지 신호를 생성할 수 있다. 상기 투명 커버는 플렉서블 디스플레이를 외부로부터 보호하는 역할을 하며, 예를 들어, 폴리이미드 또는 울트라신글라스(UTG(ultrathin glass)와 같은 물질을 포함할 수 있다. 어떤 실시예에 따르면, 도 2b 또는 3b의 실시예에 국한되지 않고, 카메라 모듈은 플렉서블 디스플레이 의 화면의 적어도 일부의 하단에 배치될 수 있고, 카메라 모듈의 위치가 시각적으로 구별(또는 노출)되지 않고 관련 기능(예: 이미지 촬영)을 수행할 수 있다. 이 경우, 예를 들어, 화면 의 위에서 볼때(예: -z 축 방향으로 볼 때), 카메라 모듈은 화면 의 적어도 일부에 중첩되게 배치되어, 외부로 노출되지 않으면서, 외부 피사체의 이미지를 획득할 수 있다. 다양한 실시예에 따르면, 전자 장치는 키 입력 장치 (예: 도 1의 입력 모듈)를 더 포함할 수 있다. 키 입력 장치는, 예를 들어, 제 1 사이드 커버에 의해 형성된 전자 장치의 제 1 측면(213a)에 위치될 수 있다. 어떤 실시예에서, 키 입력 장치는 적어도 하나의 센서 모듈을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치는 다양한 센서 모듈(예: 도 1의 센서 모듈)을 포함할 수 있다. 센서 모듈은 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값 을 생성할 수 있다. 예를 들어, 센서 모듈은 화면이 향하는 방향으로 놓인 전자 장치의 전면(200A) 을 통해 광을 수신된 광을 기초로 외부 물체의 근접에 관한 신호를 생성하는 근접 센서를 포함할 수 있다. 다른 예를 들어, 센서 모듈은 전자 장치의 전면(200A) 또는 후면(200B)을 통해 수신된 광을 기초로 생체에 관한 정보를 검출하기 위한 지문 센서, 또는 HRM 센서와 같은 다양한 생체 센서를 포함할 수 있다. 전자 장치는 다양한 다른 센서 모듈, 예를 들어, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 포 함할 수 있다. 다양한 실시예에 따르면, 도 2a, 2b, 3a, 및 3c의 실시예에 국한되지 않고, 전자 장치는 슬라이딩 플레이 트의 슬라이드 아웃시 제 3 테두리부(220b) 쪽에서 화면이 확장되는 구조로 구현될 수도 있다. 예를 들어, 도 2a의 닫힌 상태에서 제 1 곡면부(230b)를 형성하는 플렉서블 디스플레이의 일부 영역은, 도 2a의 닫힌 상태에서 도 3a의 열린 상태로 전환될 때 확장된 평면부(230a)에 포함되며, 플렉서블 디스플레이의 다른 영역으로 형성될 수 있다. 도 4는 다양한 실시예에 따른 전자 장치의 디스플레이가 확장함에 따라 순차적으로 필기를 인식하는 것을 도시 한 것이다. 다양한 실시예에 따르면, 전자 장치는 디스플레이에 대한 필기 수단(예: 스타일러스)의 터치 입력을 인식 할 수 있다. 전자 장치는 압력 센서, 터치 센서와 같은 센서 장치를 통해 필기 수단과 디스플레이의 접촉 지점을 감지할 수 있다. 예를 들어, 전자 장치는 디스플레이 상에서 발생하는 압력의 변화 또는 전류의 흐 름을 감지하고, 해당 지점에서 필기 수단에 의한 터치 입력이 발생하였다고 판단할 수 있다. 다양한 실시예에 따르면, 전자 장치는 사용자 입력에 대응하여 디스플레이의 일 하우징을 확장할 수 있다. 일 실시예에 따르면, 전자 장치는 하우징의 일 측에 디스플레이를 확장하기 위해 삽입된 버튼 돌기를 포함 한 버튼 부재를 구비할 수 있다. 사용자는 버튼 부재를 조작하여 디스플레이의 확장을 지시할 수 있다. 전자 장 치는 상기 버튼에 대한 사용자의 조작을 감지하고, 구동 모터를 제어하여 디스플레이를 확장할 수 있다. 다양한 실시예에 따르면, 전자 장치는 디스플레이에 표시된 콘텐츠를 인식하여 스트로크 분석을 수행할 수 있다. 전자 장치는 광학 문자 인식(optical character recognition, OCR)을 이용하여 사람이 쓰거나 기계 로 인쇄한 텍스트의 형상을 인식할 수 있다. 일 실시예에 따르면, 전자 장치는 서체를 분석하기 위한 샘플 (sample)을 획득하고, 이에 기초하여 스트로크 분석을 수행할 수 있다. 또는, 전자 장치는 대량의 데이터 학습을 통하여 스트로크 분석 규칙을 생성하고, 이에 기초하여 스트로크 분석을 수행할 수 있다. 예를 들어, 전자 장치는 전처리(preprocessing), 분류(classification), 후처리(postprocessing)의 과정 을 거쳐 필기를 인식할 수 있다. 전자 장치는 전처리 과정에서 텍스트 영역을 구분하기 위하여 디스플레이 의 각 픽셀의 명암 대비 증가, 얼룩 제거, 라인 제거와 같은 작업을 수행할 수 있다. 이후 전자 장치는 미 리 구축한 필기 모델과 비교하여 가장 유사한 필기 패턴을 찾아내고, 알고리즘(예: 신경망(neural network), HMM(hidden Markov model), SVM(support vector machine))을 이용하여 결과 후보를 생성할 수 있다. 후처리 단 계에서는 대상 언어의 언어적 정보를 모델링(modeling)하여 언어 모델을 구축하고, 필기 인식 결과에서 나타난 오류를 수정하여 자연스러운 단어 또는 문장을 구성할 수 있다. 전자 장치는 스트로크의 삐침(hook), 크기 (size), 속도(speed), 및 기울기(skew, slant)를 분석하여 텍스트를 산출할 수 있다. 전자 장치는 분석한 콘텐츠를 텍스트화하여 디스플레이의 일 측에 표시할 수 있다. 다양한 실시예에 따르면, 전자 장치는 시간의 흐름에 따라서 순차적으로 콘텐츠의 분석 영역을 확대할 수 있다. 전자 장치는 시간의 흐름에 따라 콘텐츠의 더 넓은 영역에 있는 스트로크를 분석할 수 있다. 예를 들어, 전자 장치는 제1시점에 콘텐츠의 일부를 분석하여 제1텍스트를 생성하고, 생성한 제1텍스트를 콘텐츠의 일 측에 표시할 수 있다. 전자 장치는 디스플레이가 확장함에 따라 콘텐츠의 분석 영역 을 확장하고, 제2시점에 생성한 제2텍스트를 콘텐츠의 일 측에 표시할 수 있다. 이를 위하여 전자 장치 는 기준 시간을 결정하고, 기준 시간이 경과할 때마다 분석 영역을 결정하여 해당 영역 내에 있는 스트로 크를 텍스트화할 수 있다. 구체적인 스트로크 분석 방법에 대해서는 이하 도 5 내지 도 13을 통해 설명하도록 한다. 도 5는 다양한 실시예에 따른 전자 장치의 블록도이다. 도 5를 참조 하면, 전자 장치는 디스플레이, 구동 모터, 프로세서 및 메모리를 포함 할 수 있으며, 다양한 실시예에서, 도시된 구성 중 일부가 생략 또는 치환 될 수도 있다. 전자 장치는 도 1의 전자 장치의 구성 및/또는 기능 중 적어도 일부를 더 포함할 수 있다. 도시된(또는 도시되지 않은) 전 자 장치의 각 구성 중 적어도 일부는 상호 작동적으로(operatively), 기능적으로(functionally) 및/또는 전기적으로 (electrically) 연결될 수 있다. 다양한 실시예에 따르면, 디스플레이는 프로세서의 제어에 따라 다양한 영상을 표시할 수 있다. 디스 플레이는 액정 디스플레이(liquid crystal display(LCD)), 발광 다이오드(light-emitting diode(LED)) 디 스플레이, 마이크로 LED(micro LED) 디스플레이, QD(quantum dot) 디스플레이 또는 유기 발광 다이오드 (organic light-emitting diode(OLED)) 디스플레이 중 어느 하나로 구현될 수 있으며, 이에 한정되지는 않는다. 디스플레이는 사용자의 신체 일부(예: 손가락) 또는 입력 장치(예: 스타일러스 펜)를 이용한 터치 및/또는 근접 터치(또는 호버링) 입력을 감지하는 터치 스크린으로 형성될 수 있다. 디스플레이는 도 1의 디스플레이 모듈의 구성 및/또는 기능 중 적어도 일부를 포함할 수 있다. 다양한 실시예에 따르면, 디스플레이는 적어도 일부가 플렉서블(flexible) 할 수 있으며, 폴더블 (foldable) 디스플레이, 또는 롤러블(rollable) 디스플레이로 구현될 수도 있다. 다양한 실시예에 따르면, 구동 모터는 디스플레이를 제어하기 위한 회로로서, 예를 들어, DDI((display drive integrated circuit)) 또는 DDI 칩을 포함할 수 있다. 일 실시예에 따르면, 구동 모터 는 COP(chip on panel) 또는 COF(chip on film) 방식으로 배치되는 TDDI(touch display driver IC)를 포 함할 수 있다. 다양한 실시예에 따르면, 구동 모터는 DDI 패키지일 수 있다. DDI 패키지는 DDI(또는 DDI 칩), 타이밍컨트 롤러(T-CON), 그래픽 RAM(GRAM), 또는 전력 구동부(power generating circuits)를 포함할 수 있다. 다양한 실시예에 따르면, 메모리는 휘발성 메모리(예: 도 1의 휘발성 메모리) 및 비휘발성 메모리(예: 도 1의 비휘발성 메모리)를 포함하여, 다양한 데이터들을 일시적 또는 영구적으로 저장할 수 있다. 메모리는 도 1의 메모리의 구성 및/또는 기능 중 적어도 일부를 포함하고, 도 1의 프로그램 을 저장할 수 있다. 다양한 실시예에 따르면, 메모리는 프로세서에서 수행될 수 있는 다양한 인스트럭션(instruction)들 을 저장할 수 있다. 이와 같은 인스트럭션들은 프로세서에 의해 인식될 수 있는 산술 및 논리 연산, 데이 터 이동, 입출력 등과 같은 제어 명령을 포함할 수 있다. 다양한 실시예에 따르면, 프로세서는 전자 장치 각 구성요소들(예: 디스플레이, 구동 모터 , 메모리)과 작동적으로(operatively), 기능적으로(functionally), 및/또는 전기적으로 (electrically) 연결되어, 각 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 수행할 수 있는 구성일 수 있다. 프로세서는 도 1의 프로세서의 구성 및/또는 기능 중 적어도 일부를 포함할 수 있다. 다양한 실시예에 따르면, 프로세서가 전자 장치 상에서 구현할 수 있는 연산 및 데이터 처리 기능에 는 한정됨이 없을 것이나, 이하에서는 롤러블 디스플레이를 포함하는 전자 장치에서 필기를 인식하기 위한 다양 한 실시예에 대해 설명하기로 한다. 후술할 프로세서의 동작들은 메모리에 저장된 인스트럭션들을 로 딩(loading)함으로써 수행될 수 있다. 다양한 실시예에 따르면, 프로세서는 디스플레이 상에 콘텐츠를 표시할 수 있다. 프로세서는 전 자 장치에서 제공하는 다양한 어플리케이션의 그래픽 UI를 표시할 수 있으며, 문자, 그림, 영상과 같은 콘 텐츠를 표시할 수 있다. 일 실시예에 따르면, 프로세서는 디스플레이와 필기 수단(예: 스타일러스)의접촉 지점을 인식하여 스트로크(stroke)를 표시할 수 있다. 예를 들어, 사용자가 필기 수단을 이용하여 글씨를 쓰는 경우, 프로세서는 필기 수단과 디스플레이의 접촉 지점을 인식하여 적어도 하나의 점 또는 선으 로 이루어진 스트로크를 디스플레이 상에 나타낼 수 있다. 스트로크는 필기 수단과 디스플레이의 접 촉 지점 또는 복수의 접촉 지점을 연결한 선 형태로 표현될 수 있다. 다양한 실시예에 따르면, 프로세서는 디스플레이 확장 요청에 대응하여 디스플레이를 확장할 수 있다. 일 실시예에 따르면, 프로세서는 구동 모터를 제어하여 디스플레이를 확장할 수 있다. 일 실시예에 따르면, 전자 장치는 디스플레이의 확장을 요청하기 위한 구성 요소(예: 버튼)를 디스플레 이 하우징의 일 측에 구비할 수 있다. 또는, 디스플레이의 확장을 요청할 수 있는 그래픽 UI(예: 아 이콘)를 디스플레이에 표시할 수 있다. 프로세서는 디스플레이 확장 버튼 또는 이를 지시하는 그래픽 UI에 대한 사용자 입력에 대응하여, 구동 모터를 제어하여 디스플레이를 확장할 수 있다. 예 를 들어, 디스플레이는 하우징의 배치 방식에 따라서 가로로 확장될 수도 있고, 세로로 확장될 수도 있다. 다양한 실시예에 따르면, 프로세서는 콘텐츠를 구성하는 스트로크를 적어도 하나의 단어 영역으로 나눌 수 있다. 일 실시예에 따르면, 프로세서는 스트로크 사이의 간격이 정해진 길이 이상인 경우에는 서로 다른 구역으로 결정할 수 있다. 예를 들어, 디스플레이에 표시된 콘텐츠가 적어도 하나의 단어로 이루어진 경우, 프로세서는 띄어쓰기를 기준으로 각각의 단어를 하나의 단어 영역으로 결정할 수 있다. 프로세서 는 각 단어 영역 내 스트로크를 하나의 단어로 결정할 수 있다. 다양한 실시예에 따르면, 프로세서는 콘텐츠의 라인(line) 분석을 수행할 수 있다. 라인은 프로세서 가 콘텐츠 분석을 수행하는 단위이며, 프로세서는 적어도 하나의 라인을 동기적으로 또는 비동기적으로 분 석하여 텍스트를 인식할 수 있다. 하나의 라인은 적어도 하나의 단어 영역을 포함할 수 있다. 즉, 프로세서 는 적어도 하나의 단어 영역을 맵핑하여 적어도 하나의 라인을 생성할 수 있다. 프로세서는 단어 영 역의 배치에 따라 라인 방향을 다르게 설정할 수 있다. 예를 들어, 단어 영역이 좌우로 배열되어 있는 경우, 가 로 방향으로 라인을 설정할 수 있고, 단어 영역이 상하로 배열되어 있는 경우에는 세로 방향으로 라인을 설정할 수 있다. 다양한 실시예에 따르면, 프로세서는 라인 리스트를 생성할 수 있다. 라인 리스트는 프로세서가 생성 한 적어도 하나의 라인에 대한 정보를 포함할 수 있다. 즉, 프로세서는 각각의 라인 및 라인에 포함되는 단어 영역에 대한 정보를 맵핑하여 라인 리스트를 생성할 수 있다. 다양한 실시예에 따르면, 프로세서는 기준 시간(width)을 결정할 수 있다. 기준 시간은 프로세서가 콘텐츠 분석을 수행하는 시간 단위일 수 있다. 프로세서는 전자 장치의 CPU 성능에 대한 정보를 획득 하고, 이에 기초하여 기준 시간을 설정할 수 있다. 예를 들어, CPU 성능이 정해진 값 이상이면 많은 양의 스트 로크를 한 번에 분석할 수 있기 때문에 기준 시간을 길게 설정할 수 있다. 반대로, CPU 성능이 정해진 값 미만 이면 많은 양의 스트로크를 한 번에 처리하기에는 부담이 되므로 기준 시간을 짧게 설정할 수 있다. 일 실시예 에 따르면, 프로세서는 디스플레이가 최대로 확장하는데 걸리는 시간에 기초하여 기준 시간을 설정할 수 있다. 예를 들어, 디스플레이가 최대로 확장하는데 제1시간(예: 2초)만큼 걸리는 경우, 프로세서 는 디스플레이가 확장하는 동안 스트로크 분석 횟수(예: 4번)를 결정할 수 있다. 프로세서는 결정한 분석 횟수에 맞게 기준 시간을 결정(예: 0.5초)할 수 있다. 이하에서, 제1시점으로부터 기준 시간만큼 경과한 시간을 제2시점으로 하여 설명한다. 다양한 실시예에 따르면, 프로세서는 설정한 기준 시간에 기초하여 콘텐츠 분석을 수행할 영역을 결정할 수 있다. 프로세서는 기준 시간 동안 디스플레이가 확장한 길이에 기초하여 콘텐츠의 분석 영역을 결 정할 수 있다. 프로세서는 시간이 지날수록 콘텐츠의 더 넓은 영역을 분석할 수 있다. 예를 들어, 기준 시 간 동안 디스플레이가 전체 확장 길이의 제1비율만큼 확장한 경우, 프로세서는 콘텐츠에서 제1비율만 큼 차지하는 영역을 분석 영역으로 결정할 수 있다. 이하에서는 분석 영역은 프로세서가 제1시점에 콘텐츠 를 분석하는 제1영역 및 제2시점에 콘텐츠를 분석하는 제2영역을 포함하는 것으로 설명하나, 설명한 예시에 한 정하지 않는다. 다양한 실시예에 따르면, 프로세서는 분석 영역을 벗어나지 않는 적어도 하나의 단어 영역을 라인 별로 획 득할 수 있다. 프로세서는 분석 영역의 내부와 외부에 일정 부분씩 걸쳐 있는 단어 영역은 획득하지 않을 수 있다. 예를 들어, 제1시점에서 콘텐츠는 제1영역의 내부에 온전히 포함되는 제1단어 영역, 제1영역의 내부와 외부에 걸쳐 있는 제2단어 영역 및 제1영역의 외부에 위치하는 제3단어 영역을 포함할 수 있다. 이 경우, 프로 세서는 제1영역 내부에 온전히 포함되는 제1단 구역만을 제1시점에 분석하게 되며, 제2단어 영역 및 제3단어 영역은 분석하지 않을 수 있다. 다양한 실시예에 따르면, 프로세서는 획득한 단어 영역에 포함된 스트로크를 분석하여 텍스트를 생성할 수 있다. 프로세서는 필기 인식 알고리즘(예: linear matching, elasting matching, neural network, hidden markov model)에 기초하여 텍스트를 생성할 수 있다. 프로세서는 필기 모델을 이용하여 모델 라이브러리 (model library)를 구성하고, 입력된 필기를 저장된 모델과 비교하여 텍스트를 생성할 수 있다. 다양한 실시예에 따르면, 프로세서는 콘텐츠의 일 측에 생성한 텍스트를 표시할 수 있다. 예를 들어, 프로 세서는 제1시점에 제1영역에 포함된 단어 영역에 기초하여 생성한 제1텍스트를 콘텐츠의 일 측에 표시할 수 있고, 제2시점에 제2영역에 포함된 단어 영역에 기초하여 생성한 제2텍스트를 콘텐츠의 일 측에 표시할 수 있다. 일 실시예에 따르면, 프로세서는 한 번 분석한 영역에 대한 텍스트 정보는 메모리에 저장하고, 이후 동일한 영역에 대한 콘텐츠 분석을 수행할 경우에는 메모리에 저장되어 있는 정보를 참고하여 빠르게 텍스 트를 표시할 수 있다. 프로세서는 콘텐츠의 모든 스트로크의 분석이 완료될 때까지 기준 시간마다 분석 영 역을 확대하며 콘텐츠의 필기를 텍스트화할 수 있다. 도 6a 및 도 6b는 다양한 실시예에 따른 전자 장치가 스트로크를 분석하여 라인 리스트를 생성하는 것을 도시한 도면이다. 도 6a를 참조하면, 프로세서는 콘텐츠에서 스트로크의 적어도 일부를 포함하는 단어 영역을 생성할 수 있다. 다양한 실시예에 따르면, 프로세서는 단어 영역을 생성하기 위한 기준을 설정할 수 있다. 예를 들어, 프로세서는 하나의 스트로크는 하나의 단어 영역에 포함되는 것으로 설정하고, 이웃한 스트로크로부 터 정해진 간격(예: 3mm) 이상 떨어진 스트로크는 서로 다른 단어 영역에 포함되는 것으로 설정할 수 있다. 프로세서는 콘텐츠 전체를 스캔(scan)하여 적어도 하나의 스트로크를 포함하는 적어도 하나의 단어 영역을 생성할 수 있다. 일 실시예에 따르면, 프로세서는 모델 라이브러리를 구축하여 단어를 인식하고, 인식한 단어를 포함하는 단어 영역을 생성할 수 있다. 프로세서는 콘텐츠 전체를 분석하고, 해당 콘텐츠가 적어도 하나의 단 어로 이루어진 경우 각각의 단어를 포함하는 적어도 하나의 단어 영역을 생성할 수 있다. 도 6b를 참조하면, 프로세서는 적어도 하나의 단어 영역을 포함하는 라인을 생성할 수 있다. 라인 은 일정한 크기를 갖는 가상의 사각형 형태일 수 있다. 프로세서는 단어 영역의 배열에 기초하여 라 인을 생성할 수 있다. 예를 들어, 도 6b에 도시된 것처럼 단어 영역이 서로 가로로 배열된 경우 라인 도 가로가 긴 사각형 형태일 수 있다. 다양한 실시예에 따르면, 프로세서는 생성한 라인에 대한 정보에 기초하여 라인 리스트를 생성할 수 있다. 라인 리스트는 각 라인에 포함되는 단어 영역에 대한 정보를 포함할 수 있다. 일 실시예에 따르면, 프로세서는 기준 시간에 따른 분석 영역의 크기에 기초하여, 각 시점 별로 분석할 영역에 속하는 단어 영역 에 대한 정보를 라인 리스트에 저장할 수 있다. 예를 들어, 도 6b와 같은 콘텐츠에서, 프로세서는 \"Modi, who has ruled India since\"를 제1라인으로 결정하고, \"his young age\"를 제2라인으로 결정하고, \"has maintained his popularity\"를 제3라인으로 결정할 수 있다. 프로세서는 각 라인에 포함되는 단어를 맵핑하여 라인 리스트를 생성할 수 있다. 도 7은 다양한 실시예에 따른 전자 장치의 기준 시간에 따라 달라지는 분석 영역을 도시한 것이다. 도 7을 참조하면, 프로세서는 동일한 콘텐츠(예: 도 6의 콘텐츠) 상에서 전자 장치(예: 도 4의 전자 장치 또는 도 5의 전자 장치)의 CPU 성능 또는 콘텐츠에 포함된 스트로크의 양에 기초하여 기준 시간을 달리 결정할 수 있다. 일 실시예에 따르면, 프로세서는 CPU 성능에 기초하여 기준 시간을 결정할 수 있다. 예를 들어, CPU 성능이 낮으면 한 번에 분석할 수 있는 스트로크의 양이 적으므로 기준 시간을 짧게 결정할 수 있다 . CPU 성능이 높으면 한 번에 많은 양의 스트로크를 분석할 수 있으므로, 기준 시간을 길게 결정할 수 있 다. 일 실시예에 따르면, 프로세서는 콘텐츠에 포함된 스트로크의 양에 기초하여 기준 시간을 결정할 수 있다. 콘텐 츠에 포함된 스트로크가 많은 경우, 프로세서는 기준 시간을 짧게 설정하여 스트로크를 여러 번에 걸쳐 나눠서 분석할 수 있다. 반대로 콘텐츠에 포함된 스트로크가 적은 경우, 프로세서는 기준 시간을 길게 설정하여 스트로크를 분석할 수 있다. 도 8은 다양한 실시예에 따른 전자 장치가 콘텐츠의 단어 영역을 기준 시간 별로 인식하는 것을 도시한 것이다. 도 8을 참조하면, 프로세서는 동일한 콘텐츠(예: 도 6의 콘텐츠)에서 시간의 흐름에 따라 크기가 다른 영 역에 포함된 스트로크를 분석할 수 있다. 도 8은 프로세서가 4번에 걸쳐 콘텐츠의 스트로크를 모두 분석하는 실 시예를 도시한다. 프로세서는 단어 영역(예: 도 6의 단어 영역) 및 라인 리스트를 생성하여 기준 시간을 결정하고 스트로크를 분석할 수 있다. 다양한 실시예에 따르면, 제1시점에 프로세서는 기준 시점에 기초하여 분석할 제1영역을 결정할 수 있다. 예를 들어, 프로세서는 제1영역을 벗어나지 않는 단어 영역을 선택하여, 제1라인의 \"Modi\", 제2라인의 \"his\", 제3라인의\"has\", 제5라인의 \"to\", 제7라인의 \"in the\", 제8라인의 \"and\", 제9라인의 \"India's\"를 포함 하는 제1텍스트를 생성할 수 있다. 기준 시간이 경과한 제2시점에 프로세서는 제2영역을 결정하고, 제1라인의 \"Modi, who has\", 제2라인의 \"his young age\", 제3라인의\"has maintained\", 제4라인의 \"despite his\", 제5라인의 \"to grow India's\", 제6라인의 \"creating\", 제7라인의 \"in the\", 제8라인의 \"and providing\", 제9라인의 \"India's poorest\"를 포함하는 제2텍스트를 생성할 수 있다. 제3시점에 프로세서는 제3영역 을 결정하고, 제1라인의 \"Modi, who has ruled\", 제2라인의 \"his young age\", 제3라인의\"has maintained his\", 제4라인의 \"despite his continued\", 제5라인의 \"to grow India's\", 제6라인의 \"creating substantial\", 제7라인의 \"in the distribution of\", 제8라인의 \"and providing healthcare\", 제9라인의 \"India's poorest citizens\"를 포함하는 제3텍스트를 생성할 수 있다. 제4시점에 프로세서는 제4영역을 결정하고, 제1 라인의 \"Modi, who has ruled India since\", 제2라인의 \"his young age\", 제3라인의\"has maintained his popularity\", 제4라인의 \"despite his continued efforts\", 제5라인의 \"to grow India's economy\", 제6라인의 \"creating substantial advance\", 제7라인의 \"in the distribution of wealth\", 제8라인의 \"and providing healthcare to\", 제9라인의 \"India's poorest citizens\"를 포함하는 제4텍스트를 생성할 수 있다. 다양한 실시예에 따르면, 프로세서는 제1시점, 제2시점, 및 제3시점에 생성한 텍스트에 대한 정보를 저장하고, 다음 시점에 해당 정보를 활용할 수 있다. 예를 들어, 제1시점에 제1라인에서 생성한 \"Modi\"라는 텍스트를 제2 시점에 제1라인에 대한 텍스트를 생성할 때 그대로 활용하여 시간을 단축할 수 있다. 다양한 실시예에 따르면, 제4시점에 디스플레이(예: 도 5의 디스플레이)의 확장이 종료될 수 있다. 프로세 서는 디스플레이의 확장이 종료되는 시점에 콘텐츠의 모든 스트로크 분석이 끝나도록 기준 시간을 설정할 수 있 다. 도 9는 다양한 실시예에 따른 전자 장치가 각 라인마다 별도의 스레드를 이용하여 단어 영역을 시간별로 인식하 는 것을 도시한 것이다. 도 9를 참조하면, 프로세서는 시간의 흐름에 따라 분석 영역의 크기를 확대할 수 있다. 프로세서는 기 결정한 기준 시간에 기초하여 분석할 영역의 크기를 결정할 수 있다. 프로세서는 분석 영역을 벗어나지 않는 단어 영역 (예: 도 6의 단어 영역) 내에 위치하는 스트로크를 텍스트화할 수 있다. 프로세서는 제1시점에 제1영역에 위치하는 스트로크를 분석하고, 제1시점으로부터 기준 시간만큼 경과한 제2시점에 제2영역에 위치하는 스트로크 를 분석할 수 있다. 예를 들어, 도 9에서 프로세서는 제1시점에 제1영역을 분석하고, 제2시점에 제2영역을 분석할 수 있 다. 제1시점에 프로세서는 제1영역 내에 위치하는 \"Modi\", \"his\", \"has\", \"despite\", \"to grow\", \"in the\", \"and\"및\"India's\"를 분석한 제1텍스트를 생성할 수 있다. 프로세서는 제1영역을 벗어나는 단어 영역 에 대한 분석은 수행하지 않을 수 있다. 예를 들어, 제1라인(900a)의 \"who\", 제2라인의 \"young\"을 포함하는 단 어 영역은 제1영역에도 일부 포함되어 있으나, 나머지 영역이 제1영역을 벗어나므로 제1시점에 분석 을 수행하지 않을 수 있다. 같은 방식으로, 제2시점에 프로세서는 제2영역 내에 위치하는 \"Modi, who has\", \"his young age\", \"has maintained\", \"despite his\", \"to grow India's\", \"createing\", \"in the\", \"and providing\"및\"India'spoorest\"를 분석한 제2텍스트를 생성할 수 있다. 다양한 실시예에 따르면, 프로세서는 상기와 같이 분석한 텍스 트를 라인(예: 도 6의 라인)별로 나누어 표시할 수 있다. 즉, 프로세서는 제1라인(900b)의 스트로크를 텍 스트화한 내용과 제2라인의 스트로크를 텍스트화한 내용을 서로 다른 줄에 표시할 수 있다. 다양한 실시예에 따르면, 프로세서는 텍스트 분석을 수행할 때 라인 리스트를 참고할 수 있다. 라인 리스트에는 각 라인에 위치하는 단어 영역에 대한 정보가 포함되어 있으므로, 프로세서는 라인 리스트를 참고하여 각 라인 에 위치하는 단어에 대한 정보를 획득할 수 있다. 다양한 실시예에 따르면, 프로세서는 콘텐츠(예: 도 6의 콘텐츠)를 분석할 때, 기 분석한 내용에 대한 정 보를 활용할 수 있다. 예를 들어, 프로세서가 제2영역을 분석하는 경우, 제1영역에서 분석한 제1텍스 트에 대한 정보를 그대로 활용할 수 있다. 이를 위해 프로세서는 제1시점에 생성한 제1텍스트에 대한 정보를 메 모리(예: 도 5의 메모리)에 저장하고, 제2시점에 활용할 수 있다. 도 10은 다양한 실시예에 따른 전자 장치의 성능 지연으로 인하여 스트로크 인식이 지연되는 것을 나타낸 도면 이다. 다양한 실시예에 따르면, 프로세서는 각 라인(예: 도 6의 라인)에 대한 콘텐츠(예: 도 6의 콘텐츠) 분석을 동기적으로 또는 비동기적으로 수행할 수 있다. 콘텐츠 분석을 동기적으로 수행하는 경우, 모든 라인에 대한 스트로크 분석이 하나의 스레드에서 실행될 수 있고, 각 라인에 대한 분석 결과가 한번에 출력될 수 있다. 반면에 콘텐츠 분석을 비동기적으로 수행하는 경우, 모든 라인에 대한 스트로크 분석이 별도의 스레드에서 실행 될 수 있고, 각 라인에 대한 분석 결과가 독립적으로 출력될 수 있다. 다양한 실시예에 따르면, 프로세서가 콘텐츠 분석을 동기적으로 또는 비동기적으로 수행할 때, 전자 장치(예: 도 4의 전자 장치 또는 도 5의 전자 장치)의 성능 지연으로 인하여 스트로크 인식이 지연될 수 있다. 도 10은 전자 장치가 제1시점에 제1영역에 대한 스트로크 인식을 비동기적으로 수행하는 경우에 성능 지 연이 발생한 경우를 도시한 것이다. 제1시점에 제1라인 내지 제4라인(1000a)에 대한 분석은 정상적으로 진행되 었으나, 제5라인 내지 제9라인(1000b)에 대한 분석은 성능 지연으로 인하여 지연되고 있다. 이러한 경우 프로세 서는 제1라인 내지 제4라인(1000a)에 대한 분석 결과는 콘텐츠의 일 측에 표시하나, 제5라인 내지 제9라인 (1000b)에 대한 분석 결과는 표시하지 않을 수 있다. 다른 실시예에 따르면, 제5라인 내지 제9라인(1000b)에 대한 분석이 늦어지는 경우, 프로세서는 어떠한 텍스트 도 표시하지 않을 수 있다. 비동기적으로 분석이 진행되는 경우에는 어느 한 라인에 대한 분석이 지연되더라도 전체 콘텐츠에 대한 분석이 지연될 수 있다. 이러한 인식 지연은 제2시점이 되어 제2영역에 대한 분석이 정상적으로 진행된다면 해소될 수 있다. 도 11a 및 도 11b는 다양한 실시예에 따른 전자 장치의 디스플레이가 상하로 확장되는 실시예를 도시한 것이다. 다양한 실시예에 따르면, 전자 장치(예: 도 4의 전자 장치 또는 도 5의 전자 장치)의 디스플레이(예: 도 5의 디스플레이)는 상하로 확장될 수 있다. 프로세서는 도 6 내지 도 10에서 디스플레이가 좌우로 확장 되는 실시예에 대하여 설명한 바와 마찬가지로 콘텐츠(예: 도 6의 콘텐츠)를 분석할 수 있다. 도 6내지 도 10에서 설명한 내용과 동일한 내용에 대해서는 생략하고 설명하도록 한다. 다양한 실시예에 따르면, 프로세서는 디스플레이가 확장하는 방향으로 분석 영역을 확대할 수 있다. 디스플레이 가 좌우로 확장하는 실시예에서 프로세서가 분석 영역을 좌에서 우로(또는 우에서 좌로) 확대한 것과 같이, 프 로세서는 기준 시간에 기초하여 분석 영역을 위에서 아래로(또는 아래서 위로) 확대할 수 있다. 예를 들어, 제1 시점에 분석하는 제1영역은 콘텐츠의 상단에 위치할 수 있다. 프로세서는 제1시점에 생성한 제1텍스트 를 콘텐츠의 일 측에 표시할 수 있다. 이후 시간이 경과함에 따라 분석 영역은 아래 방향으로 확장될 수 있다. 프로세서는 제2시점에 생성한 제2텍스트를 콘텐츠의 일 측에 표시할 수 있다. 도 11b는 콘텐츠의 분석 영역에 대한 구체적인 실시예를 도시한다. 예를 들어, 프로세서가 제1시점에 콘텐츠를 분석하는 제1영역은 제1라인 및 제2라인의 \"Modi, who has ruled India since his young age,\"로 분석할 수 있 는 스트로크를 포함할 수 있다. 프로세서는 제1영역에 포함된 스트로크를 분석하여 콘텐츠의 상단에 표시할 수 있다. 기준 시간이 경과하고 제2시점에 콘텐츠를 분석하는 제2영역은 제1라인 내지 제4라인의 \"Modi, who has ruled India since his young age, has maintained his popularity despite his continued efforts\"로 분석할 수 있는 스트로크를 포함할 수 있다. 프로세서는 제2영역에 포함된 스트로크를 분석하여 콘텐츠의 상단에 표시할 수 있다. 도 12는 다양한 실시예에 따른 전자 장치의 디스플레이가 확장하지 않고 텍스트를 표시하는 실시예를 도시한 것 이다. 프로세서는 디스플레이(예: 도 5의 디스플레이)가 확장하지 않아도 콘텐츠(예: 도 6의 콘텐츠(61 0))를 분석하여 텍스트를 생성할 수 있다. 도 4 내지 도 11에서는 디스플레이가 확장하는 시간에 기초하 여 기준 시간을 결정했으나, 도 12의 실시예에서는 디스플레이의 확장 시간을 고려하지 않고 기준 시간을 결정할 수 있다. 프로세서는 전자 장치의 CPU 성능 및 콘텐츠에 포함된 스트로크의 양에 기초하여 기준 시간을 결정할 수 있다. 프로세서가 기준 시간에 따라서 스트로크를 분석하여 텍스트를 생성하는 동작에 대해서는, 앞서 도 4 내지 도 11의 실시예에서 설명한 바와 같으므로 설명하지 않는다. 다양한 실시예에 따르면, 프로세서는 콘텐츠의 일 영역 내에 별도의 그래픽 UI를 만들어 텍스트를 표시할 수 있다. 앞선 실시예에서는 디스플레이의 확장되는 영역에 텍스트를 표시하였으나, 도 12의 실시예에서 는 디스플레이가 확장하지 않으므로 콘텐츠 내부에 별도의 그래픽 UI를 만들어서 텍스트를 표시할 수 있다. 다양한 실시예에 따르면, 프로세서는 그래픽 UI에 표시된 텍스트를 복사 또는 변환할 수 있는 버튼을 더 표시할 수 있다. 프로세서는 복사 버튼에 대한 사용자 입력에 기초하여 그래픽 UI에 표시된 텍스트를 복 사하고, 이후 붙여넣기 명령에 따라 다른 화면에 동일한 텍스트를 붙여넣을 수 있다. 프로세서는 변환 버튼에 대한 사용자 입력에 기초하여, 현재 표시된 콘텐츠를 생성한 텍스트 파일로 변환할 수 있다. 다양한 실시예에 따른 전자 장치는, 롤러블 디스플레이, 메모리, 및 상기 롤러블 디스플레이 및 상기 메모리와 작동적으로(operatively) 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 롤러블 디스플레이에 적어도 하 나의 스트로크(stroke)로 이루어진 콘텐츠(contents)를 표시하고, 사용자의 디스플레이 확장 요청에 대응하여 상기 롤러블 디스플레이를 확장하고, 상기 롤러블 디스플레이의 확장을 수행하는 동안, 제1시점에 상기 콘텐츠 의 제1영역에 포함된 적어도 하나의 스트로크를 분석하고, 분석한 스트로크에 대응하는 제1텍스트를 상기 콘텐 츠의 일 측에 표시하고, 제2시점에 상기 제1영역을 포함하는 제2영역에 포함된 적어도 하나의 스트로크를 분석 하고, 분석한 스트로크에 대응하는 제2텍스트를 상기 콘텐츠의 일 측에 표시할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 제1시점으로부터 기준 시간만큼 경과한 시점을 상기 제2시점으 로 결정할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 콘텐츠에 포함된 스트로크의 양에 기초하여 상기 기준 시간을 결정할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 기준 시간 동안 상기 롤러블 디스플레이가 확장한 길이에 기초 하여, 상기 롤러블 디스플레이가 확장하는 방향으로 상기 제1영역을 확장하여 상기 제2영역을 결정할 수 있다. 다양한 실시예에 따르면, 상기 롤러블 디스플레이는 좌우 또는 상하로 확장할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 콘텐츠를 구성하는 스트로크를 정해진 기준에 따라 적어도 하 나의 단어 영역으로 구분할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 콘텐츠에 포함된 적어도 하나의 단어 영역을 맵핑하여 적어도 하나의 라인(line)을 생성하고, 및 상기 적어도 하나의 라인에 대한 정보에 기초하여 라인 리스트(line list)를 생성할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 라인 리스트에 기초하여, 상기 콘텐츠에서 분석하고자 하는 영 역을 벗어나지 않는 적어도 하나의 단어 영역을 라인 별로 획득할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 획득한 단어 영역에 포함된 스트로크 기초하여 생성한 텍스트 를 라인 별로 상기 콘텐츠의 일 측에 표시할 수 있다.다양한 실시예에 따르면, 상기 프로세서는, 상기 콘텐츠의 모든 라인에 대한 스트로크 분석을 하나의 스레드에 서 수행하거나, 또는 각 라인에 대응하는 별개의 스레드에서 수행할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 제1시점에 생성한 상기 제1텍스트에 대한 정보를 상기 메모리 에 저장하고, 상기 제2시점에 상기 제1텍스트에 대한 정보를 이용하여 상기 제2텍스트를 생성할 수 있다. 도 13은 다양한 실시예에 따른 전자 장치의 순서도이다. 다양한 실시예에 따르면, 동작 1302에서, 전자 장치(예: 도 4의 전자 장치 또는 도 5의 전자 장치)는 구동 모터(예: 도 5의 구동 모터)를 제어하여 디스플레이(예: 도 5의 디스플레이)를 확장할 수 있다. 전자 장치는 하우징의 일 측에 디스플레이를 확장하기 위해 삽입된 버튼 돌기를 포함한 버튼 부재를 구비할 수 있다. 또는, 디스플레이의 확장을 요청할 수 있는 그래픽 UI(예: 아이콘)를 디스플레이에 표시할 수 있다. 사용 자는 버튼 부재를 조작하여 디스플레이의 확장을 지시할 수 있다. 전자 장치는 상기 버튼에 대한 사용자의 조작 을 감지하고, 구동 모터를 제어하여 디스플레이를 확장할 수 있다. 일 실시예에 따르면, 디스플레이는 좌우(또 는 상하)로 확장될 수 있다. 다양한 실시예에 따르면, 동작 1304에서, 전자 장치는 스트로크를 분석하여 단어 영역(예: 도 6의 단어 영역 )을 결정할 수 있다. 일 실시예에 따르면, 전자 장치는 스트로크 사이의 간격이 정해진 길이 이상인 경우 에는 서로 다른 구역으로 결정할 수 있다. 전자 장치는 각 단어 영역 내 스트로크를 하나의 단어로 결정할 수 있다. 다양한 실시예에 따르면, 동작 1306에서, 전자 장치는 라인 리스트를 생성할 수 있다. 전자 장치는 콘텐츠(예: 도 6의 콘텐츠)의 라인(예: 도 6의 라인) 분석을 수행하여 적어도 하나의 단어 영역을 포함하는 라인 을 생성할 수 있다. 전자 장치는 적어도 하나의 단어 영역을 맵핑하여 적어도 하나의 라인을 생성하고, 이에 기 초하여 라인 리스트를 생성할 수 있다. 라인 리스트는 전자 장치가 생성한 적어도 하나의 라인에 대한 정보를 포함할 수 있다. 다양한 실시예에 따르면, 동작 1308에서, 전자 장치는 기준 시간을 결정할 수 있다. 기준 시간은 전자 장치가 콘텐츠 분석을 수행하는 시간 단위로, 전자 장치의 CPU 성능에 대한 정보에 기초하여 기준 시간을 설정할 수 있 다. 일 실시예에 따르면, 전자 장치는 디스플레이가 최대로 확장하는데 걸리는 시간에 기초하여 기준 시간을 설 정할 수 있다. 다양한 실시예에 따르면, 동작 1310에서, 전자 장치는 콘텐츠의 분석 영역을 결정할 수 있다. 전자 장치는 기준 시간 동안 디스플레이가 확장한 길이에 기초하여 콘텐츠의 분석 영역을 결정할 수 있다. 전자 장치는 시간이 지 날 때마다 콘텐츠의 더 넓은 영역을 분석할 수 있다. 일 실시예에 따르면, 전자 장치는 디스플레이가 확장하는 방향으로 분석 영역을 확장할 수 있다. 다양한 실시예에 따르면, 동작 1312에서, 전자 장치는 분석 영역 내 단어 영역을 결정할 수 있다. 전자 장치는 분석 영역의 내부와 외부에 일정 부분씩 걸쳐 있는 단어 영역은 획득하지 않을 수 있다. 전자 장치는 분석 영역 에 포함되는 단어 영역을 결정하고, 단어 영역에 포함되는 스트로크를 분석하여 텍스트를 생성할 수 있다. 일 실시예에 따르면, 전자 장치는 한 번 분석한 스트로크에 대한 정보는 메모리(예: 도 5의 메모리)에 저장하 고, 이후에 동일한 스트로크에 대한 텍스트화를 진행할 때 해당 정보를 참조하여 빠르게 텍스트를 생성할 수 있 다. 다양한 실시예에 따르면, 전자 장치는 각 라인에 대한 콘텐츠 분석을 동기적으로 또는 비동기적으로 수행할 수 있다. 콘텐츠 분석을 동기적으로 수행하는 경우, 모든 라인에 대한 스트로크 분석이 하나의 스레드에서 실행될 수 있고, 각 라인에 대한 분석 결과가 한번에 출력될 수 있다. 반면에 콘텐츠 분석을 비동기적으로 수행하는 경 우, 모든 라인에 대한 스트로크 분석이 별도의 스레드에서 실행될 수 있고, 각 라인에 대한 분석 결과가 독립적 으로 출력될 수 있다. 다양한 실시예에 따르면, 동작 1314에서, 전자 장치는 콘텐츠의 일 측에 분석한 텍스트를 표시할 수 있다. 일 실시예에 따르면, 전자 장치는 디스플레이가 확장하면서 생겨난 영역에 텍스트를 표시할 수 있다. 생성한 텍스 트가 표시되는 영역의 크기는 디스플레이의 확장과 함께 커질 수 있다. 다양한 실시예에 따르면, 동작 1320에서, 전자 장치는 콘텐츠를 분석하여 텍스트 생성을 완료했는지 판단할 수 있다. 콘텐츠의 모든 스트로크를 분석한 경우, 전자 장치는 텍스트 생성을 종료할 수 있다. 일 실시예에따르면, 전자 장치는 디스플레이가 확장되는 시간에 기초하여 기준 시간을 결정하기 때문에, 디스플레이의 확장 이 종료됨과 동시에 모든 스트로크에 대한 분석을 완료할 수 있다. 다양한 실시예에 따른 롤러블 디스플레이를 이용한 필기 인식 방법은, 롤러블 디스플레이에 적어도 하나의 스트 로크로 이루어진 콘텐츠를 표시하는 동작, 및 사용자의 디스플레이 확장 요청에 대응하여 상기 롤러블 디스플레 이를 확장하는 동작을 포함하고, 상기 롤러블 디스플레이의 확장을 수행하는 동안, 제1시점에 상기 콘텐츠의 제 1영역에 포함된 적어도 하나의 스트로크를 분석하는 동작, 분석한 스트로크에 대응하는 제1텍스트를 상기 콘텐 츠의 일 측에 표시하는 동작, 제2시점에 상기 제1영역을 포함하는 제2영역에 포함된 적어도 하나의 스트로크를 분석하는 동작, 및 분석한 스트로크에 대응하는 제2텍스트를 상기 콘텐츠의 일 측에 표시하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 제2시점은 상기 제1시점으로부터 기준 시간만큼 경과한 시점일 수 있다. 다양한 실시예에 따르면, 상기 콘텐츠에 포함된 스트로크의 양에 기초하여 상기 기준 시간을 결정하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 제2영역에 포함된 적어도 하나의 스트로크를 인식하는 동작은, 상기 기준 시간 동안 상기 롤러블 디스플레이가 확장한 길이에 기초하여, 상기 롤러블 디스플레이가 확장하는 방향으로 상기 제 1영역을 확장하여 상기 제2영역을 결정하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 롤러블 디스플레이는 좌우 또는 상하로 확장하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 콘텐츠의 스트로크를 분석하는 동작은, 상기 콘텐츠를 구성하는 스트로크를 정해 진 기준에 따라 적어도 하나의 단어 영역으로 구분하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 콘텐츠의 스트로크를 분석하는 동작은, 상기 콘텐츠에 포함된 적어도 하나의 단 어 영역을 맵핑하여 적어도 하나의 라인(line)을 생성하고, 및 상기 적어도 하나의 라인에 대한 정보에 기초하 여 라인 리스트(line list)를 생성하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 콘텐츠의 스트로크를 분석하는 동작은, 상기 라인 리스트에 기초하여, 상기 콘텐 츠에서 분석하고자 하는 영역을 벗어나지 않는 적어도 하나의 단어 영역을 라인 별로 획득하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 콘텐츠의 스트로크를 분석하는 동작은, 상기 콘텐츠의 모든 라인에 대한 스트로 크 분석을 하나의 스레드에서 수행하거나, 또는 각 라인에 대응하는 별개의 스레드에서 수행하는 동작을 포함할 수 있다.도면 도면1 도면2a 도면2b 도면3a 도면3b 도면4 도면5 도면6a 도면6b 도면7 도면8 도면9 도면10 도면11a 도면11b 도면12 도면13"}
{"patent_id": "10-2021-0090218", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a는 일 실시예에 따른 닫힌 상태의 전자 장치에 관한 전면 사시도이다. 도 2b는 일 실시예에 따른 닫힌 상태의 전자 장치에 관한 후면 사시도이다. 도 3a는 일 실시예에 따른 열린 상태의 전자 장치에 관한 전면 사시도이다. 도 3b는 일 실시예에 따른 열린 상태의 전자 장치에 관한 후면 사시도이다. 도 4는 다양한 실시예에 따른 전자 장치의 디스플레이가 확장함에 따라 순차적으로 필기를 인식하는 것을 도시 한 것이다. 도 5는 다양한 실시예에 따른 전자 장치의 블록도이다. 도 6a 및 도 6b는 다양한 실시예에 따른 전자 장치가 스트로크를 분석하여 라인 리스트를 생성하는 것을 도시한 도면이다. 도 7은 다양한 실시예에 따른 전자 장치의 기준 시간에 따라 달라지는 분석 영역을 도시한 것이다. 도 8은 다양한 실시예에 따른 전자 장치가 콘텐츠의 단어 영역을 기준 시간 별로 인식하는 것을 도시한 것이다. 도 9는 다양한 실시예에 따른 전자 장치가 각 라인마다 별도의 스레드를 이용하여 단어 영역을 시간별로 인식하 는 것을 도시한 것이다. 도 10은 다양한 실시예에 따른 전자 장치의 성능 지연으로 인하여 스트로크 인식이 지연되는 것을 나타낸 도면 이다. 도 11a 및 도 11b는 다양한 실시예에 따른 전자 장치의 디스플레이가 상하로 확장되는 실시예를 도시한 것이다. 도 12는 다양한 실시예에 따른 전자 장치의 디스플레이가 확장하지 않고 텍스트를 표시하는 실시예를 도시한 것 이다. 도 13은 다양한 실시예에 따른 전자 장치의 순서도이다."}
