{"patent_id": "10-2023-0053300", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0156758", "출원번호": "10-2023-0053300", "발명의 명칭": "선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템", "출원인": "피노키오랩 주식회사", "발명자": "이성의"}}
{"patent_id": "10-2023-0053300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "진위 판별의 대상이 되는 물품으로부터 광학 촬상기가 획득한 영상에 기초하여, 상기 물품의 진위 여부를 판별하기 위한 시스템에 있어서,상기 물품의 제뉴인 컴퍼니(genuine company)로부터 미리 획득한 상기 물품에 대한 제뉴인 샷(genuine shoot)을미리 저장하여 보관하고 있으며, 상기 광학 촬상기가 촬영하여 전송하는 옵테인 샷(obtained shoot)을획득하여, 상기 제뉴인 샷과 상기 옵테인 샷의 미리 결정된 규칙에 따라, 상기 물품의 진위 여부를 전산적으로판별하는 진위 판별 유닛을 포함하는 것을 특징으로 하는, 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위여부 판별 시스템."}
{"patent_id": "10-2023-0053300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 진위 판별 유닛은,외부의 서버에 해당하는 상기 제뉴인 컴퍼니로부터 상기 물품에 대한 제뉴인 샷을 미리 획득하는 제뉴인 샷 획득부; 및상기 광학 촬상기가 촬영한 상기 물품의 옵테인 샷을 상기 광학 촬상기로부터 획득하는 옵테인 샷 획득부를 포함하는 것을 특징으로 하는, 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템."}
{"patent_id": "10-2023-0053300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 진위 판별 유닛은, 상기 미리 결정된 규칙에 따라 상기 제뉴인 샷의 레퍼런스 스캔(reference scan)을 획득하고, 상기 미리 결정된규칙에 따라 상기 옵테인 샷의 오브젝트 스캔(object scan)를 획득하는 벡터 설정부를 더 포함하는 것을 특징으로 하는, 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템."}
{"patent_id": "10-2023-0053300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 제뉴인 샷 획득부는,네트워크(network)를 통해 상기 제뉴인 컴퍼니로부터 상기 제뉴인 샷을 획득하는 제뉴인 샷 수신부; 및상기 제뉴인 컴퍼니로부터 지정된, 상기 물품의 미리 설정된 가변 영역을 지정하는 가변 영역 지정부를 포함하는 것을 특징으로 하는, 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템."}
{"patent_id": "10-2023-0053300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 제뉴인 샷 획득부는, 상기 가변 영역 지정부에 의해 지정된 상기 미리 설정된 가변 영역의 아웃 라인(outline)으로 설정되는 미리 설정된 가상의 경계 라인을 지정하고, 상기 미리 설정된 가상의 경계 라인의 바운더리(boundary)를 선택적으로 확장 또는 축소하는 영역 크기 설정부를 더 포함하는 것을 특징으로 하는, 선별적 영역 지정과 벡터 스캔을 통한물품의 진위 여부 판별 시스템.공개특허 10-2024-0156758-3-청구항 6 제5항에 있어서, 상기 옵테인 샷 획득부는,상기 물품으로부터 획득된 상기 옵테인 샷 중, 상기 미리 설정된 가변 영역을 타게팅하여 상기 미리 설정된 가변 영역만을 선택적으로 타게팅하는 영역 타게팅부; 상기 물품 중 상기 옵테인 샷의 상기 미리 설정된 가변 영역으로 타게팅된 부분에 상기 제뉴인 샷의 미리 설정된 스펙에 맞추어 확대 배율을 선택적으로 적용하는 줌 설정부; 상기 옵테인 샷의 상기 영역 타게팅부가 타게팅한 부분과 상기 타게팅된 부분의 상기 미리 설정된 스펙에 따라확대 배율에 맞추어진, 상기 옵테인 샷의 미리 설정된 가변 영역을 선택적으로 획득하는 타겟 획득부를 포함하는 것을 특징으로 하는, 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템."}
{"patent_id": "10-2023-0053300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 가변 영역 지정부는,상기 물품의 브랜드, 상기 물품의 년식, 상기 물품의 사이즈, 상기 물품의 컬러, 상기 물품의 시즌, 상기 물품의 버전 또는 상기 물품의 사용자 성별 중 적어도 하나 이상에 기초하여, 상기 미리 설정된 가변 영역을 적어도하나 이상을 선택적으로 지정할 수 있으며,상기 영역 타게팅부는,상기 가변 영역 지정부가 지정한 상기 미리 설정된 가변 영역에 따라, 상기 옵테인 샷의 미리 설정된 가변 영역을 지정하는 것을 특징으로 하는, 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템."}
{"patent_id": "10-2023-0053300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 벡터 설정부는,상기 미리 설정된 가변 영역 내에 무빙 벡터(moving vector)를 할당하는 무빙 벡터 할당부; 및상기 미리 설정된 가변 영역 내에 상기 무빙 벡터가 이동하는 경로로서 미리 설정된 무빙 라인을 설정하는 무빙라인 설정부를 포함하는 것을 특징으로 하는, 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템."}
{"patent_id": "10-2023-0053300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 무빙 라인 설정부는,상기 미리 설정된 무빙 라인을 상기 무빙 벡터 내에서 선택적으로 할당 가능한 것을 특징으로 하는, 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템."}
{"patent_id": "10-2023-0053300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 벡터 설정부는, i) 상기 제뉴인 샷의 상기 미리 설정된 가변 영역 내의 상기 무빙 벡터를 상기 미리 설정된 무빙 라인을 통해레퍼런스 스캔하며,ii) 상기 옵테인 샷의 상기 미리 설정된 가변 영역 내의 상기 무빙 벡터를 상기 미리 설정된 무빙 라인을 통해오브젝트 스캔하여,공개특허 10-2024-0156758-4-상기 레퍼런스 스캔과 상기 오브젝트 스캔의 상호 매칭을 진행하는 트래킹 스캔부를 더 포함하는 것을 특징으로하는, 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템."}
{"patent_id": "10-2023-0053300", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 진위 판별의 대상이 되는 물품으로부터 광학 촬상기가 획득한 영상에 기초하여, 물품의 진위 여부를 판별하기 위한 시스템으로서, 물품의 제뉴인 컴퍼니로부터 미리 획득한 물품에 대한 제뉴인 샷을 미리 저장하여 보관하고 있으며, 광학 촬상기가 촬영하여 전송하는 옵테인 샷(obtained shoot)을 획득하여, 제뉴인 샷과 옵테인 샷의 미리 결정된 규칙에 따라, 물품의 진위 여부를 전산적으로 판별하는 진위 판별 유닛을 포함하는 것을 특징 으로 기술적 사상을 개시한다."}
{"patent_id": "10-2023-0053300", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 물품의 진위 여부를 판별하기 위한 시스템에 관한 것으로서, 보다 자세하게는, 물품의 진위 여부의 판단의 기초가 되는 영역의 선별적 지정과 함께, 해당 영역에서의 무빙 벡터의 도입과 지정관 루트를 통한 스캔"}
{"patent_id": "10-2023-0053300", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "을 이용하여 물품의 진품과 가품의 여부를 효율적으로 선별하기 위한 시스템에 관한 기술분야이다."}
{"patent_id": "10-2023-0053300", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 한국의 명품 소비 시장 규모의 재평가는 안팎에서 각종 보고서와 언론 보도를 통해 드러나고 있다. '명품 의 나라'라고 알려진 이탈리아 현지에서도 '전 세계 명품이 한국으로 향하고 있다.' '한국은 전 세계 명품 시장 의 별이다.' 라는 보도까지 나올 정도다. 글로벌 럭셔리 하우스와 한국 파트너를 보유한 해외 브랜드들이 한국 을 거점으로 삼고 동남아시아 등 주요 미진출 국가로 유통을 확장해 가고 있는 셈이다. 실제 2021년 이후 한국에서 브랜드를 관리하며 브랜딩과 유통을 맡은 파트너와 계약을 종료하고 직접 한국 진출 을 선언한 브랜드만 어림잡아 8개가 넘는다. 중국 시장이 주춤한 사이 한국 시장이 알짜배기 시장으로 부상한 셈인데 최근 발표된 여러 자료를 통해서도 드러난다. 美 월가 최대 글로벌 투자 은행 모건스탠리가 지난달 발표한 보고서에 따르면 한국이 '1인당 명품 소비' 전 세 계 1위 국가에 올랐다. 지난해 한국인의 1인당 명품 소비액은 325달러, 우리 돈 약 40만 4천 원으로 미국 34만 8천 원, 중국 6만 8천 원 등을 제치고 1인당 소비규모로는 세계 최대를 기록했다. 2022년 한국 명품 소비시장 규모는 전년보다 24% 성장해 세계 6~7위 수준에 해당하는 168억달러(약 20조9000억 원)에 달했다고 발표했다. 1인당 기준으로 보면 한국인이 미국 280달러(약 34만원)와 중국 55달러(약 6만8000원)보다 많다. 시장조사업체 유로모니터에도 지난해 국내 명품시장 규모가 19조4488억원으로 전년보다 8.1% 성장한 것으로 분 석했다. 한국의 분석 업체들의 분석 내용도 같다. 앞서 지난해 한국 삼정KPMG가 공개한 럭셔리 시장을 이끄는 '뉴럭셔리 비즈니스 트렌드' 보고서도 비슷한 현상을 예고했다. 2021년 한국의 명품시장 규모는 전년대비 29.6% 급증한 58억달러(약 7조3천억원)로 조만간 70억달러(약 8조8천억원)에 이를 것으로 전망됐다. 명품의 수입과 더불어 이러한 명품에 대한 가품, 이른바 짝퉁의 수입과 유통 역시 성장세를 이어가고 있다. 가품의 수입과 이에 대한 판별은 전문가의 감별 작업을 통해 이루어지게 되는데, 수많은 가품의 전수 조사와 감 별은 사실상 불가능에 가깝다고 볼 수 있다. 가품의 진위 판별을 위하여, 일부 자동화된 기술적인 시도가 존재하고 있다. 예컨대, \"NFC 태그를 이용한 진품 판별 방법 및 장치(공개번호 제10-2013-0002147호, 특허문헌1)\"가 존재한다. 특허문헌1에 따른 발명의 경우, 진품 판별 서버가 진품 판별 서비스를 제공하는 방법으로서, 진정상품에 대한 정보를 진정상품의 식별 코드와 함께 진정상품 테이블에 등록하는 단계; 사용자 단말로부터 상품의 식별 코드가 포함된 진품 판별 요청을 수신하는 단계-사용자 단말은 상기 상품에 부착된 NFC 태그를 인식하여 상기 NFC 태그 에 저장된 상기 식별 코드를 추출함-; 및 진품 판별 요청에 포함된 상품의 식별 코드와 상기 진정상품 테이블을 이용하여 상품이 진품인지 여부를 판단하는 단계를 포함하는 진품 판별 방법이 제공된다. 또한, \"모조품 판별을 위한 인공지능 장치 및 방법(등록번호 제10-2202788호, 특허문헌2)\"이 존재한다. 특허문헌2의 발명에서는 모조품의 이미지를 인공 신경망으로 분석하여 판별하는 장치 및 방법이 개시된다. 특허 문헌2 발명의 일 실시예에 따른 인공지능 모조품 판별 장치는 영상을 촬영하는 카메라부, 사용자에게 데이터를출력하고 사용자의 입력 데이터를 수신하는 인터페이스부, 및 카메라부 및 인터페이스부를 제어하는 제어부를 포함하며, 제어부는 카메라부를 통하여 촬영된 확인 대상 객체의 영상을 인공 신경망으로 분석하여 확인 대상 객체가 진품인지 여부를 판단할 수 있다고 한다. 그리고 \"인공지능에 기반하여 모조품을 판별하는 방법 및 그 시스템(등록번호 제10-2307619호, 특허문헌3)\"도 존재한다. 특허문헌3에 따른 발명의 경우, 인공지능에 기반하여 모조품을 판별하는 방법 및 그 시스템에 관한 것이다. 또 한 특허문헌3의 발명은 모조품을 판별하기 위한 기술로서 특히, 모조품의 이미지를 인공 신경망으로 분석하여 판별하는 장치 및 방법에 관한 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개번호 제10-2013-0002147호 (특허문헌 0002) 등록번호 제10-2202788호 (특허문헌 0003) 등록번호 제10-2307619호"}
{"patent_id": "10-2023-0053300", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템은 상기한 바와 같은 종래 문제점을 해결하기 위해 안출된 것으로서, 다음과 같은 해결하고자 하는 과제를 제시한다. 첫째, 진품과 가품의 감정을 사람의 인적 노동에 의한 것이 아니라, 전산화된 시스템을 통해서 빠르고 정량적으 로 이루어질 수 있도록 한다. 둘째, 진품과 가품의 판단을 내리기 위한 기준 레퍼런스를 확립하고 이에 따라 불필요한 판단 작업을 원천 배제 하도록 한다. 셋째, 전수 조사가 사실상 힘든 현실적인 어려움을 극복하고, 전수 조사가 가능할 수 있는 시간 고효율적인 검 토 시스템을 제공하고자 한다. 본 발명의 해결 과제는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 해결과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0053300", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템은 상기의 해결하고자 하는 과제를 위하여 다음과 같은 과제 해결 수단을 가진다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템은 진위 판별의 대상이 되 는 물품으로부터 광학 촬상기가 획득한 영상에 기초하여, 상기 물품의 진위 여부를 판별하기 위한 시스템으로서, 상기 물품의 제뉴인 컴퍼니로부터 미리 획득한 상기 물품에 대한 제뉴인 샷을 미리 저장하여 보 관하고 있으며, 상기 광학 촬상기가 촬영하여 전송하는 옵테인 샷(obtained shoot)을 획득하여, 상기 제뉴인 샷 과 상기 옵테인 샷의 미리 결정된 규칙에 따라, 상기 물품의 진위 여부를 전산적으로 판별하는 진위 판별 유닛 을 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 상기 진위 판별 유닛은, 외부의 서버에 해당하는 상기 제뉴인 컴퍼니로부터 상기 물품에 대한 제뉴인 샷을 미리 획득하는 제뉴 인 샷 획득부; 및 상기 광학 촬상기가 촬영한 상기 물품의 옵테인 샷을 상기 광학 촬상기로부터 획득하는 옵테인 샷 획득부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 상기 진위 판별 유닛은, 상기 미리 결정된 규칙에 따라 상기 제뉴인 샷의 규칙 정보를 획득하고, 상기 미리 결정된 규칙에 따라 상기 옵테인 샷의 스캔 정보를 획득하는 벡터 설정부를 더 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 상기 제뉴인 샷 획득부는, 네트워크를 통해 상기 제뉴인 컴퍼니로부터 상기 제뉴인 샷을 획득하는 제뉴인 샷 수신부; 및 상기 제뉴인 컴퍼니로부터 지정된, 상기 물품의 미리 설정된 가변 영역을 지정하는 가변 영역 지정부를 포함하는 것 을 특징으로 할 수 있다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 상기 제뉴인 샷 획득부는, 상기 가변 영역 지정부에 의해 지정된 상기 미리 설정된 가변 영역의 아웃 라인으로 설정되는 미리 설정된 가상의 경계 라인을 지정하고, 상기 미리 설정된 가상의 경계 라인의 크기를 선택적으로 확장 또는 축소 하는 영역 크기 설정부를 더 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 상기 옵테인 샷 획득부는, 상기 물품으로부터 획득된 상기 옵테인 샷 중, 상기 미리 설정된 가변 영역을 타게팅하여 상기 미리 설정된 가변 영역만을 선택적으로 타게팅하는 영역 타게팅부; 상기 물품 중 상기 옵테인 샷의 상기 미리 설정된 가변 영역으로 타게팅된 부분에 상기 제뉴인 샷의 미리 설정된 스펙에 맞추어 확대 배율을 선택적으로 적용하는 줌 설정부; 상기 옵테인 샷의 상기 영역 타게팅부가 타게팅한 부분과 상기 타게팅된 부분의 상기 미리 설정된 스펙에 따라 확대 배율에 맞추어진, 상기 옵테인 샷의 미리 설정된 가변 영역을 선택적으로 획득하는 타겟 획득 부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 상기 가변 영역 지정부는, 상기 물품의 브랜드, 상기 물품의 년식, 상기 물품의 사이즈, 상기 물품의 컬러, 상기 물품의 시즌, 상기 물품의 버전 또는 상기 물품의 사용자 성별 중 적어도 하나 이상에 기초하여, 상기 미리 설정된 가변 영역 을 적어도 하나 이상을 선택적으로 지정할 수 있으며, 상기 영역 타게팅부는, 상기 가변 영역 지정부가 지정한 상기 미리 설정된 가변 영역에 따라, 상기 옵테인 샷의 미리 설정된 가변 영역을 지정하는 것을 특징으로 할 수 있다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 상기 벡터 설정부 는, 상기 미리 설정된 가변 영역 내에 무빙 벡터(moving vector)를 할당하는 무빙 벡터 할당부; 및 상기 미리 설정된 가변 영역 내에 상기 무빙 벡터가 이동하는 경로로서 미리 설정된 무빙 라인을 설정하는 무빙 라인 설정 부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 상기 무빙 라인 설정부는, 상기 미리 설정된 무빙 라인을 상기 무빙 벡터 내에서 선택적으로 할당 가능한 것을 특징으로 할 수 있다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 상기 벡터 설정부 는, i) 상기 제뉴인 샷의 상기 미리 설정된 가변 영역 내의 상기 무빙 벡터를 상기 미리 설정된 무빙 라인을 통 해 레퍼런스 스캔하며, ii) 상기 옵테인 샷의 상기 미리 설정된 가변 영역 내의 상기 무빙 벡터를 상기 미리 설 정된 무빙 라인을 통해 오브젝트 스캔하여, 상기 레퍼런스 스캔과 상기 오브젝트 스캔의 상호 매칭을 진행하는 트래킹 스캔부를 더 포함하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2023-0053300", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 구성의 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템은 다 음과 같은 효과를 제공한다. 첫째, 물품의 전면(full face)의 검토가 아닌, 제뉴인 컴퍼니 기준에서 차별화하도록 하는 물품별 특이 영역을 지정하여, 해당 영역의 선별적인 검토만을 통해 진품과 가품의 전산적 구분이 가능하도록 한다. 둘째, 지정된 영역의 프로그래밍화된 전산화된 지정과 영역의 가변적 확장 혹은 축소를 통해, 물품의 시리즈 별 로 전산적으로 능동적인 적용이 가능하도록 한다. 셋째, 물품의 지정된 영역 내 약속된 방식의 스캔을 통해, 지정 영역의 전 면적의 비교 판단이 아닌, 약속된 방 식으로 압축된 방식의 스캔으로, 시간 고효율의 진위 판별의 전산화된 작업이 이루어져 진위 판별에 시간적 절 감이 이루어질 수 있도록 한다."}
{"patent_id": "10-2023-0053300", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0053300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고 자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 기술적 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도 1은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 개 념도이다. 도 2는 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시 스템 중, 진위 판별 유닛의 하위 개념을 중심으로 하는 블록도이다. 도 3은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중, 제뉴인샷 획득부의 블록도이다. 도 4는 본 발 명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중 옵테인 샷 획득 부의 블록도이다. 도 5는 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중, 벡터 설정부의 블록도이다. 도 6은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔 을 통한 물품의 진위 여부 판별 시스템 중 비교 판별부의 블록도이다. 도 7은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템에 따른, 물품에 미리 설정된 가변 영역의 설정 이 이루어지는 것을 도시한 예시 화면이다. 도 8은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔 을 통한 물품의 진위 여부 판별 시스템의 미리 설정된 가변 영역의 미리 설정된 가상의 경계 라인의 선택적 확 장과 축소가 이루어짐을 도시한 예시 화면이다. 도 9는 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 미리 설정된 가변 영역 내 무빙 벡터의 세팅과 이에 따라 무빙 벡 터의 미리 설정된 무빙 라인을 따라 스캐닝 하는 것을 도시한 예시 화면이다. 도 10은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중, 미리 설정된 가변 영역 내 무빙 벡터와 미리 설정된 무빙 라인의 선택적 적용이 이루어지는 것을 도시한 예시 화면이다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 도 1에 도시된 바 와 같이, 유통, 거래되어 진위 판별이 필요하여 진위 판별의 대상이 되는 물품에 대한 진위 판별을 위한 시 스템에 해당한다. 진위 판별의 대상이 되는 물품은 도 1 등에 도시된 바와 같이, 광학 촬상기를 통하여 물품의 필요한 부분을 이미지로 촬영하게 되는데, 이렇게 획득된 이미지에 기초하여 물품의 진위 여부를 판별하게 되는 것 이다. 본 발명에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 경우, 도 1에 도시된 바 와 같이, 물품을 촬영한 광학 촬상기와 네트워크 연결되어, 광학 촬상기가 촬영하여 획득 샷 (obtained shoot)으로부터 물품의 진위 여부를 판단하는 진위 판별 유닛을 통하여 위와 같이 정의된 기 능을 수행하게 된다. 이를 위하여, 진위 판별 유닛의 경우, 도 1 및 2에 도시된 바와 같이, 제뉴인 컴퍼니로부터 물품에 관하여 미리 획득한 제뉴인 샷(genuine shoot)을 미리 저장하여 보관하고 있으며, 이후, 광학 촬상기가 촬 영하여 전송한 옵테인 샷을 획득하여 이 둘을 미리 결정된 규칙에 따라 물품의 진위 여부를 전산적으로 판단 하는 구성이다. 제뉴인 컴퍼니는 물품에 대한 정당한 취급 권리를 가진 회사 혹은 회사들의 협회에 해당할 수 있으며, 제뉴인 컴퍼니는 물품의 정식 수업 업체 혹은 물품을 직접 생산, 제조, 판매하며 물품에 대한 브 랜드 권리(권한)를 가진자 혹은 가진자들의 협회에 해당할 수 있다. 제뉴인 샷 역시, 위와 같은 제뉴인 컴퍼니에서 제공한 물품으로부터 직접 획득 혹은, 제뉴인 컴퍼니(3 0)에서 제공한 데이터로부터 획득할 수 있음은 물론이며, 이는 물품의 진위 여부 판별을 위한 옵테인 샷의 획득에 앞서 미리 입수하고 저장하여 보관하고 있는 데이터에 해당한다. 제뉴인 샷은 제뉴인 물품에 대한 전체적인 이미지 혹은 영상일 수도 있으나, 물품에서 제뉴인임을 특정, 확정, 판별할 수 있는 요소의 부분 이미지 일 수도 있음은 물론이다. 진위 판별 유닛은 도 1에 도시된 바와 같이, 모니터링 단말기를 통해 접속 가능한 서버, PC, HMI 등에 임베디드 된 프로그래밍화 되어 아래와 같은 다양한 기능을 수행하는 기능들의 집합체에 해당한다고 볼 것이다. 진위 판별 유닛의 경우, 도 2에 도시된 바와 같이, 제뉴인 샷 획득부 및 옵테인 샷 획득부를 포 함할 수 있다. 먼저, 제뉴인 샷 획득부의 경우, 외부의 서버를 구비하고 있는 제뉴인 컴퍼니로부터 물품에 대한 제뉴인 샷을 미리 획득하여 저장하는 구성에 해당한다. 도 2에 도시된 바와 같이, 옵테인 샷 획득부의 경우, 상술한 바와 같이, 광학 촬상기가 촬영한 물품 의 옵테인 샷을 광학 촬상기로부터 획득하는 구성이다. 광학 촬상기는 옵테인 샷을 물품의 전체의 영상 이미지를 획득할 수도 있으나, 목적하는 부분만을 선별 하여 촬영할 수 있는데, 이에 대해서는 후술하도록 한다. 도 2에 도시된 바와 같이, 진위 판별 유닛은 벡터 설정부를 더 포함할 수 있다. 벡터 설정부는 미리 결정된 규칙에 따라 제뉴인 샷의 레퍼컨스 스캔(정보)을 획득하고, 미리 결정된 규칙 에 따라 옵테인 샷의 오브젝트 스캔(정보)을 획득하는 구성이다. 벡터 설정부는 제뉴인 샷과 옵테인 샷을 비교하는 핵심적인 기능을 수행하게 되는데, 이에 대한 세부적이 며 디테일한 작동 원리는 후술하도록 한다. 제뉴인 샷 획득부의 경우, 도 3에 도시된 바와 같이, 제뉴인 샷 수신부 및 가변 영역 지정부를 포함할 수 있다. 먼저, 제뉴인 샷 수신부의 경우, 네트워크(network)를 통해 제뉴인 컴퍼니로부터 제뉴인 샷을 획득하 게 된다. 가변 영역 지정부의 경우, 제뉴인 컴퍼니로부터 지정된, 물품의 미리 설정된 가변 영역을 지정하게 된다. 가변 영역 지정부에 의하여 지정되는 미리 설정된 가변 영역의 경우, 물품의 브랜드, 물품의 년식, 물품의 사이즈, 물품의 컬러, 물품의 시즌, 물품의 버전 또는 물품의 사용자 성별 중 적어도 하 나 이상에 기초하여, 미리 설정된 가변 영역을 적어도 하나 이상을 선택적으로 지정할 수 있다. 즉, 도 7에 도시된 바와 같이, 가변 영역의 미리 설정의 개수와 그 위치의 정보 그리고 그 크기의 정도는 달리 설정 가능한데, 동일한 물품이라 할지라도, 위에서 설명한 바와 같이, 물품의 시즌 등에 따라서도 달리 설정할 수 있다는 의미이다. 아울러, 도 7에 도시된 바와 같이, 물품에서의 가변 영역은 하나 혹은 그 이상 설정 가능함은 물론이다. 가변 영역의 지정부는 진위 판별 유닛의 하위 구성이고, 진위 판별 유닛에서 지정하는 요소이기 는 하나, 이는 제뉴인 컴퍼니에서 제공한 제뉴인 물품의 제뉴인 특성에 의존하여 지정하는 것이 바람직 하다. 즉, 제뉴인인지 여부에 대한 보다 정확한 정보는 제뉴인 컴퍼니 측에서 전적으로 가지고 있으니, 물 품의 진품임을 판단할 수 있는 위치를 중심으로 가변 영역을 미리 설정하는 것이 바람직한 것이다. 가변 영역의 지정에 대한 정보는 제뉴인 컴퍼니로부터 획득되는 정보인 만큼, 해당 요소는 진품과 가품의 구별을 위하여 물품 중에서 가중치를 크게 두는 요소인바, 정보의 관리가 매우 중요하다. 가변 영역 지정부에서 지정한 미리 설정된 가변 영역의 정보는 하나의 파일형태가 아니라, 복수 개의 하위 파일로 분할하되, 이들 하위 분할 파일들은 매개 코드(connecting code)를 통하여 네이밍되어 도 3에 도시된 바 와 같이 물리적으로 분할된 복수 개의 DB에 개별 저장하도록 하는 것이 중요하다. 아울러, 제뉴인 샷 획득부는 영역 크기 설정부를 포함할 수 있다. 영역 크기 설정부의 경우, 가변 영역 지정부에 의해 지정된 미리 설정된 가변 영역(predetermined variable zone)의 아웃 라인(outline)으로 설정되는 미리 설정된 가상의 경계 라인(predetermined virtual edge line)을 지정하고, 미리 설정된 가상의 경계 라인의 크기를 선택적으로 확장 또는 축소하는 구성이다. 즉, 도 8에 도시된 바와 같이, 물품의 지정 즉, 미리 설정된 가변 영역의 그 바운더리(boundary)는 미리 설 정된 가상의 경계 라인으로 지정되고, 이러한 지정의 경계는 진위 판별의 정확성, 진위 판단의 신속성에 기초하 여, 선별적으로 미리 설정된 가상의 경계 라인의 확장 혹은 축소 가능하는 기능을 구비한다. 미리 설정된 가상의 경계 라인은 당연히 육안으로 관찰되지 않는 요소이다. 미리 설정된 가상의 경계 라인과 이를 통해 구획되는 미리 설정된 가변 영역은 물품의 진위 여부를 판단하기 위하여, 제뉴인 샷과 옵테인 샷의 범위를 지정하는 것으로 해석해야 하고, 최종 진위 판단을 위하 기초 자료인 제뉴인 샷과 옵테인 샷의 영역의 크기에 따라 그 확인이 가능한 가변적 요소(이미지)이다. 옵테인 샷 획득부의 경우, 도 4에 도시된 바와 같이, 영역 타게팅부, 줌 설정부 및 타겟 획득부 를 포함할 수 있다. 먼저, 영역 타게팅부의 경우, 물품으로부터 획득된 옵테인 샷 중, 미리 설정된 가변 영역을 타게팅하여 미리 설정된 가변 영역만을 선택적으로 타게팅하는 구성이다. 상술한 바와 같이, 옵테인 샷은 진위 여부를 판별하기 위한 실제 물품으로부터 획득되는 요소인데, 이는 곧 제뉴인 샷의 미리 설정된 가변 영역과 매치가 되어야 한다. 이를 위하여 영역 타게킹부는 제뉴인 샷과 정 확히 대비될 수 있도록, 진위 여부를 판별하기 위한 물품에서 미리 설정된 가변 영역을 타게팅하여 선택적으 로 획득하도록 설정하는 요소이다. 줌 설정부의 경우, 물품 중 옵테인 샷의 미리 설정된 가변 영역으로 타게팅된 부분에 제뉴인 샷의 미리 설정된 스펙에 맞추어 확대 배율을 선택적으로 적용하는 구성이다. 옵테인 샷은 진위 여부를 판별하기 위한 물품으로부터 획득되는 요소인데, 상술한 바와 같이, 제뉴인 샷의 미리 설정된 가변 영역의 것과 매칭되는 영역의 것을 획득하는 것도 중요할 뿐만 아니라, 제뉴인 샷의 이미지 배율과 동일한 배율 혹은 동일한 해상도를 구비하도록 줌 설정부가 이에 대한 미리 설정된 스펙과 동일하 게 맞추도록 한다. 미리 설정된 스펙은 제뉴인 샷의 미리 설정된 가변 영역의 해상도와 배율에 따라 맞추어진 스펙을 의미하게 되 고, 옵테인 샷도 이와 동일하게 맞추도록 요구되는 조건 정보에 해당한다. 위와 같이 영역과 스펙에 맞추어진 것과 같이, 타겟 획득부는 옵테인 샷의 영역 타게팅부가 타게팅한 부분과 타게팅된 부분의 미리 설정된 스펙에 따라 확대 배율에 맞추어진, 옵테인 샷의 미리 설정된 가변 영역을 선택적으로 획득하는 구성이다. 상술한 바와 같이, 가변 영역 지정부는 물품의 브랜드, 물품의 년식, 물품의 사이즈, 물품의 컬러, 물품의 시즌, 물품의 버전 또는 물품의 사용자 성별 중 적어도 하나 이상에 기초하여, 미리 설 정된 가변 영역을 적어도 하나 이상을 선택적으로 지정할 수 있다고 설명한 바에 따라, 영역 타게팅부는 가변 영역 지정부가 지정한 미리 설정된 가변 영역에 따라, 옵테인 샷의 미리 설정된 가변 영역을 지정하 게 된다. 도 5 및 도 9에 도시된 바와 같이, 벡터 설정부는 무빙 벡터 할당부 및 무빙 라인 설정부를 포 함할 수 있다. 무빙 벡터 할당부의 경우, 미리 설정된 가변 영역 내에 무빙 벡터(moving vector)를 할당하는 구성이다. 무빙 벡터 할당부는 무빙 벡터를 도 9에 도시된 바와 같이 좌측 상단의 모서리에 할당하는 등과 같이 할당 할 수 있는데, 이는 곳 후술하게 되는 바와 같이, 무빙 벡터(MV)의 스캐닝의 시발점이 되는 부분에 해당한다. 무빙 벡터(MV)는 미리 설정된 가변 영역에서 후술하게 되는 미리 설정된 무빙 라인을 따라 이동하면서, 이동되 는 부분 즉, 제뉴인 샷의 미리 설정된 가변 영역의 이동되는 부분과 옵테인 샷의 미리 설정된 가변 영역의 이동 되는 부분만을 각각 스캔하여, 향후 비교하도록 하는 요소이다. 무빙 벡터(MV)는 움직이면서 동시에 부분 스캔하는 점(spot)이라고 해석하면 될 것이다. 무빙 라인 설정부의 경우, 도 9 및 10에 도시된 바와 같이, 미리 설정된 가변 영역 내에 무빙 벡터(MV)가 이동하는 경로로서 미리 설정된 무빙 라인을 설정하는 구성이다. 상술한 바와 같이, 미리 설정된 무빙 라인은 무빙 벡터가 이동하는 경로로서 지정/설정하는 요소인데, 도 9에서 는 무빙 라인이 좌측 상단에서 우측 하단으로도 설정 가능하며, 이와는 달리, 좌측에서 우측으로 향하도록 설정 할 수도 있다. 미리 설정된 무빙 라인은 미리 설정된 가변 영역에서 제뉴인 샷의 특이점을 잘 추출할 수 있는 경로로서 설정할 수 있는데, 미리 설정된 무빙 라인 역시, 물품의 브랜드, 물품의 년식, 물품의 사이즈, 물품의 컬 러, 물품의 시즌, 물품의 버전 또는 물품의 사용자 성별 중 적어도 하나 이상에 기초하여, 선택적으로 설정될 수 있다. 무빙 벡터 설정부의 경우, 트래킹 스캔부를 더 포함할 수 있는데, i) 제뉴인 샷의 미리 설정된 가변 영역 내의 무빙 벡터를 미리 설정된 무빙 라인을 통해 레퍼런스 스캔하며, ii) 옵테인 샷의 미리 설정된 가변 영역 내의 무빙 벡터를 미리 설정된 무빙 라인을 통해 오브젝트 스캔하여, 레퍼런스 스캔과 오브젝트 스캔의 상 호 매칭을 진행하는 구성이다. 진위 판별 유닛의 경우, 도 6에 도시된 바와 같이, 비교 판별부를 더 포함할 수 있다. 비교 판별부의 경우, 상술한 바와 같이, 트래킹 스캔부에서 무빙 벡터가 미리 설정된 무빙 라인을 통 해서 제뉴인 샷의 것과, 옵테인 샷의 것을 상호 비교하여 진위 판별 대상 물품의 진위 여부를 판단하는 구성 이다. 비교 판단부의 경우, 얼라이닝부, 라인 매칭부 및 수치 분석부를 포함할 수 있다. 얼라이닝부의 경우, 도 9 및 10에 도시된 바와 같이, 제뉴인 샷의 미리 설정된 가변 영역의 미리 설정된 무빙 라인과, 옵테인 샷의 미리 설정된 가변 영역의 미리 설정된 무빙 라인을 동일한 기준으로 적용하여, 동일한 루트를 형성하도록 상호 정렬하도록 설정하게 되는 요소이다. 라인 매칭부는 얼라이닝부에 의해 상호 정렬된 제뉴인 샷의 미리 설정된 무빙 라인과 옵테인 샷의 무 빙 라인 상에서 각각 이동되면서 스캐닝한 무빙 벡터의 각각의 무빙 라인을 상호 매칭하는 구성이다. 수치 분석부는 라인 매칭부에 의해 상호 정렬된 제뉴인 샷의 미리 설정된 무빙 라인과 옵테인 샷의 무빙 라인 상에서 각각 이동되면서 스캐닝한 무빙 벡터의 각각의 무빙 라인을 상호 매칭되어 무빙 벡터의 레퍼 런스 스캔(정보)과 오브젝트 스캔(정보)를 픽셀 대 픽셀의 상호 매칭률을 비교하여, 정량적으로 수치화하여, 비 교의 정도를 정량적으로 분석되도록 하는 요소이다. 본 발명의 권리 범위는 특허청구범위에 기재된 사항에 의해 결정되며, 특허 청구범위에 사용된 괄호는 선택적 한정을 위해 기재된 것이 아니라, 명확한 구성요소를 위해 사용되었으며, 괄호 내의 기재도 필수적 구성요소로 해석되어야 한다."}
{"patent_id": "10-2023-0053300", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 개 념도이다. 도 2는 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중, 진위 판별 유닛의 하위 개념을 중심으로 하느 블록도이다. 도 3은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중, 제뉴인샷 획득부의 블록도이다. 도 4는 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중 옵 테인 샷 획득부의 블록도이다. 도 5는 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중, 벡터 설정부의 블록도이다. 도 6은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중 비 교 판별부의 블록도이다. 도 7은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템에 따 른, 물품에 미리 설정된 가변 영역의 설정이 이루어지는 것을 도시한 예시 화면이다. 도 8은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 미 리 설정된 가변 영역의 미리 설정된 가상의 경계 라인의 선택적 확장과 축소가 이루어짐을 도시한 예시 화면이 다. 도 9는 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템의 미 리 설정된 가변 영역 내 무빙 벡터의 세팅과 이에 따라 무빙 벡터의 미리 설정된 무빙 라인을 따라 스캐닝 하는 것을 도시한 예시 화면이다. 도 10은 본 발명의 일 실시예에 따른 선별적 영역 지정과 벡터 스캔을 통한 물품의 진위 여부 판별 시스템 중, 미리 설정된 가변 영역 내 무빙 벡터와 미리 설정된 무빙 라인의 선택적 적용이 이루어지는 것을 도시한 예시 화면이다."}
