{"patent_id": "10-2021-0156617", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0070735", "출원번호": "10-2021-0156617", "발명의 명칭": "재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치", "출원인": "(주)세자에너지", "발명자": "김선영"}}
{"patent_id": "10-2021-0156617", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "각각의 잔존 수명이 알려진 제1 배터리를 기 설정된 DOD (Depth of Discharge) 구간에서 간헐적 충전 또는 방전하는 동안 특성 패턴들을 수집하는 특성 패턴 수집부;상기 특성 패턴들로부터 이산형 패턴 데이터와 연속형 패턴 데이터를 각각 추출하여 배터리의 잔존 수명을 독립적으로 예측하는 적어도 하나의 예측 모델을 구축하는 예측 모델 구축부; 및재사용 가능한 제2 배터리의 용량을 기준으로 상기 DOD 구간에서 상기 간헐적 충전 또는 방전에 따른 비교 패턴을 측정하고 상기 비교 패턴을 상기 적어도 하나의 예측 모델에 적용하여 상기 제2 배터리의 잔존 수명을 예측하는 잔존 수명 예측부;를 포함하는 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치."}
{"patent_id": "10-2021-0156617", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 특성 패턴 수집부는DOD 50 내지 80%의 구간을 상기 DOD 구간으로 설정하고 상기 제1 배터리의 용량이 기 설정된 목표 값에 도달할때까지 충전 또는 방전, 그리고 휴식을 동일한 시간 간격마다 반복적으로 수행함으로써 상기 간헐적 충전 또는방전을 진행하며,상기 제1 배터리에 관한 잔존 용량별, 가변 전류별 및 시간 간격별로 상기 특성 패턴들을 수집하는 것을 특징으로 하는 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치."}
{"patent_id": "10-2021-0156617", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 예측 모델 구축부는상기 이산형 패턴 데이터로서 간헐적 충전 또는 방전 그래프 상에서 검출되는 복수의 특징점들에 관한 특징값벡터를 학습하고 상기 연속형 패턴 데이터로서 상기 간헐적 충전 또는 방전 그래프의 그래프 이미지를학습하며,상기 적어도 하나의 예측 모델은 상기 제1 배터리에 관한 완전 충전 또는 방전하는 동안의 특성 패턴들을 사전학습하여 생성되는 것을 특징으로 하는 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치."}
{"patent_id": "10-2021-0156617", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치에 관한 것으로, 각각의 잔존 수명 이 알려진 제1 배터리를 기 설정된 DOD (Depth of Discharge) 구간에서 간헐적 충전 또는 방전하는 동안 특성 패 턴들을 수집하는 특성 패턴 수집부; 상기 특성 패턴들로부터 이산형 패턴 데이터와 연속형 패턴 데이터를 각각 추출하여 배터리의 잔존 수명을 독립적으로 예측하는 적어도 하나의 예측 모델을 구축하는 예측 모델 구축부; 및 재사용 가능한 제2 배터리의 용량을 기준으로 상기 DOD 구간에서 상기 간헐적 충전 또는 방전에 따른 비교 패턴 을 측정하고 상기 비교 패턴을 상기 적어도 하나의 예측 모델에 적용하여 상기 제2 배터리의 잔존 수명을 예측하 는 잔존 수명 예측부;를 포함한다."}
{"patent_id": "10-2021-0156617", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 유효 수명 측정 기술에 관한 것으로, 보다 상세하게는 인공지능을 활용하여 배터리의 간헐적 충전 또 는 방전에 따른 패턴을 분석함으로써 배터리의 유효 수명을 정확도 높게 예측하는 재사용 가능한 배터리의 인공 지능 활용 유효 수명 측정을 위한 장치에 관한 것이다."}
{"patent_id": "10-2021-0156617", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 제품의 급속한 발전과 소비자들의 고성능 전력원에 대한 높은 기대로 인해 에너지 소모가 높은 제품이 많 이 등장하고 있다. 예를 들어, 노트북, 비디오 카메라, 스마트폰 등과 같은 휴대용 전자 제품의 수요가 급격하 게 증대되고, 에너지 저장용 축전지, 로봇, 위성 등의 개발이 본격화됨에 따라, 반복적으로 충전 및 방전이 가능한 고성능 이차 전지에 대한 연구가 활발하다. 이러한 이차 전지로는 리튬 이차 전지가 충방전이 자유롭고 자 가 방전율이 낮은 등의 여러 장점으로 인해 널리 사용되고 있다. 특히, 최근에는 오염 물질 발생을 줄이고, 에너지 절약을 위해, 전기 자동차(EV) 또는 하이브리드(Hybrid) 자동 차의 개발에 많은 노력을 기울이고 있다. 이러한 전기 자동차 등에는 전기 모터의 구동 전력을 제공하는 충방전 배터리가 필수적으로 장착되며, 국내 전기자동차 보급이 점차적으로 확대됨에 따라 향후 전기자동차로부터 발생 되는 폐전지의 규모 역시 크게 증가하고 있다. 이러한 충방전 배터리가 사용되는 전기자동차 전지의 용량은 초기 대비 70% 내지 80% 이하로 감소하게 되면, 충 방전 시간, 주행거리 등의 문제로 교체가 필요하다. 전기자동차는 폐차 신고 의무화로 전지 이력 추적이 가능하 여 폐전지의 수거가 용이하고 잔존용량을 감안하여 ESS(에너지 저장장치: Energy Storage System)로의 재활용 가치가 높다. 이에 따라, 전기자동차 생산업체들은 전기자동차 사용 후 배터리전지를 ESS로 \"Re-Use\"하고 있는 추세이다. 배터리 성능 검사는 재사용을 위해 반드시 선행되어야 하는 것으로 검사를 위해 배터리 팩을 분해한 후 모듈단 위의 성능 검사가 요구된다. 재사용을 위한 모듈 분석 과정에서는 외관검사, 발열검사, 충방전검사, 배터리 잔 존 용량(수명)등의 검사를 진행하며 그 중에 가장 핵심은 배터리의 유효 수명(잔존용량)을 측정하는 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2014-0026088호 (2014.03.05)"}
{"patent_id": "10-2021-0156617", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는 인공지능을 활용하여 배터리의 간헐적 충전 또는 방전에 따른 패턴을 분석함으로써 배터 리의 유효 수명을 정확도 높게 예측하는 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치를 제공하고자 한다."}
{"patent_id": "10-2021-0156617", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예들 중에서, 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치는 각각의 잔존 수명이 알 려진 제1 배터리를 기 설정된 DOD (Depth of Discharge) 구간에서 간헐적 충전 또는 방전하는 동안 특성 패턴들 을 수집하는 특성 패턴 수집부; 상기 특성 패턴들로부터 이산형 패턴 데이터와 연속형 패턴 데이터를 각각 추출 하여 배터리의 잔존 수명을 독립적으로 예측하는 적어도 하나의 예측 모델을 구축하는 예측 모델 구축부; 및 재 사용 가능한 제2 배터리의 용량을 기준으로 상기 DOD 구간에서 상기 간헐적 충전 또는 방전에 따른 비교 패턴을 측정하고 상기 비교 패턴을 상기 적어도 하나의 예측 모델에 적용하여 상기 제2 배터리의 잔존 수명을 예측하는 잔존 수명 예측부;를 포함한다. 상기 특성 패턴 수집부는 DOD 50 내지 80%의 구간을 상기 DOD 구간으로 설정하고 상기 제1 배터리의 용량이 기 설정된 목표 값에 도달할 때까지 충전 또는 방전, 그리고 휴식을 동일한 시간 간격마다 반복적으로 수행함으로 써 상기 간헐적 충전 또는 방전을 진행하며, 상기 제1 배터리에 관한 잔존 용량별, 가변 전류별 및 시간 간격별 로 상기 특성 패턴들을 수집할 수 있다. 상기 예측 모델 구축부는 상기 이산형 패턴 데이터로서 간헐적 충전 또는 방전 그래프 상에서 검출되는 복수의 특징점들에 관한 특징값 벡터를 학습하고 상기 연속형 패턴 데이터로서 상기 간헐적 충전 또는 방전 그래프의 그래프 이미지를 학습하며, 상기 적어도 하나의 예측 모델은 상기 제1 배터리에 관한 완전 충전 또는 방전하는 동안의 특성 패턴들을 사전 학습하여 생성될 수 있다."}
{"patent_id": "10-2021-0156617", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 기술은 다음의 효과를 가질 수 있다. 다만, 특정 실시예가 다음의 효과를 전부 포함하여야 한다거나 다 음의 효과만을 포함하여야 한다는 의미는 아니므로, 개시된 기술의 권리범위는 이에 의하여 제한되는 것으로 이 해되어서는 아니 될 것이다. 본 발명의 일 실시예에 따른 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치는 인공지능을 활용하여 배터리의 간헐적 충전 또는 방전에 따른 패턴을 분석함으로써 배터리의 유효 수명을 정확도 높게 예측 할 수 있다."}
{"patent_id": "10-2021-0156617", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 관한 설명은 구조적 내지 기능적 설명을 위한 실시예에 불과하므로, 본 발명의 권리범위는 본문에 설 명된 실시예에 의하여 제한되는 것으로 해석되어서는 아니 된다. 즉, 실시예는 다양한 변경이 가능하고 여러 가 지 형태를 가질 수 있으므로 본 발명의 권리범위는 기술적 사상을 실현할 수 있는 균등물들을 포함하는 것으로 이해되어야 한다. 또한, 본 발명에서 제시된 목적 또는 효과는 특정 실시예가 이를 전부 포함하여야 한다거나 그러한 효과만을 포함하여야 한다는 의미는 아니므로, 본 발명의 권리범위는 이에 의하여 제한되는 것으로 이해 되어서는 아니 될 것이다. 한편, 본 출원에서 서술되는 용어의 의미는 다음과 같이 이해되어야 할 것이다. \"제1\", \"제2\" 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위한 것으로, 이들 용어들에 의해 권리범위가 한정되어서는 아니 된다. 예를 들어, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\"있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결될 수 도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\"있다고 언급된 때에는 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 한편, 구성요소들 간의 관계를 설명하는 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 이웃 하는\"과 \"~에 직접 이웃하는\" 등도 마찬가지로 해석되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, \"포함 하다\"또는 \"가지다\" 등의 용어는 실시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 각 단계들에 있어 식별부호(예를 들어, a, b, c 등)는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단 계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수 행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 여기서 사용되는 모든 용어들은 다르게 정의되지 않는 한, 본 발명이 속하는 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 용어들은 관 련 기술의 문맥상 가지는 의미와 일치하는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한 이 상적이거나 과도하게 형식적인 의미를 지니는 것으로 해석될 수 없다. 도 1은 본 발명에 따른 수명 예측 시스템을 설명하는 도면이다. 도 1을 참조하면, 수명 예측 시스템은 배터리, 수명 예측 장치 및 데이터베이스를 포함할 수 있다. 배터리는 재사용 가능한 충방전 배터리 모듈을 포함할 수 있다. 배터리 모듈은 전기 자동차(EV), 하이브리 드(Hybrid) 자동차 뿐만 아니라 이륜차, 선백, 비행기 등 운송수단에도 적용될 수 있으며, 전기 동력을 이용하 는 다양한 장치들에도 적용될 수 있다. 배터리는 잔존 수명을 예측하기 위하여 수명 예측 장치와 연 결될 수 있으며, 배터리 모듈의 충전 및 방전 동안의 특성 데이터들을 수집하여 수명 예측 장치에 전달하 도록 구현될 수 있다. 즉, 배터리는 수명 예측 장치와 연결되어 동작 가능한 연산 모듈을 포함하여 구현될 수 있으며, 수명 예측 장치와 연동하기 위한 전용 프로그램 또는 어플리케이션(또는 앱, app)을 설 치하여 실행할 수 있다. 수명 예측 장치는 배터리의 잔존 수명을 예측하는 컴퓨터 또는 프로그램에 해당하는 서버로 구현될 수 있다. 또한, 수명 예측 장치는 배터리와 유선 네트워크 또는 블루투스, WiFi, LTE 등과 같은 무선 네트워크로 연결될 수 있고, 네트워크를 통해 배터리과 데이터를 송·수신할 수 있다. 또한, 수명 예측 장치는 관련 서비스를 제공하기 위하여 독립된 외부 시스템(도 1에 미도시함)과 연결되어 동작하도록 구현될 수 있다. 예를 들어, 수명 예측 장치는 배터리 검사 시스템, 배터리 충전 및 방전 시스 템, 기계학습 시스템, 블록체인 시스템 등과 연동하여 다양한 서비스를 제공하도록 구현될 수 있다. 일 실시예 에서, 수명 예측 장치는 클라우드 서버로 구현될 수 있으며, 클라우드 서비스를 통해 빅데이터 분석과 사 용자 맞춤형 정보를 제공하는 동작을 수행할 수도 있다. 데이터베이스는 수명 예측 장치의 동작 과정에서 필요한 다양한 정보들을 저장하는 저장장치에 해당 할 수 있다. 예를 들어, 데이터베이스는 배터리 모듈의 특성 데이터 및 충방전 데이터를 저장할 수 있고, 충방전 데이터를 학습하기 위한 학습 알고리즘 및 학습 모델에 관한 정보를 저장할 수 있으며, 반드시 이에 한 정되지 않고, 수명 예측 장치가 본 발명에 따른 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 방법을 수행하는 과정에서 다양한 형태로 수집 또는 가공된 정보들을 저장할 수 있다. 또한, 도 1에서, 데이터베이스는 수명 예측 장치와 독립적인 장치로서 도시되어 있으나, 반드시 이에 한정되지 않고, 논리적인 저장장치로서 수명 예측 장치에 포함되어 구현될 수 있음은 물론이다. 도 2는 도 1의 수명 예측 장치의 시스템 구성을 설명하는 도면이다. 도 2를 참조하면, 수명 예측 장치는 특성 패턴 수집부, 예측 모델 구축부, 잔존 수명 예측부 및 제어부를 포함할 수 있다. 특성 패턴 수집부는 각각의 잔존 수명이 알려진 제1 배터리를 기 설정된 DOD (Depth of Discharge) 구간에 서 간헐적 충전 또는 방전하는 동안 특성 패턴들을 수집할 수 있다. 여기에서, 제1 배터리는 특성 패턴을 수집 하기 위한 배터리에 해당할 수 있다. DOD 구간은 사전에 설정된 방전깊이 구간에 해당할 수 있으며, 배터리 모 듈의 충전과 방전 동안 상대적으로 균일한 특성을 나타내는 구간으로 설정될 수 있다. 예를 들어, 배터리 모듈 은 충전 또는 방전 시 전압 그래프 상에서 급격한 커브 곡선이 나타나는 구간을 포함할 수 있으며, DOD 구간은 해당 구간을 제외한 구간으로 제한되어 설정될 수 있다. 또한, 특성 패턴 수집부는 배터리와 연결된 상태에서 배터리 모듈에 대한 간헐적 충전 또는 방전을 수행하면서 다양한 특성 패턴 정보를 수집할 수 있다. 여기에서, 특성 패턴 정보에는 단자전압, 전류, 시간, 온 도 및 저항 등이 포함될 수 있다. 특성 패턴 수집부는 시간의 흐름에 따른 특성들의 변화를 패턴화하여 저장할 수 있다. 예를 들어, 특성 패턴 수집부는 시간의 흐름에 따른 전압, 전류, 온도 및 저항 등에 관한 변화 그래프를 생성할 수 있고, 특정 시점 또는 시점 구간에 대한 그래프 이미지를 생성하여 저장할 수 있다. 일 실시예에서, 특성 패턴 수집부는 DOD 50 내지 80%의 구간을 DOD 구간으로 설정하고 제1 배터리의 용량 이 기 설정된 목표 값에 도달할 때까지 충전 또는 방전, 그리고 휴식을 동일한 시간 간격마다 반복적으로 수행 함으로써 간헐적 충전 또는 방전을 진행할 수 있다. 즉, 배터리 모듈에 대한 간헐적 충전 또는 방전은 충전과 휴식 또는 방전과 휴식을 반복적으로 수행하는 동작에 해당할 수 있다. 예를 들어, 간헐적 충전은 충전 용량이 소정의 상향 목표 값에 도달할 때까지 10초 충전과 10초 휴식을 반복적 으로 수행하는 동작에 해당할 수 있다. 간헐적 방전은 충전 용량이 소정의 하향 목표 값에 도달할 때까지 10초 방전과 10초 휴식을 반복적으로 수행하는 동작에 해당할 수 있다. 이때, 10초의 간격은 배터리 제조사별, 제품 별, 용량별, 수명별로 다양하게 설정될 수 있다. 또한, 배터리 용량이 작을수록 충전시간(또는 방전시간)과 휴 식시간이 짧아질 수 있으며, 배터리 용량이 클수록 충전시간과 휴식시간은 길어질 수 있다. 또한, 특성 패턴 수집부는 DOD 50 내지 80%의 구간을 DOD 구간으로 설정하여 특성 패턴을 수집할 수 있다. 특성 패턴 수집부는 배터리의 잔존 수명 예측을 위해 필요한 DOD 구간만을 제한적으로 설정하고 해당 DOD 구간에서의 특성 패턴 데이터를 수집함으로써 학습을 위한 데이터를 효율적으로 확보하면서 학습에 소요되는 시 간을 효과적으로 줄일 수 있다. 일 실시예에서, 특성 패턴 수집부는 제1 배터리에 관한 잔존 용량별, 가변 전류별 및 시간 간격별로 특성 패턴들을 수집할 수 있다. 먼저, 특성 패턴 수집부는 배터리의 잔존 용량에 따라 간헐적 충방전 시 서로 다른 패턴이 나타나는 점을 고려하여 잔존 용량이 0% ~ 100%인 배터리들에 대한 특성 패턴을 사전에 수집할 수 있다(도 5 참조). 또한, 특성 패턴 수집부는 1A, 2A 및 3A 등 다양한 충방전 전류를 적용하여 배터리의 간 헐적 충반전에 따른 특성 패턴을 사전에 수집할 수 있다. 또한, 특성 패턴 수집부는 간헐적 충반전에 따른 시간 간격을 기본적으로 10초로 적용할 수 있으나, 다양한 조건에 따라 시간 간격을 적용하여 특성 패턴을 사전 에 수집할 수 있다. 예측 모델 구축부는 특성 패턴들로부터 이산형 패턴 데이터와 연속형 패턴 데이터를 각각 추출하여 배터리 의 잔존 수명을 독립적으로 예측하는 적어도 하나의 예측 모델을 구축할 수 있다. 일 실시예에서, 예측 모델 구 축부는 이산형 패턴 데이터로서 간헐적 충전 또는 방전 그래프 상에서 검출되는 복수의 특징점들에 관한 특징값 벡터를 학습하고 연속형 패턴 데이터로서 간헐적 충전 또는 방전 그래프의 그래프 이미지를 학습할 수 있다. 보다 구체적으로, 복수의 특징점들은 간헐적 충전 또는 방전 그래프 상에서 반복적으로 나타나는 패턴에 관한 특징점들로 정의될 수 있다. 예를 들어, 간헐적 충전 또는 방전 그래프 상에서 나타나는 특성 패턴의 단일 사이 클(single cycle) 내에서 Vt1, Vt2, Vt3, Voc1, Voc2 및 Voc3를 각각 특징점으로 정의될 수 있다. 여기에서, Vt는 상단전압이고, Voc는 하단전압이다. 즉, 예측 모델 구축부는 각 특징점에서의 특징값을 기초로 Vt1-Vt2 값, Vt1-Voc2 값, Voc1-Voc2 값, Vt2- Vt3 값 및 Voc2-Voc3 값을 도출할 수 있으며, 해당 값들을 포함하는 특징값 벡터를 생성할 수 있다. 이때, 특징 값 벡터는 충방전 그래프 상의 반복 구간 마다 생성될 수 있고, 배터리의 잔존 용량 별로 생성될 수 있으며, DOD 구간 별로 생성될 수 있고, 가변 전류 별로 생성될 수 있다. 예측 모델 구축부는 다양한 조건에서 수 집된 이산형 패턴 데이터를 학습하여 배터리의 잔존 수명을 높은 정확도로 예측하는 예측 모델을 구축할 수 있 다. 또한, 예측 모델 구축부는 이산형 패턴 데이터뿐만 아니라 연속형 패턴 데이터를 추가로 학습하여 독립된 예측 모델을 구축할 수 있다. 이때, 연속형 패턴 데이터는 충방전 그래프 상에서 그래프 패턴에 관한 패턴 이미 지를 포함할 수 있다. 즉, 예측 모델 구축부는 다양한 조건에서 수집된 충방전 그래프 상에서 특성 패턴의 변화 정보를 포함하는 그래프 이미지를 학습 데이터로 활용하여 예측 모델을 구축할 수 있다. 예측 모델 구축부 에 의해 독립적으로 구축되는 예측 모델들은 이후 단계에서 재사용 가능한 배터리의 잔존 수명을 예측하는 데 활용될 수 있다. 일 실시예에서, 예측 모델 구축부는 이산형 패턴 데이터와 연속형 패턴 데이터를 포함하는 학습 데이터를 학습하여 예측 모델을 구축할 수 있다. 즉, 예측 모델 구축부는 간헐적 충전 또는 방전 그래프 상에서 Vt1-Vt2 값, Vt1-Voc2 값, Voc1-Voc2 값, Vt2-Vt3 값 및 Voc2-Voc3 값을 이산형 패턴 데이터로 수집하고, 각 구간들 즉 Vt1-Vt2 구간, Vt1-Voc2 구간, Voc1-Voc2 구간, Vt2-Vt3 구간 및 Voc2-Voc3 구간의 세부 특성 데이터들은 그래프 이미지에 관한 연속형 패턴 데이터로 수집할 수 있다. 예측 모델 구축부는 이산형 패턴 데 이터와 연속형 패턴 데이터의 조합으로 생성된 학습 데이터를 학습하여 예측 모델을 구축함으로써 학습에 따른 예측 정확도를 높일 수 있다. 일 실시예에서, 예측 모델 구축부는 제1 배터리에 관한 완전 충전 또는 방전하는 동안의 특성 패턴들을 기 초로 적어도 하나의 예측 모델을 사전 학습할 수 있다. 예측 모델 구축부는 데이터 학습 전에 미리 완전충 전 및 완전방전 방식을 통해 측정 및 수집된 배터리들의 잔존 수명에 관한 기준 데이터를 사전 학습할 수 있다. 즉, 기준 데이터는 사용 후 배터리의 잔존 수명이 52%로 측정된 배터리, 90%로 측정된 배터리, 64%로 측정된 배 터리 등 모든 구간의 배터리들에 대한 잔존 수명을 미리 완전충전 또는 완전방전(제일 정확하게 수명을 측정하 는 방식일 수 있으나, 배터리 1개당 2일 내지 3일이 소요됨)을 통해 최소 100가지 이상의 수명을 측정한 결과로 서 수집될 수 있다. 예측 모델 구축부는 기준 데이터를 사전 학습하고 이후 간헐적 충방전에 따른 패턴 데 이터를 추가 학습함으로써 수명 예측을 위한 예측 모델을 구축할 수 있다. 잔존 수명 예측부는 재사용 가능한 제2 배터리의 용량을 기준으로 DOD 구간에서 간헐적 충전 또는 방전에 따른 비교 패턴을 측정하고 비교 패턴을 적어도 하나의 예측 모델에 적용하여 제2 배터리의 잔존 수명을 예측할 수 있다. 여기에서, 제2 배터리는 잔존 수명 예측의 대상이 되는 배터리에 해당할 수 있다. 잔존 수명 예측부 는 제2 배터리의 현재 잔존 용량을 측정할 수 있으며, 해당 현재 잔존 용량이 기 설정된 DOD 구간에 해당 하는 경우, 간헐적 충방전을 통해 비교 패턴을 수집할 수 있다. 이후, 잔존 수명 예측부는 비교 패턴을 기 구축된 예측 모델에 적용하여 잔존 수명을 예측할 수 있다. 이 때, 배터리의 예측 잔존 수명은 해당 배터리가 앞으로 몇 사이클 더 충방전할 수 있는지를 나타내는 것으로, x% 와 같이 표현될 수 있다. 예를 들어, 새 배터리의 경우 잔존 수명이 100%에 해당할 수 있고, 폐기 배터리의 경 우 잔존 수명이 0%에 해당할 수 있다. 잔존 수명 예측부는 DOD 구간에서 제2 배터리에 대해 수집된 패턴 정보를 기초로 제2 배터리의 잔존 수명을 %로 수치화하여 생성할 수 있다. 일 실시예에서, 잔존 수명 예측부는 그래프 이미지를 학습하여 구축된 예측 모델을 통해 제2 배터리의 잔 존 용량을 예측하고, 특징값 벡터를 학습하여 구축된 예측 모델을 통해 제2 배터리의 잔존 수명을 예측할 수 있 다. 즉, 잔존 수명 예측부는 그래프 상의 변화 패턴에 대한 이미지 비교를 통해 제2 배터리의 잔존 용량을 빠르게 예측할 수 있으며, 잔존 용량에 따른 특징값 벡터 비교를 통해 제2 배터리의 잔존 수명을 정확도 높게 예측할 수 있다. 일 실시예에서, 잔존 수명 예측부는 재사용 하고자 하는 제2 배터리를 특정 시간 동안 충전 또는 방전하여 제2 배터리의 잔존 용량을 측정할 수 있다. 만약 제2 배터리의 잔존 용량이 기 설정된 DOD 구간에 포함된 경우 잔존 수명 예측부는 간헐적 충방전 테스트를 통해 획득한 비교 데이터를 이용하여 제2 배터리의 잔존 수명 을 예측할 수 있다. 만약 제2 배터리의 잔존 용량이 기 설정된 DOD 구간에 포함되지 않은 경우, 잔존 수명 예측 부는 제2 배터리에 대한 충전 또는 방전을 수행하여 제2 배터리의 잔존 용량이 DOD 구간에 포함되도록 할 수 있다. 예를 들어, 제2 배터리의 잔존 용량이 0%에 해당하는 경우 잔존 수명 예측부는 제2 배터리를 충전하여 잔 존 용량이 50% 이상이 되도록 할 수 있다. 제2 배터리의 잔존 용량이 100%에 해당하는 경우 잔존 수명 예측부 는 제2 배터리를 방전시켜 잔존 용량이 80% 이하가 되도록 할 수 있다. 제어부는 수명 예측 장치의 전체적인 동작을 제어하고, 특성 패턴 수집부, 예측 모델 구축부 및 잔존 수명 예측부 간의 제어 흐름 또는 데이터 흐름을 관리할 수 있다. 도 3은 본 발명에 따른 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치의 동작을 설명하는 순서도이다. 도 3을 참조하면, 수명 예측 장치는 특성 패턴 수집부를 통해 각각의 잔존 수명이 알려진 제1 배터리 를 기 설정된 DOD (Depth of Discharge) 구간에서 간헐적 충전 또는 방전하는 동안 특성 패턴들을 수집할 수 있 다(단계 S310). 수명 예측 장치는 예측 모델 구축부를 통해 특성 패턴들로부터 이산형 패턴 데이터와 연속형 패턴 데이터를 각각 추출하여 배터리의 잔존 수명을 독립적으로 예측하는 적어도 하나의 예측 모델을 구 축할 수 있다(단계 S330). 수명 예측 장치는 잔존 수명 예측부를 통해 재사용 가능한 제2 배터리의 용량을 기준으로 DOD 구간에서 간헐적 충전 또는 방전에 따른 비교 패턴을 측정하고 비교 패턴을 적어도 하나의예측 모델에 적용하여 제2 배터리의 잔존 수명을 예측할 수 있다(단계 S350). 도 4는 본 발명에 따른 수명 예측 장치가 배터리 충전 및 방전 시스템과 연동하여 동작하는 과정을 설명하는 도 면이다. 도 4를 참조하면, 수명 예측 장치는 배터리 충전 및 방전 시스템과 연동하여 동작할 수 있고, 배터리 를 기 설정된 DOD 구간에서 간헐적 충전 또는 방전하는 동안 특성 패턴들을 수집할 수 있다. 이때, 배터리 충전 및 방전 시스템은 한 번에 다수의 배터리 모듈들에 대한 측정을 수행할 수 있도록 구성될 수 있으며, 배터 리 충전 및 방전 제어부 및 배터리 모듈 전압 및 전류 검출부를 포함하여 구현될 수 있다. 구체적으로, 배터리 충전 및 방전 제어부는 다수의 배터리 모듈들과 독립적으로 연결되어 각 배터리 모듈의 충 전 또는 방전을 수행할 수 있다. 배터리 모듈 전압 및 전류 검출부는 다수의 배터리 모듈들 각각의 특성 패턴에 관한 데이터를 측정 및 수집할 수 있다. 즉, 배터리 충전 및 방전 시스템은 다수의 배터리 모듈에 가변 충 방전 전류를 인가하여 배터리 모듈의 충방전 특성을 실시간으로 측정할 수 있다. 특히, 배터리 충전 및 방전 시스템은 수명 예측 장치와 연동하여 동작할 수 있으며, 측정 및 수집된 데이터들은 수명 예측 장치에게 전달되어 데이터베이스에 저장될 수 있다. 도 5는 본 발명에 따른 배터리의 간헐적 충전 및 간헐적 방전에 관한 전압 그래프를 설명하는 도면이다. 도 5를 참조하면, 배터리의 경우 잔존 용량에 따라 간헐적 충방전 시 서로 다른 특성 패턴을 나타낼 수 있다. 수명 예측 장치는 이러한 특성 패턴들을 수집하여 학습함으로써 배터리의 잔존 수명을 예측하는 예측 모델 을 구축할 수 있다. 도 5에서, 그림 (a)는 잔존 용량이 60%인 배터리의 특성 변화 그래프이고, 그림 (b)는 잔존 용량이 80%인 배터 리의 특성 변화 그래프이며, 그림 (c)는 잔존 용량이 100%인 배터리의 특성 변화 그래프에 해당할 수 있다. 각 경우 배터리에 대해 충전 또는 방전, 그리고 휴식이 반복적으로 수행됨에 따라 측정되는 특성 변화 패턴도 반복 적으로 나타날 수 있다. 수명 예측 장치는 각 패턴이 반복적으로 나타나는 시간 간격마다 학습 데이터를 생성하여 학습할 수 있으며, 이를 통해 완전방전 또는 완전충전에 의한 경우 학습 데이터의 확보가 어렵다는 문 제를 해결할 수 있다. 도 6은 본 발명에 따른 배터리의 간헐적 충전 및 간헐적 방전 시 전압 그래프 상에서 나타나는 특성 패턴을 설 명하는 도면이다. 도 6을 참조하면, 수명 예측 장치는 배터리에 대한 간헐적 충전 또는 방전하는 동안 특성 패턴들을 수집하 고, 특성 패턴들의 패턴 데이터를 이용하여 배터리의 잔존 수명을 예측하는 예측 모델을 구축할 수 있다. 도 6 의 그림 (a) 내지 (c)는 각각 잔존 용량이 100%, 80% 및 60%인 배터리의 간헐적 방전 그래프에 해당할 수 있다. 이때, Vt1에서 Vt2 구간은 휴식 구간이고, Voc1에서 Voc2 구간은 방전 구간에 해당할 수 있다. 특히, 수명 예측 장치는 패턴 그래프 상에서 복수의 특징점들을 정의할 수 있고, 복수의 특징점들에 관한 특징값 벡터를 학습 데이터로서 생성할 수 있다. 도 6에서, 수명 예측 장치는 전압 그래프 상에서 Vt1, Vt2, Vt3, Voc1, Voc2 및 Voc3를 각각 특징점으로 정의할 수 있으며, 각 특징점에서의 특징값에 따라 Vt1-Vt2 값, Vt1-Voc2 값, Voc1-Voc2 값, Vt2-Vt3 값 및 Voc2-Voc3 값을 산출할 수 있다. 해당 값들은 배터리의 잔존 용량 별로 일정한 패턴을 나타낼 수 있으며, 수명 예측 장치는 이러한 패턴 정보를 학습 데이터로 활용하 여 배터리의 잔존 수명 예측을 위한 학습 모델을 구축할 수 있다. 일 실시예에서, 수명 예측 장치는 각 특징점을 기초로 Vt1-Vt2 값, Vt1-Voc2 값, Voc1-Voc2 값, Vt2-Vt3 값 및 Voc2-Voc3 값을 이산형 패턴 데이터로서 수집하고, Vt1-Vt2 구간, Vt1-Voc2 구간, Voc1-Voc2 구간, Vt2- Vt3 구간 및 Voc2-Voc3 구간에서의 세부 데이터에 관한 그래프 이미지를 연속형 패턴 데이터로서 수집할 수 있 다. 즉, 수명 예측 장치는 그래프 상에서 특성의 변화 패턴을 특징값과 이미지로 변환하고 이를 학습함으 로써 수명 예측을 위한 학습 모델을 구축할 수 있다. 이때, 학습 모델은 이산형 패턴 데이터와 연속형 패턴 데 이터를 각각 독립적으로 학습한 결과로서 생성될 수 있고, 이산형 패턴 데이터와 연속형 패턴 데이터의 조합 데 이터를 학습한 결과로서 생성될 수도 있다.한편, 예측 모델의 구축에 사용되는 기계학습 모델은 결정 트리(Decision Tree), 앙상블 학습(Ensemble learning), 서포트 벡터 회귀(Support Vector Regression), 가우시안 프로세스 회귀(Gaussian Process Regression) 등을 포함할 수 있다. 수명 예측 장치는 예측 모델 구축 과정에서 각 모델의 특성에 따라 학 습 데이터에 대한 전처리 동작을 수행할 수 있다. 예를 들어, 전처리 동작은 데이터 샘플링(sampling), 정규화 (normalization) 등을 포함할 수 있다. 도 7은 본 발명에 따른 배터리의 간헐적 충전 및 간헐적 방전 시 특성 패턴에 관한 그래프 이미지를 설명하는 도면이다. 도 7을 참조하면, 수명 예측 장치는 배터리에 대한 간헐적 충전 또는 방전 그래프 상에서 연속형 패턴 데 이터로서 그래프 이미지를 생성하고 이를 학습 데이터로 사용할 수 있다. 그래프 이미지의 경우 특정 시간 구간 동안 반복적으로 변화하는 특성의 패턴 정보를 포함할 수 있으며, 수명 예측 장치는 특징값에 관한 이산형 패턴 데이터와 함께 학습하여 모델 구축을 위한 학습량을 높임과 동시에 잔존 수명의 예측 정확도를 향상시켜 예측 오차율을 줄일 수 있다. 상기에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특 허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2021-0156617", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 수명 예측 시스템을 설명하는 도면이다. 도 2는 도 1의 수명 예측 장치의 시스템 구성을 설명하는 도면이다. 도 3은 본 발명에 따른 재사용 가능한 배터리의 인공지능 활용 유효 수명 측정을 위한 장치의 동작을 설명하는 순서도이다. 도 4는 본 발명에 따른 수명 예측 장치가 배터리 충전 및 방전 시스템과 연동하여 동작하는 과정을 설명하는 도 면이다. 도 5는 본 발명에 따른 배터리의 간헐적 충전 및 간헐적 방전에 관한 전압 그래프를 설명하는 도면이다. 도 6은 본 발명에 따른 배터리의 간헐적 충전 및 간헐적 방전 시 전압 그래프 상에서 나타나는 특성 패턴을 설 명하는 도면이다. 도 7은 본 발명에 따른 배터리의 간헐적 충전 및 간헐적 방전 시 특성 패턴에 관한 그래프 이미지를 설명하는 도면이다."}
