{"patent_id": "10-2024-0111084", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0054700", "출원번호": "10-2024-0111084", "발명의 명칭": "대규모 언어 모델에 기반한 3차원 장면 생성 방법, 장치, 기기 및 기록 매체", "출원인": "베이징 바이두 넷컴 사이언스 테크놀로지 컴퍼니", "발명자": "리, 이천"}}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대규모 언어 모델(Large Language Model, LLM)에 기반한 3차원 장면 생성 방법에 있어서,타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서 라벨 정보를 획득하는 단계;상기 라벨 정보에 기반하여 LLM의 조회 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 조회 조작 제시정보에 기반하여 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하는 단계 - 상기 타겟 자산 세트는 상기 타겟 3차원 장면에서의 타겟 자산, 상기 타겟 자산의 타겟 재질 정보 및 상기 타겟 자산의 타겟 장면 속성 정보를포함함 -; 및상기 타겟 자산 세트에 기반하여 상기 타겟 3차원 장면을 생성하는 단계;를 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 방법."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서 라벨 정보를 획득하는 단계는,상기 묘사 정보에 기반하여 상기 LLM의 추출 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 추출 조작제시 정보에 기반하여, 상기 묘사 정보를 처리하여, 상기 라벨 정보를 획득하는 단계를 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 방법."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하는 단계는,상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여, 상기 라벨 정보와 미리 기록된 복수의 후보 정보를매칭하여, 상기 타겟 자산 세트의 타겟 정보를 획득하는 단계; 및상기 타겟 정보에 기반하여 상기 타겟 자산 세트를 획득하는 단계;를 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 방법."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 타겟 정보에 기반하여 상기 타겟 자산 세트를 획득하는 단계는,상기 타겟 정보에 기반하여, 사용자가 자체 정의한 로컬 자산 라이브러리 내에서 상기 타겟 자산 세트를 획득하는 단계를 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 방법."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2025-0054700-3-상기 타겟 자산 세트에 기반하여 상기 타겟 3차원 장면을 생성하는 단계는,상기 타겟 자산 세트에 기반하여 초기 3차원 장면을 생성하는 단계; 및상기 라벨 정보에서의 장면 기능 정보에 기반하여, 상기 초기 3차원 장면을 조정하여, 상기 타겟 3차원 장면을생성하는 단계;를 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 방법."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,사용자에게 상기 라벨 정보를 디스플레이하는 단계;상기 사용자에 의해 수정된 라벨 정보를 획득하는 단계; 및상기 수정된 라벨 정보에 기반하여 수정된 타겟 자산 세트를 획득하고, 수정된 타겟 자산 세트에 기반하여 수정된 타겟 3차원 장면을 생성하는 단계;를 더 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 방법."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,사용자에게 상기 타겟 3차원 장면을 디스플레이하는 단계; 및상기 사용자의 수정 명령에 따라, 수정된 타겟 3차원 장면을 생성하는 단계;를 더 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 방법."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "대규모 언어 모델(Large Language Model, LLM)에 기반한 3차원 장면 생성 장치에 있어서,타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서 라벨 정보를 획득하기 위한 처리 모듈;상기 라벨 정보에 기반하여 LLM의 조회 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 조회 조작 제시정보에 기반하여 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하기 위한 획득 모듈 - 상기 타겟 자산 세트는 상기 타겟 3차원 장면에서의 타겟 자산, 상기 타겟 자산의 타겟 재질 정보 및 상기 타겟 자산의 타겟 장면속성 정보를 포함함 -; 및상기 타겟 자산 세트에 기반하여 상기 타겟 3차원 장면을 생성하기 위한 생성 모듈;을 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 장치."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 처리 모듈은,상기 묘사 정보에 기반하여 상기 LLM의 추출 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 추출 조작제시 정보에 기반하여, 상기 묘사 정보를 처리하고, 상기 라벨 정보를 획득하는데 더 사용되는,대규모 언어 모델에 기반한 3차원 장면 생성 장치. 공개특허 10-2025-0054700-4-청구항 10 제8항에 있어서,상기 획득 모듈은,상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여, 상기 라벨 정보와 미리 기록된 복수의 후보 정보를매칭하여, 상기 타겟 자산 세트의 타겟 정보를 획득하고,상기 타겟 정보에 기반하여 상기 타겟 자산 세트를 획득하는데 더 사용되는,대규모 언어 모델에 기반한 3차원 장면 생성 장치."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 획득 모듈은,상기 타겟 정보에 기반하여, 사용자가 자체 정의한 로컬 자산 라이브러리 내에서 상기 타겟 자산 세트를 획득하는데 더 사용되는,대규모 언어 모델에 기반한 3차원 장면 생성 장치."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 생성 모듈은,상기 타겟 자산 세트에 기반하여 초기 3차원 장면을 생성하고,상기 라벨 정보에서의 장면 기능 정보에 기반하여, 상기 초기 3차원 장면을 조정하여, 상기 타겟 3차원 장면을생성하는데 더 사용되는,대규모 언어 모델에 기반한 3차원 장면 생성 장치."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항 내지 제12항 중 어느 한 항에 있어서,사용자에게 상기 라벨 정보를 디스플레이하고, 상기 사용자에 의해 수정된 라벨 정보를 획득하고, 상기 수정된라벨 정보에 기반하여 수정된 타겟 자산 세트를 획득하고, 수정된 타겟 자산 세트에 기반하여 수정된 타겟 3차원 장면을 생성하기 위한 제1 수정 모듈을 더 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 장치."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항 내지 제12항 중 어느 한 항에 있어서,사용자에게 상기 타겟 3차원 장면을 디스플레이하고, 상기 사용자의 수정 명령에 기반하여 수정된 타겟 3차원장면을 생성하기 위한 제2 수정 모듈을 더 포함하는,대규모 언어 모델에 기반한 3차원 장면 생성 장치."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 기기에 있어서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 연결되는 메모리;를 포함하고, 공개특허 10-2025-0054700-5-상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서에 의해 제1항 내지 제7항 중 어느 한 항의 방법이 수행되도록 하는,전자 기기."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 기록 매체에 있어서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제7항 중 어느 한 항의 방법을 수행하도록 하는,비일시적 컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2024-0111084", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "비일시적 컴퓨터 판독 가능 기록 매체에 저장되어 있는 컴퓨터 프로그램에 있어서, 상기 컴퓨터 프로그램이 프로세서에 의해 수행될 때, 제1항 내지 제7항 중 어느 한 항의 방법을 구현하는,컴퓨터 프로그램."}
{"patent_id": "10-2024-0111084", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 인공 지능"}
{"patent_id": "10-2024-0111084", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 것으로, 구체적으로 3차원 모델링, 대규모 언어 모델 등 기술 분야인 대 규모 언어 모델에 기반한 3차원 장면 생성 방법, 장치, 기기 및 기록 매체를 제공한다. 대규모 언어 모델에 기반 한 3차원 장면 생성 방법은, 타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서의 라벨 정보를 획득 하는 단계; 상기 라벨 정보에 기반하여 LLM의 조회 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여, 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하는 단계 - 상기 타겟 자산 세트 는 상기 타겟 3차원 장면에서의 타겟 자산, 상기 타겟 자산의 타겟 재질 정보 및 상기 타겟 자산의 타겟 장면 속 성 정보를 포함함 -; 상기 타겟 자산 세트에 기반하여 상기 타깃 3차원 장면을 생성하는 단계를 포함하고, 본 개 시는 3차원 장면을 간단하고 효율적으로 생성할 수 있다. 대 표 도 - 도1"}
{"patent_id": "10-2024-0111084", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2025-0054700 CPC특허분류 G06T 15/04 (2013.01) G06T 17/00 (2013.01) 발명자 장, 씨아오동 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 10 스트리트, 넘버 10, 바이두 캠퍼스 2플로어리, 시옌 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 10 스트리트, 넘버 10, 바이두 캠퍼스 2플로어명 세 서 청구범위 청구항 1 대규모 언어 모델(Large Language Model, LLM)에 기반한 3차원 장면 생성 방법에 있어서, 타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서 라벨 정보를 획득하는 단계; 상기 라벨 정보에 기반하여 LLM의 조회 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하는 단계 - 상기 타겟 자산 세트는 상기 타 겟 3차원 장면에서의 타겟 자산, 상기 타겟 자산의 타겟 재질 정보 및 상기 타겟 자산의 타겟 장면 속성 정보를 포함함 -; 및 상기 타겟 자산 세트에 기반하여 상기 타겟 3차원 장면을 생성하는 단계; 를 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 방법. 청구항 2 제1항에 있어서, 상기 타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서 라벨 정보를 획득하는 단계는, 상기 묘사 정보에 기반하여 상기 LLM의 추출 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 추출 조작 제시 정보에 기반하여, 상기 묘사 정보를 처리하여, 상기 라벨 정보를 획득하는 단계를 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 방법. 청구항 3 제1항에 있어서, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득 하는 단계는, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여, 상기 라벨 정보와 미리 기록된 복수의 후보 정보를 매칭하여, 상기 타겟 자산 세트의 타겟 정보를 획득하는 단계; 및 상기 타겟 정보에 기반하여 상기 타겟 자산 세트를 획득하는 단계; 를 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 방법. 청구항 4 제3항에 있어서, 상기 타겟 정보에 기반하여 상기 타겟 자산 세트를 획득하는 단계는, 상기 타겟 정보에 기반하여, 사용자가 자체 정의한 로컬 자산 라이브러리 내에서 상기 타겟 자산 세트를 획득하 는 단계를 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 방법. 청구항 5 제1항에 있어서,상기 타겟 자산 세트에 기반하여 상기 타겟 3차원 장면을 생성하는 단계는, 상기 타겟 자산 세트에 기반하여 초기 3차원 장면을 생성하는 단계; 및 상기 라벨 정보에서의 장면 기능 정보에 기반하여, 상기 초기 3차원 장면을 조정하여, 상기 타겟 3차원 장면을 생성하는 단계; 를 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 방법. 청구항 6 제1항 내지 제5항 중 어느 한 항에 있어서, 사용자에게 상기 라벨 정보를 디스플레이하는 단계; 상기 사용자에 의해 수정된 라벨 정보를 획득하는 단계; 및 상기 수정된 라벨 정보에 기반하여 수정된 타겟 자산 세트를 획득하고, 수정된 타겟 자산 세트에 기반하여 수정 된 타겟 3차원 장면을 생성하는 단계; 를 더 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 방법. 청구항 7 제1항 내지 제6항 중 어느 한 항에 있어서, 사용자에게 상기 타겟 3차원 장면을 디스플레이하는 단계; 및 상기 사용자의 수정 명령에 따라, 수정된 타겟 3차원 장면을 생성하는 단계; 를 더 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 방법. 청구항 8 대규모 언어 모델(Large Language Model, LLM)에 기반한 3차원 장면 생성 장치에 있어서, 타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서 라벨 정보를 획득하기 위한 처리 모듈; 상기 라벨 정보에 기반하여 LLM의 조회 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하기 위한 획득 모듈 - 상기 타겟 자산 세트 는 상기 타겟 3차원 장면에서의 타겟 자산, 상기 타겟 자산의 타겟 재질 정보 및 상기 타겟 자산의 타겟 장면 속성 정보를 포함함 -; 및 상기 타겟 자산 세트에 기반하여 상기 타겟 3차원 장면을 생성하기 위한 생성 모듈; 을 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 장치. 청구항 9 제8항에 있어서, 상기 처리 모듈은, 상기 묘사 정보에 기반하여 상기 LLM의 추출 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 추출 조작 제시 정보에 기반하여, 상기 묘사 정보를 처리하고, 상기 라벨 정보를 획득하는데 더 사용되는, 대규모 언어 모델에 기반한 3차원 장면 생성 장치. 청구항 10 제8항에 있어서, 상기 획득 모듈은, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여, 상기 라벨 정보와 미리 기록된 복수의 후보 정보를 매칭하여, 상기 타겟 자산 세트의 타겟 정보를 획득하고, 상기 타겟 정보에 기반하여 상기 타겟 자산 세트를 획득하는데 더 사용되는, 대규모 언어 모델에 기반한 3차원 장면 생성 장치. 청구항 11 제10항에 있어서, 상기 획득 모듈은, 상기 타겟 정보에 기반하여, 사용자가 자체 정의한 로컬 자산 라이브러리 내에서 상기 타겟 자산 세트를 획득하 는데 더 사용되는, 대규모 언어 모델에 기반한 3차원 장면 생성 장치. 청구항 12 제8항에 있어서, 상기 생성 모듈은, 상기 타겟 자산 세트에 기반하여 초기 3차원 장면을 생성하고, 상기 라벨 정보에서의 장면 기능 정보에 기반하여, 상기 초기 3차원 장면을 조정하여, 상기 타겟 3차원 장면을 생성하는데 더 사용되는, 대규모 언어 모델에 기반한 3차원 장면 생성 장치. 청구항 13 제8항 내지 제12항 중 어느 한 항에 있어서, 사용자에게 상기 라벨 정보를 디스플레이하고, 상기 사용자에 의해 수정된 라벨 정보를 획득하고, 상기 수정된 라벨 정보에 기반하여 수정된 타겟 자산 세트를 획득하고, 수정된 타겟 자산 세트에 기반하여 수정된 타겟 3차 원 장면을 생성하기 위한 제1 수정 모듈을 더 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 장치. 청구항 14 제8항 내지 제12항 중 어느 한 항에 있어서, 사용자에게 상기 타겟 3차원 장면을 디스플레이하고, 상기 사용자의 수정 명령에 기반하여 수정된 타겟 3차원 장면을 생성하기 위한 제2 수정 모듈을 더 포함하는, 대규모 언어 모델에 기반한 3차원 장면 생성 장치. 청구항 15 전자 기기에 있어서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 연결되는 메모리; 를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적 어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서에 의해 제1항 내지 제7항 중 어느 한 항 의 방법이 수행되도록 하는, 전자 기기. 청구항 16 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 기록 매체에 있어서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제7항 중 어느 한 항의 방법을 수행하도록 하는, 비일시적 컴퓨터 판독 가능 기록 매체. 청구항 17 비일시적 컴퓨터 판독 가능 기록 매체에 저장되어 있는 컴퓨터 프로그램에 있어서, 상기 컴퓨터 프로그램이 프로세서에 의해 수행될 때, 제1항 내지 제7항 중 어느 한 항의 방법을 구현하는, 컴퓨터 프로그램. 발명의 설명 기 술 분 야 본 개시는 인공 지능 기술 분야에 관한 것으로, 구체적으로 3차원 모델링, 대규모 언어 모델 등 기술 분야에 관 한 것으로, 특히 대규모 언어 모델에 기반한 3차원 장면 생성 방법, 장치, 장치 및 기록 매체에 관한 것이다."}
{"patent_id": "10-2024-0111084", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능 기술의 발전에 따라, 게임 업계, 애니메이션 업계, 디지털 휴먼 업계 등에서 3차원(3D) 장면 제작이 널리 사용된다. 관련 기술에서, 3차원 장면은 일반적으로 렌더링 엔진에서 디자이너가 인공적으로 제작한다."}
{"patent_id": "10-2024-0111084", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 대규모 언어 모델에 기반한 3차원 장면 생성 방법, 장치, 기기 및 기록 매체를 제공한다. 본 개시의 일 측면에 따르면, 대규모 언어 모델에 기반한 3차원 장면생성 방법을 제공하고, 타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서의 라벨 정보를 획득하는 단계; 상기 라벨 정보에 기반하여 LLM의 조 회 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여, 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하는 단계 - 상기 타겟 자산 세트는 상기 타겟 3차원 장면에서의 타겟 자산, 상 기 타겟 자산의 타겟 재질 정보 및 상기 타겟 자산의 타겟 장면 속성 정보를 포함함 -; 및 상기 타겟 자산 세트 에 기반하여 상기 타깃 3차원 장면을 생성하는 단계를 포함한다. 본 개시의 다른 측면에 따르면, 대규모 언어 모델에 기반한 3차원 장면생성장치를 제공하고, 타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서의 라벨 정보를 획득하기 위한 처리 모듈; 상기 라벨 정보에 기반하 여 LLM의 조회 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여, 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하기 위한 획득 모듈 - 상기 타겟 자산 세트는 상기 타겟 3차원 장면에서의 타겟 자산, 상기 타겟 자산의 타겟 재질 정보, 및 상기 타 겟 자산의 타겟 장면 속성 정보를 포함함 -; 및 상기 타겟 자산 세트에 기반하여 상기 타깃 3차원 장면을 생성 하기 위한 생성 모듈을 포함한다. 본 개시의 다른 측면에 따르면, 전자 기기를 제공하고, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세 서에 통신 연결되는 메모리;를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명 령이 저장되어 있고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서에 의해 상기 측면 및 임의의 가능한 구현 방식의 방법이 수행되도록 한다. 본 개시의 다른 측면에 따르면, 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체를 제공하고, 상기 컴퓨터 명령은 상기 컴퓨터가 상기 측면 및 임의의 가능한 구현 방식의 방법을 수행하도록 한다. 본 개시의 다른 측면에 따르면, 컴퓨터 프로그램 제품을 제공하고, 컴퓨터 프로그램을 포함하고, 상기 컴퓨터 프로그램이 프로세서에 의해 수행될 때, 상기 측면 및 임의의 가능한 구현 방식의 방법을 구현한다. 본 개시의 기술 방안에 따르면, 3차원 장면을 간단하고 효율적으로 생성할 수 있다. 본 명세서에서 설명된 내용은 본 발명의 실시예의 키 또는 중요한 특징을 식별하려는 것이 아니고, 또한 본 발 명의 범위를 제한하려는 것도 아닌 것을 이해하여야 한다. 본 발명의 다른 특징은 이하의 명세서를 통해 용이하 게 이해할 수 있다."}
{"patent_id": "10-2024-0111084", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 결부하여 본 출원의 예시적 실시예를 설명하되, 여기에는 이해를 돕기 위한 본 출원의 실"}
{"patent_id": "10-2024-0111084", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "시예의 다양한 세부 사항이 포함되며, 이는 단지 예시적인 것으로 간주되어야 한다. 따라서, 본 기술분야의 통 에서의 기술자는 본 출원의 범위와 사상을 벗어나지 않으면서, 여기서 설명되는 실시예에 대한 다양한 변경과 수정이 이루어질 수 있음을 이해해야 한다. 마찬가지로, 명확성 및 간결성을 위해, 아래의 설명에서 공지된 기 능과 구조에 대한 설명을 생략한다. 관련 기술에서, 3차원 장면은 인공적으로 제작되는 것이기 때문에, 효율과 정확성 등 측면에서 모두 문제가 존 재한다. 3차원 장면 생성의 정밀도와 효율을 향상시키기 위해, 본 개시는 이하의 실시예를 제공한다. 도 1은 본 개시의 제1 실시예에 따른 개략도이다. 본 실시예는 대규모 언어 모델에 기반한 3차원 장면 생성 방 법을 제공하고, 당해 방법은 다음과 같은 단계를 포함하고, 101, 타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서의 라벨 정보를 획득한다. 102, 상기 라벨 정보에 기반하여 LLM의 조회 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하고, 상기 타겟 자산 세트는 상기 타 겟 3차원 장면에서의 타겟 자산, 상기 타겟 자산의 타겟 재질 정보 및 상기 타겟 자산의 타겟 장면 속성 정보를 포함한다. 103, 상기 타겟 자산 세트에 기반하여 상기 타겟 3차원 장면을 생성한다. 묘사 정보는 사용자에 의해 입력된 타겟 3차원 장면에 대한 묘사 정보를 가리키고, 예를 들어, 묘사 정보는 \"나 는 하나의 겨울철 중국 북방의 삼림 게임용 장면을 생성하고 싶다. 그리고 장면 내에는 하나의 흙길과 말뚝으로 구성된 집이 있고, 집 지붕 굴뚝에서 하얀 연기가 나고, 집 창문안에는 따뜻한 노란색의 불빛이 있고, 차가운 색조이고, 사실적이다”이다.라벨 정보는 당해 묘사 정보에 대한 키 정보를 가리키고, 예를 들어, 라벨 정보는 하나의 장면, 겨울철, 중국 북방, 삼림, 게임용, 하나의 흙길, 말뚝으로 구성된 집, 집 지붕 굴뚝, 굴뚝에서 하얀 연기가 나고, 집 창문안 에는 따뜻한 노란색의 불빛이 있고, 차가운 색조, 사실적을 포함한다. 라벨 정보를 획득한 후, 대규모 언어 모델(Large Language Model, LLM)을 사용하여 라벨 정보에 매칭하는 타겟 자산 세트를 획득할 수 있다. LLM의 입력은 제시 정보(prompt)를 포함하고, LLM은 당해 제시 정보에 기반하여 대응하는 출력 정보를 생성한다. 타겟 자산 세트를 획득하기 위해, LLM의 제시 정보는 조회 조작 제시 정보라고 부를 수 있고, LLM은 당해 조회 조작 제시 정보에 기반하여 라벨 정보에 매칭하는 타겟 자산 세트를 조회 및 획득한다. 그 중 조회 조작 제시 정보는 상술한 라벨 정보를 포함할 수 있고, 나아가, 지시 정보를 포함할 수도 있고, 당해 지시 정보는 LLM이 조회 조작을 수행하도록 지시하는데 사용되고, 당해 지시 정보의 구체적인 컨텐츠는 설정할 수 있다. LLM은 당 해 조회 조작 제시 정보를 수신한 후, 당해 제시 정보에 기반하여 타겟 자산 세트를 획득할 수 있다. 3차원 장면은 자산으로 구성되는 것이고, 자산은 예를 들어, 모델, 재질 볼, 맵, 입자 등을 포함하고, 모델은 예를 들어, 집, 꽃, 풀 등 모델을 포함한다. 타겟 3차원 장면에 매칭하는 자산은 타겟 자산이라고 부르고, 예를 들어, 라벨 정보가 집을 포함하는 경우, 집 모델을 타겟 자산으로 획득한다. 타겟 장면 속성 정보는 타겟 자산의 타겟 3차원 장면 내의 관련 정보를 가리키며, 예를 들어, 크기, 위치, 회전 각도 등을 포함한다. 타겟 재질 정보는 색상, 거칠기 등 타겟 자산의 재질 관련 정보를 가리킨다. 타겟 자산 세트를 획득한 후, 가능한 타겟 자산 세트에 기반하여 타겟 3차원 장면을 생성하고, 예를 들어, 장면 속성 정보에서의 사이즈 정보에 기반하여 사이즈에 대응하는 타겟 자산을 생성하고, 생성된 타겟 자산을 장면 속성 정보에서의 지정 위치에 배치한다. 관련 기술에서, 타겟 자산만 획득한 경우, 타겟 자산의 장면 속성 정보는 미결정된 것이기 때문에, 예를 들어, 모델의 위치를 무작위로 결정하고, 그러면 나아가 사용자가 타겟 자산에 대해 더 조정할 필요가 있어, 복잡도가 높아진다. 본 실시예에서, 타겟 자산 세트에는 타겟 자산을 포함할 뿐만 아니라, 타겟 자산의 장면 속성 정보와 재질 정보 를 더 포함하고, 타겟 자산, 그의 재질, 위치, 크기 등 장면 속성 정보를 한 번에 획득하는 것에 상당하고, 타 겟 자산만을 획득하는 방식에 비해, 3차원 장면을 간단하고 효율적으로 생성할 수 있다. 또한, LLM의 조회 조작 제시 정보를 생성함으로써, LLM을 사용하여 타겟 자산 세트를 획득할 수 있어, 처리 효율과 정밀도를 향상시킨 다. 본 개시의 실시예를 더 잘 이해하기 위해, 본 개시의 실시예가 적용될 수 있는 응용 장면(application scenario)을 설명한다. 도 2는 본 개시의 실시예에서 제공되는 응용 장면의 개략도이다. 당해 장면에서는 사용자 단말과 서버 를 포함하고, 사용자 단말은 개인용 컴퓨터(Personal Computer, PC), 모바일 디바이스(예를 들면 휴 대전화), 태블릿, 노트북, 스마트 웨어러블 디바이스 등을 포함하고, 서버는 로컬 서버 또는 클라우드 서 버 등일 수 있고, 서버는 단일 서버 또는 서버 클러스터일 수 있다. 도 3에 도시된 바와 같이, 대규모 언어 모델에 기반한 3차원 장면 생성 시스템은 렌더링 엔진, 플러그인 , 대규모 언어 모델(Large Language Model, LLM) 및 자산 라이브러리를 포함한다. 렌더링 엔진(30 1)은 사용자 단말에 배치하고, 렌더링 엔진은 예를 들어, Unity 소프트웨어, 가상 엔진(Unreal Engine, UE) 소 프트웨어 등이며, Unity 소프트웨어와 UE 소프트웨어(구체적으로 UE4 또는 UE5일 수 있다)는 모두 동적 이미지 를 실시간으로 처리하고 3차원 렌더링을 수행할 수 있는 실시간 렌더링 엔진이다. 플러그인은 렌더링 엔진 내에 미리 설치한다. LLM은 서버에 설정된다. 렌더링 엔진은 미리 설정된 인터페이스를 통해 LLM을 호출하여, 렌더링 엔진과 LLM 사이의 통신을 구현할 수 있다. 자산 라이브러리는 플러그 인에 의해 제공될 수 있고, 또는 사용자 개인 스타일의 3차원 장면을 생성하기 위해, 자산 라이브러리는 사용자 가 자체 정의한 로컬 자산 라이브러리일 수 있다. 도 3의 자산 라이브러리는 로컬 자산 라이브러리를 사용 하여 디스플레이된다. LLM은 최근 인공 지능 분야의 핫한 문제이고, LLM은 대량의 텍스트 데이터에서 사전 훈련을 수행함으로써, 풍부 한 언어 지식과 세계 지식을 학습하고, 이를 통해 각종 자연어 처리(Natural Language Processing, NLP) 작업 에서 놀라운 효과를 획득할 수 있는 사전 훈련 언어 모델이다. 문심일언(文心一言) 및 ChatGPT 등은 모두 LLM에 기반하여 개발된 애플리케이션이고, 이들은 유창하고, 논리적이며, 창의적인 텍스트 콘텐츠를 생성하고, 나아가 인간과 자연스럽게 대화할 수 있다. 구체적으로, 대규모 언어 모델은 Transformer에 기반한 범용 사전 트레이닝(Generative Pre-trained Transformer, GPT) 모델, 지식 통합에 기반한 확장 표현(Enhanced Representation through Knowledge Integration, ERNIE) 모델 등일 수 있다. 자산 라이브러리에는 자산, 자산 장면 속성 정보, 자산 재질 정보가 포함된다. 각 정보는 자산 폴더, 장면 속성 폴더 및 재질 폴더라고 부를 수 있는 폴더에 대응한다. 각 폴더는 계층 형식일 수 있고, 예를 들어, 자산 폴더 에 대해 제1 레벨은 모델이고, 제2 레벨은 식생, 암석, 건축류, 도구류 등을 포함하고, 식생에 대응하는 제3레 벨은 나무, 꽃 등을 포함한다. 장면 속성 폴더에 대해, 제1급은 불빛, 날씨, 화면 스타일, 자산 위치 등을 포함 하고, 불빛에 대응하는 제2급은 불빛 강도, 불빛 색, 불빛 위치 등을 포함하고, 날씨에 대응하는 제2급은 맑은 날, 비가 내림, 및 눈이 내림 등을 포함한다. 재질 폴더에 대해, 색, 재질 속성, 적설/이끼 높이 등 재질 조정 가능한 파라미터를 기록할 수 있다. 로컬 자산 라이브러리를 예로 들면, 상술한 각종 정보(자산, 재질 정보, 장면 속성 정보)는 사용자가 사전에 작 성한 것이다. 장면 속성 정보에 대해, 자산 세트 도구를 사용하여 작성할 수 있고, 자산 세트 도구는 자산 관리 도구 또는 레벨 애니메이션 시퀀스 도구이고, 자산 관리 도구는 예를 들면, 변형 매니저(Variant Manager) 도구 이고, 레벨 애니메이션 시퀀스 도구는 예를 들면, 레벨 시퀀스(Level Sequence) 도구 등이다. Variant Manager 도구와 Level Sequence 도구는 모두 UE에서의 자산 세트 도구이고, Variant Manager 도구는 자산 위치, 재질 볼, 장면의 각종 속성 등의 조합을 세트 파일로 하고, Level Sequence 도구는 키 프레임을 설정하는 방식으로 자산/장면 속성의 동적 전환을 구현할 수 있다. 또한 로컬 자산 라이브러리 내에서의 자산 관련 정보는 자산 라이브러리 리스트에 기록할 수 있다. 자산 라이브 러리 리스트에 기록된 정보는 후보 정보라고 부를 수 있다. 렌더링 엔진은 사용자에게 인터랙티브 인터페이스를 제공하고, 당해 인터랙티브 인터페이스는 입력 상자를 포함 하고, 사용자는 당해 입력 상자 내에서 타겟 3차원 장면의 묘사 정보를 입력할 수 있고, 예를 들어, \"나는 하나 의 겨울철 중국 북방의 삼림 게임용 장면을 생성하고 싶다. 그리고 장면 내에는 하나의 흙길과 말뚝으로 구성된 집이 있고, 집 지붕 굴뚝에서 하얀 연기가 나고, 집 창문안에는 따뜻한 노란색의 불빛이 있고, 차가운 색조이고, 사실적이다”이다. 렌더링 엔진은 미리 설정된 인터페이스를 통해 LLM을 호출하고, LLM을 사용하여 상기 묘사 정보에 대해 추출 처 리를 수행하여 라벨 정보를 획득한다. 예를 들어, 상술한 정보에 기반하여 추출된 라벨 정보는 하나의 장면, 겨 울철, 중국 북방, 삼림, 게임용, 하나의 흙길, 말뚝으로 구성된 집, 집 지붕 굴뚝, 굴뚝에서 하얀 연기가 나고, 집 창문안에는 따뜻한 노란색의 불빛이 있고, 차가운 색조, 사실적을 포함한다. 본 실시예에서, LLM을 사용하여 묘사 정보에서의 라벨 정보를 추출하면, 묘사 정보에 기반하여 보다 간결하고 정확한 라벨 정보를 획득할 수 있고, 라벨 정보에 기반하여 획득된 타겟 자산 세트의 정밀도를 더 향상시키고, 3차원 장면의 생성 정확성과 효율을 향상시킨다. LLM 라벨 정보를 획득한 후, 라벨 정보와 자산 라이브러리 리스트에서의 후보 정보(후보 자산 정보, 후보 재질 정보 및 후보 장면 속성 정보)를 매칭하고, 라벨 정보에 매칭하는 타겟 정보(타깃 자산 정보, 타겟 재질 정보 및 타겟 장면 속성 정보)를 획득할 수 있다. 그 후에, 타겟 정보를 플러그인에 송신한다. 플러그인은 타겟 정보에 기반하여 타겟 자산 세트(타깃 자산 및 이에 대응하는 타겟 재질 정보, 및 타겟 장면 속성 정보)를 획득하고, 타겟 자산 세트에 기반하여 타겟 3차원 장면을 생성한다. 렌더링 엔진은 플러그인에 의해 생성된 타겟 3차원 장면을 렌더링한 후 사용자에게 디스플레이한다. 상술한 응용 장면을 조합하여, 본 개시는 이하의 실시예를 더 제공한다. 도 4는 본 개시의 제2 실시예에 따른 개략도이다. 본 실시예는 대규모 언어 모델에 기반한 3차원 장면 생성 방 법을 제공하고, 당해 방법은 다음과 같은 단계를 포함하고,401, 타겟 3차원 장면의 묘사 정보에 기반하여 LLM의 추출 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상 기 추출 조작 제시 정보에 기반하여, 상기 묘사 정보에서의 라벨 정보를 획득한다. 예를 들면, 사용자는 렌더링 엔진에 의해서 제공된 인터페이스를 통해서 묘사 정보, 예를 들면, \"나는 하나의 겨울철 중국 북방의 삼림 게임용 장면을 생성하고 싶다. 그리고 장면 내에는 하나의 흙길과 말뚝으로 구성된 집 이 있고, 집 지붕 굴뚝에서 하얀 연기가 나고, 집 창문안에는 따뜻한 노란색의 불빛이 있고, 차가운 색조이고, 사실적이다”를 입력한다. 렌더링 엔진은 미리 설정된 인터페이스를 통해 LLM을 호출하고, LLM을 사용하여 묘사 정보에서 라벨 정보를 추출하고, 예를 들어, 라벨 정보는 하나의 장면, 겨울철, 중국 북방, 삼림, 게임용, 하나 의 흙길, 말뚝으로 구성된 집, 집 지붕 굴뚝, 굴뚝에서 하얀 연기가 나고, 집 창문안에는 따뜻한 노란색의 불빛 이 있고, 차가운 색조, 사실적을 포함한다. 구체적으로 렌더링 엔진은 LLM에 제시 정보(prompt)를 송신할 수 있고, 당해 제시 정보는 추출 조작 제시 정보 라고 부를 수 있고, 당해 추출 조작 제시 정보는 묘사 정보를 포함하고, 지시 정보를 더 포함하고, 당해 지시 정보는, LLM가 정보 추출 조작을 수행하도록 지시하는데 사용되고, 지시 정보의 구체적인 컨텐츠는 설정할 수 있다. LLM은 당해 추출 조작 제시 정보에 기반하여 묘사 정보에서의 라벨 정보를 추출할 수 있다. LLM이 라벨 정보를 획득한 후, 라벨 정보를 사용자에게 디스플레이할 수도 있다. 나아가, LLM은 각 라벨 정보의 중요도를 결정하고, 중요도에 따라 각 라벨 정보를 차례로 디스플레이할 수도 있 다. 본 실시예에서, LLM을 사용하여 묘사 정보에서의 라벨 정보를 추출하면, 묘사 정보에 기반하여 보다 간결하고 정확한 라벨 정보를 획득할 수 있고, 라벨 정보에 기반하여 획득된 타겟 자산 세트의 정밀도를 더 향상시키고, 3차원 장면의 생성 정확성과 효율을 향상시킨다. 402, 상기 라벨 정보에 기반하여 LLM의 조회 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여, 상기 라벨 정보와 미리 기록된 복수의 후보 정보를 매칭하여, 타겟 자산 세트의 타겟 정 보를 획득한다. 복수의 후보 정보는 3가지 종류로 나눌 수 있고, 제1 종류는 자산 정보이고, 예를 들면 식생-북방-나무 및 지면 -삼림-토지, 건축-집-나무, 입자-연기-굴뚝 연기 등이고, 제2 종류는 장면 속성 정보이고, 예를 들면, 계절-겨 울철, 레이아웃- 삼림, 색조- 차가운 색조, 스타일-사실적(畇茄), 불빛-창문이고; 제3 종류는 재질 정보이며, 예를 들면, 눈의 높이, 색의 색상, 법선의 강도, 거칠기의 강도 등이다. 상술한 자산 정보와 장면 속성 정보는 계층 형식으로 디스플레이하는 것을 예로 들고, 예를 들면 식생에 대해, 제1 계층은 \"식생”, 제2 계층은 북방, 제3 계층은 '나무 및 지면'이고, 마지막의 계층을 기록할 때까지, 이와 같이 유추하고, 예를 들어, 상술한 \"식 생-북방-나무 및 지면-삼림-토지”이며, 마찬가지로 제1계층의 \"식생”에 대해, 제2계층은 \"남방”의 식생 정보 를 더 포함한다고 가정하면, 관련된 자산 정보는 식생-남방-....으로 디스플레이할 수 있다. 복수의 후보 정보는 자산 라이브러리 리스트에 기록될 수 있고, LLM은 미리 학습된 대응 관계에 기반하여 라벨 정보에 매칭하는 타겟 정보를 획득할 수 있다. 예를 들어, 라벨 정보의 \"겨울철”은 자산 라이브러리의 \"겨울”, \"눈”, \"얼음”, \"추움”등 정보에 매칭한다. 본 실시예에서, 라벨 정보와 미리 기록된 후보 정보를 매칭하여, 타겟 정보를 획득하고, 타겟 정보를 간단하고 효율적으로 획득하여, 처리 효율을 향상시킬 수 있다. 403, 미리 설정된 플러그인을 사용하고, 상기 타겟 정보에 기반하여, 사용자가 자체 정의한 로컬 자산 라이브러 리 내에서 타겟 자산 세트를 획득한다. 타겟 정보를 획득한 후 LLM은 타겟 정보를 렌더링 엔진에 미리 설치된 플러그인에 송신할 수 있고, 당해 플러그 인은 타겟 정보에 기반하여 로컬 자산 라이브러리 내에서 타겟 자산 세트를 획득할 수 있다. 본 실시예에서, 사용자가 자체 정의한 로컬 자산 라이브러리 내에서 타겟 자산 세트를 획득하고, 사용자는 자체 의 수요에 따라 후보 자산 및 그의 관련 정보를 설정할 수 있고, 개성화된 타겟 3차원 장면을 생성할 수 있다. 404, 미리 설정된 플러그인을 사용하고, 상기 타겟 자산 세트에 기반하여 타겟 3차원 장면을 생성한다. 타겟 자산 세트는 타겟 자산, 이에 대응하는 타겟 재질 정보 및 타겟 장면 속성 정보를 포함하고, 따라서 당해 플러그인은 이러한 정보에 기반하여 직접 타겟 3차원 장면을 생성할 수 있어, 사용자가 자산 위치 등 속성을 설정할 필요가 없어, 사용자 쉽게 조작할 수 있다. 또한, 당해 플러그인은 또한 상기 타겟 자산 세트에 기반하여 초기 3차원 장면을 생성하고, 상기 라벨 정보에서 의 장면 기능 정보에 기반하여 상기 초기 3차원 장면을 조정하여, 상기 타겟 3차원 장면을 생성할 수 있다. 예를 들어, 상술한 라벨 정보는 \"게임용\"을 포함하고, 당해 정보는 장면 기능 정보이고, 플러그인은 각 기능에 대응하는 조작을 미리 설정할 수 있고, 그 후에, 미리 설정된 조작에 기반하여 초기 3차원 장면을 조정할 수 있 다. 예를 들면, 미리 설정된 게임용의 조정 규칙에 기반하여, 초기 3차원 장면에 대해 대량 세부 레벨(Level of Detail, LOD), 불빛, 해상도, 렌더링 품질 등 측면의 조정을 수행하여, 타겟 3차원 장면을 획득할 수 있다. 본 실시예에서, 장면 기능 정보에 기반하여 초기 3차원 장면을 조정하여, 타겟 3차원 장면을 획득하여, 타겟 3 차원 장면의 정밀도를 향상시키고, 렌더링 효과를 향상시킬 수 있다. 405, 렌더링 엔진을 사용하여, 상기 타겟 3차원 장면을 렌더링한다. 플러그인을 사용하고 타겟 3차원 장면을 생성한 후, 렌더링 엔진은 당해 타겟 3차원 장면을 렌더링하고, 렌더링 결과를 사용자에게 디스플레이한다. 나아가, 사용자가 렌더링 결과를 획득한 후, 수요에 따라 타겟 3차원 장면을 수정할 수 있다. 라벨 정보에 기반 하여 수정하거나, 또는 직접 타깃 3차원 장면 내의 자산 또는 장면 속성 정보(예를 들어, 위치) 등을 수정할 수 있다. 구체적으로, 사용자는 상기 라벨 정보를 디스플레이하고, 상기 사용자에 의해 수정된 라벨 정보를 획득하고, 상 기 수정된 라벨 정보에 기반하여 수정된 타겟 자산 세트를 획득하고, 수정된 타겟 자산 세트에 기반하여 수정된 타겟 3차원 장면을 생성할 수 있다. 예를 들어, 상술한 라벨 정보는 \"겨울\"을 포함하고, 사용자는 당해 라벨 정보를 \"여름\"으로 수정하고, 그 후에, 시스템은 여름에 관한 장면을 재생성할 수 있다. 본 실시예에서, 수정된 라벨 정보에 기반하여 타겟 3차원 장면을 수정하여, 사용자가 장면에 대해 구체적인 수 정 조작을 수행할 필요가 없어, 사용자 조작을 간략화하고, 처리 효율을 향상시킬 수 있다. 또한, 사용자에게 상기 타겟 3차원 장면을 디스플레이하고, 상기 사용자의 수정 명령에 따라, 수정된 타겟 3차 원 장면을 생성할 수도 있다. 수정 명령은 예를 들면, 타겟 3차원 장면에서의 모델을 수정하거나, 또는 모델의 위치 등을 수정하는 것이고, 당해 수정 명령에 기반하여 수정된 타겟 3차원 장면을 획득할 수 있다. 예를 들어, 타겟 3차원 장면에 하나의 원형 테이블이 있고, 사용자는 직접 당해 장면에서 당해 원형 테이블을 사각형 테이블로 수정할 수 있다. 본 실시예에서, 수정 명령에 기반하여 타겟 3차원 장면을 수정하면, 사용자가 원하는 개성화된 수정된 타겟 3차 원 장면을 획득할 수 있다. 도 5는 본 개시의 제3 실시예에 따른 개략도이다. 본 실시예는 대규모 언어 모델에 기반한 3차원 장면 생성 장 치를 제공하며, 도 5에 도시된 바와 같이, 당해 장치는 처리 모듈, 획득 모듈, 및 생성 모듈 을 포함한다. 처리 모듈은 타겟 3차원 장면의 묘사 정보를 처리하여, 상기 묘사 정보에서의 라벨 정보를 획득하는데 사 용되고, 획득 모듈은 상기 라벨 정보에 기반하여 LLM의 조회 조작 제시 정보를 생성하고, 상기 LLM을 사용 하여 상기 조회 조작 제시 정보에 기반하여, 상기 라벨 정보에 매칭하는 타겟 자산 세트를 획득하는데 사용되고, 상기 타겟 자산 세트는 상기 타겟 3차원 장면에서의 타겟 자산, 상기 타겟 자산의 타겟 재질 정보 및 상기 타겟 자산의 타겟 장면 속성 정보를 포함하고, 생성 모듈은 상기 타겟 자산 세트에 기반하여 상기 타 깃 3차원 장면을 생성하는데 사용된다. 본 실시예에서, 타겟 자산 세트는 타겟 자산을 포함할 뿐만 아니라, 타겟 자산의 장면 속성 정보와 재질 정보를 더 포함하고, 타겟 자산, 그의 재질, 위치, 크기 등 장면 속성 정보를 한 번에 획득하는 것에 상당하고, 타겟 자산만을 획득하는 방식에 비해, 3차원 장면을 간단하고 효율적으로 생성할 수 있다. 일부 실시예에서, 상기 처리 모듈은 또한 상기 묘사 정보에 기반하여 상기 LLM의 추출 조작 제시 정보를 생성하고, 상기 LLM을 사용하여 상기 추출 조작 제시 정보에 기반하여, 상기 묘사 정보를 처리하여, 상기 라벨 정보를 획득하는데 사용된다. 본 실시예에서, LLM을 사용하여 묘사 정보에서의 라벨 정보를 추출하면, 묘사 정보에 기반하여 보다 간결하고 정확한 라벨 정보를 획득할 수 있고, 라벨 정보에 기반하여 획득된 타겟 자산 세트의 정밀도를 더 향상시키고, 3차원 장면의 생성 정확성과 효율을 향상시킨다. 일부 실시예에서, 상기 획득 모듈은 또한, 상기 LLM을 사용하여 상기 조회 조작 제시 정보에 기반하여, 상 기 라벨 정보와 미리 기록된 복수의 후보 정보를 매칭하여, 상기 타겟 자산 세트의 타겟 정보를 획득하고, 상기 타겟 정보에 기반하여 상기 타겟 자산 세트를 획득하는데 사용된다. 본 실시예에서, 라벨 정보와 미리 기록된 후보 정보를 매칭하여, 타겟 정보를 획득하고, 타겟 정보를 간단하고 효율적으로 획득하여, 처리 효율을 향상시킬 수 있다. 일부 실시예에서, 상기 획득 모듈은 또한 상기 타겟 정보에 기반하여, 사용자가 자체 정의한 로컬 자산 라 이브러리 내에서 상기 타겟 자산 세트를 획득하는데 사용된다. 본 실시예에서, 사용자가 자체 정의한 로컬 자산 라이브러리 내에서 타겟 자산 세트를 획득하고, 사용자는 자체 의 수요에 따라 후보 자산 및 그의 관련 정보를 설정할 수 있고, 개성화된 타겟 3차원 장면을 생성할 수 있다. 일부 실시예에서, 상기 생성 모듈은 또한 상기 타겟 자산 세트에 기반하여 초기 3차원 장면을 생성하고, 상기 라벨 정보에서의 장면 기능 정보에 기반하여 상기 초기 3차원 장면을 조정하여, 상기 타겟 3차원 장면을 생성하는데 사용된다. 본 실시예에서, 장면 기능 정보에 기반하여 초기 3차원 장면을 조정하여, 타겟 3차원 장면을 획득하여, 타겟 3 차원 장면의 정밀도를 향상시키고, 렌더링 효과를 향상시킬 수 있다. 일부 실시예에서 당해 장치는, 사용자에게 상기 라벨 정보를 디스플레이하고, 상기 사용자에 의해 수정된 라벨 정보를 획득하고, 상기 수정된 라벨 정보에 기반하여 수정된 타겟 자산 세트를 획득하고, 수정된 타겟 자산 세트에 기반하여 수정된 타겟 3차 원 장면을 생성하기 위한 제1 수정 모듈을 더 포함한다. 본 실시예에서, 수정된 라벨 정보에 기반하여 타겟 3차원 장면을 수정하여, 사용자가 장면에 대해 구체적인 수 정 조작을 수행할 필요가 없어, 사용자 조작을 간략화하고, 처리 효율을 향상시킬 수 있다. 일부 실시예에서 당해 장치는, 사용자에게 상기 타겟 3차원 장면을 디스플레이하고, 상기 사용자의 수정 명령에 기반하여 수정된 타겟 3차원 장면을 생성하기 위한 제2 수정 모듈을 더 포함한다. 본 실시예에서, 수정 명령에 기반하여 타겟 3차원 장면을 수정하면, 사용자가 원하는 개성화된 수정된 타겟 3차 원 장면을 획득할 수 있다. 본 개시의 실시예에서, 서로 다른 실시예에서의 동일 또는 유사한 내용을 상호 참조할 수 있음을 이해하기 바란 다. 본 개시의 실시예에서의 \"제1\", \"제2\" 등은 구별을 위한 것일 뿐, 중요도의 높이, 타이밍의 전후 등을 나타내는 것이 아님을 이해할 수 있다. 본 개시의 기술 방안에 있어서, 관련되는 사용자 개인 정보의 수집, 저장, 사용, 가공, 전송, 제공, 개시 등의 처리는 모두 관련되는 법률 및 규정에 부합되고, 공서 양속을 위반하지 않는다. 본 개시의 실시예에 따르면, 본 개시는 나아가, 전자 기기, 판독 가능 기록 매체 및 컴퓨터 프로그램 제품을 제 공한다. 도 6에 도시된 바와 같이, 본 발명의 실시예를 구현할 수 있는 예시적인 전자 기기의 개략적인 블록도이다. 전자 기기는 랩톱 컴퓨터, 데스크톱 컴퓨터, 운영 플랫폼, 서버, 블레이드 서버, 대형 컴퓨터, 및 다른 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 의미한다. 전자 기기는 개인 디지털 처 리, 셀룰러폰, 스마트폰, 웨어러블 기기 및 다른 유사한 계산 장치와 같은 다양한 형태의 이동 장치를 의미할 수도 있다. 본문에서 나타낸 부재, 이들의 연결과 관계, 및 이들의 기능은 단지 예시적인 것으로, 본문에서 설 명 및/또는 요구된 본 개시의 구현을 한정하지 않는다. 도 6에 도시된 바와 같이, 기기는 컴퓨팅 유닛을 포함하고, 컴퓨팅 유닛은 판독 전용 메모리 (ROM)에 저장되어 있는 컴퓨터 프로그램 또는 저장 유닛로부터 랜덤 액세스 메모리(RAM) 에 로 드된 컴퓨터 프로그램에 따라, 다양한 적절한 동작과 처리를 실행할 수 있다. RAM에는 기기가 동작하 는데 필요한 여러가지 프로그램과 데이터도 저장할 수 있다. 컴퓨팅 유닛, ROM 및 RAM는 버스 를 통해 서로 연결된다. 입력/출력 (I/O)인터페이스도 버스에 연결된다. 전자 기기 중의 복수 컴포넌트는 I/O인터페이스에 연결되고, 키보드, 마우스 등과 같은 입력 유닛 ; 여러가지 타입의 디스플레이, 스피커 등과 같은 출력 유닛; 디스크, 광디스크 등과 같은 저장 유닛 및 네트워크 카드, 모뎀, 무선통신 트랜시버 등과 같은 통신 유닛을 포함한다. 통신 유닛은 기 기가 인터넷 등과 같은 컴퓨터 네트워크 및 여러가지 통신 네트워크 중의 적어도 하나를 통해 다른 기기와 정보/데이터를 교환할 수 있다. 컴퓨팅 유닛은 여러가지 처리와 계산 능력을 갖춘 범용 처리 컴포넌트 및 전용 처리 컴포넌트 중의 적어도 하나일 수 있다. 컴퓨팅 유닛의 일부 예는, 중앙 처리 유닛 (CPU), 그래픽스 처리 유닛(GPU), 다양한 전용 인공지능(AI)계산 팁, 다양한 기계학습 모델 알고리즘을 실행하는 컴퓨팅 유닛, 디지털 신호 프로세서(DSP) 및 임의의 적절한 프로세서, 컨트롤러, 마이크로 컨트롤러 등을 포함하지만, 이에 한정되지 않는다. 컴퓨팅 유닛 은 대규모 언어 모델에 기반한 3차원 장면 생성 방법 등과 같은 상기의 다양한 방법과 처리를 실행한다. 예를 들면, 일부 실시예에서, 대규모 언어 모델에 기반한 3차원 장면 생성 방법은 저장 유닛 등과 같은 기 계 판독 가능 매체에 유형적으로 포함되는 컴퓨터 소프트웨어 프로그램으로 구현할 수 있다. 일부 실시예에서, 컴퓨터 프로그램의 일부 또는 전부는 ROM및 통신 유닛 중의 적어도 하나를 통해 기기에 로드 및 /또는 인스톨될 수 있다. 컴퓨터 프로그램이 RAM에 로드되어 컴퓨팅 유닛에 의해 실행될 경우, 대규 모 언어 모델에 기반한 3차원 장면 생성 방법의 하나 또는 복수의 단계를 실행할 수 있다. 대안적으로, 다른 실 시예에서, 컴퓨팅 유닛은 다른 임의의 적절한 방식(예를 들면, 펌웨어에 의해)을 통해 대규모 언어 모델에 기반한 3차원 장면 생성 방법을 실행하도록 구성될 수 있다. 설명된 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 필드 프로그래밍 가 능한 게이트 어레이(FPGA), 특정 용도 대상 집적 회로(ASIC), 특정 용도 대상 표준제품(ASSP), 시스템 온 칩 시 스템(SOC), 부하 프로그래밍 가능 논리 장치(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 결 합에서 구현될 수 있다. 이러한 다양한 실시형태는 하나 또는 다수의 컴퓨터 프로그램에서의 구현을 포함할 수 있고, 상기 하나 또는 다수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템에서 실행 및/또는 해석될 수 있으며, 상기 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가 능 프로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치, 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 데이터 및 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치, 및 상기 적어도 하나의 출력 장치에 전송할 수 있다. 본 개시의 방법을 실시하기 위한 프로그램 코드는 하나 또는 복수의 프로그래밍 언어의 임의의 결합을 사용하여 작성할 수 있다. 이러한 프로그램 코드는 프로그램 코드가 프로세서 또는 컨트롤러에 의해 실행될 때 흐름도 및 블록도 중의 적어도 하나에 규정된 기능/동작이 실행되도록, 대형 기계(슈퍼 컴퓨터), 전용 컴퓨터 또는 다른 프로그램 가능한 차량 포지셔닝 또는 포지셔닝 모델의 트레이닝 장치의 프로세서 또는 컨트롤러에 제공할 수 있 다. 프로그램 코드는 완전히 기계에서 실행되거나, 부분적으로 기계에서 실행되거나, 독립된 소프트웨어 패키지 로서 부분적으로 기계에서 실행되고, 부분적으로 리모트 기계에서 실행되거나 또는 완전히 리모트 기계 또는 서 버에서 실행될 수 있다. 본 개시의 문맥에서, 기계 판독 가능 매체는 명령 실행 시스템, 장치 또는 기기의 사용, 또는 명령 실행 시스템, 장치 또는 기기와 결합하여 사용되는 프로그램을 포함하거나 저장할 수 있는 유형적인 매체일 수 있다. 기계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 기록 매체일 수 있다. 기계 판독 가능 매체는 전자, 자기, 광학, 전자기, 적외선, 또는 반도체 시스템, 장치 또는 기기, 또는 상술한 내용의 임의의 적절한 결합을 포함하지만, 이에 한정되지 않는다. 기계 판독 가능 기록 매체의 더 구체적인 예는 하나 또는 복 수의 와이어에 기반한 전기 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 랜덤 액세스 메모리(RAM), 판독 전용 메 모리(ROM), 소거 가능 프로그래머블 판독 전용 메모리(EPROM 또는 플래시 메모리), 광섬유, 포터블 컴팩트 디스 크 판독 전용 메모리(CD-ROM), 광학 저장 장치, 자기 저장 장치 또는 상술한 내용의 임의의 적절한 결합을 포함 한다. 사용자와의 인터랙션을 제공하기 위하여, 컴퓨터에서 여기서 설명된 시스템 및 기술을 실시할 수 있고, 상기 컴 퓨터는 사용자에게 정보를 표시하기 위한 표시 장치(예를 들어, CRT(음극선관) 또는 LCD(액정 표시 장치) 모니터); 및 키보드 및 지향 장치(예를 들어, 마우스 또는 트랙 볼)를 구비하며, 사용자는 상기 키보드 및 상기 지 향 장치를 통해 컴퓨터에 입력을 제공한다. 다른 타입의 장치는 또한 사용자와의 인터랙션을 제공할 수 있는데, 예를 들어, 사용자에게 제공된 피드백은 임의의 형태의 감지 피드백(예를 들어, 시각 피드백, 청각 피드백, 또 는 촉각 피드백)일 수 있고; 임의의 형태(소리 입력, 음성 입력, 또는 촉각 입력)로 사용자로부터의 입력을 수 신할 수 있다. 여기서 설명된 시스템 및 기술은 백엔드 부재를 포함하는 계산 시스템(예를 들어, 데이터 서버로 사용됨), 또는 미들웨어 부재를 포함하는 계산 시스템(예를 들어, 애플리케이션 서버), 또는 프론트 엔드 부재를 포함하는 계 산 시스템(예를 들어, 그래픽 사용자 인터페이스 또는 네트워크 브라우저를 구비하는 사용자 컴퓨터인 바, 사용 자는 상기 그래픽 사용자 인터페이스 또는 상기 네트워크 브라우저를 통해 여기서 설명된 시스템 및 기술의 실 시형태와 인터랙션할 수 있음), 또는 이러한 백엔드 부재, 미들웨어 부재, 또는 프론트 엔드 부재의 임의의 결 합을 포함하는 계산 시스템에서 구현될 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들어, 통신 네트워크)을 통해 시스템의 부재를 서로 연결시킬 수 있다. 통신 네트워크의 예는, 근거리 통신망(LAN), 광역망 (WAN), 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트 및 서버는 일반적으로 서로 멀리 떨어져 있 고 일반적으로 통신 네트워크를 통해 서로 인터랙션한다. 대응되는 컴퓨터에서 실행되고 또한 서로 클라이언트- 서버 관계를 가지는 컴퓨터 프로그램을 통해 클라이언트 및 서버의 관계를 생성한다. 서버는 클라우드 서버일 수 있고, 클라우드 계산 또는 클라우드 호스트일 수도 있으며, 클라우드 계산 서비스 시스템 중의 하나의 호스 트 제품일 수 있어, 종래의 물리 호스트와VPS서비스 (\"Virtual Private Server\" 또는 \"VPS\"라고 약칭한다)에 존재하는 관리 곤란도가 높고, 업무 확장성이 약한 것을 해결한다. 서버는 분산 시스템의 서버일 수 있거나, 또 는 블록 체인을 결합한 서버일 수도 있다. 위에서 설명된 다양한 형태의 프로세스를 사용하여 단계를 재배열, 추가 또는 삭제할 수 있음을 이해해야 한다. 예를 들어, 본 개시에 기재된 각 단계는 동시에, 순차적으로, 또는 상이한 순서로 수행될 수 있으며, 본 개시에 개시된 기술적 해결수단이 이루고자 하는 결과를 구현할 수 있는 한, 본문은 여기서 한정되지 않는다."}
{"patent_id": "10-2024-0111084", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 구체적인 실시형태는 본 출원의 보호 범위를 한정하지 않는다. 본 기술분야의 통상의 기술자는, 설계 요구 및 다른 요소에 따라 다양한 수정, 조합, 서브 조합 및 대체를 진행할 수 있음을 이해해야 한다. 본 출원의 정 신 및 원칙 내에서 이루어진 임의의 수정, 등가 교체 및 개선 등은 모두 본 출원의 보호 범위 내에 포함되어야 한다."}
{"patent_id": "10-2024-0111084", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부 도면은 본 해결수단을 더 잘 이해하기 위한 것으로, 본 발명에 대해 한정하는 것으로 구성되지 않는다. 도1은 본 개시의 제1 실시예에 따른 개략도이다. 도 2는 본 개시의 실시예의 응용 장면을 구현하기 위한 개략도이다. 도 3은 본 개시의 실시예에서 제공되는 대규모 언어 모델에 기반한 3차원 장면 생성 시스템의 전체 구조의 개략 도이다. 도 4는 본 개시의 제2 실시예에 따른 개략도이다. 도 5는 본 개시의 제3 실시예에 따른 개략도이다. 도 6은 본 개시의 실시예의 대규모 언어 모델에 기반한 3차원 장면 생성 방법을 구현하기 위한 전자 기기의 개 략도이다."}
