{"patent_id": "10-2021-0192548", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0102431", "출원번호": "10-2021-0192548", "발명의 명칭": "인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템", "출원인": "앤츠이엔씨 주식회사", "발명자": "이상준"}}
{"patent_id": "10-2021-0192548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템에 있어서,플랜트 핵심설비 하드웨어 기반 시뮬레이션 시스템을 설계 및 검증하는 시뮬레이션 시스템 구축 모듈;상기 시뮬레이션 시스템을 활용하여 오일가스 플랜트 설비의 안전성, 건전성 평가를 실행하는 평가모듈;인공지능에 기반하여 플랜트 설비의 통합관제를 수행하는 통합관제 모듈;인공지능 기반 플랜트 설비 건전성 예측 및 진단을 수행하는 설비 건전성 판단모듈; 및 플랜트 핵심 설비 기자재 및 외부 하중 관련 데이터셋을 구축하는 데이터 구축 모듈; 을 포함하는 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템."}
{"patent_id": "10-2021-0192548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 시뮬레이션 시스템 구축 모듈; 은핵심 설비 하드웨어 기반 시뮬레이션 시스템 운영 시나리오를 설계하고, 상기 시나리오를 통해 시뮬레이션 시스템을 검증하는 것을 특징으로 하는 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템."}
{"patent_id": "10-2021-0192548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 평가모듈; 은시뮬레이션 시스템을 통해 플랜트 설비의 결함 유무, 균일성, 기계적 성질의 적절성을 포함하는 건전성 판정을수행하는 것을 특징으로 하는 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템."}
{"patent_id": "10-2021-0192548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 통합관제 모듈; 은가상화 운영 및 유지보수 플랫폼과 연계하여, 플랜트 설비 데이터를 모니터링 하고, 적응형 기계학습 모델을 통해, 변화하는 모니터링 데이터 특징에 대응하는 것을 특징으로 하는 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템."}
{"patent_id": "10-2021-0192548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 통합관제 모듈; 은 IoT를 활용한 관제 및 시뮬레이션 환경을 분석하는 것을 특징으로 하는 인공지능 기반의 오일가스 플랜트 설비고장 예측 및 진단시스템."}
{"patent_id": "10-2021-0192548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 데이터 구축 모듈; 은적응형 기계학습 모델을 통해 변화하는 데이터 특징에 대응하고, 최종 인공지능 모델 결정 후 시스템 통합 데이공개특허 10-2023-0102431-3-터 셋을 구축하고, 플랜트 수요기업 적용을 위한 데이터 셋을 구축하는 것을 특징으로 하는 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템."}
{"patent_id": "10-2021-0192548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 데이터 구축 모듈; 은오일가스 플랜트 설비에서 모니터링된 데이터 수치와 데이터셋 자료를 비교하여, 모니터링된 데이터 및 기존 데이터 분석을 위한 기초자료를 구축하는 것을 특징으로 하는 인공지능 기반의 오일가스 플랜트 설비 고장 예측및 진단시스템."}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템은 플랜트 설비의 결함 유무, 균 일성, 기계적 성질의 적절성을 포함하는 건전성 판정을 통해 플랜트 설비의 고장 예측 및 진단을 수행한다. 실시 예를 통해, 실증플랜트 핵심설비 AI 기반 건전성 예측 모델을 구현하고, 가상화 운영 및 플랜트 유지관리 시뮬레 이션 시스템 연계를 통해, AI 예측 모델을 최적화한다. 또한, 고장 예측 및 진단을 위한 시뮬레이션과 실제 플랜 트 운영 데이터 구축하고 검증하여 시스템 효율과 진단 정확성을 향상시킬 수 있도록 한다."}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 오일가스 플랜트 설비 고장 예측 및 진단 시스템에 관한 것으로 구체적으로, 가상화 및 인공지능 기 술 적용을 통해 가스오일 플랜트의 운영 및 유지관리를 고도화하고, 공정 위험성에 대한 진단평가 모델 구축 및 동적 위험성 평가 모델을 제공하는 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템에 관한 것 이다."}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 섹션에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술이 아니며, 이 섹션에 포함된다고 하여 종래 기술이라고 인정되는 것은 아니다. 최근 오일가스 플랜트 분야는 국제 유가의 상승, 에너지 수요의 증가로 인하여 프로젝트 발주가 증가하고 있으 며, 중동지역과 전 세계 지역으로 시장규모가 증대되고 있다. 또한, 인공지능(AI, Artificial Intelligence), ICT 등 최첨단 기술을 플랜트 운용에 도입하여 오일가스 플랜트 운용효율 및 안전성 향상을 도모하고 있다. 특 히, 인공지능을 기반으로 데이터 분석 예측모델 개발 및 가상화 플랫폼 기술 개발, AI 기반 공정 효율화, 위험 성 진단평가 기술 및 공정 설비 모니터링 포털 개발, AI 기반 설비 안전 및 건전성 예지 진단평가 기술 개발 및 AI 기반 가상화 운영 플랫폼 실증 기술 개발 관련 기술의 연구가 활발히 이루어 지고 있다. 인공지능을 기반으로 데이터 분석 예측모델 개발 및 가상화 플랫폼 기술의 경우, 기존 연구에서 센서 기반 가상 플랜트를 구축한 사례가 있다. 하지만, 현재 상태 진단 정도로 사용 가능했고, 빅데이터를 활용한 AI 기반의 예 측모델 및 시뮬레이션 모델을 접목하여 예지 진단에 활용하는 수준까지 이르지는 못하였다. 또한, AI 기반 공정 효율화, 위험성 진단평가 기술 및 공정설비 모니터링 포털 기술은 가상화를 위한 3D 모델 경량화 및 단순화 기술을 활용한 상용 제품은 존재하나 모두 지원하는 범위가 한정적인 상태이다. 특히, AI 기 반 설비 안전 및 건전성 예지 진단평가 기술 개발의 경우, 국내 개별 플랜트 업체에서의 스마트 솔루션 개발 노 력에도 불구하고, 대부분 기술은 원천 기술 단계이기 때문에, 실증을 통하여 플랜트 운전에서의 보수성을 지속 적으로 타파할 필요가 있다. 한편, 동적 위험성 평가 기술은 해외에서도 신기술에 속하는 내용으로, 동적 위험성 평가가 다루어야 할 분야에 대해서도 공정 주기(Life cycle) 동안의 변화에 대한 위험성 평가/작업자의 활동(유지 보수 작업) 추적 (Tracking)의 두 가지 유형을 제시하고 있다. 다양한 구조물에서 발생하는 복잡한 데이터가 수집되지만, 사용자 가 정보를 효율적으로 활용할 수 있도록 정보를 처리하고 분석하는 방법은 제한적이다. 또한, 진단 및 예지 정 확도와 사용자가 받아들이는 만족도에 대해 실증적으로 평가되고 알려지지 않았으며, 다양한 시나리오 상황 별 인공지능의 자동 진단, 예지 방식이 어떻게 이루어 지는지 미리 파악하기 어려워 시뮬레이터가 필요한 실정이다. 아울러, 현재 플랜트 설비의 안정성을 측정하고 비교할 수 있는 정량화된 데이터셋이 존재하지 않으 며, 예지 진단과 관련된 데이터셋이 부족하다. 국내에서는 최근 정유화학업계를 중심으로 스마트 플랜트를 적용하고 있으나 서비스 솔루션은 외국 선진 기업 제품을 사용하고 있고 스마트 핵심기자재 또한 안정성 및 신뢰성이 상대적으로 낮은 수준이다. 기술 확보를 위해서는 실시간 운전 데이터의 공유와 공정 설비 적용이 요구되나 기업비밀, 플랜트의 안정적 운전 등의 이유로 경험을 축적하기 어려운 여건이다. 또한, 국내 엔지니어링 시장 규모가 협소한 가운데 시장을 선점한 외산 설계 및 해석 등 주요 기반 솔루션에의 의존성 심화로 관련 연구개발 성과의 사업화가 이루어지지 못하고 있는 실정 이다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 한국 특허등록 제10-1199290호 (2012.11.02) (특허문헌 0002) 2. 한국 특허등록 제10-2145323호 (2020.08.11)"}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템은 플랜트 설비의 결함 유무, 균 일성, 기계적 성질의 적절성을 포함하는 건전성 판정을 통해 플랜트 설비의 고장 예측 및 진단을 수행한다. 실시예를 통해, 실증플랜트 핵심설비 AI 기반 건전성 예측 모델을 구현하고, 가상화 운영 및 플랜트 유지관리 시뮬레이션 시스템 연계를 통해, AI 예측 모델을 최적화한다. 또한, 고장 예측 및 진단을 위한 시뮬레이션과 실 제 플랜트 운영 데이터 구축하고 검증하여 시스템 효율과 진단 정확성을 향상시킬 수 있도록 한다."}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템은 플랜트 핵심설비 하드웨어 기 반 시뮬레이션 시스템을 설계 및 검증하는 시뮬레이션 시스템 구축 모듈; 시뮬레이션 시스템을 활용하여 오일가 스 플랜트 설비의 안전성, 건전성 평가를 실행하는 평가모듈; 인공지능에 기반하여 플랜트 통합관제를 수행하는 통합관제 모듈; 인공지능 기반 플랜트 설비 건전성 예측 및 진단을 수행하는 설비 건전성 판단모듈; 및 플랜트 핵심 설비 기자재 및 외부 하중 관련 데이터셋을 구축하는 데이터 구축 모듈; 을 포함한다."}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서와 같은 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템은 상시 모니터링과 운영 관리 중심의 안전한 건전성 점검체계를 구축하여, 플랜트 유지보수 및 점검 분야의 급속한 성장에 따른 관련 인력의 지속적인 위험 노출 가능성을 절감한다. 또한, 진단 모듈과 플랫폼 소프트웨어 구현을 통해 유지보수 및 건전성 평가 플랫폼의 표준화 선점을 가능하게 한다. 또한, 실시예를 통해 플랜트 운용 실증 및 실적 확보를 가능하게 하고, 기술의 성능검증 및 경험 축적뿐만 아니 라 정부예산의 절감을 도모할 수 있다. 또한, 외산에 의존하는 예지 진단이 아닌 국내 기술을 이용한 예지 진단 기술 확보하고, 실시간 관제 모니터링과 AI 도입을 통해 플랜트 시장에 최신 기술 적용과 효율적인 플랜트 운영 지원을 가능하게 한다. 또한, 실시예를 통해, 다양한 사고 시나리오에 대해 인명, 환경, 재산의 피해를 최소화 하고, 플랜트 안전 분야 신뢰성 확보를 통해 해외수주 확대 등 플랜트 산업 기술경쟁력 확보할 수 있다. 아울 러, 예지 진단 원천 기술 확보를 통해 플랜트 전반과 각종 팩토리 고부 가가치화 및 신사업 창출을 가능하게 한 다. 또한, 실시예를 통해 시스템의 운영에서 안전과 비용을 함께 고려하여 시스템의 결함을 조기 감지하고, 발생한 결함의 종류와 심각도를 진단하며, 고장 발생 시점을 사전 예지하는 건전성 예측관리(Prognostics and Health Management, PHM)를 수행함으로써, 설비 결함이 대규모 사고로 이어질 수 있는 가능성을 줄인다. 아울러, 전통 적 주기정비 또는 예방정비방식을 탈피하여 필요한 시점에만 정비를 수행하는 상태 기반 정비를 실현함으로써,경제적으로 많은 이익을 창출할 수 있도록 한다."}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 특허청구범위에 기재된 발 명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 도면부호는 동일 구성 요소를 지칭한다. 본 발명의 실시 예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명의 실시 예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1은 플랜트 전주기에 따른 운영 및 유지관리 핵심 기술을 나타낸 도면이다. 실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템은 플랜트의 안전성, 건전성 진 단 기능 및 예측 진단 기능을 제공함으로써, 플랜트 설비의 결함 유무, 균일성, 기계적 성질의 적절성을 포함하 는 건전성 판정을 통해 플랜트 설비의 고장 예측 및 진단을 수행한다. 또한, 실시예를 통해 실증플랜트 핵심설 비 AI 기반 건전성 예측 모델을 구현하고, 가상화 운영 및 플랜트 유지관리 시뮬레이션 시스템 연계를 통해, AI 예측 모델을 최적화한다. 아울러, 고장 예측 및 진단을 위한 시뮬레이션과 실제 플랜트 운영 데이터 구축하고 검증하여 시스템 효율과 진단 정확성을 향상시킬 수 있도록 한다. 도 2는 실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템의 데이터 처리 구성을 나타낸 도면이다. 도 2를 참조하면, 실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템은 시뮬레이션 시스템 구축 모듈, 평가모듈, 통합관제모듈, 설비 건전성 판단 모듈 및 데이터 구축 모듈 을 포함하여 구성될 수 있다. 본 명세서에서 사용되는 '모듈' 이라는 용어는 용어가 사용된 문맥에 따라서, 소프트웨어, 하드웨어 또는 그 조합을 포함할 수 있는 것으로 해석되어야 한다. 예를 들어, 소프트웨어 는 기계어, 펌웨어(firmware), 임베디드코드(embedded code), 및 애플리케이션 소프트웨어일 수 있다. 또 다른 예로, 하드웨어는 회로, 프로세서, 컴퓨터, 집적 회로, 집적 회로 코어, 센서, 멤스(MEMS; Micro-Electro- Mechanical System), 수동 디바이스, 또는 그 조합일 수 있다. 시뮬레이션 시스템 구축 모듈은 플랜트 핵심설비 하드웨어 기반 시뮬레이션 시스템을 설계 및 검증하는 시 뮬레이션 시스템을 구축한다. 실시예에서 시뮬레이션 시스템 구축 모듈은 핵심 설비 하드웨어 기반 시뮬레 이션 시스템 운영 시나리오를 설계하고, 시나리오를 통해 시뮬레이션 시스템을 검증할 수 있다. 평가모듈은 시뮬레이션 시스템을 활용하여 오일가스 플랜트 설비의 안전성, 건전성 평가를 실행한다. 실시 예에서 평가모듈은 시뮬레이션 시스템을 통해 플랜트 설비의 결함 유무, 균일성, 기계적 성질의 적절성을 포함하는 건전성 판정을 수행한다. 실시예에서 평가모듈은 플랜트 설비기계의 진동진단 데이터를 안전성,건전성 평가 안전성 정밀진단에 이용할 수 있다. 실시예에서는 진동진단 데이터를 해석하여 플랜트 안전성 및 건정성을 평가한다. 실시예에서는 진동진단 데이터의 시간영역 해석, 주파수 영역 해서 및 성분 분석을 통해 해 석하고, 해석 결과에 따라 안전성, 건전성 평가 결과를 산출한다. 실시예에서 평가모듈의 시간 영역 해석은 시간파형, 진폭의 확률밀도함수 등을 이용하여 진폭의 크기나 시 간적 변동, 파형의 충격성과 대칭성 등을 분석하는 과정을 포함한다. 실시예에서 평가모듈의 주파수영역 해석은 FFT(고속 푸리에 변화) 등을 이용하여 진동에 어떤 주파수 성분(스펙트럼)이 포함되어 있는지를 파악하 는 과정을 포함한다. 공간영역 해석은 리사주 도형 등을 이용하여 회전축 중심(진동)이 공간적으로 어떤 궤적을 그리며 운동하는지를 파악하는 것이다. 또한, 실시예에서 평가모듈은 설비의 성능이나 기능을 나타내는 1차 효과 파라미터를 이용하는 방법과 설 비의 가동에 의해 발생하는 2차 효과 파라미터를 이용하여 안전성 및 건전성 평가를 수행할 수 있다. 1차 효과 파라미터는 설비가 본래 목적을 수행할 때 관측되는 상태 파라미터로서, 실시예에서는 1차 효과 파라미터를 이 용하여 설비의 상태를 모니터링한다. 실시예에서는 성능모니터링 (Performance monitoring) 및 거동감시 (Behavior monitoring)을 수행할 수 있다. 2차 효과 파라미터란 설비의 가동에 의해 변화하는 진동, 음향, 온도 등의 부수적인 상태 파라미터이다. 실시예 에는 파라미터 진단을 위한 센서를 통해 파라미터 데이터를 수집하고, 수집된 파라미터 데이터를 분석하여 플랜 트 이상의 조기발견 및 이상 원인이나 발생위치를 정확히 확인할 수 있도록 한다. 실시예에서 1차 효과 파라미 터는 주로 간이 진단에 이용되고, 2차 효과 파라미터는 간이진단과 정밀진단에 모두 이용할 수 있다. 통합관제모듈은 인공지능에 기반하여 플랜트 통합관제를 수행한다. 실시예에서 통합관제모듈은 가상 화 운영 및 유지보수 플랫폼과 연계하여, 플랜트 설비 데이터를 모니터링 하고, 적응형 기계학습 모델을 통해, 변화하는 모니터링 데이터 특징에 대응한다. 또한, 통합관제모듈은 통합관제 모듈; 은 IoT 활용한 관제 및 시뮬레이션 환경을 분석할 수 있다. 실시예에서 통합관제모듈은 시스템의 운영에서 안전(risk)과 비용(cost)을 함께 고려하여 시스템의 결함 (fault)을 조기 감지(early detection)하고, 발생한 결함의 종류와 심각도를 진단(diagnosis)하며, 고장 발생 시점을 사전 예지(prognosis)하는 건전성 예측관리(Prognostics and Health Management, PHM)를 수행한다. 건 전성 예측관리를 통해, 대규모 사고로 이어질 수 있는 가능성을 줄이면서 전통적 주기정비 또는 예방정비 (Periodic or Preventive Maintenance, PM) 방식을 탈피하여 필요한 시점에만 정비를 수행하는 상태 기반 정비 (Condition Based Maintenance, CBM)를 실현한다. 실시예에서 따른 통합관제모듈은 시스템에 장착된 센서 를 통해 얻은 데이터를 처리하고(Signal processing), 이로부터 현재 시스템의 건전성을 대변하기 위한 특성 인 자를 추출(Feature extraction)하며, 현재의 고장 원인과 그 심각도를 규명하는 고장진단(Fault diagnosis) 및 미래의 고장발생 시점을 예측하는 고장 예지(Failure prognosis)를 수행한다. 실시예에 따른 통합관제모듈(30 0)의 신호처리 목적은 다양한 다른 신호와 노이즈가 혼재된 신호에 대해 고장 진단에 필요한 정보를 남기고 그 외의 정보를 제거하는 것이다. 이를 위해, 실시예에서는 고장 신호 외의 주기적인 신호를 제거하는 특정신호 분 리(discrete signal separation)와 미세한 크기를 가지는 고장 신호를 강화 시키는 신호 강화(signal enhancement)의 과정을 수행한다. 실시예에서는 특정 신호 분리 및 고장신호 강화 처리를 한 데이터를 가지고 특징을 추출하여 보다 쉽게 결함관련 정보를 얻을 수 있도록 한다. 또한 실시예에서는 설명한 두 단계를 거치지 않고 원 신호를 다양한 성분으로 분해하는 신호 분해(signal decomposition) 과정을 통해 결함관련 정보를 추출 할 수 있다. 실시예에 따라 분해된 성분 중에는 결함신호가 뚜렷하게 식별되는 데이터가 존재하므로, 해당 데이터를 통해 결 함특징을 추출할 수 있다. 또한, 실시예에서는 고장 신호와 무관한 신호들을 제거하기 위해, 선형 예측(Linear prediction), 자기 적응형 노이즈 제거(Self-Adaptive Noise Cancellation, SANC), 및 시간 동기 평균화(Time Synchronous Averaging, TSA) 과정을 이용할 수 있다. 선형 예측(Linear prediction)은 과거의 데이터를 이용 하여 신호의 결정적인(deterministic) 부분을 선형적으로 모델링하여 미래의 출력 값을 추정하는 방법이다. 자 기 적응형 노이즈 제거는 기본 신호(primary signal)와 참조 신호(reference signal)을 사용하는 필터로, 참조 신호(reference Signal)을 기본 신호(primary signal)에 내재되어 있는 특정 신호와 유사하도록 최적화시키는 신호처리 방법이다. 실시예에서 기본 입력(primary input)은 노이즈와 설비에 의해 발생하는 신호가 혼재된 원 신호이고, 참조 입력(reference input)은 플랜트 설비에 의해서만 발생하는 신호이다. 실시예에서는 최적화 과 정을 통해 기본입력 내의 노이즈 신호를 제거한 오차(e)를 얻기 위해 필터 파라미터를 산출하여, 원하는 플랜트 신호만을 선별할 수 있도록 한다. 시간 동기 평균화(Time Synchronous Averaging)는 신호에 내재된 노이즈를 제거하고, 주기적인 특성을 보이는 신호만 남기기 위해 사용하는 방법이다. 실시예에서는 플랜트 설비의 진동 신 호를 현재 회전하고 있는 축(shaft)의 회전 주기에 맞추어 리샘플링(resampling)한 후 이들의 평균값을 구하는 산출한다. 이를 통해서 고장신호와 무관한 랜덤 노이즈 성분들은 제거되고, 회전에 따라 주기적 성질을 가지는 신호 성분만 남게 된다. 이를 위해 실시예서는 일반적으로 축의 회전주기를 측정하기 위해 회전 시마다 펄스신 호를 발생시키는 타코미터(tachometer)나 축의 각도를 측정하는 광학 엔코더(optical encoder)를 사용할 수 있 다. 설비 건전성 판단모듈은인공지능 기반 플랜트 설비 건전성 예측 및 진단을 수행한다. 실시예에서 건전성은 플랜트 설비의 결함 유무, 균일성, 기계적 성질의 적절성 등을 포함할 수 있다. 실시예에서 설비 건전성 판단모 듈은 진동이나 소음과 같은 신호 데이터를 측정하여 이상감지를 할 수 있으며, 주파수 분석 등 여러 가지 신호처리가 데이터 전처리 과정을 수행한다. 실시예에서 설비 건전성 판단모듈은 진동 데이터를 분석하여 설비 이상상태를 판단할 수 있다. 실시예에서는 정상상태 데이터를 기반으로 마할라노비스(Mahalanobis) 거리를 측정하여 이상상태 유무를 모니터링 하는 방식을 사용한다. 실시예에서는 구간별 신호 데이터로부터 추출된 통 계적 지표로 구성된 벡터에 대하여 마할라노비스 거리를 측정하여, 해당 구간의 이상상태 여부를 판정하게 된다. 마할라노비스 거리(Mahalanobis distance)는 군집 분석에서 자주 쓰이는 거리 척도로, 다변량 데이터에서 변수 간의 상관관계가 존재할 때 공분산 행렬을 활용한 데이터 표준화를 거쳐서 거리를 측정한다. 또한, 실시예 에서 마할라노비스 거리 분류기는 훈련 데이터로부터 마할라노비스 공간을 미리 구성한 후, 임의의 데이터에 대 하여 그 공간과의 거리를 측정하여 거리에 따라 훈련 데이터와 동일 클래스 여부를 판정한다. 또한, 실시예에서 는 신호 데이터의 전처리 과정을 통해 플랜트 설비 이상상태 감지의 성능을 개선할 수 있다. 실시예에서 전처리 과정은 표준화(standardization), 해밍 윈도우(Hamming window), 켑스트럼 분석(cepstrum analysis) 및 통계분 석(statistical analysis)과정을 포함할 수 있다. 실시예에서는 전처리 단계에서 신호 데이터 수집 과정에서 발생한 누설오차(leakage)를 없애기 위해 해밍 윈도 우(Hamming window)를 적용하고, 신호 데이터의 원신호인 포먼트(formant)를 분리하기 위하여 켑스트럼 (cepstrum) 분석을 실시한다. 해밍 윈도우 및 켑스트럼 분석은 연속된 데이터를 임의로 구간화하는 과정에서 발 생하는 불연속적인 양, 즉 누설오차(leakage)를 제거하기 위해 수행한다. 실시예에 따른 해밍 윈도우를 적용은 추출된 신호 데이터의 길이가 정확히 신호주기의 정수배인 경우에는 정확한 주파수 도메인인 스펙트럼을 얻을 수 있지만, 그렇지 않을 경우 양 끝단의 불연속으로 인한 오차가 발생한다. 실시예에서는 이를 제거하기 위해 중심에서 양끝으로 갈수록 신호 데이터가 0에 가까운 값으로 변환하는 윈도우 함수를 적용하면, FFT 결과에서 더 정확한 스펙트럼을 얻을 수 있다. 실시예에서는 이러한 데이터 누설효과를 최소화하기 위하여 해밍 윈도우를 수학식 1을 통해 적용한다. 수학식 1에서 N은 윈도우의 길이를 나타낸다. 수학식 1"}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "켑스트럼 분석은 고속 푸리에 변환(fast Fourier transformation: FFT)을 적용하여 주파수 영역(frequency domain)으로 표시된 신호의 로그 스케일을 푸리에 역변환(Inverse FFT)하는 방법이다. 시간 축 상에서 일반적인 충격 신호에 대한 응답은 입력 신호와 전달함수가 합성(convolution)되어 복잡한 형태의 신호로 나타나는데, 이 때 켑스트럼 분석을 적용하면 입력신호의 파형과 응답을 구현하는 전달함수를 분리할 수 있다. 실시예에서는 켑 스트럼을 적용함으로써 로그 함수가 두 개의 곱으로 형성된 함수를 합으로 분리하여 나타냄으로써 주파수 영역 으로 변환된 신호의 크기와 위상을 분리할 수 있다. 데이터 구축 모듈은 플랜트 핵심 설비 기자재 및 외부 하중 관련 데이터셋을 구축한다. 실시예에서 데이터 구축 모듈은 적응형 기계학습 모델을 통해 변화하는 데이터 특징에 대응하고, 최종 인공지능 모델 결정 후 시스템 통합 데이터 셋을 구축하고, 오일/가스 플랜트 수요기업 적용을 위한 데이터 셋을 구축한다. 또한, 실시 예에서 데이터 구축 모듈은 오일가스 플랜트 설비에서 모니터링 데이터 측정을 통해 소프트웨어 수치와 데 이터셋 자료 비교하고, 측정된 데이터 및 기존 데이터 분석을 위한 기초자료를 구축한다. 도 3은 실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템 구현 과정을 설명하기 위한 도면이다. 도 3을 참조하면, 실시예에서는 핵심설비 하드웨어 기반 시뮬레이션 시스템, 핵심 설비 하드웨어 기반 시뮬레이 션 시스템 운영 시나리오, IoT 센서를 활용한 설비 통합관제 플랫폼 및 시뮬레이션 시스템 설계한다. 또한, 설 비 통합관제 플랫폼 및 안전성 건전성 평가 시뮬레이션 시스템을 구현하고, AI 기반 건전성 예지 진단 기술 개 발을 통한 시뮬레이션 시스템 고도화한다. 이를 위해, 플랜트 상태 파악을 위한 센서 데이터 정의 및 수집하고, 실증플랜트 핵심설비 AI 기반 건전성 예측 모형 개발한다. 또한, 예지 진단 점검 데이터 셋을 구축하여, 실증플 랜트 핵심설비 하드웨어 기반 시스템 건전성 예지 진단 시스템을 구축한다. 아울러, 실증 플랜트 핵심설비 하드웨어 기반 시뮬레이션 시스템 설계를 위해, 실증 플랜트 핵심 설비 하드웨어 기반 시뮬레이션 시스템 운영 시나리오 개발하고 IoT 센서 활용한 설비 통합관제 플랫폼 및 시뮬레이션 시스템 설계한다. 도 4는 데이터 취득을 위한 인공신경망 데이터 시트의 예를 나타낸 도면이다. 실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템은 인공신경망(artificial neural networks), 선형판별분석(linear discriminant analysis), 주성분 분석(principal component analysis), 마할라노비스 거리 분류기(Mahalanobis distance classifier), 로지스틱 회귀 분석(logistic regression) 등 다양한 데이터마이닝 분석 기법을 이용해 데이터를 수집 및 분석하여 플랜트 이상을 예측 및 진 단할 수 있다. 실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템을 통해 기존 가상화 스마트 플 랜트 기술을 한 단계 더 발전시켜 예측 및 시뮬레이션 모델, 기존 분산 시스템 들을 모두 통합시키는 플랫폼 구 축 기술을 고도화한다. 또한, 인공지능을 통한 이상감지로 개별 플랜트 맞춤형 공정 효율성을 향상시키고, 다양 한 공정으로 확장 적용 가능한 프레임웍과 플랫폼을 제공할 수 있다. 또한, 기존 플랜트 안전훈련 교육시스템의 실용성을 향상시키고, 대형 플랜트 시설의 안전교육 방법에 대한 새 로운 응용기술 확보로 선진사 대비 기술경쟁력 확보할 수 있다. 아울러, 플랜트에 특화된 유지 보수 및 예지 진 단 기법 개발로 인하여 개별 센서-데이터 센터-플랜트 관리로 이어지는 기술 개발 체계를 확립할 수 있다. 특히, 플랜트 설비 안전성·건전성 예지 진단 평가 기술을 통해 외산에 의존하는 예지 진단이 아닌 국내 기술을 이용한 예지 진단 기술 확보하고, 실시간 관제 모니터링과 AI 도입을 통해 플랜트 시장에 최신 기술 적용과 효 율적인 플랜트 운영 지원이 가능하다. 또한, 실시예를 통해, 다양한 사고 시나리오에 대해 인명, 환경, 재산의 피해를 최소화하고, 플랜트 안전 분야 신뢰성 확보를 통해 해외수주 확대 등 플랜트 산업 기술경쟁력 확보할 수 있다. 아울러, 안전성 및 건전성 예지 진단 기술을 통한 예지 진단 원천 기술 확보를 통해 플랜트 전반과 각종 팩토리 고부 가가치화 및 신사업 창출을 가능하게 한다."}
{"patent_id": "10-2021-0192548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "개시된 내용은 예시에 불과하며, 특허청구범위에서 청구하는 청구의 요지를 벗어나지 않고 당해 기술분야에서 통상의 지식을 가진 자에 의하여 다양하게 변경 실시될 수 있으므로, 개시된 내용의 보호범위는 상술한 특정의 실시예에 한정되지 않는다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2021-0192548", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 플랜트 전주기에 따른 운영 및 유지관리 핵심 기술을 나타낸 도면 도 2는 실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템의 데이터 처리 구성을 나타낸 도면 도 3은 실시예에 따른 인공지능 기반의 오일가스 플랜트 설비 고장 예측 및 진단시스템 구현 과정을 설명하기 위한 도면 도 4는 데이터 취득을 위한 인공신경망 데이터 시트의 예를 나타낸 도면"}
