{"patent_id": "10-2022-0071342", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0020338", "출원번호": "10-2022-0071342", "발명의 명칭": "자율 주행 차량의 제어 방법, 장치, 전자 기기 및 판독 가능 기록 매체", "출원인": "베이징 바이두 넷컴 사이언스 테크놀로지 컴퍼니", "발명자": "공, 구오하오"}}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자율 주행 차량의 제어 방법에 있어서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계; 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객(passenger)이 제공한 돌발 상황 정보를 상기 클라우드에 보고하는 단계; 상기 클라우드에 의해 피드백된 상기 자율 주행 차량의 제어 정보를 수신하는 단계 - 상기 자율 주행 차량의 제어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원(agent)의 트리거 조작에 응답하여 상기 클라우드에 의해 송신됨 -; 및 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하는 단계;를 포함하는, 자율 주행 차량의 제어 방법."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계는, 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를구축하거나, 또는, 상기 클라우드에 의해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계 - 상기 트리거 명령은 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에 의해송신됨 -;를 포함하는,자율 주행 차량의 제어 방법."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수집하는 단계; 상기 실시간 이미지를 상기 클라우드에 업로드하여, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거 명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을실행하도록 하는 단계;를 더 포함하는, 자율 주행 차량의 제어 방법."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하는 단계는, 상기 자율 주행 차량의 교통 환경 정보를 획득하는 단계; 및상기 자율 주행 차량의 교통 환경 정보와 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하는 단계;를 포함하는, 자율 주행 차량의 제어 방법. 공개특허 10-2023-0020338-3-청구항 5 자율 주행 차량의 제어 방법에 있어서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계; 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 수신하는 단계; 및 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량에상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하도록 하는 단계;를 포함하는, 자율 주행 차량의 제어 방법."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계는, 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하거나, 또는, 상기 자율 주행 차량에 의해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계;를 포함하고, 상기 트리거 명령은 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여상기 자율 주행 차량에 의해 송신되는, 자율 주행 차량의 제어 방법."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항 또는 제6항에 있어서,상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도하나의 실시간 이미지를 수신하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을 실행하도록 하는단계를 더 포함하는, 자율 주행 차량의 제어 방법."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "자율 주행 차량 제어 장치에 있어서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하기 위한 구축 유닛; 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고하기위한 보고 유닛; 상기 클라우드에 의해 피드백된 상기 자율 주행 차량의 제어 정보를 수신하기 위한 수신 유닛 - 상기 자율 주행차량의 제어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기클라우드에 의해 송신됨 -; 및상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하기 위한 제어 유닛;을포함하는, 자율 주행 차량 제어 장치."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,공개특허 10-2023-0020338-4-상기 구축 유닛은 구체적으로, 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를구축하거나, 또는, 상기 클라우드에 의해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는데 사용되고, 상기 트리거 명령은 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에의해 송신되는, 자율 주행 차량 제어 장치."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항 또는 제9항에 있어서,상기 보고 유닛은 또한, 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수집하고, 상기 실시간 이미지를 상기 클라우드에 업로드하여, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거 명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을실행하도록 하는데 사용되는, 자율 주행 차량 제어 장치."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항 내지 제10항 중 어느 한 항에 있어서,상기 제어 유닛은 구체적으로, 상기 자율 주행 차량의 교통 환경 정보를 획득하고, 상기 자율 주행 차량의 교통 환경 정보와 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하는데 사용되는, 자율 주행 차량 제어 장치."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "자율 주행 차량 제어 장치에 있어서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하기 위한 구축 유닛; 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 수신하기 위한 수신 유닛; 및 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량에상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하도록 하기 위한 피드백 유닛;을 포함하는, 자율 주행 차량 제어 장치."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 구축 유닛은 구체적으로, 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하거나, 또는, 상기 자율 주행 차량에 의해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는데 사용되고, 상기 트리거 명령은 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여 상기 자공개특허 10-2023-0020338-5-율 주행 차량에 의해 송신되는, 자율 주행 차량 제어 장치."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항 또는 제13항에 있어서,상기 수신 유닛은 또한, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도하나의 실시간 이미지를 수신하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을 실행하도록 하는데 사용되는, 자율 주행 차량 제어 장치."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 기기에 있어서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 연결되는 메모리;를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서에 의해 제1항 내지 제7항 중 어느 한 항의 방법이 수행되도록 하는, 전자 기기."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 기록 매체에 있어서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제7항 중 어느 한 항의 방법을 수행하도록 하는, 비일시적 컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "비일시적 컴퓨터 판독 가능 기록 매체에 저장되어 있는 컴퓨터 프로그램에 있어서, 상기 컴퓨터 프로그램은 상기 컴퓨터가 제1항 내지 제7항 중 어느 한 항의 방법을 수행하도록 하는, 비일시적 컴퓨터 판독 가능 기록 매체에 저장되어 있는 컴퓨터 프로그램."}
{"patent_id": "10-2022-0071342", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "자율 주행 차량에 있어서, 제15항에 기재된 전자 기기를 포함하는, 자율 주행 차량."}
{"patent_id": "10-2022-0071342", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 컴퓨터"}
{"patent_id": "10-2022-0071342", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 것이고, 구체적으로, 지능형 교통 분야와 자율 주행 기술 분야 등의 인공 지 능 기술 분야에 관한 자율 주행 차량의 제어 방법, 장치, 전자 기기 및 판독 가능 기록 매체를 제공한다. 구체적 인 구현 방안은 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하고, 상기 통신 링크에 기반하여, 상기 자 율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고하여, 상기 클라우드에 의해 피드백된 상 기 자율 주행 차량의 제어 정보를 수신하고, 상기 자율 주행 차량의 제어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에 의해 송신되고, 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어한다. 대 표 도 - 도1"}
{"patent_id": "10-2022-0071342", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2023-0020338 CPC특허분류 B60W 40/08 (2013.01) B60W 50/08 (2013.01) G05D 1/0088 (2013.01) G05D 1/0231 (2013.01) H04L 67/125 (2022.05) H04L 67/141 (2022.05) B60W 2050/0005 (2013.01) B60W 2050/0008 (2013.01) B60W 2555/60 (2020.02) 발명자 유, 닝 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 넘버 10, 바이두 캠퍼스 2층 쑤에, 징징 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 넘버 10, 바이두 캠퍼스 2층 얀, 징 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 넘버 10, 바이두 캠퍼스 2층리, 용천 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 넘버 10, 바이두 캠퍼스 2층 친, 셩린 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 넘버 10, 바이두 캠퍼스 2층명 세 서 청구범위 청구항 1 자율 주행 차량의 제어 방법에 있어서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계; 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객(passenger)이 제공한 돌발 상황 정보를 상기 클라우드 에 보고하는 단계; 상기 클라우드에 의해 피드백된 상기 자율 주행 차량의 제어 정보를 수신하는 단계 - 상기 자율 주행 차량의 제 어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원(agent)의 트리거 조작에 응답하여 상기 클 라우드에 의해 송신됨 -; 및 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하는 단계;를 포함하는, 자율 주행 차량의 제어 방법. 청구항 2 제1항에 있어서, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계는, 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하거나, 또는, 상기 클라우드에 의해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구 축하는 단계 - 상기 트리거 명령은 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에 의해 송신됨 -;를 포함하는, 자율 주행 차량의 제어 방법. 청구항 3 제1항 또는 제2항에 있어서, 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수집하는 단 계; 상기 실시간 이미지를 상기 클라우드에 업로드하여, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하 여 상기 트리거 명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을 실행하도록 하는 단계;를 더 포함하는, 자율 주행 차량의 제어 방법. 청구항 4 제1항 내지 제3항 중 어느 한 항에 있어서, 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하는 단계는, 상기 자율 주행 차량의 교통 환경 정보를 획득하는 단계; 및 상기 자율 주행 차량의 교통 환경 정보와 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주 행을 제어하는 단계;를 포함하는, 자율 주행 차량의 제어 방법. 청구항 5 자율 주행 차량의 제어 방법에 있어서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계; 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상 황 정보를 수신하는 단계; 및 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량에 상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따 라, 상기 자율 주행 차량의 주행을 제어하도록 하는 단계;를 포함하는, 자율 주행 차량의 제어 방법. 청구항 6 제5항에 있어서, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계는, 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구 축하거나, 또는, 상기 자율 주행 차량에 의해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링 크를 구축하는 단계;를 포함하고, 상기 트리거 명령은 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여 상기 자율 주행 차량에 의해 송신되는, 자율 주행 차량의 제어 방법. 청구항 7 제5항 또는 제6항에 있어서, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수신하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거 명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을 실행하도록 하는 단계를 더 포함하는, 자율 주행 차량의 제어 방법. 청구항 8 자율 주행 차량 제어 장치에 있어서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하기 위한 구축 유닛; 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고하기 위한 보고 유닛; 상기 클라우드에 의해 피드백된 상기 자율 주행 차량의 제어 정보를 수신하기 위한 수신 유닛 - 상기 자율 주행 차량의 제어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에 의해 송신됨 -; 및 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하기 위한 제어 유닛;을 포함하는, 자율 주행 차량 제어 장치. 청구항 9 제8항에 있어서,상기 구축 유닛은 구체적으로, 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하거나, 또는, 상기 클라우드에 의해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구 축하는데 사용되고, 상기 트리거 명령은 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에 의해 송신되는, 자율 주행 차량 제어 장치. 청구항 10 제8항 또는 제9항에 있어서, 상기 보고 유닛은 또한, 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수집하고, 상기 실시간 이미지를 상기 클라우드에 업로드하여, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하 여 상기 트리거 명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을 실행하도록 하는데 사용되는, 자율 주행 차량 제어 장치. 청구항 11 제8항 내지 제10항 중 어느 한 항에 있어서, 상기 제어 유닛은 구체적으로, 상기 자율 주행 차량의 교통 환경 정보를 획득하고, 상기 자율 주행 차량의 교통 환경 정보와 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주 행을 제어하는데 사용되는, 자율 주행 차량 제어 장치. 청구항 12 자율 주행 차량 제어 장치에 있어서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하기 위한 구축 유닛; 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상 황 정보를 수신하기 위한 수신 유닛; 및 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량에 상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따 라, 상기 자율 주행 차량의 주행을 제어하도록 하기 위한 피드백 유닛;을 포함하는, 자율 주행 차량 제어 장치. 청구항 13 제12항에 있어서, 상기 구축 유닛은 구체적으로, 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구 축하거나, 또는, 상기 자율 주행 차량에 의해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링 크를 구축하는데 사용되고, 상기 트리거 명령은 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여 상기 자율 주행 차량에 의해 송신되는, 자율 주행 차량 제어 장치. 청구항 14 제12항 또는 제13항에 있어서, 상기 수신 유닛은 또한, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수신하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거 명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을 실행하도록 하는 데 사용되는, 자율 주행 차량 제어 장치. 청구항 15 전자 기기에 있어서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 연결되는 메모리;를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적 어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서에 의해 제1항 내지 제7항 중 어느 한 항 의 방법이 수행되도록 하는, 전자 기기. 청구항 16 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 기록 매체에 있어서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제7항 중 어느 한 항의 방법을 수행하도록 하는, 비일시적 컴퓨터 판독 가능 기록 매체. 청구항 17 비일시적 컴퓨터 판독 가능 기록 매체에 저장되어 있는 컴퓨터 프로그램에 있어서, 상기 컴퓨터 프로그램은 상기 컴퓨터가 제1항 내지 제7항 중 어느 한 항의 방법을 수행하도록 하는, 비일시적 컴퓨터 판독 가능 기록 매체에 저장되어 있는 컴퓨터 프로그램. 청구항 18 자율 주행 차량에 있어서, 제15항에 기재된 전자 기기를 포함하는, 자율 주행 차량. 발명의 설명 기 술 분 야 본 발명은 컴퓨터 기술 분야에 관한 것이고, 구체적으로, 지능형 교통 분야와 자율 주행 기술 분야 등의 인공 지능 기술 분야에 관한 것이며, 특히, 자율 주행 차량의 제어 방법, 장치, 전자 기기 및 판독 가능 기록 매체에 관한 것이다."}
{"patent_id": "10-2022-0071342", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율 주행 차량의 안전주행을 확보하기 위해, 자율 주행 차량이, 예를 들어, 차량 내의 승객의 돌발적인 개인적 요구, 차량 운영 스케줄링의 돌발 상황, 운영 단지 도로 세그먼트 날씨 상황이 나쁜 등의 돌발 상황 등과 같은 돌발 상황에 처했을 경우, 자율 주행 차량에 관련되는 개입이 필요하다. 현재, 자율 주행 차량이 돌발 상황에 대응하는 해결책은 자율 주행 차량 내의 스탭이 휴먼 컴퓨터 인터랙션 애 플리케이션(Application, APP)의 버튼을 클릭하거나, 또는, 자율 주행 차량 내의 하드웨어 버튼을 클릭하여, 자 율 주행 차량의 주행에 대해 대응하는 개입을 수행한다."}
{"patent_id": "10-2022-0071342", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 자율 주행 차량의 제어 방법, 장치, 전자 기기 및 판독 가능 기록 매체를 제공한다."}
{"patent_id": "10-2022-0071342", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 자율 주행 차량의 제어 방법을 제공하고, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계; 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고하는 단계; 상기 클라우드에 의해 피드백된 상기 자율 주행 차량의 제어 정보를 수신하는 단계 - 상기 자율 주행 차량의 제 어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드 에 의해 송신됨 -; 및 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하는 단계;를 포함한다. 본 발명의 다른 측면에 따르면, 다른 자율 주행 차량의 제어 방법을 제공하고, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는 단계; 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상 황 정보를 수신하는 단계; 및 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량에 상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따 라, 상기 자율 주행 차량의 주행을 제어하도록 하는 단계;를 포함한다. 본 발명의 다른 측면에 따르면, 자율 주행 차량 제어 장치를 제공하고, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하기 위한 구축 유닛; 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고하기 위한 보고 유닛; 상기 클라우드에 의해 피드백된 상기 자율 주행 차량의 제어 정보를 수신하기 위한 수신 유닛 - 상기 자율 주행 차량의 제어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에 의해 송신됨 -; 및 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하기 위한 제어 유닛;을 포함한다. 본 발명의 다른 측면에 따르면, 다른 자율 주행 차량 제어 장치를 제공하고, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하기 위한 구축 유닛; 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상 황 정보를 수신하기 위한 수신 유닛; 및 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량에 상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하도록 하기 위한 피드백 유닛;을 포함한다. 본 발명의 다른 측면에 따르면, 전자 기기를 제공하고, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세 서에 통신 연결되는 메모리;를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명 령이 저장되어 있고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서 에 의해 상술한 방법이 수행되도록 한다. 본 발명의 다른 측면에 따르면, 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 기록 매체를 제공하고, 상기 컴퓨터 명령은 상기 컴퓨터가 상술한 방법을 수행하도록 한다. 본 발명의 다른 측면에 따르면, 컴퓨터 프로그램을 포함하는 컴퓨터 프로그램 제품을 제공하고, 상기 컴퓨터 프 로그램이 프로세서에 의해 수행될 때, 상술한 방법을 구현한다. 본 발명의 다른 측면에 따르면, 상술한 전자 기기를 포함하는 자율 주행 차량을 제공한다."}
{"patent_id": "10-2022-0071342", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 기술 방안으로부터 알 수 있는 것은, 일 측면에 따르면, 본 발명의 실시예는 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하고, 또한, 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고하여, 상기 클라우드가 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 피드백된 상기 자율 주행 차량의 제어 정보를 수신하고, 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어할 수 있다. 자율 주행 차량이 구축된 자율 주행 차량과 클라우드 사이의 통신 링크를 사용하여, 돌발 상황 정보를 보고하여, 클라우드의 좌석 인원이 자율 주행 차량의 돌발 상황을 정확하게 알 수 있고, 클라우드를 트리거하여 상기 자율 주행 차량의 주행을 제어하여, 자율 주행 차량의 원격 제어와 원격 개입을 정확하고 효과적으로 구현할 수 있고, 자율 주행 차량이 돌발 상황에 대응하는 능력을 더 잘 갖추도록 하고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 상술한 기술 방안으로부터 알 수 있는 것은, 다른 측면에 따르면, 본 발명의 실시예는 자율 주행 차량과 클라우 드 사이의 통신 링크를 구축하고, 또한, 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 수신할 수 있고, 상기 돌발 상황 정보에 기반한 상기 클라우 드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량에 상기 자율 주행 차량의 제어 정보를 피드백 하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어할 수 있다. 자율 주행 차량이 구축된 자율 주행 차량과 클라우드 사이의 통신 링크를 사용하여, 돌발 상황 정보를 보고하여, 클라우드의 좌석 인원이 자율 주행 차량의 돌발 상황을 정확하게 알 수 있고, 클라우드를 트리거하여 상기 자율 주행 차량의 주행을 제어하여, 자율 주행 차량의 원격 제어와 개입을 정확하고 효과적으로 구현할 수 있고, 자율 주행 차량이 돌발 상황에 대응하는 능력을 더 잘 갖추도록 하고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 본 명세서에서 설명된 내용은 본 발명의 실시예의 키 또는 중요한 특징을 식별하려는 것이 아니고, 또한 본 발 명의 범위를 제한하려는 것도 아닌 것을 이해하여야 한다. 본 발명의 다른 특징은 하기의 명세서를 통해 용이하 게 이해할 수 있다."}
{"patent_id": "10-2022-0071342", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "하기는 첨부된 도면을 결부하여 본 발명의 예시적 실시예를 설명하되, 여기에는 이해를 돕기 위한 본 발명의 실"}
{"patent_id": "10-2022-0071342", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "시예의 다양한 세부 사항이 포함되며, 이는 단지 예시적인 것으로 간주되어야 한다. 따라서, 본 기술분야의 통 상의 기술자는 본 발명의 범위와 사상을 벗어나지 않으면서, 여기서 설명되는 실시예에 대한 다양한 변경과 수 정이 이루어질 수 있음을 이해해야 한다. 마찬가지로, 명확성 및 간결성을 위해, 아래의 설명에서 공지된 기능 과 구조에 대한 설명을 생략한다. 분명히, 설명된 실시예는 본 발명의 전부의 실시예가 아니라, 일부 실시예이다. 본 발명의 실시예에 따르면, 당 업자가 창조적인 노동을 하지 않은 전제하에서 획득된 전부의 기타 실시예는 모두 본 발명의 보호 범위에 속한 다. 설명해야 하는 바로는, 본 발명의 실시예에 관한 단말 기기는 휴대 전화, 개인 휴대 정보 단말기(Personal Digital Assistant, PDA), 무선 핸드헬드 디바이스, 태블릿 컴퓨터(Tablet Computer) 등의 스마트 디바이스를 포함하지만, 이에 한정되지 않는다. 디스플레이 장치는 컴퓨터, 텔레비전 등의 디스플레이 기능을 구비한 기기 를 포함할 수 있지만, 이에 한정되지 않는다. 또한, 본 명세서의 용어“및/또는”은 관련 대상에서의 관련 관계를 설명하며 3가지 관계가 존재함을 나타낸다. 예를 들어 A 및/또는 B는, A가 단독으로 존재; A와 B가 동시에 존재; B가 단독으로 존재하는 3가지 경우를 표현 할 수 있다. 캐릭터 \"/\"는 일반적으로 전후 관련 대상이 \"또는”의 관계를 가짐을 나타낸다. 자율 주행 기술의 발전에 따라, 운영되고 있는 자율 주행 차량 등과 같은 운영되고 있는 자율 주행 차량에는 이 미 운전자가 없다. 자율 주행 차량의 일상적인 운영 과정에서, 승객의 건강 진료 치료가 필요할 경우, 차량 운 영 스케줄링의 돌발 상황, 운영 구역의 날씨 상황이 나쁠 경우 등과 같은, 돌발 상황이 발생할 가능성이 있다. 발생할 가능성이 있는 돌발 상황에 대응하여, 자율 주행 차량의 안전 주행을 확보하기 위해 자율 주행 차량의 주행에 관련되는 개입을 할 필요가 있다. 현재, 자율 주행 차량이 돌발 상황에 대응하는 해결책은 자율 주행 차량 내의 스탭이 휴먼 컴퓨터 인터랙션 애 플리케이션(Application, APP)의 버튼을 클릭하거나, 또는, 자율 주행 차량 내의 하드웨어 버튼을 클릭하여, 자 율 주행 차량의 주행에 대해 대응하는 개입을 수행한다. 따라서, 자율 주행 차량의 원격 제어와 원격 개입을 편리하고 효과적으로 구현할 수 있고, 자율 주행 차량이 돌 발 상황에 대응하는 능력을 갖추도록 하고, 자율 주행 차량의 주행 안전성과 신뢰성을 더욱 확보할 수 있는 자 율 주행 차량의 제어 방법을 시급히 제공해야 한다. 도 1에 도시된 바와 같이, 도 1은 본 발명의 제1 실시예에 따른 개략도이다. 101, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축한다. 102, 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보 고한다. 103, 상기 클라우드에 의해 피드백된 상기 자율 주행 차량의 제어 정보를 수신하고, 상기 자율 주행 차량의 제 어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드 에 의해 송신된다. 104, 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어한다. 설명해야 하는 바로는, 101∼104의 수행 주체의 일부 또는 전부는 자율 주행 차량의 로컬 단말의 애플리케이션 에 위치할 수 있거나, 또는, 자율 주행 차량의 로컬 단말의 애플리케이션 내의 플러그인 또는 소프트웨어 개발 킷(Software Development Kit, SDK)등의 기능 유닛에 위치할 수도 있고, 본 실시예는 이에 대해 특별히 한정하 지 않는다. 이해 가능한 바로는, 상기 애플리케이션은 자율 주행 차량의 로컬 단말에 인스톨된 로컬 프로그램(nativeApp)일 수 있거나, 또는, 자율 주행 차량의 로컬 단말 브라우저의 하나의 웹페이지 프로그램(webApp)일 수 있고, 본 실 시예는 이에 대해 한정되지 않는다. 이러면, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하고, 또한, 상기 통신 링크에 기반하여, 상기 자 율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고하여, 상기 클라우드가 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 피드백된 상기 자율 주행 차량의 제어 정 보를 수신하고, 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어할 수 있다. 자율주행 차량이 구축된 자율 주행 차량이라고 클라우드 사이의 통신 링크를 사용하여, 돌발 상황 정보를 보고하여, 클라우드의 좌석 인원이 자율 주행 차량의 돌발 상황을 정확하게 알 수 있고, 클라우드를 트리거하여 상기 자율 주행 차량의 주행을 제어하여, 자율 주행 차량의 원격 제어와 원격 개입을 정확하고 효과적으로 구현할 수 있고, 자율 주행 차량이 돌발 상황에 대응하는 능력을 더 잘 갖추도록 하고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 101에서, 상기 자율 주행 차량과 클라우드 사이의 통신 링크의 구축은 서로 다른 트리거 방식을 가질 수 있다. 하나의 구체적인 구현 프로세스에 있어서, 101에서, 구체적으로, 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있다. 구체적인 구현 프로세스에 있어서, 자율 주행 차량의 승객의 돌발적인 개인적 요구가 있는 경우, 자율 주행 차 량의 승객은 클라우드 사이의 통신 링크를 구축하는 조작을 트리거할 수 있다. 자율 주행 차량은 상기 자율 주 행 차량의 승객의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있 다. 예를 들어, 자율 주행 차량의 승객이 돌발적인 질병으로 치료가 필요한 경우, 자율 주행 차량의 승객은 특정한 버튼을 트리거하여, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있다. 다른 구체적인 구현 프로세스에 있어서, 101에서, 구체적으로, 상기 클라우드에 의해 송신된 트리거 명령을 수 신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수도 있고, 상기 트리거 명령은 상기 클라 우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에 의해 송신된다. 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원은 알려진 돌발 상황에 기반하여, 주동적으로 트리거 조작을 수행하여, 자율 주행 차량에 트리거 명령을 송신할 수 있다. 자율 주행 차량은 수신된 상기 클라우드에 의해 송신된 트리거 명령에 기반하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있다. 예를 들어, 클라우드의 좌석 인원은 자율 주행 차량에 대해 일시적으로 스케줄링하여 조절할 필요가 있는 것을 알 수 있고, 당해 클라우드의 좌석 인원은 특정한 버튼을 트리거하여, 대응하는 자율 주행 차량에 트리거 명령 을 송신할 수 있다. 당해 자율 주행 차량은 클라우드에 의해 송신된 트리거 명령을 수신하고, 클라우드에 의해 송신된 트리거 명령에 기반하여, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축한다. 당해 구현 방식은 자율 주행 차량의 승객의 트리거 조작에 응답하여, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있을 뿐만 아니라, 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 클라우드에 의해 송 신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수도 있다. 이로부 터, 자율 주행 차량과 클라우드 사이의 통신 링크, 즉 커뮤니케이션 경로를 보다 유연하고 효과적으로 구축하는 것을 구현할 수 있고, 자율 주행 차량과 클라우드의 정보 인터랙션을 더 잘 보장할 수 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 당해 자율 주행 차량의 제어 방법에서, 또한, 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수집하고, 상기 실시간 이미지를 상기 클라우드에 업로드하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리 거 명령에 대응하는 트리거 조작을 실행할 수도 있다. 당해 구현 방식에서, 자율 주행 차량은 차량용 센서 시스템을 통해 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수집하고, 그 다음에, 수집된 실시간 이미지를 클라우드에 업 로드할 수 있다. 이때, 클라우드의 좌석 인원은 실시간 이미지에 기반하여, 자율 주행 차량의 내부 및 자율 주 행 차량의 외부 중의 적어도 하나의 실시간 상황을 알 수 있고, 실시간 상황에 기반하여, 트리거 명령에 대응하 는 트리거 조작을 실행할 수 있다. 하나의 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원이 실시간 이미지에 기반하여 알게 된 실시간 상황은 승객 행위 상태, 승객 표정 상태 및 차량 설비 상태 중의 적어도 하나를 포함할 수 있지만, 이에 한정되 지 않고, 본 구현 방식은 이에 대해 특별히 한정하지 않는다. 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원이 실시간 이미지로부터 자율 주행 차량 내의 승객이 갑자기 쓰러진 것을 알았을 경우, 클라우드의 좌석 인원은 트리거 명령에 대응하는 트리거 조작을 실행할 수 있 고, 예를 들어, 클라우드의 좌석 인원은 트리거 명령에 대응하는 특정한 버튼을 클릭한다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 당해 자율 주행 차량의 제어 방법에서, 또한, 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수집하고, 상기 실시간 이미지를 상기 클라우드에 업로드하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 제어 정보에 대응하는 트리거 조작을 실행할 수도 있다. 당해 구현 방식에서, 자율 주행 차량이 수집된 실시간 이미지를 클라우드에 업로드한다. 이때, 클라우드의 좌석 인원은 실시간 이미지에 기반하여, 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 실시 간 상황을 알 수 있고, 실시간 상황에 기반하여, 제어 정보에 대응하는 트리거 조작을 실행할 수 있다. 하나의 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원이 실시간 이미지에 기반하여 알게 된 실시간 상황은 승객 행위 상태, 승객 표정 상태 및 차량 설비 상태 중의 적어도 하나를 포함할 수 있지만, 이에 한정되 지 않고, 본 실시예는 이에 대해 특별히 한정하지 않는다. 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원이 실시간 이미지로부터 자율 주행 차량 내의 승객이 갑자기 쓰러진 것을 알았을 경우, 클라우드의 좌석 인원은 제어 정보에 대응하는 트리거 조작을 직접 실행할 수 있고, 예를 들어, 클라우드의 좌석 인원은 제어 정보에 대응하는 특정한 버튼을 클릭한다. 당해 구현 방식에서, 수집된 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 클라우드에 업로드하여, 클라우드의 좌석 인원은 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중 의 적어도 하나의 실시간 상황을 알 수 있고, 클라우드의 좌석 인원이 자율 주행 차량의 내부 및 자율 주행 차 량의 외부 중의 적어도 하나의 돌발 상황을 더욱 신속하게 발견하여 대응하는 조작을 실행하여, 클라우드를 트 리거하여 자율 주행 차량의 주행을 제어하는 것이 편리하고, 자율 주행 차량의 돌발 상황에 대응하는 능력을 더 욱 향상시키고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상술한 구현 방식에 기반하여 상기 자율 주행 차량의 주 행을 제어하는 것을 기반으로, 또한, 수집된 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어 도 하나의 실시간 이미지를 상기 클라우드에 업로드하여, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거 명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조 작을 실행하도록 할 수 있다. 상세한 설명은 상술한 구현 방식의 관련 내용을 참조할 수 있고, 여기에서는 상세 하게 설명하지 않는다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 104에서, 구체적으로, 상기 자율 주행 차량의 교통 환경 정보를 획득할 수 있고, 또한, 상기 자율 주행 차량의 교통 환경 정보와 상기 자율 주행 차량의 제어 정보에 따 라, 상기 자율 주행 차량의 주행을 제어할 수 있다. 당해 구현 방식에서, 자율 주행 차량의 차량용 센서 시스템을 통해 상기 자율 주행 차량의 교통 환경 정보를 획 득할 수 있다. 당해 구현 방식에서, 대체로, 자율 주행 차량의 차량용 센서 시스템을 통해 상기 자율 주행 차량의 교통 환경 정보를 획득할 수 있는 이외에, 자율 주행 차량의 차량용 센서 시스템을 통해, 먼저, 식별해야 할 상기 자율 주 행 차량의 교통 환경 정보를 획득하고, 그 다음에, 자율 주행 차량의 환경 감지 시스템을 사용하여 식별해야 할 상기 자율 주행 차량의 교통 환경 정보를 인식하여, 상기 자율 주행 차량의 교통 환경 정보를 획득할 수도 있다. 하나의 구체적인 구현 프로세스에 있어서, 자율 주행 차량의 환경 감지 시스템은 미리 설정된 환경 정보 인식 모델을 사용하여 식별해야 할 상기 자율 주행 차량의 교통 환경 정보를 인식할 수 있다. 당해 환경 정보 인식 모델은 선형 회귀 모델, 비선형 회귀 모델, 및 딥 러닝 네트워크를 포함할 수 있지만, 이에 한정되지 않는다. 본 실시예는 이에 대해 특별히 한정하지 않는다. 당해 구현 방식에서, 획득된 자율 주행 차량의 교통 환경 정보는 도로 환경 정보, 지도 정보, 장애물 정보, 차 내 환경 정보 및 차량 주행 정보 중의 적어도 하나를 포함할 수 있지만, 이에 한정되지 않는다. 본 실시예는 이 에 대해 특별히 한정하지 않는다. 당해 구현 방식에서, 상기 자율 주행 차량의 제어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에 의해 송신될 수 있다. 상기 돌발 상황 정보는 자율 주행 차량 의 승객 돌발 상황과 자율 주행 차량의 주행 돌발 상황 중의 적어도 하나를 포함할 수 있지만, 이에 한정되지 않는다. 본 실시예는 이에 대해 특별히 한정하지 않는다. 당해 구현 방식에서, 구체적으로, 상기 자율 주행 차량의 교통 환경 정보에 기반하여, 자율 주행 차량 현재의 주행 환경과 주행 상태를 획득하고, 그 다음에, 상기 자율 주행 차량의 제어 정보를 결합하여, 제어 전략을 결 정하고, 그 다음에, 당해 제어 전략에 기반하여 상기 자율 주행 차량의 주행을 제어할 수 있다. 그 중, 제어 전 략은 지연 실행과 즉시 실행 중의 적어도 하나를 포함할 수 있지만, 이에 한정되지 않는다. 하나의 구체적인 구현 프로세스에 있어서, 자율 주행 차량이 수신된 클라우드에 의해 송신된 자율 주행 차량의 제어 정보는 옆에 주차하는 것이며, 획득된 자율 주행 차량의 교통 환경 정보에 기반하여 자율 주행 차량이 현 재 교차로를 통과하는 상태인 것을 알 수 있다. 따라서, 자율 주행 차량이 지연 주차를 실행하도록 제어하고, 비교차로 및 비 정체 교통 도로 세그먼트를 선택하여 옆에 주차하는 것을 실행한다. 당해 구현 방식에서, 상기 자율 주행 차량의 교통 환경 정보와 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 모두 제어할 수 있고, 자율 주행 차량의 주행 환경을 결합하여, 자율 주행 차량을 보 다 정확하고 효과적으로 제어하여 돌발 상황에 대응하는 것을 구현할 수 있고, 자율 주행 차량 돌발 상황에 대 응하는 능력을 향상시키고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상술한 각 구현 방식에 기반하여 상기 클라우드에 의해 피드백된 상기 자율 주행 차량의 제어 정보를 수신한 후, 104를 실행한다. 상세한 설명은 상술한 구현 방식의 관련 내용을 참조할 수 있고, 여기에서는 상세하게 설명하지 않는다. 본 실시예에서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하고, 또한, 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고하여, 상기 클라우드가 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 피드백된 상기 자율 주행 차량의 제 어 정보를 수신하고, 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어할 수 있다. 자율 주행 차량이 구축된 자율 주행 차량과 클라우드 사이의 통신 링크를 사용하여, 돌발 상황 정보를 보고하여, 클라우드의 좌석 인원이 자율 주행 차량의 돌발 상황을 정확하게 알 수 있고, 클라우드를 트리거하여 상기 자율 주행 차량의 주행을 제어하여, 자율 주행 차량의 원격 제어와 원격 개입을 정확하고 효과적으로 구현 할 수 있고, 자율 주행 차량이 돌발 상황에 대응하는 능력을 더 잘 갖추도록 하고, 자율 주행 차량의 주행 안전 성과 신뢰성을 확보할 수 있다. 본 실시예에서, 자율 주행 차량의 승객의 트리거 조작에 응답하여, 자율 주행 차량과 클라우드 사이의 통신 링 크를 구축할 수 있을 뿐만 아니라, 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 클라우드에 의해 송신 된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수도 있다. 이로부터, 자율 주행 차량과 클라우드 사이의 통신 링크, 즉 커뮤니케이션 경로를 보다 유연하고 효과적으로 구축하는 것 을 구현할 수 있고, 자율 주행 차량과 클라우드의 정보 인터랙션을 더 잘 보장할 수 있다. 본 실시예에서, 또한, 수집된 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시 간 이미지를 클라우드에 업로드하여, 클라우드의 좌석 인원이 자율 주행 차량 내의 실시간 상황을 알 수 있고, 클라우드의 좌석 인원이 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 돌발 상황을 더 욱 신속하게 발견하여 대응하는 조작을 실행하여, 클라우드를 트리거하여 자율 주행 차량의 주행을 제어하는 것 이 편리하고, 자율 주행 차량의 돌발 상황에 대응하는 능력을 더욱 향상시키고, 자율 주행 차량의 주행 안전성 과 신뢰성을 확보할 수 있다. 본 실시예에서, 또한, 상기 자율 주행 차량의 교통 환경 정보와 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 모두 제어할 수 있고, 자율 주행 차량의 주행 환경을 결합하여, 자율 주행 차량을 보 다 정확하고 효과적으로 제어하여 돌발 상황에 대응하는 것을 구현할 수 있고, 자율 주행 차량 돌발 상황에 대 응하는 능력을 향상시키고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 또한, 본 실시예에 의해 제공되는 기술 방안을 사용하여, 자율 주행 차량마다 안전 인원을 모두 배치할 필요가 없기 때문에, 비용을 절약한다. 또한, 본 실시예에 의해 제공되는 기술 방안을 사용하여, 사용자의 체험을 효과적으로 향상시킬 수 있다. 도 2에 도시된 바와 같이, 도 2는 본 발명의 제2 실시예에 따른 개략도이다. 201, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축한다. 202, 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌 발 상황 정보를 수신한다. 203, 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차 량에 상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보 에 따라, 상기 자율 주행 차량의 주행을 제어하도록 한다. 설명해야 하는 바로는, 201∼203의 수행 주체의 일부 또는 전부는 네트워크측의 서버 내의 처리 엔진에 위치할 수 있거나, 또는, 네트워크측의 분산 시스템에 위치할 수도 있고, 예를 들어, 네트워크측의 자율 주행 처리 플 랫폼에서의 처리 엔진 또는 분산 시스템 등일 수 있다. 본 실시예는 이에 대해 특별히 한정하지 않는다. 이러면, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하고, 또한, 상기 통신 링크에 기반하여, 상기 자 율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 수신할 수 있고, 상기 돌 발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량에 상기 자 율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따라, 상 기 자율 주행 차량의 주행을 제어할 수 있다. 자율 주행 차량이 구축된 자율 주행 차량이라고 클라우드 사이의 통신 링크를 사용하여, 돌발 상황 정보를 보고하여, 클라우드의 좌석 인원이 자율 주행 차량의 돌발 상황을 정 확하게 알 수 있고, 클라우드를 트리거하여 상기 자율 주행 차량의 주행을 제어하여, 자율 주행 차량의 원격 제 어와 개입을 정확하고 효과적으로 구현할 수 있고, 자율 주행 차량이 돌발 상황에 대응하는 능력을 더 잘 갖추 도록 하고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 201에서, 상기 자율 주행 차량과 클라우드 사이의 통신 링크의 구축은 서로 다른 트리거 방식을 가질 수 있다. 하나의 구체적인 구현 프로세스에 있어서, 201에서, 구체적으로, 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있다. 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원은 알려진 돌발 상황에 기반하여, 주동적으로 트리거 조작을 수행하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있다. 예를 들어, 클라우드의 좌석 인원은 자율 주행 차량에 대해 일시적으로 스케줄링하여 조절할 필요가 있는 것을 알 수 있고, 당해 클라우드의 좌석 인원은 특정한 버튼을 트리거하여, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있다. 다른 구체적인 구현 프로세스에 있어서, 201에서, 구체적으로, 상기 자율 주행 차량에 의해 송신된 트리거 명령 을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수도 있고, 상기 트리거 명령은 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여 상기 자율 주행 차량에 의해 송신된다. 구체적인 구현 프로세스에 있어서, 자율 주행 차량의 승객의 돌발적인 개인적 요구가 있는 경우, 자율 주행 차 량의 승객은 주동적으로 트리거 조작을 수행하여, 클라우드에 트리거 명령을 송신할 수 있고, 클라우드는 수신 된 상기 자율 주행 차량에 의해 송신된 트리거 명령에 기반하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있다. 예를 들어, 자율 주행 차량의 승객이 돌발적인 질병으로 치료가 필요한 경우, 자율 주행 차량의 승객은 특정한 버튼을 트리거하여, 클라우드에 트리거 명령을 송신할 수 있다. 클라우드는 상기 자율 주행 차량에 의해 송신된 트리거 명령을 수신하고, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축한다. 당해 구현 방식에서, 클라우드의 좌석 인원의 트리거 조작에 응답하여, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있을 뿐만 아니라, 자율 주행 차량의 승객의 트리거 조작에 응답하여 송신된 트리거 명령을 자율 주행 차량이 수신하고, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수도 있다. 이로부터, 자율 주행 차량과 클라우드 사이의 통신 링크, 즉 커뮤니케이션 경로를 보다 유연하고 효과적으로 구축하는 것을 구 현할 수 있고, 자율 주행 차량과 클라우드의 정보 인터랙션을 더 잘 보장할 수 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 당해 자율 주행 차량의 제어 방법에서, 또한, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실 시간 이미지를 수신하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거 명령에 대 응하는 트리거 조작을 실행할 수도 있다. 당해 구현 방식에서, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차 량의 외부 중의 적어도 하나의 실시간 이미지를 수신하고, 클라우드의 좌석 인원은 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 실시간 상황을 알 수 있고, 실시간 상황에 기반하여, 트리거 명령에 대응하는 트리거 조작을 실행할 수 있다. 하나의 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원이 실시간 이미지에 기반하여 알게 된 실시간 상황은 승객 행위 상태, 승객 표정 상태 및 차량 설비 상태 중의 적어도 하나를 포함할 수 있지만, 이에 한정되 지 않고, 본 실시예는 이에 대해 특별히 한정하지 않는다. 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원이 실시간 이미지로부터 자율 주행 차량 내의 승객이 갑자기 쓰러진 것을 알았을 경우, 클라우드의 좌석 인원은 트리거 명령에 대응하는 트리거 조작을 실행할 수 있 고, 예를 들어, 클라우드의 좌석 인원은 트리거 명령에 대응하는 특정한 버튼을 클릭한다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 당해 자율 주행 차량의 제어 방법에서, 나아가, 상기 자 율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수신하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 제어 정보에 대 응하는 트리거 조작을 실행할 수도 있다. 당해 구현 방식에서, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차 량의 외부 중의 적어도 하나의 실시간 이미지를 수신하고, 클라우드의 좌석 인원은 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 실시간 상황을 알 수 있고, 실시간 상황에 기반하여, 제어 정보에 대응하는 트리거 조작을 실행한다. 하나의 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원이 실시간 이미지에 기반하여 알게 된 실시간 상황은 승객 행위 상태, 승객 표정 상태 및 차량 설비 상태 중의 적어도 하나를 포함할 수 있지만, 이에 한정되 지 않고, 본 구현 방식은 이에 대해 특별히 한정하지 않는다. 구체적인 구현 프로세스에 있어서, 클라우드의 좌석 인원이 실시간 이미지로부터 자율 주행 차량 내의 승객이 갑자기 쓰러진 것을 알았을 경우, 클라우드의 좌석 인원은 제어 정보에 대응하는 트리거 조작을 실행할 수 있고, 예를 들어, 클라우드의 좌석 인원은 제어 정보에 대응하는 특정한 버튼을 클릭한다. 당해 구현 방식에서, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차 량의 외부 중의 적어도 하나의 실시간 이미지를 수신하고, 클라우드의 좌석 인원은 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 실시간 상황을 알 수 있고, 클라우드의 좌석 인원이 자율 주행 차량 의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 돌발 상황을 더욱 신속하게 발견하여 대응하는 조작을 실행하여, 클라우드를 트리거하여 자율 주행 차량의 주행을 제어하는 것이 편리하고, 자율 주행 차량의 돌발 상 황에 대응하는 능력을 더욱 향상시키고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상술한 구현 방식에 기반하여 상기 자율 주행 차량의 주 행을 제어할 수 있는 동시에서, 또한, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상 기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수신하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거 명령에 대응하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대 응하는 트리거 조작을 실행하도록 할 수도 있다. 상세한 설명은 상술한 구현 방식의 관련 내용을 참조할 수 있 고, 여기에서는 상세하게 설명하지 않는다. 본 실시예에서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하고, 또한, 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 수신할 수 있고, 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량에 상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따 라, 상기 자율 주행 차량의 주행을 제어할 수 있다. 자율 주행 차량이 구축된 자율 주행 차량과 클라우드 사이 의 통신 링크를 사용하여, 돌발 상황 정보를 보고하여, 클라우드의 좌석 인원이 자율 주행 차량의 돌발 상황을 정확하게 알 수 있고, 클라우드를 트리거하여 상기 자율 주행 차량의 주행을 제어하여, 자율 주행 차량의 원격 제어와 개입을 정확하고 효과적으로 구현할 수 있고, 자율 주행 차량이 돌발 상황에 대응하는 능력을 더 잘 갖 추도록 하고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 본 실시예에서, 클라우드의 좌석 인원의 트리거 조작에 응답하여, 자율 주행 차량과 클라우드 사이의 통신 링크 를 구축할 수 있을 뿐만 아니라, 자율 주행 차량의 승객의 트리거 조작에 응답하여 송신된 트리거 명령을 자율 주행 차량이 수신하고, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수도 있다. 이로부터, 자율 주행차량과 클라우드 사이의 통신 링크, 즉 커뮤니케이션 경로를 보다 유연하고 효과적으로 구축하는 것을 구현할 수 있고, 자율 주행 차량과 클라우드의 정보 인터랙션을 더 잘 보장할 수 있다. 본 실시예에서, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수신하고, 클라우드의 좌석 인원은 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 실시간 상황을 알 수 있고, 클라우드의 좌석 인원이 자율 주행 차량의 내 부 및 자율 주행 차량의 외부 중의 적어도 하나의 돌발 상황을 더욱 신속하게 발견하여 대응하는 조작을 실행하 여, 클라우드를 트리거하여 자율 주행 차량의 주행을 제어하는 것이 편리하고, 자율 주행 차량의 돌발 상황에 대응하는 능력을 더욱 향상시키고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 또한, 본 실시예에 의해 제공되는 기술 방안을 사용하여, 자율 주행 차량마다 안전 인원을 모두 배치할 필요가 없기 때문에, 비용을 절약한다. 또한, 본 실시예에 의해 제공되는 기술 방안을 사용하여, 사용자의 체험을 효과적으로 향상시킬 수 있다. 도 3에 도시된 바와 같이, 도 3은 본 발명의 제3 실시예에 따른 개략도이다. 301, 자율 주행 차량이 클라우드와 인터랙션하여 자율 주행 차량과 클라우드 사이의 통신 링크를 구축한다. 설명해야 하는 바로는, 본 실시예에 301∼304는, 자율 주행 차량의 실제 운영에 있어서, 자율 주행 차량과 클라 우드의 인터랙션에 의해, 자율 주행 차량을 제어하여 돌발 상황을 대응하는 프로세스를 표시할 수 있다. 선택적으로, 301에서, 자율 주행 차량과 클라우드 사이의 통신 링크의 구축은 서로 다른 트리거 방식을 가질 수 있다. 본 실시예에 하나의 구체적인 구현 프로세스에 있어서, 301에서, 구체적으로, 자율 주행 차량의 승객의 트리거 조작에 기반하여, 자율 주행 차량으로부터 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수 있다. 예를 들어, 자율 주행 차량의 승객은 자율 주행 차량이 특정한 버튼을 트리거하여, 자율 주행 차량과 클라우드 사이의 통신 링크를 트리거하여 구축할 수 있다. 본 실시예가 다른 구체적인 구현 프로세스에 있어서, 301에서, 구체적으로, 클라우드의 좌석 인원의 트리거 조 작에 기반하여, 클라우드로부터 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수도 있다. 예를 들어, 클라우드의 좌석 인원은 클라우드가 특정한 버튼을 트리거하여, 자율 주행 차량과 클라우드 사이의 통신 링크를 트리거하여 구축할 수 있다. 302, 자율 주행 차량이 통신 링크에 기반하여, 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 클라우드에 보고한다. 선택적으로, 본 실시예에서, 클라우드는 통신 링크에 기반하여, 자율 주행 차량에 의해 보고된 자율 주행 차량 의 승객이 제공한 돌발 상황 정보를 수신할 수 있다. 구체적으로, 301을 실행하여 자율 주행 차량과 클라우드의 통신 링크를 구축한 후, 당해 통신 링크에 기반하여, 클라우드의 좌석 인원은 자율 주행 차량의 승객과 음성통화를 하고, 자율 주행 차량은 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 클라우드에 보고하여, 클라우드가 돌발 상황 정보를 획득하도록 할 수 있다. 구체적으로, 당해 상기 돌발 상황 정보는 자율 주행 차량의 승객 돌발 상황과 자율 주행 차량의 주행 돌발 상황 중의 적어도 하나를 포함할 수 있지만, 이에 한정되지 않는다. 본 실시예에서는 이에 대해 특별히 한정하지 않 는다. 대체적으로, 클라우드의 좌석 인원과 자율 주행 차량의 승객은 음성통화를 할 수 있는 이외에, 클라우드의 좌석 인원과 자율 주행 차량의 승객은 비디오 통화를 할 수도 있다. 303, 클라우드가 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여, 자율 주 행 차량에 자율 주행 차량의 제어 정보를 피드백한다. 선택적으로, 본 실시예에서, 클라우드의 좌석 인원은 돌발 상황 정보를 안 후, 제어 정보에 대응하는 트리거 조 작을 실행하여, 클라우드가 자율 주행 차량에 자율 주행 차량의 제어 정보를 피드백하도록 할 수 있다. 304, 자율 주행 차량이 자율 주행 차량의 제어 정보를 수신하고, 자율 주행 차량의 주행을 제어한다. 선택적으로, 본 실시예에서, 먼저, 자율 주행 차량이 상기 자율 주행 차량의 제어 정보를 수신한 후, 상기 자율 주행 차량의 제어 정보에 따라, 먼저, 클라우드의 좌석 인원이 당해 자율 주행 차량 등록이 합법적인 조작 인원 인지 여부를 확인할 수 있다. 그 다음에, 자율 주행 차량은 상기 자율 주행 차량의 교통 환경 정보를 획득할 수 있다. 구체적으로, 자율 주행 차량의 교통 환경 정보는 도로 환경 정보, 지도 정보, 장애물 정보, 차내 환경 정보 및 차량 주행 정보를 포함할 수 있지만, 이에 한정되지 않는다. 당해 도로 환경 정보는 차선 정보와 도로 가장자리 정보 중의 적어도 하나를 포함할 수 있지만, 이에 한정되지 않는다. 당해 지도 정보는 지리 위치와 네비게이션 정보 중의 적어도 하나를 포함할 수 있지만, 이에 한정되지 않는다. 당해 장애물 정보는 자동차, 비자동차, 보행자, 도로 안전 경고 시설 및 기타 엔티티 중의 적어도 하나를 포함 할 수 있지만, 이에 한정되지 않는다. 당해 차내 환경 정보는 차내 공기 질, 차내 온도 정보 및 차내 환경 소리 정보 중의 적어도 하나를 포함할 수 있지만, 이에 한정되지 않는다. 당해 차량 주행 정보는 차량 현재의 주행 속도, 조향, 기어 위치, 항속, 제동, 자동차 조명 및 소프트웨어 하드 웨어 시스템 상태 중의 적어도 하나를 포함할 수 있지만, 이에 한정되지 않는다. 이해 가능한 바로는, 본 실시예는 상술한 자율 주행 차량의 교통 환경 정보에 대하여 특히 한정되지 않는다. 또한, 획득된 자율 주행 차량의 교통 환경 정보에 의해, 자율 주행 차량이 차 내외가 다양한 교통 환경 상황을 알 수 있고, 예를 들어, 자율 주행 차량의 교통 환경 정보에 의해, 자율 주행 차량이, 주행하는 도로가 사람과 자동차 혼행 도로인지 여부, 주행 도로의 정체 정도, 주행 도로의 전방에 피해야 할 장애물이 있는지 여부, 주 행 도로의 노면에 물이 고였는지 여부, 차량 외부의 이상 날씨, 및 승객의 이상 행위 등의 상황을 알 수 있다. 본 실시예에 하나의 구체적인 구현 프로세스에 있어서, 자율 주행 차량의 차량용 센서 시스템을 통해 상기 자율 주행 차량의 교통 환경 정보를 획득할 수 있다. 본 실시예가 다른 구체적인 구현 프로세스에 있어서, 자율 주행 차량의 차량용 센서 시스템을 통해, 먼저, 식별 해야 할 상기 자율 주행 차량의 교통 환경 정보를 획득하고, 그 다음에, 자율 주행 차량의 환경 감지 시스템을 사용하여 식별해야 할 상기 자율 주행 차량의 교통 환경 정보를 인식하여, 상기 자율 주행 차량의 교통 환경 정 보를 획득할 수도 있다. 구체적인 구현 프로세스에 있어서, 자율 주행 차량의 환경 감지 시스템은 미리 설정된 환경 정보 인식 모델을 사용하여 식별해야 할 상기 자율 주행 차량의 교통 환경 정보를 인식할 수 있고, 이로부터, 자율 주행 차량의 교통 환경 정보를 보다 정확하고 효과적으로 획득할 수 있다. 본 실시예가 다른 구체적인 구현 프로세스에 있어서, 자율 주행 차량은 통신 네트워크에 의해 제공되는 교통 환 경 정보를 획득할 수도 있고, 예를 들어, 자동차 인터넷으로 당해 자율 주행 차량의 교통 환경 정보를 획득할 수 있다. 최후, 구체적으로, 상기 자율 주행 차량의 교통 환경 정보에 기반하여, 자율 주행 차량 현재의 주행 환경과 주 행 상태를 획득하고, 그 다음에, 상기 자율 주행 차량의 제어 정보를 결합하여, 제어 전략을 결정하고, 그 다음 에, 당해 제어 전략에 기반하여 상기 자율 주행 차량의 주행을 제어할 수 있다. 그 중, 제어 전략은 지연 실행 과 즉시 실행 중의 적어도 하나를 포함할 수 있지만, 이에 한정되지 않는다. 본 실시예에 하나의 구체적인 구현 프로세스에 있어서, 자율 주행 차량이 수신된 자율 주행 차량의 제어 정보가 옆에 주차하는 것이며, 자율 주행 차량이 자율 주행 차량의 교통 환경 정보를 획득하고, 획득된 자율 주행 차량 의 교통 환경 정보에 기반하여, 자율 주행 차량이 현재 교차로를 통과하는 상태이다라고 결정한다. 따라서, 자 율 주행 차량이 지연 주차를 실행하도록 제어하고, 비교차로 및 비 정체 교통 도로 세그먼트를 선택하여 옆에 주차하는 것을 실행한다. 본 실시예가 다른 구체적인 구현 프로세스에 있어서, 자율 주행 차량이 수신된 자율 주행 차량의 제어 정보가 차량의 제한 속도를 조절하는 것이며, 예를 들어, 차량의 제한 속도를 95km/h로 조절하고, 자율 주행 차량은 자 율 주행 차량의 교통 환경 정보를 획득하고, 그 다음에, 획득된 자율 주행 차량의 교통 환경 정보에 기반하여,현재 자율 주행 차량의 주행 차선 제한 속도의 역치를 결정하고, 당해 차량의 제한 속도가 자율 주행 차량의 현 재 주행하는 차선 제한 속도의 역치를 만족하는지 여부를 판단할 수 있다. 그럴 경우, 직접 자율 주행 차량 제 한 속도를 95km/h로 조절할 수 있고, 그렇지 않을 경우, 자율 주행 차량 제한 속도를 95km/h로 조절하고, 당해 차량의 제한 속도에 기반하여, 자율 주행 차량 주행 차선을 조절할 수 있다. 본 실시예가 다른 구체적인 구현 프로세스에 있어서, 자율 주행 차량이 일시 주차를 실행한 후, 자율 주행 차량 은 센서 시스템에 의해 수집된 이미지 정보와 교통 환경 정보를 클라우드에 보고할 수 있다. 클라우드는 수신된 이미지 정보와 교통 환경 정보에 기반하여, 자율 주행 차량의 주행 경로를 업데이트하고, 업데이트 후의 자율 주행 차량의 주행 경로를 자율 주행 차량에 송신할 수 있다. 자율 주행 차량은 수신된 업데이트 후의 자율 주행 차량의 주행 경로를 저장하고, 업데이트 후의 자율 주행 차량의 주행 경로에 기반하여, 자율 주행 차량의 주행 을 제어한다. 본 실시예에서, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하고, 자율 주행 차량의 승객과 클라우드의 좌석 인원 사이의 커뮤니케이션 경로를 구축하고, 자율 주행 차량이 구축된 자율 주행 차량과 클라우드 사이의 통신 링크를 사용하여, 돌발 상황 정보의 보고를 가고, 클라우드의 좌석 인원이 자율 주행 차량의 돌발 상황을 정확하게 알 수 있고, 클라우드를 트리거하여 상기 자율 주행 차량의 주행을 제어하여, 자율 주행 차량의 원격 제어와 개입을 정확하고 효과적으로 구현할 수 있고, 자율 주행 차량이 돌발 상황에 대응하는 능력을 더 잘 갖 추도록 하고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 설명해야 하는 바로는, 상술한 각 방법의 실시예에 대해 간단히 설명하기 위해, 일련의 동작 결합으로 기재하였 지만, 본 발명은 본 발명에 따라, 일부 단계가 서로 다른 순서를 사용할 수 있거나, 또는, 동시에 수행할 수 있 으며, 설명된 동작 순서에 의해 제한되지 않는 것을 당업자는 인식해야 한다. 그 다음에, 본 명세서에 기재된 실시예는 모두 바람직한 실시예에 속하고, 관련되는 동작 및 모듈은 반드시 본 발명에 필수적이지 않은 것을 당 업자는 인식해야 한다. 상술한 실시예에서, 각 실시예의 설명에는 각기 중점이 있으며, 일부 실시예에서는 상세히 설명되지 않은 부분 은, 다른 실시예에 관한 설명을 참조할 수 있다 도 4에 도시된 바와 같이, 도 4는 본 발명의 제4 실시예에 따른 개략도이다. 본 실시예의 자율 주행 차량 제어 장치는 구축 유닛, 보고 유닛, 수신 유닛 및 제어 유닛을 포함할 수 있다. 그 중, 구 축 유닛은, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는데 사용되고, 보고 유닛은, 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고하는데 사 용되고, 수신 유닛은, 상기 클라우드에 의해 피드백된 상기 자율 주행 차량의 제어 정보를 수신하는데 사 용되고, 상기 자율 주행 차량의 제어 정보는 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리 거 조작에 응답하여 상기 클라우드에 의해 송신되고, 제어 유닛은, 상기 자율 주행 차량의 제어 정보에 따 라, 상기 자율 주행 차량의 주행을 제어하는데 사용된다. 설명해야 하는 바로는, 본 실시예의 자율 주행 차량 제어 장치 일부 또는 전부는 로컬 단말의 애플리케이션에 위치할 수 있거나, 또는, 로컬 단말의 애플리케이션 내의 플러그인 또는 소프트웨어 개발 킷(Software Development Kit, SDK)등의 기능 유닛에 위치할 수도 있고, 본 실시예는 이에 대해 특별히 한정하지 않는다. 이해 가능한 바로는, 상기 애플리케이션은 로컬 단말에 인스톨된 로컬 프로그램(nativeApp)일 수 있거나, 또는, 로컬 단말 브라우저의 하나의 웹페이지 프로그램(webApp)일 수 있고, 본 실시예는 이에 대해 한정되지 않는다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상기 구축 유닛은, 구체적으로, 상기 자율 주행 차 량의 승객의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는데 사용될 수 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상기 구축 유닛은, 구체적으로, 상기 클라우드에 의 해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는데 사용될 수 도 있고, 상기 트리거 명령은 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 상기 클라우드에 의해 송신 된다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상기 보고 유닛은, 또한, 상기 자율 주행 차량의 내 부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수집하고, 상기 실시간 이미지를 상기 클라우드에 업로드하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거 명령에 대응 하는 트리거 조작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을 실행하도록 하는데 사용될 수도 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상기 제어 유닛은, 구체적으로, 상기 자율 주행 차 량의 교통 환경 정보를 획득하고, 상기 자율 주행 차량의 교통 환경 정보와 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하는데 사용될 수 있다. 본 실시예에서, 구축 유닛이 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하고, 또한, 보고 유닛이 상기 통신 링크에 기반하여, 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보를 상기 클라우드에 보고 미끄러지 듯이 수 있고, 수신 유닛이 상기 클라우드가 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리 거 조작에 응답하여 피드백된 상기 자율 주행 차량의 제어 정보를 수신하고, 제어 유닛이 상기 자율 주행 차량 의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어할 수 있다. 자율 주행 차량이 구축된 자율 주행 차량 과 클라우드 사이의 통신 링크를 사용하여, 돌발 상황 정보를 보고하여, 클라우드의 좌석 인원이 자율 주행 차 량의 돌발 상황을 정확하게 알 수 있고, 클라우드를 트리거하여 상기 자율 주행 차량의 주행을 제어하여, 자율 주행 차량의 원격 제어와 원격 개입을 정확하고 효과적으로 구현할 수 있고, 자율 주행 차량이 돌발 상황에 대 응하는 능력을 더 잘 갖추도록 하고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 본 실시예에서, 자율 주행 차량의 승객의 트리거 조작에 응답하여, 자율 주행 차량과 클라우드 사이의 통신 링 크를 구축할 수 있을 뿐만 아니라, 상기 클라우드의 좌석 인원의 트리거 조작에 응답하여 클라우드에 의해 송신 된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수도 있다. 이로부터, 자율 주행 차량과 클라우드 사이의 통신 링크, 즉 커뮤니케이션 경로를 보다 유연하고 효과적으로 구축하는 것 을 구현할 수 있고, 자율 주행 차량과 클라우드의 정보 인터랙션을 더 잘 보장할 수 있다. 본 실시예에서, 또한, 수집된 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시 간 이미지를 클라우드에 업로드하여, 클라우드의 좌석 인원은 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 실시간 상황을 알 수 있고, 클라우드의 좌석 인원이 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 돌발 상황을 더욱 신속하게 발견하여 대응하는 조작을 실행하여, 클라우드를 트리거하여 자율 주행 차량의 주행을 제어하는 것이 편리하고, 자율 주행 차량의 돌발 상황에 대응하는 능력을 더욱 향상시키고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 본 실시예에서, 또한, 상기 자율 주행 차량의 교통 환경 정보와 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 모두 제어할 수 있고, 자율 주행 차량의 주행 환경을 결합하여, 자율 주행 차량을 보 다 정확하고 효과적으로 제어하여 돌발 상황에 대응하는 것을 구현할 수 있고, 자율 주행 차량 돌발 상황에 대 응하는 능력을 향상시키고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 또한, 본 실시예에 의해 제공되는 기술 방안을 사용하여, 자율 주행 차량마다 안전 인원을 모두 배치할 필요가 없기 때문에, 비용을 절약한다. 또한, 본 실시예에 의해 제공되는 기술 방안을 사용하여, 사용자의 체험을 효과적으로 향상시킬 수 있다. 도 5에 도시된 바와 같이, 도 5는 본 발명의 제5 실시예에 따른 개략도이다. 본 실시예의 자율 주행 차량 제어 장치는 구축 유닛, 수신 유닛 및 피드백 유닛을 포함할 수 있다. 그 중, 구축 유닛은, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는데 사용되고, 수신 유닛은, 상기 통 신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정보 를 수신하는데 사용되고, 피드백 유닛은, 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트 리거 조작에 응답하여, 상기 자율 주행 차량에 상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어하도록 하는데 사용될 수 있다. 설명해야 하는 바로는, 본 실시예의 자율 주행 차량 제어 장치 일부 또는 전부는 네트워크측의 서버 내의 처리 엔진에 위치할 수 있거나, 또는, 네트워크측의 분산 시스템에 위치할 수도 있고, 예를 들어, 네트워크측의 자율 주행 처리 플랫폼에서의 처리 엔진 또는 분산 시스템 등일 수 있다. 본 실시예는 이에 대해 특별히 한정하지 않 는다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상기 구축 유닛은, 구체적으로, 상기 클라우드의 좌 석 인원의 트리거 조작에 응답하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는데 사용될 수 있다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상기 구축 유닛은, 구체적으로, 상기 자율 주행 차 량에 의해 송신된 트리거 명령을 수신하여, 상기 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하는데 사 용될 수도 있고, 상기 트리거 명령은 상기 자율 주행 차량의 승객의 트리거 조작에 응답하여 상기 자율 주행 차 량에 의해 송신된다. 선택적으로, 본 실시예의 가능한 구현 방식에 있어서, 상기 수신 유닛, 또한, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수 신하고, 상기 클라우드의 좌석 인원이 상기 실시간 이미지에 기반하여 상기 트리거 명령에 대응하는 트리거 조 작을 실행하거나, 또는, 상기 제어 정보에 대응하는 트리거 조작을 실행하도록 하는데 사용될 수도 있다. 본 실시예에서, 구축 유닛이 자율 주행 차량과 클라우드 사이의 통신 링크를 구축하고, 또한, 수신 유닛이 상기 통신 링크에 기반하여, 상기 자율 주행 차량에 의해 보고된 상기 자율 주행 차량의 승객이 제공한 돌발 상황 정 보를 수신할 수 있고, 피드백 유닛이 상기 돌발 상황 정보에 기반한 상기 클라우드의 좌석 인원의 트리거 조작 에 응답하여, 상기 자율 주행 차량에 상기 자율 주행 차량의 제어 정보를 피드백하여, 상기 자율 주행 차량이 상기 자율 주행 차량의 제어 정보에 따라, 상기 자율 주행 차량의 주행을 제어할 수 있다. 자율 주행 차량이 구 축된 자율 주행 차량과 클라우드 사이의 통신 링크를 사용하여, 돌발 상황 정보를 보고하여, 클라우드의 좌석 인원이 자율 주행 차량의 돌발 상황을 정확하게 알 수 있고, 클라우드를 트리거하여 상기 자율 주행 차량의 주 행을 제어하여, 자율 주행 차량의 원격 제어와 개입을 정확하고 효과적으로 구현할 수 있고, 자율 주행 차량이 돌발 상황에 대응하는 능력을 더 잘 갖추도록 하고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 본 실시예에서, 클라우드의 좌석 인원의 트리거 조작에 응답하여, 자율 주행 차량과 클라우드 사이의 통신 링크 를 구축할 수 있을 뿐만 아니라, 자율 주행 차량의 승객의 트리거 조작에 응답하여 송신된 트리거 명령을 자율 주행 차량이 수신하고, 자율 주행 차량과 클라우드 사이의 통신 링크를 구축할 수도 있다. 이로부터, 자율 주행 차량과 클라우드 사이의 통신 링크, 즉 커뮤니케이션 경로를 보다 유연하고 효과적으로 구축하는 것을 구현할 수 있고, 자율 주행 차량과 클라우드의 정보 인터랙션을 더 잘 보장할 수 있다. 본 실시예에서, 상기 자율 주행 차량에 의해 업로드된 상기 자율 주행 차량의 내부 및 상기 자율 주행 차량의 외부 중의 적어도 하나의 실시간 이미지를 수신하고, 클라우드의 좌석 인원은 자율 주행 차량의 내부 및 자율 주행 차량의 외부 중의 적어도 하나의 실시간 상황을 알 수 있고, 클라우드의 좌석 인원이 자율 주행 차량의 내 부 및 자율 주행 차량의 외부 중의 적어도 하나의 돌발 상황을 더욱 신속하게 발견하여 대응하는 조작을 실행하 여, 클라우드를 트리거하여 자율 주행 차량의 주행을 제어하는 것이 편리하고, 자율 주행 차량의 돌발 상황에 대응하는 능력을 더욱 향상시키고, 자율 주행 차량의 주행 안전성과 신뢰성을 확보할 수 있다. 또한, 본 실시예에 의해 제공되는 기술 방안을 사용하여, 자율 주행 차량마다 안전 인원을 모두 배치할 필요가 없기 때문에, 비용을 절약한다. 또한, 본 실시예에 의해 제공되는 기술 방안을 사용하여, 사용자의 체험을 효과적으로 향상시킬 수 있다. 본 발명의 기술 방안에서, 예를 들어, 승객 행위 정보, 승객 화상 정보와 같은 관련된 사용자 개인 정보의 획득, 저장, 응용 등은 모두 관련 법률 및 규정에 부합되고, 공서와 양속을 위반하지 않는다. 본 발명의 실시예에 따르면, 본 발명은 또한, 전자 기기, 판독 가능 기록 매체 및 컴퓨터 프로그램 제품을 제공 한다. 또한, 제공되는 전자 기기를 포함하는 자율 주행 차량을 제공한다. 도 6에 도시된 바와 같이, 본 발명의 실시예를 실시하기 위한 예시적인 전자 기기의 예시적인 블록도이다. 전자 기기는 랩톱 컴퓨터, 데스크톱 컴퓨터, 운영 플랫폼, 개인 디지털 비서, 서버, 블레이드 서버, 대형 컴퓨터, 및 다른 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 의미한다. 전자 기기는 개인 디지털 처리, 셀룰러폰, 스마트폰, 웨어러블 기기 및 다른 유사한 계산 장치와 같은 다양한 형태의 이동 장치를 의미할 수도 있다. 본문에서 나타낸 부재, 이들의 연결과 관계, 및 이들의 기능은 단지 예시적인 것으로, 본문에서 설명 및/ 또는 요구된 본 발명의 구현을 한정하지 않는다. 도 6에 도시된 바와 같이, 전자 기기는 컴퓨팅 유닛을 포함하고, 컴퓨팅 유닛은 판독 전용 메모 리(ROM)에 저장되어 있는 컴퓨터 프로그램 또는 저장 유닛으로부터 랜덤 액세스 메모리(RAM)에 로드된 컴퓨터 프로그램에 따라, 다양한 적절한 동작과 처리를 실행할 수 있다. RAM에는 전자 기기가 동작하는데 필요한 여러 가지 프로그램과 데이터도 저장할 수 있다. 컴퓨팅 유닛, ROM 및 RAM는 버스를 통해 서로 연결된다. 입력/출력 (I/O)인터페이스도 버스에 연결된다.전자 기기 중의 복수 컴포넌트는 I/O 인터페이스에 연결되고, 키보드, 마우스 등과 같은 입력 유닛 ; 여러 가지 타입의 디스플레이, 스피커 등과 같은 출력 유닛; 디스크, 광디스크 등과 같은 저장 유 닛 및 네트워크 카드, 모뎀, 무선통신 트랜시버 등과 같은 통신 유닛을 포함한다. 통신 유닛은 전자 기기가 인터넷 등과 같은 컴퓨터 네트워크 및 여러 가지 통신 네트워크 중의 적어도 하나를 통해 다 른 기기와 정보/데이터를 교환할 수 있다. 컴퓨팅 유닛은 여러 가지 처리와 계산 능력을 갖춘 범용 처리 컴포넌트 및 전용 처리 컴포넌트 중의 적어 도 하나일 수 있다. 컴퓨팅 유닛의 일부 예는, 중앙 처리 유닛 (CPU), 그래픽스 처리 유닛(GPU), 다양한 전용 인공지능(AI)계산 팁, 다양한 기계학습 모델 알고리즘을 실행하는 컴퓨팅 유닛, 디지털 신호 프로세서 (DSP) 및 임의의 적절한 프로세서, 컨트롤러, 마이크로 컨트롤러 등을 포함하지만, 이에 한정되지 않는다. 컴퓨 팅 유닛은 자율 주행 차량의 제어 방법 등과 같은 상기의 다양한 방법과 처리를 실행한다. 예를 들면, 일 부 실시예에서, 자율 주행 차량의 제어 방법은 저장 유닛 등과 같은 기계 판독 가능 매체에 유형적으로 포 함되는 컴퓨터 소프트웨어 프로그램으로 구현할 수 있다. 일부 실시예에서, 컴퓨터 프로그램의 일부 또는 전부 는 ROM 및 통신 유닛 중의 적어도 하나를 통해 전자 기기에 로드 및/또는 인스톨될 수 있다. 컴 퓨터 프로그램이 RAM에 로드되어 컴퓨팅 유닛에 의해 실행될 경우, 상기의 자율 주행 차량의 제어 방 법의 하나 또는 복수의 단계를 실행할 수 있다. 대안적으로, 다른 실시예에서, 컴퓨팅 유닛은 다른 임의의 적절한 방식(예를 들면, 펌웨어에 의해)을 통해 자율 주행 차량의 제어 방법을 실행하도록 구성될 수 있다. 설명된 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 필드 프로그래밍 가 능한 게이트 어레이(FPGA), 특정 용도 대상 집적 회로(ASIC), 특정 용도 대상 표준제품(ASSP), 시스템 온 칩 시 스템(SOC), 부하 프로그래밍 가능 논리 장치(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 결 합에서 구현될 수 있다. 이러한 다양한 실시형태는 하나 또는 다수의 컴퓨터 프로그램에서의 구현을 포함할 수 있고, 상기 하나 또는 다수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템에서 실행 및/또는 해석될 수 있으며, 상기 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가 능 프로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치, 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 데이터 및 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치, 및 상기 적어도 하나의 출력 장치에 전송할 수 있다. 본 발명의 방법을 실시하기 위한 프로그램 코드는 하나 또는 복수의 프로그래밍 언어의 임의의 결합을 사용하여 작성할 수 있다. 이러한 프로그램 코드는 프로그램 코드가 프로세서 또는 컨트롤러에 의해 실행될 때 흐름도 및 블록도 중의 적어도 하나에 규정된 기능/동작이 실행되도록, 대형 기계(슈퍼 컴퓨터), 전용 컴퓨터 또는 다른 프로그램 가능한 데이터 처리 장치의 프로세서 또는 컨트롤러에 제공할 수 있다. 프로그램 코드는 완전히 기계 에서 실행되거나, 부분적으로 기계에서 실행되거나, 독립된 소프트웨어 패키지로서 부분적으로 기계에서 실행되 고, 부분적으로 리모트 기계에서 실행되거나 또는 완전히 리모트 기계 또는 서버에서 실행될 수 있다. 본 발명의 문맥에서, 기계 판독 가능 매체는 명령 실행 시스템, 장치 또는 기기의 사용, 또는 명령 실행 시스템, 장치 또는 기기와 결합하여 사용되는 프로그램을 포함하거나 저장할 수 있는 유형적인 매체일 수 있다. 기계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 기록 매체일 수 있다. 기계 판독 가능 매체는 전자, 자기, 광학, 전자기, 적외선, 또는 반도체 시스템, 장치 또는 기기, 또는 상술한 내용의 임의의 적절한 결합을 포함하지만, 이에 한정되지 않는다. 기계 판독 가능 기록 매체의 더 구체적인 예는 하나 또는 복 수의 와이어에 기반한 전기 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 랜덤 액세스 메모리(RAM), 판독 전용 메 모리(ROM), 소거 가능 프로그래머블 판독 전용 메모리(EPROM 또는 플래시 메모리), 광섬유, 포터블 컴팩트 디스 크 판독 전용 메모리(CD-ROM), 광학 저장 장치, 자기 저장 장치 또는 상술한 내용의 임의의 적절한 결합을 포함 한다. 사용자와의 인터랙션을 제공하기 위하여, 컴퓨터에서 여기서 설명된 시스템 및 기술을 실시할 수 있고, 상기 컴 퓨터는 사용자에게 정보를 표시하기 위한 표시 장치(예를 들어, CRT(음극선관) 또는 LCD(액정 표시 장치) 모니 터); 및 키보드 및 지향 장치(예를 들어, 마우스 또는 트랙 볼)를 구비하며, 사용자는 상기 키보드 및 상기 지 향 장치를 통해 컴퓨터에 입력을 제공한다. 다른 타입의 장치는 또한 사용자와의 인터랙션을 제공할 수 있는데, 예를 들어, 사용자에게 제공된 피드백은 임의의 형태의 감지 피드백(예를 들어, 시각 피드백, 청각 피드백, 또 는 촉각 피드백)일 수 있고; 임의의 형태(소리 입력, 음성 입력, 또는 촉각 입력)로 사용자로부터의 입력을 수 신할 수 있다. 여기서 설명된 시스템 및 기술은 백엔드 부재를 포함하는 계산 시스템(예를 들어, 데이터 서버로 사용됨), 또는 미들웨어 부재를 포함하는 계산 시스템(예를 들어, 애플리케이션 서버), 또는 프론트 엔드 부재를 포함하는 계 산 시스템(예를 들어, 그래픽 사용자 인터페이스 또는 네트워크 브라우저를 구비하는 사용자 컴퓨터인 바, 사용 자는 상기 그래픽 사용자 인터페이스 또는 상기 네트워크 브라우저를 통해 여기서 설명된 시스템 및 기술의 실 시형태와 인터랙션할 수 있음), 또는 이러한 백엔드 부재, 미들웨어 부재, 또는 프론트 엔드 부재의 임의의 결 합을 포함하는 계산 시스템에서 구현될 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들어, 통신 네트워크)을 통해 시스템의 부재를 서로 연결시킬 수 있다. 통신 네트워크의 예는, 근거리 통신망(LAN), 광역망 (WAN), 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트 및 서버는 일반적으로 서로 멀리 떨어져 있 고 일반적으로 통신 네트워크를 통해 서로 인터랙션한다. 대응되는 컴퓨터에서 실행되고 또한 서로 클라이언트- 서버 관계를 가지는 컴퓨터 프로그램을 통해 클라이언트 및 서버의 관계를 생성한다. 서버는 클라우드 서버일 수 있고, 분산 시스템의 서버일 수 있거나, 또는 블록 체인을 결합한 서버일 수도 있다."}
{"patent_id": "10-2022-0071342", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부 도면은 본 해결수단을 더 잘 이해하기 위한 것으로, 본 발명에 대해 한정하는 것으로 구성되지 않는다. 도 1은 본 발명의 제1 실시예에 따른 개략도이다. 도 2는 본 발명의 제2 실시예에 따른 개략도이다. 도 3은 본 발명의 제3 실시예에 따른 개략도이다. 도 4는 본 발명의 제4 실시예에 따른 개략도이다. 도 5는 본 발명의 제5 실시예에 따른 개략도이다. 도 6은 본 발명의 실시예의 자율 주행 차량의 제어 방법을 구현하기 위한 전자 기기의 블록도이다."}
