{"patent_id": "10-2019-0176526", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0084759", "출원번호": "10-2019-0176526", "발명의 명칭": "차량 및 그 제어방법", "출원인": "현대자동차주식회사", "발명자": "강경환"}}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량의 자율 주행을 위한 각종 정보를 획득하는 센서부;상기 센서부로부터 획득된 정보에 기초하여 상기 차량의 속도 및 조향을 제어하는 자율 주행 장치;상기 차량 주변의 다른 차량 및 외부 서버와 통신하는 통신부; 및상기 자율 주행 장치의 고장 상태를 모니터링하고, 상기 자율 주행 장치가 고장 난 상태면 상기 외부 서버 또는상기 차량과 같은 방향으로 주행 중인 타겟 차량에 상기 센서부에서 획득한 각종 정보를 송신하도록 상기 통신부를 제어하고, 상기 외부 서버 또는 상기 타겟 차량으로부터 상기 차량의 자율 주행에 필요한 데이터를 수신하면 상기 자율 주행에 필요한 데이터에 기초하여 상기 차량의 속도 및 조향을 제어하는 제어부;를 포함하는차량."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 차량과 같은 방향으로 주행 중인 타겟 차량이 존재하지 않으면 상기 외부 서버에 상기 센서부에서 획득한각종 정보를 송신하도록 상기 통신부를 제어하는 차량."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 차량의 자율 주행에 필요한 데이터는,상기 외부 서버가 상기 차량의 통신부로부터 수신한 각종 정보에 기초하여 산출한 데이터인 차량."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는,상기 차량과 같은 방향으로 주행 중인 타겟 차량이 존재하면 상기 타겟 차량에 상기 센서부에서 획득한 각종 정보를 송신하도록 상기 통신부를 제어하는 차량."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 차량의 자율 주행에 필요한 데이터는,상기 타겟 차량이 상기 차량의 통신부로부터 수신한 각종 정보에 기초하여 산출한 데이터인 차량."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,시각적 정보 또는 청각적 정보 중 적어도 하나를 출력하여 상기 자율 주행 장치의 고장 여부를 운전자에게 공지하는 알림부;를 더 포함하는 차량."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,공개특허 10-2021-0084759-3-상기 제어부는,상기 통신부가 상기 차량의 자율 주행에 필요한 데이터를 수신하지 못하면, 상기 알림부를 제어하여 상기 차량의 주행 모드가 수동 주행 모드로 변경된다는 것을 상기 운전자에게 공지하고 상기 차량의 주행 모드를 수동 주행 모드로 변경하는 차량."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 센서부는,상기 차량의 속도를 감지하는 차속 센서, 상기 차량의 조향각을 감지하는 조향각 센서, 상기 차량 주변의 이미지를 촬영하는 이미지 센서, 상기 차량 주변의 레이더 정보를 획득하는 레이더 센서 중 적어도 하나를 포함하는차량."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 통신부는,상기 차량 주변의 다른 차량들의 목적지 정보를 수신하고,상기 제어부는,상기 차량 주변의 다른 차량들 중 목적지가 상기 차량의 목적지와 가장 가까운 차량을 상기 타겟 차량으로 결정하는 차량."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "차량의 자율 주행을 위한 각종 정보를 획득하는 센서부 및 상기 센서부로부터 획득된 정보에 기초하여 상기 차량의 속도 및 조향을 제어하는 자율 주행 장치가 마련된 차량의 제어방법에 있어서,상기 차량의 자율 주행 장치의 고장 상태를 모니터링하고;상기 자율 주행 장치가 고장 난 상태면 외부 서버 또는 상기 차량과 같은 방향으로 주행 중인 타겟 차량에 상기센서부에서 획득한 각종 정보를 송신하고;상기 외부 서버 또는 상기 타겟 차량으로부터 상기 차량의 자율 주행에 필요한 데이터를 수신하고;상기 자율 주행에 필요한 데이터에 기초하여 상기 차량의 속도 및 조향을 제어하는 것;을 포함하는 차량의 제어방법."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 자율 주행 장치가 고장 난 상태면 외부 서버 또는 상기 차량과 같은 방향으로 주행 중인 타겟 차량에 상기센서부에서 획득한 각종 정보를 송신하는 것은,상기 차량과 같은 방향으로 주행 중인 타겟 차량이 존재하지 않으면 상기 외부 서버에 상기 센서부에서 획득한각종 정보를 송신하는 것;을 포함하는 차량의 제어방법."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 자율 주행 장치가 고장 난 상태면 외부 서버 또는 상기 차량과 같은 방향으로 주행 중인 타겟 차량에 상기센서부에서 획득한 각종 정보를 송신하는 것은,상기 차량과 같은 방향으로 주행 중인 타겟 차량이 존재하면 상기 타겟 차량에 상기 센서부에서 획득한 각종 정보를 송신하는 것;을 포함하는 차량의 제어방법.공개특허 10-2021-0084759-4-청구항 13 제10항에 있어서,상기 차량의 자율 주행에 필요한 데이터는,상기 타겟 차량 또는 상기 외부 서버가 상기 차량으로부터 수신한 각종 정보에 기초하여 산출한 데이터인 차량의 제어방법."}
{"patent_id": "10-2019-0176526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,상기 차량 주변의 다른 차량들의 목적지 정보를 수신하고;상기 차량 주변의 다른 차량들 중 목적지가 상기 차량의 목적지와 가장 가까운 차량을 상기 타겟 차량으로 결정하는 것;을 더 포함하는 차량의 제어방법."}
{"patent_id": "10-2019-0176526", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "자율 주행 차량의 자율 주행 장치가 고장 나더라도 운전자가 조치할 수 있는 충분한 시간을 확보할 수 있는 차량 은 차량의 자율 주행을 위한 각종 정보를 획득하는 센서부; 상기 센서부로부터 획득된 정보에 기초하여 상기 차 량의 속도 및 조향을 제어하는 자율 주행 장치; 상기 차량 주변의 다른 차량 및 외부 서버와 통신하는 통신부; 및 상기 자율 주행 장치의 고장 상태를 모니터링하고, 상기 자율 주행 장치가 고장 난 상태면 상기 외부 서버 또 는 상기 차량과 같은 방향으로 주행 중인 타겟 차량에 상기 센서부에서 획득한 각종 정보를 송신하도록 상기 통 신부를 제어하고, 상기 외부 서버 또는 상기 타겟 차량으로부터 상기 차량의 자율 주행에 필요한 데이터를 수신 하면 상기 자율 주행에 필요한 데이터에 기초하여 상기 차량의 속도 및 조향을 제어하는 제어부;를 포함한다."}
{"patent_id": "10-2019-0176526", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "차량 및 그 제어방법에 관한 것으로, 보다 상세하게는 차량에 마련된 자율 주행 장치가 고장 난 경우 주변 차량 또는 외부 서버로부터 자율 주행에 필요한 데이터를 전달 받아 자율 주행 상태를 유지하는 기술에 관한 것이다."}
{"patent_id": "10-2019-0176526", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 자율 주행 차량(Autonomous Vehicle, 무인자동차 라고도 함)는 차주의 조작 없이도 스스로 외부정보 감시 및 도로 상황을 파악하여 설정 목적지까지 자율주행 할 수 있는 차량을 의미한다. 자율 주행 차량의 제어시스템은 카메라를 이용하여 차선을 인식하고 자동 조향을 행하는 기술로서, 카메라의 이 미지 프로세싱을 기반으로 차선 폭, 차선상의 차량의 횡방향 위치, 양측 차선까지의 거리 및 차선의 형태, 도로 의 곡률 반경이 측정되며, 이와 같이 얻어진 차량의 위치와 도로의 정보를 사용하여 차량의 주행 궤적을 추정하 고, 추정된 주행 궤적을 따라 차선을 변경한다. 자율 주행 차량은 지도기반의 주행경로를 추종하는 것을 기본으로 한다. 다만, 주행 경로 상에 장애물과 같은 변수가 있을 경우, 자율 주행 차량은 실시간으로 주행경로를 변경하여 차량이 안전하게 주행할 수 있도록 제어 한다. 센서와 모터, 인공지능에 의하여 사람을 배제하고 고속도로를 완벽히 자율 주행하는 자동차 제어 기술이 제시되고 있다. 자율 주행 차량은 센서를 이용하여 주변 환경을 3차원으로 인식하고, 통신기술, 인공지능 기술 과 모터 등의 제어기술의 결합하여 완전한 자율주행이 가능한 것이다. 이러한 자율 주행 차량은 차량의 구동부를 자동으로 제어하는 자율 주행 장치를 구비하고 있다. 자율 주행 장치 가 고장나는 경우에는 사고 발생을 방지하기 위하여 차량의 제어권을 운전자에게 이양하여야 하는데, 차량의 제 어권이 이양되기 전 차량은 위험한 상태에 놓일 수 있다."}
{"patent_id": "10-2019-0176526", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "자율 주행 차량의 자율 주행 장치가 고장 난 경우 근처 차량 또는 외부 서버로부터 자율 주행에 필요한 데이터 를 수신하여 자율 주행 모드를 유지함으로써, 차량을 안전한 상태로 유지시키는 것을 목적으로 한다."}
{"patent_id": "10-2019-0176526", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 일 실시예에 따른 차량은, 차량의 자율 주행을 위한 각종 정보를 획득하는 센서부; 상기 센서부로부터 획득된 정보에 기초하여 상기 차량의 속도 및 조향을 제어하는 자율 주행 장치; 상 기 차량 주변의 다른 차량 및 외부 서버와 통신하는 통신부; 및 상기 자율 주행 장치의 고장 상태를 모니터링하 고, 상기 자율 주행 장치가 고장 난 상태면 상기 외부 서버 또는 상기 차량과 같은 방향으로 주행 중인 타겟 차 량에 상기 센서부에서 획득한 각종 정보를 송신하도록 상기 통신부를 제어하고, 상기 외부 서버 또는 상기 타겟차량으로부터 상기 차량의 자율 주행에 필요한 데이터를 수신하면 상기 자율 주행에 필요한 데이터에 기초하여 상기 차량의 속도 및 조향을 제어하는 제어부;를 포함할 수 있다. 또한, 상기 제어부는, 상기 차량과 같은 방향으로 주행 중인 타겟 차량이 존재하지 않으면 상기 외부 서버에 상 기 센서부에서 획득한 각종 정보를 송신하도록 상기 통신부를 제어할 수 있다. 또한, 상기 차량의 자율 주행에 필요한 데이터는, 상기 외부 서버가 상기 차량의 통신부로부터 수신한 각종 정 보에 기초하여 산출한 데이터일 수 있다. 또한, 상기 제어부는, 상기 차량과 같은 방향으로 주행 중인 타겟 차량이 존재하면 상기 타겟 차량에 상기 센서 부에서 획득한 각종 정보를 송신하도록 상기 통신부를 제어할 수 있다. 또한, 상기 차량의 자율 주행에 필요한 데이터는, 상기 타겟 차량이 상기 차량의 통신부로부터 수신한 각종 정 보에 기초하여 산출한 데이터일 수 있다. 또한, 상기 차량은, 시각적 정보 또는 청각적 정보 중 적어도 하나를 출력하여 상기 자율 주행 장치의 고장 여 부를 운전자에게 공지하는 알림부;를 더 포함할 수 있다. 또한, 상기 제어부는, 상기 통신부가 상기 차량의 자율 주행에 필요한 데이터를 수신하지 못하면, 상기 알림부 를 제어하여 상기 차량의 주행 모드가 수동 주행 모드로 변경된다는 것을 상기 운전자에게 공지하고 상기 차량 의 주행 모드를 수동 주행 모드로 변경할 수 있다. 또한, 상기 센서부는, 상기 차량의 속도를 감지하는 차속 센서, 상기 차량의 조향각을 감지하는 조향각 센서, 상기 차량 주변의 이미지를 촬영하는 이미지 센서, 상기 차량 주변의 레이더 정보를 획득하는 레이더 센서 중 적어도 하나를 포함할 수 있다. 또한, 상기 통신부는, 상기 차량 주변의 다른 차량들의 목적지 정보를 수신하고, 상기 제어부는, 상기 차량 주 변의 다른 차량들 중 목적지가 상기 차량의 목적지와 가장 가까운 차량을 상기 타겟 차량으로 결정할 수 있다. 상술한 목적을 달성하기 위한 일 실시예에 따른 차량의 제어방법은, 차량의 자율 주행을 위한 각종 정보를 획득 하는 센서부 및 상기 센서부로부터 획득된 정보에 기초하여 상기 차량의 속도 및 조향을 제어하는 자율 주행 장 치가 마련된 차량의 제어방법에 있어서, 상기 차량의 자율 주행 장치의 고장 상태를 모니터링하고; 상기 자율 주행 장치가 고장 난 상태면 외부 서버 또는 상기 차량과 같은 방향으로 주행 중인 타겟 차량에 상기 센서부에 서 획득한 각종 정보를 송신하고; 상기 외부 서버 또는 상기 타겟 차량으로부터 상기 차량의 자율 주행에 필요 한 데이터를 수신하고; 상기 자율 주행에 필요한 데이터에 기초하여 상기 차량의 속도 및 조향을 제어하는 것; 을 포함할 수 있다. 또한, 상기 자율 주행 장치가 고장 난 상태면 외부 서버 또는 상기 차량과 같은 방향으로 주행 중인 타겟 차량 에 상기 센서부에서 획득한 각종 정보를 송신하는 것은, 상기 차량과 같은 방향으로 주행 중인 타겟 차량이 존 재하지 않으면 상기 외부 서버에 상기 센서부에서 획득한 각종 정보를 송신하는 것;을 포함할 수 있다. 또한, 상기 차량의 자율 주행에 필요한 데이터는, 상기 외부 서버가 상기 차량으로부터 수신한 각종 정보에 기 초하여 산출한 데이터일 수 있다. 또한, 상기 자율 주행 장치가 고장 난 상태면 외부 서버 또는 상기 차량과 같은 방향으로 주행 중인 타겟 차량 에 상기 센서부에서 획득한 각종 정보를 송신하는 것은, 상기 차량과 같은 방향으로 주행 중인 타겟 차량이 존 재하면 상기 타겟 차량에 상기 센서부에서 획득한 각종 정보를 송신하는 것;을 포함할 수 있다. 또한, 상기 차량의 자율 주행에 필요한 데이터는, 상기 타겟 차량이 상기 차량으로부터 수신한 각종 정보에 기 초하여 산출한 데이터일 수 있다. 또한, 일 실시예에 따른 차량의 제어방법은, 시각적 정보 또는 청각적 정보 중 적어도 하나를 출력하여 상기 자 율 주행 장치의 고장 여부를 운전자에게 공지하는 것;을 더 포함할 수 있다. 또한, 일 실시예에 따른 차량의 제어방법은, 상기 외부 서버 또는 상기 타겟 차량으로부터 상기 차량의 자율 주 행에 필요한 데이터를 수신하지 못하면, 상기 차량의 주행 모드가 수동 주행 모드로 변경된다는 것을 운전자에 게 공지하고 상기 차량의 주행 모드를 수동 주행 모드로 변경하는 것;을 더 포함할 수 있다. 또한, 상기 센서부는, 상기 차량의 속도를 감지하는 차속 센서, 상기 차량의 조향각을 감지하는 조향각 센서, 상기 차량 주변의 이미지를 촬영하는 이미지 센서, 상기 차량 주변의 레이더 정보를 획득하는 레이더 센서 중적어도 하나를 포함할 수 있다. 또한, 일 실시예에 따른 차량의 제어방법은, 상기 차량 주변의 다른 차량들의 목적지 정보를 수신하고; 상기 차 량 주변의 다른 차량들 중 목적지가 상기 차량의 목적지와 가장 가까운 차량을 상기 타겟 차량으로 결정하는 것;을 더 포함할 수 있다."}
{"patent_id": "10-2019-0176526", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "자율 주행 차량의 자율 주행 장치가 고장 나더라도 운전자가 조치할 수 있는 충분한 시간을 확보함으로써 교통 사고의 발생을 예방할 수 있다."}
{"patent_id": "10-2019-0176526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "명세서 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 명세서가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2019-0176526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 발명이 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 '부, 모듈, 부재, 블록'이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블 록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 제 1, 제 2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않은 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 발명의 작용 원리 및 실시예들에 대해 설명한다. 도 1 은 일 실시예에 따른 자율 주행 차량이 도로를 주행하고 있는 모습을 도시한 도면이다. 도 1을 참조하면, 일 실시예에 따른 차량은 자율 주행 장치가 마련된 자율 주행 차량을 의미할 수 있 다. 차량에 마련된 자율 주행 장치는 차량에 마련된 복수의 센서로부터 차량의 내부 정보 및 차량의 외부 정보를 획득하고, 획득된 정보에 기초하여 차량의 속도 및 조향을 제어할 수 있다. 또한, 도 1에 도시된 바와 같이, 일 실시예에 따른 차량은 통신부를 구비하여 차량 주변의 다른 차량(201, 202) 및 외부 서버와 통신할 수 있다. 이 때, 차량 주변의 다른 차량(201, 202)은 차량으로부터 미리 설정된 거리 이내에서 주행 중인 차량 을 의미할 수 있으며, 차량의 통신부가 근거리 통신을 사용하는 경우 통신 가능한 거리 내에 존재하 는 차량을 의미할 수 있다.차량 주변의 다른 차량(201, 202) 또한 일 실시예에 따른 차량과 통신하기 위한 통신부를 구비할 수 있으며, 자율 주행 장치를 구비할 수 있다. 이하, 도 2를 참조하여 일 실시예에 따른 차량의 구성을 설명한다. 도 2는 일 실시예에 따른 차량의 제어 블록도이다. 도 2를 참조하면, 일 실시예에 따른 차량은 센서부, 자율 주행 장치, 통신부, 제어부 , 구동부 및 알림부를 포함할 수 있다. 센서부는 차량의 자율 주행을 위한 각종 정보를 획득할 수 있다. 예를 들어, 센서부는 차량 의 속도를 감지하는 차속 센서, 차량의 조향각을 감지하는 조향각 센서, 차량 주변의 이미지를 촬영하여 영상 데이터를 획득하는 이미지 센서, 차량 주변의 레이더 데이터를 획득하는 레이더 센서, 차량 의 현재 위치 정보를 감지하는 GPS 센서 등을 포함할 수 있다. 센서부는 위와 같은 예시에 한정되지 않으며 차량의 자율 주행에 필요한 정보를 획득하는 구성이라면 모두 포함할 수 있다. 즉, 차량의 자율 주행을 위한 각종 정보는, 차량의 속도 정보, 차량의 조향각 정보, 차량 의 현재 위치 정보, 차량 주변의 영상 데이터, 차량 주변의 레이더 데이터를 포함할 수 있다. 자율 주행 장치는 센서부로부터 획득된 각종 정보에 기초하여 차량의 속도 및 조향을 제어할 수 있다. 구체적으로, 자율 주행 장치는 센서부로부터 획득된 정보에 기초하여 차량의 구동부 를 제어하기 위한 제어량을 산출하고, 산출된 제어량에 기초하여 차량의 구동부를 제어할 수 있 다. 예를 들어, 자율 주행 장치는 차량의 주행과 관련된 엔진, 변속기, 모터, 조향 장치 등을 제어할 수 있다. 통신부는 제어부의 제어 신호에 따라 차량 주변의 다른 차량(201, 202) 및 외부 서버와 통 신할 수 있다. 예를 들어, 통신부는 차량 주변의 다른 차량(201, 202)들과 통신을 수행하여 차량 의 주행과 관련된 데이터를 다른 차량(201, 202)에 송신할 수 있고, 다른 차량들(201, 202)로부터 다른 차 량(201, 202)의 주행과 관련된 데이터를 수신할 수 있다. 이를 위한 통신부는 무선 통신 네트워크에 접속할 수 있도록 통신 칩, 안테나 및 관련 부품을 이용하여 구 현될 수 있다. 즉, 통신부는 차량 주변의 다른 차량(201, 202)과 근거리 통신 또는 원거리 통신이 가 능한 다양한 형태의 통신 모듈로 구현될 수 있다. 즉, 통신부는 다른 차량과 무선으로 데이터를 송수신하 는 무선 통신 모듈을 포함할 수 있다. 제어부는 자율 주행 장치의 고장 상태를 모니터링하고, 자율 주행 장치의 고장 상태에 따라 차 량의 각종 구성 요소를 제어할 수 있다. 이를 위한 제어부는 차량 내의 각종 구성 요소를 제어하기 위한 알고리즘 또는 알고리즘을 재현한 프 로그램에 대한 데이터를 저장하는 적어도 하나의 메모리 및 메모리에 저장된 데이터를 이용하여 전술한 또는 후 술할 동작을 수행하는 적어도 하나의 프로세서를 포함할 수 있다. 메모리와 프로세서가 복수인 경우에, 이들이 하나의 칩에 집적되는 것도 가능하고, 물리적으로 분리된 위치에 마련되는 것도 가능하다. 프로세서는 반도체칩, 스위치, 집적 회로, 저항기, 휘발성 또는 비휘발성 메모리 또는 인쇄 회로 기판 등과 같 은 다양한 부품을 이용하여 구현될 수 있으며, ECU(Electronic control unit)를 이용하여 구현될 수 있다. 메모리는 캐쉬, ROM(read only memory), PROM(programmable ROM), EPROM(erasable programmable ROM), EEPROM(electrically erasable programmable ROM) 및 플래쉬 메모리(flash memory)와 같은 비휘발성 메모리 소 자 또는 RAM(random access memory)과 같은 휘발성 메모리 소자 또는 하드디스크 드라이브(hard disk drive, HDD), CD-ROM과 같은 저장 매체 중 적어도 하나로 구현될 수 있다. 다만, 이에 한정되지는 않는 것은 아니며, 각종 정보를 저장할 수 있는 유형이면 메모리의 유형으로 사용될 수 있다. 제어부가 수행하는 역할은 개시된 발명의 일 실시예에 따른 차량 및 그 제어방법을 통해 상세히 설명 한다. 구동부는 제어부 또는 자율 주행 장치로부터 송신된 제어 신호에 따라 차량의 거동을 제어할 수 있는 모든 구성을 의미할 수 있다. 예를 들어, 구동부는 속도 조절부 및 조향각 조절부를 구비하여 차량의 속도 및 조향각을 제어할 수 있다. 속도 조절부는 차량의 속도를 조절할 수 있다. 이를 위한 속도 조절부는 엑셀레이터 구동부와 브레이크 구동부를 포함할 수 있으며, 엑셀레이터 구동부는 제어부 또는 자율 주행 장치의 제어 신호 에 따라 엑셀레이터를 구동하여 차량의 속도를 증가시키고, 브레이크 구동부는 제어부 또는 자율 주 행 장치의 제어 신호에 따라 브레이크를 구동하여 차량의 속도를 감소시킬 수 있다. 조향각 조절부는 차량의 조향각을 조절할 수 있다. 이를 위한 조향각 조절부는 조향 장치를 포 함할 수 있으며, 조향 장치는 제어부 또는 자율 주행 장치의 제어 신호에 따라 차량의 주행 방 향을 변경시킬 수 있다. 구동부는 차량의 거동을 제어할 수 있는 모든 구성을 의미하는 것이며 상기 구성에 한정되지 않음은 물론이다. 알림부는 제어부의 제어 신호에 따라 시각적 정보, 청각적 정보, 촉각적 정보 등 사람의 오감으로 전 달될 수 있는 정보를 출력하는 모든 구성을 의미할 수 있다. 예를 들어, 알림부는 시각적 정보를 출력할 수 있는 디스플레이를 포함하여 사용자에게 차량과 관련 된 정보를 이미지, 또는 텍스트의 형태로 제공하는 UI(User Interface)를 제공할 수 있다. 디스플레이는 차량 내부 AVN 장치, 클러스터(Cluster) 등 다양한 장소에 마련될 수 있으며, 헤드업 디스플 레이(HUD) 형식으로도 구현될 수 있다. 즉, 디스플레이는 운전자가 시각적 정보를 확인할 수 있는 모든 장소에 마련될 수 있으며, 형식의 제한은 없다. 또한, 알림부는 청각적 정보를 출력할 수 있는 스피커를 포함할 수 있으며, 촉각적 정보를 출력할 수 있는 진동체를 포함할 수 있다. 진동체는 차량의 스티어링 휠에 마련되어 운전자에게 촉각적 정보를 전달할 수 있다. 일 실시예에 따른 센서부, 자율 주행 장치, 통신부, 구동부 및 알림부는 제어부(14 0)와 차량 통신 네트워크를 수행하여 각각의 정보를 전달할 수 있다. 차량 통신 네트워크는 CAN(Controller Area Network), LIN(Local Interconnect Network), 플렉스레이 (FlexRay), MOST(Media Oriented System Transport) 등을 포함할 수 있다. 일 예로, 차량에 탑재되는 각종 전장 부하에 대한 제어 및 각종 전장 부하 간의 통신을 위하여 차량 내에는 바디 네트워크(Body Network), 멀티미디어 네트워크(Multimedia Network) 및 샤시 네트워크(Chassis Network) 등을 포함하는 통신 네트워크가 구성되어 있고, 이렇게 서로 분리되어 있는 각 네트워크들은 상호 간 의 CAN(Controller Area Network) 통신 메시지를 주고 받기 위하여 제어부에 의해 연결될 수 있다. 이상으로 차량의 각종 구성을 상세히 설명하였다. 이하 도 3을 참조하여 제어부가 수행하는 역할을 상세하게 설명한다. 도 3은 일 실시예에 따른 차량의 제어방법을 도시한 순서도이다. 도 3을 참조하면, 제어부는 자율 주행 장치의 고장 상태를 모니터링 할 수 있다. 예를 들어, 제어부는 차량 통신 네트워크를 통하여 자율 주행 장치로부터 고장 상태를 직접 수신할 수도 있 고, 차량의 ECU와 연결되어 고장 상태를 수신할 수 있다. 이 후, 제어부는 자율 주행 장치가 고장 났는지 여부를 판단하고, 자율 주행 장치가 고장 난 상태면(1100의 예) 외부 서버 또는 다른 차량(201, 202)에 센서부에서 획득한 각종 정보를 송신하 도록 통신부를 제어할 수 있다. 또한, 도면에는 도시되어 있지 않지만, 제어부는 자율 주행 장치 가 고장 난 상태면 알림부를 제어하여 자율 주행 장치의 고장 여부를 운전자에게 공지할 수 있 다. 알림부는 제어부의 제어 신호에 따라 시각적 정보 또는 청각적 정보 중 적어도 하나를 출력하여 자율 주행 장치의 고장 여부를 운전자에게 공지할 수 있다. 예를 들어, 도 4를 참조하면, 알림부는 제어 부의 제어 신호에 따라 텍스트의 형식으로 자율 주행 장치가 고장났다는 사실을 운전자에게공지하고, 수동 주행 모드로의 변경을 권유하는 메시지를 출력할 수 있다. 제어부는 차량 주변에 타겟 차량이 존재하는지 여부를 판단할 수 있다. 통신부는 차량 주변의 다른 차량들(201, 202)의 목적지 정보를 수신할 수 있으며, 제어부는 차량 주변의 다른 차량들(201, 202) 중 목적지가 차량의 목적지와 가장 가까운 차량을 타겟 차량으로 결정할 수 있다. 예를 들어, 도 1을 참조하면, 차량 주변의 다른 차량들(201, 202) 중 목적지가 차량의 목적지와 가장 가까 운 차량을 타겟 차량으로 선정할 수 있다. 만약 차량 주변에 다른 차량이 아예 존재하지 않거나, 차량과 같은 방향으로 주행 중인 다른 차량이 존재하지 않는 경우(1200의 아니오), 제어부는 외부 서버를 통해 자율 주행에 필요한 데이터를 산출 할 수 있는지 여부를 판단할 수 있다. 구체적으로, 제어부는 통신부를 제어하여 외부 서버에 자율 주행 데이터 산출이 가능한지 여부 를 확인하는 신호를 송출하고, 외부 서버로부터 자율 주행 데이터 산출이 가능하다는 신호를 수신 받으면 (1250의 예), 외부 서버에 센서부에서 획득한 정보를 송신하고, 자율 주행에 필요한 데이터를 수신할 수 있다. 이 때, 자율 주행에 필요한 데이터는 외부 서버가 차량의 통신부로부터 수신한 각종 정보에 기 초하여 산출한 데이터를 의미할 수 있다. 즉, 외부 서버는 차량의 센서부에서 획득된 정보에 기초하여 차량의 구동부를 제어하기 위한 제어량을 직접 산출한 후, 산출된 제어량을 차량의 통 신부로 송신할 수 있다. 제어부는 외부 서버로부터 차량의 자율 주행에 필요한 데이터를 수신하면, 수신된 데이터에 기 초하여 차량의 속도 및 조향각을 제어할 수 있다. 외부 서버가 자율 주행에 필요한 데이터를 산출할 수 없으면(1250의 아니오), 제어부는 알림부 를 제어하여 차량의 주행 모드가 수동 주행 모드로 변경된다는 것을 운전자에게 공지하고, 차량 의 주행 모드를 수동 주행 모드로 변경할 수 있다. 도 5를 참조하면, 알림부는 제어부의 제어 신호에 따라 차량의 주행 모드가 수동 주행 모드로 변경된다는 것을 텍스트의 형식으로 출력할 수 있다. 차량 주변에 차량과 같은 방향으로 주행 중인 타겟 차량이 존재하면(1200의 예), 마찬가지로 제 어부는 통신부를 제어하여 타겟 차량에 자율 주행 데이터 산출이 가능한지 여부를 확인하는 신 호를 송출하고, 타겟 차량으로부터 자율 주행 데이터 산출이 가능하다는 신호를 수신 받으면(1210의 예), 타겟 차량에 센서부에서 획득한 정보를 송신하고, 자율 주행에 필요한 데이터를 수신할 수 있다 . 이 때, 자율 주행에 필요한 데이터는 타겟 차량이 차량의 통신부로부터 수신한 각종 정보에 기 초하여 산출한 데이터를 의미할 수 있다. 즉, 타겟 차량은 차량의 센서부에서 획득된 정보에 기초하여 차량의 구동부를 제어하기 위한 제어량을 직접 산출한 후, 산출된 제어량을 차량의 통 신부로 송신할 수 있다. 이를 위한 타겟 차량은 자율 주행 장치를 구비할 수 있다. 제어부는 타겟 차량으로부터 차량의 자율 주행에 필요한 데이터를 수신하면, 수신된 데이터에 기초하여 차량의 속도 및 조향각을 제어할 수 있다. 반면에 타겟 차량이 자율 주행에 필요한 데이터를 산출할 수 없으면(1210의 아니오), 제어부는 알림 부를 제어하여 차량의 주행 모드가 수동 주행 모드로 변경된다는 것을 운전자에게 공지하고, 차량의 주행 모드를 수동 주행 모드로 변경할 수 있다. 예를 들어, 타겟 차량이 자율 주행 장 치를 구비하고 있지 않으면, 타겟 차량은 자율 주행에 필요한 데이터를 산출할 수 없을 것이다. 도 5를 참조하 면, 알림부는 제어부의 제어 신호에 따라 차량의 주행 모드가 수동 주행 모드로 변경된다는 것 을 텍스트의 형식으로 출력할 수 있다. 일 실시예에 따른 차량의 제어방법에 따르면, 차량의 자율 주행 장치가 고장 나더라도 다른 차 량(201, 202) 또는 외부 서버에서 산출한 제어량에 기초하여 차량의 구동부를 제어할 수 있으므 로, 자율 주행 모드가 일정 시간 유지되게끔 할 수 있다. 이 때, 도 4에 도시된 바와 같이, 운전자에게 수동 주행 모드로의 변경을 권유함으로써, 운전자가 조치를 취하도록 할 수 있다.도 5에 도시된 바와 같이, 만약 다른 차량(201, 202) 또는 외부 서버가 자율 주행에 필요한 데이터를 산출 할 수 없는 경우에는 신속하게 주행 모드의 변경을 알리는 메시지를 출력할 수 있다. 일 실시예에 따른 타겟 차량 또는 외부 서버가 산출하는 차량의 자율 주행에 필요한 데이터는, 차량을 목적지까지 인도할 수 있다. 또한, 타겟 차량 또는 외부 서버가 산출하는 차량의 자율 주행에 필요한 데이터는 차량을 갓길과 같은 안전한 장소까지 인도할 수 있다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2019-0176526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 발명이 속하는 기술분야에서 통상 의 지식을 가진 자는 본 발명의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 발명이 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2019-0176526", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 자율 주행 차량이 도로를 주행하고 있는 모습을 도시한 도면이다. 도 2는 일 실시예에 따른 차량의 제어 블록도이다. 도 3은 일 실시예에 따른 차량의 제어방법을 도시한 순서도이다. 도 4 내지 도 5는 일 실시예에 따른 차량의 알림부를 나타낸 도면이다."}
