{"patent_id": "10-2024-0084163", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0157581", "출원번호": "10-2024-0084163", "발명의 명칭": "광학 부품의 면 형상 보상 시스템 및 그 방법", "출원인": "대한민국", "발명자": "조선호"}}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시험용 광학 부품의 제 1 면에 반사 코팅 박막을 형성한 후, 시험용 광학 부품의 면 형상의 평편도를 측정하는단계; 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 실제 광학 부품의 제 2 면을 초기 연마공정을 수행하는 단계; 상기 실제 광학 부품의 초기 연마 공정 후, 상기 실제 광학 부품의 제 1 면에 반사 코팅 박막을 형성하는 단계; 상기 반사 코팅 박막이 형성된 실제 광학 부품의 면 형상의 평편도를 측정하는 단계; 및상기 측정된 실제 광학 부품의 면 형상의 평편도 값을 반영하여 상기 실제 광학 부품의 제 2 면을 보상 연마 공정을 수행하는 단계; 를 포함하는 광학 부품의 면 형상 보상 방법."}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 초기 연마 공정을 수행하는 단계에서, 상기 시험용 광학 부품이 휘어진 방향과 반대 방향인 상기 실제 광학 부품의 제 2 면을 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 초기 연마 공정을 수행하는 것을 특징으로 하는 광학 부품의면 형상 보상 방법."}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 시험용 광학 부품의 면 형상의 평편도를 측정하는 단계 또는 실제 광학 부품의 면 형상의 평편도를 측정하는 단계에서, 상기 시험용 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면 또는 상기 실제 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면에 레이저 간섭계 또는 파면 센서로 구성된 광학계를 이용하여 면 형상의 평편도를 측정하는 것을 특징으로 하는 광학 부품의 면 형상 보상 방법."}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 또는 제3항에 있어서,상기 평편도 값은 RMS(Root Mean Square) 값을 사용하여 정의하는 것을 특징으로 하는 광학 부품의 면 형상 보상 방법."}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 상기 실제 광학 부품의 제 1 면에 형성되는 반사 코팅 박막의 재질 및 두께를 동일하게 형성하는 것을 특징으로 하는 광학 부품의 면 형상 보상 방법.공개특허 10-2024-0157581-3-청구항 6 제5항에 있어서,상기 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 상기 실제 광학 부품의 제 1 면에 형성되는 반사 코팅 박막은 유전체 다층 박막으로 형성하는 것을 특징으로 하는 광학 부품의 면 형상 보상 방법."}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "시험용 광학 부품의 제 1 면 및 실제 광학 부품의 제 1 면에 반사 코팅 박막을 형성하는 박막 코팅 수단; 상기 반사 코팅 박막이 형성된 시험용 광학 부품의 면 형상 및 상기 반사 코팅 박막이 형성된 실제 광학 부품의평편도를 측정하는 광학 측정 수단; 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 실제 광학 부품의 제 2 면을 초기 연마하는 연마 수단;을 포함하되,상기 박막 코팅 수단에서 실제 광학 부품의 제 2 면을 초기 연마 공정한 후, 상기 실제 광학 부품의 제 1 면에반사 코팅 박막을 형성하고, 상기 광학 측정 수단에서 상기 반사 코팅 박막이 형성된 실제 광학 부품의 면 형상의 평편도를 측정한 후, 상기 연마 수단에서 상기 측정된 실제 광학 부품의 면 형상의 평편도 값을 반영하여 상기 실제 광학 부품의 제 2 면을 보상 연마 공정을 수행하는 광학 부품의 면 형상 보상 시스템."}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 연마 수단은, 상기 시험용 광학 부품이 휘어진 방향과 반대 방향인 상기 실제 광학 부품의 제 2 면을 상기측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 초기 연마 공정을 수행하는 것을 특징으로 하는 광학 부품의 면 형상 보상 시스템."}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 광학 측정 수단은, 상기 시험용 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면 또는 상기 실제 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면에 레이저 간섭계 또는 파면 센서로 구성된 광학계를 이용하여 면 형상의 평편도를 측정하는 것을 특징으로 하는 광학 부품의 면 형상 보상 시스템."}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항 또는 제9항에 있어서,상기 평편도 값은 RMS(Root Mean Square) 값을 사용하여 정의하는 것을 특징으로 하는 광학 부품의 면 형상 보상 시스템."}
{"patent_id": "10-2024-0084163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서, 상기 박막 코팅 수단은, 상기 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 상기 실제 광학 부품의제 1 면에 형성되는 반사 코팅 박막의 재질 및 두께를 동일하게 형성하는 것을 특징으로 하는 광학 부품의 면형상 보상 시스템.공개특허 10-2024-0157581-4-청구항 12 제11항에 있어서,상기 박막 코팅 수단은, 상기 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 상기 실제 광학 부품의제 1 면에 형성되는 반사 코팅 박막은 유전체 다층 박막으로 형성하는 것을 특징으로 하는 광학 부품의 면 형상보상 시스템."}
{"patent_id": "10-2024-0084163", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 광학 부품의 면 형상 보상 방법은, 시험용 광학 부품의 제 1 면에 반사 코팅 박막을 형성한 후, 시험용 광학 부품의 면 형상의 평편도를 측정하는 단계; 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 실제 광학 부품의 제 2 면을 초기 연마 공정을 수행하는 단계; 상기 실제 광학 부품 의 초기 연마 공정 후, 상기 실제 광학 부품의 제 1 면에 반사 코팅 박막을 형성하는 단계; 상기 반사 코팅 박막 이 형성된 실제 광학 부품의 면 형상의 평편도를 측정하는 단계; 및 상기 측정된 실제 광학 부품의 면 형상의 평 편도 값을 반영하여 상기 실제 광학 부품의 제 2 면을 보상 연마 공정을 수행하는 단계; 를 포함하는 점에 그 특 징이 있다."}
{"patent_id": "10-2024-0084163", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 광학 부품의 면 형상 보상 시스템 및 그 방법에 관한 것으로, 특히 광학막 코팅에 의한 응력으로 발 생된 광학 부품의 휨을 보상할 때 사용자 맞춤에 맞도록 정밀하게 조절하여 보상할 수 있는 광학 부품의 면 형 상 보상 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2024-0084163", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "광학 장치는 다양한 광학 소자로 구성되고, 광학 소자는 일반적으로 유리 소재 등의 투명 기판의 한 면에 광학 막이 형성되어 있다. 즉, 대부분의 광학계는 광학 부품에 코팅을 입혀 광량 저하 문제, 파장 선별 등 목적에 맞 게 광학계의 성능을 향상시키기 위한 방안으로 이용하고 있다. 이러한, 광학막으로서는 유전체 단층막이나 유전 체 다층막, 금속막 등의 다양한 광학막이 형성된다. 코팅된 광학막은 각 층의 박막 두께, 재질 등 코팅 설계 후 이를 광학 부품 표면에 증착하게 되면 부품의 매질 경계면에서 반사되거나 투과되는 광량을 조절할 수 있다. 따라서, 광학 부품의 코팅 광학 공정을 통해 특정 파 장의 빛만 반사, 투과하여 선택하는 등 다양하게 활용할 수 있다. 그러나 이들 광학막은 내부 응력(막 응력)을 갖고 있으므로, 증착법 등에 의해 투명 기판에 형성시킨 후에는 막 응력에 의해 투명 기판 전체에 변형이 생긴다. 일부 응용분야에서는 대형 사이즈의 광학 부품이 요구됨에 따라 무게를 줄이기 위해 부품의 두께가 얇아져 광학 코팅에 의한 응력이 강하게 작용하여 부품의 표면이 휘는 현상 의 문제점이 발생된다."}
{"patent_id": "10-2024-0084163", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "앞서 언급한 문제점을 해결하기 위하여, 광학막 코팅에 의한 응력으로 발생된 광학 부품의 휨을 보상할 때 사용 자 맞춤에 맞도록 정밀하게 조절하여 보상할 수 있는 광학 부품의 면 형상 보상 시스템 및 그 방법을 제공한다."}
{"patent_id": "10-2024-0084163", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 광학 부품의 면 형상 보상 방법은, 시험용 광학 부품의 제 1 면에 반사 코팅 박막 을 형성한 후, 시험용 광학 부품의 면 형상의 평편도를 측정하는 단계; 상기 측정된 시험용 광학 부품의 면 형 상의 평편도 결과 값을 기준으로 실제 광학 부품의 제 2 면을 초기 연마 공정을 수행하는 단계; 상기 실제 광학 부품의 초기 연마 공정 후, 상기 실제 광학 부품의 제 1 면에 반사 코팅 박막을 형성하는 단계; 상기 반사 코팅 박막이 형성된 실제 광학 부품의 면 형상의 평편도를 측정하는 단계; 및 상기 측정된 실제 광학 부품의 면 형상 의 평편도 값을 반영하여 상기 실제 광학 부품의 제 2 면을 보상 연마 공정을 수행하는 단계; 를 포함하는 점에 그 특징이 있다. 여기서, 특히 상기 초기 연마 공정을 수행하는 단계에서, 상기 시험용 광학 부품이 휘어진 방향과 반대 방향인 상기 실제 광학 부품의 제 2 면을 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 초기 연마 공정을 수행하는 점에 그 특징이 있다. 여기서, 특히 상기 시험용 광학 부품의 면 형상의 평편도를 측정하는 단계 또는 실제 광학 부품의 면 형상의 평 편도를 측정하는 단계에서, 상기 시험용 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면 또는 상기 실제 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면에 레이저 간섭계 또는 파면 센서로 구성된 광학계를 이용 하여 면 형상의 평편도를 측정하는 점에 그 특징이 있다. 여기서, 특히 상기 평편도 값은 RMS(Root Mean Square) 값을 사용하여 정의하는 점에 그 특징이 있다. 여기서, 특히 상기 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 상기 실제 광학 부품의 제 1 면에 형성되는 반사 코팅 박막의 재질 및 두께를 동일하게 형성하는 점에 그 특징이 있다. 여기서, 특히 상기 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 상기 실제 광학 부품의 제 1 면에 형성되는 반사 코팅 박막은 유전체 다층 박막으로 형성하는 점에 그 특징이 있다. 또한, 본 발명의 일 실시예에 따른 광학 부품의 면 형상 보상 시스템은, 시험용 광학 부품의 제 1 면 및 실제 광학 부품의 제 1 면에 반사 코팅 박막을 형성하는 박막 코팅 수단; 상기 반사 코팅 박막이 형성된 시험용 광학 부품의 면 형상 및 상기 반사 코팅 박막이 형성된 실제 광학 부품의 평편도를 측정하는 광학 측정 수단; 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 실제 광학 부품의 제 2 면을 초기 연마하는 연마 수단;을 포함하되, 상기 박막 코팅 수단에서 실제 광학 부품의 제 2 면을 초기 연마 공정한 후, 상기 실제 광학 부품의 제 1 면에 반사 코팅 박막을 형성하고, 상기 광학 측정 수단에서 상기 반사 코팅 박막이 형성된 실 제 광학 부품의 면 형상의 평편도를 측정한 후, 상기 연마 수단에서 상기 측정된 실제 광학 부품의 면 형상의 평편도 값을 반영하여 상기 실제 광학 부품의 제 2 면을 보상 연마 공정을 수행하는 점에 그 특징이 있다. 여기서, 특히 상기 연마 수단은, 상기 시험용 광학 부품이 휘어진 방향과 반대 방향인 상기 실제 광학 부품의 제 2 면을 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 초기 연마 공정을 수행하는 점에 그 특징이 있다. 여기서, 특히 상기 광학 측정 수단은, 상기 시험용 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면 또는 상기 실제 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면에 레이저 간섭계 또는 파면 센서로 구성된 광 학계를 이용하여 면 형상의 평편도를 측정하는 점에 그 특징이 있다. 여기서, 특히 상기 평편도 값은 RMS(Root Mean Square) 값을 사용하여 정의하는 점에 그 특징이 있다. 여기서, 특히 상기 박막 코팅 수단은, 상기 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 상기 실 제 광학 부품의 제 1 면에 형성되는 반사 코팅 박막의 재질 및 두께를 동일하게 형성하는 점에 그 특징이 있다. 여기서, 특히 상기 박막 코팅 수단은, 상기 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 상기 실 제 광학 부품의 제 1 면에 형성되는 반사 코팅 박막은 유전체 다층 박막으로 형성하는 점에 그 특징이 있다."}
{"patent_id": "10-2024-0084163", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 본 발명의 일 실시예에 따르면, 광학막 코팅에 의한 응력으로 발생된 광학 부품의 휨을 보상할 때 사용 자 맞춤에 맞도록 정밀하게 조절하여 보상할 수 있다. 또한, 대구경을 쓰는 광학계 또는 광학계의 사이즈가 크거나 광학 부품에 다른 기계적 요소를 결합하여 사용하 는 경우에도 적용할 수 있다."}
{"patent_id": "10-2024-0084163", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면을 참조하여 상세하게 설명하도록 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면 을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 제1, 제2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어 들에 의해 한정되어서는 안된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는이라는 용어는 복수의 관련된 기재 항 목들의 조합 또는 복수의 관련된 기재 항목들 중의 어느 항목을 포함한다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 명세서 및 청구범위 전체에서, 어떤 부분이 어떤 구성 요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있다는 것을 의미한다. 이하, 첨부된 도면을 참조하여 본 발명의 일 실시예에 따른 인공지능 신경망을 이용한 소나 수신 신호 보간 시 스템을 설명하기로 한다. 여기서, 각 구성에서 수행하는 구체적인 설명은 후술될 소나 수신 신호 보간 방법에서 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 광학 부품의 면 형상 보상 시스템의 구성을 개략적으로 도시한 도면이고, 도 2는 본 발명의 광학 부품에 반사 코팅 박막이 형성된 예를 도시한 도면이고, 도 3은 상기 도 2의 반사 코팅 박막의 다층 박막층의 구조를 도시한 도면이고, 도 4는 본 발명의 광학 측정 수단에서 코팅된 광학 부품의 편평 도를 측정하는 예를 도시한 도면이고, 도 5는 상기 도 4에서 측정된 결과를 보여주는 도면이다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 광학 부품의 면 형상 보상 시스템은, 박막 코팅 수 단, 광학 측정 수단, 및 연마 수단를 포함하여 구성될 수 있다. 도 2에 도시된 바와 같이, 박막 코팅 수단은 시험용 광학 부품의 제 1 면 및 실제 광학 부품의 제 1 면에 반사 코팅 박막을 형성하게 된다. 여기서, 설명의 편의상 도 2 및 도 3의 시험용 광학 부품과 실제 광학 부품의 구조는 동일하므로 도면 부호를 같이 기재하여 설명하기로 한다. 먼저, 시험용 광학 부품의 제 1 면에 박막 코팅을 한 후 코팅 후의 시험용 광학 부품의 면 형상 결과 값을 참조 하여 실제 광학 부품의 제 1 면에 반사 코팅 박막을 형성하게 된다. 여기서, 광학 부품은 투명 유리 기판일 수 있다. 보다 구체적으로, 박막 코팅 수단은 진공 챔버(미도시) 내에서 박막 코팅 공정을 진행하는 것으로 화학적 또는 물리적으로 세척된 투명한 시험용 광학 부품인 유리 기판(SiC)의 제 1 면에 코팅 물질(예: 금속 또는 유전 체 물질)을 증착하게 된다. 예컨대, 일반적으로 반도체 등의 증착 공정을 수행하는 진공 챔버 내의 기판 홀더에 시험용 광학 부품이 위치한 상태에서 코팅 물질인 증착 소스를 구비하여 증착 소스의 온도를 서서히 올려 증착에 필요한 기체 상태로 만들어 기판 표면에 달라붙도록 박막을 형성한다. 이때, 도 3에 도시된 바와 같이, 기판 홀더(미도시)가 회전하여 광학 부품의 제 1 면상에 균일한 코팅이 이루어지도록 하면서 설정된 두께까지 코팅이 진행하도록 한다. 예컨대, 박막 코팅층은 복수의 층으로 형 성되고 300nm 이하 두께를 갖도록 형성되는 것이 바람직하다. 또한, 실제 광학 부품의 제 1 면에 반사 코팅 박 막도 상술한 바와 같이 동일하게 형성하게 된다. 다시 말해, 박막 코팅 수단은 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 같이 실제 광학 부품의 제 1 면에 형성되는 반사 코팅 박막의 재질 및 두께를 동일하게 형성하게 된다. 또한, 박막 코팅 수단은 시험용 광학 부품의 제 1 면에 형성되는 반사 코팅 박막과 실제 광학 부품의 제 1 면에 형성되는 반사 코팅 박막은 유전체 다층 박막으로 형성하게 된다. 여기서, 코팅 증착 방법은 열 증착, 전자빔 증착 방법 등이 적용될 수 있으며, 코팅의 두께를 실시간으로 측정 하여 진행하게 된다. 그리고, 증착이 완료된 기판을 서서히 냉각하여 급격한 온도 변화에 따른 코팅층에 스트레 스를 줄이도록 한다. 광학 측정 수단은 상기 반사 코팅 박막이 형성된 시험용 광학 부품의 면 형상 및 상기 반사 코팅 박막이 형성된 실제 광학 부품의 평편도를 측정하게 된다. 보다 구체적으로, 광학 측정 수단은 면 형상 측정을 위한 광원 및 센서 등으로 구성된 레이저 간섭계 또는 파면 센서로 구성된 광학계가 적용될 수 있다. 예컨대, 도 4에 도시된 바와 같이, 레이저 간섭계는 측정하고자 하는 표면으로부터 반사된 측정파와 기준 미러 에서 반사된 기준파와의 광경로차로 인해 발생하는 간섭 무늬를 해석하여 형상을 측정한다. 이때, 광학 측정 수 단은 시험용 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면 또는 실제 광학 부품의 반사 코팅 박막 이 형성되지 않은 제 2 면에 간섭계를 이용하여 면 형상의 평편도를 측정하는 것이 바람직하다. 도 5에 도시된 바와 같이, 간섭계 측정 데이터는 광학 부품의 형상측정 결과, 3차원 형상, 편평도 측정 값, 로 우 데이터 및 프로파일 데이터를 포함할 수 있다. 여기서, 일반적으로 휨 정도인 평편도(Flatness)는 RMS(Root Mean Square) 값을 사용하여 정의할 수 있다. 예컨대, 거울의 편평도 사양은 60nm 이하 값을 갖는다. 연마 수단은 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 실제 광학 부품의 제 2 면을 초기 연마하게 된다. 여기서, 연마 수단의 연마 도구 또는 연마도구 인터페이스와 광학 측정 수단 의 레이저 간섭계 또는 파면 센서로 구성된 광학계는 서로 연동되어 광학 측정 수단에서 측정된 평편도 결 과값을 수신하게 된다. 보다 구체적으로, 연마 수단은 일반적으로 연마 툴박스(미도시)의 연마툴은 자전축을 기준으로 자전 구동 되면서 동시에 공전축을 기준으로 공전 구동되어야 한다. 또한, 다양한 연마형상을 실현하기 위해서는 공전속도 (w1)과 자전속도(w2)의 제어가 가능하고, 자전축과 공전축 간의 거리인 편심거리(g)를 조절하게 된다. 연마 수단은 광학 측정 수단에서 측정된 반사 코팅 박막이 형성된 시험용 광학 부품의 면 형상의 평 편도 값을 반영하여 실제 광학 부품의 제 2 면을 초기 연마 공정을 수행하게 된다. 이때, 연마 수단은 시 험용 광학 부품이 휘어진 방향과 반대 방향인 실제 광학 부품의 제 2 면을 측정된 시험용 광학 부품의 면 형상 의 평편도 결과 값을 기준으로 초기 연마 공정을 수행하게 된다. 즉, 실제 광학 부품은 반사 코팅 박막이 형성되기 전에 미리 초기 연마를 수행하는데 이는 미리 시험용 광학 부 품에 형성된 반사 코팅 박막으로 인해 휨 정도를 반영하여 기 설정된 평편도 값으로 연마하게 된다. 다시 말해, 광학 부품을 반사 코팅 박막 형성 전에 미리 연마하여 반사 코팅 박막 후의 휨 현상을 어느 정도 보상하는 평편 도를 갖도록 하기 위함이다. 그러나 반사 코팅 박막이 형성된 실제 광학 부품의 면 형상의 평편도를 정확하지 않기 때문에 미세 조정이 필요 하게 된다. 따라서, 연마 수단은 광학 측정 수단에서 반사 코팅 박막이 형성된 실제 광학 부품의 면 형상의 평편 도를 측정한 결과 값은 수신한 후, 연마 수단에서 측정된 실제 광학 부품의 면 형상의 평편도 값을 반영하여 실제 광학 부품의 제 2 면을 보상 연마 공정을 수행하게 된다. 이때, 연마 수단은 실제 광학 부품의 면 형상을 실시간으로 측정하면서 미세하게 연마 공정을 수행하게 된다. 즉, 한 번의 연마 공정으로 면 형상을 보 상하는 종래 기술보다 보다 정밀하게 면 형상의 휨 현상을 최대한 보상하게 됨으로써 정밀한 광학 부품을 제공 할 수 있게 된다. 도 6은 본 발명의 일 실시예에 따른 광학 부품의 면 형상 보상 방법에 대한 순서도이고, 도 7은 상기 도 6의 각 과정에서 광학 부품의 편평도의 측정 결과를 보여주는 도면이다. 도 6 및 도 7에 도시된 바와 같이, 본 발명의 일 실시예에 따른 광학 부품의 면 형상 보상 방법은, 먼저 시험용 광학 부품의 제 1 면에 반사 코팅 박막을 형성한 후, 시험용 광학 부품의 면 형상의 평편도를 측정하는 단계가 수행된다(S610). 보다 구체적으로, 진공 챔버(미도시) 내에서 박막 코팅 공정을 진행하는 것으로 화학적 또는 물리적으로 세척된 투명한 시험용 광학 부품인 유리 기판(SiC)의 제 1 면에 코팅 물질(예: 금속 또는 유전체 물질)을 증착하게 된 다. 예컨대, 일반적으로 반도체 등의 증착 공정을 수행하는 진공 챔버 내의 기판 홀더에 시험용 광학 부품이 위 치한 상태에서 코팅 물질인 증착 소스를 구비하여 증착 소스의 온도를 서서히 올려 증착에 필요한 기체 상태로 만들어 기판 표면에 달라붙도록 박막을 형성한다. 이때, 기판 홀더(미도시)가 회전하여 광학 부품의 제 1 면상에 균일한 코팅이 이루어지도록 하면서 설정된 두께까지 코팅이 진행하도록 한다. 예컨대, 박막 코팅층 은 유전체 다층 박막 층으로 형성되고 300nm 이하 두께를 갖도록 형성되는 것이 바람직하다. 그리고, 시험용 광학 부품의 반사 코팅 박막이 형성되지 않은 제 2 면에 간섭계 또는 광학계를 이용하여 면 형 상의 평편도를 측정하는 것이 바람직하다. 그리고, 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 실제 광학 부품의 제 2 면을 초 기 연마 공정을 수행하게 된다(S620). 보다 구체적으로, 상기 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준으로 실제 광학 부품의 제 2 면을 초기 연마하게 된다. 여기서, 연마 수단의 연마 도구 또는 연마도구 인터페이스와 광학 측정 수단 의 레이저 간섭계 또는 파면 센서로 구성된 광학계는 서로 연동되어 광학 측정 수단에서 측정된 평편도 결 과값을 수신하게 된다. 보다 구체적으로, 연마 공정 시 연마 툴박스(미도시)의 연마툴은 자전축을 기준으로 자전 구동되면서 동시에 공 전축을 기준으로 공전 구동되어야 한다. 또한, 다양한 연마형상을 실현하기 위해서는 공전속도(w1)과 자전속도 (w2)의 제어가 가능하고, 자전축과 공전축 간의 거리인 편심거리(g)를 조절하게 된다. 이러한 연마 공정은 상기 측정된 반사 코팅 박막이 형성된 시험용 광학 부품의 면 형상의 평편도 값을 반영하여 실제 광학 부품의 제 2 면을 초기 연마 공정을 수행하게 된다. 이때, 연마 공정은 시험용 광학 부품이 휘어진 방향과 반대 방향인 실제 광학 부품의 제 2 면을 측정된 시험용 광학 부품의 면 형상의 평편도 결과 값을 기준 으로 초기 연마 공정을 수행하게 된다. 즉, 실제 광학 부품은 반사 코팅 박막이 형성되기 전에 미리 초기 연마를 수행하는데 이는 미리 시험용 광학 부 품에 형성된 반사 코팅 박막으로 인해 휨 정도를 반영하여 기 설정된 평편도 값으로 연마하게 된다. 다시 말해, 광학 부품을 반사 코팅 박막 형성 전에 미리 연마하여 반사 코팅 박막 후의 휨 현상을 어느 정도 보상하는 평편 도를 갖도록 하기 위함이다. 그 다음, 상기 실제 광학 부품의 초기 연마 공정 후, 상기 실제 광학 부품의 제 1 면에 반사 코팅 박막을 형성 하게 된다(S630). 보다 구체적으로, 진공 챔버(미도시) 내에서 박막 코팅 공정을 진행하는 것으로 화학적 또는 물리적으로 세척된 투명한 광학 부품인 유리 기판(SiC)의 제 1 면에 코팅 물질(예: 금속 또는 유전체 물질)을 증착하게 된다. 예컨 대, 일반적으로 반도체 등의 증착 공정을 수행하는 진공 챔버 내의 기판 홀더에 실제 광학 부품이 위치한 상태에서 코팅 물질인 증착 소스를 구비하여 증착 소스의 온도를 서서히 올려 증착에 필요한 기체 상태로 만들어 기 판 표면에 달라붙도록 박막을 형성한다. 이때, 기판 홀더(미도시)가 회전하여 광학 부품의 제 1 면상에 균 일한 코팅이 이루어지도록 하면서 설정된 두께까지 코팅이 진행하도록 한다. 예컨대, 박막 코팅층은 유전 체 다층 박막 층으로 형성되고 300nm 이하 두께를 갖도록 형성되는 것이 바람직하다. 즉, 상술한 시험용 광학 부품의 반사 코팅 박막의 형성과 동일하게 수행하여 동일한 평편도 값의 조건을 갖도록 한다. 이어서, 상기 반사 코팅 박막이 형성된 실제 광학 부품의 면 형상의 평편도를 측정하는 단계가 수행된다(S640). 보다 구체적으로, 실제 광학 부품의 면 형상의 평편도를 측정하는 단계에서 면 형상 측정을 위한 광원 및 센서 등으로 구성된 레이저 간섭계 또는 파면 센서로 구성된 광학계가 적용될 수 있다. 예컨대, 레이저 간섭계는 측정하고자 하는 표면으로부터 반사된 측정파와 기준 미러에서 반사된 기준파와의 광 경로차로 인해 발생하는 간섭 무늬를 해석하여 형상을 측정한다. 이때, 실제 광학 부품의 반사 코팅 박막이 형 성되지 않은 제 2 면에 간섭계를 이용하여 면 형상의 평편도를 측정하는 것이 바람직하다. 여기서, 간섭계 측정 데이터는 광학 부품의 형상측정 결과, 3차원 형상, 편평도 측정 값, 로우 데이터 및 프로파일 데이터를 포함할 수 있다. 여기서, 일반적으로 휨 정도인 평편도(Flatness)는 RMS(Root Mean Square) 값을 사용하여 정의할 수 있다. 예컨대, 거울의 편평도 사양은 60nm 이하 값을 갖는다. 그리고, 상기 측정된 실제 광학 부품의 면 형상의 평편도 값을 반영하여 상기 실제 광학 부품의 제 2 면을 보상 연마 공정을 수행하는 단계가 수행된다(S650). 보다 구체적으로, 보상 연마 공정은 초기 연마 공정 후의 반사 코팅 박막이 형성된 실제 광학 부품의 면 형상의 평편도를 정확하지 않기 때문에 미세 조정 연마 공정에 해당한다. 즉, 반사 코팅 박막이 형성된 실제 광학 부품의 면 형상의 평편도를 측정한 결과 값을 반영하여 실제 광학 부품 의 제 2 면을 보상 연마 공정을 수행하게 된다. 이때, 보상 연마 공정은 실제 광학 부품의 면 형상을 실시간으 로 측정하면서 미세하게 연마 공정을 수행하게 된다. 예컨대, 도 7에 도시된 바와 같이, 각 단계의 면 형상을 측정한 결과 값은 광학 부품의 코팅 전의 초기 연마 후 면 형상은 1.7㎛의 오목 형상이고, 코팅 후에는 8.6㎛의 볼록 형상을 갖게 된다. 그리고 보상 연마 공정에서 사 용자 설정에 따라 편평도 값을 갖도록 연마할 수 있게 된다. 따라서, 한 번의 연마 공정으로 면 형상을 보상하는 종래 기술보다 보다 정밀하게 면 형상의 휨 현상을 최대한 보상하게 됨으로써 정밀한 광학 부품을 제공할 수 있게 된다. 본 발명의 일 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행 가능한 명령어를 포 함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의 의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체 및 통신 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구 현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 통신 매체는 전형적으로 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈, 또는 반송파와 같은 변조된 데이터 신호의 기타 데이터, 또는 기타 전송 메커니즘을 포함하며, 임의의 정보 전달 매체를 포함한다. 본 발명의 방법 및 시스템은 특정 실시예와 관련하여 설명되었지만, 그것들의 구성 요소 또는 동작의 일부 또는 전부는 범용 하드웨어 아키텍쳐를 갖는 컴퓨터 시스템을 사용하여 구현될 수 있다."}
{"patent_id": "10-2024-0084163", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다.본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2024-0084163", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 광학 부품의 면 형상 보상 시스템의 구성을 개략적으로 도시한 도면. 도 2는 본 발명의 광학 부품에 반사 코팅 박막이 형성된 예를 도시한 도면. 도 3은 상기 도 2의 반사 코팅 박막의 다층 박막층의 구조를 도시한 도면.도 4는 본 발명의 광학 측정 수단에서 코팅된 광학 부품의 편평도를 측정하는 예를 도시한 도면. 도 5는 상기 도 4에서 측정된 결과를 보여주는 도면. 도 6은 본 발명의 일 실시예에 따른 광학 부품의 면 형상 보상 방법에 대한 순서도. 도 7은 상기 도 6의 각 과정에서 광학 부품의 편평도의 측정 결과를 보여주는 도면."}
