{"patent_id": "10-2021-0002183", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0099835", "출원번호": "10-2021-0002183", "발명의 명칭": "불량 로봇을 검출 및 제어하는 클라우드 로봇 시스템", "출원인": "엘지전자 주식회사", "발명자": "양현석"}}
{"patent_id": "10-2021-0002183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "불량로봇 검출 및 제어 시스템에 있어서,복수의 로봇; 및상기 복수의 로봇을 제어하는 클라우드 서버를 포함하고, 상기 클라우드 서버는 제1로봇의 센서 또는 통신 불량 상태를 감지하고, 제1로봇을 특정 장소로 이동하도록 제어하는,불량로봇 검출 및 제어 시스템."}
{"patent_id": "10-2021-0002183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항1에 있어서,상기 클라우드 서버는,상기 제1로봇의 위치정보를 기반으로, 상기 제1로봇으로부터 특정한 범위 내에 있는 제2로봇에 상기 제1로봇에대한 접근 명령을 전송하는,불량로봇 검출 및 제어 시스템."}
{"patent_id": "10-2021-0002183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항2에 있어서,상기 클라우드 서버는,상기 제2로봇에 상기 제1로봇을 제어하기 위한 보안 키를 전송하고, 상기 제2로봇은,상기 보안 키를 기반으로 근거리 통신망에 의하여 상기 제1로봇에 접속하고, 상기 제1로봇이 상기 특정 장소로이동하도록 제어하는,불량로봇 검출 및 제어 시스템."}
{"patent_id": "10-2021-0002183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항3에 있어서,상기 제2로봇은,상기 제1로봇이 상기 특정 장소로 이동하는 동안 상기 제1로봇을 추종하여 이동하는,불량로봇 검출 및 제어 시스템."}
{"patent_id": "10-2021-0002183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항3에 있어서,상기 제2로봇은,상기 제1로봇의 이동 경로 상에 위치한 복수의 로봇을 포함하는,불량로봇 검출 및 제어 시스템."}
{"patent_id": "10-2021-0002183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2022-0099835-3-청구항1에 있어서,상기 센서의 불량 상태 감지는,카메라 센서의 경우 화면이 블랙(black)이거나 특정 시간동안 데이터 변화 값이 특정 범위 이하인 경우에 불량상태로 감지되고,라이다 센서의 경우 데이터가 0 또는 무한대 값이거나 intensity 값이 특정 영역이 일정 값 이상인 경우 불량상태로 감지되는,불량로봇 검출 및 제어 시스템."}
{"patent_id": "10-2021-0002183", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항1에 있어서,상기 복수의 로봇은 특정한 시간을 주기로 통신 상태 신호를 송수신하고, 특정 로봇에 대하여 통신 상태 신호가감지되지 않는 경우, 상기 클라우드 서버 및 상기 로봇에서 통신 불량 상태를 감지하는,불량로봇 검출 및 제어 시스템."}
{"patent_id": "10-2021-0002183", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예들에 따른 불량로봇 검출 및 제어 시스템, 복수의 로봇 및 상기 복수의 로봇을 제어하는 클라우드 서버를 포함하고, 상기 클라우드 서버는 제1로봇의 센서 또는 통신 불량 상태를 감지하고, 제1로봇을 특정 장소로 이동 하도록 제어한다. 따라서, 로봇의 자율주행 서비스 중 센서 또는 통신 불량 상황이 발생하더라도 시스템적으로 불량 상태의 로봇이 불량 상태를 개선할 수 있는 특정 장소에 이동하므로 시스템의 관리 효율이 증대된다."}
{"patent_id": "10-2021-0002183", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 로봇을 제어하는 시스템에 관한 것으로서, 불량 로봇을 검출하고, 복수의 로봇들을 제어하는 서비스 를 제공하기 위한 로봇 시스템에 관한 것이다."}
{"patent_id": "10-2021-0002183", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇이 발전하면서, 로봇이 서버와 데이터를 주고받으면서 자율적으로 서비스를 수행하는 시스템이 발전하고 있 다. 로봇과 관련한 선행기술로서, 한국 등록특허 KR1520635, 미국 등록특허 US 9408029, 미국 공개특허 US 16/724824, 미국 등록특허 US 10012992, 미국 등록특허 US 9868212, 한국 등록특허 KR 2043421, 미국 등록특허 US 9802309, 미국 등록특허 US 9399290, 미국 등록특허 US 8532820, 미국 공개특허 US 16/557,000 등이 있다. 하지만, 상기의 선행기술들은 로봇과 로봇 간 관계에 대한 개시가 없거나, 로봇의 상태에 문제가 발생한 경우 (데이터 센싱 불가, 그밖에 이상 상황 등)에 적절한 해결책을 제시하지 않는다. 로봇 서비스의 품질의 높이기 위해서 자율주행 로봇에 이상 상태가 감지될 경우의 대비가 필요하다."}
{"patent_id": "10-2021-0002183", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서에 기술된 실시예들은 불량 로봇을 판별하는 방법을 제공하는 것을 일 목적으로 한다. 또한, 기존의 정상 로봇을 이용하여 불량 로봇을 제어하는 것을 일 목적으로 한다. 또한, 불량 로봇을 판별 후 로봇의 제어 권한에 관한 보안 방법을 제공하는 것을 일 목적으로 한다."}
{"patent_id": "10-2021-0002183", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예들에 따른 불량 로봇 검출 및 제어 시스템(이하, 시스템)은, 특정 상황에서 로봇의 제어 권한 을 클라우드 서버 또는 다른 로봇에게 위임하여 클라우드 서버 또는 다른 로봇이 불량 로봇을 제어할 수 있다. 또한, 시스템은 특정 상황에 대한 기준으로 불량 로봇의 고장난 센서가 라이다(lidar)인지 카메라(camera)인지 통신 불량인지 판단하여, 정상 로봇의 센서를 이용할 수 있는지 여부를 판단할 수 있다. 또한, 시스템은 통신 불량 로봇인 경우 정상 로봇이 클라우드로부터 보안 키를 수신하여 정상 로봇을 제어할 수 있다. 또한, 다른 로봇의 센서를 이용하여 로봇을 제어할 수 있다. 또한, 시스템은 정상 로봇이 클라우드로부터 불량 로봇의 마지막 위치를 수신하고, 정상 로봇들의 센서(특히, 카메라)를 활용하여 불량 로봇이 어디로 이동해야 할 지 “삼각 측정법“ 등의 알고리즘을 활용하여 역으로 계 산할 수 있다. 또한, 시스템은 불량 로봇의 통신 상태가 불량인 경우, 메쉬 네트워크(mesh network)기술 등을 이용하여 정상 로봇들이 불량 로봇에게 명령을 전달할 수 있다. 이때, 정상 로봇은 불량 로봇을 제어할 수 있는 보안 키를 클 라우드로부터 수신할 수 있다. 또한, 시스템은 불량 로봇을 감지하는 방법과 관련하여, 라이다(Lidar)의 경우 range 값이 전부 다 로봇의 반경 보다 이하일 때, 카메라의 경우 전부 black 화면이거나 데이터 값이 변화가 없는 경우, 또는 주기적인 통신 상 태가 끊겼음이 판단되는 경우에 불량 로봇으로 감지할 수 있다. 시스템의 클라우드(서버)는 불량 로봇을 감지한 경우, 클라우드 서버 또는 제어가 가능한 다른 정상 로봇을 이용하여 불량 로봇을 수리 센터까지 안전하게 제어, 운송할 수 있다. 또한, 시스템은 클라우드(서버)에서 불량 로봇의 기 설정된 범위 내에 있는 정상 로봇에게 신호를 보낼 수 있다. 정상 로봇은 클라우드로부터 수신한 불량 로봇의 위치로 이동할 수 있고, 정상 로봇들의 센서를 활용하여 불량 로봇의 이동을 보조할 수 있다. 이때, 정상 로봇의 센서를 이용하여 삼각측량법 등의 방법을 통해 불량 로 봇을 수리 센터로 이동하도록 제어할 수 있다. 또한, 불량 로봇이 클라우드와의 연결이 끊어진 경우 정상 로봇 의 mesh network를 이용하여 정상 로봇이 불량 로봇을 제어할 수 있다. 이때 정상 로봇은 클라우드로부터 보안 키를 수신한다."}
{"patent_id": "10-2021-0002183", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따른 불량 로봇의 검출 및 제어 시스템(이하 '시스템')은 불량 로봇의 주변 정상 로봇을 이용하여 불량 로봇을 안전하게 수리센터로 이동시킬 수 있으므로 시스템의 자율성이 높다. 또한, 시스템은 모든 로봇에게 불량 로봇의 제어 권한을 주는 것이 아니라 불량 로봇의 통신 상태가 끊긴 경우 에 다른 로봇들이 불량 로봇을 제어할 수 있도록 함으로써 보안 문제을 해결한다. 또한, 시스템은 로봇의 이상 상태가 감지되는 경우, 주변의 로봇을 제어하여 로봇의 이상 상황으로 인하여 발생 할 수 있는 다양한 문제를 사전에 방지할 수 있다."}
{"patent_id": "10-2021-0002183", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "실시예들의 바람직한 실시예에 대해 구체적으로 설명하며, 그 예는 첨부된 도면에 나타낸다. 첨부된 도면을 참 조한 아래의 상세한 설명은 실시예들의 실시예에 따라 구현될 수 있는 실시예만을 나타내기보다는 실시예들의 바람직한 실시예를 설명하기 위한 것이다. 다음의 상세한 설명은 실시예들에 대한 철저한 이해를 제공하기 위해세부 사항을 포함한다. 그러나 실시예들이 이러한 세부 사항 없이 실행될 수 있다는 것은 당업자에게 자명하다. 실시예들에서 사용되는 대부분의 용어는 해당 분야에서 널리 사용되는 일반적인 것들에서 선택되지만, 일부 용 어는 출원인에 의해 임의로 선택되며 그 의미는 필요에 따라 다음 설명에서 자세히 서술한다. 따라서 실시예들 은 용어의 단순한 명칭이나 의미가 아닌 용어의 의도된 의미에 근거하여 이해되어야 한다. 도1은 본 발명의 실시예들에 따른 시스템의 운영 예시이다. 본 발명의 실시예들에 따른 시스템은 클라우드 서버와 복수의 로봇들을 포함할 수 있다. 클라우드 서버는 복수의 로봇들을 제어할 수 있다. 로봇들에 대한 기본적인 모든 제어는 클라우 드 서버에서 수행할 수 있다. 실시예들에 따른 시스템은 특정 시나리오에 따라 필요한 경우, 제어 권한을 지정한 로봇에게 일시 위임할 수 있다. 위임할 때, 위임 내용은 타겟 로봇명(id, robot model serial number or name), 위임 기간, 위임을 위 한 인증서(보안키)를 포함할 수 있다. 실시예들에 따른 시스템은 모든 로봇의 제어가 클라우드 서버에 의해서 수행되나, 예외 상황을 설정 할 수 있다. 예외 상황은 오프라인에서 긴급(Emergency) 버튼이 발동되거나, 로봇이 통신 불량 상태인 경 우, 로봇의 센서가 불량 상태인 경우를 포함할 수 있다. 도2는 본 발명의 실시예들에 따른 시스템의 동작에 대한 플로우 차트(flow chart) 예시이다. 도2를 참조하면, 시스템은 불량로봇 발생 시 클라우드와 불량로봇이 통신하여 통신 상황 또는 센서 불량 등 불량로봇의 자율 주행 불가능 상황을 감지할 수 있다.(S110) 불량로봇의 불량 상태는 라이다 센서의 경우 range 값의 범위를 기반으로 판단되고, 카메라의 경우 화면 이 블랙인지 여부와 데이터 값 변화로 판단될 수 있다. 불량로봇은 클라우드와 통신이 가능한 경우 불량 상황을 송신(report)할 수 있다. 불량로봇이 클라우드와 통신이 불가능한 경우 모니터링 중인 클라우드가 직접 제어할 수 있다. 클라우드는 불량로봇의 설정된 범위 내에 로봇들(예를들어 정상로봇1, 정상로봇2)에게 신호를 전송할 수 있다. 해당 신호는 불량로봇의 마지막 위치를 포함할 수 있다.(S120) 불량로봇의 설정된 범위 내에 정상로봇이 없는 경우는 최종 정지한다. 정상로봇은 수신된 신호를 기반으로 불량로봇으로 이동할 수 있다. 또한, 정상로봇은 불량로봇 의 이동 경로 분석 데이터를 클라우드에 송신할 수 있다.(S130) 클라우드는 불량로봇의 이동경로를 분석할 수 있다. 또한, 클라우드는 불량로봇의 통신상태가 정상인 경우, 불량로봇의 모터 데이터만을 제어할 수 있다. 불량로봇의 통신상태가 비정상인 경우, 메쉬네트워크(mesh network)로 정상로봇들이 불량로봇 을 제어할 수 있다. 이때, 클라우드는 정상로봇에게 불량로봇을 제어하기 위한 보안 키를 전송할 수 있다. (S140) 도3은 본 발명의 실시예들에 따른 시스템의 불량 로봇 제어 예시이다. 도3은 불량로봇이 센서불량인 경우의 시스템의 동작을 설명한다. 도3을 참조하면, 시스템은 클라우드가 정상로봇들의 센서를 이용해 불량로봇의 위치를 수신할 수 있고, 불량로봇을 제어할 수 있다. 정상로봇이 불량로봇을 따라갈 수 있는 경우, 다수의 정 상로봇이 필요하지 않을 수 있다. 정상로봇이 정지 상태이거나, 다른 업무 중인 경우, 불량로봇(30 0)의 이동경로에 있는 다른 정상로봇의 센서를 새롭게 이용하여 클라우드가 불량로봇을 제 어할 수 있다. 시스템의 클라우드는 복수의 정상로봇들의 센서 정보를 기반으로, 정상로봇의 움 직임을 제어하지 않으면서, 불량로봇이 장애물을 피해 목적지(예를들면, 수리센터)에 도달하도록 제어할 수 있다. 한편, 불량로봇의 센서/통신 불량 여부 판단 기준은 다음과 같다. 센서 불량의 경우, 센서의 각 제조사에서 지정하는 센서 불량 기준에 해당되는 경우 로봇이 클라우드로 불 량상태를 송신할 수 있다. 1) 카메라 센서 사용시: black화면(=camera data=0)이거나 일정 시간 동안 데이터 변화 값이 사전에 설정된 범 위 이하인 경우 불량 상태로 인식할 수 있다. 2) Lidar 센서 사용시: Lidar의 데이터가 전부 0 또는 무한대 값, intensity value가 특정 영역(각도)이 일정 값 이상인 경우 불량 상태로 인식할 수 있다. 실시예들에 따른 센서는 주행을 위한 것으로서, 주행을 위한 센서는 여러 종류가 많이 융합되지 않는다. 주행을 위한 센서는 Lidar 전방, 카메라 2개를 필수적으로 포함할 수 있고, 나머지 센서들은 로봇에 장착된 초음파 센서, 후방 Lidar 및 rear sense(depth cam)는 장애물 감지로 사용될 수 있다. 실시예들에 따른 로봇은 장애물이 감지되면 주행 알고리즘에 영향을 주기보다는 하드웨어적으로 일단 모터 동작이 정지된다. 통신 불량의 경우, 모든 로봇이 주기적(예를들어, 1sec-10min)으로 서로 특정 시그널(예를들면, 통신 상태 알림 신호, heartbeat signal)을 보내도록 설정될 수 있다. 통신 상태 알림 신호(Heartbeat signal)이 감지되지 않 는 경우, 클라우드 및 로봇 측에서 각각 “통신 불량 상태＂를 인식할 수 있다. 로봇에서 전술한 센서들에 의해 센싱된 데이터는 클라우드 서버로 전송되고, 클라우드 서버는 로봇의 불량 여부를 판단할 수 있다(통신이 가능한 경우). 또는 로봇이 자체적으로 불량 여부를 판단(로봇에 센서 불량 판단 모듈 존재)하여 클라우드 서버로 레포트할 수 있다. 도4는 본 발명의 실시예들에 따른 시스템의 실시예들에 대한 설명이다. 도4는 정상로봇을 이용하여 불량로봇의 위치를 판단하는 내용에 관한 실시예들을 설명한다. 제1 실시예는 Stereo Cap 또는 Depth Cam을 활용한 경우이다. 해당 로봇을 image 내에서 detection하고, detection 된 물체(object)의 상대 거리(d)를 획득한다. 그리고, 클라우드로 데이터를 전송하고, 정상로봇의 direction(θ)과 position(p) 정보를 기반으로 불량로봇의 최종위치와 방향이 획득될 수 있다. 제2 실시예는, 일반 single monoclar camera를 활용한 경우, PoseNet을 활용할 수 있다. (https://www.tensorflow.org/lite/models/pose_estimation/overview) 인공지능 영상 학습을 기반으로 카메라 이미지만으로 해당 object의 거리와 위치가 카메라 중심으로 획득될 수 있다. 해당 카메라를 기준으로 클라우드에서 PoseNet을 활용하여 학습한다. 클라우드에서 정상로봇을 불량로봇의 위치 로 이동시킨다. 정상로봇이 카메라로 불량 로봇이 화면 내 감지 되도록 회전한다. 정상로봇이 capture한 camera 이미지를 클라우드로 전송한다. 클라우드에서 PoseNet을 통해 불량 로봇 위치를 획득할 수 있다. 도5는 본 발명의 실시예들에 따른 시스템의 불량 로봇 위치 추측에 관한 플로우 차트 예시이다. 로봇들은 기본 모바일 네트워크(4G/5G)로만 클라우드에 연결될 수 있다. 불량 상태가 검출되면, 통신 불량로봇 의 근거리 통신망이 enable한 경우, 근거리 통신망으로 대표적인 Bluetooth, Wifi(Ad-Hoc) 등 통신 수단 을 활용하여, 주변 정상 로봇과 연결될 수 있다. 클라우드로부터 보안 키 위임을 받은 정상로봇은 해당 불량로봇에 접속 시도할 수 있다(클라우 드로부터 전달 받은 타겟 로봇명으로). 정상로봇이 불량로봇에 접속 완료되면, 불량로봇에 명령어(이동)를 전달할 수 있다. 명령어 전 달이 실패한 경우, 클라우드에 불량로봇 사망을 최후 통보할 수 있다. 도5의 플로우 차트를 순서대로 설명하면, 실시예들에 따른 시스템은 센서불량이 감지된 불량로봇이 있을 경우(S210), 클라우드가 불량로봇의 마지막 위치(P)를 중심으로 근방의 정상로봇을 탐색하여 정상로 봇에게 P 위치로 이동 명령을 전송할 수 있다(S220). 또한, 정상로봇은 센서를 활용하여 불량로봇 의 상대 위치를 추측할 수 있다. 그리고, 정상로봇은 불량로봇의 상대 위치 값을 클라우드로 전 송할 수 있다. 클라우드는 수신한 불량로봇의 상대 위치 값을 기반으로 불량로봇의 위치를 계산한 다.(S230) 그리고, 불량로봇이 통신 불량 상태인지를 검사한다. 불량로봇의 통신 상태가 정상인 경우, 클라우드 에서 직접 불량로봇에게 이동 명령을 송신하여 불량로봇을 제어한다. 불량로봇의 통신 상태가비정상인 경우, 클라우드 서버는 정상로봇을 기반으로 불량로봇을 이동 제어할 수 있다.(S240) 정상로봇을 기반으로 불량로봇을 이동 제어하는 과정은 다음과 같다. 불량로봇이 근거리 통신망 을 활성화하고(S241), 클라우드는 정상로봇에 불량로봇 제어를 위한 위임 보안인증서를 전송하며 (S242), 정상로봇은 수신한 위임 보안인증서를 기반으로 불량로봇에 접속할 수 있다(S243). 클라우드 는 정상로봇에게 불량로봇의 이동 명령을 전달하고(S244), 정상로봇은 불량로봇에게 하달 받은 이동 명령을 전달할 수 있다(S245). 또한, 클라우드는 정상로봇에게 불량로봇과 동일한 목적지 로 이동을 명령할 수 있다(S250). 도 6은 본 발명의 실시예들에 따른 로봇 시스템의 통신 불량 상태 예시이다. 실시예들에 따른 시스템은 클라우드 서버 및 복수의 로봇들을 포함한다. 로봇이 통신 불량 상태에 있는 경우, 불량로봇은 클라우드 서버가 아닌 다른 권한있는 로봇이 제어 권한을 갖도록 채널/포트는 오픈할 수 있다. 로봇의 통신 보안 모듈이 보안권한을 open/close하는 역할을 수행 할 수 있다. 또한, 불량로봇은 근거리 통신망을 활성화할 수 있다. 클라우드 서버는 불량로봇의 식별정보 및 보안 키를 전송할 정상로봇을 선택할 수 있다. 구체적 으로, 마지막으로 감지된 불량로봇의 위치를 기준으로 특정 범위 내에 위치한 정상로봇을 선택할 수 있다. 또한, 클라우드 서버는 불량로봇의 식별정보와 보안 키를 정상로봇에 전송할 수 있다. 보 안 키는 공인인증서의 형태로 전송될 수 있다. 정상로봇은 클라우드 서버로부터 보안 키를 수신하여 불량로봇에 보안 키 입력하고 제어권한 획 득할 수 있다. 정상로봇이 불량로봇에 가까이 위치하면 open된 채널&근거리 통신망을 이용하여 클라 우드 서버가 정상로봇에서 불량로봇으로 보안 키를 입력하도록 제어할 수 있다. 정상로봇 이 보안 키를 보유하고 범위 내로 근접하면 자동으로 불량로봇의 제어 권한을 획득할 수 있다. 정상로봇과 불량로봇간의 채널이 활성화되면 클라우드 서버는 정상 로봇을 통해 불량 로봇 제어 할 수 있다. 실시예들에 따른 시스템은 불량로봇 또는 정상로봇을 단순히 통신 채널 연결 수단으로 사용할 수 있고, 불량로봇의 경로(도3, 400)를 따라 통신 채널 연결 수단인 정상로봇을 계속 교체해 가면서 불량로봇을 제어할 수 있다. 실시예들에 따른 시스템은 아래와 같이 불량로봇 검출 및 제어 방법을 수행할 수 있다. 실시예들에 따른 불량로봇 검출 및 제어 방법은 특정 사이트에서 복수개의 로봇이 운영하되, 제 1 로봇이 통신 상황 또는 센서 불량으로 주행이 불가능한 경우를 감지하는 단계, 정상로봇들 중 일부(제 2 로봇)가 맹인 로봇이 되어 제 1 로봇을 수리 센터로 안내하는 단계, 제 2 로봇은 클라우드로부터 제 1 로봇의 마지막 위 치를 수신하여 제 1 로봇의 위치까지 이동, 제 2 로봇은 다른 로봇(제 3 로봇)들의 센서(예를 들어, 카메라)를 활용하여 제 1 로봇이 어디로 이동해야 하는지를 계산하는 단계, 제 1 로봇의 통신 상태가 정상이고, 센서만 불 량인 경우, 계산된 데이터를 클라우드로 전송하여 클라우드에서 제 1 로봇을 제어하는 단계, 제 1 로봇의 통신 상태가 끊긴 경우, mesh network 기술을 이용하여 제 2 내지 제 3 로봇이 제 1 로봇에 명령을 전달(이 경우, 제 1 로봇을 제어하는 보안 키를 클라우드로부터 수신)하는 단계를 포함할 수 있다. 실시예들은 방법 및/또는 장치 관점에서 설명되었으며, 방법의 설명 및 장치의 설명은 상호 보완하여 적용될 수 있다. 설명의 편의를 위하여 각 도면을 나누어 설명하였으나, 각 도면에 서술되어 있는 실시 예들을 병합하여 새로운 실시 예를 구현하도록 설계하는 것도 가능하다. 그리고, 통상의 기술자의 필요에 따라, 이전에 설명된 실시 예 들을 실행하기 위한 프로그램이 기록되어 있는 컴퓨터에서 판독 가능한 기록 매체를 설계하는 것도 실시예들의 권리범위에 속한다. 실시예들에 따른 장치 및 방법은 상술한 바와 같이 설명된 실시 예들의 구성과 방법이 한정 되게 적용될 수 있는 것이 아니라, 실시 예들은 다양한 변형이 이루어질 수 있도록 각 실시 예들의 전부 또는 일부가 선택적으로 조합되어 구성될 수도 있다. 실시예들의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 실시예들은 상술한 특정의 실시 예에 한정되지 아니하며, 청구범위에서 청구하는 실시예들의 요지를 벗어남이"}
{"patent_id": "10-2021-0002183", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "없이 당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 실시예들의 기술적 사상이나 전망으로부터 개별적으로 이해돼서는 안 될것이다. 실시예들의 장치의 다양한 구성요소들은 하드웨어, 소프트웨어, 펌웨어 또는 그것들의 조합에 의해 수행될 수 있다. 실시예들의 다양한 구성요소들은 하나의 칩, 예를 들면 하나의 하드웨어 서킷으로 구현될 수 있다 실시예 들에 따라, 실시예들에 따른 구성요소들은 각각 별도의 칩들로 구현될 수 있다. 실시예들에 따라, 실시예들에 따른 장치의 구성요소들 중 적어도 하나 이상은 하나 또는 그 이상의 프로그램들을 실행 할 수 있는 하나 또는 그 이상의 프로세서들로 구성될 수 있으며, 하나 또는 그 이상의 프로그램들은 실시예들에 따른 동작/방법들 중 어느 하나 또는 그 이상의 동작/방법들을 수행시키거나, 수행시키기 위한 인스트럭션들을 포함할 수 있다. 실시 예들에 따른 장치의 방법/동작들을 수행하기 위한 실행 가능한 인스트럭션들은 하나 또는 그 이상의 프로세서들 에 의해 실행되기 위해 구성된 일시적이지 않은 CRM 또는 다른 컴퓨터 프로그램 제품들에 저장될 수 있거나, 하 나 또는 그 이상의 프로세서들에 의해 실행되기 위해 구성된 일시적인 CRM 또는 다른 컴퓨터 프로그램 제품들에 저장될 수 있다. 또한 실시예들에 따른 메모리는 휘발성 메모리(예를 들면 RAM 등)뿐 만 아니라 비휘발성 메모 리, 플래쉬 메모리, PROM등을 전부 포함하는 개념으로 사용될 수 있다. 또한, 인터넷을 통한 전송 등과 같은 캐 리어 웨이브의 형태로 구현되는 것도 포함될 수 있다. 또한, 프로세서가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 프로세서가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 이 문서에서 “”와 “”는 “및/또는”으로 해석된다. 예를 들어, “”는 “및/또는 B”로 해석되고, “B”는 “및/또는 B”로 해석된다. 추가적으로, “”는 “B 및/또는 C 중 적어도 하나”를 의미한다. 또한, “B, C”도 “B 및/또는 C 중 적어도 하나”를 의미한다. 추가적으로, 이 문서에서 “또는”는 “및/또는”으로 해석된다. 예를 들어, “또는 B”은, 1) “”만을 의미하고, 2) “”만을 의미하거나, 3) “및 B”를 의미할 수 있다. 달 리 표현하면, 본 문서의 “또는”은 “추가적으로 또는 대체적으로(additionally or alternatively)”를 의미할 수 있다. 제1, 제2 등과 같은 용어는 실시예들의 다양한 구성요소들을 설명하기 위해 사용될 수 있다. 하지만 실시예들에 따른 다양한 구성요소들은 위 용어들에 의해 해석이 제한되어서는 안된다. 이러한 용어는 하나의 구성요소를 다 른 구성요소와 구별하기 위해 사욛외는 것에 불과하다. 것에 불과하다. 예를 들어, 제1 사용자 인풋 시그널은 제2사용자 인풋 시그널로 지칭될 수 있다. 이와 유사하게, 제2사용자 인풋 시그널은 제1사용자 인풋시그널로 지 칭될 수 있다. 이러한 용어의 사용은 다양한 실시예들의 범위 내에서 벗어나지 않는 것으로 해석되어야만 한다. 제1사용자 인풋 시그널 및 제2사용자 인풋 시그널은 모두 사용자 인풋 시그널들이지만, 문맥 상 명확하게 나타 내지 않는 한 동일한 사용자 인풋 시그널들을 의미하지 않는다. 실시예들을 설명하기 위해 사용된 용어는 특정 실시예들을 설명하기 위한 목적으로 사용되고, 실시예들을 제한 하기 위해서 의도되지 않는다. 실시예들의 설명 및 청구항에서 사용된 바와 같이, 문맥 상 명확하게 지칭하지 않는 한 단수는 복수를 포함하는 것으로 의도된다. 및/또는 표현은 용어 간의 모든 가능한 결합을 포함하는 의 미로 사용된다. 포함한다 표현은 특징들, 수들, 단계들, 엘리먼트들, 및/또는 컴포넌트들이 존재하는 것을 설명 하고, 추가적인 특징들, 수들, 단계들, 엘리먼트들, 및/또는 컴포넌트들을 포함하지 않는 것을 의미하지 않는다. 실시예들을 설명하기 위해 사용되는, ~인 경우, ~때 등의 조건 표현은 선택적인 경우로만 제한 해석되 지 않는다. 특정 조건을 만족하는 때, 특정 조건에 대응하여 관련 동작을 수행하거나, 관련 정의가 해석되도록 의도되었다. 또한, 본 문서에서 설명하는 실시예들에 따른 동작은 실시예들에 따라서 메모리 및/또는 프로세서를 포함하는 송수신 장치에 의해 수행될 수 있다. 메모리는 실시예들에 따른 동작을 처리/제어하기 위한 프로그램들을 저장 할 수 있고, 프로세서는 본 문서에서 설명한 다양한 동작을 제어할 수 있다. 프로세서는 컨트롤러 등으로 지칭 가능하다. 실시예들에 동작들은 펌웨어, 소프트웨어, 및/또는 그것들의 조합에 의해 수행될 수 있고, 펌웨어, 소프트웨어, 및/또는 그것들의 조합은 프로세서에 저장되거나 메모리에 저장될 수 있다. 한편, 상술한 실시예들에 따른 동작은 실시예들 따른 송신 장치 및/또는 수신 장치에 의해서 수행될 수 있다. 송수신 장치는 미디어 데이터를 송수신하는 송수신부, 실시예들에 따른 프로세스에 대한 인스트럭션(프로그램 코드, 알고리즘, flowchart 및/또는 데이터)을 저장하는 메모리, 송/수신 장치의 동작들을 제어하는 프로세서를 포함할 수 있다. 프로세서는 컨트롤러 등으로 지칭될 수 있고, 예를 들어, 하드웨어, 소프트웨어, 및/또는 그것들의 조합에 대응 할 수 있다. 상술한 실시예들에 따른 동작은 프로세서에 의해 수행될 수 있다. 또한, 프로세서는 상술한 실시예 들의 동작을 위한 인코더/디코더 등으로 구현될 수 있다.부호의 설명 100: 클라우드 서버 200: 정상로봇 300: 불량로봇 400: 이동경로 500: 목적지"}
{"patent_id": "10-2021-0002183", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 실시예들을 더욱 이해하기 위해서 포함되며, 도면은 실시예들에 관련된 설명과 함께 실시예들을 나타낸 다. 이하에서 설명하는 다양한 실시예들의 보다 나은 이해를 위하여, 하기 도면들에 걸쳐 유사한 참조 번호들이 대응하는 부분들을 포함하는 다음의 도면들과 관련하여 이하의 실시예들의 설명을 반드시 참조해야 한다. 도1은 본 발명의 실시예들에 따른 시스템의 운영 예시이다. 도2는 본 발명의 실시예들에 따른 시스템의 동작에 대한 플로우 차트(flow chart) 예시이다. 도3은 본 발명의 실시예들에 따른 시스템의 불량 로봇 제어 예시이다. 도4는 본 발명의 실시예들에 따른 시스템의 실시예들에 대한 설명이다. 도5는 본 발명의 실시예들에 따른 시스템의 불량 로봇 위치 추측에 관한 플로우 차트 예시이다. 도6은 본 발명의 실시예들에 따른 로봇 시스템의 통신 불량 상태 예시이다."}
