{"patent_id": "10-2023-0013282", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0120833", "출원번호": "10-2023-0013282", "발명의 명칭": "비알코올성 지방간염 진단용 조성물 및 이를 이용한 비알코올성 지방간염 진단 방법", "출원인": "성균관대학교산학협력단", "발명자": "류동렬"}}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "Alpha-2-Macroglobulin(A2M), Amyloid P Component, Serum (APCS), Apolipoprotein F(APOF) 및 Interleukin-32(IL32)로 이루어진 군에서 선택되는 어느 하나 이상의 단백질 또는 상기 단백질을 암호화하는 유전자를 검출하는 제제를 포함하는 비알코올성 지방간염 진단용 조성물."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 단백질은 인체로부터 분리된 혈액 시료 내의 단백질인, 비알코올성 지방간염 진단용 조성물."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 단백질을 검출하는 제제는 항체, 앱타머, 리간드, PNA(peptide nucleic acid) 및 올리고펩타이드로 이루어진 군으로부터 선택되는 어느 하나 이상인, 비알코올성 지방간염 진단용 조성물."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 유전자를 검출하는 제제는 프라이머, 프로브 및 안티센스 뉴클레오타이드로 이루어진 군으로부터 선택되는 어느 하나 이상인, 비알코올성 지방간염 진단용 조성물."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 따른 조성물을 포함하는, 비알코올성 지방간염 진단용 키트."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "다음 단계를 포함하는 비알코올성 지방간염 진단을 위한 정보를 제공하는 방법:(a) 인체로부터 분리된 혈액 시료 내의 A2M, APCS, APOF 및 IL32로 이루어진 군에서 선택되는 어느 하나 이상의단백질 또는 유전자의 발현 수준을 측정하는 단계; 및(b) 정상 혈액 대조군 시료에 비해 상기 A2M, IL32, 또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 증가되거나, 또는 APCS, APOF, 또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 감소된 경우, 비알코올성지방간염일 가능성이 높다는 정보를 제공하는 단계."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 단백질 수준을 측정하는 단계는 항체, 앱타머, 리간드, PNA(peptide nucleic acid) 및 올리고펩타이드로 이루어진 군으로부터 선택되는 어느 하나 이상의 제제를 이용하여 수행되는 것인, 비알코올성지방간염 진단을 위한 정보를 제공하는 방법.공개특허 10-2024-0120833-3-청구항 8 제6항에 있어서, 상기 유전자의 발현 수준을 측정하는 단계는 프라이머, 프로브 및 안티센스뉴클레오타이드로이루어진 군으로부터 선택되는 어느 하나 이상의 제제를 이용하여 수행되는 것인, 비알코올성 지방간염 진단을위한 정보를 제공하는 방법."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "다음 단계를 포함하는 비알코올성 지방간염 진단을 위한 정보를 제공하는 방법:(a) 인체로부터 분리된 혈액 시료 내의 APCS 및 IL32 단백질 또는 유전자의 발현 수준을 측정하는 단계; 및(b) 상기 APCS 단백질 수준과 상기 IL32 단백질 수준의 비율 또는 상기 APCS 유전자의 발현 수준과 상기 IL32유전자의 발현 수준의 비율을 계산하는 단계."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 (b) 단계의 비율은 상기 APCS 단백질 수준에 대한 상기 IL32 단백질 수준의 비율 또는 상기 APCS 유전자의 발현 수준에 대한 상기 IL32 유전자의 발현 수준의 비율인, 비알코올성 지방간염 진단을 위한정보를 제공하는 방법."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 다음 단계를 더 포함하는 비알코올성 지방간염 진단을 위한 정보를 제공하는 방법:(c) 정상 혈액 대조군 시료에 비해 상기 APCS 단백질 수준에 대한 상기 IL32 단백질 수준의 비율 또는 APCS 유전자의 발현 수준에 대한 상기 IL32 유전자의 발현 수준의 비율이 증가한 경우, 비알코올성 지방간염일 가능성이 높다는 정보를 제공하는 단계."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서, 상기 단백질 수준을 측정하는 단계는 항체, 앱타머, 리간드, PNA(peptide nucleic acid) 및 올리고펩타이드로 이루어진 군으로부터 선택되는 어느 하나 이상의 제제를 이용하여 수행되는 것인, 비알코올성지방간염 진단을 위한 정보를 제공하는 방법."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서, 상기 유전자의 발현 수준을 측정하는 단계는 프라이머, 프로브 및 안티센스뉴클레오타이드로이루어진 군으로부터 선택되는 어느 하나 이상의 제제를 이용하여 수행되는 것인, 비알코올성 지방간염 진단을위한 정보를 제공하는 방법."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "다음 단계를 포함하는 비알코올성 지방간염 치료제의 스크리닝 방법:(a) 혈액 내 A2M, IL32, 또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 증가되어 있거나, APCS, APOF,또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 감소되어 있는 비알코올성 지방간염 동물 모델에 대해의약 후보 물질을 투여하는 단계; (b) 단계 (a) 이후 상기 동물 모델로부터 혈액을 채취하고, 채취된 혈액 내 상기 단백질 또는 mRNA 발현 수준을공개특허 10-2024-0120833-4-측정하는 단계; 및(c) 채취된 혈액 내 A2M, IL32, 또는 이들의 조합의 단백질 또는 유전자 발현 수준이 의약 후보 물질 투여에 의해 유의한 감소를 보이거나, APCS, APOF 또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 의약 후보 물질투여에 의해 유의한 증가를 보이는 경우, 상기 의약 후보 물질을 비알코올성 지방간염 치료제로 판정하는 단계."}
{"patent_id": "10-2023-0013282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "다음 단계를 포함하는 비알코올성 지방간염 치료제의 스크리닝 방법:(a) 혈액 내 APCS 단백질 또는 유전자 발현 수준에 대한 IL32 단백질 또는 유전자 발현 수준의 비율이 증가되어있는 비알코올성 지방간염 동물 모델에 대해 의약 후보 물질을 투여하는 단계; (b) 단계 (a) 이후 상기 동물 모델로부터 혈액을 채취하고, 채취된 혈액 내 APCS 및 IL32 단백질 또는 유전자발현 수준을 측정하는 단계; 및(c) 채취된 혈액 내 상기 APCS 단백질 또는 유전자 발현 수준에 대한 상기 IL32 단백질 또는 유전자 발현 수준의 비율이 의약 후보 물질 투여에 의해 유의한 감소를 보이는 경우, 상기 의약 후보 물질을 비알코올성 지방간염 치료제로 판정하는 단계."}
{"patent_id": "10-2023-0013282", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 A2M, APCS, APOF 및 IL32로 이루어진 군에서 선택되는 어느 하나 이상의 단백질 또는 상기 단백질을 암호화하는 유전자를 검출하는 제제를 포함하는 비알코올성 지방간염 진단용 조성물에 관한 것이다. 본 발명의 비알코올성 지방간염 진단용 조성물 및 상기 조성물을 포함하는 진단 키트를 활용하면 혈액검사를 통해 매우 신 속하고 간편하게 비알코올성 지방간염을 조기에 진단할 수 있다."}
{"patent_id": "10-2023-0013282", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 혈액 내 A2M, APCS, APOF 및 IL32로 이루어진 군에서 선택되는 어느 하나 이상의 단백질 또는 상기 단백질을 암호화하는 유전자 발현 수준 검출을 통한 비알코올성 지방간염 진단용 조성물에 관한 것이다."}
{"patent_id": "10-2023-0013282", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "비알코올성 지방간은 과도한 알코올 섭취 없이 간 세포에 중성지방인 트리글리세라이드가 축적되는 것이 특징이 다. 비알코올성 지방간은 현대인의 고지방 및 고탄수화물 섭취와 관련된 영양 과다에 따라 계속 증가하고 있다. 비만, 당뇨 환자에서 비알코올성 지방간이 흔히 관찰되지만, 다양한 인자가 비알코올성 지방간과 관련된 것으로 알려져 있다. 비알코올성 지방간을 지닌 성인의 80%가 인슐린 저항성 당뇨병 및 심장질환 등 대사이상 질환으로 발전된다고 보고되고 있다. 비알코올성 지방간은 비알코올성 단순 지방간 (non-alcoholic simple steatosis)과 염증을 동반한 비알코올성 지방간염 (non-alcoholic steatohepatitis; NASH)으로 분류되는데, 장기간 방치 시, 간염, 간섬유화, 간경변 등의 심각한 간 질환으로 이행될 수 있다. 비알코올성 지방간은 간 세포 (hepatocyte)에서 지방의 축적 (지방 침윤)을 갖는 것을 특징으로 한다. 비알코올성 단순 지방간은 비알코올성 지방간염으로 진행할 수 있는데, 비알코올성 지방간염에서 지방 축적은 다양한 정도의 간의 염증 및 흉터와 관련되고, 많은 경우에 인슐린 저항성, 이상지질혈증 및 고혈압과 연관된다 고 알려져 있다. 비알코올성 지방간염은 과체중, 높은 콜레스테롤 및 트리글리세라이드 수치, 및/또는 인슐린 저항성을 갖는 사람들에서 종종 발생한다. 하지만, 최근 비만 인구의 증가와 더불어 비알코올성 지방간염 환자가 증가함에도 불구하고, 안전하고 장기 복 용이 가능한 비알코올성 지방간염의 치료제의 개발은 아직 미미한 수준이며, 비알코올성 지방간염의 진단을 위 한 제제나 키트의 개발실정은 만족스럽지 못한 상황이다. 따라서, 만성 질환인 비알코올성 지방간염의 진단에 적합하면서 정확하고 신속한 비알코올성 지방간염의 진단용 조성물 또는 키트의 개발과 비알코올성 지방간염 치 료제 투여 후 예후를 진단할 수 있는 조성물에 대한 요구가 커지고 있는 상황이다. 비알코올성 지방간염을 진단하기 위한 표준 검사법은 비알코올성 지방간질환 환자의 간 조직을 직접 적출하는 간 조직 생검(liver biopsy) 방법이다. 그러나 이 방법은 침습적 방법이므로 사용하기 편리하지 않을 뿐만 아니 라 환자에게 많은 고통을 수반하는 방법이며 반복적으로 시행하기 어렵다는 문제점이 있다. 또한, 전체 간 대비굉장히 작은 부분을 추출하여 진단에 사용하므로, 이에 따른 진단의 표본 획득에 의한 오류(sampling error)가 생길 수 있다. 또한 간병변과 간 섬유화 정도를 판정하는 데 있어 검사자마다 차이와 편향이 있을 수 있다는 문 제점이 있어 비알코올성 지방간염의 진단을 위한 연구개발이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2022-0157790호 (2022.11.29. 공개)"}
{"patent_id": "10-2023-0013282", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명자들은 비알코올성 지방간염의 발병 가능 유무와 조기 진단이 가능하고, 최소 침습적인 방법으로 비알코 올성 지방간염을 간단하게 진단할 수 있는 진단 방법을 규명하기 위하여 예의 노력하였다. 그 결과, 혈액 내 A2M, APCS, APOF 또는 IL32 발현 수준 검출을 통해 비알코올성 지방간염의 조기 진단이 가능함을 규명함으로써, 본 발명을 완성하게 되었다. 따라서, 본 발명의 목적은 비알코올성 지방간염 진단용 조성물을 제공하는 것이다. 본 발명의 다른 목적은 비알코올성 지방간염 진단 키트를 제공하는 것이다. 본 발명의 또 다른 목적은 비알코올성 지방간염 진단을 위한 정보를 제공하는 방법을 제공하는 것이다. 본 발명의 또 다른 목적은 비알코올성 지방간염 치료제 스크리닝 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0013282", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 양태에 따르면, 본 발명은 Alpha-2-Macroglobulin(A2M), Amyloid P Component, Serum(Serum amyloid P, SAP, 펜트락신-2, Pentraxin-2, APCS), Apolipoprotein F(APOF) 및 Interleukin-32(IL32)로 이루 어진 군에서 선택되는 어느 하나 이상의 단백질 또는 상기 단백질을 암호화하는 유전자를 검출하는 제제를 포함 하는 비알코올성 지방간염 진단용 조성물을 제공한다. 본 발명자들은 비알코올성 지방간염의 발병 가능 유무와 조기 진단이 가능하고, 최소 침습적인 방법으로 비알코 올성 지방간염을 간단하게 진단할 수 있는 진단 방법을 규명하기 위하여 예의 연구 노력하였다. 그 결과 혈액 내 A2M, APCS, APOF 및 IL32로 이루어진 군에서 선택되는 어느 하나 이상의 단백질 또는 상기 단백질을 암호화 하는 유전자 검출을 통해 비알코올성 지방간염의 조기 진단이 가능함을 규명하였다. 본 발명의 조성물을 이용하면, 간단한 혈액 검사를 통해 비알코올성 지방간염의 환자군을 구별하여 검출 또는 진단할 수 있고, 나아가, 피험자의 내원 당일의 컨디션이나 검사자의 편향과 무관하게 비알코올성 지방간염을 선별적으로 검출 또는 진단할 수 있다. 본 발명에서 용어, \"진단\"은 특정 질병 또는 질환에 대한 대상(subject)의 감수성(susceptibility)을 판정하는 것 또는 대상이 특정 질병 또는 질환을 현재 가지고 있는지 여부를 판정하는 것을 의미한다. 본 발명의 비알코올성 지방간염 진단용 조성물은 A2M, APCS, APOF 및 IL32로 이루어진 군에서 선택되는 어느 하 나 이상의 단백질 또는 상기 단백질을 암호화하는 유전자를 검출하는 제제를 포함할 수 있다. 본 발명의 A2M, APCS, APOF 및 IL32로 이루어진 군에서 선택되는 어느 하나 이상의 단백질 또는 이를 암호화하 는 유전자는 대상(subject)으로부터 분리된 생물학적 시료, 보다 구체적으로 예를 들면, 혈액, 혈청 또는 혈장 에 존재하는 것일 수 있다. 본 발명의 일 구현예에 있어서, 본 발명에서의 A2M, APCS, APOF 및 IL32로 이루어진 군에서 선택되는 어느 하나 이상의 단백질은 인체로부터 분리된 혈액 시료 내의 단백질을 의미한다.종래 알려진 비알코올성 지방간염의 진단을 위하여 사용하는 방법은 환자의 간 조직을 직접 적출하는 간 조직 생검 방법이다. 상기 조직 생검 방법은 침습적인 방법이므로, 반복적인 검사가 가능한 진단 방법은 없었다. 또 한, 전체 간 대비 조직 생검 부위는 일부로서 굉장히 작은 부위이므로 표본 획득에 의한 오류가 생길 가능성이 있는 한계가 있었다. 이에 반해 본 발명의 일 실시예에 따른 비알코올성 지방간염 진단용 조성물을 이용하는 경우, 대상으로부터 분 리된 혈액, 혈청 또는 혈장에 있어서, A2M, APCS, APOF 및 IL32로 이루어진 군에서 선택되는 어느 하나 이상의 단백질 또는 상기 단백질을 암호화하는 유전자의 발현 수준을 측정함으로써 신속하고 간편하면서도 정확하게 비 알코올성 지방간염을 조기 진단할 수 있다는 장점이 있다. 또한, 본 발명의 일 실시예에 따른 비알코올성 지방 간염 진단용 조성물을 이용하는 경우 비알코올성 단순 지방간과 구별 진단이 용이하다는 장점이 있다. 본 발명의 일 구현예에 있어서, 본 발명의 단백질을 검출하는 제제는 항체, 앱타머, 리간드, PNA(peptide nucleic acid) 및 올리고펩타이드로 이루어진 군으로부터 선택되는 어느 하나 이상이다. 본 발명의 \"단백질을 검출\"이란 비알코올성 지방간염을 진단하기 위하여 생물학적 시료인 혈액에서 본 발명에서 의 비알코올성 지방간염 진단용 마커인 A2M, APCS, APOF 또는 IL32 단백질의 존재 여부와 발현 정도를 확인하는 과정을 의미한다. 상기 단백질의 발현 수준 측정 또는 비교 분석 방법으로는 단백질 칩 분석, 면역측정법, 리간 드 바인딩 어세이, MALDI-TOF(Matrix Assisted Laser Desorption/Ionization Time of Flight Mass Spectrometry) 분석, SELDI-TOF(Sulface Enhanced Laser Desorption/Ionization Time of Flight Mass Spectrometry) 분석, 방사선 면역분석, 방사 면역 확산법, 오우크테로니 면역 확산법, 로케트 면역전기영동, 조 직면역 염색, 보체 고정 분석법, 2차원 전기영동 분석, 액상 크로마토그래피-질량분석(liquid chromatography- Mass Spectrometry, LC-MS), LC-MS/MS(liquid chromatography-Mass Spectrometry/ Mass Spectrometry), 웨스 턴 블랏팅 및 ELISA(enzyme linked immunosorbent assay) 등이 있으나, 이에 제한되는 것은 아니다. 본 발명의 \"항체\"는 항원과 특이적으로 결합하여 항원-항체 반응을 일으키는 물질을 의미한다. 본 발명의 목적 상, 항체는 A2M, APCS, APOF 또는 IL32 단백질에 대해 특이적으로 결합하는 항체를 의미한다. 본 발명의 항체는 다클론 항체, 단클론 항체 및 재조합 항체를 모두 포함한다. 상기 항체는 당업계에 널리 공지된 기술을 이용하 여 용이하게 제조될 수 있다. 예를 들어, 다클론 항체는 상기 A2M, APCS, APOF 또는 IL32 단백질 항원을 동물에 주사하고 동물로부터 채혈하여 항체를 포함하는 혈청을 수득하는 과정을 포함하는 당업계에 널리 공지된 방법에 의해 생산될 수 있다. 이러한 다클론 항체는 염소, 토끼, 양, 원숭이, 말, 돼지, 소, 개 등의 임의의 동물로부 터 제조될 수 있다. 또한, 단클론 항체는 당업계에 널리 공지된 하이브리도마 방법(hybridoma method; Kohler 및 Milstein European Journal of Immunology 6:511-519 참조), 또는 파지 항체 라이브러리 기술 (Clackson et al, Nature, 352:624-628, 1991; Marks et al, J. Mol. Biol., 222:58, 1-597, 1991 참조)을 이 용하여 제조될 수 있다. 상기 방법으로 제조된 항체는 겔 전기영동, 투석, 염 침전, 이온교환 크로마토그래피, 친화성 크로마토그래피 등의 방법을 이용하여 분리, 정제될 수 있다. 또한, 본 발명의 항체는 2개의 전장의 경 쇄 및 2개의 전장의 중쇄를 갖는 완전한 형태뿐만 아니라, 항체 분자의 기능적인 단편을 포함한다. 항체 분자의 기능적인 단편이란, 적어도 항원 결합 기능을 보유하고 있는 단편을 의미하며, Fab, F(ab'), F(ab')2 및 Fv 등 이 있다. 본 발명의 용어 \"앱타머\"는 올리고핵산 또는 펩타이드 분자이며, 앱타머의 일반적인 내용은 문헌[Bock LC et al., Nature 355:5646; Hoppe-Seyler F, Butz K \"Peptide aptamers: powerful new tools for molecular medicine\". J Mol Med. 78:42630; Cohen BA, Colas P, Brent R. \"An artificial cell- cycle inhibitor isolated from a combinatorial library\". ProcNatl Acad Sci USA. 95: 142727]에 상세하게 개시되어 있다. 본 발명의 용어 \"리간드\"는 A2M, APCS, APOF 또는 IL32 단백질에 결합하여 복합체를 형성하고 신호를 발생시킬 수 있는 저분자 물질을 의미한다. 포괄적으로 항체를 포함하는 의미로 해석될 수도 있다. 본 발명의 용어 \"PNA(Peptide Nucleic Acid)\"는 인공적으로 합성된, DNA 또는 RNA와 비슷한 중합체를 가리키며, 1991년 덴마크 코펜하겐 대학교의 Nielsen, Egholm, Berg와 Buchardt 교수에 의해 처음으로 소개되었 다. DNA는 인산-리보스당 골격을 갖는데 반해, PNA는 펩타이드 결합에 의해 연결된 반복된 N-(2-아미노에틸)-글 리신 골격을 가지며, 이로 인해 DNA 또는 RNA에 대한 결합력과 안정성이 크게 증가되어 분자 생물학, 진단 분석 및 안티센스 치료법에 사용되고 있다. PNA는 문헌 [P E Nielsen, M Egholm, R H Berg, O Buchardt, \"Sequence- selective recognition of DNA by strand displacement with a thymine-substituted polyamide\", Science254:1497-500 ]에 상세하게 개시되어 있다. 본 발명의 일 실시예에 있어서, 본 발명의 유전자를 검출하는 제제는 프라이머, 프로브 및 안티센스 뉴클레오타 이드로 이루어진 군으로부터 선택되는 어느 하나 이상이다. 본 발명에 따른 A2M, APCS, APOF 또는 IL32 단백질 의 정보는 알려져 있으므로, 당업자라면 이를 바탕으로 상기 단백질을 암호화하는 유전자의 mRNA에 특이적으로 결합하는 프라이머, 프로브 또는 안티센스 뉴클레오타이드를 용이하게 디자인할 수 있을 것이다. 본 발명의 용어 \"유전자를 검출\"이란 비알코올성 지방간염을 진단하기 위하여 생물학적 시료에서 A2M, APCS, APOF 또는 IL32 단백질을 암호화하는 유전자들의 mRNA 존재 여부와 발현 정도를 확인하는 과정으로 mRNA의 양을 측정하는 것을 의미한다. 이를 위한 분석 방법으로는 역전사 중합효소반응(RT-PCR), 경쟁적 역전사 중합효소반 응(Competitive RT-PCR), 실시간 역전사 중합효소반응(Real-time RT-PCR), RNase 보호 분석법(RPA; RNase protection assay), 노던 블랏팅(Northern blotting), DNA 칩 등이 있으나 이에 제한되는 것은 아니다. 본 발명의 용어 \"프라이머\"는 표적 유전자 서열을 인지하는 단편으로서, 정방향 및 역방향의 프라이머 쌍을 포 함하나, 바람직하게는, 특이성 및 민감성을 가지는 분석 결과를 제공하는 프라이머 쌍이다. 프라이머의 핵산 서 열이 시료 내 존재하는 비-표적 서열과 불일치하는 서열이어서, 상보적인 프라이머 결합 부위를 함유하는 표적 유전자 서열만 증폭하고 비특이적 증폭을 유발하지 않는 프라이머일 때, 높은 특이성이 부여될 수 있다. 본 발명의 용어 \"프로브\"란 시료 내의 검출하고자 하는 표적 물질과 특이적으로 결합할 수 있는 물질을 의미하 며, 상기 결합을 통하여 특이적으로 시료 내의 표적 물질의 존재를 확인할 수 있는 물질을 의미한다. 프로브의 종류는 당업계에서 통상적으로 사용되는 물질이면 특별히 제한되지 않으나, 바람직하게는PNA(peptide nucleic acid), LNA(locked nucleic acid), 펩타이드, 폴리펩타이드, 단백질, RNA 또는 DNA일 수 있다. 보다 구체적으 로, 상기 프로브는 바이오 물질로서 생물에서 유래되거나 이와 유사한 것 또는 생체 외에서 제조된 것을 포함하 는 것으로, 예를 들어, 효소, 단백질, 항체, 미생물, 동식물 세포 및 기관, 신경세포, DNA 및 RNA일 수 있으며, DNA는 cDNA, 게놈 DNA, 올리고뉴클레오타이드를 포함하며, RNA는 게놈 RNA, mRNA, 올리고뉴클레오타이드를 포함 하며, 단백질의 예로는 항체, 항원, 효소, 펩타이드 등을 포함할 수 있다. 본 발명의 용어 \"LNA(Locked nucleic acids)\"는, 2'-O, 4'-C 메틸렌 브릿지를 포함하는 핵산 아날로그를 의미 한다 [J Weiler, J Hunziker and J Hall Gene Therapy 13, 496.502]. LNA 뉴클레오사이드는 DNA와 RNA 의 일반적 핵산 염기를 포함하며, 왓슨-크릭 염기 쌍 규칙에 따라 염기 쌍을 형성할 수 있다. 하지만, 메틸렌 브릿지로 인한 분자의 'locking'으로 인해, LNA는 왓슨-크릭 결합에서 이상적 형상을 형성하지 못하게 된다. LNA가 DNA 또는 RNA 올리고뉴클레오타이드에 포함되면, LNA는 보다 빠르게 상보적 뉴클레오타이드 사슬과 쌍을 이루어 이중 나선의 안정성을 높일 수 있다. 본 발명의 용어 \"안티센스\"는 안티센스 올리고머가 왓슨-크릭 염기 쌍 형성에 의해 RNA 내의 표적 서열과 혼성 화되어, 표적서열 내에서 전형적으로 mRNA와 RNA: 올리고머 헤테로이중체의 형성을 허용하는, 뉴클레오타이드 염기의 서열 및 서브유닛간 백본을 갖는 올리고머를 의미한다. 올리고머는 표적 서열에 대한 정확한 서열 상보 성 또는 근사 상보성을 가질 수 있다. 본 발명의 다른 일 양태에 따르면, 본 발명은 상술한 본 발명의 다른 일 양태에 따른 비알코올성 지방간염 진단 용 조성물을 포함하는 비알코올성 지방간염 진단용 키트를 제공한다. 본 발명의 용어 \"키트\"는 RT-PCR 키트, DNA 칩 키트, ELISA 키트, 단백질 칩 키트, 래피드(rapid) 키트 또는 MRM(Multiple reaction monitoring) 키트일 수 있으나, 이에 제한되는 것은 아니다. 본 발명의 비알코올성 지방간염 진단용 키트는 분석 방법에 적합한 한 종류 또는 그 이상의 다른 구성성분 조성 물, 용액 또는 장치를 더 포함할 수 있다. 예를 들면, 상기 진단용 키트는 역전사 중합효소반응을 수행하기 위 하여 필요한 필수 요소를 더 포함할 수 있다. 역전사 중합효소반응 키트는 마커 단백질을 암호화하는 유전자에 대해 특이적인 프라이머 쌍을 포함한다. 프라이머는 상기 유전자의 핵산서열에 특이적인 서열을 가지는 뉴클레 오타이드로서, 약 7 bp 내지 50 bp의 길이, 보다 바람직하게는 약 10 bp 내지 30 bp의 길이를 가질 수 있다. 또 한 대조군 유전자의 핵산 서열에 특이적인 프라이머를 포함할 수 있다. 그 외 역전사 중합효소반응 키트는 테스 트 튜브 또는 다른 적절한 용기, 반응 완충액(pH 및 마그네슘 농도는 다양), 데옥시뉴클레오타이드(dNTPs), Taq-폴리머라아제 및 역전사효소와 같은 효소, DNase, RNase 억제제 DEPC-수(DEPC-water), 멸균수 등을 포함할 수 있다.또한, 본 발명의 진단용 키트는 DNA 칩을 수행하기 위하여 필요한 필수 요소를 포함할 수 있다. DNA 칩 키트는 유전자 또는 그의 단편에 해당하는 cDNA 또는 올리고뉴클레오타이드(oligonucleotide)가 부착되어 있는 기판, 및 형광표지 프로브를 제작하기 위한 시약, 제제, 효소 등을 포함할 수 있다. 또한 기판은 대조군 유전자 또는 그의 단편에 해당하는 cDNA 또는 올리고뉴클레오타이드를 포함할 수 있다. 또한, 본 발명의 진단용 키트는 ELISA를 수행하기 위하여 필요한 필수요소를 포함할 수 있다. ELISA 키트는 상 기 단백질에 대해 특이적인 항체를 포함한다. 항체는 마커 단백질에 대한 특이성 및 친화성이 높고 다른 단백질 에 대한 교차 반응성이 거의 없는 항체로, 단클론 항체, 다클론 항체 또는 재조합 항체이다. 또한 ELISA 키트는 대조군 단백질에 특이적인 항체를 포함할 수 있다. 그 외 ELISA 키트는 결합된 항체를 검출할 수 있는 시약, 예 를 들면, 표지된 2차 항체, 발색단(chromophores), 효소(예: 항체와 컨주게이트됨) 및 그의 기질 또는 항체와 결합할 수 있는 다른 물질 등을 포함할 수 있다. 본 발명의 \"비알코올성 지방간염 진단용 키트\"는 상술한 본 발명의 다른 일 양태인 \"비알코올성 지방간염 진단 용 조성물\"을 포함하는 바, 중복되는 내용을 원용하며, 본 명세서 기재의 과도한 복잡성을 피하기 위하여 중복 기재를 생략하도록 한다. 본 발명의 다른 일 양태에 따르면, 본 발명은 다음 단계를 포함하는 비알코올성 지방간염 진단을 위한 정보를 제공하는 방법을 제공한다: (a) 인체로부터 분리된 혈액 시료 내의 A2M, APCS, APOF 및 IL32로 이루어진 군에서 선택되는 어느 하나 이상의 단백질 또는 유전자의 발현 수준을 측정하는 단계; 및 (b) 정상 혈액 대조군 시료에 비해 상기 A2M, IL32, 또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 증 가되거나, 또는 APCS, APOF, 또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 감소된 경우, 비알코올성 지방간염일 가능성이 높다는 정보를 제공하는 단계. 본 발명의 일 구현예에 있어서, 본 발명의 단백질 수준을 측정하는 단계는 항체, 앱타머, 리간드, PNA(peptide nucleic acid) 및 올리고펩타이드로 이루어진 군으로부터 선택되는 어느 하나 이상의 제제를 이용하여 수행된다. 구체적으로 예를 들면, 본 발명의 A2M, APCS, APOF 또는 IL32 단백질에 특이적으로 결합하는 항체를 이용하여 진단 대상 혈액 시료 및 정상 혈액 대조군 시료의 A2M, APCS, APOF 또는 IL32 단백질 발현을 측정 및 비교할 수 있다. 상기 항체와 생물학적 시료 내의 A2M, APCS, APOF 또는 IL32 단백질이 항원-항체 복합체를 형 성하도록 하고, 이를 검출하는 방법을 이용한다. 본 발명의 용어 \"항원-항체 복합체\"는 생물학적 시료 중의 해당 유전자의 존재 또는 부존재를 확인하기 위한 단 백질 항원과 이를 인지하는 항체의 결합물을 의미한다. 상기 항원-항체 복합체의 검출은 당업계에 공지된 방법, 예를 들어 분광학적, 광화학적, 생물화학적, 면역화학적, 전기적, 흡광적, 화학적 방법 및 기타 다양한 방법을 이용하여 검출할 수 있다. 본 발명의 일 구현예에 있어서, 본 발명의 유전자의 발현 수준을 측정하는 단계는 프라이머, 프로브 및 안티센 스 뉴클레오타이드로 이루어진 군으로부터 선택되는 어느 하나 이상의 제제를 이용하여 수행된다. 구체적으로 예를 들면, 본 발명의 A2M, APCS, APOF 또는 IL32 단백질을 암호화하는 유전자의 발현 수준의 측정 또는 비교는 역전사효소 중합효소반응, 경쟁적 역전사효소 중합효소반응, 실시간 역전사효소 중합효소반응, RNase 보호 분석 법, 노던 블랏팅 또는 DNA 칩 등을 사용할 수 있으나, 이에 제한되는 것은 아니다. 상기 측정방법들을 통하여 정상 대조군에서의 mRNA 발현량과 질환 발병 여부를 진단하고자 하는 개체의 mRNA 발현량을 확인할 수 있고, 이 들 발현량 정도를 비교함으로써 비알코올성 지방간염의 발병 여부를 진단 또는 예측할 수 있다. 본 발명의 \"비알코올성 지방간염 진단을 위한 정보를 제공하는 방법\"은 상술한 본 발명의 다른 일 양태인 비알 코올성 지방간염 진단용 조성물을 이용하여 실시하는 진단 방법에 관한 것인 바, 중복되는 내용을 원용하며, 본 명세서 기재의 과도한 복잡성을 피하기 위하여 중복 기재를 생략하도록 한다. 본 발명의 다른 일 양태에 따르면, 본 발명은 다음 단계를 포함하는 비알코올성 지방간염 진단을 위한 정보를 제공하는 방법을 제공한다:(a) 인체로부터 분리된 혈액 시료 내의 APCS 및 IL32 단백질 또는 유전자의 발현 수준을 측정하는 단계; 및 (b) 상기 APCS 단백질 수준과 상기 IL32 단백질 수준의 비율 또는 상기 APCS 유전자의 발현 수준과 상기 IL32 유전자의 발현 수준의 비율을 계산하는 단계. 본 발명의 비알코올성 지방간염 진단을 위한 정보를 제공하는 방법은 상술한 본 발명의 다른 일 양태인 비알코 올성 지방간염 진단용 조성물 또는 비알코올성 지방간염 진단용 키트를 이용하여 실시하는 진단 방법에 관한 것 인 바, 중복되는 내용을 원용하며, 본 명세서 기재의 과도한 복잡성을 피하기 위하여 중복 기재를 생략하도록 한다. 본 발명의 일 구현예에 있어서, 본 발명의 (b) 단계의 비율은 상기 APCS 단백질 수준에 대한 상기 IL32 단백질 수준의 비율 또는 상기 APCS 유전자의 발현 수준에 대한 상기 IL32 유전자의 발현 수준의 비율이다. 본 발명의 일 구현예에 있어서, 본 발명의 비알코올성 지방간염 진단을 위한 정보를 제공하는 방법은 다음 단계 를 더 포함한다: (c) 정상 혈액 대조군 시료에 비해 상기 APCS 단백질 수준에 대한 상기 IL32 단백질 수준의 비율 또는 APCS 유 전자의 발현 수준에 대한 상기 IL32 유전자의 발현 수준의 비율이 증가한 경우, 비알코올성 지방간염일 가능성 이 높다는 정보를 제공하는 단계. 본 발명에서 상기 APCS 단백질 수준에 대한 상기 IL32 단백질 수준의 비율 또는 APCS 유전자의 발현 수준에 대 한 상기 IL32 유전자의 발현 수준의 비율이 구체적으로, 5.31배 이상으로 계산되는 경우, 비알코올성 지방간염 으로 진단할 수 있다. 본 발명의 일 구현예에 있어서, 본 발명의 단백질 수준을 측정하는 단계는 항체, 앱타머, 리간드, PNA(peptide nucleic acid) 및 올리고펩타이드로 이루어진 군으로부터 선택되는 어느 하나 이상의 제제를 이용하여 수행된다. 본 발명의 일 구현예에 있어서, 본 발명의 유전자의 발현 수준을 측정하는 단계는 프라이머, 프로브 및 안티센 스 뉴클레오타이드로 이루어진 군으로부터 선택되는 어느 하나 이상의 제제를 이용하여 수행된다. 본 발명의 다른 일 양태에 따르면, 본 발명은 다음 단계를 포함하는 비알코올성 지방간염 치료제의 스크리닝 방 법을 제공한다: (a) 혈액 내 A2M, IL32, 또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 증가되어 있거나, APCS, APOF, 또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 감소되어 있는 비알코올성 지방간염 동물 모델에 대해 의약 후보 물질을 투여하는 단계; (b) 단계 (a) 이후 상기 동물 모델로부터 혈액을 채취하고, 채취된 혈액 내 상기 단백질 또는 mRNA 발현 수준을 측정하는 단계; 및 (c) 채취된 혈액 내 A2M, IL32, 또는 이들의 조합의 단백질 또는 유전자 발현 수준이 의약 후보 물질 투여에 의 해 유의한 감소를 보이거나, APCS, APOF 또는 이들의 조합의 단백질 또는 유전자의 발현 수준이 의약 후보 물질 투여에 의해 유의한 증가를 보이는 경우, 상기 의약 후보 물질을 비알코올성 지방간염 치료제로 판정하는 단계. 본 발명의 단계 (a)의 투여는 경구 또는 비경구로 투여 가능하며, 의약 후보 물질의 특성에 따라, 당업자가 적 합한 투여 경로를 선택할 수 있다. 본 발명의 다른 일 양태에 따르면, 본 발명은 다음 단계를 포함하는 비알코올성 지방간염 치료제의 스크리닝 방 법을 제공한다: (a) 혈액 내 APCS 단백질 또는 유전자 발현 수준에 대한 IL32 단백질 또는 유전자 발현 수준의 비율이 증가되어 있는 비알코올성 지방간염 동물 모델에 대해 의약 후보 물질을 투여하는 단계; (b) 단계 (a) 이후 상기 동물 모델로부터 혈액을 채취하고, 채취된 혈액 내 APCS 및 IL32 단백질 또는 유전자 발현 수준을 측정하는 단계; 및 (c) 채취된 혈액 내 상기 APCS 단백질 또는 유전자 발현 수준에 대한 상기 IL32 단백질 또는 유전자 발현 수준 의 비율이 의약 후보 물질 투여에 의해 유의한 감소를 보이는 경우, 상기 의약 후보 물질을 비알코올성 지방간 염 치료제로 판정하는 단계."}
{"patent_id": "10-2023-0013282", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 특징 및 이점을 요약하면 다음과 같다: (a) 본 발명은 비알코올성 지방간염 진단용 조성물을 제공한다. (b) 본 발명은 비알코올성 지방간염 진단용 키트를 제공한다. (c) 본 발명의 비알코올성 지방간염 진단을 위한 정보제공 방법을 제공한다. (d) 본 발명은 비알코올성 지방간염 치료제 스크리닝 방법을 제공한다. (e) 본 발명의 비알코올성 지방간염 진단용 조성물 및 진단 키트를 활용하면 혈액검사를 통해 매우 신속하고 간 편하게 비알코올성 지방간염을 조기 진단할 수 있다."}
{"patent_id": "10-2023-0013282", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예를 통하여 본 발명을 더욱 상세히 설명하고자 한다. 이들 실시예는 오로지 본 발명을 보다 구체적 으로 설명하기 위한 것으로, 본 발명의 요지에 따라 본 발명의 범위가 이들 실시예에 의해 제한되지 않는다는 것은 당업계에서 통상의 지식을 가진 자에 있어서 자명할 것이다. 실시예 실시예 1: 분석 흐름도 도 1에 나타낸 바와 같이, NCBI GEO database에서 제공하는 비알코올성 지방간질환 환자 데이터셋 GSE135251(비 알코올성 단순지방간 환자 51명; 비알코올성 지방간염 환자 155명)을 이용하여 초기 분석을 진행하였다. GSE135251 데이터는 RNA 시퀀싱 데이터로 human reference genome sequence(GRCh38)로의 맵핑(mapping)/얼라인 먼트(alignment) 과정과 발현량 산정 과정(expression abundance estimating)을 거쳐 raw read count 데이터를 얻을 수 있었으며, STAR aligner와 RSEM estimator를 사용하여 유전체 데이터셋을 획득하였다. 해당 유전체 데이터셋은 logarithmic transformed TMM value(log2(TMM+1))로서 정규화(normalization)하였다. 정규화된 데이터셋에서 Human Protein Atlas database를 통해 헤파토카인으로서 분류된 166개의 헤파토카인을 추려내었다. 인공지능 기반 진단 모델의 구축을 위하여 166개의 헤파토카인들의 발현 정보 데이터셋을 70:30, 75:25, 80:20 등의 비율로 모델의 학습을 위한 훈련 데이터셋(training dataset), 모델의 성능 평가를 위한 시 험 데이터셋(test dataset)으로 분할하였다. 모델의 학습과 평가에는 k-fold cross-validation을 기반한 random forest algorithm이 사용되었다. 이상의 방법을 활용하여 최적의 분류 모델을 찾기 위하여, 순차적 피쳐 선택(sequential feature selection)을 진행하여 166개 이하의 다양한 수의 헤파토카인을 이용하여 비알코올성 지방간염을 진단하는 인공지능 모델을 구축하였다. 모델의 성능이 AUROC(진단정확도) > 0.8, 단순정확도 > 0.8, kappa 계수 > 0.4, F1 스코어 > 0.5 인 우수한 성 능의 분류 모델이 공통적으로 이용하는, 비알코올성 단순지방간과 비알코올성 지방간염 환자들 사이에서 발현의 차이가 나는 것으로 확인된 22개의 헤파토카인을 발견하였다. 22개의 헤파토카인 발현 데이터셋에 대해 이상의 인공지능 분류 모델 구축 방법론을 다시 적용하여, A2M, APCS, APOF 및 IL32를 이용하는 우수한 성능의 모델을 발견하였다. GSE135251과 독립적인 비알코올성 지방간질환 데이터셋 GSE167523에서 모델의 우수한 성능을 재확 인하였다(external validation). 또한, GTEx database(Genotype-Tissue expression database) 간 조직 유전자 발현/조직 염색 데이터셋과 비알코올성 지방간염 환자의 혈액에서 수행된 ELISA 실험을 사용하여 실제 A2M, APCS, APOF 및 IL32의 네 가지 헤파토카인이 비알코올성 지방간염의 유무에 따라 비알코올성 지방간질환 환자에 서 다른 발현 양상을 보이는 것을 확인하였다. 실시예 2: 비알코올성 지방간염과 비알코올성 단순지방간에서의 간 유래 분비단백질 (hepatokine) 발현 비교 비알코올성 지방간염을 진단하는 인공지능 모델 구축을 위하여 GSE135251 데이터셋에서 진단 바이오마커로서 사 용될 가능성이 있는 22개의 헤파토카인(A2M, AMBP, ANG, ANGPTL8, APCS, APOF, APOM, AZGP1, CD14, CETP, DNASE1L13, FCN2, HPR, IGFALS, IL32, ITIH1, LCAT, LEAP2, MASP2, PCSK9, PON1, SERPINA5)을 추려 내었다. 비알코올성 단순지방간과 비알코올성 지방간염 환자들 사이의 헤파토카인의 발현 차이의 통계적 유의미성은 Wilcoxon's rank sum test를 이용하여 분석하였다. 그 결과를 도 2에 나타내었다. 도 2에 나타낸 바와 같이, 상기 GSE135251 데이터셋에서 A2M 및 IL32의 발현은 비알코올성 지방간질환 환자 중 단순지방간 환자 대비 지방간염 환자에서 증가한 반면, APCS 및 APOF의 발현은 감소한 것으로 확인되었다. 상술한 22개의 헤파토카인을 이용한 random forest algorithm 기반 비알코올성 지방간염 분류 모델을 구축하였 고, AUROC, 단순정확도, kappa 계수, F1 스코어, 민감도(sensitivity), 특이도(specificity), 양성예측도, 음 성예측도 등의 평가 지표를 이용하여 모델의 성능을 평가하였다. 평가한 결과는 아래 표 1에 나타내었다. 평가 결과가 우수한 네 가지 모델 중, A2M, APCS, APOF 및 IL32를 이용한 분류 모델은 민감도(sensitivity)를 제외 한 모든 지표를 이용한 평가에서 가장 우수한 것으로 평가되었다. 최종 분류 모델의 성능은 0.81의 AUROC, 0.80 의 단순정확도, 0.47의 kappa 계수, 0.60의 F1 스코어, 0.87의 민감도(sensitivity), 0.60의 특이도 (specificity), 0.87의 양성예측도, 0.60의 음성예측도를 확보하여, 견고한 모델로 평가되었다. 표 1 GSE135251 비알코올성 지방간질환 데이터에서의 비알코올성 지방간염과 비알코올성 단순지방간을 구분하는 최 종 분류 모델과 경쟁 모델의 분류 성능 확인최종 모델 (A2M, APCS, APOF 및 IL32)경쟁 모델 1경쟁 모델 2 경쟁 모델 3 AUROC 0.81 0.79 0.79 0.79 accuracy0.80 0.79 0.77 0.77 kappa 0.47 0.35 0.35 0.41 F1 score0.60 0.48 0.50 0.56 sensitivity 0.87 0.91 0.87 0.83 specificity0.60 0.40 0.47 0.60 PPV 0.87 0.82 0.83 0.86 NPV 0.60 0.60 0.54 0.53 실시예 3: 비알코올성 지방간질환 중증도와 간 섬유화 정도에 따른 A2M, APCS, APOF 및 IL32 발현 비교 GSE135251 비알코올성 지방간질환 데이터에서의 지방간질환 중증도와 간 섬유화 정도에 따른 A2M, APCS, APOF 및 IL32의 발현량을 비교하였다. 결과는 도 3에 나타내었다. 도 3에 나타낸 바와 같이, A2M 및 IL32는 비알코올성 지방간질환의 중증도 점수(NAFLD Activity Score)그리고 간 섬유화 점수(Fibrosis Score)와 양의 상관관계가 있는 반면, APCS 및 APOF는 중증도 점수와 간 섬유화 점수 와 음의 상관관계가 있어, 네 가지 헤파토카인이 비알코올성 지방간염의 발병 및 진행에 연관되어 있을 가능성 을 확인하였다. 실시예 4: 비알코올성 지방간질환 데이터에서 나타나는 비알코올성 지방간염과 비알코올성 단순지방간에서의 A2M, APCS, APOF 및 IL32 발현 비교 A2M, APCS, APOF 및 IL32를 활용하여 비알코올성 단순지방간과 비알코올성 지방간염을 구분하는 최종 분류 모델 의 유효성 평가를 위하여, NCBI GEO database 로부터 비알코올성 지방간질환 환자 98명의 전사체 데이터셋 (GSE167523)으로부터 네 가지 헤파토카인의 발현 정보를 확보하였다. GSE167523 비알코올성 지방간질환 데이터 에서 나타나는 비알코올성 지방간염과 비알코올성 단순지방간에서 A2M, APCS, APOF 및 IL32의 발현을 비교하였 다. 결과는 도 4에 나타내었다. 도 4에 나타낸 바와 같이, GSE135251 데이터셋에서와 같이, GSE167523 데이터셋에서도 A2M 및 IL32의 발현은 비 알코올성 지방간질환 환자 중 단순지방간 환자 대비 지방간염 환자에서 증가한 반면, APCS, APOF의 발현은 감소 한 것으로 확인되었다. 아래의 표 2에 나타낸 바와 같이, GSE167523 데이터셋에서 A2M, APCS, APOF 및 IL32의 네 가지 헤파토카인을 이 용하여 비알코올성 단순지방간과 비알코올성 지방간염을 구분한 성능은 0.79의 단순정확도, 0.58의 kappa 계수, 0.76의 F1 스코어를 확보하였고, 특정 임상 전사체 데이터에서만 적용되는 것이 아님을 확인하였다. 표 2 GSE167523 비알코올성 지방간질환 데이터에서의 비알코올성 지방간염과 비알코올성 단순 지방증을 구분하는 최 종 분류 모델과 경쟁 모델의 분류 성능 확인 최종 모델 (A2M, APCS, APOF 및 IL32)경쟁 모델 1경쟁 모델 2 경쟁 모델 3 단순정확도0.79 0.79 0.77 0.71 kappa 계수0.58 0.58 0.53 0.43F1 스코어 0.76 0.76 0.78 0.71 실시예 5: GTEx 데이터에서 나타나는 비알코올성 지방간염과 비알코올성 단순지방간에서의 A2M, APCS, APOF 및 IL32 발현 비교 A2M, APCS, APOF 및 IL32를 이용하는 최종 분류 모델의 추가적 검증을 위하여 사람 기관에서의 유전자 발현량과 그 기관의 조직학적 관찰 데이터를 포함하는 GTEx database를 확보하였다. 검증을 위하여, 간 조직의 염색 데이 터로부터 연구의 목적이나 방향성을 알지 못하는 훈련된 진단의학과 전문가가 이상의 데이터셋에서 비알코올성 단순지방간 환자와 비알코올성 지방간염 환자를 선행 진단하였다. 결과를 도 5에 나타내었다. 도 5에 나타낸 바와 같이, GTEx 데이터셋에서도 비알코올성 단순지방간 소견을 보이는 환자들에 비해 비알코올 성 지방간염 소견을 보이는 환자들에게서 더 낮은 APCS 및 APOF 발현, 그리고 더 높은 IL32 발현이 확인되었다. 실시예 6: GTEx 데이터셋에서 A2M, APCS, APOF 및 IL32 발현량을 기반으로 비알코올성 지방간염을 동반할 것으 로 예측된 개인의 간 조직 염색 결과 평균 발현량 대비 A2M 및 IL32의 발현이 높고, APCS 및 APOF의 발현이 낮은 환자를 비알코올성 지방간염 소견을 보일 것으로 예측하고, 간 조직 염색 미미지를 분석하였다. 그 결과, 도 6에 나타난 바와 같이, 비알코올성 지방간염 소견을 보일 것으로 예측된 환자의 간 조직 염색 데이 터에서 실제 비알코올성 지방간염의 소견이 나타나는 것으로 확인되었다. 실시예 7: 비알코올성 단순지방간과 비알코올성 지방간염 환자 혈액 샘플에서 A2M, APCS, APOF 및 IL32의 혈중 농도 비교 ELISA 실험을 통해 비알코올성 단순지방간 환자 혈액 샘플과 비알코올성 지방간염 환자 혈액 샘플에서 A2M, APCS, APOF 및 IL32의 혈중 농도를 측정하였고, 앞선 분석과 마찬가지로 Shapiro-Wilk test를 이용해 정규성 여 부를 먼저 계산하였다. 결과는 도 7에 나타내었다. 도 7에 나타낸 바와 같이, A2M, APCS, APOF 및 IL32 각각 p-value 0.020, 0.11, 4.32e-11, 0.027로 APCS를 제외 한 3개의 헤파토카인에서 정규성을 만족하지 못함을 확인하였다. Wilcoxon rank sum test를 이용해 두 그룹 간 의 4개의 헤파토카인의 혈중 농도 차이를 확인했는데, p-value 1.5e-08, 1.5e-08, 2e-06, 1.5e-08로 두 그룹 간 농 도 차이가 유의미한 것으로 확인되었다. 실시예 8: 혈액 내 A2M. APCS, APOF 및 IL32의 농도를 이용해 비알코올성 단순지방간 환자와 비알코올성 지방간 염 환자를 구분할 수 있는 능력의 정도 측정 A2M. APCS, APOF 및 IL32의 네 가지 헤파토카인의 혈중 농도를 가지고 비알코올성 단순지방간 환자 그룹과 비알 코올성 지방간염 그룹을 구분할 수 있는지 평가하기 위하여, ROC curve로 분석을 진행하였다. 그 결과를 도 8에 나타내었다. 도 8에 나타낸 바와 같이, A2M, APCS, APOF 및 IL32, 4개의 헤파토카인의 AUROC는 각각 0.771, 0.955, 0.811, 0.929, 민감도(sensitivity)는 92.6%, 88.9%, 74.1%, 88.9%, 특이도(specificity)는 51.9%, 96.3%, 77.8%, 81.5%, 양성예측도는 65.8%, 96.0%, 76.9%, 82.8%, 음성예측도는 87.5%, 89.7%, 75.0%, 88.0% 로 확인되었다. 실시예 9: A2M, APCS, APOF 및 IL32의 4개의 헤파토카인의 조합의 농도 계산값으로 구한 AUROC, 단순정확도, kappa 계수, F1 스코어 4개의 헤파토카인과 그들 간의 조합으로 파생된 다양한 스코어를 가지고 비알코올성 단순지방간 그룹과 비알코 올성 지방간염 그룹을 구분할 수 있는지 평가하기 위하여 ROC curve와 각각의 optimal value를 통해 구한 예측 값으로 정확도와 kappa 계수, F1 스코어를 구하였다. 결과는 도 9 및 하기 표 3에 나타내었다. 도 9에 나타낸 바와 같이, IL32/APCS와 APCS/IL32 조합의 경우 가장 높은 AUROC , 단순정확도, kappa 계 수, F1 스코어를 나타냈다. 표 3 네 가지 헤파토카인과 그들 간의 조합으로 파생된 16개의 스코어를 가지고 계산한 AUROC와 단순정확도, kappa 계수, F1 스코어 헤파토카인과 그 조합 AUROC 단순정확도 kappa 계수 F1 스코어 A2M 0.770919 0.722222 0.444444 0.769231 APCS 0.954733 0.925926 0.851852 0.923077 APOF 0.8107 0.759259 0.518519 0.754717 IL32 0.928669 0.851852 0.703704 0.857143 A2M*IL32 0.931413 0.907407 0.814815 0.912281 A2M/APCS 0.960219 0.907407 0.814815 0.909091 A2M/APOF 0.865569 0.814815 0.62963 0.833333 IL32/APCS 1 1 1 1 IL32/APOF 0.956104 0.925926 0.851852 0.925926 APCS*APOF 0.960219 0.907407 0.814815 0.90566 APCS/A2M 0.960219 0.907407 0.814815 0.909091 APCS/IL32 1 1 1 1 APOF/A2M 0.865569 0.814815 0.62963 0.833333 APOF/IL32 0.956104 0.907407 0.814815 0.909091 A2M*IL32/APCS 0.99177 0.962963 0.925926 0.912281 A2M*IL32/APOF 0.951989 0.925926 0.851852 0.912281 APCS*APOF/A2M 0.983539 0.981481 0.962963 0.90566 APCS*APOF/IL32 0.998628 0.981481 0.962963 0.90566 A2M*IL32/APCS*APOF 0.99177 0.962963 0.925926 0.912281 APCS*APOF/A2M*IL32 0.99177 0.962963 0.925926 0.90566 실시예 10: 비알코올성 단순지방간 환자와 비알코올성 지방간염 환자의 혈중 IL32 농도와 APCS 농도로 계산한 IL32/APCS의 농도 계산값 비교 및 비알코올성 지방간염 진단을 위한 혈중 IL32/APCS 농도 계산값 평가 ELISA를 이용하여 비알코올성 지방간염 환자와 비알코올성 단순지방간 환자의 혈중 헤파토카인, A2M, APCS, APOF 및 IL32의 농도를 구해 두 그룹 간 비교하였다. 4개의 헤파토카인과 그 조합 중에서 혈중 농도를 통해 가 장 높은 정확도를 보이는 스코어를 분석하였고, 그 결과 IL32/APCS의 값이 가장 높은 정확도를 나타내는 것으로 확인되었다. 실제로 IL32/APCS의 혈중 농도 계산값이 비알코올성 단순지방간 그룹과 비알코올성 지방간염 그룹 간 어떻게 차 이나는지 확인하기 위하여, 해당 데이터의 정규성을 평가하였고, p-value = 0.001167로 나와 정규성을 만족시키 지 못하는 것으로 확인하였다. Wilcoxon rank sum test를 이용해 두 그룹 간 혈중 농도 차이를 확인하였는데, p-value = 1.03e-15로 유의미한 혈중 농도 차가 있는 것으로 확인되었다. 또한, IL32/APCS의 혈중 농도 계산값으로 비알코올성 단순지방간 샘플 과 비알코올성 지방간염 샘플을 구별할 수 있는지 확인하기 위하여 ROC curve를 계산하였다. 그 결과는 도 10(우)에 나타낸 바와 같이, 민감도(sensitivity), 특이도(specificity), 양성예측도(Positive predictive Value), 음성예측도 (Negative predictive Value) 모두 100%, AUROC는 1로 확인되었으며, 두 그룹 을 구분할 수 있는 최적의 농도 계산값은 5.31배로 확인되었다."}
{"patent_id": "10-2023-0013282", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 분석 흐름도를 나타낸다. 도 2는 비알코올성 지방간질환 데이터(GSE135251)에서 나타나는 비알코올성 지방간염과 비알코올성 단순지방간 에서의 간 유래 분비단백질(hepatokine)의 발현을 비교한 결과이다. 도 3은 비알코올성 지방간질환 데이터(GSE135251)에서의 지방간질환 중증도와 간 섬유화 정도에 따른 A2M, APCS, APOF 및 IL32의 발현량을 비교한 결과이다. 도 4는 비알코올성 지방간질환 데이터(GSE167523)에서 비알코올성 지방간염과 비알코올성 단순지방간에서의 A2M, APCS, APOF 및 IL32 발현을 비교한 결과이다. 도 5는 GTEx 데이터에서 나타나는 비알코올성 지방간염과 비알코올성 단순지방간에서의 A2M, APCS, APOF 및 IL32의 발현을 비교한 결과이다. 도 6은 GTEx 데이터에서 A2M, APCS, APOF 및 IL32 발현량을 기반으로 비알코올성 지방간염을 동반할 것으로 예 측된 개인의 간 조직 염색 결과이다. 도 7은 비알코올성 단순지방간과 비알코올성 지방간염 환자 혈액 샘플에서 A2M, APCS, APOF 및 IL32의 혈중 농 도를 비교한 결과이다. 도 8은 혈액 내 A2M. APCS, APOF 및 IL32의 농도로 비알코올성 단순지방간 환자와 비알코올성 지방간염 환자의 구분 정도를 측정하기 위하여, ROC curve로 분석을 진행한 결과이다. 도 9는 A2M, APCS, APOF 및 IL32의 조합의 농도 계산값으로 구한 AUROC, 단순정확도, kappa 계수, F1 스코어를 나타낸다. 도 10은 비알코올성 단순지방간 환자와 비알코올성 지방간염 환자의 혈중 IL32 농도와 APCS 농도로 계산한 IL32/APCS의 농도 계산값 수준 비교(좌, 중) 및 ROC curve를 이용한 비알코올성 지방간염 진단을 위한 혈중 IL32/APCS 농도 계산값 평가(우) 결과이다."}
