{"patent_id": "10-2020-0145658", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0060572", "출원번호": "10-2020-0145658", "발명의 명칭": "비휘발성 메모리 장치, 그것을 제어하는 제어기, 그것을 갖는 저장 장치, 및 그것의 리드 방", "출원인": "삼성전자주식회사", "발명자": "김진영"}}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비휘발성 메모리 장치의 리드 방법에 있어서,제어기로부터 워드라인에 대응하는 제 1 페이지 데이터를 읽기 위한 제 1 리드 커맨드를 수신하는 단계;상기 제 1 리드 커맨드에 응답하여 제 1 페이지 OVS(On-chip Valley Search) 동작을 수행하는 단계;상기 제어기에 상기 제 1 페이지 OVS 동작에 따른 상기 제 1 페이지 데이터를 출력하는 단계; 상기 제어기로부터 특수 커맨드를 수신하는 단계; 상기 제어기에 상기 특수 커맨드에 응답하여 상기 제 1 페이지 OVS 동작의 적어도 2개의 상태들에 대한 검출 케이스들을 지시하는 검출 정보를 출력하는 단계;상기 제어기로부터 상기 워드라인에 대응하는 제 2 페이지 데이터를 읽기 위한 제 2 리드 커맨드를 수신하는 단계; 상기 제 2 리드 커맨드에 응답하여 제 2 페이지 리드 동작을 수행하는 단계; 및상기 제어기에 상기 제 2 페이지 리드 동작에 따른 상기 제 2 페이지 데이터를 출력하는 단계를 포함하고,상기 검출 정보를 이용하여 상기 적어도 2개의 상태들과 다른 적어도 하나의 상태의 리드 레벨이 변경되고,상기 제 2 페이지 리드 동작은 상기 변경된 리드 레벨을 기준으로 수행되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제 1 페이지 OVS 동작은,어느 하나의 상태에 대응하는 산포골을 찾기 위한 복수의 디벨럽 타임들을 이용한 OVS 센싱 동작과 상기 OVS 센싱 동작에서 찾은 상기 산포골에 대응하는 검출 케이스를 이용한 메인 센싱 동작을 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 제 1 리드 커맨드와 상기 제 2 리드 커맨드는 서로 다르고,상기 워드라인에 연결된 메모리 셀들을 포함하고,상기 메모리 셀들의 각각은 3-비트 메모리 셀인 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제 1 페이지 OVS 동작은, MSB(Most Significant Bit) 페이지를 읽기 위한 리드 동작이고,상기 제 2 페이지 리드 동작은, 상기 MSB 페이지, CSB(Central Significant Bit) 페이지, 혹은 LSB(LeastSignificant Bit) 페이지를 읽기 위한 리드 동작인 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 제 1 페이지 OVS 동작은 제 1 리드 레벨(R3)을 기준으로 한 제 1 OVS 리드 동작과 제 2 리드 레벨(R7)을공개특허 10-2022-0060572-3-기준으로 한 제 2 OVS 리드 동작을 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3 항에 있어서,상기 제 1 페이지 OVS 동작은, 제 1 상태를 판별하기 위한 제 1 OVS 리드 동작과, 제 2 상태를 판별하기 위한제 2 OVS 리드 동작을 포함하고,상기 제 1 OVS 리드 동작의 제 1 검출 케이스와 제 2 OVS 리드 동작의 제 2 검출 케이스에 따라 열화 방향성이결정되고,상기 결정된 열화 방향성 및 열화 정도에 따라 적어도 하나의 나머지 상태를 판별하기 위한 리드 레벨의 변경여부가 결정되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 제 1 OVS 리드 동작의 제 1 검출 케이스와 상기 제 2 OVS 리드 동작의 제 2 검출 케이스가 동일할 때,상기 제 2 OVS 리드 동작의 제 3 상태를 판별하기 위한 리드 레벨은 OVS 테이블을 이용하여 동일한 검출 케이스에 대응하는 값으로 변경되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 제 1 OVS 리드 동작의 제 1 검출 케이스와 상기 제 2 OVS 리드 동작의 제 2 검출 케이스가 동일하지 않고,상기 제 1 검출 케이스와 상기 제 2 검출 케이스가 동일한 열화 방향성을 지시할 때,상기 제 2 OVS 리드 동작의 제 3 상태를 판별하기 위한 리드 레벨은 OVS 테이블을 이용하여 상기 제 1 검출 케이스 및 상기 제 2 검출 케이스 중에서 적게 열화된 검출 케이스에 따라 변경되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서,상기 제 1 OVS 리드 동작의 제 1 검출 케이스와 상기 제 2 OVS 리드 동작의 제 2 검출 케이스가 동일하지 않고,상기 제 1 검출 케이스와 상기 제 2 검출 케이스가 서로 다른 열화 방향성을 지시할 때,상기 제 2 OVS 리드 동작의 제 3 상태를 판별하기 위한 리드 레벨은 변경되지 않는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 제 2 페이지 데이터가 에러 정정 불가일 때, 상기 제어기로부터 제 3 리드 커맨드를 수신하는 단계; 및상기 제 3 리드 커맨드에 응답하여 사전에 결정된 테이블을 이용하여 리드 리트라이를 수행하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "비트라인들의 각각과 공통 소스 라인 사이에 적어도 2개의 스트링들을 포함하고, 상기 적어도 2개의 스트링들의각각은 상기 비트라인들의 어느 하나와 상기 공통 소스 라인 사이에 직렬 연결된 적어도 하나의 스트링 선택 트랜지스터, 복수의 메모리 셀들, 및 적어도 하나의 접지 트랜지스터를 포함하고, 상기 적어도 하나의 스트링 선택 트랜지스터는 스트링 선택 라인에 연결된 게이트를 갖고, 상기 복수의 메모리 셀들의 각각은 대응하는 워드라인으로부터 워드라인 전압을 제공 받고, 상기 적어도 하나의 접지 트랜지스터는 접지 선택 라인에 연결된 게이트를 갖는 복수의 메모리 블록들; 및리드 동작시 어드레스에 응답하여 상기 복수의 메모리 블록들 중에서 선택된 어느 하나의 블록의 어느 하나의워드라인에 연결된 메모리 셀들에 대하여 제 1 리드 커맨드에 응답하여 제 1 페이지 OVS(On-chip Valley공개특허 10-2022-0060572-4-Search) 동작을 수행하고, 상기 제 1 페이지 OVS 동작의 검출 정보를 이용하여 적어도 하나의 상태의 리드 레벨을 변경하고, 상기 변경된 리드 레벨을 이용하여 상기 메모리 셀들에 대하여 제 2 리드 커맨드에 응답하여 제 2페이지 리드 동작을 수행하는 제어 로직을 포함하는 비휘발성 메모리 장치."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 제 1 페이지 OVS 동작은, 제 1 상태에 대한 제 1 OVS 리드 동작과 제 2 상태에 대한 제 2 OVS 리드 동작을포함하고,상기 검출 정보는 상기 제 1 OVS 리드 동작의 제 1 검출 케이스를 지시하는 정보와 상기 제 2 OVS 리드 동작의제 2 검출 케이스를 지시하는 정보를 포함하고,상기 제 1 검출 케이스 및 상기 제 2 검출 케이스에 따라 상기 제 2 페이지 리드 동작의 리드 레벨을 변경하는것을 특징으로 하는 비휘발성 메모리 장치."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 제 1 및 제 2 검출 케이스들의 각각은 대응하는 리드 레벨을 기준으로 5개 혹은 7개의 옵셋 레벨들을 지시하는 것을 특징으로 하는 비휘발성 메모리 장치."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12 항에 있어서,상기 제어 로직은 상기 제 1 페이지 OVS 동작을 수행하는 OVS 회로를 더 포함하고,상기 제 1 페이지 OVS 동작의 상기 검출 정보가 동일한 열화 방향성을 지시할 때, 상기 OVS 회로는 상기 제 1상태 및 상기 제 2 상태를 제외한 나머지 상태들에 대한 리드 레벨들을 변경하는 것을 특징으로 하는 비휘발성메모리 장치."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 제 1 페이지 OVS 동작의 상기 검출 정보가 서로 다른 열화 방향성을 지시할 때, 상기 OVS 회로는 상기 제1 상태 및 상기 제 2 상태에 대한 리드 레벨들을 변경하는 것을 특징으로 하는 비휘발성 메모리 장치."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "적어도 하나의 비휘발성 메모리 장치에 제어 신호들을 제공하는 제어 핀들;제 1 테이블, 제 2 테이블, 및 제 3 테이블을 저장하는 버퍼 메모리;제 1 리드 커맨드에 따라 상기 적어도 하나의 비휘발성 메모리 장치로부터 읽혀진 제 1 페이지 데이터의 에러를정정하거나, 제 2 리드 커맨드에 따라 상기 적어도 하나의 비휘발성 메모리 장치로부터 읽혀진 제 2 페이지 데이터의 에러를 정정하는 에러 정정 회로; 및상기 적어도 하나의 비휘발성 메모리 장치의 리드 동작의 리드 레벨을 관리하는 리드 레벨 보상 유닛을 구동하는 프로세서를 포함하고,상기 제 1 테이블은 환경 정보를 근거로 한 사전에 결정된 제 1 옵셋을 포함하고,상기 제 2 테이블은 OVS(On-chip Valley Search) 동작에서 스테이트 별 검출 케이스에 따른 제 2 옵셋을 포함하고,상기 제 3 테이블은 상기 제 1 옵셋 혹은 제 2 옵셋을 이용하여 생성된 제 3 옵셋을 포함하고,상기 리드 레벨 보상 유닛은, 상기 제 1 리드 커맨드에 따른 제 1 페이지 OVS 동작의 검출 정보와 상기 제 2 테이블을 이용하여 상기 제 2 리드 커맨드에 따른 제 2 페이지 리드 동작에서 사용될 적어도 하나의 리드 레벨의공개특허 10-2022-0060572-5-상기 제 3 옵셋을 업데이트 하는 것을 특징으로 하는 제어기."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 검출 정보를 수신하기 위하여 특수 커맨드는 상기 적어도 하나의 비휘발성 메모리 장치로 전송되고,상기 적어도 하나의 비휘발성 메모리 장치로부터 상기 제 1 페이지 OVS 동작의 상기 검출 정보가 수신되는 것을특징으로 하는 제어기."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 16 항에 있어서,상기 검출 정보는 적어도 2개의 상태들에 대한 검출 케이스들을 지시하는 정보를 포함하고,상기 리드 레벨 보상 유닛은 상기 검출 정보를 이용하여 열화 방향성 혹은 열화 정도를 판별하는 것을 특징으로하는 제어기."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 검출 케이스들의 열화 방향성이 동일할 때, 상기 리드 레벨 보상 유닛은 상기 제 1 테이블 혹은 상기 제 2테이블을 이용하여 모든 상태들에 대한 상기 제 3 테이블의 옵셋들을 업데이트 하는 것을 특징으로 하는제어기."}
{"patent_id": "10-2020-0145658", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,상기 검출 케이스들의 열화 방향성이 동일하지 않을 때, 상기 리드 레벨 보상 유닛은 상기 제 1 테이블 혹은 상기 제 2 테이블을 이용하여 상기 적어도 2개의 상태들에 대한 상기 제 3 테이블의 옵셋들을 업데이트하는 것을특징으로 하는 제어기."}
{"patent_id": "10-2020-0145658", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 비휘발성 메모리 장치는, 복수의 메모리 블록들, 및 리드 동작시 어드레스에 응답하여 상기 복수 의 메모리 블록들 중에서 선택된 어느 하나의 블록의 어느 하나의 워드라인에 연결된 메모리 셀들에 대하여 제 1 리드 커맨드에 응답하여 제 1 페이지 OVS(On-chip Valley Search) 동작을 수행하고, 상기 제 1 페이지 OVS 동작 의 검출 정보를 이용하여 적어도 하나의 상태의 리드 레벨을 변경하고, 상기 변경된 리드 레벨을 이용하여 상기 메모리 셀들에 대하여 제 2 리드 커맨드에 응답하여 제 2 페이지 리드 동작을 수행하는 제어 로직을 포함할 수 있다."}
{"patent_id": "10-2020-0145658", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 비휘발성 메모리 장치, 그것을 제어하는 제어기, 및 그것을 갖는 저장 장치, 및 그것의 리드 방법에 관한 것이다."}
{"patent_id": "10-2020-0145658", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 쓰기 동작에서 저장 장치는 ECC(error correction code) 회로를 이용하여 오류 정정 코드를 생성하 고, 리드 동작에서 저장 장치는 오류 정정 코드를 참조하여 데이터의 오류를 정정하고 있다. 하지만, 저장 장치 의 메모리 셀들의 열화에 정도가 심하여 ECC 회로로 정정이 불가한 경우도 있다. 이러한 경우, 노멀 리드 동작 과 다른 센싱 기법을 이용한 리드 리트라이(read retry) 동작이 수행되고 있다."}
{"patent_id": "10-2020-0145658", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 수명 방어코드의 진입을 줄이는 비휘발성 메모리 장치, 그것을 제어하는 제어기, 그것을 갖는 저장 장치 및 그것의 리드 방법을 제공하는데 있다."}
{"patent_id": "10-2020-0145658", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 비휘발성 메모리 장치의 리드 방법은, 제어기로부터 워드라인에 대응하는 제 1 페이 지 데이터를 읽기 위한 제 1 리드 커맨드를 수신하는 단계; 상기 제 1 리드 커맨드에 응답하여 제 1 페이지 OVS(On-chip Valley Search) 동작을 수행하는 단계; 상기 제어기에 상기 제 1 페이지 OVS 동작에 따른 상기 제 1 페이지 데이터를 출력하는 단계; 상기 제어기로부터 특수 커맨드를 수신하는 단계; 상기 제어기에 상기 특수 커맨드에 응답하여 상기 제 1 페이지 OVS 동작의 적어도 2개의 상태들에 대한 검출 케이스들을 지시하는 검출 정보를 출력하는 단계; 상기 제어기로부터 상기 워드라인에 대응하는 제 2 페이지 데이터를 읽기 위한 제 2 리 드 커맨드를 수신하는 단계; 상기 제 2 리드 커맨드에 응답하여 제 2 페이지 리드 동작을 수행하는 단계; 및 상 기 제어기에 상기 제 2 페이지 리드 동작에 따른 상기 제 2 페이지 데이터를 출력하는 단계를 포함하고, 상기 검출 정보를 이용하여 상기 적어도 2개의 상태들과 다른 적어도 하나의 상태의 리드 레벨이 변경되고, 상기 제 2 페이지 리드 동작은 상기 변경된 리드 레벨을 기준으로 수행될 수 있다. 본 발명의 실시 예에 따른 비휘발성 메모리 장치는, 비트라인들의 각각과 공통 소스 라인 사이에 적어도 2개의 스트링들을 포함하고, 상기 적어도 2개의 스트링들의 각각은 상기 비트라인들의 어느 하나와 상기 공통 소스 라 인 사이에 직렬 연결된 적어도 하나의 스트링 선택 트랜지스터, 복수의 메모리 셀들, 및 적어도 하나의 접지 트 랜지스터를 포함하고, 상기 적어도 하나의 스트링 선택 트랜지스터는 스트링 선택 라인에 연결된 게이트를 갖고, 상기 복수의 메모리 셀들의 각각은 대응하는 워드라인으로부터 워드라인 전압을 제공 받고, 상기 적어도 하나의 접지 트랜지스터는 접지 선택 라인에 연결된 게이트를 갖는 복수의 메모리 블록들; 및 리드 동작시 어드 레스에 응답하여 상기 복수의 메모리 블록들 중에서 선택된 어느 하나의 블록의 어느 하나의 워드라인에 연결된 메모리 셀들에 대하여 제 1 리드 커맨드에 응답하여 제 1 페이지 OVS(On-chip Valley Search) 동작을 수행하고, 상기 제 1 페이지 OVS 동작의 검출 정보를 이용하여 적어도 하나의 상태의 리드 레벨을 변경하고, 상기 변경된 리드 레벨을 이용하여 상기 메모리 셀들에 대하여 제 2 리드 커맨드에 응답하여 제 2 페이지 리드 동작을 수행 하는 제어 로직을 포함할 수 있다. 본 발명의 실시 예에 따른 제어기는, 적어도 하나의 비휘발성 메모리 장치에 제어 신호들을 제공하는 제어 핀들; 제 1 테이블, 제 2 테이블, 및 제 3 테이블을 저장하는 버퍼 메모리; 제 1 리드 커맨드에 따라 상기 적어 도 하나의 비휘발성 메모리 장치로부터 읽혀진 제 1 페이지 데이터의 에러를 정정하거나, 제 2 리드 커맨드에 따라 상기 적어도 하나의 비휘발성 메모리 장치로부터 읽혀진 제 2 페이지 데이터의 에러를 정정하는 에러 정정 회로; 및 상기 적어도 하나의 비휘발성 메모리 장치의 리드 동작의 리드 레벨을 관리하는 리드 레벨 보상 유닛 을 구동하는 프로세서를 포함하고, 상기 제 1 테이블은 환경 정보를 근거로 한 사전에 결정된 제 1 옵셋을 포함 하고, 상기 제 2 테이블은 OVS(On-chip Valley Search) 동작에서 스테이트 별 검출 케이스에 따른 제 2 옵셋을 포함하고, 상기 제 3 테이블은 상기 제 1 옵셋 혹은 제 2 옵셋을 이용하여 생성된 제 3 옵셋을 포함하고, 상기 리드 레벨 보상 유닛은, 상기 제 1 리드 커맨드에 따른 제 1 페이지 OVS 동작의 검출 정보와 상기 제 2 테이블 을 이용하여 상기 제 2 리드 커맨드에 따른 제 2 페이지 리드 동작에서 사용될 적어도 하나의 리드 레벨의 상기 제 3 옵셋을 업데이트 하는 것을 특징으로 한다. 본 발명의 실시 예에 따른 저장 장치는, 적어도 하나의 비휘발성 메모리 장치; 및 상기 적어도 하나의 비휘발성 메모리 장치에 CLE(command latch enable) 신호, ALE(address latch enable) 신호, CE(chip enable) 신호, WE(write enable) 신호, RE(read enable) 신호, DQS 신호를 제공하는 제어 핀들로 연결되고, 상기 적어도 하나 의 비휘발성 메모리로부터 데이터를 읽도록 구현된 제어기를 포함하고, 상기 적어도 하나의 비휘발성 메모리 장 치는, 상기 CLE 신호 및 상기 ALE 신호에 따라 상기 WE 신호의 엣지에서 리드 커맨드를 래치함으로써 제 1 페이 지 OVS(On-chip Valley Search) 동작 혹은 제 2 페이지 리드 동작을 수행하고, 상기 제어기는, 특수 커맨드에 응답하여 상기 제 1 페이지 OVS 동작에 따른 검출 정보를 상기 적어도 하나의 비휘발성 메모리 장치로부터 수신 하고, 상기 검출 정보를 이용하여 상기 제 2 페이지 리드 동작의 적어도 하나의 리드 레벨을 변경하는 것을 특 징으로 한다. 본 발명의 다른 실시 예에 따른 비휘발성 메모리 장치는, 제 1 메탈 패드를 갖는 메모리 셀 영역; 및 제 2 메탈 패드를 갖고, 상기 제 1 메탈 패드와 상기 제 2 메탈 패드를 통하여 수직으로 연결되는 페리 회로 영역을 포함 하고, 상기 메모리 셀 영역에서, 복수의 워드라인들과 복수의 비트라인들에 연결된 복수의 메모리 셀들을 갖는 복수의 메모리 블록들을 포함하는 메모리 셀 어레이; 상기 페리 회로 영역에서, 상기 복수의 워드라인들 중에서 어느 하나를 선택하는 로우 디코더; 상기 페리 회로 영역에서, 상기 복수의 비트라인들에 연결되는 복수의 페이 지 버퍼들을 갖는 페이지 버퍼 회로; 및 상기 페리 회로 영역에서, 제어 핀들을 통하여 CLE(command latch enable) 신호, ALE(address latch enable) 신호, CE(chip enable) 신호, WE(write enable) 신호, RE(read enable) 신호, DQS 신호를 수신하고, 상기 CLE 신호 및 상기 ALE 신호에 따라 상기 WE 신호의 엣지에서 커맨드 혹은 어드레스를 래치함으로써 제 1 페이지 OVS(On-chip Valley Search) 동작 혹은 제 2 페이지 리드 동작을 수행하는 제어 로직을 포함하고, 상기 제 2 페이지 리드 동작은, 상기 제 1 페이지 OVS 동작의 검출 정보를 이용 하여 변경된 리드 레벨을 이용하여 수행되는 것을 특징으로 한다."}
{"patent_id": "10-2020-0145658", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따른 비휘발성 메모리 장치, 그것을 제어하는 제어기, 그것을 갖는 저장 장치, 및 그것의 리드 방법은, 제 1 페이지 OVS 동작의 검출 정보를 이용하여 제 2 페이지 리드 동작열화 정보를 옵셋에 반영하 고, 사전에 반영한 옵셋을 이용하여 제 2 페이지 리드 동작을 수행함으로써, 에러 정정 불가의 가능성을 줄이고, 그만큼 신뢰성을 향상시킬 수 있다. 본 발명의 실시 예에 따른 비휘발성 메모리 장치, 그것을 제어하는 제어기, 그것을 갖는 저장 장치, 및 그것의 리드 방법은, 제 1 페이지 OVS 동작의 검출 정보를 이용하여 제 2 페이지 리드 동작을 수행함으로써, 수명 방어 코드 진입을 줄임으로써 시스템적으로 성능 향상을 기대할 수 있다."}
{"patent_id": "10-2020-0145658", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 도면들을 이용하여 본 발명의 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시 할 수 있을 정"}
{"patent_id": "10-2020-0145658", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "도로 본 발명의 내용을 명확하고 상세하게 기재할 것이다. 적어도 하나의 원인(retention, disturbance, temperature, noise, etc)에 의해 프로그램 된 메모리 셀의 문턱 전압 산포가 변형된다. 이렇게 변형된 문턱전압 산포(distribution)는 리드 동작에서 오류(즉, 에러 정정 불 가)를 야기한다. 방어코드(Recovery Code)는 리드 동작에서 읽혀진 데이터의 오류를 복구하는 방식을 의미한다. 일반적으로, 방어코드는 변형된 문턱전압 산포골(Distribution Valley)을 찾는 과정을 포함할 수 있다. 온-칩 밸리 서치(On-chip Valley Search; 이하, 'OVS') 동작은 이러한 산포골을 찾는데 유리하다. OVS 동작에 대한 자세한 것은, 본 발명의 참고문헌으로 결합된 US 2020-00286545, US 2020-0098436, US 10,090,046, US 10,559,362, US 10,607,708, US 10,629,259에서 설명될 것이다. 일반적으로 OVS 방어코드에서 동일 워드라인에 연결된 페이지들의 각각은, 유사한 방향으로 열화 될 높은 가능 성을 갖는다. 본 발명의 실시 예에 따른 비휘발성 메모리 장치, 그것을 제어하는 제어기, 그것을 갖는 저장 장 치 및 그것의 리드 방법은, 각 상태(state)에 에러가 발생할 때마다 OVS 테이블을 검색해서 HRT(History Read Level Table) 업데이트 하지 않고, 제 1 페이지(예를 들어, 최상위 비트 페이지 혹은 최하위 비트 페이지) 리드 에서 찾은 방향성을 동일 워드라인에 연결된 나머지 페이지의 다른 상태 골(valley) 정정에 미리 반영함으로써, 에러 발생 확률을 줄일 수 있다. 도 1은 본 발명의 실시 예에 따른 저장 장치를 예시적으로 보여주는 도면이다. 도 1을 참조하면, 저장 장치 는 적어도 하나의 비휘발성 메모리 장치(NVM(s), 100) 및 제어기(CNTL, 200)를 포함할 수 있다. 적어도 하나의 비휘발성 메모리 장치는 데이터를 저장하도록 구현될 수 있다. 비휘발성 메모리 장치 는 낸드 플래시 메모리(NAND flash memory), 수직형 낸드 플래시 메모리, 노아 플래시 메모리(NOR flash memory), 저항성 램(resistive random access memory; RRAM), 상변화 메모리(phase-change memory; PRAM), 자 기저항 메모리(magnetoresistive random access memory; MRAM), 강유전체 메모리(ferroelectric random access memory; FRAM), 스핀주입 자화반전 메모리(spin transfer torque random access memory; STT-RAM) 등이 될 수 있다. 또한, 비휘발성 메모리 장치는 3차원 어레이 구조(three-dimensional array structure)로 구현될 수 있다. 본 발명은 전하 저장층이 전도성 부유 게이트로 구성된 플래시 메모리 장치는 물론, 전하 저장층이 절 연막으로 구성된 차지 트랩형 플래시(charge trap flash; CTF)에도 모두 적용 가능하다. 아래에서는 설명의 편 의를 위하여 비휘발성 메모리 장치가 수직형 낸드 플래시 메모리 장치(VNAND)라고 하겠다. 또한, 비휘발성 메모리 장치는 복수의 메모리 블록들(BLK1 ~ BLKz, z는 2 이상의 정수) 및 제어 로직(15 0)을 포함하도록 구현될 수 있다. 복수의 메모리 블록들(BLK1 ~ BLKz)의 각각은, 복수의 페이지들(Page 1 ~ Page m, m은 2 이상의 정수)를 포함할 수 있다. 복수의 페이지들(Page 1 ~ Page m)의 각각은, 복수의 메모리 셀들을 포함할 수 있다. 복수의 메모리 셀들의 각각은 적어도 하나의 비트를 저장할 수 있다. 제어 로직은 제어기(CNTL; 200)로부터 커맨드 및 어드레스를 수신하고, 수신된 커맨드에 대응하는 동작(프 로그램 동작, 리드 동작, 이레이즈 동작 등)을 어드레스에 대응하는 메모리 셀들에 수행하도록 구현될 수 있다. 또한, 제어 로직은 OVS 회로를 포함할 수 있다. OVS 회로는 OVS(On-chip Valley Search; 'OVS') 동작을 수행하도록 구현될 수 있다. 일반적으로, OVS 동작은, 검출 케이스들(detection cases)에 대응하 는 다양한 디벨럽 시간들(development times)에 따른 셀 카운트(cell count)를 획득하는 동작, 획득된 셀 카운 트 기반으로 OVS 검출 케이스를 판별하는 동작과, 판별된 OVS 검출 케이스에 따라 실제 디벨럽 시간을 변경하여 센싱하는 메인 센싱 동작을 포함할 수 있다. OVS 회로는 OVS 동작의 결과에 대응하는 검출 정보(OVSDI, 검 출 케이스 정보)를 저장하도록 구현될 수 있다. 이러한 검출 정보(OVSDI)는 상태에 대응하는 최적의 산포골을 지시하는 정보(예를 들어, 디벨럽 시간 정보)를 포함할 수 있다. 제어기(CNTL; 200)는 제어 신호들(예를 들어, CLE, ALE, CE(s), WE, RE, 등)을 전송하는 복수의 제어 핀들을 통하여 적어도 하나의 비휘발성 메모리 장치에 연결될 수 있다. 또한, 제어 신호들(CLE, ALE, CE(s), WE, RE 등)을 이용하여 비휘발성 메모리 장치를 제어하도록 구현될 수 있다. 예를 들어, 비휘발성 메모리 장치 는 CLE(command latch enable) 신호 및 ALE(address latch enable) 신호에 따라 WE(write enable) 신호의 엣지에서 커맨드(CMD) 혹은 어드레스(ADD)를 래치 함으로써, 프로그램 동작/리드 동작/이레이즈 동작을 수행할 수 있다. 또한, 제어기는 적어도 하나의 프로세서(CPU(Central Processing Unit)(s); 210), 버퍼 메모리 및 에러 정정 회로를 포함할 수 있다. 프로세서는 저장 장치의 전반적인 동작을 제어하도록 구현될 수 있다. CPU는 캐시/버퍼 관리, 펌 웨어 관리, 가비지 컬렉션 관리, 웨어 레벨링 관리, 데이터 중복 제거 관리, 리드 리프레쉬/리클레임 관리, 배 드 블록 관리, 멀티-스트림 관리, 호스트 데이터와 비휘발성 메모리의 맵핑 관리, QoS(quality of service) 관 리, 시스템 리소스 할당 관리, 비휘발성 메모리 큐(queue) 관리, 리드 레벨 관리, 소거/프로그램 관리, 핫/콜드 데이터 관리, 전력 손실 보호 관리, 동적 열관리, 초기화 관리, RAID(redundant array of inexpensive disk) 관리 등과 같은 다양한 관리 동작들을 수행할 수 있다. 특히, 프로세서는 리드 레벨을 관리하는 리드 레벨 보상 유닛을 구동할 수 있다. 실시 예에 있어서, 리드 레벨 보상 유닛은 OVS 동작을 수행한 결과에 대응하는 검출 정보(옵셋 정보; OVSDI)를 히스토리 리드 레벨에 반영할 수 있다. 예를 들어, 리드 레벨 보상 유닛은 OVST(OVS Table)을 이용하여 검출 정보(OVSD I)에 대응하는 옵셋을 HRT(History Read Level Table)에 반영할 수 있다. 실시 예에 있어서, 리드 레벨 보상 유닛은, 적어도 2개의 상태들에 대한 제 1 OVS 동작의 검출 정보(OVSDI)를 나머지 상태들 중에서 적어도 하나에 대한 히스토리 리드 레벨 옵셋을 결정하는 데 이용할 수 있다. 실시 예에 있어서, 리드 레벨 보상 유닛은 펌웨어/소프트웨어적으로 구현될 수 있다. 한편, 도 1에 도시된 리드 레벨 보상 유닛은 제어기의 내부에서 수행되고 있다. 하지만, 본 발명이 여기에 제한되지 않을 것이다. 리드 레벨 보상 유닛은 비휘발성 메모리 장치의 내부에서 수행될 수도 있다. 버퍼 메모리는 휘발성 메모리(예를 들어, SRAM(Static Random Access Memory), DRAM(Dynamic RAM), SDRAM(Synchronous RAM) 등) 혹은 비휘발성 메모리 (플래시 메모리, PRAM(Phase-change RAM), MRAM(Magneto- resistive RAM), ReRAM(Resistive RAM), FRAM(Ferro-electric RAM) 등)로 구현될 수 있다. 버퍼 메모리는 적어도 하나의 PDT(Pre Defined Table), OVST(OVS Table), HRT(History Read Level Table)을 포함할 수 있다. PDT은 제 1 리드 레벨 옵셋 정보를 포함할 수 있다. 실시 예에 있어서, PDT은 프로그램 경과 시간에 대응하는 제 1 리드 레벨 옵셋 정보를 포함할 수 있다. 실시 예에 있어서, PDT은 프로그램 경과 시간 외에 다양한 열화 정보(온도, 프로그램/소거 사이클, 리드 사이클, 오픈 워드라인 케이스, 워드라인 위치 정보 등)에 대응하는 제 1 리드 레벨 옵셋 정보를 포함할 수 있다. OVST는 검출 정보(OVSDI)에 대응하는 제 2 리드 레벨 옵셋 정보를 포함할 수 있다. 여기서 검출 정보(OVSDI)는 최적의 산포골에 대응하는 디벨럽 시간 정보일 수 있다. 즉, 제 2 리드 레벨 옵셋 정보는 OVS 동작을 수행한 디 벨럽 시간 정보에 대응하는 리드 레벨 옵셋 정보를 포함할 수 있다. 따라서, OVST은 검출 정보(OVSDI)를 리드 레벨 옵셋 정보를 변환시킨 테이블일 수 있다. HRT은 히스토리 리드 동작에 관련된 제 3 리드 레벨 옵셋 정보를 포함할 수 있다. 실시 예에 있어서, 제 3 리드 레벨 옵셋 정보는 제 2 리드 레벨 옵셋 정보를 누적한 정보를 포함할 수 있다. 다른 실시 예에 있어서, 제 3 리 드 레벨 옵셋 정보는 제 1 리드 레벨 옵셋 정보와 제 2 리드 레벨 옵셋 정보를 이용하여 결정될 수 있다. 여기 서 제 3 리드 레벨 옵셋 정보는 히스토리 리드 동작을 수행하는 최적의 리드 레벨(optimal read level)를 포함 할 수 있다. 한편, 히스토리 리드 동작에 대한 자세한 것은, 본 발명의 참고문헌으로 결합된 US 10,120,589, 및 US 10,373,693에서 설명될 것이다.ECC 회로는 프로그램 동작 시 에러 정정 코드(error correction code)를 생성하고, 리드 동작 시 에러 정 정 코드를 이용하여 데이터의 복구하도록 구현될 수 있다. 즉, ECC 회로는 비휘발성 메모리 장치로부 터 수신된 데이터(DATA)의 페일 비트(fail bit) 혹은 에러 비트(error bit)를 정정하기 위한 에러 정정 코드 (error correction code; ECC)를 생성할 수 있다. ECC 회로는 비휘발성 메모리 장치로 제공되는 데 이터의 에러 정정 인코딩을 수행함으로써, 패리티(parity) 비트가 부가된 데이터를 형성할 수 있다. 패리티 비 트는 비휘발성 메모리 장치에 저장될 수 있다. 또한, ECC 회로는 비휘발성 메모리 장치로부터 출력된 데이터에 대하여 에러 정정 디코딩을 수행할 수 있다. ECC 회로는 패리티를 사용하여 에러를 정정 할 수 있다. ECC 회로는 LDPC(low density parity check) code, BCH code, turbo code, 리드-솔로몬 코드 (Reed-Solomon code), convolution code, RSC(recursive systematic code), TCM(trellis-coded modulation), BCM(block coded modulation) 등의 코디드 모듈레이션(coded modulation)을 사용하여 에러를 정정할 수 있다. 한편, 에러 정정 회로에서 에러 정정이 불가능할 때, 리드 리트라이(read retry) 동작이 수행될 수 있다. 실시 예에 있어서, 리드 리트라이 동작은 OVS 동작을 포함할 수 있다. 다른 실시 예에 있어서, 리드 리트라이 동작은 PDT을 반영한 OVS 동작을 포함할 수 있다. 본 발명의 실시 예에 따른 저장 장치는, UECC(uncorrectable error correction code) 발생 전에 OVS 동작 을 수행하지 않고, UECC 발생 후에만 OVS 동작을 활성화시킬 수 있다. 또한, 본 발명의 실시 예에 따른 저장 장 치는 제 1 페이지 OVS 동작의 적어도 하나의 상태에 대한 검출 정보(OVSDI)를 제 2 페이지 리드 동작에 대 응하는 적어도 다른 하나의 상태에 대한 옵셋으로 HRT(History Read Level Table)에 사전에 반영함으로써, 에러 발생 확률을 줄일 수 있다. 여기서 제 1 페이지 OVS 동작 및 제 2 페이지 리드 동작은 동일 워드라인에 연결된 페이지(메모리 셀들)에서 수행될 수 있다. 즉, 본 발명의 저장 장치는 OVS 방어코드에서 처음 OVS 동작으로 어느 하나의 상태에 대한 열화 정보를 파악하고, 파악된 열화 정보를 이용하여 다른 적어도 하나의 상태에 대한 다음 리드 동작에서 이용함으로써, 에러 정정율을 높일 수 있다. 또한, 본 발명의 실시 예에 따른 저장 장치는 현재 OVS 동작에서 찾은 방향성으로 동일 페이지 내 다른 산 포골 정정에도 미리 반영함으로써, 미리 반영된 히스토리 리드 레벨로 인하여 UECC 발생 확률 및 진입률을 줄일 수 있다. 도 2는 도 1에 도시된 비휘발성 메모리 장치를 예시적으로 보여주는 도면이다. 도 2를 참조하면, 비휘발성 메모리 장치는 메모리 셀 어레이, 로우 디코더, 페이지 버퍼 회로, 입출력 버퍼 회로 , 제어 로직, 전압 발생기, 및 셀 카운터를 포함할 수 있다. 메모리 셀 어레이는 워드라인들(WLs) 혹은 선택 라인들(SSL, GSL)을 통해 로우 디코더에 연결될 수 있다. 메모리 셀 어레이는 비트라인들(BLs)을 통해서 페이지 버퍼 회로에 연결될 수 있다. 메모리 셀 어레이는 복수의 셀 스트링들(cell strings)을 포함할 수 있다. 셀 스트링들의 각각의 채널은 수직 혹은 수평 방향으로 형성될 수 있다. 셀 스트링들의 각각은 복수의 메모리 셀들을 포함할 수 있다. 여기서, 복수의 메모리 셀들은 비트라인(BLs)이나, 워드라인(WLs)으로 제공되는 전압에 의해서 프로그램 되거나, 소거 되거나, 읽혀질 수 있다. 일반적으로, 프로그램 동작은 페이지 단위로 수행되고, 이레이즈 동작은 블록단위로 수행되고 있다. 메모리 셀에 대한 자세한 것은, 미국 등록 특허 US 7,679,133, US 8,553,466, US 8,654,587, US 8,559,235, 및 US 9,536,970에 설명될 것이다. 실시 예에 있어서, 메모리 셀 어레이는 2차원 메모리 셀 어 레이를 포함할 수 있고, 2차원 메모리 셀 어레이는 행 방향 및 열 방향을 따라 배치된 복수의 낸드 스트링들을 포함할 수 있다. 로우 디코더는 어드레스(ADD)에 응답하여 메모리 셀 어레이의 메모리 블록들(BLK1 ~ BLKz) 중 어느 하나를 선택하도록 구현될 수 있다. 로우 디코더는 어드레스(ADD)에 응답하여 선택된 메모리 블록의 워드 라인들 중 어느 하나를 선택할 수 있다. 로우 디코더는 선택된 메모리 블록의 워드라인에 동작 모드에 대 응하는 워드라인 전압(VWL)을 전달할 수 있다. 프로그램 동작 시 로우 디코더는 선택 워드라인에 프로그램 전압과 검증 전압을 인가하고, 비선택 워드라인에 패스 전압을 인가할 수 있다. 리드 동작 시 로우 디코더(12 0)는 선택 워드라인에 리드 전압을 인가하고, 비선택 워드라인에 리드 패스 전압을 인가할 수 있다. 페이지 버퍼 회로는 쓰기 드라이버로 혹은 감지 증폭기로 동작하도록 구현될 수 있다. 프로그램 동작에서, 페이지 버퍼 회로는 메모리 셀 어레이의 비트라인들로 프로그램 될 데이터에 대응하는 비트라인 전압 을 인가할 수 있다. 리드 동작 혹은 검증 리드 동작에서, 페이지 버퍼 회로는 선택된 메모리 셀에 저장된 데이터를 비트라인(BL)을 통해서 감지할 수 있다. 페이지 버퍼 회로에 포함되는 복수의 페이지 버퍼들(PB1~ PBn, n은 2 이상의 정수)의 각각은 적어도 하나의 비트라인에 연결될 수 있다. 복수의 페이지 버퍼들(PB1 ~ PBn)의 각각은, OVS 동작을 수행하기 위한 센싱 및 래치를 수행하도록 구현될 수 있다. 즉, 복수의 페이지 버퍼들(PB1 ~ PBn)의 각각은 제어 로직의 제어에 따라 선택된 메모리 셀들에 저 장된 어느 하나의 상태를 식별하기 위해 복수의 센싱 동작을 수행할 수 있다. 또한, 복수의 페이지 버퍼들(PB1 ~ PBn)의 각각은 복수의 센싱 동작을 통해서 센싱된 데이터를 각각 저장한 후에, 제어 로직의 제어 아래에 서 어느 하나의 데이터를 선택할 수 있다. 즉, 복수의 페이지 버퍼들(PB1 ~ PBn) 각각은 어느 하나의 상태를 식 별하기 위하여 복수회의 센싱을 수행할 수 있다. 또한, 복수의 페이지 버퍼들(PB1 ~ PBn)의 각각은 제어 로직 의 제어에 따라 센싱된 복수의 데이터 중에서 최적의 데이터를 선택 혹은 출력할 수 있다. 입출력 버퍼 회로는 외부에서 제공되는 데이터를 페이지 버퍼 회로로 제공한다. 입출력 버퍼 회로 는 외부에서 제공되는 커맨드(CMD)는 제어 로직에 제공할 수 있다. 입출력 버퍼 회로는 외부에 서 제공된 어드레스(ADD)를 제어 로직이나 로우 디코더에 제공할 수 있다. 더불어, 입출력 버퍼 회로 는 페이지 버퍼 회로에 의해서 센싱 및 래치된 데이터를 외부로 출력할 수 있다. 제어 로직은 외부로부터 전달되는 커맨드(CMD)에 응답하여 로우 디코더 및 페이지 버퍼 회로를 제어하도록 구현될 수 있다. 또한, 제어 로직은 OVS 동작을 수행하기 위하여 OVS 회로를 포함할 수 있다. OVS 회로는 OVS 동작을 위해 페이지 버퍼 회로와 전압 발생기를 제어할 수 있다. OVS 회로(15 5)는 선택된 메모리 셀들의 특정 상태를 식별하기 위해 복수의 센싱 동작을 수행하도록 페이지 버퍼 회로 를 제어할 수 있다. 또한, OVS 회로는 복수의 센싱 결과들의 각각에 대응하는 센싱 데이터를 복수의 페이 지 버퍼들(PB1 ~ PBn) 각각에 구비된 복수의 래치 세트에 저장하도록 복수의 페이지 버퍼들(PB1 ~ PBn)을 제어 할 수 있다. 또한, OVS 회로는 복수 센싱된 데이터들 중에서 최적의 데이터를 선택하기 위한 처리를 수행 할 수 있다. 최적 데이터의 선택을 위해서 OVS 회로는 셀 카운터로부터 제공되는 카운트 결과(nC)를 참조할 수 있다. 즉, OVS 회로는 복수의 센싱 결과들 중에서 산포골에 가장 근접한 리드 결과를 선택 및 출력하도록 페이지 버퍼 회로를 제어할 수 있다. 또한, OVS 회로는 OVS 동작에 대응하는 디벨럽 시간 정보를 저장할 수 있다. OVS 회로는 저장된 디벨 럽 시간 정보를 검출 정보(OVSDI)로 제어기에 출력할 수 있다. 실시 예에 있어서, 검출 정보(OVSDI)는, UIB out을 이용하여 출력되거나, 특수 커맨드(예를 들어, 겟 피쳐(get feature) 커맨드, 스테이터스 리드 (status read) 커맨드 등)에 응답하여 출력될 수 있다. 전압 발생기는 제어 로직의 제어에 따라 각각의 워드라인들로 인가될 다양한 종류의 워드라인 전압들, 메모리 셀들이 형성된 벌크(예를 들어, 웰 영역)로 공급될 웰 전압을 생성하도록 구현될 수 있다. 각각 의 워드라인들로 인가되는 워드라인 전압들은, 프로그램 전압, 패스 전압, 리드 전압, 리드 패스 전압들 등을 포함할 수 있다. 셀 카운터는 페이지 버퍼 회로에 센싱된 데이터로부터 특정 문턱 전압 범위에 해당하는 메모리 셀들 을 카운트하도록 구현될 수 있다. 예를 들어, 셀 카운터는 복수의 페이지 버퍼들(PB1 ~ PBn) 각각에 센싱 된 데이터를 처리함으로써, 특정 문턱 전압 범위의 문턱 전압을 갖는 메모리 셀들의 수를 카운트할 수 있다. 본 발명의 실시 예에 따른 비휘발성 메모리 장치는, OVS 방어코드를 수행함으로써, 리드 동작의 신뢰성을 확보할 수 있다. 또한, 본 발명의 실시 예에 따른 비휘발성 메모리 장치는 OVST(도 1 참조)를 이용하여 제 1 OVS 동작의 제 1 페이지에 대한 검출 정보(OVSDI)를 제 2 페이지에 대한 리드 레벨로 HRT(도 1 참조)에 사전 에 반영하고, 반영된 HRT(도 1 참조)의 리드 레벨을 이용하여 제 2 페이지에 대한 제 2 페이지 리드 동작을 수 행함으로써, 에러 발생 확률을 줄일 수 있다. 도 3은 본 발명의 실시 예에 메모리 블록(BLKi, i는 2 이상의 정수)의 회로도를 예시적으로 보여주는 도면이다. 메모리 블록(BLKi)에 포함되는 복수의 메모리 낸드 스트링들은 상기 기판과 수직한 방향으로 형성될 수 있다. 도 3을 참조하면, 메모리 블록(BLKi)은 비트 라인들(BL1, BL2, BL3)과 공통 소스 라인(CSL) 사이에 연결되는 복 수의 메모리 낸드 스트링들(NS11~NS33)을 포함할 수 있다. 복수의 메모리 낸드 스트링들(NS11~NS33) 각각은 스 트링 선택 트랜지스터(SST), 복수의 메모리 셀들(MC1, MC2, ... , MC8) 및 접지 선택 트랜지스터(GST)를 포함할 수 있다. 도 3에는 복수의 메모리 낸드 스트링들(NS11~NS33) 각각이 8 개의 메모리 셀들(MC1, MC2, ... , MC 8)을 포함하는 것으로 도시되나, 반드시 여기에 제한되지 않을 것이다.스트링 선택 트랜지스터(SST)는 상응하는 스트링 선택 라인(SSL1, SSL2, SSL3)에 연결될 수 있다. 복수의 메모 리 셀들(MC1, MC2, ... , MC8)은 각각 상응하는 게이트 라인(GTL1, GTL2, ..., GTL8)에 연결될 수 있다. 게이 트 라인(GTL1, GTL2, ... , GTL8)은 워드 라인들에 해당할 수 있으며, 게이트 라인(GTL1, GTL2, ... , GTL8)의 일부는 더미 워드 라인에 해당할 수 있다. 접지 선택 트랜지스터(GST)는 상응하는 접지 선택 라인(GSL1, GSL2, GSL3)에 연결될 수 있다. 스트링 선택 트랜지스터(SST)는 상응하는 비트 라인(BL1, BL2, BL3)에 연결되고, 접지 선택 트랜지스터(GST)는 공통 소스 라인(CSL)에 연결될 수 있다. 동일 높이의 워드 라인(예를 들면, WL1)은 공통으로 연결되고, 접지 선택 라인(GSL1, GSL2, GSL3) 및 스트링 선 택 라인(SSL1, SSL2, SSL3)은 각각 분리될 수 있다. 도 3에는 메모리 블록(BLK)이 8 개의 게이트 라인(GTL1, GTL2, ... , GTL8) 및 3 개의 비트 라인들(BL1, BL2, BL3)에 연결되는 것으로 도시되나, 반드시 여기에 제한되 지 않을 것이다. 도 4는 본 발명의 실시 예에 따른 페이지 버퍼(PBi, i는 양의 정수)를 예시적으로 보여주는 도면이다. 도 4에 도시된 바와 같이, 페이지 버퍼(PBi)는 셀 스트링에 비트 라인(BL)을 통해서 연결될 수 있다. 페이지 버퍼(PB i)는 프로그램 동작에서 비트 라인(BL)을 셋업 혹은 프리차지 시킬 수 있다. 리드 동작에서 페이지 버퍼(PBi)는 비트 라인(BL)을 프리차지 시키고, 선택된 메모리 셀의 온/오프 여부를 센싱 할 수 있다. 페이지 버퍼(PBi)는 전원 전압(VDD)을 비트라인(BL)에 공급하기 위한 트랜지스터들을 포함할 수 있다. 그리고 페이지 버퍼(PBi)는 트랜지스터들을 제어하기 위한 제어 신호들(BLSLT, BLSHF, SHLD, LOAD)를 제어 로직으로부터 제공받을 수 있다. 이러한 제어 신호들(BLSLT, BLSHF, SHLD, LOAD)에 응답하여 비트 라인(BL)이 프리차지 및 디벨럽 (Develop)될 수 있다. 또한, 스위칭 신호들(SEN, DL1, DL2, DL3, Dump)에 응답하여 비트라인(BL)에 대응하는 센싱 노드(S0)의 데이터가 래치될 수 있다. 실시 예에 있어서, 비트라인(BL)에 연결되는 페이지 버퍼(PBi)는 낸드 스트링의 메모리 셀들과 연결될 수 있다. 페이지 버퍼(PB)는 비트 라인(BL)과 연결되는 센싱 노드(SO)를 포함할 수 있다. 그리고 페이지 버퍼(PBi)는 센 싱 노드(SO)에 각각 연결되는 복수의 래치들(S, M, L, F, C)을 포함할 수 있다. 복수의 래치들(S, M, L, F, C) 중에서 일부(M, L, F)는 최상위 비트(Most Significant Bit, MSB), 중간 비트(Central Significant Bit, CSB), 최하위 비트(Least Significant Bit, LSB)을 저장할 수 있다. 한편, 도 4에 도시된 페이지 버퍼(PBi)는 5개의 래치들이 도시되고 있지만, 본 발명의 래치의 개수는 여기에 제한되지 않는다고 이해되어야 할 것이다. 도 5는 본 발명의 실시 예에 따른 제어기를 예시적으로 보여주는 도면이다. 도 5를 참조하면, 제어기(20 0)는 호스트 인터페이스, 메모리 인터페이스, 적어도 하나의 CPU, 버퍼 메모리, 에러 정정 회로, 플래시 변환 계층 매니저, 패킷 매니저, 및 암호 장치를 포함할 수 있다. 호스트 인터페이스는 호스트와 패킷(packet)을 송수신하도록 구현될 수 있다. 호스트로부터 호스트 인터페 이스로 전송되는 패킷은 커맨드(command) 혹은 비휘발성 메모리에 쓰여질 데이터를 포함할 수 있다. 호스트 인터페이스로부터 호스트로 전송되는 패킷은 커맨드에 대한 응답(response) 혹은 비휘발성 메모리 로부터 읽혀진 데이터를 포함할 수 있다. 메모리 인터페이스는 비휘발성 메모리에 쓰여질 데이 터를 비휘발성 메모리로 송신하거나, 비휘발성 메모리로부터 읽혀진 데이터를 수신할 수 있다. 이러 한 메모리 인터페이스는 JDEC Toggle 혹은 ONFI와 같은 표준 규약을 준수하도록 구현될 수 있다. 플래시 변환 계층 매니저는 어드레스 맵핑(address mapping), 웨어-레벨링(wear-leveling), 가비지 콜렉 션(garbage collection)과 같은 여러 기능을 수행할 수 있다. 어드레스 맵핑 동작은 호스트로부터 수신한 논리 어드레스(logical address)를, 비휘발성 메모리 내에 데이터를 실제로 저장하는 데 사용되는 물리 어드레 스(physical address)로 바꾸는 동작이다. 웨어-레벨링은 비휘발성 메모리 내의 블록(block)들이 균일하게 사용되도록 하여 특정 블록의 과도한 열화를 방지하기 위한 기술로, 예시적으로 물리 블록(physical block)들의 소거 카운트들을 밸런싱하는 펌웨어 기술을 통해 구현될 수 있다. 가비지 콜렉션은, 블록의 유효 데이터를 새 블록에 복사한 후 기존 블록을 소거(erase)하는 방식을 통해 비휘발성 메모리 내에서 사용 가능한 용량을 확보하기 위한 기술이다. 패킷 매니저는 호스트와 협의된 인터페이스의 프로토콜에 따른 패킷(Packet)을 생성하거나, 호스트로부터 수신된 패킷(Packet)으로부터 각종 정보를 파싱할 수 있다. 또한, 버퍼 메모리는 비휘발성 메모리에 기록될 데이터 혹은 비휘발성 메모리로부터 읽혀진 데이터를 임시로 저장할 수 있다. 실시 예에 있어서, 버퍼 메모리는 제어기 내에 구비되는 구성일 수 있다. 다른 실시 예에 있어서, 버퍼 메모리는 제어기의 외부에 배치될 수도 있다.암호 장치는, 저장 제어기로 입력되는 데이터에 대한 암호화(encryption) 동작과 복호화(decryption) 동작 중에서 적어도 하나를, 대칭 키 알고리즘(symmetric-key algorithm)를 이용하여 수행할 수 있다. 암호 장 치는 AES(advanced encryption standard) 알고리즘을 이용하여 데이터의 암호화 및 복호화를 수행할 수 있다. 암호 장치는 암호화 모듈 및 복호화 모듈을 포함할 수 있다. 도 6은 일반적인 저장 장치에서 OVS 이용한 리드 동작을 수행하는 과정을 예시적으로 보여주는 흐름도이다. 여 기서는 디폴트 리드 레벨을 이용하여 제 1 워드라인(WL1)에 연결된 메모리 셀들에 리드 동작이 수행된다고 가정 하겠다. 이러한 리드 동작이 실패할 때, 제 1 워드라인(WL1)에 연결된 메모리 셀들에 대한 OVS 동작은 활성화 된다. 즉, 비휘발성 메모리 장치는 방어코드로 진입한다. OVS 동작은 PDT(Pre Defined Table; 사전에 정의된 테 이블) 반영하여 수행된다. 이러한 OVS 동작으로 제 1 워드라인(WL1)에 연결된 메모리 셀들에 대한 리드 동작이 패스할 때, HRT(History Read Table)가 업데이트 된다. 이때, OVS 동작에 사용한 PDT의 옵셋 정보가 HRT에 업 데이트된다. 이후에 다음 워드라인, 예를 들어 제 2 워드라인(WL2)에 연결된 메모리 셀들에 대한 리드 동작이 수행될 때, 기 본적으로 OVS 동작은 비활성화 된다. 즉, 방어 코드가 해제된 상태에서 제 2 워드라인(WL2)에 연결된 메모리 셀 들에 대한 리드 동작이 수행된다. 이때, 업데이트된 HRT를 이용한 히스토리 리드 동작이 수행된다. 일반적인 저 장 장치는, OVS 동작에 찾은 최적의 리드 레벨 옵셋을 HRT에 반영하지 않기 때문에, 다음 워드라인에 연결된 메 모리 셀들의 리드 동작에서 실패할 확률이 높다. 한편, 본 발명의 실시 예에 따른 저장 장치는 OVS 동작의 성공 혹은 실패에 상관없이 검출 정보(OVSDI, 도 1 참조)를 히스토리 리드 레벨 테이블(HRT)에 반영함으로써, 다음 리드 동작(OVS 동작 혹은 노멀 리드 동작)에 서 최적의 리드 레벨을 이용할 수 있다. 도 7a 및 도 7b는 본 발명의 실시 예에 따른 저장 장치에서 OVS 동작에 따른 리드 레벨을 추출하는 과정을 개념적으로 보여주는 도면들이다. 도 7a를 참조하면, 설명의 편의를 위하여 메모리 셀은 TLC(Triple Level Cell)이고, TLC의 리드 동작은 MSB(Most Significant Bit) 페이지를 가장 먼저 읽고, 다음에 CSB(Central Significant Bit) 페이지를 읽고, 그 다음에 LSB(Least Significant Bit) 페이지를 읽는다고 가정하겠다. 한편, 본 발명의 페이지 리드 순서는 여 기에 제한되지 않는다고 이해되어야 할 것이다. 도 7a에 도시된 바와 같이, TLC는 이레이즈 상태(E) 및 프로그 램 상태들(P1 ~ P7) 중에서 어느 하나로 프로그램 될 수 있다. MSB 페이지 리드 동작은 제 4 리드 레벨(R3)을 기준으로 한 OVS 동작과, 제 7 리드 레벨(R7)을 기준으로 한 OVS 동작을 포함할 수 있다. CSB 페이지 리드 동작은 제 2 리드 레벨(R2)을 기준으로 한 OVS 동작, 제 4 리드 레벨 (R4)을 기준으로 한 OVS 동작, 및 제 6 리드 레벨(R6)을 기준으로 한 OVS 동작을 포함할 수 있다. LSB 페이지 리드 동작은 제 1 리드 레벨(R1)을 기준으로 한 OVS 동작, 제 5 리드 레벨(R5)을 기준으로 한 OVS 동작을 포함 할 수 있다. 각 OVS 동작은, 검출 케이스를 판별하기 위한 OVS 센싱 동작과 검출 케이스에 따른 메인 센싱 동작 을 포함할 수 있다. 한편, MSB/CSB/LSB 페이지 리드 동작의 리드 레벨들이 도 7a에 도시된 그것들에 제한되지 않는다고 이해되어야 할 것이다. 도 7b을 참조하면, 저장 장치는 PDT(Pre-defined Table) 혹은 OVST(OVS Table)을 이용하여 HRT(History Read Level Table)을 업데이트함으로써, 최적의 리드 레벨을 추출할 수 있다. 검출 정보(OVSDI, 도 1 참조)는 MSB 페이지 리드 동작의 OVS 동작에 따른 검출 케이스에 대응하는 결과를 포함 할 수 있다. 검출 정보(OVSDI)에 대응하는 제 2 리드 레벨 옵셋(OST_ovst)이 OVST에 반영될 수 있다. 실시 예에 있어서, 제 3 리드 레벨 옵셋(OST_hrt)은 제 1 리드 레벨 옵셋(OST_pdt)와 제 2 리드 레벨 옵셋 (OST_ovst)를 이용하여 결정될 수 있다. 예를 들어, 프로그램 시간 경과에 따른 제 1 리드 레벨 옵셋(OST_pdt) 에 제 2 리드 레벨 옵셋(OST_ovst)가 더해짐으로써 제 3 리드 레벨 옵셋(OST_hrt)이 결정될 수 있다. 한편, 제 3 리드 레벨 옵셋(OST_hrt)이 제 1 리드 레벨 옵셋(OST_pdt) 혹은 제 2 리드 레벨 옵셋(OST_ovst)의 단순한 덧 셈으로만 결정된다고 이해되어서는 안될 것이다. 이 외에도 제 3 리드 레벨 옵셋(OST_hrt)는 제 1 및 제 2 리드 레벨 옵셋들(OST_pdt, OST_ovst)의 각각에 가중치를 적용하여 더해질 수도 있다. 본 발명의 실시 예에 따른 저장 장치는 MSB 페이지 리드 동작의 OVS 동작의 리드 레벨 옵셋(OST_ovst)을 MSB 페이지 리드 동작을 수행하기 위한 HST에 반영할 뿐 아니라, CSB/LSB 페이지 리드 동작을 수행하기 위한 HST에 미리 반영함으로써, 다음 페이지 리드 동작에서 최적의 리드 레벨로 빠르게 검색할 수 있다.일반적으로, 디벨럽 시간을 달리하는 시점에 페이지 버퍼의 센싱 노드를 여러 번 센싱하는 것은, 워드라인 전압 을 가변 시킴으로써 비트라인을 프리차지하고 센싱하는 것과 같은 효과를 갖는다. 도 8a 및 도 8b는 산포골의 서로 다른 리드 레벨들과 그것들에 대응하는 디벨럽 시간들을 개념적으로 보여주는 도면들이다. 도 8a에 도시된 바와 같이, 상태들(S1, S2)의 산포골을 찾기 위한 OVS 동작은 복수의 센싱 동작들 에 의해 수행될 수 있다. 여기서 복수의 센싱 동작들은 복수의 페이지 버퍼 그룹들의 각각에서 동시에 진행될 수 있다. 도 8b를 참조하면, 제 1 페이지 버퍼들(PGB1)과 제 2 페이지 버퍼들(PGB2)에서 서로 다른 디벨럽 구간 동안의 동일한 시점들에서 센싱 노드를 순차적으로 래치하여 센싱 결과를 저장하는 방식으로 온-칩 밸리 서치 동작이 수행될 수 있다. T0 시점에서 T1 시점까지 프리차지 동작이 수행될 수 있다. 프리차지를 위하여 제 1 페이지 버퍼들(PBG1)의 각 각에 연결된 제 1 비트라인 및 제 1 센싱 노드가 충전될 수 있다. 비트라인 셋-업 신호들이 활성화되면, 센싱 노드와 제 1 비트라인이 특정 레벨로 프리차지 될 수 있다. T1 시점에서 제 1 비트라인 셋-업 신호가 하이 레벨 로 비활성화되면, 제 1 페이지 버퍼들PBG1)의 각각의 프리차지 회로가 오프 될 수 있다. 또한, T1 시점 이후의 T2 시점에서 제 2 비트라인 셋-업 신호가 하이 레벨로 비활성화되면, 제 2 페이지 버퍼들(PBG2)의 각각의 프리 차지 회로가 오프 될 수 있다. 이때 제 1 페이지 버퍼들(PBG1)의 각각의 센싱 노드의 레벨과 제 2 페이지 버퍼 들(PBG2)의 각각의 센싱 노드의 레벨은, 메모리 셀의 온/오프 여부에 따라 대응하는 비트라인으로 흐르는 전류 의 크기에 따라 변화될 수 있다. 도 8b에 도시된 바와 같이, 제 1 페이지 버퍼들(PBG1)의 각각은 T0 시점에서 T1 시점까지 센싱 노드를 프리차지 하고, T1 시점부터 T4 시점까지 제 1 비트라인들을 디벨럽 시킬 수 있다. 반면에 제 2 페이지 버퍼들(PBG2)의 각각은 T0 시점에서 T1 시점까지 센싱 노드를 프리차지하고, T1 시점보다 늦은 T2 시점부터 T4 시점까지 제 2 비트라인들을 디벨럽 시킬 수 있다. 제 1 센싱 동작은, T3 시점에서 수행하는 래치 리셋(nS) 센싱 동작과, T5 시점에서 래치 셋(S) 센싱 동작을 포 함할 수 있다. 제 1 페이지 버퍼들(PGB1)에서 래치 리셋(nS) 센싱 동작과 래치 셋(S) 센싱 동작의 온-셀 카운트 값을 이용하여 제 1 셀 카운트 정보가 산출될 수 있다. 또한, 제 2 페이지 버퍼들(PGB2)에서 래치 리셋(nS) 센 싱 동작과 래치 셋(S) 센싱 동작의 온-셀 카운트 값을 이용하여 제 2 셀 카운트 정보가 산출될 수 있다. 한편, 제 1 센싱 동작의 제 1 및 제 2 셀 카운트 정보에 근거로 하여 산포골에 대응하는 최적의 리드 레벨에 대응하는 검출 케이스(C1 ~ C5 중 어느 하나)가 결정될 수 있다. 그리고 이렇게 결정된 검출 케이스에 대응하는 제 2 센 싱 동작의 디벨럽 시간(tSODev1 ~ tSODev5)이 결정될 수 있다. 도 9는 본 발명의 실시 예에 따른 OVST을 이용하여 리드 레벨을 보정하는 과정을 개념적으로 보여주는 도면이다. OVS 동작에 따른 최적의 산포골에 대응하는 디벨럽 시간의 옵셋이 결정될 수 있다. 최상위 페이지의 경우 디벨 럽 시간의 옵셋이 +80ns이다. 이 경우, OVS 동작의 검출 케이스는 제 3 검출 케이스(C3)에 대응한다. 비휘발성 메모리 장치(100, 도 1 참조)의 OVS 회로(155, 도 1 참조)는 OVS 동작의 최적의 디벨럽 시간에 대응하는 검출 케이스에 대한 제 1 변환 동작을 수행할 수 있다. OVS 회로는 각 검출 케이스에 대한 데이터 비트를 저장 혹은 래치 할 수 있다. 이후, 비휘발성 메모리 장치로부터 검출 정보(OVSDI, 도 1 참조)가 제어기(200, 도 1 참조) 출력될 수 있 다. 제어기는 검출 정보, 즉, OVS 검출 케이스(C3)를 이용하여 대응하는 리드 레벨 옵셋(+20mV)을 OVST를 생성할 수 있다. 이 경우, 제어기는 OVST를 이용하여 OVS 검출 케이스에 대응하는 리드 레벨에 대한 제 2 변환 동작을 수행할 수 있다. 이로써, 최종적으로 제어기는 OVS 동작에 따른 옵셋을 HRT에 업데이트 할 수 있다. 도 10a, 도 10b, 도 10c, 및 도 10d는 본 발명의 실시 예에 따른 저장 장치의 리드 방법을 개념적으로 설명 하는 도면들이다. MSB 페이지 리드 동작에서, 도 10a에서 도시된 바와 같이 제 3 리드 레벨(R3) 를 기준으로 한 OVS 동작의 결과 로써 제 2 검출 케이스(C2)가 결정되고, 도 10b에 도시된 바와 같이 제 7 리드 레벨(R7)을 기준으로 한 OVS 동 작의 결과로써 제 2 검출 케이스(C2)가 결정될 수 있다. 저장 장치의 리드 레벨 보상 유닛(도 1 참조, 211)은, MSB 페이지 리드 동작에서 제 3 리드 레벨(R3)에 대 응하는 제 1 OVS 동작과 제 7 리드 레벨(R7)에 대응하는 제 2 OVS 동작의 검출 케이스가 모두 제 2 검출 케이스 (C2)라는 것을 검출 정보(OVSDI)를 통하여 확인하고, 도 10에 도시된 OVST(OVS Table)을 이용하여 도 10에 도시 된 바와 같이 모든 상태들(P1 ~ P7)의 각각에 대응하는 리드 레벨들(R1 ~ R7)의 옵셋들을 HRT(History Read Level Table)에 업데이트 할 수 있다. 리드 레벨 보상 유닛은 MSB 페이지 리드 동작의 제 3 및 제 7 리드 레벨들(R3, R7)에 대응하는 검출 정보(OVSDI)를 이용하여, 제 3 및 제 7 리드 레벨(R3, R7)을 보상할 뿐 아니라, 나머지 리드 레벨들(R1, R2, R4, R5, R6)을 미리 보상할 수 있다. MSB 페이지 리드 동작에서 제 1 OVS 동작과 제 2 OVS 동작의 검출 케이스가 모두 제 2 검출 케이스(C2)이기 때 문에, 나머지 상태들에 대응하는 OVS 동작의 검출 케이스는 제 2 검출 케이스(C2)로 될 가능성이 높다. 즉, 하 나의 워드라인에 연결된 메모리 셀들을 동일 방향으로 열화 될 가능성이 높다. 따라서, 도 10c에 도시된 OVST의 나머지 상태들에 제 2 검출 케이스(C2)에 대응하는 옵셋들을 HRT에 사전에 반영할 수 있다. 한편, OVST(OVS Table)을 HRT(History Read Level Table)에 업데이트 여부는, MSB 페이지 리드 동작의 검출 정 보(OVSDI)로부터 획득된 메모리 셀의 열화 방향성에 따라 결정될 수 있다. 도 11a, 도 11b, 및 도 11c는 OVST을 HRT에 업데이트 여부를 판별하는 열화 방향성에 관련된 3 가지 경우를 예 시적으로 보여주는 도면들이다. 도 11a을 참조하면, MSB 페이지 리드 동작에서 제 1 OVS 동작(예, R3 OVS 센싱)과 제 2 OVS 동작(예, R7 OVS 센싱)의 검출 케이스들이 모두 동일하다. 열화 방향성이 동일하고, 열화 정도도 비슷한 경우이다. 이때, 리드 레벨 보상 유닛은 OVST를 이용하여 모든 상태들에 대한 옵셋들을 HRT에 업데이트 시킬 수 있다. 도 11b을 참조하면, MSB 페이지 리드 동작에서 제 1 OVS 동작(예, R3 OVS 센싱)은 제 2 검출 케이스(예, C2)를 지시하고, 제 2 OVS 동작(예, R7 OVS 센싱)은 제 4 검출 케이스(C4)를 지시할 수 있다. 제 2 검출 케이스(C2)와 제 4 검출 케이스(C4)는 산포골을 중심으로 서로 반대 방향에 위치하고 있다. 이는 열화 방향성이 불일치 하다 는 것을 의미한다. 따라서, 리드 레벨 보상 유닛은 OVST를 이용하여 제 3 리드 레벨(R3)와 제 7 리드 레벨 (R7)에 대한 옵셋들만 HRT에 업데이트 시킬 수 있다. 도 11c을 참조하면, MSB 페이지 리드 동작에서 제 1 OVS 동작(예, R3 OVS 센싱)은 제 1 검출 케이스(예, C1)를 지시하고, 제 2 OVS 동작(예, R7 OVS 센싱)은 제 2 검출 케이스(C2)를 지시할 수 있다. 제 1 검출 케이스(C1)와 제 2 검출 케이스(C2)는 산포골을 중심으로 동일 방향에 위치하고 있다. 이는 열화 방향성이 동일하다는 것을 의미한다. 따라서, 리드 레벨 보상 유닛은 OVST를 이용하여 제 3 리드 레벨(R3)와 제 7 리드 레벨(R7)에 대한 옵셋들을 HRT에 업데이트 시킬 뿐 아니라, OVST를 이용하여 나머지 리드 레벨들(R1, R2, R4, R5, R6)에 적 당한 옵셋들(예를 들어, 제 2 검출 케이스(C2)에 대응하는 옵셋)을 HRT에 업데이트 할 수 있다. 정리하면, 첫째로, 열화 방향성이 동일하고 동일한 검출 케이스(예, 도 11a의 C2)일 때, OVST를 이용하여 모든 상태들에 대한 옵셋들이 HRT에 업데이트 될 수 있다. 둘째로, 열화 방향성이 서로 다를 때, 처음 OVS 동작의 검 출 케이스들(도 11b의 C2와 C4)에 대응하는 리드 레벨들(R3, R7)의 옵셋들만 HRT에 업데이트될 수 있다. 셋째로, 열화 방향성이 동일하고 서로 다른 검출 케이스들(예, 도 11c의 C1과 C2)이 지시될 때, OVST를 이용하 여 처음 OVS 동작의 검출 케이스들(C1, C2)에 대응하는 리드 레벨들(R3, R7)의 옵셋들과, 서로 다른 검출 케이 스들(C1, C2) 중에서 상대적으로 약하게 열화된 검출 케이스(C2)에 대응하는 리드 레벨들(R1, R2, R4, R5, R6) 의 옵셋들이 HRT에 업데이트될 수 있다. 한편, 본 발명의 열화 방향성과 HRT에 옵셋 업데이트 여부는 여기에 제한되지 않는다고 이해되어야 할 것이다. 도 12a 및 도 12b는 열화 방향성이 동일하고, 서로 다른 검출 케이스가 지시될 때 HRT 업데이트에 대한 실시 예 를 예시적으로 보여주는 도면들이다. 설명의 편의를 위하여, 도 11c에 도시된 바와 같이, MSB 페이지 리드 동작 의 제 3 리드 레벨(R3)를 기준으로 한 제 1 OVS 동작에서 제 1 검출 케이스(C1)이 지시되고, 제 7 리드 레벨 (R7)를 기준으로 한 제 2 OVS 동작에서 제 2 검출 케이스(C3)가 지시된다고 가정하겠다. 제 1 및 제 2 검출 케이스들(C1, C2)은 산포골을 중심으로 워드라인에 연결된 메모리 셀들이 리텐션 열화를 받 고 있다는 것을 의미할 수 있다. 이때, 리드 레벨 보상 유닛(도 1참조, 211)은 OVST을 이용하여 최소한의 열화 를 지시하는 검출 케이스(C2)에 적합하게 전체의 리드 레벨들(R1 ~ R7)의 옵셋들(-32mV, -24mV, -16mV, -32mV, -48mV, -64mV, -80mV)을 HRT에 업데이트할 수 있다. 제 3 리드 레벨(R3)를 기준으로 한 제 1 OVS 동작의 검출 케이스가 제 1 검출 케이스(C1)이지만, 제 3 리드 레벨(R3)에 대한 옵셋은 제 7 리드 레벨(R7)을 기준으로 한 제 2 OVS 동작의 제 2 검출 케이스(C2)에 대응하는 옵셋(-16mV)만큼 HRT에 업데이트 될 수 있다.도 13은 본 발명의 실시 예에 따른 저장 장치의 리드 방법을 예시적으로 보여주는 흐름도이다. 도 1 내지 도 13을 참조하면, 리드 방법은 다음과 같이 진행될 수 있다. 호스트(외부)로부터 저장 장치로 리드 요청이 수신될 수 있다. 저장 장치는 이러한 리드 요청에 대한 히스토리를 파악할 수 있다. 히스토리 버퍼에서 현재 수신된 리드 요청이 이전에 있었는 지가 파악될 수 있다 (S110). 만일, 히스토리 버퍼에 저장된 이전 리드 요청들 중에 현재의 리드 요청이 존재한다면, 히스토리 리드 동작이 수행될 수 있다(S120). 여기서 히스토리 리드 동작은 HRT에 포함된 최적의 리드 전압 레벨로 리드 동작 을 수행할 수 있다. 반면에, 히스토리 버퍼에 저장된 이전 리드 요청들 중에서 현재의 리드 요청이 존재하지 않 으면, 노멀 리드 동작이 수행될 수 있다(S125). 여기서 노멀 리드 동작은 디폴트 리드 전압 레벨로 리드 동작을 수행할 수 있다. 히스토리 리드 동작 혹은 노멀 리드 동작의 결과로써, UECC(에러 정정 불가)가 발생하는 지가 판별될 수 있다 (S130). 여기서 UECC는 읽혀진 데이터가 ECC 회로(130, 도 1 참조)에 의해 복구될 수 없는 것을 의미한다. UECC 가 발생하지 않으면, 리드 동작은 곧바로 종료될 것이다. 반면에, UECC가 발생하였다면, 기본적으로 OVS 모드가 활성화 되고, 즉, OVS 방어코드가 진입되고(S140), 비휘발성 메모리 장치(100, 도 1 참조)는 OVS 모드에 따른 리드 리트라이 동작을 수행할 수 있다. 여기서 리드 리트라이 동작은, PDT와 OVS를 이용한 리드 동작을 포함할 수 있다. 즉, PDT의 리드 전압 레벨 옵셋과 OVS 동작을 수행함으로써, 리드 리트라이 동작이 수행될 수 있다 (S150). 이후에, 이러한 리드 리트라이 동작이 패스인가가 판별될 수 있다(S160). 이러한 판별결과로써, 리드 리트라이 동작이 패스일 때, OVS 동작의 검출 정보(OVSDI)가 제어기(200, 도 1 참조)로 수신되고, 제어기의 리드 레 벨 보상 유닛(211, 도 참조)은 OVST(OVS Table)을 이용하여 OVS 검출 정보(OVSDI)에 대응하는 옵셋 정보를 결정 할 수 있다. 이러한 옵셋 정보를 이용하여 HRT의 업데이트 여부가 판별될 수 있다(S170). 리드 레벨 보상 유닛 은 도 1 내지 도 12에 설명된 바와 같이 OVST의 옵셋 정보와 PDT의 옵셋 정보를 HRT(History Read Level Table)에 업데이트 될 수 있다(S180). 리드 레벨 보상 유닛은 워드라인에 대응하는 현재 페이지에 대한 열 화 방향성과 검출 정보(OVSDI)를 이용하여 워드라인에 대응하는 다음 페이지에 대한 적어도 하나의 리드 레벨을 보상할 수 있다. 반면에, 리드 리트라이 동작이 페일 일 때, 제어기는 데이터 복구를 위하여 오프-칩 밸리 서치(off-chip valley search) 동작을 수행할 수 있다(S190). 여기서 오프-칩 밸리 서치는 사전에 결정된 전압 구간을 사전의 결정된 전압만큼 증가 혹은 감소시키면서 순차적으로 스캐닝함으로써, 산포골을 찾는 것을 의미한다. 이러한 오프-칩 밸리 서치 동작에 따른 산포골에 따라 리드 동작이 수행되고, 리드 동작의 수행 결과가 실패했 는지가 판별될 수 있다(S120). 만일 실패하지 않았다면, 리드 동작은 완료될 것이다. 반면에, 이러한 리드 동작 이 실패하면, 최종적으로 호스트의 리드 요청에 대한 UECC가 발생될 수 있다. 이렇게 발생된 UECC는 호스트에 출력될 것이다. 도 14는 도 13의 HRT를 업데이트 하는 과정(S180)을 좀 더 자세하게 보여주는 흐름도이다. 도 14를 참조하면, 검출 정보(OVSDI)를 이용한 HRT의 업데이트 과정은 다음과 같이 진행될 수 있다. 제 1 페이지 리드 동작(예를 들어, MSB 페이지 리드 동작)에서 제 1 레벨(R[i], i는 양의 정수)과 제 2 레벨 (R[j], j는 i가 아닌 양의 정수)의 검출 케이스가 동일한 지가 판별될 수 있다(S181). 만일, 제 1 레벨(R[i])의 검출 케이스와 제 2 레벨(R[j])의 검출 케이스가 동일할 때, 리드 레벨 보상 유닛 (211, 도 1 참조)은 OVST를 이용하여 모든 상태들에 대한 옵셋들을 HRT에 업데이트할 수 있다(S182). 반면에, 제 1 레벨(R[i])의 검출 케이스와 제 2 레벨(R[j])의 검출 케이스가 동일하지 않을 때, 제 1 레벨 (R[i])의 검출 방향과 제 2 레벨(R[j])의 검출 방향이 동일한 지가 판별될 수 있다(S183). 만일, 제 1 레벨 (R[i])의 검출 방향과 제 2 레벨(R[j])의 검출 방향이 동일하다면, 리드 레벨 보상 유닛은 작은 이동을 갖 는 검출 케이스를 선택하고(S184), OVST를 이용하여 선택된 검출 케이스에 대응하는 옵셋들을 HRT에 업데이트 하도록 S182 단계가 진입될 수 있다. 반면에, 만일, 제 1 레벨(R[i])의 검출 방향과 제 2 레벨(R[j])의 검출 방향이 동일하지 않다면, 리드 레벨 보 상 유닛은 제 1 레벨(R[i])의 검출 케이스에 대응하는 리드 레벨과 제 2 레벨(R[j])의 검출 케이스에 대응 하는 리드 레벨만 HRT에 업데이트 할 수 있다(S185). 도 15a 및 도 15b는 본 발명의 실시 예에 따른 저장 장치의 리드 동작의 시퀀스를 예시적으로 보여주는 도 면들이다. 도 15a를 참조하면, OVS 방어코드의 리드 동작은, MSB 페이지 OVS 동작을 수행한 뒤, CSB 페이지 리드 동작하거 나LSB 페이지 리드 동작을 진행할 수 있다. MSB 페이지 OVS 동작은 제 7 리드 레벨(R7)에 대한 제 1 OVS 동작과 제 5 리드 레벨(R3)에 대한 제 2 OVS 동작 을 순차적으로 진행할 수 있다. CSB 페이지 리드 동작은 MSB 페이지 OVS 동작의 검출 정보에 따라 변경된 제 6 리드 레벨(R6)에 대한 제 1 리드 동작, MSB 페이지 OVS 동작의 검출 정보에 따라 변경된 제 4 리드 레벨(R4)에 대한 제 2 리드 동작, 및 MSB 페 이지 OVS 동작의 검출 정보에 따라 변경된 제 2 리드 레벨(R2)에 대한 제 3 리드 동작을 순차적으로 진행할 수 있다. LSB 페이지 리드 동작은 MSB 페이지 OVS 동작의 검출 정보에 따라 변경된 제 5 리드 레벨(R5)에 대한 제 1 리드 동작과 MSB 페이지 OVS 동작의 검출 정보에 따라 변경된 제 1 리드 레벨(R1)에 대한 제 2 리드 동작을 순차적으 로 진행할 수 있다. 본 발명의 실시 예에 따른 OVS 방어코드의 리드 동작은, MSB 페이지 OVS 동작에 검출 케이스들과 OVST(OVS Table)을 이용하여, CSB 페이지 리드 동작 혹은 LSB 페이지 리드 동작의 리드 레벨들을 변경할 수 있다. 한편, MSB/CSB/LSB 페이지 리드 동작들의 각각의 동작 순서는 다양하게 변경 가능하다. 도 15b를 참조하면, LSB 페이지 리드 동작은 제 1 리드 레벨(R1)에 대한 리드 동작을 먼저 수행하고, 제 5 리드 레벨(R5)에 대한 리드 동작을 수행할 수 있다. CSB 페이지 리드 동작은, 제 2 리드 레벨(R2)에 대한 리드 동작을 먼저 수행하고, 제 4 리드 레벨(R4) 에 대한 리드 동작을 수행하고, 다음으로 제 6 리드 레벨(R6)에 대한 리드 동작을 수행할 수 있다. 반대로, CSB 페이지 리드 동작은, 제 6 리드 레벨(R6)에 대한 리드 동작을 먼저 수행하고, 제 4 리드 레벨(R4)에 대한 OVS 동작을 수행하고, 다음으로 제 2 리드 레벨(R2)에 대한 리드 동작을 수행할 수 있다. 또한, MSB 페이지 리드 동작은, 제 7 리드 레벨(R7)에 대한 리드 동작을 수행한 후에 제 3 리드 레벨(R3)에 대 한 리드 동작을 수행할 수 있다. 한편, 도 15b에 도시된 리드 시퀀스는 실시 예에 불과하다고 이해되어야 할 것이다. 도 16은 본 발명의 다른 실시 예에 따른 저장 장치의 리드 방법을 예시적으로 보여주는 흐름도이다. 도 1 내지 도 16을 참조하면, 저장 장치의 리드 동작은 다음과 같이 진행될 수 있다. 제어기(200, 도 1 참조)에서 전송된 노멀 리드 커맨드에 응답하여 비휘발성 메모리 장치(100, 도 1)는 디폴트 리드 레벨을 이용하여 제 1 리드 동작을 수행할 수 있다(S210). 여기서 디폴트 리드 레벨에 대응하는 정보는 노 멀 리드 커맨드와 함께 제어기로부터 전송될 수 있다. 디폴트 리드 레벨 정보는, HRT(History Read Level Table)의 옵셋 정보를 포함할 수 있다. 제어기는 제 1 리드 동작의 결과로써 UECC가 발생하는 지를 판별할 수 있다(S220). UECC 가 발생하지 않았 다면, 리드 동작은 완료될 수 있다. 반면에, UECC가 발생하였다면, 제어기에서 전송된 OVS 리드 커맨드에 응답하여 비휘발성 메모리 장치(10 0)는 OVS 센싱을 이용하는 제 2 리드 동작을 수행할 수 있다. 여기서 OVS 센싱은, 도 1 내지 도 15b에 설명된 바와 같이 처음 페이지 OVS 동작의 검출 케이스에 관련된 검출 정보(OVSDI)와 OVST(OVS Table)을 이용하여 리드 레벨의 옵셋 정보를 HRT(History Read Level Table)에 업데이트 하고, HRT를 이용하여 다음 페이지 리드 동작 (노멀/히스토리 리드 동작)을 수행할 수 있다. 이로써 리드 동작이 완료될 수 있다. 도 17은 본 발명의 실시 예에 따른 저장 장치의 OVS 방어코드 과정을 예시적으로 보여주는 래더 다이어그램 이다. 도 1 내지 도 17을 참조하면, 저장 장치의 OVS 방어코드 과정은 다음과 같이 진행될 수 있다. 제어기(CNTL)는 OVS 방어코드 진입에 따른 제 1 리드 커맨드(OVS 리드 커맨드)를 비휘발성 메모리 장치(NVM)에 전송할 수 있다(S10). 비휘발성 메모리 장치(NVM)는 제 1 리드 커맨드에 응답하여 제 1 페이지 OVS 동작을 수행 할 수 있다(S11). 제 1페이지 OVS 동작으로 읽혀진 데이터가 제어기(CNTL)로 전송될 수 있다(S12). 이후에, 제 어기(CNTL)는 특수 커맨드를 비휘발성 메모리 장치(NVM)으로 전송하고(S13), 비휘발성 메모리 장치(NVM)는 특수 커맨드에 응답하여 제 1 페이지 OVS 동작의 검출 케이스들에 대응하는 검출 정보(OVSDI)를 제어기(CNTL)로 출력할 수 있다(S14). 이후에, 제어기(CNTL)는 에러 정정 회로(ECC)를 이용하여 읽혀진 페이지 데이터가 에러 정정 불가한 지를 판별 할 수 있다(S15). 만일, 제 1 페이지 OVS 동작에서 읽혀진 페이지 데이터가 에러 정정 가능할 때, 제어기(CNT L)는 검출 정보(OVSDI)와 OVST를 이용하여 모든 상태들에 대한 리드 레벨들을 변경할 수 있다(S16). 이후에, 제어기(CNTL)는 변경된 리드 레벨 정보와 함께 제 2 리드 커맨드(노멀 리드 커맨드)를 비휘발성 메모리 장치(NVM)으로 전송할 수 있다(S17). 실시 예에 있어서, 제 2 리드 커맨드는 제 1 리드 커맨드와 다를 수 있다. 다른 실시 예에 있어서, 제 2 리드 커맨드는 제 1 리드 커맨드와 동일할 수 있다. 비휘발성 메모리 장치(NVM)는 제 2 리드 커맨드에 응답하여 변경된 리드 레벨들을 기준으로 제 2 페이지 리드 동작을 수행할 수 있다(S18). 이후에 제 2 페이지 리드 동작에서 읽혀진 데이터가 제어기(CNTL)로 전송될 수 있다(S19). 도 18은 본 발명의 다른 실시 예에 따른 저장 장치의 OVS 방어코드 과정을 예시적으로 보여주는 래더 다이 어그램이다. 도 1 내지 도 16 및 도 18을 참조하면, 저장 장치의 OVS 방어코드 과정은 다음과 같이 진행될 수 있다. 제어기(CNTL)는 OVS 방어코드 진입에 따른 제 1 리드 커맨드를 비휘발성 메모리 장치(NVM)에 전송할 수 있다 (S20). 비휘발성 메모리 장치(NVM)는 제 1 리드 커맨드에 응답하여 제 1 페이지 OVS 동작을 수행할 수 있다 (S21). 제 1 페이지 OVS 동작으로 읽혀진 데이터가 제어기(CNTL)로 전송되고(S22), 제어기(CNTL)는 특수 커맨드 를 비휘발성 메모리 장치(NVM)으로 전송하고(S23), 비휘발성 메모리 장치(NVM)는 특수 커맨드에 응답하여 제 1 페이지 OVS 동작에 대응하는 검출 정보(OVSDI)를 제어기(CNTL)로 출력할 수 있다(S24). 제어기(CNTL)는 제 1 페이지 OVS 동작의 검출 정보(OVSDI)를 이용하여 HRT(History Read Level Table)를 업데 이트 할 지를 판별할 수 있다. 제어기(CNTL)는 적어도 2개의 리드 레벨들에 대한 검출 정보(OVSDI)을 이용하여 워드라인에 연결된 메모리 셀들의 열화 방향성 및 열화 정도를 판별하고, 열화 방향성 혹은 열화 정도에 따라 제 2 페이지 리드 동작에 필요한 리드 레벨들에 대한 HRT 업데이트 여부를 결정할 수 있다(S25). 제어기(CNTL)는 검출 정보(OVSDI)와 OVST를 이용하여 HRT을 업데이트 할 수 있다(S26). 이후에, 제어기(CNTL)는 변경된 리드 레벨 정보와 함께 제 2 리드 커맨드를 다시 비휘발성 메모리 장치(NVM)으 로 전송할 수 있다(S27). 비휘발성 메모리 장치(NVM)는 제 2 리드 커맨드에 응답하여 변경된 리드 레벨들을 기 준으로 제 2 페이지 리드 동작을 수행할 수 있다(S28). 이후에 제 2 리드 동작에서 읽혀진 데이터가 제어기 (CNTL)로 전송될 수 있다(S29). 도 19는 본 발명의 또 다른 실시 예에 따른 저장 장치의 리드 동작을 예시적으로 보여주는 래더 다이어그램 이다. 도 1 내지 도 19을 참조하면, 저장 장치의 리드 동작은 다음과 같이 진행될 수 있다. 호스트는 어드레스(ADD)와 함께 리드 요청을 저장 장치(10, 도 1 참조)에 전송할 수 있다(S30). 저장 장치 의 제어기는 이러한 리드 요청을 수신하고, 히스토리 버퍼를 검색하여, 히스토리 리드 동작을 수행할 지 혹은 노멀 리드 동작을 수행할 지 결정하고, 결정된 동작에 대응하는 노멀/히스토리 리드 커맨드를 비휘발성 메 모리 장치(NVM, 100, 도 1 참조)에 전송할 수 있다(S31). 비휘발성 메모리 장치는 노멀/히스토리 리드 커 맨드에 응답하여 리드 동작을 수행하고, 그에 따른 읽혀진 데이터를 제어기로 전송할 수 있다(S32). 이후에, 제어기는 에러 정정 회로에 의해 읽혀진 데이터에 대한 에러 정정 동작을 수행할 수 있다 (S33). 에러가 없거나 에러가 정정 가능하다면, 읽혀진 데이터 혹은 정정된 데이터가 호스트로 전송될 수 있다 (S34-1). 반면에, 에러 정정이 가능하지 않다면, 제어기는 리드 리트라이 커맨드를 비휘발성 메모리 장치로 전 송할 수 있다(S34-2). 비휘발성 메모리 장치는 이러한 리드 리트라이 커맨드에 응답하여 OVS 방어코드를 수행하고, 읽혀진 데이터를 제어기로 전송할 수 있다(S35). 여기서 OVS 방어코드는, 도 1 내지 도 18에서 설명된 바와 같이 현재 페이지 OVS 동작의 검출 정보를 이용하여 다음 페이지 OVS 동작의 적어도 하나의 리드 레벨을 변경하고, 변경된 리드 레벨을 이용하여 다음 페이지 OVS 동작을 수행할 수 있다. 이후에, 제어기는 에러 정정 회로에서 읽혀진 데이터에 대한 에러 정정 동작을 다시 수행할 수 있다 (S36). 에러가 없거나 에러 정정 가능하다면, 읽혀진 데이터 혹은 정정된 데이터가 호스트로 전송될 수 있다 (S37). 이후에, 제어기는 리드 레벨 정보를 갖는 리드 리트라이 정보를 획득하기 위하여 특정 커맨드를 비 휘발성 메모리 장치로 전송할 수 있다(S38). 비휘발성 메모리 장치는 이러한 특정 커맨드에 응답하여 리드 리트라이 정보를 출력할 수 있다(S39). 이후에, 제어기는 리드 리트라이 정보를 이용하여 HRT을 최종적으로 업데이트할 수 있다(S40). 이후에, 호스트로부터 동일 어드레스(ADD)에 대한 리드 요청이 수신될 때(S41), 저장 장치는 HRT에 반영된 최적의 리드 레벨을 이용한 히스토리 리드 커맨드를 비휘발성 메모리 장치로 전송할 수 있다(S42). 도 20은 본 발명의 또 다른 실시 예에 따른 저장 장치의 리드 방법을 예시적을 보여주는 래더 다이어그램이다. 도 1 내지 도 20를 참조하면, 워드라인에 연결된 복수의 페이지들에 대한 리드 동작은 다음과 같이 진행될 수 있다. 제 1 OVS 리드 커맨드가 비휘발성 메모리 장치(NVM)에 전송될 수 있다(S50). 제 1 OVS 리드 커맨드에 응답하여 비휘발성 메모리 장치(NVM)은 OVS 센싱을 이용하여 제 1 페이지 리드 동작을 수행할 수 있다(S51). 제 1 페이지 리드 동작의 결과로써, 제 1 페이지 데이터 및 제 1 검출 정보는 제어기(CNTL)로 출력될 수 있다(S52). 제어기 (CNTL)는 제 1 검출 정보를 이용하여 HRT를 업데이트 할 수 있다. 이후에, 제 2 OVS 리드 커맨드가 비휘발성 메모리 장치(NVM)에 전송될 수 있다(S53). 제 2 OVS 리드 커맨드에 응답하여 비휘발성 메모리 장치(NVM)은 OVS 센싱을 이용하여 제 2 페이지 리드 동작을 수행할 수 있다(S54). 제 2 페이지 리드 동작의 결과로써, 제 2 페이지 데이터 및 제 2 검출 정보는 제어기(CNTL)로 출력될 수 있다 (S55). 제어기(CNTL)는 제 1 검출 정보 및 제 2 검출 정보를 이용하여 HRT를 업데이트 할 수 있다. 이후에, 제 3 OVS 리드 커맨드가 비휘발성 메모리 장치(NVM)에 전송될 수 있다(S53). 제 3 OVS 리드 커맨드에 응답하여 비휘발성 메모리 장치(NVM)은 OVS 센싱을 이용하여 제 3 페이지 리드 동작을 수행할 수 있다(S57). 제 3 페이지 리드 동작의 결과로써, 제 3 페이지 데이터 및 제 3 검출 정보는 제어기(CNTL)로 출력될 수 있다 (S58). 제어기(CNTL)는 제 1 검출 정보, 제 2 검출 정보, 및 제 3 검출 정보를 이용하여 HRT를 업데이트 할 수 있다. 한편, 도 7a 내지 도 20에서는 메모리 셀이 TLC인 것을 설명하고 있다. 하지만, 본 발명의 메모리 셀이 여기에 제한될 필요는 없다. 본 발명의 메모리 셀은 QLC(Quadruple Level Cell) 일 수 도 있다. 도 21은 본 발명의 실시 예에 따른 QLC의 페이지 리드에 대한 실시 예를 예시적으로 보여주는 도면이다. 도 21 을 참조하면, 16개의 상태들(E, S1 ~ S15)와 4 개의 페이지들(PG1, PG2, PG3, PG4)이 도시되고 있다. 제 1 페이지(PG1)는 제 6 리드 레벨(RD6), 제 12 리드 레벨(RD12), 및 제 14 리드 레벨(RD14)의 리드 동작들에 따라 제 1 비트를 포함할 수 있다. 제 2 페이지(PG2)는 제 3 리드 레벨(RD3), 제 8 리드 레벨(RD8), 제 10 리드 레벨(RD10), 및 제 13 리드 레벨 (RD13)의 리드 동작들에 따른 제 2 비트를 포함할 수 있다. 제 3 페이지(PG3)는 제 1 리드 레벨(RD1), 제 5 리드 레벨(R5), 제 7 리드 레벨(RD7), 및 제 11 리드 레벨 (RD11)의 리드 동작들에 따라 제 3 비트를 포함할 수 있다. 제 4 페이지(PG4)는 제 2 리드 레벨(RD2), 제 4 리드 레벨(RD4), 제 9 리드레벨(RD9) 및 제 14 리드 레벨 (RD14)의 리드 동작들에 따라 제 4 비트를 포함할 수 있다. 한편, 도 21에 도시된 4-비트 데이터의 인코딩은 본 발명을 제한하지 않는다고 이해되어야 할 것이다. 한편, 본 발명의 실시 예에 따른 저장 장치는 방어코드 전용의 인공 프로세서를 구비할 수도 있다. 도 22는 본 발명의 다른 실시 예에 따른 저장 장치를 예시적으로 보여주는 도면이다. 도 22을 참조하면, 저 장 장치는 도 1에 도시된 그것과 비교하여 OVS 방어코드를 제어하는 인공지능 프로세서를 포함할 수 있다. 이러한 인공지능 프로세서는 비휘발성 메모리 장치의 신뢰성 관리하도록 머신 러닝을 진행할 수 있다. 한편, 본 발명의 실시 예에 따른 비휘발성 메모리 장치는 C2C(chip to chip) 구조로 구현될 수 있다. 도 23은 본 발명의 실시 예에 따른 C2C 구조로 구현된 비휘발성 메모리 장치를 예시적으로 보여주는 도면 이다. 여기서 C2C 구조는 제 1 웨이퍼 상에 셀 영역(CELL)을 포함하는 상부 칩을 제작하고, 제 1 웨이퍼와 다른 제 2 웨이퍼 상에 주변 회로 영역(PERI)을 포함하는 하부 칩을 제작한 후, 상부 칩과 하부 칩을 본딩(bonding) 방식에 의해 서로 연결하는 것을 의미할 수 있다. 예를 들어, 본딩 방식은 상부 칩의 최상부 메탈층에 형성된 본딩 메탈과 하부 칩의 최상부 메탈층에 형성된 본딩 메탈을 서로 전기적으로 연결하는 방식일 수 있다. 실시 예에 있어서, 본딩 메탈이 구리(Cu)로 형성된 경우, 본딩 방식은 Cu-to-Cu 본딩 방식일 수 있다. 다른 실시 예에 있어서, 본딩 메탈은 알루미늄(Al) 혹은 텅스텐(W)으로 형성될 수도 있다. 비휘발성 메모리 장치의 주변 회로 영역(PERI)과 셀 영역(CELL) 각각은 외부 패드 본딩 영역(PA), 워드라 인 본딩 영역(WLBA), 및 비트라인 본딩 영역(BLBA)을 포함할 수 있다. 주변 회로 영역(PERI)은 제 1 기판, 층간 절연층, 제 1 기판에 형성되는 복수의 회로 소자들 (1220a, 1220b, 1220c), 복수의 회로 소자들(1220a, 1220b, 1220c) 각각과 연결되는 제 1 메탈층(1230a, 1230b, 1230c), 제 1 메탈층(1230a, 1230b, 1230c) 상에 형성되는 제 2 메탈층(1240a, 1240b, 1240c)을 포함할 수 있다. 실시 예에 있어서, 제 1 메탈층(1230a, 1230b, 1230c)은 상대적으로 비저항이 높은 텅스텐으로 형성될 수 있다. 실시 예에 있어서, 제 2 메탈층(1240a, 1240b, 1240c)은 상대적으로 비저항이 낮은 구리로 형성될 수 있다. 도 23에 도시된 바와 같이, 제 1 메탈층(1230a, 1230b, 1230c)과 제 2 메탈층(1240a, 1240b, 1240c)이 도시되 지만, 본 발명이 여기에 제한되지 않을 것이다. 제 2 메탈층(1240a, 1240b, 1240c) 상에 적어도 하나의 메탈층 이 더 형성될 수도 있다. 제 2 메탈층(1240a, 1240b, 1240c)의 상부에 형성되는 하나 이상의 메탈층 중 적어도 일부는, 제 2 메탈층(1240a, 1240b, 1240c)을 형성하는 구리와 다른 비저항을 갖는 알루미늄 등으로 형성될 수 도 있다. 실시 예에 있어서, 층간 절연층은 복수의 회로 소자들(1220a, 1220b, 1220c), 제 1 메탈층(1230a, 1230b, 1230c), 및 제 2 메탈층(1240a, 1240b, 1240c)을 커버하도록 제 1 기판 상에 배치될 수 있다. 실 시 예에 있어서, 층간 절연층은, 실리콘 산화물, 실리콘 질화물 등과 같은 절연 물질을 포함할 수 있다. 워드라인 본딩 영역(WLBA)의 제 2 메탈층(1240b) 상에 하부 본딩 메탈(1271b, 1272b)이 형성될 수 있다. 워드라 인 본딩 영역(WLBA)에서, 주변 회로 영역(PERI)의 하부 본딩 메탈(1271b, 1272b)은 셀 영역(CELL)의 상부 본딩 메탈(1371b, 1372b)과 본딩 방식에 의해 서로 전기적으로 연결될 수 있다. 실시 예에 있어서, 하부 본딩 메탈 (1271b, 1272b)과 상부 본딩 메탈(1371b, 1372b)은 알루미늄, 구리, 혹은 텅스텐 등으로 형성될 수 있다. 추가 로, 셀 영역(CELL)의 상부 본딩 메탈들(1371b, 1372b)은 제 1 메탈 패드들로 언급될 수 있고, 하부 본딩 메탈들 (1271b, 1272b)은 제 2 메탈 패드들로 언급될 수 있다. 셀 영역(CELL)은 적어도 하나의 메모리 블록을 포함할 수 있다. 실시 예에 있어서, 셀 영역(CELL)은 제 2 기판 과 공통 소스 라인을 포함할 수 있다. 제 2 기판 상에는, 제 2 기판의 상면에 수직하 는 방향(Z축 방향)을 따라 복수의 워드라인들(1331-338; 330)이 적층 될 수 있다. 실시 예에 있어서, 워드라인 들의 상부 및 하부 각각에는 스트링 선택 라인들과 접지 선택 라인이 배치될 수 있다. 실시 예에 있어서, 스트링 선택 라인들과 접지 선택 라인 사이에 복수의 워드라인들이 배치될 수 있다. 비트라인 본딩 영역(BLBA)에서, 채널 구조체(CH)는 제 2 기판의 상면에 수직하는 방향(Z-축 방향)으로 연 장되어 워드라인들, 스트링 선택 라인들, 및 접지 선택 라인을 관통할 수 있다. 채널 구조체(CH)는 데이 터 저장층, 채널층, 및 매립 절연층 등을 포함할 수 있으며, 채널층은 제 1 메탈층(1350c) 및 제 2 메탈층 (1360c)과 전기적으로 연결될 수 있다. 예컨대, 제 1 메탈층(1350c)은 비트라인 콘택일 수 있고, 제 2 메탈층 (1360c)은 비트라인일 수 있다. 실시 예 있어서, 비트라인(1360c)은 제 2 기판의 상면에 평행한 제 1 방 향(Y축 방향)을 따라 연장될 수 있다. 도 23에 도시된 바와 같이, 채널 구조체(CH)와 비트라인(1360c) 등이 배치되는 영역이 비트라인 본딩 영역 (BLBA)으로 정의될 수 있다. 실시 예에 있어서, 비트라인(1360c)은 비트라인 본딩 영역(BLBA)에서 주변 회로 영 역(PERI)에서 페이지 버퍼를 제공하는 회로 소자들(1220c)과 전기적으로 연결될 수 있다. 예를 들어, 비 트라인(1360c)은 주변 회로 영역(PERI)에서 상부 본딩 메탈(1371c, 1372c)과 연결될 수 있다. 여기서 상부 본딩 메탈(1371c, 1372c)은 페이지 버퍼의 회로 소자들(1220c)에 연결되는 하부 본딩 메탈(1271c, 1272c)과 연결될 수 있다. 워드라인 본딩 영역(WLBA)에서, 워드라인들은 제 1 방향에 수직하면서 제 2 기판 의 상면에 평행한 제 2 방향(X축 방향)을 따라 연장될 수 있다. 실시 예에 있어서, 워드라인 본딩 영역(WLBA)은 복수의 셀 콘택 플러그들(1341-1347; 1340)과 연결될 수 있다. 예를 들어, 워드라인들과 셀 콘택 플러그 들은, 제 2 방향을 따라 워드라인들 중 적어도 일부가 서로 다른 길이로 연장되어 제공하는 패드들 에서 서로 연결될 수 있다. 실시 예에 있어서, 워드라인들에 연결되는 셀 콘택 플러그들의 상부에 제 1 메탈층(1350b)과 제 2 메탈층(1360b)이 차례로 연결될 수 있다. 실시 예에 있어서, 셀 콘택 플러그들 은 워드라인 본딩 영역(WLBA)에서 셀 영역(CELL)의 상부 본딩 메탈(1371b, 1372b)과 주변 회로 영역 (PERI)의 하부 본딩 메탈(1271b, 1272b)을 통해 주변 회로 영역(PERI)과 연결될 수 있다.실시 예에 있어서, 셀 콘택 플러그들은 주변 회로 영역(PERI)에서 로우 디코더를 제공하는 회로 소 자들(1220b)과 전기적으로 연결될 수 있다. 실시 예에 있어서, 로우 디코더를 제공하는 회로 소자들 (1220b)의 동작 전압은, 페이지 버퍼를 제공하는 회로 소자들(1220c)의 동작 전압과 다를 수 있다. 예를 들어, 페이지 버퍼를 제공하는 회로 소자들(1220c)의 동작 전압이 로우 디코더를 제공하는 회로 소 자들(1220b)의 동작 전압보다 클 수 있다. 외부 패드 본딩 영역(PA)에 공통 소스 라인 콘택 플러그가 배치될 수 있다. 실시 예에 있어서, 공통 소스 라인 콘택 플러그는 금속, 금속 화합물, 혹은 폴리실리콘 등의 도전성 물질로 형성될 수 있다. 공통 소스 라인 콘택 플러그는 공통 소스 라인과 전기적으로 연결될 수 있다. 공통 소스 라인 콘택 플러그 상부에 제 1 메탈층(1350a)과 제 2 메탈층(1360a)이 차례로 적층될 수 있다. 예를 들어, 공통 소스 라인 콘택 플러그, 제 1 메탈층(1350a), 및 제 2 메탈층(1360a)이 배치되는 영역은 외부 패드 본딩 영역(PA)으 로 정의될 수 있다. 제 2 메탈층(1360a)은 상부 메탈 비아(1371a)에 전기적으로 연결될 수 있다. 상부 메탈 비 아(1371a)는 상부 메탈 패턴(1372a)에 전기적으로 연결될 수 있다. 한편, 외부 패드 본딩 영역(PA)에는 입출력 패드들(1205, 1305)이 배치될 수 있다. 도 23를 참조하면, 제 1 기 판의 하부에는 제 1 기판의 하면을 덮는 하부 절연막이 형성될 수 있다. 또한, 하부 절연막 상에 제 1 입출력 패드가 형성될 수 있다. 실시 예에 있어서, 제 1 입출력 패드는 제 1 입 출력 콘택 플러그를 통해 주변 회로 영역(PERI)에 배치되는 복수의 회로 소자들(1220a, 1220b, 1220c) 중 적어도 하나와 연결될 수 있다. 실시 예에 있어서, 제 1 입출력 패드는 하부 절연막에 의해 제 1 기판과 분리될 수 있다. 또한, 제 1 입출력 콘택 플러그와 제 1 기판 사이에는 측면 절연막 이 배치됨으로써 제 1 입출력 콘택 플러그와 제 1 기판을 전기적으로 분리할 수 있다. 도 23를 참조하면, 제 2 기판의 상부에 제 2 기판의 상면을 덮는 상부 절연막이 형성될 수 있다. 또한, 상부 절연막 상에 제 2 입출력 패드가 배치될 수 있다. 실시 예에 있어서, 제 2 입출 력 패드는 제 2 입출력 콘택 플러그, 하부 메탈 패턴(1272a), 및 하부 메탈 비아(1271a)를 통해 주 변 회로 영역(PERI)에 배치되는 복수의 회로 소자들(1220a, 1220b, 1220c) 중 적어도 하나와 연결될 수 있다. 실시 예에 있어서, 제 2 입출력 콘택 플러그가 배치되는 영역에 제 2 기판 및 공통 소스 라인 등이 배치되지 않을 수 있다. 또한, 제 2 입출력 패드는 제3 방향(Z축 방향)에서 워드라인들 과 오버랩 되지 않을 수 있다. 도 23를 참조하면, 제 2 입출력 콘택 플러그는 제 2 기판의 상면에 평행한 방향에서 제 2 기판과 분리될 수 있다. 또한, 제 2 입출력 콘택 플러그는 셀 영역 (CELL)의 층간 절연층을 관통하여 제 2 입출력 패드에 연결될 수 있다. 실시 예에 있어서, 제 2 입 출력 패드는 회로 소자(1220a)에 전기적으로 연결될 수 있다. 실시 예에 있어서, 제 1 입출력 패드와 제 2 입출력 패드는 선택적으로 형성될 수 있다. 예를 들어, 비휘발성 메모리 장치는 제 1 기판의 상부에 배치되는 제 1 입출력 패드만을 포함하거 나, 혹은 제 2 기판의 상부에 배치되는 제 2 입출력 패드만을 포함할 수 있다. 다른 실시 예에 있 어서, 비휘발성 메모리 장치는 제 1 입출력 패드와 제 2 입출력 패드를 모두 포함할 수도 있 다. 셀 영역(CELL)과 주변 회로 영역(PERI) 각각에 포함되는 외부 패드 본딩 영역(PA)과 비트라인 본딩 영역(BLBA) 각각에 최상부 메탈층의 메탈 패턴이 더미 패턴(dummy pattern)으로 존재하거나, 최상부 메탈층이 비어있을 수 있다. 본 발명의 실시 예에 따른 비휘발성 메모리 장치는 외부 패드 본딩 영역(PA)에서, 셀 영역(CELL)의 최상 부 메탈층에 형성된 상부 메탈 패턴(1372a)에 대응하여 주변 회로 영역(PERI)의 최상부 메탈층에 셀 영역(CEL L)의 상부 메탈 패턴(1372a)과 동일한 형태의 하부 메탈 패턴(1273a)을 형성할 수 있다. 주변 회로 영역(PERI) 의 최상부 메탈층에 형성된 하부 메탈 패턴(1273a)은 주변 회로 영역(PERI)에서 별도의 콘택과 연결되지 않을 수 있다. 이와 유사하게, 외부 패드 본딩 영역(PA)에서 주변 회로 영역(PERI)의 최상부 메탈층에 형성된 하부 메탈 패턴에 대응하여 셀 영역(CELL)의 상부 메탈층에 주변 회로 영역(PERI)의 하부 메탈 패턴과 동일한 형태의 상부 메탈 패턴을 형성할 수도 있다. 도 24는 본 발명의 실시 예에 따른 저장 장치가 적용된 전자 장치를 예시적으로 보여주는 도면이다. 도 24의 전 자 장치은 기본적으로 휴대용 통신 단말기(mobile phone), 스마트폰(smart phone), 태블릿 PC(tablet personal computer), 웨어러블 기기, 헬스케어 기기 혹은 IoT(internet of things) 기기와 같은 모바일(mobile) 시스템일 수 있다. 하지만 도 24의 전자 장치은 반드시 모바일 시스템에 한정되는 것은 아니고, 개인용 컴퓨터(personal computer), 랩탑(laptop) 컴퓨터, 서버(server), 미디어 재생기(media player) 혹은 내비게이션(navigation)과 같은 차량용 장비(automotive device) 등이 될 수도 있다. 도 24를 참조하면, 전자 장치은 메인 프로세서(main processor), 메모리(2200a, 2200b) 및 저장 장치(2300a, 2300b)를 포함할 수 있으며, 추가로 촬영 장치(image capturing device), 사용자 입력 장치 (user input device), 센서, 통신 장치, 디스플레이, 스피커, 전력 공급 장치 (power supplying device) 및 연결 인터페이스(connecting interface) 중 하나 이상을 포함할 수 있다. 메인 프로세서는 전자 장치의 전반적인 동작, 보다 구체적으로는 시스템을 이루는 다른 구성 요소들의 동작을 제어할 수 있다. 이와 같은 메인 프로세서는 범용 프로세서, 전용 프로세서 혹은 애플리 케이션 프로세서(application processor) 등으로 구현될 수 있다. 메인 프로세서는 하나 이상의 CPU 코어를 포함할 수 있으며, 메모리(2200a, 2200b) 및/혹은 저장 장치(2300a, 2300b)를 제어하기 위한 컨트롤러를 더 포함할 수 있다. 실시 예에 따라서는, 메인 프로세서 는 AI(artificial intelligence) 데이터 연산 등 고속 데이터 연산을 위한 전용 회로인 가속기 (accelerator) 블록을 더 포함할 수 있다. 이와 같은 가속기 블록은 GPU(Graphics Processing Unit), NPU(Neural Processing Unit) 및/혹은 DPU(Data Processing Unit) 등을 포함할 수 있으며, 메인 프로세 서의 다른 구성 요소와는 물리적으로 독립된 별개의 칩(chip)으로 구현될 수도 있다. 메모리(2200a, 2200b)는 시스템의 주기억 장치로 사용될 수 있으며, SRAM 및/혹은 DRAM 등의 휘발성 메모 리를 포함할 수 있으나, 플래시 메모리, PRAM 및/혹은 RRAM 등의 비휘발성 메모리를 포함할 수도 있다. 메모리 (2200a, 2200b)는 메인 프로세서와 동일한 패키지 내에 구현되는 것도 가능하다. 저장 장치(2300a, 2300b)는 전원 공급 여부와 관계 없이 데이터를 저장하는 비휘발성 저장 장치로서 기능할 수 있으며, 메모리(2200a, 2200b)에 비해 상대적으로 큰 저장 용량을 가질 수 있다. 저장 장치(2300a, 2300b)는 저 장 제어기(2310a, 2310b)와, 저장 제어기(2310a, 2310b)의 제어 하에 데이터를 저장하는 비휘발성(non- volatile memory, NVM) 저장(2320a, 2320b)를 포함할 수 있다. 비휘발성 메모리(2320a, 2320b)는 2D(2- dimensional) 구조 혹은 3D(3-dimensional) 구조의 V-NAND 플래시 메모리를 포함할 수 있으나, PRAM 및/혹은 RRAM 등의 다른 종류의 비휘발성 메모리를 포함할 수도 있다. 저장 장치(2300a, 2300b)는 메인 프로세서와는 물리적으로 분리된 상태로 전자 장치에 포함될 수도 있고, 메인 프로세서와 동일한 패키지 내에 구현될 수도 있다. 또한, 저장 장치(2300a, 2300b)는 SSD(solid state device) 혹은 메모리 카드(memory card)와 같은 형태를 가짐으로써, 후술할 연결 인터페이스 와 같은 인터페이스를 통해 전자 장치의 다른 구성 요소들과 탈부착 가능하도록 결합될 수도 있다. 이와 같은 저장 장치(2300a, 2300b)는 UFS(universal flash storage), eMMC(embedded multi-media card) 혹은 NVMe(non-volatile memory express)와 같은 표준 규약이 적용되는 장치일 수 있으나, 반드시 이에 한정되는 건 아니다. 촬영 장치는 정지 영상 혹은 동영상을 촬영할 수 있으며, 카메라(camera), 캠코더(camcorder) 및/혹은 웹 캠(webcam) 등일 수 있다. 사용자 입력 장치는 전자 장치의 사용자로부터 입력된 다양한 유형의 데이터를 수신할 수 있으며, 터치 패드(touch pad), 키패드(keyboard), 키보드(keyboard), 마우스(mouse) 및/혹은 마이크(microphone) 등일 수 있다. 센서는 전자 장치의 외부로부터 획득될 수 있는 다양한 유형의 물리량을 감지하고, 감지된 물리량 을 전기 신호로 변환할 수 있다. 이와 같은 센서는 온도 센서, 압력 센서, 조도 센서, 위치 센서, 가속도 센서, 바이오 센서(biosensor) 및/혹은 자이로스코프(gyroscope) 등일 수 있다. 통신 장치는 다양한 통신 규약에 따라 전자 장치 외부의 다른 장치들과의 사이에서 신호의 송신 및 수신을 수행할 수 있다. 이와 같은 통신 장치는 안테나, 트랜시버(transceiver) 및/혹은 모뎀(MODEM) 등 을 포함하여 구현될 수 있다. 디스플레이 및 스피커는 전자 장치의 사용자에게 각각 시각적 정보와 청각적 정보를 출력하 는 출력 장치로 기능할 수 있다.전력 공급 장치는 전자 장치에 내장된 배터리 및/혹은 외부 전원으로부터 공급되는 전력을 적절히 변환하여 전자 장치의 각 구성 요소들에게 공급할 수 있다. 연결 인터페이스는 전자 장치과, 전자 장치에 연결되어 전자 장치과 데이터를 주고받 을 수 있는 외부 장치 사이의 연결을 제공할 수 있다. 연결 인터페이스는 ATA(Advanced Technology Attachment), SATA(Serial ATA), e-SATA(external SATA), SCSI(Small Computer Small Interface), SAS(Serial Attached SCSI), PCI(Peripheral Component Interconnection), PCIe(PCI express), NVMe(NVM express), IEEE 1394, USB(universal serial bus), SD(secure digital) 카드, MMC(multi-media card), eMMC(embedded multi- media card), UFS(Universal Flash Storage), eUFS(embedded Universal Flash Storage), CF(compact flash) 카드 인터페이스 등과 같은 다양한 인터페이스 방식으로 구현될 수 있다. 일반적으로 동일 Page의 각 최적골은 유사한 방향으로 열화가 발생할 수 있다. 이 때문에, 본 발명의 실시 예에 따른 OVS 방어코드는, 각 State에 error가 발생할 때마다 OVS Table을 search 해서 History RD Table을 update 하지 말고, 1st RD에서 찾은 방향성으로 동일 Page 내 다른 State 골 정정에도 미리 반영해 놓아 error 확률을 미리 줄일 수 있다. 본 발명의 실시 예에 따른 OVS 방어코드는 OVS 동작 후 history RD table update할 때, R7과 R3의 OVS detect 결과가 동일할 때만, OVS의 all state offset 정보를 모두 History RD Table의 all state offset에 update 할 수 있다. 본 발명의 실시 예에 따른 OVS 방어코드는, R7과 R3의 OVS detect 결과가 다르면, 기존 방법처럼 OVS의 자기 state offset 정보만 History RD Table의 state offset에 update 할 수 있다. 본 발명의 실시 예에 따른 OVS 방어코드는 R7과 R3의 OVS detect 결과가 다르지만 같은 방향으로 움직이면, OVS 의 all state offset 정보를 모두 History RD Table의 all state offset에 update는 하되, 이 경우 과 보상되 지 않도록 적게 열화된 케이스 값으로 update 할 수 있다. 이로써, 본 발명의 OVS 방어코드는 에러 정정력을 향상시키고 및 Latency를 줄이고, Retry 진입율 감소시킬 수 있다. 본 발명의 실시 예에 따른 OVS 방어코드는 OVS 동작 후 history RD table update시, 1st RD detect 결과에 따 라 다른 state의 history RD table update 여부를 결정할 수 있다."}
{"patent_id": "10-2020-0145658", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "한편, 상술된 본 발명의 내용은 발명을 실시하기 위한 구체적인 실시 예들에 불과하다. 본 발명은 구체적이고 실제로 이용할 수 있는 수단 자체뿐 아니라, 장치 기술로 활용 할 수 있는 추상적이고 개념적인 아이디어인 기 술적 사상을 포함 할 것이다."}
{"patent_id": "10-2020-0145658", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하에 첨부되는 도면들은 본 실시 예에 관한 이해를 돕기 위한 것으로, 상세한 설명과 함께 실시 예들을 제공 한다. 도 1은 본 발명의 실시 예에 따른 저장 장치를 예시적으로 보여주는 도면이다. 도 2은 도 1에 도시된 비휘발성 메모리 장치를 예시적으로 보여주는 도면이다. 도 3은 도 1에 도시된 메모리 블록들 중 어느 하나의 메모리 블록(BLK1)에 대한 회로도를 예시적으로 보여주는 도면이다. 도 4는 본 발명의 실시 예에 따른 페이지 버퍼(PBi, i는 양의 정수)를 예시적으로 보여주는 도면이다. 도 5는 본 발명의 실시 예에 따른 제어기를 예시적으로 보여주는 도면이다. 도 6은 일반적인 저장 장치에서 OVS 이용한 리드 동작을 수행하는 과정을 예시적으로 보여주는 흐름도이다. 도 7a 및 도 7b는 본 발명의 실시 예에 따른 저장 장치에서 OVS 동작에 따른 리드 레벨을 추출하는 과정을 개념적으로 보여주는 도면들이다. 도 8a 및 도 8b는 산포골의 서로 다른 리드 레벨들과 그것들에 대응하는 디벨럽 시간들을 개념적으로 보여주는 도면들이다. 도 9는 본 발명의 실시 예에 따른 OVST을 이용하여 리드 레벨을 보정하는 과정을 개념적으로 보여주는 도면이다. 도 10a, 도 10b, 도 10c, 및 도 10d는 본 발명의 실시 예에 따른 저장 장치의 리드 방법을 개념적으로 설명 하는 도면들이다. 도 11a, 도 11b, 및 도 11c는 OVST을 HRT에 업데이트 여부를 판별하는 열화 방향성에 관련된 3 가지 경우를 예 시적으로 보여주는 도면들이다. 도 12a 및 도 12b는 열화 방향성이 동일하고, 서로 다른 검출 케이스가 지시될 때 HRT 업데이트에 대한 실시 예 를 예시적으로 보여주는 도면들이다. 도 13은 본 발명의 실시 예에 따른 저장 장치의 리드 방법을 예시적으로 보여주는 흐름도이다. 도 14는 도 13의 HRT를 업데이트 하는 과정(S180)을 좀 더 자세하게 보여주는 흐름도이다. 도 15a 및 도 15b는 본 발명의 실시 예에 따른 저장 장치의 리드 동작의 시퀀스를 예시적으로 보여주는 도 면들이다. 도 16은 본 발명의 다른 실시 예에 따른 저장 장치의 리드 방법을 예시적으로 보여주는 흐름도이다. 도 17은 본 발명의 실시 예에 따른 저장 장치의 OVS 방어코드 과정을 예시적으로 보여주는 래더 다이어그램 이다. 도 18은 본 발명의 다른 실시 예에 따른 저장 장치의 OVS 방어코드 과정을 예시적으로 보여주는 래더 다이어그램이다. 도 19는 본 발명의 또 다른 실시 예에 따른 저장 장치의 리드 동작을 예시적으로 보여주는 래더 다이어그램 이다. 도 20은 본 발명의 또 다른 실시 예에 따른 저장 장치의 리드 방법을 예시적을 보여주는 래더 다이어그램이다. 도 21은 본 발명의 실시 예에 따른 QLC의 페이지 리드에 대한 실시 예를 예시적으로 보여주는 도면이다. 도 22는 본 발명의 다른 실시 예에 따른 저장 장치를 예시적으로 보여주는 도면이다. 도 23은 본 발명의 실시 예에 따른 C2C 구조로 구현된 비휘발성 메모리 장치를 예시적으로 보여주는 도면 이다. 도 24는 본 발명의 실시 예에 따른 저장 장치가 적용된 전자 장치를 예시적으로 보여주는 도면이다."}
