{"patent_id": "10-2023-0085757", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0005701", "출원번호": "10-2023-0085757", "발명의 명칭": "재사용이 가능한 멀칭부재 및 멀칭부재를 이용한 작물 모니터링 시스템", "출원인": "최수안", "발명자": "최수안"}}
{"patent_id": "10-2023-0085757", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "재사용이 가능한 멀칭부재에 있어서,상기 멀칭부재의 일측에 구성되는 체결 돌기; 인접한 멀칭부재의 체결돌기와 결합하고 타측에 구성되는 체결홈;상기 체결돌기와 체결홈 사이에서 작물을 보호하는 멀칭영역;멀칭영역 하단부 설치되어 땅에 고정되는 복수개의 고정핀; 을 포함하고상기 멀칭영역은 작물이 관통하는 복수개의 생육공이 형성되는 것을 특징으로 하는 재사용이 가능한 멀칭부재."}
{"patent_id": "10-2023-0085757", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 멀칭부재는페트(PET), 폴리프로필렌(PP)을 포함하는 재활용 플라스틱으로 구성되고상기 멀칭영역; 은터널형 및 원형으로 형성되는 것을 특징으로 하는 재사용이 가능한 멀칭부재."}
{"patent_id": "10-2023-0085757", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 멀칭부재; 는온도, 습도, 조도를 포함하는 환경정보를 수집하는 환경센서;멀칭영역에 설치되어 작물의 생육 과정을 모니터링하는 카메라; 및상기 환경정보와 작물 생육과정 데이터를 관리자 단말로 전송하는 통신모듈; 을 포함하는 것을 특징으로 하는재사용이 가능한 멀칭부재."}
{"patent_id": "10-2023-0085757", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 멀칭부재; 는일측의 체결 돌기와 다른 멀칭부재 타측의 체결홈을 결합시켜 멀칭영역을 구성하거나, 멀칭영역을 확대하는 것을 특징으로 하는 재사용이 가능한 멀칭부재."}
{"patent_id": "10-2023-0085757", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 멀칭부재; 는멀칭부재의 상측과 하측 가장자리에 구성되어 흙으로 고정하는 고정영역; 을 포함하는 것을 특징으로 하는 재사용이 가능한 멀칭부재."}
{"patent_id": "10-2023-0085757", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "멀칭부재를 이용한 작물 모니터링 시스템에 있어서, 공개특허 10-2025-0005701-3-센서를 통해 온도, 조도, 습도를 포함하는 환경정보와 작물 모니터링 영상을 생성하는 멀칭부재; 및상기 멀칭부재로부터 환경정보와 작물 모니터링 영상을 수신하여, 작물 생육 상태를 파악하는 관리자 단말; 을포함하고,상기 멀칭부재; 는일측에 구성되는 체결 돌기; 인접한 멀칭부재의 체결돌기와 결합하고 타측에 구성되는 체결홈;상기 체결돌기와 체결홈 사이에서 작물을 보호하는 멀칭영역;멀칭영역 하단부에 복수개의 고정핀; 을 포함하고상기 멀칭영역은 작물이 관통하는 복수개의 생육공이 형성되는 것을 특징으로 하는 멀칭부재를 이용한 작물 모니터링 시스템."}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예에 따른 멀칭부재는 인접한 멀칭부재의 체결돌기와 결합하고 타측에 구성되는 체결홈; 체결돌기와 체결홈 사이에서 작물을 보호하는 멀칭영역; 멀칭영역 하단부 설치되어 땅에 고정되는 복수개의 고정핀; 을 포함하 멀칭 영역은 작물이 관통하는 복수개의 생육공이 형성된다. 실시예에서 멀칭부재는 페트(PET), 폴리프로필렌(PP)을 포 함하는 재활용 플라스틱으로 구성되고 멀칭영역; 은 터널형 및 원형으로 형성된다. 실시예에서 멀칭부재; 는 온 도, 습도, 조도를 포함하는 환경정보를 수집하는 환경센서; 멀칭영역에 설치되어 작물의 생육 과정을 모니터링하 는 카메라; 및 환경정보와 작물 생육과정 데이터를 관리자 단말로 전송하는 통신모듈; 을 포함한다."}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 멀칭부재 및 멀칭부재를 이용한 작물 모니터링 시스템에 관한 것으로 구체적으로, 재사용이 가능하고 센서를 통해 작물 성장 및 환경을 모니터링하는 멀칭부재 및 모니터링 시스템에 관한 것이다."}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 섹션에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술이 아니며, 이 섹션에 포함된다고 하여 종래 기술이라고 인정되는 것은 아니다. 멀칭(mulching)이란 밭의 표면을 플라스틱필름이나 볏짚, 수피, 자갈, 톱밥 등으로 피복하여 식물의 뿌리부위를 보호하여 작물의 생육을 촉진하는 것이다. 멀칭의 효과로는 잡초억제, 지온관리, 수분 증발 억제 및 빗물에 의 한 토양의 유실을 방지하며, 토양의 보비력 향상, 병원균 침입의 방지, 반사광에 의한 병충해 억제 및 착색증진 등이 있다. 멀칭에 사용되는 소재로는 토양을 덮을 수 있는 넓은 면적의 매트 또는 필름이 있다. 비용 및 설치 용이성 때문에 근래에는 멀칭필름이 널리 사용되며, 그의 재질로는 폴리에틸렌 또는 폴리염화비닐 등과 같은 인 공 합성수지 제품이 많이 사용되고 있다. 하지만, 기존의 멀칭부재는 작물 수확 후 다시 이용할 수 없고, 비바람 등 날씨의 영향을 크게 받는 문제가 있 다. 또한, 멀칭부재 설치를 위해서는 많은 노동력을 투입해야 한다. 또한, 종래에는 농업용 비닐 폐기물의 발생량 과 그 폐기물로 생기는 많은 문제가 있다. 비닐 등의 농업용폐기 물은 도시가 아닌 농촌에서 발생하여 노인들이 관리하고, 폐비닐을 처리하고 있고, 불법소각이나, 불법매립으로 인한 환경문제가 심각하다. 예컨대, 1년에 약 60만 톤의 농업용 폐비닐이 발생하며, 매년 증가하는 추세이다. 종래, 농업용 비닐은 비를 맞고 태양열에 그대로 노출되어 매립 후 쉽게 부식된다. 이때, 토양에 미세 비닐이 스며들어 비닐에 의한 화학물질이 토양에 영향을 주고, 토양에 생육하는 식물에 악영향 끼치게 된다. 더 나아가 식물을 사람이 섭취하게 되면, 건강에 치명적일 수 있다. 또한, 농촌의 폐비밀은 바람이 불어서 비닐이 전신주에 걸려 화재의 원인이 되거나, 차 앞유리를 가려 사고의 원인이 되기도 한다. 또한, 불법적으로 소각되는 하우스 비닐은 미세먼지와 산불의 원인이 되어 자연, 건강, 환경 측면에서 많은 손실을 일으킨다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 한국 특허등록 제10-1672044호 (2016.10.27) (특허문헌 0002) 2. 한국 특허공개 제10-2018-0053114호 (2018.05.21)"}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예에 따른 멀칭부재는 터널형, 원형, 반구형의 다양한 형대로 구성되며 체결돌기와 체결홈의 체결 상태에서 이용할 수 있도록 하여, 지면 및 작물과의 고정력을 향상시킨다. 또한, 실시예에 따른 멀칭부재는 작물 수확 후 다시 이용할 수 있다. 실시예에 따른 멀칭부재는 하부에 고정핀을 구비하고 일체형으로 구성되어 일체형 멀칭부 재를 고정핀으로 지면에 설치하여 고정시킬 수 있다. 또한, 실시예에 따른 멀칭부재는 센서를 통해, 환경정보 및 작물 상태정보를 수집하고 이를 서버로 전송하여 작 물상태와 환경정보를 모니터링할 수 있도록 한다. 또한, 실시예에서는 작물 모니터링 영상을 분석하여 멀칭 영 역의 훼손과 작물 이상상태를 신속하게 파악할 수 있도록 한다."}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 멀칭부재는 인접한 멀칭부재의 체결돌기와 결합하고 타측에 구성되는 체결홈; 체결돌기와 체결홈 사이에서 작물을 보호하는 멀칭영역; 멀칭영역 하단부 설치되어 땅에 고정되는 복수개의 고정핀; 을 포함하 멀 칭영역은 작물이 관통하는 복수개의 생육공이 형성된다. 실시예에서 멀칭부재는 페트(PET), 폴리프로필렌(PP)을 포함하는 재활용 플라스틱으로 구성되고 멀칭영역; 은 터널형 및 원형으로 형성된다. 실시예에서 멀칭부재; 는 온도, 습도, 조도를 포함하는 환경정보를 수집하는 환경센서; 멀칭영역에 설치되어 작 물의 생육 과정을 모니터링하는 카메라; 및 환경정보와 작물 생육과정 데이터를 관리자 단말로 전송하는 통신모 듈; 을 포함한다. 실시예에서 멀칭부재; 는 일측의 체결 돌기와 다른 멀칭부재 타측의 체결홈을 결합시켜 멀칭영역을 구성하거나, 멀칭영역을 확대하고, 멀칭부재의 상측과 하측 가장자리에 구성되어 흙으로 고정하는 고정영역; 을 포함한다."}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서와 같은 멀칭부재 및 멀칭부재를 이용한 작물 모니터링 시스템은 작물 수확 후 멀칭부재를 다시 사용할 수 있어 비닐 사용으로 인한 환경 문제를 개선할 수 있도록 한다. 또한, 실시예에 따른 멀칭부재는 설치 시 바람 등의 환경 영향을 받지 않고 별도의 작업이 필요 없어, 설치와 이용 편의를 향상시킨다. 또한, 실시예에 따른 멀칭부재를 이용한 모니터링 시스템은 멀칭부재에 설치된 센서를 통해 작물의 생육과정을 근접한 거리에서 모니터링하여, 작물 이상상태를 정확하게 파악할 수 있도록 한다. 실시예에 따른 멀칭 부재를 설치 후에 양쪽에 흙을 덮을 경우에는 비닐 멀칭 기계를 활용하여 흙을 덮을 수 있 다. 즉, 실시예에 따른 멀칭 부재를 이용하는 경우, 흙을 덮는데 필요한 노동력까지 기계를 사용하여 공급함으 로써, 멀칭 부재 설치 시 소요되는 시간적, 물리적 노력을 절감할 수 있다. 또한, 실시예에 따른 멀칭 부재를 이용하고, 씨앗을 파종하는 경우, 기존의 씨앗 파종기를 그대로 사용할 수 있 다. 즉, 실시예에 따른 멀칭 부재는 기존의 기계들을 바꿀 필요없이 그대로 사용할 수 있도록 하여, 멀칭부재 설치 및 다른 작업에 필요한 노동력을 절감시키고, 재 사용이 가능해 농촌의 폐비닐로 인한 환경문제를 해소할 수 있도록 한다."}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 특허청구범위에 기재된 발 명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 도면부호는 동일 구성 요소를 지칭한다. 본 발명의 실시 예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명의 실시 예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1내지 도 3은 실시예에 따른 멀칭부재를 나타낸 도면이다. 도 1은 실시예에 따른 밭작물에 적합한 터널형 멀칭부재를 나타낸 도면이다. 도 1을 참조하면, 실시예에 따른 재사용이 가능한 멀칭부재는 멀칭부재의 일측에 구성되는 체결 돌기. 인접한 멀칭부재의 체결돌기와 결합하 고 타측에 구성되는 체결홈, 체결돌기와 체결홈 사이에서 작물을 보호하는 멀칭영역, 멀칭영역 하단부에 구성되어 멀칭부재를 땅에 고정시키는 복수개의 고정핀을 포함한다. 실시예에서 멀칭영역 은 작물이 관통하는 복수개의 생육공을 포함한다. 실시예에서 멀칭영역은 일측의 체결 돌기와 다른 멀칭부재 타측의 체결홈을 결합시켜 멀칭영역을 구성하거나, 멀칭영역을 확대할 수 있다. 도 2는 실시예에 따른 타원형 멀칭부재를 나타낸 도면이다. 도 2를 참조하면, 타원형 멀칭부재는 멀칭부재 각각이 좌측(L)과 우측(R)에서 좌측 멀칭부재(L)의 체결돌기와 우측 멀칭부재(R)의 체결 홈이 나무 줄기를 감싸는 형태로 결합하여 나무 뿌리에 대한 멀칭 기능을 제공할 수 있다. 도 3은 고정영역으로 땅에 고정되는 멀칭부재를 나타낸 도면이다. 도 3을 참조하면, 실시예에서 멀칭부재는 멀칭부재의 상측과 하측 가장자리에 구성되어 흙으로 고정하는 고정영 역(61,62)을 포함할 수 있다. 실시예에서는 고정영역(61,62)에 흙, 벽돌 등의 고정물체를 얹어 멀칭부재를 고정 시킬 수 있다. 실시예에 따른 멀칭 부재를 설치 후에 양쪽에 흙을 덮을 경우에는 비닐 멀칭 기계를 활용하여 흙을 덮을 수 있 다. 즉, 실시예에 따른 멀칭 부재를 이용하는 경우, 흙을 덮는데 필요한 노동력까지 기계를 사용하여 공급함으 로써, 멀칭 부재 설치 시 소요되는 시간적, 물리적 노력을 절감할 수 있다. 또한, 실시예에 따른 멀칭 부재를 이용하고, 씨앗을 파종하는 경우, 기존의 씨앗 파종기를 그대로 사용할 수 있 다. 즉, 실시예에 따른 멀칭 부재는 기존의 기계들을 바꿀 필요없이 그대로 사용할 수 있도록 하여, 멀칭부재 설치 및 다른 작업에 필요한 노동력을 절감시키고, 재 사용이 가능해 농촌의 폐비닐로 인한 환경문제를 해소할 수 있도록 한다. 실시예에서 멀칭부재는 재활용플라스틱으로 구성될 수 있다. 실시예에서 재활용 플라스틱은 PET(페트), HDPE(고 밀도 폴리에틸렌), PVC(폴리비닐 클로라이드), LDPE (저밀도 폴리에틸렌), PP (폴리프로필렌), PS(폴리스티렌) 등으로 구성될 수 있고 이에 한정되지 않는다. 또한, 멀칭영역은 터널형 및 원형으로 형성될 수 있다. 또한, 실시예에 따른 멀칭 부재는 물공급관 연결 통로를 더 포함하여 구성될 수 있다. 물 공급관 연결 통로는 멀칭 부재의 양 측면 에지 부분에 홈 형태로 형성될 수 있다. 실시예에서는 홈으로 양측에 형성된 물공급관 연 력 통로에 물을 공급하는 관을 연결하는 경우, 허수를 깔아 놓지 않아도 작물에 쉽게 물을 줄 수 있도록 한다. 또한, 실시예에서는 양쪽 부분에서 어느 한쪽을 마개로 막고 다른 한쪽에서 물을 공급하면 물이 자동으로 작물 에 공급될 수 있도록 한다. 또한, 실시예에서는 물 공급 호수를 이용하여서 물 공급은 물론 제초제나 각종농약, 비료까지 한번에 줄 수 있도록 한다. 예컨대, 물호수의 방향을 땅속아래로 향하게 할 수 있고, 작물 쪽으로 향 하거나, 하늘 쪽으로 향하게 조절할 수 있다. 구체적으로, 농약을 뿌릴 때는 하늘 쪽으로 돌려서 뿌릴 수 있도 록 하고 물공급을 할 때는 작물의 뿌리 쪽으로 향하게 한다. 또한, 실시예에서는 호수를 2줄이상으로 만들어서 땅 속물 공급, 땅 위쪽 농약공급 라인을 다른 라인으로 구성할 수 있다. 실시예에서는 물 공급 라인 및 농약 공 급 라인을 이용하여, 종래와 같이 호수를 깔아 놓은 후 2번 2번에 걸친 반복 노동을 할 필요 없이 한번에 물과 농약을 공급할 수 있다. 현재 우리나라는 농촌 노동력의 부족으로 외국인 노동자에 의존하고 있는 실정인데 실 시예를 통해, 농촌의 노동력 부족 문제를 해결할 수 있다. 또한, 실시예에서는 호수를 2줄이상 제공하여 땅속 물 공급, 땅 위쪽 농약 공급 라인을 다른 라인으로 제공할 수 있다. 이를 통해, 호스를 깐 후 반복 작업할 필요 없이 한번에 물을 공급할 수 있다. 또한, 기존 고무 호스는 햇볕에 취약하여 1내지 2년 사용 후 폐기하는데 반해, 실시예에서는 호수관을 제공하여 물을 공급하여 폐기 호스가 발생하지 않도록 한다. 또한, 농촌 노동력이 부족해 외국인 노동자에 의존하는 실정 에서 물공급에 필요한 노동력을 감소시킬 수 있다. 도 4는 실시예에 따른 멀칭부재를 이용한 작물 모니터링 시스템 구성을 나타낸 도면이다. 도 4를 참조하면, 실시예에 따른 멀칭부재를 이용한 작물 모니터링 시스템은 멀칭부재 및 관리자 단말 을 포함하여 구성될 수 있다. 실시예에서 멀칭부재는 땅에 고정되어 작물의 뿌리를 보호한다. 실시예에서 멀칭부재는 센서를 통해 환경정보와 작물 모니터링 영상을 생성하여 관리자 단말로 전송한다. 관리자 단말은 환경정보와 작물 모니터링 영상을 수신하여, 근거리에서 작물을 관찰한 모니터링 영상과 환경정보를 통해, 작물 이상상태를 신속 하게 파악할 수 있다. 도 5는 실시예에 따른 멀칭부재의 데이터 처리 구성을 나타낸 도면이다. 도 5를 참조하면, 실시예에 따른 멀칭부재는 환경센서, 카메라 및 통신모듈을 포함하여 구성될 수 있다. 본 명세서에서 사용되는 '모듈' 라는 용어는 용어가 사용된 문맥에 따라서, 소프트웨어, 하드웨어 또 는 그 조합을 포함할 수 있는 것으로 해석되어야 한다. 예를 들어, 소프트웨어는 기계어, 펌웨어(firmware), 임 베디드코드(embedded code), 및 애플리케이션 소프트웨어일 수 있다. 또 다른 예로, 하드웨어는 회로, 프로세서, 컴퓨터, 집적 회로, 집적 회로 코어, 센서, 멤스(MEMS; Micro-Electro-Mechanical System), 수동 디 바이스, 또는 그 조합일 수 있다. 환경센서는 온도센서, 습도센서, 조도센서를 통해, 온도, 습도, 조도를 포함하는 환경정보를 수집한다. 카 메라는 멀칭부재의 멀칭영역에 설치되어 작물의 생육 과정을 모니터링한다. 통신모듈은 환경정보와 작물 생육과정 데이터를 관리자 단말로 전송한다. 도 6은 실시예에 따른 관리자 단말의 데이터 처리 구성을 나타낸 도면이다. 도 6을 참조하면, 실시예에 다른 관리자 단말은 수집부, 분석부 및 알림부를 포함하여 구 성될 수 있다. 수집부는 멀칭부재로부터 온도, 습도, 조도 등의 환경정보와 작물의 생육 모니터링 영상을 수집한다. 분석부는 수집된 환경정보와 모니터링 영상을 분석하여 작물의 생장상태를 파악한다. 실시예에서 분석부 는 인공지능 머신러닝을 통한 이미지 인식(image recognition)과정을 통해 품종의 작물 모니터링 영상 및 작물 모니터링 이미지를 기준으로 작물 생장상태를 파악할 수 있다. 인공지능 이미지 인식은 기계가 마치 사람 처럼 사진으로부터 사물을 인식하고 장면을 이해하는 것으로, 컴퓨터 비전 기술 중 하나에 해당한다. 실시예에 서는 이미지 인식을 위해, 이미지에 포함된 작물의 개체 분류(classification), 검출(detection) 및 개체를 픽 셀 단위로 식별하여 분할(segmentation)하는 데이터 처리 과정을 수행한다. 실시예에서 분석부는 노이즈 대응 외 학습하지 못한 패턴 처리를 위해 학습 외 분포 데이터 탐지(out of distribution detection)과정을 수 행한다. 학습 외 분포 데이터 탐지는 인공지능에 입력된 이미지가 학습된 확률분포 데이터 인지 아닌지 식별하 는 것이다. 실시예에서는 학습 외 분포 데이터 탐지를 통해 인공 신경망이 판단하기 어려운 이미지를 걸러내거나 예외 처리하여 안정성과 신뢰성을 높일 수 있도록 한다. 실시예에서는 학습 외 분포 데이터 탐지를 위해서 딥러닝 판정에 대해 얼마나 확신(confidence)하는지를 나타내는 확률 값을 보정(calibration)하거나 학습 외 분 포 데이터를 생성적 대립 신경망(GAN, Generative Adversarial Network)으로 생성하고 학습하여 탐지 정확도를 향상시킬 수 있도록 한다. 또한, 실시예에서는 이미지 인식 정확도를 유지하면서 모델의 크기를 줄이기 위해, 연산을 간소화하는 경량 딥 러닝 기술을 이용하여 체형박스를 최종 확정할 수 있도록 한다. 실시예에서는 이미지 인식을 위해 콘볼루션 신 경망(CNN, Convolution Neural Network)에서 콘볼루션 필터를 변형하여 연산 차원을 축소(Reduction)하거나 큰 영향이 없는 신경망의 가중치(weight)를 삭제하는 가지치기, 가중치 값의 부동 소수점을 줄여 연산을 간소화하 는 양자화 과정을 수행하여 데이터 경량화를 가능하도록 한다. 또한, 실시예에서는 미리 학습시킨 큰 신경망의 출력을 작은 신경망에서 모방 학습하도록 하여 연산을 간소화하며 정확도를 유지할 수 있도록 한다. 또한, 실시예에서 분석부는 작물 모니터링 영상 분석 결과를 기반으로, 작물 이상상태를 판단할 수 있다. 예컨대, 분석부는 작물 생장 과정에 따른 작물의 크기, 색, 형상 등을 정상작물과 비교하고 비교 결과에 따라 작물 이상상태를 판단할 수 있다. 구체적으로 분석부는 작물의 색이 작물의 정상적인 색이 아닌 노란 색이나 흰색을 띄거나, 작물의 잎에 일정 개수 이상의 구멍 등 훼손영역을 인식하는 경우, 이상상태로 판단할 수 있다. 또한, 실시예에서 분석부는 작물 모니터링 영상에서 멀칭영역을 분리하고, 분리된 멀칭영역을 분석하여 멀 칭영역의 훼손 여부를 판단할 수 있다. 또한, 분석부은 수집된 환경정보 중 미리 설정된 정상범위를 벗어나는 이상 데이터를 검출하고, 이상 데이 터 검출 시간과 날짜를 추출한다. 알림부는 분석된 작물의 생장상태를 디스플레이 하고, 환경정보에서 이 상 데이터가 발생하는 경우, 이상 데이터가 발생한 시간과 날짜 정보를 출력한다. 또한, 실시예에서 알림부 는 분석부에서 작물의 생장상태가 이상상태로 판단되는 경우, 작물 이상상태를 알리는 메시지를 출력 할 수 있다. 또한, 알림부는 분석부에 의해 멀칭영역 훼손이 파악되는 경우, 훼손된 멀칭영역의 위치 를 출력하여 관리자에게 알릴 수 있다. 이하에서는 멀칭부재를 이용한 작물 모니터링 방법에 대해서 차례로 설명한다. 실시예에 따른 멀칭부재를 이용 한 작물 모니터링 방법의 작용(기능)은 멀칭부재를 이용한 작물 모니터링 시스템의 기능과 본질적으로 같은 것 이므로 도 1 내지 도 6과 중복되는 설명은 생략하도록 한다. 도 7은 실시예에 따른 멀칭부재를 이용한 작물 모니터링 시스템의 신호 흐름도이다. 도 7을 참조하면, S100 단계에서는 멀칭부재에서 센서를 통해 온도, 조도, 습도를 포함하는 환경정보와 작물 모 니터링 영상을 생성한다. S200 단계에서는 관리자 단말에서 멀칭부재로부터 환경정보와 작물 모니터링 영상을 수신하여, 작물 생육 상태를 파악한다. 실시예에 따른 멀칭부재는 터널형, 원형, 반구형의 다양한 형대로 구성되며 체결돌기와 체결홈의 체결 상태에서 이용할 수 있도록 하여, 지면 및 작물과의 고정력을 향상시킨다. 또한, 실시예에 따른 멀칭부재는 작물 수확 후 다시 이용할 수 있다. 실시예에 따른 멀칭부재는 하부에 고정핀을 구비하고 일체형으로 구성되어 일체형 멀칭부 재를 고정핀으로 지면에 설치하여 고정시킬 수 있다. 또한, 실시예에 따른 멀칭부재는 센서를 통해, 환경정보 및 작물 상태정보를 수집하고 이를 서버로 전송하여 작 물상태와 환경정보를 모니터링할 수 있도록 한다. 또한, 실시예에서는 작물 모니터링 영상을 분석하여 멀칭 영 역의 훼손과 작물 이상상태를 신속하게 파악할 수 있도록 한다. 이상에서와 같은 멀칭부재 및 멀칭부재를 이용한 작물 모니터링 시스템은 작물 수확 후 멀칭부재를 다시 사용할 수 있어 비닐 사용으로 인한 환경 문제를 개선할 수 있도록 한다. 또한, 실시예에 따른 멀칭부재는 설치 시 바람 등의 환경 영향을 받지 않고 별도의 작업이 필요 없어, 설치와 이용 편의를 향상시킨다. 또한, 실시예에 따른 멀칭부재를 이용한 모니터링 시스템은 멀칭부재에 설치된 센서를 통해 작물의 생육과정을 근접한 거리에서 모니터링하여, 작물 이상상태를 정확하게 파악할 수 있도록 한다."}
{"patent_id": "10-2023-0085757", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "개시된 내용은 예시에 불과하며, 특허청구범위에서 청구하는 청구의 요지를 벗어나지 않고 당해 기술분야에서 통상의 지식을 가진 자에 의하여 다양하게 변경 실시될 수 있으므로, 개시된 내용의 보호범위는 상술한 특정의실시예에 한정되지 않는다."}
{"patent_id": "10-2023-0085757", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1내지 도 3은 실시예에 따른 멀칭부재를 나타낸 도면 도 4는 실시예에 따른 멀칭부재를 이용한 작물 모니터링 시스템 구성을 나타낸 도면 도 5는 실시예에 따른 멀칭부재의 데이터 처리 구성을 나타낸 도면 도 6은 실시예에 따른 관리자 단말의 데이터 처리 구성을 나타낸 도면"}
