{"patent_id": "10-2020-0037295", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0120504", "출원번호": "10-2020-0037295", "발명의 명칭": "척추 측만증 평가 방법 및 이를 이용한 척추 측만증 평가용 디바이스", "출원인": "연세대학교 산학협력단", "발명자": "김강철"}}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "프로세서에 의해 구현되는 척추 측만증 평가 방법으로서,개체의 복수의 척추뼈 (vertebrae) 를 포함하는 척추 의료 영상을 수신하는 단계;척추뼈에 대한 벡터 필드 (vector field) 를 결정하도록 구성된 기울기 예측 모델을 이용하여, 상기 복수 개의척추뼈에 대한 벡터 필드를 결정하는 단계; 상기 벡터 필드에 기초하여 복수의 척추뼈 각각에 대한 기울기를 결정하는 단계, 및상기 기울기에 기초하여 상기 척추 측만증 발병 여부를 평가하는 단계를 포함하는, 척추 측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 각각에 대한 기울기를 결정하는 단계는,상기 벡터 필드의 평균값에 기초하여, 상기 복수의 척추뼈 각각에 대한 척추-기울기 벡터 (vertebral-tiltvector) 를 결정하는 단계, 및상기 척추-기울기 벡터에 기초하여 상기 복수의 척추뼈 각각에 대한 기울기를 결정하는 단계를 포함하는, 척추측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 척추 의료 영상을 수신하는 단계 이후에 수행되는, 의료 영상 내에서 척추뼈를 결정하도록 구성된 척추뼈 예측 모델을 이용하여, 상기 척추 의료 영상 내에서 상기복수의 척추뼈를 결정하는 단계를 더 포함하는, 척추 측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 척추뼈 예측 모델은,척추뼈에 대한 중심점을 결정하도록 더 구성되고,상기 복수의 척추뼈를 결정하는 단계는,상기 척추뼈 예측 모델을 이용하여, 상기 복수의 척추뼈 각각에 대한 중심점을 결정하는 단계를 포함하는, 척추측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 각각에 대한 기울기를 결정하는 단계는,상기 중심점 및 상기 각각에 대한 기울기를 기초로, 상기 복수의 척추뼈 각각에 대한 척추-기울기 벡터(vertebral-tilt vector) 를 결정하는 단계, 및상기 척추-기울기 벡터에 기초하여 상기 복수의 척추뼈 각각에 대한 기울기를 결정하는 단계를 포함하는, 척추측만증 평가 방법.공개특허 10-2021-0120504-3-청구항 6 제5항에 있어서,상기 척추 의료 영상에 대하여 상기 중심점 또는 상기 척추-기울기 벡터를 표시하여 제공하는 단계를 더 포함하는, 척추 측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 척추뼈 예측 모델은,의료 영상 내에서 척추뼈로 예측되는 신뢰성 맵 (confidence map) 을 생성하도록 더 구성되고,상기 각각에 대한 중심점을 결정하는 단계는,상기 척추뼈 예측 모델을 이용하여 상기 신뢰성 맵을 생성하는 단계, 및상기 신뢰성 맵 내에서 중심점을 결정하는 단계를 포함하는, 척추 측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 기울기 예측 모델은 인풋 레이어 (input layer) 및 아웃풋 레이어 (output layer) 를 포함하고,상기 인풋 레이어는,입력된 상기 척추 의료 영상을 복수의 스케일로 다운 샘플링 (down sampling) 하도록 구성되고,상기 아웃풋 레이어는,복수의 스케일로 다운 샘플링된 상기 척추 의료 영상 각각에 대하여 상기 벡터 필더를 결정하도록 구성된, 척추측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 척추 측만증 발병 여부를 평가하는 단계는,상기 각각에 대한 기울기에 기초하여 PT (proximal-thoracic), MT (main thoracic) 및 TL (thoracic-lumbar)중 적어도 하나의 콥 각을 결정하는 단계, 및상기 콥 각에 기초하여 상기 척추 측만증 발병 여부를 평가하는 단계를 포함하는, 척추 측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 콥 각을 제공하는 단계를 더 포함하는, 척추 측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 척추 의료 영상은, 척추 정면 방사선 영상인, 척추 측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "개체의 복수의 척추뼈 (vertebrae) 를 포함하는 척추 의료 영상을 수신하도록 구성된 수신부, 및프로세서를 포함하고,공개특허 10-2021-0120504-4-상기 프로세서는, 척추뼈에 대한 벡터 필드 (vector field) 를 결정하도록 구성된 기울기 예측 모델을 이용하여, 상기 복수 개의척추뼈에 대한 벡터 필드를 결정하고, 상기 벡터 필드에 기초하여 복수의 척추뼈 각각에 대한 기울기를 결정하고, 상기 기울기에 기초하여 상기 척추 측만증 발병 여부를 평가하도록 구성된, 척추 측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 프로세서는, 상기 벡터 필드의 평균값에 기초하여, 상기 복수의 척추뼈 각각에 대한 척추-기울기 벡터 (vertebral-tiltvector) 를 결정하고, 상기 척추-기울기 벡터에 기초하여 상기 복수의 척추뼈 각각에 대한 기울기를 결정하도록더 구성된, 척추 측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 프로세서는, 의료 영상 내에서 척추뼈를 결정하도록 구성된 척추뼈 예측 모델을 이용하여, 상기 척추 의료 영상 내에서 상기복수의 척추뼈를 결정하도록 더 구성된, 척추 측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 척추뼈 예측 모델은,척추뼈에 대한 중심점을 결정하도록 더 구성되고,상기 프로세서는, 상기 척추뼈 예측 모델을 이용하여, 상기 복수의 척추뼈 각각에 대한 중심점을 결정하도록 더 구성된, 척추 측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 프로세서는,상기 중심점 및 상기 각각에 대한 기울기를 기초로, 상기 복수의 척추뼈 각각에 대한 척추-기울기 벡터(vertebral-tilt vector) 를 결정하고, 상기 척추-기울기 벡터에 기초하여 상기 복수의 척추뼈 각각에 대한 기울기를 결정하도록 더 구성된, 척추 측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 척추 의료 영상에 대하여 상기 중심점 또는 상기 척추-기울기 벡터를 표시하여 제공하도록 구성된 표시부를 더 포함하는, 척추 측만증 평가 방법."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 척추뼈 예측 모델은,의료 영상 내에서 척추뼈로 예측되는 신뢰성 맵 (confidence map) 을 생성하도록 더 구성되고,상기 프로세서는,공개특허 10-2021-0120504-5-상기 척추뼈 예측 모델을 이용하여 상기 신뢰성 맵을 생성하고, 상기 신뢰성 맵 내에서 중심점을 결정하도록 더구성된, 척추 측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12항에 있어서,상기 기울기 예측 모델은 인풋 레이어 (input layer) 및 아웃풋 레이어 (output layer) 를 포함하고,상기 인풋 레이어는,입력된 상기 척추 의료 영상을 복수의 스케일로 다운 샘플링 (down sampling) 하도록 구성되고,상기 아웃풋 레이어는,복수의 스케일로 다운 샘플링된 상기 척추 의료 영상 각각에 대하여 상기 벡터 필더를 결정하도록 구성된, 척추측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제12항에 있어서,상기 프로세서는, 상기 각각에 대한 기울기에 기초하여 PT (proximal-thoracic), MT (main thoracic) 및 TL (thoracic-lumbar)중 적어도 하나의 콥 각을 결정하고, 상기 콥 각에 기초하여 상기 척추 측만증 발병 여부를 평가하도록 구성된,척추 측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,상기 콥 각을 제공하도록 구성된, 표시부를 더 포함하는, 척추 측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제12항에 있어서,상기 척추 의료 영상은, 척추 정면 방사선 영상인, 척추 측만증 평가용 디바이스."}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 프로세서에 의해 구현되는 척추 측만증 평가 방법으로서, 개체의 복수의 척추뼈 (vertebrae) 를 포함 하는 척추 의료 영상을 수신하는 단계, 척추뼈에 대한 벡터 필드 (vector field) 를 결정하도록 구성된 기울기 예측 모델을 이용하여, 복수 개의 척추뼈에 대한 벡터 필드를 결정하는 단계, 벡터 필드에 기초하여 복수의 척추 뼈 각각에 대한 기울기를 결정하는 단계, 및 기울기에 기초하여 척추 측만증 발병 여부를 평가하는 단계를 포함 하는, 척추 측만증 평가 방법 및 이를 이용한 척추 측만증 평가용 디바이스를 제공한다."}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 척추 측만증 평가 방법 및 이를 이용한 디바이스에 관한 것으로, 보다 구체적으로는 의료 영상에 기 초하여 척추 측만증을 예측하도록 구성된 방법 및 디바이스에 관한 것이다."}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "의료 영상 장치는 대상 개체의 내부 구조를 영상으로 획득하기 위한 장비이다. 이러한 의료 영상 장치는 인체 에 고통을 주지 않고 실시되는 비침습 검사 장치로서, 신체 내의 구조적 세부사항, 내부 조직 및 유체의 흐름 등을 촬영 및 처리하여 의료인에게 보여준다. 의료인들은 의료 영상 장치에서 출력되는 의료 영상을 이용하여 환자의 건강 상태 및 질병을 진단할 수 있다. 의료 영상 장치로는 자기 공명 영상을 제공하기 위한 자기 공명 영상 (MRI, magnetic resonance imaging) 장치, 컴퓨터 단층 촬영 (CT, Computed Tomography) 장치, 엑스레이 (X-ray) 장치, 및 초음파 (ultrasound) 진 단 장치 등이 있다. 이러한 의료 영상 장치로부터 획득한 의료 영상들은, 질환의 진단에 이용될 수 있다. 한편, 의료 영상에 기초한 진단에 있어서, 계측 과정은 다양한 병소의 진단, 나아가 질환의 진행 단계의 결정에 있어서 매우 중요할 수 있다. 이때, 정확하고 재현성 높은 계측을 위해, 특히 2D의 평면 의료 영상에 기초한 계측에 있어서 해부학적 랜드마크와 같은 기준점이 중요할 수 있다. 그러나, 해부학적 랜드마크들은 진단 개체 마다 다른 위치에 존재할 수 있고, 개체의 자세, 의료인의 숙련도와 같은 외부적 요인에 따라 다르게 결정될 수있다. 이러한 이유로, 의료 영상에 기초한 계측, 특히 2D의 평면 의료 영상에 기초한 계측 분석은, 정확도 및 재현성이 떨어질 수 있다. 이때, 계측치의 부정확함은 질환의 진단, 질환의 진행의 평가 결과의 신뢰도를 떨어 뜨릴 수 있다. 특히, 척추 측만증의 경우, 컴퓨터 단층 촬영, 자기 공명 영상 촬영 및 엑스레이 영상 촬영을 통해 측만 각인 콥 각 (Cobb angle) 을 계측하여 진단이 가능하나, 진단을 하는 의료인의 주관이 개입될 가능성이 커서 측정의 관측자 간, 관측자 내 재현성이 낮다. 재현성이 낮으므로 척추 측만증은 콥 각이 5° 이상 증가할 때 측만증이 악화된 것으로 판정하게 되는데, 재현성이 담보된다면 이보다 작은 오차도 질환의 진행으로 해석될 수 있는 여 지가 있어 설명 가능한 자동화에 의한 재현성의 확보가 매우 중요하다. 의료 서비스의 향상 등을 위하여 진단의 정확성이 더욱 요구되고 있음에 따라, 의료 영상에 기초한 척추 측만증 을 높은 정확도로 평가할 수 있는 새로운 평가 방법의 개발이 요구된다. 발명의 배경이 되는 기술은 본 발명에 대한 이해를 보다 용이하게 하기 위해 작성되었다. 발명의 배경이 되는 기술에 기재된 사항들이 선행기술로 존재한다고 인정하는 것으로 이해되어서는 안 된다."}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "한편, 연구자들은 인공지능 알고리즘 기반의 시스템을 도입함으로써 종래의 의료 영상에 기초한 척추 측만증 평 가 시스템이 갖는 한계 및 문제점들을 보완하고자 하였다. 그 결과, 영상 분할 기반의 방법 (image segmentation-based method) 에 의한 척추 측만증 평가 시스템이 제안 되었다. 척추 측만증 평가 시스템은 영상에서 각 척추뼈를 분할한 후, 이로부터 각 경계면을 추출하고, 이에 대하여 평행한 선을 그어 척추뼈의 기울기를 추정한 후 콥 각을 산출하는 것에 기초할 수 있다. 한편, 이러한 영상 분할 기반의 척추 측만증 평가 시스템은 신뢰도 높은 결과의 제공을 위해 척추뼈 각각에 대한 정확도 높은 영역 분할이 요구될 수 있다. 나아가, 2D 방사선 영상의 경우, 각각의 척추뼈에 대한 정확도 높은 영역 분할이 어려울 수 있다. 더욱이, 각 척추뼈로부터 4 개의 모서리의 점을 찾은 후, 이로부터 척추뼈에 평행한 선을 긋는 방식의 랜드마크 기반의 척추 측만증 평가 시스템이 제안되었으나, 이러한 방식은 랜드마크의 정확도에 의존적일 수 있다는 한계 가 있을 수 있다. 또한 연구자들은 이러한 단점을 극복하기 위하여, 딥러닝 기반의 직접 추정 (direct estimation)방식을 개발하 였다. 이를 통해 이전보다 정교해진 결과를 얻을 수 있었으나 이 방식은 최종결과로 콥 각도만을 제공하여, 시 각적 해석능력이 떨어지는 한계를 지니고 있다. 한편, 본 발명의 발명자들은, 전술한 척추 측만증 평가 시스템이 갖는 한계를 극복하고자 하였고, 정교한 콥 각 도뿐만 아니라 개별 척추의 중심점 및 기울기와 같은 시각적인 정보까지 제공할 수 있는 방식에 주목하였다. 보다 구체적으로, 본 발명의 발명자들은, 척추 측만증 평가 시스템에 대하여 의료 영상에 대한 영역 분할, 예를 들어 척추뼈 영역에 대한 분할 절차 없이 영상 내에서 척추뼈를 이루는 픽셀 각각에 대한 벡터, 즉 벡터 필드를 결정하여 최종적으로 척추체 기울기를 결정하도록 설계할 수 있었다. 결과적으로, 본 발명의 발명자들은 척추뼈의 경계선에 대한 명확한 분할 절차 없이 척추뼈 각각에 대한 기울기 를 결정하여 최종적으로 콥 각을 산출하여 제공하도록 구성된 새로운 척추 측만증 평가 시스템을 개발하기에 이 르렀다. 이때, 본 발명의 발명자들은 척추뼈에 대한 기울기로 정의되는 척추-기울기 필드 (vertebral-tilt field) 를 의 료 영상 내에서 예측하도록 구성된 기울기 예측 모델을 척추 측만증 평가 시스템에 적용하고자 하였다. 더욱이, 본 발명의 발명자들은 의료 영상 내에서 17 개의 척추뼈 각각을 국소화 (localization) 하도록 구성된 척추뼈 예측 모델을 척추 측만증 평가 시스템에 적용할 수 있었다. 그 결과, 종래의 척추 측만증 평가 시스템보다 높은 정확도로로 의료 영상 내에서 척추뼈를 인식하고, PT (proximal-thoracic), MT (main thoracic) 및 TL (thoracic-lumbar) 의 콥 각을 결정할 수 있음이 확인되었다. 특히, 본 발명의 발명자들은 결정된 콥 각뿐만 아니라, 척추뼈 각각에 대한 기울기 벡터, 척추뼈의 중심점 등을 함께 제공하여 콥 각의 산출을 위한 중간 과정을 시각적으로 제공하고자 하였다. 이에, 본 발명의 발명자들은, 정확도 높고 시각적으로 설명 가능한 콥 각을 제공하는 척추 측만증 평가 시스템 을 제공함으로써, 부정확한 측정으로 인한 의료진의 척추 측만증의 진행에 대한 잘못된 해석을 방지하고, 실제 임상 실무에 있어서 의료진의 워크 플로우를 향상시킬 수 있음을 기대할 수 있었다. 이에, 본 발명이 해결하고자 하는 과제는, 기울기 예측 모델을 이용하여 수신된 척추 의료 영상에 대하여 벡터 필드를 결정하고, 이를 기초로 기울기를 결정하여 척추 측만증 발병 여부를 평가하도록 구성된, 척추 측만증 평 가 방법 및 이를 이용한 디바이스를 제공하는 것이다. 본 발명이 해결하고자 하는 다른 과제는, 척추뼈 예측 모델을 이용하여 척추 의료 영상 내에서 각각의 척추뼈를 국소화하고, 기울기 예측 모델을 이용하여 척추뼈에 대한 벡터 필드를 결정하고, 이를 기초로 콥 각을 산출하여 척추 측만증 발병 여부를 평가하도록 구성된, 척추 측만증 평가 방법 및 이를 이용한 디바이스를 제공하는 것이다. 본 발명이 해결하고자 하는 또 다른 과제는, 척추뼈 예측 모델 및/또는 기울기 예측 모델을 이용하여 콥 각을 산출하는 중간 과정에서 결정된 정보들을 시각적으로 제공하도록 구성된, 척추 측만증 평가 방법 및 이를 이용 한 디바이스를 제공하는 것이다. 본 발명의 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재 로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 바와 같은 과제를 해결하기 위하여 본 발명의 일 실시예에 따른 척추 측만증 평가 방법이 제공된다. 본 방법은, 프로세서에 의해 구현되는 척추 측만증 평가 방법으로서, 프로세서에 의해 구현되는 척추 측만증 평가 방법으로서, 개체의 복수의 척추뼈 (vertebrae) 를 포함하는 척추 의료 영상을 수신하는 단계, 척추뼈에 대한 벡터 필드 (vector field) 를 결정하도록 구성된 기울기 예측 모델을 이용하여, 복수 개의 척추뼈에 대한 벡터 필드를 결정하는 단계, 벡터 필드에 기초하여 복수의 척추뼈 각각에 대한 기울기를 결정하는 단계, 및 기울기에 기초하여 척추 측만증 발병 여부를 평가하는 단계를 포함한다. 본 발명의 특징에 따르면, 각각에 대한 기울기를 결정하는 단계는, 벡터 필드의 가중 평균값에 기초하여, 복수 의 척추뼈 각각에 대한 척추-기울기 벡터 (vertebral-tilt vector) 를 결정하는 단계, 및 척추-기울기 벡터에 기초하여 복수의 척추뼈 각각에 대한 기울기를 결정하는 단계를 포함할 수 있다. 본 발명의 다른 특징에 따르면, 상기 방법은 척추 의료 영상을 수신하는 단계 이후에 수행되는, 의료 영상 내에 서 척추뼈를 결정하도록 구성된 척추뼈 예측 모델을 이용하여, 척추 의료 영상 내에서 상기 복수의 척추뼈를 결 정하는 단계를 더 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 척추뼈 예측 모델은, 척추뼈에 대한 중심점을 결정하도록 더 구성될 수 있다. 이때, 복수의 척추뼈를 결정하는 단계는, 척추뼈 예측 모델을 이용하여, 복수의 척추뼈 각각에 대한 중 심점을 결정하는 단계를 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 각각에 대한 기울기를 결정하는 단계는, 중심점 및 상기 각각에 대한 기울기 를 기초로, 복수의 척추뼈 각각에 대한 척추-기울기 벡터 (vertebral-tilt vector) 를 결정하는 단계, 및 척추- 기울기 벡터에 기초하여 복수의 척추뼈 각각에 대한 기울기를 결정하는 단계를 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 상기 방법은 척추 의료 영상에 대하여 중심점 또는 상기 척추-기울기 벡터를 표시하여 제공하는 단계를 더 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 척추뼈 예측 모델은, 의료 영상 내에서 척추뼈로 예측되는 신뢰성 맵 (confidence map) 을 생성하도록 더 구성될 수 있다. 이때, 각각에 대한 중심점을 결정하는 단계는, 척추뼈 예 측 모델을 이용하여 신뢰성 맵을 생성하는 단계, 및 신뢰성 맵 내에서 중심점을 결정하는 단계를 포함할 수 있 다. 본 발명의 또 다른 특징에 따르면, 기울기 예측 모델은 인풋 레이어 (input layer) 및 아웃풋 레이어 (output layer) 를 포함할 수 있다. 이때, 인풋 레이어는, 입력된 척추 의료 영상을 복수의 스케일로 다운 샘플링 (down sampling) 하도록 구성되고, 아웃풋 레이어는, 복수의 스케일로 다운 샘플링된 척추 의료 영상 각각에 대하여 상기 벡터 필더를 결정하도록 구성될 수 있다. 본 발명의 또 다른 특징에 따르면, 척추 측만증 발병 여부를 평가하는 단계는, 각각에 대한 기울기에 기초하여 PT (proximal-thoracic), MT (main thoracic) 및 TL (thoracic-lumbar) 중 적어도 하나의 콥 각을 결정하는 단 계, 및 콥 각에 기초하여 척추 측만증 발병 여부를 평가하는 단계를 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 콥 각을 제공하는 단계를 더 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 척추 의료 영상은, 척추 정면 방사선 영상일 수 있다. 전술한 바와 같은 과제를 해결하기 위하여 본 발명의 다른 실시예에 따른 척추 측만증 평가용 디바이스가 제공 된다. 상기 디바이스는, 개체의 복수의 척추뼈 (vertebrae) 를 포함하는 척추 의료 영상을 수신하도록 구성된 수신부, 및 프로세서를 포함한다. 이때, 프로세서는, 척추뼈에 대한 벡터 필드 (vector field) 를 결정하도록 구성된 기울기 예측 모델을 이용하여, 복수 개의 척추뼈에 대한 벡터 필드를 결정하고, 벡터 필드에 기초하여 복수의 척추뼈 각각에 대한 기울기를 결정하고, 기울기에 기초하여 척추 측만증 발병 여부를 평가하도록 구성될 수 있다. 본 발명의 특징에 따르면, 프로세서는, 벡터 필드의 평균값에 기초하여, 복수의 척추뼈 각각에 대한 척추-기울 기 벡터 (vertebral-tilt vector) 를 결정하고, 척추-기울기 벡터에 기초하여 상기 복수의 척추뼈 각각에 대한 기울기를 결정하도록 더 구성될 수 있다. 본 발명의 다른 특징에 따르면, 프로세서는, 의료 영상 내에서 척추뼈를 결정하도록 구성된 척추뼈 예측 모델을 이용하여, 척추 의료 영상 내에서 복수의 척추뼈를 결정하도록 더 구성될 수 있다. 본 발명의 또 다른 특징에 따르면, 척추뼈 예측 모델은, 척추뼈에 대한 중심점을 결정하도록 더 구성될 수 있다. 이때, 프로세서는, 척추뼈 예측 모델을 이용하여, 상기 복수의 척추뼈 각각에 대한 중심점을 결정하도록 더 구성될 수 있다. 본 발명의 또 다른 특징에 따르면, 프로세서는, 중심점 및 상기 각각에 대한 기울기를 기초로, 복수의 척추뼈 각각에 대한 척추-기울기 벡터 (vertebral-tilt vector) 를 결정하고, 척추-기울기 벡터에 기초하여 상기 복수 의 척추뼈 각각에 대한 기울기를 결정하도록 더 구성될 수 있다. 본 발명의 또 다른 특징에 따르면, 상기 디바이스는, 척추 의료 영상에 대하여 상기 중심점 또는 척추-기울기 벡터를 표시하여 제공하도록 구성된 표시부를 더 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 척추뼈 예측 모델은, 의료 영상 내에서 척추뼈로 예측되는 신뢰성 맵 (confidence map) 을 생성하도록 더 구성될 수 있다. 이때, 프로세서는, 척추뼈 예측 모델을 이용하여 신뢰성 맵을 생성하고, 신뢰성 맵 내에서 중심점을 결정하도록 더 구성될 수 있다. 본 발명의 또 다른 특징에 따르면, 기울기 예측 모델은 인풋 레이어 (input layer) 및 아웃풋 레이어 (output layer) 를 포함할 수 있다. 이때, 인풋 레이어는, 입력된 척추 의료 영상을 복수의 스케일로 다운 샘플링 (down sampling) 하도록 구성되고, 아웃풋 레이어는, 복수의 스케일로 다운 샘플링된 척추 의료 영상 각각에 대 하여 상기 벡터 필더를 결정하도록 구성될 수 있다. 본 발명의 또 다른 특징에 따르면, 프로세서는, 각각에 대한 기울기에 기초하여 PT (proximal-thoracic), MT (main thoracic) 및 TL (thoracic-lumbar) 중 적어도 하나의 콥 각을 결정하고, 콥 각에 기초하여 상기 척추 측만증 발병 여부를 평가하도록 구성될 수 있다. 본 발명의 또 다른 특징에 따르면, 상기 디바이스는, 콥 각을 제공하도록 구성된, 표시부를 더 포함할 수 있다. 본 발명의 또 다른 특징에 따르면, 척추 의료 영상은, 척추 정면 방사선 영상일 수 있다. 기타 실시예의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은, 예측 모델에 기초하여 척추뼈의 경계선에 대한 명확한 분할 절차 없이 척추뼈 각각에 대한 기울기를 결정하여 최종적으로 콥 각을 산출하여 제공하도록 구성된 새로운 척추 측만증 평가 시스템을 제공함으로써, 정 확도 높은 콕 각의 계측 결과 및 이에 따른 정확한 척추 측만증에 대한 평가 결과를 제공할 수 있다. 보다 구체적으로, 본 발명은, 의료 영상 내에서 17 개의 척추뼈 각각을 국소화 (localization) 하도록 구성된 척추뼈 예측 모델, 및/또는 척추-기울기 필드 (vertebral-tilt field) 를 의료 영상 내에서 예측하도록 구성된 기울기 예측 모델의 출력값에 기초하여 결정된 콥 각을 제공함에 따라, 개체의 척추 측만증과 연관된 정보를 제 공할 수 있다. 이에, 본 발명은, 콥 각이 척추체의 해부학적 구조, 및 의료인의 숙련도에 따라 다르게 측정될 수 있음에 따른 한계점 및 문제점을 갖는 종래의 척추 측만증 평가 시스템보다 진단 성능이 우수할 수 있다. 특히, 본 발명은 척추뼈 영역에 대한 분할 과정 없이 벡터 필드를 결정하여 척추체 기울기를 제공하도록 구성됨 에 따라, 평가의 신뢰도가 척추뼈의 경계선 및 랜드마크에 의존적이던 종래의 척추 측만증 평가 시스템보다 우 수한 성능을 가질 수 있다. 더욱이, 본 발명은, 정확도 높고 시각적으로 설명 가능한 콥 각을 제공하는 척추 측만증 평가 시스템을 제공함 으로써, 부정확한 측정으로 인한 의료진의 척추 측만증의 진행에 대한 잘못된 해석을 방지하고, 실제 임상 실무 에 있어서 의료진의 워크 플로우를 향상시킬 수 있다. 본 발명에 따른 효과는 이상에서 예시된 내용에 의해 제한되지 않으며, 더욱 다양한 효과들이 본 명세서 내에 포함되어 있다."}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하"}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조부 호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하 나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~ 를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도 록 구성된(또는 설정된)프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할"}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 발명의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하며, 당업자 가 충분히 이해할 수 있듯이 기술적으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적 으로 실시 가능할 수도 있고 연관 관계로 함께 실시 가능할 수도 있다. 본 명세서의 해석의 명확함을 위해, 이하에서는 본 명세서에서 사용되는 용어들을 정의하기로 한다. 본 명세서에서 사용되는 용어, \"개체\"는 척추 측만증을 예측하고자 하는 모든 대상을 의미할 수 있다. 예를 들 어, 개체는, 척추 측만증 의심 개체일 수도 있다. 이때, 본 명세서 내에 개시된 개체는, 인간을 제외한 모든 포유 동물일 수 있으나, 이에 제한되는 것은 아니다. 본 명세서에서 사용되는 용어, \"척추 의료 영상\"은, 영상 진단 장치로부터 촬영된 의료 영상을 의미할 수 있다. 예를 들어, 척추 의료 영상은, 개체에 대하여 촬영된 척추 정면 영상, 바람직하게 척추 정면 방사선 영상 (Frontal Radiographs) 일 수 있으나, 이에 제한되는 것은 아니다. 이때, 척추 의료 영상은, T1 내지 T12의 12 개의 흉추 (thoracic vertebrae), L1 내지 L5의 요추 (lumbar vertebrae) 의 복수 개의 척추뼈를 포함할 수 있다. 보다 바람직하게, 척추 의료 영상은, PT (proximal-thoracic) 각의 결정을 위한 T1 및 T3 영역, MT (main thoracic) 각의 결정을 위한 T3 및 T12 영역 및 TL (thoracic-lumbar) 각의 결정을 위한 T12 및 L4 영역을 포 함할 수 있으나, 이에 제한되는 것은 아니다. 한편, 의료 영상은, 2차원 영상, 3차원 영상, 한 컷의 스틸 영상, 또는 복수 개의 컷으로 구성된 동영상일 수 있다. 예를 들어, 의료 영상이 복수 개의 컷으로 구성된 동영상일 경우, 본 발명의 일 실시예에 따른 척추 측 만증 평가 방법에 따라 복수 개의 의료 영상 각각에 대하여 척추-기울기 벡터가 결정되고, 콥 각이 산출될 수도 있다. 그 결과, 본 발명은 방사선 촬영 장치와 같은 영상 진단 장치로부터의 의료 영상의 수신과 동시에 콥 각 의 예측을 수행할 수 있어, 실시간으로 척추 측만증의 진단 정보를 제공할 수 있다. 본 명세서에서 사용되는 용어, \"콥 각\"은 척추뼈의 휜 각도를 의미하며, 척추 측만증에 대한 지표로서 적용될 수 있다. 이때, 콥 각은 PT (proximal-thoracic), MT (main thoracic) 및 TL (thoracic-lumbar) 중 적어도 하 나일 수 있고, 콥 각이 10 °이상인 경우, '척추 측만증'으로 분류될 수 있다. 본 명세서에서 사용되는 용어, \"벡터 필드 (vector field)\"는 벡터 함수로 표현된 공간인 벡터 장을 의미하며, 의료 영상 내에서 척추뼈의 방향성을 제시하는 복수의 벡터일 수 있다. 보다 구체적으로, 본원 명세서 내에서 벡터 필드는 척추 의료 영상 내에서 척추뼈를 이루는 복수의 픽셀 각각에 대한 벡터들을 의미할 수 있다. 이에, 벡터 필드가 결정됨으로써 의료 영상 내에서 척추뼈의 경계선에 대한 분 할 절차 없이도 척추체의 기울기가 추정될 수 있다. 한편, 본원 발명의 명세서 내에서 벡터 필드는 척추-기울기 필드 (vertebral-tilt field) 와 동일한 의미로 해 석될 수 있다. 본 명세서에서 사용되는 용어, \"척추-기울기 벡터 (vertebral-tilt vector)\"는 의료 영상 내에서 척추뼈의 방향 성을 나타내는 하나의 대표 벡터를 의미할 수 있다. 이때, 척추-기울기 벡터는 척추 의료 영상 내에서, 복수 개의 척추뼈 각각에 대하여 결정될 수 있다. 예를 들어, 척추-기울기 벡터는 복수 개의 척추뼈 각각을 이루는 벡터 필드의 가중 평균에 기초하여 결정될 수 있다. 그러나 이에 제한되는 것은 아니며, 척추-기울기 벡터는 복수 개의 척추뼈의 중심, 즉 중심점에 대한 벡 터 필드의 가중 평균에 기초하여 결정될 수 있다. 본 명세서에서 사용되는 용어, \"기울기 예측 모델\"은 척추 의료 영상에 대하여 척추뼈에 대한 벡터 필드를 출력 하도록 구성된 모델일 수 있다. 예를 들어, 본 발명의 기울기 예측 모델은, 입력된 척추 정면 의료 영상에 대하여 척추뼈에 대한 벡터 필드를 결정하여 출력하도록 학습된 모델일 수 있다. 이때, 기울기 예측 모델은, 입력된 척추 의료 영상을 복수의 스케일로 다운 샘플링 (down sampling) 하도록 구 성된 인풋 레이어 (input layer) 및 복수의 스케일로 다운 샘플링된 척추 의료 영상 각각에 대하여 벡터 필드를 결정하도록 아웃풋 레이어 (output layer) 로 이루어질 수 있다. 보다 구체적으로, 아웃풋 레이어는, 다운 샘 플링된 복수의 척추 의료 영상 각각에 대하여 벡터 필더를 출력하도록 구성된 사이드 아웃풋 레이어 (side- output layer) 및 이들에 대한 평균값에 기초하여 최종적으로 척추 의료 영상에 대한 벡터 필드를 결정하도록 구성된 파이널 아웃풋 레이어 (final-output layer) 로 이루어질 수 있다. 이에, 본 발명의 다양한 실시예에 적용되는 기울기 예측 모델은, 척추뼈 영역에 대한 분할 없이 높은 정확도로 척추뼈에 대응하는 영역에 대한 벡터 필드를 결정할 수 있다. 한편, 본 발명의 기울기 예측 모델은, M-net (multi-scale U-shape network) 에 기초한 모델일 수 있다. 그러 나 이에 제한되는 것은 아니다. 예를 들어, 본 발명의 기울기 예측 모델은, CNN(Convolutional Neural Network) 기반의 VGG net, ResNet, DenseNet 및, encoder-decoder structure를 갖는 FCN(Fully Convolutional Network), SegNet, DeconvNet, DeepLAB V3+, U-net와 같은 deep neural network을 기반으로 하는 예측 모델일 수도 있다. 본 명세서에서 사용되는 용어, \"척추뼈 예측 모델\"은 입력된 척추 정면 영상에 대하여 척추뼈를 국소화하거나 식별하도록 학습된 모델일 수 있다. 보다 구체적으로, 척추뼈 예측 모델은, 척주 정면 영상을 입력으로 하여 척추뼈에 대응하는 신뢰성 맵 (confidence map) 을 출력하도록 학습된 모델일 수 있다. 여기서, 신뢰성 맵은 척추뼈의 중심인 중심점을 제공 할 수 있다. 한편, 척추뼈 예측 모델은, 유사한 모양의 척추뼈 예를 들어, T1 및 경추 (cervical vertebra) 의 C7을 구별하 기 (identify) 위해 가중된 손실 함수 (weighted loss function) 가 적용될 수 있다. 본 발명의 특징에 따르면, 척추뼈 예측 모델은 17 개의 척추 사이의 의존도를 고려하기 위해, 큰 수용장 크기 (receptive field size) 를 갖는 아웃풋 레이어를 포함할 수 있다. 본 발명의 다른 특징에 따르면, 척추뼈 예측 모델은, 특징 추출 네트워크 (feature extraction network), 초기 예측 네트워크 (initial prediction network) 및 개량 네트워크 (Refinement Network) 의 세 개의 네트워크로 구성될 수도 있다. 예를 들어, 특징 추출 네트워크는 척추 의료 영상에 대하여 특징을 추출하고, 초기 예측 네트워크는 추출된 특 징을 입력으로 하여 초기의 정제되지 않은 신뢰성 맵 (coarse initial confidence map) 을 출력할 수 있다. 개량 네트워크는 추출된 특징 및 정제되지 않은 신뢰성 맵이 연결된 초기의 신뢰성 맵을 입력으로 하여 개량한 후 최종 신뢰성 맵을 출력할 수 있다. 이에, 본 발명의 다양한 실시예에 적용되는 척추뼈 예측 모델은, 척추 의료 영상 내에서 복수의 척추뼈를 높은 정확도로 구별할 수 있다. 한편, 본 발명의 척추뼈 예측 모델은, Centroid-net에 기초한 모델일 수 있다. 그러나 이에 제한되는 것은 아 니다. 이하에서는 도 1a 내지 1c를 참조하여, 본 발명의 일 실시예에 따른 척추 측만증 평가용 디바이스에 기초한 척 추 측만증 평가 시스템을 설명한다. 도 1a는 본 발명의 일 실시예에 따른 척추 측만증 평가용 디바이스에 기초한 척추 측만증 평가 시스템을 예시적 으로 도시한 것이다. 도 1b는 본 발명의 일 실시예에 따른 척추 측만증 평가용 디바이스의 구성을 예시적으로 도시한 것이다. 도 1c는 본 발명의 일 실시예에 따른 척추 측만증 평가용 디바이스로부터 척추 측만증에 대한 정보를 수신 받아 출력하는 의료진 디바이스의 구성을 예시적으로 도시한 것이다. 먼저, 도 1a을 참조하면, 척추 측만증 평가 시스템 은, 개체에 대한 척추 의료 영상을 기초로 척추 측만 증과 관련된 정보를 제공하도록 구성된 시스템일 수 있다. 이때, 척추 측만증 평가 시스템 은, 척추 의 료 영상에 기초하여, 콥 각을 산출하고, 개체에 대한 척추 측만증 발병 여부를 결정하도록 구성된 척추 측만증 평가용 디바이스 , 척추 측만증 진단에 대한 정보를 수신하는 의료진 디바이스 및 척추 의료 영상을 제공하는 의료 영상 촬영용 디바이스 로 구성될 수 있다. 먼저, 척추 측만증 평가용 디바이스 는 의료 영상 촬영용 디바이스 로부터 제공된 사용자의 척추 의료 영상을 기초로 척추 측만증의 발병 여부를 평가하기 위해 다양한 연산을 수행하는 범용 컴퓨터, 랩탑, 및/ 또는 데이터 서버 등을 포함할 수 있다. 이때, 의료진 디바이스 는 척추 측만증에 대한 웹 페이지를 제 공하는 웹 서버 (web server) 또는 모바일 웹 사이트를 제공하는 모바일 웹 서버 (mobile web server) 에 액세 스하기 위한 디바이스일 수 있으나, 이에 한정되지 않는다. 구체적으로, 척추 측만증 평가용 디바이스 는 의료 영상 촬영용 디바이스 로부터 척추 의료 영상을 수신하고, 수신된 척추 의료 영상으로부터 콥 각을 결정하여 척추 측만증의 발병 여부와 연관된 정보를 제공할수 있다. 척추 측만증 평가용 디바이스 는 개체에 대한 척추 측만증의 발병과 연관된 데이터를 의료진 디바이스 로 제공할 수 있다. 이와 같이 척추 측만증 평가용 디바이스 로부터 제공되는 데이터는 의료진 디바이스 에 설치된 웹 브라우저를 통해 웹 페이지로 제공되거나, 어플리케이션, 또는 프로그램 형태로 제공될 수 있다. 다양한 실시 예에서 이러한 데이터는 클라이언트-서버 환경에서 플랫폼에 포함되는 형태로 제공될 수 있다. 다음으로, 의료진 디바이스 는 개체에 대한 척추 측만증 발병에 대한 정보 제공을 요청하고 평가 결과 데 이터를 나타내기 위한 사용자 인터페이스를 제공하는 전자 장치로서, 스마트폰, 태블릿 PC (Personal Computer), 노트북 및/또는 PC 등 중 적어도 하나를 포함할 수 있다. 의료진 디바이스 는 척추 측만증 평가용 디바이스 로부터 개체에 대한 척추 측만증 발병에 관한 평 가 결과를 수신하고, 수신된 결과를 표시부를 통해 표시할 수 있다. 여기서, 평가 결과는, 예측 모델들에 의해 결정된 계측된 콥 각, 나아가 콥 각을 결정하는 과정에서 예측된 척추뼈에 대한 척추-기울기 벡터, 중심점, 그 리고 척추 측만증의 중증도 등을 포함할 수 있다. 다음으로, 도 1b를 참조하여, 본 발명의 척추 측만증 평가용 디바이스 의 구성 요소에 대하여 구체적으로 설명한다. 도 1b는 본 발명의 일 실시예에 따른 척추 측만증 평가용 디바이스를 설명하기 위한 개략도이다. 도 1b를 참조하면, 척추 측만증 평가용 디바이스 는 저장부 , 통신부 및 프로세서 를 포함한다. 먼저, 저장부 는 개체에 대한 척추 측만증 발병 여부를 평가를 위한 다양한 데이터를 저장할 수 있다. 다양한 실시예에서 저장부 는 플래시 메모리 타입, 하드디스크 타입, 멀티미디어 카드 마이크로 타입, 카 드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램, SRAM, 롬, EEPROM, PROM, 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 통신부 는 척추 측만증 평가용 디바이스 가 외부 장치와 통신이 가능하도록 연결한다. 통신부 는 유/무선 통신을 이용하여 의료진 디바이스 , 의료진 디바이스 나아가 의료 영상 촬영용 디 바이스 와 연결되어 다양한 데이터를 송수신할 수 있다. 구체적으로, 통신부 는 의료 영상 촬영용 디바이스 로부터 개체의 척추 의료 영상을 수신할 수 있다. 또한, 통신부 는 의료진 디바이스 로 평가 결과를 전달할 수 있다. 프로세서 는 저장부 및 통신부 와 동작 가능하게 연결되며, 개체에 대한 척추 의료 영상 및/ 또는 뇌 활성 데이터를 분석하기 위한 다양한 명령들을 수행할 수 있다. 구체적으로, 프로세서 는 통신부 를 통해 수신된 척추 의료 영상을 기반하여 척추뼈에 대한 기울기 를 결정하고, 이를 기초로 콥 각을 결정하여 척추 측만증의 발병 여부를 평가하도록 구성될 수 있다. 이때, 프로세서 는 척추 의료 영상에 기초하여 척추뼈에 대한 중심점을 결정하고, 척추뼈에 대한 벡터 필 드를 예측하도록 구성된 예측 모델들에 기초할 수 있다. 특히, 프로세서 는 예측 모델에 의한 출력 결과를 기초로 콥 각을 결정하여 제공할 뿐만 아니라, 콥 각의 예측 과정에서 결정되는 척추뼈의 중심점, 척추-기울기 벡터 등의 시각적 정보를 제공할 수 있다. 이에, 척추 측만증 평가용 디바이스 는 부정확한 측정으로 인한 의료진의 척추 측만증의 진행에 대한 잘못된 해석을 방지하고, 실제 임상 실무에 있어서 의료진의 워크 플로우를 향상시킬 수 있다. 한편, 척추 측만증 평가용 디바이스 는 하드웨어 적으로 설계된 것이 제한되는 것은 아니다. 예를 들어, 척추 측만증 평가용 디바이스 의 프로세서 는 소프트웨어로 구현될 수 있다. 이에, 척추 측만증에 대한 평가 결과는 상기 소프트웨어가 연결된 의료 영상 촬영용 디바이스 의 표시부 (미도시) 를 통해 표 시될 수도 있다. 한편, 도 1c를 함께 참조하면, 의료진 디바이스 는 통신부 , 표시부 , 저장부 및 프로세 서 를 포함한다. 통신부 는 의료진 디바이스 가 외부 장치와 통신이 가능하도록 연결한다. 통신부 는 유/무 선 통신을 이용하여 척추 측만증 평가용 디바이스 와 연결되어 척추 측만증의 진단과 연관된 다양한 데이 터를 송신할 수 있다. 구체적으로, 통신부 는 척추 측만증 평가용 디바이스 로부터 개체의 척추 측만증의 진단과 연관된 평가 결과, 예를 들어 콥 각, 콥 각의 예측 과정에서 결정되는 척추뼈의 중심점, 척추- 기울기 벡터 등의 시각적 정보를 수신할 수 있다. 상기 정보들은 척추 의료 영상에 대하여 표시되어 제공될 수 있으나, 이에 제한되는 것은 아니다. 표시부 는 개체의 척추 측만증의 진단과 연관된 평가 결과를 나타내기 위한 다양한 인터페이스 화면을 표 시할 수 있다. 다양한 실시예에서 표시부 는 터치스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치 (touch), 제스처 (gesture), 근접, 드래그 (drag), 스와이프 (swipe) 또는 호버링 (hovering) 입력 등을 수신할 수 있다. 저장부 는 결과 데이터를 나타내기 위한 사용자 인터페이스를 제공하기 위해 사용되는 다양한 데이터를 저장할 수 있다. 다양한 실시예에서 저장부 는 플래시 메모리 타입 (flash memory type), 하드디스크 타 입 (hard disk type), 멀티미디어 카드 마이크로 타입 (multimedia card micro type), 카드 타입의 메모리 (예 를 들어 SD 또는 XD 메모리 등), 램 (Random Access Memory, RAM), SRAM (Static Random Access Memory), 롬 (Read-Only Memory, ROM), EEPROM (Electrically Erasable Programmable Read-Only Memory), PROM (Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 프로세서 는 통신부 , 표시부 및 저장부 와 동작 가능하게 연결되며, 결과 데이터를 나 타내기 위한 사용자 인터페이스를 제공하기 위한 다양한 명령들을 수행할 수 있다. 이하에서는, 도 2, 도 3a 내지 도 3d를 참조하여, 본 발명의 일 실시예에 따른 척추 측만증 평가 방법을 구체적 으로 설명한다. 도 2는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법의 절차를 도시한 것이다. 도 3a는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에 따라 콥 각 측정 및 척추 측만증 여부를 결정하는 절차를 예시적으로 도시한 것이다. 도 3b는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에서, 척추뼈에 대한 기울기를 결정하는 단계를 예시적으로 도시한 것이다. 도 3c는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에서, 척추뼈에 대한 척추-기울기 벡터를 결정하는 단계를 예시적으로 도시한 것이다. 도 3d는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에서, 콥 각을 결정하는 단계를 예시적으로 도시한 것이다. 먼저, 도 2를 참조하면, 본 발명의 일 실시예에 따른 척추 측만증 평가의 절차는 다음과 같다. 먼저, 개체에 대한 척추 의료 영상이 수신된다 (S210). 그 다음, 기울기 예측 모델에 의해 척추 의료 영상 내에서 복수 개의 척추뼈에 대한 벡터 필드가 결정된다 (S220). 다음으로, 벡터 필드에 기초하여 복수의 척추뼈 각각에 대한 기울 기가 결정되고 (S230), 결정된 기울기에 기초하여 척추 측만증 발병 여부가 평가된다 (S240). 마지막으로, 평 가 결과가 제공된다 (S250). 보다 구체적으로, 척추 의료 영상이 수신되는 단계 (S210) 에서 복수의 척추뼈 (vertebrae) 를 포함하는 척추 의료 영상이 수신될 수 있다. 이때, 의료 영상은 척추 정면 방사선 의료 영상일 수 있으나, 이에 제한되는 것 은 아니다. 본 발명의 일 실시예에 따르면, 척추 의료 영상이 수신되는 단계 (S210) 에서 복수 개의 의료 영상이 수신될 수 있다. 예를 들어, 의료 영상 촬영 디바이스가 구동되어 실시간으로 촬영된 의료 영상이 획득될 수 있음에 따라, 척추 의료 영상이 수신되는 단계 (S210) 에서 복수 개의 척추 의료 영상이 획득될 수 있다. 다음으로, 복수 개의 척추뼈에 대한 벡터 필드가 결정되는 단계 (S220) 에서, 척추뼈에 대한 벡터 필드 (vector field) 를 결정하도록 구성된 기울기 예측 모델이 이용될 수 있다. 예를 들어, 도 3a를 참조하면, 척추 의료 영상이 수신되는 단계 (S210) 에서 수신된 척추 의료 영상 이 기울기 예측 모델 에 입력된다. 그 결과, 척추 의료 영상 내에서 척추뼈 각각에 대하여 벡터 필드 가 결정되고, 벡터 필드가 결정된 척추 의료 영상이 획득될 수 있다. 이때, 도 3b의 (a), (b) 및 하기의 수학식 1을 함께 참조하면 기울기 예측 모델 은 척추뼈에 대한 좌측 중앙점 (mj,l)및 우측 (mj,r) 중앙점에 기초하여 척추-기울기 필드를 생성할 수 있다.[수학식 1]"}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, V는 벡터 필드이고, x는 픽셀 위치값이고, j는 17개의 척추 뼈 중 선택된 j번 째 척추뼈이고, mj,l는 j 번 째 척추뼈의 좌측 중앙점이고, mj,r는 j번 째 척추뼈의 우측 중앙점이다. 즉, 복수 개의 척추뼈에 대한 벡터 필드가 결정되는 단계 (S220) 에서, 수학식 1에 의해 17 개의 척추뼈 각각에 대한 벡터 필드가 결정될 수 있다. 이때, V는 척추뼈 이외의 영역, 예를 들어 배경 영역에서는 영벡터를 가질 수 있다. 본 발명의 다른 특징에 따르면, 복수 개의 척추뼈에 대한 벡터 필드가 결정되는 단계 (S220) 에서, 척추뼈를 이 루는 픽셀 단위로 벡터 필드가 결정될 수 있다. 다음으로, 도 2를 참조하면, 복수의 척추뼈 각각에 대한 기울기가 결정되는 단계 (S230) 에서, 척추뼈에 대하여 결정된 벡터 필드에 기초하여 기울기가 결정될 수 있다. 본 발명의 특징에 따르면, 복수의 척추뼈 각각에 대한 기울기가 결정되는 단계 (S230) 에서, 복수의 척추뼈 각 각에 대하여 결정된 중심점, 및 척추뼈에 대하여 결정된 벡터 필드가 결정되고, 이에 기초하여 복수의 척추뼈 각각에 대한 기울기가 결정될 수 있다. 예를 들어, 도 3a를 함께 참조하면, 척추뼈 각각에 대한 벡터 필드 에 중심점을 포함하는 디스크 가 적용되어, 각각의 척추뼈에 대한 척추-기울기 벡터 가 결정될 수 있다. 보다 구체적으로, 도 3c를 더욱 참조하면, 척추뼈에 대한 중심점을 중심으로 하는 디스크 (도 3c의 (a)), 및 벡 터 필드에 기초하여 척추-기울기 벡터 (도 3c의 (b)) 가 결정될 수 있다. 이때, 척추-기울기 벡터는 하기 수학식 2에 의해 산출될 수 있다. [수학식 2]"}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, vj는 j번째 척추뼈에 대한 척추-기울기 벡터이고, Dj는 j번째 척추뼈에 대한 중심점을 중심으로 하여 반 지름 5를 갖는 디스크이다. 이때, 이 반지름 5는 영상의 가로 및 세로의 비율을 유지하면서 영상의 세로 길이 를 512 픽셀로 리사이징 했을 때, 그 영상 내에서의 반지름의 크기를 의미할 수 있다. 즉, 척추-기울기 벡터는, 척추뼈에 대한 기울기 벡터 (V(x)) 및 중심점 값에 따른 가중 평균에 의해 결정될 수 있다. 한편, 본 발명의 특징에 따르면, 척추뼈 각각에 대한 중심점은 척추뼈 예측 모델의 출력값에 기초하여 생성될 수 있다. 예를 들어, 도 3a를 다시 참조하면, 척추 의료 영상 이 척추뼈 예측 모델 에 입력되면, 척추 의료 영상 에 대한 ROI (region of interest) 가 표시된 신뢰성 맵 이 출력된다. 그 다음, 척추뼈 각 각에 대한 중심점 가 결정될 수 있다. 보다 구체적으로, 신뢰성 맵 은 하기의 수학식 3 및 수학식 4에 의해 결정될 수 있다. [수학식 3] 여기서Ψj는 j번째 척추뼈에 대한 신뢰성 맵이고, x는 픽셀 위치값이고, 는 j번째 척추뼈의 중심점이고, 는 j번째 척추뼈의 높이의 1/8 값이다. 수학식 3에 의해 결정된 17 개의 척추뼈 각각에 대한 신뢰성 맵은 하기의 수학식 4에 의해 하나의 신뢰성 맵 ( )으로 통합될 수 있다. [수학식 4]"}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "그 다음, 수학식 4에 의해 결정된 신뢰성 맵에 대하여 오츠의 임계처리(Otsu's thresholding) 가 적용되어 배경 노이즈가 제거되고, 극대점 (local maximum) 의 산출에 의해 중심점들이 각각의 척추뼈에 대하여 결정될 수 있 다. 이때, 극대점에서의 신뢰성 맵 값의 평균의 1/2 미만인 후보군 (예를 들어, 척추뼈가 아닌 영역) 은 제외 될 수 있고, 최종적으로 17 개의 척추뼈에 대한 중심점이 결정될 수 있다. 다음으로, 기울기는 하기의 수학식 5에 기초하여, 17 개의 척추뼈 각각에 대하여 결정된 척추-기울기 벡터에 따 라 결정될 수 있다. [수학식 5]"}
{"patent_id": "10-2020-0037295", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서, 는 j번째 척추뼈에 대한 기울기이고, 는 j번째 척추에 대한 척추-기울기 벡터이다. 즉, 복수의 척추뼈 각각에 대한 기울기가 결정되는 단계 (S230) 의 결과로, 척추뼈에 대한 중심점 및/또는 벡터 필드에 기초하여 17 개의 척추뼈 각각에 대한 기울기가 획득될 수 있다. 다음으로, 도 2를 참조하면, 척추 측만증 발병 여부가 평가되는 단계 (S240) 에서, 척추뼈에 대한 기울기에 기 초하여 측만각이 결정되고, 측만증 발병 여부가 결정될 수 있다. 예를 들어, 도 3a를 다시 참조하면, 척추 측만증 발병 여부가 평가되는 단계 (S240) 에서, 17 개의 척추뼈 각각 의 기울기에 기초하여 PT (proximal-thoracic), MT (main thoracic) 및 TL (thoracic-lumbar) 의 콥 각 이 결정되고, 콥 각의 수준에 기초하여 척추 측만증 발병 여부가 결정될 수 있다. 보다 구체적으로, 도 3d의 (a) 및 (b)를 함께 참조하면, 17 개의 척추뼈를 대표하는 척추-기울기 벡터로부터 결 정된 T1 및 T3의 기울기에 기초하여 PT가 결정되고, T3 및 T12의 기울기에 기초하여 MT가 결정되고, T12 및 L4 의 기울기에 기초하여 TL이 결정될 수 있다. 척추 측만증 발병 여부가 평가되는 단계 (S240) 에서, PT, MT, TL의 각도가 미리 결정된 수준 이상일 경우, 예 를 들어 10 °이상일 경우, 개체는 척추 측만증 발병 위험이 높은 것으로 평가될 수 있다. 마지막으로, 평가 결과가 제공되는 단계 (S250) 에서, 개체에 대한 척추 측만증 발병 여부에 대한 정보뿐만 아 니라, 콥 각, 콥 각을 결정하는 과정에서의 중간 산출 결과들이 시각적으로 제공될 수 있다. 예를 들어, 도 3a를 다시 참조하면, 평가 결과가 제공되는 단계 (S250) 에서, 최종 평가 결과 뿐만 아니 라, 척추-기울기 벡터가 표시된 의료 영상 이 제공되거나, 콥 각이 표시된 의료 영상 이 제공될 수 있다. 이상의 다양한 실시예에 따른 발명의 본 발명의 따른 척추 측만증 평가 방법에 따라, 시각적으로 설명 가능한 콥 각을 제공하는 척추 측만증 평가 시스템이 제공될 수 있다. 이에, 본 발명은, 상기 척추 측만증 평가 시스 템을 제공함에 따라 부정확한 측정으로 인한 의료진의 척추 측만증의 진행에 대한 잘못된 해석을 방지하고, 실 제 임상 실무에 있어서 의료진의 워크 플로우를 향상시킬 수 있다. 이하에서는, 도 4를 참조하여 본 발명의 다양한 실시예에 따른 기울기 예측 모델의 구조 및 학습 방법에 대하여 구체적으로 설명한다. 도 4를 참조하면, 기울기 예측 모델은, 입력된 척추 의료 영상을 복수의 스케일로 다운 샘플링 (down sampling) 하도록 구성된 인풋 레이어 (input layer) 및 복수의 스케일로 다운 샘플링된 척추 의료 영상 각각에 대하여 벡 터 필더를 결정하도록 아웃풋 레이어 (output layer) 로 이루어질 수 있다. 보다 구체적으로, 아웃풋 레이어는, 다운 샘플링된 복수의 척추 의료 영상 각각에 대하여 벡터 필더를 출력하도록 구성된 사이드 아웃풋 레이어 (side-output layer) 및 이들에 대한 평균값에 기초하여 최종적으로 척추 의료 영상에 대한 벡터 필드를 결정하도록 구성된 파이널 아웃풋 레이어 (final-output layer) 로 이루어질 수 있다. 인풋 레이어에 입력된 척추 의료 영상 (I) 은, Avg 풀링 2x2 (average pooling 2x2) 에 의해 다운 샘플링될 수 있다. 그 다음, 다운 샘플링된 복수의 척추 의료 영상 각각에 대하여 컨볼류션 3x3 (Convolution 3x3), 결합 (Concatenation) 이 반복 수행된 후, 업 샘플링되어 최종적으로 사이드 아웃풋 레이어를 통해 이미지 각각에 대 한 벡터 필드 (fvec,1(I), fvec,2(I), fvec,3(I), fvec,4(I)) 가 출력될 수 있다. 그 다음, 파이널 아웃풋 레이어에서, 이들의 평균값에 기초하여 최종적으로 척추 의료 영상에 대한 벡터 필드 (fvec(I)) 가 결정될 수 있 다. 이상의 절차에 따라, 기울기 예측 모델은 척추 의료 영상상 내에서 척추-기울기 필드를 출력하도록 학습될 수 있다. 본 발명의 다양한 실시예에 적용되는 기울기 예측 모델은, 척추뼈 영역에 대한 분할 없이 높은 정확도로 척추뼈 에 대응하는 영역에 대한 벡터 필드를 결정할 수 있다. 한편, 본 발명의 기울기 예측 모델은, M-net (multi-scale U-shape network) 에 기초한 모델일 수 있다. 그러 나 이에 제한되는 것은 아니다. 예를 들어, 본 발명의 기울기 예측 모델은 CNN(Convolutional Neural Network) 기반의 VGG net, ResNet, DenseNet 및, encoder-decoder structure를 갖는 FCN(Fully Convolutional Network), SegNet, DeconvNet, DeepLAB V3+, U-net와 같은 deep neural network을 기반으로 하는 예측 모델일 수도 있다. 이하에서는, 도 5를 참조하여, 본 발명의 다양한 실시예에 따른 척추뼈 예측 모델의 구조 및 학습 방법에 대하 여 구체적으로 설명한다. 도 4의 (a), (b) 및 (c)를 참조하면, 척추뼈 예측 모델은 특징 추출 네트워크 (feature extraction network), 초기 예측 네트워크 (initial prediction network) 및 개량 네트워크 (Refinement Network) 의 세 개의 네트워 크로 구성될 수도 있다. 보다 구체적으로, 특징 추출 네트워크(fext)는 척추 의료 영상 (I) 에 대하여 특징을 추출 하여, 특징이 추출된 척추 의료 영상 (I*) 을 출력한다. 초기 예측 네트워크(finit)는 특징이 추출된 척추 의료 영상 (I*) 을 입력으 로 하여 초기의 정제되지 않은 신뢰성 맵 (coarse initial confidence map) ( ) 을 출력할 수 있다. 개량 네트워크(frfn)는 특징이 추출된 척추 의료 영상 (I*) 및 정제되지 않은 신뢰성 맵 ( ) 이 연결된 초기의 신 뢰성 맵 (I*, ) 을 입력으로 하여 개량한 후 최종 신뢰성 맵 ( )을 출력할 수 있다. 이상의 절차에 따라, 척추뼈 예측 모델은 척추 의료 영상상 내에서 신뢰성 맵을 높은 정확도로 출력하도록 학습 될 수 있다. 즉, 척추뼈 예측 모델은, 척추 의료 영상 내에서 복수의 척추뼈를 높은 정확도로 구별할 수 있다. 한편, 본 발명의 척추뼈 예측 모델은, Centroid-net에 기초한 모델일 수 있다. 그러나 이에 제한되는 것은 아 니다. 평가 1: 본 발명의 척추뼈 예측 모델 및 기울기 예측 모델의 평가_중심점 결정 및 기울기 벡터 결정 도 6a는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에 따라 척추 의료 영상에 대하여 결정된 신뢰성 맵 및 척추뼈에 대한 중심점을 도시한 것이다. 도 6b는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에 따 라, 척추 의료 영상에 대하여 결정된 척추뼈에 대한 벡터 필드 및 중심점에 기초하여 결정된 척추-기울기 벡터 를 도시한 것이다. 도 6c는 본 발명의 다양한 실시예에 이용되는 척추뼈 예측 모델의 중심점 결정에 대한 평가결과를 도시한 것이다. 도 6a를 참조하면, 척추뼈 예측 모델에 의해 척추 의료 영상 (도 6a의 (a)) 에 대하여 결정된 신뢰성 맵 (도 6a 의 (b)), 빨간 점으로 표시된 극대점 (Local maxima (도 6a의 (c)) 및 최종 결정된 척추뼈에 대한 중심점 (도 6a의 (d)) 가 도시된다. 이때, 도 6a의 (c)를 참조하면 중심점 결정 과정에서, 18 개의 후보 중심점이 결정된 것으로 나타난다. 그러나 도 6a의 (d)를 참조하면 극대점의 평균의 1/2 미만인 후보군이 제외됨에 따라, 최종적으로 17 개의 척추뼈에 대 한 중심점이 결정된 것으로 나타난다. 즉, 이러한 노이즈 제거 절차에 따라, 척추뼈에 대한 정확한 국소화 및 구별이 가능할 수 있다. 도 6b를 참조하면, 척추뼈에 대한 벡터 필드 및 중심점을 포함하는 디스크 (6b의 (a) 및 (c)) 가 도시되고, 척 추뼈의 영역 분할 철차 없이 벡터 필드 및 중심점에 기초하여 결정된 척추-기울기 벡터 (도 6b의 (b) 및 (d)) 가 도시된다. 이때, 척추뼈에 대한 경계선은 척추뼈 예측 모델 또는 기울기 예측 모델에 의해 결정된 값이 아닌, 예측 과정 이후 방사선 전문의에 의해 추가로 선별된 것이다. 보다 구체적으로, 도 6b의 (b)를 참조하면 벡터 필드가 실제 척추뼈를 이루는 경계선 내에 형성된 것으로 나타 나고, 척추-기울기 벡터 또한 척추뼈 영역 내에서 형성된 것으로 나타난다. 한편, 도 6b의 (d)를 참조하면, 벡터 필드가 실제 척추뼈를 이루는 영역의 일부에 형성되었음에도 불구하고, 척 추-기울기 벡터를 결정한 것으로 나타난다. 더욱이, 도 6c의 (a)를 참조하면, 척추뼈 예측 모델에 대한 17 개의 척추뼈 의 중심 위치 (center position) 예 측 오차의 중앙값이 1.11의 매우 낮은 수준으로 나타난다. 또한, 도 6c의 (b)를 참조하면 예측된 중심점과 실 제 척추뼈에 대한 중심점의 거리에 대한 오차는 약 2정도로 매주 낮은 수준으로 나타난다. 이는, 척추뼈 수준 (vertebral level) 에 관계 없이, 척추뼈 예측 모델이 실제 중심점의 위치와 유사한 수준으로, 중심점을 예측한 것을 의미할 수 있다. 즉, 이러한 결과는 본 발명의 다양한 실시예에 따른 척추 측만증 평가 시스템이 척추뼈 영역에 대한 분할 결과 에 관계 없이 척추-기울기 벡터를 높은 정확도로 결정할 수 있다는 것을 의미할 수 있다. 평가 2: 본 발명의 척추뼈 예측 모델 및 기울기 예측 모델의 평가_복수의 개체에 대한 콥 각 결정 도 7은 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에 따른, 여섯 명의 개체에 대한 평가 결과를 도시한 것이다. 도 7의 (a), (b) 및 (c)를 참조하면, 본 발명의 다양한 실시예에 적용되는 척추뼈 예측 모델 및 기울기 예측 모 델에 의해 6 명의 개체에 대한 척추 정면 방사선 영상 (도 7의 (a)) 각각에 대하여 결정된 중심점을 포함하는 신뢰성 맵 (도 7의 (b)), 복수의 척추뼈 각각에 대하여 결정된 척추-기울기 벡터 (도 7의 (c)) 가 도시된다. 이때, 도 7의 (d)를 더욱 참조하면, 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에 따라 결정된 기울기 를 의미하는 빨간 선은, 실제 콥 각을 이루는 척추뼈에 대한 기울기를 나타내는 노란 선과 유사한 기울기를 갖 는 것으로 나타난다. 이러한 결과는, 의료 영상 내에서 17 개의 척추뼈 각각을 국소화 (localization) 하도록 구성된 척추뼈 예측 모 델, 및/또는 척추-기울기 필드 (vertebral-tilt field) 를 의료 영상 내에서 예측하도록 구성된 기울기 예측 모 델이 실제 의료진과 유사한 수준의 진단 능력을 갖는 것을 의미할 수 있다. 이에, 두 개의 예측 모델에 기초한 본 발명의 다양한 실시예에 따른 척추 측만증 평가 시스템은, 예측 모델들의 출력값에 기초하여 결정된 콥 각을 제공함에 따라, 개체의 척추 측만증과 연관된 신뢰도 높은 정보를 제공할 수 있다. 평가3: 본 발명의 척추뼈 예측 모델 및 기울기 예측 모델의 평가_손실 함수 적용 어부에 따른 신뢰성 맵 결정 도 8a 및 8b는 손실 함수 (loss function) 적용 여부에 따른 척추 의료 영상 내 척추 뼈에 대한 신뢰성 맵 결정 여부를 평가한 결과를 도시한 것이다. 도 8a의 (a), (b) 및 (c)를 참조하면, T1 및 C7을 포함하는 척추 정면 방사선 영상 (도 8a의 (a)) 에 대하여 가 중 적용된 손실 함수 (weighted loss function) 를 적용하지 않고 결정한 신뢰성 맵 (도 8a의 (b)) 은, 가중적용된 손실 함수를 적용하여 결정한 신뢰성 맵 (도 8a의 (c)) 보다 정확도가 낮은 것으로 나타난다. 특히, 손 실 함수가 적용되지 않을 경우, T1에 대한 국소화 및 선별이 일어나지 않는 것으로 나타난다. 추가적으로 손실 함수를 사용할경우 C7(도 8a의 (c))까지 추가적으로 검출이 가능하다. 더욱이, 도 8b의 (a), (b) 및 (c)를 참 조하면, T1을 포함하는 척추 정면 방사선 영상 (도 8b의 (a)) 에 대하여 가중 적용된 손실 함수를 적용하지 않 고 결정한 신뢰성 맵 (도 8b의 (b)) 은, 가중 적용된 손실 함수를 적용하여 결정한 신뢰성 맵 (도 8b의 (c)) 보 다 선별 능력이 낮은 것으로 나타난다. 이러한 결과는, 손실 함수 적용에 따라 C7과 유사한 형태를 갖는 T1에 대한 선별의 정확도가 높음을 의미할 수 있다. 이에, 본 발명의 다양한 실시예에 적용되는 척추뼈 예측 모델의 네트워크에, 가중된 손실 함수가 적용될 수 있다. 평가4: 본 발명의 척추뼈 예측 모델 및 기울기 예측 모델의 평가_영역 분할 기반의 시스템과의 비교 도 8c 및 8d는 종래의 영역 분할 모델에 기초한 척추 의료 영상 내 척추뼈 분할 결과 및 본 발명의 다양한 실시 예에 적용되는 예측 모델들에 의해 예측된 척추뼈의 기울기를 비교하여 도시한 것이다. 도 8c의 (a)를 참조하면, 영역 분할 기반의 시스템에서 척추 의료 영상 내의 복수의 척추뼈에 대한 영역 분할 결과는, 정확도가 매우 낮은 것으로 나타난다. 이러한 결과는 콥 각의 부정확한 진단으로 이어질 수 있다. 그러나, 8c의 (b)를 참조하면, 예측 모델 기반의 척추 측만증 평가 시스템은 복수 개의 척추뼈에 대한 벡터 필 드를 고려함에 따라 영역 분할 절차 없이도 복수의 척추뼈 각각에 대한 기울기 벡터를 결정하는 것으로 나타난 다. 즉, 예측 모델 기반의 척추 측만증 평가 시스템은 높은 정확도로 콥 각을 결정하여 제공할 수 있다. 더욱이, 도 8d의 (a)를 참조하면, 영역 분할 기반의 시스템에서 척추 의료 영상 내의 복수의 척추뼈에 대한 영 역 분할 결과는, 정확도가 매우 낮은 것으로 나타난다. 이러한 결과는 콥 각의 부정확한 진단으로 이어질 수 있다. 그러나, 8d의 (b)를 참조하면, 예측 모델 기반의 척추 측만증 평가 시스템은 복수 개의 척추뼈에 대한 벡터 필 드를 고려함에 따라 영역 분할 절차 없이도 복수의 척추뼈 각각에 대한 기울기 벡터를 결정하는 것으로 나타난 다. 즉, 예측 모델 기반의 척추 측만증 평가 시스템은 높은 정확도로 콥 각을 결정하여 제공할 수 있다. 즉, 이러한 결과는 척추 측만증 평가 시스템이 척추뼈 영역에 대한 분할 과정 없이 벡터 필드를 결정하여 척추 체 기울기를 제공하도록 구성됨에 따라, 평가의 신뢰도가 척추뼈의 경계선 및 랜드마크에 의존적이던 종래의 척 추 측만증 평가 시스템보다 우수한 성능을 가진다는 것을 의미할 수 있다. 평가5: 본 발명의 척추뼈 예측 모델 및 기울기 예측 모델의 평가_타 예측 모델과의 콥 각 예측 결과 비교 도 9a 및 9b는 본 발명의 다양한 실시예에 이용되는 기울기 예측 모델에 대한 콥 각 결정에 대한 평가 결과를 다른 영역 분할 모델과 비교하여 도시한 것이다. 도 9a 및 9b를 참조하면, 본 발명의 다양한 실시예에 적용되는 M-net 및 U-net 기반의 기울기 예측 모델은, Angle net, Boost net, 및 Landmark net 기반의 예측 모델보다 CMAE (circular mean error) 및 SMAPE (symmetric mean absolute percentage error) 가 낮은 것으로 나타난다. 특히, 입력된 척추 의료 영상을 다운 샘플링하도록 구성된 인풋 레이어와 이들 각각에 대하여 벡터 필드를 결정하도록 구성된 아웃풋 레이어로 이루 어진 M-net 기반의 예측 모델은, 결정된 콥 각에 대한 CMAE가 3.51±3.89°로, SMAPE가 7.84 %로 가장 낮은 것으로 나타난다. 이러한 결과는, 본 발명의 다양한 실시예에 적용되는 기울기 예측 모델, 특히 M-net 및 U-net 기반의 기울기 예 측 모델이 다른 네트워크 기반의 예측 모델들보다 척추 측만증 평가에 있어서 우수한 진단 성능을 갖는 다는 것 을 의미할 수 있다. 이에, 기울기 예측 모델은, M-net 및 U-net에 기초할 수 있으나, 이에 제한되는 것은 아니다. 이상 첨부된 도면을 참조하여 본 발명의 실시 예들을 더욱 상세하게 설명하였으나, 본 발명은 반드시 이러한 실 시 예로 국한되는 것은 아니고, 본 발명의 기술사상을 벗어나지 않는 범위 내에서 다양하게 변형 실시될 수 있 다. 따라서, 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 그러므로, 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 본 발명의 보호 범 위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2020-0037295", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명의 일 실시예에 따른 척추 측만증 평가용 디바이스에 기초한 척추 측만증 평가 시스템을 예시적 으로 도시한 것이다. 도 1b는 본 발명의 일 실시예에 따른 척추 측만증 평가용 디바이스의 구성을 예시적으로 도시한 것이다. 도 1c는 본 발명의 일 실시예에 따른 척추 측만증 평가용 디바이스로부터 척추 측만증에 대한 정보를 수신 받아 출력하는 의료진 디바이스의 구성을 예시적으로 도시한 것이다. 도 2는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법의 절차를 도시한 것이다. 도 3a는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에 따라 콥 각 측정 및 척추 측만증 여부를 결정하 는 절차를 예시적으로 도시한 것이다. 도 3b는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에서, 척추뼈에 대한 기울기를 결정하는 단계를 예 시적으로 도시한 것이다. 도 3c는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에서, 척추뼈에 대한 척추-기울기 벡터를 결정하는 단계를 예시적으로 도시한 것이다. 도 3d는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에서, 콥 각을 결정하는 단계를 예시적으로 도시한 것이다. 도 4는 본 발명의 다양한 실시예에 이용되는 기울기 예측 모델의 구성을 예시적으로 도시한 것이다. 도 5는 본 발명의 다양한 실시예에 이용되는 척추뼈 예측 모델의 구성을 예시적으로 도시한 것이다. 도 6a는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에 따라 척추 의료 영상에 대하여 결정된 신뢰성 맵 및 척추뼈에 대한 중심점을 도시한 것이다. 도 6b는 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에 따라, 척추 의료 영상에 대하여 결정된 척추뼈에 대한 벡터 필드 및 중심점에 기초하여 결정된 척추-기울기 벡터를 도시한 것이다. 도 6c는 본 발명의 다양한 실시예에 이용되는 척추뼈 예측 모델의 중심점 결정에 대한 평가 결과를 도시한 것이다. 도 7은 본 발명의 일 실시예에 따른 척추 측만증 평가 방법에 따른, 6 명의 개체에 대한 평가 결과를 도시한 것 이다. 도 8a 및 8b는 손실 함수 (loss function) 적용 여부에 따른 척추 의료 영상 내 척추 뼈에 대한 신뢰성 맵 결정 여부를 평가한 결과를 도시한 것이다. 도 8c 및 8d는 종래의 영역 분할 모델에 기초한 척추 의료 영상 내 척추뼈 분할 결과 및 본 발명의 다양한 실시예에 적용되는 예측 모델들에 의해 예측된 척추뼈의 기울기를 비교하여 도시한 것이다. 도 9a 및 9b는 본 발명의 다양한 실시예에 이용되는 기울기 예측 모델에 대한 콥 각 결정에 대한 평가 결과를 다른 영역 분할 모델과 비교하여 도시한 것이다."}
