{"patent_id": "10-2025-7005771", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0047310", "출원번호": "10-2025-7005771", "발명의 명칭": "반도체 집적 회로를 위해 기체 유체에 의해 냉각되는 테스트 소켓 조립체", "출원인": "스미스 인터커넥트 아메리카스, 인크.", "발명자": "응우옌, 꾸인 응옥"}}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "반도체 집적 회로(IC) 칩을 위한 소켓 조립체로서,반도체 IC 칩을 수용하도록 크기화된 프레임 개구를 한정하는 프레임 바디를 포함하는 소켓 프레임;테스트 프로브를 그 안에 수용하도록 각각 크기화된 복수의 캐비티를 한정하는 카트리지 바디를 포함하는 소켓카트리지로서, 상기 소켓 프레임은 상기 소켓 카트리지의 일부를 덮고, 상기 프레임 개구에서 복수의 캐비티를노출시키는, 상기 소켓 카트리지; 및매니폴드 내부로 연장되는 채널을 한정하는 상기 매니폴드;상기 매니폴드와 결합되고 기체 냉각 유체를 수용하도록 크기화된 매니폴드 입구; 및 상기 매니폴드와 결합되고, 상기 채널 및 상기 프레임 개구와 유체 연통하는 구멍을 한정하는 매니폴드 출구를포함하는 매니폴드 조립체를 포함하며,상기 소켓 조립체는 상기 프레임 개구와 유체 연통하는 소켓 출구를 한정하고, 상기 소켓 조립체는 상기 매니폴드 입구와 소켓 상기 출구 사이에서 유체 경로를 한정하는, 소켓 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 소켓 프레임은 상기 소켓 프레임을 통해 연장되는 프레임 입구를 한정하고, 상기 프레임입구는 상기 프레임 개구와 유체 연통하고, 상기 매니폴드 조립체는 상기 소켓 프레임과 결합되며, 상기 매니폴드 출구의 구멍은 상기 프레임 입구와 유체 연통하는, 소켓 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 프레임 입구는 상기 프레임 개구의 모서리를 향해 각도를 이루는, 소켓 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 프레임 입구는 상기 프레임 개구의 모서리에 근접하여 위치되는, 소켓 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 기체 냉각 유체는 제습 공기인, 소켓 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 기체 냉각 유체는 기체 상태의 드라이 아이스 및/또는 기화된 액체 질소인, 소켓 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 매니폴드 입구는 상기 채널의 길이 방향 축을 따라서 위치되는, 소켓 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 매니폴드 출구는 상기 구멍의 단부에 위치된 격자를 추가로 포함하는, 소켓 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 매니폴드 출구는 상기 구멍의 단부에 위치된 조정 가능한 출구 링을 추가로 포함하는, 소켓 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2025-0047310-3-반도체 IC 칩을 위한 소켓 조립체의 매니폴드 조립체로서, 매니폴드 내부로 연장되는 채널을 한정하는 상기 매니폴드;상기 매니폴드와 결합되고 기체 냉각 유체를 수용하도록 크기화된 매니폴드 입구; 및 상기 매니폴드와 결합되고, 상기 채널과 상기 매니폴드 조립체의 외부와 유체 연통하는 구멍을 포함하는 매니폴드 출구를 포함하는, 매니폴드 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 기체 냉각 유체는 제습 공기, 기체 상태의 드라이 아이스 및/또는 기화된 액체 질소인,매니폴드 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 매니폴드 출구는 상기 구멍의 단부에 위치된 격자를 추가로 포함하는, 매니폴드 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 매니폴드 출구는 상기 구멍의 단부에 위치된 조정 가능한 링을 추가로 포함하는, 매니폴드 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서, 상기 상기 매니폴드 입구는 상기 채널의 길이 방향 축을 따라서 위치되는, 매니폴드 조립체."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "반도체 IC 칩을 위한 소켓 조립체를 조립하는 방법으로서,반도체 IC 칩을 수용하도록 크기화된 프레임 개구를 한정하는 프레임 바디를 포함하는 소켓 프레임을 형성하는단계로서, 상기 소켓 프레임은 상기 소켓 프레임을 통해 연장되는 프레임 입구를 한정하며, 상기 프레임 입구는프레임 개구와 유체 연통하는, 상기 소켓 프레임을 형성하는 단계;테스트 프로브를 그 안에 수용하도록 각각 크기화된 복수의 캐비티를 한정하는 카트리지 바디를 포함하는 소켓카트리지를 형성하는 단계;매니폴드 내부로 연장되는 채널을 한정하는 상기 매니폴드;상기 매니폴드와 결합되고 기체 냉각 유체를 수용하도록 크기화된 매니폴드 입구; 및 상기 매니폴드와 결합되고, 상기 채널과 유체 연통하는 구멍을 포함하는 매니폴드 출구를 포함하는, 매니폴드조립체를 형성하는 단계;상기 매니폴드 출구와 상기 프레임 입구가 서로 유체 연통하도록 상기 매니폴드 출구를 상기 프레임 입구와 정렬하는 것에 의해 상기 매니폴드 조립체를 상기 소켓 프레임과 결합하는 단계; 및상기 소켓 카트리지의 일부를 상기 소켓 프레임으로 덮고 상기 프레임 개구에서 상기 복수의 캐비티를 노출시키는 것에 의해 상기 소켓 프레임을 상기 소켓 카트리지 상에 장착하는 단계를 포함하며,상기 소켓 조립체는 상기 소켓 프레임의 프레임 개구와 유체 연통하는 소켓 출구를 한정하고, 상기 매니폴드 입구와 상기 소켓 출구 사이에서 유체 경로를 한정하는, 방법."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 매니폴드 조립체를 형성하는 단계는 상기 채널의 길이 방향 축을 따라서 상기 매니폴드입구를 위치시키는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서, 상기 소켓 프레임을 형성하는 단계는 상기 프레임 개구의 모서리를 향해 각도를 이루도록 상기 프레임 입구를 위치시키는 단계를 추가로 포함하는, 방법.공개특허 10-2025-0047310-4-청구항 18 제15항에 있어서, 상기 소켓 프레임을 형성하는 단계는 상기 프레임 개구의 모서리에 근접하여 상기 프레임 입구를 위치시키는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서, 상기 소켓 조립체에서 유체 흐름을 시뮬레이션하는 단계; 및시뮬레이션된 유체 흐름에 기초하여 상기 소켓 조립체의 매개변수를 최적화하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2025-7005771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서, 상기 매니폴드 조립체를 형성하는 단계는 상기 구멍의 단부에 위치된 격자 및/또는 조정 링을포함하는 매니폴드 조립체를 형성하는 단계를 추가로 포함하는, 방법."}
{"patent_id": "10-2025-7005771", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "반도체 집적 회로(IC) 칩을 위한 소켓 조립체가 제공된다. 소켓 조립체는 칩을 수용하도록 크기화된 프레임 개구 를 한정하는 프레임 바디를 포함하는 소켓 프레임을 포함한다. 소켓 조립체는 또한 테스트 프로브를 그 안에 수 용하도록 각각 크기화된 캐비티들을 한정하는 카트리지 바디를 포함하는 소켓 카트리지를 포함한다. 소켓 조립체 는 매니폴드 내부로 연장되는 채널을 한정하는 매니폴드, 매니폴드와 결합되고, 기체 냉각 유체를 수용하도록 크 기화된 매니폴드 입구, 및 매니폴드와 결합되고 채널과 프레임 개구와 유체 연통하는 구멍을 한정하는 매니폴드 출구를 포함하는 매니폴드 조립체를 추가로 포함한다. 소켓 조립체는 프레임 개구와 유체 연통하는 소켓 출구를 한정하고, 소켓 조립체는 매니폴드 입구와 소켓 출구 사이에서 유체 경로를 한정한다."}
{"patent_id": "10-2025-7005771", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원에 대한 상호 참조 본 출원은 그 내용이 참조에 의해 전체적으로 본 출원에 통합되는 2022년 8월 9일자 출원된 미국 가특허 출원 제63/396,389호에 대한 우선권을 주장한다. 본 개시내용의 분야는 일반적으로 반도체 집적 회로를 위한 테스트 소켓, 그리고 보다 구체적으로 반도체 집적 회로(IC) 칩을 테스트하기 위한 테스트 소켓 조립체를 구비한 테스트 시스템에 관한 것으로, 여기서 테스트 시 스템은 기체 유체에 의해 냉각된다."}
{"patent_id": "10-2025-7005771", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "반도체 집적 회로(IC) 칩은 다양한 패키지 또는 칩 구성으로 생산되고, 대량으로 생산된다. IC 칩의 생산은 일 반적으로 IC 칩의 최종 사용자의 애플리케이션을 시뮬레이션하는 방식으로 IC 칩을 테스트하는 것을 포함한다. IC 칩을 테스트하는 한 가지 방식은 테스트 소켓 조립체를 통해, IC 칩의 다양한 기능을 실행하는 인쇄 회로 기 판(PCB) 또는 로드 보드에 각각의 IC 칩을 연결하는 것이다. 테스트 소켓 조립체는 많은 IC 칩을 테스트하기 위 해 재사용될 수 있다. 테스트 소켓 조립체의 동작은 상당한 양의 열을 발생시킬 수 있다. 또한, 공지된 테스트 소켓 조립체는 열 발생 을 줄이도록 할 때 단점을 가질 수 있다. 따라서, 테스트 소켓 조립체를 냉각하기 위한 개선이 필요하다. 한 양태에서, 반도체 집적 회로(IC) 칩을 위한 소켓 조립체가 제공된다. 소켓 조립체는 반도체 IC 칩을 수용하 도록 크기화된 프레임 개구를 한정하는 프레임 바디를 포함하는 소켓 프레임을 포함한다. 소켓 조립체는 또한 테스트 프로브를 그 안에 수용하도록 각각 크기화된 복수의 캐비티를 한정하는 카트리지 바디를 포함하는 소켓 카트리지를 포함하고, 소켓 프레임은 소켓 카트리지의 일부를 덮고, 프레임 개구에서 복수의 캐비티를 노출시킨 다. 소켓 조립체는 매니폴드 내부로 연장되는 채널을 한정하는 매니폴드, 매니폴드와 결합되고 기체 냉각 유체 를 수용하도록 크기화된 매니폴드 입구, 및 매니폴드와 결합되고 채널 및 프레임 개구와 유체 연통하는 구멍을 한정하는 매니폴드 출구를 포함하는 매니폴드 조립체를 추가로 포함한다. 소켓 조립체는 프레임 개구와 유체 연 통하는 소켓 출구를 한정하고, 소켓 조립체는 매니폴드 입구와 소켓 출구 사이에서 유체 경로를 한정한다. 다른 양태에서, 반도체 IC 칩을 위한 소켓 조립체의 매니폴드 조립체가 제공된다. 매니폴드 조립체는 매니폴드 내부로 연장되는 채널을 한정하는 매니폴드, 매니폴드와 결합되고 기체 냉각 유체를 수용하도록 크기화된 매니 폴드 입구, 및 매니폴드와 결합되고 채널과 매니폴드 조립체의 외부와 유체 연통하는 구멍을 포함하는 매니폴드 출구를 포함한다. 또 다른 양태에서, 반도체 IC 칩을 위한 소켓 조립체를 조립하는 방법이 제공된다. 방법은 반도체 IC 칩을 수용 하도록 크기화된 프레임 개구를 한정하는 프레임 바디를 포함하는 소켓 프레임을 형성하는 단계를 포함하며, 소 켓 프레임은 소켓 프레임을 통해 연장되는 프레임 입구를 한정하며, 프레임 입구는 프레임 개구와 유체 연통한다. 방법은 또한 테스트 프로브를 그 안에 수용하도록 각각 크기화된 복수의 캐비티를 한정하는 카트리지 바디 를 포함하는 소켓 카트리지를 형성하고, 매니폴드 조립체를 형성하는 단계를 포함한다. 매니폴드 조립체는 매니 폴드 내부로 연장되는 채널을 한정하는 매니폴드, 매니폴드와 결합되고 기체 냉각 유체를 수용하도록 크기화된 매니폴드 입구, 및 매니폴드와 결합되고 채널과 유체 연통하는 구멍을 포함하는 매니폴드 출구를 포함한다. 방 법은 매니폴드 출구와 프레임 입구가 서로 유체 연통하도록 매니폴드 출구를 프레임 입구와 정렬하는 것에 의해 매니폴드 조립체를 소켓 프레임과 결합하는 단계를 추가로 포함한다. 또한, 방법은 소켓 카트리지의 일부를 소 켓 프레임으로 덮고 프레임 개구에서 복수의 캐비티를 노출시키는 것에 의해 소켓 프레임을 소켓 카트리지 상에 장착하는 단계를 포함한다. 소켓 조립체는 소켓 프레임의 프레임 개구와 유체 연통하는 소켓 출구를 한정하고, 매니폴드 입구와 소켓 출구 사이에서 유체 경로를 한정한다."}
{"patent_id": "10-2025-7005771", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시내용은 테스트 소켓 조립체와, 기체 냉각 유체를 사용하여 반도체 집적 회로(IC) 칩 및 소켓 조립체의 테스트 시스템을 위한 열 전달을 개선하는 방법을 포함한다. 고속 게임, 컴퓨터 그래픽, 사물 인터넷(IoT), 5G, 인공지능(AI), 딥 러닝, 차량간 통신, 자율 주행 차량과 같 은 차세대 기술에 대한 소비자의 요구는 고속 데이터 전송 및 처리 기술에 대한 필요성을 만들어낸다. 이러한 고속 다기능 디바이스에는 높은 신뢰성 테스트가 필수적이다. IC 칩을 테스트할 때, IC 칩의 테스트를 가능하게 하는 테스트 시스템의 기본 구성요소는 IC 칩을 위한 테스트 소켓 조립체이며, 이는 대량의 IC 칩을 테스트하도록 여러 번 재사용될 수 있다. 테스트 소켓 조립체는 IC 칩을 인쇄 회로 기판(PCB) 또는 부하 보드에 전기적으로 및 기계적으로 연결한다. 테스트 소켓 조립체가 재사용될 수 있는 정도는 테스트 소켓 조립체가 성능, 예를 들어, 신호 성능이 저하되지 않고 얼마나 많이 견딜 수 있는 \"사 이클\"로 정량화된다. IC 칩이 테스트 소켓 조립체에 삽입되거나 설정될 때마다 1 사이클로서 지칭된다. 일반적 으로, 여러 사이클에 걸쳐, 테스트 소켓 조립체의 접점 및 구조의 전기적 및 기계적 특성은 저하되기 시작한다. 저하의 한 가지 원인은 테스트 동안 IC 칩, 특히 고성능 IC 칩에 의해 발생되는 열로 인한 테스트 소켓 조립체 의 반복적인 가열 및 변형이다. 이러한 저하는 궁극적으로 테스트 자체의 무결성에 영향을 미치고, 이 시점에서, 테스트 소켓 조립체는 사용 수명이 종료된다. 도 1은 예시적인 소켓 조립체, 반도체 IC 칩, 및 PCB를 포함하는 예시적인 테스트 시스템 의 개략적인 분해도이다. IC 칩은 테스트 시스템을 사용하여 테스트된다. PCB는 테스트 회로를 포함한다. 소켓 조립체는 IC 칩과 PCB 사이에 전기적 및 기계적 연결을 제공한다. 테스트 시스 템은 또한 복수의 프로브를 포함한다. 프로브는 접지 프로브(108-g), 신호 프로브(108-s) 및 전 원 프로브(108-p)를 포함할 수 있다. 프로브는 소켓 조립체에 배치되고, IC 칩과 PCB 사 이의 전기적 연결을 설정하는 데 사용된다. 구체적으로, 접지 프로브(108-g)는 접지에 연결된다. 신호 프로브(108-s)는 IC 칩과 PCB 사이에 신호를 전송한다. 전원 프로브(108-p)는 전원 공급 장치에 연결되도록 구성된다. 전원, 접지 및 신호는 프로브를 통해 PCB 보드로부터 IC 칩으로 제공된다. 작동 시에, 소켓 조립체는 PCB에 장착된다. IC 칩을 테스트하기 위해, IC 칩은 소켓 조립체 에 수용되어 테스트 시스템에 배치된다. 소켓 조립체는 많은 IC 칩을 PCB에 연결하기 위한 재사용 가능한 인터페이스로서 역할을 한다. IC 칩의 고성능, 예를 들어 고속도는 많은 양의 열을 발생시킨다. 예를 들어, 63 밀리미터(mm) x 95 mm IC 칩에 의해 전달되는 열의 속도는 1.2 킬로와트(kW)에 도달할 수 있다. 그러나 소켓 조립체는 일반적으로 IC 칩의 테스트 동안 발생하는 열의 양에 의해 부정적인 영향을 받거나 과열되지 않고 높은 신뢰성을 유지 할 필요가 있다. 소켓 조립체를 위한 종래의 소켓 프레임은 열 비전도성 재료인 플라스틱으로 제작된다. 이러한 구현예에서, IC 칩은 IC 칩 상단 표면(즉, 테스트 소켓 조립체로부터 멀어지게 향한 IC 칩의 표면)과 접촉하는 방열판을 통한 열 전달에 의해 냉각된다. 이러한 냉각 메커니즘은 IC 칩 상단 표면으로부터 열을 제거하는 데 효과적이다. 그 러나, IC 칩의 성능이 증가함에 따라서, 발생되는 열의 양은 100 와트(W)의 레벨로부터 200W, 300W, 심지어 900W 이상으로 극적으로 증가한다. 또한, IC 칩과 프로브 사이의 접촉 지점과 같이 IC 칩과 테스트 소켓 조립체 사이의 접촉 지점에서 높은 열이 발생되는 추가 문제가 발생한다. 접촉 지점에서의 높은 열은, IC 칩의 상단 표 면의 반대쪽의 테스트 소켓 조립체를 향하는 표면인 IC 칩의 바닥측에 있다. IC 칩의 상단 표면에 배치된 방열 판은 불충분하거나, 또는 접촉 지점에서 발생된 높은 열을 발산하는 데 증가된 어려움을 가질 수 있다. 그러므 로, 이렇게 많은 열을 효율적이고 효과적으로 발산하는 것은 고성능 IC 칩을 신뢰 가능하게 테스트하는 데 있어 서 존재하는 비교적 새로운 문제이다. 접촉 지점에서 발생된 높은 열은 테스트 소켓 조립체의 성능과 수명을 저하시킨다. 많은 IC 칩을 테스트하 기 위해 소켓 조립체를 반복적으로 사용하면, 많은 양의 열이 소켓 조립체를 변형시켜, 종래의 테스트 시 스템의 전기적 성능에 영향을 미치고, 시스템이 고주파 신호를 전송할 수 없게 만들 수 있다. 그 결과, 종래의 테스트 시스템은 특히 고주파 신호와 관련하여 수명이 제한되고 성능이 불만족스럽다. 본 명세서에서 설명된 시스템 및 조립체는 테스트 품질을 보장하고 테스트 시스템의 수명을 연장시키기 위해 테 스트 동안 고성능 IC 칩으로부터 열을 발산하는 문제에 대한 해결책을 제공한다. 본 명세서에서 개시된 바와 같 은 소켓 조립체는 기체 냉각 유체를 사용하여 테스트 소켓 조립체와 IC 칩 사이의 접촉 지점으로부터 열을 제거 하는 것에 의해 냉각된 테스트 소켓 조립체를 유지하고, 이에 의해 테스트 소켓의 수명을 개선하고, 유지 관리 비용을 줄이며, 궁극적으로 테스트 시스템의 가동 중지 시간을 줄이도록 의도된다. 기체 냉각 유체는 흐름 경로 가 사전 한정된 유체 채널로 제한되지 않고 기체 냉각 유체가 접촉 지점과 접촉하거나 근접하도록 흐를 수 있기 때문에 유리하다. 도 2a 내지 도 2g는 예시적인 소켓 조립체의 다양한 도면을 도시한다. 도 2a는 소켓 조립체의 평면 사시도이다. 도 2b는 소켓 조립체의 저면 사시도이다. 도 2c는 소켓 조립체의 분해도이며, 프로브 의 확대도가 또한 포함된다. 도 2d는 도 2a에서 마킹된 바와 같은 단면선 2D-2D를 따라서 취한 소켓 조립 체의 단면 사시도이다. 도 2e는 소켓 조립체의 매니폴드 조립체의 부분적으로 투명한 사시도이 다. 도 2f는 IC 칩이 소켓 조립체에 배치된, 도 2a에서 마킹된 바와 같은 선 2F-2F를 따르는 소켓 조 립체의 단면도이다. 도 2g는 도 2f에 도시된 소켓 조립체의 일부의 확대도이다. 예시적인 실시예에서, 소켓 조립체는 소켓 프레임과 소켓 카트리지를 포함한다. 도시된 실시예 에서, 소켓 프레임과 소켓 카트리지는 별개의 부분이다(도 2c 참조). 일부 실시예에서, 소켓 프레임 과 소켓 카트리지는 하나의 일체형(즉, 단 하나의 부분)으로 제작된다. 일체형 소켓 조립체는 소켓 프레임 및 소켓 카트리지를 통한 열 전달을 개선할 수 있을 뿐만 아니라, 제조 및 조립 공정을 단순화할 수 있다. 예시적인 실시예에서, 소켓 프레임은 프레임 바디(도 2c)를 포함한다. 프레임 바디는 IC 칩 을 그 안에 수용하도록 크기화된 프레임 개구를 한정한다. 프레임 바디는 프레임 개구를 한정하는 프레임 경계를 포함한다. 프레임 바디는 금속이거나, 또는 알루미늄, 마그네슘, 티타늄, 지 르코늄, 구리, 철 및/또는 알루미늄 5053과 같은 합금을 포함하지만 이에 제한되지 않는 금속으로 제조된다. 금 속 프레임 바디는 열 전달을 개선할 수 있다. 소켓 프레임은 프레임 바디의 표면에 위치된 절연 층(도 2a)을 추가로 포함할 수 있다. 소켓 프레임의 절연 층은, 양극 산화 공정에 의해 금속에서 발생되고 전기적으로 비전도성인 알루미늄 산화물과 같은 양극 막일 수 있다. 절연 층은 폴리테트라플루오로 에틸렌(PTFE) 코팅으로 코팅될 수 있다. 일부 실시예에서, 프레임 바디의 일부는 절연 층을 포함하지 않는다. 예를 들어, 소켓 카트리지와 마주보고 이와 정합되는 프레임 바디의 측면 또는 측면 의 부분은 절연 층을 제거하거나 또는 절연 층으로 코팅되지 않는 것에 의해 절연 층을 가 지지 않는다. 측면에 절연 층이 없으면, 소켓 프레임과 소켓 카트리지 및 IC 칩과 같은 테 스트 시스템의 다른 부분 사이의 열 전달이 개선될 수 있다. 소켓 프레임의 나머지 표면은 단락을 제 한하기 위해 절연 층으로 코팅된다. 일부 실시예에서, 프레임 바디는 금속이 아니지만, 대신 플라스 틱과 같이 금속이 아닌 재료 또는 비금속 재료로 제조된다. 예시적인 실시예에서, 소켓 카트리지는 카트리지 바디(도 2c, 도 2f 및 도 2g)를 포함한다. 카트리지 바디는 금속이거나, 또는 알루미늄, 마그네슘, 티타늄, 지르코늄, 구리, 철 및/또는 이들의 합금과 같은 금속으로 제조된다. 금속 카트리지 바디는 열 전달을 개선한다. 카트리지 바디 및 프레임 바디 는 상이한 유형의 금속 또는 합금으로 제조될 수 있다. 카트리지 바디는 소켓 카트리지(도 2g)의 두 께를 관통하여 배치된 복수의 캐비티를 한정한다. 각각의 캐비티는 그 안에 프로브를 수용 하도록 크기화된다. 캐비티는 그 안에 접지 프로브(108-g)를 수용하도록 구성된 접지 캐비티일 수 있 다(도 1 참조). 캐비티는 그 안에 신호 프로브(108-s)를 수용하도록 구성된 신호 캐비티일 수 있다. 캐비티는 또한 그 안에 전원 프로브(108-p)를 수용하도록 구성된 전원 캐비티일 수 있다. 소켓 카트 리지는 캐비티의 표면을 따르는 절연 층을 포함한다(도 2g). 절연 층은, 양극 산화 공정에 의해 금속에서 발생되고 전기적으로 비전도성인 알루미늄 산화물과 같은 양극 막일 수 있다. 절연 층은 PTFE 코 팅으로 코팅될 수 있다. 절연 층은 전기적 단락을 피하기 위해 프로브들이 서로 접촉하는 것을 제한 하고, 프로브들이 금속 소켓 카트리지에 접촉하는 것을 제한한다. 일부 실시예에서, 접지 캐비티 는 절연 층을 가지지 않으며, 및/또는 접지 프로브(108-g)와 카트리지 바디 사이의 산화가 억제 되도록 접지 캐비티의 표면에 도포되는 금, 구리, 니켈 또는 쉽게 산화되지 않는 다른 전도성 물질과 같은 전도성 물질을 가진다. 이와 같이, 테스트 시스템의 전기적 성능 및 열 전도도는 개선될 수 있다. 일부 실 시예에서, 신호 프로브(108-s)는 절연 링을 포함한다(도 1 참조). 신호 캐비티는 절연 층을 포 함하지 않을 수 있으며, 이는 신호 프로브(108-s)가 소켓 카트리지와 전기적으로 연결됨이 없이 테스트 시 스템의 열 성능을 개선한다. 다른 실시예에서, 카트리지 바디의 측면(도 2c)은 절연 층을 가지지 않고, 테스트 시스템의 열 성능을 개선한다. 소켓 카트리지를 소켓 프레임과 조립할 때, 소켓 카트리지의 측면과 소켓 프레임의 측면은 서로 마주한다. 일부 실시예에서, 열 그리 스 또는 열 페이스트(도시되지 않음)는 소켓 프레임의 측면, 소켓 카트리지의 측면 또는 둘 모두에 도포될 수 있다. 열 그리스는 측면(207, 210)들 사이의 단열체로서 역할을 하는 공기 갭 또는 공간을 제거하고, 이에 의해 열 전달 및 발산을 개선한다. 예시적인 실시예에서, 소켓 카트리지는 프로브를 제자리에서 유지하는 데 사용되는 카트리지 바닥 (도 2c 및 도 2f)을 추가로 포함한다. 캐비티는 프로브가 캐비티에 배치되고 PCB 보드 와 전기적으로 연결되도록 카트리지 바닥을 통해 제공된다. 신호 프로브(108-s)의 캐비티는 절 연 링의 재료와 유사한 절연 재료를 포함한다. 일부 실시예에서, 카트리지 바디 및/또는 카트리지 바닥은 플라스틱과 같은 비금속 재료로 제작되지 만 이에 제한되지 않는다. 비금속 카트리지 바디 및/또는 카트리지 바닥을 사용하는 것은 개선된 전기 절연을 제공한다. 소켓 조립체를 조립하기 위해, 소켓 프레임이 소켓 카트리지 위에 배치되어서, 소켓 프레임 의 프레임 개구는 소켓 카트리지의 캐비티를 노출시켜, 프로브가 캐비티에 배치 되고 IC 칩이 프레임 개구에 배치되어 프로브와 전기적으로 연결된다. 소켓 프레임과 소켓 카트리지는 나사, 너트 또는 볼트와 같은 하나 이상의 체결구를 사용하여 함께 결합될 수 있다. 금속 소켓 프레임 바디 및 금속 카트리지 바디의 적용 및 상기된 바와 같은 개선된 열 전달 메커니즘 을 사용하더라도, 소켓 프레임 및 소켓 카트리지는 테스트 동안 고성능 IC 칩의 작동으로부터 발생된 대량의 열, 특히 IC 칩과 프로브 사이의 접촉 지점에서 발생된 높은 열을 여전히 적절히 발산 하지 못할 수 있다. IC 칩 또는 소켓 조립체에 통상적으로 부착된 추가 방열판이 또한 접촉 지점에서 발생된 높은 열을 효과적으로 발산하지 못할 수 있다. 접촉 지점에서 발생된 발산되지 않은 높은 열은 성능을 저하시키고 소켓 조립체의 수명을 단축시킬 것이다.본 명세서에서 개시된 소켓 조립체는 높은 열을 발산하기 위해 유체 냉각을 통합한다. 예시적인 실시예에서, 소 켓 조립체는 또한 매니폴드 조립체(도 2e)를 포함한다. 매니폴드 조립체는 매니폴드 내부 에 위치된 채널을 한정하는 매니폴드를 포함한다. 채널은 매니폴드의 내부에 위치되고 매 니폴드를 가로질러 연장된다. 채널은 매니폴드의 외부에서 시작하여 매니폴드 내로 드릴링 하는 것에 의해 형성될 수 있다. 매니폴드 조립체는 드릴 입구에서 밖으로 유체가 나가는 것을 제한 하기 위해 플러그 및/또는 O-링을 추가로 포함할 수 있다. 대안적으로, 채널은 매니폴드의 제조 공정(예를 들어, 매니폴드 제조 동안 변형, 성형 또는 주조)을 통해 매니폴드에서 형성될 수 있 다. 매니폴드는 금속 또는 비금속 재료로 제작될 수 있다. 예시적인 실시예에서, 매니폴드 조립체는 기체 냉각 유체를 수용하도록 크기화된 매니폴드 입구를 추 가로 포함한다. 도시된 실시예에서, 매니폴드 입구는 채널과 각도를 이루며 매니폴드와 결합된 다. 일부 실시예에서, 매니폴드 입구는 채널의 길이 방향 축 또는 길이 방향을 따라서 채널과 결합된다. 매니폴드 입구는 플러그 및/또는 O-링이 있는 위치에서 플러그 및/또는 O-링 를 매니폴드 입구로 교체하는 것에 의해 매니폴드와 결합될 수 있어, 부품 비용을 절감하고 유 체 흐름을 개선할 수 있다. 일부 실시예에서, 매니폴드 입구는 매니폴드와 일체로 또는 하나의 단일 편으로 형성된다. 예시적인 실시예에서, 매니폴드 조립체는 매니폴드 출구를 추가로 포함한다. 매니폴드 출구는 구멍을 한정한다. 매니폴드 출구는 매니폴드 출구를 매니폴드와 결합하기 위해 체결구 를 수용하도록 크기화된 다른 구멍을 한정할 수 있다. 일부 실시예에서, 매니폴드 출구는 매니폴드 와 일체로 또는 하나의 단일편으로 형성될 수 있다. 매니폴드 출구는 구멍의 단부에 위치된 출 구 링을 추가로 포함할 수 있다. 구멍의 단부에 있는 출구 링의 위치는 소켓 프레임 상의 여유 영역 또는 매니폴드 조립체가 장착된 소켓 조립체 상의 영역을 통제하도록 조정될 수 있다. 출 구 링은 위, 아래, 왼쪽 및/또는 오른쪽으로 조정될 수 있다. 매니폴드 출구는 출구 링 내부의 구멍의 단부에 위치된 격자를 포함할 수 있다. 격자는 경로 면적을 줄이고, 이에 의해 냉각 유 체에 의해 덮여질 수 있는 증가된 거리를 위해 공기 압력을 증가시킨다. 격자는 냉각 유체의 분사 패턴 각 도가 냉각 유체가 증가된 영역을 덮기 위해 증가하도록 각도를 이룰 수 있다. 매니폴드 조립체는 채널 의 길이를 따라서 분포된 복수의 매니폴드 출구를 포함할 수 있다. 작동 시에, 매니폴드 입구와 매니폴드 출구가 매니폴드와 결합될 때, 유체는 매니폴드 입구 로부터 매니폴드 조립체 내로, 채널을 통해, 매니폴드 출구를 거쳐 매니폴드 조립체 밖으로 흐른다. 예시적인 실시예에서, 소켓 조립체의 소켓 프레임은 프레임 입구들을 포함한다. 프레임 입구 들은 소켓 프레임의 프레임 경계를 통하여 그 내부에 한정된 채널들일 수 있다(도 2d, 또한 나 중에 설명하는 도 3a 및 도 3b 참조). 프레임 입구들은 프레임 바디의 내부에 위치되며 프레임 바디 를 관통하여 가로 방향으로 위치된다. 프레임 입구들은 프레임 경계와 각도를 이루고, 프레임 개구의 모서리를 향해 각도를 이룰 수 있다. 소켓 프레임에 있는 프레임 입구는 소켓 프레 임의 외부로부터 시작하여 소켓 프레임 내로 드릴링하는 것에 의해 형성될 수 있다. 대안적으로, 프 레임 입구는 프레임 바디의 제조 동안 변형 또는 주조와 같은 제조 공정에 의해 프레임 바디에 서 형성될 수 있다. 소켓 프레임 및 소켓 카트리지는 소켓 출구를 한정할 수 있다. 소켓 출구 는 소켓 프레임과 소켓 카트리지 사이의 갭일 수 있다. 소켓 출구들은 소켓 조립체의 다수의 위치에 위치될 수 있다. 작동 시에, 매니폴드 조립체는 매니폴드 출구가 프레임 입구와 유체 연통하도록 체결구를 통해 소켓 프레임과 결합된다. 유체는 매니폴드 조립체로부터 매니폴드 출구를 통해 프레임 입구 로, 프레임 개구 내로 흘러, 거기에 위치된 IC 칩을 냉각한다. 도시된 실시예에서, 매니폴드 조 립체는 소켓 프레임의 프레임 경계를 따라서 위치된다. 매니폴드 조립체는 소켓 프레임 의 프레임 경계 위 또는 아래에 위치될 수 있다. 일부 실시예에서, 매니폴드 조립체는 소켓 조 립체의 다른 부분, 예를 들어 소켓 조립체의 뚜껑 프레임 또는 도킹 플레이트에서 소켓 조립체와 결합될 수 있다. 냉각 유체의 유량은 테스트 시스템의 냉각 필요성에 의해 결정되며, 매니폴드 입구에 연결된 냉각 시 스템(도시되지 않음)에 의해 조정될 수 있다. 냉각 유체는 기체이다. 예시적인 냉각 유체는 건조 공기 또는 제습 공기, 기체 상태의 드라이 아이스 또는 기화된 액체 질소이다. 건조 공기에 비해 감소된 온도 때문에 기체 상태의 드라이 아이스 또는 기화된 액체 질소를 사용하는 것이 유리하다. 작동 시에, 기체 상태의 드라이 아이 스 또는 기화된 액체 질소는 냉각 시스템을 통해 고체 상태의 드라이 아이스 또는 액체 질소로부터 테스트 시스 템으로 순환될 수 있다. 작동 시에, 소켓 조립체는 매니폴드 입구를 통해 냉각 시스템에 연결된다. 냉각 시스템은 냉각 유체 를 펌핑하여 소켓 조립체와 테스트 시스템을 냉각한다. 냉각 유체는 테스트 시스템으로부터 열 을 운반한다. 일부 실시예에서, 소켓 프레임의 프레임 바디와 소켓 카트리지의 카트리지 바디 는 금속이고 열 전도성이다. IC 칩, 프로브, 및 PCB로부터 발생된 열은 소켓 프레임 및 소켓 카트리지로 전달되고, 그런 다음 유체 경로에서 순환되는 냉각 유체를 통해 전달된다. 본 명세서에서 설명된 시스템 및 조립체는 소켓 프레임 및/또는 소켓 카트리지가 비금속 재료로 제작 될 때 고성능 IC 칩을 테스트할 때 발생된 열을 효과적으로 발산하는 데 사용될 수 있다. 비금속 재료가 금속 재료보다 열전도도가 훨씬 낮을지라도, 기체 유체는 IC 칩과 소켓 카트리지 및 테스트 시스템의 다른 구성요소 사이의 접촉 지점 근처 또는 이와 접촉하여 흘러, IC 칩과 소켓 조립체로부터 멀어지 게 열을 운반한다. 따라서, 열이 효과적으로 발산되고, IC 칩과 소켓 조립체의 성능은 일관적이고 많은 양의 열과 반복 된 사용에 의해 영향을 받지 않는다. 본 명세서에서 설명된 매니폴드 조립체는 매니폴드 조립체를 소켓 조립체 또는 테스트 시스템 의 다른 부분에 결합하는 것에 의해 기존의 테스트 시스템 또는 소켓 조립체와 함께 개조될 수 있다. 예를 들어, 프레임 입구들은 소켓 조립체의 프레임 경계에서 드릴링되고 매니폴드 조립체 를 소켓 프레임에 결합할 수 있어서, 매니폴드 조립체는 프레임 입구들에서 소켓 프레임 과 유체 연통한다. 대안적으로, 매니폴드 조립체는 냉각 유체가 프레임 개구 내로 흐르도록 뚜 껑 프레임 또는 도킹 플레이트와 같은 테스트 시스템의 다른 부분에 설치될 수 있다. 개조를 통해 향상된 방열을 제공하는 것은 부품 및 제조 비용을 절감한다. 도 3a 및 도 3b는 소켓 조립체에서의 유체 흐름을 도시한다. 도 3a는 유체 흐름 프로파일을 도시한다. 도 3b는 유체 경로를 도시한다. 유체 흐름 프로파일 및 유체 경로는 시뮬레이션된 데 이터에 기초한다. 유체 흐름 프로파일에서, 더 밝은 선은 더 낮은 온도를 나타낸다. 도시된 바와 같이, 냉 각 유체는 매니폴드 입구로부터 매니폴드로 흐른다. 냉각 유체는 그런 다음 프레임 입구 를 통해 프레임 개구 내로 흐른다. 냉각 유체는 IC 칩 주위를 순환하고 이를 냉각하고, 소 켓 출구에서 소켓 조립체로 빠져나가, IC 칩과 소켓 카트리지로부터 멀어지게 열을 운반한 다. 냉각 유체는 소켓 카트리지의 상단 표면 상에 및/또는 위로 흐른다. 냉각 유체는 또한 소켓 카트리지와 카트리지 바닥 사이의 영역에서 흐를 수 있다(도 2c 참조). 프레임 입구는 IC 칩 주 변 영역을 덮기 위해 프레임 개구의 모서리를 향해 각도를 이룬다. 프레임 입구 중 적어도 일부 는 모서리에 근접하여 위치된다. 작동 시에, 소켓 조립체 및 테스트 시스템의 매개변수는 시뮬 레이션된 유체 흐름에 기초하여 조정될 수 있다. 예를 들어, 프레임 개구의 중심은 시뮬레이션에 기 초하여 감소된 유체 흐름을 가질 수 있다. 냉각 유체의 압력 및/또는 매니폴드 입구의 치수는 조정될 수 있다. 프레임 입구들의 각도가 또한 조정될 수 있다. 냉각 유체가 프레임 개구의 중심을 지향되 도록, 추가 프레임 입구가 포함되어 인접한 모서리들 사이의 중간 지점에 근접하여 위치될 수 있다. 도시된 실시예에서, 2개의 매니폴드 조립체는 소켓 프레임의 2개의 반대의 프레임 경계들을 따 라서 위치된다. 매니폴드 조립체의 수, 형상, 위치는 조정될 수 있다. 예를 들어, 매니폴드 조립체는 곡선일 수 있거나, 또는 다수의 매니폴드 조립체는 소켓 출구들이 개방되어 테스트 시스템의 외부와 유체 연통하도록 프레임 개구의 모서리를 둘러싸도록 사용될 수 있다. 도 4는 IC 칩을 위한 소켓 조립체를 조립하는 예시적 방법의 흐름도이다. 소켓 조립체는 상기에서 개시된 소켓 조립체일 수 있다. 예시적인 실시예에서, 방법은 IC 칩을 그안에 수용하도록 크기화된 프레임 개구를 한정하는 프레임 바디를 포함하는 소켓 프레임을 형성하는 단계를 포함한다. 소켓 프레임은 소켓 프레임을 관통하여 내부에 위치된 프레임 입구를 포함하고, 프레임 입구는 프레임 개구와 유체 연통한다. 방법 은 또한 테스트 프로브를 그 안에 수용하도록 크기화된 복수의 캐비티를 한정하는 카트리지 바디를 포함하 는 소켓 카트리지를 형성하는 단계를 포함한다. 방법은 또한 매니폴드 조립체를 형성하는 단계 를 포함한다. 매니폴드 조립체는 상기에서 개시된 매니폴드 조립체일 수 있다. 또한, 방법은 매니폴드 출구와 프레임 입구가 서로 유체 연통하도록 매니폴드 출구를 프레임 입구와 정렬하는 것에 의해 매니폴드 조립체를 소켓 프레임과 결합하는 단계를 포함한다. 방법은 또한 소켓 카트리지의 일부를 덮고 개구 에서 복수의 캐비티를 노출시키는 것에 의해 소켓 카트리지 상에 소켓 프레임을 장착하는 단계를 포함한다. 본 명세서에서 설명된 시스템, 장치 및 방법의 기술적 효과는,(a) 기체 냉각 유체를 사용하여 고성능 IC 칩의 테스트 시스템에서 열 전달을 개선하는 것; 및 (b) 기존의 소켓 조립체에서 열 발산을 개선하기 위해 사용되는 개조 매니폴드 조립체를 포함할 수 있다. 전술한 명세서 및 다음의 청구범위에서, 다음과 같은 의미를 가지는 다수의 용어가 참조된다. 본 명세서에서 사용된 바와 같이, 단수로 언급되며 단수 표현 용어의 요소 또는 단계는 다수의 요소 또는 단계 를 배제하는 것이 명시적으로 언급되지 않으면, 이러한 다수의 요소 또는 단계를 배제하지 않는 것으로 이해되 어야 한다. 또한, 본 개시내용의 \"예시적인 구현예\" 또는 \"한 구현예\"를 참조하는 것은 언급한 특성을 또한 병 합하는 추가 구현의 존재를 배제하는 것으로서 해석되도록 의도되지 않는다. \"선택적인\" 또는 \"선택적으로\"는 후속하여 기재한 이벤트나 상황이 발생할 수 있거나 발생하지 않을 수 있고 상 세한 설명이 이러한 이벤트가 발생하는 경우와 이러한 이벤트가 발생하지 않는 경우를 포함한다는 것을 의미한 다. 근사화하는 언어는, 상세한 설명 및 청구범위 전반에 걸쳐서 본 명세서에서 사용된 바와 같이, 그 관련 기본 기 능의 변화를 초래함이 없이 허용되게 변할 수 있는 임의의 정량적 표현을 변경하도록 적용될 수도 있다. 이에 따라, \"약\", \"대략\" 및 \"실질적으로\"와 같은 용어(들)에 의해 변경되는 값이 명시한 그 값으로 제한되지 않는다. 적어도 일부 경우에, 근사화하는 언어는 이 값을 측정하기 위한 장비의 정밀도에 대응할 수도 있다. 여 기서, 그리고 상세한 설명 및 청구범위 전반에 걸쳐서, 범위 제한은 조합되거나 상호 교환될 수 있다. 이러한 범위는 식별되며, 문맥이나 언어가 달리 나타내지 않는다면 그 범위에 포함되는 모든 하위 범위를 포함한다. 문구, \"X, Y 또는 Z 중 적어도 하나\"와 같은 택일적인 언어는, 달리 구체적으로 언급되지 않으면, 항목, 용어 등이 X, Y 또는 Z 중 어느 하나 또는 이들의 임의의 조합(예를 들어, X, Y 및/또는 Z)일 수도 있음을 언급하도 록 사용되는 것으로서 일반적으로 문맥 내에서 이해된다. 이에 따라, 택일적인 언어는, 특정 실시예가 X 중 적 어도 하나, Y 중 적어도 하나 또는 Z 중 적어도 하나가 각각 존재해야 함을 암시하도록 의도되지 않으며 암시하 지 않아야 한다. 추가로, 문구, \"X, Y 및 Z 중 적어도 하나\"와 같은 결합 언어는, 달리 구체적으로 언급되지 않 으면, 또한 X, Y, Z 또는 \"X, Y 및/또는 Z\"를 포함하는 그 임의의 조합을 의미하는 것으로 이해되어야 한다. 본 명세서에서 기술된 시스템과 방법은 본 명세서에서 기재된 특정 실시예로 제한되기 보다는, 시스템의 구성요 소 및/또는 방법의 단계가 본 명세서에서 기재된 다른 구성요소 및/또는 단계와 독립적으로 및 별개로 활용될 수도 있다. 본 개시내용의 여러 실시예의 특정 특성이 일부 도면에서 도시되고 다른 도면에서는 도시되지 않을 수 있을지라 도, 이것은 단지 편의적이다. 본 개시내용의 원리에 따라, 도면의 임의의 특성은 임의의 다른 도면의 임의의 특 성과 조합하여 참조 및/또는 청구될 수 있다. 이러한 기술된 상세한 설명은, 최상의 모드를 포함한 본 개시내용에 관한 상세를 제공하고, 또한 당업자가 임의 의 디바이스 또는 시스템을 만들어 사용하고 임의의 병합된 방법을 실행하는 것을 포함하여 본 개시내용을 실시 하는 것을 가능하게 하도록 예를 사용한다. 본 개시내용의 특허 범위는 청구범위에 의해 한정되며, 당업자에게 발생하는 다른 예를 포함할 수도 있다. 이러한 다른 예는, 이들이 청구범위의 문자적 언어와 상이하지 않은 구 조적 요소를 가지거나 또는 이들이 청구범위의 문자적 언어와 거의 차이가 없는 등가의 구조적 요소를 포함하면 청구범위의 범위 내에 있는 것으로 의도된다.도면 도면1 도면2a 도면2b 도면2c 도면2d 도면2e 도면2f 도면2g 도면3a 도면3b 도면4"}
{"patent_id": "10-2025-7005771", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 테스트 시스템의 개략적인 분해도이며; 도 2a는 도 1에 도시된 테스트 시스템에서의 예시적인 소켓 조립체의 평면 사시도이며; 도 2b는 도 2a에 도시된 소켓 조립체의 저면 사시도이며; 도 2c는 도 2a에 도시된 소켓 조립체의 분해도이며; 도 2d는 도 2a에서 마킹된 바와 같은 단면선 2D-2D를 따라서 취한 도 2a에 도시된 소켓 조립체의 단면 사시도이 며; 도 2e는 도 2a에 도시된 소켓 조립체의 매니폴드 조립체의 부분적으로 투명한 사시도이며; 도 2f는 도 2a에서 마킹된 바와 같은 단면선 2F-2F를 따라서 취한 도 2a에 도시된 소켓 조립체의 단면도이며; 도 2g는 도 2f에 도시된 소켓 조립체의 일부의 확대도이며; 도 3a는 유체 흐름의 프로파일을 도시하며; 도 3b는 유체 흐름 경로를 도시하며; 도 4는 도 1 내지 도 2g에 도시된 소켓 조립체를 조립하는 방법의 흐름도이다."}
