{"patent_id": "10-2022-0008759", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0112469", "출원번호": "10-2022-0008759", "발명의 명칭": "인공지능 챗봇에 기반한 대화형 국어 학습서비스 제공 방법 및 장치", "출원인": "주식회사 대교", "발명자": "강호준"}}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 문해력을 향상시키기 위하여 학습서비스 제공장치에 의해 수행되는 대화형 학습서비스 제공방법에 있어서,지문(context)에 대한 텍스트 형태(text type)의 질의(query)를 입력받는 과정;상기 질의에 포함된 복수의 형태소(morpheme)에 기초하여, 상기 질의를 토큰화(tokenization)하는 과정;토큰화된 질의 및 기 저장된 토큰화된 지문을 기 학습된 답변추출 모델(answer extraction model)에 입력하여,상기 질의에 대응하는 답변을 추정하는 과정; 및텍스트 형태의 추정된 답변을 제공하는 과정을 포함하는 것을 특징으로 하는 대화형 학습서비스 제공방법."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 토큰화하는 과정은,상기 질의를 형태소 단위로 분절하여, 상기 형태소로부터 복수의 토큰(token)을 생성하는 과정;생성된 토큰 사이에 태그(tag)를 부착하여, 토큰화된 질의를 생성하는 과정; 및상기 토큰화된 질의 앞에 분류토큰(classification token)을 추가하는 과정을 포함하는 것을 특징으로 하는 대화형 학습서비스 제공방법."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 추정하는 과정은,상기 토큰화된 질의 및 상기 토큰화된 지문을 상기 답변추출 모델에 입력하여, 상기 토큰화된 지문에 포함된 각각의 토큰에 관한 제1확률 및 제2확률을 출력하는 과정;가장 큰 제1확률을 갖는 토큰인 시작토큰(start token) 및 가장 큰 제2확률을 갖는 토큰인 끝토큰(end token)을추출하는 과정; 및상기 시작토큰으로부터 상기 끝토큰까지의 구간에 해당하는 적어도 하나의 토큰을 상기 질의에 대응하는 상기답변으로서 추정하는 과정을 포함하는 것을 특징으로 하는 대화형 학습서비스 제공방법."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 추정된 답변을 제공하는 것에 응답하여, 상기 지문에 대한 사용자의 성취가 완료된 것으로 평가하는 과정을 더 포함하는 것을 특징으로 하는 대화형 학습방법."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 평가하는 과정은,상기 추정된 답변을 상기 사용자에게 제공하는 것에 응답하여 기 설정된 성취도점수(achievement score)를 부여공개특허 10-2023-0112469-3-하는 과정; 및서로 다른 질의에 대응하는 답변에 기초하여 부여된 성취도점수의 합계가 기 설정된 기준점수 이상인 경우, 상기 지문에 대한 사용자의 성취가 완료된 것으로 평가하는 과정을 포함하는 것을 특징으로 하는 대화형학습방법."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3 항에 있어서,상기 추정하는 과정은,상기 시작토큰의 제1확률 또는 상기 끝토큰의 제2확률이 기 설정된 기준확률보다 작은 것에 응답하여, 상기 질의는 부적절한 질의인 것으로 판단하는 과정을 포함하며,상기 제공하는 과정은, 상기 부적절한 질의를 교정하기 위하여, 텍스트 형태의 예시질의(sample query)를 제공하는 과정을 포함하는 것을 특징으로 하는 대화형 학습서비스 제공방법."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "사용자의 문해력을 향상시키기 위한 학습서비스 제공장치에 있어서,지문에 대한 텍스트 형태의 질의를 입력받는 입력부;상기 질의에 포함된 복수의 형태소에 기초하여, 상기 질의를 토큰화하는 분석부;토큰화된 질의 및 기 저장된 토큰화된 지문을 기 학습된 답변추출 모델에 입력하여, 상기 질의에 대응하는 답변을 추정하는 추정부; 및텍스트 형태의 추정된 답변을 제공하는 출력부를 포함하는 것을 특징으로 하는 학습서비스 제공장치."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 분석부는,상기 질의를 형태소 단위로 분절하여, 상기 형태소로부터 복수의 토큰을 생성하는 제1 분석부;생성된 토큰 사이에 태그를 부착하여, 토큰화된 질의를 생성하는 제2 분석부; 및상기 토큰화된 질의 앞에 분류토큰을 추가하는 제3 분석부를 포함하는 것을 특징으로 하는 학습서비스제공장치."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7 항에 있어서,상기 추정부는,상기 토큰화된 질의 및 상기 토큰화된 지문을 상기 답변추출 모델에 입력하여, 상기 토큰화된 지문에 포함된 각각의 토큰에 관한 제1확률 및 제2확률을 출력하는 제1 추정부;가장 큰 제1확률을 갖는 토큰인 시작토큰 및 가장 큰 제2확률을 갖는 토큰인 끝토큰을 추출하는 제2 추정부; 및상기 시작토큰으로부터 상기 끝토큰까지의 구간에 해당하는 적어도 하나의 토큰을 상기 질의에 대응하는 상기답변으로서 추정하는 제3 추정부를 포함하는 것을 특징으로 하는 학습서비스 제공장치."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7 항에 있어서,상기 추정된 답변을 제공하는 것에 응답하여, 상기 지문에 대한 사용자의 성취가 완료된 것으로 평가하는 평가공개특허 10-2023-0112469-4-부를 더 포함하는 것을 특징으로 하는 학습서비스 제공장치."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 평가부는,상기 추정된 답변을 상기 사용자에게 제공하는 것에 응답하여 기 설정된 성취도점수를 부여하는 제1 평가부; 및서로 다른 질의에 대응하는 답변에 기초하여 부여된 성취도점수의 합계가 기 설정된 기준점수 이상인 경우, 상기 지문에 대한 사용자의 성취가 완료된 것으로 평가하는 제2 평가부를 포함하는 것을 특징으로 하는 학습서비스 제공장치."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9 항에 있어서,상기 추정부는,상기 시작토큰의 제1확률 또는 상기 끝토큰의 제2확률이 기 설정된 기준확률보다 작은 것에 응답하여, 상기 질의는 부적절한 질의인 것으로 판단하는 판단부를 포함하며,상기 출력부는, 상기 부적절한 질의를 교정하기 위하여, 텍스트 형태의 예시질의를 제공하는 것을 특징으로 하는 학습서비스 제공장치."}
{"patent_id": "10-2022-0008759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1 항 내지 제6 항 중 어느 한 항에 따른 대화형 학습서비스 제공방법이 포함하는 각 과정을 실행시키기 위하여 컴퓨터로 읽을 수 있는 하나 이상의 기록매체에 각각 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 인공지능 챗봇에 기반한 대화형 국어 학습서비스 제공 방법 및 장치를 제공한다. 본 개시의 일 측면에 의하면, 대화형 학습서비스 제공장치에 의해 수행되는 대화형 학습서비스 제공방법에 있어 서, 지문(context)에 대한 텍스트 형태(text type)의 질의(query)를 입력받는 과정; 상기 질의에 포함된 복수의 형태소(morpheme)에 기초하여, 상기 질의를 토큰화(tokenization)하는 과정; 토큰화된 질의 및 기 저장된 토큰화 된 지문을 기 학습된 답변추출 모델(answer extraction model)에 입력하여, 상기 질의에 대응하는 답변을 추정하 는 과정; 및 텍스트 형태의 추정된 답변을 제공하는 과정을 포함하는 것을 특징으로 하는 대화형 학습서비스 제 공방법을 제공한다."}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공지능 챗봇에 기반한 대화형 국어 학습서비스 제공 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이하에 기술되는 내용은 단순히 본 개시의 실시예와 관련되는 배경 정보만을 제공할 뿐 종래기술을 구성하는 것 이 아니다. 최근 기계독해(MRC: Machine Reading Comprehension)를 이용하여 사용자의 질문 의도에 대응하는 답변을 생성하 는 대화형 시스템(interactive system)이 발전하고 있다. 대화형 시스템은 사용자와 대화하는 챗봇(chatbot)으 로서 구현될 수 있다. 챗봇은 사용자로부터 입력받은 질문의 의도를 분석한다. 챗봇의 동작 방식은 태스크 지향 다이얼로그(TOD: Task-Oriented Dialog) 또는 칫챗 다이얼로그(chit-chat dialog)로서 분류된다. 칫챗 다이얼 로그는 특정한 목적 없이, 사용자와 챗봇이 서로 소통하는 대화 방식이다. TOD는 특정한 목적에 대응하는 답변 을 생성하기 위한 대화 방식이다. TOD 방식에서, 챗봇에 의해 제공되는 답변들은 미리 정해진다. 챗봇은 사용자 의 질의 의도를 분석하고, 질의 의도에 대응하는 적절한 답변을 미리 정해진 답변들로부터 결정한다. 종래의 교육법으로서 교육의 상호 주체 간의 대화에 기초하여, 학습자의 학습 효율을 향상시키기 위한 하브루타 교육(havruta method)이 있다. 하브루타는 히브리어에서, 우정 또는 동료를 의미하는 단어이다. 하브루타 교육 은, 동일한 주제에 관한 교육자(tutor)와 학습자(tutee) 간의 대화에 기초하여, 학습자가 지식을 습득해 나가는 교육 방식이다. 하브루타 교육에서, 주어진 주제에 관한 학습자의 질의에 응답하여, 교육자는 적절한 답변을 제 공한다. 학습자는 단순히 교육자의 강의를 수강하는 방식과 달리, 의문사항에 관한 질의를 생성한다. 학습자는 스스로 생성한 질의에 상응하는 답변을 제공받으므로, 일방적으로 강의를 수강할 때와 대비하여 학습자의 학업 성취도가 향상될 수 있다. 하지만, 교육자의 수는 한정되어 있으므로, 하브루타 학습서비스를 이용할 수 있는 학습자의 수 또한 제한되는 문제가 있다. 학습자의 질의를 분석하여 답변을 제공하는 방법 및 장치는 교육자의 수와 관계없이 복수의 학습 자에게 하브루타 교육을 제공할 수 있다. 따라서, 하브루타 교육과 기계독해를 결합하여, 질의 학습서비스 제공 하는 기술이 필요하다."}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 일 측면에 의하면, 사용자의 질의를 분석하고 질의에 대응하는 답변을 생성하는 대화형 국어 학습서 비스 제공 방법 및 장치를 제공하는 데 주된 목적이 있다."}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 대화형 학습서비스 제공장치에 의해 수행되는 대화형 학습서비스 제공방법에 있 어서, 지문(context)에 대한 텍스트 형태(text type)의 질의(query)를 입력받는 과정; 상기 질의에 포함된 복수 의 형태소(morpheme)에 기초하여, 상기 질의를 토큰화(tokenization)하는 과정; 토큰화된 질의 및 기 저장된 토 큰화된 지문을 기 학습된 답변추출 모델(answer extraction model)에 입력하여, 상기 질의에 대응하는 답변을 추정하는 과정; 및 텍스트 형태의 추정된 답변을 제공하는 과정을 포함하는 것을 특징으로 하는 대화형 학습서 비스 제공방법을 제공한다. 본 개시의 다른 실시예에 따르면, 대화형 학습서비스 제공장치에 있어서, 지문에 대한 텍스트 형태의 질의를 입 력받는 입력부; 상기 질의에 포함된 복수의 형태소에 기초하여, 상기 질의를 토큰화하는 분석부; 토큰화된 질의 및 기 저장된 토큰화된 지문을 기 학습된 답변추출 모델에 입력하여, 상기 질의에 대응하는 답변을 추정하는 추 정부; 및 텍스트 형태의 추정된 답변을 제공하는 출력부를 포함하는 것을 특징으로 하는 대화형 학습서비스 제 공장치를 제공한다. 본 개시의 또 다른 실시예에 따르면, 대화형 학습서비스 제공방법이 포함하는 각 과정을 실행시키기 위하여 컴 퓨터로 읽을 수 있는 하나 이상의 기록매체에 각각 저장된 컴퓨터 프로그램을 제공한다."}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시예에 의하면, 주어진 단락과 관련된 질문에 대응하는 답변을 출력하는 방식의 대화형 학습에 의하여 사용자의 문해력이 향상되는 효과가 있다."}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다.또한, 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본 질이나 차례 또는 순서 등이 한정되지 않는다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 '포함', '구비' 한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한 명세서에 기재된 '~부', '모듈' 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현 될 수 있다. 본 개시는 인공지능 챗봇에 기반한 대화형 국어 학습서비스 제공 방법 및 그를 위한 장치를 제공한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 개시의 예시적인 실시 형태를 설명하고자 하는 것이며, 본 개시가 실시될 수 있는 유일한 실시 형태를 나타내고자 하는 것이 아니다. 도 1은 본 개시의 일 실시예에 따른 학습서비스 제공 시스템을 설명하기 위한 개념도이다. 본 개시의 일 실시예에 따른 학습서비스 제공 시스템(learning service providing system, 10)은 학습서비스 제공장치 및 사용자단말(user equipment, 102)을 포함한다. 학습서비스 제공장치는 네트워크(network, 104)를 통하여 사용자단말에 다양한 주제에 관한 지문 (context)을 제공한다. 일 실시예에서, 학습서비스 제공장치는 사용자 인터페이스(user interface) 상에서 텍스트 형태의 지문을 제공할 수 있다. 다른 실시예에서, 학습서비스 제공장치는 지문 내용에 대응하는 음 성데이터를 제공할 수도 있다. 학습서비스 제공장치는 주어진 지문과 관련된 질의(query)를 사용자단말 로부터 입력받는다. 학습서비스 제공장치는 입력된 질의를 분석하고, 질의에 대응하는 답변(answer) 을 사용자단말에 제공한다. 학습서비스 제공장치에 의하여 제공되는 대화형 국어학습 방법으로 인하 여, 사용자의 문해력이 향상된다. 네트워크는 학습서비스 제공장치와 사용자단말 간의 유선 또 는 무선 연결을 지원한다. 네트워크는 인트라넷, 인터넷, 무선 데이터 통신과 같은 유무선 통신 기술을 이 용하여 데이터를 송수신할 수 있는 네트워크를 포함한다. 네트워크는 LAN(Local Area Network), WAN(Wide Area Network), CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), LTE(Long Term Evolution) 및 5G 네트워크를 통칭한다. 하지만, 네트워크의 구체적인 구현 방식은 이에 제 한되지 않는다. 사용자단말은 사용자의 장치로서, 사용자는 사용자단말을 이용하여 대화형 국어 학습서비스를 제공받 는다. 사용자는 사용자단말의 디스플레이 또는 스피커를 통하여, 사용자 인터페이스 상에서 제공되는 지문 을 인지한다. 사용자는 사용자단말을 이용하여, 지문과 관련된 질의를 입력하고, 학습서비스 제공장치 로부터 질의에 대응하는 답변을 제공받는다. 사용자단말은 네트워크를 통해 다른 단말에 접속할 수 있는 데스크탑 PC(desktop Personal Computer), 랩탑(laptop), 워크스테이션(workstation), 서버 및 이동 단말 기를 포함한다. 이동 단말기는 스마트폰(smartphone), 태블릿 PC(tablet Personal Computer) 및 PDA(Personal Digital Assistant)를 포함하는 무선 통신 장치를 포함한다. 도 2는 본 개시의 일 실시예에 따른 학습서비스 제공장치가 포함하는 각 구성을 설명하기 위한 블록구성도이다. 본 개시의 일 실시예에 따른 학습서비스 제공장치는 입력부(input interface, 200), 분석부(analyzer, 202), 추정부(estimator, 204), 출력부(output interface, 206) 및 평가부(evaluator, 208)를 전부 또는 일부 포함한다. 도 2에 도시된 학습서비스 제공장치는 본 개시의 일 실시예에 따른 것으로서, 도 2에 도시된 모 든 블록이 필수 구성요소는 아니며, 다른 실시예에서 학습서비스 제공장치에 포함된 일부 블록이 추가, 변 경 또는 삭제될 수 있다. 예컨대, 학습서비스 제공장치는 질의에 대응하는 답변이 출력되도록 답변추출 모 델(answer extraction model)을 학습시키는 모델훈련부(model trainer, 미도시)를 더 포함할 수 있다. 모델훈 련부는 학습데이터를 이용하여, 답변추출 모델을 학습시킨다. 여기서, 학습데이터는 정제된 코퍼스(corpus)로부 터 생성된 텍스트 데이터일 수 있다. 정제된 코퍼스는 원시문서(primitive document)로부터 노이즈 데이터 (noise date)를 제거한 말뭉치 데이터를 의미한다. 모델 훈련부는 사용자의 문해력 수준에 따라 다양한 수준의 학습서비스를 제공하기 위하여, 복수의 교과과정의 원시문서로부터 정제된 코퍼스를 학습데이터로서 이용할 수 있다. 답변추출 모델은 입력된 질의에 대응하는 답변을 출력하도록, 학습데이터를 이용하여 반복적으로 학습한 다. 답변추출 모델에 포함된 인코더(encoder) 및 디코더(decoder)의 파라미터들은 반복되는 학습에 따라 업데이 트된다. 모델 훈련부는 답변추출 모델의 파라미터가 수렴할 때까지 답변추출 모델을 반복적으로 학습시킬 수 있 다. 일 실시예에서, 답변추출 모델의 인코더는 양방향으로 데이터를 처리하는 양방향 인코더(bidirectionalencoder)일 수 있다. 코퍼스에 기초한 학습데이터를 이용하여, 질의에 대응하는 응답을 출력하도록 언어모델(QA"}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "language model)을 학습시키는 구체적인 방법은 해당 기술분야에서 일반적인 바, 더 이상의 설명은 생략한다. 이하, 도 2를 참조하여 학습서비스 제공장치에 포함된 각각의 구성에 대하여 설명한다. 입력부는 지문에 대한 텍스트 형태의 질의를 입력받는다. 여기서, 지문은 사용자의 수준에 대응하는 학습 서비스 제공장치에 기 저장된 국어지문(Korean language context)을 의미한다. 지문은 교육과정에 대응하 는 교과서 또는 학습자료에 기초하여 생성된 자료로서, 학습서비스 제공장치에 미리 저장된다. 지문은 사 용자단말의 인터페이스를 통하여 사용자에게 제공될 수 있다. 사용자에 의하여 사용자단말에 입력된 질의는 네트워크를 통하여 입력부에 전달된다. 분석부는 질의에 포함된 복수의 형태소(morpheme)에 기초하여, 입력된 질의를 토큰화한다. 분석부는 제1 분석부(미도시), 제2 분석부(미도시) 및 제3 분석부(미도시)를 포함한다. 제1 분석부는 질의를 형태소 단위로 분절하여, 형태소로부터 복수의 토큰(token)을 생성한다. 형태소 단위로 분"}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "절된 질의에 기초하여 토큰을 생성하는 구체적인 방법은 해당 기술분야에서 일반적인 바, 자세한 설명은 생략한 다. 제2 분석부는 생성된 토큰 사이에 태그를 부착하여, 토큰화된 질의를 생성한다. 여기서, 태그는 생성된 각각의 토큰을 구분하는 기호로서, 물결표와 같은 기호를 의미한다. 제3 분석부는 토큰화된 질의 앞에 분류토큰(classification token)을 추가한다. 분류토큰은 [CLS] 와 같이 구분 할 수 있으며, 모델 입력값의 가장 첫번째 토큰으로서 삽입된다. 분석부에 포함된 제1 분석부 내지 제3 분석부 의 동작에 따라, 사용자단말로부터 수신한 질의가 분석 가능하도록 정량화된다. 추정부는 토큰화된 질의 및 기 저장된 토큰화된 지문을 기 학습된 답변추출 모델에 입력하여, 질의에 대응 하는 답변을 추정한다. 여기서, 토큰화된 지문은 분석부의 동작과 같은 방식으로 미리 정량화된 지문을 의 미한다. 추정부는 제1 분석부(미도시), 제2 분석부(미도시) 및 제3 분석부(미도시)를 포함한다. 제1 추정부는 토큰화된 질의 및 토큰화된 지문을 답변추출 모델에 입력하여, 토큰화된 지문에 포함된 각각의 토 큰에 관한 제1 확률(first probability) 및 제2 확률(second probability)을 출력한다. 제1 확률 및 제2 확률 은 답변추출 모델의 출력값으로서, 확률의 구체적인 수치는 답변추출 모델의 학습방법 및 학습수준에 따라 변경 될 수 있다. 여기서, 제1 확률은 토큰이 답변의 시작에 해당할 확률을 의미한다. 지문에 포함된 각각의 토큰에 대한 제1 확률을 모두 더하면 1 이 된다. 제2 확률은 토큰이 답변의 끝에 해당할 확률을 의미한다. 지문에 포함 된 각각의 토큰에 대한 제2 확률을 모두 더하면 1 이 된다. 제2 추정부는 가장 큰 제1확률을 갖는 토큰인 시작토큰(start token) 및 가장 큰 제2확률을 갖는 토큰인 끝토큰 (end token)을 추출한다. 시작토큰은 답변의 시작에 해당할 확률이 가장 큰 토큰을 의미한다. 끝토큰은 답변의 끝에 해당할 확률이 가장 큰 토큰을 의미한다. 제2 추정부가 자료구조(data structure)로부터 시작토큰 및 끝토 큰을 추출하는 방법은, 토큰들을 저장하는 자료구조의 형태에 따라 다양하게 변경될 수 있다. 제3 추정부는 시작토큰으로부터 끝토큰까지의 구간에 해당하는 적어도 하나의 토큰을 질의에 대응하는 답변으로 서 추정한다. 예컨대, 제3 추정부는 자료구조에서, 시작토큰에서부터 출발하여 끝토큰까지 도달하는 경로(pat h)에 존재하는 적어도 하나의 토큰을 추출할 수 있다. 제3 추정부는 경로 상의 토큰을 연속적으로 나열함으로써, 질의에 대응하는 답변을 추정할 수 있다. 출력부는 텍스트 형태의 추정된 답변을 제공한다. 예컨대, 출력부는 사용자단말의 인터페이스 상에 답변을 제공하기 위하여, 제3 추정부에 의하여 추정된 답변을 후처리할 수 있다. 평가부는 추정된 답변을 제공하는 것에 응답하여, 지문에 대한 사용자의 성취가 완료된 것으로 평가한다. 다른 실시예에서, 평가부는 제1 평가부(미도시) 및 제2 평가부(미도시)를 포함한다. 제1 평가부는 추정된 답변을 사용자에게 제공하는 것에 응답하여 기 설정된 성취도점수를 부여한다. 제1 평가부는 사용자로 하여금 같은 지문으로부터 서로 다른 복수의 질의를 생성하도록, 사용자의 질의에 의하여 지문과 관련된 답변이 도출되 는 것에 응답하여 성취도점수(achievement score)를 부여한다. 여기서, 성취도점수의 구체적인 수치는 본 개시 의 실시예에 따라 다양하게 변경될 수 있다. 제2 평가부는 서로 다른 질의에 대응하는 답변에 기초하여 부여된 성취도점수의 합계가 기 설정된 기준점수 이상인 경우, 지문에 대한 사용자의 성취가 완료된 것으로 평가한다. 여기서, 기준점수의 구체적인 수치는 본 개시의 실시예에 따라 다양하게 변경될 수 있다. 평가부가 존재하 지 않는 경우, 사용자의 문해력에 관한 평가가 정량적으로 이루어질 수 없다. 하지만, 평가부가 기준점수이상의 성취도점수를 획득한 경우 사용자의 성취가 완료된 것으로 판단하므로, 사용자가 문해력의 성취도를 스 스로 확인할 수 있게 되는 효과가 있다. 도 3은 본 개시의 일 실시예에 따른 학습서비스 제공장치가 질의에 응답하는 답변을 제공하는 것을 설명하기 위 한 예시도이다. 이하, 도 3을 참조하여 학습서비스 제공장치의 세부 동작을 설명한다. 도 3A 내지 도 3C에 도시된 지문, 질의 및 답변은 모두 일 예시로서, 학습서비스 제공장치에 의하여 제공되는 지문 및 답변은 도 3의 실시예 에 제한되지 않는다. 도 3A를 참조하면, 사용자 인터페이스 상에 제공되는 지문 및 예시질의가 도시되어 있다. 지문 은 적설량이 많은 지역에서 신을 수 있는 신발인 설피에 관한 설명자료이다. 예시질의는 사용자의 질의 작 성을 돕기 위한 질의이다. 사용자는 예시질의를 참조하여, 지문의 이해를 확인할 수 있는 질의를 작 성한다. 도 3B를 참조하면, 사용자단말에 의하여 전송된 질의가 도시되어 있다. 학습서비스 제공장치는 사용자에 의하여 작성된 질의를 분석한다. 학습서비스 제공장치는 질의를 형태소 단위로 분석하 여, 토큰을 생성한다. 학습서비스 제공장치는 생성된 토큰 사이에 태그를 부착하여, 토큰화된 질의를 생성 한다. 학습서비스 제공장치가 질의에 기초하여 생성한 토큰 및 토큰화된 질의는 표 1과 같다. 표 1"}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "학습서비스 제공장치는 토큰화된 질의에 분류토큰 [CLS]를 부착한다. 학습서비스 제공장치는 기 저장 된 토큰화된 지문의 시작과 끝에 각각 특별토큰 [SEP]를 부착한다. 학습서비스 제공장치는 분류토큰이 부 착된 토큰화된 질의 및 특별토큰이 부착된 토큰화된 지문을 기 학습된 답변추출 모델에 입력한다. 답변추출 모 델의 입력은 표 2와 같다. 표 2"}
{"patent_id": "10-2022-0008759", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 5, "content": "도 3C를 참조하면, 학습서비스 제공장치에 의하여 제공된 답변이 도시되어 있다. 학습서비스 제공장 치는 답변추출 모델에 의해 출력된 각각의 토큰에 대한 제1 확률 및 제2 확률에 기초하여, 사용자의 질의 에 대응하는 답변을 추정한다. 각각의 토큰에 대한 제1 확률 및 제2 확률의 구체적인 수치는 답변추출 모 델의 학습방법 및 학습수준에 따라 변경될 수 있다. 학습서비스 제공장치는 답변추출 모델에 의하여 출력 된 제1 확률의 집합에서, 가장 큰 제1 확률을 갖는 '서너'를 시작토큰으로서 추출한다. 학습서비스 제공장치 는 답변추출 모델에 의하여 출력된 제2 확률의 집합에서, 가장 큰 제2 확률을 갖는 '배'를 끝토큰으로서 추출한다. 학습서비스 제공장치는 시작토큰으로부터 끝토큰까지의 구간에 존재하는 토큰들인 '서너 배'를 텍스트의 형태로 사용자단말에 제공한다. 사용자는 지문과 관련된 질의를 수행하고, 학습서비스 제공장치로부터 질의에 대응하는 답변을 제공받는다. 따라서, 사용자는 지문에 대한 이해 가 완료되었음을 스스로 확인할 수 있게 된다. 학습서비스 제공장치는, 도면에는 도시되지 않았으나, 사용자의 유효한 질의 및 답변이 기 설정된 횟수 이 상 이루어지는 경우, 주어진 지문에 대한 사용자의 이해가 충분히 성취된 것으로 판단한다. 사용자의 성취 도를 평가하기 위한 질의 및 답변의 횟수는 본 개시의 실시예에 따라 변경될 수 있다. 다른 실시예에서, 학습서 비스 제공장치는 추정된 답변을 사용자에게 제공하는 것에 응답하여 기 설정된 성취도점수(achievement score)를 부여할 수 있다. 학습서비스 제공장치는 서로 다른 질의에 대응하는 답변에 기초하여 부여된 성 취도점수의 합계가 기 설정된 기준점수 이상인 경우, 사용자의 이해가 충분히 성취된 것으로 판단한다. 도 3에따른 학습서비스 제공장치의 동작에 따라, 하브루타 교육에서 추구하는 대화에 기반한 양방향 학습에 기초 하여 사용자의 국어 문해력이 향상되는 효과가 있다. 도 4는 본 개시의 다른 실시예에 따른 학습서비스 제공장치가 질의에 응답하는 답변을 제공하는 것을 설명하기 위한 예시도이다. 이하, 도 4를 참조하여 학습서비스 제공장치의 세부 동작을 설명한다. 도 4A 내지 도 4D에 도시된 지문, 질의 및 답변은 모두 일 예시로서, 학습서비스 제공장치에 의하여 제공되는 지문 및 답변은 도 4의 실시예 에 제한되지 않는다. 도 4를 참조하여 학습서비스 제공장치의 세부 동작을 설명함에 있어, 도 3의 실시예 와 같은 방식으로 동작하는 구성의 경우, 중복되는 설명은 생략한다. 도 4A를 참조하면, 사용자 인터페이스 상에 제공되는 지문이 도시되어 있다. 예시질의가 함께 제공되 는 도 3A의 실시예와는 다르게, 도 4A의 실시예에서는 지문만 사용자단말에 제공될 수 있다. 도 4B를 참조하면, 사용자단말에 의해 전송된 부적절한 질의가 도시되어 있다. 도 4B에 도시된 지문 은 전기 기구의 안전한 사용 방법에 관한 국어지문이다. 하지만, 사용자의 질의는 전기세탁기의 가격 에 관한 것이므로, 학습서비스 제공장치는 사용자의 질의를 부적절한 질의인 것으로 판단한다. 구체 적으로, 학습서비스 제공장치는 질의로부터 토큰화된 질의를 생성한다. 학습서비스 제공장치는 지문에 대응하는 토큰화된 지문을 호출한다. 학습서비스 제공장치는 분류토큰이 부착된 토큰화된 질 의 및 특별토큰이 부착된 토큰화된 지문을 답변추출 모델에 입력한다. 학습서비스 제공장치는 답변추출 모 델의 출력 중에서, 가장 큰 제1 확률을 갖는 시작토큰 및 가장 큰 제2 확률을 갖는 끝토큰을 추출한다. 학습서 비스 제공장치에 포함된 판단부(determinator, 미도시)는 시작토큰의 제1 확률 및 끝토큰의 제2 확률을 기 설정된 기준확률(standard probability)과 비교한다. 부적절한 질의인지 여부를 판단하기 위한 기준확률은 본 개시의 실시예에 따라 다양하게 변경될 수 있다. 판단부는 시작토큰의 제1 확률 또는 끝토큰의 제2 확률이 기 설정된 기준확률보다 작은 경우, 사용자의 질의를 부적절한 질의인 것으로 판단한다. 토큰이 정답의 시 작 또는 끝에 해당하는 경우, 제1 확률 또는 제2 확률이 다른 토큰의 제1 확률 또는 제2 확률보다 매우 커야 한 다. 따라서, 판단부는 제1 확률 또는 제2 확률이 기준확률보다 작은 경우, 정답의 시작 또는 끝이 존재하지 않 는 것으로 판단한다. 판단부는 정답의 시작 또는 끝을 출력할 수 없는 질의를 부적절한 질의인 것으로 판단한다. 도 4C를 참조하면, 부적절한 질의에 응답하여 제공되는 안내 및 예시질의가 도시되어 있다. 학습서비 스 제공장치는, 부적절한 질의를 교정하기 위하여, 텍스트 형태의 예시질의를 제공한다. 사용자는 학 습서비스 제공장치로부터 부적절한 질의에 관한 안내를 제공받는 경우, 지문과 관련되지 않는 부적절한 질의를 생성했음을 인지하게 된다. 사용자는 학습서비스 제공장치로부터 제공받은 예시질의 에 기초하여, 지문과 관련된 질의를 생성할 수 있게 되는 효과가 있다. 도 4D를 참조하면, 사용자단말로부터 전송된 적절한 질의 및 적절한 질의에 대응하는 답변이 도 시되어 있다. 학습서비스 제공장치는 도 3에서 설명한 방법과 같은 방식을 이용하여, 사용자의 적절한 질 의에 대응하는 답변을 제공한다. 학습서비스 제공장치는 사용자의 질의(402 및 406)가 적절한지 여부를 판단한다. 학습서비스 제공장치는 사용자의 질의가 부적절한 질의인 것으로 판단하는 경우, 안내 및 예시질의를 제공한다. 따라서, 사용자는 지문과 관련된 질의를 생성하였는지를 스스로 확인할 수 있게 되는 효과가 있다. 도 5는 본 개시의 일 실시예에 따른 학습서비스 제공방법이 포함하는 각 과정을 설명하기 위한 순서도이다. 이하 도 5를 참조하여, 사용자의 문해력을 향상시키기 위하여 학습서비스 제공장치에 의하여 수행되는 학 습서비스 제공방법이 포함하는 각 과정을 설명한다. 학습서비스 제공장치의 세부 동작에 있어서, 도 1 내 지 도 4에서 설명한 중복되는 내용은 생략한다. 학습서비스 제공장치는 지문에 대한 텍스트 형태의 질의(query)를 입력받는다(S500). 학습서비스 제공장치는 질의에 포함된 복수의 형태소에 기초하여, 질의를 토큰화한다(S502). 학습서비스 제공장치는 토큰화된 질의 및 기 저장된 토큰화된 지문을 기 학습된 답변추출 모델에 입력하여, 질의에 대응하는 답변을 추정한다(S504). 학습서비스 제공장치는 텍스트 형태의 추정된 답변을 제공한다(S506). 도 6은 본 개시의 일 실시예에 따른 학습서비스 제공방법이 포함하는 토큰화 과정을 설명하기 위한 순서도이다. 학습서비스 제공방법에서 토큰화하는 과정 S502는 다음의 각 과정을 더 포함한다. 학습서비스 제공장치는 질의를 형태소 단위로 분절하여, 형태소로부터 복수의 토큰을 생성한다(S600). 학습서비스 제공장치는 생성된 토큰 사이에 태그를 부착하여, 토큰화된 질의를 생성한다(S602). 학습서비스 제공장치는 토큰화된 질의 앞에 분류토큰을 추가한다(S604). 도 7은 본 개시의 일 실시예에 따른 학습서비스 제공방법이 포함하는 추정 과정을 설명하기 위한 순서도이다. 학습서비스 제공방법에서 추정 과정 S504는 다음의 각 과정을 더 포함한다. 학습서비스 제공장치는 토큰화된 질의 및 토큰화된 지문을 답변추출 모델에 입력하여, 토큰화된 지문에 포 함된 각각의 토큰에 관한 제1확률 및 제2확률을 출력한다(S700). 학습서비스 제공장치는 가장 큰 제1확률을 갖는 토큰인 시작토큰 및 가장 큰 제2확률을 갖는 토큰인 끝토 큰을 추출한다(S702). 학습서비스 제공장치는 시작토큰의 제1확률 및 끝토큰의 제2확률이 기 설정된 기준확률 이상인지 여부를 판단한다(S704). 학습서비스 제공장치는 시작토큰의 제1확률 및 끝토큰의 제2확률이 기 설정된 기준확률 이상인 경우, 시작 토큰으로부터 끝토큰까지의 구간에 해당하는 적어도 하나의 토큰을 질의에 대응하는 답변으로서 추정한다 (S706). 학습서비스 제공장치는 추정된 답변을 제공하는 것에 응답하여, 지문에 대한 사용자의 성취가 완 료된 것으로 평가한다. 학습서비스 제공장치는 시작토큰의 제1확률 또는 끝토큰의 제2확률이 기 설정된 기준확률 미만인 경우, 입 력된 질의를 부적절한 질의인 것으로 판단한다(S708). 학습서비스 제공장치는 부적절한 질의를 교정하기 위하여, 텍스트 형태의 예시질의를 제공한다. 도 8은 본 개시의 일 실시예에 따른 학습서비스 제공방법이 포함하는 평가 과정을 설명하기 위한 순서도이다. 학습서비스 제공방법은 사용자의 지문에 대한 성취도를 평가하는 과정을 더 포함한다. 학습서비스 제공장치는 기 학습된 답변추출 모델을 이용하여, 사용자의 질의에 대응하는 답변을 텍스트 형 태로 제공한다(S800). 학습서비스 제공장치는 추정된 답변을 사용자에게 제공하는 것에 응답하여 기 설정된 성취도점수를 부여한 다(S802). 학습서비스 제공장치는 서로 다른 질의에 대응하는 답변에 기초하여 부여된 성취도점수의 합계가 기 설정 된 기준점수 이상인지 여부를 판단한다(S804). 학습서비스 제공장치는 동일한 질의에 대응하여 제공된 답 변에 대해서는 1 회의 성취도점수만 제공한다. 학습서비스 제공장치는 서로 다른 질의에 대응하는 답변에 기초하여 부여된 성취도점수의 합계가 기 설정 된 기준점수 이상인 경우, 지문에 대한 사용자의 성취가 완료된 것으로 평가한다(S806). 학습서비스 제공장치는 서로 다른 질의에 대응하는 답변에 기초하여 부여된 성취도점수의 합계가 기 설정 된 기준점수 미만인 경우, 지문에 대한 사용자의 성취가 완료되지 않은 것으로 평가한다(S808). 순서도에서는 각각의 과정들을 순차적으로 실행하는 것으로 기재하고 있으나, 이는 본 발명의 일부 실시예의 기 술 사상을 예시적으로 설명한 것에 불과하다. 다시 말해, 본 발명의 일부 실시예가 속하는 기술 분야에서 통상 의 지식을 가진 자라면 본 발명의 일부 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 순서도에 기재된 과정을 변경하여 실행하거나 각각의 과정 중 하나 이상의 과정을 병렬적으로 실행하는 것으로 다양하게 수정 및 변형하여 적용 가능할 것이므로, 순서도는 시계열적인 순서로 한정되는 것은 아니다. 본 명세서에 설명되는 장치 및 방법의 다양한 구현예들은, 디지털 전자 회로, 집적 회로, FPGA(Field Programmable Gate Array), ASIC(Application Specific Integrated Circuit), 컴퓨터 하드웨어, 펌웨어, 소프 트웨어, 및/또는 이들의 조합으로 실현될 수 있다. 이러한 다양한 구현예들은 프로그래밍가능 시스템상에서 실 행 가능한 하나 이상의 컴퓨터 프로그램들로 구현되는 것을 포함할 수 있다. 프로그래밍가능 시스템은, 저장 시스템, 적어도 하나의 입력 디바이스, 그리고 적어도 하나의 출력 디바이스로부터 데이터 및 명령들을 수신하고 이들에게 데이터 및 명령들을 전송하도록 결합되는 적어도 하나의 프로그래밍가능 프로세서(이것은 특수 목적 프로세서일 수 있거나 혹은 범용 프로세서일 수 있음)를 포함한다. 컴퓨터 프로그램들(이것은 또한 프로그램들, 소프트웨어, 소프트웨어 애플리케이션들 혹은 코드로서 알려져 있음)은 프로그래밍가능 프로세서에 대한 명령어 들을 포함하며 \"컴퓨터가 읽을 수 있는 기록매체\"에 저장된다. 컴퓨터가 읽을 수 있는 기록매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기 록장치를 포함한다. 이러한 컴퓨터가 읽을 수 있는 기록매체는 ROM, CD-ROM, 자기 테이프, 플로피디스크, 메모 리 카드, 하드 디스크, 광자기 디스크, 스토리지 디바이스 등의 비휘발성(non-volatile) 또는 비 일시적인(non- transitory) 매체 또는 데이터 전송 매체(data transmission medium)와 같은 일시적인(transitory) 매체를 더 포함할 수도 있다. 또한, 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분 산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수도 있다. 본 명세서에 설명되는 장치 및 방법의 다양한 구현예들은, 프로그램가능 컴퓨터에 의하여 구현될 수 있다. 여기 서, 컴퓨터는 프로그램가능 프로세서, 데이터 저장 시스템(휘발성 메모리, 비휘발성 메모리, 또는 다른 종류의 저장 시스템이거나 이들의 조합을 포함함) 및 적어도 한 개의 커뮤니케이션 인터페이스를 포함한다. 예컨대, 프 로그램가능 컴퓨터는 서버, 네트워크 기기, 셋탑 박스, 내장형 장치, 컴퓨터 확장 모듈, 개인용 컴퓨터, 랩탑, PDA(Personal Data Assistant), 클라우드 컴퓨팅 시스템 또는 모바일 장치 중 하나일 수 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명의 실시예들은 본 실시 예의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 실시예의 기술 사상의 범위가 한정되는 것은 아니다. 본 실시예의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그 와 동등한 범위 내에 있는 모든 기술 사상은 본 실시예의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0008759", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 학습서비스 제공 시스템을 설명하기 위한 개념도이다. 도 2는 본 개시의 일 실시예에 따른 학습서비스 제공장치가 포함하는 각 구성을 설명하기 위한 블록구성도이다. 도 3은 본 개시의 일 실시예에 따른 학습서비스 제공장치가 질의에 응답하는 답변을 제공하는 것을 설명하기 위 한 예시도이다. 도 4는 본 개시의 다른 실시예에 따른 학습서비스 제공장치가 질의에 응답하는 답변을 제공하는 것을 설명하기 위한 예시도이다. 도 5는 본 개시의 일 실시예에 따른 학습서비스 제공방법이 포함하는 각 과정을 설명하기 위한 순서도이다. 도 6은 본 개시의 일 실시예에 따른 학습서비스 제공방법이 포함하는 토큰화 과정을 설명하기 위한 순서도이다. 도 7은 본 개시의 일 실시예에 따른 학습서비스 제공방법이 포함하는 추정 과정을 설명하기 위한 순서도이다. 도 8은 본 개시의 일 실시예에 따른 학습서비스 제공방법이 포함하는 평가 과정을 설명하기 위한 순서도이다."}
