{"patent_id": "10-2023-0028175", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0135103", "출원번호": "10-2023-0028175", "발명의 명칭": "GRU 신경망 기반의 예측 모델을 이용하여 SCU 검사 장비의 고장을 예측하기 위한 전자 장치", "출원인": "한국공학대학교산학협력단", "발명자": "오성현"}}
{"patent_id": "10-2023-0028175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "GRU(gated recurrent unit) 신경망 기반의 예측 모델을 이용하여 SCU(shift by wire control unit) 검사 장비의 고장을 예측하기 위한 전자 장치에 있어서,디스플레이,통신 인터페이스, 및프로세서를 포함하고, 상기 프로세서는,상기 통신 인터페이스를 통하여 상기 SCU 검사 장비의 전압 관련 기능 보드로부터 출력 전압 값을 획득하는 경우, 상기 출력 전압 값을 상기 GRU 신경망 기반의 예측 모델에 입력하여, 상기 출력 전압 값에 대응하는 예측전압 값을 획득하고, 및상기 통신 인터페이스를 통하여 상기 SCU 검사 장비의 주파수 관련 기능 보드로부터 출력 주파수 값을 획득하는경우, 상기 출력 주파수 값을 GRU 신경망 기반의 예측 모델에 입력하여, 상기 출력 주파수 값에 대응하는 예측주파수 값을 획득하도록 설정되고,상기 GRU 신경망 기반의 예측 모델은, (i)시간 경과에 따른 전압 값들 및 시간 경과에 따른 주파수 값들에 기반하여 학습되고, (ii)특정 전압 값을 입력 받으면 기설정된 제1 기간이 경과된 시점의 예측 전압 값을 출력하고,(iii)특정 주파수 값을 입력 받으면 기설정된 제2 기간이 경과된 시점의 예측 주파수 값을 출력하도록설정되는,전자 장치."}
{"patent_id": "10-2023-0028175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 프로세서는,미리 정해진 제1 주기에 따라 상기 전압 관련 기능 보드에서 출력되는 전압 값을 획득하고, 및미리 정해진 제2 주기에 따라 상기 주파수 관련 기능 보드로부터 출력되는 주파수 값을 획득하도록 설정된,전자 장치."}
{"patent_id": "10-2023-0028175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 프로세서는,제1 시점에 상기 전압 관련 기능 보드로부터 상기 출력 전압 값을 획득하는 경우, 상기 출력 전압 값을 상기GRU 신경망 기반의 예측 모델에 입력하여, 상기 제1 시점으로부터 30일이 경과한 시점에서의 상기 출력 전압 값에 대응하는 예측 전압 값을 획득하고, 및제2 시점에 상기 주파수 관련 기능 보드로부터 상기 출력 주파수 값을 획득하는 경우, 상기 출력 주파수 값을상기 GRU 신경망 기반의 예측 모델에 입력하여, 상기 제2 시점으로부터 30일이 경과한 시점에서의 상기 출력 주파수 값에 대응하는 예측 주파수 값을 획득하도록 설정된,공개특허 10-2024-0135103-3-전자 장치."}
{"patent_id": "10-2023-0028175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 프로세서는,상기 예측 전압 값이 기설정된 전압 범위 내에 존재하지 않은 경우, 상기 디스플레이를 통하여 상기 전압 관련기능 보드의 상태 이상에 대한 메시지를 표시하고, 및상기 예측 주파수 값이 기설정된 주파수 범위 내에 존재하지 않은 경우, 상기 디스플레이를 통하여 상기 주파수관련 기능 보드의 상태 이상에 대한 메시지를 표시하도록 설정된,전자 장치."}
{"patent_id": "10-2023-0028175", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예들에 따라서, GRU(gated recurrent unit) 신경망 기반의 예측 모델을 이용하여 SCU(shift by wire control unit) 검사 장비의 고장을 예측하기 위한 전자 장치는, 디스플레이, 통신 인터페이스, 및 프로세서를 포 함하고, 상기 프로세서는, 상기 통신 인터페이스를 통하여 상기 SCU 검사 장비의 전압 관련 기능 보드로부터 출 (뒷면에 계속)"}
{"patent_id": "10-2023-0028175", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는, GRU(gated recurrent unit) 신경망 기반의 예측 모델을 이용하여 SCU(shift by wire control unit) 검사 장비의 고장을 예측하기 위한 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0028175", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 AI(artificial intelligence) 기술의 성장에 따라 수많은 응용 분야가 연구되고 있다. 그 중에서도 무인으 로 운영되는 생산자동화 공장의 경우 장비의 효율적인 유지 보수를 위해 AI 기술의 적용이 필수적이다. 이에 따 라, 최근에는 생산자동화 공장 내 장비의 예지 보전을 수행하기 위해 PdM(predictive Maintenance) 기술이 연구 되고 있다. PdM 기술은 장비의 상태를 실시간으로 진단할 뿐만 아니라 미래의 상태를 예측하여 관리의 효율성을 높이므로 장비의 수명을 최적화할 수 있다. 또한, PdM 기술은 AI를 기반으로 생산자동화 공장에서 발생하는 장 비의 고장 여부를 정확히 판단할 수 있다. 따라서, 장비 문제에 따른 불량률을 최소화하여 생산자동화 공장의 생산률을 최대화할 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허공개번호 10-2021-0109293호 (공개일자: 2021.09.06) (특허문헌 0002) 특허등록번호 10-2176638호 (등록일자: 2020.11.03)"}
{"patent_id": "10-2023-0028175", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "최근 국내 제조기업의 핵심 설비의 노후화가 심각하고, 노후화된 장비를 이용하여 계속 생산을 한다면 장비 이 상으로 인한 생산성 하락, 심지어는 산재로까지 이어질 수 있다. 예를 들어, 노후화된 장비를 이용하여 생산된 장비들이 고장나면서 발생되는 제품의 손상이나 경제적 손실이 막대해질 수 있는 문제가 있다. 본 발명은 SCU 검사 장비의 예지 보전을 위한 PdM 플랫폼을 실현하기 위하여, GRU 신경망 기반의 예측 모델을 이용하여, SCU 검사 장비의 고장을 예측하는 전자 장치와 그 동작 방법을 제공할 수 있다."}
{"patent_id": "10-2023-0028175", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예들에 따라서, GRU(gated recurrent unit) 신경망 기반의 예측 모델을 이용하여 SCU(shift by wire control unit) 검사 장비의 고장을 예측하기 위한 전자 장치는, 디스플레이, 통신 인터페이스, 및 프로세 서를 포함하고, 상기 프로세서는, 상기 통신 인터페이스를 통하여 상기 SCU 검사 장비의 전압 관련 기능 보드로부터 출력 전압 값을 획득하는 경우, 상기 출력 전압 값을 상기 GRU 신경망 기반의 예측 모델에 입력하여, 상기 출력 전압 값에 대응하는 예측 전압 값을 획득하고, 및 상기 통신 인터페이스를 통하여 상기 SCU 검사 장비의 주파수 관련 기능 보드로부터 출력 주파수 값을 획득하는 경우, 상기 출력 주파수 값을 GRU 신경망 기반의 예측 모델에 입력하여, 상기 출력 주파수 값에 대응하는 예측 주파수 값을 획득하도록 설정되고, 상기 GRU 신경망 기 반의 예측 모델은, (i)시간 경과에 따른 전압 값들 및 시간 경과에 따른 주파수 값들에 기반하여 학습되고, (ii)특정 전압 값을 입력 받으면 기설정된 제1 기간이 경과된 시점의 예측 전압 값을 출력하고, (iii)특정 주파 수 값을 입력 받으면 기설정된 제2 기간이 경과된 시점의 예측 주파수 값을 출력하도록 설정될 수 있다."}
{"patent_id": "10-2023-0028175", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따른 전자 장치는, GRU 신경망 기반의 예측 모델을 이용하여, SCU 검사 장비에 장착 될 기능 보드의 고장을 예측함으로써, 기능 보드의 교체 주기를 정확히 알 수 있는 효과를 제공할 수 있고, 또 한 GRU 신경망 기반의 예측 모델을 채택함으로써, 다른 학습 모델(예: RNN, LSTM)과 비교하여 모델의 학습에 소 요되는 시간은 짧은 반면 모델의 수행 성능은 동등한 수준을 낼 수 있는 효과를 제공할 수 있다."}
{"patent_id": "10-2023-0028175", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예들이 첨부된 도면을 참조하여 기재된다. 실시예 및 이에 사용된 용어들은 본 문 서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 및 /또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사 한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 문서에서, \"A 또는 B\" 또는 \"A 및/또는 B 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 해당 구성요소들을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요 소들을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으로 또는 통신적으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 문서에서, \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, 하드웨어적 또는 소프 트웨어적으로 \"~에 적합한,\" \"~하는 능력을 가지는,\" \"~하도록 변경된,\" \"~하도록 만들어진,\" \"~를 할 수 있 는,\" 또는 \"~하도록 설계된\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로 세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimediaplayer), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 웨어러블 장 치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head- mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하 나를 포함할 수 있다. 다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼 트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토 스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 가구, 건물/구조물 또는 자동차의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터, 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 플렉서블하거나, 또는 전술한 다양한 장치들 중 둘 이상의 조합일 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전 자 장치)를 지칭할 수 있다. 도 1을 참조하여, 다양한 실시예에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 및 통신 인터페이스 를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 버스는 구성요소들(110-170)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 또는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치, 어플 리케이션 프로세서, 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신 에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 1)의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨 어, 어플리케이션 프로그래밍 인터페이스(API), 및/또는 어플리케이션 프로그램(또는 \"어플리케이 션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일부는, 운영 시스템으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서 , 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또 는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이 션 프로그램 중 적어도 하나에 전자 장치의 시스템 리소스(예: 버스, 프로세서, 또는 메모 리 등)를 사용할 수 있는 우선 순위를 부여하고, 상기 하나 이상의 작업 요청들을 처리할 수 있다. API는 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스 로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함 수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터입력된 명령 또는 데이터를 전자 장치의 다른 구성요소(들)에 전달하거나, 또는 전자 장치의 다른 구 성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오드 (OLED) 디스플레이, 또는 마이크로 전자기계 시스템 (MEMS) 디스플레이, 또는 전자종이(electronic paper) 디스 플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 및/또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예 를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있 다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외 부 전자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통 신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버 )와 통신할 수 있다. 무선 통신은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있다. 한 실시예 에 따르면, 무선 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE), 지그비 (Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 한실시예에 따르면, 무선 통신은 GNSS를 포함할 수 있다. GNSS는, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system일 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 상호 호환적으로 사용될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨 터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 다 양한 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치(102,104), 또는 서버에서 실행될 수 있다. 한 실시예에 따르면, 전자 장치가 어 떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치 (102, 104), 또는 서버)에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(102, 104), 또는 서버(10 6))는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 2는 다양한 실시예들에 따른, 전자 장치(예: 도 1의 전자 장치)가 SCU 검사 장비의 고장을 예측하는 방 법을 설명하기 위한 흐름도이다. 도 3은 다양한 실시예들에 따른, GRU 신경망 기반의 예측 모델의 동작을 설명하기 위한 도면이다. 도 4는 다양한 실시예들에 따른, 예측 모델에 이용되는 학습 데이터를 설명하기 위한 도면이다. 도 5는 다양한 실시예들에 따른, 전자 장치가 예측 모델을 통하여 획득한 예측 값과 실제 측정 값을 비교 하는 실시예를 설명하기 위한 도면이다. 도 6은 다양한 실시예들에 따른, GRU 신경망 기반의 예측 모델과 RNN 모델, LSTM 모델의 성능을 비교하는 표를 나타낸다. 도 7은 다양한 실시예들에 따른, 전자 장치가 SCU 검사 장비의 상태 이상을 나타내는 GUI를 표시하는 실시 예를 설명하기 위한 도면이다. 201 동작에서, 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 프로세서)는 통신 인터페이스(예: 도 1의 통신 인터페이스)를 통하여 SCU 검사 장비의 전압 관련 기능 보드로부터 출력 전압 값을 획득하는경우, 출력 전압 값을 GRU 신경망 기반의 예측 모델에 입력하여, 상기 출력 전압 값에 대응하는 예측 전압 값을 획득할 수 있다. SCU 검사 장비는, SCU 제품의 검사를 수행하는 검사 장비를 의미하고, SCU는 자동차 변속기의 제어를 담당하는 구성이다. 일 실시예에 따르면, 전자 장치는 통신 인터페이스를 통하여 SCU 검사 장비의 전압 관련 기능 보드로 부터 출력 전압 값을 획득할 수 있다. 전압 관련 기능 보드(예: AOUT 보드)에는, SCU 검사 장비의 이상 상태를 예측하기 위하여 특정 범위(예: 4.5V ~ 5V) 내의 값을 갖는 전압 신호가 인가될 수 있고, 전압 관련 기능 보드 에서 출력된 전압 값이 피드백 회로를 통하여 전자 장치 내의 프로세서에 전달될 수 있다. 기존에는 전압 관련 기능 보드는 생산 제품의 성능 검증을 위해서만 사용되었지만, 본 발명에 따를 경우, SCU 검사 장비 의 고장 또는 이상 상태를 예측하기 위한 용도로 사용될 수 있다. 일 실시예에 따르면, SCU 검사 장비는 미리 정해진 주기에 따라 전압 관련 기능 보드에서 출력되는 전압 값을 피드백 회로를 통하여 전자 장치로 전달할 수 있고, 전자 장치의 프로세서는 상기 미리 정해진 주기에 따라 SCU 검사 장비로부터 출력 전압 값을 획득할 수 있다. 이 때, 전자 장치는 획득한 출력 전압 값을 GRU 신경망 기반의 예측 모델의 학습 데이터로 사용하거나 또는 출력 데이터를 산출하기 위한 입력 데이터 로 사용할 수 있다. 일 실시예에 따라, 도 3을 참조하면, GRU 신경망 기반의 예측 모델은, 제1 학습 데이터 셋으로서 시 간 경과에 따른 전압 값들에 기반하여 학습될 수 있고, 이 때 시간 경과에 따른 전압 값들은 전압 관련 기능 보 드로부터 미리 정해진 주기에 따라 획득한 전압 값들일 수 있다. 예를 들어, 도 4의 <401>을 참조하면, GRU 신 경망 기반의 예측 모델은 전압 관련 기능 보드로부터 출력된 특정 범위(예: 4.5V ~ 5V)의 전압 값을 정상 범위 내의 전압 값으로 설정하고, 일일 1개의 전압 값을 획득하는 것으로 가정하고, 3600일(10년)간 사용되는 장비의 교체 주기를 감안하여 3600개의 데이터의 주기에 따라 peak에서 정상치의 최소치로 하강하는 형태의 제1 학습 데이터 셋에 기반하여 학습될 수 있다. 또 다른 예를 들어, GRU 신경망 기반의 예측 모델은 실 시간으로 전압 관련 기능 보드에서 출력되는 전압 값을 획득하여 이를 제1 학습 데이터 셋으로 이용할 수 있다. 일 실시예에 따라, 도 3을 참조하면, GRU 신경망 기반의 예측 모델은 제1 입력 데이터로서 특정 전압 값을 입력 받으면, 제1 출력 데이터로서 기설정된 기간이 경과된 시점의 예측 전압 값을 출력하도록 설정 될 수 있다. 예를 들어, 도 5의 <501>을 참조하면, 전자 장치는 특정 시점에서 획득한 특정 전압 값을 GRU 신경망 기반의 예측 모델에 입력하면, 상기 현재 시점으로부터 기설정된 기간이 경과된 시점의 예측 전압 값을 획득할 수 있고, 실제로 해당 시점이 경과한 후의 측정 전압 값과 예측 전압 값이 거의 동일함을 알 수 있다. 일 실시예에 따르면, GRU 신경망 기반의 예측 모델은, 특정 전압 값을 입력 받으면 기설정된 기간(예: 30일)이 경과된 시점의 예측 전압 값을 출력할 수 있고, 이 때 기설정된 기간은, 전자 장치의 관리자에 의하여 설 정되거나 전자 장치의 제조사에 의하여 제조 시에 설정될 수 있다. 203 동작에서, 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 프로세서)는 통신 인터페이스 를 통하여 SCU 검사 장비의 주파수 관련 기능 보드로부터 출력 주파수 값을 획득하는 경우, 출력 주파수 값을 GRU 신경망 기반의 예측 모델에 입력하여, 출력 주파수 값에 대응하는 예측 주파수 값을 획득할 수 있다. 일 실시예에 따르면, 전자 장치는 통신 인터페이스를 통하여 SCU 검사 장비의 주파수 관련 기능 보드 로부터 출력 주파수 값을 획득할 수 있다. 주파수 관련 기능 보드(예: FGN 보드)에는, SCU 검사 장비의 이상 상 태를 예측하기 위하여 특정 범위(예: 15.5kHz ~ 16kHz) 내의 값을 갖는 주파수 신호가 인가될 수 있고, 주파수 관련 기능 보드에서 출력된 주파수 값이 피드백 회로를 통하여 전자 장치 내의 프로세서에 전달될 수 있다. 기존에는 주파수 관련 기능 보드는 생산 제품의 성능 검증을 위해서만 사용되었지만, 본 발명에 따를 경 우, SCU 검사 장비의 고장 또는 이상 상태를 예측하기 위한 용도로 사용될 수 있다. 일 실시예에 따르면, SCU 검사 장비는 미리 정해진 주기에 따라 주파수 관련 기능 보드에서 출력되는 주파수 값 을 피드백 회로를 통하여 전자 장치로 전달할 수 있고, 전자 장치의 프로세서는 상기 미리 정해 진 주기에 따라 SCU 검사 장비로부터 출력 주파수 값을 획득할 수 있다. 이 때, 전자 장치는 획득한 출력 주파수 값을 GRU 신경망 기반의 예측 모델의 학습 데이터로 사용하거나 또는 출력 데이터를 산출하기 위한 입력 데이터로 사용할 수 있다. 일 실시예에 따라, 도 3을 참조하면, GRU 신경망 기반의 예측 모델은, 제2 학습 데이터 셋으로서 시 간 경과에 따른 주파수 값들에 기반하여 학습될 수 있고, 이 때 시간 경과에 따른 주파수 값들은 주파수 관련기능 보드로부터 미리 정해진 주기에 따라 획득한 주파수 값들일 수 있다. 예를 들어, 도 4의 <402>을 참조하면, GRU 신경망 기반의 예측 모델은 주파수 관련 기능 보드로부터 출력된 특정 범위(예: 15.5kHz ~ 16kHz)의 주파수 값을 정상 범위 내의 주파수 값으로 설정하고, 일일 1개의 주파수 값을 획득하는 것으로 가정 하고, 3600일(10년)간 사용되는 장비의 교체 주기를 감안하여 3600개의 데이터의 주기에 따라 peak에서 정상치 의 최소치로 하강하는 형태의 제2 학습 데이터 셋에 기반하여 학습될 수 있다. 또 다른 예를 들어, GRU 신 경망 기반의 예측 모델은 실시간으로 주파수 관련 기능 보드에서 출력되는 전압 값을 획득하여 이를 제2 학습 데이터 셋으로 이용할 수 있다. 일 실시예에 따라, 도 3을 참조하면, GRU 신경망 기반의 예측 모델은 제2 입력 데이터로서 특정 주파 수 값을 입력 받으면, 제2 출력 데이터로서 기설정된 기간이 경과된 시점의 예측 주파수 값을 출력하도록 설정될 수 있다. 예를 들어, 도 5의 <502>를 참조하면, 전자 장치는 특정 시점에서 획득한 특정 주파수 값 을 GRU 신경망 기반의 예측 모델에 입력하면, 상기 현재 시점으로부터 기설정된 기간이 경과된 시점의 예측 주 파수 값을 획득할 수 있고, 실제로 해당 시점이 경과한 후의 측정 주파수 값과 예측 주파수 값이 거의 동일함을 알 수 있다. 일 실시예에 따라, GRU 신경망 기반의 예측 모델은, 특정 주파수 값을 입력 받으면 기설정된 기간(예: 30 일)이 경과된 시점의 예측 주파수 값을 출력할 수 있고, 이 때 기설정된 기간은, 전자 장치의 관리자에 의 하여 설정되거나 전자 장치의 제조사에 의하여 제조 시에 설정될 수 있다. 일 실시예에 따르면, 전자 장치는 전압 예측 및 주파수 예측을 위한 딥러닝 모델로서, GRU 신경망 기반의 예측 모델을 채택할 수 있다. 구체적으로, 도 6을 살펴보면, 시계열 예측 모델로 RNN(recurrent neural network) 계열의 3가지 모델에 대해 비교한 표가 나타나 있고, 시계열 예측 모델의 성능 평가 기준으로 R2 score를 살펴보면, 각 모델 별로 동일한 설정 조건(seq length, batch size, Lr) 하에서 GRU 신경망 기반의 예 측 모델이 학습 시간은 짧은 반면, 성능은 유사한 효과를 나타냄을 알 수 있다. 참고로, R2 score는 일반적으로 0-1 범위를 가지고, 1에 가까울수록 예측값과 실제값의 차이가 작아지며 예측값의 정확도가 높은 것을 알 수 있 다. 205 동작에서, 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 프로세서)는 예측 전압 값이 기설정 된 전압 범위 내에 존재하지 않거나, 예측 주파수 값이 기설정된 주파수 범위 내에 존재하지 않은 경우, 디스플 레이(예: 도 1의 디스플레이)를 통하여 전압 관련 기능 보드 또는 주파수 관련 기능 보드의 상태 이상에 대한 메시지를 표시할 수 있다. 일 실시예에 따라, 도 7을 참조하면, 전자 장치는 예측 전압 값이 기설정된 전압 범위 내에 존재하지 않은 경우, 디스플레이를 통하여 전압 관련 기능 보드의 상태 이상에 대한 메시지(예: 전압 점검 요망 메시지) 를 표시할 수 있고, 전압 관련 기능 보드의 교체일자를 함께 표시할 수 있다. 이 때, 기설정된 전압 범위는 정 상 범위로 설정된 전압 범위(예: 4.5V ~ 5V)를 나타낼 수 있다. 일 실시예에 따라, 도 7을 참조하면, 전자 장치는 예측 주파수 값이 기설정된 주파수 범위 내에 존재하지 않은 경우, 디스플레이를 통하여 주파수 관련 기능 보드의 상태 이상에 대한 메시지(예: 주파수 점검 요망 메시지)를 표시할 수 있고, 주파수 관련 기능 보드의 교체일자를 함께 표시할 수 있다. 이 때, 기설정된 주파수 범위는 정상 범위로 설정된 주파수 범위(예: 15.5kHz ~ 16kHz)를 나타낼 수 있다. 다양한 실시예들에 따라서, GRU(gated recurrent unit) 신경망 기반의 예측 모델을 이용하여 SCU(shift by wire control unit) 검사 장비의 고장을 예측하기 위한 전자 장치는, 디스플레이, 통신 인터페이스, 및 프로세 서를 포함하고, 상기 프로세서는, 상기 통신 인터페이스를 통하여 상기 SCU 검사 장비의 전압 관련 기능 보드로 부터 출력 전압 값을 획득하는 경우, 상기 출력 전압 값을 상기 GRU 신경망 기반의 예측 모델에 입력하여, 상기 출력 전압 값에 대응하는 예측 전압 값을 획득하고, 및 상기 통신 인터페이스를 통하여 상기 SCU 검사 장비의 주파수 관련 기능 보드로부터 출력 주파수 값을 획득하는 경우, 상기 출력 주파수 값을 GRU 신경망 기반의 예측 모델에 입력하여, 상기 출력 주파수 값에 대응하는 예측 주파수 값을 획득하도록 설정되고, 상기 GRU 신경망 기 반의 예측 모델은, (i)시간 경과에 따른 전압 값들 및 시간 경과에 따른 주파수 값들에 기반하여 학습되고, (ii)특정 전압 값을 입력 받으면 기설정된 제1 기간이 경과된 시점의 예측 전압 값을 출력하고, (iii)특정 주파 수 값을 입력 받으면 기설정된 제2 기간이 경과된 시점의 예측 주파수 값을 출력하도록 설정될 수 있다. 다양한 실시예들에 따라서, 상기 프로세서는, 미리 정해진 제1 주기에 따라 상기 전압 관련 기능 보드에서 출력 되는 전압 값을 획득하고, 및 미리 정해진 제2 주기에 따라 상기 주파수 관련 기능 보드로부터 출력되는 주파수 값을 획득하도록 설정될 수 있다. 다양한 실시예들에 따라서, 상기 프로세서는, 제1 시점에 상기 전압 관련 기능 보드로부터 상기 출력 전압 값을 획득하는 경우, 상기 출력 전압 값을 상기 GRU 신경망 기반의 예측 모델에 입력하여, 상기 제1 시점으로부터 30 일이 경과한 시점에서의 상기 출력 전압 값에 대응하는 예측 전압 값을 획득하고, 및 제2 시점에 상기 주파수 관련 기능 보드로부터 상기 출력 주파수 값을 획득하는 경우, 상기 출력 주파수 값을 상기 GRU 신경망 기반의 예측 모델에 입력하여, 상기 제2 시점으로부터 30일이 경과한 시점에서의 상기 출력 주파수 값에 대응하는 예측 주파수 값을 획득하도록 설정될 수 있다. 다양한 실시예들에 따라서, 상기 프로세서는, 상기 예측 전압 값이 기설정된 전압 범위 내에 존재하지 않은 경 우, 상기 디스플레이를 통하여 상기 전압 관련 기능 보드의 상태 이상에 대한 메시지를 표시하고, 및 상기 예측 주파수 값이 기설정된 주파수 범위 내에 존재하지 않은 경우, 상기 디스플레이를 통하여 상기 주파수 관련 기능 보드의 상태 이상에 대한 메시지를 표시하도록 설정될 수 있다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. \"모듈\"은, 일체로 구성된 부 품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 기계적으로 또 는 전자적으로 구현될 수 있으며, 예를 들면, 어떤 동작들을 수행하는, 알려졌거나 앞으로 개발될, ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays), 또는 프로그램 가능 논리 장치를 포함할 수 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작 들)의 적어도 일부는 프로그램 모듈의 형태로 컴퓨터로 판독 가능한 저장 매체(예: 메모리)에 저장된 명령 어로 구현될 수 있다. 상기 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 프로세서가 상기 명령 어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네 틱 매체(예: 자기테이프), 광기록 매체(예: CD-ROM, DVD, 자기-광 매체 (예: 플롭티컬 디스크), 내장 메모리 등 을 포함할 수 있다. 명령어는 컴파일러에 의해 만들어지는 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 다양한 실시예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부가 생략되거나, 또는 다른 구성요소를 더 포함할 수 있다. 다양한 실시예에 따른, 모듈, 프로 그램 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거 나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 개시의 범위를 한정하는 것은 아니다. 따라서, 본 개시의 범위는, 본 개시의 기술적 사상에 근거한 모든 변경 또는 다양한 다 른 실시예를 포함하는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2023-0028175", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른 전자 장치 및 네트워크의 블록도를 도시한다. 도 2는 다양한 실시예들에 따른, 전자 장치가 SCU 검사 장비의 고장을 예측하는 방법을 설명하기 위한 흐름도이 다. 도 3은 다양한 실시예들에 따른, GRU 신경망 기반의 예측 모델의 동작을 설명하기 위한 도면이다. 도 4는 다양한 실시예들에 따른, 예측 모델에 이용되는 학습 데이터를 설명하기 위한 도면이다. 도 5는 다양한 실시예들에 따른, 전자 장치가 예측 모델을 통하여 획득한 예측 값과 실제 측정 값을 비교하는 실시예를 설명하기 위한 도면이다. 도 6은 다양한 실시예들에 따른, GRU 신경망 기반의 예측 모델과 RNN 모델, LSTM 모델의 성능을 비교하는 표를 나타낸다. 도 7은 다양한 실시예들에 따른, 전자 장치가 SCU 검사 장비의 상태 이상을 나타내는 GUI를 표시하는 실시예를 설명하기 위한 도면이다."}
