{"patent_id": "10-2023-0036631", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0057314", "출원번호": "10-2023-0036631", "발명의 명칭": "생체조직 파쇄 장치 및 이를 이용한 생체조직 파쇄 범위 조절 방법", "출원인": "경희대학교 산학협력단", "발명자": "박기주"}}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서에 의해 동작하는 생체조직 파쇄 장치의 동작 방법으로서,생체조직의 특성, 집속초음파 압력, 가변음압 적용 시점 및 상기 생체조직의 파쇄 범위 정보를 포함하는 학습데이터를 획득하는 단계,상기 학습 데이터가 입력되면 상기 생체조직의 특성과 상기 생체조직의 파쇄 범위에 따라 상기 집속초음파의 압력과 가변음압 적용 시점, 그리고 펄스 개수가 출력되도록 모델을 학습하는 단계, 그리고학습시킨 상기 모델로 타겟 생체조직을 포함하는 의료 영상이 입력되면, 상기 타겟 생체조직을 파쇄할 집속초음파의 압력, 가변음압 적용 시점 및 펄스 개수를 설정하는 단계를 포함하는, 동작 방법."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 설정하는 단계 이후에,상기 타겟 생체조직에 설정한 상기 집속초음파의 압력으로 집속초음파를 출력하여 상기 타겟 생체조직을 파쇄하는 단계, 그리고 상기 가변음압 적용 시점에 상기 집속초음파의 음향압력과 강도를 낮추도록 제어하는 단계를 포함하는, 동작 방법."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 파쇄하는 단계는,상기 집속초음파는 40MPa 이상의 충격파압력을 갖거나 최대정압 30MPa 이상 및 최대부압 - 10MPa 이하의 압력을갖는 비선형 초음파 파형을 가지고,상기 집속초음파의 강도를 설정값 이하로 제어하는 단계 이후의 집속초음파는 40MPa 미만의 충격파압력을 갖거나 최대정압 30MPa 이하 및 최대부압 - 10MPa 이상의 압력을 갖는 선형 또는 비선형 초음파 파형 중 어느 하나의 파형을 가지며,펄스 시간을 최소 0.1ms에서 최대 100ms가 되도록 하고, 초음파 중심 주파수는 0.1MHz 내지 10MHz, 펄스 반복주파수는 0.1MHz 내지 100MHz, 듀티 사이클은 0.1% 내지 10%의 범위를 갖는 적어도 하나 이상의 펄스 개수를 가지는, 동작 방법."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 설정하는 단계는,상기 가변음압 적용 시점을 상기 집속초음파의 출력으로 인해 상기 타겟 생체조직에서 수증기 기포가 생성되는시점 이후에 복수 개 설정하는, 동작 방법."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,공개특허 10-2024-0057314-3-복수 개 설정한 각 가변음압 적용 시점 각각에 상기 타겟 생체조직에 출력되는 집속초음파의 압력이 각각 상이하도록 제어하는, 동작 방법."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 모델을 학습하는 단계는,상기 학습 데이터가 입력되면, 상기 생체조직의 특성과 상기 집속초음파의 압력과 가변음압 적용 시점에 따라상기 생체조직의 파쇄 범위가 디스플레이되도록 상기 모델을 학습하는, 동작 방법."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 설정하는 단계 이후에,상기 타겟 생체조직에 대한 의료 영상이 입력되면, 상기 타겟 생체조직을 파쇄할 집속초음파의 압력과 가변음압적용 시점, 그리고 상기 의료 영상에 상기 타겟 생체조직의 파쇄범위를 표시하는, 동작 방법."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,상기 강도를 낮추도록 제어하는 단계 이후에,상기 설정에 따라 상기 타겟 생체조직이 파쇄된 파쇄 영상을 획득하는 단계,상기 파쇄 영상으로부터 추출한 실제 파쇄 범위와 상기 생체조직의 파쇄 범위 정보에 해당하는 계산 파쇄 범위의 차이 범위를 비교하는 단계, 그리고상기 차이 범위가 기 설정한 임계 범위보다 크면, 상기 실제 파쇄 범위, 상기 집속초음파의 압력, 가변음압 적용 시점, 그리고 상기 생체조직의 특정을 이용하여 상기 모델을 재학습하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "집속초음파를 출력하기 위한 초음파 출력부; 및상기 집속초음파의 압력(pressure) 및 가변음압 적용 시점을 제어하기 위한 제어부를 포함하되,상기 제어부는 타겟 생체조직의 특성, 상기 집속초음파의 압력과 상기 생체조직의 파쇄 범위에 따라 상기 집속초음파의 압력을 낮추는 시점을 다르게 설정하는, 생체조직 파쇄 장치."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 프로세서는,생체조직의 특성, 집속초음파 압력, 가변음압 적용 시점 및 상기 생체조직의 파쇄 범위 정보를 포함하는 학습데이터가 입력되면 상기 생체조직의 특성과 상기 생체조직의 파쇄 범위에 따라 상기 집속초음파의 압력, 가변음압 적용 시점, 그리고 펄스 개수가 출력되도록 모델을 학습하는, 생체조직 파쇄 장치."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 프로세서는,상기 가변음압 적용 시점을 상기 집속초음파의 출력으로 인해 상기 타겟 생체조직에서 수증기 기포가 생성되는시점 이후에 복수 개 설정하는, 생체조직 파쇄 장치.공개특허 10-2024-0057314-4-청구항 12 제11항에 있어서,상기 프로세서는,복수 개 설정한 각 가변음압 적용 시점 각각에 상기 타겟 생체조직에 출력되는 집속초음파의 압력이 각각 상이하도록 제어하는, 생체조직 파쇄 장치."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 프로세서는,상기 학습 데이터가 입력되면, 상기 생체조직의 특성과 상기 집속초음파의 압력과 가변음압 적용 시점에 따라상기 생체조직의 파쇄 범위가 디스플레이되도록 상기 모델을 학습하는, 생체조직 파쇄 장치."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 프로세서는,상기 타겟 생체조직에 대한 의료 영상이 입력되면, 상기 타겟 생체조직을 파쇄할 집속초음파의 압력과 가변음압적용 시점, 그리고 상기 의료 영상에 상기 타겟 생체조직의 파쇄범위를 표시하도록 제어하는, 생체조직 파쇄 장치."}
{"patent_id": "10-2023-0036631", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 프로세서는,설정에 따라 파쇄된 상기 타겟 생체조직의 파쇄 영상으로부터 실제 파쇄 범위를 추출하고, 추출한 실제 파쇄 범위를 상기 생체조직의 파쇄 범위 정보에 해당하는 계산 파쇄 범위의 차이 범위를 비교하며, 상기 차이 범위가기 설정한 임계 범위보다 크면, 상기 실제 파쇄 범위, 상기 집속초음파의 압력, 가변음압 적용 시점, 그리고 상기 생체조직의 특정을 이용하여 상기 모델을 재학습하는, 생체조직 파쇄 장치."}
{"patent_id": "10-2023-0036631", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "적어도 하나의 프로세서에 의해 동작하는 생체조직 파쇄 장치의 동작 방법으로서, 생체조직의 특성, 집속초음파 압력, 가변음압 적용 시점 및 생체조직의 파쇄 범위 정보를 포함하는 학습 데이터를 획득하고, 학습 데이터가 입 력되면 생체조직의 특성과 생체조직의 파쇄 범위에 따라 집속초음파의 압력과 가변음압 적용 시점, 그리고 펄스 개수가 출력되도록 모델을 학습한다. 학습시킨 모델로 타겟 생체조직을 포함하는 의료 영상이 입력되면, 타겟 생 체조직을 파쇄할 집속초음파의 압력과 가변음압 적용 시점, 그리고 펄스 개수를 설정한다."}
{"patent_id": "10-2023-0036631", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 생체조직 파쇄 장치 및 이를 이용한 생체조직 파쇄 범위 조절 방법에 관한 것으로, 상세하게는 충격 파 산란 효과 세기를 제어하여 생체조직 파쇄 범위를 조절하는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0036631", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "집속초음파(Focused ultrasound) 기술을 이용하면, 완전히 비침습적으로 신체 내 원하는 부위에 대기압의 수십 에서 수백 배에 달하는 강력한 음향에너지를 전달할 수 있다. 그리고, 수 mm의 공간해상도를 가지고 열 (thermal) 또는 역학적(mechanical) 에너지를 선택적으로 신체 내 원하는 부위에 전달할 수 있다. 초음파 열에너지 기반의 고강도집속초음파(HIFU: High Intensity Focused Ultrasound)는 고강도의 초음파 에너 지를 한곳에 모아 초음파 초점에서 고열을(예를 들어, 50도씨 이상) 발생시켜 조직의 열적 괴사를 일으키는 기 술이다. 현재 자궁섬유종, 자궁선긍증, 전립선비대증, 전립선암, 전이성 골종양 및 수전증의 치료 목적으로 임 상에서 HIFU가 널리 사용되고 있다. 또한, 최근에는 HIFU를 이용하여 열적 삭마(thermal ablation) 효과뿐만 아니라, 집속초음파를 이용하여 생체조 직을 물리적으로 파쇄하는 효과가 보고되었다. 보일링 히스토트립시(boiling histotripsy)라고 불리는 이 기술 은 기존 HIFU에서 사용되는 음향압력보다 수십 배 더 강력한 압력을 사용하여 초음파 초점에서 음향공동현상을 인위적으로 발생시켜 초점 생체 조직을 물리적으로 파쇄하는 기술이다.현재 전임상 동물실험 단계에서 보일링 히스토트립시 기술을 이용하여 고형종양을 안전하게 제거하는 효과가 입 증되었다. 그리고 기존 HIFU 열적 삭마 기술 대비 짧은 치료 시간, 생체 조직의 물리적 파쇄 및 실시간 케비테 이션 모니터링을 통한 치료 과정 모니터링이 가능하여, 임상에서 적용되는 기존 외과적 수술방식을 대체할 수 있는 차세대 유망 초음파 수술 기술로써 많은 관심을 받고 있다. 이러한 보일링 히스토트립시 초음파 기술은 사이즈가 큰 병변을 물리적으로 제거하기에는 적합한 기술이지만, 보일링 히스토트립시 과정 중 발생하는 충격파 산란 효과에 의해서 초음파 초점 부위뿐만 아니라 주변조직에서 도 케비테이션이 발생할 가능성이 높다. 따라서, 정밀 미세 제거가 필요로 하는 수술인 경우 보일링 히스토트립 시 기술을 적용하기 매우 어려운 단점이 있다. 이러한 단점을 보완하기 위해 최근에 가변음압 집속초음파를 이용하여 충격파 산란 효과 없이 생체조직을 미세 하게 파쇄할 수 있는 기술이 개발되었다. 가변음압 충격파 히스토트립시 기술은 1차 수증기 기포를 초음파 초점 에서 인위적으로 발생시킨 후, 순차적으로 초점 음향압력을 충격파 산란 효과가 나타나는 임계값보다 낮춘다. 이를 통해 충격파 산란 효과 없이 1차 수증기 기포의 운동성만을 제어하여 주변 생체조직을 미세하게 파쇄할 수 있다. 하지만, 이러한 가변음압 충격파 히스토트립시 기술은 기존 보일링 히스토트립시 기술 대비 충격파 산란효과를 발생시키지 않기 때문에 생체조직을 미세하게 파쇄할 수는 있지만, 생체조직 파쇄 범위를 사용자 임의로 조절하 기 어려운 단점이 있다."}
{"patent_id": "10-2023-0036631", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 충격파 산란 효과 세기를 제어하여 비침습적으로 생체조직을 파쇄하는 것과 생체조직 파쇄 범위 및 강도를 조절할 수 있는 생체조직 파쇄 장치 및 이를 이용한 생체조직 파쇄 범위 조절 방법을 제공한다."}
{"patent_id": "10-2023-0036631", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 본 발명의 기술적 과제를 달성하기 위한 본 발명의 하나의 특징인 적어도 하나의 프로세서에 의해 동작하 는 생체조직 파쇄 장치의 동작 방법으로서, 생체조직의 특성, 집속초음파 압력, 가변음압 적용 시점 및 상기 생체조직의 파쇄 범위 정보를 포함하는 학습 데이터를 획득하는 단계, 상기 학습 데이터가 입력되면 상기 생체조직의 특성과 상기 생체조직의 파쇄 범위에 따라 상기 집속초음파의 압력과 가변음압 적용 시점, 그리고 펄스 개수가 출력되도록 모델을 학습하는 단계, 그 리고 학습시킨 상기 모델로 타겟 생체조직을 포함하는 의료 영상이 입력되면, 상기 타겟 생체조직을 파쇄할 집 속초음파의 압력, 가변음압 적용 시점 및 펄스 개수를 설정하는 단계를 포함한다. 상기 설정하는 단계 이후에, 상기 타겟 생체조직에 설정한 상기 집속초음파의 압력으로 집속초음파를 출력하여 상기 타겟 생체조직을 파쇄하는 단계, 그리고 상기 가변음압 적용 시점에 상기 집속초음파의 음향압력과 강도를 낮추도록 제어하는 단계를 포함할 수 있다. 상기 파쇄하는 단계는, 상기 집속초음파는 40MPa 이상의 충격파압력을 갖거나 최대정압 30MPa 이상 및 최대부압 - 10MPa 이하의 압력을 갖는 비선형 초음파 파형을 가지고, 상기 집속초음파의 강도를 설정값 이하로 제어하는 단계 이후의 집속초음파는 40MPa 미만의 충격파압력을 갖거나 최대정압 30MPa 이하 및 최대부압 - 10MPa 이상의 압력을 갖는 선형 또는 비선형 초음파 파형 중 어느 하나의 파형을 가지며, 펄스 시간을 최소 0.1ms에서 최대 100ms가 되도록 하고, 초음파 중심 주파수는 0.1MHz 내지 10MHz, 펄스 반복주파수는 0.1MHz 내지 100MHz, 듀티 사이클은 0.1% 내지 10%의 범위를 갖는 적어도 하나 이상의 펄스 개수를 가질 수 있다. 상기 설정하는 단계는, 상기 가변음압 적용 시점을 상기 집속초음파의 출력으로 인해 상기 타겟 생체조직에서 수증기 기포가 생성되는 시점 이후에 복수 개 설정할 수 있다. 복수 개 설정한 각 가변음압 적용 시점 각각에 상기 타겟 생체조직에 출력되는 집속초음파의 압력이 각각 상이 하도록 제어할 수 있다. 상기 모델을 학습하는 단계는, 상기 학습 데이터가 입력되면, 상기 생체조직의 특성과 상기 집속초음파의 압력 과 가변음압 적용 시점에 따라 상기 생체조직의 파쇄 범위가 디스플레이되도록 상기 모델을 학습할 수 있다.상기 설정하는 단계 이후에, 상기 타겟 생체조직에 대한 의료 영상이 입력되면, 상기 타겟 생체조직을 파쇄할 집속초음파의 압력과 가변음압 적용 시점, 그리고 상기 의료 영상에 상기 타겟 생체조직의 파쇄범위를 표시할 수 있다. 상기 강도를 낮추도록 제어하는 단계 이후에, 상기 설정에 따라 상기 타겟 생체조직이 파쇄된 파쇄 영상을 획득 하는 단계, 상기 파쇄 영상으로부터 추출한 실제 파쇄 범위와 상기 생체조직의 파쇄 범위 정보에 해당하는 계산 파쇄 범위의 차이 범위를 비교하는 단계, 그리고 상기 차이 범위가 기 설정한 임계 범위보다 크면, 상기 실제 파쇄 범위, 상기 집속초음파의 압력, 가변음압 적용 시점, 그리고 상기 생체조직의 특정을 이용하여 상기 모델 을 재학습하는 단계를 포함할 수 있다. 상기 본 발명의 기술적 과제를 달성하기 위한 본 발명의 또 다른 특징인 생체조직 파쇄 장치는, 집속초음파를 출력하기 위한 초음파 출력부; 및 상기 집속초음파의 압력(pressure) 및 가변음압 적용 시점을 제어하기 위한 제어부를 포함하되, 상기 제어부는 타겟 생체조직의 특성, 상기 집속초음파의 압력과 상기 생체조직의 파쇄 범 위에 따라 상기 집속초음파의 압력을 낮추는 시점을 다르게 설정한다. 상기 프로세서는, 생체조직의 특성, 집속초음파 압력, 가변음압 적용 시점 및 상기 생체조직의 파쇄 범위 정보 를 포함하는 학습 데이터가 입력되면 상기 생체조직의 특성과 상기 생체조직의 파쇄 범위에 따라 상기 집속초음 파의 압력, 가변음압 적용 시점, 그리고 펄스 개수가 출력되도록 모델을 학습할 수 있다. 상기 프로세서는, 상기 가변음압 적용 시점을 상기 집속초음파의 출력으로 인해 상기 타겟 생체조직에서 수증기 기포가 생성되는 시점 이후에 복수 개 설정할 수 있다. 상기 프로세서는, 복수 개 설정한 각 가변음압 적용 시점 각각에 상기 타겟 생체조직에 출력되는 집속초음파의 압력이 각각 상이하도록 제어할 수 있다. 상기 프로세서는, 상기 학습 데이터가 입력되면, 상기 생체조직의 특성과 상기 집속초음파의 압력과 가변음압 적용 시점에 따라 상기 생체조직의 파쇄 범위가 디스플레이되도록 상기 모델을 학습할 수 있다. 상기 프로세서는, 상기 타겟 생체조직에 대한 의료 영상이 입력되면, 상기 타겟 생체조직을 파쇄할 집속초음파 의 압력과 가변음압 적용 시점, 그리고 상기 의료 영상에 상기 타겟 생체조직의 파쇄범위를 표시하도록 제어할 수 있다. 상기 프로세서는, 설정에 따라 파쇄된 상기 타겟 생체조직의 파쇄 영상으로부터 실제 파쇄 범위를 추출하고, 추 출한 실제 파쇄 범위를 상기 생체조직의 파쇄 범위 정보에 해당하는 계산 파쇄 범위의 차이 범위를 비교하며, 상기 차이 범위가 기 설정한 임계 범위보다 크면, 상기 실제 파쇄 범위, 상기 집속초음파의 압력, 가변음압 적 용 시점, 그리고 상기 생체조직의 특정을 이용하여 상기 모델을 재학습할 수 있다."}
{"patent_id": "10-2023-0036631", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 수증기 기포 발생 후 가변음압 적용 시점을 임의로 조절이 가능하기 때문에, 파쇄하고자 하 는 병변의 크기에 따라 맞춤형으로 충격파 산란효과 세기 조절을 통해 병변의 파쇄가 가능하다. 또한, 상대적으로 사이즈가 작은 미세종양부터 사이즈가 큰 종양까지 비침습적으로 파쇄가 가능하다."}
{"patent_id": "10-2023-0036631", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하 도면을 참조로 하여 본 발명의 실시예에 따른 생체조직 파쇄 장치 및 이를 이용한 생체조직 파쇄 범위 조 절 방법에 대해 설명한다. 본 발명의 실시예에 대해 설명하기 앞서, 종래의 집속초음파 연조직 제거 기술에 대 해 도 1 및 도 2를 참조로 설명한다. 도 1은 종래의 집속초음파 연조직 제거 기술을 통한 생체조직의 제거 과정을 나타낸 예시도이다. 도 1을 참조하면, 도 1의 (a)와 같이 제거하고자 하는 생체조직(예를 들어,종양과 같은 병변 등)에 초음파 트랜 스듀서를 이용해 고강도의 초음파를 출력하면, 초음파가 집속되는 초점 부위에서 충격파(shockwaves)가 발생한 다. 그리고 도 1의 (b)와 같이 충격파의 열적 효과(shock wave heating)에 의해 조직 내 수분이 가열되면서 1차 수 증기 기포(primary boiling bubble)가 초점에서 발생하고, 도 1의 (c)에 도시된 바와 같이 충격파 파형의 모양 과 기포 내로 유입되는 수증기로 인한 기포내 증기압 증가에 의해 수증기 기포가 성장한다. 이와 같이, 초음파로 인해 매질 내에서 미소한 공동(cavity)과 기포가 발생하는 캐비테이션(cavitation) 현상이 발생한다. 이때, 이 기포가 음향 압력 변화에 따라 진동(oscillation)하고 붕괴(collapse)되면서 충격을 발생시 킬 수 있다. 보일링 히스토트립시는 이러한 음향 캐비테이션 현상에 의해 발생되는 충격을 통해 생체조직을 제 거하는 기술이다. 그런데 일반적인 보일링 히스토트립시 조사 조건에서는 수증기 기포와 충격파의 상호작용에 의해 충격파 산란효 과(shock scattering effect)가 발생한다. 도 1의 (d)에 도시된 바와 같이 충격파 산란효과에 따라, 초점 주변 에 수많은 2차 기포 구름이 발생한다. 이러한 2차 기포 구름들이 초점 위치 이외의 지점에도 충격을 발생시켜, 제거를 원하지 않는 생체조직 부위에 손상을 입히게 된다. 따라서, 도 1의 (e)에 도시된 바와 같이 최종적으로 생체조직은 원형이 아닌 태드폴 형태 (tadpole-shaped)로 제거되는 문제가 발생한다. 도 2는 종래의 집속초음파 연조직 제거 기술에 있어, 충격파 산란효과 및 기포 구름이 발생하는 원리를 나타낸 예시도이다. 도 2의 (a)에 도시된 바와 같이, 초음파 트랜스듀서에 의해 출력된 고강도 집속초음파는, 초점 위치에서 강력한 입사 충격파를 발생시킨다. 그리고 도 2의 (b)와 같이 입사 충격파는 열적 효과에 의해 발생한 1차 수증기 기포 에 의해 반사되고, 반사된 충격파(이하, '반사 충격파'라 지칭함)는 입사 충격파와 중첩하여 보다 강력한 부압 (negative pressure) 필드를 생성한다. 부압 필드가 생성될 때 작은 수증기 기포들로 구성된 기포 구름을 발생 시킨다. 그리고 도 2의 (c)와 같이 반사 충격파는 계속하여 산란효과를 발생시키고, 결과적으로 초음파 트랜스듀서와 1 차 수증기 기포 사이에 수많은 기포 구름들을 발생시킨다. 이처럼 의도하지 않은 충격파 산란효과로 인해 발생하는 기포 구름들은, 초점위치 이외의 지점에 충격을 발생시 키고 원하지 않는 생체조직 부위를 손상시킬 수 있다. 따라서 집속초음파 연조직 제거 기술(보일링 히스토트립 시)은 넓은 범위의 생체조직을 제거하는데만 이용될 수 있었으며, 주요 혈관 주변 등 정밀도가 요구되는 수술에 는 적용되기 어려웠다. 이를 위해, 가변강도 또는 가변음압 집속초음파를 통해 충격파 산란효과 없이 수증기 기포의 운동변화를 정밀 제어하여 생체조직을 제거하는 기술이 연구되기도 하였다. 그러나, 이 기술의 경우 수증기 기포의 운동변화를제어하여 생체조직을 제거하기 때문에, 생체조직 파쇄 범위를 조절하기 어렵다는 단점이 있다. 따라서, 본 발명의 실시예에서는 1차로 수증기 기포가 발생한 후, 가변음압 적용 시점을 조절하여 충격파 산란 효과 세기를 제어함으로써, 생체조직의 파쇄범위와 강도를 조절할 수 있는 기술을 제안한다. 도 3은 본 발명의 실시예에 따른 생체조직 파쇄 장치의 구조도이다. 도 3에 도시된 바와 같이, 생체조직 파쇄 장치는 초음파 출력부, 제어부 및 검출부를 포함 한다. 그리고 생체조직 파쇄 장치는 모니터를 추가로 포함하거나, 모니터와 연동할 수도 있다. 참고로, 도 3에는 발명의 설명을 위해 필요한 구성요소들만 도시된 것이며, 생체조직 파쇄 장치를 동작시"}
{"patent_id": "10-2023-0036631", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "키거나 발명의 효과를 얻기 위해 필수적인 모든 구성요소들이 표시된 것은 아니다. 즉, 도 3에 도시한 구성들"}
{"patent_id": "10-2023-0036631", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이외에도 발명의 효과를 얻기 위한 추가적인 하드웨어 및/또는 소프트웨어 구성요소가 더 포함될 수 있다. 초음파 출력부는 집속초음파를 출력할 수 있는 초음파 트랜스듀서(transducer)로 구성된다. 초음파 트랜스 듀서는 초음파를 출력하는 음원으로, 3W/㎠ (Ispta) 이상의 고강도 초음파를 출력하는 것을 예로 하여 설명하나, 반드시 이와 같이 한정되는 것은 아니다. 본 발명의 실시예의 초음파 출력부는 단일 트랜스듀서로 구성되는 것을 예로 하여 설명한다. 그러나, 복수 의 트랜스듀서들이 하나의 초점에 초음파를 집속하는 트랜스듀서 어레이로 구성될 수 있으며, 어느 하나의 형태 로 한정하지 않는다. 초음파 출력부는 제어부와 연결된다. 초음파 출력부는 제어부로부터 음향압력, 파형, 주파 수, 가변 음압 적용 시점 등 초음파의 특성을 결정하는 제어신호를 수신하면, 이를 토대로 설정된 값에 따른 강 도의 초음파를 출력하도록 구성된다. 일반적으로, 초음파 트랜스듀서는 압전효과 또는 자왜(磁歪) 효과를 응용하여, 20KHz 이상의 교류 에너지를 같 은 주파수의 기계적 진동으로 변환한다. 예를 들어, 트랜스듀서는 일측이 개구된 몸체와 압전소자를 포함하는 구조이며, 몸체 내부는 공기로 충진되며, 각 압전소자에는 전압을 인가하기 위한 전선이 연결된 구조일 수 있다. 압전소자는 수정(Quartz) 및 전기석(Turmaline)과 같은 압전효과를 일으키는 물질을 이용하며, 트랜스듀서는 압 전소자의 압전효과를 이용해 초음파를 발생 출력시킬 수 있다. 이와 같은 트랜스듀서의 구조는 하나의 예시일뿐 이며, 특정 구조나 효과로 한정되지 않는다. 트랜스듀서의 압전소자는 치료하고자 하는 부위와 목적에 따라 출력을 조정함으로써 적절한 강도의 초음파를 출 력할 수 있고, 출력된 초음파는 중첩을 일으켜 초음파 빔을 형성한다. 또한, 도 3에 도시된 바와 같이 초음파 출력부는 제거하고자 하는 병변(lesion)이 존재하는 생체조직(T)에 고강도 집속초음파를 조사한다. 초점(F)은 트랜스듀서로부터 출력된 초음파 빔이 집속되는 지점으로서, 초음파에 의한 진동 에너지가 한 곳에 모여 강력한 비선형 충격파를 발생시킨다. 초점(F)에서는 충격파의 열적 효과에 의해 수 백 ㎛ 내지 수 ㎜ 크기 의 수증기 기포가 생성되는 음향 캐비테이션 현상이 발생된다. 그리고, 생성되는 수증기 기포가 진동 및 붕괴/ 소멸하면서 발생하는 충격을 이용하여 생체조직을 제거할 수 있다(기계적 삭마). 전술한 바와 같이, 보일링 히스토트립시(boiling histotripsy)에서는 수증기 기포와 충격파의 상호작용에 의해 충격파 산란효과가 나타날 수 있다. 충격파 산란효과에 의해 초점 주변에는 수많은 기포 구름이 발생하고, 이러 한 기포 구름들이 초점위치 이외의 지점에 충격을 발생시켜, 제거를 원하지 않는 생체조직 부위에도 손상을 입 히게 된다. 즉, 상술한 도 2와 같이, 충격파 산란효과는 고강도의 집속초음파와 수증기 기포가 상호작용으로 인해 나타난다. 따라서 본 발명의 실시예에서는 집속초음파를 이용하여 초점에서 수증기 기포를 발생시킨 후 가변음 향압력 적용 시점을 변경하여 충격파 산란 효과 세기를 제어함으로써, 캐비테이션 생성 범위를 제어하고 이를 통해 생체조직 파쇄 범위를 조절하는 기술을 제안한다. 또한, 본 발명의 실시예에서는 집속초음파의 초음파 강 도를 가변음향압력 적용 시점에 따라 다르게 설정하여, 생체조직 파쇄 범위를 생체조직의 특성에 따라 다양하게 파쇄할 수 있는 기술을 제안한다. 검출부는 초음파 출력부에서 출력된 집속초음파에 의해 생체조직이 파쇄되면, 생체조직의 파쇄 정도 가 제어부의 제어와 같이 이루어졌는지 모니터링하는 구성요소이다. 본 발명의 실시예에서는, 다음 두 가 지 조건이 발생하면 이를 검출하여 제어부에 전달한다. 첫 번째 조건(이하, '제1 조건'이라 지칭함)은 생체조직에 집속초음파를 출력하는 도중에 생체조직에서 수증기 기포가 발생하는 조건이다. 그리고, 두 번째 조건(이하, '제2 조건'이라 지칭함)은 생체조직의 온도가 미리 설 정한 임계값에 도달하는 조건이다. 본 발명의 실시예에서 검출부는 제1 조건의 달성 여부를 검출할 수 있도록 수증기 기포의 발생으로 인한 음향신호 또는 전기신호의 변화 감지를 위한 신호감지센서를 구비할 수 있다. 또한, 검출부는 제2 조건의 달성 여부를 검출할 수 있도록 생체조직의 온도 변화 감지를 위한 온도감지센서를 구비할 수 있다. 본 발명의 실시예에서는 두 가지 조건을 예로 들어 검출부가 검출하여 제어부로 전달하는 것을 예로 하여 설명하나, 이는 예시적인 것에 불과하며 적어도 하나 이상의 다른 조건이 설정될 수 있다. 이 경우, 해당 조건의 달성 여부를 검출하기에 적합한 다양한 센서가 활용될 수 있다. 제어부는 파쇄를 위한 생체조직에 대한 정보가 입력되면, 초음파 출력부를 제어하여 집속초음파의 압 력을 조절하는 시점을 설정한다. 이때, 제어부는 집속초음파의 압력을 조절하는 시점에 따라 집속초음파의 압력과 강도를 시점마다 다르게 하도록 설정할 수 있다. 구체적으로는, 제어부는 외부로부터 입력된 파쇄를 위한 생체조직에 대한 정보를 기초로, 집속초음파의 압 력 및 강도를 충격파를 발생시키지 않는 정도로 낮출 가변음압 적용 시점을 계산한다. 그리고 제어부는 초 음파 출력부를 통해 초음파 트랜스듀서로부터 출력되는 초음파의 음향압력, 집속초음파 압력, 조사 시간 등의 파라미터를 조정함으로써 집속초음파의 강도를 설정값 이하로 제어한다. 여기서, 설정값이란 집속초음파가 생체조직 내에서 충격파 산란효과를 발생시키지 않도록 하는 강도의 최대값을 의미한다. 예를 들어, 초음파 출력부는 초점에서 40 MPa 이상의 충격파 압력을 갖거나 최대정압 30MPa 이 상 및 -10 MPa 이하의 최대부압의 음향압력을 갖는 비선형 초음파 파형을 가지는 고강도 집속초음파를 출력하 는 도중 기 설정된 시점이 되면, 집속초음파의 음향압력을 최대정압이 40 MPa 미만, 또는 최대 정압이 30MPa 이 하이고 최대부압이 -10 MPa 이상의 압력을 갖는 선형 또는 비선형 초음파 파형 중 어느 하나의 파형이 되도록 조정하여 충격파 산란효과 및 이로 인한 기포 구름이 발생하지 않도록 할 수 있다. 그리고, 제어부는 펄스 시간을 최소 0.1ms에서 최대 100ms가 되도록 하고, 초음파 중심 주파수는 0.1MHz 내지 10MHz, 펄스 반복주파수는 0.1MHz 내지 100MHz, 듀티 사이클은 0.1% 내지 10%의 범위를 갖도록 설정한다. 이때 의 펄스 개수는 1개 이상이 되도록 설정한다. 이때, 제어부는 집속초음파를 이용하여 초점에서 수증기 기포를 발생시킨 후, 충격파 산란 효과 세기를 최 소화시킬 가변음압 적용 시점을 계산하여 임의로 변경하여, 충격파 산란 효과 세기를 최소화시키거나 극대화시 켜 캐비테이션 생성 범위를 제어한다. 이를 위하여, 제어부는 학습 데이터로 인공지능 모델(이하, 설명의 편의를 위하여 '가변음압 적용 시점 계 산 모델'이라 지칭함)을 학습시킨다. 학습 데이터는 파쇄 범위가 입력되면 충격파 산란 효과 세기와 가변음압 적용 시점 정보가 출력되도록 구성된다. 이렇게 가변음압 적용 시점 계산 모델을 학습시킨 후, 제어부는 생체조직 파쇄 장치를 운용하는 작업 자(예를 들어, 의사 등)가 입력한 파쇄 범위를 수신하여 충격파 산란 효과 세기와 가변음압 적용 시점 정보를 출력한다. 또는, 환자의 의료 영상을 수신한 제어부가 의료 영상에서 생체조직의 크기를 파악하고, 파악한 생체조직의 크기에 따라 충격파 산란 효과 세기와 가변음압 적용 시점 정보를 출력할 수 있다. 또한, 제어부는 실제 집속초음파가 생체조직에 조사되기 전에, 출력한 충격파 산란 효과 세기와 가변음압 적용 시점 정보에 따라 집속초음파가 생체조직에 조사될 경우 생체조직이 파쇄될 것으로 예상하는 파쇄 예상 범 위를 모니터를 통해 작업자에게 제공한다. 작업자는 모니터를 통해 제공되는 파쇄 예상 범위를 확인 한 후, 파쇄 범위를 조절하거나 또는 집속초음파가 초음파 출력부로부터 조사되도록 생체조직 파쇄 장치 를 동작한다. 또한. 제어부는 가변음압 적용 시점에 따라 집속초음파의 압력 세기를 서로 다르게 조절할 수도 있다. 즉, 제어부는 가변음압 적용 시점에 따라 제1 적용 시점에 압력 세기를 제1 세기로 하고, 제1 적용 시점 이후 인 제2 적용 시점에 압력 세기를 제1 세기와 다른 제2 세기(제1 세기보다 높은 세기 또는 낮은 세기)로 집속초 음파가 출력되도록 제어할 수 있다. 이는, 파쇄하고자 하는 생체조직의 특성에 따라 반복적인 파쇄가 필요한 부분이 있고 한 번만 파쇄를 해도 충분 한 부분이 있기 때문이다. 따라서, 제어부는 다양한 가변음압 적용 시점마다 서로 다른 압력 세기로 집속초음파가 출력되도록 초음파 출력부를 제어할 수 있다. 또한, 제어부는 모니터에서 디스플레이되는 생체조직 파쇄 영상을 획득한다. 그리고 제어부는 획득한 생체조직 파쇄 영상에서 실제 생체조직이 파쇄된 범위(이하, 설명의 편의를 위하여 '실제 파쇄 범위'라 지칭함)와, 초음파 출력부를 통해 초음파가 조사되기 전 계산된 생체조직 파쇄 범위(이하, 설명의 편의를 위하여 '계산 파쇄 범위'라 지칭함)를 비교한다. 제어부는 실제 파쇄 범위와 계산 파쇄 범위의 비교를 통해 생체조직 파쇄 장치의 정확도를 판단한다. 즉, 제어부는 실제 파쇄 범위와 계산 파쇄 범위의 차가 미리 설정한 임계 범위 이내에 해당하면, 모델이 잘 학습되어 있는 것으로 판단한다. 그러나, 실제 파쇄 범위와 계산 파쇄 범위의 차가 임계 범위를 초과하면, 실제 파쇄 범위와 생체조직의 특성, 가변음압 적용 시점과 집속초음파 압력을 이용하여 모델을 재 학습한다. 여기서 제어부가 모니터에서 획득한 생체조직 파쇄 영상으로부터 실제 파쇄 범위를 확인하는 방법, 그리고 실제 파쇄 범위와 계산 파쇄 범위를 비교하는 방법은 다양하므로, 본 발명의 실시예에서는 어느 하나의 방법으로 한정하지 않는다. 본 발명의 실시예에서는 생체조직 파쇄 장치에 별도의 정보 수집 수단(예를 들 어, 카메라 등)(도면 미도시)을 통해 모니터를 촬영하여, 모니터에서 디스플레이되는 생체조직 파쇄 영상을 획득하는 것을 예로하여 설명한다. 이와 같은 생체조직 파쇄 장치의 동작에 대해 도 4를 참조로 설명한다. 도 4에서는 생체조직 파쇄 장치 가 의료 영상을 확인하여 자동으로 충격파 산란 효과 세기와 가변음압 적용 시점 정보를 산출하는 예에 대 해 설명한다. 도 4는 본 발명의 실시예에 따른 생체조직 파쇄 장치의 동작에 대한 흐름도이다. 도 4에 도시된 바와 같이, 생체조직 파쇄 장치는 수집된 학습 데이터가 입력되면, 입력된 학습 데이터로 가변음압 적용 시점을 계산하는 모델을 학습시킨다(S100, S101). 여기서, 학습 데이터는 생체조직이 있는 의료 영상, 생체조직에 대한 특성 정보, 파쇄를 위한 범위 정보, 그리 고 생체조직을 파쇄하기 위한 집속초음파의 압력과 가변음압 적용 시점 정보를 포함한다. 따라서, 생체조직 파 쇄 장치는 학습 데이터를 기초로, 의료 영상, 생체조직에 대한 특성 정보, 그리고 파쇄를 위한 범위 정보 를 모델에 입력하면 집속초음파의 압력과 가변음압 적용 시점 정보를 출력하도록 모델을 학습시킨다. 즉, 수증기 기포가 발생하는 제1 조건이 발생하여 검출부가 이를 검출한 후부터 펄스 시간 내에서 파쇄 대 상인 생체조직의 특성과 생체조직을 파쇄할 범위에 따라 가변음압을 적용할 시점이 다르게 설정된다. 그러므로, 이러한 정보들을 학습 정보로 수집하여 모델을 학습시키면, 생체조직 파쇄 장치는 의료 영상과 파쇄할 타 겟 생체조직의 범위가 입력되면 집속초음파의 압력과 가변음압 적용 시점 정보를 출력으로 제공할 수 있다. 다시 말해, 생체조직 파쇄 장치는 파쇄할 타겟 생체조직을 촬영한 의료 영상이 입력되면, 파쇄할 타겟 생 체조직의 파쇄 범위를 설정한다(S102). 생체조직 파쇄 장치는 다양한 방법으로 의료 영상에서 생체조직의 위치를 설정할 수 있으므로, 본 발명의 실시예에서는 어느 하나의 방법으로 한정하여 설명하지 않는다. 의료 영상을 기초로 파쇄범위를 설정한 생체조직 파쇄 장치는 타겟인 생체조직의 종류, 생체조직의 위치와 크기 그리고 파쇄할 범위에 따라 가변음압을 적용할 시점과 가변음압을 적용하기 전의 집속초음파의 압력(이하, '제1 압력'라 지칭함)과 가변음압을 적용한 직후의 집속초음파의 압력(이하, '제2 압력'라 지칭함), 그리고 펄 스 개수를 포함하는 생체조직 파쇄 파라미터를 선정한다(S103). 즉, 생체조직 파쇄 장치는 한 펄스를 기준 으로, 제1 압력 및 제2 압력의 가변음압 적용 시점, 그리고 각각의 구간에서의 펄스의 개수 등을 선정한다. 생체조직 파쇄 장치는 S103 단계에서 선정한 집속초음파 압력, 가변음압 적용 시점, 그리고 펄스 개수를 기초로 초음파 출력부를 제어하고, 초음파 출력부는 제1 압력에 맞춰 집속초음파를 출력한다(S104). 초음파 출력부에서 출력되는 집속초음파에 따라 타겟 생체조직이 제거되고(S105), 제어부에서 계산한 가변음압 적용 시점에 초음파 출력부는 제2 압력에 맞춰 집속초음파를 변경하여 출력한다(S106). 이때, 생체조직 파쇄 장치는 가변음압을 적용할 시점을 복수 개의 시점으로 생성할 수 있다. 즉, 초음파가 처음 출력된 시점부터 제1 적용 시점까지는 집속초음파의 압력 세기를 높게 하고, 제1 적용 시점에 집속초음파 의 압력 세기를 낮춰 충격파 산란 효과의 세기를 작게 한 후, 제2 적용 시점에 다시 집속초음파의 압력 세기를 높여 충격파 산란 효과의 세기를 크게 하는 등 다양한 시점에 다양한 집속초음파의 압력 세기로 생체조직을 파쇄할 수 있다. 상술한 절차는 생체조직 파쇄 장치가 생체조직을 파쇄하기 위하여, 입력된 집속초음파의 압력 세기와 가변 음압을 적용할 시점을 자동으로 설정하는 방법에 대해 설명하였다. 그러나, 생체조직의 범위를 작업자가 설정하 면, 설정한 범위를 기초로 생체조직 파쇄 장치가 가변음압을 적용할 시점과 집속초음파의 압력 세기를 설 정할 수도 있다. 이에 대해 도 5를 참조로 설명한다. 도 5는 본 발명의 또 다른 실시예에 생체조직 파쇄 장치의 동작에 대한 흐름도이다. 도 5에 도시된 바와 같이, 생체조직 파쇄 장치는 작업자가 입력한 타겟 생체조직의 종류와 파쇄 범위 정보, 그리고 생체조직이 포함된 의료 영상을 수신한다(S200). 생체조직 파쇄 장치는 수신한 정보를 기초 로 타겟인 생체조직의 종류, 생체조직의 위치와 크기 그리고 파쇄할 범위에 따라 가변음압을 적용할 시점과 가 변음압을 적용하기 전의 집속초음파의 압력(이하, ‘제1 압력’이라 지칭함)와 가변음압을 적용한 직후의 집속 초음파의 압력(이하, ‘제2 압력’이라 지칭함), 그리고 펄스 개수를 포함하는 생체조직 파쇄 파라미터를 선정 한다(S201). 이때, 작업자가 수동으로 파쇄 범위를 선정할 경우 제1 압력과 제2 압력, 가변음압 적용 시점, 펄수 개수 등을 선정하기 위해, 생체조직 파쇄 장치는 사전에 학습 데이터로 학습되어 있는 것을 예로 설명한다. 생체조직 파쇄 장치는 S201 단계에서 선정한 생체조직 파쇄 파라미터를 기초로 초음파 출력부를 제어 하고, 초음파 출력부는 제1 압력에 맞춰 집속초음파를 출력한다(S202). 초음파 출력부에서 출력되는 집속초음파에 따라 타겟 생체조직이 제거되고(S203), 제어부에서 계산한 가변음압 적용 시점에 초음파 출 력부는 제2 압력에 맞춰 집속초음파를 변경하여 출력한다(S204). 이때, 생체조직 파쇄 장치는 가변음압을 적용할 시점을 복수 개의 시점으로 생성할 수 있다. 즉, 초음파가 처음 출력된 시점부터 제1 적용 시점까지는 집속초음파의 압력 세기를 높게 하고, 제1 적용 시점에 집속초음파 의 압력 세기를 낮춰 충격파 산란 효과의 세기를 작게 한 후, 제2 적용 시점에 다시 집속초음파의 압력 세기를 높여 충격파 산란 효과의 세기를 크게 하는 등 다양한 시점에 다양한 집속초음파의 압력 세기로 생체조직을 파 쇄할 수 있다. 여기서 도 5의 S202 단계에서 생체조직 파쇄 장치가 가변음압 시점과 집속초음파 압력을 선정할 때, 생체 조직 파쇄 장치는 모니터를 통해 선정한 가변음압 시점과 집속초음파 압력, 펄스 개수 등을 기초로 파쇄될 생체조직의 범위를 표시할 수 있다. 본 발명의 실시예에서는 가변음압 시점, 집속 초음파 압력, 그리고 펄스 개수 등을 생체조직 파쇄 파라미터라 지칭하나, 반드시 이와 같이 한정되는 것은 아니다. 이에 대해 도 6 을 참조로 설명한다. 도 6은 본 발명의 또 다른 실시예에 따라 제공되는 화면의 예시도이다. 도 6에 도시된 바와 같이, 생체조직 파쇄 장치는 모니터를 통해 파쇄시킬 타겟 생체조직에 대한 의료 영상 뿐만 아니라, 선정한 생체조직 파쇄 파라미터를 기초로 파쇄될 생체조직의 파쇄범위를 예측하여, 작업자가 실시간으로 확인할 수 있게 표시한다. 이때, 생체조직 파쇄 장치는 도 6의 (a)와 같이 파쇄범위를 표시하여 작업자에게 모니터를 통해 디스플레 이할 수 있다. 또는, 도 6의 (b)와 같이 생체조직 파쇄 장치가 다양한 생체조직 파쇄 파라미터를 기초로 파쇄될 생체조직의 파쇄범위들을 각각의 상황에 맞춰 제공하고, 작업자가 이를 기초로 생체조직 파쇄 파라미터 를 선택할 수도 있다. 여기서, 생체조직 파쇄 장치가 의료영상에 파쇄 범위를 디스플레이하는 방법은 다양한 기술로 적용 가능하 므로, 본 발명의 실시예에서는 어느 하나의 방법으로 한정하지 않는다.다음은, 생체조직 파쇄 장치가 상술 한 도 4 및 도 5에서 가변음압 시점에 초음파 출력을 제어한 후, 모니터를 통해 디스플레이되는 파쇄 범위 를 이용하여 모델을 재 학습시키는 방법에 대해 도 7을 참조로 설명한다. 도 7은 본 발명의 실시예에 따라 모델을 재학습시키는 흐름도이다. 도 7에 도시된 바와 같이, 생체조직 파쇄 장치는 상술한 도 4의 S104 단계와 S106 단계에서 초음파 출력부 를 통해 집속초음파를 출력하고 가변음압 시점에 제어된 초음파 출력을 통해 집속초음파가 출력되어 생체 조직이 파쇄된 영상을 획득한다(S300). 생체조직 파쇄 영상이 디스플레이되는 모니터를 촬영 수단(도면 미 도시, 예를 들어 카메라 등)을 통해 수집할 수 있으며, 생체조직 파쇄 장치가 생체조직 파쇄 영상을 획득하는 방법은 다양하므로 본 발명의 실시예에서는 어느 하나의 방법으로 한정하지 않는다. 생체조직 파쇄 장치는 획득한 생체조직 파쇄 영상에서 획득한 실제 파쇄 범위와, 초음파 출력부를 통 해 초음파가 조사되기 전 계산된 계산 파쇄 범위를 비교한다(S310). 생체조직 파쇄 장치는 실제 파쇄 범위와 계산 파쇄 범위의 비교를 통해 생체조직 파쇄 장치의 정확도 를 판단한다. 즉, 생체조직 파쇄 장치는 실제 파쇄 범위와 계산 파쇄 범위의 차가 미리 설정한 임계 범위 이내인지 판단한다(S320). 만약, 실제 파쇄 범위와 계산 파쇄 범위의 차가 임계 범위 이내이면, 모델이 잘 학습되어 있는 것으로 판단한다. 그러나, 실제 파쇄 범위와 계산 파쇄 범위의 차가 임계 범위를 초과하면, 실제 파쇄 범위와 생체조직 의 특성, 가변음압 적용 시점과 집속초음파 압력을 이용하여 모델을 재 학습한다(S330). 도 8은 본 발명의 실시예에 따른 컴퓨팅 시스템의 구조도이다. 도 8을 참고하면, 적어도 하나의 프로세서에 의해 동작하는 생체조직 파쇄 장치는 컴퓨팅 시스템으로 구현될 수 있으며, 컴퓨팅 시스템에서 본 발명의 동작을 실행하도록 기술된 명령들(instructions)이 포함 된 프로그램을 실행한다. 프로그램은 컴퓨터 판독 가능한 저장매체에 저장될 수 있고, 유통될 수 있다. 컴퓨팅 시스템의 하드웨어는 적어도 하나의 프로세서, 메모리, 스토리지, 통신 인터페이스 를 포함할 수 있고, 버스를 통해 연결될 수 있다. 이외에도 입력 장치 및 출력 장치 등의 하드웨어가 포함 될 수 있다. 컴퓨팅 시스템은 프로그램을 구동할 수 있는 운영 체제를 비롯한 각종 소프트웨어가 탑재될 수 있다. 프로세서는 컴퓨팅 시스템의 동작을 제어하는 장치로서, 프로그램에 포함된 명령들을 처리하는 다양 한 형태의 프로세서일 수 있고, 예를 들면, CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 등 일 수 있다. 메모리는 본 발명의 동작을 실행하도록 기술된 명령들이 프로세서에 의해 처리되도록 해당 프로그램 을 로드한다. 메모리는 예를 들면, ROM(read only memory), RAM(random access memory) 등 일 수 있다. 스토리지는 본 발명의 동작을 실행하는데 요구되는 각종 데이터, 프로그램 등을 저장한다. 통신 인터페이 스는 유/무선 통신 모듈일 수 있다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2023-0036631", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 집속초음파 연조직 제거 기술을 통한 생체조직의 제거 과정을 나타낸 예시도이다. 도 2는 종래의 집속초음파 연조직 제거 기술에 있어, 충격파 산란효과 및 기포 구름이 발생하는 원리를 나타낸 예시도이다. 도 3은 본 발명의 실시예에 따른 생체조직 파쇄 장치의 구조도이다. 도 4는 본 발명의 실시예에 따른 생체조직 파쇄 장치의 동작에 대한 흐름도이다. 도 5는 본 발명의 또 다른 실시예에 생체조직 파쇄 장치의 동작에 대한 흐름도이다. 도 6은 본 발명의 또 다른 실시예에 따라 제공되는 화면의 예시도이다. 도 7은 본 발명의 실시예에 따라 모델을 재학습시키는 흐름도이다.도 8은 본 발명의 실시예에 따른 컴퓨팅 시스템의 구조도이다."}
