{"patent_id": "10-2022-0090403", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0012888", "출원번호": "10-2022-0090403", "발명의 명칭": "배당 변동률 분석을 이용한 경주결과 예측 시스템", "출원인": "권오대", "발명자": "권오대"}}
{"patent_id": "10-2022-0090403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "판매된 경주권에 대한 정보인 판매경주권정보를 생성하는 경주권판매부; 및상기 경주권판매부로부터 상기 판매경주권정보를 수신하고, 수신된 상기 판매경주권정보로부터 기 설정된 주기마다 각각의 승식에 따른 선수별 배당을 연산하여 배당정보를 생성하고, 상기 배당정보를 이용하여 각각의 상기승식에 따른 선수별 배당의 변동률을 분석함으로써 배당변동률정보를 생성하고, 상기 배당변동률정보를 이용하여 기 설정된 주기마다 각각의 상기 승식에서의 예측 승자에 대한 정보인 예측승자정보를 생성하는 서버부를 포함하고,상기 승식은,단승식, 복승식, 쌍승식, 삼쌍승식 및 삼복승식을 포함하는 배당 변동률 분석을 이용한 경주결과 예측 시스템."}
{"patent_id": "10-2022-0090403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 서버부는,상기 경주권판매부로부터 상기 판매경주권정보를 수신하는 통신부와, 수신된 상기 판매경주권정보로부터 상기 배당정보를 생성하고, 상기 배당정보를 이용하여 상기 배당변동률정보를 생성하고, 상기 배당변동률정보를 이용하여 상기 예측승자정보를 생성하는 연산부와, 상기 판매경주권정보, 상기 배당정보, 상기 배당변동률정보, 상기 예측승자정보 및 경주결과정보가 저장되는 저장부를 포함하는 배당 변동률 분석을 이용한 경주결과 예측 시스템."}
{"patent_id": "10-2022-0090403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 연산부는,제1설정시간과 제2설정시간을 설정하는 시간설정부와,상기 판매경주권정보를 이용하여 상기 제1설정시간에서의 각각의 승식에 따른 선수별 배당을 연산함으로써 상기배당정보를 생성하는 배당연산부와,상기 배당정보를 이용하여 상기 제1설정시간에서의 각각의 상기 승식에 따른 선수별 배당의 변동률을 분석함으로써 상기 배당변동률정보를 생성하는 배당변동률연산부와,상기 배당변동률정보를 이용하여 상기 예측승자정보를 생성하는 예측승자연산부를 포함하는 배당 변동률 분석을이용한 경주결과 예측 시스템."}
{"patent_id": "10-2022-0090403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 예측승자연산부는,상기 승식이 삼복승식인 경우, 상기 배당변동률정보를 이용하여 상기 제2설정시간에서의 예측 승자에 대한 선수조합을 생성함으로써 상기 예측승자정보를 생성하는 것을 특징으로 하는 배당 변동률 분석을 이용한 경주결과예측 시스템."}
{"patent_id": "10-2022-0090403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0012888-3-청구항 4에 있어서,상기 제1설정시간은,상기 경주권의 발매 마감 전 12분, 10분, 8분, 6분, 4분 및 2분이고,상기 제2설정시간은,상기 경주권의 발매 마감 전 12분, 4분, 2분 및 1분인 것을 특징으로 하는 배당 변동률 분석을 이용한 경주결과예측 시스템."}
{"patent_id": "10-2022-0090403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 판매경주권정보는,경주장, 경주번호, 승식, 선수번호 및 투표금액에 대한 정보를 포함하는 배당 변동률 분석을 이용한 경주결과예측 시스템."}
{"patent_id": "10-2022-0090403", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 배당 변동률 분석을 이용한 경주결과 예측 시스템에 관한 것으로, 판매된 경주권에 대한 정보인 판매 경주권정보를 생성하는 경주권판매부; 및 상기 경주권판매부로부터 상기 판매경주권정보를 수신하고, 수신된 상 기 판매경주권정보로부터 기 설정된 주기마다 각각의 승식에 따른 선수별 배당을 연산하여 배당정보를 생성하고, (뒷면에 계속)"}
{"patent_id": "10-2022-0090403", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 배당 변동률 분석을 이용한 경주결과 예측 시스템에 관한 것으로, 보다 상세하게는 경주권의 판매에 따른 배당 변동률을 분석함으로써 단승식, 복승식, 쌍승식, 삼쌍승식 및 삼복승식의 경주결과를 예측할 수 있는 배당 변동률 분석을 이용한 경주결과 예측 시스템에 관한 것이다."}
{"patent_id": "10-2022-0090403", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 경주는 특정 경기에 대한 승자투표권을 발매하고 승자를 맞힌 경주참가자에게 환급금을 내주는 행 위를 말하며, 이러한 경주에는 경마, 경륜 및 경정 등이 포함된다. 여기서 경주참가자란 경주에 참가하여 베팅, 즉 승자투표를 하는 승자투표자를 의미하며, 승자란 단승식에서는 한 명의 우승 선수(경마의 경우에는 우승마)를 의미할 수 있고, 복승식, 쌍승식, 삼복승식, 삼쌍승식 등에서는 순위권에 든 복수의 선수의 조합을 의미할 수 있다. 그리고 경마란 기수가 기승한 말의 경주에 승자투표권을 발매하고 승자를 맞힌 경주참가자에게 환급금을 내주는 행위를 말하고, 경륜이란 자전거 경주에 대한 승자투표권을 발매하고 승자를 맞힌 경주참가자에게 환급금을 내 주는 행위를 말하며, 경정이란 모터보트 경주에 대한 승자투표권을 발매하고 승자를 맞힌 경주참가자에게 환급 금을 내주는 행위를 말한다. 경주참가자들은 이러한 승자를 예측하기 위해서 다양한 방법으로 우승 확률이 높은 선수에 대한 정보를 획득한 다. 우승 확률이 높은 선수에 대한 정보를 획득하는 방법으로는 판매되는 다수의 다양한 경주 예상지를 이용하는 예 상지 이용 방법, 전문가 등으로부터 정보를 획득하는 전문가 이용 방법, 컴퓨터 시스템을 이용하는 승자 예측 정보 시스템을 이용하는 시스템 이용 방법 등이 있다. 그러나 경주 예상지 이용 방법은 선수별 능력, 훈련내용, 전적 등을 기반으로 전문가가 분석한 정보를 제공하는 것으로, 경주참가자들의 주관적인 의사가 전혀 반영되지 않아 그 예측 정확도가 떨어지는 문제점이 있으며, 전 문가 이용 방법 또한 정보의 변동성이 커 분석이 어려운 선수별 능력, 훈련내용 등에 의해 분석하므로 그 예측 정확도가 떨어지는 문제점이 있다. 또한, 컴퓨터 시스템을 이용한 승자 예측 정보 시스템은 인공지능 등의 다양한 고도의 기술을 적용하여 예측하 고 있으나, 상술한 바와 같이 분석이 어려운 선수별 능력, 훈련내용, 전적 등의 데이터를 기반으로 분석하므로 그 예측 정확도가 떨어지는 문제점이 있다. 즉, 종래의 승자 예측 방법들은 선수별 능력, 훈련내용, 전적 등의 과거 정보들을 기반으로 분석하므로, 현재 베팅에 참여하는 경주참여자들에 의한 정보들이 승자 예측에 전혀 반영되지 않는 문제점이 있다. 또한, 종래의 승자 예측 방법들은 대부분 단승, 복승에만 국한되어 있어, 삼쌍승, 삼복승 등의 승자를 예측하지 못하는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제2001-0067694호(2001.07.13.)"}
{"patent_id": "10-2022-0090403", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은, 상술한 종래의 문제점을 해결하기 위한 것으로, 선수별 능력, 훈련내용, 전적 등의 과거 정 보들을 분석하지 않고, 경주권의 판매에 따른 배당 변동률을 분석함으로써 단승식, 복승식, 쌍승식, 삼쌍승식 및 삼복승식의 경주결과를 예측할 수 있는 배당 변동률 분석을 이용한 경주결과 예측 시스템을 제공함에 있다."}
{"patent_id": "10-2022-0090403", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적은, 본 발명에 따라, 판매된 경주권에 대한 정보인 판매경주권정보를 생성하는 경주권판매부; 및 상기 경주권판매부로부터 상기 판매경주권정보를 수신하고, 수신된 상기 판매경주권정보로부터 기 설정된 주기마다 각각의 승식에 따른 선수별 배당을 연산하여 배당정보를 생성하고, 상기 배당정보를 이용하여 각각의 상기 승식 에 따른 선수별 배당의 변동률을 분석함으로써 배당변동률정보를 생성하고, 상기 배당변동률정보를 이용하여 기 설정된 주기마다 각각의 상기 승식에서의 예측 승자에 대한 정보인 예측승자정보를 생성하는 서버부를 포함하고, 상기 승식은, 단승식, 복승식, 쌍승식, 삼쌍승식 및 삼복승식을 포함하는 배당 변동률 분석을 이용한 경주결과 예측 시스템에 의해 달성된다. 또한, 상기 서버부는, 상기 경주권판매부로부터 상기 판매경주권정보를 수신하는 통신부와, 수신된 상기 판매경 주권정보로부터 상기 배당정보를 생성하고, 상기 배당정보를 이용하여 상기 배당변동률정보를 생성하고, 상기 배당변동률정보를 이용하여 상기 예측승자정보를 생성하는 연산부와, 상기 판매경주권정보, 상기 배당정보, 상 기 배당변동률정보, 상기 예측승자정보 및 경주결과정보가 저장되는 저장부를 포함할 수 있다. 또한, 상기 연산부는, 제1설정시간과 제2설정시간을 설정하는 시간설정부와, 상기 판매경주권정보를 이용하여 상기 제1설정시간에서의 각각의 승식에 따른 선수별 배당을 연산함으로써 상기 배당정보를 생성하는 배당연산부 와, 상기 배당정보를 이용하여 상기 제1설정시간에서의 각각의 상기 승식에 따른 선수별 배당의 변동률을 분석 함으로써 상기 배당변동률정보를 생성하는 배당변동률연산부와, 상기 배당변동률정보를 이용하여 상기 예측승자 정보를 생성하는 예측승자연산부를 포함할 수 있다. 또한, 상기 예측승자연산부는, 상기 승식이 삼복승식인 경우, 상기 배당변동률정보를 이용하여 상기 제2설정시 간에서의 예측 승자에 대한 선수 조합을 생성함으로써 상기 예측승자정보를 생성할 수 있다. 또한, 상기 제1설정시간은, 상기 경주권의 발매 마감 전 12분, 10분, 8분, 6분, 4분 및 2분이고, 상기 제2설정 시간은, 상기 경주권의 발매 마감 전 12분, 4분, 2분 및 1분일 수 있다. 또한, 상기 판매경주권정보는, 경주장, 경주번호, 승식, 선수번호 및 투표금액에 대한 정보를 포함할 수 있다."}
{"patent_id": "10-2022-0090403", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 경주권의 판매에 따른 배당 변동률을 분석함으로써 단승식, 복승식, 쌍승식, 삼쌍승식 및 삼 복승식의 승자 예측 정확도를 대폭적으로 향상시킬 수 있는 효과가 있다."}
{"patent_id": "10-2022-0090403", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "한편, 본 발명의 효과는 이상에서 언급한 효과들로 제한되지 않으며, 이하에서 설명할 내용으로부터 통상의 기 술자에게 자명한 범위 내에서 다양한 효과들이 포함될 수 있다."}
{"patent_id": "10-2022-0090403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시 예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시 예를 설명함에 있어서, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 본 발명의 실시 예의 구성요소를 설명함에 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있 다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 또한, 본 발명의 실시 예를 설명함에 있어서, 각각의 \"부\", \"모듈\" 또는 \"단계\"는 프로세서 및 메모리를 통해 구현될 수 있다. 프로세서는 범용 프로세서, 중앙 처리 장치(CPU), 마이크로프로세서, 디지털 신호 프로세서 (DSP), 제어기, 마이크로제어기, 상태 머신, 및 등을 포함하도록 넓게 해석되어야 한다. 몇몇 환경에서는, 프로 세서는 주문형 반도체(ASIC), 프로그램가능 로직 디바이스(PLD), 필드 프로그램가능 게이트 어레이(FPGA) 등을 지칭할 수도 있다. 프로세서는, 예를 들어, DSP와 마이크로프로세서의 조합, 복수의 마이크로프로세서들의 조합, DSP 코어와 결합한 하나 이상의 마이크로프로세서들의 조합 또는 임의의 다른 그러한 구성들의 조합과 같 은 처리 디바이스들의 조합을 지칭할 수도 있다. 또한, 메모리는 전자 정보를 저장 가능한 임의의 전자 컴포넌트를 포함하도록 넓게 해석되어야 한다. 메모리는 임의 액세스 메모리(RAM), 판독-전용 메모리(ROM), 비-휘발성 임의 액세스 메모리(NVRAM), 프로그램 가능 판독- 전용 메모리(PROM), 소거-프로그램가능 판독 전용 메모리(EPROM), 전기적으로 소거가능 PROM(EEPROM), 플래쉬메모리, 자기 또는 광학 데이터 저장장치, 레지스터들 등과 같은 프로세서-판독가능 매체의 다양한 유형들을 지 칭할 수도 있다. 프로세서가 메모리로부터 정보를 판독하거나 메모리에 정보를 기록할 수 있다면 메모리는 프로 세서와 전자 통신 상태에 있다고 불리며, 각각의 \"부\", \"모듈\" 또는 \"단계\"는 전자 통신 상태에 있는 프로세서 와 메모리에 기반한 프로그램 내지 어플리케이션을 통해 구현될 수 있다. 또한, 통신망은 유무선 통신망으로 LAN(local area network), WLAN(wireless LAN), Wibro(wireless broadband), Wimax(world interoperability for microwave access), HSDPA(high speed downlink packetaccess) 및 그 밖의 다양한 통신규격 중 적어도 하나를 이용할 수 있다. 또한 통신망은 이동 통신망일 수 있으며, 동기식 이동 통신망일 수도 있고, 비동기식 이동 통신망일 수도 있다. 상기 비동기식 이동 통신망의 실 시예로서, WCDMA(Wideband Code Division Multiple Access) 방식의 통신망을 들 수 있다. 이 경우 도면에 도시 되진 않았지만, 상기 이동 통신망은 예컨대, RNC(Radio Network Controller) 등을 포함할 수 있다. 한편, 상기 WCDMA망을 일 예로 들었지만, 3GLTE망, 4G망, 5G망 등 차세대 통신망, 그 밖의 WI-FI, Bluetooth, zigbee등 저 전력 통신망과 유/무선 IP 망일 수 있다. 지금부터는 첨부된 도면을 참조하여, 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시 스템에 대해 상세히 설명한다. 본 발명에서 경주는 특정 경기에 대한 승자투표권(경마의 경우에는 마권)을 발매하고 승자를 맞힌 경주참가자에 게 환급금을 내주는 행위를 말하며, 이러한 경주에는 경마, 경륜 및 경정 등이 포함될 수 있다. 또한, 본 발명에서 경주참가자란 경주에 참가하여 베팅, 즉 승자투표를 하는 승자투표자를 의미할 수 있고, 본 발명에서 경주권이란 경마, 경륜 또는 경정 경주에서 승자를 적중시켜 환급금을 교부받기를 원하는 경주참가자 의 청구에 따라 경주시행사가 발매하는 승자투표 방법, 선수번호 및 금액 등이 적혀있는 승자투표권을 의미할 수 있다. 또한, 본 발명에서 승자란 예를 들면, 단승식에서는 한 명의 우승 선수(경마의 경우에는 우승마)를 의미할 수 있고, 복승식, 쌍승식, 삼복승식, 삼쌍승식 등에서는 순위권에 든 복수의 선수의 조합(경마의 경우에는 순위권 에 든 복수의 경주마의 조합)을 의미할 수 있다. 도 1은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템을 전체적으로 도시한 것 이고, 도 2는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 서버부의 세부 구성을 도시한 것이고, 도 3은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼을 도시한 것이고, 도 4는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예 측 시스템의 경주예측플랫폼의 배당표기테이블을 도시한 것이고, 도 5는 본 발명의 일 실시예에 따른 배당 변동 률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼에서 출력되는 부가정보 중 복승/쌍승 실시간 탑랭크 와 복승 급변동 탑랭크에 대한 정보를 도시한 것이고, 도 6은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼에서 출력되는 부가정보 중 삼복승 실시간 탑랭크와 삼복승 급변 동 탑랭크에 대한 정보를 도시한 것이고, 도 7은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주 결과 예측 시스템의 경주예측플랫폼에서 출력되는 부가정보 중 베팅금액 증가율 기준 평가표를 도시한 것이고, 도 8은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼에서 출 력되는 부가정보 중 실시간 배당 순 변동 추적표를 도시한 것이다. 도 1 내지 도 8에 도시된 바와 같이, 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시 스템은 경주권판매부와, 서버부, 사용자단말부를 포함한다. 경주권판매부는 판매된 경주권에 대한 정보인 판매경주권정보를 생성하는 것으로, 서버부에 네트워크 를 통해 연결된다. 보다 상세하게, 경주권판매부는 경주참가자로부터 경주장, 경주번호, 승식, 선수번호(경마의 경우에는 경 주마번호) 및 투표금액(베팅금액)에 대한 정보 중 적어도 하나 이상의 정보를 입력받아 이에 대응되는 종이 경 주권 및 모바일 경주권 중 어느 하나 이상을 생성하여 경마참가자에게 발행한다. 그리고 경주권판매부는 판매된 복수의 경주권에 대한 정보인 판매경주권정보를 기 설정된 주기마다 후술하 는 서버부로 송신한다. 서버부는 경주권판매부로부터 판매경주권정보를 수신하고, 수신된 판매경주권정보로부터 기 설정된 주기마다 각각의 승식(승자투표방식)에 따른 선수별 배당을 연산하여 배당정보를 생성하고, 배당정보를 이용하 여 각각의 승식에 따른 선수별 배당의 변동률을 분석함으로써 배당변동률정보를 생성하고, 배당변동률정보를 이 용하여 기 설정된 주기마다 각각의 승식에서의 예측 승자에 대한 정보인 예측승자정보를 생성하는 것으로, 경주 권판매부와 사용자단말부에 네트워크를 통해 연결된다. 여기서 서버부가 승자를 예측하는 승식은 단승식, 복승식, 쌍승식, 삼복승식, 삼쌍승식을 포함한다. 보다 상세하게, 단승식은 첫 번째로 결승선에 도착한 선수 또는 경주마를 승자로 하는 승식을 의미하고, 복승식 은 순위에 관계없이 결승선에 첫 번째 및 두 번째로 도착한 순서를 한 조로 하여 이를 승자로 하는 승식을 의미 하고, 쌍승식은 결승선에 순위대로 첫 번째 및 두 번째로 도착한 선수를 한 조로 하여 이를 승자로 하는 승식을 의미하고, 삼복승식은 순위에 관계없이 결승선에 첫 번째, 두 번째 및 세 번째로 도착한 선수를 한 조로 하여 승자로 하는 승식을 의미하고, 삼쌍승식은 결승선에 순위대로 첫 번째, 두 번째 및 세 번째로 도착한 선수를 한 조로 하여 승자로 하는 승식을 의미한다. 한편, 본 발명의 서버부가 승자를 예측하는 승식에는 연승식, 쌍복승식 등이 포함될 수 있음은 당업자에게 자명할 것이다. 이러한 서버부는 통신부와, 연산부와, 저장부를 포함한다. 통신부는 경주권판매부로부터 판매경주권정보를 수신하고, 후술하는 연산부에서 생성되는 배당 정보, 배당변동률정보, 예측승자정보 및 경주결과정보를 경주예측플랫폼을 통해 사용자단말부로 송신하는 것으로, 연산부와 전기적으로 연결되며, 경주권판매부와 사용자단말부에 네트워크를 통해 연결 된다. 여기서 판매경주권정보에는 경주장, 경주번호, 승식, 선수번호(경마의 경우에는 경주마번호) 및 투표금액(베팅 금액) 등에 대한 정보가 포함된다. 연산부는 수신된 판매경주권정보로부터 배당정보를 생성하고, 배당정보를 이용하여 배당변동률정보를 생성 하고, 배당변동률정보를 이용하여 예측승자정보를 생성하는 것으로, 통신부 및 저장부와 전기적으로 연결된다. 이러한 연산부는 보다 상세하게, 시간설정부(122a)와, 판매정보수집부(122b)와, 배당연산부(122c)와, 배당 변동률연산부(122d)와, 예측승자연산부(122e)와, 통계부(122f)를 포함한다. 시간설정부(122a)는 기준시간과, 제1설정시간과, 제2설정시간을 설정하는 것으로, 후술하는 판매정보수집부 (122b), 배당연산부(122c), 배당변동률연산부(122d)및 예측승자연산부(122e)와 전기적으로 연결된다. 여기서 기준시간은 경주권의 발매 마감 전 15분으로, 제1설정시간은 예를 들면, 경주권의 발매 마감 전 12분, 10분, 8분, 6분, 4분 및 2분으로 각각 설정될 수 있고, 제2설정시간은 예를 들면, 경주권의 발매 마감 전 12분, 4분, 2분 및 1분으로 각각 설정될 수 있다. 판매정보수집부(122b)는 경주권판매부로부터 판매경주권정보를 수집하여 저장부에 저장하는 것으로, 시간설정부(122a) 및 배당연산부(122c)에 전기적으로 연결된다. 보다 상세하게, 판매정보수집부(122b)는 경주권 판매부로부터 제1설정시간과 제2설정시간에서의 판매경주권정보를 각각 수집한다. 배당연산부(122c)는 판매정보수집부(122b)를 통해 수집된 판매경주권정보를 이용하여 제1설정시간에서의 각각의 승식, 즉, 단승식, 복승식, 쌍승식, 삼복승식 및 삼쌍승식별로 선수별 배당을 연산함으로써 배당정보를 생성하 는 것으로, 시간설정부(122a), 판매정보수집부(122b), 배당변동률연산부(122d), 예측승자연산부(122e) 및 통계 부(122f)와 전기적으로 연결된다. 예를 들면, 배당연산부(122c)에서는 경주권의 발매 마감 전 12분, 10분, 8분, 6분, 4분 및 2분 각각에서의 각 선수의 배당에 대한 정보를 생성한다. 배당변동률연산부(122d)는 배당정보를 이용하여 제1설정시간에서의 각각의 승식에 따른 선수별 배당의 변동률을 분석함으로써 배당변동률정보를 생성하는 것으로, 시간설정부(122a), 배당연산부(122c), 예측승자연산부(122e) 및 통계부(122f) 전기적으로 연결된다. 예를 들면, 배당변동률연산부(122d)에서는 경주권의 발매 마감전 12분, 10분, 8분, 6분, 4분 및 2분 각각에서의 각 선수에 대한 배당의 변동률에 대한 정보를 생성한다. 보다 상세하게, 배당변동률연산부(122d)는 기준대비 변동률 연산부와 누적 변동률연산부를 포함할 수 있다. 기준대비 변동률 연산부는 기준시간에서의 배당 대비 현재 변동률을 제1설정시간 단위로 각각 연산 함으로써 배당변동률정보를 생성할 수 있다. 또한, 누적 변동률 연산부는 기준시간에서의 배당 대비 현재변동률을 제1설정시간단위로 각각 연산한 후 이를 누적함으로써 배당변동률정보를 생성할 수 있다. 예측승자연산부(122e)는 배당변동률정보를 이용하여 예측승자정보를 생성하는 것으로, 시간설정부(122a), 배당 연산부(122c) 및 배당변동률연산부(122d)와 전기적으로 연결된다. 보다 상세하게, 예측승자연산부(122e)는 승식 이 삼복승식인 경우, 배당변동률정보를 이용하여 제2기준시간에서의 예측 승자에 대한 선수 조합을 생성한다. 예를 들면, 예측승자연산부(122e)에서는 경주권의 발매 마감 전 12분, 4분, 2분 및 1분 각각에서의 예측 승자에 대한 선수 조합을 생성한다. 이때, 예측승자연산부(122e)는 베팅금액 가중치를 배당변동률정보에 적용함으로써 예측 승자에 대한 선수 조합을 생성할 수 있다. 한편, 도 3에 도시된 바와 같이, 상술한 예측승자연산부(122e)의 삼복승식에 대한 연산 결과에 따라 경주예측플 랫폼은, 경주권의 발매 마감 전 4분에서의 예측 승자에 대한 선수 조합을 '삼복승조합 4분'으로, 경주권의 발매 마감 전 2분에서의 예측 승자에 대한 선수 조합을 '유력 삼복승조합 2분'으로, 경주권의 발매 마감 전 1분에서 의 예측 승자에 대한 선수 조합을 '변동 삼복승조합 1분'으로 정의하여 각각 출력할 수 있다. 통계부(122f)는 배당정보, 배당변동률정보를 이용하여 배당의 변동률과 관련된 통계정보를 생성하는 것으로, 배 당연산부(122c)와 배당변동률연산부(122d)와 전기적으로 연결된다. 예를 들면, 통계부(122f)는 배당정보, 배당 변동률정보를 이용하여 복승/쌍승 실시간 탑 랭크(Top Rank), 복승 급변동 탑랭크, 삼복승 실시간 탑 랭크, 삼 복승 급변동 탑 랭크, 베팅금액 증가율 기준 평가, 실시간 배당순 변동 추적 등의 부가정보들을 생성할 수 있다. 저장부는 경주권판매부로부터 수신된 판매경주권정보, 연산부에서 생성된 배당정보, 배당변동률 정보, 예측승자정보 및 경주결과정보를 저장하고, 경주예측플랫폼이 저장되는 것으로, 연산부와 전기적으 로 연결된다. 사용자단말부는 경주예측플랫폼이 실행되는 것으로, 서버부와 네트워크를 통해 연결된다. 이러한 사용자단말부는 스마트폰, 태블릿PC, 노트북, 데스크탑 등 중 어느 하나일 수 있으며, 와이파이 또 는 와이파이(wifi) 또는 블루투스(bluetooth)와 같이 근거리 통신을 통해 서버부와 연결되거나, 인터넷, 이더넷 클라우드, FCoE/DCB 클라우드, 근거리 통신망(LAN), WAN(Wide AreaNetwork), SAN(Storage Area Network) 중 어느 하나 이상의 통신망을 통해 서버부와 연결될 수 있다. 도 3 내지 도 8에 도시된 바와 같이, 경주예측플랫폼에서는 경주참가자가 경주의 배당 변동률과 관련된 정보들, 즉, 상술한 배당정보, 배당변동률정보, 예측승자정보, 경주결과정보 및 통계정보 등의 정보들이 출력된다. 이때, 도 4에 도시된 바와 같이, 경주예측플랫폼에는 배당표기테이블이 표시될 수 있는데, 배당표기 상단은 실 시간 현 변동률을, 배당표기 하단은 기준시간 배당 대비 제1설정시간(예를 들면, 12분, 10분, 8분, 6분, 4분 및 2분)에서의 각각의 변동률을, 상승배당일 경우 무색 바탕으로, 하향배당일 경우 연두색 바탕으로, 5%미만 보합 상승배당일 경우 연두색 바탕으로 표시될 수 있으며, 이를 통해 경주참여자로 하여금 배당 변동률의 흐름을 한 눈에 파악할 수 있도록 한다. 도 9는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주권판매부에 음성인 식부가 구비된 것을 도시한 것이고, 도 10은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 서버부에 음성분석부가 구비된 것을 도시한 것이다. 한편, 도 9 내지 도 10에 도시된 바와 같이, 본 발명의 경주권판매부는 경주참가자의 음성을 녹음하여 음 성정보를 생성하는 음성인식부를 구비할 수 있고, 본 발명의 연산부는 음성인식부로부터 음성정보를 전달받아 경주의 특정 선수에 대하여 정량적 및 정성적으로 분석하는 음성분석부(122g)를 더 구비할 수 있다. 보다 상세하게, 경주권판매부에 설치된 음성인식부로부터 음성정보를 전달받은 음성분석부(122g)는, 자연어처리(natural language processing) 분석 방법을 이용하여 음성정보로부터 경주참가자의 특정 선수 관련 음성에 대한 정보, 예를 들면, 특정 선수 내지 경주마에 대한 긍정적 또는 부정적 단어를 포함하는 텍스트 파일 등을 추출하여, 특정 선수에 대한 경주참가자의 반응을 정량적 및 정성적으로 분석하여 음성분석정보를 생성할 수 있다. 한편, 이러한 음성분석정보는 경주예측플랫폼에 별도로 표시될 수 있으며, 예측승자연산부(122e)는 이러한 음성 분석정보를 가중치로 변환하여 배당변동률정보에 적용함으로써 예측 승자에 대한 선수 조합을 생성할 수 있다. 도 11은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주권판매부의 음성 인식부의 동작을 도시한 것이다. 한편, 도 11에 도시된 바와 같이, 경주권판매부에 설치되는 음성인식부는 경주권을 실제로 구매하는 경주참가자의 음성만을 인식할 수 있도록, 경주참가자가 경주권판매부를 통해 경주권을 구매하는 동안만 외부로 돌출되도록 설치될 수 있다. 보다 상세하게, 음성인식부는 하우징부(111a)와, 모터부(111b)와, 피니언기어부(111c)와, 랙기어부(111d) 와, 연장부(111e)와, 회동부(111f)와, 마운트부(111g)와, 마이크부(111h)를 포함한다. 하우징부(111a)는, 후술하는 모터부(111b)와, 피니언기어부(111c)와, 랙기어부(111d)와, 연장부(111e)와, 회동 부(111f)와, 마운트부(111g)가 설치될 수 있는 공간을 제공하는 것으로, 일측면에 마운트부(111g)가 거치될 수 있는 거치부(111a1)가 돌출 형성된다. 이러한 거치부(111a1)에는 후술하는 마운트부(111g)의 복수의 기둥부 (111g3)가 삽입될 수 있는 복수의 관통홀이 형성된다. 모터부(111b)는 후술하는 피니언기어부(111c)가 정방향 또는 역방향으로 회전될 수 있도록 회전동력을 제공하는 것으로, 하우징부(111a)에 설치되어 피니언기어부(111c)와 체결된다. 피니언기어부(111c)는 모터부(111b)에 의해 정방향 또는 역방향으로 회전되는 것으로, 모터부(111b)에 체결되어 랙기어부(111d)에 치합된다. 랙기어부(111d)는 피니언기어부(111c)의 회전에 의해 전진 또는 후진하는 것으로, 길이방향으로 연장형성되어 피니언기어부(111c)와 치합된다. 연장부(111e)는 랙기어부(111d)의 후진 또는 전진에 따라 후술하는 회동부(111f)의 일단을 상방 또는 하방으로 회동시키는 것으로, 길이방향으로 연장형성되어 일단은 랙기어부(111d)에 회동가능하게 설치되고, 타단은 회동 부(111f)의 일단에 회동가능하게 설치된다. 회동부(111f)는 일단이 상방으로 회동되는 경우 연장부(111e)의 타단을 승강시키는 것으로, 일부분이 절곡되도 록 형성되어 일단은 연장부(111e)에 회동가능하게 설치되고, 타단은 베이스부에 회동가능하게 설치된다. 마운트부(111g)는 일측면에는 후술하는 마이크부(111h)가 설치되고 타측면에는 회동부(111f)에 의해 상방으로 회동된 연장부(111e)의 일단이 접촉되는 것으로, 거치부(111a1)에 거치된다. 이러한 마운트부(111g)는 보다 상세하게 거치부(111a1)의 일측에 배치되어 일면에 마이크부(111h)가 설치되는 제1마운트부(111g1)와, 거치부(111a1)의 타측에 배치되어 일면에 회동부(111f)에 의해 상방으로 회동된 연장부 (111e)의 일단이 접촉되는 제2마운트부(111g2)와, 거치부(111a1)의 관통홀 삽입되어 제1마운트부(111g1)와 제2 마운트부(111g2)를 연결하는 복수의 기둥부를 포함한다. 이때, 거치부(111a1)와 제2마운트부(111g2) 사이의 각각의 기둥부에는 마운트부(111g)에 탄성복원력을 인가하기 위한 탄성부가 구비된다. 마이크부(111h)는 경주참가자의 음성을 인식하는 것으로, 제1마운트부(111g1)에 설치된다. 이러한 마이크부 (111h)는 경주참가자의 음성을 인식하여 음성정보를 생성한 후 서버부의 음성분석부(122g)로 음성정보를 송신할 수 있다. 지금부터는 첨부된 도면을 참조하여 음성인식부의 동작을 상세히 설명한다. 먼저, 경주참여자가 경주권판 매부를 통해 경주권을 구매하기 위한 절차를 밟기 시작하면 경주권판매부의 닫혀있던 개폐부가 개방 된다. 이후, 모터부(111b)가 회전되어 피니언기어부(111c)를 일측 방향(반시계방향)으로 회전시키면 랙기어부 (111d)가 하방으로 이동되고, 연장부(111e)에 의해 회동부(111f)가 일측(좌측)으로 회동된다. 이에 따라 연장부 (111e)의 타단 또는 회동부(111f)의 일단이 마운트부(111g)의 일면(제2마운트부(111g2)의 일면)에 접촉되어 마 운트부(111g)를 승강시키고, 마이크부(111h)가 외부로 돌출될 수 있다. 그리고 경주참여자가 경주권 구매를 완료한 경우, 모터부(111b)가 회전되어 피니언기어부(111c)를 타측 방향(시 계방향)으로 회전시키면 랙기어부(111d)가 상방으로 이동되고, 연장부(111e)에 의해 회동부(111f)가 타측(우 측)으로 회동된다. 이에 따라 연장부(111e)의 타단 또는 회동부(111f)의 일단이 마운트부(111g)의 일면(제2마운 트부(111g2)의 일면)으로부터 이격되고, 탄성부에 의해 마운트부(111g)가 탄성복귀되어 마이크부(111h)가 경주 권판매부 내부로 인입되게 된다. 상술한 바와 같은 음성인식부에 따르면, 경주권을 실제로 구매하는 경주참가자의 음성만을 인식하여 분석 함으로써, 실제 경주에 참여하는 경주참가자들에 의한 주관적인 정보들이 승자 예측에 반영될 수 있으므로, 승 자 예측 정확도가 보다 향상될 수 있는 효과가 있다. 도 12는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 카메라부를 통해 촬영 된 경주마의 열화상 영상을 도시한 것이고, 도 13은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경 주결과 예측 시스템의 열화상 영상으로부터 얻어진 분석 지표를 도시한 것이다. 한편, 도 12 내지 도 13에 도시된 바와 같이, 본 발명의 배당 변동률 분석을 이용한 경주결과 예측 시스템은 카 메라부를 더 포함할 수 있고, 본 발명의 서버부는 영상분석부(122h)를 더 포함할 수 있다. 카메라부는 경기에 출전하는 각 선수를 촬영하여 각 선수에 대한 열화상 영상을 생성하는 것으로, 서버부에 전 기적으로 연결된다. 경마, 경륜, 경정 등을 포함하는 경주에서는, 경주 시작 전에 출전 선수(경마의 경우에는 경주마)의 컨디션을 고객에게 보여주는 시간을 갖게 된다. 이때, 본 발명의 카메라부는 영상분석부(122h)로부터 요청신호를 수신하 면 각 선수를 촬영하여 각 선수에 대한 열화상 영상을 생성한다. 영상분석부(122h)는 카메라부로부터 열화상 영상을 수신한 후 이를 분석하여 영상분석정보를 생성하는 것으로, 시간설정부에 전기적으로 연결된다. 즉 영상분석부(122h)는 경기시작 전 기 설정된 시간(예를 들면, 경기 시작 30분 전)에 카메라부에 영상 요청신호를 보내고, 카메라부로부터 열화상 영상을 수신한 후 이를 분석하여 각 선 수의 현재 신체 상태(체온 및 부상 등의 의학적 진단을 포함함)에 대한 정보인 영상분석정보를 생성한다. 이때, 영상분석부(122h)는 합성곱신경망(Convolutional Neural Network, CNN)을 이용하여 학습된 학습모델을 통해 영 상분석정보를 생성할 수 있다. 한편, 이러한 영상분석정보는 경주예측플랫폼에 별도로 표시될 수 있으며, 예측승자연산부(122e)는 이러한 영상 분석정보를 가중치로 변환하여 배당변동률정보에 적용함으로써 예측 승자에 대한 선수 조합을 생성할 수 있다. 상술한 바와 같은 카메라부와, 영상분석부(122h)에 따르면, 실제 경주에 참가하는 선수들의 객관적인 컨디션이 승자 예측에 반영될 수 있으므로, 승자 예측 정확도가 보다 향상될 수 있는 효과가 있다. 상술한 바와 같은 경주권판매부와, 서버부와, 사용자단말부와, 카메라부를 포함하는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템에 따르면, 경주권의 판매에 따른 배당 변동률을 분석함으로써 단승식, 복승식, 쌍승식, 삼쌍승식 및 삼복승식의 승자 예측 정확도를 대폭적으로 향상 시킬 수 있는 효과가 있다. 이상에서, 본 발명의 실시 예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설 명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서 라면, 그 모든 구성요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 이상에서 기재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성 요소가 내재할 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요 소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미와 일치하는 것으로 해석 되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 그리고 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변 형이 가능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위 에 포함되는 것으로 해석되어야 할 것이다.부호의 설명 100 : 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템 110 : 경주권판매부 120 : 서버부 121 : 통신부 122 : 연산부 122a : 시간설정부 122b : 판매정보수집부 122c : 배당연산부 122d : 배당변동률연산부 122e : 예측승자연산부 122f : 통계부 123 : 저장부 130 : 사용자단말부 111 : 음성인식부 111a : 하우징부 111a1 : 거치부 111b : 모터부 111c : 피니언기어부 111d : 랙기어부 111e : 연장부 111f : 회동부 111g : 마운트부 111g1 : 제1마운트부 111g2 : 제2마운트부 111h : 마이크부 122g : 음성분석부 122h : 영상분석부도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2022-0090403", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템을 전체적으로 도시한 것 이고,도 2는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 서버부의 세부 구성을 도시한 것이고, 도 3은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼을 도시 한 것이고, 도 4는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼의 배당 표기테이블을 도시한 것이고, 도 5는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼에서 출 력되는 부가정보 중 복승/쌍승 실시간 탑랭크와 복승 급변동 탑랭크에 대한 정보를 도시한 것이고, 도 6은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼에서 출 력되는 부가정보 중 삼복승 실시간 탑랭크와 삼복승 급변동 탑랭크에 대한 정보를 도시한 것이고, 도 7은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼에서 출 력되는 부가정보 중 베팅금액 증가율 기준 평가표를 도시한 것이고, 도 8은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주예측플랫폼에서 출 력되는 부가정보 중 실시간 배당 순 변동 추적표를 도시한 것이고, 도 9는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주권판매부에 음성인 식부가 구비된 것을 도시한 것이고, 도 10은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 서버부에 음성분석부 가 구비된 것을 도시한 것이고, 도 11은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 경주권판매부의 음성 인식부의 동작을 도시한 것이고, 도 12는 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 카메라부를 통해 촬영 된 경주마의 열화상 영상을 도시한 것이고, 도 13은 본 발명의 일 실시예에 따른 배당 변동률 분석을 이용한 경주결과 예측 시스템의 열화상 영상으로부터 얻어진 분석 지표를 도시한 것이다."}
