{"patent_id": "10-2022-0183091", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0100928", "출원번호": "10-2022-0183091", "발명의 명칭": "인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천 시스템", "출원인": "건양대학교산학협력단", "발명자": "태기식"}}
{"patent_id": "10-2022-0183091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "매트리스, 베개, 이불을 포함하는 침구류의 규격 및 재질을 포함하는 특성정보가 저장되는 데이터베이스(110);침구류 및 대상자를 포함한 수면모습을 촬영하되, 깊이영상을 획득하는 뎁스카메라(121)와, 열영상을 획득하는열영상카메라(122)를 구비하는 촬영모듈(120);상기 깊이영상 및 열영상을 조합하여 매칭영상을 생성하는 매칭부(131)와, 상기 매칭영상을 분석하여 대상자의체격 및 체형과 관절부 및 지정된 포인트를 포함하는 신체정보를 생성하는 추출부(132)와, 상기 신체정보를 분석하여 자세정보를 생성하는 자세분석부(133)를 구비하는 자세분석모듈(130);상기 자세정보를 분석하여 자세교정을 위한 교정정보를 생성하는 교정부(141)와, 상기 자세정보 및 교정정보 분석에 대응하는 침구류를 상기 데이터베이스(110)에서 검색하는 침구분석부(142)와, 상기 침구분석부(142)의 검색결과에 따른 추천정보를 생성하는 추천부(144)를 구비하는 추천모듈(140); 로 이루어지는 것을 특징으로 하는인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천 시스템."}
{"patent_id": "10-2022-0183091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,대상자의 취침시간 중 자세의 변화에 따른 변화정보를 생성하는 정보추적부(151)와, 대상자별 변화정보와 신체정보 및 자세정보를 수집하고 체격 및 체형에 따라 분류하는 수집분류부(152)와, 상기 수집분류된 정보를 학습하고 학습결과를 상기 추출부 및 자세분석부에 적용하는 학습부(153)를 구비하는 학습모듈(150); 을 더 포함하는 것을 특징으로 하는 인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천 시스템."}
{"patent_id": "10-2022-0183091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 정보추적부(151)는 대상자의 취침시간 중 체온의 변화를 변화정보에 포함시키고,상기 이불의 특성정보는 이불의 두께 및 재질에 따른 보온 및 열투과 특성을 포함하며,상기 침구분석부(142)는 상기 변화정보의 체온변화와 이불의 보온 및 열투과 특성에 따른 상관관계를 반영하여검색을 수행하도록 구성되는 것을 특징으로 하는 인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천시스템."}
{"patent_id": "10-2022-0183091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,대상자 또는 전문가로부터 상기 자세정보 및 교정정보에 대한 평가정보를 입력받는 평가입력부(161)와, 상기 평가정보를 분석하여 보정정보를 도출하여 상기 자세분석부 및 교정부(141)에 반영하는 보정부(162)를 구비하는평가모듈(160); 을 더 포함하는 것을 특징으로 하는 인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류추천 시스템."}
{"patent_id": "10-2022-0183091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0100928-3-제1항에 있어서,상기 추천모듈(140)은, 상기 침구분석부의 검색결과에 따른 베개의 높이 및 위치변화에 따른 대상자의 자세변화를 시뮬레이션하는 시뮬레이션부(143)를 더 포함하고,상기 추천부(144)는 설정된 교정자세에 근접한 시뮬레이션부(143)의 결과를 추천정보에 적용하도록 구성되는 것을 특징으로 하는 인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천 시스템."}
{"patent_id": "10-2022-0183091", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 교정정보 및 추천정보를 분석하여 매트리스(M) 및 베개(P)의 부분적인 강도에 대한 완화부(R) 및 보강부(S)를 적용하여 교정정보의 변화를 분석하며 매트리스 및 베개모델을 생성하여 제시하는 커스텀지원모듈(170);을 더 포함하는 것을 특징으로 하는 인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천 시스템."}
{"patent_id": "10-2022-0183091", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 뎁스카메라와 열영상카메라를 조합하여 이불을 덮은 상태에서도 정확하게 수면자세를 분석하여 비정상 수면자세의 교정과 함께 수면의 질을 향상시킬 수 있는 침구류를 추천하는 인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천 시스템에 관한 것이다."}
{"patent_id": "10-2022-0183091", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 수면자세 측정과 관련된 기술로, 자세하게는 뎁스카메라와 열영상카메라를 조합하여 이불을 덮은 상 태에서도 정확하게 수면자세를 분석하여 비정상 수면자세의 교정과 함께 수면의 질을 향상시킬 수 있는 침구류 를 추천하는 인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천 시스템에 관한 것이다."}
{"patent_id": "10-2022-0183091", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 건강에 대한 관심이 증대되면서, 수면의 질에 대한 관심도 높아지고 있다. 일생의 약 30%를 차지하는 수면 은 중추신경계 및 신체의 기능을 회복시키고, 생체적인 리듬을 유지시키며 동시에 심신을 안정시켜주어 건강한 생활을 가능하게 한다. 또한, 수면시간 동안 체내 기능(항상성)을 유지하기 위해 역동적인 변화가 일어나며 뇌, 심혈관, 위장관 등의 생체 기능을 안정적인 상태로 유지할 수 있게 되며, 역으로 질 좋은 수면을 충분히 취하지 못하면 즉, 수면 장 애를 앓게 되면 신체의 항상성이 무너져 심혈관 질환 우울증 당뇨병 등 다양한 질병에 노출된다. 이와 관련하여 영국 일간지 데일리 메일은 워릭 의과대학에서 유럽 심장저널에 발표한 연구를 인용해 장시간의 수면부족이 뇌졸중이나 심장질환의 위험을 높인다고 전했으며, 연구를 이끈 카펠리치오 교수에 따르면, 하루 6 시간 이상 수면을 취하지 않으면 심장질환으로 사망하거나, 심장질환을 앓게 될 확률이 48% 더 높고, 뇌졸중으 로 사망하거나 뇌졸중에 걸릴 확률이 15% 더 높다는 연구결과를 발표한 바 있다. 이처럼 숙면을 취하는 것은 건강을 위해 매우 중요하며, 수면의 질을 높이려면 기본적으로 규칙적인 생활 방식 을 가지고 일정한 시각에 자고 깨는 수면 습관을 개선해야 한다. 이와 더불어 수면의 질을 높이기 위해서 수면 환경과 편안한 잠자리도 수면 습관만큼이나 매우 중요하다. 근래 에는 예전과 달리 대부분 침대나 매트리스를 사용하므로 자신에게 잘 맞는 매트리스와 베개를 고르는 것에 따라 수면의 질이 달라질 수 있다. 하지만, 상당수가 온라인 구매를 이용하므로 후기만 보고서 자신에게 맞는 침구류를 결정하는 것이 쉽지 않고, 특히 근래 컴퓨터나 스마트폰을 많이 사용하고 운전 등 장시간 좋지 않은 자세를 유지함에 따라 목, 어깨, 등, 허리 등의 근골격계 질환이 증가하며 깊은 수면을 방해받고 있다. 따라서, 비교적 긴 시간에 걸쳐 이루어지는 수면시간 중 이러한 잘못된 자세를 교정하는 것이 큰 도움이 될 수 있으며, 이러한 침구류 구입시에 개인 선호도 외에 체형적인 요소를 고려할 필요가 있다. 수면의 질보다 정확한 진단을 위해서는 야간수면 다원검사가 가장 기본적인 검사라 할 수 있으나 관련 장비가 갖추어진 기관에 방문해야 하는 번거로움뿐만 아니라 평상시 이루어지는 수면상황을 동일하게 재현하기 어렵다. 또한, 수면자세의 검출을 위해 영상을 사용하므로 장시간에 걸쳐 촬영된 수면영상을 분석하는 작업이 번거로울 뿐만 아니라, 개인적인 사생활 및 신체노출, 이불 사용에 따른 판독 정확도 저하 등의 문제도 있다.선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2017-0054673호(2017.05.18)"}
{"patent_id": "10-2022-0183091", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제를 해결하기 위하여 창출된 것으로, 본 발명의 목적은 이불을 덮은 상태에서도 정확 하게 수면자세를 분석하여 비정상 수면자세의 교정과 함께 수면의 질을 향상시킬 수 있는 침구류를 추천하는 인 공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천 시스템을 제공하는 것이다."}
{"patent_id": "10-2022-0183091", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 위해 본 발명은 매트리스, 베개, 이불을 포함하는 침구류의 규격 및 재질을 포함하는 특성 정보가 저장되는 데이터베이스; 침구류 및 대상자를 포함한 수면모습을 촬영하되, 깊이 영상을 획득하는 뎁스카 메라와, 열 영상을 획득하는 열영상카메라를 구비하는 촬영모듈; 상기 깊이 영상 및 열 영상을 조합하여 매칭 영상을 생성하는 매칭부와, 상기 매칭 영상을 분석하여 대상자의 체격 및 체형과 관절부 및 지정된 포인트를 포 함하는 신체정보를 생성하는 추출부와, 상기 신체정보를 분석하여 자세정보를 생성하는 자세분석부를 구비하는 자세분석모듈; 상기 자세정보를 분석하여 자세교정을 위한 교정정보를 생성하는 교정부와, 상기 자세정보 및 교 정정보 분석에 대응하는 침구류를 상기 데이터베이스에서 검색하는 침구분석부와, 상기 침구분석부의 검색결과 에 따른 추천정보를 생성하는 추천부를 구비하는 추천모듈; 로 이루어지는 것을 특징으로 한다. 이때 대상자의 취침시간 중 자세의 변화에 따른 변화정보를 생성하는 정보추적부와, 대상자별 변화정보와 신체 정보 및 자세정보를 수집하고 체격 및 체형에 따라 분류하는 수집분류부와, 상기 수집분류된 정보를 학습하고 학습결과를 상기 추출부 및 자세분석부에 적용하는 학습부를 구비하는 학습모듈; 을 더 포함할 수 있다. 또한, 상기 정보추적부는 대상자의 취침시간 중 체온의 변화를 변화정보에 포함시키고, 상기 이불의 특성정보는 이불의 두께 및 재질에 따른 보온 및 열투과 특성을 포함하며, 상기 침구분석부는 상기 변화정보의 체온변화와 이불의 보온 및 열투과 특성에 따른 상관관계를 반영하여 검색을 수행하도록 구성될 수 있다. 또한, 대상자 또는 전문가로부터 상기 자세정보 및 교정정보에 대한 평가정보를 입력받는 평가입력부와, 상기 평가정보를 분석하여 보정정보를 도출하여 상기 자세분석부 및 교정부에 반영하는 보정부를 구비하는 평가모듈; 을 더 포함할 수 있다. 또한, 상기 추천모듈은, 상기 침구분석부의 검색결과에 따른 베개의 높이 및 위치변화에 따른 대상자의 자세변 화를 시뮬레이션하는 시뮬레이션부를 더 포함하고, 상기 추천부는 설정된 교정자세에 근접한 시뮬레이션부의 결 과를 추천정보에 적용하도록 구성될 수 있다. 또한, 상기 교정정보 및 추천정보를 분석하여 매트리스 및 베개의 부분적인 강도에 대한 완화부 및 보강부를 적 용하여 교정정보의 변화를 분석하며 매트리스 및 베개모델을 생성하여 제시하는 커스텀지원모듈; 을 더 포함할 수 있다."}
{"patent_id": "10-2022-0183091", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명을 통해 수면자세의 정확한 분석과 이를 통한 수면자세 개선 및 교정과 더불어, 수면장애 및 자세 불균 형 환자들의 증상 완화 및 재활 보조를 위한 솔루션을 제공할 수 있다. 특히 바로 누운자세에서 오십견, 회전근개, 힘줄염 및 갈비빗장관절 협소에 의한 가슴문증후군과 같은 어깨질환, 추간판탈출증과 같은 허리 질환을 비롯하여, 옆으로 누운 자세에서의 턱관절의 장애 또는 통증 환자, 오십견, 회전근개 손상, 힘줄염 및 작은가슴근 단축으로 인한 가슴문증후군과 같은 어깨 질환, 옆굽음증 및 허 리 과가동성으로 인한 통증 등의 허리 질환과 ,엉덩관절염, 엎드려 누운 자세에서의 목과 허리의 과도한 전방경 사와 앞굽음이 나타나는 추간판 탈출 및 통증 등 바르지 않은 수면자세에 따른 질환을 효과적으로 예방 및 완화할 수 있다. 또한, 뎁스카메라와 열영상카메라의 조합을 통해 신체 접촉 없이 이불을 덮은 상태로 수면중인 대상자의 수면자 세를 분석하여 비정상적인 자세를 교정할 수 있고 수면의 질을 높일 수 있는 맞춤형 침구류를 추천할 수 있다. 이를 통해 실제 침구류를 사용하지 않고도 침구별 특성정보의 분석을 통해 본인에게 적합한 침구류를 쉽게 선택 할 수 있으며 인공지능 학습을 통해 유사한 체형과 수면자세를 갖는 사용자의 분석결과를 통해 추천 정확도를 높일 수 있다."}
{"patent_id": "10-2022-0183091", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참고하여 본 발명 인공지능 기반 수면자세 레벨 분류를 통한 맞춤형 침구류 추천 시스템의 구성을 구체적으로 설명한다. 도 1은 본 발명의 개념도, 도 2는 본 발명의 실시예에 따른 구성 및 연결관계를 나타낸 블록도로서, 본 발명은 영상을 통해 수면자세를 측정하여 비정상적인 수면자세에 대한 교정과 이를 위한 맞춤형 침구류를 추천하게 되 며 이를 위한 주요구성으로 데이터베이스와, 촬영모듈과, 자세분석모듈과, 추천모듈을 비 롯하여, 데이터분석 정확도 및 만족도 향상을 위해 학습모듈과 평가모듈 및 커스텀지원모듈을 구비하게 된다. 상기 데이터베이스는 매트리스(M), 베개(P), 이불(B)을 포함하는 침구류의 규격 및 재질, 형상을 포함하는 특성정보가 저장되어 구축된다. 침구류 제작 및 판매 업체에서 제공하는 제품사양 정보를 기반으로 크기 및 재 질을 비롯하여 이를 통해 신축성, 물리적 강도에 따른 변형률 등이 포함되어 특성정보로 저장된다. 특히 이불의 경우 대상자 체온에 따른 보온특성을 갖게 되므로 상기 이불의 특성정보는 이불의 두께 및 재질에 따른 보온 및 열투과 특성을 포함하는 것이 바람직하다. 상기 촬영모듈은 침구류 및 대상자를 포함한 수면모습을 촬영하는 구성으로 본 발명에서는 깊이 영상을 획 득하는 뎁스카메라와, 열 영상을 획득하는 열영상카메라의 2가지 방식을 병행하여 수면모습을 촬영하 게 된다. 도 3은 본 발명의 실시예에 따른 주요 수면자세를 나타낸 예시도, 도 4는 본 발명의 실시예에 따른 조인트 설정 과정을 나타낸 예시도, 도 5는 본 발명의 실시예에 따른 열화상을 나타낸 예시도, 도 6은 본 발명의 실시예에 따른 자세측정 과정을 나타낸 예시도이다. 도 4와 같이 상기 뎁스카메라의 깊이 영상을 통해 대상자의 자세를 어느 정도 파악할 수 있으나 이불 등을 덮고 있는 상태에서의 정확도가 저하될 수 있음에 따라 도 6과 같이 이불을 투과한 신체 영상의 획득이 가능한 열영상카메라를 통해 정확한 자세분석을 지원할 수 있다. 이러한 촬영모듈은 기본적으로 뎁스카메라 및 열영상카메라가 일체로 구성되어 수면 중인 매트 리스의 상측에 설치하여 위에서 아래 방향으로 대상자를 촬영하게 되며 필요시 측면에서의 촬영이 가능하도록 측면에서 추가로 촬영모듈을 설치하여 더 정확한 수면자세의 분석이 이뤄질 수 있다. 상기 자세분석모듈은 상기 촬영모듈로부터 획득된 영상을 통해 대상자의 수면자세를 분석하기 위한 것으로, 세부구성으로 매칭부와, 추출부와, 자세분석부를 구비한다. 상기 매칭부는 상기 촬영모듈, 즉 뎁스카메라와 열영상카메라를 통해 각각 획득된 상기 깊 이 영상 및 열 영상을 조합하여 매칭 영상을 생성하는 구성이다. 상기 뎁스카메라와 열영상카메라가 실질적으로 동일한 위치에서 동일한 방향으로 동일한 대상을 촬영함에 따라 특성이 다른 두 영상이 얻어지게 되 며 동일한 비율로 조절된 이 두 영상을 조합함에 따라 대상자 신체 외형의 정확한 경계의 확인 및 자세 분석이 이루어질 수 있다. 상기 추출부는 상기 매칭부를 통해 생성된 매칭 영상을 분석하여 대상자의 체격 및 체형과 관절부 및 지정된 포인트를 포함하는 신체정보를 생성하는 구성이다. 상기 조인트는 수면자세 분석을 위한 주요 관절 부분으로 본 발명의 실시예에서는 머리, 목, 스파인체스트, 골 반, 배꼽, 왼쪽 및 오른쪽 팔꿈치, 손, 엉덩이, 무릎, 발 총 15개의 조인트를 설정하여 그 좌표 값을 획득하였 다. 또한, 상기 뎁스카메라로 에저키넥트를 사용하였으며, Visual studio 2019를 통해 Azure kinect nuget pakege를 구동하여 15개의 조인트를 설정 후, 각 조인트의 좌표값을 받아 엑셀에 저장하고 csv파일로 변환하여 딥러닝에 데이터셋으로 사용하였다. 상기 자세분석부는 상기 추출부를 통해 생성된 신체정보를 분석하여 자세정보를 생성하는 구성으로, 본 발 명에서는 상기 15개의 관절 좌표를 통해 도 3과 같이 정자세, 오른쪽/왼쪽 새우잠 자세, 오른쪽/왼쪽 무릎 세운 자세, 양손 머리, 오른손/왼손 머리 자세, 만세자세, 양쪽 무릎 세우기 자세의 일상에서 자주 취하게 되는 10개 수면 자세로 분류한 자세정보를 생성하였다. 상기 추천모듈은 상기 자세정보 분석에 따른 교정 및 침구 추천을 수행하는 것으로, 세부구성으로 교정부 와, 침구분석부와, 시뮬레이션부와, 추천부를 구비한다. 상기 교정부는 상기 자세정보를 분석하여 자세교정을 위한 교정정보를 생성하는 구성이다. 첨부된 도 6과 같이 조인트의 위치에 따른 목, 허리의 각도를 중심으로 비정상 자세를 바로잡기 위한 교정정보를 생성하는 것으로 미리 설정된 바람직한 수면자세를 기준으로 비정상 자세에 따른 머리의 높이, 상하 좌우 각도, 허리의 상 하좌우 각도를 바로잡아 줄 수 있는 교정정보를 생성한다. 상기 침구분석부는 상기 자세정보 및 교정정보 분석에 대응하는 침구류를 상기 데이터베이스에서 검 색하는 구성이다. 앞서 언급한 바와 같이 머리나 상/하체 및 다리의 높이를 교정할 수 있는 베개 및 매트리스 등 상기 데이터베이스에 저장된 베개 및 매트리스의 크기, 형상, 재질, 신축성 등의 특성정보를 통해 교정 정보를 만족할 수 있는 특성정보를 갖는 침구의 검색이 이루어진다. 상기 시뮬레이션부는 상기 침구분석부의 검색결과에 따른 베개의 높이 및 위치변화에 따른 대상자의 자세변화를 시뮬레이션하는 구성으로, 침구분석과정과, 침구류 적용전 변화하는 수면자세를 미리 확인할 수 있 도록 지원한다. 상기 추천부는 상기 침구분석부의 검색결과에 따른 추천정보를 생성하는 구성으로, 기본적으로 교정정보에 적합하거나 근접하는 등 교정정보를 만족할 수 있는 특성정보를 갖는 침구를 추천한다. 특히 상기 추천부는 설정된 교정자세에 근접한 시뮬레이션부의 결과를 추천정보에 적용하도록 구성되 는 것이 바람직하다. 즉 상기 시뮬레이션부를 통해 얻어지는 자세의 변화 중 미리 설정된 바람직한 수면자 세에 가장 가까운 결과를 도출할 수 있는 침구류를 추천하게 된다. 이때 데이터베이스에 저장된 침구류를 통해 교정정보를 만족시킬 수 없는 경우 맞춤형 침구의 제작을 지원 할 수 있으며, 이를 위해 상기 커스텀지원모듈은 상기 교정정보 및 추천정보를 분석하여 매트리스(M) 및 베개(P)의 부분적인 강도에 대한 완화부(R) 및 보강부(S)를 적용하여 교정정보의 변화를 분석하며 매트리스 및 베개모델을 생성하여 상기 데이터베이스를 기반으로 분석 정보들을 소프트웨어 및 어플리케이션 등을 통하 여 음성,문자, 시각화 방식으로 사용자에게 제시한다. 도 7은 본 발명의 실시예에 따른 매트리스 및 베개모델을 생성 예시도로서, 기존 침구류에 교정정보를 만족시킬 수 있도록 부분적인 완화부(R) 및 보강부(S)가 적용된 모습을 예시하고 있다. 상기 완화부(R)는 침구의 특정 부분의 강도나 신축성을 완화할 수 있는 부분으로 해당 신체부분의 높이를 낮추 는 등의 효과를 준다. 매트리스(M)나 베개(P)에 삽입되는 속재료의 양을 줄이거나 재료특성을 물렁하거나 부드 러운 재질로 부분적으로 바꾸는 방식으로 완화부(R)를 구성할 수 있다. 상기 보강부(S)는 침구의 특정 부분의 강도나 신축성을 강화할 수 있는 부분으로 해당 신체부분의 높이를 높이 는 등의 효과를 준다. 매트리스(M)나 베개(P)에 삽입되는 속재료의 양을 늘리거나 재료특성을 보다 강하고 상대 적으로 단단한 재질로 부분적으로 바꾸는 방식으로 보강부(S)를 구성할 수 있다. 상기 학습모듈은 인공지능 학습을 통해 수면자세를 분석하기 위한 것으로 특히 유사한 체격, 체형 및 수면 자세를 갖는 대상자를 학습하며 정확도를 높일 수 있으며, 이를 위한 세부구성으로 정보추적부와, 수집분 류부와, 학습부를 구비한다. 상기 정보추적부는 대상자의 취침시간 중 자세의 변화에 따른 변화정보를 생성하는 구성으로, 이를 통해 어떤 자세로 어떤 시간을 유지했는지, 주로 취하는 자세가 어떤 자세인지를 좀더 세밀하게 분석할 수 있다. 상기 수집분류부는 대상자별 변화정보와 신체정보 및 자세정보를 수집하고 체격 및 체형에 따라 분류하며, 유사한 체격, 체형 및 수면자세를 갖는 대상자를 세부적으로 학습할 수 있도록 한다. 상기 학습부는 상기 수집분류부를 통해 수집분류된 정보를 학습하고 학습결과를 상기 추출부 및 자세분석 부에 적용한다. 본 발명의 실시예에서 상기 학습부는 구글 코랩을 통해서 진행하였고, 50회의 순환 루프를 사용하는 LSTM 을 활용하여 은닉층을 추가해주어 간단하게 구성하여 학습을 진행하였다. 학습결과로 수면 자세 추정에 대한 평 균 정확도는 94.16%를 달성했으며, 최대 정확도 및 최소 정확도는 각각 95.98%, 92.46%임을 확인하였다. 자세별 평균 정확도는 정자세 91.00%, 왼쪽 새우잠 85.00%, 오른쪽 새우잠 99.00%, 왼쪽 무릎 세우기 99.00%, 오른쪽 무릎 세우기 97.00%, 양손 머리 95.00%, 왼손 머리 95.00%, 오른손 머리 100.00%, 만세 84.00%, 양쪽 무릎 세우기 96.84%로 확인되었다. 또한, 상기 학습부는 열영상을 이미지를 전처리하여 객체의 경계를 분명하게 다듬는 작업을 진행한 뒤 Convolution layer를 이용한 CNN을 이용한 모델을 통해 분류하는 학습을 진행 후 이 또한 상기 평가모듈에 전달하여 맞춤형 침구류 추천에 이용할 수 있다. 이때 상기 정보추적부는 대상자의 취침시간 중 체온의 변화를 변화정보에 포함시키고, 앞서 언급한 바와 같이 상기 이불의 특성정보는 이불의 두께 및 재질에 따른 보온 및 열투과 특성을 포함함에 따라, 상기 침구분 석부는 상기 변화정보의 체온변화와 이불의 보온 및 열투과 특성에 따른 상관관계를 반영하여 검색을 수행 하도록 구성될 수 있다. 즉 사람마다 수면 중 체온이 미소하나마 차이가 있으며 선호하거나 이러한 체온 특성에 잘 맞는 이불을 통해 수 면의 질을 향상시킬 수 있다. 특히 취침 중 이불을 걷어내는 경우 이러한 이유로 맞지 않는 이불을 사용하는 것 에 기인할 가능성이 크며, 체온이 상대적으로 낮을 경우 상대적으로 두껍고 보온성이 높은 특성의 이불을 체온 이 상대적으로 높 경우 상대적으로 얇고 보온성이 낮은 특성의 이불을 추천함으로 수면의 질을 높일 수 있다. 상기 평가모듈은 시스템 알고리즘으로 추천된 결과에 따른 대상자 또는 전문가의 평가나 의견을 알고리즘 에 반영되도록 하여 추후, 보다 신뢰성 있고 만족할만한 분석결과를 도출할 수 있도록 지원하는 것으로, 세부구 성으로 평가입력부와, 보정부를 구비한다. 상기 평가입력부는 대상자 또는 전문가로부터 상기 자세정보 및 교정정보에 대한 평가정보를 입력받는 구 성이다. 대상자는 실제 본 발명에 따라 추천된 침구류를 사용함에 따른 평가를 입력하게 되며, 전문가의 경우 자세정보 및 교정정보에 대한 평가를 입력하게 된다. 상기 보정부는 상기 평가입력부를 통해 입력된 평가정보를 분석하여 보정정보를 도출하여 상기 자세분석부 및 교정부에 반영하는 구성이다. 대상자로부터 평가정보가 양호하게 입력된 경우 실질적으로 상기 자세분석부 및 교정부에 반영될 보정정보는 없으며, 만약 불편함이 있을 경우 이를 통해 자세분석부 및 교정부에 해당 불편함을 해소할 수 있는 알고리즘 수정이 이루어진다. 또한, 전문가로부터 상기 자세분석부 및 교정부를 통해 도출된 자세정보 및 교정정보가 양호하다고 판단시 상기 자세분석부 및 교정부에 반영될 보정정보는 없으며, 만약 수정을 요하는 사항이 있을 경우 이를 통해 자세분석 부 및 교정부에 해당 불편함을 해소할 수 있는 알고리즘 수정이 이루어진다. 본 발명의 권리는 위에서 설명된 실시예에 한정되지 않고 청구범위에 기재된 바에 의해 정의되며, 본 발명의 분 야에서 통상의 지식을 가진 자가 청구범위에 기재된 권리범위 내에서 다양한 변형과 개작을 할 수 있다는 것은 자명하다.부호의 설명 110: 데이터베이스 120: 촬영모듈 121: 뎁스카메라 122: 열영상카메라 130: 자세분석모듈 131: 매칭부 132: 추출부 133: 자세분석부 140: 추천모듈 141: 교정부 142: 침구분석부 143: 시뮬레이션부 144: 추천부 150: 학습모듈 151: 정보추적부 152: 수집분류부 153: 학습부 160: 평가모듈 161: 평가입력부 162: 보정부 170: 커스텀지원모듈 M: 매트리스 P: 베개 B: 이불 S: 보강부 R: 완화부도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2022-0183091", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 개념도, 도 2는 본 발명의 실시예에 따른 구성 및 연결관계를 나타낸 블록도, 도 3은 본 발명의 실시예에 따른 주요 수면자세를 나타낸 예시도, 도 4는 본 발명의 실시예에 따른 조인트 설정 과정을 나타낸 예시도, 도 5는 본 발명의 실시예에 따른 열화상을 나타낸 예시도, 도 6은 본 발명의 실시예에 따른 자세측정 과정을 나타낸 예시도, 도 7은 본 발명의 실시예에 따른 매트리스 및 베개모델을 생성 예시도이다."}
