{"patent_id": "20-2018-0003173", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "20-2019-0002497", "출원번호": "20-2018-0003173", "출원인": "광저우 시노헬스 테크놀로지 시오., 엘티디."}}
{"patent_id": "20-2018-0003173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 3개의 맥상 센서를 포함하며,각 맥상 센서는 모두 고정 쉘, 플렉시블 맥진 터치필름, 레이저 발사 렌즈, 기압 센서, 레이저 수신 렌즈, 흡배기 파이프와 밀폐 챔버 상부 커버를 포함하며상기 플렉시블 맥진 터치필름은 상기 고정 쉘 하단에 배치되며, 상기 밀폐 챔버 상부 커버는 상기 고정 쉘 내부의 상부에 배치되고, 상기 플렉시블 맥진 터치필름, 상기 밀폐 챔버 상부 커버와 고정 쉘은 밀페 챔버를 둘러싸며,상기 흡배기 파이프의 양단은 각각 상기 밀폐 챔버의 내부 및 외부와 상통되며, 상기 레이저 발사 렌즈의 발사단과 레이저 수신 렌즈의 수신단은 모두 상기 플렉시블 맥진 터치필름의 내벽을 향하고, 상기 기압 센서의 탐지간은 상기 밀폐 챔버 내에 배치되며,각 밀페 챔버 내의 흡배기 파이프는 모두 공압 제어 매커니즘에 연결되어 공압 제어 매커니즘에 의해 독립적으로 제어되고, 각 맥상 센서의 상하 이동은 상하 이동 제어 메커니즘에 의해 독립적으로 제어되며, 레이저 수신기와 레이저 발생기를 더 포함하며, 레이저 발생기가 생성하는 스캐닝 레이저를 레이저 발사 렌즈로전송하고, 레이저 수신 렌즈가 수신하여 반사하는 레이저를 상기 레이저 수신기로 전송하며, 중앙 제어 유닛을 더 포함하며, 상기 기압 센서, 공압 제어 매커니즘, 상하 이동 제어 매커니즘, 레이저 발생기와 레이저 수신기는 모두 중앙 제어 유닛에 연결되며,상기 중앙 제어 유닛은 컴퓨터 시스템에 연결되며,상기를 특징으로 하는 레이저 3차원 스캐닝에 기반하는 5차원 정보 자동 획득 장치."}
{"patent_id": "20-2018-0003173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,레이저 수신기와 레이저 발생기는 모두 한 개이며, 모든 맥상 센서 중의 레이저 수신 렌즈는 모두 광섬유를 통해 상기 레이저 수신기에 연결되고, 모든 맥상 센서 중의 레이저 발사 렌즈는 모두 광섬유를 통해 상기 레이저발생기에 연결되는 것을 특징으로 하는 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보 자동 획득 장치."}
{"patent_id": "20-2018-0003173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 플렉시블 맥진 터치필름이 중공의 반구형인 것을 특징으로 하는 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보 자동 획득 장치."}
{"patent_id": "20-2018-0003173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,하우징을 더 포함하며, 상기 맥상 센서는 모두 상기 하우징의 하부에 배치되고, 각 맥상 센서 중의 플렉시블 맥진 터치필름은 아래쪽으로 상기 하우징의 외부에 노출되며,상기 공압 제어 매커니즘, 상하 이동 제어 매커니즘, 레이저 발생기, 레이저 수신기와 중앙 제어 유닛은 모두상기 하우징 내에 배치되는 것을 특징으로 하는 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보 자동 획득 장치."}
{"patent_id": "20-2018-0003173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개실용신안 20-2019-0002497-3-제 1항에 있어서,상기 공압 제어 매커니즘은 공압 펌프이며, 각 흡배기 파이프는 각각 독립적인 채널을 통해 상기 공압 펌프에연결되고, 상기 공압 펌프는 각 채널의 공기 흡입 및 배출을 독립적으로 조절하는 것을 특징으로 하는 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보 획득 장치."}
{"patent_id": "20-2018-0003173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서, 상기 상하 이동 제어 매커니즘은 유압 펌프와 지압 제어기를 포함하고, 각 맥상 센서에는 각각 상기 지압 제어기가 배치되며,상기 지압 제어기는 맥상 센서 슬리브, 유압 피스톤, 피스톤 슬리브 및 액체 유입 배출 파이프를 포함하며, 상기 맥상 센서는 상기 맥상 센서 슬리브 내에 설치되고, 상기 유압 피스톤은 상기 피스톤 슬리브 내에 설치되어상기 맥상 센서의 고정 쉘의 상단에 연결되며, 상기 액체 유입 배출 파이프의 양단은 각각 상기 피스톤 슬리브의 내부 및 유압 펌프와 연결되며, 각 액체 유입 배출 파이프는 각각 독립적인 채널을 통해 상기 유압 펌프에 연결되고, 유압 펌프는 각 채널의 액체 유입 및 유출을 독립적으로 제어하는 것을 특징으로 하는 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보자동 획득 장치."}
{"patent_id": "20-2018-0003173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,맥진 플랫폼을 더 포함하며, 상기 맥진 플랫폼은 주로 팔뚝 받침대와 맥박 계측기 자동 포지셔너로 구성되며, 상기 맥박 계측기 자동 포지셔너는 카메라, 위치 조정 제어기와 3축 플랫폼을 포함하며, 상기 맥상 센서는 상기 3축 플랫폼에 장착되고, 상기 카메라는 인체의 손목 부위 이미지를 획득해서 상기 위치조정 제어기로 전송하며, 상기 위치 조정 제어기는 3축 플랫폼을 제어하여 맥상 센서기의 이동을 조정함으로써맥상 센서의 3축 위치를 결정하는 것을 특징으로 하는 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보 자동획득 장치.고안의 설명기 술 분 야본 실용신안은 한의학 맥진 자동화 기술 영역에 관련된 것이며, 구체적으로 일종의 레이저 3차원 스캐닝에 기반 [0001]하는 맥상 5차원 정보 자동 획득 장치에 관한 것이다.배 경 기 술한의학의 맥상은 한의학 4가지 진단법의 중요한 내용인 풍부한 생물학적 정보를 포함한다. 맥동은 맥상이라 부 [0002]르는 (손가락)의 형상을 말하고, 맥박의 형상과 움직임을 가리킨다. 맥상의 형성은 내장 및 기혈과 밀접한 관계가 있다. 진나라 왕숙화는 《맥경》에서 맥상을 24가지로 집대성하였다. 명나라의 이시진은 《빈호맥학》에서27맥으로 정의하였고, 명나라 이사재는 《진가정안》에서 질병맥을 추가하여 총 28종 맥상으로 정의하였으며,후세에서는 대부분 28맥을 사용하고 있다. 맥상 요소는 위치, 수, 모양, 기운 등 4개 방면을 포함하는 맥상의 기본 구성 부분을 말한다. 인공 맥상은 주로 [0003]손가락의 감각에 의존하여 인식된다. 맥상의 종류는 매우 많은데, 한의학 문헌에서는 보통 위치, 수, 모양, 기운 등 4개 방면부터 분석 귀납하며, 맥박의 빈도, 리듬, 나타나는 부위, 길이, 폭, 맥관의 부종, 긴장도, 원활한 혈류의 흐름, 심장 박동의 강약 등 요소와 관련된다. 맥상 요소를 파악하면, 각종 맥상의 특징 및 형성 매커니즘에 대해 간단하게 이해할 수 있다. 맥의 위치 : 맥박이 나타나는 부위와 길이를 말한다. 진맥할 때마다 맥박이 나타나는 부위의 깊이, 길이를 진단 [0004]해야 한다. 정상 맥박의 부위는 떠오르거나 가라앉지 않는 중간에서 얻을 수 있고, 촌, 관, 척의 3 부위에서 맥공개실용신안 20-2019-0002497-4-을 느낄 수 있다. 만약 맥의 위치가 얕으면 부맥이고, 맥의 위치가 깊게 가라앉아 있으면 침맥 등이다. 맥박이촌, 관, 척 3개 부위를 초과하면 장맥이고, 맥박의 움직임이 촌, 척에 미치지 못하면 단맥이다. 맥의 수 : 맥박이 뛰는 수와 리듬을 말한다. 진맥할 때마다 맥박의 속도와 리듬이 규칙적인지 여부를 진단해야 [0005]한다. 정상적 성인의 맥박 빈도는 분당 70-90회이고 리듬이 일정하며 멎지 않는다. 예를 들어 호흡 한 번에 5번이상이면 속맥이고, 4회 미만이면 지맥이다. 맥박이 멎는 경우는 부정맥, 결맥, 대맥 등 다양하다. 맥박의 리듬이 뷸규칙한 경우는 산맥, 삽맥 등이 있다. 맥의 모양 : 맥박이 뛰는 폭 등의 형태를 말한다. 진맥할 때마다 맥박의 크기, 부드러움 등의 형태를 진단해야 [0006]한다, 맥의 모양은 주로 맥관의 부종, 맥박의 변동 폭 등의 요소와 관계가 있다. 맥관이 비교적 부종되어 있고맥박의 폭이 비교적 크면 홍맥이고, 맥관의 부종이 적고 박동 폭이 비교적 작으면 세맥이며, 맥관의 탄력과 부드러움이 부족하면 현맥이고, 맥이 연하고 부드러우나 힘이 없으면 유맥, 완맥 등이다. 맥의 기운 : 맥박의 강도, 부드러움 등의 동향을 말한다. 맥의 기운은 맥박이 뛰는 축방향과 반경방향의 강도, [0007]심장과 저항력 영향으로 발생하는 부드러움, 혈관 탄력과 장력 영향으로 발생하는 긴장도 등과 같은 여러가지요인을 포함한다. 진맥할 때마다 맥박의 강도 및 부드러움 정도를 진단해야 한다. 정상적 맥상은 완만하고 부드러우며, 적당한 강도가 있어야 한다. 맥에 힘이 있으면 실맥이고, 힘이 없으면 허맥이다. 맥의 상태가 막힘 없이 비교적 좋고 매끄럽게 흐르면 활맥이고, 맥의 왕래가 매끄럽지 않으면 삽맥 등이다. 상기 내용은 맥상을 구성하는 기본 요소이며, 맥상 진단을 위한 기본 요소이기도 하다. 맥상의 인식은 주로 의 [0008]사 손가락의 감각에 달려 있기 때문에, 진맥하는 의사는 반드시 손가락 감각을 반복 연습하고 세심하게 살펴서각종 맥상 요소를 종합 분석해야만, 비교적 완벽한 맥상을 획득할 수 있고, 각종 병맥을 정확하게 구별할 수 있다. 맥진은 인간의 손가락 끝의 촉각 기능에 달려 있다. 인간의 피부는 촉각, 통각, 열각 등 여러가지 감각을 감지 [0009]할 수 있으며, 그중 촉각의 감지는 특히 중요하다. 인간의 촉각은 주로 다양한 깊이의 피부에 분포된 대량의 기계적 자극 수용체 중의 4가지 촉각 수용체를 통해 감지한다. 표피 피부 중의 마이스너 소체와 피부 심층의 파시니 소체는 모두 신속한 적응 수용체이며, 전자는 3~40Hz 저주파 동적 범위의 외부 자극에 신속하게 반응함으로써, 저주파 진동과 운동 감지 및 악력 제어 등의 기능을 구현한다. 후자는 40~500+Hz 고주파 동적 범위의 외부자극에 신속하게 반응하여 고주파 진동과 도구 사용 등의 감각 기능을 구현한다. 이와 대조적으로, 전신의 표피기저세포 사이에 분포하고 일종의 지상돌기를 지닌 메르켈 세포 및 진피 내에 있는 긴 방추형의 루피니 소체는느린 적응 수용체로서, 전자는 0.4~3.0Hz 저주파 동적 범위의 공간 변형, 지속적 압력, 곡면, 가장자리 또는 예리한 모서리 등의 외부 자극에 천천히 반응함으로써, 모드/형태 감지 및 텍스처 감지 등의 감각 기능을 구현하고, 후자는 100~500+Hz 고주파 동적 범위의 지속적 하향 압력, 횡 방향 피부 스트레칭과 피부 미끄러짐 등의 외부 자극에 서서히 반응함으로써, 손가락 위치, 안정적인 잡기, 접선력 및 운동 방향 등의 감각 기능을구현한다. 촉각 감지의 특징에 따라 촉각을 슬라이딩 촉각과 유연 촉각 두 가지로 나눌 수 있다. 슬라이딩 촉각은 손가락 접촉면에 평행하는 감지로서, 주로 물체 표면의 기하학적 모양, 질감, 온도 등을 반영하며, 유연 촉각은 손가락 접촉면 방향에 수직하는 동적 감지로서, 주로 물체의 유연성 또는 강도를 반영한다. 인체 각 부위의 촉각 수용체 분포 밀도는 차이가 크다. 성인의 손가락 끝과 손바닥에는 각각 241과 58 cm2 촉각 수용체가 분포하므로, 인체 각 부위의 공간 분해능 차이는 매우 뚜렷하다. 손가락 끝의 공간 분해능은 깊이 지각이 0.2mm이고, 두 점의 간격은 0.5mm이며, 서로 다른 위치의 두 가지 사건의 임계 촉감 반응 시간은 30~50ms 레벨이다. 제어 가능한 압력 민감도 연구에 따르면, 남성 손바닥과 손가락 끝의 정상 압력 임계값 평균은 각각 0.158g과0.055g이고, 여성의 해당 임계값은 각각 0.032g과 0.019g이라고 밝혔다. 한의학의 맥진은 한의사의 손가락 끝 감각에 근거한다. 인류의 손가락 끝은 수용체의 밀도가 가장 높기 때문에, [0010]한의사의 맥진을 통해 풍부하고 정확도가 높은 정보를 얻을 수 있다. 한의학의 객관적인 맥진을 구현하기 위해,센서는 맥진 정보 획득 방면에서 인류 손가락 끝 수용체의 특정 지표에 도달해야만 다양한 맥상을 정확하게 구분해낼 수 있다. 20세기 50년대 중반 중국의 한의학, 동서양 의학 및 생명공학 분야의 과학자들이 먼저 한의학 맥상의 객관적인 [0011]연구를 주도했으며, 그후, 일본과 한국, 미국 등의 관계자들도 이 작업에 참여했다. 전반적으로 맥진의 객관화연구의 핵심은 맥상 감지 센서의 연구이다. 전통 맥박 감지 방법은 손가락 촉진으로 주관적 요소를 배제할 수가 없고, 객관적 기록과 정확한 분석이 쉽지 [0012]않으며, 계승과 혁신도 어려워 그 응용 및 대중화에 큰 한계가 있다. 센서를 사용한 맥박 감지는 맥박의 주요공개실용신안 20-2019-0002497-5-정보를 객관적으로 얻을 수 있고 맥박파 신호를 기록할 수 있으며, 저장과 분석에도 용이하고 인체에 해를 끼치지 않고 사용이 편리하기 때문에, 실제로 광범위하게 응용되고 있다. 맥상 감지 센서는 1860년 Vierordt가 첫 번째 레버식 맥박 기록기를 개발한 후, 국내외 한의학 맥박 계측기 방 [0013]면의 연구가 빠르게 발전되었다. 특히 70년대 중반 국내 티엔진, 상하이, 궤이저우, 장시 등에서 학제적 맥상공동 연구팀이 잇달아 세워졌고, 여러 분야의 공동 연구가 한의학 맥상 연구 작업을 새로운 단계로 진입시켰다.맥상 감지 센서는 싱글 파트 타입, 3파트 타입, 싱글 포인트 타입, 멀티 포인트 타입, 강성 접촉 타입, 소프트 [0014]접촉 타입, 공압 타입, 실리콘 컵 타입, 액체 수은 타입, 액체 물 타입, 자모 타입 등으로 매우 많다. 맥상 탐침은 주로 스트레인 게이지, 압전 크리스탈, 단결정 실리콘, 감광성 요소, PVDF 압전필름 등으로 구성되며, 그중 싱글 파트 싱글 포인트 스트레인 게이지가 가장 널리 사용되지만, 최근에는 3파트 멀티 포인트 타입 방향으로 발전하고 있다. 그러나 현재 국내외에서 개발된 맥박 센서는 모두 맥박 압력 변동 방면의 정보만 수집할 수있고 기타 다차원 정보를 나타내지는 못한다. 맥진의 객관적 연구에서, 동맥 맥박은 압력 박동의 정보 이외에도 혈관 내강, 혈류 속도, 혈관의 3차원 운동, [0015]즉, 맥상의 위치, 수, 모양, 기운 등의 각종 정보를 포함한다고 밝혔다. 압력 센서 등의 전통적 센서만을 사용해 얻은 맥압 그래프로는 맥상의 구성요소 지수를 완전하고 정량적으로 반영하기는 어렵다 (때로는 멀티 포인트압력 정보를 3차원 이미지로 전환하지만, 수집 포인트가 충분하지 않고 압력 정보의 정확성 문제로 인해, 3차원재구성이 정확하지 않다). 따라서 종래의 맥상 자동 분석 연구 성과를 기반으로 3차원 이미지 획득 기술, 인공지능 기술, 자동화 제어 기술의 충분한 활용은 맥상 이미지 압력, 3차원 동적 등 맥상의 전체 정보 동기화 수집을 구현하고, 한의학 맥진의 객관화 구현에 대한 솔루션을 제공함으로써, 한의학의 계승과 혁신 촉진에 중요한의미를 갖는다. 최근에는 구조 광과 양안 시각 기술에 기반하는 맥상 3차원 정보 획득 방법이 제시되었고 （CN107468222A, [0016]CN1927114A）, 센서 어레이 방법도 사용되었지만, 이러한 방법은 모두 충분한 정확성을 얻을 수 없고, 기술과장치에서도 소형화를 구현하기에 어려우며, 맥상 정보 획득 방면에서도 진정한 의미에서 5차원 정보 동기화 획득을 실현할 수 없기 때문에, 여전히 개선의 여지가 있다.고안의 내용해결하려는 과제본 실용신안은 종래 기술의 단점을 극복하여 정밀하고 정확한 맥상의 동적 3차원 이미지를 신속하게 확립하고, [0017]맥상의 역학적 특징, 시간적 차원, 공간적 차원(5차원)의 미세한 변화를 반영함으로써, 컴퓨터가 복잡한 한의학맥상을 인신할 수 있는 일종의 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보 자동 획득 장치를 제공한다.과제의 해결 수단상기 목적을 달성하기 위해, 본 실용신안은 다음의 기술방안을 채택한다. [0018]3차원 레이저 스캐닝에 기반하는 맥상 5차원 정보 자동 획득 장치는 적어도 3개의 맥상 센서를 포함한다. 각 맥 [0019]상 센서는 모두 고정 쉘, 플렉시블 맥진 터치필름, 레이저 발사 렌즈, 기압 센서, 레이저 수신 렌즈, 흡배기 파이프 및 밀폐 챔버 상부 커버를 포함한다. 상기 플렉시블 맥진 터치필름은 상기 고정 쉘의 하단에 배치되고, 상기 밀폐 챔버 상부 커버는 상기 고정 쉘 내부의 상부에 설치되며, 상기 플렉시블 맥진 터치필름, 상기 밀폐 챔버 상부 커버와 고정 쉘은 밀폐 챔버를 둘러싼다. 상기 흡배기 파이프의 양단은 각각 상기 밀폐 챔버의 내부 및외부와 상통되고, 상기 레이저 발사 렌즈의 발사단과 레이저 수신 렌즈의 수신단은 모두 상기 플렉시블 맥진 터치필름의 내벽을 향하고, 상기 기압 센서의 탐지단은 상기 밀폐 챔버 내에 위치한다. 각 밀폐 챔버 내의 흡배기 파이프는 모두 공압 제어 매커니즘에 연결되고 공압 매커니즘에 의해 독립적으로 제 [0020]어되며, 각 맥상 센서의 상하 이동은 상하 이동 제어 매커니즘에 의해 독립적으로 제어된다. 레이저 수신기와 레이저 발생기를 더 포함하며, 레이저 발생기가 생성하는 스캐닝 레이저는 레이저 발사 렌즈로 [0021]전송되고, 레이저 수신 렌즈가 수신하여 반사하는 레이저는 상기 레이저 수신기로 전송된다. 중앙 제어 유닛을 더 포함하며, 상기 기압 센서, 공압 제어 매커니즘, 상하 이동 제어 매커니즘, 레이저 발생기 [0022]공개실용신안 20-2019-0002497-6-및 레이저 수신기는 모두 중앙 제어 유닛에 연결된다. 상기 중앙 제어 유닛은 컴퓨터 시스템에 연결된다. 더 나아가, 레이저 수신기와 레이저 발생기는 모두 한 개이며, 각 맥상 센서 중의 레이저 수신 렌즈는 모두 광 [0023]섬유를 통해 상기 레이저 수신기에 연결되고, 각 맥상 센서 중의 레이저 발사 렌즈는 모두 광섬유를 통해 상기레이저 발생기에 연결된다. 더 나아가, 상기 플렉시블 맥진 터치필름은 중공의 반구형이다. [0024]더 나아가, 하우징을 더 포함하며, 각 맥상 센서는 모두 상기 하우징의 하부에 배치되고, 각 맥상 센서의 플렉 [0025]시블 맥진 터치필름은 아래쪽으로 상기 하우징의 외부에 노출된다. 상기 공압 제어 매커니즘, 상하 이동 제어매커니즘, 레이저 발생기, 레이저 수신기와 중앙 제어 유닛은 모두 상기 하우징 내에 배치된다. 더 나아가, 상기 공압 제어 매커니즘은 공압 펌프이며, 각 흡배기 파이프는 각각 독립적인 채널을 통해 상기 공 [0026]압 펌프에 연결되고, 상기 공압 펌프는 각 채널의 공기 흡입 및 배출을 독립적으로 조절한다. 더 나아가, 상기 상하 이동 제어 매커니즘은 유압 펌프와 지압 제어기를 포함하며, 각 맥상 센서에는 상기 지압 [0027]제어기가 각각 배치된다. 상기 지압 제어기는 맥상 센서 슬리브, 유압 피스톤, 피스톤 슬리브 및 액체 유입 배출 파이프를 포함하며, 상기 맥상 센서는 상기 맥상 센서 슬리브 내에 설치되고, 상기 유압 피스톤은 상기 피스톤 슬리브 내에 설치되어 상기 맥상 센서의 고정 쉘의 상단에 연결된다. 상기 액체 유입 배출 파이프의 양단은각각 상기 피스톤 슬리브의 내부 및 유압 펌프에 연결된다. 각 액체 유입 배출 파이프는 각각 독립적인 채널을통해 상기 유압 펌프에 연결되고, 유압 펌프는 각 채널의 액체 유입 및 유출을 독립적으로 제어한다. 더 나아가, 진맥 플랫폼을 더 포함하며, 상기 진맥 플랫폼은 주로 팔뚝 받침대와 맥박 계측기 자동 포지셔너로 [0028]구성된다. 상기 맥박 계측기 자동 포지셔너는 카메라, 위치 조정 제어기와 3축 플랫폼을 포함한다. 상기 맥상센서는 상기 3축 플랫폼에 장착되고, 상기 카메라는 인체의 손목 부위 이미지를 획득해서 상기 위치 조정 제어기로 전송하며, 상기 위치 조정 제어기는 3축 플랫폼을 제어하여 맥상 센서의 이동을 조정함으로써 맥상 센서의3축 위치를 결정한다. 고안의 효과본 실용신안의 유익한 효과는 다음과 같다. [0030]1. 전통적 압전 센서 어레이(PVDF 압전필름 등)는 각 센서가 최소 1*1mm이기 때문에, 유연한 반구 내벽에서 패 [0031]턴을 프린트하고 양안 시각이론으로 촬영해 프린트하는 최소 정밀도가 0.5mm이지만(이 정밀도를 초과하면 카메라가 정확하게 촬영할 수 없다), 요골 동맥의 폭은 2mm정도이기 때문에, 그 종래의 두 가지 맥상 3차원 정보를획득하는 방법으로 획득한 데이터는 정확도가 충분하지 않으며, 맥박 횡단면이 수집한 포인트도 2-4개에 불과하기 때문에, 3차원 모델을 기본적으로 재구성할 수 없고, 맥의 형태학적 특징을 정확하게 반영할 수 없다 (한의학 28종 병맥의 차이는 극도로 미묘하다). 본 실용신안은 레이저 스캐닝 기술을 사용하여 레이저 발생기가 생성하는 스캐닝 레이저를 플렉시블 맥진 터치필름으로 조사하며, 맥박이 변동하면 플렉시블 맥진 터치필름이 맥박변동을 따라 변형하고, 플렉시블 맥진 터치필름의 내벽 맥박 위치가 다른 정도로 솟아남에 따라서, 레이저의 반사 시간이 변경되고, 레이저 수신기 중의 포토다이오드가 반사광 신호를 수신하면, 반사되어 온 시간의 차이에근거하여 컴퓨터 시스템의 처리를 거쳐, 시간의 변화에 따른 맥박의 3차원 이미지 시퀀스를 형성할 수 있다. 그방법의 평면 공간 분해능은 0.006mm, 깊이 분해능은 0.15μm에 달하며 (맥박의 횡단면 수집 포인트의 수는 최대333개이다), 스캐닝 속도는 200000 Hz이므로 구성되는 맥상 동적 3차원 이미지가 정밀하고 정확하기 때문에, 시간 차원과 공간 차원의 미묘한 맥상 변화를 반영할 수 있어서 컴퓨터가 복잡한 한의학 맥상을 인식할 수 있다. 2. 진맥에서는 3부9후, 즉 촌, 관, 척 3부와, 각 부를 각각 약, 중, 강의 지력으로 맥을 눌러서(3후) 부, 중, [0032]침으로 나누면, 3 곱하기 3으로 9후 정보를 얻을 수 있고（《난경·18난》）, 다시 서로 간의 비교를 더한다.완전한 진맥 지법은 다음을 포함한다. 한 부위를 약, 중, 강으로 누르고, 기타 두 개 부위는 각각 약, 중, 강의세기를 매치시키면, 즉 한 측이 3*3*3으로 총 27종의 지법이 되며, 양측이면 총 54개의 지법이 된다. 따라서 맥진의 객관화 장치는 반드시 3부 진맥을 나누어 해결해서 각 부가 약, 중, 강 지력으로 맥을 누를 수 있어야 한다. 본 실용신안은 3개 맥상 센서의 위치를 독립적으로 제어 조정함으로써, 맥진의 약중강 진맥 수법을 시뮬레이션 [0033]하고, 동시에 각 밀폐 챔버 내의 공압을 독립적으로 조정함으로써, 플렉시블 맥진 터치필름의 맥박 부위를 맥박공개실용신안 20-2019-0002497-7-을 따라 가장 뚜렷하게 변형시켜서, 3부9후의 맥진 수법을 동시에 구현하고, 보다 포괄적인 정보를 획득한다. 3. 맥상의 동역학적 특징과 형태학적 특징을 동시에 획득한다. 기압 센서를 밀폐 챔버 내에 배치하여 맥압을 직 [0034]접 측정하고, 맥상 3차원 정보와 기압 데이터를 동시에 획득하고 동시에 전송함으로써, 맥상 5차원 정보(시간정보, 기압 정보, 3차원 이미지 정보)를 동시에 획득하여 맥상 정보의 포괄성과 정확성을 확보한다. 4. 이미지 인식 기술을 결합시켜 맥상 센서의 자동 위치 결정을 구현하고, 나아가 맥진의 자동화 정도를 향상시 [0035]킨다. 5. 광섬유 전송 기술을 사용하여 센서의 소형화 문제를 해결하고, 동시에 광섬유 전송을 통해 스캐닝 레이저와 [0036]반사 레이저의 전송 거리를 연장시키고, 높은 정밀도의 신속한 스캐닝의 구현을 보장하며, 레이저 3차원 스캐닝거리가 지나치게 작아서 실현될 수 없는 문제를 해결한다.도면의 간단한 설명도 1은 본 실용신안 실시예의 전체 구조 결선도, [0037]도 2는 도 1 중 맥상 센서의 구조 결선도, 도 3은 도 1 중 지압 제어기의 구조 결선도, 도 4는 본 실용신안 실시예 중 진맥 플랫폼의 구조 결선도, 도 5는 맥박 변동이 없을 때 레이저 스캐닝에 기반하여 플렉시블 맥진 터치필름이 얻은 3차원 이미지, 도 6은 맥박 변동이 있을 때 레이저 3차원 스캐닝에 기반하여 얻은 맥상 3차원 이미지이다.고안을 실시하기 위한 구체적인 내용아래는 도면을 결합시킨 본 실용신안에 대한 구체적 설명이다. 설명이 필요한 점은, 아래 실시예는 본 기술방안 [0038]을 전제로 상세한 실시방식과 구체적 조작 과정을 제시하지만, 본 실용신안의 보호 범위는 본 실시예에 국한되지 않는다.도 1-4와 같이, 레이저 3차원 스캐닝을 기반으로 하는 맥상 5차원 정보 자동 획득 장치가 포함하는 3개의 맥상 [0039]센서 1은 각각 척맥과 관맥, 촌맥의 맥상 정보를 획득한다. 각 맥상 센서 1은 고정 쉘 11, 플렉시블 맥진 터치필름 12, 레이저 발사 렌즈 13, 기압 센서 14, 레이저 수신 [0040]렌즈 15, 흡배기 파이프 16과 밀폐 챔버 상부 커버 17을 포함한다. 상기 플렉시블 맥진 터치필름 12는 상기 고정 쉘 11의 하단에 배치되고, 상기 밀폐 챔버 상부 커버 17은 상기 고정 쉘 11 내부의 상부에 배치되며, 상기플렉시블 맥진 터치필름 12, 상기 밀폐 챔버 상부 커버 17과 고정 쉘 11은 밀폐 챔버 18을 둘러싼다. 상기 흡배기 파이프 16의 양단은 각각 상기 밀폐 챔버 18의 내부 및 외부와 상통되고, 상기 레이저 발사 렌즈 13의 발사단과 레이저 수신 렌즈 15의 수신단은 모두 상기 플렉시블 맥진 터치필름 12의 내벽을 향하며, 상기 기압 센서14의 탐지단은 상기 밀폐 챔버 18 내에 배치된다. 본 실시예 중에서, 상기 레이저 수신 렌즈 15, 레이저 발사 렌즈 13, 흡배기 파이프 16과 기압 센서 14는 모두 [0041]상기 밀폐 챔버 상부 커버 17에 고정된다. 각 밀폐 챔버 18 내의 흡배기 파이프 16은 모두 공압 제어 매커니즘에 연결되고 공압 매커니즘에 의해 독립적으 [0042]로 제어되며, 각 맥상 센서 1의 상하 이동은 상하 이동 제어 매커니즘에 의해 독립적으로 제어된다. 레이저 수신기 2와 레이저 발생기 3을 더 포함하며, 레이저 발생기 3이 생성하는 스캐닝 레이저는 레이저 발사 [0043]렌즈 13으로 전송되고, 레이저 수신 렌즈 15가 수신하여 반사하는 레이저는 상기 레이저 수신기 2로 전송된다. 본 실시예 중에서, 레이저 수신기 2와 레이저 발생기 3은 모두 한 개이며, 각 맥상 센서 1 중의 레이저 수신 렌 [0044]즈 15는 모두 광섬유를 통해 상기 레이저 수신기 2에 연결되고, 각 맥상 센서 1 중의 레이저 발사 렌즈 13은 모두 광섬유를 통해 상기 레이저 발생기 3에 연결된다. 레이저 발생기 3이 생성하는 스캐닝 레이저는 광섬유를 통해 3개의 레이저 발사 렌즈 13으로 동시에 전송되고, 3개의 레이저 수신 렌즈 15가 획득한 반사 레이저는 동일한 레이저 수신기 2로 진입하여 촌, 관, 척맥을 동시에 한 장의 사진으로 찍는다. 중앙 제어 유닛 4를 더 포함하며, 상기 공압 제어 매커니즘, 상하 이동 제어 매커니즘, 레이저 발생기 3, 레이 [0045]저 수신기 2 및 각 맥진 센서 중의 기압 센서 14는 모두 중앙 제어 유닛 4에 연결된다. 상기 중앙 제어 유닛 4공개실용신안 20-2019-0002497-8-는 컴퓨터 시스템에 연결된다. 더 나아가, 상기 플렉시블 맥진 터치필름 12는 중공의 반구형이다. 유연한 소재로 만들어진 중공의 반구형인 플 [0046]렉시블 맥진 터치필름으로, 외형은 손가락 촉맥의 모양과 매우 비슷하다. 더 나아가, 하우징 5를 더 포함하며, 3개의 맥상 센서 1은 모두 상기 하우징 5의 하부에 배치되고, 각 맥상 센 [0047]서 1의 플렉시블 맥진 터치필름 12는 아래쪽으로 상기 하우징 5의 외부에 노출된다. 상기 공압 제어 매커니즘,상하 이동 제어 매커니즘, 레이저 발생기 3, 레이저 수신기 2와 중앙 제어 유닛 4는 모두 상기 하우징 5 내에배치된다. 더 나아가, 상기 공압 제어 매커니즘은 공압 펌프 6이며, 각 흡배기 파이프 16은 각각 독립적인 채널을 통해 상 [0048]기 공압 펌프 6에 연결되고, 상기 공압 펌프 6은 3개 채널의 공기 흡입 및 배출을 독립적으로 조절한다. 더 나아가, 상기 상하 이동 제어 매커니즘은 유압 펌프 7과 지압 제어기 8을 포함하며, 각 맥상 센서 1에는 각 [0049]각 상기 지압 제어기 8이 배치된다. 상기 지압 제어기 8은 맥상 센서 슬리브 81, 유압 피스톤 82, 피스톤 슬리브 83 및 액체 유입 배출 파이프 84를 포함하며, 상기 맥상 센서 1은 상기 맥상 센서 슬리브 81 내에 설치되고,상기 유압 피스톤 82는 상기 피스톤 슬리브 83 내에 설치되어 상기 맥상 센서 1의 고정 쉘 11의 상단에 연결된다. 상기 액체 유입 배출 파이프 84의 양단은 각각 상기 피스톤 슬리브 83의 내부 및 유압 펌프 7과 연결된다.3개의 액체 유입 배출 파이프 84는 각각 3개의 채널을 통해 상기 유압 펌프 7에 독립적으로 연결되고, 유압 펌프 7은 3개 채널의 액체 유입 및 유출을 독립적으로 제어한다. 더 나아가, 진맥 플랫폼을 더 포함하며, 상기 진맥 플랫폼은 주로 팔뚝 받침대 9와 맥박 계측기 자동 포지셔너 [0050]로 구성된다. 상기 맥박 계측기 자동 포지셔너는 카메라(도면 미표시), 위치 조정 제어기(도면 미표시)와 3축플랫폼 10을 포함한다. 상기 맥상 센서는 상기 3축 플랫폼에 장착되고 (본 실시예 중에서, 구체적으로 하우징 5는 3축 플랫폼에 고정된다), 상기 카메라는 인체의 손목 부위 이미지를 획득해서 상기 위치 조정 제어기로 전송하며, 상기 위치 조정 제어기는 3축 플랫폼을 제어하여 맥상 센서기의 이동을 조정함으로써 맥상 센서의 3축 위치를 결정한다. 상기 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보 자동 획득 장치를 이용하여 맥상 정보를 획득하는 방법 [0051]은 아래의 단계를 포함한다. S1, 3개 맥상 센서를 인체 팔목의 촌, 관, 척맥의 위치로 자동 조정한다. [0052]S2, 중앙 제어기가 공압 제어 매커니즘, 상하 이동 제어 매커니즘, 레이저 수신기와 레이저 발생기를 제어하고, [0053]기압 센서와 레이저 수신기로부터의 데이터를 수신하며, 그중, 상기 공압 제어 매커니즘은 3개 맥상 센서의 밀폐 챔버 내의 압력을 촌, 관, 척맥의 약중강 지법에 맞도록 목표 [0054]값으로 각각 조절하고, 플렉시블 진맥 터치필름의 장력을 조정한다. 상기 상하 이동 제어 매커니즘은 3개 맥진 센서의 상하 이동을 각각 제어하여 촌, 관, 척맥의 약중강 지법을 조 [0055]정한다. 상기 레이저 발생기가 생성하는 스캐닝 레이저는 광섬유를 거쳐 3개 맥진 센서의 레이저 발사 렌즈로 동시에 전 [0056]송되고, 레이저는 상기 플렉시블 맥진 터치필름의 내벽에 스캐닝되어 플렉시블 맥진 터치필름의 내벽에 반사된후, 레이저 수신 렌즈에 의해 수신되어 상기 레이저 수신기로 동시에 전송되고, 레이저 수신기 중의 포토다이오드가 반사광 신호를 수신한다. 레이저 수신기가 획득하는 반사광 신호는 기압 센서가 실시간 측정하는 밀폐 챔버 내의 압력 데이터와 동시에 [0057]중앙 제어기로 전송되고, 중앙 제어기가 컴퓨터 시스템에 동시에 전송한다. S3, 맥박이 변동하면, 플렉시블 맥진 터치필름은 맥박을 따라 변형하고, 플렉시블 맥진 터치필름의 내벽 맥박 [0058]위치가 다른 정도로 솟아남에 따라서, 레이저의 반사 시간이 변경되고, 레이저 수신기 중의 포토다이오드가 반사광 신호를 수신하면, 반사되어 온 시간의 차이에 근거하여 컴퓨터 시스템의 처리를 거쳐, 시간의 변화에 따른맥박의 3차원 이미지 시퀀스를 형성한 후, 컴퓨터 시스템이 시간점에 대응하는 압력 데이터를 결합시켜 시간 정보와 압력 정보, 3차원 이미지 정보를 포함하는 맥상의 5차원 정보 데이터를 형성하고, 맥상 정보에 대한 인식과 분석을 진행한다. 도 5는 맥박 변동이 없을 때 레이저 스캐닝에 기반하여 플렉시블 맥진 터치필름이 얻은 3차원 이미지이고, 도 6 [0059]은 맥박 변동이 있을 때 레이저 3차원 스캐닝에 기반하여 얻은 맥상 3차원 이미지이다. 공개실용신안 20-2019-0002497-9-설명이 필요한 점은, 단계 S1 중에서, 환자가 손목을 맥진 플랫폼의 팔뚝 받침대에 올려놓으면, 위치 조정 제어 [0060]기가 맥박 계측기 자동 포지셔너의 카메라를 제어하여 손목의 사진을 찍고, 위치 조정 제어기가 손목의 사진에대한 인식을 진행한 후, 촌, 관, 척맥 위치를 결정하며, 3축 플랫폼을 제어하여 3개 맥상 센서를 손목의 촌,관, 척맥 위치로 자동 이동시킨다. 맥상 센서의 플렉시블 맥진 터치필름이 피부에 닿으면, 밀폐 챔버 내의 압력이 변하고, 기압 센서가 실시간으로 측정한 압력 데이터를 중앙 제어기로 전송하면, 중앙 제어기가 컴퓨터 시스템으로 전송하며, 밀폐 챔버 압력의 변동(즉, 맥박의 변동)이 감지되면, 위치 결정이 완료된다. 구체적으로, 컴퓨터 시스템이 손목의 사진을 통해 노뼈 경상돌기(styloid process of radius) 위치를 인식하여 [0061]관맥의 위치를 결정함에 따라, 한의학 경전의 \"손바닥 고골은 관의 위이고, 관의 앞은 양, 관의 뒤는 음이며,양촌음척을 순차적으로 찾는” 진맥 위치 결정 방법에 의거하여 진맥 위치를 정확하게 결정할 수 있다.설명이 필요한 점은, 단계 S2 중에서, 상기 상하 이동 제어 매커니즘이 3개 맥진 센서를 상하로 이동시키는 구 [0062]체적 과정은 다음과 같다. 유압 펌프가 각 피스톤 슬리브 내부의 액체 유입이나 액체 배출량을 제어함으로써, 유압 피스톤을 상하로 이동 [0063]시킴에 따라, 상기 유압 피스톤과 연결된 맥상 센서가 맥상 센서 슬리브 내에서 상하로 이동하면서 맥진 3개 손가락의 약, 중, 강 지법, 및 3가지 지법의 다양한 조합을 시뮬레이션 한다. 본 영역의 기술자는 위의 기술방안과 구상에 근거하여 각종 상응하는 변경과 변형이 가능하며, 이러한 모든 변 [0064]경과 변형은 모두 본 실용신안의 청구 보호 범위 내에 포함되어야 한다. 도면도면1공개실용신안 20-2019-0002497-10-도면2도면3공개실용신안 20-2019-0002497-11-도면4도면5공개실용신안 20-2019-0002497-12-도면6공개실용신안 20-2019-0002497-13-"}
{"patent_id": "20-2018-0003173", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 실용신안에서 공개하는 일종의 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보 자동 획득 장비는 자동 맥진 포지셔너, 맥박 계측기와 컴퓨터를 포함한다. 맥박 계측기는 맥상 센서, 지압 제어기, 레이저 발생기, 레이저 수 신기, 중앙 제어 유닛 등을 포함한다. 맥상 센서는 플렉시블 맥진 터치필름, 압력 센서, 레이저 발사 렌즈와 레 (뒷면에 계속)"}
{"patent_id": "20-2018-0003173", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 실용신안은 한의학 맥진 자동화 기술 영역에 관련된 것이며, 구체적으로 일종의 레이저 3차원 스캐닝에 기반 하는 맥상 5차원 정보 자동 획득 장치에 관한 것이다."}
{"patent_id": "20-2018-0003173", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "한의학의 맥상은 한의학 4가지 진단법의 중요한 내용인 풍부한 생물학적 정보를 포함한다. 맥동은 맥상이라 부 르는 (손가락)의 형상을 말하고, 맥박의 형상과 움직임을 가리킨다. 맥상의 형성은 내장 및 기혈과 밀접한 관계 가 있다. 진나라 왕숙화는 《맥경》에서 맥상을 24가지로 집대성하였다. 명나라의 이시진은 《빈호맥학》에서 27맥으로 정의하였고, 명나라 이사재는 《진가정안》에서 질병맥을 추가하여 총 28종 맥상으로 정의하였으며, 후세에서는 대부분 28맥을 사용하고 있다. 맥상 요소는 위치, 수, 모양, 기운 등 4개 방면을 포함하는 맥상의 기본 구성 부분을 말한다. 인공 맥상은 주로 손가락의 감각에 의존하여 인식된다. 맥상의 종류는 매우 많은데, 한의학 문헌에서는 보통 위치, 수, 모양, 기 운 등 4개 방면부터 분석 귀납하며, 맥박의 빈도, 리듬, 나타나는 부위, 길이, 폭, 맥관의 부종, 긴장도, 원활 한 혈류의 흐름, 심장 박동의 강약 등 요소와 관련된다. 맥상 요소를 파악하면, 각종 맥상의 특징 및 형성 매커 니즘에 대해 간단하게 이해할 수 있다. 맥의 위치 : 맥박이 나타나는 부위와 길이를 말한다. 진맥할 때마다 맥박이 나타나는 부위의 깊이, 길이를 진단 해야 한다. 정상 맥박의 부위는 떠오르거나 가라앉지 않는 중간에서 얻을 수 있고, 촌, 관, 척의 3 부위에서 맥공개실용신안 20-2019-0002497 -4-을 느낄 수 있다. 만약 맥의 위치가 얕으면 부맥이고, 맥의 위치가 깊게 가라앉아 있으면 침맥 등이다. 맥박이 촌, 관, 척 3개 부위를 초과하면 장맥이고, 맥박의 움직임이 촌, 척에 미치지 못하면 단맥이다. 맥의 수 : 맥박이 뛰는 수와 리듬을 말한다. 진맥할 때마다 맥박의 속도와 리듬이 규칙적인지 여부를 진단해야 한다. 정상적 성인의 맥박 빈도는 분당 70-90회이고 리듬이 일정하며 멎지 않는다. 예를 들어 호흡 한 번에 5번 이상이면 속맥이고, 4회 미만이면 지맥이다. 맥박이 멎는 경우는 부정맥, 결맥, 대맥 등 다양하다. 맥박의 리듬 이 뷸규칙한 경우는 산맥, 삽맥 등이 있다. 맥의 모양 : 맥박이 뛰는 폭 등의 형태를 말한다. 진맥할 때마다 맥박의 크기, 부드러움 등의 형태를 진단해야 한다, 맥의 모양은 주로 맥관의 부종, 맥박의 변동 폭 등의 요소와 관계가 있다. 맥관이 비교적 부종되어 있고 맥박의 폭이 비교적 크면 홍맥이고, 맥관의 부종이 적고 박동 폭이 비교적 작으면 세맥이며, 맥관의 탄력과 부 드러움이 부족하면 현맥이고, 맥이 연하고 부드러우나 힘이 없으면 유맥, 완맥 등이다. 맥의 기운 : 맥박의 강도, 부드러움 등의 동향을 말한다. 맥의 기운은 맥박이 뛰는 축방향과 반경방향의 강도, 심장과 저항력 영향으로 발생하는 부드러움, 혈관 탄력과 장력 영향으로 발생하는 긴장도 등과 같은 여러가지 요인을 포함한다. 진맥할 때마다 맥박의 강도 및 부드러움 정도를 진단해야 한다. 정상적 맥상은 완만하고 부드 러우며, 적당한 강도가 있어야 한다. 맥에 힘이 있으면 실맥이고, 힘이 없으면 허맥이다. 맥의 상태가 막힘 없 이 비교적 좋고 매끄럽게 흐르면 활맥이고, 맥의 왕래가 매끄럽지 않으면 삽맥 등이다. 상기 내용은 맥상을 구성하는 기본 요소이며, 맥상 진단을 위한 기본 요소이기도 하다. 맥상의 인식은 주로 의 사 손가락의 감각에 달려 있기 때문에, 진맥하는 의사는 반드시 손가락 감각을 반복 연습하고 세심하게 살펴서 각종 맥상 요소를 종합 분석해야만, 비교적 완벽한 맥상을 획득할 수 있고, 각종 병맥을 정확하게 구별할 수 있 다. 맥진은 인간의 손가락 끝의 촉각 기능에 달려 있다. 인간의 피부는 촉각, 통각, 열각 등 여러가지 감각을 감지 할 수 있으며, 그중 촉각의 감지는 특히 중요하다. 인간의 촉각은 주로 다양한 깊이의 피부에 분포된 대량의 기 계적 자극 수용체 중의 4가지 촉각 수용체를 통해 감지한다. 표피 피부 중의 마이스너 소체와 피부 심층의 파시 니 소체는 모두 신속한 적응 수용체이며, 전자는 3~40Hz 저주파 동적 범위의 외부 자극에 신속하게 반응함으로 써, 저주파 진동과 운동 감지 및 악력 제어 등의 기능을 구현한다. 후자는 40~500+Hz 고주파 동적 범위의 외부 자극에 신속하게 반응하여 고주파 진동과 도구 사용 등의 감각 기능을 구현한다. 이와 대조적으로, 전신의 표피 기저세포 사이에 분포하고 일종의 지상돌기를 지닌 메르켈 세포 및 진피 내에 있는 긴 방추형의 루피니 소체는 느린 적응 수용체로서, 전자는 0.4~3.0Hz 저주파 동적 범위의 공간 변형, 지속적 압력, 곡면, 가장자리 또는 예 리한 모서리 등의 외부 자극에 천천히 반응함으로써, 모드/형태 감지 및 텍스처 감지 등의 감각 기능을 구현하 고, 후자는 100~500+Hz 고주파 동적 범위의 지속적 하향 압력, 횡 방향 피부 스트레칭과 피부 미끄러짐 등의 외 부 자극에 서서히 반응함으로써, 손가락 위치, 안정적인 잡기, 접선력 및 운동 방향 등의 감각 기능을 구현한다. 촉각 감지의 특징에 따라 촉각을 슬라이딩 촉각과 유연 촉각 두 가지로 나눌 수 있다. 슬라이딩 촉각 은 손가락 접촉면에 평행하는 감지로서, 주로 물체 표면의 기하학적 모양, 질감, 온도 등을 반영하며, 유연 촉 각은 손가락 접촉면 방향에 수직하는 동적 감지로서, 주로 물체의 유연성 또는 강도를 반영한다. 인체 각 부위 의 촉각 수용체 분포 밀도는 차이가 크다. 성인의 손가락 끝과 손바닥에는 각각 241과 58 cm2 촉각 수용체가 분 포하므로, 인체 각 부위의 공간 분해능 차이는 매우 뚜렷하다. 손가락 끝의 공간 분해능은 깊이 지각이 0.2mm이 고, 두 점의 간격은 0.5mm이며, 서로 다른 위치의 두 가지 사건의 임계 촉감 반응 시간은 30~50ms 레벨이다. 제 어 가능한 압력 민감도 연구에 따르면, 남성 손바닥과 손가락 끝의 정상 압력 임계값 평균은 각각 0.158g과 0.055g이고, 여성의 해당 임계값은 각각 0.032g과 0.019g이라고 밝혔다. 한의학의 맥진은 한의사의 손가락 끝 감각에 근거한다. 인류의 손가락 끝은 수용체의 밀도가 가장 높기 때문에, 한의사의 맥진을 통해 풍부하고 정확도가 높은 정보를 얻을 수 있다. 한의학의 객관적인 맥진을 구현하기 위해, 센서는 맥진 정보 획득 방면에서 인류 손가락 끝 수용체의 특정 지표에 도달해야만 다양한 맥상을 정확하게 구 분해낼 수 있다. 20세기 50년대 중반 중국의 한의학, 동서양 의학 및 생명공학 분야의 과학자들이 먼저 한의학 맥상의 객관적인 연구를 주도했으며, 그후, 일본과 한국, 미국 등의 관계자들도 이 작업에 참여했다. 전반적으로 맥진의 객관화 연구의 핵심은 맥상 감지 센서의 연구이다. 전통 맥박 감지 방법은 손가락 촉진으로 주관적 요소를 배제할 수가 없고, 객관적 기록과 정확한 분석이 쉽지 않으며, 계승과 혁신도 어려워 그 응용 및 대중화에 큰 한계가 있다. 센서를 사용한 맥박 감지는 맥박의 주요공개실용신안 20-2019-0002497 -5-정보를 객관적으로 얻을 수 있고 맥박파 신호를 기록할 수 있으며, 저장과 분석에도 용이하고 인체에 해를 끼치 지 않고 사용이 편리하기 때문에, 실제로 광범위하게 응용되고 있다. 맥상 감지 센서는 1860년 Vierordt가 첫 번째 레버식 맥박 기록기를 개발한 후, 국내외 한의학 맥박 계측기 방 면의 연구가 빠르게 발전되었다. 특히 70년대 중반 국내 티엔진, 상하이, 궤이저우, 장시 등에서 학제적 맥상 공동 연구팀이 잇달아 세워졌고, 여러 분야의 공동 연구가 한의학 맥상 연구 작업을 새로운 단계로 진입시켰다. 맥상 감지 센서는 싱글 파트 타입, 3파트 타입, 싱글 포인트 타입, 멀티 포인트 타입, 강성 접촉 타입, 소프트 접촉 타입, 공압 타입, 실리콘 컵 타입, 액체 수은 타입, 액체 물 타입, 자모 타입 등으로 매우 많다. 맥상 탐 침은 주로 스트레인 게이지, 압전 크리스탈, 단결정 실리콘, 감광성 요소, PVDF 압전필름 등으로 구성되며, 그 중 싱글 파트 싱글 포인트 스트레인 게이지가 가장 널리 사용되지만, 최근에는 3파트 멀티 포인트 타입 방향으 로 발전하고 있다. 그러나 현재 국내외에서 개발된 맥박 센서는 모두 맥박 압력 변동 방면의 정보만 수집할 수 있고 기타 다차원 정보를 나타내지는 못한다. 맥진의 객관적 연구에서, 동맥 맥박은 압력 박동의 정보 이외에도 혈관 내강, 혈류 속도, 혈관의 3차원 운동, 즉, 맥상의 위치, 수, 모양, 기운 등의 각종 정보를 포함한다고 밝혔다. 압력 센서 등의 전통적 센서만을 사용 해 얻은 맥압 그래프로는 맥상의 구성요소 지수를 완전하고 정량적으로 반영하기는 어렵다 (때로는 멀티 포인트 압력 정보를 3차원 이미지로 전환하지만, 수집 포인트가 충분하지 않고 압력 정보의 정확성 문제로 인해, 3차원 재구성이 정확하지 않다). 따라서 종래의 맥상 자동 분석 연구 성과를 기반으로 3차원 이미지 획득 기술, 인공 지능 기술, 자동화 제어 기술의 충분한 활용은 맥상 이미지 압력, 3차원 동적 등 맥상의 전체 정보 동기화 수집 을 구현하고, 한의학 맥진의 객관화 구현에 대한 솔루션을 제공함으로써, 한의학의 계승과 혁신 촉진에 중요한 의미를 갖는다. 최근에는 구조 광과 양안 시각 기술에 기반하는 맥상 3차원 정보 획득 방법이 제시되었고 （CN107468222A, CN1927114A）, 센서 어레이 방법도 사용되었지만, 이러한 방법은 모두 충분한 정확성을 얻을 수 없고, 기술과 장치에서도 소형화를 구현하기에 어려우며, 맥상 정보 획득 방면에서도 진정한 의미에서 5차원 정보 동기화 획 득을 실현할 수 없기 때문에, 여전히 개선의 여지가 있다. 고안의 내용"}
{"patent_id": "20-2018-0003173", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 실용신안은 종래 기술의 단점을 극복하여 정밀하고 정확한 맥상의 동적 3차원 이미지를 신속하게 확립하고, 맥상의 역학적 특징, 시간적 차원, 공간적 차원(5차원)의 미세한 변화를 반영함으로써, 컴퓨터가 복잡한 한의학 맥상을 인신할 수 있는 일종의 레이저 3차원 스캐닝에 기반하는 맥상 5차원 정보 자동 획득 장치를 제공한다."}
{"patent_id": "20-2018-0003173", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위해, 본 실용신안은 다음의 기술방안을 채택한다. 3차원 레이저 스캐닝에 기반하는 맥상 5차원 정보 자동 획득 장치는 적어도 3개의 맥상 센서를 포함한다. 각 맥 상 센서는 모두 고정 쉘, 플렉시블 맥진 터치필름, 레이저 발사 렌즈, 기압 센서, 레이저 수신 렌즈, 흡배기 파 이프 및 밀폐 챔버 상부 커버를 포함한다. 상기 플렉시블 맥진 터치필름은 상기 고정 쉘의 하단에 배치되고, 상 기 밀폐 챔버 상부 커버는 상기 고정 쉘 내부의 상부에 설치되며, 상기 플렉시블 맥진 터치필름, 상기 밀폐 챔 버 상부 커버와 고정 쉘은 밀폐 챔버를 둘러싼다. 상기 흡배기 파이프의 양단은 각각 상기 밀폐 챔버의 내부 및 외부와 상통되고, 상기 레이저 발사 렌즈의 발사단과 레이저 수신 렌즈의 수신단은 모두 상기 플렉시블 맥진 터 치필름의 내벽을 향하고, 상기 기압 센서의 탐지단은 상기 밀폐 챔버 내에 위치한다. 각 밀폐 챔버 내의 흡배기 파이프는 모두 공압 제어 매커니즘에 연결되고 공압 매커니즘에 의해 독립적으로 제 어되며, 각 맥상 센서의 상하 이동은 상하 이동 제어 매커니즘에 의해 독립적으로 제어된다. 레이저 수신기와 레이저 발생기를 더 포함하며, 레이저 발생기가 생성하는 스캐닝 레이저는 레이저 발사 렌즈로 전송되고, 레이저 수신 렌즈가 수신하여 반사하는 레이저는 상기 레이저 수신기로 전송된다. 중앙 제어 유닛을 더 포함하며, 상기 기압 센서, 공압 제어 매커니즘, 상하 이동 제어 매커니즘, 레이저 발생기 공개실용신안 20-2019-0002497 -6-및 레이저 수신기는 모두 중앙 제어 유닛에 연결된다. 상기 중앙 제어 유닛은 컴퓨터 시스템에 연결된다. 더 나아가, 레이저 수신기와 레이저 발생기는 모두 한 개이며, 각 맥상 센서 중의 레이저 수신 렌즈는 모두 광 섬유를 통해 상기 레이저 수신기에 연결되고, 각 맥상 센서 중의 레이저 발사 렌즈는 모두 광섬유를 통해 상기 레이저 발생기에 연결된다. 더 나아가, 상기 플렉시블 맥진 터치필름은 중공의 반구형이다. 더 나아가, 하우징을 더 포함하며, 각 맥상 센서는 모두 상기 하우징의 하부에 배치되고, 각 맥상 센서의 플렉 시블 맥진 터치필름은 아래쪽으로 상기 하우징의 외부에 노출된다. 상기 공압 제어 매커니즘, 상하 이동 제어 매커니즘, 레이저 발생기, 레이저 수신기와 중앙 제어 유닛은 모두 상기 하우징 내에 배치된다. 더 나아가, 상기 공압 제어 매커니즘은 공압 펌프이며, 각 흡배기 파이프는 각각 독립적인 채널을 통해 상기 공 압 펌프에 연결되고, 상기 공압 펌프는 각 채널의 공기 흡입 및 배출을 독립적으로 조절한다. 더 나아가, 상기 상하 이동 제어 매커니즘은 유압 펌프와 지압 제어기를 포함하며, 각 맥상 센서에는 상기 지압 제어기가 각각 배치된다. 상기 지압 제어기는 맥상 센서 슬리브, 유압 피스톤, 피스톤 슬리브 및 액체 유입 배 출 파이프를 포함하며, 상기 맥상 센서는 상기 맥상 센서 슬리브 내에 설치되고, 상기 유압 피스톤은 상기 피스 톤 슬리브 내에 설치되어 상기 맥상 센서의 고정 쉘의 상단에 연결된다. 상기 액체 유입 배출 파이프의 양단은 각각 상기 피스톤 슬리브의 내부 및 유압 펌프에 연결된다. 각 액체 유입 배출 파이프는 각각 독립적인 채널을 통해 상기 유압 펌프에 연결되고, 유압 펌프는 각 채널의 액체 유입 및 유출을 독립적으로 제어한다. 더 나아가, 진맥 플랫폼을 더 포함하며, 상기 진맥 플랫폼은 주로 팔뚝 받침대와 맥박 계측기 자동 포지셔너로 구성된다. 상기 맥박 계측기 자동 포지셔너는 카메라, 위치 조정 제어기와 3축 플랫폼을 포함한다. 상기 맥상 센서는 상기 3축 플랫폼에 장착되고, 상기 카메라는 인체의 손목 부위 이미지를 획득해서 상기 위치 조정 제어 기로 전송하며, 상기 위치 조정 제어기는 3축 플랫폼을 제어하여 맥상 센서의 이동을 조정함으로써 맥상 센서의 3축 위치를 결정한다. 고안의 효과 본 실용신안의 유익한 효과는 다음과 같다. 1. 전통적 압전 센서 어레이(PVDF 압전필름 등)는 각 센서가 최소 1*1mm이기 때문에, 유연한 반구 내벽에서 패 턴을 프린트하고 양안 시각이론으로 촬영해 프린트하는 최소 정밀도가 0.5mm이지만(이 정밀도를 초과하면 카메 라가 정확하게 촬영할 수 없다), 요골 동맥의 폭은 2mm정도이기 때문에, 그 종래의 두 가지 맥상 3차원 정보를 획득하는 방법으로 획득한 데이터는 정확도가 충분하지 않으며, 맥박 횡단면이 수집한 포인트도 2-4개에 불과하 기 때문에, 3차원 모델을 기본적으로 재구성할 수 없고, 맥의 형태학적 특징을 정확하게 반영할 수 없다 (한의 학 28종 병맥의 차이는 극도로 미묘하다). 본 실용신안은 레이저 스캐닝 기술을 사용하여 레이저 발생기가 생성 하는 스캐닝 레이저를 플렉시블 맥진 터치필름으로 조사하며, 맥박이 변동하면 플렉시블 맥진 터치필름이 맥박 변동을 따라 변형하고, 플렉시블 맥진 터치필름의 내벽 맥박 위치가 다른 정도로 솟아남에 따라서, 레이저의 반 사 시간이 변경되고, 레이저 수신기 중의 포토다이오드가 반사광 신호를 수신하면, 반사되어 온 시간의 차이에 근거하여 컴퓨터 시스템의 처리를 거쳐, 시간의 변화에 따른 맥박의 3차원 이미지 시퀀스를 형성할 수 있다. 그 방법의 평면 공간 분해능은 0.006mm, 깊이 분해능은 0.15μm에 달하며 (맥박의 횡단면 수집 포인트의 수는 최대 333개이다), 스캐닝 속도는 200000 Hz이므로 구성되는 맥상 동적 3차원 이미지가 정밀하고 정확하기 때문에, 시 간 차원과 공간 차원의 미묘한 맥상 변화를 반영할 수 있어서 컴퓨터가 복잡한 한의학 맥상을 인식할 수 있다. 2. 진맥에서는 3부9후, 즉 촌, 관, 척 3부와, 각 부를 각각 약, 중, 강의 지력으로 맥을 눌러서(3후) 부, 중, 침으로 나누면, 3 곱하기 3으로 9후 정보를 얻을 수 있고（《난경·18난》）, 다시 서로 간의 비교를 더한다. 완전한 진맥 지법은 다음을 포함한다. 한 부위를 약, 중, 강으로 누르고, 기타 두 개 부위는 각각 약, 중, 강의 세기를 매치시키면, 즉 한 측이 3*3*3으로 총 27종의 지법이 되며, 양측이면 총 54개의 지법이 된다. 따라서 맥 진의 객관화 장치는 반드시 3부 진맥을 나누어 해결해서 각 부가 약, 중, 강 지력으로 맥을 누를 수 있어야 한 다. 본 실용신안은 3개 맥상 센서의 위치를 독립적으로 제어 조정함으로써, 맥진의 약중강 진맥 수법을 시뮬레이션 하고, 동시에 각 밀폐 챔버 내의 공압을 독립적으로 조정함으로써, 플렉시블 맥진 터치필름의 맥박 부위를 맥박공개실용신안 20-2019-0002497 -7-을 따라 가장 뚜렷하게 변형시켜서, 3부9후의 맥진 수법을 동시에 구현하고, 보다 포괄적인 정보를 획득한다. 3. 맥상의 동역학적 특징과 형태학적 특징을 동시에 획득한다. 기압 센서를 밀폐 챔버 내에 배치하여 맥압을 직 접 측정하고, 맥상 3차원 정보와 기압 데이터를 동시에 획득하고 동시에 전송함으로써, 맥상 5차원 정보(시간 정보, 기압 정보, 3차원 이미지 정보)를 동시에 획득하여 맥상 정보의 포괄성과 정확성을 확보한다. 4. 이미지 인식 기술을 결합시켜 맥상 센서의 자동 위치 결정을 구현하고, 나아가 맥진의 자동화 정도를 향상시 킨다. 5. 광섬유 전송 기술을 사용하여 센서의 소형화 문제를 해결하고, 동시에 광섬유 전송을 통해 스캐닝 레이저와 반사 레이저의 전송 거리를 연장시키고, 높은 정밀도의 신속한 스캐닝의 구현을 보장하며, 레이저 3차원 스캐닝 거리가 지나치게 작아서 실현될 수 없는 문제를 해결한다."}
