{"patent_id": "10-2022-0163796", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0080440", "출원번호": "10-2022-0163796", "발명의 명칭": "염료배합비율 보정 장치 및 그 방법", "출원인": "한국전자통신연구원", "발명자": "오현우"}}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메모리; 및 상기 메모리와 연결된 프로세서를 포함하고, 상기 프로세서는,고객에 의해 요구된 제1 CCM(Computer Color Matching) 측색값을 포함하는 염색오더 수신 시, 상기 제1 CCM 측색값, 현재 선택된 염료배합비율, 염색공정에서 측정된 제2 CCM 측색값, 원단 특성 데이터 및 원료 특성 데이터중 적어도 하나에 기초하여, 상기 제1 CCM 측색값과 제2 CCM 측색값의 편차가 최소화되도록 상기 염료배합비율을 보정하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는, 상기 제1 CCM 측색값과 제2 CCM 측색값 간의 편차를 산출하고, 상기 염료배합비율을 좌표계에 포지셔닝(positioning)하며, 기 저장된 염료별 농도별 염료 특성 데이터 및 상기 편차에 기초하여 상기 염료배합비율의위치 이동을 위한 염료별 농도를 산출하고, 상기 산출된 염료별 농도, 염료 특성 데이터 및 원단 특성 데이터중 적어도 하나를 기반으로 상기 염료배합비율을 고객이 요구하는 색상으로 재현하기 위한 보정값을 산출하는것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 프로세서는, 상기 염료 특성 데이터 및 원단 특성 데이터를 기반으로 상기 염료배합비율에 대한 위치 이동을 위한 보정 계수를 산출하고, 상기 보정 계수를 이용하여 상기 산출된 염료별 농도를 보정하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 프로세서는,상기 염료 특성 데이터 및 원단 특성 데이터를 기반으로 염료별 농도에 대한 학습 데이터셋을 생성하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 프로세서는,공개특허 10-2024-0080440-3-상기 염료 특성 데이터를 CCM 기초 데이터와 염료별 및 농도별로 매핑하여 염료별 농도별 염료 특성 데이터를생성하고, 상기 염료별 농도별 염료 특성 데이터를 기반으로 데이터 증강을 통해 상기 학습 데이터셋을 생성하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 프로세서는,상기 염료별 농도별 염료 특성 데이터에 기초하여 농도별 분산 및 편차를 산출하고, 상기 농도별 분산 및 편차에 기초하여 분포도를 산출하며, 상기 분포도에 기초하여 상기 염료별 농도별 염료 특성 데이터를증강함으로써, 상기 학습 데이터셋을 생성하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 염료 특성 데이터는, 염료의 화학구조, 분자량, 흡수 파장, 칼라 스트렝스, 용해도, 분산점, 반응점, 염착율, 및 고착율 중 적어도하나를 포함하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 원단 특성 데이터는, 원단 종류, 원단 성분, 원단 조직, 면수, 원사 꼬임수, 원단 두께, 및 혼용율 중 적어도 하나를 포함하는 것을특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "메모리; 및 상기 메모리와 연결된 프로세서를 포함하고, 상기 프로세서는,상기 염료 특성 데이터 및 원단 특성 데이터를 기반으로 염료별 농도에 대한 학습 데이터셋을 생성하고, 상기학습 데이터셋, 고객에 의해 요구된 제1 CCM 측색값, 염색공정에서 측정된 제2 CCM 측색값, 현재 선택된 염료배합비율 및 원단 특성 데이터 중 적어도 하나에 기초하여 상기 염료배합비율을 보정하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 프로세서는,상기 염료 특성 데이터를 CCM 기초 데이터와 염료별 및 농도별로 매핑하여 염료별 농도별 염료 특성 데이터를생성하고, 상기 염료별 농도별 염료 특성 데이터를 기반으로 데이터 증강을 통해 상기 학습 데이터셋을 생성하는 것을 특징으로 하는 염료배합비율 보정 장치.공개특허 10-2024-0080440-4-청구항 11 제10항에 있어서, 상기 프로세서는,상기 염료별 농도별 염료 특성 데이터에 기초하여 농도별 분산 및 편차를 산출하고, 상기 농도별 분산 및 편차에 기초하여 분포도를 산출하며, 상기 분포도에 기초하여 상기 염료별 농도별 염료 특성 데이터를증강함으로써, 상기 학습 데이터셋을 생성하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서, 상기 염료 특성 데이터는, 염료의 화학구조, 분자량, 흡수 파장, 칼라 스트렝스, 용해도, 분산점, 반응점, 염착율, 및 고착율 중 적어도하나를 포함하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 원단 특성 데이터는, 원단 종류, 원단 성분, 원단 조직, 면수, 원사 꼬임수, 원단 두께, 및 혼용율 중 적어도 하나를 포함하는 것을특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 프로세서는, 상기 제1 CCM 측색값과 제2 CCM 측색값 간의 편차를 산출하고, 상기 염료배합비율을 좌표계에 포지셔닝(positioning)하며, 상기 편차 및 농도별 염료 특성 데이터에 기초하여 상기 염료배합비율의 위치 이동을 위한염료별 농도를 산출하고, 상기 산출된 염료별 농도, 학습 데이터셋 및 원단 특성 데이터 중 적어도 하나를 기반으로 상기 염료배합비율을 고객이 요구하는 색상으로 재현하기 위한 보정값을 산출하는 것을 특징으로 하는 염료배합비율 보정 장치."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "프로세서가 고객에 의해 요구된 제1 CCM 측색값을 포함하는 염색오더를 수신하는 단계; 및 상기 프로세서가, 상기 제1 CCM 측색값, 현재 선택된 염료배합비율, 염색공정에서 측정된 제2 CCM 측색값, 원단특성 데이터 및 원료 특성 데이터 중 적어도 하나에 기초하여, 상기 제1 CCM 측색값과 제2 CCM 측색값의 편차가최소화되도록 상기 염료배합비율을 보정하는 단계를 포함하는 염료배합비율 보정 방법."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2024-0080440-5-제15항에 있어서, 상기 염료배합비율을 보정하는 단계는, 상기 프로세서가, 상기 제1 CCM 측색값과 제2 CCM 측색값 간의 편차를 산출하고, 상기 염료배합비율을 좌표계에포지셔닝(positioning)하는 단계;상기 프로세서가, 기 저장된 염료별 농도별 염료 특성 데이터 및 상기 편차에 기초하여 상기 염료배합비율의 위치 이동을 위한 염료별 농도를 산출하는 단계; 및 상기 프로세서가, 상기 산출된 염료별 농도, 염료 특성 데이터 및 원단 특성 데이터 중 적어도 하나를 기반으로상기 염료배합비율을 고객이 요구하는 색상으로 재현하기 위한 보정값을 산출하는 단계를 포함하는 것을 특징으로 하는 염료배합비율 보정 방법."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서, 상기 프로세서가, 상기 염료 특성 데이터 및 원단 특성 데이터를 기반으로 염료별 농도에 대한 학습 데이터셋을생성하는 단계를 더 포함하는 것을 특징으로 하는 염료배합비율 보정 방법."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 학습 데이터셋을 생성하는 단계에서, 상기 프로세서는, 상기 염료 특성 데이터를 CCM 기초 데이터와 염료별 및 농도별로 매핑하여 염료별 농도별 염료 특성 데이터를 생성하고, 상기 염료별 농도별 염료 특성 데이터에 기초하여 농도별 분산 및 편차를산출하고, 상기 농도별 분산 및 편차에 기초하여 분포도를 산출하며, 상기 분포도에 기초하여 상기 염료별 농도별 염료 특성 데이터를 증강함으로써, 상기 학습 데이터셋을 생성하는 것을 특징으로 하는 염료배합비율 보정방법."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서, 상기 염료 특성 데이터는, 염료의 화학구조, 분자량, 흡수 파장, 칼라 스트렝스, 용해도, 분산점, 반응점, 염착율, 및 고착율 중 적어도하나를 포함하는 것을 특징으로 하는 염료배합비율 보정 방법."}
{"patent_id": "10-2022-0163796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서,상기 원단 특성 데이터는, 원단 종류, 원단 성분, 원단 조직, 면수, 원사 꼬임수, 원단 두께, 및 혼용율 중 적어도 하나를 포함하는 것을특징으로 하는 염료배합비율 보정 방법."}
{"patent_id": "10-2022-0163796", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 염료배합비율 보정 장치에 관한 것으로, 메모리와 연결된 프로세서를 포함하고, 프로세서는 고객에 의 해 요구된 제1 CCM 측색값을 포함하는 염색오더 수신 시, 제1 CCM 측색값, 현재 선택된 염료배합비율, 염색공정 에서 측정된 제2 CCM 측색값, 원단 특성 데이터 및 원료 특성 데이터 중 적어도 하나에 기초하여, 상기 제1 CCM 측색값과 제2 CCM 측색값의 편차가 최소화되도록 염료배합비율을 보정할 수 있다."}
{"patent_id": "10-2022-0163796", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 염료배합비율 보정 장치 및 그 방법에 관한 것으로, 보다 상세하게는 원단 특성 데이터 및 염료 특성 데이터를 고려하여 CCM(Computer Color Matching) 측색 편차를 보정할 수 있도록 하는, 염료배합비율 보정 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0163796", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "염색공정은 고객이 요구하는 원단에 고객이 요구하는 색상으로 염색하는 공정이다. 고객 요구는 표준광원 (U3500, D65, A/10 등)에서 측색한 CCM QTX 파일, Color Chip, 스와치 샘플 등과 함께 오더가 오게 된다. CCM QTX 파일에는 광원정보가 없을 수 있으며, 이러한 경우 고객이 어떤 광원에서 측색한 결과인지를 알려준다. Color Chip과 스와치 샘플은 고객이 제시하는 원단조각이며, 이러한 색상과 터치감으로 해당 원단에 염색 가공 해 줄 것을 요구하는 것이다. 고객의 오더가 있으면 CCM 측색기를 통해 고객이 제시한 광원에서 QTX 파일을 읽어보거나 Color Chip 및 스와치 샘플을 CCM 측색기를 통해 측색한다. CCM 측색은 설정한 광원에서 고객이 요구한 색상을 Color Space 좌표계에 서 X, Y, Z 값으로 나타낸다. CCM 측색 시스템에는 해당 염색공장에서 사용하는 단색염료를 기반으로 제한된 농 도별로 염색을 하여 동일한 광원조건(D65)에서 측색한 X, Y, Z값을 기초데이터로 넣는다. 이러한 기초데이터는 고객이 제시한 QTX 파일, Color Chip, 스와치 샘플 등을 CCM에서 측색한 결과에 대해 단색염료를 선택할 수 있 고, 선택된 단색 염료들의 혼합비율을 기초데이터 X, Y, Z 값의 편차를 계산하여 시뮬레이션할 수 있다. 이렇게 시뮬레이션되어 추천된 염료배합비율 중 가장 적합하다고 생각되는 염료배합비율을 선택하여 실험실 레벨에서 B/T 테스트를 진행한다. B/T 테스트 결과 염색된 원단을 CCM에서 측색하여 바이어가 요구한 Original CCM 값과 의 편차를 줄이기 위해 B/T 테스트를 반복하여 수행한다. 이렇게 B/T 테스트를 통해 염료배합비율을 찾았다면 100Kg 염색기에서 실험염색을 진행한다. 실험염색에서 바이어가 요구한 색상을 만족할 수 있다면 현장에서 벌크 염색을 진행한다. 현장의 벌크 염색은 500Kg ~ 1,500Kg 용량을 갖는 염색기에서 이루어진다. 실험염색도 현장의 벌크 염색도 염색한 결과 원단에 대해 샘플검사 및 CCM 측색을 통해 고객의 Original CCM값과의 색차를 줄이는 과정을 진행하게 된다. 염색공정이 완료되면 가공 공정에서 고객이 원하는 터치감 및 광택을 주는 과정이 있게 되고 후가공이 완료되면 최종적으로 검사를 통해 양품의 염색가공제품을 출하하게 된다. 검사하는 과정에서도 CCM 측색을 통해 고객이 요구하는 Original CCM 측색값과의 편차를 확인하게 된다. 하지만, 현장에서는 CCM 측색에 의해 데이터값 또는 그래프상에서의 거리 및 편차(+값, -값) 등을 현장 작업자 가 보고 작업자의 노하우에 의해 단색염료의 가감비율을 정하여 보정하고 있다. 이렇게 하는 이유는 CCM 측색기 에 저장된 기초데이터가 동일한 원단(예를 들면, 면100% 40수원단)을 기반으로, 단색염료를 제한된 농도(예를 들면, 0.1%, 0.5%, 1.0%, 3.0%, 5.0% 등)에 대해 염색하며, 염색된 원단을 동일한 광원(예를 들면, D65)에서 CCM 측색한 결과값이기 때문이다. 따라서, 현장에서 염색하는 원단과는 특성이 너무 다른 경우가 많고, 현장에 서 사용하는 원단 종류는 매우 다양하다. 또한, 단색염료는 염료별로 용해특성, 반응온도 및 조건 등이 다르고, 흡수파장과 흡수율 및 칼라 스트렝스 등도 상이하다. 또한 염료농도별로 흡수파장, 칼라 스트렝스 등이 다를 수 있다. 이러한 이유로 CCM 측색 시스템에서 제공하는 기능은 참고용으로 사용하는 경우가 많고 실제 현장 염색에 있어서는 현장 노하우에 의해 염색공정이 진행되는 경우가 많다. 종래기술은 CCM 측색에 따른 염료배합비율 처방과 현장에서 이루어지는 염색공정간에 발생되는 색차를 CCM 측색 편차를 통해 계산함에 있어서, 염색을 해야 하는 원단의 특성과 염료배합비율의 근간을 이루는 염료 특성 데이 터를 현장에서 활용할 수 있는 기준값을 제시하고 있지 못하고, CCM 측색 편차를 보정하기 위한 방법으로써 원 단 특성과 염료 특성 데이터를 활용하고 있지 못한 단점이 있다."}
{"patent_id": "10-2022-0163796", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 발명의 배경기술은 대한민국 등록특허 10-0257320호(2000.02.29. 등록, 컴퓨터 칼라 매칭 작업관리 장치 및 그 방법)에 개시되어 있다."}
{"patent_id": "10-2022-0163796", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로서, 원단 특성 데이터 및 염료 특성 데이터를 고려하여 CCM 측색 편차를 보정할 수 있도록 하는, 염료배합비율 보정 장치 및 그 방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2022-0163796", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일부 실시예에 따른 염료배합비율 보정 장치는, 메모리, 상기 메모리와 연결되니 프로세서를 포함하 고, 상기 프로세서는, 고객에 의해 요구된 제1 CCM 측색값을 포함하는 염색오더 수신 시, 상기 제1 CCM 측색값, 현재 선택된 염료배합비율, 염색공정에서 측정된 제2 CCM 측색값, 원단 특성 데이터 및 원료 특성 데이터 중 적 어도 하나에 기초하여, 상기 제1 CCM 측색값과 제2 CCM 측색값의 편차가 최소화되도록 상기 염료배합비율을 보 정할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는, 상기 제1 CCM 측색값과 제2 CCM 측색값 간의 편차를 산출하 고, 상기 염료배합비율을 좌표계에 포지셔닝(positioning)하며, 기 저장된 염료별 농도별 염료 특성 데이터 및 상기 편차에 기초하여 상기 염료배합비율의 위치 이동을 위한 염료별 농도를 산출하고, 상기 산출된 염료별 농 도, 염료 특성 데이터 및 원단 특성 데이터 중 적어도 하나를 기반으로 상기 염료배합비율을 고객이 요구하는 색상으로 재현하기 위한 보정값을 산출할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는, 상기 염료 특성 데이터 및 원단 특성 데이터를 기반으로 상 기 염료배합비율에 대한 위치 이동을 위한 보정 계수를 산출하고, 상기 보정 계수를 이용하여 상기 산출된 염료 별 농도를 보정할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는, 상기 염료 특성 데이터 및 원단 특성 데이터를 기반으로 염 료별 농도에 대한 학습 데이터셋을 생성할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는, 상기 염료 특성 데이터를 CCM 기초 데이터와 염료별 및 농 도별로 매핑하여 염료별 농도별 염료 특성 데이터를 생성하고, 상기 염료별 농도별 염료 특성 데이터를 기반으 로 데이터 증강을 통해 상기 학습 데이터셋을 생성할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는, 상기 염료별 농도별 염료 특성 데이터에 기초하여 농도별 분산 및 편차를 산출하고, 상기 농도별 분산 및 편차에 기초하여 분포도를 산출하며, 상기 분포도에 기초하여 상기 염료별 농도별 염료 특성 데이터를 증강함으로써, 상기 학습 데이터셋을 생성할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 염료 특성 데이터는, 염료의 화학구조, 분자량, 흡수 파장, 칼라 스트렝 스, 용해도, 분산점, 반응점, 염착율, 및 고착율 중 적어도 하나를 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 원단 특성 데이터는, 원단 종류, 원단 성분, 원단 조직, 면수, 원사 꼬 임수, 원단 두께, 및 혼용율 중 적어도 하나를 포함할 수 있다. 본 발명의 일부 실시예에 따른 염료배합비율 보정 장치는, 메모리, 및 상기 메모리와 연결된 프로세서를 포함하 고, 상기 프로세서는, 상기 염료 특성 데이터 및 원단 특성 데이터를 기반으로 염료별 농도에 대한 학습 데이터 셋을 생성하고, 상기 학습 데이터셋, 고객에 의해 요구된 제1 CCM 측색값, 염색공정에서 측정된 제2 CCM 측색값, 현재 선택된 염료배합비율 및 원단 특성 데이터 중 적어도 하나에 기초하여 상기 염료배합비율을 보정 할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는, 상기 염료 특성 데이터를 CCM 기초 데이터와 염료별 및 농 도별로 매핑하여 염료별 농도별 염료 특성 데이터를 생성하고, 상기 염료별 농도별 염료 특성 데이터를 기반으 로 데이터 증강을 통해 상기 학습 데이터셋을 생성할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는, 상기 염료별 농도별 염료 특성 데이터에 기초하여 농도별 분산 및 편차를 산출하고, 상기 농도별 분산 및 편차에 기초하여 분포도를 산출하며, 상기 분포도에 기초하여 상기 염료별 농도별 염료 특성 데이터를 증강함으로써, 상기 학습 데이터셋을 생성할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 염료 특성 데이터는, 염료의 화학구조, 분자량, 흡수 파장, 칼라 스트렝 스, 용해도, 분산점, 반응점, 염착율, 및 고착율 중 적어도 하나를 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 원단 특성 데이터는, 원단 종류, 원단 성분, 원단 조직, 면수, 원사 꼬 임수, 원단 두께, 및 혼용율 중 적어도 하나를 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는, 상기 제1 CCM 측색값과 제2 CCM 측색값 간의 편차를 산출하 고, 상기 염료배합비율을 좌표계에 포지셔닝(positioning)하며, 상기 편차 및 농도별 염료 특성 데이터에 기초하여 상기 염료배합비율의 위치 이동을 위한 염료별 농도를 산출하고, 상기 산출된 염료별 농도, 학습 데이터셋 및 원단 특성 데이터 중 적어도 하나를 기반으로 상기 염료배합비율을 바이어가 요구하는 색상으로 재현하기 위 한 보정값을 산출할 수 있다. 본 발명의 일부 실시예에 따른 염료배합비율 보정 방법은, 프로세서가 고객에 의해 요구된 제1 CCM 측색값을 포 함하는 염색오더를 수신하는 단계, 및 상기 프로세서가, 상기 제1 CCM 측색값, 현재 선택된 염료배합비율, 염색 공정에서 측정된 제2 CCM 측색값, 원단 특성 데이터 및 원료 특성 데이터 중 적어도 하나에 기초하여, 상기 제1 CCM 측색값과 제2 CCM 측색값의 편차가 최소화되도록 상기 염료배합비율을 보정하는 단계를 포함한다. 본 발명의 일부 실시예에 있어서, 상기 염료배합비율을 보정하는 단계는, 상기 프로세서가, 상기 제1 CCM 측색 값과 제2 CCM 측색값 간의 편차를 산출하고, 상기 염료배합비율을 좌표계에 포지셔닝(positioning)하는 단계, 상기 프로세서가, 기 저장된 염료별 농도별 염료 특성 데이터 및 상기 편차에 기초하여 상기 염료배합비율의 위 치 이동을 위한 염료별 농도를 산출하는 단계, 및 상기 프로세서가, 상기 산출된 염료별 농도, 염료 특성 데이 터 및 원단 특성 데이터 중 적어도 하나를 기반으로 상기 염료배합비율을 고객이 요구하는 색상으로 재현하기 위한 보정값을 산출하는 단계를 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서가, 상기 염료 특성 데이터 및 원단 특성 데이터를 기반으로 염 료별 농도에 대한 학습 데이터셋을 생성하는 단계를 더 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 학습 데이터셋을 생성하는 단계에서, 상기 프로세서는, 상기 염료 특성 데이터를 CCM 기초 데이터와 염료별 및 농도별로 매핑하여 염료별 농도별 염료 특성 데이터를 생성하고, 상기 염료별 농도별 염료 특성 데이터에 기초하여 농도별 분산 및 편차를 산출하고, 상기 농도별 분산 및 편차에 기 초하여 분포도를 산출하며, 상기 분포도에 기초하여 상기 염료별 농도별 염료 특성 데이터를 증강함으로써, 상 기 학습 데이터셋을 생성할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 염료 특성 데이터는, 염료의 화학구조, 분자량, 흡수 파장, 칼라 스트렝 스, 용해도, 분산점, 반응점, 염착율, 및 고착율 중 적어도 하나를 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 원단 특성 데이터는, 원단 종류, 원단 성분, 원단 조직, 면수, 원사 꼬 임수, 원단 두께, 및 혼용율 중 적어도 하나를 포함할 수 있다."}
{"patent_id": "10-2022-0163796", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일부 실시예에 따른 염료배합비율 보정 장치 및 그 방법은, 원단 특성 데이터 및 염료 특성 데이터를 고려하여 CCM 측색 편차를 보정함으로써, 고객이 요구하는 색상을 재현하기 위한 염료배합비율을 보정하고 찾아 가는 시행착오를 현저히 줄일 수 있고, 이로 인해 시간, 노동력, 용수, 염료, 염조제, 약품, 에너지 등에 대한 원가 절감과 생산성 향상을 제공할 수 있다. 본 발명의 일부 실시예에 따른 염료배합비율 보정 장치 및 그 방법은, 기본 CCM 측색 시스템에서 제공하는 기초 데이터 외에 원단 특성 데이터 및 염료 특성 데이터를 기반으로 학습 데이터셋을 생성하고, 그 학습 데이터셋을 기반으로 염료배합비율을 보정함으로써, B/T 테스트, 실험염색, 현장 벌크 염색 등에서 수차례 반복적으로 시행 되는 염색과 CCM 측색, 및 염료배합비율 보정에 대한 시행 착오를 현저히 줄일 수 있다."}
{"patent_id": "10-2022-0163796", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 일 실시예에 따른 염료배합비율 보정 장치 및 그 방법을 첨부된 도면들을 참조하여 상세 하게 설명한다. 이러한 과정에서 도면에 도시된 선들의 두께나 구성요소의 크기 등은 설명의 명료성과 편의상 과장되게 도시되어 있을 수 있다. 또한 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서, 이는 이용자, 운용자의 의도 또는 관례에 따라 달라질 수 있다. 그러므로 이러한 용어들에 대한 정의는 본 명세 서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 종래 CCM 측색 시스템은 단일 원단(면 100%)에 염료별 농도별(대략 5개 농도) 염색 후 CCM 측색을 통해 Color Space에서 X, Y, Z 값을 기초데이터로 입력하고, 고객이 요구하는 원단과 색상에 대해 CCM 측색기를 통해 측색 및 확인을 한다. 그런 후, 작업자가 기초데이터로 들어가 있는 단색염료를 후보군으로 선택하면, CCM 측색 시스 템은 기초데이터를 기반으로 시뮬레이션을 통해 작업자가 선택한 단색염료의 배합비율로 처방을 계산하고, 이를 기반으로 B/T 테스트를 진행한다. 그런 후, CCM 측색 시스템은 B/T 테스트 결과를 CCM 측색기를 통해 측색하고, 최초 Original CCM 측색값 대비 B/T 테스트 결과 측색한 CCM 측색값의 편차를 계산하여 화면상에 편차를 숫자로 표기하며 작업자가 확인할 수 있도록 한다. 그런 후, 작업자의 노하우에 의해 어떤 염료를 어떻게 보정할 것인 지를 결정하도록 하거나, 재처방에 관한 라이브러리 라이센스를 구매한 경우에는 작업자가 선택한 염료배합을 재처방하는 비율값으로 출력하여 준다. 그러나 종래 CCM 측색 시스템은 단일 원단(면 100%)에 대한 염료별 농도별(5개 농도) 염색 후 CCM 측색을 통한 기초데이터를 기반으로 모든 계산이 이루어지고 있어서, 현장 염색공정에서 이루어지고 있는 수많은 원단의 특 성을 전혀 고려하고 있지 않고, 염료들이 갖고 있는 특성(화학구조, 분자량, 흡수파장, 칼라스트렝스, 용해도, 분산점, 반응점, 염착율, 고착율 등)에 대한 실험적 데이터를 고려하고 있지 않다. 이로 인해 고객이 요구하는 원단에 색상을 재현하기 위한 B/T 테스트, 실험염색, 현장 염색 등 반복적인 시행착오를 많이 하게 된다. 이로 써, 시간, 노동력, 용수, 염료, 염조제, 약품, 에너지 등 많은 손실이 발생하고 있다. 이는 염색공장의 생산성 을 저해하는 요인이 된다. 이에, 본 발명은 B/T, 실험염색, 및 현장염색 시에 CCM 측색을 통해 고객이 요구하는 CCM 측색값을 만족하는 반 복적인 시행착오에 있어서, 원단의 특성을 구분하는 원단 특성 데이터와 염료의 특성을 나타내는 실험적인 염료 특성 데이터를 기반으로 염료별 농도에 대한 데이터 증강을 통해 학습 데이터셋을 확보하고, 확보된 학습 데이 터셋을 기반으로 고객이 요구하는 CCM 측색값과 염색공정에서 측정되는 CCM 측색값의 색차를 보정하는 염료배합 비율 보정 알고리즘을 통해 고객이 요구하는 색상과 염색공정에서 색상간의 색차에 대한 시행착오를 줄이며 찾 아갈 수 있도록 하는 염료배합비율 보정 장치 및 그 방법에 관한 것이다. 또한, 본 발명은 원단 특성을 면, 레이온, 모달 등 기본원단을 구분하고, 기본원단에 폴리에스테르의 포함 여부 를 구분하며, 기본원단에 스판 여부를 구분하고, 원단의 제직 및 편직을 구분하고, 원단을 구성하는 원사의 꼬 임수와 원단의 면수를 구분하며, 생지원단의 g/yard 또는 g/m2를 통해 원단 두께를 구분하고, 순수한 기본 원단 이 아닌 경우 그 혼용율을 구분한다. 본 발명은 이러한 원단 특성을 고려하게 되면 기본원단이 무슨 원단이냐에 따라, 또한 폴리에스테르의 혼합 여부에 따라 유사계열의 염료 중에서 선택할 수 있는 염료를 구분할 수 있고, 염료배합비율을 찾는 데 참고 데이터가 될 수 있다. 따라서, 본 발명은 원단 특성을 고려한 염료배합비율 보정 장치 및 그 방법에 관한 것이다. 또한, 본 발명은 염료 특성을 분자 구조를 나타내는 화학구조, 분자량, 흡수파장, 칼라스트렝스, 용해도, 분산 점, 반응점, 염착율, 고착율 등을 염료회사에서 제시해 주는 정보와 실험을 통해 수집할 수 있는 데이터들을 염 료 특성 데이터셋으로 구성하여 염료배합비율을 찾는데 참조가 되는 데이터로써 상관분석을 진행하고 염색 공정 에서 CCM 측색에 따른 염료배합비율의 보정을 위한 데이터셋으로 활용할 수 있도록 하는 염료배합비율 보정 장 치 및 그 방법에 관한 것이다. 또한, 본 발명은 염료별 농도별 실험을 통해 염료 특성 데이터셋을 확보하고, 농도별 염료 특성 데이터를 기반 으로 농도별 분산 및 편차를 계산하며, 고분포도를 계산하여 데이터 증강 기법에 적용하여 염료별 농도별 학습 데이터셋을 충분히 확보할 수 있도록 하는 염료배합비율 보정 장치 및 그 방법에 관한 것이다. 또한, 본 발명은 고객이 요구한 제1 CCM 측색값, 염료배합비율, B/T, 실험염색 및 현장염색에서의 제2 CCM 측색 값이 입력으로 주어지면, CCM 좌표계 편차 계산뿐만 아니라, 염료배합비율에 대한 포지셔닝(Positioning)을 하 고, 염료 특성 데이터와 원단 특성 데이터를 기반으로 염료배합비율에 대한 위치 이동을 위한 보정계수를 산출하여 염료배합비율을 보정함으로써, 기존 방식보다 시행착오를 줄이고 고객이 요구하는 염색 색상을 만족할 수 있도록 하는 염료배합비율 보정 장치 및 그 방법에 관한 것이다. 도 1은 본 발명의 일 실시예에 따른 염료배합비율 보정 장치를 설명하기 위한 블록 구성도, 도 2는 본 발명의 일 실시예에 따른 염료배합비율을 보정하는 방법을 설명하기 위하 예시도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 염료배합비율 보정 장치는 CCM 측색기, 메모리, 입력모듈, 출력모듈 및 프로세서를 포함한다. 고객의 염색 오더가 접수되면, CCM 측색기는 고객이 제시한 광원에서 QTX 파일을 읽어오거나, 컬러 칩 (Color Chip) 및 스와치 샘플로부터 CCM을 측정하고, 측정한 CCM 측색값을 메모리에 저장할 수 있다. 염색 오더는 CCM QTX 파일, 컬러 칩(Color Chip), 스와치 샘플 등을 포함할 수 있고, 컬러 칩(Color Chip)과 스와치 샘플은 원단 조각을 의미할 수 있다. CCM 측색기는 설정한 광원에서 고객이 요구한 색상을 컬러 공간(Color Space) 좌표계에서 X, Y, Z 값으로 나타낼 수 있다. 메모리는 염료배합비율 보정 장치의 동작과 관련된 데이터들을 저장하는 구성이다. 특히, 메모리 에는 원단 특성 데이터 및 염료 특성 데이터를 기반으로 염료별 농도에 대한 학습 데이터셋을 생성하고, 고객에 의해 요구된 제1 CCM 측색값, 염색공정에서 측정된 제2 CCM 측색값, 현재 선택된 염료배합비율 및 원단 특성 데이터 중 적어도 하나에 기초하여 염료배합비율을 보정하도록 하는 어플리케이션(프로그램 또는 애플릿) 등이 저장될 수 있으며, 저장되는 정보들은 필요에 따라 프로세서에 의해 취사선택될 수 있다. 즉, 메모리 에는 염료배합비율 보정 장치의 구동을 위한 운영 체제나 어플리케이션(프로그램 또는 애플릿)의 실 행 과정에서 발생되는 여러 종류의 데이터가 저장된다. 이때, 메모리는 전원이 공급되지 않아도 저장된 정 보를 계속 유지하는 비휘발성 저장장치 및 저장된 정보를 유지하기 위하여 전력이 필요한 휘발성 저장장치를 통 칭하는 것이다. 또한, 메모리는 프로세서가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기 능을 수행할 수 있다. 여기서, 메모리는 저장된 정보를 유지하기 위하여 전력이 필요한 휘발성 저장장치 외에 자기 저장 매체(magnetic storage media) 또는 플래시 저장 매체(flash storage media)를 포함할 수 있으 나, 본 발명의 범위가 이에 한정되는 것은 아니다. 입력모듈은 고객에 의해 요구된 제1 CCM 측색값, 염료배합비율 등을 입력하기 위해 제공되는 것으로, 예를 들면, 키보드, 마우스, 터치패드, 터치스크린, 전자펜, 터치 버튼 등의 사용자 인터페이스로 제공될 수 있다. 출력모듈은 프로세서의 제어에 의해 보정된 염료배합비율 등을 출력할 수 있다. 이러한 출력모듈 은 프린터, 디스플레이 등으로 구현될 수 있다. 여기서, 디스플레이는 예컨대, TFT-LCD(thin film transistor-liquid crystal display) 패널, LED(light emitting diode) 패널, OLED(organic LED) 패널, AMOLED(active matrix OLED) 패널, 또는 플렉서블(flexible) 패널 등으로 구현될 수 있다. 프로세서는 ASIC(Application Specific Integrated Circuit), DSP(Digital Signal Processor), PLD(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), CPU(Central Processing unit), 마이크로 컨트롤러(microcontrollers) 및/또는 마이크로프로세서(microprocessors) 중 적어도 하나로 구현될 수 있다. 프로세서는 원단 특성 데이터 및 염료 특성 데이터를 기반으로 염료별 농도에 대한 데이터 증강을 통해 학 습 데이터셋을 생성할 수 있다. 또한, 프로세서는 고객에 의해 요구된 제1 CCM 측색값을 포함하는 염색오더 수신 시, 제1 CCM 측색값, 현 재 선택된 염료배합비율, 염색공정에서 측정된 제2 CCM 측색값, 염료 특성 데이터 및 원료 특성 데이터 중 적어 도 하나에 기초하여, 제1 CCM 측색값과 제2 CCM 측색값의 편차가 최소화되도록 염료배합비율을 보정할 수 있다. 이하, 프로세서의 동작에 대해 구체적으로 설명하기로 한다. 프로세서는 원단 특성 데이터와 염료 특성 데이터를 기반으로 염료별 농도에 대한 데이터 증강을 통해 학 습 데이터셋을 생성할 수 있다. 원단 특성 데이터는, 원단 종류, 원단 성분, 원단 조직, 면수, 원사 꼬임수, 원단 두께, 및 혼용율 등을 포함할 수 있다. 즉, 원단 특성은 면, 레이온, 모달 등 기본 원단을 구분하고, 기본 원단에 폴리에스테르의 포함 여부를 구분할 수 있다. 즉, 기본 원단에 폴리에스테르가 포함되는 원단이 있으면, 폴리에스테르가 얼마나 포함되어 있는지에 대한 여부는 혼용율로 나타낸다. 예를 들면, 면 60% + 폴리에스테르 40% 등으로 폴리에스테르의 포함 여부를 나타낼 수 있다. 또한, 원단 특성은 스판의 포함 여부를 구분할 수 있다. 스판이 포함된 원단의 경우에 는 신축성이 좋아 늘어나는 성질이 있기 때문에 전처리(Pre-Setting) 과정을 통해 원단을 고온에서 고정시켜주 는 전처리 공정이 추가된다. 따라서, 원단 특성은 기본원단에 스판이 포함된 여부를 구분할 수 있다. 또한, 기 본 원단에 폴리에스테르와 스판이 모두 포함된 경우도 있다. 이러한 경우에는 전처리와 염색 공정이 좀더 복잡 해지기 때문에 사용해야 하는 염료로 더 제한될 수 밖에 없다. 또한, 원단 종류를 구분하는 것 외에도 원단을 생산할 때 제직 원단인지, 편직 원단인지에 따라 원단 특성에 차이가 있다. 따라서, 원단 특성은 원단의 제직 및 편직을 구분할 수 있다. 또한, 원단을 생산하기 위한 원료인 원사의 경우에도 원사의 꼬임수가 있으며, 원사 의 꼬임수에 따라 염료가 염착 또는 고착되는 성질이 달라질 수 있다. 따라서, 원단 특성은 원단을 구성하는 원 사의 꼬임수와 원단의 면수를 구분할 수 있다. 여기서, 원단의 면수는 원단에 사용된 실의 굵기(1g의 면으로 뽑 아낸 실의 길이)를 나타낸다. 또한, 원단 특성은 생지 원단의 g/yard 또는 g/m2를 통해 원단 두께를 구분할 수 있다. 또한, 원단 특성은 순수한 기본 원단이 아닌 경우 그 혼용율을 구분할 수 있다. 이러한 원단 특성을 고려 하게 되면 기본 원단이 무슨 원단이냐에 따라, 또한 폴리에스테르의 혼합 여부에 따라 유사 계열의 염료 중에서 선택할 수 있는 염료를 구분할 수 있고, 염료배합비율을 찾는데 참고 데이터가 될 수 있다. 이러한 원단 특성 데이터는 원단과 염료들이 결합하여 완성되는 염색공정에 있어서 염료배합비율과 염색하는 과 정을 결정할 수 있는 요소가 될 수 있다. 즉, 원단 특성 데이터는 원단 특성에 따라 사용할 수 있는 염료와 사 용할 수 없는 염료를 구분할 수 있도록 하고, 원단 특성에 따라 염료의 염착율에 대한 조건 등을 분석하여 염료 배합비율을 보정하는 조건으로 이용될 수 있다. 원단 특성 데이터는 해당 원단에 어떠한 염료를 선택하여 염료 배합비율을 만들어 염색하였는지에 대한 학습 데이터셋을 기반으로 그 동안 작업자가 선택하였던 단색 염료 후 보군을 AI 모델을 통해 좋은 콤비네이션을 가진 염료들로 후보군을 추천해 줄 수 있도록 한다. 염료 특성 데이터는 염료의 화학구조, 분자량, 흡수 파장, 칼라 스트렝스, 용해도, 분산점, 반응점, 염착율, 및 고착율 등을 포함할 수 있다. 염료는 분자구조를 갖는다, 따라서 화학구조와 분자량 등을 알게 되면 해당 염료의 화학적 특성을 해석할 수 있 다. 염색의 경우 염료와 원단을 염색조건(욕비, 온도, 승온조건, 소다회/망초 등 투입량 및 투입시기 등), 시간 등에 따라 원단과 염료가 결합하는 형태로 염색이 이루어진다. 따라서, 염료들이 염색조건에서 농도별로 어떠한 흡수파장을 보이는지, 칼라 스트렝스는 어떻게 되는지 등을 실험을 통해 데이터화하는 것이 필요하다. 염료들은 물에 녹는 용해도가 존재한다. 이에, 어떤 염료는 분산점이 필요하고, 어떤 염료는 반응점이 필요하다. 이처럼 염료들의 물성을 데이터화하는 것도 필요하다. 염료와 원단이 염색되는 과정에서 염착율이라는 것이 존재한다. 이에, 원단에 염료가 잘 결합하는지, 겉도는지, 이미 염착이 완료된 상태인지 등에 대한 염착율을 아는 것도 필 요하다. 원단에 염료가 염착되었다면 원단에서 염료가 빠지지 않는 것이 고착율이다. 고착율을 아는 것은 해당 원단을 염색후 수세, 쇼핑 등 세탁을 한 후에도 색상이 변하지 않도록 하는 것과 관련이 있다. 따라서, 본 발명 은 분자구조를 갖는 염료의 화학구조, 분자량, 흡수. 파장, 칼라 스트렝스, 용해도, 분산점, 반응점, 염착율, 고착율 등의 염료 특성 데이터를 실험을 통해 확보하고, 확보된 염료 특성 데이터를 염료별 농도별로 실험을 통 해 염료별 농도별 염료 특성 데이터를 생성할 수 있다. 이렇게 생성된 염료별 농도별 염료 특성 데이터는 기존 염료별 농도별 기초데이터와 매핑되어 염료 특성 학습 데이터셋으로 생성될 수 있고, 염료 특성 데이터셋은 염 료배합비율을 염료배합비율을 보정하는 알고리즘의 조건 데이터로 활용될 수 있다. 즉, 염료 특성 데이터는 염 료배합비율을 결정함에 있어서 어떤 염료를 어떠한 비율로 배합해야 하는지 가늠자 역할을 할 수 있고, 염료배 합비율 보정 시 이용될 수 있다. 프로세서는 농도별 염료 특성 실험을 통해 획득된 염료 특성 데이터를 기반으로 염료별 농도에 대한 학습 데이터셋을 생성할 수 있다. 즉, 프로세서는 염료 특성 데이터를 CCM 기초 데이터와 염료별 및 농도별로 매핑하여 염료별 농도별 염료 특성 데이터를 생성할 수 있다. 그런 후, 프로세서는 염료별 농도별 염료 특 성 데이터를 기반으로 데이터 증강을 통해 학습 데이터셋을 생성할 수 있다. 이때, 프로세서는 염료별 농 도별 염료 특성 데이터에 기초하여 농도별 분산 및 편차를 산출하고, 농도별 분산 및 편차에 기초하여 분포도를 산출하며, 분포도에 기초하여 염료별 농도별 염료 특성 데이터를 증강함으로써, 학습 데이터셋을 생성할 수 있 다. 종래 CCM 측색기의 CCM 기초데이터는 해당 공장에서 사용하고 있는 염료별 농도별 샘플 염색을 한 후, CCM 측색을 통해 획득된 데이터를 의미한다. 이때, 염료별은 해당 공장에서 사용하는 염료를 말하는 것이기 때문에 수십~수백가지로 제한될 수 있다. 하지만, 농도별은 현장에서 단색염료당 0%~12% 정도까지도 사용할 수 있고,해당 비율은 실수형으로 조정해야 되기 때문에 무수히 많은 농도 후보군이 존재한다. 여기에 단색염료만으로 염 색하는 경우보다는 3~4가지 단색 염료를 배합하여 사용하는 경우가 많기 때문에, 염료 배합 조합은 무수히 많아 지게 된다. 그래서, 현장에서도 CCM 기초데이터는 염료별 농도를 5개 정도를 정하여 사용하고 있는 것이 일반적 이다. 예를 들면, 기존 CCM 측색기에 들어가는 염료별 농도별 염색한 CCM 측색값이 있는데, 해당 염료별 농도별 기초데이터는 농도가 0.1%, 0.5%, 1.0%, 3.0%, 5.0% 등 일부 데이터만 들어가 있다. 실제 염색을 하는 공정에서의 염료배합비율은 A염료(0.01%), B염료(0.3%), C염료(0.25%), D염료(0.17%) 등 기초데이터에는 없는 농도가 보다 많이 사용되게 된다. 이러한 현장에 4차 산업혁명시대의 인공지능 AI 모델을 적용하려고 한다면, 우선적으로 해결해야 하는 것이 학습 데이터셋이다. 인공지능 AI 모델 또는 알고리즘을 구동하고, 이를 통해 좋 은 결과를 도출하기 위해서는 학습 데이터셋이 많아야 한다. 즉, 염료배합비율을 보정하기 위한 학습기반의 AI 모델을 적용하기 위해서는 많은 데이터셋이 필요하게 되며 이를 위한 데이터 증강이 필요하다. 이에, 본 발명은 현장에서 사용하고 있는 CCM 기초데이터의 염료별 특성 데이터 확보를 위한 실험 농도를 설정 하고, 염료별 농도별 실험을 통해 농도별 염료 특성 데이터를 확보할 수 있다. 프로세서는 확보된 농도별 염료 특성 데이터를 입력받고, 입력받은 염료 특성 데이터를 CCM 기초 데이터와 염료별 및 농도별로 매핑하여 염료별 농도별 염료 특성 데이터를 생성할 수 있다. 그런 후, 프로세서는 염료별 농도별 염료 특성 데이터 에 대해 농도별 분산 및 편차를 산출하고, 농도별 분산 및 편차에 기초하여 분포도를 산출할 수 있다. 이때, 분 포도는 벡터 형태일 수 있다. 분포도가 산출되면, 프로세서는 해당 염료별 농도별 분포도를 통해 농도별 상관분석을 수행할 수 있고, 상관분석 결과에 기초하여 실험을 위해 설정한 농도 사이에 빠진 농도에 대한 데이 터를 보간법 또는 AI 데이터 증강 기법을 통해 생성할 수 있다. 이를 통해 프로세서는 염료별 농도별 학습 데이터셋을 생성할 수 있다. 본 발명은 원단 특성 데이터와 염료 특성 데이터를 기반으로 염료별 농도에 대한 데이터 증강을 통하여 학습 데 이터셋을 생성하고, 학습 데이터셋을 이용하여 CCM 측색 편차를 보정할 수 있는 염료배합비율을 보정함으로써, B/T 테스트, 실험염색, 현장 벌크 염색 등에서 수차례 반복적으로 시행되는 염색과 CCM 측색, 및 염료배합비율 보정에 대한 시행 착오를 현저히 줄일 수 있고, 이를 통해 시간, 노동력, 용수, 염료, 염조제, 에너지 등 원가 절감을 가능하도록 한다. 학습 데이터셋이 생성되면, 프로세서는 학습 데이터셋, 고객에 의해 요구된 제1 CCM 측색값, 염색공정에서 측정된 제2 CCM 측색값, 현재 선택된 염료배합비율 및 원단 특성 데이터 중 적어도 하나에 기초하여 염료배합비 율을 보정할 수 있다. 이때, 프로세서는 제1 CCM 측색값과 제2 CCM 측색값 간의 편차를 산출하고, 염료배 합비율을 좌표계에 포지셔닝(positioning)하며, 편차 및 농도별 염료 특성 데이터에 기초하여 염료배합비율의 위치 이동을 위한 염료별 농도를 산출하고, 산출된 염료별 농도, 학습 데이터셋 및 원단 특성 데이터 중 적어도 하나를 기반으로 염료배합비율을 고객이 요구하는 색상으로 재현하기 위한 보정값을 산출할 수 있다. 이하, 염료배합비율을 보정하는 방법에 대해 구체적으로 설명하기로 한다. 입력모듈을 통해 고객이 제1 CCM 측색값 및 현재 선택된 염료배합비율을 포함하는 염색 오더가 입력되면, 프로세서는 제1 CCM 측색값과 염색공정에서 측정된 제2 CCM 측색값 간의 편차를 산출하고, 염료배합비율을 좌표계에 포지셔닝(positioning)하며, 편차 및 농도별 염료 특성 데이터에 기초하여 염료배합비율의 위치 이동 을 위한 염료별 농도를 산출하고, 산출된 염료별 농도, 학습 데이터셋 및 원단 특성 데이터 중 적어도 하나를 기반으로 염료배합비율을 고객이 요구하는 색상으로 재현하기 위한 보정값을 산출할 수 있다. 여기서, 염료배합 비율은 해당 원단에 해당 색상을 재현하기 위한 염료배합비율을 의미하는 것으로서, 고객이 요구하는 원단과 색 상을 재현할 수 있는 염료배합비율이라기 보다는 B/T 테스트, 실험 염색, 및 현장 벌크 염색을 위한 염료배합비 율을 의미할 수 있다. 최종적으로 확정되는 염료배합비율은 현장 벌크 염색을 마친 후 염색 결과가 OK가 되었을 때, 고객이 요구하는 원단과 색상을 재현하기 위한 염료배합비율이 확정되는 것이다. 이러한 과정에서 B/T 테스 트, 실험염색, 현장 벌크염색 등이 반복적으로 수행되게 된다. 이러한 여러 단계의 시행착오는 많은 시간과 노 동력, 원단, 용수, 염료, 염조제, 소다회/망초 등약품, 에너지 등 생산성을 저하시키고 원가 절감을 와해시키는 요인이 된다. 이러한 시행착오를 현저히 줄이기 위해 B/T 테스트, 실험염색, 현장 벌크 염색 후 측정하는 제2 CCM 측색값이 입력 데이터로 주어지게 된다. 실험실 및 현장에서 측정된 제2 CCM 측색값이 입력되면, 프로세서 는 고객이 요구하는 제1 CCM 측색값과 제2 CCM 측색값 간의 편차는 산출할 수 있다. 하지만, 이러한 CCM 좌표계 편차 계산이 염료배합비율의 거리(Distance)로 나타나지는 않는다. 따라서, 현재 사 용하고 있는 염료배합비율에 대한 좌표계에서의 포지셔닝(Positioning)이 시각적으로 보여질 때 현장작업자들에 게 도움이 된다.이에, 프로세서는 현재 사용하고 있는 염료배합비율에 대한 좌표계 포지셔닝(Positioning)을 수행할 수 있 다. 이렇게 하면 고객이 요구하는 색상에 대한 좌표계 포지셔닝(Positioning)과 현재 염료배합비율의 좌표계 포 지셔닝(Positioning)을 확인할 수 있다. 이를 위해, 프로세서는 기초데이터로 들어가 있는 염료별 농도별 CCM 측색값을 활용하여 현재 사용하는 염료배합비율에 대한 포지셔닝(Positioning)을 수행할 수 있다. 염료배합비율에 대한 포지셔닝(Positioning)이 수행되면, 프로세서는 고객이 요구하는 색상의 좌표계 위치 와 현재 사용하고 있는 염료배합비율의 위치를 통해 염료배합비율의 위치(Positioning) 이동을 위한 염료별 농 도를 산출할 수 있다. 프로세서는 원단 특성 데이터를 기반으로 원단 특성 보정계수를 산출할 수 있고, 염료 특성 데이터를 기반 으로 염료 특성 보정계수를 산출할 수 있다. 현재 기초데이터는 면 100%에 대한 염료별 농도별 CCM 측색 데이터 이기 때문에 고객이 요구하는 원단의 특성을 고려한 보정계수(보정조건)를 계산하는 것이 필요하다. 원단 특성 보정계수와 염료 특성 보정계수가 산출되면, 프로세서는 원단 특성 보정계수와 염료 특성 보정 계수를 현재 사용하고 있는 염료배합비율을 고객이 요구하는 색상으로 위치(Positioning) 이동하기 위한 염료별 추가 또는 빼기 농도를 산출할 수 있다. 즉, 프로세서는 원단 특성 보정계수 및 염료 특성 보정계수에 기 초하여, 농도별 염료 특성 데이터를 기초로 산출된 염료별 농도의 보정값을 산출할 수 있다. 상술한 바와 같이 고객에 의해 요구된 제1 CCM 측색값, 염색공정에서 측정된 제2 CCM 측색값, 및 염료배합비가 입력되면, 프로세서는 기존 CCM 좌표계 편차 계산뿐만 아니라, 염료배합비율에 대한 위치를 설정하고 (Positioning), 염료 특성 데이터와 원단 특성 데이터를 기반으로 염료배합비율에 대한 위치 이동을 위한 보정 계수를 산출하며, 보정계수를 이용하여 염료배합비율을 보정할 수 있다. 이렇게 하면 고객이 요구하는 원단의 특성을 고려하고 현재 사용하는 염료배합비율의 염료 특성 데이터를 고려 하여 고객이 요구하는 색상을 재현하기 위한 염료배합비율을 보정하고 찾아가는 시행착오를 현저히 줄일 수 있 다. 도 2를 참조하여, 고객이 요구하는 색상이 좌표계에서 A라고 가정하여 염료배합비율을 보정하는 경우에 대해 설 명하기로 한다. B/T 테스트를 하기 위해 작업자가 선택한 염료후보군이 a, b, c 이며, 해당 염료의 농도는 0.15%, 0.01%, 0.20%이다. 좌표계에서 보여지듯이 B와 A 간에는 거리(Distance)가 존재하는 것을 확인할 수 있 다. 이러한 경우에 기존 CCM 측색 시스템에서는 X, Y, Z에 대한 편차를 계산하여 숫자로 표기한다. 또한, 라이 브러리 라이선스를 구매하여 사용하고 있는 기존 CCM 측색 시스템의 경우에는 사용하는 염료의 재처방 비율까지 보여주게 된다. 하지만, 현장에서는 이러한 재처방에 대한 값을 그대로 사용할 수 없다. 왜냐하면 CCM 기초데이터의 베이스 원 단은 생지면 100%를 기본으로 염료별 농도별 염색한 후, CCM 측색값을 기초데이터로 하고 있기 때문에 재처방된 염료배합비율이 고객이 요구하는 원단에 그대로 적용되지 않기 때문이다. 따라서, 원단 특성 데이터를 고려하는 것이 필요하고, 염료 특성 데이터를 농도별로 실험하여 화학구조, 분자량, 흡수파장, 칼라 스트렝스, 용해도, 분산점, 반응점, 염착율, 고착율 등을 학습 데이터셋으로 생성하며, 그 학습 데이터셋을 기반으로 염료 특성에 대한 상관분석을 통해 해당 염료배합비율의 변화량을 분석하여 B 위치에서 A 위치로 이동하기 위한 a, b, c의 염료배합비율을 0.13%, 0.15%, 0.17% 등으로 조정하는 것이 필요하게 된다. 상술한 바와 같이 본 발명은 원단의 특성을 구분하는 원단 특성 데이터와 염료의 특성을 나타내는 실험적인 염 료 특성 데이터를 기반으로 염료별 농도에 대한 데이터 증강을 통해 학습 데이터셋을 확보하고, 확보된 학습 데 이터셋을 기반으로 고객이 요구하는 CCM 측색값과 염색공정에서 측정되는 CCM 측색값의 색차를 보정하는 염료배 합비율 보정 알고리즘을 통해 고객이 요구하는 색상과 염색공정에서의 색차를 줄여 시행착오를 줄이며 찾아갈 수 있도록 한다. 도 3은 본 발명의 일 실시예에 따른 염료배합비율 보정 방법을 설명하기 위한 흐름도이다. 도 3을 참조하면, 프로세서는 염료 특성 데이터 및 원단 특성 데이터를 기반으로 염료별 농도에 대한 학습 데이터셋을 생성한다(S310). 프로세서가 학습 데이터셋을 생성하는 방법에 대한 상세한 설명은 도 4를 참 조하기로 한다. S310 단계의 수행 후, 고객에 의해 요구된 제1 CCM 측색값을 포함하는 염색오더가 수신되면(S320), 프로세서 는 제1 CCM 측색값, 현재 선택된 염료배합비율, 염색공정에서 측정된 제2 CCM 측색값, 학습 데이터셋 및 원단 특성 데이터 중 적어도 하나에 기초하여, 제1 CCM 측색값과 제2 CCM 측색값의 편차가 최소화되도록 상기 염료배합비율을 보정한다(S330). 프로세서가 염료배합비율을 보정하는 방법에 대한 상세한 설명은 도 5를 참조하기로 한다. 도 4는 본 발명의 일 실시예에 따른 학습 데이터셋을 생성하는 방법을 설명하기 위한 흐름도이다. 도 4를 참조하면, 프로세서는 농도별 염료 특성 실험을 통해 획득된 염료 특성 데이터를 CCM 기초 데이터 와 염료별 및 농도별로 매핑하여 염료별 농도별 염료 특성 데이터를 생성한다(S410). 그런 후, 프로세서는 염료별 농도별 염료 특성 데이터에 기초하여 농도별 분산 및 편차를 산출하고(S420), 농도별 분산 및 편차에 기초하여 분포도를 산출한다(S430). 그런 후, 프로세서는 분포도에 기초하여 염료별 농도별 염료 특성 데이터를 증강함으로써, 학습 데이터셋 을 생성한다(S440). 도 5는 본 발명의 일 실시예에 따른 염색오더 수신 시 염료배합비율을 보정하는 방법을 설명하기 위한 흐름도이 다. 도 5를 참조하면, 프로세서는 고객에 의해 요구된 제1 CCM 측색값과 염색공정에서 측정된 제2 CCM 측색값 간의 편차를 산출하고(S502), 현재 선택된 염료배합비율을 좌표계에 포지셔닝(positioning)한다(S504). 그런 후, 프로세서는 편차 및 농도별 염료 특성 데이터에 기초하여 염료배합비율의 위치 이동을 위한 염료 별 농도를 산출하고(S506), 산출된 염료별 농도, 학습 데이터셋 및 원단 특성 데이터 중 적어도 하나를 기반으 로 염료배합비율을 고객이 요구하는 색상으로 재현하기 위한 보정값을 산출한다(S506). 이때, 프로세서는 염료 특성 데이터 및 원단 특성 데이터를 기반으로 염료배합비율에 대한 위치 이동을 위한 보정 계수를 산출하 고, 보정 계수를 이용하여 상기 산출된 염료별 농도를 보정할 수 있다. 본 발명의 일부 실시예에 따른 염료배합비율 보정 장치 및 그 방법은, 원단 특성 데이터 및 염료 특성 데이터를 고려하여 CCM 측색 편차를 보정함으로써, 고객이 요구하는 색상을 재현하기 위한 염료배합비율을 보정하고 찾아 가는 시행착오를 현저히 줄일 수 있고, 이로 인해 시간, 노동력, 용수, 염료, 염조제, 약품, 에너지 등에 대한 원가 절감과 생산성 향상을 제공할 수 있다. 본 발명의 일부 실시예에 따른 염료배합비율 보정 장치 및 그 방법은, 기본 CCM 측색 시스템에서 제공하는 기초 데이터 외에 원단 특성 데이터 및 염료 특성 데이터를 기반으로 학습 데이터셋을 생성하고, 그 학습 데이터셋을 기반으로 염료배합비율을 보정함으로써, B/T 테스트, 실험염색, 현장 벌크 염색 등에서 수차례 반복적으로 시행 되는 염색과 CCM 측색, 및 염료배합비율 보정에 대한 시행 착오를 현저히 줄일 수 있다. 본 발명은 도면에 도시된 실시 예를 참고로 하여 설명되었으나, 이는 예시적인 것에 불과하며, 당해 기술이 속 하는 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해 할 것이다. 따라서 본 발명의 기술적 보호범위는 아래의 특허청구범위에 의해서 정하여져야 할 것이다."}
{"patent_id": "10-2022-0163796", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 염료배합비율 보정 장치를 설명하기 위한 블록 구성도이다. 도 2는 본 발명의 일 실시예에 따른 염료배합비율을 보정하는 방법을 설명하기 위한 예시도이다. 도 3은 본 발명의 일 실시예에 따른 염료배합비율 보정 방법을 설명하기 위한 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 학습 데이터셋을 생성하는 방법을 설명하기 위한 흐름도이다. 도 5는 본 발명의 일 실시예에 따른 염색오더 수신 시 염료배합비율을 보정하는 방법을 설명하기 위한 흐름도이 다."}
