{"patent_id": "10-2022-0076272", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0174977", "출원번호": "10-2022-0076272", "발명의 명칭": "신경망 기반 이미지 압축 방법", "출원인": "성균관대학교산학협력단", "발명자": "류은석"}}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "신경망 기반 이미지 압축 모델을 학습하는 방법에 있어서,학습 대상 이미지를 입력 받는 단계;가중치 파라미터를 포함하여 구성된 상기 신경망 기반 이미지 압축 모델을 통해 상기 입력 받은 이미지를 부호화하고, 상기 부호화한 이미지를 상기 신경망 기반 이미지 압축 모델을 통해 복호화하는 단계;상기 신경망 기반 이미지 압축 모델의 네트워크 모델 가중치에 대한 엔트로피 추정 값을 산출하는 단계;상기 학습 대상 이미지 및 상기 복호화된 이미지의 화질을 비교하여 복원 성능 수치를 산출하는 단계; 및상기 네트워크 모델 가중치에 대한 엔트로피 추정 값 및 상기 복원 성능 수치에 기반하여 상기 신경망 기반 이미지 압축 모델의 상기 가중치 파라미터를 업데이트함으로써 상기 신경망 기반 이미지 압축 모델을 학습시키는단계를 포함하는, 이미지 압축 모델을 학습하는 방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 네트워크 모델 가중치에 대한 엔트로피 추정 값은 최소화되도록 유도되는, 이미지 압축 모델을 학습하는방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 네트워크 모델 가중치에 대한 엔트로피 추정 값의 최소화에는 균등 분포를 추가한 대체 함수가 사용되는,이미지 압축 모델을 학습하는 방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 균등 분포를 추가한 대체 함수는 근사치 추정 방법으로 -0.5~0.5 범위의 균등 분포를 상기 네트워크 모델가중치에 추가한 것인, 이미지 압축 모델을 학습하는 방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 신경망 기반 이미지 압축 모델의 상기 가중치 파라미터의 업데이트는, 상기 네트워크 모델 가중치에 대한엔트로피 추정 값을 파라미터를 통해 조절하여 수행되는, 이미지 압축 모델을 학습하는 방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "신경망 기반 이미지 압축 모델을 학습하는 방법을 이용한 부호화 방법에 있어서,인코더가 압축 대상 이미지를 입력 받는 단계; 및상기 인코더가 상기 신경망 기반 이미지 압축 모델을 통해 상기 입력 받은 압축 대상 이미지를 부호화하여 스트리밍 데이터를 생성하는 단계;를 포함하고,상기 신경망 기반 이미지 압축 모델은,학습 대상 이미지를 입력 받고, 가중치 파라미터를 포함하여 구성된 상기 신경망 기반 이미지 압축 모델을 통해상기 학습 대상 이미지를 부호화하고, 상기 부호화한 이미지를 상기 신경망 기반 이미지 압축 모델을 통해 복호공개특허 10-2023-0174977-3-화하고, 상기 신경망 기반 이미지 압축 모델의 네트워크 모델 가중치에 대한 엔트로피 추정 값을 산출하고, 상기 학습 대상 이미지 및 상기 복호화된 이미지의 화질을 비교하여 복원 성능 수치를 산출하고, 상기 네트워크모델 가중치에 대한 엔트로피 추정 값 및 상기 복원 성능 수치에 기반하여 상기 신경망 기반 이미지 압축 모델의 상기 가중치 파라미터를 업데이트함으로써 학습된 모델인 것을 특징으로 하는 부호화 방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 신경망 기반 이미지 압축 모델은,상기 네트워크 모델 가중치에 대한 엔트로피 추정 값은 최소화되도록 유도되고, 상기 네트워크 모델 가중치에대한 엔트로피 추정 값의 최소화에는 균등 분포를 추가한 대체 함수가 사용되고, 상기 균등 분포를 추가한 대체함수는 근사치 추정 방법으로 -0.5~0.5 범위의 균등 분포를 상기 네트워크 모델 가중치에 추가한 것인, 부호화방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 신경망 기반 이미지 압축 모델의 상기 가중치 파라미터의 업데이트는, 상기 네트워크 모델 가중치에 대한엔트로피 추정 값을 파라미터를 통해 조절하여 수행되는, 부호화 방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "신경망 기반 이미지 압축 모델을 학습하는 방법을 이용한 복호화 방법에 있어서,디코더가 인코더를 통해 부호화된 스트리밍 데이터를 입력 받는 단계; 및상기 디코더가 상기 신경망 기반 이미지 압축 모델을 통해 상기 스트리밍 데이터를 복호화하는 단계;를 포함하고,상기 신경망 기반 이미지 압축 모델은,학습 대상 이미지를 입력 받고, 가중치 파라미터를 포함하여 구성된 상기 신경망 기반 이미지 압축 모델을 통해상기 학습 대상 이미지를 부호화하고, 상기 부호화한 이미지를 상기 신경망 기반 이미지 압축 모델을 통해 복호화하고, 상기 신경망 기반 이미지 압축 모델의 네트워크 모델 가중치에 대한 엔트로피 추정 값을 산출하고, 상기 학습 대상 이미지 및 상기 복호화된 이미지의 화질을 비교하여 복원 성능 수치를 산출하고, 상기 네트워크모델 가중치에 대한 엔트로피 추정 값 및 상기 복원 성능 수치에 기반하여 상기 신경망 기반 이미지 압축 모델의 상기 가중치 파라미터를 업데이트함으로써 학습된 모델인 것을 특징으로 하는 복호화 방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 신경망 기반 이미지 압축 모델은,상기 네트워크 모델 가중치에 대한 엔트로피 추정 값은 최소화되도록 유도되고, 상기 네트워크 모델 가중치에대한 엔트로피 추정 값의 최소화에는 균등 분포를 추가한 대체 함수가 사용되고, 상기 균등 분포를 추가한 대체함수는 근사치 추정 방법으로 -0.5~0.5 범위의 균등 분포를 상기 네트워크 모델 가중치에 추가한 것인, 복호화방법."}
{"patent_id": "10-2022-0076272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 신경망 기반 이미지 압축 모델의 상기 가중치 파라미터의 업데이트는, 상기 네트워크 모델 가중치에 대한엔트로피 추정 값을 파라미터를 통해 조절하여 수행되는, 복호화 방법."}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개시된 실시 예에 따른 신경망 기반 이미지 압축 모델을 학습하는 방법은, 학습 대상 이미지를 입력 받는 단계; 가중치 파라미터를 포함하여 구성된 상기 신경망 기반 이미지 압축 모델을 통해 상기 입력 받은 이미지를 부호화 하고, 상기 부호화한 이미지를 상기 신경망 기반 이미지 압축 모델을 통해 복호화하는 단계; 상기 신경망 기반 이미지 압축 모델의 네트워크 모델 가중치에 대한 엔트로피 추정 값을 산출하는 단계; 상기 학습 대상 이미지 및 상기 복호화된 이미지의 화질을 비교하여 복원 성능 수치를 산출하는 단계; 및 상기 네트워크 모델 가중치에 대 한 엔트로피 추정 값 및 상기 복원 성능 수치에 기반하여 상기 신경망 기반 이미지 압축 모델의 상기 가중치 파 라미터를 업데이트함으로써 상기 신경망 기반 이미지 압축 모델을 학습시키는 단계를 포함할 수 있다. 이에 따라, 신경망 기반 이미지 압축 모델의 가중치의 크기를 최소화할 수 있다."}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 신경망 기반 이미지 압축 방법에 관한 것으로, 보다 구체적으로는 인공 신경망 학습 과정에서 이미지 복원 성능과 네트워크 모델 가중치의 추정 엔트로피를 함께 반영하여 이미지 압축 모델 가중치를 업데이트하는 신경망 기반 이미지 압축 방법에 관한 것이다."}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이미지 압축은 멀티미디어 및 신호처리 분야의 주요 기술 주제 중 하나이다. 기본적인 이미지 압축 알고리즘은 공간적 중복성을 제거하기 위해 주파수 변환, 양자화, 엔트로피 부호화 과정 등을 수행한다. 예를 들어, 대표적 인 이미지 코덱인 JPEG에서는 이산 코사인 변환(discrete cosine transform)을 사용하여 이미지를 압축한다. 기존의 이미지 및 동영상 코덱 기술에 대해서는 표준화와 최적화가 진행되어져 왔으며, 최근에는 인공지능 기반 의 이미지 압축 기술이 주목받고 있는 실정이다. 데이터 중심의 학습 모델을 통해 효율적인 압축 코덱을 설계하 고자 하는 시도가 계속되고 있으며, 대표적인 심층 이미지 압축 모델로는 오토인코더(auto-encoder)를 기반으로 하는 모델을 들 수 있다. 일반적인 신경망 기반 이미지 압축 방법은 미리 학습된 모델의 가중치가 전송되어야 압축과 복원의 수행이 가능 하다. 이에, 학습된 모델의 가중치를 미리 전송하는 과정이 필수적이나 전송할 가중치의 크기가 문제된다. 인공 신경망의 학습 과정에서 신경망 가중치의 수정 시에 가중치 크기를 최소화할 수 있는 방안이 요구된다."}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 바와 같은 종래 기술의 문제점을 해결하기 위한 것으로서, 인공 신경망 학습 과정에서 이미지 복원 성능과 네트워크 모델 가중치의 추정 엔트로피를 함께 반영하여 이미지 압축 모델 가중치를 업데이트함으 로써 이미지 압축 모델 가중치를 최소화하는 신경망 기반 이미지 압축 방법을 제공하는 것이다."}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 해결하기 위하여, 개시된 실시 예에 따른 신경망 기반 이미지 압축 모델을 학습하는 방법은, 학습 대상 이미지를 입력 받는 단계; 가중치 파라미터를 포함하여 구성된 상기 신경망 기반 이미지 압 축 모델을 통해 상기 입력 받은 이미지를 부호화하고, 상기 부호화한 이미지를 상기 신경망 기반 이미지 압축 모델을 통해 복호화하는 단계; 상기 신경망 기반 이미지 압축 모델의 네트워크 모델 가중치에 대한 엔트로피 추 정 값을 산출하는 단계; 상기 학습 대상 이미지 및 상기 복호화된 이미지의 화질을 비교하여 복원 성능 수치를 산출하는 단계; 및 상기 네트워크 모델 가중치에 대한 엔트로피 추정 값 및 상기 복원 성능 수치에 기반하여 상 기 신경망 기반 이미지 압축 모델의 상기 가중치 파라미터를 업데이트함으로써 상기 신경망 기반 이미지 압축 모델을 학습시키는 단계를 포함할 수 있다. 개시된 실시 예에 따른 이미지 압축 모델을 학습하는 방법은, 상기 네트워크 모델 가중치에 대한 엔트로피 추정 값은 최소화되도록 유도될 수 있다. 개시된 실시 예에 따른 이미지 압축 모델을 학습하는 방법은, 상기 네트워크 모델 가중치에 대한 엔트로피 추정 값의 최소화에는 균등 분포를 추가한 대체 함수가 사용될 수 있다. 개시된 실시 예에 따른 이미지 압축 모델을 학습하는 방법은, 상기 균등 분포를 추가한 대체 함수는 근사치 추 정 방법으로 -0.5~0.5 범위의 균등 분포를 상기 네트워크 모델 가중치에 추가할 수 있다. 개시된 실시 예에 따른 이미지 압축 모델을 학습하는 방법은, 상기 신경망 기반 이미지 압축 모델의 가중치 파 라미터를 업데이트하는 단계는, 상기 네트워크 모델 가중치에 대한 엔트로피 추정 값을 파라미터를 통해 조절하 여 수행될 수 있다."}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 실시 예에 따른 신경망 기반 이미지 압축 방법은 다음과 같은 효과를 제공한다. 신경망 기반 이미지 압축 모델의 가중치 수정 시에 기준이 되는 손실 함수(loss function)에 네트워크 모델 가 중치의 엔트로피 값을 추가하여 이미지 압축 모델의 가중치의 크기를 최소화할 수 있다."}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 대해서 실시예 및 도면을 참조하여 구체적으로 설명한다. 그러나, 이하의 설명은 본 발명을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 도 1은 개시된 실시 예에서, 이미지 압축 프레임워크를 나타낸 도면이다. 개시된 실시 예에서, 신경망 기반 이미지 압축 모델의 가중치 파라미터에 대한 업데이트는 원본 대상 이미지와 복호화된 최종 이미지 간의 화질을 비교하여 이루어지되, 네트워크 모델 가중치에 대한 추정 엔트로피 또한 반 영될 수 있다. 도 2는 개시된 실시 예에서, 이미지 압축 모델의 인코딩 및 디코딩 구조를 도시한 도면이다. 개시된 실시 예에서, 학습이 완료된 후, 산술 부호화기를 이용하여 네트워크 가중치를 압축하고, 이진 비트스트 림으로 전송, 이를 다시 복호화하여 다층 퍼셉트론(multilayer perceptron)의 가중치로 사용함으로써 압축된 이 미지의 전송과 복원이 이루어질 수 있다. 이 경우, 컨볼루션 기반 압축 모델과 달리 각 개별의 이미지에 과적합 된 네트워크의 가중치를 압축하여 전송하는 형태가 된다. 도 3은 개시된 실시 예에서, 이미지 압축 네트워크 모델을 개념적으로 도시한 도면이다. 이미지 압축 모델의 가중치 파라미터의 업데이트는 원본 대상 이미지와 복호화된 최종 이미지 간의 화질을 비교 하여 이루어지고, 하기와 같은 손실 함수가 사용된다. 수학식 1"}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, x, y는 이미지의 좌표 값에 해당하며, f는 신경망으로 복원된 이미지(즉, 복호화된 이미지), I는 원본 이미지를 의미한다. 입력된 원본 이미지와 복원 이미지 간의 평균 제곱 오차(mean squared error) 또는 최대 신 호 대 잡음 비(peak signal-to-noise ratio, PSNR)를 통해 복원 화질 성능을 측정한다. 다시 도 3을 참조하면, 개시된 실시 예에서, 이미지 압축 네트워크 모델은 이미지 좌표 값 x, y를 입력 받아 RGB(색상) 값을 출력할 수 있다. 여기서, 네트워크 모델의 가중치를 θ라고 하면, 상기 가중치의 엔트로피는 하 기와 같이 나타낼 수 있다.수학식 2"}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "네트워크 모델 가중치 θ는 행렬 값을 가진다. 개시된 실시 예에서, 네트워크 모델의 압축 방법으로 산술 부호화(arithmetic coding)가 사용될 수 있다. 산술 부호화는 엔트로피 인코딩으로 심볼의 엔트로피 값이 낮을수록 보다 적은 수의 비트스트림으로 전체를 표현할 수 있으므로 네트워크 모델 가중치 θ의 엔트로피 값을 낮추는 것이 바람직하다. 네트워크 모델의 가중치 엔트로피 I(θ)를 상기 수식을 통해 계산하여 신경망 학습 과정에서 최소화되도록 유도 할 경우 네트워크 모델의 가중치 행렬 θ는 이산 값을 가지므로 학습 과정에서 미분 값이 제대로 전파되지 않아 학습 과정이 원하는 대로 수행되지 못하게 된다. 개시된 실시 예에서, 이산 값의 완화를 위해 균등 분포를 추가 한 대체 함수를 사용하여 상기 가중치 엔트로피를 최소화할 수 있다. 균등 분포를 추가한 대체 함수는 하기와 같다. 수학식 3"}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "개시된 실시 예에서, 균등 분포를 추가한 대체 함수는 근사치 추정 방법으로 -0.5~0.5 범위의 균등 분포를 네트 워크 모델 가중치에 추가한 것일 수 있다. 균등 분포를 추가한 대체 함수를 사용한 네트워크 모델의 가중치 엔트로피는 하기와 같이 표현된다. 수학식 4"}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이를 통해 엔트로피 계산에 난점이었던 실수 값 가중치에 대한 엔트로피 추정이 가능하게 된다. 상기 식을 이미 지 복원 성능 손실 함수와 함께 이미지 압축 모델의 가중치 파라미터의 업데이트에 반영하면 다음과 같다. 수학식 5"}
{"patent_id": "10-2022-0076272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "개시된 실시 예의 최종 손실 함수는 상기 수학식 5와 같으며, 이미지 복원 성능이 높으면서도 네트워크 모델 가 중치의 엔트로피가 최소화되도록 신경망 기반 이미지 압축 모델의 가중치 파라미터가 업데이트될 수 있다. 개시된 실시 예에서, 네트워크 모델 가중치에 대한 엔트로피 추정 값은 조절 파라미터 λ를 통해 조절될 수 있 으며 이와 같이 조절된 엔트로피 추정 값이 이미지 압축 모델의 가중치 파라미터의 업데이트에 반영될 수 있다. 조절 파라미터 λ를 변화시키면서 압축된 모델의 크기와 모델 성능의 트레이드오프의 관찰이 가능하다. 도 4는 개시된 실시 예에서, Kodak 이미지 데이터셋에 대한 모델 별 비율-왜곡(rate-distortion)을 비교한 그래 프이다.개시된 실시 예에 따른 신경망 기반 이미지 압축 방법은 다층 퍼셉트론(MLP) 기반 이미지 압축 모델 및 합성곱 신경망(CNN) 기반 이미지 압축 모델에 사용 가능하다. 기존의 다층 퍼셉트론(MLP) 기반 이미지 압축 모델은 경 량화된 모델 사이즈에도 합성곱 신경망(CNN) 기반 이미지 압축 모델보다 성능이 낮았으나 개시된 실시 예의 신 경망 기반 이미지 압축 방법을 적용하면 기존의 합성곱 신경망(CNN) 기반 이미지 압축 모델과도 경쟁할 만한 성 능을 보이는 것을 확인할 수 있다. 도 5는 개시된 실시 예에서, 엔트로피 추정 값 조절 파라미터 변화에 따른 엔트로피 및 복원 화질 성능 지표 (PSNR)를 나타낸 그래프들이다. 조절 파라미터 λ 값을 증가시키는 경우, 학습 과정에서 네트워크 모델 가중치 엔트로피의 최소화가 더 급격하 게 진행되고 최종 학습 완료 후에도 낮은 엔트로피를 가지긴 하지만, 복원 화질과 관련된 성능은 하락하는 것을 확인할 수 있다. 도 6은 개시된 실시 예에 따른 신경망 기반 이미지 압축 방법의 플로우차트이다. 개시된 실시 예에 따른 신경망 기반 이미지 압축 방법은, 압축 대상 이미지를 입력 받는 단계(S610); 신경망 기 반 이미지 압축 모델을 통해 상기 입력 받은 이미지를 부호화하고, 상기 부호화한 이미지를 상기 신경망 기반 이미지 압축 모델을 통해 복호화하는 단계(S620); 네트워크 모델 가중치에 대한 엔트로피 추정 값을 산출하는 단계(S630); 상기 압축 대상 이미지 및 상기 복호화된 이미지의 화질을 비교하여 복원 성능 수치를 산출하는 단 계(S640); 및 상기 네트워크 모델 가중치에 대한 엔트로피 추정 값 및 상기 복원 성능 수치에 기반하여 상기 신 경망 기반 이미지 압축 모델의 가중치 파라미터를 업데이트하는 단계(S650)를 포함할 수 있다. 이에 따라, 신경망 기반 이미지 압축 모델의 가중치 수정 시에 기준이 되는 손실 함수에 네트워크 모델 가중치 의 엔트로피 값을 추가하여 이미지 압축 모델의 가중치의 크기를 최소화할 수 있게 된다. 또한, 다시 도 2를 참조하면, 개시된 실시 예의 부호화 방법은, 인코더가 압축 대상 이미지를 입력 받는 단계 및 인코더가 신경망 기반 이미지 압축 모델을 통해 입력 받은 압축 대상 이미지를 부호화하여 스트리밍 데이터 를 생성하는 단계를 포함할 수 있고, 개시된 실시 예의 복호화 방법은, 디코더가 인코더를 통해 부호화된 스트 리밍 데이터를 입력 받는 단계 및 디코더가 신경망 기반 이미지 압축 모델을 통해 스트리밍 데이터를 복호화하 는 단계를 포함할 수 있으며, 개시된 실시 예의 학습된 신경망 기반 이미지 압축 모델이 사용될 수 있다. 한편, 본 발명의 실시예들은 컴퓨터로 읽을 수 있는 기록 매체에 컴퓨터가 읽을 수 있는 코드로 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록 매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록 장치를 포함한다. 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있으며, 또한 캐리어 웨이브(예를 들어 인터넷을 통한 전송)의 형태로 구현하는 것을 포함한다. 또한, 컴 퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산 방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고 본 발명을 구현하기 위한 기능적인(functional) 프로그램, 코 드 및 코드 세그먼트들은 본 발명이 속하는 기술 분야의 프로그래머들에 의하여 용이하게 추론될 수 있다. 다양한 변형예가 본 발명의 범위를 벗어남이 없이 본 명세서에 기술되고 예시된 구성 및 방법으로 만들어질 수 있으므로, 상기 상세한 설명에 포함되거나 첨부 도면에 도시된 모든 사항은 예시적인 것으로 본 발명을 제한하 기 위한 것이 아니다. 따라서, 본 발명의 범위는 상술한 예시적인 실시예에 의해 제한되지 않으며, 이하의 청구 범위 및 그 균등물에 따라서만 정해져야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2022-0076272", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 개시된 실시 예에서, 이미지 압축 프레임워크를 나타낸 도면이다. 도 2는 개시된 실시 예에서, 이미지 압축 모델의 인코딩 및 디코딩 구조를 도시한 도면이다. 도 3은 개시된 실시 예에서, 이미지 압축 네트워크 모델을 개념적으로 도시한 도면이다. 도 4는 개시된 실시 예에서, Kodak 이미지 데이터셋에 대한 모델 별 비율-왜곡(rate-distortion)을 비교한 그래 프이다. 도 5는 개시된 실시 예에서, 엔트로피 추정 값 조절 파라미터 변화에 따른 엔트로피 및 복원 화질 성능 지표 (PSNR)를 나타낸 그래프들이다. 도 6은 개시된 실시 예에 따른 신경망 기반 이미지 압축 방법의 플로우차트이다."}
