{"patent_id": "10-2022-0129119", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0049048", "출원번호": "10-2022-0129119", "발명의 명칭": "엣지 CCTV를 위한 엣지 AI 모델 생성 방법 및 시스템", "출원인": "한국전자기술연구원", "발명자": "양창모"}}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터에 의해 수행되는 방법에 있어서,복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV로부터 분석된 제1 CCTV 영상 분석 결과를 수신하는 단계;상기 제1 CCTV 영상 분석 결과를 대상으로 영상 분석 AI 모델을 이용하여 제2 CCTV 영상 분석 결과를 생성하는단계;상기 제1 CCTV 영상 분석 결과에 상응하는 이벤트 발생 시간 정보, 비디오 클립 및 상기 제2 영상 분석 결과를기반으로 학습 데이터 셋을 생성하는 단계; 및상기 학습 데이터 셋을 기반으로 상기 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하는 단계를 포함하는,엣지 CCTV를 위한 엣지 AI 모델 생성 방법."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV로부터 분석된 제1 CCTV 영상 분석 결과를 수신하는 단계는,상기 엣지 CCTV로부터 객체 탐지 결과 및 소정의 이벤트 탐지 결과 중 적어도 하나를 포함하는 제1 CCTV 영상분석 결과를 수신하는 것인,엣지 CCTV를 위한 엣지 AI 모델 생성 방법."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 CCTV 영상 분석 결과에 상응하는 객체 및 이벤트 발생 시간 정보, 비디오 클립 및 상기 제2 영상 분석결과를 기반으로 학습 데이터 셋을 생성하는 단계는,상기 제2 영상 분석 결과를 GT(Ground Truth) 정보로 설정하여 상기 학습 데이터 셋을 생성하는 것인,엣지 CCTV를 위한 엣지 AI 모델 생성 방법."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 학습 데이터 셋을 기반으로 상기 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하는 단계는,기 설정된 시간 정보를 만족하는 경우 및 상기 학습 데이터 셋의 크기가 소정의 크기 이상을 만족하는 경우 중적어도 하나를 만족시 상기 엣지 AI 모델을 학습 및 생성하는 것인,엣지 CCTV를 위한 엣지 AI 모델 생성 방법."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2024-0049048-3-복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV에 적용할 엣지 AI 모델을 검색 및 선택하는 단계; 및상기 선택된 엣지 AI 모델을 엣지 CCTV에 배포하는 단계를 더 포함하는,엣지 CCTV를 위한 엣지 AI 모델 생성 방법."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV에 적용할 엣지 AI 모델을 검색 및 선택하는 단계는,상기 엣지 AI 모델의 분석 기능 및 설치 크기 정보에 기초하여 상기 엣지 CCTV에 적용할 엣지 AI 분석 모델을검색 및 선택하는 것인,엣지 CCTV를 위한 엣지 AI 모델 생성 방법."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "복수의 엣지 CCTV와 데이터를 송수신하는 통신부,상기 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하기 위한 프로그램이 저장된 메모리 및상기 메모리에 저장된 프로그램을 실행시킴에 따라, 상기 통신부를 통해 상기 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV로부터 분석된 제1 CCTV 영상 분석 결과를 수신하면, 상기 제1 CCTV 영상 분석 결과를 영상 분석AI 모델에 입력하여 제2 CCTV 영상 분석 결과를 생성하고, 상기 제1 CCTV 영상 분석 결과에 상응하는 이벤트 발생 시간 정보, 비디오 클립 및 상기 제2 영상 분석 결과를 기반으로 학습 데이터 셋을 구성한 후, 상기 학습 데이터 셋을 기반으로 상기 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하는 프로세서를 포함하는,엣지 CCTV를 위한 엣지 AI 모델 생성 시스템."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는 상기 엣지 CCTV로부터 객체 탐지 결과 및 소정의 이벤트 탐지 결과 중 적어도 하나를 포함하는제1 CCTV 영상 분석 결과를 수신하는 것인,엣지 CCTV를 위한 엣지 AI 모델 생성 시스템."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 프로세서는 상기 제2 영상 분석 결과를 GT(Ground Truth) 정보로 설정하여 상기 학습 데이터 셋을 생성하는 것인,엣지 CCTV를 위한 엣지 AI 모델 생성 시스템."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 프로세서는 기 설정된 시간 정보를 만족하는 경우 및 상기 학습 데이터 셋의 크기가 소정의 크기 이상을만족하는 경우 상기 엣지 AI 모델을 학습 및 생성하는 것인,공개특허 10-2024-0049048-4-엣지 CCTV를 위한 엣지 AI 모델 생성 시스템."}
{"patent_id": "10-2022-0129119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 프로세서는 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV에 적용할 엣지 AI 모델을 상기 엣지 AI 모델의분석 기능 및 설치 크기 정보에 기초하여 검색 및 선택하고, 상기 선택된 엣지 AI 모델을 엣지 CCTV에 배포하는것인,엣지 CCTV를 위한 엣지 AI 모델 생성 시스템."}
{"patent_id": "10-2022-0129119", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "엣지 CCTV를 위한 엣지 AI 모델 생성 방법이 제공된다. 상기 방법은 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV로부터 분석된 제1 CCTV 영상 분석 결과를 수신하는 단계; 상기 제1 CCTV 영상 분석 결과를 대상으로 영상 분석 AI 모델을 이용하여 제2 CCTV 영상 분석 결과를 생성하는 단계; 상기 제1 CCTV 영상 분석 결과에 상응하는 이벤트 발생 시간 정보, 비디오 클립 및 상기 제2 영상 분석 결과를 기반으로 학습 데이터 셋을 생성하는 단계; 및 상기 학습 데이터 셋을 기반으로 상기 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하는 단계를 포함한다."}
{"patent_id": "10-2022-0129119", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 엣지 CCTV를 위한 엣지 AI 모델 생성 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0129119", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래의 영상보안 서비스에서는 영상분석 기능이 탑재되지 않은 CCTV가 주로 사용되었다. 즉, 종래의 영상보안 서비스에서는 CCTV가 촬영한 영상을 VMS(Video Management System) 관제 센터에 전송하면, VMS 관제 센터에서 영상분석을 수행하는 방법이 주로 사용되었다. 그러나, 상기와 같은 종래 기술에서는 CCTV의 수량이 증가함에 따라 VMS 관제 센터의 영상분석을 위한 서버 구 축 비용이 지속적으로 증가하게 되는 문제점이 있다. 이러한 문제점을 개선하기 위해, 최근에는 엣지 모듈이 CCTV에 탑재된 엣지 CCTV를 영상보안 서비스에 활용하는 방법들이 연구되고 있다. 엣지 CCTV를 활용하는 영상보안 서비스에서는 CCTV에 탑재된 엣지 모듈에서 영상분석을 수행한 후, 그 결과를 VMS 관제 센터에 전송함으로써 VMS 관제 센터의 영상분석에 대한 부담을 덜어주는 방법이 사용된다. 하지만, 현 재의 엣지 CCTV의 경우, 엣지 모듈에 영상분석을 위한 엣지 AI 모델이 한번 탑재되면 탑재된 AI 모델을 변경하 거나 수정하지 못하는 문제점이 있다. 또한, 최근에는 상기와 같은 문제점을 해소하고자 영상분석 이벤트 또는 날씨 환경에 따라 다수의 엣지 AI 모델 을 생성한 후, 영상분석 이벤트 또는 날씨 환경에 최적화된 엣지 AI 모델을 엣지 CCTV에 적용하기 위한 기술들 이 연구되고 있다. 그러나, 상기와 같은 방법들은 설치된 엣지 CCTV별로 최적화된 엣지 AI 모델이 생성 및 적용되지 못하는 문제점 이 있다. 따라서, 특정 위치에 설치된 엣지 CCTV별로 최적화된 엣지 AI 모델을 자동으로 생성하고, CCTV에 대한 엣지 AI 모델을 자동으로 업데이트하는 기술이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10- 2021-0096405호 (2021.08.05)"}
{"patent_id": "10-2022-0129119", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 엣지 CCTV의 영상 분석 결과와 VMS에서의 정밀 영상 분석 결과를 기반으로 엣지 CCTV를 위 한 학습 데이터 셋과 엣지 AI 모델을 자동으로 생성하고, 생성된 최적의 엣지 AI 모델을 엣지 CCTV에 탑재하는, 엣지 CCTV를 위한 엣지 AI 모델 생성 방법 및 시스템을 제공한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기 술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0129119", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 제1 측면에 따른 엣지 CCTV를 위한 엣지 AI 모델 생성 방법은 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV로부터 분석된 제1 CCTV 영상 분석 결과를 수신 하는 단계; 상기 제1 CCTV 영상 분석 결과를 대상으로 영상 분석 AI 모델을 이용하여 제2 CCTV 영상 분석 결과 를 생성하는 단계; 상기 제1 CCTV 영상 분석 결과에 상응하는 이벤트 발생 시간 정보, 비디오 클립 및 상기 제2 영상 분석 결과를 기반으로 학습 데이터 셋을 생성하는 단계; 및 상기 학습 데이터 셋을 기반으로 상기 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하는 단계를 포함한다. 본 발명의 일부 실시예에 있어서, 상기 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV로부터 분석된 제1 CCTV 영상 분석 결과를 수신하는 단계는, 상기 엣지 CCTV로부터 객체 탐지 결과 및 소정의 이벤트 탐지 결과 중 적어 도 하나를 포함하는 제1 CCTV 영상 분석 결과를 수신할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 제1 CCTV 영상 분석 결과에 상응하는 객체 및 이벤트 발생 시간 정보, 비디오 클립 및 상기 제2 영상 분석 결과를 기반으로 학습 데이터 셋을 생성하는 단계는, 상기 제2 영상 분석 결과를 GT(Ground Truth) 정보로 설정하여 상기 학습 데이터 셋을 생성할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 학습 데이터 셋을 기반으로 상기 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하는 단계는, 기 설정된 시간 정보를 만족하는 경우 및 상기 학습 데이터 셋의 크기가 소정의 크기 이상 을 만족하는 경우 중 적어도 하나를 만족시 상기 엣지 AI 모델을 학습 및 생성할 수 있다. 본 발명의 일부 실시예는, 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV에 적용할 엣지 AI 모델을 검색 및 선 택하는 단계; 및 상기 선택된 엣지 AI 모델을 엣지 CCTV에 배포하는 단계를 더 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV에 적용할 엣지 AI 모델을 검색 및 선택하는 단계는, 상기 엣지 AI 모델의 분석 기능 및 설치 크기 정보에 기초하여 상기 엣지 CCTV에 적 용할 엣지 AI 분석 모델을 검색 및 선택할 수 있다. 또한, 본 발명의 제2 측면에 따른 엣지 CCTV를 위한 엣지 AI 모델 생성 시스템은 복수의 엣지 CCTV와 데이터를 송수신하는 통신부, 상기 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하기 위한 프로그램이 저장된 메모리 및 상기 메모리에 저장된 프로그램을 실행시킴에 따라, 상기 통신부를 통해 상기 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV로부터 분석된 제1 CCTV 영상 분석 결과를 수신하면, 상기 제1 CCTV 영상 분석 결과를 영상 분 석 AI 모델에 입력하여 제2 CCTV 영상 분석 결과를 생성하고, 상기 제1 CCTV 영상 분석 결과에 상응하는 이벤트 발생 시간 정보, 비디오 클립 및 상기 제2 영상 분석 결과를 기반으로 학습 데이터 셋을 구성한 후, 상기 학습 데이터 셋을 기반으로 상기 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하는 프로세서를 포함한다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는 상기 엣지 CCTV로부터 객체 탐지 결과 및 소정의 이벤트 탐 지 결과 중 적어도 하나를 포함하는 제1 CCTV 영상 분석 결과를 수신할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는 상기 제2 영상 분석 결과를 GT(Ground Truth) 정보로 설정하 여 상기 학습 데이터 셋을 생성할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는 기 설정된 시간 정보를 만족하는 경우 및 상기 학습 데이터 셋의 크기가 소정의 크기 이상을 만족하는 경우 상기 엣지 AI 모델을 학습 및 생성할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 프로세서는 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV에 적용할 엣 지 AI 모델을 상기 엣지 AI 모델의 분석 기능 및 설치 크기 정보에 기초하여 검색 및 선택하고, 상기 선택된 엣 지 AI 모델을 엣지 CCTV에 배포할 수 있다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2022-0129119", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 일 실시예에 의하면, 각각의 엣지 CCTV의 설치환경 등을 고려한 최적화된 엣지 AI 모델을 자 동 생성할 수 있으며, 해당 엣지 CCTV로부터 획득된 분석 결과를 기반으로 엣지 AI 모델을 학습시킴으로써 모델 성능을 점차적으로 향상시킬 수 있다. 이를 통해, 엣지 CCTV 기반 영상보안 서비스를 이용한 범죄 등에 대한 빠른 추적 및 대응이 가능하다는 장점이 있다."}
{"patent_id": "10-2022-0129119", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0129119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하에서는 도 1을 참조하여 본 발명의 일 실시예에 따른 엣지 CCTV를 위한 엣지 AI 모델 생성 시스템에 대해 설명하도록 한다. 도 1은 본 발명의 일 실시예에 따른 엣지 AI 모델 생성 시스템의 구성을 도시한 블록도이다. 본 발명의 일 실시예에 따른 엣지 AI 모델 생성 시스템는 입력부, 통신부, 표시부, 메모리 및 프로세서를 포함한다. 이때, 본 발명에서의 엣지 AI 모델 생성 시스템은 VMS일 수 있다. 입력부는 엣지 AI 모델 생성 시스템의 사용자 입력에 대응하여 입력데이터를 발생시킨다. 이때, 사용 자 입력은 CCTV에 대한 엣지 AI 모델의 검색 및 선택 입력, 그밖에 종료 등의 제어 입력을 포함할 수 있다. 입력부는 적어도 하나의 입력수단을 포함한다. 입력부는 키보드(key board), 키패드(key pad), 돔 스 위치(dome switch), 터치패널(touch panel), 터치 키(touch key), 마우스(mouse), 메뉴 버튼(menu button) 등 을 포함할 수 있다. 통신부는 복수 개의 CCTV와 데이터를 송수신하며, 그밖에 데이터를 송수신하기 위해 서버나 데이터 수집 장치 등 외부장치와의 통신을 수행한다. 이와 같은 통신부는 유선 통신 모듈 및 무선 통신 모듈을 모두 포 함할 수 있다. 유선 통신 모듈은 전력선 통신 장치, 전화선 통신 장치, 케이블 홈(MoCA), 이더넷(Ethernet), IEEE1294, 통합 유선 홈 네트워크 및 RS-485 제어 장치로 구현될 수 있다. 또한, 무선 통신 모듈은 WLAN(wireless LAN), Bluetooth, HDR WPAN, UWB, ZigBee, Impulse Radio, 60GHz WPAN, Binary-CDMA, 무선 USB 기술 및 무선 HDMI 기술, 그밖에 5G(5th generation communication), LTE-A(long term evolution-advanced), LTE(long term evolution), Wi-Fi(wireless fidelity) 등의 기능을 구현하기 위한 모듈로 구성될 수 있다. 표시부는 엣지 AI 모델 생성 시스템의 동작에 따른 표시 데이터를 표시한다. 일 예로 표시부는 복수의 CCTV에 대한 정보, 각 CCTV에 상응하는 엣지 AI 모델의 목록, 각 엣지 AI 모델의 정보 및 학습 데이터 셋의 구성 정보 등을 화면 상에 표시할 수 있다. 표시부는 액정 디스플레이(LCD; liquid crystal display), 발광 다이오드(LED; light emitting diode) 디 스플레이, 유기 발광 다이오드(OLED; organic LED) 디스플레이, 마이크로 전자기계 시스템(MEMS; micro electro mechanical systems) 디스플레이 및 전자 종이(electronic paper) 디스플레이를 포함한다. 표시부 는 입력부와 결합되어 터치 스크린(touch screen)으로 구현될 수 있다. 메모리는 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성하기 위한 프로그램들을 저장한다. 여기에서, 메 모리는 전원이 공급되지 않아도 저장된 정보를 계속 유지하는 비휘발성 저장장치 및 휘발성 저장장치를 통 칭하는 것이다. 예를 들어, 메모리는 콤팩트 플래시(compact flash; CF) 카드, SD(secure digital) 카드, 메모리 스틱(memory stick), 솔리드 스테이트 드라이브(solid-state drive; SSD) 및 마이크로(micro) SD 카드 등과 같은 낸드 플래시 메모리(NAND flash memory), 하드 디스크 드라이브(hard disk drive; HDD) 등과 같은 마그네틱 컴퓨터 기억 장치 및 CD-ROM, DVD-ROM 등과 같은 광학 디스크 드라이브(optical disc drive) 등을 포 함할 수 있다. 프로세서는 프로그램 등 소프트웨어를 실행하여 엣지 AI 모델 생성 시스템의 적어도 하나의 다른 구 성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 프로세서는 통신부를 통해 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV로부터 분석된 제1 CCTV 영상 분 석 결과를 수신하면, 상기 제1 CCTV 영상 분석 결과를 영상 분석 AI 모델에 입력하여 제2 CCTV 영상 분석 결과 를 생성한다. 그리고 프로세서는 제1 CCTV 영상 분석 결과에 상응하는 이벤트 발생 시간 정보, 비디오 클립 및 상기 제2 영상 분석 결과를 기반으로 학습 데이터 셋을 구성한 후, 학습 데이터 셋을 기반으로 엣지 CCTV를 위한 엣지 AI 모델을 학습 및 생성한다. 한편, 본 발명의 일 실시예에서, 프로세서는 엣지 AI 모델의 생성을 위해, 인공지능(Artificial Intelligence) 알고리즘으로서 기계학습, 신경망 네트워크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용할 수 있다. 일 예로, 인공지능(Artificial Intelligence) 알고리즘으로서 기계학습, 신경망 네트워 크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용할 수 있으며, 신경망 네트워크의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network)과 같은 모델을 포함할 수 있다. 이하에서는 본 발명의 일 실시예에 따른 엣지 AI 모델 생성 시스템에 의해 수행되는 엣지 AI 모델 생성 방 법에 대해 설명하도록 한다. 도 2는 본 발명의 일 실시예에 따른 엣지 AI 모델 생성 방법의 준비 단계에 관한 순서도이다. 먼저, 관리자는 엣지 CCTV를 특정 위치에 설치한다(S105). 본 발명의 일 실시예에서 엣지 CCTV는 영상분석을 수행하는 엣지 AI 모듈을 영상 촬영을 수행하는 CCTV에 탑재 한 보안 단말을 의미한다. 이러한 엣지 CCTV는 영상 촬영 및 촬영된 영상에 대한 분석 결과인 제1 CCTV 영상 분 석 결과를 생성한다. 다음으로, S105 단계에서 설치된 엣지 CCTV에 대한 정보를 엣지 AI 모델 생성 시스템에 등록한다(S110). 일 실시예로, 엣지 CCTV에 대한 정보는 설치된 엣지 CCTV에 대한 고유 ID, 위치, 성능 정보, IP 주소 등을 포함 할 수 있다. 다음으로, S110 단계가 종료됨에 따라 사용자의 입력을 대기하고(S115), 사용자의 입력을 수신하는 경우 입력 정보를 판별한다(S120). 이때, 사용자의 입력 정보가 '종료'인 경우(S120-종료) 전 과정을 종료한다(S125). 도 3은 본 발명의 일 실시예에 따른 엣지 AI 모델 생성 방법에서의 상세 단계에 관한 순서도이다. S120 단계에서 사용자의 입력 정보가 '엣지 AI 모델 적용'으로 판별된 경우(S120-엣지 AI 모델 적용), 엣지 CCTV에 적용할 엣지 AI 모델을 검색 및 선택한다(S130). 일 실시예로, S130 단계에서는 엣지 AI 모델의 분석 기능에 따른 엣지 AI 모델을 검색하고, 검색 결과를 기반으 로 엣지 AI 모델을 선택할 수 있다. 다른 실시예로, S130 단계에서는 엣지 AI 모델의 크기에 따른 엣지 AI 모델을 검색하고, 검색 결과를 기반으로 엣지 AI 모델을 선택할 수 있다. 또 다른 실시예로, S130 단계에서는 엣지 AI 모델 생성 시스템에 저장된 모든 엣지 AI 모델을 검색하고, 검색 결과를 기반으로 엣지 AI 모델을 선택할 수 있다. 다음으로, 상기 선택된 엣지 AI 모델을 상응하는 엣지 CCTV로 배포하고(S135), 배포된 엣지 AI 모델을 수신한 엣지 CCTV는 이를 적용한 후 동작된다(S140). 다음으로, 복수의 엣지 CCTV 중 적어도 하나의 엣지 CCTV에 의해 분석 결과인 제1 CCTV 영상 분석 결과가 생성 되면(S145), 해당 엣지 CCTV로부터 제1 CCTV 영상 분석 결과를 수신한다(S150). 이때, 제1 CCTV 영상 분석 결과는 객체 탐지 결과를 포함할 수 있다. 또한, 제1 CCTV 영상 분석 결과는 화재, 침수, 폭행, 침범, 배회 등과 같은 이벤트 탐지 결과를 포함할 수 있다. 여기에서 객체 탐지 결과 및 이벤트 탐 지 결과를 조합되어 하나의 정보로 제공될 수도 있다. 다음으로, 제1 CCTV 영상 분석 결과를 대상으로 영상 분석 AI 모델을 이용하여 제2 CCTV 영상 분석 결과를 생성 한다(S155). 여기에서 제2 CCTV 영상 분석 결과는 제1 엣지 CCTV 영상 분석 결과보다 더욱 고성능의 컴퓨터 사양에 의해 정 밀하게 분석된 결과를 의미한다. 다음으로, 제1 CCTV 영상 분석 결과에 상응하는 이벤트 발생 시간 정보, 비디오 클립 및 상기 제2 영상 분석 결 과를 기반으로 학습 데이터 셋을 생성한다(S160). 일 실시예로, S160 단계에서는 제2 영상 분석 결과를 GT(Ground Truth)로 정의하여 학습 데이터 셋을 구성할 수 있다. 이에 따라, 비디오 클립, 객체 및 이벤트 발생 시간 정보를 입력 데이터로 설정하고, 제2 영상 분석 결과 를 출력 데이터로 설정하도록 하는 학습 데이터 셋을 구성하여, 학습 데이터 셋을 기반으로 엣지 CCTV 모델을 위한 엣지 AI 모델을 학습 및 생성할 수 있다(S165). 이때, 본 발명의 일 실시예에서 S165 단계는 기 설정된 시간 정보를 만족하는 경우 및 학습 데이터 셋의 크기가 소정의 크기 이상을 만족할 정도로 충분한 경우 중 적어도 하나를 만족하는 경우 엣지 AI 모델을 학습 및 생성 할 수 있다. 한편, 본 발명의 일 실시예에서 학습 데이터 셋을 구성하는 경우, 제1 CCTV 영상 분석 결과와 이에 상응하는 제 2 CCTV 영상 분석 결과는 매칭되어 관리될 수 있다(제1 케이스). 또한, 하나의 CCTV 또는 서로 다른 복수의 CCTV로부터 획득된 복수의 제1 CCTV 영상 분석 결과에서 동일한 객체 또는 이벤트로 판별한 경우, 동일한 객체 또는 이벤트로 판별한 복수의 제1 CCTV 영상 분석 결과를 그룹화할 수 있다. 그리고 그룹화된 제1 CCTV 영상 분석 결과를 대상으로 영상 분석 AI 모델을 이용하여 제2 CCTV 영상 분석 결과를 생성할 수 있다. 이때, 그룹화된 제1 CCTV 영상 분석 결과와 제2 CCTV 영상 분석 결과는 매칭되어 관리 될 수 있다(제2 케이스). 이때, 제1 케이스의 경우 단일 엣지 CCTV로부터 분석된 결과를 기반으로 엣지 AI 모델을 학습시킴에 따라 최적 화된 엣지 AI 모델을 생성 및 적용시킬 수 있는 장점이 있으나, 학습 데이터 셋이 충분하지 않을 수도 있으며, 학습 데이터 셋의 구성에도 많은 시간이 소요될 수 있다. 반면, 제2 케이스와 같이 그룹화된 제1 CCTV 영상 분석 결과를 기반으로 생성된 제2 CCTV 영상 분석 결과를 학 습 데이터 셋으로 구성하는 제2 케이스의 경우, 학습 데이터 셋의 품질을 그대로 유지하면서 동시에 제1 케이스 보다 더욱 빠른 엣지 AI 모델의 학습이 가능하다는 장점이 있다. 여기에서 동일 객체 또는 이벤트로 판별한 복수의 제1 CCTV 영상 분석 결과는 동일 장소에서 서로 다른 각도 또 는 위치에 배치된 엣지 CCTV에 의해 생성된 것이다. 따라서, 동일 장소에 설치된 복수의 엣지 CCTV에 의해 획득 된 복수의 제1 CCTV 영상 분석 결과는 동시에 엣지 AI 모델 학습시 적용이 가능하다. 또한, 제1 케이스의 경우 1개의 제1 CCTV 영상 분석 결과를 기반으로 1개의 제2 CCTV 영상 분석 결과를 생성하 였으나, 제2 케이스의 경우 다:1로 제2 CCTV 영상 분석 결과를 생성하므로 보다 빠른 학습이 가능하다는 장점이 있다.한편, 제2 케이스에 있어 각 제2 CCTV 영상 분석 결과에는 가중치가 설정 및 부여될 수 있다. 일 예로, 제1 케 이스에서의 제1 및 제2 CCTV 영상 분석 결과와 제2 케이스에서의 제1 및 제2 CCTV 영상 분석 결과를 비교하여 일치도에 따라 제2 케이스에서의 각 제2 CCTV 영상 분석 결과에 가중치를 부여할 수도 있다. 또는, 제2 케이스에서의 복수의 엣지 CCTV에 의해 획득된 복수의 제1 CCTV 영상 분석 결과에 상응하는 비디오 클립 내 동일 객체 또는 이벤트에 대한 시간 정보의 중첩 구간의 개수 및 중첩 구간의 길이에 기초하여 각각의 제2 CCTV 영상 분석 결과에 대한 가중치가 가변 설정 및 부여될 수 있다. 즉, 제1 그룹 및 제2 그룹에서의 각 엣지 CCTV에서의 비디오 클립 내 동일 객체 또는 이벤트가 탐지되는 구간이 중첩되는 중첩 구간의 개수가 동일 하더라도 만약 제1 그룹이 중첩 구간의 길이가 더 긴 경우, 제1 그룹에 상응하는 제2 CCTV 영상 분석 결과에 더 큰 가중치를 부여할 수 있다. 다음으로, 사용자의 입력이 있는지 여부를 판별하고(S170), 사용자의 입력이 없는 것으로 판별시(S170-NO), S135 단계로 돌아간다. 이때, S165 단계에서 신규의 엣지 AI 모델이 생성되지 않은 경우에는 S135 및 S140 단계 는 생략되며, S145 단계부터 과정이 수행될 수 있다. 이와 달리, 신규의 엣지 AI 모델이 생성된 경우에는 S135 단계부터 수행된다. 또한, 사용자의 입력이 있는 것으로 판별시(S170-YES), S120 단계로 되돌아가고 상응하는 입력 정보에 따라 동 작을 수행하게 된다. 한편, 상술한 설명에서, 단계 S105 내지 단계 S170은 본 발명의 구현예에 따라서, 추가적인 단계들로 더 분할되 거나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 아울러, 기타 생략된 내용이라 하더라도 도 1에 기술된 내용과 도 2 내지 도 3에 기술된 내 용은 상호 적용된다. 이상에서 전술한 본 발명의 일 실시예들은, 하드웨어인 서버와 결합되어 실행되기 위해 프로그램(또는 어플리케 이션)으로 구현되어 매체에 저장될 수 있다. 상기 전술한 프로그램은, 상기 컴퓨터가 프로그램을 읽어 들여 프로그램으로 구현된 상기 방법들을 실행시키기 위하여, 상기 컴퓨터의 프로세서(CPU)가 상기 컴퓨터의 장치 인터페이스를 통해 읽힐 수 있는 C, C++, JAVA, 기 계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 상기 방법들을 실행하는 필요 한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Functional Code)를 포함할 수 있고, 상기 기능들을 상기 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수 있다. 또한, 이러한 코드는 상기 기능들을 상기 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 상기 컴퓨 터의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조되어야 하는지에 대한 메모리 참조관련 코드를 더 포함할 수 있다. 또한, 상기 컴퓨터의 프로세서가 상기 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠 한 다른 컴퓨터나 서버 등과 통신이 필요한 경우, 코드는 상기 컴퓨터의 통신 모듈을 이용하여 원격에 있는 어 떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는지 등 에 대한 통신 관련 코드를 더 포함할 수 있다. 상기 저장되는 매체는, 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반 영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상기 저 장되는 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있지만, 이에 제한되지 않는다. 즉, 상기 프로그램은 상기 컴퓨터가 접속할 수 있는 다양한 서버 상의 다양한 기록매체 또는 사용자의 상기 컴퓨터상의 다양한 기록매체에 저장될 수 있다. 또한, 상기 매체는 네트워크로 연결된 컴퓨터 시 스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장될 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2022-0129119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2022-0129119", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 엣지 AI 모델 생성 시스템의 구성을 도시한 블록도이다. 도 2는 본 발명의 일 실시예에 따른 엣지 AI 모델 생성 방법의 준비 단계에 관한 순서도이다. 도 3은 본 발명의 일 실시예에 따른 엣지 AI 모델 생성 방법에서의 상세 단계에 관한 순서도이다."}
