{"patent_id": "10-2021-0084681", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0001744", "출원번호": "10-2021-0084681", "발명의 명칭": "딥러닝서버를 구비한 표면실장 설계 시스템", "출원인": "박도상", "발명자": "박도상"}}
{"patent_id": "10-2021-0084681", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "표면실장 설계 시스템에 있어서, 탐색장치(110)와;데이터베이스(120)와;딥러닝서버(120)로 구성된 시스템서버(100)인 것을 특징으로 하며,상기의 탐색장치(110)는 표면실장 부품의 기능을 핵심어로 분류하여 저장한 핵심어 제공부(200)의 핵심어를 사용하여 인터넷(300) 등의 관련 매체를 검색하여 핵심어와 관련된 정보를 획득하여 상기 시스템서버(110)의 데이터베이스(120)에 저장하고, 상기의 딥러닝서버(130)는 데이터베이스(120)에 저장된 데이터를 비교 분석하여 최적의 설계값을 도출하고 최적의 설계값의 PCB설계가 포함된 표면실장을 설계하는 딥러닝서버를 구비한 표면실장 설계 시스템"}
{"patent_id": "10-2021-0084681", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,데이터베이스(120)는 부품부(121)와;카테고리부(122)로 구성되며, 부품부(121)는 시스템서버(100)에 구비된 탐색장치(110)가 부품기능과 관련된 핵심어를 사용하여 인터넷을 비롯한 관련 매체에서 수집한 정보로 부품 및 부품관련데이터로 구성되며, 부품관련데이터는 부품일반데이터(121-1a)와 부품신기술데이터(121-1b)로 분류하여 저장하며,상기의 카테고리부(122)는수집된 부품의 상관관계를 그룹핑하는 방법으로 카테고리로 분류하여 저장되며, 대표값으로 그룹핑된 상세내역및 상세내역과 연동되게 일반데이터(122-1a)와 신기술데이터(122-1b)로 분류하여 저장한 데이터로 구성된 딥러닝서버를 구비한 표면실장 설계 시스템."}
{"patent_id": "10-2021-0084681", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,딥러닝서버(130)는 빅데이터분석장치(131)와;표면실장설계장치(132)로 구성되며,빅데이터분석장치(131)는 표면실장기획 목적에 부합하는 부품을 데이터베이스(120)의 부품부(121)에서추출하고, 상기 데이터베이스(120)의 카테고리부(122)에서 추출된 부품의 상관관계와 부합하는 혹은 유사한 그룹핑 데이터를 추출하여 비교 분석하는 방법으로 최적의 값을 도출하고, 상기의 표면실장설계장치(132)는 비교분석으로 획득된 최적의 값에 해당하는 PCB설계를 포함한 표면실장을 설계하며, 설계과정에서 습득된 부품 관련 노하우와, 부품의 상관관계 그룹핑을 통해 습득된 노하우를 부품신기술데이터(121-1b)와, 카테고리의 그룹핑 신기술데이터(122-1b)에 각각 저장하는 방법으로 딥러닝서버의 업무량에 비례한노하우의 축적으로 학습량 증대 효과를 획득하는 딥러닝서버를 구비한 표면실장 설계 시스템."}
{"patent_id": "10-2021-0084681", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능의 딥러닝에 제공되는 표면실장 부품 및 부품과 관련된 데이터를 구축하는 방법과 구축된 데 이터를 비교분석하는 기능의 딥러닝 서버를 구비한 표면실장 설계 시스템을 제시한다. 본 발명은 탐색장치와, 데이터베이스와, 인공지능의 딥러닝서버를 구비한 시스템 서버로 구성되며, 탐색장치 (뒷면에 계속)"}
{"patent_id": "10-2021-0084681", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 효과적인 표면실장을 위한 표면실장 부품의 빅데이터 구축방법과 인공지능의 딥러닝 장치를 빅데이터 분석 및 노하우 저장을 통한 학습증대 효과가 발생하는 표면실장 설계 시스템에 관한 것이다."}
{"patent_id": "10-2021-0084681", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 관련 기술이 크게 발전하면서 이를 활용한 제품이 빅데이터 관련 기술이 크게 발전함에 따라 산업 전 반에서 빅데이터 활용 방법이 다양하게 제시되어 산업의 발전에 기여하고 있다. 일례로 온라인 글쓰기 교육을 위한 빅데이터 구축방법(공개번호 1020200126103)에서는 글쓰기에 관련된 형태소 분석 및 빅데이터분석을 통하여 멘토링 데이터를 생성하고 생성된 문장을 통해 피드백을 제공하는 방법으로 구 체적인 분석 및 첨삭지도가 이루어지는 빅데이터 구축방법을 제시하고 있다. 또 다른 일례로 빅데이터 기반 홈 중고 가전 거래 플랫폼 시스템(공개번호 1020210060902)에서는 투명한 중고거 래를 지원할 수 있는 빅데이터 기반 홈 중고 가전 거래 시스템을 제시하고 있다. 이상과 같이 빅데이터의 분석과 인공지능 기술의 활용은 산업분야에 국한 됨이 없이 효과적인 빅데이터 구축과 분석 및 딥러닝 기술을 이용한 노하우의 축적을 통해 두루 적용될 수 있다. 본 발명은 표면실장 설계를 위한 빅데이터 구축방법과 인공지능의 딥러닝 장치의 이용 방법을 제시하고자 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 온라인 글쓰기 교육을 위한 빅데이터 구축방법(공개번호 1020200126103) (특허문헌 0002) 빅데이터 기반 홈 중고 가전 거래 플랫폼 시스템(공개번호 1020210060902) 비특허문헌"}
{"patent_id": "10-2021-0084681", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 표면실장 설계에 빅데이터와 이를 분석 활용하는 인공지능의 딥러닝 기능을 적용하는 방법을 제시하 고자 한다. ."}
{"patent_id": "10-2021-0084681", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 인공지능의 딥러닝에 제공되는 표면실장 부품 및 부품과 관련된 데이터를 구축하는 방법과 구축된 데이터를 비교분석하는 기능의 딥러닝 서버를 구비한 표면실장 설계 시스템을 제시한다. 본 발명은 탐색장치와, 데이터베이스와, 인공지능의 딥러닝서버를 구비한 시스템 서버로 구성되며, 탐색장치 는 표면실장 부품의 기능과 관련된 핵심어를 사용하여 부품과 관련된 데이터를 수집하고 수집된 부품데이터를 분석하고 그룹핑하여 카테고리별로 분류 저장하는 방법으로 데이터를 구축하며, 딥러닝서버는 빅데이터분석장치 와 표면실장설계장치로 구성하여, 빅데이터분석장치는 표면실장 기획에 부합하는 부품과 그룹핑 데이터를 비교 분석하는 방법으로 최적의 설계값을 도출하고 표면실장설계장치는 최적의 설계값에 부합하는 PCB설계를 포함하 는 표면실장을 설계하고 설계과정에서 획득한 노하우를 저장한다. 딥러닝 서버의 업무량에 비례한 노하우의 축적 증가로 딥러닝서버의 학습증가 효과를 얻게 된다."}
{"patent_id": "10-2021-0084681", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 탐색장치와, 데이터베이스와, 인공지능의 딥러닝서버를 구비한 시스템 서버로 구성되며, 탐색장치는 표면실장 부품의 기능과 관련된 핵심어를 사용하여 부품과 관련된 데이터를 수집하고 수집된 부품데이터를 분석 하고 그룹핑하여 카테고리별로 분류 저장하는 방법으로 데이터를 구축하며, 딥러닝서버는 빅데이터분석장치와 표면실장설계장치로 구성하여, 빅데이터분석장치는 표면실장 기획에 부합하는 부품과 그룹핑 데이터를 비교분석 하는 방법으로 최적의 설계값을 도출하고 표면실장설계장치는 최적의 설계값에 부합하는 PCB설계를 포함하는 표 면실장을 설계하고 설계과정에서 획득한 노하우를 저장한다. 딥러닝 서버의 업무량에 비례한 노하우의 축적 증가로 딥러닝서버의 학습증가 효과를 얻게 된다."}
{"patent_id": "10-2021-0084681", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예에서 제시되는 특정한 방법 내지 기능적 설명들은 단지 본 발명의 개념에 따른 실시예를 설명 하기 위한 목적으로 예시된 것으로, 본 발명의 개념에 따른 실시예들은 다양한 형태로 실시될 수 있다. 또한 본 명세서에 설명된 실시예들에 한정되는 것으로 해석되어서는 아니 되며, 본 발명의 사상 및 기술 범위에 포함되 는 모든 변경물, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 명세서에서 사용하는 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로서, 본 발명을 한정하려는 의도가 아니다. 이하에서는 첨부된 도면을 참조하여 본 발명에 대해 상세히 설명한다. 도 1은 본 발명 딥러닝서버를 구비한 표면실장 설계시스템의 전체도이다. 도 1을 참조하면, 본 발명은 탐색장치와; 데이터베이스와; 딥러닝서버로 구성된 시스템서버인 것을 특징으로 하며, 상기의 탐색장치은 표면실장 부품의 기능을 핵심어로 분류하여 저장한 핵심어 제공부의 핵심어를 사 용하여 인터넷이나 관련 매체에서 핵심어와 관련된 정보를 획득하여 상기 시스템서버의 데이터베이스 에 저장한다. 상기의 딥러닝서버는 데이터베이스에 저장된 데이터를 비교 분석하여 최적의 설계값을 도출하고 설계 값에 해당하는 PCB설계를 포함한 표면실장을 설계하고 설계과정에서 학습한 노하우를 저장하는 방법으로 학습효 과를 증대한다. 도 2는 상기 데이터베이스의 상세도와 데이터베이스부의 데이터를 활용하는 딥러닝서버의 기능 을 도시한다.. 도 2를 참조하면, 데이터베이스는 부품부와; 카테고리부로 구성되며, 부품부는 시스템서버에 구비된 탐색장치가 부품기능과 관련된 핵 심어를 사용하여 인터넷을 비롯한 관련 매체에서 수집한 정보로 부품 및 부품관련데이터로 구성되며, 부품관련 데이터는 부품일반데이터(121-1a)와 부품신기술데이터(121-1b)로 분류하여 저장한다. 상기의 카테고리부는 수집된 부품의 상관관계를 그룹핑하는 방법으로 카테고리로 분류하여 저장되며, 대표 값으로 그룹핑된 상세내역 및 상세내역과 연동되게 일반데이터(122-1a)와 신기술데이터(122-1b)로 분류하여 저 장한 데이터로 구성된다. 본 발명의 시스템서버에 구비된 딥러닝서버는 빅데이터분석장치와; 표면실장설계장치로 구성되며, 빅데이터분석장치는 표면실장기획 목적에 부합하는 부품을 데이터베이스의 부품부에서 추출하고, 상기 데이터베이스의 카테고리부에서 추출된 부품의 상관관계와 부합하는 혹은 유사한 그 룹핑 데이터를 추출하여 비교 분석하는 방법으로 최적의 값을 도출하고, 상기의 표면실장설계장치는 비교 분석으로 획득된 최적의 값에 해당하는 PCB설계를 포함한 표면실장을 설계한다. 또한 설계과정에서 습득된 부품 관련 노하우와, 부품의 상관관계 그룹핑을 통해 습득된 노하우를 부품신기술데 이터(121-1b)와, 카테고리의 그룹핑 신기술데이터(122-1b)에 각각 저장한다. 도 3은 본 발명의 흐름을 도시한다. 도 3을 참조하면, 본 발명의 시스템서버에 구성된 탐색장치를 이용한 정보획득단계와; 획득된정보를 부품별로 분류 저장하고, 상관된 부품의 상관관계를 그룹핑하는 방법으로 분류하여 카테고리별로 저장하는 분류저장단계와; 표면실장 설계를 위해 기획하는 기획단계와; 상기의 딥러닝서버가 표면실장 기획에 부합하는 부품을 상기의 데이터베이스의 부품부에서 추출 하고, 카테고리부에서 추출된 부품의 상관관계에 부합하는 혹은 유사하게 그룹핑된 데이터를 도출하여 비 교분석하는 비교분석단계와; 비교분석을 통해 도출된 최적의 값으로 PCB설계가 포함된 표면실장을 설계하는 설계단계와; 설계과정에서 습득된 부품 관련 노하우와, 부품의 상관관계 그룹핑을 통해 습득된 노하우를 부품신기술데이터 (121-1b)와, 카테고리의 그룹핑 신기술데이터(122-1b)에 각각 저장한다. 이상의 방법으로 딥러닝서버는 업무량에 비례한 신기술데이터의 축적이라는 학습량의 증대 효과가 발생한 다. 이상에서 설명한 본 발명은 전술한 실시예 및 첨부된 도면에 의해 한정되는 것이 아니고, 본 발명의 기술적 사"}
{"patent_id": "10-2021-0084681", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상을 벗어나지 않는 범위 내에서 여러 가지 치환, 변형 및 변경이 가능함은 본 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에게 명백할 것이다. 산업상 이용가능성 본 발명은 인공지능의 딥러닝 장치를 이용한 표면실장 방법을 제시한다. 서버에 구비된 탐색장치를 이용하여 표 면실장 부품과 관련된 정보를 수집저장하고 인공지능의 딥러닝장치가 저장된 부품 및 상관부품으로 그룹핑된 데 이터를 비교 분석하는 방법으로 최적의 값에 해당하는 PCB설계를 포함한 표면실장을 설계하고 이러한 설계과정 에서 습득된 노하우를 저장하는 방법으로 딥러닝장치의 업무량에 비례한 학습량의 증가 효과를 얻을 수 있다. ."}
{"patent_id": "10-2021-0084681", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명 딥러닝서버를 구비한 표면실장 설계시스템의 전체도이다. 도 2 는 본 발명의 딥러닝서버의 상세도이다. 도 3은 본 발명의 업무흐름도이다. ."}
