{"patent_id": "10-2022-0185682", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0103473", "출원번호": "10-2022-0185682", "발명의 명칭": "연합학습 방법과 흉부질환 탐지 방법 및 컴퓨팅 장치", "출원인": "성균관대학교산학협력단", "발명자": "김광수"}}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "연합학습 장치가 수행하는 연합학습 방법으로서,언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와,상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와,상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터표현을 학습하는 단계와,상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하는연합학습 방법."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 자기지도학습은 프리텍스트 태스크 학습인연합학습 방법."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 데이터를 변형하는 단계는, 에지(edge) 성분을 사용한 데이터 증강이 적용된연합학습 방법."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 연합학습을 진행하는 단계는,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델의 가중치를 각 클라이언트 장치에게 분배하는 단계와,상기 분배 받은 글로벌 모델의 가중치가 로컬 모델에 반영되어 각 클라이언트 장치에서 로컬 데이터를 사용해학습된 로컬 모델의 가중치를 병합하는 단계와,상기 병합한 가중치를 사용해 글로벌 모델을 갱신하는 단계를 포함하는연합학습 방법."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "컴퓨터 프로그램을 저장하고 있는 컴퓨터 판독 가능 기록매체로서,상기 컴퓨터 프로그램은, 프로세서에 의해 실행되면,언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와,상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와,상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터표현을 학습하는 단계와,공개특허 10-2024-0103473-3-상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하는 연합학습 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함하는, 컴퓨터 판독 가능한 기록매체."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "컴퓨터 판독 가능 기록매체에 저장된 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램은, 프로세서에 의해 실행되면,언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와,상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와,상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터표현을 학습하는 단계와,상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하는 연합학습 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함하는, 컴퓨터 프로그램."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "적어도 하나의 명령어를 저장하는 메모리부와,프로세서부와,각 로컬 데이터를 기반으로 학습하는 복수의 클라이언트 장치와 상기 프로세서부의 제어에 따라 통신을 수행하는 통신부를 포함하고;상기 프로세서부에 의해 상기 적어도 하나의 명령어가 실행됨으로써, 상기 복수의 클라이언트 장치와 상기 통신을 수행하면서 연합학습 방법을 수행하는 서버로서 기능하며;상기 연합학습 방법은,언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와,상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와,상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터표현을 학습하는 단계와,상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하는컴퓨팅 장치."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 자기지도학습은 프리텍스트 태스크 학습인컴퓨팅 장치."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 데이터를 변형하는 단계는, 에지(edge) 성분을 사용한 데이터 증강이 적용된컴퓨팅 장치.공개특허 10-2024-0103473-4-청구항 10 제 7 항에 있어서,상기 연합학습을 진행하는 단계는,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델의 가중치를 상기 통신부를 통해 상기 복수의 클라이언트 장치에게 분배하는 단계와,상기 분배 받은 글로벌 모델의 가중치가 로컬 모델에 적용되어 각 클라이언트 장치에서 로컬 데이터를 사용해학습된 로컬 모델의 가중치를 병합하는 단계와,상기 병합한 가중치를 사용해 글로벌 모델을 갱신하는 단계를 포함하는컴퓨팅 장치."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "연합학습을 통해 학습된 글로벌 모델을 이용한 흉부질환 탐지 방법으로서,상기 연합학습은,언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와,상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와,상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터표현을 학습하는 단계와,상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하고;상기 탐지 방법은,상기 연합학습의 결과로서 각 클라이언트 장치에서 학습된 로컬 모델의 가중치를 병합해 갱신된 글로벌 모델을준비하는 단계와,진단 대상자의 흉부 엑스선 영상을 획득하는 단계와,상기 글로벌 모델에 상기 흉부 엑스선 영상을 입력하여, 상기 글로벌 모델의 출력으로서 상기 진단 대상자의 흉부질환 탐지 결과를 생성하는 단계를 포함하는흉부질환 탐지 방법."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "컴퓨터 프로그램을 저장하고 있는 컴퓨터 판독 가능 기록매체로서,상기 컴퓨터 프로그램은, 프로세서에 의해 실행되면,연합학습을 통해 학습된 글로벌 모델을 이용한 흉부질환 탐지 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함하고;상기 연합학습은,언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와,상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와,상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터표현을 학습하는 단계와,상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하며;공개특허 10-2024-0103473-5-상기 탐지 방법은,상기 연합학습의 결과로서 각 클라이언트 장치에서 학습된 로컬 모델의 가중치를 병합해 갱신된 글로벌 모델을준비하는 단계와,진단 대상자의 흉부 엑스선 영상을 획득하는 단계와,상기 글로벌 모델에 상기 흉부 엑스선 영상을 입력하여, 상기 글로벌 모델의 출력으로서 상기 진단 대상자의 흉부질환 탐지 결과를 생성하는 단계를 포함하는컴퓨터 판독 가능한 기록매체."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "컴퓨터 판독 가능 기록매체에 저장된 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램은, 프로세서에 의해 실행되면,연합학습을 통해 학습된 글로벌 모델을 이용한 흉부질환 탐지 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함하고;상기 연합학습은,언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와,상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와,상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터표현을 학습하는 단계와,상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하며;상기 탐지 방법은,상기 연합학습의 결과로서 각 클라이언트 장치에서 학습된 로컬 모델의 가중치를 병합해 갱신된 글로벌 모델을준비하는 단계와,진단 대상자의 흉부 엑스선 영상을 획득하는 단계와,상기 글로벌 모델에 상기 흉부 엑스선 영상을 입력하여, 상기 글로벌 모델의 출력으로서 상기 진단 대상자의 흉부질환 탐지 결과를 생성하는 단계를 포함하는컴퓨터 프로그램."}
{"patent_id": "10-2022-0185682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "적어도 하나의 명령어를 저장하는 메모리부와,프로세서부와,각 로컬 데이터를 기반으로 학습하는 복수의 클라이언트 장치와 상기 프로세서부의 제어에 따라 통신을 수행하는 통신부를 포함하고;상기 프로세서부에 의해 상기 적어도 하나의 명령어가 실행됨으로써, 상기 복수의 클라이언트 장치와 연합학습을 통해 학습된 글로벌 모델을 이용한 흉부질환 탐지 방법을 수행하는 서버로서 기능하며;상기 연합학습은,언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와,상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와,상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터표현을 학습하는 단계와,공개특허 10-2024-0103473-6-상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와,상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하며;상기 탐지 방법은,상기 연합학습의 결과로서 각 클라이언트 장치에서 학습된 로컬 모델의 가중치를 병합해 갱신된 글로벌 모델을준비하는 단계와,진단 대상자의 흉부 엑스선 영상을 획득하는 단계와,상기 글로벌 모델에 상기 흉부 엑스선 영상을 입력하여, 상기 글로벌 모델의 출력으로서 상기 진단 대상자의 흉부질환 탐지 결과를 생성하는 단계를 포함하는컴퓨팅 장치."}
{"patent_id": "10-2022-0185682", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른 연합학습 장치가 수행하는 연합학습 방법은, 언레이블 데이터를 입력으로 받아 적용할 자기지 도학습에 맞게 데이터를 변형하는 단계와, 상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와, 상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터 표현을 학습하는 단계와, 상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와, 상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함한다."}
{"patent_id": "10-2022-0185682", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 연합학습 방법과 이러한 연합학습을 통해 학습된 글로벌 모델을 이용한 흉부질환 탐지 방법, 그리고 이러한 방법들을 수행할 수 있는 컴퓨팅 장치에 관한 것이다."}
{"patent_id": "10-2022-0185682", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "의료 인공지능은 의사의 진단에 도움을 주는 역할을 하지만, 의료 데이터의 특성 때문에 데이터는 각 병원에 흩 어져 있고, 데이터의 레이블이 부족하여 활용성이 떨어진다. 이렇게 특정 병원에서 보유한 데이터만을 활용해 인공지능 모델을 만들 경우에는 모델의 성능이 충분히 나오지 않는 단점이 있다. 이러한 로컬학습의 단점을 보완하기 위해 연합학습을 적용할 수 있으며, 그 예로서, 흉부 엑스선 데이터에 연합 학습을 적용해 흉부질환을 탐지하는 기술이 있다. 그런데, 종래 기술에 따른 흉부질환 탐지를 위한 연합학습의 경우에 각 클라이언트에게 데이터가 동일하게 분포 되어있는 IID(independent identically distribution) 환경만을 고려했다. 하지만, 실질적인 연합학습의 시나리오는 클라이언트별로 보유한 클래스의 분포나 데이터의 크기가 다른 Non- IID 환경이 일반적이다. 그러므로 실제 환경에서는 클라이언트 드리프트(client drift)와 같은 문제가 발생해 정확도가 하락하는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2022-0094967호, 공개일 2022년 07월 06일."}
{"patent_id": "10-2022-0185682", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 실시예에 따르면, 데이터 변형 후 자기지도학습을 수행한 로컬학습의 결과를 연합학습에 반영함으로써 데이 터 레이블이 부족하거나 로컬들에 흩어져 있는 Non-IID 데이터 환경에서도 우수한 학습 결과를 제공하는 연합학 습 방법과 그 컴퓨팅 장치를 제공한다. 또한, 데이터 변형 후 자기지도학습을 수행한 로컬학습의 결과를 연합학습에 반영함으로써 흉부질환에 대한 탐 지의 정확성을 향상시킨 흉부질환 탐지 방법 및 그 컴퓨팅 장치를 제공한다. 본 발명의 해결하고자 하는 과제는 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 해결하고 자 하는 과제는 아래의 기재로부터 본 발명이 속하는 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0185682", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "제 1 관점으로서 연합학습 장치가 수행하는 연합학습 방법은, 언레이블 데이터를 입력으로 받아 적용할 자기지 도학습에 맞게 데이터를 변형하는 단계와, 상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와, 상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터 표현을 학습하는 단계와, 상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와, 상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함한다. 제 2 관점으로서 컴퓨터 프로그램을 저장하고 있는 컴퓨터 판독 가능 기록매체는, 상기 컴퓨터 프로그램이, 프 로세서에 의해 실행되면, 상기 연합학습 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함한다. 제 3 관점으로서 컴퓨터 판독 가능 기록매체에 저장된 컴퓨터 프로그램은, 상기 컴퓨터 프로그램이, 프로세서에 의해 실행되면, 언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와, 상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와, 상기 생성한 가상 레이블과 상기 변형된 데이터를 이 용한 자기지도학습을 진행해 상기 언레이블 데이터로부터 표현을 학습하는 단계와, 상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와, 상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하는 연합학습 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함한다. 제 4 관점으로서 컴퓨팅 장치는, 적어도 하나의 명령어를 저장하는 메모리부와, 프로세서부와, 각 로컬 데이터 를 기반으로 학습하는 복수의 클라이언트 장치와 상기 프로세서부의 제어에 따라 통신을 수행하는 통신부를 포 함하고; 상기 프로세서부에 의해 상기 적어도 하나의 명령어가 실행됨으로써, 상기 복수의 클라이언트 장치와 상기 통신을 수행하면서 연합학습 방법을 수행하는 서버로서 기능하며; 상기 연합학습 방법은, 언레이블 데이터 를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와, 상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와, 상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상 기 언레이블 데이터로부터 표현을 학습하는 단계와, 상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모 델에 전이하는 단계와, 상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함한다. 제 5 관점으로서 연합학습을 통해 학습된 글로벌 모델을 이용한 흉부질환 탐지 방법은, 상기 연합학습은, 언레 이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와, 상기 변형한 데이터에 기 반해 가상 레이블을 생성하는 단계와, 상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터 표현을 학습하는 단계와, 상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와, 상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하고; 상기 탐지 방법은, 상기 연합학습의 결과로서 각 클라이언트 장치에서 학습된 로컬 모델의 가중치를 병합해 갱신된 글로벌 모델을 준비하는 단계와, 진단 대상자의 흉부 엑스선 영상을 획득하는 단계와, 상기 글로벌 모델에 상기 흉부 엑스선 영상을 입력하여, 상기 글로벌 모델의 출력으로서 상기 진단 대 상자의 흉부질환 탐지 결과를 생성하는 단계를 포함한다. 제 6 관점으로서 컴퓨터 프로그램을 저장하고 있는 컴퓨터 판독 가능 기록매체는, 상기 컴퓨터 프로그램이, 프 로세서에 의해 실행되면, 상기 흉부질환 탐지 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함한다. 제 7 관점으로서 컴퓨터 판독 가능 기록매체에 저장된 컴퓨터 프로그램은, 상기 컴퓨터 프로그램이, 프로세서에 의해 실행되면, 연합학습을 통해 학습된 글로벌 모델을 이용한 흉부질환 탐지 방법을 상기 프로세서가 수행하도 록 하기 위한 명령어를 포함하고; 상기 연합학습은, 언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와, 상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와, 상기 생성한 가 상 레이블과 상기 변형된 데이터를 이용한 자기지도학습을 진행해 상기 언레이블 데이터로부터 표현을 학습하는 단계와, 상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와, 상기 학습한 자기지도 학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하며; 상기 탐지 방법은, 상기 연 합학습의 결과로서 각 클라이언트 장치에서 학습된 로컬 모델의 가중치를 병합해 갱신된 글로벌 모델을 준비하 는 단계와, 진단 대상자의 흉부 엑스선 영상을 획득하는 단계와, 상기 글로벌 모델에 상기 흉부 엑스선 영상을 입력하여, 상기 글로벌 모델의 출력으로서 상기 진단 대상자의 흉부질환 탐지 결과를 생성하는 단계를포함한다. 제 8 관점으로서 컴퓨팅 장치는, 적어도 하나의 명령어를 저장하는 메모리부와, 프로세서부와, 각 로컬 데이터 를 기반으로 학습하는 복수의 클라이언트 장치와 상기 프로세서부의 제어에 따라 통신을 수행하는 통신부를 포 함하고; 상기 프로세서부에 의해 상기 적어도 하나의 명령어가 실행됨으로써, 상기 복수의 클라이언트 장치와 연합학습을 통해 학습된 글로벌 모델을 이용한 흉부질환 탐지 방법을 수행하는 서버로서 기능하며; 상기 연합학 습은, 언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형하는 단계와, 상기 변형한 데이터에 기반해 가상 레이블을 생성하는 단계와, 상기 생성한 가상 레이블과 상기 변형된 데이터를 이용한 자 기지도학습을 진행해 상기 언레이블 데이터로부터 표현을 학습하는 단계와, 상기 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이하는 단계와, 상기 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행하는 단계를 포함하며; 상기 탐지 방법은, 상기 연합학습의 결과로서 각 클라이언트 장치에서 학습된 로컬 모델의 가중치를 병합해 갱신된 글로벌 모델을 준비하는 단계와, 진단 대상자의 흉부 엑스선 영상 을 획득하는 단계와, 상기 글로벌 모델에 상기 흉부 엑스선 영상을 입력하여, 상기 글로벌 모델의 출력으로서 상기 진단 대상자의 흉부질환 탐지 결과를 생성하는 단계를 포함한다."}
{"patent_id": "10-2022-0185682", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따르면, 데이터 변형 후 자기지도학습을 수행한 로컬학습의 결과를 연합학습에 반영함으로써 데이 터 레이블이 부족하거나 로컬들에 흩어져 있는 Non-IID 데이터 환경에서도 우수한 학습 결과를 제공한다. 또한, 일 실시예에 따른 데이터 변형 후 자기지도학습을 수행한 로컬학습의 결과를 연합학습에 반영해 흉부질환 에 대한 탐지에 활용함으로써, 흉부질환에 대한 탐지의 정확성을 향상시킨 효과가 있다."}
{"patent_id": "10-2022-0185682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하"}
{"patent_id": "10-2022-0185682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 본 발명의 실시예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명의실시예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1은 본 발명의 일 실시예에 따른 연합학습을 수행할 수 있는 서버-클라이언트 연합학습 시스템의 구성도이고, 도 2 및 도 3은 본 발명의 일 실시예에 따른 자기지도학습 및 연합학습의 개념도들이다. 도 1 및 도 2를 참조하면, 서버-클라이언트 연합학습 시스템는 복수의 클라이언트 장치(110, 120, 130)와 서버가 통신망을 통해 연결된다. 서버는 언레이블 데이터를 이용한 자기지도학습을 진행해 언레이블 데이터로부터 표현을 학습한다. 예를 들어, 표현을 학습하기 위한 자기지도학습은 프리텍스트 태스크(pretext task) 학습 을 이용할 수 있다. 그리고, 서버는 학습한 자기지도학습의 표현을 연합학습을 수행할 글 로벌 모델에 전이한다. 그리고, 서버는 자기지도학습의 표현이 전이된 글로벌 모델의 가중치를 각 클라이언트 장치 (110, 120, 130)에 전송함으로써, 연합학습이 시작될 수 있도록 한다. 그러면, 복수의 클라이언트 장치(110, 120, 130)는 서버로부터 수신된 글로벌 모델의 가중치를 로컬 모델(222, 223, 224, 225)에 반영한 후 각각의 로컬 데이터를 이용해 각각 로컬 모델(222, 223, 224, 225)에 대해 로컬 학습을 수행하고, 로컬 학습의 결과물인 각각의 로컬 모델(222, 223, 224, 225)의 가중치 를 서버에 전송함으로써, 로컬 학습의 결과가 글로벌 모델에 반영될 수 있도록 한다. 이후, 각 클라이언트 장치(110, 120, 130)의 로컬학습의 결과물인 로컬 모델(222, 223, 224, 225)의 가중 치를 병합한 후 병합된 가중치를 사용해 글로벌 모델의 가중치를 갱신한다. 도 2에서 서버가 복수의 클라이언트 장치(110, 120, 130)에 글로벌 모델의 가중치를 전송함과 아울러 복수의 클라이언트 장치(110, 120, 130)가 각각 로컬 모델(222, 223, 224, 225)의 가중치를 서버에 전송 하는 것은 도 3과 같이 데이터 표현과 레이블 데이터를 이용한 다운스트림 데스크 러닝(downstream task learning)의 결과를 획득하는 것으로 표현할 수 있다. 도 4 및 도 5는 본 발명의 일 실시예에 따른 자기지도학습 모델을 사용한 연합학습 방법을 설명하기 위한 흐름 도들이고, 도 6 및 도 7은 본 발명의 일 실시예에 따른 연합학습 방법 중 데이터 변형의 예를 보인 것이며, 도 8 및 도 9는 본 발명의 일 실시예에 따른 자기지도학습에 적용할 수 있는 RFID 프레임워크를 나타낸 것이고, 도 10은 본 발명의 일 실시예에 따른 자기지도학습 및 연합학습을 적용한 흉부질환 탐지 방법을 설명하기 위한 흐 름도이다. 이하, 도 1 내지 도 10을 참조하여 본 발명의 일 실시예에 따른 자기지도학습 모델을 사용한 연합학습 방법, 이 렇게 학습된 결과를 이용하여 흉부질환을 탐지하는 방법에 대해 자세히 살펴보기로 한다. 먼저, 서버는 언레이블 데이터를 이용하고자 하는 자기지도학습에 맞게 변형하는 데이터 변형을 수행할 수 있고(S410), 변형한 데이터에 기반해 가상 레이블을 생성할 수 있다(S420). 예를 들어, 이후 수행할 자기지도학습은 프리텍스트 태스크 학습을 이용할 수 있고, 이러한 프리텍스 트 태스크 학습에 적합한 데이터 변형의 예와 이를 기반해 생성한 가상 레이블을 도 6에 예시하였다. 자기지도학습에 사용할 프리텍스트 태스크는 크게 두 종류로 나눌 수 있다. 휴리스틱(heuristic)하게 디자 인된 프리텍스트 태스크는 회전시키거나 퍼즐처럼 섞는 등 강체변환에 기반해 데이터를 변형시킨다. 또한, 적용 한 변환에 기반해 자기지도학습에서 사용한 가상 레이블을 생성한다. 예컨대, 회전 횟수를 가상 레이블로서 생 성할 수 있다. 반대로, 인스턴트 디스크리미네이션(instance discrimination) 기반의 프리텍스트 태스크는 다양한 데이터 증강 기법을 임의로 적용해 변형된 두 개의 뷰를 생성한다. 그런 다음, 두 뷰에 내재된 표현(feature)을 레이블 삼아 서로의 표현이 유사하도록 학습한다. 예를 들어, 다양한 데이터 증강 기법의 예로는 임의의 비율로 데이터를 자 른 후 원래의 크기로 복구하는 랜덤 리사이즈드 크롭(random resized crop)을 적용, 임의의 각도로 데이터를 회 전하는 랜덤 로테이션(random rotation)을 적용, 임의의 확률로 데이터의 좌우를 반전하는 랜덤 호리젠탈 필름 (random horizontal flip)을 적용, 임의의 값들로 데이터의 밝기, 명암, 색 등을 조절하는 칼라 디스토션(color distortion)을 적용, 임의의 확률로 가우시안 블러(gaussian blur)를 적용, 임의의 확률로 가우시안 노이즈 (gaussian noise)를 적용, 임의의 값으로 데이터에 행렬변환을 적용하는 랜덤 어파인 트랜스폼(random affinetransform)을 적용, 임의의 부분에 값을 0으로 변환하는 컷아웃(cutout)을 적용 등이 이용될 수 있다. 한편, 본 발명의 일 실시예에 따르면 자기지도학습 및 연합학습은 흉부 엑스선 영상으로부터 흉부질환을 탐지하 는 실시예로서 구현할 수 있기에, 흉부 엑스선 영상의 특성을 반영한 데이터 증강을 수행할 수도 있다. 흉부 엑 스선 영상은 동/식물의 모양이나 경관을 담은 자연적인 데이터와 다르게 대부분의 데이터들이 외관적인 부분에 서 상당한 유사성을 띈다. 또한, 질감 및 명암과 같은 딥러닝의 학습에 사용할 수 있는 데이터의 특징들이 제한 적이다. 그러므로, 미닝풀 피처(meaningful feature)의 질적/양적 향상을 위해 도 7에 예시한 바와 같이 에지 (edge) 성분을 고려한 데이터 증강 기법을 적용할 수 있다. 예를 들어, 캐니 에지 검출기(canny edge detector)를 사용한 데이터 증강 기법은 수학식 1과 같이 적용할 수 있고, 특정 픽셀의 값이 과도하게 커지는 것을 방지하기 위해 정규화(normalize)를 적용할 수 있다. 또한, 다른 데이터 증강기법과 마찬가지로 에지 성분을 사용한 데이터 증강 역시 임의의 확률에 따라 적용 여부가 결정될 수 있다. 수학식 1"}
{"patent_id": "10-2022-0185682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "그리고, 서버는 단계 S410에서 변형한 데이터와 단계 S420에서 생성한 가상 레이블을 이용한 자기지도학습 을 진행해 입력된 언레이블 데이터로부터 표현을 학습한다. 예를 들어, 서버는 프리텍스트 태스크를 위해 도 8 및 도 9에 예시한 FRID 프레임워크를 사용할 수 있다. 도 9는 FRID의 프로젝션 헤드(projection head)를 사용한 SR 레이어의 예이다. 도 8 및 도 9를 참조하면, 베이스 인코더(base encoder)는 데이터의 표현을 학습하고, 연합학습으로 전이 하기 위한 것이며, CNN 기반의 베이스 인코더는 흉부 엑스선 분야에서 주로 사용되는 Densenet-121 모델을 사용 할 수 있다. 프로젝션(projection)은 흉부 질환에 의해 변경되는 미세한 부분에서의 변화를 감지하기 위해 도 9의 SR 레이어를 추가해 설계할 수 있다. 프리딕션(prediction)은 비 대칭적인 구조를 갖고 다른 브랜치(branch)의 결과를 예측함으로써 표현을 학 습하도록 설계할 수 있다. 일반적인 자기지도학습은 글로벌 인베리언트(global invariant)한 표현의 학습을 목표로 하는 반면, 흉부 엑스 선 데이터는 일반적으로 대부분 외관상 상당한 유사성을 띄고 흉부 질환은 미세한 부분에서의 차이만을 발생시 키기 때문에 로컬 스파티얼(local spatial)한 표현의 학습이 더욱 중요하다. 흉부 엑스선에 적합한 자기지도학 습 프레임워크인 FRID는 최근 제안되고 있는 자기지도학습 방법론과 같이 두 개의 브랜치를 보유한 샤미즈 (siamese network)를 기본 구조로 사용하며, 피처(feature)의 임베딩(embedding)을 위한 프로젝션 헤드와 비대 칭적 구조를 위한 프리딕션 헤드를 포함하고 있다. FRID는 흉부 엑스선에서 중요한 로컬 스파티얼 표현의 학습 을 위해 SR 레이어를 도입해 프로젝션 헤드를 구성할 수 있다. SR 레이어는 글로벌 에버리지 폴링(global average pooling)을 통한 피처의 압축과 보틀넥(bottleneck) 및 시그모이드(sigmoid) 함수를 통한 재조정 후 중요도 스케일링을 통해 흉부 엑스레이에서 상대적으로 중요한 로컬 표현을 강조하게 된다. 스케일링 된 중요도 는 병렬적으로 구성된 기존의 스택 FC 레이어(stacked FC layer)와 곱해짐으로써 셀프 어텐션(self- attention)과 같은 효과를 내며, 글로벌 & 로컬 표현을 동시에 학습하도록 할 수 있다. SR 레이어를 적용했을 때의 성능 변화는 표 1과 같다. SR 레이어를 사용하는 경우 FRID의 기본 골자가 되는 SimSiam 방법론의 결과보다 훨씬 뛰어난 성능을 보이는 것을 확인할 수 있다. 또한, SR 레이어를 단순히 스택 FC 레이어의 앞/뒤에 순차적으로 배치하는 것 보다 병렬적으로 구성해 두 정보를 동시에 사용하는 경우 향상폭 이 더 크다는 것을 확인할 수 있다. 표 1 Position of SR layer Mean AUC Improvement Vanilla Simsiam 68.89 - Before the FC layer 67.44 -1.45After the FC layer 70.11 1.22 In parallel with FC layer 73.24 4.35 그리고, 서버는 단계 S430을 통해 학습한 자기지도학습의 표현을 연합학습을 수행할 글로 벌 모델에 전이한다(S440). 그리고, 서버는 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 복수의 클라이언트 장치 (110, 120, 130)와 연합하는 연합학습을 진행한다(S450). 이러한 연합학습은 도 5에 나타낸 바와 같이, 서버가 글로벌 모델의 가중치를 각 클라이언트 장치 (110, 120, 130)에 전송 및 분배함으로써, 연합학습이 시작될 수 있다(S510). 그러면, 복수의 클라이언트 장치(110, 120, 130)는 서버로부터 수신된 글로벌 모델의 가중치를 로컬 모델(222, 223, 224, 225)에 반영한 후 각각의 로컬 데이터를 이용해 각각 로컬 모델(222, 223, 224, 225)에 대해 로컬 학습을 수행하고, 로컬 학습의 결과물인 각각의 로컬 모델(222, 223, 224, 225)의 가중치 를 서버에 전송함으로써, 로컬 학습의 결과가 글로벌 모델에 반영될 수 있도록 한다. 서버는 각 클라이언트 장치(110, 120, 130)의 로컬학습의 결과물인 로컬 모델(222, 223, 224, 225) 의 가중치를 병합한다(S520). 그리고, 서버는 단계 S520에서 병합된 가중치를 사용해 글로벌 모델의 가중치를 갱신한다(S530). 앞서 언급한 바와 같이 일 실시예에 따르면 자기지도학습 및 연합학습은 흉부 엑스선 영상으로부터 흉부질환을 탐지하는 실시예로서 구현할 수 있다. 도 10을 참조하면, 도 4 및 도 5를 참조하여 설명한 연합학습의 결과로서 각 클라이언트 장치(110, 120, 130)에 서 학습된 로컬 모델(222, 223, 224, 225)의 가중치를 병합하고 이를 반영해 갱신한 글로벌 모델을 준비한 다(S1010). 그리고, 진단 대상자의 흉부 엑스선 영상을 획득한다. 여기서, 흉부 엑스선 영상을 획득한다는 것은 엑스선 촬 영장비를 이용해 직접 촬영하는 것일 수도 있고, 별도의 엑스선 촬영장비에 의해 촬영된 데이터를 입력받는 것 일 수 있다(S1020). 다음으로, 단계 S1010에서 준비한 글로벌 모델에 단계 S1020에서 획득한 흉부 엑스선 영상을 입력하여, 글 로벌 모델의 출력으로서 진단 대상자의 흉부질환 탐지 결과를 생성할 수 있다(S1030). 도 4 및 도 5의 자기진단학습을 사용하는 연합학습 방법은 복수의 클라이언트 장치 및 서버에 의해 수행될 수 있고, 도 10의 흉부질환 탐지 방법은 연합학습이 완료된 서버에 의해 수행될 수 있다. 또, 연합 학습이 완료된 서버로부터 가중치가 복수의 클라이언트 장치로 전달된 경우에 이를 각 로컬 모델 (222, 223, 224, 225)에 반영해 도 10의 흉부질환 탐지 방법을 수행할 수 있다. 복수의 클라이언트 장치 및 서버는 필요한 연산능력을 갖는 컴퓨팅 자원에 의해 구현될 수 있고, 이러한 컴퓨팅 자원을 예시하면 도 11의 컴퓨팅 장치로 나타낼 수 있다. 도 11을 참조하면, 컴퓨팅 장치는 메모리부, 프로세서부 및 통신부를 포함할 수 있고, 입력부 및/또는 출력부를 더 포함할 수 있다. 다만, 도 11에 도시된 구성도는 예시적인 것에 불과 한 바, 본 발명의 사상이 도 11에 도시된 구성도에 의해 한정 해석되는 것은 아니다. 예컨대, 컴퓨팅 장치 는 도 11에 도시되지 않은 구성을 적어도 하나 포함하거나 도 11에 도시된 구성 중 적어도 하나를 포함하 지 않을 수 있다. 메모리부는 정보를 저장하는 매체에 의해 구현 가능하다. 이러한 매체에는 ROM이나 RAM 등이 포함되며, 다만 이에 한정되는 것은 아니다. 이러한 메모리부에는 데이터 또는 이하에서 설명될 프로세서부에 의해 실행 가능한 적어도 하나의 명령어가 저장된다. 또한 이러한 메모리부에는 도 4 및 도 5를 참조하여 설명한 자기지도학습을 적용한 연합학습 방법 및/또는 도 10을 참조하여 설명한 흉부질환 탐지 방법을 프로세서 부가 수행할 수 있도록 하는 컴퓨터 프로그램이 저장될 수 있다. 프로세서부는 적어도 하나의 코어를 갖는 처리 장치에 의해 구현 가능하다. 예컨대 적어도 하나의 CPU 또 는 GPU 등을 포함하여 프로세서부가 구현될 수 있다. 이러한 프로세서부는 메모리부에 저장되어 있는 전술한 데이터나 명령어를 읽어올 수 있고, 메모리부에 새로운 데이터나 명령어를 기록할 수 있다.또한, 프로세서부는 이미 기록되어 있는 데이터나 명령어를 수정하거나 삭제할 수 있다. 이러한 프로세서부에 의해 컴퓨팅 장치는 다양한 기능을 수행할 수 있다. 예를 들어, 자기지도학습 을 적용한 연합학습 방법 및/또는 흉부질환 탐지 방법을 수행할 수 있다. 이러한 프로세서부에 대해서는 아래에서 다시 설명하기로 한다. 통신부는 프로세서부의 제어에 따라 통신을 수행한다. 컴퓨팅 장치가 서버로서 기능하 는 경우, 통신부는 각 로컬 데이터를 기반으로 학습하는 복수의 클라이언트 장치(110, 120, 130)에 대하 여 프로세서부의 제어에 따라 통신을 수행한다. 컴퓨팅 장치가 클라이언트 장치(110, 120, 130)로 서 기능하는 경우, 통신부는 서버에 대하여 프로세서부의 제어에 따라 통신을 수행한다. 입력부는 컴퓨팅 장치가 각종 명령이나 데이터를 입력 받는 인터페이스이다. 컴퓨팅 장치가 서버로서 기능하는 경우, 입력부를 통해 언레이블 데이터 및/또는 연합학습 명령 등이 입력될 수 있 다. 컴퓨팅 장치가 클라이언트 장치(110, 120, 130)로서 기능하는 경우, 입력부를 통해 진단 대상 자의 흉부 엑스선 영상 및/또는 질환 탐지 명령 등이 입력될 수 있다. 출력부로는 프로세서부에 의한 각종 처리 결과가 다양한 형태로 출력될 수 있다. 예를 들어, 프로 세서부에 의한 각종 처리 결과가 사용자가 인지할 수 있는 형태로 출력될 수 있다. 프로세서부에 의해 컴퓨팅 장치가 다양한 기능을 수행할 경우, 자기지도학습을 적용한 연합학습 방 법, 흉부질환 탐지 방법 등은 앞서 도 4, 도 5 및 도 10을 참조하여 설명한 바 있다. 프로세서부에 의해 수행될 수 있는 자기지도학습을 적용한 연합학습 방법에 따르면, 언레이블 데이터를 입력으로 받아 적용할 자기지도학습에 맞게 데이터를 변형할 수 있고, 변형한 데이터에 기반해 가상 레이블을 생성할 수 있으며, 생성한 가상 레이블과 변형한 데이터를 이용한 자기지도학습을 진행해 언레이블 데이터로부 터 표현을 학습할 수 있고, 학습한 자기지도학습의 표현을 연합학습의 글로벌 모델에 전이할 수 있으며, 학습한 자기지도학습의 표현이 전이된 글로벌 모델을 사용해 연합학습을 진행할 수 있다. 프로세서부에 의해 수행될 수 있는 흉부질환 탐지 방법에 따르면, 연합학습의 결과로서 각 클라이언트 장 치에서 학습된 로컬 모델의 가중치를 병합해 갱신된 글로벌 모델을 준비할 수 있고, 진단 대상자의 흉부 엑스선 영상을 획득할 수 있으며, 글로벌 모델에 흉부 엑스선 영상을 입력하여, 글로벌 모델의 출력으로서 진단 대상자 의 흉부질환 탐지 결과를 생성할 수 있다. 도 12 및 도 13은 본 발명의 일 실시예에 따라 언레이블 데이터에 대한 다양한 증강 방식에 따른 성능을 분석한 도면이다. 서버에서 시행되는 자기지도학습은 하나의 이미지에 데이터 증강 기법이 적용된 두 개의 뷰에 내재된 표현 을 비교해 가며 학습을 할 수 있다. 이때, 어떠한 데이터 증강 기법을 적용했는지에 따라 자기지도학습의 결과 인 데이터 표현이 많은 차이를 보이게 된다. 그렇기 때문에, 다양한 데이터 증강 기법과 그 조합들이 흉부 엑스 선을 사용한 자기지도학습의 결과에 어떠한 영향을 미치는지 분석을 진행했다. 분석을 위한 데이터 증강 기법은 Rigid Transform: {Random Rotation, Random Horizontal Flip}, Color Transform: {Brightness, Contrast, Saturation, Hue}, Quality Transform: {Gaussian Blur, Gaussian Noise}, Semantic Transform: {Affine Transform, Cutout}과 같이 총 4가지 타입으로 분류했다. 도 13은 자기 지도학습으로 학습한 표현을 평가하는 방법인 Linear Evaluation을 통해 적용한 데이터 증강 기법에 따라 학습 한 데이터의 표현을 평가한 결과이다. 대각성분은 하나의 데이터 증강 타입만을 적용한 경우이며, 이외의 성분 들은 두 개의 데이터 증강 타입을 순차적으로 적용한 결과이다. 위의 결과를 통해 Color Transform이 단일 데이 터 증강뿐만 아니라 여러 기법과의 조합에서도 좋은 성능을 보이는 것으로 보아 흉부 엑스선에 자기지도학습을 적용할 때 고려할 수 있는 데이터 증강 기법임을 알 수 있다. Color Transform이 효과적인 이유는 도 13에서 확인할 수 있다. 도 13은 하나의 이미지에서 Random Resized Crop의 결과로 생성된 여러 패치들과 해당 패치에 데이터 증강 기법을 적용했을 때 픽셀값의 분포도이다. 그 결 과, 오직 Color Transform만이 픽셀값의 분포를 변화시켜 데이터의 표현을 학습할 때 픽셀값 분포의 유사성에서 비롯된 일종의 지름질의 학습을 방지하므로 효과적이라는 것을 알 수 있다. 개별적인 데이터 증강 기법 및 그 조합에 대한 분석 외에도 3가지 이상의 데이터 증강기법 조합에 대해서도 분 석한 결과는 표 2와 같다.표 2 Method Augmentation Mean AUC Color Quality Rigid Semantic (a) ○ ○ ○ 73.96 (b) ○ ○ ○ 73.24 (c) ○ ○ ○ 73.13 (d) ○ ○ ○ 73.07 (e) ○ ○ ○ ○ 74.06 표 2의 분석 결과에 의하면, 일반적으로 많은 수의 데이터 증강 기법을 중복해서 사용하는 경우 더욱 질 높은 데이터의 표현을 학습한다는 것을 알 수 있었다. 그러나, 4가지의 데이터 증강 타입을 전부 사용한 경우 3가지 를 적용했을 때와 비교했을 때 충분한 향상을 이루지 못했으므로, 계산 복잡도 등을 고려했을 때 Color + Quality + Rigid Transform을 사용하는 경우가 최적의 데이터 증강 기법의 조합이라는 것을 확인할 수 있었다. 도 14는 클라이언트 별 Non-IID 데이터 분포를 나타낸 그래프이고, 도 15는 도 14와 같은 Non-IID 데이터 분포 환경에서의 흉부질환 탐지 결과를 나타낸 그래프이며, 도 16은 적은 수의 데이터에서 연합학습의 성능을 평가한 그래프이다. 각 클라이언트는 보유하고 있는 데이터만을 사용해 로컬 모델을 학습하게 된다. 각 클라이언트의 데이터가 다른 Non-IID 환경의 경우, 보유한 데이터의 차이로 인해 로컬 모델의 학습 결과도 편차가 발생해 글로벌 모델을 올 바른 방향으로 업데이트 하지 못하는 클라이언트 드리프트 문제가 발생하게 된다. 연합학습에서 일반적으로 글로벌 모델을 초기화하는 방법인 임의의 값으로 초기화 한 경우와 자기지도학습 모델 을 사용해 글로벌 모델을 초기화 한 경우에 흉부 엑스선을 사용해 진단할 수 있는 14개의 흉부질환에 대한 예측 정확도를 평가한 것이 도 14이다. 임의의 값으로 연합학습의 글로벌 모델을 초기화한 'Random Init'의 경우 Non-IID 환경으로 인해 발생한 클라이언트 드리프트 문제를 해결하지 못해 개별 질병에 대한 정확도와 전체적인 평균 정확도도 72.10%으로 낮은 반면, 자기지도학습을 사용해 글로벌 모델을 초기화 한 경우 개별 질병에 대한 정확도가 임의의 값으로 초기화한 경우보다 모두 높을 뿐만 아니라, 전체적인 평균 정확도도 78.38%로 약 6%가 량 상승했다. 도 16은 레이블링을 하기 어려운 흉부 엑스레이 데이터의 특징을 고려해 클라이언트의 데이터의 일부만을 사용 해 연합학습을 진행한 결과를 나타낸 것이다. 임의의 값으로 글로벌 모델을 초기화 한 경우, 학습에 사용한 데 이터의 비율이 줄어듦에 따라 급속도로 정확도가 하락한다. 그러나, 자기지도학습을 사용해 글로벌 모델을 초기 화 하는 경우 사용하는 데이터의 수가 줄어들더라도 정확도의 감소폭이 크지 않다. 한편, 전술한 실시예에 따른 자기지도학습을 적용한 연합학습 방법, 흉부질환 탐지 방법에 포함된 각각의 단계 를 프로세서가 수행하도록 하기 위한 명령어를 포함하도록 컴퓨터 프로그램이 구현될 수 있다. 또한, 전술한 실시예에 따른 자기지도학습을 적용한 연합학습 방법, 흉부질환 탐지 방법에 포함된 각각의 단계 를 프로세서가 수행하도록 하기 위한 명령어를 포함하는 컴퓨터 프로그램은 컴퓨터 판독 가능한 기록매체에 기 록될 수 있다. 지금까지 설명한 바와 같이, 본 발명의 일 실시예에 따르면, 데이터 변형 후 자기지도학습을 수행한 로컬학습의 결과를 연합학습에 반영함으로써 데이터 레이블이 부족하거나 로컬들에 흩어져 있는 Non-IID 데이터 환경에서도 우수한 학습 결과를 제공한다. 또한, 일 실시예에 따른 데이터 변형 후 자기지도학습을 수행한 로컬학습의 결과를 연합학습에 반영해 흉부질환 에 대한 탐지에 활용함으로써, 흉부질환에 대한 탐지의 정확성을 향상시킨 효과가 있다. 첨부된 블록도의 각 블록과 흐름도의 각 단계의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수도 있 다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로 세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로 세서를 통해 수행되는 그 인스트럭션들이 블록도의 각 블록 또는 흐름도의 각 단계에서 설명된 기능들을 수행하 는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트럭션들 은 블록도의 각 블록 또는 흐름도 각 단계에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목 을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세 싱 장비 상에 탑재되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련 의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 블록도의 각 블록 및 흐름도의 각 단계에서 설명된 기능들을 실행하 기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록 또는 각 단계는 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들 을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실시예들에서는 블록들 또 는 단계들에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시 되어 있는 두 개의 블록들 또는 단계들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들 또는 단계들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술사상은 본 발명의 권 리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0185682", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 연합학습을 수행할 수 있는 서버-클라이언트 연합학습 시스템의 구성도이다. 도 2 및 도 3은 본 발명의 일 실시예에 따른 자기지도학습 및 연합학습의 개념도들이다. 도 4 및 도 5는 본 발명의 일 실시예에 따른 자기지도학습 모델을 사용한 연합학습 방법을 설명하기 위한 흐름 도들이다. 도 6 및 도 7은 본 발명의 일 실시예에 따른 연합학습 방법 중 데이터 변형의 예를 보인 것이다. 도 8 및 도 9는 본 발명의 일 실시예에 따른 자기지도학습에 적용할 수 있는 RFID 프레임워크를 나타낸 것이다. 도 10은 본 발명의 일 실시예에 따른 자기지도학습 및 연합학습을 적용한 흉부질환 탐지 방법을 설명하기 위한 흐름도이다. 도 11은 본 발명의 일 실시예에 따른 클라이언트 장치 또는 서버로 기능할수 있는 컴퓨팅 장치의 구성도이다. 도 12 및 도 13은 본 발명의 일 실시예에 따라 언레이블 데이터에 대한 다양한 증강 방식에 따른 성능을 분석한 도면이다. 도 14는 클라이언트 별 Non-IID 데이터 분포를 나타낸 그래프이다. 도 15는 도 14와 같은 Non-IID 데이터 분포 환경에서의 흉부질환 탐지 결과를 나타낸 그래프이다. 도 16은 적은 수의 데이터에서 연합학습의 성능을 평가한 그래프이다."}
