{"patent_id": "10-2021-0167771", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0080234", "출원번호": "10-2021-0167771", "발명의 명칭": "3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템 및 이를 이용", "출원인": "주식회사 어니언소프트웨어", "발명자": "이진규"}}
{"patent_id": "10-2021-0167771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "3상 모터의 계측기에서 측정한 파형(wave)형태의 전력 주파수 데이터를 수집하는 제1관리부와;제1관리부에서 수집된 파형 형태의 전력 주파수 데이터를 전달받아서 이를 스펙트로그램(spectrogram)으로 변환하는 한편, 스펙트로그램을 차원 축소하여 차원축소된 데이터를 군집화(clustering)하여 모터의 동작상태와 관련된 군집 데이터를 생성하고 이를 바탕으로 모터의 정상 구동 여부를 판단하는 제2관리부와;수집되고 변환되는 데이터가 누적되되, 모터의 구동 최초 시기부터 일정 시간까지의 데이터를 정상 구동 데이터로 라벨링하고 이를 저장하는 저장부를 포함하며, 제2관리부는 정상으로 평가받은 이상 감지 모델을 이용하여 정상 구동 여부를 판별하되, 이상 감지 모델은 3상 모터가 장착된 시스템의 초기 구동시부터 소정 기간동안 누적된 군집 데이터가 3상 모터의 전력 주파수 데이터의 표준적인 군집 형태와 소정 기준 이상 부합하는 경우에 정상으로 평가받는 것을 특징으로 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템."}
{"patent_id": "10-2021-0167771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1관리부는 데이터 수집부, 예측부, 요청부를 포함하되, .데이터 수집부는 계측기가 수집한 데이터가 저장되는 디렉토리에 저장되어 있는 파형 형태의 전력 주파수데이터를 주기적으로 취합하여 끌어오는 역할을 수행하고, 예측부는 정상적인 이상 감지 모델로 평가된 모델 및 실측된 데이터 를 이용하여 이상 감지를 수행하는 역할을수행하고, 요청부는 실측된 데이터 중 특이한 데이터가 발생하는 경우, 이의 이상감지 유무 및 정상성 여부를 제2관리부에판단요청을 하는 역할을 수행하는 것을 특징으로 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템."}
{"patent_id": "10-2021-0167771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,제2관리부는 데이터 변환부, 데이터 전처리부, 학습 훈련부, 평가부를 포함하되, 데이터 변환부는 전력 주파수의 파형 데이터를 스펙트로그램으로 변환하고 PCA를 이용하여 차원축소를 통해서각각의 데이터를 군집화할 수 있도록 변환하는 역할을 수행하고, 데이터 전처리부는 군집화된 데이터 중 아웃라이어를 제거하고 스케일링 하여 데이터를 평활화 또는 정규화하는역할을 수행하며, 학습 훈련부는 인공지능과 머신러닝을 이용하여 펌프 시스템이 초기부터 정상상태로 동작하는 경우에 정상 상태로 추정되면서 축적된 데이터를 바탕으로 정상 상태와 이상 상태를 분류할 수 있도록 학습 훈련시키는 것을 특징으로 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템."}
{"patent_id": "10-2021-0167771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제2관리부는 이상 판단부와, 분류부와, 데이터 라벨링부를 더 포함하며, 이상 판단부는 제1관리부에서 특이한 데이터가 감지되어 이에 대한 이상 유무 판단 요청이 오는 경우, 저장소에저장된 정상 데이터를 근거로 이상 유무를 판정하고, 이상 데이터로 판정된 경우, 분류부에 의하여 이상 데이터공개특허 10-2023-0080234-3-로 분류되록 하여 추후 이상 감지의 학습 대상이 되도록 하고, 분류부는 정상적인 이상 감지 모델에 근거하여, 실측된 데이터 셋을 정상적인 데이터 셋과 비정상적 데이터 셋으로 분류하는 역할을 수행하며, 데이터 라벨링부는 분류된 정상적인 데이터와 비정상적인 데이터에 대한 정의를 하고 이에 대한 라벨을 제공하는 역할을 수행하는 것을 특징으로 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템."}
{"patent_id": "10-2021-0167771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,정상적인 이상 감지 모델의 바탕이 되는 군집 데이터를 소정 기준 이상 이탈하는 경우를 이상 동작으로 판단하여 이에 대한 알람 처리를 하고, 이상 동작과 관련되는 데이터는 저장소에 저장되고, 이상 감지 모델의 학습에 반영되는 것을 특징으로 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프설비의 이상 감지 시스템."}
{"patent_id": "10-2021-0167771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1관리부에 의하여 3상 모터의 전력 주파수의 파형 데이터를 수집하는 단계와;제2관리부에 의하여 전력 주파수의 파형 데이터를 스펙트로그램 및 군집 데이터로 변환하는 단계와;제2관리부에 의하여 변환된 군집데이터를 전처리하는 단계와; 제2관리부에 의하여 이상 감지 모델을 훈련시키고, 이의 훈련된 모델의 적정성을 평가하는 단계와;이상 감지 모델이 제2관리부에 의하여 적정하다고 평가받은 경우, 제1관리부가 적정한 이상 감지 모델을 바탕으로 3상 모터가 장착된 펌프 시스템의 이상 동작 여부를 감시하는 단계를 포함하는 것을 특징으로 하는 3상 모터전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 방법."}
{"patent_id": "10-2021-0167771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 이상 감지 모델은 3상 모터가 장착된 시스템의 초기 구동시부터 소정 기간동안 누적된 군집 데이터가 3상 모터의 전력 주파수 데이터의 표준적인 군집 형태와 소정 기준 이상 부합하는 경우에 정상으로 평가받는 것을 특징으로 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 방법."}
{"patent_id": "10-2021-0167771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,제2관리부에 의하여 전력 주파수의 파형 데이터를 스펙트로그램으로 변환되는 단계는;SSTF(Short Time Fourier Transform)을 이용하여 전력 주파수의 파형 데이터를 스펙트로그램으로 변환하되,변환된 스펙트로그램의 X축은 시간, Y축은 주파수, 명암은 진폭을 표시하는 것을 특징으로 하는 3상 모터 전력데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 방법."}
{"patent_id": "10-2021-0167771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 제6관리부에 의하여 스펙트로그램으로 표현된 데이터가 군집 데이터로 변환되는 단계는;PCA법에 의하여 차원이 축소되어 점으로 축소되고, 각각의 데이터에 대응되는 점은 클러스터링 되어 2차원 그래프에 유사 특성값을 갖는 점끼리 모여서 군집을 형성하는 것을 특징으로 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 방법. 공개특허 10-2023-0080234-4-청구항 10 제6항에 있어서,상기 제1관리부는 정상적인 이상 감지 모델의 바탕이 되는 군집 데이터를 소정 기준 이상 이탈하는 경우를 이상동작으로 판단하여 이에 대한 알람 처리를 하며, 이상 동작과 관련되는 데이터는 저장소에 저장되고, 이상 감지 모델의 학습에 반영되는 것을 특징으로 하는 3상모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 방법."}
{"patent_id": "10-2021-0167771", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템 및 이를 이용한 이상 감지 방법으로서, 미리 고장에 대한 학습 없이, 3상 모터가 장착된 시스템을 동작시켜서 자체적으로 인공지능을 이용하여 정상 작동 상태와 비정상 작동 상태를 학습하여 이상 유무를 감지할 수 있도록 하는 3상 모터 전력 데 (뒷면에 계속)"}
{"patent_id": "10-2021-0167771", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템 및 이를 이용한 이상 감지 방법으로서, 미리 고장에 대한 학습 없이, 3상 모터가 장착된 시스템을 동작시켜서 자체적으로 인공지능을 이용하여 정상 작동 상태와 비정상 작동 상태를 학습하여 이상 유무를 감지할 수 있도록 하는 3상 모터 전력 데 이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템 및 이를 이용한 이상 감지 방법을 제공한다."}
{"patent_id": "10-2021-0167771", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "펌프는 지하에 있는 물을 지상으로 끌어올려서 사용하도록 하거나 물탱크 같은 곳에 저장된 물을 외부로 공급하 도록 작동하는 장치로서 양수기라고도 부르며, 생활용 펌프부터 각종 산업용 펌프까지 다양하게 사용되고 있다. 이때, 펌프의 종류는 회전력을 이용한 원심펌프와 피스톤 왕복운동을 이용한 용적식 펌프로 크게 구분되며, 용 도와 작동방식에 따라 세분하게 구분되고 있으며 그 중에서 원심펌프가 가장 널리 사용되고 있다. 하지만, 장기간 원심펌프를 사용하다 보면 주로 베어링 결함, 축 휨, 정렬불량, 누수 등의 고장이 일어날 수 있 으며, 고장난 부품을 교체하지 않고 계속 사용하면 원심펌프의 고장뿐만 아니라 연결된 다른 설비의 고장으로 이어질 수 있는 가능성도 발생한다. 따라서 원심펌프는 주기적으로 성능검사를 수행하여 고장부위를 진단하고, 고장부위가 발견되면 해당 부품을 교 체하는 유지보수정비를 통해 원심펌프의 신뢰성을 유지해야 할 필요성이 있는 것이다. 이러한 펌프 모터의 고장 여부를 머신러닝을 통해서 학습하고 진단할 수 있는 방법이 한국 공개특허 10-2021- 0108168에서는 펌프가 정상적으로 동작하는 경우의 데이터와 비정상적으로 동작하는 경우의 데이터를 입력하여 학습시켜서 추후에 이상 감지 유무를 판단하는 방법이 개시되어 있다. 그런데 이러한 경우, 다양한 고장상태를 일일히 입력해주어야 하는 불편함이 존재하며, 노후화와 같은 시간에 따른 시스템의 변동에 즉각적으로 대응하기 어렵다는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허 10-2021-0108168 (2021. 9. 2 공개)"}
{"patent_id": "10-2021-0167771", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 미리 고장에 대한 학습이 없이, 모터가 장착된 시스템을 동작시켜서 자체적으로 인공지능과 머신러닝 을 이용하여 정상 작동 상태와 비정상 작동 상태를 학습하여 이상 유무를 감지할 수 있도록 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템 및 이를 이용한 이상 감지 방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2021-0167771", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위한 본 발명은; 3상 모터의 계측기에서 측정한 파형(wave)형태의 전력 주파수 데이터 를 수집하는 제1관리부와; 제1관리부에서 수집된 파형 형태의 전력 주파수 데이터를 전달받아서 이를 스펙트로 그램(spectrogram)으로 변환하는 한편, 스펙트로그램을 차원 축소하여 차원축소된 데이터를 군집화(clusterin g)하여 모터의 동작상태와 관련된 군집 데이터를 생성하고 이를 바탕으로 모터의 정상 구동 여부를 판단하는 제 2관리부와; 수집되고 변환되는 데이터가 누적되되, 모터의 구동 최초 시기부터 일정 시간까지의 데이터를 정상 구동 데이터로 라벨링하고 이를 저장하는 저장부를 포함하며, 제2관리부는 정상으로 평가받은 이상 감지 모델 을 이용하여 정상 구동 여부를 판별하되, 이상 감지 모델은 3상 모터가 장착된 시스템의 초기 구동시부터 소정 기간동안 누적된 군집 데이터가 3상 모터의 전력 주파수 데이터의 표준적인 군집 형태와 소정 기준 이상 부합하 는 경우에 정상으로 평가받는 것을 특징으로 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 시스템을 제공한다. 또한, 본 발명은 상기 제1관리부는 데이터 수집부, 예측부, 요청부를 포함하되, 데이터 수집부는 계측기가 수 집한 데이터가 저장되는 디렉토리에 저장되어 있는 파형 형태의 전력 주파수데이터를 주기적으로 취합하여 끌어 오는 역할을 수행하고, 예측부는 정상적인 이상 감지 모델로 평가된 모델 및 실측된 데이터 를 이용하여 이상 감지를 수행하는 역할을 수행하고, 요청부는 실측된 데이터 중 특이한 데이터가 발생하는 경우, 이의 이상감지 유무 및 정상성 여부를 제2관리부에 판단요청을 하는 역할을 수행하는 것을 특징으로 한다. 또한, 본 발명은 제2관리부는 데이터 변환부, 데이터 전처리부, 학습 훈련부, 평가부를 포함하되, 데이터 변환 부는 전력 주파수의 파형 데이터를 스펙트로그램으로 변환하고 PCA를 이용하여 차원축소를 통해서 각각의 데이 터를 군집화할 수 있도록 변환하는 역할을 수행하고, 데이터 전처리부는 군집화된 데이터 중 아웃라이어를 제거 하고 스케일링 하여 데이터를 평활화 또는 정규화하는 역할을 수행하며, 학습 훈련부는 인공지능과 머신러닝을 이용하여 펌프 시스템이 초기부터 정상상태로 동작하는 경우에 정상 상태로 추정되면서 축적된 데이터를 바탕으 로 정상 상태와 이상 상태를 분류할 수 있도록 학습 훈련시키는 것을 특징으로 한다. 또한, 본 발명은 상기 제2관리부는 이상 판단부와, 분류부와, 데이터 라벨링부를 더 포함하며, 이상 판단부는 제1관리부에서 특이한 데이터가 감지되어 이에 대한 이상 유무 판단 요청이 오는 경우, 저장소에 저장된 정상 데이터를 근거로 이상 유무를 판정하고, 이상 데이터로 판정된 경우, 분류부에 의하여 이상 데이터로 분류되록 하여 추후 이상 감지의 학습 대상이 되도록 하고, 분류부는 정상적인 이상 감지 모델에 근거하여, 실측된 데 이터 셋을 정상적인 데이터 셋과 비정상적 데이터 셋으로 분류하는 역할을 수행하며, 데이터 라벨링부는 분류된 정상적인 데이터와 비정상적인 데이터에 대한 정의를 하고 이에 대한 라벨을 제공하는 역할을 수행하는 것을 특 징으로 한다. 또한, 본 발명은 정상적인 이상 감지 모델의 바탕이 되는 군집 데이터를 소정 기준 이상 이탈하는 경우를 이상 동작으로 판단하여 이에 대한 알람 처리를 하고, 이상 동작과 관련되는 데이터는 저장소에 저장되고, 이상 감 지 모델의 학습에 반영되는 것을 특징으로 한다. 또한, 본 발명은 제1관리부에 의하여 3상 모터의 전력 주파수의 파형 데이터를 수집하는 단계와; 제2관리부에 의하여 전력 주파수의 파형 데이터를 스펙트로그램 및 군집 데이터로 변환하는 단계와; 제2관리부에 의하여 변 환된 군집데이터를 전처리하는 단계와; 제2관리부에 의하여 이상 감지 모델을 훈련시키고, 이의 훈련된 모델의 적정성을 평가하는 단계와; 이상 감지 모델이 제2관리부에 의하여 적정하다고 평가받은 경우, 제1관리부가 적정 한 이상 감지 모델을 바탕으로 3상 모터가 장착된 펌프 시스템의 이상 동작 여부를 감시하는 단계를 포함하는 것을 특징으로 하는 3상 모터 전력 데이터에 대한 인공지능을 이용한 펌프 설비의 이상 감지 방법을 제공한다. 이상 감지 모델은 3상 모터가 장착된 시스템의 초기 구동시부터 소정 기간동안 누적된 군집 데이터가 3상 모터 의 전력 주파수 데이터의 표준적인 군집 형태와 소정 기준 이상 부합하는 경우에 정상으로 평가받는 것을 특징 으로 한다. 제2관리부에 의하여 전력 주파수의 파형 데이터를 스펙트로그램으로 변환되는 단계는;SSTF(Short Time Fourier Transform)을 이용하여 전력 주파수의 파형 데이터를 스펙트로그램으로 변환하되, 변환된 스펙트로그램의 X축은 시간, Y축은 주파수, 명암은 진폭을 표시하는 것을 특징으로 한다. 제6관리부에 의하여 스펙트로그램으로 표현된 데이터가 군집 데이터로 변환되는 단계는;PCA법에 의하여 차원이 축소되어 점으로 축소되고, 각각의 데이터에 대응되는 점은 클러스터링 되어 2차원 그래프에 유사 특성값을 갖는 점끼리 모여서 군집을 형성하는 것을 특징으로 한다. 상기 제1관리부는 정상적인 이상 감지 모델의 바탕이 되는 군집 데이터를 소정 기준 이상 이탈하는 경우를 이상 동작으로 판단하여 이에 대한 알람 처리를 하며, 이상 동작과 관련되는 데이터는 저장소에 저장되고, 이상 감 지 모델의 학습에 반영되는 것을 특징으로 한다."}
{"patent_id": "10-2021-0167771", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 펌프의 모터의 이상 동작은 필연적으로 전력 주파수 파형의 이상을 유발하는데, 이러한 전력 주파수의 파형의 변화를 측정하여 이상 감지 여부를 판정하므로 진동센싱이나 소리 센싱에서 필연적으로 수반되 는 노이즈에 의한 방해를 제거할 수 있는 장점이 있다. 계측기를 통한 웨이브 형태의 주파수 파형을 수집하되, 이상 진단을 위한 준비 단계로서 정상 운전 상태의 주파 수 파형을 수집하고, 이를 분석하기 위해서 스펙트로그램(spectrogram)으로 변환하고, 여기서 더 나아가 군집 형태를 분석하기 위해서 차원축소를 통하여 인공지능과 머신러닝을 통해서 훈련과 학습을 수행할 수 있다. 특히 웨이브 형태의 주파수 파형을 스펙트로그램으로 변환함으로써 파형을 시각화 하고, 데이터의 수치적 시간 적 특성을 고려할 수 있으며, 인공지능과 머신러닝을 위한 효율적인 입력 데이터를 준비할 수 있다. 정상 상태에 대한 신뢰성 있는 군집 모델을 생성하고, 이를 벗어나는 데이터 발견시 이를 이상 동작으로 판정하 고, 각각의 이상 동작 상태에 대한 분류작업 및 라벨 생성이 가능하며, 이를 토대로 학습을 통해서 이상 감지를 지속적으로 수행할 수 있다. 정상 상태 운전의 경우, 수집되는 주파수 파형이 다양한 수치적 특성을 반영하기 때문에, 다양한 형태의 군집을 형성하고, 이는 펌프 시스템이 설치된 환경적인 특성을 반영할 수 있는 이상 감지 모델을 구현할 수 있는 장점 을 제공한다. 한편, 본 발명은 미리 고장 상태를 만들어서(예, 축 정렬 고정 상태, 또는 임펠러의 언밸런싱 상태, 스테이터의 고장 등) 고장에 대한 데이터를 취득하는 불편함이 없이, 정상상태의 펌프 시스템을 동작시키되, 인공지능과 머신러닝을 이용하여 이상 감지 모델을 훈련시키고, 평가 하여, 평가을 통과한 모델에 근거하여 정상 작동 상태 와 이상 작동 상태를 감지하고 이를 분류할 수 있다는 장점이 있다. 또한, 이상 감지 평가 모델의 경우, 3상 모터의 전력 주파수 데이터가 형성하는 군집의 수 및 군집의 배치 상태 에 대한 정보를 이용하여 적합성 여부를 판정하므로, 3상 모터를 사용하는 펌프 시스템의 특성을 반영할 수 있 어서 신뢰성을 높일 수 있다는 장점이 있다. 제1관리부(AI디바이스) 및 제2관리부(AI모델링부)를 멀티 티어(multi-tier)구조로 제공하고, 제1관리부와 제2관 리부의 역할을 구분함으로써, 역할 분담에 의하여 데이터 수집, 이상 감지 예측, 이상 감지 판단, 상태 정보 저 장 등과 같은 여러가지 업무에 대한 부담을 줄일 수 있다는 장점이 있다. 또한, 본 발명은 이상 감지의 민감도를 조절함으로써, 잦은 이상 감지 이벤트의 발생으로 인한 현장의 혼란을 방지할 수 있다. 즉, 한 종류의 이벤트가 아닌 하나 이상의 이벤트 발생시 이를 논리곱이나 합으로 처리하여 복합적인 이벤트시 에만 이상 동작으로 판별하거나, 또는 이벤트 발생의 지속 시간이나, 또는 일정 시간내에 발생하는 횟수나, 일 정 시간 내에서의 연속 발생 등의 경우에만 이상 감지로 인식함으로써 현자의 혼란을 방지하면서 확실한 이상 감지를 수행할 수 있다는 장점이 있다."}
{"patent_id": "10-2021-0167771", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포 함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제2 구성요소는 제1 구성요소로 명명될 수 있고, 유사하 게 제1 구성요소도 제2 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목 을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 이하, 첨부된 도면을 참조하여 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거나 대응하는 구성 요 소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 도 1은 본 발명에 따른 운전제어방법이 적용될 수 있는 병렬 가변압펌프 시스템을 도시한 구성도이다. 도 1을 참조하면, 물이 저수되어 있는 저수조에서 복수개의 물사용처(510, 530, 550)로 물을 공급하기 위 하여 복수개의 가변압펌프(100; 101, 102, 103)가 병렬로 배치될 수 있다. 구체적으로, 상기 저수조에서 물이 공급되는 공급라인이 연장되어 형성되고, 상기 복수개의 공급라인 을 따라 상기 복수개의 가변압 펌프가 병렬로 배치된다. 이때, 상기 복수개의 가변압 펌프는 제어부를 통한 인버터 제어방식으로 압력 또는 유량이 제어될 수 있다. 상기 복수개의 가변압 펌프의 출력측은 공통 급수라인으로 연결되고, 상기 공통 급수라인은 복 수개의 분기 급수라인(610, 630, 650)으로 분기되고, 상기 분기 급수라인(610, 630, 650)이 복수개의 물사용처 (510, 530, 550)와 각각 연결된다. 각 펌프에는 모터(M)가 설치되며 모터(M)에는 3상 전류가 인가된다. 각 모터의 전력 주파수를 측정하는 계 측기(110; 111, 112, 113)가 마련되어 있으며, 계측기에서 측정된 전력 주파수 데이터는 파형(wave) 형태 로 구현되어 본 발명에 따른 이상 감지 시스템에 입력되고, 모터의 이상 감지 여부를 판단하는 기초 자료 가 된다. 도2에서 도시한 바와 같이, 본 발명에 의한 이상 감지 시스템은, 계측기에서 출력된 전력 주파수의 파형 데이터가 저장되는 디렉토리(FTP 디렉토리)와, 위 디렉토리로부터 주기적으로 데이터를 추출 하여 데이터를 저장하고 이를 바탕으로 이상 감지 및 예측에 필요한 작업을 수행하는 제1관리부를 포함한 다. 제1관리부는 AI 디바이스의 역할을 수행하는데, 제1관리부는 데이터의 수집, 이상에 대한 예측, 이 상 감지와 관련되는 통상적인 업무를 수행하는 엣지(edge)컴퓨팅, 데이터 상의 특이점이 발생한 경우, 이러한 데이터에 대한 이상유무를 정밀하게 판단하기 위해 후술하는 제2관리부로의 판단요청(리퀘스트), 데이터 와 관련되는 모터 및 이 모터가 장착된 시스템(펌프 시스템)에 대한 상태 저장등을 수행한다. 제2관리부는 제1관리부와 연동되어 있으며, 제1관리부에서 제공되는 파형 데이터를 스펙트로 그램(spectrogram)과 같은 시각적 데이터로 변환하고, 변환된 데이터를 PCA(주성분 분석; principal component analysis)와 같은 방법을 이용하여 차원축소를 하고, 차원 축소된 데이터들을 클러스터링 방법으로 군집화 하여, 군집화된 데이터를 K-means 알고리즘을 이용하여 모터의 상에 맞는 수의 군집 그래프로 모델링하는 역할 을 수행하고, 모터의 상의 숫자에 맞는 수준으로 만들어지는지 확인할 수 있다. 즉, 3상의 경우에는 3개의 군집 데이터가 나타나야 하는데, 이는 K-means 알고리즘을 이용하여 확인할 수 있다. 그러한 모델이 모터의 특성을 제대로 표현하고 있는지 여부를 판단하고 평가하여(예, 3상 모터의 데이터 군집이 3개가 서로 균형있게 나타나면 정상모델로 평가, 3상 모터 데이터에 대한 군집이 2개 또는 4개로 나타나거나, 3 개로 나타나더라도 특정 방향에 몰려있거나, 불균형하게 나타나면 비정상모델로 평가) 특성을 제대로 반영하고 있다고 한다면 이를 제대로 작동하는 모델로 평가하여 이 모델을 통해서 이상 유무 감지를 하도록하고, 그러지 않다면 모델의 수정이 이루어지도록 한다. 종래 기술들에서는 모터의 동작에 따른 비정상 데이터 또는 정상 데이터가 주어져서 이상 작동 또는 정상 작동 에 대한 해답이 있었고, 이를 실측 데이터와 비교하여 정상 작동 또는 비정상 작동 여부를 판단할 수 있었다. 그러나, 본 발명은 이러한 미리 주어진 데이터가 없는 상태에서 모터가 장착된 제품(예, 펌프)를 작동시켜서 작 동시키는 과정에서 누적된 데이터를 축적하고, 축적된 데이터를 학습 훈련 시킴으로써, 정상/비정상의 판정 기 준이 되는 모델을 만들어나가고, 이를 바탕으로 비정상 작동 여부를 판정하고, 더 나아가서 고장의 예측이나, 시간의 경과에 따른 모델의 갱신(모델 리뉴얼)도 수행할 수 있다. 정상 구동 상태와 관련된 군집 데이터의 데이터 셋을 저장하고 이를 정상상태로 라벨링하여 저장하고, 또한, 비정상 구동 상태와 관련된 데이터 셋을 저장하고, 이를 정상상태와 다르게 구분하도록 비정상 상태로 라벨링 하여 저장하는 제1저장부가 마련된다. 또한 계측기에서 실측되어 제1관리부에 의하여 수집된 데이터가 저장되는 제2저장부가 더 포함된다. 제1관리부와 제2관리부는 멀티 티어(multi tier)구조로 계층화 형태로 구현된다. 데이터 변환(파형 데이터 -> 스펙트로그램 데이터) 및 차원 축소( 스펙트로그램 데이터 -> 점 데이터), 클러스 터링을 통한 데이터 군집화, 새로운 형태의 이상 데이터에 대한 판정 및 라벨링 등의 복잡하고 고차원적 역할은 제2관리부가 수행하고, 데이터의 수집, 라벨링된 정상/비정상 데이터를 기준으로 하여 실측 데이터의 정 상/비정상 여부 판단 및 예측, 각 모터의 상태에 대한 저장 등과 같은 상대적으로 단순하고 저차원적인 역할을 제1관리부가 수행한다. 그리고, 제1관리부는 모니터링부와 연결되되어 모니터링부로부터 모터 또는 모터가 장착 된 장치(예, 펌프)의 상태 정보 요청이 오거나, 측정한 데이터에 대한 조회 요청이 오면 모니터링부로 요 청한 정보를 제공하는 역할도 수행한다.그리고 제1관리부는 계측기에 대한 제어를 수행하는데, 예를 들어서 계측기의 계측을 일정 기 간 멈춰야 하는 경우가 발생하는 경우, 계측 정지 명령을 내리는등 계측 운영에 대한 전반적인 명령을 내릴 수 있다. 도3은 제1관리부와 제2관리부의 구체적인 구조를 도시한 것이다. 제1관리부는 데이터 수집부, 예측부, 요청부, 상태 저장부, 데이터 송신부 , 계측기 관리부를 포함한다. 데이터 수집부는 디렉토리에 저장되어 있는 파형 형태의 전력 주파수데이터를 주기적으로(예, 1분 마다) 취합하여 끌어오는 역할을 수행한다. 예측부는 정상적인 이상 감지 모델로 평가된 모델 및 실측된 데이터 를 이용하여 이상 감지를 수행하는 역할을 수행한다. 요청부은 실측된 데이터 중 특이한 데이터가 발생하는 경우, 이의 이상감지 유무 및 정상성 여부를 제2관 리부에 판단요청을 하는 역할을 수행한다. 상태 저장부는 펌프의 상태를 저장하는 역할을 수행한다. 데이터 송신부는 모니터링부에서 측정 데이터를 요청하거나 펌프 상태의 정보를 요청하는 경우 이를 송신 하는 역할을 수행한다. 계측기 관리부는 계측기의 정지와 동작과 같은 전반적인 계측기에 대한 관리를 수행한다. 제2관리부는 데이터 변환부, 데이터 전처리부, 학습 훈련부, 평가부, 이상 판 단부, 분류부, 데이터 라벨링부를 포함한다. 데이터 변환부는 전력 주파수의 파형 데이터를 스펙트로그램으로 변환하고 더 나아가 차원축소를 통해서 각각의 데이터를 군집화할 수 있도록 변환하는 역할을 수행한다. 데이터 변환부의 구체적인 역할에 대한 설명은 후술하는 제어방법에서 상세하 설명하도록 하겠다. 데이터 전처리부는 군집화된 데이터 중 이른바 튀는 데이터(outlier)를 제거하고 스케일링 하여 데이터를 평활화 또는 정규화하는 역할을 수행한다. 학습 훈련부는 인공지능과 머신러닝을 이용하여 펌프 시스템이 초기부터 정상상태로 동작하는 경우에 정 상 상태로 추정되면서 축적된 데이터를 바탕으로 정상 상태와 이상 상태를 분류할 수 있도록 학습 훈련 시키는 구성요소이다. 학습 훈련부의 훈련에 의하여 다양한 방식의 이상 감지 모델 후보군이 생성된다. 평가부는 생성된 이상 감지 모델 후보군 중에서 적절한 모델을 평가하는 구성요소이다. 평가부에서 이상 감지 모델의 적정성을 판단하는 기준은 아래와 같다. 표 1 평가지표 정의 예지보전의 예 정확도(accuracy) 모델이 분류한 예측값이 Positive이든 negative 이든 true인 비율예측한 모든 경우의 수 중 에 정답을 맞춘 개수의 비율 재현율(recall) 실제값이 positive 인데 모델이 positive로 예측한 비율실제 fault가 날 예정인 경우 중에 모델이 fault를 정확히 예측한 비율 정밀도(precision)모델의 예측값이 positive라고 예측한 결과가 true인 경우모델이 fault가 날 예정으로 예측한 경우 실제 fault가 발 생하는 비율 F1 score 재현율과 정밀도의 조화 평균 모델이 fault가 날 예정인 경 우를 잘 맞추는 비율 특히, 3상 모터의 경우, 데이터의 군집이 도7과 같이 3개의 군집으로 나타나야 하며, 각각의 군집간의 거리도 어느 정도의 이격거리가 있어야 하는데, 이러한 군집을 나타내지 못하는 모델은 적합한 모델이 아니라고 평가할수 있다. 이상 판단부는 제1관리부에서 특이한 데이터가 감지되어 이에 대한 이상 유무 판단 요청이 오는 경 우, 제1저장소에 저장된 정상 데이터를 근거로 이상 유무를 판정하고, 특히 이상 데이터로 판정된 경우, 분류부에 의하여 이상 데이터로 분류되록 하여 추후 이상 감지의 학습 대상이 되도록 한다. 분류부는 적합한 이상 감지 모델이 구축된 경우, 이상 감지 모델에 근거하여 실측된 데이터 셋을 정상적 인 데이터 셋과 비정상적 데이터 셋으로 분류하는 역할을 수행한다. 펌프 시스템의 동작이 계속될 수록 정상적 인 데이터셋과 비정상적 데이터 셋은 누적되고, 이를 활용하여 인공지능 및 머신 러닝을 통한 학습 훈련이 보다 정밀해지고 효율화될 수 있다. 데이터 라벨링부는 분류된 정상적인 데이터와 비정상적인 데이터에 대한 정의를 하고 이에 대한 디지털 라벨을 제공하는 역할을 한다. 도4는 본 발명에 따른 제어 흐름도이며, 여기서는 이상 감지 모델을 훈련시키는 과정과, 이상 감지 서비스를 운 영하는 과정이 서로 연계되어 나타난다. 이상 감지 서비스를 원활하고 정확하게 제공하기 위해서는 그 기준이 되는 이상 감지 모델을 확실하게 정립하는 것이 중요하다. 이를 위해서 이상 감지 모델을 훈련하고, 그 훈련된 내용이 실제 정상적인 상태를 제대로 반영 하고 있는지 여부를 평가하는 프로세스가 필수적이다. 우선 이상 감지 모델을 훈련하는 과정에 대해서 서술한다. 계측기에서 계측된 데이터는 제1관리부에 의하여 수집(S401)되고, 수집된 데이터 들은 제2관리부로 이동되어 제 2관리부에서 데이터 셋으로 구성된다(S402). 구성된 데이터 셋은 웨이브 형태의 주파수 파형 데이터로서 이를 스펙트로그램(spectrogram) 형태 및 군집 데이 터로 변환하고 분석하는 과정을 거친다(S403) 도5(a)와 같은 주파수 파형 데이터의 경우, 노이즈와 신호의 구분이 어려우며, 정상과 비정상의 구분이 용이하 기 않기 때문에, 이를 시각화, 즉 이미지화 하여 정상과 비정상의 구분이 확실하게 이루어지도록 하는 것이 필 요하다. 이를 위해서 도5(b)와 같은 스펙트로그램으로 변환하는데 이 경우, STFT(Short time Fourier Transform)을 이 용하여 변환한다. 변환된 스펙트로그램은 X축은 시간, Y축은 주파수를 나타낸다. 그리고 3차원 구성요소(Z축)의 진폭은 2차원 평면에서 구현할 수 없으므로 이를 명암색상의 진함 옅음으로 표현한다. 이를 통해서 전류 파형에 대한 특성이 더욱 부각되는 효과를 가진다. 즉, 도5(a)와 도6(a)의 파형을 보면, 도 5(a)는 정상상태를 나타내고, 도6(a)는 이상 상태를 나타내지만 실질적으로 구분하기는 어렵다. 그러나, 도5(b)의 경우(정상상태)와 도6(b)(이상 상태)의 경우, 진폭과 관련된 색상 또는 색상의 진하기의 차 이가 구분되므로 이를 통해서 정상상태와 이상상태의 구분이 파형데이터를 이용한 구분보다 용이하게 구분될 수 있다. 한편, 스펙트로그램으로 변환된 데이터의 특징이 잘 두드러지도록 하면서, 이를 군집화된 데이터로 표현하기 위 해서는 각각의 스펙트로그램 데이터를 점(dot)데이터로 차원축소하고, 이러한 점들을 클러스터링 방식으로 군집 화 시켜야 한다. 따라서, 데이터 변환부에서는 PCA(주성분 분석; principal component analysis)와 같은 방법을 이용하여 차원축소를 하고, 차원 축소된 데이터들을 클러스터링 방법으로 군집화 하여, 군집화된 데이터를 K-means 알고 리즘을 이용하여 모터의 상에 맞는 수의 군집 그래프로 모델링하는 역할을 수행한다. 이러한 변환 이후에 데이터 전처리부에 의하여 변환된 데이터 중 튀는 데이터 값을 제거(outlier 제거) 하고, 스케일링을 통해서 데이터를 정규화(normalization)시키는 데이터 전처리 작업을 수행한다(S404). 전처리가 없는 경우, 데이터의 범위가 커져서 학습모델의 성능을 저하시키는 주원인이 될 수 있다. 따라서 학습 을 수행하기 전에 미리 수집된 데이터에 대해서 데이터 전처리 과정을 수행한다. 데이터 전처리 과정을 수행한 후에, 이상 감지 모델을 훈련하는 과정을 수행한다(S405). 이상 감지 모델 훈련 과정에서 각 모터의 3상 전력 주파수에 대한 데이터들을 클러스터링하여 군집 그래프로 구 현하여, 정상/비정상 여부를 판단할 수 있는 기준 모델을 만들어가는 과정을 수행한다. 이상 감지의 모델은 이미 군집을 생성하는 과정에서 학습이 된다. 생성된 군집 모델에 신규 데이터를 넣어 신규 데이터가 군집에 포함되는지를 통해서, 이상 유무를 군집에 포함되었는지로 예측가능하다. 이 때 사용할 수 있 는 알고리즘은 다양하며, 일례로 \"LocalOutlierFactor\"를 적용할 수 있다. 여기서 군집 알고리즘 자체를 데이터에 대한 전처리 및 모델 훈련 머신러닝 알고리즘으로 동시에 이용할 수 있 다. 그리고, 어느정도의 훈련이 완료되면, 해당 이상 감지 모델의 적정성 여부를 평가한다(S406). 여기서 평가지표는 3상 모터가 정상적으로 동작하는 경우 통상적 으로 나타날 수 있는 데이터의 군집도 형태를 기준으로 판단하여, 그 형태를 보이면 정상적인 기준모델을 구비하는 적정한 이상 감지 모델로 판단하고, 그러 한 형태를 보이지 않고 다른 형태를 보이면 부적절한 이상 감지 모델로 판단한다. 예를 들어서, 3상 모터에서 나타나는 전력 주파수에 대한 정상적인 군집데이터의 형태는 도7과 같이, 점선으로 표현되는 기울어진 타원의 바운더리 내에 형성되는 것이 대부분이어야 하며, 도8과 같이 실제 모터를 구동시킨 결과 군집 데이터의 배치 형태가 기준이 되는 타원의 배치 형태와 일정 수준 이상의 유사도 또는 정확도를 보이 면, 이를 정상적인 모델로 평가하여 이를 배포하여(S407) 이를 기준으로 해당 모델의 제공하는 기준에서 일정 기준(거리, 또는 군집 형태)를 벗어나면 작동 중 이상이 발생하는 것으로 판단하여 이상 감지 알람을 제공할 수 있다. 다만, 평가 과정에서 도9와 같이 3개가 아닌 다른 갯수(예, 2개)의 군집도를 보이거나, 도10과 같이 3개의 군집 도를 보여도 그 위치가 기준 위치와 확연하게 다른 위치를 보이는 경우, 이를 부적합한 이상 감지 모델로 판정 하여 모델을 수정할 수 있도록 모델 학습과정에서의 모델을 튜닝하도록 하거나, 또는 데이터를 재수집 하거나, 또는 데이터를 재구성/변환할 수 있도록 한다. 종래 기술의 경우 모터 및 모터가 적용된 제품을 일부러 비정상 작동을 시키고, 비정상 작동과 관련된 데이터 및 정상 작동에 대한 데이터를 학습을 시켜서, 추후에 이상 감지 모델이 비정상 작동 상태를 감지하도록 하고, 그 감지된 비정상 작동 상태가 어떤 유형의 고장과 관련되는지(예, 언밸런스, 스테이터 이상, 미스얼라인먼트) 를 분류하는 것이었다. 반면에, 본 발명의 경우에는 처음부터 오작동이나 정상 작동에 대한 데이터를 분류하지 않고, 초기 작동시부터 일정 시간 동안의 데이터를 수집하고, 이 데이터가 통상적인 3상 모터의 전류 데이터에서 응당 나타나야할 형상 을 보이는 경우, 정상으로 판단하고, 이를 바탕으로 이후에 측정된 실측 데이터가 정상적인 데이터와 차이를 보 이는 경우,비정상으로 판단한다는 차이가 있다. 그리고, 그러한 비정상 데이터가 나타날 때, 알람을 울려서 해당 비정상 데이터가 어떠한 고장과 관련성이 있는 지 확인하게 하고, 그러한 데이터의 형태를 특정한 고장의 원인(예, 언밸런스, 스테이터 이상, 미스얼라인먼 트)과 관련시켜서 이를 분류할 수 있고, 추후에 이를 바탕으로 비정상성 여부 뿐만 아니라 분류된 고장의 원인 으로 추정할 수 있는 것이다. 따라서, 펌프가 실제 동작하는 경우, 계측기는 지속적으로 펌프 모터의 전력 주파수 데이터가 계측기를 통해서 제공되고, 제1관리부가 이를 수집한다(S408). 그리고, 제1관리부에서는 배포된 모델을 이용하여 이상 감지를 예측하는 과정을 수행한다(S409). 이상 감지 예측은 아직은 정상적으로 동작하고 있지만, 모델과 실측 데이터를 비교하여 모델과 비교하여 실측 데이터를 통하여 인식되는 모터의 정상상태 여부, 또는 모델과 실측 데이터에서 발생하는 차이의 정도, 차이가 발생된 상태의 지속성 여부, 차이의 증가추세 등을 고려하여 모터가 정상상태에서 비정상 상태로 그 상태가 변 화되고 있음을 알려주고, 얼마 후 정도에 이상이 발생할 것이라고 예측하는 행위를 포함한다. 그러다가 도11과 같이 일정 허용범위를 넘어서는 통상적인 이상 데이터(빨간색 점의 군집)가 발견 되면, 제1관 리부는 그동안 쌓였던 데이터를 기준으로 하여 현재 상태가 이상 작동이라고 판단하여 모니터링부에 이를 알린다. 또는 제1관리부에서 생소한 데이터가 발생하는 경우, 제2관리부에 이상 유무 여부를 판단해달라는 요청을 하고, 제2관리부에서는 이상 유무를 판정하여 이를 제1관리부에 전송을 하고, 제1저장소에 이상 데이터로 분류하여 저장되도록 한다. 이상이라고 판단되면, 제1관리부는 이를 모니터링부에 전송하고, 모니터링부는 이러한 상황을 관리자의 단말기 등을 통해서 알림으로써, 관리자가 모터가 장착된 펌프 시스템에서 이상이 발생하였음을 인식 하도록 한다. 다만, 이러한 이상으로 보여지는 이벤트가 일시적으로만 발생한 경우, 이를 일일히 이상이라고 판정하여 알리는 경우, 작업의 효율성에 심각한 장애요소가 될 수 있으므로, 이러한 이벤트가 몇회 이상(예, 5회 이상) 연속으로 발생하는 경우, 또는 이러한 이벤트가 일정 시간 동안 지속(예, 10초 이상) 되는 경우, 일정 시간 (예, 1분) 동 안 일정 횟수(예, 5회)를 초과하여 발생시 이상으로 판정하여 알리는 것이 바람직하다. 한편, 모터가 장착된 펌프 시스템의 사용이 지속되어 서서히 노후화가 되면 3상 모터가 정상적으로 동작을 하여 도 그 전력 주파수 데이터의 군집 형태는 도12와 같이 서서히 변하게 된다. 본 발명은 그러한 군집 변화를 반영 하여 이를 학습 훈련시키고, 이를 이상 감지 모델에 반영하여 이상 감지 모델이 환경 뿐만 아니라 시간의 변화 에도 적합하게 업데이트 되도록 할 수 있다. 이상과 같이 본 발명을 도면에 도시한 실시예를 참고하여 설명하였으나, 이는 발명을 설명하기 위한 것일 뿐이 며, 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자라면 발명의 상세한 설명으로부터 다양한 변형 또는 균등한 실시예가 가능하다는 것을 이해할 수 있을 것이다. 따라서 본 발명의 진정한 권리범위는 특허청구범위의 기술적 사상에 의해 결정되어야 한다."}
{"patent_id": "10-2021-0167771", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명에 의한 이상 감지 시스템이 적용된 펌프 시스템의 개요도이다. 도2는 본 발명에 의한 이상 감지 시스템의 개요도이다. 도3은 본 발명에 의한 이상 감지 시스템에서 제1관리부와 제2관리부의 구체적인 구성을 도시한 블록도이다. 도4는 본 발명의 제어 흐름도이다. 도5는 정상적인 상태의 전력 주파수의 웨이브 파형 그래프 및 이의 스펙트로 그램이다. 도6은 비정상적 상태의 전력 주파수의 웨이브 파형 그래프 및 이의 스펙트로 그램이다.도7은 정상 상태에서의 3상 모터의 전력 주파수의 데이터 군집이 형태가 배열되여야 하는 기준 바운더리를 표 시한 것이다(PCA 차원 축소). 도8은 PCA 차원 축소된 3상 모터의 정상적인 데이터의 군집 배열 상태의 일례를 도시한 것이다. 도9는 PCA 차원 축소된 3상 모터의 비정상적인 데이터의 군집 배열 상태의 일례를 도시한 것이다. 도10는 PCA 차원 축소된 3상 모터의 비정상적인 데이터의 군집 배열 상태의 다른 예를 도시한 것이다. 도11은 정상적인 데이터 군집과 비정상적인 데이터 군집을 동일 좌표에 놓고 비교한 그래프이다. 도12는 시간의 경과에 따라 정상적인 데이터의 군집 배열 상태이 변화 추이를 나타내는 그래프이다."}
