{"patent_id": "10-2022-0177996", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0095894", "출원번호": "10-2022-0177996", "발명의 명칭": "주의 매커니즘을 이용한 고품질의 장면 이미지 생성 방법 및 장치", "출원인": "성균관대학교산학협력단", "발명자": "허재필"}}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "물체별 특징 추출 알고리즘을 이용하여 제1 장면 이미지에 포함된 다수 개의 객체들 각각의 특징을 추출하는 단계;상기 제1 장면 이미지를 다수개의 장면 이미지 패치들로 분할하는 단계;공간 영역별 특징 강조 알고리즘을 이용하여 상기 장면 이미지 패치들 각각의 특징의 주의 점수를 계산하는 단계; 및상기 주의 점수에 기초하여 제2 장면 이미지를 생성하는 단계;를 포함하는,주의 매커니즘을 이용하여 장면 이미지를 생성하는 장치에 의한 동작 방법."}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,물체별 특징 추출 알고리즘을 이용하여 상기 장면 이미지에 포함된 다수 개의 객체들 각각의 특징을 추출하는단계는,피쳐 맵을 수신하는 단계;상기 피쳐 맵에서 깊이별 컨볼루션 레이어들을 이용하여 채널 별로 각각의 특징을 추출하는 단계; 및가공된 피쳐 맵을 출력하는 단계;를 포함하고,방법."}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 제1 장면 이미지를 다수개의 장면 이미지 패치들로 분할하는 단계는,상기 장면 이미지 패치들의 크기가 작은 사이즈일 때부터 상기 제1 장면 이미지와 동일한 크기가 될 때까지 재귀적인 방식으로 수행되는,방법."}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 공간 영역별 특징 강조 알고리즘을 이용하여 상기 장면 이미지 패치들 각각의 특징의 주의 점수를 계산하는 단계는,상기 가공된 피쳐 맵을 수신하는 단계;상기 장면 이미지 패치들 각각에 대해 독립적으로 패치 단위 인스턴스 정규화 연산을 수행하는 단계;상기 패치 단위 인스턴스 정규화 연산의 결과 값을 이용하여 시그모이드 함수를 수행하는 단계; 및각 장면 이미지 패치에 대한 주의 지도를 생성하는 단계;를 포함하는방법."}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,공개특허 10-2024-0095894-3-상기 패치 단위 인스턴스 정규화 연산은 상기 장면 이미지 패치 각각에 대응되는 피쳐 패치의 최대 활성화 값을1에 가까운 값으로 보정하는,방법."}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "메모리;제1 장면 이미지를 수신하고, 주의 매커니에에 의해 생성된 제2 이미지를 송신하도록 구성되는 송수신기; 및상기 메모리 및 상기 송수신기와 연결되도록 구성되는 적어도 하나의 프로세서;를 포함하고,상기 적어도 하나의 프로세서는,물체별 특징 추출 알고리즘을 이용하여 상기 제1 이미지에 포함된 다수 개의 객체들 각각의 특징을 추출하고,상기 제1 이미지를 다수개의 장면 이미지 패치들로 분할하고, 공간 영역별 특징 강조 알고리즘을 이용하여 상기장면 이미지 패치들 각각의 특징에 주의 점수를 계산하고, 상기 주의 점수에 기초하여 제2 이미지를 생성하도록구성되는 주의 모듈을 포함하는,주의 매커니즘을 이용하여 장면 이미지를 생성하는 장치."}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 주의 모듈은,피쳐 맵을 수신하고, 상기 피쳐 맵에서 깊이별 컨볼루션 레이어들을 이용하여 채널 별로 각각의 특징을 추출하고, 가공된 피쳐 맵을 출력하도록 추가로 구성되는,장치."}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서,상기 주의 모듈의 상기 공간 영역별 특징 강조 알고리즘은,상기 장면 이미지 패치들의 크기가 작은 사이즈일 때부터 상기 장면 이미지와 동일한 크기가 될 때까지 재귀적인 방식으로 수행되는,장치."}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 주의 모듈은,상기 가공된 피쳐 맵을 수신하과, 상기 장면 이미지 패치들 각각에 대해 독립적으로 패치 단위 인스턴스 정규화연산을 수행하고, 상기 패치 단위 인스턴스 정규화 연산의 결과 값을 이용하여 시그모이드 함수를 수행하고, 각장면 이미지 패치에 대한 주의 지도를 생성하도록 추가로 구성되는,장치."}
{"patent_id": "10-2022-0177996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서,상기 패치 단위 인스턴스 정규화 연산은 상기 장면 이미지 패치 각각에 대응되는 피쳐 패치의 최대 활성화 값을1에 가까운 값으로 보정하는,공개특허 10-2024-0095894-4-장치."}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "주의 매커니즘을 이용한 장면 이미지 생성 장치 및 이의 동작 방법이 개시된다. 일 실시 예에 따른 장면 이미지 생성 장치의 동작 방법은, 물체별 특징 추출 알고리즘을 이용하여 제1 장면 이미지에 포함된 다수 개의 객체들 각각의 특징을 추출하는 단계, 상기 제1 장면 이미지를 다수개의 장면 이미지 패치들로 분할하는 단계, 공간 영 역별 특징 강조 알고리즘을 이용하여 상기 장면 이미지 패치들 각각의 특징의 주의 점수를 계산하는 단계 및 상 기 주의 점수에 기초하여 제2 장면 이미지를 생성하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래 실시예들은 주의 매커니즘을 이용하여 고품질의 장면 이미지를 생성하는 방법 및 장치에 관한 것이다. 보 다 상세하게는, 아래 실시예들은 '물체별 특징 추출 알고리즘' 및 '공간 영역별 특징 강조 알고리즘'에 의해 동 작하는 주의 매커니즘을 이용하여 고품질의 장면 이미지를 생성하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 많은 인공지능(artificial intelligence: AI) 전문가들은 미래의 인공지능은 비지도 학습이 이끌어 갈 것 이며 그 중심에는 적대적 생성 신경망(generative adversarial networks: GAN)이 있을 것이라고 전망하고 있다. GAN은 생성자(generator) 및 판별자(discriminator)를 포함하며, 최대한 진짜 같은 데이터를 생성하려는 생성 모델과 진짜와 가짜를 판별하려는 분류모델이 각각 존재하여 서로 적대적으로 학습된다. 결과적으로 GAN의 생성 모델은 진짜 데이터와 극히 유사한 가짜 데이터를 만들 수 있고, 이에 따라 GAN의 분류 모델은 진짜 데이터와 극히 유사하고 진짜 같은 가짜 데이터를 구분할 수 없게 된다. GAN은 이미지 생성 작업에 있어서 놀라운 발전을 이끌고 있고, 최근에는 거의 진짜와 가짜를 구별할 수 없을 정 도로 이미지를 생성하는 수준까지 도달하였다. 그럼에도 불구하고, 이미지, 특히 장면 이미지에서 다양한 객체를 생성하는 것은 실질적으로 충분한 관심을 받 지 못하였는데, 그 이유는 대부분의 접근 방식이 초점을 맞춘 데이터 세트는 일반적으로 사람의 얼굴과 같은 이 미지 중심의 단일 객체이기 때문이다. 그러나 실제의 장면 이미지는 다양한 이미지 상의 구역(region)에 다수의 물체를 포함하고 있고, 다양한 물체를 포함한 장면 이미지를 고품질로 생성할 수 있는 기술 요구된다. 기존의 GAN 기반의 장면 이미지 생성 모델들은 학습 데이터 셋 내의 큰 비중을 차지하는 물체(Dominant objec t)만 고품질로 생성하고, 그 외 다른 여러 물체들은 저품질로 생성한다는 문제점이 있다."}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예들은 주의 매커니즘을 이용한 고품질의 장면 이미지 생성 방법 및 장치를 제공하는 데에 그 목적이 있다. 다만, 본 개시가 해결하고자 하는 기술적 과제들은 상술한 기술적 과제들로 한정되는 것은 아니며, 또 다른 기 술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 주의 매커니즘을 이용한 고품질의 장면 이미지 생성 방법 은, 물체별 특징 추출 알고리즘을 이용하여 제1 장면 이미지에 포함된 다수 개의 객체들 각각의 특징을 추출하는 단계, 상기 제1 장면 이미지를 다수개의 장면 이미지 패치들로 분할하는 단계, 공간 영역별 특징 강조 알고리즘을 이용하여 상기 장면 이미지 패치들 각각의 특징의 주의 점수를 계산하는 단계 및 상기 주의 점수에 기초하여 제2 장면 이미지를 생성하는 단계를 포함할 수 있다. 일 실시예에 따른 주의 매커니즘을 이용한 고품질의 장면 이미지 생성 방법 은 피쳐 맵을 수신하는 단계, 상기 피쳐 맵에서 깊이별 컨볼루션 레이어들을 이용하여 채널 별로 각각의 특징을 추출하는 단계 및 가공된 피쳐 맵 을 출력하는 단계를 더 포함할 수 있다.또한, 상기 제1 장면 이미지를 다수개의 장면 이미지 패치들로 분할하는 단계는, 상기 장면 이미지 패치들의 크 기가 작은 사이즈일 때부터 상기 제1 장면 이미지와 동일한 크기가 될 때까지 재귀적인 방식으로 수행될 수 있 다. 일 실시예에 따른 주의 매커니즘을 이용한 고품질의 장면 이미지 생성 방법 은 상기 가공된 피쳐 맵을 수신하는 단계, 상기 장면 이미지 패치들 각각에 대해 독립적으로 패치 단위 인스턴스 정규화 연산을 수행하는 단계, 상 기 패치 단위 인스턴스 정규화 연산의 결과 값을 이용하여 시그모이드 함수를 수행하는 단계 및 각 장면 이미지 패치에 대한 주의 지도를 생성하는 단계를 포함할 수 있다. 여기서, 상기 패치 단위 인스턴스 정규화 연산은 상기 장면 이미지 패치 각각에 대응되는 피쳐 패치의 최대 활 성화 값을 1에 가까운 값으로 보정할 수 있다. 일 실시예에 따른 주의 매커니즘을 이용한 고품질의 장면 이미지 생성 장치는 메모리, 제1 장면 이미지를 수신 하고, 주의 매커니에에 의해 생성된 제2 이미지를 송신하도록 구성되는 송수신기 및 상기 메모리 및 상기 송수 신기와 연결되도록 구성되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는, 물체별 특징 추출 알고리즘을 이용하여 상기 제1 이미지에 포함된 다수 개의 객체들 각각의 특징을 추출하고, 상기 제1 이미 지를 다수개의 장면 이미지 패치들로 분할하고, 공간 영역별 특징 강조 알고리즘을 이용하여 상기 장면 이미지 패치들 각각의 특징에 주의 점수를 계산하고, 상기 주의 점수에 기초하여 제2 이미지를 생성하도록 구성되는 주 의 모듈을 포함할 수 있다."}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시 예들에 따르면 장면 이미지의 특성을 반영한 새로운 LAP 모듈을 도입하여 지역적으로 높은 점수를 받은 여 러 지역에 주의를 분산시키고, 클래스 별 품질 불균형 문제를 해결할 수 있다는 효과가 있다. 실시예들에 따르면 장면 이미지 내 특정 물체만 고품질로 생성하는 것이 아니라 장면 이미지를 구성하는 다양한 물체들을 고품질로 생성함으로써, 종래의 장면 이미지 생성 모델에 비해 더욱 사실적인 장면 이미지를 생성할 수 있다는 효과가 있다."}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에 개시되어 있는 본 발명의 개념에 따른 실시예들에 대해서 특정한 구조적 또는 기능적 설명들은 단 지 본 발명의 개념에 따른 실시예들을 설명하기 위한 목적으로 예시된 것으로서, 본 발명의 개념에 따른 실시예 들은 다양한 형태로 실시될 수 있으며 본 명세서에 설명된 실시예들에 한정되지 않는다. 본 발명의 개념에 따른 실시예들은 다양한 변경들을 가할 수 있고 여러 가지 형태들을 가질 수 있으므로 실시예 들을 도면에 예시하고 본 명세서에 상세하게 설명하고자 한다. 그러나, 이는 본 발명의 개념에 따른 실시예들 을 특정한 개시형태들에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 변경, 균등물, 또는 대체물을 포함한다.제1 또는 제2 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들 에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만, 예를 들어 본 발명의 개념에 따른 권리 범위로부터 이탈되지 않은 채, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성요소들 간의 관계를 설명하는 표현들, 예를 들어 \"~사이에\"와 \"바로~사이에\" 또는 \"~에 직접 이웃하는\" 등도 마찬가지로 해 석되어야 한다. 본 명세서에서 사용한 용어는 단지 특정한 실시예들을 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의 도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에 서, \"포함하다\" 또는 \"가지다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조 합한 것이 존재함으로 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적 으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 본 명세서에서의 프로세서(processor)는 본 명세서에서 설명되는 각 명칭에 따른 기능과 동작을 수행할 수 있는 하드웨어를 의미할 수도 있고, 특정 기능과 동작을 수행할 수 있는 컴퓨터 프로그램 코드를 의미할 수도 있고, 또는 특정 기능과 동작을 수행시킬 수 있는 컴퓨터 프로그램 코드가 탑재된 전자적 기록 매체를 의미할 수 있다. 다시 말해, 프로세서란 본 발명의 기술적 사상을 수행하기 위한 하드웨어 및/또는 상기 하드웨어를 구동하기 위 한 소프트웨어의 기능적 및/또는 구조적 결합을 의미할 수 있다. 이하, 실시예들을 첨부된 도면을 참조하여 상세하게 설명한다. 그러나, 특허출원의 범위가 이러한 실시예들에 의해 제한되거나 한정되는 것은 아니다. 각 도면에 제시된 동일한 참조 부호는 동일한 부재를 나타낸다. 도 1은 본 개시의 일 비교 예에 따라 생성된 장면 이미지에서 클래스별 FID 점수를 나타낸 그래프이다. 적대적 생성 신경망(generative adversarial networks: GAN) 프레임워크에서 생성자(generator)는 판별자 (discriminator)를 속이기 위해 고품질의 샘플을 생성하는 방법을 계속해서 학습한다. GAN 기반의 장면 이미지 생성 모델에서의 비교 예에 따르면, 장면 이미지 생성 시, 생성자는 사이즈가 크고 자주 나타나는 객체 클래스 를 먼저 합성하는 경향이 있다. 이는 장면 이미지 상의 클래스의 실제 분포와 가짜 분포 사이의 불일치를 줄이 는 지름길이 될 수 있기 때문이다. 따라서 비교 예에 따른 이미지 생성 모델에서 생성된 장면 이미지는 이미지 내 특정 영역만 높은 가중치를 부여하게 된다. 명세서에서, 사이즈가 크고 자주 나타나는 객체 클래스를 지배적 객체(dominant object)로, 사이즈가 작고 덜 빈번하게 나타나는 객체 클래스는 비지배적 객체(non-dominant object)로 지칭될 수 있다. 도 1을 참고하면, 비교 예에 따른 이미지 생성 모델에서 합성된 장면 이미지에서 픽셀 백분율(클래스의 픽셀 수 /총 픽셀수)에 대한 FID(Frechet Inception Distance) 점수를 클래스 마다 나타낸다. FID 점수란 GAN에서 사용 될 수 있는 평가 지표로, 생성된 이미지의 분포와 실제 이미지의 분포에 있어서의 거리를 기준으로 어느정도 비 슷한지에 대해 측정하는 지표로 정의될 수 있다. 거리가 가까울수록, FID 점수가 낮을수록 해당 모델 또는 해당 이미지, 해당 객체에 대해 좋은 이미지 성능을 갖는 것으로 판단될 수 있다.도 1에 따르면, 침대(bed)는 FID가 픽셀 백분율이 약 24% 정도이고 약 10점의 FID를 갖는 데에 반해, 의자 (chair)는 픽셀 백분율이 1% 미만이고 약 19점의 FID를 갖는다. 픽셀 백분율로 판단했을 때, 침대는 지배적 객 체이고 의자는 비지배적 객체일 수 있다. 비교 예에 따른 이미지 생성 모델에 따르면, 클래스 별 시각적인 품질 은 픽셀 백분율과 음의 상관관계가 있다. 비교 예에 따라 생성된 장면 이미지는 장면 이미지 내의 비지배적 객체에 대해 낮은 품질로 생성되었으므로, 다 양한 개체 클래스에 대해 균형잡힌 품질을 보장하는 방법을 개발할 필요성이 요구된다. 도 2는 본 개시의 일 실시 예에 따른 장면 이미지 생성 장치의 개략적인 블록도이다. 도 2를 참조하면, 장면 이미지 생성 장치는 이미지를 생성할 수 있다. 예시적으로, 장면 이미지 생성 장치는 실제의 장면 이미지(DATA_in)를 수신하여, 프로세서(또는, 주 의 모듈)의 뉴럴 네트워크를 이용하여 실제 이미지와 극히 유사한 장면 이미지(DATA_out)를 생성할 수 있 다. 이미지 생성 결과, 프로세서의 출력 값은 이미지, 특정 값 또는 그래프로 표현될 수 있으며, 본 개시의 기 술적 사상은 이에 한정되지 않는다. 이미지는 빛의 굴절이나 반사 등에 의하여 이루어진 물체의 상을 포함하는 것으로, 선이나 색채를 이용하여 사물의 형상을 나타낸 것을 의미할 수 있다. 이미지는 컴퓨터가 처리할 수 있 는 형태로 된 정보로 이루어질 수 있고, 일 실시 예에 따라, 이미지는 다수의 객체(object)를 포함하는 장면 이 미지일 수 있다. 본 명세서에서, 객체(object)는 '물체'로 지칭될 수 있다. 뉴럴 네트워크(또는 인공 신경망)(미도시)는 기계학습과 인지과학에서 생물학의 신경을 모방한 통계학적 학습 알고리즘을 포함할 수 있다. 일 실시 예에 따라, 뉴럴 네트워크는 물체별 특징 추출 알고리즘 및 공간 영역별 특징 강조 알고리즘을 포함할 수 있다. 뉴럴 네트워크는 시냅스의 결합으로 네트워크를 형성한 인공 뉴런(노드)이 학습을 통해 시냅스의 결합 세기를 변화시켜, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있 다. 본 개시의 실시예들에서, 주의 모듈은 뉴럴 네트워크의 한 종류로써 표현될 수 있으며, 주의 모듈 은 물체별 특징 추출 알고리즘 및 공간 영역별 특징 강조 알고리즘을 포함할 수 있다. 주의 모듈에 대한 상세한 내용은 도 3 이하에서 후술한다. 뉴럴 네트워크의 뉴런은 가중치 또는 바이어스의 조합을 포함할 수 있다. 뉴럴 네트워크는 하나 이상의 뉴런 또는 노드로 구성된 하나 이상의 레이어(layer)를 포함할 수 있다. 뉴럴 네트워크는 뉴런의 가중치를 학습을 통해 변화시킴으로써 임의의 입력으로부터 예측하고자 하는 결과를 추론할 수 있다. 뉴럴 네트워크는 GAN(Generative Adversarial Network)을 포함할 수 있다. 뉴럴 네트워크는 심층 뉴럴 네트워 크 (Deep Neural Network), CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), 퍼셉트론 (perceptron), 다층 퍼셉트론(multilayer perceptron), FF(Feed Forward), RBF(Radial Basis Network), DFF(Deep Feed Forward), LSTM(Long Short Term Memory), GRU(Gated Recurrent Unit), AE(Auto Encoder), VAE(Variational Auto Encoder), DAE(Denoising Auto Encoder), SAE(Sparse Auto Encoder), MC(Markov Chain), HN(Hopfield Network), BM(Boltzmann Machine), RBM(Restricted Boltzmann Machine), DBN(Depp Belief Network), DCN(Deep Convolutional Network), DN(Deconvolutional Network), DCIGN(Deep Convolutional Inverse Graphics Network), GAN(Generative Adversarial Network), LSM(Liquid State Machine), ELM(Extreme Learning Machine), ESN(Echo State Network), DRN(Deep Residual Network), DNC(Differentiable Neural Computer), NTM(Neural Turning Machine), CN(Capsule Network), KN(Kohonen Network) 및 AN(Attention Network)를 포함할 수 있으나 이에 한정되는 것이 아닌 임의의 뉴럴 네트워크를 포함 할 수 있음은 통상의 기술자가 이해할 것이다. 장면 이미지 생성 장치는 마더보드(motherboard)와 같은 인쇄 회로 기판(printed circuit board(PCB)), 집적 회로(integrated circuit(IC)), 또는 SoC(system on chip)로 구현될 수 있다. 예를 들어, 장면 이미지 생성 장치는 애플리케이션 프로세서(application processor)로 구현될 수 있다. 또한, 장면 이미지 생성 장치는 PC(personal computer), 데이터 서버, 또는 휴대용 장치 내에 구현될 수 있다.휴대용 장치는 랩탑(laptop) 컴퓨터, 이동 전화기, 스마트 폰(smart phone), 태블릿(tablet) PC, 모바일 인터 넷 디바이스(mobile internet device(MID)), PDA(personal digital assistant), EDA(enterprise digital assistant), 디지털 스틸 카메라(digital still camera), 디지털 비디오 카메라(digital video camera), PMP(portable multimedia player), PND(personal navigation device 또는 portable navigation device), 휴대 용 게임 콘솔(handheld game console), e-북(e-book), 또는 스마트 디바이스(smart device)로 구현될 수 있다. 스마트 디바이스는 스마트 와치(smart watch), 스마트 밴드(smart band), 또는 스마트 링(smart ring)으로 구 현될 수 있다. 장면 이미지 생성 장치는 송수신기 및 프로세서를 포함한다. 장면 이미지 생성 장치는 메 모리를 더 포함할 수 있다. 송수신기는 실제의 장면 이미지(DATA_in)를 수신할 수 있다. 송수신기는 송신 인터페이스 또는 수신 인터페이스를 포함할 수 있다. 예시적으로, 송수신기는 입력된 장면 이미지(DATA_in)를 프로세서로 출력할 수 있다. 다른 예로, 송수신기는 입력된 장면 이미지(DATA_in)로부터 획득된 데이터(예를 들어, 입 력된 장면 이미지(DATA_in)를 벡터화한 데이터)를 프로세서로 출력할 수 있다. 프로세서는 뉴럴 네트워크 모델을 포함할 수 있으며, 뉴럴 네트워크 모델은 주의 모듈을 포함할 수 있다. 프로세서는 메모리에 저장된 데이터를 처리할 수 있다. 프로세서는 메모리에 저장된 컴퓨 터로 읽을 수 있는 코드(예를 들어, 소프트웨어) 및 프로세서에 의해 유발된 인스트럭션(instruction)들을 실행할 수 있다. 프로세서는 목적하는 동작들(desired operations)을 실행시키기 위한 물리적인 구조를 갖는 회로를 가지는 하드웨어로 구현된 데이터 처리 장치일 수 있다. 예를 들어, 목적하는 동작들은 프로그램에 포함된 코드(code) 또는 인스트럭션들(instructions)을 포함할 수 있다. 예를 들어, 하드웨어로 구현된 데이터 처리 장치는 마이크로프로세서(microprocessor), 중앙 처리 장치(central processing unit), 프로세서 코어(processor core), 멀티-코어 프로세서(multi-core processor), 멀티프로세서 (multiprocessor), ASIC(Application-Specific Integrated Circuit), FPGA(Field Programmable Gate Array)를 포함할 수 있다. 프로세서는 주의 모듈을 포함할 수 있다. 프로세서는 물체별 특징 추출 알고리즘 및/또는 공간 영역별 특징 강조 알고리즘에 따라 주의 모듈을 학습시킬 수 있다. 프로세서(또는 주의 모듈는 물체별 특징 추출 알고리즘을 이용하여 상기 제1 이미지에 포함된 다수 개의 객체들 각각의 특징을 추출할 수 있다. 프로세서(또는 주의 모듈는 제1 이미지를 다수개의 장면 이미지 패치들로 분할하고, 공간 영역별 특징 강조 알고리즘을 이용하여 장면 이미지 패치들 각각의 특징에 주 의 점수를 계산할 수 있다. 프로세서(또는 주의 모듈는 주의 점수에 기초하여 제2 이미지를 생성할 수 있다. 메모리는 프로세서에 의해 실행가능한 인스트럭션들(또는 프로그램)을 저장할 수 있다. 예를 들어, 인스트럭션들은 프로세서의 동작 및/또는 프로세서의 각 구성의 동작을 실행하기 위한 인스트럭션들을 포함할 수 있다. 메모리는 휘발성 메모리 장치 또는 불휘발성 메모리 장치로 구현될 수 있다. 휘발성 메모리 장치는 DRAM(dynamic random access memory), SRAM(static random access memory), T- RAM(thyristor RAM), Z-RAM(zero capacitor RAM), 또는 TTRAM(Twin Transistor RAM)으로 구현될 수 있다. 불휘발성 메모리 장치는 EEPROM(Electrically Erasable Programmable Read-Only Memory), 플래시(flash) 메모 리, MRAM(Magnetic RAM), 스핀전달토크 MRAM(Spin-Transfer Torque(STT)-MRAM), Conductive Bridging RAM(CBRAM), FeRAM(Ferroelectric RAM), PRAM(Phase change RAM), 저항 메모리(Resistive RAM(RRAM)), 나노 튜브 RRAM(Nanotube RRAM), 폴리머 RAM(Polymer RAM(PoRAM)), 나노 부유 게이트 메모리(Nano Floating Gate Memory(NFGM)), 홀로그래픽 메모리(holographic memory), 분자 전자 메모리 소자(Molecular Electronic Memory Device), 또는 절연 저항 변화 메모리(Insulator Resistance Change Memory)로 구현될 수 있다.도 3은 도 2에 도시된 주의 모듈의 프레임워크를 개념적으로 나타낸다. 본 개시의 일 실시 예에 따르면, 주의 모듈(Attention module)은 장면 이미지 내의 여러 영역들에 높은 가중치 를 부여할 수 있도록 하는 주의 매커니즘(Attention mechanism)에 따라 동작될 수 있다. 주의 매커니즘은, 다수 개의 객체들 각각의 특징을 추출하는 '물체별 특징 추출 알고리즘' 및 각 이미지 패치(Image patch)마다 차별적 인 특징을 강조하는 '공간 영역별 특징 강조 알고리즘'으로 구성될 수 있다. 본 개시의 일 실시 예에 따른 주의 매커니즘은, 학습 데이터 셋 내의 큰 비중을 차지하는 지배적 객체(dominant object)에만 집중하여 장면 영상을 생성하는 종래 기술들과는 달리, 하나의 장면 이미지 내에 다양한 영역에 높은 가중치를 부여함으로써 다양한 객체들이 보다 고품질로 생성할 수 있다. 본 개시의 일 실시 예에 따른 주의 모듈은 다양한 GAN 아키텍쳐, 손실 함수 및 학습 전략에 적용될 수 있으며, 학습 가능한 매개변수를 거의 추가하지 않고도 장면 이미지의 품질을 지속적으로 향상시킬 수 있다. 이하에서, 주의 모듈은 LAP 모듈로 지칭될 수 있고, '물체별 특징 추출 알고리즘'은 채널 분리 변환(Channel- seperated transformation)으로 지칭될 수 있으며, '공간 영역별 특징 강조 알고리즘'은 지역적 주의 피라미드 (local attention pyramid: LAP)로 지칭될 수 있다. 도 3에 따르면, 주의 모듈은 3D 피쳐 맵을 수신하고 다음 컨볼루션 블록을 위해 3D 피쳐맵을 변환할 수 있다. 실시 예에 따르면, 주의 모듈은 피쳐 맵(feature map)(들)(F)을 입력으로 수신하고, 깊이별 컨볼루션 레이어들 (depthwise convolution layers)을 사용하여 각 객체 클래스의 대략적인 위치를 먼저 결정할 수 있다. 깊이별 컨볼루션(depthwise convolution)은 채널 간의 개입이 없기 대문에 피쳐 맵이 객체의 일부와 관련성이 높은 각 채널의 특징 표현들(feature representations)을 유지함을 유추할 수 있다. 주의 모듈은 피쳐 맵들을 다수의 피 쳐 패치로 나누고, 각 패치에 대해 패치-인스턴스 정규화를 수행한 뒤 시그모이드 함수에 공급할 수 있다. 이에 따라, LAP은 각 패치에서 국지적으로 높은 활성화 점수를 증폭할 수 있다. 도 3의 (a) Channel-separated trnasformation(물체별 특징 추출 알고리즘)은 정규화 없이 채널별 공간 주의 점수를 계산하여 각 객체 클래스 또는 각 객체 클래스의 일부분의 대략적인 위치를 계산할 수 있다. 본 개시의 실시 예에 따른 주의 모듈은 물체별 특징 추출 알고리즘을 이용하여 각 객체별 고유의 특징을 추출하여 피쳐 맵 을 가공할 수 있다. GAN의 각 채널은 글로벌 주의 지도를 사용하는 일반적인 주의 매커니즘과 달리 각 채널에 대한 공간 주의 지도를 계산할 수 있다. 노이즈로부터 가공된 피쳐 맵( )은 와 같이 정의될 수 있고, 주의 모듈에 입력 될 수 있다. 피쳐 맵(F)의 각 요소 (i=1,2,쪋,C)는 특정 객체의 생성에 관여하는 특징을 반영한다. 채널이란 생성 모델이 학습하는 과정에서 특정 객체의 생성에 비교적 크게 관여하는 HxW의 차원을 갖는 맵으로 정의될 수 있다. C는 입력의 채널(channel)의 개수, H는 입력의 세로(height), W는 입력의 가로(width)를 의미한다. 장면 이미지 내에 C개의 특징들이 존재할 때, 주의 모듈은 C개의 특징들(또는 채널들)에서 공통적으로 나타내는 특징을 추출할 수 있다. 그 방법은 다음의 수학식 1과 같이 나타낼 수 있다. 수학식 1"}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서, 및 은 의 공간 차원에 대해서 각각 평균 값과 가장 큰 값을 출력하는 풀링 함수를 의미한다. Conv(.)는 컨볼루션 연산을 의미한다. 예시적으로, 커널 사이즈는 3x3일 수 있 다. 수학식 1을 통해서, 하나의 장면 이미지에 대해 초점을 맞출 위치에 대한 일반적인 특징 표현이 F'( )에 포함될 수 있다. 주의 모듈은 다음의 수학식 2를 이용하여, 피쳐맵 F'에서 채널 분리 변환을 수행하여 Fa로 변조할 수 있다. 수학식 2"}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 2에서, 및 는 학습 가능한 매개 변수가 서로 상이한 3x3 사이즈의 깊이별 컨볼루션 연 산을 의미하며, T(F',C)는 F'를 채널 차원을 따라 n번 복사하는 타일(tile) 함수를 의미하고, 는 요소별 (element-wise) 곱셈을 의미한다. 주의 모듈은 가공된 피쳐 맵 Fa( )를 LAP에 공급할 수 있다. 도 3의 (b) Local Attention Pyramid, 즉, LAP는 객체 규모의 다양성을 처리하기 위해, 다양한 장면 이미지 패 치의 사이즈로 점수 정규화를 수행할 수 있다. LAP는 피쳐 맵을 여러 피쳐 패치로 나누고, 각 패치에 대해 독립 적으로 인스턴스 정규화를 수행한 후 시그모이드 함수에 공급할 수 있다. 이에 따라, LAP는 각 패치에서 지역적 으로 높은 활성화 점수를 증폭할 수 있다. LAP은 장면 이미지에 흩어져있는 다양한 객체의 특징을 부각시킬 수 있도록 다양한 뎡역에 높은 포커싱을 할 수 있다. LAP에 대한 상세한 내용은 도 4에서 후술한다. 주의 모듈은 도 3의 (a), (b)에 대응되는 두 개의 하위 알고리즘을 통해 가공된 피쳐 맵 을 컨볼루션 블록 에 더함으로써, 여러 물체들에 집중하여 장면 이미지를 생성할 수 있다. 도 4는 도 3에 도시된 지역적 주의 피라미드(local attention pyramid: LAP)의 적용 과정 나타낸다. 본 개시의 일 실시 예에 따르면, LAP는 각 장면 이미지 패치별로 가장 차별적인 특징을 갖는 특징점에 대해서 높은 가중치를 각각 계산할 수 있다. LAP는 패치 단위로 정규화 연산(patch instance normalization)을 수행하 고, 시그모이드 함수를 수행할 수 있다. LAP는 입력(Input)(401, 403, 405)의 각 장면 이미지 패치마다 패치단위 정규화(Patch-IN) 및 시그모이드 함수 (Sigmoid function)를 계산하여 주의 지도(Attention Map)(402, 404, 406)를 생성할 수 있다. 주의 지도는 '가 중치 지도'로도 지칭될 수 있다. 본 개시의 일 실시 예에 따르면, Fa 및 피쳐 패치의 모양은 정사각형일 수 있다. Fa 및 피쳐 패치의 모양은 직 사각형일 수도 있으며, Fa 및 피쳐 패치의 모양은 본 개시의 기술적 범위를 한정하지 않는다. 가공된 피쳐 맵이 주어지는 경우, 피라미드 수준 p에서 장면 이미지 패치의 크기 는 다음의 수학식 3과 같이 정의될 수 있다. 수학식 3"}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3에서, l은 Fa의 긴 변의 길이를 의미한다. 피라미드 수준 p의 값이 클수록 작은 크기의 장면 이미지 패 치에서 주의 지도를 계산한 것을 의미한다. LAP는 수학식 4의 패치 인스턴스 정규화 함수에 기초하여 의 크기를 갖는 피쳐 패치를 정규화할 수 있 다. 수학식 4 패치 단위 정규화(Patch-IN)는 의 크기를 갖는 슬라이딩 윈도우 및 의 크기를 갖는 스트라이드로 입 력 f에 대해 수행될 수 있다. 패치 단위 정규화(Patch-IN)는 피쳐 패치의 가장 높은 활성화 값을 1 근처로 보정 할 수 있다. 이에 따라, 패치 단위 정규화(Patch-IN)의 출력에 따른 시그모이드 결과는 항상 장면 이미지 패치 내에서 높은 주의 점수가 포함된다. LAP은 주의 지도(또는 가중치 지도) M을 다음의 수학식 5와 같이 계산할 수 있다. 수학식 5"}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 5에서, 는 시그모이드 함수를 의미한다. 일 실시 예에서, 패치 단위 정규화(Patch-IN)는 피쳐 패치 들이 오버래핑되지 않게 를 만족하도록 세팅될 수 있다. 도 4를 참조하면, LAP는 재귀적인 방식(recursive manner)으로 멀티 스케일의 주의 지도들을 계산할 수 있다. 피라미드 레벨이 p인 피쳐 맵을 이라고 할 때, 각 레벨에서 LAP는 상기 수학식 5에 기초하여 주의 지도를 계 산하고, 다음 주의(attention)를 현재 피쳐 맵에 적용하고 결과를 다음 레벨로 다음의 수학식 6에 해당하는 재 귀 방정식과 같이 전달할 수 있다. 수학식 6"}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 6에서 α는 이전의 주의 점수의 영향을 제어하는 쇠퇴 요인을 의미한다. 일 실시 예에서, α=0.5일 수 있다. 예시적으로, 도 4를 참조하면, 제1 입력의 주의 지도는 다음 입력인 제2 입력에 반영될 수 있다. 제2 입력의 주의 지도는 다음 입력인 제3 입력에 반영될 수 있다. 제1 입력의 다음 입력 인 제2 입력, 제2 입력의 다음 입력인 제3 입력에서는 더욱 큰 사이즈의 장면 이미지 패치를 이용하여 동일한 연산을 반복해서 수행할 수 있다. 이러한 연산은 이미지 패치의 크기가 전체 이미지 크기가 될 때까지 반복 수 행될 수 있다. 는 LAP 및 주의 모듈의 최종 출력이며, 피쳐 맵 F에 를 추가할 수 있다."}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 7, "content": "도 5는 본 개시의 일 실시 예에 따른 주의 모듈에서 출력된 주의 맵을 예시적으로 나타낸다. 예시적으로, 가장 작은 장면 이미지 패치(즉, p=3일 때의 장면 이미지 패치)에서 주의 맵을 계산한 경우, 장면 이미지 패치 내에 객체가 없는 영역들이 존재할 수 있다. 일 예로, 벽이 높은 가중치로 계산될 수 있다. 장면 이미지 패치가 점점 커지면서 장면 이미지 패치 내의 다양한 객체들에 높은 가중치가 계산될 수 있다. 도 6은 본 개시의 일 실시 예에 따라 생성된 장면 이미지 및 비교 예에 따라 생성된 장면 이미지와의 품질 비교 나타낸다. 본 개시의 일 실시 예에 따라 장면 이미지를 생성하여 실험을 진행하였으며, 실험 내용 및 결과는 얼마나 사실 적인 장면 이미지를 생성하는가를 기준으로 진행하였다. 실험을 진행한 데이터 셋들은 침실 데이터 셋인 LSUN bedroom, 부엌 및 거실 데이터 셋인 LSUN combined, 다양한 실내 또는 야외 데이터 셋인 COCO-stuff이다. 평가 지표는 사람의 정성적인 평가를 잘 반영한다고 알려진 Frechet Inception Distance (FID)와 Frechet Segmentation Distance (FSD)를 사용하였다. 위 평가 지표는 장면 이미지를 입력으로 받아 처리하는 딥 러닝 모 델을 활용하여 실제 장면 이미지와 생성된 장면 이미지의 분포 간의 거리를 측정한 것이다. 생성된 장면 이미지 에 대한 정량 평가 결과는 다음의 표 1과 같다. 이를 통해, 본 개시의 일 실시 예에 따라 생성된 장면 이미지가 종래 기술에 비해 더 사실적인 장면 이미지를 생성하는 것을 확인하였다. 표 1"}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "장면 이미지 내의 객체 별 생성 품질에 대한 정량 평가 결과는 다음의 표 2와 같다. 이를 통해, 본 개시의 일 실시 예에 따라 생성된 장면 이미지에서 각 객체별 생성 품질이 향상되는 것을 확인하였다. 표 2"}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 9, "content": "도 7은 본 개시의 일 실시 예에 따른 장면 이미지 생성 장치의 동작 방법의 순서도이다. 본 개시의 일 실시 예에 따른 주의 매커니즘을 이용한 장면 이미지 생성 장치는, 물체별 특징 추출 알고리즘을 이용하여 제1 장면 이미지에 포함된 다수 개의 객체들 각각의 특징을 추출할 수 있다(S702). 구체적으로, 물체별 특징 추출 알고리즘에 따르면, 장면 이미지 생성 장치는 피쳐 맵(F)을 수신하여 피쳐 맵에 서 깊이별 컨볼루션 레이어들을 이용하여 채널 별로 각각의 특징을 추출할 수 있다. 장면 이미지 생성 장치는 깊이별 컨볼루션 레이어들을 이용하여 추출된 각각의 채널별 특징들을 이용하여 가공된 피쳐 맵(Fa)을 출력할 수 있다. 장면 이미지 생성 장치는 제1 장면 이미지를 다수개의 장면 이미지 패치들로 분할할 수 있다(S704). 장면 이미지 패치들로 분할하는 단계는, 장면 이미지 패치들의 크기가 작은 사이즈일 때부터 제1 장면 이미지와 동일한 크기가 될 때까지 재귀적인 방식으로 수행될 수 있다. 장면 이미지 생성 장치는 공간 영역별 특징 강조 알고리즘을 이용하여 상기 장면 이미지 패치들 각각의 특징의 주의 점수를 계산할 수 있다(S706). 구체적으로, 장면 이미지 생성 장치는 가공된 피쳐 맵(Fa)을 수신하여 장면 이미지 패치들 각각에 대해 독립적 으로 패치 단위 인스턴스 정규화 연산을 수행할 수 있다. 장면 이미지 생성 장치는 패치 단위 인스턴스 정규화 연산의 결과 값을 이용하여 시그모이드 함수를 수행하여, 각 장면 이미지 패치에 대한 주의 지도를 생성할 수 있다. 패치 단위 인스턴스 정규화 연산은 상기 장면 이미지 패치 각각에 대응되는 피쳐 패치의 최대 활성화 값을 1에 가까운 값으로 보정될 수 있다. 이로써, 본 개시의 일 실시 예에 따른 주의 매커니즘에 따르면, 제1 이미지 내 의 모든 장면 이미지 패치마다 높은 가중치를 부여할 수 있고, 다양한 물체들을 고품질로 생성할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2022-0177996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속한다."}
{"patent_id": "10-2022-0177996", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 비교 예에 따라 생성된 장면 이미지에서 클래스별 FID 점수를 나타낸 그래프이다. 도 2는 본 개시의 일 실시 예에 따른 장면 이미지 생성 장치의 개략적인 블록도이다. 도 3은 도 2에 도시된 주의 모듈의 프레임워크를 개념적으로 나타낸다. 도 4는 도 3에 도시된 지역적 주의 피라미드(local attention pyramid: LAP)의 적용 과정 나타낸다 도 5는 본 개시의 일 실시 예에 따른 주의 모듈에서 출력된 주의 맵을 예시적으로 나타낸다. 도 6은 본 개시의 일 실시 예에 따라 생성된 장면 이미지 및 비교 예에 따라 생성된 장면 이미지와의 품질 비교 나타낸다 도 7은 본 개시의 일 실시 예에 따른 장면 이미지 생성 장치의 동작 방법의 순서도이다."}
