{"patent_id": "10-2021-0081519", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0170544", "출원번호": "10-2021-0081519", "발명의 명칭": "운동 보조를 위한 객체 움직임 인식 시스템 및 방법", "출원인": "하대수", "발명자": "하대수"}}
{"patent_id": "10-2021-0081519", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "운동하는 사용자를 촬영하여 영상 데이터를 생성하고, 상기 영상 데이터와 사용자로부터 입력된 운동 데이터를서버로 전송하는 사용자 단말; 및상기 영상 데이터의 개별 프레임에 대해 이미지 양자화(Quantization) 기법을 수행하여 양자화된 프레임 이미지를 생성하고, 상기 양자화된 프레임 이미지에서 객체를 추출하고, 상기 객체의 움직임을 기준 자세와 비교하여비교 결과를 기초로 오류 영상 데이터를 생성하며, 상기 오류 영상 데이터 및 운동 데이터를 트레이너 단말로전송하는 서버;를 포함하는 운동 보조를 위한 객체 움직임 인식 시스템."}
{"patent_id": "10-2021-0081519", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 서버는,상기 영상 데이터의 개별 프레임에 대해 이미지 양자화(Quantization) 기법을 수행하여 양자화된 프레임 이미지를 생성하고, 상기 양자화된 프레임 이미지에서 상기 객체를 추출하는 객체 추출부;상기 객체로부터 객체 스켈레톤 데이터를 생성하는 스켈레톤 생성부;상기 객체 스켈레톤 데이터로부터 액션 파일을 생성하는 액션 파일 생성부;상기 액션 파일을 기반으로 상기 객체의 움직임을 인식하는 행동 인식부;인식된 상기 객체의 움직임을 상기 기준 자세와 비교하여 미리 설정된 오차를 초과하면 오류 자세로 판단하는자세 분석부;상기 영상 데이터에서 상기 오류 자세로 판단된 부분만 자동으로 선별하여 상기 오류 영상 데이터를 생성하는오류 영상 데이터 생성부;상기 영상 데이터 및 운동 데이터를 수신하고, 상기 오류 영상 데이터 및 운동 데이터를 상기 트레이너 단말로전송하는 통신부; 및상기 영상 데이터, 운동 데이터, 오류 영상 데이터 및 기준 자세를 저장하는 저장부;를 포함하는 운동 보조를 위한 객체 움직임 인식 시스템."}
{"patent_id": "10-2021-0081519", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 이미지 양자화(Quantization) 기법은 이진화(binarization) 기법이고,상기 액션 파일은 상기 영상 데이터의 개별 프레임 중에서 상기 객체가 수행하는 움직임을 나타내는 복수의 영상 프레임을 포함하는 제1레이어 및 상기 복수의 영상 프레임의 개별 프레임 내에서 상기 객체의 객체 스켈레톤데이터를 나타내는 제2레이어를 포함하고,상기 제1레이어는 상기 복수의 영상 프레임 중에서 시작 프레임 정보, 종료 프레임 정보 및 상기 객체 스켈레톤데이터가 없는 프레임을 포함하고,상기 객체 스켈레톤 데이터는 상기 객체의 복수의 스켈레톤의 위치 데이터를 포함하고,상기 제2레이어는 상기 객체의 복수의 스켈레톤의 위치 데이터 중 적어도 일부를 포함하고,상기 운동 데이터는 운동 종류 및 종류별 동작 시나리오, 운동 세트, 운동 횟수 중 적어도 하나 이상을 포함하공개특허 10-2022-0170544-3-고,상기 기준 자세는 운동 종류 및 종류별 동작 시나리오에 각각 대응하는 표준 객체 스켈레톤 데이터를 포함하는것을 특징으로 하는 운동 보조를 위한 객체 움직임 인식 시스템."}
{"patent_id": "10-2021-0081519", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 영상 데이터 내에 복수의 객체가 존재하는 경우,상기 액션 파일 생성부는,상기 복수의 영상 프레임의 개별 프레임 내에 상기 복수의 객체에 각각 대응하는 복수의 랜드마크 레이어를 생성하고,상기 자세 분석부는,상기 액션 파일 내 복수의 객체의 움직임을 각각 상기 기준 자세와 비교하여 판단하고,상기 영상 데이터 및 운동 데이터는 상기 서버로 실시간 스트리밍 전송되고,상기 서버는,상기 자세 분석부가 상기 객체의 움직임을 오류 자세로 판단하는 경우, 실시간으로 상기 오류 자세에 대한 피드백 정보를 생성하여 상기 사용자 단말로 전송하는 피드백 생성부를 더 포함하는 것을 특징으로 하는 운동 보조를 위한 객체 움직임 인식 시스템."}
{"patent_id": "10-2021-0081519", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 운동하는 사용자를 촬영하여 영상 데이터를 생성하고, 상기 영상 데이터와 사용자로부터 입력된 운동 데이터를 서버로 전송하는 사용자 단말; 및 상기 영상 데이터의 개별 프레임에 대해 이미지 양자화 (Quantization) 기법을 수행하여 양자화된 프레임 이미지를 생성하고, 상기 양자화된 프레임 이미지에서 객체를 추출하고, 상기 객체의 움직임을 기준 자세와 비교하여 비교 결과를 기초로 오류 영상 데이터를 생성하며, 상기 오류 영상 데이터 및 운동 데이터를 트레이너 단말로 전송하는 서버;를 포함하는 운동 보조를 위한 객체 움직임 인식 시스템 및 방법에 관한 것으로, 인공지능을 기반으로 영상 데이터에 대한 이미지 양자화(Quantization)를 수행하여 객체의 움직임 인식에 대한 정확성을 향상시킴으로써 별다른 추가적인 도구 없이도 사용자의 운동 영상 만으로 움직임에 대한 오류 여부를 판단하여 올바른 자세를 위한 피드백 정보를 제공할 수 있는 효과가 있다."}
{"patent_id": "10-2021-0081519", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 운동 보조를 위한 객체 움직임 인식 시스템 및 방법에 관한 것으로, 보다 상세하게는 영상 데이터를 기반으로 이미지 양자화(Quantization)를 수행하여 객체의 스켈레톤 데이터를 인식하고, 스켈레톤 데이터를 이 용하여 객체의 행동을 분석하는 운동 보조를 위한 객체 움직임 인식 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0081519", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "피트니스 또는 운동 관리를 위해 다양한 홈트레이닝 서비스들이 존재하고 있으나, 기존 홈트레이닝 서비스는 단 순한 운동 동작 따라하기, 횟수 세기에 국한되어 실제 사용자의 운동 자세에 대한 분석이나 운동 결과에 대한 피드백을 얻기 힘들다는 단점이 있다. 최근에는 이러한 단점을 해결하기 위해 컴퓨터 비전 기술을 기반으로 하 는 영상 판독 기능을 활용하는 방안이 제시되고 있다. 한편, 2차원 영상으로부터 사람의 동작을 인식하는 연구는 컴퓨터 비전(computer vision)의 초창기부터 수행되 어온 매우 중요한 연구분야 중의 하나로써 영상감시(visual surveillance), 사람-컴퓨터 상호작용(human- computer interaction), 지능로봇(intelligent robot) 등 다양한 적용 분야를 가지고 있다. 동작인식에서 인식 의 대상인 사람의 동작은 다양한 의미를 지닐 수 있는데, 신체부위들이 어떻게 배치(a configuration of the human body)되어 있는가를 표현하는 자세 혹은 특정한 의미를 가지는 신체의 움직임을 나타내는 동작(gesture) 등을 들 수 있다. 특히 촬영된 영상에서 사용자의 동작과 자세를 인식하여 사용자의 행동의 의미를 인식하는 기술이 널리 연구되 고 있다. 예를 들면 센서 또는 카메라를 이용하여 사람의 신체 골격을 검출하고, 관절의 이동 궤적을 분석하여 사용자의 행동 및 제스처를 인식하는 기술이 개발되어 사용되고 있다. 그리고 이와 같은 기존의 사용자 행동 인 식 방법들은 주로 사용자의 동작을 보다 정확하게 분석하여 행동을 인식하려는 노력을 기울여 왔다. 그러나 단순히 영상 내에 포함된 정보만을 이용하여 사용자의 행동을 인식하는 방식은 인식 정확도에 있어서 한 계가 있고, 잘못된 인식 결과가 출력될 가능성이 높다. 또한, 촬영된 영상에서 사용자의 동작과 자세를 인식하기 위해 딥 러닝 모델이 도입되어 사용되고 있지만 학습 과 추론 과정에서 고비용의 전산 자원과 함께 많은 연산량이 필요하고, 이에 따라 많은 학습 시간이 요구되어개발이 지연되는 등의 문제점을 가지고 있다. 따라서, 영상 내의 정보를 체계화하고 이를 활용하여 동작을 인식하는데 있어 보다 경량화된 딥 러닝 모델의 요 구와 더불어 사용자와 영상 간의 상호 교류가 가능한 기술 개발이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-1762010호 (공고일자: 2017.07.28.) (특허문헌 0002) 대한민국 등록특허 제10-1908284호 (공고일자: 2018.10.16.)"}
{"patent_id": "10-2021-0081519", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 개선하기 위한 본 발명 실시예들의 목적은 사용자 단말을 통하여 촬영된 영상 데이터에 대해 이미지 양자화(Quantization) 작업을 수행하고 양자화된 이미지 신호를 표준 데이터와 비교하여 객체의 골격부 터 움직임까지 선과 면으로 재구성하여, 크기와 이동거리를 객관적으로 수치화 함으로써 객체의 움직임을 정확 하게 인식할 수 있는 운동 보조를 위한 객체 움직임 인식 시스템 및 방법을 제공하는 데 있다. 본 발명의 다른 목적은 별도의 부가적인 장비 없이도 사용자의 운동 자세를 분석하고 피드백을 줄 수 있도록 객 체의 움직임을 촬영하고, 촬영된 영상 데이터로부터 상기 객체의 움직임을 기준 자세와 비교하여 분석하고, 잘 못된 자세로 판단된 부분들만 편집하여 오류 영상 데이터를 생성하고, 상기 오류 영상 데이터와 운동 데이터를 트레이너 단말로 전송하는 운동 보조를 위한 객체 움직임 인식 시스템 및 방법을 제공하는 데 있다. 본 발명의 다른 목적은 약인공지능 알고리즘을 활용하여 세부 운동에 대한 카테고라이징 및 라벨링을 통해 특정 운동을 세분화하는 방식으로 경량화된 인공지능을 활용한 영상 속 객체의 움직임 예측 및 평가의 정확도를 높일 수 있는 운동 보조를 위한 객체 움직임 인식 시스템 및 방법을 제공하는 데 있다. 본 발명의 또 다른 목적은 여러 사람이 참여하는 그룹 운동 시에도 정확하게 각 사람의 움직임을 인식할 수 있 는 운동 보조를 위한 객체 움직임 인식 시스템 및 방법을 제공하는 데 있다."}
{"patent_id": "10-2021-0081519", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여, 본 발명의 일 실시예에 의한 운동 보조를 위한 객체 움직임 인식 시스템 은 운동하는 사용자를 촬영하여 영상 데이터를 생성하고, 상기 영상 데이터와 사용자로부터 입력된 운동 데이터 를 서버로 전송하는 사용자 단말; 및 상기 영상 데이터의 개별 프레임에 대해 이미지(Quantization) 기법을 수 행하여 양자화된 프레임 이미지를 생성하고, 상기 양자화된 프레임 이미지에서 객체를 추출하고, 상기 객체의 움직임을 기준 자세와 비교하여 비교 결과를 기초로 오류 영상 데이터를 생성하며, 상기 오류 영상 데이터 및 운동 데이터를 트레이너 단말로 전송하는 서버;를 포함할 수 있다. 본 발명과 관련된 일 예로서 상기 서버는, 상기 영상 데이터의 개별 프레임에 대해 이미지 양자화 (Quantization) 기법을 수행하여 양자화된 프레임 이미지를 생성하고, 상기 양자화된 프레임 이미지에서 상기 객체를 추출하는 객체 추출부; 상기 객체로부터 객체 스켈레톤 데이터를 생성하는 스켈레톤 생성부; 상기 객체 스켈레톤 데이터로부터 액션 파일을 생성하는 액션 파일 생성부; 상기 액션 파일을 기반으로 상기 객체의 움직 임을 인식하는 행동 인식부; 인식된 상기 객체의 움직임을 상기 기준 자세와 비교하여 미리 설정된 오차를 초과 하면 오류 자세로 판단하는 자세 분석부; 상기 영상 데이터에서 상기 오류 자세로 판단된 부분만 자동으로 선별 하여 상기 오류 영상 데이터를 생성하는 오류 영상 데이터 생성부; 상기 영상 데이터 및 운동 데이터를 수신하 고, 상기 오류 영상 데이터 및 운동 데이터를 상기 트레이너 단말로 전송하는 통신부; 및 상기 영상 데이터, 운 동 데이터, 오류 영상 데이터 및 기준 자세를 저장하는 저장부;를 포함할 수 있다. 본 발명과 관련된 일 예로서 상기 이미지 양자화(Quantization) 기법은 이진화(binarization) 기법이고, 상기 액션 파일은 상기 영상 데이터의 개별 프레임 중에서 상기 객체가 수행하는 움직임을 나타내는 복수의 영상 프 레임을 포함하는 제1레이어 및 상기 복수의 영상 프레임의 개별 프레임 내에서 상기 객체의 객체 스켈레톤 데이터를 나타내는 제2레이어를 포함할 수 있다. 본 발명과 관련된 일 예로서 상기 제1레이어는 상기 복수의 영상 프레임 중에서 시작 프레임 정보, 종료 프레임 정보 및 상기 객체 스켈레톤 데이터가 없는 프레임을 포함하고, 상기 객체 스켈레톤 데이터는 상기 객체의 복수 의 스켈레톤의 위치 데이터를 포함하고, 상기 제2레이어는 상기 객체의 복수의 스켈레톤의 위치 데이터 중 적어 도 일부를 포함하고, 상기 운동 데이터는 운동 종류 및 종류별 동작 시나리오, 운동 세트, 운동 횟수 중 적어도 하나 이상을 포함하고, 상기 기준 자세는 운동 종류 및 종류별 동작 시나리오에 각각 대응하는 표준 객체 스켈 레톤 데이터를 포함할 수 있다. 본 발명과 관련된 일 예로서 상기 영상 데이터 내에 복수의 객체가 존재하는 경우, 상기 액션 파일 생성부는 상 기 복수의 영상 프레임의 개별 프레임 내에 상기 복수의 객체에 각각 대응하는 복수의 랜드마크 레이어를 생성 하고, 상기 자세 분석부는 상기 액션 파일 내 복수의 객체의 움직임을 각각 상기 기준 자세와 비교하여 판단할 수 있다. 본 발명과 관련된 일 예로서 상기 영상 데이터 및 운동 데이터는 상기 서버로 실시간 스트리밍 전송되고, 상기 서버는 상기 자세 분석부가 상기 객체의 움직임을 오류 자세로 판단하는 경우, 실시간으로 상기 오류 자세에 대 한 피드백 정보를 생성하여 상기 사용자 단말로 전송하는 피드백 생성부를 더 포함할 수 있다. 본 발명의 실시예에 따른 운동 보조를 위한 객체 움직임 인식 방법은 서버에 의해, 사용자 단말로부터 운동하는 사용자를 촬영하여 생성된 영상 데이터와 사용자로부터 입력된 운동 데이터를 수신하는 단계; 객체 추출부에 의 해, 상기 영상 데이터의 개별 프레임에 대해 이미지 양자화(Quantization) 기법을 수행하여 양자화된 프레임 이 미지를 생성하고, 상기 양자화된 프레임 이미지에서 객체를 추출하는 단계; 스켈레톤 생성부에 의해, 상기 객체 로부터 객체 스켈레톤 데이터를 생성하는 단계; 액션 파일 생성부에 의해, 상기 객체 스켈레톤 데이터로부터 액 션 파일을 생성하는 단계; 행동 인식부에 의해, 상기 액션 파일을 기반으로 상기 객체의 움직임을 인식하는 단 계; 자세 분석부에 의해, 인식된 상기 객체의 움직임을 기준 자세와 비교하여 미리 설정된 오차를 초과하면 오 류 자세로 판단하는 단계; 오류 영상 생성부에 의해, 상기 영상 데이터에서 상기 오류 자세로 판단된 부분만 자 동으로 선별하여 오류 영상 데이터를 생성하는 단계; 및 상기 서버에 의해, 상기 오류 영상 데이터 및 운동 데 이터를 트레이너 단말로 전송하는 단계;를 포함할 수 있다. 본 발명과 관련된 일 예로서 상기 이미지 양자화(Quantization) 기법은 이진화(binarization) 기법이고, 상기 액션 파일을 생성하는 단계는, 상기 영상 데이터의 영상 프레임 중에서 상기 객체가 수행하는 움직임을 나타내 는 복수의 영상 프레임을 포함하는 제1레이어를 생성하는 단계; 및 상기 복수의 영상 프레임의 개별 프레임 내 에서 상기 객체의 객체 스켈레톤 데이터를 나타내는 제2레이어를 생성하는 단계;를 더 포함할 수 있다. 본 발명과 관련된 일 예로서 상기 제1레이어는 상기 복수의 영상 프레임 중에서 시작 프레임 정보, 종료 프레임 정보 및 상기 객체 스켈레톤 데이터가 없는 프레임을 포함하고, 상기 객체 스켈레톤 데이터는 상기 객체의 복수 의 스켈레톤의 위치 데이터를 포함하고, 상기 제2레이어는 상기 객체의 복수의 스켈레톤의 위치 데이터 중 적어 도 일부를 포함하고, 상기 운동 데이터는 운동 종류 및 종류별 동작 시나리오, 운동 세트, 운동 횟수 중 적어도 하나 이상을 포함하고, 상기 기준 자세는 운동 종류 및 종류별 동작 시나리오에 각각 대응하는 표준 객체 스켈 레톤 데이터를 포함할 수 있다. 본 발명과 관련된 일 예로서, 상기 영상 데이터 내에 복수의 객체가 존재하는 경우, 상기 액션 파일을 생성하는 단계는 상기 복수의 영상 프레임의 개별 프레임 내에 상기 복수의 객체에 각각 대응하는 복수의 랜드마크 레이 어를 생성하고, 상기 오류 자세로 판단하는 단계는 상기 액션 파일 내 복수의 객체의 움직임을 각각 상기 기준 자세와 비교하여 판단하는 것을 특징으로 할 수 있다. 본 발명과 관련된 일 예로서 상기 영상 데이터 및 운동 데이터는 상기 서버로 실시간 스트리밍 전송되고, 상기 자세 분석부가 상기 객체의 움직임을 오류 자세로 판단하는 경우, 피드백 생성부가 실시간으로 상기 오류 자세 에 대한 피드백 정보를 생성하여 상기 사용자 단말로 전송하는 피드백 생성 단계;를 더 포함할 수 있다."}
{"patent_id": "10-2021-0081519", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 운동 보조를 위한 객체 움직임 인식 시스템 및 방법은 영상을 기반으로 사용자가 운동하는 자세를 스켈레톤 데이터를 활용하여 분석할 수 있다. 또한, 본 발명의 일 실시예는 인간의 형상을 본 뜬 스켈레톤 데이터를 활용하여 액션 파일을 생성하게 되어, 객 체가 행하는 행동 비교, 객체의 동작 분석 및 예측을 하는데 효율적으로 사용이 가능하고, 회전, 승강에 의한거부감을 최소화하며 기타 다른 부가적인 도구, 기능, 옵션 등이 추가 되지 않아 스트레스를 줄이며 신체 부위 를 정확하게 스캔할 수 있다. 본 발명의 일 실시예에 따른 운동 보조를 위한 객체 움직임 인식 시스템 및 방법은 인간의 영상 콘텐츠를 경량 화된 인공지능 알고리즘을 기반으로 사람의 관절을 추출하고, 검출된 관절을 활용하여 움직임 예측과 평가를 통 해서 인간이 행하는 동작에 대한 피드백, 정확도 등을 판단하여 바른 운동, 보행 등의 동작에 대한 정확도를 잡 아줄 수 있다. 본 발명의 일 실시예에 따르면, 일방적인 콘텐츠의 소비가 아니라 특정 행동을 취했을 때, 오류 정보를 알려주 거나 다음 동작을 취할 수 있도록 시청자료가 나타나는 등의 사용자와 콘텐츠 간의 상호교류 및 액션과 반작용 을 통한 교류가 가능하여 인터랙션 작용이 가능한 프로그램 및 장기 관리가 필요한 프로그램 등에서 활용이 가 능하다."}
{"patent_id": "10-2021-0081519", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상기한 바와 같은 본 발명을 첨부된 도면들과 실시예들을 통해 상세히 설명하도록 한다. 본 발명에서 사용되는 기술적 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려 는 의도가 아님을 유의해야 한다. 또한, 본 발명에서 사용되는 기술적 용어는 본 발명에서 특별히 다른 의미로 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 기술적인 용어가 본 발명의 사상을 정확하게 표현하지 못하는 잘못된 기술적 용어일 때에 는, 당업자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것이다. 또한, 본 발명에서 사용 되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상에 따라 해석되어야 하며, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함한다. 본 발명에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 발명에 기재된 여러 구성 요소들, 또는 여러 단계를 반 드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 또한, 본 발명에서 사용되는 제 1, 제 2 등과 같이 서수를 포함하는 용어는 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요소들은 용어들에 의해 한정되어서는 안 된다. 용어들은 하나의 구성 요소를 다른 구성 요소 로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성 요소는 제 2 구성 요소로 명명될 수 있고, 유사하게 제 2 구성 요소도 제 1 구성 요소로 명명될 수 있다.본 명세서에 설명된 다양한 기법은 하드웨어 또는 소프트웨어와 함께 구현되거나, 적합한 경우에 이들 모두의 조합과 함께 구현될 수 있다. 본 명세서에 사용된 바와 같은 \"...부(Unit)\", \"...서버(Server)\" 및 \"...시스템 (System)\" 등의 용어는 마찬가지로 컴퓨터 관련 엔티티(Entity), 즉 하드웨어, 하드웨어 및 소프트웨어의 조합, 소프트웨어 또는 실행 시의 소프트웨어와 등가로 취급할 수 있다. 또한, 본 발명의 프로그램에서 실행되는 각 기능은 모듈단위로 구성될 수 있고, 하나의 물리적 메모리에 기록되거나, 둘 이상의 메모리 및 기록매체 사이에 분산되어 기록될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동 일하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 발명의 사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 발명의 사상이 제한되는 것으로 해석되어서는 아니 됨을 유의해야 한다. 이하, 도면을 참조하여 본 발명의 실시예에 따른 운동 보조를 위한 객체 움직임 인식 시스템 및 방법을 설명한 다. 도 1은 본 발명의 일 실시예에 따른 운동 보조를 위한 객체 움직임 인식 시스템을 개략적으로 나타내는 블록도 이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 운동 보조를 위한 객체 움직임 인식 시스템은, 운동하는 사용자 를 촬영하여 영상 데이터를 생성하고, 상기 영상 데이터와 사용자로부터 입력된 운동 데이터를 서버로 전송하는 사용자 단말, 상기 영상 데이터의 개별 프레임에 대해 이미지 양자화(Quantization) 기법을 수행하여 양자 화된 프레임 이미지를 생성하고, 상기 양자화된 프레임 이미지에서 객체를 추출하고, 상기 객체의 움직임을 기 준 자세와 비교하여 비교 결과를 기초로 오류 영상 데이터를 생성하며, 상기 오류 영상 데이터 및 운동 데이터 를 트레이너 단말로 전송하는 서버를 포함할 수 있다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(network)를 통해 연결된다. 예를 들어, 사용자 단말은 네트워크를 통하여 서버와 연결될 수 있다. 서버는, 네트워크를 통하여 상기 사용자 단말 및 트 레이너 단말과 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스 (Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워 크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 전술한 사용자 단말 및 트레이너 단말로는 PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단 말, 스마트폰(smartphone), 스마트 패드(smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 모바일 단말 장치 및 거치형PC, 노트북과 같은 컴퓨팅 장치가 이용될 수 있다. 도 2는 본 발명의 일 실시예에 따른 서버의 구성을 나타내는 블록도이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 서버는, 영상 데이터의 개별 프레임에 대해 이미지 양자화 (Quantization) 기법을 수행하여 양자화된 프레임 이미지를 생성하고, 상기 양자화된 프레임 이미지에서 상기 객체를 추출하는 객체 추출부, 상기 객체로부터 객체 스켈레톤 데이터를 생성하는 스켈레톤 생성부, 상기 객체 스켈레톤 데이터로부터 액션 파일을 생성하는 액션 파일 생성부, 상기 액션 파일을 기반으로 상 기 객체의 움직임을 인식하는 행동 인식부, 인식된 상기 객체의 움직임을 상기 기준 자세와 비교하여 미리 설정된 오차를 초과하면 오류 자세로 판단하는 자세 분석부, 상기 영상 데이터에서 상기 오류 자세로 판단된 부분만 자동으로 선별하여 상기 오류 영상 데이터를 생성하는 오류 영상 데이터 생성부, 상기 영상 데 이터 및 운동 데이터를 수신하고, 상기 오류 영상 데이터 및 운동 데이터를 상기 트레이너 단말로 전송하는 통 신부 및 상기 영상 데이터, 운동 데이터, 오류 영상 데이터 및 기준 자세를 저장하는 저장부를 포함 할 수 있다. 상기 서버는 상기 자세 분석부가 상기 객체의 움직임을 오류 자세로 판단하는 경우, 실시간으로 상기 오류 자세에 대한 피드백 정보를 생성하여 상기 사용자 단말로 전송하는 피드백 생성부를 더 포함할 수 있 다. 상기 객체 추출부가 양자화된 프레임 이미지를 생성하기 위해 영상 데이터의 개별 프레임에 대해 수행하는 이미지 양자화(Quantization) 기법은 이진화(binarization) 기법일 수 있다. 상기 액션 파일 생성부가 생성하는 액션 파일은 상기 영상 데이터의 개별 프레임 중에서 상기 객체가 수행 하는 움직임을 나타내는 복수의 영상 프레임을 포함하는 제1레이어 및 상기 복수의 영상 프레임의 개별 프레임 내에서 상기 객체의 객체 스켈레톤 데이터를 나타내는 제2레이어를 포함할 수 있다. 상기 제1레이어는 상기 복수의 영상 프레임 중에서 시작 프레임 정보, 종료 프레임 정보 및 상기 객체 스켈레톤 데이터가 없는 프레임을 포함하고, 상기 객체 스켈레톤 데이터는 상기 객체의 복수의 스켈레톤의 위치 데이터를 포함하고, 상기 제2레이어는 상기 객체의 복수의 스켈레톤의 위치 데이터 중 적어도 일부를 포함하고, 상기 운 동 데이터는 운동 종류 및 종류별 동작 시나리오, 운동 세트, 운동 횟수 중 적어도 하나 이상을 포함하고, 상기 기준 자세는 운동 종류 및 종류별 동작 시나리오에 각각 대응하는 표준 객체 스켈레톤 데이터를 포함할 수 있다. 본 발명의 실시예에 따른 액션 파일 생성부는 상기 영상 데이터 내에 복수의 객체가 존재하는 경우, 상기 복수의 영상 프레임의 개별 프레임 내에 상기 복수의 객체에 각각 대응하는 복수의 랜드마크 레이어를 생성하고, 자세 분석부는 액션 파일 내 복수의 객체의 움직임을 각각 상기 기준 자세와 비교하여 판단할 수 있다. 본 발명의 일 실시예에 따르면, 사용자 단말은 영상 데이터와 운동 데이터를 서버로 실시간 스트리밍 전송할 수 있고, 서버는 자세 분석부가 객체의 움직임을 오류 자세로 판단하는 경우, 피드백 생성부 가 실시간으로 오류 자세에 대한 피드백 정보를 생성하여 사용자 단말로 전송할 수 있다. 도 3은 본 발명의 일 실시예에 따른 운동 보조를 위한 객체 움직임 인식 방법을 도시한 흐름도이다. 도 3을 참조하면, 서버에 의해, 사용자 단말로부터 운동하는 사용자를 촬영하여 생성된 영상 데이터 와 사용자로부터 입력된 운동 데이터를 수신하는 단계(S310), 객체 추출부에 의해, 상기 영상 데이터의 개 별 프레임에 대해 이미지 양자화(Quantization) 기법을 수행하여 양자화된 프레임 이미지를 생성하고, 상기 양 자화된 프레임 이미지에서 객체를 추출하는 단계(S320), 스켈레톤 생성부에 의해, 상기 객체로부터 객체 스켈레톤 데이터를 생성하는 단계(S330), 액션 파일 생성부에 의해, 상기 객체 스켈레톤 데이터로부터 액 션 파일을 생성하는 단계(S340), 행동 인식부에 의해, 상기 액션 파일을 기반으로 상기 객체의 움직임을 인식하는 단계(S350), 자세 분석부에 의해, 인식된 상기 객체의 움직임을 기준 자세와 비교하여 미리 설정 된 오차를 초과하면 오류 자세로 판단하는 단계(S360), 오류 영상 데이터 생성부에 의해, 상기 영상 데이 터에서 상기 오류 자세로 판단된 부분만 자동으로 선별하여 오류 영상 데이터를 생성하는 단계(S370), 상기 서 버에 의해, 상기 오류 영상 데이터 및 운동 데이터를 트레이너 단말로 전송하는 단계(S380), 피드백 생성 부에 의해, 상기 오류 자세에 대한 피드백 정보를 생성하여 사용자 단말(S390)로 전송하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 이미지 양자화(Quantization) 기법은 이진화(binarization) 기법일 수 있 다. 본 발명의 일 실시예에 따르면, 상기 액션 파일을 생성하는 단계(S340)는, 상기 영상 데이터의 영상 프레임 중 에서 상기 객체가 수행하는 움직임을 나타내는 복수의 영상 프레임을 포함하는 제1레이어를 생성하는 단계 및 상기 복수의 영상 프레임의 개별 프레임 내에서 상기 객체의 객체 스켈레톤 데이터를 나타내는 제2레이어를 생 성하는 단계를 더 포함할 수 있다. 상기 제1레이어는 상기 복수의 영상 프레임 중에서 시작 프레임 정보, 종료 프레임 정보 및 상기 객체 스켈레톤 데이터가 없는 프레임을 포함하고, 상기 객체 스켈레톤 데이터는 상기 객체의 복수의 스켈레톤의 위치 데이터를포함하고, 상기 제2레이어는 상기 객체의 복수의 스켈레톤의 위치 데이터 중 적어도 일부를 포함하고, 상기 운 동 데이터는 운동 종류 및 종류별 동작 시나리오, 운동 세트, 운동 횟수 중 적어도 하나 이상을 포함하고, 상기 기준 자세는 운동 종류 및 종류별 동작 시나리오에 각각 대응하는 표준 객체 스켈레톤 데이터를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 영상 데이터 내에 복수의 객체가 존재하는 경우, 상기 액션 파일을 생성하 는 단계(S340)는 상기 복수의 영상 프레임의 개별 프레임 내에 상기 복수의 객체에 각각 대응하는 복수의 랜드 마크 레이어를 생성하고, 상기 오류 자세로 판단하는 단계(S360)는 상기 액션 파일 내 복수의 객체의 움직임을 각각 상기 기준 자세와 비교하여 판단할 수 있다. 도 4는 본 발명의 일 실시예에 따른 스켈레톤 모델의 예시를 보여주는 도면이다. 도 4를 참조하면, 신체에 대하여 코, 우안, 좌안, 우측 귀, 좌측 귀, 우측 어깨, 좌측 어깨, 우측 팔꿈치, 좌측 팔꿈치, 우측 손목, 좌측 손목, 우측 엉덩이, 좌측 엉덩이, 우측 무릎, 좌측 무릎, 우측 발목, 좌측 발목의 총 17개의 키포인트를 선으로 각각 연결하여 스켈레톤 모델을 설정하고, 이를 이용하여 운동 종류 및 종류별 동작 시나리오에 따라 기준 자세를 생성할 수 있다. 일 실시예에 따르면, 신체의 관절이나 특정 부위의 스켈레톤 데이터를 추출하기 위해 마이크로소프트의 Kinetics 데이터 세트나 NTU-RGB-D(Nanyang Technological University's Red Blue Green and Depth information) 데이터 세트와 같은 관절 검출 알고리즘을 활용할 수 있다. 본 발명의 일 실시예에 따르면, 운동종류는 다이나믹 체스트, 런지, 사이드 크런치, 원투 니킥, 점핑잭, 스쿼트, 트래블링 로우 등 피트니스의 주요 동작들을 포함할 수 있다. 본 발명의 일 실시예에 따른 운동 보조를 위한 객체 움직임 인식 시스템은 운동 종류 및 종류별 동작 시나리오 에 대응하는 세부 동작별로 17개의 키포인트에 대해 라벨링하여 표준 객체 스켈레톤 데이터를 생성할 수 있다. 또한 운동 종류 및 종류별 동작 시나리오에 대응하는 복수의 운동 영상을 제작하거나 수집하여 훈련용 및 테스 트용 데이터셋을 구축하고, 상기 훈련용 데이터셋에 대해 인공지능 동체 분석 알고리즘이 적용된 이용하여 운동 영상 속 객체를 추출하고, 상기 객체의 움직임을 인식하는 기계 학습을 수행하도록 한다. 이때 인공지능 동체 분석 알고리즘은 합성곱 신경망(Convolutional Neural Network, CNN) 또는 장단기 메모리(Long Short-Term Memory, LSTM) 기법을 기반으로 기계 학습을 수행할 수 있다. 테스트용 데이터셋에 대해 기계 학습을 수행하는 동안, 객체 움직임에 대한 인식 정확도를 분석하여 인공지능 동체 분석 알고리즘의 튜닝 작업을 수행하여 인공 지능 모델을 완성할 수 있다. 위와 같은 과정을 거쳐 생성된 인공지능 모델의 경량화를 위해, 이미지 양자화(Quantization) 기법이 수행될 수 있다. 도 5를 통해 이미지 양자화(Quantization) 기법에 대해서 설명하기로 한다. 도 5는 본 발명의 일 실시예에 따른 이미지 데이터 양자화(Quantization) 기법을 수행하는 예시를 보여주는 도 면이다. 양자화(Quantization) 기법은 FP32(32비트 부동소수점 타입) 기반의 학습 파라미터의 값들을 이보다 낮은 비트 너비를 갖는 1~K 비트 크기로 표현하기 위해 사용하는 기법이다. 양자화란 용어는 본래 아날로그 신호를 디지털 로 변환하는데 있어 아날로그 값을 비트열로 표현할 수 있는 디지털 값으로 변환하는 과정을 일컫지만, 여기에 서는 기존 부동소수점 타입으로 표현되던 값을 보다 적은 비트로 표현하기 위해 변환하는 과정을 의미한다. 기계 학습에 적용되는 많은 딥 러닝 모델들은 파라미터 저장을 위해 FP32(32비트) 타입을 주로 사용하는데, 이 를 그보다 훨씬 낮은 K 비트들로 표현함으로써 파라미터들의 일부를 버리지 않더라도 모델의 크기를 이론상 32/K 배만큼 줄일 수 있기 때문에 적은 저장 공간과 연산량만으로도 효율적인 추론이 가능하다는 장점이 있다. 바람직하게는 본 발명의 실시예에 따른 이미지 양자화 기법은 이진화(binarization) 기법을 사용할 수 있다. 이 진화 기법은 상술한 파라미터를 -1 또는 1 값만 가지는 1비트로 표현하는 것을 의미한다. 도 5를 참조하면, 원본 이미지에서 입력된 데이터 값에 대해 이미지 양자화를 수행하여 양자화된 이미지 및 양 자화된 입력값을 볼 수 있다. 이와 같이 이미지의 특정 파라미터에 대해 32비트로 표현되는 값을 1 또는 -1로 표현하는 이진화 기법을 사용하여 기존 인공지능 모델을 경량화 시킬 수 있다. 도 6은 본 발명의 일 실시예에 따른 랜드마크 레이어를 설명하기 위한 도면이다. 도 6을 참조하면, 본 발명의 일 실시예에 따른 서버는 사용자 단말로부터 수신한 영상 데이터 내에 복수의 객체 존재 여부를 인식할 수 있다. 이에 대해 구체적으로 설명하면, 객체 추출부가 영상 데이터의 개별 프레임에 대해 이미지 양자화(Quantization) 기법을 수행하여 양자화된 프레임 이미지를 생성하고, 상기 양자화된 프레임 이미지에서 상기 객체를 추출하는 과정에서 복수의 객체 존재 여부를 인식할 수 있다. 상기 객 체 추출부가 복수의 객체 존재를 인식하면, 스켈레톤 생성부가 복수의 객체별로 각각 객체 스켈레톤 데이터를 생성하고, 액션 파일 생성부는 복수의 영상 프레임의 개별 프레임 내에 상기 복수의 객체에 각각 대응하는 복수의 랜드마크 레이어를 생성할 수 있다. 도 6은 영상 데이터 내에 복수의 객체가 존재하는 경우, 액션 파일 생성부가 영상 데이터 내 복수의 영상 프레임 중 특정 프레임 t에서 복수의 객체에 대해 각각 랜드마크 레이어를 생성한 모습을 보여준다. 상기 액션 파일 생성부는 영상 데이터 내의 복수의 영상 프레임 전체에 대해 각각 랜드마크 레이어를 생성할 수 있다. 한편, 자세 분석부는 상기 액션 파일 생성부가 생성한 복수의 객체별 액션 파일을 기반으로 액션 파 일 내 복수의 객체의 움직임을 각각 기준 자세와 비교하여 판단할 수 있다. 도 7과 8은 본 발명의 일 실시예에 따른 사용자 단말에서 운동 보조를 위한 모바일 어플리케이션을 구동하는 흐 름과 이에 따른 그래픽 인터페이스를 보여주는 도면이다. 도 7 및 8을 참조하면, 사용자 단말은 서버로부터 제공받은 모바일 어플리케이션을 설치하고, 구동할 수 있다. 사용자 단말이 모바일 어플리케이션을 구동하면, 인트로 동영상이 재생되고, 로그인 화면이 제시 된다. 사용자가 로그인을 수행하면 어플리케이션 하단에 운동하기(셋팅 화면), 레포트, 설정의 세가지 메뉴를 위한 내 비게이션 바가 제공된다. 사용자가 운동하기 메뉴를 선택하면 운동 종류별 명칭과 아이콘이 제공되고, 사용자가 운동 종류를 선택하고, 운동 세트수, 운동 횟수를 선택하면, 운동 화면을 통해 사용자가 선택한 운동을 따라할 수 있으며, 사용자의 운동 횟수는 자동으로 카운팅되어 사용자 단말의 화면에 표시될 수 있다. 사용자가 레포트 메뉴를 선택하면 일일 레포트를 볼 수 있으며, 일일 레포트 메뉴에서는 사용자가 실시한 운동 종류, 운동 세트, 운동 횟수 등의 통계 기록을 확인할 수 있다. 추가적으로, 사용자가 운동하는 모습이 녹화된 영상도 확인할 수 있다. 녹화된 영상은 운동 시작부터 끝까지 모두 녹화된 영상일 수 있으나 이에 제한되지 않 으며, 서버에서 생성된 오류 영상 데이터를 볼 수 있도록 제공될 수 있다. 사용자가 설정 메뉴를 선택하면 로그아웃, 회원 정보, 어플리케이션 버전 정보, 라이선스 정보, 효과음 등의 어 플리케이션 설정 및 관련 정보를 확인하기 위한 메뉴들이 제공될 수 있다. 도 9는 본 발명의 일 실시예에 따른 월별/일별 오류 영상 데이터를 볼 수 있는 인터페이스를 보여주는 도면이다. 도 9의 월별/일별 오류 영상 데이터를 볼 수 있는 인터페이스는 사용자 단말 또는 트레이너 단말에 제공될 수 있다. 이와 같이 운동 보조를 위한 객체 움직임 인식 시스템은 월별/일별 오류 영상 데이터를 사용자 단말과 관 련된 트레이너 단말에 제공함으로써, 트레이너가 사용자의 운동 모습 중 오류 자세만을 신속하고 간단하게 확인할 수 있고, 이를 통해 트레이너가 오프라인 상에서 사용자의 운동 자세 교정에만 집중할 수 있으므로 적은 시간만으로도 사용자의 운동 자세 교정을 도울 수 있는 효과가 있다. 이상에서는 본 발명에 따른 바람직한 실시예들에 대하여 도시하고 또한 설명하였다. 그러나 본 발명은 상술한 실시예에 한정되지 아니하며, 특허 청구의 범위에서 첨부하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형 실시가 가능할 것이다."}
{"patent_id": "10-2021-0081519", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 운동 보조를 위한 객체 움직임 인식 시스템을 개략적으로 나타내는 블록도 이다. 도 2는 본 발명의 일 실시예에 따른 서버의 구성을 나타내는 블록도이다. 도 3은 본 발명의 일 실시예에 따른 운동 보조를 위한 객체 움직임 인식 방법을 도시한 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 스켈레톤 모델의 예시를 보여주는 도면이다. 도 5는 본 발명의 일 실시예에 따른 이미지 데이터 양자화(Quantization) 기법을 수행하는 예시를 보여주는 도 면이다. 도 6은 본 발명의 일 실시예에 따른 랜드마크 레이어를 설명하기 위한 도면이다. 도 7은 본 발명의 일 실시예에 따른 사용자 단말에서 운동 보조를 위한 모바일 어플리케이션을 구동하는 흐름도 이다. 도 8은 본 발명의 일 실시예에 따른 사용자 단말에서 운동 보조를 위한 모바일 어플리케이션의 그래픽 인터페이 스를 보여주는 도면이다. 도 9는 본 발명의 일 실시예에 따른 월별/일자별 오류 영상 데이터를 볼 수 있는 인터페이스를 보여주는 도면이 다."}
