{"patent_id": "10-2019-7019216", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0128481", "출원번호": "10-2019-7019216", "발명의 명칭": "자율 주행 차량을 위한 보험 안내 시스템 및 방법", "출원인": "엘지전자 주식회사", "발명자": "김소령"}}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "목적지와 차량의 안전 등급을 입력하는 사용자 단말기; 및 상기 목적지까지의 주행 경로 상에서 둘 이상 존재하는 구간들의 구간별 보험 관련 정보를 상기 사용자 단말기로 전송하는 서버를 포함하고, 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 주행 경로 상에서 선택된 구간별 보험과 위험 구간을 표시하는 자율 주행 차량을 위한 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 차량이 자율 주행 모드로 운행될 때 상기 위험 구간에서 구간별 보험이 적용되는 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 서버는 상기 차량이 구간에 진입할 때 미리 가입된 구간별 보험을 적용하고, 상기 구간이 끝날 때 상기 구간별 보험을해지하는 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 서버는 상기 주행 경로의 구간을 이탈할 때 상기 구간에 가입된 구간별 보험을 해지하는 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 차량의 안전 등급은, 상기 차량에 구비된 안전 장치의 개수와 종류에 따라 설정되는 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 차량의 안전 등급은,상기 차량의 외부 객체를 감지하기 위한 카메라, 레이다, 라이다, 초음파 센서 및 적외선 센서 중 하나 이상의해상도와 탐지 거리에 따라 설정되는 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 서버는,구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상을 실시간 감지하여 구간별 위험도를 판정하고, 상기 구간별 위험도에 따라 상기 위험 구간을 설정하는 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2020-0128481-3-제 1 항에 있어서,상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 구간별 사고 유형, 상기 구간별 사고 발생율을 표시하는보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 서버는,상기 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상이 변화할 때 상기 위험 구간을 등록하거나 해지하는 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서,상기 서버는,상기 차량의 운행 모드가 매뉴얼 모드로부터 자율 주행 모드로 변경될 때 상기 위험 구간을 등록하거나 해지하는 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 서버는,타 사용자가 사용한 구간별 보험 이력을 바탕으로 상기 사용자 단말기와 상기 차량 중 하나 이상에 구간별 추천보험 정보를 전송하고,상기 사용자 단말기와 상기 차량 중 하나 이상에 상기 구간별 추천 보험 정보가 표시되는 보험 안내 시스템."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "사용자 단말기에 목적지와 차량의 안전 등급을 입력하는 단계; 서버가 상기 목적지까지의 주행 경로 상에서 둘 이상 존재하는 구간들의 구간별 보험 관련 정보를 상기 사용자단말기로 전송하는 단계; 및 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 주행 경로 상에서 선택된 구간별 보험과 위험 구간을 표시하는 단계를 포함하는 자율 주행 차량을 위한 보험 안내 방법."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 차량이 자율 주행 모드로 운행될 때 상기 위험 구간에서 구간별 보험이 적용되는 보험 안내 방법."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12 항에 있어서,상기 차량이 구간에 진입할 때 상기 서버가 미리 가입된 구간별 보험을 적용하는 단계; 및 상기 차량의 주행 중에 상기 구간이 끝날 때 상기 서버가 상기 구간별 보험을 해지하는 단계를 더 포함하는 보험 안내 방법."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 12 항에 있어서,상기 주행 경로의 구간을 이탈할 때 상기 서버가 상기 구간에 가입된 구간별 보험을 해지하는 단계를 더 포함하는 보험 안내 방법. 공개특허 10-2020-0128481-4-청구항 16 제 12 항에 있어서,상기 차량에 구비된 안전 장치의 개수와 종류에 따라 상기 차량의 안전 등급이 설정되는 보험 안내 방법."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 12 항에 있어서,상기 차량의 외부 객체를 감지하기 위한 카메라, 레이다, 라이다, 초음파 센서 및 적외선 센서 중 하나 이상의해상도와 탐지 거리에 따라 상기 차량의 안전 등급이 설정되는 보험 안내 방법."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 12 항에 있어서,구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상을 상기 서버가 실시간 감시하여구간별 위험도를 판정하고, 상기 구간별 위험도에 따라 상기 위험 구간을 설정하는 보험 안내 방법."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 12 항에 있어서,상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 구간별 사고 유형, 상기 구간별 사고 발생율을 표시하는보험 안내 방법."}
{"patent_id": "10-2019-7019216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,상기 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상이 변화할 때 상기 서버가상기 위험 구간을 등록하거나 해지하는 보험 안내 방법."}
{"patent_id": "10-2019-7019216", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "자율 주행 차량을 위한 보험 안내 시스템 및 방법이 개시된다. 본 발명의 일 실시 예에 따른 보험 안내 시스템 은 험 안내 시스템은 목적지와 차량의 안전 등급을 입력하는 사용자 단말기; 및 상기 목적지까지의 주행 경로 상 에서 둘 이상 존재하는 구간들의 구간별 보험 관련 정보를 상기 사용자 단말기로 전송하는 서버를 포함한다. 본 발명은 사용자가 주행 경로 상의 위험 구간을 사전에 인지하도록 구간별 위험도를 제공함으로써 사고를 예방할 수 있게 하고, 미연의 사고 발생시 적절한 보험료로 사용자의 피해를 보상 받을 수 있게 할 수 있다. 본 발명의 자율 주행 차량, 사용자 단말기 및 서버 중 하나 이상이 인공 지능(Artificial Inteligence) 모듈, 드론 (Unmanned Aerial Vehicle, UAV), 로봇, 증강 현실(Augmented Reality, AR) 장치, 가상 현실(virtual reality, VR), 5G 서비스와 관련된 장치 등과 연계 혹은 융복합될 수 있다. 공개특허10-2020-0128481 CPC특허분류 B60W 30/14 (2013.01) B60W 40/02 (2013.01) G05D 1/0061 (2013.01) G05D 1/0088 (2013.01) B60W 2420/40 (2013.01) B60W 2420/42 (2013.01) B60W 2420/52 (2013.01) B60W 2420/54 (2013.01) B60W 2554/00 (2020.02)명 세 서 청구범위 청구항 1 목적지와 차량의 안전 등급을 입력하는 사용자 단말기; 및 상기 목적지까지의 주행 경로 상에서 둘 이상 존재하는 구간들의 구간별 보험 관련 정보를 상기 사용자 단말기 로 전송하는 서버를 포함하고, 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 주행 경로 상에서 선택된 구간별 보험과 위험 구간을 표 시하는 자율 주행 차량을 위한 보험 안내 시스템. 청구항 2 제 1 항에 있어서, 상기 차량이 자율 주행 모드로 운행될 때 상기 위험 구간에서 구간별 보험이 적용되는 보험 안내 시스템. 청구항 3 제 1 항에 있어서, 상기 서버는 상기 차량이 구간에 진입할 때 미리 가입된 구간별 보험을 적용하고, 상기 구간이 끝날 때 상기 구간별 보험을 해지하는 보험 안내 시스템. 청구항 4 제 1 항에 있어서, 상기 서버는 상기 주행 경로의 구간을 이탈할 때 상기 구간에 가입된 구간별 보험을 해지하는 보험 안내 시스템. 청구항 5 제 1 항에 있어서, 상기 차량의 안전 등급은, 상기 차량에 구비된 안전 장치의 개수와 종류에 따라 설정되는 보험 안내 시스템. 청구항 6 제 1 항에 있어서, 상기 차량의 안전 등급은, 상기 차량의 외부 객체를 감지하기 위한 카메라, 레이다, 라이다, 초음파 센서 및 적외선 센서 중 하나 이상의 해상도와 탐지 거리에 따라 설정되는 보험 안내 시스템. 청구항 7 제 1 항에 있어서, 상기 서버는, 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상을 실시간 감지하여 구간별 위험 도를 판정하고, 상기 구간별 위험도에 따라 상기 위험 구간을 설정하는 보험 안내 시스템. 청구항 8 제 1 항에 있어서, 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 구간별 사고 유형, 상기 구간별 사고 발생율을 표시하는 보험 안내 시스템. 청구항 9 제 7 항에 있어서, 상기 서버는, 상기 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상이 변화할 때 상기 위험 구 간을 등록하거나 해지하는 보험 안내 시스템. 청구항 10 제 7 항에 있어서, 상기 서버는, 상기 차량의 운행 모드가 매뉴얼 모드로부터 자율 주행 모드로 변경될 때 상기 위험 구간을 등록하거나 해지하 는 보험 안내 시스템. 청구항 11 제 1 항에 있어서, 상기 서버는, 타 사용자가 사용한 구간별 보험 이력을 바탕으로 상기 사용자 단말기와 상기 차량 중 하나 이상에 구간별 추천 보험 정보를 전송하고, 상기 사용자 단말기와 상기 차량 중 하나 이상에 상기 구간별 추천 보험 정보가 표시되는 보험 안내 시스템. 청구항 12 사용자 단말기에 목적지와 차량의 안전 등급을 입력하는 단계; 서버가 상기 목적지까지의 주행 경로 상에서 둘 이상 존재하는 구간들의 구간별 보험 관련 정보를 상기 사용자 단말기로 전송하는 단계; 및 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 주행 경로 상에서 선택된 구간별 보험과 위험 구간을 표 시하는 단계를 포함하는 자율 주행 차량을 위한 보험 안내 방법. 청구항 13 제 12 항에 있어서, 상기 차량이 자율 주행 모드로 운행될 때 상기 위험 구간에서 구간별 보험이 적용되는 보험 안내 방법. 청구항 14 제 12 항에 있어서, 상기 차량이 구간에 진입할 때 상기 서버가 미리 가입된 구간별 보험을 적용하는 단계; 및 상기 차량의 주행 중에 상기 구간이 끝날 때 상기 서버가 상기 구간별 보험을 해지하는 단계를 더 포함하는 보 험 안내 방법. 청구항 15 제 12 항에 있어서, 상기 주행 경로의 구간을 이탈할 때 상기 서버가 상기 구간에 가입된 구간별 보험을 해지하는 단계를 더 포함하 는 보험 안내 방법. 청구항 16 제 12 항에 있어서, 상기 차량에 구비된 안전 장치의 개수와 종류에 따라 상기 차량의 안전 등급이 설정되는 보험 안내 방법. 청구항 17 제 12 항에 있어서, 상기 차량의 외부 객체를 감지하기 위한 카메라, 레이다, 라이다, 초음파 센서 및 적외선 센서 중 하나 이상의 해상도와 탐지 거리에 따라 상기 차량의 안전 등급이 설정되는 보험 안내 방법. 청구항 18 제 12 항에 있어서, 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상을 상기 서버가 실시간 감시하여 구간별 위험도를 판정하고, 상기 구간별 위험도에 따라 상기 위험 구간을 설정하는 보험 안내 방법. 청구항 19 제 12 항에 있어서, 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 구간별 사고 유형, 상기 구간별 사고 발생율을 표시하는 보험 안내 방법. 청구항 20 제 18 항에 있어서, 상기 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상이 변화할 때 상기 서버가 상기 위험 구간을 등록하거나 해지하는 보험 안내 방법. 발명의 설명"}
{"patent_id": "10-2019-7019216", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 보험 안내 시스템 및 방법에 관한 것으로, 보다 구체적으로는 경로 상의 구간 별로 필요한 보험을 안 내하고 위험 구간의 실시간 모니터링을 바탕으로 보험 안내를 업데이트하는 자율 주행 차량을 위한 보험 안내 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2019-7019216", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율 주행 차량은 운전자의 개입 없이 스스로 운행이 가능하다. 이미 많은 업체들이 자율 주행 차량 사업에 진 출하여, 연구 개발에 몰두하고 있다. 자율 주행 차량은 운전자 개입 없이 빈 공간을 찾아 주차되는 자동 주차 서비스를 지원할 수 있다."}
{"patent_id": "10-2019-7019216", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "자동차 보험은 자동차 사고에 대한 불안을 해소하기 위하여 보험회사에 보험료를 지불하고 사고가 날 경우에 인 적, 물적 손해를 보상 받을 수 있게 하고, 경제적으로 피해자를 구제하는 보험이다. 하지만, 기존 자동차 보험 의 경우에 보험 정보 부족 및 가입할 수 있는 보험이 한정적이다. 최근, 자율 주행 차량의 증가로 기존 자동차 보험의 개선이 시급한 문제로 대두되고 있다. 기존의 자동차 보험 은 자율 주행 차량의 상태를 고려 하지 않기 때문에 다양한 법적 문제를 초래할 수 있다. 자율 주행 차량으로 인하여, 차량은 소유의 개념에서 공유 개념으로 바뀌고 있지만, 기존의 자동차 보험은 1년 단위로 계약하기 때문에 자율 주행 차량의 이용률을 반영하지 않는다. 예를 들어, 자율 주행 차량 기술이 발전함에 따라 운전자가 자율 주행 차량을 직접 제어하는 시간이 감소되고 있지만 기존의 자동차 보험은 이러한 자 율 주행 차량의 이용률을 반영하지 않는다. 자율 주행 차량의 소유자는 직접 운전하는 시간이 적지만 1년 단위 로 보험료를 지불하여야 한다. 자율 주행 차량의 경우, 차량이 주변 위험 수준을 감지하는 능력과, 구비된 안전 장치 사양에 따라 사고 발생 유형이나 빈도에 큰 차이가 있으니 자동차 보험에 이를 반영할 필요가 있다. 본 발명은 전술한 필요성 및/또는 문제점을 해결하는 것을 목적으로 한다. 본 발명의 과제는 이상에서 언급한 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재로부 터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-7019216", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 발명의 적어도 일 실시 예에 따른 자율 주행 차량을 위한 보험 안내 시스템은 목적지와 차량의 안전 등급을 입력하는 사용자 단말기; 및 상기 목적지까지의 주행 경로 상에서 둘 이상 존재하 는 구간들의 구간별 보험 관련 정보를 상기 사용자 단말기로 전송하는 서버를 포함한다. 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 주행 경로 상에서 선택된 구간별 보험과 위험 구간을 표 시한다. 본 발명의 적어도 일 실시 예에 따른 보험 안내 방법은 사용자 단말기에 목적지와 차량의 안전 등급을 입력하는 단계; 서버가 상기 목적지까지의 주행 경로 상에서 둘 이상 존재하는 구간들의 구간별 보험 관련 정보를 상기 사용자 단말기로 전송하는 단계; 및 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 주행 경로 상에서 선 택된 구간별 보험과 위험 구간을 표시하는 단계를 포함한다."}
{"patent_id": "10-2019-7019216", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 사용자가 주행 경로 상의 위험 구간을 사전에 인지하도록 구간별 위험도를 제공함으로써 사고를 예방 할 수 있게 하고, 미연의 사고 발생시 적절한 보험료로 사용자의 피해를 보상 받을 수 있게 한다. 본 발명은 자율 주행 차량의 안전 장치 사양을 사용자에게 제공하고, 사용자가 안전 장치 사용을 고려하여 자율 주행 차량과, 안전 장치 사용에 따른 보험 상품 및 보험료를 선택하게 할 수 있다. 본 발명의 보험 안내 시스템 및 방법은 차량의 안전도 등급에 따라 보험료를 차등 적용하여 사용자가 자율 주행 차량의 안전도에 따라 보험료를 적정 비용으로 부담하고 사고 발생 가능성을 낮출 수 있다. 본 발명의 보험 안내 시스템 및 방법은 차량의 안전도 등급, 주행 경로의 구간별 위험도를 사용자에게 제공할 수 있다. 본 발명은 구간이 변경될 때마다 구간별 위험도를 실시간 업데이트하여 사용자에게 알려 줌으로써 사 고를 예방할 수 있게 하고, 사용자가 각 구간 마다 적절한 보험료를 선택하게 함으로써 불필요한 보험료 낭비를 줄일 수 있다."}
{"patent_id": "10-2019-7019216", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-7019216", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 도 1은 5G 통신 시스템에서 자율 주행 차량과 5G 네트워크의 기본동작의 일 예를 나타낸다. 자율 주행 차량(Autonomous Vehicle)은 특정 정보 전송을 5G 네트워크로 전송한다(S1). 상기 특정 정보는, 자율 주행 관련 정보를 포함할 수 있다. 상기 자율 주행 관련 정보는, 차량의 주행 제어와 직접적으로 관련된 정보일 수 있다. 예를 들어, 자율 주행 관련 정보는 차량 주변의 오브젝트를 지시하는 오브젝트 데이터, 맵 데이터(map data), 차량 상태 데이터, 차량 위치 데이터 및 드라이빙 플랜 데이터(driving plan data) 중 하나 이상을 포함할 수 있다. 상기 자율 주행 관련 정보는 자율 주행에 필요한 서비스 정보 등을 더 포함할 수 있다. 예를 들어, 상기 특정 정보는, 사용자 단말기를 통해 입력된 목적지와 차량의 안정 등급에 관한 정보를 포함할 수 있다.그리고, 상기 5G 네트워크는 차량의 원격 제어 여부를 결정할 수 있다 (S2). 여기서, 상기 5G 네트워크는 자율 주행 관련 원격 제어를 수행하는 서버 또는 모듈을 포함할 수 있다. 그리고, 상기 5G 네트워크는 원격 제어와 관련된 정보(또는 신호)를 상기 자율 주행 차량으로 전송할 수 있다 (S3). 전술한 바와 같이, 상기 원격 제어와 관련된 정보는 자율 주행 차량에 직접적으로 적용되는 신호일 수도 있고, 나아가 자율 주행에 필요한 서비스 정보를 더 포함할 수 있다. 본 발명의 일 실시예에서는 자율 주행 차량은, 상기 5G 네트워크에 연결된 서버를 통해 주행 경로 상에서 선택된 구간별 보험과 위험 구간 정보 등의 서비스 정보를 수신함으로써, 자율 주행과 관련된 서비스를 제공할 수 있다. 이하 도 2 내지 도 6에서는 본 발명의 일 실시에에 따라 자율 주행 과정에서 구간별 적용 가능한 보험 서비스를 제공하기 위하여, 자율 주행 차량과 5G 네트워크 간의 5G 통신을 위한 필수 과정(예를 들어, 차량과 5G 네트워 크 간의 초기 접속 절차 등)을 개략적으로 설명한다. 도 2는 5G 통신 시스템에서 자율 주행 차량과 5G 네트워크의 응용 동작의 일 예를 나타낸다. 자율 주행 차량은 5G 네트워크와 초기 접속(initial access) 절차를 수행한다(S20). 상기 초기 접속 절차는 하향 링크(Downlink, DL) 동작 획득을 위한 셀 서치(cell search), 시스템 정보(system information)를 획득하는 과정 등을 포함한다. 그리고, 상기 자율 주행 차량은 상기 5G 네트워크와 임의 접속(random access) 절차를 수행한다(S21). 상기 임의 접속 과정은 상향 링크(Uplink, UL) 동기 획득 또는 UL 데이터 전송을 위해 프리엠블 전송, 임의 접 속 응답 수신 과정 등을 포함한다. 그리고, 상기 5G 네트워크는 상기 자율 주행 차량으로 특정 정보의 전송을 스케쥴링하기 위한 UL grant를 전송 한다(S22). 상기 UL Grant 수신은 5G 네트워크로 UL 데이터의 전송을 위해 시간/주파수 자원 스케줄링을 받는 과정을 포함 한다. 그리고, 상기 자율 주행 차량은 상기 UL grant에 기초하여 상기 5G 네트워크로 특정 정보를 전송한다(S23). 그리고, 상기 5G 네트워크는 차량의 원격 제어 여부를 결정한다(S24). 그리고, 자율 주행 차량은 5G 네트워크로부터 특정 정보에 대한 응답을 수신하기 위해 물리 하향링크 제어 채널 을 통해 DL grant를 수신한다(S25). 그리고, 상기 5G 네트워크는 상기 DL grant에 기초하여 상기 자율 주행 차량으로 원격 제어와 관련된 정보(또는 신호)를 전송한다(S26). 한편, 도 3에서는 자율 주행 차량과 5G 통신의 초기 접속 과정 및 또는 임의 접속 과정 및 하향링크 그랜트 수 신 과정이 결합된 예를 S20 내지 S26의 과정을 통해 예시적으로 설명하였지만, 본 발명은 이에 한정되지 않는다. 예를 들어, S20, S22, S23, S24 과정을 통해 초기 접속 과정 및/또는 임의접속 과정을 수행할 수 있다. 또한, 예를 들어 S21, S22, S23, S24, S26 과정을 통해 초기접속 과정 및/또는 임의 접속 과정을 수행할 수 있다. 또 한 S23, S24, S25, S26을 통해 AI 동작과 하향링크 그랜트 수신과정이 결합되는 과정을 수행할 수 있다. 또한, 도 2에서는 자율 주행 차량 동작에 대하여 S20 내지 S26을 통해 예시적으로 설명한 것이며, 본 발명은 이 에 한정되지 않는다. 예를 들어, 상기 자율 주행 차량 동작은, S20, S21, S22, S25가 S23, S26과 선택적으로 결합되어 동작할 수 있 다, 또한 예를 들어, 상기 자율 주행 차량 동작은, S21, S22, S23, S26으로 구성될 수도 있다. 또한 예를 들어, 상기 자율 주행 차량 동작은, S20, S21, S23, S26으로 구성될 수 있다. 또한, 예를 들어, 상기 자율 주행 차량 동작은, S22, S23, S25, S26으로 구성될 수 있다. 도 3 내지 도 6은 5G 통신을 이용한 자율 주행 차량 동작의 일 예를 나타낸다. 먼저 도 3을 참고하면, 자율 주행 모듈을 포함하는 자율 주행 차량은 DL 동기 및 시스템 정보를 획득하기 위해 SSB(synchronization signal block)에 기초하여 5G 네트워크와 초기 접속 절차를 수행한다(S30). 그리고, 상기 자율 주행 차량은 UL 동기 획득 및/또는 UL 전송을 위해 5G 네트워크와 임의 접속 절차를 수행한 다(S31). 그리고, 상기 자율 주행 차량은 특정 정보를 전송하기 위해 5G 네트워크로 UL grant를 수신한다(S32). 그리고, 상기 자율 주행 차량은 상기 UL grant에 기초하여 특정 정보를 5G 네트워크로 전송한다(S33). 그리고, 상기 자율 주행 차량은 특정 정보에 대한 응답을 수신하기 위한 DL grant를 5G 네트워크로부터 수신한 다(S34). 그리고, 상기 자율 주행 차량은 원격 제어와 관련된 정보(또는 신호)를 DL grant에 기초하여 5G 네트워크로부터 수신한다(S35). S30에 빔 관리(beam management, BM) 과정이 추가될 수 있으며, S31에 PRACH(physical random access channel) 전송과 관련된 빔 실패 복구(beam failure recovery) 과정이 추가될 수 있으며, S32에 UL grant를 포함하는 PDCCH의 빔 수신 방향과 관련하여 QCL 관계 추가될 수 있으며, S33에 특정 정보를 포함하는 PUCCH (physical uplink control channel)/PUSCH (physical uplink shared channel)의 빔 전송 방향과 관련하여 QCL 관계 추가 가 추가될 수 있다. 또한, S34에 DL grant를 포함하는 PDCCH의 빔 수신 방향과 관련하여 QCL 관계 추가될 수 있 으다. 도 4를 참고하면, 자율 주행 차량은 DL 동기 및 시스템 정보를 획득하기 위해 SSB에 기초하여 5G 네트워크와 초 기 접속 절차를 수행한다(S40). 그리고, 상기 자율 주행 차량은 UL 동기 획득 및/또는 UL 전송을 위해 5G 네트워크와 임의 접속 절차를 수행한 다(S41). 그리고, 상기 자율 주행 차량은 설정된 그랜트(configured grant)에 기초하여 특정 정보를 5G 네트워크로 전송 한다(S42). 그리고, 상기 자율 주행 차량은 원격 제어와 관련된 정보(또는 신호를) 상기 설정된 그랜트에 기초하여 5G 네트 워크로부터 수신한다(S43). 도 5를 참고하면, 자율 주행 차량은 DL 동기 및 시스템 정보를 획득하기 위해 SSB에 기초하여 5G 네트워크와 초 기 접속 절차를 수행한다(S50). 그리고, 상기 자율 주행 차량은 UL 동기 획득 및/또는 UL 전송을 위해 5G 네트워크와 임의 접속 절차를 수행한 다(S51). 그리고, 상기 자율 주행 차량은 5G 네트워크로부터 DownlinkPreemption IE를 수신한다(S52). 그리고, 상기 자율 주행 차량은 상기 DownlinkPreemption IE에 기초하여 프리엠션 지시(preemption indication)를 포함하는 DCI 포맷 2_1을 5G 네트워크로부터 수신한다(S53). 그리고, 상기 자율 주행 차량은 pre-emption indication에 의해 지시된 자원(PRB 및/또는 OFDM 심볼)에서 eMBB data의 수신을 수행(또는 기대 또는 가정)하지 않는다(S54). 그리고, 상기 자율 주행 차량은 특정 정보를 전송하기 위해 5G 네트워크로 UL grant를 수신한다(S55). 그리고, 상기 자율 주행 차량은 상기 UL grant에 기초하여 특정 정보를 5G 네트워크로 전송한다(S56). 그리고, 상기 자율 주행 차량은 특정 정보에 대한 응답을 수신하기 위한 DL grant를 5G 네트워크로부터 수신한 다(S57). 그리고, 상기 자율 주행 차량은 원격제어와 관련된 정보(또는 신호)를 DL grant에 기초하여 5G 네트워크로부터 수신한다(S58). 도 6을 참고하면, 자율 주행 차량은 DL 동기 및 시스템 정보를 획득하기 위해 SSB에 기초하여 5G 네트워크와 초 기 접속 절차를 수행한다(S60). 그리고, 상기 자율 주행 차량은 UL 동기 획득 및/또는 UL 전송을 위해 5G 네트워크와 임의 접속 절차를 수행한 다(S61). 그리고, 상기 자율 주행 차량은 특정 정보를 전송하기 위해 5G 네트워크로 UL grant를 수신한다(S62). 상기 UL grant는 상기 특정 정보의 전송에 대한 반복 횟수에 대한 정보를 포함하고, 상기 특정 정보는 상기 반 복 횟수에 대한 정보에 기초하여 반복하여 전송된다(S63). 그리고, 상기 자율 주행 차량은 상기 UL grant에 기초하여 특정 정보를 5G 네트워크로 전송한다. 그리고, 특정 정보의 반복 전송은 주파수 호핑을 통해 수행되고, 첫 번째 특정 정보의 전송은 제 1 주파수 자원 에서, 두 번째 특정 정보의 전송은 제 2 주파수 자원에서 전송될 수 있다. 상기 특정 정보는 6RB(Resource Block) 또는 1RB(Resource Block)의 협대역(narrowband)을 통해 전송될 수 있 다. 그리고, 상기 자율 주행 차량은 특정 정보에 대한 응답을 수신하기 위한 DL grant를 5G 네트워크로부터 수신한 다(S64). 그리고, 상기 자율 주행 차량은 원격제어와 관련된 정보(또는 신호)를 DL grant에 기초하여 5G 네트워크로부터 수신한다(S65). 앞서 살핀 5G 통신 기술은 도 7 내지 도 21에서 후술할 본 명세서에서 제안하는 방법들과 결합되어 적용될 수 있으며, 또는 본 명세서에서 제안하는 방법들의 기술적 특징을 구체화하거나 명확하게 하는데 보충될 수 있다. 본 명세서에서 기술되는 차량은 통신망을 통해 외부 서버에 연결되고, 자율 주행 기술을 이용하여 운전자 개입 없이 미리 설정된 경로를 따라 이동 가능하다. 본 발명의 차량은 동력원으로서 엔진을 구비하는 내연기관 차량, 동력원으로서 엔진과 전기 모터를 구비하는 하이브리드 차량, 동력원으로서 전기 모터를 구비하는 전기 차량 등으로 구현될 수 있다. 이하의 실시 예에서, 사용자는 운전자, 탑승자 또는 사용자 단말기의 소유자로 해석될 수 있다. 사용자 단말기 는 사용자가 휴대 가능하고 전화 통화와 다양한 어플리케이션(application)을 실행할 수 있는 이동 단말기 예를 들어, 스마트 폰일 수 있으나 이에 한정되지 않는다. 예를 들어, 사용자 단말기는 이동 단말기, PC(Personal computer), 노트북 컴퓨터 또는 도 13과 같은 자율 주행 차량 시스템으로 해석될 수 있다. 자율주행 차량에서는 주변 위험 요소들을 실시간 센싱하는 능력에 따라 사고 발생 유형 및 빈도가 크게 달라질 수 있다. 목적지까지의 경로는 날씨, 지형 특성, 교통 혼잡도 등 다양한 원인에 의해 위험 수준이 서로 다른 구간들을 포함할 수 있다. 본 발명은 사용자의 목적지 입력시 구간별로 필요한 보험을 안내하고 실시간으로 위 험구간 모니터링을 통해 보험 안내를 업데이트 한다. 본 발명의 자율 주행 차량, 사용자 단말기 및 서버 중 하나 이상이 인공 지능(Artificial Inteligence) 모듈, 드론(Unmanned Aerial Vehicle, UAV), 로봇, 증강 현실(Augmented Reality, AR) 장치, 가상 현실(virtual reality, VR), 5G 서비스와 관련된 장치 등과 연계 혹은 융복합될 수 있다. 예를 들어, 자율 주행 차량은 차량에 포함된 적어도 하나의 인공지능(artificial intelligence, AI), 로봇과 연 계되어 동작할 수 있다. 예를 들어, 차량은, 적어도 하나의 로봇(robot)과 상호 작용할 수 있다. 로봇은, 자력으로 주행이 가능한 이동 로봇(Autonomous Mobile Robot, AMR)일 수 있다. 이동 로봇은, 스스로 이동이 가능하여 이동이 자유롭고, 주행 중 장애물 등을 피하기 위한 다수의 센서가 구비되어 장애물을 피해 주행할 수 있다. 이동 로봇은, 비행 장치를 구비하는 비행형 로봇(예를 들면, 드론)일 수 있다. 이동 로봇은, 적어도 하나의 바퀴를 구비하고, 바퀴의 회전 을 통해 이동되는 바퀴형 로봇일 수 있다. 이동 로봇은, 적어도 하나의 다리를 구비하고, 다리를 이용해 이동되 는 다리식 로봇일 수 있다. 로봇은 차량 사용자의 편의를 보완하는 장치로 기능할 수 있다. 예를 들면, 로봇은, 차량에 적재된 짐을 사용자 의 최종 목적지까지 이동하는 기능을 수행할 수 있다. 예를 들면, 로봇은, 차량에서 하차한 사용자에게 최종 목 적지까지 길을 안내하는 기능을 수행할 수 있다. 예를 들면, 로봇은, 차량에서 하차한 사용자를 최종 목적지까 지 수송하는 기능을 수행할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 통신 장치를 통해, 로봇과 통신을 수행할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 로봇에 차량에 포함되는 적어도 하나의 전자 장치에서 처리한 데 이터를 제공할 수 있다. 예를 들면, 차량에 포함되는 적어도 하나의 전자 장치는, 차량 주변의 오브젝트를 지시 하는 오브젝트 데이터, 맵 데이터(map data), 차량 상태 데이터, 차량 위치 데이터 및 드라이빙 플랜 데이터 (driving plan data) 중 적어도 어느 하나를 로봇에 제공할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 로봇으로부터, 로봇에서 처리된 데이터를 수신할 수 있다. 차량 에 포함되는 적어도 하나의 전자 장치는, 로봇에서 생성된 센싱 데이터, 오브젝트 데이터, 로봇 상태 데이터, 로봇 위치 데이터 및 로봇의 이동 플랜 데이터 중 적어도 어느 하나를 수신할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 로봇으로부터 수신된 데이터에 더 기초하여, 제어 신호를 생성할 수 있다. 예를 들면, 차량에 포함되는 적어도 하나의 전자 장치는, 오브젝트 검출 장치에 생성된 오브젝트에 대한 정보와 로봇에 의해 생성된 오브젝트에 대한 정보를 비교하고, 비교 결과에 기초하여, 제어 신호를 생성할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 차량의 이동 경로와 로봇의 이동 경로간의 간섭이 발생 되지 않도록, 제어 신호를 생성할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 인공 지능(artificial intelligence, AI)를 구현하는 소프트웨어 모듈 또는 하드웨어 모듈(이하, 인공 지능 모듈)을 포함할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치 는, 획득되는 데이터를 인공 지능 모듈에 입력(input)하고, 인공 지능 모듈에서 출력(output)되는 데이터를 이 용할 수 있다. 인공 지능 모듈은, 적어도 하나의 인공 신경망(artificial neural network, ANN)을 이용하여, 입력되는 데이터 에 대한 기계 학습(machine learning)을 수행할 수 있다. 인공 지능 모듈은, 입력되는 데이터에 대한 기계 학습 을 통해, 드라이빙 플랜 데이터를 출력할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 인공 지능 모듈에서 출력되는 데이터에 기초하여, 제어 신호를 생 성할 수 있다. 실시예에 따라, 차량에 포함되는 적어도 하나의 전자 장치는, 통신 장치를 통해, 외부 장치로부터, 인공 지능에 의해 처리된 데이터를 수신할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 인공 지능에 의해 처리된 데이터에 기초하여, 제어 신호를 생성할 수 있다. 이하, 첨부된 도면을 참조하여 본 명세서의 다양한 실시 예들을 상세히 설명한다. 도 7 내지 도 13을 참조하면, 전장(overall length)은 차량의 앞부분에서 뒷부분까지의 길이, 전폭(widt h)은 차량의 너비, 전고(height)는 바퀴 하부에서 루프까지의 길이를 의미한다. 도 7에서, 전장 방향(L) 은 차량의 전장 측정의 기준이 되는 방향, 전폭 방향(W)은 차량의 전폭 측정의 기준이 되는 방향, 전 고 방향(H)은 차량의 전고 측정의 기준이 되는 방향을 의미할 수 있다. 도 7 내지 도 12에서 차량이 세단 형태로 예시되었으나 이에 한정되지 않는다. 차량은 외부 디바이스에 의하여 원격 제어될 수 있다. 외부 디바이스는 서버로 해석될 수 있다. 서버는 차량이 원격 제어가 필요하다고 판단되는 경우, 차량에 대한 원격 제어를 수행할 수 있다. 차량의 운행 모드는 차량을 제어하는 주체에 따라 매뉴얼 모드(Manual mode), 자율 주행 모드, 또는 원격 제어 모드로 나뉠 수 있다. 매뉴얼 모드에서 운전자는 차량을 직접 제어하여 차량 주행을 제어할 수 있다. 자율 주행 모드에서 제어부나 운행 시스템은 운전자 개입 없이 차량의 주행을 제어할 수 있다. 원격 제어 모드에서 운전자 개입 없이 외부 디바이스가 차량의 주행을 제어할 수 있다. 사용자는 사용자 인터페이스 장치를 통해 자율 주행 모드, 매뉴얼 모드, 및 원격 제어 모드 중 하나를 선 택할 수 있다. 차량은 운전자 상태 정보, 차량 주행 정보, 및 차량 상태 정보 중 적어도 하나에 기초하여, 자율 주행 모 드, 매뉴얼 모드, 및 원격 제어 모드 중 하나로 자동 전환될 수 있다. 운전자 상태 정보는 사용자 인터페이스 장치를 통하여 생성되어 제어부에 제공될 수 있다. 운전자 상태 정보는 내부 카메라나 생체 감지부를 통하여 감지되는 운전자에 대한 영상이나 생체 정보에 기 초하여 생성될 수 있다. 예를 들어, 운전자 상태 정보는 내부 카메라를 통하여 획득된 이미지로부터 얻어 진 운전자의 시선, 얼굴 표정, 행동, 운전자 위치 정보 등을 포함할 수 있다. 운전자 상태 정보는 생체 감지부 를 통하여 획득되는 사용자의 생체 정보를 포함할 수 있다. 운전자 상태 정보는 운전자의 시선이 향하는 방향, 운전자의 졸음 여부, 운전자의 건강 상태, 및 운전자의 감정 상태 등을 나타낼 수 있다. 차량 주행 정보는 차량의 위치 정보, 차량의 자세 정보, 타차량(OB11)으로부터 수신하는 타차량 (OB11)에 대한 정보, 차량의 주행 경로에 대한 정보나 지도 정보(map)를 포함하는 내비게이션 정보 등을 포함할 수 있다.차량 주행 정보는 목적지까지의 경로 상에서 차량의 현재 위치, 차량의 주변에 존재하는 객체의 종류, 위 치, 및 움직임, 차량의 주변에서 감지되는 차선 유무 등을 포함할 수 있다. 또한, 차량 주행 정보는 타차 량의 주행 정보, 차량의 주변에 정차 가능 공간, 차량과 객체가 충돌할 가능성, 차량의 주변에 서 감지되는 보행자나 자전거 정보, 도로 정보, 차량 주변의 신호 상태, 차량의 움직임 등을 나타낼 수 있다. 차량 주행 정보는 오브젝트 검출 장치, 통신 장치, 내비게이션 시스템, 센싱부, 및 인터페 이스부 중 적어도 하나 이상과의 연계를 통해 생성되어, 제어부에 제공될 수 있다. 차량 상태 정보는 차량에 구비된 여러 장치들의 상태에 관련된 정보일 수 있다. 예를 들어, 차량 상태 정 보는 배터리의 충전 상태, 사용자 인터페이스 장치, 오브젝트 검출 장치, 통신 장치, 운전 조작 장치, 차량 구동 장치, 운행 시스템의 동작 상태에 대한 정보와 각 장치의 이상 여부에 대한 정 보를 포함할 수 있다. 차량 상태 정보는 차량의 GPS(Global Positioning System) 신호가 정상적으로 수신되는지, 차량에 구비된 적어도 하나의 센서에 이상이 발생하는지, 차량에 구비된 각 장치들이 정상적으로 동작하는지를 나 타낼 수 있다. 오브젝트 검출 장치에서 생성되는 객체 정보에 기초하여, 차량의 제어 모드가 매뉴얼 모드로부터 자 율 주행 모드 또는 원격 제어 모드로 전환되거나, 자율 주행 모드에서 매뉴얼 모드 또는 원격 제어 모드로 또는, 원격 제어 모드로부터 매뉴얼 모드 또는 자율 주행 모드로 전환될 수 있다. 통신 장치를 통해 수신되는 정보에 기초하여 차량의 제어 모드가 매뉴얼 모드에서 자율 주행 모드로 전환되거나, 자율 주행 모드에서 매뉴얼 모드로 전환될 수 있다. 외부 디바이스에서 제공되는 정보, 데이터, 신호에 기초하여 차량의 제어 모드가 매뉴얼 모드에서 자율 주 행 모드로 전환되거나, 자율 주행 모드에서 매뉴얼 모드로 전환될 수 있다. 차량이 자율 주행 모드로 운행되는 경우, 차량은 운행 시스템의 제어 하에 주행될 수 있다. 자 율 주행 모드에서 차량은 주행 시스템, 출차 시스템, 주차 시스템에서 생성되는 정보에 기 초하여 운행될 수 있다. 차량이 매뉴얼 모드로 운행되는 경우, 차량은 운전 조작 장치를 통하여 입력되는 사용자 입력에 따라 주행될 수 있다. 차량이 원격 제어 모드로 운행되는 경우, 차량은 통신 장치를 통하여 외부 디바이스가 송신하는 원격 제어 신호를 수신할 수 있다. 차량은 원격 제어 신호에 응답하여 제어될 수 있다. 도 13을 참조하면, 차량은 사용자 인터페이스 장치, 오브젝트 검출 장치, 통신 장치, 운전 조작 장치, 차량 구동 장치, 운행 시스템, 내비게이션 시스템, 센싱부, 인터페이스부 , 메모리, 제어부 및 전원 공급부를 포함할 수 있다. 도 13에 도시된 구성 요소 외에 다른 구성 요소를 더 포함하거나, 일부 구성 요소가 생략될 수 있다. 사용자 인터페이스 장치는 차량과 사용자와의 소통을 위한 장치이다. 사용자 인터페이스 장치 는 사용자 입력을 수신하고, 사용자에게 차량에서 생성된 정보를 제공할 수 있다. 차량은 사용자 인 터페이스 장치를 통해 UI(User Interfaces) 또는 UX(User Experience)를 구현할 수 있다. 사용자 인터페이스 장치는 입력부, 탑승자 감지부, 출력부 및 프로세서를 포함할 수 있다. 입력부는 사용자 데이터 또는 명령을 입력 받는다. 입력부에서 수집한 데이터는 프로세서에 의 해 분석되어, 사용자의 제어 명령으로 처리될 수 있다. 입력부는 차량 내부에 배치될 수 있다. 입력부는 스티어링 휠(steering wheel)의 일 영역, 인스투루 먼트 패널(instrument panel)의 일 영역, 시트(seat)의 일 영역, 각 필러(pillar)의 일 영역, 도어(door)의 일 영역, 센타 콘솔(center console)의 일 영역, 헤드 라이닝(head lining)의 일 영역, 썬바이저(sun visor)의 일 영역, 윈드 쉴드(windshield)의 일 영역 또는 윈도우(window)의 일 영역 등에 배치될 수 있다. 입력부는 음성 입력부, 제스쳐 입력부, 터치 입력부 및 기계식 입력부를 포함할 수 있다. 음성 입력부는 사용자의 음성 입력을 전기적 신호로 전환할 수 있다. 전환된 전기적 신호는, 프로세서 또는 제어부에 제공될 수 있다. 음성 입력부는 하나 이상의 마이크로 폰을 포함할 수 있다. 제스쳐 입력부는 사용자의 제스쳐 입력을 전기적 신호로 전환하여 프로세서 또는 제어부에 제공 할 수 있다. 제스쳐 입력부는 사용자의 제스쳐 입력을 감지하기 위한 적외선 센서 및 이미지 센서 중 적 어도 어느 하나를 포함할 수 있다. 제스쳐 입력부는, 사용자의 3차원 제스쳐 입력을 감지할 수 있다. 이를 위해, 제스쳐 입력부는, 복 수의 적외선 광을 출력하는 광출력부 또는 복수의 이미지 센서를 포함할 수 있다. 제스쳐 입력부는, TOF(Time of Flight) 방식, 구조광(Structured light) 방식 또는 디스패러티 (Disparity) 방식을 통해 사용자의 3차원 제스쳐 입력을 감지할 수 있다. 터치 입력부는 사용자의 터치 입력을 전기적 신호로 전환하여 프로세서 또는 제어부에 제공할 수 있다. 터치 입력부는 사용자의 터치 입력을 감지하기 위한 터치 센서를 포함할 수 있다. 터치 입력부 는 디스플레이부와 일체형으로 형성되어 터치 스크린을 구현할 수 있다. 터치 스크린은 차량과 사용자 사이의 입력 인터페이스 및 출력 인터페이스를 함께 제공할 수 있다. 기계식 입력부는 버튼, 돔 스위치(dome switch), 조그 휠 및 조그 스위치 중 적어도 어느 하나를 포함할 수 있다. 기계식 입력부의 출력 신호는 프로세서 또는 제어부에 제공될 수 있다. 기계식 입력 부는 스티어링 휠(steering wheel), 센터 페시아(center fascia), 센터 콘솔(center console), 칵핏 모듈 (Cockpit module), 도어(door) 등에 배치될 수 있다. 탑승자 감지부는 차량 내부의 탑승자 또는 사물을 감지할 수 있다. 탑승자 감지부는 내부 카메 라 및 생체 감지부를 포함할 수 있다. 내부 카메라는 차량 내부 공간을 촬영한다. 프로세서는 내부 카메라로부터 수신된 차량 내부 영상을 기초로 사용자 상태를 감지할 수 있다. 프로세서는 차량 내부 영상을 분석하여 운전자의 시선, 얼굴, 행동, 표정, 및 위치 등의 운전자 상태를 판 단하여 운전자 상태 정보를 발생할 수 있다. 프로세서는 차량 내부 영상에서 사용자의 제스쳐(gesture)를 판단할 수 있다. 프로세서는 운전자 상태 정보를 제어부에 제공할 수 있다. 생체 감지부는 사용자의 생체 정보를 획득할 수 있다. 생체 감지부는 사용자의 생체 정보를 획득할 수 있는 센서를 이용하여 사용자의 지문 정보, 심박동 정보, 및 뇌파 정보 등을 획득할 수 있다. 생체 정보는 사용자 인증이나 사용자의 상태 판단을 위해 이용될 수 있다. 프로세서는 운전자의 생체 정보를 바탕으로 운전자의 상태를 판단하여 운전자 상태 정보를 발생할 수 있다. 운전자 상태 정보는 운전자가 수면 중인지, 졸고 있는지, 흥분하는지, 위급한 상태인지 등을 나타낼 수 있다. 프로세서는 운전자의 생체 정보로부터 획득한 운전자 상태 정보를 제어부에 제공할 수 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생한다. 출력부는 디스플레이부, 음향 출 력부, 햅틱 출력부 등을 포함할 수 있다. 디스플레이부는 다양한 정보를 포함한 영상 신호를 표시한다. 디스플레이부는 액정 디스플레이 (liquid crystal display, LCD), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display, TFT LCD), 유기 발광 다이오드(organic light-emitting diode, OLED), 플렉서블 디스플레이(flexible display), 3차원 디스플레이(3D display), 전자잉크 디스플레이(e-ink display) 중에서 적어도 하나를 포함할 수 있다. 디스플레이부는 터치 입력부와 결합되어 터치 스크린을 구현할 수 있다. 디스플레이부는 HUD(Head Up Display)로 구현될 수 있다. HUD는 투사 모듈을 구비하여 윈드 쉴드 또는 윈도우에 투사되는 이미 지를 통해 정보를 표시할 수 있다. 디스플레이부는 투명 디스플레이를 포함할 수 있다. 투명 디스플레이는 윈드 쉴드 또는 윈도우에 부착될 수 있다. 투명 디스플레이는 소정의 투명도를 가지면서, 소정의 화면을 표시할 수 있다. 투명 디스플레이는, 투명도를 가지기 위해, 투명 디스플레이는 투명 TFEL(Thin Film Elecroluminescent), 투명 OLED(OrganicLight-Emitting Diode), 투명 LCD(Liquid Crystal Display), 투과형 투명디스플레이, 투명 LED(Light Emitting Diode) 디스플레이 중 적어도 하나를 포함할 수 있다. 투명 디스플레이의 투명도는 조절될 수 있다. 디스플레이부는 도 9 및 도 10에 도시된 바와 같이 복수의 디스플레이(251a 내지 251g)를 포함할 수 있다. 디스플레이는 스티어링 휠의 일 영역, 인스투루먼트 패널(instrument panel)의 일 영역(251a, 251b, 251e), 시트의 일 영역(251d), 각 필러의 일 영역(251f), 도어의 일 영역(251g), 센타 콘솔의 일 영역, 헤드 라 이닝의 일 영역, 썬바이저의 일 영역에 배치되거나, 윈드 쉴드의 일영역(251c), 윈도우의 일영역(251h)에 구현 될 수 있다. 윈도우에 배치된 디스플레이(251h)는 차량의 전방 윈도우, 후방 윈도우, 측면 윈도우 각각에 배치될 수 있다. 음향 출력부는 프로세서 또는 제어부로부터 제공되는 전기 신호를 오디오 신호로 변환하여 출력 한다. 음향 출력부는 하나 이상의 스피커를 포함할 수 있다. 햅틱 출력부는 촉각 신호를 출력한다. 햅틱 출력부는 촉각 신호에 따라 스티어링 휠, 안전 벨트, 시 트(110FL, 110FR, 110RL, 110RR)를 진동시킨다. 프로세서는 사용자 인터페이스 장치의 구성 요소들 각각의 전반적인 동작을 제어할 수 있다. 사용자 인터페이스 장치에 프로세서가 포함되지 않는 경우, 사용자 인터페이스 장치는 다른 장치의 프 로세서 또는 제어부의 제어 하에 동작될 수 있다. 오브젝트 검출 장치는 차량 외부에 위치하는 객체(object)를 검출한다. 객체는 차량의 운행과 관련된 다양한 물체들일 수 있다. 예를 들어, 객체는 도 11 및 도 12에 도시된 바와 같이 차로(Lane, OB10), 타 차량(OB11), 보행자(OB12), 이륜차(OB13), 교통 신호(OB14, OB15), 빛, 도로, 고정 구조물, 과속 방지턱, 지형 지물, 동물 등을 포함할 수 있다. 차로(OB10)는 주행 차로, 주행 차로의 옆 차로, 반대 방향으로 주행하는 차량의 차로일 수 있다. 차로(OB10)는 차로(Lane)을 형성하는 좌우측 차선(Line)을 포함하는 개념일 수 있다. 타 차량(OB11)은 차량의 주변에서 주행 중인 차량일 수 있다. 타 차량(OB11)은 차량으로부터 소정 거리 이내에 위치하는 차량일 수 있다. 타 차량(OB11)은 차량보다 선행하는 차량이거나, 후행하는 차량일 수 있다. 보행자(OB12)는 차량의 주변에 위치한 사람일 수 있다. 보행자(OB12)는 차량으로부터 소정 거리 이 내에 위치하는 사람일 수 있다. 예를 들면, 보행자(OB12)는 인도 또는 차도상에 위치하는 사람일 수 있다. 이륜차(OB12)는 차량의 주변에 위치하고 2 개의 바퀴를 이용해 움직이는 탈것을 의미할 수 있다. 이륜차 (OB13)는 차량 주변의 인도 또는 차도 상에 위치하는 오토바이 또는 자전거일 수 있다. 교통 신호는 교통 신호등(OB15), 교통 표지판(OB14), 도로면에 그려진 문양 또는 텍스트를 포함할 수 있다. 빛은 타 차량(OB11)에 구비된 램프에서 생성된 빛일 수 있다. 빛은 가로등에서 생성된 조명 빛 또는 태양광일 수 있다. 도로는 도로면, 커브, 오르막, 내리막 등의 경사 등을 포함할 수 있다. 고정 구조물은, 도로 주변에 위치하고, 지면에 고정된 물체일 수 있다. 예를 들면, 구조물은, 가로등, 가로수, 건물, 전봇대, 신호등, 다리, 지형 지물 등를 포함할 수 있다. 지형 지물은 산, 언덕, 터널, 강, 바다 등을 포함할 수 있다. 객체는 이동 객체와 고정 객체로 나뉘어질 수 있다. 이동 객체는 타 차량(OB11), 이륜차(OB13), 보행자(OB12) 등일 수 있다. 고정 객체는 교통 신호, 도로, 고정 구조물일 수 있다. 오브젝트 검출 장치는 카메라, 레이다, 라이다, 초음파 센서, 적외선 센서 및 프로세서를 포함할 수 있다. 카메라는 차량의 외부 환경을 촬영하여 차량의 외부 환경을 보여 주는 영상 신호를 출력한다. 카메라는 차량 외부의 적절한 위치에 하나 이상 배치될 수 있다. 카메라는 모노 카메라, 스테 레오 카메라(310a), AVM(Around View Monitoring) 카메라(310b) 또는 360도 카메라일 수 있다. 카메라는 차량 전방의 영상을 획득하기 위해 차량의 실내에서, 프런트 윈드 쉴드에 근접하게 배치될 수 있 다. 카메라는 프런트 범퍼 또는 라디에이터 그릴 주변에 배치될 수 있다. 카메라는 차량 후방의 영 상을 획득하기 위해, 차량의 실내에서, 리어 글라스에 근접하게 배치될 수 있다. 카메라는 리어 범퍼, 트렁크 또는 테일 게이트 주변에 배치될 수 있다. 카메라는 차량 측방의 영상을 획득하기 위해 차량(10 0)의 실내에서 사이드 윈도우 중 적어도 어느 하나에 근접하게 배치될 수 있다. 카메라는 사이드 미러, 휀더(fender) 또는 도어 주변에 배치될 수 있다. 카메라로부터 출력된 영상 신호는 프로세서에 제공 된다. 레이다는 전자파 송신부, 수신부를 포함할 수 있다. 레이다는 펄스 레이다(Pulse Radar) 방식 또는 연속파 레이다(Continuous Wave Radar) 방식으로 구현될 수 있다. 레이다는 연속파 레이다 방식 중에서 신호 파형에 따라 FMCW(Frequency Modulated Continuous Wave)방식 또는 FSK(Frequency Shift Keying) 방식으 로 구현될 수 있다. 레이다는 전자파를 매개로, TOF(Time of Flight) 방식 또는 페이즈 시프트(phase-shift) 방식에 기초하여, 객체를 검출하고, 검출된 객체의 위치, 검출된 객체와의 거리 및 상대 속도를 검출할 수 있다. 레이 다는 차량의 전방, 후방 또는 측방에 위치하는 주변 객체를 감지하기 위해 차량에서 적절한 위 치에 배치될 수 있다. 라이다는 레이저 송신부, 수신부를 포함할 수 있다. 라이다는 TOF(Time of Flight) 방식 또는 페이즈 시프트(phase-shift) 방식으로 구현될 수 있다. 라이다는 구동식 또는 비구동식으로 구현될 수 있다. 구 동식으로 구현되는 경우, 라이다는 모터에 의해 회전되며, 주변 객체를 검출할 수 있다. 비구동식으로 구 현되는 경우, 라이다는 광 스티어링에 의해 차량을 기준으로 소정 범위 내에 위치하는 주변 객체를 검출할 수 있다. 차량은 복수의 비구동식 라이다를 포함할 수 있다. 라이다는 레이저 광 매개로, TOF(Time of Flight) 방식 또는 페이즈 시프트(phase-shift) 방식에 기초하 여, 주변 객체를 검출하고, 검출된 주변 객체의 위치, 검출된 객체와의 거리 및 상대 속도를 검출할 수 있다. 라이다는 차량의 전방, 후방 또는 측방에 위치하는 주변 객체를 감지하기 위해 차량에서 적절한 위치 에 배치될 수 있다. 초음파 센서는 초음파 송신부, 수신부를 포함할 수 있다. 초음파 센서는 객체로부터 반사되어 수시된 초음파로 주변 객체를 검출하고, 검출된 객체의 위치, 검출된 객체와의 거리 및 상대 속도를 검출할 수 있다. 초음파 센서는 차량의 전방, 후방 또는 측방에 위치하는 주변 객체를 감지하기 위해 차량에서 적절한 위치에 배치될 수 있다. 적외선 센서는 적외선 송신부, 수신부를 포함할 수 있다. 적외선 센서는 객체로부터 반사되어 수시 된 적외선을 기초로 주변 객체를 검출하고, 검출된 객체의 위치, 검출된 객체와의 거리 및 상대 속도를 검출할 수 있다. 적외선 센서는 차량의 전방, 후방 또는 측방에 위치하는 주변 객체를 감지하기 위해 차량 에서 적절한 위치에 배치될 수 있다. 프로세서는 오브젝트 검출 장치의 구성 요소 각각의 전반적인 동작을 제어할 수 있다. 프로세서 는 획득된 영상에 기초하여 주변 객체를 검출하고, 트래킹(tracking)할 수 있다. 프로세서는 영상 처리 알고리즘을 이용하여 객체와의 거리 산출, 객체와의 상대 속도 산출, 객체의 종류, 위치, 크기, 형상, 색 상, 이동 경로 판단, 감지되는 문자의 내용 판단 등의 동작을 수행할 수 있다. 프로세서는, 송신된 전자파가 객체에 반사되어 되돌아오는 반사 전자파에 기초하여, 주변 객체를 검출하고, 트래킹할 수 있다. 프로세서는 전자파에 기초하여, 객체와의 거리 산출, 객체와의 상대 속도 산출 등의 동작을 수행할 수 있다. 프로세서는 송신된 레이저 광이 객체에 반사되어 되돌아오는 반사 레이저 광에 기초하여, 주변 객체를 검 출하고, 트래킹할 수 있다. 프로세서는 레이저 광에 기초하여 객체와의 거리 산출, 객체와의 상대 속도 산 출 등의 동작을 수행할 수 있다. 프로세서는 송신된 초음파가 객체에 반사되어 되돌아오는 반사 초음파에 기초하여, 주변 객체를 검출하고, 트래킹할 수 있다. 프로세서는 초음파에 기초하여, 객체와의 거리 산출, 객체와의 상대 속도 산출 등의 동작을 수행할 수 있다. 프로세서는 송신된 적외선 광이 객체에 반사되어 되돌아오는 반사 적외선 광에 기초하여, 주변 객체를 검 출하고, 트래킹할 수 있다. 프로세서는 적외선 광에 기초하여 객체와의 거리 산출, 객체와의 상대 속도산출 등의 동작을 수행할 수 있다. 프로세서는 카메라를 통하여 획득된 영상, 레이다를 통하여 수신된 반사 전자파, 라이다를 통하여 수신된 반사 레이저 광, 초음파 센서를 통하여 수신된 반사 초음파, 및 적외선 센서를 통하여 수신된 반사 적외선 광 중 적어도 하나에 기초하여, 주변 객체를 판단하여 객체 정보를 발생할 수 있다. 프로세 서는 객체 정보를 제어부에 제공할 수 있다. 객체 정보는 차량의 주변에 존재하는 객체의 종류, 위치, 크기, 형상, 색상, 이동 경로, 속도, 감지되는 문자를 나타낸다. 객체 정보는 차량 주변에 차선이 존재하는지, 차량은 정차 중인데 차량 주변 의 타 차량이 주행하는지, 차량 주변에 정차할 수 있는 구역이 있는지, 차량과 오브젝트가 충돌할 가능성, 차량 주변에 보행자나 자전거가 어떻게 분포되어 있는지, 차량이 주행하는 도로의 종류, 차량 주변 신호등의 상태, 차량의 움직임 등을 나타낼 수 있다. 오브젝트 검출 장치는 복수의 프로세서를 포함하거나, 프로세서를 포함하지 않을 수도 있다. 카메라, 레이다, 라이다, 초음파 센서 및 적외선 센서 각각은 개별적으로 프로세서를 포함할 수 있다. 오브젝트 검출 장치는 차량내 장치의 프로세서 또는 제어부의 제어에 따라, 동작될 수 있다. 통신 장치는 통신 링크를 통해 외부 디바이스에 연결되어 외부 디바이스와 양방향 통신을 수행한다. 외부 디바이스는 도 70에서 사용자 단말기와 서버일 수 있다. 통신 장치는 통신을 수행하기 위해 송신 안테나, 수신 안테나, 각종 통신 프로토콜이 구현 가능한 RF(Radio Frequency) 회로 및 RF 소자 중 적어도 어느 하나를 포함할 수 있다. 통신 장치는 근거리 통신부, 위치 정보부, V2X 통신부, 광통신부, 방송 송수신부 및 프로세서를 포함할 수 있다. 근거리 통신부는 근거리 통신(Short range communication)을 위한 유닛이다. 근거리 통신부는, 블루 투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근거리 통신을 지원할 수 있 다. 근거리 통신부는 근거리 무선 통신망(Wireless Area Networks)을 형성하여, 차량과 적어도 하나의 외 부 디바이스 사이의 근거리 통신을 수행할 수 있다. 위치 정보부는, 차량의 위치 정보를 획득한다. 위치 정보부는 GPS(Global Positioning System) 모듈 또는 DGPS(Differential Global Positioning System) 모듈을 포함할 수 있다. V2X 통신부는 서버(V2I : Vehicle to Infra), 타 차량과의 통신(V2V : Vehicle to Vehicle) 또는 보행자 와의 통신(V2P : Vehicle to Pedestrian)을 수행한다. V2X 통신부는 인프라와의 통신(V2I), 차량간 통신 (V2V), 보행자와의 통신(V2P) 프로토콜이 구현 가능한 회로를 포함할 수 있다. 광통신부는 광을 매개로 외부 디바이스와 통신을 수행한다. 광통신부는 전기 신호를 광 신호로 전환 하여 외부에 발신하는 광발신부 및 수신된 광 신호를 전기 신호로 전환하는 광수신부를 포함할 수 있다. 광발 신부는 차량에 포함된 램프와 일체화될 수 있다. 방송 송수신부는 방송 채널을 통해 외부의 방송 관리 서버로부터 방송 신호를 수신하거나, 방송 관리 서버 에 방송 신호를 송출한다. 방송 채널은 위성 채널, 지상파 채널을 포함할 수 있다. 방송 신호는 TV 방송 신호, 라디오 방송 신호, 데이터 방송 신호를 포함할 수 있다. 프로세서는 통신 장치의 각 구성 요소들의 전반적인 동작을 제어할 수 있다. 프로세서는 근거 리 통신부, 위치 정보부, V2X 통신부, 광통신부, 및 방송 송수신부 중 적어도 하나를 통하여 수신되는 정보에 기초하여, 차량 주행 정보를 생성할 수 있다. 프로세서는 타차량으로부터 수신되 는 타 차량의 위치, 차종, 주행 경로, 속도, 각종 센싱 값 등에 대한 정보에 기초하여, 차량 주행 정보를 생성 할 수 있다. 타 차량의 각종 센싱 값에 대한 정보가 수신되는 경우, 차량에 별도의 센서가 없더라도, 프로 세서는 차량의 주변 객체에 대한 정보를 얻을 수 있다.통신 장치에 프로세서가 포함되지 않는 경우, 통신 장치는 차량내 다른 장치의 프로세서 또는 제어부의 제어에 따라 동작될 수 있다. 통신 장치는 사용자 인터페이스 장치와 함께 차량용 디스플레이 장치를 구현할 수 있다. 이 경우, 차 량용 디스플레이 장치는 텔레 매틱스(telematics) 장치 또는 AVN(Audio Video Navigation) 장치로 명명될 수 있다. 제어부는 통신 장치로부터 수신된 신호를 바탕으로 운전자 상태 정보, 차량 상태 정보, 차량 주행 정 보, 차량의 에러를 나타내는 에러 정보, 객체 정보, 사용자 인터페이스 장치를 통하여 수신되는 사용 자 입력, 및 원격 제어 요청 신호 중 적어도 하나를 외부 디바이스로 전송할 수 있다. 원격 제어용 서버는 차 량이 송신하는 정보에 기초하여 차량이 원격 제어가 필요한지 판단할 수 있다. 제어부는 통신 장치를 통하여, 원격 제어용 서버로부터 수시된 제어 신호에 따라 차량을 제어할 수 있다. 운전 조작 장치는 운전을 위한 사용자 입력을 수신한다. 매뉴얼 모드에서, 차량은 운전 조작 장치 에 의해 제공되는 사용자 입력 신호에 기초하여 운행될 수 있다. 운전 조작 장치는 조향 입력 장치, 가속 입력 장치 및 브레이크 입력 장치를 포함할 수 있 다. 조향 입력 장치는 사용자로부터 차량의 진행 방향 입력을 수신할 수 있다. 조향 입력 장치는, 회전에 의해 조향 입력이 가능하도록 휠 형태로 형성되는 것이 바람직하다. 실시 예에 따라, 조향 입력 장치는, 터치 스크린, 터치 패드 또는 버튼 형태로 형성될 수도 있다. 가속 입력 장치는 사용자로부터 차량의 가속을 위한 입력을 수신할 수 있다. 브레이크 입력 장치 는 사용자로부터 차량의 감속을 위한 입력을 수신할 수 있다. 가속 입력 장치 및 브레이크 입 력 장치는 페달 형태로 구현될 수 있다. 가속 입력 장치 또는 브레이크 입력 장치는 터치 스크린, 터치 패드 또는 버튼 형태로 형성될 수도 있다. 운전 조작 장치는 제어부의 제어에 따라 동작될 수 있다. 차량 구동 장치는 차량내 각종 장치의 구동을 전기적으로 제어한다. 차량 구동 장치는 파워 트 레인 구동부, 샤시 구동부, 도어/윈도우 구동부, 안전 장치 구동부, 램프 구동부 및 공조 구동부를 포함할 수 있다. 파워 트레인 구동부는 파워 트레인 장치의 동작을 제어할 수 있다. 파워 트레인 구동부는 동력원 구 동부 및 변속기 구동부를 포함할 수 있다. 동력원 구동부는 차량의 동력원에 대한 제어를 수행한다. 화석 연료 기반의 엔진이 동력원인 경우, 동력원 구동부는 엔진의 출력 토크 등을 제어할 수 있다. 동력원 구동부는 제어부의 제어 하에 엔진 출력 토크를 조정할 수 있다. 전기 에너지 기반의 모터가 동력원인 경우, 동력원 구동부는 제어부 의 제어 하에 모터의 회전 속도, 토크 등을 조정할 수 있다. 변속기 구동부는 변속기에 대한 제어를 수행한다. 변속기 구동부는 변속기의 상태를 전진(D), 후진 (R), 중립(N) 또는 주차(P)로 조정할 수 있다. 엔진이 동력원인 경우, 변속기 구동부는 전진(D) 상태에서 기어의 물림 상태를 조정할 수 있다. 샤시 구동부는 샤시 장치의 동작을 제어할 수 있다. 샤시 구동부는 조향 구동부, 브레이크 구 동부 및 서스펜션 구동부를 포함할 수 있다. 조향 구동부는 차량 내의 조향 장치(steering apparatus)에 대한 전자식 제어를 수행할 수 있다. 조 향 구동부는, 차량의 진행 방향을 변경할 수 있다. 브레이크 구동부는 차량 내의 브레이크 장치(brake apparatus)에 대한 전자식 제어를 수행하여 차량 의 속도를 줄일 수 있다. 브레이크 구동부는 복수의 브레이크 각각을 개별적으로 제어할 수 있다. 브레이크 구동부는 복수의 휠에 걸리는 제동력을 서로 다르게 제어할 수 있다. 서스펜션 구동부는 차량 내의 서스펜션 장치(suspension apparatus)에 대한 전자식 제어를 수행할 수 있다. 서스펜션 구동부는 도로면에 굴곡이 있는 경우, 서스펜션 장치를 제어하여 차량의 진동이 저감되도록 제어할 수 있다. 서스펜션 구동부는 복수의 서스펜션 각각을 개별적으로 제어할 수 있다. 도어/윈도우 구동부는 차량 내의 도어 장치(door apparatus) 또는 윈도우 장치(window apparatus)에 대한 전자식 제어를 수행할 수 있다. 도어/윈도우 구동부는 도어 구동부 및 윈도우 구동부를 포함할 수 있다. 도어 구동부는 도어 장치에 대한 제어를 수행할 수 있다. 도어 구동부는 차량(10 0)에 포함되는 복수의 도어의 개방, 폐쇄를 제어할 수 있다. 도어 구동부는 트렁크(trunk) 또는 테일 게이 트(tail gate)의 개방 또는 폐쇄를 제어할 수 있다. 도어 구동부는, 썬루프(sunroof)의 개방 또는 폐쇄를 제어할 수 있다. 윈도우 구동부는 윈도우 장치(window apparatus)에 대한 전자식 제어를 수행하여 차량의 윈도우 개방 또는 폐쇄를 제어할 수 있다. 안전 장치 구동부는 차량 내의 각종 안전 장치(safety apparatus)에 대한 전자식 제어를 수행할 수 있다. 안전 장치 구동부는 에어백 구동부, 시트벨트 구동부 및 보행자 보호 장치 구동부 를 포함할 수 있다. 에어백 구동부는 차량 내의 에어백 장치(airbag apparatus)에 대한 전자식 제어를 수행하여 위험 감 지시 에어백이 전개되도록 이 에어백을 제어한다. 시트벨트 구동부는 차량 내의 시트벨트 장치(seatbelt apparatus)에 대한 전자식 제어를 수행하여 위 험 감지시, 시트 밸트를 이용해 탑승객이 시트(110FL, 110FR, 110RL, 110RR)에 고정되도록 제어할 수 있다. 보행자 보호 장치 구동부는 후드 리프트 및 보행자 에어백에 대한 전자식 제어를 수행하여 보행자와의 충 돌 감지시, 후드 리프트 업 및 보행자 에어백 전개되도록 이 에어백을 제어한다. 램프 구동부는, 차량 내의 각종 램프 장치(lamp apparatus)에 대한 전자식 제어를 수행한다. 공조 구동부는 차량 내의 공조 장치(air conditioner)에 대한 전자식 제어를 수행하여 차량 내부의 온도를 조절한다. 운행 시스템은 차량의 운행을 제어한다. 운행 시스템은 자율 주행 모드에서 동작될 수 있다. 운행 시스템은 주행 시스템, 출차 시스템 및 주차 시스템을 포함할 수 있다. 운행 시스템 이 소프트웨어적으로 구현되는 경우, 운행 시스템은 제어부의 하위 개념일 수도 있다. 운행 시스템은 사용자 인터페이스 장치, 오브젝트 검출 장치, 통신 장치, 차량 구동 장치 및 제어부 중 하나 이상과 연계되어 차량의 자율 운행을 제어할 수 있다. 주행 시스템은 내비게이션 시스템으로부터의 내비게이션 정보를 차량 구동 장치에 제공한다. 내비게이션 정보는 목적지, 경유지 정보 등 자율 주행에 필요한 경로 정보를 포함할 수 있다. 주행 시스템 은 오브젝트 검출 장치로부터의 객체 정보를 차량 구동 장치에 제공한다. 주행 시스템은 통신 장치를 통해 수신된 외부 디바이스로부터의 신호를 차량 구동 장치에 제공할 수 있다. 출차 시스템은 차량의 출차를 수행한다. 출차 시스템은 내비게이션 시스템으로부터의 내 비게이션 정보를 차량 구동 장치에 제공할 수 있다. 출차 시스템은 오브젝트 검출 장치로부터 의 객체 정보를 차량 구동 장치에 제공할 수 있다. 출차 시스템은 통신 장치를 통해 수신된 외 부 디바이스로부터의 신호를 차량 구동 장치에 제공할 수 있다. 주차 시스템은 차량의 주차를 수행할 수 있다. 주차 시스템은 내비게이션 시스템으로부터 의 내비게이션 정보를 바탕으로 차량 구동 장치에 제어 신호를 제공할 수 있다. 주차 시스템은 오브 젝트 검출 장치로부터의 객체 정보를 차량 구동 장치에 제공할 수 있다. 주차 시스템은 통신 장치를 통해 수신된 외부 디바이스로부터의 신호를 차량 구동 장치에 제공할 수 있다. 내비게이션 시스템은 내비게이션 정보를 발생할 수 있다. 내비게이션 정보는 맵(map) 데이터, 설정된 목 적지 정보, 목적지까지의 경로 정보를 포함한 드라이빙 플랜 데이터(driving plan data), 경로 상의 다양한 객 체에 대한 정보, 차선 정보 및 차량의 현재 위치 정보 중 하나 이상을 포함할 수 있다. 내비게이션 시스템 은 메모리, 프로세서를 포함할 수 있다. 메모리는 내비게이션 정보를 저장할 수 있다. 프로세서는 내비 게이션 시스템의 동작을 제어할 수 있다. 내비게이션 시스템은 통신 장치를 통해 수신된 외부 디바이스로부터 정보를 수신하여 기 저장된 정보를 업데이트 할 수 있다. 내비게이션 시스템은 사용자 인 터페이스 장치의 하위 구성 요소로 분류될 수 있다. 센싱부는 차량의 상태를 센싱할 수 있다. 센싱부는 자세 센서, 충돌 센서, 휠 센서(wheel sensor), 속도 센서, 경사 센서, 중량 감지 센서, 헤딩 센서(heading sensor), 요 센서(yaw sensor), 자이로 센서(gyro sensor), 포지션 모듈(position module), 차량 전진/후진 센서, 배터리 센서, 연료 센서, 타이어 센서, 핸들 회 전에 의한 스티어링 센서, 차량 내부 온도 센서, 차량 내부 습도 센서, 초음파 센서, 조도 센서, 가속 페달 포 지션 센서, 브레이크 페달 포지션 센서 등을 포함할 수 있다. 자세 센서는 요 센서(yaw sensor), 롤 센서(roll sensor), 피치 센서(pitch sensor) 등을 포함할 수 있다. 센싱부는 차량 자세 정보, 차량 충돌 정보, 차량 방향 정보, 차량 위치 정보(GPS 정보), 차량 각도 정보, 차량 속도 정보, 차량 가속도 정보, 차량 기울기 정보, 차량 전진/후진 정보, 배터리 정보, 연료 정보, 타이어 정보, 차량 램프 정보, 차량 내부 온도 정보, 차량 내부 습도 정보, 스티어링 휠 회전 각도, 차량 외부 조도, 가속 페달에 가해지는 압력, 브레이크 페달에 가해지는 압력 등을 실시간 감지하여 센싱 신호를 발생할 수 있다. 센싱부는 가속페달센서, 압력센서, 엔진 회전 속도 센서(engine speed sensor), 공기 유량 센서(AFS), 흡 기 온도 센서(ATS), 수온 센서(WTS), 스로틀 위치 센서(TPS), TDC 센서, 크랭크각 센서(CAS) 등을 더 포함할 수 있다. 인터페이스부는 차량에 연결되는 다양한 종류의 외부 기기와의 인터페이스를 제공한다. 예를 들면, 인터페이스부는 이동 단말기와 연결 가능한 포트를 포함하여 이동 단말기와 데이터를 교환할 수 있다. 인터페이스부는 이동 단말기에 전기 에너지를 공급할 수 있다. 이동 단말기가 인터페이스부에 전기 적으로 연결되면, 제어부의 제어에 따라, 인터페이스부는 전원 공급부에서 공급되는 전기 에너 지를 이동 단말기에 제공할 수 있다. 메모리는 제어부에 연결된다. 메모리는 차량의 구성 요소들 각각의 구동에 필요한 데이터, 사용 자 입력 데이터, 외부 디바이스로부터 수신된 정보 데이터 등을 저장할 수 있다. 메모리는 제어부의 처리 또는 제어를 위한 프로그램 등, 차량 전반의 동작을 위한 다양한 데이터를 저장할 수 있다. 메모리 는 ROM, RAM, EPROM, 플래시 드라이브, 하드 드라이브 등으로 구현될 수 있다. 메모리는 제어부와 일체형으로 구현되거나, 제어부의 하위 구성 요소로 구현될 수 있다. 제어부는 차량 내의 구성 요소들 각각의 전반적인 동작을 제어할 수 있다. 제어부는 ECU(Electronic Control Unit)를 포함할 수 있다. 제어부는 오브젝트 검출 장치 및 통신 장치 중 적어도 하나를 통하여 획득되는 정보에 기초하여 차량을 제어할 수 있다. 이에 따라, 차량은 제어 부의 제어 하에 자율 주행할 수 있다. 프로세서 및 제어부는, ASICs (application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기(controllers), 마이크로 컨트롤러(micro- controllers), 마이크로 프로세서(microprocessors) 등으로 구현될 수 있다. 전원 공급부는 차량 내부의 배터리 로부터 전원을 공급받을 수 있다. 전원 공급부는 제어부의 제어 하에 각 구성 요소들의 동작에 필요한 전원을 구성 요소들에 공급할 수 있다. 차량은 IVI(In-Vehicle Infotainment) 시스템을 포함할 수 있다. IVI 시스템은 사용자 인터페이스 장치 , 통신 장치, 제어부, 내비게이션 시스템, 및 운행 시스템과 연계되어 동작할 수 있 다. IVI 시스템은 사용자 입력에 응답하여 멀티 미디어 컨텐츠를 재생하고 다양한 응용 프로그램에 대한 UI(User Interfaces) 또는 UX(User Experience) 프로그램을 실행한다. 도 14은 본 발명의 실시 예에 따른 보험 안내 시스템을 보여 주는 도면이다. 도 15는 사용자 단말기의 화면 상 에 표시되는 UX 화면을 이용하여 안전 등급과 경로 상의 구간별 보험 안내 방법을 보여 주는 도면이다. 도 14을 참조하면, 본 발명의 보험 안내 시스템은 네트워크를 통해 연결된 차량, 사용자 단말기, 및 서버를 포함한다. 사용자 단말기는 사용자의 입력에 따라 차량 호출 어플리케이션을 실행한다. 차량 호출 어플리케이션은 도 15에 도시된 바와 같이 목적지 입력창과 안전도 등급 입력창을 포함한 사용자 단말기의 화면에 표시할 수 있다. 본 발명의 보험 안내 시스템 및 방법은 차량의 안전 장치 구비 상태 및 옵션에 따라 차량의 안전도 등급을 정의 하고, 안전 등급에 따른 보험 서비스를 사용자에게 안내한다. 차량의 안전도가 높을수록 사고가 일어날 가능성 이 적고 중대한 사고를 방지할 수 있으므로 보험료 비용이 낮아질 수 있다. 안전도 등급은 차량의 안전 장치 구비 상태에 따라 미리 설정될 수 있다. 차량의 안전 장치는 차량 사고시 사 용자의 피해 수준을 경감할 수 있는 안전 장치로서, 에어백, 센서, ABS(Anti-lock Brake System), TCS(Traction Control System), ESP(Electronic Stability Program), ECS(Electronic Control suspension) 등 을 포함하지만 이에 한정되지 않는다. 예를 들어, 안전도 등급은 아래와 같이 차량에 구비된 안전 장치의 개수 및 종류에 따라 설정될 수 있다. 안전도 1 등급 차량: 전 좌석 에어백, 전후방 감지용 센서, ABS, TCS, ESP, 및 ECS를 구비한 차량 안전도 2 등급 차량: 앞좌석 에어백, 전후방 감지용 센서, ABS, 및 TCS를 구비한 차량 안전도 3등급 차량: 운전자석 에어백과 전후방 감지용 센서를 구비한 차량 안전도 등급은 안전 장치 각각의 성능에 따라 구분될 수도 있다. 예를 들어, 차량 주변의 객체를 검출하기 위 한 오브젝트 검출 장치의 구성 요소들의 성능에 따라 안전 등급에서 차이가 있을 수 있다. 예를 들어, 카 메라, 레이다, 라이다, 초음파 센서, 적외선 센서 중 하나 이상의 해상도가 우수할수 록 차량의 안전 등급이 높아질 수 있고, 탐지 거리가 길수록 차량의 안전 등급이 높아질 수 있다. 차량의 출고시 구비된 안전 장치를 변경할 때 안전 성능이 저하될 수 있다. 이를 고려하여 안전도 등급은 차량의 출고시 안전 장치 사양과 상이할 때 떨어질 수 있다. 서버는 사용자 단말기로부터 수신된 목적지까지의 경로를 분석하여 도 15 및 도 16에 도시된 바와 같이 경로 상에서 위험 구간, 보험 종류, 추천 보험, 보험료 등을 안내하는 구간별 보험 안내 정보를 사용자 단 말기로 전송할 수 있다. 위험 구간은 도 16과 같이 구간별 위험도로 표시될 수 있다. 사용자가 차량 에 탑승한 경우, 이러한 데이터를 사용자 단말기 및/또는 차량에 전송할 수 있다. 사용자 단 말기와 차량은 서버로부터 수신된 데이터를 보험 안내 화면에 표시할 수 있다. 서버는 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 등을 고려하여 구간별 위험도를 판정하여 위헌 구간을 설정할 수 있다. 구간별 위험도에 따라 보험료가 달라질 수 있다. 위험도가 높은 구간 (위험 구간)에서 보험료가 높게 책정될 수 있다. 예를 들어, 심각한 사고 이력이 있는 구간은 위험도가 높은 등급으로 설정되고, 사고 발생율이 많은 구간은 안 전도가 높은 등급으로 설정될 수 있다. 같은 구간이라도 안개, 비, 눈이 오면 위험도가 높은 등급으로 조정될 수 있다. 같은 구간이라도 심각한 사고 가 발생되거나 사고 빈도가 높은 시간에서 위험도가 높은 등급으로 조정될 수 있다. 또한, 같은 구간이라도 교 통 혼잡도가 증가하면, 위험도가 더 높은 등급으로 조정될 수 있다. 서버는 차량의 안전도 등급과 다양한 위험 요인을 고려하여 사용자에게 보험료, 보험 종류를 상이하게 안 내할 수 있다. 예를 들어, 눈이 많이 온 날에 안전도 1등급의 차량은 TCS가 장착되어 있기 때문에 미끄럼 관련 보험을 안내할 필요가 없다. 이 경우, 서버는 사용자 단말기에 보험 안내 제공을 하지 않거나 간 단한 보장 보험 위주로 보험 정보를 전송할 수 있다. 그러나 안전도 3등급의 차량의 경우에 서버는 TCS가 차량에 구비되어 있지 않기 때문에 미끄럼 관련 보험 안내 정보를 사용자 단말기에 제공한다. 따라 서, 사용자 단말기는 안전도 등급과 다양한 위험 요인에 따라 서버로부터 수신된 구간별 보험 안내 정보를 디스플레이 상에 표시할 수 있다. 사용자는 사용자 단말기 또는 차량의 디스플레이에 표시되는 구간별 보험 안내 정보를 보고 주행 경 로와 구간별 보험을 선택한 후에 차량을 호출할 수 있다. 차량은 주행 경로와 구간별 보험 가입이 완료된 후에 사용자가 탑승할 수 있는 픽업 장소에 도착할 수 있 다. 보험 종류에 구간별로 보험사 각각에서 제공하는 보험 상품이 포함될 수 있다. 또한, 보험 종류에 보험 상품별 장단점이 포함될 수 있다. 추천 보험은 구간별로 사용율이 높은 보험, 안전 운전 성향의 타 사용자가 사용한 보험 등이 선택될 수 있다. 안전 운전 성향의 타 사용자는 해당 구간에서 사고 이력이 적은 사용자들일 수 있다. 서버는 실시간으로 위험 구간을 모니터링하고, 구간별 위험도를 지시하는 데이터를 실시간 업데이트하여 사용자 단말기 및/또는 차량에 전송할 수 있다. 서버는 차량으로부터 수신된 차량 정보를 바탕으로 주행 경로 상에서 구간에 진입할 때 사용자가 선 택한 보험료에 대한 결제 처리를 하고 사용자 단말기 또는 차량에 결제 처리 결과 메시지를 전송할 수 있다. 서버는 구간을 이탈할 때마다 해당 구간의 보험 계약을 해지하고 해지 메시지를 사용자 단말기 또는 차량에 전송할 수 있다. 서버는 구간이 변경될 때마다 해당 구간에 적용되는 보험 안내 정보를 전송한다. 보험 안내 정보는 구간 별 위험도, 보험 종류, 추천 보험, 보험료 등에 관한 정보를 포함할 수 있다. 서버는 차량으로부터 수신된 차량 정보를 바탕으로 주행 모드가 변경될 때 예를 들어, 자율 주행 모 드에서 매뉴얼 모드로 변경될 때 매뉴얼 모드에 적용되는 보험 안내 정보를 사용자 단말기 및/또는 차량 에 전송한다. 따라서, 사용자는 자율 주행 모드에서 매뉴얼 모드로 전환하여 차량의 주행을 직접 제어할 때 매뉴얼 모드에 맞는 보험 계약을 구간별로 갱신할 수 있다. 서버는 구간별로 사용자들이 선택한 보험, 보험에 대한 만족도, 사고 이력에 대한 통계를 계산하고 이 통 계를 바탕으로 구간별 추천 보험을 선정하여 각 구간에서 다음 차량의 사용자에게 전송한다. 본 발명의 보험 안내 시스템 및 방법은 차량의 안전도 등급에 따라 보험료를 차등 적용하여 사용자가 자율 주행 차량의 안전도에 따라 보험료를 적정 비용으로 부담하고 사고 발생 가능성을 낮출 수 있다. 본 발명의 보험 안내 시스템 및 방법은 차량의 안전도 등급, 주행 경로의 구간별 위험도를 사용자에게 제공할 수 있다. 본 발명은 구간이 변경될 때마다 구간별 위험도를 실시간 업데이트하여 사용자에게 알려 줌으로써 사 고를 예방할 수 있게 하고, 사용자가 각 구간 마다 적절한 보험료를 선택하게 함으로써 불필요한 보험료 낭비를 줄일 수 있다. 차량의 제어부는 자율 주행 모드 판단 모듈, 차량 정보 전송 모듈, 및 구간별 위험도 안내 모듈 등을 포함할 수 있다. 자율 주행 모드 판단 모듈은 오브젝트 검출 장치와 운행 시스템에 연계되어 차량의 자율 주행을 제어한다. 차량 정보 전송 모듈은 차량 주행 정보와 차량 상태 정보를 포함한 차량 정보를 통신 장치를 통해 서버로 전송한다. 구간별 위험도 안내 모듈은 서버로부터 수신된 구간별 위험도 를 출력부에 출력하여 사용자에게 구간별 위험도를 실시간 알려 줄 수 있다. 차량의 내비 게이션 시스템은 지도 정보, 교통 정보, 경로 안내 서비스를 처리한다. 내비 게이션 시 스템은 사용자가 선택한 주행 경로를 지도 상에 맵핑하여 경로를 안내하고, 서버로부터 수신된 실시 간 교통 상황을 출력부를 통해 출력한다. 도 17는 지도 상에서 주행 경로의 구간별 보험 안내 화면의 일 예를 보여 주는 도면이다. 도 17를 참조하면, 사용자 단말기 또는 차량의 디스플레이는 내비게이션 시스템으로부터의 경 로 정보가 반영된 지도를 표시할 수 있다. 지도는 주행 경로 상에서 사용자가 선택한 구간별 보험 종류 및 보 험료가 표시될 수 있다. 예를 들어, 제1 구간(SECT1)의 보험은 160 원/m의 보험료가 책정된 B 보험으로 선택될 수 있다. 제2 구간 (SECT2)의 보험은 120 원/m의 보험료가 책정된 B 보험으로 선택될 수 있다. 차량의 안전도 등급이 높을수록 보 험료가 낮아질 수 있고 구간별 위험도가 낮을수록 보험료가 낮아질 수 있다. 사용자 단말기 또는 차량에 표시되는 지도 상에 구간별 위험도가 함께 표시될 수 있다. 도 18는 차량 호출 방법을 보여 주는 흐름도이다. 도 18를 참조하면, 사용자는 사용자 단말기를 이용하여 목적지와 차량의 안전도 등급을 입력하여 차량 을 호출할 수 있다(S651). 서버는 사용자 단말기로부터 수신된 목적지와 차량의 안전도 등급을 바탕으로 배차 가능한 차량 이 있는지 탐색한다. 서버는 사용자가 입력한 안전도 등급의 차량을 배차하거나, 동일 안전도 등급의 차량이 없으면 사용자 단말기에 타 등급 차량 배정을 안내하고 사용자의 확인 하에 타 등급 차량 을 배정할 수 있다(S652, S653, S654).서버는 목적지까지의 주행 경로 중에서 위험 구간이 있는지 판단한다(S655). 서버는 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 등 다양한 위험 요인을 고려하여 구간별 위험도를 판정할 수 있다. 위험 요인별로 가중치를 적용하고, 가중치가 적용된 위험 요인들의 합으로 구간별 위험도가 계산될 수 있다. 서버는 사용자가 입력한 차량의 안전 등급에 맞는 보험을 선택하고, 그 보험 안내 정보를 사용자 단말기 로 전송한다(S656 및 S657). 서버는 차량의 안전 등급과 구간별 위험도를 바탕으로 구간별 보험의 종류 및 보험료를 포함한 보험 안내 정보를 설정할 수 있다. 사용자 단말기는 서버로부터 수신된 보험 안내 정보를 디스플레이 상에 표시한다(S658). 사용자는 서버로부터 수신된 둘 이상의 주행 경로 중 어느 하나를 선택하고, 선택한 주행 경로 상에서 구간별 보험 을 선택할 수 있다. 서버는 구간별 보험에 대한 사용자의 응답을 수신하고 분석하여 구간별 보험 선택 비율, 만족도 등을 계 산한다. 사용자의 응답 분석은 동일 구간에서 사용자 또는 타 사용자에게 추천되는 보험 정보로 활용될 수 있 다(S659). 서버는 구간별 보험 적용 확인 메시지를 사용자 단말기로 전송하고, 차량에 배차 명령을 전송하여 차량으로 하여금 사용자의 픽업 위치로 이동하게 한다. 차량은 구간별 보험 적용 후 서버의 배차 명령에 응답하여 매뉴얼 모드, 자율 주행 모드, 또는 원격 제어 모드로 운행되어 사용자의 픽업 위치로 이동할 수 있다(S660). 도 19은 위험 구간 변경시 보험 안내 방법을 보여 주는 흐름도이다. 도 19을 참조하면, 차량 운행 중에 주행 경로 상의 위험 구간이 새로 등록되거나 해지될 수 있다. 이 경우, 구 간별 위험도 변경에 따라 기 보험이 해지되거나 위험 구간 보험료로 재가입할 수 있다. 서버는 차량 운행 중에 차량으로부터 수신된 차량 정보를 바탕으로 차량의 현재 위치를 판단하 고, 실시간으로 주행 경로의 위험 구간을 감시(monitor)할 수 있다(S661). 서버는 기상청 서버, 경찰 서버 등으로부터 수신된 교통 혼잡도와 날씨 정보를 받아볼 수 있다. 서버 는 구간별 차량수와 날씨 등이 변할 때 사용자 단말기 및/또는 차량에 위험 구간 변경 안내를 전송하고, 위험 구간을 등록하거나 위험 구간을 해지할 수 있다(S663, S664, S665). 사용자 단말기 또는 차량은 디스플레이, 음성, 햅틱 등으로 위험 구간 변경 안내 메시지를 출력할 수 있다. 차량수가 증가하 거나 날씨가 나빠지면, 해당 구간의 위험도가 상승하여 위험 구간으로 변경될 수 있고 반대로, 차량수가 감소하 고 날씨가 쾌청할 때 위험 구간이 해지될 수 있다. 서버는 위험 구간을 새롭게 등록할 수 있다. 이 때, 서버는 사용자 단말기 또는 차량 에 위험 구간 등록 메시지를 전송할 수 있다. 사용자 단말기 또는 차량은 서버로부터 수신된 위험 구간 등록 메시지 예를 들어, “제2 구간이 날씨 변화로 인해 위험 구간으로 새로 등록되었습니다”를 출 력할 수 있다. 위험 구간 등록시, 서버는 동일 구간에 기 가입된 구간별 보험이 있는지 탐색한다(S664). 서버는 새로운 위험 구간에서 사용자가 이전에 가입한 구간별 보험 이력이 있는지 탐색한다. 서버는 새로운 위 험 구간에서 사용자의 이전 보험 기록이 있으면, 이 보험에 관한 정보를 사용자 단말기 또는 차량으 로 전송하여 사용자에게 이전 보험을 보여 줄 수 있다(S665 및 S666). 사용자 단말기 또는 차량은 서버로부터 수신된 메시지에 응답하여 사용자에게 “이전 동일 구간에 c 보험 상품을 이용하였습니다. 이 번에도 이용하시겠습니까?”를 출력할 수 있다. 새로운 위험 구간에서 사용자의 보험 이력이 없으면, 서버는 타 사용자가 이 구간에서 가입한 보험 중에 서 최다 사용 보험을 사용자 단말기 또는 차량으로 전송하여 사용자에게 새로운 보험 구간에 적용 가능한 구간별 보험을 추천할 수 있다(S667). 사용자 단말기 또는 차량은 서버로부터 수신된 메시지에 응답하여 사용자에게 “이전 동일구간 기록이 없습니다. 동일 구간 내 타 탑승객의 최다 이용보험을 안내받으시겠습니까?”를 출력할 수 있다. 위험 구간 해지시, 서버는 사용자가 동일 구간에 기 가입된 보험이 있는지 탐색한다(S668 및 S669). 이 때, 사용자 단말기 또는 차량은 서버로부터 수신된 메시지에 응답하여 사용자에게 “제1 구간 이 차량 수 변경으로 인해 위험구간이 해제되었습니다”를 출력할 수 있다. 위험 구간으로부터 해지된 구간에 이미 가입한 사용자의 구간별 보험이 있다면, 사용자 단말기 또는 차량 은 서버로부터 수신된 메시지에 응답하여 보험 해지 여부를 안내하는 메시지 예를 들어, “위험 구 간 변경으로 인하여 위험 구간의 보험을 해지하시겠습니까?”와 같은 메시지를 사용자에게 출력할 수 있다 (S670). 사용자가 보험을 해지하면, 서버는 비 위험 구간용 보험을 사용자에게 추천할 수 있다. 위험 구간으로부터 해지된 구간에 대하여 사용자가 가입한 보험이 없다면, 사용자 단말기 또는 차량(10 0)은 보험 갱신이 필요없다는 메시지 예를 들어, “가입되어 있던 보험이 없습니다. 운행을 유지합니다.”를 사 용자에게 출력할 수 있다. 서버는 위험 구간 변경에 대한 사용자의 응답을 수신하고 분석하여 구간별 보험 선택 비율, 만족도 등을 계산한다. 사용자의 응답 분석은 동일 구간에서 사용자 또는 타 사용자에게 추천되는 보험 정보로 활용될 수 있다(S671). 차량은 운행 중에 변경된 구간별 보험 적용을 받으면서 계속 운행할 수 있다(S672). 도 20은 차량의 운행 모드 변경시 보험 안내 방법을 보여 주는 흐름도이다. 도 20을 참조하면, 차량 운행 중에 사용자에 의해 운행 모드가 임의로 변경될 수 있다. 예를 들어, 차량 운행 중에 사용자가 매뉴얼 모드로부터 자율 주행 모드로 운행 모드를 변경하거나 그 반대로 운행 모드를 변경할 수 있다. 운행 모드에 따라 구간별 위험도와 보험 상품 및 보험료가 달라질 수 있다. 차량은 운행 모드가 변경되었다는 것을 감지하여 사용자에게 운행 모드 변경 안내 예를 들어, “탑승자의 요청으로 수동운전에서 자율주행 운행으로 변경됩니다. 허가하시겠습니까?”를 사용자에게 출력할 수 있다(S681 및 S682). 서버는 차량으로부터 수신된 차량 정보를 바탕으로 차량의 운행 모드 변경을 실시간 감지할 수 있다. 서버는 사용자가 운행 모드 변경을 수락한 경우에 운행 모드 변경에 따른 위험 구간을 재탐색한다 (S683) 사용자 단말기 또는 차량은 서버의 재탐색 결과로 수신된 메시지에 응답하여 변경된 운행 모 드에서 설정된 위험 구간과 보험을 사용자에게 안내할 수 있다. 서버는 변경된 운행 모드에서 위험 구간을 새롭게 등록할 수 있다(S684). 위험 구간 등록시, 서버(200 0)는 동일 구간에 기 가입된 구간별 보험이 있는지 탐색한다(S685 및 S686). 서버는 새로운 위험 구간에 서 사용자의 이전 보험 기록이 있으면, 이 보험에 관한 정보를 사용자 단말기 또는 차량으로 전송하 여 사용자에게 이전 보험을 보여 줄 수 있다. 새로운 위험 구간에서 사용자의 보험 이력이 없으면, 서버는 타 사용자가 이 구간에서 가입한 보험 중에 서 최다 사용 보험을 사용자 단말기 또는 차량으로 전송하여 사용자에게 새로운 보험 구간에 적용 가능한 구간별 보험을 추천할 수 있다(S687). 운행 모드 변경에 따라 위험 구간이 해지될 수 있다(S688). 위험 구간 해지시, 서버는 사용자가 동일 구 간에 기 가입된 보험이 있는지 탐색한다(S690). 위험 구간으로부터 해지된 구간에 이미 가입한 사용자의 구간별 보험이 있다면, 사용자 단말기 또는 차 량은 서버로부터 수신된 메시지에 응답하여 보험 해지 여부를 안내하는 메시지를 사용자에게 출력할 수 있다. 사용자가 보험을 해지하면, 서버는 비 위험 구간용 보험을 사용자에게 추천할 수 있다. 위험 구간으로부터 해지된 구간에 대하여 사용자가 가입한 보험이 없다면, 사용자 단말기 또는 차량(10 0)은 보험 갱신이 필요없다는 메시지를 사용자에게 출력할 수 있다. 서버는 위험 구간 변경에 대한 사용자의 응답을 수신하고 분석하여 구간별 보험 선택 비율, 만족도 등을 계산한다. 사용자의 응답 분석은 동일 구간에서 사용자 또는 타 사용자에게 추천되는 보험 정보로 활용될 수 있다(S691). 차량은 운행 중에 변경된 구간별 보험 적용을 받으면서 계속 운행할 수 있다(S692). 도 21은 차량 운행 중 보험 적용 및 해지 방법의 일 예를 보여 주는 흐름도이다. 도 21을 참조하면, 서버는 차량으로부터 실시간 수신된 차량 정보를 바탕으로 주행 경로 상에서 차 량의 현재 위치를 판단할 수 있다. 서버는 기 가입된 구간별 보험이 있는 구간에 차량이 진입 할 때 기 가입 보험 적용을 시작하고 이를 사용자 단말기 또는 차량을 통해 사용자에게 알려 준다 (S701). 서버는 해당 구간이 끝날 때 이 구간의 구간별 보험을 해지하고 사용자 단말기 또는 차량을 통해 사용자에게 보험 해지를 알려 준다(S704). 사용자는 목적지를 변경하거나 운행 모드를 변경할 수 있다. 이 경우, 차량이 주행 경로를 이탈하거나 변 경하여 기 가입 보험이 있는 구간을 벗어날 수 있다(S702). 차량이 기 가입된 보험 적용 구간을 벗어나면, 서버는 사용자 단말기 또는 차량을 통해 보험 해지 메시지를 사용자에게 출력할 수 있다(S703). 서버는 경로 이탈 또는 변경에 따른 새로운 구간의 구간별 보험 상품을 탐색하여 탐색 결과 를 사용자 단말기 또는 차량을 통해 사용자에게 알려 줄 수 있다. 본 발명의 실시 예에 따른 자율 주행 차량을 위한 보험 안내 시스템 및 방법은 아래와 같이 설명될 수 있다. 본 발명의 보험 안내 시스템은 목적지와 차량의 안전 등급을 입력하는 사용자 단말기; 및 상기 목적지까지의 주 행 경로 상에서 둘 이상 존재하는 구간들의 구간별 보험 관련 정보를 상기 사용자 단말기로 전송하는 서버를 포 함한다. 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 주행 경로 상에서 선택된 구간별 보험과 위험 구간을 표 시한다. 상기 차량이 자율 주행 모드로 운행될 때 상기 위험 구간에서 구간별 보험이 적용된다. 상기 서버는 상기 차량이 구간에 진입할 때 미리 가입된 구간별 보험을 적용하고, 상기 구간이 끝날 때 상기 구 간별 보험을 해지한다. 상기 서버는 상기 주행 경로의 구간을 이탈할 때 상기 구간에 가입된 구간별 보험을 해지한다. 상기 차량의 안전 등급은 상기 차량에 구비된 안전 장치의 개수와 종류에 따라 설정된다. 상기 차량의 안전 등급은 상기 차량의 외부 객체를 감지하기 위한 카메라, 레이다, 라이다, 초음파 센서 및 적 외선 센서 중 하나 이상의 해상도와 탐지 거리에 따라 설정된다. 상기 서버는 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상을 실시간 감지하여 구간별 위험도를 판정하고, 상기 구간별 위험도에 따라 상기 위험 구간을 설정한다. 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 구간별 사고 유형, 상기 구간별 사고 발생율을 표시한다. 상기 서버는 상기 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상이 변화할 때 상기 위험 구간을 등록하거나 해지한다. 상기 서버는 상기 차량의 운행 모드가 매뉴얼 모드로부터 자율 주행 모드로 변경될 때 상기 위험 구간을 등록하 거나 해지한다. 상기 서버는 타 사용자가 사용한 구간별 보험 이력을 바탕으로 상기 사용자 단말기와 상기 차량 중 하나 이상에 구간별 추천 보험 정보를 전송한다. 상기 사용자 단말기와 상기 차량 중 하나 이상에 상기 구간별 추천 보험 정 보가 표시된다. 본 발명의 보험 안내 방법은 사용자 단말기에 목적지와 차량의 안전 등급을 입력하는 단계; 서버가 상기 목적지 까지의 주행 경로 상에서 둘 이상 존재하는 구간들의 구간별 보험 관련 정보를 상기 사용자 단말기로 전송하는 단계; 및 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 주행 경로 상에서 선택된 구간별 보험과 위험 구간을 표시하는 단계를 포함한다. 상기 차량이 자율 주행 모드로 운행될 때 상기 위험 구간에서 구간별 보험이 적용된다. 상기 보험 안내 방법은 상기 차량이 구간에 진입할 때 상기 서버가 미리 가입된 구간별 보험을 적용하는 단계; 및 상기 차량의 주행 중에 상기 구간이 끝날 때 상기 서버가 상기 구간별 보험을 해지하는 단계를 더 포함한다. 상기 보험 안내 방법은 상기 주행 경로의 구간을 이탈할 때 상기 서버가 상기 구간에 가입된 구간별 보험을 해 지하는 단계를 더 포함한다. 상기 차량에 구비된 안전 장치의 개수와 종류에 따라 상기 차량의 안전 등급이 설정된다. 상기 차량의 외부 객체를 감지하기 위한 카메라, 레이다, 라이다, 초음파 센서 및 적외선 센서 중 하나 이상의 해상도와 탐지 거리에 따라 상기 차량의 안전 등급이 설정된다. 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상을 상기 서버가 실시간 감시하여 구간별 위험도를 판정하고, 상기 구간별 위험도에 따라 상기 위험 구간을 설정한다. 상기 사용자 단말기와 상기 차량 중 하나 이상이 상기 구간별 사고 유형, 상기 구간별 사고 발생율을 표시한다. 상기 구간별 사고 유형, 구간별 사고 발생율, 날씨, 시간, 교통 혼잡도 중 하나 이상이 변화할 때 상기 서버가 상기 위험 구간을 등록하거나 해지한다. 상기 차량의 운행 모드가 매뉴얼 모드로부터 자율 주행 모드로 변경될 때 상기 서버가 상기 위험 구간을 등록하 거나 해지한다. 본 발명은 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터는 프로세서 또는 제어부를 포함할 수도 있다. 명세서의 상세한 설명은 모든 면에서 제한적으로 해석되 어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 발명은 청구 범위의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다. 상술한 실시 예에 설명된 특징, 구조, 효과 등은 본 발명의 적어도 하나의 실시 예에 포함되며, 반드시 하나의 실시 예에만 한정되는 것은 아니다. 나아가, 각 실시 예에서 예시된 특징, 구조, 효과 등은 실시 예들이 속하는 분야의 통상의 지식을 가지는 자에 의하여 다른 실시 예들에 대해서도 조합 또는 변형되어 실시 가능하다. 따라 서 이러한 조합과 변형에 관계된 내용들은 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다. 또한, 이상에서 실시 예들을 중심으로 설명하였으나 이는 단지 예시일 뿐 본 발명을 한정하는 것이 아니며, 본 발명이 속하는 분야의 통상의 지식을 가진 자라면 본 실시 예의 본질적인 특성을 벗어나지 않는 범위에서 이상 에 예시되지 않은 여러 가지의 변형과 응용이 가능함을 알 수 있을 것이다. 예를 들어, 실시 예들에 구체적으로 나타난 각 구성 요소는 변형하여 실시할 수 있는 것이다. 그리고 이러한 변형과 응용에 관계된 차이점들은 첨부 한 청구 범위에서 규정하는 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2019-7019216", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 5G 통신 시스템에서 자율 주행 차량과 5G 네트워크의 기본동작의 일 예를 나타낸다. 도 2는 5G 통신 시스템에서 자율 주행 차량과 5G 네트워크의 응용 동작의 일 예를 나타낸다. 도 3 내지 도 6은 5G 통신을 이용한 자율 주행 차량의 동작의 일 예를 나타낸다. 도 7은 본 발명의 실시 예에 따른 차량의 외관을 도시한 도면이다. 도 8은 본 발명의 실시 예에 따른 차량을 외부의 다양한 각도에서 바라 본 도면이다. 도 9 및 도 10은 본 발명의 실시 예에 따른 차량의 내부를 보여 주는 도면이다. 도 11 및 도 12는 본 발명의 실시 예에 따른 차량의 주행과 관련된 객체들(objects)의 예를 보여 주는 도면들이 다. 도 13은 본 발명의 실시 예에 따른 차량을 상세히 보여 주는 블럭도이다. 도 14은 본 발명의 실시 예에 따른 보험 안내 시스템을 보여 주는 도면이다. 도 15는 사용자 단말기의 화면 상에 표시되는 UX 화면을 이용하여 안전 등급과 경로 상의 구간별 보험 안내 방 법을 보여 주는 도면이다. 도 16은 구간별 안전도, 보험 종류, 추천 보험 등을 안내하는 방법의 일 예를 보여 주는 도면이다. 도 17는 지도 상에서 주행 경로의 구간별 보험 안내 화면의 일 예를 보여 주는 도면이다. 도 18는 차량 호출 방법을 보여 주는 흐름도이다. 도 19은 위험 구간 변경시 보험 안내 방법의 일 예을 보여 주는 흐름도이다. 도 20은 차량의 운행 모드 변경시 보험 안내 방법의 일 예를 보여 주는 흐름도이다. 도 21은 차량 운행 중 보험 적용 및 해지 방법의 일 예를 보여 주는 흐름도이다."}
