{"patent_id": "10-2018-0071724", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0080154", "출원번호": "10-2018-0071724", "발명의 명칭": "법률상담서비스를 위한 낱말 주머니[Bag of Words] 기반 자연어 처리 활용 방법 및 시스템", "출원인": "이인희", "발명자": "이인희"}}
{"patent_id": "10-2018-0071724", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자가 표현하고자 하는 의도[intent]를 반영하여 미리 법률서비스와 관련한 표현을 입력하는 단계; 및 상기입력한 내용을 기계학습하는 단계를 통해 자연어 처리를 하는 방법."}
{"patent_id": "10-2018-0071724", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서 자연어 처리의 방법은 법률서비스에 관한 민법 및 상법상 전형계약서를 다루는 말뭉치를 '낱말주머니[Bag of Words]' 방식으로 미리 입력해서 기계학습[Machine Learning]하는 것을 특징으로 하는 훈련방법."}
{"patent_id": "10-2018-0071724", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항의 '낱말 주머니[Bag of Words]'는 편집이 용이하고, 각 형태소별로 다시 시스템에서 훈련을 강화할 수 있는 것을 특징으로 하는 기계학습 방법."}
{"patent_id": "10-2018-0071724", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "사용자로 하여금 상담서비스가 미리 구현한 양식에 구애받지 않고 사용자 자신이 표현하고자 하는 의도[intent]를 자유롭게 입력하게 하는 방법."}
{"patent_id": "10-2018-0071724", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항의 입력방법은 다른 서비스들이 미리 양식을 제공하고, 그 양식의 빈칸을 사용자가 의문이 들더라도 일단채우게 하는 형태가 많은데 비해 자신이 평소 사용하는 표현을 가능하게 하도록 입력창을 제공하는 방법"}
{"patent_id": "10-2018-0071724", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항의 입력방법은 사용자가 일반적으로 사용하는 채팅애플리케이션(가령, 카카오 톡, 라인, 위챗, 텔레그램,페이스북 메신저 등)을 활용하거나 웹 애플리케이션을 통해 접속만으로 상담서비스를 사용함에 있어 별도의 애플리케이션 설치를 하지 않고 입력하도록 하는 방법"}
{"patent_id": "10-2018-0071724", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "사용자가 입력한 표현을 명화히 알기 어려운 경우 이를 사용자의 의도[intent]를 다시 확인하는 단계; 및 그 확인에 따라 기존 상담 내용을 유지한 채 상담을 지속하거나 기존 상담을 지우고 상담을 재개해서 데이터를 새로기록하는 단계를 포함하는 것을 특징으로 하는 자연어 처리 방법"}
{"patent_id": "10-2018-0071724", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항의 의도[intent]를 명확히 하기 어려운 경우에는 미리 '불명확한 표현'에 대해 다시 입력 해달라는 표현을준비하고, 다시 입력을 하게 하는 단계를 포함하는 것을 특징으로 하는 자연어 처리 방법"}
{"patent_id": "10-2018-0071724", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항의 사용자 의도[intent] 파악에 어려움을 겪는 원인 오타에 의하지 않도록 미리 엔티티[entity]를 통해 오타도 등록을 하여 오타에 의한 의도[intent] 파악에 어려움이 없도록 자연어 처리가 가능하도록 하는 방법"}
{"patent_id": "10-2018-0071724", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 낱말 주머니[Bag of Words] 기반 자연어 처리 활용 법무 상담프로세스 구축으로 사용자(의뢰인)은 일 상 용어를 자신의 표현 방식으로 입력하기만 하면 기계학습을 통한 인공지능의 자연어 처리로 상담의 사용자 경 험이 수동적인 방식에서 능동적인 방식으로 확연이 달라질 수 있고, 이로 인한 법률관련 서비스의 비약적인 발전 을 도모할 수 있다."}
{"patent_id": "10-2018-0071724", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 의뢰인이 법무관련 상담을 함에 있어 자연어 처리를 통해 법무상담이 가능하게 하는 방법 및 시스템 에 관한 것으로, 보다 상세하게는 자연어 처리에 있어 다양한 방법 가운데 낱말 주머니[Bag of Words] 방식을통해 법률상담서비스를 원활히 하는 방법 및 시스템에 관한 내용이다."}
{"patent_id": "10-2018-0071724", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "법무관련 영역은 기본적으로 상담을 필수로 하고 있지만, 전문가와 상담을 연결하는 다양한 수단 또는 양식(또 는 Form)을 제공하고 사전 조사형태로 진행되는정도에 그치는 것이 현재로서는 대부분이다. 이는 상담을 정형화하여 ARS 방식으로 각종 단계와 조건을 확인하며 처리하게 되므로 서비스 진행 속도가 매우 지루하고 서비스 경험이 나빠 해당 서비스의 자동화된 처리에 매우 큰 장애요소가 된다. 하지만 자연어 처리를 통해 상담이 가능하게 하면 기계학습에 따라 상담의 정밀도가 높아지고 유관산업의 활성 화를 시간과 공간의 제약없이 할 수 있게 된다. 특히 낱말 주머니[Bag of Words] 방식은 자연어 처리 가운데 복잡도가 상대적으로 낮은 방식으로서 손쉽게 구축 할 수 있는 장점이 있다."}
{"patent_id": "10-2018-0071724", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상담을 필수적으로 수반하는 법무분야에서 사용자인 의뢰인과 수임인 사이에 필요한 내용을 일반인이 대화에서 사용하듯 대화를 하도록 유도해서 상담을 손쉽게 처리하는 방법 및 시스템을 구축하고자 한다. 좀 더 구체적으로는 '오늘 홍길동과 2000만원을 빌려주는 조건으로 연이자 5%로 계약을 하려고 해'라고 하면 ' 계약체결일', '차주', '원금', '이자' 등을 미리 입력해둔 '낱말 주머니[Bag of Words]' 방식의 자연어 처리를 통해 추출하고, 추가적인 질문을 대화하듯 이어갈 수 있도록 상담이 가능하도록 지원하는 방법 및 시스템을 구 축하는 것이다."}
{"patent_id": "10-2018-0071724", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여 본 발명은 자연의 처리의 수단인 '낱말 주머니[Bag of Words]' 방식을 통해 미리 법무상담에 필요한 예상 표현을 입력해서, 그 표현에 맞는 벡터값을 부여하고 축적하여 기계학습을 통해 학습시 킨 후 사용자가 상담을 시작하면서 입력하게 하여 입력한 값을 다시 학습된 결과에 맞춰 상담을 진행시켜 나가 도록 한다."}
{"patent_id": "10-2018-0071724", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "현재 법무상담은 대면상담, 전화상담, 온라인에서 양식을 제공하고 필요한 조건을 고정 또는 반고정된 양식을 제공하고 그 빈칸을 법무의 문외한인 일반인이 기입하도록 하는 형태에 머물러 있다. 대면상담, 전화상담은 1:1 형태로 시간과 공간의 제약이 뒤따르고, 그 밖에 컴퓨터 등에서 양식을 제공하고 기 입하게 하는 경우 일반인은 적절한 상담을 하지 못한 채 미심쩍지만 울며 겨자먹기식으로 입력하거나 다시 전화 상담 등을 통해 가이드를 받아가며 입력을 해야 하는 상황이어서 결국 1:1 상담과 유사한 형태로 돌아가게 된다. 자연어처리를 활용해서 상담을 인터렉티브하도록 구축하면 사용자인 의뢰인은 시간과 장소에 구애됨이 없이 또 는 ARS 상담하듯 정형화된 틀에서 진행되는 지루한 사용자경험에서 해방되어 진정한 상담을 통해 문제해결에 쉽 게 이르게 되어, 시간과 비용 및 정신적 스트레스를 훨씬 절감하게 된다. 본 발명에 의해 상담에 있어 자연어 처리를 손쉽게 구축하도록 하면 의뢰인에게 해법을 제공하는 전문가인 개인, 단체는 각 사정에 따라 자동화된 해법을 다양한 채널(가령 챗봇 또는 웹App)과 다양한 장치(스마트폰, 데 스크 톱 컴퓨터, 라즈베리 파이 등의 마이크로 컴퓨터 등)를 통해 서비스를 제공할 수 있어 최근 전 세계적인 관심을 이끄는 '리걸테크(Legal Tech)' 시장의 활성화를 통한 산업시장의 발전을 촉진할 수 있다."}
{"patent_id": "10-2018-0071724", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 기술적 사상을 명확히 하기 위해 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명 하도록 한다. 발명을 설명함에 있어서, 관련된 공지 기능 또는 구성요소에 대한 구체적인 설명이 본 발명의 요 지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략하기로 한다. 편의상 필요한 경우에는 장 치와 방법을 함께 서술하여 설명하도록 한다. 도면 1은 본 발명의 일 실시예에 의한 사용자(의뢰인)의 상담내용을 입력하면 자연어 처리를 통해 어떻게 상담 이 이뤄지는 지를 개괄적으로 설명한 구조도이다. 사용자의 입력이 있으면 상담을 담당하는 애플리케이션(상담 용App 또는 웹App)을 통해 입력된 내용을 인공지능이 자연어 처리를 하게 되며, 자연어 처리의 방법은 '낱말 주 머니[Bag of Words]'이다. 도면 2는 본 발명의 일 실시예에 의한 자연어 처리의 방법으로 '낱말 주머니[Bag of Words]'의 내용을 이해하기 쉽게 개념으로 설명한 도면이다. 일 실시예에 의하면 '낱말 주머니[Bag of Words]'의 단어를 수용할 수 있는 범 위는 100만개로 하였으며, \"1000만 어절의 말뭉치를 이용하여 한국어의 총 단어를 추정한 결과 1,062,392개로 추정되었으며 한국사람 이름의 개수는 1,493,003개로 추정되었다.\"는 \"인공지능 : 말뭉치를 이용한 한국어 단어 개수 측정(김성기, 한근식 저)\"이라는 논문를 참조하였다. 도면 3은 도면 2의 개념도를 좀 더 구체적인 예를 들어 '낱말 주머니[Bag of Words]'를 통해 어떻게 형태소별로 회수를 산출하여 기계학습으로 훈련을 시킬 것인지 이해를 돕기위한 표현한 도면이다. 도면 4는 본 발명의 일 시실예에 의한 말뭉치를 입력하는 방법에 관한 것이다. 바람직하게는 우선 '금전(소비) 대차계약서'를 기준으로 하였으나, '낱말 주머니[Bag of Words]' 방식에 의한 자연어 처리는 '금전(소비)대차계 약서' 작성을 위한 내용 입력으로 제한되지 않는다. 도면 4는 말뭉치를 다양하게 입력해서 입력한 사용자의 의 도를 추출하기 위해 훈련용으로 다양한 표현을 입력하는 모습을 구현한 도면이다. 도면 5는 도면 4와 같이 입력한 말뭉치에서 각 형태소별로 유사한 카테고리를 갖는 것들을 구분하여 기계가 학 습이 가능하도록 구현될 것인지를 설명하기 위한 도면인데, 이해를 돕기 위해 유사한 카테고리에 속하는 내용은 같은 색깔로 구분하였다. 동일한 색깔에 위치한 값들은 '오늘', '내일'과 같은 한글 표현과 '2018년 XX월 XX 일'과 같은 달력형태의 표현을 동일한 'Date'로 인식하게 훈련을 시키고 그 값을 나타내도록 한다. 도면 6은 상담을 위해 사용자(의뢰인)이 입력하는 내용을 미리 기계학습을 통한 훈련을 일 실시예로 보이는 것으로서 '낱말 주머니[Bag of Words]' 형태의 기계학습을 통한 자연어 처리를 어떤 식으로 할 수 있는 지를 프로 그램을 통해 어떤 자료형태로 실시할 것인가를 표현한 예시이다. 일반적인 법률서식 작성 서비스(또는 사이트)에서 제공하는 상담 또는 서식 작성 방법은 도면 7과 도면 8의 형 태를 띄는 경우가 많고, 사용자는 미리 제공하고 있는 양식에 맞춰 검색을 하거나 묻는 질문에 제공되는 가이드 에 맞춰 불확실함에도 불구하고 일단 작성하게 되는 경우가 많다. 그리고 그런 불확실함 때문에 중도에 작성을 포기하거나 전화상담을 통해 작성을 하는 등의 처리를 하게 되어 '시스템'이 주는 장점인 '언제 어디서나 자유 롭게 편리한 도구로' 작성하는 사용자 경험을 놓치기 쉽다. 따라서 본 발명은 앞서 설명한 바와 같이 '오늘 홍길동과 2000만원을 빌려주는 조건으로 연이자 5%로 계약을 하 려고 해'라고 하면 '계약체결일', '차주', '원금', '이자' 등을 미리 입력해둔 '낱말 주머니[Bag of Words]' 방 식의 자연어 처리를 통해 사용자의 의도를 파악해서, 사용자의 능동적 표현을 적극적으로 수용하는 사용자 경험 을 제공하도록 상담서비스를 제공하는 방법 및 시스템을 구축하는 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2018-0071724", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면 1은 대표도로서 전체 상담의 프로세스가 진행되는 내용을 개괄한 도면이다. 도면 2는 낱말 주머니[Bag of Words]의 기본 구조를 설명한 내용이다.도면 3은 낱말 주머니[Bag of Words]의 일 실시예를 설명한 내용이다. 도면 4는 낱말 주머니에 해당할 말뭉치[Utterance]의 추가방식을 구현한 내용이다. 도면 5는 도면 4에서 추가된 각 말뭉치 속의 형태소가 어떻게 학습 될 것인지에 대한 구분을 표현한 도면이다. 도면 6은 도면 4에서 추가된 말뭉치들이 어떻게 컴퓨터에서 프로그램으로 구현될 때 표현 될 것인지에 대한 설 명을 돕기 위한 도면이다. 도면 7과 도면 8은 일반적인 양식을 제공하고 사용자(의뢰인)가 검색을 통해(도면 7) 빈 곳을 채우는 방식으로 직접 작성하는(도면 8) 불친절한 사용자경험의 예를 비교하기 위한 도면이다."}
