{"patent_id": "10-2023-0128255", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0045233", "출원번호": "10-2023-0128255", "발명의 명칭": "대규모 단말 연결을 위한 공간 스트림 모듈 기반의 매시브 MIMO 기지국", "출원인": "주식회사 크로스웍스", "발명자": "이상조"}}
{"patent_id": "10-2023-0128255", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부 무선장비(DU)(30)와의 접속을 제공하는 무선장비 접속부(110)와, 상기 무선장비 접속부(110)에서 제공받은데이터를 빔포밍 처리하는 디지털 빔포밍부(120)를 구비하는 빔포밍 모듈부재(100); 및 상기 디지털 빔포밍부(120)로부터 받은 데이터를 LOW-PHY 처리하는 LOW-PHY부(210)와, 외부의 다수 단말(UE)과상기 LOW-PHY부(210) 사이에서 RF 송수신을 제공하는 RF 송수신부(220)와, 상호 균일 배치된 상기 RF 송수신을위한 복수의 안테나(230)를 구비하는 복수의 공간 스트림 모듈부재(200);를 포함하여 구성되고, 상기 복수의 공간 스트림 모듈부재(200)는 기지국 하우징에서 상호 이격 불균일 배치된 것을 특징으로 하는 대규모 단말 연결을 위한 공간 스트림 모듈 기반의 매시브 MIMO 기지국."}
{"patent_id": "10-2023-0128255", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 복수의 공간 스트림 모듈부재(200)를 현장 상황에 대응하여 공간 다중화를 구성하게 설치 가능하도록 상기빔포밍 모듈부재(100)와 상기 복수의 공간 스트림 모듈부재(200)는 상호 분리 가능하도록 구성되고, 상기 매시브 MIMO 기지국의 현장 설치를 위해 상기 빔포밍 모듈부재(100)와 상기 복수의 공간 스트림 모듈부재(200)를 상호 연결하기 위한 복수의 접속 케이블 부재(300); 를 더 포함하여 구성되는 대규모 단말 연결을 위한 공간 스트림 모듈 기반의 매시브 MIMO 기지국."}
{"patent_id": "10-2023-0128255", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 복수의 공간 스트림 모듈부재(200)는 pTqR 안테나를 구성하고, 상기 매시브 MIMO 기지국은 n개의 상기 공간 스트림 모듈부재(200)를 상기 빔포밍 모듈부재(100)에 각각 연결하여 npTnqR 용량의 매시브 MIMO 기지국을 구성(이때, p, q, n은 모두 2 이상의 자연수)하는 것을 특징으로 하는대규모 단말 연결을 위한 공간 스트림 모듈 기반의 매시브 MIMO 기지국."}
{"patent_id": "10-2023-0128255", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 일반적으로 대규모 단말(UE)을 연결하기 위한 매시브 MIMO 기지국에 관한 것이다. 특히, 본 발명은 공 간 다중화에 맞추어서 다수의 안테나를 복수의 공간 스트림 모듈로 분리 구성하고 공간 스트림 모듈들을 현장 상 황에 맞게 상호 분균일 배치함으로써 디지털 빔포밍의 상호 커플링 문제와 불규칙 배열 문제를 개선할 수 있는 대규모 단말 연결을 위한 공간 스트림 모듈 기반의 매시브 MIMO 기지국에 관한 것이다. 본 발명에 따르면 매시브 MIMO 기지국에서 상호 커플링 문제와 불규칙 배열 문제를 개선할 수 있어 기지국 장비의 출력 사양에 따라 에너 지 낭비없이 효과적인 셀(cell) 설계가 가능해지는 장점이 있다. 또한, 본 발명에 따르면 다수 안테나 요소 간의 공명을 감소시킬 수 있어 대출력 매시브 MIMO 기지국을 구현할 수 있는 장점이 있다."}
{"patent_id": "10-2023-0128255", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 일반적으로 대규모 단말(UE)을 연결하기 위한 매시브 MIMO 기지국에 관한 것이다. 특히, 본 발명은 공간 다중화에 맞추어서 다수의 안테나를 복수의 공간 스트림 모듈로 분리 구성하고 공간 스트 림 모듈들을 현장 상황에 맞게 상호 분균일 배치함으로써 디지털 빔포밍의 상호 커플링 문제와 불규칙 배열 문 제를 개선할 수 있는 대규모 단말 연결을 위한 공간 스트림 모듈 기반의 매시브 MIMO 기지국에 관한 것이다."}
{"patent_id": "10-2023-0128255", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선통신에서 용량 개선을 위해 MIMO(다중입력 다중출력, Multiple-Input Multiple-Output) 기술이 도입되었다. MIMO는 기지국(Radio Unit, RU)과 단말(User Equipment, UE)에 복수의 안테나를 사용하는 스마트 안테나 기술이다. 예를 들면 기지국에 m개, 단말에 n개의 안테나를 설치하면 min(m, n)만큼 평균 무선전송 용량 을 증가시킬 수 있다.[도 1]과 [도 2]는 MIMO 기술의 개념도이다. [도 1]은 단말(UE)에서 기지국(RU)과 무선장비(Digital Unit, DU)로 무선신호를 전달하는 업링크(uplink) 채널을 나타내고, [도 2]는 무선장비와 기지국에 서 단말로 무선신호를 전달하는 다운링크(downlink) 채널을 나타낸다. MIMO 방식에서는 기지국과 단말 사이에 송수신 경로가 복수 개 존재한다. 기지국과 단말 사이의 공간 채널의 특성을 채널 상태 정보(Channel State Information, CSI)라고 부르 는데, 채널 상태 정보(CSI)는 안테나 어레이 간에 송수신되는 데이터를 디지털로 인코딩 및 디코딩하는 데에 사 용된다. 채널 상태 정보(CSI)로부터 검출 매트릭스와 프리코딩 매트릭스를 구하여 업링크와 다운링크에 서 활용한다. 단말이 대량 접속하는 환경이 증가함에 따라 MIMO 기술은 매시브 MIMO(massive MIMO, mMIMO)로 발전하였다. 일 반적으로 4G 통신에서는 2~4개의 안테나를 사용하였고 5G 통신에서는 100개 정도의 안테나를 사용하였는데, 5G 매시브 MIMO에서는 수백 개의 안테나를 사용한다. MIMO 기술에서는 빔포밍(beamforming)이 중요하다. 빔포밍은 단말과 기지국 양쪽에서 안테나 여러 개로 공급되는 무선신호의 진폭과 위상을 변화시켜 특정 방향으로 무선신호를 집중시키는 기술이다. 전파를 특정 위 치로 집중해 빔(beam)을 만들어 무선 송수신 효율을 높이는 기술이다. 초기에는 아날로그 빔포밍 기술이 주류를 이루었는데, 점차로 기술이 진화하면서 디지털 빔포밍 기술이 탑재되고 있다. 디지털 빔포밍 방식에서는 각각의 안테나가 자체 송수신기 및 데이터 변환기를 갖추고 데이터 스트림을 독립적 으로 처리한다. 안테나의 송신기는 각자 개별적으로 계산한 경로 스트림으로 수신기의 적용 범위를 최적화하는 데, 이렇게 형성되는 다수의 무선전송 경로에 의해 공간 다중화(spatial multiplexing)가 이루어진다. 무선통신이 보편화됨에 따라 대규모 단말(UE)이 접속할 수 있는 고성능 고효율의 매시브 MIMO 기지국이 요구되 고 있다. 매시브 MIMO 기지국은 다수의 안테나(예: 수십 개)를 탑재하는데, 다수의 안테나에 디지털 빔포밍 기 술을 적용하면 상호 커플링(mutual coupling) 문제와 불규칙 배열(irregular arrays) 문제가 발생한다. [도 3]은 종래의 매시브 MIMO 기지국에서 상호 커플링 문제와 불규칙 배열 문제가 발생하는 예시도이다. 매시브 MIMO 기지국에서 안테나들 간의 이격이 좁아짐에 따라 안테나 간에 상호 공명이 발생하여 안테나 요 소 간의 상호 결합(상호 커플링)에 의해 에너지 손실이 발생하고 그에 따라 셀(cell)의 최대 범위가 좁아지는 현상이 발생하는데, 이를 상호 커플링 문제라고 부른다. 상호 커플링 문제를 완화하려면 기지국의 물리적 크기를 늘리거나 안테나 갯수를 줄여야 한다. 또한, 매시브 MIMO 기지국에서 여러 안테나의 파형들이 합쳐지는 경우에 일부 안테나 어레이는 비 기하학적 형태로 안테나 파형을 형성하게 되고 그에 따라 일부 방향으로는 에너지가 소실되어 무선통신이 이루어지지 않 는 현상이 발생하는데, 이를 불규칙 배열 문제라고 부른다. 이러한 상호 커플링 문제와 불규칙 배열 문제는 매시브 MIMO 기지국의 성능을 제약한다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 10-2022-0042291호 \"대규모 MIMO 시스템에서의 전송 방법 전환 방법 및 디 바이스\" (특허문헌 0002) 대한민국 공개특허 10-2022-0103124호 \"무선통신 시스템에서 인공지능 기반의 빔 관리 방법 및 이에 대한 장치\" (특허문헌 0003) 대한민국 공개특허 10-2021-0042717호 \"무선통신 시스템에서 인공지능을 활용한 신호 송수신 방법 및 장치\""}
{"patent_id": "10-2023-0128255", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 일반적으로 대규모 단말(UE)을 연결하기 위한 매시브 MIMO 기지국을 제공하는 것이다. 특히, 본 발명의 목적은 공간 다중화에 맞추어서 다수의 안테나를 복수의 공간 스트림 모듈로 분리 구성하고 공 간 스트림 모듈들을 현장 상황에 맞게 상호 분균일 배치함으로써 디지털 빔포밍의 상호 커플링 문제와 불규칙 배열 문제를 개선할 수 있는 대규모 단말 연결을 위한 공간 스트림 모듈 기반의 매시브 MIMO 기지국을 제공하는 것이다. 본 발명의 해결 과제는 이 사항에 제한되지 않으며 본 명세서의 기재로부터 다른 해결 과제가 이해될 수 있다."}
{"patent_id": "10-2023-0128255", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위하여 본 발명은 대규모 단말 연결을 위한 공간 스트림 모듈 기반의 매시브 MIMO 기지 국을 개시한다. 본 발명에 따른 공간 스트림 모듈 기반의 매시브 MIMO 기지국은, 외부 무선장비(DU)와의 접속을 제공하는 무선장비 접속부와, 무선장비 접속부에서 제공받은 데이터를 빔포밍 처리하는 디지털 빔포밍부 를 구비하는 빔포밍 모듈부재; 및 디지털 빔포밍부로부터 받은 데이터를 LOW-PHY 처리하는 LOW-PHY부 와, 외부의 다수 단말(UE)과 LOW-PHY부 사이에서 RF 송수신을 제공하는 RF 송수신부와, 상호 균 일 배치된 RF 송수신을 위한 복수의 안테나를 구비하는 복수의 공간 스트림 모듈부재;를 포함하여 구 성되고, 복수의 공간 스트림 모듈부재는 기지국 하우징에서 상호 이격 불균일 배치된다. 이때, 복수의 공간 스트림 모듈부재를 현장 상황에 대응하여 공간 다중화를 구성하게 설치 가능하도록 빔 포밍 모듈부재와 복수의 공간 스트림 모듈부재는 상호 분리 가능하도록 구성된다. 이때, 본 발명에 따른 공간 스트림 모듈 기반의 매시브 MIMO 기지국은, 매시브 MIMO 기지국의 현장 설치를 위해 빔포밍 모듈부재 와 복수의 공간 스트림 모듈부재를 상호 연결하기 위한 복수의 접속 케이블 부재;를 더 포함하 여 구성된다. 본 발명에 따른 공간 스트림 모듈 기반의 매시브 MIMO 기지국에서 복수의 공간 스트림 모듈부재는 pTqR 안 테나를 구성하고, n개의 공간 스트림 모듈부재를 빔포밍 모듈부재에 각각 연결하여 npTnqR 용량의 매 시브 MIMO 기지국을 구성한다(이때, p, q, n은 모두 2 이상의 자연수)."}
{"patent_id": "10-2023-0128255", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 매시브 MIMO 기지국에서 상호 커플링 문제와 불규칙 배열 문제를 개선할 수 있어 기지국 장비 의 출력 사양에 따라 에너지 낭비없이 효과적인 셀(cell) 설계가 가능해지는 장점이 있다. 또한, 본 발명에 따르면 다수 안테나 요소 간의 공명을 감소시킬 수 있어 대출력 매시브 MIMO 기지국을 구현할 수 있는 장점이 있다."}
{"patent_id": "10-2023-0128255", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명을 상세하게 설명한다. 본 발명을 설명함에 있어서 종래기술과 중복되는 부분에 대해서는 자세한 설명을 생략할 수 있다. [도 4]는 본 발명에 따른 공간 스트림 모듈 기반의 매시브 MIMO 기지국의 전체 구성도이다. [도 4]를 참조하면, 본 발명에 따른 매시브 MIMO 기지국은 빔포밍 모듈부재와 복수의 공간 스트림 모듈부재, 그리고 이들을 연결하는 접속 케이블 부재를 포함하여 구성된다. 빔포밍 모듈부재는 무선장비 접속부와 디지털 빔포밍부를 구비한다. 무선장비 접속부는 외부 무선장비(DU)와의 접속(인터페이스)을 제공하는 구성요소이고, 디지털 빔포밍 부는 무선장비 접속부에서 제공받은 데이터를 빔포밍 처리하는 구성요소이다. 무선장비 접속부는 매시브 MIMO 기지국과 무선장비(DU)와의 인터페이스를 제공하는데, 예를 들 어 CPRI(Common Public Radio Interface, 공용 무선 인터페이스) 또는 eCPRI(Enhanced CPRI)로 구현될 수 있다. 디지털 빔포밍부는 매시브 MIMO 기지국에 디지털 빔포밍을 구현하기 위한 요소이다. 각각의 공간 스트림 모듈부재(200:1 ~ 200:n)는 LOW-PHY부, RF 송수신부, 복수의 안테나를 구 비한다. LOW-PHY부는 디지털 빔포밍부로부터 받은 데이터를 LOW-PHY 처리하는 구성요소이고, RF 송수신부 는 외부의 다수 단말(UE)과 LOW-PHY부 사이에서 RF 송수신을 제공하는 구성요소이다. 공간 스트림 모 듈부재는 RF 송수신을 위하여 복수의 안테나를 균일 배치하였다. 그리고, 본 발명에서 이들 복수의 공간 스트림 모듈부재(200:1 ~ 200:n)는 매시브 MIMO 기지국의 하우징 에서 상호 이격되고 불균일하게 배치되어 있다. [도 5]는 본 발명에서 공간 스트림 모듈부재의 개념도이다. [도 5] (a)는 종래의 매시브 MIMO 기지국에서 대용량 MIMO를 위한 매시브 안테나를 획일적으로 구현하는 예 시도이다. 96T96R 사양의 매시브 MIMO 기지국에서 48개의 안테나를 16 x 6으로 균일하게 정렬 배치하였다. 한편, [도 5]에서 안테나 부품 하나는 +45도 편파안테나와 -45도 편파안테나가 합쳐진 것이므로 2T2R에 해당한 다. 따라서, 48개의 안테나 부품으로 이루어진 매시브 MIMO는 96T96R에 해당한다. 세로 연결된 3개의 안테나 부 품이 1:3 안테나를 형성하는 구현이라면 매시브 MIMO 기지국은 96T96R 사양이 아니라 32T32R 사양이 된다. 편의상, 본 명세서에서는 매시브 MIMO 기지국은 96T96R 사양이라고 가정하여 기술한다. [도 5] (b)는 본 발명에서 96T96R 사양의 매시브 MIMO 기지국을 구성함에 있어서 각자 12개의 안테나를 탑재하는 4개의 공간 스트림 모듈부재(200:1 ~ 200:n)를 활용하는 예시도이다. 각각의 공간 스트림 모듈부재 에 탑재된 12개의 안테나는 8 x 3으로 균일하게 정렬 배치되어 있는 반면, 이들 4개의 공간 스트림 모듈부 재(200:1 ~ 200:n)는 각자 다른 방향을 바라보고 있어 상호 이격되고 불균일하게 배치되어 있다. 종래에는 대용량 MIMO 기지국을 위한 매시브 안테나를 [도 5] (a)와 같이 일체형으로 구성하고 획일적으로 배열하는 것이 당연하다고 생각해왔다. 반면, 본 발명에서는 대용량 MIMO 기지국을 위한 매시브 안테나를 [도 5] (b)와 같이 복수의 공간 스트림 모듈부재(200:1 ~ 200:n)로 분리하고 기지국을 설치할 현장 상황(예: 넓은 회의실, 구획이 나누어진 쇼핑몰, 엄 폐물이 가로막거나 통로 가이드가 존재하는 갈림길)에 맞게 이들 공간 스트림 모듈부재(200:1 ~ 200:n)를 설치 하는 접근을 시도한다. 매시브 MIMO 기술의 본질은 다수의 안테나가 각각 자신만의 스트림을 갖고 독립적으로 송수신함에 따라 공간 다 중화를 이루는 것이 핵심이다. 본 발명은 이러한 매시브 MIMO 기술의 본질에 충실한 구성이다. 매시브 안테나를 종래기술처럼 획일적으로 배치하지 않고, 기지국이 설치되는 장소에 따라 공간 다중화가 양호하게 구현될 수 있 는 배치를 하려는 것이다. 본 발명에서는 복수의 공간 스트림 모듈부재는 pTqR 안테나를 구성하고, 매시브 MIMO 기지국은 n개 의 공간 스트림 모듈부재를 빔포밍 모듈부재에 각각 연결하여 npTnqR 용량의 매시브 MIMO 기지국을 구성(이때, p, q, n은 모두 2 이상의 자연수)한다. 예를 들어, 96T96R 매시브 MIMO 기지국의 경우라면 24T24R로 구성한 4개의 공간 스트림 모듈부재(200:1 ~ 200:4)를 연결하여 구성할 수 있다. 이때, 각각의 공간 스트림 모듈부재에 탑재된 12개의 안테나는 균일하게 정렬 배치(예: 8 x 3)되고, 이들 4개의 공간 스트림 모듈부재(200:1 ~ 200:4)는 상호 이격되고 불균일하게 배치되어 공간 다중화를 이룬다. [도 6]은 본 발명에서 상호 커플링 문제와 불규칙 배열 문제가 개선되는 예시도이다. [도 6] (a)는 종래의 매시 브 MIMO 기지국에서 상호 커플링 문제와 불규칙 배열 문제가 발생하는 예시도이다. [도 6] (b)는 본 발명의 매시브 MIMO 기지국에서 복수의 공간 스트림 모듈부재(200:1 ~ 200:n)를 상호 이격 불균일 배치함에 따라 상호 커플링 문제와 불규칙 배열 문제가 개선되는 예시도이다. 본 발명에 따르면 상호 커플링 문제를 개선할 수 있다. 종래기술에서는 매시브 안테나를 획일적으로 배치함에 따라 다수 안테나 요소 상호 간에 공명이 발생하였다. 반면, 본 발명에서는 여러 개의 공간 스트림 모듈부재 (200:1 ~ 200:n)로 이격하여 구성함으로써 안테나 요소 간의 상호 결합으로 인한 에너지 손실 발생을 줄이고 셀 의 최대 범위가 줄어드는 것을 개선할 수 있다. 이처럼 안테나 요소들 간의 공명을 억제할 수 있음에 따라 대출 력 매시브 MIMO 기지국을 구현하는 것도 가능해졌다. 또한, 본 발명에 따르면 불규칙 배열 문제를 개선할 수 있다. 안테나의 파형이 겹쳐져서 일부 안테나 어레이에 서 비 기하학적 형태로 안테나 파형이 형성되는 경우에는 공간 스트림 모듈부재(200:1 ~ 200:n)의 이격 정도 및 배치를 조정함으로써 일부 방향으로 에너지가 소실되는 일 없이 최대한의 안테나 파형을 형성하도록 할 수 있다. 한편, 본 발명에서는 복수의 공간 스트림 모듈부재를 현장 상황에 대응하여 공간 다중화를 구성하게 설치 가능하도록 빔포밍 모듈부재와 복수의 공간 스트림 모듈부재는 상호 분리 가능하도록 구성된다. 공간 스트림 모듈부재들(200:1 ~ 200:n)을 현장 상황에 맞게 x축, y축, z축으로 회전 및 이격하여 배치하여 각 현장별 케이스의 다양한 공간 다중화(spatial multiplexing)를 구현할 수 있어야 한다. 각각의 공간 스트림 모 듈부재(200:1 ~ 200:n)는 각 안테나만의 스트림을 더 양호하게 받기 위해서 알맞게 설치할 수 있는 것이 바람직 하다. 예를 들어, 일반적인 넓은 회의실의 경우에는 단순히 안테나만 서로 떨어뜨리는 x축으로 이격하거나 혹은 안테나들 상호간에 서로 안보도록 상호 반대방향으로 약간의 5도, 10도 y축 회전 혹은 z축 회전을 해주어 배치 함으로써 안테나 요소 상호 간의 공진을 감소시켜 성능을 개선할 수 있다. 또한, 안테나 파형이 여러 개 겹쳐짐 에 따라 통신 상태가 불량한 공간이 발생할 수 있는데, 공간 스트림 모듈부재(200:1 ~ 200:n)를 3차원으로 적절 히 이격하여 배치함으로써 전파수신 불량지역을 개선할 수 있다. 이를 위해, 매시브 MIMO 기지국에서 빔포밍 모듈부재와 복수의 공간 스트림 모듈부재는 상호 분리 가능하도록 구성하여 유연하게 설치할 수 있도록 한다. 이 경우에는 매시브 MIMO 기지국의 현장 설치를 위 해 빔포밍 모듈부재와 복수의 공간 스트림 모듈부재를 상호 연결하기 위한 접속 케이블 부재가 필요하다. [도 7]은 종래의 매시브 MIMO 기지국의 빔포밍 예시도이고, [도 8]은 본 발명에 따른 매시브 MIMO 기지국 의 빔포밍 예시도이다. [도 7]과 [도 8]의 비교로부터 본 발명에 의하면 공간 다중화(spatial multiplexing)가 훨씬 양호하게 달성되는 것을 확인할 수 있다."}
{"patent_id": "10-2023-0128255", "section": "도면", "subsection": "도면설명", "item": 1, "content": "[도 1]은 MIMO 기술에서 업링크 채널의 개념도. [도 2]는 MIMO 기술에서 다운링크 채널의 개념도. [도 3]은 상호 커플링 문제와 불규칙 배열 문제의 예시도. [도 4]는 본 발명에 따른 공간 스트림 모듈 기반의 매시브 MIMO 기지국의 전체 구성도. [도 5]는 본 발명에서 공간 스트림 모듈부재의 개념도. [도 6]은 본 발명에서 상호 커플링 문제와 불규칙 배열 문제가 개선되는 예시도. [도 7]은 종래의 매시브 MIMO 기지국의 빔포밍 예시도. [도 8]은 본 발명에 따른 매시브 MIMO 기지국의 빔포밍 예시도."}
