{"patent_id": "10-2022-0180387", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0098537", "출원번호": "10-2022-0180387", "발명의 명칭": "인공지능 기반 비접촉 다중 생체신호 측정 장치 및 방법", "출원인": "(주)보템", "발명자": "김동철"}}
{"patent_id": "10-2022-0180387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 기반 비접촉 다중 생체신호 측정 장치에 있어서, 사용자의 심전도, 심박수, 호흡수 및 부정맥을 검출하는 제1센서;상기 사용자의 산소포화도를 검출하는 제2센서;상기 사용자의 혈압을 검출하는 제3센서; 및상기 제1센서, 상기 제2센서 및 상기 제3센서로부터 수신한 다중 생체 신호를 기반으로 상기 사용자의 감성 데이터, 건강 데이터 및 병증 데이터를 산출하는 인공지능 모델, 을 포함하되, 상기 인공지능 모델은, 상기 다중 생체 신호에 포함되는 복수의 생체 신호 각각에 따른 개인의 감성 상태, 건강 상태 및 병증 상태에대한 실측 데이터를 기반으로 학습되는 딥 러닝 모델인 것인, 인공지능 기반 비접촉 다중 생체신호 측정 장치."}
{"patent_id": "10-2022-0180387", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기반 비접촉 다중 생체신호 측정 장치에 관한 것이며, 인공지능 기반 비접촉 다중 생체신호 측정 장치 는, 사용자의 심전도, 심박수, 호흡수 및 부정맥을 검출하는 제1센서, 상기 사용자의 산소포화도를 검출하는 제2 센서, 상기 사용자의 혈압을 검출하는 제3센서 및 상기 제1센서, 상기 제2센서 및 상기 제3센서로부터 수신한 다 중 생체 신호를 기반으로 상기 사용자의 감성 데이터, 건강 데이터 및 병증 데이터를 산출하는 인공지능 모델을 포함하되, 상기 인공지능 모델은, 상기 다중 생체 신호에 포함되는 복수의 생체 신호 각각에 따른 개인의 감성 상태, 건강 상태 및 병증 상태에 대한 실측 데이터를 기반으로 학습되는 딥 러닝 모델인 것일 수 있다."}
{"patent_id": "10-2022-0180387", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 인공지능 기반 비접촉 다중 생체신호 측정 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0180387", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "디지털 헬스케어는 의료 서비스의 효율성과 정밀성을 높이기 위해 개인화된 건강관리 데이터의 수집 및 관리를 주요 기반으로 한다. 디지털 헬스케어 기술에는 원격의료, 웨어러블 기기, 증강현실 및 가상현실을 비롯한 하드 웨어와 소프트웨어 솔루션과 서비스를 포함하는 것을 의미한다. 이중 웨어러블 기기는 스마트워치, 바디웨어, 스마트 임플란트 등의 다양한 형태의 기기를 포함할 수 있으며, 시간과 공간의 제약 없이 환자에 대한 건강 관련 데이터를 수집할 수 있는 효율적인 수단으로 인식되어 있다. 이러한 웨어러블 기기는 기본적으로 접촉식 센서를 이용하며, 이머한 접촉식 센서는 신체 내부로의 삽입 유무에 따라 크게 침습 또는 비침습 방식으로 구분될 수 있다. 반면, 비접촉식 센서는, 인체의 움직임, 감정 및 상황 등의 활동 신호와, 생체 신호를 모니터링 함에 있어, 유 선 연결이나 착용이 불필요한 것으로, 사용자 친화적이며, 감염병이나 피부 이상 등의 문제에 있어 보다 안전한 측정을 수행할 수 있다. 한편, 환자감시장치(Patient Monitor)란, 센서를 이용하여 환자의 심장의 활동성, 혈압, 혈중 산소 포화도, 체 온 등의 생체 신호를 지속적으로 모니터링 하여 환자의 상태를 실시간으로 표시하는 것으로, 병동이나 회복실에 서 환자의 생체 신호를 지속적으로 관찰하거나 응급실, 중환자실 및 수술실 등에서 의학적 조치를 취하는 동안 환자의 상태 변화 등을 측정하기 위해 사용된다. 본원의 배경이 되는 기술은 한국공개특허공보 제10-2022-0101468호에 개시되어 있다."}
{"patent_id": "10-2022-0180387", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 비접촉식 복합 센서를 이용하여 환자감시를 수행 함으로써, 환자의 일상 생활 중에도 이상 및 위험을 모니터링 및 경보할 수 있는 인공지능 기반 비접촉 다중 생체신호 측정 및 처리 시스템 및 방법을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0180387", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 인공지능 기반 비접촉 다중 생체신호 측정 장치는, 사용자의 심전도, 심박수, 호흡수 및 부정맥을 검출하는 제1센서, 상기 사용자의 산소포 화도를 검출하는 제2센서, 상기 사용자의 혈압을 검출하는 제3센서 및 상기 제1센서, 상기 제2센서 및 상기 제3 센서로부터 수신한 다중 생체 신호를 기반으로 상기 사용자의 감성 데이터, 건강 데이터 및 병증 데이터를 산출 하는 인공지능 모델을 포함하되, 상기 인공지능 모델은, 상기 다중 생체 신호에 포함되는 복수의 생체 신호 각 각에 따른 개인의 감성 상태, 건강 상태 및 병증 상태에 대한 실측 데이터를 기반으로 학습되는 딥 러닝 모델인 것일 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2022-0180387", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 비접촉식 복합 센서를 이용하여 환자감시를 수행함으로써, 환자의 일 상 생활 중에도 이상 및 위험을 모니터링 및 경보할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2022-0180387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 인공지능 기반 비접촉 다중 생체신호 측정 및 처리 시스템 및 방법에 관한 것이다. 보다 구체적으로, 본원은 심전도, 산소포화도, 혈압 및 체온 등을 포함하는 다중 생체 신호를 비접촉식을 검출 하고, 인공지능 알고리즘을 기반으로 검출한 다중 생체 신호를 처리 및 분석하여, 환자 개인의 감성, 건강상태 및 병증 등을 판단할 수 있는 스마트 헬스케어 장치에 대한 것이다. 또한, 본원은 심전도, 산소포화도, 혈압 및 체온 등의 생체 신호를 측정하기 위한 비접촉식 센서를 포함하고, 각각의 생체 신호의 처리 및 분석을 통한 사용자의 건강 상태 알림 서비스를 제공할 수 있는 스마트 헬스케어장치에 대한 것이다. 도 1 및 도 2는 본원의 일 실시예에 따른 인공지능 기반 비접촉 다중 생체신호 측정 및 처리 시스템 의 개략적 인 구성도이다. 또한, 도 3은 본원의 일 실시예에 따른 인공지능 기반 비접촉 다중 생체신호 측정 및 처리 시스템의 복합 센서 를 포함하는 웨어러블 장치를 나타내는 도면이다. 도 1을 참조하면, 인공지능 기반 비접촉 다중 생체신호 측정 및 처리 시스템은 웨어러블 장치, 사용자 단말 및 클라우드 서버를 포함할 수 있다. 본원의 일 실시예에 따르면, 웨어러블 장치 및 사용자 단말은 양방향 통신을 할 수 있고, 사용자 단말은 클라우 드 서버로 망통신을 통해 데이터를 전송할 수 있으나, 이에 한정되는 것은 아니다. 다시 말해, 웨어러블 장치와 사용자 단말, 사용자 단말 및 클라우드 서버는 네트워크를 통해 통신 가능한 것일 수 있다 . 이러한 네트워크는 예시적으로, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 유무선 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 블루투스(Bluetooth) 네트워크, Wifi 네트워크, NFC(Near Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등을 포함하는 것일 수 있으나, 이에 한정된 것은 아니다. 또한, 사용자 단말은 예시적으로, 스마트폰(Smartphone), 스마트패드(Smart Pad), 태블릿 PC, 웨어러블 디바이 스 등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말기 같은 모든 종류의 무선 통신 장치 및 데스크탑 컴퓨터, 스마트 TV와 같은 고정용 단말기일 수도 있다. 도 2를 참조하면, 웨어러블 장치는 복수의 생체 신호를 측정하고, 처리하는 것일 수 있다. 구체적으로, 본원의 일 실시예에 따른 인공지능 기반 비접촉 다중 생체신호 측정 및 처리 시스템의 웨어러블 장 치는, 검출부, 처리부, 생성부, 판단부 및 경보부를 포함할 수 있다. 본원의 일 실시예에 따르면, 검출부는, 비접촉식 복합 센서로부터 사용자의 복수의 생체신호를 검출할 수 있다. 복수의 생체신호는, 예시적으로, 심박수, 혈압, 호흡, 체온 및 산소포화도를 포함할 수 있으나, 이에 한정되는 것은 아니다. 구체적으로, 웨어러블 장치는, 사용자의 심전도, 심박수, 호흡수 및 부정맥을 검출할 수 있는 제1센서, 사용자 의 산소포화도를 검출할 수 있는 제2센서 및 사용자의 혈압을 검출할 수 있는 제3센서를 포함할 수 있다. 본원의 일 실시예에 따르면, 제1센서는, 심전도(ECG )의 Lead I(RA-LA), Lead II(RA-LL), Lead III(LA-LL), Lead aVR, Lead aVL 및 Lead aVF의 5-channel 측정이 가능한 것일 수 있다. 또한, 제2센서는, 광센서를 이용한 산소포화도(SpO2)를 측정할 수 있는 센서로, SpO2 파형을 측정할 수 있는 것 일 수 있다. 제2센서는 발광센서 전류 제어부 회로, 수광센서 전류 검출부 회로, 아날로그 필터 회로 및 16bit/3V/100sps 이상의 ADC 선정 및 연결회로를 포함하는 것일 수 있다. 또한, 제3센서는, 15V 미만에서 동작 가능한 0~300mmHg 가압 모터펌프, 15V 미만에서 동작 가능한 0~300mmHg 가 압 밸브, 15V 미만에서 동작 가능한 0~300mmHg 측정 압력센서, 모터펌프, 밸브, 압력센서 제어회로 및 아날로그 필터 회로 등을 포함하며, 오실로메트릭 측정법을 이용한 혈압측정 알고리즘을 통해, 혈압(NIBP)을 측정하는 것 일 수 있다. 또한, 제1센서, 제2센서 및 제3센서는 하나의 비접촉식 복합 센서에 포함되는 것일 수 있다. 다시 말해, 검출부 는, 제1센서, 제2센서 및 제3센서를 포함하는 비접촉식 복합 센서로부터 복수의 생체 신호를 검출하는 것일 수 있다. 본원의 일 실시예에 따르면, 처리부는, 인공지능 알고리즘을 기반으로 복수의 생체신호를 처리할 수 있다. 구체적으로, 처리부는, 심박수, 혈압, 호흡, 체온 및 산소포화도를 포함하는 복합생체신호의 처리를 수행하는 것으로, SoC가 적용된 것일 수 있다. 또한, 생체신호 처리기술은 Mid-tech로 개발되는 것일 수 있다. 또한, 생성부는, 처리부에서 처리된 복수의 생체신호에 기초하여 사용자의 건강 상태 데이터를 생성할 수 있다. 구체적으로, 생성부는, 제1센서, 제2센서 및 제3센서로부터 수신되고, 처리부에 처리된 다중 생체 신호(또는 복 합생체신호)를 기반으로 사용자의 감성 데이터, 건강 데이터 및 병증 데이터를 산출하는 인공지능 모델을 포함 하는 것일 수 있다. 다시 말해, 건강 상태 데이터는, 감성 데이터, 건강 데이터 및 병증 데이터를 포함하는 것 일 수 있다. 본원의 일 실시예에 따르면, 인공지능 모델은, 다중 생체 신호에 포함되는 복수의 생체 신호 각각에 따른 개인 의 감성 상태, 건강 상태 및 병증 상태에 대한 실측 데이터를 기반으로 학습되는 딥 러닝 모델일 수 있다. 본원의 일 실시예에 따르면, 판단부는, 건강 상태 데이터를 기반으로 사용자의 경보 단계를 판단할 수 있다. 구 체적으로, 판단부는, 심박수, 혈압, 호흡, 체온 및 산소포화도와, 사용자의 의식수준을 함께 고려하여 사용자의 위험 단계를 정상, 경증 및 중증으로 분류할 수 있다. 다시 말해, 판단부는, 심박수, 혈압, 호흡, 체온 및 산소포화도 등의 파라미터들을 분석하여 위험 단계를 분류 할 수 있다. 위험 단계의 기준은 하기 표 1을 기준으로 결정될 수 있으며, 각각의 생체신호 측정값(파라미터)에 따라 각각의 위험 점수를 합산하고, 합산된 값이 0이면 정상 단계, 1이면 경증 단계, 2이면 중증 단계로 위험 단계를 분류할 수 있다. 표 1"}
{"patent_id": "10-2022-0180387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한, 경보부는, 경보 단계가 미리 설정된 위험 단계 이상의 단계라면, 위험 경보를 제공할 수 있다. 예를 들어, 경보부는, 위험 단계가 경증 및 중증이면, 의료진의 방문 또는 진단이 필요한 것으로 판단되어 위험 경보 를 제공하는 것일 수 있다. 인공지능 기반 비접촉 다중 생체신호 측정 방법은 앞서 설명된 인공지능 기반 비접촉 다중 생체신호 측정 시스 템에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 인공지능 기반 비접촉 다중 생체신호 측정 시스템에 대하여 설명된 내용은 인공지능 기반 비접촉 다중 생체신호 측정 방법에 대한 설명에도 동일하게 적용될 수 있다. 본원의 일 실시 예에 따른 인공지능 기반 비접촉 다중 생체신호 측정 방법은 다양한 컴퓨터 수단을 통하여 수행 될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예 에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해 서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 인공지능 기반 비접촉 다중 생체신호 측정 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그램 또는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2022-0180387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2022-0180387", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 도 2는 본원의 일 실시예에 따른 인공지능 기반 비접촉 다중 생체신호 측정 및 처리 시스템 의 개략적 인 구성도이다. 도 3은 본원의 일 실시예에 따른 인공지능 기반 비접촉 다중 생체신호 측정 및 처리 시스템 의 복합 센서를 포 함하는 웨어러블 장치를 나타내는 도면이다."}
