{"patent_id": "10-2023-0130758", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0046818", "출원번호": "10-2023-0130758", "발명의 명칭": "XAI를 이용한 선형 이송 로봇의 고장 진단 방법", "출원인": "주식회사 나인벨", "발명자": "이영대"}}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "(a) 정상상태의 로봇과 비정상상태의 로봇을 준비하고, 상기 로봇들에 부착된 센서로부터 정상 또는 비정상 신호 데이터를 각각 수집하는 단계;(b) 상기 수집된 정상 또는 비정상 신호 데이터를 전처리(Preprocessing)하여 시간과 주파수 성분으로 변환하는단계;(c) 상기 변환된 정상 또는 비정상 신호 데이터에서 추출된 특징에 따라 로봇의 고장 분류표를 구성하는 단계;(d) 상기 변환된 정상 또는 비정상 신호 데이터를 로봇의 고장 분류표에 따라 레이블링한 후, 레이블링된 정상또는 비정상 신호 데이터를 1D-CNN(one dimensional Convolutional Neural Network) 또는 2D-CNN(twodimensional Convolutional Neural Network) 모듈에 입력하여 학습시키는 단계;(e) 상기 학습이 완료되면 1D-CNN 모듈 및 2D-CNN 모듈을 통해 각각 다른 특성을 추출하고 학습하며, 이를 통해이상 상태(고장)의 유무와 고장 분류표에 따라 고장의 종류를 분류하는 단계; 및(f) 상기 2D-CNN 모듈은 Grad-CAM을 이용하고, 1D-CNN 모듈은 FFT-CAM 및 FG-CAM을 이용하여 분류 결과를 시각화함으로써 주파수 영역에서의 예측 결과를 설명하는 단계;를 포함하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법."}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 단계 (a)에서 수집된 정상 또는 비정상 신호 데이터는,가속도 센서를 이용하여 수집한 진동 신호 데이터; 및 토크 센서를 이용하여 수집한 토크 신호 데이터;를 포함하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법."}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 단계 (b)에서 정상 또는 비정상 신호 데이터의 전처리는,STFT(Short-Time Fourier Transform) 및 스펙트로그램(Spectrogram) 변환을 통해 수행되는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법."}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 STFT는 하기 수식에 따라 수행되는 것을 특징으로 하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법.(여기서, w는 윈도우 함수를 나타내고, 상기 τ는 윈도우 지연시간을 나타낸다.)"}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2025-0046818-3-제 3 항에 있어서,상기 스펙트로그램은 STFT한 결과에서 의 값을 시간 축과 주파수 축의 2차원으로 시각화한 후 진폭을 색깔이나명암으로 표시하는 것을 특징으로 하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법."}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 단계 (c)에서 로봇의 고장 분류표는,N(정상), LR-H(심각한 리니어 레일 미스얼라인먼트), LR-M(덜 심각한 리니어 레일 미스얼라인먼트), BS-H(심각한 볼 스크류 미스얼라인먼트), BS-M(덜 심각한 볼 스크류 미스얼라인먼트)의 5종으로 분류되는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법."}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 단계 (d)에서 1D-CNN 모듈은 시간 영역의 원시 신호를 사용하여 학습하고, 2D-CNN 모듈은 전이학습(Transfer Learning)을 이용하여 특징 추출기의 가중치를 초기값으로 설정한 후 학습하는 것을 특징으로 하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법."}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 단계 (f)에서 Grad-CAM은 하기의 수식에 따라 그레디언트를 통해 특징맵의 가중치 를 계산하는 것을 특징으로 하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법.(여기서, 는 k번째 특징맵 내의 i, j의 위치값, 는 특징맵 별 합, 는 소프트맥스 이전의 클래스 c에 대한 스코어, 는 소프트맥스 함수 이후에 출력되는 분류 범주 값 c에 대한 소프트맥스 이전의레이어값 y를 보고자 하는 합성곱 레이어의 특징맵 로 미분한 값이다.)"}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 Grad-CAM은 하기의 수식에 따라 계산하는 것을 특징으로 하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법.(여기서, 는 k번째 특징맵, 는 그레디언트를 통해 계산된 특징맵의 가중치를 의미한다.)공개특허 10-2025-0046818-4-청구항 10 제 1 항에 있어서,상기 단계 (f)에서 FG-CAM은 하기의 수식에 따라 가중치 를 계산하는 것을 특징으로 하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법.(여기서, 는 k번째 특징맵 내의 i의 위치값, n는 특징맵 별 합, 는 소프트맥스 이전의 클래스 c에 대한스코어, 는 소프트맥스 함수 이후에 출력되는 분류 범주 값 c에 대한 소프트맥스 이전의 레이어값 y를보고자 하는 합성곱 레이어의 특징맵 로 미분한 값이다.)"}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 FG-CAM은 하기의 수식에 따라 계산하는 것을 특징으로 하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법.(여기서, 는 k번째 특징맵, 는 그레디언트를 통해 계산된 특징맵의 가중치를 의미한다.)"}
{"patent_id": "10-2023-0130758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 FFT-CAM은 하기의 수식에 따라 계산하는 것을 특징으로 하는,XAI를 이용한 선형 이송 로봇의 고장 진단 방법.(여기서, 는 k번째 특징맵, 는 그레디언트를 통해 계산된 특징맵의 가중치를 의미한다.)"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 XAI를 이용한 선형 이송 로봇의 고장 진단 방법은, (a) 정상상태의 로봇과 비정상상 태의 로봇을 준비하고, 상기 로봇들에 부착된 센서로부터 정상 또는 비정상 신호 데이터를 각각 수집하는 단계; (b) 상기 수집된 정상 또는 비정상 신호 데이터를 전처리(Preprocessing)하여 시간과 주파수 성분으로 변환하는 (뒷면에 계속)"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 XAI를 이용한 선형 이송 로봇의 고장 진단 방법에 관한 것으로, 좀 더 상세하게는 XAI(eXplainable Artificial Intelligence) 기술을 이용하여 선형 이송 로봇의 선형 레일 유격 및 볼 스크류 유격에 대한 정상 또는 비정상(이상) 신호 데이터를 수집하고, 상기 수집된 정상 또는 비정상 신호 데이터를 기설정된 고장 분류 표에 따라 딥 러닝(CNN) 모듈을 통해 학습시킴으로써 선형 이송 로봇의 고장에 대한 신호 특징을 스스로 추출 및 고장 유형을 신속하고 정확히 분류할 수 있으므로 고장 진단의 신뢰도가 대폭 향상되는 XAI를 이용한 선형 이송 로봇의 고장 진단 방법에 관한 것이다."}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 선형 이송 로봇은 시스템 내에서 선형 이동을 필요로 하는 기계도구를 지칭하는 것으로서, 산업용 기계에서 선형운동을 필요한 다양한 운송 작업, 자동화된 생산라인 및 산업용 로봇에 널리 사용되고 있다. 이와 같이 선형 이송 로봇은 다양한 조건에서 반복적인 작업을 수행하는 데 폭넓게 사용되는데, 운송 작업의 높 은 부하 조건과 생산라인 및 로봇의 지속적인 마찰로 인해 선형 이송 가이드의 레일, 베어링 및 블록이 노후화 및 파손되는 경우가 빈발하고 있으며, 상술한 선형 이송 가이드의 고장으로 인해 선형 이송 가이드를 포함하는 전체 선형 이송 로봇 시스템의 고장으로 이어질 수 있기 때문에 LM가이드 등 주요 부품의 상태를 정확하게 진단 및 모니터링하는 기술이 매우 중요하게 인식되고 있다. 종래에는 이러한 선형 이송 로봇의 고장 진단 및 잔존 유효 수명의 예측하기 위한 고장 진단 방법으로는 다양한 신호를 기반으로 개발자의 경험과 직관에 의해 고장 특징을 추출한 후 이러한 고장 특징들을 추출하도록 분류기 를 기계학습시키는 방법이 대표적이었다. 구체적으로, 모터 등의 로봇에서 발생되는 진동, 음향, 전류, 토크, RPM 등의 신호를 센싱하고 이러한 센싱값을 기반으로 선형 예측 계수를 통한 시계열 분석, 고속 퓨리에 변환을 통한 주파수 분석, 이산 분석을 통해 주파수 대역별 실효값과 분산을 분석한 후, 이들의 데이터에 대한 테스팅 및 타당성을 검증한 결과를 멀티레이어 퍼셉 트론 네트워크를 통해 분류함으로써 고장 특징이 추출되는 방식이 채택되었다. 예컨대, 대한민국 등록특허 제1249576호(2013.03.26. 등록, 이하 ‘인용문헌’이라 함)를 참조하면, 서포트 벡 터 머신을 이용한 회전기계의 결함진단 방법 및 장치가 개시되어 있는데, 상기 인용문헌의 경우에도 역시 개발 자의 경험에 의해 전적으로 결합진단의 성능이 좌우될 뿐만 아니라, 검증 대상에 따라 다른 추출 알고리즘을 적 용해야 한다는 문제점이 있었다. 특히, 최근에는 웨이퍼 등을 이송하는 선형 이송 로봇의 경우 웨이퍼에 나노미터 스케일의 미세 패턴을 가공해 야 하므로 매우 정밀하고 정확한 이송이 요구되는데, 이러한 이유로 상술한 인용문헌을 포함한 종래 기술을 이 용하여서는 매우 정밀하고 정교한 선형 이송 로봇 및 부품의 고장 발생유무를 조기에 정확히 진단 및 예측하고 즉시 대처하는 데에는 한계가 있었다. 이에 따라 최근에는 데이터 기반의 다양한 고장 진단 방법이 연구되고 있다. 일례로, KNN(K-Nearest Neighbors), PCA(Principal Component Analysis) 등의 비학습 기반 방법과 인공신경 망, 퍼지 논리, 등의 학습 기반 방법뿐만 아니라, 데이터 축적 및 연산속도의 발전과 함께 스마트제조의 발달로 인해 딥러닝을 활용한 다양한 데이터 기반의 고장 진단 방법이 연구되고 있다. 딥러닝을 이용한 고장 진단 방법은 다층 퍼셉트론, 희소 딥 스태킹 네트워크, 스택 품질 기반 오토인코더, 심층 신념 네트워크, 장기 단기 메모리 네트워크 및 CNN이 연구되고 있으며, 이러한 딥러닝 모델들은 KNN, PCA 등 기 존의 머신러닝 방식보다 높은 정확도를 얻을 수 있어 다양한 산업 응용 분야에서 활용되고 있다. 그러나, 상기 딥러닝을 기반으로 한 다양한 고장 진단 방법은 수학적 방정식을 기반으로 작동되거나 신호의 시 간 또는 주파수 영역의 특성을 기반으로 작동되므로 종래 모델 기반이나 신호 기반 방법에 비해 모델 해석이 어 렵다는 단점이 있었다. 또한, 딥러닝 기반의 모델은 대표적인 블랙박스(black-box) 모델로 인식되어 왔지만, 최근에는 딥러닝을 통해 학습된 네트워크의 설명을 가능하게 하기 위해 XAI(Explainable Artificial Intelligence) 적용이 활발히 연구 되고 있다. 하지만, 대부분의 XAI 연구는 직관적인 해석이 가능한 이미지 데이터 분야에만 적용되고 있을 뿐, 상기 XAI를 신호 데이터를 이용한 Grad-CAM(Gradient-Class Activation Map) 등 이미지 분야의 진단 모델에 적용하여 해석 하기는 한계가 있었다. 따라서, 반도체 제조 등 첨단 산업 분야에서 선형 이송 로봇에 고장이 발생된 경우 이를 신속하고 정확하게 진 단할 수 있으며, 나아가 해석을 통해 고장 진단의 이유까지도 파악할 수 있는 진단 모델의 개발이 시급한 실정 이다. 선행기술문헌한국 특허등록 제1249576호 (2013.03.26. 등록)"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은 상기와 같은 문제점을 해소할 수 있도록 안출된 것으로, XAI(eXplainable Artificial Intelligence) 기술을 이용하여 선형 이송 로봇의 선형 레일 유격 및 볼 스크류 유격에 대한 정상 또는 비정상 (이상) 신호 데이터를 수집하고, 상기 수집된 정상 또는 비정상 신호 데이터를 기설정된 고장 분류표에 따라 딥 러닝(CNN) 모듈을 통해 학습시킴으로써 선형 이송 로봇의 고장에 대한 신호 특징을 스스로 추출 및 고장 유형을 신속하고 정확히 분류할 수 있으므로 고장 진단의 신뢰도가 대폭 향상되는 XAI를 이용한 선형 이송 로봇의 고장 진단 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명은 일 실시예에 따라, (a) 정상상태의 로봇과 비정상상태의 로봇을 준비하고, 상기 로봇들에 부착된 센서로부터 정상 또는 비정상 신호 데이터를 각각 수집하는 단계; (b) 상기 수 집된 정상 또는 비정상 신호 데이터를 전처리(Preprocessing)하여 시간과 주파수 성분으로 변환하는 단계; (c) 상기 변환된 정상 또는 비정상 신호 데이터에서 추출된 특징에 따라 로봇의 고장 분류표를 구성하는 단계; (d) 상기 변환된 정상 또는 비정상 신호 데이터를 로봇의 고장 분류표에 따라 레이블링한 후, 레이블링된 정상 또는 비정상 신호 데이터를 1D-CNN(one dimensional Convolutional Neural Network) 또는 2D-CNN(two dimensional Convolutional Neural Network) 모듈에 입력하여 학습시키는 단계; (e) 상기 학습이 완료되면 1D-CNN 모듈 및 2D-CNN 모듈을 통해 각각 다른 특성을 추출하고 학습하며, 이를 통해 이상 상태(고장)의 유무와 고장 분류표에 따라 고장의 종류를 분류하는 단계; 및 (f) 상기 2D-CNN 모듈은 Grad-CAM을 이용하고, 1D-CNN 모듈은 FFT-CAM 및 FG-CAM을 이용하여 분류 결과를 시각화함으로써 주파수 영역에서의 예측 결과를 설명하는 단계;를 포함하여 구성된다. 또한 일 실시예에 따라, 상기 단계 (a)에서 수집된 정상 또는 비정상 신호 데이터는, 가속도 센서를 이용하여 수집한 진동 신호 데이터; 및 토크 센서를 이용하여 수집한 토크 신호 데이터;를 포함한다. 또한 일 실시예에 따라, 상기 단계 (b)에서 정상 또는 비정상 신호 데이터의 전처리는, STFT(Short-Time Fourier Transform) 및 스펙트로그램(Spectrogram) 변환을 통해 수행된다. 또한 일 실시예에 따라, 상기 STFT는 하기 수식에 따라 수행되는 것을 특징으로 한다."}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "(여기서, w는 윈도우 함수를 나타내고, 상기 τ는 윈도우 지연시간을 나타낸다.) 또한 일 실시예에 따라, 상기 스펙트로그램은 STFT한 결과에서 의 값을 시간 축과 주파수 축의 2차원으로 시각 화한 후 진폭을 색깔이나 명암으로 표시하는 것을 특징으로 한다. 또한 일 실시예에 따라, 상기 단계 (c)에서 로봇의 고장 분류표는, N(정상), LR-H(심각한 리니어 레일 미스얼라 인먼트), LR-M(덜 심각한 리니어 레일 미스얼라인먼트), BS-H(심각한 볼 스크류 미스얼라인먼트), BS-M(덜 심각 한 볼 스크류 미스얼라인먼트)의 5종으로 분류된다. 또한 일 실시예에 따라, 상기 단계 (d)에서 1D-CNN 모듈은 시간 영역의 원시 신호를 사용하여 학습하고, 2D-CNN 모듈은 전이학습(Transfer Learning)을 이용하여 특징 추출기의 가중치를 초기값으로 설정한 후 학습하는 것을 특징으로 한다. 또한 일 실시예에 따라, 상기 단계 (f)에서 Grad-CAM은 하기의 수식에 따라 그레디언트를 통해 특징맵의 가중치 를 계산하는 것을 특징으로 한다. (여기서, 는 k번째 특징맵 내의 i, j의 위치값, 는 특징맵 별 합, 는 소프트맥스 이전의 클래 스 c에 대한 스코어, 는 소프트맥스 함수 이후에 출력되는 분류 범주 값 c에 대한 소프트맥스 이전의 레이어값 y를 보고자 하는 합성곱 레이어의 특징맵 로 미분한 값이다.) 또한 일 실시예에 따라, 상기 Grad-CAM은 하기의 수식에 따라 계산하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "(여기서, 는 k번째 특징맵, 는 그레디언트를 통해 계산된 특징맵의 가중치를 의미한다.) 또한 일 실시예에 따라, 상기 단계 (f)에서 FG-CAM은 하기의 수식에 따라 가중치 를 계산하는 것을 특징으로 한 다."}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "(여기서, 는 k번째 특징맵 내의 i의 위치값, n는 특징맵 별 합, 는 소프트맥스 이전의 클래스 c에 대한 스코어, 는 소프트맥스 함수 이후에 출력되는 분류 범주 값 c에 대한 소프트맥스 이전의 레이어값 y를 보고자 하는 합성곱 레이어의 특징맵 로 미분한 값이다.) 또한 일 실시예에 따라, 상기 FG-CAM은 하기의 수식에 따라 계산하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 5, "content": "(여기서, 는 k번째 특징맵, 는 그레디언트를 통해 계산된 특징맵의 가중치를 의미한다.) 또한 일 실시예에 따라, 상기 FFT-CAM은 하기의 수식에 따라 계산하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 6, "content": "(여기서, 는 k번째 특징맵, 는 그레디언트를 통해 계산된 특징맵의 가중치를 의미한다.)"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같은 본 발명은, 선형 이송 로봇의 진동 및 토크 신호 데이터를 수집 및 수집된 진동 및 토크 신호 데이터를 딥 러닝 모듈을 통해 학습시킴으로써 선형 이송 로봇의 고장에 대한 신호 특징을 스스로 추출 및 고장 유형을 신속하게 정확하게 분류할 수 있게 되므로 고장 진단의 신뢰도가 대폭 향상되는 효과가 있다. 또한, 선형 이송 로봇의 고장을 조기에 감지함으로써 그로 인해 발생될 수 있는 불량 및 각종 사고를 사전에 미 연에 방지할 수 있는 효과가 있다.또한, 확실한 고장 진단관리로 제품의 신뢰도가 향상되는 효과가 있다. 또한, 데이터 기반의 고장 진단 방법을 구축함에 의해 FT(Field Test), CS(Customer Service)의 체계화 및 과 학화를 달성할 수 있는 효과가 있다. 또한, 장비 출하 후 사후 보전관리에도 활용할 수 있으므로 선형 이송 로봇의 품질이 지속적으로 향상되는 효과 가 있다."}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로서, 본 발명을 한정하려는 의 도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 내지 \"구비하다\" 등의 용어는 본 명세서에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 명세서에서 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들 은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 나 타낸다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미가 있는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않아야 한다.이하, 첨부된 도면을 참조하여 본 발명의 일 실시예에 따른 웨이퍼 이송 로봇의 인공지능 기반 고장 진단 방법 의 구성 및 작동 관계에 대해 구체적으로 살펴보면 다음과 같다. 도 1은 본 발명 XAI를 이용한 선형 이송 로봇의 고장 진단 방법을 예시한 개념도이다. 도 1을 참조하여 본 발명의 개념도를 간단히 살펴보면, 먼저 대상이 되는 1축 선형 이송 로봇은 반도체 장비에 사용되는 웨이퍼 이송용 로봇일 수 있으며, 상기 선형 이송 로봇에 부착된 가속도 센서와 토크 센서로부터 진동 신호와 토크 신호를 검출한다. 이때, 상기 토크 신호는 장비에 장착된 토크 센서나 서버 드라이버의 전류 센서 로 검출할 수 있다. 이어서, 검출된 신호는 데이터 전처리를 거쳐 모델의 입력으로 사용된다. 입력 데이터는 1D-CNN 모델과 2D-CNN 모델로 나뉘며, 1D-CNN 모델은 시간 영역의 원시 신호를 사용하고, 2D-CNN 모델은 STFT(Short Time Fourier Transform)를 통해 얻은 파워스펙트럼을 시각화하는 스펙트로그램을 구한다. 여기서, 상기 스펙트로그램은 음성 신호의 시각화에 많이 사용하는 기법으로서, 상기 스펙트로그램의 크기는 인 식 알고리즘의 입력에 맞게 조절한다. 이후, 이상상태(고장) 분류는 1D-CNN 모델과 2D-CNN 모델을 모두 활용하 여 이루어진다. 이 두 모델은 각각 다른 특성을 추출하고 학습하며, 이를 통해 이상의 유무와 종류를 분류한다. 또한, 분류 결과를 시각화하기 위해 2D-CNN 모델은 Grad-CAM(Gradient-Class Activation Map) 기법을 활용하고, 1D-CNN 모델은 FFT-CAM(Fast Fourier Transform-CAM) 및 FG-CAM(Fine grained-CAM)을 이용하여 주파 수 영역에서의 예측 결과를 설명한다. 하기는 상술한 본 발명의 각 구성요소에 대한 상세한 설명이다. STFT 진동 신호 또는 토크 신호 x(t)의 STFT의 결과로 얻은 함수 X(τ,w)는 하기 수학식 1과 같이 x(t)와 짧은 시간 간격에서만 0이 아닌 값을 갖는 윈도우 함수 w(τ)를 곱하여 Fourier 변환함으로써 얻을 수 있다. 이때, 윈도우 함수는 Hann window나 Gaussian window를 주로 사용한다. 수학식 1"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(여기서, w는 윈도우 함수를 나타내고, 상기 τ는 윈도우 지연시간을 나타낸다.) 스펙트로그램 스펙트로그램은 STFT한 결과에서 의 값을 시간 축과 주파수 축의 2차원으로 시각화한 것으로 진폭을 색깔이나 명암으로 표시한다. 즉, 본 발명에서는 진동 신호 또는 토크 신호를 STFT을 통해 시간 변화에 대한 주파수 신호 로 변환하고, 변환된 주파수 신호를 스펙트로그램 형태의 데이터로 변환하여 출력한다. 1D-CNN 모델 및 2D-CNN 모델 1D-CNN은 주로 1차원 데이터 처리에 특화된 신경망 구조로, 딥러닝을 활용한 결함 진단 분야에서 널리 사용되고 있다. 이 모델은 주로 시계열 데이터와 같은 1차원 신호를 다루는 데 적합하며, 데이터를 추가 변환하지 않고도 직접 처리할 수 있는 장점을 가지고 있다. 이러한 특성으로 인해, 주파수 영역으로의 변환 작업을 위해 푸리에 변환 또는 웨이블릿 변환과 같은 작업이 필요한 경우에도 1D-CNN을 활용함으로써 계산량을 절약할 수 있다. 고장 진단을 위한 신호 데이터의 경우, 토크 신호와 진동 신호를 함께 활용한다. 토크 신호의 길이는 전체 길이 로 1000이며, 진동 신호는 1/10다운샘플링하여 길이가 47514로 모델의 입력으로 사용된다. 1D-CNN 모델은 활성화 함수로 ReLU(렐루) 함수를 사용하고, Max Pooling 레이어를 통해 커널의 최대값을 활용하여 필터값을 변환시 킨다. 또한, Global Average Pooling(GAP) 레이어를 이용하여 특징이 추출된 필터들을 활용하여 분류 작업을 수 행한다. 본 발명에 이용된 1D-CNN 모델은 총 2개의 1D-CNN 레이어를 포함하고 있으며, 각 레이어는 다른 필터 개수를 가 지고 있다. 구체적으로는 (64, 32)개의 필터가 사용되었고, 커널 사이즈는 (100, 50)으로 설계되었다. 이렇게 설계된 1D-CNN 레이어는 다양한 범위의 신호 특성을 추출하며, Max Pooling을 통해 크기를 축소시킴으로써 효율 적인 데이터 처리를 가능하게 한다. 출력층 이전에는 은닉층이 하나 있으며, 해당 은닉층은 100개의 필터를 사 용하여 데이터를 처리한다. 이렇게 구성된 1D-CNN 모델은 주어진 신호 데이터를 분석하고, 고장 진단을 위한 판 별 작업을 수행하는 데 효과적으로 활용된다. 2D-CNN 모델은 VGG(Visual Geometry Group)로 알려진 이미지 인식을 위한 심층학습 모델로서, 224 x 224 크기 의 이미지의 입력하여 이미지의 내용을 클래스로 분류할 수 있다. VGG-16과 VGG-19모델이 사용되고 각각 16개와 19개의 컨볼루션층을 갖는다. 산업용 시스템의 진단에 심층학습을 적용하는 경우 모델을 학습시킬 충분한 데이 터를 얻을 수 없는 경우가 많으며 특히, 이상 상황(고장)에 대한 데이터가 부족하여 데이터 세트가 불균형 (imbalance)해 질 수 있다. 이런 경우에 전이학습(Transfer Learning)이 사용될 수 있는데, 전이학습은 기존에 다른 문제에 대해 다른 데이터 세트로 학습된 모델을 가져와서, 해당 모델의 일부 레이어를 고정하고 새로운 도 메인의 데이터로 재학습시키는 방법이다. 이를 통해 초기에 학습한 이미지 분류와는 다른 도메인의 데이터를 분 석하고 이상 상태를 검출하는 데 활용할 수 있으며, 학습 데이터 부족 문제를 해결하는 데 도움을 준다. Grad-CAM 설명 가능한 인공지능 기법(XAI) 중 하나로, CNN의 결과에 영향을 미친 픽셀의 위치를 시각적으로 표현하여 신 경망을 해석하는 모델이다. 이 기법은 CNN의 마지막 합성곱 계층을 전역 평균 풀링(GAP, Global Average Pooling)을 통해 완전 연결 계층으로 변환하고, 각 완전 연결 계층의 포인트를 활성화 계층의 가중치로 사용하 여 이미지를 분류한다. CAM(Class Activation Map)은 CNN의 마지막 합성곱 계층에서 픽셀의 위치를 고려한 시각 화를 제공한다. 이를 위해서는 각 특징맵마다 해당 특징맵의 평균값을 곱하고, 곱해진 채널들을 모두 더하여 히트맵을 생성한다. 그러나, CAM은 완전 연결 계층을 사용하기 때문에 성능 저하가 발생할 수 있으며, 마지막 합성곱 계 층에서만 사용할 수 있는 한계가 있다. Grad-CAM은 이러한 CAM의 단점을 극복하기 위해 개발된 모델 중 하나로, 가중치 대신 역전파 경사(gradient)를 활용하여 히트맵을 생성한다. Grad-CAM은 경사, 즉 그레디언트(gradient)를 사용하여 전역 평균 풀링(Global Average Pooling)을 사용하지 않기 때문에 GAP layer를 붙여서 다시 튜닝해야 할 필요도 없어 CAM의 문제점을 해결할 수 있게 되었다. 또한, Grad-CAM을 사용하면 모든 CNN 기반으로 한 모델의 구조를 변동시키지 않고, 컨볼루션 레이어를 가진 모델이면 모두 Grad-CAM을 적용할 수 있기 때문에 다른 모델들에서도 사용할 수 있게 된다. Grad-CAM은 CAM 방식 중에서 가중치를 구하는 방식이 새로운 방식으로 대체되었다. CAM처럼 GAP 레이어를 붙여서 다시 튜닝하지 않고 그레디 언트 계산을 통하여 가중치를 구한다. 가중치는 특정 클래스에 특정 입력이 주는 영향력, 즉 특징맵의 각 요소 가 특정 클래스에 주는 영향력이다. 본 발명은 Grad-CAM을 통해 CNN 결과의 해석을 더욱 효과적으로 수행한다. 이하, 상기 Grad-CAM의 가중치와 수학식은 다음과 같다. 먼저, Grad-CAM은 하기 수학식 2에 따라 그레디언트를 통해 특징맵의 가중치 를 계산한다. 수학식 2"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "(여기서, 는 k번째 특징맵 내의 i, j의 위치값, 는 특징맵 별 합, 는 소프트맥스 이전의 클 래스 c에 대한 스코어, 는 소프트맥스 함수 이후에 출력되는 분류 범주 값 c에 대한 소프트맥스 이전 의 레이어값 y를 보고자 하는 합성곱 레이어의 특징맵 로 미분한 값이다.) 또한, 하기 수학식 3을 통해 Class c에 대한 Grad-CAM Score를 계산한다. 수학식 3"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "(여기서, 는 k번째 특징맵, 는 그레디언트를 통해 계산된 특징맵의 가중치를 의미한다.) FG-CAM Grad-CAM 기법에 대한 주파수 대역의 해석으로, Grad-CAM의 ReLU 함수를 파워 스펙트럼(power spectrum) 변환 기법인 Welch’s method로 대체하여 주파수 분석을 수행한다. 먼저, FG-CAM의 가중치 는 하기 수학식 4를 통해 계산한다. 수학식 4"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "(여기서, 는 k번째 특징맵 내의 i의 위치값, n는 특징맵 별 합, 는 소프트맥스 이전의 클래스 c에 대한 스코어, 는 소프트맥스 함수 이후에 출력되는 분류 범주 값 c에 대한 소프트맥스 이전의 레이어값 y를 보고자 하는 합성곱 레이어의 특징맵 로 미분한 값이다.) 위와 같이 계산된 필터의 가중치는 주파수 분석을 위해 마지막 1D-CNN 레이어의 출력인 총 N장의 각 필터와 곱 연산이 수행되고, Welch’s method에 의해 파워 스펙트럼으로 변환된다. 또한, 하기 수학식 5를 통해 Class c에 대한 FG-CAM Score를 계산한다. 수학식 5"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "(여기서, 는 k번째 특징맵, 는 그레디언트를 통해 계산된 특징맵의 가중치를 의미한다.) FFT-CAM FG-CAM에서 계산된 필터 가중치 는 필터 를 곱한 결과에 Welch’s method 대신 직접적인 푸리에 고속 변환(FFT) 기법을 적용한 파워 스펙트럼을 이용한다. 일반적으로 주파수의 분해능은 FFT를 적용하는 신호의 포인트가 많을 수록 좋아지기 때문에 신호를 지정(segment)하지 않고, 전체 신호를 이용하는 것이 더 유리하다. FFT-CAM은 다음의 수학식 6에 의해 계산된다. 수학식 6"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "(여기서, 는 k번째 특징맵, 는 그레디언트를 통해 계산된 특징맵의 가중치를 의미한다.) 또한, 본 발명에 이용되는 데이터 세트는 하기와 같이 수집 및 구성될 수 있다. 도 2는 본 발명에 따른 미스얼라인먼트(misalignment)의 개념도이다. 먼저, 데이터 세트는 상기 도 2에서 도시된 바와 같이 LM 레일의 유격 이상(misalignment)과 볼 스크류 축의 유 격 이상이 있는 상황에서 속도를 달리하며 로봇을 구동할 때 발생하는 진동 신호와 토크 신호를 가속도 센서와 토크 센서로 수집하여 구성한다. 또한, 각 데이터 세트는 하기 표 1과 같이 구분될 수 있다. 예컨대, 정상인 상태와 선형 레일에 중대한 유격 이 상과 경미한 유격 이상이 있는 경우, 그리고 볼 스크류 축에 중대한 유격 이상과 경미한 유격 이상이 있는 경우 로 구분하여 5개의 데이터 그룹으로 각 정보를 분류하였다. 표 1 Data set name Meaning “N” Normal “LR-H” Large linear rail misalignment “LR-M” Minor linear rail misalignment “BS-H” Large ball screw misalignment “BS-M” Minor ball screw misalignment 구체적으로, 본 발명 XAI를 이용한 선형 이송 로봇의 고장 진단 방법은 일 실시예에 따라 하기의 단계들로 구성 된다. 단계 (a): 정상상태의 로봇과 비정상상태의 선형 이송 로봇을 준비하고, 상기 선형 이송 로봇들에 부착된 센서 로부터 정상 또는 비정상 신호 데이터를 각각 수집한다. 일 실시예에 따라, 상기 단계 (a)에서 수집된 정상 또는 비정상 신호 데이터는, 가속도 센서를 이용하여 수집한 진동 신호 데이터; 및 토크 센서를 이용하여 수집한 토크 신호 데이터;를 포함한다. 단계 (b): 상기 수집된 정상 또는 비정상 신호 데이터를 전처리(Preprocessing)하여 시간과 주파수 성분으로 변 환한다. 일 실시예에 따라, 상기 단계 (b)에서 정상 또는 비정상 신호 데이터의 전처리는, STFT(Short-Time Fourier Transform) 및 스펙트로그램(Spectrogram) 변환 기법을 통해 수행된다. 이때, 상기 단계 (b)에서 STFT(Short-Time Fourier Transform) 변환 기법을 이용한 정상 또는 비정상 신호 데 이터의 전처리 과정은, 원본 진동 데이터를 일정한 길이의 윈도우(Window)로 분할하는 단계; 상기 각 윈도우에 대해 FFT(Fast Fourier Transform)를 수행함으로써 상기 각 윈도우의 주파수 성분에 대한 스펙트로그램 (Spectrogram)을 생성하는 단계; 및 상기 생성된 스펙트로그램을 주파수 축을 기준으로 2D 표로 변환하여 시각 화하는 단계;를 포함하여 수행될 수 있다.단계 (c): 상기 변환된 정상 또는 비정상 신호 데이터에서 추출된 특징에 따라 로봇의 고장 분류표를 구성한다. 일 실시예에 따라, 상기 단계 (c)의 고장 분류표는, N(정상), LR-H(심각한 리니어 레일 미스얼라인먼트), LR- M(덜 심각한 리니어 레일 미스얼라인먼트), BS-H(심각한 볼 스크류 미스얼라인먼트), BS-M(덜 심각한 볼 스크류 미스얼라인먼트)의 5종으로 분류된다. 단계 (d): 상기 변환된 정상 또는 비정상 신호 데이터를 로봇의 고장 분류표에 따라 레이블링한 후, 레이블링된 정상 또는 비정상 신호 데이터를 1D-CNN(one dimensional Convolutional Neural Network) 또는 2D-CNN(two dimensional Convolutional Neural Network) 모듈에 입력하여 학습시킨다. 일 실시예에 따라, 상기 단계 (d)에서 1D-CNN 모듈은 시간 영역의 원시 신호를 사용하여 학습하고, 2D-CNN 모듈 은 전이학습(Transfer Learning)을 이용하여 특징 추출기의 가중치를 초기값으로 설정한 후 학습하는 것을 특징 으로 한다. 단계 (e): 상기 학습이 완료되면 1D-CNN 모듈 및 2D-CNN 모듈을 통해 각각 다른 특성을 추출하고 학습하며, 이 를 통해 이상 상태(고장)의 유무와 고장 분류표에 따라 고장의 종류를 분류한다. 단계 (f): 이후, 2D-CNN 모듈은 Grad-CAM 기법을 활용하고, 1D-CNN 모듈은 FFT-CAM 및 FG-CAM을 이용하여 분류 결과를 시각화함으로써 주파수 영역에서의 예측 결과를 설명한다. 실험예: 웨이퍼 이송 로봇(단축 로봇)의 딥러닝 기반 고장 진단 수행 개발 및 실험 환경 - 시험대상: 단축로봇(LM Guide Robot, 서보모터 모델명: SGM7J-08A7D61) - 가속도 센서(단축, 무선 가속도계): 진동 신호 계측 (무선 가속도센서: EI WISER 3X, 단축 가속도센서: AC500-2P) - 토크 센서: 토크 신호 계측 도 3은 본 발명의 실험에 이용된 장치 구성의 실사 이미지이다. 상기 도 3을 참조하면, 본 실험에 이용된 장치는 웨이퍼 전송용 1축 선형 이송 로봇에 가속도 센서와 토크 센서 를 장착하여 구성하였다. 가속도 센서의 샘플링 주파수는 48 Khz이고, 토크 센서는 100 Hz이다."}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "연구내용 요약 - 웨이퍼 이송로봇의 진동신호 데이터 수집 - 수집한 데이터를 전처리하여 학습 및 분석에 적합하게 가공 - 학습된 인공지능 모델(VGG19)을 활용하여 고장진단 수행 - 진동 신호를 분석하여 고장 유형 및 정확도를 평가 실험장치 구성도 - 시스템 하드웨어 구성은 시험대상(단축로봇)과 계측 시스템 및 분석 진단 알고리즘을 탑재한 컴퓨터 시스템으 로 구성 - 시험대상은 파트가 정상상태인 로봇과 비정상상태로 구분되어 정상신호와 이상 신호를 발생 - 과정은 1. 로봇 진동 계측, 2. 진동학습, 3. 결함진단 순으로 이루어짐 실험조건 - 가속도 센서 : 단축로봇의 센터에 부착되어 있으며, 진동 데이터를 수집할 때마다 측정된 가속도 값을 기록 - 토크 센서 : 단축로봇의 토크 값을 측정하기 위해 토크 센서를 사용 - 토크 센서는 가속도 센서와 다르게 케이블로 연결되어 있으며, 진동 데이터를 수집할 때마다 측정된 토크 값 을 기록 - 속도 조절 : 단축로봇의 다양한 속도로 조절하여 실험을 진행 (속도는 250mm/s ~ 700mm/s 로 10 단계로 나누 어 각 단계에 10개씩 반복 실험을 해서 총 100개의 데이터를 획득, 일반적으로 저속, 중속, 고속 세 가지 속도 로 실험을 진행) - 가속도계의 샘플링 주파수는 48KHz이고 토크의 샘플링 주파수는 100 Hz임 - LM 가이드의 스토크(Stroke)는 750 mm 이고, 시간은 10초로 설정함 고장용어의 정의는 하기 표 1과 같고, 훈련과 테스트에 사용한 데이터의 수는 하기 표 2와 같다. LM 가이드의 전체 변위는 750 mm이고 이동 속도는 250 mm/s ~ 700 mm/s 사이에서 10단계로 나누어 구동하면서 데이터를 측정하였다. 각 데이터 세트별로 각각 100개씩 구동 시 발생하는 가속도 신호와 토크 신호를 수집하고 모델 훈련할 때에는 Adam 옵티마이저를 사용하였고, 오차함수(loss function)는 Categorical cross-entropy를 사용하였으며, 반복횟수(epochs)는 150로 설정하였다. 이때, 레일 유격 이상은 약 0.6 mm와 0.3 mm이며 볼 스크 류 유격 이상은 0.9 mm 와 1.6 mm이다. 참고로 본 실험용 선형 이송 로봇에 있어서 허용하는 레일 유격은 0.02 mm, 볼 스크류 유격은 0.1 mm이다. 표 2 정상 N LM Rail 어긋남 LR Ball Screw 어긋남 BS 고장 심함 H 고장 덜 심함 M 표 3 Data # Training data # Test data Misalignment N 80 20 - LR-H 80 20 0.6 mm LR-M 80 20 0.3 mm BS-H 80 20 1.6 mm BS-M 80 20 0.9 mm 단축로봇 고장: - LM 가이드의 축 선단에서 이상상태 변위를 설정 - LM Rail 어긋남 덜 심함: 0.3 mm, 매우 심함: 0.6 mm - Ball Screw 어긋남 덜 심함: 0.9 mm, 매우 심함: 1.6 mm - 토크 실험 시 고장 2단계 (각 단계: 100) - 정상 (N) : 100개 + LM Rail 어긋남(LR_H, LR_M) : 200개 + Ball Screw 어긋남(BS_H, BS_M) : 200개 = 총 500개의 데이터 획득 전처리(STFT) - 원본 진동 데이터의 주파수 정보를 추출하기 위해 STFT(Short-Time Fourier Transform) 전처리 기법을 적용 - STFT는 시간 영역의 신호를 주파수 영역으로 변환하여 진동 데이터의 스펙트럼을 분석하는 데 사용 - STFT를 적용하기 위해 다음과 같은 세부 단계를 수행 1. 원본 진동 데이터를 일정한 길이의 윈도우(Window)로 분할함. 윈도우의 크기는 주파수 해상도와 시간 해상도 사이의 트레이드오프를 고려하여 설정됨 2. 각 위도우에 대해 FFT(Fast Fourier Transform)를 수행하여 주파수 성분을 얻음. FFT를 통해 각 윈도우의 주파수 영역 표현인 스펙트로그램이 생성됨 3. 스펙트로그램을 시각화하기 위해 주파수 축을 기준으로 하는 2D 표로 변환함. 이렇게 얻은 STFT 결과는 주파 수와 시간에 따른 진동 데이터의 변화를 시각적으로 파악할 수 있게 해줌 - STFT를 통해 얻은 주파수 성분 정보는 후속 분류 작업에 활용되며, 고장 진단에 필요한 중요한 특징을 추출하 는 데 도움을 줌 - 이를 통해 진동 데이터의 주파수 특성을 정확하게 분석하여 고장 상태를 판단하는 데 기여함 도 4는 (a) 정상상태, (b) 레일 유격 이상이 있는 경우, 그리고 (c) 볼 스크류 축 유격 이상이 있는 상황에서의 가속도 신호 스펙트로그램과 원 신호를 나타낸 도면이고, 도 5는 (a) 정상상태, (b) 레일 유격 이상이 있는 경 우, 그리고 (c) 볼 스크류 축 유격 이상이 있는 상황에서의 토크 신호의 스펙트로그램과 원 신호를 그린 도면이 다. 사용한 CNN 모델 : VGG19 - 딥러닝을 이용한 진동 신호 기반의 LM guide 고장 진단은 1차원의 진동 신호를 시간-주파수 분석 결과인 2차 원의 STFT(단시간 푸리에 변환)을 생성 - STFT는 특징 추출과 고장 진단을 부가적인 신호처리 방법 없이 동시에 수행할 수 있는 딥러닝 모델에 입력됨. 즉, 심층 컨볼루션층으로 구성된 CNN이 STFT로부터 고장진단을 위한 다양한 특징을 추출 - 추출된 특징맵은 GAP(Global Average Pooling)을 통해서 채널당 하나의 특징으로 대표되고 이후 완전연결층 (fully connected layer)을 통해 입력된 신호가 고장인지 정상인지 분류 - 학습은 전이학습을 이용하여 특징 추출기의 가중치를 초기값으로만 사용하고 전체를 모두 미세조정 (fine tuning)으로 학습하는 방법을 이용 - 고장 진단 시 VGG-19 모델에서 나온 특징맵을 완전연결층과 연결하기 위해 기존의 VGG-19와는 다르게 GAP을 이용하여 각 채널당 하나의 특징값으로 변환 - 특징맵의 형태가 h x w x d 일 때 GAP을 통해서 1 x 1 x d 크기로 줄어듦 - 이후 완전연결층 2개를 연결하고 드롭아웃층을 연결한 다음에 최종 출력은 고장인지 정상인지를 판단하는 2개 의 노드로 구성되기도 하고 고장 종류에 따라 3개의 노드로 구성되기도 함 - 각 블록 상단의 숫자는 채널 수를 의미 고장 분류(5종 분류) - 고장 분류를 위해 Convolutional Neural Network (CNN) 모델 중 VGG19 모델을 사용 - VGG19는 깊은 구조를 가지고 있으며, 이미지 분류 작업에서 뛰어난 성능을 보여준다고 알려져 있음. 진동 데 이터의 주파수 특성을 이미지로 변환한 후, VGG19 모델을 통해 고장 분류- 고장 분류는 5종의 분류 방법을 적용하였고, 각 분류 방법의 내용은 다음과 같음 - N(정상) : LR_H(LM Rail 어긋남 매우심함) : LR_M (LM Rail 어긋남 덜심함) : BS_H(Ball Screw 어긋남 매우 심함) : BS_M(Ball Screw 어긋남 덜심함) - 각 분류 방법에 따라 데이터를 적절히 레이블링하여 모델을 학습하고, 테스트 데이터에 대한 분류 정확도를 평가. 이를 통해 진동 데이터의 특성에 따라 고장 상태를 정확하게 분류할 수 있는지 확인함 가속도 매개변수 - 속도가 증가함에 따라 가속도 피크값이 변화함 - 저속에서 중속으로 갈수록 정상과 이상상태의 종류가 서로 엇갈리는 반면, 중속에서 고속으로 갈수록 서로 분 리되어 나타남 (이상상태 종류 기준이 명확하지 않음 -> 정상과 이상상태의 종류가 완전히 분리되지 않은 듯함) - 속도가 증가함에 따라 가속도 피크값이 변화함 - 정상과 이상상태의 종류가 서로 엇갈림(이상상태 종류기준이 명확하지 않음 -> 정상과 이상상태의 종류가 완 전히 분리되지 않은 듯함) 토크 매개변수 - 속도가 증가함에 따라 토크 피크값이 변화함 - 볼스크류 어긋남이 정상과 LM Rail 어긋남보다 진폭이 높으나 정상과 LM Rail 어긋남에서는 비슷한 성향이 있 음 첨부된 도 6은 손실함수(가속도 데이터)의 변화 그래프: (a) 2 클래스(1D-CNN), (b) 3 클래스(1D-CNN), (c) 2 클래스(2D-CNN), (d) 3 클래스(2D-CNN)이고, 도 7은 손실함수(토크 데이터)의 변화 그래프: (a) 2 클래스(1D- CNN), (b) 3 클래스(1D-CNN), (c) 2 클래스(2D-CNN), (d) 3 클래스(2D-CNN)이다. 이상 검출 문제는 다음과 같이 구분해야 할 클래스의 수를 2가지 문제로 나누어 훈련한 후 실험하였다. 각 문제 에 대해 훈련 과정의 손실함수는 가속도 센서인 경우 상기 도 6과 같으며, 토크 센서를 사용한 경우는 상기 도 7과 같다. 여기서, 2 클래스는 ‘정상/비정상’, 3 클래스는 ‘정상/LM 레일 유격 이상/볼 스크류 유격 이상’인 경우를 각각 의미한다. 고장분류 결과 - 토크 매개변수와 가속도 매개변수를 기반으로 한 5종의 고장 분류 수행 - 결과적으로, 가속도 매개변수와 토크 매개변수가 고장 진단에 매우 유의미한 영향을 미치는 것을 확인하였음 1) 이상 감지 정확도 상기와 같이 구현된 고장 진단의 이상 감지 정확도에 관한 실험 결과는 하기 표 3과 같다. 즉, 가속도 센서를 사용한 경우 정상/비정상을 구분하는 2 클래스 문제에서는 모델에 따라 100%, 97%의 정확도 를, 유격 이상의 종류를 진단하는 3 클래스 문제에서는 100%, 91%의 정확도를 보였다. 토크 센서를 사용하는 경 우 정상/비정상을 구분하는 2클래스 문제에서는 모델에 따라 100%, 99%의 정확도를, 유격 이상의 종류를 진단하 는 3클래스 문제에서는 100%, 98%의 정확도를 보였다. 따라서, 선형 이송 로봇의 고장 진단에 있어서 진동 센서(가속도 측정) 및 토크 센서(토크 측정)를 모두 사용하 는 경우 유격 이상의 진단에 대해서 적합한 것으로 판단되었다.표 4 Sensor type Model Problem type Accuracy % Acceleration Sensor 1D-CNN 2 Classes 100 3 Classes 100 2D-CNN 2 Classes 97 3 Classes 91 Torque sensor1D-CNN 2 Classes 100 3 Classes 100 2D-CNN 2 Classes 99 3 Classes 98 2) 혼동행렬(Confusion matrix) 또한, 혼동행렬을 이용한 분류 모델의 성능 평가 결과는 아래와 같다. 첨부된 도 8은 혼동행렬(가속도 데이터) 그래프: (a) 2 클래스(1D-CNN), (b) 3 클래스(1D-CNN), (c) 2 클래스 (2D-CNN), (d) 3 클래스(2D-CNN)이고, 도 9는 혼동행렬(토크 데이터) 그래프: (a) 2 클래스(1D-CNN), (b) 3 클 래스(1D-CNN), (c) 2 클래스(2D-CNN), (d) 3 클래스(2D-CNN)이다. 상기 혼동행렬(Confusion matrix)은 분류 모델의 성능을 평가하는 데 사용되며, 예측값과 실제값 간의 관계를 시각적으로 표현하는 도구이다. 테스트 데이터를 이용하여 최종 성능을 평가한 결과를 혼동행렬로 나타내었다. 가속도계를 사용하는 경우의 혼동행렬 그래프는 상기 도 8과 같고, 토크 센서를 사용한 경우의 혼동행렬 그래프 는 상기 도 9와 같다. 3) XAI 모델 해석 Grad-CAM 적용 결과 도 10은 가속도 데이터를 STFT한 주파수 이미지에 Grad-CAM을 적용한 결과이고, 도 11은 토크 데이터를 STFT한 주파수 이미지에 Grad-CAM을 적용한 결과이다. Grad-CAM을 활용하여 CNN 모델의 결과를 분석 및 설명하였으며, 각 센서 유형의 선형 이송 로봇의 작동 상태 신 호-주파수 이미지에 Grad-CAM을 적용한 결과를 상기 도 10과 도 11에 나타냈다. 이를 통해 정상, 볼스크류측 어긋남, 레일측 어긋남 세 가지 경우에 모델의 가중치가 높은 주파수 영역이 저주 파 대역에 위치해 있으며, 각각에 대해 식별하기 어려웠다는 것을 확인할 수 있다. FG-CAM 적용 결과 모델 해석을 위해 원신호의 주파수 대역의 파워 스펙트럼 밀도(PSD) 그래프와 FG-CAM을 사용한 분류 활성화 신 호(CAM)의 파워 스펙트럼 밀도 그래프를 비교하여 결과를 도출하였다. 이를 통해 모델이 주파수 영역에서 원신 호의 어느 주파수 영역을 주목하고 분류에 활용하는지에 대한 해석을 수행하였다. 도 12는 가속도계를 사용한 경우로 테스트 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 평균 PSD 그래프를 나타내고 있다. 상기 도 12에서 푸른색 박스는 분류 활성화 신호 대비 원신호의 주파수 성분이 낮은 영역을 강조한다. 볼스크류 측 결함의 경우, 모델이 원신호에서 주로 참조하는 주파수 대역은 약 950Hz부터 2500Hz 미만이다. 레일측 결함 에서도 레일측 클래스의 분류를 위해, 모델은 원신호에는 두드러지지 않은 약 1000Hz 이후부터 주파수 대역에 가중치를 참조하고 있음을 확인할 수 있다. 또한, 정상 데이터에서도 정상 클래스의 분류를 위해 300Hz와 800Hz부터 2500Hz 미만의 주파수 대역을 가중치를 두어 참조하고 있음을 알 수 있다.도 13은 토크를 사용한 경우는 테스트 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 평균 PSD 그래 프를 나타내고 있다. 상기 도 13에서 푸른색 박스는 분류 활성화 신호 대비 원신호의 주파수 성분이 낮은 영역을 강조한다. 정상 데 이터를 정상으로 분류하기 위해, 모델은 원신호에는 두드러지지 않은 10Hz부터 50Hz 미만의 주파수 대역을 가중 치를 두어 참조하고 있다. 정상 상태와 달리 고장 상태별로 주파수 대역을 식별하기가 어려운 반면, 각각의 고 장 종류마다 진폭 차이가 나서 주파수 대역의 진폭 부분에 가중치를 두어 참조하고 있음을 확인할 수 있다. 모델 해석 실험 결과를 통해, 정상과 이상 상태를 포함한 모든 클래스에 대하여 모델이 주로 참조해서 보는 대 역이 원신호의 신호 성분과는 차이가 있음을 알 수 있다. 이 결과는 모델이 학습을 통해 필요한 정보에 가중치 를 부여하여 분류하고 있음을 나타낸다. FFT-CAM 적용 결과 도 14는 가속도 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 FFT-CAM 결과 그래프이고, 도 15는 토크 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 FFT-CAM 결과 그래프이다. 모델 결과에 대한 해석을 위해, FFT-CAM을 이용한 모델 해석을 수행하였다. 모델의 해석은 입력으로 이용되는 원신호(raw signal)의 주파수 대역의 파워 스펙트럼 밀도(PSD: Power spectrum density) 그래프와 FFT-CAM 기 법을 통한 분류 활성화 신호(CAM signal)의 파워 스펙트럼 밀도 그래프의 시각적 비교를 통해 결과를 도출한다. 모델의 동작을 설명하기 위해, 실제로 원신호가 포함하고 있는 신호의 주파수 성분과 모델이 주시하는 특성 신 호의 주파수 성분을 비교한다. 이를 통해 모델이 원신호의 어느 주파수 대역을 선별하여 분류에 활용하였는지에 대한 해석이 수행된다. 도 14는 가속도계를 사용한 경우를 나타내며, 테스트 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 평균 PSD 그래프를 제공한다. 상기 도 14에서 푸른색 박스는 원신호의 주파수 성분이 약 200Hz 부분에서 저주파 대역에 속함을 나타낸다. 볼 스크류측 결함에서 모델은 원신호의 950Hz, 1150Hz, 1250Hz, 2150Hz, 2300Hz, 2400Hz 부분의 주파수 피크값이 분류에 기여할 수 있음을 확인할 수 있다. 레일측 결함에서는 모델이 원신호의 1250Hz 주파수 대역에 가중치를 두어 참조하고 있다. 또한, 정상 데이터는 정상으로 분류하기 위해 1000Hz부터 2500Hz 미만의 주파수 대역에 강 하게 고려하고 있음을 확인할 수 있다. 도 15는 토크를 사용한 경우를 다루며, 테스트 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 평균 PSD 그래프를 제공한다. 상기 도 15에서 푸른색 박스는 원신호의 주파수 대역의 PSD 그래프로 저주파 대역에 속한다는 것을 나타낸다. 붉은색 박스는 모델이 원신호의 주파수 대역의 PSD 그래프에는 두드러지지 않은 분류 활성화 신호임을 나타낸다. 각 결함(볼스크류측, 레일측)과 정상 데이터의 주파수 대역이 원신호의 어느 부분에 분류 식별했는지 식별하기 어렵지만, 진폭 부분에서 큰 차이를 보이고 있어서 주파수 대역의 진폭 부분에 큰 가중치를 부여하고 있음을 확인할 수 있다. 모델 해석 실험 결과를 통해, 정상과 이상 상태를 포함한 모든 클래스에 대하여 모델이 주로 참조해서 보는 대 역이 원신호의 신호 성분과는 차이가 있음을 알 수 있다. 이 결과는 모델이 학습을 통해 필요한 정보에 가중치 를 부여하여 분류하고 있음을 나타낸다. 결론 상술한 바와 같이, 반도체 장비용 1축 로봇의 유격 이상을 진단하기 위해 진동 신호와 토크 신호를 이용한 XAI 기반의 고장 진단 방법을 실험하였다. 실험 결과, 다양한 센서를 활용한 2클래스 및 3클래스 분류 문제에서 높은 정확도를 보였다. 가속도 센서를 사용한 경우 정상/비정상을 구분하는 2클래스 문제에서는 모델에 따라 100%, 97%의 정확도를, 유 격 이상의 종류를 진단하는 3클래스 문제에서는 100%, 91%의 정확도를 보였다. 토크 센서를 사용하는 경우 정상/비정상을 구분하는 2클래스 문제에서는 모델에 따라 100%, 99%의 정확도를, 유 격 이상의 종류를 진단하는 3클래스 문제에서는 100%, 98%의 정확도를 보였다. 진동센서 및 토크 센서를 모두 사용하는 경우, 유격 이상과 이상의 종류를 검출할 수 있음을 확인하였다. 또한, Grad-CAM, FG-CAM, FFT-CAM을 사용한 분류 활성화 맵(CAM: Class Activation Map)의 주파수 대역 시각화 를 통해 모델의 이상 진단 이유를 해석하였다. Grad-CAM 기법을 적용한 결과, 가중치가 높은 주파수 영역이 저주파 대역에 위치해 있으며, 각각에 대해 식별하 기 어려웠다. 그러나, FG-CAM과 FFT-CAM에서는 모델이 원신호의 어느 주파수 대역을 주목하고 있는지 이상 상태를 식별할 수 있었다. 본 실험의 결과로서, Grad-CAM 기법에 대해 모델 해석이 쉽지 않았지만, 향후 연구에서 더 나은 XAI 기술과 모 델 개선을 통해 고장 진단의 정확도가 개선될 것으로 예측되었다. 아울러 본 발명은 단지 앞서 기술된 일 실시예에 의해서만 한정된 것은 아니며, 장치의 세부 구성이나 개수 및"}
{"patent_id": "10-2023-0130758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "배치 구조를 변경할 때에도 동일한 효과를 창출할 수 있는 것이므로 당해 기술분야에서 통상의 지식을 가진 자 라면 본 발명의 기술적 사상의 범주 내에서 다양한 구성의 부가 및 삭제, 변형이 가능한 것임을 명시하는 바이 다."}
{"patent_id": "10-2023-0130758", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명 XAI를 이용한 선형 이송 로봇의 고장 진단 방법을 예시한 개념도 도 2는 본 발명에 따른 미스얼라인먼트(misalignment)의 개념도 도 3은 본 발명의 실험에 이용된 장치 구성의 실사 이미지 도 4는 (a) 정상상태, (b) 레일 유격 이상이 있는 경우, 그리고 (c) 볼 스크류 축 유격 이상이 있는 상황에서의 가속도 신호 스펙트로그램과 원 신호를 나타낸 도면 도 5는 (a) 정상상태, (b) 레일 유격 이상이 있는 경우, 그리고 (c) 볼 스크류 축 유격 이상이 있는 상황에서의 토크 신호의 스펙트로그램과 원 신호를 그린 도면 도 6은 손실함수(가속도 데이터)의 변화 그래프: (a) 2 클래스(1D-CNN), (b) 3 클래스(1D-CNN), (c) 2 클래스 (2D-CNN), (d) 3 클래스(2D-CNN) 도 7은 손실함수(토크 데이터)의 변화 그래프: (a) 2 클래스(1D-CNN), (b) 3 클래스(1D-CNN), (c) 2 클래스 (2D-CNN), (d) 3 클래스(2D-CNN) 도 8은 혼동행렬(가속도 데이터) 그래프: (a) 2 클래스(1D-CNN), (b) 3 클래스(1D-CNN), (c) 2 클래스(2D- CNN), (d) 3 클래스(2D-CNN) 도 9는 혼동행렬(토크 데이터) 그래프: (a) 2 클래스(1D-CNN), (b) 3 클래스(1D-CNN), (c) 2 클래스(2D-CNN), (d) 3 클래스(2D-CNN) 도 10은 가속도 데이터를 STFT한 주파수 이미지에 Grad-CAM을 적용한 결과 도 11은 토크 데이터를 STFT한 주파수 이미지에 Grad-CAM을 적용한 결과 도 12는 가속도 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 FG-CAM 결과 그래프 도 13은 토크 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 FG-CAM 결과 그래프 도 14는 가속도 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 FFT-CAM 결과 그래프 도 15는 토크 데이터에 대한 결함(볼스크류측, 레일측)과 정상 클래스의 FFT-CAM 결과 그래프"}
