{"patent_id": "10-2023-0128951", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0045706", "출원번호": "10-2023-0128951", "발명의 명칭": "무선 통신 시스템에서 다계층 위성들 간 간섭을 제거하기 위한 장치 및 방법", "출원인": "아주대학교산학협력단", "발명자": "신원재"}}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 제1 위성 기지국의 동작 방법에 있어서,복수의 단말들을 통해 채널 정보를 추정하는 단계;상기 채널 정보를 기반으로 프리코더를 결정하는 단계;상기 복수의 단말들에 전송할 제1 데이터 신호를 생성하는 단계; 및상기 복수의 단말들에게 상기 프리코더를 기반으로 상기 제1 데이터 신호를 전송하는 단계를 포함하되,상기 제1 데이터 신호는 슈퍼 공유 메시지 및 제1 분할 메시지를 포함하고,상기 슈퍼 공유 메시지는 상기 복수의 단말들 및 제2 위성 기지국과 통신을 수행하는 단말이 공유하고 있는 코드북을 기반으로 부호화되는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 프리코더는 상기 복수의 단말들 각각의 트래픽 요구사항을 기반으로 결정되는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 슈퍼 공유 메시지 및 상기 제1 분할 메시지의 비율은 상기 제1 위성 기지국의 오프-보어사이트 각도(off-boresight angle)를 기반으로 결정되는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 복수의 단말들로부터 상기 제1 위성 기지국의 오프-보어사이트 각도들을 수신하는 단계를 더 포함하는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 제1 위성 기지국의 상기 오프-보어사이트 각도가 작아지면, 슈퍼 공유 메시지의 비율이 커지는, 제1 위성기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,공개특허 10-2025-0045706-3-상기 제1 분할 메시지는 공유 메시지 및 제2 분할 메시지들을 포함하고,상기 공유 메시지는 상기 복수의 단말들이 공유하고 있는 코드북을 기반으로 부호화되고,상기 제2 분할 메시지들 각각은 상기 복수의 단말들 각각이 가지고 있는 코드북을 기반으로 부호화되는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 제1 위성 기지국은 네트워크 코어, 제1 게이트웨이 및 제1 위성을 포함하고,상기 네트워크 코어는 상기 프리코더를 결정하고, 상기 제1 데이터 신호를 생성하고, 상기 네트워크 코어는 상기 제1 게이트웨이에 상기 프리코더 및 상기 제1 데이터 신호를 전송하고,상기 제1 게이트웨이는 피더링크를 통해 상기 프리코더 및 상기 제1 데이터 신호를 상기 제1 위성에 전송하고,상기 제1 위성은 상기 단말들에게 상기 프리코더를 기반으로 상기 제1 데이터 신호를 전송하는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 네트워크 코어가 상기 제2 위성 기지국이 전송할 제2 데이터 신호를 생성하는 단계를 더 포함하는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 제1 데이터 신호는 유니캐스트 방식을 기반으로 전송되고, 상기 제2 데이터 신호는 멀티캐스트 방식을 기반으로 전송되는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 제1 위성 기지국은 저궤도 위성을 기반으로 운영되고, 상기 제2 위성 기지국은 정지궤도 위성을 기반으로운영되는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 네트워크 코어는 슈퍼 공유 메시지에 대응하는 코드북을 상기 단말 및 상기 제2 위성 기지국과 통신을 수행하는 단말에게 전송하는 단계를 더 포함하는, 제1 위성 기지국의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "무선 통신 시스템에서 단말의 동작 방법에 있어서,공개특허 10-2025-0045706-4-제1 위성 기지국이 전송한 제1 데이터 신호 및 제2 위성 기지국이 전송한 제2 데이터 신호를 포함하는 중첩된데이터 신호를 수신하는 단계;상기 중첩된 데이터 신호를 기반으로 제1 데이터 신호에 포함된 슈퍼 공유 메시지를 복호화 하는 단계;상기 중첩된 데이터 신호에서 상기 슈퍼 공유 메시지를 제거한 제3 데이터 신호를 생성하는 단계; 및상기 제3 데이터 신호를 복호화하는 단계를 포함하되,상기 슈퍼 공유 메시지는 제1 위성 기지국과 통신을 수행하는 단말 및 제2 위성 기지국과 통신을 수행하는 단말이 공유하고 있는 코드북을 기반으로 부호화되는, 단말의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 제3 데이터 신호를 복호화하는 단계는,상기 제3 데이터 신호를 기반으로 상기 제2 데이터 신호를 간섭으로 간주하고 복호화하는, 단말의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 제3 데이터 신호를 복호화하는 단계는,상기 제3 데이터를 기반으로 공유 메시지를 복호화 하는 단계;상기 제3 데이터 신호에서 상기 공유 메시지를 제거하여 개인 메시지 신호를 생성하는 단계; 및상기 개인 메시지 신호를 기반으로 상기 단말에 대응하는 개인 매시지를 복호화 하는 단계를 포함하되,상기 공유 메시지는 상기 제1 위성 기지국과 통신을 수행하는 단말들끼리 공유하는 코드북으로 부호화된, 단말의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12 항에 있어서,상기 제3 데이터 신호를 복호화 하는 단계는상기 제3 데이터 신호를 기반으로 상기 제1 데이터 신호를 간섭으로 간주하고 복호화하는, 단말의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12 항에 있어서,상기 제1 데이터 신호에서 상기 슈퍼 공유 메시지의 비율은 상기 제1 위성 기지국의 오프-보어사이트 각도(off-boresight angle)를 기반으로 결정되는, 단말의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12 항에 있어서,상기 제1 데이터 신호는 유니캐스트 방식을 기반으로 전송되고, 상기 제2 데이터 신호는 멀티캐스트 방식을 기반으로 전송되는, 단말의 동작 방법.공개특허 10-2025-0045706-5-청구항 18 제12 항에 있어서,상기 제1 위성 기지국은 저궤도 위성을 기반으로 운영되고, 상기 제2 위성 기지국은 정지궤도 위성을 기반으로운영되는, 단말의 동작 방법."}
{"patent_id": "10-2023-0128951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "무선 통신 시스템에서 제1 위성 기지국에 있어서,송수신기; 및상기 송수신기에 연결된 적어도 하나의 프로세서를 포함하며,상기 적어도 하나의 프로세서는,복수의 단말들을 통해 채널 정보를 추정하고,상기 채널 정보를 기반으로 프리코더를 결정하고,상기 복수의 단말들에 전송할 제1 데이터 신호를 생성하고, 및상기 복수의 단말들에게 상기 프리코더를 기반으로 상기 제1 데이터 신호를 전송하도록 제어하되,상기 제1 데이터 신호는 슈퍼 공유 메시지 및 제1 분할 메시지를 포함하고,상기 슈퍼 공유 메시지는 상기 복수의 단말들 및 제2 위성 기지국과 통신을 수행하는 단말이 공유하고 있는 코드북을 기반으로 부호화되는, 제1 위성 기지국."}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 제1 위성 기지국의 동작 방법에 있어서 복수의 단말들을 통해 채널 정보를 추정 하는 단계, 상기 채널 정보를 기반으로 프리코더를 결정하는 단계, 상기 복수의 단말들에 전송할 제1 데이터 신 호를 생성하는 단계 및 상기 복수의 단말들에게 상기 프리코더를 기반으로 상기 제1 데이터 신호를 전송하는 단 계를 포함하되, 상기 제1 데이터 신호는 슈퍼 공유 메시지 및 제1 분할 메시지를 포함하고, 상기 슈퍼 공유 메시 지는 상기 복수의 단말들 및 제2 위성 기지국과 통신을 수행하는 단말이 공유하고 있는 코드북을 기반으로 부호 화될 수 있다."}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에 관한 것으로, 다계층 위성들 간 간섭을 제거하기 위해 전송률 분할 다중 접속 (Rate-Splitting Multiple Access, RSMA) 기법을 기반으로 신호를 송수신하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 접속 시스템이 음성이나 데이터 등과 같은 다양한 종류의 통신 서비스를 제공하기 위해 광범위하게 전개되 고 있다. 일반적으로 무선 접속 시스템은 가용한 시스템 자원(대역폭, 전송 파워 등)을 공유하여 다중 사용자와 의 통신을 지원할 수 있는 다중 접속(multiple access) 시스템이다. 다중 접속 시스템의 예들로는 CDMA(code division multiple access) 시스템, FDMA(frequency division multiple access) 시스템, TDMA(time division multiple access) 시스템, OFDMA(orthogonal frequency division multiple access) 시스템, SC-FDMA(single carrier frequency division multiple access) 시스템 등이 있다. 특히, 많은 통신 기기들이 큰 통신 용량을 요구하게 됨에 따라 기존 RAT(radio access technology)에 비해 향상 된 모바일 브로드밴드(enhanced mobile broadband, eMBB) 통신 기술이 제안되고 있다. 또한 다수의 기기 및 사 물들을 연결하여 언제 어디서나 다양한 서비스를 제공하는 mMTC(massive machine type communications) 뿐만 아니라 신뢰성 (reliability) 및 지연(latency) 민감한 서비스/UE(user equipment)를 고려한 통신 시스템이 제 안되고 있다. 이를 위한 다양한 기술 구성들이 제안되고 있다."}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 다계층 위성들 간 간섭을 제거하기 위한 장치 및 방법을 제공하는 것이다. 본 개시는 다계층 위성 네트워크에서 사용자마다 상이하게 요구하는 트래픽을 인지하여 저궤도 위성 네트워크에 서 고품질의 통신 서비스를 제공할 수 있는 방법 및 장치를 제공하는 것이다. 본 개시는 무선 통신 시스템에서 전송률 분할 다중 접속(Rate-Splitting Multiple Access, RSMA) 기법을 기반 으로 신호를 송수신하는 방법 및 장치를 제공하는 것이다. 본 개시는 무선 통신 시스템에서 정지궤도 위성 및 저궤도 위성 간 간섭을 제거하기 위한 방법 및 장치를 제공 하는 것이다. 본 개시는 무선 통신 시스템에서 슈퍼 공유 메시지를 이용하여 위성 간 간섭을 제거하기 위한 방법 및 장치를 제공하는 것이다. 본 개시는 무선 통신 시스템에서 저궤도 위성 및 단말이 공유 메시지를 통해 RSMA 기법을 기반으로 신호를 송수 신하는 방법 및 장치를 제공하는 것이다. 본 개시는 무선 통신 시스템에서 정지궤도 위성 및 단말이 멀티캐스트 메시지를 송수신하는 방법 및 장치를 제 공하는 것이다."}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 무선 통신 시스템에서 제1 위성 기지국의 동작 방법에 있어서, 복수의 단말들을 통해 채널 정보를 추정하는 단계, 상기 채널 정보를 기반으로 프리코더를 결정하는 단계, 상기 복수의 단말들에 전송할 제1 데이터 신호를 생성하는 단계, 상기 복수의 단말들에게 상기 프리코더를 기반으로 상기 제1 데이터 신호를 전송하는 단계를 포함하되, 상기 제1 데이터 신호는 슈퍼 공유 메시지 및 제1 분할 메시지를 포함하고, 상기 슈퍼 공유 메시지는 상기 복수의 단말들 및 제2 위성 기지국과 통신을 수행하는 단말이 공유하고 있는 코 드북을 기반으로 부호화될 수 있다. 본 개시의 일 실시예에 따르면, 무선 통신 시스템에서 단말의 동작 방법에 있어서, 복수의 위성들로부터 중첩된 데이터 신호를 수신하는 단계이되, 상기 중첩된 데이터 신호는 제1 위성 기지국이 전송한 제1 데이터 신호 및 제2 위성 기지국이 전송한 제2 데이터 신호를 포함하고, 상기 중첩된 데이터 신호를 기반으로 제1 데이터 신호 에 포함된 슈퍼 공유 메시지를 복호화 하는 단계, 상기 중첩된 데이터 신호에서 상기 슈퍼 공유메시지를 제거한 제3 데이터 신호를 생성하는 단계 및 상기 제3 데이터 신호를 복호화하는 단계를 포함하되, 상기 슈퍼 공유 메 시지는 제1 위성 기지국과 통신을 수행하는 단말 및 제2 위성 기지국과 통신을 수행하는 단말이 공유하고 있는 코드북을 기반으로 부호화될 수 있다. 본 개시의 일 실시예에 따르면, 무선 통신 시스템에서 제1 위성 기지국에 있어서, 송수신기 및 상기 송수신기에 연결된 적어도 하나의 프로세서를 포함하며, 상기 적어도 하나의 프로세서는, 복수의 단말들을 통해 채널 정보 를 추정하고, 상기 채널 정보를 기반으로 프리코더를 결정하고, 상기 복수의 단말들에 전송할 제1 데이터 신호 를 생성하고, 및 상기 복수의 단말들에게 상기 프리코더를 기반으로 상기 제1 데이터 신호를 전송하도록 제어하 되, 상기 제1 데이터 신호는 슈퍼 공유 메시지 및 제1 분할 메시지를 포함하고, 상기 슈퍼 공유 메시지는 상기 복수의 단말들 및 제2 위성 기지국과 통신을 수행하는 단말이 공유하고 있는 코드북을 기반으로 부호화될 수 있 다. 본 개시의 일 실시예에 따르면, 상기 프리코더는 상기 복수의 단말들 각각의 트래픽 요구사항을 기반으로 결정 될 수 있다. 본 개시의 일 실시예에 따르면, 상기 슈퍼 공유 메시지 및 상기 제1 분할 메시지의 비율은 상기 제1 위성 기지 국의 오프-보어사이트 각도(off-boresight angle)를 기반으로 결정될 수 있다."}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 기초한 실시 예들에 의해 하기와 같은 효과가 있을 수 있다. 복수의 비-지상 네트워크(non-terrestrial network, NTN)가 같은 주파수 대역에 공존하더라도, 상호 간 간섭이 효과적으로 제어될 수 있다. 단말의 트래픽 요구사항을 기반으로 효율적으로 무선 통신 자원을 수행할 수 있다."}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 개시의 실시 예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 이하의 본 개시의 실시 예들에 대한 기재로부터 본 개시의 기술 구성이 적용되는 기술분야에서 통상의 지식을 가진 자에게 명확하게 도출되고 이해될 수 있다. 즉, 본 개시에서 서술하는 구성을 실시함에 따"}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "른 의도하지 않은 효과들 역시 본 개시의 실시 예들로부터 당해 기술분야의 통상의 지식을 가진 자에 의해 도출 될 수 있다."}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 실시예들에서 사용되는 용어는 본 실시예들에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 부분에서 상세히 그 의미를 기재할 것이다. 따라서, 본 실시예들에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 실시예들 전반에 걸친 내용을 토대로 정의되어야 한다. 본 실시예들은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는 바, 일부 실시예들을 도면에 예시하 고 상세하게 설명하고자 한다. 그러나, 이는 본 실시예들을 특정한 개시형태에 대해 한정하려는 것이 아니며, 본 실시예들의 사상 및 기술범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한 다. 본 명세서에서 사용한 용어들은 단지 실시예들의 설명을 위해 사용된 것으로, 본 실시예들을 한정하려는 의도가 아니다."}
{"patent_id": "10-2023-0128951", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 실시예들에 사용되는 용어들은 다르게 정의되지 않는 한, 본 실시예들이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 일반적으로 사용되는 사전에 정의되어 있는 것 과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 실시 예들에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않아야 한다. 도 1은 본 개시의 일 실시예에 따른 위성 통신을 지원하는 네트워크의 예를 나타낸 도면이다. 도 1을 참고하면, 위성 네트워크는 단말, 위성들(120-1, 120-2), 게이트웨이를 포함한다. 단말은 사용자 장치이며, 이동성을 가지거나, 고정된 장치일 수 있다. 상기 단말은 단말의 능력(capability) 및 어 플리케이션 운용에 따라 가변적인 서비스 대역 및 운용 정보를 지원할 수 있다. 또한, 단말은 단말의 특징에 따라 고정된 형태, 이동성에 특화된 형태, 다양한 형태로 운용될 수 있다. 단말은 'UE(user equipment)'로 지칭될 수 있다. 위성들(120-1, 120-2)은 정해진 궤도를 비행/운용하며, 지상을 향해 빔을 형성 함으로써 일정 크기의 커버리지를 가지는 셀을 제공한다. 게이트웨이는 위성들(120-1, 120-2)에게 네트워 크에 접속할 수 있는 링크를 제공한다. 본 개시의 일 예에 따라 단말 및 위성(120-1) 간 링크는 서비스 링크라 지칭되며, 위성들(120-1, 120-2) 및 게이트웨이 간 링크는 피더(feeder) 링크라 불리운다. 여기서, 링크는, NR 규격에 기반하는 링크일 수 있다. 또는, 진화된 차세대 무선 통신 시스템에서 새롭게 정의되는 링크가 적응적으로 적용되거나 또는 NR 규격 이 아닌 산업계의 필요에 의해 도입된 통신 시스템의 다양한 인터페이스에 기반한 링크가 적용될 수 있다. 또한, 위성 간 링크(inter-satellite link, ISL)는 주로 재생(regenerative) 위성의 경우 사용될 수 있다. 일 예에 따라, NR-RAN 아키텍처에 기반한 트렌스페어런트(transparent) 위성의 경우, 피더 링크 및 서비스 링크 의 위성 라디오 인터페이스는 NR-Uu일 수 있다. 트렌스페어런트 위성의 경우, 위성은 무선 주파수 필터링과 주 파수 변환 및 증폭 기능을 수행한다. 재생 위성의 경우, 위성에 온보드(on board) 기능이 구축되고, 이에 따라 위성은 무선 주파수 필터링, 주파수 변환 및 증폭뿐만 아니라 스위치와 라우팅, 코딩과 변조 및 디코딩과 복조 와 같은 일부 또는 전체 기지국 기능을 수행할 수 있다. 도 2는 본 개시의 일 실시예에 따른 위성 통신을 지원하는 네트워크 시스템의 다른 예를 나타낸 도면이다. 도 2 는 NTN 페이로드(payload) 및 NTN 게이트웨이를 이용하여 단말에게 비-지상 접속을 제공하는 NTN의 일 예를 도시한다. 여기서, NTN 페이로드 및 단말 간 링크는 서비스 링크이고, Uu 인터페이스 에 기반할 수 있다. NTN 페이로드 및 NTN 게이트웨이 간 링크는 피더 링크이다. NTN 게이트웨이 및 AMF/UPF 간 링크는 NG 인터페이스에 기반할 수 있다. NTN 페이로드는 서비스 링크를 통해 단말 로부터 수신되는 무선 프로토콜을 트렌스페어런트하게(transparently) NTN 게이트웨이에게 전달 (forward)할 수 있다. 유사하게, NTN 페이로드는 피더 링크를 통해 NTN 게이트웨이로부터 수신되는 무선 프로토콜을 트렌스페어런트하게(transparently) 단말에게 전달(forward)할 수 있다. 이를 위해, NTN 페이로드에 의해 다음과 같은 연결성(connectivity)이 지원될 수 있다. 기지국이 복수의 NTN 페이로드들을 서비스할 수 있다. NTN 페이로드가 복수의 기지국들에 의해 서비스될 수 있다. NTN 페이로드는 서비스 링크에서 데이터를 재송신하기 전에 반송파 주파수를 변경할 수 있다. 즉, NTN 페 이로드는 서비스 링크 및 피드 링크에서 서로 다른 반송파 주파수들을 사용할 수 있다. NTN을 위하여, 네 트워크 식별자(network identifier)로서, AMF 네임(name), NCGI(NR cell global identifier), CgNB ID(identifier), 글로벌(global) gNB ID, TAI(tracking area identity), S-NSSAI(Single Network Slice Selection Assistance information), NSAG(Network Slice AS Group), NID(Network Identifier), CAG(Closed Access Group) ID, 로컬(Local) NG-RAN 노드 ID(Identifier) 중 적어도 하나가 사용될 수 있고, 추가적으로, 맵핑된 셀 ID(Mapped Cell ID)가 더 사용될 수 있다. 여기서, 트랙킹 지역(tracking area)은 고정된 지리적역 영역에 대응할 수 있다. 비-지구동기 궤도(Non-Geosynchronous orbit, NGSO)는 약 300km 내지 1500km 고도의 낮은 지구 궤도(low earth orbit) 및 약 7000km 내지 25000km 고도의 중간 지구 궤도(medium earth orbit)를 포함한다. 서비스 링크는 다음과 같은 3가지 타입들로서, 지구-고정(earth-fixed) 타입, 준-지구-고정(quasi-earth- fixed) 타입, 지구-이동(earth-moving) 타입으로 분류될 수 있다. 지구-고정 타입은 모든 시간에서 동일한 지리 적 영역을 지속적으로 커버하는(covering) 빔(들)을 제공한다. 예를 들어, 지구 동기 궤도(geosynchronousorbit, GSO)를 가지는 위성이 지구-고정 타입의 서비스 링크를 제공할 수 있다. 준-지구-고정 타입은 제한된 시 간구간(period) 동안 동일한 지리적 영역을 지속적으로 커버하는(covering) 빔(들)을 제공하고, 다른 시간구간 (period)들 동안 다른 지리적 영역을 커버하는 빔들을 제공한다. 예를 들어, 비-지구 동기 궤도를 가진 위성이 조향가능한(steerable) 빔들을 이용하여 준-지구-고정 타입의 서비스 링크를 제공할 수 있다. 지구-이동 타입은 커버리지 영역이 지구 표면을 움직이는(slide) 빔들을 제공한다. 예를 들어, 비-지구 동기 궤도를 가진 위성이 고정 또는 조향가능한 빔들을 이용하여 지구-이동 타입의 서비스 링크를 제공할 수 있다. 비-지구 동기 궤도를 가진 위성을 이용하여, 기지국은 준-지구-고정 셀 커버리지 또는 지구-이동 셀 커버리지를 제공할 수 있다. 지구 동기 궤도를 가진 위성을 이용하여, 기지국은 지구 고정 셀 커버리지를 제공할 수 있다. 비-지구 동기 궤도의 경우, 서비스 링크의 변경(switch)은 서빙 위성의 변경에 관련될(refer) 수 있다. 단말에 의한 사전-보상은 다음과 같이 수행될 수 있다. 서빙 셀에 대하여, 네트워크는 공통(common) TA(timing advance) 파라미터들 및 궤도 정보(ephemeris information)를 브로드캐스트할 수 있다. 여기서, 공통 TA는 NTN 페이로드 및 RP(reference point) 간 RTT에 대응하는 오프셋(offset)을 의미한다. 이에 따라, NTN 셀에 연결하 기 전, 단말은 위성 궤도 및 공통 TA에 대한 정보를 보유하며, 나아가, 유효한(valid) GNSS(global navigation satellite system) 위치를 가질 것이다. 동기화를 달성하기 위해, NTN 셀에 연결하기 전 및 연결 중인 동안, 단말은 GNSS 위치 및 위성 궤도에 기반하여 서비스 링크의 RTT(round trip time)을 계산하고, 하향링크 및 상향 링크 간 프레임 시간 차(예: TTA)를 사전-보상할 수 있다. 단말은 단말의 위치 및 위성 궤도를 고려하여 주파수 도플러 천이를 계산할 수 있다. 단말이 유효한 GNSS 위치 및/또는 유효한 위성 궤도를 보유하지 아니하면, 단말은 유효한 GNSS 위치 및 유효한 위성 궤도를 획득할 때까 지 네트워크와 통신할 수 없을 것이다. 연결 모드에서, 단말은 TA 및 주파수 사전-보상을 지속적으로 갱신할 수 있다. 단말은 랜덤 억세스 절차 동안 또는 연결 모드에서 TA를 보고하도록 설정될 수 있다. 연결 모드에서, 이 벤트-트리거 기반의 TA 보고가 지원될 수 있다. 서비스 링크에서 경험되는 순시적인(instantaneous) 도플러 천이의 사전-보상이 단말에 의해 수행되는 동안, 피 더 링크에서 경험되는 도플러 천이 및 응답 주파수 오차(transponder frequency error)의 관리는 위성 네트워크 의 구현에 의할 수 있다. O&M(operations and maintenance) 요구사항은 다음과 같다. 다음과 같은 NTN 관련 파라미터들이 O&M에 의해 비 -지상 접속을 제공하는 기지국에게 제공될 수 있다. 예를 들어, NTN 위성의 좌표 또는 궤적(orbital trajectory) 정보를 묘사하는 궤도 정보가 제공될 수 있다. 궤도 정보는 기지국의 요청에 따라 제공되거나 또는 정기적 방식(regular basis)으로 제공될 수 있다. 궤도 정보의 포맷으로서, 2가지 서로 다른 세트가 지원될 수 있다. 제1 세트는 위성 위치 및 속도 상태 벡터들을 포함, 즉, 위치 및 속도를 포함한다. 제2 세트는 장반경 (semi-major axis), 이심율(eccentricity), 근접 편각(argument of periapsis), 승교점 경도(longitude of ascending node), 궤도 경사각(inclination), 평균 근점 이각(mean anomaly at epoch time to) 중 적어도 하나 를 포함할 수 있다. 또한, NTN 게이트웨이들의 위치 정보, 피더/서비스 링크 스위치를 위한 기지국 동작을 가능 케 하기 위한 추가 정도가 더 제공될 수 있다. 위성의 궤도 및 NTN 게이트웨이의 위치에 관련된 정보는 상향링크 타이밍 및 주파수 동기화 중 적어도 하나를 위해 사용될 수 있다. 또한, 위성의 궤도 및 NTN 게이트웨이의 위치에 관련된 정보는 이동성(mobility) 관리 목 적 및 랜덤 억세스를 위해서도 사용될 수 있다. O&M에 의해 기지국에게 제공되는 NTN 관련 파라미터들은 지원되 는 서비스 링크의 타입(예: 지구-고정 빔, 준-지구-고정 빔, 이동 빔 등)에 의존할 수 있다. 도 3는 본 개시의 일 실시예에 따른 위성 통신을 지원하는 시스템에서 무선 장치의 예를 나타낸 도면이다. 본 개시의 실시 예에 따른 측위 시스템에 포함되는 무선 장치는 스마트폰, 태블릿 PC, 웨어러블 디바이스 등의 이동형 단말기일 수 있으나, 이에 한정되는 것은 아닐 수 있다. 도 3을 참고하면, 무선 장치는 적어도 하나의 제어부, 적어도 하나의 메모리, 적어도 하나의 전 원부, 적어도 하나의 송수신부, 적어도 하나의 입력부, 적어도 하나의 출력부 및/또는 적 어도 하나의 안테나를 포함할 수 있다. 제어부는 메모리 및/또는 송수신부를 제어할 수 있으며, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 구현하도록 구성될 수 있다. 메모리는 제어부와 연결될 수 있고, 제어부의 동작과 관련한 다양한 정보를 저장할 수 있다. 예를 들어, 메모리는 제어부에 의해 제어되는 제어들 중 일부 또는 전부를 수행하거나, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 수행하기 위한 명령들을 포함하는 소프트웨어 코드를 저장할 수 있다. 송수신부는 제 어부와 연결될 수 있고, 적어도 하나의 안테나를 통해 무선 신호를 송신 및/또는 수신할 수 있다. 송 수신부는 송신기 및/또는 수신기를 포함할 수 있다. 송수신부는 저궤도 위성의 신호를 수신하는 수신 기를 포함할 수 있다. 적어도 하나의 제어부는 컨트롤러, 마이크로 컨트롤러, 마이크로 프로세서 또는 마이크로 컴퓨터로 지칭될 수 있다. 적어도 하나의 제어부는 하드웨어, 펌웨어, 소프트웨어, 또는 이들의 조합에 의해 구현될 수 있 다. 일 예로, 적어도 하나의 ASIC(application specific integrated circuit), 적어도 하나의 DSP(digital signal processor), 적어도 하나의 DSPD(digital signal processing device), 적어도 하나의 PLD(programmable logic device) 또는 적어도 하나의 FPGA(field programmable gate arrays)가 적어도 하나의 제어부에 포 함될 수 있다. 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은 펌웨어 또는 소프트웨 어를 사용하여 구현될 수 있고, 펌웨어 또는 소프트웨어는 모듈, 절차, 기능 등을 포함하도록 구현될 수 있다. 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은 수행하도록 설정된 펌웨어 또는 소프 트웨어는 적어도 하나의 제어부에 포함되거나, 적어도 하나의 메모리에 저장되어 적어도 하나의 제어 부에 의해 구동될 수 있다. 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은 코 드, 명령어 및/또는 명령어의 집합 형태로 펌웨어 또는 소프트웨어를 사용하여 구현될 수 있다. 적어도 하나의 송수신부는 적어도 하나의 다른 장치에게 본 문서의 방법들 및/또는 동작 순서도 등에서 언 급되는 사용자 데이터, 제어 정보, 무선 신호/채널 등을 전송할 수 있다. 적어도 하나의 송수신부는 적어 도 하나의 다른 장치로부터 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도 등에서 언급 되는 사용자 데이터, 제어 정보, 무선 신호/채널 등을 수신할 수 있다. 예를 들어, 적어도 하나의 송수신부 는 적어도 하나의 제어부와 연결될 수 있고, 무선 신호를 송수신할 수 있다. 예를 들어, 적어도 하나 의 제어부는 적어도 하나의 송수신부가 적어도 하나의 다른 장치에게 사용자 데이터, 제어 정보 또는 무선 신호를 전송하도록 제어할 수 있다. 본 문서에서, 적어도 하나의 안테나는 복수의 물리 안테나이거나, 복수의 논리 안테나 (예: 안테나 포트)일 수 있다. 적어도 하나의 송수신부는 수신된 사용 자 데이터, 제어 정보, 무선 신호/채널 등을 적어도 하나의 제어부를 이용하여 처리하기 위해, 수신된 무 선 신호/채널 등을 RF 밴드 신호에서 베이스밴드 신호로 변환(convert)할 수 있다. 적어도 하나의 송수신부 는 적어도 하나의 제어부를 이용하여 처리된 사용자 데이터, 제어 정보, 무선 신호/채널 등을 베이스 밴드 신호에서 RF 밴드 신호로 변환할 수 있다. 입력부는 사용자 입력, 영상, 오디오 등의 정보를 획득하기 위한 구성 으로서, 각종 기계식/전자식 입력 수단, 카메라, 마이크로폰 등의 다양한 입력 수 단을 포함할 수 있다. 출력부는 시각, 청각, 또는 촉각 등 과 관련된 출력을 발생시켜 사용자 등에게 정보를 제공하기 위한 것으로서, 디스플레이, 스피커, 진 동 모듈 등 을 포함할 수 있다. 무선 장치는 전원부를 통해 전원을 공급하며, 전원부는 유/무선 충전 회로, 배터리 등을 포함할 수 있다. 무선 장치는 이동형 로봇, 차량, 기차, 유/무인 비행체(aerial vehicle, AV), 선박 등과 같은 이동 장치일 수 있다. 이 경우, 장치는 장치의 엔진, 모터, 파워 트레인, 바퀴, 브레이크, 조향 장치 중 적어도 하나를 포함 하는 구동부, 전원을 공급하며, 장치 주변의 상태 정보, 환경 정보, 사용자 정보를 센싱하는 센서부, 경로 유지, 속도 조절, 목적지 설정 등의 기능을 수행하는 자율 주행부, GPS(global positioning system) 및 다양한 센서를 통하여 이동체 위치 정보를 획득하는 위치 측정부 중 적어도 하나를 더 포함할 수 있다. 최근 넓은 지역에 서비스를 제공하는 정지궤도(Geostationary Orbit, GEO) 위성 네트워크와 상대적으로 낮은 지 연 특성(Low Earth Orbit, LEO)을 가지는 저궤도 위성이 공존하는 다계층 위성 네트워크(Multilayer Satellite Networks, MLSNs)가 운용되고 있다. 하지만 각각의 위성들은 고유의 커버리지를 가지고 있어, 정지궤도 위성과 저궤도 위성이 동일한 주파수 자원을 사용하는 경우 간섭이 발생할 수 있다. 이로 인해 위성들 사이의 신호 우 선순위 여부 등이 논의되고 있다. 본 개시는 정지궤도 위성과 저궤도 위성이 동일한 주파수 자원을 사용하고, 위성통신의 사용자 마다 상이하게 요구하는 트래픽을 인지함으로써, 두 위성 통신이 공존하는 네트워크에서 처리율(throughput)을 최대화할 수 있 는 방법 및 장치를 제안한다. 본 개시는 무선 통신에서 낭비되는 자원을 최소화하고 효율적인 서비스를 제공할 수 있다. 본 개시는 정지궤도 위성과 저궤도 위성이 동일한 주파수를 사용으로 인해 발생하는 위성 네트워크들 간의 간섭을 제거하기 위해 전송률 분할 다중 접속 (Rate-Splitting Multiple Access, RSMA) 기법을 사용한다. 따라서 다른 위성 네트워크들에 포함되는 신호의 빔 간섭 및 같은 위성 네트워크내 사용자 간의 빔 간섭을 효율적으로 제어될 수 있고, 신뢰성 높은 서비스가 제공될 수 있다. 최근에 6G 상용화를 위한 높은 트래픽과 다양한 서비스에 대한 요구 및 서비스 환경의 제약을 극복한 연결성을 보장하기 위한 요구가 증가되고 있다. 따라서 도심 지역을 중심으로 특정 지역에만 서비스를 제공하던 기존 지 상 네트워크와 함께, 광범위한 커버리지 특성을 갖는 위성 네트워크가 큰 주목을 받고 있다. 특히 위성 네트워 크는 전시 상황이나 치안이 좋지 않은 나라에서 통신을 할 수 있는 효율적인 수단이 될 수 있다. 위성은 고도에 따라 정지궤도, 중궤도(Medium Earth Orbit, MEO) 및 저궤도 위성으로 분류될 수 있다. 정지궤도 위성은 고도 35,786 km로 높은 고도에 위치하여 넓은 지역을 커버할 수 있고, 지구 자전 속도와 동일한 속도로 공존하여 이동성이 적다는 장점이 있다. 그러나, 정지궤도 위성을 이용한 통신은 신호 송수신을 위해서 540 ms 라는 긴 왕복 지연 시간(Round Trip Delay, RTD)이 발생하는 단점이 존재한다. 반면, 저궤도 위성은 고도 500 km ~ 2000 km로 낮은 고도에 위치하여 짧은 왕복 지연 시간을 갖는 장점이 있다. 하지만 저궤도 위성은 빠른 이 동속도와 상대적으로 좁은 커버리지 특성으로 인해 지구 전역에 서비스를 제공하기 위해서는 다수의 저궤도 위 성이 필요하다. 최근 발사체 비용의 절감, 초소형 위성 기술의 발달 등으로 저궤도 위성의 수가 급격하게 증가 함에 따라 군집 저궤도 위성을 활용한 통신 서비스가 증가하고 있다. 하지만 여전히 사용할 수 있는 주파수 자 원은 한정적이다. 따라서, 기존에 정지궤도 위성 네트워크에서 운용하던 주파수 자원을 저궤도 위성 네트워크와 공유하는 방안이 대두되고 있다. 정지궤도-저궤도 두 계층에서 주파수 자원을 공유 시 주파수 효율성과 서비스 신뢰도를 보장하기 위해서는 위성 네트워크 간, 그리고 위성 빔 간 발생하는 간섭을 관리할 수 있는 방안이 필 요하다. 도 4는 본 개시의 일 실시예에 따른 정지궤도 위성 및 저궤도 위성이 공존하는 다계층 위성 네트워크 의 예를 나타낸 도면이다. 도 4에서 정지궤도 위성과 통신하는 단말은 GEO 단말로 표시하였고, 테두 리는 점선으로 표시하였다. 저궤도 위성과 통신하는 단말은 LEO 단말로 표시하였고 테두리는 실선으 로 표시하였다. 정지궤도 위성은 지구의 자전 속도와 동일한 속도로 궤도를 돌기 때문에, 정지궤도 위성은 지상의 단 말들 입장에서는 정지한 것으로 보일 수 있다. 또한 정지궤도 위성은 멀티 빔 기술을 사용할 수 있으며, 여러 개의 좁은 빔을 사용하여 여러 지역에 집중적으로 서비스를 제공할 수 있다. 멀티 빔 기술은 채널 용량 효 율성을 증가시켜 전체적인 통신 효율성을 향상시킬 수 있다. 저궤도 위성은 지구의 자전 속도보다 빠른 속도로 궤도를 돌기 때문에 지상의 단말들 입장에서는 이동하는 것처럼 보일 수 있다. 저궤도 위성도 정지궤도 위성과 마찬가지로 멀티 빔을 활용할 수 있다. 저궤도 위성의 낮은 고도로 인해 저궤도 위성의 신호는 정지궤도 위성의 신호에 대해 강한 간섭으로 작 용한다. 따라서 제1 GEO 단말(430-1)은 저궤도 위성의 커버리지에 존재하기 때문에, 저궤도 위성이 제1 GEO 단말(430-1)에 가까이 오는 경우, 정지궤도 위성의 신호를 원할히 수신하지 못하는 상황이 발생할 수 있다. 하지만 제2 GEO 단말(430-2)은 저궤도 위성의 커버리지 밖에 존재하기 때문에 저궤도 위성 의 위치와 관계없이 정지궤도 위성과 신호 송수신을 원할히 수행할 수 있다. 따라서 제1 GEO 단말(430- 1)과 같은 상황에 있는 단말을 보호하기 위한 신호 송수신 절차가 필요하다. 다계층 위성 네트워크는 정지궤도 위성 네트워크에서 사용하던 주파수 자원을 군집 저궤도 위성 네트워크와 공 유하는 형식으로 구현될 수 있다. 이 경우, 상술한 바와 같이 같은 주파수 자원의 사용으로 인해 강한 간섭이 발생할 수 있다. 따라서 국제전기통신연합(International Telecommunication Union, ITU)에서는 두 계층의 위 성 네트워크가 주파수 자원을 공유할 때, 기존 정지궤도 위성의 신호를 저궤도 위성의 신호로 인해 수신할 수 없게 만드는 간섭을 일으키지 않도록 규제하고 있다. 도 5는 본 개시의 일 실시예에 따른 독점 영역(exclusive zone)의 예를 나타낸 도면이다. 도 5을 참고하면, 저 궤도 위성이 정지궤도 위성과 GEO 단말 사이의 가시거리(line-of-sight, LOS)에 근접할 때, 간 섭 회피 전략을 파악할 수 있다. GEO 단말 및 LEO 단말의 수신 안테나 방사 패턴은 특정 방향으로 높은 이득을 갖는 지향성으로 구성 될 수 있다. GEO 단말은 정지궤도 위성의 신호를 수신하기 위해 수신 안테나의 최대 이득이 되는 방 향이 정지궤도 위성을 향하도록 추적한다. 즉, 수신 안테나의 최대 이득이 되는 방향은 GEO 단말로부 터 정지궤도 위성을 향하는 방향이라 볼 수 있고, 해당 방향에 대한 축을 보어사이트 축(boresight axis) 으로 지칭된다. 도 3과 같이 보어사이트 축과 저궤도 위성의 위치에 따라 각도를 계산할 수 있다. 이러한 각도는 오프-보어사이트 각도(off-boresight angle)로 지칭된다. 오프-보어사이트 각도가 작을수록 GEO 단말은 저궤도 위성으로부터 강한 신호를 수신하고, 정지궤도 위성의 신호를 원활하게 수신하지 못 한다. 특히 GEO 단말은 수신 안테나의 주엽(main lobe)이 되는 방향으로 저궤도 위성으로부터 강한 간섭 신 호를 수신할 수 있다. 저궤도 위성의 신호의 강도가 임계 값을 넘어서는 경우, 저궤도 위성의 신호가 간섭으로 작용하여 정지궤도 위성의 신호가 원활하게 수신될 수 없다. 이때 GEO 단말이 수신한 저궤 도 위성의 신호에 의한 강한 간섭을 인라인 간섭(in-line interference)라고 한다. 현재 다계층 위성 네트 워크에서 기존의 정지궤도 위성 네트워크가 원활하게 동작할 수 있도록 인라인 간섭을 다루기 위한 다양한 간섭 회피 전략이 제시되고 있다. 먼저 도 5와 같이 독점 영역 방식이 제안될 수 있다. 독점 영역 방식은 저궤도 위성의 위치에 따라 GEO 사 용자의 오프-보어사이트 각도를 기반으로 저궤도 위성을 제어하는 방식이다. 독점 영역 방식은 만약 오프- 보어사이트 각도가 인라인 간섭을 일으킬 수 있는 각도보다 작은 경우, 저궤도 위성은 신호를 전송하지 않 는다. 독점 영역 방식은 인라인 간섭을 방지함으로써, 정지궤도 위성 네트워크를 보호할 수 있다. 하지만 독점 영역 방식은 독점 영역에 저궤도 위성이 진입하는 경우, 저궤도 위성 네트워크를 운용할 수 없는 단점이 존재한다. 점진적 피치(progressive pitch) 방식은 OneWeb에서 제안된 방식으로, 저궤도 위성의 커버리지 구멍을 줄이기 위해 고안된 방식이다. 정지궤도 위성은 적도면 부근에서 돌고 있으므로, GEO 단말이 적도면에 위치하고, 저궤 도 위성이 적도면에 근접함에 따라 인라인 간섭 상황이 발생할 수 있다. 인라인 간섭이 발생할 경우, 점진적 피 치 방식은 저궤도 위성의 빔을 다른 각도로 회전시키거나, 저궤도 위성이 사용하는 빔의 개수를 감소시킨다. 따 라서 저궤도 위성의 빔 방향이 GEO 단말의 수신 안테나 주엽에 들어가지 않도록 할 수 있다. 또한 저궤도 위성 에서 사용하는 빔의 개수를 감소시켜 GEO 단말에 수신되는 간섭 세기를 줄일 수 있다. 하지만 점진적 피치 방식 역시 적도면 근처에 위치하는 LEO 단말은 저궤도 위성으로부터 전송되는 신호의 크기가 감소하고, 다른 위도의 LEO 단말보다 낮은 품질의 통신이 서비스를 받게 된다. 밴드 분할(band splitting) 방식은 연방 통신 위원회(Federal Communications Commission, FCC)에서 도입한 방 식으로 정지궤도 위성 네트워크와 저궤도 위성 네트워크가 주파수 자원을 겹치지 않게 나누어서 사용한다. 이를 통해 두 네트워크 간의 간섭은 제거될 수 있다. 하지만 밴드 분할 방식은 사용가능한 대역폭이 줄어들어 기존 정지궤도 네트워크와 저궤도 네트워크 모두 고품질의 서비스를 보장할 수 없다. 인지 무선(cognitive radio) 방식은 주파수 효율성을 높이기 위해서 다계층 위성 네트워크에서 사용되고 있는 주파수 상황을 인지하고, 각 네트워크에 주파수 자원을 할당하는 방식이다. 국제전기통신연합의 규제에 따라 기 존 정지궤도 위성 네트워크가 주파수 자원을 우선적으로 사용하는 주 네트워크(primary network)로 동작한다. 저궤도 위성 네트워크는 정지궤도 위성 네트워크에서 사용하지 않는 주파수 자원을 감지하여 사용하는 부 네트 워크(secondary network)로 동작한다. 또한, GEO 단말이 저궤도 위성에 의한 간섭 유출(interference leakag e)에 따라 최적의 상황을 선택하여 정지궤도 위성 네트워크가 사용하는 주파수 자원 일부를 저궤도 위성 네트워 크와 공유할 수 있다. 그러나, 인지 무선 방식을 사용하면 인라인 간섭이 발생하는 영역에서 정지궤도 사용자가 받는 간섭 유출이 급격히 증가하기 때문에 저궤도 위성 네트워크에 할당되는 주파수 자원이 극히 제한된다. 따 라서, 인라인 간섭이 발생하는 영역에서는 저궤도 위성 네트워크의 서비스 품질이 저하될 수 있다. 상술한 바와 같이 인라인 간섭 영역에서 정지궤도 위성 네트워크를 보호하기 위한 다양한 전략이 논의되었으나, 저궤도 위성 네트워크가 고품질 서비스를 제공하는데 한계점이 존재한다. 따라서 본 개시는 전송률 분할 다중 접속 기술을 활용한 신호 송수신방법을 제안한다. 하기에서는 먼저 전송률 분할 다중 접속 기술을 서술하도록 한다. 도 6은 본 개시의 일 실시예에 따른 전송률 분할 다중 접속 기술을 사용하는 송신기의 예를 나타낸 도면이다. 도 6을 참고하면 K명의 사용자 각각에게 공유 메시지(common message) 및 개인 메시지(private message)를 전 송할 수 있다. 송신기는 메시지 분할부, 메시지 결합부, 인코더 및 선형 프리코더로 구성될 수 있다. 메시지 분할부는 K명의 사용자에 대한 K개의 메시지 W1 내지 메시지 WK를 입력으로 받아 각각을 공유 메시지와 개인 메시지로 분할한다. 예를 들어 메시지 분할부는 n 번째 사용자에 대한 메시지 Wn 을 공유 메 시지 Wc,n과 개인 메시지 Wp,n으로 분할 한다. 공유 메시지와 개인 메시지를 분할하는 기준은 상황에 따라 달라질 수 있으며, 각 사용자가 필요로 하는 서비스 및 채널 상태 등에 따라 달라질 수 있다. 메시지 분할부는 분할한 공유 메시지 K개의 공유 메시지 Wc,1 내지 Wc,K는 메시지 결합부에 전달하고, K개의 개인 메시지 Wp,1 내지 Wp,K는 인코더에 전달한다. 메시지 결합부는 K개의 공유 메시지 Wc,1 내지 Wc,K를 입력으로 받아 하나의 공유 메시지 Wc를 생성한다. 메 시지 결합부는 하나의 공유 메시지 Wc를 인코더에 전달한다. 인코더는 하나의 공유 메시지 Wc를 입력으로 받아 K명의 사용자가 공유하는 코드북(codebook)을 통해 하나 의 공유 스트림으로 부호화를 수행한다. 또한 인코더은 K개의 개인 메시지 Wp,1 내지 Wp,K를 수신하여 각 사 용자들에 대응되는 코드북을 통해 K개의 개인 스트림으로 부호화를 수행한다. 따라서 공유 스트림은 모든 사용 자가 복호화 가능한 반면, 개인 스트림은 자신의 메시지만 복호화를 수행할 수 있다. 인코더은 공유 스트 림 Sc 및 K개의 개인 스트림 S1 내지 Sk를 선형 프리코더에게 전달한다. 선형 프리코더은 공유 스트림 Sc 및 K개의 개인 스트림 S1 내지 Sk을 각각 대응되는 선형 프리코딩을 수행 하여 RSMA 신호를 송신 채널로 전송한다. 이후 K명의 사용자는 자신이 수신한 RSMA 신호를 기반으로 공유 메시 지 및 개인 메시지를 부호화 할 수 있다. 도 7은 본 개시의 일 실시예에 따른 수신한 RSMA 신호를 기반으로 공유 메시지 및 개인 매시지를 복호화 하는 절차의 예를 나타낸 도면이다. 도 7은 첫 번째 사용자가 복호화 하는 절차를 도시하였으나, 나머지 사용자들의 복호화 절차도 도 7과 동일한 방식으로 진행될 수 있다. 송신기이 송신한 신호를 수신한 제1 수신기는 제1 디코더(710-1)을 통해 공유 스트림 를 공유 메시지 로 디코딩한다. 제1 디코더(710-1)는 개인 메시지를 잡음으로 간주한 디코딩을 통해 공유 메시지 를 생성한다. 따라서 순차적 간섭 제거를 위해 공유 메시지를 먼저 디코딩하기 위해서는 중첩된 신호들 간 의 세기 차이가 존재할 수 있다. 공유 메시지 분할부는 를 분할해 제1 사용자에 대한 공유 메시지 을 생성한다. 순차적 간섭 제거부는 를 제1 디코더(710-1)로부터 전달받아 부호화, 프리코딩 및 채널코딩을 수행함 으로써, 공유 메시지 에 해당하는 스트림을 생성할 수 있다. 순차적 간섭 제거부는 수신한 신호로부터 공유 메시지 에 해당하는 스트림을 제거한 뒤, 제2 디코더(710-2)로 전달한다. 제2 디코더(710-2)는 공유 메시지 부분이 제거된 신호를 디코딩하여 제1 사용자를 위한 개인 메시지 을 디코딩한다. 개인 메시지를 각 사용자들에 대응되는 코드북을 통해 K개의 개인 스트림으로 부호화를 수행하였기 때문에 해당 사용자에 대한 메 시지만 디코딩할 수 있다. 마지막으로 결합부은 공유 메시지 및 개인 매시지 를 전달받아 결합함으로써 제1 사용자를 위한 전체 메시지 을 생성한다. 다른 사용자들도 같은 방식으로 자신의 메시지를 수신할 수 있다. 위성 통신에서 정지궤도 위성 네트워크는 정지궤도 지상국, 정지궤도 위성, 정지궤도 사용자로 구성될 수 있다. 또한 저궤도 위성 네트워크는 각각 저궤도 지상국, 저궤도 위성, 저궤도 사용자로 구성될 수 있다. 정지궤도 지 상국 및 저궤도 지상국은 네트워크 코어와 연결될 수 있다. 또한 지상국은 게이트웨이를 포함할 수 있다. 도 6 및 도 7에서 상술한 절차를 통해 전송률 분할 다중 접속 기술은 네트워크의 간섭 상황에 따라 각 메시지를 공유 메시지와 개인 메시지로 분할하는 비율을 결정할 수 있다. 저궤도 위성 사용자들 및 정지궤도 위성 사용자 들은 주파수를 공유하기 때문에 네트워크에 할당된 모든 주파수 자원을 사용할 수 있다. 따라서 효율적인 신호 송수신이 가능하다. 따라서 본 개시는 동일한 주파수 자원을 사용하는 위성들이 사용되는 다계층 위성 네트워크 에서, 전송률 분할 다중 접속 기술을 통해 슈퍼 공유 메시지를 기반으로 신호를 송수신하는 절차를 개시한다.하기에서는 저궤도 위성 및 정지궤도 위성에 적용되는 분할 다중접속 기술을 서술한다. 도 8은 본 개시의 일 실시예에 따른 저궤도 위성 기지국이 유니캐스트 메시지를 전송하는 절차의 예를 나타낸 도면이다. 저궤도 위성 네트워크는 다중 빔 기반 유니캐스트를 수행할 수 있다. 이때, 다중 접속 기술로 CDMA 시스템, FDMA 시스템 및 SC-FDMA 시스템 등이 사용될 수 있다. 분할 다중접속 기술을 사용할 예정이기 때문에 순차적 간섭 제거부가 필요하므로, 효율적인 통신 및 기기 사용을 위해 저궤도 위성 네트워크 내에서도 분할 다 중 접속 기술을 사용하는 것으로 먼저 서술하기로 한다. 먼저 저궤도 위성 기지국은 저궤도 사용자들에 송신할 데이터를 슈퍼 공유 메시지(Super-Common Message), 제1 분할 메시지로 분할한다. 슈퍼 공유 메시지는 모든 사용자가 공통된 코드북을 가지고 있어 LEO 사용자 및 GEO 사용자 모두 복호화 가능한 메시지이다. 이 때 슈퍼 공유 메시지는 LEO 사용자에 대한 데이터만 담고 있으며, GEO 사용자에 대한 데이터를 담지 않는다. 제1 분할 메시지는 LEO 사용자들에게 전송될 메시지로 다시 한번 전송률 분할 다중 접속 기술이 이용될 수 있다. 따라서 제1 분할 메시지를 공유 메시지 및 제2 분할 메시지로 분할할 할 수 있다. 이 때 제2 분할 메시지 를 LEO 사용자들 개별적으로 복호화 가능하게 할 수 있고 본 개시는 이를 개인 메시지로 정의한다. 공유 메시지는 모든 LEO 사용자가 공통된 코드북을 가지고 있어 복호화 가능하지만 GEO 사용자는 해당 코드북이 없으므로 간섭으로 간주하는 메시지이다. 개인 메시지는 해당하는 각 저궤도 사용자만 복호화가 가능한 메시지 이다. 따라서 저궤도 사용자는 슈퍼 공유 메시지를 복호화 한 뒤 순차적 간섭 제거 기법을 거친 뒤 공유 메시지 를 복호화 한다. 이후 다시 순차적 간섭 제거 기법을 거쳐, 최종적으로 각 사용자에 해당하는 개인 메시지를 복 호화 할 수 있다. 따라서 도 8과 같이 저궤도 위성 기지국은 유니캐스트 메시지를 전송하기 위해서 메시지 분할 유닛을 통해 슈퍼 공유 메시지, 저궤도 위성 공유 메시지 및 저궤도 위성 개인 매시지로 분할한다. 그리고 슈퍼 공유 메시지는 모 든 사용자가 공유하는 코드북을 통해 슈퍼 공유 스트림으로 부호화되므로, 정지궤도 위성의 사용자가 복호화 하 여 간섭 신호를 제거할 수 있다. 저궤도 위성 공유 메시지는 LEO 사용자들이 공유하는 코드북을 통해 부호화 되고, 저궤도 위성 개인 매시지는 해당 사용자에 대응하는 코드북을 통해 부호화 된다. 저궤도 위성 기지국은 부호화된 스트림들을 LEO 단말들에 게 전송한다. 도 8에서, 슈퍼 공유 메시지를 제외한 나머지 메시지를 공유 메시지 및 개인 메시지로 구성하여 전송률 분할 다 중 접속 방식 전송되는 것으로 기술하였으나, 반드시 이에 한정되는 것은 아니다. 일 예로, 저궤도 위성 기지국 은 슈퍼 공유 메시지와 개인 메시지만 분할하여 슈퍼 공유 메시지는 순차적 간섭 제거 기법으로 제거되고 개인 메시지는 개별적으로 복호화 할 수 있도록 분할할 수 있다. 도 9는 본 개시의 일 실시예에 따른 정지궤도 위성이 멀티캐스트 메시지를 전송하는 절차의 예를 나타낸 도면이 다. 정지궤도 위성은 멀티캐스트 메시지를 먼저 생성한다. 멀티캐스트 매시지는 GEO 단말들과 정지궤도 위성 기 지국만 공유하고 있는 코드북으로 부호화 된다. 정지궤도 위성 기지국은 부호화된 스트림들을 GEO 단말들에게 전송한다. 도 9에서는 정지궤도 위성은 멀티캐스트 메시지를 통해 GEO 단말들에게 동일한 메시지를 동시에 전송하는 것으 로 기술하였으나, 반드시 이에 한정되는 것이 아니다. 일 예로 정지궤도 위성 네트워크에서 다양한 다중 접속 기술이 이용될 수 있다. OFDM 시스템을 기반으로 여러 단말에게 다른 메시지를 전달할 수 있으며, 정지궤도 위 성의 메시지의 경우도 분할 다중 접속 기술을 활용하여 GEO 단말들에게 전송될 수 있다. 일 예로 정지궤도 위성 이 유니캐스트 메시지를 전송하는 경우, 유니캐스트 메시지를 정지궤도 공유 메시지와 정지궤도 개인 메시지를 분류하여 전송할 수 있다. 저궤도 위성 및 정지궤도 위성은 도 7 및 도 8에서 상술한 메시지들을 GEO 단말 및 LEO 단말들에게 전송한다. 정지궤도 위성이 형성한 빔 내에 존재하는 GEO 사용자들은 저궤도 위성 및 정지궤도 위성이 전송한 신호를 모두 수신하게 된다. 하지만 저궤도 위성이 전송한 신호 중 슈퍼 공유 메시지에 대한 코드북은 GEO 사용자들도 공유 하고 있기 때문에, GEO 사용자들은 수신한 신호중 슈퍼 공유 메시지를 복호화 할 수 있다. 따라서 GEO 사용자들 은 순차적 간섭 제거 기법을 이용하여 수신한 신호중 슈퍼 공유 메시지를 제거할 수 있다. GEO 사용자들은 슈퍼 공유 메시지가 제거된 신호를 이용하여 멀티캐스트 메시지를 복호화 할 수 있다. 따라서 저궤도 위성이 전송한 신호중 공유 메시지 및 개인 메시지만 잡음으로 작용하게 되므로 효율적인 위성 통신이 수행될 수 있다.또한 더 효율적인 통신을 수행하기 위해 프리코더를 최적화하는 방식이 고려될 수 있다. 위성 네트워크에서 위 성은 제한된 전송 파워를 가지는 반면에 넓은 커버리지로 인해 많은 사용자가 존재할 수 있다. 따라서 각 사용 자마다 요구하는 트래픽은 다양하게 변동되고, 편차가 높을 수 있다. 이를 보완하기 위해 위성 네트워크에서 프 리코더를 디자인할 때 특정 사용자들만의 처리율(throughput)을 높이는 처리율 합 최대화(throughput sum maximum)기법과 사용자들간 형평성을 보장하기 위해 모든 사용자 중 최소 처리율을 최대화하는 최대-최소 형평 성 처리율(max-min fairness rate, MMF Rate) 기법이 존재한다. 하지만 해당 기법들은 사용자가 요구하는 트래 픽을 기반으로 프리코더가 형성되지 않고, 채널상태를 기반으로 프리코더가 결정된다. 이로 인해 위성 네트워크 는 트래픽 요구에 맞게 사용자들에게 처리율을 제공할 수 없다. 따라서 적은 트래픽이 필요한 사용자에게 과도 한 자원이 할당될 수 있고, 많은 트래픽이 필요한 사용자에게는 부족한 자원이 할당될 수 있다. 이를 개선하기 위해 각 사용자가 요구하는 트래픽을 인지하여 위성 네트워크의 처리율을 최대화하고, 트래픽 요 구가 충족되지 못한 사용자가 존재한다면 낭비되는 자원을 해당 사용자가 사용할 수 있도록 프리코더를 디자인 할 수 있다. 이러한 기법을 하기에서 TTM(traffic-aware throughput maximization)으로 표기하도록 한다. 도 10은 본 개시의 일 실시예에 따른 다양한 전송 방법을 통해 나타날 수 있는 LEO 사용자의 처리율 성능의 예 를 나타낸 도면이다. 도 10의 실험 결과는 하기와 같은 가정으로 수행된 결과이다. 다계층 위성 네트워크에서, 정지궤도 위성 및 저궤도 위성은 20GHz의 주파수 대역을 공유하고, 각 위성은 2개의 빔을 지원하는 것으로 가정하였다. 정지궤도 위성은 빔 당 2명의 GEO 사용자에게 멀티캐스트 메시지를 전송하고, 저궤도 위성은 빔 당 2명의 LEO 사용자에게 유니캐스트 메시지를 전송한다. 또한 저궤도 위성 네트워 크 내에서는 전송률 분할 다중 접속 기법을 적용하였다. 저궤도 위성은 빠른 속도를 가지므로 부정확한 채널 상 태 정보를 측정할 수 있다고 가정한다. 다계층 위성 네트워크에서 저궤도 위성 네트워크보다 기존 정지궤도 위 성 네트워크를 우선적으로 보장한다고 가정한다. 따라서 GEO 사용자가 저궤도 위성으로부터 수신하는 간섭 유출 값이 임계 값보다 낮도록 유지되어야 하도록 설정하였다. 그러므로 GEO 사용자가 정지궤도 위성의 신호를 복호 화 할 수 있는 한도 내에서 저궤도 위성 신호가 전송될 수 있다. 도 10에서 각 사용자는 인라인 간섭 영역에 위치하며 각 사용자별 가장 왼쪽에 해당하는 막대 그래프는 각 사용 자가 요구하는 트래픽을 표시한다. 제1 사용자 내지 제4 사용자의 트래픽 요구는 각각 1.5, 1, 2.5, 1.5 [bits/s/Hz]로 가정하였다. 도 10 및 도 11에서 사용되는 용어는 하기 [표 1]과 같이 정의된다. 표 1 - SPC-RSMA TTM: 슈퍼 공유 메시지(super common message, SPC)를 도입한 전송률 분할 다중 접속 기술 을 기반으로 트래픽 인지 처리율 최대화 기법 - SPC-RSMA ST: 슈퍼 공유 메시지를 도입한 전송률 분할 다중 접속 기술 기반 처리율 최대화 기법 - SPC-RSMA MMF: 슈퍼 공유 메시지를 도입한 전송률 분할 다중 접속 기술 기반 최대-최소 형평성 전송 률 기법 - RSMA TTM: 기존 전송률 분할 다중 접속 기술 기반 트래픽 인지 처리율 최대화 기법 - SDMA TTM: 공간 분할 다중 접속(spatial division multiple access, SDMA)기반 트래픽 인지 처리율 최대화 기법 - Progressive pitch TTM: 점진적 피치 방식 기반 트래픽 인지 처리율 최대화 기법 - Band splitting TTM: 주파수 자원을 위성 네트워크마다 동일하게 나눈 트래픽 인지 처리율 최대화 기법 기존 RSMA TTM 기법과 SDMA TTM 기법은 정지궤도 사용자가 저궤도 위성으로부터 받는 간섭 유출 값이 제한되므 로, 저궤도 위성이 사용할 수 있는 파워에 제약이 생기는 것을 알 수 있다. 따라서 슈퍼 공유 메시지를 도입하 지 않는 RSMA 기법 및 SDMA 기법은 인라인 간섭 상황에서 저궤도 위성 송신 전력을 줄이는 방법으로 정지궤도 위성 네트워크를 유지시킬 수밖에 없다. 따라서 기존 기법은 도 10과 같이 LEO 사용자의 처리율 값이 낮게 형성 된다. Progressive pitch TTM 기법의 경우, 저궤도 위성이 사용하고 있는 빔 안에 제3 사용자 및 제4 사용자가 포함되 지만, 제3 사용자는 정지궤도 사용자 근처에 위치하여 간섭 유출에 대한 제약으로 인해 요구하는 트래픽보다 낮 은 처리율을 가진 통신 서비스를 받게 되어 원활한 통신이 수행되기 힘들다. Band splitting TTM 기법의 경우, 두 위성 네트워크가 통신 자원을 직교하게 나누어 사용하기 때문에, 두 위성 네트워크간 간섭은 없지만 자원을 나눈 만큼 처리율이 감소하게 된다.SPC-RSMA ST(sum throughput) 기법의 경우 기본적인 슈퍼 공유 메시지 방식으로, 사용자 형평성이 관계없이 채 널 상태에 따라 처리율이 결정될 수 있다. 총 처리율을 높이기 위해 채널 상태가 가장 좋은 제4 사용자에게 높 은 처리율이 제공되지만 나머지 사용자에게는 비교적 낮은 처리율이 제공되게 되는 단점이 존재할 수 있다. 따 라서 이를 극복하기 위해 슈퍼 공유 메시지를 사용하는 다른 자원 관리 방법이 제안될 수 있다. SPC-RSMA MMF 기법의 경우, 최소 처리율을 가장 높이는 기법으로 트래픽이 필요 없는 사용자에게 낭비되는 자원 할당이 발생할 수 있다. 즉, 도 10과 같이 제3 사용자가 요구하는 트래픽은 만족되지 못하는 반면, 제2 사용자 에게는 필요한 트래픽 보다 큰 처리율이 제공되는 상황이 발생할 수 있다. 따라서 많은 트래픽이 필요한 사용자 에게 더 많은 자원이 할당될 수 있는 추가적인 제어 동작이 필요할 수 있다. SPC-RSMA TTM 기법의 경우 요구하는 트래픽을 만족하지 못하는 사용자가 존재하는 경우, 트래픽 사용에 여유가 존재하는 다른 사용자의 자원을 할당하는 기법으로 불완전한 채널 상태 정보에서도 다른 기법에 비해 뛰어난 효 과를 보여줄 수 있다. 다만 SPC-RSMA TTM 기법은 트래픽 사용에 관한 추적이 필요하므로, 기지국 연산에 대한 제한 또는 지연속도의 제한으로 인해 사용하지 못하는 경우가 발생할 수 있다. 이 경우에는 SPC-RSMA ST 또는 SPC-RSMA MMF 기법이 등이 대신 활용될 수 있다. 또한 저궤도 위성은 지표면 대비 빠르게 움직이기 때문에 오프 -보어사이트 각도에 따른 처리율 변화량도 서비스 품질의 척도가 될 수 있으므로 하기에서 서술하기로 한다. 도 11은 본 개시의 일 실시예에 따른 GEO 사용자의 오프-보어사이트 각도에 따른 저궤도 위성 네트워크 처리율 성능의 예를 나타낸 도면이다. 저궤도 위성이 궤도를 따라 움직일 때, GEO 사용자가 측정하는 오프-보어사이트 각도가 변화된다. 일반적으로 오프-보어사이트 각도가 3°이내인 경우, GEO 사용자가 수신하는 간섭 유출 제약에 따라 저궤도 위성의 전송 전 력을 낮출 수밖에 없다. 따라서 저궤도 위성 네트워크 서비스는 원활하게 제공되기 어렵고, 저궤도 위성 네트워 크의 커버리지가 감소하게 된다. 실제로 도 11과 같이 오프-보어사이트 각도가 0°에 가까울수록 저궤도 네트워 크의 처리율 성능은 급속도로 떨어지게 된다. 하지만 본 개시에서 제안된 슈퍼 공유 메시지를 활용한 전송률 분 할 다중 접속 기법을 활용하면 슈퍼 공유 메시지를 순차적 간섭제거 기법으로 강한 저궤도 위성 신호를 수신한 신호로부터 제거할 수 있다. 위성들 간섭 상황에 따라 슈퍼 공유 메시지의 비율을 유동적으로 조절함으로써 인 라인 간섭 영역에서도 강인한 성능이 보장될 수 있다. 따라서 저궤도 위성의 전송 전력을 비교적 적게 낮추어도 정지궤도 위성 네트워크 서비스가 원활히 제공될 수 있고, 저궤도 위성 네트워크 서비스도 지속적으로 원활히 제공될 수 있다. 도 12는 본 개시의 일 실시예에 따른 정지궤도 위성 기지국이 단말에게 멀티캐스트 신호를 전송하는 절차의 예 를 나타낸 도면이다. 도 12에서 네트워크 코어가 수행하는 절차 및 정지궤도 위성이 수행하는 절차를 점선으로 된 박스 형태로 표시하였다. S1201 단계에서, 네트워크 코어는 정지궤도 위성과 단말들 사이의 채널 정보를 추정한다. 채널 추정을 위해 정 지궤도 위성은 단말에게 기준 신호를 전송하고, 단말은 수신한 기준 신호를 기반으로 정지궤도 위성 채널을 측 정할 수 있다. 단말은 측정한 채널 정보를 정지궤도 위성으로 전송할 수 있다. 정지궤도 위성은 피더 링크를 통 해 네트워크 코어에 채널 측정 보고를 전달할 수 있다. S1203 단계에서, 네트워크 코어는 정지궤도 위성 사용자들을 위한 프리코더를 결정한다. 네트워크 코어는 채널 측정 보고를 기반으로 최적의 프리코더를 결정할 수 있다. 프리코더를 최적화하는 방법은 다양하게 구성될 수 있고, 프리코더의 최적화를 위해 인공지능 등이 사용될 수 있다. 프리코더는 처리율 합이 최대가 되도록 설계되 거나, 단말의 최소 처리율이 보장되도록 설계될 수 있다. 또한, 프리코더는 단말의 트래픽 요구치에 따라 유동 적으로 자원을 할당하는 형태로 설계될 수 있다. 또한 프리코더는 인덱스 기반으로 설정될 수 있다. 따라서 네트워크 코어는 코드북으로부터 특정 프리코딩 행렬 을 선택할 수 있다. 프리코딩 행렬을 선택한 네트워크 코어는 전송 랭크에 대응하는 개수의 레이어 신호와 선택 된 프리코딩 행렬을 곱하는 방식으로 선형 프리코딩을 수행할 수 있다. S1205 단계에서, 네트워크 코어는 단말들을 위한 멀티캐스트 메시지를 부호화한다. 네트워크 코어는 멀티캐스트 메시지를 생성하고, 해당 멀티캐스트 메시지를 부호화할 수 있다. 부호화에 사용되는 코드북은 GEO 단말 및 정 지궤도 위성만 공유하고 있으므로 LEO 단말은 디코딩할 수 없다. S1207 단계에서, 네트워크 코어는 게이트웨이로 부호화한 데이터 및 결정된 프리코더를 게이트웨이로 전송한다. 게이트웨이는 피더 링크를 통해 정지궤도 위성으로 부호화한 데이터 및 프리코더를 전송한다.S1209 단계에서, 정지궤도 위성은 피더 링크를 통해 게이트웨이로부터 부호화한 데이터 및 프리코더를 수신한다. S1211 단계에서, 정지궤도 위성은 수신한 프리코더를 기반으로 멀티캐스트 신호를 전송한다. 네트워크 코어가 복수의 단말에게 동시에 보내기로 결정하였다면, 정지궤도 위성은 부호화한 데이터를 멀티캐스트 신호로 전송할 수 있다. 도 12에서 멀티캐스트 신호를 전송하는 절차를 개시하였지만 정지궤도 위성이 반드시 멀티캐스트 신호를 전송하 는 것으로 한정하는 것은 아니다. 일 예로 부호화한 데이터가 각 단말들에게 다른 정보를 전달하는 메시지인 경 우, OFDM 방식을 기반으로 유니캐스트 신호를 전송할 수 있다. 이때도 GEO 단말은 동일하게 슈퍼 공유 메시지를 활용할 수 있다. 즉, 본 개시는 GEO 단말이 슈퍼 공유 메시지를 통해 저궤도 위성의 신호를 제거할 수 있기 때 문에 저궤도 위성의 잡음 유출에 대한 간섭에 강인한 특성을 가진다. 따라서 본 개시는 정지궤도 위성 신호의 전송 형태에 구애받지 않고 슈퍼 공유 메시지가 활용될 수 있다. 또한 상술한 바와 같이 반드시 네트워크 코어 와 정지궤도 위성의 역할이 따로 분리될 필요는 없으며, 상술한 절차는 하나의 위성 기지국의 형태로 수행될 수 있다. 즉 하나의 위성 기지국이 전송할 데이터를 생성하고 해당 데이터를 부호화하고, 채널 추정을 통해 프리코 더를 결정한 뒤, 단말에게 멀티캐스트 신호를 전송할 수 있다. 따라서, 이 경우 게이트웨이가 네트워크 코어로 부터 신호를 수신하여 피더 링크를 통해 정지궤도 위성으로 전송하는 절차가 생략될 수 있다. 도 13은 본 개시의 일 실시예에 따른 저궤도 위성 기지국이 단말에게 유니캐스트 신호를 전송하는 절차의 예를 도시한 도면이다. 도 13에서 네트워크 코어가 수행하는 절차 및 저궤도 위성이 수행하는 절차를 점선으로 된 박 스 형태로 표시하였다. S1301 단계에서, 네트워크 코어는 저궤도 위성과 단말들 사이의 채널 정보를 추정한다. 채널 추정을 위해 저궤 도 위성은 단말에게 기준 신호를 전송하고, 단말은 수신한 기준 신호를 기반으로 저궤도 위성 채널을 측정할 수 있다. 단말은 측정한 채널 상태를 저궤도 위성으로 전송할 수 있다. 저궤도 위성은 피더 링크를 통해 네트워크 코어에 채널 측정 보고를 전달할 수 있다. S1303 단계에서, 네트워크 코어는 저궤도 위성 사용자들을 위한 프리코더를 결정한다. 네트워크 코어는 채널 측 정 보고를 기반으로 최적의 프리코더를 결정할 수 있다. 프리코더를 최적화하는 방법은 다양하게 구성될 수 있 고, 프리코더의 최적화를 위해 인공지능 등이 사용될 수 있다. 프리코더는 처리율 합이 최대가 되도록 설계되거 나, 단말의 최소 처리율이 보장되도록 설계될 수 있다. 또한, 프리코더는 단말의 트래픽 요구치에 따라 유동적 으로 자원을 할당하는 형태로 설계될 수 있다. 또한 프리코더는 인덱스 기반으로 설정될 수 있다. 따라서 네트워크 코어는 코드북으로부터 특정 프리코딩 행렬 을 선택할 수 있다. 프리코딩 행렬을 선택한 네트워크 코어는 전송 랭크에 대응하는 개수의 레이어 신호에 선택 된 프리코딩 행렬을 곱하는 방식으로 선형 프리코딩을 수행할 수 있다. S1305 단계에서, 네트워크 코어는 단말들을 위한 유니캐스트 메시지를 부호화한다. 네트워크 코어는 각 단말에 대한 메시지를 생성하고, 해당 매시지를 각각을 부호화할 수 있다. 이때 전송률 분할 다중 접속 기술이 적용될 수 있다. 이를 위해 네트워크 코어는 도 6에서 상술한 절차를 수행할 수 있다. 먼저 네트워크 코어는 각 단말들에 대한 유니캐스트 메시지들을 슈퍼 공유 메시지들과 제1 분할 메시지들로 분 할한다. 슈퍼 공유 메시지들은 결합되어 하나의 슈퍼 공유 메시지로 통합되어 부호화된다. 슈퍼 공유 메시지를 부호화하는 코드북은 GEO 단말들 및 LEO 단말들에게 모두 공유된다. 따라서 슈퍼 공유 메시지는 GEO 단말들에 의해 디코딩될 수 있어, 순차적 간섭 제거 기법으로 제거될 수 있다. 전체 메시지들 중 슈퍼 공유 메시지들이 차지하는 비율은 정지궤도 위성과 저궤도 위성의 위치관계에 의해서 달 라질 수 있다. 일 예로, 슈퍼 공유 메시지들이 차지하는 비율은 복수의 정지궤도 사용자들의 오프-보어사이트 각도를 기반으로 결정될 수 있다. 즉, 오프-보어사이트 각도가 작아질수록 큰 간섭 유출이 발생하므로, 네트워 크 코어는 슈퍼 공유 메시지들이 차지하는 비율을 증가시킬 수 있다. 반대로 오프-오버사이트 각도가 커질수록 작은 간섭 유출이 발생하므로, 네트워크 코어는 슈퍼 공유 메시지들이 차지하는 비율을 감소시킬 수 있다. 따라서 공유 메시지들이 차지하는 비율을 결정하기 위해 네트워크 코어는 오프-보어사이트 각도 측정을 수행하 도록 단말에게 지시할 수 있다. 일 예로, 오프-보어사이트 각도는 S1301 단계에서 네트워크 코어가 단말에게 채 널 정보 추정 결과와 함께 오프-보어사이트 각도를 보고하도록 지시할 수 있다. 해당 지시는 단말에게 RRC(radio resource control) 메시지 형태로 지시될 수 있다. 다른 일 예로, 네트워크 코어가 단말의 위치 정보를 알고 있는 경우, 단말의 위치, 위성들의 궤도, 위성의 위치, 위성의 속도 또는 통신 시간 중 적어도 하나 이 상을 기반으로 오프-보어사이트 각도를 직접 계산할 수도 있다. 제1 분할 메시지들은 다양한 방식으로 LEO 단말들에게 전송될 수 있다. 일 예로, 제1 분할 메시지들은 각 LEO 단말들에 대응하는 코드북으로 부호화 될 수 있다. 따라서 LEO 단말들은 슈퍼 공유 메시지를 순차적 간섭제거를 통해 제거한 뒤, 제1 분할 메시지들을 디코딩할 수 있다. 다른 일 예로, 제1 분할 메시지들을 다시 전송률 분할 다중 접속 기술을 적용하여 공유 메시지와 개인 매시지로 나눌 수 있다. 이 때, 공유 메시지들은 LEO 단말들만 공유하는 코드북으로 부호화 될 수 있다. 개인 메시지들은 각 LEO 단말들에 대응하는 코드북으로 부호화 될 수 있다. 이 경우, LEO 단말들은 슈퍼 공유 메시지를 순차적 간섭 제거 기법을 통해 제거한 뒤, 다시 공유 메시지를 순차적 간섭 제거 기법을 통해 제거할 수 있다. 그 후, LEO 단말들 각각은 자신이 가지고 있는 코드북을 기반으로 개인 메시지들을 개별적으로 디코딩할 수 있다. S1307 단계에서, 네트워크 코어는 게이트웨이로 부호화한 데이터 및 결정된 프리코더를 게이트웨이로 전송한다. 게이트웨이는 피더 링크를 통해 저궤도 위성으로 부호화한 데이터 및 프리코더를 전송한다. S1309 단계에서, 저궤도 위성은 피더 링크를 통해 게이트웨이로부터 부호화한 데이터 및 프리코더를 수신한다. S1311 단계에서, 저궤도 위성은 수신한 프리코더를 기반으로 유니캐스트 신호를 전송한다. 본 개시는 상술한 절차에 한정되는 것은 아니다. 네트워크 코어, 게이트웨이 및 위성의 기능을 통합하는 기기를 위성 기지국으로 지칭될 수 있다. 즉, 위성 기지국은 네트워크 코어 및 정지궤도 위성이 하는 역할이 모두 포함 된 하나의 기기로 작동할 수 있으며, 이경우 S1307 및 S1309 단계가 생략될 수 있다. 도12 및 도 13에서 상술한 절차는 정지궤도 위성 및 저궤도 위성의 주파수 대역이 동일한 경우에 사용될 수 있 다. 일 예로, 네트워크 코어는 정지궤도 위성 및 저궤도 위성을 같은 주파수 대역에서 동시에 서비스하는 운영 자에 의해 제어될 수 있다. 다른 일 예로, 정지궤도 위성 및 저궤도 위성을 서비스하는 운영자가 달라 각각 다 른 네트워크 코어에 의해 제어될 수 있다. 이 경우는 다른 서비스 운영자에 속하는 단말들끼리 슈퍼 공유 메시 지를 디코딩할 코드북을 공유할 수 있어야 한다. 따라서 코드북을 공유하는 절차가 추가될 수 있다. 일 예로 저 궤도 위성 및 정지궤도 위성을 동일한 운영자가 서비스하는 경우에 네트워크 코어는 슈퍼 공유 메시지에 관한 코드북을 GEO 단말 및 LEO 단말 모두에게 전송할 수 있다. 다른 일 예로 저궤도 위성 및 정지궤도 위성을 다른 운영자들이 서비스하는 경우에는 부 네트워크로 동작하는 네트워크 코어에서 주 네트워크로 동작하는 네트워크 로 슈퍼 공유 메시지에 관한 코드북을 전송할 수 있다. 도 14는 본 개시의 일 실시예에 따른 위성 네트워크를 사용하는 단말들이 신호를 수신하는 절차의 예를 나타낸 도면이다. 도 14를 참고하면, GEO 단말 및 LEO 단말 모두 공통된 절차로 슈퍼 공유 메시지를 제거할 수 있다. S1401 단계에서, 단말은 복수의 위성들로부터 신호를 수신한다. 복수의 위성들은 다계층 위성 네트워크에 포함 되는 위성들 일 수 있으며, 저궤도 위성 및 정지궤도 위성을 포함할 수 있다. GEO 단말 및 LEO 단말 모두 정지 궤도 위성의 빔 커버리지 및 저궤도 위성의 빔 커버리지 내에 존재할 수 있으며, 단말은 복수의 위성들로부터 동시에 신호를 수신한다. S1403 단계에서, 단말은 수신한 신호를 이용하여, 슈퍼 공유 메시지를 복호화 한다. 이를 위해 슈퍼 공유 메시 지를 복호화 하는데 사용되는 코드북은 위성 네트워크에 포함된 모든 단말들이 공유하고 있어야 한다. 따라서 슈퍼 공유 메시지에 대응하는 코드북을 수신하기 위해서 네트워크 코어로부터 슈퍼 공유 메시지에 대응하는 코 드북을 수신하는 절차가 선행될 수 있다. S1405 단계에서, 복호화한 슈퍼 공유 메시지를 기반으로 순차적 간섭 제거 기법을 통해 위성으로 수신한 신호로 부터 슈퍼 공유 메시지를 제거한다. 이를 위해 단말은 위성들로부터 수신한 신호에서 복호화한 슈퍼 공유 메시 지를 기반으로 부호화, 프리코딩 및 채널코딩 절차를 수행하여 생성된 신호를 빼는 절차를 수행할 수 있다. S1407 단계에서, 단말은 슈퍼 공유 메시지가 제거된 메시지를 복호화한다. 슈퍼 공유 메시지가 제거된 메시지를 복호화 하는 방법은 도 15와 같이 단말별로 다르게 수행될 수 있다. 도 15는 본 개시의 일 실시예에 따른 단말이 슈퍼 공유 메시지가 제거된 메시지를 복호화 하는 절차의 예를 나 타낸 도면이다. S1501 단계에서, 단말들은 슈퍼 공유 메시지가 제거된 신호를 획득한다. 도 14에서 상술한 절차를 이용하여, 순 차적 간섭제거를 통해 슈퍼 공유 메시지를 제거할 수 있다. 이후 GEO 단말은 S1503 단계를 수행하고, LEO 단말은 S1505 단계를 수행한다. S1503 단계에서, GEO 단말은 슈퍼 공유 메시지가 제거된 신호로부터 멀티캐스트 메시지를 복호화 한다. GEO 단 말은 인라인 간섭 상황에서도 슈퍼 공유 메시지를 수신한 신호에서 제거할 수 있으므로, 저궤도 위성에서 오는 신호를 효과적으로 제거할 수 있다. 즉, GEO 단말은 수신한 신호로부터 슈퍼 공유 메시지를 제거한 뒤이므로, 저궤도 위성의 신호 중 슈퍼 공유 메시지 외의 나머지 신호는 간섭으로 간주해도 충분히 복화화를 수행할 수 있 다. S1505 단계에서, LEO 단말은 슈퍼 공유 메시지가 제거된 신호로부터 공유 메시지를 복호화 한다. LEO 단말들은 공유 메시지에 대응하는 코드북을 가지고 있으므로, 공유 메시지를 복호화 할 수 있다. 반면에 GEO 단말들은 공 유 메시지에 대응하는 코드북을 가지고 있지 않으므로, 저궤도 위성 신호를 복호화 할 수 없다. LEO 단말들은 복호화한 공유 메시지를 기반으로 순차적 간섭 제거 기법을 이용하여 슈퍼 공유 메시지가 제거된 메시지에서 공 유 메시지를 제거할 수 있다. 즉, LEO단말은 정지궤도 위성의 신호를 간섭으로 보고 복화화를 수행할 수 있다. S1507 단계에서, LEO 단말은 개인 메시지를 복호화 한다. 단말은 위성들로부터 수신한 신호에서 슈퍼 공유 메시 지 및 공유 메시지를 제거된 신호를 기반으로 자신에 대응하는 개인 메시지를 복호화 할 수 있다. 개인 매시지 를 복호화하기 위한 코드북들은 LEO 단말별로 설정되고, 따라서 자신의 개인 메시지만 복호화할 수 있다. 도 15는 저궤도 위성 네트워크내에서 다시 공유 메시지 및 개인 메시지로 나누는 전송률 분할 다중 접속 기술을 적용한 경우를 설명하였으나 반드시 전송률 분할 다중 접속 기술이 적용되어야 하는 것은 아니다. 따라서 다른 일 예로, 저궤도 위성 네트워크 코어는 전송할 데이터를 공유 메시지 없이 슈퍼 공유 메시지 및 개인 메시지로 만 나누어 부호화하고, 그로 인해 단말은 슈퍼 공유 메시지를 제거하고 곧바로 개인 메시지를 디코딩할 수 있다. 도 16은 본 개시의 일 실시예에 따른 슈퍼 공유 메시지를 이용한 통신에서 저궤도 위성, 정지궤도 위성 및 단말 들 사이의 시그널링의 예를 나타낸 도면이다. S1601 단계에서, 저궤도 위성 기지국, 정지궤도 위성 기지국은 GEO 단말 및 LEO 단말(164 0)을 이용하여 채널 추정을 수행한다. 상술한 바와 같이 이를 위해 저궤도 위성 기지국은 LEO 단말(164 0)단말에게 기준 신호를 전송하고, LEO 단말은 기준 신호를 기반으로 저궤도 위성 기지국에게 채널 측정 보고서를 전송할 수 있다. 마찬가지로 정지궤도 위성 기지국 및 GEO 단말과 기준 신호 및 채 널 측정 보고서를 송수신할 수 있다. 저궤도 위성 기지국 및 정지궤도 위성 기지국은 채널 측정 보 고서를 기반으로 프리코더를 결정할 수 있다. 또한 저궤도 위성 기지국 단말들의 트래픽 요구사항을 기반 으로 프리코더를 결정할 수 있다. 또한 저궤도 위성 기지국은 GEO 단말로부터 오프-보어사이트 각 도를 수신하고 정지궤도 위성 기지국에게 공유할 수 있다. S1603 단계에서, 저궤도 위성 기지국은 슈퍼 공유 메시지가 포함된 유니 캐스트 메시지를 생성한다. 이를 위해 도 6에서 상술한 송신기가 사용될 수 있다. 저궤도 위성 기지국은 유니캐스트 메시지를 전송하기 위 해서 메시지 분할 유닛을 통해 슈퍼 공유 메시지 및 제1 분할 메시지로 분할할 수 있다. 이때 상기 슈퍼 공유 메시지 및 제1 분할 메시지의 비율은 상기 저궤도 위성 기지국의 오프-보어사이트 각도(off-boresight angle)를 기반으로 결정될 수 있다. 만약 저궤도 위성 네트워크 내에서 전송률 분할 다중 접속 기술을 이용하는 경우, 추가적으로 제1 분할 메시지를 다시 공유 메시지 및 제2 분할 메시지로 분할할 수 있다. 슈퍼 공유 메시지를 복호화 하기 위한 코드북은 GEO 단말 및 LEO 단말이 공유할 수 있다. 제1 분할 메시지를 복호화 하기 위한 코드북은 GEO 단말에게 공유하지 않으므로 GEO 단말은 제1 분할 메시지 를 복호화 할 수 없다. 제1 분할 메시지가 공유 메시지 및 제2 분할 메시지를 포함하는 경우 공유 메시지를 복 호화 하기 위한 코드북은 저궤도 위성 기지국의 네트워크에 포함되는 단말들끼리 공유된다. 단 제2 분할 메시지에 대한 코드북은 LEO 단말만 가지고 있으므로, 다른 단말들이 복호화 할 수 없다. S1605 단계에서, 정지궤도 위성 기지국은 멀티 캐스트 메시지를 생성한다. 이때 S1601 단계에서 결정된 프리코더가 사용될 수 있다. S1607 단계에서, 저궤도 위성 기지국은 LEO 단말에게 유니캐스트 메시지를 전송한다. 이때 GEO 단 말도 저궤도 위성 기지국의 신호가 수신되므로, 저궤도 위성 기지국의 유니캐스트 메시지는 간섭으로 취급되고 제거되어야 한다. 따라서 GEO 단말이 복호화 할 수 있는 슈퍼 공유 메시지가 필요하다. 이때 S1601 단계에서 결정된 프리코더가 사용될 수 있다.S1609 단계에서, 정지궤도 위성 기지국은 멀티캐스트 메시지를 GEO 단말에게 전송한다. 이때 LEO 단말도 저궤도 위성 기지국의 신호가 수신된다. 정지궤도 위성 기지국의 신호는 저궤도 위성 기지국의 신호보다 세기가 약하므로, LEO 단말은 정지궤도 위성 기지국의 멀티캐스트 메시지 의 간섭으로 보고 복호화를 수행할 수 있다. S1611 단계에서, GEO 단말 및 LEO 단말는 슈퍼 공유 메시지를 복호화 한다. 슈퍼 공유 메시지를 복 호화 하기 위한 코드북은 GEO 단말 및 LEO 단말이 공유하고 있으므로, GEO 단말도 복호화를 수행할 수 있다. S1613 단계에서, GEO 단말 및 LEO 단말는 수신한 유니캐스트 메시지 및 멀티캐스트 메시지에서 슈 퍼 공유 메시지를 제거한다. 슈퍼 공유 메시지를 제거하기 위해 도 7의 순차적 간섭 제어부가 이용될 수 있다. S1615 단계에서, GEO 단말은 멀티 캐스트 메시지를 복호화 한다. 수신한 신호에서 슈퍼 공유 메시지를 제 거함으로써, GEO 단말은 저궤도 위성 기지국 위성의 신호의 간섭을 극복하고, 멀티 캐스트 메시지를 복호 화 할 수 있다. 따라서 간섭 정도가 커지는 경우 간섭을 극복하기 위해 슈퍼 공유 메시지 비율이 증가될 수 있 다. 일 예로, 오프-보어사이트 각도가 작은 경우 슈퍼 공유 메시지 비율이 증가될 수 있다. S1617 단계에서, LEO 단말은 유니 캐스트 메시지를 복호화 한다. LEO 단말은 저궤도 위성 기지국 의 유니캐스트 메시지 중 슈퍼 공유 메시지 외 나머지 부분인 제1 분할 메시지를 복호화할 수 있다. 또한 제1 분할 메시지가 전송률 분할 다중 접속 기술을 기반으로 생성된 메시지인 경우, 추가적으로 제1 분할 메시지 를 공유 메시지 및 제2 분할 메시지로 분할할 수 있다. 또한 도 12 내지 도 16에서 정지궤도 위성 및 저궤도 위성이 사용되는 기준으로 상술하였지만 반드시 이에 한정 되는 것은 아니다. 즉 제1 저궤도 위성 네트워크가 주파수 자원을 우선적으로 사용하는 주 네트워크로 동작하고, 제2 저궤도 위성 네트워크는 부 네트워크로 동작할 수 있다. 이 경우 제1 저궤도 위성은 도 12의 절 차를 수행하고 제2 저궤도 위성은 도 13의 절차를 이용할 수 있다. 따라서 여러 위성의 신호가 동일 주파수 대 역내에서 중첩되어 수신되는 환경에서도 슈퍼 공유 메시지가 효율적으로 사용될 수 있다. 상술한 절차를 이용하면, 다계층 위성 네트워크에서 기존 정지궤도 위성에서 사용하던 주파수 자원을 저궤도 위 성 네트워크와 공유하면서도, 인라인 간섭시에도 저궤도 위성 네트워크의 품질이 유지될 수 있다. 따라서 급격 하게 증가하는 저궤도 위성 수에 비해 한정된 주파수 자원으로 유발되는 문제가 해결될 수 있다. 다계층 위성 네트워크에서 슈퍼 공유 메시지를 이용한 전송률 분할 다중 접속 기술 기법을 통해 저궤도 위성으로부터 정지궤 도 사용자가 받는 인라인 간섭을 일정 부분 제거할 수 있다. 또한, 사용자마다 요구 트래픽을 인지하여, 트래픽 의 여유가 있는 사용자에게 할당되는 자원을 트래픽이 부족한 사용자에게 할당함으로써, 각 사용자에게 높은 체 감 품질(Quality of Experience, QoE)을 보장하는 것이 가능할 수 있다. 한편, 본 실시예와 관련된 기술 분야에서 통상의 지식을 가진 자는 상기된 기재의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 방법들은 한정적인 관 점이 아니라 설명적인 관점에서 고려되어야 한다. 본 개시의 범위는 전술한 설명이 아니라 특허청구범위에 나타 나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 개시에 포함된 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16"}
{"patent_id": "10-2023-0128951", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 위성 통신을 지원하는 네트워크의 예를 나타낸 도면이다. 도 2는 본 개시의 일 실시예에 따른 위성 통신을 지원하는 네트워크 시스템의 다른 예를 나타낸 도면이다. 도 3는 본 개시의 일 실시예에 따른 위성 통신을 지원하는 시스템에서 무선 장치의 예를 나타낸 도면이다. 도 4는 본 개시의 일 실시예에 따른 정지궤도 위성 및 저궤도 위성이 공존하는 다계층 위성 네트워크의 예를 나 타낸 도면이다. 도 5는 본 개시의 일 실시예에 따른 독점 영역(exclusive zone)의 예를 나타낸 도면이다. 도 6은 본 개시의 일 실시예에 따른 전송률 분할 다중 접속 기술을 사용하는 송신기의 예를 나타낸 도면이다. 도 7은 본 개시의 일 실시예에 따른 수신한 RSMA(Rate-Splitting Multiple Access) 신호를 기반으로 공유 메시 지 및 개인 매시지를 복호화 하는 절차의 예를 나타낸 도면이다. 도 8은 본 개시의 일 실시예에 따른 저궤도 위성 기지국이 유니캐스트 메시지를 전송하는 절차의 예를 나타낸 도면이다. 도 9는 본 개시의 일 실시예에 따른 정지궤도 위성 기지국이 멀티캐스트 메시지를 전송하는 절차의 예를 나타낸 도면이다. 도 10은 본 개시의 일 실시예에 따른 다양한 전송 방법을 통해 나타날 수 있는 LEO(Low Earth Orbit) 사용자의 처리율 성능의 예를 나타낸 도면이다. 도 11은 본 개시의 일 실시예에 GEO(Geostationary Orbit) 사용자의 오프-보어사이트 각도에 따른 저궤도 위성 네트워크 처리율 성능의 예를 나타낸 도면이다. 도 12는 본 개시의 일 실시예에 따른 정지궤도 위성 기지국이 단말에게 멀티캐스트 신호를 전송하는 절차의 예 를 나타낸 도면이다. 도 13은 본 개시의 일 실시예에 따른 저궤도 위성 기지국이 단말에게 유니캐스트 신호를 전송하는 절차의 예를 도시한 도면이다. 도 14는 본 개시의 일 실시예에 따른 위성 네트워크를 사용하는 단말들이 신호를 수신하는 절차의 예를 나타낸 도면이다. 도 15는 본 개시의 일 실시예에 따른 단말이 슈퍼 공유 메시지가 제거된 메시지를 복호화 하는 절차의 예를 나 타낸 도면이다. 도 16은 본 개시의 일 실시예에 따른 슈퍼 공유 메시지를 이용한 통신에서 저궤도 위성, 정지궤도 위성 및 단말 들 사이의 시그널링의 예를 나타낸 도면이다."}
