{"patent_id": "10-2021-0135898", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0053042", "출원번호": "10-2021-0135898", "발명의 명칭": "스마트 홈 에너지 관리 시스템", "출원인": "주식회사 한성시스코", "발명자": "강태용"}}
{"patent_id": "10-2021-0135898", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에너지 서비스 인터페이스와 에너지서비스포털 간의 상호 인터페이스를 통해서 에너지 데이터간 교환이 가능할수 있도록 형성되는 에너지포털시스템과;상기 에너지포털시스템으로 부하되는 에너지의 사용량과 물리적인 연결상태 및 유지보수관리를 할 수 있도록 하는 인홈디스플레이시스템과;상기 에너지포털시스템을 연결하고, 인홈디스플레이시스템을 컨트롤 할 수 있도록 에너지 프로파일을 호환시키도록 하는 플랫폼시스템과;상기 플랫폼시스템으로부터 호환된 프로파일과 각 데이터들을 취득하고 분석하여 이를 딥러닝을 통해서 해석,제어할 수 있도록 하는 데이터분석시스템과;상기 분석된 데이터를 웹서비스를 이용하여 데이터를 서로 교환함과 동시에 컨트롤 할 수 있도록 하는 웹서비스플랫폼시스템이 제공되는 것을 특징으로 하는 스마트 홈 에너지 관리 시스템."}
{"patent_id": "10-2021-0135898", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 플랫폼시스템은 에너지관리시스템에 연계되는 모든 부하장치의 에너지 사용량을 실시간으로 계측할 수 있도록 플랫폼이 형성되고, 부하장치, 가전기기, 계측장치의 물리적인 연결상태를 체크하도록 형성되는 것을 특징으로 하는 스마트 홈 에너지 관리 시스템."}
{"patent_id": "10-2021-0135898", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 데이터분석시스템은 상기 에너지포털시스템으로부터 주어지는 프로파일과 데이터들을 분석하고, 각 장치에별도의 딥러닝프로그램을 실행하여 데이터를 분석하고, 이를 플랫폼시스템에 명령을 하달하도록 형성된다.상기 딥러닝프로그램은 부하장치에 대하여 도 2와 같이 수행하는데, 각 세대장치에서 입력된 상태값(s)이 심층강화학습신경망과 보상예측신경망으로 전송되는 상태값전송단계와;상기 보상예측신경망은 최적온도예측신경망과 에너지예측신경망으로 구성되고, 최적온도예측신경망과 에너지예측신경망은 상태값(s)에 대하여 학습한 후에 보상값(γ)을 결정하여 전송하는 보상값전송단계와;상기 심층강화학습신경망은 Actor신경망과 Critic신경망으로 구성되고, Critic신경망은 전송된 상태값(s)과 기대된 액션값(A)을 보상값(γ)과 함께 상태-가치함수를 통하여 가치값(Q)을 산출하여 Actor신경망으로 전송하고,Actor신경망은 가치값(Q)과 상태값(s)을 활용하여 최적의 액션값(A)를 산출하는 액션값산출단계로 구성되는 것을 특징으로 하는 스마트 홈 에너지 관리 시스템."}
{"patent_id": "10-2021-0135898", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 웹서비스플랫폼시스템은 사물인터넷(IOT)의 개념으로 각 장치에 인터넷 인터페이스장치를 형성하고, 이들을 플랫폼으로 구축한 상태에서 사용자 또는 관리자에게 실시간 분석한 데이터를 전송 및 확인할 수 있도록 형성되는 것을 특징으로 하는 스마트 홈 에너지 관리 시스템."}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트 홈 에너지 관리 시스템에 관한 것으로, 더욱 상세하게는 가정에서 사용되고 있는 모든 에너지 를 감지하고, 에너지 데이터를 저장 분석할 수 있도록 함으로써, 가정에서 사용되는 총 에너지를 인공지능으로 효율적이면서도 사용자의 생활패턴에 맞추면서 에너지를 절약할 수 있도록 하는 스마트 홈 에너지 관리 시스템에 (뒷면에 계속)"}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 홈 에너지 관리 시스템에 관한 것으로, 더욱 상세하게는 가정에서 사용되고 있는 모든 에너지 를 감지하고, 에너지 데이터를 저장 분석할 수 있도록 함으로써, 가정에서 사용되는 총 에너지를 인공지능으로 효율적이면서도 사용자의 생활패턴에 맞추면서 에너지를 절약할 수 있도록 하는 스마트 홈 에너지 관리 시스템 에 관한 것이다."}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현대사회는 도시화가 진행되면서 인구의 집중도가 높아지게 되고, 인구밀도가 높아질수록 집합건물을 건축해야 하는 필요성이 대두되고 있다. 집합건물은 1동의 건물 중 구조상 구분된 수개의 부분이 독립된 건물로서 사용될 수 있을 때 각 부분은 집합건 물의 소유 및 관리에 관한 법률이 정하는 바에 따라 각각 소유권이 목적이 될 수가 있으며, 이 각각의 구분소유 권으로 독립할 수 있는 건물의 집합체를 집합건물이라 한다. 상기 집합건물은 대표적으로 아파트, 연립주택, 다세대주택, 오피스텔 등으로 되어 있고, 현대사회의 도시에서 는 없어서는 안되는 건물에 속한다. 이러한 집합건물은 열에너지, 전기에너지, 물에너지 등의 에너지를 사용하고, 이러한 에너지는 쾌적한 주거환경 을 위해서 제공되어 지고 있다. 상기 집합건물의 에너지 사용에 있어서 각 단위세대별로 설치되는 단위세대별시설과, 공용으로 설치되는 공용시 설이 존재하게 된다. 상기 각 단위세대에 필요한 시스템은 냉,난방시스템(개별시스템일 수 있음), 공조시스템, 전기공급시스템, 온수 공급시스템, 가스공급시스템으로 건축시에 제공된다. 상기 집합건물의 각 단위세대별 설치되는 장치로는 전열교환기, 공기청정기, 주방후드가 제공되고, 제어하는 장 치로 온수 분배기, 차압유량조절밸브(PDCV)등이 제공된다. 또한, 상기 집합건물의 환경관리시스템으로는 다수개의 온도센서와 압력센서를 관리하는 환경관리서버가 제공된 다. 상기 집합건물의 각 세대별 사용되는 전기, 가스, 급수, 급탕, 난방 등의 제공에는 각각 계량기가 존재하고, 이 러한 계량기의 데이터를 원격검침서버를 통해서 수집되고 관리된다. 현대사회는 도시화가 진행되면서 인구의 집중도가 높아지게 되고, 인구밀도가 높아질수록 집합건물 등이 많이 만들어지고, 이러한 집합건물에서는 많은 양의 에너지를 사용하게 된다. 이러한 집합건물은 열에너지, 전기에너지, 물에너지 등의 에너지를 사용하고, 이러한 에너지는 쾌적한 주거환경 을 위해서 제공되어야만 한다. 상기 집합건물의 에너지 사용에 있어서 각 단위세대별로 설치되는 단위세대별시설과, 공용으로 설치되는 공용시 설이 존재하게 된다. 종래의 집합건물의 에너지를 관리하기 위한 다양한 기술과 제어방법이 제공되는데, 대한민국특허청 공개특허공 보 제2014-0141923호에는 '복합적인 조건에서의 건물 에너지 시스템 최적화를 위한 설계 방법'이 개시된 바 있 고, 공개특허공보 제2018-0138463호에는 'AI 기반으로 대상 건물의 냉방 시스템을 최적 제어하는 클라우드 서버 및 방법, 냉방 시스템 제어 장치'를 제공한 바있다. 대한민국특허청 등록특허공보 제1908515호에는 '에너지 관리 시스템, 에너지 관리 방법 및 에너지 수요 예측 방법'이라는 제목으로 건물에 대한 에너지수요예측방법을 제공하고 있다. (특허문헌 1) KR10-2014-0141923 A (특허문헌 2) KR10-2018-0138463 A (특허문헌 3) KR10-2016-0136965 A (특허문헌 4) KR10-1908515 B1"}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러나, 종래의 홈 에너지 관리 시스템은 다음과 같은 문제점이 있었다. 집합건물이나 현대화된 건물에는 이미 적용이 되어 있지만, 단독주택이나 오래된 건물에는 적용하기 어렵다. 열에너지 이외에 전기에너지의 사용에 필요한 각 가전기기들의 연결 및 이에 사용되는 에너지를 통합적으로 관리하지 못한다. 사용자가 열에너지, 전기에너지 및 기타 에너지 사용량을 수시로, 정확하게 인식하지 못한다."}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 문제점을 해결하기 위해서, 본 발명은 에너지 서비스 인터페이스와 에너지서비스포털 간의 상호 인터페 이스를 통해서 에너지 데이터간 교환이 가능할 수 있도록 형성되는 에너지포털시스템과; 상기 에너지포털시스템으로 부하되는 에너지의 사용량과 물리적인 연결상태 및 유지보수관리를 할 수 있도록 하 는 인홈디스플레이시스템과; 상기 에너지포털시스템을 연결하고, 인홈디스플레이시스템을 컨트롤 할 수 있도록 에너지 프로파일을 호환시키 도록 하는 플랫폼시스템과; 상기 플랫폼시스템으로부터 호환된 프로파일과 각 데이터들을 취득하고 분석하여 이를 딥러닝을 통해서 해석, 제어할 수 있도록 하는 데이터분석시스템과; 상기 분석된 데이터를 웹서비스를 이용하여 데이터를 서로 교환함과 동시에 컨트롤 할 수 있도록 하는 웹서비스 플랫폼시스템이 제공되는 것을 특징으로 한다."}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 바람직한 실시예로 형성된 스마트 홈 에너지 관리 시스템에 의하면 다음과 같은 효과가 발생한다. 모든 건물에 적용이 가능할 뿐만 아니라, 네트워크 상에서 사용자 또는 관리자가 에너지의 사용량 등을 관 찰 및 확인할 수 있다. 각 가전기기들에 스마트하드웨어 기술을 적용하여 열에너지 이외에 전기에너지의 사용을 통합적으로 관리할 수 있다. 사용자는 인홈디스플레이시스템에 의해서 에너지 관리상태를 직접 확인할 수 있어서 사용자가 열에너지, 전 기에너지 및 기타 에너지 사용량을 조절할 수 있다."}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 구체적인 실시예를 설명하기에 앞서, 본 명세서에 도시된 도면은 본 발명을 보다 명확하게 설명하기 위해서 그 구성요소의 크기나 형상 등을 다소 과장되거나 단순화시켜 표현할 수 있다. 또한, 본 발명의 기술적 사상과는 관계없는 부분의 설명은 생략하였고, 본 명세서 전체를 통하여 동일 또는 유 사한 구성요소에 대해서는 동일한 참조부호를 붙여서 설명하였다. 본 발명에서 정의된 용어 및 부호들은 사용자, 운용자 및 작성자에 의해서 임의로 정의되거나, 선택적으로 사용 된 용어이기 때문에, 이러한 용어들은 본 명세서의 전체적인 내용을 토대로 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 하고, 용어자체의 의미로 한정하여서는 안된다.본 발명은 에너지 서비스 인터페이스와 에너지서비스포털 간의 상호 인터페이스를 통해서 에너지 데이터간 교환 이 가능할 수 있도록 형성되는 에너지포털시스템과; 상기 에너지포털시스템으로 부하되는 에너지의 사용량과 물리적인 연결상태 및 유지보수관리를 할 수 있도록 하 는 인홈디스플레이시스템과; 상기 에너지포털시스템을 연결하고, 인홈디스플레이시스템을 컨트롤 할 수 있도록 에너지 프로파일을 호환시키 도록 하는 플랫폼시스템과; 상기 플랫폼시스템으로부터 호환된 프로파일과 각 데이터들을 취득하고 분석하여 이를 딥러닝을 통해서 해석, 제어할 수 있도록 하는 데이터분석시스템과; 상기 분석된 데이터를 웹서비스를 이용하여 데이터를 서로 교환함과 동시에 컨트롤 할 수 있도록 하는 웹서비스 플랫폼시스템이 제공된다. 상기 에너지포털시스템은 에너지 서비스 인터페이스(ESI)가 구축되는데, 도 1 및 도 2와 같은 네트워크 인터페 이스로 각 장치들이 연결된다. 또한, 에너지 서비스 인터페이스에는 가전기기들도 동시에 연결가능하도록 형성되고, 각 장치들이 인터넷을 기 반으로 하여 연결된다. 상기 에너지 서비스 인터페이스는 에너지포털시스템(ESP)에 의해서 컨트롤되고, 디바이스간 혹은 논리 계층간 데이터교환이 일어난다. 상기 플랫폼시스템은 에너지관리시스템에 연계되는 모든 부하장치의 에너지 사용량을 실시간으로 계측할 수 있 도록 플랫폼이 형성되고, 부하장치, 가전기기, 계측장치(이하, '각 장치'라 함) 등의 물리적인 연결상태를 체크 하도록 형성된다. 또한, 상기 플랫폼시스템은 각 장치의 유지보수 시점, 마모정도 또는 상태로 유지 보수 관리하기 위한 플랫폼을 포함한다. 상기 데이터분석시스템은 상기 에너지포털시스템으로부터 주어지는 프로파일과 데이터들을 분석하고, 각 장치에 별도의 딥러닝프로그램을 실행하여 데이터를 분석하고, 이를 플랫폼시스템에 명령을 하달하도록 형성된다. 상기 딥러닝프로그램은 부하장치에 대하여 도 2와 같이 수행하는데, 각 세대장치에서 입력된 상태값(s)이 심층 강화학습신경망과 보상예측신경망으로 전송되는 상태값전송단계와; 상기 보상예측신경망은 최적온도예측신경망과 에너지예측신경망으로 구성되고, 최적온도예측신경망과 에너지예측 신경망은 상태값(s)에 대하여 학습한 후에 보상값(γ)을 결정하여 전송하는 보상값전송단계와; 상기 심층강화학습신경망은 Actor신경망과 Critic신경망으로 구성되고, Critic신경망은 전송된 상태값(s)과 기 대된 액션값(A)을 보상값(γ)과 함께 상태-가치함수를 통하여 가치값(Q)을 산출하여 Actor신경망으로 전송하고, Actor신경망은 가치값(Q)과 상태값(s)을 활용하여 최적의 액션값(A)을 산출하는 액션값산출단계로 구성된다. 상기 딥러닝프로그램은 지도학습알고리즘을 사용하고 훈련세트(학습데이터)를 이용하여 기본 알고리즘을 최적화 한 상태로 운영된다. 상기 학습데이터는 단위세대장치 및 컨트롤러(피제어부)에서 수집하여 왔던 각 세대별데이터(온도, 습도, Co2농 도, 태양복사량 등)를 시간대별, 일자별로 분류한 데이터이다. 상기 세대별데이터는 축적된 기간이 길면 길수록 좋지만, 축적된 데이터가 전혀 없는 건물에는 유사한 환경의 세대별데이터를 모아서 최적값을 산출한 데이터세트를 활용하여 산출할 수 있다. 상기 알고리즘의 보상예측신경망과 심층강화학습신경망은 모두 기본 알고리즘이 최적화된 상태에서 수행되는 것 이 적당하다. 상기 보상예측신경망은 최적온도예측신경망과 에너지예측신경망으로 구성되고, 최적온도예측신경망은 온도와 습 도의 변화에 대한 보상값을 산출할 수 있도록 보상함수를 적용하고, 에너지예측신경망은 전기에너지사용량, 열 에너지사용량의 변화에 대한 보상값을 산출할 수 있도록 보상함수를 적용한다. 상기 보상예측신경망에는 스케줄러가 포함될 수 있는데, 사용자의 사용패턴을 인식하여 이를 스케줄링 하는 보 상값을 전달할 수 있도록 형성될 수 있다. 상기 보상예측신경망에 사용되는 보상함수의 예로는"}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "를 사용할 수 있는데, 특정 순간(t)에 상태값(s)과 액션값(A)일 때 보상값(γ)을 기대값으로 학습 및 산출한다. 상기 보상예측신경망은 최적온도예측신경망과 에너지예측신경망에서 평가된 보상값의 평균으로 최종 보상값 (γ)으로 결정하여 심층강화학습신경망으로 전송된다. 상기 심층강화학습신경망은 Actor신경망과 Critic신경망으로 구성되는데, Critic신경망은 상태값(s)과 보상값 (γ)을 활용하여 가치값(Q)을 학습산출한다. 상기 가치값(Q)에 사용되는 방정식의 예로는"}
{"patent_id": "10-2021-0135898", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "의 벨만기대방정식을 사용할 수 있다. 상기 Actor신경망은 상태값(s)과 가치값(Q)을 사용하여 최적의 액션값(A)을 학습산출한다. 상기 Actor신경망에서 생성된 액션값(A)은 Critic신경망으로 전송되어 새로운 직전 상태값으로 저장한다. 상기 웹서비스플랫폼시스템은 사물인터넷(IOT)의 개념으로 각 장치에 인터넷 인터페이스장치를 형성하고, 이들 을 플랫폼으로 구축한 상태에서 사용자 또는 관리자에게 실시간 분석한 데이터를 전송 및 확인할 수 있도록 형 성된다. 본 발명의 바람직한 실시예로 형성된 스마트 홈 에너지 관리 시스템에 의하면 모든 건물에 적용이 가능할 뿐만 아니라, 네트워크 상에서 사용자 또는 관리자가 에너지의 사용량 등을 관찰 및 확인할 수 있고, 각 가전기기들 에 스마트하드웨어 기술을 적용하여 열에너지 이외에 전기에너지의 사용을 통합적으로 관리할 수 있으며, 사용 자는 인홈디스플레이시스템에 의해서 에너지 관리상태를 직접 확인할 수 있어서 사용자가 열에너지, 전기에너지 및 기타 에너지 사용량을 조절할 수 있는 등의 효과가 발생한다. 본 발명은 첨부된 도면을 참조하여 바람직한 실시 예를 중심으로 기술되었지만 당업자라면 이러한 기재로부터 후술하는 특허청구범위에 의해 포괄되는 본 발명의 범주를 벗어남이 없이 다양한 변형이 가능하다는 것은 명백 하다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2021-0135898", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 집합건물 내의 에너지 관리 시스템을 나타낸 개념도. 도 2는 본 발명의 바람직한 실시예로 형성된 스마트 홈 에너지 관리 시스템에 사용되는 데이타 분석시스템의 개 념도. 도 3은 본 발명의 바람직한 실시예로 형성된 스마트 홈 에너지 관리 시스템의 스마트홈 개념도."}
