{"patent_id": "10-2022-0096189", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0018211", "출원번호": "10-2022-0096189", "발명의 명칭": "인공지능을 이용한 도시 수목의 탄소저장량 예측 방법", "출원인": "울산과학기술원", "발명자": "임정호"}}
{"patent_id": "10-2022-0096189", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "토지피복지도를 이용하여 학습 대상 지역의 수목면적을 산출하는 단계;상기 수목면적에 기초하여 상기 학습 대상 지역의 면적 기반 탄소저장량을 산출하는 단계;상기 학습 대상 지역의 면적 기반 탄소저장량 및 상대생장식 기반 탄소저장량을 훈련 데이터셋으로 설정하고,상기 훈련 데이터셋에 기초하여 인공지능 모델을 학습시키는 단계; 및예측 대상 지역의 면적 기반 탄소저장량을 상기 인공지능 모델에 입력하여 상기 예측 대상 지역의 실탄소저장량을 예측하는 단계를 포함하는인공지능을 이용한 탄소저장량 예측 방법."}
{"patent_id": "10-2022-0096189", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 수목면적을 산출하는 단계는상기 토지피복지도에서 나무로 분류된 픽셀의 수에 기초하여 상기 수목면적을 산출하는 단계를 포함하는인공지능을 이용한 탄소저장량 예측 방법."}
{"patent_id": "10-2022-0096189", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 수목면적을 산출하는 단계는상기 학습 대상 지역을 단위 격자로 분할하는 단계와,상기 토지피복지도를 이용하여 상기 단위 격자별 수목면적을 산출하는 단계를 포함하는인공지능을 이용한 탄소저장량 예측 방법."}
{"patent_id": "10-2022-0096189", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 학습 대상 지역의 면적 기반 탄소저장량 및 상대생장식 기반 탄소저장량은 상기 단위 격자별로 산출되는인공지능을 이용한 탄소저장량 예측 방법."}
{"patent_id": "10-2022-0096189", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 면적 기반 탄소저장량을 산출하는 단계는하기 [수학식 1]에 따라 탄소저장량을 산출하는 단계를 포함하는[수학식 1]공개특허 10-2024-0018211-3- (여기서, Ca는 상기 면적 기반 탄소저장량, 는 상기 학습 대상 지역의 타입에 따른 비례상수, A는 상기 수목면적, G는 임목축적, D는 목재기본밀도, BEF는 바이오매스 확장계수, R은 뿌리함량비, CF는 탄소전환계수)인공지능을 이용한 탄소저장량 예측 방법."}
{"patent_id": "10-2022-0096189", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 상대생장식 기반 탄소저장량은 하기 [수학식 2] 또는 [수학식 3]에 따라 산출되는[수학식 2] [수학식 3] (여기서, Cb는 상기 상대생장식 기반 탄소저장량, CF는 탄소전환계수, a, b, c는 상기 학습 대상 지역 내 대표수종 i에 따라 미리 결정된 계수, DBHi는 상기 대표수종 i의 평균 실측 흉고직경, H는 상기 대표수종 i의 평균실측 수고)인공지능을 이용한 탄소저장량 예측 방법."}
{"patent_id": "10-2022-0096189", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 인공지능 모델을 학습시키는 단계는상기 학습 대상 지역의 면적 기반 탄소저장량 및 상대생장식 기반 탄소저장량을 각각 상기 인공지능 모델의 입력 및 출력 데이터로 설정하여 상기 인공지능 모델을 지도 학습(supervised learning)시키는 단계를 포함하는인공지능을 이용한 탄소저장량 예측 방법."}
{"patent_id": "10-2022-0096189", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서,상기 인공지능 모델을 학습시키는 단계는상기 단위 격자별 면적 기반 탄소저장량 및 상대생장식 기반 탄소저장량을 상기 단위 격자의 배열에 따라 각각행렬 데이터로 변환하고, 상기 변환된 각 행렬 데이터를 상기 훈련 데이터셋으로 설정하는 단계를 포함하는인공지능을 이용한 탄소저장량 예측 방법."}
{"patent_id": "10-2022-0096189", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 인공지능 모델을 학습시키는 단계는상기 학습 대상 지역에 대한 항공 라이다(LiDAR) 영상, 분광 위성 영상을 추가 입력 데이터로 설정하여 상기 인공개특허 10-2024-0018211-4-공지능 모델을 지도 학습시키는 단계를 포함하는인공지능을 이용한 탄소저장량 예측 방법."}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 모델에 면적 기반 탄소저장량과 상대생장식 기반 탄소저장량 간의 상관관계를 학습시키고, 학습된 인공지능 모델을 이용하여 임의의 지역의 탄소저장량을 예측하는 방법에 관한 것이다. 본 발명의 일 실시 예에 따른 인공지능을 이용한 탄소저장량 예측 방법은 토지피복지도를 이용하여 학습 대상 지역의 수목면적을 산 출하는 단계, 상기 수목면적에 기초하여 상기 학습 대상 지역의 면적 기반 탄소저장량을 산출하는 단계, 상기 학 습 대상 지역의 면적 기반 탄소저장량 및 상대생장식 기반 탄소저장량을 훈련 데이터셋으로 설정하고, 상기 훈련 데이터셋에 기초하여 인공지능 모델을 학습시키는 단계 및 예측 대상 지역의 면적 기반 탄소저장량을 상기 인공 지능 모델에 입력하여 상기 예측 대상 지역의 실탄소저장량을 예측하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 모델에 면적 기반 탄소저장량과 상대생장식 기반 탄소저장량 간의 상관관계를 학습시키고, 학습된 인공지능 모델을 이용하여 임의의 지역의 탄소저장량을 예측하는 방법에 관한 것이다."}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기후변화에 대응하기 위하여 도시 생태계의 탄소 순환을 이해하고 정량화하는 과정이 필요하다. 특히, 건강한 도시 생태계를 유지하기 위해서는 탄소저장량의 공간적 현황 파악이 필수적이며, 탄소저장량의 정량화를 위해 대표적으로 상대생장식 기반의 산출 방식과, 면적 기반의 산출 방식이 이용되고 있다. 상대생장식 기반의 산출 방식은 개체 목의 생장 변수인 흉고직경, 수고 등을 이용하여 탄소저장량을 비교적 정 확하게 계산할 수 있다는 장점이 있으나, 개체 목별 변수 측정이 요구되어 현장 실사의 시공간 제약이 있는 경 우 계산이 불가능하거나 그 정확도가 떨어지거나 계산 비용이 매우 커지는 단점이 있다. 면적 기반의 산출 방식은 단위면적당 임목축적량에 탄소전환계수(Carbon Fraction; CF)를 곱하여 산출되므로 지 역 내 수목의 면적 정보만 알 수 있다면 탄소저장량을 계산할 수 있다는 장점이 있으나, 계산에 이용되는 임목 축적, 탄소전환계수 등은 주로 산림에서 얻어진 통계값이므로 도시 환경에 적용하는 경우 계산 정확도가 매우 떨어진다는 단점이 있다. 이에 따라, 상대생장식 기반 및 면적 기반 산출 방식의 장점만을 취하면서 도시 지역에서도 적용 가능한 탄소저 장량 예측 방법이 요구되고 있다."}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인공지능 모델에 면적 기반 탄소저장량과, 실측값에 기반하는 상대생장식 기반 탄소저장량 간의 상관 관계를 학습시키고, 임의의 지역의 면적 기반 탄소저장량을 간단히 산출한 뒤 이를 인공지능 모델에 적용하여 해당 지역의 실탄소저장량을 예측하는 것을 목적으로 한다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공지능을 이용한 탄소저장량 예측 방법은 토지피복 지도를 이용하여 학습 대상 지역의 수목면적을 산출하는 단계, 상기 수목면적에 기초하여 상기 학습 대상 지역 의 면적 기반 탄소저장량을 산출하는 단계, 상기 학습 대상 지역의 면적 기반 탄소저장량 및 상대생장식 기반 탄소저장량을 훈련 데이터셋으로 설정하고, 상기 훈련 데이터셋에 기초하여 인공지능 모델을 학습시키는 단계 및 예측 대상 지역의 면적 기반 탄소저장량을 상기 인공지능 모델에 입력하여 상기 예측 대상 지역의 실탄소저 장량을 예측하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 수목면적을 산출하는 단계는 상기 토지피복지도에서 나무로 분류된 픽셀의 수에 기초하여 상기 수목면적을 산출하는 단계를 포함하는 것을 특징으로 한다.일 실시예에서, 상기 수목면적을 산출하는 단계는 상기 학습 대상 지역을 단위 격자로 분할하는 단계와, 상기 토지피복지도를 이용하여 상기 단위 격자별 수목면적을 산출하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 학습 대상 지역의 면적 기반 탄소저장량 및 상대생장식 기반 탄소저장량은 상기 단위 격자 별로 산출되는 것을 특징으로 한다. 일 실시예에서, 상기 면적 기반 탄소저장량을 산출하는 단계는 하기 [수학식 1]에 따라 탄소저장량을 산출하는 단계를 포함하는 것을 특징으로 한다. [수학식 1]"}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "(여기서, Ca는 상기 면적 기반 탄소저장량, 는 상기 학습 대상 지역의 타입에 따른 비례상수, A는 상기 수목면 적, G는 임목축적, D는 목재기본밀도, BEF는 바이오매스 확장계수, R은 뿌리함량비, CF는 탄소전환계수) 일 실시예에서, 상기 상대생장식 기반 탄소저장량은 하기 [수학식 2] 또는 [수학식 3]에 따라 산출되는 것을 특 징으로 한다. [수학식 2]"}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "[수학식 3]"}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "(여기서, Cb는 상기 상대생장식 기반 탄소저장량, CF는 탄소전환계수, a, b, c는 상기 학습 대상 지역 내 대표 수종 i에 따라 미리 결정된 계수, DBHi는 상기 대표수종 i의 평균 실측 흉고직경, H는 상기 대표수종 i의 평균 실측 수고) 일 실시예에서, 상기 인공지능 모델을 학습시키는 단계는 상기 학습 대상 지역의 면적 기반 탄소저장량 및 상대 생장식 기반 탄소저장량을 각각 상기 인공지능 모델의 입력 및 출력 데이터로 설정하여 상기 인공지능 모델을 지도 학습(supervised learning)시키는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 인공지능 모델을 학습시키는 단계는 상기 단위 격자별 면적 기반 탄소저장량 및 상대생장 식 기반 탄소저장량을 상기 단위 격자의 배열에 따라 각각 행렬 데이터로 변환하고, 상기 변환된 각 행렬 데이 터를 상기 훈련 데이터셋으로 설정하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 인공지능 모델을 학습시키는 단계는 상기 학습 대상 지역에 대한 항공 라이다(LiDAR) 영상, 분광 위성 영상을 추가 입력 데이터로 설정하여 상기 인공지능 모델을 지도 학습시키는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 인공지능 모델에 면적 기반 탄소저장량과, 실측값에 기반하는 상대생장식 기반 탄소저장량 간의 상관 관계를 학습시키고, 임의의 지역의 면적 기반 탄소저장량을 간단히 산출한 뒤 이를 인공지능 모델에 적용하여 해당 지역의 실탄소저장량을 예측함으로써, 도시 지역 내 수목의 면적 정보만 알 수 있다면 해당 지역의 실탄소 저장량를 손쉽게 예측할 수 있다는 장점이 있다. 상술한 효과와 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 본 명세서에서 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용 하는 것으로, 특별히 반대되는 기재가 없는 한, 제1 구성요소는 제2 구성요소일 수도 있음은 물론이다. 또한, 본 명세서에서 \"상부 (또는 하부)\" 또는 구성요소의 \"상 (또는 하)\"에 임의의 구성이 배치된다는 것은, 임의의 구성이 상기 구성요소의 상면 (또는 하면)에 접하여 배치되는 것뿐만 아니라, 상기 구성요소와 상기 구 성요소 상에 (또는 하에) 배치된 임의의 구성 사이에 다른 구성이 개재될 수 있음을 의미할 수 있다. 또한, 본 명세서에서 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 상기 구성요소들은 서로 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소가 \"개 재\"되거나, 각 구성요소가 다른 구성요소를 통해 \"연결\", \"결합\" 또는 \"접속\"될 수도 있는 것으로 이해되어야 할 것이다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들 은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한 다. 또한, 본 명세서에서, \"A 및/또는 B\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, A, B 또는 A 및 B 를 의미하며, \"C 내지 D\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, C 이상이고 D 이하인 것을 의미한다 본 발명은 인공지능 모델에 면적 기반 탄소저장량과 상대생장식 기반 탄소저장량 간의 상관관계를 학습시키고, 학습된 인공지능 모델을 이용하여 임의의 지역의 탄소저장량을 예측하는 방법에 관한 것이다. 이하, 도 1 내지 도 9를 참조하여 본 발명의 일 실시예에 따른 인공지능을 이용한 탄소저장량 예측 방법을 구체적으로 설명하도 록 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능을 이용한 탄소저장량 예측 방법을 도시한 순서도이다. 도 2는 학습 대상 지역의 토지피복지도를 예시적으로 도시한 도면이고, 도 3은 학습 대상 지역의 수목면적을 표 현한 도면이며, 도 4는 학습 대상 지역의 면적 기반 탄소저장량을 표현한 도면이다. 도 5는 학습 대상 지역을 구획하는 단위 격자별로 산출된 탄소저장량과 이를 나타내는 행렬 데이터를 도시한 도 면이다.도 6은 면적 기반 탄소저장량과 상대생장식 기반 탄소저장량을 훈련 데이터셋으로 설정한 모습을 도시한 도면이 다. 도 7은 인공지능 모델의 기본 동작을 설명하기 위한 도면이고, 도 8은 인공지능 모델에 항공 라이다 영상 및 분 광 위성 영상이 추가 입력되는 모습을 도시한 도면이다. 도 9는 학습된 인공지능 모델을 이용하여 예측 대상 지역의 실탄소저장량을 예측하는 과정을 설명하기 위한 도 면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 인공지능을 이용한 탄소저장량 예측 방법은 토지피복지도를 이용 하여 학습 대상 지역의 수목면적을 산출하는 단계(S10), 수목면적에 기초하여 학습 대상 지역의 면적 기반 탄소 저장량을 산출하는 단계(S20), 학습 대상 지역의 면적 기반 탄소저장량 및 상대생장식 기반 탄소저장량을 훈련 데이터셋으로 설정하는 단계(S30), 훈련 데이터셋에 기초하여 인공지능 모델을 학습시키는 단계(S40) 및 예측 대상 지역의 면적 기반 탄소저장량을 인공지능 모델에 입력하여 예측 대상 지역의 실탄소저장량을 예측하는 단 계(S50)를 포함할 수 있다. 다만, 도 1에 도시된 인공지능을 이용한 탄소저장량 예측 방법은 일 실시예에 따른 것이고, 발명을 이루는 각 단계들이 도 1에 도시된 실시예에 한정되는 것은 아니며, 필요에 따라 일부 단계가 부가, 변경 또는 삭제될 수 있다. 도 1에 도시된 각 단계들은 CPU(central processing unit), GPU(graphics processing unit) 등과 같은 프로세 서에 의해 수행될 수 있으며, 프로세서는 후술하는 발명의 동작을 수행하기 위하여 ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 제어기(controller), 마이크로 컨트롤러(micro-controllers) 중 적어도 하나의 물리적인 요소를 더 포함할 수 있다. 이하, 도 1에 도시된 각 단계들을 구체적으로 설명하도록 한다. 프로세서는 토지피복지도를 이용하여 학습 대상 지역(10L)의 수목면적을 산출할 수 있다(S10). 본 발 명에서 대상 지역은 학습 대상 지역(10L) 및 예측 대상 지역(10E)으로 분류되며, 학습 대상 지역(10L)은 후술되 는 인공지능 모델의 학습에 이용되는 데이터의 취득 지역을 의미할 수 있고, 예측 대상 지역(10E)은 학습된 인공지능 모델을 통해 실탄소저장량을 알아내고자 하는 지역을 의미할 수 있다. 토지피복지도는 인공위성 또는 항공영상 등을 통해 취득한 자료에 기초하여 지표면의 타입을 분류한 지도 일 수 있다. 이러한 토지피복지도는 사용자에 의해 직접 생성될 수도 있고, 환경에 관한 사무를 담당하는 국가 행정기관(예컨대, 대한민국에서는 환경부)에 의해 생성될 수도 있다. 도 2를 참조하면, 토지피복지도는 학습 대상 지역(10L) 내 지표면을 그 타입(나무, 풀, 농지, 습지, 나대 지, 물, 건물 등)에 따라 달리 표현할 수 있다. 수목면적은 학습 대상 지역(10L)에 포함된 수목의 면적을 의미하므로, 프로세서는 토지피복지도 내 나무(T)로 분류된 영역에 기초하여 수목면적을 산출할 수 있다. 구체적으로, 프로세서는 토지피복지도에서 나무(T)로 분류된 픽셀의 수에 기초하여 수목면적을 산출 할 수 있다. 예를 들어, 학습 대상 지역(10L)에 대한 토지피복지도의 한 픽셀이 의 면적에 대응될 때, 프로세서는 토지피복지도에서 나무(T)로 분류된 픽셀의 수에 의 면적을 곱하여 학습 대상 지역(10L)의 수목면적을 산출할 수 있다. 한편, 후술하는 인공지능 모델의 학습을 위한 데이터를 증강하기 위하여, 수목면적 산출 동작은 학습 대상 지역(10L) 내 구역별로 이루어질 수 있다. 이를 위해, 프로세서는 학습 대상 지역(10L)을 단위 격자로 분 할하고, 토지피복지도를 이용하여 단위 격자별 수목면적을 산출할 수 있다. 도 3을 예로 들어 설명하면, 프로세서는 학습 대상 지역(10L)을 의 매트릭스 형태로 배열된 단위 격자로 분할할 수 있다. 이어서, 프로세서는 단위 격자별로 수목면적을 산출할 수 있다. 구체적으로, 프로 세서는 각 단위 격자에 대응하는 토지피복지도에서 나무로 분류된 픽셀의 수에 기초하여 각 단위 격자의 수목면적을 산출할 수 있다. 설명의 편의를 위해 도 3에서는 단위 격자별로 산출된 수목면적의 크기 에 따라 단위 격자의 색을 달리 표현하였다.이어서, 프로세서는 수목면적에 기초하여 학습 대상 지역(10L)의 면적 기반 탄소저장량(Ca)을 산출할 수 있다(S20). 본 발명에서 면적 기반 탄소저장량(Ca)은 학습 대상 지역(10L) 내 임목 순생장량에 기초하여 결정될 수 있고, 프로세서는 앞서 산출된 수목면적에 기초하여 임목 순생장량을 산출할 수 있다. 구체적으로 아래 [수학식 1]과 같이 프로세서는 수목면적([ha])에 임목축적([m3/ha])을 곱하여 임목 순생 장량( )을 산출할 수 있으며, 임목축적은 산림에 관한 사무를 담당하는 국가 행정기관(예컨대, 대한민국에서 는 산림청)에 의해 미리 결정된 값을 사용할 수 있다. [수학식 1]"}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(여기서, 는 상기 학습 대상 지역(10L)의 타입에 따른 비례상수, A는 수목면적, G는 임목축적) 한편, 임목축적은 주로 산림에서 얻어진 통계값이므로 학습 대상 지역(10L)이 도시인 경우, 임목축적 값을 그대 로 사용하는 경우 임목 순생장량에 오차가 발생할 수 있다. 이를 고려하여 본 발명에서는 임목 순생장량 산출에 학습 대상 지역(10L)의 타입에 따라 결정되는 비례상수( )를 적용할 수 있고, 예컨대 학습 대상 지역(10L)이 산림이면 비례상수( )는 1로, 도시이면 비례상수( )는 0.8로 적용될 수 있다. 이어서, 프로세서는 아래 [수학식 2]와 같이, 임목 순생장량에 목재기본밀도, 바이오매스 확장계수, 뿌리함량비, 탄소전환계수를 곱하여 최종적으로 면적 기반 탄소저장량(Ca)을 산출할 수 있다. [수학식 2]"}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "(여기서, D는 목재기본밀도, BEF는 바이오매스 확장계수, R은 뿌리함량비, CF는 탄소전환계수) 목재기본밀도, 바이오매스 확장계수, 뿌리함량비, 탄소전환계수는 수종별로 미리 설정될 수 있고, 식물(토양)의 천이 과정(초원 -> 관목림 -> 양수림 -> 혼합림 -> 음수림)별로 미리 설정될 수도 있다. 각 값들은 사용자에 의 해 직접 설정되거나 산림에 관한 사무를 담당하는 국가 행정기관(예컨대, 대한민국에서는 산림청)에 의해 미리 설정될 수 있다. 도 4를 참조하면, 전술한 면적 기반 탄소저장량(Ca) 산출은 단위 격자별로 수행될 수 있다. 구체적으로, 도 3에 서 설명한 바와 같이 프로세서가 학습 대상 지역(10L)을 단위 격자로 분할한 경우, 프로세서는 단위 격자별로 수목면적을 산출할 수 있고, 이에 기초하여 단위 격자별로 면적 기반 탄소저장량(Ca)을 산출할 수 있다. 설명의 편의를 위해 도 4에서는 단위 격자별로 산출된 면적 기반 탄소저장량(Ca)의 크기에 따라 단위 격자의 색 을 달리 표현하였다. 추가적으로, 프로세서는 학습 대상 지역(10L)의 상대생장식 기반 탄소저장량(Cb)을 산출할 수 있다. 상대생장식 기반의 산출 방식은 개체 목의 생장 변수인 흉고직경, 수고 등의 실측값에 기초하므로 탄소저장량의 산출 정확 도가 높아 후술하는 인공지능 모델 학습에 실측 정보(Ground Truth; GT)로서 이용될 수 있다. 구체적으로 프로세서는 아래 [수학식 3] 또는 [수학식 4]에 기초하여 상대생장식 기반 탄소저장량(Cb)을 산출할 수 있다. [수학식 3]"}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "[수학식 4]"}
{"patent_id": "10-2022-0096189", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "(여기서, CF는 탄소전환계수, a, b, c는 학습 대상 지역(10L) 내 대표수종 i에 따라 미리 결정된 계수, DBHi는 대표수종 i의 평균 실측 흉고직경, H는 대표수종 i의 평균 실측 수고) 사용자는 현장실사를 통해 학습 대상 지역(10L) 내 수목을 구성하는 대표수종이 무엇인지 파악할 수 있고, 대표 수종들의 흉고직경 및/또는 수고를 실측할 수 있다. 프로세서는 사용자에 의해 실측된 값들에 기초하여 상대생장식 기반 탄소저장량(Cb)을 산출할 수 있고, 산출된 값은 실측값에 기반하므로 학습 대상 지역(10L)의 실제 탄소저장량(이하, 실탄소저장량)으로 이해될 수 있다. 전술한 상대생장량 기반 탄소저장량 역시 학습 대상 지역(10L)을 구획하는 단위 격자별로 산출될 수 있으며, 이 하에서는 설명의 편의를 위해 면적 기반 탄소저장량(Ca) 및 상대생장량 기반 탄소저장량이 모두 단위 격자별로 산출된 것으로 가정하도록 한다. 이어서, 프로세서는 학습 대상 지역(10L)의 면적 기반 탄소저장량(Ca) 및 상대생장식 기반 탄소저장량(Cb)을 인 공지능 모델의 훈련 데이터셋(training dataset)으로 설정할 수 있다(S30). 본 발명의 인공지능 모델은 지도 학습(supervised learning)을 통해 회귀(regression) 태스크를 수행하는 모델일 수 있다. 이 때, 인공지능 모델에 입력되는 데이터는 면적 기반 탄소저장량(Ca)일 수 있고, 인공지 능 모델에서 출력되는 데이터는 실탄소저장량일 수 있다. 앞서 설명한 바와 같이 실측값에 기초하여 산출된 상대생장식 기반 탄소저장량(Cb)은 실탄소저장량으로 이해될 수 있으므로, 프로세서는 학습 대상 지역(10L)의 면적 기반 탄소저장량(Ca) 및 상대생장식 기반 탄소저장량(Cb) 을 각각 인공지능 모델의 입력 및 출력 데이터로 설정할 수 있다. 도 5 및 도 6을 참조하여 프로세서의 훈련 데이터 설정 방법을 구체적으로 설명하도록 한다. 먼저, 도 5를 참조하면 프로세서는 단위 격자별 면적 기반 탄소저장량(Ca)을 산출할 수 있고, 단위 격자의 배열 에 따라 탄소저장량(Ca)을 행렬 데이터로 변환할 수 있다. 도 5에 도시되지는 않았으나, 프로세서는 단위 격자별 상대생장식 기반 탄소저장량(Cb)을 산출할 수 있고, 마찬가지로 단위 격자의 배열에 따라 탄소저장량(Cb)을 행렬 데이터로 변환할 수 있다. 다음으로 도 6을 참조하면, 프로세서는 각 단위 격자의 위치별로 면적 기반 탄소저장량(Ca) 및 상대생장식 기반 탄소저장량(Cb)을 매칭하여 훈련 데이터셋을 설정할 수 있다. 구체적으로 n행 m열의 단위 격자에 대한 면적 기반 탄소저장량(Ca) 및 상대생장식 기반 탄소저장량(Cb)이 각각 Canm, Cbnm일 때, 프로세서는 Canm을 입력 데이터로 하 고 Cbnm을 출력 데이터로 하는 훈련 데이터셋((Canm, Cbnm))을 생성할 수 있다. 프로세서는 전술한 바와 같이 설정된 훈련 데이터셋에 기초하여 인공지능 모델을 지도 학습시킬 수 있다 (S40). 도 7을 참조하면, 프로세서는 인공지능 모델에 입력되는 데이터를 면적 기반 탄소저장량(Ca)으로 설정하고, 인공지능 모델에서 출력되는 데이터를 상대생장식 기반 탄소저장량(Cb)으로 설정하여 인공지능 모델을 지도 학습시킬 수 있다. 이러한 지도 학습이 반복 수행됨에 따라 인공지능 모델은 입출력 데이터, 즉 면적 기반 탄소저장량(Ca)과 상대생장식 기반 탄소저장량(Cb) 간의 상관관계를 학습할 수 있고, 인공지능 모델 내 파라미터(가중치 (weight) 및 바이어스(bias))는 인공지능 모델에 임의의 면적 기반 탄소저장량(Ca)이 입력되었을 때 이에 대응하는 실탄소저장량이 출력되도록 갱신될 수 있다. 한편, 프로세서는 전술한 훈련 데이터셋의 일부를 검증 데이터셋으로 할당할 수 있고, 검증 데이터셋을 제외한 훈련 데이터셋만을 이용하여 인공지능 모델을 반복 학습시킬 수 있다. 이 때, 프로세서는 인공지능 모델의 학습을 반복하면서 검증 데이터셋에 대한 오차(|검증 데이터셋으로 할 당된 면적 기반 탄소저장량(Ca)에 대한 인공지능 모델의 예측값 - 해당 면적 기반 탄소저장량(Ca)에 매칭된 상대생장식 기반 탄소저장량(Cb)|)를 산출할 수 있고, 학습 반복 횟수(epoch)가 기준 횟수를 초과하였음에도 오차가 기준치 이상으로 산출되는 경우, 훈련 데이터셋의 양이 부족하다고 판단하여 단위 격자의 크기를 줄일 수 있다. 예컨대, 도 3을 참조하여 설명한 바와 같이 단위 격자의 크기가 로 설정되었던 경우, 프로세서는 단위 격자의 크기를 이보다 작게, 예컨대 로 설정할 수 있다. 이에 따라, 동일 면적에 대한 면적 기반 탄소저장량(Ca)과 상대생장식 기반 탄소저장량(Cb) 데이터가 증가할 수 있고, 이에 따라 훈련 데이터셋의 양이 증가할 수 있다. 프로세서는 증가된 훈련 데이터셋을 이용하여 인공지능 모델을 추가 학습시킬 수 있고, 이러한 동작은 기준 횟수 이상의 학습 반복 횟수에서 오차가 기준치 미만이 될 때까지 반복될 수 있다. 한편, 인공지능 모델이 더 많은 변수와 실탄소저장량 간의 상관관계를 학습하도록, 프로세서는 학습 대상 지역(10L)에 대한 항공 라이다(LiDAR) 영상, 분광 위성 영상을 훈련 데이터셋의 추가 입력 데이터로 설정할 수 있다. 도 8을 참조하면, 도 7에 도시된 것과 달리 프로세서는 면적 기반 탄소저장량(Ca) 외에도 항공 라이다 영상 (예컨대 높이 정보를 포함하는 라이다 영상(300a) 및/또는 반사 강도 정보를 포함하는 라이다 영상(300 b))과, 식생 정보(구체적으로는, 식생 활력도)를 포함하는 분광 위성 영상을 인공지능 모델의 입력 데 이터로 설정하고, 인공지능 모델에서 출력되는 데이터를 상대생장식 기반 탄소저장량(Cb)으로 설정하여 인공 지능 모델을 지도 학습시킬 수 있다. 이에 따라, 인공지능 모델은 '면적 기반 탄소저장량(Ca), 항공 라이다 영상, 분광 위성 영상'과 상대생장식 기반 탄소저장량(Cb) 간의 상관관계를 학습할 수 있고, 인공지능 모델 내 파라미터는 인공지능 모델에 임의의 지역에 대한 면적 기반 탄소저장량(Ca), 항공 라이다 영상, 분광 위성 영상이 입 력되었을 때 이에 대응하는 실탄소저장량이 출력되도록 갱신될 수 있다. 인공지능 모델의 학습이 완료되면, 프로세서는 예측 대상 지역(10E)의 면적 기반 탄소저장량(Ca)을 인공지 능 모델에 입력하여 예측 대상 지역(10E)의 실탄소저장량을 예측할 수 있다(S50). 도 9를 참조하여 구체적으로 설명하면, 프로세서는 예측 대상 지역(10E)의 면적 기반 탄소저장량(Ca)을 산출할 수 있다. 예측 대상 지역(10E)의 면적 기반 탄소저장량(Ca) 산출 방법은 학습 대상 지역(10L)에 대한 산출 방법 과 동일할 수 있다. 구체적으로, 프로세서는 토지피복지도를 이용하여 예측 대상 지역(10E)의 수목면적 을 산출하고, 수목면적에 기초하여 예측 대상 지역(10E)의 면적 기반 탄소저장량(Ca)을 산출할 수 있 다. 이어서, 프로세서는 산출된 면적 기반 탄소저장량(Ca)을 인공지능 모델에 입력할 수 있다. 앞서 인공지능 모델은 면적 기반 탄소저장량(Ca)과 상대생장식 기반 탄소저장량(Cb) 간의 상관관계를 학습하였으므로, 인공 지능 모델은 입력된 면적 기반 탄소저장량(Ca)에 대응하는 실탄소저장량(예측값, Cb)을 출력할 수 있다. 한편, 인공지능 모델이 도 8에 도시된 방법에 따라 학습된 경우, 프로세서는 예측 대상 지역(10E)의 면적 기반 탄소저장량(Ca) 외에도 예측 대상 지역(10E)의 항공 라이다 영성 및 분광 위성 영상을 추가적으로 인 공지능 모델에 입력할 수 있고, 인공지능 모델은 복수의 입력 데이터에 대응하는 실탄소저장량(예측값, Cb)을 출력할 수 있다. 전술한 바와 같이, 본 발명은 인공지능 모델에 면적 기반 탄소저장량(Ca)과 실측값에 기반하는 상대생장식 기반 탄소저장량(Cb) 간의 상관관계를 학습시키고, 임의의 지역의 면적 기반 탄소저장량(Ca)을 간단히 산출한 뒤 이를 인공지능 모델에 적용하여 해당 지역의 실탄소저장량을 예측함으로써, 도시 지역 내 수목의 면적 정보 만 알 수 있다면 해당 지역의 실탄소저장량를 손쉽게 예측할 수 있다는 장점이 있다. 이상과 같이 본 발명에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 발명의 실시 예를 설명하면서 본 발명의 구성에 따른 작용 효과를 명시적으로 기재하여 설명하지 않았을 지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다."}
{"patent_id": "10-2022-0096189", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능을 이용한 탄소저장량 예측 방법을 도시한 순서도. 도 2는 학습 대상 지역의 토지피복지도를 예시적으로 도시한 도면. 도 3은 학습 대상 지역의 수목면적을 표현한 도면. 도 4는 학습 대상 지역의 면적 기반 탄소저장량을 표현한 도면. 도 5는 학습 대상 지역을 구획하는 단위 격자별로 산출된 탄소저장량과 이를 나타내는 행렬 데이터를 도시한 도 면. 도 6은 면적 기반 탄소저장량과 상대생장식 기반 탄소저장량을 훈련 데이터셋으로 설정한 모습을 도시한 도면. 도 7은 인공지능 모델의 기본 동작을 설명하기 위한 도면. 도 8은 신경만 모델에 항공 라이다 영상 및 분광 위성 영상이 추가 입력되는 모습을 도시한 도면. 도 9는 학습된 인공지능 모델을 이용하여 예측 대상 지역의 실탄소저장량을 예측하는 과정을 설명하기 위한 도 면."}
