{"patent_id": "10-2022-0138457", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0057798", "출원번호": "10-2022-0138457", "발명의 명칭": "위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법 및 전자 장치", "출원인": "삼성전자주식회사", "발명자": "황보훈"}}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "위치(position) 정보를 추론하기 위한 인공지능 모델(838)을 학습하는 방법에 있어서,제1 위치에서 사용자 단말(110; 850)에 의해 수집된 신호 장치에 대한 제1 신호 데이터, 상기 제1 신호 데이터수집 시 상기 사용자 단말(110; 850)로부터 소정 거리 내에 위치한 방해물(120; 130)에 대한 데이터 및 제2 위치에서 수집된 상기 신호 장치에 대한 제2 신호 데이터를 포함하는 제1 데이터 셋(410)을 식별하는 단계;상기 방해물(120; 130)에 대한 데이터를 기초로 상기 제1 데이터 셋(410)으로부터 상기 제1 신호 데이터를 필터링함으로써, 제2 데이터 셋(420)을 생성하는 단계;상기 제2 신호 데이터를 기초로 상기 제1 위치 및 상기 신호 장치에 대한 증강 데이터(augmented data)를 생성함으로써, 제3 데이터 셋(430)을 생성하는 단계; 및상기 제3 데이터 셋(430)을 이용하여 상기 인공지능 모델(838)을 훈련하는 단계를 포함하는, 방법"}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제3 데이터 셋(430)을 생성하는 단계는,GPR(Gaussian Process Regression) 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제1 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 제3 데이터 셋(430)을 생성하는 단계는,GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제2 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 제1 데이터 셋(410)은, 제3 위치에서 수집된 상기 신호 장치에 대한 제3 신호 데이터를 포함하고,상기 제3 데이터 셋(430)을 생성하는 단계는,GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제3 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 제3 데이터 셋(430)을 생성하는 단계는,공개특허 10-2024-0057798-3-GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제1 데이터 셋에 포함된 신호 데이터에 독립된제4 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,상기 제1 신호 데이터는, 상기 제1 위치에서 측정된 상기 신호 장치의 신호 세기의 값을 포함하고,상기 제2 데이터 셋(420)을 생성하는 단계는,상기 방해물(120; 130)에 대한 데이터를 기초로, 상기 제1 신호 데이터에 대한 필터링 기준치를 식별하는 단계;및상기 신호 세기의 값이 상기 필터링 기준치 이하인 것으로 판정함에 기초하여, 상기 제1 신호 데이터를 제거하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 필터링 기준치는, 상기 방해물(120; 130)의 개수 및 상기 방해물(120; 130)에 대한 데이터의 값 중 적어도하나를 기초로 결정되는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서,상기 방해물(120; 130)에 대한 데이터는, 다른 사용자 단말(120; 130)의 근거리 통신 신호 세기의 값 및 상기방해물(120; 130)에 의한 Geo-magnetic 변화량 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서,상기 제3 데이터 셋(430)을 생성하는 단계는,상기 제2 데이터 셋(420)에 포함된 상기 제1 위치 및 상기 신호 장치에 대한 신호 데이터의 총 개수가 임계값보다 작은 것으로 판정함에 기초하여, 상기 제1 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는 단계를포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "사용자 단말(860)의 위치 정보를 추론하는 방법에 있어서,하나 이상의 신호 장치에 대한 신호 데이터 및 상기 사용자 단말(860)로부터 소정 거리 내에 위치한 방해물(722; 732; 734)에 대한 데이터를 식별하는 단계;위치 정보를 추론하기 위한 인공지능 모델을 이용하여, 상기 하나 이상의 신호 장치에 대한 신호 데이터를 기초로 제1 위치 예측 데이터를 산출하는 단계;상기 방해물(722; 732; 734)에 대한 데이터를 기초로, 상기 제1 위치 예측 데이터에 가중치를 적용하는 단계;및상기 가중치가 적용된 제1 위치 예측 데이터를 기초로, 상기 사용자 단말(860)의 위치 정보를 결정하는 단계를공개특허 10-2024-0057798-4-포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,제2 위치 예측 데이터를 식별하는 단계; 및상기 방해물(722; 732; 734)에 대한 데이터를 기초로, 상기 제2 위치 예측 데이터에 가중치를 적용하는 단계를더 포함하고,상기 위치 정보를 결정하는 단계는,상기 가중치가 적용된 제1 위치 예측 데이터 및 상기 가중치가 적용된 제2 위치 예측 데이터를 기초로, 상기 사용자 단말(860)의 위치 정보를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항 또는 제11항에 있어서,상기 하나 이상의 신호 장치에 대한 신호 데이터는, 상기 하나 이상의 신호 장치의 신호 세기의 값을 포함하는,방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항 내지 12항 중 어느 한 항에 있어서,상기 방해물(722; 732; 734)에 대한 데이터는, 다른 사용자 단말(722; 732; 734)의 근거리 통신 신호 세기의 값및 상기 방해물(722; 732; 734)에 의한 Geo-magnetic 변화량 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항 내지 제13항 중 어느 한 항에 있어서,상기 제1 위치 예측 데이터에 적용되는 가중치는, 상기 방해물(722; 732; 734)의 개수 및 상기 방해물(722;732; 734)에 대한 데이터의 값 중 적어도 하나를 기초로 결정되는, 방법."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "위치(position) 정보를 추론하기 위한 인공지능 모델(838)을 학습하는 전자 장치(810)에 있어서,하나 이상의 명령어를 저장하는 메모리(830); 및상기 메모리(830)에 저장된 상기 하나 이상의 명령어를 실행하는 적어도 하나의 프로세서(820)를 포함하고,상기 적어도 하나의 프로세서(820)는 상기 하나 이상의 명령어(instruction)를 실행함으로써,제1 위치에서 사용자 단말(110; 850)에 의해 수집된 신호 장치에 대한 제1 신호 데이터, 상기 제1 신호 데이터수집 시 상기 사용자 단말(110; 850)로부터 소정 거리 내에 위치한 방해물(120; 130)에 대한 데이터 및 제2 위치에서 수집된 상기 신호 장치에 대한 제2 신호 데이터를 포함하는 제1 데이터 셋(410)을 식별하고,상기 방해물(120; 130)에 대한 데이터를 기초로 상기 제1 데이터 셋(410)으로부터 상기 제1 신호 데이터를 필터링함으로써, 제2 데이터 셋(420)을 생성하고,상기 제2 신호 데이터를 기초로 상기 제1 위치 및 상기 신호 장치에 대한 증강 데이터(augmented data)를 생성공개특허 10-2024-0057798-5-함으로써, 제3 데이터 셋(430)을 생성하고,상기 제3 데이터 셋(430)을 이용하여 상기 인공지능 모델(838)을 훈련하는, 전자 장치."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 적어도 하나의 프로세서(820)는, GPR(Gaussian Process Regression) 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제1 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는, 전자 장치."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항 또는 제16항에 있어서,상기 적어도 하나의 프로세서(820)는, GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제2 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는, 전자 장치."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항 내지 제17항 중 어느 한 항에 있어서,상기 제1 데이터 셋(410)은 제3 위치에서 수집된 상기 신호 장치에 대한 제3 신호 데이터를 포함하고,상기 적어도 하나의 프로세서(820)는, GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제3 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는, 전자 장치."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항 내지 제18항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(820)는,GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제1 데이터 셋에 포함된 신호 데이터에 독립된제4 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는, 전자 장치."}
{"patent_id": "10-2022-0138457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항 내지 제19항 중 어느 한 항에 있어서,상기 제1 신호 데이터는, 상기 제1 위치에서 측정된 상기 신호 장치의 신호 세기의 값을 포함하고,상기 적어도 하나의 프로세서(820)는, 상기 방해물(120; 130)에 대한 데이터를 기초로, 상기 제1 신호 데이터에 대한 필터링 기준치를 식별하고,상기 신호 세기의 값이 상기 필터링 기준치 이하인 것으로 판정함에 기초하여, 상기 제1 신호 데이터를 제거하는, 전자 장치."}
{"patent_id": "10-2022-0138457", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법은, 제1 위치에서 사용자 단말에 의해 수집된 신호 장치에 대한 제1 신호 데이터, 상기 제1 신호 데이터 수집 시 상기 사용자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이터 및 제2 위치에서 수집된 상기 신호 장치에 대한 제2 신호 데이터를 포함하는 제1 데이터 셋을 식별하는 단계, 상기 방해물에 대한 데이터를 기초로 상기 제1 데이터 셋으로부터 상 기 제1 신호 데이터를 필터링함으로써, 제2 데이터 셋을 생성하는 단계, 상기 제2 신호 데이터를 기초로 상기 제 1 위치 및 상기 신호 장치에 대한 증강 데이터를 생성함으로써, 제3 데이터 셋을 생성하는 단계 및 상기 제3 데 이터 셋을 이용하여 상기 인공지능 모델을 훈련하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0138457", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법 및 전자 장치에 관한 것이다. 또한, 본 개시는 사용자 단말의 위치 정보를 추론하는 방법에 관한 것이다."}
{"patent_id": "10-2022-0138457", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신 기술의 발달로 인해, 사용자는 어디서나 wifi 신호를 이용하여, 통신 서비스를 제공받을 수 있다. wifi 신 호는 AP(access point) 장치로부터 사용자 단말로 송수신될 수 있다. wifi 신호는 사용자 단말과 AP 장치의 사 이의 거리가 멀수록 신호의 세기가 약해지고, 가까울수록 신호의 세기는 강해진다. 또한, wifi 신호의 RTT(round trip time, 왕복시간)을 이용하여, 사용자 단말과 AP 장치 사이의 거리가 산출될 수 있다. 또한, 각 AP 장치로부터 사용자 단말로 전송되는 wifi 신호는 구별될 수 있다. 한편, 사용자 단말과 AP 장치 사이의 통신뿐만 아니라 사용자 단말 사이의 근거리 통신이 가능하다. 예를 들어, 사용자 단말 사이에 블루투스 신호를 통한 근거리 통신이 가능하다. 상이한 사용자 단말로부터 수신되는 블루투 스 신호는 서로 구별될 수 있다. 즉, 제1 사용자 단말의 블루투스 신호와 제2 사용자 단말의 블루투스 신호는 서로 구별될 수 있다."}
{"patent_id": "10-2022-0138457", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 방법, 시스템, 장치 또는 컴퓨터 판독가능 저장매체에 저장된 컴퓨터 프로그램을 포함한 다양한 방식 으로 구현될 수 있다. 본 개시의 일 실시예에 따른 위치(position) 정보를 추론하기 위한 인공지능 모델을 학습하는 방법은, 제1 위치 에서 사용자 단말에 의해 수집된 신호 장치에 대한 제1 신호 데이터, 상기 제1 신호 데이터 수집 시 상기 사용 자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이터 및 제2 위치에서 수집된 상기 신호 장치에 대한 제 2 신호 데이터를 포함하는 제1 데이터 셋을 식별하는 단계를 포함할 수 있다. 일 실시예에서, 상기 방법은 상기 방해물에 대한 데이터를 기초로 상기 제1 데이터 셋으로부터 상기 제1 신호 데이터를 필터링함으로써, 제2 데이 터 셋을 생성하는 단계를 포함할 수 있다. 일 실시예에서, 상기 방법은 상기 제2 신호 데이터를 기초로 상기 제 1 위치 및 상기 신호 장치에 대한 증강 데이터(augmented data)를 생성함으로써, 제3 데이터 셋을 생성하는 단 계를 포함할 수 있다. 일 실시예에서, 상기 방법은, 상기 제3 데이터 셋을 이용하여 상기 인공지능 모델을 훈련 하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 사용자 단말의 위치 정보를 추론하는 방법은, 하나 이상의 신호 장치에 대한 신호 데이터 및 상기 사용자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이터를 식별하는 단계를 포함할 수 있다. 일 실시예에서, 상기 방법은, 위치 정보를 추론하기 위한 인공지능 모델을 이용하여, 상기 하나 이상의 신호 장치에 대한 신호 데이터를 기초로 제1 위치 예측 데이터를 산출하는 단계를 포함할 수 있다. 일 실시예에 서, 상기 방법은, 상기 방해물에 대한 데이터를 기초로, 상기 제1 위치 예측 데이터에 가중치를 적용하는 단계 를 포함할 수 있다. 일 실시예에서, 상기 방법은 상기 가중치가 적용된 제1 위치 예측 데이터를 기초로, 상기 사용자 단말의 위치 정보를 결정하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 사용자 단말의 위치 정보를 추론하는 전자 장치는, 하나 이상의 명령어를 저장하는 메모리 및 상기 메모리에 저장된 상기 하나 이상의 명령어를 실행하는 적어도 하나의 프로세서를 포함할 수 있 다. 일 실시예에서, 상기 적어도 하나의 프로세서는 상기 하나 이상의 명령어(instruction)를 실행함으로써, 제 1 위치에서 사용자 단말에 의해 수집된 신호 장치에 대한 제1 신호 데이터, 상기 제1 신호 데이터 수집 시 상기 사용자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이터 및 제2 위치에서 수집된 상기 신호 장치에 대 한 제2 신호 데이터를 포함하는 제1 데이터 셋을 식별할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서 는 상기 방해물에 대한 데이터를 기초로 상기 제1 데이터 셋으로부터 상기 제1 신호 데이터를 필터링함으로써, 제2 데이터 셋을 생성할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 상기 제2 신호 데이터를 기 초로 상기 제1 위치 및 상기 신호 장치에 대한 증강 데이터를 생성함으로써, 제3 데이터 셋을 생성할 수 있다.일 실시예에서, 상기 적어도 하나의 프로세서는 상기 제3 데이터 셋을 이용하여 상기 인공지능 모델을 훈련할 수 있다. 본 개시의 일 실시예에 따른 사용자 단말의 위치 정보를 추론하는 전자 장치는, 하나 이상의 명령어를 저장하는 메모리 및 상기 메모리에 저장된 상기 하나 이상의 명령어를 실행하는 적어도 하나의 프로세서를 포함할 수 있 다. 일 실시예에서, 상기 적어도 하나의 프로세서는 하나 이상의 신호 장치에 대한 신호 데이터 및 상기 사용자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이터를 식별할 수 있다. 일 실시예에서, 적어도 하나의 프 로세서는 위치 정보를 추론하기 위한 인공지능 모델을 이용하여, 상기 하나 이상의 신호 장치에 대한 신호 데이 터를 기초로 제1 위치 예측 데이터를 산출할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 상기 방해물에 대한 데이터를 기초로, 상기 제1 위치 예측 데이터에 가중치를 적용할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 상기 가중치가 적용된 제1 위치 예측 데이터를 기초로, 상기 사용자 단말의 위치 정보를 결정할 수 있다. 본 개시의 일 실시예에 따른 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법을 컴퓨터에서 수행하기 위한 프로그램은 컴퓨터로 읽을 수 있는 기록 매체에 기록될 수 있다. 본 개시의 일 실시예에 따른 사용자 단말의 위치 정보를 추론하는 방법을 컴퓨터에서 수행하기 위한 프로그램은 컴퓨터로 읽을 수 있는 기록 매체에 기록될 수 있다."}
{"patent_id": "10-2022-0138457", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서의 단수의 표현은 문맥상 명백하게 단수인 것으로 특정하지 않는 한, 복수의 표현을 포함한다. 또 한, 복수의 표현은 문맥상 명백하게 복수인 것으로 특정하지 않는 한, 단수의 표현을 포함한다. 명세서 전체에 서 어떤 부분이 어떤 구성요소를 포함한다고 할 때, 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 발명에 대한 구체적인 설명에 앞서, 이하 본 명세서에서 사용되는 용어는 다음과 같이 정의되거나 이해될 수 있 다. 본 명세서에서, '지점(point)'은 임의의 공간 내에서의 위치를 지칭할 수 있다. 예를 들어, 사용자 단말의 위치 정보는 공간 내의 복수의 지점 중에서 사용자 단말이 위치하는 것으로 예측되는 지점에 대한 정보를 포함할 수 있다. 본 명세서에서, refpoint는 지점(point)을 나타낼 수 있고, 마찬가지로, 지점은 refpoint를 나타낼 수 있 다. 본 명세서에서, '제1', '제2' 또는 '제3'의 기재는, 각 요소를 구분하기 위해 사용될 뿐, 순서를 의미하지 않을 수 있다. 본 명세서에서, '데이터 수집'은 데이터 측정, 데이터 산출, 데이터 획득, 데이터 식별 및 데이터 수신 중 적어 도 하나를 의미할 수 있다. 본 명세서에서, '증강 데이터'는 데이터 수집 환경에서의 측정 동작에 의해 획득되는 데이터가 아닌, 임의로 생 성된 데이터를 지칭할 수 있다. 예를 들어, '증강 데이터'는 임의의 환경(예: 위치, 시간, 등)에서 전자 장치와 신호 장치 사이에 실제로 송수신이 이루어 지지 않은 신호에 대하여 임의로 생성한 데이터일 수 있다. 일 실시 예에서, '증강 데이터'는 전자 장치와 신호 장치 사이에 실제로 송수신이 이루어짐에 따라 획득된 신호 데이터 들을 기초로 임의의 방법, 알고리즘 또는 모델을 이용하여 생성될 수 있다. 예를 들어, '증강 데이터'는 다른 신호 데이터들을 기초로, GPR(gaussian process regression) 알고리즘, RSSI(received signal strength intensity) path loss model, SMOTE(synthetic minority oversampling technique) 알고리즘, INOS(integrated oversampling) 알고리즘, Gaussian noise 부가 방법 등을 이용하여 생성될 수 있다. 일례로, 제1 위치 및 제1 신호 장치에 대한 증강 데이터는, 제1 위치에서 수집되었거나 수집될 수 있는 제1 신호 장치에 대한 신호 데이 터를 대신하기 위해 생성될 수 있다. 본 명세서에서, '방해물에 대한 데이터'는 전자 장치가 임의의 위치에서 신호 장치에 대한 신호 데이터를 수집 할 때, 상기 전자 장치로부터 소정 거리 내에 위치한 방해물에 대한 데이터를 나타낼 수 있다. 예를 들어, '방 해물'은 전자 장치와 신호 장치 사이의 신호 송수신에 영향을 줄 수 있는 객체를 지칭할 수 있다. 구체적으로, '방해물'은 전자 장치와 신호 장치 사이에 송수신되는 신호에 감쇄/증폭/간섭/왜곡을 일으킬 수 있는 객체로서, 보행자, 보행자의 전자 기기 등을 포함할 수 있다. 또한, '소정 거리'는 방해물이 전자 장치와 신호 장치 사이 의 신호 송수신에 영향을 미칠 수 있는 거리 및/또는 전자 장치가 방해물을 식별할 수 있는 거리를 지칭할 수 있다. 일 실시예에서, '방해물에 대한 데이터'는 상기 객체로부터 수신되는 신호의 세기를 나타내는 데이터를 포함할 수 있다. 이 경우, '소정 거리'는 상기 객체로부터 신호가 수신될 수 있는 거리(예: 통신 가능 거리)를 의미할 수 있다. 일 실시예에서, '방해물에 대한 데이터'는 상기 객체로부터 수신된 정보를 나타내는 데이터를 포함할 수 있다. 이 경우, '소정 거리'는 상기 객체로부터 정보가 수신될 수 있는 거리를 의미할 수 있다. 일 실시예에 서, '방해물에 대한 데이터'는 상기 객체에 의해 변화하는 환경을 나타내는 데이터를 포함할 수 있다. 예를 들 어, '방해물에 대한 데이터'는 상기 객체에 의해 변화하는 임의의 환경에 대한 물리적 수치(예: Geo-magnetic scalar(또는 변화량))를 포함할 수 있다. 이 경우, '소정 거리'는 전자 장치가 위치한 환경에 변화를 야기할 수 있는 거리를 의미할 수 있다. 예를 들어, '소정 거리'는 전자 장치가 위치한 영역의 환경을 나타내는 물리적 수 치에 변화를 야기할 수 있는 거리를 의미할 수 있다. 도 1은 일 실시예에 따라 위치 정보를 추론하기 위한 인공지능 모델의 학습 데이터를 수집하는 예시를 나타내는 도면이다. 사용자 단말은 공간 내에 고정적으로 위치한 하나 이상의 신호 장치와 신호를 송수신할 수 있다. 사용자 단말과 신호 장치 사이의 거리가 멀수록 신호 세기는 약하게 측정되고, 가까울수록 신호 세기는 강하게 측정될 수 있다. 따라서, 임의의 공간 내에서 사용자 단말과 하나 이상의 신호 장치 사이에 송수신되는 신호의 세 기를 기초로, 공간에서의 사용자 단말의 위치가 예측될 수 있다. 도 1을 참조하면, 공간은 복수의 지점(point)으로 분할될 수 있다. 예를 들어, 공간은 복수의 작은 2 차원 공간(예: 1m2의 공간)으로 분할될 수 있으며, 복수의 작은 공간 각각은 각 지점에 대응할 수 있다. 공간 의 각 지점은 좌표(예: point 1 = (0,0))로 표현될 수 있으나, 이에 한정되지 않는다. 공간에서의 사 용자 단말의 위치 정보는 복수의 지점 중 하나의 지점에 대응할 수 있다. 일 실시예에서, 사용자 단말과 각 신호 장치 사이에 송수신되는 신호의 세기에 기초하여, 사용자 단말과 각 신 호 장치 사이의 거리가 산출되고, 산출된 각 신호 장치와의 거리 정보를 기반으로 공간에서의 사용자 단말 의 위치가 예측될 수 있다. 예를 들어, 사용자 단말이 측정한 각 AP(access point) 장치의 신호 세기에 따라 AP 1과의 거리가 5m, AP 2와의 거리가 10m, AP 3와의 거리가 10m, AP 4와의 거리가 18m인 것으로 산출되는 경우, 사용자 단말은 공간에서 AP 1으로부터 5m, AP 2로부터 10m, AP 3로부터 10m, AP 4로부터 18m 떨어진 지점 에 위치하는 것으로 결정될 수 있다. 일 실시예에서, 위치를 추론하도록 학습된 인공지능 모델을 이용하여, 각 신호 장치로부터 수신되는 신호의 세 기를 기초로 사용자 단말(즉, 추론 대상 장치)의 위치가 예측될 수 있다. 예를 들어, 사용자 단말은 각 AP 장치(예: 도 1의 AP 1, AP 2, AP 3, AP 4)의 wifi 신호의 세기를 측정하고, 측정된 각 wifi 신호의 세기 값을 인공 지능 모델에 입력함에 따라, 출력되는 위치 예측 데이터를 기초로 공간 내에서의 위치를 결정할 수 있다. 특정 공간에서의 위치를 추론하는 인공지능 모델을 학습하기 위해, 해당 공간에 대한 신호 데이터가 학습 데이 터로서 사용될 수 있다. 도 1을 참조하면, 사용자 단말은, 공간에서의 위치를 추론하는 인공지능 모 델의 학습 데이터를 수집하기 위한 전자 장치(즉, 데이터 수집 장치)일 수 있다. 사용자 단말은 공간(10 0)을 이동하며, 수집 주기 마다 학습 데이터를 수집할 수 있다. 사용자 단말은 수집한 학습 데이터를 인공 지능 모델을 학습하는 전자 장치(예: 하나 이상의 서버)로 전송할 수 있다. 예를 들어, 사용자 단말은 수 집한 복수의 학습 데이터에 대한 전처리를 수행하여 데이터 셋을 생성하고, 생성된 데이터 셋을 인공지능 모델 을 학습하는 전자 장치로 전송할 수 있다. 일 실시예에서, 사용자 단말은 수집 주기 마다 각 AP 장치의 wifi 신호에 대한 신호 데이터를 수집할 수 있다. 예를 들어, 사용자 단말은 각 AP 장치로부터의 wifi 신호의 세기를 측정할 수 있다. 예를 들어, 사 용자 단말은, wifi 신호의 RTT(round trip time, 왕복 시간)를 기초로 산출된 각 AP와의 거리 정보를 획 득할 수 있다. 일 실시예에서, 사용자 단말은 수집 주기마다 공간에서의 위치 정보를 획득할 수 있다. 예를 들어, 사용자 단말은 공간의 복수의 지점 중에서 사용자 단말이 위치한 지점을 나타내는 정보를 획득 할 수 있다. 예를 들어, 사용자 단말은 사용자 입력 신호를 수신하여, 사용자 입력 신호에 대응하는 지점 을 신호 데이터 수집 시의 위치로 결정할 수 있다. 사용자 단말과 신호 장치 사이에 송수신되는 신호는 방해물의 영향을 받을 수 있다. 예를 들어, 사용자 단말과 신호 장치 사이에 방해물이 존재하는 경우의 신호 세기는 방해물이 존재하지 않는 경우의 신호 세기보다 더 작 은 값으로 측정될 수 있다. 즉, 방해물의 존재 여부에 따라, 동일한 거리에 있는 사용자 단말과 신호 장치 사이 의 신호 세기가 달라질 수 있다. 이에 따라, 학습 데이터를 수집하는 과정에서 보행자 등의 방해물이 존재하는 경우, 방해물의 영향을 받은 저품질의 데이터가 수집될 수 있다. 일 실시예에서, 사용자 단말은, 각 AP 장치의 wifi 신호에 대한 신호 데이터를 수집할 때, 주위의 다른 사 용자 단말(120, 130)의 근거리 통신 신호(예: 블루투스 신호) 데이터를 수집할 수 있다. 예를 들어, 사용자 단 말은 주위의 다른 사용자 단말(120, 130)의 블루투스 신호를 식별하고, 블루투스 신호의 세기를 측정할 수 있다. 다른 사용자 단말(120, 130)의 블루투스 신호가 식별되는 때에 수집된 wifi 신호 데이터는, 보행자 등의 주변 방해물의 영향을 받은 저품질의 데이터로, 인공지능 모델을 학습하는 데 악영향을 줄 수 있다. 서로 다른 사용자 단말은 서로 구별가능한 블루투스 신호를 송신할 수 있다. 이에 따라, 사용자 단말의 주 변에 2개의 다른 사용자 단말(120, 130)이 위치하는 경우, 사용자 단말은 서로 다른 2개의 블루투스 신호 를 식별할 수 있다. 즉, 식별된 블루투스 신호의 개수는 주변에 위치한 방해물의 개수를 나타낼 수 있다. 블루 투스 신호의 세기가 크다는 것은 보다 가까운 거리에 방해물이 위치함을 나타낼 수 있다. 또한, 블루투스 신호 의 개수가 많다는 것은 주변에 보다 많은 수의 방해물이 위치함을 나타낼 수 있다. 한편, 사용자 단말은 공간을 이동하면서 수집 주기(또는 측정 주기)에 따라 데이터를 수집하기 때문 에, 모든 지점에 대하여 데이터를 수집하지 못할 수 있다. 예를 들어, 4초의 측정 주기에 따라 신호의 세기를 측정하는 사용자 단말이 하나의 측정 주기 사이에 point 3을 지나치는 경우, point 2 및 4에 대한 신호 데 이터만을 획득하고, point 3에 대한 신호 데이터를 획득하지 못할 수 있다. 도 1에서는 하나의 사용자 단말이 데이터를 수집하고 있으나, 이에 한정되지 않는다. 예를 들어, 복수의 데이터 수집 장치가 하나의 공간에 대하여, 동시 또는 상이한 시점에 학습 데이터를 수집할 수 있다. 도 1에 도 시된 공간에서 point 1 내지 point 6 외의 각 지점의 식별자는 생략될 수 있다. 또한, 도 1에서는 신호 장 치로서 4개의 AP 장치를 도시하고 있으나, 이에 한정되지 않는다. 도 2는 일 실시예에 따른 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법을 나타내는 흐름도 이다. 도 2를 참조하면, 일 실시예에 따른 전자 장치가 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법 은 단계 210 내지 240을 포함할 수 있다. 일 실시예에서, 단계 210 내지 240은 전자 장치에 포함되는 적어 도 하나의 프로세서에 의해 실행될 수 있다. 다양한 실시예에서, 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법은 도 2에 도시된 바에 한정되지 않으며, 도 2에 도시되지 않은 단계를 더 포함할 수도 있다.단계 210에서, 전자 장치는 제1 위치에서 사용자 단말(즉, 데이터 수집 장치)에 의해 수집된 신호 장치에 대한 제1 신호 데이터, 제1 신호 데이터 수집 시 상기 사용자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이 터(이하, 제1 신호 데이터와 연관된 방해물에 대한 데이터) 및 제2 위치에서 수집된 신호 장치에 대한 제2 신호 데이터를 포함하는 제1 데이터 셋을 식별할 수 있다. 일 실시예에서, 전자 장치는 제1 데이터 셋을 사용자 단말 (예: 도 1의 110)로부터 수신할 수 있다. 예를 들어, 전자 장치는 제1 데이터 셋을 사용자 단말로부터 직접 수 신할 수 있다. 또는, 전자 장치는 제1 데이터 셋을 다른 장치를 통해 사용자 단말로부터 수신할 수 있다. 일 실 시예에서, 전자 장치는 하나 이상의 신호 장치에 대한 신호 데이터를 직접 수집함으로써(예: 직접 wifi 신호를 측정함으로써), 제1 데이터 셋을 생성할 수 있다. 이 경우, 상기 전자 장치와 상기 사용자 단말은 동일한 장치 일 수 있다. 일 실시예에서, 신호 장치는 wifi 신호 송수신기(예: AP 장치)일 수 있으나, 이에 한정되지 않는다. 예를 들어, 신호 장치는 위치 정보를 추론을 위해 공간에 구비된 신호 발생 장치일 수 있다. 신호 장치에 대한 신호 데이터 는, 신호 장치가 송신한 신호의 세기를 포함할 수 있다. 추가적으로, 신호 장치에 대한 신호 데이터는, RTT 기 반의 거리 정보를 포함할 수 있다. 일 실시예에서, 제1 신호 데이터와 연관된 방해물에 대한 데이터는, 제1 신호 데이터가 수집될 때 함께 수집된 데이터일 수 있다. 예를 들어, 제1 신호 데이터와 연관된 방해물에 대한 데이터는, 제1 신호 데이터와 동일 시 점에 측정되거나 획득될 수 있다. 추가적으로 또는 대안적으로, 신호 데이터의 수집 주기와 방해물에 대한 데이 터의 수집 주기가 상이한 경우, 방해물에 대한 데이터는, 제1 신호 데이터의 수집 직전 또는 직후의 방해물에 대한 데이터에 대한 수집 주기에 따른 시점에 측정되거나 획득될 수 있다. 단계 220에서, 전자 장치는 방해물에 대한 데이터를 기초로 제1 데이터 셋으로부터 제1 신호 데이터를 필터링함 으로써, 제2 데이터 셋을 생성할 수 있다. 일 실시예에서, 전자 장치는 제1 신호 데이터와 연관된 방해물에 대 한 데이터를 기초로, 제1 신호 데이터에 대한 필터링 기준치를 식별할 수 있다. 예를 들어, 필터링 기준치는, 각 신호 데이터에 대한 위치 정보, 신호 장치 및/또는 데이터 수집 장치 별로 상이하거나 동일할 수 있다. 전자 장치는 제1 신호 데이터의 값(즉, 제1 위치에서 측정된 신호 장치의 신호 세기의 값)이 필터링 기준치 이하인 것으로 판정함에 기초하여, 제1 신호 데이터를 제1 데이터 셋에서 제거할 수 있다. 단계 230에서, 전자 장치는 제2 신호 데이터를 기초로 제1 위치 및 신호 장치에 대한 증강 데이터를 생성함으로 써, 제3 데이터 셋을 생성할 수 있다. 일 실시예에서, 전자 장치는 GPR(Gaussian Process Regression) 알고리 즘을 이용하여, 제2 신호 데이터를 기초로 제1 위치에 대하여 신호 장치에 대한 증강 데이터(즉, 제1위치 및 신 호 장치에 대한 증강 데이터)를 생성할 수 있다. 단계 240에서, 전자 장치는 제3 데이터 셋을 이용하여 인공지능 모델을 훈련할 수 있다. 일 실시예에서, 전자 장치는 각 위치에서의 각 신호 장치에 대한 신호 데이터 및/또는 증강 데이터를 이용하여, 인공지능 모델을 훈 련할 수 있다. 예를 들어, 전자 장치는 공간의 각 위치(즉, 지점)에 대하여 복수의 신호 장치 각각의 신호 데이 터를 맵핑한 핑거 프린트(fingerprint)를 생성하여 인공지능 모델을 학습할 수 있다. 일 실시예에서, 전자 장치는 각 신호 장치에 대한 신호 데이터를 입력 데이터로서, 입력 데이터에 대한 위치 정 보를 정답 데이터로서 이용하여, 인공지능 모델을 지도 학습할 수 있으나, 학습 방식은 지도 학습에 한정되지 않는다. 예를 들어, 정답 데이터에 해당하는 위치 정보는 학습 데이터 수집자에 의해 라벨링된 것일 수 있다. 인공지능 모델은 추론 대상 장치(예: 사용자 단말)가 획득한 각 신호 장치에 대한 신호 데이터(즉, 신호의 세기)가 입력됨에 따라, 공간에서의 추론 대상 장치의 위치를 예측하도록 학습될 수 있다. 도 3은 일 실시예에 따른 사용자 단말의 위치 정보를 추론하는 방법을 나타내는 흐름도 이다. 도 3을 참조하면, 일 실시예에 따른 전자 장치가 사용자 단말의 위치 정보를 추론하는 방법은 단계 310 내 지 340을 포함할 수 있다. 일 실시예에서, 단계 310 내지 340은 전자 장치에 포함되는 적어도 하나의 프로세서 에 의해 실행될 수 있다. 다양한 실시예에서, 전자 장치가 사용자 단말의 위치 정보를 추론하는 방법은 도 3에 도시된 바에 한정되지 않으며, 도 3에 도시되지 않은 단계를 더 포함할 수도 있다. 도 3의 방법을 수 행하는 전자 장치는 도 2의 방법을 수행하는 전자 장치와 상이하거나 동일할 수 있다. 단계 310에서, 전자 장치는 하나 이상의 신호 장치에 대한 신호 데이터 및 사용자 단말(즉, 추론 대상 장치)로 부터 소정 거리 내에 위치한 방해물에 대한 데이터를 식별할 수 있다. 일 실시예에서, 하나 이상의 신호 장치에 대한 신호 데이터는, 하나 이상의 신호 장치의 신호 세기의 값을 포함할 수 있다. 일 실시예에서, 방해물에 대 한 데이터는, 다른 사용자 단말의 근거리 통신(예: 블루투스) 신호 세기의 값 및 방해물에 의한 Geo-magnetic변화량 중 적어도 하나를 포함할 수 있다. 단계 310의 하나 이상의 신호 장치에 대한 신호 데이터 및 방해물에 대한 데이터는 동일 시점에 측정(또는 획득)된 데이터일 수 있다. 즉, 방해물에 대한 데이터는, 하나 이상의 신호 장치에 대한 신호 데이터가 측정될 때의 사용자 단말의 주변에 위치한 방해물에 대한 데이터를 포함할 수 있다. 일 실시예에서, 방법을 수행하는 전자 장치는 위치 정보 추론 대상인 사용자 단말일 수 있다. 예를 들어, 전자 장치(즉, 사용자 단말)는 하나 이상의 신호 장치의 신호의 세기와 다른 사용자 단말로부터의 블루투스 신 호의 세기를 측정할 수 있다. 예를 들어, 전자 장치는 하나 이상의 신호 장치에 대한 신호 데이터를 신호 장치 로부터 수신할 수 있다. 예를 들어, 전자 장치는 방해물에 대한 데이터를 방해물로부터 수신할 수 있다. 일 실시예에서, 방법을 수행하는 전자 장치는 위치 정보 추론 대상인 사용자 단말과 상이한 장치일 수 있 다. 이 경우, 전자 장치는 위치 정보 추론 대상인 사용자 단말로부터 하나 이상의 신호 장치에 대한 신호 데이 터 및 방해물에 대한 데이터를 수신할 수 있다. 단계 320에서, 전자 장치는 위치 정보를 추론하기 위한 인공지능 모델을 이용하여, 하나 이상의 신호 장치에 대 한 신호 데이터를 기초로 제1 위치 예측 데이터를 산출할 수 있다. 일 실시예에서, 위치 정보를 추론하기 위한 인공지능 모델은 도 2의 방법에 의해 훈련된 모델일 수 있다. 단계 320에서 산출된 제1 위치 예측 데이터는, 사용자 단말이 각 지점(point)에 위치할 확률 데이터를 포함할 수 있다. 추가적으로 또는 대안적으로, 제1 위치 예측 데이터는, 사용자 단말이 위치할 것으로 예측되는 하나 이상의 지점을 예측 순위와 함께 포함할 수 있다. 예를 들어, 제1 위치 예측 데이터는, 사용자 단말이 위치할 것으로 예측되는 1위 지점 point 1과 2위 지점 point 7을 포함할 수 있다. 단계 330에서, 전자 장치는 방해물에 대한 데이터를 기초로, 제1 위치 예측 데이터에 가중치를 적용할 수 있다. 일 실시예에서, 제1 위치 예측 데이터에 적용되는 가중치는, 방해물의 개수 및 방해물에 대한 데이터의 값 중 적어도 하나를 기초로 결정될 수 있다. 예를 들어, 다른 사용자 단말의 블루투스 신호의 세기가 강하게 측정된 경우, 전자 장치는 저품질의 신호 데이터를 기초로 산출된 제1 위치 예측 데이터에 낮은 가중치를 적용할 수 있 다. 예를 들어, 다수의 블루투스 신호가 식별된 경우, 전자 장치는 저품질의 신호 데이터를 기초로 산출된 제1 위치 예측 데이터에 낮은 가중치를 적용할 수 있다. 단계 340에서, 전자 장치는 가중치가 적용된 제1 위치 예측 데이터를 기초로 사용자 단말(즉, 추론 대상 장치) (예: 방법을 수행하는 전자 장치)의 위치 정보를 결정할 수 있다. 일 실시예에서, 전자 장치는 제2 위치 예측 데이터를 식별할 수 있다. 예를 들어, 전자 장치는 제1 위치 예측 데이터와는 다른 데이터, 방법, 알고리즘 또는 모델을 이용하여 산출된 사용자 단말에 대한 제2 위치 예측 데이 터를 식별할 수 있다. 전자 장치는 방해물에 대한 데이터를 기초로, 제2 위치 예측 데이터에 가중치를 적용할 수 있다. 이 경우, 전자 장치는 가중치가 적용된 제1 위치 예측 데이터 및 가중치가 적용된 제2 위치 예측 데이 터를 기초로, 사용자 단말의 위치 정보를 결정할 수 있다. 도 4a는 일 실시예에 따른 제1 데이터 셋의 예를 나타내는 도면이다. 도 4b는 일 실시예에 따른 제1 데이터 셋 에서 데이터가 필터링된 제2 데이터 셋의 예를 나타내는 도면이다. 도 4c는 일 실시예에 따른 증강 데이터를 포 함하는 제3 데이터 셋의 예를 나타내는 도면이다. 데이터 셋은, 하나 이상의 데이터 그룹을 포함할 수 있다. 각 데이터 그룹은 각 수집 주기에 측정되거나 획득된 데이터를 포함할 수 있다. 예를 들어, 하나의 데이터 그룹에 포함된 데이터들은 동일한 시점에 측정 또는 획득 될 수 있다. 도 4a에 도시된 바와 같이, 각 데이터 그룹(412, 414, 416)은 데이터 그룹이 측정되거나 획득된 위치를 나타내 는 정보('refpoint')를 포함할 수 있다. 각 데이터 그룹은, 각 신호 장치(예: AP 장치)에 대한 신호 데이터를 포함할 수 있다. 예를 들어, 신호 데이터는 신호 장치의 식별자('ap')를 포함할 수 있다. 신호 데이터는 신호의 세기('rssi') 값을 포함할 수 있다. 신호 데이터는 신호 데이터가 수집될 때의 수집 장치와 각 신호 장치 사이 의 거리 정보('distance')를 포함할 수 있다. 예를 들어, 거리 정보('distance')는 신호의 RTT를 통해 산출된 값일 수 있다. 각 데이터 그룹(412, 414, 416)은 방해물에 대한 데이터('bluetooth')를 포함할 수 있다. 방해물에 대한 데이터 는 각 데이터 그룹(412, 414, 416)의 신호 데이터가 수집될 때 함께 측정 또는 획득될 수 있다. 일 실시예에서, 방해물에 대한 데이터는 블루투스 신호 데이터를 포함할 수 있다. 예를 들어, 방해물에 대한 데이터는, 데이터수집 장치로부터 블루투스 신호 송수신 가능 범위에 위치한 다른 사용자 단말의 블루투스 신호 데이터를 포함할 수 있다. 즉, 신호 데이터를 측정 또는 획득 시 데이터 수집 장치 주변에 보행자가 존재하는 경우, 보행자의 사 용자 단말로부터 수신되는 블루투스 신호의 세기가 방해물에 대한 데이터로서 데이터 셋에 포함될 수 있다. 일 실시예에서, 방해물에 대한 데이터는, 방해물에 의한 Geo-magnetic 변화량을 포함할 수 있다. 예를 들어, Geo-magnetic scalar 값을 측정 또는 획득하는 데이터 수집 장치의 근거리에 다른 전자 기기가 존재하는 경우, Geo-magnetic scalar 값이 급격하게 변화할 수 있다. 즉, 근거리에 다른 전자 기기가 존재하는 경우, Geo- magnetic 변화량이 커질 수 있다. 이 경우, 방해물에 대한 데이터는, 데이터 수집 장치가 위치한 영역의 Geo- magnetic scalar에 영향을 줄 수 있는 범위에 위치한 전자 기기에 대한 데이터를 포함할 수 있다. 예를 들어, 방해물에 의한 Geo-magnetic 변화량이 방해물에 대한 데이터로서 데이터 셋에 포함될 수 있다. 제1 데이터 셋에서, 전자 장치는 임의의 데이터 그룹에 대한 방해물에 대한 데이터를 기초로, 해당 데이터 그룹에 포함된 임의의 신호 장치에 대한 신호 데이터를 필터링할 수 있다. 일 실시예에서, 전자 장치는 각 데이 터 그룹의 방해물에 대한 데이터를 기초로 각 데이터 그룹에 대한 필터링 기준치를 식별하고, 각 데이터 그룹에 서 필터링 기준치 이하의 값을 갖는 신호 데이터를 제거할 수 있다. 일 실시예에서, 필터링 기준치는 방해물의 개수 및 방해물에 대한 데이터의 값 중 적어도 하나를 기초로 결정될 수 있다. 방해물의 개수는 방해물에 대한 데이터의 개수에 대응할 수 있다. 예를 들어, 방해물에 대한 데이터의 개수가 많을수록 기준치가 높게 결정될 수 있다. 또는, 방해물에 대한 데이터의 개수가 적을수록 기준치가 높게 결정될 수 있다. 예를 들어, 방해물에 대한 데이터의 값이 클수록 기준치가 높게 결정될 수 있다. 또는, 방해물 에 대한 데이터의 값이 작을수록 기준치가 높게 결정될 수 있다. 도 4a를 참조하면, 전자 장치는 각 데이터 그룹(412, 414, 416)의 블루투스 신호 데이터를 기초로 데이터 그룹 (412, 414, 416)의 필터링 기준치를 결정할 수 있다. 일례로, 데이터 그룹의 블루투스 신호 데이터의 개수 가 1이고, 블루투스 신호의 세기가 -30dB인 것에 기초하여, 데이터 그룹의 기준치를 -65dB로 결정할 수 있 다. 또한, 전자 장치는 데이터 그룹의 블루투스 신호 데이터의 개수가 2이고, 블루투스 신호의 세기가 각 각 -50dB 및 -15dB인 것에 기초하여, 데이터 그룹의 기준치를 -55dB로 결정할 수 있다. 또한, 전자 장치는 데이터 그룹의 블루투스 신호 데이터의 개수가 0인 것에 기초하여, 데이터 그룹의 기준치를 -70dB로 결정할 수 있다. 도 4b를 참조하면, 전자 장치는 각 데이터 그룹(412, 414, 416)에 포함된 복수의 신호 데이터 중에서 필터링 기 준치 이하인 것으로 판정되는 신호 데이터를 제1 데이터 셋으로부터 제거함으로써, 제2 데이터 셋을 생성할 수 있다. 예를 들어, 전자 장치는 데이터 그룹에서 -50dB이하인 AP 2 신호 데이터를 제거할 수 있 다. 또한, 전자 장치는 데이터 그룹에서 -55dB이하인 AP 4 신호 데이터를 제거할 수 있다. 또한, 전자 장 치는 데이터 그룹에서 -70dB이하인 AP 4 신호 데이터를 제거할 수 있다. 이와 달리, 전자 장치는 데이터 그룹의 블루투스 신호 데이터의 개수가 0인 것에 기초하여, 주변의 보행자 등의 영향을 받지 않은 양질의 데이터인 데이터 그룹에 포함된 신호 데이터를 제거하지 않을 수 있다. 전자 장치는 데이터 증강을 수행함으로써 제3 데이터 셋을 생성할 수 있다. 일 실시예에서, 전자 장치는 GPR 알고리즘을 이용하여, 다른 위치(즉, 다른 refpoint)에 대한 신호 장치에 대한 신호 데이터를 기초로, 신호 데이터가 제거된 위치에 대하여 증강 데이터를 생성할 수 있다. 도 4c을 참조하면, 전자 장치는 GPR 알고리즘을 이용하여, 다른 데이터 그룹들에 포함된 신호 데이터를 기초로 각 데이터 그룹에서 제거된 신호 데이터를 보완/ 대체하는 증강 데이터를 생성할 수 있다. 도 4b 및 도 4c를 참조하면, 데이터 그룹에서 AP 2에 대한 신호 데이터가 제거된 경우, 전자 장치는 GPR 알고리즘을 이용하여 다른 데이터 그룹(414, 416)의 AP 2에 대한 신호 데이터를 기초로 데이터 그룹의 AP 2에 대한 증강 데이터를 생성할 수 있다. 마찬가지로, 데이터 그룹 및 데이터 그룹에서 AP 4에 대한 신호 데이터가 제거된 경우, 전자 장치는 GPR 알고리즘을 이용하여 다른 데이터 그룹의 AP 4에 대한 신호 데이터를 기초로 데이터 그룹(414, 416)의 AP 4에 대한 증강 데이터를 생성할 수 있다. 데이터 수집 장치는 이동하며 수집 주기에 따라 데이터를 수집하므로, 일부 위치(즉, 일부 refpoint)에 대해서 는 데이터가 수집되지 않을 수 있다. 도 4a를 참조하면, refpoint 2 및 4에서의 신호 데이터 및 방해물에 대한 데이터가 수집되지 않을 수 있다. 이에 따라, 전자 장치는 수집되지 않은 위치(즉, 제1 데이터 셋 및/또는 제2 데이터 셋에 포함된 신호 데이터에 독립된 위치) refpoint 2 및 4에 대하여 각 신호 장치에 대한 증강 데이터를 생성할 수 있다.예를 들어, 전자 장치는 GPR 알고리즘을 이용하여, 각 신호 장치에 대하여, 다른 위치에 대한 신호 데이터를 기 초로, 데이터가 수집되지 않은 위치(즉, 제1 데이터셋에 포함된 신호 데이터에 독립된 위치)에 대한 증강 데이터를 생성할 수 있다. 도 4b 및 도 4c를 참조하면, 전자 장치는 GPR 알고리즘을 이용하여, 데이터 그룹 의 AP 1에 대한 신호 데이터(즉, refpoint 1에 대한 AP 1 신호 데이터), 데이터 그룹의 AP 1에 대한 신호 데이터(즉, refpoint 3에 대한 AP 1 신호 데이터) 및 데이터 그룹의 AP 1에 대한 신호 데이터(즉, refpoint 5에 대한 AP 1 신호 데이터)를 기초로, 데이터가 수집되지 않은 위치인 refpoint 2에 대하여 AP 1에 대한 증강 데이터를 생성할 수 있다. 도 4a 내지 도 4c에 도시된 데이터 셋 구조는 인공지능 모델 학습을 위한 데이터 셋의 일례로, 이에 한정되지 않는다. 예를 들어, 데이터 셋은 도시된 정보 외의 다른 정보(예: 수집 장치에 대한 정보 등)를 더 포함할 수 있다. 예를 들어, 상이한 형태의 구조로 정보들이 분류되거나 정렬될 수 있다. 도 5a는 일 실시예에 따른 신호 데이터의 필터링을 나타내는 그래프이다. 도 5b는 일 실시예에 따른 GPR 알고리 즘을 이용한 증강 데이터의 생성을 나타내는 그래프이다. 도 5a 및 도 5b에 도시된 그래프는, 임의의 전자 장치에 대한 복수의 신호 데이터가 표시된 그래프이다. 도 5a 및 도 5b에 도시된 그래프의 x축은 거리 정보(예: 거리 값, 거리 인덱스, 위치 인덱스 등)를 나타내고, y축은 wifi 신호의 세기 값(예: dB 값)을 나타낼 수 있다. wifi 신호의 특성상 거리가 멀어 질수록 wifi 신호의 세기 는 로그 함수적으로 감소할 수 있다. 그러나, 실제 환경에서는 외부 요소들의 간섭으로 인해, 거리에 대한 wifi 신호의 세기 그래프가 완벽한 로그 함수 그래프로 나타나지 않을 수 있다. 일 실시예에서, 전자 장치는 데이터 증강을 위해, 각 신호 장치 별로 데이터를 처리/가공할 수 있다. 예를 들어, 전자 장치는 데이터 셋(예: 도 4b의 420)에 포함된 복수의 데이터 그룹(예: 도 4b의 412, 414 및 414) 각 각에서의 임의의 신호 장치에 대한 신호 데이터를 이용하여 해당 신호 장치에 대한 데이터 증강을 수행할 수 있 다. 도 5a는 임의의 신호 장치(예: AP 1)에 대한 신호 데이터의 그래프를 나타낸다. 구체적으로, 도 5a는 방해물에 대한 데이터 기반의 필터링 수행 전의 데이터 셋(예: 도 4a의 410)에 포함된 임의의 신호 장치의 신호 세기 ('rssi') 값 및 거리 정보('distance')가 반영된 그래프를 나타낸다. 도 5a의 그래프에 이산적으로 표시된 복수 의 신호 데이터는 데이터 수집 장치가 수집한 데이터일 수 있다. 임의의 신호 장치에 대한 복수의 신호 데이터 중에서, 적어도 일부의 데이터는 방해물에 대한 데이터 기반의 필 터링에 의해 제거될 수 있다. 예를 들어, 임의의 신호 장치에 대한 복수의 신호 데이터 중에서, 신호의 세기가 방해물에 대한 데이터를 기초로 결정된 기준치(예: -70dB) 이하인 신호 데이터는 제거될 수 있다. 임의의 신호 장치에 대한 복수의 신호 데이터 각각의 기준치는 서로 상이하거나 일부 상이하거나 서로 동일할 수 있다. 도 5a를 참조하면, 그래프에 표시된 복수의 신호 데이터 중에서 강조 표시(원 표시)된 신호 데이터는 방해물에 대 한 데이터 기반의 필터링에 의해 제거되는 신호 데이터를 나타낼 수 있다. 도 5b의 그래프는 도 5a의 그래프에서 원 표시된 신호 데이터가 제거된 그래프이다. 즉, 도 5b는 방해물에 대한 데이터 기반의 필터링 후 데이터 셋(예: 도 4b의 420)에 포함된 임의의 신호 장치의 신호 세기('rssi') 값 및 거리 정보('distance')가 반영된 그래프를 나타낸다. 전자 장치는 방해물에 대한 데이터 기반의 필터링 후의 데이터 셋에 포함된 임의의 신호 장치에 대한 신호 데이 터들을 기초로, GPR 모델을 이용하여 해당 신호 장치에 대한 증강 데이터를 생성할 수 있다. 예를 들어, 전자 장치는 도 5b의 그래프에 표시된 복수의 신호 데이터를 기초로, 거리에 대한 신호 세기를 나타내는 GPR 기반 함 수를 생성할 수 있다. 도 5b의 그래프에 표시된 GPR 라인은 GPR 기반 함수를 나타낸다. 전자 장치는 임의의 신호 장치에 대하여 신호 데이터가 존재하지 않는 각 위치에 대한 증강 데이터를 생성할 수 있다. 즉, 도 5b의 그래프의 각 위치에 대응하는 x축 지점에서의 GPR 라인의 신호 세기의 값을 해당 위치의 증 강 데이터로서 생성할 수 있다. 신호 데이터가 존재하지 않는 위치는, 신호 데이터가 필터링된 위치 및/또는 신 호 데이터가 수집되지 않은 위치를 포함할 수 있다. 전자 장치는 신호 데이터가 존재하지 않는 위치뿐만 아니라 신호 데이터가 존재하는 위치에 대해서도 증강 데이 터를 생성할 수 있다. 일 실시예에서, 전자 장치는 신호 데이터가 존재하는 위치에 대해서도 해당 위치에 대한 신호 데이터 및/또는 다른 위치에 대한 신호 데이터를 기초로, 해당 위치에 대한 증강 데이터를 생성할 수 있다. 예를 들어, 전자 장치는 -50dB이라는 신호 데이터가 존재하는 x축의 30 지점에 대해서도 증강 데이터를생성할 수 있다. 이 경우, 전자 장치는 x축의 30 지점에서의 GPR 라인의 값 -60dB을 증강 데이터로서 결정할 수 있다. 일 실시예에서, 전자 장치는 임의의 신호 장치에 대한 복수의 신호 데이터 중 적어도 일부의 신호 데이터를 기 초로, GPR 알고리즘을 이용하여 증강 데이터를 생성할 수 있다. 이 경우, 복수의 신호 데이터 중에서, GPR 라인 을 생성하는데 사용되는 데이터가 달라짐에 따라 GPR 라인은 달라질 수 있다. 일 실시예에서, 동일한 신호 데이 터를 이용하더라도 GPR 알고리즘의 설정값(예: 매개 변수의 값, 또는 옵션값)에 따라 GPR 라인은 달라질 수 있 다. 즉, 전자 장치는 복수의 GPR 라인을 생성할 수 있으며, 이에 따라, 하나의 x축 지점에 대하여 복수의 증강 데이터를 획득할 수 있다. 도 5a 및 도 5b의 GPR 라인을 참조하면, 필터링 전의 GPR 라인에 비해 필터링 후의 GPR 라인에서 로그 함수의 경향이 더욱 나타날 수 있다. 즉, 필터링 후에 GPR 알고리즘을 이용하여 생성된 증강 데이터가 보다 양질의 데 이터일 수 있다. 도 5a 및 5b는, 일 실시예에서 인공지능 모델의 학습 데이터를 필터링하고 증강하는 예시를 설명하기 위한 그래 프로, 전자 장치가 본 개시의 일 실시예에 따른 방법을 수행함에 따라 생성 및 출력되지 않을 수 있다. 도 6은 일 실시예에 따른 전자 장치가 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법을 나타내는 흐름도 이다. 도 6을 참조하면, 일 실시예에 따른 전자 장치가 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법 은 단계 610 내지 650을 포함할 수 있다. 일 실시예에서, 단계 610 내지 650은 전자 장치에 포함되는 적어 도 하나의 프로세서에 의해 실행될 수 있다. 다양한 실시예에서, 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법은 도 6에 도시된 바에 한정되지 않으며, 도 6에 도시되지 않은 단계를 더 포함할 수도 있다. 이하, 도 6의 설명에서 도 2와 중복되는 설명은 생략될 수 있다. 단계 610에서, 전자 장치는 제1 데이터 셋을 식별할 수 있다. 단계 620에서, 전자 장치는 제1 데이터 셋에 대하여 블루투스 신호 기반 필터링을 수행할 수 있다. 일 실시예에 서, 전자 장치는 제1 데이터 셋에서 블루투스 신호 기반으로 AP 장치의 wifi 신호 데이터를 필터링함으로써 제2 데이터 셋을 생성할 수 있다. 단계 630에서, 전자 장치는 각 지점(point)에 대한 신호 데이터의 개수가 임계값(K, K는 자연수) 이상인지 여부 를 판정할 수 있다. 일 실시예에서, 전자 장치는 복수의 위치(즉, 복수의 지점) 각각에 대한 신호 데이터의 개 수가 임계값 이상인지 여부를 판정할 수 있다. 일 실시예에서, 임계값은, 인공지능 모델의 성능(예: 정확도, 민 감도, 정밀도 등)이 임의의 기준을 만족하기 위해 필요한 학습 데이터 개수를 기반으로 결정될 수 있다. 예를 들어, 임계값은, 미리 결정된 값(예: 10개)일 수 있다. 각 지점에 대한 신호 데이터의 개수가 임계값 이상인 것으로 판정함에 응답하여, 단계 650에서, 전자 장치는 각 지점에 대한 신호 데이터를 이용하여, 인공지능 모델을 학습할 수 있다. 이와 달리, 적어도 하나의 지점에 대한 신호 데이터의 개수(예: 데이터 그룹의 개수)가 K보다 작은 것으로 판정 함에 응답하여, 단계 640에서, 전자 장치는 신호 데이터의 개수가 부족한 지점에 대하여 각 신호 장치에 대한 증강 데이터를 생성할 수 있다. 일 실시예에서, 전자 장치는 각 지점에 대한 학습 데이터(신호 데이터 및 증강 데이터)의 개수가 모두 K 이상이 되도록 증강 데이터를 생성할 수 있다. 단계 650에서, 전자 장치는 각 지점에 대한 학습 데이터를 이용하여, 인공지능 모델을 학습할 수 있다. 즉, 전 자 장치는 각 지점에 대한 복수의 신호 장치 각각의 신호 데이터 및/또는 증강 데이터를 이용하여, 인공지능 모 델을 학습할 수 있다. 도 7a 내지 7c는 일 실시예에 따라 인공지능 모델을 이용하여 사용자 단말의 위치 정보를 결정하는 예를 나타내 는 도면이다. 일 실시예에서, 사용자 단말(712, 722, 732)의 위치 정보를 추론하기 위해, 사용자 단말(712, 722, 732)은 하나 이상의 신호 장치에 대한 신호 데이터 및 사용자 단말(712, 722, 732)로부터 소정 거리에 위치한 방해물에 대한 데이터를 식별할 수 있다. 예를 들어, 도 7a 내지 도 7c를 참조하면, 사용자 단말(712, 722, 732)은 AP 1 내지 AP 4의 wifi 신호의 세기(rssi)를 측정할 수 있다. 또한, 사용자 단말(712, 722, 732)은 다른 사용자 단말 (724, 734, 736)의 블루투스 신호의 세기를 측정할 수 있다. 이 경우, 소정 거리는 블루투스 신호 송수신 가능거리를 나타낼 수 있다. 일 실시예에서, 사용자 단말(712, 722, 732)은 방해물에 대한 데이터 기반으로 필터링된 학습 데이터로 학습된 위치 정보를 추론하기 위한 인공지능 모델을 이용하여, 식별된 하나 이상의 신호 장치에 대한 신호 데이터를 기 초로 사용자 단말(712, 722, 732)의 제1 위치 예측 데이터를 산출할 수 있다. 예를 들어, 사용자 단말(712, 722, 732)은 AP 1 내지 AP 4의 wifi 신호의 세기 값을, 블루투스 신호 기반으로 필터링된 학습 데이터로 학습된 인공지능 모델에 입력함으로써, 출력되는 제1 위치 예측 데이터를 획득할 수 있다. 일 실시예에서, 인공지능 모델은 사용자 단말(712, 722, 732)이 공간 내의 복수의 지점 중에서 임의의 지점에 위치할 확률(또는 확률에 대응하는 스코어)를 포함하는 제1 위치 예측 데이터를 출력할 수 있다. 예를 들어, 인 공지능 모델은 적어도 하나의 지점의 식별자 및 확률(또는 스코어)를 포함하는 제1 위치 예측 데이터를 출력할 수 있다. 일 실시예에서, 인공지능 모델은 복수의 지점 중에서 적어도 하나의 지점의 식별자 및 예측 순위를 포 함하는 제1 위치 예측 데이터를 출력할 수 있다. 상기 적어도 일부의 지점은, 예측 순위가 1위에서 특정 순위까 지에 해당하는 지점을 포함할 수 있다. 일례로, 제1 위치 예측 데이터는 '[(1위, point1), (2위, point9), (3위, point5), (4위, point3), (5위, point5)]'와 같은 구조로 출력될 수 있다. 각 지점의 예측 순위는 각 지 점의 스코어를 기반으로 결정될 수 있다. 예를 들어, 사용자 단말(712, 722, 732)이 위치할 확률(즉, 스코어)이 가장 높은 지점인 point 1의 예측 순위는 1위로, 확률이 두번째로 높은 지점인 point 7의 예측 순위는 2위로 결 정될 수 있다. 일 실시예에서, 사용자 단말(712, 722, 732)은 방해물에 대한 데이터를 기초로, 인공지능 모델 기반으로 산출된 제1 위치 예측 데이터에 가중치를 적용할 수 있다. 추가적으로, 사용자 단말(712, 722, 732)은 제2 위치 예측 데이터를 식별할 수 있다. 사용자 단말(712, 722, 732)은 방해물에 대한 데이터를 기초로 제2 위치 예측 데이터 에 가중치를 적용할 수 있다. 제2 위치 예측 데이터는, 제1 위치 예측 데이터와는 다른 데이터, 방법, 알고리즘 및/또는 모델을 기반으로 산 출된 데이터일 수 있다. 예를 들어, 제1 위치 예측 데이터가 블루투스 신호 기반으로 필터링된 학습 데이터를 이용하여 학습된 인공지능 모델로부터 출력된 데이터인 경우, 제2 위치 예측 데이터는 Geo-magnetic 변화량 기 반으로 필터링된 학습 데이터를 이용하여 학습된 인공지능 모델로부터 출력된 데이터일 수 있다. 일 실시예에서, 제2 위치 예측 데이터는, 복수의 지점 중에서 적어도 하나의 지점에 사용자 단말(712, 722, 732)이 위치할 확률(또는 스코어)를 포함할 수 있다. 예를 들어, 제2 위치 예측 데이터는, 적어도 하나의 지점 의 식별자 및 확률(또는 스코어)를 포함할 수 있다. 일 실시예에서, 제2 위치 예측 데이터는, 복수의 지점 중에 서 적어도 하나의 지점의 식별자 및 예측 순위를 포함하는 제1 위치 예측 데이터를 출력할 수 있다. 상기 적어 도 하나의 지점은, 예측 순위가 1위에서 특정 순위까지에 해당하는 지점을 포함할 수 있다. 일 실시예에서, 사용자 단말(712, 722, 732)은 가중치가 적용된 제1 위치 예측 데이터를 기초로, 사용자 단말 (712, 722, 732)의 위치 정보를 결정할 수 있다. 일례로, 사용자 단말(712, 722, 732)은 아래 수학식 을 이 용하여, 사용자 단말(712, 722, 732)의 위치 정보를 결정할 수 있다. 수학식"}
{"patent_id": "10-2022-0138457", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 수학식에서, refpointn는 예측 순위가 n 위인 지점의 좌표 값을 나타내고, k는 사용자 단말의 위치를 결정하는데 고려할 예측 지점의 개수, wn은 refpointn에 적용할 가중치 값을 나타낼 수 있다. 가중치(wn)는, 신 호 데이터 측정 시의 블루투스 신호 데이터를 기초로 결정되는 임의의 값일 수 있다. 사용자 단말(712, 722, 732)은 상기 수학식로 산출된 predict_refpoint의 값에 근접한 지점을 사용자 단말(712, 722, 732)의 위치 로 결정할 수 있다. 사용자 단말(712, 722, 732)은 가중치가 적용된 제1 위치 예측 데이터 및 제2 위치 예측 데이터를 기초로, 사용 자 단말(712, 722, 732)의 위치 정보를 결정할 수 있다. 예를 들어, 사용자 단말(712, 722, 732)은 아래 수학식 를 이용하여, 사용자 단말(712, 722, 732)의 위치 정보를 결정할 수 있다.수학식"}
{"patent_id": "10-2022-0138457", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 수학식 에서, f.refpointn은 제1 위치 예측 데이터에서 예측 순위가 n위인 지점의 좌표값을 나타내고, s.refpointn은 제2 위치 예측 데이터에서 예측 순위가 n위인 지점의 좌표값을 나타내고, wn은 제1 위치 예측 데 이터에서의 n순위의 지점에 적용할 가중치 값을 나타내고, wn+m은 제2 위치 예측 데이터에서의 n순위의 지점에 적용할 가중치 값을 나타낼 수 있다. m은 제1 위치 예측 데이터에서 사용자 단말의 위치 정보를 결정하기 위해 고려할 예측 지점의 개수를 나타내고, k는 제2 위치 예측 데이터에서 사용자 단말의 위치 정보를 결정하기 위해 고려할 예측 지점의 개수를 나타낼 수 있다. 사용자 단말(712, 722, 732)은 상기 수학식로 산출된 predict_refpoint의 값에 해당하는 지점 또는 근접한 지점을 사용자 단말(712, 722, 732)의 위치로 결정할 수 있다. 도 7a를 참조하면, 사용자 단말에 수신되는 블루투스 신호가 없는 경우, 즉, 사용자 단말 주변에 다 른 사용자 단말이 존재하지 않는 경우, 사용자 단말은 아래와 같은 수학식 을 기초로, 위치 정보를 결 정할 수 있다. 수학식"}
{"patent_id": "10-2022-0138457", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상기 수학식에서 f.refpoint1은 제1 위치 예측 데이터에 따른 1위 예측 지점을 나타내고, f.refpoint2는 제1 위치 예측 데이터에 따른 2위 예측 지점을 나타낸다. 또한, s.refpoint1은 제2 위치 예측 데이터에 따른 1위 예 측 지점을 나타낸다. 사용자 단말은 상기 수학식으로 산출된 predict_refpoint의 값에 근접한 지점을 사용자 단말의 위치로 결정할 수 있다. 즉, 도 7a와 같이, 주변에 다른 사용자 단말로부터의 블루투스 신 호가 수신되지 않는 경우, 사용자 단말은 제1 위치 예측 데이터에 제2 위치 예측 데이터보다 높은 가중치 를 적용하여 위치 정보를 결정할 수 있다. 도 7b를 참조하면, 사용자 단말에 하나의 블루투스 신호가 수신되는 경우, 즉, 사용자 단말 주변에 하나의 다른 사용자 단말이 존재하는 경우, 사용자 단말은 아래와 수학식 를 기초로, 위치 정보를 결정할 수 있다. 수학식"}
{"patent_id": "10-2022-0138457", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "상기 수학식에서 f.refpoint1은 제1 위치 예측 데이터에 따른 1위 예측 지점을 나타내고, f.refpoint2는 제1 위치 예측 데이터에 따른 2위 예측 지점을 나타낸다. 또한, s.refpoint1은 제2 위치 예측 데이터에 따른 1위 예 측 지점을 나타낸다. 사용자 단말은 상기 수학식로 산출된 predict_refpoint의 값에 근접한 지점을 사 용자 단말의 위치로 결정할 수 있다. 도 7a와 비교하여, 사용자 단말은 방해물의 간섭을 받은 신호 데이터를 기초로 산출된 제1 위치 예측 데이터의 가중치를 낮추고, 제2 위치 예측 데이터의 가중치를 높일 수 있다. 도 7c를 참조하면, 사용자 단말에 2개의 블루투스 신호가 수신되는 경우, 즉, 사용자 단말 주변에 2 개의 다른 사용자 단말(734, 736)이 존재하는 경우, 사용자 단말은 아래와 수학식 를 기초로, 위치 정 보를 결정할 수 있다. 수학식 상기 수학식에서 f.refpoint1은 제1 위치 예측 데이터에 따른 1위 예측 지점을 나타낸다. s.refpoint1는 제2 위치 예측 데이터에 따른 1위 예측 지점을 나타내고, s.refpoint2는 제2 위치 예측 데이터에 따른 2위 예측 지 점을 나타낸다. 사용자 단말은 상기 수학식으로 산출된 predict_refpoint의 값에 근접한 지점을 사용자 단말의 위치로 결정할 수 있다. 도 7a 및 도 7b와 비교하여, 사용자 단말은 방해물의 간섭을 많이 받 은 신호 데이터를 기초로 산출된 제1 위치 예측 데이터의 가중치를 낮추고, 제2 위치 예측 데이터의 가중치를 높일 수 있다. f.refpont1, f.refpoint2, s.refpont1 및 s.refpoint2는 공간에서 각 지점에 대응하는 (x,y) 좌표 값일 수 있다. 이에 따라, 상기 수학식 내지 수학식 에 의해 산출되는 'predict_refpoint'도 (x,y) 값으로 표현될 수 있다. 사용자 단말(712, 722, 732)은 'predict_refpoint'의 값에 대응되는 지점을 사용자 단말(712, 722, 73 2)의 위치로 결정할 수 있다. 예를 들어, 'predict_refpoint'의 값이 (0.23, 2.89)로 산출되는 경우, (0.23, 2.89)을 반올림한 좌표인 (0,3)의 지점(예: point 4)을 사용자 단말의 위치로 결정할 수 있다. 도 8은 일 실시예에 따른 인공지능 모델을 학습하는 전자 장치, 데이터를 수집하는 전자 장치 및 위치 정보를 추론하는 전자 장치의 블록도이다. 도 8의 전자 장치는 인공지능 모델을 학습하는 임의의 컴퓨팅 장치일 수 있다. 전자 장치는 하나 이 상의 서버 장치를 포함할 수 있다. 전자 장치는 적어도 하나의 프로세서 및 메모리를 포함할 수 있다. 도 8의 전자 장치는 인공지능 모델의 학습 데이터를 수집하는 임의의 컴퓨팅 장치일 수 있다. 전자 장치는 적어도 하나의 프로세서 및 메모리를 포함할 수 있다. 도 8의 전자 장치는 인공지 능 모델을 이용하여 위치 정보를 추론하는 임의의 컴퓨팅 장치일 수 있다. 전자 장치는 적어도 하나의 프 로세서 및 메모리를 포함할 수 있다. 전자 장치(850, 860)는 스마트폰(smart phone), 태블릿 PC(tablet PC), 모바일폰(mobile phone), 스마트 워치 (smart watch), 데스크탑 컴퓨터(desktop computer), 랩탑 컴퓨터(laptop computer), 노트북(notebook), 스마 트 글래스(smart glass), 네비게이션(navigation) 장치, 웨어러블 디바이스(wearable device), AR 디바이스 (augmented reality device), VR 디바이스(virtual reality device), 디지털 신호 송수신기(digital signal transceiver) 등의 사용자 단말일 수 있다. 프로세서(820, 852, 862)는 전자 장치(810, 850, 860)에 포함된 구성들과 전기적으로 연결되어, 전자 장치(810, 850, 860)에 포함된 구성들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 일 실시예에 따르면, 프로세서(820, 852, 862)는 다른 구성들 중 적어도 하나로부터 수신된 요청, 명령 또는 데이터를 메모 리(830, 854, 864)에 로드하여 처리하고, 결과 데이터를 메모리(830, 854, 864)에 저장할 수 있다. 다양한 실시 예에 따르면, 프로세서(820, 852, 862)는 CPU(central processing unit), AP(application processor), DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU(graphic processing unit), VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서, 또는 NPU(neural processing unit)와 같은 인공지능 전용 프 로세서 중 적어도 하나를 포함할 수 있다. 프로세서(820, 852, 862)는, 메모리에 저장된 기 정의된 동작 규칙 또는 인공지능 모델에 따라, 입력 데이터를 처리하도록 제어할 수 있다. 또는, 프로세서(820, 852, 862)가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 할 수 있다. 여기서, 학습을 통해 만들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습 됨으로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐 을 의미할 수 있다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별 도의 서버 및/또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습 (reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 메모리(830, 854, 864)는 프로세서(820, 852, 862)와 전기적으로 연결되고 전자 장치(810, 850, 860)에 포함된 구성들의 동작과 관련된 하나 이상의 모듈, 적어도 하나의 학습 모델, 프로그램, 명령어 또는 데이터를 저장할 수 있다. 예를 들어, 메모리(830, 854, 864)는 프로세서(820, 852, 862)의 처리 및 제어를 위한 하나 이상의 모 듈, 학습 모델, 프로그램, 명령어 또는 데이터를 저장할 수 있다. 메모리(830, 854, 864)는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어, SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 메모리에 포함된 모듈 또는 모델은, 프로세서의 제어 또는 명령에 따라 실행되며, 입력 데이터에 대 한 출력 데이터를 도출하는 동작들을 수행하도록 구성된 프로그램, 모델 또는 알고리즘을 포함할 수 있다. 도 8 을 참조하면, 전자 장치의 메모리는 데이터 필터링 모듈, 데이터 증강 모듈 및 모델 학습 모듈을 포함할 수 있다. 일 실시예에서, 데이터 필터링 모듈은 프로세서에 의해 실행됨으로써, 메모리에 로드된 제1 데이터 셋을 방해물에 대한 데이터 기반으로 필터링함으로써 제2 데이터 셋을 생성할 수 있다. 일 실시예에서, 데이터 증강 모듈은 프로세서에 의해 실행됨으로써, 제2 데이터 셋에 부족 한 데이터에 대하여 증강 데이터를 생성함으로써 제3 데이터 셋을 생성할 수 있다. 일 실시예에서, 모델 학습 모듈은 프로세서에 의해 실행됨으로써, 제3 데이터 셋을 이용하여 인공지능 모델을 훈련할 수 있다. 도 8에서는, 모듈(832, 834, 836)을 메모리에 포함된 소프트웨어 구성으로 도시하고 있으나, 이에 한정되 지 않는다. 예를 들어, 모듈(832, 834, 836) 중 적어도 일부는 메모리에 저장된 소프트웨어 모듈이 아닌 별도의 하드웨어 모듈로 구현될 수도 있다. 전자 장치의 메모리는 인공지능 모델을 포함할 수 있다. 예를 들어, 메모리는 인공지능 모 델을 구성하는 복수의 가중치를 포함할 수 있다. 여기서, 인공지능 모델은, 모델 학습 모듈에 의해 위치 정보를 추론 또는 예측하도록 훈련된 학습 모델일 수 있다. 예를 들어, 인공지능 모델은, 모델 학습 모듈에 의해 지도 학습, 비지도 학습, 준지도 학습 또는 강화 학습으로 훈련된 학습 모델일 수 있으 나, 이에 한정되지 않는다. 인공지능 모델은 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레 이어들 각각은 복수의 가중치들(weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경망 연산을 수행할 수 있다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치 들은 인공지능 모델의 학습 결과에 의해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득 한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공지 능 모델은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네 트워크 (Deep Q-Networks) 등이 있으나, 이에 한정되지 않는다. 전자 장치(810, 850, 860)는 네트워크를 통해 서로 통신할 수 있다. 네트워크는, 전자 장치(810, 850, 860) 사이의 통신이 가능하도록 구성될 수 있다. 예를 들어, 네트워크는 설치 환경에 따라, 이더넷 (Ethernet), 유선 홈 네트워크(Power Line Communication), 전화선 통신 및 RS-serial 통신 등의 유선 네트워 크, 이동통신망, WLAN(Wireless LAN), Wi-Fi 등과 같은 무선 네트워크 또는 그 조합으로 구성될 수 있다. 예를 들어, 네트워크는, 근거리 통신 네트워크 (예: 블루투스, WiFi direct 또는 IrDA(infrared data association)), 원거리 통신 네트워크(예: 셀룰러 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)) 또는 그 조합으로 구성될 수 있다. 일 실시예에서, 전자 장치는 네트워크을 통해 전자 장치로부터 인공지능 모델의 학습을 위 한 학습 데이터(예: 데이터 셋)를 수신할 수 있다. 일 실시예에서, 전자 장치는 네트워크을 통해 전 자 장치로부터 인공지능 모델을 수신할 수 있다. 예를 들어, 전자 장치는 네트워크를 통해 전자 장치로부터 인공지능 모델을 이용하여 위치 추론을 수행하기 위한 정보를 포함하는 데이터를 수 신할 수 있다. 일례로, 전자 장치는 네트워크을 통해 전자 장치로부터 인공지능 모델을 구 성하는 신경망 정보, 레이어 정보, 레이어 간의 가중치 정보 등을 포함하는 데이터를 수신할 수 있다. 예를 들 어, 전자 장치는 메모리에서 메모리로 로드된 인공지능 모델을 이용하여 위치 정보를 추론 하는 동작을 수행할 수 있다. 도 8에서는 인공지능 모델을 학습하는 장치, 학습 데이터를 수집하는 장치 및 위치 정보를 추론하는 장치가 각각 도시되어 있으나, 이에 한정되지 않는다. 예를 들어, 인공지능 모델을 학습하는 장치는 학습 데이터를 수집하는 장치와 동일한 장치일 수 있다. 예를 들어, 인공지능 모델을 학습하는 장치 는 학습된 인공지능 모델을 이용하여 위치 정보를 추론하는 장치와 동일한 장치일 수 있다. 예를 들어, 학 습 데이터를 수집하는 장치는 인공지능 모델을 이용하여 위치 정보를 추론하는 장치와 동일한 장치일수 있다. 전자 장치(810, 850, 860)는 도 8에 도시된 구성 요소들보다 더 많은 구성 요소들을 포함할 수 있다. 예를 들어, 전자 장치(810, 850, 860)는 외부 장치와의 통신을 위한 통신 인터페이스(또는 통신 모듈)을 더 포함할 수 있다. 예를 들어, 전자 장치는 사용자 입력 신호를 수신하기 위한 입력 장치 및 입출력 인터페이스를 더 포함할 수 있다. 예를 들어, 전자 장치는 위치 정보를 출력하기 위한 출력 장치 및 입출력 인터페이스 를 더 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비 일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미 할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하 지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운 로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 본 개시의 일 실시예에 따른 위치(position) 정보를 추론하기 위한 인공지능 모델을 학습하는 방법은, 제1 위치 에서 사용자 단말에 의해 수집된 신호 장치에 대한 제1 신호 데이터, 상기 제1 신호 데이터 수집 시 상기 사용 자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이터 및 제2 위치에서 수집된 상기 신호 장치에 대한 제 2 신호 데이터를 포함하는 제1 데이터 셋을 식별하는 단계를 포함할 수 있다. 일 실시예에서, 상기 방법은 상기 방해물에 대한 데이터를 기초로 상기 제1 데이터 셋으로부터 상기 제1 신호 데이터를 필터링함으로써, 제2 데이 터 셋을 생성하는 단계를 포함할 수 있다. 일 실시예에서, 상기 방법은 상기 제2 신호 데이터를 기초로 상기 제 1 위치 및 상기 신호 장치에 대한 증강 데이터(augmented data)를 생성함으로써, 제3 데이터 셋을 생성하는 단 계를 포함할 수 있다. 일 실시예에서, 상기 방법은, 상기 제3 데이터 셋을 이용하여 상기 인공지능 모델을 훈련 하는 단계를 포함할 수 있다. 일 실시예에서, 상기 제3 데이터 셋을 생성하는 단계는, GPR(Gaussian Process Regression) 알고리즘을 이용하 여, 상기 제2 신호 데이터를 기초로 상기 제1 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는 단계를 포함할 수 있다. 일 실시예에서, 상기 제3 데이터 셋을 생성하는 단계는, GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제2 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는 단계를 포함할 수 있다. 일 실시예에서, 상기 제1 데이터 셋은, 제3 위치에서 수집된 상기 신호 장치에 대한 제3 신호 데이터를 포함할 수 있다. 이 경우, 상기 제3 데이터 셋을 생성하는 단계는, GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제3 위치 및 상기 신호 장치에 대한 증강 데이터를 생성하는 단계를 포함할 수 있다. 일 실시예에서, 상기 제3 데이터 셋을 생성하는 단계는, GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기 초로 상기 제1 데이터 셋에 포함된 신호 데이터에 독립된 제4 위치 및 상기 신호 장치에 대한 증강 데이터를 생 성하는 단계를 포함할 수 있다. 일 실시예에서, 상기 제1 신호 데이터는, 상기 제1 위치에서 측정된 상기 신호 장치의 신호 세기의 값을 포함할 수 있다. 일 실시예에서, 상기 제2 데이터 셋을 생성하는 단계는, 상기 방해물에 대한 데이터를 기초로, 상기 제1 신호 데이터에 대한 필터링 기준치를 식별하는 단계를 포함할 수 있다. 일 실시예에서, 상기 제2 데이터 셋 을 생성하는 단계는, 상기 신호 세기의 값이 상기 필터링 기준치 이하인 것으로 판정함에 기초하여, 상기 제1 신호 데이터를 제거하는 단계를 포함할 수 있다. 일 실시예에서, 상기 필터링 기준치는, 상기 방해물의 개수 및 상기 방해물에 대한 데이터의 값 중 적어도 하나 를 기초로 결정될 수 있다. 일 실시예에서, 상기 방해물에 대한 데이터는, 다른 사용자 단말의 근거리 통신 신 호 세기의 값 및 상기 방해물에 의한 Geo-magnetic 변화량 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 상기 제3 데이터 셋을 생성하는 단계는, 상기 제2 데이터 셋에 포함된 상기 제1 위치 및 상기 신호 장치에 대한 신호 데이터의 총 개수가 임계값보다 작은 것으로 판정함에 기초하여, 상기 제1 위치 및 상기신호 장치에 대한 증강 데이터를 생성하는 단계를 포함할 수 있다. 상술한 실시예들 중 적어도 일부에 따른 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법을 컴퓨터에 서 수행하기 위한 프로그램은 컴퓨터로 읽을 수 있는 기록 매체에 기록될 수 있다. 본 개시의 일 실시예에 따른 사용자 단말의 위치 정보를 추론하는 방법은, 하나 이상의 신호 장치에 대한 신호 데이터 및 상기 사용자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이터를 식별하는 단계를 포함할 수 있다. 일 실시예에서, 상기 방법은, 위치 정보를 추론하기 위한 인공지능 모델을 이용하여, 상기 하나 이상의 신호 장치에 대한 신호 데이터를 기초로 제1 위치 예측 데이터를 산출하는 단계를 포함할 수 있다. 일 실시예에 서, 상기 방법은, 상기 방해물에 대한 데이터를 기초로, 상기 제1 위치 예측 데이터에 가중치를 적용하는 단계 를 포함할 수 있다. 일 실시예에서, 상기 방법은 상기 가중치가 적용된 제1 위치 예측 데이터를 기초로, 상기 사용자 단말의 위치 정보를 결정하는 단계를 포함할 수 있다. 일 실시예에서, 상기 방법은, 제2 위치 예측 데이터를 식별하는 단계를 포함할 수 있다. 일 실시예에서, 상기 방법은 상기 방해물에 대한 데이터를 기초로, 상기 제2 위치 예측 데이터에 가중치를 적용하는 단계를 포함할 수 있다. 일 실시예에서, 상기 위치 정보를 결정하는 단계는, 상기 가중치가 적용된 제1 위치 예측 데이터 및 상기 가중치가 적용된 제2 위치 예측 데이터를 기초로, 상기 사용자 단말의 위치 정보를 결정하는 단계를 포함 할 수 있다. 일 실시예에서, 상기 하나 이상의 신호 장치에 대한 신호 데이터는, 상기 하나 이상의 신호 장치의 신호 세기의 값 포함할 수 있다. 일 실시예에서, 상기 방해물에 대한 데이터는, 다른 사용자 단말의 근거리 통신 신호 세기 의 값 및 상기 방해물에 의한 Geo-magnetic 변화량 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 상기 제1 위치 예측 데이터에 적용되는 가중치는, 상기 방해물의 개수 및 상기 방해물에 대한 데이터의 값 중 적어도 하 나를 기초로 결정될 수 있다. 상술한 실시예들 중 적어도 일부에 따른 사용자 단말의 위치 정보를 추론하는 방법을 컴퓨터에서 수행하기 위한 프로그램은 컴퓨터로 읽을 수 있는 기록 매체에 기록될 수 있다. 본 개시의 일 실시예에 따른 사용자 단말의 위치 정보를 추론하는 전자 장치는, 하나 이상의 명령어를 저장하는 메모리 및 상기 메모리에 저장된 상기 하나 이상의 명령어를 실행하는 적어도 하나의 프로세서를 포함할 수 있 다. 일 실시예에서, 상기 적어도 하나의 프로세서는 상기 하나 이상의 명령어(instruction)를 실행함으로써, 제 1 위치에서 사용자 단말에 의해 수집된 신호 장치에 대한 제1 신호 데이터, 상기 제1 신호 데이터 수집 시 상기 사용자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이터 및 제2 위치에서 수집된 상기 신호 장치에 대 한 제2 신호 데이터를 포함하는 제1 데이터 셋을 식별할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서 는 상기 방해물에 대한 데이터를 기초로 상기 제1 데이터 셋으로부터 상기 제1 신호 데이터를 필터링함으로써, 제2 데이터 셋을 생성할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 상기 제2 신호 데이터를 기 초로 상기 제1 위치 및 상기 신호 장치에 대한 증강 데이터를 생성함으로써, 제3 데이터 셋을 생성할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는 상기 제3 데이터 셋을 이용하여 상기 인공지능 모델을 훈련할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상 기 제1 위치 및 상기 신호 장치에 대한 증강 데이터를 생성할 수 있다. 일 실시예에서, 상기 적어도 하나의 프 로세서는, GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제2 위치 및 상기 신호 장치에 대한 증강 데이터를 생성할 수 있다. 일 실시예에서, 상기 제1 데이터 셋은, 제3 위치에서 수집된 상기 신호 장치에 대한 제3 신호 데이터를 포함할 수 있다. 이 경우, 상기 적어도 하나의 프로세서는, GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제3 위치 및 상기 신호 장치에 대한 증강 데이터를 생성할 수 있다. 일 실 시예에서, 상기 적어도 하나의 프로세서는, GPR 알고리즘을 이용하여, 상기 제2 신호 데이터를 기초로 상기 제1 데이터 셋에 포함된 신호 데이터에 독립된 제4 위치 및 상기 신호 장치에 대한 증강 데이터를 생성할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 상기 방해물에 대한 데이터를 기초로, 상기 제1 신호 데이터에 대한 필터링 기준치를 식별할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 상기 신호 세기의 값이 상기 필터링 기준치 이하인 것으로 판정함에 기초하여, 상기 제1 신호 데이터를 제거할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 상기 제2 데이터 셋에 포함된 상기 제1 위치 및 상기 신호 장 치에 대한 신호 데이터의 총 개수가 임계값보다 작은 것으로 판정함에 기초하여, 상기 제1 위치 및 상기 신호 장치에 대한 증강 데이터를 생성할 수 있다.본 개시의 일 실시예에 따른 사용자 단말의 위치 정보를 추론하는 전자 장치는, 하나 이상의 명령어를 저장하는 메모리 및 상기 메모리에 저장된 상기 하나 이상의 명령어를 실행하는 적어도 하나의 프로세서를 포함할 수 있 다. 일 실시예에서, 상기 적어도 하나의 프로세서는 하나 이상의 신호 장치에 대한 신호 데이터 및 상기 사용자 단말로부터 소정 거리 내에 위치한 방해물에 대한 데이터를 식별할 수 있다. 일 실시예에서, 적어도 하나의 프 로세서는 위치 정보를 추론하기 위한 인공지능 모델을 이용하여, 상기 하나 이상의 신호 장치에 대한 신호 데이 터를 기초로 제1 위치 예측 데이터를 산출할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 상기 방해물에 대한 데이터를 기초로, 상기 제1 위치 예측 데이터에 가중치를 적용할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 상기 가중치가 적용된 제1 위치 예측 데이터를 기초로, 상기 사용자 단말의 위치 정보를 결정할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는 제2 위치 예측 데이터를 식별할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는 상기 방해물에 대한 데이터를 기초로, 상기 제2 위치 예측 데이터에 가중치를 적용할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는 상기 가중치가 적용된 제1 위치 예측 데이터 및 상기 가중치가 적용된 제2 위치 예측 데이터를 기초로, 상기 사용자 단말의 위치 정보를 결정할 수 있다."}
{"patent_id": "10-2022-0138457", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따라 위치 정보를 추론하기 위한 인공지능 모델의 학습 데이터를 수집하는 예시를 나타내는 도면이다. 도 2는 일 실시예에 따른 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법을 나타내는 흐름도 이다. 도 3은 일 실시예에 따른 사용자 단말의 위치 정보를 추론하는 방법을 나타내는 흐름도 이다. 도 4a는 일 실시예에 따른 제1 데이터 셋의 예를 나타내는 도면이다. 도 4b는 일 실시예에 따른 제1 데이터 셋에서 데이터가 필터링된 제2 데이터 셋의 예를 나타내는 도면이다. 도 4c는 일 실시예에 따른 증강 데이터를 포함하는 제3 데이터 셋의 예를 나타내는 도면이다. 도 5a는 일 실시예에 따른 신호 데이터의 필터링을 나타내는 그래프이다. 도 5b는 일 실시예에 따른 GPR 알고리즘을 이용한 증강 데이터 생성을 나타내는 그래프이다. 도 6은 일 실시예에 따른 전자 장치가 위치 정보를 추론하기 위한 인공지능 모델을 학습하는 방법을 나타내는 흐름도 이다. 도 7a 내지 7c는 일 실시예에 따라 사용자 단말의 위치 정보를 결정하는 예를 나타내는 도면이다. 도 8은 일 실시예에 따른 인공지능 모델을 학습하는 전자 장치, 데이터를 수집하는 전자 장치 및 위치 정보를 추론하는 전자 장치의 블록도이다."}
