{"patent_id": "10-2021-0004135", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0101983", "출원번호": "10-2021-0004135", "발명의 명칭": "캐릭터 육성을 이용한 생활습관 관리 장치 및 그 방법", "출원인": "정요한", "발명자": "정요한"}}
{"patent_id": "10-2021-0004135", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제어부에 의해, 사용자를 포함하는 영상 정보로부터 사용자의 얼굴 및 체형을 인식하는 단계;상기 제어부에 의해, 상기 인식된 사용자의 얼굴 및 체형을 근거로 미리 설정된 아바타 생성 모델을 이용해서사용자를 닮은 아바타를 생성하는 단계;통신부에 의해, 연속 혈당 진단기를 통해 미리 설정된 시간 간격으로 사용자로부터 측정되는 혈당치를 수신하는단계;상기 제어부에 의해, 사용자 입력에 따라 사용자가 섭취한 음식 정보인 사용자 섭취 음식 정보를 수신하는단계;센서부에 의해, 사용자의 움직임에 따른 운동 강도, 운동 종류 및 운동 시간을 포함하는 사용자 운동 정보를 측정하는 단계;상기 제어부에 의해, 상기 수신된 혈당치, 상기 수신된 사용자 섭취 음식 정보 및 상기 측정된 사용자 운동 정보를 미리 설정된 생활습관 모델의 입력값으로 하여 기계 학습을 수행하고, 기계 학습 수행 결과를 근거로 사용자의 생활습관을 확인하는 단계; 및상기 제어부에 의해, 상기 확인된 사용자의 생활습관에 따른 추천 생활 습관 정보를 표시하는 단계를 포함하는캐릭터 육성을 이용한 생활습관 관리 방법."}
{"patent_id": "10-2021-0004135", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 캐릭터 육성을 이용한 생활습관 관리 장치 및 그 방법을 개시한다. 즉, 본 발명은 얼굴과 체형 인식을 통해 사용자를 닮은 아바타를 생성하고, 연속 혈당 진단기를 통해 지속적으로 혈당치를 측정하고, 사용자가 섭취 한 음식 정보를 수신하고, 웨어러블 센서를 이용해서 사용자의 움직임 등 운동 강도를 측정하고, 인공지능을 통 해 사용자와 관련한 혈당치, 음식 정보, 음식 섭취 방법, 운동 강도, 운동 종류 등을 종합적으로 분석하여 사용 자의 생활습관을 확인하고, 확인된 사용자의 생활습관에 따른 추천 생활습관 정보를 제공함으로써, 사용자의 건 강 상태를 지속적으로 확인할 수 있다."}
{"patent_id": "10-2021-0004135", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 캐릭터 육성을 이용한 생활습관 관리 장치 및 그 방법에 관한 것으로서, 특히 얼굴과 체형 인식을 통 해 사용자를 닮은 아바타를 생성하고, 연속 혈당 진단기를 통해 지속적으로 혈당치를 측정하고, 사용자가 섭취 한 음식 정보를 수신하고, 웨어러블 센서를 이용해서 사용자의 움직임 등 운동 강도를 측정하고, 인공지능을 통 해 사용자와 관련한 혈당치, 음식 정보, 음식 섭취 방법, 운동 강도, 운동 종류 등을 종합적으로 분석하여 사용 자의 생활습관을 확인하고, 확인된 사용자의 생활습관에 따른 추천 생활습관 정보를 제공하는 캐릭터 육성을 이 용한 생활습관 관리 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0004135", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "생활 습관은 사람의 실제 생활에서 자연스럽게 만들어진 습관이다. 또한, 잘못된 생활 습관이 지속되는 경우, 질병 등에 걸릴 가능성이 증가하기에, 사용자들은 올바른 생활 습관 을 유지하고자 노력하고 있지만, 실제 어떤 점을 보완하고 자신의 상태에 따른 어떤 점을 조심해야할지 잘 모르 는 경우가 많다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2019-0088622호 [제목: 지속적인 생활습관 관리를 위한 설득 기반 건강증진 시스템]"}
{"patent_id": "10-2021-0004135", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 얼굴과 체형 인식을 통해 사용자를 닮은 아바타를 생성하고, 연속 혈당 진단기를 통해 지속적 으로 혈당치를 측정하고, 사용자가 섭취한 음식 정보를 수신하고, 웨어러블 센서를 이용해서 사용자의 움직임 등 운동 강도를 측정하고, 인공지능을 통해 사용자와 관련한 혈당치, 음식 정보, 음식 섭취 방법, 운동 강도, 운동 종류 등을 종합적으로 분석하여 사용자의 생활습관을 확인하고, 확인된 사용자의 생활습관에 따른 추천 생 활습관 정보를 제공하는 캐릭터 육성을 이용한 생활습관 관리 장치 및 그 방법을 제공하는 데 있다. 본 발명의 다른 목적은 사용자의 혈당치 관리, 섭취한 음식 정보, 수행한 운동 종류 및 운동 강도 등에 따라 사 용자를 닮은 아바타의 상태를 다양하게 표시하는 캐릭터 육성을 이용한 생활습관 관리 장치 및 그 방법을 제공 하는 데 있다."}
{"patent_id": "10-2021-0004135", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 캐릭터 육성을 이용한 생활습관 관리 방법은 제어부에 의해, 사용자를 포함하는 영상 정보로부터 사용자의 얼굴 및 체형을 인식하는 단계; 상기 제어부에 의해, 상기 인식된 사용자의 얼굴 및 체형 을 근거로 미리 설정된 아바타 생성 모델을 이용해서 사용자를 닮은 아바타를 생성하는 단계; 통신부에 의해, 연속 혈당 진단기를 통해 미리 설정된 시간 간격으로 사용자로부터 측정되는 혈당치를 수신하는 단계; 상기 제 어부에 의해, 사용자 입력에 따라 사용자가 섭취한 음식 정보인 사용자 섭취 음식 정보를 수신하는 단계; 센서 부에 의해, 사용자의 움직임에 따른 운동 강도, 운동 종류 및 운동 시간을 포함하는 사용자 운동 정보를 측정하 는 단계; 상기 제어부에 의해, 상기 수신된 혈당치, 상기 수신된 사용자 섭취 음식 정보 및 상기 측정된 사용자 운동 정보를 미리 설정된 생활습관 모델의 입력값으로 하여 기계 학습을 수행하고, 기계 학습 수행 결과를 근거 로 사용자의 생활습관을 확인하는 단계; 및 상기 제어부에 의해, 상기 확인된 사용자의 생활습관에 따른 추천 생활 습관 정보를 표시하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0004135", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 얼굴과 체형 인식을 통해 사용자를 닮은 아바타를 생성하고, 연속 혈당 진단기를 통해 지속적으로 혈 당치를 측정하고, 사용자가 섭취한 음식 정보를 수신하고, 웨어러블 센서를 이용해서 사용자의 움직임 등 운동 강도를 측정하고, 인공지능을 통해 사용자와 관련한 혈당치, 음식 정보, 음식 섭취 방법, 운동 강도, 운동 종류 등을 종합적으로 분석하여 사용자의 생활습관을 확인하고, 확인된 사용자의 생활습관에 따른 추천 생활습관 정 보를 제공함으로써, 사용자의 건강 상태를 지속적으로 확인할 수 있는 효과가 있다. 또한, 본 발명은 사용자의 혈당치 관리, 섭취한 음식 정보, 수행한 운동 종류 및 운동 강도 등에 따라 사용자를 닮은 아바타의 상태를 다양하게 표시함으로써, 자신의 생활습관과 건강 상태를 반영한 자신을 닮은 아바타를 육 성함에 따라 사용자의 흥미를 유발하고, 더욱 적극적으로 생활습관을 관리하도록 유도할 수 있는 효과가 있다."}
{"patent_id": "10-2021-0004135", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에서 사용되는 기술적 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려 는 의도가 아님을 유의해야 한다. 또한, 본 발명에서 사용되는 기술적 용어는 본 발명에서 특별히 다른 의미로 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 기술적인 용어가 본 발명의 사상을 정확하게 표현하지 못하는 잘못된 기술적 용어일 때에 는 당업자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것이다. 또한, 본 발명에서 사용 되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상에 따라 해석되어야 하며, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함한다. 본 발명에서 \"구성된다\" 또는 \"포함한다\" 등의 용어는 발명에 기재된 여러 구성 요소들 또는 여러 단계를 반드 시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수 도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 또한, 본 발명에서 사용되는 제 1, 제 2 등과 같이 서수를 포함하는 용어는 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요소들은 용어들에 의해 한정되어서는 안 된다. 용어들은 하나의 구성 요소를 다른 구성 요소 로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성 요소는 제 2 구성 요소로 명명될 수 있고, 유사하게 제 2 구성 요소도 제 1 구성 요소로 명명될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일 하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 발명의 사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 발명의 사상이 제한되는 것으로 해석되어서는 아니 됨을 유의해야 한다. 도 1은 본 발명의 실시예에 따른 캐릭터 육성을 이용한 생활습관 관리 장치의 구성을 나타낸 블록도이다. 도 1에 도시한 바와 같이, 생활습관 관리 장치는 통신부, 센서부, 저장부, 표시부, 음성 출력부 및 제어부로 구성된다. 도 1에 도시된 생활습관 관리 장치의 구성 요소 모두가 필 수 구성 요소인 것은 아니며, 도 1에 도시된 구성 요소보다 많은 구성 요소에 의해 생활습관 관리 장치가 구현될 수도 있고, 그보다 적은 구성 요소에 의해서도 생활습관 관리 장치가 구현될 수도 있다. 상기 생활습관 관리 장치는 스마트폰(Smart Phone), 휴대 단말기(Portable Terminal), 이동 단말기 (Mobile Terminal), 폴더블 단말기(Foldable Terminal), 개인 정보 단말기(Personal Digital Assistant: PDA), PMP(Portable Multimedia Player) 단말기, 텔레매틱스(Telematics) 단말기, 내비게이션(Navigation) 단말기, 개인용 컴퓨터(Personal Computer), 노트북 컴퓨터, 슬레이트 PC(Slate PC), 태블릿 PC(Tablet PC), 울트라북 (ultrabook), 웨어러블 디바이스(Wearable Device, 예를 들어, 워치형 단말기(Smartwatch), 글래스형 단말기 (Smart Glass), HMD(Head Mounted Display) 등 포함), 와이브로(Wibro) 단말기, IPTV(Internet Protocol Television) 단말기, 스마트 TV, 디지털방송용 단말기, AVN(Audio Video Navigation) 단말기, A/V(Audio/Video) 시스템, 플렉시블 단말기(Flexible Terminal), 디지털 사이니지 장치 등과 같은 다양한 단말 기에 적용될 수 있다. 이때, 상기 생활습관 관리 장치는 자신의 건강 상태를 확인하고, 그에 따른 피드백 을 제공받고자 하는 사용자가 소지한 단말일 수 있다. 상기 통신부는 유/무선 통신망을 통해 내부의 임의의 구성 요소 또는 외부의 임의의 적어도 하나의 단말기 와 통신 연결한다. 이때, 상기 외부의 임의의 단말기는 서버(미도시) 등을 포함할 수 있다. 여기서, 무선 인터 넷 기술로는 무선랜(Wireless LAN: WLAN), DLNA(Digital Living Network Alliance), 와이브로(Wireless Broadband: Wibro), 와이맥스(World Interoperability for Microwave Access: Wimax), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), IEEE 802.16, 롱 텀 에볼루션(Long Term Evolution: LTE), LTE-A(Long Term Evolution-Advanced), 광대역 무선 이동 통신 서비스(Wireless Mobile Broadband Service: WMBS) 등이 있으며, 상기 통신부는 상기에서 나열되지 않은 인터넷 기술까지 포함한 범위에서 적어도 하나의 무선 인터넷 기술에 따라 데이터를 송수신하게 된다. 또한, 근거리 통신 기술로는 블루 투스(Bluetooth), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association: IrDA), UWB(Ultra Wideband), 지그비(ZigBee), 인접 자장 통신(Near Field Communication: NFC), 초음파 통신(Ultra Sound Communication: USC), 가시광 통신(Visible Light Communication: VLC), 와이 파이(Wi-Fi), 와이 파이 다이렉트(Wi-Fi Direct) 등이 포함될 수 있다. 또한, 유선 통신 기술로는 전력선 통신(Power Line Communication: PLC), USB 통신, 이더넷(Ethernet), 시리얼 통신(serial communication), 광/동축 케이블 등이 포함될 수 있다. 또한, 상기 통신부는 유니버설 시리얼 버스(Universal Serial Bus: USB)를 통해 임의의 단말과 정보를 상 호 전송할 수 있다. 또한, 상기 통신부는 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE- A(Long Term Evolution-Advanced) 등)에 따라 구축된 이동 통신망 상에서 기지국, 상기 서버 등과 무선 신호를 송수신한다. 또한, 상기 통신부는 상기 제어부의 제어에 의해, 연속 혈당 진단기(미도시)를 통해 측정된 사용자와 관련한 혈당 정보 등을 수신한다.상기 센서부는 동작 인식 센서, 웨어러블 센서 등을 포함한다. 또한, 상기 센서부는 상기 제어부의 제어에 의해, 사용자의 움직임 등을 포함하는 운동 종류, 운동 강도 등을 측정한다. 상기 저장부는 다양한 사용자 인터페이스(User Interface: UI), 그래픽 사용자 인터페이스(Graphic User Interface: GUI) 등을 저장한다. 또한, 상기 저장부는 상기 생활습관 관리 장치가 작동하는데 필요한 데이터와 프로그램 등을 저장한 다. 즉, 상기 저장부는 상기 생활습관 관리 장치에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 생활습관 관리 장치의 작동을 위한 데이터들, 명령어들을 저장 할 수 있다. 이러한 응용 프로그램 중 적어도 일부는 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 또한, 이러한 응용 프로그램 중 적어도 일부는 생활습관 관리 장치의 기본적인 기능을 위하여 출고 당시부 터 생활습관 관리 장치 상에 존재할 수 있다. 한편, 응용 프로그램은 상기 저장부에 저장되고, 생활 습관 관리 장치에 설치되어, 제어부에 의하여 상기 생활습관 관리 장치의 작동(또는 기능)을 수 행하도록 구동될 수 있다. 또한, 상기 저장부는 플래시 메모리 타입(Flash Memory Type), 하드 디스크 타입(Hard Disk Type), 멀티 미디어 카드 마이크로 타입(Multimedia Card Micro Type), 카드 타입의 메모리(예를 들면, SD 또는 XD 메모리 등), 자기 메모리, 자기 디스크, 광디스크, 램(Random Access Memory: RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory: ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory) 중 적어도 하나의 저장매체를 포함할 수 있다. 또한, 생활습관 관리 장 치는 인터넷(internet)상에서 저장부의 저장 기능을 수행하는 웹 스토리지(web storage)를 운영하거 나, 또는 상기 웹 스토리지와 관련되어 작동할 수도 있다. 또한, 상기 저장부는 상기 제어부의 제어에 의해 상기 수신된 사용자와 관련한 혈당 정보, 상기 측정 된 사용자의 운동에 따른 운동 종류, 운동 강도 등을 저장한다. 상기 표시부(또는 디스플레이부)는 상기 제어부의 제어에 의해 상기 저장부에 저장된 사용자 인 터페이스 및/또는 그래픽 사용자 인터페이스를 이용하여 다양한 메뉴 화면 등과 같은 다양한 콘텐츠를 표시할 수 있다. 여기서, 상기 표시부에 표시되는 콘텐츠는 다양한 텍스트 또는 이미지 데이터(각종 정보 데이터 포함)와 아이콘, 리스트 메뉴, 콤보 박스 등의 데이터를 포함하는 메뉴 화면 등을 포함한다. 또한, 상기 표시부 는 터치 스크린 일 수 있다. 또한, 상기 표시부는 액정 디스플레이(Liquid Crystal Display: LCD), 박막 트랜지스터 액정 디스플레이 (Thin Film Transistor-Liquid Crystal Display: TFT LCD), 유기 발광 다이오드(Organic Light-Emitting Diode: OLED), 플렉시블 디스플레이(Flexible Display), 3차원 디스플레이(3D Display), 전자잉크 디스플레이 (e-ink display), LED(Light Emitting Diode) 중에서 적어도 하나를 포함할 수 있다. 또한, 상기 표시부는 상기 제어부의 제어에 의해 전용 앱 실행에 따른 앱 실행 결과 화면을 표시한다. 또한, 상기 표시부는 상기 제어부의 제어에 의해 상기 수신된 사용자와 관련한 혈당 정보, 상기 측정 된 사용자의 운동에 따른 운동 종류, 운동 강도 등을 표시한다. 상기 음성 출력부는 상기 제어부에 의해 소정 신호 처리된 신호에 포함된 음성 정보를 출력한다. 여 기서, 상기 음성 출력부에는 리시버(receiver), 스피커(speaker), 버저(buzzer) 등이 포함될 수 있다. 또한, 상기 음성 출력부는 상기 제어부에 의해 생성된 안내 음성을 출력한다. 또한, 상기 음성 출력부는 상기 제어부의 제어에 의해 상기 표시부에 표시되는 앱 실행 결과 화 면, 상기 사용자와 관련한 혈당 정보, 상기 사용자의 운동에 따른 운동 종류, 운동 강도 등에 대응하는 음성 정 보(또는 음향 정보) 등을 출력한다. 상기 제어부(controller, 또는 MCU(microcontroller unit)는 상기 캐릭터 육성을 이용한 생활습관 관리 장치의 전반적인 제어 기능을 실행한다.또한, 상기 제어부는 상기 저장부에 저장된 프로그램 및 데이터를 이용하여 생활습관 관리 장치(10 0)의 전반적인 제어 기능을 실행한다. 상기 제어부는 RAM, ROM, CPU, GPU, 버스를 포함할 수 있으며, RAM, ROM, CPU, GPU 등은 버스를 통해 서로 연결될 수 있다. CPU는 상기 저장부에 액세스하여, 상기 저장부 에 저장된 O/S를 이용하여 부팅을 수행할 수 있으며, 상기 저장부에 저장된 각종 프로그램, 콘텐츠, 데이터 등을 이용하여 다양한 작동을 수행할 수 있다. 또한, 상기 제어부는 상기 서버와의 연동에 의해, 상기 서버에서 제공하는 전용 앱 및/또는 웹 사이트를 통해 캐릭터 생성 기능, 캐릭터 육성 기능, 혈당 정보 측정/수신 기능, 운동 종류 및 운동 강도 측정 기능, 생 활습관 정보 추천 기능 등을 제공받기 위한 사용자로 회원 가입하며, 개인 정보 등을 상기 서버에 등록한다. 이 때, 상기 개인 정보는 아이디, 이메일 주소, 패스워드(또는 비밀번호), 이름, 성별, 생년월일, 연락처(또는 전 화번호), 주소지 등을 포함한다. 또한, 상기 제어부는 해당 생활습관 관리 장치의 사용자가 가입한 SNS 계정 정보 또는 모바일 메신저 계정 정보를 이용하여 상기 서버에 사용자로 회원 가입할 수도 있다. 여기서, 상기 SNS 계정은 페이스북, 트위 터, 카카오 스토리, 네이버, 페이코(PAYCO) 등과 관련한 정보일 수 있다. 또한, 상기 모바일 메신저 계정은 카 카오톡(KakaoTalk), 라인(line), 바이버(viber), 위챗(wechat), 와츠앱(whatsapp), 텔레그램(Telegram), 스냅 챗(snapchat) 등과 관련한 정보일 수 있다. 또한, 회원 가입 절차 수행 시, 상기 제어부는 본인 인증 수단(예를 들어 이동 전화, 신용카드, 아이핀 등 포함)을 통한 인증 기능을 완료해야 상기 서버에 대한 회원 가입 절차를 정상적으로 완료할 수 있다. 또한, 회원 가입이 완료된 후, 상기 제어부는 상기 서버에서 제공하는 서비스를 이용하기 위해서, 상기 서 버로부터 제공되는 전용 앱(또는 애플리케이션/응용 프로그램/특정 앱)을 해당 생활습관 관리 장치에 설치 한다. 이때, 상기 전용 앱은 캐릭터 생성 기능, 캐릭터 육성 기능, 혈당 정보 측정/수신 기능, 운동 종류 및 운 동 강도 측정 기능, 생활습관 정보 추천 기능 등을 수행하기 위한 앱일 수 있다. 또한, 상기 제어부는 카메라(미도시)를 통해 촬영된(또는 획득된) 해당 생활습관 관리 장치의 사용자 를 포함하는 영상 정보로부터 해당 사용자의 얼굴, 체형 등을 인식한다. 또한, 상기 제어부는 상기 인식된 사용자의 얼굴, 체형 등을 근거로 미리 설정된 아바타 생성 모델을 이용 해서 사용자를 닮은 아바타를 생성(또는 제작)한다. 이때, 상기 제어부는 해당 생활습관 관리 장치의 사용자 입력(또는 사용자 선택/터치/제어)에 따라 해당 아바타의 헤어 스타일, 옷, 구두 등에 대한 스타일링 기 능을 추가로 수행할 수도 있다. 또한, 상기 제어부는 연속 혈당 진단기(미도시)를 통해 미리 설정된 시간 간격으로 해당 생활습관 관리 장 치의 사용자로부터 측정되는 혈당치(또는 혈당 정보)를 상기 통신부를 통해 수신한다. 이때, 상기 통 신부는 상기 연속 혈당 진단기와 유/무선 통신 방식을 통해 통신할 수 있다. 또한, 상기 제어부는 상기 생활습관 관리 장치의 사용자 입력에 따라 사용자가 섭취한 음식 정보를 수신한다. 이때, 상기 제어부는 해당 사용자가 섭취하고자 하는 하나 이상의 음식을 포함하는 영상 정보를 상기 카메라를 통해 획득(또는 촬영)하고, 상기 획득된 영상 정보를 분석하여, 사용자가 섭취한 음식 정보를 확 인할 수도 있다. 여기서, 상기 제어부는 상기 영상 정보 분석을 통해 사용자가 섭취한 음식 종류를 확인하 고, 상기 확인된 음식 종류를 상기 표시부에 표시하고, 사용자 입력에 따라 실제 사용자가 섭취한 음식량 을 수신하여, 사용자가 섭취한 음식 종류, 음식량 등을 포함하는 사용자 섭취 음식 정보를 생성할 수도 있다. 또한, 상기 제어부는 상기 센서부를 통해 사용자의 움직임 등 운동 강도, 운동 종류, 운동 시간 등을 측정한다. 이때, 상기 제어부는 사용자의 움직임을 포함하는 영상 정보를 상기 카메라를 통해 획득하고, 상기 획득된 영상 정보를 분석하여, 사용자가 수행한 운동 종류, 운동 강도, 운동 시간 등을 확인할 수도 있다. 여기서, 상기 제어부는 상기 영상 정보 분석을 통해 사용자가 수행한 운동 종류를 확인하고, 상기 확인된 운동 종류를 상기 표시부에 표시하고, 사용자 입력에 따라 실제 사용자가 수행한 운동 강도, 운동 시간 등 을 수신하여, 사용자가 수행한 운동 종류, 운동 강도, 운동 시간 등을 포함하는 사용자 운동 정보를 생성할 수 도 있다. 또한, 상기 제어부는 인공지능을 통해 사용자와 관련한 혈당치(또는 혈당 정보), 음식 정보, 음식 섭취 방 법, 운동 강도, 운동 종류 등을 종합적으로 분석하여 사용자의 생활습관을 확인한다. 즉, 상기 제어부는 상기 수신된 혈당치, 상기 수신된(또는 생성된) 사용자 섭취 음식 정보, 상기 측정된 (또는 생성된) 사용자 운동 정보 등을 미리 설정된 생활습관 모델의 입력값으로 하여 기계 학습(또는 딥 러닝/ 인공 지능)을 수행하고, 기계 학습 결과(또는 딥 러닝 결과/인공 지능 수행 결과)를 근거로 해당 사용자의 생활 습관을 확인(또는 예측)한다. 또한, 상기 제어부는 상기 확인된 사용자의 생활습관에 따른 추천 생활습관 정보를 생성한다. 또한, 상기 제어부는 상기 생성된 추천 생활습관 정보를 상기 표시부 및/또는 상기 음성 출력부(15 0)를 통해 출력한다. 또한, 상기 제어부는 상기 확인된 사용자의 생활습관에 따라 상기 생성된 아바타 육성 기능을 수행한다. 이때, 상기 제어부는 상기 사용자의 생활습관에 따라 상기 생성된 아바타의 표정, 동작, 움직임 등을 다양 하게 설정할 수 있다. 이에 따라, 앱을 통해 생활 습관을 관리하고, 아바타 활용 동기부여 요소를 강화할 수 있다. 또한, 사용자 입력에 따라 식단 자료를 수신하는 경우, 상기 제어부는 상기 서버로부터 상기 아바타를 꾸 밀 수 있는 꾸미기 쿠폰을 제공받는다. 이때, 상기 식단 자료는 영상 인식, 음성 인식, 수기 기록 등의 방식으 로 수신할 수 있다. 또한, 사용자 입력에 따라 생체신호 자동 입력 연동 시, 상기 제어부는 상기 서버로부터 상기 아바타를 꾸 밀 수 있는 꾸미기 쿠폰을 제공받는다. 또한, 사용자 입력에 따라 생체신호 수동 입력시, 상기 제어부는 상기 서버로부터 상기 아바타를 꾸밀 수 있는 꾸미기 쿠폰을 제공받는다. 또한, 상기 제어부는 해당 사용자의 혈당 관리가 일정 기간 잘 이루어지는 경우, 상기 서버로부터 보너스 쿠폰을 제공받는다. 또한, 상기 제어부는 해당 사용자의 비만 관리가 일정 기간 잘 이루어지는 경우, 상기 서버로부터 보너스 쿠폰을 제공받는다. 또한, 생체 신호, 식단 기록 등이 미입력되는 경우, 상기 제어부는 상기 캐릭터의 노화 속도, 비만도 등이 증가한 상태를 상기 표시부를 통해 표시한다. 또한, 혈당스파이크 발생시, 상기 제어부는 상기 캐릭터의 노화 속도, 비만도 등이 증가한 상태를 상기 표 시부를 통해 표시한다. 또한, 상기 제어부는 옷, 헤어스타일, 비만관리, 피부관리, 노화도 등 캐릭터의 다양한 요소들을 기록 입 력시 지급되는 쿠폰을 활용해 꾸미기 기능을 수행한다. 또한, 상기 제어부는 정성스럽게 꾸민 나만의 캐릭터를 상기 서버에서 제공하는 커뮤니티에 업로드하여 자 랑할 수 있다. 또한, 기록을 입력하지 않거나, 생체 신호가 악화되는 경우, 상기 제어부는 초췌한 얼굴로 경고 멘트를 표 시한다. 본 발명의 실시예에서는 상기 생활습관 관리 장치에서 전용 앱 형태로 캐릭터 생성 기능, 캐릭터 육성 기 능, 혈당 정보 측정/수신 기능, 운동 종류 및 운동 강도 측정 기능, 생활습관 정보 추천 기능 등을 수행하는 것 을 설명하고 있으나, 이에 한정되는 것은 아니며, 상기 전용 앱 이외에도 상기 서버에서 제공하는 웹 사이트 등 을 통해 상기 캐릭터 생성 기능, 상기 캐릭터 육성 기능, 상기 혈당 정보 측정/수신 기능, 상기 운동 종류 및 운동 강도 측정 기능, 상기 생활습관 정보 추천 기능 등을 수행할 수도 있다. 이와 같이, 얼굴과 체형 인식을 통해 사용자를 닮은 아바타를 생성하고, 연속 혈당 진단기를 통해 지속적으로 혈당치를 측정하고, 사용자가 섭취한 음식 정보를 수신하고, 웨어러블 센서를 이용해서 사용자의 움직임 등 운 동 강도를 측정하고, 인공지능을 통해 사용자와 관련한 혈당치, 음식 정보, 음식 섭취 방법, 운동 강도, 운동 종류 등을 종합적으로 분석하여 사용자의 생활습관을 확인하고, 확인된 사용자의 생활습관에 따른 추천 생활습 관 정보를 제공할 수 있다. 전술된 내용은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어 나지 않는 범위에서 수정 및 변형이 가능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상 을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0004135", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 캐릭터 육성을 이용한 생활습관 관리 장치의 구성을 나타낸 블록도이다."}
