{"patent_id": "10-2023-0186252", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0047075", "출원번호": "10-2023-0186252", "발명의 명칭": "자연어처리모델을 이용한 캐릭터 영상통화 제공방법, 이를 수행하는 컴퓨팅시스템, 및 이를", "출원인": "셀렉트스타 주식회사", "발명자": "전문휘"}}
{"patent_id": "10-2023-0186252", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "1 이상의 메모리 및 1 이상의 프로세스를 포함하는 컴퓨팅시스템에서 수행되는 딥러닝 형태의 자연어처리모델을이용한 캐릭터 영상통화 제공방법으로서,사용자단말을 통해 입력된 오디오 형태의 오디오입력정보가 STT모델에 의하여 텍스트 형태로 변환된 텍스트입력정보를 수신하는 대화입력단계;딥러닝 형태의 자연어처리모델에 입력할 제1프롬프트를 생성하되, 상기 제1프롬프트는 텍스트입력정보, 및 대화히스토리를 포함하는 제1프롬프트생성단계; 및상기 제1프롬프트가 상기 자연어처리모델에 입력되어 출력되는 텍스트출력정보를 수신하는 텍스트출력정보수신단계;를 포함하고,상기 텍스트출력정보는 TTS모델에 의하여 오디오 형태의 오디오출력정보로 변환되어 사용자단말에서 재생됨으로써, 사용자에게 해당 캐릭터의 음성을 전달하는, 캐릭터 영상통화 제공방법."}
{"patent_id": "10-2023-0186252", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제1프롬프트생성단계는,기저장된 사용자정보를 입력받는 사용자정보입력단계; 및기저장된 레슨정보를 입력받는 레슨정보입력단계;를 포함하고,상기 제1프롬프트는 상기 사용자정보 및 상기 레슨정보를 더 포함하는, 캐릭터 영상통화 제공방법."}
{"patent_id": "10-2023-0186252", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 캐릭터 영상통화 제공방법은,상기 텍스트출력정보를 상기 텍스트출력정보로부터 도출될 수 있는 텍스트 형태의 텍스트감정정보로 변환하고,상기 텍스트감정정보를 포함하는 제2프롬프트를 상기 자연어처리모델에 입력하는 제2프롬프트생성단계를 더 포함하고,상기 자연어처리모델은 상기 제2프롬프트를 입력받아 감정출력정보를 출력하고,상기 TTS모델은 상기 감정출력정보를 입력받아 캐릭터감정정보를 출력하고,상기 캐릭터감정정보는 상기 오디오출력정보와 결합되어 상기 사용자단말로 전달되는, 캐릭터 영상통화 제공방법."}
{"patent_id": "10-2023-0186252", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 오디오출력정보는 영상출력정보와 함께 사용자단말로 전달되고,상기 영상출력정보는 기저장된 복수의 감정표현 중 상기 감정출력정보에 기초하여 결정되는 감정표현정보를 포공개특허 10-2025-0047075-3-함하고, 상기 감정표현정보는 해당 캐릭터를 통해 시각적으로 표시되는 감정표현에 대한 정보로서, 해당 캐릭터는 상기오디오출력정보가 상기 사용자단말에서 출력되기 전에 상기 감정표현을 표시하는, 캐릭터 영상통화 제공방법."}
{"patent_id": "10-2023-0186252", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 캐릭터 영상통화 제공방법은,상기 대화히스토리에 포함되는 M(M은 2 이상의 자연수) 개의 대화내역을 포함하는 제3프롬프트를 생성하는 제3프롬프트생성단계; 및상기 제3프롬프트를 상기 자연어처리모델에 입력하여 얻은 N(N은 M 미만의 자연수)개의 요약대화정보에 기초하여 유저메모리정보를 생성하는 유저메모리생성단계;를 더 포함하고,상기 유저메모리정보는 상기 요약대화정보 및 상기 요약대화정보를 임베딩모델에 입력하여 벡터형태의 요약대화특징정보를 포함하는, 캐릭터 영상통화 제공방법."}
{"patent_id": "10-2023-0186252", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서상기 캐릭터 영상통화 제공방법은,상기 특징정보추출단계에서 도출된 벡터형태의 특징정보; 및 과거에 해당 캐릭터와 사용자가 나눈 대화내용이저장된 기설정된 DB집합;에 대하여 유사도에 기반한 검색알고리즘을 적용하여, 기설정된 기준을 충족하는 대화내용을 도출하면, 해당 대화내용에 기초하여 텍스트출력정보를 생성하는 인스턴트답변생성단계;를 더 포함하는,캐릭터 영상통화 제공방법."}
{"patent_id": "10-2023-0186252", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "1 이상의 메모리 및 1 이상의 프로세스를 포함하고, 딥러닝 형태의 자연어처리모델을 이용한 캐릭터 영상통화제공방법을 수행하는 컴퓨팅시스템으로서,사용자단말을 통해 입력된 오디오 형태의 오디오입력정보가 STT모델에 의하여 텍스트 형태로 변환된 텍스트입력정보를 수신하는 대화입력부;딥러닝 형태의 자연어처리모델에 입력할 제1프롬프트를 생성하되, 상기 제1프롬프트는 텍스트입력정보, 및 대화히스토리를 포함하는 제1프롬프트생성부; 및상기 제1프롬프트가 상기 자연어처리모델에 입력되어 출력되는 텍스트출력정보를 수신하는 텍스트출력정보수신부;를 포함하고,상기 텍스트출력정보는 TTS모델에 의하여 오디오 형태의 오디오출력정보로 변환되어 사용자단말에서 재생됨으로써, 사용자에게 해당 캐릭터의 음성을 전달하는, 컴퓨팅시스템."}
{"patent_id": "10-2023-0186252", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "1 이상의 메모리 및 1 이상의 프로세서를 포함하는 컴퓨팅시스템에서 수행되는, 딥러닝 형태의 자연어처리모델을 이용한 캐릭터 영상통화 제공방법을 구현하기 위한 컴퓨터-판독가능 기록매체로서,상기 컴퓨터-판독가능 기록매체는, 상기 컴퓨팅시스템으로 하여금 이하의 단계들을 수행하도록 하는 명령들을저장하며,공개특허 10-2025-0047075-4-상기 이하의 단계들은:사용자단말을 통해 입력된 오디오 형태의 오디오입력정보가 STT모델에 의하여 텍스트 형태로 변환된 텍스트입력정보를 수신하는 대화입력단계;딥러닝 형태의 자연어처리모델에 입력할 제1프롬프트를 생성하되, 상기 제1프롬프트는 텍스트입력정보, 및 대화히스토리를 포함하는 제1프롬프트생성단계; 및상기 제1프롬프트가 상기 자연어처리모델에 입력되어 출력되는 텍스트출력정보를 수신하는 텍스트출력정보수신단계;를 포함하고,상기 텍스트출력정보는 TTS모델에 의하여 오디오 형태의 오디오출력정보로 변환되어 사용자단말에서 재생됨으로써, 사용자에게 해당 캐릭터의 음성을 전달하는, 컴퓨터-판독가능 기록매체."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 자연어처리모델을 이용한 캐릭터 영상통화 제공방법, 이를 수행하는 컴퓨팅시스템, 및 이를 구현하기 위한 컴퓨터-판독가능 기록매체로서, 더욱 상세하게는, 딥러닝 형태의 자연어처리모델에 실제 애니메이션과 같은 작품 속에서 등장하는 캐릭터의 영상, 목소리, 말투, 성격, 배경 등과 관련된 정보를 포함하는 프롬프트를 입력 함으로써, 사용자에게 해당 캐릭터와 실시간으로 영상통화를 하는 듯한 경험을 제공할 수 있는, 자연어처리모델 을 이용한 캐릭터 영상통화 제공방법, 이를 수행하는 컴퓨팅시스템, 및 이를 구현하기 위한 컴퓨터-판독가능 기 록매체에 관한 것이다."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자연어처리모델을 이용한 캐릭터 영상통화 제공방법, 이를 수행하는 컴퓨팅시스템, 및 이를 구현하기 위한 컴퓨터-판독가능 기록매체로서, 더욱 상세하게는, 딥러닝 형태의 자연어처리모델에 실제 애니메이션과 같 은 작품 속에서 등장하는 캐릭터의 영상, 목소리, 말투, 성격, 배경 등과 관련된 정보를 포함하는 프롬프트를 입력함으로써, 사용자에게 해당 캐릭터와 실시간으로 영상통화를 하는 듯한 경험을 제공할 수 있는, 자연어처리 모델을 이용한 캐릭터 영상통화 제공방법, 이를 수행하는 컴퓨팅시스템, 및 이를 구현하기 위한 컴퓨터-판독가 능 기록매체에 관한 것이다."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 언어모델은 대용량 텍스트에서 언어 이해 능력과 지식을 학습하는 것으로, 2020년 7월 OpenAI에서 발 표한 GPT-3(Generative Pre-trained Transformers)를 발표한 이후 폭발적인 관심을 받고 있다. 초대형 컴퓨팅 과 데이터로 생성된 GPT-3 학습모델을 활용하여 소량의 학습 데이터로 응용 태스크에 적용이 가능해졌으며, 다 양한 분야에서 활용될 수 있어 관련 연구가 활발히 진행되고 있다. 상기 인공지능 언어모델의 여러 종류 중에 하나인 생성형 AI 언어모델(Generative AI Language Model)은 대용량 데이터를 미리 학습하여 주어진 단어 열에 가장 적합한 다음 단어를 예측하는 모델로, 이미 알고 있는 이전 단 어를 이용하여 어떤 단어가 가장 좋은지 예측할 수 있도록 신경망으로 학습하고, 단어나 문장을 적절하게 선택 하거나 생성해야 하는 여러 후보 중에서 더 좋은 후보를 선택하는 것을 가능하게 한다."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "생성형 AI 언어모델은 입력된 언어를 이해한 후 새로운 언어로 생성해야 하는 자동번역, 문장 요약, 대화나 챗 봇, 스토리 생성 등의 언어 생성 유형의 태스크에서 잘 작동하며, 해당 모델로는 OpenAI의 GPT 계열의 모델, CMU(Carnegie Mellon University)와 구글 브레인이 공동으로 개발한 XLNet, 페이스북의 BART(Bidirectional and Auto-Regressive Transformer) 등이 있다. 특히, 인공지능 언어모델 중 방대한 양의 텍스트 데이터로 훈련된 언어모델을 초거대언어모델(Large Language Model, LLM)이라 하며, 종래의 자연어 처리기술이 일부 단어와 문장을 고려하여 인간의 자연어를 분석하고 처리 했던 반면, LLM의 경우 전체 문맥을 고려해서 처리하기 때문에, 보다 자연스럽고 맥락에 알맞은 답변을 출력할 수 있다는 점에서 진보된 모델이라고 할 수 있고, 최근 LLM의 성능이 현저하게 향상됨에 따라 다양한 분야에서 응용될 수 있다는 점에서 주목받고 있다. 한편, 이와 같은 인공지능 언어모델을 이용한 챗봇 서비스 등의 종래 기술이 다수 발명되었으나, 사용자에게 익 숙한 인물과 화상통화하는 듯한 경험이나 자신이 원하는 캐릭터와 직접 화상통화를 하는 경험 등을 제공하는 종 래 기술은 전무하다."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "발명의 내용"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 자연어처리모델을 이용한 캐릭터 영상통화 제공방법, 이를 수행하는 컴퓨팅시스템, 및 이를 구현하기 위한 컴퓨터-판독가능 기록매체로서, 더욱 상세하게는, 딥러닝 형태의 자연어처리모델에 실제 애니메이션과 같 은 작품 속에서 등장하는 캐릭터의 영상, 목소리, 말투, 성격, 배경 등과 관련된 정보를 포함하는 프롬프트를 입력함으로써, 사용자에게 해당 캐릭터와 실시간으로 영상통화를 하는 듯한 경험을 제공할 수 있는, 자연어처리 모델을 이용한 캐릭터 영상통화 제공방법, 이를 수행하는 컴퓨팅시스템, 및 이를 구현하기 위한 컴퓨터-판독가 능 기록매체를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 과제를 해결하기 위하여, 본 발명의 일 실시예에서는, 1 이상의 메모리 및 1 이상의 프로세스를 포 함하는 컴퓨팅시스템에서 수행되는 딥러닝 형태의 자연어처리모델을 이용한 캐릭터 영상통화 제공방법으로서, 사용자단말을 통해 입력된 오디오 형태의 오디오입력정보가 STT모델에 의하여 텍스트 형태로 변환된 텍스트입력 정보를 수신하는 대화입력단계; 딥러닝 형태의 자연어처리모델에 입력할 제1프롬프트를 생성하되, 상기 제1프롬 프트는 텍스트입력정보, 및 대화히스토리를 포함하는 제1프롬프트생성단계; 및 상기 제1프롬프트가 상기 자연어 처리모델에 입력되어 출력되는 텍스트출력정보를 수신하는 텍스트출력정보수신단계;를 포함하고, 상기 텍스트출 력정보는 TTS모델에 의하여 오디오 형태의 오디오출력정보로 변환되어 사용자단말에서 재생됨으로써, 사용자에 게 해당 캐릭터의 음성을 전달하는, 캐릭터 영상통화 제공방법을 제공한다. 본 발명의 일 실시예에서는, 상기 제1프롬프트생성단계는, 기저장된 사용자정보를 입력받는 사용자정보입력단계; 및 기저장된 레슨정보를 입력받는 레슨정보입력단계;를 포함하고, 상기 제1프롬프트는 상 기 사용자정보 및 상기 레슨정보를 더 포함할 수 있다. 본 발명의 일 실시예에서는, 상기 캐릭터 영상통화 제공방법은, 상기 텍스트출력정보를 상기 텍스트출력정보로 부터 도출될 수 있는 텍스트 형태의 텍스트감정정보로 변환하고, 상기 텍스트감정정보를 포함하는 제2프롬프트 를 상기 자연어처리모델에 입력하는 제2프롬프트생성단계를 더 포함하고, 상기 자연어처리모델은 상기 제2프롬 프트를 입력받아 감정출력정보를 출력하고, 상기 TTS모델은 상기 감정출력정보를 입력받아 캐릭터감정정보를 출 력하고, 상기 캐릭터감정정보는 상기 오디오출력정보와 결합되어 상기 사용자단말로 전달될 수 있다. 본 발명의 일 실시예에서는, 상기 오디오출력정보는 영상출력정보와 함께 사용자단말로 전달되고, 상기 영상출 력정보는 기저장된 복수의 감정표현 중 상기 감정출력정보에 기초하여 결정되는 감정표현정보를 포함하고, 상기 감정표현정보는 해당 캐릭터를 통해 시각적으로 표시되는 감정표현에 대한 정보로서, 해당 캐릭터는 상기 오디 오출력정보가 상기 사용자단말에서 출력되기 전에 상기 감정표현을 표시할 수 있다. 본 발명의 일 실시예에서는, 상기 캐릭터 영상통화 제공방법은, 상기 대화히스토리에 포함되는 M(M은 2 이상의 자연수) 개의 대화내역을 포함하는 제3프롬프트를 생성하는 제3프롬프트생성단계; 및 상기 제3프롬프트를 상기"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "자연어처리모델에 입력하여 얻은 N(N은 M 미만의 자연수)개의 요약대화정보에 기초하여 유저메모리정보를 생성"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "하는 유저메모리생성단계;를 더 포함하고, 상기 유저메모리정보는 상기 요약대화정보 및 상기 요약대화정보를"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "임베딩모델에 입력하여 벡터형태의 요약대화특징정보를 포함할 수 있다. 본 발명의 일 실시예에서는, 상기 캐릭터 영상통화 제공방법은, 상기 특징정보추출단계에서 도출된 벡터형태의 특징정보; 및 과거에 해당 캐릭터와 사용자가 나눈 대화내용이 저장된 기설정된 DB집합;에 대하여 유사도에 기 반한 검색알고리즘을 적용하여, 기설정된 기준을 충족하는 대화내용을 도출하면, 해당 대화내용에 기초하여 텍 스트출력정보를 생성하는 인스턴트답변생성단계;를 더 포함할 수 있다. 상기와 같은 과제를 해결하기 위하여, 본 발명의 일 실시예에서는, 1 이상의 메모리 및 1 이상의 프로세스를 포 함하고, 딥러닝 형태의 자연어처리모델을 이용한 캐릭터 영상통화 제공방법을 수행하는 컴퓨팅시스템으로서, 사 용자단말을 통해 입력된 오디오 형태의 오디오입력정보가 STT모델에 의하여 텍스트 형태로 변환된 텍스트입력정 보를 수신하는 대화입력부; 딥러닝 형태의 자연어처리모델에 입력할 제1프롬프트를 생성하되, 상기 제1프롬프트 는 텍스트입력정보, 및 대화히스토리를 포함하는 제1프롬프트생성부; 및 상기 제1프롬프트가 상기 자연어처리모 델에 입력되어 출력되는 텍스트출력정보를 수신하는 텍스트출력정보수신부;를 포함하고, 상기 텍스트출력정보는 TTS모델에 의하여 오디오 형태의 오디오출력정보로 변환되어 사용자단말에서 재생됨으로써, 사용자에게 해당 캐릭터의 음성을 전달하는, 컴퓨팅시스템을 제공한다. 상기와 같은 과제를 해결하기 위하여, 본 발명의 일 실시예에서는, 1 이상의 메모리 및 1 이상의 프로세서를 포 함하는 컴퓨팅시스템에서 수행되는, 딥러닝 형태의 자연어처리모델을 이용한 캐릭터 영상통화 제공방법을 구현 하기 위한 컴퓨터-판독가능 기록매체로서, 상기 컴퓨터-판독가능 기록매체는, 상기 컴퓨팅시스템으로 하여금 이 하의 단계들을 수행하도록 하는 명령들을 저장하며, 상기 이하의 단계들은: 사용자단말을 통해 입력된 오디오 형태의 오디오입력정보가 STT모델에 의하여 텍스트 형태로 변환된 텍스트입력정보를 수신하는 대화입력단계; 딥 러닝 형태의 자연어처리모델에 입력할 제1프롬프트를 생성하되, 상기 제1프롬프트는 텍스트입력정보, 및 대화히 스토리를 포함하는 제1프롬프트생성단계; 및 상기 제1프롬프트가 상기 자연어처리모델에 입력되어 출력되는 텍 스트출력정보를 수신하는 텍스트출력정보수신단계;를 포함하고, 상기 텍스트출력정보는 TTS모델에 의하여 오디 오 형태의 오디오출력정보로 변환되어 사용자단말에서 재생됨으로써, 사용자에게 해당 캐릭터의 음성을 전달하 는, 컴퓨터-판독가능 기록매체를 제공한다."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 실제 화상통화와 유사한 UI를 제공함으로써, 사용자가 좋아하는 캐릭터 혹은 등 장인물과 실제로 화상통화하는 경험을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 캐릭터가 등장하는 작품에 대한 정보를 비롯하여, 해당 캐릭터 및 주변 캐릭터 와의 관계 등에 대한 정보를 프롬프트에 포함시킴으로써, 실제 작품 속 캐릭터와 대화하는 듯한 경험을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 별도의 레슨정보를 입력함으로써, 자연스럽게 사용자가 해당 레슨정보에 포함된 내용을 받아들이는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 사용자가 캐릭터와 나눈 대화를 사용자의 보호자가 볼 수 있어 사용자의 진솔한 마음을 파악할 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 생성형 AI 언어모델을 사용함으로써, 사용자의 질문 혹은 발화에 대해 자연스러 운 답변을 제공하는 효과를 발휘할 수 있다."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 다양한 실시예들 및/또는 양상들이 이제 도면들을 참조하여 개시된다. 하기 설명에서는 설명을 목 적으로, 하나 이상의 양상들의 전반적 이해를 돕기 위해 다수의 구체적인 세부사항들이 개시된다. 그러나, 이러 한 양상(들)은 이러한 구체적인 세부사항들 없이도 실행될 수 있다는 점 또한 본 발명의 기술 분야에서 통상의 지식을 가진 자에게 인식될 수 있을 것이다. 이후의 기재 및 첨부된 도면들은 하나 이상의 양상들의 특정한 예 시적인 양상들을 상세하게 기술한다. 하지만, 이러한 양상들은 예시적인 것이고 다양한 양상들의 원리들에서의 다양한 방법들 중 일부가 이용될 수 있으며, 기술되는 설명들은 그러한 양상들 및 그들의 균등물들을 모두 포함 하고자 하는 의도이다. 또한, 다양한 양상들 및 특징들이 다수의 디바이스들, 컴포넌트들 및/또는 모듈들 등을 포함할 수 있는 시스템 에 의하여 제시될 것이다. 다양한 시스템들이, 추가적인 장치들, 컴포넌트들 및/또는 모듈들 등을 포함할 수 있 다는 점 그리고/또는 도면들과 관련하여 논의된 장치들, 컴포넌트들, 모듈들 등 전부를 포함하지 않을 수도 있 다는 점 또한 이해되고 인식되어야 한다. 본 명세서에서 사용되는 \"실시예\", \"예\", \"양상\", \"예시\" 등은 기술되는 임의의 양상 또는 설계가 다른 양상 또 는 설계들보다 양호하다거나, 이점이 있는 것으로 해석되지 않을 수도 있다. 아래에서 사용되는 용어들 '~부', '컴포넌트', '모듈', '시스템', '인터페이스' 등은 일반적으로 컴퓨터 관련 엔티티(computer-related entity)를 의미하며, 예를 들어, 하드웨어, 하드웨어와 소프트웨어의 조합, 소프트웨어를 의미할 수 있다. 또한, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 해당 특징 및/또는 구성요소가 존재함을 의미하지만, 하나 이상의 다른 특징, 구성요소 및/또는 이들의 그룹의 존재 또는 추가를 배제하지 않는 것으로 이해되어야 한다. 또한, 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구 성요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구 별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요 소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 또한, 본 발명의 실시예들에서, 별도로 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기 서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되 는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술 의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 실시예에서 명백하게 정 의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 또한, 이하에서 언급되는 \"사용자단말\"는 별도의 언급이 없는 한, 네트워크를 통해 서버나 타 단말에 접속할 수 있는 컴퓨터나 휴대용 단말기, 혹은 태블릿 PC(tablet PC) 등으로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop) 등을 포함하고, 휴대용 단 말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신장치로서, 스마트폰, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말 및 클라이언트의 생체정보를 수집할 수 있는 웨어러블 디바이스(Wearable Device) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 도 1은 본 발명의 일 실시예에 따른 자연어처리모델을 이용한 캐릭터 영상통화 제공방법을 수행하는 컴퓨팅시스 템의 구성을 개략적으로 도시한다.도 1에 도시된 바와 같이, 1 이상의 메모리 및 1 이상의 프로세스를 포함하고, 딥러닝 형태의 자연어처리모델을 이용한 캐릭터 영상통화 제공방법을 수행하는 컴퓨팅시스템으로서, 사용자단말을 통해 입력된 오디 오 형태의 오디오입력정보가 STT모델에 의하여 텍스트 형태로 변환된 텍스트입력정보를 수신하는 대화입력부 ; 딥러닝 형태의 자연어처리모델에 입력할 제1프롬프트를 생성하되, 상기 제1프롬프트는 텍스트입력정보, 대화히스토리, 및 전처리정보를 포함하는 제1프롬프트생성부; 및 상기 제1프롬프트가 상기 자연어처리모 델에 입력되어 출력되는 텍스트출력정보를 수신하는 텍스트출력정보수신부;를 포함하고, 상기 텍스트출력 정보는 TTS모델에 의하여 오디오 형태의 오디오출력정보로 변환되어 사용자단말에서 재생됨으로써, 사용 자에게 해당 캐릭터의 음성을 전달하고, 상기 제1프롬프트생성부는, 상기 텍스트입력정보를 포함하는 정 보를 임베딩모델에 입력하여 벡터형태의 특징정보를 추출하는 특징정보추출부; 및 해당 캐릭터가 출현하 는 작품과 관련된 작품정보를 포함하는 데이터베이스에 대하여, 유사도에 기반한 검색알고리즘을 사용하 여 상기 특징정보와 유사한 유사정보를 도출하는 유사정보도출부;를 포함하고, 상기 전처리정보는 상기 유사정보를 포함한다. 구체적으로, 본 발명의 컴퓨팅시스템은, 도 1에 도시된 바와 같이, 사용자단말과 통신하여 캐릭터 영상통화 제공방법을 수행하고, 사용자는 상기 사용자단말에 디스플레이되는 UI, 애니메이션, 혹은 영상 등을 통해 실제 애니메이션과 같은 작품 속에서 등장하는 캐릭터와 실시간으로 영상통화를 하는 듯한 경험을 제 공받을 수 있다. 본 발명의 일 실시예로서, 이하에서는 상기 작품을 애니메이션으로 가정하여 설명하나, 이에 한정하지 않고, 영화, 드라마, 만화, 게임, 소설 등 다양한 장르의 작품도 본 발명에 적용될 수 있다. 또한, 이 하에서 서술되는 캐릭터는 상기 작품에 출현하는 등장인물, 혹은 등장캐릭터를 포함하는 개념에 해당한다. 더 구체적으로, 사용자가 사용자단말에 저장된 어플리케이션을 실행하면, 사용자와 영상통화를 할 수 있 는 복수의 친구목록, 즉 복수의 캐릭터목록이 사용자단말에 디스플레이되며, 사용자는 상기 목록 중 어느 하나의 캐릭터를 선택하여 해당 캐릭터와 영상통화를 수행할 수 있다. 다시 말해, 특정 캐릭터와 영상통화를 수 행할 수 있는 아이콘을 선택하면, 해당 캐릭터와 영상통화를 하는 듯한 인터페이스가 사용자단말에 표시 된다. 상기 인터페이스에는, 상기 사용자단말에 구비된 카메라를 통해 촬영되는 영상과 해당 캐릭터의 영 상을 표시하는 레이어가 포함되며, 상기 인터페이스의 조작을 통해 상기 사용자의 발화내용을 입력할 수 있다. 이 때, 사용자의 발화내용은 상기 사용자단말에 구비된 마이크를 통해 입력된다. 사용자단말을 통해 입력된 오디오 형태의 오디오입력정보는 STT(Speech To Text)모델에 의하여 텍스트 형 태의 텍스트입력정보로 변환되고, 대화입력부에 의하여, 상기 텍스트입력정보를 수신하는 대화입력단계가 수행된다. 상기 STT모델은, 본 발명의 일 실시예로서, 상기 사용자단말에 포함될 수 있으며, 본 발명의 다른 실시예로서, 본 발명의 컴퓨팅시스템에 포함될 수 있고, 본 발명의 또 다른 실시예로서, 상기 사용 자단말 혹은 상기 컴퓨팅시스템이 아닌 외부에 구비되는 서버 등에 포함될 수 있다. 상기 대화입력부에 의하여 상기 텍스트입력정보가 수신되면, 제1프롬프트생성부에 의하여, 제1프롬 프트를 생성하는 제1프롬프트생성단계가 수행된다. 상기 제1프롬프트는 본 발명에서 사용되는 딥러닝 형태의 자 연어처리모델(Natural Language Processing Model)에 입력되는 프롬프트(prompt)로서, 상기 텍스트입력정보를 포함한다. 바람직한 실시예로서 상기 자연어처리모델은 거대언어모델(Large Language Model, LLM)에 해당할 수 있으며, 이하에서는 본 발명의 자연어처리모델을 거대언어모델로 가정하여 서술하도록 한다. 다만, 이는 일 실 시예일 뿐이며, 다양한 형태의 자연어처리모델이 사용될 수 있다. 더 구체적으로, 상기 제1프롬프트는 상기 텍스트입력정보, 대화히스토리, 및 전처리정보를 포함한다. 상기 대화 히스토리는, 사용자가 영상통화를 하는 대상에 해당하는 캐릭터와 상기 사용자가 해당 영상통화에서 주고받은 대화이력을 포함한다. 즉, 사용자와 해당 캐릭터가 어플리케이션을 영상통화를 시작할 때는 대화히스토리가 존 재하지 않지만 영상통화를 수행해 나가게 되면, 사용자와 캐릭터가 주고받은 대화 내용들이 상기 대화히스토리 로서 저장된다. 상기 전처리정보는, 상기 캐릭터와 관련된 정보 및 상기 캐릭터가 출현하는 작품과 관련된 정보 등이 포함되며, 상기 전처리정보에 대한 구체적인 설명은 도 3에 대한 설명에서 후술하도록 한다.상기 제1프롬프트생성단계는 텍스트입력정보의 특징정보를 추출하는 특징정보추출단계; 및 상기 특징정보와 유 사한 유사정보를 데이터베이스에서 도출하는 유사정보도출단계;를 포함한다. 본 발명의 일 실시예로서, 상기 데이터베이스는, 도 1에 도시된 바와 같이, 상기 컴퓨팅시스템 내부에 구비될 수 있으나, 본 발명의 다른 실시예로서, 상기 데이터베이스는 상기 컴퓨팅시스템 외부에 구비되어 상기 컴퓨팅시 스템과 직접적 혹은 간접적으로 통신할 수 있다. 상기 특징정보추출단계 및 상기 유사정보도출단계에 대 한 구체적인 설명은 이하에서 후술하도록 한다. 상기 제1프롬프트생성부에 의하여 제1프롬프트가 생성되면, 상기 컴퓨팅시스템은 상기 제1프롬프트 를 상기 거대언어모델에 입력하고, 텍스트출력정보수신부는 상기 거대언어모델에서 출력되는 텍스트출력 정보를 수신하는 텍스트출력정보수신단계를 수행한다. 이 때, 상기 텍스트출력정보는 텍스트 형태의 데이터이다. 상기 텍스트출력정보는 TTS(Text To Speech)모델에 의하여 오디오 형태의 오디오출력정보로 변환되 고, 상기 사용자단말에 구비된 스피커 등을 통해 상기 오디오출력정보가 출력된다. 상기 오디오출력정보 는 해당 캐릭터의 음성, 어투, 억양 등이 반영되어 출력되며, 이를 통해 사용자에게 실제 캐릭터와 대화하는 경 험을 제공할 수 있다. 상기 TTS모델은, 본 발명의 일 실시예로서, 상기 사용자단말에 포함될 수 있으며, 본 발명의 다른 실시예 로서, 본 발명의 컴퓨팅시스템에 포함될 수 있고, 본 발명의 또 다른 실시예로서, 상기 사용자단말 혹은 상기 컴퓨팅시스템이 아닌 외부에 구비되는 서버 등에 포함될 수 있다. 즉, 상기 텍스트출력정보가 상기 TTS모델에 입력되면 상기 TTS모델은 오디오출력정보를 출력하고, 출력된 상기 오디오출력정보가 사용자단 말로 전달되어 캐릭터의 음성을 사용자에게 전달할 수 있다. 또한, 상기 거대언어모델은, 본 발명의 일 실시예로서, 본 발명의 컴퓨팅시스템에 포함될 수 있고, 본 발 명의 다른 실시예로서, 상기 컴퓨팅시스템이 아닌 외부에 구비되는 서버 등에 포함될 수 있다. 도 2는 본 발명의 일 실시예에 따른 대화입력단계의 수행과정을 개략적으로 도시한다. 개략적으로, 도 2는 대화입력단계가 수행될 때 사용자단말에 디스플레이되는 인터페이스 및 STT모델에서 수행되는 과정을 도시한다. 구체적으로, 도 2에 도시된 바와 같이, 사용자와 캐릭터가 영상통화를 하는 인터페이스에는 캐릭터의 영상이 표 시되는 레이어(사용자단말 중앙부에 디스플레이)와 사용자단말을 통해 촬영되는 영상이 표시되는 레이어(사용자단말의 좌측하단에 디스플레이)가 포함된다. 사용자가 마이크 형상의 아이콘을 선택입력한 후 발화하면, 발화한 내용과 상응하는 오디오입력정보가 상기 사용자단말의 마이크를 통해 입력되고, 입 력된 오디오입력정보는 STT모델로 전달된다. 본 발명의 일 실시예에 따르면, 상기 STT모델이 상기 오디오입력정보를 텍스트입력정보로 변환하여 사용자단말 로 전달할 때, 상기 인터페이스에 상기 텍스트입력정보가 표시될 수 있으며, 바람직하게는, 사용자가 발 화할 때, 녹음이 되고 있다는 애니메이션 효과가 상기 인터페이스에 표시될 수 있다. 사용자의 발화가 종료되면, 사용자는 메시지를 보낼 수 있는 기능을 수행할 수 있는 아이콘을 선택입력할 수 있고, 사용자단말 이 해당 아이콘에 대한 선택입력을 수신하면 상기 텍스트입력정보는 상기 대화입력부를 통해 상기 컴퓨팅시스템으로 전달된다. 이 때, 사용자단말에는 메시지가 전송되고 있다는 것을 사용자에게 알 려줄 수 있는 그래픽이 표시되는 것이 바람직하다. 도 3은 본 발명의 일 실시예에 따른 제1프롬프트에 포함되는 정보를 개략적으로 도시하고, 도 4는 본 발명의 일 실시예에 따른 사용자정보 및 레슨정보가 입력되는 인터페이스를 개략적으로 도시한다. 도 3에 도시된 바와 같이, 전처리정보는 작품정보를 포함하고, 상기 작품정보는, 상기 작품의 회차별정보; 해당 작품의 세계관정보; 해당 작품에서의 캐릭터정보; 과거에 해당 캐릭터와 사용자가 나눈 대화내용으로부터 도출 된 유저메모리정보; 및 해당 작품에서 상기 캐릭터의 주변캐릭터에 대한 서브캐릭터정보;를 포함한다. 또한, 도 4에 도시된 바와 같이, 상기 제1프롬프트생성단계는, 기저장된 사용자정보입력단계; 및 기저장된 레슨 정보를 입력받는 레슨정보입력단계;를 더 포함하고, 상기 제1프롬프트는 상기 사용자정보 및 상기 레슨정보를 더 포함한다. 구체적으로, 전술한 바와 상기 제1프롬프트는 텍스트출력정보, 대화히스토리, 및 전처리정보를 포함하며, 사용 자정보입력단계 및 레슨정보입력단계를 통해 수신한 사용자정보와 레슨정보를 더 포함할 수 있다. 더 구체적으로, 도 4에 도시된 바와 같이, 사용자는 사용자단말을 통해 사용자정보와 레슨정보를 입력할 수 있다. 도 4는 상기 사용자정보 및 상기 레슨정보를 입력할 수 있는 인터페이스를 개략적으로 도시한다. 사용 자정보를 입력하는 인터페이스(도 4의 좌측)에는, 본 발명의 일 실시예로서, 사용자의 기본정보 및 사용자의 상 세정보를 입력할 수 있다. 상기 기본정보는 사용자의 이름 및 생년월일 등에 대한 정보를 포함하고, 상기 상세 정보는, 사용자의 특징, 예를 들어, 사용자가 좋아하거나, 싫어하는 것 등에 대한 정보를 포함한다. 상기 상세 정보는, 도 4에 도시된 바와 같이, 서술형으로 사용자가 직접 기입할 수 있으나, 본 발명의 다른 실시예에서는, 기 분류된 복수의 선택지 중 사용자가 선택하는 방식으로 설정될 수 있다. 레슨정보를 입력하는 인터페이스(도 4의 우측)에는, 본 발명의 일 실시예로서, 캐릭터가 아이에게 해줬으면 하 는 내용 등을 포함하는 레슨정보를 입력할 수 있다. 예를 들어, 레슨정보로 '양치를 잘하자'가 설정되면, 캐릭 터가 '나는 양치를 제대로 안 했더니 이빨이 썩어서 치과에 갔는데 치료받는게 너무 아프고 무서웠어. 길동이는 양치를 잘해서 치과에 안 가도록 해'와 같은 말을 사용자에게 함으로써, 사용자가 배워야 할 교훈 혹은 생활 지 침 등을 자연스럽게 교육시킬 수 있는 효과를 발휘할 수 있다. 특히, 캐릭터는 상기 사용자정보와 레슨정보를 같이 결합하여, '치과에 같더니 길동이와 같은 5살 친구들이 많이 보였어. 길동이도 양치를 제대로 안 하면 치 과에 갈 거 같아'와 같은 말을 사용자에게 할 수 있다. 또한, 본 발명의 거대언어모델은 이하에서 후술하는 전 처리정보와 상기 사용자정보 및 레슨정보를 모두 고려한 텍스트출력정보를 출력함으로써, 현실적인 답변을 사용 자에게 제공할 수 있다. 전술한 바와 같이, 상기 제1프롬프트는, 캐릭터를 통해 출력되는 말의 기반이 될 수 있는 정보들을 포함한다. 상기 제1프롬프트에 포함되는 전처리정보는, 상기 작품의 회차별정보; 해당 작품의 세계관정보; 해당 작품에서 의 캐릭터정보; 과거에 해당 캐릭터와 사용자가 나눈 대화내용으로부터 도출된 유저메모리정보; 및 해당 작품에 서 상기 캐릭터의 주변캐릭터에 대한 서브캐릭터정보;를 포함한다. 더 구체적으로, 상기 데이터베이스에 기 저장된 작품정보에 대하여 전처리과정이 수행된 이후 도출되는 전처리정보가 상기 제1프롬프트에 포함된다. 즉, 상기 데이터베이스에 저장된 회차별정보, 세계관정보, 캐릭터정보, 서브캐릭터정보, 사용자정보, 및 유저메모리정보 중 일부 정보가 추출되어 상기 전처리정보로서 상 기 제1프롬프트에 포함된다. 상기 회차별정보는, 해당 작품의 회차별 정보로서, 도 7A를 참고하면, 해당 작품의 1화, 2화, 3화, ... 등 각각 에서의 내용에 대한 정보가 포함된다. 예를 들어, 2화에 운동회와 관련된 내용이 저장되어 있고, 해당 작품정보 가 포함된 제1프롬프트가 거대언어모델에 입력되면, 상기 거대언어모델은, '지난 번 운동회 때 크롱이가 다쳤는 데...'와 같은 텍스트출력정보를 출력할 수 있다. 상기 세계관정보는, 해당 작품의 세계관에 대한 정보, 다시 말해, 작품에 대한 배경정보가 포함된다. 예를 들어, '뽀로로가 사는 마을은 눈에 덮혀있다'등의 정보가 포함될 수 있다. 상기 캐릭터정보는 해당 캐릭터에 대 한 정보가 포함된다. 예를 들어, 뽀로로에 대한 성별, 생일, 성격, 경험 등에 대한 정보가 상기 캐릭터정보로서 포함될 수 있다. 상기 서브캐릭터정보는, 상기 작품에 나오되, 사용자가 선택한 캐릭터가 아닌 다른 캐릭터, 즉 주변 인물들에 대한 성별, 생일, 성격, 경험 등에 대한 정보를 포함한다. 상기 사용자정보는 전술한 사용자정보 입력단계를 통해 입력된 정보에 해당한다. 상기 유저메모리정보는, 사용자와 캐릭터가 대화했던 대화이력에 대한 정보를 포함한다. 더 구체적으로, 전술한 대화히스토리는 사용자와 캐릭터가 현재 영상통화에서 통화를 시작했던 시점부터 끝날 때까지 주고 받은 모든"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "대화이력에 해당하는 정보이며, 상기 유저메모리정보는, 과거에 진행되었던 영상통화에서 사용자와 캐릭터가 주고받았던 대화이력의 요약된 정보를 포함한다. 본 발명의 일 실시예로서, 사용자의 보호자는 상기 대화히스토리 혹은 상기 유저메모리정보를 열람할 수 있고, 이를 통해 사용자의 속마음을 알 수 있다. 예를 들어, 사용자가 엄마에게 꾸중을 들은 사실과 그 때의 감정을 캐릭터와 얘기한 경우, 사용자의 보호자는 이 때의 대화이력을 열람하여 사용자의 속마음을 알 수 있는 효과를 발휘할 수 있다. 정리하면, 사용자와 영상통화하는 캐릭터와 관련된 정보는 모두 데이터베이스에 저장되어 있고, 해당 데 이터베이스에 대하여 전처리단계를 수행하여 전처리정보가 도출되고, 상기 제1프롬프트생성부는 도 출된 전처리정보를 제1프롬프트에 포함시켜 제1프롬프트를 생성한다. 상기 전처리단계는 데이터베이스에 포함되는 복수의 정보 중 사용자에 의해 입력된 텍스트입력정보와 유사한 정보를 추출하는 과정을 포함한다. 도 5는 본 발명의 일 실시예에 따른 텍스트출력정보수신단계의 수행과정을 개략적으로 도시한다. 도 5에 도시된 바와 같이, 상기 제1프롬프트가 상기 거대언어모델에 입력되면, 상기 거대언어모델은 텍스트출력 정보를 출력한다. 상기 텍스트출력정보수신부는 출력된 텍스트출력정보를 수신하는 텍스트출력정보수신단 계를 수행한 뒤, 상기 출력된 텍스트출력정보를 TTS모델로 전달하고, 상기 TTS모델은 상기 텍스트출력정보를 오 디오 형태의 오디오출력정보로 변환한다. 전술한 바와 같이, 상기 거대언어모델은 딥러닝 형태의 자연어처리모 델의 바람직한 실시예에 해당한다. 도 6은 본 발명의 일 실시예에 따른 제1프롬프트생성단계의 수행과정을 개략적으로 도시한다. 도 6에 도시된 바와 같이, 상기 제1프롬프트생성단계는, 상기 텍스트입력정보를 포함하는 정보를 임베딩모델에 입력하여 벡터형태의 특징정보를 추출하는 특징정보추출단계; 및 해당 캐릭터가 출현하는 작품과 관련된 작품정 보를 포함하는 데이터베이스에 대하여, 유사도에 기반한 검색알고리즘을 사용하여 상기 특징정보와 유사 한 유사정보를 도출하는 유사정보도출단계;를 포함한다. 개략적으로, 상기 특징정보추출단계 및 상기 유사정보도출단계는 상기 전처리단계에 포함된다. 구체적으로, 상기 대화입력단계를 통해 텍스트입력정보를 수신하면, 특징정보추출부에 의하여 특징정보추 출단계가 수행된다. 더 구체적으로, 상기 특징정보추출단계는 상기 텍스트입력정보를 포함하는 정보로부터 특징 정보를 추출하는 단계로, 상기 특징 정보는 벡터 형태이며, 임베딩모델에 상기 텍스트입력정보를 포함하는 정보 를 입력함으로써 수행된다. 상기 임베딩모델은 상기 컴퓨팅시스템에 포함되는 것이 바람직하며, 공지의 기술을 통해 설계 및 구현될 수 있다. 출력된 특징정보에 기초하여, 유사정보도출부는, 상기 데이터베이스에 포함된 복수의 정보들 중 유 사정보를 도출한다. 이 때, 유사도에 기반한 검색알고리즘(Similar Search Algorithm, SAA)을 사용하여 유사정 보를 도출할 수 있다. 상기 유사정보는, 도 3에 대한 설명을 참고하여, 회차별정보, 세계관정보, 캐릭터정보, 서브캐릭터정보, 및 유저메모리정보 등을 포함한다. 예를 들어, 텍스트입력정보로 '너는 좋아하는 것이 뭐야?'라는 정보가 입력되면, 상기 유사도에 기반한 검색알 고리즘(SAA)을 이용해서, 상기 '너는 좋아하는 것이 뭐야?'와 관련된 정보를 데이터베이스에서 검색하고, 이와 관련된 유사정보를 도출한다. 상기 유사정보의 예로서, 회차별정보로는 '6화:뽀로로가 받은 최고의 선물' 등이 될 수 있고, 캐릭터정보로는 '뽀로로는 딸기 아이스크림을 좋아한다' 등이 될 수 있으며, 유저메모리정보 로는 '예전에 뽀로로는 야구를 좋아한다고 대답했었다' 등이 될 수 있다. 즉, 전술한 과정을 통해, 상기 제1프롬프트생성단계에서는 텍스트입력정보와 유사한 유사정보를 도출할 수 있으 며, 상기 유사정보가 포함되는 전처리정보를 제1프롬프트에 포함되어 제1프롬프트가 생성될 수 있다. 전술한 특 징정보추출단계 및 유사정보도출단계에 대한 추가적인 설명을 도 7 내지 도 9에 대한 설명에서 후술하도록 한다. 도 7은 본 발명의 일 실시예에 따른 작품정보에 포함되는 항목별 정보들을 개략적으로 도시하고, 도 8은 본 발 명의 일 실시예에 따른 유사정보가 결정되는 과정을 개략적으로 도시하며, 도 9는 본 발명의 일 실시예에 따른 유사정보도출단계의 수행과정을 개략적으로 도시한다. 구체적으로, 도 7A 및 도 7B는 데이터베이스에 저장되는 작품정보의 일 실시예를 개략적으로 도시한다. 도 7A 및 도 7B에 도시된 바와 같이, 작품정보 각각은 벡터형태로 저장되며, 본 발명의 일 실시예에 따르면, 클 래스별로 구분되어 저장되는 것이 바람직하다. 여기서 클래스는, 작품정보가 유저메모리정보인지, 회차별정보인 지 등 어떤 종류의 작품정보인지를 구분하는 항목을 의미한다. 이러한 작품정보는 사용자가 영상통화를 시작하 기 전에 데이터베이스에 기 저장되는 것이 바람직하다. 한편, 도 7A 및 도 7B는 설명의 편의를 위하여 작 품정보의 내용을 개략적으로 도시한 것이며, 실제 발명에서 작품정보는 도 7A 및 도 7B에 도시된 구성으로 한정 되지 않는다. 이후, 도 8에 도시된 바와 같이, '야구는 어때?'라는 텍스트입력정보를 수신하면, 임베딩모델을 통해 상기 텍스 트입력정보의 특징정보를 도출한다. 이후, 도 6에 대한 설명을 참고하여, 상기 유사도에 기반한 검색알고리즘 (SAA)을 사용하여 도출된 특징정보와 유사한 작품정보, 즉 유사정보를 도출한다. 도 8에 도시된 유사정보는 클 래스 구분없이 도시하였으나, 클래스별로 유사정보를 도출하는 것이 바람직하다. 다시 말해, 유사메모리정보클래스에서 소정의 유사정보를 도출하고, 회차별정보에서 소정의 유사정보를 도출하 는 등 모든 클래스에서 소정의 유사정보를 도출하는 것이 바람직하다. 예를 들어, 도 8에서, '뽀로로는 야구와 농구를 좋아한다' 및 '뽀로로는 그림대회에 나간 적이 있다'는 유저메모리정보클래스 포함되는 유사정보일 수 있고, '루피는 야구를 좋아하지 않는다'는 서브캐릭터정보 클래스에 포함되는 유사정보일 수 있다. 또한, 본 발명의 일 실시예로서, 어느 클래스에서 유사정보로 도출되는 기준을 충족하는 정보가 없는 경우, 해 당 클래스에서는 유사정보가 도출되지 않을 수 있다. 도 9에 대한 설명에서는 유사정보도출단계에 대해 더 구체 적으로 서술하도록 한다. 도 9에 도시된 바와 같이, 상기 유사정보도출단계는 상기 작품정보의 각각의 항목별 매칭율을 도출하고, 상기 제1프롬프트생성단계는 도출된 매칭율 및 기설정된 규칙에 기초하여 전처리정보를 결정한다. 구체적으로, 전술한 바와 같이, 상기 유사정보도출단계는 클래스별로 소정의 유사정보를 도출하는 것이 바람직 하다. 본 발명의 일 실시예로서, 매칭율은 데이터베이스에 저장된 정보들의 벡터와 텍스트입력정보의 특 징벡터를 비교하여 도출될 수 있으며, 코사인유사도를 도출하는 방법 등과 같은 공지의 유사도 도출기술을 사용 하여 도출될 수 있다. 즉, 데이터베이스의 유저메모리정보 클래스에 저장된 복수의 정보 각각과 특징정보 사이의 매칭율을 도출하고, 그 중 기설정된 규칙을 만족하는 정보를 유사정보로 결정할 수 있다. 상기 기설정된 규칙의 예로는 65% 이상의 매칭율이 도출되는 정보 중 상위 3개의 정보 등이 있을 수 있으며, 이는 발명자의 의 도에 따라 얼마든지 변경 가능한 구성에 해당한다. 또한, 특정 클래스에서 상기 기설정된 규칙을 만족하는 정보가 없는 경우, 해당 클래스에서는 유사정보를 도출 하지 않을 수 있다. 이와 같은 과정을 통해 도출된 유사정보를 포함하는 전처리정보에 기초하여 제1프롬프트를 생성함으로써, 실제 캐릭터가 자신을 기준으로 사용자와 대화를 할 수 있다. 즉, 단순 대화히스토리만을 가지고 답변을 생성하는 종래의 챗봇과 달리 캐릭터가 작품 속에서 경험했던 내용에 기반하여 답변을 생성하는 것을 기술적 특징으로 하며, 작품 속에서 경험했던 내용은, 대화 히스토리에는 없지 만 해당 작품을 시청한 사용자가 알고 있는 경험에 해당하므로, 종래의 챗봇기술보다 뛰어난 친밀감과 리얼리티 를 사용자에게 제공하는 효과를 발휘할 수 있다. 또한, 이러한 구성을 통해 전술한 레슨정보를 사용자에게 보다 효과적으로 제공할 수 있다는 효과를 발휘할 수 있다. 도 10은 본 발명의 일 실시예에 따른 제2프롬프트가 생성되고, 감정출력정보가 도출되는 과정을 개략적으로 도 시한다. 도 10에 도시된 바와 같이, 상기 캐릭터 영상통화 제공방법은, 상기 텍스트출력정보를 상기 텍스트출력정보로부 터 도출될 수 있는 텍스트 형태의 감정정보로 변환하고, 상기 텍스트감정정보를 포함하는 제2프롬프트를 상기 거대언어모델에 입력하는 제2프롬프트생성단계를 더 포함하고, 상기 거대언어모델은 상기 제2프롬프트를 입력받 아 감정출력정보를 출력하고, 상기 TTS모델은 상기 감정출력정보를 입력받아 캐릭터감정정보를 출력하고, 상기 캐릭터감정정보는 상기 오디오출력정보와 결합되어 상기 사용자단말로 전달된다. 구체적으로, 거대언어모델에서 텍스트출력정보가 출력되면, 상기 컴퓨팅시스템은 상기 텍스트출력정보를 텍스트감정정보로 변환한다. 상기 텍스트감정정보는 텍스트 형태이며, 감정을 나타내는 정보를 의미한다. 예를 들어, '좋아!'라는 텍스트출력정보는 '행복'이라는 감정정보로 변환될 수 있다. 본 발명의 일 실시예로서, 상기 변환과정은 Text To Emotion 모델 등을 통해 수행될 수 있고, 본 발명의 다른 실시예로서, 상기 거대언어모델에 서 생성된 텍스트출력정보에 포함되는 감정정보를 추출함으로써 수행될 수 있다. 이러한 텍스트감정정보를 포함하는 제2프롬프트가 제2프롬프트생성부(미도시)에 의하여 생성되는 제2프롬프트생 성단계가 수행되며, 상기 제2프롬프트생성부는 상기 제2프롬프트를 상기 거대언어모델에 입력한다. 상기 제2프 롬프트가 입력된 거대언어모델은 감정출력정보를 출력하며, 상기 감정출력정보는 텍스트 형태의 정보에 해당한 다. 한편, 본 발명의 또 다른 실시예로서, 상기 텍스트감정정보는 상기 거대언어모델 없이 도출될 수 있다. 다시 말 해, 텍스트출력정보 없이 텍스트입력정보로부터 텍스트감정정보를 도출하거나 변환할 수 있다. 도 11은 본 발명의 일 실시예에 따른 사용자단말이 오디오출력정보 및 영상출력정보를 수신하는 과정을 개략적으로 도시한다. 도 11에 도시된 바와 같이, 상기 오디오출력정보는 영상출력정보와 함께 사용자단말로 전달되고, 상기 영 상출력정보는 기저장된 복수의 감정표현 중 상기 감정출력정보에 기초하여 결정되는 감정표현정보를 포함하고, 상기 감정표현정보는 해당 캐릭터를 통해 시각적으로 표시되는 감정표현에 대한 정보로서, 해당 캐릭터는 상기 오디오출력정보가 상기 사용자단말에서 출력되기 전에 상기 감정표현을 표시한다. 구체적으로, 사용자단말은 캐릭터를 디스플레이하면서 사용자의 발화에 대한 대답을 출력하며, 상기 캐릭 터는 출력되는 오디오출력정보에 맞는 행동과 감정표현을 표시한다. 또한, 상기 오디오출력정보는 해당 오디오 출력정보에 맞는 어투, 억양, 혹은 추임새 등과 함께 출력될 수 있다. 더 구체적으로, 본 발명의 캐릭터는'좋아!'라는 오디오출력정보를 무미건조하게 말하는 것이 아니라, 신나는 어 투로 상기 오디오출력정보를 말할 수 있으며, 본 발명의 일 실시예로서, '야호!'라는 추임새 등과 함께 상기 오 디오출력정보를 말할 수 있다. 이러한 어투, 억양, 혹은 추임새 등과 같이 간접적으로 감정을 표현할 수 있는 정보는 캐릭터감정정보에 포함되며, 상기 캐릭터감정정보는 감정출력정보에 기초하여 생성되며, 상기 TTS모델에 서 출력된다. 즉, 상기 TTS모델은 텍스트출력정보와 감정출력정보를 입력받아 오디오출력정보와 캐릭터감정정보를 출력하되, 상기 오디오출력정보와 상기 캐릭터감정정보가 결합된 형태로 출력한다. 결합된 오디오출력정보 및 캐릭터감정 정보는 사용자단말로 전달되어 사용자에게 제공된다. 한편, 상기 사용자단말에 디스플레이되는 캐릭터는 상기 오디오출력정보가 출력될 때 소정의 행동을 하거 나, 특정 표정을 지을 수 있다. 이처럼 행동, 혹은 표정 등과 같이 캐릭터의 움직임과 관련된 정보는 영상출력 정보에 포함된다. 상기 영상출력정보는 상기 컴퓨팅시스템에서 생성되며, 상기 오디오출력정보와 같이 사용자단말로 전달될 수 있고, 바람직하게는, 해당 캐릭터가 상기 오디오출력정보에 상응하는 말을 하기 전 에 상기 영상출력정보에 포함된 감정출력정보에 상응하는 감정표현을 표시할 수 있다. 감정표현을 음성보다 빠 르게 표시함으로써, 사용자가 느끼는 어색함을 최소화하고, 보다 실제 대화하는 듯한 경험을 사용자에게 제공하 는 효과를 발휘할 수 있다. 상기 감정출력정보는 기 저장된 복수의 감정표현 중 상기 감정출력정보에 기초하여 결정될 수 있다. 상기 기 저 장된 복수의 감정표현은 기쁨, 슬픔, 화남 등을 포함한다. 또한, 본 발명의 일 실시예에 따르면, 기쁨이라는 하 나의 감정표현에 대하여 복수의 서로 다른 행동, 움직임, 혹은 표정 등이 있을 수 있으며, 상기 영상출력정보도 상기 복수의 서로 다른 행동, 움직임, 혹은 표정 중 어느 하나가 무작위로 선택되어 상기 사용자단말로 전달될 수 있다. 도 12는 본 발명의 일 실시예에 따른 제3프롬프트생성단계 및 유저메모리생성단계의 수행과정을 개략적으로 도 시한다. 도 12에 도시된 바와 같이, 상기 캐릭터 영상통화 제공방법은, 상기 대화히스토리에 포함되는 M(M은 2 이상의 자연수) 개의 대화내역을 포함하는 제3프롬프트를 생성하는 제3프롬프트생성단계; 및 상기 제3프롬프트를 상기"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "거대언어모델에 입력하여 얻은 N(N은 M 미만의 자연수) 개의 요약대화정보에 기초하여 유저메모리정보를 생성하"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "는 유저메모리생성단계;를 더 포함하고, 상기 유저메모리정보는 상기 요약대화정보 및 상기 요약대화정보를 임"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "베딩모델에 입력하여 벡터형태의 요약대화특징정보를 포함한다. 구체적으로, 도 12에 도시된 Chat Pieces는 대화히스토리를 의미한다. 제3프롬프트생성부(미도시)는 상기 대화 히스토리에 포함되는 M 개의 대화내역에 기초하여 제3프롬프트를 생성하는 제3프롬프트생성단계를 수행한다. 상"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "기 M 개의 대화내역을 포함하는 제3프롬프트를 상기 거대언어모델에 입력하면, 상기 거대언어모델은 요약대화정"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "보를 출력한다. 상기 요약대화정보에는 상기 M 개의 대화내역이 N 개로 요약된 대화이력이 포함된다. 즉, 상기"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "요약대화정보는 상기 대화히스토리보다 작은 크기를 가지는 것이 타당한다."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "상기 요약대화정보가 출력되면, 유저메모리생성부(미도시)는 상기 요약대화정보에 기초하여 유저메모리를 생성"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "하는 유저메모리생성단계를 수행한다. 이 때, 상기 유저메모리정보는, 도 7A를 참고하여, 상기 요약대화정보와"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "상기 요약대화정보에 상응하는 요약대화특징정보를 포함한다. 상기 요약대화특징정보는 상기 임베딩모델에 의하 여 도출될 수 있다. 이와 같은 구성을 통해, 효율적으로 유저메모리정보를 관리할 수 있는 효과를 발휘할 수 있 다. 도 13은 본 발명의 일 실시예에 따른 인스턴트답변생성단계의 수행과정을 개략적으로 도시한다. 도 13에 도시된 바와 같이, 상기 캐릭터 영상통화 제공방법은, 상기 특징정보추출단계에서 도출된 벡터형태의 특징정보; 및 과거에 해당 캐릭터와 사용자가 나눈 대화내용이 저장된 기설정된 DB집합;에 대하여 유사도에 기 반한 검색알고리즘을 적용하여, 기설정된 기준을 충족하는 대화내용을 도출하면, 해당 대화내용에 기초하여 텍 스트출력정보를 생성하는 인스턴트답변생성단계;를 더 포함한다. 구체적으로, 본 발명에서 사용되는 거대언어모델이 상기 컴퓨팅시스템 외부의 있는 경우, 상기 거대언어 모델을 사용하는데 비용이 발생될 수 있다. 다시 말해, 도 13에 설명하는 본 발명의 구성은 이러한 비용 발생을 줄이기 위한 구성에 해당한다. 더 구체적으로, 텍스트입력정보가 입력되고 특징정보추출단계에 의하여 상기 텍스트입력정보의 특징정보가 추출 되면, 상기 유사도에 기반한 검색알고리즘을 통해 기설정된 DB집합에서 기설정된 기준을 충족하는 대화내용을 검색한다. 상기 기설정된 DB집합이란, 과거에 해당 캐릭터와 사용자가 나눈 대화내용이 저장된 집합을"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "의미하며, 본 발명의 일 실시예로서, 전술한 대화히스토리, 유저메모리정보, 혹은 요약대화정보 등이 상기 DB집합에 해당할 수 있으나, 본 발명의 다른 실시예에 따르면, 해당 구성을 위한 별도의 DB집합에 해당할 수 있다. 상기 DB집합은 상기 데이터베이스에 포함된다. 상기 유사도에 기반한 검색알고리즘은 상기 DB집합에서 상기 특징정보와 유사한 대화내용을 검색할 수 있다. 예 를 들어, '뽀로로는 언제가 제일 좋아?'라는 질문을 텍스트입력정보로 수신한 경우, 과거에 입력된 '너는 제일 행복할 때가 언제야?'라는 질문내용을 검색하여 찾아내고, 과거 해당 질문에 대한 대답으로 출력된 '나는 친구 들이랑 노는 것이 제일 좋아'라는 답변을 상기 DB집합에서 검색하여, 거대언어모델을 사용하지 않고, '나는 친 구들이랑 노는 것이 제일 좋아'라는 텍스트출력정보를 도출할 수 있다. 이와 같은 구성을 통해, 비용을 절약하 면서, 사용자의 질문에 빠르게 대답하는 효과를 발휘할 수 있다. 도 14는 본 발명의 일 실시예에 따른 컴퓨팅장치의 내부 구성을 개략적으로 도시한다. 상술한 도 1에 도시된 컴퓨팅시스템는 도 14에 도시된 컴퓨팅장치의 구성요소들을 포함할 수 있다. 도 14에 도시된 바와 같이, 컴퓨팅장치는 적어도 하나의 프로세서(processor), 메모리 (memory), 주변장치 인터페이스(peripheral interface), 입/출력 서브시스템(I/O subsystem), 전력 회로 및 통신 회로를 적어도 포함할 수 있다. 메모리는 일례로 고속 랜덤 액세스 메모리(high-speed random access memory), 자기 디스크, 에스램 (SRAM), 디램(DRAM), 롬(ROM), 플래시 메모리 또는 비휘발성 메모리를 포함할 수 있다. 메모리는 컴퓨팅 장치의 동작에 필요한 소프트웨어 모듈, 명령어 집합 또는 그 밖에 다양한 데이터를 포함할 수 있다. 이때, 프로세서나 주변장치 인터페이스 등의 다른 컴포넌트에서 메모리에 액세스하는 것 은 프로세서에 의해 제어될 수 있다. 주변장치 인터페이스는 컴퓨팅장치의 입력 및/또는 출력 주변장치를 프로세서 및 메모리 에 결합시킬 수 있다. 프로세서는 메모리에 저장된 소프트웨어 모듈 또는 명령어 집합을 실행하여 컴퓨팅장치를 위한 다양한 기능을 수행하고 데이터를 처리할 수 있다. 입/출력 서브시스템은 다양한 입/출력 주변장치들을 주변장치 인터페이스에 결합시킬 수 있다. 예를 들 어, 입/출력 서브시스템은 모니터나 키보드, 마우스, 프린터 또는 필요에 따라 터치스크린이나 센서 등의 주변 장치를 주변장치 인터페이스에 결합시키기 위한 컨트롤러를 포함할 수 있다. 다른 측면에 따르면, 입/출 력 주변장치들은 입/출력 서브시스템을 거치지 않고 주변장치 인터페이스에 결합될 수도 있다. 전력 회로는 단말기의 컴포넌트의 전부 또는 일부로 전력을 공급할 수 있다. 예를 들어 전력 회로 는 전력 관리 시스템, 배터리나 교류(AC) 등과 같은 하나 이상의 전원, 충전 시스템, 전력 실패 감지 회 로(power failure detection circuit), 전력 변환기나 인버터, 전력 상태 표시자 또는 전력 생성, 관리, 분배 를 위한 임의의 다른 컴포넌트들을 포함할 수 있다. 통신 회로는 적어도 하나의 외부 포트를 이용하여 다른 컴퓨팅장치와 통신을 가능하게 할 수 있다. 또는 상술한 바와 같이 필요에 따라 통신 회로는 RF 회로를 포함하여 전자기 신호(electromagnetic signal)라고도 알려진 RF 신호를 송수신함으로써, 다른 컴퓨팅장치와 통신을 가능하게 할 수도 있다. 이러한 도 14의 실시예는, 컴퓨팅장치의 일례일 뿐이고, 컴퓨팅장치는 도 14에 도시된 일부 컴포 넌트가 생략되거나, 도 14에 도시되지 않은 추가의 컴포넌트를 더 구비하거나, 2개 이상의 컴포넌트를 결합시키 는 구성 또는 배치를 가질 수 있다. 예를 들어, 모바일 환경의 통신 단말을 위한 컴퓨팅장치는 도 14에 도시된 컴포넌트들 외에도, 터치스크린이나 센서 등을 더 포함할 수도 있으며, 통신 회로에 다양한 통신방식 (WiFi, 3G, LTE, Bluetooth, NFC, Zigbee 등)의 RF 통신을 위한 회로가 포함될 수도 있다. 컴퓨팅장치 에 포함 가능한 컴포넌트들은 하나 이상의 신호 처리 또는 애플리케이션에 특화된 집적 회로를 포함하는 하드웨 어, 소프트웨어, 또는 하드웨어 및 소프트웨어 양자의 조합으로 구현될 수 있다. 본 발명의 실시예에 따른 방법들은 다양한 컴퓨팅장치를 통하여 수행될 수 있는 프로그램 명령(instruction) 형 태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 특히, 본 실시예에 따른 프로그램은 PC 기반의 프로그램 또는 모바일 단말 전용의 애플리케이션으로 구성될 수 있다. 본 발명이 적용되는 애플리케이션은 파일 배포 시스템이 제공하는 파일을 통해 컴퓨팅장치에 설치될 수 있다. 일 예로, 파일 배포 시스템은 컴퓨팅장치 의 요청에 따라 상기 파일을 전송하는 파일 전송부(미도시)를 포함할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어구 성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크 로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명 령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목 적컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이 상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상장 치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또 는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨팅장치 상에 분산되어서, 분산 된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다. 본 발명의 일 실시예에 따르면, 실제 화상통화와 유사한 UI를 제공함으로써, 사용자가 좋아하는 캐릭터 혹은 등 장인물과 실제로 화상통화하는 경험을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 캐릭터가 등장하는 작품에 대한 정보를 비롯하여, 해당 캐릭터 및 주변 캐릭터 와의 관계 등에 대한 정보를 프롬프트에 포함시킴으로써, 실제 작품 속 캐릭터와 대화하는 듯한 경험을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 별도의 레슨정보를 입력함으로써, 자연스럽게 사용자가 해당 레슨정보에 포함된 내용을 받아들이는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 사용자가 캐릭터와 나눈 대화를 사용자의 보호자가 볼 수 있어 사용자의 진솔한 마음을 파악할 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 생성형 AI 언어모델을 사용함으로써, 사용자의 질문 혹은 발화에 대해 자연스러 운 답변을 제공하는 효과를 발휘할 수 있다."}
{"patent_id": "10-2023-0186252", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2023-0186252", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 자연어처리모델을 이용한 캐릭터 영상통화 제공방법을 수행하는 컴퓨팅시스 템의 구성을 개략적으로 도시한다. 도 2는 본 발명의 일 실시예에 따른 대화입력단계의 수행과정을 개략적으로 도시한다. 도 3은 본 발명의 일 실시예에 따른 제1프롬프트에 포함되는 정보를 개략적으로 도시한다. 도 4는 본 발명의 일 실시예에 따른 사용자정보 및 레슨정보가 입력되는 인터페이스를 개략적으로 도시한다. 도 5는 본 발명의 일 실시예에 따른 텍스트출력정보수신단계의 수행과정을 개략적으로 도시한다. 도 6은 본 발명의 일 실시예에 따른 제1프롬프트생성단계의 수행과정을 개략적으로 도시한다. 도 7은 본 발명의 일 실시예에 따른 작품정보에 포함되는 항목별 정보들을 개략적으로 도시한다. 도 8은 본 발명의 일 실시예에 따른 유사정보가 결정되는 과정을 개략적으로 도시한다. 도 9는 본 발명의 일 실시예에 따른 유사정보도출단계의 수행과정을 개략적으로 도시한다. 도 10은 본 발명의 일 실시예에 따른 제2프롬프트가 생성되고, 감정출력정보가 도출되는 과정을 개략적으로 도 시한다. 도 11은 본 발명의 일 실시예에 따른 사용자단말이 오디오출력정보 및 영상출력정보를 수신하는 과정을 개략적 으로 도시한다. 도 12는 본 발명의 일 실시예에 따른 제3프롬프트생성단계 및 유저메모리생성단계의 수행과정을 개략적으로 도시한다. 도 13은 본 발명의 일 실시예에 따른 인스턴트답변생성단계의 수행과정을 개략적으로 도시한다. 도 14는 본 발명의 일 실시예에 따른 컴퓨팅장치의 내부 구성을 개략적으로 도시한다."}
