{"patent_id": "10-2021-0165217", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0077953", "출원번호": "10-2021-0165217", "발명의 명칭": "스캔기능을 활용한 삽화를 PSD형태로 데이터화 하는 방법", "출원인": "최영수", "발명자": "최영수"}}
{"patent_id": "10-2021-0165217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "오프라인 삽화를 데이터화하여 PSD형태로 스캐닝하는 방법으로서,오프라인 작업물을 스캐닝 하는 단계;스캐닝 데이터를 코딩 처리하는 단계;코딩데이터를 해상도에 맞춰 프로그래밍화하는 단계;를 포함하는, PSD형태로 스캐닝하는 방법."}
{"patent_id": "10-2021-0165217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 프로그래밍화단계에 있어서,코딩수정을 통해,원본과 산출물의 일치율50%까지 높이는 과정을 더 포함하는, PSD형태로 스캐닝하는 방법."}
{"patent_id": "10-2021-0165217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,원본과 일치율 50%~95%까지 딥러닝 과정을 더 포함하는PSD형태로 스캐닝하는 방법."}
{"patent_id": "10-2021-0165217", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "기존 복합기에 탑재되어있는 스캔 기능을 코딩을 통해 데이터화시켜 산출물과 원본을 비교작업 후, 코딩 수정작 업을 실시한다. 이 과정을 반복하여 작업물과 원본의 일치율이 90%이상 되면 프로그래밍화단계에 돌입한다. 프로 그래밍화 작업 이후, 인공지능기술산업체와 협력하여 1만회의 반복 딥러닝을 통해, 원본과 작업물의 일치율을 95%이상으로 끌어올린다."}
{"patent_id": "10-2021-0165217", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 2D 랜더링 방법이다."}
{"patent_id": "10-2021-0165217", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명의 배경은 일체형 가전 복합기기(All-in-One Home Appliances) 방법(한국 공개실용신안공보 제20-2013- 0005151호)한하에 관한 것이다."}
{"patent_id": "10-2021-0165217", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "커스터마이징 영상동화 사업에서 오프라인 삽화를 영상화 시키는 과정에서 모션그래픽을 위해 레이어 분리작업 이 필요한 PSD파일이 필수적이고 기존의 스캐너는 PNG로 밖에 데이터화지 못한다. 수작업으로 진행해야하는 데 이터화 작업을 기술을 통하여 인적자원 의존도와 단가를 낮춘다."}
{"patent_id": "10-2021-0165217", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 오프라인 삽화를 데이터화하여 PSD형태로 스캐닝하는 방법은 오프라인 작업물을 스 캐닝 하는 단계, 스캐닝 데이터를 코딩 처리하는 단계, 코딩데이터를 해상도에 맞춰 프로그래밍화하는 단계를 포함할 수 있다. 예를 들어, 프로그래밍화단계에 있어서, 코딩수정을 통해,원본과 산출물의 일치율50%까지 높이는 과정을 더 포 함할 수 있다. 예를 들어, 원본과 일치율 50%~95%까지 딥러닝 과정을 더 포함할 수 있다."}
{"patent_id": "10-2021-0165217", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "오프라인 삽화를 데이터화하기 위해 스캔본을 보고 겹쳐 그리거나 비슷하게 그리는 수준이 아닌, 오프라인 원본 과 정확하게 데이터화 된 삽화제작물을 통해 삽화를 활용하여 영상화하는 전 분야적인 예술 분야의 기록과 발전 을 야기할 수 있음"}
{"patent_id": "10-2021-0165217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부도면을 참조하여 본 고안의 실시예에 대해 구체적으로 설명한다. 각 도면의 구성요소들에 참조부호를 부가함에 있어서 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가 지도록 하였다. 또한, 본 고안의 실시예에 대한 설명 시 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 고안의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 복합기의 스캔기능을 발전시켜 오프라인의 삽화 작업물을 해상도와 비율에 맞춰 도면화 하고 PSD형태의 파일로 수정 가능하게끔 하여, 오프라인 삽화작업을 온라인 삽화작업으로 옮길 수 있도록 한다. 기존 복합기의 스캐닝은는 PNG혹은 PDF, JPEG로 밖에 데이터 산출물을 하지 못하기에, 영상화 작업을 하기위해 서 PNG를 PSD관련프로그램에서 필사 작업을 통해 PSD 파일로 변환하여 레이어를 분리하거나 색상작업을 진행하 지만 우리의 기술은 기존 스캔기능을 보완하여 영상으로 재 창작할 수 있도록 PSD데이터화 한다. 스캐닝 이후, 코딩을 통해 오프라인 삽화그림을 수치화하여 해상도와 비율에 맞춰 데이터된 산출물은 원본과 비교작업 후, 코딩 수정작업을 실시한다. 이 과정을 반복하여 작업물과 원본의 일치율이 50%이상 되면, 프로그 래밍화 단계에 돌입한다. 프로그래밍화 작업 이후, 인공지능기술산업체와 협력하여 1만회의 반복 딥러닝을 통해, 원본과 작업물의 일치율을 95%이상으로 끌어올린다. 도1은 샘플링동화 완성도로서,데이터 된 삽화가 들어가기전, 기존의 영상동화 한 도면이다. 도2는 스캐닝기술 데이터화 완성도로서, 발명의 스캐닝기술이 데이터화를 마쳐 PSD형태로 구현된 상태이다. 도3은 데이터화된 삽화를 삽입한 맞춤형 영상동화의 완성도로서, 데이터 된 삽화작업을 영상화하여 만든 영상동 화의 한 도면이다 이상의 설명은 본 고안의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 고안이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 고안의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 고안에 개시된 실시예들은 본 고안의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 고안의 기술 사상의 범위가 한정되는 것은 아니다. 본 고안의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 고안의 권리범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2021-0165217", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 샘플링동화 완성도 도2는 스캐닝기술 데이터화 완성도 도3은 데이터화된 삽화를 삽입한 맞춤형 영상동화의 완성도"}
