{"patent_id": "10-2023-0181263", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0045429", "출원번호": "10-2023-0181263", "발명의 명칭": "멀티 폴더블 하우징을 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "안재욱"}}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 제1 하우징, 제2 하우징, 및 제3 하우징을 포함하는 폴더블 하우징;상기 제1 하우징 및 상기 제2 하우징을 제1 폴딩 축에 대하여 회전 가능하게 연결하고, 복수의 제1 연동 기어들(interlocking gears)을 포함하는 제1 힌지 어셈블리; 및상기 제1 하우징 및 상기 제3 하우징을 제2 폴딩 축에 대하여 회전 가능하게 연결하고, 상기 복수의 제1 연동기어들보다 많은 복수의 제2 연동 기어들을 포함하는 제2 힌지 어셈블리를 포함하고, 상기 폴더블 하우징은, 상기 제1 하우징, 상기 제2 하우징, 및 상기 제3 하우징이 실질적으로 동일한 평면 상에 배치되는 제1 상태, 상기 제2 하우징이 상기 제1 힌지 어셈블리를 통해, 상기 제1 하우징에 대하여 접힌(folded) 제2 상태, 및상기 제2 상태에서, 상기 제3 하우징이 상기 제2 힌지 어셈블리를 통해, 상기 제1 하우징에 대하여 접힘으로써,상기 제2 하우징 위에 위치되는 제3 상태를 제공하도록 구성되는, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제1 힌지 어셈블리를 적어도 부분적으로(at least partially) 수용(accommodate)하는 제1 힌지 커버; 및상기 제2 힌지 어셈블리를 적어도 부분적으로 수용하는 제2 힌지 커버를 더 포함하고, 상기 제2 힌지 커버의 사이즈는, 상기 제1 힌지 커버의 사이즈보다 큰, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제1 힌지 커버는, 상기 제1 상태 내에서, 상기 제1 하우징 및 상기 제2 하우징에 의해 실질적으로 가려지고, 상기 제2 힌지 커버의 적어도 일부는, 상기 제1 상태 내에서, 상기 제1 하우징 및 상기 제3 하우징 사이로 노출되는, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서, 공개특허 10-2025-0045429-3-상기 폴더블 하우징 상에 배치되는 플렉서블 디스플레이;상기 복수의 제1 연동 기어들과 연동(interlocked)됨으로써, 이동되는 제1 지지 플레이트; 및상기 복수의 제2 연동 기어들과 연동됨으로써, 이동되는 제2 지지 플레이트를 더 포함하고, 상기 제1 지지 플레이트는, 상기 제1 상태 내에서, 상기 플렉서블 디스플레이의 제1 영역을 지지하고, 상기 제2 지지 플레이트는, 상기 제1 상태 또는 상기 제2 상태 내에서, 상기 플렉서블 디스플레이의 제2 영역을 지지하고, 상기 제2 영역은, 상기 제1 영역보다 넓은, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 제3 상태 내에서, 상기 제2 지지 플레이트에 의해 지지되는 상기 제2 영역의 폭은, 상기 제3 상태 내에서, 상기 제1 하우징 및 상기 제3 하우징 사이에 위치되는 상기 제2 하우징의 두께보다작은, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항 및 제5항 중 어느 한 항에 있어서, 상기 제2 지지 플레이트의 폭(width)은, 상기 제1 지지 플레이트의 폭보다 넓은,전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항 내지 제6항 중 어느 한 항에 있어서, 상기 제2 지지 플레이트는, 제1 서브 지지 플레이트, 및제2 서브 지지 플레이트를 포함하고, 상기 제1 서브 지지 플레이트 및 상기 제2 서브 지지 플레이트는, 상기 복수의 제2 연동 기어들과 연동되어 이동되는, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항 내지 제7항 중 어느 한 항에 있어서, 공개특허 10-2025-0045429-4-상기 제2 지지 플레이트의 길이는, 상기 제1 지지 플레이트의 길이와 상이한(different from),전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제4항 내지 제8항 중 어느 한 항에 있어서, 상기 제2 영역은, 상기 제3 상태 내에서, 상기 제2 지지 플레이트에 의해 지지됨으로써, 상기 제1 하우징 및 상기 제3 하우징과수직으로 배치되는 제1 부분, 상기 제3 상태 내에서, 상기 제1 부분과 상기 제1 하우징 상에 배치된 상기 플렉서블 디스플레이의 영역 사이에위치되고, 적어도 부분적으로 굴곡되는 제2 부분, 및상기 제3 상태 내에서, 상기 제1 부분과 상기 제3 하우징 상에 배치된 상기 플렉서블 디스플레이의 영역 사이에위치되고, 적어도 부분적으로 굴곡되는 제3 부분을 포함하는, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서, 상기 복수의 제1 연동 기어들은, 제1 기어, 제2 기어, 상기 제1 기어와 상기 제2 기어 사이에 배치되는, 제3 기어, 및 제4 기어를 포함하고, 상기 복수의 제2 연동 기어들은,제5 기어, 제6 기어, 상기 제5 기어와 상기 제6 기어 사이에 배치되는, 제7 기어, 제8 기어, 제9 기어, 및 제10기어를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 제1 힌지 어셈블리는, 상기 제1 기어에 연결되는 제1 샤프트, 및상기 제2 기어에 연결되는 제2 샤프트를 포함하고, 상기 제2 힌지 어셈블리는, 상기 제5 기어에 연결되는 제3 샤프트, 및상기 제6 기어에 연결되는 제4 샤프트를 포함하고, 상기 제3 샤프트와 상기 제4 샤프트 사이의 제1 간격은, 상기 제1 샤프트와 상기 제2 샤프트 사이의 제2 간격보다 넓은, 전자 장치. 공개특허 10-2025-0045429-5-청구항 12 제11항에 있어서, 상기 제3 샤프트의 직경은, 상기 제1 샤프트의 직경보다 큰, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항 내지 제12항 중 어느 한 항에 있어서, 상기 제9 기어 및 상기 제10 기어는, 상기 제7 기어 및 상기 제8 기어 사이에 배치되고, 상기 제5 기어의 사이즈는, 상기 제6 기어의 사이즈에 대응(corresponds to)하고, 상기 제7 기어의 사이즈는, 상기 제8 기어의 사이즈에 대응하고, 상기 제8 기어의 사이즈는, 상기 제10 기어의 사이즈에 대응하는, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 제9 기어의 사이즈는, 상기 제5 기어의 사이즈 및 상기 제7 기어의 사이즈보다 큰, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항 및 제14항에 있어서, 상기 제5 기어의 사이즈는, 상기 제7 기어의 사이즈보다 작은, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항 내지 제15항 중 어느 한 항에 있어서, 상기 제5 기어의 회전 축 및 상기 제6 기어의 회전 축을 연결하는 가상의 제1 직선은, 상기 제7 기어의 회전 축 및 상기 제8 기어의 회전 축을 연결하는 가상의 제2 직선 위에 위치되는, 공개특허 10-2025-0045429-6-전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항 내지 제16항 중 어느 한 항에 있어서, 상기 제9 기어의 회전 축 및 상기 제10 기어의 회전 축을 연결하는 가상의 제3 직선은, 상기 가상의 제2 직선위에 위치되는, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항 내지 제17항 중 어느 한 항에 있어서, 상기 제1 힌지 어셈블리는, 적어도 하나의 제1 탄성 부재를 포함하고, 상기 제2 힌지 어셈블리는, 적어도 둘의 제2 탄성 부재들을 포함하고, 상기 적어도 둘의 제2 탄성 부재들의 개수는, 상기 적어도 하나의 제1 탄성 부재의 개수보다 많은, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항 내지 제18항 중 어느 한 항에 있어서, 상기 제2 힌지 어셈블리는, 로터리 레일을 포함하고, 상기 제1 하우징 및 상기 제3 하우징에 결합되는 제1 회전 부재,상기 로터리 레일이 삽입됨으로써, 상기 제1 회전 부재의 회전을 가이드하는 가이드 홈을 포함하고, 상기 제1하우징 및 상기 제2 하우징에 결합되는 가이드 부재,슬롯을 포함하고, 상기 제1 회전 부재와 결합되는 연결 부재, 및상기 슬롯 내에 삽입되고, 상기 슬롯 내에서 이동됨으로써, 상기 제1 회전 부재의 회전 범위를 제한하는 돌기를포함하고, 상기 복수의 제2 연동 기어들 중 적어도 일부와 연결되는 샤프트가 결합됨으로써, 상기 복수의 제2연동 기어들의 회전력을 상기 연결 부재를 통해 상기 제1 회전 부재로 전달하는 제2 회전 부재를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0181263", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 슬롯은, 상기 슬롯의 일 단으로부터 지정된 거리만큼 이격되고, 상기 슬롯 내부를 향하여 돌출된 제1 걸림부, 및상기 일 단에 반대인 상기 슬롯의 다른 단으로부터 상기 지정된 거리만큼 이격되고, 상기 슬롯 내부를 향하여돌출된 제2 걸림부를 포함하는, 공개특허 10-2025-0045429-7-전자 장치."}
{"patent_id": "10-2023-0181263", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "예시적인 전자 장치는, 제1 하우징, 제2 하우징, 및 제3 하우징을 포함하는 폴더블 하우징, 상기 제1 하우징 및 상기 제2 하우징을 제1 폴딩 축에 대하여 회전 가능하게 연결하고, 복수의 제1 연동 기어들(interlocking gear s)을 포함하는 제1 힌지 어셈블리 및 상기 제1 하우징 및 상기 제3 하우징을 제2 폴딩 축에 대하여 회전 가능하 게 연결하고, 상기 복수의 제1 연동 기어들보다 많은 복수의 제2 연동 기어들을 포함하는 제2 힌지 어셈블리를 포함한다."}
{"patent_id": "10-2023-0181263", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명들은, 멀티 폴더블 하우징을 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0181263", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는, 향상된 사용자 경험을 제공하기 위한 폴더블 하우징 및 플렉서블 디스플레이를 포함할 수 있다. 예를 들어, 폴더블 하우징은, 복수의 하우징들을 포함할 수 있다. 폴더블 하우징은, 복수이 하우징들이 한번 이 상 접히거나 펼쳐질 수 있는 구조를 가질 수 있다. 예를 들어, 폴더블 하우징은, 2개의 힌지들을 통해, 회전 가 능하게 결합되는 3개의 하우징들을 포함할 수 있다. 폴더블 하우징이 접히는 방식에 따라, 2개의 힌지들의 구조 는, 상이할 수 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련하여 종래 기술(prior art)로서 적용될 수 있는지에 관해서는 어떠한 주 장이나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0181263", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전자 장치가 제공된다. 상기 전자 장치는, 제1 하우징, 제2 하우징, 및 제3 하우징을 포함하는 폴더블 하우징을 포함할 수 있다. 상기 전자 장치는, 상기 제1 하우징 및 상기 제2 하우징을 제1 폴딩 축에 대하여 회전 가능하 게 연결하고, 복수의 제1 연동 기어들(interlocking gears)을 포함하는 제1 힌지 어셈블리를 포함할 수 있다. 상기 전자 장치는, 상기 제1 하우징 및 상기 제3 하우징을 제2 폴딩 축에 대하여 회전 가능하게 연결하고, 상기 복수의 제1 연동 기어들보다 많은 복수의 제2 연동 기어들을 포함하는 제2 힌지 어셈블리를 포함할 수 있다. 상 기 폴더블 하우징은, 상기 제1 하우징, 상기 제2 하우징, 및 상기 제3 하우징이 실질적으로 동일한 평면 상에 배치되는 제1 상태, 상기 제2 하우징이 상기 제1 힌지 어셈블리를 통해, 상기 제1 하우징에 대하여 접힌 (folded) 제2 상태, 및 상기 제2 상태 내에서, 상기 제3 하우징이 상기 제2 힌지 어셈블리를 통해, 상기 제1 하 우징에 대하여 접힘으로써, 상기 제2 하우징 위에 위치되는 제3 상태를 제공하도록 구성될 수 있다."}
{"patent_id": "10-2023-0181263", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 일 실시예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치 에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모 듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들어, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들어, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)과 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들어, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들어, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 어, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들어, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들어, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들어, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들어, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들어, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들어, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네 트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들어, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 일 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안 테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지정 된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들어, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가 적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상 기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전 자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제 공할 수 있다. 이를 위하여, 예를 들어, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용 한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내 에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 개시 내에서, \"위\", \"아래\", \"일 측\", \"다른 측\", \"일 단\", \"다른 단\"과 같은 상대적인 용어는, 구성요소들 의 절대적인 위치를 나타내는 것이 아니라, 구성요소들 사이의 상대적인 위치 관계를 설명하기 위해 사용될 수 있다. 예를 들어, 도면 내에 도시된 전자 장치가 뒤집힐 경우, 위 및 아래는, 서로 바뀔 수 있다. 예를 들 어, 도면 내에 도시된 전자 장치가 뒤집힐 경우, 일 단 및 다른 단은, 서로 바뀔 수 있다. 본 개시 내에서, 회전은, 폴더블 하우징의 접히거나(folded) 펼쳐지는(unfolded) 동작으로 참조될 수 있다. 예를 들어, \"일 구성요소가 다른 구성요소에 대하여 회전된다\"는 것은, 일 구성요소가 다른 구성요소에 대하여 접히거나 펼쳐지는 동작으로 참조될 수 있다. 도 2는, 폴더블 하우징을 포함하는 예시적인 전자 장치를 도시한다. 도 2를 참조하면, 예시적인 전자 장치는, 변형 가능한(deformable) 폴더블 하우징을 포함할 수 있다. 예를 들어, 폴더블 하우징은, 회전 가능하게 연결되는 복수의 하우징들을 포함하는 점에서, 멀티 폴더블 하우징으로 지칭될 수도 있다. 예를 들어, 폴더블 하우징은, 서로 회전 가능하게 결합되는 제1 하우징 , 제2 하우징, 및 제3 하우징을 포함할 수 있다. 본 개시에서, 폴더블 하우징은, 제1 하우 징, 제2 하우징, 및 제3 하우징을 포함하는 구조로 설명되지만, 이에 제한되는 것은 아니다. 예 를 들어, 폴더블 하우징은, 3개 이상의 복수의 하우징들을 포함할 수도 있다. 예를 들어, 전자 장치는, 폴더블 하우징의 변형 가능한 구조를 위한 힌지 어셈블리(예: 제1 힌 지 어셈블리 및 제2 힌지 어셈블리)를 포함할 수 있다. 예를 들어, 힌지 어셈블리는, 제1 하우 징, 제2 하우징, 및 제3 하우징을 회전 가능하게 연결할 수 있다. 예를 들어, 폴더블 하우징 이 접히는 구조에 따라서, 힌지 어셈블리와 하우징들 사이의 연결 관계는, 상이할 수 있다. 도 2를 참조하면, 제2 하우징은, 제1 하우징의 일 측(예: +x 방향 측)에 제1 폴딩 축에 대하여 회전 가능하게 연결될 수 있다. 예를 들어, 제3 하우징은, 제1 하우징의 다른 측(예: -x 방향 측)에 제2 폴딩 축에 대하여 회전 가능하게 연결될 수 있다. 예를 들어, 힌지 어셈블리는, 제2 하우징(22 0)을 제1 하우징의 일 측에 회전 가능하게 연결하는 제1 힌지 어셈블리 및 제3 하우징을 제1 하 우징의 다른 측에 회전 가능하게 연결하는 제2 힌지 어셈블리를 포함할 수 있다. 전자 장치는, 제1 힌지 어셈블리 및 제2 힌지 어셈블리에 의해, 한번 이상 접힐 수 있는 구조를 가질 수 있다. 예를 들어, 제2 폴딩 축은, 제1 폴딩 축과 평행할 수 있다. 예를 들어, 제1 폴딩 축 및 제2 폴 딩 축은, y축에 평행할 수 있다. 예를 들어, 제1 폴딩 축은, 제1 힌지 어셈블리에 의해 연결된 제1 하우징 및 제2 하우징의 회전 축일 수 있다. 예를 들어, 제2 폴딩 축은, 제2 힌지 어셈블리 에 의해 연결된 제1 하우징 및 제3 하우징의 회전 축일 수 있다. 예를 들어, 제1 하우징 및/또는 제2 하우징이 제1 폴딩 축을 기준으로 회전됨에 따라, 제1 하우 징 및 제2 하우징 사이의 제1 각도가 변경될 수 있다. 예를 들어, 제1 하우징 및/또는 제3 하우징이 제2 폴딩 축을 기준으로 회전됨에 따라, 제1 하우징 및 제3 하우징 사이의 제2 각도가 변경될 수 있다. 제1 폴딩 축 및 제2 폴딩 축과 같이, 복수의 폴딩 축들을 포함하는 관 점에서(in terms of), 예시적인 전자 장치는, 멀티 폴더블 전자 장치로 지칭될 수 있다. 예시적인 전자 장치는, 폴더블 하우징의 일 면 상에 배치된 플렉서블 디스플레이를 포함할 수 있다. 예를 들어, 플렉서블 디스플레이는, 제2 하우징의 전면의 적어도 일부로부터 제1 하우징의 전면의 적어도 일부를 가로질러 제3 하우징의 전면의 적어도 일부까지 연장될 수 있다. 예를 들어, 폴더블 하우징(20 0)이 접히거나 펼쳐질 경우, 플렉서블 디스플레이도 접히거나 펼쳐질 수 있다. 도 2 및 도 2b를 참조하면, 폴더블 하우징의 형태에 의해 구분되는 전자 장치의 상이한 상태들이 도 시된다. 예를 들어, 도 2 내에 도시된 전자 장치의 플렉서블 디스플레이는, 제1 폴딩 축 및 제2 폴딩 축을 따라서 접힌 제1 하우징, 제2 하우징, 및 제3 하우징에 의해 가려질 수 있다. 도 2의 제1 상태는, 제1 하우징, 제2 하우징, 및 제3 하우징이 완전히 펼쳐진 상태(fully unfolded state)를 나타낼 수 있다. 예를 들어, 제1 상태 내에서, 제1 각도 및 제2 각도는, 실질적으로 평각(straight angle)(예: 약 180도)일 수 있다. 제1 상태는, 제1 하우징, 제2 하우징 , 및 제3 하우징이 완전히 펼쳐진 관점에서, 개방 상태, 플랫 상태, 펼침(outspread) 상태, 및/또는 언폴드 상태로 지칭될 수 있다. 제1 상태 내에서, 플렉서블 디스플레이는, 실질적으로 평평(flat)할 수 있다. 예를 들어, 제1 상태 내에서, 제1 하우징은, 제2 하우징 및 제3 하우징 사이에 위치될 수 있다. 도 2의 제2 상태는, 제1 각도 또는 제2 각도 중 적어도 하나가 평각보다 작은 상태를 나타낼 수 있다. 예를 들어, 제2 하우징이 제1 하우징에 대하여 회전되거나 제3 하우징이 제1 하우징(21 0)에 대하여 회전됨에 따라, 전자 장치는, 제1 상태로부터 제2 상태로 변경될 수 있다. 예를 들 어, 제1 각도 및/또는 제2 각도가 평각 미만인 전자 장치의 상태는, 인-폴드 상태, 서브 펼침 상태(또는 서브 폴드 상태), 중간 상태(intermediate state) 및/또는 오목한(concave) 상태로 지칭될 수 있다. 제2 상태 내에서, 플렉서블 디스플레이의 일부는, 접힐 수 있다. 예를 들어, 제1 폴딩 축 및/또 는 제2 폴딩 축에 대응하는 플렉서블 디스플레이의 일부는, 제1 각도 및/또는 제2 각도에 대응하는 각도로 접힐 수 있다. 도 2의 제3 상태는, 제1 하우징, 제2 하우징, 및 제3 하우징이 완전히 접힌 상태(fully folded state)를 나타낼 수 있다. 예를 들어, 제3 상태 내에서, 제1 각도 및 제2 각도는, 실질 적으로 0도일 수 있다. 예를 들어, 제3 상태 내에서, 플렉서블 디스플레이는, 제1 하우징, 제2 하우징, 및/또는 제3 하우징에 의해 가려짐으로써, 전자 장치의 외부로 노출되지 않을 수 있다. 예를 들어, 제3 상태 내에서, 제2 하우징은, 제1 하우징 및 제3 하우징 사이에 위치될 수 있다. 예를 들어, 제3 상태 내에서, 제3 하우징 상에 배치된 커버 디스플레이가 외부로 노출될 수 있 다. 도 3a는, 예시적인 전자 장치의 폴더블 하우징 및 힌지 어셈블리들을 도시한다. 도 3b는, 예시적인 전자 장치의 상태들을 도시한다. 예를 들어, 폴더블 하우징은, 제1 하우징, 제2 하우징, 및 제3 하우징을 포함할 수 있다. 예를 들어, 제1 하우징은, 제1 지지부재를 포함할 수 있다. 예를 들어, 제2 하우징은, 제2 지지 부재를 포함할 수 있다. 예를 들어, 제3 하우징은, 제3 지지부재를 포함할 수 있다. 제1 지지부 재, 제2 지지부재, 및 제3 지지부재는, 플렉서블 디스플레이(예: 도 2의 플렉서블 디스플레이 ) 및 폴더블 하우징 내부에 배치되는 전자 부품들을 지지할 수 있다. 예를 들어, 전자 장치는, 폴더블 하우징의 변형을 제공하는 제1 힌지 어셈블리 및 제2 힌지 어 셈블리를 포함할 수 있다. 예를 들어, 제1 힌지 어셈블리는, 제1 하우징 및 제2 하우징 사 이에 배치될 수 있다. 예를 들어, 제1 힌지 어셈블리는, 제1 하우징 및 제2 하우징을, 제1 폴딩 축에 대하여 회전 가능하게 연결할 수 있다. 예를 들어, 사용자가 제2 하우징을 접기 위해서 외력을 가하면, 제2 하우징은, 제1 힌지 어셈블리를 통해, 제1 하우징에 대하여 회전될 수 있다. 예를 들어, 제2 하우징은, 제1 하우징에 대하여 안으로 접힐(folded inward) 수 있다. 제2 하우징이 제1 하우징에 대하여 안으로 접히는 관점에서, 제1 하우징, 제1 힌지 어셈블리, 및 제2 하우징 은, 인-폴드(in-fold) 구조로 지칭될 수 있다. 예를 들어, 제2 힌지 어셈블리는, 제1 하우징 및 제3 하우징 사이에 배치될 수 있다. 예를 들어, 제2 힌지 어셈블리는, 제1 하우징 및 제3 하우징을, 제2 폴딩 축에 대하여 회전 가 능하게 연결할 수 있다. 예를 들어, 사용자가 제3 하우징을 접기 위해서 외력을 가하면, 제3 하우징 은, 제2 힌지 어셈블리를 통해, 제1 하우징에 대하여 회전될 수 있다. 예를 들어, 제3 하우징은, 제1 하우징에 대하여 안으로 접힐(folded inward) 수 있다. 제3 하우징이 제1 하우 징에 대하여 안으로 접히는 관점에서, 제1 하우징, 제2 힌지 어셈블리, 및 제3 하우징은, 인-폴드(in-fold) 구조로 지칭될 수 있다. 예를 들어, 전자 장치는, 폴더블 하우징의 접힌 구조를 유 지하기 위한 결합 부재들(예: 마그넷)을 포함할 수 있다. 폴더블 하우징이 2번 이상 접히는 구조를 가지는 관점에서, 폴더블 하우징은, 멀티 폴더블 하우징으로 지칭될 수 있다. 예를 들어, 제2 힌지 어셈블리는, 제1 힌지 어셈블리와 상이(different from)할 수 있다. 예를 들어, 폴더블 하우징이 접히는 방식에 따라, 제1 힌지 어셈블리와 제2 힌지 어셈블리의 차이가 야기될수 있다. 전술된 바와 같이, 제2 하우징 및 제3 하우징이 각각 안으로 접히기 때문에, 제2 힌지 어셈 블리는, 제1 힌지 어셈블리와 상이할 수 있다. 도 3b를 참조하면, 폴더블 하우징은, 제1 상태, 제2 상태, 및 제3 상태를 제공하도록 구성될 수 있다. 예 를 들어, 도 3b의 300a는, 제1 하우징, 제2 하우징, 및 제3 하우징이, 실질적으로 동일한 평면 상에 배치되는 제1 상태로 참조될 수 있다. 예를 들어, 도 3b의 300b는, 제2 하우징이 제1 힌지 어셈블리 를 통해, 제1 하우징에 대하여 안으로 접힌 제2 상태로 참조될 수 있다. 예를 들어, 도 3b의 300c는, 상기 제2 상태 내에서, 제3 하우징이 제2 힌지 어셈블리를 통해, 제1 하우징에 대하여 안으로 접힘으로써, 제2 하우징 위에 위치되는 제3 상태로 참조될 수 있다. 도 2를 참조하여 전술된 바와 같이, 제1 상태는, 개방(opened) 상태, 플랫 상태, 펼침(outspread) 상태, 및/또는 언폴드 상태로 지칭될 수 있다. 제 2 상태는, 인-폴드 상태, 서브 펼침 상태(또는 서브 폴드 상태), 및/또는 세미 펼침 상태(또는 세미 폴드 상 태)로 지칭될 수 있다. 제3 상태는, 닫힌(closed) 상태, 완전 접힌 상태, 폴드 상태 및/또는 닫힘 상태로 지칭 될 수 있다. 전자 장치는, 큰 화면의 플렉서블 디스플레이(예: 도 2의 플렉서블 디스플레이)를 사용하기 위해, 제 1 상태 내에서 사용될 수 있다. 전자 장치는, 사용자에 의해 용이하게 소지될 수 있도록, 제1 상태로부터 제3 상태로 전환될 수 있다. 예를 들어, 폴더블 하우징은, 제1 상태로부터 제2 상태를 거쳐서, 제3 상태로 전환될 때, 수 있다. 예를 들어, 제1 상태 내에서, 제2 하우징이 먼저 제1 하우징에 대하여 안으로 접히고(제2 상태) 나서, 제3 하우징이 제1 하우징에 대하여 안으로 접힐 수 있다(제3 상태). 예를 들 어, 제3 상태 내에서, 제2 하우징은, 제1 하우징과 제3 하우징 사이에 위치될 수 있다. 예를 들어, 상기 제3 상태를 제공하기 위해서, 제2 힌지 어셈블리는, 제1 힌지 어셈블리와 상이할 수 있다. 만약, 제2 힌지 어셈블리의 사이즈가 제1 힌지 어셈블리의 사이즈와 실질적으로 동일하거나 유 사할 경우, 제1 하우징과 제3 하우징이 접혔을 때, 제2 하우징이 위치될 공간이 형성되지 않을 수 있다. 예를 들어, 제3 상태 내에서, 제2 하우징이 제1 하우징과 제3 하우징 사이에 위치될 수 있는 공간을 제공하기 위해서, 제2 힌지 어셈블리의 사이즈는, 제1 힌지 어셈블리의 사이즈보다 클 수 있다. 예를 들어, 제2 힌지 어셈블리의 폭은, 제1 힌지 어셈블리의 폭보다 넓을 수 있다. 상이 한 폭을 가지는 관점에서, 제1 힌지 어셈블리는, 내로우(narrow) 힌지로 지칭될 수 있고, 제2 힌지 어셈블 리는, 와이드(wide) 힌지로 지칭될 수 있다. 예시적인 전자 장치는, 제1 힌지 커버 및 제2 힌지 커버를 포함할 수 있다. 예를 들어, 제1 힌 지 커버는, 제1 힌지 어셈블리를 적어도 부분적으로 수용할 수 있다. 예를 들어, 제2 힌지 커버(31 2)는, 제2 힌지 어셈블리를 적어도 부분적으로 수용할 수 있다. 예를 들어, 제2 힌지 어셈블리의 사 이즈가 제1 힌지 어셈블리의 사이즈보다 크기 때문에, 상기 제2 힌지 커버의 사이즈보다 클 수 있다. 상기 사이즈의 차이에 의해, 제1 상태 내에서, 제1 힌지 커버 및 제2 힌지 커버의 외부로의 노출 여 부가 상이할 수 있다. 예를 들어, 도 3b를 참조하면, 제1 힌지 커버는, 제1 상태 내에서, 제1 하우징 및 제2 하우징에 의해 실질적으로 가려질 수 있다. 예를 들어, 상대적으로 작은 사이즈를 가지는 제1 힌지 커버는, 제1 상태 내에서, 시인되지 않을 수 있다. 예를 들어, 제2 힌지 커버의 적어도 일부는, 제1 상태 내에서, 제1 하우징 및 제3 하우징 사이로 노출될 수 있다. 예를 들어, 상대적으로 큰 사이즈를 가지는 제2 힌지 커버는, 제1 상태 내에서, 시인될 수 있다. 예를 들어, 제1 힌지 어셈블리 및 제2 힌지 어셈블리는, 폴더블 하우징의 변형을 위한 복수의 연동 기어들(interlocking gears)을 포함할 수 있다. 예를 들어, 제1 힌지 어셈블리는, 복수의 제1 연동 기어들을 포함할 수 있다. 제2 하우징의 회전을 야기하는 외력이 제2 하우징에 가해지면, 상기 외력에 의해, 복수의 제1 연동 기어들이 동작될 수 있다. 복수의 제1 연동 기어들은, 제2 하우징 과 제1 하우징의 동작을 연동시킬 수 있다. 복수의 제1 연동 기어들의 구조는, 도 7a를 참조하 여 후술될 것이다. 예를 들어, 제2 힌지 어셈블리는, 복수의 제2 연동 기어들을 포함할 수 있다. 제3 하우징의 회 전을 야기하는 외력이 제3 하우징에 가해지면, 상기 외력에 의해, 복수의 제2 연동 기어들이 동작될 수 있다. 복수의 제2 연동 기어들은, 제3 하우징과 제1 하우징의 동작을 연동시킬 수 있다. 복 수의 제2 연동 기어들의 구조는, 도 7b를 참조하여 후술될 것이다. 예를 들어, 제2 힌지 어셈블리의 사이즈는, 제1 힌지 어셈블리의 사이즈보다 크고, 제3 상태 내에서, 제2 하우징이 위치될 공간을 형성해야 하기 때문에, 제2 힌지 어셈블리는, 제1 힌지 어셈블리보다 더 많은 연동 기어들을 필요로 할 수 있다. 예를 들어, 복수의 제2 연동 기어들은, 복수의 제1 연동 기 어들보다 많을 수 있다. 복수의 제2 연동 기어들은, 복수의 제1 연동 기어들보다 많은 연동 기 어들을 포함하기 때문에, 안정적인 구동을 위해서, 복수의 제1 연동 기어들의 배치 구조와 상이한 배치 구 조를 가질 수 있다. 도 4a는, 제2 힌지 어셈블리의 분해도이다. 도 4b는, 제2 힌지 어셈블리의 일부를 도시한다. 예를 들어, 제2 힌지 어셈블리는, 제1 하우징의 제1 지지부재와 제3 하우징의 제3 지지부 재 사이에 배치될 수 있다. 예를 들어, 제2 힌지 커버는, 제2 힌지 어셈블리의 구성요소들을 적 어도 부분적으로 커버할 수 있다. 예를 들어, 제2 힌지 어셈블리의 구성요소들 중 일부(예: 제1 가이드 부 재, 제2 가이드 부재)는, 제2 힌지 커버에 결합됨으로써, 제2 힌지 커버에 고정될 수 있다. 제2 힌지 커버는, 제2 힌지 어셈블리의 구성요소들을 커버함으로써, 제2 힌지 어셈블리 내부로 이물질의 유입을 줄일 수 있고, 상기 구성요소들을 보호할 수 있다. 예를 들어, 제2 힌지 어셈블리는, 제1 회전 부재, 가이드 부재, 연결 부재, 제2 회전 부재 , 및 복수의 제2 연동 기어들을 포함할 수 있다. 예를 들어, 제1 회전 부재는, 제1 암 및 제2 암을 포함할 수 있다. 예를 들어, 제1 암 및 제2 암은, 제1 지지부재 및 제3 지지부재와 결합됨으로써, 제1 하우징 및 제3 하우징(23 0)의 회전을 야기할 수 있다. 예를 들어, 가이드 부재는, 제1 회전 부재의 회전 운동을 가이드할 수 있다. 예를 들어, 가이드 부재 는, 제1 가이드 부재 및 제2 가이드 부재를 포함할 수 있다. 예를 들어, 제1 가이드 부재 는, 제1 암 및 제1 암 서포트와 결합될 수 있다. 예를 들어, 제2 가이드 부재는, 제2 암 및 제2 암 서포트와 결합될 수 있다. 예를 들어, 연결 부재는, 제1 회전 부재와 제2 회전 부재를 연동할 수 있고, 회전 범위를 제한 할 수 있다. 예를 들어, 연결 부재는, 제1 암 및 제2 암 사이에 배치될 수 있다. 예를 들어, 연 결 부재는, 제1 연결 부재 및 제2 연결 부재를 포함할 수 있다. 예를 들어, 제2 회전 부재는, 복수의 제2 연동 기어들의 동작과 연동됨으로써, 연결 부재를 통 해, 제1 회전 부재로 힘을 전달하도록 구성될 수 있다. 예를 들어, 제2 회전 부재는, 제1 암 서포트 및 제2 암 서포트를 포함할 수 있다. 예를 들어, 복수의 제2 연동 기어들은, 제1 하우징과 제3 하우징의 회전 동작을 연동할 수 있다. 복수의 제2 연동 기어들은, 폴더블 하우징에 가해지는 외력을 제1 하우징 및 제3 하우징 의 회전 운동으로 변환할 수 있다. 예를 들어, 제2 힌지 어셈블리는, 프릭션 바디, 커버, 홀더, 적어도 둘의 제2 탄성 부재들 및 스크류(S)를 더 포함할 수 있다. 예를 들어, 프릭션 바디는, 적어도 둘의 제2 탄성 부재를 가압함으로써, 적어도 둘의 제2 탄성 부재들 의 복원력을 야기할 수 있다. 예를 들어, 프릭션 바디는, 상기 복원력에 기반하여, 제2 회전 부재 의 회전에 저항하는 힘(예: 토크)을 제공함으로써, 프리 스탑 또는 플렉스 모드를 가능하게 할 수 있다. 예를 들어, 프릭션 바디는, 제1 프릭션 바디 및 제2 프릭션 바디를 포함할 수 있다. 예를 들어, 커버는, 프릭션 바디와 접할 수 있다. 예를 들어, 커버는, 제1 커버 및 제2 커 버를 포함할 수 있다. 예를 들어, 홀더는, 적어도 둘의 제2 탄성 부재들을 고정하고, 프릭션 바디와 함께 적어도 둘의 제2 탄성 부재들의 복원력을 야기할 수 있다. 예를 들어, 스크류(S)는, 제2 힌지 어셈블리의 일부 구성요소들(예: 제1 회전 부재, 연결 부재, 및/또는 홀더)을 고정하기 위해 사용될 수 있다. 예를 들어, 스크류(S)는, 제2 지지 플레이트를 제2 힌지 커버에 고정하기 위해 사용될 수 있다. 예를 들어, 전자 장치는, 제2 지지 플레이트를 포함할 수 있다. 예를 들어, 제2 지지 플레이트 는, 플렉서블 디스플레이(예: 도 2의 플렉서블 디스플레이271)의 일부(예: 도 14b의 제2 영역)를 지지함으로써, 플렉서블 디스플레이가 접히는 곡률을 줄일 수 있다. 예를 들어, 제2 지지 플레이트 는, 연성 인쇄 회로 기판 위(예: +z 방향)에 배치될 수 있다. 도 4b를 참조하면, 제2 힌지 어셈블리는, 2개의 회전 축들에 대하여 회전 운동을 하도록 구성될 수 있다. 예를 들어, 제2 힌지 어셈블리는, 도 4a 내에 도시된 구성요소들을 통해, 1 자유도를 가질 수 있다. 예를 들어, 2개의 회전 축들은, 제1 회전 축 및 제2 회전 축을 포함할 수 있다. 예를 들어, 제1 회전 부재는, 제1 회전 축에 대하여 회전 가능할 수 있다. 예를 들어, 제1 암 및 제2 암은, 제1 회전 축에 대하여, 약 90도 회전될 수 있다. 제1 회전 부재는, 제1 회전 축에 대하여 회전 운동 을 할 수 있으므로, 1 자유도를 가질 수 있다. 예를 들어, 제2 회전 부재는, 제2 회전 축에 대하여 회전 가능할 수 있다. 예를 들어, 제1 암 서포트 및 제2 암 서포트는, 제2 회전 축에 대하여, 약 90도 회전될 수 있다. 예를 들어, 제2 회전 부 재는, 연결 부재의 슬롯(예: 도 9a의 슬롯) 내에 삽입되는 돌기(예: 도 9a의 돌기)를 포함 할 수 있다. 예를 들어, 제2 회전 부재는, 슬롯을 따라서 직선 운동을 할 수 있다. 제2 회전 부재 는, 제2 회전 축에 대하여 회전 운동을 할 수 있고, 슬롯을 따라서 직선 운동을 할 수 있으므로, 2 자유도를 가질 수 있다. 하기 그뤼블러-쿠츠바흐 방정식(Gruebler- Kutzbach's equation)인 [수학 식 1]에 따를 때, 제2 힌지 어셈블리는, 1 자유도를 가지고 거동할 수 있다. 수학식 1"}
{"patent_id": "10-2023-0181263", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(DOF: 자유도, N: 링크의 수, P1: 1 자유도 조인트 수, P2: 2 자유도 조인트 수) 예시적인 제2 힌지 어셈블리에 대한 자유도를 계산하면(참조: 3(3-1)-2x2-1=1), 1 자유도가 계산될 수 있 다. 이하, 제2 힌지 어셈블리의 구성요소들의 구조와 기능이 도면을 참조하여 설명된다. 도 5a는, 예시적인 제2 힌지 어셈블리의 제1 회전 부재를 도시한다. 도 5b는, 예시적인 제2 힌지 어셈블리의 가 이드 부재를 도시한다. 도 5c는, 도 5a 내에 도시된 제1 회전 부재와 도 5b 내에 도시된 가이드 부재가 결합된 상태를 도시한다. 도 5a를 참조하면, 제1 회전 부재는, 제1 암 및 제2 암을 포함할 수 있다. 예를 들어, 제1 암 의 구조 및 제2 암의 구조는, 제2 폴딩 축(예: 도 3a의 제2 폴딩 축)에 대하여 대칭일 수 있다. 예를 들어, 제1 암 및 제2 암은, 제2 폴딩 축을 사이에 두고, 서로 대칭으로 배치될 수 있다. 예를 들어, 제1 회전 부재는, 제1 하우징(예: 도 3a의 제1 하우징) 및 제3 하우징(예: 도 3a의 제3 하우징)에 고정되고, 복수의 제2 연동 기어들(예: 도 3a의 복수의 제2 연동 기어들)과 연동될 수 있 다. 예를 들어, 제1 회전 부재는, 제2 힌지 어셈블리(예: 도 3a의 제2 힌지 어셈블리)의 동작을 제1 하우징 및/또는 제3 하우징에 전달하도록 구성될 수 있다. 예를 들어, 제1 회전 부재는, 폴더블 하우징(예: 도 3a의 폴더블 하우징)에 결합될 수 있다. 예를 들 어, 제1 암은, 제3 하우징에 결합될 수 있다. 예를 들어, 제2 암은, 제1 하우징 에 결합될 수 있다. 예를 들어, 제1 암 및 제2 암은, 스크류(예: 도 4a의 스크류(S))가 삽입되는 적어도 하나의 관통 홀(501, 502)을 포함할 수 있다. 예를 들어, 스크류(S)가 제1 암의 적어도 하나의 제1 관통 홀 을 통과하여 제3 지지부재(예: 도 3a의 제3 지지부재)에 삽입됨으로써, 제1 암이 제3 하우징에 결합될 수 있다. 예를 들어, 스크류(S)가 제2 암의 적어도 하나의 제2 관통 홀을 통과하여 제1 지지부재(예: 도 3a의 제1 지지부재)에 삽입됨으로써, 제2 암이 제1 하우징에 결합될 수 있다. 예를 들어, 제1 암은, 제1 부분 및 제2 부분을 포함할 수 있다. 예를 들어, 제1 부분은, 제3 지지부재에 결합되는 제1 암의 부분일 수 있다. 예를 들어, 적어도 하나의 제1 관통 홀은, 제1 부분 내에 형성될 수 있다. 예를 들어, 제2 부분은, 제1 부분으로부터 제2 폴딩 축을 향하여 돌출될 수 있다. 예를 들어, 제2 부분의 사이즈는, 제1 부분의 사이즈보다 작을 수 있다. 예 를 들어, 제1 부분은, 연결 부재(예: 도 4a의 연결 부재)의 일부가 놓이는(placed) 제1 함몰부 (511a)를 포함할 수 있다. 예를 들어, 제1 함몰부(511a) 상에 연결 부재가 결합됨으로써, 연결 부재 의 상면(예: +z 방향을 향하는 면)과 제1 암의 상면은, 실질적으로 동일한 평면을 형성할 수 있다. 예를 들어, 제2 암은, 제3 부분 및 제4 부분을 포함할 수 있다. 예를 들어, 제3 부분은, 제1 지지부재에 결합되는 제2 암의 부분일 수 있다. 예를 들어, 적어도 하나의 제2 관통 홀은, 제3 부분 내에 형성될 수 있다. 예를 들어, 제4 부분은, 제3 부분으로부터 제2 폴딩 축을 향하여 돌출될 수 있다. 예를 들어, 제4 부분의 사이즈는, 제3 부분의 사이즈보다 작을 수 있다. 예 를 들어, 제3 부분은, 연결 부재의 일부가 놓이는(placed) 제2 함몰부(513a)를 포함할 수 있다. 예를 들어, 제2 함몰부(513a) 상에 연결 부재가 결합됨으로써, 연결 부재의 상면과 제2 암의 상면은, 실질적으로 동일한 평면을 형성할 수 있다. 예를 들어, 제1 회전 부재는, 로터리 레일(rotary rail)을 포함할 수 있다. 예를 들어, 로터리 레일 은, 가이드 부재(예: 도 5b의 가이드 부재)의 가이드 홈(예: 도 5b의 가이드 홈) 내에 삽입되고, 폴더블 하우징에 가해지는 외력에 기반하여, 가이드 홈을 따라 이동할 수 있다. 예를 들어, 로터리 레일은, 일정 곡률을 가지도록 굴곡된 돌기 형태를 가질 수 있으나, 이에 제한되지 않는다. 로터리 레일은, 가이드 홈을 따라 이동함으로써, 제1 회전 부재의 회전 운동이 가능할 수 있다. 예를 들어, 제1 암은, 제1 로터리 레일을 포함할 수 있다. 예를 들어, 제1 로터리 레일은, 제2 부분의 양 면 상에 형성될 수 있다. 예를 들어, 제1 로터리 레일은, 제1 레일(531a) 및 제2 레일 (531b)을 포함할 수 있다. 예를 들어, 제1 레일(531a)은, 제2 부분의 일 면(예: +y 방향을 향하는 면) 상 에 형성될 수 있다. 예를 들어, 제2 레일(531b)은, 제2 부분의 다른 면(예: -y 방향을 향하는 면) 상에 형 성될 수 있다. 예를 들어, 제2 부분은, 제1 로터리 레일의 형상에 대응하도록, 부분적으로 곡률을 가 질 수 있다. 예를 들어, 제2 암은, 제2 로터리 레일을 포함할 수 있다. 예를 들어, 제2 로터리 레일은, 제4 부분의 양 면 상에 형성될 수 있다. 예를 들어, 제2 로터리 레일은, 제3 레일(532a) 및 제4 레일 (532b)을 포함할 수 있다. 예를 들어, 제3 레일(532a)은, 제4 부분의 일 면(예: +y 방향을 향하는 면) 상 에 형성될 수 있다. 예를 들어, 4 레일은, 제4 부분의 다른 면(예: -y 방향을 향하는 면) 상에 형성될 수 있다. 예를 들어, 제4 부분은, 제2 로터리 레일의 형상에 대응하도록, 부분적으로 곡률을 가질 수 있 다. 예를 들어, 제1 회전 부재는, 가이드 부재와 결합될 수 있다. 예를 들어, 로터리 레일은, 가이 드 부재의 가이드 홈 내에 삽입될 수 있다. 도 5b를 참조하면, 가이드 부재는, 제1 가이드 부재 및 제2 가이드 부재를 포함할 수 있다. 예 를 들어, 가이드 부재는, 제1 회전 부재(예: 도 5a의 제1 회전 부재)의 회전을 가이드할 수 있다. 예 를 들어, 가이드 부재는, 로터리 레일(예: 도 5a의 로터리 레일)이 삽입되고, 로터리 레일의 이 동을 가이드하기 위한 가이드 홈을 포함할 수 있다. 예를 들어, 가이드 홈의 형상은, 로터리 레일 의 형상에 대응할 수 있다. 예를 들어, 가이드 부재는, 제2 힌지 커버(예: 도 4a의 제2 힌지 커버)에 결합될 수 있다. 예를 들어, 제1 가이드 부재 및 제2 가이드 부재는, 스크류(S)가 삽입되는 적어도 하나의 관통 홀(503, 504)을 포함할 수 있다. 예를 들어, 스크류(S)가 제1 가이드 부재의 적어도 하나의 제3 관통 홀을 통 과하여 제2 힌지 커버에 삽입됨으로써, 제1 가이드 부재가 제2 힌지 커버에 결합될 수 있다. 예 를 들어, 스크류(S)가 제2 가이드 부재의 적어도 하나의 제4 관통 홀을 통과하여 제2 힌지 커버(31 2)에 삽입됨으로써, 제2 가이드 부재가 제2 힌지 커버에 결합될 수 있다. 예를 들어, 제1 가이드 부재는, 제1 가이드 홈을 포함할 수 있다. 예를 들어, 제1 가이드 홈은, 제1 암의 제1 레일(예: 도 5a의 제1 레일(531a))을 수용할 수 있는 제1 홈(541a) 및 제2 암의 제3레일(예: 도 5a의 제3 레일(532a))을 수용할 수 있는 제2 홈(541b)을 포함할 수 있다. 예를 들어, 제1 레일 (531a)은, 제1 홈(541a) 내에 삽입된 상태로, 제1 홈(541a)을 따라서 이동할 수 있다. 예를 들어, 제3 레일 (532a)은, 제2 홈(541b) 내에 삽입된 상태로, 제2 홈(541b)을 따라서 이동할 수 있다. 예를 들어, 제2 가이드 부재는, 제2 가이드 홈을 포함할 수 있다. 예를 들어, 제2 가이드 홈은, 제1 암의 제2 레일(예: 도 5a의 제2 레일(531b))을 수용할 수 있는 제3 홈(542a) 및 제2 암의 제4 레일(예: 도 5a의 제4 레일(532b))을 수용할 수 있는 제4 홈(542b)을 포함할 수 있다. 예를 들어, 제2 레일 (531b)은, 제3 홈(542a) 내에 삽입된 상태로, 제3 홈(542a)을 따라서 이동할 수 있다. 예를 들어, 제4 레일 (532b)은, 제4 홈(542b) 내에 삽입된 상태로, 제4 홈(542b)을 따라서 이동할 수 있다. 예를 들어, 제2 가이드 부재는, 복수의 제2 연동 기어들(예: 도 3a의 복수의 제2 연동 기어들)의 샤 프트들이 결합될 수 있는 개구들을 포함할 수 있다. 예를 들어, 복수의 제2 연동 기어들이 6개의 기 어들을 포함하는 경우, 제2 가이드 부재는, 6개의 개구들을 포함할 수 있다. 복수의 제2 연동 기어들 의 샤프트들은, 제2 가이드 부재의 개구들 내에서 회전될 수 있다. 도 5c를 참조하면, 제2 부분의 사이즈는, 제1 부분의 사이즈보다 작고, 제4 부분의 사이즈는, 제3 부분의 사이즈보다 작기 때문에, 제1 암과 제2 암 사이에 가이드 부재가 결합될 수 있 는 공간이 형성될 수 있다. 예를 들어, 제1 가이드 부재는, 제1 회전 부재의 일 측(예: +y 방향)에 결합될 수 있다. 예를 들어, 제1 가이드 부재는, 제2 부분 및 제4 부분의 상기 일 측에 결합될 수 있다. 예를 들어, 제2 가이드 부재는, 제2 회전 부재의 다른 측(예: -y 방향)에 결합될 수 있다. 예를 들어, 제2 가이드 부재는, 제2 부분 및 제4 부분의 상기 다른 측에 결합될 수 있다. 예를 들어, 제1 가이드 부재와 제2 가이드 부재는, 제2 부분 및 제4 부분을 사이에 두고, 제2 폴딩 축이 연장되는 방향(예: y축 방향)을 따라서 서로 이격될 수 있다. 예를 들어, 로터리 레일이 가이드 홈을 따라서 이동함으로써, 제1 회전 부재가 회전될 수 있다. 예를 들어, 제1 하우징(예: 도 3a의 제1 하우징) 및 제3 하우징(예: 도 3a의 제3 하우징)이 펼쳐진 제1 상태 또는 제2 상태 내에서, 제1 암은, 제2 폴딩 축에 대하여 시계 방향으로 회전될 수 있고, 제2 암은, 제2 폴딩 축에 대하여 반시계 방향으로 회전될 수 있다. 예를 들어, 제1 하우징 및 제3 하우징이 접힌 제3 상태 내 에서, 제1 암은, 제2 폴딩 축에 대하여 반시계 방향으로 회전될 수 있고, 제2 암은, 제2 폴딩 축에 대하여 시계 방향으로 회전될 수 있다. 도 6a는, 예시적인 제2 힌지 어셈블리를 도 5c의 A-A'를 따라서 절단한 단면도이다. 도 6b는, 제1 암 및 제2 암 이 연동되지 않은 경우, 제1 회전 부재의 동작을 도시한다. 도 6c는, 제1 암 및 제2 암이 연동된 경우, 제1 회 전 부재의 동작을 도시한다. 도 6a를 참조하면, 가이드 부재는, 제1 회전 부재의 회전을 가이드할 수 있다. 예를 들어, 제1 암 의 제1 레일(531a)은, 제1 가이드 부재의 제1 홈(541a) 내에 삽입될 수 있고, 제2 암의 제3 레 일(532a)은, 제1 가이드 부재의 제2 홈(541b) 내에 삽입될 수 있다. 폴더블 하우징에 가해지는 외력 에 의해, 제1 레일(531a)은, 제1 홈(541a)을 따라서 슬라이드되고, 제2 레일(531b)은, 제2 홈(541b)을 따라서 슬라이드될 수 있다. 예를 들어, 제1 회전 부재는, 제1 회전 축에 대하여 회전될 수 있다. 예를 들어, 제1 회전 축은, 제1 암의 회전 축인 제1 축 및 제2 암의 회전 축인 제2 축을 포함할 수 있다. 예를 들어, 제1 암이 제1 축에 대하여 시계 방향(clockwise)으로 회전됨으로써, 제3 하우징(예: 도 3a의 제3 하우징)이 시계 방향으로 회전될 수 있다. 예를 들어, 제2 암이 제2 축에 대하여 반시 계 방향(counterclockwise)으로 회전됨으로써, 제1 하우징(예: 도 3a의 제1 하우징)이 반시계 방향으로 회 전될 수 있다. 제1 하우징의 반시계 방향으로의 회전 및 제3 하우징의 시계 방향으로의 상기 회전에 의해, 제1 하우징과 제3 하우징은, 접힐(folded) 수 있다. 예를 들어, 제1 암이 제1 축에 대하여 반시계방향으로 회전됨으로써, 제3 하우징이 반시계 방향으로 회전될 수 있다. 예를 들어, 제2 암 이 제2 축에 대하여 시계 방향으로 회전됨으로써, 제1 하우징이 시계 방향으로 회전될 수 있다. 제1 하우징의 시계 방향으로의 회전 및 제3 하우징의 반시계 방향으로의 상기 회전에 의해, 제1 하우 징과 제3 하우징은, 펼쳐질(unfolded) 수 있다. 도 6b를 참조하면, 제1 회전 부재가 가이드 부재만을 이용하여 회전될 경우, 제1 하우징의 회전 및 제3 하우징의 회전이 서로 연동되지 않을 수 있다. 예를 들어, 제1 암의 회전 및 제2 암의 회전을 연동시키는 구조(예: 복수의 제2 연동 기어들) 및 제1 암의 회전 및 제2 암의 회전을 제 한하는 구조(예: 연결 부재의 슬롯)가 없을 경우, 제1 암 및 제2 암은, 각각 독립적으로 회전하고, 가이드 부재로부터 이탈되거나, 플렉서블 디스플레이(예: 도 2의 플렉서블 디스플레이) 및 /또는 제2 힌지 어셈블리에 손상을 가할 수 있다. 예를 들어, 제1 암 및 제2 암이 연동되지 않은 경우, 제1 암 및 제2 암은, 각각 독립적으 로 회전할 수 있다. 도 6b의 601을 참조하면, 제2 암이 회전되더라도, 제1 암은, 회전되지 않을 수 있다. 도 6b의 602를 참조하면, 제1 암의 회전 각도는, 제2 암의 회전 각도와 상이할 수 있다. 도 6b 의 603을 참조하면, 제2 암(또는 제1 암)의 회전 각도가 너무 클 경우(예: 90도를 초과하는 둔각), 제2 암(또는 제1 암)이 가이드 홈으로부터 이탈될 수 있다. 도 6c를 참조하면, 제1 암 및 제2 암이 연동될 경우, 제1 암의 회전 각도는, 제2 암의 회 전 각도와 대응할 수 있다. 예를 들어, 도 6c의 604는, 제1 상태(또는 제2 상태) 내에서, 제1 암 및 제2 암을 도시한다. 예를 들어, 도 6c의 607은, 제3 상태 내에서, 제1 암 및 제2 암을 도시한다. 예 를 들어, 전자 장치가 제1 상태(또는 제2 상태)로부터 제3 상태로 전환될 때, 제1 회전 부재는, 도 6c의 605 및 도 6c의 606를 거칠 수 있다. 예를 들어, 도 6c의 604를 참조하면, 제1 상태 내에서, 제1 암 및 제2 암은, 실질적으로 동일한 평면 상에 배치될 수 있다. 예를 들어, 폴더블 하우징에 가해지는 외력에 의해, 제1 암 및 제2 암은, 가이드 부재의 가이드 홈을 따라서 회전될 수 있다. 도 6c의 605 및 도 6c의 606을 참조하면, 제1 암 및 제2 암은, 서로 연동되어 회전될 수 있다. 예를 들 어, 제1 암의 회전은, 제2 암의 회전을 야기함으로써, 제2 암의 회전 각도는, 제1 암의 회 전 각도에 대응할 수 있다. 도 6c 내에 도시된 바와 같이, 제1 암 및 제2 암이 서로 연동된 상태로 회전됨에 따라, 제1 하우징(예: 도 3a의 제1 하우징) 및 제3 하우징(예: 도 3a의 제3 하우징)이 서로 연동된 상태로 회전될 수 있다. 예를 들어, 제1 하우징과 제3 하우징의 접히거나 펼쳐지는 동작이 안 정적으로 수행될 수 있다. 이하, 제1 하우징의 회전과 제3 하우징의 회전을 연동시키기 위한 구조가 설명된다. 도 7a, 7b, 및 도 7c를 참조하여, 복수의 연동 기어들의 맞물림 구조가 설명된다. 도 7a는, 예시적인 제1 힌지 어셈블리의 복수의 제1 연동 기어들을 도시한다. 도 7b는, 예시적인 제2 힌지 어셈 블리의 복수의 제2 연동 기어들을 도시한다. 도 7c는, 예시적인 제1 힌지 어셈블리 및 예시적인 제2 힌지 어셈 블리를, 개략적으로 도시한다. 도 7a를 참조하면, 제1 힌지 어셈블리는, 복수의 제1 연동 기어들을 포함할 수 있다. 예를 들어, 복 수의 제1 연동 기어들은, 제1 기어, 제2 기어, 제3 기어, 및 제4 기어를 포함할 수 있다. 예를 들어, 제1 기어는, 복수의 제1 연동 기어들 중 일 단부에 배치될 수 있고, 제2 기어(70 2)는, 복수의 제1 연동 기어들 중 상기 일 단부에 반대인 다른 단부에 배치될 수 있다. 예를 들어, 제3 기 어 및 제4 기어는, 제1 기어 및 제2 기어 사이에 배치될 수 있다. 예를 들어, 제1 기어의 회전 방향은, 제2 기어의 회전 방향과 상이할 수 있다. 예를 들어, 제1 기어 가 시계 방향(또는 반시계 방향)으로 회전될 때, 제2 기어는, 반시계 방향(또는 시계 방향)으로 회전 될 수 있다. 예를 들어, 제3 기어는, 제1 기어와 제4 기어 사이에 배치될 수 있다. 예를 들어, 제4 기어 는, 제3 기어와 제2 기어 사이에 배치될 수 있다. 예를 들어, 제3 기어는, 제1 기어 및 제4 기어와 맞물릴(engaged with) 수 있다. 예를 들어, 제4 기어는, 제3 기어 및 제2 기어 와 맞물릴 수 있다. 예를 들어, 제1 기어가 시계 방향으로 회전될 때, 제1 기어와 맞물린 제3 기어는, 반시계 방향으로 회전될 수 있다. 제3 기어가 반시계 방향으로 회전됨에 따라, 제3 기어 와 맞물린 제4 기어는, 시계 방향으로 회전될 수 있다. 제4 기어가 시계 방향으로 회전됨에 따 라, 제4 기어와 맞물린 제2 기어는, 반시계 방향으로 회전될 수 있다. 서로 이격된 제1 기어와 제2 기어는, 상이한 방향으로 회전됨으로써, 제1 하우징(예: 도 3a의 제1 하우징) 및 제2 하우징(예: 도 3a의 제2 하우징)의 접히거나 펼쳐지는 동작이 가능할 수 있다. 도 7b를 참조하면, 제2 힌지 어셈블리는, 복수의 제2 연동 기어들을 포함할 수 있다. 예를 들어, 복 수의 제2 연동 기어들은, 제5 기어, 제6 기어, 제7 기어, 제8 기어, 제9 기어, 및 제10 기어를 포함할 수 있다. 예를 들어, 복수의 제2 연동 기어들은, 복수의 제1 연동 기어들(예: 도 7a의 복수의 제1 연동 기어들)보다 많은 연동 기어들을 포함할 수 있다. 예를 들어, 복수의 제1 연동 기어들은, 4개의 연동 기어들을 포함할 수 있고, 복수의 제2 연동 기어들은, 6개의 연동 기어들을 포 함할 수 있다. 예를 들어, 복수의 제1 연동 기어들은 2개의 아이들 기어들(예: 제3 기어, 및 제4 기 어)을 포함할 수 있고, 복수의 제2 연동 기어들은 4개의 아이들 기어들(예: 제7 기어, 제8 기어 , 제9 기어, 및 제10 기어)을 포함할 수 있다. 예를 들어, 복수의 제2 연동 기어들에 포함 된 아이들 기어들(예: 제7 기어, 제8 기어, 제9 기어, 및 제10 기어)의 제2 개수(n2)는 복수의 제1 연동 기어들에 포함된 아이들 기어들(예: 제3 기어, 및 제4 기어)의 제1 개수(n1) 보다 짝수(even number)개 이상(예: 2개, 4개, 8개) 많을 수 있다. 예를 들어, 제5 기어는, 복수의 제2 연동 기어들 중 일 단부에 배치될 수 있고, 제6 기어는, 복 수의 제2 연동 기어들 중 상기 일 단부에 반대인 다른 단부에 배치될 수 있다. 예를 들어, 제7 기어, 제8 기어, 제9 기어, 및 제10 기어는, 제5 기어와 제6 기어 사이에 배치될 수 있다. 예를 들어, 제7 기어는, 제5 기어와 제6 기어 사이에서, 제5 기어 및 제9 기어와 맞 물릴 수 있다. 예를 들어, 제8 기어는, 제5 기어와 제6 기어 사이에서, 제6 기어 및 제10 기어와 맞물릴 수 있다. 예를 들어, 서로 맞물린 제9 기어 및 제10 기어는, 제7 기어와 제 8 기어 사이에 배치될 수 있다. 예를 들어, 제9 기어는, 제7 기어 및 제10 기어와 맞물릴 수 있다. 예를 들어, 제10 기어는, 제8 기어 및 제9 기어와 맞물릴 수 있다. 예를 들어, 복수의 제2 연동 기어들은, 제5 기어 - 제7 기어 - 제9 기어 - 제10 기어 - 제8 기어 - 제6 기어 순서로 연동되도록 배치될 수 있다. 예를 들어, 제5 기어의 회전 방향은, 제6 기어의 회전 방향과 상이할 수 있다. 예를 들어, 제5 기어 가 시계 방향(또는 반시계 방향)으로 회전될 때, 제6 기어는, 반시계 방향(또는 시계 방향)으로 회전 될 수 있다. 예를 들어, 제5 기어가 시계 방향으로 회전될 때, 제5 기어와 맞물린 제7 기어는, 반시계 방향 으로 회전될 수 있다. 제7 기어가 반시계 방향으로 회전됨에 따라, 제7 기어와 맞물린 제9 기어(70 9)는, 시계 방향으로 회전될 수 있다. 제9 기어가 시계 방향으로 회전됨에 따라, 제9 기어와 맞물린 제10 기어는, 반시계 방향으로 회전될 수 있다. 제10 기어가 반시계 방향으로 회전됨에 따라, 제10 기어와 맞물린 제8 기어는, 시계 방향으로 회전될 수 있다. 제8 기어가 시계 방향으로 회전됨에 따라, 제8 기어와 맞물린 제6 기어는, 반시계 방향으로 회전될 수 있다. 서로 이격된 제5 기어 와 제6 기어는, 상이한 방향으로 회전됨으로써, 제1 하우징(예: 도 3a의 제1 하우징) 및 제3 하우징 (예: 도 3a의 제3 하우징)의 접히거나 펼쳐지는 동작이 가능할 수 있다. 예를 들어, 제1 힌지 어셈블리는 제1 기어의 회전 축(701a), 제2 기어의 회전 축(702a), 제3 기어의 회전 축(703a), 제4 기어의 회전 축(704a)을 포함할 수 있다. 제2 힌지 어셈블리는 제5 기어의 회전 축(705a), 제6 기어의 회전 축(706a), 제7 기어의 회전 축(707a), 제8 기어 의 회전 축(708a), 제9 기어의 회전 축(709a), 제10 기어의 회전 축(710a)을 포함할 수 있다. 예를 들어, 제2 힌지 어셈블리는 제1 힌지 어셈블리보다 많은 회전 축을 포함할 수 있다. 예를 들어, 제2 힌지 어셈블리의 회전 축의 개수는 제1 힌지 어셈블리의 회전 축의 개수보다 짝수(even number)개 이 상(예: 2개, 4개, 8개) 많을 수 있다. 도 7c는, 복수의 제1 연동 기어들이 수용된 제1 힌지 커버와 복수의 제2 연동 기어들이 수용된 제2 힌지 커버를, 개략적으로 도시한다. 예를 들어, 제3 상태 내에서, 제1 하우징(예: 도 3a의 제1 하우징 )과 제3 하우징(예: 도 3a의 제3 하우징) 사이에 제2 하우징(예: 도 3a의 제2 하우징)이 위치될 수 있도록, 제2 힌지 커버의 사이즈는, 제1 힌지 커버의 사이즈보다 클 수 있다. 다시 도 3a를 참조하면, 제1 상태 내에서, 제1 지지부재, 제2 지지부재, 및 제3 지지부재는, 실 질적으로 동일한 평면을 형성할 수 있다. 만약, 제1 상태 내에서, 제1 지지부재, 제2 지지부재, 및 제3 지지부재가 실질적으로 동일한 평면을 형성하지 않을 경우, 상기 지지부재들(211, 221, 231) 위(예: +z 방향)에 배치된 플렉서블 디스플레이(예: 도 2의 플렉서블 디스플레이)의 표면이 평평하지 않을 수 있 다. 플렉서블 디스플레이의 표면이 평평하지 않을 경우, 플렉서블 디스플레이의 표시 영역 내에 표시 되는 화면의 시인성이 열화될 수 있다. 예를 들어, 제1 지지부재, 제2 지지부재, 및 제3 지지부재는, 실질적으로 동일한 두께를 가질 수 있다. 제1 지지부재, 제2 지지부재, 및 제3 지지부재 가 실질적으로 동일한 두께를 가짐에 따라, 제1 힌지 커버의 두께 및 제2 힌지 커버의 두께는, 실질적으로 동일할 수 있다. 다시 도 7c를 참조하면, 제2 힌지 커버의 두께(312a)는, 제1 힌지 커버의 두께(311a)와 실질적으로 동일할 수 있다. 예를 들어, 복수의 제1 연동 기어들의 개수(예: 4개)와 복수의 제2 연동 기어들의 개수(예: 6개)가 상이하기 때문에, 제2 힌지 커버의 폭(312b)은, 제1 힌지 커버의 폭(311b)과 상이할 수 있다. 예를 들어, 제2 힌지 커버의 폭(312b)은, 제1 힌지 커버의 폭(311b)보다 넓을 수 있다. 예를 들어, 복수의 제1 연동 기어들은, 폴더블 하우징의 두께 및 연동 기어의 최소 치수를 고려하여, 4개의 연동 기어들을 포함할 수 있다. 예를 들어, 복수의 제2 연동 기어들은, 폴더블 하우징의 두께, 제2 힌지 커버의 두께(312a), 폭(312b), 및 연동 기어의 최소 치수를 고려하여, 6개의 연동 기어들을 포함 할 수 있다. 예를 들어, 복수의 제2 연동 기어들이 6개 미만(예: 4개)의 연동 기어들을 포함할 경우, 6개 미만의 연동 기어들은, 제2 힌지 커버의 사이즈에 적합하지 않을 수 있다. 예를 들어, 4개의 연동 기어들이 제2 힌지 커버의 폭(312b)을 채울 수 있도록, 4개의 연동 기어들의 직경을 설계할 경우, 제2 힌지 커버의 두께 (312a)가 부족할 수 있다. 4개의 연동 기어들을 수용하기 위해 제2 힌지 커버의 두께(312a)를 증가시킬 경 우, 폴더블 하우징의 두께 증가를 야기할 수 있다. 예를 들어, 제2 힌지 커버의 두께(312a)에 대응하 는 직경을 가지는 4개의 연동 기어들이 제2 힌지 커버의 양 단에 위치되도록 배치되는 경우, 4개의 연동 기어들이 서로 맞물리지 못할 수 있다. 예를 들어, 복수의 제2 연동 기어들이 6개 초과(예: 8개)의 연동 기어들을 포함할 경우, 6개 초과의 연동 기어들은, 연동 기어의 최소 치수에 적합하지 않을 수 있다. 예를 들어, 8개의 연동 기어들이 제2 힌지 커버 내에 수용될 경우, 8개의 연동 기어들의 직경은, 너무 작기 때문에, 가공하기 어려울 정도로 작아질 수 있고, 낮은 내구성을 가질 수 있다. 예를 들어, 8개의 연동 기어들을 위한 샤프트들의 치수가 너무 작게 형성됨 으로써, 상기 샤프트들의 가공이 어렵고, 내구성이 저하될 수 있다. 예를 들어, 복수의 제2 연동 기어들은, 6개의 연동 기어들을 포함할 수 있다. 6개의 연동 기어들은, 제2 힌지 커버 내에 수용되기 적합하고, 폴더블 하우징의 두께 증가를 야기하지 않으며, 가공 가능한 직 경을 가질 수 있다. 다시 도 7b를 참조하면, 복수의 제2 연동 기어들은, 짝을 이룰 수 있다. 예를 들어, 제5 기어는, 제6 기어와 페어(paired with)될 수 있다. 예를 들어, 제7 기어는, 제8 기어와 페어될 수 있다. 예 를 들어, 제9 기어는, 제10 기어와 페어될 수 있다. 예를 들어, 제5 기어의 사이즈는, 제6 기어 의 사이즈와 실질적으로 동일할 수 있다. 예를 들어, 제7 기어의 사이즈는, 제8 기어의 사이즈 와 실질적으로 동일할 수 있다. 예를 들어, 제9 기어의 사이즈는, 제10 기어의 사이즈와 실질적으로 동일할 수 있다. 다시 도 4a를 참조하면, 제2 힌지 커버의 두께가 일정할 경우, 제1 하우징과 제3 하우징의 회전 에 의해, 제2 힌지 커버의 손상이 야기될 수 있다. 도 4a 내에 도시된 바와 같이, 제2 힌지 커버는, 양 단부의 두께가 얇아지는 형상을 가질 수 있다. 예를 들어, 제2 힌지 커버의 양 단부는, 제1 하우징 및 제3 하우징의 회전 곡률에 대응하도록, 부분적으로 굴곡될 수 있다. 예를 들어, 제2 힌지 커버 는, 상기 형상을 가짐으로써, 제1 하우징 및 제3 하우징의 회전에 간섭되지 않을 수 있다. 다시 도 7b를 참조하면, 전술된 바와 같이, 제2 힌지 커버(예: 도 4a의 제2 힌지 커버)의 양 단부의 두께 가 얇아지는 형상을 가지기 때문에, 복수의 제2 연동 기어들은, 제2 힌지 커버의 형상에 대응하도록 배치될 수 있다. 예를 들어, 도 7b 내에 도시되지 않았으나, 플렉서블 디스플레이(예: 도 2의 플렉서블 디스플 레이)는, 제2 힌지 커버의 위(예: +z 방향)에 배치될 수 있다. 제2 힌지 커버로부터 플렉서블 디스플레이를 향하는 방향을 위라 할 때, 제5 기어의 회전 축(705a) 및 제6 기어의 회전 축 (706a)을 연결하는 가상의 제1 직선(L1)은, 제7 기어의 회전 축(707a) 및 제8 기어의 회전 축(708 a)을 연결하는 가상의 제2 직선(L2) 위에 위치될 수 있다. 예를 들어, 제9 기어의 회전 축(709a) 및 제10 기어의 회전 축(710a)을 연결하는 가상의 제3 직선(L3)은, 상기 가상의 제2 직선(L2)위에 위치될 수 있다. 예를 들어, 가상의 제1 직선(L1)은, 가장 위에 위치될 수 있고, 가상의 제2 직선(L2)은, 가장 아래에 위치될 수 있고, 가상의 제2 직선(L2)은, 가상의 제1 직선(L1) 및 가상의 제3 직선(L3) 사이에 위치될 수 있다. 예를 들어, 복수의 제2 연동 기어들은, 제2 힌지 커버의 형상에 대응하도록, 다양한 사이즈들을 가질 수 있다. 예를 들어, 제9 기어 및 제10 기어는, 복수의 제2 연동 기어들 중에서 가장 큰 사이즈 를 가질 수 있다. 예를 들어, 제5 기어 및 제6 기어는, 복수의 제2 연동 기어들 중에서 가장 작 은 사이즈를 가질 수 있다. 예를 들어, 제9 기어의 사이즈(또는 제10 기어의 사이즈)는, 제5 기어 의 사이즈(또는 제6 기어의 사이즈) 및 제7 기어의 사이즈(또는 제8 기어의 사이즈)보다 클 수 있다. 예를 들어, 상기 제5 기어의 사이즈(또는 제6 기어의 사이즈)는, 상기 제7 기어의 사이즈(또는 제8 기어의 사이즈)보다 작을 수 있다. 전술된 복수의 제2 연동 기어들의 배치 구조 및 사이즈에 의해, 복수의 제2 연동 기어들은, 제2 힌지 커버 내에서, 안정적으로 동작될 수 있다. 다시 도 7a를 참조하면, 복수의 제1 연동 기어들도, 제1 힌지 커버의 형상에 대응하도록, 일렬로 배 치되지 않을 수 있다. 예를 들어, 제1 기어의 회전 축(701a) 및 제2 기어의 회전 축(702a)을 연결하 는 가상의 제4 직선(L4)은, 제3 기어의 회전 축(703a) 및 제4 기어의 회전 축(704a)을 연결하는 가상 의 제5 직선(L5)보다 위(예: +z 방향)에 위치될 수 있다. 예를 들어, 제1 기어의 사이즈는, 제2 기어(70 2)의 사이즈와 실질적으로 동일할 수 있다. 예를 들어, 제3 기어의 사이즈는, 제4 기어의 사이즈와 실질적으로 동일할 수 있다. 예를 들어, 제1 기어의 사이즈(또는 제2 기어의 사이즈)는, 제3 기어 의 사이즈(또는 제4 기어의 사이즈)와 상이할 수 있다. 이하, 제1 회전 부재와 제2 회전 부재의 연동 구조가 설명된다. 도 8a는, 예시적인 제1 힌지 어셈블리의 샤프트들 및 예시적인 제2 힌지 어셈블리의 샤프트들을 도시한다. 도 8b는, 예시적인 제2 힌지 어셈블리의 제2 회전 부재를 도시한다. 도 8a 내에 도시된 제1 힌지 어셈블리에서, 복수의 제1 연동 기어들 중, 양 단부에 배치된, 제1 기어 및 제4 기어 사이의 기어들은, 생략되었다. 도 8a 내에 도시된 제2 힌지 어셈블리에서, 복수의 제2 연동 기어들 중, 양 단부에 배치된 제5 기어 및 제6 기어 사이의 기어들은, 생략되었다. 도 8a를 참조하면, 제1 힌지 어셈블리는, 제1 샤프트 및 제2 샤프트를 포함할 수 있다. 예를 들 어, 제1 샤프트는, 제1 기어에 연결될 수 있다. 예를 들어, 제2 샤프트는, 제2 기어에 연 결될 수 있다. 예를 들어, 제2 힌지 어셈블리는, 제3 샤프트 및 제4 샤프트를 포함할 수 있다. 예를 들어, 제3 샤프트는, 제6 기어에 연결될 수 있다. 예를 들어, 제4 샤프트는, 제10 기어에 연결될 수 있다. 예를 들어, 제2 힌지 어셈블리의 사이즈가 제1 힌지 어셈블리의 사이즈보다 크기 때문에, 제3 샤프트 와 제4 샤프트 사이의 제1 간격은, 제1 샤프트와 제2 샤프트 사이의 제2 간격 보다 넓을 수 있다. 예를 들어, 상기 제1 간격 내에, 제2 기어 및 제3 기어가 배치될 수 있다. 예를 들어, 상기 제2 간격 내에, 제6 기어, 제7 기어, 제8 기어, 및 제9 기어가 배 치될 수 있다. 예를 들어, 제3 샤프트의 직경(813a) 및 제4 샤프트의 직경(814a)은, 제1 샤프트의 직경(811a) 및 제2 샤프트의 직경(812a)보다 클 수 있다. 예를 들어, 제2 힌지 어셈블리에 의해 회전되는 제1 하 우징(예: 도 3a의 제1 하우징)과 제3 하우징(예: 도 3a의 제3 하우징)의 회동 범위가, 제1 힌지 어셈 블리에 의해 회전되는 제1 하우징과 제2 하우징(예: 도 3a의 제2 하우징)의 회동 범위보다 클 수 있다. 상대적으로 큰 회동 범위를 야기하는 제2 힌지 어셈블리의 경우, 제3 샤프트 및 제4 샤프트 에 가해지는 힘이 상대적으로 클 수 있다. 상기 힘을 견디기 위한 제3 샤프트의 강성 및 제4 샤프트 의 강성을 증가시키기 위해, 제3 샤프트의 직경(813a) 및 제4 샤프트의 직경(814a)은, 제1 샤프 트의 직경(811a) 및 제2 샤프트의 직경(812a)보다 상대적으로 클 수 있다. 도 8b를 참조하면, 제2 회전 부재는, 복수의 제2 연동 기어들의 동작과 연동되어, 회전될 수 있다. 예를 들어, 복수의 제2 연동 기어들의 회전에 의해, 제2 회전 부재의 회전이 야기될 수 있고, 상기 제2 회전 부재의 회전은, 제1 회전 부재의 회전을 야기할 수 있다. 도 8b 내에 도시된 제2 회전 부재는, 제1 암 서포트 및 제2 암 서포트를 포함할 수 있다. 예를 들어, 제1 암 서포트의 구조 및 제2 암 서포트의 구조는, 제2 폴딩 축에 대하여 대칭일 수 있다. 예를 들어, 제1 암 서포트 및 제2 암 서포트는, 제2 폴딩 축을 사이에 두고, 서로 대칭으 로 배치될 수 있다. 예를 들어, 제1 암 서포트는, 제3 샤프트와 결합될 수 있다. 예를 들어, 제1 암 서포트는, 제3 샤프트가 삽입되는 제1 연결부 및 제2 연결부를 포함할 수 있다. 예를 들어, 제3 샤프트는, 제1 연결부에 형성된 제1 개구 및 제2 연결부에 형성된 제2 개구를 관통함 으로써, 제1 암 서포트에 결합될 수 있다. 예를 들어, 제2 암 서포트는, 제4 샤프트와 결합될 수 있다. 예를 들어, 제2 암 서포트는, 제4 샤프트가 삽입되는 제3 연결부 및 제4 연결부 를 포함할 수 있다. 예를 들어, 제3 샤프트는, 제3 연결부에 형성된 제3 개구 및 제4 연결부 에 형성된 제4 개구를 관통함으로써, 제1 암 서포트에 결합될 수 있다. 제3 샤프트 및 제4 샤프트는, 각각 2개의 개구들을 통해, 제1 암 서포트 및 제2 암 서포트와 안정적으로 결합됨으 로써, 비틀림에 의한 제3 샤프트 및 제4 샤프트의 손상이 줄어들 수 있다. 예를 들어, 제2 회전 부재는, 제2 회전 축에 대하여 회전될 수 있다. 예를 들어, 제2 회전 축은, 제1 암 서포트의 회전 축인 제3 축 및 제2 암 서포트의 회전 축인 제4 축을 포함할 수 있다. 예를 들어, 제3 축은, 제3 샤프트와 중첩될 수 있고, 제4 축은, 제4 샤프트 와 중첩될 수 있다. 예를 들어, 외력이 가해짐에 따라, 제1 암 서포트가 제3 축에 대하여 시계 방향으로 회전될 수 있다. 상기 제1 암 서포트의 시계 방향으로의 회전은, 제1 암의 시계 방향으로의 회전을 야기할 수 있다. 예를 들어, 후술될 제1 돌기(예: 도 9b의 제1 돌기)가 제1 슬롯(예: 도 9b의 제1 슬롯) 내에서 이동 함으로써, 제1 암의 시계 방향으로의 회전이 야기될 수 있다. 제1 암 서포트가 제3 축에 대하여 시계 방향으로 회전될 때, 제1 암 서포트에 결합된 제3 샤프트가 회전될 수 있다. 제3 샤프트는, 제3 축과 중첩되므로, 제3 샤프트는, 제자리에서 시계 방향으로 회전될 수 있다. 제3 샤프트의 시계 방향으로의 회전은, 제3 샤프트와 연결된 제5 기어의 시계 방향으로의 회전을 야 기할 수 있다. 복수의 제2 연동 기어들은, 서로 연동되어 동작하므로, 제5 기어의 시계 방향으로의 회전은, 제6 기어의 반시계 방향으로의 회전을 야기할 수 있다. 제6 기어의 반시계 방향으로의 회전 은, 제6 기어와 연결된 제4 샤프트의 반시계 방향으로의 회전을 야기할 수 있다. 제4 샤프트는, 제4 축과 중첩되므로, 제4 샤프트는, 제자리에서 반시계 방향으로 회전될 수 있다. 제4 샤프트 가 반시계 방향으로 회전될 때, 제4 샤프트에 결합된 제2 암 서포트가 반시계 방향으로 회전될 수 있 다. 제4 샤프트의 반시계 방향으로의 회전은, 제2 암의 시계 방향으로의 회전을 야기할 수 있다. 예 를 들어, 후술될 제2 돌기가 제2 슬롯 내에서 이동함으로써, 제2 암의 반시계 방향으로의 회전 이 야기될 수 있다. 전술된 과정에 의해, 제1 하우징과 제3 하우징이 연동하여 접힐 수 있다. 전술된 과정에서, 회전 방향이 반대로 바뀔 경우, 제1 하우징과 제3 하우징이 연동하여 펼쳐질 수 있다. 도 9a는, 예시적인 제1 힌지 어셈블리의 제1 회전 부재와 제2 회전 부재의 결합 관계를 도시한다. 도 9b는, 예 시적인 제2 힌지 어셈블리를 도시한다. 도 9c는, 제1 상태 또는 제2 상태 내에서, 예시적인 제1 힌지 어셈블리 를, 도 9b의 B-B'를 따라서 절단한 단면도이다. 도 9d는, 제3 상태 내에서, 예시적인 제1 힌지 어셈블리를, 도 9b의 B-B'를 따라서 절단한 단면도이다. 도 9a 및 도 9b를 참조하면, 연결 부재는, 제1 회전 부재 및 제2 회전 부재를 연동시키고, 제1 회전 부재의 제한 각도 및 제2 회전 부재의 회전 각도를 제한할 수 있다. 예를 들어, 연결 부재는, 제1 회전 부재 및 제2 회전 부재 각각에 결합될 수 있다. 예를 들어, 제1 연결 부재 및 제2 연결 부재를 포함할 수 있다. 예를 들어, 제1 연결 부재는, 제1 암 및 제1 암 서포트에 각각 결합될 수 있다. 예를 들어, 제1 연결 부재는, 제1 암에 결합될 수 있다. 예를 들어, 연결 부재의 일부는, 제1 함몰부(511a) 상에 결합될 수 있다. 예를 들어, 제1 연결 부재는, 제1 함몰부(511a)에 형성되는 적어도 하 나의 제1 관통 홀과 정렬(aligned with)되는 제5 관통 홀을 포함할 수 있다. 예를 들어, 스크류(예: 도 4a의 스크류(S))는, 서로 정렬된 적어도 하나의 제1 관통 홀 및 제5 관통 홀을 통과하여, 제3 지 지부재(예: 도 4a의 제3 지지부재)에 삽입됨으로써, 제1 암과 제1 연결 부재를 결합할 수 있다. 예를 들어, 연결 부재는, 제2 회전 부재의 돌기가 삽입되는 슬롯을 포함할 수 있다. 예를 들어, 제2 회전 부재가 회전될 때, 돌기는, 슬롯 내에서 이동할 수 있다. 돌기의 이동 범 위는, 슬롯의 길이로 제한되기 때문에, 돌기에 의해, 제1 회전 부재 및 제2 회전 부재의 회전 범위가 제한될 수 있다. 예를 들어, 제1 연결 부재는, 제1 슬롯을 포함할 수 있다. 예를 들어, 제1 암 서포트는, 제1 슬 롯 내에 삽입되는 제1 돌기를 포함할 수 있다. 예를 들어, 제1 돌기는, 제1 슬롯 내에 억 지 끼워(tight fit)짐으로써, 제1 슬롯 내에서 이동 가능하도록, 제1 슬롯에 결합될 수 있다. 예를 들어, 제1 돌기는, 제1 슬롯 내에서 이동 가능하기 때문에, 제1 돌기의 이동 범위는, 제1 슬롯 의 길이로 제한될 수 있다. 예를 들어, 제1 돌기의 이동 범위는, 제1 슬롯의 일 단(921a)으로부 터, 상기 일 단(921a)에 반대인 제1 슬롯의 다른 단(921b)까지 제한될 수 있다. 도 9a 내에 도시된 제1 암, 제1 암 서포트, 및 제1 연결 부재는, 도 9a 내에 도시되지 않은 제2 암(예: 도 9b의 제2 암), 제2 암 서포트(예: 도 9b의 제2 암 서포트), 및 제2 연결 부재(예: 도 9b 의 제2 연결 부재)와 제2 폴딩 축에 대하여 대칭일 수 있다. 제1 암, 제1 암 서포트, 및 제1 연결 부재에 대한 설명들은, 제2 암, 제2 암 서포트, 및 제2 연결 부재에 실질적으로 동일하게 적용될 수 있다. 예를 들어, 제2 연결 부재는, 제2 암과 결합될 수 있다. 예를 들어, 제2 암 서포트는, 제2 연결 부재의 제2 슬롯 내에 삽입되는 제2 돌기를 포함할 수 있다. 도 9b를 참조하면, 적어도 둘의 제2 탄성 부재들은, 제3 샤프트 및 제4 샤프트에 결합될 수 있 다. 예를 들어, 적어도 둘의 제2 탄성 부재들은, 스프링을 포함할 수 있으나, 이에 제한되지 않는다. 예를 들어, 둘 상의 제2 탄성 부재들은, 6개의 스프링들을 포함할 수 있다. 예를 들어, 적어도 둘의 제2 탄성 부재들은, 프릭션 바디와 홀더 사이에서, 압축된 상태로 배치될 수 있다. 예를 들어, 적어도 둘 의 제2 탄성 부재들의 복원력은, 마찰력을 제공함으로써, 후술될 플렉스 모드를 가능하게 할 수 있다. 예를 들어, 홀더는, 적어도 둘의 제2 탄성 부재들을 고정할 수 있다. 예를 들어, 프릭션 바디는, 홀더로부터 제2 폴딩 축의 연장 방향(예: y축 방향)을 따라서 이격된 제1 프릭션 바디 및 제2 프릭션 바디를 포함할 수 있다. 예를 들어, 홀더는, 제1 프릭션 바디와 제2 프릭 션 바디 사이에 배치될 수 있다. 예를 들어, 적어도 둘의 제2 탄성 부재들은, 제1 프릭션 바디 와 홀더 사이 및 제2 프릭션 바디와 홀더 사이에 압축된 상태로 배치될 수 있다. 예를 들어, 제 1 프릭션 바디와 홀더 사이에 3개의 스프링들이 배치될 수 있고, 제2 프릭션 바디와 홀더 사이에 3개의 스프링들이 배치될 수 있다. 홀더 및 제2 프릭션 바디는, 스크류(예: 도 4a의 스크류 (S))에 의해, 제2 힌지 커버(예: 도 4a의 제2 힌지 커버)에 결합될 수 있다. 예를 들어, 커버는, 프 릭션 바디와 접할 수 있다. 예를 들어, 커버는, 제1 프릭션 바디와 접하는 제1 커버 및 제 2 프릭션 바디와 접하는 제2 커버를 포함할 수 있다. 도 9c를 참조하면, 제1 상태 또는 제2 상태 내에서, 제2 회전 부재(예: 도 4a의 제2 회전 부재)의 돌기 는, 연결 부재의 슬롯의 일 단(921a, 922a)에 위치될 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 제1 돌기는, 제1 슬롯의 일 단(921a)에 접할 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 제2 돌기는, 제2 슬롯의 일 단(922a)에 접할 수 있다. 예를 들어, 제1 하우징(예: 도 3a의 제1 하우징) 및 제3 하우징이 펼쳐진 제1 상태 또는 제2 상태 내에서, 제1 돌기 및 제2 돌 기 사이의 거리는, 가장 멀 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 제1 돌기 및 제2 돌기는, 제2 폴딩 축으로부터 가장 멀게 위치될 수 있다. 제1 상태 또는 제2 상태 내에서, 제1 하우 징 및 제3 하우징은, 펼쳐질 수 있다. 도 9d를 참조하면, 제3 상태 내에서, 제2 회전 부재(예: 도 4a의 제2 회전 부재)의 돌기는, 상기 일 단(921a, 922a)에 반대인 연결 부재의 슬롯의 다른 단(921b, 922b)에 위치될 수 있다. 예를 들어, 제3 상태 내에서, 제1 돌기는, 제1 슬롯의 다른 단(921b)에 접할 수 있다. 예를 들어, 제3 상태 내에 서, 제2 돌기는, 제2 슬롯의 다른 단(922b)에 접할 수 있다. 예를 들어, 제1 하우징 및 제3 하 우징이 접힌 제3 상태 내에서, 제1 돌기 및 제2 돌기 사이의 거리는, 가장 가까울 수 있다. 예 를 들어, 제3 상태 내에서, 제1 돌기 및 제2 돌기는, 제2 폴딩 축으로부터 가장 가깝게 위치될 수 있다. 예를 들어, 전자 장치가 제1 상태로부터 제3 상태로 전환되거나, 또는 제3 상태로부터 제1 상태로 전환될 때, 돌기는, 슬롯을 따라서 이동될 수 있다. 예를 들어, 돌기는, 슬롯 내에서, 직선 운동할 수 있다. 예를 들어, 돌기가 슬롯의 일 단(921a, 922a) 또는 다른 단(921b, 922b)에 가로막혀, 이동이 불가능한 상태에서, 제2 회전 부재의 회전이 제한될 수 있다. 제2 회전 부재의 회전이 제한됨 에 따라, 제1 회전 부재의 회전도 제한될 수 있다. 제1 회전 부재 및 제2 회전 부재가 회전될 수 없기 때문에, 제1 하우징 회전 및 제3 하우징의 회전이 제한될 수 있다. 예를 들어, 슬롯의 길이는, 폴더블 하우징이 제1 상태(또는 제2 상태) 및 제3 상태 사이에서 변형 가 능하도록, 설정될 수 있다. 예를 들어, 돌기가 슬롯의 일 단(921a, 922a)에 위치될 때, 폴더블 하우 징이 제1 상태(또는 제2 상태)가 되고, 돌기가 슬롯의 다른 단(921b, 922b)에 위치될 때, 폴더 블 하우징이 제3 상태가 되도록, 일 단(921a, 922a)과 다른 단(921b, 922b) 사이의 길이를 설정할 수 있다. 예를 들어, 슬롯에 의해 돌기의 이동이 제한됨으로써, 제1 회전 부재가 가이드 부재(42 0)로부터 이탈하지 않을 수 있다. 도 10a은, 예시적인 제2 힌지 어셈블리의 동작 과정을 도시한다. 도 10b는, 폴더블 하우징과 제2 힌지 어셈블리 사이의 단면을 도시한다. 도 10a의 1001은, 제1 상태 또는 제2 상태 내에서, 제2 힌지 어셈블리를 개략적으로 도시한다. 도 10a의 1003은, 제3 상태 내에서, 제2 힌지 어셈블리를 개략적으로 도시한다. 도 10a의 1002는, 제1 상태 또는 제 2 상태와, 제3 상태 사이의 중간 상태(intermediate state) 내에서, 제2 힌지 어셈블리를 개략적으로 도시 한다. 도 10a을 참조하면, 제2 회전 부재가 연결 부재의 슬롯을 따라서 직선 이동을 할 때, 제1 회전 부재는, 제1 회전 축(예: 도 4b의 제1 회전 축)에 대하여 회전될 수 있고, 제2 회전 부재 는, 제2 회전 축(예: 도 4b의 제2 회전 축)에 대하여 회전될 수 있다. 도 10a의 1001을 참조하면, 제1 상태 또는 제2 상태 내에서, 제1 회전 부재와 제2 회전 부재는, 평행 하게 정렬될 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 제1 회전 부재 및 제2 회전 부재 는, 실질적으로 동일한 평면 상에 배치될 수 있다. 도 10a의 1002를 참조하면, 제1 상태 또는 제2 상태로부터 중간 상태로 전환되는 동안, 제1 회전 부재는, 제1 회전 축에 대하여 회전될 수 있다. 예를 들어, 제1 상태 또는 제2 상태로부터 중간 상태로 전환되는 동안, 제2 회전 부재는, 제2 회전 축에 대하여 회전될 수 있다. 중간 상태 내에서, 제1 회전 부재 를 위한 제1 회전 축과 제2 회전 부재를 위한 제2 회전 축이 상이함에 따라, 제1 회전 부 재와 제2 회전 부재 사이에 각도(A)가 형성될 수 있다. 예를 들어, 제1 상태 또는 제2 상태로부터 중 간 상태로 전환되는 동안, 제2 회전 부재의 돌기는, 연결 부재의 슬롯을 따라서 이동될 수 있다. 도 10a의 1003을 참조하면, 제3 상태 내에서, 제1 회전 부재와 제2 회전 부재는, 다시 평행하게 정렬 될 수 있다. 예를 들어, 중간 상태로부터 제3 상태로 전환되는 동안, 제1 회전 부재와 제2 회전 부재 사이의 각도(A)는, 감소될 수 있다. 폴더블 하우징이 제3 상태로 전환되면, 제1 회전 부재 및 제2 회 전 부재는, 실질적으로 동일한 평면 상에 배치될 수 있다. 예를 들어, 제1 회전 부재와 제2 회전 부재가 서로 평행하지 않는 중간 상태 내에서, 제2 회전 부재 가 돌출될 수 있다. 제2 회전 부재가 플렉서블 디스플레이(예: 도 2의 플렉서블 디스플레이)를 향하여 돌출됨에 따라, 플렉서블 디스플레이에 손상이 야기될 수 있다. 도 10b를 참조하면, 제1 회전 부재 와 제2 회전 부재 사이의 각도(예: 도 10a의 각도(A))에 의해, 제2 회전 부재가 돌출되더라도, 플렉서블 디스플레이(예: 도 2의 플렉서블 디스플레이)와 접촉되지 않도록, 폴더블 하우징 및 제2 회 전 부재는, 부분적으로 함몰된 구조를 가질 수 있다. 예를 들어, 제2 회전 부재는, 플렉서블 디스플 레이가 배치된 방향에 반대인 방향(예: -z 방향)으로 함몰되는 제3 함몰부를 포함할 수 있다. 예를 들어, 제1 하우징(및/또는 제3 하우징)은, 상기 방향(예: -z 방향)으로 함몰되는 제4 함몰부를 포함할 수 있다. 예를 들어, 제1 회전 부재와 제2 회전 부재 사이에 각도(A)가 형성됨으로써, 제2 회 전 부재가 돌출될 경우, 상기 돌출된 부분이 제3 함몰부 및 제4 함몰부에 수용됨으로써, 플렉 서블 디스플레이에 대한 접촉을 줄일 수 있다. 플렉서블 디스플레이에 의한 접촉이 감소됨에 따라, 플렉서블 디스플레이의 손상이 줄어들 수 있다. 도 11a는, 예시적인 제2 힌지 어셈블리의 동작 과정을 도시한다. 도 11b는, 제1 상태 또는 제2 상태 내에서, 제 1 회전 부재와 가이드 부재의 연결 부분에 대한 단면도이다. 도 11c는, 예시적인 제2 힌지 어셈블리의 일부를 도시한다. 도 11a를 참조하면, 연결 부재의 슬롯 및 제2 회전 부재(예: 도 4a의 제2 회전 부재)의 돌기 에 의해, 제3 하우징(예: 도 3a의 제3 하우징) 및 제1 하우징(예: 도 3a의 제1 하우징)의 회전 각도가 제한될 수 있다. 도 11a의 1101은, 제1 상태 또는 제2 상태 내에서, 연결 부재의 슬롯 내에 삽입된 돌기를 도시 한다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 돌기는, 슬롯의 일 단(921a, 922a)에 접할 수 있 다. 돌기가 슬롯의 일 단(921a, 922a)에 접한 상태 내에서, 제2 힌지 어셈블리의 위에서 아래로 (예: -z 방향) 가해지는 제1 외력(F1)이 가해지더라도, 돌기가 일 단(921a, 922a)에 의해 막혀서 이동될 수 없기 때문에, 제1 회전 부재 및 제2 회전 부재는, 회전되지 않을 수 있다. 예를 들어, 제3 하우징 은, 제1 하우징에 대하여 180도 이상 펼쳐지지 않을 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내 에서, 제2 힌지 어셈블리의 아래에서 위로(예: +z 방향) 가해지는 제2 외력(F2)이 가해질 경우, 돌기(91 0)는, 슬롯의 다른 단(921b, 922b)을 향하여 이동될 수 있다. 도 11a의 1102는, 중간 상태 내에서, 연결 부재의 슬롯 내에 삽입된 돌기를 도시한다. 예를 들 어, 중간 상태 내에서, 돌기는, 슬롯의 일 단(921a, 922a)과 다른 단(921b, 922b) 사이에 위치될 수 있다. 상기 제2 외력(F2)에 의해, 돌기가 일 단(921a, 922a)으로부터 다른 단(921b, 922b)으로 이동할 수 있기 때문에, 제1 회전 부재 및 제2 회전 부재는, 회전될 수 있다. 예를 들어, 제3 하우징은, 제1 하우징에 대하여 접힐 수 있다. 도 11a의 1103은, 제3 상태 내에서, 연결 부재의 슬롯 내에 삽입된 돌기를 도시한다. 예를 들어, 제3 상태 내에서, 돌기는, 슬롯의 다른 단(921b, 922b)에 접할 수 있다. 돌기가 슬롯 의 다른 단(921b, 922b)에 접한 상태 내에서, 제3 하우징을 제1 하우징에 대하여 안으로 접히게 하는 방향(예: +x 방향)으로 제3 외력(F3)이 가해지더라도, 돌기가 다른 단에 의해 막혀서 이동될 수 없기 때문에, 제1 회전 부재 및 제2 회전 부재는, 회전되지 않을 수 있다. 예를 들어, 제3 하우징은, 제1 하우징에 대하여 0도 이하로 접히지 않을 수 있다. 예를 들어, 제3 상태 내에서, 제3 하우징을 제1 하우징에 대하여 밖으로 펼쳐지게 하는 방향(예: -x 방향)으로 제4 외력(F4)이 가해질 경우, 돌기 는, 슬롯의 일 단(921a, 922a)을 향하여 이동될 수 있다. 도 11b를 참조하면, 제1 회전 부재와 가이드 부재의 연결 구조에 의해, 회전 각도가 제한될 수 있다. 예를 들어, 제1 회전 부재의 로터리 레일은, 가이드 부재의 가이드 홈 내에 삽입될 수 있 다. 전술된 바와 같이, 로터리 레일은, 가이드 홈을 따라서 이동함으로써, 제1 회전 부재의 회 전을 가능하게 할 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 상기 제3 하우징(예: 도 3a의 제3 하우 징)을 더 펼쳐지게 하는 방향으로의 제1 회전 부재의 회전을 제한하기 위해서, 가이드 부재는, 단차 부분(stepped part)를 포함할 수 있다. 예를 들어, 곡률을 가지는 로터리 레일과 제1 회전 부 재의 제1 부분(및 제3 부분)은, 이격될 수 있다. 예를 들어, 로터리 레일과 제1 부분 (및 제3 부분) 사이에 직선적으로 연장되는 직선 부분이 형성될 수 있다. 예를 들어, 가이드 부재의 단차 부분은, 상기 직선 부분과 접할 수 있다. 예를 들어, 제1 하우징과 제3 하 우징이 펼쳐진 제1 상태 또는 제2 상태 내에서, 제1 회전 부재를 누르는 외력(F)이 가해지더라도, 직 선 부분이 단차 부분에 의해 막힘으로써, 제3 하우징은, 제1 하우징에 대하여 180도 이 상 펼쳐지지 않을 수 있다. 도 11c를 참조하면, 커버, 프릭션 바디, 및 제2 회전 부재에 의해, 회전 각도가 제한될 수 있다. 도 11c의 1104를 참조하면, 제2 회전 부재는, 제1 상태 또는 제2 상태 내에서, 커버와 접하는 돌출부 를 포함할 수 있다. 예를 들어, 제1 암 서포터는, 커버를 향하여 연장되는 제1 돌출부를 포함할 수 있다. 예를 들어, 제2 암 서포터는, 커버를 향하여 연장되는 제2 돌출부를 포함할 수 있다. 제1 상태 또는 제2 상태 내에서, 제1 돌출부 및 제2 돌출부는, 커버의 홈에 접할 수 있다. 예를 들어, 제1 하우징과 제3 하우징이 펼쳐진 제1 상태 또는 제2 상태 내에서, 제2 회전 부재를 누르는 외력(F)이 가해지더라도, 제1 돌출부 및 제2 돌출부가 커버에 의해 막힘으로써, 제3 하우징(예: 도 3a의 제3 하우징)은, 제1 하우징(예: 도 3a의 제1 하우징)에 대하여180도 이상 펼쳐지지 않을 수 있다. 도 11c의 1104에서, 제2 커버에 의해 회전 각도가 제한되는 것으로 도 시되었으나, 이에 제한되지 않는다. 예를 들어, 제1 커버도, 제1 상태 또는 제2 상태 내에서, 돌출부 와 접하는 홈을 포함할 수 있다. 도 11c의 1105를 참조하면, 돌출부는, 제1 상태 또는 제2 상태 내에서, 프릭션 바디와 접할 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 제1 돌출부 및 제2 돌출부는, 프릭션 바디의 홈(115 0)에 접할 수 있다. 예를 들어, 제1 하우징과 제3 하우징이 펼쳐진 제1 상태 또는 제2 상태 내에서, 제2 회전 부재를 누르는 외력(F)이 가해지더라도, 제1 돌출부 및 제2 돌출부가 프릭션 바디 에 의해 막힘으로써, 제3 하우징은, 제1 하우징에 대하여 180도 이상 펼쳐지지 않을 수 있다. 도 11c의 1105에서, 제2 프릭션 바디에 의해 회전 각도가 제한되는 것으로 도시되었으나, 이에 제한되지 않는다. 예를 들어, 제2 프릭션 바디도, 제1 상태 또는 제2 상태 내에서, 돌출부와 접하는 홈(115 0)을 포함할 수 있다. 도시되지 않았으나, 홀더도, 제1 상태 또는 제2 상태 내에서, 돌출부와 접하 는 홈을 포함할 수 있다. 홀더의 홈에 의해, 회전 각도가 제한될 수도 있다. 전술된 바와 같이, 제1 하우징에 대한 제3 하우징의 회전 각도가 제한될 수 있다. 예를 들어, 제1 하 우징 및 제3 하우징이 펼쳐진 제1 상태 또는 제2 상태 내에서, 플렉서블 디스플레이에 가해지는 외력(예: 터치 입력)에 의해, 제3 하우징이 제1 하우징에 대하여 밖으로 더 회전될 경우, 180도 초과 의 회전 각도에 의해, 폴더블 하우징이 파손될 수 있다. 예를 들어, 전술된 구조들에 의해, 회전 각도가 제한됨에 따라, 상기 외력에 버틸 수 있는 강도가 향상될 수 있다. 예를 들어, 제1 하우징 및 제3 하우징이 접힌 제3 상태 내에서, 제3 하우징이 제1 하우징 에 대하여 안으로 더 회전될 경우, 0도 미만의 회전 각도에 의해, 폴더블 하우징(예: 도 3a의 폴더블 하우징 )이 파손될 수 있다. 예를 들어, 제1 상태로부터 제2 상태를 경과하여 제3 상태로 전환하는 폴더블 하우징 을 접는 순서(예: 제1 상태 - 제2 상태 - 제3 상태)가 지켜지지 않고, 제1 상태로부터 제3 상태로 바로 전 환된 후(예: 제1 상태 - 제3 상태), 제3 하우징이 안으로 더 회전될 경우, 제2 하우징을 추가적으로 회전시킴으로써, 폴더블 하우징이 파손될 수 있다. 예를 들어, 제3 하우징을 안으로 접은 상태에서, 제3 하우징이 더 회전되지 않을 경우, 제3 하우징에 의해 제2 하우징의 회전 각도가 제한되기 때문에, 사용자는, 폴더블 하우징을 잘못된 순서로 접은 것을 쉽게 인식할 수 있다. 예를 들어, 잘못된 순 서로 폴더블 하우징을 접음으로 인한 폴더블 하우징의 파손이 줄어들 수 있다. 도 12a는, 예시적인 제1 힌지 기어의 일부 및 예시적인 제2 힌지 어셈블리의 일부를 도시한다. 도 12b는, 예시 적인 제2 힌지 어셈블리를, 도 12a의 C-C'를 따라서 절단한 단면도이다. 도 12c는, 예시적인 제2 힌지 어셈블리 의 슬롯 및 돌기를 도시한다. 도 12d는, 제2 힌지 어셈블리의 회전 각도에 따른 제2 힌지 어셈블리의 상태들을 도시한다. 도 12e는, 슬롯 내에 배치되는 제3 탄성 부재를 도시한다. 도 12a를 참조하면, 예시적인 제1 힌지 어셈블리는, 적어도 하나의 제1 탄성 부재를 포함할 수 있다. 예를 들어, 적어도 하나의 제1 탄성 부재는, 외력에 의해 압축 또는 신장될 수 있는 스프링을 포함 할 수 있으나, 이에 제한되지 않는다. 적어도 하나의 제1 탄성 부재는, 압축 또는 신장될 시, 원래 형상 으로 복원되기 위한 복원력을 가질 수 있다. 예를 들어, 적어도 하나의 제1 탄성 부재는, 캠 구조(CAM mechanism)에 의해 압축될 수 있다. 예를 들어, 캠 구조는, 서로 맞물리는 능선을 포함하는 캠 멈춤쇠들(CAM detents)를 포함할 수 있다. 예를 들어, 제1 힌지 어셈블리가 회전될 때, 서로 맞물린 캠 멈춤쇠들이 능선을 따라서 이동함으로써, 적어도 하나 의 제1 탄성 부재의 압축 또는 신장을 야기할 수 있다. 적어도 하나의 제1 탄성 부재의 압축 또는 신장에 의해, 캠 멈춤쇠들 사이에 마찰력이 발생될 수 있다. 상기 마찰력은, 제1 힌지 어셈블리의 회전에 저항하는 힘(예: 토크)으로 작용함으로써, 제1 힌지 어셈블리의 접힘 각도를 유지할 수 있다. 제1 힌지 어셈블리의 접힘 각도가 유지됨으로써, 제1 하우징(예: 도 3a의 제1 하우징) 및 제2 하우징(예: 도 3a의 제2 하우징)이 펼쳐진 상태와 제1 하우징 및 제2 하우징이 접힌 상태 사이의 중간 상태 내에서 제1 하우징 및 제2 하우징이 고정되는 프리 스탑 또는 플렉스 모드가 가능할 수 있다. 예를 들어, 제1 힌지 어셈블리는, 상기 마찰력에 의해, 제1 힌지 어셈블리가 접히거나 펼쳐질 때, 사용자 에게 촉각적 피드백을 제공할 수 있다. 예를 들어, 사용자는, 상기 마찰력에 의핸 촉각적 피드백을 통해, 제2 하우징이 제1 하우징에 대하여 접히거나 펼쳐지는 느낌을 받을 수 있다. 도 12a를 참조하면, 예시적인 제2 힌지 어셈블리는, 적어도 둘의 제2 탄성 부재들을 포함할 수 있다. 예를 들어, 적어도 둘의 제2 탄성 부재들은, 외력에 의해 압축 또는 신장될 수 있는 스프링을 포함할 수 있으나, 이에 제한되지 않는다. 적어도 둘의 제2 탄성 부재들은, 압축 또는 신장될 시, 원래 형상으로 복 원되기 위한 복원력을 가질 수 있다. 예를 들어, 적어도 둘의 제2 탄성 부재들의 개수는, 적어도 하나의 제1 탄성 부재의 개수보다 많을 수 있다. 도 12a 및 도 12b를 참조하면, 제2 힌지 어셈블리는, 얇을 두께를 가지기 위한 구조를 가질 수 있다. 예를 들어, 제2 회전 부재를 위한 제2 회전 축과 중첩되는 구조들의 두께는, 상대적으로 얇을 수 있다. 예 를 들어, 제3 샤프트 및 제4 샤프트를 지지하는 제1 연결부, 제2 연결부, 제3 연결부 , 및 제4 연결부의 두께는, 상대적으로 얇을 수 있다. 예를 들어, 제3 샤프트를 감싸는 제1 연 결부는, 상대적으로 얇은 두께(t)를 가질 수 있다. 제1 연결부, 제2 연결부, 제3 연결부, 및 제4 연결부의 두께가 상대적으로 얇기 때문에, 제2 회전 부재에 CAM 구조를 적용하기 어려울 수 있다. 예를 들어, 제1 하우징 및 제3 하우징(예: 도 3a의 제3 하우징)의 회전 동작을 위한 제2 힌지 어셈블 리의 두께가 두꺼울 경우, 폴더블 하우징(예: 도 3a의 폴더블 하우징)의 전체 두께가 두꺼워질 수 있 다. 예시적인 전자 장치(예: 도 3a의 전자 장치)는, 3개의 하우징들이 접히는 구조의 폴더블 하우징 을 포함하므로, 폴더블 하우징의 두께가 두꺼울 경우, 제3 상태 내에서, 전자 장치를 휴대하기 어려 울 수 있다. 예를 들어, 3개의 하우징들이 접히는 제3 상태 내에서, 폴더블 하우징의 두께를 줄이기 위해 서, 제2 힌지 어셈블리는, CAM 구조를 포함하지 않을 수 있다. 예를 들어, CAM 구조의 경우, 접히거나 펼쳐지는 동작이 반복될 경우, 돌출된 능선에 의해 손상(예: 마모)이 야 기될 수 있다. 예를 들어, 제2 힌지 어셈블리는, 제1 힌지 어셈블리 내에 포함되는 구성요소들보다 더 많은 구성요소들을 포함하기 때문에, CAM 구조를 제2 힌지 어셈블리에 적용할 경우, 제2 힌지 어셈블리 의 내구성이 약화될 수 있다. 예를 들어, 제2 힌지 어셈블리는, CAM 구조를 포함하지 않을 수 있다. 도 12c를 참조하면, 제2 힌지 어셈블리는, CAM 구조 대신, 연결 부재에 형성되는 슬롯의 형상을 이용하여, 제2 힌지 어셈블리가 접히거나 펼쳐질 때, 사용자에게 촉각적 피드백을 제공할 수 있다. 예를 들어, 슬롯은, 제1 걸림부(920a)(locking portion) 및 제2 걸림부(920b)를 포함할 수 있다. 예를 들 어, 제1 걸림부(920a)는, 슬롯의 일 단(921a, 922a)으로부터, 지정된 거리만큼 이격될 수 있다. 예를 들어, 제1 걸림부(920a)는, 슬롯 내부를 향하여 돌출될 수 있다. 예를 들어, 제1 걸림부(920a)는, 슬롯 의 가장자리의 상부에서 하부를 향하여 돌출된 제1 부분(920a-1) 및/또는 슬롯의 가장자리의 하부에 서 상부를 향하여 돌출된 제2 부분(920a-2)을 포함할 수 있다. 예를 들어, 제2 걸림부(920b)는, 슬롯의 다 른 단(921b, 922b)으로부터, 지정된 거리만큼 이격될 수 있다. 예를 들어, 제2 걸림부(920b)는, 슬롯 내부 를 향하여 돌출될 수 있다. 예를 들어, 제2 걸림부(920b)는, 슬롯의 가장자리의 상부에서 하부를 향하여 돌출된 제3 부분(920b-1) 및/또는 슬롯의 가장자리의 하부에서 상부를 향하여 돌출된 제4 부분(920b-2)을 포함할 수 있다. 예를 들어, 제1 걸림부(920a) 및 제2 걸림부(920b)에 의해, 돌기의 이동을 위한 힘이 증가될 수 있다. 예 를 들어, 슬롯의 폭은, 제1 걸림부(920a) 및 제2 걸림부(920b)가 형성된 영역 내에서, 줄어들 수 있다. 예 를 들어, 제1 걸림부(920a)가 형성된 영역 내에서, 슬롯의 폭은, 슬롯 내부를 향하여 돌출된 제1 부 분(920a-1) 및 제2 부분(920a-2)의 높이만큼 감소될 수 있다. 예를 들어, 제2 걸림부(920b)가 형성된 영역 내에 서, 슬롯의 폭은, 슬롯 내부를 향하여 돌출된 제3 부분(920b-1) 및 제4 부분(920b-2)의 높이만큼 감 소될 수 있다. 예를 들어, 돌기는, 상대적으로 좁은 슬롯의 폭을 형성하는 제1 걸림부(920a) 및 제2 걸림부(920b)를 통과할 때, 추가적인 힘을 필요로 할 수 있다. 예를 들어, 돌기가 제1 걸림부(920a) 및/또 는 제2 걸림부(920b)를 통과할 때, 상대적으로 좁은 슬롯의 폭을 통과할 수 있도록, 추가적인 힘이 필요할 수 있다. 상기 추가적인 힘에 의해, 돌기는, 제1 걸림부(920a) 및/또는 제2 걸림부(920b)를 통과할 수 있 다. 예를 들어, 돌기가 제1 걸림부(920a) 및/또는 제2 걸림부(920b)를 통과할 때, 돌기가 제1 걸림부 (920a) 및/또는 제2 걸림부(920b)와 간섭함으로써, 사용자에게, 제2 힌지 어셈블리의 펼쳐지거나 접히는 느낌을 제공할 수 있다. 예를 들어, 제2 힌지 어셈블리는, CAM 구조를 포함하지 않더라도, 슬롯 내의 제1 걸림부(920a) 및 제2 걸림부(920b)를 통해, 사용자에게 촉각적 피드백을 제공할 수 있다. 예를 들어, 제1 걸림부(920a)의 위치 및 제2 걸림부(920b)의 위치는, 제2 힌지 어셈블리의 회전 각도에 따 라 촉각적 피드백을 제공할 수 있는 위치로 설정될 수 있다. 예를 들어, 슬롯의 길이는, 폴더블하우징(예: 도 3a의 폴더블 하우징)의 제1 상태(또는 제2 상태) 및 제3 상태에 대응하도록 설정될 수 있다. 예를 들어, 돌기가 슬롯의 일 단(921a, 922a)에 접할 때, 폴더블 하우징이 제1 상태(또는 제2 상태)가 되고, 돌기가 슬롯의 다른 단(921b, 922b)에 위치될 때, 폴더블 하우징이 제3 상태 가 되도록, 슬롯의 길이를 설정할 수 있다. 예를 들어, 제1 걸림부(920a)의 위치는, 폴더블 하우징이 제1 상태(또는 제2 상태)로부터 지정된 각도(예: 약 15도) 회전될 때 촉각적 피드백이 제공되는 위치로 설정될 수 있다. 예를 들어, 제2 걸림부(920b)의 위치는, 폴더블 하우징이 제1 상태(또는 제2 상태)로부터 지정된 각도(예: 약 75도) 회전될 때 촉각적 피드백이 제공되는 위치로 설정될 수 있다. 도 12d를 참조하면, 제2 힌지 어셈블리의 회전 각도에 따라, 촉각적 피드백을 제공하도록, 제1 걸림부 (920a)의 위치 및 제2 걸림부(920b)의 위치가 설정될 수 있다. 도 12d 내에서, 제2 힌지 어셈블리의 제1 돌기 및 제1 슬롯만이 도시되었으나, 제2 돌기 및 제2 슬롯은, 제2 폴딩 축을 기준으 로, 제1 돌기 및 제1 슬롯과 대칭일 수 있다. 도 12d의 1201은, 돌기가 제1 슬롯의 일 단(921a)에 접하는 상태를 도시한다. 도 12d의 1201을 참조 하면, 전자 장치는, 제1 상태 또는 제2 상태일 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 제1 돌기는, 제2 폴딩 축(예: 도 3a의 제2 폴딩 축)으로부터 가장 먼 위치에 위치될 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 제1 돌기의 이동은, 제1 걸림부(920a)에 의해 제한될 수 있으므로, 제1 돌기가 제1 걸림부(920a)를 통과할 수 있는 정도의 외력이 제공되지 않을 경우, 제2 힌지 어셈블리의 회전이 제한될 수 있다. 도 12d의 1202는, 돌기가 제1 걸림부(920a)를 통과하는 상태를 도시한다. 예를 들어, 도 12d의 1202는, 도 12d의 1201로부터, 약 15도의 각도로 회전된 상태를 나타낼 수 있으나, 이에 제한되지 않는다. 도 12d의 1202를 참조하면, 제1 암 및 제1 암 서포트(예: 도 4a의 제1 암 서포트)가 회전됨에 따라, 제1 돌기는, 제1 슬롯 내에서, 일 단(921a)으로부터, 다른 단(921b)을 향하여 이동될 수 있다. 예를 들어, 제1 돌기 는, 다른 단(921b)을 향하여 이동됨으로써, 제1 걸림부(920a)와 접할 수 있다. 예를 들어, 제1 돌기 가 제1 걸림부(920a)를 통과할 때, 상대적으로 좁은 폭을 가지는 슬롯의 영역을 통과해야 하므로, 추가적 인 외력이 요구될 수 있다. 추가적인 외력에 의해, 제1 돌기가 제1 걸림부(920a)를 통과하는 동안, 제1 걸 림부(920a)와 제1 돌기 사이의 간섭에 의해, 사용자에게 촉각적 피드백이 제공될 수 있다. 사용자는, 상기 촉각적 피드백을 통해, 제2 힌지 어셈블리가 접히는 느낌을 받을 수 있다. 도 12d의 1203은, 돌기가 제2 걸림부(920b)를 통과하는 상태를 도시한다. 예를 들어, 도 12d의 1203은, 도 12d의 1201로부터, 약 75도의 각도로 회전된 상태를 나타낼 수 있으나, 이에 제한되지 않는다. 도 12d의 1203을 참조하면, 제1 암 및 제1 암 서포트가 더 회전됨에 따라, 제1 돌기는, 슬롯 내에서, 제2 걸림부(920b)와 접할 수 있다. 예를 들어, 예를 들어, 제1 돌기가 제2 걸림부(920b)를 통과할 때, 상대적 으로 좁은 폭을 가지는 슬롯의 영역을 통과해야 하므로, 추가적인 외력이 요구될 수 있다. 추가적인 외력 에 의해, 제1 돌기가 제2 걸림부(920b)를 통과하는 동안, 제2 걸림부(920b)와 제1 돌기 사이의 간섭 에 의해, 사용자에게 촉각적 피드백이 제공될 수 있다. 사용자는, 상기 촉각적 피드백을 통해, 제2 힌지 어셈블 리가 접히는 느낌을 받을 수 있다. 도 12d의 1204는, 돌기가 제1 슬롯의 다른 단(921b)에 접하는 상태를 도시한다. 도 12d의 1204를 참 조하면, 전자 장치는, 제3 상태일 수 있다. 예를 들어, 제3 상태 내에서, 제1 돌기는, 제2 폴딩 축 으로부터 가장 가까운 위치에 위치될 수 있다. 예를 들어, 제3 상태 내에서, 제1 돌기의 이동은, 제2 걸림부(920b)에 의해 제한될 수 있으므로, 제1 돌기가 제2 걸림부(920b)를 통과할 수 있는 정도의 외력이 제공되지 않을 경우, 제2 힌지 어셈블리의 회전이 제한될 수 있다. 도 12e를 참조하면, 사용자에게 촉각적 피드백을 제공하기 위해, 슬롯 내에 제1 걸림부(920a) 및/또는 제2 걸림부(920b)를 형성하는 대신, 제3 탄성 부재가 슬롯 내에 배치될 수 있다. 예를 들어, 제3 탄성 부재는, 슬롯 내에 배치될 수 있다. 예를 들어, 제3 탄성 부재는, 슬롯 의 가장자리의 하부에 배치될 수 있으나, 이에 제한되지 않는다. 예를 들어, 제3 탄성 부재는, 판 스프링일 수 있으나, 이에 제한되지 않는다. 예를 들어, 제3 탄성 부재는, 제3 걸림부 및 제4 걸림 부를 포함할 수 있다. 예를 들어, 제3 걸림부는, 슬롯의 일 단(921a, 922a)으로부터 지정된 거리만큼 이격될 수 있다. 예를 들어, 제3 걸림부는, 슬롯 내부를 향하여 돌출될 수 있다. 예를 들 어, 제4 걸림부는, 슬롯의 일 단(921a, 922a)으로부터 지정된 거리만큼 이격될 수 있다. 예를 들어, 제4 걸림부는, 슬롯 내부를 향하여 돌출될 수 있다. 예를 들어, 슬롯의 폭은, 제3 걸림부 및 제4 걸림부가 형성된 영역 내에서, 줄어들 수 있다. 예를 들어, 돌기가 제3 걸림부 및/또는 제4 걸림부를 통과할 때, 상대적으로 좁은 슬롯 의 폭을 통과할 수 있도록, 추가적인 힘이 필요할 수 있다. 상기 추가적인 힘에 의해, 돌기는, 제3 걸림부 및/또는 제4 걸림부를 통과할 수 있다. 예를 들어, 돌기가 제3 걸림부 및/또는 제4 걸 림부를 통과할 때, 돌기가 제3 걸림부 및/또는 제4 걸림부와 간섭함으로써, 사용자에게, 제2 힌지 어셈블리의 펼쳐지거나 접히는 느낌을 제공할 수 있다. 예를 들어, 제2 힌지 어셈블 리는, CAM 구조를 포함하지 않더라도, 슬롯 내의 제3 탄성 부재를 통해, 사용자에게 촉각적 피 드백을 제공할 수 있다. 도 13은, 예시적인 제2 힌지 어셈블리의 일부를 도시한다. 도 13을 참조하면, 제2 힌지 어셈블리는, 적어도 둘의 제2 탄성 부재들을 포함할 수 있다. 예를 들어, 적어도 둘의 제2 탄성 부재들은, 6개의 스프링들을 포함할 수 있으나, 이에 제한되지 않는다. 예를 들어, 적어도 둘의 제2 탄성 부재들은, 프릭션 바디와 홀더 사이에 배치될 수 있다. 예를 들어, 적어도 둘의 제2 탄성 부재들은, 제1 프릭션 바디와 홀더 사이 및 홀더와 제2 프릭 션 바디 사이에 배치될 수 있다. 예를 들어, 적어도 둘의 제2 탄성 부재들은, 프릭션 바디와 홀더 사이에 압축된 상태로 배치될 수 있다. 예를 들어, 프릭션 바디와 홀더 사이의 거리는, 적어도 제2 탄성 부재들의 원래 형상 의 길이보다 짧을 수 있다. 적어도 제2 탄성 부재들이 프릭션 바디와 홀더 사이에 배치될 때, 적어도 제2 탄성 부재들은, 프릭션 바디와 홀더에 의해 압축된 상태로 배치될 수 있다. 적어도 제2 탄성 부재들이 압축된 상태로 배치되기 때문에, 원래 형상으로 복원되려는 적어도 제2 탄성 부재들 의 복원력이 제2 힌지 어셈블리에 작용될 수 있다. 예를 들어, 제1 프릭션 바디와 홀더 사이에 배치된 적어도 하나의 제2 탄성 부재들에 의한 제1 복원력은, 제1 프릭션 바디를 위(예: +y 방향)로 밀어낼 수 있다. 상기 제1 복원력에 의해, 제1 프릭션 바 디는, 제2 회전 부재와 접하는 면에서 가입될 수 있다. 예를 들어, 상기 제1 복원력은, 제1 프릭션 바디와 제2 회전 부재의 제1 연결부 및 제3 연결부를 면 대 면으로 가압할 수 있다. 예를 들어, 제2 프릭션 바디와 홀더 사이에 배치된 적어도 하나의 제2 탄성 부재들에 의한 제2 복원력은, 제2 프릭션 바디를 아래(예: -y 방향)로 밀어낼 수 있다. 상기 제2 복원력에 의해, 제2 프릭션 바디는, 제2 회전 부재와 접하는 면에서 가압될 수 있다. 예를 들어, 상기 제2 복원력은, 제2 프릭션 바디와 제2 회전 부재의 제2 연결부 및 제4 연결부를 면 대 면으로 가압할 수 있다. 예를 들어, 상기 제1 복원력 및 상기 제2 복원력에 의한 면 대 면 가압은, 마찰력을 야기할 수 있다. 예를 들어, 상기 제1 복원력은, 제1 프릭션 바디와 제1 연결부 및 제3 연결부 사이의 마찰력을 야기 할 수 있다. 예를 들어, 상기 제2 복원력은, 제2 프릭션 바디와 제2 연결부 및 제4 연결부 사이 의 마찰력을 야기할 수 있다. 상기 마찰력들은, 제2 회전 부재의 회전에 저항하는 힘(예: 토크)으로 작용 함으로써, 제2 힌지 어셈블리의 접힘 각도를 유지할 수 있다. 예를 들어, 제3 상태 내에서, 외력에 의해 제1 회전 부재 및 제2 회전 부재가 약 45도 회전된 후, 외력이 제거되면, 제2 회전 부재는, 상 기 마찰력들에 의해, 회전되지 않을 수 있다. 제2 회전 부재가 회전되지 않고 고정될 수 있으므로, 제1 회 전 부재 및 제2 회전 부재는, 약 45도 회전된 상태를 유지할 수 있다. 상기 마찰력들에 의해, 프리 스탑 또는 플렉스 모드가 가능할 수 있다. 예시적인 제2 힌지 어셈블리는, CAM 구조를 포함하지 않고, 전술된 슬롯 내의 걸림부들(예: 도 12c의 제1 걸림부(920a) 및/또는 제2 걸림부(920b)), 슬롯 내에 배치되는 제3 탄성 부재(예: 도 12e의 제3 탄성 부재), 및/또는 적어도 둘의 제2 탄성 부재들에 의한 마찰력들을 이용함으로써, 프리 스탑 또는 플 렉스 모드를 제공할 수 있다. 예시적인 제2 힌지 어셈블리가 CAM 구조를 포함하지 않음으로써, 폴더블 하 우징의 상대적으로 얇은 두께의 구현이 가능할 수 있고, 제조 과정이 용이하며, CAM 구조의 마모에 의한 내구성 약화가 해결될 수 있다. 도 14a는, 예시적인 제2 힌지 어셈블리와 예시적인 제2 지지 플레이트의 분해 사시도이다. 도 14b는, 제2 지지 플레이트가 제2 힌지 커버에 결합된 상태를 도시한다. 도 14c는, 예시적인 전자 장치의 상태에 따른 플렉서블 디스플레이를 도시한다. 도 14a 및 도 14b를 참조하면, 예시적인 전자 장치(예: 도 3a의 전자 장치)는, 2개의 제2 힌지 어셈블리들 (252a, 252b)을 포함할 수 있다. 예를 들어, 2개의 제2 힌지 어셈블리들(252a, 252b)은, 전술된 제2 힌지 어셈 블리들(252a, 252b)과 실질적으로 동일할 수 있다. 예를 들어, 2개의 제2 힌지 어셈블리들(252a, 252b)은, 제1 하우징(예: 도 3a의 제1 하우징)과 제3 하우징(예: 도 3a의 제3 하우징) 사이에서, 대칭으로 배치될 수 있다. 예를 들어, 2개의 제2 힌지 어셈블리들(252a, 252b)은, x축에 대하여 대칭으로 배치될 수 있다. 예를 들어, 2개의 제2 힌지 어셈블리들(252a, 252b)은, 제2 폴딩 축의 연장 방향(예: y축 방향)을 따라서, 서로 이격될 수 있다. 예를 들어, 제1 하우징 내에 배치되는 인쇄 회로 기판과 제3 하우징 내에 배치되는 인쇄 회로 기판을 전기적으로 연결하기 위한 연성 인쇄 회로 기판은, 2개의 제2 힌지 어셈블리들(252a, 252b) 사이에 배치될 수 있다. 예를 들어, 연성 인쇄 회로 기판의 일부는, 제2 힌지 커버를 가로지를 수 있다. 예시적인 전자 장치는, 제2 지지 플레이트를 포함할 수 있다. 예를 들어, 제2 지지 플레이트 는, 2개의 제2 힌지 어셈블리들(252a, 252b) 사이에 배치될 수 있다. 예를 들어, 제2 지지 플레이트는, 제2 힌지 커버에 결합될 수 있다. 예를 들어, 제2 지지 플레이트는, 스크류(S)가 삽입될 수 있는 적 어도 하나의 관통 홀을 포함할 수 있다. 예를 들어, 제2 힌지 커버는, 스크류(S)가 결합될 수 있는 결합부들(312c, 312d)을 포함할 수 있다. 예를 들어, 제2 지지 플레이트는, 제2 힌지 커버 위(예: +z 방향)에 배치될 수 있고, 스크류(S)가 적어도 하나의 관통 홀을 통과하여, 결합부들(312c, 312d)에 결 합될 수 있다. 예를 들어, 제2 지지 플레이트는, 제2 힌지 커버를 가로지르는 연성 인쇄 회로 기판 의 일부와 중첩될 수 있다. 예를 들어, 제2 지지 플레이트는, 플렉서블 디스플레이의 일부를 지지할 수 있다. 예를 들어, 플렉 서블 디스플레이는, 제1 하우징과 제3 하우징에 의해 접히거나 펼쳐지는 제2 영역을 포함 할 수 있다. 제2 영역은, 플렉서블 디스플레이의 변형 가능한(deformable) 영역으로 참조될 수 있다. 상기 제2 영역은, 제1 상태 또는 제2 상태 내에서, 평평(flat)하고, 제3 상태 내에서, 적어도 부분 적으로 굴곡될 수 있다. 예를 들어, 제2 영역은, 제2 힌지 어셈블리 위(예: +z 방향)에 배치될 수 있다. 예를 들어, 제2 지지 플레이트는, 제2 힌지 어셈블리 위에 배치되고, 폴더블 하우징의 상태에 기반하여 변형되는 제2 영역을 적어도 부분적으로 지지할 수 있다. 예를 들어, 제2 지지 플레이트 는, 제2 영역과 적어도 부분적으로 접할 수 있다. 예를 들어, 제2 지지 플레이트는, 제2 영 역을 지지함으로써, 제2 영역의 굴곡되는 형상을 일정하게 유지하고, 제2 영역의 손상을 줄 일 수 있다. 도 14c를 참조하면, 전자 장치의 상태에 따라, 플렉서블 디스플레이는, 부분적으로 변형될 수 있다. 도 14c의 1401 및 1402는, 제1 하우징과 제2 하우징의 회전 동작에 따른 플렉서블 디스플레이를 도시한다. 예를 들어, 도 14c의 1401은, 제1 상태 내에서, 플렉서블 디스플레이를 도시한다. 예를 들어, 도 14c의 1402는, 제2 상태 또는 제3 상태 내에서, 플렉서블 디스플레이를 도시한다. 예를 들어, 플렉서블 디스플레이의 제1 영역은, 제1 상태 내에서, 평평할 수 있다. 예를 들어, 전자 장치가 제1 상 태로부터 제2 상태 또는 제3 상태로 전환됨에 따라, 제1 영역은, 적어도 부분적으로 굴곡될 수 있다. 제1 영역은, 플렉서블 디스플레이의 변형 가능한(deformable) 영역으로 참조될 수 있다. 예를 들어, 제1 하우징 상에 배치된 플렉서블 디스플레이의 영역과 제2 하우징 상에 배치된 플렉서블 디 스플레이의 영역은, 제2 상태 또는 제3 상태 내에서, 평평할 수 있고, 상기 영역들(1450, 1460) 사 이에 배치되는 제1 영역은, 제2 상태 또는 제3 상태 내에서, 적어도 부분적으로 굴곡될 수 있다. 전자 장 치의 상태에 따라 굴곡되는 제1 영역은, 제1 하우징 및 제2 하우징에 부착되지 않을 수 있다. 예를 들어, 제1 지지 플레이트는, 제1 상태 내에서, 제1 영역을 지지할 수 있다. 예를 들어, 제1 상태 내에서, 제1 지지 플레이트는, 평평한 제1 영역을 지지할 수 있다. 제1 상태 내에서, 제1 영 역에 외력이 가해지거나 딱딱한 물건이 떨어질 경우, 제1 지지 플레이트가 제1 영역을 지지 함으로써, 상기 외력 또는 상기 물건에 의한 제1 영역의 손상이 감소될 수 있다. 예를 들어, 제2 상태 또 는 제3 상태 내에서, 제1 지지 플레이트는, 굴곡된 제2 영역으로부터 이격될 수 있다. 예를 들어, 제2 상태 또는 제3 상태 내에서, 제1 지지 플레이트는, 제1 영역을 지지하지 않는 위치로 이동될수 있다. 도 14c의 1403 및 1404는, 제1 하우징과 제3 하우징의 회전 동작에 따른 플렉서블 디스플레이를 도시한다. 예를 들어, 도 14c의 1403은, 제1 상태 또는 제2 상태 내에서, 플렉서블 디스플레이를 도시한다. 예를 들어, 도 14c의 1404는, 제3 상태 내에서, 플렉서블 디스플레이를 도시한다. 예를 들어, 플렉서블 디스플레이의 제2 영역은, 제1 상태 또는 제2 상태 내에서, 평평할 수 있다. 예를 들어, 전자 장치가 제1 상태 또는 제2 상태로부터 제3 상태로 전환됨에 따라, 제2 영역은, 적어도 부분적 으로 굴곡될 수 있다. 예를 들어, 제1 하우징 상에 배치된 플렉서블 디스플레이의 영역과 제3 하우징 상에 배치된 플렉서블 디스플레이의 영역은, 제3 상태 내에서, 평평할 수 있고, 상기 영역들(1450, 1470) 사이에 배치되는 제2 영역은, 제3 상태 내에서, 적어도 부분적으로 굴곡될 수 있다. 전자 장치의 상태에 따라 굴곡되는 제2 영역은, 제1 하우징 및 제3 하우징에 부착되지 않 을 수 있다. 예를 들어, 제2 영역은, 제1 영역보다 넓을 수 있다. 예를 들어, 제2 지지 플레이트는, 제2 영역을 적어도 부분적으로 지지할 수 있다. 예를 들어, 제1 상태 또는 제2 상태 내에서, 제2 지지 플레이트는, 평평한 제2 영역을 지지할 수 있다. 제1 상태 또는 제2 상태 내에서, 제2 영역에 외력이 가해지거나 딱딱한 물건이 떨어질 경우, 제2 지지 플레이트 가 제2 영역을 지지함으로써, 상기 외력 또는 상기 물건에 의한 제2 영역의 손상이 감소될 수 있다. 예를 들어, 제3 상태 내에서, 제2 지지 플레이트는, 굴곡된 제2 영역의 일부(예: 도 15a 의 제1 부분)를 지지할 수 있다. 예를 들어, 제2 지지 플레이트가 없는 경우, 제3 상태 내에서, 제 2 영역은, 제2 힌지 커버를 향하여 돌출될 수 있다. 제2 영역이 돌출될 경우, 제2 영역(144 0)의 곡률이 증가됨으로써, 제2 영역 내의 복수의 픽셀들의 손상이 야기될 수 있다. 예를 들어, 제2 지지 플레이트는, 제2 영역을 지지함으로써, 제2 영역의 손상을 줄일 수 있다. 도 15a는, 예시적인 제2 힌지 어셈블리의 동작에 따른 플렉서블 디스플레이의 변형 과정을 개략적으로 도시한다. 도 15b는, 예시적인 제2 힌지 어셈블리와 제2 지지 플레이트를 도시한다. 도 15c는, 예시적인 제1 힌 지 어셈블리와 예시적인 제2 힌지 어셈블리를 도시한다. 도 15a를 참조하면, 제1 하우징 및 제3 하우징이 회전될 때, 플렉서블 디스플레이의 제2 영역 은, 적어도 부분적으로 굴곡될 수 있다. 예를 들어, 제2 지지 플레이트는, 복수의 제2 연동 기어들(예: 도 4a의 복수의 제2 연동 기어들)과 연동되어 이동될 수 있다. 예를 들어, 제1 하우징 및/또는 제3 하우징의 회전에 의해 복수의 제2 연 동 기어들이 동작될 때, 제2 지지 플레이트는, 복수의 제2 연동 기어들과 연동되어 이동될 수 있다. 예를 들어, 제1 하우징 및 제3 하우징의 회전 각도에 따라, 제2 지지 플레이트의 위치는, 상이할 수 있다. 예를 들어, 도 15a의 1501은, 제1 상태 또는 제2 상태 내에서, 플렉서블 디스플레이의 일부를 도시한다. 도 15a의 1501을 참조하면, 제1 상태 또는 제2 상태 내에서, 제1 하우징 및 제3 하우징에 의해 지지 되는 플렉서블 디스플레이의 일부는, 평평할 수 있다. 제1 상태 또는 제2 상태 내에서, 제2 영역은, 평평할 수 있다. 예를 들어, 제2 지지 플레이트는, 평평한 제2 영역을 지지할 수 있다. 도 15a의 1502는, 제1 하우징 및 제3 하우징이 약 15도 회전된 상태를 도시한다. 도 15a의 1503은, 제1 하우징 및 제3 하우징이 약 30도 회전된 상태를 도시한다. 도 15a의 1502 및 1503을 참조하면, 제1 하우징 및 제3 하우징이 약 15도 내지 약 30도 회전된 상태 내에서, 제2 영역은, 굴곡될 수 있다. 예를 들어, 제2 영역이 굴곡될 때, 균일하게 굴곡되지 않고, 불균일하게 굴곡될 수 있다. 예를 들어, 제2 영역은, 제1 하우징에 가까운 부분의 굴곡 정도가 제3 하우징에 가까운 부분의 굴곡 정도보다 클 수 있다. 예를 들어, 제2 지지 플레이트는, 불균일하게 굴곡되는 제2 영역을 지지할 수 있다. 도 15a의 1504는, 제1 하우징 및 제3 하우징이 약 45도 회전된 상태를 도시한다. 도 15a의 1505는, 제3 하우징이 약 60도 회전된 상태를 도시한다. 도 15a의 1504 및 1505를 참조하면, 제1 하우징 및 제3 하우징이 약 45도 내지 약 60도 회전된 상태 내에서, 제2 영역은, 균일하게 굴곡될 수 있다. 예 를 들어, 제2 지지 플레이트는, 균일하게 굴곡되는 제2 영역을 지지할 수 있다. 도 15a의 1506은, 제1 하우징 및 제3 하우징이 제1 상태 또는 제2 상태로부터 약 90도 회전된, 제3 상태를 도시한다. 예를 들어, 제3 상태 내에서, 제2 영역은, 부분적으로 굴곡될 수 있다. 예를 들어, 제2 지지 플레이트는, 제3 상태 내에서, 부분적으로 굴곡된 제2 영역의 일부(예: 제1 부분)를 지 지할 수 있다. 예를 들어, 제2 영역은, 제3 상태 내에서, 제1 부분, 제2 부분, 및 제3 부분을 포함 할 수 있다. 예를 들어, 제1 부분은, 제2 지지 플레이트에 지지되는 제2 영역의 부분일 수 있다. 예를 들어, 제2 부분은, 제1 부분과 제1 하우징 상에 배치된 플렉서블 디스플레이(27 1)의 영역 사이에 위치되는 제2 영역의 부분일 수 있다. 제2 부분은, 제3 상태 내에서, 적어 도 부분적으로 굴곡될 수 있다. 예를 들어, 제3 부분은, 제1 부분과 제3 하우징 상에 배치된 플렉서블 디스플레이의 영역 사이에 위치되는 제2 영역의 부분일 수 있다. 제3 부분은, 제3 상태 내에서, 적어도 부분적으로 굴곡될 수 있다. 예를 들어 제1 상태 내에서, 제1 부분, 제2 부분 , 및 제3 부분은, 실질적으로 평평하게 배치됨으로써, 구별되지 않을 수 있다. 예를 들어, 제3 상태 내에서, 제1 부분은, 실질적으로 평평할 수 있다. 예를 들어, 제1 부분은, 제 2 지지 플레이트에 의해 지지됨으로써, 평평할 수 있다. 예를 들어, 제3 상태 내에서, 제1 하우징 상에 배치된 플렉서블 디스플레이의 영역 및 제3 하우징 상에 배치된 플렉서블 디스플레이 의 영역 사이의 거리는, 제2 하우징의 두께보다 클 수 있다. 예를 들어, 제3 상태 내에서, 제2 지지 플레이트에 의해 지지되는 제1 부분의 폭은, 제1 하우징 및 제3 하우징 사이에 위 치되는 제2 하우징의 두께보다 작을 수 있다. 예를 들어, 제1 부분, 제2 부분 및 제3 부분 에 의해 형성되는 제1 하우징과 제3 하우징 사이의 공간에 제2 하우징이 위치되어야 하므 로, 제1 부분의 폭은, 제2 하우징의 두께보다 작을 수 있다. 예를 들어, 제2 부분 및 제3 부분은, 굴곡될 수 있다. 예를 들어, 제3 상태 내에서, 제1 하우징 및 제3 하우징은, 제1 부분에 대하여 실질적으로 수직하게 배치될 수 있다. 예를 들어, 제1 하우징 상에 배치된 플렉서블 디스플레이의 영역 및 제3 하우징 상에 배치된 플렉서블 디 스플레이의 영역은, 제1 부분에 대하여 실질적으로 수직하게 배치될 수 있다. 예를 들어, 서 로 수직한 상기 영역들과 제1 부분 사이에 위치되는 제2 부분은, 일정한 곡률로 굴곡될 수 있다. 예를 들어, 서로 수직한 상기 영역과 제1 부분 사이에 위치되는 제3 부분은, 일정한 곡률로 굴곡될 수 있다. 예를 들어, 제2 지지 플레이트에 의해 제1 부분이 평평함으로써, 제2 부분 의 곡률과 제3 부분의 곡률은, 일정할 수 있다. 제2 부분의 곡률과 제3 부분이 곡률이 일정하게 형성됨으로써, 제3 상태 내에서, 제2 하우징이 위치될 수 있는 공간이 안정적으로 형성될 수 있 다. 도 15a 내에 도시된 제2 지지 플레이트의 위치 이동과 유사하게, 제1 지지 플레이트는, 복수의 제1 연동 기어들과 연동되어 이동될 수 있다. 제1 지지 플레이트는, 복수의 제1 연동 기어들과 연 동되어 이동될 수 있다. 예를 들어, 제1 하우징 및/또는 제2 하우징의 회전에 의해 복수의 제1 연동 기어들이 동작될 때, 제1 지지 플레이트는, 복수의 제1 연동 기어들과 연동되어 이동될 수 있 다. 예를 들어, 제1 하우징 및 제2 하우징의 회전 각도에 따라, 제1 지지 플레이트의 위치는, 상이할 수 있다. 도 15b를 참조하면, 제2 지지 플레이트의 상면(예: +z 방향을 향하는 면)(1410a)은, 제2 힌지 어셈블리 의 상면과 실질적으로 동일한 평면을 형성할 수 있다. 예를 들어, 제1 회전 부재의 상면(410a), 제2 회전 부재의 상면(440a), 및 제2 지지 플레이트의 상면(1410a)은, 실질적으로 동일한 평면을 형성할 수 있다. 예를 들어, 제2 힌지 어셈블리 및 제2 힌지 플레이트 위(예: +z 방향)에 플렉서블 디스플레이(예: 도 15a 의 플렉서블 디스플레이)가 배치될 수 있다. 만약, 제2 지지 플레이트의 상면(1420a)과 제2 힌지 어 셈블리의 상면(예: 제1 회전 부재의 상면(410a), 제2 회전 부재의 상면(440a))이 다른 높이에 위치될 경우, 플렉서블 디스플레이의 표면의 불균일을 야기함으로써, 플렉서블 디스플레이에 표시되 는 화면의 품질 저하가 야기될 수 있다. 제2 지지 플레이트의 상면과 제2 힌지 어셈블리의 상면이 실질적으로 동일한 평면을 형성함으로써, 플렉서블 디스플레이의 표면을 균일하게 유지할 수 있다. 도 15c를 참조하면, 예시적인 전자 장치는, 2개의 제1 힌지 어셈블리들(251a, 251b)을 포함할 수 있다. 예 를 들어, 2개의 제1 힌지 어셈블리들(251a, 251b)은, 제1 하우징과 제2 하우징 사이에서, 대칭으로 배치될 수 있다. 예를 들어, 2개의 제1 힌지 어셈블리들(251a, 251b)은, x축에 대하여 대칭으로 배치될 수있다. 예를 들어, 2개의 제1 힌지 어셈블리들(251a, 251b)은, 제1 폴딩 축의 연장 방향(예: y축 방향)을 따라서, 서로 이격될 수 있다. 예시적인 전자 장치(예: 도 3a의 전자 장치)는, 제1 지지 플레이트를 포함할 수 있다. 예를 들어, 제1 지지 플레이트는, 2개의 제1 힌지 어셈블리들(251a, 251b) 사이에 배치될 수 있다. 예를 들어, 제1 지지 플레이트는, 제1 힌지 커버에 결합될 수 있다. 예를 들어, 제1 지지 플레이트는, 제1 상태 내에서, 플렉서블 디스플레이의 일부를 지지할 수 있다. 예를 들어, 플렉서블 디스플레이는, 제1 하우징과 제2 하우징에 의해 접히거나 펼쳐지는 제1 영 역(예: 도 14c의 제1 영역)을 포함할 수 있다. 상기 제1 영역은, 제1 상태 내에서, 평평(flat)하고, 제2 상태 또는 제3 상태 내에서, 굴곡될 수 있다. 예를 들어, 제1 영역은, 제1 힌지 어 셈블리 위(예: +z 방향)에 배치될 수 있다. 예를 들어, 제1 지지 플레이트는, 제1 상태 내에서, 제1 힌지 어셈블리 위에 배치되고, 평평한 제1 영역을 지지할 수 있다. 예를 들어, 제1 지지 플레이트 는, 제1 상태 내에서, 제1 영역과 적어도 부분적으로 접할 수 있다. 예를 들어, 제1 지지 플레이트 는, 제1 영역을 지지함으로써, 제1 상태 내에서, 제1 영역의 손상을 줄일 수 있고, 제1 영역 상에 표시되는 화면의 품질을 향상시킬 수 있다. 도 15c를 참조하면, 2개의 제1 힌지 어셈블리들(251a, 251b) 사이에 배치되는 제1 지지 플레이트와, 2개 의 제2 힌지 어셈블리들(252a, 252b) 사이에 배치되는 제2 지지 플레이트는, 상이한 사이즈를 가질 수 있 다. 예를 들어, 제2 지지 플레이트의 폭은, 제1 지지 플레이트의 폭보다 넓을 수 있다. 예를 들어, 제2 지지 플레이트의 길이는, 제1 지지 플레이트의 길이와 상이할 수 있다. 예를 들어, 제2 지지 플레이트의 길이는, 제1 지지 플레이트의 길이보다 길 수 있으나, 이에 제한되지 않는다. 예를 들어, 제2 지지 플레이트는, 제1 서브 지지 플레이트(1420-1) 및 제2 서브 지지 플레이트(1420-2)를 포함할 수 있다. 예를 들어, 제1 서브 지지 플레이트(1420-1) 및 제2 서브 지지 플레이트(1420-2)는, 복수의 제 2 연동 기어들과 연동되어 이동되도록 구성될 수 있다. 예를 들어, 제1 서브 지지 플레이트(1420-1)와 제2 서브 지지 플레이트(1420-2)는, 실질적으로 동일한 평면을 형성함으로써, 제2 영역을 지지할 수 있다. 예 를 들어, 제1 서브 지지 플레이트(1420-1)와 제2 서브 지지 플레이트(1420-2)는, 복수의 제2 연동 기어들 과 연동되어, 동일한 방향을 이동됨으로써, 제2 영역을 지지할 수 있다. 도 16a은, 예시적인 제2 지지 플레이트에 의한 효과를 설명하기 위한 도면이다. 도 16b는, 제2 지지 플레이트를 포함하지 않는 전자 장치의 일부를 도시한다. 도 16c는, 제2 지지 플레이트를 포함하는 전자 장치의 일부를 도 시한다. 예를 들어, 도 16a의 1601은, 제2 지지 플레이트를 포함하는 전자 장치를 개략적으로 도시한다. 예 를 들어, 제2 지지 플레이트가 제2 영역을 지지함으로써, 제2 영역은, 상대적으로 작은 곡률 을 가지는 제2 부분 및 제3 부분을 포함할 수 있다. 상대적으로 작은 곡률을 갖는 제2 부분 및 제3 부분에 의해, 제2 영역은, 제2 하우징이 제1 하우징 및 제3 하우징 사이에 위치될 수 있는 공간을 제공할 수 있다. 예를 들어, 제2 지지 플레이트에 의해 지지되는 제1 부분 의 폭은, 제2 하우징의 두께보다 작을 수 있다. 예를 들어, 제2 하우징이 위치될 수 있는 공간이 형 성될 수 있으므로, 폴더블 하우징의 두께 확보가 가능할 수 있다. 예를 들어, 폴더블 하우징의 두께 가 제한될 경우, 폴더블 하우징 내에 배치되는 전자 부품들(예: 배터리)의 사이즈가 제한될 수 있다. 예를 들어, 제2 지지 플레이트에 의해, 제2 하우징이 위치될 수 있는 공간이 제공될 수 있으므로, 폴더블 하우징의 두께 및 전자 부품들의 사이즈가 확보될 수 있다. 예를 들어, 상대적으로 작은 곡률을 가지는 제 2 부분 및 제3 부분에 의해, 플렉서블 디스플레이와 폴더블 하우징 사이의 갭이 줄어들 수 있으므로, 외부로부터 이물질의 유입이 줄어들 수 있다. 예를 들어, 도 16a의 1602는, 제2 지지 플레이트가 없는 전자 장치를 개략적으로 도시한다. 예를 들 어, 제2 지지 플레이트에 의해 제2 영역이 지지되지 않음으로써, 제2 영역은, 제2 힌지 어셈 블리를 향하여 돌출될 수 있다. 제2 영역이 제2 힌지 어셈블리를 향하여 돌출됨으로써, 제2 힌 지 어셈블리의 구성요소와 제2 영역 사이의 마찰이 야기될 수 있으므로, 플렉서블 디스플레이 의 손상이 발생될 수 있다. 예를 들어, 도 16a의 1603은, 제2 지지 플레이트가 없는 전자 장치를 개략적으로 도시한다. 예를 들 어, 제2 지지 플레이트가 없는 경우, 제2 영역은, 상대적으로 큰 곡률을 가지면서 굴곡될 수 있다. 상대적으로 큰 곡률을 갖는 제2 영역에 의해, 제2 하우징과 플렉서블 디스플레이 사이의 간섭 이 야기됨으로써, 플렉서블 디스플레이의 손상이 발생될 수 있다. 상대적으로 큰 제2 영역에 의해, 플렉서블 디스플레이와 폴더블 하우징 사이의 갭(g)으로 이물질의 유입이 야기될 수 있다. 도 16b를 참조하면, 제2 지지 플레이트가 없는 전자 장치의 경우, 제1 하우징 및 제3 하우징 이 접힌 제3 상태 내에서, 제2 영역은, 제2 힌지 커버를 향하여 돌출될 수 있다. 전술된 바와 같이, 제2 영역이 돌출됨으로써, 제2 힌지 어셈블리와 제2 영역 사이의 간섭에 의해, 플렉서 블 디스플레이의 손상이 야기될 수 있다. 제2 영역이 돌출됨에 따라, 제2 영역의 곡률이 상대 적으로 크기 때문에, 플렉서블 디스플레이의 손상이 야기될 수 있다. 도 16c를 참조하면, 제2 지지 플레이트를 포함하는 전자 장치의 경우, 제1 하우징 및 제3 하우 징이 접힌 제3 상태 내에서, 제2 영역은, 제2 지지 플레이트에 의해 지지될 수 있다. 제3 상 태 내에서, 제2 영역은, 제2 지지 플레이트에 의해 돌출되지 않고, 상대적으로 작은 곡률을 형성할 수 있다. 전술된 바와 같이, 제2 영역이 제2 지지 플레이트에 의해 지지됨으로써, 제2 힌지 어셈블 리와 제2 영역 사이의 간섭이 줄어들 수 있다. 제2 영역 의 곡률이 감소됨에 따라, 플렉서블 디스플레이의 손상이 줄어들 수 있다. 도 17은, 예시적인 전자 장치가 펼쳐진 상태로부터 접힌 상태로 변형되는 과정을 도시한다. 도 17을 참조하면, 폴더블 하우징(예: 도 2의 폴더블 하우징)은, 제1 상태, 제2 상태, 및 제3 상태 를 제공하도록 구성될 수 있다. 제1 상태는, 전자 장치의 펼쳐진 상태로 참조될 수 있다. 제3 상태는, 전 자 장치의 접힌 상태로 참조될 수 있다. 제2 상태는, 제1 상태와 제2 상태 사이의 중간 상태(intermediate state)로 참조될 수 있다. 도 17의 상태(1700a)는, 제1 상태를 나타낸다. 제1 상태 내에서, 제1 하우징(예: 도 2의 제3 하우징 ), 제2 하우징(예: 도 2의 제1 하우징), 및 제3 하우징(예: 도 2의 제2 하우징)은, 실질적으로 동일한 평면 상에 배치될 수 있다. 예를 들어, 제1 상태 내에서, 제1 표시 영역 과 제2 표시 영역 사이의 제1 각도 및 제2 표시 영역과 제3 표시 영역 사이의 제2 각 도는, 실질적으로 평각(straight angle)(예: 약 180도)일 수 있다. 제1 상태는, 제1 하우징, 제2 하우징 , 및 제3 하우징이 완전히 펼쳐지는 관점에서, 개방(opened) 상태, 플랫 상태, 및/또는 펼침 (outspread) 상태로 지칭될 수 있다. 제1 상태 내에서, 플렉서블 디스플레이(예: 도 2의 플렉서블 디스플 레이)는, 실질적으로 평평할 수 있다. 도 17의 상태(1700b)는, 제2 상태를 나타낸다. 제2 상태 내에서, 제1 각도는, 실질적으로 평각을 유지할 수 있 고, 제2 각도는, 실질적으로 0도일 수 있다. 예를 들어, 제3 하우징이 제2 하우징에 대하여 회전됨 에 따라, 전자 장치는, 제1 상태로부터 제2 상태로 변경될 수 있다. 예를 들어, 사용자가 제3 하우징 을 접기 위해서 외력을 가하면, 제3 하우징은, 제2 힌지 어셈블리(예: 도 3b의 제1 힌지 어 셈블리)를 통해, 제1 하우징에 대하여 반시계 방향(counterclockwise)으로 회전될 수 있다. 제2 힌 지 어셈블리는, 제3 하우징이 제2 하우징에 대하여 안으로 접히도록(folded inward), 제2 하우징 및 제3 하우징을 회전 가능하게 연결할 수 있다. 제2 상태는, 폴더블 하우징의 일부 가 접히는 관점에서, 세미-폴드 상태, 서브 펼침 상태(또는 서브 폴드 상태), 제1 접힘 상태, 중간 상태 (intermediate state) 및/또는 오목한(concave) 상태로 지칭될 수 있다. 도 17의 상태(1700c)는, 제3 상태를 나타낸다. 제3 상태 내에서, 제1 각도 및 제2 각도는, 실질적으로 0도일 수 있다. 예를 들어, 제2 상태 내에서, 제1 하우징이 제2 하우징에 대하여 회전됨에 따라, 전자 장치 는, 제2 상태로부터 제3 상태로 변경될 수 있다. 예를 들어, 사용자가 제1 하우징을 접기 위해서 외 력을 가하면, 제1 하우징은, 제1 힌지 어셈블리(예: 도 3b의 제2 힌지 어셈블리)를 통해, 제2 하우징에 대하여 시계 방향(clockwise)으로 회전될 수 있다. 제1 힌지 어셈블리는, 제1 하우징 이 제2 하우징에 대하여 안으로 접히도록(folded inward), 제1 하우징 및 제2 하우징(172 0)을 회전 가능하게 연결할 수 있다. 제3 상태는, 폴더블 하우징이 완전히 접히는 관점에서, 제2 접힘 상 태, 폴드 상태 및/또는 닫힌(closed) 상태로 지칭될 수 있다. 예를 들어, 제2 접힘 상태는, 제1 접힘 상태에서,제1 하우징이 접힘으로써 형성될 수 있다. 일 실시예에 따르면, 폴더블 하우징은, 제1 하우징 및 제3 하우징이 안으로 접히는 관점에서, 인-폴드(in-fold) 구조로 지칭될 수 있다. 예를 들어, 제1 접힘 상태 및 제2 접힘 상태는, 플렉서블 디스플레이에 대하여 폴더블 하우징이 안으로 접히는 상태일 수 있다. 폴더블 하우징의 접힌 제3 상태 내에서, 제3 하우징은, 제1 하우징 및 제2 하우징 사이에 위치될 수 있다. 예를 들 어, 도 17의 상태(1700c)를 참조하면, 위에서 아래를 향하는 방향(예: -z 방향)에 대하여, 제1 하우징, 제3 하우징, 및 제2 하우징이 순차적으로 위치될 수 있다. 전자 장치는, 큰 화면의 플렉서블 디스플레이를 사용하기 위해, 제1 상태 내에서 사용될 수 있다. 전자 장치는, 사용자에 의해 용이하게 소지될 수 있도록, 제1 상태로부터 제3 상태로 전환될 수 있다. 예 를 들어, 폴더블 하우징은, 제1 상태로부터 제2 상태를 거쳐서, 제3 상태로 전환될 때, 수 있다. 예를 들 어, 제1 상태 내에서, 제3 하우징이 먼저 제2 하우징에 대하여 안으로 접히고(제2 상태) 나서, 제1 하우징이 제2 하우징에 대하여 안으로 접힐 수 있다(제3 상태). 예를 들어, 상기 제3 상태를 제공하기 위해서, 제1 힌지 어셈블리와 제2 힌지 어셈블리는, 서로 상 이할 수 있다. 만약, 제1 힌지 어셈블리의 사이즈가 제2 힌지 어셈블리의 사이즈와 실질적으로 동 일하거나 유사할 경우, 제1 하우징과 제2 하우징이 접혔을 때, 제3 하우징이 위치될 공간이 형성되지 않을 수 있다. 제3 상태 내에서, 제3 하우징이 제1 하우징과 제2 하우징 사이에 위 치될 수 있는 공간을 제공하기 위해서, 제1 힌지 어셈블리의 사이즈는, 제2 힌지 어셈블리의 사이 즈보다 클 수 있다. 제1 힌지 어셈블리의 사이즈는, 제2 힌지 어셈블리의 사이즈보다 클 수 있다. 상기 사이즈의 차이에 의해, 제1 힌지 커버(예: 도 3b의 제2 힌지 커버)의 사이즈는, 제2 힌지 커버 (예: 도 3b의 제1 힌지 커버)의 사이즈와 상이할 수 있다. 예를 들어, 제1 힌지 커버의 폭(예: 제4 폭(W4))은, 제2 힌지 커버의 폭(예: 3b제 5 폭(W5))보다 넓을 수 있다. 상이한 폭을 가지는 관점에서, 제1 힌지 어셈블리는, 와이드(wide) 힌지로 지칭될 수 있고, 제2 힌지 어셈블리는, 내로 우(narrow) 힌지로 지칭될 수 있다. 전술된 바와 같이, 예시적인 전자 장치는, 안으로 접히는 방식의 폴더블 하우징을 포함할 수 있다. 펼쳐진 상태의 폴더블 하우징은, 먼저 제3 하우징이 제2 하우징에 대하여 안으로 접힌 후, 제1 하우징이 제2 하우징에 대하여 안으로 접히는 순서로 접힐 수 있다. 제3 상태 내에서, 제3 하 우징이 제1 하우징 및 제2 하우징 사이에 위치되기 위해서, 제1 하우징과 제2 하우징 사이에 제3 하우징이 위치될 수 있는 공간이 필요할 수 있다. 도 18은, 예시적인 전자 장치의 단면도이다. 도 18를 참조하면, 플렉서블 디스플레이는, 전자 장치의 접힌 상태 내에서, 부분적으로 구부러지는 (curved) 부분들을 포함할 수 있다. 플렉서블 디스플레이가 부분적으로 구부러지는 것은, 플렉서블 디스 플레이의 일부는, 변형되고, 플렉서블 디스플레이의 나머지 일부는, 변형되지 않는 것으로 참조될 수 있다. 일 실시예에 따르면, 전자 장치가 펼쳐진 상태로부터 접힌 상태로 변경됨에 따라, 플렉서블 디스플레이 는, 변형될 수 있는 변형 영역(deformed area) 및 변형되지 않는 비변형 영역(undeformed area)으로 구분될 수 있다. 변형 영역 및 비변형 영역은, 폴더블 하우징의 상태에 따른 플렉 서블 디스플레이의 형상이 변형되는지 여부로 구분될 수 있다. 변형 영역은, 폴더블 하우징의 접히거나 펼쳐짐에 따라, 변형 가능한 플렉서블 디스플레이의 영역으로 참조될 수 있다. 예를 들어, 플렉서블 디스플레이는, 변형 영역이 접히거나 펼쳐짐으로써 변형 가능하게 하는 구조(예: 격자(lattice) 구조)를 포함할 수 있다. 변형 영역은, 폴더블 하우징 및/또는 힌지 어셈블리(예: 제1 힌지 어셈블리, 제2 힌지 어셈블리)에 의해 적어도 부분적으로 구 부러질 수 있다. 변형 영역이 적어도 부분적으로 굴곡되는 것은, 변형 영역의 일부는 곡률을 가지는 곡면을 형성할 수 있고, 변형 영역의 다른 일부는, 평평한 평면을 형성할 수 있는 것으로 참조될 수 있다. 예를 들어, 전자 장치의 접힌 상태 내에서, 변형 영역의 일부는 곡률을 가지는 곡면을 형성할 수 있고, 변형 영 역의 다른 일부는, 평평한 평면을 형성할 수 있다. 변형 영역은, 제1 표시 영역(예: 도 17의 제1표시 영역)과 제2 표시 영역(예: 도 17의 제2 표시 영역)의 경계 또는 제2 표시 영역과 제3 표시 영역(예: 도 17의 제3 표시 영역)의 경계를 포함함으로써, 폴더블 하우징의 접힘 동작에 의해 변형되는 플렉서블 디스플레이의 부분일 수 있다. 비변형 영역은, 변형 영역과 상이한(different from) 플렉서블 디스플레이의 나머지 영역으 로 참조될 수 있다. 비변형 영역은, 폴더블 하우징 상에 부착되어 고정된 형태를 유지할 수 있다. 비변형 영역은, 전자 장치의 상태와 독립적으로, 실질적으로 평평할 수 있다. 예를 들어, 전자 장치 의 펼쳐진 상태, 접힌 상태, 및/또는 중간 상태 모두에서, 비변형 영역은, 구부러지지 않고 실질적 으로 평평할 수 있다. 일 실시예에 따르면, 변형 영역은, 제1 변형 영역 및 제2 변형 영역을 포함할 수 있다. 전자 장치의 접힌 상태 내에서, 플렉서블 디스플레이의 일부가 접힘으로써, 제1 변형 영역 및 제2 변형 영역이 형성될 수 있다. 예를 들어, 제1 변형 영역은, 제1 표시 영역 및 제2 표시 영역 사이에 형성될 수 있다. 제1 변형 영역의 일부는, 제1 표시 영역이 부분적으로 변형됨으로 써 형성될 수 있고, 제1 변형 영역의 나머지 일부는, 제2 표시 영역이 부분적으로 변형됨으로써 형 성될 수 있다. 예를 들어, 제2 변형 영역은, 제2 표시 영역 및 제3 표시 영역 사이에 형성될 수 있다. 제2 변형 영역의 일부는, 제2 표시 영역이 부분적으로 변형됨으로써 형성될 수 있고, 제2 변형 영역의 나머지 일부는, 제3 표시 영역이 부분적으로 변형됨으로써 형성될 수 있다. 예를 들어, 제1 변형 영역 및 제2 변형 영역과 상이한 비변형 영역은, 제1 영역, 제2 영역, 및 제3 영역으로 구분될 수 있다. 예를 들어, 제1 영역은, 제1 표시 영역 내에 서, 변형되지 않는 영역으로서, 제1 변형 영역과 접할(in contact with) 수 있다. 예를 들어, 제2 영역 은, 제2 표시 영역 내에서, 변형되지 않는 영역으로서, 제1 변형 영역 및 제2 변형 영역 사이에 위치될 수 있다. 예를 들어, 제3 영역은, 제3 표시 영역 내에서, 변형되지 않는 영 역으로서, 제2 변형 영역과 접할 수 있다. 예를 들어, 전자 장치의 접힌 상태 내에서, 제1 영역 및 제2 영역 사이에 제1 변형 영역이 위치될 수 있고, 제2 영역 및 제3 영역 사이에 제2 변형 영역이 위치될 수 있다. 전자 장치가 펼쳐진 상태로부터 접힌 상태로 변경될 때, 제3 하우징이 먼저 안으로 접히기 때문에, 전자 장치의 접힌 상태 내에서, 제1 영역은, 제3 하우징의 배면과 대면할 수 있다. 제3 하우징이 접힌 후, 제3 하우징이 안으로 접히기 때문에, 제3 하우징의 배면은, 제3 표 시 영역이 배치된 전면에 반대인 제3 하우징의 면으로 참조될 수 있다. 일 실시예에 따르면, 전자 장치의 접힌 상태 내에서, 제2 영역은, 제3 영역과 대면할 수 있다. 제1 영역은, 제3 하우징의 배면과 대면하고, 제2 영역은, 제3 영역과 대면하기 때문에, 전자 장치의 접힌 상태 내에서, 영역들(1830, 1840, 1850) 사이의 간격은, 상이할 수 있다. 일 실 시예에 따르면, 상기 접힌 상태 내에서, 제1 영역과 제3 영역 사이의 간격은, 제2 영역과 제 3 영역 사이의 간격보다 클 수 있다. 제1 영역과 제3 영역 사이에 제3 하우징이 위치되기 때문에, 제1 영역과 제3 영역 사이의 간격은, 제3 하우징이 제1 하우징 및 제2 하우징 사이에 위치될 수 있도록 일 정 간격 이상으로 설계될 수 있다. 일 실시예에 따르면, 제1 영역과 제3 영역 사이의 간격은, 제3 하우징의 두께보다 클 수 있다. 예를 들어, 상기 간격이 제3 하우징의 두께보다 작거나 같을 경우, 제3 하우징이 먼저 접힌 상태 (예: 도 17의 상태(1700b)) 내에서, 제1 하우징이 안으로 접힐 때, 제1 하우징이 완전히 접히지 않 거나, 플렉서블 디스플레이의 손상이 야기될 수 있다. 상기 간격이 제3 하우징의 두께보다 크게 형 성됨으로써, 제1 하우징이 완전히 접힐 수 있고, 전자 장치의 접힌 상태 내에서, 제3 하우징 이 제1 하우징 및 제2 하우징 사이에 위치될 수 있다. 예를 들어, 전자 장치가 프레임을 포함 할 경우, 제1 영역과 제3 영역 사이의 거리는, 제3 하우징의 두께 및 프레임의 두께의 합보 다 클 수 있다. 전자 장치의 접힌 상태 내에서, 제3 하우징이 제1 하우징 및 제2 하우징 사이에 위치되 기 위해서, 제1 변형 영역의 폭은, 제3 하우징의 두께보다 클 수 있다. 예를 들어, 제1 변형 영역 의 폭이 제3 하우징의 두께보다 작을 경우, 폴더블 하우징이 완전히 접히지 않을 수 있다. 도 19는, 접힌 상태 내에서, 플렉서블 디스플레이, 제1 힌지 어셈블리, 및 제2 힌지 어셈블리를 도시한다. 도 19를 참조하면, 폴더블 하우징(예: 도 17의 폴더블 하우징)의 접힌 상태 내에서, 플렉서블 디스플레이 는, 변형 영역 및 비변형 영역으로 구분될 수 있다. 전술된 바와 같이, 변형 영역 및 비변형 영역의 구분은, 형상의 변형 여부로 구분될 수 있다. 예를 들어, 변형 영역은, 전자 장치 가 펼쳐진 상태로부터 접힌 상태로 변경됨에 따라, 적어도 부분적으로 구부러지는 플렉서블 디스플레이 의 영역일 수 있다. 예를 들어, 비변형 영역은, 폴더블 하우징의 상태와 독립적으로, 실질적 으로 평평한 플렉서블 디스플레이의 영역일 수 있다. 예를 들어, 변형 영역은, 제1 변형 영역 및 제2 변형 영역을 포함할 수 있다. 예를 들어, 비변형 영역은, 제1 영역, 제2 영 역, 및 제3 영역을 포함할 수 있다. 예를 들어, 제1 변형 영역은, 제1 힌지 어셈블리에 의해 형성될 수 있다. 일 실시예에 따르면, 제1 힌지 어셈블리는, 제1 힌지 플레이트들(예: 제1 플레이트 및 제2 플레이트) 및 제1 힌지 브 라켓을 포함할 수 있다. 제1 플레이트 및 제2 플레이트 각각은, 제1 힌지 브라켓에 회 전 가능하게 연결될 수 있다. 제1 플레이트는, 제1 하우징에 결합될 수 있다. 제2 플레이트 는, 제2 하우징에 결합될 수 있다. 예를 들어, 제1 하우징의 회전을 야기하는 외력이 가해지면, 상 기 외력에 의해 제1 플레이트 및 제2 플레이트가 회전될 수 있다. 도시되지 않았으나, 제1 힌지 어 셈블리는, 제1 플레이트 및 제2 플레이트의 회전 동작을 연동시키는 연동 기어들(예: 도 7b 의 복수의 제2 연동 기어들)을 포함할 수 있다. 예를 들어, 제1 플레이트가 회전됨에 따라, 제1 표 시 영역의 일부가 구부러지고, 제2 플레이트가 회전됨에 따라, 제2 표시 영역의 일부가 구부 러질 수 있다. 제1 표시 영역의 일부 및 제2 표시 영역의 일부에 의해, 제1 변형 영역이 형 성될 수 있다. 제1 변형 영역은, 제1 힌지 플레이트들(예: 제1 플레이트 및 제2 플레이트)에 의해 구부러질 수 있다. 예를 들어, 제2 변형 영역은, 제2 힌지 어셈블리에 의해 형성될 수 있다. 일 실시예에 따르면, 제2 힌지 어셈블리는, 제2 힌지 플레이트들(예: 제3 플레이트 및 제4 플레이트) 및 제2 힌지 브 라켓을 포함할 수 있다. 제3 플레이트 및 제4 플레이트 각각은, 제2 힌지 브라켓에 회 전 가능하게 연결될 수 있다. 제3 플레이트는, 제2 하우징에 결합될 수 있다. 제4 플레이트 는, 제3 하우징에 결합될 수 있다. 예를 들어, 제3 하우징의 회전을 야기하는 외력이 가해지면, 상 기 외력에 의해 제3 플레이트 및 제4 플레이트가 회전될 수 있다. 예를 들어, 제3 플레이트 가 회전됨에 따라, 제2 표시 영역의 다른 일부가 구부러지고, 제4 플레이트가 회전됨에 따라, 제3 표시 영역의 일부가 구부러질 수 있다. 제2 표시 영역의 다른 일부 및 제3 표시 영역의 일부 에 의해, 제2 변형 영역이 형성될 수 있다. 제2 변형 영역은, 제2 플레이트들(예: 제3 플레이트 및 제4 플레이트)에 의해 구부러질 수 있다. 제1 변형 영역은, 제1 힌지 어셈블리에 의해 변형(예: 굴곡)되므로, 접힌 상태 내에서 제1 힌지 어 셈블리의 상태에 기반하여, 제1 변형 영역의 형상이 결정될 수 있다. 일 실시예에 따르면, 제1 변 형 영역은, 제1 굴곡 부분, 제2 굴곡 부분, 및 제1 플랫 부분을 포함할 수 있다. 예를 들어, 제1 굴곡 부분은, 제1 표시 영역이 부분적으로 구부러짐으로써 형성될 수 있다. 예를 들어, 제1 굴곡 부분은, 제1 플레이트에 의해 구부러지는 제1 표시 영역의 일부 내에서, 곡 률(예: 제1 최대 곡률)을 가지도록 구부러지는 부분일 수 있다. 예를 들어, 제2 굴곡 부분은, 제2 표시 영역이 부분적으로 구부러짐으로써 형성될 수 있다. 예를 들어, 제2 굴곡 부분은, 제2 플레이트에 의해 구부러지는 제2 표시 영역의 일부 내에서, 곡 률(예: 제2 최대 곡률)을 가지도록 구부러지는 부분일 수 있다. 일 실시예에 따르면, 제1 굴곡 부분의 제 1 최대 곡률은, 제2 굴곡 부분의 제2 최대 곡률에 대응할 수 있다. 본 개시 내에서, \"최대 곡률\"은, 굴곡 부분(예: 제1 굴곡 부분, 제2 굴곡 부분, 및/또는 제3 굴곡 부분) 내의 곡률 중에서, 가장 큰 곡률을 가지는 지점의 곡률로 참조될 수 있다. 예를 들어, 굴곡 부분이 일정한 곡률을 가지도록 구부러지는 경 우, 굴곡 부분 내의 곡률은, 실질적으로 최대 곡률과 동일할 수 있다. 예를 들어, 굴곡 부분이 일정하지 않은 곡률을 가지도록 구부러지는 경우, 굴곡 부분 내에서 최대 곡률을 가지는 지점이 형성될 수 있다. 예를 들어, 제1 굴곡 부분 및 제2 굴곡 부분은, 제1 플레이트 및 제2 플레이트의 회전 동작에 의해 형성될 수 있다. 제1 플레이트의 회전 동작 및 제2 플레이트의 회전 동작은, 연동 기 어에 의해 연동되기 때문에, 제1 굴곡 부분과 제2 굴곡 부분은, 실질적으로 동일한 형상으로 형성 될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이가 변형되는 제1 굴곡 부분의 제1 최대 곡률 및 제2 굴곡 부분의 제2 최대 곡률은, 플렉서블 디스플레이의 상품성(marketability)를 고려하여 설정될 수 있 다. 예를 들어, 제1 최대 곡률과 제2 최대 곡률이 증가될 경우, 플렉서블 디스플레이의 전체 폭이 감소될 수 있다. 플렉서블 디스플레이의 전체 폭이 감소될 경우, 시각적 정보를 제공하기 위한 표시 영역의 사이 즈가 감소될 수 있다. 콤팩트한(compact) 폴더블 하우징을 이용하여 대화면을 제공할 수 있도록, 제1 굴 곡 부분 및 제2 굴곡 부분은, 약 1.5R보다 작거나 같은 최대 곡률을 가질 수 있다. 예를 들어, 제1 최대 곡률 및/또는 제2 최대 곡률은, 약 1.5R보다 작거나 같을 수 있다. 예를 들어, 제1 최대 곡률 및 제2 최대 곡률은, 플렉서블 디스플레이의 한계 곡률과 동일하거나 유사할 수 있다. 예를 들어, 제1 플랫 부분은, 제1 굴곡 부분과 제2 굴곡 부분 사이에 위치될 수 있다. 일 실 시예에 따르면, 제1 플랫 부분은, 실질적으로 평평할 수 있다. 일 실시예에 따르면, 제1 최대 곡률 및 제2 최대 곡률이 약 1.5R보다 작거나 같은 최대 곡률을 위해서, 제1 플 랫 부분은, 제1 영역 및 제2 영역으로부터 제1 최대 곡률 및 제2 최대 곡률에 대응하는 내경 이상으로 이격될 수 있다. 예를 들어, 제1 플랫 부분과 제2 굴곡 부분 사이의 경계 상에서, 제1 플 랫 부분에 수직한 방향으로 연장되는 가상의 선(L)은, 제2 영역의 면(예: 전면)보다 위에 위 치될 수 있다. 전술된 바와 같이, 제1 최대 곡률 및/또는 제2 최대 곡률이 약 1.5R보다 작거나 같기 위해서, 상 기 가상의 선(L)과 상기 제2 영역의 상기 면 사이의 거리는, 제1 최대 곡률 및/또는 제2 최대 곡률 에 대응하는 내경인, 약 1.5mm보다 크거나 같을 수 있다. 만약, 상기 거리가 약 1.5mm보다 작을 경우, 제1 최대 곡률 및/또는 제2 최대 곡률이 약 1.5R보다 커지기 때문에, 플렉서블 디스플레이의 표시 영역의 사이즈가 축소될 수 있다. 일 실시예에 따르면, 상기 가상의 선(L)이 제2 영역의 상기 면보다 위에 위치되고, 상기 거리가 약 1.5mm보다 크거나 같게 형성됨으로써, 제1 최대 곡률 및/또는 제2 최대 곡률은, 약 1.5R보다 작거나 같을 수 있다. 일 실시예에 따르면, 제1 플랫 부분이 제1 굴곡 부분과 제2 굴곡 부분 사이에 형성되므로, 제1 플랫 부분의 길이는, 제1 영역 및 제3 영역 사이에 위치되는 제3 하우징의 두께보 다 작을 수 있다. 도 20a는, 예시적인 전자 장치의 사시도이다. 도 20b는, 비교예에 따른 전자 장치를 도시한다. 도 20a를 참조하면, 전자 장치는, 키 버튼 및/또는 지문 인식부를 포함할 수 있다. 키 버튼 은, 사용자 입력을 수신하기 위해 사용될 수 있다. 예를 들어, 전자 장치는, 비활성화 상태 내에서 있을 수 있다. 예를 들어, 비활성화 상태는, 전자 장치의 PMIC(power management integrated circuit)가 전력의 제공을 중단한 상태로서, 활성화 상태로의 전환을 위해 부팅(booting)을 요구하는 턴-오프(turn-off) 상 태로 참조될 수 있다. 상기 비활성화 상태는, 유휴 상태(idle state), 대기 상태(standby state), 또는 저전력 상태(low power state)로 참조될 수 있다. 사용자는, 전자 장치를 비활성화 상태로부터 활성화 상태로 전 환시키기 위해, 키 버튼을 누를 수 있다. 프로세서는, 키 버튼에 대한 사용자 입력을 식별함에 기 반하여, 전자 장치를, 비활성화상태로부터 활성화 상태로 전환하도록 구성될 수 있다. 예를 들어, 전자 장 치가 비활성화 상태로부터 활성화 상태로 전환됨에 따라, 커버 디스플레이(예: 도 2의 커버 디스플 레이)는, 시각적 정보를 표시하도록 구성될 수 있다. 이 외에도, 키 버튼은, 지정된 사용자 입력을 수신하기 위해 사용될 수 있다. 예를 들어, 키 버튼은, 스피커로부터 출력되는 오디오 신호의 볼륨을 조 절하기 위한 사용자 입력을 수신하기 위해 사용될 수 있다. 지문 인식부는, 전자 장치의 지정된 사용자를 식별하기 위해 사용될 수 있다. 사용자가 지문 인식부 에 손가락을 접촉시키면, 지문 인식부는, 지문의 패턴을 나타내는 데이터를 프로세서(예: 도 1의 프로세서)로 제공할 수 있다. 프로세서는, 상기 데이터를 통해 식별되는 지문의 제1 패턴이 메모리 내에 등록된 지문의 제2 패턴과 대응하는지 여부를 식별하도록 구성될 수 있다. 일 실시예에 따르면, 지문 인식부 는, 키 버튼을 이용할 수 있다. 예를 들어, 프로세서는, 키 버튼을 통해 식별되는 지문의 제 1 패턴이 메모리 내에 등록된 지문의 제2 패턴에 대응하는지 여부를 식별하도록 구성될 수 있다. 프로세서는,제2 패턴에 대응하는 제1 패턴을 식별함에 기반하여, 전자 장치의 사용을 허용하는 동작(예: 잠금 해제)을 수행하도록 구성될 수 있다. 전자 장치는, 접힌 상태 내에서 사용될 수 있다. 예를 들어, 전자 장치는, 접힌 상태 내에서, 커버 디스플레이를 통해 제공되는 시각적 정보(예: 이미지 및/또는 동영상)를 제공할 수 있다. 예를 들어, 전 자 장치는, 접힌 상태 내에서, 오디오 신호를 방출하도록 스피커를 제어하도록 구성될 수 있다. 일 실시예에 따르면, 접힌 상태 내에서, 사용자가 키 버튼 및/또는 지문 인식부를 사용할 수 있도 록, 키 버튼 및/또는 지문 인식부가 배치될 수 있다. 예를 들어, 접힌 상태 내에서, 사용자가 키 버튼을 누를 수 있도록, 키 버튼은, 접힌 상태의 폴더블 하우징의 외측에 위치될 수 있다. 일 실시예에 따르면, 키 버튼 및/또는 지문 인식부는, 제1 힌지 어셈블리에 반대인 제1 하우 징의 일 측면(예: 도 21의 제2 측면)에 배치될 수 있다. 예를 들어, 키 버튼 및/또는 지문 인식부의 일부는, 제1 하우징의 상기 일 측면으로 노출됨으로써, 사용자는, 접힌 상태 내에 서, 키 버튼 및/또는 지문 인식부를 사용할 수 있다. 예를 들어, 접힌 상태 내에서, 키 버튼 및/또는 지문 인식부는, 제2 힌지 커버 위에 위치될 수 있다. 도 20b 내에 도시된 비교예에 따른 전자 장치는, 키 버튼 및/또는 지문 인식부가 제3 하우징 의 일 측면에 배치된 전자 장치를 나타낸다. 도 20b를 참조하면, 키 버튼 및/또는 지문 인식 부가 제3 하우징의 일 측면(예: 도 21의 제5 측면)에 배치될 경우, 전자 장치의 펼쳐진 상태(2000a) 내에서, 키 버튼 및/또는 지문 인식부는, 전자 장치의 외부로 노출될 수 있다. 제3 하우징이 제2 하우징에 대하여 접힌 중간 상태(2000b) 내에서, 키 버튼 및/또는 지문 인 식부는, 전자 장치의 외부로 노출될 수 있다. 전자 장치의 접힌 상태(2000c)일 때, 제3 하우징 은, 제1 하우징 및 제2 하우징 사이에 위치되므로, 제3 하우징의 일 측면은, 전자 장치의 외부로 노출되지 않고, 제1 힌지 커버에 의해 가려질 수 있다. 제3 하우징의 일 측면이 가려지기 때문에, 키 버튼 및/또는 지문 인식부는, 사용되지 못할 수 있다. 일 실시예에 따르면, 펼쳐진 상태, 중간 상태뿐만 아니라, 접힌 상태 내에서도 키 버튼 및/또는 지문 인 식부가 사용될 수 있도록, 키 버튼 및/또는 지문 인식부는, 제1 하우징의 일 측면 에 배치될 수 있다. 도 21은, 접힌 상태의 예시적인 전자 장치를 도시한다. 도 21을 참조하면, 접힌 상태 내에서, 제1 하우징, 제2 하우징, 및 제3 하우징은, 서로 중첩 될 수 있다. 예를 들어, 제1 하우징과 제2 하우징 사이에 제3 하우징이 위치될 수 있다. 제3 하우징이 제1 하우징과 제2 하우징 사이에 위치될 수 있도록, 접힌 상태 내에서, 제1 하우징 과 제2 하우징 사이에 공간이 형성될 수 있다. 전자 장치의 접힌 상태 내에서, 제1 힌지 커버는, 폴더블 하우징을 사이에 두고, 제2 힌지 커 버와 마주할 수 있다. 예를 들어, 제1 힌지 커버는, 폴더블 하우징의 일 측(예: -x 방향)에 배치될 수 있고, 제2 힌지 커버는, 폴더블 하우징의 다른 측(예: +x 방향)에 배치될 수 있다. 제1 힌지 커버는, 제2 힌지 커버에 반대일 수 있다. 제1 하우징 및 제2 하우징은, 제1 힌 지 커버를 부분적으로 감쌀 수 있다. 예를 들어, 제1 하우징 및 제2 하우징은, 펼쳐지거나 접힐 때, 제1 힌지 커버의 외측에서 회전될 수 있다. 제2 하우징 및 제3 하우징은, 제2 힌지 커버를 부분적으로 감쌀 수 있다. 예를 들어, 제2 하우징 및 제3 하우징은, 펼쳐지거나 접힐 때, 제2 힌지 커버의 외측에서 회전될 수 있다. 도 21 내에 도시된 바와 같이, 제1 힌지 커버 및 제2 힌지 커버는, 접힌 상태 내에서, 폴더블 하우 징으로부터 돌출될 수 있다. 예를 들어, 제1 하우징은, 접힌 상태 내에서, 제1 힌지 커버와 인접하는 제1 측면 및 제1 측 면에 반대인 제2 측면을 포함할 수 있다. 적어도 하나의 키 버튼 및/또는 지문 인식부(178 2)는, 제2 측면을 통해, 폴더블 하우징의 외부로 노출될 수 있다. 제2 하우징은, 접힌 상태 내에서, 제1 힌지 커버와 인접하는 제3 측면 및 제3 측면에 반대인 제4 측면을 포함할 수 있다. 제4 측면은, 제2 힌지 커버와 인접할 수 있다. 제3 하우징은, 접힌 상태 내에서, 제1 힌지 커버를 향하는 제5 측면 및 제5 측면에 반대인 제6 측면을 포함할 수 있다.제6 측면은, 제2 힌지 커버와 인접할 수 있다. 예를 들어, 제1 힌지 커버는, 제1 측면 및 제3 측면으로부터 돌출될 수 있다. 예를 들어, 제 1 측면 및 제3 측면은, 접힌 상태 내에서, 실질적으로 정렬될 수 있다. 제1 측면과 제3 측면 이 실질적으로 정렬되는 것은, 접힌 상태 내에서, 제1 측면과 제3 측면이 동일한 선(L1) 상 에 위치되는 것으로 참조될 수 있다. 제1 측면 및 제3 측면으로부터 돌출되는 제1 힌지 커버(177 1)의 부분은, 약 2.0mm 내지 약 2.5mm 돌출될 수 있다. 예를 들어, 제1 힌지 커버의 외면(1771a)으로부터, 제1 측면(또는 제3 측면)까지의 거리(예: 제1 거리)는, 약 2.3mm일 수 있으나, 이에 제한되지 않는다. 예를 들어, 제2 힌지 커버의 외면(1772a)은, 제4 측면 및 제6 측면으로부터 돌출될 수 있다. 예를 들어, 제4 측면 및 제6 측면은, 접힌 상태 내에서, 실질적으로 정렬될 수 있다. 제4 측면 과 제6 측면이 실질적으로 정렬되는 것은, 접힌 상태 내에서, 제4 측면과 제6 측면이 동일한 선(L2) 상에 위치되는 것으로 참조될 수 있다. 제4 측면 및 제6 측면으로부터 돌출되는 제2 힌지 커버의 부분은, 약 1.5mm 내지 약 2.0mm 돌출될 수 있다. 예를 들어, 제2 힌지 커버의 외면 (1772a)으로부터, 제4 측면(또는 제6 측면)까지의 거리(예: 제2 거리)는, 약 1.7mm일 수 있 으나, 이에 제한되지 않는다. 상기 제1 거리 및 상기 제2 거리는, 전자 장치의 구조에 따라 상이할 수 있다. 예를 들어, 제 1 거리 및 제2 거리는, 제1 힌지 어셈블리 및 제2 힌지 어셈블리의 설계, 폴더블 하우 징의 두께에 따라 달라질 수 있다. 제1 거리 및 제2 거리는, 0보다 클 수 있다. 제1 거리 및 제2 거리는, 제1 하우징의 제1 두께(T1), 제2 하우징의 제2 두께(T2), 및 제3 하 우징의 제3 두께(T3)보다 작을 수 있다. 일 실시예에 따르면, 제1 하우징, 제2 하우징, 및 제3 하우징의 폭은, 서로 상이할 수 있다. 본 개시 내에서, 폭(width)은, 폴더블 하우징의 회전 축에 수직한 방향에 대한 길이로 참조될 수 있다. 제1 하우징은, 제1 폭(W1)을 가질 수 있다. 제2 하우징은, 제2 폭(W2)을 가질 수 있다. 제3 하우징 은, 제3 폭(W3)을 가질 수 있다. 일 실시예에 따르면, 접힌 상태 내에서, 제3 하우징이 제1 하우징 및 제2 하우징 사이에 위 치될 때, 제3 하우징이 플렉서블 디스플레이에 간섭하지 않도록, 제3 폭(W3)은, 제1 폭(W1) 및 제2 폭(W2)보다 좁을 수 있다. 제3 폭(W3)이 제1 폭(W1) 및 제2 폭(W2)보다 좁기 때문에, 접힌 상태 내에서, 제5 측 면은, 제3 측면 및 제1 측면과 정렬되지 않을 수 있다. 제5 측면은, 제1 측면 과 제3 측면을 연결하는 가상의 선(L1)으로부터, 제2 힌지 커버를 향하여(예: +x 방향) 이격될 수 있다. 일 실시예에 따르면, 제1 폭(W1)은, 제2 폭(W2) 및 제3 폭(W3)보다 넓을 수 있다. 접힌 상태 내에서, 제1 하우 징의 제2 측면은, 제2 힌지 커버의 외면(1772a)과 실질적으로 정렬될 수 있다. 제1 측면 과 제2 힌지 커버의 외면(1772a)이 실질적으로 정렬되는 것은, 접힌 상태 내에서, 제1 측면 과 제2 힌지 커버의 외면(1772a)이 동일한 선(L3) 상에 위치되는 것으로 참조될 수 있다. 제2 측면(171 2)이 제2 힌지 커버의 외면(1772a)과 실질적으로 정렬되지 않고, 제2 힌지 커버의 외면(1772a)보다 외측(예: +x 방향)에 위치될 경우, 제1 하우징이 외측으로 돌출되기 때문에, 충격에 의해 제1 하우징 이 쉽게 손상될 수 있다. 제2 측면이 제2 힌지 커버의 외면(1772a)과 실질적으로 정렬됨으로 써, 폴더블 하우징은, 접힌 상태 내에서, 컴팩트(compact)할 수 있다. 제2 측면을 통해 노출되는 적어도 하나의 키 버튼 및/또는 지문 인식부는, 사용자가 적어도 하나의 키 버튼 및/또는 지 문 인식부를 누르기 쉽도록, 상기 선(L3)으로부터 돌출될 수 있다. 예를 들어, 제1 측면과 제3 측면이 실질적으로 정렬되기 때문에, 제2 폭(W2)은, 제1 폭(W1)에서 제 2 거리를 뺀 값에 대응할 수 있다. 예를 들어, 제1 폭(W1)이 약 67.2mm이고, 제2 거리가 약 1.7mm 인 경우, 제2 폭(W2)은, 약 65.5mm(67.2mm - 1.7mm)일 수 있으나, 이에 제한되지 않는다. 예를 들어, 전자 장치는, 이물질의 유입을 줄이기 위한 캡을 포함할 수 있다. 캡은, 접힌 상 태 내에서, 제3 하우징의 제5 측면과 가깝게 위치될 수 있다. 접힌 상태 내에서, 제3 하우징(173 0)의 제5 측면은, 캡(예: 돌출부(2120a))로부터 이격될 수 있다. 제5 측면이 캡의 돌 출부(2120a)와 접촉할 경우, 제3 하우징이 펼쳐지거나 접힐 때, 캡과 물리적으로 충돌함으로써, 전자 장치의 손상이 야기될 수 있다. 제5 측면이 캡으로부터 이격됨에 따라, 상기 손상을 방지 할 수 있다. 예를 들어, 제5 측면은, 캡으로부터, 제2 힌지 커버를 향하여(예: +x 방향) 이 격됨으로써, 제5 측면과 캡 사이에 갭이 형성될 수 있다. 예를 들어, 상기 갭은, 약 3mm 이하(예: 약 0.75mm)일 수 있으나, 이에 제한되지 않는다. 예를 들어, 제4 측면과 제6 측면이 실질적으로 정렬되기 때문에, 제3 폭(W3)은, 제2 폭(W2)에서 상 기 가상의 선(L1) 대비 캡의 높이 및 제5 측면과 캡 사이의 갭을 뺀 값에 대응할 수 있다. 예를 들어, 제2 폭(W2)이 약 65.5mm이고, 캡의 높이가 약 2.5mm이고, 상기 갭이 약 0.8mm인 경우, 제3 폭(W3)은, 약 62.2mm(65.5mm - 2.5mm - 0.8mm)일 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 제1 하우징, 제2 하우징, 및 제3 하우징이 각각 상이한 폭을 가짐에 따 라, 안으로 접히는 구조의 폴더블 하우징이 형성될 수 있다. 제3 하우징이 제1 하우징과 제2 하우징 사이에 위치될 수 있게 하는 구조를 가짐에 따라, 3개의 하우징들이 안정적으로 접히거나 펼쳐질 수 있다. 전자 장치가 제공된다. 상기 전자 장치는, 제1 하우징, 제2 하우징, 및 제3 하우징을 포함하는 폴더블 하우징을 포함할 수 있다. 상기 전자 장치는,상기 제1 하우징 및 상기 제2 하 우징을 제1 폴딩 축에 대하여 회전 가능하게 연결하고, 복수의 제1 연동 기어들(interlocking gears)을 포함하는 제1 힌지 어셈블리를 포함할 수 있다. 상기 전자 장치는, 상기 제1 하우징 및 상기 제3 하우징을 제2 폴딩 축에 대하여 회전 가능하게 연결하고, 상기 복수의 제1 연동 기어들 보다 많은 복수의 제2 연동 기어들을 포함하는 제2 힌지 어셈블리를 포함할 수 있다. 상기 폴더 블 하우징은, 상기 제1 하우징, 상기 제2 하우징, 및 상기 제3 하우징이 실질적으로 동일 한 평면 상에 배치되는 제1 상태, 상기 제2 하우징이 상기 제1 힌지 어셈블리를 통해, 상기 제1 하우 징에 대하여 안으로 접힌(folded inward) 제2 상태, 및 상기 제2 상태 내에서, 상기 제3 하우징이 상 기 제2 힌지 어셈블리를 통해, 상기 제1 하우징에 대하여 안으로 접힘으로써, 상기 제2 하우징 위에 위치되는 제3 상태를 제공하도록 구성될 수 있다. 본 개시에 따르면, 폴더블 하우징이 완전히 접히는 제3 상태 내에서, 제2 하우징은, 제1 하우징과 제3 하우징 사이에 위치될 수 있다. 제2 힌지 어 셈블리는, 제2 하우징을 위한 공간을 형성하고, 제1 하우징 및 제3 하우징의 상대적으로 큰 회전 범위를 제공하기 위해서, 상대적으로 많은 수의 복수의 제2 연동 기어들을 포함할 수 있다. 예를 들어, 상기 전자 장치는, 상기 제1 힌지 어셈블리를 적어도 부분적으로(at least partially) 수 용(accommodate)하는 제1 힌지 커버를 더 포함할 수 있다. 상기 전자 장치는, 상기 제2 힌지 어셈블 리를 적어도 부분적으로 수용하는 제2 힌지 커버를 더 포함할 수 있다. 상기 제2 힌지 커버의 사이즈는, 상기 제1 힌지 커버의 사이즈보다 클 수 있다. 예를 들어, 상기 제1 힌지 커버는, 상기 제1 상태 내에서, 상기 제1 하우징 및 상기 제2 하우징(22 0)에 의해 실질적으로 가려질 수 있다. 상기 제2 힌지 커버의 적어도 일부는, 상기 제1 상태 내에서, 상기 제1 하우징 및 상기 제3 하우징 사이로 노출될 수 있다. 예를 들어, 상기 전자 장치는, 상기 폴더블 하우징 상에 배치되는 플렉서블 디스플레이를 더 포 함할 수 있다. 상기 전자 장치는, 상기 복수의 제1 연동 기어들과 연동(interlocked)됨으로써, 이동 되는 제1 지지 플레이트를 더 포함할 수 있다. 상기 전자 장치는, 상기 복수의 제2 연동 기어들 과 연동됨으로써, 이동되는 제2 지지 플레이트를 더 포함할 수 있다. 상기 제1 지지 플레이트(141 0)는, 상기 제1 상태 내에서, 상기 플렉서블 디스플레이의 제1 영역을 지지할 수 있다. 상기 제2 지 지 플레이트는, 상기 제1 상태 또는 상기 제2 상태 내에서, 상기 플렉서블 디스플레이의 제2 영역 을 지지할 수 있다. 상기 제2 영역은, 상기 제1 영역보다 넓을 수 있다. 예를 들어, 상기 제3 상태 내에서, 상기 제2 지지 플레이트에 의해 지지되는 상기 제2 영역의 폭은, 상기 제3 상태 내에서, 상기 제1 하우징 및 상기 제3 하우징 사이에 위치되는 상기 제2 하우징 의 두께보다 작을 수 있다. 예를 들어, 상기 제2 지지 플레이트의 폭(width)은, 상기 제1 지지 플레이트의 폭보다 넓을 수 있 다. 예를 들어, 상기 제2 지지 플레이트는, 제1 서브 지지 플레이트(1420-1)를 포함할 수 있다. 상기 제2 지 지 플레이트는, 제2 서브 지지 플레이트(1420-2)를 포함할 수 있다. 상기 제1 서브 지지 플레이트(1420- 1) 및 상기 제2 서브 지지 플레이트(1420-2)는, 상기 복수의 제2 연동 기어들과 연동되어 이동될 수 있다. 예를 들어, 상기 제2 지지 플레이트의 길이는, 상기 제1 지지 플레이트의 길이와 상이할 수 있다. 예를 들어, 상기 제2 영역은, 상기 제3 상태 내에서, 상기 제2 지지 플레이트에 의해 지지됨으로써, 상기 제1 하우징 및 상기 제3 하우징과 수직으로 배치되는 제1 부분을 포함할 수 있다. 상기 제2 영역은, 상기 제3 상태 내에서, 상기 제1 부분과 상기 제1 하우징 상에 배 치된 상기 플렉서블 디스플레이의 영역 사이에 위치되고, 적어도 부분적으로 굴곡되는 제2 부분을 포함할 수 있다. 상기 제2 영역은, 상기 제3 상태 내에서, 상기 제1 부분과 상기 제3 하우징 상에 배치된 상기 플렉서블 디스플레이의 영역 사이에 위치되고, 적어도 부분적으로 굴곡되는 제3 부분 을 포함할 수 있다. 상기 제1 부분의 폭은, 상기 제3 상태 내에서, 상기 제1 하우징과 상기 제3 하우징 사이에 위치되는 상기 제2 하우징의 두께보다 두꺼울 수 있다. 예를 들어, 상기 복수의 제1 연동 기어들은, 제1 기어, 제2 기어, 상기 제1 기어와 상기 제2 기어 사이에 배치되는, 제3 기어, 및 제4 기어를 포함할 수 있다. 상기 복수의 제2 연동 기 어들은, 제5 기어, 제6 기어, 상기 제5 기어와 상기 제6 기어 사이에 배치되는, 제7 기어, 제8 기어, 제9 기어, 및 제10 기어를 포함할 수 있다. 예를 들어, 상기 제1 힌지 어셈블리는, 상기 제1 기어에 연결되는 제1 샤프트를 포함할 수 있다. 상기 제1 힌지 어셈블리는, 상기 제2 기어에 연결되는 제2 샤프트를 포함할 수 있다. 상 기 제2 힌지 어셈블리는, 상기 제5 기어에 연결되는 제3 샤프트를 포함할 수 있다. 상기 제2 힌 지 어셈블리는, 상기 제6 기어에 연결되는 제4 샤프트를 포함할 수 있다. 상기 제3 샤프트(81 3)와 상기 제4 샤프트 사이의 제1 간격은, 상기 제1 샤프트와 상기 제2 샤프트 사이의 제2 간격보다 넓을 수 있다. 예를 들어, 상기 제3 샤프트의 직경(813a)은, 상기 제1 샤프트의 직경(811a)보다 클 수 있다. 예를 들어, 상기 제9 기어 및 상기 제10 기어는, 상기 제7 기어 및 상기 제8 기어 사이에 배치될 수 있다. 상기 제5 기어의 사이즈는, 상기 제6 기어의 사이즈에 대응(corresponds to)할 수 있다. 상기 제7 기어의 사이즈는, 상기 제8 기어의 사이즈에 대응할 수 있다. 상기 제8 기어의 사이즈는, 상기 제10 기어의 사이즈에 대응할 수 있다. 예를 들어, 상기 제9 기어의 사이즈는, 상기 제5 기어의 사이즈 및 상기 제7 기어의 사이즈보다 클 수 있다. 예를 들어, 상기 제5 기어의 사이즈는, 상기 제7 기어의 사이즈보다 작을 수 있다. 예를 들어, 상기 제5 기어의 회전 축(705a) 및 상기 제6 기어의 회전 축(706a)을 연결하는 가상의 제 1 직선(L1)은, 상기 제7 기어의 회전 축(707a) 및 상기 제8 기어의 회전 축(708a)을 연결하는 가상의 제2 직선(L2) 위에 위치될 수 있다. 예를 들어, 상기 제9 기어의 회전 축(709a) 및 상기 제10 기어의 회전 축(710a)을 연결하는 가상의 제3 직선(L3)은, 상기 가상의 제2 직선(L2)위에 위치될 수 있다. 예를 들어, 상기 제1 힌지 어셈블리는, 적어도 하나의 제1 탄성 부재를 포함할 수 있다. 상기 제2 힌지 어셈블리는, 적어도 둘의 제2 탄성 부재들을 포함할 수 있다. 상기 적어도 둘의 제2 탄성 부재 들의 개수는, 상기 적어도 하나의 제1 탄성 부재의 개수보다 많을 수 있다. 예를 들어, 상기 제2 힌지 어셈블리는, 로터리 레일을 포함하고, 상기 제1 하우징 및 상기 제3 하우징에 결합되는 제1 회전 부재를 포함할 수 있다. 상기 제2 힌지 어셈블리는, 상기 로터리 레일이 삽입됨으로써, 상기 제1 회전 부재의 회전을 가이드하는 가이드 홈을 포함하고, 상기 제 1 하우징 및 상기 제2 하우징에 결합되는 가이드 부재를 포함할 수 있다. 상기 제2 힌지 어셈블 리는, 슬롯을 포함하고, 상기 제1 회전 부재와 결합되는 연결 부재를 포함할 수 있다. 상 기 제2 힌지 어셈블리는, 제2 회전 부재를 포함할 수 있다. 상기 제2 회전 부재는, 돌기를 포함할 수 있다. 상기 돌기는, 상기 슬롯 내에 삽입될 수 있다. 상기 돌기는, 상기 슬롯 내에서 이동됨으로써, 상기 제1 회전 부재의 회전 범위를 제한할 수 있다. 상기 제2 회전 부재는, 상기 복수의 제2 연동 기어들 중 적어도 일부와 연결되는 샤프트가 결합됨으로써, 상기 복수의 제2 연동 기 어들의 회전력을 상기 연결 부재를 통해 상기 제1 회전 부재로 전달할 수 있다. 예를 들어, 상기 슬롯은, 상기 슬롯의 일 단(921a, 922a)으로부터 지정된 거리만큼 이격되고, 상기 슬롯 내부를 향하여 돌출된 제1 걸림부(920a)를 포함할 수 있다. 상기 슬롯은, 상기 일 단(921a, 922a)에 반대인 상기 슬롯의 다른 단(921b, 922b)으로부터 상기 지정된 거리만큼 이격되고, 상기 슬롯 내부를 향하여 돌출된 제2 걸림부(920b)를 포함할 수 있다. 예를 들어, 상기 연결 부재는, 상기 슬롯 내에 배치되는 제3 탄성 부재를 포함할 수 있다. 상 기 제3 탄성 부재는, 상기 슬롯의 일 단(921a, 922a)으로부터 지정된 거리만큼 이격되고, 상기 슬롯 내부를 향하여 돌출된 제3 걸림부를 포함할 수 있다. 상기 제3 탄성 부재는, 상기 일 단 (921a, 922a)에 반대인 상기 슬롯의 다른 단(921b, 922b)으로부터 상기 지정된 거리만큼 이격되고, 상기 슬롯 내부를 향하여 돌출된 제4 걸림부를 포함할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 전 자 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예:스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리(13 0)와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다."}
{"patent_id": "10-2023-0181263", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 일 실시예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는, 폴더블 하우징을 포함하는 예시적인 전자 장치를 도시한다. 도 3a는, 예시적인 전자 장치의 폴더블 하우징 및 힌지 어셈블리들을 도시한다. 도 3b는, 예시적인 전자 장치의 상태들을 도시한다. 도 4a는, 제2 힌지 어셈블리의 분해도이다. 도 4b는, 제2 힌지 어셈블리의 일부를 도시한다. 도 5a는, 예시적인 제2 힌지 어셈블리의 제1 회전 부재를 도시한다. 도 5b는, 예시적인 제2 힌지 어셈블리의 가이드 부재를 도시한다. 도 5c는, 도 5a 내에 도시된 제1 회전 부재와 도 5b 내에 도시된 가이드 부재가 결합된 상태를 도시한다. 도 6a는, 예시적인 제2 힌지 어셈블리를 도 5c의 A-A'를 따라서 절단한 단면도이다. 도 6b는, 제1 암 및 제2 암이 연동되지 않은 경우, 제1 회전 부재의 동작을 도시한다. 도 6c는, 제1 암 및 제2 암이 연동된 경우, 제1 회전 부재의 동작을 도시한다. 도 7a는, 예시적인 제1 힌지 어셈블리의 복수의 제1 연동 기어들을 도시한다. 도 7b는, 예시적인 제2 힌지 어셈블리의 복수의 제2 연동 기어들을 도시한다. 도 7c는, 예시적인 제1 힌지 어셈블리 및 예시적인 제2 힌지 어셈블리를, 개략적으로 도시한다. 도 8a는, 예시적인 제1 힌지 어셈블리의 샤프트들 및 예시적인 제2 힌지 어셈블리의 샤프트들을 도시한다. 도 8b는, 예시적인 제2 힌지 어셈블리의 제2 회전 부재를 도시한다. 도 9a는, 예시적인 제1 힌지 어셈블리의 제1 회전 부재와 제2 회전 부재의 결합 관계를 도시한다. 도 9b는, 예시적인 제2 힌지 어셈블리를 도시한다. 도 9c는, 제1 상태 또는 제2 상태 내에서, 예시적인 제1 힌지 어셈블리를, 도 9b의 B-B'를 따라서 절단한 단면 도이다. 도 9d는, 제3 상태 내에서, 예시적인 제1 힌지 어셈블리를, 도 9b의 B-B'를 따라서 절단한 단면도이다. 도 10a은, 예시적인 제2 힌지 어셈블리의 동작 과정을 도시한다. 도 10b는, 폴더블 하우징과 제2 힌지 어셈블리 사이의 단면을 도시한다. 도 11a는, 예시적인 제2 힌지 어셈블리의 동작 과정을 도시한다. 도 11b는, 제1 상태 또는 제2 상태 내에서, 제1 회전 부재와 가이드 부재의 연결 부분에 대한 단면도이다. 도 11c는, 예시적인 제2 힌지 어셈블리의 일부를 도시한다. 도 12a는, 예시적인 제1 힌지 기어의 일부 및 예시적인 제2 힌지 어셈블리의 일부를 도시한다. 도 12b는, 예시적인 제2 힌지 어셈블리를, 도 12a의 C-C'를 따라서 절단한 단면도이다. 도 12c는, 예시적인 제2 힌지 어셈블리의 슬롯 및 돌기를 도시한다. 도 12d는, 제2 힌지 어셈블리의 회전 각도에 따른 제2 힌지 어셈블리의 상태들을 도시한다. 도 12e는, 슬롯 내에 배치되는 제3 탄성 부재를 도시한다. 도 13은, 예시적인 제2 힌지 어셈블리의 일부를 도시한다. 도 14a는, 예시적인 제2 힌지 어셈블리와 예시적인 제2 지지 플레이트의 분해 사시도이다. 도 14b는, 제2 지지 플레이트가 제2 힌지 커버에 결합된 상태를 도시한다. 도 14c는, 예시적인 전자 장치의 상태에 따른 플렉서블 디스플레이를 도시한다. 도 15a는, 예시적인 제2 힌지 어셈블리의 동작에 따른 플렉서블 디스플레이의 변형 과정을 개략적으로 도시한다. 도 15b는, 예시적인 제2 힌지 어셈블리와 제2 지지 플레이트를 도시한다. 도 15c는, 예시적인 제1 힌지 어셈블리와 예시적인 제2 힌지 어셈블리를 도시한다. 도 16a은, 예시적인 제2 지지 플레이트에 의한 효과를 설명하기 위한 도면이다. 도 16b는, 제2 지지 플레이트를 포함하지 않는 전자 장치의 일부를 도시한다. 도 16c는, 제2 지지 플레이트를 포함하는 전자 장치의 일부를 도시한다. 도 17은, 예시적인 전자 장치가 펼쳐진 상태로부터 접힌 상태로 변형되는 과정을 도시한다. 도 18은, 예시적인 전자 장치의 단면도이다. 도 19는, 접힌 상태 내에서, 플렉서블 디스플레이, 제1 힌지 어셈블리, 및 제2 힌지 어셈블리를 도시한다. 도 20a는, 예시적인 전자 장치의 사시도이다. 도 20b는, 비교예에 따른 전자 장치를 도시한다. 도 21은, 접힌 상태의 예시적인 전자 장치를 도시한다."}
