{"patent_id": "10-2019-0147944", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0060730", "출원번호": "10-2019-0147944", "발명의 명칭": "인공지능을 이용한 태아 박동 진단방법, 장치 및 시스템", "출원인": "네오컨버전스 주식회사", "발명자": "남영진"}}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능을 이용한 태아 박동 진단장치가 인공지능을 이용한 태아의 박동 진단방법에 있어서,태아 박동 소리를 수신하는 단계,상기 태아 박동 소리에서 심장 박동 정보를 추출하여 분당 심박수를 계산하는 단계,기 설정된 특정 시간동안 상기 분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하는 단계,상기 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하는 단계,기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이터를 분석하여 정상/이상을 분류하는 단계를 포함하는 인공지능을 이용한 태아 박동 진단방법."}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "인공지능을 이용한 태아 박동 진단장치가 인공지능을 이용한 태아의 박동 진단방법에 있어서,태아 박동 소리를 수신하는 단계,상기 태아 박동 소리에서 심장 박동 정보를 추출하여 제1분당 심박수를 계산하는 단계,태아 박동으로부터 획득한 제2분당 심박수를 수신하는 단계,기 설정된 명령에 따라 기 설정된 특정 시간동안 상기 제1분당 심박수와 상기 제2분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하는 단계,상기 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하는 단계,기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이터를 분석하여 정상/이상을 분류하는 단계를 포함하는 인공지능을 이용한 태아 박동 진단방법."}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 기 설정된 명령이 상기 제1분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하라는 명령이면, 상기 제1분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하고,상기 기 설정된 명령이 상기 제2분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하라는 명령이면, 상기 제2분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하는 것을 특징으로 하는 인공지능을 이용한 태아 박동 진단방법."}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 기 설정된 명령이 상기 제1분당 심박수와 상기 제2분당 심박수에서 우선순위가 높은 분당 심박수를 이용하라는 명령이면,상기 기 설정된 명령에 따라 상기 우선순위를 파악하고, 상기 우선순위가 높은 상기 분당 심박수를 상기 메디그래프 변환하여 상기 메디 그래프를 생성하고,상기 기 설정된 명령이 상기 제1분당 심박수와 상기 제2분당 심박수를 비교 분석하여, 상기 제1분당 심박수와상기 제2분당 심박수의 평균값을 이용하라는 명령이면, 상기 제1분당 심박수와 상기 제2분당 심박수의 상기 평균값을 계산하고, 상기 제1분당 심박수와 상기 제2분당공개특허 10-2021-0060730-3-심박수의 상기 평균값을 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하는 것을 특징으로 하는 인공지능을 이용한 태아 박동 진단방법."}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 또는 제2항에 있어서,상기 전처리 데이터는,상기 메디 그래프를 스펙트로그램 변환하여 생성된 스펙트로그램 데이터인 것을 특징으로 하는 인공지능을 이용한 태아 박동 진단방법."}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "기 학습된 태아 박동 진단 딥러닝 신경망을 저장하는 메모리,태아 박동 소리에서 심장 박동 정보를 추출하여 분당 심박수를 계산하고, 기 설정된 특정 시간동안 상기 분당심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 상기 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하고, 기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이터를 분석하여 정상/이상을 분류하도록 제어하는 제어부를 포함하는 인공지능을 이용한 태아 박동 진단장치."}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "기 학습된 태아 박동 진단 딥러닝 신경망을 저장하는 메모리,태아 박동 소리에서 심장 박동 정보를 추출하여 제1분당 심박수를 계산하고, 태아 박동으로부터 획득한 제2분당심박수를 수신하고, 기 설정된 명령에 따라 기 설정된 특정 시간동안 상기 제1분당 심박수와 상기 제2분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 상기 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하고, 기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이터를 분석하여 정상/이상을 분류하도록 제어하는 제어부를 포함하는 인공지능을 이용한 태아 박동 진단장치."}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제어부는 상기 기 설정된 명령이 상기 제1분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를생성하라는 명령이면, 상기 제1분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하고,상기 기 설정된 명령이 상기 제2분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하라는 명령이면, 상기 제2분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하도록 제어하는 것을 특징으로 하는 인공지능을 이용한 태아 박동 진단장치."}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 제어부는 상기 기 설정된 명령이 상기 제1분당 심박수와 상기 제2분당 심박수에서 우선순위가 높은 분당심박수를 이용하라는 명령이면,상기 기 설정된 명령에 따라 상기 우선순위를 파악하고, 상기 우선순위가 높은 상기 분당 심박수를 상기 메디그래프 변환하여 상기 메디 그래프를 생성하고,상기 기 설정된 명령이 상기 제1분당 심박수와 상기 제2분당 심박수를 비교 분석하여, 상기 제1분당 심박수와상기 제2분당 심박수의 평균값을 이용하라는 명령이면, 상기 제1분당 심박수와 상기 제2분당 심박수의 상기 평균값을 계산하고, 상기 제1분당 심박수와 상기 제2분당심박수의 상기 평균값을 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하도록 제어하는 것을 특징으로 하는 인공지능을 이용한 태아 박동 진단장치."}
{"patent_id": "10-2019-0147944", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "태아 박동 소리를 수신하고, 상기 태아 박동 소리에서 심장 박동 정보를 추출하여 제1분당 심박수를 계산하고,공개특허 10-2021-0060730-4-태아 박동으로부터 획득한 제2분당 심박수를 수신하고, 기 설정된 명령에 따라 기 설정된 특정 시간동안 제1분당 심박수 또는 제2분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 상기 메디 그래프에서 특성추출 및 전처리를 수행하여 전처리 데이터를 생성하고, 상기 전처리 데이터를 서버로 전송하는 단말,상기 전처리 데이터를 수신하고, 기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이터를 분석하여 정상/이상을 분류하는 서버를 포함하는 인공지능을 이용한 태아 박동 진단시스템."}
{"patent_id": "10-2019-0147944", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능을 이용한 태아 박동 진단방법, 장치 및 시스템에 관한 것이다. 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단방법은 인공지능을 이용한 태아 박동 진단장치가 인공지능을 이용한 태아의 박동 진단방법에 있어서, 태아 박동 소리를 수신하는 단계, 태아 박동 소리에서 심장 박동 정보를 추출하여 분당 심박수를 계산하는 단계, 기 설정된 특정 시간동안 분당 심박수를 메디 그래프 변환 하여 메디 그래프를 생성하는 단계, 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하는 단계, 기 학습된 태아 박동 진단 딥러닝 신경망이 전처리 데이터를 분석하여 정상/이상을 분류하는 단계를 포함 한다."}
{"patent_id": "10-2019-0147944", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 이용한 태아 박동 진단방법, 장치 및 시스템에 관한 것이다."}
{"patent_id": "10-2019-0147944", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반인의 경우 신체 접촉을 통한 일반 심장 박동 장치들로 심장 박동의 측정이 가능하나 태아의 경우 엄마의 뱃 속에 있어 일반적 장치로 심장 박동을 측정하는 것은 어려움이 있다. 또한, 태아는 일반인과는 다른 맥박수와 패턴을 가지고 있어 기존 일반인 데이터를 기반으로 하는 진단 기준으 로는 판단할 수 없고, 태아의 맥박 이상여부가 태아 이상여부의 가장 중요한 요소이다. 그러나, 심장 박동을 통한 태아를 진단하는 것은 현재 전문의들의 청진에 의해 진행되고 있으며, 국내에서 인공 지능(AI)을 이용하여 태아의 심장 박동 소리와 시계열 데이터를 통해 태아 이상을 진단하는 사례는 없다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-1936302호 (2019년01월02일 등록)"}
{"patent_id": "10-2019-0147944", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적인 과제는 인공지능을 이용하여 태아 박동을 효율적으로 진단하여 태아의 정상/ 이상을 확인할 수 있는 인공지능을 이용한 태아 박동 진단방법, 장치 및 시스템을 제공하는데 있다."}
{"patent_id": "10-2019-0147944", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단방법은 인공지능을 이용한 태아 박동 진단장치가 인공지능을 이용한 태아의 박동 진단방법에 있어서, 태아 박동 소리를 수신하는 단계, 상기 태아 박동 소리에서 심장 박동 정보를 추출하여 분당 심박수를 계산하는 단계, 기 설정된 특정 시간동안 상기 분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하는 단계, 상기 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하는 단계, 기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이터를 분석하여 정상/이상 을 분류하는 단계를 포함한다. 본 발명의 다른 실시예에 따른 인공지능을 이용한 태아 박동 진단방법은 인공지능을 이용한 태아 박동 진단장치 가 인공지능을 이용한 태아의 박동 진단방법에 있어서, 태아 박동 소리를 수신하는 단계, 상기 태아 박동 소리 에서 심장 박동 정보를 추출하여 제1분당 심박수를 계산하는 단계, 태아 박동으로부터 획득한 제2분당 심박수를 수신하는 단계, 기 설정된 명령에 따라 기 설정된 특정 시간동안 상기 제1분당 심박수와 상기 제2분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하는 단계, 상기 메디 그래프에서 특성 추출 및 전처리를 수행하여 전 처리 데이터를 생성하는 단계, 기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이터를 분석하여 정상 /이상을 분류하는 단계를 포함한다. 상기 기 설정된 명령이 상기 제1분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하라는 명령 이면, 상기 제1분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하고, 상기 기 설정된 명령이 상기 제2분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하라는 명령이면, 상기 제2분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하는 것을 특징으로 한다. 상기 기 설정된 명령이 상기 제1분당 심박수와 상기 제2분당 심박수에서 우선순위가 높은 분당 심박수를 이용하 라는 명령이면, 상기 기 설정된 명령에 따라 상기 우선순위를 파악하고, 상기 우선순위가 높은 상기 분당 심박 수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하고, 상기 기 설정된 명령이 상기 제1분당 심박수와 상기 제2분당 심박수를 비교 분석하여, 상기 제1분당 심박수와 상기 제2분당 심박수의 평균값을 이용하라는 명 령이면, 상기 제1분당 심박수와 상기 제2분당 심박수의 상기 평균값을 계산하고, 상기 제1분당 심박수와 상기 제2분당 심박수의 상기 평균값을 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하는 것을 특징으로 한다. 상기 전처리 데이터는, 상기 메디 그래프를 스펙트로그램 변환하여 생성된 스펙트로그램 데이터인 것을 특징으 로 한다. 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단장치는 기 학습된 태아 박동 진단 딥러닝 신경망 을 저장하는 메모리, 태아 박동 소리에서 심장 박동 정보를 추출하여 분당 심박수를 계산하고, 기 설정된 특정 시간동안 상기 분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 상기 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하고, 기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이 터를 분석하여 정상/이상을 분류하도록 제어하는 제어부를 포함한다. 본 발명의 다른 실시예에 따른 인공지능을 이용한 태아 박동 진단장치는 기 학습된 태아 박동 진단 딥러닝 신경 망을 저장하는 메모리, 태아 박동 소리에서 심장 박동 정보를 추출하여 제1분당 심박수를 계산하고, 태아 박동 으로부터 획득한 제2분당 심박수를 수신하고, 기 설정된 명령에 따라 기 설정된 특정 시간동안 상기 제1분당 심 박수와 상기 제2분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 상기 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하고, 기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이 터를 분석하여 정상/이상을 분류하도록 제어하는 제어부를 포함한다. 상기 제어부는 상기 기 설정된 명령이 상기 제1분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하라는 명령이면, 상기 제1분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하고, 상기 기 설정된 명령이 상기 제2분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하라는 명령이면, 상기 제2분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하도록 제어하는 것을 특징으로 한 다. 상기 제어부는 상기 기 설정된 명령이 상기 제1분당 심박수와 상기 제2분당 심박수에서 우선순위가 높은 분당 심박수를 이용하라는 명령이면, 상기 기 설정된 명령에 따라 상기 우선순위를 파악하고, 상기 우선순위가 높은 상기 분당 심박수를 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하고, 상기 기 설정된 명령이 상기 제1 분당 심박수와 상기 제2분당 심박수를 비교 분석하여, 상기 제1분당 심박수와 상기 제2분당 심박수의 평균값을 이용하라는 명령이면, 상기 제1분당 심박수와 상기 제2분당 심박수의 상기 평균값을 계산하고, 상기 제1분당 심 박수와 상기 제2분당 심박수의 상기 평균값을 상기 메디 그래프 변환하여 상기 메디 그래프를 생성하도록 제어 하는 것을 특징으로 한다. 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단시스템은 태아 박동 소리를 수신하고, 상기 태아 박동 소리에서 심장 박동 정보를 추출하여 제1분당 심박수를 계산하고, 태아 박동으로부터 획득한 제2분당 심박 수를 수신하고, 기 설정된 명령에 따라 기 설정된 특정 시간동안 제1분당 심박수 또는 제2분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 상기 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이 터를 생성하고, 상기 전처리 데이터를 서버로 전송하는 단말, 상기 전처리 데이터를 수신하고, 기 학습된 태아 박동 진단 딥러닝 신경망이 상기 전처리 데이터를 분석하여 정 상/이상을 분류하는 서버를 포함한다."}
{"patent_id": "10-2019-0147944", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 인공지능을 이용한 태아 박동 진단방법, 장치 및 시스템에 의하면 다음과 같은 효과가 있다. 첫째, 본 발명은 인공지능(AI)을 이용하여 태아의 심장 박동 소리를 통해서 태아 박동의 이상 패턴을 검출하고, 태아의 정상/이상을 진단할 수 있다. 둘째, 본 발명은 병원으로부터 제공받은 태아 박동 수치 데이터를 딥러닝 기반으로 분석하여 태아 박동의 속도 이상 여부를 확인하고 태아 박동 수치 데이터의 패턴 변화 정보를 이용하여 태아의 정상/이상을 진단할 수 있다. 셋째, 본 발명은 인공지능을 이용하여 태아 박동 패턴 분석 딥러닝 모델을 개발할 수 있다. 넷째, 본 발명은 딥러닝 기술을 적용하여 태아 심장 박동 파형을 분석하여 태아 심장 박동 저하(Deceleration) 검출하고, 자가 검진을 통한 태아 박동 저하 검출로 태아 사망을 줄여, 태아 사망에 의한 사회적 비용을 줄이고, 출산 기피를 막을 수 있다."}
{"patent_id": "10-2019-0147944", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2019-0147944", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 또한, 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한 다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 이외의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본"}
{"patent_id": "10-2019-0147944", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것 이다. 이하, 본 발명을 보다 구체적으로 설명하기 위하여 본 발명에 따른 실시예들을 첨부 도면을 참조하면서 보다 상 세하게 설명하고자 한다. 본 발명에서 “박동”은 심장의 수축과 확장의 반복운동을 의미한다. 본 발명에서 “태아 박동”은 태아 심장의 수축과 확장의 반복운동을 의미한다. 도 1은 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단장치를 설명하기 위한 블록도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단장치(이하, “진단장치”라 한 다.)는 메모리, 제어부, 표시부, 입력부, 송수신부를 포함한다. 이러한 구성요소는 하나 이상의 통신버스 또는 신호선을 통하여 통신한다. 메모리는 다양한 데이터 저장하는 부분이다. 예를 들어, 메모리는 태아 박동 소리, 분당 심박수(제1분당 심박수, 제2분당 심박수, 메디 그래프, 스펙트 로그램 데이터, 스펙트로그램 기준, 기 설정된 다양한 정보(예를 들어, 기 설정된 명령, 기 설정된 특정시간 등), 기 학습된 태아 박동 진단 딥러닝 신경망 등을 저장할 수 있다. 또한, 메모리는 인공지능 프로그램을 저장할 수 있다. 예를 들어, 메모리는 기 학습된 태아 박동 진단 딥러닝 신경망 또는 기 학습된 태아 박동 진단 딥러닝 프로그램을 저장할 수 있다. 제어부는 본 발명에 따른 진단장치를 제어하는 부분이다. 또한, 제어부는 진단장치의 각 구성요소를 제 어하는 부분이다. 제어부는 태아 박동 소리에서 심장 박동 정보를 추출하여 분당 심박수를 계산하고, 기 설정된 특정 시간동 안 분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하고, 기 학습된 태아 박동 진단 딥러닝 신경망이 전처리 데이터를 분석하여 정상/이 상을 분류하도록 제어한다. 또한, 제어부는 태아 박동 소리에서 심장 박동 정보를 추출하여 제1분당 심박수를 계산하고, 태아 박동으로 부터 획득한 제2분당 심박수를 수신하고, 기 설정된 명령에 따라 기 설정된 특정 시간동안 제1분당 심박수와 제 2분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 메디 그래프에서 특성 추출 및 전처리를 수행하 여 전처리 데이터를 생성하고, 기 학습된 태아 박동 진단 딥러닝 신경망이 전처리 데이터를 분석하여 정상/이상 을 분류하도록 제어한다. 또한, 제어부는 기 설정된 명령이 제1분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하라는 명령 이면, 제1분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 기 설정된 명령이 제2분당 심박수를 메 디 그래프 변환하여 메디 그래프를 생성하라는 명령이면, 제2분당 심박수를 메디 그래프 변환하여 메디 그래프 를 생성하도록 제어한다. 또한, 제어부는 기 설정된 명령이 제1분당 심박수와 제2분당 심박수에서 우선순위가 높은 분당 심박수를 이 용하라는 명령이면, 기 설정된 명령에 따라 우선순위를 파악하고, 우선순위가 높은 분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하고, 기 설정된 명령이 제1분당 심박수와 제2분당 심박수를 비교 분석하여, 제1분 당 심박수와 제2분당 심박수의 평균값을 이용하라는 명령이면, 제1분당 심박수와 제2분당 심박수의 평균값을 계 산하고, 제1분당 심박수와 제2분당 심박수의 평균값을 메디 그래프 변환하여 메디 그래프를 생성하도록 제어한 다. 표시부는 사용자와 진단장치 사이의 시각적인 출력을 위한 인터페이스를 제공한다. 표시부는 스펙트로 그램 데이터, 메디 그래프, 진단 결과 등을 사용자가 식별할 수 있도록 표시하는 부분이다. 입력부는 사용자와 진단장치 사이의 명령신호를 입력하는 인터페이스를 제공한다. 즉, 입력부는 사용자 가 진단장치에 입력신호와 같은 명령신호 등을 입력할 수 있고, 사용자가 입력부를 통해서 입력신호를 입력 하면, 진단장치는 다양한 종류의 사용자 입력신호를 검출하고 제어부의 제어에 의해서 사용자의 명령을 수 행한다. 사용자는 입력부를 통해서 기 설정된 명령이나 기 설정된 특정시간 등을 변경하는 명령신호를 진단장치에 입력할 수 있다. 다만, 터치스크린과 같은 일부 실시예에서는 표시부와 입력부가 일체로 될 수 있고, 분리될 수도 있다. 송수신부는 전자파와 같은 신호로 데이터를 송수신하는 부분이다. 송수신부는 전기신호를 전자파로 변 환하며 이 전자파를 통하여 통신 네트워크 및 다른 통신장치와 통신한다. 예를 들어, 송수신부는 제어부의 제어에 따라서 메디 그래프 정보, 전처리 데이터를 외부 서버에 전송 하거나, 외부 서버로부터 진단 결과 정보를 수신할 수 있다. 도 2는 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단방법을 설명하기 위한 흐름도이다. 이하의 설명에서, 진단장치는 내부에 포함된 제어부의 제어에 의해서 동작이 수행되는 것이라고 설명될 수 있다. 도 2를 참조하면, 진단장치는 태아 박동 소리를 수신한다(S201). 진단장치는 수신한 태아 박동 소리에서 심장 박동 정보를 추출하여 분당 심박수(BPM: beats per minute)를 계산 한다(S202). 진단장치는 기 설정된 특정 시간동안 분당 심박수를 메디 그래프(Medi-Graph) 변환하여 메디 그래프를 생성한다 (S203). 여기서, 메디 그래프는 기 설정된 특정 시간동안 분당 심박수의 시계열 기록 그래프를 의미한다. 이때, 본 발명은 기 설정된 특정 시간에 대해서 사용자가 설정 가능하며, 기 설정된 특정 시간이 없는 경우, 진 단장치는 분당 심박수를 메디 그래프(Medi-Graph) 변환하여 메디 그래프를 생성한다. 진단장치는 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성한다(S204). 메디 그래프에 서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하는 하나의 실시예로, 진단장치는 메디 그래프를 스펙트로그램(sprectrogram) 변환하여 스펙트로그램 데이터를 생성할 수 있다. 아래 표 1은 스펙트로그램 변환에 대한 상세설명과 기준값의 일 예를 나타낸 것이다. 표 1 스펙트로그램 기준 기준값 샘플링 주기 48000 최소 주파수 0 최대 주파수 24000 Fast Fourier transform 윈도우크기2048 샘플 변환시 이동단위 512 입력 샘플 프레임 입력 샘플 1.0초 프레임 48000/480+1=101 101*128 입력 샘플 0.4초 프레임 19200/512+1=38 38*128 입력 샘플 0.1초 프레임 4800/512+1=11 11*128 본 발명에 따른 스펙트로그램 변환은 상기 표 1과 같은 기준값(또는 기준)에 따라 변환할 수 있는데, 이러한 스 펙트로그램 변환에 대한 스펙트로그램 기준(또는 스펙트로그램 항목)과 기준값은 다양한 실시예가 가능하며, 본 발명은 다양한 형태의 스펙트로그램 변환에 적용 가능하다. 진단장치는 기 학습된 태아 박동 진단 딥러닝 신경망이 전처리 데이터를 분석하여 정상/이상을 분류한다(S205). 여기서, 전처리 데이터는 스펙트로그램 데이터가 가능하다. 예를 들어, 진단장치는 기 학습된 태아 박동 진단 딥러닝 신경망이 전처리 데이터(예를 들어, 스펙트로그램 데 이터)를 분석하여 태아 박동의 이상 패턴을 검출하면 이상(또는 비정상)으로 분류하고, 기 학습된 태아 박동 진 단 딥러닝 신경망이 전처리 데이터(예를 들어, 스펙트로그램 데이터)를 분석하여 태아 박동의 이상 패턴을 검출 하지 못하면 정상으로 분류한다. 본 발명은 태아 박동 데이터의 패턴 분석에서 단위 시간이 수 십분 이상으로 커지게 되면 데이터의 크기가 커지 고 학습 및 분석 성능에 영향을 미치게 되기 때문에 필요한 경우 다음 실시예의 데이터 축소 기법을 혼합하여 사용할 수 있다. 본 발명에서 사용 가능한 데이터 축소 기법은 첫째, 관련이 없거나 중복되는 속성 및 차원을 제거하는 것인 속 성부분집합 선택(attribute subset selection) 기법, 둘째, 원래의 데이터를 압축된 형식으로 축소시키는 것인 차원축소(dimensionality reduction)기법, 셋째, 데이터의 수치 값을 대체 값으로 변경시킴으로써 데이터의 크 기를 줄이는 것인 수치 축소(numerosity reduction)이다. 진단장치는 정상/이상 분류를 이용하여 태아 박동의 이상 여부를 진단한다(S206). 여기서, 사용자(예를 들어, 산모 또는 의사)는 진단장치가 정상/이상 분류를 이용하여 태아 박동이 이상으로 진 단하면 태아의 정밀 진단을 수행할 수 있다. 도 3은 본 발명의 다른 실시예에 따른 인공지능을 이용한 태아 박동 진단방법을 설명하기 위한 흐름도이다. 도 3을 참조하면, 진단장치는 태아 박동 소리를 수신한다(S301). 진단장치는 수신한 태아 박동 소리에서 심장 박동 정보를 추출하여 분당 심박수(BPM: beats per minute)를 계산 한다(S302). 예를 들어, S302단계에서 계산한 분당 심박수를 제1분당 심박수라 할 수 있다. 진단장치는 태아 박동으로부터 획득한 분당 심박수를 수신한다(S303). 예를 들어, 태아 박동으로부터 획득한 분 당 심박수는 병원 등에서 기 보유하고 있는 태아 박동으로부터 획득한 분당 심박수 데이터가 될 수 있다. 예를 들어, S303단계에서 수신한 분당 심박수를 제2분당 심박수라 할 수 있다.진단장치는 기 설정된 명령에 따라 기 설정된 특정 시간동안 분당 심박수(제1분당 심박수 및/또는 제2분당 심박 수)를 메디 그래프(Medi-Graph) 변환하여 메디 그래프를 생성한다(S304). 여기서, 메디 그래프는 기 설정된 특 정 시간동안 분당 심박수의 시계열 기록 그래프를 의미한다. 이때, 본 발명은 기 설정된 명령, 기 설정된 특정 시간에 대해서 사용자가 설정 가능하다. 예를 들어, 진단장치가 S302단계에서 계산한 분당 심박수(예를 들어, 제1분당 심박수)와 S303단계에서 수신한 분당 심박수(예를 들어, 제2분당 심박수) 중 어느 하나를 수신한 경우에 기 설정된 명령이 제1분당 심박수를 메 디 그래프 변환하여 메디 그래프를 생성하라는 명령이면, 장치는 두 분당 심박수 중에서 제1분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성할 수 있다. 다른 실시예로, 진단장치가 S302단계에서 계산한 분당 심박수(예를 들어, 제1분당 심박수)와 S303단계에서 수신 한 분당 심박수(예를 들어, 제2분당 심박수) 중 어느 하나를 수신한 경우에 기 설정된 명령이 제2분당 심박수를 메디 그래프 변환하여 메디 그래프를 생성하라는 명령이면, 장치는 두 분당 심박수 중에서 제2분당 심박수를 메 디 그래프 변환하여 메디 그래프를 생성할 수 있다. 본 발명에서 진단장치가 제1분당 심박수와 제2분당 심박수를 모두 수신한 경우에는 기 설정된 명령은 다양한 형 태의 실시예가 가능하다. 제1실시예로, 기 설정된 명령은 진단장치가 제1분당 심박수와 제2분당 심박수에서 우선순위가 높은 데이터(분당 심박수)를 이용하라는 명령이 가능하다. 이때, 진단장치는 제1분당 심박수와 제2분당 심박수를 모두 수신 후에, 기 설정된 명령에 따라 우선순위를 파악하고, 우선순위가 높은 분당 심박수를 메디 그래프 변환하여 메디 그래 프를 생성할 수 있다. 제2실시예로, 기 설정된 명령은 진단장치가 제1분당 심박수와 제2분당 심박수를 비교 분석하여, 두 데이터(제1 분당 심박수와 제2분당 심박수)의 평균값을 이용하라는 명령이 가능하다. 이때, 진단장치는 제1분당 심박수와 제2분당 심박수를 모두 수신 후에, 기 설정된 명령에 따라 제1분당 심박수와 제2분당 심박수의 평균값을 계산하 고, 두 분당 심박수(제1분당 심박수와 제2분당 심박수)의 평균값을 메디 그래프 변환하여 메디 그래프를 생성할 수 있다. 진단장치는 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성한다(S305). 메디 그래프에 서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하는 하나의 실시예로, 진단장치는 메디 그래프를 스 펙트로그램(sprectrogram) 변환하여 스펙트로그램 데이터를 생성할 수 있다. 진단장치는 기 학습된 태아 박동 진단 딥러닝 신경망이 전처리 데이터를 분석하여 정상/이상을 분류한다(S306). 여기서, 전처리 데이터는 스펙트로그램 데이터가 가능하다. 예를 들어, 장치는 기 학습된 태아 박동 진단 딥러닝 신경망이 전처리 데이터(예를 들어, 스펙트로그램 데이터) 를 분석하여 태아 박동의 이상 패턴을 검출하면 이상(또는 비정상)으로 분류하고, 기 학습된 태아 박동 진단 딥 러닝 신경망이 전처리 데이터(예를 들어, 스펙트로그램 데이터)를 분석하여 태아 박동의 이상 패턴을 검출하지 못하면 정상으로 분류한다. 진단장치는 정상/이상 분류를 이용하여 태아 박동의 이상 여부를 진단한다(S307). 여기서, 사용자(예를 들어, 산모 또는 의사)는 진단장치가 정상/이상 분류를 이용하여 태아 박동이 이상으로 진 단하면 태아의 정밀 진단을 수행할 수 있다. 도 4는 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단시스템을 설명하기 위한 흐름도이다. 도 4를 참조하면, 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단시스템(이하, “진단시스템” 라 한다.)는 단말과 서버를 포함한다. 본 발명에서 단말과 서버는 각각이 진단장치가 될 수 있다. 단말은 태아 박동 소리를 수신한다(S401). 단말은 박동 소리에서 심장 박동 정보를 추출하여 분당 심박수(예를 들어, 제1분당 심박수)를 계산 및/또는 태아 박동으로부터 획득한 분당 심박수(예를 들어, 제2분당 심박수)를 수신한다(S402). 예를 들어, 태아 박동으로부터 획득한 분당 심박수(예를 들어, 제2분당 심박수)는 병원 등에서 기 보유하고 있는 데이터가 될 수 있다. 단말은 기 설정된 명령에 따라 기 설정된 특정 시간동안 분당 심박수(제1분당 심박수 및/또는 제2분당 심박 수)를 메디 그래프(Medi-Graph) 변환하여 메디 그래프를 생성한다(S403). 여기서, 기 설정된 명령, 기 설정된 특정 시간은 상기 도 3에서 설명한 예들이 가능하다. 단말은 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성한다(S404). 메디 그래프에서 특성 추출 및 전처리를 수행하여 전처리 데이터를 생성하는 하나의 실시예로, 진단장치는 메디 그래프를 스펙트 로그램(sprectrogram) 변환하여 스펙트로그램 데이터를 생성할 수 있다. 단말은 전처리 데이터를 서버로 전송한다(S405). 예를 들어, 전처리 데이터는 스펙트로그램 데이터가 가 능하다. 서버는 기 학습된 태아 박동 진단 딥러닝 신경망이 전처리 데이터를 분석하여 정상/이상을 분류한다(S406). 서버는 정상/이상 분류를 이용하여 태아 박동의 이상 여부를 진단한다(S407). 서버는 진단 결과 정보를 단말로 전송한다(S408). 단말은 진단 결과를 표시한다(S409). 단말이 진단 결과를 표시하면, 사용자(예를 들어, 산모 또는 의사)는 진단 결과를 확인하고, 태아 박동이 이 상으로 진단된 것을 확인하면 태아의 정밀 진단을 수행할 수 있다. 이와 같이, 본 발명은 태아의 박동에서 이상 패턴을 검출하여 태아의 이상 여부를 진단할 수 있다. 본 발명의 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 기록매체에 기록될 수 있다. 컴퓨터 판독 가능 기록매체는 프로그램 명령, 데이터 파일, 데이 터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 기록매체에 기록되는 프로그램(프로그램 명령)은 본 발 명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수 도 있다. 컴퓨터 판독 가능 기록매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체 (Magnetic media), CDROM, DVD와 같은 광기록 매체(Optical media), 플롭티컬 디스크(Floptical disk)와 같은 자기-광 매체(Magneto-optical media), 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것 과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다. 이상과 같이 본 발명을 도면에 도시한 실시예를 참고하여 설명하였으나, 이는 발명을 설명하기 위한 것일 뿐이 며, 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자라면 발명의 상세한 설명으로부터 다양한 변형 또는 균등한 실시예가 가능하다는 것을 이해할 수 있을 것이다. 따라서 본 발명의 진정한 권리범위는 특허청구범위의 기술적 사상에 의해 결정되어야 한다."}
{"patent_id": "10-2019-0147944", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단장치를 설명하기 위한 블록도이다. 도 2는 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단방법을 설명하기 위한 흐름도이다. 도 3은 본 발명의 다른 실시예에 따른 인공지능을 이용한 태아 박동 진단방법을 설명하기 위한 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 인공지능을 이용한 태아 박동 진단시스템을 설명하기 위한 흐름도이다."}
