{"patent_id": "10-2023-0127491", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0170357", "출원번호": "10-2023-0127491", "발명의 명칭": "전력 신호의 송신 또는 수신을 위한 코일의 정렬을 확인하기 위한 전자 장치 및 그 방법", "출원인": "삼성전자주식회사", "발명자": "박정균"}}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(electronic device)(101; 901)에 있어서,상기 전자 장치의 일 면 상에 형성된 폐루프(closed loops)의 형태를 가지고, 무선 충전 신호를 송신 또는 수신하기 위한 제1 코일(260);상기 일 면 상에서, 서로 이격되어 배치되고, 상기 제1 코일의 도선에 감긴(wound) 복수의 제2 코일들(120); 및상기 복수의 제2 코일들을 이용하여, 상기 제1 코일 및 상기 무선 충전 신호를 수신 또는 송신하기 위한 외부전자 장치의 제3 코일 사이의 위치 관계를 센싱하기 위한 프로세서(210)를 포함하는,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 복수의 제2 코일들은,상기 제1 코일의 상이한 부분들에서, 상기 도선의 방향과 실질적으로 직교하는(orthogonal to) 방향을 따라 상기 도선에 감긴,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1 내지 청구항 2에 있어서, 상기 복수의 제2 코일들은,상기 폐루프의 형태를 가지는 상기 제1 코일 상에서, 상기 도선의 방향을 따라 지정된 간격만큼 이격된,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1 내지 청구항 3에 있어서, 상기 복수의 제2 코일들은,상기 일 면 상에서 동심원들의 형태를 상기 제1 코일을 4등분하는(quartering) 위치들에 배치된,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1 내지 청구항 4에 있어서,상이한 공진 주파수들에 기반하여 상기 복수의 제2 코일들을 구동하기 위하여 상기 복수의 제2 코일들 각각에연결된, 임피던스 매칭 회로들을 더 포함하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0170357-3-청구항 5에 있어서, 상기 프로세서는,상기 제1 코일을 이용하여 상기 외부 전자 장치로, 상기 공진 주파수들 각각에 기반하는 무선 충전 신호들을 송신할 것을 요청하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 5에 있어서, 상기 프로세서는,상기 복수의 제2 코일들 중 적어도 하나를 통해 수신된 무선 충전 신호의 상기 공진 주파수들 각각에서의 세기들을, 지정된 임계 세기와 비교하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서, 상기 프로세서는,상기 세기들 중에서 상기 지정된 임계 세기 미만인 세기를 식별하는 것에 기반하여, 상기 복수의 제2 코일들 중에서 상기 식별된 세기에 대응하는 공진 주파수를 가지는 제2 코일의 위치에 기반하여, 상기 제3 코일로부터 이격된 상기 제1 코일의 적어도 한 부분을 식별하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1 내지 청구항 8에 있어서, 상기 프로세서는,상기 복수의 제2 코일들 각각의 전압들 또는 전류들 중 적어도 하나에 기반하여, 상기 위치 관계를 센싱하도록,구성된,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1 내지 청구항 9에 있어서, 상기 프로세서는,상기 위치 관계에 기반하여, 상기 제3 코일 및 상기 제1 코일 사이의 오정렬(misalignment)을 식별하는 것에 기반하여, 상기 전자 장치의 디스플레이 상에, 상기 오정렬을 나타내는 시각적 객체를 표시하도록, 구성된,전자 장치."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "내지 청구항 16에 있어서, 상기 획득하는 동작은,상기 제1 코일의 상이한 부분들과 중첩된 복수의 제2 코일들 중 적어도 하나에 유도된 상기 전압과 관련된 상기정보를 획득하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서, 상기 탐지하는 동작은,상기 제1 코일에 인접하게 배치된 상기 외부 전자 장치의 제3 코일을 통해 송신된 상기 제1 무선 충전 신호를수신하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11 내지 청구항 12에 있어서, 상기 요청하는 동작은,상기 제1 코일을 이용하여 상기 제2 무선 충전 신호의 송신을 요청하기 위한 제3 무선 충전 신호를 송신하는 동작; 또는상기 제1 코일과 상이한 상기 전자 장치의 안테나를 이용하여, 상기 외부 전자 장치로 상기 제2 무선 충전 신호의 송신을 요청하기 위한 데이터 신호를 송신하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 11 내지 청구항 13에 있어서, 상기 획득하는 동작은,상기 제2 코일에 연결된 임피던스 매칭 회로의 양 단들 사이의 전압 또는 전류 중 적어도 하나를 센싱하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 11 내지 청구항 14에 있어서, 상기 표시하는 동작은,상기 제2 코일에 유도된 교류 신호의 상기 공진 주파수에서의 피크 전압이 임계 전압 이하일 시에, 상기 전자장치의 디스플레이 상에 상기 시각적 객체를 표시하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 11 내지 청구항 15에 있어서,상기 위치 관계에 기반하여, 상기 외부 전자 장치로부터 상기 전자 장치의 배터리를 충전하기 위한 제3 무선 충전 신호를 수신할지 여부를 결정하는 동작을 더 포함하는,방법.공개특허 10-2024-0170357-5-청구항 17"}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서, 상기 획득하는 동작은,상기 복수의 제2 코일들 각각에 대응하는 공진 주파수 및 피크 전압의 조합들에 기반하여, 상기 부분들 및 상기외부 전자 장치 사이의 상기 위치 관계를 확인하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 장치의 방법에 있어서,상기 전자 장치의 일 면 상에 형성된 폐루프의 형태를 가지는 제1 코일을 통해 수신된 제1 무선 충전 신호에 기반하여, 외부 전자 장치를 탐지하는 동작;상기 외부 전자 장치로부터 송신된, 상기 제1 코일 및 상기 외부 전자 장치의 위치 관계를 확인하기 위한 제2무선 충전 신호의 요청에 응답하여, 상기 제1 코일을 이용하여 상기 요청과 관련된 주파수를 가지는 상기 제2무선 충전 신호를 송신하는 동작;상기 제2 무선 충전 신호를 송신한 이후, 상기 외부 전자 장치로부터, 상기 외부 전자 장치에 대한 상기 제1 코일의 위치 관계를 나타내는 정보를 수신하는 동작; 및상기 정보에 기반하여, 상기 외부 전자 장치 및 상기 제1 코일을 정렬하기 위한 시각적 객체를 표시하는 동작을포함하는,방법."}
{"patent_id": "10-2023-0127491", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 19에 있어서, 상기 송신하는 동작은,상기 제1 코일에 대응하는, 상기 외부 전자 장치의 제2 코일과 중첩되고, 상기 제2 코일의 도선에 감긴 제3 코일의 공진 주파수인 상기 주파수를 가지는 상기 제2 무선 충전 신호를 송신하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0127491", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른, 전자 장치는, 일 면 상에 형성된 폐루프의 형태를 가지고, 무선 충전 신호를 수신하기 위한 제1 코일을 포함할 수 있다. 전자 장치는 상기 일 면 상에서, 서로 이격되어 배치되고, 상기 제1 코일의 도선에 감긴 복수의 제2 코일들을 포함할 수 있다. 전자 장치는, 상기 복수의 제2 코일들을 이용하여, 상기 제1 코일 및 상기 무선 충전 신호를 수신 또는 송신하기 위한 외부 전자 장치의 제3 코일 사이의 위치 관계를 센싱하기 위 한 프로세서를 포함할 수 있다."}
{"patent_id": "10-2023-0127491", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(present disclosure)는, 전력 신호의 송신 또는 수신을 위한 코일의 정렬을 확인하기 위한 전자 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0127491", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트폰(smartphone), 태블릿 PC(tablet personal computer), 또는 스마트 워치(smart watch) 등과 같은 전자 장치(electronic device)는 강화된 편의성(convenience)을 제공하기 위하여, 무선으로(by wireless) 전력을 획 득하기 위한 회로를 포함할 수 있다. 상기 회로(예, 코일을 포함하는 회로)를 통해 무선으로 획득되는 전력은, 상기 전자 장치 내 배터리의 충전을 위해 이용될 수 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련된 종래 기술(prior art)로서 적용될 수 있는지에 대하여 어떠한 주장이 나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0127491", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예(an embodiment)에 따른, 전자 장치(electronic device)는, 상기 전자 장치의 일 면 상에 형성된 폐 루프(closed loops)의 형태를 가지고, 무선 충전 신호를 송신 또는 수신하기 위한 제1 코일을 포함할 수 있다. 상기 전자 장치는, 상기 일 면 상에서, 서로 이격되어 배치되고, 상기 제1 코일의 도선에 감긴(wound) 복수의 제2 코일들을 포함할 수 있다. 상기 전자 장치는, 상기 복수의 제2 코일들을 이용하여, 상기 제1 코일 및 상기 무선 충전 신호를 수신 또는 송신하기 위한 외부 전자 장치의 제3 코일 사이의 위치 관계를 센싱하기 위한 프로 세서를 포함할 수 있다. 일 실시예에 따른, 전자 장치의 방법은, 상기 전자 장치의 일 면 상에 형성된 폐루프의 형태를 가지는 제1 코일 을 통해 수신된 제1 무선 충전 신호에 기반하여, 외부 전자 장치를 탐지하는 동작을 포함할 수 있다. 상기 방 법은, 상기 외부 전자 장치로, 상기 제1 코일과 중첩되고, 상기 제1 코일의 도선에 감긴 제2 코일의 공진 주파 수와 관련된 제2 무선 충전 신호의 송신을 요청하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 무선 충전 신호에 의해 상기 제2 코일에 유도된 전압과 관련된 정보를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상 기 정보에 의해 나타나는, 상기 제2 코일과 중첩된 상기 제1 코일의 일부분 및 상기 외부 전자 장치 사이의 위 치 관계에 기반하여, 상기 외부 전자 장치 및 상기 제1 코일을 정렬하기 위한 시각적 객체를 표시하는 동작을 포함할 수 있다. 일 실시예에 따른, 전자 장치의 방법은, 상기 전자 장치의 일 면 상에 형성된 폐루프의 형태를 가지는 제1 코일 을 통해 수신된 제1 무선 충전 신호에 기반하여, 외부 전자 장치를 탐지하는 동작을 포함할 수 있다. 상기 방 법은, 상기 외부 전자 장치로부터 송신된, 상기 제1 코일 및 상기 외부 전자 장치의 위치 관계를 확인하기 위한 제2 무선 충전 신호의 요청에 응답하여, 상기 제1 코일을 이용하여 상기 요청과 관련된 주파수를 가지는 상기 제2 무선 충전 신호를 송신하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 무선 충전 신호를 송신한 이후, 상기 외부 전자 장치로부터, 상기 외부 전자 장치에 대한 상기 제1 코일의 위치 관계를 나타내는 정보를 수신하는 동작을 포함할 수 있다. 상기 방법은, 상기 정보에 기반하여, 상기 외부 전자 장치 및 상기 제1 코일 을 정렬하기 위한 시각적 객체를 표시하는 동작을 포함할 수 있다."}
{"patent_id": "10-2023-0127491", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예들이 첨부된 도면을 참조하여 설명된다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정 하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 및/또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 단수의 표현 은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및/ 또는 B 중 적어도 하나\", \"A, B 또는 C\" 또는 \"A, B 및/또는 C 중 적어도 하나\" 등의 표현은 함께 나열된 항목 들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", \"첫째\" 또는 \"둘째\" 등의 표현들은 해당 구성요소들 을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해 당 구성요소들을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으로 또는 통신적으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 모듈은 ASIC(application-specific integrated circuit)으로 구성될 수 있다. 도 1은, 무선 충전 신호의 송신 또는 수신을 위한 하나 이상의 코일들을 포함하는 전자 장치의 일 실시예 를 도시한다. 일 실시예에서, 사용자에 의해 소유되는 관점에서(in terms of), 전자 장치는 단말(또는 사 용자 단말)로 지칭될(referred as) 수 있다. 단말은, 예를 들어, 랩톱 및 데스크톱과 같은 개인용 컴퓨터 (personal computer, PC)를 포함할 수 있다. 단말은, 예를 들어, 스마트폰(smartphone), 스마트패드 (smartpad), 및/또는 태블릿 PC를 포함할 수 있다. 단말은, 스마트워치(smartwatch) 및/또는 HMD(head- mounted device)와 같은 스마트액세서리를 포함할 수 있다. 실시예가 이에 제한되는 것은 아니며, 단말은, 사 용자의 신체에 이식 가능한(implantable) 디바이스(예, 페이스메이커(pacemaker), 인슐린 펌프 및/또는 인공 와 우(cochlear implants))를 포함할 수 있다. 도 1을 참고하면, 무선 충전 신호를 송신 또는 수신하기 위한 코일을 포함하는 전자 장치가 도시된다. 코일은, 전자 장치의 일 면(예, 후 면(rear surface))에 인접하게 배치될 수 있거나, 또 는 전자 장치의 내부에서 상기 일 면(예, 후 면)에 평행한(또는 반대인) 다른 면에 배치될 수 있다. 예를 들어, 코일은, 디스플레이가 배치된 전자 장치의 일 면(예, 전 면(front surface))과 반대인 다른 면 에서, 외관을 형성하는 하우징의 내 면(inner surface)에 배치될 수 있다. 일 실시예에서, 코일은, 전자 장치 내에서, 전자 장치의 후 면에 인접한 FPCB(flexible printed circuit board) 및/또는 PCB(printed circuit board)에 포함될 수 있다. 코일과 관련된 기능을 수행하기 위한 전자 장치의 하드웨어 구성(hardware configuration)의 일 예가, 도 2를 참고하여 설명된다. 도 1을 참고하면, 전자 장치의 일 면 상에 형성된 코일이 도시된다. 코일은, 폐루프(closed loops)의 형태를 가질 수 있다. 일 면 상에서, 나선의 형태 및/또는 동심원의 형태로 감긴 도선(conductive wire)을 포함하는 코일이 예시적으로 도시되지만, 실시예가 이에 제한되는 것은 아니다. 코일은, 무 선 충전 신호를 송신 또는 수신하도록, 구성될 수 있다. 예를 들어, 코일(예, 이차 코일(secondary coil), 슬레이브 코일, 보조(auxiliary) 코일 및/또는 수신 코일)은, 외부 코일(예, 일차 코일(primary coil), 마스터 코일, 메인 코일 및/또는 송신 코일)로부터 무선 충전 신호를 수신할 수 있다. 일 실시예에 따른, 전자 장치는 코일을 이용하여, 무선 충전 신호의 송신 또는 수신을 위한 동작을 수행할 수 있다. 상기 동작은, 무선 충전 신호의 수신에 기반하여, 전자 장치의 배터리를 충전하는 동작 을 포함할 수 있다. 상기 동작은, 무선 충전 신호의 수신에 기반하여, 전자 장치의 구동을 위한 전기 에 너지를 획득하는 동작을 포함할 수 있다. 상기 동작은, 무선 충전 신호의 송신에 기반하여, 전자 장치와상이한 외부 전자 장치로 전기 에너지를 송신하는 동작을 포함할 수 있다. 상기 동작은, 무선 충전 신호의 송 신 또는 수신에 기반하여, 전자 장치와 상이한 외부 전자 장치와 무선 통신(예, WPC(wireless power consortium)에 의해 정의된 무선 통신 프로토콜에 기반하는 무선 통신)을 수행하는 동작을 포함할 수 있다. 도 1을 참고하면, 코일에 기반하여 통신할 수 있는 예시적인 외부 전자 장치들이 도시된다. 예를 들어, 전자 장치는, 무선 충전 패드로부터 송신된 무선 충전 신호에 기반하여, 전자 장치에 포함된 배 터리를 충전할 수 있거나, 또는 전자 장치의 구동을 위한 전기 에너지를 획득할 수 있다. 상기 전기 에너 지는 무선 충전 패드의 코일(예: 외부 코일)을 통해 전자 장치의 코일로 송신될 수 있다. 예를 들어, 전자 장치는 이어버드 케이스로 무선 충전 신호를 송신하여, 이어버드 케이스로 전 기 에너지를 송신할 수 있다. 이어버드 케이스와 같이, 전자 장치로부터 전기 에너지를 수신하는 외 부 전자 장치는, 상기 전기 에너지에 기반하여 외부 전자 장치에 포함된 배터리를 충전할 수 있다. 상기 전기 에너지는, 코일을 통해 이어버드 케이스의 코일로 송신될 수 있다. 무선 충전 신호를 송신하거나, 또는 수신하기 위하여, 전자 장치에 포함된 코일 및 외부 전자 장치의 코일의 정렬(alignment)이 요구될 수 있다. 예를 들어, 무선 충전 패드로부터 무선 충전 신호를 수신하기 위하여 코일 및 무선 충전 패드의 코일의 정렬이 요구될 수 있다. 예를 들어, 사용자는, 전자 장치의 일 면(예, 후 면)을, 코일이 배치된 무선 충전 패드의 일 면과 접촉하여, 코일들(110, 132) 사이의 거리를 최소화할 수 있다. 또는, 사용자는 코일들(110, 130)이 배치된 전자 장치 및 무선 충 전 패드의 면들이 서로 접촉된 상태 내에서, 전자 장치 및/또는 무선 충전 패드의 위치를 조절 하여(또는, 전자 장치 및/또는 무선 충전 패드를 회전하여), 코일들(110, 130) 사이의 각도 및/또는 위치 관계를 조절할 수 있다. 코일들(110, 130) 사이에서 송신되는 무선 충전 신호의 효율, 및/또는 품질을 유 지하기 위하여, 또는 상기 무선 충전 신호의 감쇄를 줄이기 위하여, 코일들(110, 130)의 정렬이 요구될 수 있다. 일 실시예에 따른, 전자 장치는, 코일 및 외부 전자 장치의 코일 사이의 위치 관계를 센싱하기 위한 센싱 코일들(121, 122, 123, 124)을 포함할 수 있다. 도 1을 참고하면, 4 개의 센싱 코일들(121, 122, 123, 124)을 포함하는 전자 장치의 일 실시예가 도시되지만, 실시예가 이에 제한되는 것은 아니다. 예를 들어, 전자 장치는 코일과 관련된 하나 이상의 센싱 코일들을 포함할 수 있다. 일 실시예에 따르면, 센싱 코일들(121, 122, 123, 124)은, 코일에서 서로 이격되어 배치될 수 있다. 예를 들어, 센싱 코일들(121, 122, 123, 124)은, 코일의 서로 다른 부분들에 배치될 수 있다. 예를 들어, 폐루 프의 형태를 가지는 코일 상에서, 센싱 코일들(121, 122, 123, 124)은 코일의 도선의 방향을 따라 지 정된 간격 만큼 이격될 수 있다. 일 실시예에서, 동심원의 형태로 감긴 코일을 포함하는 도 1의 예시적인 전자 장치 내에서, 센싱 코일들(121, 122, 123, 124)은, 상기 코일을 4등분하는(quartering) 위치들 에 배치될 수 있다. 예를 들어, 센싱 코일들(121, 122, 123, 124)은, 코일의 동심원의 원주 (circumference)를 4등분하는 위치들에 배치될 수 있다. 센싱 코일들(121, 122, 123, 124)은 상기 원주의 방 향을 따라 90 º의 간격 만큼 이격될 수 있다. 예를 들어, 전자 장치가 n 개의 센싱 코일들을 포함하는 경우, 상기 센싱 코일들은 코일의 원주의 방향을 따라, 360 º/n의 간격 만큼 서로 이격될 수 있다. 일 실시예에 따르면, 동심원 형태로 감긴 도선에 의해 형성된 코일을 포함하는 전자 장치 내에서, 센 싱 코일들(121, 122, 123, 124)은 상기 도선에 감길(wound) 수 있다. 예를 들어, 센싱 코일들(121, 122, 123, 124) 각각은, 동심원 형태로 감긴 코일을 감는 원환체(toroid)의 일부분의 형태를 가질 수 있다. 센싱 코 일들(121, 122, 123, 124) 각각은, 코일을 감는 공간 나선(helix)의 형태를 가질 수 있다. 예를 들어, 센싱 코일들(121, 122, 123, 124)은, 코일의 상기 도선의 방향과 실질적으로 직교하는(orthogonal to) 방 향을 따라 상기 도선(또는 도선의 다발(bundle))에 감길 수 있다. 코일에 감긴 센싱 코일들(121, 122, 123, 124)의 예시적인 구조가, 도 3a, 도 3b 및/또는 도 3c를 참고하여 설명된다. 일 실시예에 따른, 전자 장치는, 센싱 코일들(121, 122, 123, 124)을 이용하여, 코일 및 무선 충전 신호를 수신 또는 송신하기 위한 외부 전자 장치의 다른 코일(예, 코일들(132, 142)) 사이의 위치 관계를 센싱 하기 위한 프로세서를 포함할 수 있다. 전자 장치의 프로세서는 센싱 코일들(121, 122, 123, 124)의 전압 들 및/또는 전류들을 식별하도록, 구성될 수 있다. 센싱 코일들(121, 122, 123, 124) 중 적어도 하나에서, 코 일과 관련된 무선 충전 신호에 의해, 교류 신호가 유도될 수 있다. 상기 교류 신호의 전압 및/또는 전류 에 기반하여, 전자 장치는 코일 및 상기 다른 코일 사이의 상기 위치 관계를 센싱할 수 있거나, 탐지할 수 있거나, 또는 식별할 수 있다. 코일 및 다른 코일 사이의 위치 관계에 기반하여, 전자 장치는 코일 및 상기 다른 코일 사이의 오정렬(misalignment)을 식별할 수 있다. 일 실시예에서, 상기 오정렬을 식별한 전자 장치는, 디스플레이 (미도시), 스피커, LED(light emitting diode) 및/또는 진동 모터(또는 햅틱 액추에이터)와 같은 출력 수단을 이용하여, 사용자에게 상기 오정렬을 알릴 수 있다. 예를 들어, 전자 장치는 디스플레이 상에, 상기 오정 렬을 나타내는 시각적 객체 및/또는 화면을 표시할 수 있다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치는 코일의 도선에 감긴 센싱 코일들(121, 122, 123, 124)을 이용하여, 코일 및 상기 코일과 무선 충전 신호를 송신 또는 수신하기 위한 다른 코일(예, 코 일들(132, 142)을 포함하는 외부 전자 장치의 코일)의 오정렬을 식별할 수 있다. 상기 오정렬은, 상기 무선 충 전 신호의 효율(예, 배터리의 충전 속도 및/또는 충전 시간과 같은 충전 효율)을 줄일 수 있고, 열의 발생을 야 기할 수 있다. 일 실시예에 따른 전자 장치는 센싱 코일들(121, 122, 123, 124)을 이용하여 상기 오정렬 을 식별할 수 있다. 오정렬을 식별한 경우, 전자 장치는 사용자에게 상기 오정렬에 기반하는 전자 장치 및/또는 외부 전자 장치의 이동 및/또는 정렬을 가이드할 수 있다. 상기 이동 및/또는 상기 정렬에 기반 하여, 전자 장치는 외부 전자 장치의 코일에 대하여, 무선 충전 신호를 송신 또는 수신하기에 적합한 위치 로 이동될 수 있다. 상기 위치 내에서, 코일을 통해 송신 또는 수신되는 무선 충전 신호의 품질이 개선될 수 있다. 이하에서는 도 2를 참고하여, 코일 및/또는 센싱 코일들(121, 122, 123, 124)을 제어하기 위한 전자 장치 의 하드웨어 구성의 일 예가 설명된다. 도 2는, 일 실시예에 따른, 전자 장치의 블록도의 일 예를 도시한다. 도 1의 전자 장치는 도 2를 참 고하여 설명되는 전자 장치의 하드웨어를 포함할 수 있다. 도 2를 참고하면, 일 실시예에 따른, 전자 장 치는 프로세서, 메모리, 디스플레이, PMIC(power management integrated circuit) 또는 배터리 중 적어도 하나를 포함할 수 있다. 프로세서, 메모리, 디스플레이 및 PMIC는 통신 버스(a communication bus)와 같은 전자 부품(electronical component)에 의해 서로 전 기적으로 및/또는 작동적으로 연결될 수 있다(electronically and/or operably coupled with each other). 일 실시예에서, 전자 장치의 하드웨어 컴포넌트들이 작동적으로 결합된 것은, 하드웨어 컴포넌트들 중 제1 하드웨어 컴포넌트에 의해 제2 하드웨어 컴포넌트가 제어되도록, 하드웨어 컴포넌트들 사이의 직접적인 연결, 또는 간접적인 연결이 유선으로, 또는 무선으로 수립된 것을 의미할 수 있다. 상이한 블록들에 기반하여 도시 되었으나, 실시예가 이에 제한되는 것은 아니며, 도 2의 하드웨어들 중 일부분(예, 프로세서 및/또는 메모 리의 적어도 일부분)이 SoC(system on a chip)와 같은 단일 집적 회로(single integrated circuit)에 포 함될 수 있다. 전자 장치에 포함된 하드웨어 컴포넌트의 타입 및/또는 개수는 도 2에 도시된 바에 제한되 지 않는다. 예를 들어, 전자 장치는 도 2의 블록들에 기반하여 도시된 하드웨어 컴포넌트들 중 일부만 포 함할 수 있다. 일 실시예에 따른, 전자 장치의 프로세서는 하나 이상의 인스트럭션들에 기반하여 데이터를 처리하기 위한 하드웨어 및/또는 회로를 포함할 수 있다. 데이터를 처리하기 위한 하드웨어 및/또는 회로는, 예를 들어, ALU(arithmetic and logic unit), FPU(floating point unit), FPGA(field programmable gate array), CPU(central processing unit) 및/또는 AP(application processor)를 포함할 수 있다. 프로세서의 개수 는 하나 이상일 수 있다. 예를 들어, 프로세서는 듀얼 코어(dual core), 쿼드 코어(quad core), 헥사 코 어(hexa core) 또는 옥타 코어(octa core)와 같은 멀티-코어 프로세서의 구조를 가질 수 있다. 일 실시예에 따른, 전자 장치의 메모리는 프로세서에 입력 및/또는 출력되는 데이터 및/또는 인 스트럭션을 저장하기 위한 하드웨어 컴포넌트를 포함할 수 있다. 메모리는, 예를 들어, RAM(random- access memory)과 같은 휘발성 메모리(volatile memory) 및/또는 ROM(read-only memory)과 같은 비휘발성 메모 리(non-volatile memory)를 포함할 수 있다. 휘발성 메모리는, 예를 들어, DRAM(dynamic RAM), SRAM(static RAM), Cache RAM, PSRAM (pseudo SRAM) 중 적어도 하나를 포함할 수 있다. 비휘발성 메모리는, 예를 들어, PROM(programmable ROM), EPROM (erasable PROM), EEPROM (electrically erasable PROM), 플래시 메모리, 하 드디스크, 컴팩트 디스크, SSD(solid state drive), 또는 eMMC(embedded multi-media card) 중 적어도 하나를 포함할 수 있다. 일 실시예에 따른, 전자 장치의 디스플레이는 사용자에게 시각화된 정보를 출력할 수 있다. 예를 들 어, 디스플레이는, GPU(graphic processing unit) 및/또는 프로세서와 같은 컨트롤러에 의해 제어되 어, 사용자에게 시각화된 정보(visualized information)를 출력할 수 있다. 디스플레이는 예를 들어, LCD(liquid crystal display), PDP(plasma display panel) 및/또는 하나 이상의 LED들(light emitting diod e)을 포함할 수 있다. 상기 LED는 OLED(organic LED)를 포함할 수 있다. 디스플레이는 예를 들어, 전자 종이(electronic paper)를 포함할 수 있다. 예를 들어, 디스플레이는, 직육 면체의 형태를 가지거나, 적 어도 부분적으로 휘어진 형태를 가지거나, 및/또는 변형가능한(deformable) 형태를 가질 수 있다. 일 실시예에 따른, 전자 장치의 디스플레이는, 디스플레이 상의 외부 객체(예, 사용자의 손가락)를 탐지하기 위한 센서(예, TSP(touch sensor panel))를 포함할 수 있다. 예를 들어, TSP에 기반하여, 전자 장치의 프로세서는 디스플레이와 접촉하거나, 또는 디스플레이 상을 부유하는 (floating) 외부 객체를 탐지할 수 있다. 상기 외부 객체를 탐지하는 것에 응답하여, 전자 장치는 디스플 레이 상에 표시되고 있는 시각적 객체들 중에서 상기 외부 객체의 디스플레이 상에서의 위치에 대응 하는 특정 시각적 객체와 관련된 기능을 실행할 수 있다. 일 실시예에 따른 전자 장치의 PMIC는, 프로세서의 제어에 따라, 배터리로부터 획득되는 전력을 전자 장치 내의 하드웨어 컴포넌트들(예: 프로세서, 메모리, 디스플레이 및/또는 PMIC) 각각에게 제공하기 위해 이용될 수 있다. PMIC는, 프로세서의 제어에 따라, 배터리(24 0)의 충전 및/또는 방전을 수행하도록, 구성될 수 있다. 도 2를 참고하면, 전자 장치는, 전기 에너지의 송신 또는 수신을 위한 코일들(예, 전력 코일 및/또는 센싱 코일)을 포함할 수 있다. 도 1의 코일은, 도 2의 전력 코일을 포함할 수 있다. 도 2의 센싱 코일은, 도 1의 센싱 코일들(121, 122, 123, 124)을 포함할 수 있다. 일 실시예에 따른, 전자 장치 의 PMIC는, 전력 코일 및/또는 센싱 코일을 제어하기 위한 무선 충전 회로를 포함할 수 있다. 무선 충전 회로의 예시적인 구조가, 도 5a 및/또는 도 5b를 참고하여 설명된다. 일 실시예에 따른, 전자 장치의 프로세서는, 무선 충전 회로를 이용하여, 전력 코일 및/또 는 센싱 코일을 제어할 수 있다. 예를 들어, 프로세서는 전력 코일을 이용하여, 배터리에 저장된 전기 에너지를 무선으로 출력할 수 있다. 실시예가 이에 제한되는 것은 아니며, 프로세서는 전력 코일을 이용하여, 외부 전자 장치로부터 전기 에너지를 무선으로 수신할 수 있다. 예를 들어, 상기 외부 전자 장치로부터 수신된 무선 충전 신호에 기반하여, 프로세서는 배터리의 충전 및/또는 전자 장치 에 포함된 하드웨어의 구동을 위한 전기 에너지를 획득할 수 있다. 일 실시예에서, 전력 코일은 자기 유도 방식에 기반하여 무선 충전 신호를 송신 또는 수신하도록, 구성될 수 있다. 실시예가 이에 제한되는 것은 아니며, 전력 코일은 자기 공명 방식 및/또는 전계(electric field)에 기반하여, 무선 충전 신호를 송신 또는 수신하도록, 구성될 수 있다. 일 실시예에 따른 전자 장치의 배터리는 화학 에너지로부터, 전자 장치 내 다른 회로 및/또는 하드웨어 컴포넌트들에서 소비될 전기 에너지를 출력할 수 있다. 예를 들어, 전자 장치의 배터리는, 배터리 셀, 배터리 모듈, 또는 배터리 팩을 포함할 수 있다. 배터리는 충전에 의해 전력을 저장하는 축전 기 또는 2차 전지를 포함할 수 있다. 예를 들어, 배터리는 리튬 이온 전지(Li-ion), 리튬 이온 폴리머전 지(Li-ion polymer), 납 축전지, 니켈-카드뮴 전지(NiCd) 및 니켈 수소 축전지(NiMH) 중 어느 하나일 수 있다. 전자 장치의 배터리는, 예를 들어, PMIC의 적어도 일부분(예, 무선 충전 회로) 및/또는 전 력 코일을 통해 수신되는 전력에 의하여 충전될 수 있다. 배터리로 입력되는 전류의 크기가 배터리 로부터 출력되는 전류의 크기보다 클 때에, 배터리는 충전될 수 있다. 배터리로부터 출력되는 전류의 크기가 배터리로 입력되는 전류의 크기보다 클 때에, 배터리는 방전될 수 있다. 일 실시예에서, 전자 장치의 PMIC는 배터리와 구별되는 외부 전력원으로부터 전력을 수신하기 위한 인터페이스를 포함할 수 있다. 예를 들어, 상기 인터페이스는 콘센트(concentric plug)와 같은 배전 시스 템으로부터 전기 에너지를 수신하기 위한 포트(예를 들어, USB-C 타입의 포트)를 포함할 수 있다. 실시예가 이 에 제한되는 것은 아니며, 상기 인터페이스는 도 2의 전력 코일을 포함할 수 있다. 일 실시예에 따른, 전자 장치는 전력 코일의 정렬을 위한 센싱 코일을 포함할 수 있다. 도 1을 참고하여 상술한 바와 같이, 전자 장치는 하나 이상의 센싱 코일들을 포함할 수 있다. 센싱 코일은, 전력 코일의 도선 중 적어도 하나에 감길 수 있다. 일 실시예에서, 센싱 코일의 공진 주파수는, 도선에 감긴 센싱 코일의 턴 수(turn number) 및/또는 상기 센싱 코일에 연결된 회로(예, 인덕터 및/또 는 커패시터를 포함하는 임피던스 매칭 회로)에 의해 결정될 수 있다. 도 1의 센싱 코일들(121, 122, 123, 124)과 같이, 전자 장치가 복수의 센싱 코일들을 포함하는 경우, 상기 복수의 센싱 코일들은 상이한 공진 주파수들을 가질 수 있다. 실시예가 이에 제한되는 것은 아니며, 상기 복수의 센싱 코일들은, 서로 동일한 (identical to each other) 공진 주파수를 가질 수 있다. 일 실시예에 따른, 전자 장치의 프로세서는, 센싱 코일을 이용하여, 전력 코일의 오정렬을 식별할 수 있다. 상기 오정렬은 외부 코일(예, 무선 충전 신호의 송신 또는 수신을 위해 전자 장치의 일 면에 접촉된 외부 전자 장치의 코일)과 전력 코일 사이의 위치 관계와 관련될 수 있다. 예를 들어,전력 코일의 도선에 감긴 센싱 코일을 포함하는 일 실시예에서, 프로세서는 상기 외 부 코일을 식별하는 것에 응답하여, 상기 외부 코일을 포함하는 외부 전자 장치로, 센싱 코일의 공진 주파 수를 가지는 무선 충전 신호의 송신을 요청할 수 있다. 상기 요청은, 전자 장치의 전력 코일에 기반 하여 수행되거나, 블루투스, NFC(near field communication) 및/또는 BLE(bluetooth low energy)에 기반하는 무선 통신 프로토콜에 기반하여, 수행될 수 있다. 일 실시예에서, 센싱 코일을 통해 상기 공진 주파수를 가지는 무선 충전 신호를 수신하는 동안, 프로세서 는 센싱 코일의 전압 및/또는 전류를 측정할 수 있다. 측정된 전압 및/또는 전류를 이용하여, 프로 세서는 전력 코일 및 외부 코일의 정렬 상태를 확인할 수 있다. 일 실시예에서, 전력 코일 및 외부 코일의 오정렬을 식별한 경우, 프로세서는 전력 코일 및 외부 코일의 자세(position)를 변경하 기 위한 알림 메시지를 출력할 수 있다. 예를 들어, 상기 알림 메시지는, 디스플레이 상에 표시되는 팝업 윈도우에 기반하여 시각화될 수 있거나, 스피커 및/또는 진동 모터를 통해 출력될 수 실시예가 이에 제한되는 것은 아니며, 프로세서는 LED(light emitting diode)를 제어하여, 상기 알림 메시지와 관련된 색상을 가지 는 광을 발광(emit)할 수 있다. 프로세서는 LED를 주기적으로 제어하여, 상기 광을 깜박이게(blink) 만들 수 있다. 전력 코일 및 외부 코일이 정렬된 경우, 프로세서는 배터리의 충전을 위한 무선 충전 신호의 송신을, 상기 외부 코일을 포함하는 상기 외부 전자 장치로 요청할 수 있다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치의 프로세서는 센싱 코일을 이용하여, 전력 코 일 및 외부 코일 사이의 오정렬을 확인할 수 있다. 오정렬을 확인한 프로세서는 전력 코일과 외부 코일의 정렬을 가이드하여, 상기 오정렬에 의해 감소되는 충전 효율을 보상할 수 있고, 상기 오정렬에 의 해 발생되는 열을 줄일 수 있다. 예를 들어, 상기 오정렬을 개선하기 위하여, 프로세서는 충전 효율을 개 선할 수 있다. 이하에서는, 도 3a 및/또는 도 3b를 참고하여, 도 2의 전력 코일 및/또는 센싱 코일의 예시적인 구조 가 설명된다. 도 3a, 도 3b 및 도 3c는, 일 실시예에 따른, 전자 장치에 포함된 센싱 코일의 예시적인 구조를 도시한다. 도 1 및/또는 도 2의 전자 장치는, 도 3a, 도 3b 및 도 3c의 전자 장치를 포함할 수 있다. 도 3a를 참고하면, 기준 점(c1)을 기준으로 적층된 코일들(예, 제1 전력 코일(260-1), 제2 전력 코일(260-2) 및 /또는 센싱 코일들(121, 122, 123, 124))이 도시된다. 전자 장치 내부에서, 상기 전자 장치의 일 면(예, 전자 장치의 후 면)을 향하여, 제2 페라이트(ferrite), 제1 전력 코일(260-1) 및 제2 전력 코일(260-2)이 순차적으로 적층될(stacked) 수 있다. 도 3a를 참고하면, 외부 전자 장치(예, 도 1의 무선 충전 패드 및/또는 이어버드 케이스) 내에서, 기준점(c1)을 기준으로 적층된 제1 페라이트 및 전력 코일이 도시된다. 도 3a를 참고하면, 전력 코일 아래에 배치된 제1 페라이트는, 무선 충 전 신호의 차단을 위한 소재를 포함할 수 있다. 도 3a를 참고하면, 제1 페라이트의 일 면 상에 배치된 전력 코일은, 단일 레이어 상에 감긴 도선을 포함할 수 있다. 예를 들어, 전력 코일의 도선은, di1의 내측 지름(inner diameter)을 가지고, do1의 외 측 지름(outer diameter)을 가지는 원의 형태에 기반하여 감길 수 있다. 전력 코일은 일차 코일로 지칭될 수 있다. 도 3a의 기준 점(c1)은 전력 코일의 중심에 대응할 수 있다. 도 3a를 참고하면, 일 실시예에 따른 2 개의 레이어들에 기반하는 구조를 가지는 제1 전력 코일(260-1) 및 제2 전력 코일(260-2)이 도시된다. 예를 들어, 제1 전력 코일(260-1) 및 제2 전력 코일(260-2)의 도선은 di2의 내 측 지름을 가지고, do2의 외측 지름을 가지는 원의 형태에 기반하여 감길 수 있다. 제1 전력 코일(260-1) 및/또는 제2 전력 코일(260-2)은 이차 코일로 지칭될 수 있다. 예를 들어, 제1 전력 코일(260-1) 및 제2 전력 코 일(260-2)은 z 축의 방향을 따라 제2 페라이트 상에 순차적으로 적층될 수 있다. 예를 들어, 제1 전력 코 일(260-1) 및 제2 전력 코일(260-2)은, VIA(vertical interconnect access)와 같은 도전성 구조에 의해 전기적 으로 연결될 수 있다. 도 3a의 기준 점(c1)은 제1 전력 코일(260-1) 및 제2 전력 코일(260-2)의 중심에 대응할 수 있다. 예를 들어, 전자 장치 및 외부 전자 장치가 서로 접촉되는 동안, 외부 전자 장치의 일 면 상에 서 기준 점(c1)을 따라 적층된 제1 페라이트 및 전력 코일이, 전자 장치의 일 면 상에서 기준 점(c1)을 따라 적층된 제2 페라이트, 제1 전력 코일(260-1) 및 제2 전력 코일(260-2)이 서로 마주 볼 수 있다. 외부 전자 장치 내에서 제1 페라이트 및 전력 코일을 정렬하기 위한 기준 점(c1) 및 전 자 장치 내에서 제2 페라이트, 제1 전력 코일(260-1) 및 제2 전력 코일(260-2)을 정렬하기 위한 기준 점(c1)이 서로 정렬되는 경우, 전자 장치 및 외부 전자 장치 사이에서 무선으로 송신되는 전력의 손 실이 최소화될 수 있거나, 또는 줄어들 수 있다. 도 3a를 참고하면, 제1 전력 코일(260-1) 및 제2 전력 코일(260-2)에 포함된 도선들의 다발에 감긴 센싱 코일들 (예, 제1 센싱 코일, 제2 센싱 코일, 제3 센싱 코일 및/또는 제4 센싱 코일)이 도시된다. 예를 들어, 센싱 코일에 포함된 도선의 방향은, 제1 전력 코일(260-1) 및/또는 제2 전력 코일(260-2)에 포함된 도선의 방향과 적어도 부분적으로 수직일 수 있다. 일 실시예에서, 센싱 코일들은, 제1 전력 코일(260-1) 및/ 또는 제2 전력 코일(260-2)의 도선의 상이한 위치들에 배치될 수 있다. 예를 들어, 센싱 코일들은 서로 이격될 수 있다. 도 3a를 참고하면, 4 개의 센싱 코일들에 의해, 제1 전력 코일(260-1) 및/또는 제2 전력 코일(260- 2)은 4분원으로 구분될(distinguished) 수 있다. 일 실시예에 따르면, 제1 센싱 코일 내지 제4 센싱 코일은, 서로 일치되거나, 또는 상이한 공진 주파 수들을 가질 수 있다. 예를 들어, 제1 센싱 코일 내지 제4 센싱 코일 각각의 공진 주파수들을 설정 하기 위한 임피던스 매칭 회로들이, 제1 센싱 코일 내지 제4 센싱 코일 각각에 연결될 수 있다. 센 싱 코일의 인덕턴스 L 및 센싱 코일에 연결된 임피던스 매칭 회로의 커패시터의 커패시턴스 C에 대하여, 센싱 코일의 공진 주파수는, 일 수 있다. 일 실시예에서, 도 3a를 참고하여 설명된, 전력 코일, 제1 전력 코일(260-1), 제2 전력 코일(260-2) 및 센 싱 코일들은, 표 1과 같은 치수(dimensions)를 가질 수 있다. 전력 코일, 제1 전력 코일(260-1) 및/또는 제2 전력 코일(260-2)은, WPC의 기준 코일 모델에 기반하는 구조를 가질 수 있다. 표 1 치수 전력 코일 제1 전력 코일(260-1) 및/또는 제2 전력 코일 (260-2)센싱 코일들 외측 지름 44.14mm 42mm - 내측 지름 20.5mm 12.8mm - 두께 2.46mm 0.21mm 0.21mm 턴 수 10 14 4 레이어 수 1 2 2 표 1의 치수들은, 예시적인 것으로 실시예를 제한하는 것은 아니다. 예를 들어, 제1 센싱 코일 내지 제4 센싱 코일 각각의 턴 수는, 표 1의 턴 수와 다를 수 있다. 도 3b 내지 도 3c를 참고하면, 제1 전력 코일 (260-1) 및 제2 전력 코일(260-2)의 레이어들의 구조가 도시된다. 제1 센싱 코일 내지 제4 센싱 코일 의 도선들은, 제1 전력 코일(260-1) 및 제2 전력 코일(260-2)의 도선에 감기기 위한 구조를 가질 수 있다. 도 3c를 참고하면, z 축에서 바라본, 제1 전력 코일(260-1)이 배치된 제1 레이어 및 제2 전력 코일(260- 2)이 배치된 제2 레이어의 일부분이 도시된다. 제1 레이어 및 제2 레이어가 순차적으로 스택됨 에 따라, 제1 레이어의 지점들(a', b', c', d') 각각이 제2 레이어의 지점들(a, b, c, d)과 중첩될 수 있다. 도 3c를 참고하면, 제1 레이어 및 제2 레이어 사이를 연결하는 VIA에 의해, 제1 레이어 상에 형 성된 도전성 패턴 및 제2 레이어 상에 형성된 도전성 패턴이 전기적으로 연결될 수 있다. 제1 레이어 및 제2 레이어를 연결하는 VIA의 위치가, 파선의 원의 형태에 기반하여, 도 3c에 도시된다. 제1 레 이어 및 제2 레이어 내에서 상기 파선의 원에 할당된 참조 번호(예, v1 내지 v12)는, VIA를 구분하기 위한 참조 번호일 수 있다. 예를 들어, 제1 레이어의 VIA(v11) 및 제2 레이어의 VIA(v11)는, 같은 VIA에 대응할 수 있다. 도 3c를 참고하면, 센싱 코일의 도전성 패턴은, 제1 레이어 및 제2 레이어 전부에 형성될 수 있 다. 예를 들어, VIA들(예, v1, v2, v11, v12)에 의해, 제1 레이어 및 제2 레이어 각각에 형성된 도 전성 패턴들이 서로 연결되어, 센싱 코일을 형성할 수 있다. 예를 들어, 제1 레이어 상에 형성된 제 1 전력 코일(260-1) 및 제2 레이어 상에 형성된 제2 전력 코일(260-2)은 VIA들(예, v3, v4, v5, v6, v7, v8, v9, v10)에 의해 서로 연결될 수 있다. 제2 레이어 상에서, 제1 전력 코일(260-1)을 형성하기 위한 도전성 패턴 및 센싱 코일을 형성하기 위한 도전성 패턴은, 서로 수직인 방향들을 따라 형성될 수 있다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치는 도선(예, 제1 전력 코일(260-1) 및/또는 제2 전력 코일 (260-2))에 감긴 형태를 가지는 센싱 코일을 포함할 수 있다. 예를 들어, 복수의 센싱 코일들(예, 제1 센 싱 코일 내지 제4 센싱 코일)은, 임피던스 매칭에 기반하여 상이한 공진 주파수들을 가질 수 있다. 전자 장치는 주파수 스윕에 기반하여, 상이한 공진 주파수들을 가지는 센싱 코일들 각각의 전압 및/또는 전류를 확인할 수 있다. 확인된 전압 및/또는 전류에 기반하여, 전자 장치는 센싱 코일이 감긴 상기 도선에 의해 형성된 코일 및 외부 코일 사이의 정렬 상태를 확인할 수 있다. 이하에서는, 도 4a, 도 4b, 도 5a, 도 5b 및/또는 도 6을 참고하여, 센싱 코일에 연결된 전자 장치의 예시적인 회로가 설명된다. 도 4a 및 도 4b는, 일 실시예에 따른, 전자 장치에 포함된 센싱 코일들의 등가 회로를 도시한다. 도 1 및 /또는 도 2의 전자 장치는, 도 4a 및/또는 도 4b의 전자 장치를 포함할 수 있다. 도 4a를 참고하면, 일차 코일 및 이차 코일과 상호 결합된(mutually coupled to) 센싱 코일들 의 등가 회로가 도시된다. 일차 코일은, 외부 전자 장치(예, 도 1의 무선 충전 패드, 이어버드 케이 스 및/또는 도 3a의 외부 전자 장치)에 포함된 외부 코일(예, 도 3a의 전력 코일)에 대응할 수 있다. 이차 코일은, 전자 장치에 포함된 전력 코일(예, 도 2의 전력 코일)에 대응할 수 있다. 예를 들어, 일차 코일의 등가 회로는, 일차 코일의 전류(Ip)가 흐르는 인덕터(Lp) 및 상기 인덕터 (Lp)에 연결된 커패시터(Cp), 저항(Rp) 및/또는 교류 전원(Vs)을 포함할 수 있다. 예를 들어, 이차 코일 의 등가 회로는, 이차 코일의 전류(Is)가 흐르는 인덕터(Ls) 및 상기 인덕터(Ls)에 연결된 커패시터(Cs), 저항(Rs) 및/또는 부하 저항(RL)을 포함할 수 있다. 일 실시예에 따르면, 도 4a의 센싱 코일들의 등가 회로를 참고하면, 센싱 코일들 각각은, 인덕터들 (L1, L2, L3, L4) 각각에 연결된 커패시터들 및 하나 이상의 저항들을 포함하는 임피던스 매칭 회로의 조합을 포함할 수 있다. 예를 들어, 센싱 코일들 각각에 연결된 임피던스 매칭 회로들은, 센싱 코일들 각각 을 상이한 공진 주파수들에 기반하여 구동하도록, 구성될 수 있다. 하지만, 실시예가 이에 제한되는 것은 아니 다. 임피던스 매칭 회로들에 포함된 커패시터 및/또는 하나 이상의 저항들은, LC 회로 및/또는 BPF(band pass filter)에 기반하는 구조를 가질 수 있다. 도 4a를 참고하면, 센싱 코일들 각각은, 상호 유도 인덕턴스들에 기반하여, 일차 코일 및/또는 이차 코일과 상호 결합(mutually coupled to)될 수 있다. 센싱 코일들 각각이 일차 코일 및 이차 코일과 상호 결합될 뿐만 아니라, 일차 코일 및 이차 코일 또한 상호 결합될 수 있다(예, 상호 결합 인덕턴스 Mps). 상기 상호 유도 인덕턴스들은, 도 4b의 등가 회로에 도시된 바와 같이, 종속 전압원으로 변경될 수 있다. 도 4b를 참고하면, 일차 코일 및 센싱 코일들의 등가 회로가 도시된다. 일차 코일 및 센싱 코 일들 사이의 상호 유도 인덕턴스는, 일차 코일의 등가 회로 내에 4 개의 종속 전압원들(예, jwMp1I1, jwMp2I2, jwMp3I3, jwMp4I4)로 모델링될 수 있다. 일차 코일 및 이차 코일 사이의 상호 유도 인덕 턴스 는, 일차 코일의 등가 회로 내 종속 전압원(예, jwMs1Is)로 모델링될 수 있다. 센싱 코일들의 등가 회로들 각각은, 일차 코일과의 상호 유도 인덕턴스에 기반하는 종속 전압원(예, jwMpiIp) 및 이차 코일과의 상호 유도 인덕턴스에 기반하는 종속 전압원(예, jwMsiIs)을 포함할 수 있다. 일 실시예에 따른, 전자 장치는, 센싱 코일들의 등가 회로에 흐르는 전류(Isense) 및/또는 임피던스 (Rsense)(또는 등가 저항)를 식별할 수 있거나, 또는 측정할 수 있다. 전자 장치는 전류(Isense) 및/또는 저항(Rsense)을 이용하여, 센싱 코일들이 감긴 이차 코일 및 일차 코일 사이의 정렬 상태를 확 인할 수 있다. 확인된 정렬 상태에 기반하여, 전자 장치는, 이차 코일 및 일차 코일이 오정렬 되었는지 여부를 결정할 수 있다. 예를 들어, 상기 오정렬은 일차 코일 및 이차 코일의 품질 계수 (Q) 및/또는 결합 계수(k)의 변경을 야기할 수 있다. 상기 품질 계수(Q) 및/또는 상기 결합 계수(k)의 변경은, 일차 코일 및 이차 코일 사이의 거리와 관련될 수 있다. 상기 오정렬은 임피던스 성분(예, Li)에 영 향을 주기 때문에, 센싱 코일들 각각의 공진 조건의 변경을 야기할 수 있다. 전자 장치는 상기 공진 조건의 변경에 따른, 전류(Isense) 및/또는 임피던스(Rsense)의 변경에 기반하여, 일차 코일 및 이차 코일 의 위치 관계를 식별할 수 있다. 이하에서는 도 5a 및/또는 도 5b를 참고하여, 도 4a 및/또는 도 4b를 참고하여 설명된 센싱 코일들에 연결 된 무선 충전 회로의 예시적인 구조가 설명된다. 도 5a 및 도 5b는, 일 실시예에 따른, 전자 장치에 포함된 센싱 코일들의 등가 회로를 도시한다. 도 1 및 /또는 도 2의 전자 장치에 포함된 하드웨어는 도 5a 및/또는 도 5b의 등가 회로로 표현될 수 있다. 도 5a 및/또는 도 5b를 참고하면, 전자 장치와 무선으로 연결되는 무선 충전 패드의 예시적인 등가 회로가 도시된다. 무선 충전 패드는 배전 시스템의 교류 신호(alternate current signal, AC signal)를 직류 신호(direct current signal, DC signal)로 변경하기 위한 AC-DC 컨버터를 포함할 수 있다. 무선 충전 패드는 AC-DC 컨버터에 의해 출력되는 상기 직류 신호의 전압 및/또는 전류를 증폭하기 위한 전 력 증폭기를 포함할 수 있다. 무선 충전 패드의 코일은, 전자 장치의 전력 코일에 대한 송신 코일 및/또는 일차 코일로써 동작할 수 있다. 도 5a 및/또는 도 5b를 참고하면, 전자 장치의 전력 코일에 연결된 무선 충전 회로 및/또는 센 싱 코일들(예, 제1 센싱 코일, 제2 센싱 코일, 제3 센싱 코일 및/또는 제4 센싱 코일)의 예시적인 등가 회로가 도시된다. 도 5a를 참고하면, 전자 장치는, 전력 코일 및/또는 센싱 코일들과 무선 충전 회로 사이의 연결을 제어하기 위한 스위치를 포함할 수 있다. 스위치에 의하여, 전 자 장치는 전력 코일 또는 센싱 코일들 중 어느 하나를, 무선 충전 회로와 선택적으로 연결할 수 있다. 도 5a를 참고하면, 무선 충전 회로는, 스위치를 통해 연결된 코일(예, 전력 코일 또는 센싱 코 일들)에서 유도된 교류 신호를 정류하기 위한 AC-DC 정류기를 포함할 수 있다. 무선 충전 회로는 상 기 교류 신호를 탐지할 수 있고, 상기 탐지된 교류 신호에 기반하여 전력 코일 및/또는 센싱 코일들을 제 어하도록 구성된 MCU(micro controlling unit)를 포함할 수 있다. 무선 충전 회로는 AC-DC 정류기 에 의해 정류된 전력 신호(예, 직류 신호)의 전압을 조절하기 위한 LDO(low drop out)를 포함할 수 있다. LDO는, 직류-직류 컨버터 및/또는 선형 정류기로 지칭될 수 있다. LDO는 전자 장치의 배터리와 직접적으로 및/또는 간접적으로 연결되어, 배터리로 정류된 전력 신호를 제공할 수 있다. LDO가 배터리로 상기 전력 신호를 제공하는 동안, 전자 장치의 배터리가 충전될 수 있다. 도 5b를 참고하면, 도 5a의 스위치를 포함하지 않는, 무선 충전 회로의 예시적인 구조가 도시된다. 도 5b의 무선 충전 회로 내에서, AC-DC 정류기 및/또는 MCU는 전력 코일의 일 단에 연결 될 수 있다. 도 5b의 무선 충전 회로는, 센싱 코일들로부터 연장된 포트에 연결된 센서를 포함할 수 있다. 무선 충전 회로는 센서를 이용하여 식별된 센싱 코일들의 전압, 전류 및/또는 임피던스에 기 반하여, 센싱 코일들이 감긴 전력 코일 및 무선 충전 패드의 코일 사이의 위치 관계를 식별할 수 있다. 예를 들어, 전자 장치는 무선 충전 패드와 WPC 및/또는 다른 무선 통신 프로토콜(예, BLE, 블루투스 및/또는 NFC)에 기반하는 통신을 수행하여, 무선 충전 패드가 코일을 통하여 센싱 코일들의 공진 주 파수에 기반하는 무선 충전 신호를 송신하도록 야기할 수 있다. 센싱 코일들이 일치된 공진 주파수를 가지는 경우, 전자 장치는 센싱 코일들 각각에서 유도되는 전압 및/또는 전류를 개별적으로 측정할 수 있다. 센싱 코일들이 상이한 공진 주파수들을 가지는 경우, 전자 장치는 센싱 코일들에서 유도되는 전압 및/또는 전류를 주파수 영역(frequency domain) 내에서 분석하여, 주파수 별 전압 성분 및/또는 전류 성분을 계산할 수 있다. 예를 들어, 제1 센싱 코일의 제1 공진 주파수에서의 전압 성분이 임계치를 초과하는지 여부에 기반 하여, 전자 장치는 제1 센싱 코일이 감긴 전력 코일의 제1 지점 및 코일 사이의 거리를 식 별할 수 있거나, 또는 추정할 수 있다. 예를 들어, 제2 센싱 코일의 제2 공진 주파수에서의 전압 성분이 임계치를 초과하는지 여부에 기반하여, 전자 장치는 제2 센싱 코일이 감긴 전력 코일의 제2 지 점 및 코일 사이의 거리를 식별할 수 있다. 예를 들어, 제3 센싱 코일의 제3 공진 주파수에서의 전 압 성분이 임계치를 초과하는지 여부에 기반하여, 전자 장치는 제3 센싱 코일이 감긴 전력 코일(26 0)의 제3 지점 및 코일 사이의 거리를 식별할 수 있다. 예를 들어, 제4 센싱 코일의 제4 공진 주파 수에서의 전압 성분이 임계치를 초과하는지 여부에 기반하여, 전자 장치는 제4 센싱 코일이 감긴 전 력 코일의 제4 지점 및 코일 사이의 거리를 식별할 수 있다. 예를 들어, 전자 장치는 센싱 코 일들 각각의 공진 주파수들 및 전압 성분(또는 전류 성분)의 조합들에 기반하여, 센싱 코일들이 감긴 전력 코일 및 코일 사이의 위치 관계를 식별할 수 있다. 도 5a의 스위치를 포함하는 일 실시예에서, 전자 장치는 무선 충전 패드를 식별하는 것에 기반 하여, 스위치를 제어하여 센싱 코일들 및 무선 충전 회로를 연결할 수 있다. 예를 들어, 전자 장치 는 무선 충전 패드의 코일을 통해 송신된 무선 충전 신호(예, 핑(ping) 신호 및/또는 비콘 신호)에 응답하여, 스위치를 제어하여 센싱 코일들 및 무선 충전 회로를 연결할 수 있다. 스위치 를 통해 센싱 코일들과 연결된 동안, 무선 충전 회로는 센싱 코일들에서 유도되는 교류 신호의 전압 및/또는 전류를 측정할 수 있다. 센싱 코일들의 공진 주파수에서의 전압 및/또는 전류의 크기에 기반하여, 전 자 장치(또는 무선 충전 회로에 연결된 전자 장치의 프로세서)는, 전력 코일 및 코일 사이의 위치 관계를 식별할 수 있다. 상기 위치 관계에 기반하여, 전력 코일 및 코일 사이의 거리가 지정된 거리 미만임을 식별한 전자 장치는 스위치를 제어하여 전력 코일 및 무선 충전 회로 를 연결할 수 있다. 스위치를 통해 전력 코일 및 무선 충전 회로가 연결된 동안, 무선 충전 회로는 전력 코일 에서 유도되는 교류 신호에 기반하여, 배터리를 충전할 수 있다. 실시예가 이에 제한되는 것은 아니 며, 무선 충전 회로는 전력 코일에서 유도되는 교류 신호를 이용하여, 무선 충전 회로에 연결된 전자 장치의 다른 회로를 구동하기 위한 전기 에너지를 획득할 수 있다. 도 5b를 참고하면, 전자 장치는 전력 코일을 통해 수신된 무선 충전 신호에 기반하여, 외부 전자 장 치(예, 무선 충전 패드)를 탐지할 수 있다. 상기 무선 충전 신호는, 예를 들어, 무선 충전 패드의 코일을 통해 송신될 수 있다. 외부 전자 장치를 탐지한 전자 장치는 외부 전자 장치로, 전력 코일 과 중첩되고, 전력 코일의 도선에 감긴 센싱 코일들의 공진 주파수와 관련된 제2 무선 충전 신호의 송신을 요청할 수 있다. 예를 들어, 상기 제2 무선 충전 신호의 송신을 요청하는 것은, 전자 장치의 전력 코일(예, 도 2의 전력 코일)을 통해 송신되는 제3 무선 충전 신호에 기반하여, 수행될 수 있다. 실시예가 이에 제한되는 것은 아니며, 전자 장치는 상기 전력 코일과 구분되는 안테나(예, 블루투스 통신을 위한 안 테나)를 이용하여 상기 제2 무선 충전 신호의 송신을 요청하기 위한 무선 신호를 송신할 수 있다. 상기 요청 이후, 전자 장치는 무선 충전 회로의 센서를 이용하여, 상기 제2 무선 충전 신호에 의해 상기 센싱 코일들 중 적어도 하나에 유도된 전압 및/또는 전류와 관련된 정보를 획득할 수 있다. 전자 장 치는, 상기 정보에 의해 나타나는, 전력 코일의 적어도 일부분 및 코일(또는 무선 충전 패드 와 같은 외부 전자 장치) 사이의 위치 관계를 식별할 수 있다. 상기 위치 관계에 기반하여, 전자 장치 는 무선 충전 패드와 같은 외부 전자 장치로부터 배터리의 충전을 위한 무선 충전 신호를 수신 할지 여부를 결정할 수 있다. 상기 위치 관계에 기반하여, 전자 장치는 전력 코일 및 코일을 정렬하기 위한 시각적 객체를 표시할 수 있다. 예를 들어, 상기 시각적 객체는 전력 코일 및 코일의 오정렬을 식별하는 것에 기반하여, 표시될 수 있다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치는 전력 코일의 상이한 부분들과 중첩된 센싱 코일들 중 적어도 하나에 유도된 전압 및/또는 전류와 관련된 정보를 획득할 수 있다. 상기 정보는, 전력 코일 및 외부 전자 장치(예, 무선 충전 패드)의 코일 사이의 위치 관계를 나타낼 수 있다. 전력 코일 에 감긴 센싱 코일들을 포함하는 전자 장치의 동작이 설명되었지만, 실시예가 이에 제한되는 것은 아 니다. 이하에서는, 도 6을 참고하여, 도 2의 전력 코일을 이용하여 무선 충전 신호를 송신하는 전자 장치가 센싱 코일들을 이용하여 정렬 상태를 식별하는 예시적인 동작이 설명된다. 도 6은, 센싱 코일들(예, 제1 코일 내지 제4 코일)을 포함하는 무선 충전을 위한 전자 장치의 하드웨어의 등가 회로를 도시한다. 도 1 및/또는 도 2의 전자 장치에 포함된 하드웨어는 도 6의 등가 회 로로 표현될 수 있다. 도 6을 참고하면, 전력 코일을 통해 외부 전자 장치의 코일과 무선으로 연결된 상태에서의 등가 회로가 도시된다. 외부 전자 장치는 코일에 연결된 무선 통신 회로를 이용하여, 코일에 기반하는 데이터 통신(예, WPC에 의해 정의된 무선 통신)을 수행할 수 있다. 예를 들어, 상기 데이터 통신은, 코일을 통해 송신 또는 수신되는 무선 충전 신호의 주파수 및/또는 진폭의 변경에 기반하여, 수행될 수 있 다. 외부 전자 장치는 코일에 유도된 교류 신호를 직류 신호로 변경한 이후, LDO를 이용하여 PMIC의 구동을 위한 전압을 가지는 직류 신호를 획득할 수 있다. 도 6을 참고하면, 전자 장치는 전력 코일로 교류 신호를 송신하기 위한 스위치들(Q1, Q2, Q3, Q4)을 포함할 수 있다. 스위치들(Q1, Q2, Q3, Q4)은, 송신 컨트롤러와 같은 회로에 의해 제어될 수 있다. 외부 전자 장치의 코일을 통해 무선 충전 신호를 수신하는 동안, 전자 장치는 센싱 코일들(예, 제1 센싱 코일 내지 제4 센싱 코일)에서 유도되는 전압, 전류 및/또는 임피던스를 측정할 수 있다. 상기 전압, 상기 전류 및/또는 상기 임피던스를 측정하기 위하여, 전자 장치는 센싱 코일들의 일 단에 연결된 복조 회로를 포함할 수 있다. 복조 회로는 센싱 코일들의 일 단 뿐만 아니라, 전력 코일의 일 단에 연결될 수 있다. 도 4a 및/또는 도 4b를 참고하여 상술한 바와 같이, 전력 코일 및/또는 코일에 인접한 센싱 코일들에 서, 전력 코일 및 코일 사이에서 교환되는 무선 충전 신호에 기반하는 교류 전압이 유도될 수 있다. 전자 장치는 상기 교류 전압의 주파수 성분들 중에서, 센싱 코일들의 공진 주파수에 대응하는 주파수 성분 을 임계 전압과 비교하여, 전력 코일 및 코일 사이의 위치 관계를 식별할 수 있다. 일 실시예에서, 전자 장치는 상술된 센싱 코일을 포함하는 외부 전자 장치와 통신하여, 상기 센싱 코 일 및 전자 장치의 코일 사이의 정렬 상태를 확인할 수 있다. 예를 들어, 전자 장치는 외부 전자 장 치로부터, 상기 센싱 코일의 공진 주파수를 가지는 무선 충전 신호의 요청을 위한 신호를 수신할 수 있다. 상기 요청에 응답하여, 전자 장치는 전력 코일을 이용하여 상기 공진 주파수를 가지는 상기 무선 충 전 신호를 송신할 수 있다. 상기 무선 충전 신호를 송신한 이후, 전자 장치는 외부 전자 장치로부터, 코일에 감긴 센싱 코일들에 유도된 전압, 전류 및/또는 임피던스 중 적어도 하나와 관련 된 정보를 수신할 수 있다. 상기 정보에 의해 나타나는 공진 주파수 및 전압(또는 전류) 사이의 관계에 기반하 여, 전자 장치는 전력 코일 및 코일 사이의 위치 관계를 계산할 수 있다. 이하에서는, 도 7a 및/또는 도 7b를 참고하여, 센싱 코일에 유도된 전압 및/또는 전류의 일 예가 설명된다. 도 7a 및 도 7b는, 일 실시예에 따른, 전자 장치에 포함된 센싱 코일에 유도된 전압 및/또는 전류를 설명하기 위한 예시적인 그래프들(710, 720, 730, 740)을 도시한다. 도 7a 및/또는 도 7b를 참고하면, 전자 장치(예, 도 1 및/또는 도 2의 전자 장치)의 전력 코일이 외부 전자 장치(예, 도 1의 무선 충전 패드, 이어 버드 케이스, 도 3a의 외부 전자 장치, 도 6의 외부 전자 장치)의 코일에 인접한 동안, 전 력 코일의 도선에 감긴 센싱 코일들(예, 제1 센싱 코일, 제2 센싱 코일, 제3 센싱 코일 및 /또는 제4 센싱 코일) 각각에 유도된 전압 및/또는 전류의 그래프들(710, 720, 730, 740)이 도시된다. 그 래프들(710, 720, 730, 740)의 전압, 전류 및/또는 주파수는 예시적인 것으로, 실시예가 이에 제한되는 것은 아 니다. 도 7a를 참고하면, 전자 장치의 전력 코일 및 코일의 제1 정렬 상태 내에서 센싱 코일들에 유도 된 전압의 그래프 및 전류의 그래프가 도시된다. 전력 코일의 중심 및 코일의 중심 사이 의 거리가 지정된 거리 미만인 도 7a의 예시적인 상태 내에서, 라인들(711, 712, 713, 714)에 의해 나타나는, 센싱 코일들 각각에서 유도된 전압들의 피크 값들 전부는, 임계 전압(Vth)을 초과할 수 있다. 유사하게, 도 7a 의 예시적인 상태 내에서, 라인들(721, 722, 723, 724)에 의해 나타나는, 센싱 코일들 각각에서 유도된 전류들 의 피크 값들 전부는, 임계 전류(Ith)를 초과할 수 있다. 임계 전압(Vth) 및/또는 임계 전류(Ith)는, 전력 코 일을 통해 수신되는 무선 충전 신호의 크기 및/또는 전력 코일 및 코일 사이의 거리에 기반하여경험적으로(또는 적응적으로) 결정될 수 있다. 도 7a를 참고하면, 그래프 내에서, 제1 센싱 코일 내지 제4 센싱 코일 각각에서 유도된 전압들 을 나타낸 라인들(711, 712, 713, 714)이 도시된다. 전자 장치가 전력 코일을 통해 그래프의 주파수 범위 내에서 스윕되는 무선 충전 신호를 수신하는 동안, 센싱 코일들 각각에서 유도되는 전압들은, 라인들(711, 712, 713, 714)과 같이 변경될 수 있다. 라인들(711, 712, 713, 714)을 참고하면, 센싱 코일들 각각에서 유도 되는 전압들은, 센싱 코일들 각각에 대응하는 공진 주파수를 가지는 무선 충전 신호를 수신할 시에, 최대 값(또 는 피크 값)을 가질 수 있다. 유사하게, 라인들(721, 722, 723, 724)을 참고하면, 센싱 코일들 각각에서 유도 되는 전류들은, 센싱 코일들 각각에 대응하는 공진 주파수를 가지는 무선 충전 신호를 수신할 시에, 최대화될 수 있다. 도 7b를 참고하면, 전자 장치의 전력 코일의 중심이 코일의 중심으로부터 -x 축 방향을 따라 이격된 예시적인 상태가 도시된다. 상태 내에서, 제1 센싱 코일 및 제2 센싱 코일은, 코일 상에 중첩 되지만, 제3 센싱 코일 및 제4 센싱 코일은 코일로부터 적어도 부분적으로 이격될 수 있다. 제 3 센싱 코일 및 제4 센싱 코일이 코일로부터 적어도 부분적으로 이격되기 때문에, 제3 센싱 코 일 및 제4 센싱 코일에서 유도되는 전압 및/또는 전류의 크기가 줄어들 수 있다. 도 7b를 참고하면, 도 7b에 도시된 전력 코일 및 코일의 제2 정렬 상태 내에서 센싱 코일들에 유도된 전압의 그래프 및 전류의 그래프가 도시된다. 전력 코일의 중심 및 코일의 중심 사이의 거리가 지정된 거리 이상인 도 7b의 예시적인 상태 내에서, 라인들(731, 732, 733, 734)에 의해 나타나는, 센싱 코일들 각각에서 유도된 전압들의 피크 값들 중 일부가, 임계 전압(Vth) 미만으로 줄어들 수 있다. 예를 들어, 제3 센싱 코일 및 제4 센싱 코일 각각에서 유도되는 전압들에 대응하는 라인들(733, 734)을 참고하면, 제3 센싱 코일 및 제4 센싱 코일에서 유도되는 전압들의 피크 값들은, 임계 전압(Vth) 미 만으로 줄어들 수 있다. 예를 들어, 상기 임계 전압(Vth)은, 전력 코일 및 코일 사이의 오정렬을 피 드백하기 위하여 설정될 수 있다. 상기 임계 전압(Vth)은, 무선 충전을 제어하기 위한 하드웨어(예, 도 2의 PMIC 및/또는 무선 충전 회로)에 저장되거나, 및/또는 상기 하드웨어에 의해 실행되는 펌 웨어 내에 저장될 수 있다. 상기 피크 값들은, 센싱 코일들 각각의 공진 주파수에서의 전압일 수 있다. 도 7b의 그래프를 참고하면, 라인들(741, 742, 743, 744)에 의해 나타나는, 센싱 코일들 각각에서 유도된 전류들의 피크 값들 중 일부가, 임계 전류(Ith) 미만으로 줄어들 수 있다. 예를 들어, 제3 센싱 코일 및 제4 센싱 코일 각각에서 유도되는 전류들에 대응하는 라인들(743, 744)을 참고하면, 제3 센싱 코일 및 제4 센싱 코일에서 유도되는 전류들의 피크 값들은, 임계 전류(Ith) 미만으로 줄어들 수 있다. 상기 피크 값들은, 센싱 코일들 각각의 공진 주파수에서 유도된 전류일 수 있다. 일 실시예에 따른, 전자 장치는, 센싱 코일들 각각에서 유도된 전압 및/또는 전류의 피크 값(예, 공진 주파수의 무선 충전 신호를 수신하는 동안 유도되는 전압 및/또는 전류)이 임계 값 이하인 경우, 센싱 코일들이 감긴 전 력 코일 및 코일 사이의 오정렬을 식별할 수 있다. 전자 장치는 센싱 코일들 각각에서 유도된, 공진 주파수에서의 전압 및/또는 전류의 세기들을, 지정된 임계 세기와 비교할 수 있다. 예를 들어, 전자 장치는 센싱 코일들 중에서, 상기 임계 값 이하의 전압 및/또는 전류가 유도된 센싱 코일을 식 별할 수 있다. 전자 장치는 식별된 센싱 코일의 위치 및/또는 식별된 센싱 코일이 감긴 전력 코일의 일부 분의 위치가, 코일로부터 이격되거나, 또는 코일과 중첩되지 않은 것으로 결정할 수 있다. 임계 값과 전압 및/또는 전류 사이의 차이는, 코일과의 거리에 비례할 수 있다. 일 실시예에 따른, 전자 장치는 상 기 차이에 기반하여, 코일의 중심에 대한 전력 코일의 상대적 위치를 계산할 수 있다. 계산된 위치 에 기반하여, 전자 장치는 전력 코일 및 코일의 정렬을 가이드하기 위한 시각적 객체를 표시할 수 있 다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치는, 무선 충전 신호의 송신 또는 수신을 위한 코일(예, 전력 코 일)에 감긴 센싱 코일들(예, 제1 센싱 코일 내지 제4 센싱 코일)에 기반하여, 상대적으로 작은 사이즈(예, 두께)를 가지고, 상기 코일 및 코일 사이의 정렬 상태를 확인하기 위한 회로를 포함할 수 있다. 상기 센싱 코일들 및 상기 회로는, 스마트폰의 폼 팩터를 가지는 전자 장치 뿐만 아니라, 스마트워 치, 신체에 이식 가능한(implantable) 디바이스, 및/또는 무선 이어버드와 같은 소형화된 전자 장치, HMD 및/또 는 전기 자동차(electric vehicle, EV)에 포함될 수 있거나, 또는 임베드(embedded)될 수 있다. 이하에서는, 도 8을 참고하여, 도 1 내지 도 7b를 참고하여 설명된 전자 장치의 예시적인 동작이 설명된다. 도 8은 하나 이상의 센싱 코일들에 기반하여 수행되는 전자 장치의 동작에 대한 예시적인 흐름도를 도시한다. 도 1 도 2의 전자 장치 및/또는 프로세서는 도 8을 참고하여 설명되는 동작을 수행할 수 있다. 도 8을 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 무선 충전 신호의 송신 또는 수신을 위한 외부 전자 장치를 식별할 수 있다. 동작의 외부 전자 장치는, 도 1의 무선 충전 패드와 같이, 무선 충전 신호의 송신을 위한 외부 전자 장치를 포함할 수 있다. 동작의 외부 전자 장치는, 도 1 의 이어버드 케이스와 같이, 무선 충전 신호를 수신하도록 설계된 외부 전자 장치를 포함할 수 있다. 전 자 장치의 프로세서는, 전자 장치에 포함된 전력 코일(예, 도 2의 전력 코일)을 통해, 상기 외부 전자 장 치로부터 송신된 무선 충전 신호(예, 핑 신호)를 수신하는 것에 기반하여, 동작의 외부 전자 장치를 식별 할 수 있다. 도 8을 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 외부 전자 장치로, 센싱 코일 들 중 적어도 하나의 공진 주파수에 기반하는 무선 충전 신호를 송신할 것을 요청할 수 있다. 동작의 센 싱 코일들은, 도 1의 제1 센싱 코일 내지 제4 센싱 코일을 포함할 수 있다. 센싱 코일들은, 턴 수 및/또는 상기 센싱 코일들 각각에 연결된 임피던스 매칭 회로들에 의해, 서로 일치되거나, 또는 상이한 공진 주 파수들을 가질 수 있다. 센싱 코일들은, 전자 장치의 전력 코일 상에 중첩될 수 있다. 센싱 코일들은 서로 이 격되어 배치될 수 있다. 센싱 코일들의 도선들은, 전자 장치의 전력 코일의 도선들에 감길 수 있다. 센싱 코 일들의 도선들은, 상기 전력 코일의 도선과 실질적으로 직교할 수 있다. 도 8을 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 센싱 코일들에서 유도되는, 전압 및/또는 전류를 측정할 수 있다. 전자 장치는 동작의 요청에 기반하는 무선 충전 신호를 수신하는 동안, 동작을 수행할 수 있다. 도 7a 및/또는 도 7b의 그래프들(710, 720, 730, 740)을 참고하여 설명된 전압 및/또는 전류는, 동작에 기반하여 측정된 전압 및/또는 전류에 대응할 수 있다. 도 8을 참고하면, 동작 내에서, 일 실시예에 따른, 전자 장치의 프로세서는, 측정된 전압들 및/또는 전류 들에 기반하여, 센싱 코일들이 감긴 전자 장치의 코일(예, 도 2의 전력 코일) 및 외부 전자 장치의 코일 사이의 오정렬을 확인할 수 있다. 프로세서는, 오정렬에 의한 센싱 코일들의 공진 조건의 변경에 기반하여, 상 기 오정렬을 확인할 수 있다. 센싱 코일들이 감긴 전자 장치의 코일 및 외부 전자 장치의 코일이 정렬된 경우, 프로세서는 상기 코일들을 이용하여 무선 충전 신호의 송신 또는 수신을 위한 동작을 수행할 수 있다. 상기 코 일들의 오정렬을 식별한 프로세서는, 외부 전자 장치 및 전자 장치의 위치를 변경할 것을 사용자에게 요청할 수 있다. 또는 프로세서는 상기 오정렬에 의해 무선 충전 신호의 송신 또는 수신을 위한 동작(예, 무선 충전 동작 및/또는 무선 충전 기능)을 수행할 수 없음을, 사용자에게 알릴 수 있다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치는 무선 충전 신호의 송신 효율을 최적화하기 위하여, 전자 장 치의 코일 및 외부 전자 장치의 코일 사이의 정렬을 확인할 수 있다. 전자 장치의 코일 및 외부 전자 장치의 코일 사이의 정렬을 가이드하여, 전자 장치는 상기 송신 효율을 개선할 수 있다. 도 9는, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 9를 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치(90 1)에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가 될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테 나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전 자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘 은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습 (semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정 되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망 (DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피 커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복 수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(902, 또는 1504) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(902, 1504, 또는 1508) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터 의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요 청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서 비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이 템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복 수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구 들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구 분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치 들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우 에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메 모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체들을 포함할 수 있으며, 복수의 개체들 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요 소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다 른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 9의 전자 장치는, 도 1 내지 도 2의 전자 장치의 일 예일 수 있다. 일 실시예에서, 무선 충전 신호의 송신 또는 수신을 위한 코일 및 외부 코일의 위치 관계를 확인하는 방안이 요 구될 수 있다. 상술한 바와 같은, 일 실시예에 따른, 전자 장치(electronic device)(예, 도 1의 전자 장치 및/또는 도 9의 전자 장치)는, 상기 전자 장치의 일 면 상에 형성된 폐루프(closed loops)의 형태를 가지고, 무선 충전 신호를 송신 또는 수신하기 위한 제1 코일, 상기 일 면 상에서, 서로 이격되어 배치되고, 상 기 제1 코일의 도선에 감긴(wound) 복수의 제2 코일들 및 상기 복수의 제2 코일들(예, 도 2의 센싱 코일들 )을 이용하여, 상기 제1 코일 및 상기 무선 충전 신호를 수신 또는 송신하기 위한 외부 전자 장치의 제3 코일 사이의 위치 관계를 센싱하기 위한 프로세서(예, 도 2의 프로세서)를 포함할 수 있다. 일 실시예에 따른, 전자 장치는, 복수의 제2 코일들을 이용하여 제1 코일 및 제3 코일 사이의 위치 관계를 확인할 수 있다. 예를 들어, 상기 복수의 제2 코일들은, 상기 제1 코일의 상이한 부분들에서, 상기 도선의 방향과 실질적으로 직 교하는(orthogonal to) 방향을 따라 상기 도선에 감길 수 있다. 예를 들어, 상기 복수의 제2 코일들은, 상기 폐루프의 형태를 가지는 상기 제1 코일 상에서, 상기 도선의 방향 을 따라 지정된 간격만큼 이격될 수 있다. 예를 들어, 상기 복수의 제2 코일들은, 상기 일 면 상에서 동심원들의 형태를 상기 제1 코일을 4등분하는 (quartering) 위치들에 배치될 수 있다. 예를 들어, 상이한 공진 주파수들에 기반하여 상기 복수의 제2 코일들을 구동하기 위하여 상기 복수의 제2 코일 들 각각에 연결된, 임피던스 매칭 회로들을 포함하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 제1 코일을 이용하여 상기 외부 전자 장치로, 상기 공진 주파수들 각각에 기 반하는 무선 충전 신호들을 송신할 것을 요청하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 복수의 제2 코일들 중 적어도 하나를 통해 수신된 무선 충전 신호의 상기 공 진 주파수들 각각에서의 세기들을, 지정된 임계 세기와 비교하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 세기들 중에서 상기 지정된 임계 세기 미만인 세기를 식별하는 것에 기반하 여, 상기 복수의 제2 코일들 중에서 상기 식별된 세기에 대응하는 공진 주파수를 가지는 제2 코일의 위치에 기 반하여, 상기 제3 코일로부터 이격된 상기 제1 코일의 적어도 한 부분을 식별하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 복수의 제2 코일들 각각의 전압들 또는 전류들 중 적어도 하나에 기반하여, 상기 위치 관계를 센싱하도록, 구성될 수 있다. 예를 들어, 상기 프로세서는, 상기 위치 관계에 기반하여, 상기 제3 코일 및 상기 제1 코일 사이의 오정렬 (misalignment)을 식별하는 것에 기반하여, 상기 전자 장치의 디스플레이 상에, 상기 오정렬을 나타내는 시각적 객체를 표시하도록, 구성될 수 있다. 상술한 바와 같은, 일 실시예에 따른, 전자 장치의 방법은, 상기 전자 장치의 일 면 상에 형성된 폐루프의 형태 를 가지는 제1 코일을 통해 수신된 제1 무선 충전 신호에 기반하여, 외부 전자 장치를 탐지하는 동작을 포함할 수 있다. 상기 방법은, 상기 외부 전자 장치로, 상기 제1 코일과 중첩되고, 상기 제1 코일의 도선에 감긴 제2 코일의 공진 주파수와 관련된 제2 무선 충전 신호의 송신을 요청하는 동작을 포함할 수 있다. 상기 방법은, 상 기 제2 무선 충전 신호에 의해 상기 제2 코일에 유도된 전압과 관련된 정보를 획득하는 동작을 포함할 수 있다. 상기 방법은, 상기 정보에 의해 나타나는, 상기 제2 코일과 중첩된 상기 제1 코일의 일부분 및 상기 외부 전자 장치 사이의 위치 관계에 기반하여, 상기 외부 전자 장치 및 상기 제1 코일을 정렬하기 위한 시각적 객체를 표 시하는 동작을 포함할 수 있다. 예를 들어, 상기 탐지하는 동작은, 상기 제1 코일에 인접하게 배치된 상기 외부 전자 장치의 제3 코일을 통해 송신된 상기 제1 무선 충전 신호를 수신하는 동작을 포함할 수 있다. 예를 들어, 상기 요청하는 동작은, 상기 제1 코일을 이용하여 상기 제2 무선 충전 신호의 송신을 요청하기 위한 제3 무선 충전 신호를 송신하는 동작을 포함할 수 있다. 상기 요청하는 동작은, 상기 제1 코일과 상이한 상기 전자 장치의 안테나를 이용하여, 상기 외부 전자 장치로 상기 제2 무선 충전 신호의 송신을 요청하기 위한 데이 터 신호를 송신하는 동작을 포함할 수 있다. 예를 들어, 상기 획득하는 동작은, 상기 제2 코일에 연결된 임피던스 매칭 회로의 양 단들 사이의 전압 또는 전 류 중 적어도 하나를 센싱하는 동작을 포함할 수 있다. 예를 들어, 상기 표시하는 동작은, 상기 제2 코일에 유도된 교류 신호의 상기 공진 주파수에서의 피크 전압이 임계 전압 이하일 시에, 상기 전자 장치의 디스플레이 상에 상기 시각적 객체를 표시하는 동작을 포함할 수 있 다. 예를 들어, 상기 위치 관계에 기반하여, 상기 외부 전자 장치로부터 상기 전자 장치의 배터리를 충전하기 위한 제3 무선 충전 신호를 수신할지 여부를 결정하는 동작을 포함할 수 있다. 예를 들어, 상기 획득하는 동작은, 상기 제1 코일의 상이한 부분들과 중첩된 복수의 제2 코일들 중 적어도 하나 에 유도된 상기 전압과 관련된 상기 정보를 획득하는 동작을 포함할 수 있다. 예를 들어, 상기 획득하는 동작은, 상기 복수의 제2 코일들 각각에 대응하는 공진 주파수 및 피크 전압의 조합 들에 기반하여, 상기 부분들 및 상기 외부 전자 장치 사이의 상기 위치 관계를 확인하는 동작을 포함할 수있다. 상술한 바와 같은, 일 실시예에 따른, 전자 장치의 방법은, 상기 전자 장치의 일 면 상에 형성된 폐루프의 형태 를 가지는 제1 코일을 통해 수신된 제1 무선 충전 신호에 기반하여, 외부 전자 장치를 탐지하는 동작을 포함할 수 있다. 상기 방법은, 상기 외부 전자 장치로부터 송신된, 상기 제1 코일 및 상기 외부 전자 장치의 위치 관 계를 확인하기 위한 제2 무선 충전 신호의 요청에 응답하여, 상기 제1 코일을 이용하여 상기 요청과 관련된 주 파수를 가지는 상기 제2 무선 충전 신호를 송신하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 무선 충전 신호를 송신한 이후, 상기 외부 전자 장치로부터, 상기 외부 전자 장치에 대한 상기 제1 코일의 위치 관계를 나 타내는 정보를 수신하는 동작을 포함할 수 있다. 상기 방법은, 상기 정보에 기반하여, 상기 외부 전자 장치 및 상기 제1 코일을 정렬하기 위한 시각적 객체를 표시하는 동작을 포함할 수 있다. 예를 들어, 상기 송신하는 동작은, 상기 제1 코일에 대응하는, 상기 외부 전자 장치의 제2 코일과 중첩되고, 상 기 제2 코일의 도선에 감긴 제3 코일의 공진 주파수인 상기 주파수를 가지는 상기 제2 무선 충전 신호를 송신하 는 동작을 포함할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 프로세서, 콘트롤 러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접 근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명"}
{"patent_id": "10-2023-0127491", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되 어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 이때, 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드를 위해 임시 저장하는 것일 수도 있다. 또한, 매체는 단일 또는 수 개의 하드웨어가 결합된 형태의 다 양한 기록수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워 크 상에 분산 존재하는 것일 수도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체의 예시로, 어플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어 를 공급 내지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다."}
{"patent_id": "10-2023-0127491", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2023-0127491", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 무선 충전 신호의 송신 또는 수신을 위한 하나 이상의 코일들을 포함하는 전자 장치의 일 실시예를 도 시한다. 도 2는, 일 실시예에 따른, 전자 장치의 블록도의 일 예를 도시한다. 도 3a, 도 3b 및 도 3c는, 일 실시예에 따른, 전자 장치에 포함된 센싱 코일의 예시적인 구조를 도시한다. 도 4a 및 도 4b는, 일 실시예에 따른, 전자 장치에 포함된 센싱 코일들의 등가 회로를 도시한다. 도 5a 및 도 5b는, 일 실시예에 따른, 전자 장치에 포함된 센싱 코일들의 등가 회로를 도시한다. 도 6은, 센싱 코일들을 포함하는 무선 충전을 위한 전자 장치의 하드웨어의 등가 회로를 도시한다. 도 7a 및 도 7b는, 일 실시예에 따른, 전자 장치에 포함된 센싱 코일에 유도된 전압 및/또는 전류를 설명하기 위한 예시적인 그래프들을 도시한다. 도 8은 하나 이상의 센싱 코일들에 기반하여 수행되는 전자 장치의 동작에 대한 예시적인 흐름도를 도시한다. 도 9는, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다."}
