{"patent_id": "10-2019-0033080", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0112494", "출원번호": "10-2019-0033080", "발명의 명칭": "전자 장치 및 이의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "장기훈"}}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치의 제어 방법에 있어서,상기 전자 장치를 통한 제2 전자 장치의 네트워크 등록이 실패하면, 상기 전자 장치의 로그 정보를 획득하고,상기 제2 전자 장치 및 네트워크 라우터 장치로부터 로그 정보를 획득하는 단계;상기 획득된 로그 정보 중 대응되는 로그 정보를 식별하는 단계;상기 대응되는 로그 정보를 이용하여 상기 획득된 로그 정보 간 시간 정보가 일치되도록 각 장치 별 시간 정보의 보정 값을 획득하는 단계;상기 보정 값을 반영한 로그 정보를 이용하여 오류를 식별하는 단계; 및상기 식별된 오류에 대응되는 솔루션을 제공하는 단계;를 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 로그 정보는 장치 간 트랜잭션에 대한 정보 및 상기 트랜잭션이 수행되는 시간에 대한 정보를 포함하고,상기 네트워크 라우터 장치로부터 획득된 로그 정보에는, 상기 네트워크 라우터 장치와 연결된 클라우드 서버의로그 정보가 포함되고,상기 로그 정보를 식별하는 단계는,상기 전자 장치, 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 클라우드 서버 중 적어도 하나로부터획득된 로그 정보 중 동일한 트랜잭션에 대한 정보를 포함하는 로그 정보를 식별하는 전자 장치의 제어 방법."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 로그 정보를 획득하는 단계는,상기 전자 장치와 상기 제2 전자 장치가 D2D(device to device) 방식으로 연결된 상태에서 상기 제2 전자 장치의 로그 정보를 획득하는 전자 장치의 제어 방법."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 로그 정보를 식별하는 단계는,상기 전자 장치, 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 클라우드 서버 상호간 최초로 수행된트랜잭션에 대한 로그 정보의 시간 정보를 바탕으로 각 장치 별 시간 정보의 보정 값을 획득하는 전자 장치의제어 방법."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 식별된 로그 정보는,상기 전자 장치, 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 클라우드 서버 중 하나의 장치에서획득된 상기 트랜잭션의 요청에 대한 로그 정보, 및 상기 하나의 장치와 다른 장치에서 획득된 상기 요청에 대응되는 응답에 대한 로그 정보를 포함하고,공개특허 10-2020-0112494-3-상기 오류를 식별하는 단계는,상기 요청에 대한 로그 정보가 생성된 시간으로부터 기설정된 시간 내에 생성된 상기 응답에 대한 로그 정보가없으면, 상기 트랜잭션과 관련된 동작의 오류인 것으로 식별하는 전자 장치의 제어 방법."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 오류를 식별하는 단계는,상기 제2 전자 장치의 로그 정보 중 상기 제2 전자 장치가 상기 네트워크 라우터 장치를 통해 상기 클라우드 서버에 전송한 등록 요청에 대한 로그 정보가 생성된 시간 정보를 획득하고, 상기 네트워크 라우터 장치로부터 획득된 로그 정보 중 상기 획득된 시간 정보로부터 기설정된 시간 내에 상기 등록 요청에 대응되는 응답에 대한로그 정보가 없으면, 네트워크 환경에 오류의 원인이 있는 것으로 식별하는 전자 장치의 제어 방법."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 오류를 식별하는 단계는,상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 네트워크 라우터 장치와 연결된 클라우드 서버 중 적어도 하나와 관련된 오류를 식별하며,상기 식별된 오류에 대응되는 솔루션을 제공하는 단계는,기저장된 솔루션 데이터 베이스에서 상기 식별된 오류에 대응되는 솔루션 정보를 획득하고, 상기 획득된 솔루션정보를 표시하는 전자 장치의 제어 방법."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 오류를 식별하는 단계는,상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 네트워크 라우터 장치와 연결된 클라우드 서버 중 적어도 하나와 관련된 오류를 식별하며,상기 식별된 오류에 대응되는 솔루션을 제공하는 단계는,기저장된 솔루션 데이터 베이스에서 상기 식별된 오류에 대응되는 솔루션 정보를 획득하고, 상기 식별된 오류와관련된 장치에 상기 획득된 솔루션 정보를 포함하는 제어 명령을 전송하는 전자 장치의 제어 방법."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 식별된 오류에 대응되는 솔루션을 제공하는 단계는,상기 식별된 오류가 상기 제2 전자 장치와 관련된 오류이면, 상기 제2 전자 장치를 Soft AP 모드로 전환하기 위한 제어 명령을 상기 제2 전자 장치로 전송하는 전자 장치의 제어 방법."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 오류를 식별하는 단계는,상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치 및 상기 네트워크 라우터 장치 중 적어도 하나와 관련된 오류를 식별하며,기저장된 솔루션 데이터 베이스에 상기 식별된 오류에 대응되는 솔루션 정보가 없으면, 상기 식별된 오류와 관련된 로그 정보를 로그 데이터 베이스에 저장하는 단계;를 더 포함하는 전자 장치의 제어 방법. 공개특허 10-2020-0112494-4-청구항 11 전자 장치에 있어서,회로를 포함하는 통신부;적어도 하나의 명령어가 저장된 메모리; 및상기 명령어를 이용하여 상기 전자 장치를 제어하는 프로세서;를 포함하고,상기 프로세서는,상기 전자 장치를 통한 제2 전자 장치의 네트워크 등록이 실패하면, 상기 전자 장치의 로그 정보를 획득하고,상기 제2 전자 장치 및 네트워크 라우터 장치로부터 로그 정보를 획득하고,상기 획득된 로그 정보 중 대응되는 로그 정보를 식별하고,상기 대응되는 로그 정보를 이용하여 상기 획득된 로그 정보 간 시간 정보가 일치되도록 각 장치 별 시간 정보의 보정 값을 획득하고,상기 보정 값을 반영한 로그 정보를 이용하여 오류를 식별하고,상기 식별된 오류에 대응되는 솔루션을 제공하는 전자 장치."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 로그 정보는 장치 간 트랜잭션에 대한 정보 및 상기 트랜잭션이 수행되는 시간에 대한 정보를 포함하고,상기 네트워크 라우터 장치로부터 획득된 로그 정보에는, 상기 네트워크 라우터 장치와 연결된 클라우드 서버의로그 정보가 포함되고,상기 프로세서는,상기 전자 장치, 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 클라우드 서버 중 적어도 하나로부터획득된 로그 정보 중 동일한 트랜잭션에 대한 정보를 포함하는 로그 정보를 식별하는 전자 장치."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 프로세서는,상기 전자 장치와 제2 전자 장치가 D2D(device to device) 방식으로 연결된 상태에서 상기 제2 전자 장치의 로그 정보를 획득하는 전자 장치."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 프로세서는,상기 전자 장치, 상기 제2 전자 장치 및 상기 네트워크 라우터 장치 상호간 최초로 수행된 트랜잭션에 대한 로그 정보의 시간 정보를 바탕으로 각 장치 별 시간 정보의 보정 값을 획득하는 전자 장치."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 식별된 로그 정보는,상기 전자 장치, 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 클라우드 서버 중 하나의 장치에서획득된 상기 트랜잭션의 요청에 대한 로그 정보, 및 상기 하나의 장치와 다른 장치에서 획득된 상기 요청에 대응되는 응답에 대한 로그 정보를 포함하고,공개특허 10-2020-0112494-5-상기 프로세서는,상기 요청에 대한 로그 정보가 생성된 시간으로부터 기설정된 시간 내에 생성된 상기 응답에 대한 로그 정보가없으면, 상기 트랜잭션과 관련된 동작의 오류인 것으로 식별하는 전자 장치."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 프로세서는,상기 제2 전자 장치의 로그 정보 중 상기 제2 전자 장치가 상기 네트워크 라우터 장치를 통해 상기 클라우드 서버에 전송한 등록 요청에 대한 로그 정보가 생성된 시간 정보를 획득하고, 상기 네트워크 라우터 장치로부터 획득된 로그 정보 중 상기 획득된 시간 정보로부터 기설정된 시간 내에 상기등록 요청에 대응되는 응답에 대한 로그 정보가 없으면, 네트워크 환경에 오류의 원인이 있는 것으로 식별하는전자 장치."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 프로세서는,상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치 및 상기 네트워크 라우터 장치 중 적어도 하나와 관련된 오류를 식별하며,기저장된 솔루션 데이터 베이스에서 상기 식별된 오류에 대응되는 솔루션 정보를 획득하고, 상기 획득된 솔루션정보를 표시하는 전자 장치."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 프로세서는,상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 네트워크 라우터 장치와 연결된 클라우드 서버 중 적어도 하나와 관련된 오류를 식별하며,기저장된 솔루션 데이터 베이스에서 상기 식별된 오류에 대응되는 솔루션 정보를 획득하고, 상기 식별된 오류와관련된 장치에 상기 획득된 솔루션 정보를 포함하는 제어 명령을 전송하는 전자 장치."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 프로세서는,상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치 및 상기 네트워크 라우터 장치 중 적어도 하나와 관련된 오류를 식별하며,기저장된 솔루션 데이터 베이스에 상기 식별된 오류에 대응되는 솔루션 정보가 없으면, 상기 식별된 오류와 관련된 로그 정보를 로그 데이터 베이스에 저장하는 전자 장치."}
{"patent_id": "10-2019-0033080", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치의 제어 방법을 실행하기 위한 프로그램을 포함하는 컴퓨터 판독가능 기록 매체에 있어서,전자 장치의 제어 방법은,상기 전자 장치를 통한 제2 전자 장치의 네트워크 등록이 실패하면, 상기 전자 장치의 로그 정보를 획득하고,상기 제2 전자 장치 및 네트워크 라우터 장치로부터 로그 정보를 획득하는 단계;상기 획득된 로그 정보 중 대응되는 로그 정보를 식별하는 단계;공개특허 10-2020-0112494-6-상기 대응되는 로그 정보를 이용하여 상기 획득된 로그 정보 간 시간 정보가 일치되도록 각 장치 별 시간 정보의 보정 값을 획득하는 단계;상기 보정 값을 반영한 로그 정보를 이용하여 오류를 식별하는 단계; 및상기 식별된 오류에 대응되는 솔루션을 제공하는 단계;를 포함하는 컴퓨터 판독가능 기록 매체."}
{"patent_id": "10-2019-0033080", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치 및 전자 장치의 제어 방법이 개시된다. 본 개시의 전자 장치의 제어 방법은, 전자 장치를 통한 제2 전 자 장치의 네트워크 등록이 실패하면, 전자 장치의 로그 정보를 획득하고, 제2 전자 장치 및 네트워크 라우터 장 치로부터 로그 정보를 획득하는 단계, 획득된 로그 정보 중 대응되는 로그 정보를 식별하는 단계, 대응되는 로그 정보를 이용하여 획득된 로그 정보 간 시간 정보가 일치되도록 각 장치 별 시간 정보의 보정 값을 획득하는 단계, 보정 값을 반영한 로그 정보를 이용하여 오류를 식별하는 단계 및 식별된 오류에 대응되는 솔루션을 제공 하는 단계를 포함한다."}
{"patent_id": "10-2019-0033080", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 제어 방법에 대한 것으로, 보다 상세하게는, IoT 환경에서 전자 장치를 이용해 타 전자 장치를 네트워크에 최초 등록할 때 발생되는 오류를 해결하기 위한 전자 장치 및 이의 제어 방법에 관한 것이다."}
{"patent_id": "10-2019-0033080", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 반도체 기술 및 무선 통신 기술의 발전으로 인하여 다양한 사물에 통신기능이 포함되어 네트워크를 형성함 으로써 편리하게 사물을 제어할 수 있게 되었다. 이와 같이 사물에 통신 기능을 포함하여 네트워크로 연결하는 것을 사물 인터넷(IoT : Internet Of Things)이라 하며, 실생활에 폭넓게 사용되고 있다. 그러나, 사용자가 하나의 전자 장치로 타 전자 장치를 제어하기 위해 타 전자 장치를 네트워크에 최초로 등록할 때, 타 전자 장치의 등록에 실패하여도 오류의 원인을 파악할 수 없는 문제가 있었다. 구체적으로, 종래에는 단일 전자 장치의 로그 정보만 이용하여 타 전자 장치의 등록 실패 원인을 분석하거나, 전자장치와 타 전자장치의 로그가 분산되어 있어, 사용자는 정확한 오류 원인을 제공받을 수 없었으며, 간단한 원인임에도 이를 파악하지 못해 서비스 센터에 의뢰하여 시간과 노력을 소모하는 등의 불편함이 있었다."}
{"patent_id": "10-2019-0033080", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 필요성에 따라 안출된 것으로, 본 개시의 목적은, IoT 환경에서 전자 장치를 이용해 타 전자 장치를 네트워크에 최초 등록할 때 발생되는 오류의 로그 정보를 분석하여 해결할 수 있는 전자 장치 및 이의 제어 방법을 제공하는 데 있다."}
{"patent_id": "10-2019-0033080", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 전자 장치의 제어 방법은, 상기 전자 장치를 통한 제2 전자 장치의 네트워크 등록 이 실패하면, 상기 전자 장치의 로그 정보를 획득하고, 상기 제2 전자 장치 및 네트워크 라우터 장치로부터 로 그 정보를 획득하는 단계, 상기 획득된 로그 정보 중 대응되는 로그 정보를 식별하는 단계, 상기 대응되는 로그 정보를 이용하여 상기 획득된 로그 정보 간 시간 정보가 일치되도록 각 장치 별 시간 정보의 보정 값을 획득하 는 단계, 상기 보정 값을 반영한 로그 정보를 이용하여 오류를 식별하는 단계 및 상기 식별된 오류에 대응되는 솔루션을 제공하는 단계를 포함한다. 이 경우, 상기 로그 정보는 장치 간 트랜잭션에 대한 정보 및 상기 트랜잭션이 수행되는 시간에 대한 정보를 포 함하고, 상기 네트워크 라우터 장치로부터 획득된 로그 정보에는, 상기 네트워크 라우터 장치와 연결된 클라우 드 서버의 로그 정보가 포함되고, 상기 로그 정보를 식별하는 단계는, 상기 전자 장치, 상기 제2 전자 장치, 상 기 네트워크 라우터 장치 및 상기 클라우드 서버 중 적어도 하나로부터 획득된 로그 정보 중 동일한 트랜잭션에 대한 정보를 포함하는 로그 정보를 식별할 수 있다. 이 경우, 상기 로그 정보를 획득하는 단계는, 상기 전자 장치와 상기 제2 전자 장치가 D2D(device to device) 방식으로 연결된 상태에서 상기 제2 전자 장치의 로그 정보를 획득할 수 있다. 한편, 상기 로그 정보를 식별하는 단계는, 상기 전자 장치, 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 클라우드 서버 상호간 최초로 수행된 트랜잭션에 대한 로그 정보의 시간 정보를 바탕으로 각 장치 별 시간 정보의 보정 값을 획득할 수 있다. 한편, 상기 식별된 로그 정보는, 상기 전자 장치, 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 클 라우드 서버 중 하나의 장치에서 획득된 상기 트랜잭션의 요청에 대한 로그 정보, 및 상기 하나의 장치와 다른 장치에서 획득된 상기 요청에 대응되는 응답에 대한 로그 정보를 포함하고, 상기 오류를 식별하는 단계는, 상기 요청에 대한 로그 정보가 생성된 시간으로부터 기설정된 시간 내에 생성된 상기 응답에 대한 로그 정보가 없으 면, 상기 트랜잭션과 관련된 동작의 오류인 것으로 식별할 수 있다. 이 경우, 상기 오류를 식별하는 단계는, 상기 제2 전자 장치의 로그 정보 중 상기 제2 전자 장치가 상기 네트워 크 라우터 장치를 통해 상기 클라우드 서버에 전송한 등록 요청에 대한 로그 정보가 생성된 시간 정보를 획득하 고, 상기 네트워크 라우터 장치로부터 획득된 로그 정보 중 상기 획득된 시간 정보로부터 기설정된 시간 내에 상기 등록 요청에 대응되는 응답에 대한 로그 정보가 없으면, 네트워크 환경에 오류의 원인이 있는 것으로 식별 할 수 있다. 한편, 상기 오류를 식별하는 단계는, 상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 네트워크 라우터 장치와 연결된 클라우드 서버 중 적어도 하나와 관련된 오류를 식별하며, 상기 식별된 오류에 대응되는 솔루션을 제공하는 단계는, 기저장된 솔루션 데이터 베이스에서 상기 식별된 오류에 대응되는 솔루션 정보를 획득하고, 상기 획득된 솔루션 정보를 표시할 수 있다. 한편, 상기 오류를 식별하는 단계는, 상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 네트워크 라우터 장치와 연결된 클라우드 서버 중 적어도 하나와 관련된 오류를 식별하며, 상기 식별된 오류에 대응되는 솔루션을 제공하는 단계는, 기저장된 솔루션 데이터 베이스에서 상기 식별된 오류에 대응되는 솔루션 정보를 획득하고, 상기 식별된 오류와 관련된 장치에 상기 획득된 솔루션 정보 를 포함하는 제어 명령을 전송할 수 있다. 이 경우, 상기 식별된 오류에 대응되는 솔루션을 제공하는 단계는, 상기 식별된 오류가 상기 제2 전자 장치와 관련된 오류이면, 상기 제2 전자 장치를 Soft AP 모드로 전환하기 위한 제어 명령을 상기 제2 전자 장치로 전송 할 수 있다. 한편, 상기 오류를 식별하는 단계는, 상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치 및 상기 네트워크 라우터 장치 중 적어도 하나와 관련된 오류를 식별하며, 기저장된 솔루션 데이터 베이스에 상기 식별 된 오류에 대응되는 솔루션 정보가 없으면, 상기 식별된 오류와 관련된 로그 정보를 로그 데이터 베이스에 저장 하는 단계를 더 포함할 수 있다. 한편, 본 개시의 일 실시 예에 따른 전자 장치는, 회로를 포함하는 통신부, 적어도 하나의 명령어가 저장된 메 모리 및 상기 명령어를 이용하여 상기 전자 장치를 제어하는 프로세서를 포함하고, 상기 프로세서는, 상기 전자 장치를 통한 제2 전자 장치의 네트워크 등록이 실패하면, 상기 전자 장치의 로그 정보를 획득하고, 상기 제2 전 자 장치 및 네트워크 라우터 장치로부터 로그 정보를 획득하고, 상기 획득된 로그 정보 중 대응되는 로그 정보 를 식별하고, 상기 대응되는 로그 정보를 이용하여 상기 획득된 로그 정보 간 시간 정보가 일치되도록 각 장치 별 시간 정보의 보정 값을 획득하고, 상기 보정 값을 반영한 로그 정보를 이용하여 오류를 식별하고, 상기 식별 된 오류에 대응되는 솔루션을 제공한다. 이 경우, 상기 로그 정보는 장치 간 트랜잭션에 대한 정보 및 상기 트랜잭션이 수행되는 시간에 대한 정보를 포 함하고, 상기 네트워크 라우터 장치로부터 획득된 로그 정보에는, 상기 네트워크 라우터 장치와 연결된 클라우 드 서버의 로그 정보가 포함되고, 상기 프로세서는, 상기 전자 장치, 상기 제2 전자 장치, 상기 네트워크 라우 터 장치 및 상기 클라우드 서버 중 적어도 하나로부터 획득된 로그 정보 중 동일한 트랜잭션에 대한 정보를 포 함하는 로그 정보를 식별할 수 있다. 이 경우, 상기 프로세서는, 상기 전자 장치와 제2 전자 장치가 D2D(device to device) 방식으로 연결된 상태에 서 상기 제2 전자 장치의 로그 정보를 획득할 수 있다. 한편, 상기 프로세서는, 상기 전자 장치, 상기 제2 전자 장치 및 상기 네트워크 라우터 장치 상호간 최초로 수 행된 트랜잭션에 대한 로그 정보의 시간 정보를 바탕으로 각 장치 별 시간 정보의 보정 값을 획득할 수 있다. 한편, 상기 식별된 로그 정보는, 상기 전자 장치, 상기 제2 전자 장치, 상기 네트워크 라우터 장치 및 상기 클 라우드 서버 중 하나의 장치에서 획득된 상기 트랜잭션의 요청에 대한 로그 정보, 및 상기 하나의 장치와 다른 장치에서 획득된 상기 요청에 대응되는 응답에 대한 로그 정보를 포함하고, 상기 프로세서는, 상기 요청에 대한 로그 정보가 생성된 시간으로부터 기설정된 시간 내에 생성된 상기 응답에 대한 로그 정보가 없으면, 상기 트랜 잭션과 관련된 동작의 오류인 것으로 식별할 수 있다.이 경우, 상기 프로세서는, 상기 제2 전자 장치의 로그 정보 중 상기 제2 전자 장치가 상기 네트워크 라우터 장 치를 통해 상기 클라우드 서버에 전송한 등록 요청에 대한 로그 정보가 생성된 시간 정보를 획득하고, 상기 네 트워크 라우터 장치로부터 획득된 로그 정보 중 상기 획득된 시간 정보로부터 기설정된 시간 내에 상기 등록 요 청에 대응되는 응답에 대한 로그 정보가 없으면, 네트워크 환경에 오류의 원인이 있는 것으로 식별할 수 있다. 한편, 상기 프로세서는, 상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치 및 상기 네트워크 라 우터 장치 중 적어도 하나와 관련된 오류를 식별하며, 기저장된 솔루션 데이터 베이스에서 상기 식별된 오류에 대응되는 솔루션 정보를 획득하고, 상기 획득된 솔루션 정보를 표시할 수 있다. 한편, 상기 프로세서는, 상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치, 상기 네트워크 라우 터 장치 및 상기 네트워크 라우터 장치와 연결된 클라우드 서버 중 적어도 하나와 관련된 오류를 식별하며, 기 저장된 솔루션 데이터 베이스에서 상기 식별된 오류에 대응되는 솔루션 정보를 획득하고, 상기 식별된 오류와 관련된 장치에 상기 획득된 솔루션 정보를 포함하는 제어 명령을 전송할 수 있다. 한편, 상기 프로세서는, 상기 보정 값을 반영한 로그 정보에 기초하여 상기 제2 전자 장치 및 상기 네트워크 라 우터 장치 중 적어도 하나와 관련된 오류를 식별하며, 기저장된 솔루션 데이터 베이스에 상기 식별된 오류에 대 응되는 솔루션 정보가 없으면, 상기 식별된 오류와 관련된 로그 정보를 로그 데이터 베이스에 저장할 수 있다. 한편, 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 실행하기 위한 프로그램을 포함하는 컴퓨터 판독 가능 기록 매체에 있어서, 전자 장치의 제어 방법은, 상기 전자 장치를 통한 제2 전자 장치의 네트워크 등록이 실패하면, 상기 전자 장치의 로그 정보를 획득하고, 상기 제2 전자 장치 및 네트워크 라우터 장치로부터 로그 정보를 획득하는 단계, 상기 획득된 로그 정보 중 대응되는 로그 정보를 식별하는 단계, 상기 대응되는 로그 정 보를 이용하여 상기 획득된 로그 정보 간 시간 정보가 일치되도록 각 장치 별 시간 정보의 보정 값을 획득하는 단계, 상기 보정 값을 반영한 로그 정보를 이용하여 오류를 식별하는 단계 및 상기 식별된 오류에 대응되는 솔 루션을 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2019-0033080", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시의 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도 면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하 려는 것이 아니며, 발명된 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이 해되어야 한다. 실시 예들을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해 한정되 어서는 안 된다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특성, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특성들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 실시 예에서 '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨 어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 '모듈' 혹은 복수의 '부'는 특정한 하드웨어로 구현될 필요가 있는 '모듈' 혹은 '부'를 제외하고는 적어도 하나의 모듈로 일체화되어 적어 도 하나의 프로세서로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 이하에서는 도면을 참조하여 본 발명에 대해 더욱 상세히 설명하기로 한다. 도 1a 및 도 1b는 본 개시의 일 실시 예에 따른 네트워크 시스템을 도시한 도면이다. 도 1a를 참조하면, 본 개시의 일 실시 예에 따른 네트워크 시스템은 전자 장치, 등록 장치, 네 트워크 라우터 장치 및 클라우드 서버를 포함한다. 전자 장치 및 등록 장치는 네트워크(300, 301)를 통해 연결되는 IoT 환경에서 제어될 수 있다. 예를 들어, 전자 장치 및 등록 장치는 스마트폰, 데스크탑 PC, 랩탑 PC. 넷북 컴퓨터, 서버, PDA, PMP, 의 료기기, 카메라, TV, 냉장고, 에어컨, 청소기, 오븐, 세탁기, 공기 청정기, 인공지능 스피커, 셋톱 박스, 홈 오 토메이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM)), 키오스크, 웨어러블 장치(시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌 즈, 또는 머리 착용형 장치(head-mounted-device(HMD), 의류, 스킨 패드) 등으로 구현될 수도 있다. 특히, 전자 장치는 사용자에게 네트워크 시스템에 대한 명령을 입력받고, 네트워크 시스템 에 대한 정보를 제공할 수 있다. 그리고, 등록 장치는 전자 장치와는 구분되는 하나 이상의 전자 장치로, 클라우드 서버에 등록 될 전자 장치를 의미하며, 전자 장치를 통해 클라우드 서버에 등록될 수 있다. 이때, 전자 장치(10 0)는 타 전자 장치인 등록 장치를 클라우드 서버에 등록하기 위한 중재 장치일 수 있다. 한편, 등록 장치는 전자 장치와 구별되는 제2 전자 장치로 지칭될 수도 있으며, 이하에서는 편의를 위해 등록 장치로 지칭하기로 한다. 한편, 전자 장치 및 등록 장치는 네트워크 라우터 장치를 통해 클라우드 서버와 데이터를 송수신할 수 있다.본 개시에서는 전자 장치를 통해 등록 장치의 클라우드 서버에의 최초 등록이 실패한 경우, 전 자 장치에 의한 오류 원인 분석 방법 및 오류 해결 방법에 대해 개시하고 있다. 구체적으로, 전자 장치 는 전자 장치, 등록 장치, 네트워크 라우터 장치 및 클라우드 서버의 로그 정보를 분 석하고, 분석된 로그 정보에 기초하여 오류 원인 및 오류 원인에 대응되는 솔루션을 획득할 수 있다. 구체적인 전자 장치의 동작은 이하 도 2 내지 도 17을 참조하여 자세히 설명하기로 한다. 도 1b는 본 개시의 또 다른 실시 예에 따른 네트워크 시스템을 도시한 것이다. 도 1b를 참조하면, 네트워크 시스템은 전자 장치, 등록 장치, 네트워크 라우터 장치, 클 라우드 서버 및 서비스 기사의 전자 장치인 진단 장치를 포함한다. 도 1b의 전자 장치, 등 록 장치, 네트워크 라우터 장치 및 클라우드 서버는 도 1a에 도시된 것과 동일한 바, 중복된 설 명은 생략한다. 도 1b는 사용자가 직접 해결하지 못하고 서비스 기사가 방문한 실시 예를 기재한 것으로, 서비스 기사 의 진단 장치는 사용자의 전자 장치의 동작과 동일한 동작을 수행할 수 있다. 구체적으로, 진단 장치는 서비스 기사에게 네트워크 시스템에 대한 명령을 입력받고, 네트워크 시스템에 대한 정보를 제공할 수 있다. 구체적으로, 서비스 기사의 진단 장치는, 사용자의 전자 장치, 등록 장치 및 네트워크 라우터 장치와 연결되어 각 장치의 로그 정보를 수신할 수 있다. 이때, 네트워크 라우터 장치로부터 수신되는 로그 정보는 네트워크 라우터 장치의 로그 정보 및 네트워크 라우터 장치와 연결된 클라우 드 서버의 로그 정보를 포함할 수 있다. 특히, 서비스 기사의 진단 장치는, 클라우드 서버에 등록 장치의 등록이 실패하면, 전자 장 치, 등록 장치 및 네트워크 라우터 장치로부터 로그 정보를 획득할 수 있다. 그리고, 진단 장치 는, 획득된 로그 정보를 분석하여 오류 원인을 식별하고, 식별된 오류 원인에 대응되는 솔루션을 서비스 기사에게 제공할 수 있다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 간략한 구성을 설명하기 위한 블럭도이다. 도 2를 참조하면, 전자 장치는 통신부, 메모리 및 프로세서를 포함한다. 통신부는 전자 장치에 구비된 통신 회로에 기초하여 다양한 유형의 통신 방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성이다. 여기서, 전자 장치와 통신하는 외부 장치는 네트워크 라우터 장치, 네트워크에 등록되기 위한 전자 장치 등일 수도 있다. 실시 예에 따라, 전자 장치는 외부 서버나, 다른 사용자 단말 장치와 통신할 수도 있다. 통신부가 외부 장치와 통신 연결되는 것은 제3 기기(예로, 중계기, 허브, 엑세스 포인트, 서버 또는 게이 트웨이 등)를 거쳐서 통신하는 것을 포함할 수 있다. 무선 통신은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하 나를 사용하는 셀룰러 통신을 포함할 수 있다. 일 실시예에 따르면, 무선 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어 도 하나를 포함할 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 무선 통신 또는 유선 통신이 수행되는 네트워크는 텔레커뮤니케 이션 네트워크, 예를 들면, 컴퓨터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나 를 포함할 수 있다. 프로세서는 통신부를 통해 외부 장치와 데이터를 주고 받으면서 획득된 로그 정보를 메모리에 저장할 수 있다. 여기서, 메모리는 전자 장치의 동작에 필요한 각종 프로그램 및 데이터를 저장할 수 있다. 구체적으 로, 메모리에는 적어도 하나의 명령어가 저장될 수 있다. 프로세서는 메모리에 저장된 명령어를 실행함으로써 상술한 동작을 수행할 수 있다. 메모리는 비휘발성 메모리, 휘발성 메모리, 플래시메모리 (flash-memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD) 등으로 구현될 수 있다. 메모리는 프로세서에 의해 액세스되며, 프로세서에 의한 데이터의 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 본 개시에서 메모리라는 용어는 메모리, 프로세서 내 롬(미도시), 램(미도시) 또는 전자 장치에 장착되는 메모리 카드(미도시)(예를 들어, micro SD 카드, 메모리 스틱)를 포함할 수 있다. 또한, 메모리에는 디스플레이의 디스플레이 영역에 표시될 각종 화면을 구성하기 위한 프로그램 및 데이터 등이 저장될 수 있다. 그리고, 메모리에는 등록 장치의 등록 오류 원인에 대한 솔루션에 대한 데이터 베이스가 저장될 수 있다. 실시 예에 따라 솔루션 데이터 베이스는 외부 서버에 저장될 수도 있다. 프로세서는 메모리와 전기적으로 연결되어 전자 장치의 동작을 전반적으로 제어할 수 있다. 구 체적으로, 프로세서는 메모리에 저장된 적어도 하나의 명령어를 실행하여 전자 장치를 제어할 수 있다. 일 실시 예에 따라 프로세서는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세 서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리 장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러 (controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서 (communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있 다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration) 로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 프로세서는 전자 장치를 통한 등록 장치의 네트워크에의 등록이 실패하면, 전자 장치의 로그 정 보를 획득하고, 등록 장치 및 네트워크 라우터 장치로부터 로그 정보를 획득할 수 있다. 예를 들어, 전자 장치의 로그 정보에는 전자 장치의 모델 정보, 제조번호, OS버전, 커널, 빌드번호, S/T App 버전, 보안 SW 설치 여부, S/T App 설정 (클라우드제 어), 전자 장치의 동작 로그 정보 등이 포함 될 수 있다. 한편, 등록 장치로부터 수신되는 등록 장치의 로그 정보에는 등록 장치의 Firmware 버전, 등록 장치에서 측정된 AP의 RSSI, 사용 대역폭/채널에 대한 정보(예를 들어, 등록 장치가 TV인 경우, 5GHz), 등록 장치의 동작 로그 정보 등이 포함될 수 있다. 한편, 네트워크 라우터 장치로부터 수신되는 연결 환경에 대한 로그 정보는 액세스 포인트 호환성에 대한 정보, 네트워크 상태 정보 및 클라우드 서비스 상태 정보를 포함할 수 있다. 구체적으로, 네트워크 라우터 장치로부터 수신되는 연결 환경에 대한 로그 정보에는 네트워크 라우터 장치 자체에서 생성된 로그 정보 및 클라우드 서버 에서 획득된 클라우드 서버의 로그 정보가 포함될 수 있다. 즉, 전자 장치는 네트워크 라우터 장치를 통해 클라우드 서버에서 획득된 로그 정보를 수신할 수 있다. 구체적으로, 액세스 포인트 호환성에 대한 정보에는 AP Vendor, S/T, Bixby 에서 사용되는 Port의 차단 여부, UPnP 지원여부, 신호 세기(RSSI), 채널, 대역폭(2.4GHz, 5GHz) 등이 포함될 수 있다. 그리고, 네트워크 상태 정 보에는 S/T Cloud DNS 성공여부, Cloud 연결속도 (Mbps) 등이 포함될 수 있다. 그리고, 클라우드 서비스 상태 정보에는 Samsung Account Sign-in 로그, SmartThing Cloud 동작 로그, Plugin Download 동작 로그 등이 포함 될 수 있다. 이때, 각 장치의 로그 정보는 각 장치 간 이루어진 트랜잭션(transaction)에 대한 로그 정보가 포함될 수 있다. 여기서, 트랜잭션이란 네트워크를 통해 장치 간 이루어진 통신의 단위를 의미할 수 있다. 그리고, 트랜잭션을 요청 및 수신한 양 장치 사이에서 이루어진 데이터 전송 동작(송신, 수신)에 대해 양 장치에 각각 기록된 로그 정보를 의미할 수 있다. 여기서, 각 장치에서 획득된 로그 정보는 트랜잭션에 대한 정보 및 트랜잭션이 수행되는 시간에 대한 정보를 포 함할 수 있다. 여기서, 트랜잭션에 대한 정보는 양 장치에서 수행된 트랜잭션의 내용에 대한 정보를 의미할 수 있다. 예를 들어, 트랜잭션에 대한 정보를 참조하면, 전자 장치와 등록 장치 사이의 D2D 연결이 완료되었 는지 여부가 로그 정보를 통해 확인될 수 있다. 한편, 프로세서는 전자 장치와 외부 전자 장치가 D2D(device to device) 연결된 상태에서 외부 전자 장치의 로그 정보를 획득할 수 있다. 예를 들어, 전자 장치는 네트워크에 등록하고자 하는 등록 장치와 먼저 D2D 연결을 수행하고, D2D 연결된 등록 장치로부터 등록 장치의 로그 정보를 획득할 수 있다. 그리고, 프로세서는 획득된 전자 장치의 로그 정보 및 외부 장치의 로그 정보에서 대응되는 로그 정 보를 식별할 수 있다. 여기서, 대응되는 로그 정보란, 양 장치에 각각 기록된 로그 정보 중 양 장치 사이에서 이루어진 동일한 트랜잭션에 대한 로그 정보를 의미할 수 있다. 이때, 양 장치에서 수행된 하나의 트랜잭션에 대한 대응되는 트랜잭션에 대한 정보는 미리 매칭되어 메모리에 기저장된 것일 수 있다. 이에 따라, 프로 세서는 각 장치의 로그 정보에 포함된 트랜잭션에 대한 정보를 분석하여 동일한 트랜잭션이 수행된 양 장 치의 대응되는 로그 정보를 식별할 수 있다. 그리고, 프로세서는 각 장치의 로그 정보에서 식별된 대응되는 로그 정보를 이용하여 각 장치의 로그 정보 간 시간 정보가 일치되도록 장치 별 시간 정보의 보정 값을 획득할 수 있다. 이때, 프로세서는 전자 장치와 복수의 외부 장치 중 적어도 하나 사이에 수행된 트랜잭션에 대한 로 그 정보를 식별할 수도 있지만, 복수의 외부 장치 간 수행된 트랜잭션에 대한 로그 정보를 식별할 수도 있다. 구체적으로 식별된 로그 정보는, 전자 장치, 네트워크 라우터 및 등록 장치 중 하나의 장치에서 획득된 트 랜잭션의 요청에 대한 로그 정보 및 트랜잭션을 요청한 장치와 다른 장치에서 획득된 요청에 대응되는 응답에 대한 로그 정보를 포함할 수 있다. 이때, 프로세서는 트랜잭션의 요청에 대한 로그 정보가 생성된 시간부터 기설정된 시간 내에 응답에 대한 로그 정보가 없으면, 트랜잭션과 관련된 연결 동작의 오류인 것으로 식별할 수 있다. 이 경우, 요청 전 수행된 트랜잭션에 의해 장치 간 시간 정보는 보정된 상태일 수 있다. 예를 들어, 프로세서는 등록 장치의 로그 정보 중 등록 장치가 네트워크 라우터에 전송한 등록 요청에 대 한 로그 정보가 생성된 시간 정보를 획득하고, 네트워크 라우터의 로그 정보 중 획득된 시간 정보로부터 기설정 된 시간 내에 등록 요청에 대응되는 응답에 대한 로그 정보가 없으면, 네트워크 환경에 오류의 원인이 있는 것으로 식별할 수 있다. 한편, 장치 간 여러번 트랜잭션이 수행되는 경우, 프로세서는 복수의 트랜잭션 중 최초로 동일한 트랜잭션 에 대한 로그 정보를 대응되는 로그 정보로 식별할 수 있다. 그리고, 프로세서는 전자 장치의 로그 정보, 수신된 네트워크 라우터의 로그 정보 및 적어도 하나의 등록 장치의 로그 정보에 기초하여 상호 간 최초 로 수행된 트랜잭션에 대한 로그 정보의 시간 정보를 바탕으로 각 장치 별 시간 정보의 보정 값을 획득할 수 있 다. 대응되는 로그 정보를 이용해 각 장치 별 시간 정보를 보정하는 동작은 이하 도 5 및 도 6을 참조하여 자세 히 설명하기로 한다. 그리고, 프로세서는 보정 값을 반영한 로그 정보를 이용하여 오류를 식별할 수 있다. 구체적으로, 프로세 서는 보정 값을 반영한 로그 정보에 기초하여 전자 장치 및 복수의 외부 장치 중 적어도 하나와 관련 된 오류를 식별할 수 있다. 그리고, 프로세서는 식별된 오류에 대응되는 솔루션을 제공할 수 있다. 구체적으로, 프로세서는 메모 리에 기저장된 솔루선 데이터 베이스에서 식별된 오류에 대응되는 솔루션 정보를 획득할 수 있다. 그리고, 프로세서는 획득된 솔루션 정보를 디스플레이(도 3의 140)에 표시할 수 있다. 이때, 솔루션 정보 에는 오류의 원인 또는 솔루션이 포함될 수 있다. 이로 인해, 사용자는 디스플레이에 표시된 솔루션 정보에 기 초하여 오류를 해결할 수 있다. 한편, 프로세서는 획득된 솔루션 정보에 기초하여 오류와 관련된 외부 장치에 대한 제어 명령을 획득할 수 있다. 그리고, 프로세서는 오류와 관련된 외부 장치에 획득된 제어 명령을 전송할 수 있다. 예를 들어, 식별된 오류가 등록 장치와 관련된 오류이면, 프로세서는 오류와 관련된 등록 장치의 제어 명 령을 획득하고, 획득된 제어 명령을 등록 장치에 전송할 수 있다. 일 실시 예로, 등록 장치가 네트워크에 등록 되지 않는 오류 원인이 등록 장치가 Soft AP 모드로 변경되지 않기 때문이면, 프로세서는 등록 장치를 Soft AP 모드로 전환하기 위한 제어 명령을 생성하고, 생성된 제어 명령을 등록 장치로 전송할 수 있다. Soft AP란 액세스 포인트의 기능을 가진 소프트웨어(software enabled access point)의 약자로, 라우터가 아닌 장치가 무선 AP로의 동작이 가능케하는 소프트웨어를 의미할 수 있다. 예를 들어, 전자 장치가 액세스 포인트로 사용되어 노트북, 카메라, 세탁기, 에어컨 등의 등록 장치는 전자 장치에 연결되어 무선 인터넷을 사용할 수 있 는 테더링 기능 등이 Soft AP 기술을 이용한 기능이다.이때, 등록 장치가 무선 네트워크를 이용하려면, 등록 장치가 액세스 포인트가 되도록 Soft AP 모드가 활성화되 어야 한다. 즉, 등록 장치가 무선 네트워크를 통해 클라우드에 등록되기 위해서는 등록 장치가 Soft AP 모드로 변경되어야 한다. 상술한 바와 같이, 전자 장치는 로그 정보에 기초하여 식별된 오류에 따라 오류 해결을 위한 다른 동작을 수행할 수 있다. 한편, 상술한 오류 원인 이외에도 전자 장치와 등록 장치 사이에서 발생할 수 있는 연결 오류를 판단할 수 있다. 일 실시 예로, 등록 장치가 주변의 복수의 전자 장치에 상태 정보 또는 로그 정보를 브로드캐스트 (broadcast)하는 경우, 등록 장치의 주변 장치 중 하나인 전자 장치는 등록 장치의 상태에 대한 정보를 획 득할 수 있다. 예를 들어, 등록 장치가 자신의 상태 정보를 비프 사운드(beep sound) 등으로 출력하는 경우, 비 프 사운드를 수신한 전자 장치는 등록 장치의 상태를 획득할 수 있으며, 이에 기초하여 등록 장치와의 연 결 오류를 판단할 수 있다. 이하에 기재된 내용은 전자 장치와 등록 장치 사이에서 발생할 수 있는 연결 오류 및 솔루션의 일 실시 예 이다. - 전자 장치와 등록 장치 상호 간에 무선(Wi-Fi, BT, BLE) 신호가 약해 연결할 수 없는 경우, 전자 장치 는 사용자에게 솔루션 가이드를 제공할 수 있다. - 전자 장치 주변에 다수의 등록 장치가 존재하여, 장치 간 D2D 연결이 불가능한 경우, 전자 장치는 사용자에게 주변 등록 장치를 제거할 것을 요청하는 솔루션 가이드를 제공할 수 있다. - 전자 장치의 설정 오류로 인해 네트워크 또는 등록 장치에 연결이 불가능한 경우, 전자 장치는 설 정을 변경하는 제어 명령을 생성하여 오류를 해결할 수 있다. - 전자 장치가 등록 장치와 연결될 때, 등록 장치에 사용자로부터 연결과 관련된 승인(예: 물리적으로 버 튼을 누르는 동작 등)이 필요한데 사용자가 이를 제대로 수행하지 못한 경우, 전자 장치는 승인을 받기 위 한 제어 명령을 생성하고, 생성된 제어 명령을 등록 장치에 전송하여 오류를 해결할 수 있다. - 전자 장치가 등록 장치와 연결될 때, 등록 장치에 사용자로부터 연결과 관련된 승인이 제대로 수행되지 못해 실패한 경우, 다음 연결 시 등록 장치는 해당 승인을 자동으로 승인하여 연결 오류를 해결 할 수 있다. 한편, 전자 장치와 네트워크 사이에서 발생할 수 있는 오류 및 솔루션은 아래와 같을 수 있다. - 네트워크 라우터 장치에 연결된 클라우드(서비스 제공자)가 장애 또는 혼잡으로 인하여 클라우드로부터 등록/ 제어에 필요한 권한 획득을 하지 못한 경우, 전자 장치는 현재 연결 환경이 혼잡함을 안내하고, 추후 다시 시도할 것을 요청하는 솔루션 가이드를 사용자에게 제공할 수 있다. - 네트워크 환경 문제로 인해 클라우드 서비스에 접근(도달)할 수 없는 경우, 전자 장치는 사용자에게 솔 루션 가이드를 제공할 수 있다. - 전자 장치가 신규 등록 장치를 등록하기 이전, 클라우드 서비스와 권한 획득이 불가한 경우(DNS 실패, Cloud 장애, 잘못된 로그인 ID/PWD 사용 등), 전자 장치는 사용자에게 솔루션 가이드를 제공할 수 있다. 한편, 등록 장치와 네트워크 사이에 발생할 수 있는 오류 및 솔루션은 아래와 같을 수 있다. - 클라우드(서비스 제공자)가 장애 또는 혼잡으로 인하여, 등록 장치가 클라우드에 정상적으로 등록할 수 없음 을 전자 장치가 확인한 경우, 전자 장치는 사용자에게 이러한 원인 및 솔루션 가이드를 제공할 수 있 다. - 등록 장치가 클라우드에 접근 시 연결 환경 문제(예, 라우터 무선 신호 세기 약함, DNS 실패, 권한 획득 실 패)로 인한 오류를 확인한 경우, 전자 장치는 사용자에게 솔루션 가이드를 제공할 수 있다. 한편, 식별된 오류가 솔루션 데이터 베이스에 저장되어있지 않은 경우, 프로세서는 식별된 오류가 해결 불 가한 것으로 판단하고, 해당 오류에 대한 로그 정보를 로그 데이터 베이스에 저장할 수 있다. 이때, 프로세서 는 식별된 오류가 해결 불가함을 알리는 UI 화면을 디스플레이(도 3의 140)에 표시할 수 있다. 실시 예에 따라, 프로세서는 해당 로그 정보를 고객센터에 전송하여 분석을 의뢰하거나, 서비스 기사가 방문하도록 고객 센터로 요청할 수 있다.이러한 전자 장치의 솔루션 획득 동작에 대해서는 이하 도 4를 참조하여 자세히 기재하기로 한다. 상술한 바와 같이, 등록 장치가 네트워크에 등록되지 않는 경우, 복수의 장치의 로그 정보를 이용하여 오류를 식별 및 솔루션을 제시함으로써, 사용자는 오류의 원인을 빠르게 파악하고 오류 해결이 신속하게 진행하므로, 사용자 편의가 향상되는 효과가 있다. 도 3은 도 2에 개시된 전자 장치의 구체적인 구성을 설명하기 위한 블럭도이다. 도 3을 참조하면, 전자 장치는 통신부, 메모리, 프로세서, 디스플레이 및 스피커 를 포함할 수 있다. 여기서, 통신부, 메모리 및 프로세서의 일부 구성은 도 2에 도시된 구성과 동일한 바, 중복된 기재는 생략한다. 디스플레이는 프로세서의 제어에 따라 다양한 정보를 표시할 수 있다. 특히, 디스플레이는 사용 자 음성 명령에 대응되는 응답 정보를 표시할 수 있다. 또는 디스플레이는 응답 정보가 수정되었음을 알리 는 메시지를 표시할 수 있다. 디스플레이는 터치 패널과 함께 터치 스크린으로 구현될 수 있다. 실시 예에 따라, 전자 장치는 디스플레이를 생략할 수도 있다. 스피커는 프로세서에 의해 디코딩이나 증폭, 노이즈 필터링과 같은 다양한 처리 작업이 수행된 각종 오디오 데이터뿐만 아니라 각종 알림 음이나 음성 메시지를 출력하는 구성이다. 특히, 스피커는 식별된 오 류에 대한 정보를 출력할 수 있다. 구체적으로, 스피커는 식별된 오류의 원인 또는 오류에 대해 획득된 오 류 솔루션을 자연어 형태의 음성 메시지로 출력할 수 있다. 한편, 오디오를 출력하기 위한 구성은 스피커로 구 현될 수 있으나, 이는 일 실시 예에 불과할 뿐, 오디오 데이터를 출력할 수 있는 출력 단자로 구현될 수 있다. 한편, 도 3에는 도시되지 않았지만, 실시 예에 따라 전자 장치는 다양한 센서, 카메라, 외부 단자와 연결 하기 위한 다양한 외부 입력 포트 등을 더 포함할 수 있음은 물론이다. 도 4는 본 개시의 일 실시 예에 따른 오류 해결 방법을 개략적으로 나타낸 도면이다. 도 4를 참조하면, 메모리는 오류 해결에 필요한 복수의 모듈을 포함할 수 있다. 이때, 모듈은 기능 별로 구분하여 복수의 모듈로 기재되었는데, 여러 모듈이 하나의 모듈로 구현될 수 있으며, 이러한 모듈은 소프트웨 어 형태이거나, 하나 이상의 칩 형태로 구현될 수도 있다. 예를 들어, 메모리는 로그 분석 모듈, 솔루션 데이터베이스(DB), 결정 모듈, 오류 해결 모 듈 및 로그 데이터베이스(DB)를 포함할 수 있다. 우선 로그 분석 모듈은 획득된 로그 정보를 분석할 수 있다. 이때, 획득된 로그 정보는 전자 장 치에서 획득된 전자 장치의 로그 정보, 외부 장치인 등록 장치에서 수신된 등록 장치의 로그 정보 및 외부 장치 인 네트워크 라우터에서 수신된 연결 환경의 로그 정보를 포함할 수 있다. 구체적으로, 로그 분석 모듈은 입력된 로그 정보를 분석하여 대응되는 트랜잭션을 식별할 수 있다. 그리고 로그 분석 모듈은, 식별 된 트랜잭션의 시간 정보를 이용하여 각 장치의 로그 정보의 시간 정보를 보정할 수 있다. 그리고, 로그 분석 모듈은 보정된 로그 정보를 분석하여 오류를 식별할 수 있다. 구체적으로, 로그 분석 모듈은 보정된 로그 정보를 분석하여 장치 간 연결 과정 중 어느 단계까지 정상적으로 수행되었는지 식별 하고, 오류가 발생된 단계를 식별할 수 있다. 그리고, 로그 분석 모듈은 오류의 원인으로 식별된 로그 정보를 이용하여 솔루션 DB로부터 식별 된 로그 정보에 대응되는 솔루션에 대한 정보를 획득할 수 있다. 그리고, 결정 모듈은 획득된 솔루션 에 대한 정보에 따라 다른 오류 해결 동작을 수행할 수 있다. 예를 들어, 획득된 솔루션이 전자 장치 또는 외부 장치에 대한 제어 명령에 기초한 것이라면, 결정 모듈 은 오류 해결 모듈에 솔루션에 대한 정보를 전달할 수 있다. 이때, 오류 해결 모듈은 솔루션에 대한 정보에 기초하여 제어 명령을 생성하고, 생성된 제어 명령을 바탕으로 전자 장치를 제어하여 문제 해결을 시도할 수 있다. 한편, 오류 해결 모듈은 외부 장치에 의한 오류인 경우, 외부 장치를 제어하기 위한 제어 명령을 생성하고, 생성된 제어 명령을 오류와 관련된 외부 장치에 전송할 수 있다. 예를 들어, 등록 장치가 Soft AP 모 드로 전환되지 않아 네트워크에 등록되지 않은 경우, 오류 해결 모듈은 등록 장치를 Soft AP 모드로 전환하는 제어 명령을 생성하고, 생성된 제어 명령을 등록 장치에 전송할 수 있다. 한편, 제어 명령으로 해결 가능한 오류가 아닌 경우, 결정 모듈은 사용자가 조치를 취하도록 사용자에게 가이드를 제공할 수 있다. 예를 들어, Wi-Fi 신호 세기가 약하여 등록 장치가 네트워크 라우터에 등록되지 않는 경우, 결정 모듈은 디스플레이(도 3의 140)를 통해 사용자가 등록 장치를 네트워크 라우터에 가까이 가져가거나, 주변 방해물을 제거하도록 가이드를 제공할 수 있다. 한편, 솔루션 DB에 솔루션이 저장되어 있지 않은 경우, 결정 모듈은 해결 불가인 것으로 판단하 고, 입력된 로그 정보를 로그 DB에 저장할 수 있다. 추가로, 결정 모듈은 식별된 오류가 해결 불가인 경우, 사용자에게 안내하거나, 해당 로그 정보를 클라우드 서버에 전송할 수 있다. 또는, 결정 모듈 은 해결이 불가한 오류에 대한 로그 정보를 고객 센터에 전송하여 분석을 의뢰하거나, 서비스 기사가 방문 하도록 고객 센터로 요청할 수 있다. 도 5 및 도 6은 로그 정보를 이용한 오류 원인 분석 동작을 설명하기 위한 도면이다. 도 5를 참조하면, 전자 장치의 로그 분석 모듈은 획득된 로그 정보를 분석하여 key 로그 정보를 생성할 수 있다. 이때, 로그 정보는 도 6에 도시된 바와 같이, 전자 장치의 로그 정보, 등록 장치의 로그 정보 및 연결 환경(ENV, 네트워크 라우터)의 로그 정보를 포함할 수 있다. 우선 로그 분석 모듈은 D2D, D2S 트랜잭션 별 로그를 확인할 수 있다. 여기서 D2D(device to device) 트랜잭션은 전자 장치 및 등록 장치 간의 트랜잭션을 의미하고, D2S(device to service) 트랜잭션은 전 자 장치와 클라우드 서버 간의 트랜잭션 또는 등록 장치와 클라우드 서버 간의 트랜잭션을 의미할 수 있다. 구체적으로, 로그 분석 모듈은 각 장치의 로그 정보를 분석하여 상호 대응되는 로그 정보를 식별할 수 있 다. 구체적으로, 로그 분석 모듈은 획득된 각 장치의 로그 정보에서 대응되는 트랜잭션에 대한 로그 정보 를 식별할 수 있다. 예를 들어, 도 6에 도시된 바와 같이, 로그 분석 모듈은 연결 환경 로그 정보와 등록 장치 로그 정보에서 대응되는 트랜잭션에 대한 정보인 oic/account가 포함된 로그 정보를 식별하고, 식별된 각 로그 정보의 시간 정 보를 획득할 수 있다. 또한, 로그 분석 모듈은 전자 장치의 로그 정보에서 트랜잭션에 대한 정보에 'connectToNetwork'가 포함 된 로그 정보와 등록 장치의 로그 정보에서 'connectToNetwork'와 대응되는 트랜잭션에 대한 정보인 'CONNECTED FROM CLIENT'를 포함하는 로그 정보를 식별하고, 식별된 각 로그 정보의 시간 정보를 획득할 수 있 다. 이때, 대응되는 트랜잭션에 대한 정보는, 기저장된 것으로, 동일한 트랜잭션에 대한 매칭된 각 장치 별 트 랜잭션에 대한 정보일 수 있다. 한편, 도 6을 참조하면, 전자 장치와 등록 장치 간의 D2D 트랜잭션이 시작된 후 네트워크 라우터와 등록 장치의 D2S 트랜잭션이 시작되었음을 알 수 있다. 그리고, 로그 분석 모듈은 트랜잭션 별로 식별된 로그 정보의 시간 정보를 비교하여 로그 정보의 시간 보 정 값(Time offset)을 계산할 수 있다. 구체적으로, 로그 분석 모듈은 대응되는 트랜잭션의 시간 정 보를 일치시키도록 보정 값을 획득할 수 있다. 예를 들어, 도 6에 도시된 바와 같이, 로그 분석 모듈은 전자 장치의 로그 정보의 시간 정보를 기준으로 등록 장치 및 네트워크 라우터의 로그 정보의 시간 정보를 보정할 수 있다. 구체적으로, 로그 분석 모듈은 전자 장치와 등록 장치 간의 트랜잭션인 D2D 트랜잭션의 시작점의 로그 정보의 시간 정보를 이용하여 전자 장치 의 로그 정보와 등록 장치의 로그 정보의 시간 정보를 일치시킬 수 있다. 도 6을 참조하면, 전자 장치의 로그 정보 중 D2D 트랜잭션의 시작점인 로그 정보의 시간 정보는 '21:58:18.613'이고, 대응되는 등록 장치의 로그 정 보의 시간 정보는 '21:58:19.269'이다. 로그 분석 모듈은 전자 장치의 로그 정보의 시간 정보를 기준으로 등록 장치의 로그 오프셋이 '+0.656s'임을 계산할 수 있다. 그리고, 로그 분석 모듈은 전자 장치와 등록 장치 간의 트랜잭션인 D2S 트랜잭션의 시작점의 로그 정보의 시간 정보를 이용하여 연결 환경의 로그 정보와 등록 장치의 로그 정보의 시간 정보를 일치시킬 수 있다. 도 6 을 참조하면, 연결 환경의 로그 정보 중 D2S 트랜잭션의 시작점인 로그 정보의 시간 정보는 '21:58:38.035'이고, 대응되는 등록 장치의 로그 정보의 시간 정보는 '21:58:33.910'이다. 로그 분석 모듈 은 연결 환경의 로그 정보의 시간 정보가 등록 장치의 시간 정보보다 '4.125s'임을 식별할 수 있다. 그리 고, 로그 분석 모듈은 등록 장치의 로그 오프셋이 '+0.656s'임을 이용하여, 전자 장치의 로그 정보의 시간정보를 기준으로 연결 환경의 로그 오프셋이 '4.781s'임을 계산할 수 있다. 그리고, 로그 분석 모듈은 계산된 로그 오프셋을 바탕으로 등록 장치 및 네트워크 라우터의 로그 정보의 시간 정보를 보정할 수 있다. 그리고, 로그 분석 모듈은 시간 정보가 보정된 로그 정보를 분석하여 트랜잭 션 별 오류를 검증할 수 있다. 예를 들어, 도 6을 참조하면, 로그 분석 모듈은 전자 장치와 등록 장치의 D2D 트랜잭션에 대한 요청 및 응 답의 로그 정보에 기초하여 D2D 연결은 정상인 것으로 판단할 수 있다. 그러나, 네트워크 라우터에서 요청된 트 랜잭션인 'SEND_OBSERVE_NOTIFICATION'에 대응되는 응답에 대한 로그 정보가 요청된 시간으로부터 기설정된 시 간 내에 확인되지 않으면, 로그 분석 모듈은 트랜잭션 'SEND_OBSERVE_NOTIFICATION'에 오류가 발생한 것으 로 식별할 수 있다. 그리고, 로그 분석 모듈은 식별된 오류에 기초하여 key 로그를 생성할 수 있다. 여기서, 키 로그는 오류가 발생한 트랜잭션의 로그 정보에 대한 것으로, 오류가 발생한 트랜잭션의 정보 및 오류 발생 이유를 포함 할 수 있다. 도 6의 실시 예에서의 키 로그는 연결 환경이 요청한 트랜잭션에 대한 정보인 'ENV : SEND_OBSERVE_NOTIFICATION' 및 '등록 장치(ENROLLEE) Timeout'을 포함할 수 있다. 상술한 바와 같이, 장치 간 최초 트랜잭션을 이용하여 로그 정보의 시간 정보를 일치시키고, 로그 정보를 분석 하여 오류의 원인을 식별하는 바, 오류의 원인을 보다 정확하게 알 수 있으므로, 정확하고 빠른 대처가 가능하 게 된다. 도 7 내지 도 9는 등록 장치의 등록 오류 원인이 등록 장치의 연결 신호의 세기인 경우일 때의 전자 장치의 동 작을 설명하기 위한 도면이다. 여기서, 전자 장치는 획득된 로그 정보에 기초하여 D2D 연결 과정 중 어느 단계 까지 정상 수행되었는지 확인하고, 오류가 발생된 단계를 식별할 수 있다. 도 7을 참조하면, 우선 전자 장치는 획득된 전자 장치의 로그 정보 중 트랜잭션에 대한 정보에 'CMD_START_CONNECT sup state CompletedState'를 포함하는 로그 정보가 있으면, D2D 연결 단계가 정상적 으로 시작(D2D 연결단계 = true)된 것으로 판단할 수 있다. 그리고, 전자 장치는 전자 장치와 등록 장치 간 최초로 주고 받은 트랜잭션에 대한 로그 정보를 식별할 수 있다. 예를 들어, 도 7에 도시된 바와 같이, 전자 장치의 로그 정보 중 트랜잭션에 대한 정보에 'ConnectToNetwork \"[air purifier] Samsung\"'이 포함되는 트랜잭션의 요청에 대한 로그 정보를 확인할 수 있다. 그리고, 등록 장치의 로그 정보 중 요청에 대응되는 응답 트랜잭션에 대한 정보인 'SOFT AP MODE - CONNECTED FROM CLIENT'를 포함하는 로그 정보를 확인할 수 있다. 전자 장치는 전자 장치와 등록 장치 간 최초로 주고 받은 트랜잭션의 로그 정보를 통해 전자 장치와 등록 장치 간 D2D 트랜잭션(Transaction)이 시작됨을 확인할 수 있다. 예를 들어, 도 7에 도시된 바와 같이, 전자 장치의 로그 정보 중 트랜잭션에 대한 정보에 'ConnectToNetwork \"[air purifier] Samsung\"'이 포함되는 트랜잭 션의 요청에 대한 로그 정보를 확인할 수 있다. 그리고, 등록 장치의 로그 정보 중 요청에 대응되는 응답 트랜 잭션에 대한 정보인 'SOFT AP MODE - CONNECTED FROM CLIENT'를 포함하는 로그 정보를 확인할 수 있다. 이때, 트랜잭션 요청 및 트랜잭션 응답에 대한 로그 정보를 모두 확인하면, 전자 장치는 전자 장치 및 등록 장 치의 D2D 트랜잭션이 시작됨을 알 수 있다. 이때, 전자 장치는 D2D 트랜잭션이 시작된 로그 정보의 시간 정보에 기초하여 전자 장치와 등록 장치의 시간 정보를 일치시키기 위한 시간 보정 값을 획득할 수 있다. 그리고, 전자 장치는 획득된 보정 값을 반영하여 전자 장치의 로그 정보 및 등록 장치의 로그 정보의 선후 관계를 식별할 수 있다. 그리고, 전자 장치는 전자 장치와 등록 장치 간 D2D 연결이 완료됨(상대장치 연결 완료 = true)을 나타내는 트 랜잭션에 대한 로그 정보를 식별할 수 있다. 예를 들어, 도 7에 도시된 바와 같이, 트랜잭션에 대한 정보에 '\"[air purifier] Samsung\"│ WIFI:OK'이 포함된 로그 정보가 식별되면, 전자 장치는 전자 장치와 상대 장치인 등록 장치의 D2D 연결은 정상적으로 연결된 것으로 판단할 수 있다. 그리고, 전자 장치는 로그 정보 분석을 진행하여 오류의 원인을 식별할 수 있다. 예를 들어, 도 7을 참조하면, 전자 장치는 로그 정보를 분석한 결과 등록 장치로부터 수신되는 연결 신호의 세기가 기설정된 값(-70dB) 미만 인 -76dB인 로그 정보를 식별하면, 오류의 원인이 등록 장치와의 연결 신호의 세기인 것으로 판단할 수 있 다. 이때, 전자 장치는 시간 정보를 일치시키기 위한 보정 값을 반영하여 각 장치의 로그 정보를 분석할 수 있 다.상술한 바와 같은 로그 정보 분석에 기초하여 전자 장치는 도 8에 도시된 바와 같이 키 로그(Key Log)를 생성할 수 있다. 구체적으로, 전자 장치는 D2D 연결 단계는 정상(true)적으로 개시되었고, 전자 장치와 등록 장치 간 연결 완료가 정상(true)적으로 완료되었고, 등록 장치의 연결 신호의 세기가 기준 값 이상이 아님(false)을 나 타내는 키 로그을 생성할 수 있다. 그리고, 전자 장치는 솔루션 DB를 이용하여 생성된 키 로그에 대응되는 솔루션을 획득할 수 있 다. 이때, 솔루션 DB는 전자 장치에 구비된 것일 수 있고, 외부 장치일 수도 있다. 도 8을 참조하면, 전자 장치는 솔루션 DB로부터 사용자에게 연결 신호가 약함을 알리는 메시지를 제공하여 오류가 해결되도록 사용자를 가이드하는 솔루션을 획득할 수 있다. 한편, 솔루션의 방식 및 표시될 메시지 는 도 8에 도시된 바와 같이 솔루션 DB에서 획득될 수도 있고, 다른 실시 예로, 솔루션 DB로부터 솔루션에 대한 정보를 획득한 전자 장치가 제어 명령을 생성해 자체 해결 가능한지, 사용자에 의해 해결 가능한지 판단하고, 판단 결과에 기초하여 솔루션 방식 및 표시될 메시지가 결정될 수도 있다. 그리고, 전자 장치는 도 9에 도시된 바와 같이, 연결하고자 하는 상대 기기의 연결 신호가 약하며, 상대 기기를 전자 장치에 가까이 이동시키거나, 주변 방해물을 제거하라는 메시지를 사용자에게 제공할 수 있다. 도 10 내지 도 12는 등록 장치의 등록 오류의 원인이 네트워크 환경인 경우일 때의 전자 장치의 동작을 설명하 기 위한 도면이다. 도 10을 참조하면, 전자 장치는 획득된 로그 정보를 분석하여 전자 장치와 등록 장치 간 최초로 주고 받은 트랜 잭션에 대한 로그 정보를 식별할 수 있다. 예를 들어, 도 10에 도시된 바와 같이, 전자 장치의 로그 정보 중 트 랜잭션에 대한 정보에 'ConnectToNetwork \"[air purifier] Samsung\"'이 포함되는 트랜잭션의 요청에 대 한 로그 정보를 확인할 수 있다. 그리고, 등록 장치의 로그 정보 중 요청에 대응되는 응답 트랜잭션에 대한 정 보인 'SOFT AP MODE - CONNECTED FROM CLIENT'를 포함하는 로그 정보를 확인할 수 있다. 전자 장치는 전자 장치와 등록 장치 간 최초로 주고 받은 트랜잭션의 로그 정보(D2D Transaction의 시작점)를 통해 시간 정보를 일치시킬 수 있다. 예를 들어, 도 10에 도시된 바와 같이, 전자 장치의 로그 정보 중 트랜잭 션에 대한 정보에 'ConnectToNetwork \"[air purifier] Samsung\"'이 포함되는 트랜잭션의 요청에 대한 로 그 정보를 확인할 수 있다. 그리고, 등록 장치의 로그 정보 중 요청에 대응되는 응답 트랜잭션에 대한 정보인 'SOFT AP MODE - CONNECTED FROM CLIENT'를 포함하는 로그 정보를 확인할 수 있다. 이때, 트랜잭션 요청 및 트랜잭션 응답에 대한 로그 정보를 모두 확인하면, 전자 장치는 전자 장치 및 등록 장치의 D2D 트랜잭션이 시작됨을 알 수 있다. 그리고, 전자 장치는 이에 기초하여 전자 장치와 등록 장치 간 D2D 연결 완료가 정상 (true)적으로 수행된 것으로 판단할 수 있다. 그리고, 전자 장치는 로그 정보 분석을 진행하여 오류의 원인을 식별할 수 있다. 예를 들어, 도 10을 참조하면, 전자 장치는 등록 장치의 로그 정보를 분석하여, 등록 장치가 서비스에 등록하기 위한 트랜잭션 요청에 대한 정 보인 'ES_STATE_PUBLISHING_RESOURCES_TO_CLOUD'을 포함하는 로그 정보를 식별할 수 있다. 이때, 전자 장치는 등록 장치가 서비스에 등록 요청은 정상(true)으로 수행된 것으로 판단할 수 있다. 한편, 네트워크 라우터 장치로부터 수신된 로그 정보인 환경(ENV) 로그 정보에 등록 장치의 등록 요청에 대한 트랜잭션이 요청된 후 기설정된 시간 내에 응답에 대한 트랜잭션이 없으면, 전자 장치는 네트워크 환경에 등록 오류의 원인이 있는 것으로 판단할 수 있다. 예를 들어, 도 10을 참조하면, 연결 환경 로그 정보를 분석하 여 트랜잭션 요청에 대해 기설정된 시간(10초) 이전에 요청에 대응되는 응답에 대한 로그 정보가 없으면 (false), 네트워크 라우터의 응답 지연이 등록 장치의 등록 오류의 원인인 것으로 판단할 수 있다. 이때, 연결 환경 로그 정보의 시간 정보는 도 5 및 도 6에 도시된 바와 같이 다른 장치들과 시간 정보가 일치된 것일 수 있다. 상술한 바와 같은 로그 정보 분석에 기초하여 전자 장치는 도 11에 도시된 바와 같이 키 로그(Key Log)를 생성 할 수 있다. 구체적으로, 전자 장치는 전자 장치와 등록 장치 간 D2D 연결 단계는 정상(true)적으로 완료되었고, 등록 장치가 서비스에 등록 요청이 정상(true)적으로 수행되었고, 서비스 응답 시간이 기설정된 시 간 이하가 아님(false)을 나타내는 키 로그을 생성할 수 있다. 그리고, 전자 장치는 솔루션 DB를 이용하여 생성된 키 로그에 대응되는 솔루션을 획득할 수 있다. 이때, 솔루션 DB는 전자 장치에 구비된 것일 수 있고, 외부 장치일 수도 있다. 도 11을 참조하면, 전자 장치는 솔루션 DB로부터 사용자에게 서비스 제공자의 응답이 지연됨을 알리는 메 시지를 제공하여 오류가 해결되도록 사용자를 가이드하는 솔루션을 획득할 수 있다. 한편, 솔루션의 방식 및 표시될 메시지는 도 11에 도시된 바와 같이 솔루션 DB에서 획득될 수도 있고, 다른 실시 예로, 솔루션 DB로 부터 솔루션에 대한 정보를 획득한 전자 장치가 제어 명령을 생성해 자체 해결 가능한지, 사용자에 의해 해결 가능한지 판단하고, 판단 결과에 기초하여 솔루션 방식 및 표시될 메시지가 결정될 수도 있다. 그리고, 전자 장치는 도 12에 도시된 바와 같이, 네트워크 환경이 혼잡하여 연결이 지연되고 있으니, 잠시 후 재시도하라는 메시지를 사용자에게 제공할 수 있다. 한편, 전자 장치는 솔루션을 바탕으로, 전자 장치가 제어 명령을 생성하여 해결 가능한 경우, 오류 해결을 위한 제어 명령을 생성 또는 전송하고, 도 13에 도시된 바와 같이, 사용자에게 오류 해결 동작을 수행하였음을 알리 는 UI 화면을 표시할 수 있다. 도 14a 내지 도 14c는 등록 장치의 등록 오류의 원인이 Soft AP가 이미 저장된 경우일 때, 전자 장치에 표시되 는 UI 화면의 일 실시 예를 도시한 도면이다. 예를 들어, 사용자가 전자 장치를 이용하여 등록 장치인 세탁기(washer)를 네트워크에 등록하기를 원했으나, 세 탁기가 네트워크에 등록되지 않은 경우, 사용자는 전자 장치를 이용해 등록 오류의 원인이 무엇인지 확인할 수 있다. 일 실시 예로, 사용자는 도 14a에 도시된 바와 같이, 진단의 목적을 위해 UI 화면에 구비된 특정 버튼을 눌러 등록 오류의 원인을 확인할 수 있다. 이때, 전자 장치는 전자 장치의 로그 정보, 등록 장치인 세탁기의 로그 정보 및 네트워크 라우터의 로그 정보를 획득하여 분석하고, 오류의 원인을 식별할 수 있다. 그리고, 전자 장치는 도 14b에 도시된 바와 같이 식별된 오류의 원인을 표시할 수 있다. 예를 들어, 전자 장치 는 등록 장치의 Soft AP가 이미 전자 장치에 저장되어 있음을 알리는 UI 화면을 표시할 수 있다. 한편, 전자 장치는 도 14c에 도시된 바와 같이, 오류의 원인 뿐만 아니라, 오류를 해결할 수 있는 솔루션을 함 께 제공하는 UI 화면을 표시할 수 있다. 이때, 도 14c와 같은 화면은 도 14b에 도시된 화면에서 추가 정보를 알 기 위한 오브젝트를 선택한 경우 표시될 수 있다. 한편, 도 14c와 같은 화면은 도 14b와 다른 경로를 통해 표시 된 AP 리스트에서 등록 장치를 선택한 경우에 표시될 수도 있다. 이와 같이, 사용자가 전자 장치를 통해 등록 장치를 네트워크에 등록 시도 하였으나 실패한 경우, 전자 장치는 로그 정보 분석을 통해 등록 오류의 원인을 상세히 파악하여 사용자에게 제공함으로써 사용자는 오류의 정확한 원인을 알 수 있게 된다. 또한, 전자 장치는 솔루션을 함께 제공함으로써, 오류가 원활히 해결되어 사용자의 편 의를 향상시킬 수 있다. 도 15a 및 도 15b는 등록 장치의 등록 오류의 원인이 중복 Soft AP가 주변에 탐지되는 경우일 때, 전자 장치에 표시되는 UI 화면의 일 실시 예를 도시한 도면이다. 예를 들어, 사용자가 전자 장치를 이용하여 등록 장치인 공기 청정기(air purifier)를 네트워크에 등록하기를 원했으나, 공기 청정기가 네트워크에 등록되지 않은 경우, 사용자는 전자 장치를 이용해 등록 오류의 원인이 무 엇인지 확인할 수 있다. 일 실시 예로, 사용자는 진단의 목적을 위해 UI 화면에 구비된 특정 버튼을 눌러 등록 오류의 원인을 확인할 수 있다. 이때, 전자 장치는 전자 장치의 로그 정보, 등록 장치인 공기 청정기의 로그 정보 및 네트워크 라우터의 로그 정보를 획득하여 분석하고, 오류의 원인을 식별할 수 있다. 그리고, 전자 장치는 도 15a에 도시된 바와 같이 식별된 오류의 원인을 표시할 수 있다. 예를 들어, 전자 장치 는 중복 SSID가 존재함을 알리는 UI 화면을 표시할 수 있다. 한편, 전자 장치는 도 15b에 도시된 바와 같이, 오류의 원인 뿐만 아니라, 오류를 해결할 수 있는 솔루션을 함 께 제공하는 UI 화면을 표시할 수 있다. 이때, 도 15b와 같은 화면은 도 15a에 도시된 화면에서 추가 정보를 알 기 위한 오브젝트를 선택한 경우 표시될 수 있다. 한편, 도 15b와 같은 화면은 도 15a와 다른 경로를 통해 표시 된 AP 리스트에서 등록 장치를 선택한 경우에 표시될 수도 있다. 이와 같이, 사용자가 전자 장치를 통해 등록 장치를 네트워크에 등록 시도 하였으나 실패한 경우, 전자 장치는 로그 정보 분석을 통해 등록 오류의 원인을 상세히 파악하여 사용자에게 제공함으로써 사용자는 오류의 정확한 원인을 알 수 있게 된다. 또한, 전자 장치는 솔루션을 함께 제공함으로써, 오류가 원활히 해결되어 사용자의 편 의를 향상시킬 수 있다. 한편, 상술한 실시 예 이외에도 전자 장치는 로그 정보 분석을 통해 클라우드 접속에 필요한 DNS IP 획득에 실 패하여 도메인에 도달하지 못한 경우, 클라우드 연결 응답 시간이 초과한 경우, 와이파이에 연결되지 않는 경우, 인터넷 연결 상태가 문제인 경우 등의 오류 원인을 식별하고, 이를 사용자에게 제공할 수 있다. 도 16은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 16을 참조하면, 우선 전자 장치는 전자 장치를 통한 제2 전자 장치의 네트워크 등록이 실패하면, 전자 장치 의 로그 정보를 획득하고, 제2 전자 장치 및 네트워크 라우터 장치로부터 로그 정보를 획득할 수 있다(S1610). 이때, 전자 장치는 제2 전자 장치로부터 제2 전자 장치의 로그 정보를 획득할 수 있다. 그리고, 전자 장치는 네 트워크 라우터 장치로부터 네트워크 라우터 장치의 로그 정보 및 네트워크 라우터 장치와 연결된 클라우드 서버 의 로그 정보를 획득할 수 있다. 그리고, 전자 장치는 획득된 로그 정보 중 대응되는 로그 정보를 식별할 수 있다(S1620). 이때, 대응되는 로그 정보는 장치 간 동일한 트랜잭션에 대한 요청 및 응답에 대한 정보일 수 있다. 구체적으로, 전자 장치는 각 장 치의 로그 정보를 분석하여 트랜잭션에 대한 정보가 대응되는 로그 정보를 식별할 수 있다. 그리고, 전자 장치는 대응되는 로그 정보를 이용하여 획득된 로그 정보 간 시간 정보가 일치되도록 각 장치 별 시간 정보의 보정 값을 획득할 수 있다(S1630). 구체적으로, 전자 장치는 트랜잭션 요청에 대한 로그 정보의 시간 정보와 응답에 대한 로그 정보의 시간 정보가 일치하도록 각 장치 별 시간 정보의 보정 값을 획득할 수 있다. 그리고, 전자 장치는 보정 값을 반영한 로그 정보를 이용하여 오류를 식별할 수 있다(S1640). 구체적으로, 전자 장치는 보정 값이 반영된 각 장치의 로그 정보를 분석하고, 이에 기초하여 제2 전자 장치를 네트워크에 등록하 는 과정에서 정상적으로 진행된 단계를 식별할 수 있다. 그리고, 전자 장치는 각 장치의 로그 정보 분석을 통해 등록 과정에서 오류가 발생된 단계를 식별할 수 있다. 즉, 전자 장치는 오류가 발생된 원인을 상세하게 파악할 수 있다. 그리고, 전자 장치는 식별된 오류에 대응되는 솔루션을 제공할 수 있다(S1650). 구체적으로, 전자 장치는 솔루 션 DB에서 오류가 발생된 단계의 로그 정보에 대응되는 솔루션을 획득하고, 획득된 솔루션을 사용자에게 제공할 수 있다. 이때, 솔루션 DB는 전자 장치에 구비된 것일 수도 있고, 외부 서버일 수도 있다. 한편, 전자 장치는 획득된 솔루션을 바탕으로, 자체적으로 해결 가능한 경우, 제어 명령을 생성 또는 전송하여 오류를 해결할 수 있다. 이때, 전자 장치는 오류 해결 중임을 UI 화면 또는 알림을 통해 사용자에게 알릴 수 있 다. 한편, 자체적으로 해결 불가능한 경우, 전자 장치는 솔루션을 사용자에게 제공하여 사용자가 오류 해결을 위한 동작을 수행하게할 수 있다. 상술한 바와 같이, 전자 장치가 각 장치의 로그 정보를 통합하여 분석함으로써, 등록 장치의 등록 실패 원인을 보다 정확하게 판단할 수 있고, 정확한 솔루션을 사용자에게 제공하여 사용자의 불편함을 감소시킬 수 있다. 도 17은 본 개시의 일 실시 예에 따른 네트워크 시스템의 등록 오류 분석 방법을 설명하기 위한 시퀀스도이다. 도 17을 참조하면, 우선 사용자는 전자 장치의 네트워크를 활성화할 수 있다(S1701). 예를 들어, 네트 워크는 Wi-Fi, 블루투스 등일 수 있다. 이하에서는 설명의 편의를 위하여 네트워크가 Wi-Fi인 것으로 설명하나 이에 한정되지 않는다. 그리고, 전자 장치는 네트워크 라우터 장치 및 클라우드 서버에 연결 정 보를 확인할 수 있다(S1702). 사용자는 전자 장치가 Wi-Fi에 연결됨을 확인한 뒤, 등록 장치를 네트워크(300, 301)에 등록하기 위해 등록 장치를 \"연결 모드\"로 전환할 수 있다(S1703). 그리고, 사용자가 전자 장치에 장치 추가 요청을 입력하면(S1704), 전자 장치는 네트워크 라우터 장치(Wifi-AP, 300)와 연결을 끊고(S1705), 등록 장치와 연결될 수 있다(S1706). 이때, 전자 장치와 등록 장치는 D2D 방식으로 연결될 수 있다. 이때, 전자 장치는 등록 장치에 네트워크에 접속 가능한지 여부를 확인을 위한 요청을 등록 장치 에 전송할 수 있다(S1707). 이는 네트워크(300, 301)에 등록될 등록 장치를 확인하기 위한 단계로, 등록 장치는 확인 요청 수신에 따라 사용자에게 확인 요청을 받기 위한 UI 화면 또는 알림을 제공할 수 있다. 사용자가 등록 장치를 통해 접속을 수락하면(S1708), 전자 장치는 등록 장치가 등록될 클라우드 서버 및 네트워크 정보를 등록 장치에 전송할 수 있다(S1709). 등록 장치에 클라우드 서버 및 네트워크 정보 전송을 완료한 후 전자 장치는 등록 장치와 의 연결을 끊고, 다시 네트워크 라우터 장치와 연결될 수 있다(S1710). 등록 장치는 네트워크(300, 301)와의 연결을 위한 연결 정보를 확인할 수 있다(S1711). 그리고, 등록 장치 는 클라우드 서버가 등록 장치를 등록(Sign up) 하도록 등록 장치의 정보를 클라우드 서버 에 전송할 수 있다(S1712). 이후, 전자 장치는 등록 장치가 적합한 네트워크 라우터 장치에 연결되었는지를 재확인하고 (S1713), 등록 장치는 클라우드 서버에 로그인(sign in)할 수 있다(S1714). 그리고, 등록 장치(20 0)는 장치 정보를 클라우드 서버에 등록할 수 있다(S1715). 이때, 장치 정보는 등록 장치의 전원 상 태, 현재 온도 및 습도와 같은 현재 주변 환경 상태에 대한 정보를 포함할 수 있다. 등록 장치의 현재 상 태 정보를 등록한 클라우드 서버는 등록 완료 여부를 전자 장치에 통보할 수 있다(S1716). 한편, S1701 내지 S1715 중 적어도 하나의 단계에서 오류가 발생한 경우, 클라우드 서버는 등록 완료 통보 를 수행할 수 없으며, 이때, 사용자는 전자 장치에 재시도를 요청(S1717)할 수 있다. 재시도 요청에 따라, 전자 장치는 등록 장치에 \"연결 모드\"로 전환할 것을 요청할 수 있다(S1718). 이후, 전자 장치는 등록 장치로부터 등록 장치의 로그 정보를 수집하고, 통합할 수 있다(S1719). 도 시되지는 않았으나, 전자 장치는 전자 장치의 로그 정보와, 네트워크 라우터 장치로부터 연결 환경에 대한 로그 정보 및 등록 장치로부터 수신된 로그 정보를 통합할 수 있다. 그리고, 전자 장치는 획득된 로그 정보를 분석하여 키 로그(Key Log)를 분석할 수 있다(S1720). 이때, 전 자 장치는 로그 정보 분석을 통해 등록 장치의 네트워크(300, 301) 등록 과정에서 어느 단계까지 정상적으 로 진행되었고, 어느 단계에서 오류가 발생했는지를 식별하여 키 로그를 획득할 수 있다. 그리고, 전자 장치는 키 로그를 바탕으로 발생된 문제 원인을 분석하고, 연결을 재수행할 수 있다(S1721). 구체적으로, 전자 장치는 솔루션 DB에 기저장된 솔루션 중 식별된 오류 원인에 따른 솔루션을 획득할 수 있다. 그리고, 전자 장치는 솔루션에 따라 제어 명령을 생성하여 자체적으로 해결하거나, 사용자에게 솔루 션을 제공하여 오류 원인을 제거하도록할 수 있다. 이상에 기재한 다양한 실시 예에 따라, 전자 장치가 각 장치의 로그 정보를 통합하여 분석함으로써, 등록 장치 의 등록 실패 원인을 보다 정확하게 판단할 수 있고, 정확한 솔루션을 사용자에게 제공하여 사용자의 불편함을 감소시킬 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합된 것 을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 하드 웨어적인 구현에 의하면, 본 개시에서 설명되는 실시 예들은 ASICs(Application Specific Integrated Circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기 (controllers), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행 을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 명세서에서 설명되 는 실시 예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 상기 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 작동을 수행할 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 방법은 비일시적 판독 가능 매체(non-transitory readable medium) 에 저장될 수 있다. 이러한 비일시적 판독 가능 매체는 다양한 장치에 탑재되어 사용될 수 있다. 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 방법을 수행하기 위한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD- ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있다. 온라인 배 포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시"}
{"patent_id": "10-2019-0033080", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시가 속하는 기술분야 에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2019-0033080", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a 및 도 1b는 본 개시의 일 실시 예에 따른 네트워크 시스템을 도시한 도면, 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 간략한 구성을 설명하기 위한 블럭도, 도 3은 도 2에 개시된 전자 장치의 구체적인 구성을 설명하기 위한 블럭도, 도 4는 본 개시의 일 실시 예에 따른 오류 해결 방법을 개략적으로 나타낸 도면, 도 5 및 도 6은 로그 정보를 이용한 오류 원인 분석 동작을 설명하기 위한 도면, 도 7 내지 도 9는 등록 장치의 등록 오류 원인이 등록 장치의 연결 신호의 세기인 경우일 때의 전자 장치의 동 작을 설명하기 위한 도면, 도 10 내지 도 12는 등록 장치의 등록 오류의 원인이 네트워크 환경인 경우일 때의 전자 장치의 동작을 설명하 기 위한 도면, 도 13은 전자 장치에 의해 오류 해결이 가능한 경우, 전자 장치에 표시되는 UI 화면의 일 실시 예를 도시한 도 면, 도 14a 내지 도 14c는 등록 장치의 등록 오류의 원인이 Soft AP가 이미 저장된 경우일 때, 전자 장치에 표시되 는 UI 화면의 일 실시 예를 도시한 도면, 도 15a 및 도 15b는 등록 장치의 등록 오류의 원인이 중복 Soft AP가 주변에 탐지되는 경우일 때, 전자 장치에 표시되는 UI 화면의 일 실시 예를 도시한 도면, 도 16은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도, 그리고, 도 17은 본 개시의 일 실시 예에 따른 네트워크 시스템의 등록 오류 분석 방법을 설명하기 위한 시퀀스도이다."}
