{"patent_id": "10-2021-0063139", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0010419", "출원번호": "10-2021-0063139", "발명의 명칭": "동적 예측 신뢰도 임계값 선택에 기반한 저복잡도 인공지능 모델 학습을 위한 전자 장치 및", "출원인": "고려대학교 산학협력단", "발명자": "박종선"}}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서(processor); 및상기 적어도 하나의 프로세서에 동작 가능하게 연결되어 상기 적어도 하나의 프로세서가 동작들을 수행하도록하는 적어도 하나의 명령어들(instructions)을 저장하는 적어도 하나의 메모리(memory)를 포함하고,상기 동작들은,상기 적어도 하나의 메모리에 저장된 입력 데이터에 대하여 레이블(label)을 예측하는 인공 지능(artificialintelligence) 모델의 학습 동작을 수행하고,상기 학습 동작은,상기 입력 데이터에 대하여 미니-배치(mini-batch) - 여기서, 상기 미니-배치는 상기 입력 데이터에 포함된 B개의 하위 입력 데이터를 가지고, 상기 B는 자연수임 -; 단위로 순전파(forward propagation) 동작을 수행하여 상기 레이블에 대한 예측 신뢰도 값을 획득하고,상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 예측 신뢰도 임계 값 이상인 하위 입력 데이터에 대하여만 역전파(backward propagation) 동작을 수행하여 상기 인공 지능 모델의 가중치에 대한 근사 가중치 그래디언트(gradient)를 획득하고,상기 근사 가중치 그래디언트에 기초하여 상기 가중치를 업데이트하는,전자 장치."}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 학습 동작은,상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 상기 예측 신뢰도 임계 값 미만인 하위 입력 데이터에 대하여상기 역전파 동작을 생략하는,전자 장치."}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 학습 동작은,상기 예측 신뢰도 임계 값을 설정하는 예측 신뢰도 임계 값 설정 동작을 포함하고,상기 예측 신뢰도 임계 값 설정 동작은,(a) 임의 예측 신뢰도 임계 값 및 RSEskip - 상기 RSEskip는 상기 역전파 동작의 생략에 따른 가중치 그래디언트오류 값임 -;을 초기화하는 동작,(b) 상기 임의 예측 신뢰도 임계 값을 특정 변동 값 단위로 감소시키고, 상기 임의 예측 신뢰도 임계 값이 상기특정 변동 값 단위로 감소될 때마다 상기 RSEskip를 계산하는 동작,(c) 상기 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때까지 (b) 동작을 반복공개특허 10-2022-0010419-3-적으로 수행하는 동작,(d) 상기 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때의 상기 임의 예측 신뢰도 임계 값을 상기 예측 신뢰도 임계 값으로 설정하는 동작을 포함하는,전자 장치."}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 RSEskip는 기 설정된 스케일링 인자, 상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 상기 예측 신뢰도 임계 값 이상인 하위 입력 데이터의 개수 및 상기 예측 신뢰도 값의 평균 절대 그래디언트의 곱으로 정의되는,전자 장치."}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 평균 절대 그래디언트는 상기 예측 신뢰도 값의 전체 신뢰도 구간에 대한 선형 보간법에 기초하여 정의되는,전자 장치."}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "전자 장치에 의해 수행되는 적어도 하나의 메모리에 저장된 입력 데이터에 대하여 레이블(label)을 예측하는 인공 지능(artificial intelligence) 모델의 학습 방법으로서,상기 입력 데이터에 대하여 미니-배치(mini-batch) - 여기서, 상기 미니-배치는 상기 입력 데이터에 포함된 B개의 하위 입력 데이터를 가지고, 상기 B는 자연수임 -; 단위로 순전파(forward propagation) 동작을 수행하여 상기 레이블에 대한 예측 신뢰도 값을 획득하는 단계;상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 예측 신뢰도 임계 값 이상인 하위 입력 데이터에 대하여만 역전파(backward propagation) 동작을 수행하여 상기 인공 지능 모델의 가중치에 대한 근사 가중치 그래디언트(gradient)를 획득하는 단계; 및상기 근사 가중치 그래디언트에 기초하여 상기 가중치를 업데이트하는 단계를 포함하는,학습 방법."}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 상기 예측 신뢰도 임계 값 미만인 하위 입력 데이터에 대한상기 역전파 동작은 생략되는,학습 방법."}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,공개특허 10-2022-0010419-4-상기 예측 신뢰도 임계 값을 설정하는 예측 신뢰도 임계 값을 설정 단계를 더 포함하고,상기 예측 신뢰도 임계 값 설정 단계는:(a) 임의 예측 신뢰도 임계 값 및 RSEskip - 상기 RSEskip는 상기 역전파 동작의 생략에 따른 가중치 그래디언트오류 값임 -;을 초기화하는 단계;(b) 상기 임의 예측 신뢰도 임계 값을 특정 변동 값 단위로 감소시키고, 상기 임의 예측 신뢰도 임계 값이 상기특정 변동 값 단위로 감소될 때마다 상기 RSEskip를 계산하는 단계;(c) 상기 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때까지 (b) 동작을 반복적으로 수행하는 단계; 및(d) 상기 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때의 상기 임의 예측 신뢰도 임계 값을 상기 예측 신뢰도 임계 값으로 설정하는 단계를 포함하는,학습 방법."}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 RSEskip는 기 설정된 스케일링 인자, 상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 상기 예측 신뢰도 임계 값 이상인 하위 입력 데이터의 개수 및 상기 예측 신뢰도 값의 평균 절대 그래디언트의 곱으로 정의되는,학습 방법."}
{"patent_id": "10-2021-0063139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 평균 절대 그래디언트는 상기 예측 신뢰도 값의 전체 신뢰도 구간에 대한 선형 보간법에 기초하여 정의되는,학습 방법."}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 양상으로, 적어도 하나의 프로세서(processor); 및 상기 적어도 하나의 프로세서에 동작 가능하게 연결되어 상기 적어도 하나의 프로세서가 동작들을 수행하도록 하는 적어도 하나의 명령어들(instructions)을 저 장하는 적어도 하나의 메모리(memory)를 포함하고, 상기 동작들은, 상기 적어도 하나의 메모리에 저장된 입력 데 (뒷면에 계속)"}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시 (present disclosure)는 동적 예측 신뢰도 임계값 선택에 기반한 저복잡도 인공지능 모델 학습을 위한 전자 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "DNN(deep neural network)은 많은 파라미터와 연산량을 기반으로 이미지 인식/분류, 객체 탐지 등 여러 응용 분 야에서 최고의 성능을 보이고 있다. DNN의 수많은 파라미터를 학습시키기 위해서는 많은 연산량이 필요하며, DNN의 학습에는 일/주 단위의 긴 시간을 필요로 하기도 한다. 이러한 학습 시간 및 학습 에너지 소모를 줄이기 위해서는, 학습에 필요한 연산량 자체를 줄이는 것이 효과적이다. DNN 학습에 일반적으로 사용되는 미니 배치 경사 하강법(Mini-batch Gradient Descent)은 본질적으로 노이즈 (Noise)를 포함하기 때문에, 학습에 필요한 연산을 반드시 정확하게 계산할 필요 없이 근사하는 것이 가능하다. 종래의 DNN 학습은 매우 큰 연산량을 필요로 하여, 긴 학습 시간과 많은 학습 에너지를 소모한다는 문제점이 있 으나, 미니 배치 경사 하강법에 기반하여 학습에 중요한 연산과 그렇지 않은 연산을 잘 구분하여, 상대적으로 중요하지 않은 연산에 대해 효과적인 근사를 적용할 수 있다면 전체 학습에 필요한 연산량을 줄일 수 있을 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 10-2019-0098107 (특허문헌 0002) 대한민국 공개특허 10-2019-0118387"}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 다양한 예들은 미니 배치 경사 하강법을 통한 학습이 노이즈를 허용하는 특성을 활용하여, 사용자가 설정한 허용 가능 노이즈 범위 내에서 연산 생략에 따른 오류가 작은(즉, 예측 신뢰도가 높은) 이미지에 대한 가중치 변화량 연산을 생략하여 전체 학습 연산량을 줄이고 학습 에너지를 절감하여 학습에 대한 영향을 최소화 할 수 있는 동적 예측 신뢰도 임계값 선택에 기반한 저복잡도 인공지능 모델 학습을 위한 전자 장치 및 방법을 제공하는데 있다. 또한, 동적 예측 신뢰도 임계값 선택을 통해 가중치 변화량의 생략 정도를 사용자가 조절할 수 있는 동적 예측 신뢰도 임계값 선택에 기반한 저복잡도 인공지능 모델 학습을 위한 전자 장치 및 방법을 제공하는데 있다. 본 개시의 다양한 예들에서 이루고자 하는 기술적 과제들은 이상에서 언급한 사항들로 제한되지 않으며, 언급하"}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "지 않은 또 다른 기술적 과제들은 이하 설명할 본 개시의 다양한 예들로부터 당해 기술분야에서 통상의 지식을 가진 자에 의해 고려될 수 있다."}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 양상으로, 적어도 하나의 프로세서(processor); 및 상기 적어도 하나의 프로세서에 동작 가능하게 연결되어 상기 적어도 하나의 프로세서가 동작들을 수행하도록 하는 적어도 하나의 명령어들(instructions)을 저장하는 적어도 하나의 메모리(memory)를 포함하고, 상기 동작들은, 상기 적어도 하나의 메모리에 저장된 입력 데이터에 대하여 레이블(label)을 예측하는 인공 지능(artificial intelligence) 모델의 학습 동작을 수행하고, 상기 학습 동작은, 상기 입력 데이터에 대하여 미니-배치(mini-batch) - 여기서, 상기 미니-배치는 상기 입력 데이터에 포함된 B개의 하위 입력 데이터를 가지고, 상기 B는 자연수임 -; 단위로 순전파(forward propagation) 동작을 수행하여 상기 레이블에 대한 예측 신뢰도 값을 획득하고, 상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 예측 신뢰도 임계 값 이상인 하위 입력 데이터에 대하여만 역전파(backward propagation) 동작을 수행하여 상기 인공 지능 모델의 가중치에 대한 근사 가중치 그래디언트(gradient)를 획득하고, 상기 근사 가중치 그래디 언트에 기초하여 상기 가중치를 업데이트하는, 전자 장치이다. 상기 학습 동작은, 상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 상기 예측 신뢰도 임계 값 미만인 하위 입 력 데이터에 대하여 상기 역전파 동작을 생략할 수 있다. 상기 학습 동작은, 상기 예측 신뢰도 임계 값을 설정하는 예측 신뢰도 임계 값 설정 동작을 포함하고, 상기 예 측 신뢰도 임계 값 설정 동작은, (a) 임의 예측 신뢰도 임계 값 및 RSEskip - 상기 RSEskip는 상기 역전파 동작의 생략에 따른 가중치 그래디언트 오류 값임 -;을 초기화하는 동작, (b) 상기 임의 예측 신뢰도 임계 값을 특정 변동 값 단위로 감소시키고, 상기 임의 예측 신뢰도 임계 값이 상기 특정 변동 값 단위로 감소될 때마다 상기 RSEskip를 계산하는 동작, (c) 상기 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때까지 (b) 동작을 반복적으로 수행하는 동작, (d) 상기 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거 나 또는 최초로 초과할 때의 상기 임의 예측 신뢰도 임계 값을 상기 예측 신뢰도 임계 값으로 설정하는 동작을 포함할 수 있다. 상기 RSEskip는 기 설정된 스케일링 인자, 상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 상기 예측 신뢰도 임 계 값 이상인 하위 입력 데이터의 개수 및 상기 예측 신뢰도 값의 평균 절대 그래디언트의 곱으로 정의될 수 있다. 상기 평균 절대 그래디언트는 상기 예측 신뢰도 값의 전체 신뢰도 구간에 대한 선형 보간법에 기초하여 정의될 수 있다. 본 개시의 다른 일 양상으로, 전자 장치에 의해 수행되는 적어도 하나의 메모리에 저장된 입력 데이터에 대하여 레이블(label)을 예측하는 인공 지능(artificial intelligence) 모델의 학습 방법으로서, 상기 입력 데이터에 대하여 미니-배치(mini-batch) - 여기서, 상기 미니-배치는 상기 입력 데이터에 포함된 B개의 하위 입력 데이터 를 가지고, 상기 B는 자연수임 -; 단위로 순전파(forward propagation) 동작을 수행하여 상기 레이블에 대한 예 측 신뢰도 값을 획득하는 단계; 상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 예측 신뢰도 임계 값 이상인 하위 입력 데이터에 대하여만 역전파(backward propagation) 동작을 수행하여 상기 인공 지능 모델의 가중치에 대한 근사 가중치 그래디언트(gradient)를 획득하는 단계; 및 상기 근사 가중치 그래디언트에 기초하여 상기 가 중치를 업데이트하는 단계를 포함하는, 학습 방법이다. 상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 상기 예측 신뢰도 임계 값 미만인 하위 입력 데이터에 대한 상기 역전파 동작은 생략될 수 있다. 상기 예측 신뢰도 임계 값을 설정하는 예측 신뢰도 임계 값을 설정 단계를 더 포함하고, 상기 예측 신뢰도 임계 값 설정 단계는: (a) 임의 예측 신뢰도 임계 값 및 RSEskip - 상기 RSEskip는 상기 역전파 동작의 생략에 따른 가 중치 그래디언트 오류 값임 -;을 초기화하는 단계; (b) 상기 임의 예측 신뢰도 임계 값을 특정 변동 값 단위로 감소시키고, 상기 임의 예측 신뢰도 임계 값이 상기 특정 변동 값 단위로 감소될 때마다 상기 RSEskip를 계산하는 단계; (c) 상기 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때까지 (b) 동작 을 반복적으로 수행하는 단계; 및 (d) 상기 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초 로 초과할 때의 상기 임의 예측 신뢰도 임계 값을 상기 예측 신뢰도 임계 값으로 설정하는 단계를 포함할 수 있 다. 상기 RSEskip는 기 설정된 스케일링 인자, 상기 하위 입력 데이터 중 상기 예측 신뢰도 값이 상기 예측 신뢰도 임 계 값 이상인 하위 입력 데이터의 개수 및 상기 예측 신뢰도 값의 평균 절대 그래디언트의 곱으로 정의될 수 있 다. 상기 평균 절대 그래디언트는 상기 예측 신뢰도 값의 전체 신뢰도 구간에 대한 선형 보간법에 기초하여 정의될 수 있다. 상술한 본 개시의 다양한 예들은 본 개시의 바람직한 예들 중 일부에 불과하며, 본 개시의 다양한 예들의 기술"}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "적 특징들이 반영된 여러 가지 예들이 당해 기술분야의 통상적인 지식을 가진 자에 의해 이하 상술할 상세한 설 명을 기반으로 도출되고 이해될 수 있다."}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 예들에 따르면 다음과 같은 효과가 있다. 본 개시의 다양한 예들에 따르면, 미니 배치 경사 하강법을 통한 학습이 노이즈를 허용하는 특성을 활용하여, 사용자가 설정한 허용 가능 노이즈 범위 내에서 연산 생략에 따른 오류가 작은(즉, 예측 신뢰도가 높은) 이미지 에 대한 가중치 변화량 연산을 생략하여 전체 학습 연산량을 줄이고 학습 에너지를 절감하여 학습에 대한 영향 을 최소화할 수 있다. 또한, 동적 예측 신뢰도 임계값 선택을 통해 가중치 변화량의 생략 정도를 사용자가 조절할 수 있다. 본 개시의 다양한 예들로부터 얻을 수 있는 효과들은 이상에서 언급된 효과들로 제한되지 않으며, 언급되지 않"}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "은 또 다른 효과들은 이하의 상세한 설명을 기반으로 당해 기술분야에서 통상의 지식을 가진 자에게 명확하게 도출되고 이해될 수 있다."}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 구현들을 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 구현을 설명하고자 하는 것이며, 본 발명이 실시될 수 있는 유일한 구현 형 태를 나타내고자 하는 것이 아니다. 이하의 상세한 설명은 본 발명의 완전한 이해를 제공하기 위해서 구체적 세 부사항을 포함한다. 그러나 당업자는 본 개시가 이러한 구체적 세부사항 없이도 실시될 수 있음을 안다. 몇몇 경우, 본 개시의 개념이 모호해지는 것을 피하기 위하여 공지의 구조 및 장치는 생략되거나, 각 구조 및 장치의 핵심기능을 중심으로 한 블록도 형식으로 도시될 수 있다. 또한, 본 개시 전체에서 동일한 구성요소에 대해서는 동일한 도면 부호를 사용하여 설명한다. 본 발명의 개념에 따른 다양한 예들은 다양한 변경들을 가할 수 있고 여러 가지 형태들을 가질 수 있으므로 다 양한 예들을 도면에 예시하고 본 개시에 상세하게 설명하고자 한다. 그러나 이는 본 발명의 개념에 따른 다양한 예들을 특정한 개시 형태들에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 변경, 균 등물, 또는 대체물을 포함한다. 제1 또는 제2 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들 에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만, 예를 들어 본 발명의 개념에 따른 권리 범위로부터 이탈되지 않은 채, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성요소들 간의 관 계를 설명하는 표현들, 예를 들어 \"~사이에\"와 \"바로~사이에\" 또는 \"~에 직접 이웃하는\" 등도 마찬가지로 해석 되어야 한다. 본 개시의 다양한 예에서, “/” 및 “,”는 “및/또는”을 나타내는 것으로 해석되어야 한다. 예를 들어, “ A/B”는 “A 및/또는 B”를 의미할 수 있다. 나아가, “A, B”는 “A 및/또는 B”를 의미할 수 있다. 나아가, “A/B/C”는 “A, B 및/또는 C 중 적어도 어느 하나”를 의미할 수 있다. 나아가, “A, B, C”는 “A, B 및/또 는 C 중 적어도 어느 하나”를 의미할 수 있다. 본 개시의 다양한 예에서, “또는”은 “및/또는”을 나타내는 것으로 해석되어야 한다. 예를 들어, “A 또는 B ”는 “오직 A”, “오직 B”, 및/또는 “A 및 B 모두”를 포함할 수 있다. 다시 말해, “또는”은 “부가적으 로 또는 대안적으로”를 나타내는 것으로 해석되어야 한다. 본 개시의 다양한 예에서, \"...부\", \"...기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단 위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다.본 개시에서 사용한 용어는 단지 특정한 다양한 예들을 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의 도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함으로 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적 으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 개시에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미 로 해석되지 않는다. 이하, 본 개시의 다양한 예들을 첨부된 도면을 참조하여 상세하게 설명한다. 전자 장치 본 개시에서, 전자 장치는 입력 데이터에 대하여 레이블(label)을 예측하는 인공 지능(artificial intelligence) 모델의 학습 동작을 수행하기 위한 것일 수 있다. 본 개시에서는 편의상 인공 지능 모델의 예로 심층 학습이나 딥러닝으로 칭해지는 DNN(deep structured learning)을 설명하나, 인공 지능 모델은 이에 한정되 지 않고 다양한 기계 학습(machine learning) 모델일 수 있다. 도 1은 본 개시의 일 예에 따른 전자 장치의 블록도이다. 도 1을 참조하면, 본 개시의 일 예에 따른 전자 장치는 입/출력 장치, 송수신기, 프로세서 및 메모리를 포함할 수 있다. 여기서, 입/출력 장치 및/또는 송수신기는 전자 장치의 구현 방식에 따라 생략될 수도 있을 것이다. 입/출력 장치는 전자 장치의 사용자로부터 사용자 입력을 받거나 또는 사용자에게 정보를 출력하기 위한 각종 인터페이스, 보조 장치나 연결 포트 등일 수 있다. 예를 들어, 본 개시에서 사용자의 입력은 입력 데 이터일 수 있고, 사용자에게 출력되는 정보는 입력 데이터에 따른 출력 데이터 및/또는 인공 지능 모델일 수 있 다. 입/출력 장치는 입력 장치 및 출력 장치를 포함할 수 있다. 입력 장치는 사용자 입력을 감지하거나 입 력받기 위한 다양한 형태의 입력 수단을 포함하는 포괄적인 개념일 수 있다. 출력 장치는 사용자의 입력에 따른 각종 데이터를 사용자에게 제공하기 위한 다양한 형태의 출력 수단을 포함하는 포괄적인 개념일 수 있다. 송수신기는 프로세서와 연결될 수 있고, 유/무선 신호를 송신 및/또는 수신할 수 있다. 예를 들어, 송수신기는 무선 통신망을 통해 각종 사용자 단말과 연결될 수 있다. 여기서, 유/무선 신호는 입력 데이터, 입력 데이터에 따른 출력 데이터 및/또는 인공 지능 모델일 수 있고, 사용자 단말은 입력 데이터를 제 공하는 단말 및 입력 데이터에 따른 출력 데이터를 제공받는 단말 중 적어도 하나를 포함할 수 있다. 여기서, 무선 통신망은 이동 통신망, 무선 LAN, 근거리 무선 통신망 등을 포함할 수 있다. 예를 들어, 무선 통신망은 LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있다. 예를 들어, 무선 통신망은 WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE), 지그비 (Zigbee), NFC(near field communication), 또는 라디오 프리퀀시(RF) 중 적어도 하나를 포함할 수 있다. 송수신기는 송신기 및 수신기를 포함할 수 있다. 송수신기는 RF(radio frequency) 유닛과 혼용될 수 있다. 송수신기는 프로세서의 제어를 통해 사용자 단말과 다양한 신호를 송수신할 수 있다. 프로세서는 입/출력 장치, 메모리 및/또는 송수신기를 제어하며, 본 개시의 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 구현하도록 구성될 수 있다. 예를 들어, 프로세서는 입/출력 장치를 통해 입력 데이터를 입력받고, 입력 데이터를 메모리에 저장할 수 있다. 또한, 프로세서(13 0)는 입력 데이터에 따른 인공 지능 모델을 학습시키고, 학습된 인공 지능 모델을 메모리에 저장할 수 있 다. 또한, 프로세서는 송수신기를 통해 무선 신호를 수신하고, 무선 신호에 포함된 정보를 메모리 에 저장할 수 있다. 또한, 프로세서는 메모리에 저장된 정보를 처리하여 무선 신호를 생성한 뒤, 생성한 무선 신호를 송수신기를 통해 전송할 수 있다. 메모리는 프로세서와 연결될 수 있고, 프로세서의 동작과 관련한 다양한 정보를 저장할 수 있다. 예를 들어, 메모리는 프로세서에 의해 제어되는 프로세스들 중 일부 또는 전부를 수행하거나,본 개시의 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 수행하기 위한 명령어들(instructions)을 포 함하는 소프트웨어 코드를 저장할 수 있다. 또한, 메모리는 입/출력 장치로부터의 입력 데이터를 전 달받아, 입력 데이터를 저장할 수 있다. 이하에서는, 전자 장치의 다양한 동작 예들에 대하여 설명한다. 하기 다양한 동작 예들은 상술한 적어도 하나의 프로세서의 동작에 포함되는 것일 수 있다. 도 2는 본 개시의 일 예에 따른 전자 장치에 포함되는 모듈들의 블록도이고, 도 3은 본 개시의 일 예에 따른 전 자 장치에 포함되는 모듈들에 의해 수행되는 동작을 설명하기 위한 개념도이다. 도 2에 도시된 복수의 모듈들은 전자 장치의 물리적 구성(예, 프로세서 및 메모리 등)이 지정된 동작을 수행할 수 있도록 구현된 컴퓨터 코드 내지는 하나 이상의 명령어들일 수 있다. 즉, 복수의 모듈들은 컴 퓨터 코드 형태로 메모리에 저장된 기능적 구성일 수 있고, 실행될 경우 프로세서가 지정된 동작을 수행할 수 있다. 다시 말해서, 도 2의 복수의 모듈들에 의해 수행되는 다양한 동작들은 프로세서에 의해 수행되는 동작일 수 있다. 도 2를 참조하면, 전자 장치는 연산 모듈, 가중치 업데이트 모듈, 제어 모듈 및 임계값 선 택 모듈을 포함한다. 연산 모듈은 입력 데이터에 대하여 레이블을 예측하는 인공 지능 모델의 학습 동작을 수행하기 위하여, 순 전파(forward propagation) 동작 및 역전파(backward propagation) 동작을 수행할 수 있다. 도 3을 참조하면, 순전파 동작은 인공 지능 모델의 입력 데이터가 입력되는 입력층부터 출력층까지 순서대로 변 수들을 계산하고 저장하는 동작을 의미할 수 있다. 예를 들어, 인공 지능 모델에 복수의 레이어(layer)가 포함 될 때, 순전파 동작은 각 레이어 별로 제1 컨볼루션 연산( )을 수행할 수 있다. 여기서, Ain은 입력 활성화, Aout은 출력 활성화, W는 가중치를 의미한다. 순전파 동작에 따라, 입력 데이터에 대한 예측 신뢰도 값 및 손실 값이 산출될 수 있다. 예를 들어, 예측 신뢰 도 값은 각 레이블 별로 산출될 수 있고, 손실 값은 예측 신뢰도 값 및 진실 값(ground truth)에 기초하여 산출 될 수 있다. 역전파 동작은 인공 지능 모델의 파라미터들에 대하여 손실을 역으로 전파하면서 그래디언트(gradient)를 계산 하는 동작을 의미할 수 있다. 예를 들어, 역전파 동작은 각 레이어 별로 제2 컨볼루션 연산 ( )을 수행할 수 있다. 여기서, Lin은 입력 손실 그래디언트이고, Lout은 출력 손실 그래 디언트를 의미할 수 있다. 한편, 도 3에서는 각 레이어 별로 제3 컨볼루션 연산( )이 가중치 업데이트 모듈에 의해 수행되는 것으로 도시되어 있으나, 제3 컨볼루션 연산은 역전파 동작에서 수행될 수도 있다. 여기서, WG는 가중치 그래디언트일 수 있다. 연산 모듈은 상술한 순전파 동작 및/또는 역전파 동작을 입력 데이터에 대하여 미니-배치(mini-batch) 단 위로 수행할 수 있다. 여기서, 미니-배치는 입력 데이터에 포함된 B개의 하위 입력 데이터를 가지는 단위이고, B는 배치 크기로서 자연수(예, 2의 승수 등)일 수 있다. 예를 들어, 연산 모듈은 미니-배치 단위로 순전파 동작을 수행하여 레이블에 대한 예측 신뢰도 값을 획득 할 수 있다. 연산 모듈은 미니-배치의 하위 입력 데이터의 예측 신뢰도 값과 예측 신뢰도 임계 값을 비교할 수 있다. 비교 결과에 따라, 연산 모듈은 하위 입력 데이터 중 예측 신뢰도 값이 예측 신뢰도 임계 값 이상인 하위 입력 데이터에 대하여만 역전파 동작을 수행할 수 있다. 다시 말해서, 연산 모듈은 하위 입력 데이터 중 예측 신뢰도 값이 예측 신뢰도 임계 값 미만인 하위 입력 데이터에 대하여는 역전파 동작을 생략할 수 있다. 본 개시에서, 역전파 동작이 일부 하위 입력 데이터에 대하여 생략될 때 획득되는 가중치 그래디언트는 근사 가중 치 그래디언트로 칭해질 수 있다. 즉, 연산 모듈은 예측 신뢰도 값과 예측 신뢰도 임계 값 비교에 따라 역 전파 동작을 일부 하위 입력 데이터에 대하여 생략하고, 인공 지능 모델의 가중치에 대한 근사 가중치 그래디언 트를 획득할 수 있다.가중치 업데이트 모듈은 연산 모듈로부터 획득된 가중치 그래디언트 또는 근사 가중치 그래디언트에 기초하여 가중치를 업데이트할 수 있다. 예를 들어, 일부 하위 입력 데이터에 대하여 역전파 동작이 생략되지 않는 경우, 가중치 그래디언트에 기초하여 가중치를 업데이트하고, 역전파 동작이 생략되는 경우 근사 가중치 그래디언트에 기초하여 가중치를 업데이트할 수 있다. 가중치 업데이트 모듈은 SGD(stochastic gradient descent) 알고리즘에 기초하여 가중치를 업데이트할 수 있다. 예를 들어, 가중치 업데이트 모듈은 가중치 그래디언트 또는 근사 가중치 그래디언트에 학습률을 곱 한 값을 기존의 가중치에서 빼는 연산을 통해 가중치를 업데이트할 수 있다. 가중치 업데이트 모듈은 가중치 업데이트를 통해 후술할 평균 절대 그래디언트 산출에 사용되는 Ghigh 및 Glow를 획득할 수 있다. 여기서, Ghigh는 가장 높은 신뢰도 구간에서의 가중치 그래디언트의 절대값의 누적, Glow는 가장 낮은 신뢰도 구간에서의 가중치 그래디언트의 절대값의 누적이다. 이때, 가중치 업데이트 모듈은 높 은 신뢰도 구간의 가중치 그래디언트의 절대값 누적 연산의 연산 결과가 전체 학습 과정에서 일정한 것을 이용 하여, 최초 에포크 구간에서만 Ghigh를 획득하고, 나머지 에포크 구간에서는 Ghigh 연산을 생략할 수 있다. 제어 모듈은 연산 모듈 및 가중치 업데이트 모듈에 사용되는 다양한 파라미터들, 예를 들어 배 치 크기, 예측 신뢰도 값에 대한 예측 신뢰도 구간, 오류 경계 값 및 에포크(epoch) 중 적어도 하나를 설정하거 나, 상기 파라미터들을 통해 연산 모듈 및 가중치 업데이트 모듈을 제어할 수 있다. 여기서, 에포크 는 가중치 업데이트 주기이다. 임계값 선택 모듈은 역전파 동작의 생략 기준이 되는 예측 신뢰도 임계 값을 동적으로 설정한다. 이하에서 는, 도 4 및 도 5를 참조하여 임계값 선택 모듈의 동작에 대하여 상세히 설명한다. 도 4는 본 개시의 일 예에 따른 임계값 선택 모듈의 블록도이다. 도 4를 참조하면, 본 개시의 일 예에 따른 임계값 선택 모듈은 CF 누적 모듈, 선형 보간 모듈 및 임계값 결정 모듈을 포함한다. CF 누적 모듈은 예측 신뢰도 값에 기초하여, 신뢰도 구간에 대한 신뢰도 분포를 누적한다. 예를 들어, 신 뢰도 분포는 입력 데이터에 대한 모든 에포크에 대하여 신뢰도 구간 별로 누적될 수 있다. 선형 보간 모듈은 선형 보간법에 기초하여 평균 절대 그래디언트를 산출할 수 있다. 가중치 그래디언의 절 대값은 신뢰도 구간 별로 누적될 때 선형적 특성을 갖는다. 선형 보간 모듈은 가중치 그래디언트의 절대값 의 선형적 특성을 이용하여, 가장 낮은 신뢰도 구간 및 가장 높은 신뢰도 구간에서의 가중치 그래디언트의 절대 값의 누적만을 사용하여 평균 절대 그래디언트를 산출할 수 있다. 예를 들어, 선형 보간 모듈은 에 기초하여 평균 절대 그래디언트를 산출할 수 있다. 여기서, Ghigh는 가장 높은 신뢰도 구간에서의 가중치 그래디언트의 절대값의 누적, Glow는 가장 낮은 신뢰도 구간에서의 가중치 그래디언트의 절대값의 누적, N은 신뢰도 구간의 개수, Th는 예측 신뢰도 임계 값일 수 있다. 임계값 결정 모듈은 신뢰도 분포의 누적 및 평균 절대 그래디언트에 기초하여 임계값을 동적으로 결정한다. 구체적으로, 임계값 결정 모듈은 임의 예측 신뢰도 임계 값 및 RSEskip을 초기화한다. 여기서, RSEskip는 역 전파 동작의 생략에 따른 가중치 그래디언트 오류 값으로서, 기 설정된 스케일링 인자, 하위 입력 데이터 중 예 측 신뢰도 값이 예측 신뢰도 임계 값 이상인 하위 입력 데이터의 개수 및 예측 신뢰도 값의 평균 절대 그래디언 트의 곱으로 정의될 수 있다. 여기서, 하위 입력 데이터 중 예측 신뢰도 값이 예측 신뢰도 임계 값 이상인 하위 입력 데이터의 개수 는 에 의해 정의될 수 있으며, CF(k)는 신뢰도 분포의 누적일 수 있다. 임계값 결정 모듈은 임의 예측 신뢰도 임계 값을 특정 변동 값 단위로 감소시키고, 임의 예측 신뢰도 임계 값이 특정 변동 값 단위로 감소될 때마다 RSEskip를 계산한다. 여기서, 특정 변동 값은 미리 설정된 값일 수 있다.임계값 결정 모듈은 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때까지 임의 예측 신뢰도 임계 값을 특정 변동 값 단위로 감소시키고, 임의 예측 신뢰도 임계 값이 특정 변동 값 단위 로 감소될 때마다 RSEskip를 계산하는 동작을 반복적으로 수행할 수 있다. 임계값 결정 모듈은 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때의 임 의 예측 신뢰도 임계 값을 최종적으로 예측 신뢰도 임계 값으로 설정한다. 도 5는 본 개시의 일 예에 따른 임계값 선택 모듈에 의해 수행되는 동작을 설명하기 위한 개념도이다. 도 5를 참조하면, CF 누적 모듈에 의해 신뢰도 분포가 신뢰도 구간(예, 0 내지 9)에 대하여 누적될 수 있 다. 이때, 각 신뢰도 구간은 신뢰도 구간의 개수에 따른 범위를 가질 수 있다. 누적된 신뢰도 분포에 기초하여, 임계값 결정 모듈에 의해 RSEskip이 기 설정된 오류 경계 값과 동일해지거 나 초과하는지 여부가 판단될 수 있다. 예를 들어, 예측 신뢰도 임계 값이 0.9인 경우, 0.9 이상인 신뢰도 분포 누적에 대하여 RSEskip가 계산되고, 계산된 RSEskip가 기 설정된 오류 경계 값과 동일해지거나 초과하는지 여부가 판단될 수 있다. 이때, RSEskip 획득에 사용되는 평균 절대 그래디언트는 선형 보간 모듈에 의해 획득될 수 있다. 예를 들어, 선형 보간 모듈은 전체 신뢰도 구간(예, 0 내지 9)에 대하여 선형 보간법을 적용하여 평균 절대 그 래디언트를 획득할 수 있다. 상술한 본 개시의 전자 장치에 따르면, 예측 신뢰도 값이 예측 신뢰도 임계 값 보다 큰 경우, 역전파 연산 (및/또는 가중치 업데이트)을 통해 얻는 가중치 그래디언트가 학습에 유의미한 기여를 하지 못한다고 판단하여, 역전파 연산(및/도는 가중치 업데이트)을 생략하여 학습 시간과 학습 에너지가 절감될 수 있다. 또한, 예측 신 뢰도 임계 값은 허용 가능 노이즈 정도에 따라 동적으로 설정될 수 있다. 학습 방법 이하에서는, 본 개시의 다양한 예들에 따른 전자 장치에 의해 수행되는 학습 방법에 대하여 설명한다. 위 에서 설명한 부분과 중복되는 부분에 대한 상세한 설명은 생략한다. 도 6은 본 개시의 일 예에 따른 학습 방법의 흐름도이다. 도 6을 참조하면, S110에서, 전자 장치는 입력 데이터에 대하여 미니-배치(mini-batch) 단위로 순전파 (forward propagation) 동작을 수행하여 레이블에 대한 예측 신뢰도 값을 획득한다. 여기서, 미니-배치는 상기 입력 데이터에 포함된 B개의 하위 입력 데이터를 가지고, B는 자연수이다. S120에서, 전자 장치는 하위 입력 데이터 중 예측 신뢰도 값이 예측 신뢰도 임계 값 이상인 하위 입력 데 이터에 대하여만 역전파(backward propagation) 동작을 수행하여 인공 지능 모델의 가중치에 대한 근사 가중치 그래디언트(gradient)를 획득한다. 여기서, 하위 입력 데이터 중 예측 신뢰도 값이 예측 신뢰도 임계 값 미만인 하위 입력 데이터에 대한 역전파 동작은 생략될 수 있다. S130에서, 전자 장치는 근사 가중치 그래디언트에 기초하여 가중치를 업데이트한다. 도 7은 본 개시의 일 예에 따른 학습 방법에 포함되는 예측 신뢰도 임계값을 설정하는 방법의 흐름도이다. S210에서, 전자 장치는 임의 예측 신뢰도 임계 값 및 RSEskip을 초기화한다. 여기서, RSEskip는 역전파 동작 의 생략에 따른 가중치 그래디언트 오류 값으로서, 기 설정된 스케일링 인자, 하위 입력 데이터 중 예측 신뢰도 값이 예측 신뢰도 임계 값 이상인 하위 입력 데이터의 개수 및 예측 신뢰도 값의 평균 절대 그래디언트의 곱으 로 정의될 수 있다. 여기서, 평균 절대 그래디언트는 예측 신뢰도 값의 전체 신뢰도 구간에 대한 선형 보간법에 기초하여 정의될 수 있다. S220에서, 전자 장치는 임의 예측 신뢰도 임계 값을 특정 변동 값 단위로 감소시키고, 임의 예측 신뢰도 임계 값이 특정 변동 값 단위로 감소될 때마다 RSEskip를 계산한다. S230에서, 전자 장치는 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과하는지 여부를 판단하고, RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과하지 못하는 경우,RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때까지 S220을 반복할 수 있다. S240에서, 전자 장치는 RSEskip가 기 설정된 오류 경계 값과 최초로 동일해지거나 또는 최초로 초과할 때의 임의 예측 신뢰도 임계 값을 예측 신뢰도 임계 값으로 설정한다. 실험예 이하에서는, 상술한 본 개시의 다양한 예들에서 사용되는 파라미터들에 대한 실험예에 대하여 설명한다. 도 8은 본 개시의 일 예에 따른 예측 신뢰도 값과 가중치 그래디언트의 절대값의 관계를 도시한 그래프이고, 도 9는 본 개시의 일 예에 따른 평균 예측 신뢰도 값과 에포크의 관계를 도시한 그래프이다. 도 8 및 도 9를 참조하면, 가중치 그래디언트의 절대값은 배치 크기나 에포크와 관계없이 예측 신뢰도 값이 증 가할수록 선형적으로 감소하고, 평균 예측 신뢰도 값은 입력 데이터의 종류(CIFAR)와 관계없이 에포크가 증가할 수록 증가한다. 이때, 가중치 그래디언트의 절대값은 예측 신뢰도 값이 높을 경우 거의 발생하지 않는다. 이에 따라, 상술한 가중치 업데이트 모듈은 높은 신뢰도 구간의 가중치 그래디언트의 절대값 누적 연산의 연산 결과가 전체 학습 과정에서 일정한 것을 이용하여, 최초 에포크 구간에서만 Ghigh를 획득하고, 나머지 에포크 구 간에서는 Ghigh 연산을 생략할 수 있다. 상술한 설명에서 제안 방식에 대한 일례들 또한 본 개시의 구현 방법들 중 하나로 포함될 수 있으므로, 일종의 제안 방식들로 간주될 수 있음은 명백한 사실이다. 또한, 상기 설명한 제안 방식들은 독립적으로 구현될 수 도 있지만, 일부 제안 방식들의 조합 (혹은 병합) 형태로 구현될 수 도 있다."}
{"patent_id": "10-2021-0063139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상술한 바와 같이 개시된 본 개시의 예들은 본 개시와 관련된 기술분야의 통상의 기술자가 본 개시를 구현하고 실시할 수 있도록 제공되었다. 상기에서는 본 개시의 예들을 참조하여 설명하였지만, 해당 기술 분야의 통상의 기술자는 본 개시의 예들을 다양하게 수정 및 변경시킬 수 있다. 따라서, 본 개시는 여기에 기재된 예들에 제한 되려는 것이 아니라, 여기서 개시된 원리들 및 신규한 특징들과 일치하는 최광의 범위를 부여하려는 것이다."}
{"patent_id": "10-2021-0063139", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하에 첨부되는 도면들은 본 개시의 다양한 예들에 관한 이해를 돕기 위한 것으로, 상세한 설명과 함께 본 개 시의 다양한 예들을 제공한다. 다만, 본 개시의 다양한 예들의 기술적 특징이 특정 도면에 한정되는 것은 아니 며, 각 도면에서 개시하는 특징들은 서로 조합되어 새로운 실시예로 구성될 수 있다. 각 도면에서의 참조 번호(reference numerals) 들은 구조적 구성요소 (structural elements) 를 의미한다. 도 1은 본 개시의 일 예에 따른 전자 장치의 블록도이다. 도 2는 본 개시의 일 예에 따른 전자 장치에 포함되는 모듈들의 블록도이다. 도 3은 본 개시의 일 예에 따른 전자 장치에 포함되는 모듈들에 의해 수행되는 동작을 설명하기 위한 개념도이 다. 도 4는 본 개시의 일 예에 따른 임계값 선택 모듈의 블록도이다. 도 5는 본 개시의 일 예에 따른 임계값 선택 모듈에 의해 수행되는 동작을 설명하기 위한 개념도이다. 도 6은 본 개시의 일 예에 따른 학습 방법의 흐름도이다. 도 7은 본 개시의 일 예에 따른 학습 방법에 포함되는 예측 신뢰도 임계값을 설정하는 방법의 흐름도이다. 도 8은 본 개시의 일 예에 따른 예측 신뢰도 값과 가중치 그래디언트의 절대값의 관계를 도시한 그래프이다. 도 9는 본 개시의 일 예에 따른 평균 예측 신뢰도 값과 에포크의 관계를 도시한 그래프이다."}
