{"patent_id": "10-2023-0130766", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0046821", "출원번호": "10-2023-0130766", "발명의 명칭": "만성 질환 환자를 모니터링하는 방법 및 장치", "출원인": "(의) 삼성의료재단", "발명자": "강재헌"}}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서,(S3) 단계에서, 상기 미션 결정 시, 상기 사용자와 유사한 특성을 갖는 다른 사용자들의 미션 달성률을 함께 고려하여 미션을 결정하는 것을 포함하고,상기 사용자와 다른 사용자의 유사한 특성을 갖는지 여부는 인구 통계학적 요인, 신체적 요인 및 포괄 평가 데이터를 기반으로 판단하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 복수개의 건강 지표들 중 상기 사용자의 관리 의지 수준이 임계 수준을 초과하는 건강 지표에 대해 칭찬독려 메시지를 송신하는 단계를 더 포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 설문 데이터는 상기 복수개의 건강 지표들 중 적어도 하나의 건강 지표에 대한 상기 사용자의 관리 의지수준을 확인할 수 있는 설문에 대한 상기 사용자의 답변을 포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,(S3) 단계 이전에, 상기 포괄 평가 데이터를 기반으로 상기 사용자의 건강 관리 목표를 설정하는 단계를 더 포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 미션은 상기 건강 관리 목표의 달성을 위한 세부 목표를 포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,(S3) 단계는 상기 건강 관리 목표의 달성을 위한 복수개의 미션 메시지들을 미션의 난이도가 증가하는 경향으로순차적으로 송신하는 것을 포함하는, 서버의 동작 방법.공개특허 10-2025-0046821-3-청구항 7"}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,(S2) 단계는, 상기 포괄 평가 데이터를 기반으로 복수개의 건강 지표들 중 상기 사용자의 관리가 필요한 모니터링 지표들을결정하는 단계; 및 상기 포괄 평가 데이터를 기반으로 상기 모니터링 지표들 중 적어도 하나에 대한 사용자의 관리 의지 수준을 결정하는 단계;를 포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 모니터링 지표들 중 적어도 하나와 관련된 기본 정보를 포함하는 건강 정보 메시지를 송신하는 단계를 더포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서,상기 모니터링 지표들에 대해 상기 사용자가 자가 측정한 지표 데이터를 수신하는 단계; 및 상기 지표 데이터에대한 분석 결과를 포함하는 지표 기반 메시지를 송신하는 단계;를 더 포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 8에 있어서,상기 모니터링 지표들에 대해 상기 사용자가 자가 측정한 지표 데이터를 수신하는 단계; 및상기 지표 데이터가 기설정된 위험 수치에 해당하면, 위험 상황 정보 및 대처 방안 중 적어도 하나를 포함하는위험 관리 메시지를 송신하는 단계;를 더 포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,상기 미션에 대한 피드백을 수신하는 단계;상기 피드백을 기반으로 상기 미션의 달성 여부를 판단하는 단계; 및공개특허 10-2025-0046821-4-상기 미션이 달성되었으면, 상기 사용자에게 보상을 제공하는 단계를 더 포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,상기 미션이 달성되지 않은 경우 상기 사용자에게 상기 미션보다 낮은 난이도를 갖는 미션을 제공하는 단계를더 포함하는, 서버의 동작 방법."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "만성 질환 환자를 모니터링하기 위한 서버에 있어서,통신부;메모리; 및상기 통신부 및 상기 메모리와 연결된 프로세서를 포함하고,상기 프로세서는,신체 계측 데이터, 임상 검사 데이터 및 설문 데이터 중 적어도 하나를 포함하는 사용자에 대한 포괄 평가 데이터를 획득하고,상기 포괄 평가 데이터를 기반으로 복수개의 건강 지표들 각각에 대한 사용자의 관리 의지 수준을 결정하고,상기 복수개의 건강 지표들 중 상기 사용자의 관리 의지 수준이 임계 수준 이하인 적어도 하나의 건강 지표와관련된 미션을 포함하는 미션 메시지를 송신하도록 제어하는, 서버."}
{"patent_id": "10-2023-0130766", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "프로세서에 의해 동작되면 청구항 1에 따른 방법을 실행하도록 기록 매체에 저장된 어플리케이션 프로그램."}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 예시적인 실시예들에 따르면, 신체 계측 데이터, 임상 검사 데이터 및 설문 데이터 중 적어도 하나를 포함하는 사용자에 대한 포괄 평가 데이터를 획득하는 단계; 상기 포괄 평가 데이터를 기반으로 복수개의 건강 지표들 각각에 대한 사용자의 관리 의지 수준을 결정하는 단계; 및 상기 복수개의 건강 지표들 중 상기 사용자의 관리 의지 수준이 임계 수준 이하인 적어도 하나의 건강 지표와 관련된 미션을 포함하는 미션 메시지를 송신하는 단계를 포함하는, 만성 질환 환자를 모니터링하기 위한 서버의 동작 방법이 제공될 수 있다."}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 만성 질환 환자를 모니터링하기 위한 방법 및 장치에 관한 것이다. 본 발명은 ICT(information and communication technologies)를 기반으로 하는 만성 질환 환자를 모니터링하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "만성 질환은 오래 지속되거나 차도가 늦은 건강 상태나 질병을 의미한다. 예를 들어, 심장병, 뇌졸중,관절염, 만성호흡기병, 암, 비만, 당뇨병 등이 만성 질환에 속한다. 만성은 버릇이 되다시피 하여 쉽게 고쳐지지 아니하 는 상태나 성질을 의미하며, 특히 의학에서는 병이 급하거나 심하지도 아니하면서 쉽게 낫지도 아니하는 성질의 병명을 지칭하기도 한다. 고령화 사회로 진입함에 따라 만성 질환 환자의 수가 증가하는 추세이다. 최근 우리나라에서 뇌혈관질환, 심장 질환, 당뇨병 등과 같은 만성 질환으로 인한 사망률이 상당하다. 만성 질환은 지속적인 관리 및 치료가 필요하 다. 따라서, 만성 질환에 대한 지속적인 관리 및 치료를 제공할 수 있는 서비스의 제공이 필요하다. 예를 들면, 한국 등록특허공보 제10-2248751호, 한국 등록특허공보 제10-2400740호, 한국 공개특허공보 제10- 2013-0135677호, 한국 공개특허공보 제10-2019-0118774호 및 한국 공개특허공보 제10-2009-0003091호는 사용자 의 건강 관리(예를 들면, 만성 질환 관리 등)를 지원하기 위한 방법 및 시스템을 개시하고 있다.건강 관리는 무엇보다도 사용자의 관리 의지 및 실천이 중요하다. 그러나, 위 문헌들은 단순히 사용자의 건강 정보의 제공에 초점을 맞추고 있을 뿐이어서, 사용자의 건강 관리를 돕는 효과가 다소 미비하다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허공보 제10-2248751호 (특허문헌 0002) 한국 등록특허공보 제10-2400740호 (특허문헌 0003) 한국 공개특허공보 제10-2013-0135677호 (특허문헌 0004) 한국 공개특허공보 제10-2019-0118774호 (특허문헌 0005) 한국 공개특허공보 제10-2009-0003091호"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 과제는 사용자(예를 들면, 만성 질환 환자)의 건강 관리 의지, 건강 개선 의지 등을 반영한 건강 관리 방법 및 장치를 제공하는 것이다. 본 발명의 일 과제는 향상된 건강 관리 기능을 갖는 건강 관리 방법 및 장치를 제공하는 것이다."}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 예시적인 실시예들에 따른 만성 질환 환자를 모니터링하기 위한 서버의 동작 방법은, (S1) 신체 계측 데이터, 임상 검사 데이터 및 설문 데이터 중 적어도 하나를 포함하는 사용자에 대한 포괄 평가 데이터를 획득 하는 단계; (S2) 상기 포괄 평가 데이터를 기반으로 복수개의 건강 지표들 각각에 대한 사용자의 관리 의지 수 준을 결정하는 단계; 및 (S3) 상기 복수개의 건강 지표들 중 상기 사용자의 관리 의지 수준이 임계 수준 이하인 적어도 하나의 건강 지표와 관련된 미션을 포함하는 미션 메시지를 송신하는 단계;를 포함할 수 있다. 일 실시예에 있어서, 상기 서버의 동작 방법은 상기 복수개의 건강 지표들 중 상기 사용자의 관리 의지 수준이 임계 수준을 초과하는 건강 지표에 대해 칭찬 독려 메시지를 송신하는 단계를 더 포함할 수 있다. 일 실시예에 있어서, 상기 설문 데이터는 상기 복수개의 건강 지표들 중 적어도 하나의 건강 지표에 대한 상기 사용자의 관리 의지 수준을 확인할 수 있는 설문에 대한 상기 사용자의 답변을 포함할 수 있다. 일 실시예에 있어서, 상기 서버의 동작 방법은 상기 포괄 평가 데이터를 기반으로 상기 사용자의 건강 관리 목 표를 설정하는 단계를 더 포함할 수 있다. 일 실시예에 있어서, 상기 미션은 상기 건강 관리 목표의 달성을 위한 세부 목표를 포함할 수 있다. 일 실시예에 있어서, S3 단계는 상기 건강 관리 목표의 달성을 위한 복수개의 미션 메시지들을 미션의 난이도가 증가하는 경향으로 순차적으로 송신하는 것을 포함할 수 있다. 일 실시예에 있어서, (S3) 단계에서, 상기 미션 결정 시 상기 사용자와 유사한 특성을 갖는 다른 사용자들의 미 션 달성률을 함께 고려하여 미션을 결정하는 것을 포함할 수 있다. 상기 사용자와 다른 사용자의 유사한 특성을 갖는지 여부는 인구 통계학적 요인, 신체적 요인 및 포괄 평가 데이터를 기반으로 판단할 수 있다. 일 실시예에 있어서, (S2) 단계는, 상기 포괄 평가 데이터를 기반으로 복수개의 건강 지표들 중 상기 사용자의 관리가 필요한 모니터링 지표들을 결정하는 단계; 및 상기 포괄 평가 데이터를 기반으로 상기 모니터링 지표들 중 적어도 하나에 대한 사용자의 관리 의지 수준을 결정하는 단계;를 포함할 수 있다. 일 실시예에 있어서, 상기 서버의 동작 방법은 상기 모니터링 지표들 중 적어도 하나와 관련된 기본 정보를 포 함하는 건강 정보 메시지를 송신하는 단계를 더 포함할 수 있다. 일 실시예에 있어서, 상기 서버의 동작 방법은 상기 모니터링 지표들에 대해 상기 사용자가 자가 측정한 지표 데이터를 수신하는 단계; 및 상기 지표 데이터에 대한 분석 결과를 포함하는 지표 기반 메시지를 송신하는 단계;를 더 포함할 수 있다. 일 실시예에 있어서, 상기 서버의 동작 방법은 상기 모니터링 지표들에 대해 상기 사용자가 자가 측정한 지표 데이터를 수신하는 단계; 및 상기 지표 데이터가 기설정된 위험 수치에 해당하면, 위험 상황 정보 및 대처 방안 중 적어도 하나를 포함하는 위험 관리 메시지를 송신하는 단계;를 더 포함할 수 있다. 일 실시예에 있어서, 상기 서버의 동작 방법은 상기 미션에 대한 피드백을 수신하는 단계; 상기 피드백을 기반 으로 상기 미션의 달성 여부를 판단하는 단계; 및 상기 미션이 달성되었으면 상기 사용자에게 보상을 제공하는 단계를 더 포함할 수 있다. 일 실시예에 있어서, 상기 미션이 달성되지 않은 경우 상기 사용자에게 상기 미션보다 낮은 난이도를 갖는 미션 을 제공하는 단계를 더 포함할 수 있다. 본 발명의 예시적인 실시예들에 따른 만성 질환 환자를 모니터링하기 위한 서버는, 통신부; 메모리; 및 상기 통 신부 및 상기 메모리와 연결된 프로세서를 포함할 수 있다. 상기 프로세서는, 신체 계측 데이터, 임상 검사 데이터 및 설문 데이터 중 적어도 하나를 포함하는 사용자에 대 한 포괄 평가 데이터를 획득하고, 상기 포괄 평가 데이터를 기반으로 복수개의 건강 지표들 각각에 대한 사용자 의 관리 의지 수준을 결정하고, 상기 복수개의 건강 지표들 중 상기 사용자의 관리 의지 수준이 임계 수준 이하 인 적어도 하나의 건강 지표와 관련된 미션을 포함하는 미션 메시지를 송신하도록 제어할 수 있다. 본 발명의 예시적인 실시예들에 따르면, 프로세서에 의해 동작되면 상술한 방법을 실행하도록 기록 매체에 저장 된 어플리케이션 프로그램이 제공될 수 있다."}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 예시적인 실시예들에 따르면, 사용자(예를 들면, 만성 질환 환자 등)의 건강 관리 의지, 건강 개선 의지 등을 반영한 건강 관리 방법 및 장치를 제공할 수 있다. 본 발명의 예시적인 실시예들에 따르면, 향상된 건강 관리 기능을 갖는 건강 관리 방법 및 장치를 제공할 수 있 다."}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 다만, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있다. 본 발명의 실시예들을 명확히 설명하기 위해 설명과 관계없는 부분은 생략될 수 있다. 또한, 본 발명의 실시예 들을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지 또는 설명을 흐릴 수 있다고 판단되는 경우, 그에 대한 상세한 설명은 생략될 수 있다. 본 발명의 예시적인 실시예들의 구성 요소들을 설명함에 있어, \"제1\", \"제2\" 등의 용어가 사용될 수 있다. 상기 용어는 일 구성 요소를 다른 구성 요소와 구별하여 설명의 편의를 위한 것이며, 특별한 기재가 없는 한, 상기 용어에 의해 구성 요소들의 본질, 순서 등이 한정되는 것은 아니다. 또한, 상기 용어가 붙은 구성 요소들이 서 로 상이하다 단정되는 것도 아니다. 본 명세서에서 언급하는 각 단계들에 있어, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않은 이상 명기 된 순서와 다르게 진행될 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 수행될 수 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 본 명세서에서, \"및/또는\"은 나열된 구성 요소들 각각 및 상기 구성 요소들의 2 이상의 조합을 포함하는 의미일 수 있다. 예를 들면, \"및/또는\"은 \"적어도 하나\"와 동일한 의미일 수 있다. 본 명세서에서, \"A, B, C 등을 포함할 수 있다\"는 \"A, B 및 C 중 적어도 하나를 포함할 수 있다\"는 의미를 포함 하는 개념일 수 있다. 본 발명의 예시적인 실시예들에 따르면, 사용자(예를 들면, 만성 질환 환자)에 대한 모니터링을 위한 서비스 및 시스템이 제공될 수 있다. 본 발명의 예시적인 실시예들에 따른 모니터링 서비스 또는 시스템은 \"케어 크루 서 비스(또는 시스템)\"으로 지칭될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 만성 질환 환자 모니터링 시스템의 구조를 도시한다. 도 1을 참고하면, 만성 질환 환자 모니터링 시스템은 사용자 장치 및 서버를 포함할 수 있다. 사용자 장치는 사용자(예를 들면, 만성 질환 환자 등)가 이용하는 장치일 수 있다. 사용자 장치는 네 트워크를 통해 서버에 접속할 수 있으며, 서버와의 상호 작용할 수 있다. 사용자 장치는 서버 에 접속하고, 케어 크루 서비스를 이용할 수 있다. 예를 들면, 사용자 장치는 다양한 형태의 장치일 수 있으며, 예를 들어, 스마트폰, 노트북, 데스크탑 컴퓨터, 태블릿 PC 등의 전자 장치일 수 있다. 서버는 케어 크루 서비스를 제공하는 서비스 제공자의 장치일 수 있다. 서버는 사용자 장치와 네트워크를 통해 데이터를 송신 및 수신할 수 있다. 서버는 케어 크루 서비스를 위한(예를 들면, 사용자에 게 동기를 부여하기 위한) 다양한 시나리오 및 관련 메시지들을 관리하며, 사용자에게 다양한 메시지들을 송신 할 수 있다. 또한, 서버는 사용자의 신체에 대한 정보, 건강 상태에 대한 정보, 생활 습관에 대한 정보 등 을 수집하고, 이용할 수 있다. 도 1은 하나의 사용자 장치만을 도시하고 있으나, 사용자 장치를 포함하는 복수의 장치들이 서버 에 접속하여 케어 크루 서비스를 이용할 수 있다. 도 1과 같은 시스템의 구조는 일 예이며, 다른 구조가 본 발명에 적용될 수 있다. 도 1과 같은 서버-사용 자 장치의 관계는 플랫폼의 형태로 서비스가 제공되는 경우에 성립될 수 있다. 다른 일 예에서, 케어 크루 서비스가 플랫폼의 형태가 아닌 비-네트워크 기반의 프로그램의 형태로 제공될 수 있다. 이 경우, 도 1에 도시 된 바와 달리, 서버 없이 사용자 장치에 설치된 프로그램 또는 로컬 어플리케이션에 의해 케어 크루 서비스가 제공될 수 있다. 이 경우, 서버는 프로그램 또는 로컬 어플리케이션을 제공하는 주체일 수 있다. 도 2는 본 발명의 일 실시예에 따른 장치의 구조를 도시한다. 도 2는 도 1의 사용자 장치 또는 서버 의 구조의 예를 도시한다. 본 명세서에서 사용자 장치 및 서버는 '장치'로 통칭될 수 있다. 도 2를 참고하면, 장치는 제어부, 통신부, 저장부를 포함할 수 있다. 제어부는 장치의 전반적인 기능 및 동작을 제어할 수 있다. 제어부는 장치의 구성 요소들, 예를 들어, 통신부, 저장부 및 다른 적어도 하나의 구성 요소를 제어할 수 있다. 즉, 제어부는 장치 의 구성 요소들의 동작에 필요한 정보 또는 데이터를 제공하고, 구성 요소들에 의해 생성 또는 관리되는 정보또는 데이터에 기반하여 연산을 수행할 수 있다. 예를 들면, 제어부는 적어도 하나의 프로세서, 적어도 하나의 회로 등을 포함할 수 있다. 제어부는 본 명세서에서 설명되는 다양한 실시예들에 따라 장치가 동작하도록 필요한 제어를 수행할 수 있다. 통신부는 다른 장치와 신호를 송신 및 수신하기 위한 기능을 수행할 수 있다. 통신부는 유선 통신 또 는 무선 통신을 수행하며, 제어부의 제어에 따라 신호를 처리할 수 있다. 예를 들어, 통신부는 무선 통신을 위한 RF 회로, 안테나 등을 포함하거나 또는 유선 통신을 위한 연결 단 자, 모뎀, 드라이버 모듈 등을 포함할 수 있다. 예를 들어, 통신부는 LTE, 5G와 같은 셀룰러 통신, WiFi, 블루투스와 같은 근거리 무선 통신, 이더넷과 같은 근거리 유선 통신 등 다양한 통신 프로토콜들 중 적어도 하 나를 지원할 수 있다. 저장부는 장치에서 사용되는 데이터, 장치의 동작을 위한 소프트웨어, 프로그램 및 명령어들을 저장할 수 있다. 또한, 저장부는 제어부의 제어에 따라 저장된 데이터를 제공할 수 있다. 또한, 저장부는 제어부에 의해 구동될 어플리케이션들, 드라이버들 등을 저장할 수 있다. 예를 들면, 저장부는 DRAM, SRAM 등과 같은 RAM; ROM; EEPROM; HDD; SSD; 플래시 저장 수단 등을 포함할 수 있다. 도 2에 미도시되었으나, 장치는, 장치의 종류에 따라, 전원 장치, 표시 장치, 입력 장치, 출력 장치 중 적어도 하나를 더 포함할 수 있다. 예를 들면, 장치가 사용자 장치인 경우, 장치는 표시 장치(예를 들어, 디스플 레이), 입력 장치(예를 들어, 터치 패널, 버튼), 전원 장치(예를 들어, 배터리, 파워 서플라이)를 더 포함할 수 있다. 도 3은 본 발명의 일 실시예에 따른 케어 크루 서비스의 개념을 도시한다. 도 3을 참고하면, 사용자는 사용자 장치을 통해 건강 정보를 입력할 수 있다. 예를 들면, 사용자는 어플리케이션 또는 웹을 통해 케어 크루 서비스에 가입하고, 건강 정보를 입력할 수 있다. 다만, 일부 건강 정 보는 서버와 연동되어 자동 입력될 수도 있다. 건강 정보는 신체 계측 데이터, 임상 검사 데이터 및 설문 데이터 중 적어도 하나를 포함하는 포괄 평가 데이터 를 포함할 수 있다. 일부 실시예들에서, 신체 계측 데이터는 키, 체중, BMI 지수, 허리 둘레, 혈압 수치, 맥박 수치, 흉부 X선 검사 결과, ABI 검사 결과, 안저 검사 결과, 모노 필라멘트 검사 결과, 발 진찰 결과 등을 포함할 수 있다. 예를 들면, 신체 계측 데이터는 사전 검사(예를 들면, 오프라인 사전 검사)를 통해 측정되거나, 사용자 장치 에 포함 또는 연동된 센서를 이용하여 측정될 수 있다. 사용자가 신체 계측 데이터를 입력하여 서버 에 송신할 수도 있고, 서버가 사용자의 정보 이용 동의를 전제로 외부 서버로부터 신체 계측 데이터를 수 신할 수도 있다. 일부 실시예들에서, 임상 검사 데이터는 혈액 검사 결과(예를 들면, 공복 혈당 수치, 식후 혈당 수치, 당화혈색 소 수치, 총 콜레스테롤 수치, 중성 지방 수치, HDL-콜레스테롤 수치, LDL-콜레스테롤 수치, e-GFR, 헤모글로빈 수치, 헤마토크릿 수치, 소듐 수치, 포타슘 수치, 알부민 수치, BUN/크레아티닌 수치, 요산 수치 등); 소변 검 사 결과(예를 들면, Urine 10종, 요중 알부민/크레아티닌 비율 등); 등을 포함할 수 있다. 예를 들면, 임상 검사 데이터는 사전 검사(예를 들면, 오프라인 사전 검사)를 통해 측정될 수 있다. 사용자가 임상 검사 데이터를 입력하여 서버에 송신할 수도 있고, 서버가 사용자의 정보 이용 동의를 전제로 외부 서버로부터 임상 검사 데이터를 수신할 수도 있다. 설문 데이터는 서버가 제공한 설문에 대한 사용자의 답변 데이터를 포함할 수 있다. 예를 들면, 설문 데이 터는 사용자의 생활 습관, 약물 복용력, 접종 여부 등을 포함할 수 있다. 서버는 사용자의 건강 정보를 획득하여 사용자의 개별 건강 데이터(건강 정보, 건강 정보를 기반으로 산출 한 데이터 등)를 확인할 수 있다. 의료기관은 사용자의 개별 건강 데이터를 기반으로 사용자에 대한 모니 터링 및 개별 중재를 수행할 수 있다. 예를 들면, 모니터링 및 개별 중재는 인력의 관여 없이 미리 설계된 프로그램에 의해 수행될 수 있다. 사용자의 건강 관리 수준에 기반하여 맞춤 콘텐츠가 사용자에게 제공될 수 있다. 예를 들면, 사용자의 개 별 건강 데이터를 기초로 하여 사용자의 건강 관리 수준이 확인될 수 있다. 케어 크루 서비스의 콘텐츠들의 구체적인 예시는 표 1과 같다. 케어 크루 서비스는 다양한 건강 관리 메시지들 (즉, 하기 표 1의 건강 정보 메시지 등)을 사용자에게 제공할 수 있다. 표 1"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "건강 정보 메시지는 사용자의 건강 관리와 관련된 기본 정보를 포함할 수 있다. 예를 들면, 기본 정보는 건강 관리와 관련된 배경 지식, 과학적 지식, 의학적 지시, 통계 데이터 등을 포함할 수 있다. 일부 실시예들에서, 건강 정보 메시지는 사용자의 질환, 복약, 운동, 스트레스, 식사, 체중 조절, 흡연 및 음주 중 적어도 하나와 관련된 기본 정보를 포함할 수 있다. 건강 정보 메시지의 구체적인 일 예는 도 4와 같다. 도 4는 고혈압 질환에 대한 건강 정보 메시지의 예시이다. 일부 실시예들에서, 사용자의 포괄 평가 데이터를 기반으로 사용자에 대한 복수개의 건강 관리 목표들이 설정될 수 있다. 건강 관리 목표를 기반으로 건강 정보 메시지가 생성 및/또는 매칭되어 사용자에게 제공될 수 있다. 일부 실시예들에서, 건강 정보 메시지는 건강 관리 목표들 사이의 우선 순위에 따라 사용자에게 제공될 수 있다. 예를 들면, 건강 관리 목표들에 대하여 3순위 내지 5순위까지, 바람직하게는 3순위까지 우선 순위가 설정 될 수 있다. 예를 들면, 건강 정보 메시지는 소정 기간을 기준으로 순차적으로 반복적으로 사용자에게 제공될 수 있다. 우선 순위에 선정된 건강 관리 목표들에 대해 건강 정보 메시지를 사용자에게 제공하여, 맞춤 및 집중 형 관리가 수행될 수 있다. 지표 기반 메시지는 건강 지표에 대해 사용자가 자가 측정한 데이터(이하, 지표 데이터)에 대한 피드백을 포함 할 수 있다. 예를 들면, 건강 지표는 사용자의 관리가 필요한 모니터링 지표를 포함할 수 있다. 예를 들면, 사 용자가 지표 데이터를 자가 측정하고 어플리케이션에 입력하여 서버에 송신할 수 있다. 또는, 지표 데이터 는 사용자 장치와 연동된 센서 장치에 의해 측정되어 어플리케이션에 자동 입력되어 서버에 송신될 수도 있다. 일부 실시예들에서, 건강 지표는 신체 및 검사 관련 지표(예를 들면, 체중, BMI 지수, 혈압, 혈당 등); 약물 관 련 지표(예를 들면, 복약 종류, 복약 여부 등); 생활 습관 관련 지표(예를 들면, 식사 기록, 걸음 수, 운동, 흡 연, 음주, 수면 등) 등을 포함할 수 있다. 지표 데이터의 구체적인 일 예는 하기 표 2와 같다. 지표 기반 메시지는 사용자의 지표 데이터 및/또는 지표 데이터에 대한 분석 결과를 포함할 수 있다. 일부 실시예들에서, 지표 기반 메시지는 소정 시점 기준 지표 데이터, 소정 기간 기준 지표 데이터의 평균 값, 소정 기간 기준 지표 데이터의 롤링 평균 값(이 경우, 일부 특이적 수치에 따른 데이터 왜곡을 방지할 수 있음), 소정 기간 기준 지표 데이터의 경향 및 추세, 유사 질환 사용자들과의 비교 데이터, 유사 인구통계학적 요 인을 갖는 사용자들과의 비교 데이터 등을 포함할 수 있다. 일부 실시예들에서, 지표 기반 메시지는 소정 기간 기준 사용자의 대표 질환과 관련된 지표 데이터를 포함할 수 있다. 이 경우, 사용자의 대표 질환에 대한 맞춤 및 집중 관리가 수행될 수 있다. 예를 들면, 지표 기반 메시지에 포함되는 지표 데이터 및/또는 지표 데이터에 대한 분석 결과의 구체적인 일 예 시는 하기 표 2와 같다. 표 2"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "일 실시예에 있어서, 사용자의 포괄 평가 데이터를 기반으로 사용자가 속할 관리군이 결정될 수 있다. 예를 들 면, 관리군은 일반 관리군, 집중 관리군 등을 포함할 수 있다. 또한, 건강 지표마다 관리군이 다르게 설정될 수 도 있다. 일부 실시예들에서, 관리군에 따라 지표 데이터를 분석하는 기준 기간(예를 들면, 지표 데이터의 평균 등을 산 출함에 있어 기준이 되는 기간)이 달라질 수 있다. 예를 들면, 집중 관리군에 속한 지표 데이터의 분석 기준 기 간은 일반 관리군에 속한 지표 데이터의 분석 기준 기간보다 짧을 수 있다. 이에 따라, 특정 사용자 또는 특정 지표에 대한 집중적인 관리가 가능할 수 있다.예를 들면, 집중 관리군의 지표 데이터를 분석하는 기준 기간은 3일 내지 20일, 5일 내지 15일, 또는 10일 내지 2주일 수 있다. 또한, 일반 관리군의 지표 데이터를 분석하는 기준 기간은 5일 내지 한달, 10일 내지 한달, 15 일 내지 한달 또는 20일 내지 한달일 수 있다. 구체적인 예를 들면, 하기 표 3과 같이 사용자의 지표 데이터 각각에 대해 관리군이 달리 부여될 수 있고, 지표 데이터가 속한 관리군에 따라 분석 기준 기간이 달라질 수 있다. 도 5는 혈당이 집중 관리군에 속한 사용자에게 발송된 지표 기반 메시지의 구체적인 일 예이다. 표 3"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "동기 부여 메시지는 건강 관리(예를 들면, 상술한 건강 관리 목표 달성을 위한 건강 관리; 건강 지표, 특히, 모 니터링 지표에 대한 관리; 등)에 대해 사용자에게 동기를 부여할 수 있는 메시지를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 관리에 대한 동기 수준(level)에 따라 동기 부여 메시지의 내용 을 상이하게 구성하여 사용자에게 제공할 수 있다. 예를 들면, 사용자의 건강 관리에 대한 동기 수준(즉, 관리 의지 수준)은 상술한 건강 지표들 및 건강 관리 목표들마다 상이할 수 있다. 사용자의 관리 의지 수준에 따라 동기 부여 메시지의 내용을 상이하게 구성함으로써 건강 관리의 집중성 및 효율성을 향상시킬 수 있다. 일부 실시예들에서, 관리 의지 수준은 2단계 내지 7단계, 바람직하게는 2단계 내지 5단계로 나뉠 수 있다. 2단 계이면 관리 의지 수준은 있음/없음으로 나뉠 수 있다. 5단계리면 관리 의지 수준은 범이론적 모델로서 하기 표 4와 같이 나뉠 수 있다. 하기 표 4에서 레벨이 높을수록 관리 의지 수준(즉, 건강 관리 동기)이 높다고 해석될 수 있다. 표 4"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "건강 지표 및 건강 관리 목표에 대한 사용자의 관리 의지 수준은 사용자의 포괄 평가 데이터(특히, 설문 데이터)를 기반으로 결정될 수 있다. 일부 실시예들에서, 설문 데이터는 상술한 건강 지표들 중 적어도 하나에 대한 사용자의 관리 의지 수준을 확인 할 수 있는 설문에 대한 사용자의 답변을 포함할 수 있다(설문 및 답변에 대한 구체적인 예시는 하기 표 5 참조). 예를 들면, 설문 데이터는 혈압, 혈당, 약물, 금연, 금주, 운동, 체중 중 적어도 하나에 대한 관리 의지 수준을 확인 가능한 설문에 대한 답변을 포함할 수 있다. 예를 들면, 건강 지표에 대한 사용자의 관리 의지 수 준으로부터 건강 지표와 관련된 건강 관리 목표에 대한 사용자의 관리 의지 수준을 유추할 수 있다. 표 5"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "일부 실시예들에서, 건강 지표에 대한 사용자의 관리 의지 수준을 기반으로 사용자의 개선 목표가 설정될 수 있 다. 예를 들면, 개선 목표는 사용자의 건강 관리 목표일 수도 있고, 사용자의 건강 관리 목표를 달성하기 위한 세부 목표일 수도 있고, 건강 관리 목표와는 구분되는 추가 목표일 수도 있다. 예를 들면, 개선 목표는 관리 의 지 수준이 소정의 임계치 이하(관리 의지 없음 포함)인 건강 지표와 관련될 수 있다. 이에 따라, 사용자의 관리 의지가 없는 건강 지표에 대해 집중적으로 동기를 부여할 수 있다. 일부 실시예들에서, 관리 의지 수준이 소정의 임계 수준 이하(단, 관리 의지 없음 포함)이면, 동기 부여 메시지 는 미션 메시지를 포함할 수 있다. 관리 의지 수준이 소정의 임계 수준을 초과하면, 동기 부여 메시지는 칭찬 독려 메시지를 포함할 수 있다. 일부 실시예들에서, 동기 부여 메시지는 동기 부여 메시지에 포함된 건강 지표를 관리하는 것의 이점 및 중요성, 건강 지표를 관리하지 않는 경우의 문제점, 건강 지표와 관련된 통계 데이터 등을 더 포함할 수 있다. 미션 메시지는 사용자의 건강 관리에 대한 의지를 개선하기 위한(즉, 건강 관리의 실천을 위한) 미션을 포함할 수 있다. 미션의 난이도(즉, 강도)는 관리 의지 수준에 따라 상이해질 수 있다. 다만, 미션의 난이도는 상술한 건강 관리 목표 및 개선 목표보다 낮게 설정되어, 사용자가 개선 목표 및 건강 관리 목표를 달성할 수 있도록 유도할 수 있다. 미션 메시지의 구체적인 일 예시는 도 6과 같다. 칭찬 독려 메시지는 사용자의 건강 관리와 관련된 의지, 행동(예를 들어, 습관)을 유지시키기 위한 칭찬 및 독 려를 포함할 수 있다. 칭찬 독려 메시지의 구체적인 일 예시는 도 7과 같다. 위험 관리 메시지는 상술한 건강 지표(예를 들면, 모니터링 지표)에 대하여 소정의 위험 수치가 발생했을 때 사 용자에게 제공될 수 있다. 예를 들면, 위험 관리 메시지는 팝업 메시지 형태로 제공될 수 있다.일부 실시예들에서, 위험 관리 메시지는 위험 상황 관련 정보, 사용자에 대한 가이드(예를 들면, 대처 방안) 등 을 포함할 수 있다. 이에 따라, 사용자에게 위급 상황, 중증 등이 발생하는 것을 예방할 수 있다. 위험 관리 메 시지의 구체적인 일 예시는 도 8과 같다. 일부 실시예들에서, 건강 지표에 대한 측정값이 소정의 주의 수치 범위에 속하는 경우, 주의 수치 발생에 대한 알림이 팝업 메시지 형태로 제공될 수 있다. 또한, 건강 지표에 대한 측정값이 위험 수치 범위에 속하는 경우, 위험 수치 발생에 대한 알림 및 대처 방안이 제공될 수 있다. 이 경우, 건강 지표에 대한 측정값을 주의 단계 및 위험 단계로 구분하여 관리함으로써, 위급 상황의 발생을 보다 예방할 수 있다. 표 6 및 표 7은 각각 혈압 및 혈당에 대한 주의 수치 및 위험 수치에 대한 구체적인 예시이다. 표 6"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "표 7"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "일부 실시예들에서, 위험 관리 메시지를 통해 위험 수치가 발생한 건강 지표의 수치 조절이 되지 않으면, 전문 가의 개별 메시지를 추가 제공할 수 있다. 또한, 지속적으로(예를 들면, 소정 기간 기준 소정 횟수 이상) 위험 수치가 발생하면, 진료를 권고하는 내용의 메시지를 추가 제공할 수도 있다. 일부 실시예들에서, 케어 크루 서비스는 사용자가 소정 기간 메시지를 열람하지 않았을 때 발송하는 메시지 열 람 독려 메시지(예를 들면, 팝업 형태로 제공될 수 있음), 사용자가 소정 기간 지표 데이터를 기록하지 않았을 때 발송하는 지표 미기록 알림 메시지 등을 더 제공할 수 있다. 일 실시예에서, 지표 미기록 알림 메시지는 관리군에 따라 제공 기준이 상이할 수 있다. 예를 들면, 집중 관리 군의 경우 1주간 3회 이상으로 지표 데이터를 기록하지 않으면(즉, 1주 동안 3회 미만으로 지표 데이터를 기록 하면) 지표 미기록 알림 메시지가 제공될 수 있다. 일반 관리군의 경우 2주간 1회 이상, 2회 이상 또는 3회 이 상으로 지표 데이터를 기록 하지 않으면 지표 미기록 알림 메시지가 제공될 수 있다. 이하, 도 9 내지 도 14를 참조하여, 케어 크루 서비스가 제공되는 과정을 보다 상세히 설명한다. 다만, 상술한 일부 내용들을 중복 기재를 피하기 위해 설명을 생략할 수 있다.도 9는 일 실시예에 따른 케어 크루 서비스를 수행하기 위한 동작 순서도를 도시한다. 도 9는 서버에 의해 수행되는 동작을 도시한다. 도 9를 참고하면, 서버는 사용자의 포괄 평가 데이터를 획득할 수 있다(S901). 예를 들면, 서버는 사 용자의 서비스 신규 가입에 따라 해당 사용자에 대한 포괄 평가를 수행할 수 있다. 상술하였듯이, 포괄 평가 데이터는 신체 계측 데이터, 임상 검사 데이터 및 설문 데이터 중 적어도 하나를 포함 할 수 있다. 예를 들면, 사용자가 신체 계측 데이터를 사용자 장치에 입력하여 서버에 송신할 수 있다. 또는, 서 버는 사용자의 정보 이용 동의를 전제로 외부 서버로부터 신체 계측 데이터를 수신할 수 있다. 예를 들면, 사용자가 임상 검사 데이터를 입력하여 서버에 송신할 수 있다. 또는, 서버는 사용자의 정보 이용 동의를 전제로 외부 서버로부터 임상 검사 데이터를 수신할 수 있다. 예를 들면, 서버는 사용자에게 복수개의 설문 문항을 포함하는 설문을 제공하고, 사용자는 설문의 답변을 서버에 제공할 수 있다. 서버는 사용자의 포괄 평가 데이터를 기반으로 결정된 케어 플랜을 사용자에게 제공할 수 있다. 케어 플랜 은 복수개의 건강 관리 목표들을 포함할 수 있다. 즉, 포괄 평가 데이터를 기반으로 건강 관리 목표가 결정될 수 있다. 도 10은 케어 플랜에 대한 구체적인 일 예시이다. 일 실시예에서, 사용자의 포괄 평가 데이터를 기반으로 관리가 필요한 건강 지표(예를 들면, 모니터링 지표)가 결정될 수 있다. 모니터링 지표에 기반하여 건강 관리 목표가 결정될 수 있다. 건강 관리 목표는 모니터링 지표 와 관련된 목표들을 포함할 수 있다. 예를 들면, 건강 관리 목표는 모니터링 지표에 대한 목표 수치의 달성(예 를 들면, 표 8), 모니터링 지표와 관련된 행위의 실천(예를 들면, 표 9), 모니터링 지표와 관련된 교육 이수(예 를 들면, 표 10) 등을 포함할 수 있다. 표 8 표 9"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "표 10"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "일 실시예에서, 모니터링 지표 및/또는 건강 관리 목표의 결정은 미리 정의된 맵핑 테이블 또는 알고리즘에 기 반하여 수행될 수 있다. 다른 일 실시예에서, 모니터링 지표 및/또는 건강 관리 목표의 결정은 훈련된 인공지능 모델에 기반하여 수행될 수 있다. 또 다른 일 실시예에서, 모니터링 지표 및/또는 건강 관리 목표의 결정은 전문가에 의해 수행된 후 서버에 입력될 수 있다. 이 경우, 서버는 전문가의 장치로 사용자에 대한 정보 및 사용자의 포괄 평가 데이터를 제공하고, 전문가의 장치로부터 입력되는 모니터링 지표 및/또는 건강 관리 목표를 수신할 수 있다. 서버는 사용자에 대한 모니터링 및 건강 관리 메시지의 전송을 수행할 수 있다(S903). 예를 들면, 서버 는 사용자가 케어 플랜(즉, 건강 관리 목표들)에 따라 건강 관리를 수행하는지 여부를 모니터링하고, 사용 자를 관리하기 위한 다양한 건강 관리 메시지들을 사용자 장치에 송신할 수 있다. 상술하였듯이, 건강 관리 메시지는 건강 정보 메시지, 지표 기반 메시지, 동기 부여 메시지(미션 메시지 및 칭 찬 독려 메시지) 및 위험 관리 메시지 중 적어도 하나를 포함할 수 있다. 또한, 건강 관리 메시지는 메시지 열 람 독려 메시지, 지표 미기록 알림 메시지 등을 더 포함할 수 있다. 서버는 미리 설정된 규칙(즉, 스케줄)에 따라 사용자에게 건강 관리 메시지를 제공할 수 있다. 일 실시예에서, 서버는 소정의 기간(예를 들면, 1주, 2주, 4주 등) 단위로 적어도 1회 건강 관리 메시지를 사용자 장치에 송신할 수 있다. 송신 횟수는 건강 관리 메시지의 종류에 따라 다르게 설정될 수 있다. 다른 일 실시예에서, 제1 건강 관리 메시지(예를 들어, 건강 정보 메시지, 지표 기반 메시지, 동기 부여 메시지, 메시지 열람 독려 메시지, 지표 미기록 알림 메시지 등)은 사용자 장치에 소정 기간 기준 적어도 1회 송신될 수 있다. 제2 건강 관리 메시지(예를 들면, 위험 관리 메시지, FAQ 등)은 소정의 이벤트 발생에 따 라 사용자 장치에 송신될 수 있다. 건강 관리 메시지의 종류에 따른 송신 스케줄의 구체적인 예는 하기 표 11과 같다. 표 11"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "서버는 소정 기간 사용자에 대한 건강 관리 결과를 기반으로 사용자의 케어 플랜을 재설정(즉, 수정)할 수 있다(S904). 예를 들면, 사용자에 대한 모니터링 시작 시점부터 소정 기간이 경과되면, 서버는 포괄 평가 데이터를 사 용자에게 재요청하여 재획득할 수 있다. 서버는 소정 기간 동안의 건강 관리 목표의 달성 여부 및 달성률 을 산출할 수 있다. 서버는 재획득한 포괄 평가 데이터, 건강 관리 목표의 달성 여부, 달성률 등에 기반하 여 기존 모니터링 지표의 변경 여부, 건강 관리 목표의 변경 여부 등을 판단할 수 있다. 서버는 모니터링 및 메시지 전송을 다시 수행할 수 있다(S903). S904 및 S903의 반복은 사용자가 케어 크 루 서비스를 이용하는 동안 지속될 수 있다. 도 11은 일 실시예에 따른 건강 관리 메시지 전송을 수행하기 위한 동작 순서도를 도시한다. 도 11은 서버(10 2)에 의해 수행되는 동작을 도시한다. 도 11을 참고하면, 서버는 사용자의 포괄 평가 데이터를 기반으로 사용자의 관리군을 설정할 수 있다 (S1101). 상술한 바와 같이, 관리군은 집중 관리군, 일반 관리군 등을 포함할 수 있다. 예를 들면, 관리군의 설 정기준은 미리 정의될 수 있다. 표 12는 사용자를 집중 관리군 및 일반 관리군으로 구분하는 기준의 구체적인 일 예시이다.표 12"}
{"patent_id": "10-2023-0130766", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "일부 실시예들에서, 관리가 필요한 건강 지표(즉, 모니터링 지표)마다 관리군이 상이하게 설정될 수도 있다. 서버는 사용자의 포괄 평가 데이터 및 관리군을 기반으로 사용자의 건강 관리 목표를 설정할 수 있다 (S1102). 예를 들면, 관리군에 따라 건강 관리 목표의 난이도(즉, 강도) 등이 결정될 수 있다. 예를 들면, 집중 관리군의 건강 관리 목표의 난이도는 일반 건강 관리군의 건강 관리 목표의 난이도보다 높을 수 있다. 서버는 관리를 위한 메시지를 사용자 장치에 송신할 수 있다(S1102). 메시지의 송신에 관한 내용은 상술하였으므로 생략한다. 도 12는 일 실시예에 따라 지표 기반 메시지를 발송하기 위한 동작 순서도를 도시한다. 도 12는 서버에 의 해 수행되는 동작을 도시한다. 도 12를 참고하면, 서버는 사용자의 건강 지표(예를 들면, 모니터링 지표)를 모니터링할 수 있다(S1201). 예를 들면, 서버는 모니터링 지표에 대한 지표 데이터(예를 들면, 측정값 등)를 입력하는 인터페이스를 사 용자 장치에 제공하고, 인터페이스를 통해 입력된 지표 데이터를 사용자 장치로부터 수신할 수 있다. 또는, 서버는 사용자 장치에 연동된 센서에 의해 측정된 지표 데이터를 수신할 수도 있다. 서버는 지표 데이터에 기초하여 지표 기반 메시지를 생성할 수 있다(S1202). 예를 들면, 서버는 미리 정의된 메시지 템플릿에 변수들을 추가하여 메시지를 생성하거나, 생성형 인공지능 모델(예를 들면, GPT)을 이 용하여 메시지를 생성할 수 있다. 지표 기반 메시지에 포함되는 내용은 상술한 바와 같다. 서버는 생성된 지표 기반 메시지를 사용자 장치에 송신할 수 있다. 서버는 네트워크를 통해 사 용자 장치로 지표 기반 메시지를 송신할 수 있다. 예를 들면, 지표 기반 메시지는 어플리케이션의 푸쉬 메 시지, 푸쉬 알림, 일반적인 문자 메시지, 이메일, 제3자 메시징 어플리케이션의 메시지 등 다양한 형태로 송신 될 수 있다. 도 13은 일 실시예에 따른 동기 부여 메시지를 발송하기 위한 동작 순서도를 도시한다. 도 13은 서버에 의 해 수행되는 동작을 보여준다. 도 13을 참고하면, 서버는 사용자의 포괄 평가 데이터를 획득할 수 있다(S1301). 상술한 바와 같이, 포괄 평가 데이터는 신체 계측 데이터, 임상 검사 데이터, 설문 데이터 등을 포함할 수 있다. 서버는 사용자의 포괄 평가 데이터를 기반으로 적어도 하나의 건강 지표에 대한 사용자의 관리 의지 수준 을 판단할 수 있다(S1302). 적어도 하나의 건강 지표에 대한 예시는 상술한 바와 같다. 일부 실시예들에서, 적 어도 하나의 건강 지표는 사용자의 모니터링 지표를 포함할 수 있다. 일부 실시예들에서, 서버는 포괄 평가 데이터에 포함된 설문 데이터를 기반으로 적어도 하나의 건강 지표 에 대한 사용자의 관리 의지 수준을 판단할 수 있다. 예를 들면, 설문 데이터는 적어도 하나의 건강 지표에 대 한 사용자의 관리 의지 수준을 확인 가능한 설문에 대한 사용자의 답변을 포함할 수 있다. 예를 들면, 서버는 사용자 장치로 적어도 하나의 건강 지표에 대한 사용자의 관리 의지 수준을 확인 할 수 있는 설문(즉, 설문 문항들)을 송신하고, 사용자 장치로부터 설문에 대한 답변을 포함하는 설문 데 이터를 수신할 수 있다. 서버는 설문 데이터를 기반으로 적어도 하나의 건강 지표에 대한 사용자의 관리 의지 수준을 판단할 수 있다.일부 실시예들에서, 서버는 적어도 하나의 건강 지표에 대한 사용자의 관리 의지 수준을 기반으로 사용자 의 개선 목표를 설정할 수 있다. 개선 목표에 대한 구체적인 내용은 상술한 바와 같다. 서버는 적어도 하나의 건강 지표에 대한 사용자의 관리 의지 수준이 소정의 임계 수준 이하인지 여부를 판 단할 수 있다(S1303). 예를 들면, 서버는 건강 지표들 각각에 대해 사용자의 관리 의지 수준이 소정의 임 계 수준 이하인지 여부를 판단할 수 있다. 서버는 사용자의 관리 의지 수준이 소정의 임계 수준 이하인 건강 지표에 대해, 해당 건강 지표와 관련된 미션을 포함하는 미션 메시지를 사용자 장치에 송신할 수 있다(S1304). 미션 메시지는 해당 건강 지표에 대한 사용자의 관리 의지의 개선, 관리의 실천 등을 위한 미션을 포함할 수 있다. 예를 들면, 서버는 미리 정의된 메시지 템플릿을 최적화하여 메시지를 생성하거나 생성형 인공지능 모델(예를 들면, GPT)을 이용하여 메 시지를 생성할 수 있다. 서버는 사용자의 관리 의지 수준이 소정 임계 수준을 초과하는 건강 지표에 대해, 사용자 장치에 칭 찬 독려 메시지를 송신할 수 있다(S1305). 칭찬 독려 메시지는 해당 건강 지표에 대한 사용자의 관리 의지, 행 동 등을 유지시키기 위한 칭찬 및 독려를 포함할 수 있다. 예를 들면, 서버는 미리 정의된 메시지 템플릿 을 최적화하여 메시지를 생성하거나, 생성형 인공지능 모델(예를 들면, GPT)을 이용하여 메시지를 생성할 수 있 다. 일 실시예에서, 사용자와 유사한 특성을 갖는 다른 사용자들의 미션 달성률을 고려하여 사용자에 대한 미션이 결정될 수 있다. 예를 들면, 사용자와 유사한 특성을 갖는 다른 사용자들이, 동일한 건강 지표에 대하여 동일한 관리 의지 수준을 보였을 때 다른 사용자들에게 해당 건강 지표와 관련하여 제공된 미션의 달성률을 확인할 수 있다. 서버는 다른 사용자들의 미션 달성률이 소정 수치 이상이었던 미션들을 사용자에게 제공할 수 있다. 예를 들면, 사용자와 유사한 특성을 갖는지 여부는 인구 통계학적 요인(예를 들어, 나이, 성별, 연령, 직업, 직 책 등), 신체적 요인(예를 들어, 키, 체중), 포괄 평가 데이터 등을 기반으로 판단할 수 있다. 일부 실시예들에서, 미션 메시지를 제공하기 전에, 포괄 평가 데이터를 기반으로 사용자의 건강 관리 목표를 설 정할 수 있다. 사용자의 관리 의지 수준을 판단하는 적어도 하나의 건강 지표(특히, 사용자의 관리가 필요한 모 니터링 지표)는 사용자의 건강 관리 목표와 관련될 수 있다. 예를 들면, 미션 메시지는 건강 관리 목표를 달성 하기 위한 세부 목표를 미션으로서 포함할 수 있다. 일부 실시예들에서, 미션 메시지에 포함된 미션의 난이도는 사용자의 관리 의지 수준에 따라 결정될 수 있다. 일 실시예에서, 난이도가 증가하는 경향을 갖도록 사용자에게 복수의 미션들을 순차적으로 제공할 수 있다. 이 경우, 사용자가 건강 관리 목표를 달성할 수 있도록 미션 메시지들이 가이드 역할을 할 수 있다. 도 14는 일 실시예에 따른 미션을 활용하기 위한 동작 순서도를 도시한다. 도 14는 서버에 의해 수행되는 동작을 도시한다. 도 14는 참고하면, 서버는 사용자의 미션 달성 여부를 판단하기 위한 피드백을 수신할 수 있다(S1401). 예를 들면, 사용자는 부여된 미션에 대한 피드백을 사용자 장치에 입력할 수 있고, 피드백은 서버로 전달될 수 있다. 서버는 미션에 대한 달성 여부를 판단할 수 있다. 예를 들면, 피드백은 사용자에 의해 주기적으로 입력되거나 또는 수시로 입력될 수 있다. 피드백은 설문과 유사 한 형식으로 주어진 질문에 답을 하는 방식으로 입력되거나 또는 미션에서 요구되는 행위에 관련된 사진이나 영 상을 업로드하는 것으로서 입력될 수 있다. 소정의 건강 지표에 대한 목표 수치의 달성이 미션이라면, 사용자는 지표 데이터를 입력하는 것으로 피드백할 수 있다. 서버는 피드백의 입력을 요구하는 알림을 포함하는 푸 시 메시지를 사용자 장치에 송신할 수도 있다. 서버는 피드백을 기반으로 미션의 달성 여부를 판단할 수 있다(S1402). 미션이 달성된 것으로 판단되는 경우, 서버는 해당 미션에 대한 보상을 제공할 수 있다(S1403). 보상은 다 양한 형태로 제공될 수 있다. 예를 들면, 보상은 미션의 달성을 표시하는 건강 배지를 제공하는 것을 포함할 수 있다. 다른 예를 들면, 보상은 건강 관리 상품을 구매에 사용 가능한 포인트 지급을 포함할 수 있다. 미션이 달성되지 않은 것으로 판단되면, 서버는 미션을 재설정할 수 있다(S1404). 예를 들면, 서버는 기제공된 미션보다 낮은 난이도를 갖는 미션을 사용자에게 다시 제공할 수 있다. 예를 들면, 서버는 요구 되는 행위의 횟수를 완화하거나, 금지되는 행위의 허용 횟수를 완화하거나, 조절되어야 하는 건강 지표의 목표수치를 완화할 수 있다. 일부 실시예들에서, 하나의 건강 관리 목표가 복수개의(즉, 둘 이상의) 건강 지표들과 관련될 수 있다. 이 경우, 건강 지표가 상이한 미션 메시지들이 사용자에게 제공될 수 있다. 즉, 하나의 건강 관리 목표의 달성에 건강 지표가 서로 상이한 미션 메시지들이 함께 기여할 수 있다. 서버는 소정 기간 경과 후 사용자의 피드 백을 기반으로 건강 지표별 미션 달성률을 확인할 수 있다. 서버는 건강 지표별 미션 달성률에 따라 미션 의 비중을 조절할 수 있다. 예를 들면, 서버는 미션 달성률이 높은 건강 지표에 대한 미션의 비중을 높일 수 있다. 구체적인 예를 들면, 건강 관리 목표가 적정 체중 달성이라면, 적정 체중 달성과 관련되는 건강 지표는 식사(즉, 식단; 제1 건강 지표), 운동(제2 건강 지표) 등을 포함할 수 있다. 식사 및 운동에 대한 사용자의 관 리 의지 수준이 모두 임계 수준 이하라고 가정하면, 식사와 관련한 미션들과 운동과 관련한 미션들이 사용자에 게 제공될 수 있다. 서버는 소정 기간 경과 후, 식사와 관련된 미션들의 달성률 및 운동과 관련된 미션들 의 달성률을 비교하고, 달성률이 높은 건강 지표에 대한 미션의 제공 비중을 높일 수 있다. 이에 따라, 건강 관 리 목표 달성에 사용자의 관리 의지를 반영함으로써, 건강 관리 효율을 향상시킬 수 있다. 본 명세서에서 본 발명의 원리들의 '일 실시예'와 이런 표현의 다양한 변형들의 지칭은 이 실시예와 관련되어 특정 특징, 구조, 특성 등이 본 발명의 원리의 적어도 하나의 실시예에 포함된다는 것을 의미한다. 따라서, 표 현 '일 실시예에서'와, 본 명세서 전체를 통해 개시된 임의의 다른 변형 예시들은 반드시 모두 동일한 실시예를 지칭하는 것은 아니다. 전술한 본 발명의 다양한 실시예들에 따른 방법은 하드웨어인 컴퓨터가 결합되어 실행되기 위해 컴퓨터 프로그 램 또는 모바일 어플리케이션으로 구현되어 매체에 저장될 수 있다. 또는, 본 발명의 실시예들과 관련하여 설명 된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM, ROM, EPROM, EEPROM, 플래시 메 모리, 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴 퓨터 판독가능 기록매체에 상주할 수도 있다. 또한, 알고리즘은 설치 파일 형태로 제작되어 온라인 다운로드 형 태로 제공되며, 이를 위해 온라인 소프트웨어 마켓을 통해 접속 가능한 서버에 저장될 수 있다. 본 명세서를 통해 개시된 모든 실시예들과 조건부 예시들은, 본 발명의 기술 분야에서 통상의 지식을 가진 당업 자가 독자가 본 발명의 원리와 개념을 이해하도록 돕기 위한 의도로 기술된 것으로, 당업자는 본 발명이 본 발 명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러 므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0130766", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 만성 질환 환자 모니터링 시스템의 구조를 도시한다. 도 2는 본 발명의 일 실시예에 따른 장치의 구조를 도시한다. 도 3은 본 발명의 일 실시예에 따른 케어 크루 서비스의 개념을 도시한다. 도 4는 본 발명에 따른 건강 정보 메시지의 일 예시를 도시한다. 도 5는 본 발명에 따른 지표 기반 메시지의 일 예시를 도시한다. 도 6은 본 발명에 따른 미션 메시지의 일 예시를 도시한다. 도 7은 본 발명에 따른 칭찬 독려 메시지의 일 예시를 도시한다. 도 8은 본 발명에 따른 위험 관리 메시지의 일 예시를 도시한다. 도 9는 본 발명의 일 실시예에 따른 케어 크루 서비스를 수행하기 위한 동작 순서도를 도시한다. 도 10은 본 발명의 일 실시예에 따른 케어 플랜의 일 예시를 도시한다. 도 11은 본 발명의 일 실시예에 따른 건강 관리 메시지를 발송하기 위한 동작 순서도를 도시한다. 도 12는 본 발명의 일 실시예에 따른 지표 기반 메시지를 발송하기 위한 동작 순서도를 도시한다. 도 13은 본 발명의 일 실시예에 따른 동기 부여를 위한 메시지를 발송하기 위한 동작 순서도를 도시한다. 도 14는 본 발명의 일 실시예에 따른 미션을 활용하기 위한 동작 순서도를 도시한다."}
