{"patent_id": "10-2022-0116291", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0037592", "출원번호": "10-2022-0116291", "발명의 명칭": "인공지능 활용 상담 보조 시스템 및 방법", "출원인": "한국전자통신연구원", "발명자": "김용준"}}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "민원인의 음성을 수신하는 음성 수신부;수신된 상기 음성을 분석하는 음성 분석부; 및분석된 상기 음성에 기초하여 생성된 민원인 대응 정보를 상담원에게 제공하는 정보 표시부를 포함하고,상기 음성 분석부는 인공지능 기반 음성 분석 알고리즘에 기초하여 상기 음성을 분석하는 것인 인공지능을 활용한 상담 보조 시스템."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,대화 의도 분석 및 키워드 추출 중 적어도 하나를 위한 데이터베이스를 더 포함하는 인공지능을 활용한 상담 보조 시스템."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 음성 분석부는 수신된 상기 음성에 대해 STT변환을 수행하여 텍스트를 추출하고, 상기 텍스트에서 인공지능 기반 대화 의도 분석 모델을 이용하여 추출한 엔티티(entity)를 상기 데이터베이스에서 검색하여 상기 민원인 대응 정보를 생성하는 것인 인공지능을 활용한 상담 보조 시스템."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 음성 분석부는 수신된 상기 음성에 대해 인공지능 기반 키워드 분석 모델을 이용하여 추출한 하나 이상의 키워드를 상기 데이터베이스에서 검색하여 상기 민원인 대응 정보를 생성하는 것인 인공지능을 활용한 상담 보조 시스템."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 음성 분석부는 분석된 상기 음성에 기초하여 상기 민원인의 감정을 분석하는 것인 인공지능을 활용한 상담보조 시스템."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 음성 분석부는 분석된 상기 음성에 기초하여 상기 민원인의 발화 언행을 분석하는 것인 인공지능을 활용한상담 보조 시스템."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항 내지 제6항 중 어느 한 항에 있어서,상기 민원인 대응 정보는 상기 민원인의 민원 의도와 관련된 답변 문장, 상기 민원인과 상담원 간 대화에서 추출된 중요 키워드와 관련된 정보, 상기 민원인의 감정 상태에 대한 정보, 및 상기 민원인의 발화 언행에 대한정보 중 적어도 하나를 포함하는 것인 인공지능을 활용한 상담 보조 시스템.공개특허 10-2024-0037592-3-청구항 8 제5항에 있어서,상기 음성 분석부는 분석된 상기 민원인의 감정에 대한 정보를 상기 정보 표시부에 전달하는 것인 인공지능을활용한 상담 보조 시스템."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 음성 분석부는 분석된 상기 민원인의 발화 언행에 기초하여 상기 상담원에 대한 보호 모드를 실행하는 것인 인공지능을 활용한 상담 보조 시스템."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 보호 모드는 챗봇으로의 전환, 상기 민원인에게의 경고, 및 상기 민원인과의 상담 중단 중 적어도 하나를포함하는 것인 인공지능을 활용한 상담 보조 시스템."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "민원인의 음성을 수신하는 단계;수신된 상기 음성에 대해 인공지능 기반 음성 분석 알고리즘에 기초하여 분석하는 단계; 및분석된 상기 음성에 기초하여 생성된 민원인 대응 정보를 표시하는 단계를 포함하는 인공지능을 활용한 상담 보조 방법."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 수신된 상기 음성을 인공지능 기반 음성 분석 알고리즘에 기초하여 분석하는 단계는 수신된 상기 음성에서 엔티티(entity)를 추출하는 단계; 및추출된 상기 엔티티를 데이터베이스에서 검색하여 상기 민원인의 민원 의도와 관련된 답변 문장을 포함하는 상기 민원인 대응 정보를 생성하고 표시하는 단계를 포함하는 인공지능을 활용한 상담 보조 방법."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 수신된 상기 음성을 인공지능 기반 음성 분석 알고리즘에 기초하여 분석하는 단계는 수신된 상기 음성에 대해 STT 변환을 수행하여 텍스트를 추출하는 단계;추출된 상기 텍스트에 대해 키워드 분석을 수행하는 단계; 및상기 키워드 분석되어 추출된 하나 이상의 키워드를 키워드 추출을 위한 데이터베이스에서 검색하여 상기 하나이상의 키워드를 포함하는 상기 민원인 대응 정보를 생성하고 표시하는 단계를 포함하는 인공지능을 활용한 상담 보조 방법."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 수신된 상기 음성을 인공지능 기반 음성 분석 알고리즘에 기초하여 분석하는 단계는 분석된 상기 음성에 기초하여 상기 민원인의 감정 상태를 분석하는 단계를 포함하는 것인 인공지능을 활용한 상담 보조 방법.공개특허 10-2024-0037592-4-청구항 15 제11항에 있어서,상기 수신된 상기 음성을 인공지능 기반 음성 분석 알고리즘에 기초하여 분석하는 단계는 분석된 상기 음성에 기초하여 상기 민원인의 발화 언어를 분석하는 단계를 포함하는 것인 인공지능을 활용한 상담 보조 방법."}
{"patent_id": "10-2022-0116291", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 분석하는 단계의 분석 결과, 상담원 보호가 필요한 경우 상기 상담원에 대한 보호 모드를 실행하는 단계를더 포함하는 인공지능을 활용한 상담 보조 방법."}
{"patent_id": "10-2022-0116291", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 인공지능을 활용한 상담 보조 시스템은 민원인의 음성을 수신하는 음성 수신부, 수신된 상기 음 성을 분석하는 음성 분석부 및 분석된 상기 음성에 기초하여 생성된 민원인 대응 정보를 상담원에게 제공하는 정 보 표시부를 포함하고, 상기 음성 분석부는 인공지능 기반 음성 분석 알고리즘에 기초하여 상기 음성을 분석한다."}
{"patent_id": "10-2022-0116291", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 상담 보조 시스템 및 방법에 관한 것으로, 상세하게는 인공지능을 활용하여 상담원의 상담을 보조하 는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0116291", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷과 휴대용 모바일 기기의 발달에 따라 온라인 상담의 비중이 점차 커지고 있다. 그러나 모바일 앱 등을 통해 상담원를 연결해 주고 상담을 제공하는 서비스의 경우 주로 상담원을 통해 상담이 이루어지기 때문에 24시 간 상담 서비스를 제공하기가 어렵고, 자주 묻는 질문 또는 반복적인 질문 등에 상담원이 일일이 응대해야 하는 문제로 효율적인 상담 서비스의 제공이 어려웠다. 이러한 문제를 극복하기 위해 챗봇 기술을 이용한 상담 서비스에 대한 연구가 활발히 진행되고 있다. 최근 챗봇 관련 연구가 활발히 진행되면서, 대화 의도를 파악하는 기술까지 많이 연구되고 있다. 단일 의도뿐만 아니라, 문장에서 다수의 의도를 추출하여, 화자가 어떤 의도를 가지고 있는지를 뽑아낼 수 있다. 이를 위해 대화의도에 서 엔티티(entity)를 처리하는 기법으로 발전하고 있다. 대화 문장으로부터 화자의 감정 상태를 판단하는 기술 역시 딥러닝 기술의 발전으로 점점 정확도를 높여가고 있 으며, 대화 내용에서 혐오 발언을 추출하는 기술도 전통적인 머신러닝 뿐만 아니라, 딥러닝에서도 꾸준하게 연 구되고 있는 분야 중에 하나이다. 이와 같이 딥러닝이 크게 발전하고 있어, 생성된 모델과 사람이 대화하는 수준까지 이르렀지만, 챗봇 기반 상담 서비스의 경우 간단하고 일반적인 사항에 대해서만 응대가 가능한 수준이기 때문에 AI 컨택센터(AICC: Artificial Intelligence Contact Center)와 같이 특정한 목적을 가지고 전화하는 민원인을 응대하는 분야에서 는 상담원이 상세히 민원인의 민원에 대응하기에는 어려움이 많다. 또한 상담원이 직접 상담을 하더라도 고객의 다양한 문의사항을 접수한 상담원이 내부 상담 지식 데이터베이스 를 활용하여 관련된 상담 지식을 검색하고 이를 기반으로 답변을 등록해야 해서 고객 응대에 많은 지연이 발생 하는 문제가 있다."}
{"patent_id": "10-2022-0116291", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 목적은, 상담원의 상담 효율을 높이는 인공지능을 활용한 상담 보조 시스템 및 방법을 제공하는 데 있다. 또한, 민원인의 혐오 발언 등을 확인하고 필터링하여, 상담원을 언어 폭력으로부터 보호하는 기능을 수행하는 상담 보조 시스템 및 방법을 제공하고자 한다. 본 발명의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로 부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0116291", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템은 민원인의 음성 을 수신하는 음성 수신부, 수신된 상기 음성을 분석하는 음성 분석부 및 분석된 상기 음성에 기초하여 생성된 민원인 대응 정보를 상담원에게 제공하는 정보 표시부를 포함하고, 상기 음성 분석부는 인공지능 기반 음성 분 석 알고리즘에 기초하여 상기 음성을 분석한다.. 상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 방법은 민원인의 음성을 수신하는 단계, 수신된 상기 음성에 대해 인공지능 기반 음성 분석 알고리즘에 기초하여 분석하는 단계 및 분석 된 상기 음성에 기초하여 생성된 민원인 대응 정보를 표시하는 단계를 포함한다."}
{"patent_id": "10-2022-0116291", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 상담원의 민원인 상담시 실시간으로 상담에 도움이 되는 정보와 민원인의 성향 등에 관한 정 보를 상담원에게 제공할 수 있다. 또한, 본 발명에 의하면, 악성 민원인의 언어 폭력 등을 감지하여 자동 상담상담 차단 또는 자동 챗봇 전환을 수행하여 상담원을 보호할 수 있다."}
{"patent_id": "10-2022-0116291", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 몇몇 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 권리범위는 실시예들로부터 관련되는 본 발명의 기술적 사상에 속하는 모든 변경, 변형, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급 된 때에만, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 제시되는 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포 함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다.본 출원에서 사용된 \"상기\" 및 이와 유사한 지시어는 단수 및 복수 모두를 지시하는 것일 수 있다. 또한 본 개 시에 따른 방법을 설명하는 단계의 순서를 명백하게 지정하는 기재가 없다면, 기재된 단계들은 목적하는 바를 수행하기 위한 순서로 행해질 수 있다. 기재된 단계들의 기재 순서에 따라 본 개시가 한정되는 것은 아니다. 기술적이거나 과학적인 용어를 포함해서 본 명세서에서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있으며, 이상적이거나 과도 하게 축소된 형식적인 의미로 해석되지 않아야 할 것이며, 본 명세서에서 어떤 용어의 의미를 정의할 경우 해 용어는 그 정의된 대로 해석되어야 한다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 본 발명은 상담원이 구체적이고 특정한 목적을 가진 민원인을 온라인 상담할 시 인공지능이 민원인의 음성을 분 석해서 대화 의도를 분석해서 민원에 대한 예시 답변을 상담원에게 실시간으로 제공하거나, 상담 키워드를 추출 하여 상담에 도움이 되는 정보를 실시간으로 상담원에게 제공하고, 이와 함께 민원인의 감정과 사용 언어 형태 를 분석하여 상담원에게 민원인의 감정을 고려하여 상담을 할 수 있도록 할 뿐만이 아니라 악성 민원인을 차단 하는 등 방법을 통해 언어 폭력으로부터 상담원을 보호하도록 하는 구성을 요지로 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 나타내는 구성도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템은 민원인의 음성을 수 신하는 음성 수신부, 수신된 음성에 대해 인공지능 기반 음성 분석 모델링을 수행하는 음성 분석부, 민원인의 민원에 대한 예시 답변과 민원 관련 키워드와 관련된 정보를 저장하는 데이터베이스, 상담원에게 민원 관련 정보를 표시하는 표시부를 포함한다. 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템의 음성 수신부는 민원인 및/또는 상담원의 음성을 수신하는 모듈로서, 마이크로폰(micro-phone)과 같은 음성 수신 모듈이다. 본 발명의 음성 수 신부는 후술할 음성 분석부로 수신한 음성에 대한 정보(이하 음성 정보라 칭함)를 전달한다. 이때 구 현 방식에 따라 음성 수신부은 음성 샘플링률을 조절하고, 노이즈를 제거하여 음성 분석부로 전달할 수 있다. 이하에서는 본 발명의 음성 분석부의 주요 기능에 대해 설명한다. 대화 의도 분석 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템의 음성 분석부는 본 발명의 음성 수신부으로부터 전달받은 민원인의 음성 정보에 대해 인공지능 기반 분석을 수행하여 민원인의 민원과 관 련된 답변 관련 정보를 생성하거나 민원인의 감정을 분석하거나 혐오 언어 사용 여부 등 분석한다. 본 발명의 음성 분석부는 전달받은 음성 정보에 대해 STT(speech-to-text) 변환을 수행하여 음성에 대한 텍스트를 추출하고, 추출된 텍스트에 대해 인공지능 기반 대화의도 분석 모델을 이용하여 민원인의 민원 의도에 해당하는 엔티티(entity)를 추출한다. 변형 실시예로서, 본 발명의 음성 분석부는 STT 변환을 거치지 않고 인공지능 음성 인식 모델을 이용해서 전달받은 음성 정보로부터 바로 엔티티를 추출하도록 구성할 수도 있다. 본 발명의 인공지능 기반 대화의도 분석 모델은 특정 도메인의 민원 상담 내용을 기반으로 학습을 진행하여 생 성되고, 학습된 인공지능 기반 대화의도 분석 모델에 민원인이 발성한 음성 정보를 입력하여 엔티티를 추출한다. 본 발명의 인공지능 기반 대화의도 분석 모델은 특정 도메인에 특화된 데이터를 토대로 학습을 진행하여 구축할 수 있으며, 해당 특정 도메인의 동일 도메인 업종에서 통용되는 멀티턴 기반의 챗봇 시스템을 사용하여 구축될 수 있다.본 발명의 음성 분석부는 추출된 엔티티와 관련된 민원에 대한 답변 예시를 데이터베이스에서 검색하 여, 이를 민원인 대응 정보로서 후술할 표시부에게 전달한다. 즉, 민원인이 질문 하거나 민원 제기한 내용 과 관련된 엔티티에 대한 예시 답변 문장을 데이터베이스에서 불러와 이를 민원인 대응 정보로 생성하여 본 발명의 표시부로 전달한다. 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템의 데이터베이스는 특정 도메인에 특화된 내용으로 구축될 수 있다. 또한, 본 발명의 음성 분석부는 외부 서버(도면에 미도시됨)로 추출된 엔티티를 유무선 통신방식으로 전송 하고 해당 외부 서버로부터 엔티티에 대한 예시 답변 문장을 전달받아 이를 민원인 대응정보로 생성하여 본 발 명의 표시부로 전달할 수 있다. 이때 해당 외부 서버는 민원 관련 특정 도메인에 대해 인공지능 학습이 완 료된 서버일 수 있다. 민원 관련 중요 키워드 추출 및 정보 제공 본 발명의 음성 분석부는 전달받은 음성 정보에 대해 STT(speech-to-text) 변환을 수행하여 음성에 대한 텍스트를 추출하고, 추출된 텍스트에 대해 인공지능 기반 키워드 추출 모델을 이용하여 민원인과 상담원의 대화 에서 하나 이상의 상담 키워드(민원인과 상담원간 대화 중 핵심 내용과 관련된 중요 키워드를 의미함)를 추출한 다. 또는 본 발명의 음성 분석부는 STT 변환을 거치지 않고 인공지능 기반 키워드 추출 모델을 이용해서 전달받은 음성 정보로부터 바로 하나 이상의 키워드를 추출할 수 있다. 본 발명의 인공지능 기반 키워드 추출 모델은 특정 도메인의 민원 상담 내용을 기반으로 학습을 진행하여 생성 되고, 학습된 인공지능 기반 키워드 추출 모델에 민원인과 상담원이 발성한 음성 정보를 입력하여 하나 이상의 키워드를 추출한다. 본 발명의 음성 분석부는 추출된 키워드와 관련된 정보를 데이터베이스에서 검색하고, 이를 민원인 대응 정보로서 후술할 표시부에게 전달한다. 즉, 민원인과 상담원 사이 대화와 관련된 주요 키워드에 대한 정보를 데이터베이스에서 불러와 이를 민원인 대응 정보로 생성하여 본 발명의 표시부로 전달할 수 있다. 또한, 본 발명의 음성 분석부는 외부 서버(도면에 미도시됨)로 추출된 키워드를 유무선 통신방식으로 전송 하고 해당 외부 서버로부터 키워드와 관련된 정보를 전달받아 이를 민원인 대응정보로 생성하여 본 발명의 표시 부로 전달할 수 있다. 민원인 감정 상태 분석 본 발명의 음성 분석부는 전달받은 음성 정보에 대해 인공지능 기반 감정 분석 모델링을 수행하여 민원인 의 감정 상태에 대해 판단하고 이에 대한 정보를 민원인 대응정보에 포함하여 본 발명의 표시부로 전달할 수 있다. 즉, 본 발의 음성 분석부는 민원인의 감정이 정상 상태인지, 화난 상태이거나 분노 상태인지 등 을 판단해서 이를 상담원에게 전달할 수 있다. 또한 본 발명의 음성 분석부는 전달받은 음성 정보에 대해 STT(speech-to-text) 모델링을 수행하여 음성에 대한 텍스트를 추출하고, 추출된 텍스트와 전달받은 음성 정보에 대해 인공지능 기반 감정 분석 모델링을 수행 하여 민원인의 감정 상태에 대해 판단하고 이에 대한 정보를 민원인 대응정보에 포함하여 본 발명의 표시부 로 전달할 수 있다. 또한, 본 발명의 음성 분석부는 외부 서버(도면에 미도시됨)로 추출된 텍스트와 전달받은 음성 정보 중 적 어도 하나를 유무선 통신방식으로 전송하고 해당 외부 서버로부터 민원인에 대한 감정 상태 정보를 전달받아 이 를 민원인 대응정보로 생성하여 본 발명의 표시부로 전달할 수 있다. 혐오 발언 분석 및 차단 기술 본 발명의 음성 분석부는 전달받은 음성 정보에 대해 인공지능 기반 감정 언어 모델을 이용하여 민원인이 부적절한 언행을 발화했는지 여부를 판단하고 이에 기초하여 상담원 보호 모드 실행 여부를 결정하고 시행할 수있다. 예컨데, 민원인이 욕설, 비방, 조롱, 성희롱과 같은 혐오 언어를 사용하면 상담원 보호 필요가 있다고 판 단하고 상담원 보호 모드를 실행한다. 다른 실시예로서, 본 발명의 음성 분석부는 전달받은 음성 정보에 대해 STT(speech-to-text) 변환을 수행 하여 음성에 대한 텍스트를 추출하고, 추출된 텍스트와 전달받은 음성 정보에 대해 인공지능 기반 언어 모델을 이용하여 민원인이 발화하는 언행에 대해 판단하고 이에 기초하여 상담원 보호 모드 실행 여부를 결정하고 시행 할 수 있다. 이때 상담원 보호 모드 실행에 대해서는 상담원에게 본 발명의 표시부를 통해 상담원 보호 모드 실행 가능 함을 알려(민원인 대응정보에 포함하여 알림) 상담원이 직접 실행 여부를 결정하도록 구현될 수 있다. 상담원 보호 모드는 민원인에게의 법적 처벌 경고 안내, 경고 후 상담 강제 종료, 음성 안내 챗봇 전환 등을 포함한다. 또한, 본 발명의 음성 분석부는 외부 서버(도면에 미도시됨)로 추출된 텍스트와 전달받은 음성 정보 중 적 어도 하나를 유무선 통신방식으로 전송하고 해당 외부 서버로부터 민원인의 사용 언어 모델 정보와 상담원 보호 모드 실행 여부에 대한 정보를 전달받아 이를 민원인 대응정보로 생성하여 본 발명의 표시부로 전달할 수 있다. 도 2는 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 이용한 민원인 대화 의도 분석 방법 을 나타내는 흐름도이다. 음성 수신부를 이용하여 민원인의 음성을 수신하고(S210), 음성 분석부에서 전달받은 음성 정보에 대 해 STT(speech-to-text) 변환을 수행하여 음성에 대한 텍스트를 추출한다(S220). 추출된 텍스트에 대해 인공지 능 기반하여 대화의도를 분석하여 민원인의 민원 의도에 해당하는 엔티티(entity)를 추출한다(S230). 이때 STT 변환을 거치지 않고 인공지능 음성 인식 모델링을 이용해서 전달받은 음성 정보로부터 바로 엔티티를 추출할 수 있다. 추출된 엔티티와 관련된 민원에 대한 답변 예시를 데이터베이스에서 검색하고(S240), 검색된 답변 예시 문 장을 민원인 대응 정보로 생성하여 표시부로 제공한다(S250). 도 3는 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 이용한 민원인 상담 키워드 추출 방 법을 나타내는 흐름도이다. 음성 수신부를 이용하여 민원인 및 상담원의 음성을 수신하고(S310), 음성 분석부에서 전달받은 음성 정보에 대해 STT(speech-to-text) 변환을 수행하여 음성에 대한 텍스트를 추출한다(S320). 추출된 텍스트에 대 해 민원인과 상담원의 대화에서 하나 이상의 키워드를 추출한다(S330). 또는 본 발명의 음성 분석부는 STT 변환을 거치지 않고 인공지능 기반 키워드 추출 모델을 이용해서 전달받은 음성 정보로부터 곧바로 하나 이상의 키워드를 추출할 수 있다. 추출된 키워드와 관련된 정보를 데이터베이스에서 검색해서(S340) 이를 민원인 대응 정보에 포함하여 표시 부에게 제공한다(S350). 도 4는 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 이용한 민원인 감정 분석 방법을 나 타내는 흐름도이다. 음성 수신부를 이용하여 민원인의 음성을 수신하고(S410), 음성 분석부에서 전달받은 음성 정보에 대 해 인공지능 기반하여 감정을 분석하고(S420) 민원인의 감정 상태에 대해 판단한다(S430). 또는 음성 분석부 는 전달받은 음성 정보에 대해 STT 변환을 수행하여 음성에 대한 텍스트를 추출하고, 추출된 텍스트와 전 달받은 음성 정보에 대해 인공지능 기반 감정 분석 모델을 이행하여 민원인의 감정 상태에 대해 판단할 수 있다. 이후 판단된 민원인의 감정 상태를 민원인 대응정보에 포함하여 본 발명의 표시부로 제공한다(S440). 도 5는 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 이용한 민원인 언어모델분석 방법을 나타내는 흐름도이다. 음성 수신부를 이용하여 민원인의 음성을 수신하고(S510), 음성 분석부에서 전달받은 음성 정보에 대 해 인공지능 기반하여 민원인 발화 언행을 분석하고(S520) 그에 기초하여 보호모드 실행여부를 판단한다(S530). 또는 음성 분석부는 전달받은 음성 정보에 대해 STT 변환을 수행하여 음성에 대한 텍스트를 추출하고, 추 출된 텍스트와 전달받은 음성 정보에 대해 인공지능 기반 언어 모델을 이용하여 민원인의 사용 언어 모델에 대 해 판단할 수 있다. 판단결과에 기초하여 상담원 보호 모드 실행 여부를 결정하고 실행한다(S540). 도 6은 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 이용한 상담 보조 방법을 나타내는 흐름도이다. 음성 수신부를 이용하여 민원인 및/또는 상담원의 음성을 수신하고(S610), 음성 분석부에서 전달받은 음성 정보에 대해 STT 변환을 수행하여(S620) 음성에 대한 텍스트를 추출한다(S630). 추출된 텍스트에 대해 전 술한 인공지능 기반 분석하고(S640), 데이터베이스에서 관련 정보를 검색하여(S650) 검색된 결과를 민원인 대응정보로 표시부에 제공한다(S660). 또한 음성 수신부를 이용하여 수신한 민원인의 음성에 대해 도 4 및 도 5의 인공지능 기반 감정 및 언행 분석을 수행한다(S670). 수행 결과에 따라 민원인 감정상태에 대한 정보를 표시부로 제공하고 필요시 상담 원 보호 모드를 수행한다(S680). 이상의 실시예들은 하나 이상의 프로세서, 메모리, 및 저장수단을 포함하는 다양한 형태의 컴퓨팅 수단을 이용 하여 구현될 수 있다. 또한 유무선 네트워크에 연결된 네트워크 인터페이스를 포함할 수 있다. 상기 프로세서는 메모리 및/또는 저장 유닛에 저장된 처리 명령어를 실행하는 중앙 처리 유닛 또는 반도체 장치일 수 있다. 상기 메모리 및 상기 저장 유닛은 휘발성 저장 매체 또는 비 휘발성 저장 매체를 포함할 수 있다. 예컨대, 상기 메모 리는 ROM 및 RAM을 포함할 수 있다. 따라서, 본 발명의 실시예들은 컴퓨터로 구현하는 방법 또는 상기 컴퓨터상 에 저장된 컴퓨터 실행 가능 명령어를 가진 비(non)-일시적 컴퓨터 판독 가능 매체로서 구현될 수 있다. 본 발 명의 일 실시예에서, 프로세서에 의해 실행될 때, 컴퓨터 판독 가능 명령은 본 발명의 적어도 한 양태에 따른 방법을 수행할 수 있다. 이상, 본 발명의 바람직한 실시예를 통해 본 발명의 구성에 대하여 상세히 설명하였다. 그러나 전술한 실시예는"}
{"patent_id": "10-2022-0116291", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예시에 불과한 것으로서, 본 발명의 권리범위를 제한하지 아니한다. 본 발명의 기술분야에 통상의 지식을 가진 자라면 본 명세서의 교시와 시사로부터 본 발명의 기술적 사상의 범주내의 다양한 변형과 변경이 가능할 것이다. 예컨대, 음성 분석부 및 데이터베이스는 하나의 모듈로 통합되어 구현되거나 또는 둘이나 그 이상의 장치로 분할하여 구현될 수 있다. 따라서, 본 발명의 보호범위는 이하의 특허청구범위의 기재에 의하여 정하여짐이 마땅하다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2022-0116291", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 나타내는 구성도이다. 도 2는 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 이용한 민원인 대화 의도 분석 방법 을 나타내는 흐름도이다. 도 3는 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 이용한 민원인 상담 키워드 추출 방 법법을 나타내는 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 이용한 민원인 감정 분석 방법을 나 타내는 흐름도이다. 도 5는 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 시스템을 이용한 민원인 언어모델분석 방법을 나타내는 흐름도이다. 도 6은 본 발명의 일 실시예에 따른 인공지능을 활용한 상담 보조 방법을 나타내는 흐름도이다."}
