{"patent_id": "10-2019-0106851", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0107278", "출원번호": "10-2019-0106851", "발명의 명칭": "차량용 전자 장치 및 차량용 전자 장치의 동작 방법", "출원인": "엘지전자 주식회사", "발명자": "황인영"}}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량에 구비된 카메라에 의해 획득된 영상 데이터를 획득하고,상기 영상 데이터에서 검출된 외부인의 위치, 자세 및 제스쳐에 기초하여, 상기 외부인의 탑승 의사를판단하고,상기 탑승 의사에 기초하여, 차량의 정차를 위한 제어 신호를 생성하는 프로세서;를 포함하는 차량용 전자장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 프로세서는,차량에 구비되는 복수의 외부 디스플레이 중, 차량의 주행 방향에 따라 정보 표시 디스플레이를 선택하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 프로세서는,상기 정보 표시 디스플레이에, 차량 상황에 대한 정보가 표시되도록 신호를 제공하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 프로세서는,상기 정보 표시 디스플레이에, 목적지 정보, 경로 정보, 이용 가능한 시트 정보, 탑승 인원 정보, 특수 차량 여부에 대한 정보 중 적어도 어느 하나가 표시되도록 신호를 제공하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3항에 있어서,상기 프로세서는,주행중인 도로에서 차량의 정차 가능 공간의 존재 여부를 판단하고,상기 공간이 없는 것으로 판단되는 경우, 상기 정보 표시 디스플레이에, 차량의 이용 불가능 정보가 표시되도록신호를 제공하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2항에 있어서,상기 프로세서는,상기 정보 표시 디스플레이에, 상기 외부인과의 인터렉션을 위한 컨텐츠가 표시되도록 신호를 제공하는 차량용전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2019-0107278-3-제 1항에 있어서,상기 프로세서는,상기 외부인의 머리의 자세, 팔의 자세 및 몸통의 자세에 기초하여, 상기 외부인의 탑승 의사를 판단하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서,상기 프로세서는,상기 외부인이 개인용 단말기를 든채 웨이빙(waving)하는 제스쳐를 검출하는 경우, 상기 웨이빙하는 제스쳐를탑승 요구 의사로 판단하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7항에 있어서,상기 프로세서는,상기 외부인이 차도와 인도의 경계 주변에 위치한 상태에서 상기 웨이빙하는 제스쳐를 검출하는 경우, 상기 웨이빙하는 제스쳐를 탑승 요구 의사로 판단하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항에 있어서,상기 프로세서는,복수의 외부인이 검출되는 경우, 차량에 가장 근접한 제1 외부인에 우선권을 부여하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10항에 있어서,상기 프로세서는,상기 제1 외부인을 향해 광을 출력시키기 위한 신호를 생성하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1항에 있이서,상기 프로세서는,복수의 외부인으로 구성된 그룹을 검출하고, 상기 복수의 외부인간의 간격이 기준값 이하인 것으로 판단되는 경우, 상기 그룹을 탑승 요청 그룹으로 판단하는 차량용 전자 장치."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "적어도 하나의 프로세서가, 차량에 구비된 카메라에 의해 획득된 영상 데이터를 획득하는 단계;적어도 하나의 프로세서가, 상기 영상 데이터에서 검출된 외부인의 위치, 자세 및 제스쳐에 기초하여, 상기 외부인의 탑승 의사를 판단하는 단계; 및적어도 하나의 프로세서가, 상기 탑승 의사에 기초하여, 차량의 정차를 위한 제어 신호를 생성하는 단계;를 포함하는 차량용 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,적어도 하나의 프로세서가, 차량에 구비되는 복수의 외부 디스플레이 중, 차량의 주행 방향에 따라 정보 표시공개특허 10-2019-0107278-4-디스플레이를 선택하는 단계;를 더 포함하는 차량용 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서,적어도 하나의 프로세서가, 상기 정보 표시 디스플레이에, 차량 상황에 대한 정보가 표시되도록 신호를 제공하는 단계;를 더 포함하는 차량용 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 정보가 표시되도록 신호를 제공하는 단계는,적어도 하나의 프로세서가, 상기 정보 표시 디스플레이에, 목적지 정보, 경로 정보, 이용 가능한 시트 정보, 탑승 인원 정보, 특수 차량 여부에 대한 정보 중 적어도 어느 하나가 표시되도록 신호를 제공하는 단계;를 포함하는 차량용 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15항에 있어서,상기 정보가 표시되도록 신호를 제공하는 단계는,적어도 하나의 프로세서가, 주행중인 도로에서 차량의 정차 가능 공간의 존재 여부를 판단하는 단계; 및적어도 하나의 프로세서가, 상기 공간이 없는 것으로 판단되는 경우, 상기 정보 표시 디스플레이에, 차량의 이용 불가능 정보가 표시되도록 신호를 제공하는 단계;를 포함하는 차량용 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 13항에 있어서,상기 탑승 의사를 판단하는 단계는,적어도 하나의 프로세서가, 상기 외부인의 머리의 자세, 팔의 자세 및 몸통의 자세에 기초하여, 상기 외부인의탑승 의사를 판단하는 단계;를 포함하는 차량용 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 13항에 있어서,상기 탑승 의사를 판단하는 단계는,적어도 하나의 프로세서가, 상기 외부인이 개인용 단말기를 든채 웨이빙하는 제스쳐를 검출하는 경우, 상기 웨이빙하는 제스쳐를 탑승 요구 의사로 판단하는 단계;를 포함하는 차량용 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0106851", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19항에 있어서,상기 탑승 요구 의사로 판단하는 단계는,적어도 하나의 프로세서가, 상기 외부인이 차도와 인도의 경계 주변에 위치한 상태에서 상기 웨이빙하는 제스쳐를 검출하는 경우, 상기 웨이빙하는 제스쳐를 탑승 요구 의사로 판단하는 단계를 포함하는 차량용 전자 장치의동작 방법."}
{"patent_id": "10-2019-0106851", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 차량에 구비된 카메라에 의해 획득된 영상 데이터를 획득하고, 상기 영상 데이터에서 검출된 외부인의 위치, 자세 및 제스쳐에 기초하여, 상기 외부인의 탑승 의사를 판단하고, 상기 탑승 의사에 기초하여, 차량의 정 차를 위한 제어 신호를 생성하는 프로세서;를 포함하는 차량용 전자 장치에 관한 것이다."}
{"patent_id": "10-2019-0106851", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량용 전자 장치 및 차량용 전자 장치의 동작 방법에 관한 것이다."}
{"patent_id": "10-2019-0106851", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "차량은 탑승하는 사용자가 원하는 방향으로 이동시키는 장치이다. 대표적으로 자동차를 예를 들 수 있다. 자율 주행 차량은 인간의 운전 조작 없이 자동으로 주행할 수 있는 차량을 의미한다. 최근에는 공유형 자율 주행 차량까지 등장하고 있는데, 종래 기술에 따른 공유형 자율 주행 차량은 사전에 예약 된 사람만 탑승 가능하다. 경우에 따라서 거리에서 공유형 자율 주행 차량을 탑승하고자 하는 사람도 있는데, 이러한 사람도 이용 가능한 공유형 자율 주행 차량에 대한 개발이 필요하다."}
{"patent_id": "10-2019-0106851", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 문제점을 해결하기 위하여, 영상 데이터에서 검출된 외부인의 탑승 의사를 판단하여, 차량을 정차하기 위한 제어 신호를 생성하는 차량용 전자 장치를 제공하는데 목적이 있다. 또한, 본 발명은, 영상 데이터에서 검출된 외부인의 탑승 의사를 판단하여, 차량을 정차하기 위한 제어 신호를 생성하는 차량용 전자 장치의 동작 방법을 제공하는데 목적이 있다. 본 발명의 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재 로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0106851", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 달성하기 위하여, 본 발명의 실시예에 따른 차량용 전자 장치는, 차량에 구비된 카메라에 의해 획 득된 영상 데이터를 획득하고, 상기 영상 데이터에서 검출된 외부인의 위치, 자세 및 제스쳐에 기초하여, 상기 외부인의 탑승 의사를 판단하고, 상기 탑승 의사에 기초하여, 차량의 정차를 위한 제어 신호를 생성하는 프로세 서;를 포함한다. 본 발명의 실시예에 따른 차량용 전자 장치의 동작 방법은, 적어도 하나의 프로세서가, 차량에 구비된 카메라에 의해 획득된 영상 데이터를 획득하는 단계; 적어도 하나의 프로세서가, 상기 영상 데이터에서 검출된 외부인의 위치, 자세 및 제스쳐에 기초하여, 상기 외부인의 탑승 의사를 판단하는 단계; 및 적어도 하나의 프로세서가, 상기 탑승 의사에 기초하여, 차량의 정차를 위한 제어 신호를 생성하는 단계;를 포함한다. 기타 실시예들의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2019-0106851", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 다음과 같은 효과가 하나 혹은 그 이상 있다. 첫째, 미리 예약된 사람외에도, 길거리에서 공유형 자율 주행 차량을 발견한 사람도 공유형 자율 주행 차량을 이용할 수 있는 효과가 있다. 둘째, 여러 상황에 맞춘 서비스를 제공함으로써 사용자의 편의성이 증대되는 효과가 있다."}
{"patent_id": "10-2019-0106851", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0106851", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다.도 1은 본 발명의 실시예에 따른 차량을 도시한 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 차량은, 도로나 선로 위를 달리는 수송 수단으로 정의된다. 차 량은, 자동차, 기차, 오토바이를 포함하는 개념이다. 차량은, 동력원으로서 엔진을 구비하는 내연기관 차량, 동력원으로서 엔진과 전기 모터를 구비하는 하이브리드 차량, 동력원으로서 전기 모터를 구비하는 전기 차량등을 모두 포함하는 개념일 수 있다. 차량은, 공유형 차량일 수 있다. 차량은 자율 주행 차량일 수 있다. 차량에는 전자 장치가 포함될 수 있다. 한편, 차량은, 적어도 하나의 로봇(robot)과 상호 작용할 수 있다. 로봇은, 자력으로 주행이 가능한 이동 로봇(Autonomous Mobile Robot, AMR)일 수 있다. 이동 로봇은, 스스로 이동이 가능하여 이동이 자유롭고, 주행 중 장애물 등을 피하기 위한 다수의 센서가 구비되어 장애물을 피해 주행할 수 있다. 이동 로봇은, 비행 장치를 구비하는 비행형 로봇(예를 들면, 드론)일 수 있다. 이동 로봇은, 적어도 하나의 바퀴를 구비하고, 바퀴의 회전 을 통해 이동되는 바퀴형 로봇일 수 있다. 이동 로봇은, 적어도 하나의 다리를 구비하고, 다리를 이용해 이동되 는 다리식 로봇일 수 있다. 로봇은 차량 사용자의 편의를 보완하는 장치로 기능할 수 있다. 예를 들면, 로봇은, 차량에 적재된 짐 을 사용자의 최종 목적지까지 이동하는 기능을 수행할 수 있다. 예를 들면, 로봇은, 차량에서 하차한 사용 자에게 최종 목적지까지 길을 안내하는 기능을 수행할 수 있다. 예를 들면, 로봇은, 차량에서 하차한 사용 자를 최종 목적지까지 수송하는 기능을 수행할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 통신 장치를 통해, 로봇과 통신을 수행할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 로봇에 차량에 포함되는 적어도 하나의 전자 장치에서 처리한 데 이터를 제공할 수 있다. 예를 들면, 차량에 포함되는 적어도 하나의 전자 장치는, 오브젝트 데이터, HD 맵 데이 터, 차량 상태 데이터, 차량 위치 데이터 및 드라이빙 플랜 데이터 중 적어도 어느 하나를 로봇에 제공할 수 있 다. 차량에 포함되는 적어도 하나의 전자 장치는, 로봇으로부터, 로봇에서 처리된 데이터를 수신할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 로봇에서 생성된 센싱 데이터, 오브젝트 데이터, 로봇 상태 데이터, 로봇 위치 데이터 및 로봇의 이동 플랜 데이터 중 적어도 어느 하나를 수신할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 로봇으로부터 수신된 데이터에 더 기초하여, 제어 신호를 생성할 수 있다. 예를 들면, 차량에 포함되는 적어도 하나의 전자 장치는, 오브젝트 검출 장치에 생성된 오브젝트 에 대한 정보와 로봇에 의해 생성된 오브젝트에 대한 정보를 비교하고, 비교 결과에 기초하여, 제어 신호를 생 성할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 차량의 이동 경로와 로봇의 이동 경로간의 간 섭이 발생되지 않도록, 제어 신호를 생성할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 인공 지능(artificial intelligence, AI)를 구현하는 소프트웨어 모듈 또는 하드웨어 모듈(이하, 인공 지능 모듈)을 포함할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치 는, 획득되는 데이터를 인공 지능 모듈에 입력(input)하고, 인공 지능 모듈에서 출력(output)되는 데이터를 이 용할 수 있다. 인공 지능 모듈은, 적어도 하나의 인공 신경망(artificial neural network, ANN)을 이용하여, 입력되는 데이터 에 대한 기계 학습(machine learning)을 수행할 수 있다. 인공 지능 모듈은, 입력되는 데이터에 대한 기계 학습 을 통해, 드라이빙 플랜 데이터를 출력할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 인공 지능 모듈에서 출력되는 데이터에 기초하여, 제어 신호를 생 성할 수 있다. 실시예에 따라, 차량에 포함되는 적어도 하나의 전자 장치는, 통신 장치를 통해, 외부 장치로부터, 인공 지능에 의해 처리된 데이터를 수신할 수 있다. 차량에 포함되는 적어도 하나의 전자 장치는, 인공 지능에 의해 처리된 데이터에 기초하여, 제어 신호를 생성할 수 있다. 도 2는 본 발명의 실시예에 따른 차량의 내부를 도시한 도면이다. 도 3은 본 발명의 실시에에 따른 차량용 캐빈 시스템을 설명하는데 참조되는 블럭도이다. 도 4a 내지 도 4c는 본 발명의 실시예에 따른 입력 장치를 설명하는데 참조되는 도면이다. 도 5는 본 발명의 실시예에 따라 통신 장치와 이동 단말기의 통신 동작을 설명하는데 참조되는 도면이다. 도 6은 본 발명의 실시예에 따른 디스플레이 시스템을 설명하는데 참조되는 도면이다. 도 7은 본 발명의 실시예에 따른 카고 시스템을 설명하는데 참조되는 도면이다. 도 8은 본 발명의 실시예에 다른 시트 시스템을 설명하는데 참조되는 도면이다. 도 9는 본 발명의 실시예에 따른 페이먼트 시스템을 설명하는데 참조되는 도면이다. 도 2 내지 도 9를 참조하면, 차량용 캐빈 시스템(이하, 캐빈 시스템)은 차량을 이용하는 사용자를 위 한 편의 시스템으로 정의될 수 있다. 캐빈 시스템은, 디스플레이 시스템, 카고 시스템, 시트 시 스템 및 페이 먼트 시스템을 포함하는 최상위 시스템으로 설명될 수 있다. 캐빈 시스템은, 메인 컨트롤러, 메모리, 인터페이스부, 전원 공급부, 입력 장치, 영상 장치, 통신 장치, 디스플레이 시스템, 음향 출력부, 카고 시스템, 시트 시스템 및 페이먼트 시스 템을 포함할 수 있다. 실시예에 따라, 캐빈 시스템은, 본 명세서에서 설명되는 구성 요소외에 다른 구성 요소를 더 포함하거나, 설명되는 구성 요소 중 일부를 포함하지 않을 수 있다. 메인 컨트롤러는, 입력 장치, 통신 장치, 디스플레이 시스템, 카고 시스템, 시트 시 스템 및 페이먼트 시스템과 전기적으로 연결되어 신호를 교환할 수 있다. 메인 컨트롤러는, 입 력 장치, 통신 장치, 디스플레이 시스템, 카고 시스템, 시트 시스템 및 페이먼트 시 스템을 제어할 수 있다. 메인 컨트롤러는, ASICs (application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기(controllers), 마이크로 컨 트롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행을 위한 전기적 유닛 중 적 어도 하나를 이용하여 구현될 수 있다. 메인 컨트롤러는, 적어도 하나의 서브 컨트롤러로 구성될 수 있다. 실시예에 따라, 메인 컨트롤러는, 복수의 서브 컨트롤러를 포함할 수 있다. 복수의 서브 컨트롤러는 각각이, 그루핑된 캐빈 시스템에 포함된 장치 및 시스템을 개별적으로 제어할 수 있다. 캐빈 시스템에 포함된 장치 및 시스템은, 기능별로 그루핑 되거나, 착좌 가능한 시트를 기준으로 그루핑될 수 있다. 메인 컨트롤러는, 적어도 하나의 프로세서를 포함할 수 있다. 도 3에는 메인 컨트롤러가 하나의 프로세서를 포함하는 것으로 예시되나, 메인 컨트롤러는, 복수의 프로세서를 포함할 수도 있다. 프로 세서는, 상술한 서브 컨트롤러 중 어느 하나로 분류될 수도 있다. 프로세서는, 통신 장치를 통해, 제1 사용자에 대한 제1 정보 및 제2 사용자에 대한 제2 정보를 획득 할 수 있다. 제1 사용자의 제1 이동 단말기는, 캐빈 시스템에 제1 정보를 전송할 수 있다. 제2 사용자의 제2 이동 단말기는, 캐빈 시스템에 제2 정보를 전송할 수 있다. 통신 장치는, 제1 정보 및 제2 정보 를 수신하여 프로세서에 제공할 수 있다. 프로세서는, 내부 카메라 및 외부 카메라 중 적어도 어느 하나에서 수신되는 영상 데이터에 기 초하여, 제1 사용자 및 제2 사용자 각각을 특정할 수 있다. 프로세서는, 영상 데이터에 영상 처리 알고리 즘을 적용하여 제1 사용자 및 제2 사용자를 특정할 수 있다. 예를 들면, 프로세서는, 제1 정보 및 제2 정 보와 영상 데이터를 비교하여 제1 사용자 및 제2 사용자를 특정할 수 있다. 예를 들면, 제1 정보는, 제1 사용자 의 경로 정보, 신체 정보, 동승자 정보, 짐 정보, 위치 정보, 선호하는 컨텐츠 정보, 선호하는 음식 정보, 장애 여부 정보 및 이용 이력 정보 중 적어도 어느 하나를 포함할 수 있다. 예를 들면, 제2 정보는, 제2 사용자의 경 로 정보, 신체 정보, 동승자 정보, 짐 정보, 위치 정보, 선호하는 컨텐츠 정보, 선호하는 음식 정보, 장애 여부 정보 및 이용 이력 정보 중 적어도 어느 하나를 포함할 수 있다. 프로세서는, 입력 장치에 의해 생성되는 전기적 신호에 기초하여, 사용자에게 컨텐츠가 제공되도록 디스플레이 및 스피커 중 적어도 어느 하나에 제어 신호를 제공할 수 있다. 프로세서는, 제1 정보에 따라 복수의 시트 중 제1 사용자의 제1 탑승 시트를 결정할 수 있다. 프로세서 는, 제1 정보에 따라 제1 탑승 시트의 자세를 결정할 수 있다. 프로세서는, 제2 정보에 따라 복수의 시트 중 제2 사용자의 제2 탑승 시트를 결정할 수 있다. 프로세서는, 제2 정보에 따라 제2 탑승 시트의 자세를 결정할 수 있다. 프로세서는, 통신 장치, 내부 카메라, 외부 카메라, 입력 장치, 디스플레이 시스템 의 디스플레이, 음향 출력부의 스피커, 카고 시스템, 시트 시스템의 복수의 시트 중 적어 도 어느 하나로부터 수신되는 전기적 신호에 기초하여, 서비스 요금을 결정할 수 있다. 프로세서는, 결정 된 서비스 요금이 과금되도록 페이먼트 시스템에 신호를 제공할 수 있다. 메인 컨트롤러는, 인공지능 에이전트(artificial intelligence agent)를 포함할 수 있다. 인공지능 에이전트는, 입력 장치를 통해 획득된 데이터를 기초로 기계 학습(machine learning)을 수행할 수 있 다. 인공지능 에이전트는, 기계 학습된 결과에 기초하여, 디스플레이 시스템, 음향 출력부, 카 고 시스템, 시트 시스템 및 페이먼트 시스템 중 적어도 어느 하나를 제어할 수 있다. 한편, 메인 컨트롤러는, 차량용 전자 장치로 이해될 수 있다. 전자 장치는, 인터페이스부 및 프로세 서를 포함할 수 있다. 전자 장치의 인터페이스부는, 외부 디바이스와 신호를 교환하는 통신 장치 , 캐빈 내의 영상을 촬영하는 적어도 하나의 내부 카메라, 차량 외부 영상을 촬영하는 적어도 하나의 외부 카메라, 사용자 입력을 전기적 신호로 전환하는 입력 장치, 시각적 컨텐츠를 출력하는 적어도 하나의 디스플레이, 청각적 컨텐츠를 출력하는 적어도 하나의 스피커 및 복수의 사용자가 각각 촥좌할 수 있는 복수의 시트 중 적어도 어느 하나와 신호를 교환할 수 있다. 전자 장치의 프로세서는, 상기 통신 장 치를 통해, 제1 사용자에 대한 제1 정보 및 제2 사용자에 대한 제2 정보를 획득하고, 상기 내부 카메라 및 외부 카메라 중 적어도 어느 하나로부터 수신되는 영상 데이터에 기초하여, 상기 제1 사용자 및 상기 제2 사용자 각 각을 특정하고, 상기 입력 장치에 의해 생성되는 전기적 신호에 기초하여 사용자에게 컨텐츠가 제공되도록 상기 디스플레이 및 상기 스피커 중 적어도 어느 하나에 제어 신호를 제공하고, 상기 제1 정보에 따라 상기 복수의 시트 중 상기 제1 사용자의 제1 탑승 시트를 결정하고, 상기 제2 정보에 따라 상기 복수의 시트 중 상기 제2 사 용자의 제2 탑승 시트를 결정하고, 상기 제1 정보에 따라 상기 제1 탑승 시트의 자세를 결정하고, 상기 제2 정 보에 따라 상기 제2 탑승 시트의 자세를 설정할 수 있다. 메모리는, 메인 컨트롤러와 전기적으로 연결된다. 메모리는 유닛에 대한 기본데이터, 유닛의 동 작제어를 위한 제어데이터, 입출력되는 데이터를 저장할 수 있다. 메모리는, 메인 컨트롤러에서 처리 된 데이터를 저장할 수 있다. 메모리는, 하드웨어적으로, ROM, RAM, EPROM, 플래시 드라이브, 하드 드라이 브 중 적어도 어느 하나로 구성될 수 있다. 메모리는 메인 컨트롤러의 처리 또는 제어를 위한 프로그 램 등, 캐빈 시스템 전반의 동작을 위한 다양한 데이터를 저장할 수 있다. 메모리는, 메인 컨트롤러 와 일체형으로 구현될 수 있다. 인터페이스부는, 차량 내에 구비되는 적어도 하나의 전자 장치와 유선 또는 무선으로 신호를 교환할 수 있다. 인터페이스부는, 통신 모듈, 단자, 핀, 케이블, 포트, 회로, 소자 및 장치 중 적어도 어느 하나 로 구성될 수 있다. 전원 공급부는, 캐빈 시스템에 전원을 공급할 수 있다. 전원 공급부는, 차량에 포함된 파워 소스(예를 들면, 배터리)로부터 전원을 공급받아, 캐빈 시스템의 각 유닛에 전원을 공급할 수 있다. 전원 공급부는, 메인 컨트롤러로부터 제공되는 제어 신호에 따라 동작될 수 있다. 예를 들면, 전원 공급부 는, SMPS(switched-mode power supply)로 구현될 수 있다. 캐빈 시스템은, 적어도 하나의 인쇄 회로 기판(printed circuit board, PCB)을 포함할 수 있다. 메인 컨 트롤러, 메모리, 인터페이스부 및 전원 공급부는, 적어도 하나의 인쇄 회로 기판에 실장될 수 있다. 입력 장치는, 사용자 입력을 수신할 수 있다. 입력 장치는, 사용자 입력을 전기적 신호로 전환할 수 있다. 입력 장치에 의해 전환된 전기적 신호는 제어 신호로 전환되어 디스플레이 시스템, 음향 출력 부, 카고 시스템, 시트 시스템 및 페이먼트 시스템 중 적어도 어느 하나에 제공될 수 있다. 메인 컨트롤러 또는 캐빈 시스템에 포함되는 적어도 하나의 프로세서는 입력 장치로부터 수신되는 전기적 신호에 기초한 제어 신호를 생성할 수 있다. 입력 장치는, 터치 입력부, 제스쳐 입력부, 기계식 입력부 및 음성 입력부 중 적어도 어느 하나를 포함할 수 있다. 도 4a에 예시된 바와 같이, 터치 입력부는, 사용자의 터치 입력을 전기적 신호로 전환할 수 있다. 터치 입 력부는, 사용자의 터치 입력을 감지하기 위해 적어도 하나의 터치 센서를 포함할 수 있다. 실시예에따라, 터치 입력부는 디스플레이 시스템에 포함되는 적어도 하나의 디스플레이 와 일체형으로 형성됨 으로써, 터치 스크린을 구현할 수 있다. 이러한, 터치 스크린은, 캐빈 시스템과 사용자 사이의 입력 인터 페이스 및 출력 인터페이스를 함께 제공할 수 있다. 도 4a에 예시된 바와 같이, 제스쳐 입력부는, 사용자의 제스쳐 입력을 전기적 신호로 전환할 수 있다. 제 스쳐 입력부는, 사용자의 제스쳐 입력을 감지하기 위한 적외선 센서 및 이미지 센서 중 적어도 어느 하나를 포함할 수 있다. 실시예에 따라, 제스쳐 입력부는, 사용자의 3차원 제스쳐 입력을 감지할 수 있다. 이를 위해, 제스쳐 입력부는, 복수의 적외선 광을 출력하는 광출력부 또는 복수의 이미지 센서를 포함할 수 있다. 제스쳐 입력부는, TOF(Time of Flight) 방식, 구조광(Structured light) 방식 또는 디스패러티 (Disparity) 방식을 통해 사용자의 3차원 제스쳐 입력을 감지할 수 있다. 도 4a에 예시된 바와 같이, 기계식 입력부는, 기계식 장치를 통한 사용자의 물리적인 입력(예를 들면, 누름 또는 회전)을 전기적 신호로 전환할 수 있다. 기계식 입력부는, 버튼, 돔 스위치(dome switch), 조그 휠 및 조그 스위치 중 적어도 어느 하나를 포함할 수 있다. 한편, 제스쳐 입력부와 기계식 입력부는 일체형으로 형성될 수 있다. 예를 들면, 입력 장치는, 제스쳐 센서가 포함되고, 주변 구조물(예를 들면, 시트, 암레스트 및 도어 중 적어도 어느 하나)의 일부분에서 출납 가능하게 형성된 조그 다이얼 장치를 포함할 수 있다. 조그 다이얼 장치가 주변 구조물과 평평한 상태를 이룬 경우, 조그 다이얼 장치는 제스쳐 입력부로 기능할 수 있다. 조그 다이얼 장치가 주변 구조물에 비해 돌출된 상태의 경우, 조그 다이얼 장치는 기계식 입력부로 기능할 수 있다. 도 4b에 예시된 바와 같이, 음성 입력부는, 사용자의 음성 입력을 전기적 신호로 전환할 수 있다. 음성 입 력부는, 적어도 하나의 마이크로 폰을 포함할 수 있다. 음성 입력부는, 빔 포밍 마이크(Beam foaming MIC)를 포함할 수 있다. 영상 장치는, 적어도 하나의 카메라를 포함할 수 있다. 영상 장치는, 내부 카메라 및 외부 카메 라 중 적어도 어느 하나를 포함할 수 있다. 내부 카메라는, 캐빈 내의 영상을 촬영할 수 있다. 외부 카메라는, 차량 외부 영상을 촬영할 수 있다. 도 4c에 예시된 바와 같이, 내부 카메라는, 캐빈 내의 영상을 획득할 수 있다. 영상 장치는, 적어도 하나의 내부 카메라를 포함할 수 있다. 영상 장치는, 탑승 가능 인원에 대응되는 갯수의 카메라(25 1)를 포함하는 것이 바람직하다. 영상 장치는, 내부 카메라에 의해 획득된 영상을 제공할 수 있다. 메인 컨트롤러 또는 캐빈 시스템에 포함되는 적어도 하나의 프로세서는, 내부 카메라에 의해 획 득된 영상에 기초하여 사용자의 모션을 검출하고, 검출된 모션에 기초하여 신호를 생성하여, 디스플레이 시스템 , 음향 출력부, 카고 시스템, 시트 시스템 및 페이먼트 시스템 중 적어도 어느 하나 에 제공할 수 있다. 외부 카메라는, 차량 외부 영상을 획득할 수 있다. 영상 장치는, 적어도 하나의 내부 카메라를 포함할 수 있다. 영상 장치는, 탑승 도어에 대응되는 갯수의 카메라를 포함하는 것이 바람직하다. 영 상 장치는, 외부 카메라에 의해 획득된 영상을 제공할 수 있다. 메인 컨트롤러 또는 캐빈 시스 템에 포함되는 적어도 하나의 프로세서는, 외부 카메라에 의해 획득된 영상에 기초하여 사용자 정보 를 획득할 수 있다. 메인 컨트롤러 또는 캐빈 시스템에 포함되는 적어도 하나의 프로세서는, 사용자 정보에 기초하여, 사용자를 인증하거나, 사용자의 신체 정보(예를 들면, 신장 정보, 체중 정보 등), 사용자의 동승자 정보, 사용자의 짐 정보 등을 획득할 수 있다. 도 3은, 입력 장치가 메인 컨트롤러에 직접 연결된 것으로 예시하나, 입력 장치는, 인터페이스 부를 매개로 메인 컨트롤러에 연결될 수도 있다. 통신 장치는, 외부 디바이스와 무선으로 신호를 교환할 수 있다. 통신 장치는, 네트워크 망을 통해 외부 디바이스와 신호를 교환하거나, 직접 외부 디바이스와 신호를 교환할 수 있다. 외부 디바이스는, 서버, 이 동 단말기 및 타 차량 중 적어도 어느 하나를 포함할 수 있다. 도 5에 예시된 바와 같이, 통신 장치는, 적 어도 하나의 이동 단말기와 신호를 교환할 수 있다. 통신 장치는, 통신을 수행하기 위해 안테나, 적어도 하나의 통신 프로토콜이 구현 가능한 RF(Radio Frequency) 회로 및 RF 소자 중 적어도 어느 하나를 포함할 수 있다. 실시예에 따라, 통신 장치는, 복수의 통신 프로토콜을 이용할 수도 있다. 통신 장치는, 이동 단말기와의 거리에 따라 통신 프로토콜을 전환할수 있다. 도 3은, 통신 장치가 메인 컨트롤러에 직접 연결된 것으로 예시하나, 통신 장치는, 인터페이스 부를 매개로 메인 컨트롤러에 연결될 수도 있다. 도 2 및 도 6에 예시된 바와 같이, 디스플레이 시스템은, 그래픽 객체를 표시할 수 있다. 디스플레이 시스 템은, 제1 디스플레이 장치, 및 제2 디스플레이 장치를 포함할 수 있다. 제1 디스플레이 장치는, 시각적 컨텐츠를 출력하는 적어도 하나의 디스플레이를 포함할 수 있다. 제1 디스플레이 장치에 포함되는 디스플레이는, 평면 디스플레이. 곡면 디스플레이, 롤러블 디스플레이 및 플렉서블 디스플레이 중 적어도 어느 하나로 구현될 수 있다. 예를 들면, 제1 디스플레이 장치는, 시트 후방에 위치하고, 캐빈 내로 출납 가능하게 형성된 제1 디스플레 이 및 상기 제1 디스플레이를 이동시키기 위한 제1 메카니즘를 포함할 수 있다. 제1 디스플레이(41 1)는, 시트 메인 프레임에 형성된 슬롯에 출납 가능하게 배치될 수 있다. 실시예에 따라, 제1 디스플레이 장치 는, 플렉서블 영역 조절 메카니즘을 더 포함할 수 있다. 제1 디스플레이는, 플렉서블하게 형성될 수 있고, 사용자의 위치에 따라, 제1 디스플레이의 플렉서블 영역이 조절될 수 있다. 예를 들면, 제1 디스플레이 장치는, 캐빈내 천장에 위치하고, 롤러블(rollable)하게 형성된 제2 디스플레 이 및 상기 제2 디스플레이를 감거나 풀기 위한 제2 메카니즘을 포함할 수 있다. 제2 디스플레이는, 양면에 화 면 출력이 가능하게 형성될 수 있다. 예를 들면, 제1 디스플레이 장치는, 캐빈내 천장에 위치하고, 플렉서블(flexible)하게 형성된 제3 디스플 레이 및 상기 제3 디스플레이를 휘거나 펴기위한 제3 메카니즘을 포함할 수 있다. 실시예에 따라, 디스플레이 시스템은, 제1 디스플레이 장치 및 제2 디스플레이 장치 중 적어도 어느 하나에 제어 신호를 제공하는 적어도 하나의 프로세서를 더 포함할 수 있다. 디스플레이 시스템에 포 함되는 프로세서는, 메인 컨트롤러, 입력 장치, 영상 장치 및 통신 장치 중 적어도 어느 하나로부터 수신되는 신호에 기초하여 제어 신호를 생성할 수 있다. 제1 디스플레이 장치에 포함되는 디스플레이의 표시 영역은, 제1 영역(411a) 및 제2 영역(411b)으로 구분 될 수 있다. 제1 영역(411a)은, 컨텐츠를 표시 영역으로 정의될 수 있다. 예를 들면, 제 1영역은, 엔터테 인먼트 컨텐츠(예를 들면, 영화, 스포츠, 쇼핑, 음악 등), 화상 회의, 음식 메뉴 및 증강 현실 화면에 대응하는 그래픽 객체 중 적어도 어느 하나를 표시할 수 있다. 제1 영역(411a)은, 차량의 주행 상황 정보에 대응하는 그래픽 객체를 표시할 수 있다. 주행 상황 정보는, 주행 상황 정보는, 차량 외부의 오브젝트 정보, 내비게이션 정보 및 차량 상태 정보 중 적어도 어느 하나를 포함할 수 있다. 차량 외부의 오브젝트 정보는, 오브젝트의 존 재 유무에 대한 정보, 오브젝트의 위치 정보, 차량과 오브젝트와의 거리 정보 및 차량과 오브젝트와 의 상대 속도 정보를 포함할 수 있다. 내비게이션 정보는, 맵(map) 정보, 설정된 목적지 정보, 상기 목적지 설 정 따른 경로 정보, 경로 상의 다양한 오브젝트에 대한 정보, 차선 정보 및 차량의 현재 위치 정보 중 적어도 어느 하나를 포함할 수 있다. 차량 상태 정보는, 차량의 자세 정보, 차량의 속도 정보, 차량의 기울기 정보, 차 량의 중량 정보, 차량의 방향 정보, 차량의 배터리 정보, 차량의 연료 정보, 차량의 타이어 공기압 정보, 차량 의 스티어링 정보, 차량 실내 온도 정보, 차량 실내 습도 정보, 페달 포지션 정보 및 차량 엔진 온도 정보 등을 포함할 수 있다. 제2 영역(411b)은, 사용자 인터페이스 영역으로 정의될 수 있다. 예를 들면, 제2 영역(411b)은, 인공 지능 에이전트 화면을 출력할 수 있다. 실시예에 따라, 제2 영역(411b)은, 시트 프레임으로 구분되는 영역에 위치할 수 있다. 이경우, 사용자는, 복수의 시트 사이로 제2 영역(411b)에 표시되는 컨텐츠를 바라볼 수 있다. 실시예에 따라, 제1 디스플레이 장치는, 홀로그램 컨텐츠를 제공할 수 있다. 예를 들면, 제1 디스플레이 장치는, 복수의 사용자별로 홀로그램 컨텐츠를 제공하여 컨텐츠를 요청한 사용자만 해당 컨텐츠를 시청하 게 할 수 있다. 제2 디스플레이 장치는, 적어도 하나의 디스플레이을 포함할 수 있다. 제2 디스플레이 장치는, 개개의 탑승자만 디스플레이 내용을 확인할 수 있는 위치에 디스플레이을 제공할 수 있다. 예를 들면, 디 스플레이은, 시트의 암 레스트에 배치될 수 있다. 제2 디스플레이 장치는, 사용자의 개인 정보에 대 응되는 그래픽 객체를 표시할 수 있다. 제2 디스플레이 장치는, 탑승 가능 인원에 대응되는 갯수의 디스플 레이을 포함할 수 있다. 제2 디스플레이 장치는, 터치 센서와 상호 레이어 구조를 이루거나 일체형으 로 형성됨으로써, 터치 스크린을 구현할 수 있다. 제2 디스플레이 장치는, 시트 조정 또는 실내 온도 조정의 사용자 입력을 수신하기 위한 그래픽 객체를 표시할 수 있다. 도 3은, 디스플레이 시스템이 메인 컨트롤러에 직접 연결된 것으로 예시하나, 디스플레이 시스템 은, 인터페이스부를 매개로 메인 컨트롤러에 연결될 수도 있다. 음향 출력부는, 전기적 신호를 오디오 신호로 전환할 수 있다. 음향 출력부는, 청각적 컨텐츠를 출력 하는 적어도 하나의 스피커를 포함할 수 있다. 예를 들면, 음향 출력부는, 탑승 가능한 시트별로 구비된 복수의 스피커를 포함할 수 있다. 도 7에 예시된 바와 같이, 카고 시스템은, 사용자의 요청에 따라 상품을 사용자에게 제공할 수 있다. 카고 시스템은, 입력 장치 또는 통신 장치에 의해 생성되는 전기적 신호에 기초하여 동작될 수 있다. 카고 시스템은, 카고 박스를 포함할 수 있다. 카고 박스는, 상품들이 적재된 상태로 시트 하단의 일 부분 에 은닉될 수 있다. 사용자 입력에 기초한 전기적 신호가 수신되는 경우, 카고 박스는, 캐빈으로 노출될 수 있 다. 사용자는 노출된 카고 박스에 적재된 물품 중 필요한 상품을 선택할 수 있다. 카고 시스템은, 사용자 입력에 따른 카고 박스의 노출을 위해, 슬라이딩 무빙 메카니즘, 상품 팝업 메카니즘을 포함할 수 있다. 카고 시스템은은, 다양한 종류의 상품을 제공하기 위해 복수의 카고 박스를 포함할 수 있다. 카고 박스에는, 상 품별로 제공 여부를 판단하기 위한 무게 센서가 내장될 수 있다. 도 3은, 카고 시스템이 메인 컨트롤러에 직접 연결된 것으로 예시하나, 카고 시스템은, 인터페 이스부를 매개로 메인 컨트롤러에 연결될 수도 있다. 도 8에 예시된 바와 같이, 시트 시스템은, 사용자에 맞춤형 시트를 사용자에게 제공할 수 있다. 시트 시스 템은, 입력 장치 또는 통신 장치에 의해 생성되는 전기적 신호에 기초하여 동작될 수 있다. 시 트 시스템은, 획득된 사용자 신체 데이터에 기초하여, 시트의 적어도 하나의 요소를 조정할 수 있다. 시트 시스템은 사용자의 착좌 여부를 판단하기 위한 사용자 감지 센서(예를 들면, 압력 센서)를 포함할 수 있다. 시트 시스템은, 복수의 사용자가 각각 착좌할 수 있는 복수의 시트를 포함할 수 있다. 복수의 시트 중 어 느 하나는 적어도 다른 하나와 마주보게 배치될 수 있다. 캐빈 내부의 적어도 두명의 사용자는 서로 마주보고 앉을 수 있다. 도 3은, 시트 시스템이 메인 컨트롤러에 직접 연결된 것으로 예시하나, 시트 시스템은, 인터페 이스부를 매개로 메인 컨트롤러에 연결될 수도 있다. 도 9에 예시된 바와 같이, 페이먼트 시스템은, 결제 서비스를 사용자에게 제공할 수 있다. 페이먼트 시스 템은, 입력 장치 또는 통신 장치에 의해 생성되는 전기적 신호에 기초하여 동작될 수 있다. 페 이먼트 시스템은, 사용자가 이용한 적어도 하나의 서비스에 대한 가격을 산정하고, 산정된 가격이 지불되 도록 요청할 수 있다. 도 3은, 페이먼트 시스템이 메인 컨트롤러에 직접 연결된 것으로 예시하나, 페이먼트 시스템은, 인터페이스부를 매개로 메인 컨트롤러에 연결될 수도 있다. 한편, 실시예에 따라, 캐빈 시스템은, 이동 단말기를 구성 요소로 더 포함할 수 있다. 도 10은 본 발명의 실시예에 따라 사용자의 이용 시나리오를 설명하는데 참조되는 도면이다. 제1 시나리오(S111)는, 사용자의 목적지 예측 시나리오이다. 이동 단말기는 캐빈 시스템과 연동 가능 한 애플리케이션을 설치할 수 있다. 이동 단말기는, 애플리케이션을 통해, 사용자의 컨텍스트추얼 정보 (user's contextual information)를 기초로, 사용자의 목적지를 예측할 수 있다. 이동 단말기는, 애플리 케이션을 통해, 캐빈 내의 빈자리 정보를 제공할 수 있다. 제2 시나리오(S112)는, 캐빈 인테리어 레이아웃 준비 시나리오이다. 캐빈 시스템은, 차량 외부에 위 치하는 사용자에 대한 데이터를 획득하기 위한 스캐닝 장치를 더 포함할 수 있다. 스캐닝 장치는, 사용자를 스 캐닝하여, 사용자의 신체 데이터 및 수하물 데이터를 획득할 수 있다. 사용자의 신체 데이터 및 수하물 데이터 는, 레이아웃을 설정하는데 이용될 수 있다. 사용자의 신체 데이터는, 사용자 인증에 이용될 수 있다. 스캐닝 장치는, 적어도 하나의 이미지 센서를 포함할 수 있다. 이미지 센서는, 가시광 대역 또는 적외선 대역의 광을 이용하여 사용자 이미지를 획득할 수 있다. 시트 시스템은, 사용자의 신체 데이터 및 수하믈 데이터 중 적어도 어느 하나에 기초하여, 캐빈 내 레이아 웃을 설정할 수 있다. 예를 들면, 시트 시스템은, 수하물 적재 공간 또는 카시트 설치 공간을 마련할 수 있다. 제3 시나리오(S113)는, 사용자 환영 시나리오이다. 캐빈 시스템은, 적어도 하나의 가이드 라이트를 더 포 함할 수 있다. 가이드 라이트는, 캐빈 내 바닥에 배치될 수 있다. 캐빈 시스템은, 사용자의 탑승이 감지되 는 경우, 복수의 시트 중 기 설정된 시트에 사용자가 착석하도록 가이드 라이트를 출력할 수 있다. 예를 들면, 메인 컨트롤러는, 오픈된 도어에서부터 기 설정된 사용자 시트까지 시간에 따른 복수의 광원에 대한 순차 점등을 통해, 무빙 라이트를 구현할 수 있다. 제4 시나리오(S114)는, 시트 조절 서비스 시나리오이다. 시트 시스템은, 획득된 신체 정보에 기초하여, 사 용자와 매칭되는 시트의 적어도 하나의 요소를 조절할 수 있다. 제5 시나리오(S115)는, 개인 컨텐츠 제공 시나리오이다. 디스플레이 시스템은, 입력 장치 또는 통신 장치를 통해, 사용자 개인 데이터를 수신할 수 있다. 디스플레이 시스템은, 사용자 개인 데이터에 대 응되는 컨텐츠를 제공할 수 있다. 제6 시나리오(S116)는, 상품 제공 시나리오이다. 카고 시스템은, 입력 장치 또는 통신 장치를 통해, 사용자 데이터를 수신할 수 있다. 사용자 데이터는, 사용자의 선호도 데이터 및 사용자의 목적지 데이터 등을 포함할 수 있다. 카고 시스템은, 사용자 데이터에 기초하여, 상품을 제공할 수 있다. 제7 시나리오(S117)는, 페이먼트 시나리오이다. 페이먼트 시스템은, 입력 장치, 통신 장치 및 카고 시스템 중 적어도 어느 하나로부터 가격 산정을 위한 데이터를 수신할 수 있다. 페이먼트 시스템 은, 수신된 데이터에 기초하여, 사용자의 차량 이용 가격을 산정할 수 있다. 페이먼트 시스템은, 산 정된 가격으로 사용자(예를 들면, 사용자의 이동 단말기)에 요금 지불을 요청할 수 있다. 제8 시나리오(S118)는, 사용자의 디스플레이 시스템 제어 시나리오이다. 입력 장치는, 적어도 어느 하나의 형태로 이루어진 사용자 입력을 수신하여, 전기적 신호로 전환할 수 있다. 디스플레이 시스템은, 전기적 신호에 기초하여, 표시되는 컨텐츠를 제어할 수 있다. 제9 시나리오(S119)는, 복수의 사용자를 위한 멀티 채널 인공지능(artificial intelligence, AI) 에이전트 시 나리오이다. 인공 지능 에이전트는, 복수의 사용자 별로 사용자 입력을 구분할 수 있다. 인공 지능 에이전 트는, 복수의 사용자 개별 사용자 입력이 전환된 전기적 신호에 기초하여, 디스플레이 시스템, 음향 출력부, 카고 시스템, 시트 시스템 및 페이먼트 시스템 중 적어도 어느 하나를 제어할 수 있다. 제10 시나리오(S120)는, 복수의 사용자를 대상으로 하는 멀티미디어 컨텐츠 제공 시나리오이다. 디스플레이 시 스템은, 모든 사용자가 함께 시청할 수 있는 컨텐츠를 제공할 수 있다. 이경우, 음향 출력부는, 시트 별로 구비된 스피커를 통해, 동일한 사운드를 복수의 사용자 개별적으로 제공할 수 있다. 디스플레이 시스템 은, 복수의 사용자가 개별적으로 시청할 수 있는 컨텐츠를 제공할 수 있다. 이경우, 음향 출력부는, 시트별로 구비된 스피커를 통해, 개별적 사운드를 제공할 수 있다. 제11 시나리오(S121)는, 사용자 안전 확보 시나리오이다. 사용자에게 위협이되는 차량 주변 오브젝트 정보를 획 득하는 경우, 메인 컨트롤러는, 디스플레이 시스템 및 음향 출력부 중 적어도 어느 하나를 통해, 차량 주변 오브젝트에 대한 알람이 출력되도록 제어할 수 있다. 제12 시나리오(S122)는, 사용자의 소지품 분실 예방 시나리오이다. 메인 컨트롤러는, 입력 장치를 통 해, 사용자의 소지품에 대한 데이터를 획득할 수 있다. 메인 컨트롤러는, 입력 장치를 통해, 사용자 의 움직임 데이터를 획득할 수 있다. 메인 컨트롤러는, 소지품에 대한 데이터 및 움직임 데이터에 기초하 여, 사용자가 소지품을 두고 하차 하는지 여부를 판단할 수 있다. 메인 컨트롤러는, 디스플레이 시스템 및 음향 출력부 중 적어도 어느 하나에 기초하여, 소지품에 관한 알람이 출력되도록 제어할 수 있다. 제13 시나리오(S123)는, 하차 리포트 시나리오이다. 메인 컨트롤러는, 입력 장치를 통해, 사용자의 하차 데이터를 수신할 수 있다. 사용자 하차 이후, 메인 컨트롤러는, 통신 장치를 통해, 사용자의 이 동 단말기에 하차에 따른 리포트 데이터를 제공할 수 있다. 리포트 데이터는, 차량 전체 이용 요금 데이터 를 포함할 수 있다.도 11은 본 발명의 실시예에 따른 차량의 제어 블럭도이다. 도 11을 참조하면, 차량은, 차량용 전자 장치, 사용자 인터페이스 장치, 오브젝트 검출 장치 , 통신 장치, 운전 조작 장치, 메인 ECU, 차량 구동 장치, 주행 시스템, 센싱 부 및 위치 데이터 생성 장치를 포함할 수 있다. 차량용 전자 장치는, 영상 데이터에서 검출된 외부인의 탑승 의사를 판단하여, 차량의 정차를 위한 제어 신호를 생성할 수 있다. 차량용 전자 장치는, 도 11에 예시된 바와 같이, 차량에 포함되는 구성일 수 있다. 이경우, 차량용 전자 장치는, 내부 통신 시스템을 이용하여, 차량 내부의 다른 전자 장치와 신호를 교환할 수 있다. 사용자 인터페이스 장치는, 차량과 사용자와의 소통을 위한 장치이다. 사용자 인터페이스 장치는, 사용자 입력을 수신하고, 사용자에게 차량에서 생성된 정보를 제공할 수 있다. 차량은, 사용자 인터페이스 장치를 통해, UI(User Interface) 또는 UX(User Experience)를 구현할 수 있다. 사용 자 인터페이스 장치는, 차량에 장착되는 디스플레이 장치, HUD(head up display) 장치, 윈도우 디스플 레이 장치, 클러스터 장치 등으로 구현될 수 있다. 사용자 인터페이스 장치는, 입력 장치, 출력 장치 및 사용자 모니터링 장치를 포함할 수 있다. 사용자 인터페이스 장치는, 터치 입력 장치, 기계식 입력 장치, 음성 입력 장치, 제스쳐 입력 장치 등과 같은 입력 장치를 포함할 수 있다. 사용자 인터페이스 장치는, 스 피커, 디스플레이, 햅틱 모듈과 같은 출력 장치를 포함할 수 있다. 사용자 인터페이스 장치는, DMS(Driver Monitoring System), IMS(Internal Monitoring System)과 같은 사용자 모니터링 장치를 포함할 수 있다. 한편, 사용자 인터페이스 장치는, 입력 장치, 영상 장치, 디스플레이 시스템, 음향 출력부 , 카고 시스템, 시트 시스템, 페이먼트 시스템 중 적어도 어느 하나를 포함할 수 있다. 오브젝트 검출 장치는, 차량 외부의 오브젝트를 검출할 수 있다. 오브젝트 검출 장치는, 차량 외부의 오브젝트를 검출할 수 있는 적어도 하나의 센서를 포함할 수 있다. 오브젝트 검출 장치는, 카 메라, 레이다, 라이다, 초음파 센서 및 적외선 센서 중 적어도 하나를 포함할 수 있다. 오브젝트 검출 장치 는, 센서에서 생성되는 센싱 신호에 기초하여 생성된 오브젝트에 대한 데이터를 차량에 포함된 적어도 하 나의 전자 장치에 제공할 수 있다. 카메라는 영상을 이용하여 차량 외부의 오브젝트에 대한 정보를 생성할 수 있다. 카메라는 적어도 하나의 렌즈, 적어도 하나의 이미지 센서 및 이미지 센서와 전기적으로 연결되어 수신되는 신호를 처리하고, 처리되는 신호에 기초하여 오브젝트에 대한 데이터를 생성하는 적어도 하나의 프로세서를 포함할 수 있다. 카메라는, 모노 카메라, 스테레오 카메라, AVM(Around View Monitoring) 카메라 중 적어도 어느 하나일 수 있다. 카메라는, 다양한 영상 처리 알고리즘을 이용하여, 오브젝트의 위치 정보, 오브젝트와의 거리 정보 또는 오브젝트와의 상대 속도 정보를 획득할 수 있다. 예를 들면, 카메라는, 획득된 영상에서, 시간에 따른 오브젝트 크기의 변화를 기초로, 오브젝트와의 거리 정보 및 상대 속도 정보를 획득할 수 있다. 예를 들면, 카메라는, 핀 홀(pin hole) 모델, 노면 프로파일링 등을 통해, 오브젝트와의 거리 정보 및 상대 속도 정보를 획득할 수 있다. 예를 들면, 카메라는, 스테레오 카메라에서 획득된 스테레오 영상에서 디스패러티(disparity) 정보를 기초로 오 브젝트와의 거리 정보 및 상대 속도 정보를 획득할 수 있다. 카메라는, 차량 외부를 촬영하기 위해 차량에서 FOV(field of view) 확보가 가능한 위치에 장착될 수 있다. 카 메라는, 차량 전방의 영상을 획득하기 위해, 차량의 실내에서, 프런트 윈드 쉴드에 근접하게 배치될 수 있다. 카메라는, 프런트 범퍼 또는 라디에이터 그릴 주변에 배치될 수 있다. 카메라는, 차량 후방의 영상을 획득하기 위해, 차량의 실내에서, 리어 글라스에 근접하게 배치될 수 있다. 카메라는, 리어 범퍼, 트렁크 또는 테일 게이 트 주변에 배치될 수 있다. 카메라는, 차량 측방의 영상을 획득하기 위해, 차량의 실내에서 사이드 윈도우 중 적어도 어느 하나에 근접하게 배치될 수 있다. 또는, 카메라는, 사이드 미러, 휀더 또는 도어 주변에 배치될 수 있다. 레이다는 전파를 이용하여 차량 외부의 오브젝트에 대한 정보를 생성할 수 있다. 레이다는, 전자파 송신부, 전자파 수신부 및 전자파 송신부 및 전자파 수신부와 전기적으로 연결되어, 수신되는 신호를 처리하고, 처리되 는 신호에 기초하여 오브젝트에 대한 데이터를 생성하는 적어도 하나의 프로세서를 포함할 수 있다. 레이다는 전파 발사 원리상 펄스 레이다(Pulse Radar) 방식 또는 연속파 레이다(Continuous Wave Radar) 방식으로 구현 될 수 있다. 레이다는 연속파 레이다 방식 중에서 신호 파형에 따라 FMCW(Frequency Modulated Continuous Wave)방식 또는 FSK(Frequency Shift Keyong) 방식으로 구현될 수 있다. 레이다는 전자파를 매개로, TOF(Timeof Flight) 방식 또는 페이즈 쉬프트(phase-shift) 방식에 기초하여, 오브젝트를 검출하고, 검출된 오브젝트의 위치, 검출된 오브젝트와의 거리 및 상대 속도를 검출할 수 있다. 레이다는, 차량의 전방, 후방 또는 측방에 위 치하는 오브젝트를 감지하기 위해 차량의 외부의 적절한 위치에 배치될 수 있다. 라이다는, 레이저 광을 이용하여, 차량 외부의 오브젝트에 대한 정보를 생성할 수 있다. 라이다는, 광 송신 부, 광 수신부 및 광 송신부 및 광 수신부와 전기적으로 연결되어, 수신되는 신호를 처리하고, 처리된 신호에 기초하여 오브젝트에 대한 데이터를 생성하는 적어도 하나의 프로세서를 포함할 수 있다. 라이다는, TOF(Time of Flight) 방식 또는 페이즈 쉬프트(phase-shift) 방식으로 구현될 수 있다. 라이다는, 구동식 또는 비구동식 으로 구현될 수 있다. 구동식으로 구현되는 경우, 라이다는, 모터에 의해 회전되며, 차량 주변의 오브젝트 를 검출할 수 있다. 비구동식으로 구현되는 경우, 라이다는, 광 스티어링에 의해, 차량을 기준으로 소정 범위 내에 위치하는 오브젝트를 검출할 수 있다. 차량은 복수의 비구동식 라이다를 포함할 수 있다. 라이다는, 레이저 광 매개로, TOF(Time of Flight) 방식 또는 페이즈 쉬프트(phase-shift) 방식에 기초하여, 오브젝트를 검출하고, 검출된 오브젝트의 위치, 검출된 오브젝트와의 거리 및 상대 속도를 검출할 수 있다. 라이다는, 차량 의 전방, 후방 또는 측방에 위치하는 오브젝트를 감지하기 위해 차량의 외부의 적절한 위치에 배치될 수 있다. 통신 장치는, 차량 외부에 위치하는 디바이스와 신호를 교환할 수 있다. 통신 장치는, 인프라(예 를 들면, 서버, 방송국) 및 타 차량 중 적어도 어느 하나와 신호를 교환할 수 있다. 통신 장치는, 통신을 수행하기 위해 송신 안테나, 수신 안테나, 각종 통신 프로토콜이 구현 가능한 RF(Radio Frequency) 회로 및 RF 소자 중 적어도 어느 하나를 포함할 수 있다. 통신 장치는, 5G(예를 들면, 뉴 라디오(new radio, NR)) 방식을 이용하여, 차량 외부에 위치하는 디바 이스와 통신할 수 있다. 통신 장치는, 5G 방식을 이용하여, V2X(V2V, V2D, V2P,V2N) 통신을 구현할 수 있 다. 한편, 통신 장치는, 도 2 내지 도 10을 참조하여 설명한 통신 장치를 포함할 수 있다. 운전 조작 장치는, 운전을 위한 사용자 입력을 수신하는 장치이다. 메뉴얼 모드인 경우, 차량은, 운전 조작 장치에 의해 제공되는 신호에 기초하여 운행될 수 있다. 운전 조작 장치는, 조향 입력 장치(예 를 들면, 스티어링 휠), 가속 입력 장치(예를 들면, 가속 페달) 및 브레이크 입력 장치(예를 들면, 브레이크 페 달)를 포함할 수 있다. 메인 ECU는, 차량 내에 구비되는 적어도 하나의 전자 장치의 전반적인 동작을 제어할 수 있다. 구동 제어 장치는, 차량내 각종 차량 구동 장치를 전기적으로 제어하는 장치이다. 구동 제어 장치 는, 파워 트레인 구동 제어 장치, 샤시 구동 제어 장치, 도어/윈도우 구동 제어 장치, 안전 장치 구동 제 어 장치, 램프 구동 제어 장치 및 공조 구동 제어 장치를 포함할 수 있다. 파워 트레인 구동 제어 장치는, 동력 원 구동 제어 장치 및 변속기 구동 제어 장치를 포함할 수 있다. 샤시 구동 제어 장치는, 조향 구동 제어 장치, 브레이크 구동 제어 장치 및 서스펜션 구동 제어 장치를 포함할 수 있다. 한편, 안전 장치 구동 제어 장치는, 안전 벨트 제어를 위한 안전 벨트 구동 제어 장치를 포함할 수 있다. 차량 구동 제어 장치는, 제어 ECU(Electronic Control Unit)로 명명될 수 있다. 주행 시스템는, 오브젝트 검출 장치에서 수신한 오브젝트에 대한 데이터에 기초하여, 차량의 움 직임을 제어하거나, 사용자에게 정보를 출력하기 위한 신호를 생성할 수 있다. 주행 시스템는, 생성된 신 호를, 사용자 인터페이스 장치, 메인 ECU 및 차량 구동 장치 중 적어도 어느 하나에 제공할 수 있다. 주행 시스템은, ADAS를 포함하는 개념일 수 있다. ADAS는, 적응형 크루즈 컨트롤 시스템(ACC : Adaptive Cruise Control), 자동 비상 제동 시스템(AEB : Autonomous Emergency Braking), 전방 충돌 알림 시 스템(FCW : Foward Collision Warning), 차선 유지 보조 시스템(LKA : Lane Keeping Assist), 차선 변경 보조 시스템(LCA : Lane Change Assist), 타겟 추종 보조 시스템(TFA : Target Following Assist), 사각 지대 감시 시스템(BSD : Blind Spot Detection), 적응형 하이빔 제어 시스템(HBA : High Beam Assist), 자동 주차 시스템 (APS : Auto Parking System), 보행자 충돌 알림 시스템(PD collision warning system), 교통 신호 검출 시스 템(TSR : Traffic Sign Recognition), 교통 신호 보조 시스템(TSA : Trafffic Sign Assist), 나이트 비전 시스 템(NV : Night Vision), 운전자 상태 모니터링 시스템(DSM : Driver Status Monitoring) 및 교통 정체 지원 시 스템(TJA : Traffic Jam Assist) 중 적어도 어느 하나를 구현할 수 있다.주행 시스템은, 자율 주행 ECU(Electronic Control Unit)를 포함할 수 있다. 자율 주행 ECU는, 차량 내 다른 전자 장치들 중 적어도 어느 하나로부터 수신되는 데이터에 기초하여, 자율 주행 경로를 설정할 수 있 다. 자율 주행 ECU는, 사용자 인터페이스 장치, 오브젝트 검출 장치, 통신 장치, 센싱부 및 위치 데이터 생성 장치 중 적어도 어느 하나로부터 수신되는 데이터에 기초하여, 자율 주행 경로를 설 정할 수 있다. 자율 주행 ECU는, 자율 주행 경로를 따라 차량이 주행하도록 제어 신호를 생성할 수 있다. 자율 주행 ECU에서 생성된 제어 신호는, 메인 ECU 및 차량 구동 장치 중 적어도 어느 하나로 제공될 수 있다. 센싱부는, 차량의 상태를 센싱할 수 있다. 센싱부는, IMU(inertial navigation unit) 센서, 충돌 센 서, 휠 센서(wheel sensor), 속도 센서, 경사 센서, 중량 감지 센서, 헤딩 센서(heading sensor), 포지션 모듈 (position module), 차량 전진/후진 센서, 배터리 센서, 연료 센서, 타이어 센서, 핸들 회전에 의한 스티어링 센서, 차량 내부 온도 센서, 차량 내부 습도 센서, 초음파 센서, 조도 센서, 가속 페달 포지션 센서 및 브레이 크 페달 포지션 센서 중 적어도 어느 하나를 포함할 수 있다. 한편, IMU(inertial navigation unit) 센서는, 가속도 센서, 자이로 센서, 자기 센서 중 하나 이상을 포함할 수 있다. 센싱부는, 적어도 하나의 센서에서 생성되는 신호에 기초하여, 차량의 상태 데이터를 생성할 수 있다. 센 싱부는, 차량 자세 정보, 차량 모션 정보, 차량 요(yaw) 정보, 차량 롤(roll) 정보, 차량 피치(pitch) 정 보, 차량 충돌 정보, 차량 방향 정보, 차량 각도 정보, 차량 속도 정보, 차량 가속도 정보, 차량 기울기 정보, 차량 전진/후진 정보, 배터리 정보, 연료 정보, 타이어 정보, 차량 램프 정보, 차량 내부 온도 정보, 차량 내부 습도 정보, 스티어링 휠 회전 각도, 차량 외부 조도, 가속 페달에 가해지는 압력, 브레이크 페달에 가해지는 압 력 등에 대한 센싱 신호를 획득할 수 있다. 센싱부는, 그 외, 가속페달센서, 압력센서, 엔진 회전 속도 센서(engine speed sensor), 공기 유량 센서 (AFS), 흡기 온도 센서(ATS), 수온 센서(WTS), 스로틀 위치 센서(TPS), TDC 센서, 크랭크각 센서(CAS), 등을 더 포함할 수 있다. 센싱부는, 센싱 데이터를 기초로, 차량 상태 정보를 생성할 수 있다. 차량 상태 정보는, 차량 내부에 구비 된 각종 센서에서 감지된 데이터를 기초로 생성된 정보일 수 있다. 예를 들면, 차량 상태 정보는, 차량의 자세 정보, 차량의 속도 정보, 차량의 기울기 정보, 차량의 중량 정보, 차량의 방향 정보, 차량의 배터리 정보, 차량의 연료 정보, 차량의 타이어 공기압 정보, 차량의 스티어링 정보, 차량 실내 온도 정보, 차량 실내 습도 정보, 페달 포지션 정보 및 차량 엔진 온도 정보 등을 포함할 수 있다. 한편, 센싱부는, 텐션 센서를 포함할 수 있다. 텐션 센서는, 안전 벨트의 텐션 상태에 기초하여 센싱 신호를 생 성할 수 있다. 위치 데이터 생성 장치는, 차량의 위치 데이터를 생성할 수 있다. 위치 데이터 생성 장치는, GPS(Global Positioning System) 및 DGPS(Differential Global Positioning System) 중 적어도 어느 하나를 포 함할 수 있다. 위치 데이터 생성 장치는, GPS 및 DGPS 중 적어도 어느 하나에서 생성되는 신호에 기초하여 차량의 위치 데이터를 생성할 수 있다. 실시예에 따라, 위치 데이터 생성 장치는, 센싱부의 IMU(Inertial Measurement Unit) 및 오브젝트 검출 장치의 카메라 중 적어도 어느 하나에 기초하여 위치 데이터를 보정할 수 있다. 위치 데이터 생성 장치는, 위치 측위 장치로 명명될 수 있다. 위치 데이터 생성 장치는, GNSS(Global Navigation Satellite System)로 명명될 수 있다. 차량은, 내부 통신 시스템을 포함할 수 있다. 차량에 포함되는 복수의 전자 장치는 내부 통신 시스 템을 매개로 신호를 교환할 수 있다. 신호에는 데이터가 포함될 수 있다. 내부 통신 시스템은, 적어도 하나의 통신 프로토콜(예를 들면, CAN, LIN, FlexRay, MOST, 이더넷)을 이용할 수 있다. 도 12는 본 발명의 실시예에 따른 시스템의 구성도이다. 도 12를 참조하면, 시스템은, 차량용 전자 장치, 복수의 차량(10a, 10b), 교통 정보 서버를 포함할 수 있다. 실시예에 따라, 시스템은, 사용자 단말기를 더 포함할 수 있다. 차량용 전자 장치는, 복수의 차량(10a, 10b), 교통 정보 서버, 사용자 단말기와 네트워크를 통 해 연결되어, 신호를 교환할 수 있다. 차량용 전자 장치는, 제어 센터 서버로 명명될 수 있다. 차량용 전자 장치는, 도 12에 예시된 바와 같이, 차량의 외부에 위치할 수 있다. 차량용 전자 장치는, 제어 신호를 생성하여, 복수의 차량(10a, 10b)에 제공할 수 있다. 차량용 전자 장치 는, 교통 정보 서버, 복수의 차량(10a, 10b)로부터 수신되는 데이터에 기초하여, 복수의 차량(10a, 10b)을 제어하기 위한 신호를 생성하여, 복수의 차량(10a, 10b)에 제공할 수 있다. 차량용 전자 장치는, 영상 데이터에서 검출된 외부인의 탑승 의사를 판단하여, 차량의 정차를 위한 제어 신호를 생성할 수 있다. 복수의 차량(10a, 10b)은, 차량용 전자 장치로부터 수신되는 신호에 기초하여, 동작될 수 있다. 복수의 차 량(10a, 10b)은 차량용 전자 장치로부터 수신되는 신호에 기초하여, 움직이거나 정보를 출력할 수 있다. 복수의 차량(10a, 10b) 각각은, 차량 외부 디스플레이, 차량 내 DB 서버, 차량내 센싱 수단을 포함할 수 있다. 차량 외부 디스플레이는, 전방 디스플레이, 후방 디플레이, 좌측 사이드 디스플레이, 우측 사이드 디스플레이를 포함할 수 있다. 차량 내 센싱 수단은, GPS, 차량 외부 카메라 및 센서, OMS(occupant monitoring system) 카 메라(차량 내부 카메라), 착좌 센서를 포함할 수 있다. 차량 내 DB 서버는, 목적지 정보 DB, 외부인의 제스쳐 인식 DB, 차량간 통신 정보 DB, 탑승객 착좌 관련 DB를 포함할 수 있다. 교통 정보 서버는, 교통 정보를 수집하여 제공할 수 있다. 교통 정보 서버는, 도로 주변에 설치된 장 치, 복수의 차량(10a, 10b)로부터 데이터를 수신하고, 수신된 데이터를 처리하여 교통 정보를 생성할 수 있다. 사용자 단말기는, 사용자 정보를 제공할 수 있다. 사용자 단말기는, 사용자의 예약 정보, 사용자의 개인 정보 등을 제공할 수 있다. 도 13은 본 발명의 실시예에 따른 차량용 전자 장치의 제어 블럭도이다. 도 13을 참조하면, 차량용 전자 장치는, 메모리, 프로세서, 및 전원 공급부를 포함할 수 있다. 실시예에 따라, 차량용 전자 장치가 차량의 외부에 위치하는 경우, 차량용 전자 장치는, 통신 장치를 포함할 수 있다. 실시예에 따라, 차량용 전자 장치가 차량의 내부에 위치하는 경우, 차량용 전자 장치는, 인터페이스부를 포함할 수 있다. 통신 장치는, 교통 정보 서버(도 12의 910), 사용자 단말기(도 12의 920), 복수의 차량(10a, 10b)과 신호 를 교환할 수 있다. 통신 장치는, 통신을 수행하기 위해 송신 안테나, 수신 안테나, 각종 통신 프로토콜이 구현 가능한 RF(Radio Frequency) 회로 및 RF 소자 중 적어도 어느 하나를 포함할 수 있다. 통신 장치는, 5G(예를 들면, 뉴 라디오(new radio, NR)) 방식을 이용하여, 외부 디바이스와 통신할 수 있 다. 통신 장치는, 5G 방식을 이용하여, V2X(V2V, V2D, V2P,V2N) 통신을 구현할 수 있다. 메모리는, 프로세서와 전기적으로 연결된다. 메모리는 유닛에 대한 기본데이터, 유닛의 동작제 어를 위한 제어데이터, 입출력되는 데이터를 저장할 수 있다. 메모리는, 프로세서에서 처리된 데이터 를 저장할 수 있다. 메모리는, 하드웨어적으로, ROM, RAM, EPROM, 플래시 드라이브, 하드 드라이브 중 적 어도 어느 하나로 구성될 수 있다. 메모리는 프로세서의 처리 또는 제어를 위한 프로그램 등, 전자 장치 전반의 동작을 위한 다양한 데이터를 저장할 수 있다. 메모리는, 프로세서와 일체형으로 구현될 수 있다. 실시예에 따라, 메모리는, 프로세서의 하위 구성으로 분류될 수 있다. 인터페이스부는, 차량에 구비된 적어도 하나의 전자 장치와 유선 또는 무선으로 신호를 교환할 수 있 다. 인터페이스부는, 사용자 인터페이스 장치(도 11의 800), 오브젝트 검출 장치(도 11의 810), 통신 장치 (도 11의 820), 운전 조작 장치(도 11의 830), 메인 ECU(도 11의 840), 차량 구동 장치(도 11의 850), 주행 시 스템(도 11의 860), 센싱부(도 11의 870) 및 위치 데이터 생성 장치(도 11의 880) 중 적어도 어느 하나와 유선 또는 무선으로 신호를 교환할 수 있다. 인터페이스부는, 통신 모듈, 단자, 핀, 케이블, 포트, 회로, 소자 및 장치 중 적어도 어느 하나로 구성될 수 있다. 전원 공급부는, 전자 장치에 전원을 공급할 수 있다. 전원 공급부는, 차량에 포함된 파워 소스(예를 들면, 배터리)로부터 전원을 공급받아, 전자 장치의 각 유닛에 전원을 공급할 수 있다. 전원 공 급부는, 메인 ECU(도 11의 840)로부터 제공되는 제어 신호에 따라 동작될 수 있다. 전원 공급부는, SMPS(switched-mode power supply)로 구현될 수 있다. 프로세서는, 메모리, 인터페이스부, 전원 공급부와 전기적으로 연결되어 신호를 교환할 수 있다. 프로세서는, ASICs (application specific integrated circuits), DSPs(digital signalprocessors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기(controllers), 마이크로 컨트롤러(micro- controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행을 위한 전기적 유닛 중 적어도 하나를 이 용하여 구현될 수 있다. 프로세서는, 전원 공급부로부터 제공되는 전원에 의해 구동될 수 있다. 프로세서는, 전원 공급 부에 의해 전원이 공급되는 상태에서 데이터를 수신하고, 데이터를 처리하고, 신호를 생성하고, 신호를 제 공할 수 있다. 프로세서는, 인터페이스부를 통해, 차량 내 다른 전자 장치로부터 정보를 수신할 수 있다. 프로 세서는, 인터페이스부를 통해, 차량 내 다른 전자 장치로 제어 신호를 제공할 수 있다. 프로세서는, 차량에 구비된 카메라에 의해 획득된 영상 데이터를 수신할 수 있다. 예를 들면, 차량용 전자 장치가 차량 외부에 위치하는 경우, 프로세서는, 통신 장치를 통해, 영상 데이터를 수 신할 수 있다. 예를 들면, 차량용 전자 장치가 차량 내부에 위치하는 경우, 프로세서는, 인터페 이스부를 통해, 영상 데이터를 수신할 수 있다. 프로세서는, 영상 데이터에서 검출된 외부인의 위치, 자세 및 제스쳐에 기초하여, 상기 외부인의 탑승 의 사를 판단할 수 있다. 예를 들면, 프로세서는, 영상 데이터에서 검출된 외부인의 위치, 자세 및 제스쳐의 조합으로 상기 외부인의 탑승 의사를 판단할 수 있다. 프로세서는, 외부인의 머리의 자세, 팔의 자세 및 몸통의 자세에 기초하여, 외부인의 탑승 의사를 판단할 수 있다. 예를 들면, 프로세서는, 외부인의 머리가 향하는 방향, 머리의 각도, 외부인의 팔의 형상, 외부 인의 몸통의 기울기 등에 기초하여 외부인의 탑승 의사를 판단할 수 있다. 프로세서는, 외부인이 개인용 단말기를 든채 웨이빙(waving)하는 제스쳐를 검출하는 경우, 상기 웨이빙하 는 제스쳐를 탑승 요구 의사로 판단할 수 있다. 예를 들면, 프로세서는, 외부인이 차도와 인도의 경계 주 변 또는 경계에 위치한 상태에서 웨이빙하는 제스쳐를 검출하는 경우, 웨이빙하는 제스쳐를 탑승 요구 의사로 판단할 수 있다. 한편, 웨이빙 제스쳐는, 팔을 양 방향으로 흔드는 제스쳐로 설명될 수 있다. 프로세서는, 판단된 외부인의 탑승 의사에 기초하여, 차량의 정차를 위한 제어 신호를 생성할 수 있다. 프로세서는, 외부인이 차량에 탑승할 의사가 있는 것으로 판단되는 경우, 오브젝트 검출 장치 에서 생성된 데이터에 기초하여, 외부인 주변에 차량이 정차할 수 있는 공간이 있는지 판단할 수 있다. 프로세서는, 차량이 정차할 수 있는 공간이 있는 것으로 판단되는 경우, 해당 공간에 차량 이 정차하도록 제어 신호를 생성할 수 있다. 프로세서는, 제어 신호를 차량에 제공할 수 있다. 프로세서는, 차량에 구비되는 복수의 외부 디스플레이 중, 차량의 주행 방향에 따라 정보 표시 디 스플레이를 선택할 수 있다. 예를 들면, 차량에는, 전방, 후방, 좌측방, 우측방에 외부를 향해 화면을 출력 하는 복수의 디스플레이를 포함할 수 있다. 프로세서는, 정차가 가능한 방향에 위치하는 디스플레이를 정 보 표시 디스플레이로 선택할 수 있다. 프로세서는, 정보 표시 디스플레이에, 차량의 상황에 대한 정보가 표시되도록 신호를 제공할 수 있다. 정보 표시 디스플레이는, 차량용 전자 장치로부터 수신되는 신호에 기초하여, 차량의 상황에 대한 정 보를 표시할 수 있다. 프로세서는, 정보 표시 디스플레이에, 목적지 정보, 경로 정보, 이용 가능한 시트 정보, 탑승 인원 정보 및 특수 차량 여부에 대한 정보 중 적어도 어느 하나가 표시되도록 신호를 제공할 수 있다. 정보 표시 디스플레 이는, 목적지 정보, 경로 정보, 이용 가능한 시트 정보, 탑승 인원 정보 및 특수 차량 여부에 대한 정보 중 적 어도 어느 하나를 표시할 수 있다. 프로세서는, 주행 중인 도로에서 차량의 정차 가능 공간의 존재 여부를 판단할 수 있다. 프로세서 는, 정차 가능 공간이 없는 것으로 판단되는 경우, 정보 표시 디스플레이에, 차량의 이용 불가능 정보 가 표시되도록 신호를 제공할 수 있다. 정보 표시 디스플레이는, 차량의 이용 불가능 정보를 표시할 수 있 다. 프로세서는, 정보 표시 디스플레이에, 외부인과의 인터렉션을 위한 컨텐츠가 표시되도록 신호를 제공할 수 있다. 정보 표시 디스플레이는, 외부인과의 인터렉션을 위한 컨텐츠를 표시할 수 있다프로세서는, 복수의 외부인이 검출되는 경우, 차량에 가장 근접한 제1 외부인에 우선권을 부여할 수 있다. 프로세서는, 제1 외부인을 최우선 탑승자로 선택할 수 있다. 프로세서는, 제1 외부인을 향해 광을 출력시키기 위한 신호를 생성할 수 있다. 예를 들면, 프로세서는, 차량에 구비된 램프에, 제1 외 부인을 향해 광을 출력시키기 위한 신호를 제공할 수 있다. 프로세서는, 복수의 외부인으로 구성된 그룹을 검출할 수 있다. 프로세서는, 복수의 외부인간의 간격 이 기준값 이하인 것으로 판단되는 경우, 상기 그룹을 탑승 요청 그룹으로 판단할 수 있다. 전자 장치는, 적어도 하나의 인쇄 회로 기판(printed circuit board, PCB)을 포함할 수 있다. 통신 장치 , 메모리, 인터페이스부, 전원 공급부 및 프로세서는, 인쇄 회로 기판에 전기적으로 연결될 수 있다. 도 14는 본 발명의 실시예에 따른 차량용 전자 장치의 플로우 차트이다. 도 14를 참조하면, 프로세서는, 차량에 구비되는 복수의 외부 디스플레이 중, 차량의 주행 방향에 따라 정보 표시 디스플레이를 선택할 수 있다(S1410). 프로세서는, 정보 표시 디스플레이에, 차량의 상황에 대한 정보가 표시되도록 신호를 제공할 수 있다 (S1420). 정보가 표시되도록 신호를 제공하는 단계(S1420)는, 적어도 하나의 프로세서가, 정보 표시 디스플레이에, 외부인과의 인터렉션을 위한 컨텐츠가 표시되도록 신호를 제공하는 단계를 포함할 수 있다. 정보가 표시되도록 신호를 제공하는 단계(S1420)는, 적어도 하나의 프로세서가, 정보 표시 디스플레이에, 목적지 정보, 경로 정보, 이용 가능한 시트 정보, 탑승 인원 정보 및 특수 차량 여부에 대한 정보 중 적어도 어 느 하나가 표시되도록 신호를 제공하는 단계를 포함할 수 있다. 정보가 표시되도록 신호를 제공하는 단계(S1420)는, 적어도 하나의 프로세서가, 주행 중인 도로에서 차량 의 정차 가능 공간의 존재 여부를 판단하는 단계 및 적어도 하나의 프로세서가, 공간이 없는 것으로 판단되는 경우, 정보 표시 디스플레이에, 차량의 이용 불가능 정보가 표시되도록 신호를 제공하는 단계를 포함할 수 있다. 프로세서는, 차량에 구비된 카메라에 의해 획득된 영상 데이터를 획득할 수 있다(S1430). 프로세서는, 영상 데이터에서 외부인을 검출할 수 있다(S1430). 외부인을 검출하는 단계(S1430)는, 프로세서가, 복수의 외부인이 검출되는 경우, 차량에 가장 근접한 제1 외부인에 우선권을 부여하는 단계를 포함할 수 있다. 외부인을 검출하는 단계(S1430)는, 제1 외부인을 향해 광을 출력시키기 위한 신호를 생성하는 단계를 더 포함할 수 있다. 외부인을 검출하는 단계(S1430)는, 적어도 하나의 프로세서가, 복수의 외부인으로 구성된 그룹을 검출하는 단계 및 적어도 하나의 프로세서가, 복수의 외부인간의 간격이 기준값 이하인 것으로 판단되는 경우, 상기 그룹을 탑승 요청 그룹으로 판단하는 단계를 포함할 수 있다. 프로세서는, 영상 데이터에서 검출된 외부인의 위치, 자세 및 제스쳐에 기초하여, 외부인의 탑승 의사를 판단할 수 있다. 외부인의 탑승 의사를 판단하는 단게(S1440)는, 적어도 하나의 프로세서가, 외부인의 머리의 자세, 팔의 자세 및 몸통의 자세에 기초하여, 외부인의 탑승 의사를 판단하는 단계를 포함할 수 있다. 외부인의 탑승 의사를 판단하는 단계(S1440)는, 적어도 하나의 프로세서가, 외부인이 개인용 단말기를 든 채 웨이빙하는 제스쳐를 검출하는 경우, 웨이빙하는 제스쳐를 탑승 요구 의사로 판단하는 단계를 포함할 수 있 다. 웨이빙하는 제스쳐를 탑승 요구 의사로를 판단하는 단계는, 적어도 하나의 프로세서가, 상기 외부인이 차 도와 인도의 경계 주변에 위치한 상태에서 상기 웨이빙하는 제스쳐를 검출하는 경우, 상기 웨이빙하는 제스쳐를 탑승 요구 의사로 판단하는 단계를 포함할 수 있다. 탑승 의사가 있는 것으로 판단되는 경우, 프로세서는, 탑승 의사에 기초하여, 차량의 정차를 위한 제 어 신호를 생성할 수 있다.도 15는 본 발명의 실시예에 따른 차량용 전자 장치의 플로우 차트이다. 도 15를 참조하면, 프로세서는, 탑승객이 존재하는지 판단할 수 있다(S1501). 예를 들면, 프로세서는, 차량 내부 카메라에 의해 생성된 영상 데이터에 기초하여, 탑승객이 존재하는지 판단할 수 있 다. 탑승객이 존재하지 않는 것으로 판단되는 경우, 프로세서는, 정보 출력 디스플레이에 탑승 가능 상태임을 알리는 정보를 출력하기 위한 신호를 생성할 수 있다(S1502). 탑승객이 존재하는 것으로 판단되는 경우, 프로세서는, 총 목적지가 2개 이상인지 판단할 수 있다. 총 목적지가 2개 이상이 아닌 것으로 판단되는 경우, 프로세서는, 정보 출력 디스플레이에 해당 목적지를 알리는 정보를 출력하기 위한 신호를 생성할 수 있다(S1504). 총 목적지가 2개 이상인 것으로 판단되는 경우, 프로세서는, 만차 또는 예약 완료된 차량인지 판단할 수 있다(S1505). 차량이 만차 또는 예약 완료된 차량인 경우, 프로세서는, 정보 출력 디스플레이에 만차 또는 예약 완료 메시지를 출력하기 위한 신호를 생성할 수 있다(S1506). 만차 또는 예약 완료된 차량이 아닌 경우, 프로세서는, 주정차가 가능한 도로에 위치하는지 판단할 수 있 다(S1507). 프로세서는, 차량이 주정차가 가능한 도로에 위치하지 않는 것으로 판단되는 경우, 정보 출력 디스플레이에 차량 이용 불가능 메시지를 출력하기 위한 신호를 생성할 수 있다(S1508). 차량이 주정차 가능한 도로에 위치하는 것으로 판단되는 경우, 프로세서는, 차량이 목적지를 향해 주행하도록 신호를 생성할 수 있다(S1510). 프로세서는, 차량이 목적지를 행해 주행하는 중 탑승자가 하차하는지 판단할 수 있다(S1511). 탑승자가 하차하는 것으로 판단되는 경우, 프로세서는, S1501 단계로 회귀하여 동작을 수행할 수 있다. S1507 단계에서, 주정차가 가능한 도로에 위치하는 것으로 판단되는 경우, 프로세서는, 정보 표시 디스플 레이에 목적지를 순차로 출력하거나 노선 도로를 출력하도록 신호를 생성할 수 있다(S1509). 프로세서는, 차량이 목적지를 향해 주행하도록 신호를 생성할 수 있다(S1520). 프로세서는, 영상 데이터에서 검출된 외부인의 위치, 자세 및 제스쳐에 기초하여, 외부인의 탑승 의사를 판단할 수 있다(S1521). 외부인에게 탑승 의사가 있다고 판단되는 경우, 프로세서는, 정보 표시 디스플레이에 외부인과의 인터렉션 을 위한 메시지를 표시하도록 신호를 생성할 수 있다(S1522). 프로세서는, 탑승자에게 추가 탑승자 및 추가 탑승자의 픽업 상황을 안내하도록 신호를 생성할 수 있다 (S1523). 프로세서는, 차량이 외부인에게 접근하도록 신호를 생성할 수 있다(S1524). 프로세서는, 외부인이 계속 존재하는지 판단할 수 있다(S1525). 외부인이 계속 존재하는 것으로 판단되는 경우, 프로세서는, 외부인이 탑승할 수 있는 위치로 차량이 이동하도록 신호를 생성할 수 있다(S1526). 외부인이 탑승할 수 있는 위치로 차량이 이동한 경우, 프로세서는, 외부인에게 탑승 의사를 질문할 있 다(S1527). 외부인의 탑승 의사가 있는 것으로 판단되는 경우(S1528), 프로세서는, 외부인에게 탑승 요청 인원을 질문 할 수 있다(S1529). 프로세서는, 탑승 요청 인원과 탑승 가능 인원을 비교하여(S1530), 전원이 탑승 불가능한 경우, 탑승 불가 메시지를 출력하기 위한 신호를 생성할 수 있다(S1531). 이경우, 프로세서 외부인 근처의 다른 차량에 배 차 요청을 위한 신호를 생성할 수 있다. S1530 단계에서, 전원이 탑승 가능한 것으로 판단되는 경우, 프로세서는, 도어를 오픈할 수 있다(S1532). 프로세서는, 탑승 요청 인원이 탑승 완료한 것으로 판단되는 경우(S1533), 도어를 클로즈하고 대기할 수 있다(S1534).프로세서는, 탑승 요청객이 착성하고 안전벨트를 착용한 것으로 판단되는 경우(S1535), 운행을 재개하도록 신호를 생성할 수 있다(S1536). 이경우, 프로세서는, 신규 탑승객에게 목적지 정보 입력을 요청할 수 있다 (S1536). 이후에, 프로세서는, S1503 단계 이후의 동작을 수행할 수 있다. 도 16은 본 발명의 실시예에 따라 차량에 구비되는 외부 디스플레이를 설명하는데 참조되는 도면이다. 도 17은 본 발명의 실시예에 따른 차량용 전자 장치의 플로우 차트이다. 도 16을 참조하면, 차량용 전자 장치는, 갓길에 주정차 중이거나 도로를 주행 중인 차량에 대해어, 외 부인이 자신의 목적지에 부합하는지 여부와 탑승 가능 여부를 판별할 수 있도록 외부 디스플레이에 정보를 출력 할 수 있다. 차량은 복수의 외부 디스플레이(1610, 1620, 1630, 1640)를 포함할 수 있다. 예를 들면, 차량은, 차량 의 전방을 향해 화면을 출력하는 전방 디스플레이, 차량의 후방을 향해 화면을 출력하는 후방 디 스플레이, 차량의 우측방을 향해 화면을 출력하는 우측방 디스플레이 및 차량의 좌측방을 향해 화면을 출력하는 좌측방 디스플레이를 포함할 수 있다. 프로세서는, 차량의 주행 방향에 따라 복수의 디스플레이(1610, 1620, 1630, 1640) 중 정보 표시 디스 플레이를 선택할 수 있다. 예를 들면, 차량 전진하는 것으로 판단되는 경우, 프로세서는, 전방 디스플 레이를 정보 표시 디스플레이로 선택할 수 있다. 이때, 프로세서는, 후방 디스플레이를 광고 표시 디스플레이로 이용할 수 있다. 예를 들면, 차량이 후진하는 것으로 판단되는 경우, 프로세서는, 후방 디스플레이를 정보 표시 디스플레이로 선택할 수 있다. 이때, 프로세서는, 전방 디스플레이 를 광고 표시 디스플레이로 이용할 수 있다. 프로세서는, 법규로 정해진 주행 기준(예를 들면, 좌측 통행 또는 우측통행)에 따라 정보 표시 디스플레이 를 선택할 수 있다. 예를 들면, 좌측 통행으로 법규가 정해진 경우, 프로세서는, 좌측방 디스플레이(164 0)를 정보 표시 디스플레이로 선택할 수 있다. 이때, 프로세서는, 우측방 디스플레이를 광고 표시 디스플레이로 이용할 수 있다. 예를 들면, 우측 통행으로 법규가 정해진 경우, 프로세서는 우측방 디스플 레이를 정보 표시 디스플레이로 선택할 수 있다. 이때, 프로세서는, 좌측방 디스플레이를 광 고 표시 디스플레이로 이용할 수 있다. 도 17을 참조하면, 프로세서는, 탑승객의 입력 및 도로 특성에 기초하여, 목적지 정보 및 주정차 가능 정 보를 출력할 수 있다. 탑승자는, 개인용 단말기를 이용한 입력, 음성 입력, 내부 디스플레이를 통한 터치 입력 을 통해, 목적지를 입력할 수 있다. 프로세서는, 목적지의 수에 따라 가변적으로 목적지를 표기할 수 있다. 프로세서는, 탑승객이 존재하는지 판단할 수 있다(S1710). 탑승객이 존재하지 않는 것으로 판단되는 경우, 정보 출력 디스플레이에 탑승 가능 상태임을 알리는 정보를 출력하기 위한 신호를 생성할 수 있다(S1715). 탑승객이 존재하는 것으로 판단되는 경우, 프로세서는, 총 목적지가 2개 이상인지 판단할 수 있다. 총 목적지가 2개 이상이 아닌 것으로 판단되는 경우, 프로세서는, 정보 출력 디스플레이에 해당 목적지를 알리는 정보를 출력하기 위한 신호를 생성할 수 있다(S1725). 총 목적지가 2개 이상인 것으로 판단되는 경우, 프로세서는, 만차 또는 예약 완료된 차량인지 판단할 수 있다(S1730). 차량이 만차 또는 예약 완료된 차량인 경우, 프로세서는, 정보 출력 디스플레이에 만차 또는 예약 완료 메시지를 출력하기 위한 신호를 생성할 수 있다(S1735). 만차 또는 예약 완료된 차량이 아닌 경우, 프로세서는, 주정차가 가능한 도로에 위치하는지 판단할 수 있 다(S1740). 프로세서는, 주정차가 가능한 도로에 위치하지 않는 것으로 판단되는 경우, 정보 출력 디스플 레이에 차량 이용 불가능 메시지를 출력하기 위한 신호를 생성할 수 있다(S1745). 차량 주정차 가능한 도로에 위치하는 것으로 판단되는 겨웅, 프로세서는, 정보 출력 디스플레이에 목 적지를 순차 출력하거나 노선 도로를 출력하도록 신호를 생성할 수 있다(S1750). 이후에, 프로세서는, 주행 중 추가 승차가 발생하는지 판단할 수 있다(S1760). 추가 승차가 발생하는 경우, 프로세서는, S1710 단계로 회귀할 수 있다. 추가 승차가 발생하지 않는 경우, 프로세서는, 주행 중 하차가 발생하는지 판단할 수 있다(S1770). 추가 하차가 발생하는 경우, 프로세서는, S1710 단계로 회귀할 수 있다. 도 18은 본 발명의 실시예에 따른 차량 내부이다. 도 18을 참조하면, 프로세서는, 차량의 내부를 촬영하는 내부 카메라로부터 내부 영상 데이터를 획득 할 수 있다. 프로세서는, 내부 영상 데이터에서 탑승객을 검출할 수 있다. 프로세서는, 내부 영상 데 이터에 기초하여, 탑승 인원 및 탑승 위치를 확인할 수 있다. 프로세서는, 정보 표시 디스플레이에, 탑승 객의 유무, 탑승 인원 및 탑승 위치에 대한 정보가 표시되도록 신호를 생성할 수 있다. 프로세서는, 차량이 특수 차량인 경우, 정보 표시 디스플레이에, 제공되는 서비스에 대한 정보가 출력 되도록 신호를 생성할 수 있다. 예를 들면, 프로세서는, 차량이 카페 차량인지, 장애인 탑승 가능 차 량인지, 어린이 차량인지, 스포츠 차량인지 여부에 대한 정보가 출력되도록 신호를 생성할 수 있다. 도 19는 본 발명의 실시예에 따른 외부인을 설명하는데 참조되는 도면이다. 도 19를 참조하면, 차량용 전자 장치는, 갓길 주정차 중이거나 도로를 주행 중인 차량에 대해 탑승 요청자 (외부인)를 인식하고 판단할 수 있다. 프로세서는, 차량의 외부를 촬영하는 카메라로부터 외부 영상 데이터를 획득할 수 있다. 프로세서 는, 외부 영상 데이터에서 외부인을 검출할 수 있다. 프로세서는, 외부 영상 데이터에서, 외부인의 얼굴, 외부인의 몸통, 외부인의 팔, 외부인의 제스쳐를 검출할 수 있다. 프로세서는, 외부인의 얼굴, 외부인의 몸통, 외부인의 팔, 외부인의 제스쳐 중 적어도 어느 하나에 기초 하여, 외부인의 탑승 의사를 판단할 수 있다. 프로세서는, 외부인의 얼굴 방향이 차량 쪽을 향하는 것으로 판단되는 경우, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인의 시선이 모두 차량 쪽을 향하면서, 차량의 움직임에 따라 시선이 움직이는 것으로 판단되는 경우, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인의 몸통이 차도를 향해 기울어진 것으로 판단되는 경우, 탑승 의사가 있는 것으 로 판단할 수 있다. 프로세서는, 외부인의 몸통이 차량을 마주보는 것으로 판단되는 경우, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인의 팔이 도로를 향해 뻗어 있는 것으로 판단되는 경우, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인의 팔이 일정정도 구부러진채 뻗어 있는 경우에도, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인의 팔이 위를 향해 뻗어 있는 것으로 판단되는 경우, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인의 팔이 일정정도 구부러진채 뻗어 있는 경우에도, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인의 팔이 차량을 향해 뻗어 있는 것으로 판단되는 경우, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인의 팔이 일정정도 구부러진채 뻗어 있는 경우에도, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인이 손가락이 뻗는 제스쳐를 하는 것으로 판단되는 경우, 탑승 의사가 있는 것으로 판단 할 수 있다. 프로세서는, 외부인이 손을 드는 제스쳐를 하는 것으로 판단되는 경우, 탑승 의사가 있는 것으로 판단할 수 있다. 프로세서는, 외부인이 팔 전체를 웨이빙하는 제스쳐를 하는 것으로 판단되는 경우, 탑승 의사가 있는 것으 로 판단할 수 있다. 프로세서는, 외부인이 차도와 인도의 경계 또는 경계에서 설정 거리 이내에 위치하는 것으로 판단되는 경 우, 탑승 의사가 있는 것으로 판단할 수 있다. 도 20은 본 발명의 실시예에 따라 외부인이 복수인 경우 차량용 전자 장치의 동작을 설명하는데 참조되는 도면 이다. 도 20을 참조하면, 차량용 전자 장치는, 갓길 주정차 중이거나 도로를 주행 중인 차량에 대하여, 탑승 요청자(외부인)를 인식하고 판단할 수 있다. 프로세서는, 외부 영상 데이터에서 복수의 외부인(2010, 2020, 2030)을 검출할 수 있다. 프로세서는, 차량용 램프(예를 들면, 헤드 램프)를 이용하여, 탑승 가능 위치에 광이 출력되도록 신호를 생성할 수 있다. 프로세서는, 탑승 가능 위치에 도착한 후, 탑승 가능 인원 정보와 목적지 정보를 정보 표시 디스플레이에 표시하도록 신호를 생성할 수 있다. 프로세서는, 탑승 가능 인원 정보와 목적지 정보를 음성으로 출력하도 록 신호를 생성할 수 있다. 프로세서는, 차량이 탑승 가능 위치에 도착한 후, 차량에 가장 근접한 제1 외부인에 우선권을 부 여할 수 있다. 도 21a 내지 도 21b는 본 발명의 실시예에 따른 탑승 요청 그룹을 설명하는데 참조되는 도면이다. 도면을 참조하면, 프로세서는, 외부 영상 데이터에서, 제1 외부인을 검출할 수 있다. 프로세서(97 0)는, 제1 외부인의 탑승 의사를 판단할 수 있다. 프로세서는, 제1 외부인으로부터 설정 거리 이내에 위치하는 제2 외부인을 제1 외부인과 같은 그룹으로 판단할 수 있다. 프로세서는, 제1 외부인 또는 제2 외부인과 설정 거리 이내에 위치하는 제3 외부인을 제1 외부인과 같 은 그룹으로 판단할 수 있다. 프로세서는, 제1 외부인, 제2 외부인 및 제3 외부인을 탑 승 요청 그룹으로 판단할 수 있다. 프로세서는, 탑승 인원수를 확인할 수 있다(S2110). 프로세서는, 탑승 요청 그룹의 인원 탑승 전에 탑승 인원수를 확인할 수 있다. 만약, 탑승 요청 인원이 탑승 가능 인원 이하인 경우(S2120), 프로세서는, 도어를 오픈하고, 탑승 안내 메시지를 제공하도록 신호를 생성할 수 있다(S2130). 만약, 탑승 요청 인원이 탑승 가능 인원보다 많은 경우(S2120), 탑승 불가 메시지를 제공하도록 신호를 생성할 수 있다. 이경우, 프로세서 는, 근처에 탑승 가능한 차량을 배치하도록 요청할 수 있다(S2140). 도 22 내지 도 23은 본 발명의 실시예에 따라 복수의 차량을 제어하는 차량용 전자 장치의 동작을 설명하는데 참조되는 도면이다. 프로세서는, 복수의 차량(10a, 10b)으로부터 외부 영상 데이터를 획득할 수 있다. 프로세서는, 복수 의 영상 데이터에 기초하여, 탑승 요청자(외부인)을 인식하고 판단할 수 있다. 도22를 참조하면, 제1 차량(10a) 및 제2 차량(10b)이 목적지가 동일한 경우, 프로세서는, 복수의 차량간 외부인 정보를 공유할 수 있다. 프로세서는, 기 설정된 기준에 따라, 제1 차량(10a) 및 제2 차량(10b) 중 어느 하나의 차량을 탑승 차량으로 선택할 수 있다. 만약, 탑승 요청 인원이 1명인 것으로 판단되는 경우, 프로세서는, 차로 변경이 쉬운 차량을 탑승 차량으 로 선택할 수 있다. 구체적으로, 프로세서는, 외부인에 더 근접한 차로로 주행 중인 제2 차량(10b) 을 탑승 차량으로 선택할 수 있다. 만약, 탑승 요청 인원이 2명 이상인 것으로 판단되는 경우, 프로세서는, 기 탑승한 인원이 적은 차량을 탑 승 차량으로 선택할 수 있다. 도 23을 참조하면, 제1 차량(10a) 및 제2 차량(10b)이 목적지가 다른 경우, 프로세서는, 차량별로 다른 인 터렉션 메세지가 출력되도록 신호를 생성할 수 있다. 예를 들면, 프로세서는, 제1 차량(10a)은 제1 제스쳐 수행을 요구하는 인터렉션 메세지가 출력되도록 신호를 생성할 수 있다. 예를 들면, 프로세서는, 제2 차량 (10b)은, 제2 제스쳐 수행을 요구하는 인터렉션 메세지가 출력되도록 신호를 생성할 수 있다. 프로세서는, 외부인의 제스쳐를 제1 제스쳐로 판단하는 경우, 제1 차량(10a)을 탑승 차량으로 선택 할 수 있다. 도 24 내지 도 27은 본 발명의 실시예에 따라, 개인용 단말기를 이용하여 차량을 호출하는 동작을 설명하는데 참조되는 도면이다. 도 24를 참조하면, 차량용 전자 장치는, 사용자 단말기로부터 승차 요청을 수신할 수 있다. 사용자 단말기는 증강 현실(augmented reality, AR) 유저 인터페이스(user interface, UI)를 제공할 수 있다. 사용자 단말기는 영상 위에 차량용 전자 장치로부터 수신된 차량 상황에 대한 정보를 표시할 수 있다. 예를 들면, 사용자 단말기는, 목적지 정보, 경로 정보, 이용 가능한 시트 정보, 탑승 인원 정보, 특수 차량 여부에 대한 정보 등을 표시할 수 있다. 사용자 단말기는, 차량 상황에 대한 정보를 차량과 매 칭시켜 표시할 수 있다. 예를 들면, 사용자 단말기는, 차량 상황에 대한 정보를 차량 위 또는 차량 주변에 표시할 수 있다. 사용자는 차량 상황에 대한 정보를 확인하고, 사용자 단말기를 통해, 탑승을 요청할 수 있다. 사용자 단말 기는, 사용자 입력에 기초한 탑승 요청 신호를 차량용 전자 장치에 전송할 수 있다. 도 25를 참조하면, 사용자 단말기는, 영상에서 복수의 차량 중 사용자 요구에 맞는 차량을 하이라이트 처 리할 수 있다. 예를 들면, 사용자 단말기는, 사용자가 입력한 목적지에 매칭되면서 잔여 시트가 있는 차량 을 하이라이트 처리할 수 있다. 사용자는 하이라이트 처리된 차량을 선택하여, 탑승을 요청할 수 있다. 사용자 단말기는, 사용자 입력에 기초한 탑승 요청 신호를 차량용 전자 장치에 전송할 수 있다. 도 26을 참조하면, 사용자 단말기는, 영상에 차량이 존재하지 않아도, 차량이 접근 중인 경우, 차량 상황 에 대한 정보를 표시할 수 있다. 이경우, 사용자 단말기는, 차량이 접근 중인 방향에 차량 상황에 대한 정 보를 매칭시켜 표시할 수 있다. 도 27을 참조하면, 사용자는 차량이 보이지 않는 경우, 사용자 단말기를 통해 목적지를 입력한 후, 사용자 단말기를 웨이빙(waving) 하는 제스쳐를 수행함으로써, 차량에 대한 탑승 요청 신호를 생성할 수 있다. 사 용자 단말기는, 목적지 입력 이후, 사용자 단말기의 기설정된 움직임이 감지되는 경우 탑승 요청 신 호를 차량용 전자 장치에 전송할 수 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 또한 캐리어 웨이브(예를 들어, 인터넷을 통한 전송)의 형태로 구현되는 것도 포함한다. 또한, 상기 컴퓨터는 프로세서 또는 제어부를 포함할 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예 시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2019-0106851", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 차량을 도시한 도면이다. 도 2는 본 발명의 실시예에 따른 차량의 내부를 도시한 도면이다. 도 3은 본 발명의 실시에에 따른 차량용 캐빈 시스템을 설명하는데 참조되는 블럭도이다. 도 4a 내지 도 4c는 본 발명의 실시예에 따른 입력 장치를 설명하는데 참조되는 도면이다. 도 5는 본 발명의 실시예에 따라 통신 장치와 이동 단말기의 통신 동작을 설명하는데 참조되는 도면이다. 도 6은 본 발명의 실시예에 따른 디스플레이 시스템을 설명하는데 참조되는 도면이다.도 7은 본 발명의 실시예에 따른 카고 시스템을 설명하는데 참조되는 도면이다. 도 8은 본 발명의 실시예에 다른 시트 시스템을 설명하는데 참조되는 도면이다. 도 9는 본 발명의 실시예에 따른 페이먼트 시스템을 설명하는데 참조되는 도면이다. 도 10은 본 발명의 실시예에 따라 사용자의 이용 시나리오를 설명하는데 참조되는 도면이다. 도 11은 본 발명의 실시예에 따른 차량의 제어 블럭도이다. 도 12는 본 발명의 실시예에 따른 시스템의 구성도이다. 도 13은 본 발명의 실시예에 따른 차량용 전자 장치의 제어 블럭도이다. 도 14는 본 발명의 실시예에 따른 차량용 전자 장치의 플로우 차트이다. 도 15는 본 발명의 실시예에 따른 차량용 전자 장치의 플로우 차트이다. 도 16은 본 발명의 실시예에 따라 차량에 구비되는 외부 디스플레이를 설명하는데 참조되는 도면이다. 도 17은 본 발명의 실시예에 따른 차량용 전자 장치의 플로우 차트이다. 도 18은 본 발명의 실시예에 따른 차량 내부이다. 도 19는 본 발명의 실시예에 따른 외부인을 설명하는데 참조되는 도면이다. 도 20은 본 발명의 실시예에 따라 외부인이 복수인 경우 차량용 전자 장치의 동작을 설명하는데 참조되는 도면 이다. 도 21a 내지 도 21b는 본 발명의 실시예에 따른 탑승 요청 그룹을 설명하는데 참조되는 도면이다. 도 22 내지 도 23은 본 발명의 실시예에 따라 복수의 차량을 제어하는 차량용 전자 장치의 동작을 설명하는데 참조되는 도면이다. 도 24 내지 도 27은 본 발명의 실시예에 따라, 개인용 단말기를 이용하여 차량을 호출하는 동작을 설명하는데 참조되는 도면이다."}
