{"patent_id": "10-2015-7034690", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0009614", "출원번호": "10-2015-7034690", "발명의 명칭": "사물 인터넷을 위한 지능형 협상 서비스", "출원인": "콘비다 와이어리스, 엘엘씨", "발명자": "동, 리준"}}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "방법으로서:연결된 엔티티들의 네트워크에서의 협상 서비스 엔티티에서 제1 엔티티로부터 협상 요청을 수신하는 단계;상기 제1 엔티티를 상기 협상 서비스 엔티티에 받아들이는 단계;상기 협상 서비스 엔티티에서 협상 표적 엔티티를 결정하는 단계;상기 협상 서비스 엔티티로부터의 표적 협상 요청을 상기 협상 표적 엔티티에게 전송하는 단계;상기 협상 서비스 엔티티에서 상기 협상 표적 엔티티로부터의 협상 응답을 수신하는 단계; 및 상기 협상 서비스 엔티티로부터의 협상 결과를 상기 제1 엔티티에게 전송하는 단계를 포함하는 방법."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 협상 표적 엔티티를 결정하는 단계는:서비스 제공자 발견 요청을 발견 서비스에게 전송하는 단계; 및 상기 발견 서비스로부터 협상 표적 엔티티 식별자를 포함하는 서비스 제공자 발견 응답을 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 협상 표적 엔티티 식별자는 복수의 협상 표적 엔티티 식별자 및 상기 복수의 협상 표적엔티티 식별자 중 각각의 제각기 협상 표적 엔티티 식별자와 연관되는 데이터를 포함하는, 방법."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 각각의 제각기 협상 표적 엔티티 식별자와 연관되는 데이터에 기초하여 상기 복수의 협상표적 엔티티 식별자 중에서 상기 협상 표적 엔티티 식별자를 선택하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 협상 요청의 우선순위를 결정하는 단계; 상기 협상 요청을 큐에 놓고 상기 협상 요청의 우선순위에 기초하여 상기 협상 요청을 상기 큐로부터 선택하는단계; 및 상기 큐로부터의 상기 협상 요청의 선택 시에 협상 요청 수용 표시를 상기 제1 엔티티에게 전송하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 협상 요청이 수신된 이후로 상기 제1 엔티티의 콘텍스트가 변화했다는 통지를 수신하는 단계;제2 협상 표적 엔티티가 상기 협상 요청과 연관되는 요청된 서비스를 제공해야 한다는 것을 결정하는 단계; 제2 표적 협상 요청을 상기 제2 협상 표적 엔티티에게 전송하는 단계;공개특허 10-2016-0009614-3-상기 제2 협상 표적 엔티티로부터 제2 협상 응답을 수신하는 단계; 및 제2 협상 결과를 상기 제1 엔티티에게 전송하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 협상 표적 엔티티를 결정하는 단계는:상기 협상 요청이 상기 협상 표적 엔티티를 포함하지 않는 것을 결정하는 단계; 및 적어도 하나의 이전 협상 요청에 기초하여 상기 협상 표적 엔티티를 결정하는 단계 - 상기 적어도 하나의 이전협상 요청은 상기 제1 엔티티 및 상기 협상 요청과 연관되는 요청된 서비스 중 적어도 하나와 연관됨 - 를 포함하는, 방법."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "연결된 엔티티들의 네트워크에서의 협상 서비스 엔티티로서:컴퓨터 판독 가능 명령어들을 실행하도록 적응되는 제1 프로세서; 및 상기 제1 프로세서에게 통신 가능하게 결합되는 제1 메모리 - 상기 제1 메모리는, 상기 제1 프로세서에 의해 실행될 때, 상기 프로세서로 하여금: 제1 엔티티로부터 협상 요청을 수신하는 단계; 상기 제1 엔티티를 상기 협상 서비스 엔티티에 받아들이는 단계; 협상 표적 엔티티를 결정하는 단계;표적 협상 요청을 상기 협상 표적 엔티티에게 전송하는 단계;상기 협상 표적 엔티티로부터 협상 응답을 수신하는 단계; 및협상 결과를 상기 제1 엔티티에게 전송하는 단계를 포함하는 동작들을 실행하도록 야기하는 컴퓨터 판독 가능명령어들을 저장함 -를 포함하는 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 제1 메모리는, 상기 제1 프로세서에 의해 실행될 때, 상기 프로세서로 하여금:서비스 제공자 발견 요청을 발견 서비스에게 전송하는 단계; 및 상기 발견 서비스로부터 협상 표적 엔티티 식별자를 포함하는 서비스 제공자 발견 응답을 수신하는 단계 - 상기협상 표적 엔티티 식별자는 상기 제1 엔티티에 인접한 협상 표적 엔티티와 연관됨 - 를 포함하는 동작들을 실행하도록 야기하는 컴퓨터 판독 가능 명령어들을 더 포함하는 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 제1 엔티티 및 상기 제2 엔티티는 동일 기능을 실행하는, 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 제1 메모리는, 상기 제1 프로세서에 의해 실행될 때, 상기 프로세서로 하여금:상기 제1 엔티티 및 상기 협상 표적 엔티티를 위한 작업 스케줄을 결정하는 단계를 포함하는 동작들을 실행하도록 야기하는 컴퓨터 판독 가능 명령어들을 더 포함하는 협상 서비스 엔티티.공개특허 10-2016-0009614-4-청구항 12 제9항에 있어서, 상기 제1 메모리는, 상기 제1 프로세서에 의해 실행될 때, 상기 프로세서로 하여금:콘텍스트 요청을 콘텍스트 인식 서비스에게 전송하는 단계; 및 상기 협상 표적 엔티티를 위한 콘텍스트 및 상기 제1 엔티티를 위한 콘텍스트를 포함하는 콘텍스트 응답을 수신하는 단계를 포함하는 동작들을 실행하도록 야기하는 컴퓨터 판독 가능 명령어들을 더 포함하는 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 제1 메모리는, 상기 제1 프로세서에 의해 실행될 때, 상기 프로세서로 하여금:상기 협상 표적 엔티티를 위한 콘텍스트 및 상기 제1 엔티티를 위한 콘텍스트에 기초하여 상기 제1 엔티티 및상기 협상 표적 엔티티를 위한 작업 스케줄을 결정하는 단계를 포함하는 동작들을 실행하도록 야기하는 컴퓨터판독 가능 명령어들을 더 포함하는 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서, 상기 협상 응답은 협상 거부를 포함하는, 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "연결된 엔티티들의 네트워크에서의 협상 서비스 엔티티로서:컴퓨터 판독 가능 명령어들을 실행하도록 적응되는 제1 프로세서; 및 상기 제1 프로세서에 통신 가능하게 결합되는 제1 메모리 - 상기 제1 메모리는, 상기 제1 프로세서에 의해 실행될 때, 상기 프로세서로 하여금: 제1 엔티티로부터 협상 요청을 수신하는 단계 - 상기 협상 요청은 요청된 서비스 표시를 포함함-;상기 협상 요청이 협상 표적 엔티티를 포함하지 않는 것을 결정하는 단계;상기 요청된 서비스 표시에 기초하여 상기 협상 표적 엔티티를 결정하는 단계;표적 협상 요청을 상기 협상 표적 엔티티에게 전송하는 단계;상기 협상 표적 엔티티로부터 협상 응답을 수신하는 단계; 및 협상 결과를 상기 제1 엔티티에게 전송하는 단계를 포함하는 동작들을 실행하도록 야기하는 컴퓨터 판독 가능명령어들을 저장함 -를 포함하는 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 제1 메모리는, 상기 제1 프로세서에 의해 실행될 때, 상기 프로세서로 하여금:제2 엔티티로부터 제2 협상 요청을 수신하는 단계;상기 제2 엔티티가 상기 제1 엔티티보다 더 높은 우선순위를 갖는 것을 결정하는 단계; 및 협상 서비스를 상기 제1 엔티티에게 제공하기 전에 협상 서비스를 상기 제2 엔티티에게 제공하는 단계를 포함하는 동작들을 실행하도록 야기하는 컴퓨터 판독 가능 명령어들을 더 포함하는 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서, 상기 제1 메모리는, 상기 제1 프로세서에 의해 실행될 때, 상기 프로세서로 하여금:공개특허 10-2016-0009614-5-상기 협상 요청이 수신된 이후로 상기 제1 엔티티의 콘텍스트가 변화했다는 통지를 수신하는 단계;제2 협상 표적 엔티티가 상기 협상 요청과 연관되는 요청된 서비스를 제공해야 한다는 것을 결정하는 단계; 제2 표적 협상 요청을 상기 제2 협상 표적 엔티티에게 전송하는 단계;상기 제2 협상 표적 엔티티로부터 제2 협상 응답을 수신하는 단계; 및 제2 협상 결과를 상기 제1 엔티티에게 전송하는 단계를 포함하는 동작들을 실행하도록 야기하는 컴퓨터 판독 가능 명령어들을 더 포함하는 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 제1 엔티티의 콘텍스트는 상기 제1 엔티티의 로케이션, 상기 제1 엔티티의 메모리 리소스들, 상기 제1 엔티티의 처리 리소스들, 상기 제1 엔티티의 대역폭 능력들 및 상기 제1 엔티티의 작업 스케줄중 적어도 하나를 포함하는, 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서, 상기 협상 서비스 엔티티는 M2M(machine-to-machine) 디바이스 상에 구성되는, 협상 서비스엔티티."}
{"patent_id": "10-2015-7034690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서, 상기 제1 메모리는, 상기 제1 프로세서에 의해 실행될 때, 상기 프로세서로 하여금:상기 표적 협상 요청을 상기 협상 표적 엔티티에게 전송한 후에 및 상기 협상 표적 엔티티로부터 상기 협상 응답을 수신하기 전에 상기 제1 엔티티로부터 제2 협상 요청을 수신하는 단계; 및상기 제2 협상 요청이 상기 협상 요청의 중복인 것을 나타내는 제2 협상 결과를 상기 제1 엔티티에게 전송하는단계를 포함하는 동작들을 실행하도록 야기하는 컴퓨터 판독 가능 명령어들을 더 포함하는 협상 서비스 엔티티."}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "서비스로서 IoT 사물들, IoT 엔티티들, 및/또는 IoT 애플리케이션들 사이의 협상을 제공하기 위한 디바이스들, 방법들, 및 시스템들이 본 명세서에 개시된다. IoT 엔티티들은, 표적 서비스의 위치를 정하고 또한 요청하는 IoT 엔티티들을 대신하여 표적 서비스로부터 서비스를 요청하는 협상 서비스에 받아들여질 수 있다. 비슷한 공 간, 서비스 가격, 및 서비스 지속기간에서 비슷한 기능을 실행하는 디바이스들의 세트를 위한 작업 스케줄과 같 은 다양한 서비스들 및 관련 파라미터가 협상될 수 있다."}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "[관련 출원들에 대한 상호 참조] 본 명세서는, 2013년 5월 6일에 출원되고, 발명의 명칭이 \" IoT를 위한 지능형 협상 서비스(INTELLIGENT NEGOTIATION SERVICE FOR INTERNET OF THINGS)\"인 미국 임시 특허 출원 번호 제61/819,922호에 근거한 이익을 청구하고, 이것의 내용은 본 명세서에 참조로서 이로써 통합된다. M2M(Machine-to-machine) 기술들은 디바이스들로 하여금 유선 및 무선 통신 시스템들을 이용하여 서로 더 직접 적으로 통신하도록 허용한다. M2M 기술들은, 고유하게 식별 가능한 대상들 및 인터넷과 같은 네트워크에 걸쳐 서 서로 통신하는 그러한 대상들의 가상 표현들의 시스템인 사물 인터넷(Internet of Things: IoT)의 추가적 실 현을 가능하게 한다. IoT는 식료품점에서의 제품들 또는 가정 집에서의 가전 기기들과 같은 매우 평범한 일상 적 대상들과의 통신을 용이하게 할 수 있고, 이에 의해 그러한 대상들에 대한 지식을 향상시킴으로써 비용 및 낭비를 줄일 수 있다. 예를 들어, 가게들은 재고 상태에 있을 수 있거나 판매되었을 수 있는 대상들과 통신하 거나 그로부터 데이터를 획득할 수 있기 때문에 매우 정확한 재고 데이터를 유지할 수 있다. IoT 시스템 내의 엔티티들은 통신하고, 엔티티들 중 하나에 의해 제공되는 서비스들을 이용하고, 차이들을 해결 하고, 행동들을 조정하고, 또는 엔티티들 중 하나 또는 양쪽에게 몇몇 유형의 이점들을 제공할 수 있는 기타 활 동들을 실행하기 위해서 서로 협상할 수 있다. 그러나, 개별 IoT 엔티티들 간의 직접 협상은 몇 가지 이유 때 문에 바람직하지 않을 수 있다. IoT 디바이스들은 제한된 처리 능력, 메모리, 통신 능력, 및/또는 배터리 전력 을 갖는 자원 제약된 디바이스들일 수 있다. 그러므로, 각각의 IoT 엔티티가 또 다른 디바이스와의 협상을 실 행하기 위해 필요한 상세한 정보를 유지하고 발생하도록 요구하는 것은 가능하지 않거나, 효율적이지 않을 수 있다. 엔티티들 중 하나는, 다른 IoT 엔티티들의 인식 부족 또는 또 다른 엔티티와의 성공적 협상에 요구되는지식의 부족과 같은 여러 이유로 또 다른 엔티티와의 협상을 할 수 없거나 이를 꺼릴 수 있다."}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 명세서에 개시된 실시예들은, 연결된 엔티티들의 네트워크에서의 협상 서비스 엔티티에서 제1 엔티티로부터 의 협상 요청을 수신하고, 제1 엔티티를 협상 서비스 엔티티에 받아들이고, 및 요청에 대한 협상 표적 엔티티를 결정하기 위한 방법들을 포함한다. 표적 협상 요청은 이후 협상 표적 엔티티에게 보내질 수 있고, 협상 응답이 협상 표적 엔티티로부터 수신될 수 있다. 협상 결과는 협상 서비스로부터 제1 엔티티에게 보내질 수 있다. 본 명세서에 개시된 실시예들은, 제1 엔티티로부터 협상 요청을 수신하고, 제1 엔티티를 협상 서비스 엔티티에 받아들이고, 및 요청에 대한 협상 표적 엔티티를 결정하는 것을 포함하는 동작들을 실행하는 연결된 엔티티들의 네트워크에서의 협상 서비스 엔티티를 추가로 포함한다. 동작들은 표적 협상 요청을 협상 표적 엔티티에게 전 송하고, 협상 표적 엔티티로부터 협상 응답을 수신하고, 및 협상 결과를 제1 엔티티에게 전송하는 것을 추가로 포함할 수 있다. 본 명세서에 개시된 실시예들은, 제1 엔티티로부터 협상 요청을 수신하고, 과거 협상 요청이 제1 엔티티로부터 수신된 것 및 과거 협상 요청을 수신한 것에 응답하여 제1 엔티티가 협상 서비스 엔티티에게 받아들여진 것을 결정하고, 및 과거 협상 요청이 제1 엔티티로부터 수신된 것 및 과거 협상 요청을 수신한 것에 응답하여 제1 엔 티티가 협상 서비스 엔티티에게 받아들여진 것을 결정한 것에 응답하여, 제1 엔티티를 협상 서비스 엔티티에 받 아들이는 동작들을 실행하는 연결된 엔티티들의 네트워크에서의 협상 서비스 엔티티를 추가로 포함한다. 동작 들은 협상 표적 엔티티를 결정하고, 표적 협상 요청을 협상 표적 엔티티에게 전송하고, 협상 표적 엔티티로부터 협상 응답을 수신하고, 및 협상 결과를 제1 엔티티에게 전송하는 것을 추가로 포함할 수 있다."}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "본 요약은 하기 상세한 설명에서 추가로 기술되는 개념들 중 선택된 것을 간단한 형태로 소개하기 위해 제공된"}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "다. 이 요약은 청구되는 주제의 주요 특징들 또는 핵심 특징들을 식별하기 위해 의도된 것이 아니며, 청구된 주제의 범위를 제한하기 위해 사용되도록 의도된 것도 아니다. 또한, 청구된 주제는 본 개시의 임의의 부분에 서 주목한 임의의 또는 모든 단점들을 해결하는 한정 사항들로만 제한되지는 않는다."}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "초안 ETSI TS 102 690 1.1.1(2011-10)과 그 가운데 사용된 용어들에서 기술된 바와 같은 M2M 기능 아키텍처뿐만 아니라, 초안 ETSI TS 102 921 V0.8.2(2011-09) 및 그 가운데 사용된 용어들에서 기술된 바와 같은, mIa, dIa 및 mId 와 같은 M2M 인터페이스들이 본 명세서에서의 기술적 목적을 위해 이용될 수 있다. 본 개시는 개시된 실시예들의 이해를 돕기 위해 이들 초안들을 참조할 수 있고 및/또는 이 규격에서 이해되는 바대로 이들 용어들 을 사용할 수 있다. 그러나, 통상의 기술자는 개시된 실시예들이 oneM2M 및 기타 M2M 시스템들과 아키텍처들과 같은, 다른 아키텍처들 및 시스템들에서 구현될 수 있다는 것을 인식할 것이다. 본 명세서에 제시된 실시예들은 REST(representational state transfer) 아키텍처 관점에서 기술되고, 기술되 는 컴포넌트들 및 엔티티들은 REST 아키텍처(RESTful 아키텍처)의 제약들을 준수한다. RESTful 아키텍처는 이 용되는 물리적 컴포넌트 구현 또는 통신 프로토콜들의 관점에서보다는 오히려 이 아키텍처에 사용되는 컴포넌트 들, 엔티티들, 커넥터들, 및 데이터 요소들에 적용되는 제약들의 관점에서 설명된다. 그러므로, 컴포넌트들, 엔티티들, 커넥터들, 및 데이터 요소들의 역할들과 기능들이 기술될 것이다. RESTful 아키텍처에서, 고유하게 어드레싱 가능한 리소스들의 표현들이 엔티티들 간에 전송될 수 있다. 통상의 기술자는 본 실시예들의 구현들 이 본 개시의 범위 내에 남아 있으면서 변할 수 있다는 것을 이해할 것이다. 통상의 기술자는 또한 개시된 실 시예들이 예시적 실시예들을 기술하기 위해 본 명세서에 사용되는 ETSI M2M 아키텍처를 이용하는 구현들로만 제 한되지 않는다는 것을 이해할 것이다. 개시된 실시예들은 예컨대, oneM2M 및 다른 M2M 시스템들 및 아키텍처들 과 같은 다른 아키텍처들 및 시스템들에서 구현될 수 있다. 실시예에서, 협상 서비스 아키텍처가 IoT 엔티티들 간의 협상들을 용이하게 하는데 이용될 수 있다. 그와 같은 협상들은, 어느 한 엔티티에 의해 또 다른 것에게 IoT 서비스들을 제공하는 방법, 기타 등등과 같은 IoT 엔티티 들 간의 다양한 상호작용들을 결정하는데 이용될 수 있다. IoT 엔티티들은 어떻게 및 언제 서비스들을 서로에 게 제공할지를 결정하기 위해 서로 협상할 수 있다. 예를 들어, 협상들은 엔티티들을 위한 작업 스케줄을 결정 하고, 서비스를 제공할 적절한 엔티티들을 결정하고, 데이터를 (예를 들어, 주기적으로) 획득하고, 기타 등등을 하기 위해 이용될 수 있다. 도 1은 그것과 함께 연관될 수 있는 예시적 협상 서비스와 기능들을 도해한다. 이러한 기능들은 IoT 엔티티들, IoT 서비스들, 및 IoT 애플리케이션들에게 협상 서비스들을 제공하 는 것을 조력할 수 있다. 각각의 이들 기능들은 각각의 다른 기능 및 협상 서비스에 구현되는 임의의 다 른 기능과 통신할 수 있다. 협상 서비스에 의해 제공될 수 있는 기능들 중에는, IoT 엔티티들, IoT 애플리케이션들, 및/또 는 다른 IoT 서비스들로부터 협상 요청들을 수신할 수 있는 협상 요청 처리 기능이 있을 수 있다. IoT 서비스들은, 서비스들을 제공하는 데에 이용 가능한 IoT 엔티티들상에서 정보를 결정하고 이 정보를 리턴할 수 있는 발견 서비스, 서비스들을 용이하게 하고 및/또는 전달하는 전달 서비스, 엔티티 리소 스들을 가상화하여 이들이 다른 IoT 엔티티들에 의해 이용될 수 있도록 할 수 있는 가상화 서비스, 콘텐츠 복사들, 콘텐츠 품질, 및 콘텐츠 포맷을 제공할 수 있는 콘텐츠 인식 서비스, IoT 엔티티들에 의해 이용될 수 있는 IoT 엔티티들에 관한 콘텍스트 정보를 제공할 수 있는 콘텍스트 인식 서비스, 및 클라우드 컴퓨팅 서비스들을 제공할 수 있는 클라우드 서비스를 포함할 수 있는데, 이것들에만 한정되지는 않는다. 협상 요청 처리 기능은 들어오는 협상 요청들의 승인 제어를 수행하고, 수용된 들어오는 요청들을 버퍼링하고 우선순위화하고, 협상 요청들의 우선순위들을 조절하고, 및 이들의 제각기 우선순위들 및/또는 정책들에 기초하 여 협상 요청들을 스케줄링할 수 있다. 협상 서비스에 의해 제공될 수 있는 또 다른 기능은, 이것으로 하여금 (예를 들어, 협상 요청 처리 기능 으로부터 수신되는) 협상 요청에 대한 목적지를 결정하는 것과, 협상을 위한 최고 전략을 결정하는 것과 같은 협상 판정들, 및 기타 협상 판정들을 가능하게 하는 인지 능력을 포함할 수 있는 협상 판정 기능일수 있다. 그와 같은 판정들은, 콘텍스트 및 콘텐츠 관련 데이터, 정책들, 기타 등등을 포함하는 이용 가능하거 나 획득 가능한 데이터에 기초해 이뤄질 수 있다 협상 서비스에 의해 제공될 수 있는 또 다른 기능은, 현재 상태들에 협상을 적응시키는 방법을 결정하기 위해, (예를 들어, 협상 모니터링 기능으로부터 수신되는) 실시간 모니터링 결과들을 이용할 수 있는 협상 적응 기능일 수 있다. 예를 들어, 협상 적응 기능은, (예를 들어, 협상 판정 기능에 의해 결정 된) 이전 협상으로부터 유래한 전략을 종결하고, 현재 협상을 재평가하고, 새로운 협상 전략을 형성하고, 최근 에 결정된 당사자들과 재협상할 수 있다. 협상 서비스에 의해 제공될 수 있는 또 다른 기능은, 결정된 협상 전략(예를 들어, 협상 판정 기능에 의해 결정됨)으로 협상 요청을 선택된 협상 당사자(예를 들어, 협상 판정 기능에 의해 결정됨)에게 보내기 위한 판정과 같은 협상 판정들을 실행할 수 있는 협상 실행 기능일 수 있다. 협상 서비스에 의해 제공될 수 있는 또 다른 기능은, 요청자가 결정된 전략으로 그 협상 목표를 달성하였 는지를 모니터링함으로써 협상 당사자들이 만족되는 것을 보장하기 위해 협상 전략 실행(예를 들어, 협상 실행 기능에 의해 실행됨)을 모니터링하고 또한 협상 서비스를 개선하기 위해 피드백을 이용할 수 있는 협상 모 니터링 기능일 수 있다. 실시예에서, 협상 서비스는 콘텐츠, 상황에 따른 콘텍스트들, 및 정책 정보를 분석하는 것에 기초하여 취 할 행동들의 지식을 구축하고 유지하는 인지 능력 또는 인공 지능을 포함할 수 있다. 그러한 인지 능력은 과거 상황들, 관찰들, 판정들, 및 행동들로부터 배울 수 있고, 이 지식을 이용하여 미래 판정들을 할 수 있다. 협상 서비스의 인지 능력은 인간 인지 절차들을 근사화하는 인지 모델에 의존할 수 있다. 이 인지 모델은 이해 및 판정(즉, 지식) 기능성들의 범위를 정의할 수 있다. 협상 서비스의 인지 능력은, 협상 요청 승인을 결 정하기 위한 협상 요청 처리 기능에 의해, 협상 당사자들 및 협상 전략을 결정하기 위한 협상 판정 기능 에 의해, 협상 적응을 결정하기 위한 협상 적응 서비스에 의해, 및 임의의 다른 결정들 또는 다른 분 석을 수행하기 위한 임의의 다른 협상 서비스 기능에 의해 이용될 수 있다. 협상 서비스는 IoT 서비스들, IoT 엔티티들, 및 IoT 애플리케이션들과 상호 작용하기 위한 다양한 인터페 이스들을 사용할 수 있다. 예를 들어, 인터페이스는 연관된 협상 기능들에 의한 새로운 협상, 협상 모니 터링, 및/또는 협상 적응을 트리거링할 수 있는 IoT 애플리케이션들으로부터 협상 요청들을 수신하는데 이 용될 수 있다. 인터페이스는 연관된 협상 기능들에 의한 새로운 협상, 협상 모니터링, 및/또는 협상 적응 을 또한 트리거링할 수 있는 IoT 엔티티들로부터의 협상 요청들을 수신하는데 이용될 수 있다. 실시예에서, 인터페이스는 다양한 IoT 서비스들과 상호 작용하기 위해 협상 서비스에 의해 이용될 수 있다. 예를 들어, 협상 서비스는, 콘텐츠 인식 서비스, 콘텍스트 인식 서비스, 가상화 서비스, 기타 등등과 같은 다른 서비스들을 결정하기 위해 발견 서비스와 상호 작용할 수 있다. 인터페이스 는 협력 및 협상에 수반될 수 있는 동일 서비스 또는 서비스의 부분들을 제공할 수 있는 서비스 제공자들을 발 견하는데 또한 이용될 수 있다. 인터페이스는 특정 듀티 스케줄들로 서비스들을 제공하는 서비스 제공자들과 협상하기 위해 전달 서비스 와 상호 작용하기 위해 협상 서비스에 의해 또한 이용될 수 있다. 예를 들어, 전달 서비스는, 서비스가 요청되고 있을 때 이것이 근무 중인 서비스 제공자에 의해 전달되는 것을 보장하기 위해 인터페이스 를 경유해 협상 서비스와 상호 작용할 수 있다. 인터페이스는, 예를 들어 가격 및 QoS(quality of service) 파라미터들의 다른 서비스 전달 관련 품질을 협상함으로써 경쟁 관계에 있지만 동일 서비스를 제공 하는 서비스 제공자들과 협상하고 또한 요청자들에게 전달하게 될 서비스를 결정하기 위해 전달 서비스와 의 상호작용을 위해 이용될 수 있다. 인터페이스는, 도중의 노드들(즉, 서비스 제공자와 서비스 요청자 사이의 경로상에 있는 노드들) 중에서 협상하여 도중의 노드들이 서비스들의 부분들을 전달하고 또한 전체 서비 스를 제공하는데 있어서 조력할 의향이 있도록 하기 위해 전달 서비스와의 상호작용을 위해 또한 이용될 수 있다. 인터페이스는, IoT 서비스상에서 호스팅되는 가상화된 IoT 대상에 대한 접근을 협상하기 위해, 또 다른 IoT 서비스상으로의 가상화된 IoT 대상의 미러링을 협상하기 위해, 어느 한 IoT 서비스로부터 또 다른 것으로 가상화된 IoT 대상의 오프로딩 및/또는 이주를 협상하기 위해, IoT 애플리케이션의 요구들을 충족시키기 위해 가상화된 IoT 대상을 적응시키도록 IoT 서비스와 협상하기 위해, 및 엔티티를 가상화할지의 여부 및/또는 이것 을 할 때를 결정하기 위해 적용 가능한 정책들을 협상하도록 가상화 서비스와의 상호작용을 위해 협상 서비스에 의해 또한 이용될 수 있다. 인터페이스는 콘텐츠 복사들, 콘텐츠 품질, 및 컨텐츠 포맷을 레버리지하도록 콘텐츠 인식 서비스와 의 상호작용을 위해 협상 서비스에 의해 또한 이용될 수 있다. 예를 들어, IoT 엔티티들 중 하나는 호환 콘텐츠 서비스들이 다른 IoT 엔티티들로부터 자신에게 전달될 것을 요청할 수 있다. 호환성은 IoT 엔티티 의 로컬 콘텐츠와 호환하는 콘텐츠 서비스들을 제공하는 IoT 엔티티의 인식 및/또는 IoT 엔티티들의 로컬 콘텐 츠에 기초하여, IoT 엔티티에 의해 또는 협상 서비스에 의해 결정될 수 있다. 일단 호환성이 결정된다면, 호환 콘텐츠 서비스들은 다시 IoT 엔티티에 의해 또는 협상 서비스에 의해 결정될 수 있고, IoT 엔티티는 호환 콘텐츠 서비스들이 호환 서비스를 제공하는 결정된 IoT 엔티티 또는 엔티티들로부터 자신에게 전달되기를 요청할 수 있다. 협상 서비스는, 요청하는 IoT 엔티티를 대신하여, 콘텐츠 품질, 콘텐츠 포맷, 및/또는 콘텐츠 가격에 대한 호환 서비스를 제공하는 결정된 IoT 엔티티 또는 엔티티들과 협상할 수 있다. 추가적 협상 들은 요청하는 IoT 엔티티로부터의 거리 및 서비스 부하와 같은 다양한 요인들에 기초하여 콘텐츠를 전달하게 될 엔티티에 대해 협상하는 것을 포함할 수 있다. 콘텐츠 인식에 기초하여, 네트워크에서의 하나 이상의 중간 IoT 엔티티들은 콘텐츠를 캐싱하거나 저장할 수 있다. 중간 IoT 엔티티들은 저장 효율성을 향상시키기 위해 엔 티티들의 이용 가능한 스토리지에 기초하여 어느 엔티티가 콘텐츠를 캐싱할지를 협상할 수 있다. 인터페이스는 콘텍스트 인식 서비스와의 상호작용을 위해 협상 서비스에 의해 추가로 이용될 수 있다. 콘텍스트 정보는 서로에게 접근 가능하도록 될 수 있는 서비스들을 협상하기 위해 IoT 엔티티들 및 IoT 서비스들에 의해 이용될 수 있다. 예를 들어, IoT 엔티티들 중 제1 엔티티가 IoT 엔티티들 중 제2 엔티티가 IoT 엔티티들 중 제3 엔티티에 더 가까운 네트워크에서의 원격 로케이션에 자리잡은 것을 인식하 고 또한 제3 엔티티가 제1 엔티티와 동일 유형의 서비스를 제공한다면, 제1 엔티티는 제2 엔티티에의 서비스를 거절하고, 제2 엔티티에게 제3 엔티티가 그것에게 더 가깝게 상주하고 있고 동일 서비스를 제공한다는 것을 알 릴 수 있다. 콘텍스트 정보는 언제 각자가 네트워크에서의 다른 IoT 엔티티들에게 이 서비스를 이용 가능하게 만들지에 관해 서 서로 협상하기 위해 동일 서비스를 호스팅하는 IoT 엔티티들에 의해 또한 이용될 수 있다. 그렇게 함으로써, IoT 엔티티들은 자신들의 서비스들을 조정하고 스케줄링할 수 있고, 그에 의해 동일 서비스를 호스팅 하는 각각의 IoT 엔티티들에 대한 부하와 중복 서비스들을 최소화한다. 예를 들어, IoT 엔티티들 중 제1 IoT 엔티티와 제2 IoT 엔티티 모두가 제1 서비스를 호스팅하면, 제1 IoT 엔티티는 자신이 제1 서비스를 호스팅 한다는 것을 제2 IoT 엔티티에게 공표하거나 다른 식으로 발표할 수 있다. 제2 IoT 엔티티는 이후 다음 차례로, 제1 IoT 엔티티에게 이것이 이용 가능하다는 것을 알리고 또한 제1 서비스를 위한 그 선호된 서비스 스 케줄을 제공하기 위해 제1 IoT 엔티티에게 협상 메시지들을 보낼 수 있다. 제1 서비스를 호스팅하는 IoT 엔티 티들은 또한 제1 서비스를 호스팅하는 다른 엔티티들에게 자신들의 제각기 서비스 부하들을 발표하거나 공표할 수 있다. 제1 서비스를 호스팅하는 IoT 엔티티들은 메시지들을 교환하거나 다른 식으로 상호작용할 수 있어서 이들이 언제 각각의 IoT 엔티티가 서비스를 요청하는 네트워크에서의 다른 IoT 엔티티들에게 제1 서비스를 제공 할 수 있는지에 대한 스케줄에 대한 합의에 도달하도록 된다. 협상 서비스가 서비스에 대한 콘텍스트의 변경들에 기초하여 적응될 수 있다는 것을 유의한다. 인터페이스는, 클라우드 투 호스트(cloud-to-host) 협상 전략들을 지원하고 또한 QoS 및 가격에 대해 IoT 엔티티들과 협상하도록 클라우드 서비스와의 상호작용을 위해 협상 서비스에 의해 추가로 이용될 수 있다. 실시예에서, IoT 엔티티는 협상 서비스에의 승인을 요청할 수 있다. 그러한 협상 요청은 몇 가지 형태들 중 임 의의 것을 취할 수 있다. 실시예에서, 협상 요청은 요청에 포함되는 협상 목표에 의한 협상 서비스에의 승인을 위한 요청일 수 있다. 대안적으로, 협상 요청은 협상 서비스가 하나 이상의 적절한 협상 당사자(들)를 선택하고 리턴하라는 요청일 수 있다. 요청하는 IoT 엔티티(본 명세서에서 \"요청자\"로서 교환 가능하게 지칭될 수 있음)가 협상 서비스로부터 협상 당사자 정보를 수신한 후에, 이것은 협상 서비스가 그를 대신하여 협상 절차를 수행하는 것을 요청할지, 그 스스로 협상 당사자와 협상할지, 또는 협상에 선행할지를 결정할 수 있다. 또 다른 실시예에서, 요청은 협상 서비스가 적절한 협상 전략을 선택하고 리턴하라는 요청일 수 있다. 요청자 가 협상 전략 정보를 수신한 후에, 이것은 협상 서비스가 그를 대신하여 협상 절차를 수행하는 것을 요청할지, 그 스스로 협상 당사자와 협상할지, 또는 협상에 선행할지를 결정할 수 있다.또 다른 실시예에서, 요청은 요청자가 그를 대신해서 협상을 수행하기 위해 협상 서비스에게 의존할 것이라는 표시를 포함할 수 있다. 협상 서비스는 이후 협상 당사자 및 협상 전략을 선택하고 또한 요청자를 대신하여 합 의에 도달하기 위해 선택된 전략을 이용하여 선택된 협상 당사자와 협상하는 데로 진행할 수 있다. 또 다른 실시예에서, 요청은 요청자가 협상 서비스가 요청자를 수반하는 과거의 비슷한 협상 시나리오들로부터"}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약한 일반화된 협상 결과를 따를 의향이 있다는 표시를 포함할 수 있다. 또 다른 실시예에서, 요청은 요청자가 협상 서비스가 저장했을 또 다른 협상 요청자의 협상 전략을 따르고 싶다 는 표시를 포함할 수 있다. 다른 요청자는 IoT 서비스, IoT 엔티티, 또는 IoT 애플리케이션일 수 있다. 실시예에서, 요청은, 요청자로 하여금 하나 이상의 특정된 조건들이 충족된다면 또는 충족될 때 협상 통지들이 가입 요청자에게 보내지도록 하기 위한 목적으로 협상 서비스에 가입하는 것을 허용할 수 있는 가입 정보를 포 함할 수 있다. 그러한 요청에서의 가입 정보는 IoT 협상 서비스가 협상 통지를 트리거링하게 될 조건들(예를 들어, 정책들)을 포함할 수 있다. 대안적으로, 가입 요청에 어떠한 조건 정보도 없을 수 있다. 도 2는 협상 요청의 수신 시에 그러한 서비스를 실행하거나 호스팅하는 협상 서비스 및/또는 엔티티에 의해 실 행될 수 있는 예시적 승인 요청 절차를 도해한다. 도 2와 관련하여 기술된 기능들, 활동들, 및 절차들 중 임의의 것과 본 명세서에 개시되는 임의의 다른 절차들 또는 방법들이 임의의 순서로, 임의의 다른 기능들, 활 동들, 및 절차들과 연계하여, 및 분리되어 수행될 수 있다는 것을 유의한다. 도 2와 관련하여 기술된 기능들, 활동들, 및 절차들 중 임의의 것과 본 명세서에 개시되는 임의의 다른 절차들 또는 방법들은 기술된 나머지 기 능들, 활동들, 및 절차들을 수행하지 않고서 수행될 수 있다. 모든 그와 같은 실시예들은 본 개시의 범위 내에 있는 것으로 상정된다. 블록 210에서, 협상 요청은 IoT 엔티티로부터 협상 서비스에서 수신될 수 있다. 블록 220에서, 요청 승인 제어 는 도 3 및 도 4 및 관련 텍스트에서 더 자세하게 기술되는 바와 같이 실행될 수 있다. 블록 230에서, 요청이 받아들여질 것인지의 여부가 결정될 수 있다. 요청이 받아들여지지 않으면, 블록 235에서, 요청이 거절되었다 는 것을 표시하는 응답이 요청하는 엔티티에 보내질 수 있다. 요청이 받아들여지면, 블록에240에서, 요청에 대 한 우선순위가 결정될 수 있고, 요청은 협상 서비스에 의한 서비스를 위해 서비스 큐에 놓여질 수 있다. 블록 250에서, 요청이 거절되었다는 것을 표시하는 응답이 요청하는 엔티티에게 보내질 수 있다. 도 3은 협상 요청 승인 절차 동안 몇몇 실시예들에 이용될 수 있는 예시적 신호 흐름을 도해한다. 실시예 에서, 협상 서비스는 인지 능력을 포함할 수 있다. 협상 서비스는 IoT 엔티티들, IoT 서비스들, 및 IoT 애플리케이션들로부터 협상 요청들을 선택적으로 받아들일 수 있다. 협상 서비스는 과 거 요청들 및 연관된 협상 결과들의 이력을 유지할 수 있다. 협상 서비스는 협상 요청을 승인하지를 결정 하기 위해 과거 요청들 및 결과들의 저장된 이력을 레버리지할 수 있다. 한 예에서, 협상 요청자는 협상 요청을 협상 서비스에게 보낼 수 있다. 협상 서비스는 블 록 322에서 요청들 및 협상들의 저장된 이력과 요청을 대조하고 이것이 협상 요청자로부터의 동일하거나 비슷한 요청을 갖지 않는다는 것을 결정할 수 있다. 협상 서비스는, 승인될 인가 엔티티들, 애플리케이션 들, 또는 서비스들의 소정의 개인 또는 그룹만이 협상 서비스를 이용하는 것을 허용할 수 있는 그 상에 구성되 는 접근 권리들과 협상 요청자를 대조할 수 있다. 그와 같은 접근 권리들은, 허용된 엔티티들, 애플리케 이션들, 또는 서비스들의 리스트(\"화이트 리스트\"), 차단된 엔티티들, 애플리케이션들, 또는 서비스들의 리스트 (\"블랙 리스트\"), 또는 이것들의 조합으로서 협상 서비스에서 구성될 수 있다. 협상 서비스에의 접근을 제한하는 임의의 다른 형태가 본 개시의 범위 내에 있는 것으로 상정된다. 협상 서비스가 협상 요청자로부터의 요청들의 이력을 갖지 않는다고 결정할 시에, 협상 서비스 는 협상 요청자를 협상 서비스에 받아들일 지의 결정을 위해 승인 요청을 인지 능력에게 제공할 수 있다. 이 요청은 협상 요청에 포함되는 데이터 중 모두, 일부를 포함하거나, 또는 아무 것도 포함하지 않을 수 있다. 인지 능력은, 본 명세서에 제시되는 것들을 포함하는, 임의의 기준 또는 방법들을 이용하 여 협상 요청자를 승인할지에 대한 결정을 할 수 있다. 승인 결정을 할 시에, 인지 능력은 승인 응 답을 협상 서비스에게 제공할 수 있다. 협상 요청자가 협상 서비스를 이용하도록 허락을 받게 된다면, 협상 서비스에의 승인을 표시하는 협 상 응답이 협상 요청자에게 전송될 수 있다. 협상은 협상 서비스와 협상 당사자 사이에서 326에서 본 명세서에 개시된 것처럼 이후 실행될 수 있다. 협상 당사자가 전달 서비스와 동일 엔티 티일 수 있거나, 또는 협상 당사자가, 또 다른 협상 서비스와 같이, 전달 서비스를 대신하여 협상하도록 인가된 별개의 엔티티일 수 있다는 것을 유의한다. 협상 요청자가 요청된 서비스를 수신하기 전에, 이것은 협상 요청과 실질적으로 동일한 중복 협상 요 청을 협상 서비스에게 보낼 수 있다. 협상 서비스는 블록 332에서 요청들 및 협상들의 저장된 이력을 요청과 대조하고 또한 이것이 더 초기에 협상 요청자로부터 협상 요청을 수신했고 협상 요청 이 협상 요청과 실질적으로 동일하다는 것을 결정할 수 있다. 협상 서비스는 협상 요청자(32 0)를 협상 서비스에 받아들일 지의 결정을 위해 인지 능력에게 또 다른 승인 요청 메시지를 제공할 수 있고 또한 승인 응답을 수신할 수 있다. 협상 요청이 중복 요청이라고 결정할 시에, 협상 서비스 는 협상 요청의 거부를 표시하는 협상 응답을 협상 요청자에게 전송할 수 있다. 한편, 협상 요 청자는 327에서 요청된 서비스를 수신하기를 시작했을 수 있다. 협상 서비스는 협상 서비스들을 대기하기 위해 서비스 큐에 승인된 협상 요청들을 놓을 수 있다. 그러나, 서비 스 큐는 협상 서비스의 구성 또는 제한들 때문에 가득 차게 될 수 있다. 협상 서비스는 협상의 긴급성 또는 우 선순위에 기초하여 협상 요청들을 우선순위화할 수 있다. 예를 들어, 응급 상황 공표 요청자와 공표 서비스 간 의 협상은 공표 서비스와의 협상에 대해 다른 요청들보다 더 높은 우선순위가 부여될 수 있다. 협상 요청들의 서비스의 순서를 정의하는 것과 함께, 서비스 큐는 또한 협상 요청들이 서빙될 방식을 결정할 수 있다. 도 4는 협상 요청 승인 절차 동안 몇몇 실시예들에 이용될 수 있는 예시적 신호 흐름을 도해한다. 실시예 에서, 협상 서비스는 인지 능력을 포함할 수 있다. 협상 서비스는 IoT 엔티티들, IoT 서비스들, 및 IoT 애플리케이션들로부터 협상 요청들을 선택적으로 받아들일 수 있다. 협상 서비스는 IoT 엔티티들, IoT 서비스들, 및 IoT 애플리케이션들의 특정의 것 또는 그룹들과 연관되는 우선순위들뿐만 아니라 과거 요청들 및 연관된 협상 결과들의 이력을 유지할 수 있다. 한 예에서, 협상 요청자는 협상 요청을 협상 서비스에게 보낼 수 있다. 협상 서비스는 이 요청을, 전술한 바와 같은 요청들의 저장된 이력, 협상 서비스에 구성되는 임의의 접근 권리들에 대하여, 및 이 요청이 블록 422에서 서비스될 수 있는지를 결정하기 위해 서비스 큐에 대하여 대조할 수 있다. 이것은 서비스 큐의 현재 상태가 협상 서비스에의 협상 요청자의 승인을 허용할 것인지의 결정을 위해 인지 능력 에게 승인 요청을 제공함으로써 실행될 수 있다. 이 요청은 협상 요청에 포함되는 데이터의 모 두, 일부를 포함할 수 있거나, 또는 데이터의 어느 것도 포함하지 않을 수 있다. 인지 능력은 승인 응답 을 협상 서비스에게 제공할 수 있다. 이 예에서, 승인 응답은 협상 요청자가 이 시점에서 승인되도록 허용되지 않는다는 것을 나타낼 수 있다. 협상 요청이 거절된 것을 표시하는 협상 응답 이 이후 협상 요청자에게 보내질 수 있다. 협상 요청자는 이후 협상 요청을 협상 서비스에게 보낼 수 있다. 협상 요청은 협상 요청 의 것보다 더 높은 우선순위를 가질 수 있다. 이 우선순위는 협상 요청에 표시될 수 있거나 및/또는 협상 요청자에 의해 제공되는 서비스들에 기초한 것일 수 있다. 협상 서비스는 이 요청을, 전술한 바와 같은 요청들의 저장된 이력, 협상 서비스에 구성되는 임의의 접근 권리들에 대하여, 및 요청이 블록 427에서 서비스될 수 있는지를 결정하기 위해 서비스 큐에 대하여 대조할 수 있다. 이것은 서비스 큐의 현재 상태가 협상 서비스에의 협상 요청자의 승인을 허용할 것인지의 결정을 위해 인지 능력에게 승 인 요청을 제공함으로써 실행될 수 있다. 이 요청은 협상 요청에 포함되는 데이터의 모두, 일부를 포함할 수 있거나, 또는 데이터의 어느 것도 포함하지 않을 수 있다. 인지 능력은 승인 응답을 협상 서비스에게 제공할 수 있다. 이 예에서, 승인 응답은 협상 요청자가 이 시점에서 승인되도록 허용되는 것을 나타낼 수 있다. 이것은 요청 및/또는 협상 요청자의 긴급성 상태 또는 우선순위에 기초한 것일 수 있다. 협상 요청이 허용된 것을 표시하는 협상 응답이 이후 협상 요청자에게 보내질 수 있다. 협상 응답은 협상 요청자가 높은 우선순위를 부여 받았다는 것을 나타낼 수 있다. 협상은 협상 서비스와 협상 당사자 사이에서 434에서 본 명세서에 개시된 것처럼 이후 실행될 수 있 다. 협상 요청이 서비스될 준비가 된 것, 즉 이것이 승인되었고 이제 서비스 큐의 선두에 있는 것으로 결정할 시에, 협상 서비스 절차가 시작될 수 있다. 도 5는 협상 요청을 서비스하기 위한 예시적 절차를 도해한다. 블 록 505에서, 협상 서비스는 그 서비스 큐의 선두에 있는 협상 요청을 선택할 수 있다. 블록 510에서, 협상 서 비스는 요청이 가입 요청인지를 결정할 수 있다. 만약 그렇다면, 협상 서비스는, 블록 515에서, 본 명세서에서 더 상세히 기술된 바와 같이 가입 및 통지 조건들을 확립할 수 있다. 가입 확립의 성공 또는 실패를 표시하는 응답이 또한 요청자에게 보내질 수 있다.요청이 임의의 다른 유형의 협상 요청이라면, 요청의 타당성은 요청이 블록 520에서 협상 목표를 포함하는지를 결정함으로써 검증될 수 있다. 요청에 명시된 어떤 협상 목표도 없다면, 블록 525에서 협상 서비스는 협상 당 사자 및/또는 전략이 협상 요청에 제공될지를 결정할 수 있다. 그렇지 않다면, 블록 530에서 요청이 거절된 것 을 나타내는 거부 메시지가 요청자에게 보내질 수 있다. 거부에 대한 이유는 거부 메시지에 표시될 수 있다. 협상 당사자 및 전략이 요청자에 의해 지정된다는 것이 블록 525에서 결정되면, 협상 서비스는 블록 585에서 요 청자를 대신하여 협상을 실행한다. 다시 블록 520을 참조하면, 요청이 협상 목표(예를 들어, 표적 협상 당사자 및/또는 전략)를 포함하지 않으면, 이후 블록 535에서, 요청자가 본 명세서에서 더 상세히 기술되는 과거의 비슷한 협상 시나리오들로부터의 협상"}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "서비스에 의해 요약되는 일반화된 협상 전략을 이용할 의향이 있는지에 대한 결정이 이루어질 수 있다. 일반화 된 협상 전략 및/또는 표적 당사자의 수용의 표시가 요청에 포함될 수 있거나, 또는 요청이 협상 목표를 포함하 는 데 실패하면 가정될 수 있다. 요청자가 일반화된 협상 전략을 이용할 의향이 있다면, 블록 560에서의 협상 서비스는 일반화된 협상 전략 및 당사자를 이용하고, 블록 550에서 이 요청에 대한 협상 당사자 및 전략을 결정 하기 위해 그 인지 능력에 질의할 필요는 없다. 블록 535에서, 요청자가 일반화된 협상 전략을 이용할 의향이 있지 않다고 결정되면, 이후 블록 540에서 과거 협상들이 이용될 수 있는지에 대한 결정이 이루어진다. 이것은 소정의 피어 IoT 애플리케이션, 엔티티, 또는 서비스의 협상 전략을 이용하는 것을 포함할 수 있다. 만약 그렇다면, 블록 555에서 협상 서비스는 과거의 협 상 전략 및 당사자를 결정하고, 블록 550에 이들을 결정된 협상 당사자 및 전략으로서 사용한다. 블록 540에서, 과거 협상들이 이용되지 않을 수 있다는 결정이 이루어지면, 블록 545에서 협상 서비스는 요청에 대한 협상 당사자 및 전략이 블록 550에서의 결정된 협상 당사자 및 전략을 이용하는 것을 결정하기 위해 그 인지 능 력에 질의한다. 협상 서비스가 협상 당사자 및 전략을 결정한 후에, 이것은 요청자가 이것으로 하여금 요청자를 대신하여 협상 을 수행하도록 요청하는지를 결정할 수 있다. 이 절차는 블록 565으로 시작하며, 여기서 협상 서비스는 요청자 가 협상 당사자를 요청하는지를 결정한다. 만약 그렇다면, 결정된 협상 당사자가 요청자에게 보내진다. 협상 당사자가 요청자가 요청한 유일한 정보라면, 협상 서비스가 인지 능력을 이용하지 않을 수 있고, 다른 경우에는 협상 전략이 결정될 수도 있었던 블록 545를 건너 뛸 수 있다는 것을 유의하라. 요청자가 블록 575에서 결정된 것처럼 협상 전략을 요청하면, 결정된 협상 전략은 블록 580에서 요청자에게 제 공될 수 있다. 협상 전략이 요청자가 요청한 유일한 정보라면, 협상 서비스는 인지 능력을 이용하지 않을 수 있고, 다른 경우에는 협상 당사자가 결정될 수도 있었던 블록 545를 건너 뛸 수 있다. 요청자가 그 스스로 협 상을 수행하기 위해 전략 및 당사자를 요청할 수 있고, 그러한 실시예에서 도 5의 절차가 완전할 수 있다는 것 을 또한 유의한다. 요청자가 협상 서비스가 그를 대신해서 협상을 수행하기를 원한다면, 협상은 블록 585에서 협상 서비스에 의해 실행되고, 협상 결과는 블록 590에서 요청자에게 제공된다. 도 6은 협상 당사자를 결정하기 위해 몇몇 실시예들에 이용될 수 있는 예시적 신호 흐름을 도해한다. 실 시예에서, 협상 서비스는 인지 능력을 포함할 수 있다. 한 예에서, 협상 요청자는 협상 요청 을 협상 서비스에게 보낼 수 있다. 요청이 허용될 것이라고 결정할 시에, 협상 요청이 받아들 여진 것을 표시하는 협상 응답이 협상 요청자에게 보내질 수 있다. 실시예에서, 요청은 요청자가 그를 대신해서 협상에의 협상 서비스를 하기를 바라는 당사자의 표시를 포함할 수 있다. 요청이 협상 당사자의 표시를 포함하지 않으면, 626에서 협상 서비스는 요청된 IoT 서비스를 제공하는 IoT 엔티티들을 발견하기 위해 발견 서비스에의 요청을 개시할 수 있다. 협상 서 비스는 631에서 인지 능력이 627에서 협상 당사자의 역할을 하게 될 IoT 엔티티를 발견 결과들로부터 결정하기 를 이후 요청할 수 있다. 결정된 협상 당사자는 632에서 리턴되고, 협상은 협상 서비스와 협상 당사자 사이에서 634에서 본 명세서에 개시된 것처럼 이후 실행될 수 있다. 협상 서비스는 협상 요청자를 대신하여 협상 전략을 제어할 수 있다. 전략은 이것이 그 가운데에 제공된다면 요청자로부터 수신되는 요청으로부터 결정될 수 있다. 대안적으로, 협상 서비스는, 어느 하나의 엔티티를 위한 가용 리소스들(예를 들어, 처리 능력, 메모리, 대역폭, 기타 등등), 어느 하나의 엔티티를 위한 온라인 및 오프 라인 스케줄들, 기타 등등과 같은, IoT 서비스 제공자들 및 요청자의 콘텍스트들에 기초한 전략을 결정하기 위 해 그 인지 능력을 이용할 수 있다. 도 7은 예시적 센서 노드 및 협상 서비스 구성을 도해한다. 이 실 시예에서, 각각의 센서 노드들(721-725)은 광 센서들, 온도 센서들, 모션 검출기들, 기타 등등과 같은 임의 유형의 센서 노드일 수 있다. 이러한 센서 노드들의 커버리지 지역들은 중첩할 수 있어서 이들이 커버리지 지역 의 완전한 검출을 제공하기 위해 동시에 작동하고 있을 것을 필요로 하지 않도록 한다. 그러므로, 센서 노드들 은 언제 각각의 센서 노드들이 온 또는 오프 상태에 있을지에 대한 스케줄이면서 또한 그러면서도 커버리지 지 역의 완전한 검출이 있을 것을 보장하는 스케줄을 협상하기를 바랄 수 있다. 센서당 4개의 협상 세션을 요구하 는, 각각의 센서 노드들이 각각의 다른 센서 노드들과 직접적으로 협상하는 것보다는, 센서 노드들(721-725)이 협상 서비스를 사용하고 또한 센서당 단일 협상 세션을 가질 수 있다. 실시예에서, 협상 절차는 센서 노 드가 지정된 협상 당사자(예로, 센서 노드와 같은 다른 센서 노드들 중 하나) 및 협상 전략(예를 들 어, 최저의 커버리지 중복성을 달성함)으로 협상 요청을 보낼 때 개시될 수 있다. 도 8은, 예를 들어 도 7에 관하여 기술된 것과 같은 상황들의 필요성을 다룰 수 있는 협상 전략을 결정하기 위 해 몇몇 실시예들에 이용될 수 있는 예시적 신호 흐름을 도해한다. 실시예에서, 협상 서비스는 인지 능력을 포함할 수 있다. 협상 서비스는 센서 노드로부터 협상 요청을 수신할 수 있고, 821에서 응답을 보낼 수 있다. 협상 서비스는 인지 능력이 822에서 협상의 당사자들을 결정하기를 요청할 수 있다. 협상 서비스는, 인지 능력을 통한 실시예에서, 발견 서비스가 센서 노드 1과 동일한 지 역에서 인접하는 센서 노드들의 리스팅을 리턴하는 것을 요청할 수 있고, 823에서 요청된 리스팅을 수신할 수 있다. 이 예에서, 동일 지역에서의 다른 센서 노드들은 센서 노드들(802, 803, 804, 및 805)이다. 이 리스팅 에 기초하여, 인지 능력은 센서 노드들(802-805)이 824에서 표적 센서 노드들인 것을 결정할 수 있고, 825 에서 협상 서비스에게 이 정보를 제공할 수 있다. 821에서 요청이 표시하는 대로 센서 노드에게만 협상 통지를 보내는 대신에, 협상 서비스는 협상 통 지를 센서 노드에게 보내고 826, 응답을 수신하고 827, 협상 통지를 센서 노드에게 보내고 828 및 응 답을 수신하고 829, 및 센서 노드와 동일한 지역에서 각각의 센서에 대해 그렇게 한다. 각각의 센서 노드 들은 그 배터리 레벨이 낮고, 기타 등등이기 때문에 협상 통지를 거절할 수 있거나, 이것은 그것이 슬리프 모드 에 있기 때문에 응답하지 않을 수 있다. 예를 들어, 센서 노드들(802, 803, 및 804)이 협상 수용 확인을 리턴 할 수 있는 한편, 센서 노드는 협상 거부 확인을 보냄으로써 협상에 참여하는 것을 거절할 수 있다. 수용 및 거부 확인들은 수반된 협상자들을 결정하기 위해 협상 서비스에 의해 831에서 이용될 수 있다. 832에 서, 협상 서비스는 전략을 결정하기 위한 요청에 의해 이 정보를 인지 능력에게 제공할 수 있다. 센서 노드들(801-804) 중에서의 협상을 위한 향상된 전략을 결정하기 위해, 4개의 센서 노드의 각각에 대한 배 터리 수명들을 제공하기 위해 833에서 인지 능력에 의해 콘텍스트 인식 서비스가 요청될 수 있다. 이 콘텍스트 정보와 협상 목적에 기초하여, 인지 능력은, 이들이 구성되는 지역에 대한 노드들에 의한 적 어도 최소 중복성의 커버리지를 제공하는 4개의 센서 노드 중에서 노드들의 작업을 배포하기 위한 스케줄을 포 함하는 전략을 834에서 결정할 수 있다. 그러한 협상 전략은 이후에 확인을 위해 센서 노드(1, 2, 3, 4)에게 보내진다. 전략은 협상 서비스에 응답하여 835 제공될 수 있다. 836에서, 협상 서비스는 센서 노드 의 작동 스케줄을 해당 노드에게 보내고 해당 노드로부터 수신의 확인을 수신할 수 있다. 마찬가지로, 837, 838, 및 839에서, 협상 서비스는 제각기 센서 노드들(802, 803, 804)에 대한 작업 스케줄을 보낼 수 있고, 각각으로부터 응답을 수신한다. 협상 서비스는 정책 변화 또는 콘텍스트 변화 때문에 조절될 수 있다. 협상 서비스 정책들은 콘텍스트, 소프트 웨어 정의 설정들, 다른 서비스들로부터의 입력, 및 임의의 다른 기준들과 조건들에 기초하여 동적으로 조절될 수 있다. 정책들이 동적일 수 있기 때문에, 실시예에서, 협상 결정들 및 파라미터들이 정책들에서의 변화들을 다루기 위해 또한 동적으로 조절될 수 있다. 도 9는 요청자 이동도에 응답하여 협상 적응의 예를 제공하는 예시적 구성을 도해한다. 초기에, 통신 에서, 협상 요청자는 프록시 서비스를 위해 협상 서비스로부터 협상 서비스를 요청할 수 있다. 서비스 과금을 가진 몇몇 실시예들에서, 요청된 협상은 902에서 실행될 수 있어서 요청자가 프록시 서비스 에 의해 프록시 서비스를 제공받을 수 있도록 한다. 이 예에서, 협상 서비스는 프록시 서비스를 위 한 협상 당사자를 결정할 수 있다. 협상 서비스는 다중 프록시 서비스 제공자(예를 들면, 프록시 서비스 와 프록시 서비스)를 발견할 수 있다. 협상 서비스의 인지 능력은 요청 및/또는 요청자의 콘텍 스트에 기초하여 프록시 서비스 제공자를 결정할 수 있다. 이 예에서, 관련 콘텍스트는 로케이션일 수 있다. 협상 서비스는, 프록시 서비스가 임의의 다른 프록시 서비스보다 협상 요청자에게 더 가깝기 때 문에 협상 요청자의 현재 로케이션 콘텍스트를 위한 선호된 프록시 서비스 제공자가 프록시 서비스라 는 것을 결정할 수 있다. 그에 따라서, 협상 서비스는 협상 요청자를 대신하여 프록시 서비스들을 위해 프록시 서비스와 협상할 수 있다. 그러나, 협상 요청자는 새로운 로케이션으로 이동할 수 있다904. 협상 서비스는 콘텍스트 인식 서비스로부터 콘텍스트 변화를 알림 받을 수 있다. 협상 서비스 및/또는 그 인지 능력은, 프록시 서비스가 이용 가능한 프록시 서비스들 중에서 협상 요청자에게 지 금 가장 근접한 것을 결정함으로써 콘텍스트 변화에 적응할 수 있다. 응답하여, 협상 서비스는 905에서 협상 요청자를 대신하여 프록시 서비스들을 위해 프록시 서비스와 협상할 수 있고, 통신 904에서 프 록시 서버 변화를 협상 요청자에게 통지한다. 도 10은 도 9에 관하여 기술된 바와 같은 협상 요청자의 이동도와 같은, 변하는 조건들에 협상 서비스들을 적응 시키기 위해 몇몇 실시예들에 이용될 수 있는 예시적 신호 흐름을 도해한다. 실시예에서, 협상 서비스 는 인지 능력을 포함할 수 있다. 협상 서비스는 협상 요청자로부터 협상 요청을 수신 할 수 있고, 1021에서 응답을 보낼 수 있다. 협상 서비스는 인지 능력이 1022에서 협상의 당사자 들을 결정하는 것을 요청할 수 있다. 협상 서비스는, 인지 능력을 통한 실시예에서, 콘텍스트 인 식 서비스가 요청자의 로케이션의 표시를 리턴하는 것을 요청할 수 있고, 1023에서 표시를 수신할 수 있다. 수신된 로케이션에 기초하여, 인지 능력은, 1024에서, 협상 요청자가 이용 가능한 프록 시 서비스 제공자들 중으로부터 프록시 서비스 제공자에 가장 인접한 로케이션에 있다는 것을 결정할 수 있다. 프록시 서비스 제공자 정보는 1025에서 협상 서비스에게 제공될 수 있고, 협상 서비스는 협 상 요청자를 대신하여 1025에서 협상 요청자를 위한 프록시 서비스를 위해 협상할 수 있다. 1031에서, 협상 요청자는 프록시 서비스 제공자보다 프록시 서비스 제공자에게 더 인접할 수 있는 상이한 지역으로 이동할 수 있다. 1032에서, 콘텍스트 변화 통지가 콘텍스트 인식 서비스에 의해 협상 서비스에게 제공될 수 있다. 콘텍스트 변화 통지는 협상 요청자의 현재 로케이션을 포 함할 수 있거나 도는 이것은 협상 서비스로 하여금 협상 요청자를 위한 현재 로케이션을 결정하도 록 야기하는 표시자를 포함할 수 있다. 1033에서, 협상 서비스는, 인지 능력이 협상 요청자(102 0)의 현재 로케이션에 기초하여 현재 최고 프록시 서비스 제공자를 결정하는 것을 요청할 수 있는데, 이 인지 능력은 1034에서 결정할 수 있다. 협상 요청자의 현재 로케이션에 기초하여 프록시 서비스 제공자 가 협상 요청자를 위한 현재의 최고 프록시 서비스 제공자라는 표시를 포함하는 응답이 1035에서 협상 서비스에게 제공될 수 있다. 응답에서, 협상 서비스는 협상 요청자를 대신하여 1036에 서 협상 요청자를 위한 프록시 서비스를 위해 협상할 수 있다. 협상 서비스는 과거 협상 절차들에 이용된 결정된 협상 당사자 및 협상 전략과 같은, 과거 협상들로부터의 협상 결과들 및 관계된 데이터를 저장할 수 있다. 협상 서비스는, 이것이 비슷한 협상 요청이 협상 요청자로부터 수"}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "신되는 것을 결정할 때 이 캐시된 정보를 이용할 수 있다. 협상 서비스는 협상 절차들로부터의 요약된 데이터 에 기초하여 일반화된 협상 전략을 또한 결정할 수 있다. 협상 서비스는 소정 협상 시나리오들에서 패턴들을 검출할 수 있고, 비슷한 현재 협상에서 과거 협상 파라미터들 및 데이터를 이용하여, 이들 패턴들을 현재 협상 요청들과 관련시킬 수 있다. 이것은 협상 전략, 당사자들, 기타 등등을 결정하기 위해 그 인지 능력을 채택하 는 것으로부터 협상 서비스를 해방할 수 있다 도 11은 IoT 엔티티들 및 협상 서비스의 예시적 구성을 도해한다. 데이터 소비자들(1131-1134)은 소비자 들, 소매상들, 운수 회사들, 서비스 제공자들, 네트워크 제공자들, 기타 등등과 같은 임의의 데이터 소비자들일 수 있다. 이 예에서, 데이터 소비자들(1131-1134)은 의사, 병원, 의료 보험, 및 의료 연구 원과 같은 의료 관련 엔티티들이다. 데이터 제공자들(1121-1125)은 환자들, 고객들, 소비자들, 집 또는 사업체에서의 센서 노드들(예를 들어, 온도 센서들, 모션 센서들), 기타 등등과 같은 임의의 데이터 제공자들일 수 있다. 이 예에서, 데이터 제공자들(1131-1134)은 다른 경우에는 의사의 돌봄 아래에 있었을 환자들 또는 사 람들과 연관되는 디바이스들 또는 엔티티들일 수 있다. 협상 서비스는 데이터 제공자들(1121-1125) 중 하나와 같은 데이터 제공자를 대신하여 하나 이상의 협상"}
{"patent_id": "10-2015-7034690", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "절차들을 수행한 후에 협상 정책들을 요약하고 및/또는 일반화할 수 있다. 예를 들어, 협상 서비스는 데 이터 소비자와 데이터 제공자의 각각의 쌍에 이용될 수 있는 공통 협상 전략을 결정할 수 있다. 이것은 한 쌍 의 데이터 소비자와 데이터 제공자 사이에 취급되는 데이터에 대한 제1 요청에서 결정되는 초기 협상 전략에 기 초한 것일 수 있다. 도 11의 표 1140은 협상 서비스가 이것이 상호 작용하는 각각의 데이터 소비자를 위 해 유지할 수 있는 정보의 예를 제공한다. 이 데이터는 특정 데이터 제공자를 위해 특정 데이터 소비자에게 제 공될 수 있거나 그렇지 않을 수 있는 데이터를 표시할 수 있다. 예를 들어, 표 1140이 데이터 제공자(예를 들 어, 환자)와 연관되는 데이터 제약들을 나타내는 경우에, 협상 서비스는 이름, 연령, 우편 번호, 거리명, 및 의료 정보를 데이터 제공자의 의사에게 제공할 수 있는 한편, 이름, 연령, 우편 번호, 및 거 리 명만을 보험 공급자에게 제공할 수 있다. 표1140, 또는 비슷한 데이터는 협상 서비스와 상호 작용하는 모든 IoT 엔티티들에게 적용되도록 일반화될 수 있다. 이 협상 일반화 방법은 데이터 제공자가 서비스를 요 청하는 때마다 협상 전략을 결정함에 있어서 인지 능력의 부하를 감소시킬 수 있다. 이전 협상 절차들로부터의 결정된 협상 당사자들 및 전략들과 같은 협상 결과들은 이전 협상 결과들을 발생한 최초 협상에 수반되는 것 이외의 서비스들 및 클라이언트들에 의해 가입될 수 있다. 비슷한 협상 토픽들에 관 심 있는 요청자는 이 정보에 가입하기를 요청할 수 있다. 가입된 협상 활동에의 임의의 적응은 가입자들에의 통지를 발생할 수 있다. 이 가입 메커니즘은 새로운 협상 조건들에의 가입자들의 자율적 적응을 가능하게 할 수 있다. 가입자가 가입으로부터 협상 결과들을 이용하고 있다면, 가입된 협상 조건들 또는 파라미터들에의 임 의의 변화는 가입자로 하여금 새로운 조건들 또는 파라미터들에게 조절을 자동적으로 적응시키도록 트리거링할 수 있다. 협상 가입에 의해, 다른 엔티티들이 협상 결과를 재이용하고 이를 따를 수 있다. 도 12는 몇몇 가입 시나리오들에 이용될 수 있는 예시적 비제한적 구성을 도해한다. 여기서, 가상화 정 책에의 가입이 있다. 가상화 서비스는, 1212에서, 협상 서비스가 가상화 정책을 위해 IoT 대상 과 협상하기를 요청할 수 있다. 정책은, 예를 들어, 때 IoT 대상의 가상화가 발생할 수 있는 시간 과 IoT 대상이 가상화되는 곳과, 기타 등등과 연관될 수 있다. 1214에서의 협상은 IoT 대상과 협 상 서비스 사이에 일어날 수 있다. 가상화 서비스와 IoT 대상 사이의 협상 합의가 도달된 후에, 1218에서 IoT 대상은 가상화 정책에 기초하여 가상화된 IoT 오브젝트로서 IoT 클라우드 서버 에서 가상화될 수 있다. 1226에서, 가상화 서비스는 IoT 클라우드 서버에서 가상화된 IoT 대상으로서 IoT 대상 을 가상화할 수 있다. IoT 클라우드 서버는 동일 가상화 정책에 대한 1222에서의 요청 및 이것의 1224에서의 수신에 의해 가상화된 IoT 대상에 의해 이용되는 것과 동일한 가상화 정책에 가입할 수 있다. 가입된 가상화 정책을 바꾸는 임의의 협상 적응이 있다면, IoT 클라우드 서버는 협상 적응 정책이 1212에 서 바뀔 때 통지 받을 수 있다. IoT 클라우드 서버는 협상 적응 정책이 1212에서 바뀔 때 통지 받을 수 있다. 응답에서, IoT 클라우드 서버는 가상화 서비스가 새로운 정책에 기초하여 적응을 빨리 실행 할 것을 1230에서 요청할 수 있다. 실시예에서, 동일 서비스를 제공하는 2개의 서비스 제공자는 서비스 듀티 협력을 위해 서로 협상할 수 있다. 한 서비스 공급자가 온라인일 때, 이는 다른 (아마도 오프라인) 서비스 제공자를 위해 의도된 서비스 요청들을 취급할 수 있어서, 이들이 둘 모두 항상 온라인일 필요는 없게 만들고, 그에 의해 전력과 같은 리소스들을 절감 한다. 도 13은 서비스 듀티 사이클링 및 오프로딩을 위해 사용되는 협상 서비스의 예가 구현될 수 있는 예시적 구성 을 도해한다. IoT 엔티티는 소프트웨어 정의 서비스를 제공할 수 있고, 예를 들어 1351에서 IT 엔티티에게 이것을 동료 IoT 엔티티들에게 공표할 수 있다. 소프트웨어 정의 서비스는, 임의의 수와 유형의 물리적 디바이스들에 의해 실행될 수 있는 서비스, 및 서비스를 제공하기 위해 할당되는 물리적 디바이 스들이 서비스가 필요에 따라 변할 수 있는 서비스일 수 있지만, 현재 사용중인 물리적 디바이스 구성에 상관없 이 지속적 소프트웨어 인터페이스를 사용자들 또는 다른 엔티티들에게 제공하는 서비스일 수 있다. 소프트웨어 정의 서비스를 제공하는 IoT 엔티티는, 1351에서 IoT 엔티티로부터의 소프트웨어 정의 서비 스의 수신하는 공표에 기초하여, 소프트웨어 정의 서비스가 소프트웨어 정의 서비스와 동일 하거나 비슷한 서비스라는 것을 결정할 수 있다. 응답에서, 동일 소프트웨어 정의 서비스를 위해 하나의 엔티 티가 또 다른 것의 서비스의 요청들을 언제 및 얼마나 많이 오프로딩할 수 있는지를 포함하여, IoT 엔티티 는 IoT 엔티티와 듀티 사이클을 확립하기 위해 1352에서 IoT 엔티티와의 협상을 개시할 수 있다. 예를 들어, 엔티티들은 어느 한 또는 다른 엔티티가 동일 서비스에 대한 모든 요청들을 취급할 때 및/또 는 요청자에의 인접성과 같은 임의의 기준들에 기초하여 다른 엔티티에의 요청을 오프로딩할 때를 결정할 수 있 다. IoT 엔티티는 1353에서 IoT 엔티티에 의해 제공되는 발견 서비스로부터 바라는 소프트웨어 정의 서비스가 IoT 엔티티에 자리 잡고 있다는 것을 발견할 수 있다. IoT 엔티티는 1354에서 IoT 엔티티로부터 소프트웨어 정의 서비스를 통해 바라는 소프트웨어 정의 서비스의 전달을 요청할 수 있다. 그러나, IoT 엔티티는 IoT 엔티티로부터 많은 홉들만큼 떨어져 있을 수 있다; 즉, 이들 엔 티티들 간의 트래픽이 거쳐가야만 하는 많은 네트워크 노드들이 있을 수 있다. 대안적으로, 이들 노드 사이의 거리 및 그러므로 네트워크 지연은 IoT 엔티티와 요청된 서비스를 제공하는 또 다른 엔티티 사이의 거리 보다 훨씬 더 클 수 있다. IoT 엔티티는, IoT 엔티티가 요청자 IoT 엔티티에게 서비스를 전달하기 위한 가장 적절한 엔티티라는 것을 결정할 수 있는데, 그 이유는 이것이 요청자에게 더 가깝고 및/또는 이것이 서비스 요청을 오프로딩하기에 이용 가능하기 때문이다. 그러므로, IoT 엔티티는 1355에서 IoT 엔티티에 더 가까울 수 있는 IoT 엔티티에게 요청을 리다이렉트할 수 있다. IoT 엔티티는 이후 1356에서 서비스를 IoT 엔티티에게 제공할 수 있다. 그 결과, 협상 서비스는 대기 시간과 효율성 면에서 IoT 엔티티에 대한 성능을 크게 개선한다. 도 14는, 도 13에 관하여 기술된 상황과 같은 서비스 듀티 사이클들 및 오프로딩을 확립하도록 협상 서비스들을 이용하기 위해 몇몇 실시예들에 사용될 수 있는 예시적 신호 흐름을 도해한다. 실시예에서, 협상 서비스 는 인지 능력을 포함할 수 있다. 협상 서비스는 1421에서 IoT 엔티티로부터 협상 요 청을 수신하고 이것에 응답할 수 있다. 협상 서비스는 인지 능력이 1422에서 협상 전략을 결정하 는 것을를 요청할 수 있다. 협상 서비스는, 인지 능력을 통한 실시예에서, 콘텍스트 인식 서비스 가 IoT 엔티티의 관련 콘텍스트의 표시를 리턴할 것을 요청할 수 있고, 1423에서 표시를 수신할 수 있다. 이 콘텍스트 정보는, 인지 능력으로 하여금 IoT 엔티티와 IoT 엔티티의 양쪽이 동일 하거나 실질적으로 비슷한 서비스를 제공하는 것을 결정하도록 허용하는 정보를 포함할 수 있다. 이 정보는 스 마트 IoT 서비스 프로필, IoT 엔티티(1420 및 1450)의 로케이션들, 제공된 서비스를 위한 온라인 스케줄, 기타 등등을 평가함으로써 결정될 수 있다. 인지 능력은 1424에서 2개의 엔티티 간의 협상을 위한 협력 상세 사항들 및 가능한 전략을 결정하고 1425에서 이것을 협상 서비스에 대한 협상 응답으로서 제공할 수 있다. 협상 서비스는 협력 제안으로 1426에서 협상 결과 요청을 IoT 엔티티에게 보낼 수 있다. IoT 엔티 티는 직접적으로 협상 서비스와 협상할 수 있거나 또는 이것은 1427에서 협상 요청을 그 선택된 협 상 서비스에게 보낼 수 있다. 후자의 경우, 협상 서비스가 IoT 엔티티로부터의 협상 요청을 승인할 후에, 1428에서, 인지 능력은 협상 전략을 결정하기 위한 요청을 수신하고, 1429에서 협상 요청을 받아 들이거나 거절할지에 대해 협상 전략 판정 및 결정을 이루고, 1431에서 협상 서비스에게 전략을 알린다. 이용 가능한 서비스 스케줄, IoT 엔티티와 공유할 리소스들의 양 및 유형들, IoT 엔티티가 제공할 수 있는 동시적 서비스 과제들의 수, 기타 등등과 같은 다른 협력 상세 사항들이 마찬가지로 특정될 수 있다 1432에서, 협상 서비스는 협상 수용 통지를 IoT 엔티티에게 제공한다. IoT 엔티티는 통지 를 협상 서비스에게 보냄으로써 협상 수용을 확인할 수 있고, 1434에서 협상 서비스에게 협 상 결과 응답을 리턴한다. 협상 서비스는 1435에서 협상 수용 확인의 통지를 IoT 엔티티에게 보낼 수 있는데, 이에 대하여 IoT 엔티티는 1436에서 확인으로 응답할 수 있다. 동일하거나 실질적으로 비슷한 IoT 서비스를 호스팅하지만 고객들 또는 다른 사용자들에 대해 서로 경쟁하는 상 이한 IoT 엔티티들이 있을 수 있다. 실시예에서, 고객은 가장 낮은 가격으로 바라는 QoS를 달성하기 위해 협상 서비스가 잠재적 IoT 서비스 제공자와 협상하기를 요청할 수 있다. 도 15는 협상 서비스를 이용하는 그러한 협 상 절차의 한 예를 보여준다. 이 실시예에서, 협상 서비스는 인지 능력을 포함할 수 있다. 협상 서비스는 1521에서 IoT 엔티티 고객으로부터 협상 요청을 수신하고 응답할 수 있다. 요청은 고객 이 찾고 있는 서비스 유형의 표시 및 고객이 서비스에 대해 지불하고자 제시하고 있는 가격을 포함 할 수 있다. 다른 정보가 또한 제공될 수 있다. 협상 서비스는 협상 승인 요청을 인지 능력에게 보낼 수 있고, 이것은 다음 차례로 협상 요청을 승인하는 것을 판정할 수 있다. 협상 서비스는, 1522에 서, 발견 서비스로부터 요청된 서비스를 제공하는 잠재적 서비스 제공자들에 대한 정보를 요청하고 수신 할 수 있다. 그러면, 협상할 가장 적절한 서비스 제공자들을 결정하기 위해, 협상 서비스는 1523에서 인 지 능력에게 협상 당사자 요청을 보낼 수 있다. 인지 능력은, 근접성, 가격, 기타 등등을 포함하는 임의의 기준을 이용하여, 협상 서비스가 고객 , IoT 서비스 제공자(도 15의 \"IoT SP 1550\") 및 IoT 서비스 제공자(도 15의 \"IoT SP 1560\")을 대신하여 협상할 수 있는 2개의 서비스 제공자가 있다는 것을 결정할 수 있다. 이 정보는 1526에서 협상 서비스에게 제공될 수 있다. 협상 서비스는 1526에서 2개의 서비스 제공자와 협상하기 위한 협상 전략에 대해 인지 능력에게 질의할 수 있다. 인지 능력은 협상 전략을 개발하는데 이용될 수 있는 정보를 획득하기 위해 콘텍스트 인식 서비스에게 질의할 수 있다. 이 콘텍스트 정보는 상이한 QoS 들을 가진 각각의 IoT 서비스 제공자의 과금 정책들, 고객을 서빙하기 위해 서비스 제공자에 의해 필요한 리소스들, 각각의 서비스 제공자로부터 고객 요청자까지의 거리, 기타 등등을 포함할 수 있다. 이 정보를 이용 하여, 인지 능력은 1528에서 전략을 결정하고 1529에서 협상 서비스에게 전략을 제공할 수 있다. 협상 서비스는 이후 제각기1531 및 1532에서 각각의 서비스 제공자(1550 및 1560)와 협상할 수 있고, IoT서비스 제공자들로부터의 둘 모두의 협상 응답들을 수신한 후에, 협상들 및 수신된 데이터에 기초하여 서비스 제공자를 선택할 수 있다. 협상 서비스는 1533에서 선택된 서비스 제공자 데이터를 고객에게 보낼 수 있다. 제안된 실시예들은 ETSI M2M 아키텍처와 같은 기존 IoT 시스템들 및 표준들에 통합되고 구현될 수 있다. 그러 한 실시예에서, 지능형 협상 서비스는 기존 서비스 능력들의 위에 추가적 기능들을 계층화함으로써 구현되는 협 상 서비스 능력이 되도록 매핑될 수 있다. 도 16은 그러한 실시예가 구현될 수 있는 예시적 아키텍처를 도해한다. 협상 서비스 능력(도 16의 \"협상 SC 1620\")은 네트워크(\"클라우드\"로서 지칭될 수 있음)에 상주할 수 있고, 모든 M2M 디바이스들, 게이트웨이들, 및 서버들은 협상 서비스 능력에 접근하는 데 이용될 수 있는, 도 16에서의 인터페이스들(1641-1643)로서 도시된 새로운 서비스 클라우드 인터페이스를 지 원할 수 있다. 네트워크 애플리케이션을 지원하는 M2M 네트워크 서비스 능력 계층(NSCL)은 서비스 클라우드 인터페이스를 통해 직접적으로 협상 서비스 능력에 접근할 수 있다. 게이트웨이 애플리 케이션을 지원하는 M2M 게이트웨이 서비스 능력 층(GSCL)은 NSCL에의 mId 인터페이스(165 1)를 통해 간접적으로 또는 서비스 클라우드 인터페이스를 통해 직접적으로 협상 서비스 능력에 접 근할 수 있다. 디바이스 애플리케이션을 지원하는 M2M 디바이스 서비스 능력 층(DSCL)은 NSCL에의 mId 인터페이스를 통해 간접적으로 또는 서비스 클라우드 인터페이스를 통해 간접 적으로 협상 서비스 능력에 접근할 수 있다. M2M 서비스 능력 계층(service capability layer: SCL)은 협상 서비스 능력과 M2M SCL 간의 상호작용들 에 이용될 수 있는 협상 서비스 능력에의 서비스 클라우드 인터페이스(예를 들어, 1641-1643)를 지원하기 위한 추가적 기능성들을 포함할 수 있다. 협상 서비스 능력은 기존 M2M SCL(예를 들어, NSCL 1631, GSCL 1632, DSCL 1633)을 발견할 수 있다. 협상 서비스 능력은 새롭게 발견된 SCL을 M2M SCL로 공표하거나 발표할 수 있다. 협상 서비스 능력은 또한, 동적으로 그 거동을 구성하고 또한 그 리소스 수형도에 접근 하는 것을 포함하여 M2M SCL에 접근하고, 모니터링하고, 제어할 수 있다. 협상 서비스 능력은 다중의 다 른 M2M SCL에 의해 추가로 공유되고 동시적으로 접근될 수 있다. M2M SCL은 클라우드로부터 협상 서비스 능력 을 발견할 수 있다. M2M SCL(특히 NSCL 1631과 같은 NSCL)은 클라우드에서 협상 서비스 능력에게 자신을 공표하거나 발표할 수 있다. M2M SCL은 그 자신을 또는 그 호스팅된 M2M SCL들을 서빙하기 위해 클라우 드에서 협상 서비스 능력에 접근하고 레버리지할 수 있다. 도 17에서 예시적 구성 1700에 의해 도해된 또 다른 실시예에서, 협상 서비스 능력(도 17의 \"협상 SC 1710\")은 각각의 M2M 디바이스, 게이트웨이, 및/또는 서버(예를 들어, NSCL, GSCL, DSCL) (도 17에서 \" 기존 M2M SC들 1720\"로 집합적으로 도시됨)에 구성될 수 있고, 서비스 능력들 사이의 새로운 직접적 인터페이스 들(1711-1715)이 이용될 수 있다. 예를 들어, M2M NSCL이 협상 서비스 능력을 호스팅할 수 있는 한편, 다른 SCL들(예로, GSCL, DSCL)은 그들 자신의 협상 서비스 능력을 국소적으로 갖지 않지만 M2M NSCL을 이용함으 로써 협상 서비스 능력에 접근한다. 개시된 실시예들에 의해 실행될 수 있는 협상들은 M2M 디바이스와 M2M 게이트웨이 사이의, M2M 게이트웨이와 M2M 서버 사이의, 기타 등등 사이의 등록 프로필들에 대한 협상을 포함한다. 개시된 실시예들에 의해 실행될 수 있는 또 다른 협상은 M2M 디바이스 클러스터링 및 작업 스케줄이다. 개시된 실시예들에 의해 실행될 수 있 는 또 다른 협상은 M2M 디바이스가 그 하에서 데이터를 M2M 게이트웨이에게 보내는 조건들에 대한 M2M 디바이스 와 그 M2M 게이트웨이 사이의 협상이다. 개시된 실시예들에 의해 실행될 수 있는 또 다른 협상은 M2M 디바이스 들을 관리하는데 있어서의 협력에 대한 M2M 게이트웨이들 간의 협상이다. 개시된 실시예들에 의해 실행될 수 있는 또 다른 협상은 데이터 공유 및 가격 산정을 위한 상이한 M2M 서비스 제공자들의 M2M 서버들 간의 협상이 다. 개시된 실시예들에 의해 실행될 수 있는 또 다른 추가적 협상은 조건부 가입들을 가능하게 하기 위한 가입 통지에 대한 조건들에 대한 협상이다. 도 18a는 IoT 지능형 협상 서비스를 위한 시스템들 및 방법들의 하나 이상의 개시된 실시예들이 구현될 수 있는 예시적 M2M 또는 IoT 통신 시스템의 다이어그램이다. 일반적으로, M2M 기술들은IoT를 위한 빌딩 블록들을 제공하고, 임의의 M2M 디바이스, 게이트웨이, 또는 서비스 플랫폼은 IoT의 컴포넌트뿐만 아니라 IoT 서비스 계 층, 기타 등등일 수 있다. 도 18a에 도시된 바와 같이, M2M/IoT 통신 시스템은 통신 네트워크를 포함한다. 통신 네트워크는 고정 네트워크 또는 무선 네트워크(예를 들어, WLAN, 셀 방식, 또는 그와 유사한 것) 또는 이종 네트워크들의 네트워크일 수 있다. 예를 들어, 통신 네트워크는 음성, 데이터, 비디오, 메시징, 브로드캐스트, 또는 그와 유사한 것과 같은 콘텐츠를 다중 이용자에게 제공하는 다중 접근 네트워크들로 구성될 수 있다. 예를 들어, 통신 네트워크는 코드 분할 다중 접근(CDMA), 시간 분할 다중 접근(TDMA), 주파수 분할 다중 접근(FDMA), 직교 FDMA(OFDMA), 단일 반송파 FDMA(SC-FDMA), 및 그와 유사한 것과 같은 하나 이상의 채널 접근 방법들을 채 택할 수 있다. 또한, 통신 네트워크는, 예를 들어 코어 네트워크, 인터넷, 센서 네트워크, 산업적 제어 네 트워크, 개인 권역 네트워크, 융합된 개인 네트워크, 위성 네트워크, 홈 네트워크, 또는 기업 네트워크와 같은 다른 네트워크들을 포함할 수 있다. 도 18a에 도시된 바와 같이, M2M/IoT 통신 시스템은 M2M 게이트웨이 디바이스, 및 M2M 단말 디바이스 들을 포함할 수 있다. 임의 개수의 M2M 게이트웨이 디바이스들과 M2M 단말 디바이스들이 요망에 따라 M2M/IoT 통신 시스템에 포함될 수 있다는 것을 이해할 것이다. M2M 게이트웨이 디바이스들과 M2M 단말 디바이스들 각각은 통신 네트워크 또는 직접 무선 링크를 통해 신호들을 전송 및 수신하도록 구성 될 수 있다. M2M 게이트웨이 디바이스는 고정 네트워크 M2M 디바이스들(예를 들어, PLC)뿐만 아니라 무선 M2M 디바이스들(예를 들어, 셀 방식 및 비 셀 방식)이 통신 네트워크와 같은 오퍼레이터 네트워크들을 통해 또는 직접 무선 링크를 통해 통신하도록 허용한다. 예를 들어, M2M 디바이스들은 통신 네트워크 또는 직접 무선 링크를 통해 데이터를 수집할 수 있고 M2M 애플리케이션 또는 M2M 디바이스들에게 보낼 수 있다. M2M 디바이스들은 또한 M2M 애플리케이션 또는 M2M 디바이스로부터 데이터를 수신할 수 있 다. 또한, 데이터 및 신호들은 후술하는 바와 같이 M2M 서비스 플랫폼을 통해 M2M 애플리케이션에게 보내질 수 있고 그로부터 수신될 수 있다. M2M 디바이스들 및 게이트웨이들은 예를 들어, 셀 방식, WLAN, WPAN(예를 들어, 지그비(Zigbee), 6LoWPAN, 블루투스), 직접 무선 링크, 및 유선을 포함하는 다양한 네트 워크들을 통해 통신할 수 있다. 협상 서비스들, IoT 서비스들, IoT 애플리케이션들, IoT 엔티 티들, 및 임의의 다른 개시된 IoT 엔티티들과 같은 본 명세서에서 기술되는 엔티티들 중 임의의 것이 M2M 디바이스들, 게이트웨이들, 및 서비스 플랫폼과 같은 디바이스들상에서 부분적으로 또는 전체적으 로 구현되거나, 실행되거나, 또는 달리 가능해질 수 있다. 모든 그와 같은 실시예들은 본 개시의 범위 내에 있 는 것으로 상정된다. 예시된 M2M 서비스 플랫폼은 M2M 애플리케이션, M2M 게이트웨이 디바이스들, M2M 단말 디바이스들 , 및 통신 네트워크를 위한 서비스들을 제공한다. M2M 서비스 플랫폼은 요망에 따라 임의 개수의 M2M 애플리케이션들, M2M 게이트웨이 디바이스들, M2M 단말 디바이스들, 및 통신 네트워크들과 통 신할 수 있다는 것을 이해할 것이다. M2M 서비스 플랫폼은 하나 이상의 서버들, 컴퓨터들, 또는 그와 유사 한 것에 의해 구현될 수 있다. M2M 서비스 플랫폼은 M2M 단말 디바이스들 및 M2M 게이트웨이 디바이스 들의 모니터링 및 관리 등과 같은 서비스들을 제공한다. M2M 서비스 플랫폼은 또한 데이터를 수집하고, 상이한 유형들의 M2M 애플리케이션들과 호환적이 되도록 데이터를 변환할 수 있다. M2M 서비스 플랫폼의 기능들은, 예를 들어, 웹 서버로서, 셀 방식 코어 네트워크에서, 클라우드에서, 기타 등등의 다양 한 방법들로 구현될 수 있다. 도 18b를 또한 참조하면, M2M 서비스 플랫폼은 여러 가지의 애플리케이션들 및 버티컬들(verticals)이 레버리 지할 수 있는 서비스 전달 능력들의 핵심 세트를 제공하는 서비스 계층(예를 들어, 본 명세서에서 기술되는 바와 같은 네트워크 서비스 능력 계층(NSCL))을 전형적으로 구현한다. 이들 서비스 능력들은 M2M 애플리케이션 들로 하여금 디바이스들과 상호 작용하고 또한 데이터 수집, 데이터 분석, 디바이스 관리, 보안성, 계산서 청구, 서비스/디바이스 발견, 기타 등등과 같은 기능들을 수행할 수 있게 한다. 본질적으로, 이들 서비스 능력 들은 애플리케이션이 이들 기능성들을 구현하는 부담으로부터 자유롭게 하고, 따라서 애플리케이션 개발을 단순 화하고 마케팅하기 위한 비용 및 시간을 절감시킨다. 서비스 계층은 또한 M2M 애플리케이션들로 하여 금 서비스 계층이 제공하는 서비스들과 연계하여 다양한 네트워크들을 통해 통신할 수 있게 한다. 몇몇 실시예들에서, M2M 애플리케이션들은 IoT 지능형 협상 서비스들을 위한 시스템들 및 방법들의 개시된 내용을 이용할 수 있는 디바이스들을 포함하는 하나 이상의 피어 투 피어 네트워크들의 생성을 위한 기초를 형 성하는 요망 애플리케이션들을 포함할 수 있다. M2M 애플리케이션들은, 제한 없이, 수송, 건강 및 건강 복 지, 연결된 가정, 에너지 관리, 자산 추적, 및 보안과 감시와 같은 다양한 산업들에서의 응용들을 포함할 수 있 다. 전술한 바와 같이, 디바이스들, 게이트웨이들, 및 시스템의 다른 서버들에 걸쳐서 실행되는 M2M 서비스 계 층은, 예를 들어, 데이터 수집, 디바이스 관리, 보안, 계산서 청구, 로케이션 추적/지오펜싱(geofencing), 디바 이스/서비스 발견, 및 레거시 시스템들의 통합과 같은 기능들을 지원하고, 이러한 기능들을 M2M 애플리케이션들 에의 서비스들로서 제공한다. 기술된 서비스 계층과 대상들이 상호작용하는 애플리케이션들은 M2M 애플리 케이션들의 것들과 같은 애플리케이션들일 수 있다. 도 18c는, 예를 들어, M2M 단말 디바이스 또는 M2M 게이트웨이 디바이스와 같은 예시적 M2M 디바이스 의 시스템 다이어그램이다. 도 18c에 도시된 바와 같이, M2M 디바이스는 프로세서, 송수신기 , 송신/수신 소자, 스피커/마이크, 키패드, 디스플레이/터치패드/표시자들(예를 들어, 하나 이 상의 발광 다이오드들(LED들)), 비 착탈식 메모리, 착탈식 메모리, 전원, GPS 칩세트, 및 다른 주변 장치들을 포함할 수 있다. M2M 디바이스가 실시예에 부합하도록 남아 있으면서 전술한 요소 들 중 임의의 하위 조합을 포함할 수 있다는 것을 이해할 것이다. 이 디바이스는 IoT 지능형 협상 서비스를 위 한 개시된 시스템들 및 방법들을 이용하는 디바이스일 수 있다. 프로세서는 범용 프로세서, 특수 목적 프로세서, 종래 프로세서, 디지털 신호 프로세서(DSP), 복수의 마이 크로프로세서, DSP 코어와 연관되는 하나 이상의 마이크로프로세서들, 컨트롤러, 마이크로컨트롤러, 하나 이상 의 ASIC들(Application Specific Integrated Circuits), 하나 이상의 FPGA(Field Programmable Gate Array) 회로들, 임의의 다른 유형 및 개수의 집적 회로들(ICs), 상태 머신, 및 그와 유사한 것일 수 있다. 프로세서 는 신호 코딩, 데이터 처리, 전력 제어, 입력/출력 처리, 및/또는 M2M 디바이스로 하여금 무선 환경에 서 동작할 수 있게 하는 임의의 다른 기능성을 실행할 수 있다. 프로세서는 송신/수신 소자에 결합될 수 있는 송수신기에 결합될 수 있다. 도 18c가 프로세서와 송수신기를 별개 컴포넌트들로서 묘사 하지만, 프로세서와 송수신기가 전자적 패키지 또는 칩에 함께 통합될 수 있다는 것을 이해할 것이다. 프로세서는 애플리케이션 계층 프로그램들(예를 들어, 브라우저들) 및/또는 RAN(radio access-layer) 프로 그램들 및/또는 통신을 실행할 수 있다. 프로세서는, 예를 들어, 접근 계층 및/또는 애플리케이션 계층에 서의 것과 같은, 인증, 보안 키 일치, 및/또는 암호화 연산들과 같은 보안 동작들을 실행할 수 있다. 송신/수신 소자는 M2M 서비스 플랫폼에게 신호들을 송신하고, 및/또는 그로부터 신호들을 수신하도록 구성될 수 있다. 예를 들어, 실시예에서, 송신/수신 소자는 RF 신호들을 송신 및/또는 수신하도록 구성된 안테나일 수 있다. 송신/수신 소자는, WLAN, WPAN, 셀 방식, 및 그와 유사한 것과 같은 다양한 네트워크들 및 공중 인터페이스들을 지원할 수 있다. 실시예에서, 송신/수신 소자는 예를 들어, IR, UV, 또는 가시광 신호들을 송신 및/또는 수신하도록 구성되는 발광기/검출기일 수 있다. 또 다른 실시예에서, 송신/수신 소자 는 RF 신호 및 광 신호 양쪽을 송신 및 수신하도록 구성될 수 있다. 송신/수신 소자가 무선 또는 유선 신호들의 임의의 조합을 송신 및/또는 수신하도록 구성될 수 있음을 이해할 것이다. 또한, 송신/수신 소자가 단일 요소로서 도 18c에 묘사되기는 하지만, M2M 디바이스는 임의의 개수의 송신/수신 소자를 포함할 수 있다. 더 구체적으로, M2M 디바이스는 MIMO 기술을을 채택할 수 있다. 따라서, 실시예에서, M2M 디바이스는 무선 신호들을 송신 및 수신하기 위한 두 개 이상의 송신/수신 소자 (예를 들어, 다중 안테나)를 포함할 수 있다. 송수신기는 송신/수신 소자에 의해 송신될 신호들을 변조하고 송신/수신 소자에 의해 수신되는 신 호들을 복조하도록 구성될 수 있다. 앞서 주목한 바와 같이, M2M 디바이스는 다중 모드 능력을 가질 수 있 다. 그러므로, 송수신기는 M2M 디바이스로 하여금, 예를 들어, UTRA 및 IEEE 802.11과 같은 다중 RAT 를 통해 통신할 수 있게 하기 위한 다중 송수신기를 포함할 수 있다. 프로세서는 비 착탈식 메모리 및/또는 착탈식 메모리와 같은, 임의 유형의 적합한 메모리로부터 정보에 접근할 수 있고 이것에 데이터를 저장할 수 있다. 비 착탈식 메모리는 랜덤 액세스 메모리(RAM), 판독 전용 메모리(ROM), 하드 디스크, 또는 다른 유형의 메모리 스토리지 디바이스를 포함할 수 있다. 착탈식 메모리는 가입자 식별 모듈(SIM) 카드, 메모리 스틱, 보안 디지털(SD) 메모리 카드, 및 그와 유사한 것을 포함할 수 있다. 기타 실시예들에서, 프로세서는 서버 또는 홈 컴퓨터와 같은 M2M 디바이스상에 물리 적으로 자리 잡지 않은 메모리로부터 정보에 접근할 수 있고 이것에게 데이터를 저장할 수 있다. 프로세서(3 2)는 본 명세서에서 제시된 실시예들의 일부에서 기술된 것들과 같은 다양한 조건들 및 파라미터들에 응답하여 디스플레이 또는 표시자들상의 점등 패턴들, 이미지들 또는 색들을 제어하도록 구성될 수 있다. 예를 들어, 프로세서는 본 명세서에서 기술되는 실시예들의 일부에서의 IoT 협상 서비스가 성공적이거나 비성공 적인지의 결정에 응답하여 디스플레이 또는 표시자들상에 점등 패턴들, 이미지들, 또는 색들을 제어하도록 구성될 수 있다. 프로세서는 전원으로부터 전력을 수신할 수 있고, M2M 디바이스 에서의 다른 컴포넌트들에게 전력 을 분배하고 및/또는 제어하도록 구성될 수 있다. 전원은 M2M 디바이스에게 전력을 공급하기 위한 임 의의 적합한 디바이스일 수 있다. 예를 들어, 전원은 하나 이상의 건전지들(예를 들어, 니켈-카드뮴 (NiCd), 니켈-아연(NiZn), 니켈 금속 수소화물(NiMH), 리튬-이온(Li-이온), 등), 태양광 전지들, 연료 전지들,및 그와 유사한 것을 포함할 수 있다. 프로세서는 또한, M2M 디바이스의 현재 로케이션에 관한 로케이션 정보(예를 들어, 경도와 위도)를 제 공하도록 구성될 수 있는 GPS 칩셋에 결합될 수 있다. M2M 디바이스는 본 실시예에 부합하도록 남아 있으면서 임의의 적합한 로케이션 결정 방법에 의해 로케이션 정보를 획득할 수 있음을 이해할 것이다. 프로세서는 다른 주변 장치들에 추가로 결합될 수 있는데, 이러한 주변 장치들은 부가의 특징들, 기능, 및/또는 유선 또는 무선 연결을 제공하는 하나 이상의 소프트웨어 및/또는 하드웨어 모듈들을 포함할 수 있다. 예를 들어, 주변 장치들은 가속도계, e-컴퍼스, 위성 송수신기, 센서, (사진들 또는 비디오를 위한) 디지털 카메라, 범용 직렬 버스(USB) 포트, 진동 디바이스, 텔레비전 송수신기, 핸즈프리 헤드셋, 블루투스® 모듈, 주파수 변조(FM) 무선 유닛, 디지털 음악 플레이어, 미디어 플레이어, 비디오 게임 플레이어 모듈, 인터 넷 브라우저, 및 그와 유사한 것을 포함할 수 있다. 도 18d는, 예를 들어 도 18a 및 도 18b의 M2M 서비스 플랫폼이 그 상에서 구현될 수 있는 예시적 컴퓨팅 시스템의 블록도이다. 컴퓨팅 시스템은 컴퓨터 또는 서버를 포함할 수 있고 또한 주로 컴퓨터 판독 가 능 명령어들에 의해 제어될 수 있는데, 이 컴퓨터 판독 가능 명령어들은 그러한 소프트웨어가 저장되거나 접근 되면 어디서든 간에 또는 어떠한 수단에 의해서든 간에 소프트웨어의 형태일 수 있다. 그러한 컴퓨터 판독 가 능 명령어들은 컴퓨팅 시스템으로 하여금 작업을 행하도록 야기하기 위해 중앙 처리 유닛(CPU) 내에서 실행될 수 있다. 많은 알려진 워크스테이션들, 서버들, 및 개인용 컴퓨터들에서, 중앙 처리 유닛은 마이크 로프로세서로 지칭되는 단일 칩 CPU에 의해 구현된다. 다른 머신들에서, 중앙 처리 유닛은 다중 프로세서 를 포함할 수 있다. 보조프로세서는 메인 CPU와는 구별되고, 부가적 기능들을 실행하거나 CPU를 조력하는 선택 사항 프로세서이다. CPU 및/또는 보조프로세서는 IoT 지능형 협상 서비스를 위한 개시 된 시스템들 및 방법들과 관계되는 데이터를 수신하고, 생성하고, 처리할 수 있다. 동작시에, CPU는 명령어들을 페치하고, 디코딩하고, 및 실행하고, 또한 컴퓨터의 주 데이터 경로, 시스템 버스를 통해 다른 리소스들에게 및 이들로부터 정보를 전송한다. 그러한 시스템 버스는 컴퓨팅 시스템(9 0)에서의 컴포넌트들을 연결시키고, 데이터 교환을 위한 매체를 정의한다. 시스템 버스는 데이터를 보내기 위한 데이터 라인들, 주소들을 보내기 위한 주소 라인들, 인터럽트들을 보내기 위한 및 시스템 버스를 작동시키 기 위한 제어 라인들을 전형적으로 포함한다. 그러한 시스템 버스의 예는 PCI(Peripheral Component Interconnect) 버스이다. 시스템 버스에 결합되는 메모리 디바이스들은 랜덤 액세스 메모리(RAM) 및 판독 전용 메모리(ROM)(9 3)를 포함한다. 그러한 메모리들은 정보가 저장 및 검색되도록 허용하는 회로를 포함한다. ROM들은 쉽게 수정될 수 없는 저장된 데이터를 일반적으로 포함한다. RAM에 저장되는 데이터는 CPU 또는 다른 하드 웨어 디바이스들에 의해 판독 또는 변경될 수 있다. RAM 및/또는 ROM에의 접근은 메모리 컨트롤러(9 2)에 의해 제어될 수 있다. 메모리 컨트롤러는 명령어들이 실행됨에 따라 가상 주소들을 물리적 주소들로 번역하는 주소 번역 기능을 제공할 수 있다. 메모리 컨트롤러는 또한 시스템 내에서의 프로세스들을 격리 하고 또한 사용자 프로세스들로부터 시스템 프로세스들을 격리하는 메모리 보호 기능을 제공할 수 있다. 그러 므로, 제1 모드에서 실행되는 프로그램은 그 자신의 프로세스 가상 주소 공간에 의해 매핑되는 메모리에만 접근 할 수 있다; 프로세스들 간에 공유하는 메모리가 셋업되지 않았다면 또 다른 프로세스의 가상 주소 공간 내의 메모리에 접근할 수 없다. 또한, 컴퓨팅 시스템은, 프린터, 키보드, 마우스, 및 디스크 드라이브와 같은 주변 장치 들에게 CPU로부터의 명령어들을 통신하는 것을 담당하는 주변 장치 컨트롤러를 포함할 수 있다. 디스플레이 컨트롤러에 의해 제어되는 디스플레이는 컴퓨팅 시스템에 의해 발생되는 가시적 출력 을 표시하는데 사용된다. 그러한 가시적 출력은 텍스트, 그래픽, 애니메이션 그래픽, 및 비디오를 포함할 수 있다. 디스플레이는 CRT 기반 비디오 디스플레이, LCD 기반 평면 패널 디스플레이, 가스 플라즈마 기반 평 면 패널 디스플레이, 또는 터치 패널로 구현될 수 있다. 디스플레이 컨트롤러는 디스플레이에게 보내 지는 비디오 신호를 발생하기 위해 필요한 전자적 컴포넌트들을 포함한다. 또한, 컴퓨팅 시스템은 도 18a 및 도 18b의 네트워크와 같은 외부 통신 네트워크에 컴퓨팅 시스템(9 0)을 연결하는 데 이용될 수 있는 네트워크 어댑터를 포함할 수 있다. 실시예에서, 네트워크 어댑터는 IoT 지능형 협상 서비스를 위한 개시된 시스템들 및 방법들과 관계되는 데이터를 수신하고 전송할 수 있다. 본 명세서에서 기술되는 시스템들, 방법들, 및 절차들 중 임의의 것 또는 모든 것은 물리적 디바이스 또는 장치 로서 구체화되는 컴퓨터 판독 가능 스토리지 매체상에 저장되는 컴퓨터 실행 가능 명령어들(즉, 프로그램 코 드)의 형태로 구체화될 수 있다. 그러한 명령어들은, 컴퓨터, 서버, M2M 단말 디바이스, M2M 게이트웨이 디바 이스, 또는 그와 유사한 것과 같은 머신에 의해, 또는 머신 내에 구성되는 프로세서에 의해 실행될 때, 본 명세 서에 기술된 시스템들, 방법들, 및 절차들을 실제화하고, 실행하고, 및/또는 구현한다. 특정하게는, 전술한 단 계들, 동작들, 또는 기능들 중 임의의 것은 그러한 컴퓨터 실행 가능 명령어들의 형태로 구현될 수 있다. 컴퓨 터 판독 가능 스토리지 매체는 정보의 저장을 위해 임의의 방법 또는 기술로 구현되는 휘발성 및 비휘발성, 착 탈식 및 비 착탈식 매체 모두를 포함하지만, 그러한 컴퓨터 판독 가능 스토리지 매체는 신호들을 포함하지는 않 는다. 컴퓨터 판독 가능 스토리지 매체는 RAM, ROM, EEPROM, 플래시 메모리 또는 다른 메모리 기술, CDROM, DVD(digital versatile disk) 또는 다른 광 디스크 스토리지, 자기 카세트, 자기 테이프, 자기 디스크 스토리지 또는 다른 자기 스토리지 디바이스들, 또는 원하는 정보를 저장하기 위해 이용될 수 있고 컴퓨터에 의해 접근될 수 있는 임의의 다른 물리적 매체를 포함하는데, 이들로만 제한되지는 않는다. 본 개시의 주제의 양호한 실시예들을 기술할 때, 도면에 도시된 바와 같이, 명료성을 위해 특정 전문 용어가 채택된다. 그러나, 청구된 주제는 그렇게 선택된 특정 전문 용어로만 한정되도록 의도되지 않았고, 각각의 특 정 요소는 유사한 목적을 달성하기 위해 유사한 방식으로 동작하는 모든 기술적 균등물들을 포함하는 것으로 이 해해야 한다. 이 작성된 설명은, 최상의 모드를 포함하여 본 발명을 개시하기 위해, 또한 통상의 기술자가 임의의 디바이스 들 또는 시스템들을 제조하고 사용하며 임의의 통합된 방법들을 수행하는 것을 포함하여 본 발명을 실시하는 것 을 가능하게 하기 위해 예들을 이용한다. 본 발명의 특허 가능 범위는 청구항들에 의해 정의되며, 통상의 기술 자에게 착안되는 다른 예들을 포함할 수 있다. 그러한 다른 예들은 이들이 청구항들의 문자적 기재와 달라지지 않는 구조적 요소들을 갖는 경우에, 또는 이들이 청구항들의 문자적 기재와 미미한 차이들을 갖는 균등한 구조 적 요소들을 포함하는 경우에 청구항들의 범위 내에 있는 것으로 의도된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18a 도면18b 도면18c 도면18d"}
{"patent_id": "10-2015-7034690", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 지능형 협상 서비스가 실시예에 따라 구현될 수 있는 예시적 IoT 아키텍처를 도해한다. 도 2는 지능형 협상 서비스를 실시예에 따라 구현하는 예시적 방법을 도해한다. 도 3은 실시예에 따른 예시적 지능형 협상 서비스 신호 흐름을 도해한다. 도 4는 실시예에 따른 예시적 지능형 협상 서비스 신호 흐름을 도해한다. 도 5는 실시예에 따라 지능형 협상 서비스를 구현하는 예시적 방법을 도해한다. 도 6은 실시예에 따른 예시적 지능형 협상 신호 흐름을 도해한다. 도 7은 실시예에 따른 예시적 IoT 지능형 협상 구성을 도해한다. 도 8은 실시예에 따른 예시적 지능형 협상 신호 흐름을 도해한다. 도 9는 실시예에 따른 예시적 IoT 지능형 협상 구성을 도해한다. 도 10은 실시예에 따른 예시적 지능형 협상 신호 흐름을 도해한다. 도 11은 실시예에 따른 예시적 IoT 지능형 협상 구성을 도해한다. 도 12는 지능형 협상 서비스가 실시예에 따라 구현될 수 있는 예시적 IoT 아키텍처를 도해한다. 도 13은 실시예에 따른 예시적 IoT 지능형 협상 구성을 도해한다. 도 14는 실시예에 따른 예시적 지능형 협상 신호 흐름을 도해한다. 도 15는 실시예에 따른 예시적 지능형 협상 신호 흐름을 도해한다. 도 16은 실시예에 따른 예시적 IoT 지능형 협상 구성을 도해한다.도 17은 실시예에 따른 지능형 협상 서비스를 위한 예시적 IoT 지능형 협상 구성을 도해한다. 도 18a는 하나 이상의 개시된 실시예들이 구현될 수 있는 예시적 M2M 또는 IoT 통신 시스템의 시스템 도이다. 도 18b는 도 18a에 도해된 M2M/IoT 통신 시스템 내에서 이용될 수 있는 예시적 아키텍처의 시스템 도이다. 도 18c는 도 18a에 도해된 통신 시스템 내에서 이용될 수 있는 예시적 M2M/IoT 단말 또는 게이트웨이 디바이스 의 시스템 도이다. 도 18d는 도 18a의 통신 시스템의 양태들이 구체화될 수 있는 예시적 컴퓨팅 시스템의 블록도이다."}
