{"patent_id": "10-2022-0134057", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0054449", "출원번호": "10-2022-0134057", "발명의 명칭": "작물의 생육정보에 의한 증강현실 콘텐츠를 제공하는 식물재배장치 및 식물재배 시스템", "출원인": "주식회사 레디츠", "발명자": "심재용"}}
{"patent_id": "10-2022-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트팜 식물재배시스템에 있어서,식물이 재배될 수 있는 복수의 배지를 구비하고, 내장되는 센서를 통해 작물 재배 환경을 모니터링하며, 내장된동작모듈을 제어하고, 외부와 정보를 송수신하는 IoT모듈을 포함하여 맞춤형 생육환경을 제공하는식물재배장치;상기 식물재배장치로부터 식물의 재배환경 데이터를 수신하며, 식물 재배를 위한 사용자 입력을 수신하여 상기식물재배장치에 제어신호를 발송하고, AR 카드에 의한 앱을 구동하여 증강현실 콘텐츠를 출력하는 기능을 포함하는 사용자 모바일 단말; 및상기 식물재배장치를 클라우드 환경의 네트워크로 접속을 위한 공유기; 및 클라우드 환경으로 구축되며, 식물재배 및 증강현실 콘텐츠 제공을 포함하는 기능을 수행하기 위한 모바일 애플리케이션을 제공하고, 식물 재배결과 데이터, AR 캐릭터 생성 및 저장, 사용자 데이터 및 서비스 데이터를 저장하는 시스템 서버; 를 포함하는것을 특징으로 하는 식물재배시스템."}
{"patent_id": "10-2022-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 시스템 서버는, 사용자별로 식물 재배 이미지를 저장하는 카메라 데이터 저장부;사용자별 장비 정보를 저장하는 디바이스 데이터베이스;상기 카메라 데이터 저장부에 저장되는 식물 재배 이미지 및 상기 식물재배장치로부터 전송되는 재배 환경 정보로부터 현재 식물상태를 판단하여 결과값을 식물재배 데이터베이스부로 전송하는 식물재배 분석부;상기 식물재배 분석부로부터 수신된 결과값을 저장하고, 결과값이 특정범위를 벗어나 환경 조정이 필요할 경우,상기 식물재배장치에 제어신호를 전송하는 기능을 포함하는 상기 식물재배 데이터베이스부;상기 카메라 데이터 저장부에 저장되는 식물 재배 이미지로부터 매칭되는 증강현실 캐릭터를 생성하여 저장하는AR 캐릭터 저장부; 및사용자들의 정보가 저장되는 사용자 정보 데이터베이스; 및 사용자별로 구매정보가 저장되는 구매 데이터베이스를 포함하는 것을 특징으로 하는 식물재배시스템."}
{"patent_id": "10-2022-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 식물재배장치는,하부에 물 또는 양분이 함유된 물이 수용된 수조부;상기 수조부 상부에 식물을 접목하는 복수의 배지가 배치된 배지부, 상기 배지부 상부에는 투명창이 형성되고조명장치를 포함하여 식물이 성장할 수 있는 재배 공간이 형성된 재배부; 및 상기 재배부 상부에는 제어기기들이 장착된 제어장치; 를 포함하며,상기 제어장치는, 제어상태를 출력하는 디스플레이부;각 부를 동작시키고 제어하는 프로세서가 내장된 MCU 제어부;식물의 재배상태를 일정 시간 간격으로 촬영하는 카메라부;상기 수조부에 물을 공급 및 순환시키는 워터 펌프;공개특허 10-2024-0054449-3-상기 재배부의 환기 기능을 제어하는 환기부; 수위측정부, 광량을 측정하는 광측정부 및 상기 재배부의 온, 습도를 측정하는 온습도부로부터 센싱신호를 수신하는 센싱부; 및상기 각 부의 동작상태를 모니터링하기 위한 신호 및 제어신호를 송수신하는 IoT 통신 모듈을 포함하는 것을 특징으로 하는 식물재배시스템."}
{"patent_id": "10-2022-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 사용자 모바일 단말에서 실행되는 모바일 애플리케이션은,재배되는 식물의 재배이미지를 출력하는 기능을 수행하는 카메라데이터 출력 앱;상기 식물재배장치에 내장된 동작모듈의 상태를 모니터링하고 제어하는 기능을 수행하는 동작모듈 감시 및 제어앱; 및상기 식물재배장치에서 재배되는 식물의 재배상태에 대한 AR 캐릭터를 출력시키는 식물 재배모니터링 및 캐릭터앱;을 포함하는 것을 특징으로 하는 식물재배시스템."}
{"patent_id": "10-2022-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 모바일 애플리케이션(APP)은 사용자 정보 및 식물구매정보를 제시하여 주는 유저 데이터부; 및 요구되는식물의 구매 및 구매정보를 제시하여 주는 식물 구매정보 앱 을 더 포함하며,사용자가 사용자 모바일 단말을 통해 식물 구매정보 앱에서 식물 씨앗을 구매하면, 상기 시스템 서버는 상기 구매정보 데이터베이스에 해당 구매에 대한 구매정보를 저장하며,상기 사용자는 판매서버의 관리자로부터 QR코드가 포함된 AR 카드, 식물씨앗이 심어진 배지가 함께 포장된 패키지를 수령 후, 상기 AR 카드를 모바일 단말기의 QR reader를 이용하여 실행하면, 상기 시스템 서버는 상기 구매 정보와 일치하는지 확인 후 상기 식물재배 데이터베이스에서 해당 식물 정보에사용자 정보를 업데이트하여 관리하는 것을 특징으로 하는 식물재배시스템."}
{"patent_id": "10-2022-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 시스템 서버의 AR 캐릭터 저장부는 각 식물 종류별 생장 주기별 및 크기별로 AR 캐릭터데이터를 축적 관리하며,상기 식물재배장치로부터 상기 카메라 데이터 저장부에 저장되는 식물 재배 이미지가 입력되면, 축적된 AR 캐릭터데이터로부터 입력된 식물재배의 생장 주기 및 식물 크기에 매칭되는 AR 캐릭터를 추출하여 사용자 요구에 따른 AR 캐릭터를 생성하는 것을 특징으로 하는 식물재배시스템."}
{"patent_id": "10-2022-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,사용자가 상기 모바일 단말을 이용하여 의해 증강현실 캐릭터가 형성되는 방법은 상기 AR 카드를 이용하여 사용자 모바일 단말의 QR 인식부에 사용자가 AR 카드의 QR 이미지를 인식시켜서 AR 앱이 실행되는 단계;사용자가 상기 앱 상에서 사용자가 AR 콘텐츠를 요청하는 단계;상기 시스템 서버가 상기 사용자의 AR 콘텐츠를 요청에 따라, 상기 AR 캐릭터 저장부로부터 상기 식물재배장치에서 전송된 식물의 현재 이미지에 매칭되는 증강현실 캐릭터를 추출하여 사용자 모바일 단말로 전송하는 단계;상기 모바일 단말에서 증강현실 캐릭터를 전송받은 AR 앱의 프로세싱에 따라 카메라의 촬영모드가 실행이 되는공개특허 10-2024-0054449-4-단계; 및상기 모바일 단말에서 촬영된 카메라 이미지 상에 상기 전송된 증강현실 캐릭터가 같이 출력이 되는 단계를 포함하는 것을 특징으로 하는 식물재배시스템."}
{"patent_id": "10-2022-0134057", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "식물이 재배될 수 있는 복수의 배지를 구비하고, 내장되는 센서를 통해 작물 재배 환경을 모니터링하며, 내장된 동작모듈을 제어하고, 외부와 정보를 송수신하는 IOT모듈을 포함하여 맞춤형 생육환경을 제공하는 식물재배장치; 상기 식물재배장치로부터 식물의 재배환경 데이터를 수신하며, 식물 재배를 위한 사용자 입력을 수신하여 상기 (뒷면에 계속)"}
{"patent_id": "10-2022-0134057", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 작물의 생육정보에 의한 증강현실 콘텐츠를 제공하는 식물재배장치 및 식물재배시스템에 관한 것이다."}
{"patent_id": "10-2022-0134057", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트팜은 정보통신기술(ICT)을 활용해 '시간과 공간의 제약없이' 원격으로, 자동으로 작물의 생육환경을 관측 하고 최적의 상태로 관리하는 과학 기반의 작물 재배방식이다. 스마트팜은 최적화된 생육환경을 제공해 수확 시기와 수확량 예측뿐만 아니라 품질과 생산량을 한층 더 높일 수 있어서 작물재배 분야에 대한 효율성과 수익성이 개선되는데 큰 기여를 하고 있다. 스마트팜은 사물인터넷 기술을 기반으로 시설의 온도, 습도, 일조량, 이산화탄소량 및 토양을 자동으로 측정 및 분석하고, 이 결과에 따라 필요한 제어를 수행하고 작물에 필요한 영양소를 공급한다. 또한, 스마트폰과 같은 모바일 기기를 통해 작물 재배 환경을 원격으로 관리 가능하도록 지원할 수 있다. 이와 같은 스마트팜을 제어하는 종래의 기술이 대한민국 공개특허 제10-2022-0085654호(스마트 재배 시스템 및 이의 제어방법)로 개시된 바 있다. 위 스마트 재배 시스템은, 비닐하우스 상에 배치되어, 식물의 성장관련데이터를 측정하여 수집하는 IoT 센서; 상기 비닐하우스 상에 설치되어, 상기 식물의 재배환경을 제어하는 복수개의 IoT 기기; 상기 비닐하우스 및 상 기 식물을 동일하게 재현하는 가상공간을 생성하고, 상기 식물의 재배환경 및 상기 성장관련데이터에 기초하여 상기 식물의 성장속도를 시뮬레이션한 후 상기 가상공간에 반영하는 서버; 및 상기 서버로부터 상기 가상공간에 대한 정보를 수신하여 영상으로 표시하고, 입력된 제어 정보에 기초하여 상기 복수개의 IoT 기기 및 상기 서버 중 적어도 하나를 제어하는 이동 단말을 포함하는 내용이 개시된다. 위 선행문헌에 따르면, 디지털 트윈을 통해 작물의 성장 속도를 예측하고 재배 환경을 정밀하게 제어할 수 있으 며, 작물이 자라는 동안에 작물 상태에 대해 피드백을 얻고, 더 좋은 양질의 작 물을 수확할 수 있게 할 수 있 다. 농업에 사물인터넷(IoT)과 인공지능 기술과 같은 4차 산업혁명 기술을 접목하여 자동으로 작물의 생육 환경을 제어하는 스마트팜이 주로 연구되어 주목받고 있으나, 가정용 스마트팜 기술은 금액이나 편의성 측면에서 매력 도가 떨어져서 이에 대한 연구가 부족한 실정이다. 최근 신종 코로나바이러스 감염증의 영향으로 실내 식물 가꾸기(indoor gardening)가 급부상하면서, 가정용 스 마트팜 장치에 대한 관심이 높아지고 있다. 그러나 가정용 스마트팜 장치의 경우, 장치 자체의 금액이 부담스럽고, 이를 대체하기 위해 렌탈 및 정기 구독 형태로 구입한다 하더라도 대규모 재배시설을 통해 생산되는 작물을 구입하는 비용과 비교할 때 경제성이 떨어 진다는 단점이 있다. 또한, 현재 개발되고 있는 가정용 스마트팜은 무농약, 친환경, 웰빙과 같이 소비자에게 편익을 제공한다는 측면 에 초점을 맞추고 있는 반면, 실제로는 작물의 수확 시기를 맞추기 어렵고, 익일 배송 서비스와의 경쟁력에서도 뒤처진다는 점에서 편의성이 높지 않다. 따라서 가정에서 소량으로 재배가 쉽고, 작물 생육 상태에 따른 캐릭터를 모바일 단말(스마트폰)로 제공함으로 써 재배의 즐거움을 배가시킬 수 있는 스마트팜 시스템이 필요하다.선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2022-0085654호(스마트 재배 시스템 및 이의 제어방법)"}
{"patent_id": "10-2022-0134057", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 스마트팜 식물재배장치에 IoT 기술을 적용하여 작물 재배의 번거로움을 최소화하고, 언제, 어 디서, 누구나, 쉽고 간편하게 작물 재배를 경험할 수 있도록 생육 상태를 AR 컨텐츠로 제공, 서로 공유할 수 있 는 스마트팜 플랫폼에 의한 식물재배장치 및 식물재배시스템을 제공하는 것이다."}
{"patent_id": "10-2022-0134057", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따른 식물재배시스템은, 식물이 재배될 수 있는 복수의 배지를 구비하고, 내장되는 센서를 통해 작물 재배 환경을 모니터링하며, 내장된 동작모듈을 제어하고, 외부와 정보를 송수신하는 IoT모듈을 포함 하여 맞춤형 생육환경을 제공하는 식물재배장치; 상기 식물재배장치로부터 식물의 재배환경 데이터를 수신하며, 식물 재배를 위한 사용자 입력을 수신하여 상기 식물재배장치에 제어신호를 발송하고, AR 카드에 의한 앱을 구 동하여 증강현실 콘텐츠를 출력하는 기능을 포함하는 사용자 모바일 단말; 상기 식물재배장치를 클라우드 환경 의 네트워크로 접속을 위한 공유기; 및 클라우드 환경으로 구축되며, 식물 재배 및 증강현실 콘텐츠 제공을 포 함하는 기능을 수행하기 위한 모바일 애플리케이션을 제공하고, 식물 재배 결과 데이터, AR 캐릭터 생성 및 저 장, 사용자 데이터 및 서비스 데이터를 저장하는 시스템 서버; 를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0134057", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시 예에 따르면, 가정용 스마트팜 장치를 제공하고, 스마트팜 장치에 내장되어 있는 센서를 통 해 작물의 재배 상태를 모니터링하고, 내장된 동작 모듈을 IoT 기술을 통해 원격으로 제어함으로써 최적의 재배 환경을 구축하는 데 필요한 시간과 노력, 번거로움을 최소화하여 누구나 손쉽게 재배가 가능한 효과가 있다. 또한, 단순히 작물의 성장에 관여하는 것뿐만 아니라, 작물 생육 상태에 따른 AR 컨텐츠를 제공하고 서로 공유 할 수 있도록 플랫폼을 구현함으로써, 작물 재배에 대한 긍정적인 이미지를 키워주고, 생장 체험의 즐거움이 배 가될 수 있다. 또한, 물 재배를 통해 식물의 성장 과정을 지켜보고, 직접 기른 작물을 수확하여 식탁에 올리는 일련의 과정을 통해, 아이들의 성취감과 자존감 향상에 도움이 되고, 음식의 소중함을 깨닫게 하는 좋은 교구가 될 수 있다. 또한, 신종 코로나바이러스 감염증으로 외출이 자유롭지 못하고 집에서 보내는 시간이 길어지면서 생기게 된 우 울증을 완화시켜주고, 공간을 사용하는 사용자에게 정서적 안정감을 가져다 주는 플렌테리어 실현이 가능한 효 과를 가진다."}
{"patent_id": "10-2022-0134057", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구 성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재된 \"…부\", \"…기\", \"모듈\", \"장치\" 등의 용어는 적어도 하나의 기능이나 작동을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제1, 제2 등의 용어를 사용할 수 있다. 이러한 용 어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차 례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 '연결', '결합' 또는 '접속'된다고 기 재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결, 결합 또는 접속될 수 있지만, 그 구성 요소와 그 다른 구성요소 사이에 또 다른 구성 요소가 '연결', '결합' 또는 '접속'될 수도 있다고 이해되어야 할 것이다. 이하 본 발명의 구현에 따른 본 발명은 작물의 생육정보에 의한 증강현실 콘텐츠를 제공하는 식물재배장치 및 식물재배 시스템에 관해 상세하게 설명한다. 도 1은 본 발명의 일 실시 예에 따른 작물의 생육정보에 의한 증강현실 콘텐츠를 제공하는 식물재배 시스템의 구성을 도시한 것이다. 도 1을 참조하면, 본 발명의 일 실시 예에 따른 작물의 생육정보에 의한 증강현실 콘텐츠를 제공하는 식물재배 시스템은 식물이 재배될 수 있는 복수의 배지를 구비하고, 내장되는 센서를 통해 작물 재배 환경을 모니터 링하며 내장된 동작모듈을 제어하고, 외부와 정보를 송수신하는 IoT모듈을 포함하여 맞춤형 생육환경을 제공하 는 식물재배장치, 상기 식물재배장치로부터 식물의 재배환경 데이터를 수신하며, 식물 재배를 위한 사용자 입력을 수신하여 식물재배장치에 제어신호를 발송하고, AR 카드에 의한 앱을 구동하여 증강현 실 콘텐츠를 출력하는 기능을 포함하는 사용자 모바일 단말, 식물재배장치를 클라우드 환경의 네트워 크로 접속을 위한 공유기 및 클라우드 환경으로 구축되며, 식물 재배 및 증강현실 콘텐츠 제공을 포함하 는 기능을 수행하기 위한 모바일 애플리케이션(APP)을 제공하고, 식물 재배 결과 데이터, AR 캐릭터 생성 및 저 장, 사용자 데이터 및 서비스 데이터를 저장하는 시스템 서버를 포함한다. 또한, 본 발명의 일 실시 예에 따른 작물의 생육정보에 의한 증강현실 콘텐츠를 제공하는 식물재배 시스템 은 모바일 애플리케이션(APP)에 통신 네트워크로 연결되는 판매서버를 더 포함하며, 상기 시스템 서버 는 모바일 애플리케이션(APP)에서 식물 씨앗 구매 및 DB에 정보를 저장하는 기능을 더 포함한다. 한편, 사용자가 판매서버를 통해 씨앗을 구매하면, QR코드가 그려진 AR 카드, 식물씨앗이 심어진 배지가 함께 포장된 패키지 발송하여 사용자에게 전달된다. 사용자는 패키지 수령 후, 상기 AR 카드에 포함된 QR코드를 이용하여 사용자 모바일 단말에 식물재배 시스 템의 모바일 애플리케이션(APP)을 실행할 수 있다. 시스템 서버는 구매 정보와 일치하는지 확인 후 식물재배 데이터베이스부에 있는 해당 식물 정보에 사용자 정보를 업데이트한다. 또한, 본 발명의 일 실시 예에 따른 작물의 생육정보에 의한 증강현실 콘텐츠를 제공하는 식물재배 시스템 은 모바일 애플리케이션(APP)에 통신 네트워크로 연결되는 커뮤니티 서버를 더 포함하며, 상기 커뮤니티 서버는 사용자들의 교류 및 대화의 플랫폼을 제공할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 시스템 서버의 구성 예를 도시한 것이다. 도 2를 참조하면 본 발명의 일 실시 예에 따른 시스템 서버는 사용자별로 식물 재배 이미지를 저장하는 카 메라 데이터 저장부, 사용자별 장비 정보를 저장하는 디바이스 데이터베이스, 상기 카메라 데이터 저 장부에 저장되는 식물 재배 이미지 및 상기 식물재배장치로부터 전송되는 재배 환경 정보로부터 현재 식물상태를 판단하여 결과값을 식물재배 데이터베이스부로 전송하는 식물재배 분석부, 상기 식물재배 분석부로부터 수신된 결과값을 저장하고, 결과값이 특정범위를 벗어나 환경 조정이 필요할 경우, 식물재배 장치에 제어신호(motor 및 led에 대한 control 신호)를 전송하는 기능을 포함하는 식물재배 데이터베이스 부, 상기 카메라 데이터 저장부에 저장되는 식물 재배 이미지로부터 매칭되는 증강현실 캐릭터를 생 성하여 저장하는 AR 캐릭터 저장부, 사용자들의 정보가 저장되는 사용자 정보 데이터베이스 및 사용 자별로 구매정보가 저장되는 구매 데이터베이스를 포함한다. 본 발명의 일 실시 예에 따른 카메라 데이터 저장부는 식물재배장치의 상부에 설치된 카메라에서 일 정 시간(예: 4시간) 단위로 촬영한 식물 사진을 통신네트워크(wifi)를 통해 전송받아 저장된다. 본 발명의 일 실시 예에 따른 식물재배 분석부가 식물상태를 판단하는 것은 AI모델 학습에 의해 현재 식 물 상태를 판단하는 기능을 더 포함할 수 있다. 본 발명의 일 실시 예에 따른 AR 캐릭터 저장부는 각 식물 종류별 생장 주기별 및 크기별로 AR 캐릭터데이 터를 축적 관리하며, 사용자의 식물재배장치로부터 상기 카메라 데이터 저장부에 저장되는 식물 재배 이미지가 입력되면, 축적된 AR 캐릭터데이터로부터 입력된 식물재배의 생장 주기 및 식물 크기에 매칭되는 AR 캐릭터를 추출하여 사용자 요구에 따른 AR 캐릭터를 생성시킬 수 있다. 도 3은 본 발명의 일 실시 예에 따라 사용자 모바일 단말에서 실행되는 모바일 애플리케이션(APP)의 구성 예를 도시한 것이다. 본 발명의 일 실시 예에 따른 사용자 모바일 단말에서 실행되는 모바일 애플리케이션(APP)에는 현재 재배 되는 식물의 재배이미지를 출력하는 기능을 수행하는 카메라데이터 출력 앱, 상기 식물재배장치에 내 장된 동작모듈의 상태를 모니터링하고 제어하는 기능을 수행하는 동작모듈 감시 및 제어 앱, 상기 식물재 배장치에서 재배되는 식물의 재배상태에 대한 AR 캐릭터를 출력시키는 식물 재배모니터링 및 캐릭터 앱 을 포함한다. 또한, 상기 모바일 애플리케이션(APP)은 사용자 정보 및 식물구매정보를 제시하여 주는 유저 데이터부 및 요구되는 식물의 구매 및 구매정보를 제시하여 주는 식물 구매정보 앱을 더 포함할 수 있다. 예를 들면, 사용자 모바일 단말을 통해 식물 구매정보 앱에서 식물 씨앗을 구매하면, 시스템 서버는 구매정보 데이터베이스에 해당 구매에 대한 구매정보를 저장한다. 그리고, 판매서버 관리자는 QR코드 가 그려진 AR 카드, 식물씨앗이 심어진 배지가 함께 포장된 패키지를 사용자에게 발송한다. 사용자는 패키지 수 령 후 AR 카드를 모바일 단말기의 QR reader를 이용하여 실행하면, 시스템 서버는 상기 구매 정보와 일치하는지 확인 후 식물재배 DB에 있는 해당 식물 정보에 사용자 정보를 업데이트하여 관리한다. 도 4는 본 발명의 일 실시 예에 따라 사용자 모바일 단말에서 실행되는 모바일 애플리케이션(APP)에서 구 현되는 출력 화면의 예를 도시한 것이다. 도 4를 참조하면, 발명의 일 실시 예에 따라 사용자 모바일 단말에서 모바일 애플리케이션(APP)의 실행에 따라 (a) 현재 식물재배장치에서 재배되는 식물의 재배환경이 출력될 수 있다. 또한, (b) 사용자의 선택에 따라 선택된 식물의 세부 성장 정보가 출력될 수 있다. 도 4 (c)는 식물 구매정보 앱에서 식물을 구매하 는 출력 화면의 예를 도시한 것이다. 도 4(d)는 사용자가 커뮤니티 서버에 접속하여 대화하는 출력화면의 예를 도시한 것이다. 도 4(e)는 사용자가 AR 카드를 이용하여 AR 앱을 실행시키는 화면의 예를 도시한 것이다. 도 4(e)를 참조하면, 사용자가 AR 카드를 이용하여 사용자 모바일 단말의 QR 인식부에 AR카드의 QR 이미지 를 인식시키면, AR 앱이 실행된다. AR 앱에 의해 증강현실 캐릭터가 형성되는 방법은 다음과 같이 수행된다. 먼저, 사용자가 상기 AR 앱 상에서 AR 콘텐츠를 요청하는 단계가 수행된다. 다음은 시스템 서버는 상기 사용자의 AR 콘텐츠를 요청에 따라, AR 캐릭터 저장부로부터 상기 식물재 배장치에서 전송된 카메라에 의한 식물의 현재 이미지에 매칭되는 증강현실 캐릭터를 추출하여 사용자 모바일 단말로 전송하는 단계가 수행된다. 다음은, 증강현실 캐릭터를 전송받은 AR 앱의 프로세싱에 따라 사용자가 모바일 단말로 제시하는 장소에 대한 사용자 모바일 단말의 카메라의 촬영모드가 실행이 되는 단계가 수행된다. 이어서 제시된 장소를 촬영하는 카메라 이미지 상에 상기 전송된 증강현실 캐릭터가 같이 출력이 되는 단계가 수행된다. 따라서 사용자는 여행 중에 바닷가의 한 장소에서 현재 재배중인 식물의 증강현실 캐릭터를 같이 합성하여 볼 수 있고, 또한, 촬영 이미지에 재배중인 식물의 증강현실 캐릭터가 포함되어 촬영할 수 있는 효과를 가질 수 있 다. 도 5는 본 발명의 일 실시 예에 따라 사용자의 재배장소에 설치되는 식물재배장치의 예를 도시한 것이다. 본 발명의 일 실시 예에 따른 식물재배장치는 하부에 물 또는 양분이 함유된 물이 수용된 수조부; 상 기 수조부 상부에 식물을 접목하는 복수의 배지(141, 142, 143)가 배치된 배지부; 상기 배지부 상부에는 투명창이 형성되고 조명장치를 포함하여 식물이 성장할 수 있는 재배 공간이 형성된 재배부 및 상기 재배부 상부에는 제어기기들이 장착된 제어장치를 포함한다. 본 발명의 일 실시 예에 따른 식물재배장치는 수경 재배 방식을 택하고 있으며, 배지(141, 142, 143)에 식 물 씨앗 또는 모종을 접목하고, 물 또는 양분이 함유된 물을 하부로부터 스펀지를 포함하는 다공성 패드를 통하 여 공급하게 되며, 재배 작물이 자연적으로 생육에 필요한 물을 흡수할 수 있도록 할 수 있다. 도 6, 7은 본 발명의 일 실시 예에 따라 사용자의 재배장소에 설치되는 식물재배장치의 제어장치의 예를 도시한 것이다. 도 6, 7을 참조하면, 본 발명의 일 실시 예에 따른 식물재배장치의 제어장치는, 제어상태를 출력하는 디스플레이부, 각 부를 동작시키고 제어하는 프로세서가 내장된 MCU 제어부, 식물의 재배상태를 일정 시간 간격(예: 4시간)으로 촬영하는 카메라부, 상기 수조부에 물을 공급 및 순환시키는 워터 펌프 , 상기 재배부의 환기 기능을 제어하는 환기부 및 센싱부(151, 152, 153)를 포함한다. 또한, 본 발명의 일 실시 예에 따른 식물재배장치의 제어장치는 상기 MCU 제어부에 제어신호를 송, 수신하고, 상기 센싱부의 센싱신호 및 상기 제어기기들의 동작상태를 모니터링하기 위한 신호를 송수신하는 IoT 통신 모듈을 더 포함한다. 본 발명의 일 실시 예에 따른 디스플레이부는 IoT 통신 모듈의 와이파이 연결 상태 표시, 시스템 서버 연결상태 표시, 센서값 상태 표시, 모터 작동여부 및 속도 표시, LED 작동상태 표시 및 카메라 작동 화면 표시 등을 포함하여 출력하도록 제어된다. 또한, 본 발명의 일 실시 예에 따른 식물재배장치의 제어장치는 상기 MCU 제어부에 제어신호를 송, 수신하고, 상기 센싱부의 센싱신호 및 상기 제어기기들의 동작상태를 모니터링하기 위한 신호 및 제어신호 를 송수신하는 IoT 통신 모듈을 더 포함한다. 또한, 제어장치는 상기 재배부 내부의 온도를 조절하여주는 온풍기 및 냉풍기, 습도를 조절하여주는 건조기 및 가습기를 더 포함할 수 있다. 상기 센싱부는 상기 수조부의 수위를 측정하는 수위 측정부, 상기 재배부의 온도 및 습도를 측 정하는 온, 습도 측정부, 일조량 및 광량을 측정하는 광측정부를 포함한다. 본 발명의 일 실시 예에 따르면, 센싱부에서 센싱된 신호는 MCU 제어부 및 IoT 통신 모듈을 실시간(또는 1초 단 위)으로 시스템서버로 데이터 전송하며, 시스템서버는 이를 시간 단위로 축적 저장한다. 사용자 단말기에서는 사용자 애플리케이션을 통해 시스템서버의 식물재배 데이터베이스부의 값을 조 회하여 실시간 센서값을 확인할 수 있다. 본 발명의 일 실시 예에 따른 식물재배시스템의 시스템서버는 식물재배장치에 내장되어 있는 센 서와 IoT 통신 모듈을 통해 작물의 재배 상태를 모니터링하고, 온도, 습도, 양액을 포함하는 재배환경의 설정범 위가 벗어난 경우에는 내장된 제어기기들을 IoT 통신모듈을 통해 원격으로 제어하도록 프로그램된다. 또한, 재배환경의 설정범위가 벗어난 경우 및 이상 상태에는 사용자의 모바일 단말기로 이상 상태에 대한 정보 를 전송하여, 사용자가 인식하고, 조치를 취할 수 있도록 함으로써 최적의 재배 환경을 구축하는 데 필요한 시간과 노력, 번거로움을 최소화하여 누구나 손쉽게 재배가 가능하도록 할 수 있다. 예를 들면, 사용자는 물이 모자라는 것으로 센싱이 된 경우, 사용자의 모바일 애플리케이션을 통해 워터 펌프 가 작동하도록 제어신호를 작동시키면, 급수 펌프 작동 요청에 따라 시스템서버는 기기 데이터베이스 에서 워터 펌프 field 값을 업데이트하고, 네트워크를 통해 식물재배장치의 MCU 제어부로 제어신호를 보내어 워터펌프의 모터 드라이브를 동작시켜서 급수를 수행할 수 있다. 또한, 본 발명의 일 실시 예에 따른 식물재배장치는 내부에 채광을 위한 복수의 LED를 구비하여, LED 점등 개수, LED 점등 배열, LED 점등 시간 등을 제어하여 식물재배장치 본체 상에서 설정된 범위에서 일조량을 조절할 수 있다. 또한, IoT 통신모듈을 통하여 시스템서버 및 사용자 애플리케이선에 의해 사용자 단말기 에서 LED 조명의 밝기와 시간을 조절하는 기능을 수행할 수 있다. 예를 들면, 사용자의 모바일 애플리케이션을 통해 LED 컨트롤 On/Off, 밝기, 색깔 지정 등을 통해 전송하면, 시 스템서버는 기기 데이터베이스에서 LED field값 업데이트하고, 네트워크를 통해 식물재배장치의 MCU 제어부로 제어신호를 보내어 LED 장치를 제어신호에 따라 동작시켜서 조명 빛의 변화를 수행할 수 있 다. 본 발명의 일 실시 예에 따르면, 스마트팜으로 구성된 식물재배장치에 내장되어 있는 센서를 통해 작물의 재배 상태를 모니터링하고, 내장된 동작 모듈을 IoT 기술을 통해 원격으로 제어함으로써 최적의 재배 환경을 구축하 는 데 필요한 시간과 노력, 번거로움을 최소화하여 누구나 손쉽게 재배가 가능한 효과가 있다. 또한, 단순히 작물의 성장에 관여하는 것뿐만 아니라, 작물 생육 상태에 따른 AR 컨텐츠를 제공하고 서로 공유 할 수 있도록 플랫폼을 구현함으로써, 작물 재배에 대한 긍정적인 이미지를 키워주고, 생장 체험의 즐거움이 배 가될 수 있다. 또한, 물 재배를 통해 식물의 성장 과정을 지켜보고, 직접 기른 작물을 수확하여 식탁에 올리는 일련의 과정을 통해, 아이들의 성취감과 자존감 향상에 도움이 되고, 음식의 소중함을 깨닫게 하는 좋은 교구가 될 수 있다. 또한, 신종 코로나바이러스 감염증으로 외출이 자유롭지 못하고 집에서 보내는 시간이 길어지면서 생기게 된 우 울증을 완화시켜주고, 공간을 사용하는 사용자에게 정서적 안정감을 가져다 주는 플렌테리어 실현이 가능한 효 과를 가질 수 있다."}
{"patent_id": "10-2022-0134057", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 작물의 생육정보에 의한 증강현실 콘텐츠를 제공하는 식물재배 시스템의 구성을 도시한 것이다. 도 2는 본 발명의 일 실시 예에 따른 시스템 서버의 구성 예를 도시한 것이다. 도 3은 본 발명의 일 실시 예에 따라 사용자 모바일 단말에서 실행되는 모바일 애플리케이션(APP)의 구성 예를 도시한 것이다. 도 4는 본 발명의 일 실시 예에 따라 사용자 모바일 단말에서 실행되는 모바일 애플리케이션(APP)에서 구 현되는 출력 화면의 예를 도시한 것이다.도 5는 본 발명의 일 실시 예에 따라 사용자의 재배장소에 설치되는 식물재배장치의 예를 도시한 것이다. 도 6, 7은 본 발명의 일 실시 예에 따라 사용자의 재배장소에 설치되는 식물재배장치의 제어장치의 예를 도시한 것이다."}
