{"patent_id": "10-2023-0107549", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0124869", "출원번호": "10-2023-0107549", "발명의 명칭": "인공지능을 이용한 사용자 참여형 인식 플랫폼에서시설물 설치 가능 지점 판별 방법 및 그 장", "출원인": "주식회사 키센스", "발명자": "김희원"}}
{"patent_id": "10-2023-0107549", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 객체 인식 기반의 시설물 설치 가능 지점 판별 방법에 있어서,대상 지역의 항공사진 또는 위성 사진을 분석하여 상기 항공사진 또는 위성 사진에 포함된 건물들 각각의 옥상과 지붕을 검출하는 단계;상기 검출된 옥상과 지붕 중 시설물이 설치된 옥상과 지붕을 식별함으로써, 상기 시설물이 없는 옥상과 지붕을식별하는 단계; 및상기 식별된 시설물이 없는 옥상과 지붕에 대한 정보에 기초하여 미리 설정된 특정 시설물이 설치 가능한 지점을 판별하는 단계미리 학습된 학습 모델을 갖는 인공지능을 이용하여 상기 옥상과 지붕에 설치 가능한 시설물의 종류를 판별하는단계;상기 옥상과 지붕이 속하는 지역이 속하는 환경 정보에 기초하여 상기 설치 가능한 시설물이 상기 옥상과 지붕에 우선적으로 설치되어야 하는지와 관련된 우선 순위를 결정하는 단계를 포함하는 시설물 설치 가능 지점 판별 방법."}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 객체인식 기반으로 항공사진 분석을 이용한 시설물 설치 가능 지점 판별 방법 및 그 장치가 개시된다. 본 발명의 일 실시예에 따른 시설물 설치 가능 지점 판별 방법은 인공지능 객체 인식 기반의 시설물 설치 가능 지점 판별 방법에 있어서, 대상 지역의 항공사진을 분석하여 상기 항공사진에 포함된 건물들 각각의 옥상과 지붕 을 검출하는 단계; 상기 검출된 옥상과 지붕 중 시설물이 설치된 옥상과 지붕을 식별함으로써, 상기 시설물이 없 는 옥상과 지붕을 식별하는 단계; 및 상기 식별된 시설물이 없는 옥상과 지붕에 대한 정보에 기초하여 미리 설정 된 특정 시설물이 설치 가능한 지점을 판별하는 단계를 포함한다."}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 항공사진 분석을 이용한 시설물 설치 가능 지점을 판별하는 기술에 관한 것으로, 보다 구체적으로는 인공지능 객체인식 기반으로 항공사진 분석을 이용하여 건물들 각각 또는 대지에 설치된 시설물을 식별하고, 이 를 통해 시설물이 설치 가능한 지점을 판별할 수 있는 시설물 설치 가능 지점 판별 방법 및 그 장치에 관한 것 이다."}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 지리정보시스템(GIS; Geographic Information System)이란 공간에 관련된 문제를 해결하기 위하여 지리자료를 이용하고 관리하는 컴퓨터 기반의 시스템을 의미한다. 1960년대 초반 GIS가 처음 개발되었을 때만 하더라도 GIS는 단지 지도 자료를 처리하기 위한 컴퓨터 기반의 프로그램에 지나지 않았다. 그러나 오늘날 GIS 는 그 자체로 중요한 학문 연구 분야의 하나로 자리 잡고 있을 뿐만 아니라, 최신 정보기술과 결합하면서 사회 각 부문에 활발히 적용되고 있다. GIS의 기본적인 특성은 공간적인, 즉 지리적 공간 상에서 객체들의 위치와 관련된 속성정보를 다룰 수 있다는 것이다. 지도는 공간적으로 분포하는 객체들의 위치 및 속성을 나타내는 가장 효율적인 방법이다. 따라서 GIS 구축에 있어서 가장 기초적인 자료는 수치지도(digital map)이다. 수치지도는 고전적인 종이지도와 달리, 측량 지도, 항공사진, 위성영상 등에 의하여 얻어진 각종 지형 자료들을 해석하고 수치 편집하여 색인화한 것이라 할 수 있다. 수치지도의 구축 과정은 다음과 같이 여러 과정을 거쳐서 완성되게 된다. 먼저 종이지도가 디지타이징 (digitizing)이나 스캐닝(scanning)을 거쳐 수치지도의 형태가 된 후, 각종 입력 오차를 수정하기 위한 절차를 거친다. 이어서 좌표 변환을 통해 사용자의 목적에 맞도록 실제 좌표계로 변환을 거친 후, 공간 객체 간의 상호 위치성과 연관성을 파악하기 위한 위상 구조를 정립하게 된다. 이후 위상 구조의 정립을 거친 수치지도에 각각 의 도형자료와 관련된 속성자료를 입력시키게 된다. 이렇게 제작된 수치지도는 종이지도에 비해 빠르고 정확한 지도검색을 가능하게 하고, 정보관리와 활용성 면에 서 뛰어나 각종 계획수립과 의사결정을 보다 효과적으로 지원할 수 있도록 한다."}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은, 인공지능 객체인식 기반으로 항공사진 분석을 이용하여 건물들 각각 또는 대지에 설치된 시설물을 식별하고, 이를 통해 시설물이 설치 가능한 지점을 판별할 수 있는 시설물 설치 가능 지점 판별 방법 및 그 장치를 제공한다."}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 시설물 설치 가능 지점 판별 방법은 인공지능 객체 인식 기반의 시설물 설치 가능 지점 판별 방법에 있어서, 대상 지역의 항공사진을 분석하여 상기 항공사진에 포함된 건물들 각각의 옥상과 지 붕을 검출하는 단계; 상기 검출된 옥상과 지붕 중 시설물이 설치된 옥상과 지붕을 식별함으로써, 상기 시설물이 없는 옥상과 지붕을 식별하는 단계; 및 상기 식별된 시설물이 없는 옥상과 지붕에 대한 정보에 기초하여 미리 설정된 특정 시설물이 설치 가능한 지점을 판별하는 단계를 포함한다. 상기 옥상과 지붕을 검출하는 단계는 상기 대상 지역의 항공사진을 분석하여 미리 설정된 대상 건물을 검출하는 단계; 상기 검출된 대상 건물을 제외한 나머지 부분을 제거하는 단계; 및 상기 검출된 대상 건물 각각에서 옥상 과 지붕을 검출하는 단계를 포함할 수 있다. 상기 제거하는 단계는 미리 설정된 세그멘테이션(segmentation) 기법을 이용하여 상기 나머지 부분을 제거할 수 있다. 나아가, 본 발명의 일 실시예에 따른 시설물 설치 가능 지점 판별 방법은 상기 식별된 시설물이 설치된 옥상과 지붕에 대하여, 상기 설치된 시설물의 종류를 분류하는 단계를 더 포함할 수 있다. 상기 판별하는 단계는 상기 식별된 시설물이 없는 옥상과 지붕의 평평함과 경사도에 기초하여 옥상과 지붕의 종 류를 분류하고, 상기 분류된 옥상과 지붕의 종류에 기초하여 상기 특정 시설물의 종류에 따른 설치 가능한 지점 을 판별할 수 있다. 본 발명의 일 실시예에 따른 시설물 설치 가능 지점 판별 장치는 인공지능 객체 인식 기반의 시설물 설치 가능 지점 판별 장치에 있어서, 대상 지역의 항공사진을 분석하여 상기 항공사진에 포함된 건물들 각각의 옥상과 지 붕을 검출하는 검출부; 상기 검출된 옥상과 지붕 중 시설물이 설치된 옥상과 지붕을 식별함으로써, 상기 시설물 이 없는 옥상과 지붕을 식별하는 식별부; 및 상기 식별된 시설물이 없는 옥상과 지붕에 대한 정보에 기초하여 미리 설정된 특정 시설물이 설치 가능한 지점을 판별하는 판별부를 포함한다. 상기 검출부는 상기 대상 지역의 항공사진을 분석하여 미리 설정된 대상 건물을 검출하고, 상기 검출된 대상 건 물을 제외한 나머지 부분을 제거함으로써, 상기 검출된 대상 건물 각각에서 옥상과 지붕을 검출할 수 있다. 상기 검출부는 미리 설정된 세그멘테이션(segmentation) 기법을 이용하여 상기 나머지 부분을 제거할 수 있다. 나아가, 본 발명의 일 실시예에 따른 시설물 설치 가능 지점 판별 장치는 상기 식별된 시설물이 설치된 옥상과 지붕에 대하여, 상기 설치된 시설물의 종류를 분류하는 분류부를 더 포함할 수 있다. 상기 분류부는 상기 식별된 시설물이 없는 옥상과 지붕의 평평함과 경사도에 기초하여 옥상과 지붕의 종류를 분 류하고, 상기 판별부는 상기 분류된 옥상과 지붕의 종류에 기초하여 상기 특정 시설물의 종류에 따른 설치 가능 한 지점을 판별할 수 있다."}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 인공지능 객체인식 기반으로 항공사진 분석을 이용하여 건물들 각각의 옥상/지붕 공간 또는 대지에 설치된 시설물을 식별하고, 이를 통해 시설물이 설치 가능한 지점을 판별할 수 있다. 따라서, 본 발명은 건물의 불법 증개축 여부를 용이하게 판별할 수 있고, 옥상 공간 등에 방치된 시설물 또는 폐기물을 파악하여 도시 환경 개선에 기여할 수 있다. 기존에 건물 옥상과 지붕 공간의 시설물 설치 가능 여부는 직접 방문하여 확인하거나 항공사진을 수작업으로 분 석하는 방법이 사용되어 비용이 증가하는 단점이 있지만, 본 발명은 인공지능 객체인식 기반으로 항공사진을 분 석하여 시설물 설치 가능 지점을 판별할 수 있기 때문에 시설물 실태 파악을 위한 비용을 줄일 수 잇다. 이러한 본 발명은 특정 시설물이 설치 가능한 지점과 특정 시설물이 설치된 지점을 식별할 수 있기 때문에 특정 시설물 예를 들어, 태양광 발전 시설물, 공기 정화 시설, 옥상 녹지 공간 등에 대한 설치 실태 파악, 옥상 환경 실태 파악과 설치 가능한 지점을 파악하고, 이러한 정보를 관공서와 특정 민간업체 등에 제공할 수 있다."}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하"}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며, 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다 른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적 으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하 게 해석되지 않는다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예들을 보다 상세하게 설명하고자 한다. 도면 상의 동일한 구성요소에 대해서는 동일한 참조 부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 건물 옥상/지붕 공간의 용도는 공공데이터로 제공되지 않으며, 건물의 등기부 등본 등의 정보를 조회해야 하며, 건물의 각 부분의 사용 용도를 명확하게 알 수 없다. 본 발명의 실시예들은, 인공지능 객체인식 기반으로 항공사진 분석을 이용하여 건물들 각각의 옥상/지붕 공간 또는 대지에 설치된 시설물을 식별하고, 이를 통해 시설물이 설치 가능한 지점을 판별함으로써, 이미 설치된 시 설물의 종류, 특정 시설물의 종류에 따라 설치 가능한 지점에 대한 정보 등을 제공할 수 있다. 이 때, 본 발명은 항공사진 분석을 통해 이미 설치된 시설물을 식별하는 과정, 식별된 시설물의 종류를 분류하 는 과정과 시설물이 설치되지 않은 건물의 옥상과 지붕에 대하여 평평함과 경사도를 기반으로 옥상과 건물의 종 류를 분류하는 등의 과정을 인공지능 객체인식 기반으로 수행할 수 있다. 즉, 본 발명은 미리 설정된 트레이닝 데이터세트를 이용하여 인공지능을 트레이닝함으로써, 시설물을 식별하거나 설치된 시설물의 종류를 분류하거나 옥상과 건물의 종류를 분류하는 각각의 학습 모델 또는 통합된 학습 모델을 생성할 수 있으며, 이렇게 생성된학습 모델은 항공사진 분석을 통해 도출되는 결과물을 이용하여 갱신될 수도 있고, 추가로 수집된 트레이닝 데 이터세트를 이용하여 갱신될 수도 있다. 인공지능은 컨볼루션 뉴럴 네트워크(CNN), 딥 러닝 뉴럴 네트워크(DNN) 등과 같은 뉴럴 네트워크에 의해 구현될 수 있으며, 이러한 내용은 본 발명의 기술 분야에 종사하는 당업자에게 있어서 자명하기에 이에 대한 상세한 설명은 생략한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 객체인식 기반의 시설물 설치 가능 지점 판별 방법에 대한 동작 흐름도를 나타낸 것으로, 본 발명의 방법에 대한 알고리즘이 설치된 장치에 의해 수행될 수 있다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 시설물 설치 가능 지점 판별 방법은 조사 대상 지역의 항공사진 을 분석하여 항공사진에 포함된 건물들 각각의 옥상과 지붕을 검출한다(S110). 여기서, 단계 S110은 사용자 또는 관리자로부터 조사 대상 지역의 좌표의 위도와 경도를 입력받음으로써, 조사 대상 지역이 설정되고, 이렇게 설정된 조사 대상 지역에 대한 항공사진을 데이터베이스로부터 받아와서 항공사 진을 인공지능 객체인식 기반으로 분석하여 항공사진에 포함된 특정 건물들 예를 들어, 미리 설정된 대상 건물 들 각각의 옥상과 지붕을 검출할 수 있다. 여기서, 단계 S110은 화면에 표시된 지도 데이터에서 조사 대상 지역을 사용자 또는 관리자의 입력에 의해 드래 그함으로써, 조사 대상 지역이 설정될 수도 있다. 본 발명에서 조사 대상 지역의 항공사진은 특정 서버의 데이터베이스로부터 조사 대상 지역만을 다운로드한 항 공사진일 수도 있고, 본 발명의 방법을 제공하는 장치에 미리 다운로드되어 저장된 항공사진 중에서 조사 대상 지역에 해당하는 항공사진을 검색한 항공사진일 수도 있다. 단계 S110에서의 대상 건물들은 가정용 건물, 상업용 건물, 일정 크기 이상의 건물 등을 포함할 수 있으며, 이 러한 대상 건물들은 이 기술을 제공하는 사업자에 의해 결정되거나 대상 건물들을 설정할 수 있는 항목의 선택 을 통하여 결정될 수 있다. 이 때, 단계 S110은 항공사진의 위도와 경도에 따른 건물의 목적과 사용 용도 그리 고 가정용인지 상업용인지 등의 정보가 저장된 데이터베이스로부터 지붕과 옥상이 검출된 건물에 대한 정보를 검색함으로써, 해당 건물이 본 발명에서 대상이 되는 건물인지 판단할 수 있으며, 이를 통해 원하는 건물의 옥 상과 지붕만을 검출할 수 있다. 물론, 본 발명은 상황에 따라 이러한 건물의 용도나 목적 등을 고려하지 않고, 일정 크기 이상의 옥상과 지붕을 검출할 수도 있다. 즉, 단계 S110은 조사 대상 지역의 항공사진을 분석하여 미리 설정된 대상 건물들을 검출하고, 검출된 대상 건 물을 제외한 나머지 부분 예를 들어, 도로, 주차장, 하천 등을 포함하는 건물이 아닌 부분을 미리 설정된 세그 멘테이션(segmentation) 기법을 이용하여 제거하며, 이러한 부분이 제거된 항공사진의 건물들 각각에서 옥상과 지붕을 검출한다. 이 때, 단계 S110은 미리 학습된 학습 모델의 인공지능을 이용하여 조사 대상 지역의 항공사진에서 건물들 각각 을 인식하고, 인식된 건물들 각각에서 객체 검출 기법을 이용하여 지붕과 옥상을 검출할 수 있다. 단계 S110에 의해 조사 대상 지역의 건물들 각각에 대한 옥상과 지붕이 검출되면, 검출된 옥상과 지붕 중 시설 물 예를 들어, 태양광 발전 시설물, 공기 정화 시설, 옥상 녹지 공간 등의 시설물이 설치된 옥상과 지붕을 식별 하고, 이를 통해 시설물이 없는 옥상과 지붕을 식별한다(S120). 여기서, 단계 S120은 미리 학습된 학습 모델의 인공지능을 이용하여 검출된 옥상과 지붕에서 미리 설정된 시설 물의 설치 여부를 식별할 수 있다. 예를 들어, 단계 S120은 도 2에 도시된 바와 같이, 인공지능을 이용하여 사 각형 박스로 표시된 상태의 식별된 지붕과 옥상에서 시설물이 설치된 옥상과 지붕 즉, 주장창이 설치된 파란색 박스와 태양광 시설물이 설치된 빨간색 박스의 지붕과 옥상을 식별함으로써, 시설물이 설치된 옥상과 지붕을 식 별하고, 이를 통해 시설물이 설치되지 않은 옥상과 지붕 즉, 초록색 박스의 옥상과 지붕을 식별할 수 있다. 비 록, 도 2에서 경사가 있는 지붕과 옥상에 대해서는 식별하지 않았지만, 필요에 따라 경사도를 가지는 지붕이더 라도 시설물의 설치가 가능한 것으로 판단되는 지붕에 대해서는, 시설물이 설치 가능한 지붕과 옥상으로 식별할 수도 있다. 단계 S120에 의해 시설물이 설치된 건물의 옥상과 지붕 그리고 시설물이 설치되지 않은 건물의 옥상과 지붕이 식별되면, 시설물이 설치된 건물의 옥상과 지붕에 대하여 설치된 시설물의 종류를 분류하고, 설치된 시설물이 없는 건물의 옥상과 지붕에 대한 정보에 기초하여 미리 설정된 특정 시설물 예를 들어, 태양광 발전 시설물, 공기 정화 시설, 옥상 녹지 공간 등이 설치 가능한 지점 즉, 옥상과 지붕을 판별한다(S130, S140). 예컨대, 도 2에 도시된 바와 같이, 단계 S120은 시설물이 설치된 파란색 박스와 빨간색 박스의 옥상과 지붕에 대해서 주차장 또는 태양광 시설물이 설치된 옥상과 지붕으로 분류하고, 초록색 박스의 옥상과 지붕 각각에 대 하여 태양광 시설물이 설치 가능한 지점인지 주차장이 설치 가능한 지점인지 공기 정화 시설이 설치 가능한 지 점인지 옥상 녹지 공간으로 사용할 수 있는 지점인지를 판별할 수 있다. 예를 들어, 단계 S120은 시설물이 설치 가능한 지점으로 판별된 옥상과 지붕 중에서 경사도를 가진 옥상과 지붕에 대해서는 태양광 시설물이 설치 가능 한 지점으로 판별할 수 있고, 평평하면서 일정 크기 이상의 공간을 가지는 옥상에 대해서는 태양광 시설물, 주 차장, 공기 정화 시설과 옥상 녹지 공간 중 적어도 하나의 시설물을 설치 가능한 지점을 판별할 수 있다. 여기 서, 단계 S130은 미리 학습된 학습 모델의 인공지능을 이용하여 설치된 시설물의 종류를 분류할 수도 있고, 단 계 S140 또한 미리 학습된 학습 모델의 인공지능을 이용하여 설치 가능한 지점 각각에 대하여 어떤 시설물이 설 치 가능한 지점인지 판별할 수 있다. 단계 S130과 S140에 의해 설치된 시설물의 종류가 분류되고, 특정 시설물 각각에 대하여 설치 가능한 지점이 판 별되면, 이미 설치된 시설물의 종류와 특정 시설물 각각에 대하여 설치 가능한 지점에 대한 정보를 제공한다 (S150). 이 때, 단계 S150은 조사 대상 지역에 설치된 시설물 각각에 대한 정보와 특정 시설물 각각에 대하여 설치 가능 한 지점에 대한 정보를 특정 파일 형태로 제공할 수도 있으며, 제공되는 정보는 설치된 시설물 각각에 대한 주 소 정보, 건물 정보, 위도와 경도 정보 중 적어도 하나를 포함할 수 있고, 특정 시설물 각각에 대하여 설치 가 능한 지점에 대한 정보는 주소 정보, 건물 정보, 지붕 또는 옥상 정보(예를 들어, 평평함, 일정 경사를 가짐, 옥상 또는 지붕에 대한 정보 등을 포함), 위도와 경도 정보 중 적어도 하나를 포함할 수 있다. 나아가, 본 발명의 실시예에 따른 방법은 조사 대상 지역에 대한 환경 정보 예를 들어, 날씨 정보, 습도 정보, 건물별 전력 사용량 정보, 일산화탄소, 이산화탄소, 미세먼지 정보 등을 고려하여 설치하고자 하는 시설물의 우 선 순위를 결정할 수도 있고, 설치 가능한 한 지점에서 설치 가능한 시설물이 다양한 경우 해당 지점에서의 설 치 가능한 시설물들 각각에 대한 우선 순위를 결정할 수도 있다. 여기서, 본 발명의 방법은 설치 가능한 시설물 들 각각에 대한 우선 순위를 주변 건물에 설치된 시설물에 대한 정보와 상술한 환경 정보 그리고 해당 건물에 대한 정보를 고려하여 결정할 수 있다. 물론, 본 발명의 방법은 상술한 정보로 한정하지 않으며, 고려할 수 있 는 모든 정보를 이용할 수 있다. 이와 같이, 본 발명의 일 실시예에 따른 방법은 인공지능 객체인식 기반으로 항공사진 분석을 이용하여 건물들 각각의 옥상/지붕 공간 또는 대지에 설치된 시설물을 식별하고, 이를 통해 시설물이 설치 가능한 지점을 판별할 수 있기 때문에 건물의 불법 증개축 여부를 용이하게 판별할 수 있고, 옥상 공간 등에 방치된 시설물 또는 폐기 물을 파악하여 도시 환경 개선에 기여할 수 있다. 또한, 본 발명의 일 실시예에 따른 방법은 인공지능 객체인식 기반으로 항공사진을 분석하여 시설물 설치 가능 지점을 판별할 수 있기 때문에 시설물 실태 파악을 위한 비용을 줄일 수 잇다. 이러한 본 발명은 특정 시설물이 설치 가능한 지점과 특정 시설물이 설치된 지점을 식별할 수 있기 때문에 특정 시설물 예를 들어, 태양광 발전 시설물, 공기 정화 시설, 옥상 녹지 공간 등에 대한 설치 실태 파악, 옥상 환경 실태 파악과 설치 가능한 지점을 파악하고, 이러한 정보를 관공서와 특정 민간업체 등에 제공할 수 있다. 즉, 본 발명의 방법은 조사 대상 지역에 대하여 옥상과 지붕에 설치된 시설물의 종류와 해당 시설물이 설치된 건물 에 대한 정보를 제공할 수도 있고, 조상 대상 지역에서 특정 시설물의 종류에 따라 설치할 수 있는 지점에 대한 정보 예를 들어, 주소 정보와 건물 정보 등을 제공할 수도 있다. 도 3은 본 발명의 일 실시예에 따른 인공지능 객체인식 기반의 시설물 설치 가능 지점 판별 장치에 대한 구성을 나타낸 것으로, 도 1과 도 2의 방법을 수행하는 장치에 대한 개념적인 구성을 나타낸 것이다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 장치는 수신부, 검출부, 식별부, 분류부 , 판별부와 데이터베이스(DB)를 포함한다. DB는 본 발명을 수행하기 위한 데이터를 저장하는 수단으로, 항공사진, 지도 데이터, 인공지능 객체인식 기반 알고리즘, 학습 모델, 설치 가능 지점 판별에 따른 데이터 제공 알고리즘 등과 같은 다양한 데이터를 저장할 수 있으며, 이러한 데이터 뿐만 아니라 본 발명을 수행하는데 있어서 필요로 하는 모든 종류의 데이터를 저 장할 수 있다. 여기서, DB는 유무선 네트워크를 통해 저장된 데이터가 갱신될 수도 있으며, 데이터 갱신 주기는 본 발명 의 기술을 제공하는 사업자 또는 개인에 의해 결정될 수 있다. 수신부는 사용자 또는 관리자로부터 조사 대상 지역의 좌표의 위도와 경도를 입력받음으로써, 조사 대상 지역을 설정한다. 여기서, 수신부는 지도 데이터에서 조사 대상 지역을 사용자 또는 관리자의 입력에 의해 드래그함으로써, 조사 대상 지역을 설정할 수도 있다. 검출부는 조사 대상 지역의 항공사진을 분석하여 항공사진에 포함된 건물들 각각의 옥상과 지붕을 검출한 다. 이 때, 검출부는 조사 대상 지역에 대한 항공사진을 데이터베이스로부터 받아와서 항공사진을 인공지능 객 체인식 기반으로 분석하여 항공사진에 포함된 특정 건물들 각각의 옥상과 지붕을 검출할 수 있다. 나아가, 검출부는 항공사진의 위도와 경도에 따른 건물의 목적과 사용 용도 그리고 가정용인지 상업용인지 등의 정보가 저장된 데이터베이스로부터 지붕과 옥상이 검출된 건물에 대한 정보를 검색함으로써, 해당 건물이 본 발명에서 대상이 되는 건물 예를 들어, 가정용 건물, 상업용 건물, 일정 크기 이상의 건물 등인지 판단할 수 있으며, 이를 통해 원하는 건물의 옥상과 지붕만을 검출할 수 있다. 이 때, 검출부는 조사 대상 지역의 항공사진을 분석하여 미리 설정된 대상 건물들을 검출하고, 검출된 대 상 건물을 제외한 나머지 부분 예를 들어, 도로, 주차장, 하천 등을 포함하는 건물이 아닌 부분을 미리 설정된 세그멘테이션(segmentation) 기법을 이용하여 제거하며, 이러한 부분이 제거된 항공사진의 건물들 각각에서 옥 상과 지붕을 검출할 수 있다. 식별부는 검출된 옥상과 지붕 중 시설물 예를 들어, 태양광 발전 시설물, 공기 정화 시설, 옥상 녹지 공간 등의 시설물이 설치된 옥상과 지붕을 식별하고, 이를 통해 시설물이 없는 옥상과 지붕을 식별한다. 분류부는 시설물이 설치된 건물의 옥상과 지붕 그리고 시설물이 설치되지 않은 건물의 옥상과 지붕이 식별 되면, 시설물이 설치된 건물의 옥상과 지붕에 대하여 설치된 시설물의 종류를 분류한다. 이 때, 분류부는 시설물이 설치되지 않은 건물의 옥상과 지붕의 평평함과 경사도에 기초하여 옥상과 지붕 의 종류 예를 들어, 평평한 지붕과 경사진 지붕 등을 분류할 수도 있다. 판별부는 설치된 시설물이 없는 건물의 옥상과 지붕에 대한 정보에 기초하여 미리 설정된 특정 시설물 예 를 들어, 태양광 발전 시설물, 공기 정화 시설, 옥상 녹지 공간 등이 설치 가능한 지점 즉, 옥상과 지붕을 판별 한다. 이 때, 판별부는 분류부에 의해 분류된 옥상과 지붕의 종류에 기초하여 특정 시설물의 종류에 따른 설치 가능한 지점을 판별할 수도 있다. 비록, 도 3의 장치에서 그 설명이 생략되었더라도, 도 3을 구성하는 각 구성 수단은 도 1 내지 도 2의 방법에서 설명한 모든 내용을 포함할 수 있으며, 이는 이 기술 분야에 종사하는 당업자에게 있어서 자명하다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 컨트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로"}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크 로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이 터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다."}
{"patent_id": "10-2023-0107549", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형 태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성 될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2023-0107549", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 객체인식 기반의 시설물 설치 가능 지점 판별 방법에 대한 동작 흐름도를 나타낸 것이다. 도 2는 본 발명의 방법을 설명하기 위한 일 예시도를 나타낸 것이다. 도 3은 본 발명의 일 실시예에 따른 인공지능 객체인식 기반의 시설물 설치 가능 지점 판별 장치에 대한 구성을 나타낸 것이다."}
