{"patent_id": "10-2021-0186788", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0097364", "출원번호": "10-2021-0186788", "발명의 명칭": "클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 시스템 및 방법", "출원인": "한국전자기술연구원", "발명자": "강정훈"}}
{"patent_id": "10-2021-0186788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 클라이언트 서버; 및하나의 클라우드 서버를 포함하되,상기 각각의 클라이언트 서버는,상기 클라우드 서버의 모델 파라미터 요청 명령에 의거 각각의 모델 파라미터를 생성하여 전달하고,상기 클라우드 서버는 수집된 모델 파라미터를 룩 업 테이블 형태로 등록하는 제어부를 더 포함하는 것을 특징으로 하는 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 시스템."}
{"patent_id": "10-2021-0186788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 모델 파라미터는, 데이터 프로파일 정보 및 각 클라이언트 서버의 고유 식별정보 UUID(Universally Unique Identifier)를 포함하고,상기 데이터 프로파일 정보는 데이터 유형, 속성, 및 특성을 포함하는 것을 특징으로 하는 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 시스템."}
{"patent_id": "10-2021-0186788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제어부는,수신된 센서 데이터의 유형과 기 등록된 모델 파라미터와 매칭되는 복수의 클라이언트 서버 중 적어도 하나의클라이언트 서버로 수신된 센서 데이터를 전달하도록 구비되는 것을 특징으로 하는 클라우드 서버와 연동하는복수의 클라이언트 서버의 통합 학습 시스템."}
{"patent_id": "10-2021-0186788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 제어부는,상기 적어도 하나의 클라이언트 서버의 학습 결과값을 기 등록된 모델 파라미터와 매칭되는 신경망에 전달하도록 구비되는 것을 특징으로 하는 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 시스템."}
{"patent_id": "10-2021-0186788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 제어부는,상기 신경망의 연산 결과값인 특징값을 상기 적어도 하나의 클라이언트 서버로 전달하고,상기 적어도 하나의 클라이언트 서버 각각은,수신된 특징값으로 학습 모델을 갱신한 다음 갱신된 학습 모델로 입력된 센서 데이터에 대해 학습 결과값을 도출하도록 구비되는 것을 특징으로 하는 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 시스템."}
{"patent_id": "10-2021-0186788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항의 클라우드 서버와 연동하는 복수의 클라이언트 서버 간에 통합 학습 방법에 있어서,클라우드 서버의 모델 파라미터 요청 명령에 응답하여 각각의 클라이언트 서버에서 모델 파라미터를 생성한 다음 생성된 각각의 클라이언트 서버의 모델 파라미터를 클라우드 서버로 전달하는 단계; 및공개특허 10-2023-0097364-3-상기 클라우드 서버에서 수신된 각 클라이언트 서버의 모델 파라미터를 룩업 테이블값으로 등록하는 단계를 포함하는 것을 특징으로 하는 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 방법."}
{"patent_id": "10-2021-0186788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 모델 파라미터를 등록하는 단계 이후에 수신된 센서 데이터의 유형과 기 등록된 모델 파라미터와 매칭되는 복수의 클라이언트 서버 중 적어도 하나의클라이언트 서버로 수신된 센서 데이터를 전달하는 단계; 및상기 적어도 하나의 클라이언트 서버 각각에서, 수신된 센서 데이터를 기 구축된 학습 모델에 의거 훈련하여 학습 결과값을 도출하는 단계를 더 포함하는 것을 특징으로 하는 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 방법."}
{"patent_id": "10-2021-0186788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 학습 결과 도출 단계 이후에 상기 클라우드 서버에서, 상기 적어도 하나의 클라이언트 서버의 학습 결과값을 기 등록된 모델 파라미터와 매칭되는 신경망에 전달하는 단계; 및상기 클라우드 서버의 신경망에서, 수신된 학습 결과값에 대해 훈련하여 연산 결과값인 특징값을 도출하는 단계를 더 포함하는 것을 특징으로 하는 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 방법."}
{"patent_id": "10-2021-0186788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 특징값을 도출하는 단계 이후에 상기 신경망의 연산 결과값인 특징값을 상기 적어도 하나의 클라이언트 서버로 전달하는 단계; 및상기 적어도 하나의 클라이언트 서버 각각에서, 수신된 특징값으로 학습 모델을 갱신한 다음 갱신된 학습 모델로 입력된 센서 데이터에 대해 학습 결과값을 도출하는 단계를 더 포함하는 것을 특징으로 하는 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 방법."}
{"patent_id": "10-2021-0186788", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 기술은 클라우드 서버와 연동하는 클라이언트 서버의 통합 학습 시스템 및 방법이 개시된다. 이러한 본 기술 에 대한 구체적인 구현 예는 클라우드 서버에서 수신된 센서 데이터의 특성을 확인한 다음 데이터 표준화 및 전 처리를 수행하고 기 등록된 모델 파라미터와 매칭되는 클라이언트 서버의 학습 모델과 클라우드 서버의 신경망을 매칭시켜 클라이언트 서버의 학습 모델을 훈련함에 따라 복수의 클라이언트 서버의 각각 학습 모델을 각각 통합 훈련할 수 있고, 클라이언트 서버의 자원 사용량 및 처리량을 감소함에 따라, 학습모델을 경량의 디바이스에 범 용적으로 적용할 수 있다."}
{"patent_id": "10-2021-0186788", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 시스템 및 방법에 관한 것으로서, 더 욱 상세하게는 수신된 센서 데이터의 특성을 확인한 다음 데이터 표준화 및 전처리를 수행하고 기 등록된 모델 파라미터와 매칭되는 클라이언트 서버의 학습 모델과 클라우드 서버의 신경망을 매칭시켜 클라이언트 서버의 학 습 모델을 훈련함에 따라 다수의 학습 모델을 통합 훈련할 수 있도록 한 기술에 관한 것이다."}
{"patent_id": "10-2021-0186788", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 인공지능 학습 시스템은 클라이언트 서버의 센서 데이터를 중앙 서버에서 수집한 다음 수신된 중앙 서버 의 모델을 학습시켜 의사 결정 결과를 클라이언트 서버에 전달하는 방식이다. 그러나, 이러한 기존의 인공지능 학습 시스템은 센서 데이터의 개인 정보 및 보안 그리고 통신 상의 보안 문제 가 발생하였다. 이에 최근에는 FL(Federated Learning) 기술에 대한 연구가 활발하게 이루어지고 있으나, 기존의 FL 기술은 동 일한 형태 및 데이터의 특성이 일관된 단일 분야, 예를 들어 모바일 폰의 검색어 데이터, 병원의 환자 진료 데 이터 등에 주로 사용되고 있으나 다양한 종류의 센서에 의한 다양한 특성의 데이터를 학습 모델로 훈련하여야 하는 제조 및 산업현장의 스마트 팩토리에 적용하는데 한계에 도달하였다. 또한 중앙 서버와 클라이언트 서버 간의 불필요한 데이터 송수신, 데이터 전처리 및 학습 등의 사용되는 클라이 언트 서버의 자원 사용량(점유량) 및 처리양의 증가가 야기된다.이에 본 출원인은 클라우드 서버에서 수신된 센서 데이터의 특성을 확인한 다음 데이터 표준화 및 전처리를 수 행하고 기 등록된 모델 파라미터와 매칭되는 클라이언트 서버의 학습 모델과 클라우드 서버의 신경망을 매칭시 켜 클라이언트 서버의 학습 모델을 훈련함에 따라 다수의 학습 모델을 통합 훈련하는 방안을 제안하고자 한다."}
{"patent_id": "10-2021-0186788", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 클라우드 서버에서 수신된 센서 데이터의 특성을 확인한 다음 데이터 표준화 및 전처리를 수 행하고 기 등록된 모델 파라미터와 매칭되는 클라이언트 서버의 학습 모델과 클라우드 서버의 신경망을 매칭시 켜 클라이언트 서버의 학습 모델을 훈련함에 따라 복수의 클라이언트 서버의 각각 학습 모델을 각각 통합 훈련 하기 위한 것이다. 또한 본 발명은 클라이언트 서버의 자원 사용량 및 처리량을 감소함에 따라, 학습모델을 경량의 디바이스에 범 용적으로 적용할 수 있다. 본 발명의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있으며, 본 발명의 실시예에 의해 보다 분명하게 알게 될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2021-0186788", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 시스템은, 복수의 클라이언트 서버; 및 하나의 클라우드 서버를 포함하되, 상기 각각의 클라이언트 서버는, 상기 클라우드 서버의 모델 파라미터 요청 명령에 의거 각각의 모델 파라미터를 생성하여 전달하고, 상기 클라우드 서버는 수집된 모델 파라미터를 룩 업 테이블 형태로 등록하는 제어부를 더 포함하는 것을 일 특징으로 한다. 바람직하게 상기 모델 파라미터는, 데이터 프로파일 정보 및 각 클라이언트 서버의 고유 식별정보 UUID(Universally Unique Identifier)를 포함하 고, 상기 데이터 프로파일 정보는 데이터 유형, 속성, 및 특성을 포함할 수 있다. 바람직하게 상기 제어부는, 수신된 센서 데이터의 유형과 기 등록된 모델 파라미터와 매칭되는 복수의 클라이언트 서버 중 적어도 하나의 클라이언트 서버로 수신된 센서 데이터를 전달하도록 구비될 수 있다. 바람직하게 상기 제어부는, 상기 적어도 하나의 클라이언트 서버의 학습 결과값을 기 등록된 모델 파라미터와 매칭되는 신경망에 전달하도 록 구비될 수 있다. 바람직하게 상기 제어부는, 상기 신경망의 연산 결과값인 특징값을 상기 적어도 하나의 클라이언트 서버로 전달하고, 상기 적어도 하나의 클라이언트 서버 각각은, 수신된 특징값으로 학습 모델을 갱신한 다음 갱신된 학습 모델로 입력된 센서 데이터에 대해 학습 결과값을 도 출하도록 구비될 수 있다. 본 발명의 다른 실시예에 따른 클라우드 서버와 연동하는 클라이언트 서버의 통합 학습 방법은, 클라우드 서버의 모델 파라미터 요청 명령에 응답하여 각각의 클라이언트 서버에서 모델 파라미터를 생성한 다 음 생성된 각각의 클라이언트 서버의 모델 파라미터를 클라우드 서버로 전달하는 단계; 및 상기 클라우드 서버에서 수신된 각 클라이언트 서버의 모델 파라미터를 룩업 테이블값으로 등록하는 단계를 포 함하는 것을 일 특징으로 한다. 바람직하게 상기 모델 파라미터를 등록하는 단계 이후에 수신된 센서 데이터의 유형과 기 등록된 모델 파라미터와 매칭되는 복수의 클라이언트 서버 중 적어도 하나의 클라이언트 서버로 수신된 센서 데이터를 전달하는 단계; 상기 적어도 하나의 클라이언트 서버 각각에서, 수신된 센서 데이터를 기 구축된 학습 모델에 의거 훈련하여 학 습 결과값을 도출하는 단계를 더 포함할 수 있다. 바람직하게 상기 학습 결과 도출 단계 이후에 상기 클라우드 서버에서, 상기 적어도 하나의 클라이언트 서버의 학습 결과값을 기 등록된 모델 파라미터와 매 칭되는 신경망에 전달하는 단계; 및 상기 클라우드 서버의 신경망에서, 수신된 학습 결과값에 대해 훈련하여 연산 결과값인 특징값을 도출하는 단계 를 더 포함할 수 있다. 바람직하게 상기 특징값을 도출하는 단계 이후에 상기 신경망의 연산 결과값인 특징값을 상기 적어도 하나의 클라이언트 서버로 전달하는 단계; 및 상기 적어도 하나의 클라이언트 서버 각각에서, 수신된 특징값으로 학습 모델을 갱신한 다음 갱신된 학습 모델 로 입력된 센서 데이터에 대해 학습 결과값을 도출하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2021-0186788", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시 예에 따르면, 클라우드 서버에서 수신된 센서 데이터의 특성을 확인한 다음 데이터 표준화 및 전처리를 수행하고 기 등록된 모델 파라미터와 매칭되는 클라이언트 서버의 학습 모델과 클라우드 서버의 신경망을 매칭 시켜 복수의 클라이언트 서버의 각각의 학습 모델을 통합 훈련할 수 있다. 이에 클라이언트 서버의 자원 사용량 및 처리량을 감소함에 따라, 학습모델을 경량의 디바이스에 범용적으로 적 용할 수 있다."}
{"patent_id": "10-2021-0186788", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "실시예들에 대한 특정한 구조적 또는 기능적 설명들은 단지 예시를 위한 목적으로 개시된 것으로서, 다양한 형 태로 변경되어 실시될 수 있다. 따라서, 실시예들은 특정한 개시형태로 한정되는 것이 아니며, 본 명세서의 범 위는 기술적 사상에 포함되는 변경, 균등물, 또는 대체물을 포함한다. 제1 또는 제2 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이런 용어들은 하나의 구성요소 를 다른 구성요소로부터 구별하는 목적으로만 해석되어야 한다. 예를 들어, 제1 구성요소는 제2 구성요소로 명 명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다.단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 설명된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함 으로 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들 을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 해당 기술분 야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해 석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 일 실시예는 복수의 클라이언트 서버와 하나의 클라우드 서버로 구현되고, 스마트 팩토리의 복수의 센서 데이터 를 기 등록된 모델 파라미터와 매칭되는 적어도 하나의 클라이언트 서버에 전달하고, 적어도 하나의 클라이언트 의 학습값을 할당된 클라이언트 서버와 매칭되는 클라우드 서버의 신경망에 전달하며, 할당된 신경망의 특징 결 과값을 할당된 적어도 하나의 클라이언트 서버로 전달하고, 전달받은 특징 결과값으로 적어도 하나의 클라이언 트 서버의 학습 모델을 최적의 상태로 훈련함에 따라 학습에 대한 부하를 줄일 수 있다. 여기서, 복수 개는 적 어도 둘 이상의 자연수로 정의될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예를 설명함으로써, 본 발명을 상세히 설명한다. 도 1은 일 실시예의 통합 학습 시스템의 구성도이고, 도 2는 도 1의 제어부의 모델 파라미터의 구성도이다. 도 1 및 도 2를 참조하면, 일 실시예의 통합 학습 시스템은, 기 등록된 모델 파라미터와 매칭되는 복수의 클라 이언트 서버 중 적어도 하나의 클라이언트 서버에 스마트 팩토리의 센서 데이터를 할당하고, 할당된 적어도 하 나의 클라이언트 서버 각각의 학습 모델에 의거한 학습 결과값을 기 등록된 모델 파라미터와 매칭되는 클라우드 서버의 신경망에 할당하며, 클라우드 서버의 신경망의 연산 결과값을 할당된 적어도 하나의 클라이언트 서버로 전달하고, 이에 전달받은 연산 결과값으로 복수의 클라이언트 서버의 학습 모델을 업데이트한 후 훈련하는 구성 을 갖추며, 이에 시스템은, 복수의 클라이언트 서버(11 ~ 1N), 및 클라우드 서버를 포함할 수 있다. 그리고 클라우드 서버는 제어부를 더 포함하며, 제어부는 기 등록된 모델 파라미터와 매칭되는 클라이언트 서버와 클라우드 서버의 신경망을 각각 할당한다. 제어부는 인터페이스를 더 포함할 수 있고, 제어부와 인터페이스는 하나의 장치로 구현될 수 있고 도 1에 도시된 바와 같이 별개의 장치로 구현될 수 있으며 이에 한정하지 아니한다. 일 례에서, 통합 학습 시스템은, 도 1에 도시된 바와 같이, 제어부와 클라우드 서버가 전선 또는 커 넥터 등을 통해 직접 연결되는 장치일 수 있으며, 제어부 및 클라우드 서버를 모두 하나의 장치에 구 비하는 구조로 형성될 수 있다. 또한, 다른 일 실시예에서, 통합 학습 시스템은 도 1에 도시된 바와 같이, 제어부와 클라우드 서버를 분리시켜 구성하고, 분리된 이들 구성간 무선통신 또는 유선통신을 통해 연결되는 구조로 형성될 수 있으며, 이 를 한정하지는 아니한다. 제어부는 복수의 클라이언트 서버(11 ~ 1N) 각각으로부터 전달받은 모델 파라미터를 룩업 테이블 형태로 등록한다. 여기서 모델 파라미터는, 데이터 프로파일 정보와 고유 식별정보 UUID를 포함하고, 데이터 프로파일 정보는 각 클라이언트 서버의 데이터의 특성, 속성 및 유형을 포함하고, 클라이언트 서버의 고유 식별정보는 각 클라이언트 서버에 부여된 범용의 식별번호이다. 예를 들어 도 2를 참조하면, 스마트 팩터리의 센서 데이터의 유형 data_type_1, 클라이언트 서버 A의 고유 식별 정보 UUID 0x84F2에 대해, 제어부은 을 룩업 테이블 형태로 등록한다. 또한, 스마트 팩터리의 센서 데이터의 유형 data_type_2이고, 클라이언트 서버 (model_A)의 고유 식별정보 UUID 0xA42E이면, 제어부의 룩 업 테이블은 으로 등록된다. 여기서 룩 업 테이블은 클라이언트 서버가 추가되거나 클라이언트 서버의 학습모델이 업데이트될 때 마다 갱신 될 수 있다.한편 제어부는 기 등록된 모델 파라미터와 스마트 팩토리의 센서 데이터의 유형과 매칭되는 복수의 클라이 언트 서버(11 ~ 1N)중 적어도 하나의 클라이언트 서버로 수신된 스마트 팩토리의 센서 데이터를 전달한다. 복수의 클라이언트 서버(11 ~ 1N) 각각은 각각의 센서 데이터를 입력으로 하고 훈련하여 학습 결과값(WA1, WA2, WB1, WB2,…)을 출력하는 각각의 학습모델로 구현된다. 예를 들어, 제어부에 의해 할당된 클라이언트 서버 (11, 12)는 센서 데이터를 입력으로 하고 학습 결과값을 출력으로 하는 각각의 학습 모델의 훈련 결과로 학습 결과값(WA1, WA2)을 추정한다. 이러한 입력된 센서 데이터에 대해 전처리하고 전처리된 센서 데이터에 대해 훈련 하는 일련의 과정은 일반적인 입력 신호와 출력 신호에 대해 훈련하는 과정과 동일 또는 유사하다. 여기서, 센 서 데이터는 스마트 팩토리의 온도, 습도 등의 다양한 데이터 중 하나 일 수 있다. 이러한 제어부로부터 전달받은 스마트 팩토리의 센서 데이터를 수신한 적어도 하나의 클라이언트 서버(11, 12) 각각은 수신된 스마트 팩토리의 센서 데이터에 대해 전처리하고 전처리된 결과를 입력으로 훈련하여 학습 결과값(WA1, WA2)을 도출한다. 그리고, 도출된 학습 결과값(WA1, WA2)은 제어부에 의거 할당된 클라우드 서버의 신경망 model A로 전 달된다. 이때 제어부는 기 등록된 모델 파라미터와 매칭되는 신경망으로 학습 결과값을 할당한다. 여기서 클라우드 서버는 복수의 신경망으로 구비된다. 복수의 신경망은 제어부에 의거 할당되고 이에 할당된 신경망은 도출된 학습 결과값(WA1, WA2, WB1, WB2)들을 수신하고 수신된 학습 결과값(WA1, WA2)들을 연산하 여 연산 결과값(avg(WA), avg(WB)…)을 출력한다. 여기서, 각각의 신경망은 CNN(Convolution Neural Network), bagging, boosting, random forest 등 기계 학습 알고리즘으로 구현된다. 이에 각각의 신경망은 갱신된 연산 결과값(avg(WA))인 특징값을 제어부에 의거 할당된 적어도 하나의 클라 이언트 서버(11, 12)로 각각 전달하고, 적어도 하나의 클라이언트 서버는 갱신된 특징값으로 기 구축된 학습모 델을 업데이트한 다음 업데이트된 특징값으로 학습 모델을 훈련하는 과정을 반복 수행한다. 일 례로, 도 1에 도시된 바와 같이, 적어도 하나의 클라이언트 서버(11, 12)의 학습 결과값(WA1, WA2)은 제어부 에 의거 할당된 클라우드 서버의 신경망 model A에 전달되고, 클라우드 서버의 신경망 model A 는 학습 결과값(WA1, WA2)들을 평균하여 연산 결과값인 특징값을 출력하고, 출력된 특징값 (avg(WA))을 적어도 하 나의 클라이언트 서버(11, 12)에 각각 전달할 수 있다. 이러한 평균값(avg(WA))을 수신한 적어도 하나의 클라이언트 서버(11, 12) 각각은 수신된 특징값 (avg(WA))으로 업데이트한 다음 업데이트된 특징값(avg(WA))으로 학습 모델을 훈련한다. 도 3을 참조하여 통합 학습 시스템의 처리 알고리즘을 보다 구체적으로 설명한다. 단계(S1)에서, 제어부는 복수의 클라이언트 서버(11~1N)로 모델 파라미터 요청 명령을 전달하고, 단계(S 2)에서, 복수의 클라이언트 서버(11~1N)는 복수의 클라이언트 서버(11 ~ 1N) 각각에 대한 데이터 프로파일 정보 및 각 복수의 클라이언트 서버(11 ~ 1N)의 고유 식별정보 UUID를 포함하는 모델 파라미터를 생성하여 제어부 로 전달한다. 단계(S3)에서, 제어부는 수신된 복수의 클라이언트 서버(11 ~ 1N)각각에 대한 모델 파라미터를 룩업 테이 블 형태로 등록한다. 이때 단계(S4 내지 S6)에서, 제어부는 수신된 모델 파라미터의 고유 식별정보 UUID를 토대로 새로운 클라 이언트 서버인 경우 클라이언트 서버 UUID를 초기 모델로 할당하고, 새로운 클라이언트 서버가 아닌 경우 기 존 재하는 모델에 할당한다. 단계(S7)에서, 제어부는 복수의 클라이언트 서버(11 ~ 1N) 각각에 대한 모델 파라미터를 각각의 클라이언 트 서버(11 ~ 1N)로 전달한다. 이에 단계(S8, S9)에서 클라이언트 서버(11 ~ 1N) 각각의 훈련 모델에 의거 입력 된 센서 데이터에 대해 훈련한 다음 훈련 결과값 및 클라이언트 서버의 UUID를 제어부로 전달한다. 그리고 단계(S10)에서, 제어부는 수신된 클라이언트 서버의 UUID와 매칭되는 클라우드 서버의 신경망 을 할당하고, 이에 클라이언트 서버(11 ~ 1N)중 적어도 하나의 클라이언트 서버의 UUID와 매칭되는 적어도 하나 의 클라이언트 서버의 특징값은 할당된 클라우드 서버의 신경망으로 전달된다.단계(S10, S11)에서, 할당된 신경망은 수신된 특징값을 평균한 다음 평균 특징값을 제어부에 의거 할당된 적어도 하나의 클라이언트 서버로 전달되며, 단계(S12, S13)에서, 각각의 클라이언트 서버 밀 클라우드 서버의 신경망은 수신된 평균 특징값으로 학습 모델을 업데이트한 다음 업데이트된 연산 결과값인 평균 특징값으로 학 습 모델을 훈련한다. 일 실시예는 클라이언트 서버에서 수신된 센서 데이터의 특성을 확인한 다음 데이터 표준화 및 전처리를 수행하 고 기 등록된 모델 파라미터와 매칭되는 클라이언트 서버의 학습 모델과 클라우드 서버의 신경망을 매칭시켜 클 라이언트 서버의 학습 모델을 훈련함에 따라 다수의 학습 모델을 통합 훈련할 수 있으며, 클라이언트 서버의 자 원 사용량 및 처리량을 감소함에 따라, 학습모델을 경량의 디바이스에 범용적으로 적용할 수 있다."}
{"patent_id": "10-2021-0186788", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 산업상 이용가능성 클라우드 서버에서 수신된 센서 데이터의 특성을 확인한 다음 데이터 표준화 및 전처리를 수행하고 기 등록된 모델 파라미터와 매칭되는 클라이언트 서버의 학습 모델과 클라우드 서버의 신경망을 매칭시켜 클라이언트 서버 의 학습 모델을 훈련함에 따라 복수의 클라이언트 서버의 각각 학습 모델을 각각 통합 훈련할 수 있고, 클라이 언트 서버의 자원 사용량 및 처리량을 감소함에 따라, 학습모델을 경량의 디바이스에 범용적으로 적용할 수 있 는 클라우드 서버와 연동하는 복수의 클라이언트 서버의 통합 학습 시스템 및 방법에 대한 운용의 정확성 및 신 뢰도 측면, 더 나아가 성능 효율 면에 매우 큰 진보를 가져올 수 있으며, 다양한 분야에서의 적용할 수 있고, 스마트 팩토리의 핵심 기술을 확보함에 따라 관련 산업분야의 환경 모니터링을 적극적으로 활용할 수 있고, IoT 센서 및 디바이스의 시판 또는 영업의 가능성이 충분할 뿐만 아니라 현실적으로 명백하게 실시할 수 있는 정도 이므로 산업상 이용가능성이 있는 발명이다."}
{"patent_id": "10-2021-0186788", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에서 첨부되는 다음의 도면들은 본 발명의 바람직한 실시 예를 예시하는 것이며, 후술하는 발명의 상 세한 설명과 함께 본 발명의 기술사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재 된 사항에만 한정되어 해석되어서는 아니된다. 도 1은 일 실시예에 따른 통합 학습 시스템의 구성도이다. 도 2는 도 1의 모델 파라미터의 구성도이다. 도 3은 일 실시예의 통합 학습 과정을 보인 전체 흐름도이다."}
