{"patent_id": "10-2022-0156333", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0074353", "출원번호": "10-2022-0156333", "발명의 명칭": "인공지능 기반 병상 배정을 수행하는 전자 장치, 제어 방법, 및 컴퓨터 프로그램", "출원인": "한림대학교 산학협력단", "발명자": "이윤재"}}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "중환자실에 대한 배치 여부를 결정하도록 학습된 인공지능 모델을 포함하는 메모리; 및적어도 한 명의 환자의 환자 정보를 상기 인공지능 모델로 입력하여, 상기 인공지능 모델의 출력을 바탕으로 상기 환자의 중환자실에 대한 배치 여부를 식별하는 프로세서;를 포함하고,상기 환자 정보는,개인정보, 신체 정보, 병력 정보, 진료 정보, 및 생체 정보 중 적어도 하나를 포함하는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 진료 정보는,환자의 내원 시점에 획득된, 시간 경과에 따라 사용된 적어도 하나의 장비명, 사용된 장비 별 설정 값, 환자에게 시행된 적어도 하나의 시술명, 시술명 별 시술 시점, 환자에게 사용된 적어도 하나의 약물명, 및 약물명 별농도 중 적어도 하나를 포함하고,상기 생체 정보는,환자의 내원 시점에 획득된, 의식 수준, 시간 당 소변량, 생체징후에 대한 모니터링 값, 요 검사 정보, 혈액 검사 정보, 환자에게 적용된 적어도 하나의 식이 정보, 및 환자의 대변 정보 중 적어도 하나를 포함하되,환자의 내원 시점으로부터 발생된, 상기 모니터링 값, 상기 요 검사 정보, 및 상기 혈액 검사 정보 중 적어도하나에 대한 누적 데이터를 더 포함하는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 프로세서는,일반병실에 입원한 환자의 정보, 중환자실에 입원한 환자의 정보, 응급실에서 중환자실로 전실한 환자의 정보,중환자실에서 일반병실로 전실한 환자의 정보, 일반병실에서 중환자실로 전실한 환자의 정보, 내원하되 입원하지 않은 환자의 정보, 사망한 환자의 정보, 다른 병원으로 이송된 환자의 정보, 및 다른 병원에서 이송된 환자의 정보 중 적어도 하나를 학습 데이터로 획득하고,상기 학습 데이터를 바탕으로 상기 인공지능 모델을 훈련시키는, 전자 장치."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 프로세서는,상기 인공지능 모델의 출력을 바탕으로, 상기 환자 각각에 대해, 중환자실에 배치되는 제1 분류, 일반병실에 배치되는 제2 분류, 및 일반병실에 배치 예정인 제3 분류 중 어느 분류에 포함되는지 판단하는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,공개특허 10-2024-0074353-3-상기 프로세서는,상기 환자 중, 상기 제2 분류에 배치된 일반 환자가 식별되면, 일반병실의 잔여 병상 수 및 중환자실의 잔여 병상 수를 각각 획득하고,상기 일반병실의 잔여 병상 수를 바탕으로, 상기 일반 환자의 일반병실 배치여부를 판단하고,상기 일반 환자의 일반병실 배치가 가능한 경우, 상기 일반 환자를 일반병실에 배정하되, 상기 일반 환자의 일반병실 배치가 불가능한 경우, 상기 중환자실의 잔여 병상 수를 바탕으로, 상기 일반 환자의 중환자실 배치여부를 판단하고,상기 일반 환자의 중환자실 배치가 가능한 경우, 상기 일반 환자를 중환자실에 배정하되, 상기 일반 환자의 중환자실 배치가 불가능한 경우, 기 설정된 연계 병원 중 잔여 병상이 존재하는 적어도 하나의 병원을 식별하고,상기 식별된 병원 중 이송 비용이 가장 적은 적어도 하나의 제1 병원을 식별하고,상기 제1 병원이 복수인 경우, 상기 제1 병원 중, 이송 소요 시간이 가장 짧은 제2 병원을 식별하고,상기 제2 병원에 대해 상기 일반 환자를 배치하는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4 항에 있어서,상기 프로세서는,상기 환자 중, 상기 제1 분류에 배치된 제1 중환자가 식별되면, 중환자실의 잔여 병상 수를 획득하고,상기 중환자실의 잔여 병상 수를 바탕으로, 상기 제1 중환자의 중환자실 배치여부를 판단하고,상기 제1 중환자의 중환자실 배치가 가능한 경우, 상기 제1 중환자를 중환자실에 배정하되, 상기 제1 중환자의중환자실 배치가 불가능한 경우, 기 설정된 연계 병원 중 중환자실의 잔여 병상이 존재하는 적어도 하나의 병원을 식별하고,상기 식별된 병원 중 이송 소요 시간이 임계시간 미만인 제3 병원을 식별하여, 상기 제3 병원에 대해 상기 제1중환자를 배치하되, 상기 제3 병원이 미식별된 경우, 상기 제1 중환자를 응급실에 배정하고,상기 제1 중환자가 응급실에 배정된 경우, 중환자실에 대한 잔여 병상, 및 상기 제3 병원의 잔여 병상 각각이발생하는지 여부를 모니터링 하는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 프로세서는,상기 환자 중, 상기 제3 분류에 배치된 제2 중환자가 식별되면, 상기 중환자실의 잔여 병상 수를 바탕으로, 상기 제2 중환자의 중환자실 배치여부를 판단하고,상기 제2 중환자의 중환자실 배치가 가능한 경우, 상기 제2 중환자를 중환자실에 배정하되, 상기 제2 중환자의중환자실 배치가 불가능한 경우, 상기 환자 정보, 기 등록된 중환자실 및 응급실에 대한 인구 변동 이력, 기 등록된 상기 인구 변동 이력에 따른 환자 별 환자 정보, 및 기 등록된 상기 인구 변동 이력에 따른 환자 별 진료정보를 바탕으로, 상기 제2 중환자의 일반병실 배치까지의 예상 소요 시간을 획득하고,상기 예상 소요 시간이 임계 시간 미만인 경우, 상기 제2 중환자를 응급실에 배정하되, 상기 예상 소요 시간이임계 시간을 초과하는 경우, 상기 제3 병원을 식별하고,상기 제3 병원에 대해 상기 제2 중환자를 배치하되, 상기 제3 병원이 미식별된 경우, 상기 제2 중환자를 응급실에 배정하고,상기 제3 병원이 미식별되어 상기 제2 중환자가 응급실에 배정된 경우, 중환자실에 대한 잔여 병상, 및 상기 제3 병원의 잔여 병상 각각이 발생하는지 여부를 모니터링 하는 것을 특징으로 하는, 전자 장치.공개특허 10-2024-0074353-4-청구항 8 제1 항에 있어서,상기 전자 장치는,적어도 하나의 단말과 통신하여, 상기 환자 정보를 획득하는 통신부; 및사용자 명령을 바탕으로 상기 환자 정보를 획득하고, 적어도 하나의 정보를 사용자에게 제공하는 입출력부; 중적어도 하나를 더 포함하는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "전자 장치의 제어 방법에 있어서,상기 전자 장치가, 적어도 한 명의 환자의 환자 정보를, 중환자실에 대한 배치 여부를 결정하도록 기 학습된 인공지능 모델에 입력하는 단계;상기 전자 장치가, 상기 인공지능 모델의 출력을 획득하는 단계; 및상기 전자 장치가, 상기 출력을 바탕으로, 상기 환자 각각에 대해, 중환자실에 배치되는 제1 분류, 일반병실에배치되는 제2 분류, 및 일반병실에 배치 예정인 제3 분류 중 어느 분류에 포함되는지 판단하는 단계;를 포함하는, 전자 장치의 제어 방법."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 인공지능 모델은,일반병실에 입원한 환자의 정보, 중환자실에 입원한 환자의 정보, 응급실에서 중환자실로 전실한 환자의 정보,중환자실에서 일반병실로 전실한 환자의 정보, 일반병실에서 중환자실로 전실한 환자의 정보, 내원하되 입원하지 않은 환자의 정보, 사망한 환자의 정보, 다른 병원으로 이송된 환자의 정보, 및 다른 병원에서 이송된 환자의 정보 중 적어도 하나를 포함하는 학습 데이터를 바탕으로 학습되는 것을 특징으로 하는, 전자 장치의 제어방법."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "하드웨어인 컴퓨터와 결합되어, 제9 항의 방법을 수행할 수 있도록 컴퓨터에서 독출가능한 기록매체에 저장된컴퓨터 프로그램."}
{"patent_id": "10-2022-0156333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전자 장치의 제어 방법에 있어서,상기 전자 장치가, 일 환자의 환자 정보를, 중환자실에 대한 배치 여부를 결정하도록 기 학습된 인공지능 모델에 입력하는 단계;상기 전자 장치가, 상기 인공지능 모델의 출력을 획득하는 단계;상기 전자 장치가, 상기 출력을 바탕으로, 중환자실에 배치되는 제1 분류에 포함되는 제1 중환자, 일반병실에배치되는 제2 분류에 포함되는 일반 환자, 및 일반병실에 배치 예정인 제3 분류에 포함되는 제2 중환자 중 어느하나의 환자 종류로 상기 환자를 판단하는 단계;상기 전자 장치가, 상기 판단된 환자 종류, 중환자실의 잔여 병상 수, 및 일반병실의 잔여 병상수를 바탕으로,상기 환자를 일 병상에 배정하는 단계;를 포함하는, 전자 장치의 제어 방법."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 병상 배정을 수행하는 전자 장치, 제어 방법, 및 컴퓨터 프로그램에 관한 것으로, 특히, 전자 장치는, 중환자실에 대한 배치 여부를 결정하도록 학습된 인공지능 모델을 포함하는 메모리 및 적어 도 한 명의 환자의 환자 정보를 인공지능 모델로 입력하여, 인공지능 모델의 출력을 바탕으로 환자의 중환자실에 대한 배치 여부를 식별하는 프로세서를 포함한다."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 병상 배정을 수행하는 전자 장치, 제어 방법, 및 컴퓨터 프로그램에 관한 것으로, 상 세하게는, 내원한 환자의 병상(bed) 배정에 있어서, 환자를 중환자와 일반 환자로 구분하고, 중환자 중 중환자 실에서 일반병실로 전실 가능한 환자를 구분하는 기술이다."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "중환자실의 병상수, 중환자실의 환자 처치를 위한 주요 장비의 숫자는 한정되어 있으며, 응급센터로 내원하거나 일반병동에서 발생되는 중환자는 이 한정된 자원을 나눠서 사용해야만 하는 실정이다. 하지만, 이 한정된 자원은 항상 부족한 상태이며, 이로인해, 응급실에는 중환자를 장기 수용하기에 어려움이 많 음에도, 수 일씩 중환자들이 대기하는 일이 빈번하게 발생하는 문제점이 존재한다. 중환자가 응급실에 대기하는 시간은, 중환자의 치명률과 생존율에 영향을 미치지만, 현실적으로, 세계 곳곳에서, 중환자를 위한 병상을 포함하는 병원 내 한정적인 자원의 효율적인 사용이 어렵다는 문제가 존재하고, 이를 해결하기 위한 방안이 마련되지 않고 있다. 이러한 문제의 주된 원인은, 중환자실에 배정되지 않아도 되는 환자가 중환자실에 배정되는 것과, 환자가 중환 자실에서 나올 수 있는 상태임에도, 보호자 문제, 경제적 사정, 일반 병실 부족, 의료진의 판단 지연 등의 이유 로 일반병실로의 전실이 지연되는 것에 있다."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "한편, 상기의 배경기술로서 설명된 사항들은 본 발명의 배경에 대한 이해 증진을 위한 것일 뿐, 이 기술분야에 서 통상의 지식을 가진 자에게 이미 알려진 종래기술에 해당함을 인정하는 것으로 받아들여져서는 안 될 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2010-0051154호, 2010.05.17."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 일반병실에 입원한 환자의 정보, 중환자실에 입원한 환자의 정보, 응급실에 서 중환자실로 전실한 환자의 정보, 중환자실에서 일반병실로 전실한 환자의 정보, 일반병실에서 중환자실로 전 실한 환자의 정보, 내원하되 입원하지 않은 환자의 정보, 사망한 환자의 정보, 다른 병원으로 이송된 환자의 정 보, 및 다른 병원에서 이송된 환자의 정보에 의해 학습된 인공지능 모델을 통해 중환자실로 가야만 하는 환자와 그렇지 않은 환자를 분류하고, 중환자실에서 일반병실로 전실 가능한 환자를 분류하는 것이 가능한, 인공지능 기반 병상 배정을 수행하는 전자 장치, 제어 방법, 및 컴퓨터 프로그램을 제공하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 면에 따른 중환자실에 대한 배치 여부를 결정하도록 학습된 인공지 능 모델을 포함하는 메모리 및 적어도 한 명의 환자의 환자 정보를 인공지능 모델로 입력하여, 인공지능 모델의 출력을 바탕으로 환자의 중환자실에 대한 배치 여부를 식별하는 프로세서를 포함하고, 환자 정보는, 개인정보, 신체 정보, 병력 정보, 진료 정보, 및 생체 정보 중 적어도 하나를 포함하는 것을 특징으로 할 수 있다. 추가로, 진료 정보는, 환자의 내원 시점에 획득된, 시간 경과에 따라 사용된 적어도 하나의 장비명, 사용된 장 비 별 설정 값, 환자에게 시행된 적어도 하나의 시술명, 시술명 별 시술 시점, 환자에게 사용된 적어도 하나의 약물명, 및 약물명 별 농도 중 적어도 하나를 포함하고, 생체 정보는, 환자의 내원 시점에 획득된, 의식 수준, 시간 당 소변량, 생체징후에 대한 모니터링 값, 요 검사 정보, 혈액 검사 정보, 환자에게 적용된 적어도 하나의 식이 정보, 및 환자의 대변 정보 중 적어도 하나를 포함하되, 환자의 내원 시점으로부터 발생된, 모니터링 값, 요 검사 정보, 및 혈액 검사 정보 중 적어도 하나에 대한 누적 데이터를 더 포함하는 것을 특징으로 할 수있다. 추가로, 프로세서는, 일반병실에 입원한 환자의 정보, 중환자실에 입원한 환자의 정보, 응급실에서 중환자실로 전실한 환자의 정보, 중환자실에서 일반병실로 전실한 환자의 정보, 일반병실에서 중환자실로 전실한 환자의 정 보, 내원하되 입원하지 않은 환자의 정보, 사망한 환자의 정보, 다른 병원으로 이송된 환자의 정보, 및 다른 병 원에서 이송된 환자의 정보 중 적어도 하나를 학습 데이터로 획득하고, 학습 데이터를 바탕으로 인공지능 모델 을 훈련시킬 수 있다. 추가로, 프로세서는, 인공지능 모델의 출력을 바탕으로, 환자 각각에 대해, 중환자실에 배치되는 제1 분류, 일 반병실에 배치되는 제2 분류, 및 일반병실에 배치 예정인 제3 분류 중 어느 분류에 포함되는지 판단하는 것을 특징으로 할 수 있다. 추가로, 프로세서는, 환자 중, 제2 분류에 배치된 일반 환자가 식별되면, 일반병실의 잔여 병상 수 및 중환자실 의 잔여 병상 수를 각각 획득하고, 일반병실의 잔여 병상 수를 바탕으로, 일반 환자의 일반병실 배치여부를 판 단하고, 일반 환자의 일반병실 배치가 가능한 경우, 일반 환자를 일반병실에 배정하되, 일반 환자의 일반병실 배치가 불가능한 경우, 중환자실의 잔여 병상 수를 바탕으로, 일반 환자의 중환자실 배치여부를 판단하고, 일반 환자의 중환자실 배치가 가능한 경우, 일반 환자를 중환자실에 배정하되, 일반 환자의 중환자실 배치가 불가능 한 경우, 기 설정된 연계 병원 중 잔여 병상이 존재하는 적어도 하나의 병원을 식별하고, 식별된 병원 중 이송 비용이 가장 적은 적어도 하나의 제1 병원을 식별하고, 제1 병원이 복수인 경우, 제1 병원 중, 이송 소요 시간 이 가장 짧은 제2 병원을 식별하고, 제2 병원에 대해 일반 환자를 배치하는 것을 특징으로 할 수 있다. 추가로, 프로세서는, 환자 중, 제1 분류에 배치된 제1 중환자가 식별되면, 중환자실의 잔여 병상 수를 획득하고, 중환자실의 잔여 병상 수를 바탕으로, 제1 중환자의 중환자실 배치여부를 판단하고, 제1 중환자의 중 환자실 배치가 가능한 경우, 제1 중환자를 중환자실에 배정하되, 제1 중환자의 중환자실 배치가 불가능한 경우, 기 설정된 연계 병원 중 중환자실의 잔여 병상이 존재하는 적어도 하나의 병원을 식별하고, 식별된 병원 중 이 송 소요 시간이 임계시간 미만인 제3 병원을 식별하여, 제3 병원에 대해 제1 중환자를 배치하되, 제3 병원이 미 식별된 경우, 제1 중환자를 응급실에 배정하고, 제1 중환자가 응급실에 배정된 경우, 중환자실에 대한 잔여 병 상, 및 제3 병원의 잔여 병상 각각이 발생하는지 여부를 모니터링 하는 것을 특징으로 할 수 있다. 추가로, 프로세서는, 환자 중, 제3 분류에 배치된 제2 중환자가 식별되면, 중환자실의 잔여 병상 수를 바탕으로, 제2 중환자의 중환자실 배치여부를 판단하고, 제2 중환자의 중환자실 배치가 가능한 경우, 제2 중환 자를 중환자실에 배정하되, 제2 중환자의 중환자실 배치가 불가능한 경우, 환자 정보, 기 등록된 중환자실 및 응급실에 대한 인구 변동 이력, 기 등록된 인구 변동 이력에 따른 환자 별 환자 정보, 및 기 등록된 인구 변동 이력에 따른 환자 별 진료 정보를 바탕으로, 제2 중환자의 일반병실 배치까지의 예상 소요 시간을 획득하고, 예 상 소요 시간이 임계 시간 미만인 경우, 제2 중환자를 응급실에 배정하되, 예상 소요 시간이 임계 시간을 초과 하는 경우, 제3 병원을 식별하고, 제3 병원에 대해 제2 중환자를 배치하되, 제3 병원이 미식별된 경우, 제2 중 환자를 응급실에 배정하고, 제3 병원이 미식별되어 제2 중환자가 응급실에 배정된 경우, 중환자실에 대한 잔여 병상, 및 제3 병원의 잔여 병상 각각이 발생하는지 여부를 모니터링 하는 것을 특징으로 할 수 있다. 추가로, 전자 장치는, 적어도 하나의 단말과 통신하여, 환자 정보를 획득하는 통신부 및 사용자 명령을 바탕으 로 환자 정보를 획득하고, 적어도 하나의 정보를 사용자에게 제공하는 입출력부; 중 적어도 하나를 더 포함하는 것을 특징으로 할 수 있다. 본 발명의 전자 장치의 제어 방법에 있어서, 전자 장치가, 적어도 한 명의 환자의 환자 정보를, 중환자실에 대 한 배치 여부를 결정하도록 기 학습된 인공지능 모델에 입력하는 단계, 전자 장치가, 인공지능 모델의 출력을 획득하는 단계 및 전자 장치가, 출력을 바탕으로, 환자 각각에 대해, 중환자실에 배치되는 제1 분류, 일반병실 에 배치되는 제2 분류, 및 일반병실에 배치 예정인 제3 분류 중 어느 분류에 포함되는지 판단하는 단계를 포함 한다. 추가로, 인공지능 모델은, 일반병실에 입원한 환자의 정보, 중환자실에 입원한 환자의 정보, 응급실에서 중환자 실로 전실한 환자의 정보, 중환자실에서 일반병실로 전실한 환자의 정보, 일반병실에서 중환자실로 전실한 환자 의 정보, 내원하되 입원하지 않은 환자의 정보, 사망한 환자의 정보, 다른 병원으로 이송된 환자의 정보, 및 다 른 병원에서 이송된 환자의 정보 중 적어도 하나를 포함하는 학습 데이터를 바탕으로 학습되는 것을 특징으로 할 수 있다. 본 발명은, 하드웨어인 컴퓨터와 결합되어, 본 발명의 전자 장치의 제어 방법을 수행할 수 있도록 컴퓨터에서 독출가능한 기록매체에 저장된 컴퓨터 프로그램을 포함한다. 본 발명의 전자 장치의 제어 방법에 있어서, 전자 장치가, 일 환자의 환자 정보를, 중환자실에 대한 배치 여부 를 결정하도록 기 학습된 인공지능 모델에 입력하는 단계, 전자 장치가, 인공지능 모델의 출력을 획득하는 단계, 전자 장치가, 출력을 바탕으로, 중환자실에 배치되는 제1 분류에 포함되는 제1 중환자, 일반병실에 배치 되는 제2 분류에 포함되는 일반 환자, 및 일반병실에 배치 예정인 제3 분류에 포함되는 제2 중환자 중 어느 하 나의 환자 종류로 환자를 판단하는 단계, 전자 장치가, 판단된 환자 종류, 중환자실의 잔여 병상 수, 및 일반병 실의 잔여 병상수를 바탕으로, 환자를 일 병상에 배정하는 단계를 포함한다. 본 발명의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 인공지능 기반 병상 배정을 수행하는 전자 장치, 제어 방법, 및 컴퓨터 프로그램에 의하면, 중환자실 의 병상 배정 효율성 및 중환자실 운영의 효율성을 높임으로써, 원내 중(증)환자의 적극적인 수용 및 긍정적 치 료 효과를 높일 수 있다."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 명세서에서 사용되는 \"부\" 또는 “모듈”이라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소 를 의미하며, \"부\" 또는 “모듈”은 어떤 역할들을 수행한다. 그렇지만 \"부\" 또는 “모듈”은 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. \"부\" 또는 “모듈”은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수 도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\" 또는 “모 듈”은 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\" 또는 “모듈”들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\" 또는 “모듈”들로 결합되거나 추가적인 구성요소들과 \"부\" 또는 “모듈”들로 더 분리될 수 있다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소들과의 상관관계를 용이하게 기술하기 위 해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작시 구성 요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤 집을 경우, 다른 구성요소의 \"아래(below)\"또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓일 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성요 소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있다. 본 명세서에서, 컴퓨터는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로서 이해될 수 있다. 예 를 들어, 컴퓨터는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애 플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 도 1은 본 개시의 일 실시예에 따른 전자 장치 구성도이다. 도 1에 도시된 바와 같이, 전자 장치는, 중환자실에 대한 배치 여부를 결정하도록 학습된 인공지능 모델 을 포함하는 메모리 및 적어도 한 명의 환자의 환자 정보를 인공지능 모델로 입력하여, 인공지 능 모델의 출력을 바탕으로 환자의 중환자실에 대한 배치 여부를 식별하는 프로세서를 포함한다. 프로세서는 메모리와 연결되어 전자 장치의 전반적인 동작을 제어한다. 일 실시예로, 전자 장치는, 서버, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전 화기(mobile phone), 영상 전화기, 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 노트북 컴퓨터 (notebook computer), PDA(personal digital assistant), PMP(portable multimedia player), 웨어러블 장치 (wearable device) 중 적어도 하나를 포함할 수 있다. 한편, 메모리는 서버의 동작에 필요한 각종 프로그램 및 데이터를 저장할 수 있다. 메모리는 비 휘발성 메모리, 휘발성 메모리, 플래시메모리(flash-memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD) 등으로 구현될 수 있다. 프로세서는 메모리에 저장된 각종 프로그램을 이용하여 서버의 전반적인 동작을 제어할 수 있다. 프로세서는 RAM, ROM, 그래픽 처리부, 메인 CPU, 제1 내지 n 인터페이스 및 버스로 구성될 수 있다. 이때, RAM, ROM, 그래픽 처리부, 메인 CPU, 제1 내지 n 인터페이스 등은 버스를 통해 서로 연결될 수 있다. RAM은 O/S 및 어플리케이션 프로그램을 저장한다. 구체적으로, 서버가 부팅되면 O/S가 RAM에 저장되고, 사 용자가 선택한 각종 어플리케이션 데이터가 RAM에 저장될 수 있다. ROM에는 시스템 부팅을 위한 명령어 세트 등이 저장된다. 턴 온 명령이 입력되어 전원이 공급되면, 메인 CPU는 ROM에 저장된 명령어에 따라 메모리에 저장된 O/S를 RAM에 복사하고, O/S를 실행시켜 시스템을 부팅시킨다. 부팅이 완료되면, 메인 CPU는 메모리에 저장된 각종 어플리케이션 프로그램을 RAM에 복사하고, RAM에 복사된 어플리케이션 프로그램을 실행시켜 각종 동작을 수행한다. 그래픽 처리부는 연산부(미도시) 및 렌더링부(미도시)를 이용하여 아이템, 이미지, 텍스트 등과 같은 다양한 객 체를 포함하는 화면을 생성한다. 여기서, 연산부는 입력부로부터 수신된 제어 명령을 이용하여 화면의 레이아웃 에 따라 각 객체들이 표시될 좌표값, 형태, 크기, 컬러 등과 같은 속성값을 연산하는 구성일 수 있다. 그리고, 렌더링부는 연산부에서 연산한 속성값에 기초하여 객체를 포함하는 다양한 레이아웃의 화면을 생성하는 구성이 일 수 있다. 이러한 렌더링부에서 생성된 화면은 디스플레이의 디스플레이 영역 내에 표시될 수 있다. 메인 CPU는 메모리에 액세스하여, 메모리에 저장된 OS를 이용하여 부팅을 수행한다. 그리고, 메인 CPU는 메모리에 저장된 각종 프로그램, 컨텐츠, 데이터 등을 이용하여 다양한 동작을 수행한다. 제1 내지 n 인터페이스는 상술한 각종 구성요소들과 연결된다. 제1 내지 n 인터페이스 중 하나는 네트워크를 통 해 외부 장치와 연결되는 네트워크 인터페이스가 될 수도 있다. 한편, 나아가, 프로세서는 인공지능 모델을 제어할 수 있다. 이 경우, 프로세서는 인공지능 모델을 제어하기 위 한 그래픽 전용 프로세서(예: GPU)를 포함할 수 있음은 물론이다. 한편, 본 발명에 따른 인공지능 모델은 지도학습(supervised learning) 또는 비지도학습(unsupervised learning)기반의 모델일 수 있다. 나아가, 본 발명에 따른 인공지능 모델은 SVM(support vector machine), Decision tree, neural network 등 및 이들이 응용된 방법론을 포함할 수 있다. 일 실시예로, 본 발명에 따른 인공지능 모델은 학습데이터를 입력하여 학습된 합성곱 신경망(Convolutional deep Neural Networks, CNN) 기반의 인공지능 모델일 수 있다. 다만, 이에 한정되는 것은 아니며, 다양한 인공 지능 모델이 본 발명에 적용될 수 있음은 물론이다. 예컨대, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network)과 같은 모델이 인공지능 모델로서 사용될 수 있으나, 이에 한정되지 않는다. 이때, 합성곱 신경망(Convolutional deep Neural Networks, CNN)은 최소한의 전처리(preprocess)를 사용하도록 설계된 다계층 퍼셉트론(multilayer perceptrons)의 한 종류이다. 합성곱 신경망은 하나 또는 여러개의 합성곱 계층(convolutional layer)과 그 위에 올려진 일반적인 인공신경망 계층들로 이루어져 있으며, 가중치와 통합 계층(pooling layer)들을 추가로 활용한다. 이러한 구조 덕분에 합성곱 신경망은 2차원 구조의 입력 데이터를 충분히 활용할 수 있다. 또한, 합성곱 신경망은 표준 역전달을 통해 훈련될 수 있다. 합성곱 신경망은 다른 피 드포워드 인공신경망 기법들보다 쉽게 훈련되는 편이고 적은 수의 매개변수를 사용한다는 이점이 있다. 또한, 심층 신경망(Deep Neural Networks, DNN)은 입력 계층(input layer)과 출력 계층(output layer) 사이에 복수개의 은닉 계층(hidden layer)들로 이뤄진 인공신경망(Artificial Neural Network, ANN)이다. 이때, 심층 신경망의 구조는 퍼셉트론(perceptron)으로 구성될 수 있다. 퍼셉트론은 여러 개의 입력 값(input) 과 하나의 프로세서(prosessor), 하나의 출력 값으로 구성된다. 프로세서는 여러 개의 입력 값에 각각 가중치를 곱한 후, 가중치가 곱해진 입력 값들을 모두 합한다. 그 다음 프로세서는 합해진 값을 활성화함수에 대입하여 하나의 출력 값을 출력한다. 만약 활성화함수의 출력 값으로 특정한 값이 나오기를 원하는 경우, 각 입력 값에 곱해지는 가중치를 수정하고, 수정된 가중치를 이용하여 출력 값을 다시 계산할 수 있다. 이때, 각각의 퍼셉트 론은 서로 다른 활성화함수를 사용할 수 있다. 또한 각각의 퍼셉트론은 이전 계층에서 전달된 출력들을 입력으 로 받아들인 다음, 활성화 함수를 이용해서 출력을 구한다. 구해진 출력은 다음 계층의 입력으로 전달된다. 상 술한 바와 같은 과정을 거치면 최종적으로 몇 개의 출력 값을 얻을 수 있다. 순환 신경망(Reccurent Neural Network, RNN)은 인공신경망을 구성하는 유닛 사이의 연결이 Directed cycle을 구성하는 신경망을 말한다. 순환 신경망은 앞먹임 신경망과 달리, 임의의 입력을 처리하기 위해 신경망 내부의 메모리를 활용할 수 있다. 심층 신뢰 신경망(Deep Belief Networks, DBN)이란 기계학습에서 사용되는 그래프 생성 모형(generative graphical model)으로, 딥 러닝에서는 잠재변수(latent variable)의 다중계층으로 이루어진 심층 신경망을 의미 한다. 계층 간에는 연결이 있지만 계층 내의 유닛 간에는 연결이 없다는 특징이 있다. 심층 신뢰 신경망은 생성 모형이라는 특성상 선행학습에 사용될 수 있고, 선행학습을 통해 초기 가중치를 학습 한 후 역전파 혹은 다른 판별 알고리즘을 통해 가중치의 미조정을 할 수 있다. 이러한 특성은 훈련용 데이터가 적을 때 굉장히 유용한데, 이는 훈련용 데이터가 적을수록 가중치의 초기값이 결과적인 모델에 끼치는 영향이 세지기 때문이다. 선행학습된 가중치 초기값은 임의로 설정된 가중치 초기값에 비해 최적의 가중치에 가깝게 되 고 이는 미조정 단계의 성능과 속도향상을 가능케 한다. 상술한 인공지능 및 그 학습방법에 관한 내용은 예시를 위하여 서술된 것이며, 상술한 실시 예들에서 이용되는 인공지능 및 그 학습방법은 제한되지 않는다. 예를 들어, 당 업계의 통상의 기술자가 동일한 과제해결을 위하여 적용할 수 있는 모든 종류의 인공지능 기술 및 그 학습방법이 개시된 실시 예에 따른 시스템을 구현하는 데 활 용될 수 있다. 한편, 프로세서는 하나 이상의 코어(core, 미도시) 및 그래픽 처리부(미도시) 및/또는 다른 구성 요소와 신호를 송수신하는 연결 통로(예를 들어, 버스(bus) 등)를 포함할 수 있다. 일 실시예에 따른 프로세서는 메모리에 저장된 하나 이상의 인스트럭션을 실행함으로써, 본 발명과 관련하여 설명된 방법을 수행한다. 예를 들어, 프로세서는 메모리에 저장된 하나 이상의 인스트럭션을 실행함으로써 신규 학습용 데이터 를 획득하고, 학습된 모델을 이용하여, 상기 획득된 신규 학습용 데이터에 대한 테스트를 수행하고, 상기 테스 트 결과, 라벨링된 정보가 소정의 제1 기준값 이상의 정확도로 획득되는 제1 학습용 데이터를 추출하고, 상기 추출된 제1 학습용 데이터를 상기 신규 학습용 데이터로부터 삭제하고, 상기 추출된 학습용 데이터가 삭제된 상 기 신규 학습용 데이터를 이용하여 상기 학습된 모델을 다시 학습시킬 수 있다. 한편, 프로세서는 프로세서 내부에서 처리되는 신호(또는, 데이터)를 일시적 및/또는 영구적으로 저 장하는 램(RAM: Random Access Memory, 미도시) 및 롬(ROM: Read-Only Memory, 미도시)을 더 포함할 수 있다. 또한, 프로세서는 그래픽 처리부, 램 및 롬 중 적어도 하나를 포함하는 시스템온칩(SoC: system on chip) 형태로 구현될 수 있다. 메모리에는 프로세서의 처리 및 제어를 위한 프로그램들(하나 이상의 인스트럭션들)을 저장할 수 있 다. 메모리에 저장된 프로그램들은 기능에 따라 복수 개의 모듈들로 구분될 수 있다. 도 2는 본 개시의 일 실시예에 따른 통신부를 포함하는 전자 장치 구성에 의한 시스템 구성도이다. 도 2에 도시된 바와 같이, 전자 장치는 적어도 하나의 단말과 통신하여, 환자 정보를 획득하는 통신 부를 더 포함할 수 있다. 통신부는 외부 장치와 통신을 수행할 수 있다. 특히, 통신부는 와이파이 칩, 블루투스 칩, 무선 통신 칩, NFC칩, 저전력 블루투스 칩(BLE 칩) 등과 같은 다양한 통신 칩을 포함할 수 있다. 이때, 와이파이 칩, 블루 투스 칩, NFC 칩은 각각 LAN 방식, WiFi 방식, 블루투스 방식, NFC 방식으로 통신을 수행한다. 와이파이 칩이나 블루투스칩을 이용하는 경우에는 SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송수신 하여, 이를 이용하 여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 무선 통신칩은 IEEE, 지그비, 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), 5G(5th Generation) 등과 같은 다양 한 통신 규격에 따라 통신을 수행하는 칩을 의미한다. 한편, 단말은 사용자(의료진, 병원 행정과 직원 등)가 보유한 전자 장치일 수 있다. 일 실시예로, 단말은, 서버, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기 (mobile phone), 영상 전화기, 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 노트북 컴퓨터(notebook computer), PDA(personal digital assistant), PMP(portable multimedia player), 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 도 3은 본 개시의 일 실시예에 따른 입출력부를 포함하는 전자 장치 구성도이다. 도 3에 도시된 바와 같이, 전자 장치는 사용자 명령을 바탕으로 환자 정보를 획득하고, 적어도 하나의 정 보를 사용자에게 제공하는 입출력부를 더 포함할 수 있다. 입출력부는 외부장치 연결 포트, 스캔장치, 카메라, 디스플레이, 마우스, 키보드, 리모컨 등을 포함하여, 사용자의 입력을 획득하고, 전자 장치의 정보를 출력하여 사용자에게 가시화된 정보를 제공할 수 있다. 카메라는 적어도 하나의 피사체를 촬영하기 위한 구성으로, 프로세서는 카메라를 통해 적어도 하나의 객체 를 인식하거나 객체와의 거리를 식별할 수 있다. 디스플레이는 다양한 정보를 시각적으로 출력하기 위한 구성이다. 디스플레이는 LCD(Liquid Crystal Display), PDP(Plasma Display Panel), OLED(Organic Light Emitting Diodes), TOLED(Transparent OLED), Micro LED 등으로 구현될 수 있으나, 이에 한정되는 것은 아니고 이밖에 종래 알려진 다양한 형태의 디스플레이를 포함할 수 있다. 디스플레이는, 사용자의 터치 조작을 감지할 수 있는 터치스크린 형태로 구현될 수 있으며, 접히거나 구부러질 수 있는 플렉서블 디스플레이로 구현될 수도 있다. 전자 장치는 입출력부를 통해 전자 장치에 사용자(의료진, 연구자, 환자, 환자 보호자, 의료 행 정 직원 등)가 직접 입력하는 방식으로 환자 정보를 획득하거나, 통신부를 통해 외부 장치인 단말로 부터 환자 정보를 획득할 수 있다. 여기서, 환자는, 중환자실에 병상을 배정받고자 하는 환자 및 의료진 판단 하에 중환자로 판단된 환자 중 적어 도 하나를 전제로 하며, 내원을 요청하거나, 내원 진단을 받거나, 내원 예약을 요청한 환자일 수 있다. 환자 정보는, 개인정보, 신체 정보, 병력 정보, 진료 정보, 및 생체 정보 중 적어도 하나를 포함할 수 있다. 개인정보는 환자의 이름, 환자의 주민번호, 환자의 내원번호, 환자의 성별, 환자의 나이, 환자의 직업, 환자의 흡연력, 및 환자의 음주력 중 적어도 하나를 포함하며, 신체 정보는 환자의 키, 환자의 체중, 환자의 시력, 환 자의 청력 등 환자의 신체의 형태 및 기능에 대한 수치이며, 이때, 전자 장치는 개인정보 및 신체 정보를 획득하기 위해, 국민건강보험공단에 기 등록된 환자의 건강검진 정보를 국민건강보험공단으로부터 획득하거나, 의료진이 환자 및 환자 보호자 중 적어도 한 명으로부터 설문을 수행하여 획득하거나, 환자 및 환자 보호자 중 적어도 한 명으로부터 통신부 및 입출력부 중 적어도 하나를 통해 획득할 수 있다. 병력 정보는 환자의 가족력이 있는 병명, 환자의 입원력, 환자의 수술력, 환자의 발병 전 일상생활 능력 및 환 자의 발병 전 신경학적 능력 중 적어도 하나를 포함할 수 있으며, 전자 장치는 병력 정보를 획득하기 위해, 의료진이 환자 및 환자 보호자 중 적어도 한 명으로부터 설문을 수행하여 획득하거나, 환자 및 환자 보호 자 중 적어도 한 명으로부터 통신부 및 입출력부 중 적어도 하나를 통해 획득할 수 있다. 진료 정보는, 환자의 내원 시점에 획득된, 시간 경과에 따라 사용된 적어도 하나의 장비명, 사용된 장비 별 설 정 값, 환자에게 시행된 적어도 하나의 시술명, 시술명 별 시술 시점, 환자에게 사용된 적어도 하나의 약물명, 및 약물명 별 농도 중 적어도 하나를 포함할 수 있으며, 전자 장치는 의료진의 사용자 명령을 통신부 및 입출력부 중 적어도 하나를 통해 진료 정보로 획득할 수 있다. 생체 정보는, 환자의 내원 시점에 획득된, 의식 수준, 시간 당 소변량, 생체징후에 대한 모니터링 값, 요 검사 정보, 혈액 검사 정보, 환자에게 적용된 적어도 하나의 식이 정보, 및 환자의 대변 정보 중 적어도 하나를 포함 하며, 전자 장치는 의료진의 사용자 명령을 통신부 및 입출력부 중 적어도 하나를 통해 생체 정 보로 획득할 수 있다. 이때, 생체 정보는, 환자의 내원 시점으로부터 발생된, 모니터링 값, 요 검사 정보, 및 혈액 검사 정보 중 적어 도 하나에 대한 누적 데이터 또한 포함할 수 있다. 한편, 전자 장치는, 일반병실에 입원한 환자의 정보, 중환자실에 입원한 환자의 정보, 응급실에서 중환자 실로 전실한 환자의 정보, 중환자실에서 일반병실로 전실한 환자의 정보, 일반병실에서 중환자실로 전실한 환자 의 정보, 내원하되 입원하지 않은 환자의 정보, 사망한 환자의 정보, 다른 병원으로 이송된 환자의 정보, 및 다 른 병원에서 이송된 환자의 정보 중 적어도 하나를 학습 데이터로 획득하여, 학습 데이터를 바탕으로 인공지능 모델을 훈련시킬 수 있다. 이때, 학습 데이터는, 일정 주기 별로 업데이트(추가)되고, 이에 따라, 인공지능 모델은, 상기 학습 데이터가 업데이트 됨에 따라 재학습될 수 있다. 환자의 정보는, 내원 시점으로부터 현재까지 환자 개개인에 대해 누적된 정보로, 병실 이력(병실 배정 이력, 병 신 전실 이력, 퇴원 이력, 사망 등), 치료를 위한 처방 이력(수술, 약물, 재활 등 의료진의 판단에 의해 환자에 게 제공된 의료 처치), 진단 이력(의료진의 진단에 의한 환자의 상태 및 병명 등), 모니터링 값, 요 검사 정보, 및 혈액 검사 정보 중 적어도 하나를 포함할 수 있다. 한편, 전자 장치는, 인공지능 모델의 출력에 따른, 환자의 기본적인 인구학적 정보와 응급실을 포함 하는 병원에서 획득된 생물학적 및 의학적 정보들을 이용하여, 환자 각각에 대해, 중환자실에 배치되는 제1 분 류, 일반병실에 배치되는 제2 분류, 및 일반병실에 배치 예정인 제3 분류 중 어느 분류에 포함되는지 판단할 수 있다. 편의상 제1 분류에 포함되는 환자를 제1 중환자, 제2 분류에 포함되는 환자를 일반(병실 배정)환자, 제3 분류에 포함되는 환자를 제2 중환자로 정의할 수 있다. 예로써, 학습 데이터에 포함된, 중환자실에 입실하여 3일 이내 특별한 이벤트 없이 일반병실에서도 처치 가능한 치료를 유지한 상황에서 일반병실로 전실하여 생존 퇴원한 환자의 제1 정보를 바탕으로, 인공지능 모델은 제1 정보와 동일하거나 유사한 환자 정보를 갖는 환자를 제2 분류로 판단할 수 있다.또한, 예컨대, 학습 데이터에 포함된, 중환자실에서 급성기 치료를 마쳐서 일반병실에서도 처치 가능한 치료를 시작한 시점으로부터 3일 이내에 일반병실로 전실하여 생존 퇴원한 환자의 제2 정보를 바탕으로, 인공지능 모델 은 제2 정보와 동일하거나 유사한 환자 정보를 갖는 환자를 제3 분류로 판단할 수 있다. 한편, 인공지능 모델의 출력을 바탕으로 한 판단 결과, 일반 환자가 식별되면, 전자 장치는, 일반병 실의 잔여 병상 수 및 중환자실의 잔여 병상 수를 각각 획득하고, 일반병실의 잔여 병상 수를 바탕으로, 일반 환자의 일반병실 배치여부를 판단할 수 있다. 일반 환자의 일반병실 배치가 가능한 경우, 전자 장치는, 일반 환자를 일반병실에 배정하되, 일반 환자의 일반병실 배치가 불가능한 경우, 중환자실의 잔여 병상 수를 바탕으로, 일반 환자의 중환자실 배치여부를 판단 할 수 있다. 일반 환자의 중환자실 배치가 가능한 경우, 전자 장치는, 일반 환자를 중환자실에 배정하되, 일반병실에 대한 잔여 병상이 발생하는지 여부를 모니터링 하여, 일반병실에 잔여 병상이 발생하면, 중환자실에 배정된 일 반 환자를 일반병실에 배정하여, 긴급 발생할 제1 중환자 및 제2 중환자를 대비하여 중환자실의 잔여 병상을 확 보할 수 있다. 반대로, 일반 환자의 중환자실 배치가 불가능한 경우, 전자 장치는 기 설정된 연계 병원 중 잔여 병상이 존재하는 적어도 하나의 병원을 식별한다. 연계 병원은, 일반 병실, 응급실, 및 중환자실 각각에 대한 잔여 병상 수와 학습 데이터를, 전자 장치를 소유한 기관(연구소, 병원 등)과 공유하는 병원일 수 있다. 여기서, 전자 장치는, 식별된 병원 중 이송 비용이 가장 적은 적어도 하나의 제1 병원을 식별하고, 제1 병 원이 복수인 경우, 제1 병원 중, 이송 소요 시간이 가장 짧은 제2 병원을 식별하고, 제2 병원에 대해 일반 환자 를 배치할 수 있다. 일반 환자의 경우, 일반병실에서도 처치 가능한 치료만으로 호전될 수 있는 환자이므로, 일반 환자에 대한 이송 이 발생하는 경우, 이송 시간이 아닌 이송 비용을 우선한 제1 병원을 이송 우선 순위로 판단할 수 있다. 반면, 인공지능 모델의 출력을 바탕으로 한 판단 결과, 제1 중환자가 식별되면, 전자 장치는, 중환자 실의 잔여 병상 수를 획득하고, 중환자실의 잔여 병상 수를 바탕으로, 제1 중환자의 중환자실 배치여부를 판단 할 수 있다. 제1 중환자의 중환자실 배치가 가능한 경우, 전자 장치는, 제1 중환자를 중환자실에 배정하되, 제1 중환자 의 중환자실 배치가 불가능한 경우, 연계 병원 중 중환자실의 잔여 병상이 존재하는 적어도 하나의 병원을 식별 할 수 있다. 여기서, 전자 장치는, 식별된 병원 중 이송 소요 시간이 임계시간 미만인 제3 병원을 식별하여, 제3 병원 에 대해 제1 중환자를 배정한다. 제1 중환자의 경우, 이송 중 처치할 수 있는 방법 및 장치의 한계가 존재하여 임계시간을 넘기면, 이송 중 심각 한 부작용이 발생하거나, 사망할 수 있으므로, 이송 소요 시간에 제한이 있다. 실시예로, 전자 장치는 연계 병원 중 중환자실의 잔여 병상이 존재하는 적어도 하나의 병원 각각에 대한 이송 소요 시간을 산출함에 있어서, 차량, 닥터 헬기(헬리콥터), 및 선박 중 제1 중환자의 이송이 결정된 시점 (현재 시점)에서 이용 가능한 적어도 하나의 이송 수단(ex. 차량, 헬리콥터, 선박, 차량과 선박, 선박과 헬리콥 터 등)을 식별하고, 식별된 이송 수단 각각에 대해 접근이 기 허용된 적어도 하나의 병원에 대한 이송 소요 시 간인 제1 시간을 산출할 수 있다. 예컨대, 이송 수단 각각에 대해 접근이 기 허용된 적어도 하나의 병원은, 이송 수단이 닥터 헬기인 경우, 헬리 콥터 착륙장이 있는 병원일 수 있다. 이에 따라, 전자 장치는 산출된 제1 시간 중 시간이 가장 짧은 제2 시간을 식별하고, 제2 시간에 따른 이 송 수단 및 제2 시간에 따른 제3 병원을 식별할 수 있다.반대로, 제3 병원이 미식별된 경우, 전자 장치는 제1 중환자를 응급실에 배정하고, 중환자실에 대한 잔여 병상, 및 제3 병원의 잔여 병상 각각이 발생하는지 여부를 모니터링 하여, 응급실에 배정된 제1 중환자를, 중환 자실, 및 제3 병원 중 잔여 병상이 발생한 장소에 배정할 수 있다. 실시예로, 잔여 병상이 발생한 장소가 제3 병원인 경우, 전자 장치는 잔여 병상이 발생한 시점의 생체 정 보를 바탕으로 환자의 이송 가능 여부를 판단할 수 있다. 환자의 이송이 가능한 경우, 전자 장치는 제1 중환자를 제3 병원의 중환자실에 배정하되, 환자의 이송이 불가능한 경우, 중환자실에 입원한 제2 중환자 중 급성기 치료를 마친 적어도 한 명의 전실 가능한 환자가 존재 하는지 여부를 판단할 수 있다. 전실 가능한 환자가 식별되면, 전자 장치는, 일반병실의 잔여 병상 수, 식별된 환자의 진료 정보 및 생체 정보를 바탕으로, 식별된 환자의 일반병실 전실 가능 여부를 판단할 수 있다. 이에 따라, 식별된 환자의 일반병실 전실이 가능한 것으로 판단되면, 전자 장치는, 식별된 환자를 일반병 실로 배정하되, 제1 중환자를 식별된 환자 대신 중환자실로 배정할 수 있다. 반면, 인공지능 모델의 출력을 바탕으로 한 판단 결과, 제2 중환자가 식별되면, 전자 장치는, 중환자 실의 잔여 병상 수를 바탕으로, 제2 중환자의 중환자실 배치여부를 판단할 수 있다. 제2 중환자의 중환자실 배치가 가능한 경우, 전자 장치는, 제2 중환자를 중환자실에 배정한다. 반대로, 제2 중환자의 중환자실 배치가 불가능한 경우, 전자 장치는, 환자 정보, 기 등록된 중환자실 및 응급실에 대한 인구 변동 이력, 기 등록된 인구 변동 이력에 따른 환자 별 환자 정보, 및 기 등록된 인구 변동 이력에 따른 환자 별 진료 정보를 바탕으로, 제2 중환자의 일반병실 배치까지의 예상 소요 시간을 획득할 수 있 다. 제2 중환자의 경우, 중환자실에서 일정 시간 동안 급성기 치료를 처치받으면, 이후, 일반병실에서도 처치 가능 한 치료가 진행될 가능성이 높은 환자이므로, 일반 병실로의 배치가 고려될 수 있다. 예상 소요 시간이, 응급실의 1 병상 당 기 설정된 소요 가능한 시간인 임계 시간 미만인 경우, 전자 장치 는, 제2 중환자를 응급실에 배정하여 제2 중환자가 급성기 치료를 받고 일반병실로 배정되도록 할 수 있다. 반대로, 예상 소요 시간이 임계 시간을 초과하는 경우, 전자 장치는 제2 중환자가 급성기 치료를 받을 수 있도록, 제3 병원을 식별하여, 제3 병원에 대해 제2 중환자를 배치할 수 있다. 이때, 제3 병원이 미식별된 경우, 전자 장치는, 제2 중환자를 일단은 응급실에 배정하고, 중환자실에 대한 잔여 병상, 및 제3 병원의 잔여 병상 각각이 발생하는지 여부를 모니터링 하고, 응급실에 배정된 제2 중환자를, 중환자실, 및 제3 병원 중 잔여 병상이 발생한 장소에 배정할 수 있다. 예상 소요 시간이 임계 시간을 초과하되, 제3 병원이 미식별되어 응급실에 배정된 제2 중환자의 경우, 응급실에 서 급성기 치료를 완료함에 따라 진료 정보 및 생체 정보가 업데이트되어, 제1 분류에 포함되는 일반 환자로 재 분류되면, 전자 장치는 일반병실의 잔여 병상 수를 바탕으로 일반 환자로 재분류된 제2 중환자에 대한 병 상 배정을 수행할 수 있다. 실시예로, 전자 장치는 상술한 학습 데이터를 바탕으로 중환자실에 입원 중인 환자 각각의 전실 예정일, 및 입원이 필요한 중환자 각각의 응급실 내에서 처치 가능한 시간을 각각 산출할 수 있다. 구체적으로, 중환자실에 입원한 환자 중, 적어도 한 명의 제2 중환자가 식별된 경우, 전자 장치는, 중환자 실에 입실한 제2 중환자 각각의 전실 예정일을 산출할 수 있다. 이어서, 인공지능 모델의 출력에 따라, 중환자실에 입실하지 않은 적어도 한 명의 중환자가 식별되면, 전 자 장치는, 중환자실에 입실하지 않은 중환자 각각의 응급실 내에서 처치 가능한 시간을 산출할 수 있다. 이때, 중환자실에 입실하지 않은 중환자는 응급실에 병상이 배정되거나 아직 입원하지 않은 제1 중환자 및 제2 중환자를 모두 포함한다. 전자 장치는, 산출된 전실 예정일을 바탕으로, 응급실 내에서 처치 가능한 시간이 짧은 순서에 따라, 중환 자실에 입실하지 않은 중환자 각각에 대한 중환자실로의 입실 우선순위를 산출하고, 산출된 전실 예정일을 바탕 으로, 중환자실에 입실한 제2 중환자 각각에 대한 일반병실로의 전실 우선순위를 산출할 수 있다. 이때, 전자 장치는 입실 우선순위, 전실 우선순위, 및 전실 예정일을 바탕으로, 중환자 각각에 대한 입실 예정일을 식별하고, 입실 우선순위에 따른 입실 예정일까지 소요되는 대기 시간이, 응급실 내에서 처치 가능한 시간을 초과하는 적어도 한 명의 대기 불가한 환자가 식별되는 경우, 식별된 대기 불가한 환자가 제1 중환자이 면, 연계 병원 중 중환자실의 잔여 병상이 존재하는 적어도 하나의 병원을 식별하여, 식별된 병원 중 이송 소요 시간이 임계시간 미만인 제3 병원을 식별함으로서, 제3 병원에 대해 대기 불가한 제1 중환자를 배정한다. 반대로, 식별된 대기 불가한 환자가 제2 중환자이면, 전자 장치는 대기 불가한 제2 중환자의 응급실 내에 서 처치 가능한 시간, 대기 불가한 제2 중환자의 일반병실 배치까지의 예상 소요 시간(급성기 치료에 소요될 예 상 시간), 입실 우선순위, 전실 우선순위, 및 전실 예정일을 바탕으로, 대기 불가한 제2 중환자의 입실 우선순 위 변동 가능 여부를 판단하여, 대기 불가한 제2 중환자의 입실 우선순위가 변동 가능한 경우, 대기 불가한 제2 중환자의 입실 우선순위를 변동시킬 수 있다. 예컨대, 대기 불가한 제2 중환자 A의 입실 우선순위가 변동되더라도, A의 예상 소요 시간에 따라 산출된 전실 예정일이, A에 의해 입실 우선순위가 변동된 B의 응급실 내에서 처치 가능한 시간에 따른 마감일 이전인 경우, 전자 장치는 A의 입실이, B의 치료에 영향을 주지 않는 것으로 판단할 수 있다. 반면, 대기 불가한 제2 중환자의 입실 우선순위가 변동 가능한 경우, 전자 장치는, 제3 병원을 식별하여 제3 병원에 대해 대기 불가한 제2 중환자를 배정한다. 실시예로, 전자 장치는, 전자 장치가 위치하는 거점 병원으로부터 임계 범위 내에서 발생하는 응급환 자에 대한 정보를 응급구조기관의 서버로부터 획득할 수 있다. 이에 따라, 전자 장치는, 응급실의 잔여 병상 수를 바탕으로, 응급환자의 응급실 수용 가능 여부를 판단한 다. 이때, 응급실 수용이 불가능한 것으로 판단된 경우, 입실 우선순위, 전실 우선순위, 및 전실 예정일을 바탕으로, 중환자실, 및 응급실 각각에 대한 잔여 병상 발생 시점 및 산출된 시점 별 예상되는 잔여 병상의 수 를 각각 산출하고, 산출된 시점이, 거점 병원으로부터 임계 범위 간의 최소 이동 거리에 따른 최소 이동 시간 내에 발생하는 것으로 판단되면, 산출된 잔여 병상의 수를 바탕으로, 발생된 응급환자 중 수용 가능한 수를 응 급구조기관의 서버로 전달함으로써, 응급환자가 발생한 현장에서 구조요원이 응급환자를 인계할 수 있는 병원을 식별할 수 있도록 하여, 응급환자가 응급실의 잔여 병상 수가 부족하여 여러 병원을 전전하다 골든 타임을 놓치 는 상황을 방지할 수 있다. 한편, 전자 장치는, 병상이 배정된 일 환자에 대하여, 진료 정보 및 생체 정보를 각각 모니터링하고, 진료 정보 및 생체 정보 각각에 대한 기 설정된 변화값이 발생하면, 가장 최근 획득된 일 환자의 환자 정보를 입력값 으로 하여, 인공지능 모델로부터 출력을 획득해 일 환자에 대한 병상 배정을 재수행할 수 있다. 도 4는 본 개시의 일 실시예에 따른 기본 흐름도이다. 도 4에 도시된 바와 같이, 전자 장치는, 적어도 한 명의 환자의 환자 정보를, 중환자실에 대한 배치 여부 를 결정하도록 기 학습된 인공지능 모델에 입력(S410)하여, 인공지능 모델의 출력을 획득(S420)하고, 획득된 출력을 바탕으로, 환자 각각에 대해, 중환자실에 배치되는 제1 분류, 일반병실에 배치되는 제2 분류, 및 일반병실에 배치 예정인 제3 분류 중 어느 분류에 포함되는지 판단(S430)한다. 한편, 컴퓨터 프로그램은, 하드웨어인 컴퓨터와 결합되어, 본 발명의 전자 장치의 제어 방법을 수행할 수 있도록 컴퓨터에서 독출가능한 기록매체에 저장된다. 한편, 본 발명의 전자 장치의 제어 방법에 있어서, 전자 장치가, 일 환자의 환자 정보를, 중환자실에 대한 배치 여부를 결정하도록 기 학습된 인공지능 모델에 입력하고, 인공지능 모델의 출력을 획득하여, 출력을 바탕으로, 중환자실에 배치되는 제1 분류에 포함되는 제1 중환자, 일반병실에 배치되는 제2 분류에 포함되는 일반 환자, 및 일반병실에 배치 예정인 제3 분류에 포함되는 제2 중환자 중 어느 하나의 환자 종류로 환자를 판단함으로써, 판단된 환자 종류, 중환자실의 잔여 병상 수, 및 일반병실의 잔여 병상수를 바탕으로, 환 자를 일 병상에 배정한다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다. 또한, 본 발명의 서로 다른 실시예들은 상호 보완되거나 결합될 수 있다. 본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조 합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler), 파이썬(Python) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되 는 알고리즘으로 구현될 수 있다."}
{"patent_id": "10-2022-0156333", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2022-0156333", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 전자 장치 구성도이다. 도 2는 본 개시의 일 실시예에 따른 통신부를 포함하는 전자 장치 구성에 의한 시스템 구성도이다. 도 3은 본 개시의 일 실시예에 따른 입출력부를 포함하는 전자 장치 구성도이다. 도 4는 본 개시의 일 실시예에 따른 기본 흐름도이다."}
