{"patent_id": "10-2023-0133813", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0050612", "출원번호": "10-2023-0133813", "발명의 명칭": "인공지능모델 구축을 위한 라디오믹스 특징 선별 방법 및 분석장치", "출원인": "사회복지법인 삼성생명공익재단", "발명자": "정우경"}}
{"patent_id": "10-2023-0133813", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "분석장치가 의료 영상에서 추출한 다수의 라디오믹스 특징들을 입력받는 단계;상기 분석장치가 상기 라디오믹스 특징들 각각에 대하여 학습모델의 출력값과의 단변량 분석을 수행하여 통계적관련 지표를 산출하는 단계;상기 분석장치가 상기 통계적 관련 지표 증 적어도 하나를 기준으로 상기 라디오믹스 특징들 중 상기 출력값과의 관련도가 임계값보다 낮은 특징을 1차 제거하는 단계;상기 분석장치가 상기 1차 제거 후 상기 라디오믹스 특징들 중 특징 사이의 공선성이 임계값 이상 높은 특징을2차 제거하는 단계;상기 분석장치가 상기 2차 제거 후 상기 통계적 관련 지표 증 적어도 하나를 기준으로 상기 라디오믹스 특징들중 상기 출력값과의 관련도가 임계값보다 낮은 특징을 3차 제거하는 단계; 및상기 분석장치가 상기 3차 제거 후 상기 라디오믹스 특징들에 대한 임베디드 기법을 적용하여 최종 라디오믹스특징들을 선별하는 단계를 포함하는 인공지능모델 구축을 위한 라디오믹스 특징 선별 방법."}
{"patent_id": "10-2023-0133813", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 1차 제거하는 단계에서상기 분석장치는 상기 라디오믹스 특징들 중 p-값이 제1 임계값 이상인 적어도 하나의 특징을 제거하는 인공지능모델 구축을 위한 라디오믹스 특징 선별 방법."}
{"patent_id": "10-2023-0133813", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 2차 제거하는 단계에서상기 분석장치는 상기 라디오믹스 특징들 중 절대적 상관도가 제2 임계값 이상이거나, 또는 VIF(VarianceInflation Factor)가 제3 임계값 이상인 적어도 하나의 특징을 제거하는 인공지능모델 구축을 위한 라디오믹스특징 선별 방법."}
{"patent_id": "10-2023-0133813", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 3차 제거하는 단계에서상기 분석장치는 (i) 상기 라디오믹스 특징들 중 p-값이 제4 임계값 이상이거나, AUC(Area Under ROC Curve)가제5 임계값 미만이고, (ii) 동시에 승산비가 1인 적어도 하나의 특징을 제거하는 인공지능모델 구축을 위한 라디오믹스 특징 선별 방법."}
{"patent_id": "10-2023-0133813", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "의료 영상을 입력받은 인터페이스 장치;상기 의료 영상에서 다수의 라디오믹스 특징들을 추출하고, 상기 다수의 라디오믹스 특징들 중 학습 모델 구축을 위한 특징들을 선별하는 연산장치를 포함하되,상기 연산장치는 (i)상기 라디오믹스 특징들 각각에 대하여 학습모델의 출력값과의 단변량 분석을 수행하여 통계적 관련 지표를 산출하고, (ii) 상기 통계적 관련 지표 증 적어도 하나를 기준으로 상기 라디오믹스 특징들공개특허 10-2025-0050612-3-중 상기 출력값과의 관련도가 임계값보다 낮은 특징을 1차 제거하고, (iii) 상기 1차 제거 후 상기 라디오믹스특징들 중 특징 사이의 공선성이 임계값 이상 높은 특징을 2차 제거하고, (iv)상기 2차 제거 후 상기 통계적 관련 지표 증 적어도 하나를 기준으로 상기 라디오믹스 특징들 중 상기 출력값과의 관련도가 임계값보다 낮은 특징을 3차 제거하고, (v) 상기 3차 제거 후 상기 라디오믹스 특징들에 대한 임베디드 기법을 적용하여 최종 라디오믹스 특징들을 선별하는 라디오믹스 특징을 선별하는 분석장치."}
{"patent_id": "10-2023-0133813", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제6항에 있어서,상기 1차 제거하는 단계에서상기 연산장치는 상기 라디오믹스 특징들 중 p-값이 제1 임계값 이상인 적어도 하나의 특징을 제거하는 라디오믹스 특징을 선별하는 분석장치."}
{"patent_id": "10-2023-0133813", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 2차 제거하는 단계에서상기 연산장치는 상기 라디오믹스 특징들 중 절대적 상관도가 제2 임계값 이상이거나, 또는 VIF(VarianceInflation Factor)가 제3 임계값 이상인 적어도 하나의 특징을 제거하는 라디오믹스 특징을 선별하는 분석장치."}
{"patent_id": "10-2023-0133813", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 3차 제거하는 단계에서상기 연산장치는 (i) 상기 라디오믹스 특징들 중 p-값이 제4 임계값 이상이거나, AUC(Area Under ROC Curve)가제5 임계값 미만이고, (ii) 동시에 승산비가 1인 적어도 하나의 특징을 제거하는 라디오믹스 특징을 선별하는분석장치."}
{"patent_id": "10-2023-0133813", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능모델 구축을 위한 라디오믹스 특징 선별 방법은 분석장치가 의료 영상에서 추출한 다수의 라디오믹스 특 징들을 입력받는 단계, 상기 분석장치가 상기 라디오믹스 특징들 각각에 대하여 학습모델의 출력값과의 단변량 분석을 수행하여 통계적 관련 지표를 산출하는 단계, 상기 분석장치가 상기 통계적 관련 지표 증 적어도 하나를 (뒷면에 계속)"}
{"patent_id": "10-2023-0133813", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이하 설명하는 기술은 의료 영상에서 유의한 라디오믹스 특징을 선별하는 기법에 관한 것이다."}
{"patent_id": "10-2023-0133813", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "의료 분야에서 영상은 질병 진단 및 예후 예측을 위한 대표적인 자료에 해당한다. 대표적인 의료 영상들은 초음 파 영상, X-ray, CT(Computed tomography), 방사성 동위 원소를 이용한 PET(Positron emission tomography) 및 자기 공명 현상을 이용한 MRI(Magnetic resonance imaging) 등이 있다. 라디오믹스(radiomics) 분석은 초음파 영상, CT, PET, MRI 등의 영상 데이터에서 질병과 관련된 정량적/통계적 특징을 추출하고, 추출한 특징을 기준으로 질병의 진단, 분류 등을 수행하는 연구를 말한다. 라디오믹스 특징은 모양(shape), 강도(intensity), 텍스처(texture), 고차원(high-order), 필터(filter) 등 다수의 카테고리별로 다양한 인자들로 구성된다. 라디오믹스 특징은 하나의 의료 영상에서 수백 내지 수천 개가 추출될 수 있다. 최근 의료 분야에서도 기계학습과 같은 AI(artificial intelligence)를 이용한 애플리케이션이 등장하였다. AI 모델은 의료 영상에서 추출한 라디오믹스 특징들을 입력받아 병변을 분류할 수 있다. 전술한 바와 같이 라디오 믹스 특징들을 대량의 항목들로 구성된다. 따라서, AI 모델 구축 전에 과적합 방지, 모델 성능 향상, 모델 구축 시간 및 비용 감소를 위하여 사전에 특정 AI 모델에 유의한 라디오믹스 특징들이 선별되어야 한다. 선행기술문헌 특허문헌(특허문헌 0001) 미국공개특허 US2021-0217525호"}
{"patent_id": "10-2023-0133813", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래 라디오믹스 특징을 선별하는 기법은 필터 기법, 랩퍼(wrapper) 기법 및 임베디드(embedded) 기법이 있다. 필터 기법은 통계적 기법으로 각 특징과 분석목표와의 유의성을 분석하는 기법(예컨대, Pearson's Correlation 등)이다. 랩퍼 기법은 특정 서브 세트를 학습모델에 입력해가면서 모든 조합 중 최적의 서브 세트를 찾는 기법 이다. 임베디드 기법은 일정한 제한 조건을 부여한 상태에서 학습 과정에서 최적의 서브 세트를 선택하는 기법 이다(예컨대, LASSO 등). 다만, 각 특징 선별 기법은 장단점이 있다. 종전 연구는 특징 선별을 위한 기법을 경 험적으로 적용하였다. 이하 설명하는 기술은 유의한 라디오믹스 특징들을 선별하는 자동화된 방법론을 제공하고자 한다."}
{"patent_id": "10-2023-0133813", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "인공지능모델 구축을 위한 라디오믹스 특징 선별 방법은 분석장치가 의료 영상에서 추출한 다수의 라디오믹스 특징들을 입력받는 단계, 상기 분석장치가 상기 라디오믹스 특징들 각각에 대하여 학습모델의 출력값과의 단변 량 분석을 수행하여 통계적 관련 지표를 산출하는 단계, 상기 분석장치가 상기 통계적 관련 지표 증 적어도 하 나를 기준으로 상기 라디오믹스 특징들 중 상기 출력값과의 관련도가 임계값보다 낮은 특징을 1차 제거하는 단 계, 상기 분석장치가 상기 1차 제거 후 상기 라디오믹스 특징들 중 특징 사이의 공선성이 임계값 이상 높은 특 징을 2차 제거하는 단계, 상기 분석장치가 상기 2차 제거 후 상기 통계적 관련 지표 증 적어도 하나를 기준으로 상기 라디오믹스 특징들 중 상기 출력값과의 관련도가 임계값보다 낮은 특징을 3차 제거하는 단계 및 상기 분석 장치가 상기 3차 제거 후 상기 라디오믹스 특징들에 대한 임베디드 기법을 적용하여 최종 라디오믹스 특징들을 선별하는 단계를 포함한다. 라디오믹스 특징을 선별하는 분석장치는 의료 영상을 입력받은 인터페이스 장치, 상기 의료 영상에서 다수의 라 디오믹스 특징들을 추출하고, 상기 다수의 라디오믹스 특징들 중 학습 모델 구축을 위한 특징들을 선별하는 연 산장치를 포함한다. 상기 연산장치는 (i)상기 라디오믹스 특징들 각각에 대하여 학습모델의 출력값과의 단변량 분석을 수행하여 통계적 관련 지표를 산출하고, (ii) 상기 통계적 관련 지표 증 적어도 하나를 기준으로 상기 라디오믹스 특징들 중 상기 출력값과의 관련도가 임계값보다 낮은 특징을 1차 제거하고, (iii) 상기 1차 제거 후 상기 라디오믹스 특징들 중 특징 사이의 공선성이 임계값 이상 높은 특징을 2차 제거하고, (iv)상기 2차 제 거 후 상기 통계적 관련 지표 증 적어도 하나를 기준으로 상기 라디오믹스 특징들 중 상기 출력값과의 관련도가 임계값보다 낮은 특징을 3차 제거하고, (v) 상기 3차 제거 후 상기 라디오믹스 특징들에 대한 임베디드 기법을 적용하여 최종 라디오믹스 특징들을 선별한다."}
{"patent_id": "10-2023-0133813", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이하 설명하는 기술은 복합적인 기법이 활용된 특징 선별 방법론을 이용하여 개별 방법론의 단점을 줄이고, 성 능이 높은 학습모델 구축에 기여한다."}
{"patent_id": "10-2023-0133813", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 설명하는 기술은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면 에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 이하 설명하는 기술을 특정한 실시 형태에 대해 한정하려 는 것이 아니며, 이하 설명하는 기술의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하 는 것으로 이해되어야 한다. 제1, 제2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 해당 구성요소들은 상기 용어 들에 의해 한정되지는 않으며, 단지 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예 를 들어, 이하 설명하는 기술의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서 사용되는 용어에서 단수의 표현은 문맥상 명백하게 다르게 해석되지 않는 한 복수의 표현을 포함 하는 것으로 이해되어야 하고, \"포함한다\" 등의 용어는 설명된 특징, 개수, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 의미하는 것이지, 하나 또는 그 이상의 다른 특징들이나 개수, 단계 동작 구성요 소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는 것으로 이해되어야 한다. 도면에 대한 상세한 설명을 하기에 앞서, 본 명세서에서의 구성부들에 대한 구분은 각 구성부가 담당하는 주기 능 별로 구분한 것에 불과함을 명확히 하고자 한다. 즉, 이하에서 설명할 2개 이상의 구성부가 하나의 구성부로 합쳐지거나 또는 하나의 구성부가 보다 세분화된 기능별로 2개 이상으로 분화되어 구비될 수도 있다. 그리고 이 하에서 설명할 구성부 각각은 자신이 담당하는 주기능 이외에도 다른 구성부가 담당하는 기능 중 일부 또는 전 부의 기능을 추가적으로 수행할 수도 있으며, 구성부 각각이 담당하는 주기능 중 일부 기능이 다른 구성부에 의 해 전담되어 수행될 수도 있음은 물론이다. 또, 방법 또는 동작 방법을 수행함에 있어서, 상기 방법을 이루는 각 과정들은 문맥상 명백하게 특정 순서를 기 재하지 않은 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 과정들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 이하 설명하는 기술은 의료 영상에서 병변 분류와 같은 특정 애플리케이션에 유의한 라디오믹스 특징을 선별하 는 기법이다. 의료 영상은 초음파 영상, X-ray, CT, PET, PET-CT, MRI, MRA 등 다양한 영상 중 어느 하나일 수 있다. 이하 의료 영상에서 유의한 라디오믹스 특징을 선별하는 장치를 분석장치라고 명명한다. 분석 장치는 영상 처리 및 특징 선별을 위한 알고리즘 내지 모델의 구동이 가능한 컴퓨팅 장치이다. 예컨대, 분석장치는 PC, 스마트기 기, 서버 등과 같은 장치로 구현될 수 있다. 나아가, 분석장치가 학습모델 구축 및 성능 검증도 수행할 수 있다. 먼저, 분석장치가 라디오믹스 특징을 이용하는 학습모델을 구축하는 과정을 개략적으로 설명한다. 도 1은 라디 오믹스 특징을 이용하는 학습모델의 구축 과정의 예이다. 라디오믹스 분석은 통상적으로 7개의 과정으로 구성될 수 있다. 분석장치는 의료 영상을 입력받는다. 이때 의료 영상은 CT, PET, MRI 등과 같이 다양한 유형의 영상 중 어 느 하나일 수 있다. 분석장치는 해당 의료 영상에서 관심 영역을 세그멘테이션할 수 있다. 이때 관심 영역은 수동(manual)으로 또는 딥러닝 기반의 세그멘테이션 모델을 이용하여 자동(automatic)으로 수행될 수도 있다. 나아가, 관심 영역 은 수동 및 자동 기법을 모두 활용하는 하이브리드 방식으로 수행될 수도 있다. 분석장치는 의료 영상에서 라디오믹스 특징들을 추출한다. 이때 라디오믹스 특징들은 모양, 강도, 텍스처, 고차원, 필터 등과 같은 카테고리로 구분될 수 있다. 분석장치는 필터 기법, 랩퍼 기법 및 임베디드 기법 중 어느 하나를 이용하여 라디오믹스 특징들을 선별할 수 있다. 분석장치는 선별한 라디오믹스 특징들을 이용하여 일정한 학습 모델을 구축할 수 있다. 이때 학습모델은 로지스틱 회귀(logistic regression, LR), 결정 트리, 랜덤 포레스트(random forest, RF), XGBoost(eXtremeGradient Boosting), LightGBM(Light Gradient Boosting Machine), CatBoost(Categorical Boosting), KNN(K- nearest neighbor), 나이브 베이즈(Naive Bayes), SVM(support vector machine), 인공신경망(artificial neural network) 등이 있다. 인공신경망은 CNN(Convolutional Neural Network) 등과 같은 딥러닝 모델을 포함 한다. 분석장치는 구축한 모델에 대한 검증을 수행할 수 있다. 모델 검증은 내부 검증 및/또는 외부 검증을 수행 할 수 있다. 나아가, 분석장치는 검증 결과에 따라 모델의 성능을 평가할 수 있다. 성능 지표는 AUC(Area Under ROC Curve), 민감도(sensitivity), 특이도(specificity) 등 중 적어도 하나일 수 있다. 도 2는 라디오믹스 특징을 선별하는 과정에 대한 예이다. 특정 선별의 목적은 데이터 노이즈 제거, 과적합 방지, 학습 시간 및 비용 감소 및 학습 모델의 성능 향상이다. 라디오믹스 특징 선별 기법은 필터 기법, 랩퍼 기법 또는 임베디드 기법으로 구분할 수 있다. 필터 기법은 별도의 학습 알고리즘을 이용하지 않고 특징과 예측하고자 하는 출력값(outcome) 사이의 유의성을 스크리닝한다. 필터 기법은 다른 방법에 비해 간단하여 사용하기 쉽고 빠르게 계산할 수 있는 장점이 있지만, 특징 간의 공선성(Collinearity)을 파악하지 못하는 단점이 있다. 필터 기법은 단변랑 분석을 통하여 특정 특징 에 대한 유의성을 나타내는 지표와 임계값을 비교하여 특징을 선택한다. 랩퍼 기법은 학습 알고리즘을 사용하여 구성 가능한 모든 특징 서브 세트에 대하여 성능을 평가하면서, 최적의 특징 서브 세트를 선택한다. 따라서, 랩퍼 기법은 특징 간의 공선성이 고려되지만, 최적의 조합을 찾기 위해 많 은 시간이 소요되고, 오히려 과적합에 취약할 수 있다는 단점이 있다. 임베디드 기법은 모델 자체에 특징 선택 기능이 내장된 페널티 또는 트리 기반의 학습 알고리즘을 이용하여 특 징을 선택한다. 임베디드 기법은 모든 서브 세트에 대해서 평가하지 않기 때문에 랩퍼 기법보다 효율적이지만, 모델 의존적이므로 파라미터 설정에 따라 결과가 달라지는 단점이 있다. 도 3은 라디오믹스 특징을 선별하는 복합적인 과정의 예이다. 분석장치는 분석 대상인 의료 영상에서 추출한 라디오믹스 특징들을 입력받는다. 이때 분석장치는 각 특징 들과 학습모델에 예측 내지 분류하고자 하는 출력값과의 관계성에 대한 정보를 사전에 확보한다고 가정한다. 분 석장치는 초기 후보 특징 세트에 입력된 라디오믹스 특징들을 저장한다. 이때 의료 영상은 다양한 유형의 영상 중 어느 하나일 수 있다. 해당 영상에서 추출한 라디오믹스 특징들도 의료 영상의 유형에 따라 다양할 수 있다. 분석장치는 후보 특징 세트에 포함된 라디오믹스 특징들에 대한 특징맵을 생성한다. 특징맵은 각 특징에 대하여 특징 선별 과정에서 산출되는 모든 정보를 저장하게 된다. 분석장치는 각 특징과 출력값과의 관계에 대 한 단변량 분석을 수행할 수 있다. 특징맵은 각 특징에 대한 카테고리 및 단변량 분석 결과를 저장할 수 있다. 예컨대, 분석장치는 특징맵에 각 특징에 대한 통계적 관련도(예컨대, p-값, AUC, 승산비(odds ratio, OR) 등) 및 해당 특징의 기본 정보(라디오믹스 특징의 카테고리, 특징의 이름)를 저장할 수 있다. 라디오믹스 특징의 카 테고리는 형태적 특징(morphologic), 강도(intensity) 또는 텍스처 등으로 구분될 수 있다. 분석장치는 라디오 믹스 특징의 선별 과정에서 특징 맵을 업데이트하고, 다른 정보가 누적된다. 분석장치는 후보 특징 세트에 포함된 라디오믹스 특징들 각각에 대한 가능성을 기준으로 필터링을 수행한다 . 분석장치는 후보 특징 세트에 포함된 라디오믹스 특징들 각각에 대한 특징과 출력값의 관계를 기준으로 유의성에 대한 기본적인 가능성을 검토한다. 분석장치는 출력값과의 관련도가 낮은 특징을 필터링(제거)할 수 있다. 분석장치는 p-값 또는 AUC를 기준으로 특징별로 가능성을 판단하고, 가능성이 낮은 특징은 후보 특징 세트에서 제거할 수 있다. 예컨대, 분석장치는 p-값이 제1 임계값(예컨대, 0.5) 이상이나, AUC가 제2 임계값(예 컨대, 0.7)보다 작은 특징을 후보 특징 세트에서 제거할 수 있다. 즉, 분석장치는 p-값 또는 AUC를 기준으로 모 델의 출력값과의 상관도가 높은 특징만을 후보 특징 세트 남길 수 있다. 분석장치는 후보 특징 세트에 남은 라디오믹스 특징들에 대한 특징 사이의 공선성을 기준으로 특징을 필터링을 한다. 따라서, 분석장치는 특징 간의 상관도를 나타내는 지표를 산출할 수 있다. 예컨대, 분석장치는 변수 들만의 관계를 고려하는 절대적인 상관도(예컨대, pearson correlation) 및/또는 독립변수들만의 관계를 고려하는 VIF(Variance Inflation Factor)를 연산할 수 있다. 분석장치는 절대적 상관도가 제3임계값 이상이나, VIF 가 제4 임계값 이상인 특징을 후보 특징 세트에서 제거할 수 있다. 즉, 분석장치는 절대적 상관도 또는 VIF를 기준으로 특징들 사이의 상관도가 낮은(즉, 독립적인) 특징만을 후보 특징 세트 남길 수 있다. 분석장치는 후보 특징 세트에 남은 라디오믹스 특징들 각각에 대한 특징과 출력값의 관계를 기준으로 유의성 기 반한 필터링을 수행할 수 있다. 이때 분석장치는 \"p-값 또는 AUC\"과 함께 승산비를 기준으로 특징을 선택 할 수 있다. 예컨대, 분석장치는 (i) p-값이 제5 임계값 이상이나, AUC가 제6 임계값보다 작으면서, 동시에 (ii) 승산비(OR)가 1인 특징을 후보 특징 세트에서 제거할 수 있다(변수값의 증감이 학습 모델의 출력에 영향을 주지 않는 특징을 제거함). 즉, 분석장치는 \"p-값 또는 AUC\"를 기준으로 학습 모델의 출력값과의 상관도가 높은 특징이면서, 동시에 변수값의 증감이 학습 모델에 영향을 주는 특징만을 후보 특징세트에 남길 수 있다. 마지막으로 분석장치는 후보 특징 세트에 남은 라디오믹스 특징들을 대상으로 임베디드 기법을 이용하여 최종 라디오믹스 특징들을 선택할 수 있다. 예컨대, 분석장치는 LASSO, EN(Elastic-Net) 또는 RF와 같은 학습모 델을 이용하여 최종 라디오믹스 특징들을 선택할 수 있다. 분석장치는 RF를 이용한 분류에서 상위에 위치한 일 정 개수의 특징을 최종 라디오믹스 특징으로 선택할 수 있다. 연구자는 전술한 라디오믹스 특징의 선별 기법에 대한 성능을 검증하였다. 도 4는 실제 데이터 세트를 이용한 라디오믹스 특징 선별 과정이다. 데이터 세트 1은 순천향대 서울 병원에서 수집한 대사 증후군(metabolic syndrome) 환자의 PET-CT 영상에서 추 출한 라디오믹스 특징들을 포함한다. 연구자는 데이터 세트 1을 이용하여 비만 대사 수술(bariatric surgery) 후 대사 증후군을 예측하는 모델을 구축하였다. 데이터 세트 1의 샘플 크기는 79명이고, 전체 55개의 카테고리 에 대한 854개의 특징들로 구성된다. 연구자는 전체 데이터 세트에서 70%는 모델 구축을 위하여 사용했고, 나머 지 30%는 검증을 위하여 사용했다. 연구자는 학습모델로 LR, RF 및 SVM을 이용하였다. 모델의 성능은 정확도 (accuracy), 민감도, 특이도, BA(balanced accuracy) 및 AUC를 이용하여 평가하였다. BA는 예측 모델의 최적 컷오프(cutoff)를 결정하기 위하여 사용했다. 분석장치는 854개의 특징들 각각에 대하여 p-값, AUC 및 OR을 갖는 특징맵을 생하였다. 특징들에 대한 통계적 값들은 사전에 데이터 세트에 포함된 정보일 수도 있고, 분석장치가 특징들에 대한 단변량 분석으로 연산한 값 일 수도 있다. 연구자는 도 3에서 설명한 과정으로 특징값을 선별하였다. 이때, 연구자는 230 과정에서 p-값에 대한 제1 임계 값은 0.5를 설정하였고, 240 과정에서 절대적 상관도(COR)에 대한 제3 임계값은 0.8을 설정하고, VIF에 대한 제 3 임계값은 4를 설정하였고, 250 과정에서 p-값에 대한 제5 임계값은 0.2를 설정하였고, AUC에 대한 제6 임계값 은 0.55를 설정하였고, 260 과정에서 상위 기준을 10으로 설정하였다. 분석장치는 854개의 특징들 중 p-값 < 0.5인 특징들 530개를 특징 세트에 남겼다. 이후 분석장치는 절대적 COR 와 VIF를 기준으로 별도로 특징들을 선별하였다. 분석장치는 절대적 COR < 0.8인 211개의 특징들을 특징 세트 1 에 남겼다. 또한, 분석장치는 VIF < 4인 109개의 특징들을 특징 세트 2에 남겼다. 이후 분석장치는 (i) p-값 < 0.2 또는 AUC > 0.55이면서, (ii) OR가 1이 아닌 특징값을 선별하였다. 이 과정에서 특징 세트 1은 127개 특징 들이 남았고, 특징 세트 2는 75개 특징들이 남았다. 마지막으로 분석장치는 LASSO, EN, RF를 각각 이용하여 임 베디드 기법으로 최종 라디오믹스 특징들을 선택하였다. 특징 세트 1에서 LASSO는 43개, EN은 35개, RF는 10개 의 특징을 선별하였다. 특징 세트 2에서 LASSO는 26개, EN은 30개, RF는 10개의 특징을 선별하였다. 이때 RF의 상위 기준은 10을 사용하였다. 아래 표 1은 특징 세트를 이용하여 교차 검증으로 구축한 모델 LR, RF 및 SVM에 대한 성능을 나타낸다. 표 1 모델 유형특징 세트 특징 개 수성능 지표 AUC정확도 민감도 특이도 BALR COR (특징세트1)LASSO 430.4790.522 0.625 0.467 0.546 EN 350.5580.652 0.500 0.733 0.617 RF 100.8000.826 0.750 0.867 0.808 VIF (특징세트2)LASSO 260.5080.565 0.625 0.533 0.579 EN 300.4420.652 0.000 1.000 0.500 RF 100.7920.870 0.625 1.000 0.812 RF COR (특징세트1)LASSO 430.5870.739 0.500 0.867 0.683 EN 350.5460.739 0.250 1.000 0.625 RF 100.6750.652 0.750 0.600 0.675 VIF (특징세트2)LASSO 260.6670.826 0.500 1.000 0.750 EN 300.6500.783 0.500 0.933 0.717 RF 100.6620.826 0.500 1.000 0.750 SVM COR (특징세트1)LASSO 430.6500.826 0.625 0.933 0.779 EN 350.6500.739 0.625 0.800 0.713 RF 100.6920.652 0.875 0.533 0.704 VIF (특징세트2)LASSO 260.6920.739 0.625 0.800 0.713 EN 300.7170.783 0.500 0.933 0.717 RF 100.7830.826 0.625 0.933 0.779 표 1을 살펴보면, LR 모델은 COR와 RF로 선별한 라디오믹스 특징이 AUC 0.8로 가장 높은 성을 보였고, RF 모델 은 COR와 RF로 선별한 라디오믹스 특징이 AUC 0.675로 가장 높은 성을 보였고, SVM 모델은 VIF와 RF로 선별한 라디오믹스 특징이 AUC 0.783으로 가장 높은 성을 보였다. 도 5는 라디오믹스 특징을 선별하는 분석장치에 대한 예이다. 분석장치는 물리적으로 다양한 형태로 구현될 수 있다. 예컨대, 분석장치는 PC와 같은 컴퓨터 장치, 네트워크의 서버, 데이터 처리 전용 칩셋 등 의 형태를 가질 수 있다. 분석장치는 저장장치, 메모리, 연산장치, 인터페이스 장치, 통신장치 및 출력장 치를 포함할 수 있다. 저장장치는 학습 모델의 분석 대상이 되는 의료 영상을 저장할 수 있다. 저장장치는 의료 영상에서 라디오믹스 특징을 추출하는 프로그램을 저장할 수 있다. 저장장치는 라디오믹스 특징 선별 과정에 사용되는 알고리즘, 프로그램 내지 학습모델을 저장할 수 있다. 저장장치는 분석 결과(유의한 라디오믹스 특징들)를 저장할 수 있다. 저장장치는 선별한 라디오믹스 특징들을 이용하여 구축한 학습모델을 저장할 수 있다. 메모리는 분석장치가 라디오믹스 특징을 선별하는 과정에서 생성되는 데이터 및 정보 등을 저장할 수 있다. 인터페이스 장치는 외부로부터 일정한 명령 및 데이터를 입력받는 장치이다. 인터페이스 장치는 물리적으로 연결된 입력 장치 또는 외부 저장장치로부터 특정 의료 영상을 입력받을 수 있다. 이때 특정 의료 영상은 학습모델이 예측하는 값(특정 질환 진단, 특정 병변 분류, 질환 예후 예측 등)에 따라 특정한 질환을 갖는 환자 모집단과 정상인 모집단의 영상으로 구성될 수 있다. 인터페이스 장치는 특정 의료 영상에서 추출한 다수의 라디오믹스 특징들을 입력받을 수도 있다. 인터페이스 장치는 라디오믹스 특징 선별 과정에 적용되는 임계값, 파라미터 등을 입력받을 수 있다. 인터페이스 장치는 선별한 라디오믹스 특징들을 외부 객체에 전달할 수 있다. 통신장치는 유선 또는 무선 네트워크를 통해 일정한 정보를 수신하고 전송하는 구성을 의미한다. 통신장치는 외부 객체부터 특정 의료 영상을 수신할 수 있다. 통신장치는 외부 객체부터 특정 의료 영상에서 추출한 다수의 라디오믹스 특징들을 수신할 수 있다. 통신장치는 외부 객체부터 라디오믹스 특징 선별 과정에 적용되는 임계값, 파라미터 등을 수신할 수 있다. 통신장치는 선별한 라디오믹스 특징들을 사용자 단말과 같은 외부 객체에 송신할 수도 있다. 한편, 인터페이스 장치는 통신장치로부터 수신한 데이터 내지 정보를 분석장치 내부로 전달하는 인터페이스를 포함하는 의미이다. 출력장치는 일정한 정보를 출력하는 장치이다. 출력장치는 데이터 처리 과정에 필요한 인터페이스, 분석 결과 등을 출력할 수 있다. 연산 장치는 특정 학습 모델의 구축에 사용되는 의료 영상에서 라디오믹스 특징들(후보 라디오믹스 특징들)을 추출할 수 있다. 연산 장치는 상용 프로그램을 이용하여 의료 영상에서 후보 라디오믹스 특징들 을 추출할 수 있다. 이때 연산 장치는 추출한 라디오믹스 특징 각각에 대하여 명칭 및 카테고리를 결정할 수 있다. 연산 장치는 초기 후보 라디오믹스 특징들에 대한 특징맵을 생성할 수 있다. 이 과정에서 연산 장치 는 후보 라디오믹스 특징들 각각에 대한 단변량 분석(회귀 분석)을 수행하여 각 특징과 학습모델의 출력값(예측 값)의 통계적 관련도를 산출할 수 있다. 예컨대, 연산 장치는 p-값, AUC, OR 등을 산출할 수 있다. 연산 장치는 라디오믹스 특징 각각에 대하여 통계적 관련도(p-값, AUC, OR 등) 및 기본 정보(명칭 및 카테고 리)를 저장하여 특징맵을 생성할 수 있다. 연산 장치는 후보 라디오믹스 특징들 각각에 대한 특징과 출력값의 관계를 기준으로 초기 필터링을 수행한 다. 연산 장치는 p-값 또는 AUC를 기준으로 특징별로 가능성을 판단하고, 가능성이 낮은 특징은 제거(필터 링 아웃)할 수 있다(1차 필터링). 예컨대, 연산 장치는 p-값이 제1 임계값 이상이나, AUC가 제2 임계값보 다 작은 특징을 제거할 수 있다. 이후 연산 장치는 1차 필터링 결과로 남은 후보 라디오믹스 특징들에 대한 특징 사이의 공선성을 기준으로 필터링을 수행할 수 있다(2차 필터링). 연산 장치는 절대적 상관도(COR)가 제3임계값 이상이나, VIF가 제4 임계값 이상인 특징을 제거할 수 있다. 이후 연산 장치는 2차 필터링 결과로 남은 후보 라디오믹스 특징들 각각에 대하여 출력값의 관계를 기준으 로 유의성 기반한 필터링을 수행할 수 있다(3차 필터링). 연산 장치는 (i) p-값이 제5 임계값 이상이나, AUC가 제6 임계값보다 작으면서, 동시에 (ii) OR이 1인 특징을 후보 특징 세트에서 제거할 수 있다 이후 연산 장치는 3차 필터링 후 남은 후보 라디오믹스 특징들을 대상으로 임베디드 기법을 적용하여 최종 라디오믹스 특징들을 선택할 수 있다. 임베디드 기법은 다양한 학습 모델(LASSO, EN, RF 등) 중 적어도 하나를 이용하여 최종 라디오믹스 특징들을 선택할 수 있다. 예컨대, 연산 장치는 RF에서 상위 일정 개수의 특징 들을 최종 라디오믹스 특징들로 선택할 수 있다. 연산 장치는 최종 라디오믹스 특징들 기준으로 특정 애플리케이션을 위한 학습 모델을 구출할 수 있다. 연산 장치는 데이터를 처리하고, 일정한 연산을 처리하는 프로세서, AP, 프로그램이 임베디드된 칩과 같은 장치일 수 있다. 또한, 상술한 바와 같은 라디오믹스 특징 선별 기법 내지 선별한 라디오믹스 특징을 이용한 학습 모델 구축 방 법은 컴퓨터에서 실행될 수 있는 실행가능한 알고리즘을 포함하는 프로그램(또는 어플리케이션)으로 구현될 수 있다. 상기 프로그램은 일시적 또는 비일시적 판독 가능 매체(non-transitory computer readable medium)에 저 장되어 제공될 수 있다. 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 어플리케이션 또는 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM (read-only memory), PROM (programmable read only memory), EPROM(Erasable PROM, EPROM) 또는 EEPROM(Electrically EPROM) 또는 플래시 메모리 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있 다. 일시적 판독 가능 매체는 스태틱 램(Static RAM，SRAM), 다이내믹 램(Dynamic RAM，DRAM), 싱크로너스 디램 (Synchronous DRAM，SDRAM), 2배속 SDRAM(Double Data Rate SDRAM，DDR SDRAM), 증강형 SDRAM(Enhanced SDRAM ，ESDRAM), 동기화 DRAM(Synclink DRAM，SLDRAM) 및 직접 램버스 램(Direct Rambus RAM，DRRAM) 과 같은 다양 한 RAM을 의미한다. 본 실시예 및 본 명세서에 첨부된 도면은 전술한 기술에 포함되는 기술적 사상의 일부를 명확하게 나타내고 있 는 것에 불과하며, 전술한 기술의 명세서 및 도면에 포함된 기술적 사상의 범위 내에서 당업자가 용이하게 유추 할 수 있는 변형 예와 구체적인 실시례는 모두 전술한 기술의 권리범위에 포함되는 것이 자명하다고 할 것이다."}
{"patent_id": "10-2023-0133813", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 라디오믹스 특징을 이용하는 학습모델의 구축 과정의 예이다. 도 2는 라디오믹스 특징을 선별하는 과정에 대한 예이다. 도 3은 라디오믹스 특징을 선별하는 복합적인 과정의 예이다. 도 4는 실제 데이터 세트를 이용한 라디오믹스 특징 선별 과정이다. 도 5는 라디오믹스 특징을 선별하는 분석장치에 대한 예이다."}
