{"patent_id": "10-2018-0027924", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0106423", "출원번호": "10-2018-0027924", "발명의 명칭": "인공지능 기반 핵의학 영상 획득 방법 및 장치", "출원인": "가톨릭대학교 산학협력단", "발명자": "김무섭"}}
{"patent_id": "10-2018-0027924", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "핵의학 영상 장비에 의한 촬영으로 숫자배열 형태의 사이노그램과 같은 로우데이터를 취득하는 단계;상기 숫자로 된 좌표정보를 가진 로우테이터를, 종양의 영역과 크기를 보여 주기위한 영상 좌표 상에 역투사하여, 로우 영상 이미지를 획득하는 단계;상기 로우 영상 이미지가 표시된 영상 좌표 평면 상에서 라인별로 취득한 데이터를 XY 평면 상에 매칭하여, 기울기를 가진 로우 프로파일을 획득하는 단계; 상기 로우 프로파일을 미분하여 가공 프로파일을 획득하는 수학적 처리 단계; 및상기 가공 프로파일의 패턴값이기설정된 패턴값에 도달될 때까지 인공지능 신경망을 통해 반복적인 출력을 얻어 상기 종양에 대한 핵의학 영상을 재구성하는 단계;를 포함하여 이루어지는 것을 특징으로 하는 인공지능 기반 핵의학 영상 획득 방법."}
{"patent_id": "10-2018-0027924", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 영상 재구성 단계는, 상기 가공 프로파일의 영역을 복수로 구획하고, 그 가공 프로파일의 패턴값이 기설정된 패턴값에 도달될 때까지 상기 각 영역별 가중치를 서로 다르게 하여 인공지능 신경망을 통해 반복적인 출력을 얻어 상기 종양에 대한 핵의학 영상을 재구성하는 것을 특징으로 하는 특징으로 하는 인공지능 기반 핵의학영상 획득 방법."}
{"patent_id": "10-2018-0027924", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 가공 프로파일은, 상기 미분값을 기반으로 Noise 영역, Signal 영역 및 N/S 교차영역을 포함한 영역으로구획되고, 상기 N/S 교차영역은 상기 미분값의 크기에 상응하는 가중치 값으로 상기 인공지능 신경망을 통해 반복적인 학습이 이루어지는 것을 특징으로 하는 인공지능 기반 핵의학 영상 획득 방법."}
{"patent_id": "10-2018-0027924", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 시그널 영역은, 상기 노이즈 영역의 미분값 패턴과 유사한 미분값을 가지는 영역인 제1영역과 그 시그널영역의 원래의 미분값 패턴을 가지는 제2영역을 포함한 영역으로 구획되는 것을 특징으로 하는 인공지능 기반핵의학 영상 획득 방법."}
{"patent_id": "10-2018-0027924", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "핵의학 영상 장비에 의한 촬영으로 숫자배열 형태의 사이노그램과 같은 로우데이터를 취득하는 데이터 취득부;상기 숫자로 된 좌표정보를 가진 로우테이터를, 종양의 영역과 크기를 보여 주기위한 영상 좌표 상에 역투사하여, 로우 영상 이미지를 획득하는 영상 취득부;상기 로우 영상 이미지가 표시된 영상 좌표 평면 상에서 라인별로 취득한 데이터를 XY 평면 상에 매칭하여, 기울기를 가진 로우 프로파일을 획득하고, 상기 로우 프로파일을 미분하여 가공 프로파일을 획득하는 데이터 가공부; 및상기 가공 프로파일의 패턴값이 기설정된 패턴값에 도달될 때까지 인공지능 신경망을 통해 반복적인 출력을 얻어 상기 종양에 대한 핵의학 영상을 재구성하는 영상 재구성부;를 포함하여 이루어지는 것을 특징으로 하는 인공지능 기반 핵의학 영상 획득 장치."}
{"patent_id": "10-2018-0027924", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 핵의학 영상 획득 방법에 관한 것이다. 본 발명에 의한 인공지능 기반 핵의학 영상 획 득 방법은, 핵의학 영상 장비에 의한 촬영으로 숫자배열 형태의 사이노그램과 같은 로우데이터를 취득하는 단계; 상기 숫자로 된 좌표정보를 가진 로우테이터를, 종양의 영역과 크기를 보여 주기위한 영상 좌표 상에 역투사하여, 로우 영상 이미지를 획득하는 단계; 상기 로우 영상 이미지가 표시된 영상 좌표 평면 상에서 라인별 로 취득한 데이터를 XY 평면 상에 매칭하여, 기울기를 가진 로우 프로파일을 획득하는 단계; 상기 로우 프로파일 을 미분하여 가공 프로파일을 획득하는 수학적 처리 단계; 및상기 가공 프로파일의 패턴값이 기설정된 패턴값에 도달될 때까지 인공지능 신경망을 통해 반복적인 출력을 얻어 상기 종양에 대한 핵의학 영상을 재구성하는 단 계;를 포함하여 이루어진다."}
{"patent_id": "10-2018-0027924", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 핵의학 영상 획득 방법 및 장치에 관한 것으로, 더욱 상세하게는 핵의학 영상 장비로 취득한 영상을 간단한 수학적 알고리즘에 의해 재구성하고, 재구성된 데이터를 특정 영역으로 나눈 후 각 영역 별 가중치를 두어 반복적인 인공지능 학습을 통해 요구되는 결과값을 도출하도록 하여, 정밀하고 신속하게 핵의 학 영상을 얻을 수 있도록 하는 인공지능 기반 핵의학 영상 획득 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2018-0027924", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 기술은 현재 세계적으로 각광받는 기술로 의료, 전자, 기계 등 다양한 산업에 큰 장점으로 활용될 수 있는 핵심 기술로, 의료 분야에 이용될 시에 보다 정확하고 빠른 진단 및 치료를 가능케 함으로써 국민 복지 증 진은 물론 의료 기술 발전에 이바지할 수 있다. 이러한 인공지능 기술을 활용한 영상화 시스템은 영상 인식, 영상 학습, 영상 처리, 재구성에 관한 모든 것을 지도 학습 기반의 최적화 알고리즘을 토대로 구현할 수 있어서 기존 영상화 시스템보다 더 빠르고 정확한 영상 을 얻을 수 있다. 특히, 암정보를 정밀하게 취득하기 위한 핵의학 영상 기술에 이러한 인공지능 기술이 접목된다면, 더욱 정밀하 고 신속하게 환자의 병변부위를 예측하거나 치료할 수 있게 된다. 핵의학 영상기기에는 대표적으로 단일광자단층촬영기기(SPECT)와 양전자단층촬영기기(PET)이 존재한다. 핵의학 영상은 전산화단층촬영(CT) 영상 및 자기공명영상장치(MR) 영상에서는 보기 힘든 ‘암 정보’를 정확하게 보여 준다. 암과 직결되는 영상인 영상기기에서 도출되는 영상은 빠르고 정확해야 하며 불필요한 정보는 반드시 제거 되어야 오진의 부작용을 막을 수 있다. 핵의학 영상은 영상 획득 기법 특성상 인공지능 기술과의 융합이 비교적 쉽다. 핵의학 영상 기술이 인공지능과 결합된다면 빠르고 정확한 영상화는 물론, 학습된 데이터에 기반하여 불 필요한 정보가 제거된 True 영상을 제공하여 보다 정확한 진단 및 치료를 가능하게 한다. 현재 핵의학 영상 기기의 개발은 해외의 의료기기 회사 GE, 지멘스 등이 국내 핵의학 영상 기기 시장을 거의 점 유하고 있지만, 영상화 관련 소프트웨어 개발은 중소기업 급 회사에서도 개발이 이루어지고 있는 실정이다. 보 통은 핵의학 기기 하드웨어 구입 시 별도로 소프트웨어도 구매를 해야 하기 때문에 소프트웨어만 개발하는 회사 도 국내에 존재한다. 현재 의료 영상기기의 점유율은 GE, 지멘스, 필립스 3사의 점유율이 압도적으로 높은 반면, 영상기기 관련 출원 국가는 한국이 월등히 높다. 그만큼 국내의 영상화 소프트웨어 기술력 또한 진보되었고, 시장 규모 또한 커질 수 있다는 전망이다. 이러한 핵의상 영장 기술의 긍정적인 전망에 발맞추어, 기술경쟁력이 있는 인공지능 기반 핵의학 영상 획득 방 법에 관한 기술개발이 절실히 요구되고 있는 실정이다. 특히, 핵의학 영상 장비로 취득한 영상 데이터를 수학적 알고리즘으로 재구성하되, 복잡하지 않고 간소하게 구 성함으로써 최종 영상 데이터 확보를 위한 과정이 신속하게 진행되어야 하고, 이러한 신속성 뿐만 아니라 최종 영상 데이터가 인공지능을 통해 정밀하게 확보될 것이 요구된다."}
{"patent_id": "10-2018-0027924", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 필요성에 의해 안출된 것으로, 본 발명의 목적은 환자의 종양이나 암에 관한 영상을 신 속하고 정밀하게 획득할 수 있게 하는 인공지능 기반 핵의학 영상 획득 방법 및 장치를 제공하고자 하는 것이다."}
{"patent_id": "10-2018-0027924", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 인공지능 기반 핵의학 영상 획득 방법은, 핵의학 영상 장비에 의한 촬영으로 숫자배 열 형태의 사이노그램과 같은 로우데이터를 취득하는 단계; 상기 숫자로 된 좌표정보를 가진 로우테이터를, 종 양의 영역과 크기를 보여 주기위한 영상 좌표 상에 역투사하여, 로우 영상 이미지를 획득하는 단계; 상기 로우 영상 이미지가 표시된 영상 좌표 평면 상에서 라인별로 취득한 데이터를 XY 평면 상에 매칭하여, 기울기를 가진 로우 프로파일을 획득하는 단계; 상기 로우 프로파일을 미분하여 가공 프로파일을 획득하는 수학적 처리 단계;및상기 가공 프로파일의 패턴값이 기설정된 패턴값에 도달될 때까지 인공지능 신경망을 통해 반복적인 출력을 얻어 상기 종양에 대한 핵의학 영상을 재구성하는 단계;를 포함하여 이루어진다. 상기 영상 재구성 단계는, 상기 가공 프로파일의 영역을 복수로 구획하고, 그 가공 프로파일의 패턴값이 기설정 된 패턴값에 도달될 때까지 상기 각 영역별 가중치를 서로 다르게 하여 인공지능 신경망을 통해 반복적인 출력 을 얻어 상기 종양에 대한 핵의학 영상을 재구성하는 것이 바람직하다. 상기 가공 프로파일은, 상기 미분값을 기반으로 Noise 영역, Signal 영역 및 N/S 교차영역을 포함한 영역으로 구획되고, 상기 N/S 교차영역은 상기 미분값의 크기에 상응하는 가중치 값으로 상기 인공지능 신경망을 통해 반 복적인 학습이 이루어지는 것이 바람직하다. 상기 시그널 영역은, 상기 노이즈 영역의 미분값 패턴과 유사한 미분값을 가지는 영역인 제1영역과 그 시그널 영역의 원래의 미분값 패턴을 가지는 제2영역을 포함한 영역으로 구획되는 것이 바람직하다. 상기 목적을 달성하기 위한 본 발명에 의한 인공지능 기반 핵의학 영상 획득 장치는, 핵의학 영상 장비에 의한 촬영으로 숫자배열 형태의 사이노그램과 같은 로우데이터를 취득하는 데이터 취득부; 상기 숫자로 된 좌표정보 를 가진 로우테이터를, 종양의 영역과 크기를 보여 주기위한 영상 좌표 상에 역투사하여, 로우 영상 이미지를 획득하는 영상 취득부; 상기 로우 영상 이미지가 표시된 영상 좌표 평면 상에서 라인별로 취득한 데이터를 XY 평면 상에 매칭하여, 기울기를 가진 로우 프로파일을 획득하고, 상기 로우 프로파일을 미분하여 가공 프로파일 을 획득하는 데이터 가공부; 및 상기 가공 프로파일의 패턴값이 기설정된 패턴값에 도달될 때까지 인공지능 신 경망을 통해 반복적인 출력을 얻어 상기 종양에 대한 핵의학 영상을 재구성하는 영상 재구성부;를 포함하여 이 루어지는 것을 특징으로 하는 한다."}
{"patent_id": "10-2018-0027924", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같은 구성을 가지는 본 발명에 의한 핵의학 영상 획득 방법은, 핵의상 영상 장비로 취득한 영상 정 보를 복잡한 수학적 알고리즘에 의하지 않고 간단한 수학적 처리 방법인 미분을 통해 환자의 종양에 대한 기초 데이터를 확보하고, 이러한 기초 데이터를 인공지능 신경망을 통해 학습하게 하여 실제 종양에 유사한 영상 이 미지를 재구성할 수 있도록 구성됨으로써, 환자의 종양이나 암에 관한 영상을 신속하고 정밀하게 획득할 수 있 게 됨에 따라, 양질의 의료서비스 제공을 통해 의료복지를 더욱 향상시킬 수 있는 장점을 가진다."}
{"patent_id": "10-2018-0027924", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 일실시예에 따른 인공지능 기반 핵의학 영상 획득 방법을 첨부된 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 일실시예에 따른 인공지능 기반 핵의학 영상 획득 방법의 흐름을 설명하기 위한 블럭도이고, 도 2 및 도 3은 본 발명 일실시예의 각 단계별 구현예를 설명하기 위한 도면들이며, 도 4는 본 발명 일실시예의 장점을 설명하기 위한 도면이다. 이들 도면에 도시된 바와 같이, 본 발명의 일실시예에 따른 인공지능 기반 핵의학 영상 획득 방법은, 로우데이 터를 취득하는 제1단계와, 로우 영상 이미지를 획득하는 제2단계와, 로우 프로파일을 획득하는 제3단계와, 가공 프로파일을 획득하는 제4단계와, 핵의학 영상을 재구성하는 제4단계를 포함하여 이루어 진다. 상기 제1단계에서는, 단일광자단층촬영기기(SPECT)와 양전자단층촬영기기(PET)와 같은 핵의학 영상 장비로, 환 자의 종양에 관한 영상을 촬영을 통해 획득하게 된다. 여기서 얻게 되는 영상을, 숫자 배열 형태의 로우테이터(가공되지 않은 데이터)의 집단인 사이노그램 (sinogram; 도 2의 상단 중간 부분 이미지 참조)이라 하는데, 이러한 사이노그램은 일반적으로 수식으로이루어진 알고리즘을 통해 영상으로 재구성되는데, 본 실시예에서는 후술할 인공지능에 의한 딥러닝을 통해 간 단한 수식만으로도 정확한 영상(7; 도 4 참조)으로 재구성될 수 있게 된다. 상기 제2단계에서는, 상기 사이노그램을 통해 얻게 되는 로우데이터를, 종양의 영역과 크기를 보여 주기 위 해 설계된 영상 좌표 상에 역투사하여, 로우 영상 이미지(가공되지 않은 영상 이미지; 도 2의 상단 우측 이 미지 참조)를 획득하게 된다. 여기서 획득되는 로우 영상 이미지는, 본 실시예에 채용된 영상 재구성 방법이 적용되지 않은 이미지이다. 상기 제3단계에서는, 상기 로우 영상 이미지가 표시된 영상 좌표 평면 상에서 라인별로 취득한 데이터를 XY 평면 상에 매칭하여, 기울기를 가진 로우 프로파일을 획득하게 된다. 이러한 로우 프로파일에는, 상기 핵의학 영상 장비로부터 취득한 환자의 종양 정보 중 실제 종양의 위치나 크기에 대응되는 true 정보가 포함되어 있으나, 그렇지 못한 false(노이즈) 정보가 함께 포함되어 있기 때문에, 상기 노이즈에 해당하는 false 정보를 버리고 true 정보를 취하는 데이터 재구성 과정이 요구된다. 종래에는 이러한 데이터 재구성을 위하여, 복잡한 수학적 알고리즘이 수반되어야 했으나, 본 실시예에서는 이러 한 복합한 수학적 알고리즘을 사용하지 않고 간단한 수학적 처리와 딥러닝을 통해 정밀하고 신속한 결과를 얻게 되었다. 즉, 상기 제4단계에서는, 상기 로우 프로파일을 미분하여 가공 프로파일을 획득하는 수학적 처리가 수행 된다. 즉, 본 실시예는 복잡한 수식에 의한 알고리즘을 사용하지 않고 간단한 수학적 처리에 해당하는 미분을 통해 가공 프로파일을 획득하고, 그 가공 프로파일의 좌표값을 활용하여 영상을 재구성할 수 있도록 구성 됨으로써, 핵의학 영상을 종래기술에 비해 신속하게 재구성할 수 있게 된다. 상기 제5단계에서는, 상기 제4단계 수행 이후 확보된 가공 프로파일의 패턴값이 기설정된 패턴값에 도달 될 때까지 인공지능 신경망을 통해 반복적인 출력을 얻어 상기 종양에 대한 핵의학 영상을 재구성하게 된 다. 여기서, 상기 기설정된 패턴은 환자의 영상 정보가 종양인지 아닌지를 판별하는 것을 목표로 하기 때문에, '0'과 '1'로 구별되는 신호에 해당하는 이상적인 요철 패턴인 것이 바람직하다. 즉, 상기 인공지능 신경망을 통한 학습은, 실제 환자의 핵의학 영상 정보가 종양에 대한 정보인지 여부를 미 리 진단하기 위한 것이다. 따라서, 이러한 학습의 결과값은 종양이거나 그렇지 않거나 둘 중 하나의 결과를 도 출하는 것이 이상적이기 때문에, 종양에 관한 다양한 요소를 반영하여 상기 이상적인 요철 패턴에 가깝게 귀결 되는 것이 바람직하다. 이러한 구성을 가지는 본 발명의 일실시예에 따른 핵의학 영상 획득 방법은, 핵의상 영상 장비로 취득한 영상 정보를 복잡한 수학적 알고리즘에 의하지 않고 간단한 수학적 처리 방법인 미분을 통해 환자의 종양에 대한 기 초 데이터를 확보하고, 이러한 기초 데이터를 인공지능 신경망을 통해 학습하게 하여 실제 종양에 유사한 영 상 이미지를 재구성할 수 있도록 구성됨으로써, 환자의 종양이나 암에 관한 영상을 신속하고 정밀하게 획득 할 수 있게 됨에 따라, 양질의 의료서비스 제공을 통해 의료복지를 더욱 향상시킬 수 있는 장점을 가진다. 본 실시예에 채용된 영상 재구성 단계인 상기 제5단계는, 상기 가공 프로파일의 영역을 복수로 구획하고, 그 가공 프로파일의 패턴값이 기설정된 패턴값에 도달될 때까지 상기 각 영역별 가중치를 서로 다르게 하여 인공지능 신경망을 통해 반복적인 출력을 얻어 상기 종양에 대한 핵의학 영상을 재구성하도록 구성되었다. 즉, 상기 가공 프로파일을 통해 취득된 데이터값이, 종양 판별에 대한 신뢰도가 매우 높은 일정 기준치에 해 당하는지 혹은 추가적인 심층 분석이 요구되는지를 영역별로 구획해 두고, 그 영역에 해당하는 범주 내에 속한 경우 서로 다른 프로세스를 통해 핵의학 영상을 재구성함으로써, 불필요한 종양 판별 프로세스를 간소화하고 심층 분석이 요구되는 부분만 집중적으로 분석을 할 수 있도록 하여, 신속하고 정밀한 영상 재구성이 가능하 게 되는 것이다. 본 실시예에서는, 상기 가공 프로파일을, 상기 로우 프로파일의 미분값에 해당하는 기울기 정보를 기반으 로 Noise 영역, Signal 영역 및 N/S 교차영역(노이즈 영역 또는 시그날 영역으로 명확히 분류하기 어려 운 영역)을 포함한 영역으로 구획하고, 상기 N/S 교차영역은 상기 미분값의 크기에 상응하는 가중치 값으로 상기 인공지능 신경망을 통해 반복적인 학습이 이루어지도록 구성되었다. 이러한 구성을 가지는 본 실시예는, 종양 판별의 신뢰도가 높은 영역에 해당하는 Noise 영역과 Signal 영역 신 속하게 분류한 후, 심층적이고 집중적인 분석이 요구되는 N/S 교차영역을, 각 기울기에 대한 인공지능 신경망의 서로 다른 가중치에 의해 학습하게 하고, 학습 결과가 상기 기설정된 이상적인 요철 패턴값과 요구 되는 확률 범위에 도달할 때까지 반복적으로 이루어지게 함으로써, 실제 종양 정보에 매우 유사한 크기와 위치 정보를 가진 핵의학 영상을 재구성할 수 있는 장점을 기대할 수 있게 한다. 즉, 본 실시예는, 도 4에 잘 도시된 바와 같이, 기존의 복잡한 수학적 알고리즘에 의해 재구성한 영상(FBP)과 그래픽 장치를 응용한 툴에 의해 재구성한 영상(GPU based OSEM)과 대조적으로, 실제 종양의 영역과 크기와 매 우 유사한 형태의 영상을 획득할 수 있게 된다. 상기 시그널 영역은, 상기 노이즈 영역의 미분값 패턴과 유사한 미분값을 가지는 영역인 제1영역 과 그 시그널 영역의 원래의 미분값 패턴을 가지는 제2영역을 포함한 영역으로 구획되는 것이 바람직하다. 즉, 본 실시예는, 상기 시그널 영역에 해당하는 영역 중, 상기 노이즈 영역에 해당하는 패턴값과 유사 한 영역을 상기 제1영역으로 분류하고, 그 제1영역이 시그널 영역에 속한 경우에는 노이즈가 아 니라 시그널로 분류할 수 있도록 구성됨으로써, 시그널에 해당하는 정보임에도 불구하고 노이즈로 잘못 분류하 여 영상 판별 신뢰도를 떨어뜨리는 단점을 극복할 수 있게 된다. 한편, 도 ?에 잘 도시된 바와 같이, 본 발명의 일실시예에 따른 인공지능 기반 핵의학 영상 획득 장치는, 데이 터 취득부와, 영상 취득부와, 데이터 가공부와 영상 재구성부를 포함하여 이루어진다. 상기 데이터 취득부는, 핵의학 영상 장비에 의한 촬영으로 숫자배열 형태의 사이노그램과 같은 로우데이터를 취득하여 그 취득된 데이터를 제어부에 송출시키는 부분이다. 상기 데이터 송출 방법은, 유선 및 무선 등 다양 한 방식으로 구현이 가능하다. 상기 영상 취득부는, 제어부의 제어신호에 기초하여 기프로그램화된 소프트웨어적인 메카니즘에 의해, 상기 숫 자로 된 좌표정보를 가진 로우테이터를, 종양의 영역과 크기를 보여 주기위한 영상 좌표 상에 역투사하여 로우 영상 이미지를 획득하는 역할을 한다. 상기 데이터 가공부는, 상기 로우 영상 이미지가 표시된 영상 좌표 평면 상에서 라인별로 취득한 데이터를 XY 평면 상에 매칭하여, 기울기를 가진 로우 프로파일을 획득하고, 상기 로우 프로파일을 미분하여 가공 프로파일을 획득함으로써, 종래의 복잡한 알고리즘에 의한 데이터 가공이 아니라 간단한 수학적 연산에 의한 데이터 가공을 가능하게 하여 신속한 영상 재구성을 가능하게 한다. 상기 영상 재구성부는, 상기 가공 프로파일의 패턴값이 기설정된 패턴값에 도달될 때까지 인공지능 신경 망을 통해 반복적인 출력을 얻어 상기 종양에 대한 핵의학 영상을 재구성하는 부분이다. 이러한 구성을 가지는 본 실시예에 따른 인공지능 기반 핵의학 영상 획득 장치는, 앞에서 설명한 인공지능 기반 핵의학 영상 취득 방법과 마찬가지로, 환자의 종양이나 암에 관한 영상을 신속하고 정밀하게 획득할 수 있게 됨 에 따라, 양질의 의료서비스 제공을 통해 의료복지를 더욱 향상시킬 수 있는 장점을 도출함은 물론, 핵의상 영 상 관련 기술자들에게 있어서 상대적으로 구현이 용이한 수학적 연산 방식이 채용된 데이터 가공부와 딥러닝 기 술을 핵의학 영상 재구성 분야에 접목한 영상 재구성부가 상호 유기적으로 결합됨으로써, 기술 경쟁력 및 원가 경쟁력을 모두 확보할 수 있는 장점을 기대할 수 있게 한다. 이상 본 발명의 다양한 실시예에 대하여 설명하였으나, 본 실시예 및 본 명세서에 첨부된 도면은 본 발명에 포 함되는 기술적 사상의 일부를 명확하게 나타내고 있는 것에 불과하며, 본 발명의 명세서 및 도면에 포함된 기술 적 사상의 범위 내에서 당업자가 용이하게 유추할 수 있는 변형 예와 구체적인 실시예는 모두 본 발명의 권리범 위에 포함되는 것이 자명하다고 할 것이다."}
{"patent_id": "10-2018-0027924", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 인공지능 기반 핵의학 영상 획득 방법의 흐름을 설명하기 위한 블럭도. 도 2 및 도 3은 본 발명 일실시예의 각 단계별 구현예를 설명하기 위한 도면들. 도 4는 본 발명 일실시예의 장점을 설명하기 위한 도면. 도 5는 본 발명의 일실시예에 따른 인공지능 기반 핵의학 영상 획득 장치의 구성을 설명하기 위한 블럭도."}
