{"patent_id": "10-2022-0181812", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0002245", "출원번호": "10-2022-0181812", "발명의 명칭": "원격 제어 시스템, 원격 제어 방법 및 서비스 서버", "출원인": "주식회사 케이티", "발명자": "이장원"}}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "단말의 동작 방법에 있어서,제1 기기 제어 요청을 서비스 서버에 전송하고, 제1 타이머를 동작시키는 단계; 상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 상기 서비스 서버로부터 기기 상태 메시지가 수신되는지판단하는 단계;상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 기기 상태 메시지가 수신되면, 제2 타이머를 동작시키는단계; 상기 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되는지 판단하는 단계; 및상기 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되면, 상기 갱신 기기 상태메시지에 기초하여 갱신된 기기 상태 정보를 출력하는 단계;를 포함하는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 기기 상태 메시지가 수신되면, 제2 타이머를 동작시키는단계는,상기 제1 타이머가 동작을 시작한 후 상기 제1 시간 이내에 상기 기기 상태 메시지가 수신되지 않으면 에러 정보를 출력하는 단계;를 포함하는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 기기 상태 메시지가 수신되면, 제2 타이머를 동작시키는단계는, 상기 제1 타이머가 동작을 시작한 후 상기 제1 시간 이내에 상태 변경 불요 메시지가 수신되면, 기기를 제어할필요가 없음을 나타내는 상태 변경 불요 정보를 출력하는 단계;를 포함하는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 상태 불요 메시지는,상기 기기를 제어하는 제어 서버에서 보유하는 기기 상태 값과 상기 서비스 서버에서 보유하는 기기 상태 값이다른 경우에 상기 서비스 서버로부터 수신되는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서, 상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 기기 상태 메시지가 수신되면, 제2 타이머를 동작시키는공개특허 10-2023-0002245-3-단계는, 상기 제1 타이머가 동작을 시작한 후 상기 제1 시간 이내에 상태 변경 필요 메시지가 수신되면 상기 제2 타이머를 동작 시키는 단계;를 포함하는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 상태 변경 필요 메시지는,기기를 제어하는 제어 서버에서 보유하는 기기 상태 값과 상기 서비스 서버에서 보유하는 기기 상태 값이 일치하는 경우에 상기 서비스 서버로부터 수신되는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 갱신 기기 상태 메시지는,기기가 상기 제1 기기 제어 요청에 기반하여 제어된 이후의 기기 상태 정보인, 상기 갱신된 기기 상태 정보를포함하는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서,상기 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되면, 상기 갱신 기기 상태메시지에 기초하여 갱신된 기기 상태 정보를 출력하는 단계는,상기 갱신된 기기 상태 정보를 포함하는 상기 갱신 기기 상태 메시지를 푸시 메시지로 수신하는 단계;를 포함하는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서,상기 제2 타이머가 동작을 시작한 후 상기 제2 시간 이내에 상기 갱신 기기 상태 메시지가 수신되지 않으면, 상기 서비스 서버에 상태 요청 메시지를 전송하는 단계;를 더 포함하는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항에 있어서,상기 제2 타이머가 동작을 시작한 후 상기 제2 시간 이내에 상기 갱신 기기 상태 메시지가 수신되지 않으면, 에러 정보를 출력하는 단계;를 더 포함하는단말의 동작 방법."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "단말에 있어서,사용자로부터 제1 기기 제어 요청을 수신하는 입력부;정보를 출력하는 출력부; 및공개특허 10-2023-0002245-4-상기 제1 기기 제어 요청을 서비스 서버에 전송하고 제1 타이머를 동작시키고, 상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 상기 서비스 서버로부터 기기 상태 메시지가 수신되는지 판단하고, 상기 제1 타이머가동작을 시작한 후 제1 시간 이내에 기기 상태 메시지가 수신되면 제2 타이머를 동작시키고, 상기 제2 타이머가동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되는지 판단하고, 상기 제2 타이머가 동작을시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되면 상기 갱신 기기 상태 메시지에 기초하여 갱신된기기 상태 정보를 상기 출력부를 통하여 출력하는 제어부;를 포함하는단말."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 제어부는,상기 제1 타이머가 동작을 시작한 후 상기 제1 시간 이내에 상기 기기 상태 메시지가 수신되지 않으면 에러 정보를 출력하는단말."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11항에 있어서,상기 제어부는,상기 제1 타이머가 동작을 시작한 후 상기 제1 시간 이내에 상태 변경 불요 메시지가 수신되면, 기기를 제어할필요가 없음을 나타내는 상태 변경 불요 정보를 출력하는단말."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 상태 불요 메시지는,상기 기기를 제어하는 제어 서버에서 보유하는 기기 상태 값과 상기 서비스 서버에서 보유하는 기기 상태 값이다른 경우에 상기 서비스 서버로부터 수신되는단말."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 11항에 있어서,상기 제어부는,상기 제1 타이머가 동작을 시작한 후 상기 제1 시간 이내에 상태 변경 필요 메시지가 수신되면 상기 제2 타이머를 동작 시키는단말."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 상태 변경 필요 메시지는,기기를 제어하는 제어 서버에서 보유하는 기기 상태 값과 상기 서비스 서버에서 보유하는 기기 상태 값이 일치하는 경우에 상기 서비스 서버로부터 수신되는단말.공개특허 10-2023-0002245-5-청구항 17 제어 서버에 있어서,서비스 서버 및 기기와 통신하는 기기 제어 게이트웨이; 및기기 제어 서버;를 포함하고,상기 기기 제어 서버는,상기 서비스 서버로부터 기기 상태 요청이 수신됨에 따라 상기 기기의 기기 상태 값을 검색하고, 상기 검색된기기 상태 값을 포함하는 기기 상태 응답을 상기 서비스 서버로 전송하고,상기 기기 상태 응답이 전송된 이후 상기 서비스 서버로부터 기기 제어 요청이 수신됨에 따라, 상기 기기 제어요청에 기초하여 상기 기기에 대한 제어를 수행하고,상기 기기로부터 제어 결과를 포함하는 기기 상태 리포트를 수신하고, 상기 기기 상태 리포트를 상기 서비스 서버에 전송하는제어 서버."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17항에 있어서,상기 기기 상태 요청은,상기 제어 서버에서 현재 보유하고 있는, 상기 기기의 기기 상태 값을 확인하기 위한 요청인제어 서버."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서,상기 기기 제어 요청은,상기 제어 서버에서 보유하는 상기 기기 상태 값과 상기 서비스 서버에서 보유하는 기기 상태 값이 일치하는 경우에 상기 서비스 서버로부터 수신되는제어 서버."}
{"patent_id": "10-2022-0181812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19항에 있어서,상기 기기 제어 요청은,상기 기기에 대한 목표 제어 값을 포함하는제어 서버."}
{"patent_id": "10-2022-0181812", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "고객용 단말 및 서비스 서버를 포함하는 원격 제어 시스템이 개시된다. 본 발명에 따른 원격 제어 시스템은, 제1 기기 제어 요청을 상기 서비스 서버에 전송하는 고객용 단말, 및, 상기 고객용 단말로부터 상기 제1 기기 제어 요청이 수신되면 제어 서버에 기기 상태 요청을 전송하고, 상기 제어 서버로부터 상기 기기 상태 요청에 상응하 는 기기 상태 응답이 수신되면 상기 기기 상태 응답에 기초하여 기기 상태 메시지를 상기 고객용 단말에 전송하 고 제2 기기 제어 요청을 상기 제어 서버에 전송하고, 상기 제2 기기 제어 요청에 의해 제어된 기기의 기기 상태 리포트가 상기 제어 서버로부터 수신되면 상기 기기 상태 리포트에 기초하여 기기 상태 정보를 갱신하고 상기 갱 신된 기기 상태 정보를 상기 고객용 단말에 전송하는 서비스 서버를 포함한다."}
{"patent_id": "10-2022-0181812", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 고객용 단말이 제어 요청을 전송한 시점부터 고객용 단말에게 처리 결과를 전송하기까지의 시간을 이원화 하여 처리함으로써 처리 완료에 소요되는 시간, 에러율 및 트래픽을 최소화 할 수 있는, 원격 제어 시스 템, 원격 제어 방법 및 서비스 서버에 관한 것이다."}
{"patent_id": "10-2022-0181812", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "주택, 호텔 등의 정주형 건물에는, 방 또는 객실과 같은 분리된 공간이 존재한다. 그리고 이러한 공간에는 조명, 전동 커튼, 에어컨/히터/공기청정기 등의 공조 장치, 난방 기기, 온도 조절기, 모션 베드, TV 등의 기기가 설치된다. 사용자는 기기들을 직접 제어하거나(예를 들어 사용자가 조명의 버튼을 눌러서 조명을 직접 끄는 방식) 고객용 단말을 이용하여 원격으로 제어할 수 있다. 그리고 고객용 단말을 이용하여 원격으로 제어되는 경우, 기기들은 원격 커뮤니케이션을 통해 제어될 수 있다. 사용자 입장에서는, 사용자가 기기들을 직접 제어하는 방식과 원격으로 제어하는 방식 간에 사용자 동작의 차이 가 거의 없다. 예를 들어 사용자가 조명의 버튼을 눌러서 조명을 직접 끄는 것과 사용자가 고객용 단말을 조작하여 조명을 끄 는 것은, 사용자 입장에서 사용자 동작의 차이가 거의 없다. 다른 예를 들어 사용자가 벽에 설치된 에어컨 조작 버튼을 눌러서 온도를 조절하는 것과 사용자가 고객용 단말을 조작하여 온도를 조절하는 것은, 사용자 입장에서 사용자 동작의 차이가 거의 없다. 한편 고객용 단말을 이용하여 원격으로 기기를 제어하는 방식은 원격 커뮤니케이션을 통해 수행되기 때문에 처 리 시간이 소요될 수 있다. 그리고 정주형 건물과 같은 환경에서는, 사용자가 기기를 직접 육안으로 볼 수 있는 가까운 거리에 있으며, 사 용자가 마음만 먹으면 직접 제어가 가능하다. 따라서 이러한 환경에서의 원격 제어는, 사용자가 원격 제어를 요 청한 후 제어 완료 응답을 제공하기까지의 시간을 최대한 단축하는 것이 매우 중요하다. 또한 주택, 호텔 등의 정주형 건물에 적용되는 원격 제어 방식을 살피면, 사용자가 원격 제어를 요청하고 처리 결과를 확인하는 고객용 단말과, 원격 제어의 대상이 되는 기기들은 서로 상이한 주체(사업자)에 의해 관리되는 경우가 대부분이다. 이 경우 사용자가 원격 제어를 요청한 후 처리 결과를 확인하기까지의 시간이 더욱 증가하 는 문제가 발생할 수 있다. 따라서 주택, 호텔 등의 정주형 건물에서, 사용자가 원격 제어를 요청한 후 제어 완료 응답을 제공하기까지의 시간을 최대한 단축하는 방법이 필요하다. 또한 이와 같은 원격 제어 방식에서는 처리 지연이 발생하는 경우가 많다. 그리고 처리 지연에 따라 고객용 단 말의 응답 대기 타이머가 만료되고, 응답 대기 타이머가 만료됨에 따라 고객용 단말이 에러를 출력하게 되면, 신뢰성이 떨어지는 문제가 발생한다."}
{"patent_id": "10-2022-0181812", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위한 것으로, 본 발명의 목적은, 고객용 단말이 제어 요청을 전송한 시점 부터 고객용 단말에게 처리 결과를 전송하기까지의 시간을 이원화 하여 처리함으로써 처리 완료에 소요되는 시 간, 에러율 및 트래픽을 최소화 할 수 있는, 원격 제어 시스템, 원격 제어 방법 및 서비스 서버를 제공하기 위 함이다."}
{"patent_id": "10-2022-0181812", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 고객용 단말 및 서비스 서버를 포함하는 원격 제어 시스템은, 제1 기기 제어 요청을 상기 서비 스 서버에 전송하는 고객용 단말, 및, 상기 고객용 단말로부터 상기 제1 기기 제어 요청이 수신되면 제어 서버 에 기기 상태 요청을 전송하고, 상기 제어 서버로부터 상기 기기 상태 요청에 상응하는 기기 상태 응답이 수신 되면 상기 기기 상태 응답에 기초하여 기기 상태 메시지를 상기 고객용 단말에 전송하고 제2 기기 제어 요청을 상기 제어 서버에 전송하고, 상기 제2 기기 제어 요청에 의해 제어된 기기의 기기 상태 리포트가 상기 제어 서 버로부터 수신되면 상기 기기 상태 리포트에 기초하여 기기 상태 정보를 갱신하고 상기 갱신된 기기 상태 정보 를 상기 고객용 단말에 전송하는 서비스 서버를 포함한다. 이 경우 상기 서비스 서버는, 상기 갱신된 기기 상태 정보를 포함하는 갱신 기기 상태 메시지를 푸시 메시지로 전송할 수 있다. 한편 상기 서비스 서버는, 상기 기기 상태 응답에 포함되는 기기 상태 값이 상기 서비스 서버에서 보유한 기기 상태 값과 일치하는 경우, 상태 변경 필요 메시지를 상기 고객용 단말에 전송하고 상기 제2 기기 제어 요청을 상기 제어 서버에 전송할 수 있다.한편 상기 서비스 서버는, 상기 기기 상태 응답에 포함되는 기기 상태 값이 상기 서비스 서버에서 보유한 기기 상태 값과 다른 경우, 상기 기기를 제어할 필요가 없음을 나타내는 상태 변경 불요 메시지를 상기 고객용 단말 에 전송할 수 있다. 한편 상기 고객용 단말은, 상기 제1 기기 제어 요청이 상기 서비스 서버에 전송되면 제1 타이머를 동작시키고, 상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 상기 기기 상태 메시지가 수신되지 않으면 에러 정보를 출력할 수 있다. 한편 상기 고객용 단말은, 상기 제1 기기 제어 요청이 상기 서비스 서버에 전송되면 제1 타이머를 동작시키고, 상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 상태 변경 불요 메시지가 수신되면 상기 기기를 제어할 필요가 없음을 나타내는 상태 변경 불요 정보를 출력할 수 있다. 한편 상기 고객용 단말은, 상기 제1 기기 제어 요청이 상기 서비스 서버에 전송되면 제1 타이머를 동작시키고, 상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 상태 변경 필요 메시지가 수신되면 제2 타이머를 동작 시 킬 수 있다. 이 경우 상기 고객용 단말은, 상기 제2 타이머가 동작을 시작한 후 제2 시간 이내에 상기 갱신 기기 상태 메시 지가 수신되면, 상기 갱신 기기 상태 메시지에 기초하여 갱신된 기기 상태 정보를 출력할 수 있다. 한편 상기 고객용 단말은, 상기 제2 타이머가 동작을 시작한 후 제2 시간 이내에 상기 갱신 기기 상태 메시지가 수신되지 않으면, 상기 서비스 서버에 상태 요청 메시지를 전송할 수 있다. 한편 본 발명에 따른 고객용 단말 및 서비스 서버를 포함하는 원격 제어 시스템의 동작 방법은, 상기 고객용 단 말이, 제1 기기 제어 요청을 상기 서비스 서버에 전송하는 단계, 상기 서비스 서버가, 상기 고객용 단말로부터 상기 제1 기기 제어 요청이 수신되면 제어 서버에 기기 상태 요청을 전송하는 단계, 상기 서비스 서버가, 상기 제어 서버로부터 상기 기기 상태 요청에 상응하는 기기 상태 응답이 수신되면 상기 기기 상태 응답에 기초하여 기기 상태 메시지를 상기 고객용 단말에 전송하고 제2 기기 제어 요청을 상기 제어 서버에 전송하는 단계, 및, 상기 서비스 서버가, 상기 제2 기기 제어 요청에 의해 제어된 기기의 기기 상태 리포트가 상기 제어 서버로부터 수신되면 상기 기기 상태 리포트에 기초하여 기기 상태 정보를 갱신하고 상기 갱신된 기기 상태 정보를 상기 고 객용 단말에 전송하는 단계를 포함한다. 이 경우 상기 갱신된 기기 상태 정보를 상기 고객용 단말에 전송하는 단계는, 상기 갱신된 기기 상태 정보를 포 함하는 갱신 기기 상태 메시지를 푸시 메시지로 전송할 수 있다. 한편 상기 기기 상태 메시지를 상기 고객용 단말에 전송하고 제2 기기 제어 요청을 상기 제어 서버에 전송하는 단계는, 상기 기기 상태 응답에 포함되는 기기 상태 값이 상기 서비스 서버에서 보유한 기기 상태 값과 일치하 는 경우, 상태 변경 필요 메시지를 상기 고객용 단말에 전송하고 상기 제2 기기 제어 요청을 상기 제어 서버에 전송할 수 있다. 한편 상기 기기 상태 메시지를 상기 고객용 단말에 전송하고 제2 기기 제어 요청을 상기 제어 서버에 전송하는 단계는, 상기 기기 상태 응답에 포함되는 기기 상태 값이 상기 서비스 서버에서 보유한 기기 상태 값과 다른 경 우, 상기 기기를 제어할 필요가 없음을 나타내는 상태 변경 불요 메시지를 상기 고객용 단말에 전송할 수 있다. 한편 상기 고객용 단말이, 상기 제1 기기 제어 요청이 상기 서비스 서버에 전송되면 제1 타이머를 동작시키는 단계, 및, 상기 고객용 단말이, 상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 상기 기기 상태 메시지가 수신되지 않으면 에러 정보를 출력하는 단계를 더 포함할 수 있다. 한편 상기 고객용 단말이, 상기 제1 기기 제어 요청이 상기 서비스 서버에 전송되면 제1 타이머를 동작시키는 단계, 및, 상기 고객용 단말이, 상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 상태 변경 불요 메시지가 수신되면 상기 기기를 제어할 필요가 없음을 나타내는 상태 변경 불요 정보를 출력하는 단계를 더 포함할 수 있 다. *한편 상기 고객용 단말이, 상기 제1 기기 제어 요청이 상기 서비스 서버에 전송되면 제1 타이머를 동작시키는 단계, 및, 상기 고객용 단말이, 상기 제1 타이머가 동작을 시작한 후 제1 시간 이내에 상태 변경 필요 메시지가 수신되면 제2 타이머를 동작 시키는 단계를 더 포함할 수 있다. 한편 본 발명에 따른 서비스 서버는, 상기 서비스 서버를 고객용 단말 및 제어 서버에 연결하는 서비스 게이트 웨이, 기기 상태 정보를 저장하는 서비스 데이터베이스, 및, 상기 고객용 단말로부터 제1 기기 제어 요청이 수 신되면 상기 제어 서버에 기기 상태 요청을 전송하고, 상기 제어 서버로부터 상기 기기 상태 요청에 상응하는 기기 상태 응답이 수신되면, 상기 기기 상태 응답에 기초하여 기기 상태 메시지를 상기 고객용 단말에 전송하고 제2 기기 제어 요청을 상기 제어 서버에 전송하고, 상기 제2 기기 제어 요청에 의해 제어된 기기의 기기 상태 리포트가 상기 제어 서버로부터 수신되면, 상기 기기 상태 리포트에 기초하여 상기 서비스 데이터베이스의 상기 기기 상태 정보를 갱신하고 상기 갱신된 기기 상태 정보를 상기 고객용 단말에 전송하는 서비스 코어 서버를 포 함한다. 이 경우 상기 서비스 코어 서버는, 상기 갱신된 기기 상태 정보를 포함하는 갱신 기기 상태 메시지를 푸시 메시 지로 전송할 수 있다. 한편 상기 서비스 코어 서버는, 상기 기기 상태 응답에 포함되는 기기 상태 값이 상기 서비스 서버에서 보유한 기기 상태 값과 일치하는 경우, 상태 변경 필요 메시지를 상기 고객용 단말에 전송하고 상기 제2 기기 제어 요 청을 상기 제어 서버에 전송할 수 있다. 한편 상기 서비스 코어 서버는, 상기 기기 상태 응답에 포함되는 기기 상태 값이 상기 서비스 서버에서 보유한 기기 상태 값과 다른 경우, 상기 기기를 제어할 필요가 없음을 나타내는 상태 변경 불요 메시지를 상기 고객용 단말에 전송할 수 있다."}
{"patent_id": "10-2022-0181812", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 주택, 호텔 등의 정주형 건물에 설치된 기기를 고객용 단말로 원격제어를 하는 과정에서, 기 기에 인접해 있는 사용자에게 응답하는 시간을 단축시킴으로써, 고객의 니즈를 충족시키고 고객의 편의성을 증 대시킬 수 있는 장점이 있다. 또한 사업자의 입장에서는, 원격제어 실패 시 발생하는 고객의 불만 접수를 감소시키고, 네트워크, 단말 및 서 버의 처리 부하를 절감할 수 있는 장점이 있다. 또한 본 발명에 따르면, 고객의 제1 기기 제어 요청으로부터 고객에게 제어 결과를 전달하기까지의 시간을 이원 화 시킴으로써, 오류 발생율을 감소시키고 고객에게 정보를 빠르게 전달할 수 있는 장점이 있다. 구체적으로 본 발명에서, 제1 타이머에 해당하는 제1 시간은, 기기의 현재 상태 값을 파악하고 기기 제어의 필 요성을 판단하여 고객에게 제공하는 구간이다. 그리고 기기의 현재 상태 값을 파악하여 고객에게 제공하는 것은, 기기에 제어를 요청하고 제어 완료 후 제어 결과를 고객에게 제공하는 것에 비하여 훨씬 적은 시간이 소 요되기 때문에, 제1 타이머에 해당하는 제1 시간은 짧게 설정될 수 있다. 따라서 에러 처리를 빠르게 수행하거 나, 제어를 수행할 필요가 없다는 정보를 사용자에게 빠르게 제공할 수 있는 장점이 있다. 또한 본 발명에 따르면, 현재 상태 값을 먼저 파악한 후 제어를 수행하기 때문에, 제어 실패에 따른 에러 처리 를 최소화 할 수 있는 장점이 있다. 또한 고객의 제1 기기 제어 요청으로부터 고객에게 제어 결과를 전달하기까지의 시간은 제1 타이머에 해당하는 제1 시간 및 제2 타이머에 해당하는 제2 시간으로 구분되며, 타이머의 만료 여부도 제1 타이머와 제2 타이머에 각각에 대해서 별도로 판단하기 때문에, 고객용 단말에서 응답 대기를 하는 시간 및 타이머가 만료되는 상황을 줄일 수 있는 장점이 있다. 또한 본 발명에 따르면, 서비스 서버는 고객용 단말로부터 제1 기기 제어 요청을 수신하면 곧바로 제2 기기 제 어 요청을 제어 서버에 전송하는 것이 아니라, 기기의 현재 상태 값을 먼저 파악한 후 제어가 가능하거나 제어 의 필요성이 있는 경우에 제2 기기 제어 요청을 제어 서버에 전송한다. 따라서 네트워크 트래픽과 서버의 처리 부하를 감소시킬 수 있는 장점이 있다. 또한 본 발명에 따르면, 서비스 서버는 갱신 기기 상태 메시지를 푸시 메시지의 형태로 고객용 단말에 전송한다. 즉 고객용 단말에서는 폴링을 수행하지 않아도 되기 때문에, 네트워크 트래픽을 줄일 수 있는 장점이 있다. 또한 본 발명에 따르면, 갱신 기기 상태 메시지가 고객용 단말에 전달되지 않은 경우, 고객용 단말은 곧바로 에 러 처리를 하는 것이 아니라 서비스 서버에 상태 요청 메시지를 전송하여 제어 결과를 확인한다. 그리고 상태 요청 메시지가 전송되었음에도 불구하고 제어 결과가 확인되지 않는 상황에서 최종적으로 에러 처리를 하기 때 문에, 에러의 발생율을 줄일 수 있는 장점이 있다."}
{"patent_id": "10-2022-0181812", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또 는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명을 구현함에 있어서 설명의 편의를 위하여 구성요소를 세분화하여 설명할 수 있으나, 이들 구성요소가 하나의 장치 또는 모듈 내에 구현될 수도 있고, 혹은 하나의 구성요소가 다수의 장치 또는 모듈들에 나뉘어져서 구현될 수도 있다. 도 1은 본 발명에 따른 고객용 단말을 이용한 기기 제어 시스템을 설명하기 위한 도면이다. 고객용 단말을 이용한 기기 제어 시스템은, 원격 제어 시스템 및 기기 제어 시스템을 포함할 수 있 다. 원격 제어 시스템은 고객에게 서비스를 제공하는 주체(예를 들어 IT 서비스 사)가 운영하는 시스템으로, 고 객용 단말 및 서비스 서버를 포함할 수 있다. 또한 기기 제어 시스템, 정주형 건물을 관리하는 주체(예를 들어 아파트 관리 사무소, 호텔 운영사 등)가 운영하는 시스템으로, 제어 서버 및 하나 이상의 기기(정주형 건물이 아파트인 경우 댁내 기기, 정주 형 건물이 호텔 등의 숙박 시설인 경우 객실 내 기기)를 포함할 수 있다. 한편 원격 제어 시스템의 고객용 단말은 고객으로부터 입력을 수신하고, 고객에게 정보를 출력하는 장 치일 수 있다. 구체적으로 고객용 단말은 댁내 또는 객실 내 설치된 입출력 장치일 수 있다. 예를 들어 고객용 단말(10 0)은 고객의 입력을 수신하여 고객의 입력에 상응하는 서비스를 제공하는 인공지능 기기일 수 있다. 또한 이러한 인공지능 기기는, 방송 신호를 수신하여 디스플레이 장치에 출력하는 기능을 추가적으로 수행하는 셋탑박스 일 수 있다. 또한 고객용 단말은 고객이 소유한 이동 단말기일 수 있다. 예를 들어 고객용 단말은 원격 제어를 위 한 애플리케이션이 설치된 스마트 폰일 수 있다. 이 경우 고객용 단말은 원격 제어를 위한 애플리케이션이 실행된 상태에서, 서비스 서버와 데이터를 송/수신 할 수 있다. 한편 고객용 단말은 고객의 입력을 수신하기 위한 입력부를 포함할 수 있다. 그리고 입력부는, 음성 입력 을 수신하기 위한 마이크, 버튼 입력을 수신하기 위한 키 패드, 터치 입력을 수신하기 위한 터치 패드 중 적어 도 하나를 포함할 수 있다. 또한 고객용 단말은 고객에게 서비스를 제공하고 정보를 출력하기 위한 출력부를 포함할 수 있다. 그리고 출력부는, 영상을 디스플레이 하기 위한 디스플레이부, 음성을 출력하기 위한 스피커 및 고객용 단말과 연 결된 디스플레이 장치를 통하여 정보를 출력하기 위한 인터페이스 중 적어도 하나를 포함할 수 있다. 원격 제어 시스템의 서비스 서버는, 서비스 게이트웨이, 서비스 코어 서버 및 서비스 데이 터베이스를 포함할 수 있다. 서비스 게이트웨이는 서비스 서버를 고객용 단말 및 제어 서버에 연결하고, 고객용 단말 및 제어 서버와 통신할 수 있다. 따라서 서비스 서버의 내부 구성요소(예를 들어 서비스 코어 서버)에서 고객용 단말 또는 제어 서버로 전송하는 데이터는 서비스 게이트웨이를 통하여 고객용 단말 또는 제어 서버에 전 달될 수 있다. 또한 고객용 단말 또는 제어 서버가 전송한 데이터는, 서비스 게이트웨이를 통하여, 서비스 서 버의 내부 구성요소(예를 들어 서비스 코어 서버)에 전달될 수 있다. 한편 서비스 코어 서버는 서비스 서버의 전반적인 동작을 제어할 수 있다. 또한 서비스 코어 서버는, 서비스 게이트웨이를 통하여, 고객용 단말 또는 제어 서버와 데 이터를 송/수신 할 수 있다. 본 명세서에서, 서비스 코어 서버가 고객용 단말 또는 제어 서버에 데이터, 요청, 정보, 응답, 메시지, 리포트 등을 전송한다는 것은, 서비스 코어 서버가 서비스 게이트웨이를 통하여 전송하는 것 을 의미할 수 있다. 또한 본 명세서에서, 서비스 코어 서버가 고객용 단말 또는 제어 서버로부터 데이터, 요청, 정 보, 응답, 메시지, 리포트 등을 수신한다는 것은, 서비스 코어 서버가 서비스 게이트웨이를 통하여 수신하는 것을 의미할 수 있다. 또한 서비스 코어 서버는 서비스 데이터베이스 내 데이터를 독출하거나 갱신할 수 있다. 서비스 데이터베이스는 기기의 상태 값을 포함하는 기기 상태 정보를 저장할 수 있다. 또한 서비스 데이터베이스는 기기의 식별 정보, 기기의 식별 정보에 대응하는 접속 경로를 포함하는 기기 정보를 저장할 수 있다. 한편 기기 제어 시스템의 제어 서버는 기기 제어 게이트웨이 및 기기 제어 서버를 포함할 수 있다. 기기 제어 게이트웨이는 제어 서버를 서비스 서버 및 하나 이상의 기기에 연결하고, 서비 스 서버 및 하나 이상의 기기와 통신할 수 있다. 따라서 제어 서버의 내부 구성요소(예를 들어 기기 제어 서버)에서 서비스 서버 또는 하나 이상 의 기기로 전송하는 데이터는 기기 제어 게이트웨이를 통하여 서비스 서버 또는 하나 이상의 기 기에 전달될 수 있다. 또한 서비스 서버 또는 하나 이상의 기기가 전송한 데이터는, 기기 제어 게이트웨이를 통하여, 제어 서버의 내부 구성요소(예를 들어 기기 제어 서버)에 전달될 수 있다. 한편 기기 제어 서버는 제어 서버의 전반적인 동작을 제어할 수 있다. 또한 기기 제어 서버는, 기기 제어 게이트웨이를 통하여, 서비스 서버 와 데이터를 송/수신 할 수 있다. 또한 기기 제어 서버는, 직접 또는 기기 제어 게이트웨이를 통하여, 하나 이상의 기기와 데이터 를 송/수신 할 수 있다. 한편 하나 이상의 기기는 정주형 건물에 설치되어 사용자에게 편의를 제공하는 기기일 수 있다. 예를 들어 하나 이상의 기기는, 조명, 전동 커튼, 에어컨/히터/공기청정기 등의 공조 장치, 난방 기기, 온 도 조절기, 창문 개폐 제어 장치, 도어 잠금 제어 장치, 온수 조절기, 모션 베드, TV 등의 디스플레이 장치, 음 향 출력 장치 등을 포함할 수 있다. 하나 이상의 기기는 입력 장치를 포함하고, 입력 장치를 통하여 수신되는 고객의 입력에 기초한 제어를 수 행할 수 있다. 예를 들어 기기가 전등인 경우, 전등은 사용자의 버튼 입력에 기초하여 조명을 온 또는 오프할 수 있다. 다른 예를 들어 기기가 에어컨인 경우, 에어컨은 사용자의 터치 패드 입력에 기초하여 설정 온도나 풍량을 조절할 수 있다. 또한 하나 이상의 기기는 제어 서버로부터 전송된 기기 제어 요청에 기초한 제어를 수행할 수 있다. 한편 용어 “기기”는 용어 “제어 대상 기기”와 혼용되어 사용될 수 있다. 한편 원격 제어 시스템의 서비스 서버와 기기 제어 시스템의 제어 서버 간에는 서버-서버 간 통신이 수행될 수 있다. 또한 고객용 단말과 서비스 서버 간에는 단말-서버 간 통신이 수행될 수 있 다. 한편 단말-서버 간, 서버-서버 간 통신 방식은 통상적으로 연동 구간별로 요청 및 응답의 쌍으로 이루어진다. 그리고 데이터 베이스가 연계된 실 상용 네트워크의 경우, 요청 및 응답이 종단 간에 완료되어야 그 목적이 달 성될 수 있다. 그리고 정주형 건물에서의 실제 사용 환경은 사용자가 기기를 직접 육안으로 볼 수 있는 가까운 거리에 있는 반 면에, 원격 제어를 위한 네트워크의 구성은 고객 서비스 사업자가 운영하는 원격 제어 시스템과 건물 관리 사업자가 운영하는 기기 제어 시스템 간에 연동이 필요한 복잡성이 존재하는 구조이다, 다음은 도 2 및 도 3을 참고하여, 고객용 단말을 이용한 기기 제어 시스템에서 발생할 수 있는 문제를 살펴본다. 도 2는 동기 방식을 통한 기기 제어 시스템을 도시한 도면이다. 동기 방식에서는, 최초에 고객용 단말에서 원격 제어를 요청한 경우, 원격 제어의 요청이 서비스 서버(서비스 코어 서버, 서비스 데이터베이스, 서비스 게이트웨이)와 제어 서버(기기 제어 게이트웨이, 기기 제어 서버)를 거쳐 제어 대상 기기로 전달된다. 또한 제어 대상 기기가 해당 동작을 수행하면 해당 동작에 대한 완료 응답을 출력하며, 완료 응답은 다시 역방 향으로 제어 서버와 서비스 서버를 거쳐 고객용 단말에 전달된다. 즉 동기 방식에서는, 요청(원격 제어의 요청)과 응답(해당 동작에 대한 완료 응답)이 하나의 종단으로 발생하게 된다. 이러한 동기 방식에서의 동작 플로우(flow)는 단순하다는 장점을 가진다. 다만 동기 방식에서는, 각 구간별 처리 지연이 발생하는 경우, 고객용 단말의 응답 대기 타이머가 만료될 가능 성이 높아지기 때문에, 에러의 발생 가능성이 높아지는 문제가 발생한다. 특히 정주형 건물에 배치된 기기를 제어하는 경우와 같이, 이종 사업자들이 운영하는 서버간 통신이 수행되는 경우, 그리고 서버와 제어 대상 기기 간의 통신이 수행되는 경우에는, 응답 지연 또는 응답 실패로 인하여 전체 의 기기 제어 동작이 실패하는 상황이 발생할 가능성이 높다. 아울러, 단말이나 서버 군에서 해당 트랜잭션이 장시간 유지됨에 따라, 부하, 즉 동시 접속 세션 관리와 관련된 성능 이슈가 발생할 가능성이 높아진다.도 3은 비동기 폴링 방식을 통한 기기 제어 시스템을 도시한 도면이다. 비동기 폴링 방식은 동기 방식을 개선하여, 고객용 단말에서의 원격 제어 요청을 서비스 서버(서비스 코어 서버, 서비스 데이터베이스, 서비스 게이트웨이)가 제어 서버(기기 제어 게이트웨이, 기기 제어 서버)로 전달하 는 경우, 제어 서버에서 해당 요청을 정상 수신하였다는 의미의 응답을 서비스 서버에 전송하고 동작 완료 응답 은 별도로 서비스 서버에 전달하는 방식이다. 이 경우 고객용 단말은 원격 제어 요청이 정상 처리되었는지를 확인하기 위한 폴링, 즉, 주기적인 상태 확인을 수행하게 된다. 이와 같은 비동기 폴링 방식은 동기 방식에 비하여, 고객용 단말에서의 원격 제어 요청 응답 대기 타이머의 만 료 가능성을 낮출 수 있다는 장점이 있으나, 폴링으로 인하여 네트워크 트래픽이 증가한다는 단점이 발생하게 된다. 구체적으로 기기가 동작을 완료하기 이전에, 이종 사업자들의 게이트웨이 간에 응답 처리를 먼저 하는 비동기 방식으로 요청 및 응답이 처리되기 때문에, 동기 방식과 비교했을 때 고객용 단말의 타이머가 만료될 가능성은 낮아진다. 다만 기기의 동작 완료를 고객에게 제공하기 위해서, 고객용 단말은 서비스 서버의 서비스 데이터 베이스로 폴 링(제어 대상 기기의 상태가 원하는 값으로 변경되었는지를 주기적으로 확인하는 동작)을 수행해야 하므로, 네 트워크 트래픽 증가 및 고객용 단말의 부하 증가라는 악 영향을 야기하게 된다. 특히 외부 공중망에 위치한 고객용 단말은, 서버팜 내부 망에 위치한 서비스 데이터베이스에 직접 접근이 불가 능하다. 따라서 서비스 데이터 베이스에 접근하기 위해서는, 서비스 게이트웨이 및 서비스 코어 서버를 경유해 야 하기 때문에, 네트워크 트래픽 증가라는 악 영향은 더욱 가중되게 된다. 따라서 본 발명에서는, 제어실패 등의 오류를 최소화시키고, 사용자는 처리 결과를 빠르게 확인할 수 있는, 즉 안정성과 효율성을 모두 달성할 수 있는 비동기 / 타이머 이원화 방식을 제안한다. 도 4는 본 발명에 따른 서비스 서버의 동작을 설명하기 위한 순서도이다. 본 발명에 따른 서비스 서버의 동작 방법은, 고객용 단말로부터 기기 제1 제어 요청을 수신하는 단계 (S410), 고객용 단말로부터 제1 기기 제어 요청이 수신되면 제어 서버에 기기 상태 요청을 전송하는 단계 (S420), 제어 서버로부터 기기 상태 요청에 상응하는 기기 상태 응답을 수신하는 단계(S430), 제어 서버 로부터 기기 상태 요청에 상응하는 기기 상태 응답이 수신되면, 기기 상태 응답에 기초하여 기기 상태 메 시지를 고객용 단말에 전송하는 단계(S440), 제어 서버로부터 기기 상태 요청에 상응하는 기기 상태 응답 이 수신되면, 제2 기기 제어 요청을 제어 서버에 전송하는 단계(S450), 제어 서버로부터 제2 기기 제 어 요청에 의해 제어된 기기의 기기 상태 리포트를 수신하고 기기 상태 리포트에 기초하여 기기 상태 정보를 갱 신하는 단계(S460), 갱신된 기기 상태 정보를 포함하는 갱신 기기 상태 메시지를 푸시 메시지로 고객용 단말 에 전송하는 단계(S470), 고객용 단말로부터 상태 요청 메시지를 수신하고, 갱신된 기기 상태 메시지 를 푸시 메시지로 고객용 단말에 전송하는 단계(S480)를 포함할 수 있다. 여기서 S480은 S470이 정상적으로 진행되지 않은 경우에 수행되는 단계일 수 있다. 구체적으로 갱신 기기 상태 메시지가 고객용 단말에 전송되지 않은 상태에서, 고객용 단말의 제2 타이머가 동작을 시작한 후 제2 시간이 경과한 경우, 고객용 단말은 상태 요청 메시지를 서비스 서버에 전송할 수 있다. 이 경우 서 비스 서버는 기기 상태 정보를 갱신하고, 갱신된 기기 상태 정보를 포함하는 갱신 기기 상태 메시지를 고 객용 단말에 전송할 수 있다. 도 5는 본 발명에 따른 고객용 단말의 동작 방법을 설명하기 위한 도면이다. 본 발명에 따른 고객용 단말의 동작 방법은, 기기 제어를 위한 사용자 입력이 수신되면 제1 기기 제어 요 청을 서비스 서버에 전송하고 제1 타이머를 동작시키는 단계(S510), 제1 타이머가 동작을 시작한 후 제1 시간 이내에 서비스 서버로부터 기기 상태 메시지가 수신되는지 결정하는 단계(S520), 제1 시간 이내에 기 기 상태 메시지가 수신되지 않으면 에러 메시지를 출력하는 단계(S530), 제1 시간 이내에 기기 상태 메시지가 수신된 경우, 수신된 기기 상태 메시지가 상태 변경 필요 메시지인지 상태 변경 불요 메시지인지 판단하는 단계 (S540), 수신된 기기 상태 메시지가 상태 변경 불요 메시지이면, 기기를 제어할 필요가 없음을 나타내는 상태 변경 불요 정보를 출력하는 단계(S550), 수신된 기기 상태 메시지가 상태 변경 필요 메시지이면 제2 타이머를 동작시키는 단계(S560), 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되는지판단하는 단계(S570), 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되면, 갱 신 기기 상태 메시지에 기초하여 갱신된 기기 상태 정보를 출력하는 단계(S580), 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되지 않으면, 서비스 서버에 상태 요청 메시지를 전송하 는 단계(S590) 및 서비스 서버로부터 갱신 기기 상태 메시지가 수신되면 갱신 기기 상태 메시지에 기초하 여 갱신된 기기 상태 정보를 출력하는 단계(S595)를 포함할 수 있다. 다음은 도 6을 참고하며 원격 제어 시스템의 동작을 구체적으로 설명한다. 도 4 및 도 5를 함께 참고하여 설명 하도록 한다. 도 6은 원격 제어 시스템의 동작을 설명하기 위한 상세 순서도이다. 고객용 단말은 정주형 건물 내부에 설치되어, 기기 제어를 위한 사용자 입력을 수신할 수 있다. 예를 들어 고객용 단말은 호텔 객실 내부에 설치되어, “조명 켜줘”라는 사용자 입력을 수신할 수 있다. 다른 예를 들어 고객용 단말은 아파트 내부에 설치되어 “에어컨 온도 25도로 해줘”라는 사용자 입력을 수신할 수 있다. 한편 사용자 입력이 수신되면, 고객용 단말은 사용자 입력에 상응하는 제1 기기 제어 요청을 서비스 서버 에 전송할 수 있다(S510, S605). 또한 제1 기기 제어 요청이 서비스 서버에 전송되면, 고객용 단말은 제1 타이머를 동작시킬 수 있다 (S510). 제1 타이머의 시작 조건 및 종료 조건은 다음과 같다. 표 1 제1 타이머 (T1) 시작 조건 종료 조건 제1 기기 제어 요청 전송 기기 상태 메시지 수신 즉 제1 타이머는 제1 기기 제어 요청이 서비스 서버에 전송되는 것과 함께 동작을 시작할 수 있다. 또한 제1 타이머는 서비스 서버로부터 기기 상태 메시지가 수신되는 것과 함께 동작을 중단할 수 있다. 제1 타 이머의 동작이 종료되는 경우에는 제2 타이머의 동작이 시작되는데, 이와 관련해서는 이후에 상세히 설명하도록 한다.한편 제1 타이머는 기기 상태 메시지가 수신되는 경우 외에도, 제1 타이머가 동작을 시작하고 제1 시간이 경과하면 동작을 중단할 수 있다. 여기서 제1 시간은 고객용 단말을 사용하는 고객이 제어를 요청한 후 무한정 대기할 수 없기 때문에, 제어 가 불가능한 경우에는 이를 미리 알림으로써 고객의 대기 시간을 줄이기 위해 설정된 시간이다. 따라서 제1 기 기 제어 요청이 전송된 후 기기 상태 메시지가 수신되지 않은 상태에서 제1 시간이 경과하면, 고객용 단말(10 0)은 고객에게 에러 정보를 출력하게 된다. 또한 서비스 서버의 입장에서 설명하면, 제1 시간은 기기의 현 재 상태 값을 파악하고 기기 제어의 필요성을 판단하여 고객에게 제공하는 구간이다. 이와 관련해서는 이후에 상세히 설명하도록 한다. 한편 본 명세서에서, 서비스 코어 서버가 고객용 단말 또는 제어 서버에 데이터, 요청, 정보, 응답, 메시지, 리포트 등을 전송한다는 것은, 서비스 코어 서버가 서비스 게이트웨이를 통하여 전송 하는 것을 의미할 수 있다. 또한 본 명세서에서, 서비스 코어 서버가 고객용 단말 또는 제어 서버로부터 데이터, 요청, 정 보, 응답, 메시지, 리포트 등을 수신한다는 것은, 서비스 코어 서버가 서비스 게이트웨이를 통하여 수신하는 것을 의미할 수 있다. 서비스 코어 서버는 서비스 게이트웨이를 통하여 제1 기기 제어 요청을 수신할 수 있다(S410, S610). 그리고 제1 기기 제어 요청이 수신되면, 서비스 코어 서버는 제1 기기 제어 요청을 이용하여 기기(제 어 대상 기기)의 기기 정보를 획득할 수 있다(S615, 620). 구체적으로 서비스 서버는 도 6에 도시된 제어 서버뿐만 아니라, 다양한 제어 서버와 연결되어 원격 제어 서비스를 제공할 수 있다. 예를 들어 서비스 서버는 A 아파트의 제어 서버, B 호텔의 제어 서버와 연결되어 원격 제어 서비스를 제공할 수 있다. 또한 제어 서버는 도 6에 도시된 기기뿐만 아니라 다양한 기기와 연결될 수 있다. 예를 들어 B 호텔 의 제어 서버는 301호 객실 내 기기, 302호 객실 내 기기, 302호 객실의 화장실에 설치된 기기, 302호 객 실의 거실에 설치된 기기, 302호 객실의 거실에 설치된 에어컨, 302호 객실의 거실에 설치된 조명 기구와 연결 될 수 있다. 따라서 서비스 코어 서버는 수신된 제1 기기 제어 요청을 이용하여 기기(제어 대상 기기)의 식별 정보를 획득하고, 기기의 식별 정보를 이용하여 서비스 데이터베이스를 검색함으로써 기기 정보(기기와 연결하기 위한 경로 정보)를 획득할 수 있다(S615, 620). 한편 기기 정보가 획득되면, 서비스 코어 서버는 서비스 게이트웨이를 통하여 제어 서버에 기기 상태 요청을 전송할 수 있다(S420, S625). 여기서 기기 상태 요청은 제어 목표 값을 포함하여 제어 서버에 제어를 요청하는 것이 아니다. 구체적으로 기기 상태 요청은 현재 제어 서버에서 보유하고 있는 기기의 상태 값을 확인하기 위한 요청일 수 있 다. 한편 기기 상태 요청은, 서비스 서버의 서비스 게이트웨이를 통하여 제어 서버에 전달될 수 있 다(S630). 또한 기기 상태 요청은 제어 서버의 기기 제어 게이트웨이를 통하여 기기 제어 서버 에 전달될 수 있다(S635). 한편 제어 서버는 현재의 기기의 기기 상태 값을 보유 및 관리할 수 있다. 그리고 기기 제어 서버 는 현재의 기기의 기기 상태 값을 검색하고, 검색된 기기 상태 값을 포함하는 기기 상태 응답을 생성 하여 전송할 수 있다(S640). 이 경우 기기 상태 응답은, 기기 제어 게이트웨이, 서비스 게이트웨이를 통하여 서비스 코어 서버 에 전달될 수 있다(S640, S645, S650). 한편 서비스 코어 서버는 제어 서버로부터, 서비스 게이트웨이를 통하여, 기기 상태 요청에 상 응하는 기기 상태 응답을 수신할 수 있다(S430, S650). 그리고 기기 상태 응답이 수신되면, 서비스 코어 서버는 기기 상태 응답에 기초하여 기기 상태 메시지를 생성하고, 생성된 기기 상태 메시지를 고객용 단말에 전송할 수 있다(S440, S655, S660). 여기서 기기 상태 메 시지는 기기 상태 밸리데이션(validation)이라는 용어와 혼용되어 사용될 수 있다. 한편 기기 상태 메시지는, 상태 변경 필요 메시지 및 상태 변경 불요 메시지를 포함할 수 있다. 먼저 상태 변경 불요 메시지에 대하여 설명한다. 서비스 서버에서 보유하고 있는 기기 상태 값이 제어 서버에서 보유하고 있는 기기 상태 값과 상이한 경우가 발생할 수 있다. 구체적으로 제어 서버는 서비스 서버와 기기 상태값을 주기적으로 공유할 수 있는데, 공유 주기 사이 에 기기 상태값이 변경될 수 있다. 예를 들어 서비스 서버는 조명 온이라는 상태 값을 보유하고 있는 상태인데, 실제로는 조명 기기의 고장 또는 사용자의 직접 조작으로 인하여 조명 기기가 오프되었고 이에 따라 제어 서버는 조명 오프라는 상태 값을 보유하고 있는 상태이다. 다만 조명 오프라는 상태 값은 공유 주기가 되어야 서비스 서버에 통보되기 때문에, 공유 주기가 도달하기 전까지는 서비스 서버에서 보유하고 있는 상태 값과 제어 서버에서 보 유하고 있는 상태 값 간에 불일치가 발생할 수 있다. 그리고 이와 같은 경우 에러가 발생할 수 있다. 예를 들어 서비스 서버는 조명 온이라는 상태 값을 보유하 고 있고 이에 따라 사용자는 조명 오프라는 제어 명령을 입력하였으나 실제 조명 기기는 조명 오프 상태인 경우, 사용자의 제어 명령이 수행될 수 없기 때문에 에러가 발생하게 된다. 따라서 제어 서버로부터 수신된 기기 상태 응답에 포함되는 기기 상태 값이 서비스 서버에서 보유한 기기 상태 값과 다른 경우, 서비스 코어 서버는 기기를 제어할 필요가 없음을 나타내는 상태 변경 불요 메 시지를 고객용 단말에 전송할 수 있다.다음은 상태 변경 필요 메시지에 대하여 설명한다. 서비스 서버에서 보유하고 있는 기기 상태 값이 제어 서버에서 보유하고 있는 기기 상태 값과 일치하 는 경우에는, 고객이 입력한 제어 명령이 그대로 수행되면 된다. 예를 들어 서비스 서버는 에어컨의 설정 온도가 25도라는 상태 값을 보유하고 있고 이에 따라 사용자는 설 정 온도를 24도로 변경하라는 제어 명령을 입력하였으며 실제 에어컨의 설정 온도가 25도인 경우, 고객이 입력 한 제어 명령이 그대로 수행되면 된다. 따라서 제어 서버로부터 수신된 기기 상태 응답에 포함되는 기기 상태 값이 서비스 서버에서 보유한 기기 상태 값과 일치하는 경우, 서비스 코어 서버는 상태 변경 필요 메시지를 고객용 단말에 전송할 수 있다. 한편 고객용 단말은 제1 타이머가 동작을 시작한 후 제1 시간 이내에 서비스 서버로부터 기기 상태 메시지가 수신되는지 결정할 수 있다(S520). 먼저 제1 시간 이내에 기기 상태 메시지가 수신되지 않은 상황에 대하여 설명한다. 서비스 서버, 제어 서버, 기기 등에 고장, 연동 실패, 처리 지연, 트래픽 증가 등이 발생하는 경우, 서비스 서버는 제1 타이머가 동작을 시작한 후 제1 시간 이내에 기기 상태 메시지를 전송하지 못할 수 있다. 그리고 고객용 단말은 제1 타이머가 동작을 시작한 후 제1 시간 이내에 서비스 서버로부터 기기 상태 메시지가 수신되는지 결정하고(S520), 제1 시간 이내에 기기 상태 메시지가 수신되지 않으면 에러 정보를 출력 할 수 있다(S530). 예를 들어 고객용 단말은 “기기 제어가 실패하였습니다”라는 정보를 출력할 수 있다. 다음은 제1 시간 이내에 기기 상태 메시지가 수신된 상황에 대하여 설명한다. 고객용 단말는 서비스 서버로부터 기기 상태 메시지(상태 변경 필요 메시지 또는 상태 변경 불요 메 시지)를 수신할 수 있다(S660). 또한 제1 타이머가 동작을 시작한 후 제1 시간 이내에 서비스 서버로부터 기기 상태 메시지가 수신되면 (S520), 고객용 단말은 수신된 기기 상태 메시지가 상태 변경 필요 메시지인지 상태 변경 불요 메시지인지 판단할 수 있다(S540). 그리고 수신된 기기 상태 메시지가 상태 변경 불요 메시지인 경우, 고객용 단말은 기기를 제어할 필요가 없음을 나타내는 상태 변경 불요 정보를 출력할 수 있다(S550). 예를 들어 고객이 조명 오프의 제어 명령을 입력한 경우, 고객용 단말은 “이미 조명이 꺼져 있습니다”라 는 정보를 출력할 수 있다. 한편 수신된 기기 상태 메시지가 상태 변경 필요 메시지인 경우, 고객용 단말은 제2 타이머를 동작시킬 수 있다(S560). 제2 타이머의 시작 조건 및 종료 조건은 다음과 같다. 표 2 제2 타이머 (T2) 시작 조건 종료 조건 기기 상태 메시지(기기 상태 변경 필요 메시지) 수 신갱신 기기 상태 메시지 수신 즉 제2 타이머는 기기 상태 메시지(기기 상태 변경 필요 메시지)가 수신되는 것과 함께 동작을 시작할 수 있다. 또한 제2 타이머는 서비스 서버로부터 갱신 기기 상태 메시지가 푸시 메시지로 수신되는 것과 함께 동작을 중단할 수 있다.한편 제2 타이머는 갱신 기기 상태 메시지가 수신되는 경우 외에도, 제2 타이머가 동작을 시작 하고 제2 시간이 경과하면 동작을 중단할 수 있다. 여기서 제2 시간은 고객용 단말을 사용하는 고객이 제어를 요청한 후 무한정 대기할 수 없기 때문에 설정 된 시간이다. 구체적으로 기기 상태 응답에 포함되는 기기 상태 값이 서비스 서버에서 보유한 기기 상태 값과일치하게 되면, 서비스 서버는 제2 기기 제어 요청을 제어 서버에 전송하고, 고객용 단말은 제2 타이머를 동작시킨다. 다만 제2 기기 제어를 요청한 후에도 고장, 연동 실패, 처리 지연, 트래픽 증가 등으로 인한 에러가 발생할 수 있으며, 이렇게 에러가 발생된 경우에는 고객에게 갱신 기기 상태 메시지(제어 결과)를 전달할 수 없기 때문에 고객이 제어가 다 되기를 기다리면서 무한정 대기하는 사태가 발생할 수 있다. 따라서 기기 상태 메시지가 수신된 후 갱신 기기 상태 메시지가 수신되지 않은 상태에서 제2 시간이 경과하면, 고객용 단말은 고객에게 에러 정보를 출력하게 된다. 이와 관련해서는 이후에 상세히 설명하도록 한다. 다음은 다시 서비스 서버의 동작으로 돌아간다. 제어 서버로부터 기기 상태 요청에 상응하는 기기 상태 응답이 수신되면, 서비스 코어 서버는 기기 상태 응답에 기초하여 제2 기기 제어 요청을 제어 서버에 전송할 수 있다(S450, S665). 구체적으로 서비스 서버에서 보유하고 있는 기기 상태 값이 제어 서버에서 보유하고 있는 기기 상태 값과 일치하는 경우에는, 고객이 입력한 제어 명령이 그대로 수행되면 된다. 따라서 서비스 서버에서 보유 하고 있는 기기 상태 값이 제어 서버에서 보유하고 있는 기기 상태 값과 일치하면, 서비스 코어 서버(22 0)는 제2 기기 제어 요청을 제어 서버에 전송할 수 있다. 여기서 제2 기기 제어 요청은, 앞서 고객용 단말로부터 수신된 제1 기기 제어 요청에 기반하여 생성될 수 있다. 구체적으로 제1 기기 제어 요청에는 목표 제어 값(예를 들어 고객이 조명 오프의 명령을 입력한 경우 “ 조명 오프”, 고객이 설정 온도 25도의 명령을 입력한 경우 “25도”)이 포함될 수 있다. 그리고 서비스 코어 서버는 목표 제어 값을 포함하는 제2 기기 제어 요청을 생성하여 제어 서버에 전송할 수 있다. 제2 기기 제어 요청은, 서비스 게이트웨이, 기기 제어 게이트웨이를 통하여 기기 제어 서버에 전달될 수 있다(S665, S670, S685). 한편 제2 기기 제어 요청이 수신되는 경우, 기기 제어 게이트웨이는 기기 제어 요청 수신 응답을 서비스 서버에 전송할 수 있다(S675). 여기서 기기 제어 요청 수신 응답은 해당 요청을 정상 수신하였다는 의미의 응답으로, 동작 완료 응답은 별도로 서비스 서버에 전달될 수 있다. 한편 기기 제어 서버는 제2 기기 제어 요청을 기기에 전송할 수 있다(S690). 이 경우 기기는 제 2 기기 제어 요청에 기초하여 제어를 수행하고, 제어 결과(변경된 기기 상태 값)를 포함하는 기기 상태 리포트 를 제어 서버에 전송할 수 있다(S695). 이 경우 기기 제어 서버는 기기 상태 리포트를 서비스 서버에 전송할 수 있다(S700). 그리고 기기 상태 리포트는, 기기 제어 게이트웨이, 서비스 게이트웨이를 통하여 서비스 코어 서버 에 전달될 수 있다(S700, S705, S710). 한편 서비스 코어 서버는 제2 기기 제어 요청에 의해 제어된 기기의 기기 상태 리포트를 제어 서버 로부터 수신하고, 기기 상태 리포트에 기초하여 기기 상태 정보를 갱신할 수 있다(S715, S720). 구체적으로 서비스 데이터베이스에는 제2 기기 제어 요청에 의해 제어되기 전의 기기의 기기 상태 정 보가 저장되어 있다. 그리고 서비스 코어 서버는 수신된 기기 상태 리포트를 이용하여 기존의 기기 상태 정보를 제2 기기 제어 요청에 의해 제어된 이후의 기기의 기기 상태 정보로 변경할 수 있다. 한편 서비스 코어 서버는 갱신된 기기 상태 정보를 포함하는 갱신 기기 상태 메시지를 고객용 단말에 전송할 수 있다. 이 경우 서비스 코어 서버는 갱신 기기 상태 메시지를 푸시 메시지로 고객용 단말에 전송할 수 있다(S470, S725, S730). 구체적으로 서비스 코어 서버는, 단순히 서비스 데이터베이스의 기기 상태 정보를 갱신하는 것을 넘 어, 그리고 고객용 단말에서 기기 상태 변경을 확인하기 위하여 폴링을 하는 것 없이도, 갱신된 기기 상태 정보를 포함하는 갱신 기기 상태 메시지를 푸시(Push) 메시지의 형태로 고객용 단말에 전송할 수 있다. 한편 고객용 단말은 제2 타이머가 동작을 시작한 후 제2 시간 이내에 서비스 서버로부터 갱신 기기 상태 메시지가 수신되는지 결정할 수 있다(S570). 먼저 제2 시간 이내에 갱신 기기 상태 메시지가 수신된 상황에 대하여 설명한다. 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되면, 고객용 단말은 수신 된 갱신 기기 상태 메시지에 기초하여 갱신된 기기 상태 정보(제어 결과)를 출력할 수 있다(S580). 예를 들어 고객용 단말은 “25도”라고 표시되는 UI 또는 “조명 off”라고 표시되는 UI를 디스플레이 할 수 있다. 다른 예를 들어 고객용 단말은 “조명을 껐습니다”, “온도를 25도로 설정하였습니다”. 등의 갱신된 기기 상태 정보를 출력할 수 있다. 또한 갱신된 기기 상태 정보는, 반드시 제어에 의해 변경된 상태 값을 의미하는 것이 아니라, 제어의 성공 여부 를 의미할 수도 있다. 예를 들어 고객용 단말은 “제어를 성공적으로 수행하였습니다”라는 정보를 출력할 수도 있다. 또한 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되면, 고객용 단말은 제2 타이머를 종료시킬 수 있다. 다음은 제2 시간 이내에 갱신 기기 상태 메시지가 수신되지 않은 상황에 대하여 설명한다. 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 메시지가 수신되지 않으면, 고객용 단말 은 서비스 서버에 상태 요청 메시지를 전송할 수 있다(S590). 이 경우 서비스 코어 서버는 서비스 게이트웨이를 통하여 상태 요청 메시지를 수신할 수 있다. 또한 상태 요청 메시지가 수신되면, 서비스 코어 서버는 갱신된 기기 상태 정보를 획득하고, 갱신된 기기 상태 정보를 고객용 단말에 전송할 수 있다(S480). 구체적으로 서비스 서버, 제어 서버, 기기 등에 고장, 연동 실패, 처리 지연, 트래픽 증가 등이 발생하는 경우, 서비스 서버는 제2 타이머가 동작을 시작한 후 제2 시간 이내에 갱신 기기 상태 정보를 전 송하지 못할 수 있다. 따라서 고객용 단말로부터 상태 요청 메시지가 수신되면, 서비스 코어 서버는 제어 서버에 상태 요청을 전송할 수 있다. 이 경우 기기 제어 서버는 기기의 기기 상태 값을 포함하는 기기 상태 응답 또는 기기 상태 리포트를 서비스 서버에 전송할 수 있다. 이 경우 서비스 코어 서버는 기기 상태 응답 또는 기기 상태 리포트를 이용하여 서비스 데이터베이스(23 0)의 기기 상태 정보를 갱신하고, 갱신된 기기 상태 정보를 포함하는 갱신 기기 상태 메시지를 고객용 단말에 푸시 메시지의 형태로 전송할 수 있다(S480). 이 경우 고객용 단말은 수신된 갱신 기기 상태 메시지에 기초하여 갱신된 기기 상태 정보(제어 결과)를 출 력할 수 있다(S595). 한편 서비스 코어 서버가 제어 서버에 상태 요청을 전송했음에도 불구하고, 서비스 코어 서버는 제어 서버로부터 아무런 응답을 수신하지 못할 수 있다. 이 경우 서비스 코어 서버는 고객용 단말 에 응답 불가 정보를 전송할 수 있다. 한편 응답 불가 정보가 수신되거나, 기 설정된 시간 이내에 상태 요청 메시지에 대응하는 응답이 수신되지 않는 경우, 고객용 단말은 최종 에러 처리를 수행하고, 에러 정보를 출력할 수 있다. 이와 같이 본 발명에 따르면, 주택, 호텔 등의 정주형 건물에 설치된 기기를 고객용 단말로 원격제어를 하는 과 정에서, 기기에 인접해 있는 사용자에게 응답하는 시간을 단축시킴으로써, 고객의 니즈를 충족시키고 고객의 편 의성을 증대시킬 수 있는 장점이 있다. 또한 사업자의 입장에서는, 원격제어 실패 시 발생하는 고객의 불만 접수를 감소시키고, 네트워크, 단말 및 서 버의 처리 부하를 절감할 수 있는 장점이 있다. 또한 본 발명에 따르면, 고객의 제1 기기 제어 요청으로부터 고객에게 제어 결과를 전달하기까지의 시간을 이원 화 시킴으로써, 오류 발생율을 감소시키고 고객에게 정보를 빠르게 전달할 수 있는 장점이 있다. 구체적으로 본 발명에서, 제1 타이머에 해당하는 제1 시간은, 기기의 현재 상태 값을 파악하고 기기 제어의 필 요성을 판단하여 고객에게 제공하는 구간이다. 그리고 기기의 현재 상태 값을 파악하여 고객에게 제공하는 것은, 기기에 제어를 요청하고 제어 완료 후 제어 결과를 고객에게 제공하는 것에 비하여 훨씬 적은 시간이 소 요되기 때문에, 제1 타이머에 해당하는 제1 시간은 짧게 설정될 수 있다. 따라서 에러 처리를 빠르게 수행하거 나, 제어를 수행할 필요가 없다는 정보를 사용자에게 빠르게 제공할 수 있는 장점이 있다.또한 본 발명에 따르면, 현재 상태 값을 먼저 파악한 후 제어를 수행하기 때문에, 제어 실패에 따른 에러 처리 를 최소화 할 수 있는 장점이 있다. 또한 고객의 제1 기기 제어 요청으로부터 고객에게 제어 결과를 전달하기까지의 시간은 제1 타이머에 해당하는 제1 시간 및 제2 타이머에 해당하는 제2 시간으로 구분되며, 타이머의 만료 여부도 제1 타이머와 제2 타이머에 각각에 대해서 별도로 판단하기 때문에, 고객용 단말에서 응답 대기를 하는 시간 및 타이머가 만료되는 상황을 줄일 수 있는 장점이 있다. 또한 본 발명에 따르면, 서비스 서버는 고객용 단말로부터 제1 기기 제어 요청을 수신하면 곧바로 제2 기기 제 어 요청을 제어 서버에 전송하는 것이 아니라, 기기의 현재 상태 값을 먼저 파악한 후 제어가 가능하거나 제어 의 필요성이 있는 경우에 제2 기기 제어 요청을 제어 서버에 전송한다. 따라서 네트워크 트래픽과 서버의 처리 부하를 감소시킬 수 있는 장점이 있다. 또한 본 발명에 따르면, 서비스 서버는 갱신 기기 상태 메시지를 푸시 메시지의 형태로 고객용 단말에 전송한다. 즉 고객용 단말에서는 폴링을 수행하지 않아도 되기 때문에, 네트워크 트래픽을 줄일 수 있는 장점이 있다. 또한 본 발명에 따르면, 갱신 기기 상태 메시지가 고객용 단말에 전달되지 않은 경우, 고객용 단말은 곧바로 에 러 처리를 하는 것이 아니라 서비스 서버에 상태 요청 메시지를 전송하여 제어 결과를 확인한다. 그리고 상태 요청 메시지가 전송되었음에도 불구하고 제어 결과가 확인되지 않는 상황에서 최종적으로 에러 처리를 하기 때 문에, 에러의 발생율을 줄일 수 있는 장점이 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다. 또한, 상기 컴 퓨터는 제어부를 포함할 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하 고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2022-0181812", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 고객용 단말을 이용한 기기 제어 시스템을 설명하기 위한 도면이다. 도 2는 동기 방식을 통한 기기 제어 시스템을 도시한 도면이다. 도 3은 비동기 폴링 방식을 통한 기기 제어 시스템을 도시한 도면이다. 도 4는 본 발명에 따른 서비스 서버의 동작을 설명하기 위한 순서도이다. 도 5는 본 발명에 따른 고객용 단말의 동작 방법을 설명하기 위한 도면이다. 도 6은 원격 제어 시스템의 동작을 설명하기 위한 상세 순서도이다."}
