{"patent_id": "10-2024-7033599", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0156419", "출원번호": "10-2024-7033599", "발명의 명칭": "가상 학습 시스템을 구현하기 위한 방법 및 장치, 저장 매체, 및 전자 디바이스", "출원인": "텐센트 테크놀로지", "발명자": "쿵, 리밍"}}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 디바이스에 의해 실행되는 가상 학습 시스템을 구현하기 위한 방법으로서, 상기 방법은:제1 사용자 인터페이스에서 착석 버튼에 대해 제1 사용자에 의해 트리거된 착석 요청에 응답하여, 매칭 예상 정보를 설정하도록 구성된 설정 인터페이스를 디스플레이하는 단계- 상기 제1 사용자 인터페이스는 가상 학습 시스템에 의해 제공되는 가상 학습 공간과 연관되고, 상기 가상 학습 공간은 적어도 2개의 가상 객체에 바인딩되도록 허용하는 가상 다중-사용자 좌석을 포함함 -;상기 설정 인터페이스 상에서 상기 제1 사용자에 의해 입력된 매칭 예상 정보를 획득하고, 상기 제1 사용자에의해 설정된 상기 매칭 예상 정보와 매칭되는 적어도 한 명의 제2 사용자에 관한 정보를 획득하는 단계- 상기적어도 한 명의 제2 사용자는 상기 가상 학습 공간과 연관된 후보 사용자들로부터 검색되고 상기 제1 사용자에의해 입력된 상기 매칭 예상 정보와 매칭됨 -; 및상기 적어도 한 명의 제2 사용자에 관한 상기 획득된 정보에 응답하여, 상기 제1 사용자에 대응하는 제1 가상객체 및 상기 적어도 한 명의 제2 사용자에 대응하는 적어도 하나의 제2 가상 객체를 포함하는 제2 사용자 인터페이스를 생성 및 출력하는 단계- 상기 제1 가상 객체 및 상기 적어도 하나의 제2 가상 객체 양측 모두는 제1가상 다중-사용자 좌석에 바인딩됨 -를 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제2 사용자 인터페이스는:상기 제1 가상 객체 및 상기 적어도 하나의 제2 가상 객체가 상기 제1 가상 다중-사용자 좌석에 공동으로 바인딩되었던 지속기간;상기 제1 가상 객체가 임의의 가상 다중-사용자 좌석에 단독으로 바인딩되었던 지속기간;상기 적어도 하나의 제2 가상 객체 각각이 임의의 가상 다중-사용자 좌석에 단독으로 각각 바인딩되었던 지속기간;상기 가상 학습 공간 내의 상기 제1 가상 객체의 이력 정보; 및상기 가상 학습 공간 내의 상기 적어도 하나의 제2 가상 객체의 이력 정보 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 제2 사용자 인터페이스는:상기 제1 가상 객체와 상기 적어도 하나의 제2 가상 객체 간의 상호작용 정보; 및상기 상호작용 정보의 생성을 트리거하도록 구성된 정보 입력 영역 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 정보 입력 영역에서 트리거된 입력 요청에 응답하여, 정보 상호작용 인터페이스를 디스플레이하는 단계-상기 정보 상호작용 인터페이스는 상기 제1 가상 객체와 상기 적어도 하나의 제2 가상 객체 간의 정보 상호작용을 위한 것임 -; 및공개특허 10-2024-0156419-3-상기 정보 상호작용 인터페이스 상에서 트리거된 타깃 정보 전송 요청에 응답하여, 상기 정보 상호작용 인터페이스 상에 상기 타깃 정보를 디스플레이하고, 상기 타깃 정보의 입력 소스를 디스플레이하는 단계- 상기 입력소스는 상기 제1 사용자임 -를 추가로 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 사용자에 의해 설정된 상기 매칭 예상 정보와 매칭되는 상기 적어도 한 명의 제2 사용자에 관한 정보가 획득되지 않는 것에 응답하여, 상기 제1 가상 객체를 포함하는 제3 사용자 인터페이스를 생성 및 출력하는단계- 상기 제1 가상 객체는 제2 가상 다중-사용자 좌석에 단독으로 바인딩됨 -를 추가로 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,제1 프롬프트 라벨을 생성하고, 상기 제1 프롬프트 라벨을 상기 제2 가상 다중-사용자 좌석과 연관된 영역에 디스플레이하는 단계- 상기 제1 프롬프트 라벨은 상기 제1 사용자에 의해 설정된 상기 매칭 예상 정보를 디스플레이하도록 구성됨 -;제2 프롬프트 라벨을 생성하고, 상기 제2 프롬프트 라벨을 상기 제2 가상 다중-사용자 좌석과 연관된 영역에 디스플레이하는 단계- 상기 제2 프롬프트 라벨은 상기 제1 사용자의 연관된 신원 정보를 디스플레이하도록 구성됨-; 및제3 프롬프트 라벨을 생성하고, 상기 제3 프롬프트 라벨을 상기 제2 가상 다중-사용자 좌석과 연관된 영역에 디스플레이하는 단계- 상기 제3 프롬프트 라벨은 상기 제1 사용자에 의해 입력된 예상된 신원 정보를 디스플레이하도록 구성되고, 상기 예상된 신원 정보는 상기 제2 가상 다중-사용자 좌석 내의 상기 제1 가상 객체와 함께착석할 것으로 상기 제1 사용자에 의해 예상된 가상 객체에 대응하는 신원 정보임 - 중 적어도 하나를 추가로포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,제3 가상 객체가 상기 제2 가상 다중-사용자 좌석에 바인딩되는 것에 응답하여, 상기 제1 가상 객체 및 상기 제3 가상 객체를 포함하는 제4 사용자 인터페이스를 생성 및 출력하는 단계- 상기 제1 가상 객체 및 상기 제3 가상 객체는 상기 제2 가상 다중-사용자 좌석에 공동으로 바인딩됨 -;상기 제2 가상 다중-사용자 좌석에 바인딩되도록 요청하기 위한 제4 가상 객체로부터의 요청을 수신하고, 상기제1 사용자가 상기 제4 가상 객체로부터의 요청을 수락하도록 지시하는 것에 응답하여, 상기 제1 가상 객체 및상기 제4 가상 객체를 포함하는 제5 사용자 인터페이스를 생성 및 출력하는 단계- 상기 제1 가상 객체 및 상기제4 가상 객체는 상기 제2 가상 다중-사용자 좌석에 공동으로 바인딩됨 -; 및상기 제2 가상 다중-사용자 좌석에 바인딩되도록 요청하기 위한 상기 제5 가상 객체로부터의 요청을 수신하고,상기 제5 가상 객체의 매칭 예상 정보와 상기 제1 사용자에 의해 설정된 상기 매칭 예상 정보 사이의 정보 유사도가 미리 설정된 제1 임계값 이상인 것에 응답하여, 상기 제1 가상 객체 및 상기 제5 가상 객체를 포함하는 제6 사용자 인터페이스를 생성 및 출력하는 단계- 상기 제1 가상 객체와 상기 제5 가상 객체는 상기 제2 가상 다중-사용자 좌석에 공동으로 바인딩됨 -중 어느 하나를 추가로 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 제3 사용자 인터페이스는 좌석 공유 버튼을 추가로 포함하고, 상기 방법은:상기 좌석 공유 버튼에 대해 트리거된 좌석 공유 요청에 응답하여, 적어도 한 명의 후보 사용자를 디스플레이하는 단계;상기 적어도 한 명의 후보 사용자 중 타깃 후보 사용자에 대해 트리거된 공유 요청에 응답하여, 상기 타깃 후보사용자와 연관된 단말기에 좌석 공유 정보를 송신하는 단계- 상기 좌석 공유 정보는 상기 타깃 후보 사용자를공개특허 10-2024-0156419-4-상기 제2 가상 다중-사용자 좌석 내의 상기 제1 가상 객체와 함께 착석하게 초청하도록 구성됨 -; 및상기 타깃 후보 사용자와 연관된 상기 단말기에 의해 반환된 요청 피드백 정보를 수신하고, 상기 요청 피드백정보가 상기 타깃 후보 사용자가 상기 공유를 수락한다는 것을 지시하는 것에 응답하여, 상기 제1 가상 객체 및상기 타깃 후보 사용자를 포함하는 제7 사용자 인터페이스를 생성 및 출력하는 단계- 상기 제1 가상 객체 및 상기 타깃 후보 사용자에 대응하는 가상 객체는 상기 제2 가상 다중-사용자 좌석에 공동으로 바인딩됨 -를 추가로포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 설정 인터페이스 상에 적어도 2개의 후보 라벨이 디스플레이되고, 상기 방법은:상기 적어도 2개의 후보 라벨 중 타깃 후보 라벨에 대해 트리거된 선택 요청에 응답하여, 상기 타깃 후보 라벨에 대응하는 예상 정보를 상기 제1 사용자에 의해 설정된 상기 매칭 예상 정보로서 결정하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 제1 사용자에 의해 설정된 상기 매칭 예상 정보는 제1 예상 정보와 제2 예상 정보를 포함하고, 상기 설정인터페이스는 입력 영역을 추가로 포함하고,상기 방법은:적어도 2개의 후보 라벨 중 타깃 후보 라벨에 대해 트리거된 선택 요청에 응답하여, 상기 타깃 후보 라벨에 대응하는 예상 정보를 상기 제1 사용자에 의해 설정된 상기 제1 예상 정보로서 결정하는 단계; 및상기 입력 영역에 대해 트리거된 정보 입력 요청에 응답하여, 매칭 기준 정보를 획득하고, 상기 매칭 기준 정보를 상기 제1 사용자에 의해 설정된 상기 제2 예상 정보로서 결정하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 가상 학습 공간과 연관된 복수의 후보 사용자는:상기 가상 학습 공간에서 온라인 상태에 있는 사용자; 및오프라인 상태에 있고 상기 가상 학습 공간에서 오프라인 매칭 조건을 충족하는 사용자 중 적어도 한 명을 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 오프라인 매칭 조건은:상기 가상 학습 공간에서의 마지막 온라인 시간과 현재 시간 사이의 간격이 미리 설정된 제3 임계값보다 작은것을 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 적어도 한 명의 제2 사용자가 상기 오프라인 상태에 있는 사용자를 포함한다는 것에 응답하여, 상기 방법은:상기 오프라인 상태에 있는 사용자와 연관된 단말기에 착석 초청 정보를 송신하는 단계- 상기 착석 초청 정보는상기 오프라인 상태에 있는 사용자가 상기 가상 다중-사용자 좌석 내의 상기 제1 가상 객체와 함께 착석하게 초청하도록 구성됨 -; 및공개특허 10-2024-0156419-5-상기 오프라인 상태에 있는 사용자와 연관된 상기 단말기에 의해 반환된 요청 피드백 정보를 수신하고, 상기 요청 피드백 정보가 상기 오프라인 상태에 있는 사용자가 상기 초청을 수락한다는 것을 지시하는 것에 응답하여,상기 제2 사용자 인터페이스를 생성 및 출력하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항 내지 제13항 중 어느 한 항에 있어서, 상기 가상 학습 공간과 연관된 상기 제1 사용자 인터페이스 상에 상기 착석 버튼을 디스플레이하는 것은:상기 제1 사용자 인터페이스 상에 제1 착석 버튼을 디스플레이하는 것- 상기 제1 착석 버튼은 상기 가상 학습공간에서의 임의의 가상 다중-사용자 좌석에 대한 착석 요청을 트리거하도록 구성됨 -; 및상기 제1 사용자 인터페이스 상에서, 각각의 가상 다중-사용자 좌석과 연관된 영역에 제2 착석 버튼을 디스플레이하는 것- 상기 제2 착석 버튼은 상기 제2 착석 버튼에 대응하는 가상 다중-사용자 좌석에 대한 착석 요청을트리거하도록 구성됨 -을 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제13항 중 어느 한 항에 있어서,메인 인터페이스를 생성 및 출력하고, 상기 메인 인터페이스 상에 가상-학습-공간 식별자를 디스플레이하는 단계- 가상-학습-공간 식별자는 가상 학습 공간에 진입하기 위한 트리거 식별자임 -; 및상기 가상 학습 공간의 상기 트리거 식별자에 대해 수행된 선택 조작에 응답하여, 상기 제1 사용자 인터페이스를 생성 및 출력하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "가상 학습 시스템을 구현하기 위한 장치로서, 상기 장치는:제1 사용자 인터페이스에서 착석 버튼에 대해 제1 사용자에 의해 트리거된 착석 요청에 응답하여, 매칭 예상 정보를 설정하도록 구성된 설정 인터페이스를 디스플레이하도록 구성된 제1 처리 유닛- 상기 제1 사용자 인터페이스는 가상 학습 시스템에 의해 제공되는 가상 학습 공간과 연관되고, 상기 가상 학습 공간은 적어도 2개의 가상객체에 바인딩되도록 허용하는 가상 다중-사용자 좌석을 포함함 -;상기 설정 인터페이스 상에서 상기 제1 사용자에 의해 입력된 매칭 예상 정보를 획득하고, 상기 제1 사용자에의해 설정된 상기 매칭 예상 정보와 매칭되는 적어도 한 명의 제2 사용자에 관한 정보를 획득하도록 구성된 제1획득 유닛- 상기 적어도 한 명의 제2 사용자는 상기 가상 학습 공간과 연관된 후보 사용자들로부터 검색되고 상기 제1 사용자에 의해 입력된 상기 매칭 예상 정보와 매칭됨 -; 및상기 적어도 한 명의 제2 사용자에 관한 상기 획득된 정보에 응답하여, 상기 제1 사용자에 대응하는 제1 가상객체 및 상기 적어도 한 명의 제2 사용자에 대응하는 적어도 하나의 제2 가상 객체를 포함하는 제2 사용자 인터페이스를 생성 및 출력하도록 구성된 제2 처리 유닛- 상기 제1 가상 객체 및 상기 적어도 하나의 제2 가상 객체양측 모두는 제1 가상 다중-사용자 좌석에 바인딩됨 -을 포함하는 장치."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "저장된 컴퓨터 프로그램을 포함하는 컴퓨터 판독가능 저장 매체로서, 상기 프로그램은, 단말 디바이스 또는 컴퓨터에 의해 실행될 때, 제1항 내지 제15항 중 어느 한 항에 따른 방법을 수행하는 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2024-7033599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "컴퓨터 프로그램들/명령어들을 포함하는 컴퓨터 프로그램 제품으로서, 상기 컴퓨터 프로그램들/명령어들은, 프로세서에 의해 실행될 때, 제1항 내지 제15항 중 어느 한 항에 따른 방법의 동작들을 수행하는 컴퓨터 프로그램 제품.공개특허 10-2024-0156419-6-청구항 19 메모리 및 프로세서를 포함하는 전자 디바이스로서, 상기 메모리는 그 안에 저장된 컴퓨터 프로그램을 갖고, 상기 프로세서는 상기 컴퓨터 프로그램을 통해 제1항내지 제15항 중 어느 한 항에 따른 방법을 수행하도록 구성되는 전자 디바이스."}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 인공 지능 시나리오들에 적용될 수 있고, 특히 자연어 처리와 같은 기술들에 관련될 수 있다. 가상 학습 시스템을 구현하기 위한 방법 및 장치와, 저장 매체 및 전자 디바이스가 개시된다. 본 방법은: 제1 사용자 인터페이스에서 착석 버튼에 관하여 제1 사용자에 의해 트리거되는 착석 요청에 응답하여, 매칭 예상 정보를 설 (뒷면에 계속)"}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 2022년 10월 20일자로 중국 지적 재산권 관리국에 출원되고 발명의 명칭이 \"METHOD AND APPARATUS FOR DISPLAYING INFORMATION OF VIRTUAL SELF-LEARNING ROOM, STORAGE MEDIUM, AND ELECTRONIC DEVICE\"인 중 국 특허 출원 제202211289111.X호에 대한 우선권을 주장하며, 그 전체가 본 명세서에 참고로 포함된다. 본 출원은 컴퓨터 분야에 관한 것으로, 구체적으로는, 가상 학습 시스템을 구현하기 위한 방법 및 장치, 저장 매체, 및 전자 디바이스에 관한 것이다."}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능 기술의 연구 및 진보로, 인공 지능 기술은 일반 스마트 홈, 스마트 웨어러블 디바이스, 가상 비서, 스마트 스피커, 스마트 마케팅, 무인 운전, 자동 운전, 무인 항공기, 로봇, 스마트 의료, 및 스마트 고객 서비 스와 같은 복수의 분야에서 연구되고 이들에 적용된다. 기술의 발달로, 인공 지능 기술은 더 많은 분야에 적용 될 것이고, 점점 더 중요한 역할을 할 것이다. 가상 학습 시스템, 예를 들어, 가상 자율-학습 룸 시스템은 가상 자율-학습 룸이라고도 지칭되고, 컴퓨터 네트 워크 상에서 멀티미디어 통신 기술을 사용하여 구축된 학습 환경을 지칭하며, 상이한 위치들에 있는 학생들이 학습 활동들을 수행할 수 있도록 허용한다. 예를 들어, 가상 자율-학습 룸의 시나리오에서, 사용자는 온라인으 로 자율-학습을 완료할 수 있다."}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시내용의 실시예들은 가상 학습 시스템을 구현하기 위한 방법 및 장치, 저장 매체, 및 전자 디바이스를 제 공하여, 상이한 위치들에 있는 상이한 사용자들이 가상 학습 시스템을 사용하여 온라인 학습 활동들을 구현할 수 있게 함으로써, 상호작용 효율을 향상시킨다."}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시내용의 실시예들의 양태에 따르면, 가상 학습 시스템을 구현하기 위한 방법이 제공되고, 본 방법은: 제1 사용자 인터페이스 상에서 착석 버튼에 대해 제1 사용자에 의해 트리거된 착석 요청에 응답하여, 매칭 예상 정보를 설정하도록 구성된 설정 인터페이스를 디스플레이하는 단계- 제1 사용자 인터페이스는 가상 학습 시스템 에 의해 제공되는 가상 학습 공간과 연관된 사용자 인터페이스이고, 가상 학습 공간은 적어도 2개의 가상 객체 에 바인딩되도록 허용하는 가상 다중-사용자 좌석을 포함함 -; 설정 인터페이스 상에서 제1 사용자에 의해 입력된 매칭 예상 정보를 획득하고, 제1 사용자에 의해 설정된 매칭 예상 정보에 매칭되는 적어도 한 명의 제2 사용자에 관한 정보를 획득하는 단계- 적어도 한 명의 제2 사용자는 가상 학습 공간과 연관된 후보 사용자들로부터 검색되고 제1 사용자에 의해 입력된 매칭 예상 정보에 매칭되는 사용자임 -; 및 적어도 한 명의 제2 사용자에 관한 획득된 정보에 응답하여, 제1 사용자에 대응하는 제1 가상 객체 및 적어도 한 명의 제2 사용자에 대응하는 적어도 하나의 제2 가상 객체를 포함하는 제2 사용자 인터페이스를 생성 및 출 력하는 단계- 제1 가상 객체 및 적어도 하나의 제2 가상 객체 양측 모두는 제1 가상 다중-사용자 좌석에 바인딩 됨 -를 포함한다. 본 개시내용의 실시예들의 다른 양태에 따르면, 가상 학습 시스템을 구현하기 위한 장치가 제공되고, 본 장치는: 제1 사용자 인터페이스 상에서 착석 버튼에 대해 제1 사용자에 의해 트리거된 착석 요청에 응답하여, 매칭 예상 정보를 설정하도록 구성된 설정 인터페이스를 디스플레이하도록 구성된 제1 처리 유닛- 제1 사용자 인터페이스 는 가상 학습 시스템에 의해 제공되는 가상 학습 공간과 연관된 사용자 인터페이스이고, 가상 학습 공간은 적어 도 2개의 가상 객체에 바인딩되도록 허용하는 가상 다중-사용자 좌석을 포함함 -; 설정 인터페이스 상에서 제1 사용자에 의해 입력된 매칭 예상 정보를 획득하고, 제1 사용자에 의해 설정된 매칭 예상 정보와 매칭되는 적어도 한 명의 제2 사용자에 관한 정보를 획득하도록 구성된 제1 획득 유닛- 적어도 한 명의 제2 사용자는 가상 학습 공간과 연관된 후보 사용자들로부터 검색되고 제1 사용자에 의해 입력된 매칭 예 상 정보와 매칭되는 사용자임 -; 및 적어도 한 명의 제2 사용자에 관한 획득된 정보에 응답하여, 제1 사용자에 대응하는 제1 가상 객체 및 적어도 한 명의 제2 사용자에 대응하는 적어도 하나의 제2 가상 객체를 포함하는 제2 사용자 인터페이스를 생성 및 출 력하도록 구성된 제2 처리 유닛- 제1 가상 객체 및 적어도 하나의 제2 가상 객체 양측 모두는 제1 가상 다중-사 용자 좌석에 바인딩됨 -을 포함한다. 본 개시내용의 실시예들의 또 다른 양태에 따르면, 컴퓨터 프로그램 제품 또는 컴퓨터 프로그램이 제공된다. 이러한 컴퓨터 프로그램 제품 또는 컴퓨터 프로그램은 컴퓨터 명령어들을 포함하고, 이러한 컴퓨터 명령어들은 컴퓨터 판독가능 저장 매체에 저장된다. 컴퓨터 디바이스의 프로세서는 컴퓨터 판독가능 저장 매체로부터 컴퓨 터 명령어들을 판독하고, 프로세서는 컴퓨터 명령어들을 실행하여, 컴퓨터 디바이스가 가상 학습 시스템을 구현 하기 위한 방법을 수행할 수 있게 한다. 본 개시내용의 실시예들의 또 다른 양태에 따르면, 전자 디바이스가 추가로 제공된다. 이러한 전자 디바이스는 메모리, 프로세서, 및 메모리에 저장되고 프로세서 상에서 실행가능한 컴퓨터 프로그램을 포함한다. 프로세서 는 컴퓨터 프로그램을 통해 가상 학습 시스템을 구현하기 위한 방법을 수행한다."}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 기술분야의 통상의 기술자가 본 개시내용에서의 해결책들을 더 잘 이해하게 하기 위해, 이하는 본 개시내용 의 실시예들에서의 첨부 도면들을 참조하여 본 개시내용의 실시예들에서의 기술적 해결책들을 분명히 그리고 완 전히 설명한다. 명백히, 설명된 실시예들은 본 개시내용의 실시예들의 전부가 아닌 단지 일부일 뿐이다. 본"}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야의 통상의 기술자가 창의적인 노력 없이 본 개시내용의 실시예들에 기초하여 획득한 다른 모든 실시예 들은 본 개시내용의 보호 범위에 속한다. 본 개시내용의 명세서, 청구항들, 및 첨부 도면들에서, \"제1\", \"제2\" 등의 용어들은 유사한 객체를 구별하기 위 해 의도된 것이고 반드시 특정 순서 또는 시퀀스를 지시하는 것은 아니다. 이러한 방식으로 사용되는 데이터는 적절한 경우에 교환될 수 있어서, 본 명세서에 설명된 본 개시내용의 실시예들은 본 명세서에 예시되거나 설명 되는 순서와 다른 순서들로 구현될 수 있다. 또한, 용어들 \"포함하다\", \"갖다\", 및 이들의 임의의 다른 변형들 은 비배타적 포함(non-exclusive inclusion)을 커버하려는 것이다. 예를 들어, 동작들 또는 유닛들의 리스트를 포함하는 프로세스, 방법, 시스템, 제품, 또는 디바이스는 명시적으로 열거된 동작들 또는 유닛들로 제한되지 않고, 명시적으로 열거되지 않거나 프로세스, 방법, 제품, 또는 디바이스에 고유한 다른 동작들 또는 유닛들을 포함할 수 있다. 실시예들에서 제공되는 용어들은 다음과 같이 설명된다. 가상 학습 공간: 가상 학습 공간은 가상 학습 시스템에서 제공되는 가상 학습 영역, 예를 들어, 가상 자율-학습 룸을 지칭한다. 가상 학습 공간은, 컴퓨터 네트워크 상에서 멀티미디어 통신 기술을 사용하여 구축된 학습 환 경으로서, 상이한 위치들에 있는 학생들이 학습 활동들을 수행할 수 있도록 허용한다. 가상 다중-사용자 좌석: 가상 다중-사용자 좌석은 가상 학습 공간(예를 들어, 가상 자율-학습 룸) 내의 가상 좌 석을 지칭하고, 적어도 2명의 사용자를 착석할 수 있는 적어도 2개의 좌석을 포함한다. 예를 들어, 가상 다중- 사용자 좌석은 가상 다중-사용자 좌석의 식별자, 및 가상 다중-사용자 좌석에 포함된 복수의 좌석에 각각 대응 하는 좌석 번호들 및 상태와 같은 복수의 파라미터를 가질 수 있다. 사용자가 좌석을 갖기로 선택할 때, 가상 다중-사용자 좌석의 식별자 및 사용자를 착석시키는 좌석의 좌석 번호는 사용자의 사용자 식별자에 바인딩될 수 있고, 좌석의 상태는 점유된 것으로 설정된다. 사용자가 가상 학습 공간을 떠날 때, 이전에 바인딩된 가상 다 중-사용자 좌석은 바인딩해제될 수 있는데, 즉, 가상 다중-사용자 좌석의 식별자, 좌석 번호, 및 사용자 식별자 간의 바인딩 관계가 바인딩해제되고, 좌석의 상태가 이용가능하게 설정된다. 본 개시내용의 실시예들에서 제공되는 해결책들은 인공 지능의 컴퓨터 비전 기술과 같은 기술을 수반하고 다음 의 실시예들을 사용하여 구체적으로 설명된다. 본 개시내용의 실시예는 가상 학습 시스템을 구현하기 위한 방법을 제공한다. 구현에서, 가상 학습 시스템을 구현하기 위한 방법은 도 1에 도시된 환경에 적용될 수 있지만, 이것으로 제한되지 않는다. 컴퓨터 디바이스는 사용자 장비 및 서버를 포함할 수 있지만, 이들로 제한되지는 않는다. 사용자 장비는 디스플레 이, 프로세서, 및 메모리를 포함할 수 있지만, 이들로 제한되지 않는다. 서버는 데이터베 이스 및 처리 엔진을 포함한다. 구체적인 프로세스는 다음의 동작들을 포함할 수 있다. 동작 S102: 사용자 장비는 가상 학습 시스템에 의해 제공되는 가상 학습 공간과 연관된 제1 사용자 인터페이스 상에 착석 버튼을 디스플레이하고, 착석 버튼에 대해 트리거된 착석 요청을 획득 한다. 제1 사용자 인터페이스는 제1 사용자가 가상 학습 공간에 합류하기 전의 인터페이스이고, 가상 학습 공간은 적어도 2개의 가상 객체가 함께 착석할 수 있도록 허용하는 가상 다중-사용자 좌석 을 포함하고, 착석 요청은 제1 사용자에 의해 설정된 매칭 예상 정보를 운반하고, 제1 사용자에 의해 설 정된 매칭 예상 정보는 가상 다중-사용자 좌석 내의 제1 가상 객체와 함께 착석한 가상 객체에 대응하는 매칭 예상 정보로 구성되고, 제1 가상 객체는 제1 사용자의 가상 캐릭터이다. 동작 S104 및 S106: 착석 요청을 네트워크를 통해 서버에 송신한다. 동작 S108 및 S110: 서버는 제1 사용자에 의해 설정된 매칭 예상 정보에 기초하여 처리 엔진을 사용 하여, 데이터베이스에 저장된 가상 학습 공간에 대응하는 후보 사용자들에 대해 매칭을 수행하여, 적어도 한 명의 제2 사용자를 획득한다. 동작 S112 및 S114: 적어도 한 명의 제2 사용자에 대응하는 적어도 하나의 제2 가상 객체에 관한 지시 정보를 네트워크를 통해 사용자 장비에 송신한다. 동작 S116: 사용자 장비는 지시 정보에 기초하여 프로세서를 사용하여 생성하고, 디스플레이를 사용하여 제1 가상 객체 및 적어도 하나의 제2 가상 객체를 포함하는 제2 사용자 인터페이스를 출력한다. 제2 사용자 인터페이스에서, 제1 가상 객체 및 적어도 하나의 제2 가상 객체는 가상 다중-사용자 좌석에 함께 착석하고, 적어도 하나의 제2 가상 객체에 관한 지시 정보는 메모리에 저장된다. 도 1에 도시된 예에 더하여, 전술한 동작들은 사용자 장비 또는 서버에 의해 독립적으로 완료될 수 있거나, 또는 협력하여 사용자 장비 및 서버에 의해 완료될 수 있다. 예를 들어, 사용자 장비 는 제2 가상 객체를 획득하는 것과 같은 동작들을 수행함으로써, 서버에 대한 처리 압력을 감소시킨다. 사용자 장비는 (모바일 폰과 같은) 핸드헬드 디바이스, 랩톱 컴퓨터, 데스크톱 컴퓨터, 차량 탑재 디바이 스 등을 포함하지만, 이들로 제한되지 않는다. 사용자 장비의 특정 구현은 본 개시내용에서 제한되지 않 는다. 구현에서, 도 2에 도시된 바와 같이, 가상 학습 시스템을 구현하기 위한 방법은 다음의 동작들을 포함한다. S202: 제1 사용자 인터페이스 상의 착석 버튼에 대해 제1 사용자에 의해 트리거된 착석 요청에 응답하여, 매칭 예상 정보를 설정하도록 구성된 설정 인터페이스를 디스플레이하고, 여기서 제1 사용자 인터페이스는 가상 학습 시스템에 의해 제공되는 가상 학습 공간과 연관된 사용자 인터페이스이고, 가상 학습 공간은 적어도 2개의 가상 객체에 바인딩되도록 허용하는 가상 다중-사용자 좌석을 포함한다. S204: 설정 인터페이스 상에서 제1 사용자에 의해 입력된 매칭 예상 정보를 획득하고, 제1 사용자에 의해 설정 된 매칭 예상 정보와 매칭되는 적어도 한 명의 제2 사용자에 관한 정보를 획득하고, 여기서 적어도 한 명의 제2 사용자는 가상 학습 공간과 연관된 후보 사용자들로부터 검색되고 제1 사용자에 의해 입력된 매칭 예상 정보와 매칭되는 사용자이다. S206: 적어도 한 명의 제2 사용자에 관한 획득된 정보에 응답하여, 제1 사용자에 대응하는 제1 가상 객체 및 적 어도 한 명의 제2 사용자에 대응하는 적어도 하나의 제2 가상 객체를 포함하는 제2 사용자 인터페이스를 생성 및 출력하고, 여기서 제1 가상 객체 및 적어도 하나의 제2 가상 객체 양측 모두는 제1 가상 다중-사용자 좌석에 바인딩된다. 일부 실시예들에서, 가상 학습 시스템을 구현하기 위한 방법은 온라인 학습 시나리오에 적용될 수 있지만, 이것으로 제한되지 않는다. 예를 들어, 사용자가 온라인 학습을 선택할 때, 사용자는, 가상 학습 시스템의 애플리 케이션 프로그램에서의 사용자 인터페이스를 통해, 그 가상 캐릭터를 가상 학습 공간에서 자율-학습을 수행하도 록 제어하여, 실세계 학습 환경을 시뮬레이션할 수 있다. 본 개시내용의 이 실시예는 데스크메이트 개념을 제공한다. 구체적으로, 사용자에 적합한 다른 가상 객체가 사 용자에 대해 매칭되고, 예를 들어, 다른 사용자에 의해 제어된 가상 캐릭터가 사용자에 대해 매칭되어, 둘 이상 의 사람들이 함께 학습하는 실세계 환경을 시뮬레이션한다. 또한, 사용자를 적합한 가상 객체와 매칭시키는 방법에 대해, 이 실시예는 매칭 예상 정보가 사용자에 의해 설 정될 수 있는 기술적 수단을 기록한다. 기술적 수단을 사용함으로써, 사용자는 예상된 가상 객체와 매칭될 수 있다. 일부 실시예들에서, 가상 객체는, 가상 이미지, 가상 항목, 또는 가상 캐릭터 등의, 가상 학습 시스템에 디스플 레이된 객체로서 이해될 수 있지만, 이것으로 제한되지 않는다. 일부 실시예들에서, 가상 학습 공간은 온라인 학습의 가상 환경으로서 이해될 수 있지만, 이것으로 제한되지 않 는다. 가상 학습 공간은 오프라인 학습의 실제 환경, 예를 들어, 가상 라이브러리, 가상 학습 하우스, 또는 가 상 자율-학습 룸과 같은 학습 속성을 갖는 공간 영역을 시뮬레이션하도록 구성된다. 또한, 가상 학습 공간은 실내 또는 실외에 제한되지 않고, 실외 환경도 가상 학습 공간으로 설정될 수 있다. 또한, 가상 학습 공간은 복수의 가상 다중-사용자 좌석을 포함할 수 있지만, 이것으로 제한되지 않는다. 또한, 예를 들어, 도 3에 도시된 바와 같이, 가상 학습 공간은 학습 속성을 갖는 가상 라이브러리로 설정 된다. 가상 라이브러리(가상 학습 공간)는, 가상 다중-사용자 좌석 A, 가상 다중-사용자 좌석 B, 가상 다 중-사용자 좌석 C, 및 가상 다중-사용자 좌석 D 등의, 복수의 가상 다중-사용자 좌석을 포함한다. 가상 다중- 사용자 좌석 A와 가상 다중-사용자 좌석 B 양측 모두에는 하나의 가상 객체가 착석되었고(그에 바인딩되었고), 가상 다중-사용자 좌석 C에는 2개의 가상 객체가 착석되었고, 가상 다중-사용자 좌석 D에는 어떤 가상 객체도 착석되지 않았다. 또한, \"착석(sit in)\"은, 여전히 착석되도록 허용하는 각각의 가상 다중-사용자 좌석과 연관된 착석 버튼을 표 현하기 위해 사용될 수 있지만, 이것으로 제한되지 않는다. 예를 들어, 가상 다중-사용자 좌석 A와 가상 다중 -사용자 좌석 B 양쪽 모두에는 하나의 가상 객체가 착석되었지만, 상한은 2개의 가상 객체가 착석되어야 한다. 따라서, 가상 다중-사용자 좌석 A 및 가상 다중-사용자 좌석 B 양측 모두에는 다른 가상 객체가 착석하도록 허 용하고, 그 후 2개의 좌석 각각은 하나의 연관된 착석 버튼을 디스플레이한다. 유사하게, 가상 다중-사용자 좌 석 D에는 임의의 가상 객체가 착석하지 않았으므로, 가상 다중-사용자 좌석 D는 2개의 연관된 착석 버튼을 디스 플레이한다. 대조적으로, 가상 다중-사용자 좌석 C에는 2개의 가상 객체가 착석되었고, 상한에 도달하였다. 따라서, 가상 다중-사용자 좌석 C는 연관된 착석 버튼을 디스플레이하지 않는다. 일부 실시예들에서, 제1 사용자 인터페이스는 제1 사용자가 가상 학습 공간에 합류하기 이전의 인터페이스이다. 제1 사용자 인터페이스와 가상 학습 공간 사이의 관계는, 제1 사용자 인터페이스가 가상 학습 공간에서 픽처 및 또 다른 가상 요소를 디스플레이하도록 구성된다는 것으로 이해될 수 있지만, 이것으로 제한되지 않는다. 다른 가상 요소는 제어를 위한 가상 버튼(예를 들어, 착석 버튼), 사용자를 프롬프트하기 위한 텍스트/이미지 정보 (예를 들어, 제1 사용자의 아바타 정보 및 가상 학습 공간의 이름 정보) 등일 수 있다. 또한, 예를 들어, 도 4에 도시된 바와 같이, 가상 학습 공간의 이름 정보, 가상 학습 공간의 환경 정보, 제1 사 용자의 아바타 정보, 및 착석 버튼이 제1 사용자 인터페이스 상에 디스플레이된다. 도 4에 도 시된 착석 버튼은 좌석을 위한 탭을 트리거하도록 구성된 착석 버튼으로서 이해될 수 있지만, 이것으로 제 한되지 않는다. 제1 사용자가 착석 버튼에 대한 착석 요청을 트리거한 후, 착석 요청에 응답하여, 가상 학습 공간에서 활용가능한 상태에 있는 가상 다중-사용자 좌석들로부터 가상 다중-사용자 좌석이 결정된다. 즉, 사용자는 능동적으로 착석 요청을 트리거하지만, 착석할 가상 다중-사용자 좌석을 수동적으로 선택한다. 도 3에 도시된 바와 같이, 사용자는 가상 학습 공간의 활용가능한 상태에 있는 가상 다중-사용자 좌석들로부터, 착석할 가상 다중-사용자 좌석을 능동적으로 선택할 수 있다. 예를 들어, 가상 다중-사용자 좌석 A와 연관된 착석 버튼에 대한 착석 요청을 트리거하여, 가상 다중-사용자 좌석 A에 착석하도록 요청한다. 다른 예로서, 가 상 다중-사용자 좌석 D와 연관된 착석 버튼에 대한 착석 요청을 트리거하여, 가상 다중-사용자 좌석 D에 착석하 도록 요청하는데, 즉 가상 다중-사용자 좌석 D가 가상 다중-사용자 좌석으로서 결정된다. 일부 실시예들에서, 제1 사용자에 의해 설정된 매칭 예상 정보는 가상 다중-사용자 좌석 내의 제1 가상 객체와 함께 착석하는 가상 객체에 대응하는 매칭 예상 정보로 구성된다. 즉, 제1 사용자는, 설정된 매칭 예상 정보에 기초하여, 이상적인 데스크메이트, 또는 함께 학습할 이상적인 객체를 결정할 수 있다. 매칭 예상 정보는 제1 사용자에 의해 설정된 매칭 조건으로서 이해될 수 있지만, 이것으로 제한되지 않는다. 예를 들어, 제1 사용자 가 매칭 조건을 20 내지 25세를 포함하는 것으로 설정할 때, 20세 미만 또는 25세 초과의 사용자는 매칭 조건을 충족하지 않는다. 즉, 사용자는 제1 사용자가 함께 학습하는 이상적인 객체가 아니며, 즉 사용자는 제1 사용자 와 매칭되지 않는다. 구체적으로, 매칭 예상 정보는 나이, 학교, 학력, 신장, 별자리, 숙련된 분야, 시험을 위한 분야, 학습 내용, 취미 관심사, 및 학습 목표와 같은 다양한 타입의 정보를 제한할 수 있지만, 이들로 제한되지 않는다. 또한, 매칭 예상 정보의 설정 효율 및 매칭 동작의 처리 효율을 향상시키기 위해, 복수의 후보 라벨이 또한 제1 사용 자에게 제공될 수 있고, 이에 제한되지 않는다. 이러한 방식으로, 제1 사용자는 복수의 후보 라벨로부터 매칭 조건으로서 라벨을 선택할 수 있고, 다른 사용자에 의해 선택된 라벨이 매칭 조건으로서 라벨과 매칭될 때, 사 용자는 제1 사용자와 매칭되는 것으로 고려되는데, 즉, 사용자는 제1 사용자가 함께 학습하기 위한 이상적인 객 체로서 결정된다. 일부 실시예들에서, 적어도 하나의 제2 가상 객체는 제2 가상 객체들의 수량이 1 이상인 것으로 이해될 수 있지 만, 이것으로 제한되지 않는다. 즉, 하나의 제2 가상 객체 또는 복수의 제2 가상 객체가 있을 수 있고, 수량은 제1 사용자의 매칭 예상 정보에 기초하여 결정될 수 있다. 일부 실시예들에서, 제1 가상 객체 및 적어도 하나의 제2 가상 객체가 제1 가상 다중-사용자 좌석에 함께 착석 한(바인딩된) 후에, 제1 사용자 인터페이스는 제2 사용자 인터페이스로 스위칭될 수 있는데, 즉, 디스플레이 대 상으로서 가상 학습 공간을 갖는 장면은 디스플레이 대상으로서 제1 가상 다중-사용자 좌석을 갖는 장면으로 스 위칭되고, 이것은 제한되지 않는다. 가상 다중-사용자 좌석이 디스플레이 대상인 제2 사용자 인터페이스의 장 면에서, 제1 가상 객체와 적어도 하나의 제2 가상 객체는 하나의 가상 다중-사용자 좌석에 함께 착석한다. 또한, 도 3에 도시된 장면에 기초하여 도 5를 참조한다. 예를 들어, 디스플레이 대상으로서 가상 학습 공간 을 갖는 제1 사용자 인터페이스가 도 5의 (a)에 도시된다. 또한, 도 5의 (b)에 도시된 바와 같이, 제1 가상 객체 및 제2 가상 객체가 제1 가상 다중-사용자 좌석(가상 다중-사용자 좌석 D)에 함께 착 석한 후에, 제1 사용자 인터페이스는 제1 가상 다중-사용자 좌석을 디스플레이 대상으로 하여 제2 사용자 인터페이스로 스위칭되고(즉, 제2 사용자 인터페이스가 생성 및 출력되고), 가상 다중-사용자 좌석 D에 제 1 가상 객체 및 제2 가상 객체가 함께 착석한 장면은 제2 사용자 인터페이스에 디스플레이 된다. 또한, 도 3에 도시된 장면에 기초하여 도 6을 참조한다. 예를 들어, 착석 버튼은 가상 학습 공간과 연관된 제1 사용자 인터페이스 상에 디스플레이된다. 제1 사용자 인터페이스는 제1 사용자가 가상 학습 공간에 합류하기 전의 인터페이스이고, 가상 학습 공간은 적어도 2개의 가상 객체가 함께 착석 하도록 허용하는 가상 다중-사용자 좌석(예를 들어, 가상 다중-사용자 좌석 D)을 포함한다. 착석 버튼에 대해 트리거된 착석 요청에 응답하여, 제1 사용자에 의해 설정된 매칭 예상 정보가 획득된다. 제1 사용자 에 의해 설정된 매칭 예상 정보는 가상 다중-사용자 좌석 내의 제1 가상 객체와 함께 착석한 가상 객 체에 대응하는 매칭 예상 정보로 구성되고, 제1 가상 객체는 제1 사용자의 가상 캐릭터이다. 제2 사용자 인터페이스가 생성 및 출력된다. 제2 사용자 인터페이스에서, 제1 가상 객체 및 적어도 하나의 제2 가상 객체는 가상 다중-사용자 좌석에 함께 착석한다. 제2 가상 객체는 제1 사용자에 의해 설정된 매칭 예상 정보에 기초하여 매칭이 수행된 후에 획득된 가상 객체이다. 해결책에서, 제2 사용자 인터페이스는: 제1 가상 객체와 적어도 하나의 제2 가상 객체가 제1 가상 다중-사용자 좌석에 공동으로 바인딩되는 지속기간, 즉, 2개의 객체가 동일한 가상 다중-사용자 좌석에 함께 착석하는 지속기간; 제1 가상 객체가 임의의 가상 다중-사용자 좌석에 단독으로 바인딩되는 지속기간, 즉, 제1 가상 객체가 가상 다 중-사용자 좌석에 단독으로 착석하는 지속기간; 적어도 하나의 제2 가상 객체가 임의의 가상 다중-사용자 좌석에 단독으로 각각 바인딩되는 지속기간, 즉, 상기 적어도 하나의 제2 가상 객체가 가상 다중-사용자 좌석에 단독으로 착석하는 지속기간; 가상 학습 공간 내의 제1 가상 객체의 이력 정보; 및 가상 학습 공간 내의 적어도 하나의 제2 가상 객체의 이력 정보 중 적어도 하나를 포함한다. 일부 실시예들에서, 도 7에 도시된 바와 같이, 제2 사용자 인터페이스는 또한 제1 가상 객체 및 제2 가상 객체를 함께 학습하기 위한 지속기간(함께 착석하기 위한 지속기간)을 \"18분 23초\"로 하여, 사용자 정보 카드 A, 및 사용자 정보 카드 B를 디스플레이한다. 사용자 정보 카드 A는, 제1 가상 객체가 가상 다중-사 용자 좌석에 단독으로 착석하는 지속기간, 가상 학습 공간 내의 제1 가상 객체의 이력 정보 등을 디스플레 이할 수 있지만, 이것으로 제한되지 않는다. 유사하게, 사용자 정보 카드 B는, 제2 가상 객체가 가상 다 중-사용자 좌석에 단독으로 착석하는 지속기간, 가상 학습 공간 내의 제2 가상 객체의 이력 정보 등을 디 스플레이할 수 있지만, 이것으로 제한되지 않는다. 해결책에서, 제2 사용자 인터페이스는: 제1 가상 객체와 적어도 하나의 제2 가상 객체의 상호작용 정보; 및 상호작용 정보의 생성을 트리거하도록 구성된 정보 입력 영역 중 적어도 하나를 추가로 포함한다. 일부 실시예들에서, 도 7에 도시된 장면에 기초하여 도 8을 참조한다. 제2 사용자 인터페이스는 또한 제1 가상 객체 및 제2 가상 객체를 함께 학습하기 위한 지속기간(동일한 가상 다중-사용자 좌석에 착석하기 위 한 지속기간)을 \"18분 23초\"로 하여, 사용자 정보 카드 A, 및 사용자 정보 카드 B를 디스플레이한다. 사용자 정보 카드 A는 가상 학습 공간 내의 제1 가상 객체의 이력 정보 등을 디스플레이할 수 있지만, 이것으로 제한되지 않는다. 유사하게, 사용자 정보 카드 B는 가상 학습 공간 내의 제2 가상 객체의 이력 정보 등을디스플레이할 수 있지만, 이것으로 제한되지 않는다. 또한, 제2 사용자 인터페이스는 제1 가상 객체 및 제2 가상 객체가 동일한 가상 다중-사용자 좌석에 착석한 후에 생성된 상호작용 정보, 및 정보 입력 영역(\"학습 의심이 제기될 수 있습니다\"가 디스플 레이되고, 이것이 상호작용 정보에 대한 입력 영역임을 프롬프트하도록 구성됨)을 추가로 디스플레이한다. 정보 입력 영역은 상호작용 정보의 생성을 트리거하도록 구성된다. 해결책에서, 정보 입력 영역이 디스플레이된 후에, 본 방법은: 정보 입력 영역에 대해 트리거된 입력 요청에 응답하여, 정보 상호작용 인터페이스를 디스플레이하는 단계- 정 보 상호작용 인터페이스는 제1 가상 객체와 적어도 하나의 제2 가상 객체 간의 정보 상호작용을 위한 인터페이 스임 -; 및 타깃 정보에 대해 정보 상호작용 인터페이스 상에서 트리거된 출력 요청에 응답하여, 정보 상호작용 인터페이스 상에 타깃 정보를 디스플레이하고, 타깃 정보의 입력 소스를 디스플레이하는 동작- 입력 소스는 제1 사용자임 - 을 추가로 포함한다. 또한, 도 8에 도시된 장면에 기초하여 도 9를 참조한다. 예를 들어, 도 9의 (a)에 도시된 바와 같이, 정보 입 력 영역에 대해 트리거된 입력 요청이 획득된다. 또한, 도 9의 (b)에 도시된 바와 같이, 정보 상호작용 인터페이스가 입력 요청에 응답하여 디스플레이된다. 정보 상호작용 인터페이스는 제1 가상 객체 와 제2 가상 객체 사이의 정보 상호작용을 위한 인터페이스이다. 타깃 정보에 대한 정보 상호 작용 인터페이스 상에서 트리거된 출력 요청에 응답하여, 타깃 정보(예를 들어, \"매슬로우(Maslow)의 욕구들의 5개의 계층 구조의 정의들이 무엇인가\" 및 \"이 질문에 대한 답변을 당신은 아는가\")가 정보 상호작용 인터페이스 상에 디스플레이되고, 타깃 정보의 입력 소스(예를 들어, 제1 가상 객체의 아바타 및 제1 사용자의 이름)가 디스플레이된다. 해결책에서, 본 방법은: 제1 사용자에 의해 설정된 매칭 예상 정보와 매칭되는 적어도 한 명의 제2 사용자에 관한 정보가 획득되지 않는 것에 응답하여, 제1 가상 객체를 포함하는 제3 사용자 인터페이스를 생성 및 출력하는 단계- 제1 가상 객체는 제2 가상 다중-사용자 좌석에 단독으로 바인딩됨 -를 추가로 포함한다. 또한, 도 6에 도시된 장면에 기초하여 도 10을 참조한다. 예를 들어, 매칭 예상 정보에 기초하여 매칭이 수행된 후에, 매칭이 성공했는지가 결정된다. 그렇다면, 제1 가상 객체 및 제2 가상 객체가 제1 가 상 다중-사용자 좌석에 함께 착석한 제2 사용자 인터페이스가 디스플레이된다. 아니오인 경우, 제1 가상 객체가 제2 가상 다중-사용자 좌석에 단독으로 착석한 제3 사용자 인터페이스가 디스플레이된다. 본 개시내용의 이 실시예에서, 매칭 예상 정보에 기초하여 매칭이 수행된 후에 적어도 하나의 제2 가상 객체가 성공적으로 획득될 때, 제1 가상 객체와 적어도 하나의 제2 가상 객체가 제1 가상 다중-사용자 좌석에 함께 착 석한 제2 사용자 인터페이스가 디스플레이된다. 매칭 예상 정보에 기초하여 매칭이 수행된 후에 적어도 하나의 제2 가상 객체가 획득되지 않을 때, 제1 가상 객체가 제2 가상 다중-사용자 좌석에 단독으로 착석한 제3 사용자 인터페이스가 디스플레이된다. 이러한 방식으로, 매칭이 성공하거나 실패할 때 대응하는 사용자 인터페이스가 제공될 수 있고, 이에 의해 매칭 메커니즘의 에러-허용 레이트를 향상시키는 기술적 효과를 달성한다. 해결책에서, 본 방법은: 제1 프롬프트 라벨을 생성하고, 제1 프롬프트 라벨을 제2 가상 다중-사용자 좌석과 연관된 영역에 디스플레이하 는 단계- 제1 프롬프트 라벨은 제1 사용자에 의해 설정된 매칭 예상 정보를 디스플레이하도록 구성됨 -; 제2 프롬프트 라벨을 생성하고, 제2 프롬프트 라벨을 제2 가상 다중-사용자 좌석과 연관된 영역에 디스플레이하 는 단계- 제2 프롬프트 라벨은 제1 사용자의 연관된 신원 정보를 디스플레이하도록 구성됨 -; 및 제3 프롬프트 라벨을 생성하고, 제3 프롬프트 라벨을 제2 가상 다중-사용자 좌석과 연관된 영역에 디스플레이하 는 단계- 제3 프롬프트 라벨은 제1 사용자에 의해 입력된 예상된 신원 정보를 디스플레이하도록 구성됨 -중 적 어도 하나를 추가로 포함한다. 예상된 신원 정보는 제2 가상 다중-사용자 좌석 내의 제1 가상 객체와 함께 착 석할 것으로 제1 사용자에 의해 예상된 가상 객체에 대응하는 신원 정보이다. 일부 실시예들에서, 제2 가상 다중-사용자 좌석과 연관된 영역은 제2 가상 다중-사용자 좌석 상의 영역, 제2 가 상 다중-사용자 좌석 아래의 영역, 제2 가상 다중-사용자 좌석 위의 영역 등을 포함할 수 있지만, 이들로 제한되지 않는다. 이용가능한 제2 가상 다중-사용자 좌석의 요건은 프롬프트 라벨들을 디스플레이함으로써 더 시각 적으로 디스플레이될 수 있고, 그에 의해 매칭의 성공률을 향상시킨다. 제3 프롬프트 라벨은 제2 가상 다중-사용자 좌석과 연관된 영역에 디스플레이된다. 제3 프롬프트 라벨은 제1 사용자에 의해 입력된 예상된 신원 정보를 디스플레이하도록 구성된다. 예상된 신원 정보는 제2 가상 다중-사 용자 좌석 내의 제1 가상 객체와 함께 착석할 것으로 제1 사용자에 의해 예상된 가상 객체에 대응하는 신원 정 보이다. 예를 들어, 제1 사용자가 제2 가상 다중-사용자 좌석에서 중국어 성적이 양호한 가상 객체와 함께 착 석할 것으로 예상할 때, 제3 프롬프트 라벨은 \"데스크메이트를 찾기를 희망함\" 및 \"중국어 성적이 양호함\"과 같 은 정보를 디스플레이할 수 있지만, 이에 제한되지 않는다. 또한, 예를 들어, 도 11에 도시된 바와 같이, 제1 가상 객체는 가상 다중-사용자 좌석에 단독으로 착석해 있고, 제3 프롬프트 라벨이 (가상 다중-사용자 좌석 상의) 가상 다중-사용자 좌석과 연관된 영역에 디스플레이된다. 제3 프롬프트 라벨은 \"데스크메이트를 찾기를 희망함\" 및 \"함께 진행\"과 같은, 제1 사용자에 의해 입력된 예상된 신원 정보를 디스플레이하도록 구성된다. 즉, 예상된 신원 정보는 제1 사용자가 그들이 \"함께 진행\"할 수 있는 가상 객체와 동일한 테이블에 착석할 것으로 예상한다는 것이다. 해결책에서, 본 방법은: 제2 가상 다중-사용자 좌석에 착석해 있는 제3 가상 객체에 응답하여, 제1 가상 객체 및 제3 가상 객체를 포함 하는 제4 사용자 인터페이스를 생성 및 출력하는 단계를 추가로 포함한다. 제1 가상 객체 및 제3 가상 객체는 제4 사용자 인터페이스 내의 제2 가상 다중-사용자 좌석에 함께 착석해 있다. 일부 실시예들에서, 제1 가상 객체가 제2 가상 다중-사용자 좌석에 단독으로 착석한 후에, 임의의 가상 객체가 제2 가상 다중-사용자 좌석에 직접 착석하여 제1 가상 객체의 데스크메이트가 될 수 있다. 또한, 악의적인 공 유 테이블 거동을 피하기 위해, 사용자는 가상 객체 공유 테이블을 보고하고, 악의적인 공유 테이블의 특정 사 항을 기록하도록 허용될 수 있지만, 이에 제한되지 않는다. 해결책에서, 본 방법은: 제2 가상 다중-사용자 좌석에 바인딩되도록 요청하기 위한 제4 가상 객체로부터의 요청을 수신하고, 제1 사용자 가 제4 가상 객체로부터의 요청을 수락하도록 지시하는 것에 응답하여, 제1 가상 객체 및 제4 가상 객체를 포함 하는 제5 사용자 인터페이스를 생성 및 출력하는 단계를 추가로 포함한다. 제1 가상 객체 및 제4 가상 객체는 공동으로 제2 가상 다중-사용자 좌석에 바인딩된다. 이 실시예에서, 제1 가상 객체가 제2 가상 다중-사용자 좌석에 단독으로 바인딩된 후에, 다른 가상 객체들 모두 는 제2 가상 다중-사용자 좌석에 착석하기 전에 제1 사용자의 명령 및 동의를 획득할 필요가 있다. 즉, 제1 사 용자에게는 제2 가상 다중-사용자 좌석에 대한 제어 허가가 주어진다. 해결책에서, 본 방법은: 제2 가상 다중-사용자 좌석에 바인딩되도록 요청하기 위한 제5 가상 객체로부터의 요청을 수신하고, 제5 가상 객체의 매칭 예상 정보와 제1 사용자에 의해 설정된 매칭 예상 정보 사이의 정보 유사도가 제1 미리 설정된 임 계값 이상인 것에 응답하여, 상기 제1 가상 객체 및 상기 제5 가상 객체를 포함하는 제6 사용자 인터페이스를 생성 및 출력하는 단계를 추가로 포함한다. 제1 가상 객체 및 제5 가상 객체는 공동으로 제2 가상 다중-사용자 좌석에 바인딩된다. 일부 실시예들에서, 착석 버튼에 대해 트리거된 착석 요청에 응답하여, 제1 사용자에 의해 설정된 매칭 예상 정 보에 기초하여 제1 매칭이 수행되고, 제1 매칭이 실패한 후에, 가상 다중-사용자 좌석에 단독으로 착석해 있는 제1 가상 객체가 디스플레이되는 제2 사용자 인터페이스가 디스플레이된다. 그 후, 제2 매칭 및/또는 제3 매칭 이 추가로 수행될 수 있고, 이것은 제한되지 않는다. 제2 매칭은 가상 객체가 가상 다중-사용자 좌석에 착석하 기를 요청할 때마다 즉석 매칭이 한번 수행되는 것으로 이해될 수 있지만, 이것으로 제한되지 않는다. 제3 매 칭은 제1 가상 객체가 가상 다중-사용자 좌석에 단독으로 착석한 후에, 제1 사용자가 매칭을 중지하도록 명령하 거나 적어도 하나의 제2 가상 객체가 매칭될 때까지 미리 설정된 범위 내에서 가상 객체들에 대해 매칭 및 결정 이 여전히 수행되는 것으로 이해될 수 있지만, 이에 제한되지 않는다. 해결책에서, 제3 사용자 인터페이스는 좌석 공유 버튼을 추가로 포함하고, 본 방법은: 좌석 공유 버튼에 대해 트리거된 좌석 공유 요청에 응답하여, 적어도 한 명의 후보 사용자를 디스플레이하는 단 계; 적어도 한 명의 후보 사용자 중 타깃 후보 사용자에 대해 트리거된 공유 요청에 응답하여, 타깃 후보 사용자와 연관된 단말기에 좌석 공유 정보를 송신하는 단계- 좌석 공유 정보는 타깃 후보 사용자를 제2 가상 다중-사용자 좌석 내의 제1 가상 객체와 함께 착석하게 초청하도록 구성됨 -; 및 타깃 후보 사용자와 연관된 단말기에 의해 반환된 요청 피드백 정보를 수신하고, 요청 피드백 정보가 타깃 후보 사용자가 공유를 수락한다는 것을 지시하는 것에 응답하여, 제1 가상 객체 및 타깃 후보 사용자를 포함하는 제7 사용자 인터페이스를 생성 및 출력하는 단계를 추가로 포함한다. 제1 가상 객체와 타깃 후보 사용자에 대응하 는 가상 객체는 제2 가상 다중-사용자 좌석에 공동으로 바인딩된다. 일부 실시예들에서, 적어도 하나의 공유될 후보 사용자는 가상 학습 공간에 대응하는 애플리케이션 프로그램의 등록된 사용자일 수 있지만, 이에 제한되지 않으며, 또는 가상 학습 공간에 대응하는 애플리케이션 프로그램 이 외의 연관된 애플리케이션 프로그램의 등록된 사용자일 수 있지만, 이에 제한되지 않는다. 예를 들어, 가상 좌 석은 채팅 애플리케이션에 있고 제1 사용자와 동일한 그룹 채팅에 있거나 제1 사용자의 친구인 사용자에게 공유 된다. 또한, 도 12를 참조한다. 예를 들어, 도 12의 (a)에 도시된 바와 같이, 좌석 공유 버튼이 제3 사용자 인 터페이스에 디스플레이된다. 또한, 도 12의 (b)에 도시된 바와 같이, 좌석 공유 버튼에 대해 트리거된 좌석 공유 요청에 응답하여, \"사용자 a\", \"사용자 b\", \"사용자 c\", 또는 \"사용자 d\"와 같은, 적어도 하나의 공 유될 후보 사용자가 디스플레이된다. 그 후, 적어도 하나의 공유될 후보 사용자 중 (\"사용자 b\"와 같은) 타깃 후보 사용자에 의해 트리거된 공유 요청에 응답하여, 좌석 공유 정보가 타깃 후보 사용자와 연관된 단말기에 전 송된다. 좌석 공유 정보는 가상 다중-사용자 좌석 내의 제1 가상 객체와 함께 착석하도록 타깃 후 보 사용자를 초청하도록 구성된다. 타깃 후보 사용자와 연관된 단말기에 의해 반환된 요청 피드백 정보가 수신 되고, 요청 피드백 정보가 타깃 후보 사용자가 공유를 수락한다는 것을 지시하는 것에 응답하여, 제1 가상 객체 및 타깃 후보 사용자를 포함하는 제7 사용자 인터페이스가 생성 및 출력된다. 해결책에서, 설정 인터페이스는 적어도 2개의 후보 라벨을 포함하고, 본 방법은: 적어도 2개의 후보 라벨 중 타깃 후보 라벨에 대해 트리거된 선택 요청에 응답하여, 타깃 후보 라벨에 대응하는 예상 정보를 제1 사용자에 의해 설정된 매칭 예상 정보로서 결정하는 단계를 추가로 포함한다. 일부 실시예들에서, 매칭 예상 정보의 설정 효율을 향상시키기 위해, 사용자가 선택할 복수의 후보 라벨이 제공 될 수 있고, 이는 제한되지 않는다. 해결책에서, 설정 인터페이스는 입력 영역을 추가로 포함하고, 제1 사용자에 의해 설정된 매칭 예상 정보는 제1 예상 정보와 제2 예상 정보를 포함하고, 본 방법은: 적어도 2개의 후보 라벨 중 타깃 후보 라벨에 대해 트리거된 선택 요청에 응답하여, 타깃 후보 라벨에 대응하는 예상 정보를 제1 사용자에 의해 설정된 제1 예상 정보로서 결정하는 단계; 및 입력 영역에 대해 트리거된 정보 입력 요청에 응답하여, 사용자에 의해 입력된 매칭 기준 정보를 획득하고, 매 칭 기준 정보를 제1 사용자에 의해 설정된 제2 예상 정보로서 결정하는 단계를 추가로 포함한다. 일부 실시예들에서, 제1 사용자에 의해 설정된 매칭 예상 정보는 제1 예상 정보를 포함하는데, 즉, 매칭은 제1 사용자에 의해 설정된 제1 예상 정보를 사용하여 수행된다. 제1 사용자에 의해 설정된 매칭 예상 정보는 제2 예상 정보를 포함하지 않을 수 있는데, 즉, 매칭은 제2 예상 정보를 사용하여 수행되지 않는다. 대안적으로, 제1 예상 정보와 제2 예상 정보 양쪽 모두가 제1 사용자에 의해 설정된 매칭 예상 정보로서 사용되고, 상이한 매칭 가중치들이 제1 예상 정보와 제2 예상 정보에 할당된다. 또한, 도 6에 도시된 장면에 기초하여 도 13을 참조한다. 예를 들어, 도 13의 (a)에 도시된 바와 같이, 착석 요청이 획득된다. 또한, 도 13의 (b)에 도시된 바와 같이, 착석 요청에 응답하여, 설정 인터페이스가 디 스플레이되고, 적어도 2개의 후보 라벨(예를 들어, \"학습\" 또는 \"연습\"과 같은 타깃, 및 \"서로 독촉\" 또는 \"서 로 통신\"할 수 있는 예상된 데스크메이트), 및 입력 영역이 설정 인터페이스 상에 디스플레이된다. 선택 요청에 응답하여, 타깃 후보 라벨에 대응하는 예상 정보(예를 들어, 선택된 \"학습\" 또는 \"서로 독촉\")가 제1 사 용자에 의해 설정된 제1 예상 정보, 예를 들어, \"학습\" 또는 \"서로 독촉\"으로서 결정된다. 제1 사용자에 의해설정된 매칭 예상 정보는 제1 예상 정보를 포함한다. 입력 영역에 대해 트리거된 정보 입력 요청에 응답하여, 사용자에 의해 입력된 매칭 기준 정보가 획득되고, 매칭 기준 정보는 제1 사용자에 의해 설정된 제2 예상 정보 로서 결정된다. 또한, 도 13의 (b)에 도시된 바와 같이, 가상 버튼 \"학습 시작\"에 대해 수행된 선택 조작에 응 답하여, 가상 객체의 착석 매칭이 수행된다. 해결책에서, 본 방법은: 제1 사용자에 의해 설정된 매칭 예상 정보와 매칭되는 적어도 한 명의 제2 사용자에 관한 정보가 획득되지 않는 것에 응답하여, 제2 가상 객체로서 인공 지능의 가상 캐릭터를 결정하는 단계를 추가로 포함한다. 일부 실시예들에서, 제2 가상 객체를 매칭하는 성공률을 향상시키기 위해, 적어도 하나의 타깃 제2 사용자가 복 수의 후보 사용자로부터 결정되지 않을 때 인공 지능의 가상 캐릭터가 제2 가상 객체로서 결정될 수 있고, 이것 은 제한되지 않는다. 가상 학습 공간에서의 사용자들의 수량은 보통 높은 값이 되도록 보장될 수 없고, 결과적으로, 제2 가상 객체를 매칭하는 성공률이 보장될 수 없다. 이것은 사용자 경험에 좋지 않은 현상이다. 또한, 문제점을 해결하기 위 해, 실제 사용자의 가상 캐릭터는 인공 지능의 가상 캐릭터로 대체될 수 있지만, 이것으로 제한되지 않는다. 유사한 이미지 동반자를 제공하는 것에 더하여, 인공 지능의 가상 캐릭터는 자연어 처리 기술을 사용하여 사용 자와의 원활한 정보 상호작용을 추가로 수행할 수 있고, 그에 의해 사용자에게 실제 사용자와 유사한 데스크메 이트 서비스를 제공한다. 해결책에서, 가상 학습 공간과 연관된 복수의 후보 사용자는: 가상 학습 공간에서 온라인 상태에 있는 사용자; 및 오프라인 상태에 있고 가상 학습 공간에서 오프라인 매칭 조건을 충족하는 사용자 중 적어도 한 명을 포함한다. 가상 자율-학습 룸에서의 사용자들의 수량은 보통 높은 값이 되도록 보장될 수 없고, 결과적으로, 제2 가상 객 체와 매칭하는 성공률이 보장될 수 없다. 또한, 문제점을 해결하기 위해, 온라인 상태에 있는 사용자 및 오프 라인 상태에 있는 사용자 양측 모두가 후보 사용자들의 선택 객체들로서 사용되어, 후보 사용자들의 선택 범위 를 확장할 수 있고, 이는 제한되지 않고, 이로써 제2 가상 객체와 매칭되는 성공률을 향상시킨다. 해결책에서, 오프라인 매칭 조건은: 가상 학습 공간에서의 마지막 온라인 시간과 현재 시간 사이의 간격이 미리 설정된 제3 임계값보다 작은 것을 포함한다. 일부 실시예들에서, 오프라인 상태에 있는 사용자에 대해 매칭을 수행하는 프로세스에서, 매칭의 성공률을 향상 시키기 위해, 매칭은 최근에 온라인이지만 현재 오프라인 상태에 있는 사용자에 대해 수행될 수 있지만, 이에 제한되지 않는다. 해결책에서, 후보 사용자들로부터 결정된 적어도 한 명의 제2 사용자가 오프라인 상태에 있는 사용자를 포함하 는 것에 응답하여, 본 방법은: 오프라인 상태에 있는 사용자와 연관된 단말기에 착석 초청 정보를 송신하는 단계- 착석 초청 정보는 오프라인 상태에 있는 사용자가 가상 다중-사용자 좌석 내의 제1 가상 객체와 함께 착석하게 초청하도록 구성됨 -; 및 오프라인 상태에 있는 사용자와 연관된 단말기에 의해 반환된 요청 피드백 정보를 수신하고, 그 요청 피드백 정 보가 사용자가 초청을 수락한다는 것을 지시하는 것에 응답하여, 제2 사용자 인터페이스를 생성 및 출력하는 단 계를 추가로 포함한다. 해결책에서, 가상 학습 공간과 연관된 제1 사용자 인터페이스 상에 디스플레이되는 착석 버튼은: 제1 사용자 인터페이스 상에 제1 착석 버튼을 디스플레이하는 단계- 제1 착석 버튼은 가상 학습 공간에서의 임 의의 가상 다중-사용자 좌석에 대한 착석 요청을 트리거하도록 구성됨 -; 및 각각의 가상 다중-사용자 좌석과 연관된 영역에서 제1 사용자 인터페이스 상에 제2 착석 버튼을 디스플레이하는 단계- 제2 착석 버튼은 대응하는 가상 다중-사용자 좌석에 대한 착석 요청을 트리거하도록 구성됨 -를 포함한다. 일부 실시예들에서, 도 4에 도시된 바와 같이, 제1 착석 버튼(착석 버튼)이 사용자 인터페이스에 디 스플레이된다. 제1 착석 버튼은 가상 학습 공간에 포함된 임의의 가상 다중-사용자 좌석에 대응하는 착석 요청 을 트리거하도록 구성된다. 일부 실시예들에서, 도 5에 도시된 바와 같이, 사용자 인터페이스 상의 각각의 가상 다중-사용자 좌석(예를 들 어, 가상 다중-사용자 좌석 D)과 연관된 영역에 제2 착석 버튼이 디스플레이된다. 제2 착석 버튼은 제2 착석 버튼에 대응하는 가상 다중-사용자 좌석에 대한 착석 요청을 트리거하도록 구성된다. 해결책에서, 본 방법은: 메인 인터페이스를 생성 및 출력하고, 메인 인터페이스 상에 가상-학습-공간 식별자를 디스플레이하는 단계- 가 상-학습-공간 식별자는 가상 학습 공간에 진입하기 위한 트리거 식별자임 -; 및 가상 학습 공간의 트리거 식별자에 대해 수행된 선택 조작에 응답하여, 제1 사용자 인터페이스를 생성 및 출력 하는 단계를 추가로 포함한다. 또한, 도 4에 도시된 장면에 기초하여 도 14를 참조한다. 예를 들어, 도 14의 (a)에 도시된 바와 같이, 메인 인터페이스가 생성 및 출력되고, 적어도 하나의 가상-학습-공간 식별자가 메인 인터페이스 상에 디스플레 이된다. 가상-학습-공간 식별자는 가상 학습 공간에 진입하기 위한 트리거 식별자이고, 적어도 하나의 가상-학 습-공간 식별자는 가상 학습 공간의 트리거 식별자(학습 공간 식별자)를 포함한다. 또한, 도 14의 (b)에 도시된 바와 같이, 가상 학습 공간의 트리거 식별자에 대해 수행된 선택 조작에 응답하여, 제1 사용자 인터페이 스가 생성 및 출력된다. 일부 실시예들에서, 가상 학습 시스템을 구현하기 위한 방법은, 데스크메이트가 시스템에 의해 매칭되는 절차, 학습을 종료하는 절차 등을 포함할 수 있지만, 이에 제한되지 않는다. 데스크메이트가 시스템에 의해 매칭되는 절차에 대해, 특정 동작들은 다음과 같다: S1: 가상 학습 시스템에 라이브러리(즉, 가상 학습 공간) 식별자 입구가 있고, 식별자를 탭함으로써 라이브러리 에 진입할 수 있다. S2: 라이브러리에서, 타깃 및 예상을 설정하기 위한 설정 인터페이스는 \"좌석용 탭\" 버튼을 탭핑함으로써 호출 될 수 있다. S3: 타깃 및 예상된 데스크메이트가 설정 인터페이스 상에 설정될 수 있고, 여기서 12개의 워드 내의 개인화된 서명 카피라이팅이 타깃이 선택된 후에 맞춤화될 수 있고, 설정된 타깃 정보는 데스크메이트와 매칭되도록 구성 된다. S4: 학습 시작 버튼이 탭핑된 후, 대응하는 인터페이스 정보가 디스플레이되고, 예상된 데스크메이트가 없을 때, 사용자 정보 카드만이 디스플레이되고 통신 입력 박스는 디스플레이되지 않으며; 예상된 데스크메이트가 있 을 때, 함께 학습하기 위한 지속기간, 각각의 정보, 및 통신 입력 박스가 디스플레이된다. 학습을 종료하는 절차는 도 15에 구체적으로 도시된다. 학습 인터페이스의 우측 상단 코너의 퇴장 버튼 이 탭핑되고, 학습 팝업 종료 창이 디스플레이되고, 현재 학습 지속기간, 예를 들어, \"40분 59초\" 가 학습 팝업 종료 창에 디스플레이된다. 또한, 학습을 종료한 후에, 라이브러리 페이지로 복귀되 는 인터페이스가 결정된다. 또한, 예를 들어, 사용자가 좌석에 진입한 후의 절차가 도 16에 도시되어 있고, 특정 동작들은 다음과 같다: 동작 S1602: 좌석 찾기 버튼을 탭핑한다. 동작 S1604: 타깃 및 예상을 입력한다. 동작 S1606: 일치하는 타깃을 가진 사용자가 있는지를 결정하기 위해 검색하고, 예인 경우, 동작 S1610이 수행 되거나; 아니오인 경우, 동작 S1608이 수행된다. 동작 S1608: 사용자 정보 카드를 디스플레이하고, 인접한 좌석이 비어 있는 더블-사용자 좌석에 진입한다. 동작 S1610: 사용자의 예상된 데스크메이트가 일치하는지를 결정하고, 예인 경우, 동작 S1612이 수행되거나; 아 니오인 경우, 동작 S1608이 수행된다. 동작 S1612: 사용자 정보 카드들을 디스플레이하고, 더블-사용자 좌석에 진입하고, 함께 학습하기 위한 지속기 간을 디스플레이하고, 통신 입력 박스의 기능을 디스플레이한다.동작 S1614: 학습을 퇴장하기 위해 탭핑한다. 동작 S1616: 라이브러리 페이지로 복귀한다. 일부 실시예들에서, 사용자, 클라이언트의 퍼포먼스 계층, 및 배경 논리 계층 간의 특정 시간 시퀀스의 도면이 도 17에 도시된다. 특정 실행 동작들에 대해서는, 도 16의 전술한 설명을 참조한다. 예를 들어, 사용자는 좌 석용 탭 버튼(tap-for-seat button)을 탭핑하고, 클라이언트의 퍼포먼스 계층은 타깃 및 예상을 설정하기 위한 팝업 UI 인터페이스를 디스플레이한다. 그 후, 사용자는 UI 인터페이스 상에 타깃 및 예상을 입력하고, 학습을 시작하기 위해 탭핑한다. 또한, 클라이언트의 퍼포먼스 계층은 타깃 및 예상의 데이터를 배경 논리 계층에 송신하여 적합한 데스크메이트 와 매칭한다. 적합한 데스크메이트가 매칭된다는 것을 배경 논리 계층이 피드백한 후, 클라이언트의 퍼포먼스 계층은 사용자 정보 카드들을 디스플레이하고, 사용자들이 더블-사용자 좌석에 진입하는 픽처를 디스플레이하고, 함께 학습하기 위한 지속기간을 디스플레이하고, 통신 입력의 기능을 디스플레이하는 등이다. 그 반대로, 배경 논리 계층이 적합한 데스크메이트가 매칭되지 않는다는 것을 피드백한 후에, 클라이언트의 퍼 포먼스 계층은 사용자 정보 카드 및 인접한 좌석이 비어 있는 더블-사용자 좌석에 사용자가 진입하는 픽처를 디 스플레이한다. 또한, 사용자가 학습을 종료하기 위해 탭핑한 후에, 클라이언트의 퍼포먼스 계층은 학습이 종료된다는 것을 배 경 논리 계층에 통지한다. 배경 논리 계층은 좌석을 해제하라는 명령을 반환한다. 그 후, 클라이언트의 퍼포 먼스 계층은 사용자가 라이브러리로 복귀하는 페이지를 디스플레이한다. 이 실시예는 가상 학습 시스템에 대한 구현을 제공하여, 2명의 사용자가 가상 장면에서 함께 학습할 수 있게 한 다. 본 개시내용의 특정 구현에서, 사용자 정보와 같은 관련 데이터가 수반된다. 본 개시내용의 전술한 실시예들이 특정 제품 또는 기술에 적용될 때, 사용자 허가 또는 사용자 동의가 요구되고, 관련 데이터의 수집, 사용 및 처 리는 관련 국가들 및 지역들의 관련 법률들, 규정들, 및 표준들을 준수할 필요가 있다."}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "설명의 용이함을 위해, 전술한 방법 실시예들은 일련의 액션들의 조합들로서 설명된다. 그러나, 본 기술분야의 통상의 기술자는 일부 동작들이 본 개시내용에 따라 다른 순서로 또는 동시에 수행될 수 있기 때문에, 본 개시"}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "내용이 액션들의 임의의 설명된 순서로 제한되지 않는다는 것을 알 것이다. 또한, 본 기술분야의 통상의 기술 자는 명세서에 설명된 모든 실시예가 바람직한 실시예들이고, 관련 액션들 및 모듈들이 반드시 본 개시내용에 필수적인 것은 아니라는 것을 또한 알 것이다. 본 개시내용의 실시예들의 다른 양태에 따르면, 가상 학습 시스템을 구현하기 위한 장치로서, 가상 학습 시스템 을 구현하기 위한 전술한 방법을 수행하도록 구성된 장치가 추가로 제공된다. 도 18에 도시된 바와 같이, 본 장치는: 제1 사용자 인터페이스 상에서 착석 버튼에 대해 제1 사용자에 의해 트리거된 착석 요청에 응답하여, 매칭 예상 정보를 설정하도록 구성된 설정 인터페이스를 디스플레이하도록 구성된 제1 처리 유닛- 제1 사용자 인터 페이스는 가상 학습 시스템에 의해 제공되는 가상 학습 공간과 연관된 사용자 인터페이스이고, 가상 학습 공간 은 적어도 2개의 가상 객체에 바인딩되도록 허용하는 가상 다중-사용자 좌석을 포함함 -; 설정 인터페이스 상에서 제1 사용자에 의해 입력된 매칭 예상 정보를 획득하고, 제1 사용자에 의해 설정된 매칭 예상 정보와 매칭되는 적어도 한 명의 제2 사용자에 관한 정보를 획득하도록 구성된 제1 획득 유닛- 적어 도 한 명의 제2 사용자는 가상 학습 공간과 연관된 후보 사용자들로부터 검색되고 제1 사용자에 의해 입력된 매 칭 예상 정보와 매칭되는 사용자임 -; 및 적어도 한 명의 제2 사용자에 관한 획득된 정보에 응답하여, 제1 사용자에 대응하는 제1 가상 객체 및 적어도 한 명의 제2 사용자에 대응하는 적어도 하나의 제2 가상 객체를 포함하는 제2 사용자 인터페이스를 생성 및 출 력하도록 구성된 제2 처리 유닛- 제1 가상 객체 및 적어도 하나의 제2 가상 객체 양측 모두는 제1 가상 다중-사용자 좌석에 바인딩됨 -을 포함한다. 특정 실시예들에 대해서는, 가상 학습 시스템을 구현하기 위한 전술한 방법에 도시된 예를 참조하고, 세부사항 들은 이 예에서 설명된다. 본 개시내용의 실시예들의 또 다른 양태에 따르면, 가상 학습 시스템을 구현하기 위한 전술한 방법을 수행하기 위한 전자 디바이스가 추가로 제공된다. 도 19에 도시된 바와 같이, 전자 디바이스는 메모리 및 프로세 서를 포함한다. 메모리는 그 안에 저장된 컴퓨터 프로그램을 갖고, 프로세서는 컴퓨터 프로 그램을 통해 전술한 방법 실시예들 중 어느 하나에서의 동작들을 수행하도록 구성된다."}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "본 기술분야의 통상의 기술자는 도 19에 도시된 구조가 일 예일 뿐이라는 것을 이해할 수 있다. 전자 디바이스 는 스마트폰(예를 들어, 안드로이드 모바일 폰 또는 iOS 모바일 폰), 태블릿 컴퓨터, 팜톱 컴퓨터, 모바일 인터 넷 디바이스(MID), 또는 PAD와 같은 단말 디바이스일 수 있다. 도 19는 전자 디바이스의 구조를 제한하지 않 는다. 예를 들어, 전자 디바이스는 도 19에 도시된 것들보다 더 많거나 더 적은(네트워크 인터페이스와 같은) 컴포넌트들을 추가로 포함할 수 있거나, 도 19에 도시된 것과 다른 구성을 갖는다. 메모리는 소프트웨어 프로그램 및 모듈, 예를 들어, 본 개시내용의 실시예들에서 가상 학습 시스템을 구 현하기 위한 방법 및 장치에 대응하는 프로그램 명령어들/모듈들을 저장하도록 구성될 수 있다. 프로세서 는 메모리에 저장된 소프트웨어 프로그램 및 모듈을 실행하여, 다양한 기능 애플리케이션 및 데이 터 처리를 구현, 즉, 가상 학습 시스템을 구현하기 위한 전술한 방법을 구현한다. 메모리는 고속 랜덤 액세스 메모리를 포함할 수 있고, 또한 비휘발성 메모리, 예를 들어, 하나 이상의 자기 저장 장치, 플래시 메모 리, 또는 다른 비휘발성 고체 상태 메모리를 포함할 수 있다. 일부 실시예들에서, 메모리는 프로세서 에 대해 원격으로 배치되는 메모리들을 추가로 포함할 수 있고, 이러한 원격 메모리들은 네트워크를 통해 단말기에 접속될 수 있다. 네트워크의 예들은 인터넷, 인트라넷, 근거리 네트워크, 모바일 통신 네트워크, 및 이들의 조합을 포함하지만, 이에 제한되지 않는다. 메모리는 매칭 예상 정보와 같은 정보를 저장하도록 구체적으로 구성될 수 있지만, 이에 제한되지 않는다. 예를 들어, 도 19에 도시된 바와 같이, 메모리는, 가상 학습 시스템을 구현하기 위한 전술한 장치에 있는 제1 처리 유닛, 제1 획득 유닛, 및 제2 처 리 유닛을 포함할 수 있지만, 이에 제한되지 않는다. 또한, 메모리는 가상 학습 시스템을 구현하 기 위한 전술한 장치의 다른 모듈 유닛을 포함할 수 있지만, 이에 제한되지 않으며, 세부사항들은 이 예에서 설 명되지 않는다. 송신 장치는 네트워크를 통해 데이터를 수신 또는 송신하도록 구성된다. 네트워크의 특정 예들은 유선 네트워크 및 무선 네트워크를 포함할 수 있다. 예에서, 송신 장치는 네트워크 인터페이스 제어기(NIC)를 포함하고, 네트워크 인터페이스 제어기는 네트워크 케이블을 통해 다른 네트워크 디바이스 및 라우터에 접속되 어 인터넷 또는 근거리 네트워크와 통신할 수 있다. 예에서, 송신 장치는 무선 주파수(RF) 모듈이며, 무 선 방식으로 인터넷과 통신하도록 구성된다. 또한, 전술한 전자 디바이스는: 매칭 예상 정보와 같은 정보를 디스플레이하도록 구성된 디스플레이; 및 전자 디바이스 내의 모듈 부분들을 접속하도록 구성된 접속 버스를 추가로 포함한다. 다른 실시예에서, 전술한 단말 디바이스 또는 서버는 분산 시스템에서의 노드일 수 있다. 분산 시스템은 블록 체인 시스템일 수 있고, 블록체인 시스템은 네트워크 통신의 형태로 복수의 노드를 접속함으로써 형성된 분산 시스템일 수 있다. 노드들은 피어 투 피어(P2P) 네트워크를 형성할 수 있고, 임의의 형태의 컴퓨팅 디바이스, 예를 들어, 서버 또는 단말기와 같은 전자 디바이스는 피어-투-피어 네트워크에 합류함으로써 블록체인 시스템 내의 노드가 될 수 있다. 본 개시내용의 양태에 따르면, 컴퓨터 프로그램 제품이 제공된다. 컴퓨터 프로그램 제품은 컴퓨터 프로그램들/ 명령어들을 포함하고, 컴퓨터 프로그램들/명령어들은 흐름도에 도시된 방법을 수행하도록 구성된 프로그램 코드 를 포함한다. 이러한 실시예에서, 컴퓨터 프로그램은 통신부를 통해 네트워크로부터 다운로드되어 설치될 수 있고/있거나, 이동식 매체로부터 설치될 수 있다. 컴퓨터 프로그램이 중앙 처리 유닛에 의해 실행될 때, 본 개 시내용의 이 실시예에서 제공되는 기능들이 실행된다. 본 개시내용의 전술한 실시예들의 시퀀스 번호들은 단지 설명 목적을 위한 것이지만 실시예들의 선호도를 지시 하지 않는다. 전자 디바이스의 컴퓨터 시스템은 단지 예이고, 본 개시내용의 실시예들의 기능들 및 사용 범위들에 대한 임의 의 제한을 구성하지 않는다. 컴퓨터 시스템은 중앙 처리 유닛(CPU)을 포함한다. CPU는 판독 전용 메모리(ROM)에 저장된 프로그램 또는 저장 부로부터 랜덤 액세스 메모리(RAM)에 로딩된 프로그램에 기초하여 다양한 적절한 액션들 및 처리를 수행할 수 있다. 랜덤 액세스 메모리는 시스템을 동작시키기 위해 요구되는 다양한 프로그램들 및 데이터를 추가로 저장 한다. 중앙 처리 유닛, 판독 전용 메모리, 및 랜덤 액세스 메모리는 버스를 통해 서로 접속된다. 입력/출력(I/O) 인터페이스가 또한 버스에 접속된다. 다음의 컴포넌트들: 키보드, 마우스 등을 포함하는 입력부, CRT(cathode ray tube), LCD(liquid crystal display), 스피커 등을 포함하는 출력부, 하드 디스크 등을 포함하는 저장부, 및 근거리 네트워크 또는 모뎀과 같은 네트워크 인터페이스 카드를 포함하는 통신부는 입력/출력 인터페이스에 접속된다. 통신부는 인터넷과 같 은 네트워크를 사용하여 통신 처리를 수행한다. 드라이브는 또한 필요에 따라 입력/출력 인터페이스에 접속된 다. 자기 디스크, 광 디스크, 광자기 디스크 또는 반도체 메모리와 같은 이동식 매체가 필요에 따라 드라이브 상에 설치되며, 따라서 이동식 매체로부터 판독된 컴퓨터 프로그램이 필요에 따라 저장부에 설치된다. 특히, 본 개시내용의 실시예들에 따르면, 방법 흐름도들에서 설명되는 프로세스들은 컴퓨터 소프트웨어 프로그 램들로서 구현될 수 있다. 예를 들어, 본 개시내용의 실시예는 컴퓨터 프로그램 제품을 포함하고, 이러한 컴퓨 터 프로그램 제품은 컴퓨터 판독가능 매체 상에서 운반되는 컴퓨터 프로그램을 포함하고, 이러한 컴퓨터 프로그 램은 흐름도에 도시된 방법들을 수행하도록 구성된 프로그램 코드를 포함한다. 이러한 실시예에서, 컴퓨터 프 로그램은 통신부를 통해 네트워크로부터 다운로드되어 설치될 수 있고/있거나, 이동식 매체로부터 설치될 수 있 다. 컴퓨터 프로그램이 중앙 처리 유닛에 의해 실행될 때, 본 개시내용의 시스템에서 제한된 기능들이 실행된 다. 본 개시내용의 양태에 따르면, 컴퓨터 판독가능 저장 매체가 제공된다. 컴퓨터 디바이스의 프로세서는, 컴퓨터 판독가능 저장 매체로부터 컴퓨터 명령어들을 판독한다. 프로세서는 컴퓨터 명령어들을 실행하여 컴퓨터 디바 이스가 전술한 선택적 구현들에서 제공되는 방법을 수행할 수 있게 한다."}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "일부 실시예들에서, 본 기술분야의 통상의 기술자는 전술한 실시예들에서의 방법들의 동작들의 전부 또는 일부 가 단말 디바이스에 관련된 하드웨어에 명령하는 프로그램에 의해 구현될 수 있다는 것을 이해할 수 있다. 프 로그램은 컴퓨터 판독가능 저장 매체에 저장될 수 있고, 저장 매체는: 플래시 드라이브, 판독 전용 메모리, 랜 덤 액세스 메모리, 자기 디스크, 광 디스크 등을 포함할 수 있다. 본 개시내용의 전술한 실시예들의 시퀀스 번호들은 단지 설명 목적을 위한 것이지만 실시예들의 선호도를 지시 하지 않는다. 전술한 실시예들에서의 통합 유닛이 소프트웨어 기능 유닛의 형태로 구현되고 독립적인 제품으로서 판매되거나 또는 사용될 때, 이러한 통합 유닛은 전술한 컴퓨터 판독가능 저장 매체에 저장될 수 있다. 그러한 이해에 기 초하여, 본질적으로 본 개시내용의 기술적 해결책들, 또는 종래 기술에 기여하는 부분, 또는 기술적 해결책들의 전부 또는 일부는 소프트웨어 제품의 형태로 구현될 수 있다. 컴퓨터 소프트웨어 제품은 저장 매체에 저장되고, 하나 이상의 컴퓨터 디바이스들(개인용 컴퓨터, 서버, 네트워크 디바이스 등일 수 있음)이 본 개시내 용의 실시예들에서 설명되는 방법들의 동작들의 전부 또는 일부를 수행할 수 있게 하기 위해 사용되는 몇몇 명 령어들을 포함한다. 본 개시내용의 전술한 실시예들에서, 실시예들의 설명들은 상이한 강조점들을 갖는다. 일 실시예에서 상세히 설명되지 않은 부분에 대해서는 다른 실시예들에서의 관련 설명들을 참조한다. 본 개시내용에서 제공되는 몇몇 실시예들에서, 개시된 클라이언트는 다른 방식으로 구현될 수 있다. 설명된 장 치 실시예들은 예시적일 뿐이다. 예를 들어, 유닛 분할은 단지 논리적 기능 분할이고 실제 구현에서는 다른 분 할 방식들을 가질 수 있다. 예를 들어, 복수의 유닛 또는 컴포넌트가 결합되거나 다른 시스템에 통합되거나, 또는 일부 특징들이 무시되거나 수행되지 않을 수 있다. 또한, 디스플레이되거나 논의된 상호 결합들 또는 직 접 결합들 또는 통신 접속들은 일부 인터페이스들을 사용하여 구현될 수 있다. 유닛들 또는 모듈들 사이의 간 접 결합들 또는 통신 접속들은 전자 또는 다른 형태들로 구현될 수 있다. 별개의 부분들로 설명된 유닛들은 물리적으로 별개일 수 있고 그렇지 않을 수 있고, 유닛들로서 디스플레이된 부분들은 물리적 유닛일 수 있고 그렇지 않을 수 있으며, 하나의 위치에 위치할 수 있거나, 또는 복수의 네트워 크 유닛 상에 분포될 수 있다. 유닛들 중 일부 또는 전부가 실시예들의 해결책들의 목적을 달성하기 위해 실제 필요에 기초하여 선택될 수 있다. 또한, 본 개시내용의 실시예들에서 기능 유닛들은 하나의 처리 유닛으로 통합될 수 있거나, 또는 유닛들 각각이 물리적으로 단독으로 존재할 수 있거나, 또는 둘 이상의 유닛들이 하나의 유닛으로 통합된다. 통합 유닛은 하 드웨어의 형태로 구현될 수 있거나, 또는 소프트웨어 기능 유닛의 형태로 구현될 수 있다."}
{"patent_id": "10-2024-7033599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "전술한 설명들은 단지 본 개시내용의 바람직한 구현들이다. 본 기술분야의 통상의 기술자는 본 개시내용의 원 리를 벗어나지 않고 몇몇 개선들 및 수정들을 추가로 행할 수 있다. 이들 개선들과 수정들은 본 개시내용의 보 호 범위 내에 속할 것이다."}
{"patent_id": "10-2024-7033599", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 방법의 응용 환경의 개략도이 다. 도 2는 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 방법의 개략적인 흐름도이다. 도 3은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 방법의 개략도이다. 도 4는 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 5는 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 6은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 7은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 8은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 9는 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 10은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 11은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 12는 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 13은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 14는 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 15는 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 16은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다. 도 17은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 다른 방법의 개략도이다.도 18은 본 개시내용의 다양한 실시예들에 따른 가상 학습 시스템을 구현하기 위한 장치의 개략도이다. 도 19는 본 개시내용의 다양한 실시예들에 따른 전자 디바이스의 구조의 개략도이다."}
