{"patent_id": "10-2023-0120060", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0037804", "출원번호": "10-2023-0120060", "발명의 명칭": "스마트 천연 이끼 공기정화 시스템", "출원인": "이진영", "발명자": "이진영"}}
{"patent_id": "10-2023-0120060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트 천연 이끼 공기청정 시스템에 있어서,실내 환경(3)의 공기 상태를 모니터링하며, 이끼의 상태를 촬영함으로써 데이터를 획득하는 환경 데이터 처리모듈(13);실내 환경(3)에 설치되고, 이끼의 비정상 상태가 탐지되면 공기 청정 시스템(2)의 작동을 조절하는 공기 청정작동 신호 출력 모듈(135);환경 데이터 처리 모듈(13)로부터 획득된 데이터를 분석하고, 이끼의 상태를 판단하여 데이터 학습 모듈(111)과정상 이끼 상태 분석 모듈(131)을 통해 특성 데이터 획득 모듈(113)으로 입력, 이후 최종 이끼 상태 판단 모듈(133)을 통해 이끼의 상태 판단하고, 비정상 상태가 탐지되면 공기 청정 작동 신호 출력 모듈(135)을 통해 공기청정 시스템(2)에 작동 신호를 전달하는 머신러닝 분석 모듈(11);를 포함하는 스마트 천연 이끼 공기청정 시스템"}
{"patent_id": "10-2023-0120060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 머신러닝 분석 모듈(11)은데이터 학습 모듈(111)은, 환경 데이터 처리 모듈(13)로부터 받은 공기 상태 데이터와 이끼 상태 데이터를 이용하여 이끼의 건강 상태 판별 모델을 학습하는 모듈;특성 데이터 획득 모듈(113)은, 학습된 모델을 이용하여 실시간으로 수집된 데이터에서 이끼의 건강 상태 관련특성을 추출하는 모듈; 및정상 이끼 상태 분석 모듈(131) 및 최종 이끼 상태 판단 모듈(133)은, 추출된 특성을 분석하여 이끼의 건강 상태를 판별하고, 이끼의 상태에 따라 공기 청정 시스템(2)을 제어하는 신호를 출력하는 모듈;를 포함하는, 스마트 천연 이끼 공기청정 시스템"}
{"patent_id": "10-2023-0120060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 환경 데이터 처리 모듈(13)은실내 환경(3)에서 발생하는 공기 상태를 측정하여 공기 상태 데이터를 생성하는 적어도 하나의 공기 상태 측정센서;실내 환경(3)에서 이끼의 상태를 촬영하여 이끼 상태 데이터를 생성하는 적어도 하나의 이끼 상태 측정 카메라;및측정된 공기 상태 데이터와 이끼 상태 데이터를 수집하고, 해당 데이터를 머신러닝 분석 모듈(11)로 전달하는데이터 수집 및 전송 모듈;를 더 포함하는, 스마트 천연 이끼 공기청정 시스템"}
{"patent_id": "10-2023-0120060", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 실내 환경에서 공기 청정화를 실시하는 스마트 천연 이끼 공기청정 시스템; 이끼의 상태를 실시간으로 모니터링하고 분석하는 머신러닝 분석 모듈; 이끼의 상태와 실내 환경에 따라 공기 청정기의 작동을 제어하는 제 어부; 이끼를 고정하고 유지하는 이끼 고정 장치를 포함하는 것을 특징으로 하는 공기 청정 시스템을 개시한다. 본 시스템을 통해 실시간으로 이끼의 상태를 학습하고, 이를 기반으로 공기 청정 작업을 실시함으로써, 최적의 실내 환경을 유지하는 동시에 이끼의 건강 상태를 유지할 수 있다."}
{"patent_id": "10-2023-0120060", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 천연 이끼 공기청정 시스템에 관한 것으로, 특히, 실내 환경 데이터와 천연 이끼의 상태 정보 를 이용해 최적의 공기 청정 조건을 동적으로 결정하고, 인공지능과 머신러닝 기법을 통해 실시간 데이터 분석 및 예측하여 천연 이끼의 성장과 공기 청정 활동을 최적화하는 스마트 천연 이끼 공기청정 시스템에 관한 것이다."}
{"patent_id": "10-2023-0120060", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적인 공기 청정 시스템은 공기 중의 먼지나 미세물질을 물리적인 필터를 통해 제거하거나, 화학 반응을 이 용해 오염물질을 분해하는 방식으로 운용된다. 이런 시스템은 오염 물질의 제거만을 목표로 하며, 실내 환경의 상세한 조건이나 청정 공기가 필요한 사용자의 상태 등을 고려하지 않는다. 또한, 이들 기존 시스템은 주로 인공적인 필터나 화학 물질을 이용하므로, 필터 교체나 유지보수 비용이 발생하 며, 처리 과정에서 발생하는 부산물이나 소모되는 에너지 등이 환경에 부담을 줄 수 있다. 그러나 이끼를 이용 한 공기 청정 시스템은 이러한 문제점을 해결하기 위해 천연 이끼를 활용해 공기 중의 이산화탄소를 흡수하고 산소를 생성하는 방식을 사용한다. 이끼 기반의 공기 청정 시스템에서는 이끼의 생장과 청정 활동을 적절히 관리하고, 실내 환경 변화에 따라 적응 할 수 있게 하는 것이 중요하다. 하지만, 기존의 이끼를 활용한 공기 청정 시스템은 이끼의 생장 상태나 실내 환경 변화를 충분히 반영하지 못하며, 이에 따른 최적의 운용 조건을 자동으로 결정할 수 없다는 문제가 있다. 이로 인해, 이끼의 청정 효과가 저하되거나, 실내 환경에 따라 이끼가 적절히 유지되지 못하는 문제점이 있다. 따라서, 이를 개선할 필요성이 요청된다."}
{"patent_id": "10-2023-0120060", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서의 목적은, 실내 환경을 측정하여 이끼의 상태를 최적화된 운용 조건을 자동으로 제어하는 스마트 공 기 청정 시스템을 구현하는 것이다. 또한, 본 명세서의 목적은, 모니터링되는 이끼의 건강 상태, 성장 상태 및 환경 변화를 이용하여, 인공지능 모 듈을 통해 이끼의 현재 및 미래 상태를 예측하고, 이끼를 효율적으로 관리하며, 실내 공기의 청정 상태를 최적 화하는 시스템을 구현하는 것이다. 본 명세서가 해결하고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않 은 또 다른 기술적 과제들은 이하의 명세서의 상세한 설명으로부터 본 명세서가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 한편, 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하"}
{"patent_id": "10-2023-0120060", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0120060", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위해, 본 명세서의 일 양상은, 공기 청정 시스템이 인공지능 모듈을 이용하여 이끼를 관리하는 방법에 있어서, 사용자로부터 초기 설정을 위한 기준값을 입력받는 단계; 상기 기준값에 근거하여 설 정값을 설정하고, 상기 설정값에 근거하여 습도 조절을 수행하는 단계; 상기 인공지능 모듈을 통해, 주기적으로 실내온습도, RGB 값, 이끼 성장 상태 및 공기 청정도를 모니터링하고 저장하는 단계; 및 상기 모니터링의 결과 값에 근거하여, 작동부를 제어하는 단계; 를 포함하며, 상기 작동부는 습도 제어 장치, 공기 순환 팬, 조명 장 치 등을 포함할 수 있다. 또한, 상기 기준값은 습도 조절 기준값, 조명 조절 기준값, 공기 청정 기준값 등을 포 함할 수 있다. 또한, 상기 모니터링의 결과값에 근거하여, 작동부를 제어하는 단계는 상기 모니터링된 RGB 값에 근거하여: 이 끼의 건강상태 및 성장 상태에 따라 상기 습도 및 조명의 조절 주기를 변경하는 단계; 및 상기 모니터링된 공기 청정도에 따라 공기 순환 팬의 작동 주기를 변경하는 단계; 를 포함할 수 있다. 또한, 상기 인공지능 모듈을 통해, 상기 저장된 RGB 값에 근거하여, 이끼의 상태 변화를 측정하고, 상기 변화량 의 기울기값을 계산하는 단계; 상기 인공지능 모듈을 통해, 상기 저장된 공기 청정도에 근거하여, 공기 청정도 변화량을 측정하고, 상기 변화량의 기울기값을 계산하는 단계; 상기 인공지능 모듈을 통해, 상기 기울기값 및 상기 공기 청정도 변화량에 근거하여, 공기 오염 예측을 수행하는 단계; 를 더 포함할 수 있다. 또한, 상기 인공지능 모듈을 통해, 상기 공기 오염 예측이 일정 기간 이후, 특정값을 초과하는 것으로 예측되는 것에 근거하여, 서버에 경고 메시지를 전달하는 단계; 를 더 포함할 수 있다.본 명세서의 또 다른 일 실시예는 인공지능 모듈을 이용하여 이끼를 관리하는 공기 청정 시스템에 있어서, 실내 환경 및 이끼와 관련된 센싱 데이터를 생성하기 위한 센싱부, 습도 제어 장치, 공기 순환 팬, 조명 장치 등을 포함하는 작동부, RGB 카메라, 이끼 성장 상태 센서, 공기 청정도 센서를 포함하는 모니터링부, 상기 인공지능 모듈 및 상기 센싱부, 상기 작동부, 상기 모니터링부 및 상기 인공지능 모듈을 기능적으로 제어하기 위한 제어 부를 포함하며, 상기 제어부는 사용자로부터, 초기 설정을 위한 기준값을 입력받고, 상기 기준값에 근거하여 설 정값을 설정하고, 상기 설정값에 근거하여 습도 조절을 수행하며, 상기 인공지능 모듈을 통해, 주기적으로 실내 온습도, RGB 값, 이끼 성장 상태 및 공기 청정도를 모니터링하고 저장하고, 상기 모니터링의 결과값에 근거하여, 상기 작동부를 제어할 수 있다."}
{"patent_id": "10-2023-0120060", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 구성에 의하여 본 발명의 스마트 천연 이끼 공기청정 시스템은 실내 환경에서의 공기 청정화 능력 을 향상시키는 것은 물론, 천연 이끼의 상태를 실시간으로 모니터링하고 빠르게 대응하여 이끼의 건강 상태를 유지하는데 매우 유용하다. 본 발명은 건강한 실내 환경을 제공하면서도 이끼의 생존과 성장을 촉진시키며, 공 기청정 시스템의 효율성을 크게 향상시키는 장점을 갖는다. 머신러닝 알고리즘을 활용하여 이끼의 상태를 정확 하게 판단하고, 공기 청정 시스템의 작동 여부를 실시간으로 조절하므로, 전체 시스템의 에너지 효율성을 높이 는 데도 크게 기여한다는 장점을 갖는다. 한편, 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효"}
{"patent_id": "10-2023-0120060", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0120060", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시 예를 첨부된 도면들을 참조하여 더욱 상세하게 설명한다. 본 발명의 실시 예는 여러 가지 형태로 변형할 수 있으며, 본 발명의 범위가 아래의 실시 예들로 한정되는 것으로 해석되어서는 안 된다. 본 실 시 예는 당업계에서 평균적인 지식을 가진 자에게 본 발명을 더욱 완전하게 설명하기 위해 제공되는 것이다. 이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 도시된 바와 같이 실내 환경에서 공기 청정화를 효과적으로 수행하는 시스템입니다. 본 발명의 핵심은 인공지능 알고리즘을 사용하여 이끼의 상태를 학습하고, 이를 기반으로 공기 청정화 작업을 조절하는 것에 있다. 도1은 시스템의 핵심 부호들을 정리한 것으로, 이끼의 상태를 실시간으로 파악하고 분석하는 머신러닝 분석 모 듈과, 이를 바탕으로 공기 청정 작업을 실행하는 공기 청정 시스템으로 구성되어 있다. 도2는 이 시스템의 작동 순서를 보여준다. 특성 데이터 획득 모듈은 이끼와 관련된 여러 특성 데이터를 실시간 으로 수집합니다. 이 데이터는 데이터 학습 모듈에서 사용되며, 이 모듈은 머신러닝 알고리즘을 사용하여 이끼 의 상태를 학습한다. 이끼의 상태가 정상인지, 아니면 관리가 필요한 상태인지를 판단하는 것은 정상 이끼 상태 분석 모듈의 역할이 다. 이 모듈이 판단한 결과를 바탕으로 최종 이끼 상태 판단 모듈은 공기 청정기가 작동해야 할지, 아니면 멈춰 야 할지를 결정한다. 공기 청정 작동 신호 출력 모듈은 이 결정을 바탕으로 공기 청정기를 조절하며, 이를 통해 최적의 실내 환경을 유지한다. 이러한 과정은 지속적으로 반복되며, 이를 통해 스마트 천연 이끼 공기청정 시스템은 실시간으로 최 적의 실내 환경을 제공한다. 본 발명을 실시하기 위해서는 먼저 이끼의 특성 데이터를 수집하고, 이를 분석하여 학습해야 한다. 그 다음으로 는 학습된 데이터를 바탕으로 이끼의 상태를 판단하고, 이를 통해 공기 청정기를 조절해야 한다. 이 과정을 지속적으로 반복함으로써 실내 환경을 최적화하고 공기 청정을 유지할 수 있습니다. 이상의 상세한 설명은 본 발명을 예시하는 것이다. 또한 전술한 내용은 본 발명의 바람직한 실시 형태를 나타내 어 설명하는 것이며, 본 발명은 다양한 다른 조합, 변경 및 환경에서 사용할 수 있다. 즉 본 명세서에 개시된 발명의 개념의 범위, 저술한 개시 내용과 균등한 범위 및/또는 당업계의 기술 또는 지식의 범위내에서 변경 또 는 수정이 가능하다. 저술한 실시예는 본 발명의 기술적 사상을 구현하기 위한 최선의 상태를 설명하는 것이 며,본 발명의 구체적인 적용 분야 및 용도에서 요구되는 다양한 변경도 가능하다. 따라서 이상의 발명의 상세한 설명은 개시된 실시 상태로 본 발명을 제한하려는 의도가 아니다. 또한 첨부된 청구범위는 다른 실시 상태도 포 함하는 것으로 해석되어야 한다. 산업상 이용가능성 본 발명 \"스마트 천연 이끼 공기청정 시스템\"은 실내 환경을 개선하고 실시간으로 이끼의 상태를 모니터링하여 공기 청정화 작업을 조절하는 새로운 방법을 제공한다. 이러한 시스템은 공공장소, 사무실, 학교, 병원, 주택 등 다양한 실내 환경에서 사용될 수 있으며, 특히 공기 질이 중요한 곳에서 유용하게 활용될 수 있다. 본 발명은 인공지능과 머신러닝 기술을 이용해 실시간으로 실내 환경을 감지하고, 환경에 따라 공기 청정기의 작동을 자동으로 조절한다. 효과적인 실내 공기 관리를 가능하게 하여, 건강한 실내 환경을 제공하는데 기여한 다."}
{"patent_id": "10-2023-0120060", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 스마트 천연 이끼 공기청정 시스템에 관한 본 발명의 전체적인 구성을 나타낸 사시도 도 2는 본 발명에 따른 스마트 천연 이끼 공기청정 시스템의 작동 과정을 나타낸 흐름도 도 3은 본 발명에 따른 스마트 천연 이끼 공기청정 시스템을 기존 천연 이끼 공기청정기에 도입되어 동작하는 사시도."}
