{"patent_id": "10-2023-0161996", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0076731", "출원번호": "10-2023-0161996", "발명의 명칭": "인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치 및 방법", "출원인": "주식회사 씽즈", "발명자": "이원엽"}}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통신부;임산부의 피검사 수치를 예측하기 위한 적어도 하나의 프로세스를 저장하고 있는 메모리; 및상기 프로세스에 따라 동작하는 프로세서;를 포함하고,상기 프로세서는,상기 통신부를 통해 상기 임산부인 사용자의 단말로부터 임신 테스트기의 결과가 촬영된 이미지를 획득하고, 상기 이미지를 전처리하고, 상기 이미지를 기 구축된 인공지능 모델에 입력하여 상기 사용자의 피검사 수치를 예측하고, 상기 예측된 피검사 수치를 상기 사용자 단말로 제공하고,상기 인공지능 모델은, 상기 임신 테스트기에 포함된 제1 라인 및 제2 라인의 진하기 및 상기 사용자의 임신주수를 기반으로 상기 사용자의 피검사 수치를 예측하는 것인, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치."}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는, 상기 인공지능 모델을 이용하여 분석된 상기 제1 라인 및 상기 제2 라인의 진하기를 기초로 상기 사용자의 정상착상 여부를 예측하는, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치."}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는, 상기 인공지능 모델을 이용하여 상기 제1 라인 및 상기 제2 라인의 진하기의 변화 패턴을 분석하고, 상기 분석된 변화 패턴을 기초로 상기 사용자의 정상 착상 임신주수를 예측하는, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치."}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는, 상기 인공지능 모델을 이용하여 분석된 상기 제1 라인 및 상기 제2 라인의 진하기를 기초로 상기 사용자의 유산여부를 예측하는, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치."}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로세서는, 상기 인공지능 모델을 이용하여 상기 제1 라인 및 상기 제2 라인의 진하기의 변화 패턴을 분석하고, 상기 분석된 변화 패턴이 상기 사용자의 현재 임신주수의 평균 변화 패턴과 차이가 있는 경우 유산 위험이 있는 것으로판단하는, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치."}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0076731-3-제1항에 있어서,상기 프로세서는, 상기 인공지능 모델을 이용하여 상기 제1 라인 및 상기 제2 라인의 진하기의 변화 패턴을 분석하고, 상기 분석된 변화 패턴에 기초하여 상기 사용자의 현재 임신주수 이후의 임신주수에서 상기 사용자의 피검사 수치를 예측하는, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치."}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는,상기 예측된 피검사 수치가 상기 사용자의 현재 임신주수에 대해 기 설정된 최소값보다 작으면, 상기 사용자 단말로 추천 제품 정보를 제공하는, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치."}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 인공지능 모델은,복수의 다른 임산부들 각각의 임신주수별 임신 테스트기 이미지 및 피검사 수치를 데이터셋으로 활용하여 학습되는, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치."}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "장치에 의해 수행되는 방법에 있어서,임산부인 사용자의 단말로부터 임신 테스트기의 결과가 촬영된 이미지를 획득하는 단계;상기 이미지를 전처리하는 단계;상기 이미지를 기 구축된 인공지능 모델에 입력하여 상기 사용자의 피검사 수치를 예측하는 단계; 및상기 예측된 피검사 수치를 상기 사용자 단말로 제공하는 단계;를 포함하고,상기 인공지능 모델은, 상기 임신 테스트기에 포함된 제1 라인 및 제2 라인의 진하기 및 상기 사용자의 임신주수를 기반으로 상기 사용자의 피검사 수치를 예측하는 것인, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 방법."}
{"patent_id": "10-2023-0161996", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어인 컴퓨터와 결합되어, 제9항의 방법을 실행하는 컴퓨터 프로그램이 저장된 컴퓨터 판독 가능한 기록매체."}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치 및 방법이 제공된다. 상기 장치는 통신부, 임산부의 피 검사 수치를 예측하기 위한 적어도 하나의 프로세스를 저장하고 있는 메모리 및 상기 프로세스에 따라 동작하는 프로세서를 포함하고, 상기 프로세서는, 상기 통신부를 통해 상기 임산부인 사용자의 단말로부터 임신 테스트기 의 결과가 촬영된 이미지를 획득하고, 상기 이미지를 전처리하고, 상기 이미지를 기 구축된 인공지능 모델에 입 력하여 상기 사용자의 피검사 수치를 예측하고, 상기 예측된 피검사 수치를 상기 사용자 단말로 제공할 수 있다."}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "임신 테스트기는 소변으로 배출되는 임신 호르몬(hCG)을 통해 임신 여부를 확인하는 진단 키트이다. 혈중 hCG는 착상 시기, 즉 배란 6~12일 후에 검출할 수 있고, 소변에서는 혈액보다 늦은 2~3일 후에 검출이 가 능하다. 그리고, 2일 지날 때마다 hCG수치는 2배씩 증가해야 배아가 정상적으로 착상되었다는 것을 나타낸다. 만약, hCG 농도가 적절하게 증가하지 않는 경우 유산을 의심할 수 있다. 이렇게 혈중 hCG는 이와 같이 임신 진단에 있어서 매우 중요한 지표가 된다. 하지만, 일반적인 사람들이 수시로 병원을 방문하여 hCG를 측정하는 것은 현실적으로 많은 어려움이 있다. 이에, 임신 테스트기의 결과를 분석하여 사용자의 임신 상태를 분석할 수 있는 기술을 제공하게 되면, 많은 사 람들에게 큰 도움이 될 것으로 기대되지만, 현재로서는 이러한 기술이 개시되어 있지 않은 상황이다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2018-0025714호, 2018. 03. 09."}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에 개시된 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치 및 방법을 제공하는데 그 목적이 있 다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 본 개시의 일 측면에 따른 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치는, 통신부, 임산부의 피검사 수치를 예측하기 위한 적어도 하나의 프로세스를 저장하고 있는 메모리 및 상기 프로세스에 따라 동작하는 프로세서를 포함하고, 상기 프로세서는, 상기 통신부를 통해 상기 임산부인 사용자의 단말로부터 임신 테스트기의 결과가 촬영된 이미지를 획득하고, 상기 이미지를 전처리하고, 상기 이미 지를 기 구축된 인공지능 모델에 입력하여 상기 사용자의 피검사 수치를 예측하고, 상기 예측된 피검사 수치를 상기 사용자 단말로 제공하고, 상기 인공지능 모델은, 상기 임신 테스트기에 포함된 제1 라인 및 제2 라인의 진 하기 및 상기 사용자의 임신주수를 기반으로 상기 사용자의 피검사 수치를 예측하는 것일 수 있다. 또한, 상기 프로세서는, 상기 인공지능 모델을 이용하여 분석된 상기 제1 라인 및 상기 제2 라인의 진하기를 기 초로 상기 사용자의 정상 착상 여부를 예측할 수 있다. 또한, 상기 프로세서는, 상기 인공지능 모델을 이용하여 상기 제1 라인 및 상기 제2 라인의 진하기의 변화 패턴 을 분석하고, 상기 분석된 변화 패턴을 기초로 상기 사용자의 정상 착상 임신주수를 예측할 수 있다. 또한, 상기 프로세서는, 상기 인공지능 모델을 이용하여 분석된 상기 제1 라인 및 상기 제2 라인의 진하기를 기 초로 상기 사용자의 유산 여부를 예측할 수 있다. 또한, 상기 프로세서는, 상기 인공지능 모델을 이용하여 상기 제1 라인 및 상기 제2 라인의 진하기의 변화 패턴 을 분석하고, 상기 분석된 변화 패턴이 상기 사용자의 현재 임신주수의 평균 변화 패턴과 차이가 있는 경우 유 산 위험이 있는 것으로 판단할 수 있다. 또한, 상기 프로세서는, 상기 인공지능 모델을 이용하여 상기 제1 라인 및 상기 제2 라인의 진하기의 변화 패턴 을 분석하고, 상기 분석된 변화 패턴에 기초하여 상기 사용자의 현재 임신주수 이후의 임신주수에서 상기 사용 자의 피검사 수치를 예측할 수 있다. 또한, 상기 프로세서는, 상기 예측된 피검사 수치가 상기 사용자의 현재 임신주수에 대해 기 설정된 최소값보다 작으면, 상기 사용자 단말로 추천 제품 정보를 제공할 수 있다. 또한, 상기 인공지능 모델은, 복수의 다른 임산부들 각각의 임신주수별 임신 테스트기 이미지 및 피검사 수치를 데이터셋으로 활용하여 학습될 수 있다. 또한, 상술한 기술적 과제를 달성하기 위한 본 개시의 다른 측면에 따른 인공지능 모델을 이용한 임산부의 피검 사 수치 예측 방법은, 임산부인 사용자의 단말로부터 임신 테스트기의 결과가 촬영된 이미지를 획득하는 단계, 상기 이미지를 전처리하는 단계, 상기 이미지를 기 구축된 인공지능 모델에 입력하여 상기 사용자의 피검사 수 치를 예측하는 단계 및 상기 예측된 피검사 수치를 상기 사용자 단말로 제공하는 단계를 포함하고, 상기 인공지능 모델은, 상기 임신 테스트기에 포함된 제1 라인 및 제2 라인의 진하기 및 상기 사용자의 임신주수를 기반으 로 상기 사용자의 피검사 수치를 예측하는 것일 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프 로그램이 더 제공될 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기 록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 전술한 과제 해결 수단에 의하면, 임신 테스트기 이미지를 분석하여 임산부의 혈액 수치를 예측해줌 으로써, 임산부들은 병원에 방문하지 않고도 매일 스스로 자신의 혈액 수치를 확인할 수 있다. 뿐만 아니라, 임신 테스트기 이미지 분석을 통해 임산부의 호르몬 수치 변화의 패턴을 파악하여 임산부의 정상 착상 여부, 유산 위험 정도 등 다양한 정보를 제공할 수 있다. 이를 통해 임산부는 병원에 방문하지 않고도 자 신의 현재 상태를 파악할 수 있게 된다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 개시가 실시예들의 모든 요소들을 설명하"}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한다. 명세서에서 사용되는 ‘부, 모듈, 부재, 블록’이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블 록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있 다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접 적인 연결은 무선 통신망을 통해 연결되는 것을 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제 1, 제 2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 설명에 앞서 본 명세서에서 사용하는 용어의 의미를 간략히 설명한다. 그렇지만 용어의 설명은 본 명세서의 이 해를 돕기 위한 것이므로, 명시적으로 본 개시를 한정하는 사항으로 기재하지 않은 경우에 본 개시의 기술적 사 상을 한정하는 의미로 사용하는 것이 아님을 주의해야 한다. 본 명세서에서 '장치'는 연산처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들이 모두 포함된 다. 예를 들어, 장치는, 컴퓨터, 서버 장치 및 휴대용 단말기를 모두 포함하거나, 또는 어느 하나의 형태가 될 수 있다. 여기에서, 상기 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱 (laptop), 태블릿 PC, 슬레이트 PC 등을 포함할 수 있다. 상기 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 애플리케이션 서버, 컴퓨팅 서버, 데이터베이스 서버, 파일 서버, 게임 서버, 메일 서버, 프록시 서버 및 웹 서버 등을 포함할 수 있다. 상기 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD) 등과 같은 웨어러블 장치를 포함할 수 있다. 본 개시에 따른 인공 지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공 지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인공 지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공 지능 전 용 프로세서인 경우, 인공 지능 전용 프로세서는, 특정 인공 지능 모델의 처리에 특화된 하드웨어 구조로 설계 될 수 있다. 기 정의된 동작 규칙 또는 인공 지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만들어진다는 것은, 기본 인공 지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으 로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공 지능 모델이 만들어짐을 의미한다. 이러한 학습은 본 개시에 따른 인공 지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서 버 및/또는 시스템을 통해 이루어질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습 (reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공 지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공 지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 프로세서는 뉴럴 네트워크를 생성하거나, 뉴럴 네트워크를 훈련(train, 또는 학습(learn)하거나, 수신되는 입력 데이터를 기초로 연산을 수행하고, 수행 결과를 기초로 정보 신호(information signal)를 생성하거나, 뉴럴 네 트워크를 재훈련(retrain)할 수 있다. 뉴럴 네트워크는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), 퍼셉트론(perceptron), 다층 퍼셉트론(multilayer perceptron), FF(Feed Forward), RBF(Radial Basis Network), DFF(Deep FeedForward), LSTM(Long Short Term Memory), GRU(Gated Recurrent Unit), AE(Auto Encoder), VAE(Variational Auto Encoder), DAE(Denoising Auto Encoder), SAE(Sparse Auto Encoder), MC(Markov Chain), HN(Hopfield Network), BM(Boltzmann Machine), RBM(Restricted Boltzmann Machine), DBN(Depp Belief Network), DCN(Deep Convolutional Network), DN(Deconvolutional Network), DCIGN(Deep Convolutional Inverse Graphics Network), GAN(Generative Adversarial Network), LSM(Liquid State Machine), ELM(Extreme Learning Machine), ESN(Echo State Network), DRN(Deep Residual Network), DNC(Differentiable Neural Computer), NTM(Neural Turning Machine), CN(Capsule Network), KN(Kohonen Network) 및 AN(Attention Network)를 포함 할 수 있으나 이에 한정되는 것이 아닌 임의의 뉴럴 네트워크를 포함할 수 있음은 통상의 기술자가 이해할 것이다. 본 개시의 예시적인 실시예에 따르면, 프로세서는 GoogleNet, AlexNet, VGG Network 등과 같은 CNN(Convolution Neural Network), R-CNN(Region with Convolution Neural Network), RPN(Region Proposal Network), RNN(Recurrent Neural Network), S-DNN(Stacking-based deep Neural Network), S-SDNN(State-Space Dynamic Neural Network), Deconvolution Network, DBN(Deep Belief Network), RBM(Restrcted Boltzman Machine), Fully Convolutional Network, LSTM(Long Short-Term Memory) Network, Classification Network, Generative Modeling, eXplainable AI, Continual AI, Representation Learning, AI for Material Design, 자 연어 처리를 위한 BERT, SP-BERT, MRC/QA, Text Analysis, Dialog System, GPT-3, GPT-4, 비전 처리를 위한 Visual Analytics, Visual Understanding, Video Synthesis, ResNet 데이터 지능을 위한 Anomaly Detection, Prediction, Time-Series Forecasting, Optimization, Recommendation, Data Creation 등 다양한 인공 지능 구조 및 알고리즘을 이용할 수 있으며, 이에 제한되지 않는다. 본 명세서에서 '피검사 수치'는 HCG 호르몬의 수치를 의미할 수 있다. 이하, 첨부된 도면을 참조하여 본 개시의 실시예를 상세하게 설명한다. 도 1은 본 개시의 일 실시예에 따른 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치(이하, 피검사 수 치 예측 장치)를 설명하기 위한 도면이다. 도 1을 참조하면, 일 실시예에 따른 인공지능 모델을 이용한 임산부의 피검사 수치를 예측하기 위한 시스템은 피검사 수치 예측 장치가 사용자 단말로부터 임신 테스트기 이미지를 획득하면, 획득된 이미지를 이용 하여 임산부의 현재 건강 상태에 대한 예측 결과를 제공할 수 있다. 이때, 건강 상태에 대한 예측 결과는 임산 부의 현재 임신주수의 피검사 수치, 미래 임신주수의 피검사 수치, 정상 착상 여부, 유산 위험 정도를 포함할 수 있지만, 이제 제한되는 것은 아니다. 피검사 수치 예측 장치는 서비스 플랫폼을 통해 사용자들(임산부들)에게 인공지능 모델을 기반으로 한 피검 사 수치 예측 서비스를 제공하는 서버 장치일 수 있다. 피검사 수치 예측 장치는 사용자가 상기 서비스를 이용하면서 생성되는 정보 및 데이터들을 저장하고 관리 할 수 있다. 사용자 단말은 상기 서비스를 이용하는 사용자(임산부)의 단말 장치를 의미할 수 있다. 사용자는 사용자 단 말에 피검사 수치 예측 장치를 통해 온라인 웹 또는 앱의 형태로 서비스를 이용할 수 있다. 사용자 단말은 컴퓨터와 같은 정보처리수단이 적용될 수 있으며, 제어부와 같은 프로세서, 카메라와 같은 촬영 수단, 터치 스크린을 포함하는 입출력 수단을 포함하고, 통신 기능을 포함한 모든 장치를 의미할 수 있다. 즉, 스마트폰, 태블릿, PDA, 랩탑, 데스크탑 등과 같은 디바이스라면 무엇이든 적용이 가능하다. 도 1을 참조하면, 일 실시예에 따른 피검사 수치 예측 장치는 통신부, 메모리 및 프로세서를 포함할 수 있다. 프로세서는 이미지 관리 모듈, 이미지 분석 모듈 및 AI 기반 예측 모듈을 포함할 수 있다. 다만, 몇몇 실시예에서, 피검사 수치 예측 장치 및 프로세서는 도 1에 도시된 구성요 소보다 더 적은 수의 구성요소나 더 많은 수의 구성요소를 포함할 수 도 있다. 통신부는 상기 피검사 수치 예측 장치와 사용자 단말 사이, 상기 피검사 수치 예측 장치와 외 부 서버(미도시) 사이, 상기 피검사 수치 예측 장치와 외부 장치(미도시) 사이, 상기 피검사 수치 예측 장 치와 통신망 사이의 무선 또는 유선 통신을 가능하게 하는 하나 이상의 모듈을 포함할 수 있다. 예를 들어, 유선통신 모듈, 무선통신 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나를 포함할 수 있다. 통신망은 다양한 형태의 통신망이 이용될 수 있으며, 예컨대, WLAN(Wireless LAN), 와이파이(Wi-Fi), 와이브로 (Wibro), 와이맥스(Wimax), HSDPA(High Speed Downlink Packet Access) 등의 무선 통신방식 또는 이더넷 (Ethernet), xDSL(ADSL, VDSL), HFC(Hybrid Fiber Coax), FTTC(Fiber to The Curb), FTTH(Fiber To The Home) 등의 유선 통신방식이 이용될 수 있다. 한편, 통신망은 상기에 제시된 통신방식에 한정되는 것은 아니며, 상술한 통신방식 이외에도 기타 널리 공지되 었거나 향후 개발될 모든 형태의 통신 방식을 포함할 수 있다. 유선 통신 모듈은, 지역 통신(Local Area Network; LAN) 모듈, 광역 통신(Wide Area Network; WAN) 모듈 또는 부가가치 통신(Value Added Network; VAN) 모듈 등 다양한 유선 통신 모듈뿐만 아니라, USB(Universal Serial Bus), HDMI(High Definition Multimedia Interface), DVI(Digital Visual Interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 다양한 케이블 통신 모듈을 포함할 수 있다. 무선 통신 모듈은 와이파이(Wifi) 모듈, 와이브로(Wireless broadband) 모듈 외에도, GSM(global System for Mobile Communication), CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), UMTS(universal mobile telecommunications system), TDMA(Time Division Multiple Access), LTE(Long Term Evolution), 4G, 5G, 6G 등 다양한 무선 통신 방식을 지원하는 무선 통신 모듈을 포함할 수 있 다. 근거리 통신 모듈은 근거리 통신(Short range communication)을 위한 것으로서, 블루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근거리 통신을 지원할 수 있다. 메모리는 임산부의 피검사 수치를 예측하기 위한 적어도 하나의 프로세스를 저장하고 있을 수 있다. 메모리는 임신 테스트기 이미지를 기반으로 임산부의 피검사 수치를 포함하는 다양한 정보를 예측하는 인공 지능 모델을 저장하고 있을 수 있다. 메모리는 본 피검사 수치 예측 장치의 다양한 기능을 지원하는 데이터와, 프로세서의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들(예를 들어, 음악 파일, 정지영상, 동영상 등)을 저장할 수 있고, 본 피검사 수치 예측 장치에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이 션(application)), 본 피검사 수치 예측 장치의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 이러한, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입 (Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 본 피검사 수치 예측 장치와 는 분리되어 있으나, 유선 또는 무선으로 연결된 데이터베이스가 될 수도 있다. 프로세서는 본 피검사 수치 예측 장치 내의 구성요소들의 동작을 제어하기 위한 알고리즘 또는 알고리 즘을 재현한 프로그램에 대한 데이터를 저장하는 메모리, 및 메모리에 저장된 데이터를 이용하여 전술한 동작을 수행할 수 있다. 이때, 메모리와 프로세서는 각각 별개의 칩으로 구현될 수 있다. 또는, 메모리와 프로세서는 단일 칩으로 구현될 수도 있다. 또한, 프로세서는 이하의 도 2 내지 도 9에서 설명되는 본 개시에 따른 다양한 실시예들을 본 피검사 수치 예측 장치 상에서 구현하기 위하여, 위에서 살펴본 구성요소들을 중 어느 하나 또는 복수를 조합하여 제어 할 수 있다. 프로세서의 이미지 관리 모듈은 임신주수별 임신 테스트기 이미지 데이터 및 임신주수별 임신 테스트 기 이미지 분석을 통해 예측된 결과 데이터를 임산부별로 구분하여 메모리에 저장하고, 누적된 데이터를 임 산부별로 관리할 수 있다. 프로세서의 이미지 분석 모듈은 다양한 알고리즘을 이용하여 임산부의 임신 테스트기 이미지를 전처리 및 분석할 수 있다. 프로세서의 AI 기반 예측 모듈은 임신 테스트기 이미지를 인공지능 기반의 예측 모델에 입력하여 임산 부의 현재 건강 상태에 대한 예측 결과를 제공할 수 있다. 이때, 건강 상태에 대한 예측 결과는 임산부의 현재 임신주수의 피검사 수치, 미래 임신주수의 피검사 수치, 정상 착상 여부, 유산 위험 정도를 포함할 수 있지만, 이제 제한되는 것은 아니다. 이하에서는 도 2 내지 도 9를 참조하여, 인공지능 모델을 이용한 임산부의 피검사 수치 예측 방법에 대해서 구 체적으로 설명하도록 한다. 도 2는 본 개시의 일 실시예에 따른 인공지능 모델을 이용한 임산부의 피검사 수치 예측 방법의 순서도이다. 도 3은 본 개시의 일 실시예에 따른 임신 테스트기 이미지를 설명하기 위한 도면이다. 도 4는 본 개시의 일 실시예에 따른 임신 테스트기 이미지의 전처리 및 분석 과정을 설명하기 위한 도면이다. 도 5는 본 개시의 일 실시예에 따른 임신주수에 따른 HCG 수치를 설명하기 위한 도면이다. 도 6 내지 도 9는 본 개시의 일 실시예에 따른 피검사 수치 예측 서비스를 제공하기 위한 애플리케이션의 사용 자 화면(UI)를 설명하기 위한 도면이다. 이하에서는 설명의 편의를 위해 각 단계들을 프로세서가 수행하는 것으로 설명하지만, 각 단계는 프로세서 에 포함된 이미지 관리 모듈, 이미지 분석 모듈, AI 기반 예측 모듈 및 도 1에 도시되지 않 은 모듈 중 어느 하나의 모듈에 의해 수행되는 것으로 이해될 수 있다. 도 2를 참조하면, 프로세서는 임산부인 사용자의 단말로부터 임신 테스트기의 결과가 촬영된 이미지를 획득할 수 있다(S210). 실시예에 따라, 프로세서는 사용자 단말의 카메라로 촬영된 임신 테스트기 이미지를 획득할 수 있다. 실시예에 따라, 프로세서는 사용자 단말에 설치된 피검사 수치 예측 서비스와 연동된 앱에 저장되어 있 는 임신 테스트기 이미지를 획득할 수 있다. 도 3에 도시된 바와 같이, 임신 테스트기는 제1 라인 및 제2 라인을 포함한다. 여기서, 제1 라인은 테스트 라인 (test line)이고, 제2 라인은 컨트롤 라인(control line)일 수 있으나, 이에 제한되지 않고 제1 라인이 컨트롤 라인이고, 제2 라인이 테스트 라인일 수도 있다. 임산부는 임신 테스트기의 제1 라인 및 제2 라인의 진하기에 따라 자신의 BCG 호르몬 상태를 확인할 수 있고, 임신주수별 BCG 호르몬의 변화량이 어떤지 변화패턴이 어떤지 등을 확인할 수 있다. 기존에는 임산부는 병원에 방문하여 검사를 한 후 피검사 수치를 병원에서 제공받을 수 있지만 매일 병원에 방 문하는 것은 무리가 있어 상세하고 지속적인 관리가 어려웠다는 문제가 있었다. 이와 달리 본 개시는 임산부가 병원에 방문하는 날이 아닌 경우에는 피검사 수치 예측 서비스를 통해 집에서 자신의 현재 피검사 수치를 확인 할 수 있게 함으로써, 매일매일 자신의 호르몬 상태를 상세하고 지속적으로 확인할 수 있게 하고, 이를 통해 위 험에 대비할 수 있도록 한다. 다시 도 2를 참조하면, 프로세서는 임신 테스트기 이미지를 전처리할 수 있다(S220). 도 4를 참조하면, 프로세서는 임신 테스트기 이미지에 대해 먼저 이미지 전처리 및 가공을 수행하고, 그 후 이미지에 대한 1차 분석을 수행하고, 그 후 이미지에 대한 2차 분석을 수행할 수 있다. 먼저, 프로세서는 HSV 방식, YUV 방식, 스레시홀딩, 전역 스레시홀딩, 오츠의 이진화 알고리즘 및 적응형 스레시홀딩 중 적어도 하나를 이용하여 임신 테스트기 이미지를 전처리 및 가공할 수 있다. 구체적으로, 프로세서는 HSV 방식을 통해 색조를 분류하고, YUV 방식을 통해 밝기를 처리할 수 있다. 이는 임신 테스트기의 이미지는 촬영에 이용된 디바이스, 촬영 조건(조도밝기, 픽셀, 색온도)에 따른 이미지 간 차이 가 발생하기 때문에 전처리 및 가공을 진행하는 것이다. HSV 방식은 색조, 채도, 명도를 이용해서 색상을 표현하는 방식으로, 색상을 알아내기 위한 3채널 방식으로 H(Hue)값을 추출하는 것이다. YUV 방식에서 Y는 밝기, U는 밝기와 파란색과의 색상차, V는 밝기와 밝간색과의 색상차를 의미한다. 또한, 프로세서는 스레시홀딩 및 전역 스레시홀딩을 통해 조명이 일정하지 않거나 배경색이 여러 개인 경우 픽셀값을 활용하여 임계점을 설정함으로써 그림자와 조명 차이를 개선할 수 있다. 스레시홀딩은 검은색과 흰색만으로 표현한 이미지인 바이너리 이미지를 만드는 방식으로, 여러값을 어떤 임계점 을 기준으로 두 가지 부류로 나눌 수 있다. 전역 스레시홀딩은 어떤 임계값을 정한 뒤 픽셀값이 임계값을 넘으면 255로 지정하고, 임계값을 넘지 않으면 0 으로 지정하는 방식이다. 또한, 프로세서는 오츠의 이진화 알고리즘을 이용하여 임계값을 임의로 결정하고 픽셀의 두 부류 명암 분포 가 가장 균일한 임계값을 선택할 수 있다. 바이너리 이미지를 만들 때 임계값을 정하는 것이 중요한데 오츠의 이진화 알고리즘을 이용함으로써 임계값을 반복적인 시도 없이 한번에 찾을 수 있게 된다. 또한, 프로세서는 적응형 스레시홀딩을 이용하여 이미지를 여러 영역으로 나눈 뒤, 그 주변 픽셀 값만 활용 하여 임계값으로 설정할 수 있다. 원본 이미지에서 조명이 일정하지 않거나 배경색이 여러 개인 경우에 하나의 임계값으로 선명한 바이너리 이미 지를 만들어내기 어렵기 때문에, 적응형 스레시홀딩을 통해 이미지를 여러 영역으로 나눈 뒤에 그 주변 픽셀값 만 활용하여 임계값으로 설정할 수 있다. 다음으로, 프로세서는 이미지 연산 및 이미지 유사도 비교를 통해 이미지에 대한 1차 분석을 수행할 수 있 다. 구체적으로, 프로세서는 이미지 연산을 통해 상기 전처리 및 가공된 임신 테스트기 이미지와 기 저장된 기 준 임신 테스트기 이미지를 회색조로 변환하여 이미지의 차를 cv.threshold함수를 활용하여 발견할 수 있다. 또한, 프로세서는 이미지 유사도 비교를 통해 픽셀값의 분포도를 분석하여 유사도를 파악할 수 있다. 두 개 의 이미지의 픽셀값의 분포가 비슷하다면 유사한 이미지일 확률이 높고, 분포가 서로 다르면 서로 다른 이미지 일 확률이 높을 수 있다. 다음으로, 프로세서는 평균 해시 매칭 및 해밍거리 측정 함수 적용을 통해 이미지에 대한 2차 분석을 수행 할 수 있다. 구체적으로, 프로세서는 평균 해시 매칭을 통해 두 개의 이미지를 비교하여 같은 형태의 객체가 있는지를 찾아낼 수 있다. 평균 해시 매칭은 특징 벡터를 구하기 위해 평균값을 사용하고 0 또는 1로 구성된 픽셀값을 1 행 1열로 변환하고, 비교하고자 하는 두 이미지를 같은 크기로 축소하고 0과 1의 개수도 동일하게 일치시킬 수 있다. 또한, 프로세서는 해밍거리 측정 함수 적용을 통해 두 수의 같은 자리를 계산하여 유사도를 판별함으로써 이미지 유사도를 측정할 수 있다. 평균 해시와 비교하여 해밍 거리가 25% 이내인 이미지를 출력할 수 있다. 해 밍거리 측정 함수 적용 방식에서 해밍거리는 두 값의 길이가 같아야 계산할 수 있으며, 두 수의 같은 자리값 중 서로 다른 것이 몇 개인지를 판단하여 유사도를 계산할 수 있다. 이와 같이 전처리 및 가공, 이미지에 대한 1차 분석 및 2차 분석을 통해 프로세서는 획득된 이미지가 진짜 임신 테스트기의 이미지가 맞는지를 확인할 수 있다. 이렇게 확인된 이미지는 도 4에 도시된 바와 같이 인공지 능 모델에 입력되어 피검사 수치 예측에 활용될 수 있다. 다시 도 2를 참조하면, 프로세서는 이미지를 기 구축된 인공지능 모델에 입력하여 상기 사용자의 피검사 수 치를 예측할 수 있다(S230). 여기서, 인공지능 모델은 복수의 다른 임산부들 각각의 임신주수별 임신 테스트기 이미지 및 피검사 수치를 데 이터셋으로 활용하여 학습될 수 있다. 실시예에 따라, 인공지능 모델은 복수의 다른 임산부들 각각의 임신주수별 임신 테스트기 이미지 및 피검사 수 치와 임신 테스트기의 브랜드 정보를 데이터셋으로 활용하여 학습될 수 있다. 임신 테스트기의 브랜드 별로 제1 라인 및 제2 라인의 색상 및 발색 정도가 상이할 수 있으므로, 인공지능 모델이 각 브랜드를 구분하여 학습할 수 있도록 하는 것이다. 이를 통해 이후 사용자로부터 임신 테스트기의 브랜드 정보도 함께 입력받게 되면 더 정확한 예측 결과를 제공할 수 있게 된다. 실시예에 따라, 인공지능 모델은 복수의 다른 임산부들 각각의 임신주수별 임신 테스트기 이미지 및 피검사 수 치와 정상 착상된 주수 정보를 데이터셋으로 활용하여 학습될 수 있다. 즉, 인공지능 모델은 HCG 호르몬 수치의 변화 패턴에 따라 어느 시점에 정상 착상이 되는지를 학습할 수 있다. 실시예에 따라, 인공지능 모델은 복수의 다른 임산부들 각각의 임신주수별 임신 테스트기 이미지 및 피검사 수 치와 유산 여부 정보를 데이터셋으로 활용하여 학습될 수 있다. 즉, 인공지능 모델은 유산되는 경우의 HCG 호르 몬 수치의 변화 패턴을 학습할 수 있다. 이렇게 학습된 인공지능 모델을 이용하여 프로세서는 사용자의 임신 테스트기에 포함된 제1 라인 및 제2 라 인의 진하기 및 사용자(임산부)의 임신주수를 기반으로 사용자의 피검사 수치를 예측할 수 있다. 프로세서 는 학습된 인공지능 모델을 통해 사용자가 현재 임신주수일 때 임신 테스트기 이미지에 나타난 제1 라인 및 제2 라인의 진하기 정도면 피검사 수치(HCG 호르몬 수치)가 어느 정도일지를 예측할 수 있게 된다. 실시예에 따라, 사용자가 자신이 사용하는 임신 테스트기의 브랜드 정보를 입력한 경우, 프로세서는 학습된 인공지능 모델을 통해 사용자가 현재 임신주수일 때 해당 브랜드의 임신 테스트기 이미지에 나타난 제1 라인 및 제2 라인의 진하기 정도면 피검사 수치(HCG 호르몬 수치)가 어느 정도일지를 예측할 수 있게 된다. 사용자는 이렇게 예측된 피검사 수치를 도 5에 도시된 HCG 수치의 기준 범위와 비교하여, 자신의 호르몬 수치가 현재 임신주수에서 정상 범위 내에 있는지를 판단할 수 있다. 실시예에 따라, 프로세서는 상기 인공지능 모델을 이용하여 분석된 상기 제1 라인 및 상기 제2 라인의 진하 기를 기초로 상기 사용자의 정상 착상 여부를 예측할 수 있다. 제1 라인과 제2 라인의 진하기 정도는 착상 상태의 변화를 의미하므로, 프로세서는 제1 라인(테스트 라인) 의 진하기가 제2 라인(컨트롤 라인)의 진하기보다 진해진 경우, 사용자가 현재 정상 착상된 상태인 것으로 예측 할 수 있다. 실시예에 따라, 프로세서는 인공지능 모델을 이용하여 제1 라인 및 제2 라인의 진하기의 변화 패턴을 분석 하고, 상기 분석된 변화 패턴을 기초로 상기 사용자의 정상 착상 임신주수를 예측할 수 있다. 인공지능 모델은 배아 이식일로부터 현재까지의 임신주수별 제1 라인 및 제2 라인의 진하기가 변화한 패턴을 분 석하고, 분석된 패턴대로 호르몬 수치가 변화하는 경우 어느 시점에 정상 착상이 될 것인지를 예측할 수 있다. 실시예에 따라, 프로세서는 인공지능 모델을 이용하여 분석된 제1 라인 및 제2 라인의 진하기를 기초로 상 기 사용자의 유산 여부를 예측할 수 있다. 인공지능 모델은 사용자의 현재 임신주수일 때의 제1 라인 및 제2 라인의 진하기가 학습된 진하기와 차이가 있 는 경우 현재 사용자에게 유산 위험이 있다고 판단할 수 있다. 구체적으로, 프로세서는 인공지능 모델을 이용하여 제1 라인 및 제2 라인의 진하기의 변화 패턴을 분석하고, 분석된 변화 패턴이 상기 사용자의 현재 임신주수의 평균 변화 패턴과 차이가 있는 경우 유산 위험이 있는 것으로 판단할 수 있다. 또는, 프로세서는 인공지능 모델을 이용하여 제1 라인 및 제2 라인의 진하기의 변화 패턴을 분석하고, 분석 된 패턴대로 호르몬 수치가 변화하는 경우 어느 시점에 유산이 될 것인지를 예측할 수도 있다. 실시예에 따라, 프로세서는 인공지능 모델을 이용하여 제1 라인 및 제2 라인의 진하기의 변화 패턴을 분석 하고, 분석된 변화 패턴에 기초하여 상기 사용자의 현재 임신주수 이후의 임신주수에서 상기 사용자의 피검사 수치를 예측할 수 있다. 예를 들어, 현재 임신주수가 4주 5일차인 경우, 프로세서는 인공지능 모델을 통해 사용자의 4주 5일차까지 의 제1 라인 및 제2 라인의 진하기의 변화 패턴을 분석하고, 이에 기초하여 사용자에 의해 선택된 임신주수(예 를 들어, 4주 7일차)의 피검사 수치를 예측할 수 있다. 프로세서는 예측된 피검사 수치를 상기 사용자 단말로 제공할 수 있다(S240). 사용자는 사용자 단말을 통해 예측 결과를 확인할 수 있다. 구체적으로, 상술한 현재 임신주수의 피검사 수 치, 정상 착상 여부, 정상 착상 예상 임신주수, 유산 여부, 유산 예상 임신주수 및 미래 임신주수의 피검사 수 치 중 적어도 하나를 확인할 수 있다. 사용자는 사용자 단말을 통해 예측 결과를 확인하고, 그에 맞는 건강관리를 할 수가 있다. 실시예에 따라, 프로세서가 상기 예측된 피검사 수치에 맞는 건강관리를 사용자에게 추천할 수도 있다. 구 체적으로, 상기 예측된 피검사 수치가 사용자의 현재 임신주수에 대해 기 설정된 최소값보다 작으면, 사용자 단 말로 추천 제품 정보를 제공할 수 있다. 여기서, 추천 제품은 영양제, 음식, 의류, 서비스 등 모든 형태를 포함할 수 있다. 예를 들어, 도 5를 참조하면, 현재 사용자의 임신주수가 4주 0일차이고, 예측된 사용자의 피검사 수치가 40인 경우, 사용자의 피검사 수치는 4주 0일차의 HCG 호르몬 수치 범위의 최소값인 50보다 작으므로 프로세서는 사용자 단말로 추천 제품 정보를 제공할 수 있다. 이때, 프로세서는 서비스 플랫폼 내의 다른 사용자들(임산부들)의 경험 정보에 기초하여 추천 제품 정보를 제공할 수 있다. 즉, 서비스 플랫폼 내에서 사용자와 동일 임신주수일 때의 다른 사용자들이 작성한 게시글이나 댓글 또는 동일 임신주수일 때의 다른 사용자들이 구매했던 제품의 정보를 기초로 사용자에게 맞는 제품을 추천 할 수가 있다. 또한, 프로세서는 특정 임신주수에 사용자가 실제로 병원 방문한 후에 입력한 피검사 수치와, 해당 특정 임 신주수에 인공지능 모델을 통해 예측된 피검사 수치를 비교하여 인공지능 모델의 예측 정확도를 측정할 수 있다. 이하에서는 도 6 내지 도 9를 참조하여, 사용자가 사용자 단말을 통해 피검사 수치 예측 서비스를 이용하는 방법에 대해서 설명하도록 한다. 도 6을 참조하면, 사용자는 사용자 단말의 화면에 표시된 UI를 통해 사용자를 구분하기 위한 정보 및 배아 이식일을 입력할 수 있다. 또한, 임신주수는 배아 이식일에 따라 자동으로 계산되어 표시될 수 있다. 이때, 냉동 3일 배양인지 냉동 5 일 배양인지에 따라 동일한 임신주수가 다르게 계산될 수 있다. 도 7을 참조하면, 사용자는 사용자 단말의 화면에 표시된 UI를 통해 임신 테스트기를 촬영하거나, 임신 테 스트기 이미지를 불러올 수 있고, 검사 시간을 설정할 수 있고, 임신 테스트기의 브랜드를 선택할 수 있고, 피 검사 수치를 알고 있는 경우 입력 영역에 피검사 수치를 입력할 수 있고, 피검사 수치를 모르는 경우 피검 사 수치 예측 버튼을 선택할 수 있다. 상술한 바와 같이 인공지능 모델을 통해 피검사 수치가 예측되면, 해당 값은 입력 영역에 자동으로 입력될 수 있다. 도 8을 참조하면, 사용자는 사용자 단말의 화면에 표시된 UI를 통해 임신주수별로 임신 테스트기의 이미지 와 피검사 수치를 확인할 수 있다. 도시된 피검사 수치값은 병원 방문 후 사용자가 직접 입력한 값일 수도 있고 인공지능을 통해 예측된 값일 수도 있다. 도 8에는 피검사 수치가 모두 동일한 것으로 도시하였으나, 각 임신주 수별 피검사 수치는 서로 다를 수도 있다. 도 8에 도시된 버튼이 선택되면, 도 9에 도시된 UI로 화면이 전환될 수 있다. 사용자는 해당 UI를 통해 임 신주수별 자신의 피검사 수치를 기준 범위 및 평균 수치와 비교하여 확인할 수 있다. 도 2는 단계들을 순차적으로 실행하는 것으로 기재하고 있으나, 이는 본 실시예의 기술 사상을 예시적으로 설명"}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "한 것에 불과한 것으로서, 본 실시예가 속하는 기술분야에서 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 도 2에 기재된 순서를 변경하여 실행하거나 병렬적으로 실행하는 것으로 다양 하게 수정 및 변형하여 적용 가능할 것이므로, 도 2는 시계열적인 순서로 한정되는 것은 아니다. 한편, 상술한 설명에서, 도 2에 기재된 단계들은 본 개시의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2023-0161996", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2023-0161996", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 인공지능 모델을 이용한 임산부의 피검사 수치 예측 장치를 설명하기 위한 도면이다. 도 2는 본 개시의 일 실시예에 따른 인공지능 모델을 이용한 임산부의 피검사 수치 예측 방법의 순서도이다. 도 3은 본 개시의 일 실시예에 따른 임신 테스트기 이미지를 설명하기 위한 도면이다. 도 4는 본 개시의 일 실시예에 따른 임신 테스트기 이미지의 전처리 및 분석 과정을 설명하기 위한 도면이다. 도 5는 본 개시의 일 실시예에 따른 임신주수에 따른 HCG 수치를 설명하기 위한 도면이다. 도 6 내지 도 9는 본 개시의 일 실시예에 따른 피검사 수치 예측 서비스를 제공하기 위한 애플리케이션의 사용 자 화면(UI)를 설명하기 위한 도면이다."}
