{"patent_id": "10-2023-7034440", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0169138", "출원번호": "10-2023-7034440", "발명의 명칭": "사이드링크 자원 스케줄링", "출원인": "퀄컴 인코포레이티드", "발명자": "호세이니 세예드키아누쉬"}}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신을 위한 사용자 장비 (UE) 로서,메모리; 및상기 메모리에 커플링된 하나 이상의 프로세서들을 포함하고,상기 하나 이상의 프로세서들은,사이드링크 자원 예약을 송신하는 것으로서, 상기 사이드링크 자원 예약은 상기 사이드링크 자원 예약을 위해이용가능한 제 1 대역폭을 갖는 업링크 슬롯에서의 제 1 자원 및 상기 사이드링크 자원 예약을 위해 이용가능한제 2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제 2 자원을 나타내고, 상기 사이드링크 자원 예약은 상기 업링크 슬롯 및 상기 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원예약을 송신하고; 및상기 사이드링크 자원 예약을 사용하여 통신을 송신하도록구성된, 무선 통신을 위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,주어진 자원 풀의 주어진 서브채널은 슬롯 타입에 관계없이 동일한 서브채널 인텍스를 가지고, 상기 주어진 서브채널은 상기 제 1 자원 및 상기 제 2 자원을 포함하는, 무선 통신을 위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 제 2 대역폭이 아닌 상기 제 1 대역폭에 포함되는, 상기 더 작은 대역폭 슬롯의 하나 이상의 무효 주파수자원들은 상기 사이드링크 자원 예약의 송신에 대해 무효인 것으로 취급되는, 무선 통신을 위한 사용자 장비(UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 제 2 자원은 상기 더 작은 대역폭 슬롯의 무효 주파수 자원 내에 있지 않고, 상기 무효 주파수 자원은 상기 더 작은 대역폭 슬롯의 구성에 적어도 부분적으로 기초하여 상기 제 2 대역폭이 아닌 상기 제 1 대역폭 내에있는, 무선 통신을 위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 사이드링크 자원 예약은 주기적 예약이고, 상기 주기적 예약의 반복은 임의의 더 작은 대역폭 슬롯의 무효주파수 자원을 포함하지 않는, 무선 통신을 위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 사이드링크 자원 예약은 주기적 예약이고, 상기 주기적 예약의 반복은 상기 더 작은 대역폭 슬롯의 무효주파수 자원을 포함하고, 상기 통신을 송신하기 위해, 상기 하나 이상의 프로세서들은 또한,상기 더 작은 대역폭 슬롯의 상기 무효 주파수 자원을 사용하지 않고 상기 통신을 송신하도록 구성되는, 무선공개특허 10-2023-0169138-3-통신을 위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 무효 주파수 자원을 포함하는 상기 반복은 송신되지 않는, 무선 통신을 위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 무효 주파수 자원을 포함하는 상기 반복은 상기 무효 주파수 자원을 사용하지 않고 송신되는, 무선 통신을위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 반복은 제 1 반복이고, 상기 제 1 반복 후에 발생하는 제 2 반복은 상기 사이드링크 자원 예약의 전체 대역폭을 사용하는, 무선 통신을 위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 반복은 제 1 반복이고, 상기 제 1 반복 후에 발생하는 제 2 반복은 상기 무효 주파수 자원을 생략하는 상기 사이드링크 자원 예약의 감소된 대역폭을 사용하는, 무선 통신을 위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 더 작은 대역폭 슬롯은 서브대역 전이중 (SBFD) 슬롯인, 무선 통신을 위한 사용자 장비 (UE)."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "무선 통신을 위한 UE 로서,메모리; 및상기 메모리에 커플링된 하나 이상의 프로세서들을 포함하고,상기 하나 이상의 프로세서들은,사이드링크 자원 예약을 수신하는 것으로서, 상기 사이드링크 자원 예약은 상기 사이드링크 자원 예약을 위해이용가능한 제 1 대역폭을 갖는 업링크 슬롯에서의 제 1 자원 및 상기 사이드링크 자원 예약을 위해 이용가능한제 2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제 2 자원을 나타내고, 상기 사이드링크 자원 예약은 상기 업링크 슬롯 및 상기 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원예약을 수신하고; 및상기 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩하도록구성된, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 제 2 대역폭이 아닌 상기 제 1 대역폭에 포함되는, 상기 더 작은 대역폭 슬롯의 하나 이상의 무효 주파수자원들은 상기 사이드링크 자원 예약에 대해 무효인 것으로 취급되는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2023-0169138-4-제 13 항에 있어서,상기 제 2 자원은 상기 더 작은 대역폭 슬롯의 무효 주파수 자원 내에 있지 않고, 상기 하나 이상의 무효 주파수 자원들은 상기 더 작은 대역폭 슬롯의 구성에 적어도 부분적으로 기초하여 상기 제 2 대역폭이 아닌 상기 제1 대역폭 내에 있는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 12 항에 있어서,상기 사이드링크 자원 예약은 주기적 예약이고, 상기 주기적 예약의 반복은 임의의 더 작은 대역폭 슬롯의 무효주파수 자원을 포함하지 않는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 12 항에 있어서,상기 사이드링크 자원 예약은 주기적 예약이고, 상기 주기적 예약의 반복은 상기 더 작은 대역폭 슬롯의 무효주파수 자원을 포함하고, 상기 통신을 디코딩하기 위해, 상기 하나 이상의 프로세서들은 또한,상기 더 작은 대역폭 슬롯의 상기 무효 주파수 자원을 사용하지 않고 상기 통신을 디코딩하도록 구성되는, 무선통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 무효 주파수 자원을 포함하는 상기 반복은 디코딩되지 않는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 16 항에 있어서,상기 무효 주파수 자원을 포함하는 상기 반복은 상기 무효 주파수 자원을 사용하지 않고 디코딩되는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 반복은 제 1 반복이고, 상기 제 1 반복 후에 발생하는 제 2 반복은 상기 사이드링크 자원 예약의 전체 대역폭을 사용하는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,상기 반복은 제 1 반복이고, 상기 제 1 반복 후에 발생하는 제 2 반복은 상기 무효 주파수 자원을 생략하는 상기 사이드링크 자원 예약의 감소된 대역폭을 사용하는, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 12 항에 있어서,상기 더 작은 대역폭 슬롯은 서브대역 전이중 (SBFD) 슬롯인, 무선 통신을 위한 UE."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "사용자 장비 (UE) 에 의해 수행되는 무선 통신의 방법으로서,사이드링크 자원 예약을 송신하는 단계로서, 상기 사이드링크 자원 예약은 상기 사이드링크 자원 예약을 위해이용가능한 제 1 대역폭을 갖는 업링크 슬롯에서의 제 1 자원 및 상기 사이드링크 자원 예약을 위해 이용가능한제 2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제 2 자원을 나타내고, 상기 사이드링크 자원 예약은 상기 업링공개특허 10-2023-0169138-5-크 슬롯 및 상기 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원예약을 송신하는 단계; 및상기 사이드링크 자원 예약을 사용하여 통신을 송신하는 단계를 포함하는, UE 에 의해 수행되는 무선 통신의 방법."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 22 항에 있어서,주어진 자원 풀의 주어진 서브채널은 슬롯 타입에 관계없이 동일한 서브채널 인텍스를 가지고, 상기 주어진 서브채널은 상기 제 1 자원 및 상기 제 2 자원을 포함하는, UE 에 의해 수행되는 무선 통신의 방법."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 22 항에 있어서,상기 제 2 대역폭이 아닌 상기 제 1 대역폭에 포함되는, 상기 더 작은 대역폭 슬롯의 하나 이상의 무효 주파수자원들은 상기 사이드링크 자원 예약의 송신에 대해 무효인 것으로 취급되는, UE 에 의해 수행되는 무선 통신의방법."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 22 항에 있어서,상기 제 2 자원은 상기 더 작은 대역폭 슬롯의 무효 주파수 자원 내에 있지 않고, 상기 무효 주파수 자원은 상기 더 작은 대역폭 슬롯의 구성에 적어도 부분적으로 기초하여 상기 제 2 대역폭이 아닌 상기 제 1 대역폭 내에있는, UE 에 의해 수행되는 무선 통신의 방법."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 22 항에 있어서,상기 사이드링크 자원 예약은 주기적 예약이고, 상기 주기적 예약의 반복은 임의의 더 작은 대역폭 슬롯의 무효주파수 자원을 포함하지 않는, UE 에 의해 수행되는 무선 통신의 방법."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "사용자 장비 (UE) 에 의해 수행되는 무선 통신의 방법으로서,사이드링크 자원 예약을 수신하는 단계로서, 상기 사이드링크 자원 예약은 상기 사이드링크 자원 예약을 위해이용가능한 제 1 대역폭을 갖는 업링크 슬롯에서의 제 1 자원 및 상기 사이드링크 자원 예약을 위해 이용가능한제 2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제 2 자원을 나타내고, 상기 사이드링크 자원 예약은 상기 업링크 슬롯 및 상기 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원예약을 수신하는 단계; 및상기 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩하는 단계를 포함하는, UE 에 의해 수행되는 무선 통신의 방법."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 27 항에 있어서,상기 제 2 대역폭이 아닌 상기 제 1 대역폭에 포함되는, 상기 더 작은 대역폭 슬롯의 하나 이상의 무효 주파수자원들은 상기 사이드링크 자원 예약에 대해 무효인 것으로 취급되는, UE 에 의해 수행되는 무선 통신의 방법."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 28 항에 있어서,상기 제 2 자원은 상기 더 작은 대역폭 슬롯의 무효 주파수 자원 내에 있지 않고, 상기 하나 이상의 무효 주파수 자원들은 상기 더 작은 대역폭 슬롯의 구성에 적어도 부분적으로 기초하여 상기 제 2 대역폭이 아닌 상기 제공개특허 10-2023-0169138-6-1 대역폭 내에 있는, UE 에 의해 수행되는 무선 통신의 방법."}
{"patent_id": "10-2023-7034440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 27 항에 있어서,상기 사이드링크 자원 예약은 주기적 예약이고, 상기 주기적 예약의 반복은 임의의 더 작은 대역폭 슬롯의 무효주파수 자원을 포함하지 않는, UE 에 의해 수행되는 무선 통신의 방법."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 여러 양태들은 일반적으로 무선 통신에 관한 것이다. 일부 양태들에서, 사용자 장비 (UE) 는 사이 드링크 자원 예약을 송신할 수 있으며, 여기서 사이드링크 자원 예약은 사이드링크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯의 제1 자원 및 사이드링크 자원 예약에 이용 가능한 제2 대역폭을 갖는 서브대역 전 이중 (SBFD) 슬롯의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯과 SBFD 슬롯에 대해 동일한 서브 채널 인덱싱 구성을 사용한다. UE 는 사이드링크 자원 예약을 사용하여 통신을 전송할 수 있다. 다수의 다른 양태들이 설명된다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이 특허 출원은 발명의 명칭이 \"SIDELINK RESOURCE SCHEDULING\" 이고 2021 년 4 월 15 일자로 출원되고 본원의 양수인에게 양도된 그리스 특허 출원 번호 제20210100268호를 우선권으로 주장한다. 우선 출원의 개시는 본 특허 출원의 일부로 간주되고 본 특허 출원에 참조에 의해 통합된다. 본 개시의 양태들은 일반적으로 무선 통신에 관한 것이고, 사이드링크 자원 스케줄링을 위한 기법들 및 장치들 에 관한 것이다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신 시스템들은 텔레포니, 비디오, 데이터, 메시징, 및 브로드캐스트와 같은 다양한 텔레통신 서비스들을 제공하기 위해 널리 전개되어 있다. 통상적인 무선 통신 시스템들은 이용가능한 시스템 자원들 (예를 들어, 대역폭, 송신 전력 등) 을 공유함으로써 다중의 사용자들과의 통신을 지원 가능한 다중 액세스 기술들을 채용할 수도 있다. 이러한 다중 액세스 기술들의 예들은 코드 분할 다중 액세스 (CDMA) 시스템, 시간 분할 다중 액 세스 (TDMA) 시스템, 주파수 분할 다중 액세스 (FDMA) 시스템, 직교 주파수 분할 다중 액세스 (OFDMA) 시스템, 단일-캐리어 주파수 분할 다중 액세스 (SC-FDMA) 시스템, 시간 분할 동기식 코드 분할 다중 액세스 (TD-SCDMA) 시스템, 및 롱텀 에볼루션 (LTE) 을 포함한다. LTE/LTE-어드밴스드는 제 3 세대 파트너쉽 프로젝트 (3GPP) 에 의해 공포된 유니버셜 이동 전기통신 시스템 (UMTS) 모바일 표준에 대한 향상 세트이다. 무선 네트워크는 사용자 장비(UE) 또는 다수의 UE들에 대한 통신을 지원하는 하나 이상의 기지국들을 포함할 수 도 있다. UE는 다운링크 통신들 및 업링크 통신들을 통해 기지국과 통신할 수도 있다. \"다운링크\"(또는 \"DL\")는 기지국으로부터 UE 로의 통신 링크를 지칭하고, 업링크(또는 \"UL\")는 UE 로부터 기지국으로의 통신 링 크를 지칭한다. 상기 다중 액세스 기술들은 상이한 UE들이 도시의, 국가의, 지방의 및/또는 글로벌 레벨에서 통신하는 것을 가 능하게 하는 공통 프로토콜을 제공하기 위해 다양한 통신 표준들에서 채택되었다. 5G 로서 지칭될 수도 있 는 뉴 라디오 (New Radio; NR) 는 3GPP 에 의해 공표된 LTE 모바일 표준에 대한 인핸스먼트들의 세트이다. NR 은, 빔포밍, 다중 입력 다중 출력 (MIMO) 안테나 기술, 및 캐리어 집성을 지원할 뿐만 아니라 다운링크 상에 서 사이클릭 프리픽스 (CP) 를 갖는 직교 주파수 분할 멀티플렉싱 (OFDM) (CP-OFDM) 을 사용하여, 업링크 상에 서 CP-OFDM 및/또는 단일-캐리어 주파수 분할 멀티플렉싱 (SC-FDM) (또한, 이산 푸리에 변환 확산 OFDM (DFT-s- OFDM) 으로서 또한 알려짐) 을 사용하여 스펙트럼 효율을 개선하는 것, 비용을 저감시키는 것, 서비스들을 개선 하는 것, 새로운 스펙트럼을 이용하는 것, 및 다른 공개 표준들과 더 우수하게 통합하는 것에 의해 모바일 브로 드밴드 인터넷 액세스를 더 우수하게 지원하도록 설계된다. 모바일 브로드밴드 액세스에 대한 수요가 계속 증가함에 따라, LTE, NR, 및 다른 무선 액세스 기술들에서의 추가적인 개선들이 여전히 유용하다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일부 양태들에서, 사용자 장비 (UE) 에 의해 수행되는 무선 통신의 방법은 사이드링크 자원 예약을 송신하는 단 계로서, 사이드링크 자원 예약은 사이드링크 자원 예약을 위해 이용가능한 제1 대역폭을 갖는 업링크 슬롯에서 의 제1 자원 및 사이드링크 자원 예약을 위해 이용가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯 및 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원 예약을 송신하는 단계; 및 사이드링크 자원 예약을 사용하여 통신을 송 신하는 단계를 포함한다. 일부 양태들에서, UE 에 의해 수행되는 무선 통신의 방법은 사이드링크 자원 예약을 수신하는 단계로서, 사이드 링크 자원 예약은 사이드링크 자원 예약을 위해 이용가능한 제1 대역폭을 갖는 업링크 슬롯에서의 제1 자원 및 사이드링크 자원 예약을 위해 이용가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯 및 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원 예약을 수신하는 단계; 및 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩하는 단계를 포함한다. 일부 양태들에서, 무선 통신을 위한 UE 는 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함하고, 하나 이상의 프로세서들은 사이드링크 자원 예약을 송신하는 것으로서, 사이드링크 자원 예약은 사이드링크 자 원 예약을 위해 이용가능한 제1 대역폭을 갖는 업링크 슬롯에서의 제1 자원 및 사이드링크 자원 예약을 위해 이 용가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯 및 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원 예약을 송신하고; 및 사이드링크 자원 예약을 사용하여 통신을 송신하도록 구성된다. 일부 양태들에서, 무선 통신을 위한 UE 는 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함하고, 하나 이상의 프로세서들은 사이드링크 자원 예약을 수신하는 것으로서, 사이드링크 자원 예약은 사이드링크 자 원 예약을 위해 이용가능한 제1 대역폭을 갖는 업링크 슬롯에서의 제1 자원 및 사이드링크 자원 예약을 위해 이 용가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯 및 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원 예약을 수신하고; 및 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩하도록 구성된다. 일부 양태들에서, 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체는 하나 이상의 명령들을 포함하며, 하나 이상의 명령들은 UE 의 하나 이상의 프로세서들에 의해 실행될 때 UE 로 하여금, 사이 드링크 자원 예약을 송신하게 하는 것으로서, 사이드링크 자원 예약은 사이드링크 자원 예약을 위해 이용가능한 제1 대역폭을 갖는 업링크 슬롯에서의 제1 자원 및 사이드링크 자원 예약을 위해 이용가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯 및 더 작은 대역폭 슬롯 에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원 예약을 송신하게 하고; 및 사이드링크 자원 예약을 사용하여 통신을 송신하게 한다. 일부 양태들에서, 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체는 하나 이상의 명령들을 포함하며, 하나 이상의 명령들은 UE 의 하나 이상의 프로세서들에 의해 실행될 때 UE 로 하여금, 사이 드링크 자원 예약을 수신하게 하는 것으로서, 사이드링크 자원 예약은 사이드링크 자원 예약을 위해 이용가능한 제1 대역폭을 갖는 업링크 슬롯에서의 제1 자원 및 사이드링크 자원 예약을 위해 이용가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯 및 더 작은 대역폭 슬롯 에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이드링크 자원 예약을 수신하게 하고; 및 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩하게 한다. 일부 양태들에서, 무선 통신을 위한 장치는 사이드링크 자원 예약을 송신하는 수단으로서, 사이드링크 자원 예 약은 사이드링크 자원 예약을 위해 이용가능한 제1 대역폭을 갖는 업링크 슬롯에서의 제1 자원 및 사이드링크 자원 예약을 위해 이용가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯 및 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이 드링크 자원 예약을 송신하는 수단; 및 사이드링크 자원 예약을 사용하여 통신을 송신하는 수단을 포함한다. 일부 양태들에서, 무선 통신을 위한 장치는 사이드링크 자원 예약을 수신하는 수단으로서, 사이드링크 자원 예 약은 사이드링크 자원 예약을 위해 이용가능한 제1 대역폭을 갖는 업링크 슬롯에서의 제1 자원 및 사이드링크 자원 예약을 위해 이용가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯에서의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯 및 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용하는, 상기 사이 드링크 자원 예약을 수신하는 수단; 및 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩하는 수단을 포함한다. 양태들은 일반적으로, 첨부 도면들을 참조하여 본원에서 실질적으로 설명되는 바와 같은 그리고 첨부 도면들 및 명세서에 의해 예시된 바와 같은 방법, 장치, 시스템, 컴퓨터 프로그램 제품, 비일시적 컴퓨터 판독가능 매체, 사용자 장비, 기지국, 네트워크 노드, 무선 통신 디바이스, 및 프로세싱 시스템을 포함한다. 전술한 것은 다음에 오는 상세한 설명이 더 잘 이해될 수도 있도록 본 개시에 따른 예들의 피처들 및 기술적 이 점들을 다소 폭넓게 서술하였다. 부가적인 특징들 및 이점들이 이하에서 설명될 것이다. 개시된 개념 및 특정 예들은 본 개시의 동일한 목적들을 수행하기 위한 다른 구조들을 수정 및 설계하기 위한 기초로서 용이 하게 활용될 수도 있다. 그러한 등가의 구성들은 첨부된 청구항들의 범위에서 벗어나지 않는다. 본 명 세서에 개시된 개념들의 특성들, 그들의 조직 및 동작 방법 양자 모두는, 연관된 이점들과 함께, 첨부 도면들과 관련하여 고려될 때 이하의 설명으로부터 더 잘 이해될 것이다. 도면들 각각은 예시 및 설명의 목적들을 위 해 제공된 것이고, 청구항들의 제한들의 정의로서 제공된 것은 아니다. 양태들이 일부 예들에 대한 예시에 의해 본 출원에서 설명되지만, 당업자는 그러한 양태들이 많은 상이한 배열 들 및 시나리오들에서 구현될 수도 있음을 이해할 것이다. 본 명세서에서 설명된 기술들은 상이한 플랫폼 타 입들, 디바이스들, 시스템들, 형상들, 사이즈들, 및/또는 패키징 배열들을 이용하여 구현될 수도 있다. 예 를 들어, 일부 양태들은 집적 칩 실시형태들 및 다른 비-모듈-컴포넌트 기반 디바이스들 (예를 들어, 엔드-사용 자 디바이스들, 차량들, 통신 디바이스들, 컴퓨팅 디바이스들, 산업 장비, 소매/구매 디바이스들, 의료 디바이 스들, 인공지능 디바이스들) 을 통해 구현될 수도 있다. 양태들은 칩-레벨 컴포넌트들, 모듈형 컴포넌트들, 비-모듈형 컴포넌트들, 비-칩-레벨 컴포넌트들, 디바이스-레벨 컴포넌트들, 및/또는 시스템-레벨 컴포넌트들에 서 구현될 수도 있다. 설명된 양태들 및 특징들을 통합한 디바이스들은 청구되고 설명된 양태들의 구현 및 실시를 위해 부가적인 컴포넌트들 및 특징들을 포함할 수도 있다. 예를 들어, 무선 신호들의 송신 및 수신은 아날로그 및 디지털 목적들을 위한 하나 이상의 컴포넌트 (예를 들어, 안테나, 무선 주파수 (RF) 체인들, 전력 증폭기들, 변조기들, 버퍼들, 프로세서들, 인터리버들, 가산기들/ 합산기들 등) 를 포함할 수도 있다. 본 명 세서에 설명된 양태들은 다양한 사이즈, 형상, 및 구성의, 다양한 디바이스들, 컴포넌트들, 시스템들, 분산 배 열들, 및/또는 엔드-사용자 디바이스들에서 실시될 수도 있음이 의도된다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 여러 양태들은 첨부 도면들을 참조하여 이하에서 보다 충분히 설명된다. 그러나, 본 개시는 많은 상이한 형태들로 구현될 수도 있고 본 개시 전체에 걸쳐 제시된 임의의 특정 구조 또는 기능에 한정되는 것으로 해석되지 않아야 한다. 오히려, 이들 양태들은 본 개시가 철저하고 완전해지게 하기 위하여 그리고 본 개시 의 범위를 당업자에게 완전히 전달하기 위해서 제공된다. 당업자는 본 개시의 범위가 본 명세서에 개시된 본 개시의 임의의 양태를, 본 개시의 임의의 다른 양태와 독립적으로 구현되든 조합으로 구현되든 커버하도록 의도된다는 것을 알아야 한다. 예를 들어, 본 명세서에 제시된 임의의 수의 양태를 이용하여 장치가 구현될 수도 있거나 방법이 실시될 수도 있다. 또한, 본 개시의 범위는 본 명세서에 제시된 본 개시의 다양한 양태 들 이외에 또는 이에 부가하여 다른 구조, 기능성, 또는 구조 및 기능성을 이용하여 실시되는 그러한 장치 또는 방법을 커버하도록 의도된다. 여기에 개시된 본 개시의 임의의 양태는 청구항의 하나 이상의 엘리먼트들에 의해 구체화될 수도 있다는 것이 이해되야 한다. 전기통신 시스템들의 여러 양태들이 이제 다양한 장치들 및 기법들을 참조하여 제시될 것이다. 이들 장치들 및 기법들은 다음의 상세한 설명에서 설명되고, 다양한 블록들, 모듈들, 컴포넌트들, 회로들, 단계들, 프로세스 들, 알고리즘들 등 (총괄적으로, \"엘리먼트들\" 로서 지칭됨) 에 의해 첨부 도면들에 예시될 것이다. 이들 엘리먼트들은 하드웨어, 소프트웨어, 또는 그 조합들을 사용하여 구현될 수도 있다. 그러한 엘리먼트들이 하드웨어로 구현되는지 또는 소프트웨어로 구현되는지는 전체 시스템에 부과된 설계 제약들 및 특정 애플리케이 션에 의존한다. 양태들이 5G 또는 NR 무선 액세스 기술 (RAT) 과 공통적으로 연관된 용어를 사용하여 본 명세서에서 설명될 수 도 있지만, 본 개시의 양태들은 3G RAT, 4G RAT, 및/또는 5G 에 후속하는 RAT (예컨대, 6G) 와 같은 다른 RAT 들에 적용될 수도 있다. 도 1 은 본 개시에 따른 무선 네트워크 의 예를 예시한 다이어그램이다. 무선 네트워크 는 다 른 예들 중에서도, 5G (예를 들어, NR) 네트워크 및/또는 4G (예를 들어, LTE (Long Term Evolution)) 네트워 크의 엘리먼트들일 수도 있거나 또는 이들을 포함할 수도 있다. 무선 네트워크 는 하나 이상의 기지 국 (BS (110a), BS (110b), BS (110c), 및 BS (110d) 로서 나타냄), 사용자 장비 (UE) 또는 다중 UE 들 (UE (120a), UE (120b), UE (120c), UE (120d), 및 UE (120e) 로서 나타냄), 및/또는 다른 네트워크 엔티티들을 포함할 수도 있다. 기지국 은 UE들 과 통신하는 엔티티이다. 기지국 (종 종 BS 로서 지칭됨) 은 예를 들어, NR 기지국, LTE 기지국, 노드 B, eNB (예를 들어, 4G 에서), gNB (예를 들 어, 5G 에서), 액세스 포인트, 및/또는 송신 수신 포인트 (TRP) 를 포함할 수도 있다. 각각의 기지국 은 특정 지리적 영역에 대한 통신 커버리지를 제공할 수도 있다. 3세대 파트너쉽 프로젝트(3GPP)에서, 용어 \"셀\"은 그 용어가 사용되는 맥락에 따라 기지국의 커버리지 영역 및/또는 이 커버리지 영역을 서빙하는 기 지국 서브시스템을 지칭할 수 있다. 기지국은 매크로 셀, 피코 셀, 펨토 셀, 및/또는 다른 타입들의 셀에 대한 통신 커버리지를 제공할 수도 있다. 매크로 셀은 상대적으로 큰 지리적 영역 (예를 들어, 반경 수 킬로미터) 을 커버할 수도 있고, 서비 스 가입들을 갖는 UE들 에 의한 제한되지 않은 액세스를 허용할 수도 있다. 피코 셀은 상대적으로 작 은 지리적 영역을 커버할 수도 있고 서비스 가입을 갖는 UE들 에 의한 제한되지 않은 액세스를 허용할 수 도 있다. 펨토 셀은, 상대적으로 작은 지리적 영역 (예를 들어, 홈) 을 커버할 수도 있고, 펨토 셀과 연관 을 갖는 UE들 (120; 예를 들어, 폐쇄 가입자 그룹 (CSG) 에 있는 UE들 ) 에 의한 제한된 액세스를 허용할 수도 있다. 매크로 셀에 대한 기지국 은 매크로 기지국으로서 지칭될 수도 있다. 피코 셀에 대한 기지국 은 피코 기지국으로 지칭될 수도 있다. 펨토 셀에 대한 기지국 은 펨토 기지국 또는 인 -홈 기지국으로 지칭될 수도 있다. 도 1 에 도시된 예에서, BS (110a) 는 매크로 셀 (102a) 에 대한 매크로 기지국일 수도 있고, BS (110b) 는 피코 셀 (102b) 에 대한 피코 기지국일 수도 있고, BS (110c) 는 펨토 셀 (102c) 에 대한 펨토 기지국일 수도 있다. 기지국은 하나 또는 다수의 (예를 들어, 3 개) 셀들을 지원할 수 도 있다. 일부 예들에서, 셀은 반드시 정지식일 필요는 없을 수도 있으며, 셀의 지리적 영역은 이동식인 기지국 (110; (예컨대, 이동식 기지국) 의 위치에 따라 이동할 수도 있다. 일부 예들에 있어서, 기지국들 은 임의 의 적합한 전송 네트워크를 사용하여, 직접 물리 접속 또는 가상 네트워크와 같은 다양한 타입들의 백홀 인터페 이스들을 통해 무선 네트워크 에서의 하나 이상의 다른 기지국들 또는 네트워크 노드들 (도시되지 않음) 에 및/또는 서로에 상호접속될 수도 있다. 무선 네트워크 는 또한 하나 이상의 중계국들을 포함할 수도 있다. 중계국은, 업스트림 스테이션 (예 를 들어, 기지국 또는 UE ) 으로부터 데이터의 송신물을 수신하고 데이터의 송신물을 다운스트림 스테이션 (예를 들어, UE 또는 기지국 ) 으로 전송할 수 있는 엔티티이다. 중계국은 다른 Ue들 에 대한 송신들을 중계할 수 있는 UE 일 수도 있다. 도 1 에 나타낸 예에서, BS (110d; 예컨 대, 중계 기지국) 은 BS (110a) 와 UE (120d) 사이의 통신을 용이하게 하기 위해 BS (110a; 예컨대, 매크로 기 지국) 및 UE (120d) 와 통신할 수도 있다 통신들을 중계하는 기지국 은 중계국, 중계 기지국, 렐레이 등 으로 지칭될 수도 있다. 무선 네트워크는, 매크로 기지국들, 피코 기지국들, 펨토 기지국들, 중계 기지국들 등과 같은 상이한 타입 들의 기지국들을 포함하는 이종(heterogeneous) 네트워크일 수도 있다. 이들 상이한 타입들의 기지국 들은 무선 네트워크에 있어서 상이한 송신 전력 레벨들, 상이한 커버리지 영역들, 및/또는 간섭에 대 한 상이한 영향들을 가질 수도 있다. 예를 들어, 매크로 기지국들은 높은 송신 전력 레벨 (예를 들어, 5 내 지 40 와트) 을 가질 수도 있는 반면, 피코 기지국들, 펨토 기지국들, 및 중계 기지국들은 더 낮은 송신 전력 레벨들 (예를 들어, 0.1 내지 2 와트) 을 가질 수도 있다. 네트워크 제어기 는 기지국들 의 세트에 커플링하거나 이와 통신할 수도 있고 이들 기지국들 에 대한 조정 및 제어를 제공할 수도 있다. 네트워크 제어기 는 백홀 통신 링크를 통해 기지국들 과 통신할 수도 있다. 기지국들 은 직접 또는 간접적으로 무선 또는 유선 백홀 통신 링크를 통 해 서로 통신할 수도 있다. UE들은 무선 네트워크 전체에 걸쳐 분산될 수도 있고, 각각의 UE는 고정식이거나 이동식일 수도 있다. UE 는 예를 들어, 액세스 단말기, 단말기, 이동국, 및/또는 가입자 유닛을 포함할 수도 있다. UE 는 셀룰러 폰 (예를 들어, 스마트 폰), 개인용 디지털 보조기 (PDA), 무선 모뎀, 무선 통신 디바이 스, 핸드헬드 디바이스, 랩탑 컴퓨터, 코드리스 폰, 무선 로컬 루프 (WLL) 스테이션, 태블릿, 카메라, 게이밍 디바이스, 넷북, 스마트북, 울트라북, 의료용 디바이스, 생체인식 디바이스, 웨어러블 디바이스 (예를 들어, 스 마트 워치, 스마트 의류, 스마트 안경, 스마트 손목밴드, 스마트 보석 (예를 들어, 스마트 반지 또는 스마트 팔 찌)), 엔터테인먼트 디바이스 (예를 들어, 뮤직 또는 비디오 디바이스, 및/또는 위성 라디오), 차량용 컴포넌트 또는 센서, 스마트 미터/센서, 산업용 제조 장비, 글로벌 포지셔닝 시스템 디바이스, 및/또는 무선 매체를 통해 통신하도록 구성되는 임의의 다른 적합한 디바이스일 수도 있다. 일부 UE들 은 머신 타입 통신 (MTC) 또는 진화된 또는 강화된 머신 타입 통신 (eMTC) UE들로 고려될 수도 있다. MTC UE 및/또는 eMTC UE 는 기지국, 다른 디바이스 (예를 들어, 원격 디바이스), 또는 일부 다른 엔 티티와 통신할 수도 있는, 예를 들어 로봇, 드론, 원격 디바이스, 센서, 미터, 모니터, 및/또는 위치 태그를 포 함할 수도 있다. 일부 UE들 은 사물 인터넷 (Internet-of-Things; IoT) 디바이스들로 간주될 수 있 고 및/또는 NB-IoT (협대역 IoT) 디바이스들로서 구현될 수도 있다. 일부 UE들은 고객 댁내 장치 (Customer Premises Equipment)로 고려될 수도 있다. UE는 프로세서 컴포넌트들 및/또는 메모리 컴포 넌트들과 같은 UE의 컴포넌트들을 수용하는 하우징 내부에 포함될 수도 있다. 일부 양태들에 있어서, 프로세서 컴포넌트들 및 메모리 컴포넌트들은 함께 커플링될 수도 있다. 예를 들어, 프로세서 컴포넌트들 (예 를 들어, 하나 이상의 프로세서) 및 메모리 컴포넌트들 (예를 들어, 메모리) 은 동작가능하게 커플링되고, 통신 가능하게 커플링되고, 전자적으로 커플링되고, 및/또는 전기적으로 커플링될 수도 있다. 일반적으로, 임의의 수의 무선 네트워크들 이 주어진 지리적 영역에 전개될 수도 있다. 각각의 무선 네트워크 는 특정 RAT 를 지원할 수도 있고 하나 이상의 주파수 상에서 동작할 수도 있다. RAT 는 무 선 기술, 에어 인터페이스 등으로서 지칭될 수도 있다. 주파수는 캐리어, 주파수 채널 등으로서 지칭될 수 도 있다. 각각의 주파수는 상이한 RAT들의 무선 네트워크들 사이의 간섭을 회피하기 위해 주어진 지리적 영 역에서 단일의 RAT 를 지원할 수도 있다. 일부 경우들에, NR 또는 5G RAT 네트워크들이 전개될 수도 있다. 일부 양태들에서, (예를 들어, UE (120a) 및 UE (120e) 로 나타낸) 2 이상의 UE들 은 하나 이상의 사이 드링크 채널을 사용하여 직접 (예를 들어, 서로 통신하기 위한 중개자로서 기지국 을 사용하지 않으면서) 통신할 수도 있다. 예를 들어, UE들 은 피어-투-피어 (P2P) 통신, 디바이스-대-디바이스 (D2D) 통신, 차량 대 사물 (V2X) 프로토콜 (예를 들어, 차량 투 차량 (V2V) 프로토콜, 차량 대 인프라구조 (V2I) 프로토콜, 또는 차량 대 보행자 (V2P) 프로토콜을 포함할 수도 있음), 및/또는 메쉬 네트워크를 사용하여 통신할 수도 있 다. 이러한 예들에서, UE 는 기지국 에 의해 수행되고 있는 것으로서 본 명세서의 다른 곳에서 설명된 스케줄링 동작들, 자원 선택 동작들, 및/또는 다른 동작들을 수행할 수도 있다. 무선 네트워크 의 디바이스들은, 주파수 또는 파장에 의해 다양한 클래스들, 대역들, 채널들 등으로 세분 될 수도 있는 전자기 스펙트럼을 사용하여 통신할 수도 있다. 예를 들어, 무선 네트워크 의 디바이스들은 하나 이상의 동작 대역을 사용하여 통신할 수도 있다. 5G NR 에서, 2개의 초기 동작 대역은 주파수 범 위 지정들 FR1 (410MHz - 7.125GHz) 및 FR2 (24.25GHz - 52.6GHz) 로서 식별되었다. FR1 의 일부는 6GHz 보다 크지만, FR1 은 다양한 문서들 및 기사들에서 종종 \"서브-6GHz\" 대역으로서 (상호교환가능하게) 지칭됨을 이해해야 한다. 유사한 명명법 문제가 때때로 FR2 에 관하여 발생하며, 이는 \"밀리미터파\" 대역으로서 국제 원격통신 연합 (ITU) 에 의해 식별되는 극고 주파수 (EHF) 대역 (30 GHz - 300 GHz) 과는 상이함에도 불구하고, 문서들 및 기사들에서 \"밀리미터파\" 대역으로서 종종 (상호교환가능하게) 지칭된다. FR1 과 FR2 사이의 주파수들은 종종 중간 대역 (mid-band) 주파수들로서 지칭된다. 최근의 5G NR 연구들은 이러한 중간 대역 주파수들에 대한 동작 대역을 주파수 범위 지정 FR3 (7.125 GHz - 24.25 GHz) 로서 식별하였 다. FR3 내에 속하는 주파수 대역들은 FR1 특성들 및/또는 FR2 특성들을 물려받을 수 있고, 따라서 FR1 및/ 또는 FR2 의 특징들을 중간 대역 주파수들로 효과적으로 확장시킬 수 있다. 부가적으로, 5G NR 동작을 52.6 GHz 초과로 확장하기 위해 더 높은 주파수 대역들이 현재 탐색되고 있다. 예를 들어, 3개의 더 높은 동작 대역들이 주파수 범위 지정들 (FR4a 또는 FR4-1 (52.6 GHz - 71 GHz), FR4 (52.6 GHz - 114.25 GHz), 및 FR5 (114.25 GHz - 300 GHz)) 로서 식별되었다. 이들 더 높은 주파수 대역들의 각각은 EHF 대역 내에 속한다. 상기의 예들을 염두에 두고, 달리 구체적으로 서술되지 않으면, 본 명세서에서 사용되는 경우 용어 \"서브-6 GHz\" 등은 6 GHz 미만일 수도 있거나, FR1 이내일 수도 있거나, 또는 중간-대역 주파수들을 포함할 수도 있는 주파수들을 광범위하게 나타낼 수도 있음이 이해되어야 한다. 추가로, 달리 구체적으로 서술되지 않으면, 본 명세서에서 사용되는 경우 용어 \"밀리미터파\" 등은 중간-대역 주파수들을 포함할 수도 있거나, FR2, FR4, FR4-a 또는 FR4-1, 및/또는 FR5 이내일 수도 있거나, 또는 EHF 대역 이내일 수도 있는 주파수들을 광범위하게 나타낼 수도 있음이 이해되어야 한다. 이들 동작 대역들 (예컨대, FR1, FR2, FR3, FR4, FR4-a, FR4-1, 및/ 또는 FR5) 에 포함된 주파수들은 수정될 수도 있고, 본 명세서에서 설명된 기법들은 이들 수정된 주파수 범위들 에 적용가능함이 고려된다. 일부 양태들에서, \"기지국\"(예를 들어, 기지국) 또는 \"네트워크 노드\" 또는 \"네트워크 엔티티\"라는 용어는 집성된 기지국, 분리된 기지국(예를 들어, 도 9와 관련하여 설명됨), 통합 액세스 및 백홀 (IAB) 노드, 릴레이 노드, 및/또는 이들의 하나 이상의 컴포넌트들을 지칭할 수도 있다. 예를 들어, 일부 양태들에서 \"기지국\", \"네트워크 노드\" 또는 \"네트워크 엔티티\"는 중앙 유닛(CU), 분산 유닛(DU), 무선 유닛(RU), 근실시간 (Near- RT) RAN 지능형 컨트롤러(RIC), 또는 비실시간 (Non-RT) RIC, 또는 이들의 조합을 의미할 수 있다. 일부 양태 들에서, 용어 \"기지국\", \"네트워크 노드\" 또는 \"네트워크 엔티티\"는 기지국과 관련하여 본 명세서에 설명 된 기능과 같은 하나 이상의 기능을 수행하도록 구성된 하나의 디바이스를 지칭할 수 있다. 일부 양태들에서, \"기지국\", \"네트워크 노드\" 또는 \"네트워크 엔티티\"라는 용어는 하나 이상의 기능을 수행하도록 구성된 복수의 디바이스들을 지칭할 수 있다. 예를 들어, 일부 분산 시스템에서는 (동일한 지리적 위치 또는 서로 다른 지리 적 위치에 위치할 수 있는) 다수의 서로 다른 디바이스들 각각이 기능의 적어도 일부를 수행하거나, 기능의 적 어도 일부의 성능을 복제하도록 구성될 수 있으며, \"기지국\", \"네트워크 노드\" 또는 \"네트워크 엔티티\"라는 용 어는 이들 서로 다른 디바이스들 중 임의의 하나 이상을 지칭할 수 있다. 일부 양태들에서, \"기지국\", \"네트 워크 노드\" 또는 \"네트워크 엔티티\"라는 용어는 하나 이상의 가상 기지국 및/또는 하나 이상의 가상 기지국 기 능을 지칭할 수 있다. 예를 들어, 몇몇 양태들에서, 2개 이상의 기지국 기능이 단일 디바이스 상에서 인스턴 스화될 수도 있다. 일부 양태들에서, \"기지국\", \"네트워크 노드\" 또는 \"네트워크 엔티티\"라는 용어는 기지국 기능들 중 하나를 지칭하고 다른 것은 지칭하지 않을 수도 있다. 이러한 방식으로, 단일 디바이스는 2 이상의 기지국을 포함할 수 있다. 위에 나타낸 바와 같이, 도 1 은 일 예로서 제공된다. 다른 예들은 도 1 과 관련하여 설명되었던 것과는 상 이할 수도 있다. 도 2 는 본 개시에 따라 무선 네트워크 에서 UE 와 통신하는 기지국 의 일 예 를 예시 한 다이어그램이다. 기지국 은 T 개의 안테나들 (T ≥ 1) 과 같은 안테나들 (234a 내지 234t) 의 세 트를 구비할 수 있다. UE 는 R 개의 안테나들 (R ≥ 1) 과 같은 안테나들 (252a 내지 252r) 의 세트 를 구비할 수 있다. 기지국 에서, 송신 프로세서 는 데이터 소스 로부터, UE (또는 UE들 의 세트) 에 대해 의도된 데이터를 수신할 수 있다. 송신 프로세서 는, 그 UE 로부터 수신된 하나 이상 의 채널 품질 표시자들 (CQI들) 에 적어도 부분적으로 기반하여 그 UE 에 대한 하나 이상의 변조 및 코딩 기법들 (MCS들) 을 선택할 수 있다. 기지국 은 UE 에 대해 선택된 MCS(들) 에 적어도 부분적으로 기반하여 UE 에 대한 데이터를 프로세싱 (예를 들어, 인코딩 및 변조) 할 수도 있고 UE 에 대한 데이터 심볼들을 제공할 수도 있다. 송신 프로세서 는 (예를 들어, 준정적 자원 파티셔닝 정보 (SRPI) 에 대한) 시스템 정보 및 제어 정보 (예를 들어, CQI 요청들, 승인들, 및/또는 상위 계층 시그널링) 를 프로세싱하고 오버헤드 심볼들 및 제어 심볼들을 제공할 수도 있다. 송신 프로세서 는 기준 신호들 (예를 들어, 셀 특정 기준 신호 (CRS) 또는 복조 기준 신호 (DMRS)) 및 동기화 신호들 (예를 들어, 1차 동기화 신호 (PSS) 또는 2차 동기화 신호 (SSS)) 에 대한 기준 심볼들을 생성할 수도 있다. 송신 (TX) 다중 입력 다중 출력 (MIMO) 프로세서 는, 적용가능한 경우, 데이터 심볼들, 제어 심볼들, 오버헤드 심볼들, 및/또 는 참조 심볼들에 대한 공간적 프로세싱 (예를 들면, 프리코딩) 을 수행할 수도 있고, 출력 심볼 스트림들의 세 트 (예를 들어, T개의 출력 심볼 스트림들) 를 모뎀들 (232a 내지 232t) 로서 나타낸, 모뎀들 의 대응하 는 세트 (예를 들어, T개의 모뎀들) 에 제공할 수도 있다. 예를 들어, 각각의 출력 심볼 스트림은 모뎀 의 변조기 컴포넌트 (MOD 로서 나타냄) 에 제공될 수도 있다. 각각의 모뎀 은 개개의 변조기 컴포넌트를 사용하여 (예를 들어, OFDM 에 대해) 개개의 출력 심볼 스트림을 프로세싱하여 출력 샘플 스트림을 획득할 수도 있다. 각각의 모뎀 은 추가로 개개의 변조기 컴포넌트를 사용하여 출력 샘플 스트림을 프로세싱 (예를 들어, 아날로그로의 변환, 증폭, 필터링, 및/또는 업컨버팅) 하여 다운링크 신호를 획득할 수도 있다. 모뎀들 (232a 내지 232t) 은 안테나들 (234a 내지 234t) 로서 도시된, 안테나들 의 대응하는 세트 (예를 들어, T 개의 안테나들) 를 통해 다운링크 신호들의 세트 (예를 들어, T 개의 다운링크 신호들) 를 송신할 수도 있다. UE 에서, (안테나들 (252a 내지 252r) 로서 도시된) 안테나들의 세트 는 기지국 및/또는 다 른 기지국들 로부터 다운링크 신호들을 수신할 수도 있고, 모뎀들 (254a 내지 254r) 로서 도시된, 모뎀들 의 세트 (예를 들어, R 개의 모뎀들) 에 수신된 신호들 (예를 들어, R 수신된 신호들) 의 세트를 제공할 수도 있다. 예를 들어, 각각의 수신된 신호는 모뎀 의 복조기 컴포넌트 (DEMOD 로 도시됨) 에 제공될 수도 있다. 각각의 모뎀 은 입력 샘플들을 획득하기 위해 각각의 복조기 컴포넌트를 사용하여 수신된 신호를 컨디셔닝 (예를 들어, 필터링, 증폭, 다운컨버팅, 및/또는 디지털화) 할 수도 있다. 각각의 모뎀 은 복조기 컴포넌트를 사용하여 (예를 들어, OFDM 에 대해) 입력 샘플들을 더 프로세싱하여 수신된 심볼 들을 획득할 수도 있다. MIMO 검출기 는 모뎀들 로부터의 수신된 심볼들을 획득할 수도 있고, 적용 가능한 경우, 수신된 심볼들에 대해 MIMO 검출을 수행할 수도 있으며, 검출된 심볼들을 제공할 수도 있다. 수신 프로세서 는 검출된 심볼들을 프로세싱 (예를 들어, 복조 및 디코딩) 할 수도 있고, UE 에 대한 디코딩된 데이터를 데이터 싱크 에 제공할 수도 있고, 디코딩된 제어 정보 및 시스템 정보를 제어기 /프로세서 에 제공할 수도 있다. 용어 \"제어기/프로세서\" 는 하나 이상의 제어기들, 하나 이상의 프 로세서들, 또는 이들의 조합을 지칭할 수도 있다. 채널 프로세서는 다른 예들 중에서도, 참조 신호 수신 전 력 (RSRP) 파라미터, 수신 신호 강도 표시자 (RSSI) 파라미터, 참조 신호 수신 품질 (RSRQ) 파라미터, 및/또는 CQI 파라미터를 결정할 수도 있다. 일부 예들에서, UE 의 하나 이상의 컴포넌트가 하우징 에 포함될 수도 있다. 네트워크 제어기 는 통신 유닛 , 제어기/ 프로세서 , 및 메모리 를 포함할 수도 있다. 네트워크 제어기 는, 예를 들어 코어 네트워크에서의 하나 이상의 디바이스를 포함할 수도 있다. 네트워크 제어기 는 통신 유닛 을 통해 기지국 과 통신할 수도 있다. 하나 이상의 안테나 (예를 들어, 안테나들 (234a 내지 234t) 및/또는 안테나들 (252a 내지 252r)) 는 다른 예들 중에서도, 하나 이상의 안테나 패널, 하나 이상의 안테나 그룹, 안테나 엘리먼트들의 하나 이상의 세트, 및/또 는 하나 이상의 안테나 어레이를 포함할 수도 있거나, 이들 내에 포함될 수도 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트, 및/또는 안테나 어레이는 도 2 의 하나 이상의 컴포넌트들과 같은, (단일 하 우징 또는 다수의 하우징들 내의) 하나 이상의 안테나 엘리먼트들, 공면의 안테나 엘리먼트들의 세트, 비-공면 의 안테나 엘리먼트들의 세트, 및/또는 하나 이상의 송신 및/또는 수신 컴포넌트들에 커플링된 하나 이상의 안 테나 엘리먼트들을 포함할 수도 있다. 업링크 상에서, UE 에서, 송신 프로세서 는 데이터 소스 로부터 데이터를, 그리고 제어기/프 로세서 로부터 (예를 들어, RSRP, RSSI, RSRQ 및/또는 CQI 를 포함하는 리포트들을 위한) 제어 정보를 수 신 및 프로세싱할 수도 있다. 송신 프로세서 는 하나 이상의 레퍼런스 신호에 대한 레퍼런스 심볼들 을 생성할 수도 있다. 송신 프로세서 로부터의 심볼들은, 적용가능한 경우 TX MIMO 프로세서 에 의해 프리코딩되고, (예를 들어, DFT-s-OFDM 또는 CP-OFDM 에 대해) 모뎀들 에 의해 추가로 프로세싱 되고, 기지국 에 송신될 수도 있다. 일부 예들에서, UE 의 모뎀 은 변조기 및 복조기를포함할 수도 있다. 일부 예들에서, UE 는 송수신기를 포함한다. 송수신기는 안테나(들), 모 뎀(들), MIMO 검출기 , 수신 프로세서 , 송신 프로세서 , 및/또는 TX MIMO 프로세서 의 임의의 조합을 포함할 수도 있다. 송수신기는 (예를 들어, 도 3 내지 도 10 을 참조하여 설명된 바와 같이) 본 명세서에서 설명된 방법들 중 임의의 방법의 양태들을 수행하기 위해 프로세서 (예를 들어, 제어 기/프로세서 ) 및 메모리 에 의해 사용될 수도 있다. 기지국 에서, UE 및/또는 다른 UE들로부터의 업링크 신호들은 안테나들 에 의해 수신되고, 모뎀 (예를 들어, 모뎀 의, DEMOD 로서 도시된, 복조기 컴포넌트) 에 의해 프로세싱되고, 적용가능 한 경우 MIMO 검출기 에 의해 검출되고, 수신 프로세서 에 의해 추가로 프로세싱되어 UE 에 의해 전송된 디코딩된 데이터 및 제어 정보를 획득할 수도 있다. 수신 프로세서 는 디코딩된 데이터 를 데이터 싱크 에 제공하고 디코딩된 제어 정보를 제어기/프로세서 에 제공할 수도 있다. 기 지국 은 통신 유닛 을 포함할 수도 있고, 통신 유닛 을 통해 네트워크 제어기 와 통신 할 수도 있다. 기지국 은 다운링크 및/또는 업링크 통신들을 위해 하나 이상의 UE들 을 스케줄 링하기 위한 스케줄러 를 포함할 수도 있다. 일부 예들에 있어서, 기지국 의 모뎀 은 변 조기 및 복조기를 포함할 수도 있다. 일부 예들에 있어서, 기지국 은 송수신기를 포함한다. 송수 신기는 안테나(들), 모뎀(들), MIMO 검출기 , 수신 프로세서 , 송신 프로세서 , 및/ 또는 TX MIMO 프로세서 의 임의의 조합을 포함할 수도 있다. 송수신기는 (예를 들어, 도 3 내지 도 10 을 참조하여 설명된 바와 같이) 본 명세서에서 설명된 방법들 중 임의의 방법의 양태들을 수행하기 위해 프 로세서 (예를 들어, 제어기/프로세서 ) 및 메모리 에 의해 사용될 수도 있다. 기지국 의 제어기/프로세서 , UE 의 제어기/프로세서 , 및/또는 도 2 의 임의의 다른 컴 포넌트(들)는 본 명세서의 다른 곳에서 더 상세히 설명된 바와 같이 연관된 하나 이상의 기법들을 수행할 수도 있다. 예를 들어, 기지국 의 제어기/프로세서 , UE 의 제어기/프로세서 , 및/또는 도 2 의 임의의 다른 컴포넌트(들)는, 예를 들어, 도 9 의 프로세스 , 도 10 의 프로세스 , 및/또는 본 명세서에서 설명된 바와 같은 다른 프로세스들의 동작들을 수행하거나 지시할 수도 있다. 메모리 및 메모리 는 각각 기지국 및 UE 에 대한 데이터 및 프로그램 코드들을 저장할 수도 있다. 일부 예들에 있어서, 메모리 및/또는 메모리 는 무선 통신을 위한 하나 이상의 명령들 (예컨대, 코드 및/또는 프로그램 코드) 을 저장하는 비일시적 컴퓨터 판독가능 매체를 포함할 수도 있다. 예를 들어, 하나 이상의 명령들은, 기지국 및/또는 UE 의 하나 이상의 프로세서들에 의해 (예컨대, 직접적으로, 또는 컴파일, 변환, 및/또는 해석 이후에) 실행될 경우, 하나 이상의 프로세서들, UE , 및/또 는 기지국 으로 하여금, 예를 들어, 도 9 의 프로세스 , 도 10 의 프로세스 , 및/또는 본 명 세서에서 설명된 바와 같은 다른 프로세스들의 동작들을 수행하게 하거나 지시하게 할 수도 있다. 일부 예 들에 있어서, 명령들을 실행하는 것은, 다른 예들 중에서, 명령들을 구동하는 것, 명령들을 변환하는 것, 명령 들을 컴파일하는 것, 및/또는 명령들을 해석하는 것을 포함할 수도 있다. 일부 양태들에서, UE 는 사이드링크 자원 예약을 송신하기 위한 수단을 포함하며, 여기서 사이드링크 자원 예약 은 사이드링크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯에서의 제1 자원 및 사이드링크 자원 예 약에 이용 가능한 제2 대역폭을 갖는 서브대역 전이중 (SBFD) 슬롯에서의 제2 자원을 나타내고, 사이드링크 자 원 예약은 업링크 슬롯과 SBFD 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용함; 및 사이드링크 자원 예약을 사용하여 통신을 송신하기 위한 수단을 포함한다. UE 가 본 명세서에서 설명된 동작들을 수행하기 위한 수 단은 예를 들어, 안테나 , 모뎀, MIMO 검출기 , 수신 프로세서 , 송신 프로세서 , TX MIMO 프로세서 , 제어기/프로세서 , 또는 메모리 중 하나 이상을 포함할 수도 있다. 일부 양태들에서, UE는 SBFD 슬롯의 무효 주파수 자원을 사용하지 않고 통신을 송신하기 위한 수단을 포함한다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "일부 양태들에서, UE 는 사이드링크 자원 예약을 수신하기 위한 수단을 포함하며, 여기서 사이드링크 자원 예약 은 사이드링크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯에서의 제1 자원 및 사이드링크 자원 예 약에 이용 가능한 제2 대역폭을 갖는 SBFD 슬롯에서의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬 롯과 SBFD 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용함; 및 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩하기 위한 수단을 포함한다. UE 가 본 명세서에서 설명된 동작들을 수행하기 위한 수단은 예를 들어, 안테나 , 모뎀, MIMO 검출기 , 수신 프로세서 , 송신 프로세서 , TX MIMO 프로세서 , 제어기/프로세서 , 또는 메모리 중 하나 이상을 포함할 수도 있다. 일부 양태들에서, UE는 SBFD 슬롯의 무효 주파수 자원을 사용하지 않고 통신을 디코딩하기 위한 수단을 포함한 다. 도 2 에서의 블록들이 별개의 컴포넌트들로서 도시되지만, 블록들에 관하여 위에 설명된 기능들은 단일 하드웨 어, 소프트웨어, 또는 조합 컴포넌트에서 또는 컴포넌트들의 다양한 조합들에서 구현될 수도 있다. 예를 들 어, 송신 프로세서 , 수신 프로세서 , 및/또는 TX MIMO 프로세서 에 관하여 설명된 기능들은 상기 하나 이상의 송수신기들을 통하여 상기 다른 UE 로, 제어기/프로세서 의 제어에 의해 또는 그 제어 하에 수행될 수도 있다. 상기 나타낸 바와 같이, 도 2 는 예로서 제공된다. 다른 예들은 도 2 과 관련하여 설명되었던 것과는 상이 할 수도 있다. 도 3 은 본 개시에 따른 사이드링크 통신의 일 예 를 예시한 다이어그램이다. 도 3 에 도시된 바와 같이, 제 1 UE (305-1) 는 하나 이상의 사이드링크 채널들 을 통하여 제 2 UE (305-2) (및 하나 이상의 다른 UE들 ) 와 통신할 수 있다. UE들 (305-1 및 305-2) 은 P2P 통신, D2D 통신, (예를 들어, V2V 통신, V2I 통신, 차량-대-보행자 (V2P) 통신, 및/또는 기타 등을 포함할 수도 있는) V2X 통신, 메쉬 네트워킹, 및/또는 기타 등을 위한 하나 이상의 사이드링크 채널들 을 사용하여 통신할 수도 있다. 일부 양태들에서, UE들 (예를 들어, UE (305-1) 및/또는 UE (305-2)) 은 UE 와 같은 본 명세서의 다른 곳에 기재된 하나 이상의 다른 UE들에 대응할 수도 있다. 일부 양태들에서, 하나 이상의 사 이드링크 채널들 은 PC5 인터페이스를 사용할 수 있고/있거나 고주파 대역 (예를 들어, 5.9 GHz 대역) 에 서 동작할 수 있다. 추가적으로 또는 대안적으로, UE들 은 GNSS (global navigation satellite system) 타이밍을 사용하여 송신 시간 간격들 (TTIs) (예를 들어, 프레임들, 서브프레임들, 슬롯들, 심볼들 등) 의 타이밍을 동기화할 수도 있다. 도 3 에 추가로 도시된 바와 같이, 하나 이상의 사이드링크 채널들 은 물리 사이드링크 제어 채널 (PSCCH) , 물리 사이드링크 공유 채널 (PSSCH) 및/또는 물리 사이드링크 피드백 채널 (PSFCH) 을 포함할 수도 있다. PSCCH 는 액세스 링크 또는 액세스 채널을 통하여 기지국 과의 셀 룰러 통신들에 사용되는 물리 다운링크 제어 채널 (PDCCH) 및/또는 물리 업링크 제어 채널 (PUCCH) 과 유사하게 제어 정보를 통신하는 데 사용될 수도 있다. PSSCH 는 액세스 링크 또는 액세스 채널을 통하여 기지 국 과의 셀룰러 통신들에 사용되는 물리 다운링크 공유 채널 (PDSCH) 및/또는 물리 업링크 공유 채널 (PUSCH) 과 유사하게 데이터를 통신하는 데 사용될 수도 있다. 예를 들어, PSCCH 는 사이드링크 통신 들에 사용되는 다양한 제어 정보, 예컨대 하나 이상의 자원들 (예를 들어, 시간 자원, 주파수 자원, 공간 자원 들 등) 을 나타낼 수도 있는 사이드링크 제어 정보 (SCI) 를 반송할 수도 있고, 여기서 전송 블록 (TB) 은 PSSCH 상에서 반송될 수도 있다. TB 는 데이터를 포함할 수도 있다. PSFCH 는, 하이브리드 자동 반복 요청 (HARQ) 피드백 (예컨대, 확인응답 또는 부정 확인응답 (ACK/NACK) 정보), 송신 전력 제어 (TPC), 스케줄링 요청 (SR) 등과 같은 사이드링크 피드백 을 통신하는데 사용될 수도 있 다. 일부 양태들에서, 하나 이상의 사이드링크 채널들 은 자원 풀들을 사용할 수도 있다. 예를 들어, (예 컨대, SCI 에 포함된) 스케줄링 배정은 시간에 걸쳐 특정 자원 블록들 (RB들) 을 사용하여 서브-채널들에 서 송신될 수도 있다. 일부 양태들에서, 스케줄링 배정과 연관된 (예컨대, PSSCH 상에서의) 데이터 송신물들은 (예컨대, 주파수 분할 멀티플렉싱을 사용하여) 스케줄링 배정과 동일한 서브프레임에서 인접한 RB들 을 점유할 수도 있다. 일부 양태들에서, 스케줄링 배정 및 연관된 데이터 송신물들은 인접한 RB들 상에서 송신되지 않는다. 일부 양태들에서, UE 는, 자원 선택 및/또는 스케줄링이 (예컨대, 기지국 보다는) UE 에 의 해 수행되는 송신 모드를 사용하여 동작할 수도 있다. 일부 양태들에서, UE 는, 송신물들에 대한 채 널 이용가능성을 감지함으로써 자원 선택 및/또는 스케줄링을 수행할 수도 있다. 예를 들어, UE 는 다양한 사이드링크 채널들과 연관된 수신 신호 강도 표시자 (RSSI) 파라미터 (예를 들어, 사이드링크-RSSI (S- RSSI) 파라미터) 를 측정할 수 있고, 다양한 사이드링크 채널들과 연관된 기준 신호 수신 전력 (RSRP) 파라미터 (예를 들어, PSSCH-RSRP 파라미터) 를 측정할 수 있고, 다양한 사이드링크 채널들과 연관된 기준 신호 수신 품 질 (RSRQ) 파라미터 (예를 들어, PSSCH-RSRQ 파라미터) 를 측정할 수 있고, 그리고 측정(들)에 적어도 부분적으 로 기반하여 사이드링크 통신의 송신을 위한 채널을 선택할 수 있다.추가적으로, 또는 대안적으로, UE 는 점유된 자원들, 채널 파라미터들 등을 나타낼 수도 있는 PSCCH 에서 수신된 SCI 를 사용하여 자원 선택 및/또는 스케줄링을 수행할 수도 있다. 부가적으로 또 는 대안적으로, UE 는, (예컨대, UE 가 서브프레임들의 특정 세트에 대해 사용할 수 있는 자원 블 록들의 최대 수를 표시함으로써) 레이트 제어를 위해 사용될 수도 있는, 다양한 사이드링크 채널들과 연관된 채 널 사용률 (CBR) 을 결정함으로써 자원 선택 및/또는 스케줄링을 수행할 수도 있다. 자원 선택 및/또는 스케줄링이 UE 에 의해 수행되는 송신 모드에서, UE 는 사이드링크 허여들을 생 성할 수도 있고, 그 허여들을 SCI 에서 송신할 수도 있다. 사이드링크 승인은, 예를 들어, PSSCH 상의 다가오는 사이드링크 송신을 위해 (예를 들어, TB들 에 대해) 사용될 하나 이상의 자원 블록 들, 다가오는 사이드링크 송신을 위해 사용될 하나 이상의 서브프레임들, 및/또는 다가오는 사이드링크 송신을 위해 사용될 변조 및 코딩 구성 (MCS), 및/또는 기타 등과 같은 다가오는 사이드링크 송신을 위해 사용될 하나 이상의 파라미터들 (예를 들어, 송신 파라미터들) 을 표시할 수도 있다. 일부 양태들에서, UE 는 사 이드링크 송신의 주기성과 같은 반-지속적 스케줄링 (SPS) 에 대한 하나 이상의 파라미터들을 표시하는 사이드 링크 허여를 생성할 수도 있다. 부가적으로 또는 대안적으로, UE 는 이벤트 구동형 스케줄링을 위한, 예컨대, 온-디맨드 (on-demand) 사이드링크 메시지를 위한 사이드링크 허여를 생성할 수도 있다. SCI는 각각 SCI-1 및 SCI-2로 지칭될 수 있는 제1 부분 및 제2 부분을 포함할 수 있다. SCI-1 은 PSCCH 상에서 송신될 수도 있다. SCI-1은 자원 할당을 포함할 수 있으며, SCI-2 (예를 들어, SCI-2의 포맷 및/또는 기타 정보) 를 디코딩하기 위한 정보를 포함할 수 있다. 자원 할당은 SCI-2 및/또는 공유 채널 (SCH)을 위한 자원을 나타낼 수 있다. SCI-2 은 PSSCH 상에서 송신될 수도 있다. SCI-2는 SCH를 디코 딩하기 위한 정보를 포함할 수 있다. SCI-1 및/또는 SCI-2는 물리적 다운링크 제어 채널 (PDCCH) 폴라 코딩 /디코딩 체인을 사용하여 인코딩 및/또는 디코딩될 수 있다. 일부 양태들에서, SCI-2는 PSSCH 복조 참조 신호(DMRS)를 갖는 제1 심볼로부터 시작하여 PSSCH의 연속적인 자원 블록(RB)들에 매핑될 수 있다. 일부 양태들에서, SCI-2는 SCH와 별도로 스크램블링될 수 있다. 일부 양 태들에서, SCI-2 는 직교 위상 시프트 키잉 (QPSK) 을 사용하여 변조될 수도 있다. SCI-2의 포맷은 SCI-1 에 의해 표시될 수 있으므로, SCI-2의 수신자는 SCI-2의 블라인드 디코딩을 수행하지 않을 수 있으며, 이로 인 해 컴퓨팅 자원을 절약할 수 있다. 일부 양태들에서, 본 명세서의 다른 곳에서 설명되는 바와 같이, SCI-1은 업링크 슬롯들 및 SBFD 슬롯들에 대한 공통 서브채널 인덱싱 구성을 사용하여 사이드링크 자원 예약을 나타낼 수 있다. 위에 나타낸 바와 같이, 도 3 은 일 예로서 제공된다. 다른 예들은 도 3 과 관련하여 설명된 것과는 상이할 수도 있다. 도 4 는 본 개시에 따른 사이드링크 통신 및 액세스 링크 통신의 일 예 를 예시한 다이어그램이다. 도 4 에 도시된 바와 같이, 송신기 (Tx)/수신기 (Rx) UE 및 Rx/Tx UE 는 도 3 과 관련하여 전술한 바와 같이 사이드링크를 통해 서로 통신할 수 있다. 추가로 도시된 바와 같이, 일부 사이드링크 모드에서, 기지국 은 제 1 액세스 링크를 통해 Tx/Rx UE 와 통신할 수도 있다. 추가적으로 또는 대안적으 로, 일부 사이드링크 모드에서, 기지국 은 제 2 액세스 링크를 통해 Rx/Tx UE 와 통신할 수도 있다. Tx/Rx UE 및/또는 Rx/Tx UE 는 도 1 의 UE 와 같은 본 명세서의 다른 곳에 기술 된 하나 이상의 UE들에 대응할 수 있다. 따라서, (예를 들어, PC5 인터페이스를 통한)UE 사이의 직접 링크는 사이드링크로 지칭될 수도 있고, (예를 들어, Uu 인터페이스를 통한)기지국과 UE 사이의 직접 링크는 액세스 링크로 지칭될 수도 있다. 사이드링크 통신은 사이드링크를 통해 송신될 수도 있고 액세스 링크 통신은 액세스 링크를 통해 송신될 수도 있다. 액세스 링크 통신은 (기지국 으로부터 UE 로의) 다운링크 통신 또는 (UE 로부터 기지국 으로의) 업링크 통신일 수 있다. 일부 양태들에 서, 본 명세서의 다른 곳에서 설명되는 바와 같이, 사이드링크 통신들은 업링크 슬롯들 및 SBFD 슬롯들에 대한 공통 서브채널 인덱싱 구성을 사용하여 사이드링크 자원 풀의 자원들을 통해 수행될 수도 있다. 위에 나타낸 바와 같이, 도 4 은 일 예로서 제공된다. 다른 예들은 도 4 과 관련하여 설명된 것과는 상이할 수도 있다. 도 5 는 본 개시에 따른 서브대역 전이중 (SBFD) 슬롯의 예 를 예시한 도면이다. 예 은 다운링 크(DL) 슬롯, 업링크(UL) 슬롯 및 2개의 SBFD 슬롯을 보여준다. DL 슬롯은 기지국에서 UE로의 다운링크 통 신(예를 들어, Uu 무선 액세스 연결을 통해)에 사용될 수 있는 슬롯이다. UL 슬롯은 UE에서 기지국으로의업링크 통신(예를 들어, Uu 무선 액세스 연결을 통해)에 사용될 수 있거나, 일부 경우들에서, UE 간의 사이드링 크 통신에 사용될 수 있는 슬롯이다. 예를 들어, UE 는 본 문서의 다른 곳에서 설명된 바와 같이 사이드링 크 자원으로 구성되는 업링크 자원을 통해 (예를 들어 ProSe 사이드링크(PC5) 인터페이스를 사용하여) 사이드링 크에서 통신할 수 있다. 일부 양태들에서, UL 슬롯은 모든 심볼이 업링크 심볼(갭, 참조 시그널링, 측정 등 에 사용되는 심볼은 제외)이 되도록 구성될 수 있다. 일부 양태들에서, UL 슬롯은 임계 수의 업링크 심볼들 을 포함하는 슬롯일 수 있다. 예를 들어, 주어진 슬롯의 심볼들은 다운링크 심볼, 업링크 심볼 또는 다른 유형의 심볼로 구성될 수 있다. 임계 수의 심볼들이 업링크 심볼로서 구성되면, 주어진 슬롯은 UL 슬롯으로 간주될 수도 있다. 일부 양태들에서, DL 슬롯은 모든 심볼들이 다운링크 심볼들(갭, 기준 시그널링, 측정 등에 사용되는 심볼들은 제외)이 되도록 구성될 수 있다. 몇몇 양태들에서, DL 슬롯은 임계 수의 다운링크 심볼들을 포함하는 슬롯일 수도 있다. 예를 들어, 임계 수의 심볼들이 다운링크 심볼로서 구성되면, 주어진 슬롯은 DL 슬롯으로 간주될 수도 있다. SBFD 슬롯은 SBFD 통신을 위해 구성되는 슬롯이다. 전이중 (full-duplex: FD) 통신은 gNB나 UE가 시간 및 주파수 (시간/주파수) 자원들의 동일한 세트와 같은 동일한 자원 세트에서 송신 및 수신하는 것으로 허용함으로 써 증가된 대역폭 (이상적으로는, 반이중의 대역폭의 두 배) 을 제공하는 수단으로서 도입되었다. 그러나 동일한 자원 세트에서 송신 및 수신하는 데 따른 복잡성들(예를 들어, 다운링크와 업링크 전송 간의 자기 간섭, gNB-gNB 간섭, UE-UE 간섭)와 추가적인 구현 복잡성으로 인해, SBFD 가 FD 통신의 이점들의 일부를 실현하는 동 시에 FD 통신의 복잡성들의 일부를 회피하는 조치로서 고려된다. 예를 들어, SBFD 슬롯에서, 다운링크 자원 과 UL 자원 사이에 갭이 구성될 수 있으며, 이는 대기 시간 및 업링크 커버리지를 개선하면서 자기 간섭을 더 잘 제어할 수 있게 한다. 예의 전체 대역폭은 대역폭 부분 (BWP), 컴포넌트 캐리어 (CC) 등일 수 있다. SBFD는 UE 및/또는 기지국에서 구현될 수 있다. 예를 들어, 기지국은 SBFD를 사용 하여 다수의 UE와 FD 통신(예를 들어, 동일한 슬롯에서 하나의 UE와의 업링크 통신 및 다른 UE와의 다운링크 통 신)을 수행할 수 있다. UE 는 어떤 슬롯이 SBFD 슬롯인지 나타내는 정보를 수신할 수 있다. 예를 들어, SBFD 슬롯을 나타내는 정보 는 공통 무선 자원 제어 (RRC) 구성을 통해(예를 들어 시스템 정보 블록을 통해) 시그널링될 수 있다. 또 다른 예로, SBFD 슬롯을 표시하는 정보는 UE-특정 RRC 시그널링이나 다른 형태의 시그널링과 같은 UE-특정 시그 널링을 통해 시그널링될 수 있다. 또 다른 예로서, SBFD 슬롯을 나타내는 정보는 (다운링크 제어 정보 (DCI) 또는 매체 액세스 제어 (MAC) 시그널링을 사용하는 것과 같이) 동적으로 UE에 표시될 수 있다. 일부 양태들에서, UL 슬롯 및/또는 심볼과 DL 슬롯 및/또는 심볼은 예를 들어 RRC 시그널링을 통해 반정적으로 구성 될 수 있다. 도시된 바와 같이 그리고 아래에서 더 자세히 설명되는 바와 같이, 슬롯은 서브채널로 세분될 수 있으며, 이는 송신 UE에 의해 사이드링크 자원 예약을 표시하기 위해 사용될 수 있다. 이들 서브채널은 UL 슬롯과 SBFD 슬롯 사이에 공통 서브채널 인덱싱 구성을 사용할 수 있으며, 이는 사이드링크 자원 예약의 모호성을 감소시킨 다. 위에 나타낸 바와 같이, 도 5 은 일 예로서 제공된다. 다른 예들은 도 5 과 관련하여 설명되었던 것과는 상 이할 수도 있다. 도 6 은 본 개시에 따른 하나 이상의 자원 풀들의 예 를 예시한 도면이다. 예 은 DL 슬롯, UL 슬롯, 및 사이드링크 (때때로 SL로 약칭됨) 자원을 포함하는 SBFD 슬롯을 보여준다. 이들 슬롯 유형들은 도 5 과 관련하여 더 상세히 설명된다. 위에서 언급한 바와 같이, 사이드링크 통신은 자원 풀을 통해 발생할 수 있으며, 업링크 심볼로 반정적으로 구 성되는 심볼들에서 (예를 들어, 심볼들에서만) 허용될 수 있다. 자원 풀은 UE가 사이드링크 통신을 전송하 도록 허용되는 시간/주파수 자원의 세트이다. UE가 이러한 심볼을 통해 사이드링크 통신을 전송할 것으로 예상될 수 있기 때문에 자원 풀은 업링크 심볼로 반정적으로 구성되는 심볼들을 포함함을 알 수 있다. 예 에서의 하나 이상의 자원 풀들은 대각선 채우기로 표시된다. UE는 자원 풀들의 세트로 (예를 들어, RRC 시그널링과 같은 구성 시그널링을 통해, 원래 장비 제조업체 또는 서 비스 제공자에 의해서와 같은 사전 구성을 통해, 등등을 통해) 구성될 수 있으며, 여기서 각 자원 풀은 시간/주 파수 자원들로서 정의된다. 시간상 최소 송신/수신(예를 들어, 자원 할당) 단위는 서브채널이며, 각 서브채 널은 다수의 연속적인 자원 블록 (RB) 들로서 정의된다. 자원 풀은 도 3 및 도 4와 관련하여 설명된 두 가지 자원 할당 모드 중 하나로 추가로 구성될 수 있다. 예 를 들어, 자원 풀은 모드 1 자원 할당으로 구성될 수 있으며, 여기서 gNB와 같은 네트워크 엔티티는 사이드링크 전송을 위해 자원을 할당한다. 모드 1에서, DCI 포맷 3-x를 통한 동적 할당과 구성된 송신들 (업링크 승인 및 업링크 승인에 대한 활성화/비활성화 시그널링 양자 모두가 RRC 시그널링을 통해 제공되는 유형-1, 및 업링 크 승인 구성은 RRC 시그널링을 통해 제공되고 업링크 승인에 대한 활성화/비활성화 시그널링은 제어 채널 승인 을 통해 (예를 들어, DCI를 통해) 제공되는 유형-2) 양자 모두가 지원된다. 또 다른 예로, UE가 자원 풀의 자원을 감지하는 모드 2 자원 할당으로 자원 풀이 구성될 수 있다. 감지의 결과에 적어도 부분적으로 기초 하여 (예를 들어, 서로 다른 송신들의 우선순위 및 감지에 의해 결정된 참조 신호 수신 전력(RSRP)에 적어도 부 분적으로 기초하여), UE는 송신을 위한 자원을 자율적으로 선택할 수 있다. 일부 배치에서, 모드 1 동작은 일반적으로 gNB와 같은 네트워크 엔티티의 커버리지 내에 있는 UE에 대해 예상될 수 있는 반면, 모드 2 동작은 일반적으로 네트워크 엔티티의 커버리지 밖에 있는 UE에 대해 예상될 수 있다. UE 는 자원 풀에 대한 복수의 시간/주파수 자원을 나타내는 정보를 수신할 수 있고, 자원 풀에 포함될 사이드링 크 슬롯들의 세트를 식별할 수 있다. 예를 들어, 사이드링크 슬롯들의 세트는 자원로부터 식별(예를 들어, 선택)될 수 있다. 어떤 경우에는 사이드링크 자원 풀에 속할 수 있는 슬롯들의 세트는 에 의해 표시되고, 여기서 이고, 여기서 슬 롯 인덱스는 서빙 셀의 시스템 프레임 번호 (SFN) 0 또는 직접 프레임 번호(DFN) 0에 해당하는 무선 프레임의 슬롯#0 에 상대적이고, 여기서 μ 는 해당 BWP 또는 CC의 서브캐리어 간격이다. 사이드링크 슬롯들의 세트 는 다음을 제외한 모든 슬롯을 포함할 수 있다: 사이드링크 동기화 신호/물리적 사이드링크 브로드캐스트 채널(S-SS/PSBCH) 블록(S-SSB)이 구성되는 NS_SSB 슬롯; 각 슬롯에 Y번째, (Y+1)번째, …, (Y+X-1)번째 OFDM 심볼이 상위 계층 파라미터 tdd-UL-DL- ConfigurationCommon 또는 sl-TDD-Configuration 에 따라 업링크로 반정적으로 구성되지 않는 NnonSL 슬롯, 여기 서 Y 그리고 X 는 각각 상위 계층 파라미터 sl-StartSymbol 및 sl-LengthSymbols 에 의해 설정됨; 그리고 다음 단계들에 의해 결정되는 하나 이상의 예약된 슬롯: a. 모든 슬롯들의 세트로부터 NS_SSB 슬롯 및 NnonSL 슬롯을 제외한 나머지 슬롯은 슬롯 인덱스의 오름차순으로 배 열된 에 의해 표시되며; b. 슬롯 은 인 경우 예 약된 슬롯에 속한다. 여기서, 이고 이며, 여기서 Lbitmap 은 비트맵의 길이를 나 타내며 상위 계층에서 구성된다(예를 들어, 자원 풀에 대한 구성 정보를 사용하거나 자원 풀에 대한 구성 정보 와 별도로). 사이드링크 슬롯의 세트는 슬롯 인덱스의 오름차순으로 배열될 수 있다. 자원 풀에 대한 구성 정보(예를 들어, 자원 풀에 대한 복수의 자원을 식별하는 정보)는 전술한 바와 같이 복수 의 슬롯을 표시할 수 있으며, UE는 복수의 슬롯 중에서 슬롯의 세트를 선택할 수 있다. 구성 정보는 자원 풀과 연관된 비트맵 을 이용하여 복수의 슬롯을 나타낼 수 있으며, 여기서 Lbitmap (예 를 들어, 비트맵의 길이) 는 위에서 언급한 바와 같이 상위 계층에 의해 구성된다. 슬롯 는 bk’ = 1 인 경우 세트에 속하며, 여기서 k ’ = k mod Lbitmap 이다. 세트 내의 슬롯들은 나머지 슬롯들 의 아래 첨자 i 가 연속된 {0, 1, ..., T’max -1} 이 되도록 재인덱싱될 수 있으며, 여기서 T’max 는 세트에 남아 있는 슬롯들의 수이다. 예 은 Uu 동작(예를 들어, UE와 기지국 사이) 및 사이드링크 동작(예를 들어, UE들 사이)이 동일한 캐리 어와 같은 동일한 대역폭에서 수행되는 예이다. 이것은 예를 들어 사이드링크 네트워크가 허가 스펙트럼에 전개될 때 발생할 수 있다. 또한, 예는 적어도 gNB(및 잠재적으로 하나 이상의 UE)가 SBFD 동작을 지 원하는 예이다. 따라서, 예의 슬롯 중 적어도 일부(예를 들어, 가장 오른쪽 슬롯)는 SBFD 슬롯으로 (동적으로 또는 반정적으로) 구성된다. 따라서, SBFD 슬롯의 업링크 부분의 대역폭은 예 의 업링크 슬롯의 대역폭보다 작다. SBFD 슬롯의 업링크 부분의 대역폭이 작을수록 업링크 슬롯에 비해 SBFD 슬롯 내 자원 풀의 대역폭이 감소함을 알 수 있으며, 이는 UE 가 자원 풀에 대해 다운링크 또는 갭 자원을 사용할 수 없 기 때문이다. 본 명세서에 설명된 기술 및 장치는 UL 슬롯 및 SBFD 슬롯에 사용될 공통 서브채널 인덱싱을 제공하여, 예를 들어 \"서브채널 인덱스 X\"가 SBFD 슬롯의 X번째 서브채널을 참조하는지 또는 SBFD 슬롯에 있는 자원 풀의 X번째 서브채널을 참조하는지 여부에 관해 모호성이 발생하지 않도록 한다. 위에 나타낸 바와 같이, 도 6 은 일 예로서 제공된다. 다른 예들은 도 6 과 관련하여 설명되었던 것과는 상 이할 수도 있다. UE 에 의해 사이드링크 자원 선택 및/또는 스케줄링이 수행되는 전송 모드(예를 들어, 모드 2 자원 할당)에서는 주기적 자원 예약 및 비주기적 자원 예약이 지원될 수 있다. 위에서 언급한 바와 같이, UE는 UE에 의한 하 나 이상의 통신을 위한 자원을 예약하기 위해 사이드링크 자원 예약을 전송할 수 있다. 비주기적 자원 예약 은 (예를 들어, 정의된 주기성 없이) 단일 자원 또는 자원들의 그룹을 예약할 수 있다. 주기적 자원 예약은 주기성에 적어도 부분적으로 기초하여 일련의 자원들을 예약할 수 있다. 비주기적 자원 예약의 경우, UE 는 송신뿐만 아니라 최대 2개의 향후 송신들을 위한 시간 및 주파수(시간/주파수) 자원을 (예를 들어 SCI-1을 통해) 시그널링할 수 있다. 주기적 자원 예약은 예약과 관련된 우선순위 및/또는 주기성 외에 비주기적 자 원 예약에 포함된 정보(예를 들어, 하나 이상의 송신들을 위한 시간/주파수 자원)와 유사한 정보를 포함할 수 있다. 경우에 따라 자원 예약은 사이드링크 슬롯과 SBFD 슬롯을 포함하는 자원을 예약할 수도 있다. 예를 들어, 단일 예약 자원 할당은 사이드링크 슬롯과 SBFD 슬롯을 포함할 수 있다. 또 다른 예로, 자원 예약에 의해 예약된 제1 자원 할당은 사이드링크 슬롯을 포함할 수 있고, 자원 예약에 의해 예약된 제2 자원 할당은 SBFD 슬 롯을 포함할 수 있다(또는 그 반대). 또 다른 예로서, UE를 위해 구성된 사이드링크 자원 풀은 사이드링크 슬롯과 SBFD 슬롯을 모두 포함할 수 있다. 그러나, 전술한 바와 같이, 업링크 슬롯은 SBFD 슬롯과 연관된 대역폭과 상이한 대역폭과 연관될 수 있다. 따라서, 업링크 슬롯과 SBFD 슬롯은 서로 다른 수의 서브채널과 연관될 수 있다. 사이드링크 자원 예약은 하나 이상의 서브채널 인덱스를 참조하여 예약된 자원의 주파수 할당을 식별할 수 있으므로, 업링크 슬롯 및 SBFD 슬롯을 포함하는 주파수 대역 또는 사이드링크 자원 풀에 대 한 자원 예약이 어떻게 해석되는지에 관해 모호성이 발생할 수 있다. 이러한 모호성은 효과적으로 어드레싱 할 수 있는 대역폭을 감소시키고 UE의 사이드링크 통신을 방해하며 처리량을 감소시킬 수 있다. 본 명세서에 설명된 일부 기술 및 장치는 하나 이상의 업링크 슬롯 및 SBFD 슬롯과 같은 하나 이상의 더 작은 대역폭 슬롯에 걸쳐 사이드링크 자원 예약을 위한 시그널링을 제공한다. 예를 들어, 본 명세서에 설명된 일 부 기술 및 장치는 주어진 주파수 대역 또는 주어진 사이드링크 자원 풀에서 업링크 슬롯 및 더 작은 대역폭 슬 롯에 사용될 공통 서브채널 인덱싱 구성을 제공한다. 따라서, 단일 사이드링크 자원 예약은 업링크 슬롯과 SBFD 슬롯과 같은 대역폭이 더 작은 슬롯에 대한 주파수 자원 할당을 나타낼 수 있어, 사이드링크 자원 예약에 대한 모호성을 제거하고 효과적으로 어드레싱될 수 있는 대역폭을 향상시킬 수 있다. 또한, 공통 서브채널 인덱싱 구성은 자원 풀의 슬롯 유형별로 서로 다른 서브채널 인덱싱 구성을 구성하는 데 따른 오버헤드를 줄여 준다. 본 명세서에 설명된 일부 기술 및 장치는 예를 들어 자원 예약을 전송하는 송신 UE에 의해, 또는 자 원 예약을 수신하는 수신 UE에 의해, 하나 이상의 무효 주파수 자원(예를 들어, 예약에 이용 가능하지 않은 SBFD 슬롯의 서브채널과 같은 하나 이상의 주파수 자원)을 고려하여 사이드링크 자원 예약 또는 사이드링크 자 원 예약의 해석을 제공한다. 이러한 방식으로 효과적으로 어드레싱될 수 있는 대역폭이 증가하고, UE의 사 이드링크 통신이 촉진되며, 처리량이 향상된다. 도 7 은 본 개시에 따른, 사이드링크 자원 스케줄링과 연관된 시그널링의 예 를 도시하는 다이어그램이다. 도시된 바와 같이, 예 는 제 1 UE (예를 들어, UE , UE , UE ), 제 2 UE (예를 들어, UE , UE , UE ), 및 네트워크 엔티티 (예를 들어, BS ) 를 포함한다. 예 에서, \"업링크 슬롯\"은 업링크 슬롯으로서 반정적으로 구성된 슬롯, 또는 적어도 임계 수의 업링크심볼들로 반정적으로 구성된 슬롯을 지칭한다. 일반적으로 문맥에 따라 \"자원\"는 예 700에서 \"슬롯\"과 상호 교환가능하게 사용된다. 점선 화살표와 박스는 선택적 단계를 나타낸다. 도 7의 동작(및 본 명세서의 다른 설명)은 SBFD 자원의 상황에 대해 설명된다. 그러나 이러한 동작은 임의 의 종류의 더 작은 대역폭 자원에 적용될 수 있다. 더 작은 대역폭 자원은 베이스라인 자원(예를 들어, 컴 포넌트 캐리어나 대역폭 부분과 같은 대역폭 전체를 차지하는 자원), 더 작은 대역폭 자원을 포함하는 자원 풀 의 다른 자원 등과 같은 다른 자원보다 더 작은 대역폭과 연관되는 자원이다. 예를 들어, 더 작은 대역폭 자원의 한 예는 업링크 자원보다 더 작은 대역폭과 연관된 SBFD 자원이다. 도 7에 도시된 바와 같이, 참조번호 705에서, 네트워크 엔티티는 하나 이상의 SBFD 자원(즉, 하나 이상의 더 작 은 대역폭의 자원)을 나타내는 정보를 UE에게 제공할 수 있다. 예를 들어, 네트워크 엔티티는 하나 이상의 SBFD 슬롯을 나타내는 정보를 제공할 수 있다. 일부 양태들에서, 하나 이상의 SBFD 슬롯을 나타내는 정보는 RRC(Radio Resource Control) 시그널링, MAC(Medium Access Control) 시그널링, DCI(Downlink Control Information) 등을 통해 제공될 수 있다. 일부 양태들에서, 하나 이상의 SBFD 슬롯을 나타내는 정보는 반정 적으로 제공될 수 있다. 하나 이상의 SBFD 슬롯을 나타내는 정보는 하나 이상의 SBFD 슬롯을 식별할 수 있 으며, SBFD 슬롯의 하나 이상의 다운링크 부분, 하나 이상의 업링크 부분 및/또는 하나 이상의 갭 부분을 나타 낼 수 있다. 일부 양태들에서, 하나 이상의 SBFD 슬롯들을 표시하는 정보는 어느 슬롯이 업링크 슬롯인지, 어느 슬롯이 다운링크 슬롯인지 등을 추가로 표시할 수 있다. 일부 양태들에서, 하나 이상의 SBFD 슬롯은 반정적 시그널링을 통해 표시되는 SBFD 슬롯과 같은 하나 이상의 반정적 SBFD 슬롯일 수 있다. 참조번호 710과 같이, 네트워크 엔티티는 사이드링크 통신과 연관된 자원 풀(예를 들어, 사이드링크 자원 풀)에 대한 복수의 자원(예를 들어, 시간/주파수 자원)을 나타내는 정보를 UE에게 제공할 수 있다. 예를 들어, 네 트워크 엔티티는 자원 풀 구성을 UE에 제공할 수 있다. 자원 풀 구성은 도 6와 관련하여 위에서 설명한 정 보 중 적어도 일부를 포함할 수도 있다. 일부 양태들에 있어서, 참조 부호 710 에 의해 도시된 정보는 단일 자원 풀과 관련될 수도 있다. 일부 양태들에 있어서, 참조 부호 710 에 의해 도시된 정보는 다수의 자원 풀 들과 관련될 수도 있다. 도시된 바와 같이, 그 정보는 자원 풀에 대한 복수의 자원을 나타낼 수 있다. 예를 들어, 네트워크 엔티티는 복수의 자원을 식별할 수 있다. 일부 양태들에서, UE는 참조번호 705 및 참조번호 710으로 표시된 정보 중 적어도 일부로 미리 구성될 수 있다. 도면부호 715 에 의해 도시된 바와 같이, 제 1 UE 는 사이드링크 자원 예약을 송신할 수도 있다. 예를 들어, 제1 UE는 SCI-1과 같은 사이드링크 제어 정보를 통해 사이드링크 자원 예약을 전송할 수 있다. 사이 드링크 자원 예약은 제1 UE의 자원 풀 중 하나 이상의 자원을 나타낼 수 있다. 예를 들어, 사이드링크 자원 예약은 적어도 하나의 송신에 대해 시간 자원(예를 들어, 슬롯, 심볼 그룹, 슬롯 세트) 및 주파수 자원(예를 들 어, 하나 이상의 서브캐리어에 대응하는 하나 이상의 서브캐리어 인덱스)을 나타낼 수 있다. 일부 양태들에 서, 사이드링크 자원 예약은 주기적 자원 예약일 수 있으며, 이 경우 사이드링크 자원 예약은 예약된 자원에 대 한 주기성 및/또는 예약된 자원에 대한 우선순위를 식별할 수 있다. 다른 양태들에서, 사이드링크 자원 예 약은 비주기적 자원 예약일 수 있다. 일부 양태들에서, 사이드링크 자원 예약은 제1 슬롯 및 제2 슬롯의 자원들을 식별할 수 있으며, 여기서 제1 슬 롯은 업링크 슬롯으로 구성되고 제2 슬롯은 SBFD 슬롯으로 구성된다. 제1 슬롯은 제2 슬롯 앞이나 제2 슬롯 뒤에 있을 수 있다. 추가적으로 또는 대체적으로, 제1 UE의 자원 풀은 제1 슬롯 및 제2 슬롯의 자원을 포함 할 수 있다. 이러한 경우, 제1 슬롯의 대역폭은 제2 슬롯의 대역폭과 다를 수 있으므로, 제1 슬롯과 제2 슬 롯은 서로 다른 수의 서브채널들과 연관될 수 있다. 또한, 제2 슬롯의 일부 서브채널은 업링크 자원으로 반 정적으로 구성되지 않은 자원과 연관되어 있기 때문에 자원 풀 또는 사이드링크 자원 예약에 대해 무효인 것으 로 간주될 수 있다. 제1 UE, 제2 UE 및/또는 기지국은 제1 슬롯과 제2 슬롯에 대한 자원 예약에 대한 모호 성을 없애기 위해 제1 슬롯과 제2 슬롯에 대해 동일한 인덱싱 구성을 사용할 수 있다. 예를 들어, 서브채널 들의 총 수는 서로 다른 슬롯에서 사실상 동일하다고 가정될 수 있다. 따라서 서브채널의 인덱스도 동일하 게 유지된다. 위에서 언급한 바와 같이, 주기적인 자원 예약은 주기성과 연관될 수 있다. 주기성은 주기적 자원 예약에 의해 예약된 자원 간의 시간 길이를 나타낼 수 있다. 예를 들어, 주기성은 하나 이상의 전송에 대한 제1 자 원(또는 제1 자원 세트)을 나타낼 수 있고, 제1 자원이 반복되는 주기성을 나타낼 수 있다. 주기적 자원 예 약에 의해 예약된 자원은 본 명세서에서 주기적 예약으로 지칭될 수 있고, 주기적 예약의 다중 반복이 (예를 들 어, 주기적 자원 예약과 연관된 주기성으로) 표시될 수 있다. 일부 경우에, 주기적 예약은 자원 풀의 SBFD슬롯의 주기성과 상이한 주기성과 연관될 수 있으며, 이는 일부 주기적 예약이 적어도 하나의 무효 주파수 자원 을 포함하는 SBFD 슬롯에서 발생할 수 있고 다른 것들은 비SBFD 슬롯 (예를 들어, 업링크 슬롯) 에서 발생할 수 있음을 의미한다. 일부 양태들에서, 제1 UE는 주기적 예약의 반복이 임의의 SBFD 슬롯의 무효 주파수 자원 을 포함하지 않도록 주기적 자원 예약을 결정할 수 있다. 예를 들어, 현재 및 미래의 전송을 위해 자원을 예약할 때, 제1 UE는 어떠한 주기에서도, 표시된 PSCCH/PSSCH 자원이 무효 주파수 자원 위에 없다는 것을 보장 할 수 있다. 무효 주파수 자원을 피하기 위한 제1 UE의 자원 선택은 무효 주파수 자원을 식별하고 무효 주 파수 자원에 적어도 부분적으로 기초하여 사이드링크 자원 예약을 해석하는 데 사용될 수 있는 제2 UE에서의 처 리 자원 사용을 감소시킬 수 있다. 일부 양태들에서, 제2 UE는 제1 UE가 SBFD 슬롯의 무효 주파수 자원에서 발생하는 주기적 예약의 반복을 전송하 지 않는다고 가정할 수 있다. 예를 들어, 주기적 자원 예약은 SBFD 슬롯의 무효 주파수 자원에서 발생하는 하나 이상의 자원을 나타낼 수 있다. 제2 UE는 제1 UE가 표시된 하나 이상의 자원을 통해 전송하지 않았다 고 가정할 수 있다. 무효 주파수 자원에 대한 제2 UE의 결정, 및 무효 주파수 자원에 적어도 부분적으로 기 초한 사이드링크 자원 예약의 해석은 제1 UE에 대한 자원 예약의 유연성을 단순화하고 향상시킬 수 있다. 일부 양태들에서, 제2 UE는 주기적 예약이 적어도 하나의 무효 주파수 자원과 완전히 또는 부분적으로 겹치는 경우 주기적 예약과 연관된 전송이 발생하지 않았다고 가정할 수 있다. 예를 들어, 제1 UE는 주기적 예약의 반복이 적어도 하나의 무효 주파수 자원과 전체 또는 부분적으로 중복되는 경우에는 그 반복을 전송하지 않을 수 있다. 또 다른 예로, 제2 UE는 표시된 PSCCH/PSSCH가 SBFD 슬롯의 무효 주파수 자원과 전체 또는 부분적 으로 중첩되는 경우 전송이 발생하지 않았다고 가정할 수 있으며, 이는 제2 UE에서의 디코딩을 단순화한다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "다른 양태들에서, 주기적 예약과 연관된 송신은 무효 주파수 자원과 중첩되지 않는 표시된 자원들을 통해 일어 날 수 있다. 예를 들어, 제1 UE는 SBFD 슬롯의 무효 주파수 자원을 사용하지 않고 통신을 송신할 수도 있다. 다른 예로서, 전송은 SBFD 슬롯의 무효 심볼이나 서브채널의 무효 자원 블록 또는 표시된 PSSCH의 무 효 서브채널과 중첩되지 않는 표시된 PSCCH/PSSCH 자원의 일부를 통해 이루어질 수 있으며, 이는 자원 활용도 및 사이드링크 통신의 효율성을 향상시킨다. 보다 구체적인 예로서, 표시된 PSSCH는 5개의 서브채널을 포함 할 수 있으며, 그 중 2개는 무효 주파수 자원들의 세트와 중첩된다. 이 경우, 제1 UE는 5개의 서브채널을 통해 전송을 시그널링하더라도, 무효 주파수 자원의 세트와 겹치지 않는 3개의 서브채널을 통해 전송한다. 제2 UE는 무효 주파수 자원의 세트와 중첩되지 않는 3개의 서브채널에 대해 디코딩을 수행할 수 있다. 사이 드링크 자원 예약은, SBFD 슬롯의 유효한 서브채널 상에서만 전송 및 디코딩되는 경우, 절단된 할당으로서 지칭 될 수 있다. 일부 양태들에서, 제1 UE 및/또는 제2 UE가 사이드링크 자원 예약의 자원 할당을 절단할 때, 제1 UE 및/또는 제 2 UE는 후속 주기적 예약들에서 사이드링크 자원 예약의 원래 (예를 들어, 전체, 절단되지 않은) 대역폭을 사용 할 수 있다. 예를 들어, 제1 슬롯 (예를 들어, SBFD 슬롯) 내의 표시된 PSSCH는 5개의 서브채널을 포함할 수 있으며, 그 중 2개는 무효 주파수 자원들의 세트와 중첩된다. 이 경우, 무효 주파수 자원의 세트와 겹치 지 않는 3개의 서브채널을 통해 제1 UE 는 송신하고 제2 UE 는 디코딩한다. 제1 슬롯 이후의 제2 슬롯(예를 들어, 업링크 슬롯)에서는 5개의 서브채널이 모두 사이드링크 통신에 유효하다. 제2 슬롯에서는 표시된 PSSCH의 5개 서브채널 모두에서 제1 UE가 전송하고 제2 UE가 디코딩한다. 일부 양태들에서, 제1 UE 및/또는 제2 UE가 사이드링크 자원 예약의 자원 할당을 절단할 때, 제1 UE 및/또는 제 2 UE는 후속 주기적 예약들에서 절단된 자원 할당 (예를 들어, 사이드링크 자원 예약의 감소된 대역폭) 을 계속 사용할 수 있다. 예를 들어, 제1 슬롯 (예를 들어, SBFD 슬롯) 내의 표시된 PSSCH는 5개의 서브채널을 포함 할 수 있으며, 그 중 2개는 무효 주파수 자원들의 세트와 중첩된다. 이 경우, 무효 주파수 자원의 세트와 겹치지 않는 3개의 서브채널을 통해 제1 UE 는 송신하고 제2 UE 는 디코딩한다. 제1 슬롯 이후의 제2 슬롯 (예를 들어, 업링크 슬롯)에서는 5개의 서브채널이 모두 사이드링크 통신에 유효하다. 제2 슬롯에서, 제1 슬롯 내의 무효 주파수 자원의 세트와 겹치지 않은 3개의 서브채널만을 통해 제1 UE 는 송신하고 제2 UE 는 디 코딩한다. 이는 다른 감지 UE들이 제1 슬롯에서 승인을 검출하고, 예약이 무효 주파수 자원의 세트와 중첩 되지 않는 3개의 서브채널에만 속한다고 결정할 수 있게 한다(이로써 다른 감지 UE들이 통신을 위한 무효 주파 수 자원의 세트를 사용하는 것을 가능하게 할 수 있다). 도면부호 720 에 의해 도시된 바와 같이, 제 2 UE 는 사이드링크 자원 예약을 수신할 수도 있다. 일부 양태 들에서, 제2 UE는 사이드링크 자원 예약과 연관된 SBFD 슬롯의 하나 이상의 무효 주파수 자원을 식별할 수 있다. 일부 양태들에서, 제2 UE는 SBFD 슬롯의 무효 주파수 자원과 겹치는 하나 이상의 주기적 예약에 적어 도 부분적으로 기초하여 사이드링크 자원 예약의 하나 이상의 주기적 예약을 절단할 수 있다. 예를 들어, 제2 UE는 전술한 바와 같이 SBFD 슬롯의 하나 이상의 유효한 서브채널 상에서만 제1 UE의 전송을 디코딩하기로 결정할 수 있다. 참조 번호 725에 도시된 바와 같이, 제1 UE는 사이드링크 자원 예약에 적어도 부분적으로 기초하여 하나 이상의 통신을 송신할 수 있고, 제2 UE는 디코딩할 수 있다. 예를 들어, 제1 UE는 사이드링크 자원 예약에 의해 예 약된 하나 이상의 자원(예를 들어, 주기적 자원 또는 비주기적 자원)을 통해 하나 이상의 통신을 전송할 수 있 다. 일부 양태들에서, 제1 UE 및 제2 UE는 예를 들어 SBFD 슬롯의 무효 주파수 자원과 겹치는 하나 이상의 예약에 적어도 부분적으로 기초하여 하나 이상의 자원을 절단할 수 있다. 하나 이상의 자원이 SBFD 슬롯에 서 절단되는 경우, 후속 통신은 위에 설명된 바와 같이 하나 이상의 자원의 원래 대역폭(절단 전)을 사용할 수 도 있고, 하나 이상의 자원의 절단된 대역폭을 사용할 수도 있다. 이를 통해, 하나 이상의 SBFD 슬롯을 포 함하는 자원 풀에 대한 사이드링크 자원 예약의 모호성이 줄어들고, 처리량이 향상되며, 사이드링크 자원 예약 의 다양성이 향상된다. 위에 나타낸 바와 같이, 도 7 은 일 예로서 제공된다. 다른 예들은 도 7 과 관련하여 설명되었던 것과는 상 이할 수도 있다. 도 8 은 본 개시에 따른, 사이드링크 자원 스케줄링과 연관된 서브채널 인덱싱의 예 를 도시하는 다이어 그램이다. 예 는 제1 슬롯과 제2 슬롯을 보여준다. 제1 슬롯은 업링크 슬롯이며, 이는 제1 슬롯 이 업링크 슬롯으로서 반정적으로 구성되거나 또는 적어도 임계 수의 업링크 심볼들로 반정적으로 구성됨을 의 미한다. 제2 슬롯은 SBFD 슬롯이며, 이는 제2 슬롯이 반정적으로 SBFD 슬롯으로서 구성됨을 의미한다. 유효한 서브채널은 흰색 채우기로 표시되고 무효 주파수 자원은 대각선 채우기로 표시된다. 위에서 언급한 바와 같이, 유효한 서브채널은 예컨대 업링크 자원으로서 반정적으로 구성되는 유효한 서브채널에 적어도 부분 적으로 기초하여 사이드링크 통신에 이용 가능한 서브채널이다. 위에서 언급한 바와 같이, 무효 주파수 자 원은 예를 들어 무효 주파수 자원이 업링크 또는 다운링크로 동적으로 구성되거나, 다운링크로 반정적으로 구성 되는 것에 기인하여 사이드링크 통신에 이용가능하지 않은 서브채널이다. 도시된 바와 같이, 제1 슬롯의 사이드링크 자원 풀은 서브채널 0, 1, 2, 및 3을 포함한다. 따라서, 제1 슬 롯은 사이드링크 자원 예약에 이용 가능한 제1 대역폭을 갖는다. 그러나 제2 슬롯에서는 2개의 서브채널만 이 유효한 서브채널이다. 따라서, 제2 슬롯은 사이드링크 자원 예약에 사용할 수 있는 제2 대역폭을 갖는다. 무효 주파수 자원은 (무효 주파수 자원이 제 2 슬롯에서 무효이므로) 제2 대역폭이 아닌 제 1 대역 폭 (무효 주파수 자원이 제 1 슬롯에서는 유효이므로) 내에 있다고 할 수 있다. 무효 주파수 자원은 사이드 링크 자원 예약의 전송에 무효인 것으로 처리될 수 있으며, 이는 제1 UE가 무효 주파수 자원 상에서 통신을 스 케줄링 및/또는 전송하지 않기로 결정하거나, 제2 UE가 무효 주파수 자원에 대한 통신을 디코딩하지 않기로 결 정할 수 있음을 의미한다. 본 명세서의 다른 곳에서 설명된 바와 같이, 본 명세서에서 설명된 기술 및 장치는 공통 서브채널 인덱싱이 제1 슬롯 및 제2 슬롯에 대해 사용될 수 있게 한다. 공통 서브채널 인덱싱 구성이란 업링크 슬롯에서 주어진 대 역폭을 차지하는 서브채널에 SBFD 슬롯과 동일한 서브채널 인덱스를 할당하는 것을 의미한다. 즉, 주어진 자원 풀의 주어진 서브채널은 슬롯 타입(예를 들어, 주어진 서브채널을 포함하는 슬롯이 SBFD 슬롯인지 업링크 슬롯인지 여부)에 상관없이 동일한 인덱스를 갖는다. 따라서, 제2 슬롯에 대한 서브채널 표시의 모호성이 제거된다. 예를 들어, 공통 서브채널 인덱싱을 사용하지 않는 경우, 제1 슬롯과 제2 슬롯의 서브채널 인덱 스 #0을 나타내는 사이드링크 자원 예약이 참조번호 810에 표시된 서브채널을 참조하는지 아니면 참조 번호 820 으로 표시된 서브채널을 참조하는지 여부가 불분명할 수도 있다. 위에 나타낸 바와 같이, 도 8 은 일 예로서 제공된다. 다른 예들은 도 8 과 관련하여 설명되었던 것과는 상 이할 수도 있다. 도 9 는 본 개시에 따른, 예를 들어, UE 에 의해 수행된 일 예시적인 프로세스 를 예시하는 다이어그램이 다. 예시적인 프로세스는 예를 들어 공통 서브채널 인덱싱 구성을 사용하여, UE (예를 들어, UE, UE, UE, 도 7 의 제1 UE)가 사이드링크 자원 스케줄링과 연관된 동작들을 수행하는 예이다. 도 9 에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 사이드링크 자원 예약을 송신하는 단계를 포함 할 수 있으며, 여기서 사이드링크 자원 예약은 사이드링크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯의 제1 자원 및 사이드링크 자원 예약에 이용 가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯과 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용한다 (블록 910). 예를 들어, UE 는 (예를 들어, 도 11 에 도시된 송신 컴포넌트 또는 스케줄링 컴포넌트 를 사용하여) 사이드링크 자원 예약을 송신할 수도 있으며, 여기서 사이드링크 자원 예약은 사 이드링크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯의 제1 자원 및 사이드링크 자원 예약에 이용 가능한 제2 대역폭을 갖는 슬롯더 작은 대역폭 슬롯의 제2 자원을 나타내고, 사이드링크 자원 예약은 상술된 바 와 같이 업링크 슬롯과 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용한다. 일부 양태들 에서, 사이드링크 자원 예약은 업링크 슬롯 또는 더 작은 대역폭 슬롯 중 하나의 자원을 나타낼 수 있고, 업링 크 슬롯 및 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용할 수 있다. 예를 들어, 자원 풀은 업링크 슬롯과 더 작은 대역폭의 슬롯을 포함할 수 있으며, 동일한 서브채널 인덱싱 구성을 사용할 수 있 다. 도 9 에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 사이드링크 자원 예약을 사용하여 통신 을 송신하는 단계를 포함할 수 있다 (블록 920). 예를 들어, UE 는 (예를 들어, 도 11 에 도시된 송신 컴포 넌트 를 사용하여) 위에서 설명된 바와 같이, 사이드링크 자원 예약을 사용하여 통신을 송신할 수도 있 다. 프로세스 는 아래에 설명되거나 및/또는 본 명세서의 다른 곳에 설명된 하나 이상의 다른 프로세스들과 관련하여 설명된 임의의 단일 양태 또는 양태들의 임의의 조합과 같은 추가 양태들을 포함할 수도 있다. 제1 양태에서, 제1 대역폭에는 포함되고 제2 대역폭에는 포함되지 않는 더 작은 대역폭 슬롯의 하나 이상의 무 효 주파수 자원은 사이드링크 자원 예약의 전송에 무효인 것으로 처리된다. 제2 양태에서, 단독으로 또는 제1 양태과 조합하여, 제2 자원은 더 작은 대역폭 슬롯의 무효 주파수 자원에 없 으며, 무효 주파수 자원은 더 작은 대역폭 슬롯의 SBFD 구성에 적어도 부분적으로 기반하여 제2 대역폭이 아니 라 제1 대역폭에 있다. 제3 양태에서, 단독으로 또는 제1 및 제2 양태 중 하나 이상과 결합하여, 사이드링크 자원 예약은 주기적 예약 이고, 주기적 예약의 어떤 반복도 임의의 더 작은 대역폭 슬롯의 무효 주파수 자원을 포함하지 않는다. 제 4 양태에서, 단독으로 또는 제 1 내지 제 3 양태들 중 하나 이상과 조합으로, 프로세스 는 더 작은 대 역폭 슬롯의 무효 주파수 자원을 사용하지 않고 통신을 송신하는 것을 포함한다. 제 5 양태에서, 단독으로 또는 제 1 내지 제 4 양태들 중 하나 이상과 조합하여, 무효 주파수 자원을 포함하는 반복은 송신되지 않는다. 제 6 양태에서, 단독으로 또는 제 1 내지 제 5 양태들 중 하나 이상과 조합으로, 무효 주파수 자원을 포함하는 반복은 무효 주파수 자원을 사용하지 않고 송신된다. 제7 양태에서, 단독으로 또는 제1 내지 제6 양태 중 하나 이상과 결합하여, 반복은 제1 반복이고, 제1 반복 후 에 발생하는 제2 반복은 사이드링크 자원 예약의 전체 대역폭을 사용한다. 제8 양태에서, 단독으로 또는 제1 내지 제7 양태 중 하나 이상과 결합하여, 반복은 제1 반복이고, 제1 반복 후 에 발생하는 제2 반복은 무효 주파수 자원을 생략하는 사이드링크 자원 예약의 감소된 대역폭을 사용한다. 도 9 는 프로세스 의 예시적인 블록들을 도시하지만, 일부 양태들에서, 프로세스 는 도 9 에 도시 된 것들보다 추가적인 블록들, 더 적은 블록들, 상이한 블록들 또는 상이하게 배열된 블록들을 포함할 수도 있 다. 부가적으로 또는 대안적으로, 프로세스 의 블록들 중 2 이상은 병렬로 수행될 수도 있다. 도 10 은 본 개시에 따른, 예를 들어, UE 에 의해 수행되는 예시적인 프로세스 를 예시하는 다이어그램 이다. 예시적인 프로세스는 예를 들어 공통 서브채널 인덱싱 구성을 사용하여, UE (예를 들어, UE, UE, UE, 도 7 의 제2 UE)가 사이드링크 자원 스케줄링과 연관된 동작들을 수행하는 예이다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 4, "content": "도 10 에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 사이드링크 자원 예약을 수신하는 단계를 포 함할 수 있으며, 여기서 사이드링크 자원 예약은 사이드링크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯의 제1 자원 및 사이드링크 자원 예약에 이용 가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯의 제2 자 원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯과 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구 성을 사용한다 (블록 1010). 예를 들어, UE 는 (예를 들어, 도 12 에 도시된 수신 컴포넌트 를 사용 하여) 사이드링크 자원 예약을 수신할 수도 있으며, 여기서 사이드링크 자원 예약은 사이드링크 자원 예약에 이 용 가능한 제1 대역폭을 갖는 업링크 슬롯의 제1 자원 및 사이드링크 자원 예약에 이용 가능한 제2 대역폭을 갖 는 슬롯더 작은 대역폭 슬롯의 제2 자원을 나타내고, 사이드링크 자원 예약은 상술된 바와 같이 업링크 슬롯과 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용한다. 도 10 에 더 도시된 바와 같이, 일부 양태들에서, 프로세스 는 사이드링크 자원 예약에 적어도 부분적으 로 기초하여 통신을 디코딩하는 것을 포함할 수도 있다 (블록 1020). 예를 들어, UE 는 (예를 들어, 도 12 에 도시된 수신 컴포넌트 또는 디코딩 컴포넌트 를 사용하여) 위에서 설명된 바와 같이, 사이드 링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩할 수도 있다. 프로세스 는 아래에 설명되거나 및/또는 본 명세서의 다른 곳에 설명된 하나 이상의 다른 프로세스들과 관련하여 설명된 임의의 단일 양태 또는 양태들의 임의의 조합과 같은 추가 양태들을 포함할 수도 있다. 제1 양태에서, 제1 대역폭에는 포함되고 제2 대역폭에는 포함되지 않는 더 작은 대역폭 슬롯의 하나 이상의 무 효 주파수 자원은 사이드링크 자원 예약에 대해 무효인 것으로 처리된다. 제2 양태에서, 단독으로 또는 제1 양태과 조합하여, 제2 자원은 더 작은 대역폭 슬롯의 무효 주파수 자원에 없 으며, 무효 주파수 자원은 더 작은 대역폭 슬롯의 SBFD 구성에 적어도 부분적으로 기반하여 제2 대역폭이 아니 라 제1 대역폭에 있다. 제3 양태에서, 단독으로 또는 제1 및 제2 양태 중 하나 이상과 결합하여, 사이드링크 자원 예약은 주기적 예약 이고, 주기적 예약의 어떤 반복도 임의의 더 작은 대역폭 슬롯의 무효 주파수 자원을 포함하지 않는다. 제 4 양태에서, 단독으로 또는 제 1 내지 제 3 양태들 중 하나 이상과 조합으로, 프로세스 는 더 작은 대역폭 슬롯의 무효 주파수 자원을 사용하지 않고 통신을 디코딩하는 것을 포함한다. 제 5 양태에서, 단독으로 또는 제 1 내지 제 4 양태들 중 하나 이상과 조합하여, 무효 주파수 자원을 포함하는 반복은 디코딩되지 않는다. 제 6 양태에서, 단독으로 또는 제 1 내지 제 5 양태들 중 하나 이상과 조합으로, 무효 주파수 자원을 포함하는 반복은 무효 주파수 자원을 사용하지 않고 디코딩된다. 제7 양태에서, 단독으로 또는 제1 내지 제6 양태 중 하나 이상과 결합하여, 반복은 제1 반복이고, 제1 반복 후 에 발생하는 제2 반복은 사이드링크 자원 예약의 전체 대역폭을 사용한다. 제8 양태에서, 단독으로 또는 제1 내지 제7 양태 중 하나 이상과 결합하여, 반복은 제1 반복이고, 제1 반복 후 에 발생하는 제2 반복은 무효 주파수 자원을 생략하는 사이드링크 자원 예약의 감소된 대역폭을 사용한다. 도 10 는 프로세스 의 예시적인 블록들을 도시하지만, 일부 양태들에서, 프로세스 는 도 10 에 도시된 것들보다 추가적인 블록들, 더 적은 블록들, 상이한 블록들 또는 상이하게 배열된 블록들을 포함할 수도 있다. 부가적으로 또는 대안적으로, 프로세스 의 블록들 중 2 이상은 병렬로 수행될 수도 있다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 5, "content": "도 11 은 무선 통신을 위한 일 예의 장치 의 블록 다이어그램이다. 장치 는 UE 일 수도 있고, UE 는 장치 를 포함할 수도 있다. 일부 양태들에 있어서, 장치 는, (예를 들어, 하나 이상의 버스들 및/또는 하나 이상의 다른 컴포넌트들을 통해) 서로 통신할 수도 있는 수신 컴포넌트 및 송신 컴포넌트 를 포함한다. 도시된 바와 같이, 장치 는 수신 컴포넌트 및 송신 컴포 넌트 를 사용하여 다른 장치 (예컨대, UE, 기지국, 또는 다른 무선 통신 디바이스) 와 통신할 수 도 있다. 추가로 도시된 바와 같이, 장치 는, 다른 예들 중에서, 스케줄링 컴포넌트 를 포함 할 수도 있다. 일부 양태들에서, 장치 는 도 3 내지 도 8 와 관련하여 본 명세서에 설명된 하나 이상의 동작들을 수행 하도록 구성될 수 있다. 부가적으로 또는 대안적으로, 장치 는 도 9 의 프로세스 와 같이 본 명세서에서 설명된 하나 이상의 프로세스들 또는 이들의 조합을 수행하도록 구성될 수도 있다. 일부 양태들에 있어서, 도 11 에 도시된 장치 및/또는 하나 이상의 컴포넌트들은 도 2 와 관련하여 위에서 설명된 UE 의 하나 이상의 컴포넌트들을 포함할 수도 있다. 추가적으로 또는 대안적으로, 도 11 에 도시된 하나 이 상의 컴포넌트들은 도 2 와 관련하여 위에 설명된 하나 이상의 컴포넌트들 내에서 구현될 수도 있다. 부가 적으로 또는 대안으로, 컴포넌트들의 세트의 하나 이상의 컴포넌트들은 메모리에 저장된 소프트웨어로서 적어도 부분적으로 구현될 수도 있다. 예를 들어, 컴포넌트 (또는 컴포넌트의 일부) 는 비일시적 컴퓨터 판독가능 매체에 저장되고 컴포넌트의 기능들 또는 동작들을 수행하기 위해 제어기 또는 프로세서에 의해 실행가능한 명 령들 또는 코드로서 구현될 수도 있다. 수신 컴포넌트는 장치로부터, 기준 신호들, 제어 정보, 데이터 통신, 또는 이들의 조합과 같은 통 신을 수신할 수도 있다. 수신 컴포넌트 는 수신된 통신들을 장치 의 하나 이상의 다른 컴포 넌트들에 제공할 수도 있다. 일부 양태들에 있어서, 수신 컴포넌트 는 (다른 예들 중에서도, 필터링, 증폭, 복조, 아날로그-디지털 변환, 디멀티플렉싱, 디인터리빙, 디맵핑, 등화, 간섭 소거, 또는 디코딩 과 같이) 수신된 통신물들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 의 하 나 이상의 다른 컴포넌트들에 제공할 수도 있다. 일부 양태들에서, 수신 컴포넌트 는 도 2 와 관련 하여 상기 설명된 UE 의 하나 이상의 안테나들, 복조기, MIMO 검출기, 수신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 송신 컴포넌트 는 참조 신호들, 제어 정보, 데이터 통신들, 또는 이들의 조합과 같은 통신들을 장치 로 송신할 수도 있다. 일부 양태들에 있어서, 장치 의 하나 이상의 다른 컴포넌트들은 통신 들을 생성할 수도 있고, 생성된 통신들을, 장치 로의 송신을 위해 송신 컴포넌트 에 제공할 수도 있다. 일부 양태들에서, 송신 컴포넌트 는 생성된 통신들에 대한 신호 프로세싱 (예컨대, 다른 예들 중에서, 필터링, 증폭, 변조, 디지털-아날로그 변환, 멀티플렉싱, 인터리빙, 매핑 ,또는 인코딩) 을 수행할 수 도 있고, 프로세싱된 신호들을 장치 에 송신할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 도 2 와 관련하여 상기에서 설명된 UE 의 하나 이상의 안테나들, 변조기, 송신 MIMO 프로세서, 송신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 송수신기에서 수신 컴포넌트 와 병치될 수도 있다. 송신 컴포넌트 는 사이드링크 자원 예약을 송신할 수 있으며, 여기서 사이드링크 자원 예약은 사이드링 크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯의 제1 자원 및 사이드링크 자원 예약에 이용 가능 한 제2 대역폭을 갖는 더 작은 대역폭 슬롯의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯과 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용한다. 송신 컴포넌트는 사이드링크 자 원 예약을 사용하여 통신을 전송할 수 있다. 스케줄링 컴포넌트는 예를 들어, 장치에 대해 구 성된 자원 풀에 적어도 부분적으로 기초하여, 자원의 슬롯 유형에 적어도 부분적으로 기초하여, 자원의 반정적 구성에 적어도 부분적으로 기초하여, 등등에 기초하여 사이드링크 자원 예약을 위한 자원을 선택할 수 있다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "일부 양태들에서, 송신 컴포넌트 는 더 작은 대역폭 슬롯의 무효 주파수 자원을 사용하지 않고 통신을 송신할 수도 있다. 도 11 에 도시된 컴포넌트들의 수 및 배열은 일례로서 제공된다. 실제로, 도 11 에 도시된 것들보다 추가적 인 컴포넌트들, 더 적은 컴포넌트들, 상이한 컴포넌트들, 또는 상이하게 배열된 컴포넌트들이 존재할 수도 있다. 또한, 도 11 에 도시된 2 개 이상의 컴포넌트들은 단일 컴포넌트 내에서 구현될 수도 있거나, 또는 도 11 에 도시된 단일 컴포넌트는 다중의 분산된 컴포넌트들로서 구현될 수도 있다. 추가적으로 또는 대안 적으로, 도 11 에 도시된 (하나 이상의) 컴포넌트들의 세트는 도 11 에 도시된 컴포넌트들의 다른 세트에 의해 수행되는 것으로서 설명된 하나 이상의 기능들을 수행할 수도 있다. 도 12 은 무선 통신을 위한 일 예의 장치 의 블록 다이어그램이다. 장치 는 UE 일 수도 있고, UE 는 장치 를 포함할 수도 있다. 일부 양태들에 있어서, 장치 는, (예를 들어, 하나 이상의 버스들 및/또는 하나 이상의 다른 컴포넌트들을 통해) 서로 통신할 수도 있는 수신 컴포넌트 및 송신 컴포넌트 를 포함한다. 도시된 바와 같이, 장치 는 수신 컴포넌트 및 송신 컴포 넌트 를 사용하여 다른 장치 (예컨대, UE, 기지국, 또는 다른 무선 통신 디바이스) 와 통신할 수 도 있다. 추가로 도시된 바와 같이, 장치 는, 다른 예들 중에서, 디코딩 컴포넌트 를 포함할 수도 있다. 일부 양태들에서, 장치 는 도 3 내지 도 8 와 관련하여 본 명세서에 설명된 하나 이상의 동작들을 수행 하도록 구성될 수 있다. 부가적으로 또는 대안적으로, 장치 는 도 10 의 프로세스 와 같이 본 명세서에서 설명된 하나 이상의 프로세스들 또는 이들의 조합을 수행하도록 구성될 수도 있다. 일부 양 태들에 있어서, 도 12 에 도시된 장치 및/또는 하나 이상의 컴포넌트들은 도 2 와 관련하여 위에서 설명 된 UE 의 하나 이상의 컴포넌트들을 포함할 수도 있다. 추가적으로 또는 대안적으로, 도 12 에 도시된 하나 이상의 컴포넌트들은 도 2 와 관련하여 위에 설명된 하나 이상의 컴포넌트들 내에서 구현될 수도 있다. 추 가적으로 또는 대안적으로, 컴포넌트들의 세트의 하나 이상의 컴포넌트들은 메모리에 저장된 소프트웨어로서 적 어도 부분적으로 구현될 수도 있다. 예를 들어, 컴포넌트 (또는 컴포넌트의 일부분) 는 비일시적 컴퓨터 판 독가능 매체에 저장되고 컴포넌트의 기능들 또는 동작들을 수행하기 위해 제어기 또는 프로세서에 의해 실행가 능한 명령들 또는 코드로서 구현될 수도 있다. 수신 컴포넌트는 장치로부터, 기준 신호들, 제어 정보, 데이터 통신, 또는 이들의 조합과 같은 통 신을 수신할 수도 있다. 수신 컴포넌트 는 수신된 통신들을 장치 의 하나 이상의 다른 컴포 넌트들에 제공할 수도 있다. 일부 양태들에 있어서, 수신 컴포넌트 는 (다른 예들 중에서도, 필터링, 증폭, 복조, 아날로그-디지털 변환, 디멀티플렉싱, 디인터리빙, 디맵핑, 등화, 간섭 소거, 또는 디코딩 과 같이) 수신된 통신물들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 의 하 나 이상의 다른 컴포넌트들에 제공할 수도 있다. 일부 양태들에 있어서, 수신 컴포넌트 는 도 2 와 관련하여 상기에서 설명된 UE 의 하나 이상의 안테나들, 복조기, MIMO 검출기, 수신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 송신 컴포넌트 는 레퍼런스 신호들, 제어 정보, 데이터 통신물들, 또는 이들의 조합과 같은 통신물들을 장치 로 송신할 수도 있다. 일부 양태들에 있어서, 장치 의 하나 이상의 다른 컴포넌트들은 통신들을 생성할 수도 있고, 생성된 통신들을, 장치 로의 송신을 위해 송신 컴포넌트 에 제공할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 (다른 예들 중에서도, 필터링, 증폭, 변조, 디 지털-아날로그 변환, 멀티플렉싱, 인터리빙, 맵핑, 또는 인코딩과 같이) 생성된 통신물들에 대한 신호 프로세싱 을 수행할 수도 있고, 프로세싱된 신호들을 장치 로 송신할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 도 2 와 관련하여 상기에서 설명된 UE 의 하나 이상의 안테나들, 변조기, 송신 MIMO 프로세 서, 송신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 일부 양태들에 있어 서, 송신 컴포넌트 는 송수신기에서 수신 컴포넌트 와 병치될 수도 있다. 수신 컴포넌트 는 사이드링크 자원 예약을 수신할 수 있으며, 여기서 사이드링크 자원 예약은 사이드링 크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯의 제1 자원 및 사이드링크 자원 예약에 이용 가능 한 제2 대역폭을 갖는 더 작은 대역폭 슬롯의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯과 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용한다. 수신 컴포넌트 는 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 수신할 수도 있다. 디코딩 컴포넌트 는 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩할 수도 있다. 일부 양태들에서, 디코딩 컴포넌트 는 더 작은 대역폭 슬롯의 무효 주파수 자원을 사용하지 않고 통신을 디코딩할 수도 있다. 도 12 에 도시된 컴포넌트들의 수 및 배열은 일례로서 제공된다. 실제로, 도 12 에 도시된 것들보다 추가적 인 컴포넌트들, 더 적은 컴포넌트들, 상이한 컴포넌트들, 또는 상이하게 배열된 컴포넌트들이 존재할 수도 있다. 또한, 도 12 에 도시된 2 개 이상의 컴포넌트들은 단일 컴포넌트 내에서 구현될 수도 있거나, 또는 도 12 에 도시된 단일 컴포넌트는 다중의 분산된 컴포넌트들로서 구현될 수도 있다. 추가적으로 또는 대안 적으로, 도 12 에 도시된 (하나 이상의) 컴포넌트들의 세트는 도 12 에 도시된 컴포넌트들의 다른 세트에 의해 수행되는 것으로서 설명된 하나 이상의 기능들을 수행할 수도 있다. 다음은 본 개시의 일부 양태들의 개관을 제공한다: 양태 1: 사용자 장비 (UE) 에 의해 수행되는 무선 통신의 방법으로서, 사이드링크 자원 예약을 송신하는 단계를 포함하며, 여기서 사이드링크 자원 예약은 사이드링크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯 의 제1 자원 및 사이드링크 자원 예약에 이용 가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯의 제2 자원을 나 타내고, 사이드링크 자원 예약은 업링크 슬롯과 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사 용함; 및 사이드링크 자원 예약을 사용하여 통신을 송신하는 단계를 포함한다. 양태 2: 양태 1 에서, 제1 대역폭에는 포함되고 제2 대역폭에는 포함되지 않는 더 작은 대역폭 슬롯의 하나 이 상의 무효 주파수 자원은 사이드링크 자원 예약의 전송에 무효인 것으로 처리된다. 양태 3: 양태 1 에서, 제2 자원은 더 작은 대역폭 슬롯의 무효 주파수 자원에 없으며, 무효 주파수 자원은 더 작은 대역폭 슬롯의 SBFD 구성에 적어도 부분적으로 기반하여 제2 대역폭이 아니라 제1 대역폭에 있다. 양태 4: 양태 1 에서, 사이드링크 자원 예약은 주기적 예약이고, 주기적 예약의 반복은 임의의 더 작은 대역폭 슬롯의 무효 주파수 자원을 포함하지 않는다. 양태 5: 양태 1 에서, 사이드링크 자원 예약은 주기적 예약이고, 주기적 예약의 반복은 더 작은 대역폭 슬롯의 무효 주파수 자원을 포함하고, 통신을 전송하는 단계는 더 작은 대역폭 슬롯의 무효 주파수 자원을 사용하지 않 고 통신을 전송하는 단계를 더 포함한다. 양태 6: 양태 5 에서, 무효 주파수 자원을 포함하는 반복은 전송되지 않는다. 양태 7: 양태 5 에서, 무효 주파수 자원을 포함하는 반복은 무효 주파수 자원을 사용하지 않고 전송된다. 양태 8: 양태 7 에서, 반복은 제1 반복이고, 제1 반복 후에 발생하는 제2 반복은 사이드링크 자원 예약의 전체 대역폭을 사용한다. 양태 9: 양태 7 에서, 반복은 제1 반복이고, 제1 반복 후에 발생하는 제2 반복은 무효 주파수 자원을 생략하는 사이드링크 자원 예약의 감소된 대역폭을 사용한다. 양태 10: 양태 1 에서, 더 작은 대역폭 슬롯은 서브대역 전이중(SBFD) 슬롯이다. 양태 11: 사용자 장비 (UE) 에 의해 수행되는 무선 통신의 방법으로서, 사이드링크 자원 예약을 수신하는 단계 를 포함하며, 여기서 사이드링크 자원 예약은 사이드링크 자원 예약에 이용 가능한 제1 대역폭을 갖는 업링크 슬롯의 제1 자원 및 사이드링크 자원 예약에 이용 가능한 제2 대역폭을 갖는 더 작은 대역폭 슬롯의 제2 자원을 나타내고, 사이드링크 자원 예약은 업링크 슬롯과 더 작은 대역폭 슬롯에 대해 동일한 서브채널 인덱싱 구성을 사용함; 및 사이드링크 자원 예약에 적어도 부분적으로 기초하여 통신을 디코딩하는 단계를 포함한다. 양태 12: 양태 11 에서, 제1 대역폭에는 포함되고 제2 대역폭에는 포함되지 않는 더 작은 대역폭 슬롯의 하나 이상의 무효 주파수 자원은 사이드링크 자원 예약에 대해 무효인 것으로 처리된다. 양태 13: 양태 11 에서, 제2 자원은 더 작은 대역폭 슬롯의 무효 주파수 자원에 없으며, 무효 주파수 자원은 더 작은 대역폭 슬롯의 SBFD 구성에 적어도 부분적으로 기반하여 제2 대역폭이 아니라 제1 대역폭에 있다. 양태 14: 양태 11 에서, 사이드링크 자원 예약은 주기적 예약이고, 주기적 예약의 반복은 임의의 더 작은 대역 폭 슬롯의 무효 주파수 자원을 포함하지 않는다. 양태 15: 양태 11 에서, 사이드링크 자원 예약은 주기적 예약이고, 주기적 예약의 반복은 더 작은 대역폭 슬롯 의 무효 주파수 자원을 포함하고, 통신을 디코딩하는 단계는 더 작은 대역폭 슬롯의 무효 주파수 자원을 사용하 지 않고 통신을 디코딩하는 단계를 더 포함한다. 양태 16: 양태 15 에서, 무효 주파수 자원을 포함하는 반복은 디코딩되지 않는다. 양태 17: 양태 15 에서, 무효 주파수 자원을 포함하는 반복은 무효 주파수 자원을 사용하지 않고 디코딩된다."}
{"patent_id": "10-2023-7034440", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "양태 18: 양태 17 에서, 반복은 제1 반복이고, 제1 반복 후에 발생하는 제2 반복은 사이드링크 자원 예약의 전 체 대역폭을 사용한다. 양태 19: 양태 17 에서, 반복은 제1 반복이고, 제1 반복 후에 발생하는 제2 반복은 무효 주파수 자원을 생략하 는 사이드링크 자원 예약의 감소된 대역폭을 사용한다. 양태 20: 양태 11 에서, 더 작은 대역폭 슬롯은 서브대역 전이중(SBFD) 슬롯이다. 양태 21: 디바이스에서의 무선 통신을 위한 장치로서, 그 장치는 프로세서; 프로세서와 커플링된 메모리; 및 메 모리에 저장되고 장치로 하여금 양태들 1-20 중 하나 이상의 양태들의 방법을 수행하게 하는 프로세서들에 의해 실행가능한 명령들을 포함한다. 양태 22: 무선 통신을 위한 디바이스로서, 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함하고, 하나 이상의 프로세서들은 양태 1 내지 20 중 하나 이상의 양태의 방법을 수행하도록 구성되는, 디바이스.양태 23: 무선 통신을 위한 장치로서, 그 장치는 양태들 1-20 중 하나 이상의 양태들의 방법을 수행하기 위한 적어도 하나의 수단을 포함한다. 양태 24: 무선 통신을 위한 코드를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 그 코드는 양태들 1-20 중 하 나 이상의 양태들의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함한다. 양태 25: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 그 명령들의 세트는 디바이스의 하나 이상의 프로세서들에 의해 실행될 때, 디바이스로 하여금 양태들 1-20 중 하나 이상의 양태들 의 방법을 수행하게 하는 하나 이상의 명령들을 포함한다. 전술한 개시는 예시 및 설명을 제공하지만, 개시된 정확한 형태로 양태들을 제한하거나 완전한 것으로 의도되지 않는다. 수정들 및 변형들이 상기 개시의 관점에서 행해질 수도 있거나 또는 양태들의 실시로부터 획득될 수도 있다. 본 명세서에서 사용된 바와 같이, 용어 \"컴포넌트\" 는 하드웨어 및/또는 하드웨어와 소프트웨어의 조합으로서 넓게 해석되도록 의도된다. “소프트웨어” 는, 다른 예들 중에서도, 소프트웨어, 펌웨어, 미들웨어, 마이 크로코드, 하드웨어 디스크립션 언어, 또는 기타 등등으로서 지칭되든 아니든, 명령들, 명령 세트들, 코드, 코 드 세그먼트들, 프로그램 코드, 프로그램들, 서브프로그램들, 소프트웨어 모듈들, 애플리케이션들, 소프트웨어 애플리케이션들, 소프트웨어 패키지들, 루틴들, 서브루틴들, 오브젝트들, 실행가능물들, 실행 스레드들, 절차들 및/또는 함수들 등을 의미하도록 폭넓게 해석될 것이다. 본 명세서에서 사용된 바와 같이, 프로세서는 하드 웨어, 및/또는 하드웨어와 소프트웨어의 조합에서 구현된다. 본 명세서에서 설명된 시스템들 및/또는 방법 들은 상이한 형태들의 하드웨어 및/또는 하드웨어와 소프트웨어의 조합에서 구현될 수도 있음이 명백할 것이다. 이들 시스템들 및/또는 방법들을 구현하는데 사용된 실제 특수 제어 하드웨어 또는 소프트웨어 코드는 양태 들을 제한하지 않는다. 따라서, 당업자는 소프트웨어 및 하드웨어가 본 명세서에서의 설명에 적어도 부분적 으로 기초하여 시스템들 및/또는 방법들을 구현하도록 설계될 수 있음을 이해할 것이므로, 시스템들 및/또는 방 법들의 동작 및 거동은 특정 소프트웨어 코드에 대한 참조없이 본 명세서에서 설명된다. 본 명세서에서 사용된 바와 같이, “임계치를 만족하는 것은, 맥락에 의존하여, 값이 임계치 초과인 것, 임계치 이상인 것, 임계치 미만인 것, 임계치 이하인 것, 임계치와 동일한 것, 임계치와 동일하지 않은 것 등을 지칭할 수도 있다. 특징들의 특정한 조합들이 청구항들에서 언급되고 그리고/또는 명세서에 개시되더라도, 이들 조합들은 다양한 양태들의 개시를 제한하도록 의도되지 않는다. 이들 특징들 중 다수는 청구항들에 구체적으로 기재되지 않 고/않거나 명세서에 개시되지 않은 방식들로 결합될 수도 있다. 다양한 양태들의 개시는 청구항 세트에서의 모든 다른 청구항과 조합하여 각각의 종속항을 포함한다. 본 명세서에서 사용된 바와 같이, 아이템들의 리 스트 \"중 적어도 하나\" 를 지칭하는 어구는 단일 멤버들을 포함하여 그 아이템들의 임의의 조합을 지칭한다. 일 예로서, \"a, b, 또는 c 중 적어도 하나\" 는 a, b, c, a+b, a+c, b+c, 및 a+b+c 뿐 아니라 동일한 엘리먼 트의 배수들과의 임의의 조합 (예컨대, a+a, a+a+a, a+a+b, a+a+c, a+b+b, a+c+c, b+b, b+b+b, b+b+c, c+c, 및 c+c+c 또는 a, b, 및 c 의 임의의 다른 순서화) 을 커버하도록 의도된다. 본 명세서에서 사용된 어떠한 엘리먼트, 작동, 또는 명령도, 명시적으로 그렇게 기술되지 않으면, 중요하거나 필수적인 것으로서 해석되지 않아야 한다. 또한, 본 명세서에서 사용된 바와 같이, 부정 관사들 (\"a\"및 \"an\") 은 하나 이상의 항목들을 포함하도록 의도되고, \"하나 이상” 과 상호교환가능하게 사용될 수도 있다. 또한, 본 명세서에서 사용되는 바와 같이, 정관사 \"the\" 는 정관사 \"the\" 와 관련하여 참조되는 하나 이상의 아이템을 포함하도록 의도되고, \"하나 이상\" 과 상호 교환가능하게 사용될 수도 있다. 더욱이, 본 명세서에 서 사용된 바와 같이, 용어들 \"세트\" 및 “그룹\"은 하나 이상의 아이템들을 포함하도록 의도되고, \"하나 이상\" 과 상호교환가능하게 사용될 수도 있다. 오직 하나의 아이템만이 의도되는 경우, 어구 \"오직 하나\" 또는 유 사한 언어가 사용된다. 또한, 본 명세서에서 사용된 바와 같이, 용어들 \"가지다(has, have)”, “갖는 (having)” 등은 이들이 수정하는 엘리먼트를 제한하지 않는 오픈-엔드형(open-ended) 용어들로 의도된다 (예를 들어, A 를 “갖는” 엘리먼트는 또한 B 를 가질 수도 있다). 또한, 구절 \"에 기초한” 은 달리 명시적으로 언급되지 않는 한 \"적어도 부분적으로 기초한” 을 의미하는 것으로 의도된다. 또한, 본 명세서에서 사용된 바와 같이, 용어 \"또는” 은 연속하여 사용될 때 포함적인 것으로 의도되고, 달리 명시적으로 서술되지 않으면 (예컨대, \"어느 하나\" 또는 \"오직 하나” 와 조합하여 사용되면) \"및/또는” 과 상호교환가능하게 사용될 수도 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2023-7034440", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 위에서 언급된 특징들이 자세히 이해될 수도 있도록, 위에서 간략하게 요약된 보다 특정한 설명은 양 태들을 참조로 이루질 수도 있으며, 그 양태들 중 일부가 첨부된 도면들에 예시된다. 하지만, 첨부된 도면 들은 본 개시의 오직 소정의 통상적인 양태들만을 예시할 뿐이고, 따라서, 본 설명은 다른 동일하게 효과적인 양태들을 허용할 수도 있으므로, 본 개시의 범위를 제한하는 것으로 고려되서는 안된다는 점에 유의해야 한다. 상이한 도면들에서의 동일한 참조 번호들은 동일하거나 또는 유사한 엘리먼트들을 식별할 수도 있다. 도 1 은 본 개시에 따른, 무선 네트워크의 예를 예시하는 다이어그램이다. 도 2 는 본 개시에 따른, 무선 네트워크에서 사용자 장비 (UE) 와 통신하는 기지국의 예를 예시하는 다이어그램 이다. 도 3 은 본 개시에 따른 사이드링크 통신의 예를 예시한 다이어그램이다. 도 4 는 본 개시에 따른, 사이드링크 통신들 및 액세스 링크 통신들의 일 예를 예시한 다이어그램이다. 도 5 는 본 개시에 따른 서브대역 전이중 (SBFD) 슬롯의 예를 예시한 도면이다. 도 6 은 본 개시에 따른 하나 이상의 자원 풀들의 예를 예시한 도면이다. 도 7 은 본 개시에 따른, 사이드링크 자원 스케줄링과 연관된 시그널링의 예를 도시하는 다이어그램이다. 도 8 은 본 개시에 따른, 사이드링크 자원 스케줄링과 연관된 서브채널 인덱싱의 예를 도시하는 다이어그램이다. 도 9 및 도 10 은 본 개시에 따라 사용자 장비에 의해 수행되는 예시적인 프로세스들을 예시하는 다이어그램들 이다. 도 11 및 도 12 는 본 개시에 따른, 무선 통신을 위한 예시의 장치들의 블록 다이어그램들이다."}
