{"patent_id": "10-2025-7003209", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0036829", "출원번호": "10-2025-7003209", "발명의 명칭": "시공간 정보를 이용한 지능형 이미지 분석을 위한 컴퓨터 구현 시스템 및 방법", "출원인": "코스모 아티피셜 인텔리전스 - 에이아이 리미티드", "발명자": "노 딘 냔"}}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "관심 특징에 대한 이미지를 처리하기 위한 컴퓨터 구현 시스템으로서,프로세서 실행 가능 명령어를 저장하는 하나 이상의 메모리 장치; 및영상 장치로 캡처된 이미지에서 하나 이상의 관심 특징을 검출하기 위한 동작을 수행하도록 상기 명령어를 실행하도록 구성된 하나 이상의 프로세서를 포함하며, 상기 동작은:캡처된 이미지로부터 시간순으로 정렬된 이미지의 순서화된 세트를 수신하는 단계;로컬 시공간 처리 모듈을 사용하여 상기 순서화된 이미지 세트의 하나 이상의 부분 집합을 개별적으로 분석하는단계로서, 상기 로컬 시공간 처리 모듈은 각 부분 집합의 각 이미지에서 하나 이상의 관심 특징과 관련된 특성의 존재를 결정하고 각 부분 집합의 각 이미지에서 결정된 특성에 기초하여 특징 벡터로 상기 부분 집합 이미지에 주석을 달도록 구성되는, 상기 분석 단계;글로벌 시공간 처리 모듈을 사용하여 상기 순서화된 이미지 세트의 특징 벡터 세트를 처리하는 단계로서, 상기글로벌 시공간 처리 모듈은 각 이미지 부분 집합과 관련된 결정된 특성을 정제하도록 구성되며, 상기 특징 벡터세트의 각 특징 벡터는 상기 하나 이상의 관심 특징의 각 결정된 특성에 대한 정보를 포함하는, 상기 처리단계;시계열 분석 모듈을 사용하여 각 이미지에 대한 수치 값을 계산하는 단계로서, 상기 수치 값은 하나 이상의 관심 특징의 존재를 나타내며 각 이미지 부분 집합과 관련된 정제된 특성 및 시공간 정보를 사용하여 계산되는,상기 계산 단계; 및상기 순서화된 이미지 세트의 각 부분 집합의 각 이미지와 관련된 수치 값을 사용하여 상기 하나 이상의 관심특징에 대한 보고서를 생성하는 단계를 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 하나 이상의 프로세서는 추가로 상기 부분 집합의 각 이미지에서 하나 이상의 관심 특징과 관련된 특성의 가능성을 결정하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서, 상기 부분 집합의 각 이미지에서 결정된 특성의 가능성은 0과 1 사이의 부동 소수점 값을 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항 또는 제3항에 있어서, 상기 하나 이상의 프로세서는 상기 부분 집합의 각 이미지에서 특성의 가능성을 결정하기 위해 다음 동작을 수행하도록 추가로 구성되는 컴퓨터 구현 시스템:상기 이미지 부분 집합의 각 이미지를 인코딩하는 단계; 및순환 신경망을 사용하여 결정된 특성의 시공간 정보를 집계하는 단계."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항 내지 제4항 중 어느 한 항에 있어서, 상기 하나 이상의 프로세서는 추가로:상기 이미지 부분 집합의 각 이미지를 인코딩하는 단계; 및시계열 합성곱 네트워크를 사용하여 결정된 특성의 시공간 정보를 집계하는 단계공개특허 10-2025-0036829-3-를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서, 상기 하나 이상의 프로세서는 추가로:비인과적 시간 합성곱 네트워크를 적용하여 상기 이미지 부분 집합의 각 이미지에서 특성의 가능성을 정제하는단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 특성의 가능성을 정제하기 위해 상기 하나 이상의 프로세서는 추가로:하나 이상의 신호 처리 기술을 적용하는 단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서, 특성의 존재를 결정하기 위해 로컬 시공간 처리 모듈을 사용하여 상기 순서화된 이미지 세트를 분석하기 위해 상기 하나 이상의 프로세서는 추가로:품질 점수 벡터를 결정하는 단계로서, 상기 품질 점수 벡터의 각 품질 점수는 상기 이미지 부분 집합의 각 이미지에 대응하는, 상기 결정 단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 각 품질 점수는 0부터 R까지의 서수이며, 여기서 점수 0은 최소 품질을 나타내고 점수 R은 최대 품질을 나타내는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항 또는 제9항에 있어서, 글로벌 시공간 처리 모듈을 사용하여 상기 순서화된 이미지 세트를 처리하기 위해상기 하나 이상의 프로세서는 추가로:신호 처리 기술을 사용하여 상기 순서화된 이미지 세트의 하나 이상의 부분 집합의 이미지 부분 집합의 각 이미지의 품질 점수를 정제하는 단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서, 특성의 존재를 결정하기 위해 로컬 시공간 처리 모듈을 사용하여상기 순서화된 이미지 세트의 하나 이상의 부분 집합을 분석하기 위해 상기 하나 이상의 프로세서는 추가로:심층 합성곱 신경망을 사용하여 상기 이미지 부분 집합의 각 이미지에 대한 픽셀 단위 이진 마스크를 생성하는단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 글로벌 시공간 처리 모듈을 사용하여 상기 순서화된 이미지 세트의 하나 이상의 부분 집합을처리하기 위해 상기 하나 이상의 프로세서는 추가로:결정된 특성의 형태 및 분포에 대한 사전 정보를 이용하는 형태학적 연산을 사용하여 이미지 분할을 위한 이진마스크를 정제하는 단계를 수행하도록 구성되는 컴퓨터 구현 시스템.공개특허 10-2025-0036829-4-청구항 13 제1항 내지 제12항 중 어느 한 항에 있어서, 각 이미지와 관련된 수치 값은 상기 이미지 내에서 하나 이상의 관심 특징을 식별할 확률을 결정하기 위해 해석 가능한 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항 내지 제13항 중 어느 한 항에 있어서, 상기 하나 이상의 프로세서는 추가로:하나 이상의 관심 특징이 검출되지 않은 이미지에 대해 제1 수치 값을 출력하는 단계; 및하나 이상의 관심 특징이 검출된 이미지에 대해 제2 수치 값을 출력하는 단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제14항 중 어느 한 항에 있어서, 상기 이미지 부분 집합의 크기는 상기 시스템의 사용자에 의해 구성 가능한 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항 내지 제15항 중 어느 한 항에 있서, 상기 이미지 부분 집합의 크기는 요청된 관심 특징에 기초하여 동적으로 결정되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항 내지 제16항 중 어느 한 항에 있어서, 상기 이미지 부분 집합의 크기는 결정된 특성에 기초하여 동적으로결정되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항 내지 제17항 중 어느 한 항에 있어서, 상기 하나 이상의 이미지 부분 집합은 공유된 이미지를 포함하는컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항 내지 제18항 중 어느 한 항에 있어서, 상기 순서화된 이미지 세트는 의료 절차 중 영상 장치로부터 직접수신되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제1항 내지 제19항 중 어느 한 항에 있어서, 하나 이상의 관심 특징의 존재는 캡처된 이미지의 일부로부터 결정되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제1항 내지 제20항 중 어느 한 항에 있어서, 하나 이상의 관심 특징에 대해 생성된 보고서는 의료 절차 중 또는직후에 캡처된 이미지로부터 생성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제1항 내지 제21항 중 어느 한 항에 있어서, 하나 이상의 관심 특징에 대해 생성된 보고서는 다른 보고 시스템과 통합하기 위해 미리 정의된 형식으로 제공되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제1항 내지 제22항 중 어느 한 항에 있어서, 하나 이상의 관심 특징에 대해 생성된 보고서는 의료 지침에 기초한 권장 조치, 의료 지침에 기초한 일련의 권장 조치 중 하나의 권장 조치, 또는 절차 중 수행된 다른 조치 중적어도 하나를 포함하는 컴퓨터 구현 시스템.공개특허 10-2025-0036829-5-청구항 24 영상 장치로 캡처된 이미지에서 하나 이상의 관심 특징을 검출하기 위한 동작을 수행하도록 하나 이상의 프로세서에 의해 실행될 때 상기 하나 이상의 프로세서로 하여금 상기 동작을 수행하게 하는 명령어를 포함하는 비휘발성 컴퓨터 판독 매체로서, 상기 동작은:캡처된 이미지로부터 시간순으로 정렬된 이미지의 순서화된 세트를 수신하는 단계;로컬 시공간 처리 모듈을 사용하여 상기 순서화된 이미지 세트의 하나 이상의 부분 집합을 분석하는 단계로서,상기 로컬 시공간 처리 모듈은 각 부분 집합의 각 이미지에서 상기 하나 이상의 관심 특징과 관련된 특성의 존재를 결정하고 각 부분 집합의 각 이미지에서 결정된 특성에 기초하여 상기 부분 집합 이미지에 주석을 달도록구성되는, 상기 분석 단계;글로벌 시공간 처리 모듈을 사용하여 상기 순서화된 이미지 세트의 특징 벡터 세트를 처리하는 단계로서, 상기글로벌 시공간 처리 모듈은 각 이미지 부분 집합과 관련된 결정된 특성을 정제하도록 구성되며, 상기 특징 벡터세트의 각 특징 벡터는 상기 하나 이상의 관심 특징의 각 특성에 대한 정보를 포함하는, 상기 처리 단계;시계열 분석 모듈을 사용하여 각 이미지에 대한 수치 값을 계산하는 단계로서, 상기 수치 값은 하나 이상의 관심 특징의 존재를 나타내며 각 이미지 부분 집합과 관련된 정제된 특성 및 시공간 정보를 사용하여 계산되는,상기 계산 단계; 및상기 순서화된 이미지 세트의 각 부분 집합의 각 이미지와 관련된 수치 값을 사용하여 상기 하나 이상의 관심특징에 대한 보고서를 생성하는 단계를 포함하는 비휘발성 컴퓨터 판독 매체."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "영상 장치로 캡처된 이미지에서 하나 이상의 관심 특징을 검출하기 위한 컴퓨터 구현 방법으로서, 상기 방법은하나 이상의 프로세서에 의해 수행되는 다음 동작을 포함하는 컴퓨터 구현 방법:캡처된 이미지로부터 시간순으로 정렬된 이미지의 순서화된 세트를 수신하는 단계;로컬 시공간 처리 모듈을 사용하여 상기 순서화된 이미지 세트의 하나 이상의 부분 집합을 분석하는 단계로서,상기 로컬 시공간 처리 모듈은 각 부분 집합의 각 이미지에서 상기 하나 이상의 관심 특징과 관련된 특성의 존재를 결정하고 각 부분 집합의 각 이미지에서 결정된 특성에 기초하여 상기 부분 집합 이미지에 주석을 달도록구성되는, 상기 분석 단계;글로벌 시공간 처리 모듈을 사용하여 상기 순서화된 이미지 세트의 특징 벡터 세트를 처리하는 단계로서, 상기글로벌 시공간 처리 모듈은 각 이미지 부분 집합과 관련된 결정된 특성을 정제하도록 구성되며, 상기 특징 벡터세트의 각 특징 벡터는 상기 하나 이상의 관심 특징의 각 특성에 대한 정보를 포함하는, 상기 처리 단계;시계열 분석 모듈을 사용하여 각 이미지에 대한 수치 값을 계산하는 단계로서, 상기 수치 값은 하나 이상의 관심 특징의 존재를 나타내며 각 이미지 부분 집합과 관련된 정제된 특성 및 시공간 정보를 사용하여 계산되는,상기 계산 단계; 및상기 순서화된 이미지 세트의 각 부분 집합의 각 이미지와 관련된 수치 값을 사용하여 상기 하나 이상의 관심특징에 대한 보고서를 생성하는 단계."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "컴퓨터 구현 시스템으로서,프로세서 실행 가능 명령어를 저장하는 하나 이상의 메모리 장치; 및영상 장치로 캡처된 이미지의 시공간 분석을 위한 동작을 수행하도록 명령어를 실행하도록 구성된 하나 이상의프로세서를 포함하며, 상기 동작은:캡처된 이미지로부터 시간순으로 정렬된 이미지 세트에 접근하는 단계;이벤트 감지기를 사용하여 상기 시간순으로 정렬된 이미지 세트에서 이벤트 발생을 검출하는 단계로서, 상기 이공개특허 10-2025-0036829-6-벤트의 시작 시간 및 종료 시간은 상기 시간순으로 정렬된 이미지 세트에서 시작 이미지 프레임 및 종료 이미지프레임에 의해 식별되는, 상기 검출 단계;프레임 선택기를 사용하여 상기 시작 이미지 프레임 및 상기 종료 이미지 프레임으로 경계가 정해진 상기 시간순으로 정렬된 이미지 세트의 이미지 그룹으로부터 관련 점수 및 상기 이미지의 품질 점수에 기초하여 이미지를선택하는 단계로서, 상기 선택된 이미지의 관련 점수는 하나 이상의 관심 특징의 존재를 나타내는, 상기 선택단계;객체 기술자를 사용하여 하나 이상의 관심 특징의 일치하는 존재에 기초하여 선택된 이미지로부터 이미지의 부분 집합을 병합하는 단계로서, 상기 이미지의 부분 집합은 시공간 정보를 사용하여 공간적 및 시간적 일관성에기초하여 식별되는, 상기 병합 단계; 및시간 분할기를 사용하여 선택된 작업의 시간적 일관성을 만족하는 시간 간격으로 상기 시간순으로 정렬된 이미지 세트를 분할하는 단계를 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서, 상기 하나 이상의 프로세서는 추가로:로컬 시공간 처리 모듈을 사용하여 비디오 콘텐츠의 이미지 부분 집합에 대해 하나 이상의 관심 특징과 관련된특성의 시공간 정보를 결정하는 단계; 및글로벌 시공간 처리 모듈을 사용하여 상기 비디오 콘텐츠의 모든 이미지에 대한 시공간 정보를 결정하는 단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제26항 또는 제27항에 있어서, 시간 간격으로 상기 시간순으로 정렬된 이미지 세트를 분할하기 위해 상기 하나이상의 프로세서는 추가로:하나 이상의 관심 특징의 존재가 있는 시간순으로 정렬된 이미지 세트의 부분 집합을 식별하는 단계; 또는이벤트의 존재가 있는 시간순으로 정렬된 이미지 세트의 부분 집합을 식별하는 단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제28항에 있어서, 하나 이상의 관심 특징의 존재가 있는 시간순으로 정렬된 이미지 세트의 부분 집합을 식별하기 위해 상기 하나 이상의 프로세서는 추가로:상기 시간순으로 정렬된 이미지 세트의 이미지에 북마크를 추가하는 단계로서, 상기 북마크가 추가된 이미지는상기 시간순으로 정렬된 이미지 세트의 부분 집합의 일부인, 상기 추가 단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제28항 또는 제29항에 있어서, 하나 이상의 관심 특징의 존재가 있는 시간순으로 정렬된 이미지 세트의 부분 집합을 식별하기 위해 상기 하나 이상의 프로세서는 추가로:상기 시간순으로 정렬된 이미지 세트의 부분 집합으로부터 이미지 세트를 추출하는 단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제30항에 있어서, 상기 추출된 이미지 세트는 하나 이상의 관심 특징과 관련된 특성을 포함하는 컴퓨터 구현 시스템.공개특허 10-2025-0036829-7-청구항 32 제28항 내지 제31항 중 어느 한 항에 있어서, 하나 이상의 관심 특징의 존재가 있는 시간순으로 정렬된 이미지세트의 부분 집합을 식별하기 위해 상기 하나 이상의 프로세서는 추가로:상기 시간순으로 정렬된 이미지 세트의 부분 집합과 일치하는 캡처된 이미지의 타임라인의 일부에 색상을 추가하는 단계를 수행하도록 구성되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제32항에 있어서, 상기 색상은 하나 이상의 관심 특징에 대한 시간순으로 정렬된 이미지 세트의 부분 집합의 이미지의 관련성 수준에 따라 변하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제32항 또는 제33항에 있어서, 상기 색상은 하나 이상의 관심 특징과 관련된 특성에 대한 시간순으로 정렬된 이미지 세트의 부분 집합의 이미지의 관련성 수준에 따라 변하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제32항 내지 제34항 중 어느 한 항에 있어서, 상기 색상은 하나 이상의 관심 특징과 관련된 다른 관심 특징에따라 다른 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제32항 내지 제35항 중 어느 한 항에 있어서, 상기 색상은 이벤트 감지기를 사용하여 검출된 다른 이벤트에 따라 다른 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제32항 내지 제36항 중 어느 한 항에 있어서, 상기 타임라인은 비디오 요약의 일부로 제시되며, 상기 비디오 요약은 겹쳐진 텍스트 및 그래픽을 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제37항에 있어서, 상기 비디오 요약은 캡처된 이미지로부터 관련 프레임을 선택하여 생성되며 가변 프레임 속도비디오 출력을 갖는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제26항 내지 제38항 중 어느 한 항에 있어서, 상기 이벤트 발생은 의료 절차의 일부를 나타내는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "제26항 내지 제38항 중 어느 한 항에 있어서, 상기 동작은 추가로:시간순으로 정렬된 이미지 세트의 요약이 포함된 대시보드를 생성하는 단계로서, 상기 요약은 프레임 선택기 모듈을 사용하여 선택된 이미지를 포함하며 디스플레이 마킹으로 보강되는, 상기 생성 단계를 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "제40항에 있어서, 상기 생성된 대시보드는 영상 장치를 사용하여 이미지가 캡처되는 동안 수행된 의료 절차의품질 점수를 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "제40항 또는 제41항에 있어서, 상기 생성된 대시보드는 의료 절차를 수행하는 영상 장치의 운영자의 품질 점수공개특허 10-2025-0036829-8-를 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "제40항 내지 제42항 중 어느 한 항에 있어서, 상기 생성된 대시보드는 이벤트 감지기, 프레임 선택기, 객체 기술자 및 시간 분할기 중 하나 이상으로부터의 집계된 정보를 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "영상 장치로 캡처된 이미지의 시공간 분석을 위한 컴퓨터 구현 방법으로서, 상기 방법은 하나 이상의 프로세서에 의해 수행되는 다음 동작을 포함하는 컴퓨터 구현 방법:캡처된 이미지로부터 시간순으로 정렬된 이미지 세트에 접근하는 단계;이벤트 감지기를 사용하여 상기 시간순으로 정렬된 이미지 세트에서 이벤트 발생을 검출하는 단계로서, 상기 이벤트의 시작 시간 및 종료 시간은 상기 시간순으로 정렬된 이미지 세트에서 시작 이미지 프레임 및 종료 이미지프레임에 의해 식별되는, 상기 검출 단계;프레임 선택기를 사용하여 상기 시작 이미지 프레임 및 상기 종료 이미지 프레임으로 경계가 정해진 상기 시간순으로 정렬된 이미지 세트의 이미지 그룹으로부터 관련 점수 및 상기 이미지의 품질 점수에 기초하여 이미지를선택하는 단계로서, 상기 선택된 이미지의 관련 점수는 하나 이상의 관심 특징의 존재를 나타내는, 상기 선택단계;객체 기술자를 사용하여 하나 이상의 관심 특징의 일치하는 존재에 기초하여 선택된 이미지로부터 이미지의 부분 집합을 병합하는 단계로서, 상기 이미지의 부분 집합은 로컬 시공간 처리 모듈에 의해 생성된 시공간 정보를사용하여 공간적 및 시간적 일관성에 기초하여 식별되는, 상기 병합 단계; 및시간 분할기를 사용하여 선택된 작업의 시간적 일관성을 만족하는 시간 간격으로 상기 시간순으로 정렬된 이미지 세트를 분할하는 단계."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "하나 이상의 프로세서에 의해 실행될 때 상기 하나 이상의 프로세서로 하여금 영상 장치로 캡처된 이미지의 시공간 분석을 위한 동작을 수행하게 하는 명령어를 포함하는 비휘발성 컴퓨터 판독 매체로서, 상기 동작은:캡처된 이미지로부터 시간순으로 정렬된 이미지 세트에 접근하는 단계;이벤트 감지기를 사용하여 상기 시간순으로 정렬된 이미지 세트에서 이벤트 발생을 검출하는 단계로서, 상기 이벤트의 시작 시간 및 종료 시간은 상기 시간순으로 정렬된 이미지 세트에서 시작 이미지 프레임 및 종료 이미지프레임에 의해 식별되는, 상기 검출 단계;프레임 선택기를 사용하여 상기 시작 이미지 프레임 및 상기 종료 이미지 프레임으로 경계가 정해진 상기 시간순으로 정렬된 이미지 세트의 이미지 그룹으로부터 관련 점수 및 상기 이미지의 품질 점수에 기초하여 이미지를선택하는 단계로서, 상기 선택된 이미지의 관련 점수는 하나 이상의 관심 특징의 존재를 나타내는, 상기 선택단계;객체 기술자를 사용하여 하나 이상의 관심 특징의 일치하는 존재에 기초하여 선택된 이미지로부터 이미지의 부분 집합을 병합하는 단계로서, 상기 이미지의 부분 집합은 로컬 시공간 처리 모듈에 의해 생성된 시공간 정보를사용하여 공간적 및 시간적 일관성에 기초하여 식별되는, 상기 병합 단계; 및시간 분할기를 사용하여 선택된 작업의 시간적 일관성을 만족하는 시간 간격으로 상기 시간순으로 정렬된 이미지 세트를 분할하는 단계를 포함하는 비휘발성 컴퓨터 판독 매체."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "이미지를 처리하기 위한 컴퓨터 구현 시스템으로서,프로세서 실행 가능 명령어를 저장하는 하나 이상의 메모리 장치; 및이미지 세트에 대해 복수의 작업을 수행하기 위한 동작을 수행하도록 명령어를 실행하도록 구성된 하나 이상의공개특허 10-2025-0036829-9-프로세서를 포함하며, 상기 동작은:복수의 작업을 수신하는 단계로서, 상기 복수의 작업 중 적어도 하나의 작업은 상기 이미지 세트에서 하나 이상의 관심 특징을 식별하기 위한 요청과 관련되는, 상기 수신 단계;로컬 시공간 처리 모듈을 사용하여, 상기 이미지 세트의 이미지 부분 집합을 분석하여 상기 하나 이상의 관심특징과 관련된 특성의 존재를 식별하는 단계; 및상기 복수의 작업의 각 작업에 대해 시계열 분석 모듈의 실행을 반복하여 각 작업에 대한 수치 점수를 상기 이미지 부분 집합의 각 이미지와 연관시키는 단계를 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "제46항에 있어서, 상기 로컬 시공간 처리 모듈은 상기 이미지 세트의 분석된 이미지의 부분 집합을 출력하며,각 부분 집합은 상기 복수의 작업의 작업과 관련되는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "제46항 또는 제47항에 있어서, 상기 로컬 시공간 처리 모듈은 품질 점수 벡터를 결정함으로써 특성의 존재를 결정하며, 상기 품질 점수 벡터의 각 품질 점수는 상기 이미지 부분 집합의 각 이미지에 대응하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_49", "content": "제46항 내지 제48항 중 어느 한 항에 있어서, 상기 로컬 시공간 처리 모듈은 상기 복수의 작업과 관련된 관심특징에 대한 특징 벡터 세트를 생성하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_50", "content": "제46항 내지 제49항 중 어느 한 항에 있어서, 상기 동작은 추가로:글로벌 시공간 처리 모듈을 사용하여, 로컬 시공간 처리 모듈에 의해 분석된 이미지 부분 집합에 대한 특징 벡터 세트를 분석하는 단계를 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_51", "content": "제46항 내지 제50항 중 어느 한 항에 있어서, 상기 동작은 추가로:시계열 분석 모듈을 사용하여 상기 복수의 작업의 각 작업에 대한 로컬 시공간 처리 모듈의 출력을 집계하는 단계를 포함하는 컴퓨터 구현 시스템."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_52", "content": "하나 이상의 프로세서에 의해 실행될 때 상기 하나 이상의 프로세서로 하여금 이미지 세트에 대해 복수의 작업을 수행하기 위한 동작을 수행하게 하는 명령어를 포함하는 비휘발성 컴퓨터 판독 매체로서, 상기 동작은:복수의 작업을 수신하는 단계로서, 상기 복수의 작업 중 적어도 하나의 작업은 상기 이미지 세트에서 하나 이상의 관심 특징을 식별하기 위한 요청과 관련되는, 상기 수신 단계;로컬 시공간 처리 모듈을 사용하여, 상기 이미지 세트의 이미지 부분 집합을 분석하여 상기 하나 이상의 관심특징과 관련된 특성의 존재를 식별하는 단계; 및상기 복수의 작업의 각 작업에 대해 시계열 분석 모듈의 실행을 반복하여 각 작업에 대한 수치 점수를 상기 이미지 부분 집합의 각 이미지와 연관시키는 단계를 포함하는 비휘발성 컴퓨터 판독 매체.공개특허 10-2025-0036829-10-청구항 53 제52항에 있어서, 상기 로컬 시공간 처리 모듈은 상기 이미지 세트의 분석된 이미지의 부분 집합을 출력하며,상기 분석된 이미지의 부분 집합의 각 부분 집합은 상기 복수의 작업의 작업과 관련되는 비휘발성 컴퓨터 판독매체."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_54", "content": "제52항 또는 제53항에 있어서, 상기 로컬 시공간 처리 모듈은 품질 점수 벡터를 결정함으로써 특성의 존재를 결정하며, 상기 품질 점수 벡터의 각 품질 점수는 상기 이미지 부분 집합의 각 이미지에 대응하는 비휘발성 컴퓨터 판독 매체."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_55", "content": "제52항 내지 제54항 중 어느 한 항에 있어서, 상기 로컬 시공간 처리 모듈은 상기 복수의 작업의 각 작업과 관련된 관심 특징에 대한 특징 벡터 세트를 생성하는 비휘발성 컴퓨터 판독 매체."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_56", "content": "제52항 내지 제54항 중 어느 한 항에 있어서, 상기 동작은 추가로:글로벌 시공간 처리 모듈을 사용하여, 로컬 시공간 처리 모듈에 의해 분석된 이미지 부분 집합에 대한 특징 벡터 세트를 분석하는 단계를 포함하는 비휘발성 컴퓨터 판독 매체."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_57", "content": "제52항 내지 제54항 중 어느 한 항에 있어서, 상기 동작은 추가로:시계열 분석 모듈을 사용하여 상기 복수의 작업의 각 작업에 대한 로컬 시공간 처리 모듈의 출력을 집계하는 단계를 포함하는 비휘발성 컴퓨터 판독 매체."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_58", "content": "입력 이미지 세트에 대해 복수의 작업을 수행하기 위한 컴퓨터 구현 방법으로서, 상기 방법은 하나 이상의 프로세서에 의해 수행되는 다음 동작을 포함하는 컴퓨터 구현 방법:복수의 작업을 수신하는 단계로서, 상기 복수의 작업 중 적어도 하나의 작업은 상기 이미지 세트에서 하나 이상의 관심 특징을 식별하기 위한 요청과 관련되는, 상기 수신 단계;로컬 시공간 처리 모듈을 사용하여, 상기 이미지 세트의 이미지 부분 집합을 분석하여 하나 이상의 관심 특징과관련된 특성의 존재를 식별하는 단계; 및상기 복수의 작업의 각 작업에 대해 시계열 분석 모듈의 실행을 반복하여 각 작업에 대한 수치 점수를 상기 이미지 부분 집합의 각 이미지와 연관시키는 단계."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_59", "content": "제58항에 있어서, 상기 로컬 시공간 처리 모듈은 상기 이미지 세트의 분석된 이미지의 부분 집합을 출력하며,상기 분석된 이미지의 부분 집합의 각 부분 집합은 상기 복수의 작업의 작업과 관련되는 방법."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_60", "content": "제58항 또는 제59항에 있어서, 상기 로컬 시공간 처리 모듈은 품질 점수 벡터를 결정함으로써 특성의 존재를 결정하며, 상기 품질 점수 벡터의 각 품질 점수는 상기 이미지 부분 집합의 각 이미지에 대응하는 방법."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_61", "content": "제58항 내지 제60항 중 어느 한 항에 있어서, 상기 로컬 시공간 처리 모듈은 상기 복수의 작업의 각 작업과 관공개특허 10-2025-0036829-11-련된 관심 특징에 대한 특징 벡터 세트를 생성하는 방법."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_62", "content": "제58항 내지 제61항 중 어느 한 항에 있어서, 상기 방법은 추가로:글로벌 시공간 처리 모듈을 사용하여, 로컬 시공간 처리 모듈에 의해 분석된 이미지 부분 집합에 대한 특징 벡터 세트를 분석하는 단계를 포함하는 방법."}
{"patent_id": "10-2025-7003209", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_63", "content": "제58항 내지 제62항 중 어느 한 항에 있어서, 상기 방법은 추가로:시계열 분석 모듈을 사용하여 상기 복수의 작업의 각 작업에 대한 로컬 시공간 처리 모듈의 출력을 집계하는 단계를 포함하는 방법."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "영상 장치로 캡처된 이미지에서 하나 이상의 관심 특징을 검출하기 위한 컴퓨터 구현 방법이 제공된다. 상기 방 법은 캡처된 이미지로부터 시간순으로 정렬된 이미지의 순서화된 세트를 수신하는 단계 및 로컬 시공간 처리 모 듈을 사용하여 상기 순서화된 이미지 세트의 하나 이상의 부분 집합을 분석하는 단계를 포함하며, 상기 로컬 시 (뒷면에 계속)"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 일반적으로 비디오 처리 및 이미지 분석 분야에 관한 것이다. 보다 구체적으로, 그리고 제한 없이, 본 개시는 영상 장치로부터 캡처된 비디오 콘텐츠를 처리하고 지능형 이미지 분석을 수행하기 위한 시스템, 방 법 및 컴퓨터 판독 가능 매체에 관한 것으로, 예를 들어 하나 이상의 관심 특징 또는 의료 절차 중에 취해진 조 치의 존재를 결정하는 것과 같은 것이다. 본 명세서에 개시된 시스템 및 방법은 의료 영상 분석 및 진단을 포함 한 다양한 응용 분야에서 사용될 수 있다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "비디오 처리 및 이미지 분석 시스템에서, 객체 또는 관심 특징을 검출하는 것이 종종 바람직하다. 관심 특징은 사람, 장소 또는 사물일 수 있다. 의료 영상 분석을 위한 시스템 및 방법과 같은 일부 응용 분야에서는, 검출된 관심 특징(예: 인체 조직의 형성 또는 이상)의 위치 및 분류가 환자 진단에 중요하다. 그러나 기존의 컴퓨터 구 현 시스템 및 방법은 관심 특징을 정확하게 검출하거나 관심 특징과 관련된 특성을 인식하지 못하는 등 여러 가 지 단점을 가지고 있다. 또한, 기존 시스템 및 방법은 비효율적이며 이미지 순서 또는 이벤트 존재와 관련하여 이미지를 지능적으로 분석할 수 있는 방법을 제공하지 않는다. 현대 의료 절차는 환자의 신체와 장기에 대한 정밀하고 정확한 검사를 필요로 한다. 내시경 검사는 진단을 위해 의사에게 환자 신체 및 장기의 내부 영상을 제공하는 것을 목표로 하는 의료 절차이다. 인체의 위장관에서는 환 자의 입이나 항문을 통해 비디오 카메라가 있는 프로브를 삽입하여 시술을 수행할 수 있다. 내시경 검사 중에 의사는 실시간으로 디스플레이 장치에서 비디오를 보면서 수동으로 위장관을 통해 프로브를 조종한다. 비디오는 또한 캡처되어 저장될 수 있으며 내시경 검사 후에 검사될 수 있다. 대안으로, 캡슐 내시경 검사는 작은 카메라 가 포함된 캡슐을 삼켜 환자의 위장관을 검사하는 절차이다. 통과 중 캡슐이 찍은 일련의 이미지는 무선으로 수 신 장치로 전송되어 저장되며 절차 완료 후 의사가 검사할 수 있다. 캡슐 장치의 프레임 속도는 다양할 수 있으 며(예: 초당 2~6프레임) 검사 절차 중에 많은 양의 이미지가 촬영될 수 있다. 컴퓨터 비전 관점에서, 실시간 비디오 내시경 또는 캡슐 절차에서 캡처된 콘텐츠는 환자에 대한 정보, 예를 들 어 위장관의 내부 점막에 대한 정보를 포함하는 시간적으로 정렬된 일련의 이미지이다. 캡처된 이미지 데이터의 정확하고 정밀한 분석은 환자를 적절히 검사하고 병변, 폴립 또는 기타 관심 특징을 식별하는 데 필수적이다. 또한, 일반적으로 각 환자에 대해 수집된 이미지 수가 많다. 의사가 수행해야 하는 가장 중요한 의료 작업 중 하나는 이 대규모 이미지 세트를 검사하여 관심 특징의 존재 또는 부재와 관련하여 적절한 진단을 내리는 것이다(예: 이미지로 촬영된 점막의 병리학적 영역). 그러나 이러한 이미지를 수동으로 검토하는 것은 시간이 많이 걸리고 비효율적이다. 결과적으로 검토 과정에서 의사가 오류를 범하거나 오진을 내릴 수 있다. 진단을 개선하고, 의료 영상 검사에 필요한 시간을 줄이며, 오류 가능성을 줄이기 위해, 발명자들은 비디오 내 시경 또는 캡슐 절차 또는 기타 의료 절차의 모든 이미지에서 병리 또는 기타 관심 특징의 존재를 지능적으로처리하고 식별할 수 있는 컴퓨터 구현 시스템 및 방법을 갖는 것이 바람직하다고 판단했다. 예를 들어, 관심 특 징은 이미지에서 또는 이미지에 대해 취해지는 조치, 이미지의 해부학적 위치 또는 기타 관심 위치, 이미지의 임상 지수 수준 등을 포함할 수도 있다. 이러한 목적을 위해 훈련된 신경망, 시공간 이미지 분석 및 기타 특징 과 기술이 본 명세서에 개시되어 있다. 본 개시로부터 이해될 수 있듯이, 본 발명 및 구현예는 광범위한 이미지 캡처 및 분석 응용 분야에 적용될 수 있으며 본 명세서에 제시된 예에 국한되지 않는다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 구현예는 영상 장치로부터 캡처된 영상을 처리하고 하나 이상의 관심 특징의 존재를 결정하는 것과 같은 지능형 영상 분석을 수행하기 위한 시스템, 방법 및 컴퓨터 판독 가능 매체를 포함한다. 본 개시와 일치하 는 시스템 및 방법은 상기 언급된 단점 중 하나 이상 및/또는 기존 시스템 및 기술의 기타 단점을 해결하는 것 을 포함하여 기존 시스템 및 기술에 비해 이점을 제공할 수 있다. 일부 개시된 구현예와 일치하는 시스템, 방법 및 컴퓨터 판독 가능 매체는 비디오 내시경 또는 캡슐 시술 또는 기타 의료 시술에서 시간적으로 순서화된 영상 을 처리하기 위해 제공된다. 예시적 구현예는 시공간 정보를 사용하여 캡처된 영상을 지능적으로 처리하여 영상 내의 이상, 병리 또는 기타 관심 특징의 존재 가능성을 정확하게 평가하는 시스템 및 방법을 포함한다. 추가 예 로서, 관심 특징은 내시경 또는 캡슐 시술 또는 기타 의료 시술과 관련된 매개변수 또는 통계일 수 있다. 예를 들어, 내시경 시술의 관심 특징은 깨끗한 철수 시간 또는 프로브나 캡슐이 장기를 통과하는 시간일 수 있다. 영 상의 관심 특징은 또한 해당 관심 특징과 관련된 특성의 존재 또는 부재를 기반으로 결정될 수 있다. 이들 및 기타 구현예, 특징 및 구현은 본 명세서에서 더 자세히 설명된다. 관심 특징은 하나 이상의 영상에서 또는 하나 이상의 영상과 관련되어, 특히 하나 이상의 영상에서 표현된 장면이나 시야에서 또는 그와 관련되어, 하나 이상 의 영상을 분석하여 식별 가능하거나 검출 가능한 모든 특징일 수 있다. 예를 들어, 관심 특징은 객체, 또는 위 치, 또는 행동 또는 상태(예: 임상 지수 수준)일 수 있다. 일부 구현예에서, 내시경 비디오 카메라 또는 캡슐 카메라와 같은 영상 장치에 의해 캡처된 영상은 위장관 또는 장기의 영상을 포함한다. 영상은 예를 들어 위 내시경, 대장 내시경 또는 소장 내시경 중에 사용되는 의료 영상 장치에서 올 수 있다. 영상의 관심 특징은 예를 들어 이상 또는 기타 병리일 수 있다. 이상 또는 병리는 인체 조직의 또는 인체 조직상의 형성, 한 유형의 세포에서 다른 유형의 세포로의 인체 조직 변화, 인체 조직이 예상 되는 위치에서의 인체 조직의 부재, 또는 인체 조직의 또는 인체 조직상의 형성을 포함할 수 있다. 형성은 병변, 용종형 병변 또는 비용종형 병변을 포함할 수 있다. 관심 특징의 다른 예로는 해부학적 또는 기타 위치, 행동, 임상 지수(예: 청결도) 등이 있다. 따라서, 본 개시에서 이해되듯이, 예시적 구현예는 단일 질병에 특정 되지 않은 방식으로 의료 맥락에서 일반적으로 적용될 수 있는 방식으로 활용될 수 있다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 한 가지 일반적인 측면에 따르면, 영상 장치에 의해 캡처된 이미지를 처리하기 위한 컴퓨터 구현 시 스템이 제공된다. 상기 컴퓨터 구현 시스템은 영상 장치에 의해 캡처된 이미지에서 적어도 하나의 관심 특징을 검출하도록 구성된 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서는 다음과 같이 구 성될 수 있다: 캡처된 이미지로부터 순서화된 이미지 세트를 수신하되, 상기 순서화된 이미지 세트는 시간적으 로 순서화되어 있음; 로컬 시공간 처리 모듈을 사용하여 순서화된 이미지 세트의 하나 이상의 부분 집합을 개별 적으로 분석하되, 상기 로컬 시공간 처리 모듈은 각 부분 집합의 각 이미지에서 적어도 하나의 관심 특징과 관 련된 특성의 존재를 결정하고 각 부분 집합의 각 이미지에서 결정된 특성에 기초하여 특징 벡터로 부분 집합 이 미지에 주석을 달도록 구성됨; 글로벌 시공간 처리 모듈을 사용하여 순서화된 이미지 세트의 특징 벡터 세트를 처리하되, 상기 글로벌 시공간 처리 모듈은 각 부분 집합의 이미지와 연관된 결정된 특성을 정제하도록 구성되 며, 여기서 특징 벡터 세트의 각 특징 벡터는 적어도 하나의 관심 특징의 각 결정된 특성에 대한 정보를 포함함; 그리고 시계열 분석 모듈을 사용하여 각 이미지에 대한 수치 값을 계산하되, 상기 수치 값은 적어도 하 나의 관심 특징의 존재를 나타내며 각 부분 집합의 이미지와 연관된 정제된 특성 및 시공간 정보를 사용하여 계 산됨. 또한, 상기 적어도 하나의 프로세서는 순서화된 이미지 세트의 각 부분 집합의 각 이미지와 연관된 수치 값을 사용하여 적어도 하나의 관심 특징에 대한 보고서를 생성하도록 구성될 수 있다. 보고서는 내시경 또는 기 타 의료 절차 완료 후에 생성될 수 있다. 보고서는 처리된 이미지에서 식별된 모든 관심 특징과 관련된 정보를 포함할 수 있다. 상기 컴퓨터 구현 시스템의 적어도 하나의 프로세서는 추가로 부분 집합의 각 이미지에서 적어도 하나의 관심 특징과 관련된 특성의 가능성을 결정하도록 구성될 수 있다. 또한, 상기 적어도 하나의 프로세서는 부분 집합의 각 이미지를 인코딩하고 순환 신경망 또는 시간 합성곱 네트워크를 사용하여 결정된 특성의 시공간 정보를 집계 함으로써 부분 집합의 각 이미지에서 특성의 가능성을 결정하도록 구성될 수 있다. 결정된 특성을 정제하기 위해 비인과적 시간 합성곱 네트워크가 사용될 수 있다. 예를 들어, 시스템의 적어도 하나의 프로세서는 비인과적 시간 합성곱 네트워크를 적용하여 부분 집합의 각 이미지에서 특성의 가능성을 정 제하도록 구성될 수 있다. 상기 적어도 하나의 프로세서는 추가로 저역 통과 필터링 및/또는 가우시안 평활화 등의 하나 이상의 신호 처리 기술을 적용하여 특성의 가능성을 정제하도록 구성될 수 있다. 또 다른 측면에 따르면, 시스템의 적어도 하나의 프로세서는 품질 점수의 벡터를 결정함으로써 로컬 시공간 처 리 모듈을 사용하여 순서화된 이미지 세트를 분석하여 특성의 존재를 결정하도록 구성될 수 있으며, 여기서 품 질 점수 벡터의 각 품질 점수는 이미지 부분 집합의 각 이미지에 대응한다. 또한, 상기 적어도 하나의 프로세서 는 신호 처리 기술을 사용하여 순서화된 이미지 세트의 하나 이상의 부분 집합의 각 이미지의 품질 점수를 정제 함으로써 글로벌 시공간 처리 모듈을 사용하여 순서화된 이미지 세트를 처리하도록 구성될 수 있다. 상기 적어 도 하나의 프로세서는 추가로 심층 합성곱 신경망을 사용하여 부분 집합의 각 이미지에 대한 픽셀 단위 이진 마 스크를 생성함으로써 로컬 시공간 처리 모듈을 사용하여 순서화된 이미지 세트의 하나 이상의 부분 집합을 분석 하여 특성의 존재를 결정하도록 구성될 수 있다. 상기 적어도 하나의 프로세서는 추가로 결정된 특성의 형태 및 분포에 대한 사전 정보를 활용하는 형태학적 연산을 사용하여 이미지 분할을 위한 이진 마스크를 정제함으로써 글로벌 시공간 처리 모듈을 사용하여 순서화된 이미지 세트의 하나 이상의 부분 집합을 처리하도록 구성될 수 있다. 본 명세서에 개시된 바와 같이, 구현은 다음 특징 중 하나 이상을 포함할 수 있다. 부분 집합의 각 이미지에서 결정된 특성의 가능성은 0과 1 사이의 부동 소수점 값을 포함할 수 있다. 품질 점수는 0과 R 사이의 서수일 수 있으며, 여기서 점수 0은 최소 품질을 나타내고 점수 R은 최대 품질을 나타낸다. 각 이미지와 연관된 수치 값은 이미지 내에서 적어도 하나의 관심 특징을 식별할 확률을 결정하기 위해 해석 가능할 수 있다. 출력은 적어도 하나의 관심 특징이 검출되지 않은 이미지에 대한 제1 수치 값일 수 있다. 출력은 적어도 하나의 관심 특징이 검출된 이미지에 대한 제2 수치 값일 수 있다. 이미지 부분 집합의 크기 또는 용량은 시스템 사용자에 의해 구 성 가능할 수 있다. 이미지 부분 집합의 크기 또는 용량은 요청된 관심 특징에 기초하여 동적으로 결정될 수 있 다. 이미지 부분 집합의 크기 또는 용량은 결정된 특성에 기초하여 동적으로 결정될 수 있다. 하나 이상의 이미 지 부분 집합은 공유된 이미지를 포함할 수 있다. 본 개시의 또 다른 일반적인 측면은 영상 장치로 캡처된 이미지의 시공간 분석을 위한 컴퓨터 구현 시스템에 관 한 것이다. 상기 컴퓨터 구현 시스템은 복수의 이미지 프레임을 포함하는 영상 장치로부터 캡처된 비디오를 수 신하도록 구성된 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서는 추가로 다음과 같 이 구성될 수 있다: 캡처된 이미지로부터 시간적으로 순서화된 이미지 세트에 접근; 이벤트 감지기 모듈을 사용 하여, 시간적으로 순서화된 이미지 세트에서 이벤트의 발생을 검출하되, 상기 이벤트의 시작 시간 및 종료 시간 은 시간적으로 순서화된 이미지 세트 내의 시작 이미지 프레임 및 종료 이미지 프레임에 의해 식별됨; 프레임 선택기 모듈을 사용하여, 시작 이미지 프레임 및 종료 이미지 프레임에 의해 경계가 정해진 시간적으로 순서화 된 이미지 세트 내의 이미지 그룹으로부터, 이미지의 관련 점수 및 품질 점수에 기초하여 이미지를 선택하되, 선택된 이미지의 관련 점수는 적어도 하나의 관심 특징의 존재를 나타냄; 객체 기술자 모듈을 사용하여, 적어도 하나의 관심 특징의 일치하는 존재에 기초하여 선택된 이미지로부터 이미지의 부분 집합을 병합하되, 상기 이미 지의 부분 집합은 시공간 정보를 사용하여 공간적 및 시간적 일관성에 기초하여 식별됨; 그리고 시간 분할기를 사용하여, 선택된 작업의 시간적 일관성을 만족하는 시간 간격으로 시간적으로 순서화된 이미지 세트를 분할. 개시된 시스템에 따르면, 상기 적어도 하나의 프로세서는 추가로 로컬 시공간 처리 모듈을 사용하여 비디오 콘 텐츠의 이미지 부분 집합에 대해 적어도 하나의 관심 특징과 관련된 특성의 시공간 정보를 결정하고 글로벌 시 공간 처리 모듈을 사용하여 비디오 콘텐츠의 모든 이미지의 시공간 정보를 결정하도록 구성될 수 있다. 또한, 상기 적어도 하나의 프로세서는 적어도 하나의 관심 특징의 존재를 가진 시간적으로 순서화된 이미지 세트의 부 분 집합을 식별함으로써 시간적으로 순서화된 이미지 세트를 시간 간격으로 분할하도록 구성될 수 있다. 상기 적어도 하나의 프로세서는 또한 시간적으로 순서화된 이미지 세트의 이미지에 북마크를 추가함으로써 적어도 하 나의 관심 특징의 존재를 가진 시간적으로 순서화된 이미지 세트의 부분 집합을 식별하도록 구성될 수 있으며, 여기서 북마크가 추가된 이미지는 시간적으로 순서화된 이미지 세트의 부분 집합의 일부이다. 추가적으로 또는 대안적으로, 상기 적어도 하나의 프로세서는 시간적으로 순서화된 이미지 세트의 부분 집합으로부터 이미지 세 트를 추출함으로써 적어도 하나의 관심 특징의 존재를 가진 시간적으로 순서화된 이미지 세트의 부분 집합을 식별하도록 구성될 수 있다. 구현은 다음 특징 중 하나 이상을 포함할 수 있다. 추출된 이미지 세트는 적어도 하나의 관심 특징과 관련된 특 성을 포함할 수 있다. 색상은 적어도 하나의 관심 특징에 대한 시간적으로 순서화된 이미지 세트의 부분 집합의 이미지의 관련성 수준에 따라 변할 수 있다. 색상은 적어도 하나의 관심 특징과 관련된 특성에 대한 시간적으로 순서화된 이미지 세트의 부분 집합의 이미지의 관련성 수준에 따라 변할 수 있다. 또 다른 일반적인 측면은 이미지 세트에 대해 복수의 작업을 수행하기 위한 컴퓨터 구현 시스템을 포함한다. 상 기 컴퓨터 구현 시스템은 이미지 프레임 세트를 포함하는 영상 장치로부터 캡처된 비디오를 수신하도록 구성된 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서는 추가로 다음과 같이 구성될 수 있다: 복수의 작업을 수신하되, 상기 복수의 작업 중 적어도 하나의 작업은 이미지 세트에서 적어도 하나의 관 심 특징을 식별하기 위한 요청과 관련됨; 로컬 시공간 처리 모듈을 사용하여, 적어도 하나의 관심 특징과 관련 된 특성의 존재를 식별하기 위해 이미지 세트의 이미지 부분 집합을 분석; 그리고 복수의 작업의 각 작업에 대 해 시계열 분석 모듈의 실행을 반복하여 각 작업에 대한 수치 점수를 이미지 세트의 각 이미지와 연관시킴. 본 개시와 일치하여, 하나 이상의 컴퓨터의 시스템은 해당 시스템에 설치된 소프트웨어, 펌웨어, 하드웨어 또는 이들의 조합을 갖음으로써 작동 시 시스템이 그러한 동작 또는 조치를 수행하게 하는 동작 또는 조치를 수행하 도록 구성될 수 있다. 하나 이상의 컴퓨터 프로그램은 데이터 처리 장치(예: 하나 이상의 프로세서)에 의해 실 행될 때 장치가 그러한 동작 또는 조치를 수행하게 하는 명령어를 포함함으로써 그러한 동작 또는 조치를 수행 하도록 구성될 수 있다. 본 개시와 일치하는 시스템 및 방법은 소프트웨어, 펌웨어 및 하드웨어의 적절한 조합을 사용하여 구현될 수 있 다. 본 개시의 구현은 개시된 동작 또는 조치와 관련된 기능을 수행하기 위해 특별히 구성 및/또는 프로그래밍 된 프로그램 또는 명령어를 포함할 수 있다. 또한, 본 명세서에 설명된 단계 및/또는 방법을 수행하기 위해 적 어도 하나의 프로세서에 의해 실행 가능한 프로그램 명령어를 저장하는 비일시적 컴퓨터 판독 가능 저장 매체가 사용될 수 있다. 전술한 일반적인 설명 및 다음의 상세한 설명은 예시적이고 설명을 위한 것일 뿐이며 개시된 구현예를 제한하지 않는다는 것을 이해할 것이다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "예시적인 구현예는 첨부 도면을 참조하여 아래에 설명된다. 도면은 반드시 축척에 맞게 그려진 것은 아니다. 개 시된 원리의 예와 특징이 본 명세서에 설명되어 있지만, 수정, 적응 및 기타 구현이 개시된 구현예의 정신과 범 위를 벗어나지 않고 가능하다. 또한, \"포함하는\", \"갖는\", \"함유하는\" 및 \"포함하는\" 단어와 기타 유사한 형태 는 동등한 의미를 갖도록 의도되며 개방형이어서 이러한 단어 중 하나 다음에 오는 항목 또는 항목들의 목록이 완전한 목록이 아니거나 그러한 목록된 항목 또는 항목들로만 제한되는 것을 의미하지 않는다. 또한 본 명세서 및 첨부된 청구항에서 사용되는 단수형 \"a\", \"an\" 및 \"the\"는 문맥상 명확하게 달리 지시하지 않는 한 복수의 참조를 포함한다는 점에 유의해야 한다. 다음 설명에서는 설명을 위해 다양한 작업 예가 제공된다. 그러나 본 개시는 이러한 세부 사항 중 하나 이상 없 이 실시될 수 있음을 이해할 것이다. 본 개시 전반에 걸쳐 \"개시된 구현예\"에 대한 언급이 있는데, 이는 본 명세서에 설명된 발명적 아이디어, 개념 및/또는 구현의 예를 의미한다. 본 개시 전반에 걸쳐 많은 관련 및 관련 없는 구현예가 설명된다. 일부 \"개시된 구현예\"가 특징 또는 특성을 나타내는 것으로 설명된다는 사실이 다른 개시된 구현예가 반드시 그 특징 또는 특 성을 공유한다는 것을 의미하지는 않는다. 본 명세서에 설명된 구현예는 적어도 하나의 프로세서에 의해 실행될 때 적어도 하나의 프로세서가 방법 또는 일련의 동작을 수행하게 하는 명령어를 포함하는 비일시적 컴퓨터 판독 가능 매체를 포함한다. 비일시적 컴퓨터 판독 가능 매체는 프로세서가 있는 모든 컴퓨팅 장치가 메모리에 저장된 방법 또는 기타 명령어를 수행할 수 있 도록 하는 방식으로 모든 메모리에 데이터를 저장할 수 있는 모든 매체일 수 있다. 비일시적 컴퓨터 판독 가능 매체는 소프트웨어, 펌웨어, 하드웨어 또는 이들의 조합으로 구현될 수 있다. 소프트웨어는 바람직하게는 부품 으로 구성되거나 특정 장치 및/또는 장치 조합으로 구성된 프로그램 저장 장치 또는 컴퓨터 판독 가능 매체에 유형적으로 구현된 응용 프로그램으로 구현될 수 있다. 응용 프로그램은 적절한 아키텍처를 가진 기계에 업로드 되어 실행될 수 있다. 바람직하게는 기계는 하나 이상의 중앙 처리 장치(\"CPU\"), 메모리 및 입출력 인터페이스 와 같은 하드웨어를 갖는 컴퓨터 플랫폼에 구현될 수 있다. 컴퓨터 플랫폼은 또한 운영 체제 및 마이크로명령 코드를 포함할 수 있다. 본 개시에 설명된 다양한 프로세스 및 기능은 마이크로명령 코드의 일부이거나 응용 프 로그램의 일부이거나 이들의 조합일 수 있으며, 이는 CPU에 의해 실행될 수 있으며, 그러한 컴퓨터 또는 프로세 서가 명시적으로 표시되어 있는지 여부와 관계없이 실행될 수 있다. 또한 추가 데이터 저장 장치 및 인쇄 장치 와 같은 다양한 주변 장치가 컴퓨터 플랫폼에 연결될 수 있다. 또한 비일시적 컴퓨터 판독 가능 매체는 과도적 으로 전파되는 신호를 제외한 모든 컴퓨터 판독 가능 매체일 수 있다. 메모리는 전자 데이터 또는 명령어를 저장하기 위한 모든 메커니즘을 포함할 수 있으며, 랜덤 액세스 메모리 (RAM), 읽기 전용 메모리(ROM), 하드 디스크, 광 디스크, 자기 매체, 플래시 메모리, 기타 영구, 고정, 휘발성또는 비휘발성 메모리를 포함한다. 메모리는 하나 이상의 별도의 저장 장치를 포함할 수 있으며, 데이터 구조, 명령어 또는 기타 데이터를 저장할 수 있는 동일 위치 또는 분산된 장치를 포함할 수 있다. 메모리는 추가로 프 로세서가 실행할 명령어를 포함하는 메모리 부분을 포함할 수 있다. 메모리는 또한 프로세서의 작업 메모리 장 치 또는 임시 저장소로 사용될 수 있다. 일부 구현예는 적어도 하나의 프로세서를 포함할 수 있다. 프로세서는 입력 또는 입력들에 대해 논리 연산을 수 행하는 전기 회로를 갖는 모든 물리적 장치 또는 장치 그룹일 수 있다. 예를 들어, 적어도 하나의 프로세서는 하나 이상의 집적 회로(IC)를 포함할 수 있으며, 애플리케이션별 집적 회로(ASIC), 마이크로칩, 마이크로컨트롤 러, 마이크로프로세서, 중앙 처리 장치(CPU)의 전체 또는 일부, 그래픽 처리 장치(GPU), 디지털 신호 처리기 (DSP), 현장 프로그래밍 가능 게이트 어레이(FPGA), 서버, 가상 서버 또는 명령어를 실행하거나 논리 연산을 수 행하기에 적합한 기타 회로를 포함할 수 있다. 적어도 하나의 프로세서에 의해 실행되는 명령어는 예를 들어 컨 트롤러와 통합되거나 내장된 메모리에 미리 로드되거나 별도의 메모리에 저장될 수 있다. 일부 구현예에서, 적어도 하나의 프로세서는 하나 이상의 프로세서를 포함할 수 있다. 각 프로세서는 유사한 구 조를 가질 수 있거나, 프로세서들은 서로 전기적으로 연결되거나 분리된 다른 구조일 수 있다. 예를 들어, 프로 세서는 별도의 회로이거나 단일 회로에 통합될 수 있다. 하나 이상의 프로세서가 사용되는 경우, 프로세서는 독 립적으로 또는 협력하여 작동하도록 구성될 수 있다. 프로세서는 전기적, 자기적, 광학적, 음향적, 기계적 또는 상호 작용을 허용하는 기타 수단에 의해 결합될 수 있다. 본 개시와 일치하는 구현예는 네트워크를 포함할 수 있다. 네트워크는 데이터 교환에 사용되는 모든 유형의 물 리적 또는 무선 컴퓨터 네트워킹 배열을 구성할 수 있다. 예를 들어, 네트워크는 인터넷, 사설 데이터 네트워크, 공용 네트워크를 사용하는 가상 사설 네트워크, Wi-Fi 네트워크, LAN 또는 WAN 네트워크 및/또는 시 스템의 다양한 구성 요소 간의 정보 교환을 가능하게 하는 기타 적절한 연결일 수 있다. 일부 구현예에서, 네트 워크는 데이터 교환에 사용되는 하나 이상의 물리적 링크를 포함할 수 있으며, 이더넷, 동축 케이블, 꼬임 쌍선 케이블, 광섬유 또는 데이터 교환에 적합한 기타 물리적 매체를 포함할 수 있다. 네트워크는 또한 하나 이상의 네트워크를 포함할 수 있으며, 예를 들어 사설 네트워크, 공중 교환 전화망(\"PSTN\"), 인터넷 및/또는 무선 셀룰 러 네트워크를 포함할 수 있다. 네트워크는 보안 네트워크 또는 비보안 네트워크일 수 있다. 다른 구현예에서, 시스템의 하나 이상의 구성 요소는 전용 통신 네트워크를 통해 직접 통신할 수 있다. 직접 통신은 예를 들어 BLUETOOTH™BLUETOOTH LE™Wi-Fi, 근거리 통신(NFC) 또는 별도의 엔티티 간에 데이터를 교환하기 위한 매체를 제공하는 기타 적절한 통신 방법을 포함하여 적절한 기술을 사용할 수 있다. 일부 구현예에서, 기계 학습 네트워크 또는 알고리즘은 아래에 설명된 경우와 같이 훈련 예제를 사용하여 훈련 될 수 있다. 이러한 기계 학습 알고리즘의 비제한적인 예에는 분류 알고리즘, 비디오 분류 알고리즘, 데이터 회 귀 알고리즘, 이미지 분할 알고리즘, 시간적 비디오 분할 알고리즘, 시각적 검출 알고리즘(예: 객체 검출기, 얼 굴 검출기, 사람 검출기, 동작 검출기, 에지 검출기 등), 시각적 인식 알고리즘(예: 얼굴 인식, 사람 인식, 객 체 인식 등), 음성 인식 알고리즘, 동작 인식 알고리즘, 수학적 임베딩 알고리즘, 자연어 처리 알고리즘, 서포 트 벡터 머신, 랜덤 포레스트, 최근접 이웃 알고리즘, 딥 러닝 알고리즘, 인공 신경망 알고리즘, 합성곱 신경망 알고리즘, 재귀 신경망 알고리즘, 선형 기계 학습 모델, 비선형 기계 학습 모델, 앙상블 알고리즘 등이 포함될 수 있다. 예를 들어, 훈련된 기계 학습 네트워크 또는 알고리즘은 추론 모델(예: 예측 모델, 분류 모델, 회귀 모델, 클러스터링 모델, 분할 모델, 인공 신경망(예: 심층 신경망, 합성곱 신경망, 재귀 신경망 등), 랜덤 포레 스트, 서포트 벡터 머신 등)을 포함할 수 있다. 일부 예에서, 훈련 예제는 예제 입력과 함께 예제 입력에 대응 하는 원하는 출력을 포함할 수 있다. 또한, 일부 예에서 훈련 예제를 사용하여 기계 학습 알고리즘을 훈련하면 훈련된 기계 학습 알고리즘이 생성될 수 있으며, 훈련된 기계 학습 알고리즘은 훈련 예제에 포함되지 않은 입력 에 대한 출력을 추정하는 데 사용될 수 있다. 훈련은 감독 또는 비감독, 또는 이들의 조합일 수 있다. 일부 예 에서, 기계 학습 알고리즘을 훈련하는 엔지니어, 과학자, 프로세스 및 기계는 검증 예제 및/또는 테스트 예제를 추가로 사용할 수 있다. 예를 들어, 검증 예제 및/또는 테스트 예제는 예제 입력과 함께 예제 입력에 대응하는 원하는 출력을 포함할 수 있으며, 훈련된 기계 학습 알고리즘 및/또는 중간 훈련된 기계 학습 알고리즘은 검증 예제 및/또는 테스트 예제의 예제 입력에 대한 출력을 추정하는 데 사용될 수 있고, 추정된 출력은 대응하는 원 하는 출력과 비교될 수 있으며, 훈련된 기계 학습 알고리즘 및/또는 중간 훈련된 기계 학습 알고리즘은 비교 결 과에 기초하여 평가될 수 있다. 일부 예에서, 기계 학습 알고리즘은 매개변수와 초매개변수를 가질 수 있으며, 초매개변수는 사람에 의해 수동으로 또는 기계 학습 알고리즘 외부의 프로세스(예: 초매개변수 검색 알고리즘) 에 의해 자동으로 설정되고, 기계 학습 알고리즘의 매개변수는 훈련 예제에 따라 기계 학습 알고리즘에 의해 설 정된다. 일부 구현에서, 초매개변수는 훈련 예제와 검증 예제에 따라 설정되고 매개변수는 훈련 예제와 선택된초매개변수에 따라 설정된다. 기계 학습 네트워크 또는 알고리즘은 출력에 기초하여 추가로 재훈련될 수 있다. 본 명세서에 개시된 특정 구현예는 일련의 단계를 포함하는 동작 또는 방법을 수행하기 위한 컴퓨터 구현 시스 템을 포함할 수 있다. 컴퓨터 구현 시스템 및 방법은 실시간 비디오를 처리하도록 구성된 하나 이상의 프로세서 를 포함하는 하나 이상의 컴퓨팅 장치에 의해 구현될 수 있다. 컴퓨팅 장치는 데이터를 처리할 수 있는 하나 이 상의 컴퓨터 또는 기타 장치일 수 있다. 이러한 컴퓨팅 장치는 LCD 디스플레이, 증강 현실(AR) 또는 가상 현실 (VR) 디스플레이와 같은 디스플레이를 포함할 수 있다. 그러나 컴퓨팅 장치는 또한 백엔드 구성 요소(예: 데이 터 서버)를 포함하거나 미들웨어 구성 요소(예: 애플리케이션 서버)를 포함하거나 프론트엔드 구성 요소(예: 사 용자가 여기에 설명된 시스템 및 기술의 구현과 상호 작용할 수 있는 그래픽 사용자 인터페이스 또는 웹 브라우 저를 갖는 사용자 장치)를 포함하거나 이러한 백엔드, 미들웨어 또는 프론트엔드 구성 요소의 조합을 포함하는 컴퓨팅 시스템에서 구현될 수 있다. 시스템 및/또는 컴퓨팅 장치의 구성 요소는 디지털 데이터 통신의 모든 형 태 또는 매체(예: 통신 네트워크)에 의해 상호 연결될 수 있다. 통신 네트워크의 예에는 근거리 통신망(\"LAN\"), 광역 통신망(\"WAN\") 및 인터넷이 포함된다. 컴퓨팅 장치는 클라이언트와 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 원격에 있으며 일반적으로 통신 네트워크를 통해 상호 작용한다. 클라이언트와 서버의 관계는 각각의 컴퓨터에서 실행되고 서로 클라이언트-서버 관계를 갖는 컴퓨터 프로그램에 의해 발생한다. 도 1a는 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템 100의 블록도이다. 본 명세서에서 추가로 개시된 바와 같이, 지능형 검출기 시스템 100은 컴퓨터 구현 시스템일 수 있으며 의료 절차의 이미지를 처리하 여 이미지에서 요청된 관심 특징을 식별하기 위해 하나 이상의 합성곱 신경망(CNN)을 포함할 수 있다. 관심 특 징은 의사가 이미지에서 찾고 있는 병리 또는 병리 목록일 수 있다(예: 환자를 진단하기 위해). 추가 예로서, 관심 특징은 또한 이미지에서 또는 이미지에 대해 취해야 할 조치, 이미지의 해부학적 위치 또는 기타 관심 위 치, 이미지의 임상 지수 수준 등을 포함할 수 있다. 이러한 예와 기타 예는 본 개시의 범위 내에 있다. 예를 들 어, 조치는 의료 절차 중 또는 후속 절차의 일부로 의사가 취하는 조치를 포함할 수 있으며, 여기에는 의료 절 차의 이미지에 대한 시스템 100의 시공간 검토 결과로 시스템 100에 의해 식별된 조치 또는 절차가 포함된다. 예를 들어, 조치는 생검 수행, 병변 제거 또는 장기의 표면/점막 탐색/분석과 같은 의료 지침에 따른 권장 조치 또는 절차를 포함할 수 있다. 조치 또는 절차는 지능형 검출기 시스템 100에 의해 캡처 및 처리된 이미지에 기 초하여 식별될 수 있다. 지능형 검출기 시스템 100은 내시경 또는 대장 내시경 절차와 같은 의료 절차의 시간적으로 정렬된 이미지의 컬 렉션을 입력으로 받을 수 있다. 지능형 검출기 시스템 100은 각 이미지에 대한 하나 이상의 수치 값(예: 점수) 을 포함하는 보고서 또는 정보를 출력할 수 있다. 수치 값은 의료 카테고리(예: 특정 병리)와 관련될 수 있으며 이미지 프레임 내에서 의료 카테고리의 존재 확률에 대한 정보를 제공할 수 있다. 지능형 검출기 시스템 100에 의해 처리되는 이미지는 데이터베이스나 메모리 장치에 저장되어 있다가 지능형 검출기 시스템 100에 의해 후속 검색 및 처리를 위해 캡처된 의료 절차의 이미지일 수 있다. 일부 구현예에서, 이미지 처리 결과로 지능형 검출 기 시스템 100이 제공하는 출력에는 이미지에 할당된 수치 점수와 의료 지침에 따른 권장 다음 단계가 포함된 보고서가 포함될 수 있다. 보고서는 내시경 또는 기타 의료 절차 완료 후에 생성될 수 있다. 보고서는 처리된 이미지에서 식별된 모든 관심 특징과 관련된 정보를 포함할 수 있다. 또한, 일부 구현예에서 지능형 검출기 시 스템 100이 제공하는 출력에는 의료 절차의 이미지에서 식별된 특징을 고려하여 의사가 수행해야 할 권장 조치 (예: 생검 수행, 병변 제거, 장기의 표면/점막 탐색/분석 등)가 포함될 수 있다. 의료 절차 중에 지능형 검출기 시스템 100은 의료 영상 장치로부터 직접 비디오나 이미지 프레임을 수신하여 처리하고, 절차 중 또는 의료 절 차 직후(즉, 짧은 시간 간격, 무시간에서 몇 분 사이)에 운영자의 수행된 조치에 대한 피드백과 함께 관찰된 내 용 및/또는 해부학적 위치 및/또는 운영자가 의료 절차 중 어떻게 행동/조치했는지에 대한 세부 정보를 포함하 는 여러 측정 변수, 임상 지수 및 최종 보고서를 제공할 수 있다. 수행된 조치에는 생검 수행, 병변 제거 또는 장기의 표면/점막 탐색/분석과 같은 의료 지침에 따른 권장 조치 또는 절차가 포함될 수 있다. 일부 구현예에서 권장 조치는 의료 지침에 기반한 일련의 권장 조치의 일부일 수 있다. 실시간 처리를 위한 예시적인 컴퓨터 시 스템을 구현하는 지능형 검출기 시스템 100에 대한 자세한 설명은 아래 도 1b 설명에 제시되어 있다. 본 명세서에 개시된 바와 같이, 지능형 검출기 시스템 100은 로컬 시공간 처리 모듈 110, 글로벌 시공간 처리 모듈 120 및 시계열 분석 모듈 130에 의한 캡처된 비디오 처리를 기반으로 한 정보를 포함하는 의료 절차 완료 후 보고서를 생성할 수 있다. 보고서는 의료 절차 중 식별된 관심 특징과 관련된 정보뿐만 아니라 각 이미지에 대한 수치 값 또는 점수와 같은 기타 정보를 포함할 수 있다. 설명한 바와 같이, 수치 값은 특정 병리와 같은 의료 카테고리와 관련될 수 있으며 이미지 프레임 내에서 의료 카테고리의 존재 확률에 대한 정보를 제공할 수 있다. 지능형 검출기 시스템 100과 로컬 시공간 처리 모듈 110, 글로벌 시공간 처리 모듈 120 및 시계열 분석모듈 130의 작동에 대한 자세한 내용은 첨부 도면을 참조하여 아래에 제공된다. 일부 구현예에서, 시스템 100이 생성하는 보고서는 의료 절차의 저장된 이미지 처리 또는 의료 절차의 이미지 실시간 처리를 기반으로 한 추가 권장 조치를 포함할 수 있다. 추가 권장 조치에는 의료 절차 중에 수행될 수 있었던 조치나 절차와 의료 절차 후에 수행할 조치나 절차가 포함될 수 있다. 추가 권장 조치는 의료 지침에 기 반한 일련의 권장 조치의 일부일 수 있다. 또한, 위에서 설명한 바와 같이 시스템 100은 비디오에서 발생하거나 식별된 내용과 의료 절차 중 발생한 내용에 대해 운영자에게 동시 피드백을 제공하기 위해 실시간으로 비디오를 처리할 수 있다. 지능형 검출기 시스템 100이 생성한 출력에는 대시보드 디스플레이 또는 유사한 보고서가 포함될 수 있다(예:"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 2, "content": "도 10 참조). 대시보드는 예를 들어 내시경 또는 대장 내시경 검사의 요약 보고서를 제공할 수 있다. 대시보드 는 절차에 대한 품질 점수 및/또는 기타 정보를 제공할 수 있다. 점수 및/또는 기타 정보는 의료 전문가의 검사"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "행동을 요약하고 식별된 폴립 수와 같은 관심 특징에 대한 정보를 제공할 수 있다. 일부 구현예에서, 시스템 100이 생성한 정보는 의료 절차의 비디오에 오버레이로 제공 및 표시되므로 운영자는 의료 절차 중 또는 바로 후에 증강된 비디오 피드의 일부로 정보를 볼 수 있다. 이 정보는 약간의 지연 또는 지연 없이 제공될 수 있다. 지능형 검출기 시스템 100은 또한 전자 파일, 데이터 세트 또는 데이터 전송 형태로 보고서를 생성할 수 있다. 예를 들어, 시스템 100이 생성한 출력은 표준화된 형식을 따를 수 있고/있거나 전자 건강 기록(EHR)과 같은 기 록에 통합될 수 있다. 시스템 100의 출력은 또한 상호 운용성 및 개인 정보 보호를 위한 HIPAA와 같은 규정을 준수할 수 있다. 일부 구현예에서 출력은 다른 보고서에 통합될 수 있다. 예를 들어, 지능형 검출기 시스템 100 의 출력은 환자의 전자 의료 또는 건강 기록에 통합될 수 있다. 지능형 검출기 시스템 100은 이러한 통합을 용 이하게 하고/하거나 표준화된 데이터 세트 또는 템플릿 형태로 출력을 제공하는 API를 포함할 수 있다. 표준화 된 템플릿에는 지능형 검출기 시스템 100이 의료 절차의 입력 비디오나 이미지 프레임을 처리하여 생성한 데이 터 값으로 채울 수 있는 미리 정의된 양식이나 표가 포함될 수 있다. 일부 구현예에서 보고서는 전송이나 저장 을 지원하고 다른 시스템 및 애플리케이션과의 통합을 위해 시스템 100에 의해 기계 판독 가능한 형식(예: XML 파일)으로 생성될 수 있다. 일부 구현예에서 보고서는 Word, Excel, HTML 또는 PDF 파일 형식과 같은 다른 형식 으로 제공될 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 네트워크를 통해 서버나 데이터베이스에 데 이터나 보고서를 업로드할 수 있다(예: 도 1a의 네트워크 160 참조). 지능형 검출기 시스템 100은 또한 API 호 출을 하고 출력 데이터나 형식이 지정된 보고서를 전송하여 서버나 데이터베이스로 전송할 수 있다(예: JSON 문 서로). 도 10은 본 개시의 구현예와 일치하는 지능형 검출기 시스템(예: 지능형 검출기 시스템 100)을 사용하여 생성된"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "출력 요약 1090이 포함된 예시적인 대시보드 1000을 도시한다. 지능형 검출기 시스템 100의 모듈을 사용하여 절"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "차에 대한 출력 요약 1090이 생성될 수 있다. 출력 요약 1090은 절차 시간, 철수 시간 및 깨끗한 철수 시간과"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "같은 품질 점수 및/또는 기타 정보를 제공할 수 있다. 요약 1090의 일부가 될 수 있는 정보의 추가 예에는 특정 조치(예: 위에서 논의한 권장 조치) 수행에 소요된 시간 및 뚜렷한 해부학적 위치에서 보낸 시간이 포함된다. 폴립과 같은 관심 특징과 관련된 정보도 제공될 수 있다. 예를 들어, 시계열 분석 모듈 130은 이미지 프레임에"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "서 관찰된 특성을 기반으로 식별된 폴립 수에 대한 요약을 생성할 수 있다. 시계열 분석 모듈 130은 로컬 및 글 로벌 시공간 처리 모듈 110과 120을 사용하여 입력 비디오의 이미지를 처리하여 생성된 정보를 집계할 수 있다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "요약 대시보드 1000은 또한 지능형 검출기 시스템 100이 식별한 관심 특징에 대한 시각적 설명을 포함할 수 있 다. 예를 들어, 절차의 비디오에서 선택된 프레임은 프레임 1092, 1094 및 1096에 나타난 것처럼 각 식별된 관 심 특징의 위치에 대한 녹색 경계 상자와 같은 표시로 증강될 수 있다. 프레임은 회맹판, 구멍, 삼방 주름과 같 은 대장의 다른 검사된 부분과 관련될 수 있으며, 이들 자체가 지능형 검출기 시스템 100의 사용자가 요청한 관 심 특징일 수 있다. 도 10의 예는 절차에 대한 정보를 단일 대시보드의 일부로 표시하지만, 의료 절차의 일부로"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "검사된 대장 또는 기타 장기의 각 부분에 대한 출력 요약이 포함된 여러 대시보드가 생성될 수 있다. 일부 구현 예에서 로컬 및 글로벌 시공간 처리 모듈 110과 120에 의해 생성된 다수의 벡터(예: 이미지 점수 벡터)로 받은 입력을 기반으로 결합된 점수 또는 값이 생성된다. 위에서 설명한 바와 같이, 관심 특징은 의료 카테고리나 병리와 관련될 수 있다. 지능형 검출기 시스템 100은 이미지에서 하나 이상의 의료 카테고리(즉, 하나 이상의 관심 특징)를 검출하라는 요청을 처리하도록 구현될 수 있다. 여러 관심 특징의 경우, 지능형 검출기 시스템 100의 구성 요소의 하나의 인스턴스가 각 의료 카테고리 또는 관심 특징에 대해 구현될 수 있다. 본 개시에서 이해할 수 있듯이, 지능형 검출기 시스템 100의 인스턴스 는 시스템의 속도 또는 처리량 요구 사항, 처리할 이미지의 양 및 기타 요구 사항에 따라 하드웨어, 펌웨어 및소프트웨어의 모든 조합으로 구현될 수 있다. 일부 구현예에서, 지능형 검출기 시스템 100의 단일 인스턴스는 각 이미지에 대해 여러 수치 값을 출력할 수 있 으며, 각각 의료 카테고리에 대한 것이다. 한 예시적인 구현예에서, 지능형 검출기 시스템 100에 의해 검출되는 병리에는 대장 점막의 폴립 검출이 포함될 수 있다. 또한, 예를 들어 지능형 검출기 시스템 100은 지능형 검출 기 시스템 100이 폴립을 검출하지 않은 입력 이미지 중 모든 이미지에 대해 수치 값(예: 0)을 출력하고 지능형 검출기가 적어도 하나의 폴립을 검출한 입력 이미지 중 모든 이미지에 대해 다른 수치 값(예: 1)을 출력할 수 있다. 일부 구현예에서, 수치 값은 범위나 척도에 대해 배열될 수 있고/있거나 폴립 또는 기타 관심 특징의 존 재 확률을 나타낼 수 있다. 입력 이미지의 소스는 영상 장치, 메모리 장치 및/또는 애플리케이션의 필요에 따라 다를 수 있다. 예를 들어, 지능형 검출기 시스템 100은 비디오 내시경 장치로부터 직접 비디오 피드를 처리하고 여기에 개시된 구현예와 일치하는 시스템에 의해 후속 처리되는 시간적으로 정렬된 입력 이미지를 수신하도록 구성될 수 있다. 추가 예 로, 지능형 검출기 시스템 100은 데이터베이스나 메모리 장치에서 입력 이미지를 수신하도록 구성될 수 있으며, 저장된 이미지는 시간적으로 정렬되어 있고 이전에 비디오 내시경 장치의 비디오 카메라나 캡슐 장치의 카메라 와 같은 영상 장치를 사용하여 캡처된 것이다. 지능형 검출기 시스템 100이 수신한 이미지는 처리 및 분석되어 폴립이나 병변과 같은 하나 이상의 유형의 관심 특징을 식별할 수 있다. 도 1a의 예시적인 시스템은 다양한 환경과 다양한 응용 분야에서 구현될 수 있다. 예를 들어, 캡처된 입력 이미 지는 로컬 데이터베이스나 메모리 장치에 저장되거나 클라우드 저장소와 같은 원격 저장 위치에서 네트워크를 통해 지능형 검출기 시스템 100에 의해 액세스되고 수신될 수 있다. 지능형 검출기 시스템 100은 또한 현재 의 료 절차의 스트리밍 비디오 피드를 처리하고 피드에서 수집된 입력 이미지를 처리하도록 구성될 수 있다(예: 전 처리 및 버퍼링을 통해). 또한, 지능형 검출기 시스템 100의 작동은 하나 이상의 조건에 따라 프로그래밍되거나 트리거될 수 있다. 예를 들어, 지능형 검출기 시스템 100은 입력을 수신하는 즉시(예: 비디오 피드를 통해 또는 메모리에서 저장된 입력 이미지 세트를 통해) 또는 사용자로부터 명령을 수신하는 즉시 입력 이미지를 분석하도 록 구성될 수 있다. 지능형 검출기 시스템 100의 출력도 원하는 대로 구성될 수 있다. 예를 들어, 이전에 논의 된 바와 같이 지능형 검출기 시스템 100은 하나 이상의 관심 특징에 대해 입력 이미지를 분석하고 처리된 이미 지에서 하나 이상의 관심 특징의 존재를 나타내는 보고서를 생성할 수 있다. 보고서는 전자 파일, 그래픽 디스 플레이 및/또는 데이터의 전자 전송의 형태를 취할 수 있다. 이해할 수 있듯이, 다른 출력 및 보고서 형식도 본 개시의 범위 내에 있다. 일부 구현예에서, 다양한 형식의 보고서가 미리 구성되어 지능형 검출기 시스템 100에 의해 생성된 값으로 템플릿을 채워 보고서를 생성하는 데 사용될 수 있다. 일부 구현예에서, 보고서는 전자 의 료 기록(EMR)과 같은 다른 보고 시스템에 통합되도록 형식이 지정된다. 보고서 형식은 다른 보고 시스템과의 통 합을 위해 XML이나 Excel과 같은 기계 판독 가능한 형식일 수 있다. 예를 들어, 지능형 검출기 시스템 100은 기록된 비디오나 이미지를 처리하고 처리된 이미지에서 관찰된 관심 특 징을 상세히 설명하는 완전히 자동화된 보고서 및/또는 기타 출력을 제공할 수 있다. 지능형 검출기 시스템 100 은 입력 이미지를 효율적이고 정확하게 처리하고 이미지 분석 및/또는 시공간 정보를 기반으로 관심 특징의 존 재에 대한 결정을 내리기 위해 인공 지능이나 기계 학습 구성 요소를 사용할 수 있다. 또한, 요청되거나 조사 중인 각 관심 특징에 대해 지능형 검출기 시스템 100은 이미지 내에서 그 존재를 추정하고 해당 특징의 존재 가 능성을 나타내는 정보와 함께 보고서나 기타 출력을 제공할 수 있으며, 절차 시작 또는 이미지 시퀀스로부터의 상대적 시간, 추정된 해부학적 위치, 지속 시간, 가장 중요한 이미지, 이러한 이미지 내의 위치 및/또는 발생 횟수와 같은 기타 세부 정보를 제공할 수 있다. 한 구현예에서, 지능형 검출기 시스템 100은 의사의 도움 없이 위장관 병리의 존재를 자동으로 결정하도록 구성 될 수 있다. 위에서 논의한 바와 같이, 입력 이미지는 다양한 방식으로 캡처되고 수신될 수 있으며 다양한 유형 의 영상 장치를 사용할 수 있다. 예를 들어, 비디오 내시경 장치나 캡슐 장치 또는 기타 의료 장치나 기타 영상 장치가 입력 이미지를 기록하고 제공할 수 있다. 입력 이미지는 실시간 비디오 피드의 일부이거나 로컬 또는 원 격 저장 위치(예: 로컬 데이터베이스 또는 클라우드 저장소)에서 수신된 저장된 이미지 세트의 일부일 수 있다. 지능형 검출기 시스템 100은 클리닉이나 병원의 절차 또는 서비스의 일부로 작동하거나 최종 사용자가 자가 진 단이나 원격 테스트를 할 수 있도록 온라인 또는 클라우드 서비스로 제공될 수 있다. 예를 들어, 검사 절차를 시작하기 위해 사용자는 캡슐 장치나 알약 카메라를 섭취할 수 있다. 캡슐 장치는 영상 장치를 포함할 수 있으며 절차 중에 사용자의 위장관 이미지를 스마트폰, 태블릿, 랩톱, 컴퓨터 또는 기타 장치 (예: 사용자 장치 170)로 무선 전송할 수 있다. 그런 다음 캡처된 이미지는 네트워크 연결을 통해데이터베이스, 클라우드 저장소 또는 기타 저장 장치(예: 이미지 소스 150)에 업로드될 수 있다. 지능형 검출기 시스템 100은 이미지 소스에서 입력 이미지를 수신하고 하나 이상의 요청된 관심 특징(예: 폴립 또는 병변)에 대해 이미지를 분석할 수 있다. 그런 다음 최종 보고서가 전자적으로 사용자 및/또는 의사에게 출력으로 제공될 수 있다. 보고서에는 관찰된 각 관심 특징에 대한 점수나 확률 지표 및/또는 기타 관련 정보 또는 의료 권장 사 항이 포함될 수 있다. 또한, 지능형 검출기 시스템 100은 관심 특징과 관련되고 관심 특징의 지표인 병리생리학 적 특성을 검출하고 존재하는 것으로 결정된 해당 특성에 대해 점수를 매길 수 있다. 이러한 특성의 예로는 출 혈, 염증, 궤양, 종양 조직 등이 있다. 또한, 검출된 관심 특징에 대한 응답으로 보고서에는 의료 지침에 기반 한 정보나 권장 사항이 포함될 수 있다. 예를 들어 의사와 상담하거나 추가 진단 검사를 받을 것을 권장하는 등 의 내용이 포함될 수 있다. 또한 의사에게 하나 이상의 조치가 권장될 수 있다(예: 생검 수행, 병변 제거, 장기 의 표면/점막 탐색/분석 등). 이는 지능형 검출기 시스템 100이 의료 절차와 실시간으로 또는 의료 절차 완료 후에 이미지를 분석한 결과를 기반으로 할 수 있다. 다른 예로, 지능형 검출기 시스템 100은 의사나 전문가가 의료 절차나 검사 중에 기록된 비디오 콘텐츠를 분석 하는 것을 도울 수 있다. 캡처된 이미지는 예를 들어 위 내시경, 대장 내시경 또는 소장 내시경 검사 중에 기록 된 비디오 콘텐츠의 일부일 수 있다. 지능형 검출기 시스템 100이 수행한 분석을 기반으로, 전체 비디오 녹화물 이 의사나 전문가에게 색상이 지정된 타임라인 막대와 함께 표시될 수 있으며, 여기서 다른 색상은 다른 관심 특징 및/또는 식별된 관심 특징에 대한 점수에 해당한다. 또 다른 예로, 의사, 전문가 또는 기타 개인은 지능형 검출기 시스템 100을 사용하여 원하는 관심 특징이 있는"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "이미지에 초점을 맞추고 관련 없는 이미지 프레임을 삭제하여 비디오 녹화 또는 이미지 세트의 요약을 생성할 수 있다. 지능형 검출기 시스템 100은 의사나 사용자가 검출을 위한 관심 특징을 조정하거나 선택할 수 있도록 구성될 수 있으며, 총 지속 시간 및/또는 선택된 관심 특징이 있는 프레임 시퀀스 전후의 프리셋 선행 및 후행"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "시간과 같은 기타 매개변수를 기반으로 각 요약의 지속 시간을 조정할 수 있다. 지능형 검출기 시스템 100은 또 한 요청된 관심 특징에 따라 모든 프레임 또는 가장 관련성 있는 프레임을 결합하도록 구성될 수 있다. 도 1a에 도시된 바와 같이, 지능형 검출기 시스템 100은 로컬 시공간 처리 모듈 110, 글로벌 시공간 처리 모듈 120, 시계열 분석 모듈 130 및 작업 관리자 140을 포함할 수 있다. 이러한 구성 요소는 하드웨어, 소프트웨어 및/또는 펌웨어의 적절한 조합을 통해 구현될 수 있다. 또한, 이러한 구성 요소의 수와 배열은 수정될 수 있으며 도 1a의 예시적인 구현예는 설명을 위해 제공된 것이 며 본 발명과 그 구현예의 범위를 제한하지 않는다는 점을 이해할 것이다. 이러한 구성 요소와 관련된 추가 예 시적인 특징과 세부 사항은 아래에 제공되며, 도 1b 및 도 3a-3c와 관련하여 설명된다. 도 1a의 예시적인 구현예를 다시 참조하면, 로컬 시공간 처리 모듈 110은 입력 비디오 또는 입력 이미지 세트의 부분 집합을 처리하여 로컬 관점을 제공하도록 구성될 수 있다. 로컬 시공간 처리 모듈 110은 이미지의 부분 집 합을 선택하고 이미지를 처리하여 하나 이상의 관심 특징과 관련된 특성의 결정된 존재를 기반으로 점수를 생성 할 수 있다. 예를 들어, 내시경 입력 비디오 V가 T개의 이미지 프레임 컬렉션을 포함한다고 가정하자. 특성은 지능형 검출기 시스템 100의 사용자가 요청한 관심 특징을 정의할 수 있다. 예를 들어, 특성에는 크기, 방향, 색상, 모양 등과 같은 물리적 및/또는 생물학적 측면이 포함될 수 있다. 특성에는 또한 비디오의 일부 또는 비 디오의 시간 기간을 식별하는 데이터와 같은 메타데이터가 포함될 수 있다. 예를 들어, 대장 내시경 절차 비디 오의 특성은 상행, 횡행 또는 하행과 같은 대장의 일부를 식별할 수 있다. 다른 예로, 특성은 내시경 절차 비디 오의 하나 이상의 부분과 관련될 수 있으며, 예를 들어 이미지의 움직임 양, 기구의 존재 또는 움직임이 감소된 세그먼트의 지속 시간 등이 있다. 콘텐츠를 정의하는 특성은 또한 의사, 임상의 또는 의료 절차를 수행하는 다 른 개인의 행동을 나타낼 수 있다. 예를 들어, 움직임이 없는 가장 긴 일시 중지가 있는 비디오 부분이나 장기 표면을 탐색하는 데 가장 많은 시간을 할애한 부분 등이 있다. 일부 구현예에서 특성은 관심 특징일 수 있다. 예를 들어, 대장 내시경 절차 비디오의 관심 특징과 특성은 상행, 횡행 또는 하행과 같은 대장의 일부일 수 있 다. 로컬 시공간 처리 모듈 110은 N개의 이미지 프레임의 순차적 배치 또는 부분 집합을 반복하여 전체 입력 비디오 를 청크 단위로 처리하도록 구성될 수 있다. 로컬 시공간 처리 모듈 110은 또한 각 이미지 프레임에서 관심 특 징의 결정된 특성을 나타내는 벡터 또는 품질 점수를 포함하는 출력을 제공하도록 구성될 수 있다. 일부 구현예 에서 로컬 시공간 처리 모듈 110은 각 이미지 프레임과 관련된 품질 값과 분할 맵을 출력할 수 있다. 로컬 시공 간 처리 모듈 110과 관련된 추가 예시적인 세부 사항은 도 3a 구현예를 참조하여 아래에 제공된다. 로컬 시공간 처리 모듈 110에 의해 처리되는 이미지 부분 집합에는 공유되거나 중첩되는 이미지가 포함될 수 있 다. 또한, 이미지 부분 집합의 크기나 배열은 하나 이상의 요인을 기반으로 정의되거나 제어될 수 있다. 예를 들어, 이미지 부분 집합의 크기나 용량은 의사나 시스템의 다른 사용자가 구성할 수 있다. 추가 예로, 로컬 시 공간 처리 모듈 110은 요청된 관심 특징을 기반으로 이미지 부분 집합의 크기나 용량이 동적으로 결정되도록 구 성될 수 있다. 또한 또는 대안적으로, 이미지 부분 집합의 크기는 요청된 관심 특징과 관련된 결정된 특성을 기 반으로 동적으로 결정될 수 있다. 글로벌 시공간 처리 모듈 120은 로컬 시공간 처리 모듈 110에 의해 분석된 모든 이미지 부분 집합을 처리하여 전역적 관점을 제공하도록 구성될 수 있다. 예를 들어, 글로벌 시공간 처리 모듈 120은 로컬 시공간 처리 모듈 110의 모든 출력을 한 번에 또는 함께 처리하여 전체 입력 비디오나 입력 이미지 세트를 처리할 수 있다. 또한, 글로벌 시공간 처리 모듈 120은 관심 특징과 관련된 특성의 벡터를 처리하여 각 이미지 프레임에 대한 수치 점 수를 포함하는 출력을 제공하도록 구성될 수 있다. 일부 구현예에서 글로벌 시공간 처리 모듈 120은 이미지와 벡터를 처리하고 각 이미지의 정제된 품질 점수와 분할 맵을 출력할 수 있다. 글로벌 시공간 처리 모듈 120과 관련된 추가 예시적인 세부 사항은 도 3b 구현예를 참조하여 아래에 제공된다. 시계열 분석 모듈 130은 로컬 시공간 처리 모듈 110에 의해 결정되고 글로벌 시공간 처리 모듈 120에 의해 정제 된 이미지에 대한 정보를 사용하여 지능형 검출기 시스템 100의 사용자가 요청한 하나 이상의 관심 특징의 존재 를 나타내는 수치 점수를 출력한다. 예를 들어, 시계열 분석 모듈 130은 로컬 시공간 처리 모듈 110에 의해 결 정된 관심 특징과 관련된 특성의 공간 및 시간 정보를 사용하여 입력 비디오나 이미지에 대해 시계열 분석을 수 행하도록 구성될 수 있다. 시계열 분석 모듈 130과 관련된 추가 예시적인 세부 사항은 도 3c 구현예를 참조하여 아래에 제공된다. 작업 관리자 140은 지능형 검출기 시스템 100의 사용자가 요청한 다양한 작업을 관리하는 데 도움을 줄 수 있다. 작업은 요청되거나 필요한 관심 특징 및/또는 관심 특징의 특성과 관련될 수 있다. 하나 이상의 특성과 관심 특징이 지능형 검출기 시스템 100에 의한 처리를 위한 각 작업의 일부일 수 있다. 작업 관리자 140은 입력 이미지 세트에서 여러 관심 특징을 검출하기 위한 작업을 관리하는 데 도움을 줄 수 있다. 작업 관리자 140은 지능형 검출기 시스템 100 구성 요소의 인스턴스 수(예: 로컬 시공간 처리 모듈 110, 글로벌 시공간 처리 모듈 120 및 시계열 분석 모듈 130)를 결정할 수 있다. 관심 특징을 검출하기 위한 여러 작업 요청을 처리하는 방법 에 대한 추가 예시적인 세부 사항은 아래 도 6 및 7 설명을 참조하여 제공된다. 지능형 검출기 시스템 100은 처리를 위해 네트워크 160을 통해 이미지 소스 150에서 입력 비디오나 이미지 세트 를 수신할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 의료 절차, 예를 들어 대장 내시경 검사를 수 행할 때 비디오를 캡처하는 데 사용되는 의료 기구나 시스템과 같은 다른 외부 장치에서 직접 입력 비디오를 수 신할 수 있다. 이미지 처리 후, 검출된 관심 특징에 대한 보고서는 네트워크 160을 통해 공유될 수 있다. 본 명 세서에 개시된 바와 같이, 보고서는 전자적으로 전송될 수 있으며 전자 파일, 디스플레이 및 데이터와 같은 다 양한 형태를 취할 수 있다. 일부 구현예에서 보고서는 파일로 전송되고/되거나 사용자 장치 170에 표시된다. 네 트워크 160은 시스템 요구 사항과 환경에 따라 다양한 형태를 취할 수 있다. 예를 들어, 네트워크 160은 인터넷, 유선 광역 통신망(WAN), 유선 근거리 통신망(LAN), 무선 WAN(예: WiMAX), 무선 LAN(예: IEEE 802.11 등), 메쉬 네트워크, 모바일/셀룰러 네트워크, 기업 또는 사설 데이터 네트워크, 저장 영역 네트워크, 공용 네 트워크를 사용하는 가상 사설 네트워크 및/또는 기타 유형의 네트워크 통신을 포함하거나 활용할 수 있다. 일부 구현예에서 네트워크 160은 온프레미스(예: LAN) 네트워크를 포함할 수 있는 반면, 다른 구현예에서 네트워크 160은 가상화, 원격 및/또는 클라우드 네트워크(예: AWS™Azure™, IBM Cloud™ 등)를 포함할 수 있다. 또한 네 트워크 160은 일부 구현예에서 하나 이상의 네트워크 아키텍처 유형의 구성 요소를 포함하는 온프레미스 및 가 상화, 원격 및/또는 클라우드 네트워크의 하이브리드일 수 있다. 사용자 장치 170은 입력 비디오나 이미지의 관심 특징과 관련된 요청을 지능형 검출기 시스템 100에 보내고 출 력(예: 보고서 또는 데이터)을 수신할 수 있다. 사용자 장치 170은 지시, 명령, 비디오 또는 이미지 세트 파일 다운로드 및/또는 저장 위치(예: 이미지 소스 150)에 대한 저장 링크를 통해 처리를 위해 지능형 검출기 시스템 100에 입력 비디오나 이미지를 제어하거나 직접 제공할 수 있다. 사용자 장치 170은 스마트폰, 랩톱, 태블릿, 컴퓨터 및/또는 기타 컴퓨팅 장치를 포함할 수 있다. 사용자 장치 170은 또한 처리를 위한 비디오나 이미지를 캡처하기 위한 영상 장치(예: 비디오 또는 디지털 카메라)를 포함할 수 있다. 캡슐 검사 절차의 경우, 예를 들 어 사용자 장치 170은 사용자가 섭취하는 알약 카메라 또는 유사한 장치를 포함할 수 있으며, 이는 입력 비디오 나 이미지가 캡처되어 지능형 검출기 시스템 100으로 직접 스트리밍되거나 이미지 소스 150에 저장된 후 네트워 크 160을 통해 시스템 100에 의해 다운로드 및 수신되도록 한다. 그런 다음 이미지 처리 결과가 네트워크 160을통해 지능형 검출기 시스템 100에서 사용자 장치 170으로 출력으로 제공된다. 의사 장치 180도 입력 비디오나 이미지의 관심 특징과 관련된 요청을 지능형 검출기 시스템 100에 보내고 출력 (예: 보고서 또는 데이터)을 수신하는 데 사용될 수 있다. 사용자 장치 170과 유사하게, 의사 장치 180은 지시, 명령, 비디오 또는 이미지 세트 파일 다운로드 및/또는 저장 위치(예: 이미지 소스 150)에 대한 저장 링크를 통 해 처리를 위해 지능형 검출기 시스템 100에 입력 비디오나 이미지를 제어하거나 직접 제공할 수 있다. 의사 장 치 180은 스마트폰, 랩톱, 태블릿, 컴퓨터 및/또는 기타 컴퓨팅 장치를 포함할 수 있다. 의사 장치 180은 또한 처리를 위한 비디오나 이미지를 캡처하기 위한 영상 장치(예: 비디오 또는 디지털 카메라)를 포함할 수 있다. 비디오 내시경 검사의 경우, 예를 들어 의사 장치 180은 환자 검사 중 이미지를 캡처하는 영상 장치가 있는 대 장 내시경 프로브 또는 유사한 장치를 포함할 수 있다. 캡처된 비디오는 지능형 검출기 시스템 100에 입력 비디 오로 스트리밍되거나 이미지 소스 150에 저장된 후 네트워크 160을 통해 시스템 100에 의해 다운로드 및 수신될 수 있다. 일부 구현예에서 의사 장치 180은 관심 특성이 있는 이미지 프레임의 추가 검토를 위한 알림을 받을 수 있다. 그런 다음 이미지 처리 결과가 네트워크 160을 통해 지능형 검출기 시스템 100에서 사용자 장치 170으 로 출력(예: 파일 또는 디지털 디스플레이 형태의 전자 보고서 또는 데이터)으로 제공된다. 이미지 소스 150은 지능형 검출기 시스템 100에 대한 입력 비디오나 이미지의 저장 위치 또는 기타 소스를 포함 할 수 있다. 이미지 소스 150은 하드웨어, 소프트웨어 및 펌웨어의 적절한 조합을 포함할 수 있다. 예를 들어, 이미지 소스 150은 컴퓨팅 장치, 서버, 데이터베이스, 메모리 장치, 네트워크 통신 하드웨어 및/또는 기타 장치 의 조합을 포함할 수 있다. 예를 들어, 이미지 소스 150은 사용자 장치 170 및 의사 장치 180에서 수신한 입력 비디오 또는 이미지 세트를 저장하기 위한 데이터베이스, 메모리 또는 저장소(예: 도 2의 저장소 220)를 포함할 수 있다. 이미지 소스 150 저장소는 CPU(예: 도 2의 프로세서 230)를 사용하여 액세스되는 파일 저장소 및/또는 데이터베이스를 포함할 수 있다. 추가 예로, 이미지 소스 150은 네트워크 160을 통해 접근 가능한 AMAZON™ S3, Azure™ Storage, GOOGLE™ Cloud Storage와 같은 클라우드 저장소를 포함할 수 있다. 도 1a의 예시적인 시스템에서 이미지 소스 150, 사용자 장치 170 및 의사 장치 180은 서로 로컬 또는 원격일 수 있으며 유선 또는 무선 통신을 통해 서로 통신할 수 있으며, 여기에는 네트워크 통신이 포함된다. 이 장치들은 또한 시스템 구현의 응용 분야와 요구 사항에 따라 지능형 검출기 네트워크 100에 대해 로컬 또는 원격일 수 있 다. 또한 이미지 소스 150, 사용자 장치 170 및 의사 장치 180이 도 1a에서 지능형 검출기 시스템 100과 별도로 표시되어 있지만, 이러한 장치 중 하나 이상이 시스템 100에 대해 로컬이거나 시스템 100의 일부로 제공될 수 있다. 또한 일부 또는 일부 네트워크 160이 시스템 100에 대해 로컬이거나 시스템 100의 일부일 수 있다. 또한 도 1a의 구성 요소 및 장치의 수와 배열은 설명을 위해 제공된 것이며 본 발명이나 그 개시된 구현예를 제한하 려는 의도가 아님을 이해할 것이다. 본 개시의 구현예가 의료 영상 분석 및 내시경 검사와 관련하여 여기에 일반적으로 설명되어 있지만, 구현예는 위 내시경, 대장 내시경 및 소장 내시경과 같은 다른 의료 영상 절차에 적용될 수 있음을 이해할 것이다. 또한 본 개시의 구현예는 LIDAR, 감시, 자동 조종 및 기타 영상 시스템을 위한 또는 이를 포함하는 다른 이미지 캡처 및 분석 환경과 시스템에 대해 구현될 수 있다. 본 개시의 한 측면에 따르면, 입력 비디오나 이미지 세트를 지능적으로 처리하고 관심 특징의 존재와 이와 관련 된 특성을 결정하기 위한 컴퓨터 구현 시스템이 제공된다. 본 명세서에서 추가로 개시된 바와 같이, 시스템(예: 지능형 검출기 시스템 100)은 명령어를 저장하도록 구성된 적어도 하나의 메모리(예: ROM, RAM, 로컬 메모리, 네트워크 메모리 등)와 명령어를 실행하도록 구성된 적어도 하나의 프로세서(예: 프로세서 230)를 포함할 수 있 다(예: 도 1 및 2 참조). 적어도 하나의 프로세서를 사용하여 시스템은 예를 들어 내시경, 위 내시경, 대장 내 시경 또는 소장 내시경 검사 중에 사용되는 의료 영상 시스템에 의해 캡처된 입력 비디오나 이미지 세트를 처리 할 수 있다. 또한 또는 대안적으로, 이미지 프레임은 위장관 장기 또는 기타 장기나 인체 조직 영역의 의료 영 상과 같은 의료 영상을 포함할 수 있다. 본 명세서에서 사용되는 \"이미지 프레임\" 또는 \"이미지\"라는 용어는 영상 장치에 의해 캡처된 장면 또는 시야의 디지털 표현을 의미한다. 디지털 표현은 Joint Photographic Experts Group(JPEG) 형식, Graphics Interchange Format(GIF), 비트맵 형식, Scalable Vector Graphics(SVG) 형식, Encapsulated PostScript(EPS) 형식 또는 이 와 유사한 적절한 형식으로 인코딩될 수 있다. 마찬가지로 \"비디오\"라는 용어는 일련의 이미지로 구성된 관심 장면이나 영역의 디지털 표현을 의미한다. 비디오의 디지털 표현은 Moving Picture Experts Group(MPEG) 형식, 플래시 비디오 형식, Audio Video Interleave(AVI) 형식 또는 이와 유사한 적절한 형식으로 인코딩될 수 있다. 일부 구현예에서 입력 비디오에 대한 이미지 시퀀스는 오디오와 쌍을 이룰 수 있다. 본 개시에서 이해할 수 있듯이, 본 발명의 구현예는 순차적으로 또는 시간적으로 정렬된 이미지 프레임이 있는 입력 비디오를 처리하는 것으로 제한되지 않으며 순차적으로 또는 시간적으로 정렬되어 캡처된 스트리밍되거나 저장된 이미지 세트도 처 리할 수 있다. 따라서 \"입력 비디오\" 및 \"이미지 세트\"라는 용어는 상호 교환 가능한 것으로 간주되어야 하며 본 개시의 범위를 제한하지 않는다. 본 명세서에 개시된 바와 같이, 이미지 프레임 또는 이미지는 관심 특징(즉, 이상 또는 기타 관심 객체)의 표현 을 포함할 수 있다. 예를 들어, 관심 특징은 인체 조직의 이상을 포함할 수 있다. 비의료 절차에 대한 다른 구 현예에서 관심 특징은 차량, 사람 또는 기타 엔티티와 같은 객체를 포함할 수 있다. 본 개시에 따르면, \"이상\"은 인체 조직의 형성 또는 형성, 한 유형의 세포에서 다른 유형의 세포로의 인체 조직 변화, 및/또는 인체 조직이 예상되는 위치에서의 인체 조직 부재를 포함할 수 있다. 예를 들어, 종양이나 기타 조직 성장은 예상보다 더 많은 세포가 존재하기 때문에 이상을 포함할 수 있다. 마찬가지로, 멍이나 기타 세포 유형의 변화는 혈액 세포가 예상 위치(즉, 모세혈관 외부) 이외의 위치에 존재하기 때문에 이상을 포함할 수 있 다. 마찬가지로, 인체 조직의 함몰은 예상 위치에 세포가 존재하지 않아 함몰이 발생하므로 이상을 포함할 수 있다. 일부 구현예에서 이상은 병변을 포함할 수 있다. 병변은 위장관 점막의 병변을 포함할 수 있다. 병변은 조직학 적으로 분류되거나(예: 협대역 영상 국제 대장 내시경(NICE) 또는 비엔나 분류에 따라), 형태학적으로 분류되거 나(예: 파리 분류에 따라), 및/또는 구조적으로 분류될 수 있다(예: 톱니모양 또는 비톱니모양으로). 파리 분류 에는 용종형 및 비용종형 병변이 포함된다. 용종형 병변은 돌출, 유경성 및 돌출, 또는 무경성 병변을 포함할 수 있다. 비용종형 병변은 표면 융기, 평편, 표면 얕은 함몰 또는 함몰 병변을 포함할 수 있다. 관심 특징으로 서의 이상 검출과 관련하여, 톱니모양 병변은 무경성 톱니모양 선종(SSA); 전통적 톱니모양 선종(TSA); 과증식 성 용종(HP); 섬유모세포 용종(FP); 또는 혼합 용종(MP)을 포함할 수 있다. NICE 분류 시스템에 따르면, 이상은 다음과 같이 세 가지 유형으로 나뉜다: (유형 1) 무경성 톱니모양 용종 또는 과증식성 용종; (유형 2) 일반적인 선종; 및 (유형 3) 깊은 점막하 침윤이 있는 암. 비엔나 분류에 따르면, 이상은 다음과 같이 다섯 가지 범주로 나뉜다: (범주 1) 종양/이형성 음성; (범주 2) 종양/이형성 불확실; (범주 3) 비침윤성 저등급 종양(저등급 선 종/이형성); (범주 4) 고등급 점막 종양(고등급 선종/이형성, 비침윤성 암종(상피내암), 또는 침윤성 암종 의심); 및 (범주 5) 침윤성 종양, 점막내 암종, 점막하 암종 또는 이와 유사한 것. 이러한 예와 다른 유형의 이 상은 본 개시의 범위 내에 있다. 또한 지능형 검출기 시스템 100이 의료 및 비의료 절차를 포함한 다른 유형의 관심 특징을 검출하도록 구성될 수 있음을 이해할 것이다. 도 1b는 본 개시의 구현예와 일치하는 실시간 비디오를 처리하기 위해 도 1a의 지능형 검출기 시스템 100을 구 현하는 예시적인 컴퓨터 구현 시스템의 개략적 표현이다. 도 1b에 도시된 바와 같이, 시스템 190은 영상 장치 192와 제어 신호를 영상 장치 192로 보내 영상 장치 192를 작동 및 제어하는 운영자 191을 포함한다. 예를 들어, 비디오 피드가 의료 비디오를 포함하는 구현예에서 운영자 191은 의사 또는 다른 의료 전문가일 수 있다. 영상 장치 192는 내시경 영상 장치와 같은 의료 영상 장치 또는 인체/조직/장기 또는 그 일부의 비디오나 하나 이상의 이미지를 생성하는 기타 의료 영상 장치를 포함할 수 있다. 영상 장치 193은 의사 장치 180(도 1a에 도 시됨)의 일부일 수 있으며, 이미지 소스 150에 저장되는 비디오를 생성한다. 운영자 191은 특히 영상 장치 192 의 캡처 또는 프레임 속도 및/또는 영상 장치 192의 움직임이나 내비게이션을 제어함으로써 영상 장치 192를 제 어할 수 있다(예: 환자나 개인의 인체를 통해 또는 이에 대해 상대적으로). 일부 구현예에서 영상 장치 192는 인체의 공동을 통해 삽입되는 내시경 영상 장치와는 달리 삼킬 수 있는 캡슐 장치나 다른 형태의 캡슐 내시경 장치를 포함할 수 있다. 도 1b의 예에서, 영상 장치 192는 캡처된 비디오를 복수의 이미지 프레임으로 컴퓨팅 장치 193에 직접 전송할 수 있다. 컴퓨팅 장치 193은 위에서 설명하고 본 명세서에 설명된 바와 같이 비디오나 이미지를 처리하기 위한 메모리(하나 이상의 버퍼 포함)와 하나 이상의 프로세서를 포함할 수 있다(예: 도 2 참조). 일부 구현예에서 하 나 이상의 프로세서는 컴퓨팅 장치 193의 일부가 아닌 별도의 구성 요소로 구현될 수 있지만 이와 네트워크(예: 도 1a의 네트워크 160) 통신한다. 일부 구현예에서 컴퓨팅 장치 193의 하나 이상의 프로세서는 하나 이상의 네 트워크(예: 훈련된 신경망)를 구현할 수 있다. 신경망의 예로는 객체 검출 네트워크, 분류 검출 네트워크, 위치 검출 네트워크, 크기 검출 네트워크 또는 프레임 품질 검출 네트워크가 있으며, 이는 본 명세서에서 추가로 설 명된다. 컴퓨팅 장치 193은 영상 장치 192에서 복수의 이미지 프레임을 직접 수신하고 처리할 수 있다. 일부 구 현예에서 컴퓨팅 장치 193은 사전 및/또는 병렬 처리 및 버퍼링을 사용하여 비디오나 이미지를 실시간으로 처리 할 수 있으며, 이러한 처리 및 버퍼링 수준은 수신된 비디오나 이미지의 프레임 속도와 컴퓨팅 장치 193의 하나 이상의 프로세서나 모듈의 처리 속도에 따라 달라진다. 이해할 수 있듯이, 프레임 속도에 비해 잘 일치하는 처리 및 버퍼링 능력을 통해 실시간 처리 및 출력이 가능해진다. 또한 일부 구현예에서 하나 이상의 증강된 비디 오를 출력으로 생성하기 위한 제어나 정보 신호가 컴퓨팅 장치 193과 운영자 191 사이에서 교환될 수 있으며, 증강된 비디오에는 원본 비디오와 함께 식별된 관심 특징 및 의료 절차를 수행하는 의사나 운영자를 돕기 위해 컴퓨팅 장치 193이 생성한 기타 피드백에 대한 정보를 제공하는 오버레이(그래픽, 기호, 텍스트 등)가 추가된다. 교환된 제어나 정보 신호와 관련하여, 이들은 영상 장치 192를 통해 또는 운영자 191에서 컴퓨팅 장 치 193으로 직접 데이터로 통신될 수 있다. 제어 및 정보 신호의 예로는 본 명세서에 설명된 바와 같이 객체 검 출 네트워크, 분류 검출 네트워크, 위치 검출 네트워크, 크기 검출 네트워크 또는 프레임 품질 검출 네트워크와 같은 컴퓨팅 장치 193의 구성 요소를 제어하기 위한 신호가 있다. 도 1b의 예에서 컴퓨팅 장치 193은 하나 이상의 모듈(예: 지능형 검출기 시스템 100의 모듈 110-140)을 사용하 여 영상 장치 192에서 수신한 비디오를 처리 및 증강한 다음 증강된 비디오를 디스플레이 장치 194로 전송할 수 있다. 증강된 비디오는 예를 들어 내시경 또는 대장 내시경과 같은 의료 절차 중 또는 끝에 식별된 용종 및 운 영자 191이 취한 조치에 대한 실시간 피드백 및 보고서를 제공할 수 있다. 비디오 증강 또는 수정은 비디오 프 레임 내에 또는 이와 함께 하나 이상의 오버레이, 영숫자 문자, 텍스트, 설명, 도형, 도표, 이미지, 애니메이션 이미지 및/또는 기타 적절한 그래픽 표현을 제공하는 것을 포함할 수 있다. 비디오 증강은 분류, 크기, 수행된 조치 및/또는 위치 정보와 같은 관심 특징과 관련된 정보를 제공할 수 있다. 또한 또는 대안적으로, 비디오 증 강은 의료 지침에 따라 컴퓨팅 장치 193이 식별한 하나 이상의 권장 조치와 관련된 정보를 제공할 수 있다. 의 사나 운영자를 돕고 오류를 줄이기 위해, 컴퓨팅 장치 193이 생성하는 정보, 보고서 및 데이터의 범위와 유형이 위에서 지능형 검출기 시스템 100에 대해 설명한 예와 유사할 수 있음을 이해할 것이다. 따라서 시스템 100에 대해 위에 제공된 예를 참조한다. 도 1b에 추가로 도시된 바와 같이, 컴퓨팅 장치 193은 또한 영상 장치 192에서 원본 비증강 비디오를 디스플레 이 장치 194로 직접 중계하도록 구성될 수 있다. 예를 들어, 컴퓨팅 장치 193은 오버레이나 기타 증강이 생성되 지 않거나 영상 장치 192가 꺼져 있는 경우와 같은 미리 정의된 조건에서 직접 중계를 수행할 수 있다. 일부 구 현예에서 운영자 191이 컴퓨팅 장치 193에 제어 신호의 일부로 그렇게 하라는 명령을 전송하면 컴퓨팅 장치 193 이 직접 중계를 수행할 수 있다. 운영자 191의 명령은 운영자 장치 및/또는 입력 장치(도시되지 않음)에 포함된 버튼 및/또는 키의 조작에 의해 생성될 수 있으며, 예를 들어 마우스 클릭, 커서 호버, 마우스오버, 버튼 누름, 키보드 입력, 음성 명령, 가상 또는 증강 현실에서 수행된 상호 작용 또는 기타 입력이 있다. 비디오를 증강하기 위해 컴퓨팅 장치 193은 영상 장치 192에서 비디오를 처리하고 디스플레이 장치 194로 보낼 수정된 비디오 스트림을 생성할 수 있다. 수정된 비디오는 디스플레이 장치 194를 통해 운영자에게 표시될 증강 정보와 함께 원본 이미지 프레임을 포함할 수 있다. 디스플레이 장치 194는 LCD, LED 또는 OLED 디스플레이, 증 강 현실 디스플레이 또는 가상 현실 디스플레이와 같이 비디오 또는 수정된 비디오를 표시하기 위한 적절한 디 스플레이나 유사한 하드웨어를 포함할 수 있다. 도 2는 도 1a의 예시적인 시스템 구현 및 본 개시의 다른 구현예와 관련하여 사용될 수 있는 예시적인 컴퓨팅 장치 200을 도시한다. 컴퓨팅 장치 200은 도 1a의 예시적인 시스템의 하나 이상의 구성 요소 구현(예: 시스템 100 및 장치 150, 170, 180 포함)과 관련하여 사용될 수 있다. 일부 구현예에서 컴퓨팅 장치 200은 입력 비디오 와 이미지를 수신하고 처리하기 위한 클라우드 컴퓨팅 시스템, 서버 및/또는 기타 적절한 구성 요소와 같은 여 러 하위 시스템을 포함할 수 있다. 도 2에 도시된 바와 같이, 컴퓨팅 장치 200은 하나 이상의 프로세서 230을 포함할 수 있으며, 여기에는 예를 들 어 위에서 언급한 바와 같이 애플리케이션별 집적 회로(ASIC), 마이크로칩, 마이크로컨트롤러, 마이크로프로세 서, 중앙 처리 장치(CPU)의 전체 또는 일부, 그래픽 처리 장치(GPU), 디지털 신호 처리기(DSP), 현장 프로그래 밍 가능 게이트 어레이(FPGA), 서버, 가상 서버 또는 명령어를 실행하거나 논리 연산을 수행하기에 적합한 기타 회로를 포함하는 하나 이상의 집적 회로(IC)가 포함될 수 있다. 일부 구현예에서 프로세서 230은 하나 이상의 프로세서로 구현된 더 큰 처리 장치의 구성 요소를 포함하거나 그 구성 요소일 수 있다. 하나 이상의 프로세서 230은 범용 마이크로프로세서, 마이크로컨트롤러, 디지털 신호 처리기(DSP), 현장 프로그래밍 가능 게이트 어레 이(FPGA), 프로그래밍 가능 논리 장치(PLD), 컨트롤러, 상태 기계, 게이트 논리, 개별 하드웨어 구성 요소, 전 용 하드웨어 유한 상태 기계 또는 데이터나 정보의 계산이나 기타 조작을 수행할 수 있는 기타 적절한 엔티티의 모든 조합으로 구현될 수 있다. 도 2에 추가로 도시된 바와 같이, 프로세서 230은 버스 또는 네트워크 250을 통해 메모리 240과 통신 연결될 수 있다. 버스 또는 네트워크 250은 데이터 및 기타 형태의 정보를 통신하도록 조정될 수 있다. 메모리 240은 프로세서 230에 의해 실행될 때 여기에 상세히 설명된 동작 및 방법을 수행하는 명령어를 포함하는 메모리 부분 245 를 포함할 수 있다. 메모리 240은 또한 프로세서 230의 작업 메모리, 임시 저장소 및 기타 메모리나 저장소 역 할로 사용될 수 있다. 예를 들어, 메모리 240은 랜덤 액세스 메모리(RAM)와 같은 휘발성 메모리이거나 플래시 메모리와 같은 비휘발성 메모리(NVM)일 수 있지만 이에 국한되지 않는다. 프로세서 230은 또한 버스 또는 네트워크 250을 통해 하나 이상의 I/O 장치 210과 통신 연결될 수 있다. I/O 장 치 210은 키보드, 마우스, 디스플레이 장치 등을 포함한 모든 유형의 입력 및/또는 출력 장치나 주변 장치를 포 함할 수 있다. I/O 장치 210은 네트워크 250을 통해 프로세서 230과의 연결을 지원하기 위한 하나 이상의 네트 워크 인터페이스 카드, API, 데이터 포트 및/또는 기타 구성 요소를 포함할 수 있다. 도 2에 추가로 도시된 바와 같이, 프로세서 230 및 컴퓨팅 장치 200의 다른 구성 요소(210, 240)는 데이터베이 스 또는 저장소 220과 통신 연결될 수 있다. 저장소 220은 구성된 형식, 구조 또는 파일 세트로 전자적으로 데 이터(예: 입력 비디오 또는 이미지 세트와 보고서 및 기타 출력 데이터)를 저장할 수 있다. 저장소 220은 데이 터 저장 및 검색을 용이하게 하기 위한 데이터베이스 관리 시스템을 포함할 수 있다. 도 2에 단일 장치로 도시 되어 있지만, 저장소 220은 동일 위치에 있거나 분산된 여러 데이터베이스나 저장 장치를 포함할 수 있음을 이 해해야 한다. 일부 구현예에서 저장소 220은 전체 또는 일부가 클라우드 저장소와 같은 원격 네트워크의 일부로 구현될 수 있다. 프로세서 230 및/또는 메모리 240은 또한 소프트웨어나 명령어 세트를 저장하기 위한 기계 판독 가능 매체를 포 함할 수 있다. 여기서 사용되는 \"소프트웨어\"라는 용어는 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨 어 설명 언어 또는 기타 용어로 지칭되는지 여부와 관계없이 모든 유형의 명령어를 광범위하게 지칭한다. 명령 어에는 코드(예: 소스 코드 형식, 이진 코드 형식, 실행 가능 코드 형식 또는 코드의 기타 적절한 형식)가 포함 될 수 있다. 명령어는 하나 이상의 프로세서 230에 의해 실행될 때 본 명세서에 추가로 상세히 설명된 다양한 동작과 기능을 수행하게 할 수 있다. 컴퓨팅 장치 200의 구현은 도 2에 도시된 예시적인 구현예로 제한되지 않는다. 구성 요소(210, 220, 230, 240) 의 수와 배열은 수정되고 재배열될 수 있다. 또한 도 2에 도시되지 않았지만 컴퓨팅 장치 200은 인터넷, 근거리 통신망, 광역 통신망, 도시권 통신망 및 컴퓨팅 아키텍처의 요소 간 통신을 가능하게 하는 기타 네트워크를 포 함한 다른 네트워크와 전자 통신할 수 있다. 또한 컴퓨팅 장치 200은 저장소 220뿐만 아니라 네트워크나 기타 데이터베이스에서 여기에 설명된 데이터나 기타 정보를 검색할 수 있다. 또한 컴퓨팅 장치 200은 여기에 설명된 신경망 및 기타 모듈을 구현하는 데 사용되는 하나 이상의 기계 학습 모델을 포함할 수 있으며 기계 학습 모델 의 가중치나 매개변수, 훈련 정보나 훈련 피드백 및/또는 여기에 설명된 기타 데이터와 정보를 검색하거나 수신 할 수 있다. 도 3a는 본 개시의 구현예와 일치하는 예시적인 로컬 시공간 처리 모듈의 블록도이다. 도 3a의 구현예는 도 1a 의 예시적인 지능형 검출기 시스템 100의 로컬 시공간 처리 모듈 110이나 도 1b의 컴퓨팅 장치 193과 같은 다른 컴퓨터 구현 시스템을 구현하는 데 사용될 수 있다. 도 3a에 도시된 바와 같이, 로컬 시공간 처리 모듈 110은 샘플러 311, 인코더 312, 순환 신경망(RNN) 313, 시간 합성곱 네트워크(TCN) 314, 품질 네트워크 315 및 분할 네트워크 316을 포함한 여러 구성 요소를 포함한다. 이러한 구성 요소는 하드웨어, 소프트웨어 및 펌웨어의 적 절한 조합으로 구현될 수 있으며, 이미지의 부분 집합을 선택하고 처리하는 데 사용된다. 로컬 시공간 처리 모 듈 110은 N개의 이미지 프레임(N>=1)을 입력으로 사용하여 전체 입력 비디오나 이미지 세트(T개의 이미지 프레 임 포함)에 다양한 네트워크를 반복적으로 적용할 수 있다. 이러한 이미지 프레임은 연속적이거나 입력 비디오 나 이미지 세트에서 고정 속도로 샘플링될 수 있다. 샘플러 311은 로컬 시공간 처리 모듈 110의 다른 구성 요소가 처리할 이미지 프레임을 선택할 수 있다. 일부 구 현예에서 샘플러 311은 입력 비디오나 이미지 세트를 설정된 기간 동안 버퍼링하고 버퍼의 이미지 프레임을 모 듈 110이 처리할 이미지 부분 집합으로 추출할 수 있다. 일부 구현예에서 샘플러 311은 로컬 시공간 처리 모듈 110이 처리할 이미지 부분 집합의 프레임 수나 크기를 구성할 수 있다. 예를 들어, 샘플러 311은 처리할 이미지 부분 집합의 프레임 수나 크기를 설정하거나 조정하는 사용자 입력을 수신하도록 구성될 수 있다. 또한 또는 대 안적으로, 샘플러 311은 처리를 위해 요청된 관심 특징 및/또는 관심 특징과 관련된 특성과 같은 다른 요인에 기반하여 이미지 프레임 수나 이미지 부분 집합의 크기를 자동으로 선택하도록 구성될 수 있다. 일부 구현예에 서 샘플링된 이미지의 양이나 크기는 비디오의 프레임 속도(24, 30, 60, 120 FPS)를 기반으로 할 수 있다. 예를 들어, 샘플러 311은 지능형 검출기 시스템 100이 수신한 실시간 비디오 스트림을 주기적으로 버퍼링하여 설정된 기간 동안 버퍼링된 비디오에서 이미지를 추출할 수 있다. 추가 예로, 알약 카메라나 다른 영상 장치에서 이미지 스트림이 버퍼링될 수 있으며 시스템 100이 처리할 이미지가 버퍼에서 추출될 수 있다. 일부 구현예에서 샘 플러 311은 비디오 품질, 비디오 길이, 요청된 관심 특징과 관련된 특성 및/또는 관심 특징과 같은 다른 요인에 기반하여 선택적으로 이미지를 샘플링할 수 있다. 일부 구현예에서 샘플러 311은 지능형 검출기 시스템 100의 사용자가 요청한 작업을 수행하는 데 관여하는 로컬 시공간 처리 모듈 110의 구성 요소를 기반으로 이미지 프레 임을 샘플링할 수 있다. 예를 들어, 3D 인코더 네트워크를 사용하는 인코더 312는 인코딩할 콘텐츠의 3차원 구 조를 생성하기 위해 여러 이미지가 필요할 수 있다. 인코더 312는 지능형 검출기 시스템 100의 사용자가 요청한 작업의 일부인 각 관심 특징과 관련된 특성의 존재 를 결정할 수 있다. 이미지 분석을 위해 인코더 312는 훈련된 합성곱 신경망을 사용하여 구현될 수 있다. 지능 형 검출기 시스템 100은 인코더 312로 2D 인코더와 비로컬 층을 포함하는 3D 인코더를 포함할 수 있다. 인코더 312는 여러 합성곱 잔차 층과 완전 연결 층으로 구성될 수 있다. 검출할 특성과 관심 특징에 따라 인코더 312는 2D 또는 3D 합성곱 인코더를 선택할 수 있다. 인코더 312는 이미지 프레임에서 요청된 관심 특징을 검출하는 데 필요한 특성을 검출하도록 훈련될 수 있다. 본 명세서에 개시된 바와 같이, 지능형 검출기 시스템 100은 인코더 312를 사용하여 이미지를 처리하고 관심 특징과 관련된 바람직한 특성을 검출할 수 있다. 지능형 검출기 시스템 100은 인코더 312의 훈련된 네트워크와 관심 특징의 과거 결정을 기반으로 바람직한 특성을 결정할 수 있다. 도 3a에 도시된 바와 같이, 로컬 시공간 처리 모듈 110은 또한 순환 신경망(RNN) 313을 갖추고 있을 수 있다. RNN 313은 인코더 312와 함께 작동하여 관심 특징과 관련된 바람직한 특성의 존재를 결정할 수 있다. 일부 구현 예에서 시간 합성곱 네트워크(TCN) 314도 입력 비디오의 각 이미지 프레임에서 이러한 특성을 검출하는 데 도움 을 줄 수 있다. TCN은 소스(예: 도 1a의 이미지 소스 150 또는 도 1b의 영상 장치 192)에서 입력 비디오의 프레 임인 시간적으로 정렬된 이미지 세트와 같은 이미지 시퀀스를 처리할 수 있는 특수한 합성곱 신경망이다. TCN은 로컬 처리 모듈 110에 의해 처리되도록 버퍼링된 입력 비디오의 모든 이미지 프레임의 부분 집합이나 글로벌 처 리 모듈 120에 의해 처리된 입력 비디오의 모든 이미지에서 작동할 수 있다. TCN은 완전 연결 합성곱 네트워크 에서 인과적 합성곱을 사용하여 순차적 데이터를 처리할 수 있다. RNN 313은 이미지 프레임에서 시공간 정보를 결정하는 데 사용되는 내부 피드백 연결과 내부 메모리 상태를 가 진 인공 신경망이다. 일부 구현예에서 RNN 313은 샘플러 311에 의해 선택된 버퍼링된 이미지 프레임에서 공간적 으로 및/또는 시간적으로 떨어진 시공간 정보를 집계하는 능력을 향상시키기 위해 로컬 층을 포함할 수 있다. RNN 313은 요청된 관심 특징과 관련된 각 바람직한 특성에 대해 0과 1 사이의 점수를 연관시키도록 구성될 수 있다. 점수는 이미지에서 바람직한 특성의 존재 가능성을 나타내며, 0은 가능성이 가장 낮고 1은 최대 가능성을 나타낸다. 도 3a에 도시된 바와 같이, 로컬 시공간 처리 모듈 110은 품질 네트워크 315 및 분할 네트워크 316과 같은 추가 구성 요소를 포함하여 처리된 이미지에서 관심 특징을 검출하는 데 필요한 특성의 식별을 더욱 지원할 수 있다. 예를 들어, 품질 네트워크 315는 이미지 프레임에 할당된 최종 점수를 개선하는 여러 합성곱 층과 여러 완전 연 결 층으로 구성된 신경망으로 구현될 수 있다. 예를 들어, 품질 네트워크 315는 특성 점수가 낮은 이미지 프레 임을 필터링할 수 있다. 품질 네트워크 315는 또한 각 이미지 프레임에 대해 결정된 특성을 기반으로 특징 벡터 를 생성할 수 있다. 각 특징 벡터는 이미지 프레임 품질을 나타내는 서수 [0, R]로 표현된 품질 점수를 제공할 수 있으며, 0은 최소 품질, R은 최대 품질을 나타낸다. 품질 네트워크 315는 이미지에서 검출되지 않은 특성에 대해 자동으로 품질 점수 0을 설정할 수 있다. 분할 네트워크 316은 이미지를 처리하여 각 입력 이미지에 대해 관심 특징과 관련된 특성을 포함하는 이미지의 세그먼트를 추출하기 위한 분할 마스크를 계산할 수 있다. 분할 마스크는 입력 이미지와 동일하거나 더 낮은 해 상도를 가진 픽셀 단위 이진 마스크일 수 있다. 분할 네트워크 316은 여러 합성곱 잔차 층과 여러 건너뛰기 연 결을 포함하는 심층 합성곱 신경망으로 구현될 수 있다. 분할 네트워크에 포함된 층의 수와 유형은 특성이나 요 청된 관심 특징을 기반으로 할 수 있다. 일부 구현예에서 단일 모델과 여러 층이 인코더 312와 분할 네트워크 316의 작업을 처리할 수 있다. 예를 들어, 단일 모델은 ResNet 인코더가 있는 U-Net 모델일 수 있다. 예를 들어, 분할 네트워크 316은 W x H 차원의 이미지를 입력으로 받아 W' x H' 차원의 행렬로 표현된 분할 마 스크를 반환할 수 있으며, 여기서 W'는 W 이하이고 H'는 H 이하이다. 출력 행렬의 각 값은 특정 이미지 프레임 좌표가 요청된 관심 특징과 관련된 특성을 포함할 확률을 나타낸다. 일부 구현예에서 지능형 검출기 시스템 100 은 여러 관심 특징에 대해 여러 출력 행렬을 생성할 수 있다. 여러 행렬은 차원이 다를 수 있다. 도 3b는 본 개시의 구현예와 일치하는 예시적인 글로벌 시공간 처리 모듈의 블록도이다. 도 3b의 구현예는 도 1a의 예시적인 지능형 검출기 시스템 100의 글로벌 시공간 처리 모듈 120이나 도 1b의 컴퓨팅 장치 193과 같은다른 컴퓨터 구현 시스템을 구현하는 데 사용될 수 있다. 글로벌 시공간 처리 모듈 120은 로컬 시공간 처리 모 듈 110에서 얻은 출력을 수정하거나 정제할 수 있다. 따라서 글로벌 시공간 처리 모듈 120은 로컬 시공간 처리 모듈 110이 예를 들어 네트워크 160을 통해 이미지 소스 150에서 얻은 입력 비디오의 모든 이미지 부분 집합을 처리한 후 완전한 이미지 세트를 함께 처리하도록 구성될 수 있다. 예를 들어, 글로벌 시공간 처리 모듈 120은 로컬 시공간 처리 모듈 110이 처리한 완전한 이미지 세트의 출력을 처리하여 결정된 특성이나 관심 특징이 있는 이미지의 이상치를 정제하고 필터링함으로써 그 출력을 수정한다. 일부 구현예에서 글로벌 시공간 처리 모듈 120은 품질 네트워크 315와 분할 네트워크 316이 생성한 품질 점수와 분할 마스크를 정제할 수 있다. 글로벌 시공간 처리 모듈 120은 하나 이상의 비인과적 시간 합성곱 네트워크(TCN) 321을 사용하여 결정된 특성 의 점수를 정제할 수 있다. 글로벌 시공간 처리 모듈 120은 TCN 321에 포함된 팽창 합성곱 네트워크를 사용하여 로컬 시공간 처리 모듈 110이 처리한 모든 이미지의 출력을 처리할 수 있다. 이러한 팽창 합성곱 네트워크는 네 트워크 깊이(층 수)나 커널 크기를 증가시키지 않고 수용 영역을 증가시키는 데 도움이 되며 여러 이미지에 대 해 사용될 수 있다. 본 명세서에서 추가로 개시된 바와 같이, TCN 321은 로컬 시공간 처리 모듈 110을 사용하여 추출된 K x T' 특징 의 전체 시계열을 검토할 수 있다. TCN 321은 K x T' 차원의 특징 행렬을 입력으로 받아 T\" 길이의 하나 이상의 다중 스칼라 값 시계열을 반환할 수 있다. 글로벌 시공간 처리 모듈 120은 저역 통과 필터 및 가우시안 평활화와 같은 하나 이상의 신호 처리 기법을 사용 하여 품질 네트워크 315가 생성한 품질 점수를 정제할 수 있다. 일부 구현예에서 글로벌 시공간 처리 모듈 120 은 형태학적 연산의 연쇄를 사용하여 분할 네트워크 316이 생성한 분할 마스크를 정제할 수 있다. 글로벌 시공 간 처리 모듈 120은 인코더 312와 RNN 313 및 인과적 TCN 314의 조합으로 식별된 입력 이미지 전체에서 결정된 특성의 형태와 분포에 대한 사전 정보를 사용하여 분할을 위한 이진 마스크를 정제할 수 있다. TCN 321은 완전한 비디오 또는 입력 이미지 세트에서 작동하므로 로컬 시공간 처리 모듈 110이 개별 이미지 프 레임 처리를 완료할 때까지 기다려야 한다. 이 요구 사항을 수용하기 위해 TCN 321은 로컬 시공간 처리 모듈 110의 네트워크 훈련 후에 훈련될 수 있다. TCN 321의 층 수와 아키텍처는 지능형 검출기 시스템 100의 사용자 가 요청한 특정 관심 특징을 검출하기 위한 작업에 따라 달라진다. TCN 321은 시스템에 요청된 관심 특징을 기 반으로 훈련될 수 있다. TCN 321의 훈련 알고리즘은 각 작업이나 관심 특징에 대해 TCN 321의 매개변수를 조정 할 수 있다. 예를 들어, 지능형 검출기 시스템 100은 먼저 로컬 시공간 처리 모듈 110을 사용하여 훈련 세트 415의 각 비디 오에 대해 K차원 시계열을 계산하고 경사 하강 기반 최적화를 적용하여 TCN 321 매개변수를 추정함으로써 손실 함수 L(s, s')를 최소화할 수 있다. 여기서 s는 추정된 출력 점수 시계열이고 s'는 실제 값 시계열이다. 지능형 검출기 시스템 100은 예를 들어 평균 제곱 오차(MSE), 교차 엔트로피 및/또는 Huber 손실을 사용하여 s와 s' 사 이의 거리를 계산할 수 있다. 다른 신경망의 훈련 과정과 유사하게, TCN 321의 능력과 결과를 개선하기 위해 데이터 증강, 학습률 조정, 레이 블 평활화 및/또는 배치 훈련이 사용될 수 있다. 지능형 검출기 시스템 100은 구성 요소 110-130의 하이퍼파라미터를 조정하여 특정 요구 사항에 맞게 조정될 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 입력 비디오나 이미지 세트를 처리하기 위해 구성 요소 110-130이나 구성 요소 110-130의 특정 부분을 추가하거나 제거하여 파이프라인의 표준 아키텍처를 수정할 수 있다. 예를 들어, 지능형 검출기 시스템 100이 매우 로컬한 작업을 처리해야 하는 경우 로컬 시공간 처리 모듈 110이 생성한 출력에 대한 전역적 시공간 처리를 피하기 위해 글로벌 시공간 처리 모듈 120에서 TCN 321의 사용 을 중단할 수 있다. 다른 예로, 지능형 검출기 시스템 100의 사용자가 분산된 작업을 요청하는 경우 로컬 시공 간 처리 모듈 110에서 RNN 313 및/또는 TCN 314를 제거할 수 있다. 지능형 검출기 시스템 100은 요청된 병리를 검출하기 위해 입력 비디오나 이미지를 처리하는 데 사용되는 파이프라인에서 관련 네트워크를 비활성화하여 글 로벌 시공간 처리 모듈 120이나 로컬 시공간 처리 모듈 110의 일부 RNN 313 및 TCN 314를 제거할 수 있다. 시스템의 다른 배열이나 구현도 가능하다. 예를 들어, 관심 특징을 검출하기 위해 요청된 작업이 이미지 프레임 의 초점 객체를 다루지 않는 경우 분할 네트워크 316이 불필요하고 파이프라인에서 제외될 수 있다. 다른 예로, 모든 이미지 프레임이 유용한 것으로 간주되는 경우 품질 네트워크 315가 불필요하고 비활성화될 수 있다. 예를 들어, 입력 비디오의 프레임 속도가 낮거나 오류가 있는 이미지 프레임이 너무 많은 경우 지능형 검출기 시스템 100은 품질 네트워크 315를 사용하여 이미지 프레임을 추가로 필터링하는 것을 피할 수 있다. 본 개시에서 이해할 수 있듯이, 지능형 검출기 시스템 100은 로컬 시공간 처리 모듈 110과 글로벌 시공간 처리 모듈 120의 일부 로 활성화되고 훈련되어야 하는 구성 요소를 결정하기 위해 입력 비디오나 이미지를 사전 처리 및/또는 샘플링 할 수 있다. 도 3c는 본 개시의 구현예와 일치하는 예시적인 시계열 분석 모듈의 블록도이다. 도 3c의 구현예는 도 1a의 예 시적인 지능형 검출기 시스템 100의 시계열 분석 모듈 130이나 도 1b의 컴퓨팅 장치 193과 같은 다른 컴퓨터 구 현 시스템을 구현하는 데 사용될 수 있다. 시계열 분석 모듈 130은 로컬 시공간 처리 모듈 110이 처리한 각 이 미지 프레임에 대한 점수, 품질 값 및 분할 맵을 입력으로 사용하여 각 이미지에 대한 최종 출력 점수를 생성할 수 있다. 일부 구현예에서 의료 절차 완료 후 시계열 분석 모듈 130은 로컬 시공간 처리 모듈 110에 의해 생성"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "된 이미지의 점수, 품질 값 및/또는 분할 맵을 사용하여 모든 이미지의 품질 점수 요약이 포함된 대시보드나 다 른 디스플레이를 생성할 수 있다. 시계열 분석 모듈 130의 구성 요소는 지능형 검출기 시스템 100이 처리한 이"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "미지에 대한 집계된 요약으로 제시되는 다양한 출력 점수와 값을 생성하는 데 사용될 수 있다. 도 3c에 도시된 바와 같이, 시계열 분석 모듈 130 구성 요소는 입력 비디오의 이미지에 대한 최종 출력 점수를 생성하는 데 도 움이 되는 이벤트 감지기 331, 프레임 선택기 332, 객체 기술자 333 및 시간 분할기 334를 포함할 수 있다. 이벤트 감지기 331은 요청된 관심 특징과 관련된 이벤트의 입력 비디오에서의 시작 및 종료 시간을 결정할 수 있다. 일부 구현예에서 이벤트 감지기 331은 요청된 관심 특징과 관련된 이벤트의 입력 비디오에서의 시작 및 종료 이미지 프레임을 결정한다. 일부 구현예에서 이벤트의 시작 및 종료 시간이나 이미지 프레임이 중첩될 수 있다. 이벤트의 시작 및 종료 시간은 관심 특징과 관련된 일부 특성이 검출된 입력 비디오 부분의 시작과 끝일 수 있 다. 비디오의 시작 및 종료 시간은 로컬 시공간 처리 모듈 110에 의한 분석에서 누락된 이미지 프레임으로 인해 추정치일 수 있다. 이벤트 감지기 331은 (t, d) 쌍의 목록을 출력할 수 있으며, 여기서 t는 시간 인스턴스이고 d는 해당 시간에 검출된 이벤트의 설명이다. 지능형 검출기 시스템 100이 처리한 다양한 관심 특징에 기반하여 다양한 이벤트가 식별될 수 있다. 이벤트에서 식별된 입력 비디오의 부분은 의료 절차의 일부로 입력 비디오를 생성하기 위해 의료 전문가나 다른 운영자가 스캔한 장기의 부분을 포함할 수 있다. 예를 들어, 대장 내시경과 같은 의료 절차는 상행 결장, 횡행 결장 또는 하행 결장과 같은 대장의 다양한 부분에 대해 구성된 이벤트를 포함할 수 있다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "시계열 분석 모듈 130은 의료 절차의 다른 부분을 나타내는 비디오의 다른 부분의 이벤트에 대한 요약 보고서를"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "제공할 수 있다. 요약 보고서에는 예를 들어 이벤트와 관련된 장기 부분의 스캔을 완료하는 데 걸린 비디오 길 이나 시간이 포함될 수 있으며, 이는 철수 시간으로 나열될 수 있다. 이벤트 감지기 331은 관심 특징과 관련된"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "이벤트를 포함하는 의료 절차의 다른 부분에 대한 요약 보고서를 생성하는 데 도움을 줄 수 있다. 시계열 분석 모듈 130은 비디오 부분이나 비디오로 표현되는 장기 부분에 대해 다른 조치가 필요한 비디오 양을 보여주는 원형 차트가 있는 대시보드나 다른 디스플레이에 의료 절차 비디오(예: 대장 내시경 비디오)의 다른"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "부분에 대한 요약 보고서를 제시할 수 있다. 예를 들어 주의 깊은 2차 검토, 생검 수행 또는 병변 제거 등이 있"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "다. 일부 구현예에서 대시보드에는 이벤트 감지기 331이 식별한 이벤트의 품질 요약 세부 정보가 색상으로 코딩 되어 포함될 수 있다. 예를 들어, 대시보드에는 의료 절차의 한 부분을 나타내는 비디오의 품질을 식별하기 위 해 빨간색, 주황색 및 녹색으로 색상이 지정된 버튼이나 다른 아이콘이 포함될 수 있다. 대시보드에는 또한 의"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "료 절차의 개별 부분에 대해 제공된 것과 동일한 수준의 정보로 전체 의료 절차를 나타내는 전체 비디오의 요약 세부 정보가 포함될 수 있다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "일부 구현예에서 시계열 분석 모듈 130이 생성한 요약 보고서는 하나 이상의 프레임을 식별하여 부분을 더 주의"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "깊게 검토하고/하거나 다른 문제를 해결할 수 있다. 요약 보고서는 또한 추가 작업(예: 2차 검토)을 수행할 비 디오의 백분율을 나타낼 수 있다. 시계열 분석 모듈 130은 프레임 선택기 332를 사용하여 추가 작업을 수행할 비디오의 특정 프레임이나 비디오의 백분율을 식별할 수 있다. 프레임 선택기 332는 로컬 시공간 처리 모듈 110이 생성한 특성 및 점수에 기반하여 입력 비디오에서 이미지 프 레임을 검색할 수 있다. 일부 구현예에서 프레임 선택기 332는 또한 사용자가 제공한 품질 값을 활용하여 이미 지 프레임을 선택할 수 있다. 프레임 선택기 332는 지능형 검출기 시스템 100의 사용자가 요청한 특성 및/또는 관심 특징과의 관련성에 기반하여 이미지 프레임을 선택할 수 있다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "일부 구현예에서 시계열 분석 모듈 130이 생성한 요약 보고서에는 프레임 선택기 332가 식별한 하나 이상의 이 미지 프레임이 포함될 수 있다. 보고서에 제시된 이미지 프레임은 프레임의 하나 이상의 부분에 적용된 마킹을표시하도록 증강될 수 있다. 일부 구현예에서 마킹은 병변이나 용종과 같은 관심 특징을 식별할 수 있다. 예를 들어, 관심 특징을 둘러싼 색상이 지정된 경계 상자가 마킹으로 사용될 수 있다(예: 도 10 참조 및 이미지 프레 임에 적용된 녹색 경계 상자 참조). 일부 구현예에서 다른 마킹(다른 모양 및/또는 색상의 조합 포함)을 사용하 여 다른 관심 특징을 나타낼 수 있다. 예를 들어, 이미지 프레임은 지능형 검출기 시스템 100이 식별한 다른 관 심 특징을 나타내는 다른 색상의 경계 상자 형태의 하나 이상의 마킹을 포함하도록 증강될 수 있다. 객체 기술자 333은 요청된 관심 특징의 일치하는 특성을 포함하는 입력 비디오의 이미지 프레임을 병합할 수 있 다. 객체 기술자는 로컬 시공간 처리 모듈 110이 제공한 시간 및 공간 일관성 정보에 기반하여 이미지 프레임을 병합한다. 객체 기술자 333의 출력에는 속성 집합을 사용하여 설명된 객체 집합이 포함될 수 있다. 속성 집합에 는 입력 비디오의 다른 이미지 프레임에 대한 이미지 프레임의 상대적 타임스탬프가 포함될 수 있다. 일부 구현 예에서 속성 집합에는 이미지 프레임에서 검출된 특성이나 요청된 관심 특징의 추정 점수 및 위치에 대한 통계 가 포함될 수 있다. 시간 분할기 334는 입력 비디오를 시간 간격으로 분할한다. 시간 분할기 334는 요청된 관심 특징을 결정하는 작 업의 일관성에 기반하여 분할할 수 있다. 시간 분할기 334는 {L_i} 형태로 입력 비디오의 각 이미지 프레임에 대한 레이블을 출력할 수 있다. 출력 레이블은 이미지 프레임에서 요청된 관심 특징의 존재 및 확률과 이미지 프레임 내의 위치를 나타낼 수 있다. 일부 구현예에서 시간 분할기 334는 각 이미지 프레임의 각 관심 특징에 대해 별도의 레이블을 출력할 수 있다. 일부 구현예에서 시계열 분석 모듈 130은 의사, 의료 전문가 또는 기타 운영자가 수행한 의료 절차에 대한 품질 점수를 포함하는 대시보드나 다른 디스플레이를 생성할 수 있다. 품질 점수를 제공하기 위해 시계열 분석 모듈 130은 다른 검사 수행 행동을 가진 다른 의사와 운영자가 수행한 의료 절차의 비디오를 기반으로 훈련된 기계 학습 모델을 포함할 수 있다. 특히, 기계 학습 모델은 의료 전문가의 검사 행동이 추가 검토가 필요함을 나타내 는 비디오 세그먼트를 인식하도록 훈련될 수 있다. 예를 들어, 내시경 전문의가 대장/소장 표면을 주의 깊게 탐 색하는 것은 청소하거나 수술을 수행하거나 내비게이션하는 데 소요되는 시간과 대조적으로 소장 표면의 추가 검토가 필요함을 나타낼 수 있다. 시계열 분석 모듈 130이 사용하는 기계 학습 모델은 소요된 시간, 촬영된 사 진 수 및/또는 의료 절차의 특정 섹션에 대한 반복 스캔 수와 같은 요소를 기반으로 주의 깊은 탐색과 같은 의 료 전문가의 특정 활동에 대해 학습할 수 있다. 일부 구현예에서 기계 학습 모델은 비디오나 이미지 프레임의 특정 영역에 추가된 메모나 플래그 형태의 마킹 양에 기반하여 의료 전문가의 행동에 대해 학습할 수 있다. 일부 구현예에서 시계열 분석 모듈 130은 특정 조치(예: 주의 깊은 탐색, 내비게이션, 청소 등)를 수행하는 데"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "소요된 시간에 대한 정보를 사용하여 의료 전문가 행동의 품질 점수 요약 보고서를 생성할 수 있다. 일부 구현 예에서 특정 조치에 대한 의료 절차 총 시간의 백분율이 의료 절차 또는 의료 절차의 일부에 대한 품질 점수를 계산하는 데 사용될 수 있다. 시계열 분석 모듈 130은 의료 전문가가 수행한 조치를 관심 특징으로 포함하도록"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "지능형 검출기 시스템 100을 구성하는 것에 기반하여 의료 전문가 행동의 품질 요약 보고서를 생성하도록 구성 될 수 있다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "위에서 설명한 요약 점수가 포함된 대시보드를 생성하기 위해 시계열 모듈은 이벤트 감지기 331, 프레임 선택기 332, 객체 기술자 333 및 시간 분할기 334를 조합하여 활용할 수 있다. 대시보드에는 프레임 선택기 332가 선택 한 의료 절차의 하나 이상의 프레임과 의료 절차에 소요된 총 시간 및 병리나 기타 관심 특징이 있는 부분을 검"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "사하는 데 소요된 시간에 대한 정보가 포함될 수 있다. 의료 전문가 행동을 설명하는 통계의 품질 점수 요약은 전체 의료 절차(예: 전체 대장 스캔) 및/또는 해부학적 영역을 식별하는 부분(예: 상행 결장, 횡행 결장 및 하 행 결장과 같은 대장 세그먼트)에 대해 계산될 수 있다. 시계열 분석 모듈 130은 이벤트 감지기 331, 프레임 선택기 332, 객체 기술자 333 및 시간 분할기 334를 사용하 여 의료 절차 중 캡처된 장기의 다른 영역, 각 병리의 존재 및/또는 의료 절차를 수행하는 의료 전문가의 조치 와 같은 다른 관심 특징에 대한 집계 정보를 생성할 수 있다. 예를 들어, 객체 기술자 333을 사용하여 다양한 영역의 다양한 병리를 나열하고, 프레임 선택기 332가 선택한 병리를 보여주는 프레임, 각 병리의 영역에서 소 요된 시간과 이벤트 감지기 331이 결정한 의료 전문가의 조치에 기반하여 집계 정보를 생성할 수 있다. 일부 구현예에서 시계열 분석 모듈 130은 로컬 시공간 처리 모듈 110과 글로벌 시공간 처리 모듈 120이 처리한"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "입력 비디오의 요약을 생성할 수 있다. 입력 비디오의 요약에는 관심 특징이 있는 입력 비디오의 세그먼트가 추"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 28, "content": "출되어 결합된 입력 비디오의 요약이 포함될 수 있다. 일부 구현예에서 사용자는 요약 비디오만 보거나 모듈이 폐기한 비디오의 각 간격을 확장할지 선택할 수 있다. 시계열 분석 모듈 130의 시간 분할기 334는 관심 특징이"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 29, "content": "있는 입력 비디오 부분을 추출하는 데 도움을 줄 수 있다. 일부 구현예에서 시계열 분석 모듈 130은 관련 프레임을 선택하여 가변 프레임 속도 비디오 출력을 생성하는 비디오 요약을 생성할 수 있다. 시계열 분석 모듈 130"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 30, "content": "의 프레임 선택기 332는 출력 비디오 요약에서 프레임을 선택하고 삭제하는 데 도움을 줄 수 있다. 일부 구현예"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 31, "content": "에서 시계열 분석 모듈 130은 입력 비디오나 비디오 요약에 추가 메타데이터를 제공할 수 있다. 예를 들어, 시 계열 분석 모듈 130은 입력 비디오에서 관심 특징이 존재하는 타임라인의 색상을 지정할 수 있다. 시계열 분석 모듈 130은 다른 관심 특징을 강조 표시하기 위해 다른 색상을 사용할 수 있다. 일부 구현예에서 관심 특징이"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 32, "content": "있는 출력 비디오 요약의 부분에는 출력 비디오 요약에 오버레이된 텍스트와 그래픽이 포함될 수 있다. 일부 구현예에서 성능을 최대화하기 위해 모듈 110-130은 각 모듈 110-130의 신경망에 대한 최적의 매개변수 값 을 선택하도록 훈련될 수 있다. 도 3a에 표시된 로컬 시공간 처리 모듈 110의 구성 요소는 이미지를 처리하고 관심 특징과 관련된 특성을 검출 하는 데 사용되기 전에 미리 훈련된 신경망을 포함할 수 있다. 로컬 시공간 처리 모듈 110의 신경망은 훈련 세 트 415, 검증 세트 416 및 테스트 세트 417의 세 가지 부분 집합을 포함하는 비디오 데이터셋을 기반으로 훈련 될 수 있다(도 4a 참조). 지능형 검출기 시스템 100의 훈련 부분 집합에는 레이블이 지정된 비디오 세트가 필요 할 수 있다. 예를 들어, 레이블이 지정된 비디오 세트에는 지능형 검출기 시스템 100의 구성 요소가 처리하는 비디오에 할당된 목표 점수가 포함될 수 있다. 레이블이 지정된 비디오 세트에는 또한 비디오 세트의 각 이미지 프레임에서 검출 가능한 특성의 위치와 각 특성의 값이 포함될 수 있다. 레이블과 입력 비디오 세트는 모두 훈 련 목적으로 사용될 수 있다. 일부 구현예에서 비디오 세트의 부분 집합에 대한 레이블을 사용하여 지능형 검출 기 시스템 100의 구성 요소 110-130의 신경망을 훈련하는 데 사용되는 다른 부분 집합의 레이블을 결정할 수 있 다. 훈련 과정 동안, 지능형 검출기 시스템 100은 훈련 데이터셋 이미지나 지능형 검출기 시스템 100의 구성 요소 110-130의 신경망이 처리한 이미지의 버퍼에서 샘플링하고 오류 역전파를 통해 매개변수를 업데이트할 수 있다. 지능형 검출기 시스템 110은 비디오 세트의 검증 세트 416을 사용하여 바람직한 특성의 실제 값 y'와 인코더 312 출력 값 y의 수렴을 제어할 수 있다. 지능형 검출기 시스템 100은 비디오 세트의 테스트 세트 417을 사용하 여 비디오 세트의 훈련 부분 집합에서 특성 값을 결정하는 인코더 312의 성능을 평가할 수 있다. 지능형 검출기 시스템 100은 실제 값 y'가 출력 값 y와 수렴할 때까지 계속 훈련할 수 있다. 지능형 검출기 시스템 100은 수렴 에 도달하면 훈련 절차를 완료하고 임시 완전 연결 네트워크를 제거할 수 있다. 지능형 검출기 시스템 100은 최 신 매개변수 값으로 인코더 312를 완성한다. 도 4a는 본 개시의 구현예와 일치하는 도 3a의 로컬 시공간 처리 모듈의 인코더 구성 요소의 예시적인 훈련을 설명하는 흐름도이다. 도 3a의 인코더 312와 같은 인코더 구성 요소는 단일 이미지 프레임이나 N개의 이미지 프 레임의 작은 버퍼를 입력으로 받아 M 차원의 특징 벡터를 출력으로 생성한다. 도 4a에 도시된 바와 같이, 지능 형 검출기 시스템 100은 임시 네트워크를 추가하여 인코더 312를 훈련할 수 있다. 임시 네트워크는 인코더 312 를 훈련하기 위해 인코더 312의 끝에 추가 계층으로 추가된 완전 연결 네트워크(FCN) 411일 수 있다. FCN 411은 인코더 312가 생성한 입력의 각 이미지 프레임의 특징 벡터를 입력으로 받아 단일 부동 소수점 값이나 원-핫 벡 터 y를 반환할 수 있다. 지능형 검출기 시스템 100은 손실 함수 413을 사용하여 실제 값 y'와 인코더 312 출력 y의 수렴을 평가할 수 있다. 손실 함수는 인코더 312의 마지막 계층으로 추가된 추가 계층일 수 있다. 손실 함 수 413은 L(y,y')로 표현될 수 있으며, 이는 이미지 프레임의 특성에 대한 실제 값 y'와 인코더 312가 생성한 출력 y 사이의 거리를 나타낸다. 지능형 검출기 시스템 100은 FCN 411을 사용하여 인코더 312를 훈련하기 위해 평균 제곱 오차(MSE), 교차 엔트로피 또는 Huber 손실을 손실 함수 413으로 사용할 수 있다. 일부 구현예에서 임시 네트워크는 지능형 검출기 시스템 100이 인코더 312를 훈련하는 데 사용하는 디코더 네트 워크 412일 수 있다. 디코더 네트워크 412는 인코더 312가 추정한 각 특징 벡터를 입력 비디오의 이미지 프레임 (I_in)과 동일한 차원의 큰 행렬(I_out)에 매핑하는 합성곱 신경망일 수 있다. 디코더 네트워크 412는 두 이미 지(또는 N개 이미지의 버퍼) 사이의 거리를 계산하기 위해 손실 함수 413로 L(I_out, I_in)을 사용할 수 있다. 디코더 네트워크 412와 함께 사용되는 손실 함수 413에는 평균 제곱 오차(MSE), 구조적 유사성(SSIM) 또는 L1 노름이 포함될 수 있다. 인코더 312를 훈련하기 위한 임시 네트워크로 사용되는 디코더 네트워크 412는 훈련/검 증/테스트 부분 집합 415-417의 실제 값을 결정할 필요가 없다. 디코더 네트워크 412를 임시 네트워크로 사용하 여 인코더 312를 훈련하는 지능형 검출기 시스템 100은 검증 세트 416으로 수렴을 제어하고 테스트 세트 417을 사용하여 인코더 312의 예상 성능을 평가할 수 있다. 지능형 검출기 시스템 110은 인코더 312 훈련을 완료한 후 디코더 네트워크 412를 삭제하거나 비활성화할 수 있다. 완전 연결 네트워크 411과 디코더 네트워크 412를 사용하는 두 가지 훈련 방법 모두에서, 인코더 312와 지능형 검출기 시스템 100의 다른 구성 요소는 데이터 증강, 학습률 조정, 레이블 평활화, 모자이크, MixUp, CutMix 데 이터 증강 및/또는 배치 훈련과 같은 기법을 사용하여 인코더 312의 훈련 과정을 개선할 수 있다. 일부 구현예 에서 지능형 검출기 시스템 100의 신경망은 클래스 불균형으로 인해 어려움을 겪을 수 있으며 다수 클래스에 대 한 예측 편향을 피하기 위해 특별한 가중 손실 함수와 중요도 샘플링을 사용할 수 있다. 도 4b는 본 개시의 구현예와 일치하는 도 3a의 예시적인 로컬 시공간 처리 모듈의 신경망 구성 요소의 훈련 예 를 설명하는 흐름도이다. 도 4b의 예시적인 훈련은 예를 들어 로컬 시공간 처리 모듈 110의 순환 신경망(RNN) 313과 시간 합성곱 네트워크(TCN) 314를 훈련하는 데 사용될 수 있다. 지능형 검출기 시스템 100의 RNN 313 및 TCN 314와 같은 심층 신경망(DNN)을 훈련하려면 훈련 절차 중에 주석이 달린 비디오나 이미지 세트와 손실 함수 를 준비해야 한다. 훈련 절차 중에 지능형 검출기 시스템 100은 경사 하강 기반 최적화 알고리즘을 사용하여 네 트워크 매개변수를 조정할 수 있다. 지능형 검출기 시스템 100은 이전에 훈련된 인코더 312의 출력을 사용하여 RNN 313과 TCN 314를 훈련할 수 있다. RNN 313과 TCN 314에 대한 입력은 인코더 312가 출력한 시간 인스턴스당 M차원 특징 벡터일 수 있다. RNN 313과 TCN 314는 인코더 312가 생성한 특징 벡터를 버퍼링하여 여러 특징 벡터를 집계한다. 지능형 검출기 시스 템 100은 연속된 이미지 프레임의 시퀀스를 인코더 312에 공급하고 생성된 특징 벡터를 RNN 313과 TCN 314에 전 달하여 RNN 313과 TCN 314를 훈련할 수 있다. B개의 이미지(또는 버퍼링된 이미지 세트)의 시퀀스에 대해 인코 더 312는 M개의 인코딩된 특징의 B개 벡터를 생성하고 이를 RNN 313이나 TCN 314에 보내 K개 특징의 B개 벡터를 생성한다. 지능형 검출기 시스템 100은 RNN 313과 TCN 314의 끝에 임시 완전 연결 네트워크(FCN) 411을 포함시켜 RNN 313 과 TCN 314를 훈련할 수 있다. FCN 411은 RNN 313이나 TCN 314가 생성한 K차원 특징 벡터를 1차원 점수로 변환 하고 손실 함수에서 실제 값과 비교하여 출력 벡터와 실제 값 벡터 사이에 수렴이 있을 때까지 매개변수를 수정 한다. 일부 구현예에서 지능형 검출기 시스템 100은 RNN 313과 TCN 314를 훈련하는 과정에서 데이터 증강, 학습 률 조정, 레이블 평활화, 배치 훈련, 가중 샘플링 및/또는 중요도 샘플링을 사용하여 RNN 313과 TCN 314를 개선 할 수 있다. 도 4c는 본 개시의 구현예와 일치하는 도 3a의 로컬 시공간 처리 모듈의 품질 네트워크와 분할 네트워크 구성 요소의 예시적인 훈련을 설명하는 흐름도이다. 도 4c의 예시적인 훈련은 로컬 시공간 처리 모듈 110의 품질 네 트워크 315와 분할 네트워크 316을 훈련하는 데 사용될 수 있다. 지능형 검출기 시스템 100은 인코더 312의 훈 련과 유사하게 품질 네트워크 315를 훈련할 수 있지만 임시 네트워크(도 4a의 FCN 411이나 디코더 네트워크 412)가 필요하지 않다. 품질 네트워크 315는 이미지의 품질을 나타내는 스칼라 값 q를 출력한다. 지능형 검출기 시스템 100은 품질 네트워크 315의 출력 품질 점수 q를 비디오 세트의 훈련 세트 415의 각 이미지 프레임과 연 관된 실제 품질 점수 q'와 비교하여 값들 사이의 차이가 최소화될 때까지 품질 네트워크 315를 훈련할 수 있다. 지능형 검출기 시스템 100은 손실 함수 413을 L(q,q')로 표현하여 실제 값 q'와 출력 품질 점수 q 사이의 차이 를 최소화하고 품질 네트워크 315의 매개변수를 조정하는 데 사용할 수 있다. 지능형 검출기 시스템 100은 MSE, L1 노름을 손실 함수 413으로 사용하여 품질 네트워크 315를 훈련할 수 있다. 지능형 검출기 시스템 100은 데이 터 증강, 학습률 조정, 레이블 평활화 및/또는 배치 훈련 기법을 사용하여 품질 네트워크 315의 훈련 결과를 개 선할 수 있다. 지능형 검출기 시스템 100은 하나 이상의 개별 이미지 또는 크기 N의 작은 버퍼를 사용하여 분할 네트워크 316 을 훈련할 수 있다. 버퍼 크기 N은 도 4a에서 훈련된 인코더 312가 고려하는 이미지 수를 기반으로 할 수 있다. 지능형 검출기 시스템 100은 분할 네트워크 316을 훈련하기 위해 훈련 세트 415의 일부로 주석이 달린 실제 값 맵이 필요하다. 지능형 검출기 시스템 100은 손실 함수 413을 손실 L(m, m')로 표현하여 분할 네트워크 316이 추정한 맵 m과 실제 값 맵 m' 사이의 거리를 정의할 수 있다. 지능형 검출기 시스템 100은 예를 들어 픽셀 단위 MSE와 L1 손실 함수 및 다이스 점수와 부드러운 다이스 점수를 사용하여 예측된 맵 m과 실제 값 맵 m' 사이를 비교할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 입력 비디오의 각 이미지 프레임과 각 이미지 프레임에 대해 생성 된 마스크에 대한 특별한 형태학적 연산 및 아핀 변환과 같은 데이터 증강, 학습률 조정, 레이블 평활화 및/또 는 배치 훈련을 사용하여 분할 네트워크 316의 결과를 개선할 수 있다. 도 4D는 본 개시의 구현예와 일치하는 도 3b의 글로벌 시공간 처리 모듈의 예시적인 훈련을 설명하는 흐름도이 다. 도 4D에 도시된 바와 같이, 지능형 검출기 시스템 100은 로컬 시공간 처리 모듈 110의 출력을 사용하여 글 로벌 시공간 처리 모듈 110을 훈련할 수 있다. 본 개시에서 이해할 수 있듯이, 로컬 시공간 처리 모듈 110은 글로벌 시공간 처리 모듈 120을 훈련하는 데 사용하기 전에 먼저 훈련되어야 한다. 로컬 시공간 처리 모듈 110은 위의 도 4a-4c 설명에서 설명한 대로 각 구성 요소를 개별적으로 훈련함으로써 훈련된다. 글로벌 시공간 처리 모듈 120의 시간 합성곱 네트워크(TCN) 321은 T' 이미지 프레임에서 작동하는 로컬 시공간 처리 모듈 110에 의해 추출된 T' x K 특징의 전체 시계열에 접근할 수 있다. 글로벌 시공간 처리 모듈 120은 T' x K 차원의 전체 특징 행렬을 입력으로 받아 길이가 T\"인 스칼라 값의 시계열을 반환한다. 지능형 검출기 시스 템 100은 TCN 321을 훈련함으로써 글로벌 시공간 처리 모듈 120을 훈련할 수 있다. TCN 321을 훈련하고 결과적으로 글로벌 시공간 처리 모듈 120을 훈련하는 지능형 검출기 시스템 100은 TCN 321 의 처리 계층 수와 아키텍처 구조를 고려할 수 있다. 계층 수와 연결은 관심 특징을 결정하기 위한 작업에 따라 다르며 각 작업에 대해 조정되어야 한다. 지능형 검출기 시스템 100은 훈련 세트 415의 각 비디오에 대해 K차원 시계열 점수를 계산하여 글로벌 시공간 처리 모듈 120을 훈련한다. 지능형 검출기 시스템 100은 이전에 훈련된 로컬 시공간 처리 모듈 110에 훈련 세트 415 비디오를 입력으로 제공하고 그 출력을 글로벌 시공간 처리 모듈 120에 제공하여 시계열 점수를 계산한다. 지능형 검출기 시스템 100은 경사 하강 기반 최적화를 사용하여 TCN 321 신경망의 네트워크 매개변수를 추정할 수 있다. 경사 하강 기반 최적화는 글로벌 시공간 처리 모듈 120이 출력한 시계열 점수 s와 실제 값 시계열 점 수 s' 사이의 거리를 최소화할 수 있다. 글로벌 시공간 처리 모듈 120을 훈련하는 데 사용되는 손실 함수 413은 평균 제곱 오차(MSE), 교차 엔트로피 또는 Huber 손실일 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 데이터 증강, 학습률 조정, 레이블 평활화 및/또는 배치 훈련 기 법을 사용하여 훈련된 글로벌 시공간 처리 모듈 120의 결과를 개선할 수 있다. 도 5a 및 5b는 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템의 구성 요소로 구성된 파이프라인 의 개략적 표현이다. 예를 들어, 도 5a 및 5b의 파이프라인은 입력 비디오를 처리하기 위해 도 1a의 지능형 검 출기 시스템 100의 구성 요소로 구성될 수 있다. 지능형 검출기 시스템 100의 모듈을 사용하여 입력 비디오를 처리하기 위한 파이프라인은 처리할 입력 비디오의 유형과 요청된 관심 특징에 따라 구조가 다를 수 있다. 파이 프라인은 각 모듈의 모든 구성 요소 또는 일부 구성 요소(예: 도 3a의 인코더 312)를 포함할 수 있다. 도 5a에 도시된 바와 같이, 파이프라인 500은 입력 비디오 501을 처리하고 사용자나 의사가 요청할 수 있는 관 심 특징을 결정하기 위한 지능형 검출기 시스템 100의 구성 요소를 포함한다(예: 도 1a의 사용자 장치 170 또는 의사 장치 180을 통해). 파이프라인 500은 각 이미지 프레임에서 결정된 특성 및 요청된 관심 특징의 점수 행렬 531 및 541을 생성하기 위해 로컬 시공간 처리 모듈 110과 글로벌 시공간 처리 모듈 120의 구성 요소를 포함한 다. 파이프라인 500은 또한 행렬 531 및 541에 존재하는 특성의 시공간 정보를 사용하여 관심 특징을 결정하기 위한 시계열 분석 모듈 130을 포함한다. 로컬 시공간 처리 모듈 110은 특성 점수의 K x T' 행렬 531을 출력할 수 있다. T'는 로컬 시공간 처리 모듈 110 이 반복적으로 분석한 입력 비디오 501의 프레임 수이다. 로컬 시공간 모듈 110은 분석된 T' 프레임의 각 프레 임에 대해 크기 K의 특성 점수 벡터를 생성한다. 크기 K는 지능형 검출기 시스템 100의 사용자가 요청한 관심 특징의 수와 일치할 수 있다. 로컬 시공간 처리 모듈 110은 샘플러 311을 사용하여 T 이미지 프레임의 일부 또 는 전부를 검색하여 입력 비디오 501을 처리할 수 있다. 특성 점수를 생성하기 위해 로컬 시공간 처리 모듈의 구성 요소로 분석된 T' 프레임은 입력 비디오 501의 총 T 이미지 프레임보다 적거나 같을 수 있다. 샘플러 311 은 다른 구성 요소 312 및 315-317이 분석할 T' 프레임을 선택할 수 있다. 일부 구현예에서 RNN 313 및 TCN 314 는 샘플링된 프레임의 T' 이미지 프레임에 대해서만 점수를 생성할 수 있다. 네트워크 313-314는 요청된 관심 특징과 관련된 적어도 하나의 특성의 존재를 기반으로 T' 이미지 프레임을 포함할 수 있다. 로컬 시공간 처리 모듈은 특성 점수의 행렬 531을 생성하기 위해 네트워크 313 또는 314의 한 세트만 사용하여 이미지 프레임을 처리한다. 로컬 시공간 처리 모듈은 샘플러 311이 버퍼링하고 제공한 입력 비디오 501의 이미지 프레임의 부분 집합과 함 께 또는 개별적으로 각 이미지 프레임을 검토하여 T' 이미지 프레임에 대한 특성 점수의 행렬 531을 생성한다. 로컬 시공간 처리 모듈 110은 네트워크 315-317을 사용하여 추가 점수 행렬 532-534를 생성할 수 있다. 품질 네 트워크 315는 관심 특징과 관련된 특성을 각 이미지 프레임에서 결정하기 위해 샘플러 311이 고려한 각 이미지 프레임의 품질 점수를 생성할 수 있다. 도 5a에 도시된 바와 같이, 품질 네트워크 315는 품질 점수의 행렬 532 를 생성할 수 있다. 행렬 532는 품질 네트워크 315가 분석한 T\" 프레임의 품질 점수의 1 x T\" 벡터일 수 있다. 품질 네트워크 315는 샘플러 311이 추출한 이미지 프레임을 분석하여 T\" 이미지 프레임에 대한 품질 점수를 생성할 수 있다. 일부 구현예에서 T\"는 입력 비디오 501의 총 프레임 수 T보다 적을 수 있다. 품질 네트워크 315 는 임계값 이상의 품질 점수를 가진 T\" 프레임만 처리할 수 있다. 분할 네트워크 316은 입력 비디오 501의 T''' 이미지 프레임을 처리하여 분할 마스크의 행렬 533을 생성할 수 있다. 행렬 533은 높이 H'와 너비 W'의 T''' 마스크를 포함하는 W' x H' x T''' 차원을 갖는다. 일부 구현예에 서 분할 마스크의 너비 W'와 높이 H'는 처리된 이미지 프레임의 차원보다 작을 수 있다. 분할 네트워크 316은 샘플러 311이 추출한 이미지 프레임을 분석하여 T''' 이미지 프레임에 대한 분할 마스크를 생성할 수 있다. 일 부 구현예에서 T'''는 입력 비디오 501의 총 프레임 수 T보다 적을 수 있다. 분할 네트워크 316은 특성이나 요 청된 관심 특징의 일부를 포함하는 경우에만 T''' 프레임에 대한 분할 마스크를 처리할 수 있다. 도 5a에 도시된 바와 같이, 글로벌 시공간 처리 모듈 120은 로컬 시공간 처리 모듈 110이 출력한 K x T' 특성 점수의 행렬 531을 처리하여 수정된 특성 점수의 행렬 541을 생성한다. 글로벌 시공간 처리 모듈 120은 행렬 531의 특성을 함께 처리하여 분석된 T' 이미지 프레임의 모든 특성 점수를 검토한다. 글로벌 시공간 처리 모듈 120의 TCN 321은 행렬 531의 특성 점수를 처리하여 1 x T' 차원의 점수 행렬 526을 생성할 수 있다. TCN 321은 크기 K의 벡터로 표현된 T' 이미지 프레임의 점수를 결합하여 행렬 526의 점수를 생성한다. 글로벌 시공간 처리 모듈 120은 행렬 526에서 이상치를 제거하기 위해 후처리기 522를 사용할 수 있다. 후처리기 522는 저역 통과 필터 및 가우시안 평활화와 같은 표준 신호 처리 기법을 사용하여 이상치를 제거할 수 있다. 글로벌 시공간 처 리 모듈 120은 1 x U' 차원의 부동 소수점 점수의 행렬 541을 출력한다. U'의 차원은 T'보다 작거나 같을 수 있 다. 후처리기 522는 정제된 점수 행렬 541을 생성하기 위해 T' 이미지 프레임 점수의 일부를 필터링했을 수 있 다. 일부 구현예에서 U'의 차원은 입력 비디오(예: 비디오 501)의 이미지 프레임 수를 늘리기 위해 업샘플링하 여 T'보다 클 수 있다. 글로벌 시공간 처리 모듈 120은 비디오 501을 업샘플링하기 위한 업샘플링 모듈을 포함 할 수 있다. 글로벌 시공간 처리 모듈 120은 품질 점수가 있는 이미지 프레임의 수가 임계값보다 낮은 경우 비 디오 501을 업샘플링할 수 있다. 글로벌 시공간 처리 모듈 120은 로컬 시공간 처리 모듈 110의 품질 네트워크 315가 결정한 대로 높은 품질 점수를 가진 이미지 프레임을 기반으로 업샘플링할 수 있다. 일부 구현예에서 글 로벌 시공간 처리 모듈 120에 의한 처리 전에 비디오 501이 업샘플링될 수 있다. 예를 들어, 샘플러 311은 추가 이미지 프레임을 생성하기 위해 입력 비디오 501을 업샘플링할 수 있다. 글로벌 시공간 처리 모듈 120은 후처리기 523-525를 사용하여 요청된 관심 특징을 결정하는 데 사용되는 추가 점수 및 세부 정보의 행렬 532-534를 정제하여 행렬 542-544를 생성할 수 있다. 예를 들어, 후처리기 523은 저역 통과 필터 및 가우시안 평활화와 같은 하나 이상의 표준 신호 처리 기법을 사 용하여 품질 점수 행렬 532를 정제한다. 후처리기 523은 정제된 점수의 1 x U'' 차원의 행렬 542를 출력한다. 일부 구현예에서 U'' 값은 T'' 값과 다를 수 있다. 예를 들어, 후처리기 523이 낮은 품질 점수의 특정 이미지 프레임을 무시한 경우 U''는 T''보다 작을 수 있다. 또는 비디오 501이 더 많은 이미지 프레임과 더 높은 해상 도의 이미지 프레임을 생성하기 위해 업샘플링된 경우 U''가 T''보다 클 수 있다. 후처리기 524는 각 관심 특징의 형태와 분포에 대한 사전 정보를 활용하는 형태학적 연산의 연쇄를 사용하여 분 할 마스크 행렬 533을 정제할 수 있다. 후처리기 524는 W' x H' x U''' 차원의 행렬 543을 출력할 수 있다. 일 부 구현예에서 U'''의 차원은 T'''와 다를 수 있다. 예를 들어, 후처리기 524가 낮은 품질 점수의 특정 이미지 프레임을 무시한 경우 U'''는 T'''보다 작을 수 있다. 또는 비디오 501이 더 많은 이미지 프레임과 더 높은 해 상도의 이미지 프레임을 생성하기 위해 업샘플링된 경우 U'''가 T'''보다 클 수 있다. 도 5a에 도시된 바와 같이, 파이프라인 500의 시계열 모듈 130은 글로벌 시공간 처리 모듈 120의 출력 행렬 541-544를 사용하여 입력 비디오의 각 이미지 프레임에서 요청된 관심 특징의 위치와 입력 비디오에서의 위치를 나타내는 수치 값을 생성할 수 있다. 시계열 모듈 130은 행렬 541의 특성 점수와 행렬 542의 품질 점수를 사용 하여 각 관심 특징의 존재를 가장 잘 나타내는 이미지 프레임을 선택할 수 있다. 일부 구현예에서 시계열 모듈 130은 행렬 541의 특성의 시공간 정보를 활용하여 입력 비디오 501에서 관심 특징을 포함하는 간격을 결정할 수 있다. 도 5b에 도시된 바와 같이, 파이프라인 502는 네트워크 315-317(도 5a에 표시됨)과 후처리기 523-525(도 5a에도 표시됨)와 같은 추가 구성 요소를 포함하지 않는 대체 아키텍처를 보여준다. 파이프라인 502는 여전히 로컬 시 공간 처리 모듈 110과 글로벌 시공간 처리 모듈 120의 출력으로 동일한 특성 점수 행렬 531과 541을 생성할 수 있다. 시계열 모듈 130은 행렬 541을 입력으로 사용하여 입력 비디오 501에서 관심 특징을 식별하는 값을 생성 한다.도 6a 및 6b는 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템 100과 같은 지능형 검출기 시스템 을 사용하여 여러 작업을 실행하기 위한 다양한 파이프라인 설정을 도시한다. 지능형 검출기 시스템 100의 모듈 은 이미지 데이터를 처리하기 위한 파이프라인으로 구성되고 관리될 수 있다. 작업 관리자 140은 다양한 파이프 라인 아키텍처를 유지하고 파이프라인의 다양한 모듈 간 데이터 흐름을 관리할 수 있다. 일부 구현예에서 지능 형 검출기 시스템 100은 동일한 입력 비디오에서 다양한 사용자가 요청한 다양한 관심 특징을 결정하기 위해 다 른 작업으로 활용될 수 있다. 이러한 시나리오에서 지능형 검출기 시스템 100의 신경망은 각 작업과 관련된 관 심 특징을 결정하기 위해 다양한 작업에 대해 훈련될 수 있다. 지능형 검출기 시스템 100은 또한 다양한 의료 기기 및/또는 기타 영상 장치에서 생성된 다양한 유형의 입력 비디오에 대해 훈련되어 다양한 관심 특징을 결정 할 수 있다. 작업 관리자 140은 각 작업에 대해 별도의 파이프라인을 유지하고 독립적으로 훈련할 수 있다. 도 6a에 도시된 바와 같이, 지능형 검출기 시스템 100은 모듈을 사용하여 두 개의 별도 파이프라인 610과 620을 생성하고 이를 훈련하여 별도의 작업 602와 603에서 작동하여 입력 비디오 601을 처리하고 다양한 관심 특징을 검출할 수 있다. 일부 구현예에서 파이프라인 610과 630은 다양한 작업을 처리하도록 사전 훈련되어 있다. 또한, 지능형 검출기 시스템 100은 입력 비디오 601을 처리하기 위해 관련 사전 훈련된 모듈을 검색하여 파이프라인을 인스턴 스화할 수 있다. 예를 들어, 작업 관리자 140은 작업 602의 일부로 요청된 관심 특징을 결정하기 위해 비디오 601을 처리하기 위해 파이프라인 610에 로컬 시공간 모듈 611, 글로벌 시공간 모듈 612 및 시계열 모듈 613을 포함할 수 있다. 마찬가지로, 파이프라인 620은 작업 603의 일부로 관심 특징을 결정하기 위해 비디오 601을 처 리하기 위해 로컬 시공간 처리 모듈 621, 글로벌 시공간 처리 모듈 622, 시계열 모듈 623을 사용하여 구성될 수 있다. 여러 파이프라인을 유지하면 여러 작업으로 쉽게 확장할 수 있지만 특정 구성 요소에 의한 이미지 데이터 의 중복 처리를 초래할 수 있다. 공유 구성 요소의 부분 집합이 있는 하이브리드 파이프라인 아키텍처의 효율적 인 대안 방식은 아래 도 6b 구현예 예시에 설명되어 있다. 도 6b는 작업 간에 지능형 검출기 시스템 100의 공유 모듈이 있는 대체 파이프라인 650을 보여준다. 지능형 검 출기 시스템 100은 각 모듈의 일부 또는 모든 구성 요소를 공유하여 다양한 작업 간에 모듈을 공유한다. 지능형 검출기 시스템 100은 이미지 데이터를 처리하기 위해 요청된 작업에 덜 의존하는 파이프라인의 구성 요소를 공 유할 수 있다. 샘플러 311과 품질 네트워크 315는 입력 이미지 데이터에 의존하고 요청된 관심 특징과 관계없이 이미지 데이터 에 대해 동일한 방식으로 작동할 수 있다. 따라서 파이프라인 650에서 입력 데이터에 의존하고 요청된 작업과 관련이 없는 로컬 시공간 처리 모듈 630의 구성 요소인 샘플러 631과 품질 네트워크 635는 입력 비디오 601을 처리하는 작업 602와 603 사이에 공유된다. 파이프라인 650은 파이프라인 650의 다운스트림 구성 요소가 처리할 여러 작업 간에 이들의 출력을 공유할 수 있다. 인코더 312는 입력 비디오 601의 이미지 프레임에 대한 올바른 주석을 식별하기 위해 요청된 작업에 의존할 수 있지만, 입력 데이터에 더 의존할 수 있으며 다양한 작업 간에 공유될 수 있다. 따라서 파이프라인 650은 작업 602와 603 간에 인코더 632를 공유할 수 있다. 또한 여러 작업에 걸쳐 인코더 632를 공유하면 더 많은 샘플을 사용할 수 있어 훈련이 개선될 수 있다. 품질 네트워크 315는 요청된 작업에 의존하지 않고 직접 이미지 품질에 대해 작동한다. 따라서 작업당 하나씩 품질 네트워크 315의 별도 인스턴스를 사용하는 것은 중복된다. 입력 비디오(예: 입력 비디오 601)의 이미지 프 레임 품질 점수는 요청된 작업(예: 작업 602 및 603)과 관련이 없으며 동일한 작업이 입력 비디오 601에 여러 번 적용되는 결과를 초래하기 때문이다. 분할 네트워크 316은 위에서 논의한 구성 요소보다 요청된 작업에 더 의존적이다. 그러나 여러 작업(예: 작업 602 및 603)에 대해 여러 출력을 생성하는 것이 더 쉽기 때문에 여전히 공유될 수 있다. 도 6b에 도시된 바와 같이, 분할 네트워크 636은 각 이미지 프레임에 대해 작업당 여러 분할 마스크를 행렬 653으로 반환할 수 있는 분할 네트워크 316의 수정된 버전이다. 신경망 633-634는 다양한 작업에서 식별할 요청된 관심 특징에 특정한 특성 점수 행렬을 생성하는 RNN 313 또는 TCN 314의 인스턴스를 포함할 수 있다. 파이프라인 650의 로컬 시공간 처리 모듈 630은 인코더 출력의 여러 복 사본 637 및 638을 생성하고 이를 작업당 하나씩 여러 신경망 633 및 634에 입력으로 제공하도록 구성될 수 있 다. 도 6c 및 6d는 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템을 사용하여 집계된 출력으로 여러 작업을 실행하기 위한 예시적인 파이프라인 설정을 도시한다. 도 6c에 도시된 바와 같이, 파이프라인 610 및 620은 여러 시계열 분석 모듈 671-673을 동시에 사용하여 출력을 생성한다. 예를 들어, 시계열 분석 모듈 673은 파이프라인 610과 620 모두에서 생성된 데이터를 입력으로 받는다. 시계열 분석 모듈 671 및 672는 위에서 설명 한 도 6a의 파이프라인 610 및 620의 출력과 유사한 지능형 검출기 시스템의 출력을 생성할 수 있다. 추가 시계 열 분석 모듈 673은 로컬 및 글로벌 시공간 모듈 611-612 및 621-622에 의해 생성된 데이터를 집계할 수 있다. 도 6d는 시계열 분석을 수행하기 위해 모듈의 출력을 공유하는 것 외에도 로컬 및 글로벌 시공간 모듈 630 및 604를 공유하는 파이프라인을 보여준다. 도 6d에 도시된 바와 같이, 시계열 분석 모듈 683은 샘플러 631 및 인 코더 632를 사용하여 이미지를 전처리하여 생성된 벡터 661과 664를 모두 받아 이미지 점수를 포함한다. 시계열 분석 모듈 683은 도 6c의 시계열 분석 모듈 673과 유사한 출력을 생성하기 위해 데이터를 집계한다. 도 6e는 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템을 사용하여 생성된 여러 작업에 대한 출"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 33, "content": "력 요약이 있는 예시적인 대시보드를 도시한다. 대시보드 690은 예를 들어 의료 전문가가 수행한 대장 내시경"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 34, "content": "검사와 같은 의료 절차의 요약을 제공할 수 있다. 대시보드 690은 의료 절차의 다양한 부분에 대한 정보를 제공"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 35, "content": "할 수 있으며 의료 전문가의 검사 행동을 요약하는 점수 및/또는 기타 정보와 식별된 용종 수와 같은 관심 특징 에 대한 정보도 포함할 수 있다."}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 36, "content": "도 6e에 도시된 바와 같이, 대시보드 690은 대장의 다양한 부분에 대한 품질 점수 요약(우측 결장 품질 점수 요"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 37, "content": "약 691, 횡행 결장 품질 점수 요약 692 및 좌측 결장 품질 점수 요약 693)과 함께 전체 결장 품질 점수 요약"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 38, "content": "694를 포함할 수 있다. 품질 점수 요약 691-694에는 주의 깊은 탐색, 수술 수행, 점막 세척/청소, 결장 또는 기 타 인체 장기를 통한 빠른 이동이나 내비게이션과 같은 다양한 조치에 대한 시간 통계가 포함될 수 있다. 시스 템 100은 예를 들어 의료 전문가의 행동과 관련된 특성이나 요인을 기반으로 철수 시간과 \"주의 깊은 탐색\"으로 식별된 시간의 양 및/또는 시간의 백분율을 결정할 수 있다. 지능형 검출기 시스템 100은 예를 들어 의료 전문 가가 장기의 스캔된 부분을 다른 부분에 비해 분석하는 데 소요한 시간을 기반으로 의료 전문가의 조치를 \"주의 깊은 탐색\"으로 식별할 수 있다. 예를 들어, 내시경 전문의가 병변을 청소/절제하는 것과 같은 다른 조치와 달 리 점막을 분석하는 것은 \"주의 깊은 탐색\" 조치로 간주될 수 있다. 시간 통계에는 의료 절차 중 해부학적 영역"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 39, "content": "이나 장기 부분(예: 점막)을 수술 수행, 세척/청소, 빠르게 이동/내비게이션하는 등 다른 조치에 대한 요약도 포함될 수 있다. 다양한 의료 절차(예: 대장 내시경, 비디오 수술, 비디오 캡슐 기반 스캔)에는 \"주의 깊은 탐 색\"으로서의 의료 전문가의 다양한 조치가 포함될 수 있다. 지능형 검출기 시스템 100은 의료 전문가의 조치에"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 40, "content": "\"주의 깊은 탐색\" 레이블을 지정하도록 구성될 수 있다. 품질 점수 요약 대시보드 690은 또한 의료 절차의 각 부분에 대한 검사 품질의 색상으로 코딩된 표현을 포함할 수 있다. 예를 들어, 도 6e에 도시된 바와 같이, 품질"}
{"patent_id": "10-2025-7003209", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 41, "content": "점수 요약 대시보드 690은 절차의 각 부분에 대한 검사 품질 수준을 나타내기 위해 강조 표시된 신호등 색상의 원 또는 아이콘(예: 빨간색, 주황색 및 녹색)을 포함할 수 있다. 도 7은 본 개시의 구현예와 일치하는 입력 비디오의 이미지에서 병리를 검출하기 위한 예시적인 방법의 동작을 나타내는 흐름도이다. 방법 700의 단계는 예를 들어 도 2의 컴퓨팅 장치 200의 기능을 실행하거나 사용하는 도 1a의 지능형 검출기 시스템 100에 의해 수행될 수 있다. 도시된 방법 700은 단계의 순서를 수정하고 추가 단계 를 포함하도록 변경될 수 있음을 이해할 것이다. 단계 710에서 지능형 검출기 시스템 100은 네트워크 160을 통해 입력 비디오 또는 순서화된 이미지 세트를 수신 할 수 있다. 본 명세서에 개시된 바와 같이, 처리될 이미지는 시간적으로 순서화될 수 있다. 지능형 검출기 시 스템 100은 이미지 소스 150에서 직접 이미지를 요청할 수 있다. 일부 구현예에서 의사 장치 180 및 사용자 장 치 170과 같은 다른 외부 장치가 지능형 검출기 시스템 100에 이미지 소스 150에서 이미지를 요청하도록 지시할 수 있다. 일부 구현예에서 사용자 장치 170은 현재 이미지 소스 150으로 스트리밍되거나 다른 방식으로 수신되 는 이미지에서 관심 특징을 검출하라는 요청을 제출할 수 있다. 단계 720에서 지능형 검출기 시스템 100은 요청된 각 관심 특징과 관련된 특성을 결정하기 위해 이미지의 부분 집합을 개별적으로 분석할 수 있다. 지능형 검출기 시스템 100은 샘플러 311(도 1a에 도시됨)을 사용하여 로컬 시공간 처리 모듈 110(도 1a에 도시됨)의 다른 구성 요소를 사용하여 분석할 이미지의 부분 집합을 선택할 수 있다. 또한, 본 명세서에 개시된 바와 같이, 로컬 시공간 처리 모듈 110은 이미지에서 특성을 결정할 때 제한된 이미지의 부분 집합을 가질 수 있다. 지능형 검출기 시스템 100은 본 명세서에 개시된 바와 같이 이미지의 부분 집합에 포함할 이미지 수의 구성을 허용할 수 있다. 지능형 검출기 시스템 110은 요청된 관심 특징 또는 이와 관련된 특성을 기반으로 부분 집합의 크기를 자동으로 구성할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100의 사용자나 의사는 사용자 또는의사의 입력을 기반으로 부분 집합의 크기를 구성할 수 있다(예: 도 1a의 사용자 장치 170 또는 의사 장치 180 을 통해). 이미지의 부분 집합은 중첩되고 이미지를 공유할 수 있다. 지능형 검출기 시스템 100은 로컬 시공간 처리 모듈 110이 처리하는 이미지의 부분 집합 간에 중첩되는 이미지 수의 구성을 허용할 수 있다. 지능형 검출 기 시스템 100은 한 번에 이미지의 부분 집합을 선택할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 이미지 소스 150에서 이미지 스트림을 수신하고 부분 집합을 형성하는 데 필요한 이미지 수가 달성될 때까지 이 를 버퍼에 저장할 수 있다. 지능형 검출기 시스템 100은 로컬 시공간 처리 모듈 110을 사용하여 이미지의 부분 집합을 분석하여 부분 집합 의 각 이미지에서 특성의 가능성을 결정할 수 있다. 각 관심 특징과 관련된 특성의 가능성은 연속 또는 이산 값 의 범위로 표현될 수 있다. 예를 들어, 특성의 가능성은 0과 1 사이의 값을 사용하여 표현될 수 있다. 지능형 검출기 시스템 100은 인코더 312를 사용하여 이미지 부분 집합의 각 이미지를 인코딩하여 특성을 검출할 수 있다. 분석 과정의 일부로, 지능형 검출기 시스템 100은 순환 신경망(예: 도 3a에 표시된 RNN(들) 313)을 사 용하여 결정된 특성의 시공간 정보를 집계할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 인과적 시 간 합성곱 네트워크(예: 도 3a에 표시된 TCN(들) 314)를 사용하여 이미지 부분 집합의 각 이미지에서 결정된 특 성의 시공간 정보를 추출할 수 있다. 지능형 검출기 시스템 100은 품질 네트워크 315(도 3a에 표시됨)를 사용하여 각 이미지에 대한 추가 정보를 결 정할 수 있다. 지능형 검출기 시스템 100은 품질 네트워크 315를 사용하여 이미지 부분 집합의 각 이미지에 해 당하는 품질 점수 벡터를 결정할 수 있다. 품질 점수는 요청된 관심 특징이 있는 이상적인 이미지에 비해 각 이 미지의 순위를 매기는 데 사용될 수 있다. 품질 네트워크 315는 품질 점수를 서수로 출력할 수 있다. 서수는 이 미지 품질이 너무 낮아 무시해야 하는 범위를 넘어서는 수의 범위일 수 있다. 예를 들어, 품질 네트워크 315는 0에서 R 사이의 품질 점수를 출력할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 분할 네트워크 316을 사용하여 특성에 대한 추가 정보를 생성할 수 있다. 추가 정보에는 각 이미지의 부분에 대한 정보가 포함될 수 있다. 지능형 검출기 시스템 100은 분할 네 트워크 316을 사용하여 이미지 부분 집합의 각 이미지에 대한 분할 마스크를 생성함으로써 관심 특징이 있는 이 미지의 부분을 추출할 수 있다. 분할 네트워크 316은 이미지를 추출하기 위해 심층 합성곱 신경망을 사용할 수 있다. 단계 730에서 지능형 검출기 시스템 100은 단계 720에서 생성된 이미지와 결정된 특성에 대한 정보 벡터를 처리 할 수 있다. 지능형 검출기 시스템 100은 단계 720에서 로컬 시공간 처리 모듈 110이 생성한 출력을 처리하기 위해 글로벌 시공간 처리 모듈 120을 사용할 수 있다. 지능형 검출기 시스템 100은 각 이미지에서 결정된 특성 을 포함하여 모든 이미지와 관련된 정보 벡터를 함께 처리하여 정보 벡터를 정제할 수 있다. 글로벌 시공간 처 리 모듈 120은 로컬 시공간 처리 모듈 110의 구성 요소가 생성한 특성 정보를 정제하기 위해 비인과적 시간 합 성곱 네트워크(예: 도 3b의 시간 합성곱 네트워크(들) 321)를 적용할 수 있다. 지능형 검출기 시스템 100은 또한 후처리기(예: 도 3b에 표시된 후처리기 322)를 사용하여 품질 점수 및 분할 마스크와 같은 이미지와 특성에 대한 추가 정보 벡터를 정제할 수 있다. 지능형 검출기 시스템 100은 하나 이상 의 신호 처리 기법을 사용하여 순서화된 이미지 세트의 각 이미지의 품질 점수를 정제할 수 있다. 예를 들어, 지능형 검출기 시스템 100은 저역 통과 필터나 가우시안 평활화와 같은 하나 이상의 신호 처리 기법을 사용하여 품질 점수를 정제할 수 있다. 예를 들어, 도 5a에 표시된 대로 후처리기 523은 품질 점수 행렬 532를 입력으로 받아 정제된 점수 행렬 542를 생성할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 후처리기(예: 도 3b에 표시된 후처리기 322)를 사용하여 각 이미 지에서 관심 특징이 있는 부분을 추출하기 위한 이미지 분할에 사용되는 분할 마스크를 정제할 수 있다. 지능형 검출기 시스템 100은 순서화된 이미지 세트 전체에 걸쳐 특성이나 관심 특징의 형태와 분포에 대한 사전 정보를 활용하는 형태학적 연산을 사용하여 분할 마스크를 정제할 수 있다. 예를 들어, 도 5a에 표시된 대로 후처리기 524는 분할 마스크 행렬 533을 입력으로 받아 정제된 분할 마스크 행렬 543을 생성할 수 있다. 단계 740에서 지능형 검출기 시스템 100은 단계 730에서 순서화된 이미지 세트의 각 이미지에 대해 정제된 특성 을 기반으로 각 이미지에 수치 값을 연관시킬 수 있다. 지능형 검출기 시스템 100의 구성 요소는 각 이미지에 할당된 수치 값을 해석하여 각 이미지 내에서 관심 특징을 식별할 확률을 결정할 수 있다. 지능형 검출기 시스 템 100은 요청된 각 관심 특징의 다른 상태를 나타내기 위해 다른 수치 값을 제시할 수 있다. 예를 들어, 지능형 검출기 시스템 100은 요청된 관심 특징이 검출된 각 이미지에 대해 첫 번째 수치 값을 출력하고 요청된 관심 특징이 검출되지 않은 각 이미지에 대해 두 번째 수치 값을 출력할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 연관된 수치 값을 해석하여 관심 특징과 관련된 특성이 존재하는 이미지의 위치나 특성을 포함하는 이미지의 수를 결정할 수 있다. 단계 740 이후, 지능형 검출기 시스템 100은 각 이미지와 연관된 수치 값을 기반으로 각 관심 특징에 대한 보고서를 생성할 수 있다(단계 750). 위에서 설명 한 바와 같이, 보고서는 다양한 형태(예: 파일, 디스플레이, 데이터 전송 등)로 전자적으로 제시될 수 있으며 각 요청된 관심 특징의 존재에 대한 정보와 함께 예를 들어 의료 지침에 기반한 추가 정보 및/또는 권장 사항을 포함할 수 있다. 지능형 검출기 시스템 100은 단계 750을 완료한 후 프로세스를 완료하고(단계 799) 예를 들어 컴퓨팅 장치 200에서 방법 700의 실행을 종료한다. 도 8은 본 개시의 구현예와 일치하는 비디오 콘텐츠의 시공간 분석을 위한 예시적인 방법의 동작을 나타내는 흐 름도이다. 방법 800의 단계는 예를 들어 도 2의 컴퓨팅 장치 200의 기능을 실행하거나 사용하는 도 1a의 지능형 검출기 시스템 100에 의해 수행될 수 있다. 도시된 방법 900은 단계의 순서를 수정하고 추가 단계를 포함하도록 변경될 수 있음을 이해할 것이다. 단계 810에서 지능형 검출기 시스템 100은 네트워크 160(도 1a에 표시됨)을 통해 이미지 소스 150(도 1a에 표시 됨)에서 비디오 콘텐츠의 시간적으로 순서화된 이미지 세트에 접근할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 입력 비디오에서 이미지를 추출하여 이미지에 접근할 수 있다. 일부 구현예에서 수신된 이미지는 저장되어 메모리에서 접근될 수 있다. 단계 820에서 지능형 검출기 시스템 100은 시간적으로 순서화된 이미지 세트의 각 이미지에서 특성의 시공간 정 보를 사용하여 시간적으로 순서화된 이미지 세트에서 이벤트의 발생을 검출할 수 있다. 지능형 검출기 시스템 100은 이벤트 감지기 331(도 3c에 표시됨)을 사용하여 이벤트를 검출할 수 있다. 지능형 검출기 시스템 100은 로컬 시공간 처리 모듈 110과 글로벌 시공간 처리 모듈 120을 사용하여 시공간 정보를 결정할 수 있다. 지능형 검출기 시스템 100은 두 단계로 시공간 정보를 결정할 수 있다. 첫째, 로컬 시공간 처리 모듈은 접근한 이미지 세트의 각 이미지를 검토하여 특성에 대한 시공간 정보를 검색할 수 있다. 일부 구현예에서 로컬 시공간 처리 모듈 110은 이미지의 부분 집합을 사용할 수 있다. 둘째, 글로벌 시공간 처리 모듈 120은 로컬 시공간 처리 모 듈 110이 생성한 모든 이미지의 시공간 정보를 검토하여 모든 이미지의 결합된 시공간 정보를 생성할 수 있다. 지능형 검출기 시스템 100은 이벤트 검출 시 비디오 콘텐츠의 타임라인 중 이벤트가 발견된 시간적으로 순서화 된 이미지 세트의 부분 집합과 일치하는 부분에 색상을 추가할 수 있다. 색상은 관심 특징과 관련된 특성에 대한 시간적으로 순서화된 이미지 세트의 부분 집합의 이미지의 관련성 수준 에 따라 변할 수 있다. 색상은 하나 이상의 특성에 대한 시간적으로 순서화된 이미지 세트의 부분 집합의 이미 지의 관련성 수준에 따라 변할 수 있다. 지능형 검출기 시스템 100은 관심 특징의 발생을 나타내는 이벤트가 존재하는 시간적으로 순서화된 이미지 세트 에서 특성의 결정된 시공간 정보를 사용할 수 있다. 단계 830에서 지능형 검출기 시스템 100은 프레임 선택기 332(도 2 기반)를 사용하여 적어도 하나의 관심 특징 과 관련된 특성의 존재를 나타내는 이미지의 연관 점수와 품질 점수를 기반으로 이미지 그룹에서 이미지를 선택 할 수 있다. 지능형 검출기 시스템 100은 품질 네트워크 335를 사용하여 단계 810에서 접근한 이미지의 각 이미 지에 대한 품질 점수를 평가할 수 있다. 프레임 선택기 332는 이미지를 검토하고 품질 네트워크 335가 생성한 품질 점수와 단계 820에서 생성된 특성 점수를 사용하여 정보가 있는 이미지를 결정할 수 있다. 지능형 검출기 시스템 100은 시간적으로 순서화된 이미지 세트의 이미지에 북마크를 추가하여 이미지 프레임을 선택할 수 있다. 단계 840에서 지능형 검출기 시스템 100은 객체 기술자 333을 사용하여 공간 및 시간적 일관성을 기반으로 일치 하는 특성이 있는 이미지의 부분 집합을 병합할 수 있다. 지능형 검출기 시스템은 단계 820에서 결정된 각 이미 지의 특성의 시공간 정보를 사용하여 특성의 공간 및 시간적 일관성을 결정할 수 있다. 단계 850에서 지능형 검출기 시스템 100은 시간 분할기 334(도 3c에 표시됨)를 사용하여 선택된 작업의 시간적 일관성을 만족하는 시간적으로 순서화된 이미지 세트를 분할할 수 있다. 지능형 검출기 시스템 100은 하나 이상 의 관심 특징의 존재가 있는 부분 집합을 식별하여 이미지 세트를 분할할 수 있다. 지능형 검출기 시스템 100은 단계 820에서 결정된 특성의 시공간 정보를 사용하여 시간적 일관성을 결정할 수 있다. 지능형 검출기 시스템 100은 하나 이상의 관심 특징의 일치하는 존재가 있는 경우 이미지가 시간적 일관성을 갖는 것으로 간주할 수있다. 지능형 검출기 시스템 100은 시간적으로 순서화된 이미지 세트의 분할된 부분 집합 중 하나와 일치하는 비디오 콘텐츠의 클립을 추출할 수 있다. 추출된 클립에는 적어도 하나의 관심 특징이 포함될 수 있다. 지능형 검출기 시스템 100은 단계 850을 완료한 후 컴퓨팅 장치 200에서 800 실행을 완료한다(단계 899). 도 9는 본 개시의 구현예와 일치하는 입력 이미지 세트에 대한 복수의 작업을 처리하기 위한 예시적인 방법 900 의 동작을 나타내는 흐름도이다. 방법 900의 단계는 예를 들어 도 2의 컴퓨팅 장치 200의 기능을 실행하거나 사 용하는 도 1a의 지능형 검출기 시스템 100에 의해 수행될 수 있다. 도시된 방법 900은 단계의 순서를 수정하고 추가 단계를 포함하도록 변경될 수 있음을 이해할 것이다. 단계 910에서 지능형 검출기 시스템 100은 복수의 작업(예: 도 6a의 작업 602 및 603)과 이미지 세트를 포함하 는 입력 비디오(예: 도 6a의 입력 비디오 601)를 수신할 수 있다. 수신된 작업 602 및 603 각각은 입력 이미지 세트에서 관심 특징을 식별하기 위한 요청과 관련될 수 있다. 단계 920에서 지능형 검출기 시스템 100은 로컬 시공간 처리 모듈 110(도 1a에 표시됨)을 사용하여 이미지 부분 집합의 각 이미지에서 각 요청된 관심 특징과 관련된 특성의 존재를 식별하기 위해 이미지 세트의 이미지 부분 집합을 분석할 수 있다. 일부 구현예에서 지능형 검출기 시스템 100은 글로벌 시공간 분석 모듈 120을 사용하여 로컬 시공간 처리 모듈 110이 식별한 특성을 정제하여 잘못 식별된 특성을 필터링할 수 있다. 일부 구현예에서 글로벌 시공간 처리 모 듈 120은 로컬 시공간 처리 모듈 110이 식별한 일부 특성을 강조 표시하고 플래그를 지정할 수 있다. 일부 구현 예에서 글로벌 시공간 처리 모듈 120은 품질 네트워크 315 및 분할 네트워크 316과 같은 추가 구성 요소를 사용 하여 필터링할 수 있으며, 이는 입력 이미지에 대한 추가 정보를 생성하기 위해 이미지 세트에 대해 한 번 적용 된다. 단계 930에서 지능형 검출기 시스템 100은 요청된 작업 세트의 각 작업에 대해 시계열 분석 모듈 130의 실행을 반복하여 입력 이미지 세트의 각 이미지에 수치 점수를 연관시킬 수 있다. 일부 구현예에서 지능형 검출기 시스 템 100은 여러 작업을 동시에 처리하기 위해 시계열 모듈 130의 여러 인스턴스를 포함할 수 있다. 예를 들어, 시계열 모듈 671 및 672(도 6b에 표시됨)는 동시에 작업 602 및 603에 대해 동일한 이미지 세트에서 다른 특성 세트를 식별한다. 지능형 검출기 시스템 100은 단계 930을 완료한 후 컴퓨팅 장치 200에서 900 실행을 완료한다 (단계 999). 위의 도면과 설명에 설명된 다이어그램과 구성 요소는 본 개시의 다양한 예시적 구현예에 따른 시스템, 방법 및 컴퓨터 하드웨어 또는 소프트웨어 제품의 아키텍처, 기능 및 동작을 설명한다. 예를 들어, 흐름도나 다이어그램 의 각 블록은 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있으며, 여기에는 지정된 논리적 기능을 구현하기 위한 하나 이상의 실행 가능한 명령이 포함된다. 또한 일부 대체 구현에서는 도면에 표시된 순서대로 기능이 발 생하지 않을 수 있음을 이해해야 한다. 예를 들어, 연속으로 표시된 두 블록이나 단계가 실질적으로 동시에 실 행되거나 구현될 수 있으며, 때로는 기능에 따라 역순으로 실행될 수도 있다. 또한 일부 블록이나 단계는 생략 될 수 있다. 또한 각 블록이나 단계와 블록이나 단계의 조합이 지정된 기능이나 동작을 수행하는 특수 목적 하 드웨어 기반 시스템에 의해 구현되거나 특수 목적 하드웨어와 컴퓨터 명령의 조합으로 구현될 수 있음을 이해해 야 한다. 컴퓨터 프로그램 제품(예: 소프트웨어 또는 프로그램 명령)도 설명된 구현예와 예시된 예를 기반으로 구현될 수 있다. 위에서 설명한 시스템과 방법은 많은 방식으로 변경될 수 있으며 다양한 특징이 다양한 방식으로 결합될 수 있 음을 이해해야 한다. 특히, 특정 구현예나 구현에서 위에 표시된 모든 특징이 필요한 것은 아니다. 또한 위의 특징과 구현의 추가 조합도 본 명세서에 개시된 구현예나 구현의 범위 내에 있는 것으로 간주된다. 특정 구현예와 기능이 본 명세서에 설명되고 예시되었지만, 수정, 대체, 변경 및 등가물이 당업자에게 명백할 것이다. 따라서 첨부된 청구항이 개시된 구현예와 기능의 범위를 포함하도록 의도된다는 점을 이해해야 한다. 또한 본 명세서에 설명된 구현예가 예시적으로만 제시되었으며 제한적이지 않음을 이해해야 한다. 시스템 및/또 는 방법의 일부는 다양한 조합으로 구현될 수 있으며, 상호 배타적인 조합은 제외된다. 예를 들어, 본 명세서에 설명된 구현은 다양한 구현예의 기능, 구성 요소 및/또는 기능의 다양한 조합 및/또는 하위 조합을 포함할 수 있다. 또한 예시적인 구현예가 본 명세서에 설명되었지만, 본 개시의 범위에는 개시된 구현예와 등가인 요소, 수정, 생략, 조합(예: 다양한 구현예에 걸친 측면의 조합), 적응 또는 변경을 갖는 구현예가 포함된다. 또한 청구항의요소는 본 명세서에 설명되거나 현재 출원의 소송 중에 설명된 예에 국한되지 않고 청구항에 사용된 언어를 기 반으로 광범위하게 해석되어야 한다. 대신, 이러한 예는 비배타적인 것으로 해석되어야 한다. 따라서 명세서와 예가 예시적인 것으로만 간주되며, 다음 청구항과 그 전체 등가물의 범위가 진정한 범위와 정신을 나타내는 것으로 의도된다."}
{"patent_id": "10-2025-7003209", "section": "도면", "subsection": "도면설명", "item": 1, "content": "다음 도면은 이 명세서의 일부를 구성하며, 본 개시의 여러 구현예를 예시하고, 설명과 함께 개시된 구현예의 원리 및 특징을 설명하는 데 도움이 된다. 도면에서: 도 1a는 예시적인 지능형 검출기 시스템의 블록도이다. 도 1b는 본 개시의 구현예와 일치하는 실시간 비디오를 처리하기 위한 예시적인 컴퓨터 구현 시스템의 개략도이 다. 도 2는 도 1a의 예시적인 시스템 또는 본 개시의 다른 구현예를 구현하는 데 사용될 수 있는 예시적인 컴퓨팅 장치를 도시한다. 도 3a는 본 개시의 구현예와 일치하는 예시적인 로컬 시공간 처리 모듈의 블록도이다. 도 3b는 본 개시의 구현예와 일치하는 예시적인 글로벌 시공간 처리 모듈의 블록도이다. 도 3c는 본 개시의 구현예와 일치하는 예시적인 타임시리즈 분석 모듈의 블록도이다. 도 4a는 본 개시의 구현예와 일치하는 도 3a의 로컬 시공간 처리 모듈의 인코더 구성요소의 예시적인 훈련을 도 시하는 흐름도이다. 도 4b는 본 개시의 구현예와 일치하는 도 3a의 로컬 시공간 처리 모듈의 신경망 구성요소의 예시적인 훈련을 도 시하는 흐름도이다. 도 4c는 본 개시의 구현예와 일치하는 도 3a의 로컬 시공간 처리 모듈의 품질 네트워크 및 분할 네트워크 구성 요소의 예시적인 훈련을 도시하는 흐름도이다. 도 4d는 본 개시의 구현예와 일치하는 도 3b의 글로벌 시공간 처리 모듈의 예시적인 훈련을 도시하는 흐름도이 다.도 5a 및 5b는 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템의 구성요소로 구성된 파이프라인의 개략도이다. 도 6a 및 6b는 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템을 사용하여 다중 작업을 실행하기 위한 다른 파이프라인 설정을 도시한다. 도 6c 및 6d는 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템을 사용하여 집계된 출력으로 다중 작업을 실행하기 위한 예시적인 파이프라인 설정을 도시한다. 도 6e는 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템을 사용하여 생성된 다중 작업에 대한 출"}
{"patent_id": "10-2025-7003209", "section": "도면", "subsection": "도면설명", "item": 2, "content": "력 요약이 있는 예시적인 대시보드를 도시한다. 도 7은 본 개시의 구현예와 일치하는 영상을 분석하고 관심 특징을 검출하는 예시적인 방법의 작업을 나타내는 흐름도이다. 도 8은 본 개시의 구현예와 일치하는 시공간 영상 분석을 위한 예시적인 방법의 작업을 나타내는 흐름도이다. 도 9는 본 개시의 구현예와 일치하는 입력 영상 세트에 대한 복수의 작업을 처리하기 위한 예시적인 방법의 작 업을 나타내는 흐름도이다."}
{"patent_id": "10-2025-7003209", "section": "도면", "subsection": "도면설명", "item": 3, "content": "도 10은 본 개시의 구현예와 일치하는 예시적인 지능형 검출기 시스템을 사용하여 생성된 출력 요약이 있는 예 시적인 대시보드를 도시한다."}
