{"patent_id": "10-2022-0016534", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0024314", "출원번호": "10-2022-0016534", "발명의 명칭": "데이터 검증 방법, 장치, 설비 및 저장 매체", "출원인": "아폴로 인텔리전트 커넥티비티", "발명자": "쉬 린타오"}}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "데이터 검증 방법으로서,그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 평가 지표의 실제값을 확정하는 단계로서,상기 평가 지표는 교차로 주차율 지표, 도로 구간 속도 지표, 간선 속도 지표 및 간선 주차 횟수 지표 중 적어도 하나를 포함하는, 상기 평가 지표의 실제값을 확정하는 단계;그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 상기 그린 웨이브조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 상기 평가 지표의 이론값을 확정하는 단계;상기 평가 지표의 이론값 및 실제값에 따라, 상기 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율데이터의 합리성에 대해 검증하는 단계를 포함하는 것을 특징으로 하는 데이터 검증 방법."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 상기 그린웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 상기 평가 지표의 이론값을 확정하는 단계는,그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 상기 그린 웨이브조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 그린 웨이브 조율 간선에서 서로 인접한 교차로에서 하류교차로의 차량 통행 상황 및/또는 그린 웨이브 조율 간선에서 간선의 차량 통행 상황을 확정하는 단계;상기 하류 교차로의 차량 통행 상황 및/또는 간선의 차량 통행 상황, 그린 웨이브 조율 속도, 상기 타이밍 조율데이터 및 서로 인접한 교차로 사이의 거리에 따라, 상기 평가 지표의 이론값을 확정하는 단계를 포함하는 것을 특징으로 하는 데이터 검증 방법."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 하류 교차로의 차량 통행 상황, 그린 웨이브 조율 속도, 상기 타이밍 조율 데이터 및 서로 인접한 교차로사이의 거리에 따라, 상기 평가 지표의 이론값을 확정하는 단계는,상기 하류 교차로의 차량 통행 상황이 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로에서 통행을 기다려야 하는 차량이 존재하는 상황이면, 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도 및 상기타이밍 조율 데이터에서 서로 인접한 교차로 신호등 데이터에 따라, 교차로 주차율 지표의 이론값 및/또는 도로구간 속도 지표의 이론값을 확정하는 단계를 포함하되;상기 서로 인접한 교차로 신호등 데이터는 서로 인접한 교차로에서 상류 교차로 신호등이 그린 라이트를 나타내는 제1 지속 시간, 서로 인접한 교차로에서 하류 교차로 신호등이 그린 라이트를 나타내는 제2 지속 시간, 서로인접한 교차로 신호등 사이의 위상차와 하류 교차로 신호등의 주기를 포함하는 것을 특징으로 하는 데이터 검증방법."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도 및 상기 타이밍 조율 데이터에서 서로 인접한 교차로 신호등 데이터에 따라, 교차로 주차율 지표의 이론값을 확정하는 단계는,공개특허 10-2022-0024314-3-상기 제1 지속 시간, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율 속도에 따라, 상류 교차로를 통과한엔드 차량이 하류 교차로에 도착한 시간을 확정하는 단계;확정한 시간, 상기 제2 지속 시간 및 서로 인접한 교차로 신호등 사이의 위상차에 따라, 상류 교차로 신호등에대한 하류 교차로 신호등의 레드 라이트 지속 시간을 확정하는 단계;상기 레드 라이트 지속 시간과 상기 제1 지속 시간의 비율값을 교차로 주차율 지표의 이론값으로 하는 단계를 포함하는 것을 특징으로 하는 데이터 검증 방법."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도 및 상기 타이밍 조율 데이터에서 서로 인접한 교차로 신호등 데이터에 따라, 교차로 주차율 지표의 이론값을 확정하는 단계는,서로 인접한 교차로 신호등 사이의 위상차, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율 속도에 따라,상류 교차로 신호등에 대한 하류 교차로 신호등의 레드 라이트 지속 시간을 확정하는 단계;상기 레드 라이트 지속 시간과 상기 제1 지속 시간의 비율값을 교차로 주차율 지표의 이론값으로 하는 단계를 포함하는 것을 특징으로 하는 데이터 검증 방법."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도 및 상기 타이밍 조율 데이터에서 서로 인접한 교차로 신호등 데이터에 따라, 구간 속도 지표의 이론값을 확정하는 단계는,서로 인접한 교차로 신호등 사이의 위상차, 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도, 하류 교차로 신호등의 주기 및 상기 제1 지속 시간에 따라, 상류 교차로에서 하류 교차로로 주행하는 차량이 하류 교차로를 통과하는 평균 지속 시간을 확정하는 단계;서로 인접한 교차로 사이의 거리와 상기 평균 지속 시간에 따라, 도로 구간 속도 지표의 이론값을 확정하는 단계를 포함하는 것을 특징으로 하는 데이터 검증 방법."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,상기 간선의 차량 통행 상황, 그린 웨이브 조율 속도, 상기 타이밍 조율 데이터 및 서로 인접한 교차로 사이의거리에 따라, 평가 지표의 이론값을 확정하는 단계는,상기 간선의 차량 통행 상황이 상기 그린 웨이브 조율 간선에서 주행하는 차량 중 통행을 기다려야 하는 차량이존재하는 상황이면, 상기 타이밍 데이터에서 서로 인접한 교차로 신호등 사이의 위상차, 교차로 신호등의 주기와 교차로 신호등이 그린 라이트를 나타내는 지속 시간, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율속도에 따라, 차량이 그린 웨이브 조율 간선의 스타트 교차로에서 엔드 교차로로 주행하여 통과한 주행 지속 시간 및/또는 간선 주차 횟수 지표의 이론값을 확정하는 단계;그린 웨이브 조율 간선에서 스타트 교차로와 엔드 교차로 사이의 거리 및 상기 주행 지속 시간에 따라, 간선 속도 지표의 이론값을 확정하는 단계를 포함하는 것을 특징으로 하는 데이터 검증 방법."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "데이터 검증 장치로서,그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 평가 지표의 실제값을 확정하는데 사용되공개특허 10-2022-0024314-4-는 실제값 확정모듈로서, 상기 평가 지표는 교차로 주차율 지표, 도로 구간 속도 지표, 간선 속도 지표 및 간선주차 횟수 지표 중 적어도 하나를 포함하는, 상기 실제값 확정모듈;그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 상기 그린 웨이브조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 상기 평가 지표의 이론값을 확정하는데 사용되는 이론값확정모듈;상기 평가 지표의 이론값 및 실제값에 따라, 상기 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율데이터의 합리성에 대해 검증하는데 사용되는 검증모듈을 포함하는 것을 특징으로 하는 데이터 검증 장치."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 이론값 확정모듈은,그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 상기 그린 웨이브조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 그린 웨이브 조율 간선에서 서로 인접한 교차로에서 하류교차로의 차량 통행 상황 및/또는 그린 웨이브 조율 간선에서 간선의 차량 통행 상황을 확정하는데 사용되는 통행 상황 확정유닛;상기 하류 교차로의 차량 통행 상황 및/또는 간선의 차량 통행 상황, 그린 웨이브 조율 속도, 상기 타이밍 조율데이터 및 서로 인접한 교차로 사이의 거리에 따라, 상기 평가 지표의 이론값을 확정하는데 사용되는 이론값 확정유닛을 포함하는 것을 특징으로 하는 데이터 검증 장치."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 이론값 확정유닛은 구체적으로,상기 하류 교차로의 차량 통행 상황이 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로에서 통행을 기다려야 하는 차량이 존재하는 상황이면, 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도 및 상기타이밍 조율 데이터에서 서로 인접한 교차로 신호등 데이터에 따라, 교차로 주차율 지표의 이론값 및/또는 도로구간 속도 지표의 이론값을 확정하는데 사용되고;상기 서로 인접한 교차로 신호등 데이터는 서로 인접한 교차로에서 상류 교차로 신호등이 그린 라이트를 나타내는 제1 지속 시간, 서로 인접한 교차로에서 하류 교차로 신호등이 그린 라이트를 나타내는 제2 지속 시간, 서로인접한 교차로 신호등 사이의 위상차와 하류 교차로 신호등의 주기를 포함하는 것을 특징으로 하는 데이터 검증장치."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 이론값 확정유닛은 구체적으로,상기 제1 지속 시간, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율 속도에 따라, 상류 교차로를 통과한엔드 차량이 하류 교차로에 도착한 시간을 확정하고;확정한 시간, 상기 제2 지속 시간 및 서로 인접한 교차로 신호등 사이의 위상차에 따라, 상류 교차로 신호등에대한 하류 교차로 신호등의 레드 라이트 지속 시간을 확정하며;상기 레드 라이트 지속 시간과 상기 제1 지속 시간의 비율값을 교차로 주차율 지표의 이론값으로 하는데 사용되는 것을 특징으로 하는 데이터 검증 장치."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2022-0024314-5-제10항에 있어서,상기 이론값 확정유닛은 구체적으로,서로 인접한 교차로 신호등 사이의 위상차, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율 속도에 따라,상류 교차로 신호등에 대한 하류 교차로 신호등의 레드 라이트 지속 시간을 확정하고;상기 레드 라이트 지속 시간과 상기 제1 지속 시간의 비율값을 교차로 주차율 지표의 이론값으로 하는데 사용되는 것을 특징으로 하는 데이터 검증 장치."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "전자 설비로서,적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신연결된 메모리를 포함하되, 상기 메모리는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령을 저장하고, 상기 명령은상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제7항 중 어느 한항에 따른 데이터 검증 방법을 실행하도록 하는 것을 특징으로 하는 전자 설비."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨터 명령을 저장하는 비일시적 컴퓨터 판독가능 저장 매체로서,상기 컴퓨터 명령은 컴퓨터가 제1항 내지 제7항 중 어느 한 항에 따른 데이터 검증 방법을 실행하는데 사용되는것을 특징으로 하는 컴퓨터 명령을 저장하는 비일시적 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2022-0016534", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "컴퓨터 판독가능 저장매체에 저장된 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램 중의 명령이 프로세서에 의해 실행될 경우, 제1항 내지 제7항 중 어느 한 항에 따른 데이터 검증 방법을 구현하는 것을 특징으로 하는 컴퓨터 판독가능 저장매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0016534", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시내용에 의해 제공된 데이터 검증 방법, 장치, 설비 및 저장 매체는 인공 지능 분야에 관한 것으로, 더 나 아가, 지능 교통 기술에 관한 것이다. 구체적인 실시 방안은, 그린 웨이브 조율 간선에서의 교차로 신호등의 타 이밍 조율 데이터의 평가 지표의 실제값을 확정하고; 평가 지표는 교차로 주차율 지표, 도로 구간 속도 지표, 간 선 속도 지표 및 간선 주차 횟수 지표 중 적어도 하나를 포함하며; 그린 웨이브 조율 간선에서의 교차로 신호등 의 타이밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따 라, 평가 지표의 이론값을 확정하고; 평가 지표의 이론값 및 실제값에 따라, 그린 웨이브 조율 간선에서의 교차 로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증하는 것이다. 본 개시내용의 기술을 통해 타이밍 조율 데 이터의 합리성을 검증하기 위한 개선된 새로운 아이디어를 제공한다."}
{"patent_id": "10-2022-0016534", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시내용은 컴퓨터 기술분야에 관한 것이고, 특히 지능 교통 등과 같은 인공 지능 기술에 관한 것이며, 구체 적으로 데이터 검증 방법, 장치, 설비 및 저장 매체에 관한 것이다."}
{"patent_id": "10-2022-0016534", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지능 교통 기술의 발전에 따라, 간선 그린 웨이브 조율 기술(arterial green-wave coordination technology)은 각 도시와 지역에 적용되고 확장되어 도로 교통 혼잡 문제를 해결한다. 여기서, 간선 그린 웨이브 조율 기술에 서 신호 라이트 전환 시간은 동적으로 변화한다. 어떻게 신호 라이트의 동적인 시간이 합리적인가를 평가하고, 그것이 실제로 혼잡 문제를 해결할 수 있는지는 매우 중요하다. 본 개시내용은 데이터 검증 방법, 장치, 설비 및 저장 매체를 제공한다. 본 개시내용의 한 측면에 따르면 데이터 검증 방법을 제공하고, 해당 방법은, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 평가 지표의 실제값을 확정하는 단계-여기 서, 상기 평가 지표는 교차로 주차율 지표, 도로 구간 속도 지표, 간선 속도 지표 및 간선 주차 횟수 지표 중 적어도 하나를 포함함-; 그린 웨이브 조율 간선에서 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 상기 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 상기 평가 지표의 이론값을 확정하는 단계; 상기 평가 지표의 이론값 및 실제값에 따라, 상기 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증하는 단계 를 포함한다. 본 개시내용의 다른 측면에 따르면 데이터 검증 장치를 제공하고, 해당 장치는, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 평가 지표의 실제값을 확정하는데 사용되 는 실제값 확정모듈-여기서, 상기 평가 지표는 교차로 주차율 지표, 도로 구간 속도 지표, 간선 속도 지표 및 간선 주차 횟수 지표 중 적어도 하나를 포함함-; 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 상기 평가 지표의 이론값을 확정하도록 이론값 확정모듈; 상기 평가 지표의 이론값 및 실제값에 따라, 상기 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증하는데 사용되는 검증모듈을 포함한다. 본 개시내용의 다른 측면에 따르면 전자 설비를 제공하고, 해당 전자 설비는, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신연결된 메모리 를 포함하되, 상기 메모리는 상기 적어도 하나의 프로세서에 의해 실행될 수 있는 명령을 저장하고, 상기 명령 은 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 본 개시내용의 어느 한 실시 예에 따른 데이터 검증 방법을 실행하도록 한다. 본 개시내용의 다른 측면에 따르면 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독가능 저장 매체를 제공하고, 여 기서, 상기 컴퓨터 명령은 컴퓨터가 본 개시내용의 어느 하나의 실시예에 따른 데이터 검증 방법을 수행하는데 사용된다. 본 개시내용의 다른 측면에 따르면 컴퓨터 판독가능 저장매체에 저장된 컴퓨터 프로그램을 제공하고, 상기 컴퓨 터 프로그램중의 명령이 프로세서에 의해 실행될 때 본 개시내용의 어느 하나의 실시예에 따른 데이터 검증 방 법을 구현한다. 본 개시내용의 기술에 따라, 타이밍 조율 데이터의 합리성을 검증하기 위한 개선된 새로운 아이디어를 제공한다. 이해해야 하는 것은, 본 부분에서 설명된 내용은 본 개시한 실시예의 핵심 또는 중요한 특징을 식별하기 위한 것이 아니며, 본 개시내용의 범위를 한정하기 위해 사용되는 것도 아니다. 본 개시내용의 다른 특징은 다음 설 명을 통해 쉽게 이해할 수 있을 것이다."}
{"patent_id": "10-2022-0016534", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 도면을 결합하여 본 개시내용의 예시적인 실시예를 설명하며, 이해를 돕기 위해 본 개시내용의 실시예의 각 세부 사항을 포함하되, 이를 단지 예시적인 것으로 간주해야 한다. 따라서, 본 분야의 당업자는, 본 개시내 용의 범위 및 사상을 벗어나지 않는 한, 여기에 설명된 실시예에 대해 여러 가지 변경 및 수정을 수행할 수 있 음을 인식해야 한다. 마찬가지로, 명확성과 간결성을 위해, 이하의 설명에서는 공지된 기능 및 구조에 대한 설 명을 생략한다. 도 1a는 본 개시내용의 실시예에 의해 제공된 데이터 검증 방법의 흐름도이다. 본 개시내용의 실시예는 어떻게 그린 웨이브 조율 간선에서 교차로 신호의 타이밍 조율 데이터(timing coordination data)의 합리성에 대해 검 증하는 것에 적용되고, 즉 그린 웨이브 조율 간선에 대해 구성한 그린 웨이브 밴드의 합리성에 대해 검증하며; 여기서, 이른바 그린 웨이브 조율 간선은 바로 실제 시나리오에서의 어느 하나의 도로이고, 해당 도로는 간선 그린 웨이브 조율 기술을 사용하여 해당 도로에서의 전부 교차로 신호등에 대해 통합 제어하고; 이른바 그린 웨 이브 밴드는 도로 구간 사이의 교차로 신호등이 그린 라이트를 나타내는 시간의 교집합이다. 해당 방법은 데이 터 검증 장치에 의해 실행될 수 있고, 해당 장치는 소프트웨어 및/또는 하드웨어를 사용하는 방식으로 구현될 수 있으며, 데이터 검증 기능이 적재된 계산 설비에 통합될 수 있다. 도 1a에 도시된 바와 같이, 본 실시예에 의해 제공된 데이터 검증 방법은 다음의 단계를 포함할 수 있다. 단계(S101), 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 평가 지표의 실제값을 확정한 다. 본 실시예에서, 이른바 교차로 신호등은 교차로(예를 들어 십자로)에 위치한 신호 라이트(또는 신호등이라고 함)이다. 타이밍 조율 데이터는 교차로 신호등에 대해 통합 제어를 수행하는 데이터이고, 그린 웨이브 조율 간 선에서 어느 하나의 교차로 신호등의 주기와 그린 웨이브를 나타내는 지속 시간을 포함하며, 그린 웨이브 조율 간선에서 서로 인접한 두 개의 교차로 신호등 사이의 위상차 등을 더 포함할 수 있다. 바람직하게, 평가 지표는 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증(판단 또는 평가)하는 지표로 사용되고; 나아가, 본 실시예에서 평가 지표는 교차로 주차율 지표, 교차로 대기열 수 지표, 도로 구간 속도 지표, 간선 속도 지표, 간선 주차 횟수 지표와 중합도 지표 등 중에서 적어도 하나를 포함한다. 여기서, 교차로 주차율 지표는 교차로 주차 확률을 통계하는데 사용되는 수단이고; 이른바 교차로 주차율은 서 로 인접한 교차로에서 상류 교차로의 차량이 하류 교차로를 통과할 때, 주차해야 하는 차량이 총 차량(즉 상류 교차로에서 하류 교차로로 주행하는 차량)에서 점유하는 비율이다. 상류 교차로 및 하류 경로는 차량 주행 방향 을 기준으로 한 것이고, 차량이 가장 먼저 통과한 교차로는 상류 경로이고, 그 다음으로 통과한 교차로는 하류 경로이다. 교차로 대기열 수는 교차로에서 줄을 서서 통행을 기다려야 하는 차량의 개수이다. 대응되게, 간선 주차 횟수 지표는 간선의 디멘션에서 차량 주차 확률을 통계하는 수단이고, 간선 주차 횟수는 간선 스타트 교차 로의 차량이 간선 엔드 교차로를 통과할 때의 평균 주차 횟수이다. 도로 구간 속도 지표는 도로 구간의 디멘션에서 차량의 통행 속도를 통계하는 수단이고, 이른바 도로 구간 속도 는 상류 교차로의 차량이 하류 교차로를 통과할 때 주행하는 평균 속도이다. 대응되게, 간선 속도 지표는 간선 의 디멘션에서 차량 통행 속도를 통계하는 수단이고, 이른바 간선 속도는 간선 스타트 교차로의 차량이 간선 엔 드 교차로를 통과할 때의 평균 주행 속도이다. 더 나아가, 중합도 지표는 그린 웨이브 조율 간선에서의 그린 웨 이브 밴드와 차량 궤적 사이의 중합 정도를 나타내는데 사용되는 지표이다. 예시적으로, 본 실시예에서 어느 하나의 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터에 대한 검증 수요가 있을 때, 지도 애플리케이션의 백엔드 서버에서 해당 그린 웨이브 조율 간선에서의 교차로 신 호등의 타이밍 조율 데이터의 평가 지표의 실제값을 획득한다. 또한 기타 방식을 통해 평가 지표의 실제값을 획 득할 수 있고, 예를 들어 교차로에 설치된 수집 설비에 의해 수집된 시나리오 이미지를 통해 교차로 대기열 수 지표의 실제값을 확정하고; 또는 지도 애플리케이션으로부터 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터를 획득하고, 획득한 궤적 데이터와 교차로의 위치 데이터 등에 따라 교차로 주차율 지표의 실제값 등을 확정할 수 있다. 구체적으로, 획득한 궤적 데이터에 따라 차량의 궤적을 렌더링할 수 있고, 렌더링된 궤적과 교 차로의 위치 데이터 등을 결합하여, 교차로 주차율 지표의 실제값을 확정할 수 있다. 또는 지도 애플리케이션에 서 그린 웨이브 조율 간선에서 주행하는 차량의 어느 하나의 도로 구간에서의 주행 지속 시간 및 해당 도로 구간의 길이를 획득하고 나아가 도로 구간 속도 지표의 실제값을 확정할 수 있다. 예를 들어 해당 도로 구간의 길 이를 해당 도로 구간에서 주행하는 각 차량의 주행 지속 시간으로 나누어, 각 차량의 속도를 얻을 수 있고, 모 든 차량의 속도를 평균하여 도로 구간 속도 지표의 실제값을 얻을 수 있다. 더 나아가, 실제 시나리오에서, 일반적으로 시분할 방식을 사용하여 간선에 대해 그린 웨이브 제어를 수행하며, 예를 들어 아침 저녁 러시아워에는 간선에서의 교차로 신호등에 대해 제어하고, 기타 기간에는 교차로 신호등에 대해 제어하지 않으며; 나아가 또한 해당 그린 웨이브 조율 간선에서의 교차로 신호등에 대해 제어하는 기간 중 어느 하나의 기간을 선택하여, 해당 기간에서의 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데 이터의 평가 지표의 실제값을 획득할 수 있다. 선택적으로, 정확도를 보장하기 위해, 선택한 기간의 지속 시간 은 설정된 값의 범위 내에 있어야 하며, 설정된 값의 범위는 실제 시나리오에서의 그린 웨이브 조율 간선의 길 이, 단일 및 이중 차선 등에 따라 미리 설정할 수 있다. 또한, 본 실시예에서 이력적으로 기록된 평가 지표의 실제값을 획득할 수 있고, 현재 시각의 평가 지표의 실제 값 등을 실시간으로 획득할 수도 있음을 이해해야 한다. 단계(S102), 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 평가 지표의 이론값을 확정한다. 선택적으로, 본 실시예에서는 지도 애플리케이션에서 그린 웨이브 조율 간선에서의 모든 교차로의 위치 데이터 를 획득할 수 있고; 더 나아가, 어느 하나의 교차로의 위치 데이터는 해당 교차로의 좌표를 포함한다. 한편, 지 도 애플리케이션에서 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터를 획득할 수 있고; 본 실시예에 서 그린 웨이브 조율 간선에서 주행하는 차량은 바람직하게는 그린 웨이브 조율 간선에서 주행하는 모든 차량이 다. 예시적으로, 평가 지표의 이론값을 확정하는 하나의 선택 가능한 실시 방식은 다음과 같다. 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터와 교차로의 위치 데이터에 따라, 간선 그린 웨이브 도를 렌더 링하고, 예를 들어 도 1b에 도시된 바와 같이, 여기서 검은 색으로 채워진 것은 교차로 신호등이 레드로 나타내 는 것을 표시하고, 채워지지 못한 표시 교차로 신호등은 그린을 나타내며, 도로 구간 사이의 교차로 신호등이 그린 라이트로 나타내는 시간의 교집이 그린 웨이브 밴드를 구성하고, 도 1b는 단일 차선의 간선 그린 웨이브 도를 나타내고, 본 실시예에는 이중 차선을 동시에 나타내는 간선 그린 웨이브 도도 제공한다. 획득한 궤적 데 이터에 대해 처리하여 궤적점의 경위도 좌표를 시간의 변화에 따른 변위 데이터로 변환하고, 처리된 데이터를 간선 그린 웨이브 도에 렌더링하여, 궤적-그린 웨이브 도를 획득한다. 예를 들어 도 1c에 도시된 바와 같이, 본 실시예의 그린 웨이브 조율 간선에서의 차량은 복수 개이고, 따라서 관련된 궤적도 복수 개이며, 도 1c는 하나 의 차량의 궤적으로 예시하고, 이에 대해 한정하지 않는다. 교차로의 인접관계에 따라, 획득한 궤적-그린 웨이 브 도에 대해 분할하면(예를 들어 서로 인접한 두 개의 교차로 사이의 도를 하나의 서브 도로 함), 복수의 서브 도를 획득할 수 있다. 각 서브 도에 대해, 기설정된 인접한 교차로 주행 시나리오 도에서 해당 서브 도와 매칭 되는 시나리오 도를 선택하며, 선택된 시나리오 도의 교차로 주차율 지표의 수치를 해당 서브 도에 대응되는 교 차로 주차율 지표의 이론값으로 하고, 아울러 선택한 시나리오 도의 도로 구간 속도 지표의 수치를 해당 서브 도에 대응되는 도로 구간 속도 지표의 이론값으로 한다. 여기서, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 매초마다 주행 차량이 있다고 가정하는 등 데이터에 따라 복수의 인접한 교차로 주행 시나리오 도를 렌더링한다. 더 나아가, 렌더링된 궤적-그린 웨이브 도를 기설정된 해당 그린 웨이브 조율 간선과 관련된 궤적-그린 웨이브 도와 매칭하고, 매칭된 궤적-그린 웨이브 도와 관련된 평가 지표의 수치, 예를 들어 간선 주차 횟수 지표의 수 치를 간선 주차 횟수 지표의 이론값으로 하고, 중합도 지표의 수치를 중합도 지표의 이론값으로 하는 등일 수도 있다. 예시적으로, 기타 방식을 사용하여 평가 지표의 이론값을 확정할 수도 있고, 구체적으로 아래의 실시예로 설명 한다. 단계(S103), 평가 지표의 이론값 및 실제값에 따라, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증한다. 선택적으로, 평가 지표의 이론값과 실제값을 확정한 후, 평가 지표의 이론값을 실제값과 비교할 수 있으며, 어 느 하나의 평가 지표의 실제값과 평가 지표의 이론값 사이의 차이값이 설정된 범위 내에 있으면, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터가 합리한 것으로 확정할 수 있다. 반대로, 어느 하나의평가 지표의 이론값과 실제값 사이의 차이값이 설정된 범위 내에 없으면, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터가 불합리한 것으로 확정하고, 즉 그린 웨이브 조율 간선에서 설정한 그린 웨이브 밴드가 불합리한 것으로 확정한다. 더 나아가, 교차로 신호등의 타이밍 조율 데이터의 합리 여부에 대한 직관적인 판단의 편리를 위해, 본 실시예 에 렌더링된 궤적-그린 웨이브 도에서, 그린을 사용하여 차량의 궤적과 그린 웨이브의 중합을 나타내고, 레드로 차량이 교차로에서 그린 라이트를 대기하는 것을 나타내며; 아울러, 각 평가 지표의 이론값과 실제값은 궤적-그 린 웨이브 도와 함께 사용자에게 표현된다. 또한, 평가 지표의 실제값과 이론값 사이가 설정된 범위 내에 없는 경우, 또한 해당 평가 지표의 실제값을 강조된 형식으로 표시하여 사용자의 직관적인 포지셔닝에 편리하다. 예시적으로, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터가 불합리한 것으로 확정되면, 관련 조정 제안을 제공할 수도 있다. 예를 들어, 어느 하나의 교차로 주차율 지표의 실제값이 이론값보다 훨씬 큰 경우, 해당 교차로 신호등이 나타내는 그린 라이트의 지속 시간을 연장하도록 제안할 수 있고 즉 교차로 사 이의 그린 웨이브 밴드를 넓히는 것을 제안할 수 있다. 본 개시내용의 실시예에 의해 제공된 기술 방안에 따르면, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이 밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라 평 가 지표의 이론값을 확정하고, 평가 지표의 이론값과 획득한 평가 지표의 실제값에 따라, 그린 웨이브 조율 간 선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증한다. 상기 방안은 교차로, 도로 구간 및 간선을 포함하는 세 개의 디멘션을 통해, 타이밍 조율 데이터에 대해 전면적으로 평가하고, 교차로 신호등의 타 이밍 조율 데이터의 합리성을 직관적이고 진실하며 정확하게 판단할 수 있으며; 아울러, 본 방안은 그린 웨이브 조율 간선에서 주행하는 모든 차량의 궤적 데이터, 즉 풍부한 데이터양에 기반하므로, 교차로 신호등의 타이밍 조율 데이터의 합리성을 확정하는 정확도를 크게 향상하고, 검증 타이밍 조율 데이터의 합리성을 위해 개선되고 새로운 아이디어를 제공한다. 도 2는 본 개시내용의 실시예에 의해 제공된 다른 하나의 데이터 검증 방법의 흐름도이다. 본 개시내용의 실시 예는 상기 실시예에 기초하여, 평가 지표의 이론값을 확정하는 것에 대해 보다 구체적으로 설명한다. 도 2에 도 시 된 바와 같이, 본 실시예에 의해 제공된 데이터 검증 방법은 다음 단계를 포함할 수 있다. 단계(S201), 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 평가 지표의 실제값을 확정한 다. 여기서, 평가 지표는 교차로 주차율 지표, 도로 구간 속도 지표, 간선 속도 지표 및 간선 주차 횟수 지표 중 적 어도 하나를 포함한다. 단계(S202), 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 그린 웨이브 조율 간선에서 서로 인접한 교차로에 서 하류 교차로의 차량 통행 상황 및/또는 그린 웨이브 조율 간선에서 간선의 차량 통행 상황을 확정한다. 본 실시예에서, 서로 인접한 교차로에서 하류 교차로의 차량 통행 상황은 교차로 디멘션에서 통계한 차량의 통 행 상황이고, 즉 상류 교차로에서 하류 교차로로 주행하는 차량의 통행 상황이다. 구체적으로 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로에서 통행을 기다려야 하는 차량이 존재하는 상황, 또는 상류 교차 로에서 하류 교차로로 주행하는 차량 중 하류 교차로에서 통행을 기다려야 하는 차량이 존재하지 않은 상황일 수 있다. 대응되게, 간선의 차량 통행 상황은 간선 디멘션에서 통계한 차량의 통행 상황이고, 즉 그린 웨이브 조율 간선의 스타트 교차로에서 엔드 교차로로 주행하는 차량의 통행 상황이며, 구체적으로 그린 웨이브 조율 간선에서 주행하는 차량 중 통행을 기다려야 하는 차량이 존재하는 상황, 또는 그린 웨이브 조율 간선에서 주행 하는 차량 중 통행을 기다려야 하는 차량이 존재하지 않은 상황일 수 있다. 선택적으로, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터 및 교차로의 위치 데이터에 따 라, 간선 그린 웨이브 도를 렌더링하고; 획득한 궤적 데이터에 대해 처리하여, 궤적점의 경위도 좌표를 시간의 변화에 따른 변위 데이터로 전환하며; 처리된 데이터를 간선 그린 웨이브 도에 렌더링하여, 궤적-그린 웨이브 도를 획득하고; 획득한 궤적-그린 웨이브 도에 대해 분석하여, 그린 웨이브 조율 간선에서의 어느 하나의 서로 인접한 교차로에서 하류 교차로의 차량 통행 상황 및/또는 그린 웨이브 조율 간선에서 간선의 차량 통행 상황을 획득할 수 있다. 단계(S203), 하류 교차로의 차량 통행 상황 및/또는 간선의 차량 통행 상황, 그린 웨이브 조율 속도, 타이밍 조 율 데이터 및 서로 인접한 교차로 사이의 거리에 따라, 평가 지표의 이론값을 확정한다. 본 실시예에서, 이른바 그린 웨이브 조율 속도는 그린 웨이브 조율 간선의 설계 속도이고, 또한 이상적인 속도 이며, 즉 이상적인 상황에서, 사용자가 그린 웨이브 조율 속도로 그린 웨이브 조율 간선에서 주행하면 그린 라 이트로 끝까지 통행할 수 있고; 이른바 서로 인접한 교차로 사이의 거리는 서로 인접한 두 개의 교차로에서 상 류 교차로와 하류 교차로 사이의 거리이고, 서로 인접한 교차로 사이의 거리는 지도 애플리케이션에서 직접 획 득할 수 있고, 또한 교차로의 위치 데이터를 통해 확정할 수 있으며, 본 실시예는 이에 대해 한정하지 않는다. 선택적으로, 하류 교차로의 차량 통행 상황, 그린 웨이브 조율 속도, 그린 웨이브 조율 간선에서의 교차로 신호 등의 타이밍 조율 데이터 및 서로 인접한 교차로 사이의 거리에 따라, 교차로 주차율 지표의 이론값, 교차로 대 기열 수 지표의 이론값 및 도로 구간 속도 지표의 이론값을 확정할 수 있다. 예를 들어, 하류 교차로의 차량 통 행 상황이 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로에서 통행을 기다려야 하는 차량이 존 재하는 상황이면, 타이밍 조율 데이터에서 상류 교차로 및 하류 교차로의 관련 데이터, 서로 인접한 교차로 사 이의 거리 및 그린 웨이브 조율 속도에 따라, 차량이 상류 교차로에서 하류 교차로로 주행할 때 필요한 평균 주 행 지속 시간을 확정할 수 있고; 서로 인접한 교차로 사이의 거리를 확정한 평균 주행 지속 시간으로 나누어 도 로 구간 속도 지표의 이론값을 획득할 수 있다. 더 나아가, 간선의 차량 통행 상황, 그린 웨이브 조율 속도, 그린 웨이브 조율 간선에서의 교차로 신호등의 타 이밍 조율 데이터 및 서로 인접한 교차로 사이의 거리에 따라, 간선 속도 지표의 이론값, 간선 주차 횟수 지표 의 이론값 및 중합도 지표의 이론값 등을 확정할 수 있다. 예를 들어, 그린 웨이브 조율 간선에서의 어느 하나 의 서로 인접한 교차로 사이의 거리에 따라, 그린 웨이브 조율 간선에서 스타트 교차로와 엔드 교차로 사이의 거리를 확정하고; 나아가 간선의 차량 통행 상황, 그린 웨이브 조율 속도, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터 및 그린 웨이브 조율 간선에서 스타트 교차로와 엔드 교차로 사이의 거리에 따라, 간선 속도 지표의 이론값을 확정할 수 있다. 더 나아가, 하류 교차로의 차량 통행 상황 및 간선의 차량 통행 상황, 그린 웨이브 조율 속도, 그린 웨이브 조 율 간선에서의 교차로 신호등의 타이밍 조율 데이터 및 서로 인접한 교차로 사이의 거리에 따라, 어느 하나의 평가 지표의 이론값을 확정할 수 있다. 단계(S204), 평가 지표의 이론값 및 실제값에 따라, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증한다. 본 개시내용의 실시예에 의해 제공된 기술 방안에 따르면, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이 밍 조율 데이터, 교차로의 위치 데이터, 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터 및 그린 웨이 브 조율 속도 등 다중 디멘션 데이터를 인입하여 전면적으로 분석하는 것을 통해 교차로, 도로 구간 및 간선 등 상이한 디멘션 평가 지표의 이론값을 정확하게 확정하고, 후속에 타이밍 조율 데이터의 합리성 검증을 진행하는 데 데이터 지원을 제공하고; 그 다음에 평가 지표의 이론값 및 획득한 평가 지표의 실제값을 기반으로, 그린 웨 이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대한 검증을 구현한다. 도 3a는 본 개시내용의 실시예에 의해 제공된 또 다른 하나의 데이터 검증 방법의 흐름도이다. 본 개시내용의 실시예는 상기 실시예에 기초하여, 평가 지표의 이론값을 확정하는 것에 대해 보다 구체적으로 설명한다. 도 3a 에 도시된 바와 같이, 본 실시예에 의해 제공된 데이터 검증 방법은 다음의 단계를 포함할 수 있다. 단계(S301), 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 평가 지표의 실제값을 확정하 고, 여기서, 평가 지표는 교차로 주차율 지표, 도로 구간 속도 지표, 간선 속도 지표 및 간선 주차 횟수 지표 중 적어도 하나를 포함한다. 단계(S302), 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 그린 웨이브 조율 간선에서 서로 인접한 교차로에 서 하류 교차로의 차량 통행 상황을 확정한다. 단계(S303), 하류 교차로의 차량 통행 상황이 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로에 서 통행을 기다려야 하는 차량이 존재하는 상황이면, 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도 및 타이밍 조율 데이터에서 서로 인접한 교차로 신호등 데이터에 따라, 교차로 주차율 지표의 이론값 및/또는 도로 구간 속도 지표의 이론값을 확정한다. 여기서, 서로 인접한 교차로 신호등 데이터는 서로 인접한 교차로에서 상류 교차로 신호등이 그린 라이트를 나 타내는 제1 지속 시간, 서로 인접한 교차로에서 하류 교차로 신호등이 그린 라이트를 나타내는 제2 지속 시간, 서로 인접한 교차로 신호등 사이의 위상차와 하류 교차로 신호등의 주기를 포함한다. 본 실시예에서, 제1 지속 시간과 제2 지속 시간은 동일하거나 상이할 수 있다. 선택적으로, 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로 통행을 기다려야 하는 차량인 경우, 상류 교차로를 통과하는 시간(또는 순서라고도 함)이 상이하고, 따라서 하류 교차로에서 통행을 기다려야 하는 시간이 상이하며, 교차로 주차율 지표의 이론값 및/또는 도로 구간 속도 지표의 이론값을 확정하는 방식도 상이 하다. 예시적으로, 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로 통행을 기다려야 하는 차량이 상류 교차로 신호등이 그린 라이트를 나타낸 후의 처음 n대의 상류 교차로를 통과한 차량(예를 들어 도 3b에 도시된 바와 같이, 검은 색으로 채워진 것은 교차로 신호등이 레드로 나타내는 것을 표시하고, 채워지지 못한 표시 교 차로 신호등은 그린을 나타내며, 여기서A와 B 두 개의 교차로이고, A 교차로는 상류 교차로이고 B 교차로는 하 류 교차로이며, 처음으로 A 교차로를 통과한 차량(Q1)은 B 교차로에서 통행을 기다려야 하고, 마지막으로 A 교 차로를 통과한 차량(Q2)는 B 교차로에서 통행을 기다려야 할 필요가 없으며, 차량(Q1)과 차량(Q2)사이에는 기타 차량(도 3b에 도시되지 않음)이 존재하고, 이러한 차량도 B 교차로에 도착하면 기다릴 필요가 없음)이면, 서로 인접한 교차로 신호등 사이의 위상차, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율 속도에 따라, 상류 교차로 신호등에 대한 하류 교차로 신호등의 레드 라이트 지속 시간을 확정하고; 레드 라이트 지속 시간과 제1 지속 시간의 비율값을 교차로 주차율 지표의 이론값으로 한다. 그린 웨이브 조율 간선에서 주행하는 차량의 속도가 그린 웨이브 조율 속도 (V)라 하고 가정하고, 서로 인접한 교차로 사이의 거리는 S로 표시하고, 서로 인접한 교차로 신호등 사이의 위상차는 M로 표시하고, 제1 지속 시간 은 G1로 표시하고, B 교차로 신호등의 주기는 C로 표시한다. 구체적으로, 본 실시예에서 서로 인접한 교차로 사 이의 거리(S)를 그린 웨이브 조율 속도(V)로 나누어, 어느 하나의 차량이 A 교차로에서 B 교차로로 주행할 때 필요한 주행 지속 시간(즉 S/V)을 얻을 수 있다. 차량(Q1)은 B 교차로에서 통행을 기다려야 하기 때문에, A 교 차로 신호등과 B 교차로 신호등 사이의 위상차(M)가 주행 지속 시간(S/V)보다 큰 것을 의미하고, 따라서, A 교 차로 신호등과 B 교차로 신호등 사이의 위상차(M)에서 주행 지속 시간(S/V)를 감하여 상류 교차로 신호등에 대 한 하류 교차로 신호등의 레드 라이트 지속 시간(즉 M-S/V)을 획득할 수 있고; 그 다음에 획득한 레드 라이트 지속 시간과 제1 지속 시간(G1)의 비율 값(즉 (M-S/V)/G1)을 획득하여 교차로 주차율 지표의 이론값으로 한다. 아울러 해당 시나리오에서, 서로 인접한 교차로 신호등 사이의 위상차, 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도, 하류 교차로 신호등의 주기 및 제1 지속 시간에 따라, 상류 교차로에서 하류 교차로로 주행 하는 차량이 하류 교차로를 통과하는 평균 지속 시간을 확정할 수도 있고; 서로 인접한 교차로 사이의 거리와 평균 지속 시간에 따라, 도로 구간 속도 지표의 이론값을 확정할 수 있다. 본 실시예에서, 하류 교차로 신호등 의 주기는 C로 표시할 수 있다. 본 실시예에서 서로 인접한 교차로 사이의 거리(S)를 그린 웨이브 조율 속도(V)로 나누어, 어느 하나의 차량이 A 교차로에서 B 교차로로 주행할 때 필요한 주행 지속 시간(즉 S/V)을 얻을 수 있고; 차량(Q1)은 B 교차로에서 통행을 기다려야 하기 때문에, A 교차로 신호등과 B 교차로 신호등 사이의 위상차(M)는 주행 지속 시간(S/V)보 다 큰 것을 의미하고, 따라서 A 교차로 신호등과 B 교차로 신호등 사이의 위상차(M)에서 주행 지속 시간(S/V)를 감하여 상류 교차로 신호등에 대한 하류 교차로 신호등의 레드 라이트 지속 시간(즉 M-S/V)을 획득할 수 있고; ((M-S/V)/2+ S/V)를 교차로 주차율 지표의 이론값(즉 (M-S/V)/G1)과 곱하면, 레드 라이트 지속 시간 내에 A 교 차로에서 B 교차로로 주행하는 차량이 B 교차로를 통과하는 평균 지속 시간(L1)을 획득하며; 더 나아가, 상기 설명에 따라, 교차로 주차율 지표의 이론값이 (M-S/V)/G1인 것을 알 수 있고, 따라서 교차로 통행률이 1-(M- S/V)/G1인 것을 알 수 있으며, 따라서 (1-(M-S/V)/G1)를 S/V과 곱하면, B 교차로가 그린 라이트를 나타낸 제2 지속 시간(G2) 내에 A 교차로에서 B 교차로로 주행하는 차량이 B 교차로의 평균 지속 시간(L2)을 획득하고; 그 다음에 서로 인접한 교차로 사이의 거리(S)를 평균 지속 시간의 합(즉 L1 더하기 L2)으로 나누어 도로 구간 속 도 지표의 이론값을 획득한다. 더 나아가, 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로 통행을 기다려야 하는 차량이 상류 교차로 신호등이 그린 라이트를 나타낸 후의 마지막 n대의 상류 교차로를 통과한 차량(예를 들어 도 3c에 도시 된 바와 같이, A와 B 두 개의 교차로이고, A 교차로는 상류 교차로이고 B 교차로는 하류 교차로이며, A 교차로 를 통과한 차량(Q1), 차량(Q2) 및 차량(Q1)과 차량(Q2) 사이의 기타 차량(도 3c에 도시 되지 않음)은 B 교차로 를 직접 통과할 수 있고, A 교차로를 통과한 차량(Q3), 차량(Q4) 및 차량(Q3)과 차량(Q4) 사이의 기타 차량(도3c에 도시 되지 않음)은 B 교차로에서 통행을 기다려야 함)이면, 제1 지속 시간, 서로 인접한 교차로 사이의 거 리 및 그린 웨이브 조율 속도에 따라, 상류 교차로를 통과한 엔드 차량이 하류 교차로에 도착한 시간을 확정하 고; 확정한 시간, 제2 지속 시간 및 서로 인접한 교차로 신호등 사이의 위상차에 따라, 상류 교차로 신호등에 대한 하류 교차로 신호등의 레드 라이트 지속 시간을 확정하며; 레드 라이트 지속 시간과 제1 지속 시간의 비율 값을 교차로 주차율 지표의 이론값으로 한다. 구체적으로, 서로 인접한 교차로 사이의 거리(S)를 그린 웨이브 조율 속도(V)로 나누어, 어느 하나의 차량이 A 교차로에서 B 교차로로 주행할 때 필요한 주행 지속 시간(즉 S/V)을 얻을 수 있고; 차량(Q4)(즉 상류 교차로를 통과하는 엔드 차량)이 B 교차로에 도착하는 시간은 제2 지속 시간(G1)에 주행 지속 시간(S/V)을 더한 값이며; 확정한 시간(즉 G1+S/V)에서 제2 지속 시간(G2)과 A 교차로 신호등이 B 교차로 신호등 사이의 위상차(M)를 감하 여 상류 교차로 신호등에 대한(즉A 교차로 신호등) 하류 교차로 신호등(즉 B 교차로 신호등)의 레드 라이트 지 속 시간 (즉(G1+S/V)-G2-M)을 획득하고; 그 다음에 획득한 레드 라이트 지속 시간과 제1 지속 시간(G1)의 비율 (즉((G1+S/V)-G2-M)/G1)을, 교차로 주차율 지표의 이론값으로 한다. 아울러 해당 시나리오에서, 서로 인접한 교차로 신호등 사이의 위상차(M), 서로 인접한 교차로 사이의 거리(S), 그린 웨이브 조율 속도(V), 하류 교차로 신호등의 주기(C) 및 제1 지속 시간(G1)에 따라, 상류 교차로에서 하류 교차로로 주행하는 차량이 하류 교차로를 통과하는 평균 지속 시간을 확정할 수 있고; 서로 인접한 교차로 사이 의 거리(S)와 평균 지속 시간에 따라, 도로 구간 속도 지표의 이론값을 확정할 수 있다. 구체적으로, 서로 인접한 교차로 사이의 거리(S)를 그린 웨이브 조율 속도(V)로 나누어 어느 하나의 차량이 A 교차로에서 B 교차로로 주행할 때 필요한 주행 지속 시간(즉 S/V)을 얻을 수 있고, 차량(Q1)이 B 교차로에서 통 행을 기다릴 필요가 없기 때문에, A 교차로 신호등과 B 교차로 신호등 사이의 위상차(M)가 주행 지속 시간(S/ V)보다 작은 것을 의미하고, 즉 차량(Q1)이 A 교차로에서 B 교차로로 주행할 때 필요한 주행 지속 시간은 차량 (Q1)이 B 교차로에 도착하는 시간이며; 차량(Q1)의 주행 지속 시간((S/V)-M)을 사용하면, B 교차로가 그린 라이 트를 나타낸 후의 차량이 통행하지 않은 지속 시간을 얻을 수 있고, 하류 교차로 신호등의 주기(C)에서 계산된 지속 시간(즉 S/V-M)을 감하여 A 교차로에서 B 교차로에 도착한 모든 차량이 B 교차로에서 전부 통행할 때 필요 한 지속 시간(즉 C-(S/V-M))을 획득하며; 다 나아가, A 교차로에서 B 교차로에 도착하는 모든 차량이 B 교차로 B 교차로에서 전부 통행할 때 필요한 지속 시간 C-(S/V-M)에 제1 지속 시간(G1)을 더하고 평균 값을 취하면, 상 류 교차로에서 하류 교차로로 주행하는 차량이 하류 교차로를 통과하는 평균 지속 시간(즉 (C-(S/V-M)+G1)/2)을 획득할 수 있고; 따라서 서로 인접한 교차로 사이의 거리(S)를 평균 지속 시간((C-(S/V-M)+G1)/2)으로 나누어 도로 구간 속도 지표의 이론값(즉 S/((C-(S/V-M)+G1)/2))을 획득할 수 있다. 예시적으로, 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로에서 통행을 기다려야 하는 차량이 상류 교차로 신호등이 그린 라이트를 나타낸 후의 처음 n대 또는 마지막 n대의 상류 교차로를 통과한 차량(예를 들어 도 3d에 도시된 바와 같이, A와 B 두 개의 교차로이고, A 교차로는 상류 교차로이고, B 교차로는 하류 교 차로이며, 처음으로 A 교차로를 통과한 차량(Q1)은 B 교차로에서 통행을 기다려야 하고, A 교차로를 통과한 차 량(Q3), 차량(Q4) 및 차량(Q3)과 차량(Q4) 사이의 기타 차량(도 3d에 도시되지 않음)은 B 교차로에서 통행을 기 다려야 하고, A 교차로를 통과한 차량(Q2), 차량(Q1)과 차량(Q2) 사이의 기타 차량(도 3d에 도시되지 않음) 및 차량(Q2)와 차량(Q3) 사이의 기타 차량(도 3d에 도시되지 않음)은 직접 B 교차로를 통과함)이면, 제2 지속 시간 (G2)을 직접 제1 지속 시간(G1)으로 나누어, 교차로 그린 라이트 통과율(즉 G2/G1)을 획득하고, 따라서 1에서 G2/G1를 감하여 교차로 주차율 지표의 이론값을 획득할 수 있다. 아울러 해당 시나리오에서, 서로 인접한 교차로 신호등 사이의 위상차, 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도, 하류 교차로 신호등의 주기 및 제1 지속 시간에 따라, 상류 교차로에서 하류 교차로로 주행 하는 차량이 하류 교차로를 통과하는 평균 지속 시간을 확정할 수도 있고; 서로 인접한 교차로 사이의 거리와 평균 지속 시간에 따라, 도로 구간 속도 지표의 이론값을 확정할 수 있다. 구체적으로, 본 실시예에서 서로 인접한 교차로 사이의 거리(S)를 그린 웨이브 조율 속도(V)로 나누어, 어느 하 나의 차량이 A 교차로에서 B 교차로로 주행할 때 필요한 주행 지속 시간(즉 S/V)을 얻을 수 있고; 차량(Q1)은 B 교차로에서 통행을 기다려야 하기 때문에, A 교차로 신호등과 B 교차로 신호등 사이의 위상차(M)는 주행 지속 시간(S/V)보다 큰 것을 의미하고, A 교차로 신호등과 B 교차로 신호등 사이의 위상차(M)에서 주행 지속 시간 (S/V)를 감하여 상류 교차로 신호등에 대한 하류 교차로 신호등의 레드 라이트 지속 시간(즉 M-S/V)을 획득할 수 있고; 하류 교차로 신호등의 주기(C)에 레드 라이트 지속 시간(M-S/V)을 더하면, A 교차로에서 B 교차로에 도착할 때 모든 차량이 B 교차로에서 전부 통행할 때 필요한 지속 시간(C+(M-S/V))을 획득하며; 더 나아가, A교차로에서 B 교차로에 도착할 때 모든 차량이 B 교차로에서 전부 통행할 때 필요한 지속 시간(C+(M-S/V))에 제 1 지속 시간(G1)을 더하고 평균 값을 취하면, 상류 교차로에서 하류 교차로로 주행하는 차량이 하류 교차로를 통과하는 평균 지속 시간(즉 (C+(M-S/V)+G1)/2)을 획득하고; 따라서 서로 인접한 교차로 사이의 거리(S)를 평균 지속 시간((C+(M-S/V)+G1)/2)으로 나누어 도로 구간 속도 지표의 이론값(즉 S/((C+(M-S/V)+G1)/2))을 획득할 수 있다. 설명해야 한 것은, 그린 웨이브 조율 간선에서의 각 교차로에 대해, 해당 교차로의 차량 통행 상황에 따라, 대 응되는 방식을 선택하여 해당 교차로의 교차로 주차율 지표의 이론값을 선택할 수 있다. 더 나아가, 교차로 주 차율은 차량이 상류 교차로에서 하류 교차로로 주행하는 통행 상황에 따라 확정된 것으로, 따라서 그린 웨이브 조율 간선이 단일 차선인 경우, 그린 웨이브 조율 간선의 스타트 교차로의 교차로 주차율 지표를 무시할 수 있 다. 또한, 그린 웨이브 조율 속도는 이상적인 속도이므로, 그린 웨이브 조율 속도를 직접 실제 속도(즉 도로 구 간 속도 지표의 실제값)와 비교하는 것을 통해 타이밍 조율 데이터의 합리성을 확정하는 정확도가 비교적으로 낮지만, 본 개시내용은 실제 시나리오에서 가능하게 존재하는 시나리오에 결합하고, 그린 웨이브 조율 데이터에 따라, 서로 인접한 교차로 사이의 거리 및 타이밍 조율 데이터 등 다중 디멘션 데이터, 도로 구간 속도 지표의 이론값을 확정하고, 확정한 이론값을 기반으로 획득한 실제값과 비교하여 속도 디멘션에서 진실하고 정확하게 타이밍 조율 데이터의 합리성을 확정한다. 또한, 본 개시내용은 실제 시나리오에서 가능하게 존재하는 시나리오 에 결합하여, 다양한 교차로 주차율 지표의 이론값의 계산 방식을 제공하고, 방안의 사용 시나리오를 크게 확장 하며, 아울러 교차로 디멘션에서 타이밍 조율 데이터의 합리성을 전면적으로 분석할 수 있다. 단계(S304), 교차로 주차율 지표의 이론값 및 실제값 및/또는 도로 구간 속도 지표의 이론값 및 실제값에 따라, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증한다. 본 개시내용의 실시예에 의해 제공된 기술 방안에 따르면, 하류 교차로의 차량 통행 상황을 인입하고 그린 웨이 브 조율 데이터, 서로 인접한 교차로 사이의 거리 및 타이밍 조율 데이터 등 다중 디멘션 데이터를 기반으로, 교차로 주차율 지표의 이론값 및 도로 구간 속도 지표의 이론값을 확정하는 것을 통해, 교차로 주차율 지표의 이론값 및 도로 구간 속도 지표의 이론값을 위해 선택가능한 방식을 제공하며, 나아가 후속에 타이밍 조율 데이 터의 합리성 검증을 수행하는데 데이터 지원을 제공한다. 아울러, 교차로 디멘션에서 타이밍 조율 데이터에 대 해 분석을 통해 특정 교차로 지표가 불합리한 현상이 존재하는 경우를 직접 포지셔닝할 수 있고, 타깃성 조정에 편리하며, 조정 효율을 절약한다. 도 4a는 본 개시내용의 실시예에 의해 제공된 또 다른 하나의 데이터 검증 방법의 흐름도이다. 본 개시내용의 실시예는 상기 실시예에 기초하여, 평가 지표의 이론값을 확정하는 것에 대해 보다 구체적으로 설명한다. 도 4a 에 도시된 바와 같이, 본 실시예에 의해 제공된 데이터 검증 방법은 다음의 단계를 포함할 수 있다. 단계(S401), 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 평가 지표의 실제값을 확정하 고, 여기서, 평가 지표는 교차로 주차율 지표, 도로 구간 속도 지표, 간선 속도 지표 및 간선 주차 횟수 지표 중 적어도 하나를 포함한다. 단계(S402), 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 그린 웨이브 조율 간선에서 간선의 차량 통행 상황 을 확정한다. 단계(S403), 간선의 차량 통행 상황이 그린 웨이브 조율 간선에서 주행하는 차량 중 통행을 기다려야 하는 차량 이 존재하는 상황이면, 타이밍 데이터에서 서로 인접한 교차로 신호등 사이의 위상차, 교차로 신호등의 주기와 교차로 신호등이 그린 라이트를 나타내는 지속 시간, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율 속 도에 따라, 차량이 그린 웨이브 조율 간선의 스타트 교차로에서 엔드 교차로로 주행하여 통과한 주행 지속 시간 및/또는 간선 주차 횟수 지표의 이론값을 확정한다. 구체적으로, 그린 웨이브 조율 간선의 스타트 교차로에서 엔드 교차로로 주행하여 통과한 각 차량에 대해, 타이 밍 데이터에서 서로 인접한 교차로 신호등 사이의 위상차(M), 교차로 신호등의 주기와 교차로 신호등이 그린 라 이트를 나타내는 지속 시간(L), 서로 인접한 교차로 사이의 거리(S) 및 그린 웨이브 조율 속도(V)에 따라, 해당 차량이 그린 웨이브 조율 간선의 스타트 교차로에서 엔드 교차로로 주행하여 통과한 주행 지속 시간을 확정할 수 있다. 예를 들어 도 4b에 도시된 바와 같이, 그린 웨이브 조율 간선에 4개의 교차로가 존재하고, 스타트 교차로는 A 교차로이며, 엔드 교차로는 D 교차로이고, A 교차로 신호등과 B 교차로 신호등 사이의 위상차는 M1이며, B 교차로 신호등과 E 교차로 신호등 사이의 위상차는 M2이고, E 교차로 신호등과 D 교차로 신호등 사이의 위상차는 M3 이며, A 교차로 신호등이 그린 라이트를 나타내는 지속 시간은 G1이고, B 교차로 신호등이 그린 라이트를 나타 내는 지속 시간은 G2이며, E 교차로 신호등이 그린 라이트를 나타내는 지속 시간은 G3이고, D 교차로 신호등이 그린 라이트를 나타내는 지속 시간은 G4이며, A 교차로 신호등의 주기는 C1이고, B 교차로 신호등의 주기는 C2 이며, E 교차로 신호등의 주기는 C3이고, D 교차로 신호등의 주기는 C4이며, A 교차로와 B 교차로 사이의 거리 는 S1이고, B 교차로와 E 교차로 사이의 거리는 S2이며, E 교차로와 D 교차로 사이의 거리는 S3이다. 차량(Q1)에 대해, S1을 그린 웨이브 조율 속도(V)로 나누어 해당 차량(Q1)이 A 교차로에서 B 교차로를 통과할 때 사용한 지속 시간(L1)을 획득하고; S2를 그린 웨이브 조율 속도(V)로 나누어 해당 차량(Q1)이 B 교차로에서 E 교차로를 통과할 때 사용한 지속 시간(L2)을 획득하며; S3을 그린 웨이브 조율 속도(V)로 나누어 해당 차량 (Q1)이 E 교차로에서 D 교차로에 도착할 때 사용한 지속 시간(L3)을 획득하고, D 교차로 신호등의 주기(C4), D 교차로 신호등이 그린 라이트를 나타내는 지속 시간(G4) 및 해당 차량(Q1)이 A 교차로에서 B 교차로로 사용한 지속 시간(L3) 등을 결합하여 해당 차량(Q1)이 E 교차로에서 D 교차로를 통과할 때 사용한 지속 시간(L4)을 확 정하고, 나아가 L1, L2, L4를 더하여 차량(Q1)이 A 교차로에서 D 교차로로 주행하여 통과한 주행 지속 시간을 획득할 수 있다. 차량(Q2)에 대해, S1을 그린 웨이브 조율 속도(V)로 나누어 해당 차량(Q2)이 A 교차로에서 B 교차로를 통과할 때 사용한 지속 시간(L5)을 획득하고; S2를 그린 웨이브 조율 속도(V)로 나누어 해당 차량(Q2)이 B 교차로에서 E 교차로를 통과할 때 사용한 지속 시간(L6)을 획득하며; S3을 그린 웨이브 조율 속도(V)로 나누어 해당 차량 (Q2)이 E 교차로에서 D 교차로를 통과할 때 사용한 지속 시간(L7)을 확정하고, 따라서 L5, L6, L7을 더하여 차 량(Q2)이 A 교차로에서 D 교차로로 주행하여 통과한 주행 지속 시간을 획득할 수 있다. 더 나아가, 차량(Q3)에 대해, 그린 웨이브 조율 속도(V), A 교차로 신호등과 B 교차로 신호등 사이의 위상차 (M1), B 교차로 신호등과 E 교차로 신호등 사이의 위상차(M2), E 교차로 신호등과 D 교차로 신호등 사이의 위상 차(M3), B 교차로 신호등이 그린 라이트를 나타내는 지속 시간(G2), E 교차로 신호등이 그린 라이트를 나타내는 지속 시간(G3), D 교차로 신호등이 그린 라이트를 나타내는 지속 시간(G4), B 교차로 신호등의 주기(C2), E 교 차로 신호등의 주기(C3), D 교차로 신호등의 주기(C4), A 교차로와 B 교차로 사이의 거리(S1), B 교차로와 E 교 차로 사이의 거리(S2) 및 E 교차로와 D 교차로 사이의 거리(S3) 등을 결합하여, 차량(Q3)이 A 교차로에서 D 교 차로로 주행하여 통과한 주행 지속 시간을 획득할 수 있다. 예시적으로, 하나의 선택 가능한 실시 방식에 따르면, 그린 웨이브 조율 간선의 스타트 교차로에서 엔드 교차로 로 주행하여 통과하는 각 차량에 대해, 또한 타이밍 데이터에서 서로 인접한 교차로 신호등 사이의 위상차(M), 교차로 신호등의 주기(C) 및 교차로 신호등이 그린 라이트를 나타내는 지속 시간(L), 서로 인접한 교차로 사이 의 거리(S) 및 그린 웨이브 조율 속도(V)에 따라, 해당 차량이 그린 웨이브 조율 간선의 스타트 교차로에서 엔 드 교차로로 주행하여 통과하는 주차 횟수를 확정할 수 있다. 예를 들어, 그린 웨이브 조율 속도 및 서로 인접 한 교차로 사이의 거리를 기반으로, 해당 차량이 서로 인접한 교차로의 상류 교차로에서 하류 교차로로 주행할 때 필요한 주행 지속 시간을 확정하고; 그 다음에, 확정한 주행 지속 시간, 상류 교차로 신호등이 그린 라이트 를 나타내는 지속 시간, 하류 교차로 신호등이 그린 라이트를 나타내는 지속 시간 및 서로 인접한 교차로 신호 등 사이의 위상차 등에 따라, 해당 차량이 하류 교차로에 도착할 때 하류 교차로 신호등이 그린 라이트를 나타 내는 여부를 확정하며, 그린 라이트를 나타내지 않으면, 해당 차량이 하류 교차로에서 주차 및 대기해야 하는 것을 확정하고, 이때 해당 차량의 주차 횟수에 1을 더하며; 해당 차량이 그린 웨이브 조율 간선의 스타트 교차 로에서 엔드 교차로로 주행하여 통과하는 주차 횟수가 통계될 때까지 상술한 과정을 반복한다. 나아가, 각 차량이 그린 웨이브 조율 간선의 스타트 교차로에서 엔드 교차로로 주행하여 통과하는 주차 횟수를 획득한 후, 모든 차량의 주차 횟수에 대해 평균하고, 평균 값을 간선 주차 횟수 지표의 이론값으로 한다. 단계(S404), 그린 웨이브 조율 간선에서 스타트 교차로와 엔드 교차로 사이의 거리 및 주행 지속 시간에 따라, 간선 속도 지표의 이론값을 확정한다. 본 실시예에서, 스타트 교차로와 엔드 교차로 사이의 거리는 스타트 교차로의 위치 데이터와 엔드 교차로의 위 치 데이터를 사용하여 확정할 수 있고, 또한 지도 애플리케이션으로부터 직접 획득할 수 있으며, 본 실시예에서 이에 대해 한정하지 않는다. 구체적으로, 그린 웨이브 조율 간선의 스타트 교차로에서 엔드 교차로로 주행하여 통과하는 각 차량에 대해, 해 당 차량의 주행 지속 시간을 확정한 후, 그린 웨이브 조율 간선에서 스타트 교차로와 엔드 교차로 사이의 거리를 해당 차량의 주행 지속 시간으로 나누어 해당 차량의 그린 웨이브 조율 간선에서의 주행 속도를 획득할 수 있다. 더 나아가, 각 차량이 그린 웨이브 조율 간선에서의 주행 속도를 획득한 후, 모든 차량의 주행 속도에 대해 평 균하고, 평균 값을 간선 속도 지표의 이론값으로 한다. 단계(S405), 간선 속도 지표의 이론값 및 실제값, 및/또는 간선 주차 횟수 지표의 이론값 및 실제값에 따라, 그 린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증한다. 본 개시내용의 실시예에 의해 제공된 기술 방안에 따르면, 간선의 차량 통행 상황을 인입하고, 그린 웨이브 조 율 데이터, 서로 인접한 교차로 사이의 거리 및 타이밍 조율 데이터 등 다중 디멘션 데이터를 기반으로, 간선 주차 횟수 지표의 이론값 및 간선 속도 지표의 이론값을 확정하는 것을 통해, 간선 주차 횟수 지표의 이론값 및 간선 속도 지표의 이론값을 위해 선택가능한 방식을 제공하며, 나아가 후속에 타이밍 조율 데이터의 합리성 검 증을 수행하는데 데이터 지원을 제공한다. 도 5는 본 개시내용의 실시예에 의해 제공된 데이터 검증 장치의 구조 개략도이다. 해당 장치는 본 개시내용의 실시예에 설명한 데이터 검증 방법을 구현할 수 있다. 해당 장치는 데이터 검증 기능이 적재된 계산 설비에 통 합될 수 있다. 해당 데이터 검증 장치는 구체적으로, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 평가 지표의 실제값을 확정하는데 사용되 는 실제값 확정모듈-여기서, 평가 지표는 교차로 주차율 지표, 도로 구간 속도 지표, 간선 속도 지표 및 간선 주차 횟수 지표 중 적어도 하나를 포함함-; 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 평가 지표의 이론값을 확정하는데 사용되는 이론값 확정모듈 ; 평가 지표의 이론값 및 실제값에 따라, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합 리성에 대해 검증하는데 사용되는 검증모듈 을 포함한다. 본 개시내용의 실시예에 의해 제공된 기술 방안에 따르면, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이 밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라 평 가 지표의 이론값을 확정할 수 있고, 평가 지표의 이론값과 획득한 평가 지표의 실제값에 따라, 그린 웨이브 조 율 간선에서의 교차로 신호등의 타이밍 조율 데이터의 합리성에 대해 검증한다. 상기 방안은 교차로, 도로 구간 및 간선을 포함하는 세 개의 디멘션을 통해, 타이밍 조율 데이터에 대해 전면적으로 평가하고, 교차로 신호등의 타이밍 조율 데이터의 합리성을 직관적이고 진실하며 정확하게 판단할 수 있으며; 아울러, 본 방안은 그린 웨이 브 조율 간선에서 주행하는 모든 차량의 궤적 데이터, 즉 풍부한 데이터양에 따라, 교차로 신호등의 타이밍 조 율 데이터의 합리성을 확정하는 정확도를 크게 향상하고, 검증 타이밍 조율 데이터의 합리성을 위해 개선되고 새로운 아이디어를 제공한다. 예시적으로, 이론값 확정모듈은, 그린 웨이브 조율 간선에서의 교차로 신호등의 타이밍 조율 데이터, 교차로의 위치 데이터 및 그린 웨이브 조율 간선에서 주행하는 차량의 궤적 데이터에 따라, 그린 웨이브 조율 간선에서 서로 인접한 교차로에서 하류 교차 로의 차량 통행 상황 및/또는 그린 웨이브 조율 간선에서 간선의 차량 통행 상황을 확정하는데 사용되는 통행 상황 확정유닛; 하류 교차로의 차량 통행 상황 및/또는 간선의 차량 통행 상황, 그린 웨이브 조율 속도, 타이밍 조율 데이터 및 서로 인접한 교차로 사이의 거리에 따라, 평가 지표의 이론값을 확정하는데 사용되는 이론값 확정유닛 을 포함한다. 예시적으로, 이론값 확정유닛은 구체적으로, 하류 교차로의 차량 통행 상황이 상류 교차로에서 하류 교차로로 주행하는 차량 중 하류 교차로에서 통행을 기 다려야 하는 차량이 존재하는 상황이면, 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도 및 타이밍 조 율 데이터에서 서로 인접한 교차로 신호등 데이터에 따라, 교차로 주차율 지표의 이론값 및/또는 도로 구간 속도 지표의 이론값을 확정하는데 사용되고; 여기서, 서로 인접한 교차로 신호등 데이터는 서로 인접한 교차로에서 상류 교차로 신호등이 그린 라이트를 나 타내는 제1 지속 시간, 서로 인접한 교차로에서 하류 교차로 신호등이 그린 라이트를 나타내는 제2 지속 시간, 서로 인접한 교차로 신호등 사이의 위상차와 하류 교차로 신호등의 주기를 포함한다. 예시적으로, 이론값 확정유닛은 구체적으로, 제1 지속 시간, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율 속도에 따라, 상류 교차로를 통과한 엔드 차량이 하류 교차로에 도착한 시간을 확정하고; 확정한 시간, 제2 지속 시간 및 서로 인접한 교차로 신호등 사이의 위상차에 따라, 상류 교차로 신호등에 대한 하류 교차로 신호등의 레드 라이트 지속 시간을 확정하며; 레드 라이트 지속 시간과 제1 지속 시간의 비율값을 교차로 주차율 지표의 이론값으로 하는데 사용된다. 예시적으로, 이론값 확정유닛은 구체적으로, 서로 인접한 교차로 신호등 사이의 위상차, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율 속도에 따라, 상류 교차로 신호등에 대한 하류 교차로 신호등의 레드 라이트 지속 시간을 확정하고; 레드 라이트 지속 시간과 제1 지속 시간의 비율값을 교차로 주차율 지표의 이론값으로 하는데 사용된다. 예시적으로, 이론값 확정유닛은 구체적으로, 서로 인접한 교차로 신호등 사이의 위상차, 서로 인접한 교차로 사이의 거리, 그린 웨이브 조율 속도, 하류 교 차로 신호등의 주기 및 제1 지속 시간에 따라, 상류 교차로에서 하류 교차로로 주행하는 차량이 하류 교차로를 통과하는 평균 지속 시간을 확정하고; 서로 인접한 교차로 사이의 거리와 평균 지속 시간에 따라, 도로 구간 속도 지표의 이론값을 확정하는데 사용된 다. 예시적으로, 이론값 확정유닛은 구체적으로, 간선의 차량 통행 상황이 그린 웨이브 조율 간선에서 주행하는 차량 중 통행을 기다려야 하는 차량이 존재하는 상황이면, 타이밍 데이터에서 서로 인접한 교차로 신호등 사이의 위상차, 교차로 신호등의 주기와 교차로 신호 등이 그린 라이트를 나타내는 지속 시간, 서로 인접한 교차로 사이의 거리 및 그린 웨이브 조율 속도에 따라, 차량이 그린 웨이브 조율 간선의 스타트 교차로에서 엔드 교차로로 주행하여 통과한 주행 지속 시간 및/또는 간 선 주차 횟수 지표의 이론값을 확정하고; 그린 웨이브 조율 간선에서 스타트 교차로와 엔드 교차로 사이의 거리 및 주행 지속 시간에 따라, 간선 속도 지 표의 이론값을 확정하는데 사용된다. 설명해야 한 것은, 본 실시예에서, 데이터 검증 방법의 실행 주체는 공개, 및 법률 준수한 다양한 방식을 통해 본 개시내용의 실시예에서 데이터 검증할 때 사용한 데이터(예를 들어, 차량의 궤적 데이터)를 획득할 수 있으 며, 예를 들어 공개 데이터 그룹에서 획득할 수 있고, 또는 사용자의 그랜트를 통해 사용자 측에서 획득하는 등 방식일 수 있다. 본 개시내용의 실시예에 따라, 본 개시내용에서 전자 설비, 판독 가능 저장 매체 및 컴퓨터 프로그램 제품을 더 제공한다. 도 6은 본 개시내용의 실시예를 실시하는 예시 전자 설비의 개략적인 블록도를 나타낸다. 전자 설비는 다 양한 형태의 디지털 컴퓨터를 표시하며, 예를 들어, 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크스테이션, 개인용 정보 단말기(Personal Digital Assistant), 서버, 블레이드 서버, 메인프레임 컴퓨터 및 기타 적합한 컴퓨터를 표시 한다. 전자 설비는 또한 다양한 형태의 모바일 장치를 표시할 수 있으며, 예를 들어, 개인용 디지털 처리, 셀 폰, 스마트 폰, 웨어러블 설비 및 기타 유사한 컴퓨팅 장치를 표시할 수 있다. 본문에 설명된 부재, 이들의 연 결 관계 및 이들의 기능은 단지 예시적인 것일 뿐, 본문에서 설명되는 및/또는 요구되는 본 개시내용의 실현을 한정하려는 의도가 아니다. 도 6에 도시된 바와 같이, 전자 설비는 계산 유닛을 포함하고, 이는 판독 전용 메모리(ROM)에 저장된 컴퓨터 프로그램 또는 저장 유닛으로부터 랜덤 액세스 메모리(RAM)에 로딩한 컴퓨터 프로그램에 따라, 다양하고 적절한 동작 및 처리를 수행한다. RAM에 전자 설비의 작업에 필요한 다양한 프로 그램 및 데이터를 더 저장할 수 있다. 계산 유닛, ROM 및 RAM는 버스에 의해 서로 연결된 다. 입력/출력(I/O) 인터페이스도 버스에 연결된다. 전자 설비 중의 복수의 부재는 I/O 인터페이스에 연결되고, 해당 부재는 키보드, 마우스 등과 같은 입력 유닛, 다양한 디스플레이, 스피커 등과 같은 출력 유닛, 디스크, CD 등과 같은 저장 유닛 및 네트워크 카드, 모뎀, 무선 통신 트랜시버 등과 같은 통신 유닛을 포함한다. 통신 유닛은 전자 설 비가 인터넷과 같은 컴퓨터 네트워크 및/또는 다양한 통신망을 통해 기타 설비와 정보/데이터를 교환할 수 있도록 한다. 계산 유닛은 다양한 처리 및 계산 능력을 구비한 범용 및/또는 전용 처리 조립체일 수 있다. 계산 유닛 의 일부 실시예는, 중앙 처리 유닛(CPU), 그래픽 처리 장치(GPU), 다양한 전용 인공 지능(AI) 계산 칩, 기 계 학습 모델 알고리즘을 실행하는 다양한 계산 유닛, 디지털 신호 프로세서(DSP) 및 임의의 적정한 프로세서, 컨트롤러, 마이크로 컨트롤러 등을 포함하지만 이에 한정되지 않는다. 계산 유닛은 위에 설명한 각 방법 및 처리를 실행하고, 예를 들어, 데이터 검증 방법을 실행한다. 예를 들어, 일부 실시예에서, 데이터 검증 방법 은 컴퓨터 소프트웨어 프로그램으로 실현할 수 있고, 이는 저장 유닛과 같은 기계 판독 가능 저장 매체에 유형적으로 포함된다. 일부 실시예에서, 컴퓨터 프로그램의 부분 또는 전부는 ROM 및/또는 통신 유닛(60 9)에 의해 전자 설비에 로딩 및/또는 설치된다. 컴퓨터 프로그램이 RAM에 로딩되어 계산 유닛에 의해 실행될 때, 위에 설명된 데이터 검증 방법의 하나 또는 복수의 단계를 실행할 수 있다. 대안적으로, 기타 실시예에서, 계산 유닛은 기타 적합한 방식(예를 들어, 펌웨어에 의해)을 통해 데이터 검증 방법을 실행하 도록 구성된다. 본 문서에서의 위에서 설명된 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 필드 프로그래머블 게이트 어레이(FPGA), 애플리케이션 특정 집적 회로(ASIC), 애플리케이션별 표준 부 품(ASSP), 칩에서의 시스템의 시스템(System on Chip, SoC), 하중 프로그래밍 논리 설비(CPLD), 컴퓨터 하드웨 어, 펌웨어, 소프트웨어 및/또는 이들의 조합으로 구현된다. 이러한 각종 실시형태는, 하나 또는 다수의 컴퓨터 프로그램에서 실시되는 방식을 포함할 수 있으며, 해당 하나 또는 다수의 컴퓨터 프로그램은 적어도 하나의 프 로그램 가능한 프로세서를 포함하는 프로그램 가능한 시스템에서 실행 및/또는 해석(interpretating)될 수 있으 며, 해당 프로그램 가능한 프로세서는 전용 또는 범용 프로그램 가능한 프로세서일 수 있고, 저장 시스템, 적어 도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 데이터 및 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치 및 상기 적어도 하나의 출력 장치로 전송할 수 있다. 본 개시내용의 방법을 실행하도록 사용한 프로그램 코드는 하나 또는 복수의 프로그래밍 언어의 임의의 조합으 로 작성될 수 있다. 이러한 프로그램 코드를 범용 컴퓨터, 특수 목적 컴퓨터 또는 기타 프로그램 가능한 데이터 처리 장치의 프로세서 또는 컨트롤러에게 제공할 수 있고, 프로그램 코드가 프로세서 또는 컨트롤러에 의해 실 행될 때 흐름도 및/또는 블록도에서 규정된 기능/작업에 의해 실행된다. 프로그램 코드는 기계에서 완전히 실행 되거나, 기계에서 부분적으로 실행되고, 독립적인 소프트웨어 패키지로 부분적으로 기계에서 실행되고 부분적으 로 원격 기계에서 실행하거나 완전히 원격 기계 또는 서버에서 실행된다. 본 개시내용의 전문에서, 기계 판독 가능 매체는 유형의 매체일 수 있고, 이는 명령 실행 시스템, 장치 또는 설 비에 의해 사용되거나 명령 실행 시스템, 장치 또는 설비와 결합하여 사용되는 프로그램을 포함 또는 저장할 수 있다. 기계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 저장 매체일 수 있다. 기계 판독 가능 매체는 전기적, 자기적, 광학적, 전자기적, 적외선 또는 반도체 시스템, 장치 또는 설비, 또는 상기 내용 의 임의의 적합한 조합을 포함하지만 이에 한정되지 않는다. 기계 판독 가능 저장 매체의 더 구체적인 예시는 하나 또는 복수의 선에 따른 전기 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 랜덤 액세스 메모리(RAM), 판독 전용 메모리(ROM), 지울 수 있는 프로그래밍 가능한 읽기 전용 메모리(EPROM 또는 플래시 메모리), 광섬유, 컴 팩트 디스크 읽기 전용 메모리(CD-ROM), 광 저장 장비, 자기 저장 장비, 또는 상기 내용의 임의의 적합한 조합 을 포함한다. 사용자와의 상호 작용을 제공하기 위해, 여기서 설명된 시스템 및 기술을 컴퓨터 상에서 실시할 수 있으며, 해 당 컴퓨터는 사용자에게 정보를 디스플레이하기 위한 디스플레이 장치(예를 들어, CRT(음극선관) 또는 LCD(액정 디스플레이) 모니터); 키보드 및 포인팅 장치(예를 들어, 마우스 또는 트랙볼)를 구비하며, 사용자는 상기 키보 드 및 상기 포인팅 장치를 통해 컴퓨터에 입력을 제공할 수 있다. 다른 유형의 장치 또한 사용자와의 상호 작용 을 제공할 수 있는데, 예를 들어, 사용자에게 제공되는 피드백은 임의의 형태의 센싱 피드백(예를 들어, 시각적피드백, 청각적 피드백 또는 햅틱 피드백)일 수 있으며; 임의의 형태(사운드 입력, 음성 입력 또는 햅틱 입력을 포함함)로 사용자에 의한 입력을 수신할 수 있다. 여기에서 설명된 시스템 및 기술은 백엔드 구성 요소(back-end component)를 포함하는 컴퓨팅 시스템(예를 들어, 데이터 서버), 또는 미들웨어 구성 요소(middleware component)를 포함하는 컴퓨팅 시스템(예를 들어, 애 플리케이션 서버), 또는 프론트엔드 구성 요소(front-end component)를 포함하는 컴퓨팅 시스템(예를 들어, 그 래픽 사용자 인터페이스 또는 웹브라우저를 구비한 사용자 컴퓨터, 사용자는 해당 그래픽 사용자 인터페이스 또 는 해당 웹브라우저를 통해 여기에서 설명된 시스템 및 기술의 실시형태와 상호 작용할 수 있음), 또는 이러한 백엔드 구성 요소, 미들웨어 구성 요소 또는 프론트엔드 구성 요소의 임의의 조합을 포함하는 컴퓨팅 시스템에 서 실행될 수 있다. 시스템의 구성 요소는 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들어, 통신 네트 워크)을 통해 서로 연결될 수 있다. 통신 네트워크의 예시에는 근거리 네트워크(LAN), 광역 네트워크(WAN), 블 록 체인 네트워크 및 인터넷을 포함한다. 컴퓨터 시스템에는 클라이언트와 서버가 포함될 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있 으며, 통상적으로 통신 네트워크를 통해 상호 작용을 수행한다. 클라이언트와 서버 간의 관계는 대응되는 컴퓨 터상에서 실행되고 서로 클라이언트-서버 관계를 구비하는 컴퓨터 프로그램을 통해 발생한다. 서버는 클라우드 서버일 수 있고, 또는 클라우드 컴퓨팅 서버 및 클라우드 호스트라고 칭할 수 있으며, 클라우드 컴퓨팅 서버 시 스템의 한가지 종류의 호스트 제품이고, 해당 서버는 전통적인 물리적 호스트 및 VPS 서비스에서 존재하는 관리 어려움이 크거나 서비스 확장성이 약한 단점을 해결한다. 위에 도시된 각 형태의 프로세스를 사용하여, 재 정렬, 단계를 추가 또는 삭제할 수 있는 것을 이해해야 한다. 예를 들어, 본 개시내용에서 기재된 각 단계들은 동시에 수행될 수 있거나, 순차적으로 수행될 수 있거나, 다른 순서로 수행될 수 있으며, 본 개시내용에 개시된 기술 방안에서 원하는 결과를 실현할 수만 있으면, 본문에서는 이에 대해 한정하지 않는다. 상기 구체적 실시형태는 본 개시내용의 보호 범위에 대한 한정을 구성하지 않는다. 본 분야의 당업자는 설계 요 구 및 기타 요소에 따라, 다양한 수정, 조합, 부분 조합 및 대체를 수행할 수 있음을 알아야 한다. 본 개시내용 의 사상과 원칙 내에서 수행하는 임의의 수정, 동등한 대체 및 개선 등은, 본 개시내용의 보호 범위에 포함되어 야 한다."}
{"patent_id": "10-2022-0016534", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 방안을 더 쉽게 이해하는데 사용되고, 본 개시내용에 대한 한정을 구성하지 않는다. 여기서, 도 1a는 본 개시내용의 실시예에 의해 제공된 데이터 검증 방법의 흐름도이다. 도 1b는 본 개시내용의 실시예에 의해 제공된 간선 그린 웨이브 도의 개략도이다. 도 1c는 본 개시내용의 실시예에 의해 제공된 궤적-그린 웨이브 도의 개략도이다. 도 2는 본 개시내용의 실시예에 의해 제공된 다른 하나의 데이터 검증 방법의 흐름도이다. 도 3a는 본 개시내용의 실시예에 의해 제공된 또 다른 하나의 데이터 검증 방법의 흐름도이다. 도 3b 내지 도 3d는 본 개시내용의 실시예에 의해 제공된 교차로 시나리오의 개략도이다. 도 4a는 본 개시내용의 실시예에 의해 제공된 또 다른 하나의 데이터 검증 방법의 흐름도이다. 도 4b는 본 개시내용의 실시예에 의해 제공된 간선 교차로 시나리오의 개략도이다. 도 5는 본 개시내용의 실시예에 의해 제공된 데이터 검증 장치의 구조 개략도이다.도 6은 본 개시내용의 실시예의 데이터 검증 방법을 실현하기 위해 사용한 전자 설비의 블록도이다."}
