{"patent_id": "10-2021-7023077", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0124217", "출원번호": "10-2021-7023077", "발명의 명칭": "지능형 개인용 어시스턴트", "출원인": "하만인터내셔날인더스트리스인코포레이티드", "발명자": "키르슈 제임스 엠."}}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "개인용 어시스턴트 디바이스(personal assistant device)에 있어서,사용자로부터 오디오 명령을 수신하도록 구성된 마이크로폰;프로세서로서,상기 수신된 오디오 명령에 기초하여 상기 마이크로폰으로부터 마이크로폰 출력 신호를 수신하고;다른 개인용 어시스턴트 디바이스로부터 적어도 하나의 다른 마이크로폰 출력 신호를 수신하고;상기 마이크로폰 출력 신호들을 자기 상관시키고(autocorrelate);각각의 상기 마이크로폰 출력 신호의 잔향(reverberation)을 결정하고;상기 마이크로폰으로부터의 마이크로폰 출력 신호가 상기 적어도 하나의 다른 마이크로폰 출력 신호보다 낮은잔향을 갖는지 여부를 결정하고; 및상기 적어도 하나의 다른 마이크로폰 출력 신호보다 더 낮은 잔향을 갖는 상기 마이크로폰 출력 신호에 응답하여 상기 오디오 명령을 처리하기 위해 상기 마이크로폰 출력 신호를 적어도 하나의 다른 프로세서로 송신하도록구성된, 상기 프로세서를 포함하는, 디바이스."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1 항에 있어서, 상기 잔향은 상기 자기 상관 신호의 에너지 확산에 적어도 부분적으로 기초하여 결정되는, 디바이스."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2 항에 있어서, 상기 잔향은 상기 마이크로폰 출력 신호의 RIR(room impulse response)에 적어도 부분적으로 기초하여 결정되는, 디바이스."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2 항에 있어서, 상기 프로세서는 상기 자기 상관 후에 상기 마이크로폰 출력 신호를 정규화하도록 추가로 구성된, 디바이스."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4 항에 있어서, 상기 프로세서는 상기 상관된 마이크로폰 출력 신호의 평균 피크를 식별하도록 추가로구성된, 디바이스."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5 항에 있어서, 상기 잔향은 상기 평균 피크에 대한 상기 자기 상관 신호의 에너지 폭에 적어도 부분적으로 기초하여 결정되는, 디바이스."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 5 항에 있어서, 상기 평균 피크를 중심으로 가장 좁은 에너지 확산을 갖는 자기 상관 신호가 가장 낮은잔향을 갖는, 디바이스."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "개인용 어시스턴트 디바이스 시스템으로서,공개특허 10-2021-0124217-3-복수의 개인용 어시스턴트 디바이스로서, 각각의 디바이스는 가청 사용자 명령을 수신하도록 구성된 마이크로폰을 포함하는, 상기 복수의 개인용 어시스턴트 디바이스;프로세서로서,각각의 개인용 어시스턴트 디바이스로부터의 사용자 명령에 기초하여 적어도 하나의 마이크로폰 출력 신호를 수신하고,상기 마이크로폰 출력 신호들을 자기 상관시키고;각각의 마이크로폰 출력 신호의 잔향을 결정하고; 및어떤 마이크로폰 출력 신호가 가장 낮은 잔향을 갖는 지를 결정하고; 및가장 낮은 잔향을 갖는 마이크로폰 출력 신호를 처리하도록 구성된, 상기 프로세서를 포함하는, 시스템."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8 항에 있어서, 상기 잔향은 상기 마이크로폰 출력 신호의 에너지 확산에 적어도 부분적으로 기초하여결정되는, 시스템."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9 항에 있어서, 상기 잔향은 상기 마이크로폰 출력 신호의 RIR(room impulse response)에 적어도 부분적으로 기초하여 결정되는, 시스템."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 8 항에 있어서, 상기 프로세서는 상기 자기 상관 후에 상기 마이크로폰 출력 신호를 정규화하도록 추가로 구성되는, 시스템."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 8 항에 있어서, 상기 프로세서는 상기 상관된 마이크로폰 출력 신호의 평균 피크를 식별하도록 추가로구성되는, 시스템."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12 항에 있어서, 상기 잔향은 상기 평균 피크에 대한 자기 상관 t 신호의 에너지 폭에 적어도 부분적으로 기초하여 결정되는, 시스템."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12 항에 있어서, 상기 평균 피크를 중심으로 가장 좁은 에너지 확산을 갖는 자기 상관 신호가 가장 낮은잔향을 갖는, 시스템."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "방법에 있어서,수신된 오디오 명령에 기초하여 개인용 어시스턴트 디바이스의 마이크로폰으로부터 마이크로폰 출력 신호를 수신하는 단계;다른 개인용 어시스턴트 디바이스로부터 적어도 하나의 다른 마이크로폰 출력 신호를 수신하는 단계;상기 마이크로폰 출력 신호들을 자기 상관시키는 단계;각각의 마이크로폰 출력 신호의 잔향을 결정하는 단계; 및상기 마이크로폰으로부터의 마이크로폰 출력 신호가 적어도 하나의 다른 마이크로폰 출력 신호보다 낮은 잔향을갖는지 여부를 결정하는 단계; 및상기 적어도 하나의 다른 마이크로폰 출력 신호보다 더 낮은 잔향을 갖는 상기 마이크로폰 출력 신호에 응답하여 상기 오디오 명령을 처리하기 위해 상기 마이크로폰 출력 신호를 적어도 하나의 다른 프로세서로 송신하는공개특허 10-2021-0124217-4-단계를 포함하는, 방법."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15 항에 있어서, 상기 잔향은 상기 자기 상관 신호의 에너지 확산에 적어도 부분적으로 기초하여 결정되는, 방법."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 15 항에 있어서, 상기 자기 상관 후에 상기 마이크로폰 출력 신호를 정규화하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 15 항에 있어서, 상기 잔향은 상기 마이크로폰 출력 신호의 RIR(room impulse response)에 적어도 부분적으로 기초하여 결정되는, 방법."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 15 항에 있어서, 상기 상관된 마이크로폰 출력 신호의 평균 피크를 식별하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 19 항에 있어서, 상기 잔향은 상기 평균 피크에 대한 상기 자기 상관 신호의 에너지 폭에 적어도 부분적으로 기초하여 결정되는, 방법."}
{"patent_id": "10-2021-7023077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 19 항에 있어서, 상기 평균 피크를 중심으로 가장 좁은 에너지 확산을 갖는 자기 상관 신호가 가장 낮은잔향을 갖는, 방법."}
{"patent_id": "10-2021-7023077", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개인용 어시스턴트 디바이스는 사용자로부터 오디오 명령을 수신하도록 구성된 마이크로폰 및 프로세서를 포함할 수 있다. 프로세서는 수신된 오디오 명령에 기초하여 마이크로폰으로부터 마이크로폰 출력 신호를 수신하고, 다 른 개인용 어시스턴트 디바이스로부터 적어도 하나의 다른 마이크로폰 출력 신호를 수신하고, 마이크로폰 출력 신호들을 자기 상관 시키도록 구성될 수 있다. 프로세서는 또한 각각의 마이크로폰 출력 신호의 잔향을 결정하고, 마이크로폰으로부터의 마이크로폰 출력 신호가 적어도 하나의 다른 마이크로폰 출력 신호보다 낮은 잔 향을 갖는지 여부를 결정하고, 적어도 하나의 다른 마이크로폰 출력 신호보다 더 낮은 잔향을 갖는 마이크로폰 출력 신호에 응답하여 오디오 명령을 처리하기 위해 마이크로폰 출력 신호를 적어도 하나의 다른 프로세서로 송 신하도록 구성된다."}
{"patent_id": "10-2021-7023077", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 양태는 전반적으로 지능형 개인용 어시스턴트(intelligent personal assistant)에 관한 것이다."}
{"patent_id": "10-2021-7023077", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "음성 에이전트 디바이스(voice agent device)와 같은 개인용 어시스턴트가 점점 인기를 얻고 있다. 이러한 디바 이스는 사용자 오디오 명령을 기반으로 인공 지능을 구현하는 음성 제어 개인용 어시스턴트를 포함할 수 있다. 음성 에이전트 디바이스의 예는 Amazon Echo, Amazon Dot, Google At Home 등을 포함할 수 있다. 이러한 음성 에이전트는 동일한 프로세서와의 메인 인터페이스로서 음성 명령을 사용할 수 있다. 오디오 명령은 디바이스 내 의 마이크로폰에서 수신될 수 있다. 오디오 명령은 그런 다음 명령의 구현을 위해 프로세서로 송신될 수 있다."}
{"patent_id": "10-2021-7023077", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "개인용 어시스턴트 디바이스(personal assistant device)는 사용자 및 프로세서로부터 오디오 명령을 수신하도 록 구성된 마이크로폰을 포함할 수 있다. 프로세서는 수신된 오디오 명령에 기초하여 마이크로폰으로부터 마이 크로폰 출력 신호를 수신하고, 다른 개인용 어시스턴트 디바이스로부터 적어도 하나의 다른 마이크로폰 출력 신 호를 수신하고, 마이크로폰 출력 신호들을 자기 상관(autocorrelate)시키도록 구성될 수 있다. 프로세서는 또한 각각의 마이크로폰 출력 신호의 잔향(reverberation)을 결정하고, 마이크로폰으로부터의 마이크로폰 출력 신호 가 적어도 하나의 다른 마이크로폰 출력 신호보다 낮은 잔향을 갖는지 여부를 결정하고, 적어도 하나의 다른 마 이크로폰 출력 신호보다 더 낮은 잔향을 갖는 마이크로폰 출력 신호에 응답하여 오디오 명령을 처리하기 위해마이크로폰 출력 신호를 적어도 하나의 다른 프로세서로 송신하도록 구성될 수 있다. 개인용 어시스턴트 디바이스 시스템은 복수의 개인용 어시스턴트 디바이스를 포함할 수 있으며, 각각은 가청 사용자 명령을 수신하도록 구성된 마이크로폰 및 각각의 개인용 어시스턴트 디바이스로부터의 사용자 명령에 기 초하여 적어도 하나의 마이크로폰 출력 신호를 수신하고, 마이크로폰 출력 신호를 자기 상관시키고, 각각의 마 이크로폰 출력 신호의 잔향을 결정하고, 마이크로폰 출력 신호 중 어느 것이 가장 낮은 잔향을 갖는지 결정하고; 및 잔향이 가장 낮은 마이크로폰 출력 신호를 처리하도록 구성된 프로세서를 포함한다. 방법은 수신된 오디오 명령에 기초하여 개인용 어시스턴트 디바이스의 마이크로폰으로부터의 마이크로폰 출력 신호를 수신하는 단계, 다른 개인용 어시스턴트 디바이스로부터의 적어도 하나의 다른 마이크로폰 출력 신호를 수신하는 단계, 마이크로폰 출력 신호들을 자기 상관시키는 단계, 마이크로폰 출력 신호 각각의 잔향을 결정하 는 단계, 및 마이크로폰으로부터의 마이크로폰 출력 신호가 적어도 하나의 다른 마이크로폰 출력 신호보다 잔향 이 낮은 지 여부를 결정하는 단계, 및 적어도 하나의 다른 마이크로폰 출력 신호보다 더 낮은 잔향을 갖는 마이 크로폰 출력 신호에 응답하여 오디오 명령을 처리하기 위해 마이크로폰 출력 신호를 적어도 하나의 다른 프로세 서로 송신하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-7023077", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "필요에 따라, 본 발명의 상세한 실시예가 본 출원에 개시된다; 그러나, 개시된 실시예는 다양하고 대안적인 형 태로 구현될 수 있는 본 발명의 예시일 뿐이라는 것을 이해해야 한다. 도면은 반드시 축척에 맞게 도시 되지는 않는다; 일부 특징은 특정 컴포넌트의 세부 사항을 나타내기 위해 과장되거나 최소화될 수 있다. 따라서, 본 출 원에 개시된 특정 구조 및 기능 세부 사항은 제한적인 것으로 해석되어서는 안 되며, 단지 당업자에게 본 발명 을 다양하게 사용하도록 교시하기 위한 대표적인 기초로서 해석되어야 한다. 개인용 어시스턴트 디바이스는 사용자 오디오 명령에 기반하여 인공 지능을 구현하는 음성 제어 개인용 어시스 턴트를 포함할 수 있다. 음성 에이전트 디바이스의 예는 Amazon Echo, Amazon Dot, Google At Home 등을 포함 할 수 있다. 이러한 음성 에이전트는 동일한 프로세서와의 메인 인터페이스로서 음성 명령을 사용할 수 있다. 오디오 명령은 디바이스 내의 마이크로폰에서 수신될 수 있다. 오디오 명령은 그런 다음 명령의 구현을 위해 프 로세서로 송신될 수 있다. 일부 예에서, 오디오 명령은 Amazon Echo, Amazon Dot, Google At Home 등에 의해 사용되는 것과 같은 클라우드 기반 프로세서로 외부로 송신될 수 있다. 종종, 단일 가정 또는 심지어 단일 방에는 둘 이상의 개인용 어시스턴트 디바이스를 포함할 수 있다. 예를 들어, 영역 또는 방에는 각각의 코너에 위치된 개인용 어시스턴트 디바이스를 포함할 수 있다. 또한, 가정은 부 엌, 침실, 홈 오피스 등 각각에 개인용 어시스턴트 디바이스를 포함할 수 있다. 개인용 어시스턴트 디바이스는 또한 휴대용일 수 있고 가정 내의 방에서 방으로 이동될 수 있다. 이러한 디바이스의 근접 접근성 때문에, 둘 이상의 디바이스가 사용자 명령을 \"청취(hear)하거나\" 또는 수신할 수 있다. 다수의 음성 에이전트 디바이스가 있는 가정에서, 각각은 사용자에게 응답할 수 있다. 이 경우 사용자 명령에 대한 다수의 응답이 중첩되어, 사운드가 클러터(clutter)되거나 중복 처리 및 대역폭이 사용되거나 두 번 이상작업을 수행할 수 있다(예를 들어, 온라인 유통 업체로부터 제품 주문). 음성 명령은 음성 에이전트의 마이크로폰에서 오디오 신호를 통해 수신될 수 있다. 전형적으로, 음원(sound source)(예를 들어, 사용자 명령)과 마이크로폰이 멀어짐에 따라, 구형 확산으로 인해 수신된 음파의 강도가 감 소된다. 이를 \"R2 손실” 또는 \"20logR\" 손실이라고 한다. 또한, 고주파는 저주파보다 더 많이 흡수될 수 있으 며, 그 정도는 기온과 습도에 따라 달라질 수 있다. 명령 또는 오디오 신호는 음파의 전파 시간과 동일한 시간 에, 나중에 수신될 수도 있다. 마지막으로, 마이크로폰의 신호에서 반사가 검출될 수 있다. RIR(room impulse response)과 같은 이러한 반사는 사용자와 마이크로폰 사이의 상대적 거리를 결정하는데 사용될 수 있다. 마이크로폰의 품질을 측정하는 현재 시스템은 신호가 로컬 환경 소음원에 의해 오도(misled)될 수 있기 때문에 부정확할 수 있다. 고주파 콘텐츠는 특히 거리로 인해 음성이 감쇠된 경우 마이크로폰 자체에서 생성되는 노이 즈일 수 있다. 사운드 수신 타이밍은 복수의 마이크로폰 시스템에 걸쳐 동기화된 시간을 요구할 수 있다. 본 출원에는 복수의 마이크로폰 중 어느 마이크로폰이 최고 품질의 음향 신호를 수신하는지 결정하기 위한 시스 템이 개시된다. 최고 품질의 신호를 수신하는 마이크로폰은 가장 정확한 음성 인식을 제공할 수 있으므로 사용 자에게 가장 정확한 응답을 제공할 수 있다. 어느 마이크로폰이 최고의 품질을 갖는지를 결정하기 위해, RIR(Room Impulse Response)을 사용될 수 있다. 다수의 마이크로폰에 걸쳐 RIR을 비교할 때, 가장 짧은 RIR(즉, 에너지를 가장 빨리 수신)을 가진 마이크로폰이 최고 품질을 갖는 것으로 결정될 수 있다. RIR을 결정 하는 최신 방법은 커널 회귀, 반복 신경망, 다항식 근(polynomial roots), 정규 직교 기본 함수(주성분 분석) 및 반복 블라인드 추정을 포함할 수 있다. 그러나, 보다 간단한 방법은 자기 상관을 통해 잔향을 추론하는 것을 포함할 수 있다. 이 방법은 신호 내에서 반복을 찾는다. 에코와 잔향은 음파에서 효과적으로 반복되기 때문에, 자기 상관 벡터 내에서 확산되는 에너지, 즉 중앙 피크로부터의 편차는 잔향의 양 뿐만 아니라 노이즈의 양을 나타낼 수 있다. 따라서, 다른 마이크로폰의 잔향 비교에 기초하여 최고 품질의 개인용 어시스턴트 디바이스와 관련된 마이크로 폰을 식별할 수 있다. 사용자 명령을 처리하고 이에 응답하기 위해 잔향이 가장 낮은 마이크로폰이 선택될 수 있다. 도 1은 예시적인 지능형 개인용 어시스턴트 디바이스를 포함하는 시스템을 도시한다. 개인용 어시스 턴트 디바이스는 마이크로폰 또는 다른 오디오 입력을 통해 오디오를 수신하고, 오디오 프로세서 에 의해 식별되거나 다른 식으로 처리되도록 아날로그-디지털(A/D) 컨버터를 통해 오디오를 전달한다. 오디오 프로세서는 또한 하나 이상의 라우드 스피커(loudspeaker)에 의한 재생을 위해 디 지털-아날로그(D/A) 컨버터 및 증폭기를 통해 전달될 수 있는 음성 또는 다른 오디오 출력을 생성한 다. 개인용 어시스턴트 디바이스는 또한 오디오 프로세서에 연결된 디바이스 제어기를 포함한다. 디바이스 제어기는 또한 무선 네트워크를 통해 통신 네트워크와 개인용 어시스턴트 디바이스의 통신을 가능하게 하기 위해 무선 트랜시버와 인터페이스한다. 개인용 어시스턴트 디바이스는 또한 무 선 네트워크를 통해 다른 개인용 어시스턴트 디바이스를 포함하는 다른 디바이스와 통신할 수 있다. 많은 예에서, 디바이스 제어기는 또한 시각적 출력을 제공하기 위한 디스플레이 스크린 뿐만 아니라 사용 자 입력을 수신하기 위해 하나 이상의 HMI(Human Machine Interface) 제어부에 연결된다. 예시된 시스템 은 단지 예일 뿐이고, 더 많고, 더 적거나, 및/또는 다르게 배치된 엘리먼트가 사용될 수 있다는 것에 유 의해야 한다. A/D 컨버터는 마이크로폰으로부터 오디오 입력 신호를 수신한다. A/D 컨버터는 오디오 프로세서 에 의한 추가 처리를 위해 수신된 신호를 아날로그 포맷으로부터 디지털 포맷의 디지털 신호로 변환한다. 하나만 도시되어 있지만, 하나 이상의 오디오 프로세서가 개인용 어시스턴트 디바이스에 포함될 수 있다. 오디오 프로세서는 컴퓨터 프로세서, 마이크로 프로세서, 디지털 신호 프로세서, 또는 논리 연산을 수행할 수 있는 임의의 다른 디바이스, 일련의 디바이스 또는 다른 메커니즘과 같은 오디오 및/또는 비디오 신 호를 처리할 수 있는 하나 이상의 컴퓨팅 디바이스일 수 있다. 오디오 프로세서는 메모리 에 저장된 지침을 실행하기 위해 메모리 와 관련하여 동작할 수 있다. 지침은 소프트웨어, 펌웨어, 컴퓨터 코드 또는 이들의 일부 조합의 형태이고, 오디오 프로세서에 의해 실행될 때 개인용 어시스턴트 디바이스의 오 디오 인식 및 오디오 생성 기능을 제공할 수 있다. 지침은 수신된 오디오의 인식 처리 이전에 오디오 클린업 (cleanup) (예를 들어, 노이즈 감소, 필터링 등)을 추가로 제공할 수 있다. 메모리는 휘발성 메모리, 비휘발성 메모리, 전자 메모리, 자기 메모리, 광학 메모리 또는 다른 형태의 데이터 저장 디바이스와 같은 하나 이상의 데이터 저장 디바이스의 임의의 형태일 수 있다. 지침에 추가하여, 동작 파라미터 및 데이터는 또한 텍 스트 데이터로부터 음성 생성을 위한 음소 어휘(phonemic vocabulary)와 같은 메모리에 저장될 수 있다. D/A 컨버터는 오디오 프로세서로부터 디지털 출력 신호를 수신하여 이를 디지털 포맷에서 아날로그 포맷의 출력 신호로 변환한다. 출력 신호는 추가 처리를 위해 증폭기 또는 다른 아날로그 컴포넌트에 의해 사용 가능하게 될 수 있다. 증폭기는 비교적 작은 크기의 오디오 입력 신호를 수신하고, 비교적 큰 크기의 유사한 오디오 신호를 출력 하는 임의의 회로 또는 독립형 디바이스일 수 있다. 오디오 입력 신호는 증폭기에 의해 수신되고 라우드 스피커에 대한 하나 이상의 연결에 출력될 수 있다. 오디오 신호의 진폭의 증폭에 추가하여, 증폭기 는 또한 라우드 스피커 에 제공되기 위한 준비로 위상을 시프트하거나, 주파수 등화를 조정하거나, 지연을 조정하거나 또는 오디오 신호의 임의의 다른 형태의 조작 또는 조정을 수행하는 신호 처리 능력을 포함할 수 있 다. 예를 들어, 라우드 스피커는 디바이스가 디스플레이 스크린을 갖지 않거나 사용자가 디바이 스를 보는 것을 수반하지 않는 상호 작용을 원할 때 지침의 주요 매체가 될 수 있다. 신호 처리 기능은 오디오 프로세서의 도메인 내에서 추가적으로 또는 대안으로 발생할 수 있다. 또한 증폭기는 라우드 스피커 에 제공되는 오디오 신호의 볼륨, 밸런스 및/또는 페이드(fade)를 조정하는 기능을 포함할 수 있다. 대안적인 예에서, 예컨대, 라우드 스피커가 헤드폰 세트의 형태일 때 또는 오디오 출력 채널이 오디오 저 장 디바이스 또는 추가 오디오 프로세서 디바이스와 같은 다른 오디오 디바이스에 대한 입력 역할을 할 때, 증 폭기는 생략될 수 있다. 또 다른 예에서, 라우드 스피커는 라우드 스피커가 자체 전력을 공급받 을 수 있도록 증폭기를 포함할 수 있다. 라우드 스피커는 다양한 크기를 가질 수 있고 다양한 주파수 범위에서 동작할 수 있다. 각각의 라우드 스 피커는 단일 트랜스듀서를 포함할 수 있거나, 다른 경우에는 다수의 트랜스듀서를 포함할 수 있다. 라우드 스피커는 또한 서브 우퍼, 우퍼, 미드 레인지 및 트위터와 같은 상이한 주파수 범위에서 동작될 수 있다. 다수의 라우드 스피커가 개인용 어시스턴트 디바이스에 포함될 수 있다. 디바이스 제어기는 본 출원에 설명된 개인용 어시스턴트 디바이스의 기능의 성능을 지원하는 다양한 유형의 컴퓨팅 디바이스를 포함할 수 있다. 일례에서, 디바이스 제어기는 컴퓨터 지침을 실행하도록 구성 된 하나 이상의 프로세서 및 컴퓨터 실행 가능 지침 및/또는 데이터가 유지될 수 있는 저장 매체(또 는 스토리지)를 포함할 수 있다. 컴퓨터 판독 가능 저장 매체(프로세서 판독 가능 매체 또는 스토리지 라고도 함)는 컴퓨터(예를 들어, 프로세서(들))에 의해 판독될 수 있는 데이터(예를 들어, 지침)를 제공하는데 참여하는 임의의 비 일시적(예를 들어, 유형의) 매체를 포함한다. 일반적으로, 프로세서는 예 를 들어, 스토리지 등으로부터 메모리로 지침 및/또는 데이터를 수신하고 데이터를 사용하여 지침을 실행 함으로써 본 출원에 설명된 하나 이상의 프로세스를 포함하는 하나 이상의 프로세스를 수행한다. 컴퓨터 실행 가능 지침은 단독으로 또는 조합하여, 자바(Java), C, C++, C#, 어셈블리(Assembly), 포트란(Fortran), 파스칼 (Pascal), 비주얼 베이직(Visual Basic), 파이썬(Python), 자바 스크립트(Java Script), Perl, PL/SQL 등을 포 함하되 이에 한정되지 않는 다양한 프로그래밍 언어 및/또는 기술을 사용하여 생성된 컴퓨터 프로그램으로부터 컴파일 또는 해석될 수 있다. 본 출원에 설명된 프로세스 및 방법은 프로세서에 의해 수행되는 것으로 설명되지만, 프로세서는 클 라우드, 다른 서버, 디바이스 중 다른 하나 등에 위치될 수 있다. 도시된 바와 같이, 디바이스 제어기는 통신 네트워크를 통해 디바이스 제어기와 다른 네트워크 디바이스 사이의 통신을 가능하게 하도록 구성된 다른 네트워크 하드웨어 또는 무선 트랜시버를 포함할 수 있다. 하나의 가능성으로서, 무선 트랜시버 는 셀룰러 전화 네트워크를 통해 데이터를 통신하도록 구성된 셀룰러 네트워크 트랜시버일 수 있다. 또 다른 가능성으로서, 무선 트랜시버는 통신 네트워크에 액세 스하기 위해 근거리 무선 네트워크에 연결하도록 구성된 Wi-Fi 트랜시버일 수 있다. 디바이스 제어기는 개인용 어시스턴트 디바이스와의 사용자 상호 작용을 제공하기 위해 HMI(Human Machine Interface) 제어부로부터 입력을 수신할 수 있다. 예를 들어, 디바이스 제어기는 디바이스 제어기의 기능을 호출하도록 구성된 하나 이상의 버튼 또는 다른 HMI 제어부와 인터페이스할 수 있다. 디바이스 제어기는 또한 예를 들어, 비디오 제어기를 통해 사용자에게 시각적 출력을 제공하도록 구 성된 하나 이상의 디스플레이를 구동하거나 이와 통신할 수 있다. 일부 경우에, 디스플레이는 (본 출원에서, 디스플레이 스크린라고도 함)은 비디오 제어기를 통해 사용자 터치 입력을 수신하도록 추가로 구 성된 터치 스크린일 수 있는 반면, 다른 경우에 디스플레이는 터치 입력 기능이 없는 디스플레이 전용일 수 있다. 도 2는 복수의 지능형 개인용 어시스턴트 디바이스(102-1, 102-2, 102-3, 102-4)(총괄하여 \"어시스턴트 디바이 스\"라고 함)의 시스템을 도시한다. 각각의 디바이스는 무선 네트워크를 통해 서로 통신할 수 있 다. 디바이스는 개별 무선 트랜시버의 각각을 통해 그것들 사이에서 신호 및 데이터를 송신 및 수신 할 수 있다. 일례에서, 디바이스의 각각의 마이크로폰에서 수신된 오디오 입력은 비교 처리를 위해 다른 디바이스 각각으로 송신될 수 있다. 이에 대해서는 아래에서 자세히 설명된다. 디바이스는 집의 방, 또는 다수의 방에 걸쳐, 벽, 큐비클(cubicle) 등과 같은 파티션으로 분할된 단일 방 과 같은 영역 내에 배열될 수 있다. 어시스턴트 디바이스를 둘러싼 표면 및 물체는 음파를 반사하여 잔향을 일으킬 수 있다. 각각의 디바이스는 사용자로부터 가변 거리를 가질 수 있다. 도 2는 사용자 에 가장 근접한 제 1 디바이스(102-1), 이어서 제 2 디바이스(102-2) 및 제 3 디바이스(102-3)가 뒤따르는 것을 도시한다. 제 4 디바이스(102-4)는 사용자로부터 가장 멀리 떨어져 있으며, 코너 주위에 그리고 사용 자와 이격된 방 내에 배열된다. 도 1을 참조하여 설명된 바와 같이, 각각의 어시스턴트 디바이스는 음성 명령과 같은 오디오 입력을 수신 하도록 구성된 마이크로폰을 포함할 수 있다. 또한, 오디오 입력을 수신하기 위해 어시스턴트 디바이스 대신 독립형 마이크로폰이 사용될 수도 있다. 마이크로폰는 영역 내에서 오디오 입력 또는 음 향 신호를 취득할 수 있다. 이러한 오디오 입력은 다양한 디바이스를 예컨대, 조명, 어시스턴트 디바이스의 스 피커를 통한 오디오 출력, 엔터테인먼트 시스템, 환경 제어, 쇼핑 등을 제어할 수 있다. 도 2는 4 개의 어 시스턴트 디바이스를 예시하며, 시스템과 함께 더 많거나 더 적게 사용될 수 있다. 어시스턴트 디바이스는 시스템 제어기와 통신할 수 있다. 시스템 제어기는 독립형 제어기일 수 있거나, 제어기는 도 1과 관련하여 위에서 논의된 디바이스 제어기일 수 있다. 시스템 제어기는 무선 네트워크를 통해 어시스턴트 디바이스와의 통신할 수 있다. 시스템 제어기는 동일한 영역에 배 열될 수 있거나, 예를 들어, 클라우드에서 영역의 외부 및 원격에 배열될 수 있다. 시스템 제어기는 마이크로폰으로부터 오디오 입력을 수신하도록 구성될 수 있다. 시스템 제어기는 오디오 입력을 처리 하도록 구성된 프로세서를 포함할 수 있다. 설명된 대로 오디오 입력은 \"조명 켜기\", \"컨트리 음악 재생\", \"오늘 날씨 어때\" 등과 같은 사용자 명령을 포함할 수 있다. 프로세서는 영역 내의 마이크로폰으로부터의 다수의 디지털 신호를 처리하기 위한 디지털 신호 프로세서(DSP)일 수 있다. 수신된 신호는 프로세서와 관련된 메모리(미도시)에 또는 어시스턴트 디바이스 의 로컬 메모리에 저장될 수 있다. 메모리는 또한 오디오 입력을 처리하는 지침을 포함할 수 있다. 다수의 디바이스가 동일한 오디오 명령을 수신하는 상황에서, 프로세서는 디바이스의 마이크로 폰으로부터 수신된 복수의 마이크로폰 출력 신호 중에서 최고 품질의 신호를 갖는 하나의 신호를 선택하는 신호 처리를 수행할 수 있다. 즉, 프로세서는 처리할 '가장 깨끗한(cleanest)' 신호를 제공한 마이크로폰 을 선택할 수 있다. 프로세서는 마이크로폰으로부터 수신된 마이크로폰 출력 신호의 진폭, 주파 수 콘텐츠 및 위상을 비교함으로써 이러한 결정을 내릴 수 있다. 일 예에서, 프로세서는 공간 다이버시티(spatial diversity)가 가장 좋고/또는 잔향 에너지가 가장 적은 마이크로폰 출력 신호를 선택할 수 있다. 프로세서는 모든 마이크로폰 출력 신호에 대해 자기 상관 기능을 수행할 수 있다. 신호가 자기 상관되면, 처리 회로는 상관된 신호의 평균 피크에서 멀어지는 최소량의 에너지로 신호를 결정할 수 있다. 이 신호는 입력 및 추가 처리를 위해 선택될 수 있다. 프로세서는 또한 자기 상관 피크 주변의 자기 상관 엔벨로프(autocorrelation envelop)를 분석할 수 있다. 엔벨로프 피크 사이의 폭이 가장 좁은 신호가 더 이상적인 신호로 간주될 수 있다. 프로세서는 또한 각각의 신호의 신호 피크의 기울기를 비교하고, 피크의 하강 측(예를 들어, 음측)의 기울기가 가장 높은 신호를 선택할 수 있다. 다른 예로, 각각의 신호의 RIR(Room Impulse Response)을 이용하여 최고 품질의 신호를 선택할 수 있다. 이 예 에서 가장 짧은 RIR을 가진 신호가 가장 좋은 품질을 가질 것이다. 또한, RIR의 메인 피크를 벗어나는 에너지가 가장 적은 신호가 선택될 수 있다. 프로세서는 이러한 테일링 신호(tailing signal)가 반향 에너지로 간주 될 수 있기 때문에 피크 이후의 나머지 신호를 폐기할 수 있다. RIR이 복잡해짐에 따라(즉, 더 많은 반사), 자 기 상관이 확대될 수 있다.최고 품질의 마이크로폰 출력 신호를 선택함으로써, 사용자 명령에 대한 보다 정확한 응답이 달성될 수 있다. 또한 마이크로폰 출력 신호 중 하나만 처리하기 때문에 중복 처리는 방지된다. 도 2에 예시된 바와 같이, 사용자는 영역 내에 위치될 수 있다. 사용자는 오디오 입력을 구성하 는 가청 명령을 말할 수 있다. 각각의 어시스턴트 디바이스의 마이크로폰은 음성 명령을 수신할 수 있다. 그런 다음, 각각의 마이크로폰은 오디오 입력을 시스템 제어기에 중계할 수 있다. 전형적으로, 사용자와 같은 음원과 마이크로폰과 같은 수신기가 멀어짐에 따라, 오디오 신호의 품질이 감소한다. 예를 들어, R2 손실 또는 20logR 손실이라고도 하는 구형 확산으로 인해 음파가 감소한다는 점에서 신호의 강도가 감 소한다. 또한, 공기의 온도와 습도로 인해 고주파가 저주파보다 더 많이 감쇠될 수 있다. 신호는 또한 전파 지 연을 유발할 수 있을 뿐만 아니라 벽, 물체 등과 같은 영역 내의 장애물에 의해 야기된 반사 및 에코를 인 식할 수 있다.이를 잔향(reverberation)이라고 한다. 이러한 왜곡 각각은 상기에서 언급한 최고 품질의 신호 결 정 방법에 문제를 일으킬 수 있다. 도 3은 다수의 마이크로폰에 의해 수신된 한 문장의 음성을 포함하는 복수의 마이크로폰 출력 신호의 예시 적인 그래프를 예시하며, 각각은 사용자로부터 다양한 거리에 있다. 제 1 신호(301-1)는 제 1 마이크로폰 (102-1)으로부터 수신된 마이크로폰 출력 신호에 해당한다. 제 2 신호(301-2)는 제 2 마이크로폰(102-2)로부터 수신된 마이크로폰 출력 신호에 해당한다. 제 3 신호(301-3)는 제 3 마이크로폰(102-3)로부터 수신된 마이크로 폰 출력 신호에 대응한다. 제 4 신호(301-4)는 제 1 마이크로폰(102-4)으로부터 수신된 마이크로폰 출력 신호에 대응한다. 이 예에서, 사용자는 제 1 디바이스(102-1)에 가장 근접하고, 각각의 순차적인 디바이스는 사용자로 부터 멀어진다. 이 예에서, 제 1 디바이스(102-1)는 사용자로부터 8 피트 미만일 수 있고, 제 2 디바이스 (102-2)는 사용자로부터 약 16 피트 떨어져 있을 수 있고, 제 3 디바이스(102-3)는 사용자로부터 약 24 피 트 떨어져 있을 수 있고, 제 4 디바이스는 사용자로부터 약 36 피트 떨어져 있고, 뿐만 아니라 사용자의 시선에서 벗어난 모퉁이를 돌고 방 내부에 있는 것이다. 그래프에서 신호는 자동 이득 제어(AGC)를 통해 에너지 에 대해 정규화 되었을 수 있다. 도 3에 도시된 바와 같이, 점진적으로 멀어지는 각각의 디바이스에 대해, 신호는 나중에 수신되고, 제 4 및 가장 먼 디바이스는 약 0.03 초 늦게 신호를 수신한다. 또한, 제 1 신호(301-1)는 유사한 기간의 다른 신호에 비해 0.4-0.6 초의 기간 동안 가장 가파른 기울기를 갖는다. 제 1 신호(301-1)는 또한 다른 신호에 비해 1.2-1.4 초 기간 내에 가장 가파른 기울기를 갖는다. 제 1 신호(301-1)가 가장 가파른 기울기를 갖는 것으로 식별되기 때문에, 따라서 제 1 신호(301-1)가 다른 신호 에 비해 최상의 품질을 갖는 것으로 식별될 수 있다. 또한, 제 1 신호(301-1)는 또한 대략 0.55 초에 예시 된 바와 같이 피크에서 가장 큰 에너지를 가질 수 있다. 반대로, 제 4 신호(301-4)는 가장 평탄하거나 가장 낮 은 기울기를 가지며 따라서, 가장 큰 반향 에너지를 갖는다. 제 4 신호(301-4)는 다른 신호 중 어느 하나 에 대비하여 최고 품질의 신호로 선택되지 않을 것이다. 또한, 프로세서는 자기 상관을 통해 신호의 잔향을 유추하여 최고 품질을 갖는 신호를 결정할 수 있다. 자 기 상관은 신호 내에서 반복을 찾을 수 있다. 에코와 잔향은 음파에서 효과적으로 반복된다. 자기 상관 벡터의 에너지 확산, 즉 중앙 피크로부터의 편차는 잔향의 양과 또한 신호의 노이즈 양을 나타낸다. 자기 상관은 R(I) = sum {y(n) * y(n-1)} 인 신호 처리를 지칭할 수 있다. 프로세서는 각각의 오디오 입력을 자기 상관하고 마이크로폰 출력 신호의 에너지 확산을 결정할 수 있다. 에너지 확산은 두 에너지 피크 사이의 거리일 수 있다. 프로세서는 에너지 피크의 확산에서 가장 적은 에너지를 갖는 신호를 결정할 수 있다. 에너지가 가장 적은 신호가 최고 품질의 오디오 입력으로 선택될 수 있다. 프로세서는 또한 신호를 시간적으로 비교할 수 있고, 피크 에너지로부터 최소 지연을 갖는 신호는 추가 처리를 위해 선택될 수 있다. RIR 및 스펙트럼 감산과 같은 다른 신호 처리가 또한 사용될 수 있다. RIR은 마이크로폰 각각에 의해 측정 될 수 있다. RIR은 그런 다음 반전될 수 있고, 복수의 마이크로폰 중 임의의 마이크로폰에서 수신된 신호와 상 관되고 그로부터 감산될 수 있다. 스펙트럼 감산을 이용한 반향 제거(dereverberation) 또는 최고 품질의 신호 식별은 현재 프레임에서 선행 음소 (phoneme)의 에너지를 제거하여 반향 음성 에너지를 제거한다. 스펙트럼 감산은 마이크로폰이 사운드 신호를 감 지하는 환경에서 반향을 줄이는데 사용될 수 있다. 스펙트럼 감산은 또한 특정 노이즈와 관련된 오디오 신호의 세그먼트를 식별함으로써 증강될 수 있다. 예를 들어, 이러한 세그먼트는 음성, 노이즈 또는 다른 음향 신호를 포함하는 것으로 식별될 수 있다. 활동이 검출되지 않는 기간에는, 세그먼트가 노이즈로 간주될 수 있다. 노이즈 스펙트럼은 식별된 순수 노이즈 세그먼트로부터 추정될 수 있다. 그런 다음 노이즈 스펙트럼의 복제본이 신 호에서 감산된다. 각각의 마이크로폰 출력 신호의 처리는 시스템 제어기에 의해 수행될 수 있다. 이 예에서, 시스템 제어기 는 각각의 어시스턴트 디바이스로부터 마이크로폰 출력 신호를 수신한다. 추가적으로 또는 대안적으 로, 마이크로폰 출력 신호의 처리는 오디오 입력을 획득한 개인용 어시스턴트 디바이스의 개별 디바이스 제어기에 의해 행해질 수 있다. 또한, 각각의 어시스턴트 디바이스는 다른 개인용 어시스턴트 디바이 스의 마이크로폰에 의해 생성된 다른 마이크로폰 출력 신호를 처리할 수 있다. 개별 디바이스 제어기(11 8)는 해당 어시스턴트 디바이스에 의해 제공되는 신호가 다른 어시스턴트 디바이스에 의해 생성된 신 호와 비교하여 최고 품질의 신호인지 여부를 결정할 수 있다. 그렇다면, 디바이스 제어기는 처리를 위해 마이크로폰 출력 신호를 시스템 제어기로 송신하도록 무선 트랜시버에 지시한다. 그렇지 않다면, 디 바이스 제어기는 마이크로폰 출력 신호가 시스템 제어기로 발송되도록 지시하지 않는다. 대신, 최고 품질의 신호를 제공한 어시스턴트 디바이스는 오디오 입력에 의해 발행된 명령의 추가 처리 및 전달을 위 해 출력 신호를 시스템 제어기로 송신한다. 따라서, 이 예에서, 오직 하나의 마이크로폰 출력 신호가 시스 템 제어기에서 수신된다. 도 4는 각각의 자기 상관 마이크로폰 출력 신호의 그래프를 예시한다. 그래프는 자기 상관된 제 1 신호 (401-1), 자기 상관된 제 2 신호(401-2), 자기 상관된 제 3 신호(401-3) 및 자기 상관된 제 4 신호(401-4)를 포함하는 각각의 신호의 500-포인트 자기 상관을 예시한다. 각각의 자기 상관 신호는 자기 상관 피크가 모 두 동일한 값을 갖도록 에너지에 대해 정규화되었다. 범례의 값은 확산(spread) 전체의 평균 에너지를 보여준다. 도 4를 통해 예시된 바와 같이, 제 1 신호(401-1)는 가장 가파른 경사를 갖는다. 또한, 제 1 신호 (401-1)는 가장 높은 피크에 가장 가까운 피크를 갖는다. 점진적으로 멀어지는 각각의 마이크로폰에 대해, 자기 상관 피크로부터 멀어지는 더 많은 에너지가 있다. 이것은 오디오 신호의 반사 때문일 수 있다. 따라 서, 제 1 신호(401-1)는 나머지 신호보다 낮은 잔향 에너지를 갖는다. 제 2 신호(401-2)는 제 3 및 제 4 신호 (401-3, 404-4)보다 낮은 잔향 에너지를 갖는다. 도 5는 40 포인트 자기 상관을 갖는 도 4의 자기 상관 신호의 그래프를 예시한다. 더 적은 포인트 구성(예 를 들어, 40 대 500)으로 인해, 그래프는 그래프보다 계산적으로 더 효율적이다. 그래프는 자기 상관된 제 1 신호(401-1), 자기 상관된 제 2 신호(401-2), 자기 상관된 제 3 신호(401-3) 및 자기 상관된 제 4 신호(401-4)를 포함한다. 점진적으로 멀어지는 각각의 마이크로폰에 대해, 자기 상관은 피크 주변에서 더 넓어진다. 즉, 평균 피크를 중심으로 가장 좁은 에너지 확산을 갖는 마이크로폰 출력 신호는 가장 낮은 잔 향을 가질 수 있다. 전형적인 음성 신호의 높은 가변성과 멀리있는 마이크로폰의 신호 대 노이즈 비율 감소에도 불구하고, 피크 주변의 확산은 여전히 매끄럽고 단조롭게 감소하며 각각의 마이크로폰 사이에 뚜렷한 분리가 있 다. 예제 샘플 포인트 20, 30 및 40을 사용하면, 2 또는 3 포인트 상관 관계만 필요하므로 계산 비용이 크게 감 소된다. 도 5에 도시된 바와 같이, 제 1 어시스턴트 디바이스(102-1)의 마이크로폰과 관련된 제 1 신호(401-1)는 1730에서 가장 낮은 에너지 확산을 갖는다. 이 마이크로폰(401-1)은 사용자에 가장 가깝다. 제 2 신호 (401-2)는 1918의 확산을 갖는다. 제 1 신호(401-3)는 2269의 확산을 갖고, 제 4 신호(401-4)는 2369의 확산을 갖는다. 이러한 확산은 예시적인 신호이며 각각의 수신된 오디오 입력에 따라 달라질 것이다. 이 예에서는 가장 가까운 마이크로폰이 가장 적은 확산량을 가지지만 항상 그런 것은 아니다. 로컬 잔향은 사용자로부터 멀리 떨어진 다른 마이크로폰보다 클 수 있다. 이것은 근처에 있는 물체의 반사 등으로 인한 경우일 수 있다. 도 6은 시스템에 대한 예시적인 프로세스를 예시한다. 프로세스는 하나 초과의 어시스턴트 디바 이스의 프로세서가 어시스턴트 디바이스의 각각의 마이크로폰에서 오디오 입력을 통해 오디오 명령을 수신할 수 있는 블록 에서 시작할 수 있다. 오디오 명령은 \"조명 켜기” 또는 \"음악 재생\"과 같이 하나 이상의 디바이스를 제어하기 위한 사용자 음성 명령일 수 있다. 블록 에서, 프로세서는 오디오 입력의 에너지 피크를 조정하기 위해 오디오 입력을 정규화할 수 있다. 블록 에서, 프로세서는 무선 트랜시버를 통해 다른 개인용 어시스턴트 디바이스로부터 정 규화된 신호(즉, 마이크로폰 출력 신호)를 수신할 수 있다. 반대로, 프로세서는 또한 마이크로폰 출력 신호를 다른 개인용 어시스턴트 디바이스로 송신할 수 있다. 블록 에서, 프로세서는 마이크로폰 출력 신호를 자기 상관시킬 수 있다. 즉, 프로세서는 본 어 시스턴트 디바이스를 포함하는 각각의 어시스턴트 디바이스로부터의 각각의 마이크로폰 출력 신호를 비교 할 수 있다. 블록 에서, 프로세서는 마이크로폰 출력 신호를 정규화할 수 있다. 블록 에서, 프로세서는 마이크로폰 출력 신호 중 어느 것이 가장 높은 품질을 갖는지를 결정할 수 있 다. 품질이 가장 좋은 신호는 잔향이 가장 낮은 신호일 수 있다. 신호의 잔향은 RIR과 같은 상기에서 설명한 방 법을 사용하여 결정될 수 있다. 블록 에서, 프로세서는 본 디바이스의 관련 마이크로폰에서 수신된 마이크로폰 출력 신호 가 다른 수신된 마이크로폰 출력 신호에 비해 가장 낮은 잔향을 갖는지 여부를 결정한다. 만약 그렇다면, 프로 세스는 블록으로 진행한다. 그렇지 않다면, 다른 디바이스는 그들의 각각의 신호를 가장 낮은 잔향을 갖는 신호로 인식할 수 있고, 프로세스는 종료된다. 블록 에서, 프로세서는 디바이스에서 수신된 마이크로폰 출력 신호를 시스템 제어기로 송 신하도록 무선 트랜시버에 지시할 수 있다. 시스템 제어기는 그런다음 사용자에 의해 제공된 오디오 명령에 응답할 수 있다. 그런 다음 프로세스가 종료될 수 있다. 최고 품질의 신호만을 시스템 제어기로 송신함으로써, 오디오 명령의 중복 처리가 방지된다. 사용자 에 의해 제공된 오디오 명령을 더 잘 이해하게 할 수 있는 최고 품질의 신호는 명령에 응답하는데 사용될 수 있 다. 프로세스는 각각의 어시스턴트 디바이스가 해당 디바이스가 최고 품질의 신호를 수신했는지 여 부를 결정하고, 그렇다면 해당 신호를 시스템 제어기로 송신하는 예시적인 프로세스이다. 추가적으로 또는 대안적으로, 서버 제어기의 프로세서는 각각의 마이크로폰 출력 신호를 수신할 수 있고, 프로세 서는 그런 다음 수신된 신호 중 어느 것이 가장 높은 품질을 갖는지를 선택할 수 있다. 위의 시스템 및 방법이 개인용 어시스턴트 디바이스의 프로세서 또는 시스템 제어기의 프로세서 에 의해 수행되는 것으로 설명되지만, 프로세스는 다른 디바이스에 의해 수행되거나 클라우드 컴퓨팅 시스 템 내에서 수행될 수 있다. 프로세서는 반드시 컴패니언 디바이스(companion device)와 함께 방 내에 위치될 필 요는 없으며 일반적으로 원격일 수 있다. 따라서, 가상 어시스턴트 디바이스를 통해 제어할 수 있는 컴패니언 디바이스는 컴패니언 디바이스와 관련된 특 정 디바이스의 긴 이름에 익숙하지 않은 사용자에 의해 쉽게 명령될 수 있다. \"조명\"과 같은 단축 이름은 예를 들어, 사용자와 같은 방에서 사용자와 가까운 곳에 있는 조명을 제어하기에 충분할 수 있다. 사용자의 위치가 결정되면, 개인용 어시스턴트 디바이스는 사용자의 명령에 반응하여 컴패니언 디바이스를 효율적이고 쉽고 정확 하게 제어할 수 있다. 이상에서 예시적인 실시예를 설명하였으나, 이러한 실시예가 본 발명의 가능한 모든 형태를 설명하는 것은 아니 다. 오히려, 명세서에서 사용된 단어는 제한이 아닌 설명의 단어이며, 본 발명의 취지 및 범위를 벗어나지 않고 다양한 변경이 있을 수 있음을 이해한다. 추가적으로, 다양한 구현 실시예의 특징이 결합되어 본 발명의 추가 실시예를 형성할 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2021-7023077", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 실시예는 첨부된 청구 범위에서 구체적으로 주목된다. 그러나, 다양한 실시예들의 다른 특징들은 첨 부된 도면들과 함께 이하의 상세한 설명을 참조함으로써 더 명백해질 것이고 가장 잘 이해될 것이다 : 도 1은 하나 이상의 실시예에 따른 예시적인 지능형 개인용 어시스턴트 디바이스를 포함하는 시스템을 예시한다. 도 2는 일 실시예에 따른 복수의 지능형 개인용 어시스턴트 디바이스의 시스템을 예시한다. 도 3은 각각이 사용자로부터 다양한 거리에 있는, 다수의 마이크로폰에 의해 수신된 복수의 마이크로폰 출력 신 호의 예시적인 그래프를 예시한다. 도 4는 자기 상관된 마이크로폰 출력 신호 각각의 예시적인 그래프를 예시한다. 도 5는 도 4의 자기 상관 신호의 예시적인 그래프를 예시한다. 도 6은 도 2의 시스템의 예시적인 프로세스를 예시한다."}
