{"patent_id": "10-2024-0061351", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0168229", "출원번호": "10-2024-0061351", "발명의 명칭": "데이터 프로세서 코어, 데이터 프로세서, 전자 기기, 저장 매체 및 검퓨터 프로그램", "출원인": "쿤룬신 테크놀로지", "발명자": "장, 후이"}}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "처리될 컴퓨팅 명령을 검출한 것에 응답하여, 예열 명령을 생성하도록 구성된 제어 유닛; 및적어도 하나의 컴퓨팅 유닛 서브 어레이를 포함하는 컴퓨팅 유닛 어레이를 포함하며,상기 컴퓨팅 유닛 서브 어레이는, 상기 예열 명령을 수신하며 - 여기서, 상기 예열 명령은 상기 컴퓨팅 유닛 서브 어레이에 읽기 동작 및 컴퓨팅동작을 실행하도록 지시하기 위한 것임 -, 상기 예열 명령에 따라 예열 상태에 들어가며,상기 처리될 컴퓨팅 명령에 대응하는 목표 명령을 수신한 것에 응답하여, 상기 예열 상태에서 컴퓨팅 상태로 전환하도록 구성되는 데이터 프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 예열 명령은 제1 데이터에 대응하는 데이터 프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 컴퓨팅 유닛 서브 어레이는 또한,상기 제1 데이터를 읽어, 상기 예열 상태에 들어가며,상기 제1 데이터에 따라 컴퓨팅 동작을 실행하도록 구성되는 데이터 프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 목표 명령은 제2 데이터에 대응하고, 상기 목표 명령은 상기 컴퓨팅 유닛 서브 어레이에 읽기 동작, 컴퓨팅 동작 및 쓰기 동작을 실행하도록 지시하기 위한 것인 데이터 프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 컴퓨팅 유닛 서브 어레이는 또한,상기 제2 데이터를 읽어, 상기 예열 상태에서 상기 컴퓨팅 상태로 전환하며,상기 제2 데이터에 따라 컴퓨팅 동작을 실행하여 목표 컴퓨팅 결과를 얻으며,상기 목표 컴퓨팅 결과를 상기 목표 명령에 대응하는 주소 공간에 써넣도록 구성되는 데이터 프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 컴퓨팅 유닛 서브 어레이는 또한,상기 목표 명령에 대응하는 제2 데이터를 이용하여, 상기 제1 데이터에 따라 컴퓨팅 동작을 실행하여 얻은 결과를 덮어쓰도록 구성되는 데이터 프로세서 코어.공개특허 10-2024-0168229-3-청구항 7 제1항에 있어서,상기 제어 유닛은 또한,상기 예열 상태의 상기 컴퓨팅 유닛 서브 어레이의 수가 미리 설정된 수량 한계치보다 크거나 같다는 것을 결정한 것에 응답하여, 상기 목표 명령을 적어도 하나의 상기 예열 상태의 상기 컴퓨팅 유닛 서브 어레이 중의 목표컴퓨팅 유닛 서브 어레이로 출력하도록 구성되는 데이터 프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 컴퓨팅 유닛 어레이는 M개의 컴퓨팅 유닛 그룹을 포함하며, 상기 컴퓨팅 유닛 그룹은 적어도 하나의 컴퓨팅 유닛 서브 어레이를 포함하며, M는 1보다 크거나 같은 정수이며,상기 제어 유닛은 또한,상기 예열 명령을 M개의 상기 컴퓨팅 유닛 그룹의 제m 컴퓨팅 유닛 그룹으로 출력하며,상기 제m 컴퓨팅 유닛 그룹 중 N개의 상기 컴퓨팅 유닛 서브 어레이가 상기 예열 상태에 들어가는 것을 결정한것에 응답하여, 상기 예열 명령을 M개의 상기 컴퓨팅 유닛 그룹의 제m+1 컴퓨팅 유닛 그룹으로 출력하도록 구성되며,여기서, m는 1보다 크거나 같고 M보다 작은 정수인 데이터 프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 예열 상태에 대응하는 제1 소비 전력과 상기 컴퓨팅 상태에 대응하는 제2 소비 전력 사이의 소비 전력 차이는 미리 설정된 소비 전력 차이 한계치보다 작거나 같은 데이터 프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 예열 명령은 제1 데이터에 대응하고, 상기 목표 명령은 제2 데이터에 대응하고,상기 제1 데이터의 데이터 유형은 상기 제2 데이터의 데이터 유형과 일치하고,상기 제1 데이터와 상기 제2 데이터 사이의 규모 차이는 미리 설정된 규모 차이 한계치보다 작거나 같은 데이터프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 제어 유닛은 복수이고, 상기 컴퓨팅 유닛 어레이는 복수이고, 상기 제어 유닛은 하나의 상기 컴퓨팅 유닛어레이에 대응하는 데이터 프로세서 코어."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "적어도 하나의 제1항 내지 제11항 중 어느 하나의 데이터 프로세서 코어를 포함하는 데이터 프로세서."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항의 데이터 프로세서를 포함하는 데이터 처리 장치."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항의 데이터 처리 장치를 포함하는 전자 기기.공개특허 10-2024-0168229-4-청구항 15 상기 예열 명령을 수신하는 것 - 여기서, 상기 예열 명령은 처리될 컴퓨팅 명령을 검출한 상황에서 생성된 것이며, 상기 예열 명령은 컴퓨팅 유닛 서브 어레이에 읽기 동작 및 컴퓨팅 동작을 실행하도록 지시하기 위한 것임-;상기 예열 명령에 따라 예열 상태에 들어가는 것;상기 처리될 컴퓨팅 명령에 대응하는 목표 명령을 수신한 것에 응답하여, 상기 예열 상태에서 컴퓨팅 상태로 전환하는 것을 포함하는 데이터 처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 예열 명령은 제1 데이터에 대응하는 데이터 처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 예열 명령에 따라 예열 상태에 들어가는 것은,상기 제1 데이터를 읽어, 상기 예열 상태에 들어가는 것;상기 제1 데이터에 따라 컴퓨팅 동작을 실행하는 것을 포함하는 데이터 처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 목표 명령은 제2 데이터에 대응하고, 상기 목표 명령은 상기 컴퓨팅 유닛 서브 어레이에 읽기 동작, 컴퓨팅 동작 및 쓰기 동작을 실행하도록 지시하기 위한 것인 데이터 처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 예열 상태에서 컴퓨팅 상태로 전환하는 것은,상기 제2 데이터를 읽어, 상기 예열 상태에서 상기 컴퓨팅 상태로 전환하는 것;상기 제2 데이터에 따라 컴퓨팅 동작을 실행하여 목표 컴퓨팅 결과를 얻는 것;상기 목표 컴퓨팅 결과를 상기 목표 명령에 대응하는 주소 공간에 써넣는 것을 포함하는 데이터 처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서,상기 목표 명령에 대응하는 제2 데이터를 이용하여, 상기 제1 데이터에 따라 컴퓨팅 동작을 실행하여 얻은 결과를 덮어쓰는 것을 더 포함하는 데이터 처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제15항에 있어서,상기 목표 명령은 상기 예열 상태의 상기 컴퓨팅 유닛 서브 어레이의 수가 미리 설정된 수량 한계치보다 크거나같다는 것을 결정한 경우, 적어도 하나의 상기 예열 상태의 컴퓨팅 유닛 서브 어레이 중의 목표 컴퓨팅 유닛 서브 어레이로 출력되는 데이터 처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제15항에 있어서, 공개특허 10-2024-0168229-5-상기 컴퓨팅 유닛 어레이는 M개의 컴퓨팅 유닛 그룹을 포함하며, 상기 컴퓨팅 유닛 그룹은 적어도 하나의 컴퓨팅 유닛 서브 어레이를 포함하며, M는 1보다 크거나 같은 정수이며,상기 방법은,상기 예열 명령을 M개의 상기 컴퓨팅 유닛 그룹의 제m 컴퓨팅 유닛 그룹으로 출력하는 것;상기 제m 컴퓨팅 유닛 그룹 중 N개의 상기 컴퓨팅 유닛 서브 어레이가 상기 예열 상태에 들어가는 것을 결정한것에 응답하여, 상기 예열 명령을 M개의 상기 컴퓨팅 유닛 그룹의 제m+1 컴퓨팅 유닛 그룹으로 출력하는 것을더 포함하며,여기서, m는 1보다 크거나 같고 M보다 작은 정수인 데이터 처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제15항에 있어서, 상기 예열 상태에 대응하는 제1 소비 전력과 상기 컴퓨팅 상태에 대응하는 제2 소비 전력 사이의 소비 전력 차이는 미리 설정된 소비 전력 차이 한계치보다 작거나 같은 데이터 처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제15항에 있어서,상기 예열 명령은 제1 데이터에 대응하고, 상기 목표 명령은 제2 데이터에 대응하고,상기 제1 데이터의 데이터 유형은 상기 제2 데이터의 데이터 유형과 일치하고,상기 제1 데이터와 상기 제2 데이터 사이의 규모 차이는 미리 설정된 규모 차이 한계치보다 작거나 같은 데이터처리 방법."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결된 메모리를 포함하며, 여기서,상기 메모리에는 적어도 하나의 프로세서에 의해 실행 가능한 명령어가 저장되어 있고, 상기 명령어는 적어도하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서로 하여금 제15항 내지 제24항 중 어느 하나의데이터 처리 방법을 실행할 수 있게 하는 전자 기기."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "컴퓨터로 하여금 제15항 내지 제24항 중 어느 하나의 데이터 처리 방법을 실행하게 하기 위한 컴퓨터 명령어가저장되어 있는 비휘발성 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2024-0061351", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "저장 매체에 저장되어 있는 컴퓨터 프로그램으로서,프로세서에 의해 실행될 시에 제15항 내지 제24항 중 어느 하나의 데이터 처리 방법을 구현하는 컴퓨터 프로그램."}
{"patent_id": "10-2024-0061351", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 데이터 프로세서 코어를 제공하며, 인공 지능"}
{"patent_id": "10-2024-0061351", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한것으로, 특히 집적 회로 기술 분야와 칩 기술 분야에 관한 것이다. 해당 프로세서 코어는, 처리될 컴퓨팅 명령을 검출한 것에 응답하여, 예열 명령을 생성하도록 구성되는 제어 유닛; 및 적어도 하나의 컴퓨팅 유닛 서브 어레이를 포함하는 컴퓨팅 유닛 어레이를 포함하며, 컴퓨팅 유닛 서브 어레이는, 예열 명령을 수신하며, - 여기서, 예열 명령은 컴퓨팅 유닛 서브 어레이 에 읽기 동작 및 컴퓨팅 동작을 실행하도록 지시하기 위한 것임 -; 예열 명령에 따라 예열 상태에 들어가며, 처 리될 컴퓨팅 명령에 대응하는 목표 명령을 수신한 것에 응답하여, 예열 상태에서 컴퓨팅 상태로 전환하도록 구성 된다. 본 개시는 또한 데이터 프로세서, 데이터 프로세서 장치, 방법, 전자 기기, 저장 매체 및 컴퓨터 프로그램 을 제공한다 대 표 도 - 도2"}
{"patent_id": "10-2024-0061351", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2024-0168229 CPC특허분류 G06F 1/329 (2019.01) G06F 17/16 (2013.01) G06F 7/5443 (2013.01) G06F 9/30189 (2013.01) G06F 9/3885 (2013.01) G06F 9/5027 (2013.01) G06N 3/063 (2013.01) Y02D 10/00 (2020.08) 발명자 오우양, 지안 중국, 100101 베이징, 하이뎬 디스트릭트, 샹디 10 번가 10, 빌딩 1, 4층 씨더블유 섹션 리, 후이민 중국, 100101 베이징, 하이뎬 디스트릭트, 샹디 10 번가 10, 빌딩 1, 4층 씨더블유 섹션구, 캉후이 중국, 100101 베이징, 하이뎬 디스트릭트, 샹디 10 번가 10, 빌딩 1, 4층 씨더블유 섹션 장, 신이 중국, 100101 베이징, 하이뎬 디스트릭트, 샹디 10 번가 10, 빌딩 1, 4층 씨더블유 섹션명 세 서 청구범위 청구항 1 처리될 컴퓨팅 명령을 검출한 것에 응답하여, 예열 명령을 생성하도록 구성된 제어 유닛; 및 적어도 하나의 컴퓨팅 유닛 서브 어레이를 포함하는 컴퓨팅 유닛 어레이를 포함하며, 상기 컴퓨팅 유닛 서브 어레이는, 상기 예열 명령을 수신하며 - 여기서, 상기 예열 명령은 상기 컴퓨팅 유닛 서브 어레이에 읽기 동작 및 컴퓨팅 동작을 실행하도록 지시하기 위한 것임 -, 상기 예열 명령에 따라 예열 상태에 들어가며, 상기 처리될 컴퓨팅 명령에 대응하는 목표 명령을 수신한 것에 응답하여, 상기 예열 상태에서 컴퓨팅 상태로 전 환하도록 구성되는 데이터 프로세서 코어. 청구항 2 제1항에 있어서, 상기 예열 명령은 제1 데이터에 대응하는 데이터 프로세서 코어. 청구항 3 제2항에 있어서, 상기 컴퓨팅 유닛 서브 어레이는 또한, 상기 제1 데이터를 읽어, 상기 예열 상태에 들어가며, 상기 제1 데이터에 따라 컴퓨팅 동작을 실행하도록 구성되는 데이터 프로세서 코어. 청구항 4 제1항에 있어서, 상기 목표 명령은 제2 데이터에 대응하고, 상기 목표 명령은 상기 컴퓨팅 유닛 서브 어레이에 읽기 동작, 컴퓨 팅 동작 및 쓰기 동작을 실행하도록 지시하기 위한 것인 데이터 프로세서 코어. 청구항 5 제4항에 있어서, 상기 컴퓨팅 유닛 서브 어레이는 또한, 상기 제2 데이터를 읽어, 상기 예열 상태에서 상기 컴퓨팅 상태로 전환하며, 상기 제2 데이터에 따라 컴퓨팅 동작을 실행하여 목표 컴퓨팅 결과를 얻으며, 상기 목표 컴퓨팅 결과를 상기 목표 명령에 대응하는 주소 공간에 써넣도록 구성되는 데이터 프로세서 코어. 청구항 6 제2항에 있어서, 상기 컴퓨팅 유닛 서브 어레이는 또한, 상기 목표 명령에 대응하는 제2 데이터를 이용하여, 상기 제1 데이터에 따라 컴퓨팅 동작을 실행하여 얻은 결과 를 덮어쓰도록 구성되는 데이터 프로세서 코어.청구항 7 제1항에 있어서, 상기 제어 유닛은 또한, 상기 예열 상태의 상기 컴퓨팅 유닛 서브 어레이의 수가 미리 설정된 수량 한계치보다 크거나 같다는 것을 결정 한 것에 응답하여, 상기 목표 명령을 적어도 하나의 상기 예열 상태의 상기 컴퓨팅 유닛 서브 어레이 중의 목표 컴퓨팅 유닛 서브 어레이로 출력하도록 구성되는 데이터 프로세서 코어. 청구항 8 제1항에 있어서, 상기 컴퓨팅 유닛 어레이는 M개의 컴퓨팅 유닛 그룹을 포함하며, 상기 컴퓨팅 유닛 그룹은 적어도 하나의 컴퓨 팅 유닛 서브 어레이를 포함하며, M는 1보다 크거나 같은 정수이며, 상기 제어 유닛은 또한, 상기 예열 명령을 M개의 상기 컴퓨팅 유닛 그룹의 제m 컴퓨팅 유닛 그룹으로 출력하며, 상기 제m 컴퓨팅 유닛 그룹 중 N개의 상기 컴퓨팅 유닛 서브 어레이가 상기 예열 상태에 들어가는 것을 결정한 것에 응답하여, 상기 예열 명령을 M개의 상기 컴퓨팅 유닛 그룹의 제m+1 컴퓨팅 유닛 그룹으로 출력하도록 구성 되며, 여기서, m는 1보다 크거나 같고 M보다 작은 정수인 데이터 프로세서 코어. 청구항 9 제1항에 있어서, 상기 예열 상태에 대응하는 제1 소비 전력과 상기 컴퓨팅 상태에 대응하는 제2 소비 전력 사이의 소비 전력 차 이는 미리 설정된 소비 전력 차이 한계치보다 작거나 같은 데이터 프로세서 코어. 청구항 10 제1항에 있어서, 상기 예열 명령은 제1 데이터에 대응하고, 상기 목표 명령은 제2 데이터에 대응하고, 상기 제1 데이터의 데이터 유형은 상기 제2 데이터의 데이터 유형과 일치하고, 상기 제1 데이터와 상기 제2 데이터 사이의 규모 차이는 미리 설정된 규모 차이 한계치보다 작거나 같은 데이터 프로세서 코어. 청구항 11 제1항에 있어서, 상기 제어 유닛은 복수이고, 상기 컴퓨팅 유닛 어레이는 복수이고, 상기 제어 유닛은 하나의 상기 컴퓨팅 유닛 어레이에 대응하는 데이터 프로세서 코어. 청구항 12 적어도 하나의 제1항 내지 제11항 중 어느 하나의 데이터 프로세서 코어를 포함하는 데이터 프로세서. 청구항 13 제12항의 데이터 프로세서를 포함하는 데이터 처리 장치. 청구항 14 제13항의 데이터 처리 장치를 포함하는 전자 기기.청구항 15 상기 예열 명령을 수신하는 것 - 여기서, 상기 예열 명령은 처리될 컴퓨팅 명령을 검출한 상황에서 생성된 것이 며, 상기 예열 명령은 컴퓨팅 유닛 서브 어레이에 읽기 동작 및 컴퓨팅 동작을 실행하도록 지시하기 위한 것임 -; 상기 예열 명령에 따라 예열 상태에 들어가는 것; 상기 처리될 컴퓨팅 명령에 대응하는 목표 명령을 수신한 것에 응답하여, 상기 예열 상태에서 컴퓨팅 상태로 전 환하는 것을 포함하는 데이터 처리 방법. 청구항 16 제15항에 있어서, 상기 예열 명령은 제1 데이터에 대응하는 데이터 처리 방법. 청구항 17 제16항에 있어서, 상기 예열 명령에 따라 예열 상태에 들어가는 것은, 상기 제1 데이터를 읽어, 상기 예열 상태에 들어가는 것; 상기 제1 데이터에 따라 컴퓨팅 동작을 실행하는 것을 포함하는 데이터 처리 방법. 청구항 18 제15항에 있어서, 상기 목표 명령은 제2 데이터에 대응하고, 상기 목표 명령은 상기 컴퓨팅 유닛 서브 어레이에 읽기 동작, 컴퓨 팅 동작 및 쓰기 동작을 실행하도록 지시하기 위한 것인 데이터 처리 방법. 청구항 19 제18항에 있어서, 상기 예열 상태에서 컴퓨팅 상태로 전환하는 것은, 상기 제2 데이터를 읽어, 상기 예열 상태에서 상기 컴퓨팅 상태로 전환하는 것; 상기 제2 데이터에 따라 컴퓨팅 동작을 실행하여 목표 컴퓨팅 결과를 얻는 것; 상기 목표 컴퓨팅 결과를 상기 목표 명령에 대응하는 주소 공간에 써넣는 것을 포함하는 데이터 처리 방법. 청구항 20 제16항에 있어서, 상기 목표 명령에 대응하는 제2 데이터를 이용하여, 상기 제1 데이터에 따라 컴퓨팅 동작을 실행하여 얻은 결과 를 덮어쓰는 것을 더 포함하는 데이터 처리 방법. 청구항 21 제15항에 있어서, 상기 목표 명령은 상기 예열 상태의 상기 컴퓨팅 유닛 서브 어레이의 수가 미리 설정된 수량 한계치보다 크거나 같다는 것을 결정한 경우, 적어도 하나의 상기 예열 상태의 컴퓨팅 유닛 서브 어레이 중의 목표 컴퓨팅 유닛 서 브 어레이로 출력되는 데이터 처리 방법. 청구항 22 제15항에 있어서, 상기 컴퓨팅 유닛 어레이는 M개의 컴퓨팅 유닛 그룹을 포함하며, 상기 컴퓨팅 유닛 그룹은 적어도 하나의 컴퓨 팅 유닛 서브 어레이를 포함하며, M는 1보다 크거나 같은 정수이며, 상기 방법은, 상기 예열 명령을 M개의 상기 컴퓨팅 유닛 그룹의 제m 컴퓨팅 유닛 그룹으로 출력하는 것; 상기 제m 컴퓨팅 유닛 그룹 중 N개의 상기 컴퓨팅 유닛 서브 어레이가 상기 예열 상태에 들어가는 것을 결정한 것에 응답하여, 상기 예열 명령을 M개의 상기 컴퓨팅 유닛 그룹의 제m+1 컴퓨팅 유닛 그룹으로 출력하는 것을 더 포함하며, 여기서, m는 1보다 크거나 같고 M보다 작은 정수인 데이터 처리 방법. 청구항 23 제15항에 있어서, 상기 예열 상태에 대응하는 제1 소비 전력과 상기 컴퓨팅 상태에 대응하는 제2 소비 전력 사이의 소비 전력 차 이는 미리 설정된 소비 전력 차이 한계치보다 작거나 같은 데이터 처리 방법. 청구항 24 제15항에 있어서, 상기 예열 명령은 제1 데이터에 대응하고, 상기 목표 명령은 제2 데이터에 대응하고, 상기 제1 데이터의 데이터 유형은 상기 제2 데이터의 데이터 유형과 일치하고, 상기 제1 데이터와 상기 제2 데이터 사이의 규모 차이는 미리 설정된 규모 차이 한계치보다 작거나 같은 데이터 처리 방법. 청구항 25 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결된 메모리를 포함하며, 여기서, 상기 메모리에는 적어도 하나의 프로세서에 의해 실행 가능한 명령어가 저장되어 있고, 상기 명령어는 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서로 하여금 제15항 내지 제24항 중 어느 하나의 데이터 처리 방법을 실행할 수 있게 하는 전자 기기. 청구항 26 컴퓨터로 하여금 제15항 내지 제24항 중 어느 하나의 데이터 처리 방법을 실행하게 하기 위한 컴퓨터 명령어가 저장되어 있는 비휘발성 컴퓨터 판독 가능 저장 매체. 청구항 27 저장 매체에 저장되어 있는 컴퓨터 프로그램으로서, 프로세서에 의해 실행될 시에 제15항 내지 제24항 중 어느 하나의 데이터 처리 방법을 구현하는 컴퓨터 프로그 램. 발명의 설명 기 술 분 야 본 개시는 인공 지능 기술 분야에 관한 것으로, 특히 집적 회로 기술 분야와 칩 기술 분야에 관한 것이다. 보다 구체적으로는, 본 개시는 데이터 프로세서 코어, 데이터 프로세서, 데이터 프로세서 장치, 방법, 전자 기기, 저 장 매체 및 검퓨터 프로그램을 제공한다."}
{"patent_id": "10-2024-0061351", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능 기술의 발전에 따라 인공 지능 칩의 응용 장면은 지속적으로 증가하고 있다. 인공 지능 칩은 비교적 많은 곱셈 누적 연산 유닛(Multiply ACcumulate, MAC) 어레이를 가질 수 있으며, 비교적 강한 행렬 컴퓨팅 능력 을 가지고 있다. 본 개시는 데이터 프로세서 코어, 데이터 프로세서, 데이터 프로세서 장치, 방법, 전자 기기 및 저장 매체를 제 공한다. 본 개시의 일 측면에 따르면, 데이터 프로세서 코어를 제공하며, 해당 프로세서 코어는, 처리될 컴퓨팅 명령을 검출한 것에 응답하여, 예열 명령를 생성하도록 구성되는 제어 유닛; 적어도 하나의 컴퓨팅 유닛 서브 어레이를 포함하는 컴퓨팅 유닛 어레이를 포함하며, 컴퓨팅 유닛 서브 어레이는, 예열 명령을 수신하며, - 여기서, 예열 명령은 컴퓨팅 유닛 서브 어레이에 읽기 동작 및 컴퓨팅 동작을 실행하도록 지시하기 위한 것임 -; 예열 명령에 따라 예열 상태에 들어가며; 처리될 컴퓨팅 명령에 대응하는 목표 명령을 수신한 것에 응답하여, 예열(warm-up) 상태에서 컴퓨팅 상태로 전환하도록 구성된다. 본 개시의 다른 측면에 따르면, 데이터 프로세서를 제공하며, 적어도 하나의 본 개시가 제공하는 데이터 프로세 서 코어를 포함한다. 본 개시의 다른 측면에 따르면, 데이터 처리 장치를 제공하며, 해당 장치는 본 개시가 제공하는 데이터 프로세 서를 포함한다. 본 개시의 다른 측면에 따르면, 전자 기기를 제공하며, 본 개시가 제공하는 데이터 처리 장치를 포함한다. 본 개시의 일 측면에 따르면, 데이터 처리 방법을 제공하며, 해당 방법은, 예열 명령을 수신하는 것 - 여기서, 예열 명령은 처리될 컴퓨팅 명령을 검출한 상황에서 생성된 것이며, 예열 명령은 컴퓨팅 유닛 서브 어레이에 읽 기 동작 및 컴퓨팅 동작을 실행하도록 지시하기 위한 것임 -; 예열 명령에 따라 예열 상태에 들어가는 것; 처리 될 컴퓨팅 명령에 대응하는 목표 명령을 수신한 것에 응답하여, 예열 상태에서 컴퓨팅 상태로 전환하는 것을 포 함한다. 본 개시의 다른 측면에 따르면, 적어도 하나의 프로세서; 및 적어도 하나의 프로세서와 통신 연결된 메모리를 포함하는 전자 기기를 제공한다. 여기서, 메모리에는 적어도 하나의 프로세서에 의해 실행 가능한 명령어가 저 장되어 있고, 명령어는 적어도 하나의 프로세서에 의해 실행되어, 적어도 하나의 프로세서로 하여금 본 개시에 따라 제공된 방법을 실행할 수 있게 한다. 본 개시의 다른 측면에 따르면, 컴퓨터로 하여금 본 개시가 제공한 방법을 실행하게 하기 위한 컴퓨터 명령어가 저장되어 있는 비휘발성 컴퓨터 판독 가능 저장 매체를 제공한다. 본 개시의 다른 측면에 따르면, 프로세서에 의해 실행시에 본 개시가 제공한 방법을 구현하는 컴퓨터 프로그램 을 포함하는 컴퓨터 프로그램 제품을 제공한다. 이 부분에서 설명한 내용은 본 개시의 실시예의 핵심 또는 중요한 특징들을 표시하기 위한 것이 아니며, 본 개 시의 범위를 한정하는 데 사용하지 않는다는 것을 이해해야 한다. 본 개시의 기타 특징은 아래의 명세서를 통해 쉽게 이해할 수 있게 될 것이다."}
{"patent_id": "10-2024-0061351", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 예시적인 실시예를 상세히 설명하기로 한다. 이해를 돕기 위하여 그 중에는 본 개시의 실시예의 다양한 세부사항이 포함되어 있으며, 이들을 단지 예시적인 것으로 간주해야 한다. 따라서, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 본 개시의 범위 및 사상을 벗어나는 것이 없 이 여기서 설명된 실시예에 대해 다양한 변경 및 수정을 진행할 수 있음을 인식해야 한다. 마찬가지로, 명확하 고 간결하게 하기 위하여, 아래 설명 중에는 공지 기능 또는 구성에 대한 설명은 생략하도록 한다. 인공 지능 칩의 연산력은 컴퓨팅 유닛 어레이의 리소스 수와 정적 상관될 수 있다. 칩의 연산력이 높을수록 필 요한 컴퓨팅 리소스도 높아진다. 따라서, 연산력이 높은 칩의 구동 전류, 소비 전력은 모두 비교적 크다. 또한 ，칩의 동작 빈도는 비교적 빠르며, 1기가헤르츠(GHz)보다 클 수 있다. 칩은 짧은 시간 내에 피크(peek) 소비 전력 또는 피크 전류에 도달할 수 있다. 하지만, 칩의 전원의 구동 전류 응답 속도가 상대적으로 느리며, 아래 에서, 도 1과 결합하여 추가로 설명한다. 도 1은 본 개시의 일 실시예에 따른 인공 지능 칩의 전류와 전압의 개략도이다. 도 1에 도시된 바와 같이, 칩의 피크 소비 전력이 결정된 경우, 유휴 전류에서 동작 전류로 신속하게 전환할 때, 칩의 연산력은 피크 연산력에 근접하거나 도달할 수 있지만, 칩 전원의 공급 전압은 갑자기 감소된다 (예를 들면 전압 VL11로 감소). 동작 전류에서 유휴 전류로 신속하게 전환할 때, 칩의 연산력은 거의 0이지만 칩 전원 의 공급 전압은 갑자기 증가된다(예를 들면 전압 VH11로 증가). 공급 전압이 갑자기 증가되거나 감소되면 모두 칩의 회로에 불리한 영향을 미칠 수 있다. 예를 들면, 공급 전압이 갑자기 증가되면 회로가 파괴될 수 있다. 공 급 전압이 갑자기 감소되면 회로가 충분한 전압을 얻지 못해 회로가 정상적으로 동작할 수 없게 되어 잘못된 계 산 결과가 출력될 수 있다. 일부 실시예에서, 전압이 갑자기 증가되거나 갑자기 감소되는 것을 피하기 위해, 칩의 모든 계산 유닛을 분할하 여 복수의 계산 유닛 어레이를 얻을 수 있다. 컴퓨팅 유닛은 곱셈 누적 연산 유닛일 수 있다. 컴퓨팅 유닛 어레 이는, 펄스 신호의 수신에 응답하여, 컴퓨팅을 진행하도록 구성될 수 있다. 펄스 신호가 수신되지 않으면 컴퓨 팅 유닛 어레이는 유휴 상태가 될 수 있다. 유휴 상태에서, 컴퓨팅 유닛 어레이는 읽기 동작, 컴퓨팅 동작 또는 쓰기 동작을 실행하지 않는다. 컴퓨팅 유닛 어레이의 소비 전력은 대기 소비 전력일 수 있다. 대기 소비 전력은 피크 소비 전력보다 작은 비교적 작은 값일 수 있다. 따라서, 블록별 시동을 구현할 수 있으며, 칩의 연산력이 피크 연산력에 신속하게 도달하는 것을 피할 수 있다. 그러나, 블록별 시동은 칩의 연산력에 영향을 미칠 수 있 다. 그 이유는, 칩의 복수의 컴퓨팅 유닛 어레이는 블록별로 시동되며, 시동 과정에서 복수의 컴퓨팅 유닛 어레 이가 순차적으로 시동되는 것으로 인하여, 연산력이 제한되어, 칩의 전체 컴퓨팅 시간이 길어지고 성능이 저하 되게 되기 때문이다. 이에 기반하여, 칩의 수명을 제공하고 칩의 연산력을 더 높은 수준으로 유지하기 위해, 본 개시는 데이터 프로 세서 코어를 제공하며, 아래에서 추가로 설명한다. 도 2는 본 개시의 일 실시예에 따른 데이터 프로세서 코어의 개략 블록도이다. 도 2에 도시한 바와 같이, 데이터 프로세서 코어는 제어 유닛과 컴퓨팅 유닛 어레이를 포함할 수 있다. 제어 유닛은 처리될 컴퓨팅 명령을 검출한 것에 응답하여, 예열 명령을 생성하도록 구성될 수 있다. 본 개 시의 실시예에서, 처리될 컴퓨팅 명령은 딥 러닝 모델과 관련된 명령어일 수 있으며, 행렬 컴퓨팅과 관련된다.예를 들면, 제어 유닛은 처리될 컴퓨팅 명령을 수신한 후, 예열 명령을 생성한다. 컴퓨팅 유닛 어레이는 적어도 하나의 컴퓨팅 유닛 서브 어레이를 포함할 수 있다. 컴퓨팅 유닛 서브 어레 이는, 예열 명령을 수신하며, 예열 명령에 따라 예열 상태에 들어가며, 처리될 컴퓨팅 명령에 대응하는 목표 명 령을 수신한 것에 응답하여, 예열 상태에서 컴퓨팅 상태로 전환하는 것으로 구성될 수 있다. 본 개시의 실시예에서, 컴퓨팅 유닛 어레이는 곱셈 누적 유닛 어레이, 곱셈 연산 유닛 어레이 또는 합성곱 유닛 어레이 등 다양한 컴퓨팅 유닛 어레이일 수 있다. 본 개시의 실시예에서, 예열 명령은 컴퓨팅 유닛 서브 어레이에 읽기 동작과 컴퓨팅 동작을 실행하도록 지시할 수 있다. 예를 들면, 예열 명령은 컴퓨팅 유닛 서브 어레이에 읽기 동작과 컴퓨팅 동작을 실행하도록 지시할 수 있으며, 컴퓨팅 유닛 서브 어레이에 쓰기 동작을 진행하지 않도록 지시할 수도 있다. 본 개시의 실시예에서, 처리될 명령어에 따라 목표 명령을 결정할 수 있다. 예를 들면, 처리될 명령어는 프로세 서 코어 또는 컴퓨팅 유닛 어레이에 대응할 수 있다. 목표 명령은 컴퓨팅 유닛 서브 어레이에 대응할 수 있다. 처리될 명령어에 대응하는 행렬을 분할하여 목표 명령에 대응하는 서브 행렬을 결정할 수 있다. 본 개시의 실시예를 통해, 예열 명령에 기반하여 컴퓨팅 유닛 서브 어레이가 예열 상태에 들어가도록 하여, 전 체 칩 컴퓨팅 코어가 점차 피크 소비 전력에 도달하거나 근접하도록 하는 데 도움이 된다. 따라서, 컴퓨팅 명령 을 처리할 때, 칩의 소비 전력의 돌변을 줄일 수 있고, 소비 전력이 갑자기 크게 증가되지 않으며, 전압도 갑자 기 낮아지지 않아, 칩의 성능과 수명을 향상시키는 데 도움이 된다. 또한, 목표 명령을 수신하기 전에 칩의 전 압은 비교적 안정되므로, 컴퓨팅의 정밀도를 향상시킬 수 있으며, 칩의 연산력을 비교적 높은 수준으로 유지시 켜, 컴퓨팅 결과의 정확도를 향상시키는 데 도움이 된다. 위에서 본 개시의 프로세서 코어에 대해 설명한 것임을 이해할 수 있으며, 아래에서, 본 개시의 예열 상태와 컴 퓨팅 상태에 대해 추가로 설명한다. 본 개시의 실시예에서, 제어 유닛이 처리될 컴퓨팅 명령을 검출하지 않는 경우, 컴퓨팅 유닛 서브 어레이는 유 휴 상태에 있다. 유휴 상태에서, 컴퓨팅 유닛 서브 어레이는 읽기 동작과 컴퓨팅 동작을 진행하지 않는다. 본 개시의 실시예에서, 제어 유닛이 처리될 컴퓨팅 명령을 검출하지 않는 경우, 컴퓨팅 유닛은 제어 유닛이 생 성한 예열 명령을 수신할 수 있다. 예열 명령은 제1 데이터에 대응할 수 있다. 아래에서, 도 3a와 결합하여 추 가로 설명한다. 도 3a는 본 개시의 일 실시예에 따른 예열 상태의 컴퓨팅 유닛 서브 어레이의 개략도이다. 본 개시의 실시예에서, 컴퓨팅 유닛 서브 어레이는 또한, 제1 데이터를 읽고, 예열 상태로 들어가며, 제1 데이 터에 따라 컴퓨팅 동작을 실행하는 것으로 구성될 수 있다. 도 3a에 도시된 바와 같이, 컴퓨팅 유닛 서브 어레 이는 제1 데이터를 읽을 수 있다. 제1 데이터(D31)에 따라 컴퓨팅 유닛 서브 어레이는 컴퓨팅 동작 을 실행하여 예열 명령에 대응하는 제1 컴퓨팅 결과를 얻을 수 있다. 제1 컴퓨팅 결과는 레지스터나 주소 공간 에 써넣지 않을 수 있다. 읽기 동작 및 컴퓨팅 동작을 실행하는 과정에서, 컴퓨팅 유닛 서브 어레이는 예 열 상태에 있을 수 있다. 컴퓨팅 유닛 서브 어레이의 상태는 유휴 상태 및 동작 상태를 포함할 수 있음을 이해 할 수 있다. 본 개시의 실시예에서, 동작 상태는 예열 상태를 포함할 수 있다. 예열 상태는 제1 데이터에 따라 읽기 동작과 컴퓨팅 동작을 실행하는 동작 상태일 수 있다. 본 개시의 실시예를 통하여, 제1 데이터에 따라 읽 기 동작과 컴퓨팅 동작을 실행하면, 칩의 소비 전력을 점차 상승시킬수 있으며, 예열 상태의 구현에도 편리하다. 위에서 본 개시의 예열 상태에 대해 설명한 것임을 이해할 수 있으며, 아래에서, 본 개시의 컴퓨팅 상태에 대해 추가로 설명한다. 도 3b는 본 개시의 일 실시예에 따른 컴퓨팅 상태의 컴퓨팅 유닛 서브 어레이의 개략도이다. 본 개시의 실시예에서, 목표 명령는 제2 데이터에 대응하고, 목표 명령은 컴퓨팅 유닛 서브 어레이에 읽기 동작, 컴퓨팅 동작 및 쓰기 동작을 실행하도록 지시하기 위한 것이다. 예를 들면, 제2 데이터는 처리될 컴퓨팅 명령과 관련된 서브 행렬일 수 있다. 본 개시의 실시예에서, 컴퓨팅 유닛 서브 어레이는 제2 데이터를 읽도록 구성될 수 있다. 도 3b에 도시된 바와 같이, 예열 상태의 컴퓨팅 유닛 서브 어레이는 제2 데이터(D32)를 읽을 수 있다.본 개시의 실시예에서, 컴퓨팅 유닛 서브 어레이는 또한, 목표 명령에 대응하는 제2 데이터를 이용하여， 제1 데이터에 따라 컴퓨팅 동작을 실행하여 얻은 결과를 덮어쓰도록 구성될 수 있다. 예를 들면, 제2 데이터(D32)를 이용하여 상술한 제1 컴퓨팅 결과를 덮어쓸 수 있다. 본 개시의 실시예를 통해, 제2 데이터를 이용하여 예열 명 령에 대응하는 제1 컴퓨팅 결과를 덮어쓰면, 목표 명령을 신속하게 처리하여, 목표 명령을 효율적으로 실행하고, 프로세서 코어의 컴퓨팅 리소스를 절약할 수 있다. 본 개시의 실시예에서, 컴퓨팅 유닛 서브 어레이는 또한, 제2 데이터에 따라 컴퓨팅 동작을 실행하여 목표 컴퓨 팅 결과를 얻도록 구성될 수 있다. 예를 들면, 제2 데이터(D32)에 따라 컴퓨팅 유닛 서브 어레이는 컴퓨 팅 동작을 실행하여， 목표 컴퓨팅 결과로 목표 명령에 대응하는 제2 컴퓨팅 결과를 얻을 수 있다. 본 개시의 실시예에서, 컴퓨팅 유닛 서브 어레이는 또한, 목표 컴퓨팅 결과를 목표 명령에 대응하는 주소 공간 에 써넣어, 예열 상태에서 컴퓨팅 상태로 전환하도록 구성될 수 있다. 예를 들면, 목표 명령은 주소 공간 Addr31에 대응할 수 있다. 목표 컴퓨팅 결과를 주소 공간 Addr31에 써넣을 수 있다. 읽기 동작, 컴퓨팅 동작 및 쓰기 동작을 실행하는 과정에서, 컴퓨팅 유닛 서브 어레이는 컴퓨팅 상태에 있을 수 있다. 컴퓨팅 유닛 서브 어레이의 상태는 유휴 상태 및 동작 상태를 포함할 수 있음을 이해할 수 있다. 본 개시의 실시예에서, 동 작 상태는 컴퓨팅 상태도 포함할 수 있다. 컴퓨팅 상태는 제2 데이터에 따라 읽기 동작, 컴퓨팅 동작 및 쓰기 동작을 실행하는 동작 상태일 수 있다. 위에서 본 개시의 예열 상태와 동작 상태의 컴퓨팅 유닛 서브 어레이에 대해 설명한 것임을 이해할 수 있으며, 아래에서, 본 개시의 제1 데이터와 제2 데이터에 대해 추가로 설명한다. 본 개시의 실시예에서, 제1 데이터의 데이터 유형과 제2 데이터의 데이터 유형은 일치할 수 있다. 예를 들면, 제2 데이터가 부동 소수점 데이터일 때, 제1 데이터도 부동 소수점 데이터일 수 있다. 또 예를 들면, 제2 데이 터가 고정 소수점 데이터일 때, 제1 데이터도 고정 소수점 데이터일 수 있다. 본 개시의 실시예에서, 제1 데이터와 제2 데이터 사이의 규모 차이는 미리 설정된 규모 차이 한계치보다 작거나 같다. 예를 들면, 제2 데이터의 규모가 [n,c,h,w]일 때, 제1 데이터의 규모도 [n,c,h,w]일 수 있다. n, c, h 및 w는 양의 정수일 수 있다. 본 개시의 실시예를 통해, 제1 데이터와 제2 데이터의 유형, 규모가 동일하거나 유사하여, 컴퓨팅 유닛 서브 어레이를 실제 컴퓨팅 명령의 데이터 유형에 신속하게 적응하도록 할 수 있어, 칩 의 연산력을 더욱 향상시키고, 컴퓨팅 효율을 향상시키는 데 도움이 된다. 위에서 본 개시의 제1 데이터와 제2 데이터에 대해 설명한 것임을 이해할 수 있으며, 아래에서, 본 개시의 제어 유닛과 컴퓨팅 유닛 서브 어레이에 대해 추가로 설명한다. 본 개시의 실시예에서, 컴퓨팅 유닛 어레이는 M개의 컴퓨팅 유닛 그룹을 포함할 수 있다. 컴퓨팅 유닛 그룹은 적어도 하나의 컴퓨팅 유닛 서브 어레이를 포함할 수 있다. M는 1보다 크거나 같은 정수일 수 있다. 아래에서, 도 4a와 결합하여 설명한다. 도 4a는 본 개시의 일 실시예에 따른 컴퓨팅 유닛 어레이의 개략도이다. 도 4a에 도시된 바와 같이,컴퓨팅 유닛 어레이는 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레 이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이 , 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서브 어레이, 컴퓨팅 유닛 서 브 어레이 및 컴퓨팅 유닛 서브 어레이를 포함할 수 있다. 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이에 대한 상세한 설명은 상술한 컴퓨팅 유닛 서브 어레이를 참조할 수 있 으며, 본 개시는 여기서는 다시 설명하지 않는다는 것을 이해할 수 있다. 도 4a에 도시된 바와 같이, 컴퓨팅 유닛 어레이는 4개의 컴퓨팅 유닛 그룹을 포함할 수 있다. 제1 컴퓨팅 유닛 그룹은 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이 를 포함할 수 있다. 제2 컴퓨팅 유닛 그룹은 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이 를 포함할 수 있다. 제3 컴 퓨팅 유닛 그룹은 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이 를 포함할 수 있다. 제4 컴퓨팅 유닛 그룹은 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이 를 포함할 수 있다. 본 실시예에서, M=4임을 이해할 수 있다. 도 4a에 도시된 바와 같이, 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 유휴 상태 일 수 있다. 본 개시의 실시예에서, 제어 유닛은 처리될 컴퓨팅 명령을 검출한 것에 응답하여, 예열 명령을 생성하도록 구성 될 수 있다. 이어서, 제어 유닛은 적어도 하나의 컴퓨팅 서브 어레이에 예열 명령을 출력하도록 구성될 수 있으 며, 아래에서, 도 4b 내지 도 4e와 결합하여 추가로 설명한다. 도 4b 내지 도 4e는 본 개시의 일 실시예에 따른 예열 상태의 컴퓨팅 유닛 그룹의 개략도이다. 본 개시의 실시예에서, 제어 유닛은 예열 명령을 M개의 컴퓨팅 유닛 그룹의 제m 컴퓨팅 유닛 그룹으로 출력하도 록 구성될 수 있다. 예를 들면, 4개의 예열 명령을 각각 제1 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레 이로 출력할 수 있다. 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 각각 예열 명령 을 수신하고, 예열 명령에 따라 각각 예열 상태에 들어갈 수 있다. 예열 상태의 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 도 4b에 도시된 바와 같다. 예열 상태에서, 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이의 경우, 제1 소비 전력 의 합은 예를 들면 컴퓨팅 유닛 어레이의 피크 소비 전력의 20%일 수 있다. 본 개시의 실시예에서, 제어 유닛은 또한, 제m 컴퓨팅 유닛 그룹 중 N개의 컴퓨팅 유닛 서브 어레이가 예열 상 태에 들어가는 것을 결정한 것에 응답하여, 예열 명령을 M개의 컴퓨팅 유닛 그룹의 제m+1 컴퓨팅 유닛 그룹으로 출력하도록 구성될 수 있다. m는 1보다 크거나 같고 M보다 작은 정수일 수 있다. 예를 들면, 제1 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이가 예열 상태에 들어가는 것을 결정한 후, 예열 명령을 제2 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이로 출력할 수 있다. 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 각각 예열 명령을 수신하고, 예열 명령에 따라 각각 예열 상태에 들어갈 수 있다. 예열 상태의 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 도 4c에 도시된 바와 같다. 본 개시의 실시예를 통해, 예열 명령을 서로 다른 컴퓨팅 유닛 서브 어레이에 순차적으로 제공할 수 있어, 소비 전 력의 점차적인 증가를 구현하여, 소비 전력의 돌변을 피하는 데 도움이 되며, 전압 과도로 저하하는 것도 피할 수 있다. 예열 상태에서, 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이의 경우, 제1 소비 전력 의 합은 예를 들면 컴퓨팅 유닛 어레이의 피크 소비 전력의 40%일 수 있다. 이어서, 제어 유닛은 제2 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이가 예열 상태에 들어가는 것을 결 정한 후, 예열 명령을 제3 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이로 출력할 수 있다. 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 각각 예열 명령을 수신하고, 예열 명령에 따라 각 각 예열 상태에 들어갈 수 있다. 예열 상태의 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이 는 도 4d에 도시된 바와 같다. 예열 상태에서, 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이의 경우, 제1 소비 전력 의 합은 예를 들면 컴퓨팅 유닛 어레이의 피크 소비 전력의 60%일 수 있다. 이어서, 제어 유닛은 제3 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이가 예열 상태에 들어가는 것을 결 정한 후, 예열 명령을 제4 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이로 출력할 수 있다. 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 각각 예열 명령을 수신하고, 예열 명령에 따라 각 각 예열 상태에 들어갈 수 있다. 예열 상태의 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이 는 도 4e에 도시된 바와 같다. 예열 상태에서, 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이의 경우, 제1 소비 전력 의 합은 예를 들면 컴퓨팅 유닛 어레이의 피크 소비 전력의 80%일 수 있다. 제1 소비 전력의 합은 단지 예 시일 뿐이며, 다른 실시예에서, 예열 상태에서, 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이 의 경우, 제1 소비 전력의 합은 예를 들면 컴퓨팅 유닛 어레이의 피크 소비 전력과 일치할 수 있다. 위에서 예열 상태에 들어한 복수의 컴퓨팅 유닛 서브 어레이에 대해 설명한 것임을 이해할 수 있으며, 아래에서, 컴퓨팅 상태로 전환하는 몇 가지 방식에 대해 설명한다. 도 4f는 본 개시의 일 실시예에 따른 컴퓨팅 상태의 컴퓨팅 유닛 어레이의 개략도이다. 본 개시의 실시예에서, 제어 유닛은 또한, 예열 상태의 컴퓨팅 유닛 서브 어레이의 수가 미리 설정된 수량 한계 치보다 크거나 같다는 것을 결정한 것에 응답하여, 목표 명령을 적어도 하나의 예열 상태의 컴퓨팅 유닛 서브 어레이 중의 목표 컴퓨팅 유닛 서브 어레이로 출력하도록 구성될 수 있다. 예를 들면, 미리 설정된 수량 한계치 는 예를 들면 컴퓨팅 유닛 어레이 중의 컴퓨팅 유닛 서브 어레이의 수와 관련될 수 있다. 도 4e에 도시된 바와 같이, 컴퓨팅 유닛 어레이는 16개의 컴퓨팅 유닛 서브 어레이를 포함한다. 미리 설정된 수량 한계치는 예 를 들면 12 또는 16일 수 있다. 미리 설정된 수량 한계치가 16인 것을 예시로 하면, 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이가 모두 예열 상태에 들어간 후, 제어 유닛은 목표 명령을 각각 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이로 출력할 수 있으며, 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이가 각자의 목표 명령에 따라 각각 제2 데이터를 읽고, 나아 가 각각 컴퓨팅 동작, 쓰기 동작을 실행하여 컴퓨팅 상태에 들어갈 수 있도록 한다. 컴퓨팅 상태의 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 도 4f에 도시된 바와 같다. 본 개시의 실시예에서, 예열 상태에 대응하는 제1 소비 전력과 컴퓨팅 상태에 대응하는 제2 소비 전력 사이의 소비 전력 차이는 미리 설정된 소비 전력 차이 한계치보다 작거나 같다. 예를 들면, 컴퓨팅 상태에서, 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이의 경우, 제2 소비 전력의 합은 예를 들면 컴퓨 팅 유닛 어레이의 피크 소비 전력의 100%일 수 있다. 미리 설정된 소비 전력 차이 한계치는 예를 들면 25% 일 수 있으며, 제2 소비 전력의 합과 제1 소비 전력의 합 사이의 소비 전력 차이(20%)는 미리 설정된 소비 전력 차이 한계치(25%)보다 작다. 이해할 수 있는 것은, 위에서 제어 유닛과 컴퓨팅 유닛 어레이를 예시로 본 개시에 대하여 설명하였 으나, 본 개시는 이에 한정되지 않으며, 제어 유닛은 적어도 하나일 수 있으며, 컴퓨팅 유닛 어레이도 적어도 하나일 수 있으며, 아래에서 추가로 설명한다. 본 개시의 실시예에서, 제어 유닛은 복수일 수 있으며, 컴퓨팅 유닛 어레이도 복수일 수 있으며, 제어 유닛은 하나의 컴퓨팅 유닛 어레이에 대응할 수 있다. 예를 들면, 복수의 제어 유닛은 제1 제어 유닛과 제2 제어 유닛 을 포함할 수 있다. 복수의 컴퓨팅 유닛 어레이는 제1 컴퓨팅 유닛 어레이와 제2 컴퓨팅 유닛 어레이를 포함할 수 있다. 제1 제어 유닛은 제1 컴퓨팅 유닛 어레이에 대응할 수 있으며, 제1 컴퓨팅 유닛 어레이에 대한 예열 명령을 생성할 수 있다. 제2 제어 유닛은 제2 컴퓨팅 유닛 어레이에 대응할 수 있으며, 제2 컴퓨팅 유닛 어레이 에 대한 예열 명령을 생성할 수 있다. 본 개시의 다른 실시예에서, 제어 유닛은 복수의 컴퓨팅 유닛 어레이에 대응할 수도 있으며, 복수의 제어 유닛 은 하나의 컴퓨팅 유닛 어레이에 대응할 수도 있으며, 본 개시는 이를 한정하지 않는다. 위에서 본 개시의 제어 유닛과 컴퓨팅 유닛에 대해 설명한 것임을 이해할 수 있으며, 아래에서, 본 개시의 제어 유닛에 대해 추가로 설명한다. 본 개시의 실시예에서, 제어 유닛은 또한, 목표 명령이 실행 완료되었음을 결정한 것에 응답하여, 예열 명령을 적어도 하나의 컴퓨팅 상태의 컴퓨팅 유닛 서브 어레이 중의 목표 컴퓨팅 유닛 서브 어레이로 출력하도록 구성 될 수 있다. 예를 들면, 예열 명령을 상술한 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이 로 출력하여 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이이 각각 컴퓨팅 상태 에서 예열 상태로 전환할 수 있도록 할 수 있다. 본 개시의 실시예에서, 제어 유닛은 또한, 미리 설정된 명령을 M개의 컴퓨팅 유닛 그룹의 제m 컴퓨팅 유닛 그룹 으로 출력하도록 구성될 수 있다. 예를 들면, 4개의 미리 설정된 명령을 각각 제1 컴퓨팅 유닛 그룹의 4개의 컴 퓨팅 유닛 서브 어레이로 출력할 수 있다. 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이 는 각각 미리 설정된 명령을 수신할 수 있고, 미리 설정된 명령에 따라 각각 예열 상태에서 유휴 상태로 전환할 수 있다. 본 개시의 실시예에서, 제어 유닛은 또한, 제m 컴퓨팅 유닛 그룹에서 N개의 컴퓨팅 유닛 서브 어레이가 유휴 상 태로 전환한 것을 결정하는 것에 응답하여, 미리 설정된 명령를 M개의 컴퓨팅 유닛 그룹의 제m+1 컴퓨팅 유닛 그룹으로 출력하도록 구성될 수 있다. 예를 들면, 제1 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이가 유 휴 상태로 전환되는 것을 결정한 후, 미리 설정된 명령을 제2 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레 이로 출력할 수 있다. 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 각각 미리 설정 된 명령을 수신하고, 미리 설정된 명령에 따라 각각 유휴 상태로 전환할 수 있다. 이어서, 제어 유닛은 제2 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이가 유휴 상태로 전환되는 것을 결 정한 후, 미리 설정된 명령을 제3 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이로 출력할 수 있다. 컴퓨팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 각각 미리 설정된 명령을 수신하고,미리 설정된 명령에 따라 각각 유휴 상태로 전환한다. 이어서, 제어 유닛은 제3 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이가 유휴 상태로 전환되는 것을 결 정한 후, 미리 설정된 명령을 제4 컴퓨팅 유닛 그룹의 4개의 컴퓨팅 유닛 서브 어레이로 출력할 수 있다. 컴퓨 팅 유닛 서브 어레이 내지 컴퓨팅 유닛 서브 어레이는 각각 미리 설정된 명령을 수신하고, 예열 명령에 따라 각각 유휴 상태로 전환한다. 본 개시의 실시예를 통해, 컴퓨팅 유닛 어레이가 이미 정한 소비 전력 값에서 대기 소비 전력으로 점차적으로 감소하도록 제어할 수 있다. 따라서, 컴퓨팅이 완료된 후, 칩의 소비 전 력의 돌변을 더욱 줄일 수 있고, 소비 전력이 갑자기 크게 감소되지 않으며, 전압도 갑자기 증가되지 않아, 칩 의 성능과 수명을 향상시키는 데 도움이 된다. 위에서 본 개시의 예열 명령에 대해 추가로 설명하였음을 이해할 수 있으며, 아래에서, 본 개시의 데이터 프로 세서 코어의 칩의 전압과 전류에 대해 설명한다. 도 5는 본 개시의 일 실시예에 따른 데이터 프로세서 코어를 포함하는 칩의 전압과 전류의 개략도이다. 상술한 바와 같이, 칩의 피크 소비 전력이 결정된 경우, 유휴 전류에서동작 전류로 신속하게 전환할 때, 칩의 연산력은 피크 연산력에 근접하거나 도달할 수 있지만, 칩 전원의 공급 전압은 갑자기 전압 VL51로 감소된다. 도 5에 도시된 바와 같이, 예를 들면 상술한 프로세서 코어를 포함하는 칩의 피크 전력 소비이 결정된 경우, 예열 명령에 기반하여, 칩은 유휴 전류에서 동작 전류로 점차적으로 전환된다. 칩의 연산력이 피크 연산 력에 근접하거나 도달할 수 있을 때, 칩 전원의 공급 전압도 갑자기 전압 VL52로 감소된다. 도 5에 도시된 바와 같이, 전압 VL52는 전압 VL51보다 크다. 따라서, 칩이 예열 명령에 기반하여 유휴 전류에서 동작 전류로 점차적으로 전환되는 경우, 칩의 전압 변동 폭이 크게 감소하여, 칩의 성능과 수명을 향상시키는 데 도움이 된다. 또한, 상술한 바와 같이, 동작 전류에서 유휴 전류로 신속하게 전환할 때, 칩의 연산력은 거의 0이지만, 칩 전 원의 공급 전압은 갑자기 VH51로 증가된다. 도 5에 도시된 바와 같이, 예를 들면 상술한 프로세서 코어를 포함하는 칩의 피크 전력 소비이 결정된 경우, 예열 명령에 기반하여, 칩은 동작 전류에서 유휴 전류로 점차적으로 전환된다. 칩의 연산력은 거의 0일 때, 칩 전원의 공급 전압도 갑자기 전압 VH52로 증가된다. 도 5에 도시된 바와 같이, 전압 VL52는 전압 Vl51보다 작다. 따라서, 칩이 예열 명령과 상술한 미리 설정된 명 령에 기반하여 동작 전류에서 유휴 전류로 점차적으로 전환되는 경우, 칩의 전압 변동 폭이 크게 감소하여, 칩 의 성능과 수명을 향상시키는 데 도움이 된다. 위에서 본 개시의 데이터 프로세서 코어에 대해 설명하였음을 이해할 수 있으며, 아래에서, 데이터 프로세서 코 어를 포함하는 데이터 프로세서에 대해 설명한다. 도 6은 본 개시의 일 실시예에 따른 데이터 프로세서의 개략도이다. 도 6에 도시된 바과 같이, 데이터 프로세서(P600)는 적어도 하나의 데이터 프로세서 코어를 포함할 수 있다. 데이터 프로세서 코어는 예를 들면 상술한 데이터 프로세서 코어일 수 있다. 위에서 본 개시의 데이터 프로세서에 대해 설명하였음을 이해할 수 있으며, 아래에서, 데이터 프로세서를 포함 하는 데이터 처리 장치에 대해 설명한다. 도 7은 본 개시의 일 실시예에 따른 데이터 처리 장치의 개략도이다. 도 7에 도시된 바와 같이, 데이터 처리 장치는 데이터 프로세서(P700)를 포함할 수 있다. 데이터 프로세서 (P700)는 예를 들면 상술한 데이터 프로세서(P600)일 수 있다. 위에서 본 개시의 데이터 처리 장치에 대해 설명하였음을 이해할 수 있으며, 아래에서, 데이터 처리 장치를 포 함하는 전자 기기에 대해 설명한다. 도 8은 본 개시의 일 실시예에 따른 전자 기기의 개략도이다. 도 8에 도시된 바와 같이, 전자 기기는 데이터 처리 장치를 포함할 수 있다. 데이터 처리 장치(80 0)는 예를 들면 상술한 데이터 처리 장치일 수 있다.위에서 본 개시의 데이터 전자 기기에 대해 설명하였음을 이해할 수 있으며, 아래에서, 본 개시의 데이터 처리 방법에 대해 설명한다. 도 9는 본 개시의 일 실시예에 따른 데이터 처리 방법의 개략 흐름도이다. 도 9에 도시된 바와 같이, 방법은 동작 S910 내지 동작 S930을 포함할 수 있다. 동작 S910에서, 예열 명령을 수신한다. 본 개시의 실시예에서, 예열 명령은 처리될 컴퓨팅 명령을 검출한 상황 에서 생성한 것이다. 동작 S920에서, 예열 명령에 따라 예열 상태에 들어간다. 동작 S930에서, 처리될 컴퓨팅 명령에 대응하는 목표 명령을 수신한 것에 응답하여, 예열 상태에서 컴퓨팅 상태 로 전환한다. 본 개시의 실시예에서, 상술한 컴퓨팅 유닛 서브 어레이를 이용하여 방법을 구현할 수 있다. 본 개시의 실시예에서, 예열 명령은 컴퓨팅 유닛 서브 어레이에 읽기 동작과 컴퓨팅 동작을 실행하도록 지시하 기 위한 것이다. 예를 들면, 예열 명령은 상술한 제어 유닛에 의해 생성된 것일 수 있다. 일부 실시예에서, 예열 명령은 제1 데이터에 대응한다. 일부 실시예에서, 예열 명령에 따라 예열 상태에 들어가는 것은, 제1 데이터를 읽고, 예열 상태에 들어가며, 제 1 데이터에 따라 컴퓨팅 동작을 실행하는 것을 포함한다. 일부 실시예에서, 목표 명령은 제2 데이터에 대응하고, 목표 명령은 컴퓨팅 유닛 서브 어레이에 읽기 동작, 컴 퓨팅 동작 및 쓰기 동작을 실행하도록 지시하기 위한 것이다. 일부 실시예에서, 예열 상태에서 컴퓨팅 상태로 전환하는 것은, 제2 데이터를 읽어, 예열 상태에서 컴퓨팅 상태 로 전환하며, 제2 데이터에 따라 컴퓨팅 동작을 실행하여 목표 컴퓨팅 결과를 얻으며, 목표 컴퓨팅 결과를 목표 명령에 대응하는 주소 공간에 써넣는 것을 포함한다. 일부 실시예에서, 방법은, 목표 명령에 대응하는 제2 데이터를 이용하여 제1 데이터에 따라 컴퓨팅 동작을 실행하여 얻은 결과를 덮어쓰는 것을 더 포함한다. 일부 실시예에서, 목표 명령은 예열 상태의 컴퓨팅 유닛 서브 어레이의 수가 미리 설정된 수량 한계치보다 크거 나 같다는 것을 결정한 경우, 적어도 하나의 예열 상태의 컴퓨팅 유닛 서브 어레이 중의 목표 컴퓨팅 유닛 서브 어레이로 출력된다. 일부 실시예에서, 컴퓨팅 유닛 어레이는 M개의 컴퓨팅 유닛 그룹을 포함하며, 컴퓨팅 유닛 그룹은 적어도 하나 의 컴퓨팅 유닛 서브 어레이를 포함하며, M는 1보다 크거나 같은 정수이다. 일부 실시예에서, 방법은, 예열 명령을 M개의 컴퓨팅 유닛 그룹의 제m 컴퓨팅 유닛 그룹으로 출력하며, 제 m 컴퓨팅 유닛 그룹 중 N개의 컴퓨팅 유닛 서브 어레이가 예열 상태에 들어가는 것을 결정한 것에 응답하여, 예 열 명령을 M개의 컴퓨팅 유닛 그룹의 제m+1 컴퓨팅 유닛 그룹으로 출력하는 것을 더 포함한다. m는 1보다 크거 나 같고 M보다 작은 정수이다. 일부 실시예에서, 예열 상태에 대응하는 제1 소비 전력과 컴퓨팅 상태에 대응하는 제2 소비 전력 사이의 소비 전력 차이는 미리 설정된 소비 전력 차이 한계치보다 작거나 같다. 일부 실시예에서, 예열 명령은 제1 데이터에 대응하고, 목표 명령은 제2 데이터에 대응하고, 제1 데이터의 데이 터 유형은 제2 데이터의 데이터 유형과 일치하다. 제1 데이터와 제2 데이터 사이의 규모 차이는 미리 설정된 규 모 차이 한계치보다 작거나 같다. 본 개시의 기술 방안에서 언급된 사용자 개인 정보의 수집, 저장,사용,가공,전송,제공과 공개 등 처리는 모두 관련 법률과 법규의 규정에 부합되고 공서 양속을 위반하지 않는다. 본 개시의 실시예에 따르면, 본 개시는 또한 전자 기기, 판독 가능 저장 매체 및 컴퓨터 프로그램 제품을 제공 한다. 도 10은 본 개시의 실시예를 실시하는데 사용될수 있는 예시적인 전자 기기 의 개략적인 블록도이다. 전 자 기기는 랩톱 컴퓨터, 데스크톱 컴퓨터, 웍스테이션, 개인 휴대 정보 단말기, 서버, 블레이드 서버, 메인 프레임 컴퓨터 및 기타 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 말한다. 전자 기기는 개인 휴대 정 보 단말기, 셀룰러 전화, 스마트 폰, 웨어러블 디바이스 및 기타 유사한 컴퓨팅 장치와 같은 다양한 형태의 모 바일 장치를 말할 수도 있다. 본 명세서에서 나타낸 부품, 이들의 연결 및 관계, 및 이들의 기능은 단지 예시일 뿐이며, 본 명세서에서의 설명 및/또는 요구하는 본 출원의 구현을 한정하려 하는 것이 아니다. 도 10에 도시된 바와 같이, 기기는 읽기 전용 기억 장치(ROM)에 저장된 컴퓨터 프로그램 또는 저장 유닛에서 랜덤 액세스 메모리(RAM)로 로드된 컴퓨터 프로그램에 따라 다양한 적절한 동작 및 처리 를 실행할 수 있는 컴퓨팅 유닛을 포함한다. RAM에는 저장 기기의 동작에 필요한 다양한 프 로그램 및 데이터가 저장될 수 있다. 컴퓨팅 유닛, ROM 및 RAM은 버스를 통해 서로 연결된다. 입력/출력(I/O)인터페이스도 버스에 연결된다. 기기 중의 복수의 부품은 I/O인터페이스와 연결되며, 예를 들면 키보드, 마우스 등과 같은 입력 유 닛; 예를 들면 다양한 유형의 디스플레이, 스피커 등과 같은 출력 유닛; 예를 들면 자기 디스크, 시디롬 등과 같은 저장 유닛 및 예를 들면 랜 카드, 모뎀, 무선 통신 송수신기 등과 같은 통신 유닛 을 포함한다. 통신 유닛은 기기가 인터넷과 같은 컴퓨터 네트워크 및/또는 다양한 통신 네트 워크와 기타 장치를 통하여 정보/데이터를 교환할 수 있도록 허용한다. 컴퓨팅 유닛은 처리 및 컴퓨팅 능력을 갖는 다양한 범용 및/또는 전용 처리 유닛일 수 있다. 컴퓨팅 유닛 의 일부 예는 중앙 처리 유닛(CPU), 그래픽 처리 유닛(GPU), 다양한 전용 인공 지능(AI) 컴퓨팅 칩, 머신 러닝 모델 알고리즘을 실행하는 다양한 컴퓨팅 유닛, 디지털 신호 처리 장치(DSP) 및 임의의 적절한 프로세서, 컨트롤러, 마이크로 컨트롤러 등를 포함하지만 이에 한정되지 않는다. 컴퓨팅 유닛은 예를 들면 데이터 처리 방법과 같은 상술한 다양한 방법과 처리를 실행한다. 예를 들면, 일부 실시예에서는 데이터 처리 방법은 컴퓨터 소프트웨어 프로그램으로 구현될 수 있으며, 이는 예를 들면 유형적으로 저장 유닛과 같은 기계 판독 가능 매체에 포함된다. 일부 실시예에서, 컴퓨터 프로그램의 일부 또는 전부는 ROM 및/또는 통신 유 닛을 통해 기기에 로드 및/또는 설치될수 있다. 컴퓨터 프로그램이 RAM에 로딩되고 컴퓨팅 유닛에 의해 실행될 경우, 상술한 데이터 처리 방법 중의 하나 또는 복수의 동작을 실행할 수 있다. 선택 적으로, 다른 실시 예에서, 컴퓨팅 유닛은 기타 임의의 적절한 방식(예를 들면, 펌웨어에 의해)으로 데이 터 처리 방법을 실행하도록 구성될 수 있다. 본 명세서의 상술한 시스템 및 기술의 다양한 구현 방식은 디지털 전자 회로 시스템, 집적 회로 시스템, 필드 프로그램 가능 게이트 어레이(FPGA), 전용 집적 회로(ASIC), 특정 용도 표준 제품(ASSP), 시스템 온칩(SOC), 복 합 프로그램 가능 논리 장치(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다양한 실시방식은 아래와 같은 것을 포함할 수 있다. 하나 또는 복수의 컴퓨터 프로그램에서 실 시될 수 있으며, 해당 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템에서 실행 및/또는 해석될 수 있으며, 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가능 프로세서일 수 있으며, 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터 및 명령어를 수신하고, 데이터 및 명령어를 해당 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치에 전송할 수 있다. 본 개시의 방법을 실행하기 위한 프로그램 코드는 하나 또는 복수의 프로그래밍 언어의 임의의 조합으로 작성될 수 있다. 이러한 프로그램 코드는 범용 컴퓨터, 전용 컴퓨터 또는 기타 프로그램 가능 데이터 처리 장치의 프로 세서 또는 컨트롤러에 제공하여, 프로그램 코드가 프로세서 또는 컨트롤러에 의해 실행될 때 흐름도 및/또는 블 록도에서 규정한 기능/동작이 실시되도록 할 수 있다. 프로그램 코드는 완전히 기계에서 실행되거나, 부분적으 로 기계에서 실행되거나, 독립적인 소프트웨어 패키지로서 부분적으로 기계에서 실행되면서 부분적으로 원격 기 계에서 실행되거나, 완전히 원격 기계 또는 서버에서 실행될 수 있다. 본 개시 내용의 맥락에서, 기계 판독 가능 매체는 명령어 실행 시스템, 장치 또는 설비에 의해 사용되거나, 명 령어 실행 시스템, 장치 또는 설비와 결합하여 사용되도록 제공하는 프로그램을 포함하거나 저장할 수 있는 매 체일 수있다. 기계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 저장 매체일 수 있다. 기 계 판독 가능 매체는 전자, 자기, 광학, 전자기, 적외선 또는 반도체 시스템, 장치 또는 기기, 또는 이들의 임 의의 적절한 조합을 포함할 수 있지만 이에 한정되지 않는다. 기계 판독 가능 저장 매체의 보다 구체적인 예에 는 하나 또는 복수의 전선에 기반한 전기 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 임의기억장치 (RAM), 읽기 전용 기억 장치 (ROM), 소거 가능 프로그램 가능 읽기 전용 기억 장치 (EPROM 또는 플래시 메모리), 광섬유, 휴 대용 컴팩트 디스크 읽기 전용 기억 장치 (CD-ROM), 광학 저장 장치, 자기 저장 장치 또는 이들의 임의의 적절한 조합을 포함할 수 있다. 사용자와의 인터랙션을 제공하기 위하여, 여기에 설명된 시스템 및 기술을 컴퓨터에서 실시할 수 있다. 이 컴퓨 터는 사용자에게 정보를 표시하는 디스플레이 장치(예: CRT(음극선관)모니터 또는 LCD(액정 디스플레이) ) 및 사용자가 컴퓨터에 입력을 제공할 수 있는 키보드 및 위치 결정 장치(예를 들면, 마우스 또는 트랙볼)를 구비한 다. 다른 유형의 장치도 사용자와의 인터랙션을 제공하기 위해 사용될 수 있다. 예를 들면, 사용자에게 제공되 는 피드백은 모든 형태의 감지 피드백(예를 들면, 시각 피드백, 청각 피드백 또는 촉각 피드백) 일 수 있고, 모 든 형태(소리 입력, 음성 입력 또는 촉각 입력을 포함)를 이용하여 사용자로부터의 입력을 접수할 수 있다. 위에 나타낸 다양한 형태의 흐름을 사용하여 동작을 다시 순서 배열, 추가 또는 삭제할 수 있음을 이해해야 한 다. 예를 들면, 본 출원에 기재된 각 동작은 본 개시에서 개시하는 기술 방안이 기대하는 결과를 구현할 수 있 는 한, 병행하여 실행하거나 순차적으로 실행하거나 다른 순서로 실행할 수도 있으며, 본 명세서에서는 여기에 대해서 제한을 하지 않는다. 상술한 구체적인 실시방식은 본 출원의 청구범위에 대한 제한을 구성하지 않는다. 해당 발명이 속하는 기술 분 야에서 통상의 지식을 가진 자라면 설계 요구 및 기타 요소에 따라 다양한 수정, 조합, 서브 조합 및 대체를 진 행할 수 있음을 이해해야 한다. 본 출원의 정신과 원칙내에서 이루어진 모든 수정, 동등한 대체 및 개선 등은 본 출원의 청구범위내에 포함되어야 한다."}
{"patent_id": "10-2024-0061351", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 방안을 보다 잘 이해 하는데 사용되며, 본 개시에 대한 한정이 되지 않는다. 그중에, 도 1은 본 개시의 일 실시예에 따른 인공 지능 칩의 전류와 전압의 개략도이며, 도 2는 본 개시의 일 실시예에 따른 데이터 프로세서 코어의 개략 블록도이며, 도 3a는 본 개시의 일 실시예에 따른 예열 상태의 컴퓨팅 유닛 서브 어레이의 개략도이며, 도 3b는 본 개시의 일 실시예에 따른 컴퓨팅 상태의 컴퓨팅 유닛 서브 어레이의 개략도이며, 도 4a는 본 개시의 일 실시예에 따른 컴퓨팅 유닛 어레이의 개략도이며, 도 4b 내지 도 4e는 본 개시의 일 실시예에 따른 예열 상태의 컴퓨팅 유닛 그룹의 개략도이며,도 4f는 본 개시의 일 실시예에 따른 컴퓨팅 상태의 컴퓨팅 유닛 어레이의 개략도이며, 도 5는 본 개시의 일 실시예에 따른 데이터 프로세서 코어를 포함하는 칩의 전압과 전류의 개략도이며, 도 6은 본 개시의 일 실시예에 따른 데이터 프로세서의 개략도이며, 도 7은 본 개시의 일 실시예에 따른 데이터 처리 장치의 개략도이며, 도 8은 본 개시의 일 실시예에 따른 전자 기기의 개략도이며, 도 9는 본 개시의 일 실시예에 따른 데이터 처리 방법의 개략 흐름도이며, 도 10은 본 개시의 일 실시예에 따른 데이터 처리 방법을 적용할 수 있는 전자 기기의 블록도이다."}
