{"patent_id": "10-2022-0166791", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0069548", "출원번호": "10-2022-0166791", "발명의 명칭": "이미지 변환 모델 제공 방법, 서버 및 컴퓨터 프로그램", "출원인": "알레시오 주식회사", "발명자": "최광민"}}
{"patent_id": "10-2022-0166791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 장치의 하나 이상의 프로세서에서 수행되는 방법에 있어서,복수의 소스 데이터를 획득하는 단계;복수의 소스 데이터에 기초하여 학습 데이터 세트를 구축하는 단계; 및상기 학습 데이터 세트를 통해 하나 이상의 네트워크 함수에 대한 학습을 수행하여 이미지 변환 모델을 생성하는 단계;를 포함하며,상기 복수의 소스 데이터 각각은, 초음파 이미지를 포함하고,상기 이미지 변환 모델은,상기 초음파 이미지를 입력으로 하여 상기 초음파 이미지와 상이한 도메인에 관련한 타겟 이미지를 출력하는 것을 특징으로 하는,이미지 변환 모델 제공 방법."}
{"patent_id": "10-2022-0166791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 소스 데이터 각각은, 상기 초음파 이미지에 대응하는 원본 이미지를 더 포함하며,상기 원본 이미지는, 상기 타겟 이미지와 동일한 도메인에 대응하는 이미지이며,서로 대응하는 상기 초음파 이미지와 원본 이미지는, 하나의 페어 이미지를 구성하는 것을 특징으로 하는,이미지 변환 모델 제공 방법."}
{"patent_id": "10-2022-0166791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 하나 이상의 네트워크 함수는,상기 초음파 이미지에 대응하는 잠재 변수를 출력하는 차원 감소 네트워크 함수; 및상기 잠재 변수를 입력으로 하는 경우, 상기 잠재 변수에 대응하는 타겟 이미지를 출력하도록 사전 학습된 생성자 모델;을 포함하며,상기 학습은,상기 생성자 모델을 통해 출력된 타겟 이미지와 상기 원본 이미지 간의 오차에 기초하여 상기 차원 감소 네트워크 함수의 가중치를 조정하는 것을 특징으로 하는,이미지 변환 모델 제공 방법.공개특허 10-2024-0069548-3-청구항 4 제2항에 있어서,상기 하나 이상의 네트워크 함수는,상기 초음파 이미지에 대응하는 잠재 변수를 출력하는 차원 감소 네트워크 함수; 상기 잠재 변수를 입력으로 하는 경우, 상기 잠재 변수에 대응하는 타겟 이미지를 출력하도록 사전 학습된 생성자 모델; 및상기 생성자 모델을 통해 출력된 타겟 이미지와 상기 차원 감소 네트워크 함수의 입력에 관련한 초음파 이미지가 상기 페어 이미지인지 여부를 판별하는 분류자 모델;을 더 포함하며,상기 학습은,상기 분류자 모델이 상기 초음파 이미지와 상기 생성자 모델을 통해 출력된 타겟 이미지를 상기 페어 이미지로판별할 확률이 높도록 상기 차원 감소 네트워크 함수 및 분류자 모델 각각의 가중치를 조정하는 것을 특징으로하는,이미지 변환 모델 제공 방법."}
{"patent_id": "10-2022-0166791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 복수의 소스 데이터 각각은, 상기 초음파 이미지에 대응하는 원본 이미지 및 타겟 도메인 이미지를 더 포함하며,상기 원본 이미지는, 상기 타겟 이미지와 동일한 도메인에 대응하는 이미지이며,상기 타겟 도메인 이미지는, 상기 타겟 이미지와 동일한 도메인에 관련한 이미지들 중 상기 초음파 이미지와 페어를 형성하지 않는 이미지인 것을 특징으로 하는,이미지 변환 모델 제공 방법."}
{"patent_id": "10-2022-0166791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 타겟 도메인 이미지는,상기 타겟 이미지와 동일한 도메인에 관련한 이미지들 중 상기 초음파 이미지와 페어를 형성하는 원본 이미지와유사도가 가장 높은 이미지를 통해 선별되는 것을 특징으로 하는,이미지 변환 모델 제공 방법."}
{"patent_id": "10-2022-0166791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 하나 이상의 네트워크 함수는,상기 초음파 이미지에 대응하는 잠재 변수를 출력하는 차원 감소 네트워크 함수;상기 잠재 변수를 입력으로 하는 경우, 상기 잠재 변수에 대응하는 타겟 이미지를 출력하도록 사전 학습된 생성자 모델; 및공개특허 10-2024-0069548-4-상기 초음파 이미지, 상기 타겟 이미지 및 상기 타겟 도메인 이미지 각각을 입력으로 하여 각 이미지에 대응하는 피처를 출력하는 피처 추출 모델;을 포함하며,상기 각 이미지에 대응하는 피처는,상기 초음파 이미지에 대응하는 제1피처;상기 타겟 이미지에 대응하는 제2피처; 및상기 타겟 도메인 이미지에 관련한 제3피처;를 포함하는,이미지 변환 모델 제공 방법."}
{"patent_id": "10-2022-0166791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 학습은,상기 제1피처와 상기 제2피처 간의 거리가 최소가 되며, 상기 제1피처와 상기 제3피처 간의 거리가 최대가 되도록 상기 차원 감소 네트워크 함수 및 상기 피처 추출 모델에 대한 대조 학습을 수행하는 것을 특징으로 하는,이미지 변환 모델 제공 방법."}
{"patent_id": "10-2022-0166791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "하나 이상의 인스트럭션을 저장하는 메모리; 및상기 메모리에 저장된 상기 하나 이상의 인스트럭션을 실행하는 프로세서를 포함하고,상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써,제1항의 방법을 수행하는, 컴퓨팅 장치."}
{"patent_id": "10-2022-0166791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어인 컴퓨터와 결합되어, 제1항의 방법을 수행할 수 있도록 컴퓨터에서 독출가능한 기록매체에 저장된 컴퓨터프로그램."}
{"patent_id": "10-2022-0166791", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전술한 바와 같은 과제를 실현하기 위한 본 발명의 다양한 실시예에 따른 이미지 변환 모델 제공 방법이 개시된 다. 상기 방법은, 복수의 소스 데이터를 획득하는 단계, 복수의 소스 데이터에 기초하여 학습 데이터 세트를 구 축하는 단계 및 상기 학습 데이터 세트를 통해 하나 이상의 네트워크 함수에 대한 학습을 수행하여 이미지 변환 모델을 생성하는 단계를 포함하며, 상기 복수의 소스 데이터 각각은, 초음파 이미지를 포함하고, 상기 이미지 변 환 모델은, 상기 초음파 이미지를 입력으로 하여 상기 초음파 이미지와 상이한 도메인에 관련한 타겟 이미지를 출력하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2022-0166791", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 이미지 변환 모델에 관한 것으로, 보다 구체적으로, 특정 도메인의 이미지를 입력으 로 하여 다른 도메인에 관련한 예측 이미지를 출력하는 이미지 변환 모델을 제공하기 위한 방법, 서버 및 컴퓨 터 프로그램에 관한 것이다."}
{"patent_id": "10-2022-0166791", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 4차 산업혁명의 패러다임 변화 속에서 새로운 시대를 이끄는 핵심 동인으로 인공지능이 세간의 주목을 받 고 있다. 인공지능은 인지, 학습, 추론, 판단 등 인간사고 과정의 전반을 알고리즘 설계로 구현하는SW기술로서, 특정 산업에 한정하지 않고 전 산업 영역에 걸쳐 생산성을 획기적으로 개선하는 범용기술의 특징을 가진다. 한편, 딥러닝의 제안 이후, 인공지능 기술 기반의 영상 생성 기술은 크게 발전하고 있다. 특히 생성적 적대 신 경망(GAN)의 제안은 데이터의 일반적인 구조적 특성뿐만 아니라 세부적인 정보를 재현할 수 있는 학습 방법을 제공함으로써, 흡사 인간에 의해 창작된 듯한 데이터의 생성을 가능하게 하였다. 생성적 적대 신경망은 생성자 와 분류자 사이의 내쉬 균형을 찾는 것을 목표로 하여, 데이터의 분포 추정에 있어 기존 모델들의 성능을 크게 향상시켰다. 이러한 인공지능을 활용한 영상 생성 기술은 사용자의 의도에 부합하는 영상을 생성하는 데 목표를 두고 있다. 다만, 사용자 별로 영상을 표현하고자 하는 영상 표현 방식이나 또는, 특정 영상(예컨대, 참조 영상)을 기반으 로 출력하고자 하는 타겟 영상(즉, 목표 영상)이 각각 상이함에 따라, 각 사용자의 의도에 부합하는 목표 영상 이나, 기반이 되는 학습 영상 등을 활용한 인공신경망의 학습이 용이하지 않을 수 있다. 즉, 임의의 의도에 대 해 적합한 이미지 또는 영상을 생성하여 제공하는 데는 한계가 있다. 구체적인 예를 들어, 태아의 초음파 영상에 관한 정보에 기반하여 태아의 미래 얼굴에 관련한 이미지 또는 영상 을 생성하고자 하는 경우, 영상 생성에 기반이 되는 초음파 영상의 일정하지 않은 촬영 각도와 노이즈 등에 따 라 목표 영상인 미래 얼굴에 관련한 영상의 생성이 어려울 수 있다. 즉, 참조 영상으로 활용되는 초음파 영상의 경우, 태아의 형태적인 정보만을 포함하고 있어, 태아의 자연스러운 얼굴형상을 인지하는데 어려움이 있으며, 초음파 영상의 왜곡으로 인해 실제와 다른 예측 얼굴 형상이 출력되도록 신경망이 학습될 우려가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 10-2021-0047920호(2021.04.30)"}
{"patent_id": "10-2022-0166791", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 전술한 배경기술에 대응하여 안출된 것으로, 특정 도메인의 이미지를 입력으 로 하여 다른 도메인에 관련한 예측 이미지를 출력하는 이미지 변환 모델을 제공하기 위함이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0166791", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 실시예에 따른 이미지 변환 모델 제공 방법이 개시된다. 상기 방법 은, 복수의 소스 데이터를 획득하는 단계, 복수의 소스 데이터에 기초하여 학습 데이터 세트를 구축하는 단계 및 상기 학습 데이터 세트를 통해 하나 이상의 네트워크 함수에 대한 학습을 수행하여 이미지 변환 모델을 생성 하는 단계를 포함하며, 상기 복수의 소스 데이터 각각은, 초음파 이미지를 포함하고, 상기 이미지 변환 모델은, 상기 초음파 이미지를 입력으로 하여 상기 초음파 이미지와 상이한 도메인에 관련한 타겟 이미지를 출력하는 것 을 특징으로 할 수 있다. 대안적인 실시예에서, 상기 복수의 소스 데이터 각각은, 상기 초음파 이미지에 대응하는 원본 이미지를 더 포함 하며, 상기 원본 이미지는, 상기 타겟 이미지와 동일한 도메인에 대응하는 이미지이며, 서로 대응하는 상기 초 음파 이미지와 원본 이미지는, 하나의 페어 이미지를 구성하는 것을 특징으로 할 수 있다. 대안적인 실시예에서, 상기 하나 이상의 네트워크 함수는, 상기 초음파 이미지에 대응하는 잠재 변수를 출력하 는 차원 감소 네트워크 함수 및 상기 잠재 변수를 입력으로 하는 경우, 상기 잠재 변수에 대응하는 타겟 이미지 를 출력하도록 사전 학습된 생성자 모델을 포함하며, 상기 학습은, 상기 생성자 모델을 통해 출력된 타겟 이미 지와 상기 원본 이미지 간의 오차에 기초하여 상기 차원 감소 네트워크 함수의 가중치를 조정하는 것을 특징으로 할 수 있다. 대안적인 실시예에서, 상기 하나 이상의 네트워크 함수는, 상기 초음파 이미지에 대응하는 잠재 변수를 출력하 는 차원 감소 네트워크 함수, 상기 잠재 변수를 입력으로 하는 경우, 상기 잠재 변수에 대응하는 타겟 이미지를 출력하도록 사전 학습된 생성자 모델 및 상기 생성자 모델을 통해 출력된 타겟 이미지와 상기 차원 감소 네트워 크 함수의 입력에 관련한 초음파 이미지가 상기 페어 이미지인지 여부를 판별하는 분류자 모델을 더 포함하며, 상기 학습은, 상기 분류자 모델이 상기 초음파 이미지와 상기 생성자 모델을 통해 출력된 타겟 이미지를 상기 페어 이미지로 판별할 확률이 높도록 상기 차원 감소 네트워크 함수 및 분류자 모델 각각의 가중치를 조정하는 것을 특징으로 할 수 있다. 대안적인 실시예에서, 상기 복수의 소스 데이터 각각은, 상기 초음파 이미지에 대응하는 원본 이미지 및 타겟 도메인 이미지를 더 포함하며, 상기 원본 이미지는, 상기 타겟 이미지와 동일한 도메인에 대응하는 이미지이며, 상기 타겟 도메인 이미지는, 상기 타겟 이미지와 동일한 도메인에 관련한 이미지들 중 상기 초음파 이미지와 페 어를 형성하지 않는 이미지인 것을 특징으로 할 수 있다. 대안적인 실시예에서, 상기 타겟 이미지와 동일한 도메인에 관련한 이미지들 중 상기 초음파 이미지와 페어를 형성하는 원본 이미지와 유사도가 가장 높은 이미지를 통해 선별되는 것을 특징으로 할 수 있다. 대안적인 실시예에서, 상기 하나 이상의 네트워크 함수는, 상기 초음파 이미지에 대응하는 잠재 변수를 출력하 는 차원 감소 네트워크 함수, 상기 잠재 변수를 입력으로 하는 경우, 상기 잠재 변수에 대응하는 타겟 이미지를 출력하도록 사전 학습된 생성자 모델 및 상기 초음파 이미지, 상기 타겟 이미지 및 상기 타겟 도메인 이미지 각 각을 입력으로 하여 각 이미지에 대응하는 피처를 출력하는 피처 추출 모델을 포함하며, 상기 각 이미지에 대응 하는 피처는, 상기 초음파 이미지에 대응하는 제1피처, 상기 타겟 이미지에 대응하는 제2피처 및 상기 타겟 도 메인 이미지에 관련한 제3피처를 포함할 수 있다. 대안적인 실시예에서, 상기 학습은, 상기 제1피처와 상기 제2피처 간의 거리가 최소가 되며, 상기 제1피처와 상 기 제3피처 간의 거리가 최대가 되도록 상기 차원 감소 네트워크 함수 및 상기 피처 추출 모델에 대한 대조 학 습을 수행하는 것을 특징으로 할 수 있다. 본 발명의 다른 실시예에 따르면, 이미지 변환 모델 제공 방법을 수행하기 위한 컴퓨팅 장치가 개시된다. 상기 컴퓨팅 장치는 하나 이상의 인스트럭션을 저장하는 메모리 및 상기 메모리에 저장된 하나 이상의 인스트럭션을 실행하는 프로세서를 포함하고, 상기 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 전술한 이미지 변환 모델 제공 방법을 수행할 수 있다. 본 발명의 또 다른 실시예에 따르면, 컴퓨터에서 독출가능한 기록매체에 저장된 컴퓨터 프로그램이 개시된다. 상기 컴퓨터 프로그램은 하드웨어인 컴퓨터와 결합되어, 이미지 변환 모델 제공 방법을 수행할 수 있다. 본 발명의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2022-0166791", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 특정 도메인의 이미지를 입력으로 하여 다른 도메인에 관련한 예측 이미지 를 출력하는 이미지 변환 모델을 제공할 수 있다."}
{"patent_id": "10-2022-0166791", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0166791", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다양한 실시예들이 이제 도면을 참조하여 설명된다. 본 명세서에서, 다양한 설명들이 본 발명의 이해를 제공하 기 위해서 제시된다. 그러나, 이러한 실시예들은 이러한 구체적인 설명 없이도 실행될 수 있음이 명백하다. 본 명세서에서 사용되는 용어 \"컴포넌트\", \"모듈\", \"시스템\" 등은 컴퓨터-관련 엔티티, 하드웨어, 펌웨어, 소프 트웨어, 소프트웨어 및 하드웨어의 조합, 또는 소프트웨어의 실행을 지칭한다. 예를 들어, 컴포넌트는 프로세서 상에서 실행되는 처리과정(procedure), 프로세서, 객체, 실행 스레드, 프로그램, 및/또는 컴퓨터일 수 있지만, 이들로 제한되는 것은 아니다. 예를 들어, 컴퓨팅 장치에서 실행되는 애플리케이션 및 컴퓨팅 장치 모두 컴포넌 트일 수 있다. 하나 이상의 컴포넌트는 프로세서 및/또는 실행 스레드 내에 상주할 수 있다. 일 컴포넌트는 하 나의 컴퓨터 내에 로컬화 될 수 있다. 일 컴포넌트는 2개 이상의 컴퓨터들 사이에 분배될 수 있다. 또한, 이러 한 컴포넌트들은 그 내부에 저장된 다양한 데이터 구조들을 갖는 다양한 컴퓨터 판독가능한 매체로부터 실행할 수 있다. 컴포넌트들은 예를 들어 하나 이상의 데이터 패킷들을 갖는 신호(예를 들면, 로컬 시스템, 분산 시스 템에서 다른 컴포넌트와 상호작용하는 하나의 컴포넌트로부터의 데이터 및/또는 신호를 통해 다른 시스템과 인 터넷과 같은 네트워크를 통해 전송되는 데이터)에 따라 로컬 및/또는 원격 처리들을 통해 통신할 수 있다. 더불어, 용어 \"또는\"은 배타적 \"또는\"이 아니라 내포적 \"또는\"을 의미하는 것으로 의도된다. 즉, 달리 특정되지 않거나 문맥상 명확하지 않은 경우에, \"X는 A 또는 B를 이용한다\"는 자연적인 내포적 치환 중 하나를 의미하는 것으로 의도된다. 즉, X가 A를 이용하거나; X가 B를 이용하거나; 또는 X가 A 및 B 모두를 이용하는 경우, \"X는 A 또는 B를 이용한다\"가 이들 경우들 어느 것으로도 적용될 수 있다. 또한, 본 명세서에 사용된 \"및/또는\"이라 는 용어는 열거된 관련 아이템들 중 하나 이상의 아이템의 가능한 모든 조합을 지칭하고 포함하는 것으로 이해 되어야 한다. 또한, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 해당 특징 및/또는 구성요소가 존재함을 의미하는 것으로 이해되어야 한다. 다만, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 하나 이상의 다른 특징, 구성요소 및/또 는 이들의 그룹의 존재 또는 추가를 배제하지 않는 것으로 이해되어야 한다. 또한, 달리 특정되지 않거나 단수 형태를 지시하는 것으로 문맥상 명확하지 않은 경우에, 본 명세서와 청구범위에서 단수는 일반적으로 \"하나 또 는 그 이상\"을 의미하는 것으로 해석되어야 한다. 당업자들은 추가적으로 여기서 개시된 실시예들과 관련되어 설명된 다양한 예시적 논리적 블록들, 구성들, 모듈 들, 회로들, 수단들, 로직들, 및 알고리즘 단계들이 전자 하드웨어, 컴퓨터 소프트웨어, 또는 양쪽 모두의 조합 들로 구현될 수 있음을 인식해야 한다. 하드웨어 및 소프트웨어의 상호교환성을 명백하게 예시하기 위해, 다양 한 예시적 컴포넌트들, 블록들, 구성들, 수단들, 로직들, 모듈들, 회로들, 및 단계들은 그들의 기능성 측면에서 일반적으로 위에서 설명되었다. 그러한 기능성이 하드웨어로 또는 소프트웨어로서 구현되는지 여부는 전반적인 시스템에 부과된 특정 어플리케이션(application) 및 설계 제한들에 달려 있다. 숙련된 기술자들은 각각의 특정 어플리케이션들을 위해 다양한 방법들로 설명된 기능성을 구현할 수 있다. 다만, 그러한 구현의 결정들이 본 발 명내용의 영역을 벗어나게 하는 것으로 해석되어서는 안된다. 제시된 실시예들에 대한 설명은 본 발명의 기술 분야에서 통상의 지식을 가진 자가 본 발명을 이용하거나 또는 실시할 수 있도록 제공된다. 이러한 실시예들에 대한 다양한 변형들은 본 발명의 기술 분야에서 통상의 지식을 가진 자에게 명백할 것이다. 여기에 정의된 일반적인 원리들은 본 발명의 범위를 벗어남이 없이 다른 실시예들 에 적용될 수 있다. 그리하여, 본 발명은 여기에 제시된 실시예들로 한정되는 것이 아니다. 본 발명은 여기에 제시된 원리들 및 신규한 특징들과 일관되는 최광의의 범위에서 해석되어야 할 것이다. 본 명세서에서, 컴퓨터는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로서 이해될 수 있다. 예 를 들어, 컴퓨터는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애 플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 본 명세서에서 설명되는 각 단계들은 컴퓨터에 의하여 수행되는 것으로 설명되나, 각 단계의 주체는 이에 제한 되는 것은 아니며, 실시 예에 따라 각 단계들의 적어도 일부가 서로 다른 장치에서 수행될 수도 있다. 도 1은 본 발명의 일 실시예와 관련된 이미지 변환 모델 제공 방법을 구현하기 위한 시스템을 개략적으로 도시 한 예시도이다. 도 1에 도시된 바와 같이, 본 발명의 실시예들에 따른 시스템은, 서버, 사용자 단말, 외부 서버 및 네트워크를 포함할 수 있다. 도 1에서 도시되는 컴포넌트들은 예시적인 것으로서, 추가적인 컴포넌트들 이 존재하거나 또는 도 1에서 도시되는 컴포넌트들 중 일부는 생략될 수 있다. 본 발명의 실시예들에 따른 서버 , 외부 서버 및 사용자 단말은 네트워크를 통해, 본 발명의 일 실시예들에 따른 시스템을 위한 데이터를 상호 송수신할 수 있다. 본 발명의 실시예들에 따른 네트워크는 공중전화 교환망(PSTN: Public Switched Telephone Network), xDSL(x Digital Subscriber Line), RADSL(Rate Adaptive DSL), MDSL(Multi Rate DSL), VDSL(Very High Speed DSL), UADSL(Universal Asymmetric DSL), HDSL(High Bit Rate DSL) 및 근거리 통신망(LAN) 등과 같은 다양한 유선 통신 시스템들을 사용할 수 있다. 또한, 여기서 제시되는 네트워크는 CDMA(Code Division Multi Access), TDMA(Time Division Multi Access), FDMA(Frequency Division Multi Access), OFDMA(Orthogonal Frequency Division Multi Access), SC- FDMA(Single Carrier-FDMA) 및 다른 시스템들과 같은 다양한 무선 통신 시스템들을 사용할 수 있다. 본 발명의 실시예들에 따른 네트워크는 유선 및 무선 등과 같은 그 통신 양태를 가리지 않고 구성될 수 있 으며, 단거리 통신망(PAN: Personal Area Network), 근거리 통신망(WAN: Wide Area Network) 등 다양한 통신망 으로 구성될 수 있다. 또한, 네트워크는 공지의 월드와이드웹(WWW: World Wide Web)일 수 있으며, 적외선 (IrDA: Infrared Data Association) 또는 블루투스(Bluetooth)와 같이 단거리 통신에 이용되는 무선 전송 기술 을 이용할 수도 있다. 본 명세서에서 설명된 기술들은 위에서 언급된 네트워크들뿐만 아니라, 다른 네트워크들 에서도 사용될 수 있다. 본 발명의 실시예에 따르면, 이미지 변환 모델 제공 방법을 수행하는 서버(이하 '서버')는 복수의 학 습 데이터를 활용하여 하나 이상의 네트워크 함수에 대한 학습을 수행하여 이미지 변환 모델을 생성할 수 있다. 이미지 변환 모델은, 특정 도메인에 관련한 이미지를 입력으로 하여 특정 도메인과 상이한 도메인에 관련한 이 미지를 출력하도록 학습된 신경망일 수 있다. 구체적인 실시예에서, 이미지 변환 모델은, 태아의 초음파 이미지 를 입력으로 하는 경우, 태아의 미래 얼굴에 관련한 실사 예측 이미지를 출력할 수 있다. 즉, 이미지 변환 모델 은, 태아의 초음파 이미지를 기반으로, 미래에 태어날 태아의 실제 얼굴 이미지를 예측하는 신경망 모델일 수 있다. 실시예에서, 서버는 이미지 변환 모델을 생성하기 위하여, 복수의 소스 데이터 및 복수의 소스 데이터 각 각에 대응하는 복수의 타겟 데이터를 획득할 수 있다. 여기서 복수의 소스 데이터는, 태아의 초음파 이미지들을 포함할 수 있으며, 복수의 타겟 데이터는 각 초음파 이미지에 대응하는 실사 이미지를 포함할 수 있다. 예컨대, 실사 이미지는, 태아의 피부색, 피부질감, 눈, 코, 입 각각의 크기 등을 복원하여 실사화한 이미지를 의미할 수 있다. 구체적인 실시예에서, 서버는 복수의 소스 데이터 및 복수의 타겟 데이터를 매칭하여 학습 데이터 세트를 구축할 수 있으며, 구축된 학습 데이터 세트를 활용하여 하나 이상의 네트워크 함수에 대한 학습을 수행하여 이 미지 변환 모델을 생성할 수 있다. 일 실시예에서, 하나 이상의 네트워크 함수는, 생성자 모델 및 분류자 모델 을 포함할 수 있으며, 생성자 모델과 분류자 모델 간의 적대 학습을 통해 학습되는 것을 특징으로 할 수 있다. 여기서, 적대적 학습이란, 모델의 학습 과정에서 생성자 모델 및 분류자 모델이 서로 경쟁하며 데이터를 생성하 도록 하는 학습 방식일 수 있다. 생성자 모델은 실제와 유사한 데이터를 생성하도록 학습되며, 분류자 모델은 실제 데이터와 생성자가 생성한 가짜 데이터를 구별하도록 학습될 수 있다. 이러한 생성자 모델과 분류자 모델의 지속적인 경쟁을 통한 학습 과정이 반복됨에 따라 보다 정교한 예측 이미지를 생성해낼 수 있게 된다. 서버 가 수행하는 이미지 변환 모델 제공 방법에 관련한 구체적인 설명은 도 3을 참조하여 자세히 후술하도록 한다. 실시예에서, 도 1에서의 1개의 서버만을 도시하고 있으나, 이보다 많은 서버들 또한 본 발명의 범위에 포 함될 수 있다는 점 그리고 서버가 추가적인 컴포넌트들을 포함할 수 있다는 점은 당해 출원분야에 있어서 통상의 지식을 가진 자에게 명백할 것이다. 즉, 서버는 복수 개의 컴퓨팅 장치로 구성될 수도 있다. 다시 말해, 복수의 노드의 집합이 서버를 구성할 수 있다. 본 발명의 일 실시예에 따르면, 서버는 클라우드 컴퓨팅 서비스를 제공하는 서버일 수 있다. 보다 구체적 으로, 서버는 인터넷 기반 컴퓨팅의 일종으로 정보를 사용자의 컴퓨터가 아닌 인터넷에 연결된 다른 컴퓨 터로 처리하는 클라우드 컴퓨팅 서비스를 제공하는 서버일 수 있다. 상기 클라우드 컴퓨팅 서비스는 인터넷 상 에 자료를 저장해 두고, 사용자가 필요한 자료나 프로그램을 자신의 컴퓨터에 설치하지 않고도 인터넷 접속을 통해 언제 어디서나 이용할 수 있는 서비스일 수 있으며, 인터넷 상에 저장된 자료들을 간단한 조작 및 클릭으 로 쉽게 공유하고 전달할 수 있다. 또한, 클라우드 컴퓨팅 서비스는 인터넷 상의 서버에 단순히 자료를 저장하 는 것뿐만 아니라, 별도로 프로그램을 설치하지 않아도 웹에서 제공하는 응용프로그램의 기능을 이용하여 원하 는 작업을 수행할 수 있으며, 여러 사람이 동시에 문서를 공유하면서 작업을 진행할 수 있는 서비스일 수 있다. 또한, 클라우드 컴퓨팅 서비스는 IaaS(Infrastructure as a Service), PaaS(Platform as a Service), SaaS(Software as a Service), 가상 머신 기반 클라우드 서버 및 컨테이너 기반 클라우드 서버 중 적어도 하나 의 형태로 구현될 수 있다. 즉, 본 발명의 서버는 상술한 클라우드 컴퓨팅 서비스 중 적어도 하나의 형태 로 구현될 수 있다. 전술한 클라우드 컴퓨팅 서비스의 구체적인 기재는 예시일 뿐, 본 발명의 클라우드 컴퓨팅 환경을 구축하는 임의의 플랫폼을 포함할 수도 있다. 본 발명의 실시예에 따르면, 사용자 단말은 서버에 액세스하여 소스 데이터를 기반으로 타겟 데이터에 관련한 이미지를 획득하고자 하는 사용자와 관련된 단말일 수 있다. 소스 데이터와 타겟 데이터는 서로 상이한 도메인에 관련한 이미지일 수 있다. 예를 들어, 소스 데이터는 태아의 초음파 영상에 관련한 이미지를 포함할 수 있으며, 타겟 데이터는 태아의 미래 얼굴을 예측한 실사 이미지를 포함할 수 있다. 예컨대, 실사 이미지는, 태아의 피부색, 피부질감, 눈, 코, 입 각각의 크기 등을 복원하여 실사화한 이미지를 의미할 수 있다. 다양한 실시예에서, 소스 데이터는, 사용자의 실제 촬영 이미지를 포함할 수 있으며, 타겟 데이터에 포함된 목표 예측 이미지는 사용자의 실제 촬영 이미지를 일러스트화한 일러스트 이미지에 관련할 수 있다. 전술한 소스 데이터 및 타겟 데이터에 포함된 이미지들에 대한 구체적인 기재는 예시일 뿐, 본 발명은 이에 제한되지 않는다. 사용자 단말은 사용자 단말에서 촬영하거나 또는 사용자 단말에 기 저장된 소스 데이터를 서버 로 전송할 수 있으며, 서버로부터 소스 데이터에 대응하는 타겟 데이터를 제공받을 수 있다. 이러한 사용자 단말은 소스 데이터에 포함된 초음파 이미지를 기반으로 태아의 미래에 관련한 실사 이미지 를 제공하는 검사자(예컨대, 전문의)와 관련한 단말일 수 있다. 사용자 단말이 태아의 실사 이미지를 제공 하는 검사자에 관련한 단말인 경우, 서버로부터 수신하는 실사 이미지는, 태아의 건강 상태 판독을 위한 의료 보조 정보로 활용될 수 있다. 사용자 단말은 디스플레이를 구비하고 있어서, 사용자의 입력을 수신하 고, 사용자에게 임의의 형태의 출력을 제공할 수 있다. 사용자 단말의 사용자는 의료 전문가로서, 의사, 간호사, 임상 병리사, 의료 영상 전문가 등을 의미할 수 있으며, 의료 장치를 수리하는 기술자가 될 수 있으나, 이에 제한되지 않는다. 또한 예를 들어, 사용자는 개시 된 실시 예에 따른 시스템을 이용하여 태아의 미래 실사 이미지에 관련한 예측 이미지를 획득하고자 하는 산모 본인일 수도 있다. 사용자 단말은 서버와 통신을 위한 메커니즘을 갖는 시스템에서의 임의의 형태의 엔티티(들)를 의미할 수 있다. 예를 들어, 이러한 사용자 단말은 PC(personal computer), 노트북(note book), 모바일 단말기 (mobile terminal), 스마트 폰(smart phone), 태블릿 PC(tablet pc) 및 웨어러블 디바이스(wearable device) 등을 포함할 수 있으며, 유/무선 네트워크에 접속할 수 있는 모든 종류의 단말을 포함할 수 있다. 또한, 사용자 단말은 에이전트, API(Application Programming Interface) 및 플러그-인(Plug-in) 중 적어도 하나에 의해 구현되는 임의의 서버를 포함할 수도 있다. 또한, 사용자 단말은 애플리케이션 소스 및/또는 클라이언트 애 플리케이션을 포함할 수 있다. 일 실시예에서, 외부 서버는 태아의 초음파 이미지를 포함하는 소스 데이터 및 각 초음파 이미지에 관련한 실제 이미지 등을 저장하는 서버일 수 있다. 예를 들어, 외부 서버는 병원 서버 및 정부 서버 중 적어도 하나일 수 있으며, 복수의 태아 초음파 이미지에 관련한 소스 데이터들, 각 소스 데이터들에 관련한 실제 이미 지 등을 포함하는 타겟 데이터에 관한 정보를 저장하는 서버일 수 있다. 외부 서버에 저장된 정보들은 본 발명에서의 신경망을 학습시키기 위한 학습 데이터, 검증 데이터 및 테스트 데이터로 활용될 수 있다. 즉, 외부 서버는 본 발명의 신경망 모델을 학습시키기 위한 데이터 세트에 관한 정보를 저장하고 있는 서버일 수 있 다. 본 발명의 서버는 외부 서버로부터 복수의 소스 데이터 및 각 소스 데이터에 대응하는 실제 이미지들 에 기반하여 학습 데이터 세트를 구축할 수 있으며, 학습 데이터 세트를 통해 하나 이상의 네트워크 함수를 포 함하는 신경망 모델을 학습시킴으로써, 본 발명의 이미지 변환 모델을 생성할 수 있다. 외부 서버는 디지털 기기로서, 랩탑 컴퓨터, 노트북 컴퓨터, 데스크톱 컴퓨터, 웹 패드, 이동 전화기와 같 이 프로세서를 탑재하고 메모리를 구비한 연산 능력을 갖춘 디지털 기기일 수 있다. 외부 서버는 서비스를 처리하는 웹 서버일 수 있다. 전술한 서버의 종류는 예시일 뿐이며 본 발명은 이에 제한되지 않는다. 도 2는 본 발명의 일 실시예와 관련된 이미지 변환 모델 제공 방법을 수행하는 서버의 하드웨어 구성도이다. 도 2를 참조하면, 본 발명의 일 실시예와 관련된 이미지 변환 모델 제공 방법을 수행하는 서버는 하나 이 상의 프로세서, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(Load)하는 메모리, 버스, 통신 인터페이스 및 컴퓨터 프로그램을 저장하는 스토리지를 포함할 수 있다. 여기"}
{"patent_id": "10-2022-0166791", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "서, 도 2에는 본 발명의 실시예와 관련 있는 구성요소들만 도시되어 있다. 따라서, 본 발명이 속한 기술분야의 통상의 기술자라면 도 2에 도시된 구성요소들 외에 다른 범용적인 구성 요소들이 더 포함될 수 있음을 알 수 있 다. 본 발명의 일 실시예에 따르면, 프로세서는 통상적으로 서버의 전반적인 동작을 처리할 수 있다. 프 로세서는 위에서 살펴본 구성요소들을 통해 입력 또는 출력되는 신호, 데이터, 정보 등을 처리하거나 메모 리에 저장된 응용 프로그램을 구동함으로써, 사용자 또는 사용자 단말에게 적정한 정보 또는, 기능을 제공 하거나 처리할 수 있다. 또한, 프로세서는 본 발명의 실시예들에 따른 방법을 실행하기 위한 적어도 하나의 애플리케이션 또는 프 로그램에 대한 연산을 수행할 수 있으며, 서버는 하나 이상의 프로세서를 구비할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 하나 이상의 코어로 구성될 수 있으며, 컴퓨팅 장치의 중앙 처 리 장치(CPU: central processing unit), 범용 그래픽 처리 장치(GPGPU: general purpose graphics processing unit), 텐서 처리 장치(TPU: tensor processing unit) 등의 데이터 분석, 딥러닝을 위한 프로세서를 포함할 수 있다. 프로세서는 메모리에 저장된 컴퓨터 프로그램을 판독하여 본 발명의 일 실시예에 따른 이미지 변환 모델 제공 방법을 수행할 수 있다. 다양한 실시예에서, 프로세서는 프로세서 내부에서 처리되는 신호(또는, 데이터)를 일시적 및/또는 영구적으로 저장하는 램(RAM: Random Access Memory, 미도시) 및 롬(ROM: Read-Only Memory, 미도시)을 더 포 함할 수 있다. 또한, 프로세서는 그래픽 처리부, 램 및 롬 중 적어도 하나를 포함하는 시스템온칩(SoC: system on chip) 형태로 구현될 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 발명의 다양한 실시예에 따른 방 법/동작을 실행하기 위하여 스토리지로부터 컴퓨터 프로그램을 로드할 수 있다. 메모리에 컴퓨 터 프로그램이 로드되면, 프로세서는 컴퓨터 프로그램을 구성하는 하나 이상의 인스트럭션들을 실행함으로써 상기 방법/동작을 수행할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있을 것 이나, 본 발명의 기술적 범위가 이에 한정되는 것은 아니다. 버스는 서버의 구성 요소 간 통신 기능을 제공한다. 버스는 주소 버스(address Bus), 데이터 버 스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스는 서버의 유무선 인터넷 통신을 지원한다. 또한, 통신 인터페이스는 인터넷 통 신 외의 다양한 통신 방식을 지원할 수도 있다. 이를 위해, 통신 인터페이스는 본 발명의 기술 분야에 잘알려진 통신 모듈을 포함하여 구성될 수 있다. 몇몇 실시예에서, 통신 인터페이스는 생략될 수도 있다. 스토리지는 컴퓨터 프로그램을 비 임시적으로 저장할 수 있다. 서버를 통해 이미지 변환 모델 제공하기 위한 프로세서를 수행하는 경우, 스토리지는 이미지 변환 모델 제공하기 위한 프로세스를 제공하 기 위하여 필요한 각종 정보를 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 발명의 다양한 실시예에 따른 방 법/동작을 수행하도록 하는 하나 이상의 인스트럭션들을 포함할 수 있다. 즉, 프로세서는 상기 하나 이상 의 인스트럭션들을 실행함으로써, 본 발명의 다양한 실시예에 따른 상기 방법/동작을 수행할 수 있다. 일 실시예에서, 컴퓨터 프로그램은 복수의 소스 데이터를 획득하는 단계, 복수의 소스 데이터에 기초하여 학습 데이터 세트를 구축하는 단계 및 학습 데이터 세트에 기초하여 하나 이상의 네트워크 함수에 대한 학습을 수행하여 이미지 변환 모델을 생성하는 단계를 포함하는 이미지 변환 모델 제공 방법을 수행하도록 하는 하나 이상의 인스트럭션을 포함할 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다. 본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조 합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 이하, 도 3 내지 도 9를 참조하여, 서버에 의해 수행되는 이미지 변환 모델 제공 방법에 대하여 구체적으로 후술하도록 한다. 도 3은 본 발명의 일 실시예와 관련된 이미지 변환 모델 제공 방법을 예시적으로 나타낸 순서도를 도시한다. 도 3에 도시된 단계들은 필요에 의해 순서가 변경될 수 있으며, 적어도 하나 이상의 단계가 생략 또는 추가될 수 있다. 즉, 이하의 단계들은 본 발명의 일 실시예에 불과할 뿐, 본 발명의 권리 범위는 이에 제한되지 않는다. 본 발명의 일 실시예에 따르면, 이미지 변환 모델 제공 방법은, 복수의 소스 데이터를 획득하는 단계(S110)를 포함할 수 있다. 본 발명의 복수의 소스 데이터는, 신경망의 학습에 활용되는 복수의 학습 데이터들로 활용될 수 있다. 실시예에서, 복수의 소스 데이터 각각은, 태아 초음파에 관련한 초음파 이미지를 포함할 수 있다. 본 발명의 일 실시예에 따른, 복수의 소스 데이터의 획득은, 메모리에 저장된 복수의 소스 데이터를 수신하거나, 또는 로딩(loading)하는 것일 수 있다. 또한, 복수의 소스 데이터의 획득은, 유/무선 통신 수단에 기초하여 다른 저 장 매체, 다른 컴퓨팅 장치, 동일한 컴퓨팅 장치 내의 별도 처리 모듈로부터 데이터를 수신하거나 또는 로딩하 는 것일 수 있다. 일 실시예에 따르면, 복수의 소스 데이터는, 복수의 페어(pair) 이미지를 포함하여 구성될 수 있다. 여기서 페 어 이미지란, 서로 연관된 두 개의 이미지를 의미할 수 있다. 구체적으로, 페어 이미지는, 서로 상이한 도메인 의 이미지들 중 서로 매칭된 이미지들을 의미할 수 있다. 예컨대, 서로 대응하는 초음파 이미지와 원본 이미지 가 하나의 페어 이미지를 구성할 수 있다. 구체적인 예를 들어, 제1사용자의 초음파 이미지와 제1사용자의 원본 이미지는 서로 페어 이미지일 수 있다. 동일 사용자에 대응하는 상이한 도메인 각각의 이미지들은 하나의 페어 이미지로 구성될 수 있다. 즉, 복수의 소스 데이터는, 초음파 이미지와 이에 대응하는 원본 이미지로 구성되는 페어 이미지들의 집합일 수 있다. 복수의 소스 데이터는 복수의 사용자들 각각에 대응하는 페어 이미지들을 포함하여 구성될 수 있다. 또한, 실시예에서, 복수의 소스 데이터는, 초음파 이미지에 대응하는 타겟 도메인 이미지를 더 포함할 수 있다. 타겟 도메인 이미지는, 타겟 이미지와 동일한 도메인에 관련한 이미지들 중 초음파 이미지와 페어를 형성하지 않는 이미지인 것을 특징으로 할 수 있다. 예컨대, 타겟 도메인 이미지는, 타겟 이미지와 동일한 도메인에 관련 한 원본 이미지들에 관련하되, 해당 원본 이미지들 타겟 이미지와 매칭되지 않는 이미지일 수 있다. 일 실시예에 따르면, 서버는 복수의 소스 데이터에 포함된, 초음파 이미지들, 원본 이미지들 및 타겟 도메 인 이미지들을 기반으로 학습 데이터 세트를 구축하고, 구축된 학습 데이터 세트를 활용한 학습을 수행하여 이 미지 변환 모델을 생성할 수 있다. 본 발명의 일 실시예에 따르면, 이미지 변환 모델 제공 방법은, 복수의 소스 데이터에 기초하여 학습 데이터 세 트를 구축하는 단계(S120)를 포함할 수 있다. 실시예에서, 복수의 소스 데이터는, 다양한 도메인 각각에 대응하는 복수의 이미지들을 포함할 수 있다. 예컨대, 복수의 소스 데이터는, 제1도메인에 관련한 복수의 제1이미지들 및 제2도메인에 관련한 복수의 제2이미 지들을 포함할 수 있다. 각 이미지에 대응하는 도메인은, 이미지의 특성에 관한 것일 수 있다. 예를 들어, 제1 도메인에 대응하는 이미지는 초음파 이미지를 의미할 수 있으며, 제2도메인에 대응하는 이미지는 실사 이미지를 의미할 수 있다. 복수의 소스 데이터는, 다양한 도메인에 대응하는 이미지들을 포함할 수 있다. 복수의 소스 데 이터는 초음파 이미지에 관련한 제1도메인에 대응하는 복수의 이미지 및 실사 이미지에 관련한 제2도메인에 대 응하는 복수의 이미지를 포함하여 구성될 있다. 전술한 각 도메인에 관련한 구체적인 기재는 예시일 뿐, 본 발 명은 이에 제한되지 않는다. 실시예에 따르면, 서버는 복수의 소스 데이터에 포함된 이미지 데이터들 중 페어를 형성하는 페어 이미지 를 기반으로 학습 데이터를 구축할 수 있다. 여기서 페어 이미지는, 상이한 도메인에 이미지들 중 서로 매칭된 이미지를 의미할 수 있다. 예컨대, 동일 사용자의 각 도메인에 대응하는 이미지들이 페어 이미지일 수 있다. 예 를 들어, 제1사용자의 초음파 이미지와 실사 이미지, 그리고 제2사용자의 초음파 이미지와 실사 이미지 각각이 페어 이미지일 수 있다. 서버는 페어 이미지들을 기반으로 학습 데이터 세트를 구축할 수 있다. 예컨대, 사용자 별 페어 이미지 각각을 하나의 학습 데이터로 하여 복수의 학습 데이터를 포함하는 학습 데이터 세트를 구축할 수 있다. 즉, 서버는 복수의 소스 데이터 중 페어 이미지 각각을 기반으로 복수의 학습 데이터를 생성할 수 있다. 실시예에서, 페어 이미지 중 하나의 도메인에 관련한 이미지(예컨대, 초음파 이미지)는 신경망 의 입력으로 처리되며, 다른 하나의 도메인에 관련한 이미지(예컨대, 실사 이미지 또는 원본 이미지)는 신경망 의 출력과 비교되는 정답 데이터로 활용될 수 있다. 다양한 실시예에서, 학습 데이터 세트에 포함된 복수의 학습 데이터 각각은, 타겟 도메인 이미지를 더 포함할 수 있다. 여기서, 타겟 도메인 이미지는, 초음파 이미지와 상이한 도메인에 포함된 이미지들 중 해당 초음파 이 미지와 페어를 형성하지 않는 이미지를 의미할 수 있다. 이 경우, 하나의 학습 데이터는, 초음파 이미지, 해당 초음파 이미지와 페어를 형성하는 원본 이미지 및 해당 초음파 이미지와 페어를 형성하지 않는 타겟 도메인 이 미지를 포함할 수 있다. 즉, 서버는 특정 초음파 이미지와 특정 초음파 이미지와 페어를 형성하는 원본 이 미지 그리고, 특정 초음파 이미지와 페어를 형성하지 않는 타겟 도메인 이미지를 기반으로 각각의 학습 데이터 를 구축할 수 있다. 본 발명의 일 실시예에 따르면, 이미지 변환 모델 제공 방법은, 학습 데이터 세트에 기초하여 하나 이상의 네트 워크 함수에 대한 학습을 수행하여 이미지 변환 모델을 생성하는 단계(S130)를 포함할 수 있다. 실시예에 따르면, 이미지 생성 모델은, 특정 입력과 유사한 입력을 출력하도록 학습된 신경망 모델일 수 있다. 구체적으로, 도 4를 참조하면, 일반적인 이미지 생성 모델(예컨대, GAN inversion)은, 생성자의 역함수 역할을 하는 인코더(encoder)를 학습하는 것이 목표일 수 있다. 구체적인 실시예에서, 이미지 생성 모델은 입력과 유사한 출력을 출력하도록 학습될 수 있다. 인코더는 입력 이미지가 입력되는 경우, 해당 입력 이미지 의 핵심 특징(예컨대, feature)(51a)을 추출할 수 있으며, 생성자 모델은 추출된 핵심 특징(51a)을 기 반으로 출력 이미지를 생성할 수 있다. 생성자 모델은 핵심 특징을 기반으로 이미지를 생성하도록 학습 된 신경망 모델일 수 있다. 이 경우, 출력 이미지와 학습 데이터로 주어진 입력 이미지의 차가 최소화 되도록 인코더가 학습될 수 있다. 이에 따라, 인코더는 입력되는 이미지의 핵심 특징을 보다 추출하게 되며, 이를 통해 생성자 모델은 입력 이미지와 유사한 출력 이미지를 생성할 수 있게 된다. 즉, 종 래의 이미지 생성 모델의 경우, 입력되는 이미지와 유사한 출력 이미지를 출력하는 것을 특징으로 할 수 있다.다양한 실시예에서, 인코더를 통해 입력에 관련한 이미지가 잠재 변수(latent variable)로 변환되는 경우, 해당 잠재 변수를 활용함으로써, 이미지 압축, 이미지 편집(semantic manipulation) 등이 가능할 수 있다. 전술한 종래의 이미지 생성 모델의 경우, 입력과 유사한 출력을 생성하도록 학습되어 있으므로, 특정 도메인에 대응하는 입력을 기반으로 특정 도메인과 상이한 도메인에 대응하는 출력을 생성하지 못한다. 즉, 특정 특징을 가진 이미지를 기반으로 다른 특징을 가진 이미지에 대한 예측을 수행할 수 없다. 본 발명은 상기와 같이 입력과 동일한 출력을 생성하도록 하는 것이 아닌, 새로운 학습 방식을 통해 하나 이상 의 네트워크 함수에 대한 학습을 수행하여 이미지 변환 모델을 생성하는 것을 특징으로 할 수 있다. 본 발명의 학습 과정을 통해 생성된(또는 학습이 완료된) 이미지 변환 모델은, 특정 도메인에 대응하는 이미지를 입력으로 하여, 다른 도메인에 대응하는 이미지를 출력하는 것을 특징으로 할 수 있다. 즉, 입력과 상이한 도메인으로의 이미지 예측이 가능할 수 있다. 구체적인 예를 들어, 본 발명의 이미지 변환 모델은 도 5에 도시된 바와 같이, 제1도메인에 대응하는 초음 파 이미지를 입력으로 하여 제2도메인에 대응하는 예측 이미지를 출력할 수 있다. 즉, 태아의 초음파 영상에서 획득되는 이미지를 기반으로 실제 태아가 태어났을 때의 얼굴에 대한 예측 이미지를 출력할 수 있게 된다. 즉, 본 발명의 이미지 변환 모델을 활용하는 경우, 초음파 이미지를 기반으로 실사화한 이미지에 관련한 예측 이미지가 획득될 수 있다. 이 경우, 예측 이미지는, 태아의 피부색, 피부질감, 눈, 코, 입 각각의 크기 등 을 복원하여 실사화한 이미지일 수 있다. 다시 말해, 이미지 변환 모델은, 초음파 이미지를 기반으로 미래 의 태아의 얼굴 이미지를 예측하여 제공할 수 있다. 이하에서는 다양한 학습 방식을 통해 하나 이상의 네트워크 함수에 대한 학습을 통해 이미지 변환 모델을 생성 하는 과정을 자세히 설명하도록 한다. 본 발명의 일 실시예에 따르면, 서버는 입력과 상이한 도메인의 출력을 출력하도록 이미지 변환 모델에 대 한 학습을 수행할 수 있다. 이 경우, 생성된 이미지 변환 모델은, 특정 도메인에 관련한 이미지를 입력으로 하 여, 특정 도메인과 상이한 도메인에 관련한 이미지를 생성할 수 있다. 예를 들어, 이미지 변환 모델은, 제1도메 인에 관련한 이미지를 입력으로 하여 제2도메인에 관련한 이미지를 출력할 수 있다. 구체적인 예를 들어, 이미 지 변환 모델은, 초음파 이미지를 입력으로 하는 경우, 실사 이미지에 관련한 출력을 생성할 수 있다. 도 6를 참조하여 보다 자세히 설명하면, 복수의 소스 데이터 각각은, 제1도메인에 해당하는 초음파 이미지 (411a) 및 해당 초음파 이미지(411a)에 대응하는 원본 이미지(412a)를 포함할 수 있다. 실시예에서, 원본 이미 지(412a)는 태아의 실제 실사 이미지를 의미할 수 있다. 실시예에서, 동일한 사용자의 초음파 이미지와 원본 이미지는 하나의 페어 이미지를 구성할 수 있다. 구체적인 예를 들어, 태아 시기에 획득된 제1사용자의 제1초음파 이미지와 출산 후 일정 기간이 지난 후 획득된 제1사용 자의 제1원본 이미지는 제1페어 이미지를 구성할 수 있다. 즉, 하나의 소스 데이터는, 초음파 이미지 및 해당 초음파 이미지에 대응하는 원본 이미지 즉, 서로 대응되는 이미지 쌍의 집합으로 구성될 수 있다. 서버는 각 사용자 별 페어 이미지를 기반으로 복수의 학습 데이터를 구축하고, 구축된 학습 데이터들을 활 용하여 하나 이상의 네트워크 함수에 대한 학습을 수행할 수 있다. 구체적인 실시예에서, 하나 이상의 네트워크 함수는 도 6에 도시된 바와 같이, 초음파 이미지(411a)에 대응하는 잠재 변수를 출력하는 차원 감소 네트워크 함수 및 잠재 변수를 입력으로 하는 경우, 잠재 변수(51 1)에 대응하는 타겟 이미지를 출력하는 생성자 모델을 포함할 수 있다. 초음파 이미지는 차원 감소 네트워 크 함수에 입력되어, 생성자 모델을 거쳐 타겟 이미지(420a)로 출력될 수 있다. 잠재 변수는 고 차원의 이미지를 저차원의 벡터로 사상시킨 변수를 의미할 수 있다. 차원 감소 네트워크 함수는, 인코더를 의미 하는 것으로, 입력되는 이미지를 바탕으로 그에 해당하는 잠재 변수를 추론할 수 있다. 이 경우, 하나 이상의 네트워크 함수에 대한 학습은, 생성자 모델을 통해 출력된 타겟 이미지(420a)와 원 본 이미지(412a) 간의 오차에 기초하여 차원 감소 네트워크 함수의 가중치를 조정하는 것을 특징으로 할 수 있 다. 보다 자세히 설명하면, 서버는 타겟 이미지(420a)와 원본 이미지(412a)가 유사해지도록 가중치를 조정하여 이미지 변환 모델에 대한 학습을 수행할 수 있다. 서버는 초음파 이미지(411a)가 입력됨에 따라, 생성자 모델이 출력하는 타겟 이미지(420a)와 초음파 이미지(411a)와 페어를 형성하는 원본 이미지(412a)에 대한 비교 를 수행할 수 있다. 또한, 서버는 타겟 이미지(420a)와 원본 이미지(412a)의 차가 최소가되도록 차원 감소네트워크 함수에 대한 학습을 수행할 수 있다. 서버는 생성자 모델의 출력인 타겟 이미지(420a)를 원본 이미지(412a)와 비교하여 오차를 도출하고, 도출된 오차에 기초하여 차원 감소 네트워크 함수의 가중치를 역전파 방식으로 조정할 수 있다. 이에 따라, 차원 감소 네트워크 함수는 초음파 이미지(411a)를 수신하여 초음파 이미지(411a)의 특정 벡터 에 관련한 피처를 출력으로 지정하여 입력된 데이터가 잠재 변수로 변환되는 중간 과정을 학습할 수 있다. 이에 따라, 생성자 모델은 소스 데이터에 포함된 원본 이미지와 유사한 데이터(즉, 타겟 이미지)를 출력하 게 된다. 즉, 전술한 바와 같은 학습 과정을 통해 특정 도메인에 관련한 이미지를 입력으로 하여, 특정 도메인과 상이한 도메인에 관련한 이미지를 출력하는 이미지 변환 모델을 생성할 수 있다. 다만, 전술한 학습 과정을 통해 생성된 이미지 변환 모델의 경우, 이미지의 다양성이 저하된다는 단점이 있다. 예컨대, 오차를 활용한 목적함수를 사용하는 경우, MES loss로 인해 dataset의 평균으로 수렴하는 현상이 발생 됨에 따라, 생성자 모델을 통해 복원된 얼굴 이미지의 다양성이 떨어진다는 단점이 있다. 본 발명의 다른 실시예에 따르면, 하나 이상의 네트워크 함수는, 초음파 이미지에 대응하는 잠재 변수를 출력하는 차원 감소 네트워크 함수, 잠재 변수를 입력으로 하는 경우, 잠재 변수에 대응하는 타 겟 이미지(420a)를 출력하도록 사전 학습된 생성자 모델 및 생성자 모델을 통해 출력된 타겟 이미지(420 a)와 차원 감소 네트워크 함수의 입력에 관련한 초음파 이미지가 페어 이미지인지 여부를 판별하는 분류자 모델 을 포함할 수 있다. 이 경우, 생성자 모델과 분류자 모델 간의 적대 학습을 통해 생성자 모델을 통해 출력되는 출력 이미지(즉, 실사 이미지에 관련한 타겟 이미지)가 보다 정교해질 수 있다. 실시예에서, 서버는 MSE(Mean Square Error) 대신 확률 모델을 통해 차원 감소 네트워크 함수에 대한 학습 을 수행할 수 있다. 예컨대, 전술한 일 실시예와 같이 차를 이용한 목적함수(L1, MSE)를 사용하는 경우 이미지 의 다양성이 저하될 수 있다. 차원 감소 네트워크 함수를 통해 복원된 타겟 이미지의 다양성이 생성자 모델이 직접 생성한 얼굴의 다양성 보다 떨어질 수 있다. 즉, MSE loss로 인해 데이터 세트의 평균으로 수렴하는 현상 이 야기됨에 따라 타겟 이미지에서의 얼굴의 다양성이 확보되지 못할 우려가 있다. 이에 따라, 서버는 초 음파 이미지와 타겟 이미지가 하나의 쌍에 관련한 페어 이미지인지를 구별하는 분류자 모델을 포함하는 하나 이 상의 네트워크 함수에 대한 학습을 수행할 수 있다. 즉, 분류자 모델을 추가하여 이미지 변환 모델을 구성할 수 있다. 도 7을 참조하여 보다 자세히 설명하면, 하나 이상의 네트워크 함수는, 초음파 이미지(411a)에 대응하는 잠재 변수를 출력하는 차원 감소 네트워크 함수, 잠재 변수를 입력으로 하는 경우, 잠재 변수에 대응 하는 타겟 이미지를 출력하도록 사전 학습된 생성자 모델 및 생성자 모델을 통해 출력된 타겟 이미지 와 초음파 이미지가 서로 대응하는 페어 이미지인지 여부를 판별하는 분류자 모델을 포함할 수 있다. 여기 서 페어 이미지는, 서로 연관된 두 개의 이미지를 의미할 수 있다. 예컨대, 특정 태아의 초음파 이미지와 실사 이미지는 서로 페어 이미지일 수 있다. 다른 예를 들어, 제1사용자의 초음파 이미지와 제2사용자의 실사 이미지 는, 서로 무관하므로, 페어 이미지가 아닐 수 있다. 이 경우, 학습은, 분류자 모델이 초음파 이미지와 생성자 모델을 통해 출력된 타겟 이미지를 페어 이미지 로 판별할 확률이 높도록 차원 감소 네트워크 함수 및 분류자 모델의 가중치를 조정하는 하는 것을 특징으로 할 수 있다. 자세히 설명하면, 분류자 모델은, 차원 감소 네트워크 함수의 입력에 관련한 초음파 이미지(411a)와 해당 초음파 이미지(411a)를 기반으로 생성자 모델이 출력한 타겟 이미지(420a)를 입력으로 하여, 해당 두 이미지가 페어 이미지인지 여부를 판별하는 것을 특징으로 할 수 있다. 예를 들어, 분류자 모델은, 입력되 는 두 이미지가 페어 이미지인 것으로 판별한 경우, 큰 수를 출력하고, 입력되는 두 이미지가 페어 이미지가 아 닌 경우, 작은 수를 출력하도록 학습될 수 있다. 실시예에서, 분류자 모델은, 서로 무관한 두 이미지를 랜덤하 게 선택하여 획득된 쌍이 아닌 이미지(negative sample)를 포함하는 학습 데이터를 통해 사전 학습될 수 있다. 이 경우, 서버는 분류자 모델이 초음파 이미지(411a)와 생성자 모델을 통해 출력된 타겟 이미지 (420a)를 페어 이미지로 판별할 확률이 높도록 차원 감소 네트워크 함수의 가중치를 조정하는 것을 특징으 로 할 수 있다. 즉, 초음파 이미지(411a)와 생성된 타겟 이미지(420a)에 대해 분류자 모델이 진짜 쌍으로판단(큰 수를 출력)하도록 차원 감소 네트워크 함수에 대한 가중치를 조정할 수 있다. 구체적인 실시예에서, 분류자 모델은 진짜 페어 이미지(예컨대, 서로 대응하는 초음파 이미지 및 원본 이 미지)를 입력으로 하는 경우, 1에 가까운 확률값을 출력하고, 가짜 페어 이미지(예컨대, 서로 대응하지 않은 초 음파 이미지와 타겟 이미지)를 입력으로 하는 경우, 0에 가까운 확률값을 출력하도록 학습될 수 있다. 진짜 페 어 이미지를 입력했을 때의 출력값과 1의 차이, 그리고 가짜 페어 이미지를 입력했을 때의 출력값과 0의 차이, 두 경우의 합이 분류자 모델의 로스(또는 손실 함수)일 수 있다. 생성자 모델의 목적은 분류자 모델을 속이는 것(즉, 진짜 페어 이미지에 포함된 원본 이미지와 유사 한 타겟 이미지를 생성)으로, 생성자 모델이 생성한 타겟 이미지(가짜)를 분류자 모델에 입력했을 때, 출력값이 1에 가깝게 나오도록 학습될 수 있다. 해당 출력값과 1의 오차가 생성자 모델의 로스일 수 있다. 즉, 서버에 의해 각 모델은 로스가 최소화되는 방향으로 학습될 수 있다. 서버는 적대 로스가 최소화 되는 방향으로 차원 감소 네트워크 함수 및 분류자 모델의 파라미터를 업데이트할 수 있다. 다시 말 해, 서버는 생성자 모델이 최대한 정답(예컨대, 원본 이미지)에 가까운 타겟 이미지를 생성하도록 하 는 잠재 변수를 출력하도록 차원 감소 네트워크 함수를 조정하고, 분류자 모델을 통해 가짜 원본 이 미지(즉, 타겟 이미지)를 가짜로 판별될 확률이 높도록 각 모델의 파라미터를 업데이트하여 학습을 수행할 수 있다. 서버는 생성자 모델과 분류자 모델 간의 적대 로스에 기반하여 차원 감소 네트워크 함수와 분류자 모델의 파라미터를 업데이트하는 적대 학습을 수행하여, 생성자 모델로 하여금 잠재 변수에 기반하여 보다 정교한 타겟 이미지를 출력하도록 할 수 있다. 본 발명의 또 다른 실시예에 따르면, 서버는 대조학습을 통해 이미지 변환 모델을 생성할 수 있다. 서버 는 대조 학습을 응용하여 두 이미지 표현 사이의 거리 함수를 최소/최대가 되도록 하나 이상의 네트워크 함수에 대한 학습을 수행할 수 있다. 도 8을 참조하여 보다 자세히 설명하면, 복수의 소스 데이터 각각은, 초음파 이미지에 대응하는 원본 이미지 및 타겟 도메인 이미지를 더 포함할 수 있다. 여기서, 원본 이미지는, 초음파 이미지에 대응하는 태아의 실제 실사 이미지일 수 있다. 또한, 타겟 도메인 이미지는, 타겟 이미지와 동일한 도메인에 관련한 이미지들 중 초음파 이 미지와 페어를 형성하지 않는 이미지인 것을 특징으로 할 수 있다. 즉, 타겟 도메인 이미지는 초음파 이미지와 매칭되지 않은 이미지일 수 있다. 예컨대, 제1사용자의 제1초음파 이미지와 페어를 형성하지 않는 제2사용자의 제2원본 이미지가, 제1초음파 이미지에 대응하는 타겟 도메인 이미지일 수 있다. 다시 말해, 타겟 도메인 이미지는, 생성자 모델의 출력과 대응하는 도메인에 해당하는 이미지들 중 초음파 이미지와 무관한 이미지 중 적어도 하나일 수 있다. 실시예에서, 초음파 이미지, 해당 초음파 이미지에 대응하는 원본 이미지(즉, 해당 초음파 이미지와 페어를 형 성하는 원본 이미지) 및 해당 초음파 이미지와 페어를 형성하지 않는 타겟 도메인 이미지가 하나의 학습 데이터 를 구축할 수 있다. 예컨대, 제1초음파 이미지, 제1원본 이미지 및 제1타겟 도메인 이미지가 제1학습 데이터일 수 있다. 이러한 예시와 같이, 복수의 소스 데이터를 기반으로 복수의 학습 데이터가 구축될 수 있으며, 복수의 학습 데이터 각각을 통해 하나 이상의 네트워크 함수에 대한 학습이 수행되게 된다. 실시예에서, 서버는 각 초음파 이미지에 대응하는 타겟 도메인 이미지를 선별할 수 있다. 구체적으로, 서 버는 초음파 이미지와 상이한 도메인의 이미지들 중에서 해당 초음파 이미지와 페어를 형성하지 않는 이미 지들을 식별하고, 식별된 이미지들 중 적어도 하나를 타겟 도메인 이미지로 선별할 수 있다. 다양한 실시예에서, 타겟 도메인 이미지는 타겟 이미지와 동일한 도메인에 관련한 이미지들 중 초음파 이미지와 페어를 형성하는 원본 이미지와 유사도가 가장 높은 이미지를 통해 선별되는 것을 특징으로 할 수 있다. 즉, 서버는 초음파 이미지와 상이한 도메인(예컨대, 원본 이미지와 동일한 도메인)의 이미지들 중에서 해 당 초음파 이미지와 페어를 형성하지 않는 이미지들을 식별할 수 있다. 이 경우, 서버는 식별된 이미지들 중 초음파 이미지 페어를 형성하는 원본 이미지와 유사도가 가장 높은 이미지를 타겟 도메인 이미지로 선별할 수 있다. 실시예에서, 각 이미지 간의 유사도 비교는, 유클리드 거리 또는 코사인 유사도에 기반하여 수행될 수 있다. 또한 실시예에서, 각 이미지 간의 유사도 비교는, 각 이미지에 대응하여 산출되는 피처 간의 거리 비교에 기반하여 수행될 수 있다. 예컨대, 각 피처들은 벡터 공간 상의 일 영역에 표시될 수 있다. 여기서, 유사한 이 미지 간의 피처들은 유사한 영역 상에 근접하게 위치할 수 있으며, 상이할수록 비교적 먼 위치에 위치될 수 있다. 초음파 이미지와 페어를 형성하는 원본 이미지와 유사한 이미지를 타겟 도메인 이미지로 선별하는 것은, 신경망 모델로 하여금 배울 점이 많도록 하기 위함이다. 실시예에서, 신경망 모델(또는 하나 이상의 네트워크 함수)는 초음파 이미지에 대응하는 제1피처와 타겟 도메인 이미지에 대응하는 제3피처 간 거리가 최대가 되도록 학습될 수 있다. 이러한 학습 과정에서 초음파 이미지에 대응하는 타겟 도메인 이미지가 해당 초음파 이미지와 연관성 이 전혀 없는 경우, 학습 과정에서 배울 지식이 현저히 적어질 수 있다. 즉, 초음파 이미지와 타겟 도메인 이미 지가 연관성이 클수록 신경망이 배울 지식이 많아지게 된다. 구체적인 예를 들어, 초음파 이미지와 타겟 도메인 이미지 간의 연관성이 큰 경우에도, 피처 추출 모델은 각 이미지에 대응하는 피처 간의 거리가 멀어지도록 각 피처를 추출하여야 한다. 즉, 유사한 데이터 간의 피처들이 서로 멀어지도록 학습되어야 함에 따라 보다 배울 지식이 많아지게 되며, 이에 따라, 학습 완료 후 예측되어 출력되는 타겟 이미지의 정확도가 더욱 향상될 수 있 다. 구체적인 실시예에서, 하나 이상의 네트워크 함수는, 도 8에 도시된 바와 같이, 초음파 이미지(411a)에 대응하 는 잠재 변수를 출력하는 차원 감소 네트워크 함수, 잠재 변수를 입력으로 하는 경우, 잠재 변 수에 대응하는 타겟 이미지를 출력하도록 사전 학습된 생성자 모델 및 초음파 이미지, 타겟 이미지 및 타겟 도메인 이미지 각각을 입력으로 하여 각 이미지에 대응하는 피처를 출력하는 피처 추출 모델을 포 함할 수 있다. 실시예에서, 피처 추출 모델은 이미지를 입력 받아 저차원의 피처(또는 벡터)를 출력할 수 있다. 예컨대, 피처 추출 모델은, 학습된 오토인코더에서 인코더 부분을 통해 구성될 수 있다. 실시예에서, 각 이미지에 대응하는 피처는, 타겟 이미지(420a)에 대응하는 제1피처, 초음파 이미지(411a)에 대 응하는 제2피처 및 타겟 도메인 이미지(413a)에 대응하는 제3피처를 포함할 수 있다. 즉, 서버는 초음파 이미지(411a)에 대응하는 제1피처, 초음파 이미지와 쌍을 이루는 타겟 이미지(420a)에 대응하는 제2피처 및 초음파 이미지와 무관한 타겟 도메인 이미지에 대응하는 제3피처를 산출할 수 있다. 또한, 실시예에서 서버는 제1피처와 제2피처 간의 거리가 최소가 되며, 제1피처와 제3피처 간의 거리가 최 대가 되도록 차원 감소 네트워크 함수 및 피처 추출 모델에 대한 대조 학습을 수행하는 것을 특징으 로 할 수 있다. 구체적인 실시예에서, 서버는 임의의 거리 함수 δ에 대해, δ(fa, f+)는 최소가 되도록 하 고, δ(fa, f-)는 최대가 되도록 조정할 수 있다. 즉, 초음파 이미지와 페어를 형성하는 원본 이미지에 대응하는 피처와 근접한 위치에 피처를 출력할 확률이 높게, 그리고 초음파 이미지와 페어를 형성하지 않는 타겟 도메인 이미지에 대응하는 피처와 상이한 영역에 피처를 출력할 확률이 높도록 학습될 수 있다. 실시예에서, 차원 감소 네트워크 함수 및 피처 추출 모델은 번갈아가며 적대적으로 학습되는 것이 아 닌, 동일한 거리 함수를 통해 동시에 학습되는 것을 특징으로 할 수 있다. 이러한 복수의 학습 데이터를 포함하는 학습 데이터 세트를 통해 학습 과정이 완료됨에 따라 이미지 변환 모델 이 생성될 수 있다. 예컨대, 학습이 완료된 상태에서 차원 감소 네트워크 함수와 생성자 모델을 통해 이미지 변환 모델이 구성될 수 있다. 이 경우 이미지 변환 모델은, 초음파 이미지에 대응하여 태아의 미래 의 얼굴에 관련한 실사 이미지를 예측하여 제공할 수 있다. 즉, 본 발명은 특정 도메인에 관련한 이미지에 기반 하여 다른 도메인에 관련한 예측 이미지를 생성하는 이미지 변환 모델을 제공할 수 있다. 도 8은 본 발명의 일 실시예와 관련된 하나 이상의 네트워크 함수를 나타낸 개략도이다. 본 명세서에 걸쳐, 연산 모델, 신경망, 네트워크 함수, 뉴럴 네트워크(neural network)는 동일한 의미로 사용될 수 있다. 신경망은 일반적으로 “노드”라 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성될 수 있다. 이러한 “노드”들은 “뉴런(neuron)”들로 지칭될 수도 있다. 신경망은 적어도 하나 이상의 노드들을 포 함하여 구성된다. 신경망들을 구성하는 노드(또는 뉴런)들은 하나 이상의“링크”에 의해 상호 연결될 수 있다. 신경망 내에서, 링크를 통해 연결된 하나 이상의 노드들은 상대적으로 입력 노드 및 출력 노드의 관계를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 상술한 바 와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나 이상의 출력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서, 출력 노드는 입력 노드에 입력된 데이터에 기초 하여 그 값이 결정될 수 있다. 여기서 입력 노드와 출력 노드를 상호 연결하는 노드는 가중치(weight)를 가질 수 있다. 가중치는 가변적일 수 있으며, 신경망이 원하는 기능을 수행하기 위해, 사용자 또는 알고리즘에 의해 가변될 수 있다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연결된 경 우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하는 링크 에 설정된 가중치에 기초하여 출력 노드 값을 결정할 수 있다. 상술한 바와 같이, 신경망은 하나 이상의 노드들이 하나 이상의 링크를 통해 상호 연결되어 신경망 내에서 입력 노드 및 출력 노드 관계를 형성한다. 신경망 내에서 노드들과 링크들의 개수 및 노드들과 링크들 사이의 연관관 계, 링크들 각각에 부여된 가중치의 값에 따라, 신경망의 특성이 결정될 수 있다. 예를 들어, 동일한 개수의 노 드 및 링크들이 존재하고, 링크들 사이의 가중치 값이 상이한 두 신경망이 존재하는 경우, 두 개의 신경망들은 서로 상이한 것으로 인식될 수 있다. 딥 뉴럴 네트워크(DNN: deep neural network, 심층신경망)는 입력레이어와 출력 레이어 외에 복수의 히든 레이 어를 포함하는 신경망을 의미할 수 있다. 딥 뉴럴 네트워크를 이용하면 데이터의 잠재적인 구조(latent structures)를 파악할 수 있다. 즉, 사진, 글, 비디오, 음성, 음악의 잠재적인 구조(예를 들어, 어떤 물체가 사 진에 있는지, 글의 내용과 감정이 무엇인지, 음성의 내용과 감정이 무엇인지 등)를 파악할 수 있다. 딥 뉴럴 네 트워크는 컨볼루션 뉴럴 네트워크(CNN: convolutional neural network), 리커런트 뉴럴 네트워크(RNN: recurrent neural network), 오토 인코더(auto encoder), GAN(Generative Adversarial Networks), 제한 볼츠 만 머신(RBM: restricted boltzmann machine), 심층 신뢰 네트워크(DBN: deep belief network), Q 네트워크, U 네트워크, 샴 네트워크 등을 포함할 수 있다. 전술한 딥 뉴럴 네트워크의 기재는 예시일 뿐이며 본 발명은 이에 제한되지 않는다. 뉴럴 네트워크는 교사 학습(supervised learning), 비교사 학습(unsupervised learning) 및 반교사학습(semi supervised learning) 중 적어도 하나의 방식으로 학습될 수 있다. 뉴럴 네트워크의 학습은 출력의 오류를 최소 화하기 위한 것이다. 뉴럴 네트워크의 학습에서 반복적으로 학습 데이터를 뉴럴 네트워크에 입력시키고 학습 데 이터에 대한 뉴럴 네트워크의 출력과 타겟의 에러를 계산하고, 에러를 줄이기 위한 방향으로 뉴럴 네트워크의 에러를 뉴럴 네트워크의 출력 레이어에서부터 입력 레이어 방향으로 역전파(backpropagation)하여 뉴럴 네트워 크의 각 노드의 가중치를 업데이트 하는 과정이다. 교사 학습의 경우 각각의 학습 데이터에 정답이 라벨링 되어 있는 학습 데이터를 사용하며(즉, 라벨링된 학습 데이터), 비교사 학습의 경우는 각각의 학습 데이터에 정답이 라벨링되어 있지 않을 수 있다. 즉, 예를 들어 데이터 분류에 관한 교사 학습의 경우의 학습 데이터는 학습 데 이터 각각에 카테고리가 라벨링 된 데이터 일 수 있다. 라벨링된 학습 데이터가 뉴럴 네트워크에 입력되고, 뉴 럴 네트워크의 출력(카테고리)과 학습 데이터의 라벨이 비교함으로써 오류(error)가 계산될 수 있다. 다른 예로, 데이터 분류에 관한 비교사 학습의 경우 입력인 학습 데이터가 뉴럴 네트워크 출력과 비교됨으로써 오류 가 계산될 수 있다. 계산된 오류는 뉴럴 네트워크에서 역방향(즉, 출력 레이어에서 입력 레이어 방향)으로 역전 파 되며, 역전파에 따라 뉴럴 네트워크의 각 레이어의 각 노드들의 연결 가중치가 업데이트 될 수 있다. 업데이 트 되는 각 노드의 연결 가중치는 학습률(learning rate)에 따라 변화량이 결정될 수 있다. 입력 데이터에 대한 뉴럴 네트워크의 계산과 에러의 역전파는 학습 사이클(epoch)을 구성할 수 있다. 학습률은 뉴럴 네트워크의 학 습 사이클의 반복 횟수에 따라 상이하게 적용될 수 있다. 예를 들어, 뉴럴 네트워크의 학습 초기에는 높은 학습 률을 사용하여 뉴럴 네트워크가 빠르게 일정 수준의 성능을 확보하도록 하여 효율성을 높이고, 학습 후기에는 낮은 학습률을 사용하여 정확도를 높일 수 있다. 뉴럴 네트워크의 학습에서 일반적으로 학습 데이터는 실제 데이터(즉, 학습된 뉴럴 네트워크를 이용하여 처리하 고자 하는 데이터)의 부분집합일 수 있으며, 따라서, 학습 데이터에 대한 오류는 감소하나 실제 데이터에 대해 서는 오류가 증가하는 학습 사이클이 존재할 수 있다. 과적합(overfitting)은 이와 같이 학습 데이터에 과하게 학습하여 실제 데이터에 대한 오류가 증가하는 현상이다. 예를 들어, 노란색 고양이를 보여 고양이를 학습한 뉴 럴 네트워크가 노란색 이외의 고양이를 보고는 고양이임을 인식하지 못하는 현상이 과적합의 일종일 수 있다. 과적합은 머신러닝 알고리즘의 오류를 증가시키는 원인으로 작용할 수 있다. 이러한 과적합을 막기 위하여 다양 한 최적화 방법이 사용될 수 있다. 과적합을 막기 위해서는 학습 데이터를 증가시키거나, 레귤라이제이션 (regularization), 학습의 과정에서 네트워크의 노드 일부를 생략하는 드롭아웃(dropout) 등의 방법이 적용될 수 있다.본 명세서에 걸쳐, 연산 모델, 신경망, 네트워크 함수, 뉴럴 네트워크(neural network)는 동일한 의미로 사용될 수 있다. (이하에서는 신경망으로 통일하여 기술한다.) 데이터 구조는 신경망을 포함할 수 있다. 그리고 신경망 을 포함한 데이터 구조는 컴퓨터 판독가능 매체에 저장될 수 있다. 신경망을 포함한 데이터 구조는 또한 신경망 에 입력되는 데이터, 신경망의 가중치, 신경망의 하이퍼 파라미터, 신경망으로부터 획득한 데이터, 신경망의 각 노드 또는 레이어와 연관된 활성 함수, 신경망의 학습을 위한 손실 함수를 포함할 수 있다. 신경망을 포함한 데 이터 구조는 상기 개시된 구성들 중 임의의 구성 요소들을 포함할 수 있다. 즉 신경망을 포함한 데이터 구조는 신경망에 입력되는 데이터, 신경망의 가중치, 신경망의 하이퍼 파라미터, 신경망으로부터 획득한 데이터, 신경 망의 각 노드 또는 레이어와 연관된 활성 함수, 신경망의 트레이닝을 위한 손실 함수 등 전부 또는 이들의 임의 의 조합을 포함하여 구성될 수 있다. 전술한 구성들 이외에도, 신경망을 포함한 데이터 구조는 신경망의 특성을 결정하는 임의의 다른 정보를 포함할 수 있다. 또한, 데이터 구조는 신경망의 연산 과정에 사용되거나 발생되는 모든 형태의 데이터를 포함할 수 있으며 전술한 사항에 제한되는 것은 아니다. 컴퓨터 판독가능 매체는 컴퓨터 판독가능 기록 매체 및/또는 컴퓨터 판독가능 전송 매체를 포함할 수 있다. 신경망은 일반적으로 노드라 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성될 수 있다. 이러한 노드들은 뉴런(neuron)들로 지칭될 수도 있다. 신경망은 적어도 하나 이상의 노드들을 포함하여 구성된다. 본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조 합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 본 발명의 기술 분야에서 통상의 지식을 가진 자는 여기에 개시된 실시예들과 관련하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 프로세서들, 수단들, 회로들 및 알고리즘 단계들이 전자 하드웨어, (편의를 위해, 여기에 서 \"소프트웨어\"로 지칭되는) 다양한 형태들의 프로그램 또는 설계 코드 또는 이들 모두의 결합에 의해 구현될 수 있다는 것을 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호 호환성을 명확하게 설명하기 위해, 다양 한 예시적인 컴포넌트들, 블록들, 모듈들, 회로들 및 단계들이 이들의 기능과 관련하여 위에서 일반적으로 설명 되었다. 이러한 기능이 하드웨어 또는 소프트웨어로서 구현되는지 여부는 특정한 애플리케이션 및 전체 시스템 에 대하여 부과되는 설계 제약들에 따라 좌우된다. 본 발명의 기술 분야에서 통상의 지식을 가진 자는 각각의 특정한 애플리케이션에 대하여 다양한 방식들로 설명된 기능을 구현할 수 있으나, 이러한 구현 결정들은 본 발 명의 범위를 벗어나는 것으로 해석되어서는 안 될 것이다. 여기서 제시된 다양한 실시예들은 방법, 장치, 또는 표준 프로그래밍 및/또는 엔지니어링 기술을 사용한 제조 물품(article)으로 구현될 수 있다. 용어 \"제조 물품\"은 임의의 컴퓨터-판독가능 장치로부터 액세스 가능한 컴 퓨터 프로그램, 캐리어, 또는 매체(media)를 포함한다. 예를 들어, 컴퓨터-판독가능 매체는 자기 저장 장치(예 를 들면, 하드 디스크, 플로피 디스크, 자기 스트립, 등), 광학 디스크(예를 들면, CD, DVD, 등), 스마트 카드, 및 플래쉬 메모리 장치(예를 들면, EEPROM, 카드, 스틱, 키 드라이브, 등)를 포함하지만, 이들로 제한되는 것은 아니다. 또한, 여기서 제시되는 다양한 저장 매체는 정보를 저장하기 위한 하나 이상의 장치 및/또는 다른 기 계-판독가능한 매체를 포함한다. 용어 \"기계-판독가능 매체\"는 명령(들) 및/또는 데이터를 저장, 보유, 및/또 는 전달할 수 있는 무선 채널 및 다양한 다른 매체를 포함하지만, 이들로 제한되는 것은 아니다. 제시된 프로세스들에 있는 단계들의 특정한 순서 또는 계층 구조는 예시적인 접근들의 일례임을 이해하도록 한 다. 설계 우선순위들에 기반하여, 본 발명의 범위 내에서 프로세스들에 있는 단계들의 특정한 순서 또는 계층 구조가 재배열될 수 있다는 것을 이해하도록 한다. 첨부된 방법 청구항들은 샘플 순서로 다양한 단계들의 엘리 먼트들을 제공하지만 제시된 특정한 순서 또는 계층 구조에 한정되는 것을 의미하지는 않는다. 제시된 실시예들에 대한 설명은 임의의 본 발명의 기술 분야에서 통상의 지식을 가진 자가 본 발명을 이용하거 나 또는 실시할 수 있도록 제공된다. 이러한 실시예들에 대한 다양한 변형들은 본 발명의 기술 분야에서 통상의 지식을 가진 자에게 명백할 것이며, 여기에 정의된 일반적인 원리들은 본 발명의 범위를 벗어남이 없이 다른 실 시예들에 적용될 수 있다. 그리하여, 본 발명은 여기에 제시된 실시예들로 한정되는 것이 아니라, 여기에 제시 된 원리들 및 신규한 특징들과 일관되는 최광의의 범위에서 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2022-0166791", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예와 관련된 이미지 변환 모델 제공 방법을 구현하기 위한 시스템을 개략적으로 도시 한 예시도이다. 도 2는 본 발명의 일 실시예와 관련된 이미지 변환 모델 제공 방법을 수행하는 서버의 하드웨어 구성도이다. 도 3은 본 발명의 일 실시예와 관련된 이미지 변환 모델 제공 방법을 예시적으로 나타낸 순서도를 도시한다.도 4는 본 발명의 일 실시예와 관련된 종래의 신경망 모델의 입력 및 출력을 설명하기 위한 예시도이다. 도 5는 본 발명의 일 실시예와 관련된 학습이 완료됨에 따라 생성된 이미지 변환 모델의 입력 및 출력을 설명하 기 위한 예시도이다. 도 6은 본 발명의 일 실시예와 관련된 이미지 변환 모델의 학습 과정을 설명하기 위한 예시도이다. 도 7은 본 발명의 다른 실시예와 관련된 이미지 변환 모델의 학습 과정을 설명하기 위한 예시도이다. 도 8은 본 발명의 또 다른 실시예와 관련된 이미지 변환 모델의 학습 과정을 설명하기 위한 예시도이다. 도 9는 본 발명의 일 실시예와 관련된 하나 이상의 네트워크 함수를 나타낸 개략도이다."}
