{"patent_id": "10-2021-0090415", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0011083", "출원번호": "10-2021-0090415", "발명의 명칭": "사용자 대화 중 정보 처리 방법, 장치, 전자 기기 및 기록 매체", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "구오, 전"}}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 대화 중 정보 처리 방법에 있어서,제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보(dialogue above information)를 획득하는 단계;상기 제1 사용자가 사용할 목표 대화 전략(target dialogue strategy)을 획득하는 단계;상기 목표 대화 전략 및 상기 대화 윗글 정보에 기반하여, 미리 훈련된 화술 생성 모델(speech generationmodel)을 사용하여 대응하는 초기 응답 내용을 생성하는 단계; 및상기 제1 사용자가 위치한 클라이언트에 상기 초기 응답 내용을 전송하여 상기 제1 사용자와 상기 제2 사용자의대화 인터페이스에 상기 초기 응답 내용을 표시하는 단계; 를 포함하는, 사용자 대화 중 정보 처리 방법."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 사용자가 사용하는 목표 대화 전략을 획득하는 단계는:상기 제1 사용자가 미리 설정된 대화 전략 세트에서 선택한 상기 목표 대화 전략을 획득하거나; 또는미리 훈련된 대화 전략 예측 모델 및 상기 제1 사용자와 상기 제2 사용자의 이력 대화 정보를 사용하여 상기 목표 대화 전략을 예측하는 단계;를 포함하는, 사용자 대화 중 정보 처리 방법."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 목표 대화 전략 및 상기 대화 윗글 정보에 기반하여, 미리 훈련된 화술 생성 모델을 사용하여, 대응하는초기 응답 내용을 생성하는 단계의 후에:상기 초기 응답 내용에 대해 스타일 전환을 진행하여 목표 응답 내용으로 하는 단계;(a1) 상기 초기 응답 내용에 기반하여 이미지 생성을 수행하여, 상기 초기 응답 내용의 키워드 정보를 휴대하는이미지를 생성하여 목표 응답 내용으로 하는 단계; 또는(b1) 상기 초기 응답 내용에 기반하여 동영상 생성을 진행하여, 상기 초기 응답 내용의 키워드 정보를 휴대한동영상을 생성하여 목표 응답 내용으로 하는 단계; 를 포함하는, 사용자 대화 중 정보 처리 방법."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 목표 대화 전략 및 상기 대화 윗글 정보에 기반하여, 미리 훈련된 화술 생성 모델을 사용하여, 대응하는초기 응답 내용을 생성하는 단계의 후에:상기 초기 응답 내용의 키워드에 기반하여 애니메이션 생성 모델을 사용하여 대응하는 애니메이션을 생성하는공개특허 10-2022-0011083-3-단계;상기 제1 사용자가 위치하는 클라이언트에 생성된 상기 애니메이션을 전송하여 상기 애니메이션을 상기 제1 사용자와 상기 제2 사용자의 대화 인터페이스에 표시하는 단계; 를 더 포함하는, 사용자 대화 중 정보 처리 방법."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중의 어느 한 항에 있어서, 감성 분석 모델(emotional analysis model)을 사용하여, 상기 제1 사용자와 상기 제2 사용자의 이력 대화 정보에 기반하여, 상기 제2 사용자의 감성 정보를 분석하고, 상기 제1 사용자가 위치한 클라이언트에 상기 제2 사용자의 감성 정보를 전송하며, 상기 제1 사용자와 상기 제2 사용자의 대화 인터페이스에 표시하는 단계; 및/또는주제 관심도 분석 모델(topic interest analysis model)을 사용하여, 상기 제1 사용자와 상기 제2 사용자의 이력 대화 정보에 기반하여, 상기 제2 사용자가 현재 주제에 관심 있는지 여부를 분석하고, 상기 제1 사용자가 위치한 클라이언트에 상기 제2 사용자가 현재 주제에 관심 있는지 여부를 전송하고, 상기 제1 사용자와 상기 제2사용자의 대화 인터페이스에 표시하는 단계; 를 더 포함하는, 사용자 대화 중 정보 처리 방법."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,주제 예측 모델(topic prediction model)을 사용하여, 상기 제1 사용자와 상기 제2 사용자의 이력 대화 정보에기반하여, 상기 제2 사용자가 관심 있는 목표 주제를 예측하고, 상기 제1 사용자가 위치한 클라이언트에 상기제2 사용자가 관심 있는 상기 목표 주제를 전송하고, 상기 제1 사용자와 상기 제2 사용자의 대화 인터페이스에표시하는 단계;를 더 포함하는, 사용자 대화 중 정보 처리 방법."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "사용자 대화 중 정보 처리 장치에 있어서,제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득하는데 사용되는 정보 획득 모듈;상기 제1 사용자가 사용할 목표 대화 전략을 획득하는데 사용되는 전략 획득 모듈;상기 목표 대화 전략 및 상기 대화 윗글 정보에 기반하여, 미리 훈련된 화술 생성 모델을 사용하여 대응하는 초기 응답 내용을 생성하는 생성 모듈; 및상기 제1 사용자가 위치한 클라이언트에 상기 초기 응답 내용을 전송하고, 상기 제1 사용자와 상기 제2 사용자의 대화 인터페이스에 상기 초기 응답 내용을 표시하는 전송 모듈; 을 포함하는, 사용자 대화 중 정보 처리 장치."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 전략 획득 모듈은:상기 제1 사용자가 미리 설정된 대화 전략 세트에서 선택한 상기 목표 대화 전략을 획득하거나; 또는공개특허 10-2022-0011083-4-미리 훈련된 대화 전략 예측 모델 및 상기 제1 사용자와 상기 제2 사용자의 이력 대화 정보를 사용하여 상기 목표 대화 전략을 예측하는, 사용자 대화 중 정보 처리 장치."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 초기 응답 내용에 대해 스타일 전환을 진행하여 목표 응답 내용으로 하는 스타일 전환 모듈;(a1) 상기 초기 응답 내용에 기반하여 이미지 생성을 수행하여, 상기 초기 응답 내용을 포함하는 키워드 정보의이미지를 생성하여 목표 응답 내용으로 하는 이미지 생성 모듈; 또는(b1) 상기 초기 응답 내용에 기반하여 동영상 생성을 수행하여, 상기 초기 응답 내용의 키워드 정보를 휴대하는동영상을 생성하여 목표 응답 내용으로 하는 동영상 생성 모듈;을 더 포함하는, 사용자 대화 중 정보 처리 장치."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,애니메이션 생성 모듈을 더 포함하며;상기 애니메이션 생성 모델은 상기 초기 응답 내용의 키워드에 기반하여 애니메이션 생성 모듈을 사용하여 대응하는 애니메이션을 생성하는데 사용되며;상기 전송 모듈은 상기 제1 사용자가 위치한 클라이언트에 생성된 상기 애니메이션을 전송하여, 상기 애니메이션을 상기 제1 사용자와 상기 제2 사용자의 대화 인터페이스에 표시하는데 더 사용되는, 사용자 대화 중 정보 처리 장치."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항 내지 제10항 중 어느 한 항에 있어서,감성 분석 모듈을 사용하여, 상기 제1 사용자와 상기 제2 사용자의 이력 대화 정보에 기반하여, 상기 제2 사용자의 감성 정보를 분석하며; 및/또는 주제 관심도 분석 모델을 사용하여, 상기 제1 사용자와 상기 제2 사용자의이력 대화 정보에 기반하여, 상기 제2 사용자가 현재 주제에 관심 있는지 여부를 분석하는데 사용되는 분석 모델;을 더 포함하며,상기 전송 모듈은:상기 제1 사용자가 위치한 클라이언트에 상기 제2 사용자의 감성 정보를 전송하고 상기 제1 사용자와 상기 제2사용자의 대화 인터페이스에 표시하며; 및/또는 상기 제1 사용자가 위치하는 클라이언트에 상기 제2 사용자가현재 주제에 관심 있는지 여부를 전송하고, 상기 제1 사용자와 상기 제2 사용자의 대화 인터페이스에 표시하는데 사용되는,사용자 대화 중 정보 처리 장치."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항 내지 제10항 중 어느 한 항에 있어서,주제 예측 모델을 사용하여 상기 제1 사용자와 상기 제2 사용자의 이력 대화 정보에 기반하여, 상기 제2 사용자가 관심 있는 목표 주제를 예측하는데 사용되는 예측 모듈;공개특허 10-2022-0011083-5-을 더 포함하며,상기 전송 모듈은:상기 제1 사용자가 위치한 클라이언트에 상기 제2 사용자가 관심 있는 상기 목표 주제를 전송하고, 상기 제1 사용자와 상기 제2 사용자의 대화 인터페이스에 표시하는데 더 사용되는, 사용자 대화 중 정보 처리 장치."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결된 메모리를 구비하며,상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기억되어 있으며, 상기 명령이 상기적어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서로 하여금 제1항 내지 제6항 중 어느 한항에 기재된 방법을 수행하도록 하는,전자 기기."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨터 명령이 기억되어 있는 비 일시적 컴퓨터 판독 가능 기록 매체에 있어서,상기 컴퓨터 명령은 상기 컴퓨터로 하여금 제1항 내지 제6항 중 어느 한 항에 기재된 방법을 수행하도록 하는,기록 매체."}
{"patent_id": "10-2021-0090415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "비 일시적 컴퓨터 판독 가능 기록 매체에 기억되어 있는 프로그램에 있어서,상기 프로그램은 상기 컴퓨터로 하여금 제1항 내지 제6항 중 어느 한 항에 기재된 방법을 수행하도록 하는,비 일시적 컴퓨터 판독 가능 기록 매체에 기억되어 있는 프로그램."}
{"patent_id": "10-2021-0090415", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 사용자 대화 중 정보 처리 방법, 장치, 전자 기기 및 기록 매체를 개시하였으며, 특히 인공 지능 분야 및 자연어 처리 분야에 관한 것이다. 구체적인 구현 방안은: 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보 를 획득하며; 제1 사용자가 사용한 목표 대화 전략을 획득하며; 목표 대화 전략 및 대화 윗글 정보에 기반하여 미리 훈련된 화술 생성 모델을 사용하여 대응하는 초기 응답 내용을 생성하며; 제1 사용자가 위치하는 클라이언 트에 초기 응답 내용을 전송하여 제1 사용자와 제2 사용자의 대화 인터페이스에 초기 응답 내용을 표시한다. 본 출원의 방안은 지능적으로 사용자 대화 중 응답 내용을 생성하고 사용자에게 완전히 의존하여 응답 내용을 생성 할 필요가 없으므로 사용자 대화 장면의 정보 처리의 유연성을 향상시킬 수 있고 사용자 대화 장면의 지능성을 보강한다."}
{"patent_id": "10-2021-0090415", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 컴퓨터 기술 분야로서, 구체적으로 인공 지능(artificial intelligence) 분야 및 자연어 처리 (natural language processing) 분야에 관한 것이고, 특히 사용자 대화 중 정보 처리 방법, 장치, 기기 및 기 록 매체에 관한 것이다."}
{"patent_id": "10-2021-0090415", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자-사용자 대화를 기반으로 한 사용자 대화 장면에서 사용자와 더 나은 대화를 나누는 방법은 항상 사용자 가 계속 추구하는 주제였다. 친구를 사귀든, 직장에서 의사소통을 하든, 인생의 동반자를 추구하든, 서로의 목 소리를 정확하게 듣고 적절한 시기와 환경에서 적절한 피드백을 제공해야 한다. 그러나 기존의 사용자 대화 장면에서 대화의 양 당사자가 기계와 같은 스마트 장치가 아닌 사용자이기 때문에, 모든 대화 과정이 사용자에게 완전히 의존하고, 대화 과정이 경직되고, 지능성이 매우 떨어진다."}
{"patent_id": "10-2021-0090415", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 기술 문제를 해결하기 위해 본 출원은 사용자 대화 중 정보 처리 방법, 장치, 전자 기기 및 기록 매체를 제공한다."}
{"patent_id": "10-2021-0090415", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 일 양태에 따르면, 사용자 대화 중 정보 처리 방법을 제공하며 상기 방법은: 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득하며; 상기 제1 사용자가 사용할 목표 대화 전략을 획득하며; 상기 목표 대화 전략 및 상기 대화 윗글 정보에 기반하여 미리 훈련된 화술 생성 모델을 사용하여 대응하는 초 기 응답 내용을 생성하며 ; 상기 제1 사용자가 위치한 클라이언트에 상기 초기 응답 내용을 전송하여 상기 제1 사용자와 상기 제2 사용자의 대화 인터페이스에 상기 초기 응답 내용을 표시한다. 본 출원의 또 다른 양태에 따르면 사용자 대화 중 정보 처리 장치를 제공하며,상기 장치는: 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득하는데 사용되는 정보 획득 모듈; 상기 제1 사용자가 사용하는 목표 대화 전략을 획득하는데 사용되는 전략 획득 모듈; 상기 목표 대화 전략 및 상기 대화 윗글 정보에 기반하여 미리 훈련된 화술 생성 모델을 사용하여 대응하는 초 기 응답 내용을 생성하는 생성 모듈; 상기 제1 사용자가 위치한 클라이언트에 상기 초기 응답 내용을 전송하고, 상기 제1 사용자와 상기 제2 사용자 의 대화 인터페이스에 상기 초기 응답 내용을 표시하는 전송 모듈을 포함한다. 본 출원의 또 일 양태에 따르면 전자 기기를 제공하며 상기 전자 기기는: 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결된 메모리를 구비하며, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기억되어 있으며, 상기 명령이 상기 적어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서로 하여금 상기 방법을 수행하도록 한다. 본 출원의 또 일 양태에 따르면, 컴퓨터 명령이 기억되어 있는 비 일시적 컴퓨터 판독 가능 기록 매체를 제공하 며, 상기 컴퓨터 명령은 상기 컴퓨터로 하여금 상기 방법을 수행하도록 한다."}
{"patent_id": "10-2021-0090415", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 기술에 따르면 사용자 대화 중 응답 내용을 지능적으로 생성하고, 사용자에게 전적으로 의존하여 응 답 내용을 생성할 필요가 없으므로 사용자 대화 장면의 정보 처리의 유연성을 향상시킬 수 있고, 사용자 대화 장면의 지능성을 보강한다. 본 부분에서 설명한 내용은 본 개시 내용의 실시예들의 핵심 또는 중요한 특징들을 식별하기 위한 것이 아니며, 본 개시 내용의 범위를 제한하려는 의도가 아님을 이해해야 한다. 본 개시 내용의 다른 특징은 다음 설명을 통 해 쉽게 이해될 것이다."}
{"patent_id": "10-2021-0090415", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 이미지를 참조하여 본 출원의 시범적인 실시예를 기술하는 바, 본 출원에 대한 이해를 돕기 위해 여기에 는 본 출원 실시예의 다양한 세부 사항이 포함되며, 이러한 세부 사항을 단지 시범적인 것으로 간주해야 할 것이다. 따라서, 당업자는 본 발명의 범위 및 정신을 벗어나지 않는 전제 하에서, 여기서 설명되는 실시예에 대해 다양한 변경 및 수정을 수행할 수 있음을 인식해야 한다. 마찬가지로, 명확성 및 간결성을 위하여 이하의 기술 에서는 잘 알려진 기능 및 구조의 기술을 생략하였다. 도 1은 본 출원 제1 실시예에 따른 개략도이다; 도 1에 나타낸 바와 같이, 본 실시예는 사용자 대화 중 정보 처 리 방법을 제공하며, 구체적으로 아래의 단계를 포함할 수 있다: 단계 S101, 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보(dialogue above information)를 획득한다; 단계 S102, 제1 사용자가 채택한 목표 대화 전략(target dialogue strategy)을 획득한다; 단계 S103, 목표 대화 전략 및 대화 윗글 정보에 기반하여 미리 훈련된 화술 생성 모델(speech generation model)을 사용하여 대응하는 초기 응답 내용을 생성한다; 단계 S104, 제1 사용자가 위치한 클라이언트에 초기 응답 내용을 전송하여 제1 사용자와 제2 사용자의 대화 인 터페이스에 초기 응답 내용(initial reply content)을 표시한다. 본 실시예의 사용자 대화 중 정보 처리 방법의 수행 주체는 사용자 대화 중 정보 처리 장치일 수 있고, 상기 장 치는 사용자와 사용자의 대화에 기반하여 구현된 사용자 대화 시스템에 설정되어, 사용자 대화 중 정보 처리를 구현하여 사용자 대화 시스템의 지능성을 향상시킨다. 본 실시예의 사용자 대화 시스템은 다양한 적시 통신 응용 시스템(instant messaging application system)일 수 있고, 기존의 인간-기계 대화 시스템(man-machine dialogue system)과 다르다. 예를 들면, 인간-기계 대화는 인공 지능(Artificial Intelligence;AI) 분야의 하나의 상대적으로 성숙된 기술이고 대화 이해, 계획, 생성과 같은 기술을 구현할 수 있다. 현재 스마트 고객 서비스 및 다양한 특수 장면에서 대응하는 스마트 고객 서비스 기기가 설정될 수 있으며, 인간-기계 대화의 방식을 통해 서비스를 제공한다. 즉, 인간-기계 대화 시스템 (human-machine dialogue system)은 통상적으로 하나의 고정된 장면에 기반하여 설정되고, 어느 고정된 장면에 만 적용된다. 사용자 대화 시스템(user dialogue system)에서 대화 쌍방은 모두 사용자이고, 어떠한 장면의 제 약도 받지 않으므로 사용자 대화 시스템은 개방된 시스템에 적용된다. 따라서 어느 장면의 인간-기계 대화 시스 템 중 어느 기술을 사용자 대화 시스템에 직접 응용하는 것은 적용되지 않을 수 있다. 또한 사용자 대화 시스템의 요구를 고려할 때 사용자가 상대의 대화에 응답할 때 개인 능력 등 다양한 측면의 영향을 받으며, 상대를 편안하게 할 수 있는 응답 내용을 생성할 수 없다. 이를 바탕으로 본 실시예에서는 인간 -기계 대화의 지능성을 참조하고, 사용자 대화 시스템에서 사용자가 직접 참조하고 사용할 수 있도록 지능적으 로 응답 내용을 생성하는 기능을 설정하여 추가로 사용자 대화 중 응답 내용 생성의 유연성을 풍부하게 하고 사 용자 대화 중 지능성을 향상시킬 수 있다. 구체적으로, 먼저 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득하는 것이 필요하다. 본 실시예에 서 제1 사용자와 제2 사용자는 대화 쌍방이고 제1 사용자 측에서 초기 응답 내용을 생성하는 것을 예로 한다. 여기서 제1 사용자와 제2 사용자는 대화 쌍방의 사용자가 사용한 계정을 가리킬 수 있다. 구체적으로 사용자 대 화 시스템의 서버에서 현재 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득할 수 있다. 본 실시예의 대화 윗글 정보는 제2 사용자의 가장 가까운 이웃에 대한 정보를 포함할 수 있다. 또는 윗글 장면에 대한 이해 를 돕기 위해 제1 사용자 및 제2 사용자 쌍방의 각각의 최근의 적어도 하나의 정보가 포함될 수 있다. 본 실시예에서 제1 사용자에 의해 사용하는 목표 대화 전략을 획득하는 것은 제1 사용자 측의 대화 중 초기 응 답 내용을 생성하는데 사용되는 대화 전략이다. 본 실시예의 선택적인 대화 전략은 긍정, 부정, 완곡한 거부, 주제 이동 및 적어도 하나의 루틴(Routine, 套路) 대화 전략일 수 있다. 구체적으로 각 대화 전략에는 화술 특 성이 있다. 예를 들면, 루틴 대화 전략은 특정 전략을 사용하여 의도적으로 상대에게 함정을 설정하여 상대가 길이 함정에 빠지도록 하는 전략일 수 있다. 예를 들면, 서로 다른 루틴이 함정을 설정하는 방식은 다를 수 있 다. 또한 본 실시예의 루틴 대화 전략은 일반적으로 후속 복수의 문구 대화에 의해 지원되어야 한다. 다음으로 획득된 제1 사용자가 사용한 목표 전략과 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 상기 미리 훈련된 화술 생성 모델에 입력할 수 있으며, 상기 화술 생성 모델에 의해 대응하는 초기 응답 내용을 생성 한다. 상기 화술 생성 모델은 신경망에 기반하여 미리 훈련하여 얻는다. 훈련 과정에서 상기 화술 생성 모델은 대량의 훈련 데이터에 기반하여 다양한 전략과 대응하는 대화 윗글 정보에 기반하여 대응하는 응답 내용을 생성 하는 방법을 학습할 수 있다. 이러한 방식으로 상기 단계에서 사용되는 경우, 상기 화술 생성 모델은 입력된 목 표 전략 및 대화 윗글 정보에 기반하여 대응하는 초기 응답 내용을 생성할 수 있다. 상기 초기 응답 내용은 대화 윗글 정보를 참조할 뿐만 아니라 목표 전략을 참조하여 생성된 초기 응답 내용의 정확성을 효과적으로 보장 한다. 마지막으로 제1 사용자가 위치한 클라이언트로 초기 응답 내용을 전송하여 제1 사용자와 제2 사용자의 대화 인 터페이스에 초기 응답 내용을 표시하여 제1 사용자가 상기 초기 응답 내용을 참고할 수 있도록 한다. 제1 사용 자가 채팅에서 상기 초기 응답 내용을 사용하는데 동의하고, 상기 초기 응답 내용을 채팅 대화 상자에 복사한 다음 보내기를 클릭하여 제2 사용자가 제1 사용자와의 대화 인터페이스에서 상기 초기 응답 내용을 볼 수 있도 록 한다. 제1 사용자가 상기 초기 응답 내용을 조정하려는 경우 상기 초기 응답 내용을 채팅 대화 상자에 복사 하고 편집한 다음 보내기를 클릭할 수 있다. 예를 들면, 사용자 대화 시스템의 클라이언트의 인터페이스에 전략 선택 모듈이 표시되거나 사용자가 선택할 복 수개 전략이 직접 표시될 수 있다. 사용자가 이를 사용 중일 때 전략 중 하나를 목표 전략으로 선택하고 응답 내용 생성 버튼을 클릭할 수 있으며, 이때 사용자 대화 시스템의 서버 측 정보 처리 장치는 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득할 수 있다; 또한 제1 사용자 선택의 목표 대화 전략을 획득한다; 또한 목표 대화 전략 및 대화 윗글 정보에 기반하여 미리 훈련된 화술 생성 모델을 사용하여 생성 대응하는 초기 응 답 내용을 생성한다. 또한 제1 사용자가 위치한 클라이언트에 초기 응답 내용을 전송하여 제1 사용자와 상기 제 2 사용자의 대화 인터페이스에 초기 응답 내용을 표시하는 것이다. 본 실시예의 사용자 대화 중 정보 처리 방법은 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득하고; 제1 사용자가 채택한 목표 대화 전략을 획득하고; 목표 대화 전략 및 대화 윗글 정보에 따라 미리 훈련된 화술 생성 모델을 사용하여 대응하는 초기 응답 내용을 생성한다; 초기 응답 내용은 제1 사용자가 위치한 클라이언트 로 전송되어 제1 사용자와 제2 사용자의 대화 인터페이스에 초기 응답 내용을 표시한다. 본 실시예의 방안은 사 용자 대화 중 응답 내용을 지능적으로 생성하고, 사용자에게 완전히 의존하여 응답 내용을 생성할 필요가 없으 므로 사용자 대화 장면의 정보 처리의 유연성을 향상시킬 수 있고 사용자 대화 장면의 지능성을 보강한다. 도 2는 본 출원 제2 실시예의 개략도이다; 도 2에 나타낸 바와 같이, 본 실시예의 사용자 대화 중 정보 처리 방 법은 상기 도 1에 나타낸 실시예의 기술 방안에 기반하여 나아가 더욱 상세하게 본 출원의 기술 방안을 소개한 다. 도 2에 나타낸 바와 같이, 본 실시예의 사용자 대화 중 정보 처리 방법은 구체적으로 아래의 단계를 포함할 수 있다: 단계 S201, 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득한다; 단계 S202, 미리 훈련된 대화 전략 예측 모델 및 제1 사용자와 제2 사용자의 이력 대화 정보(historical dialogue information)를 사용하여 목표 대화 전략을 예측한다; 상기 단계 202는 상기 도 1에 나타낸 실시예의 단계 S102의 하나의 구현 방식이다. 구체적으로 그중 대화 전략 예측 모델은 신경망 모델에 기반하여 미리 훈련하여 얻는다. 그중 제1 사용자와 제2 사용자의 이력 대화 정보는 현재 대화 장면에서 현재 대화 이전의 가장 가까운 이웃의 적어도 한 쌍의 대화 정보를 포함할 수 있으며, 그중 한 쌍의 대화 정보는 한 구절 제1 사용자의 대화 및 한 구절 제2 사용자의 대화를 포함한다. 대화 전략 예측 모 델은 제1 사용자와 제2 사용자의 이력 대화 정보에 기반하여 양자의 대화 내용을 이해할 수 있으며 나아가 현재 이력 대화 내용에 기반하여 하나의 비교적 유효한 목표 대화 전략을 예측할 수 있다. 본 실시예의 상기 대화 전략 모델은 훈련할 경우 무수하게 많은 이력 대화 정보 및 대응하는 라벨링 된 목표 대 화 전략을 사용하여 상기 대화 전략 모델이 목표 대화 전략을 정확하게 예측할 수 있을 때까지 상기 대화 전략 모델을 지속적으로 훈련할 수 있다. 또한 선택적으로 상기 도 1에 나타낸 실시예의 단계 S102는 또한 제1 사용자가 미리 설정된 대화 전략 세트에서 선택한 목표 대화 전략을 획득할 수 있다. 예를 들면, 대화 인터페이스에 대화 전략 세트 중 복수의 대화 전략 이 설정되어 있고 제1 사용자는 대화 인터페이스에서 어느 한 대화 전략을 클릭하여 목표 대화 전략으로 선택할 수 있다. 사용자 대화 시스템의 서버가 상기 제1 사용자의 선택을 감지하면 상기 제1 사용자가 미리 설정된 대 화 전략 세트로부터 선택한 목표 대화 전략을 얻을 수 있다. 단계 S203, 목표 대화 전략 및 대화 윗글 정보에 따라 미리 훈련된 화술 생성 모델을 사용하여 대응하는 초기 응답 내용을 생성한다; 단계 S204, 초기 응답 내용에 대해 스타일 전환(style conversion)을 수행하여 목표 응답 내용으로 한다; 이때 사용자는 상기 목표 응답 내용을 대화 상자에 복제하고 클릭하여 전송한다. 이렇게 제2 사용자는 상기 사 용자의 목표 응답 내용을 볼 수 있다. 본 실시예의 스타일 전환은 미리 설정된 모듈을 사용하여 구현될 수도 있고, 또는 미리 설정된 스타일 전환 모 델을 사용하여 구현될 수도 있다. 예를 들면, 본 실시예의 스타일 전환은 지역 사랑 언어 스타일, 유머 스타일, 방언 스타일 등을 포함할 수 있다. 구체적으로 대응하는 스타일 전환 템플릿에서 설정 대응하는 스타일의 언어 특성을 설정할 수 있고, 나아가 초기 응답 내용에 대응하는 스타일 특성을 포함하는 언어 특성의 목표 응답 내 용으로 전환할 수 있다. 또는 본 실시예에서, 각 스타일에 대응하는 스타일 전환 모델을 미리 훈련할 수 있고, 스타일 전환 모델은 신경 망 모델에 기반하여 미리 훈련하여 얻는다. 상기 스타일의 스타일 전환 모델은 훈련할 경우 무수하게 많은 일반 설명 언어 자료 및 대응하는 상기 스타일의 언어 자료를 사용하여 훈련할 수 있으며, 상기 스타일 전환 모델로 하여금 상기 스타일의 언어 설명을 학습하도록 하여 사용시 초기 응답 내용을 수신한 후 상기 초기 응답 내용을 상기 스타일의 목표 응답 내용으로 전환할 수 있다. 또한 선택적으로 상기 단계 S204의 목표 응답 내용은 문자 형식이다. 실제 응용에서 목표 응답 내용은 이미지이 나 동영상의 형태일 수도 있다. 예를 들면, 선택적으로 본 실시예에는 또한 아래의 단계를 포함할수 있다: (a1) 초기 응답 내용에 기반하여 이미지 생성을 수행하여 초기 응답 내용의 키워드 정보를 휴대하는 이미지를 생성하여 목표 응답 내용으로 하며; 또는 (b1) 초기 응답 내용에 기반하여 동영상 생성을 수행하여 초기 응답 내용의 키워드 정보를 휴대하는 동영상을 생성하여 목표 응답 내용으로 한다. 선택적으로 본 실시예의 이미지 생성은 이미지 생성 템플릿 또는 이미지 생성 모델을 사용하여 구현할 수도 있 다. 우선, 키워드를 사용하여 모델을 추출하여 초기 응답 내용에서 키워드를 추출한다. 다음 추출된 키워드에 기반 하여 이미지 생성을 수행한다. 만약 이미지 생성 템플릿을 사용하여 이미지를 생성할 경우, 하나의 이미지 생성 템플릿을 선택할 수 있다. 다음 상기 이미지 생성 템플릿에 키워드를 끼워넣고 이미지 생성 템플릿 중 이미지 정보를 조정하여 상기 키워드의 표의 문자와 일치하도록 할 수 있다. 이미지 생성 모델을 사용하여 이미지를 생성할 경우 상기 이미지 생성 모델에 키워드를 입력하면 상기 이미지 생성 모델은 상기 키워드를 기반으로 하나의 적절한 이미지를 생성하여 출력할 수 있다. 상기 이미지 생성 모델 은 신경망 모델을 기반으로 미리 훈련하여 얻는다. 훈련할 경우, 무수하게 많은 키워드 및 대응하는 이미지를 사용하여 이미지 생성 모델로 하여금 어떤 키워드와 이미지가 사용되는지 학습하도록 하여 설명이 더욱 정확하 도록 한다. 이와 같이 사용할 경우 상기 이미지 생성 모델에 상기 키워드를 입력할 경우, 상기 이미지 생성 모 델은 이미 학습한 정보에 기반하여 키워드를 정확히 표현하기 위해 어떤 종류의 이미지가 사용될 수 있는지 예 측할 수 있다. 설명해야 할 점은 본 실시예에서 생성된 이미지에서 키워드 자체의 문자를 포함할 수 있으며 또는 키워드와 의 미가 같은 정보를 포함할 수도 있다. 단계 (b1)는 단계 (a1)의 구현 방식과 비슷하며 우선 키워드를 사용하여 모델 추출 초기 응답 내용 중 키워드를 추출할 수도 있다. 다음 미리 설정된 동영상 생성 템플릿 또는 동영상 생성 모델에 기반하여 초기 응답 내용을 휴대한 키워드 정보의 동영상을 생성하여 목표 응답 내용으로 한다. 구별점은 동영상은 연속된 복수개 그림으로 조성된 동적 효과라는 점을 제외하고 그 구현 과정은 상기 단계 (a1)와 같다. 그 동영상 생성 템플릿은 상기 이 미지 생성 템플릿의 관련 설명을 참조할 수 있고, 동영상 생성 모델은 상기 이미지 생성 모델의 관련 설명을 참 조할 수 있으며 여기서 생략한다. 본 실시예의 상기 단계 (a1) 또는 (b1)는 단계 S204를 대체할 수 있고, 서로 다른 형태의 목표 응답 내용을 사 용하여 사용자 대화의 채팅 내용을 풍부하게 하고 그 지능성을 보강한다. 단계 S205, 제1 사용자가 위치한 클라이언트에 목표 응답 내용을 전송하여 제1 사용자와 제2 사용자의 대화 인 터페이스에 목표 응답 내용을 표시한다; 단계 S206, 초기 응답 내용의 키워드에 기반하여 애니메이션 생성 모델을 사용하여 대응하는 애니메이션을 생성 한다; 단계 S207, 제1 사용자가 위치한 클라이언트에게 생성된 애니메이션을 전송하여 제1 사용자와 제2 사용자의 대 화 인터페이스에 애니메이션을 표시한다. 단계 S206-S207는 선택 가능한 방식으로서 상기 단계 S204-S205와 동시에 존재할 수도 있다. 설명해야 할 점은, 상기 단계 S204-S205 최종 생성된 목표 응답 내용은 제1 사용자와 제2 사용자의 대화 인터페이스의 대화 상자에 표시된다. 상기 단계 S206-S207는 대화 인터페이스를 풍부하게 하는데 사용되며 대화 인터페이스의 표시가 더욱 흥미롭게 만들고 사용자의 사용자 체험을 보강한다. 예를 들면, 초기 응답 내용의 키워드에 \"달리기(砲)\" 글자가 포함되어 있으면, 이때 애니메이션 생성 모델은 생 성 캐릭터가 달리는 애니메이션을 생성할 수 있다. 초기 응답 내용의 키워드에 \"사랑(愛)\" 글자가 포함되어 있 으면, 이때 애니메이션 생성 모델은 캐릭터가 사랑을 표현하는 애니메이션을 생성할 수 있다. 초기 응답 내용의 키워드에 \"당신을 보고 싶어요(想邇)\"라는 글자가 포함되어 있으면, 이때 애니메이션 생성 모델은 캐릭터가 보 고 싶음을 표현하는 애니메이션 등을 생성할 수 있다. 본 실시예의 애니메이션 생성 모델도 신경망에 기반하여 미리 훈련하여 얻는다. 훈련할 경우, 무수하게 많은 키 워드 및 대응하는 애니메이션을 사용하여 상기 애니메이션 생성 모델을 훈련하며, 상기 애니메이션 생성 모델로 하여금 어떤 종류의 애니메이션을 표현하기 위해 어떤 키워드를 사용해야 하는지를 학습할 수 있도록 한다. 또한, 선택적으로 본 실시예는 또한 아래의 단계를 포함할 수 있다: (a2) 감성 분석 모델(emotional analysis model)을 사용하여 제1 사용자와 제2 사용자의 이력 대화 정보에 기반 하여 제2 사용자의 감성 정보를 분석하고, 제1 사용자가 위치한 클라이언트에 제2 사용자의 감성 정보를 전송하 고 제1 사용자와 제2 사용자의 대화 인터페이스에 표시한다; 예를 들면, 제1 사용자와 제2 사용자의 대화에서 제1 사용자가 대화 과정에서 다른 일로 바쁘다면 제2 사용자의 대화 내용에서 제2 사용자의 정서를 주의 깊게 분석하지 못할 수 있다. 이때 본 실시예의 감성 분석 모델은 제1 사용자와 제2 사용자의 이력 대화 정보를 기반으로 제2 사용자의 감성 정보를 실시간으로 분석할 수 있다. 예를 들면 사용자의 감성이 적극적인지 거부적인지를 포함한다. 적극적이면 제2 사용자가 제1 사용자와의 채팅을 매 우 좋아하는 것을 표시한다. 거부적이면 제2 사용자가 다른 일로 바쁠 수 있으며 현재 채팅을 원하지 않는 것이다. 이때 제1 사용자는 대화 인터페이스에서 상기 제2 사용자의 감성 정보를 볼 수 있으며 제2 사용자가 거부하 면, 대화를 빠르게 종료할 수 있다. 제2 사용자가 적극적이면 대화를 계속할 수 있다. 설명해야 할 점은 상기 감성 분석 모델은 제1 사용자와 제2 사용자의 각 단락 이력 대화를 실시간으로 분석할 수 있으므로 전부 이력 대화에 대한 감성 분석을 실현한다. 각 단락 이력 대화는 적어도 한 쌍의 대화 정보를 포함할 수 있으며, 각 쌍의 대화 정보에는 제1 사용자 및 제2 사용자의 각각의 한마디가 포함된다. 예를 들면, 상기 감성 분석 모델은 분석된 제2 사용자의 감성 정보에 대응하는 이력 대화의 측면과 같은 대화 인터페이스에 표시하고, 사용자가 클릭하여 볼 수 있다. 또는 디스플레이 효과를 풍부하게 하기 위해 서로 다른 색상을 사용 하여 제2 사용자의 감성 정보를 보다 직관적으로 표시할 수도 있다. (b2) 주제 관심도 분석 모델(topic interest analysis model)을 사용하여 제1 사용자와 제2 사용자의 이력 대 화 정보를 기반으로 제2 사용자가 현재 주제에 관심이 있는지를 분석하고, 제1 사용자가 위치한 클라이언트에 제2 사용자의 현재 주제에 대해 관심이 있는지를 전송하며, 제1 사용자와 제2 사용자의 대화 인터페이스에 표시 한다; 및/또는 마찬가지로, 제1 사용자와 제2 사용자의 대화에서 제1 사용자는 제2 사용자가 현재 주제에 관심이 있는지 분석 하기를 원하며, 제2 사용자의 각 한마디 응답 내용을 주의 깊게 분석해야 한다. 사용자가 신중하게 분석하기를 원하지 않는 경우, 본 실시예의 주제 관심도 분석 모델의 도움으로 제2 사용자가 현재 주제에 관심이 있는지 여 부를 분석할 수 있다. 선택적으로 본 실시예에서 제1 사용자와 제2 사용자의 실시간 채팅 과정에서, 사용자 대화 시스템의 서버는 채 팅 내용에 관련된 주제에 기반하여 이력 대화 정보를 구분할 수 있다. 본 실시예의 이력 대화 정보는 주제의 이 력 대화 정보이다. 본 실시예의 주제 관심도 분석 모델은 이력 대화 정보에서 제1 사용자와 제2 사용자의 대화 정보에 기반하여 제2 사용자가 현재 주제에 관심이 있는지 여부를 분석할 수 있다. 분석 결과는 제1 사용자가 있는 클라이언트로 전송되어 제1 사용자와 제2 사용자의 대화 인터페이스에 표시된다. 이와 같이 제1 사용자는 분석 결과에 따라 제2 사용자와 현재 주제를 계속 얘기할지를 결정하고 제2 사용자가 현재 주제에 관심이 없는 경우 주제를 적시에 변경할 수 있어 사용자 대화의 지능성을 보강할 수 있다. 마찬가지로 제1 사용자와 제2 사용자의 채팅 과정에서, 주제 관심도 분석 모델을 사용하여 제2 사용자가 현재 주제에 관심이 있는지 여부를 실시간으로 분석할 수 있고 실시간으로 분석 결과를 제1 사용자 측, 제2 사용자와 의 대화 인터페이스에 표시할 수 있다. 또한 선택적으로 본 실시예에서 아래의 단계를 포함할 수도 있다: (c2) 주제 예측 모델(topic prediction model)을 사용하여 제1 사용자와 제2 사용자의 이력 대화 정보에 기반하여 예측 제2 사용자가 관심이 있는 목표 주제를 예측하고, 제1 사용자가 위치한 클라이언트로 제2 사용자가 관심 있는 목표 주제를 전송하며, 제1 사용 자와 제2 사용자의 대화 인터페이스에 표시한다. 본 실시예에서 주제 예측 모델을 사용하여 제2 사용자가 관심을 가질 수 있는 주제를 예측하고 제1 사용자 측, 제2 사용자와의 대화 인터페이스에 적시에 표시한다. 이러한 방식으로 제2 사용자가 관심을 가지는 주제를 변경 하여 제2 사용자와 대화할 수 있음을 제1 사용자에게 제시할 수 있으며, 대화의 지능성을 추가로 보강할 수 있 다. 설명해야 할 점은 상기 단계 (a2)-(c2)와 상기 도 2에 나타낸 실시예의 단계 S201-S206는 선후 순서의 관계가 없다. 단계 (a2)-(c2)에서 각각의 단계는 각각 독립적으로 시행될 수 있고 상호 조합할 수도 있으며, 실시간으 로 제1 사용자와 제2 사용자의 이력 대화 정보에 기반하여 실시간으로 분석 또는 예측하며, 분석 결과 또는 예 측 결과를 실시간으로 제1 사용자가 위치한 클라이언트로 전송하며, 제1 사용자와 제2 사용자의 대화 인터페이 스에 표시한다. 이러한 방식으로 제1 사용자는 실시간으로 이러한 정보를 실시간으로 획득할 수 있고 분석 결과 또는 예측 결과를 참고하여 제2 사용자와 채팅하며 사용자 대화의 지능성을 추가로 보강한다. 예를 들면, 본 실시예의 상기 전부 모델은 모두 신경망 모델이고 전부 모델의 훈련은 한 단계의 훈련만 통해 완 료되거나 또는 사전 훈련(pre-training) 및 미세 조정(fine-tuning) 두개 단계의 훈련을 통해 훈련을 완료될 수 도 있다. 본 실시예의 사용자 대화 중 정보 처리 방법은 상기 기술 방안을 사용하여 사용자 대화의 장면에서 일부 모델을 사용하여 지능적으로 분석 및 예측을 구현하여 사용자 대화에서 사용자도 분석 및 예측의 결과에 기반하여 더욱 효과적인 대화를 수행하며, 사용자 대화의 장면을 효과적으로 풍부하게 할 수 있고, 사용자 대화 중 처리의 유 연성을 보강하여 사용자 대화에서 지능성 및 사용자 대화의 효율을 향상시킨다. 도 3은 본 출원 제3 실시예에 따른 개략도이다; 본 실시예는 사용자 대화 중 정보 처리 장치를 제공하며, 상기 장치는: 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득하는데 사용되는 정보 획득 모듈 ; 제1 사용자가 사용한 목표 대화 전략을 획득하는데 사용되는 전략 획득 모듈; 목표 대화 전략 및 대화 윗글 정보에 따라 미리 훈련된 화술 생성 모델을 사용하여 대응하는 초기 응답 내용을 생성하는 생성 모듈; 제1 사용자가 위치한 클라이언트에 초기 응답 내용을 전송하여 제1 사용자와 제2 사용자의 대화 인터페이스에 초기 응답 내용을 표시하는데 사용되는 전송 모듈을 포함한다. 본 실시예의 사용자 대화 중 정보 처리 장치의 상기 모듈을 사용하여 사용자 대화 중 정보를 처리하는 구 현 원리 및 기술 효과는 상기 관련 방법 실시예의 구현과 같으며 상기 관련 방법 실시예의 기재를 참조할 수 있 으므로 여기서 생략한다. 도 4는 본 출원 제4 실시예에 따른 개략도이다; 도 4에 나타낸 바와 같이, 본 실시예의 사용자 대화 중 정보 처 리 장치는 상기 도 3에 나타낸 실시예의 기술 방법을 기반으로 추가로 더욱 상세하게 본 출원의 기술 방안 을 설명한다. 본 실시예의 사용자 대화 중 정보 처리 장치에서 전략 획득 모듈은: 제1 사용자가 미리 설정된 대화 전략 세트에서 선택한 목표 대화 전략을 획득하거나; 또는 미리 훈련된 대화 전략 예측 모델 및 제1 사용자와 제2 사용자의 이력 대화 정보를 사용하여 예측 목표 대화 전 략을 예측하는데 사용된다. 추가로 선택적으로, 본 실시예의 사용자 대화 중 정보 처리 장치에는 또한: 초기 응답 내용에 대하여 스타일 전환을 수행하여 목표 응답 내용으로 하는데 사용되는 스타일 전환 모듈; 초기 응답 내용에 기반하여 이미지 생성을 수행하여 초기 응답 내용의 키워드 정보를 포함하는 이미지를 생성하 여 목표 응답 내용으로 하는데 사용되는 이미지 생성 모듈; 또는 초기 응답 내용에 기반하여 동영상 생성을 수행하여 초기 응답 내용의 키워드 정보를 포함하는 동영상을 생성하 여 목표 응답 내용으로 하는 동영상 생성 모듈을 포함한다. 추가로 선택적으로 본 실시예의 사용자 대화 중 정보 처리 장치에는 또한: 초기 응답 내용의 키워드에 기반하여 애니메이션 생성 모델을 사용하여 대응하는 애니메이션을 생성하는 애니메 이션 생성 모듈; 제1 사용자가 위치한 클라이언트에 생성된 애니메이션을 전송하고, 제1 사용자와 제2 사용자의 대화 인터페이스 에 애니메이션을 표시하는데 사용되는 전송 모듈을 포함한다. 추가로 선택적으로 본 실시예의 사용자 대화 중 정보 처리 장치에는 또한: 감성 분석 모델을 사용하여 제1 사용자와 제2 사용자의 이력 대화 정보에 기반하여 제2 사용자의 감성 정보를 분석한다; 및/또는 주제 관심도 분석 모델을 사용하여 제1 사용자와 제2 사용자의 이력 대화 정보에 기반하여 제2 사용자가 현재 주제에 관심이 있는지 여부를 분석하는데 사용되는 분석 모듈; 제1 사용자가 위치한 클라이언트에 제2 사용자의 감성 정보를 전송하고 제1 사용자와 제2 사용자의 대화 인터페 이스에 표시한다; 및/또는 제1 사용자가 위치한 클라이언트에 제2 사용자가 현재 주제에 관심이 있는지 여부를 전송하고, 제1 사용자와 제2 사용자의 대화 인터페이스에 표시하는데 사용되는 전송 모듈을 포함한다. 추가로 선택적으로 본 실시예의 사용자 대화 중 정보 처리 장치는 또한: 주제 예측 모델을 사용하고 제1 사용자와 제2 사용자의 이력 대화 정보에 기반하여 제2 사용자가 관심 있는 목 표 주제를 예측하는 예측 모듈; 제1 사용자가 위치한 클라이언트에 제2 사용자가 관심 있는 목표 주제를 전송하고, 제1 사용자와 제2 사용자의 대화 인터페이스에 표시하는데 사용되는 전송 모듈을 포함한다. 본 실시예의 사용자 대화 중 정보 처리 장치는 상기 모듈을 사용하여 사용자 대화 중 정보를 처리하는 구 현 원리 및 기술 효과와 상기 관련 방법 실시예의 구현은 같으며 상세한 내용은 상기 관련 방법 실시예의 기재 를 참조할 수 있으므로 여기서 생략한다. 본 출원의 실시예에 따르면 본 출원은 전자 기기 및 판독 가능 기록 매체를 제공한다. 도 5에 나타낸 바와 같이 본 출원 실시예의 상기 방법을 구현하는 전자 기기의 블럭도이다. 전자 기기는 예를 들면 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크 스테이션, 개인 디지털 보조기, 서버, 블레이드 서버, 대형 컴퓨터 및 기타 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 나타낸다. 전자 기기 또한 예를 들면 개인 디지 털 처리기, 셀폰, 스마트 전화, 웨어러블 기기 및 기타 유사한 계산 장치와 같은 다양한 형태의 모바일 장치를 나타낼 수 있다. 본 명세서에 나타낸 구성 요소, 이들의 연결과 관계 및 이들의 기능은 단지 예일 뿐이며, 본 명세서에서 기술하거나 및/또는 요구하는 본 발명의 구현을 한정하려는 것이 아니다. 도 5에 나타낸 바와 같이 당해 전자 기기는 하나 또는 복수의 프로세서, 메모리 및 각각의 구성 요소 를 연결하기 위한 인터페이스를 구비하며, 당해 인터페이스는 고속 인터페이스 및 저속 인터페이스를 포함한다. 각각의 구성 요소는 서로 다른 버스를 통해 상호 연결되며, 공통 마더 보드에 설치되거나 또는 수요에 따라 기 타 방식으로 설치된다. 프로세서 전자기기 내에서 수행되는 명령에 대해 처리를 수행할 수 있으며, 메모리 내에 기억되어 외부 입력/출력 장치(예를 들면 인터페이스에 연결된 디스플레이 기기) 상에 GUI의 그래픽 정보를 표 시하기 위한 명령을 포함한다. 기타 실시 방식에 있어서, 필요할 경우, 복수의 프로세서 및/또는 복수의 버스와 복수의 메모리를 함께 사용할 수 있다. 마찬가지로, 복수의 전자 기기를 연결할 수 있으며, 각각의 기기는 부분 적인 필요한 조작(예를 들면, 서버 어레이, 일 그룹의 블레이드 서버, 또는 다중 프로세서 시스템)을 제공한다. 도 5에서는 하나의 프로세서의 예를 들었다. 메모리는 본 출원에 의해 제공되는 비 일시적 컴퓨터 판독 가능 기록 매체이다. 여기서, 상기 메모리에는 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기억되어 있으며, 상기 적어도 하나의 프로세서로 하여금 본 출원에 의해 제공되는 언어 모델에 기반하여 단어 벡터를 획득하는 방법을 수행하도록 한다. 본 출원의 비 일시적 컴퓨터 판독 가능 기록 매체는 컴퓨터 명령을 기억하며, 상기 컴퓨터 명령은 컴퓨터로 하여금 본 출원에의해 제공되는 사용자 대화 중 정보 처리 방법을 수행하도록 한다. 메모리는 일종의 비 일시적 컴퓨터 판독 가능 기록 매체로서, 비 일시적 소프트웨어 프로그램, 비 일시적 컴퓨터 수행 가능 프로그램 및 모듈을 기억하는데 사용될 수 있는 바, 예를 들면 본 출원 실시예의 사용자 대화 중 정보 처리 방법에 대응하는 프로그램 명령/모듈(예를 들면, 도 3 및 도 4에 나타낸 관련 모듈)을 기억하는데 사용될 수 있다. 프로세서는 메모리 내에 기억된 비 일시적 소프트웨어 프로그램, 명령 및 모듈을 운 행함으로써, 서버의 다양한 기능 응용 및 데이터 처리를 수행하는 바, 상술한 방법 실시예의 사용자 대화 중 정 보 처리 방법을 구현한다. 메모리는 프로그램 기억 영역 및 데이터 기억 영역을 포함할 수 있으며, 여기서, 프로그램 기억 영역은 운 영 체제 및 적어도 하나의 기능에 필요한 앱을 기억할 수 있고, 데이터 기억 영역은 사용자 대화 중 정보 처리 방법을 구현하는 전자 기기의 사용을 통해 생성된 데이터 등을 기억할 수 있다. 또한, 메모리는 고속 랜덤 액세스 메모리를 포함할 수 있고, 비 일시적 메모리를 더 포함할 수 있는 바, 예를 들면 적어도 하나의 자기 디 스크 저장 장치, 플래시 장치, 또는 기타 비 일시적 고체 저장 장치를 포함할 수 있다. 일부 실시예에 있어서, 메모리는 상대적으로 프로세서에 대해 원격 설치한 메모리를 포함할 수 있으며, 이러한 원격 메모리 는 네트워크를 통해 사용자 대화 중 정보 처리 방법을 구현하는 전자 기기에 연결될 수 있다. 상술한 네트워크 의 실시예는 인터넷, 기업 인트라 넷, 근거리 통신망, 이동 통신 네트워크 및 이들의 조합을 포함하나 이에 한 정되지 않는다. 사용자 대화 중 정보 처리 방법을 구현하는 전자 기기는 입력 장치 및 출력 장치를 더 포함할 수 있 다. 프로세서, 메모리, 입력 장치 및 출력 장치는 버스 또는 다른 방식을 통해 연결될 수 있으며 도 5에서는 버스를 통해 연결하는 예를 들었다. 입력 장치는 입력된 디지털 또는 문자 정보를 수신하고 또한 사용자 대화 중 정보 처리 방법을 구현하는 전자 기기의 유저 설정 및 기능 제어에 관한 키 신호 입력을 생성할 수 있다. 예를 들면 터치 스크린, 키패드, 마우스, 트랙 패드, 터치 패드, 포인팅 스틱, 하나 또는 복수의 마우스 버튼, 트랙볼, 조이스틱 등 입력 장치를 포함할 수 있다. 출력 장치는 디스플레이 기기, 보조 조명 장치(예를 들면 LED) 및 촉각 피드백 장치(예를 들면 진동 모터) 등을 포함할 수 있다. 당해 디스플레이 기기는 액정 디스플레이(LCD), 발광 다이오드(LED) 디 스플레이 및 등 플라즈마 디스플레이를 포함할 수 있으나 이에 한정되지 않는다. 일부 실시 방식에 있어서, 디 스플레이 기기는 터치 스크린일 수 있다. 여기서 설명하는 시스템 및 기술의 다양한 실시 방식은 디지털 전자 회로 시스템, 집적 회로 시스템, 전용 ASIC(전용 집적 회로), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다양한 실시 형태는 하나 또는 복수의 컴퓨터 프로그램에서 실시되고, 당해 하나 또는 복수의 컴퓨터 프로그램 은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템 상에서 수행 및/또는 해석될 수 있 으며, 당해 프로그램 가능 프로세서는 전용 또는 일반 프로그램 가능 프로세서일 수 있고, 기억 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 또한 데이터 및 명령 을 당해 기억 시스템, 당해 적어도 하나의 입력 장치 및 당해 적어도 하나의 출력 장치에 전송할 수 있다. 이러한 계산 프로그램 (프로그램, 소프트웨어, 소프트웨어 응용 또는 코드로도 불림)은 프로그램 가능 프로세서 의 기계 명령을 포함하며, 또한 고급 과정 및/또는 객체 지향 프로그래밍 언어 및/또는 어셈블리/기계 언어를 이용하여 이러한 계산 프로그램을 실시할 수 있다. 본 명세서에서 사용되는 “기계 판독 가능 매체” 및 “컴퓨 터 판독 가능 매체”와 같은 용어는, 기계 명령 및/또는 데이터를 프로그램 가능 프로세서의 임의의 컴퓨터 프 로그램 제품, 기기 및/또는 장치(예를 들면, 자기 디스크, 광 디스크, 메모리, 프로그램 가능 논리 장치(PLD)) 에 제공하기 위한 것을 의미하며, 기계 판독 가능 신호로서의 기계 명령을 수신하는 기계 판독 가능 매체를 포 함한다. “기계 판독 가능 신호”와 같은 용어는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서에 제공하 기 위한 임의의 신호를 의미한다. 유저와의 대화를 제공하기 위하여, 컴퓨터 상에서 여기서 설명하는 시스템 및 기술을 실시할 수 있으며, 당해 컴퓨터는 유저에게 정보를 표시하기 위한 디스플레이 장치(예를 들면 CRT(음극선관) 또는 LCD(액정 디스플레이) 모니터) 및 키보드와 포인팅 장치(예를 들면, 마우스 또는 트랙볼)를 구비할 수 있으며, 유저는 당해 키보드 및 당해 포인팅 장치를 통해 입력을 컴퓨터에 제공할 수 있다. 기타 유형의 장치는 또한 유저와의 대화를 제공하는 데 사용될 수 있다. 예를 들면, 유저에 제공하는 피드백은 임의의 형태의 감각 피드백(예를 들면, 시각적 피드 백, 청각적 피드백, 또는 촉각 피드백)일 수 있으며, 또한 임의의 형태(음향 입력, 음성 입력 또는 촉각 입력을 포함함)를 통해 유저로부터의 입력을 수신할 수 있다. 여기서 설명하는 시스템 및 기술을 백엔드 구성 요소를 포함하는 계산 시스템(예를 들면 데이터 서버), 또는 미 들웨어 구성 요소를 포함하는 계산 시스템(예를 들면 응용 서버), 또는 프런트 엔드 구성 요소를 포함하는 계산 시스템(예를 들면 그래픽 유저 인터페이스 또는 웹 브라우저를 구비하는 유저 컴퓨터인 바, 유저는 당해 그래픽 유저 인터페이스 또는 당해 웹 브라우저를 통해 여기서 설명하는 시스템 및 기술의 실시 방식과 대화함), 또는 이러한 백엔드 구성 요소, 미들웨어 구성 요소, 또는 프런트 엔드 구성 요소의 임의의 조합을 포함하는 계산 시 스템에서 실시할 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신 (예를 들면, 통신 네트워크)을 통해 시 스템의 구성 요소를 상호 연결할 수 있다. 통신 네트워크의 예는 근거리 통신망(LAN), 광역 통신망(WAN) 및 인 터넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있 고, 또한 일반적으로 통신 네트워크를 통해 대화를 수행한다. 해당하는 컴퓨터 상에서 운행되고, 또한 클라이언 트-서버 관계를 갖는 컴퓨터 프로그램을 통해 클라이언트와 서버의 관계를 발생시킬 수 있다. 본 출원 실시예의 기술 방안에 따르면 제1 사용자와 제2 사용자의 대화 중 대화 윗글 정보를 획득하고; 제1 사 용자가 채용한 목표 대화 전략을 획득하며; 목표 대화 전략 및 대화 윗글 정보에 기반하여 미리 훈련된 화술 생 성 모델을 사용하여 대응하는 초기 응답 내용을 생성하며; 제1 사용자가 위치한 클라이언트에 초기 응답 내용을 전송하여 제1 사용자와 제2 사용자의 대화 인터페이스에 초기 응답 내용을 표시한다. 본 실시예의 방안에 따르 면 지능적으로 사용자 대화 중 응답 내용을 생성할 수 있고, 사용자에게 완전히 의존하여 응답 내용을 생성할 필요가 없으므로 사용자 대화 장면의 정보 처리의 유연성을 향상시킬 수 있고 사용자 대화 장면의 지능성을 보 강한다. 본 출원 실시예의 기술 방안에 따르면 상기 기술 방안을 사용하여 사용자 대화의 장면에서 일부 모델을 사용하 여 지능적인 분석 및 예측을 구현하므로 사용자 대화 중 사용자도 분석 및 예측의 결과에 기반하여 더욱 효과적 으로 대화하도록 하여 사용자 대화의 장면을 효과적으로 풍부하게 하고 사용자 대화 중 처리의 유연성을 보강하 며 사용자 대화 중 지능성을 향상시키고 사용자 대화의 효율을 향상시킨다. 상기에 나타낸 다양한 형태의 흐름을 이용하여 단계를 재정렬, 증가 또는 삭제할 수 있음을 이해해야 한다. 예 를 들면, 본 출원에 기재된 각각의 단계는 병렬로 수행되거나 또는 차례로 수행되거나 또는 다른 순서로 수행될 수 있으며, 본 출원이 개시하는 기술 방안이 원하는 결과를 구현할 수 있는 한, 본 명세서는 이에 대해 한정하 지 않는다. 상술한 구체적인 실시 방식은 본 출원의 보호 범위를 한정하지 않는다. 당업자는 설계 요건 및 기타 요인에 따 라 다양한 수정, 조합, 서브 조합 및 대체를 수행할 수 있음을 이해해야 한다. 본 출원의 정신 및 원칙 내에서 이루어진 임의의 수정 동등한 대체 및 개선 등은 모두 본 발명의 보호 범위 내에 포함되어야 한다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2021-0090415", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이미지는 본 방안을 더욱 잘 이해하기 위해 제공되며 본 출원을 한정하지 않는다. 여기서: 도 1은 본 출원 제1 실시예에 따른 순서도이다; 도 2는 본 출원 제2 실시예에 따른 순서도이다; 도 3은 본 출원 제3 실시예에 따른 구성도이다; 도 4는 본 출원 제4 실시예에 따른 구성도이다; 도 5는 본 출원 실시예의 상기 방법을 구현하는 전자 기기의 블럭도이다."}
