{"patent_id": "10-2023-0101798", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0082167", "출원번호": "10-2023-0101798", "발명의 명칭": "사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법 및 시스템", "출원인": "주식회사 엘젠", "발명자": "김남현"}}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "카메라를 이용하여, 실제 공간에 방문한 사용자의 얼굴 이미지를 센싱하는 단계;사용자 DB로부터 상기 얼굴 이미지에 대응되는 사용자의 할일 정보를 추출하는 단계;상기 할일 정보를 이용하여, 상기 실제 공간에 방문한 상기 사용자의 공간 방문 목적을 특정하는 단계; 및상기 실제 공간에 대응되는 가상 공간 상에서, 디지털 휴먼을 통해 상기 공간 방문 목적에 대응되는 가이드 정보를 제공하는 단계를 포함하는 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법."}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 공간 방문 목적은, 상기 할일 정보에 포함된 업무가, 상기 실제 공간에서 처리되는 기능에 대응되는 것에 근거하여 특정되는 특징으로 하는 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법."}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,저장부에는, 복수의 실제 공간 각각에서 종사하는 종사자에 대한 인물 정보가 존재하고, 상기 디지털 휴먼은, 상기 사용자가 방문한 상기 실제 공간에서 종사하는 종사자의 인물 정보에 근거하여 생성되는 것을 특징으로 하는 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법."}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 디지털 휴먼은, 복수의 대화 방식 중 어느 하나의 대화 방식으로 상기 가이드 정보를 제공하며, 상기 복수의 대화 방식은, 어조, 억양, 대화 속도, 대화체, 동작 및 표정 중 적어도 하나가 다른 것을 특징으로하는 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법."}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 얼굴 이미지로부터 상기 사용자의 감정 정보를 추출하는 단계를 더 포함하고, 상기 디지털 휴먼의 대화 방식은, 상기 사용자의 감정 정보가 제1 감정에 대응되는 경우, 상기 제1 감정에 대응되는 대화 방식에 해당하고, 상기 사용자의 감정 정보가 상기 제1 감정과는 다른 제2 감정에 대응되는 경우, 상기 제2 감정에 대응되는 대화방식에 해당하는 것을 특징으로 하는 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법."}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 할일 정보를 이용하여, 상기 사용자가 방문한 상기 실제 공간 외에 다른 실제 공간에서 처리되는 기능을더 특정하고,공개특허 10-2024-0082167-3-상기 사용자가 방문한 상기 실제 공간에 대응되는 제1 가상 공간 및 상기 다른 실제 공간에 대응되는 제2 가상공간을 생성하는 것을 특징으로 하는 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법."}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제1 가상 공간에서 상기 공간 방문 목적에 대응되는 가이드 정보의 제공이 종료되는 것에 근거하여, 상기제1 가상 공간을 상기 제2 가상 공간으로 전환하는 것을 특징으로 하는 사용자 공간 방문 목적에 근거한 디지털휴먼 제공 방법."}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제2 가상 공간에서는, 상기 다른 실제 공간에서 종사하는 종사자의 인물 정보에 근거하여 생성된 디지털 휴먼에 의해, 상기 다른 실제공간에서 처리되는 기능에 대응되는 가이드 정보가 제공되는 것을 특징으로 하는 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법."}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "카메라로부터, 실제 공간에 방문한 사용자의 얼굴 이미지를 수신하는 통신부; 및사용자 DB로부터 상기 얼굴 이미지에 대응되는 사용자의 할일 정보를 추출하는 제어부를 포함하고, 상기 제어부는, 상기 할일 정보를 이용하여, 상기 실제 공간에 방문한 상기 사용자의 공간 방문 목적을 특정하고, 상기 실제 공간에 대응되는 가상 공간 상에서, 디지털 휴먼을 통해 상기 공간 방문 목적에 대응되는 가이드 정보를 제공하는 것을 특징으로 하는 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 시스템."}
{"patent_id": "10-2023-0101798", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자기기에서 하나 이상의 프로세스에 의하여 실행되며, 컴퓨터로 판독될 수 있는 매체에 저장 가능한 프로그램으로서,상기 프로그램은,카메라를 이용하여, 실제 공간에 방문한 사용자의 얼굴 이미지를 센싱하는 단계;사용자 DB로부터 상기 얼굴 이미지에 대응되는 사용자의 할일 정보를 추출하는 단계;상기 할일 정보를 이용하여, 상기 실제 공간에 방문한 상기 사용자의 공간 방문 목적을 특정하는 단계; 및상기 실제 공간에 대응되는 가상 공간 상에서, 디지털 휴먼을 통해 상기 공간 방문 목적에 대응되는 가이드 정보를 제공하는 단계를 수행하는 명령어들을 포함하는 것을 특징으로 하는 컴퓨터로 판독될 수 있는 기록매체에저장된 프로그램."}
{"patent_id": "10-2023-0101798", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "위에서 살펴본 과제를 해결하기 위하여, 본 발명에 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법은, 카메라를 이용하여, 실제 공간에 방문한 사용자의 얼굴 이미지를 센싱하는 단계, 사용자 DB로부터 상기 얼굴 이 미지에 대응되는 사용자 정보를 추출하는 단계, 상기 사용자 정보를 이용하여, 상기 실제 공간에 방문한 상기 사 용자의 공간 방문 목적을 특정하는 단계 및 상기 실제 공간에 대응되는 가상 공간 상에서, 디지털 휴먼을 통해 상기 공간 방문 목적에 대응되는 가이드 정보를 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0101798", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 디지털 휴먼(Digital Human)을 통해, 공간을 방문한 사용자의 방문 목적, 감정 상황에 맞는 대응을 수행하는 디지털 휴먼 제공 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2023-0101798", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기술이 발전함에 따라, 전자기기(예를 들어, 스마트폰, 태블릿 PC, 자동화 기기 등)의 보급이 대중화되었으며, 이에 따라 일상생활의 많은 부분에서 전자기기에 대한 의존도가 점차적으로 높아지고 있다. 특히, 디스플레이 기술의 발전으로 사용자는 평면 이미지 뿐만 아니라, 다양한 수단을 통해 3차원적 이미지 및 3차원적 공간을 볼 수 있다. 이에 따라, 사용자에게 3차원적인 시각적 사용자 경험을 제공하기 위해 가상 현실 (virtual reality) 및 증강 현실(augmented reality) 서비스가 제공되고 있다. 이처럼 현재 3차원적 공간을 경 험하는 것은 사용자 경험의 새로운 트렌드가 되었으며, 사용자는 가상 공간에서 시뮬레이션하고, 시각적 및 기 타 감각적 경험을 제공받고, 가상 이미지와 상호 작용할 수 있다. 더 나아가, 위의 개념들을 모두 포괄하며 혼합 현실 환경을 제공하는 대표적인 서비스로서, 메타버스 (metaverse)가 있다. 이 메타버스는 가공, 추상을 의미하는 '메타(meta)'와 현실세계를 의미하는 '유니버스 (universe)'의 합성어로 3차원 가상 공간과 현실 공간의 연결을 의미한다. 메타버스는 기존의 가상 현실 환경 (virtual reality environment)이라는 용어보다 진보된 개념으로서, 웹과 인터넷 등의 가상세계가 현실세계에 흡수된 상술한 혼합 현실 환경(mixed reality environment)을 제공한다. 메타버스(metaverse)는 사용자의 참여에 따라 무한한 확장이 가능하며, 캐릭터, 환경 및 공간 등을 자유자재로 선택할 수 있다. 예를 들어, 사용자는 지형을 생성하고, 지형에 원하는 자연물 및 시설물 등을 배치할 수 있다. 한편, 디지털 휴먼은 가상 공간의 다른 사용자가 보고 상호 작용할 수 있는 사용자의 그래픽 표현의 하나의 방 법이며, 현실 공간의 사용자는 디지털 휴먼을 사용하여 가상 공간의 다른 사용자의 디지털 휴먼들과 상호 작용 하거나, 해당 가상 공간에서의 각종 경제 활동, 문화 활동, 교육 활동 등을 수행할 수 있다. 대한민국 공개특허 제10-2022-0112099호(실재감 있는 디지털 휴먼 튜터 생성 방법 및 시스템)에서는, 교수의 얼 굴 영상을 이용하여 생성된 디지털 휴먼으로 강의를 하는 기술이 개시되어 있다. 최근에는, 은행, 관공서 등 특정 목적을 가지는 공간에서 사용자의 업무 처리에 디지털 휴먼을 이용하고자 하는 니즈가 증가하고 있다."}
{"patent_id": "10-2023-0101798", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 디지털 휴먼에 의해 사용자의 업무 처리를 안내할 수 있는 디지털 휴먼 제공 방법 및 시스템을 제공 하기 위한 것이다. 특히, 본 발명은, 사용자의 공간 방문 목적에 따른 맞춤형 대응 서비스를 수행할 수 있는 디지털 휴먼 제공 방 법 및 시스템을 제공하기 위한 것이다. 나아가, 본 발명은 사용자의 감정을 고려하여 대응 서비스를 수행할 수 있는 디지털 휴먼 제공 방법 및 시스템 을 제공하기 위한 것이다."}
{"patent_id": "10-2023-0101798", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "위에서 살펴본 과제를 해결하기 위하여 본 발명에 따른 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법 은, 카메라를 이용하여, 실제 공간에 방문한 사용자의 얼굴 이미지를 센싱하는 단계, 사용자 DB로부터 상기 얼 굴 이미지에 대응되는 사용자 정보를 추출하는 단계, 상기 사용자 정보를 이용하여, 상기 실제 공간에 방문한 상기 사용자의 공간 방문 목적을 특정하는 단계 및 상기 실제 공간에 대응되는 가상 공간 상에서, 디지털 휴먼 을 통해 상기 공간 방문 목적에 대응되는 가이드 정보를 제공하는 단계를 포함할 수 있다. 나아가, 상기 공간 방문 목적은, 상기 사용자 정보에 포함된 업무가, 상기 실제 공간에서 처리되는 기능에 대응 되는 것에 근거하여 특정될 수 있다. 나아가, 저장부에는, 복수의 실제 공간 각각에서 종사하는 종사자에 대한 인물 정보가 존재하고, 상기 디지털 휴먼은, 상기 사용자가 방문한 상기 실제 공간에서 종사하는 종사자의 인물 정보에 근거하여 생성될 수 있다. 나아가, 상기 디지털 휴먼은, 복수의 대화 방식 중 어느 하나의 대화 방식으로 상기 가이드 정보를 제공하며, 상기 복수의 대화 방식은, 어조, 억양, 대화 속도, 대화체, 동작 및 표정 중 적어도 하나가 다를 수 있다. 나아가, 상기 얼굴 이미지로부터 상기 사용자의 감정 정보를 추출하는 단계를 더 포함하고, 상기 디지털 휴먼의 대화 방식은, 상기 사용자의 감정 정보가 제1 감정에 대응되는 경우, 상기 제1 감정에 대응되는 대화 방식에 해 당하고, 상기 사용자의 감정 정보가 상기 제1 감정과는 다른 제2 감정에 대응되는 경우, 상기 제2 감정에 대응되는 대화 방식에 해당할 수 있다. 나아가, 상기 사용자 정보를 이용하여, 상기 사용자가 방문한 상기 실제 공간 외에 다른 실제 공간에서 처리되 는 기능을 더 특정하고, 상기 사용자가 방문한 상기 실제 공간에 대응되는 제1 가상 공간 및 상기 다른 실제 공 간에 대응되는 제2 가상 공간을 생성할 수 있다. 나아가, 상기 제1 가상 공간에서 상기 공간 방문 목적에 대응되는 가이드 정보의 제공이 종료되는 것에 근거하 여, 상기 제1 가상 공간을 상기 제2 가상 공간으로 전환할 수 있다. 나아가, 상기 제2 가상 공간에서는, 상기 다른 실제 공간에서 종사하는 종사자의 인물 정보에 근거하여 생성된 디지털 휴먼에 의해, 상기 다른 실제 공간에서 처리되는 기능에 대응되는 가이드 정보가 제공될 수 있다. 한편, 본 발명에 따른 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 시스템은, 카메라로부터, 실제 공간에 방문한 사용자의 얼굴 이미지를 수신하는 통신부 및 사용자 DB로부터 상기 얼굴 이미지에 대응되는 사용자 정보 를 추출하는 제어부를 포함하고, 상기 제어부는, 상기 사용자 정보를 이용하여, 상기 실제 공간에 방문한 상기 사용자의 공간 방문 목적을 특정하고, 상기 실제 공간에 대응되는 가상 공간 상에서, 디지털 휴먼을 통해 상기 공간 방문 목적에 대응되는 가이드 정보를 제공할 수 있다. 한편, 본 발명에 따른 프로그램은, 전자기기에서 하나 이상의 프로세스에 의하여 실행되며, 컴퓨터로 판독될 수 있는 매체에 저장 가능한 프로그램으로서, 카메라를 이용하여, 실제 공간에 방문한 사용자의 얼굴 이미지를 센 싱하는 단계, 사용자 DB로부터 상기 얼굴 이미지에 대응되는 사용자 정보를 추출하는 단계, 상기 사용자 정보를 이용하여, 상기 실제 공간에 방문한 상기 사용자의 공간 방문 목적을 특정하는 단계; 및 상기 실제 공간에 대응 되는 가상 공간 상에서, 디지털 휴먼을 통해 상기 공간 방문 목적에 대응되는 가이드 정보를 제공하는 단계를 수행하는 명령어들을 포함할 수 있다."}
{"patent_id": "10-2023-0101798", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법은, 카메라를 이용하여, 공간에 방문한 사용자의 얼굴 이미지를 센싱하고, 사용자 DB로부터 상기 얼굴 이미지에 대응되는 사용자 정보를 추출하여, 사 용자의 공간 방문 목적을 특정할 수 있다. 이와 같이, 본 발명은 사용자로부터 공간 방문 목적을 입력 받는 과 정을 생략할 수 있다. 따라서, 사용자는 공간 방문 목적을 일일이 설명하지 입력하지 않더라도, 업무 처리에 필 요한 안내 서비스를 제공받을 수 있고, 서비스를 제공하는 공간에서는 서비스 제공 시간을 단축시킬 수 있다. 나아가, 본 발명에 따른 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법은, 공간과 관련된 디지털 휴먼 을 통해, 사용자의 공간 방문 목적에 대응되는 가이드 정보를 제공할 수 있다. 이를 통해, 사용자는 텍스트 (text)나 이미지(image)를 통한 안내 서비스보다 직관적이고 편리한 서비스를 제공받을 수 있으며, 서비스를 제 공하는 공간에서는 서비스 제공을 위한 인력을 최소화하여 최대의 효율을 이끌어 낼 수 있다."}
{"patent_id": "10-2023-0101798", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소에는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설 명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼 용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실 시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 본 발명은 사용자의 공간 방문 목적에 근거한 디지털 휴먼을 제공하는 방법 및 시스템에 관한 것이다. 구체적으 로, 본 발명은 특정 목적을 갖는 공간(ex: 은행, 관공서 등)에서, 해당 공간을 방문한 사용자의 공간 방문 목적 및 감정 상황에 맞는 대응을 수행하여, 사용자의 공간 방문 목적에 따른 기능을 도울 수 있다. 나아가, 본 발명에서는, 메타버스(metaverse) 가상 공간을 이용하여, 사용자가 특정 공간(ex: “은행”, “관공 서”)에 직접 방문하지 않더라도, 실제 공간에서 처리 가능한 업무(또는 기능)을 처리할 수 있도록 하는 서비스 를 제공할 수 있다. 이에, 본 발명에서는, 실제 공간에 방문한 사용자의 공간 방문 목적 및 감정 상황에 근거하여, 디지털 휴먼을 이용한 사용자 업무 처리 서비스에 대해 먼저 설명하도록 한다. 그리고, 상기 내용에 근거하여, 메타버스 가상 공간에서의 디지털 휴먼을 이용한 사용자 업무 처리 서비스 서비 스에 대해 설명하도록 한다. 한편, 본 발명에서 디지털 휴먼은 가상 공간에 제공되는 가상의 캐릭터(또는, 아바타)로 이해될 수 있다. 디지 털 휴먼은 캐릭터 또는 아바타로 명명될 수 있다. 이하에서는, 첨부된 도면과 함께, 사용자가 공간 방문 목적에 따른 안내 서비스를 편리하고 효율적으로 이용할 수 있도록 하는 디지털 휴먼 제공 방법 및 시스템에 대해 구체적으로 설명하도록 한다. 도 1은 본 발명에 따른 디지털 휴먼 제공 시스템을 설명하기 위한 개념도이다. 도 2는 본 발명에 따른 디지털 휴먼 제공 방법을 설명하기 위한 흐름도이고, 도 3, 도 4, 도 5 및 도 6은 본 발명에서 디지털 휴먼을 통해 안 내 서비스를 제공하는 방법을 설명하기 위한 개념도들이며, 도 7a, 도 7b, 도 8a 및 도 8b는 본 발명에 따른 안 내 서비스 제공을 위한 가상 공간을 설명하기 위한 개념도들이다. 도 1에 도시된 것과 같이, 본 발명에 따른 디지털 휴먼 제공 시스템은, 통신부, 저장부, 정보 획득부 및 제어부 중 적어도 하나를 포함하도록 구성될 수 있다. 이때 본 발명에 따른 디지털 휴먼 제공 시스템은 상술한 구성 요소로 제한되는 것은 아니며, 본 명세서의 설명에 따른 기능과 동일 또는 유 사한 역할을 수행하는 구성요소를 더 포함할 수 있다. 한편, 본 발명에 따른 디지털 휴먼 제공 시스템은 전자기기와 연동되어 동작할 수 있다. 여기서 전자 기기는, 디지털 휴먼을 제공하기 위한 전자기기로 그 종류에 대한 제한을 두지 않는다. 예를 들어, 전 자기기는 헤드 마운티드 디스플레이(10a), 키오스크(KIOSK, 10b), 스마트폰(smart phone), 휴대폰, 태블릿 PC, 키오스크(KIOSK), 헤드 마운티드 디스플레이, XR 글래스. 컴퓨터, 노트북, 디지털방송용 단말, PDA(Personal Digital Assistants), 및 PMP(Portable Multimedia Player) 중 적어도 하나를 포함할 수 있다. 한편, 본 발명에 따른 디지털 휴먼 제공 시스템은, 애플리케이션 또는 소프트웨어로 구현될 수 있다. 이때, 디지털 휴먼 제공 시스템에 따른 애플리케이션 또는 소프트웨어는, 전자기기에 설치되어, 이하 에서 설명되는 디지털 휴먼을 이용한 서비스 제공을 위한 프로세스를 수행할 수 있다. 이 경우, 본 발명에 따른 디지털 휴먼 제공 시스템의 통신부, 저장부, 정보 획득부 및 제 어부는, 전자기기의 하드웨어 구성을 활용하여, 디지털 휴먼 제공 서비스를 위한 일련의 기능을 수행 할 수 있다. 예를 들어, 통신부는 전자기기의 통신부에 구비된 통신 모듈(예를 들어, 이동통신 모듈, 근거리 통신 모듈, 무선 인터넷 모듈, 위치정보 모듈, 방송 수신 모듈 등)의 구성을 이용하여, 적어도 하나의 외부 서버(예 를 들어, 데이터베이스(database: DB)) 와 데이터를 송수신할 수 있다. 나아가 저장부는 전자기기에 구비된(또는 삽입된) 메모리를 이용하여, 본 발명에 따른 디지털 휴먼 제 공 서비스와 관련된 데이터를 저장하도록 이루어질 수 있다. 정보 획득부는 전자기기에 구비된 카메라를 이용하여, 본 발명에 따른 디지털 휴먼 제공 서비스를 위한 정보를 획득할 수 있다. 예를 들어, 정보 획득부는 전자기기에 구비된 카메라를 이용하여, 사용자의 얼굴 이미지를 센싱할 수 있다. 본 발명에서는, 정보 획득부를 센싱부로도 명명할 수 있다. 제어부는, 전자기기에 구비된 CPU를 활용하여, 각 구성에 대한 제어 및 본 발명과 관련된 전반적인 제 어를 수행할 수 있다. 나아가, 제어부는 본 발명을 수행하기 위하여, 전자기기의 구성 중 적어도 하나 에 대한 제어 권한을 가질 수 있다. 나아가, 제어부는 전자기기의 구성 요소에서 수신되거나, 획득(센 싱)된 정보를 본 발명을 위하여 활용할 수 있다, 예를 들어, 제어부는 전자기기의 카메라로부터 수신되는 영상을 이용하여, 본 발명에 따른 사용자 공간 방문 목적을 특정할 수 있다. 제어부는 전자기기의 디스플레이부를 이용하여, 본 발명과 관련된 정보(예를 들어, 디지털 휴먼을 통한 가이드 정보)를 출력하도록 이루어질 수 있다. 이 외에도, 제어부는 전자기기에 구비된 다른 구성 요소(예를 들어, 근접 센서, 적외선 센서, 터치 스 크린, 입력부 등)를 이용하여 본 발명에 따른 사용자의 공간 방문 목적에 근거한 디지털 휴먼 제공 서비스와 관 련된 다양한 프로세스를 수행할 수 있다. 한편, 본 발명에 따른 디지털 휴먼 제공 시스템은 프로그램 또는 어플리케이션의 형태로 존재하는 것 뿐만 아니라, 이하에서 설명되는 구성 및 기능의 수행이 가능한 다양한 형태로 존재할 수 있다. 이에, 이하에서는, 이에 대한 엄격한 제한을 두지 않고, 본 발명에 따른 디지털 휴먼 제공 시스템에 대하 여 설명하도록 한다. 도 1에 도시된 것과 같이, 본 발명에 따른 디지털 휴먼 제공 시스템은 전자기기의 카메라를 이용 하여, 사용자를 센싱하고, 센싱된 사용자의 공간 방문 목적을 특정하고, 디지털 휴먼을 통해 특정된 공간 방문 목적에 대응되는 가이드 정보가 제공하도록 이루어질 수 있다. 여기에서, “공간”은, 특정 목적을 갖는 공간으로, 특정 목적과 관련된 기능 처리가 이루어지는 곳으로 이해될 수 있다. 예를 들어, 공간은, 은행, 관공서, 병원, 도서관 중 적어도 하나에 해당할 수 있다. 통신부는 전자기기 및 외부 서버(미도시) 중 적어도 하나와 유선 또는 무선으로 통신하도록 이루어질 수 있다. 통신부는 유선 또는 무선 통신을 이용하여 전자기기로부터, 전자기기에 구비된 카메라 로 촬영된 영상을 수신할 수 있다. 저장부는 본 발명에 따른 디지털 휴먼 제공 서비스와 관련된 데이터를 저장하도록 이루어질 수 있다. 구체적으로 저장부에는, i) 사용자 DB, ii) 공간 정보, iii) 디지털 휴먼 정보(또는 디지털 휴먼의 인물 정보), iv) 공간 방문 목적에 대응되는 가이드 정보 중 적어도 하나가 존재할 수 있다. 저장부에 존재하는 정보들에 대한 구체적인 설명은, 정보를 이용하는 과정에서 설명하도록 한다. 제어부는, 카메라를 통해 수신된 영상에서, 사용자의 얼굴 이미지를 추출하고, 사용자 DB로부터, 상기 추출된 얼굴 이미지와 대응되는(또는 매칭된) 사용자 정보를 추출할 수 있다. 제어부는, 사용자 DB로부터 사용자의 얼굴 이미지와 대응되는 인물을 검색하고, 검색된 인물에 매칭 된 사용자 정보를 추출할 수 있다. 사용자 DB에는 개별 인물(또는 사람) 단위로, 각각의 인물에 대한 사용자 정보가 저장될 수 있다. 사용자 DB에 는, 서로 다른 인물 마다 각각에 대응되는 사용자 정보가 매칭되어 저장될 수 있다.여기에서, 사용자 정보는, 각각의 인물에 해당하는 사람을 특정하고, 특정된 사람의 공간 방문 목적을 특정할 수 있는 다양한 정보를 포함할 수 있다. 예를 들어, 사용자 정보에는, 각각의 인물에 해당하는 사람의 i) 이름, ii) 얼굴 이미지, iii) 참조 얼굴 이미 지, iv) 업무 정보(할일 정보), v) 히스토리 정보(과거 처리한 일 또는 기능)에 대한 정보, iv) 관심 정보 중 적어도 하나를 포함할 수 있다. 여기에서, 참조 얼굴 이미지는, 특정 인물에 대한 얼굴 이미지로서, 하나 또는 복수 일 수 있다. 본 발명에서, “참조 얼굴 이미지”는 “참조 데이터”로도 명명될 수 있다. 제어부는, 카메라를 통해 획득된 사용자의 얼굴 이미지와, 사용자 DB에 저장된 참조 얼굴 이미지를 비 교하여, 상기 사용자의 얼굴 이미지와 대응되는 참조 얼굴 이미지에 매칭된 인물을 검색할 수 있다. 그리고, 제 어부는 검색된 인물을 상기 사용자로 특정하고, 상기 검색된 인물에 매칭된 사용자 정보를 사용자 DB로부 터 추출할 수 있다. 그리고, 제어부는 추출된 사용자 정보를 이용하여, 사용자의 공간 방문 목적을 특정할 수 있다. 도 1에 도시된 것과 같이, 전자기기는, 공간의 임의의 장소에 배치될 수 있으며, 전자기기가 배치된 장 소에 따라, 사용자의 공간 방문 목적은 다양하게 특정될 수 있다. 예를 들어, 전자기기가 배치된 장소가 은행인 경우, 공간 방문 목적은, 세금 납부, 대출 이자 납부, 적금 납부, 대출 상담, 적금 상담, 적금 해지, 카드 발급, 통장 개설 중 적어도 하나일 수 있다. 다른 예를 들어, 전자기기가 배치된 장소가 “관공서(ex: 주민센터)”인 경우, 공간 방문 목적은, 주민등록 등본 발급, 전입신고, 출생신고, 전입신고 중 적어도 하나를 포함할 수 있다. 또 다른 예를 들어, 전자기기가 배치된 장소가 “다른 관공서(ex: 보건소)”인 경우, 공간 방문 목적은, 진 료(ex: 고혈압, 당뇨, 신경통, 관절염 등), 예방 접종, 보건증 발급 등이 해당될 수 있다. 한편, 본 발명에서 설명되는 “공간” 및 “공간 방문 목적”은 다양할 수 있으며, 상술한 예시들에 한정되지 않음은 당연하다. 한편, 이러한 공간 방문 목적은, 공간에서 이루어지는 기능에 근거하여 특정될 수 있다. 저장부에는 공간 각각에서 수행되는 기능에 대한 정보를 포함하는 “공간 정보”가 존재할 수 있다. 제어부는 저장부에 존재하는 공간 정보와, 사용자의 사용자 정보를 비교하여, 사용자의 공간 방문 목적을 특정할 수 있다. 나아가, 제어부는, 공간과 관련된 디지털 휴먼에 의해, 사용자의 공간 방문 목적에 대응되는 가이드 정보를 제공할 수 있다. 본 발명에서는, 공간 별로 서로 다른 디지털 휴먼이 제공될 수 있다. 공간 마다의 디지털 휴먼은, 외형, 모습, 나이, 성별, 직업, 복장, 목소리, 대화 속도, 대화 패턴 중 적어도 하나가 서로 다를 인물로 이루어질 수 있다. 그리고, 본 발명에서는, 공간 방문 목적 별로도 서로 다른 디지털 휴먼이 제공될 수 있다. 이러한 디지털 휴먼은, 저장부에 존재하는 디지털 휴먼의 인물 정보에 근거하여 결정될 수 있다. 저장부에는 공간(또는 공간 방문 목적) 각각에, 서로 다른 디지털 휴먼(또는 디지털 휴먼의 인물 정보)이 매칭되어 존재할 수 있다. 제어부는 저장부를 참조하여, 특정 공간(또는 특정 공간 방문 목적)에 매 칭된 디지털 휴먼을 통해, 사용자의 공간 방문 대응되는 가이드 정보를 제공할 수 있다. 한편, 저장부에는, 공간 방문 목적 별로 서로 다른 가이드 정보가 매칭되어 존재할 수 있다. 여기에서, 가이드 정보는, 사용자가 공간 방문 목적에 따른 기능을 수행(또는 처리)할 수 있도록, 기능 처리를 안내 또는 가이드 하기 위한 정보로 이해할 수 있다. 이아 같이, 본 발명에서는, 사용자가 특정 공간에 위치하는 전자기기 주변에 위치하는 것 만으로, 사용자 가 특정 공간에 방문한 목적에 따른 가이드 정보를, 디지털 휴먼을 통해 제공할 수 있다. 이하에서는, 흐름도와 함께 본 발명에 따른 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법에 대해 보 다 구체적으로 살펴본다. 본 발명에서는 카메라를 이용하여, 실제 공간에 방문한 사용자의 얼굴 이미지를 센싱하는 과정이 진행될 수 있 다(S210, 도 2 참조). 제어부는, 전자기기의 카메라(11, 도 1 참조)를 이용하여, 전자기기 주변에 위치한 사용자 의 얼굴 이미지를 센싱(촬영, 획득 또는 검출)할 수 있다. 즉, 제어부는, 전자기기 주변에 위치한 사 용자의 얼굴을 포함한 영상을 촬영하도록, 전자기기에 구비된 카메라를 제어할 수 있다. 제어부는, 카메라를 통해 수신되는 영상에서, 사용자의 얼굴 이미지를 획득하고, 사용자 DB에 저장된 상기 얼굴 이미지에 대응되는 사용자 정보를 이용하여, 상기 사용자의 사용자 정보를 추출할 수 있다. 제어부는 다양한 시점에, 사용자의 얼굴 이미지를 센싱할 수 있다. 예를 들어, 도 3의 (a)에 도시된 것과 같이, 제어부는 전자기기로부터 일정 범위 이내에서 일정 시간 이상 사용자가 감지되는 것에 근거하여, 사용자의 얼굴 이미지를 센싱 할 수 있다. 다른 예를 들어, 제어부는, 사용자의 가이드 정보 제공 요청에 근거하여, 사용자의 얼굴 이미지를 센싱할 수 있다. 제어부는, 전자기기에 대한 사용자 입력(예를 들어 전자기기의 디스플레이의 일 영역(도3 에서 도면부호 13 참조)에 대한 사용자 입력)에 근거하여 사용자의 얼굴 이미지를 센싱할 수 있다. 한편, 본 발명에서는 사용자 DB로부터 상기 얼굴 이미지에 대응되는 사용자 정보를 추출하는 과정이 진행될 수 있다(S220, 도 2 참조) 제어부는 적어도 하나의 얼굴 인식 알고리즘을 이용하여, 카메라에서 수신되는 영상에서 사용자(100 0)의 얼굴 이미지를 검출할 수 있다. 본 발명에서 활용되는 얼굴 인식 알고리즘은 그 종류에 제한이 없으며, 인 공지능 또는 딥러닝을 기반으로 동작하는 알고리즘 또한 활용될 수 있다. 제어부는, 카메라를 통해 수신된 영상에서, 사용자의 얼굴 이미지를 추출하고, 사용자 DB로부터, 상기 추출된 얼굴 이미지와 대응되는(또는 매칭된) 사용자 정보를 추출할 수 있다. 앞서 살펴본 것과 같이, 사용자 DB에는 개별 인물(또는 사람) 단위로, 각각의 인물에 대한 사용자 정보가 저장 될 수 있다. 그리고, 사용자 DB에는, 서로 다른 인물 마다 각각에 대응되는 사용자 정보가 매칭되어 저장될 수 있다. 여기에서, 사용자 정보는, 각각의 인물에 해당하는 사람을 특정하고, 특정된 사람의 공간 방문 목적을 특정할 수 있는 다양한 정보를 포함할 수 있다. 예를 들어, 사용자 정보에는, 각각의 인물에 해당하는 사람의 i) 이름, ii) 얼굴 이미지, iii) 참조 얼굴 이미 지, iv) 사용자가 해야 하는 업무(에 대한 업무 정보(또는 할일 정보), v) 사용자가 과거 처리(수행)한 업무에 대한 히스토리 정보, iv) 사용자 관심 있는 업무에 대한 관심 정보 중 적어도 하나를 포함할 수 있다. 여기에서, 참조 얼굴 이미지는, 특정 인물에 대한 얼굴 이미지로서, 하나 또는 복수 일 수 있다. 본 발명에서, “참조 얼굴 이미지”는 “참조 데이터”로도 명명될 수 있다. 제어부는, 카메라를 통해 획득된 사용자의 얼굴 이미지와, 사용자 DB에 저장된 참조 얼굴 이미지를 비 교하여, 상기 사용자의 얼굴 이미지와 대응되는 참조 얼굴 이미지에 매칭된 인물을 검색할 수 있다. 그리고, 제 어부는 검색된 인물을 상기 사용자로 특정하고, 상기 검색된 인물에 매칭된 사용자 정보를 사용자 DB로부 터 추출할 수 있다. 제어부는 검출된 사용자의 얼굴 이미지와 기 설정된 조건을 만족하는 유사도를 갖는 특정 참조 얼굴 이미지를 사용자 DB로부터 추출할 수 있다. 그리고, 추출된 상기 특정 참조 얼굴 이미지에 매칭된 인물을 상기 사용자로서 특정할 수 있다. 제어부는 도 3의 (b)에 도시된 것과 같이, 사용자에 대한 검색이 진행되는 동안, 전자기기에 현 재 진행 상황에 대한 안내 정보(예를 들어, “당신을 찾고 있습니다”)가 출력되도록 디스플레이부를 제어 할 수 있다. 제어부는, 디스플레이부에, 디지털 휴먼 제공에 대한 현재 진행 상황에 대한 안내 정보 (예를 들어, “당신을 찾고 있습니다”)를 제공할 수 있다. 도시와 같이, 디스플레이부에는, 카메라를 통해 촬영된 영상이 출력될 수 있다. 이때, 출력되는 영상에 는, 사용자의 얼굴 이미지가 포함될 수 있다. 한편, 본 발명에서는, 추출된 사용자 정보를 이용하여, 실제 공간에 방문한 사용자의 공간 방문 목적을 특정하 는 과정이 진행될 수 있다(S230, 도 2 참조). 제어부는 저장부에 존재하는 공간 정보 및 추출된 사용자의 사용자 정보에 근거하여 사용자 의 공간 방문 목적을 특정할 수 있다. 앞서 설명한 것과 같이, “공간 정보”에는, 공간 각각에서 수행되는 기능에 대한 정보가 포함될 수 있다. 예를 들어, “은행”에 매칭된 공간 정보에는, 은행에서 수행되는 기능(ex: 세금 납부, 대출 이자 납부, 적금 납부, 대출 상담, 적금 상담, 적금 해지, 카드 발급, 통장 개설 등)에 대한 정보가 포함되어 존재할 수 있다. 그리고, “사용자 정보”에는, 사용자가 해야 하는 업무(작업 또는)에 대한 업무 정보(할일 정보)가 포함될 수 있다. 예를 들어, 사용자 정보에는, “세금 납부”, “운전면허 갱신”등의 업무 정보가 포함될 수 있다. 제어부는, 사용자가 방문한 공간의 공간 정보와, 사용자의 사용자 정보를 비교(대조)하여, 사용자 의 공간 방문 목적을 특정할 수 있다. 구체적으로, 제어부는, 사용자의 사용자 정보에 포함된 업무에 대응되는 기능이, 사용자가 방 문한 공간에 매칭된 공간 정보에 포함된 기능인지를 확인하는 과정을 통해, 사용자의 업무에 대응되는 기 능이 상기 공간에서 수행되는 기능에 해당하는지를 확인할 수 있다. 여기에서 “업무”는, 사용자가 처리해야 하는 일(work), 용무를 의미할 수 있다. 그리고, “기능”은, 업무를 처리하는 능력, 동작, 데이터 처리 등을 의미할 수 있다. 본 발명에서는, 본 발명에서는 업무와 기능을 혼용하 여 사용 가능하다. 한편, 확인 결과, 사용자의 업무에 대응하는 기능이 사용자가 방문한 공간에서 수행되는 기능이면, 제어부는 상기 업무(또는 기능)을 사용자의 공간 방문 목적으로 특정할 수 있다. 예를 들어, 사용자가 “은행”에 방문한 경우를 가정하자. 제어부는 사용자의 사용자 정보에 “세금 납부“의 업무 정보가 포함되어 있고, 은행에 매칭된 공간 정보에는 “세금 수납” 기능이 포함되어 있 으면, 사용자의 은행 방문 목적을 “세금 납부”로 특정할 수 있다. 반면에, 확인 결과, 사용자의 업무에 대응하는 기능이 사용자가 방문한 공간에서 수행되지 않는 기 능이면, 제어부는 사용자의 상기 공간 방문 목적을 특정하기 위하여, 전자기기의 디스플레이 상에 상기 공간에서 수행되는 복수의 기능 각각에 대응되는 복수의 그래픽 객체를 표시할 수 있다. 그리고, 제어부는 상기 복수의 그래픽 객체 중 적어도 하나가 선택되는 것에 근거하여, 선택된 그래픽 객 체에 대응되는 기능을, 상기 사용자의 방문 목적으로 특정할 수 있다. 한편, 본 발명에서는, 실제 공간에 대응되는 가상 공간 상에서, 디지털 휴먼을 통해 공간 방문 목적에 대응되는 가이드 정보를 제공하는 과정이 진행될 수 있다(S240, 도 2 참조). 도 3의 (c)에 도시된 것과 같이, 제어부는, 사용자의 공간 방문 목적에 매칭된 가이드 정보를 확인하고, 확인된 가이드 정보(ex: “임*현님. 재산세 납부를 안내해드릴게요.”, 310)를, 디지털 휴먼에 의해 사용 자에게 제공할 수 있다. 즉, 제어부는 공간과 관련된 디지털 휴먼을 통해, 사용자의 공간 방문 목적 에 대응되는 업무를 안내할 수 있다. 앞서 설명한 것과 같이, 저장부에는 공간 방문 목적 각각에 매칭된 가이드 정보가 존재할 수 있다. 예를 들어, “세금 납부”의 공간 방문 목적에는 세금 납부를 위한 절차(과정)을 가이드 하는 가이드 정보가 매칭되 어 존재할 수 있다. 다른 예를 들어, “대출 상담”의 공간 방문 목적에는 대출 상담을 위한 절차(과정)을 가이 드 하는 가이드 정보가 매칭되어 존재할 수 있다. 제어부는, 사용자의 공간 방문 목적에 매칭된 가이드 정보를 참조하여, 디지털 휴먼이 사용자와 대화를 진 행하면서, 상기 공간 방문 목적에 대응되는 기능을 안내하도록 하도록 제어할 수 있다. 구체적으로, 제어부는, 전자기기 상에, 통해 가이드 정보에 근거하여 대화를 수행하는 디지털 휴먼을 제공할 수 있다. 제어부는 키오스크의 디스플레이 상에 디지털 휴먼을 출력할 수 있다. 또한, 제어부는 가상 현실 (virtual reality) 환경을 제공하는 헤드 마운티드 디스플레이(HMD, head mounted display)를 통해, 디지털 휴먼을 제공할 수 있다. 제어부는, 전자기기로부터 가이드 정보에 근거한 디지털 휴먼의 발화에 대한 사용자의 피드백 정보를 수신할 수 있다. 여기에서, 사용자의 피드백 정보는 형태가 다양할 수 있다. 예를 들어, 사용자의 피드백 정보는, 사용자의 발화 를 포함한 음성 정보, 상기 발화를 텍스트로 변환한 텍스트 정보, 사용자가 전자기기 상에 입력한 입력 정 보 등 다양할 수 있다. 제어부는, 사용자의 피드백 정보에 근거하여, 사용자의 방문 목적에 대응되는 가이드 정보를 디지털 휴먼 을 통해 계속해서 제공할 수 있다. 한편, 제어부는, 사용자가 방문한 공간과 관련된 디지털 휴먼을 통해, 가이드 정보를 제공할 수 있다. 저장부에는, 복수의 실제 공간 각각에서 종사하는 종사자에 대한 인물 정보가 존재할 수 있다. 이러한 인 물 정보는, 복수의 공간(실제 공간 또는 가상 공간) 각각에 매칭된 디지털 휴먼의 인물 정보라고도 표현될 수 있다. 그리고, 디지털 휴먼의 인물 정보에는, 디지털 휴먼(또는 종사자)의 외형 정보, 음성 정보, 동작 정보(또는 제 스처 정보), 표정 정보, 성격 정보가 포함될 수 있다 즉, 제어부는, 공간에 매칭된 디지털 휴먼의 인물 정보를 참조하여, 공간과 관련된 디지털 휴먼에 의해 가 이드 정보를 제공할 수 있다. 한편, 본 발명에서는 사용자와 관련된 다양한 정보에 근거하여, 상황에 따라 서로 다른 대화 방식으로 대화하는 디지털 휴먼을 통해, 가이드 정보를 제공할 수 있다. 제어부는, 디지털 휴먼의 억양, 어조, 속도, 대화체, 대사, 동작(또는 제스처), 표정을 서로 다르게 설정 함으로써, 디지털 휴먼의 대화 방식을 다양하게 설정할 수 있다. 본 발명에서는, 디지털 휴먼의 복수의 대화 방식이 존재하는 것으로 이해할 수 있다. 이러한 복수의 대화 방식 은 상술한 요소들 중 어느 하나가 다를 수 있다. 제어부는, 사용자의 성향 정보, 연령 정보, 성별 정보, 감정 정보, 공간 방문 시간 정보 중 적어도 하나에 근거하여, 디지털 휴먼이, 복수의 대화 방식 중 어느 하나에 따라 가이드 정보를 제공하도록 제어할 수 있다. 제어부는 사용자가 방문한 실제 공간에서 종사하는 종사자의 인물 정보에 근거하여, 디지털 휴먼을 생성할 수 있다. 이하에서는, 디지털 휴먼의 대화 방식을 결정하는 방법에 대해 자세하게 설명하도록 한다. 제어부는, 사용자의 감정 정보를 고려하여, 디지털 휴먼이, 복수의 대화 방식 중 어느 하나에 따라 가이드 정보를 제공하도록 제어할 수 있다. 제어부는 사용자의 얼굴 이미지로부터 사용자의 감정 정보를 추출할 수 있다. 제어부는 인공지능 알 고리즘으로 학습된 감정 분석 모델에 기반하여 사용자의 얼굴 이미지로부터 사용자의 감정 정보를 추출할 수 있 다. 이를 위해, 제어부는 사용자의 감정 정보 추출을 위한 테스트를 진행할 수 있다. 예를 들어, 제어부 는 사용자의 얼굴이, 전자기기에 구비된 카메라의 정면을 일정 시간(예를 들어, “3초”)동안 향하도록 안내하는 안내 정보를 출력할 수 있다. 다른 예를 들어, 사용자의 감정 정보 추출을 위하여, 디지털 휴먼을 통 해 테스트 대화를 진행할 수 있다. 테스트 대화와 관련된 자세한 내용은 후술하도록 한다. 도 4의 (a)에 도시된 것과 같이, 제어부는 사용자의 얼굴 이미지에 포함된 사용자의 표정에 근거하여, “긍정”에 대응되는 제1 감정 정보를 추출(또는 감지)할 수 있다. 이 경우, 제어부는, 제1 감정(ex: “긍정”) 정보가 추출(검출 또는 감지)되는 것에 근거하여, 디지털 휴 먼이 제1 감정 정보에 대응되는 제1 대화 방식(ex: “사무적인 대화 방식”)으로 가이드 정보를 제공하도록 제 어할 수 있다. 이와 달리, 도 4의 (b)에 도시된 것과 같이, 제어부는 사용자의 얼굴 이미지에 포함된 사용자 표정에 근거하여, “부정”에 대응되는 제2 감정 정보를 추출(검출)할 수 있다. 이 경우, 제어부는, 제2 감정(ex: “부정”) 정보가 추출(검출 또는 감지)되는 것에 근거하여, 디지털 휴 먼이 제2 감정 정보에 대응되는 제2 대화 방식(ex: “친절한 대화 방식)”으로 가이드 정보를 제공하도록 제어 할 수 있다. 한편, 제어부는, 디지털 휴먼을 통해 특정 대화 방식으로 가이드 정보를 제공하고 있는 상태에서, 전자기 기에 구비된 카메라로부터 사용자의 얼굴 이미지를 센싱할 수 있다. 그리고, 제어부는 사용자의 얼굴 이미지로부터 추출된 사용자의 감정 정보에 근거하여, 디지털 휴먼의 대 화 방식을 유지 또는 변경할 수 있다. 제어부는, 제1 대화 방식으로 가이드 정보를 제공하는 디지털 휴먼이 전자기기를 통해 제공되고 있는 상태에서, 사용자의 얼굴 이미지에 포함된 사용자의 표정에 근거하여, “긍정”에 대응되는 제1 감정 정보를 추 출할 수 있다. 이 경우, 제어부는, 디지털 휴먼의 제1 대화 방식을 유지할 수 있다. 이와 달리, 제어부는, 제1 대화 방식으로 가이드 정보를 제공하는 디지털 휴먼이 전자기기를 통해 제 공되고 있는 상태에서, 사용자의 얼굴 이미지에 포함된 사용자의 표정에 근거하여, “부정”에 대응되는 제2 감 정 정보를 추출할 수 있다. 이 경우 제어부는 제2 감정(ex: “부정”) 정보가 추출된 것에 근거하여, 제1 대화 방식으로 가이드 정보 를 제공하던 디지털 휴먼이, 상기 제1 대화 방식과는 다른 제2 대화 방식으로 가이드 정보를 제공하도록 제어할 수 있다. 즉, 제어부는 디지털 휴먼의 대화 방식을 변경할 수 있다. 한편, 제어부는 사용자의 얼굴 이미지로부터 사용자의 연령 정보 또는 성별 정보를 추출하고, 추출된 상기 연령 정보 및 성별 정보 중 적어도 하나에 근거하여 복수의 대화 방식 중 어느 하나에 따라 디지털 휴먼이 가이 드 정보를 제공하도록 제어할 수 있다. 제어부는 얼굴 이미지로부터 추출된 연령 정보 및 성별 정보 중 적어도 하나가 서로 다른 것에 근거하여, 서로 다른 대화 방식에 의해 디지털 휴먼이 대화하도록 제어할 수 있다. 도 5의 (a) 및 (b)에 도시된 것과 같이, 제어부는 제1 얼굴 이미지로부터 추출된 성별 정보(ex: 여, 女)와 제2 얼굴 이미지로부터 추출된 성별 정보(ex: 남, 男)가 서로 다른 것에 근거하여, 디지털 휴먼의 대화 방식을 서로 다르게 설정할 수 있다. 즉, 제어부는 여자 사용자와 남자 사용자 각각에게 서로 다른 대화 방식으로 가이드 정보를 제공하는 디지 털 휴먼을 제공할 수 있다. 나아가, 도 5의 (b) 및 (c)에 도시된 것과 같이, 제어부는, 제2 얼굴 이미지 및 제3 얼굴 이미지 각각으로부터 추출된 성별 정보(ex: 남, 男)가 동일하더라도, 연령 정보(ex: 20대, 80대)가 서로 다른 것 에 근거하여, 디지털 휴먼의 대화 방식을 서로 다르게 설정할 수 있다. 예를 들어, 제어부는 추출된 연령 정보가 제1 연령 정보(ex: 20대)에 대응되는 경우보다, 제2 연령 정보 (ex: 70대)에 대응되는 경우, 느린 대화 속도 및 높은 데시벨(dB)의 대화 방식으로 디지털 휴먼이 가이드 정보 를 제공하도록 제어할 수 있다. 나아가, 비록 도시되지는 않았지만, 얼굴 이미지로부터 추출된 연령 정보가, 기 설정된 연령 이하(ex: “만13세 이하” 또는 “만 19세 이하”)에 대응되는 경우, 제어부는, 사용자의 연령 재확인을 하는 안내 멘트(ex: “고객님의 연령 확인이 필요합니다”), 사용자의 특정 기능 사용 불가능을 안내하는 안내 멘트(ex: “고객님께 서는 대출 상담과 같은 보호자가 필요한 업무는 제한됩니다”)가 디지털 휴먼에 의해 제공되도록 제어할 수 있 다. 한편, 제어부는 사용자의 성향 정보에 근거하여, 복수의 대화 방식 중 어느 하나에 따라 디지털 휴먼의 가 이드 정보를 제공하도록 제어할 수 있다. 여기에서, 사용자의 성향 정보에는, 사용자가 선호하는 가이드 정보 제공 방식에 대한 정보가 포함될 수 있다."}
{"patent_id": "10-2023-0101798", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예를 들어, 사용자의 성향 정보에는, 가이드 정보의 요점만 안내받는 것을 선호하는 성향, 과거 수행 업무 내용을 요약해서 리마인드 하는 것을 선호하는 성향, 선호하는 말(대화)의 속도, 어조, 억양, 친절한 타입을 선호하 는 성향, 사무적인 타입을 선호하는 성향 등에 대한 다양한 정보를 포함할 수 있다. 제어부는 사용자 정보로부터 사용자의 성향 정보를 추출할 수 있다. 그리고, 제어부는 사용자의 성향 정보에 대응되는 대화 방식에 따라 디지털 휴먼이 가이드 정보를 제공하도록 제어할 수 있다. 제어부는 사용자의 성향이, 제1 타입의 성향에 해당하면, 제1 타입의 성향에 대응되는 대화 방식으로 디지 털 휴먼이 가이드 정보를 제공하도록 할 수 있다. 그리고, 제2 사용자의 성향이, 제2 타입의 성향에 해당하면, 제2 타입의 성향에 대응되는 대화 방식으로 디지털 휴먼이 가이드 정보를 제공하도록 제어할 수 있다. 이러한 성향 정보는, 사용자에 의해 설정되거나, 제어부에 의해 설정될 수 있다. 제어부는 사용자의 히스토리 정보에 기반하여, 사용자의 성향을 분석할 수 있다. 즉, 제어부는 사용 자와 디지털 휴먼과의 과거 대화 내용에 기반하여, 사용자의 성향을 분석하고, 분석된 성향을 성향 정보로서 저 장부에 저장할 수 있다. 나아가, 제어부는 사용자의 성향 정보를 판단하기 위하여, 디지털 휴먼과 사용자의 테스트 대화를 진행할 수 있다 제어부는 상기 테스트 대화에 기반하여, 사용자의 성향 분석을 추출(판단)할 수 있다. 한편, 제어부는 사용자의 감정 정보 또는 성향 정보를 추출하기 위하여, 디지털 휴먼이 사용자와 테스트 대화를 진행하도록 제어할 수 있다. 제어부는, 사용자의 감정 정보 또는 성향 정보를 판단할 수 있도록 하는 대사, 억양, 어조, 제스처 등에 근거한 대화 방식으로 디지털 휴먼을 제어함으로써, 테스트 대화를 진행할 수 있다. 제어부는, 테스트 대화 결과에 기반하여, 사용자의 감정 정보 또는 성향 정보를 판단할 수 있다. 이 경우, 제어부는 상기 테스트 대화 결과, 사용자의 얼굴 이미지 및 사용자 정보에 포함된 성향 정보에 근거하여, 사용자의 감정 정보 또는 성향 정보를 최종적으로 판단할 수 있다. 제어부는 테스트 대화 결과에 근거하여 결정된 사용자의 감정 정보 또는 성향 정보에 근거하여, 복수의 대 화 방식 중 어느 하나의 대화 방식에 따라, 디지털 휴먼이 대화를 진행하도록 제어할 수 있다. 이러한 테스트 대화는, 디지털 휴먼을 통해 가이드 정보를 제공하기 전 단계에서 수행되거나, 디지털 휴먼을 통 해 가이드 정보를 제공하는 단계에서 수행될 수 있다. 제어부는, 디지털 휴먼을 통해 가이드 정보를 제공하기에 앞서, 디지털 휴먼과 사용자의 테스트 대화를 진 행하고, 테스트 대화에 근거하여 추출된 사용자의 감정 정보 및 성향 정보에 대응되는 대화 방식으로, 디지털 휴먼에 의해 가이드 정보를 제공할 수 있다. 나아가, 제어부는, 디지털 휴먼이 특정 대화 방식으로 가이드 정보를 제공하고 있는 상태에서, 사용자의 얼굴 이미지로부터 추출된 사용자의 감정 정보가 특정 감정 정보(ex: “부정”에 대응되는 제2 감정 정보)에 대 응되면, 사용자의 진정한 감정 정보를 판단하기 위하여, 테스트 대화를 진행할 수 있다. 구체적으로, 제어부는 디지털 휴먼이 제1 대화 방식으로 가이드 정보를 제공하고 있는 상태에서, 사용자의 얼굴 이미지로부터 추출된 감정 정보가 “부정(제2 감정 정보)”에 대응되면, 디지털 휴먼이 사용자와 테스트 대화를 시도하도록 제어할 수 있다. 제어부는 테스트 대화 결과, 사용자의 감정 정보가 “부정(제2 감정 정보)”에 대응되면, 디지털 휴먼의 대화 방식을 제1 대화 방식과는 다른 제2 대화 방식으로 변경하여 가이드 정보를 제공할 수 있다. 반면에, 제어부는 테스트 대화 결과, 사용자의 감정 정보가 “긍정(제1 감정 정보)”에 대응되면, 디지털 휴먼의 대화 방식을 제1 대화 방식으로 유지할 수 있다. 즉, 제어부는 사용자의 얼굴 이미지로부터 추출된 감정 정보 외에 사용자와의 대화를 통해, 사용자의 감정 상태를 분석하여, 사용자의 감정에 적절한 대화 방식으로 디지털 휴먼이 응대를 수행하도록 제어할 수 있다. 한편, 도 6의 (a)에 도시된 것과 같이, 제어부는, 복수의 기능 각각에 대응되는 항목(611, 612)을 포함한 기능 처리 리스트를 제공할 수 있다. 제어부는 사용자의 직업 정보, 사용자가 공간에 방문한 시간 정보를 고려하여, 사용자와 관련된 복수의 기 능을 특정할 수 있다. 그리고, 제어부는 특정된 복수의 기능에 대응되는 항목(611, 612)을 포함한 기능 처리 리스트를 전자기기의 상에 제공할 수 있다. 한편, 제어부는, 사용자 정보를 이용하여, 사용자가 방문한 실제 공간 외에 다른 실제 공간에서 처리되는 기능을 더 특정할 수 있다. 제어부는, 기능 처리 리스트 상에, 사용자가 방문한 공간에서 수행되는 기능 외에, 다른 공간에서 수행되 는 기능에 대응되는 항목을 포함시킬 수 있다. 즉, 제어부는 기능 처리 리스트에, 서로 다른 복수의 공간 에서 각각 수행되는 복수의 기능에 대응되는 항목을 포함시킬 수 있다. 예를 들어, 도 6의 (a)에 도시된 것과 같이, 제어부는 기능 처리 리스트 상에, 제1 공간(ex: “은행 ”)에서 수행되는 제1 기능(ex: “재산세 납부”)에 대응되는 제1 항목 및 상기 제1 공간과는 다른 제2 공 간(ex: “관공서”)에서 수행되는 제2 기능(ex: “건강보험료 납부”)에 대응되는 제2 항목을 포함시킬 수 있다. 제어부는, 기능 처리 리스트 상에서, 복수의 기능의 우선 순위에 근거하여, 복수의 기능 각각에 대응되는 항목들을 정렬하여 제공할 수 있다. 구체적으로, 제어부는, 사용자 정보에 근거하여 처리가 필요한 복수의 기능을 특정할 수 있다. 그리고, 제 어부는 사용자가 방문한 공간, 사용자가 공간을 방문한 시간 정보, 사용자의 직업 정보, 특정된 기능들에 대한 스케쥴 정보(일정 정보) 중 적어도 하나에 근거하여, 복수의 기능들에 대해 우선 순위를 할당(부여)할 수 있다. 제어부는, 특정된 복수의 기능 중, 사용자가 방문한 공간에서 처리가 가능한 기능(즉, 사용자가 방문한 공 간에서 수행되는 기능)에 대해, 다른 기능들보다 우선 순위를 높게 할당할 수 있다. 예를 들어, 사용자가 방문한 공간이 “은행”이라고 가정하자. 제어부는 은행에서 처리 가능한 기능에 대 해, 관공서에서 처리 가능한 기능보다 우선 순위를 높게 할당할 수 있다. 나아가, 제어부는 사용자가 공간에 방문한 시간대에 처리가 가능한 기능에 대해, 다른 기능들 보다 우선 순위를 높게 할당할 수 있다. 제어부는, 제1 기능은 사용자가 공간에 방문한 시간대에 처리가 가능한 기능이고, 제2 기능은 사용자가 공 간에 방문한 시간대에 처리가 불가능한 기능인 경우, 제1 기능에 대해 제2 기능보다 우선 순위를 높게 할당할 수 있다. 나아가, 제어부는 사용자의 직업 정보와 관련도가 높은 기능에 대해, 다른 기능들 보다 높은 우선 순위를 할당할 수 있다. 구체적으로, 제어부는 사용자의 직업 정보에 포함된 직업 군과 동일한 직업 군에 대응되 는 기능에 대해, 다른 기능 보다 우선 순위를 높게 할당할 수 있다. 나아가, 제어부는 특정된 복수의 일정 각각의 스케쥴 정보를 고려하여, 복수의 기능들에 대해 우선 순위를 할당할 수 있다. 제어부는, 특정된 복수의 기능들의 처리 기일이 빠른 순서대로, 복수의 기능들에 대해 우 선 순위를 부여할 수 있다. 예를 들어, 제1 기능의 처리 기능은 “2일 후”이고, 제2 기능의 처리 기능은 “3일 후”인 경우, 제1 기능에 대해 우선 순위를, 제2 기능 보다 높게 할당할 수 있다. 나아가, 제어부는 처리 기능 리스트의 일 영역 상에, 사용자 정보에 근거한 사용자의 이름 정보(ex: “임* 현”, 613)을 표시할 수 있다. 사용자는 처리 기능 리스트에 표시되는 이름 정보를 통해, 처리 기능 리스트에 포함된 처리 기능 항목들이, 자신과 관련된 기능들에 해당하는지 여부를 확인할 수 있다. 한편, 제어부는, 사용자와 가족 관계에 있는 사용자의 사용자 정보를 고려하여 복수의 기능을 특정하고, 특정된 복수의 기능 각각에 대응되는 항목을 포함한 기능 처리 리스트를 제공할 수 있다. 본 발명에서는 용어의 혼동을 피하기 위하여, 사용자와 가족 관계에 있는 사용자를 “가족원”으로 명명하여 설 명하도록 한다. 도 6의 (b)에 도시된 것과 같이, 제1 항목 및 제3 항목은, 사용자의 사용자 정보에 근거하여 특정된 기능에 대응되는 항목이고, 제2 항목은, 가족원의 사용자 정보에 근거하여 특정된 기능에 대응되는 항목일 수 있다. 제어부는, 가족원의 사용자 정보에 접근 가능한 접근 권한에 근거하여, 가족원의 사용자 정보로부터 가족 원이 처리해야 하는 업무에 대응되는 기능을 특정할 수 있다. 본 발명에서 “접근 권한”은, 특정 사용자의 사용자 정보에 미리 포함되어 존재하거나, 사용자로부터 접근 허 용을 받는 것에 근거하여 획득할 수 있다. 제어부는 사용자의 사용자 정보에, 가족원의 사용자 정보로의 접근을 허용하는 접근 권한에 포함되어 있는 것에 근거하여, 상기 접근 권한에 근거하여 가족원의 사용자 정보에 접근할 수 있다. 나아가, 제어부는, 가족원의 사용자 정보에 접근하기 위하여, 전자기기 상에 접근 권한 허용 요청과 관련된 안내 정보(ex: “배우자님의 일정도 확인하시겠습니까?” 또는 “배우자님의 업무도 처리하시겠습니까? ”)를 출력할 수 있다. 그리고, 제어부는 전자기기로부터 가족원의 사용자 정보에의 접근 허용(ex: “예”에 대응되는 그래픽 객체에 대한 사용자 선택)을 수신하는 것에 근거하여, 접근 권한을 획득할 수 있다. 한편, 도 6의 (b)에 도시된 것과 같이, 제어부는, 처리 기능 리스트 상에, 가족원의 처리 기능에 대 응하는 항목이 포함되었음을 안내하는 알림 정보(ex: “배우자 소*훈님의 업무도 처리하실 수 있어요”, 624)을 포함할 수 있다. 이 때, 제어부는 알림 정보에, 가족원의 이름 정보가 포함되도록 제어하여, 사용자가 자신의 가족원과 관련된 처리 기능 리스트가 맞는지 확인하도록 할 수 있다. 나아가, 제어부는, 가족원과 관련된 처리 기능 항목과 사용자와 관련된 처리 기능 항목(621, 623)이 서로 구분되도록 표시할 수 있다. 예를 들어, 제어부는 가족원과 관련된 처리 기능 항목과, 사용자와 관련된 처리 기능 항목(621, 623)의 색상을 서로 다르게 표시할 수 있다. 다른 예를 들어, 제어부는 가족 원과 관련된 처리 기능 항목에, 가족원과 관련됨을 표시하는 관련 정보(ex: “배우자 업무”, 622a)를 포 함시킬 수 있다. 한편, 앞서 설명한 것과 같이, 본 발명에서는, 메타 버스 가상 공간 상에 디지털 휴먼을 제공할 수 있다. 그리고, 본 발명에서는, 디지털 휴먼을 이용하여, 사용자가 특정 공간(ex: “은행”, “관공서”)에 직접 방문 하지 않더라도, 메타 버스 가상 공간 상에서 특정 공간에서 처리 가능한 업무(또는 기능)을 처리할 수 있도록 하는 서비스를 제공할 수 있다. 이에, 본 발명에서 설명된 “공간”은, “실제 공간” 또는 “메타 버스 상의 가상 공간”으로 이해될 수 있다. 그리고, 본 발명에서 설명된 “사용자가 방문한 공간”은, “사용자가 실제 방문한 공간” 또는 “사용자의 선 택에 근거하여 방문한 메타 버스 상의 가상 공간”에 해당할 수 있다. 본 발명에 따른 디지털 휴먼 시스템에서는, 사용자가 복수의 공간 중 어느 하나를 선택하면, 선택된 공간 에 대응되는 메타 버스 상의 가상 공간으로, 사용자(또는 사용자에 대응되는 아바타, 그래픽 객체)가 방문하도 록 제어할 수 있다. 구체적으로, 제어부는, 사용자가 제1 공간(ex: “은행”) 및 제2 공간(“관공서”) 중 제1 공간을 선택하 는 것에 근거하여, 제1 공간에 대응되는 콘텐츠를 생성하여, 전자기기 상에 제공할 수 있다. 예를 들어, 제 어부는 헤드 마운티드 디스플레이 상에 제1 공간에 대응되는 콘텐츠를 제공할 수 있다. 즉, 앞서 “공간”과 관련하여 설명된 모든 기술은, 메타 버스 상의 가상 공간에서 이루어질 수 있음은 당연하 다. 한편, 제어부는 사용자 정보에 근거하여 적어도 하나의 기능을 특정할 수 있다. 그리고, 제어부는 특 정된 기능이 처리는 공간에 대응되는 가상 공간을 생성할 수 있다. 도 7a의 (a)에 도시된 것과 같이, 제어부는 사용자 정보에 근거하여, 제1 기능(ex: “재산세 납부”, 710) 및 제2 기능(ex: “건강보험료 납부”, 720)를 특정할 수 있다. 도 7a의 (b)에 도시된 것과 같이, 제어부는 제1 기능 및 제2 기능이 처리되는 공간(ex: “은행 ”)에 대응되는 가상 공간을 생성할 수 있다. 도 7b의 (a)에 도시된 것과 같이, 제어부는 상기 가상 공간 상에, 상기 가상 공간과 관련된 디 지털 휴먼을 가상 공간에 배치할 수 있다. 예를 들어, 제어부는 상기 가상 공간이 “은행”에 대응되는 경우, “은행원”을 가상 공간 상에 배치할 수 있다. 제어부는, 상기 가상 공간에 사용자(또는 사용자 아바타 또는 사용자 그래픽 객체, 740)이 입장하면, 가상 공간상에 배치된 디지털 휴먼을 통해, 제1 기능에 대응되는 제1 가이드 정보 및 제2 기능 에 대응되는 제2 가이드 정보를 제공할 수 있다. 제어부는, 특정된 제1 기능 및 제2 기능의 우선 순위에 근거하여, 제1 가이드 정보 및 제2 가이 드 정보를 순차적으로 제공할 수 있다. 예를 들어, 제1 기능에는 제1 우선 순위가 할당되어 있고, 제2 기능에는 제1 우선 순위보다 낮은 제2 우선 순위가 할당되어 있다고 가정하자. 도 7b의 (a)에 도시된 것과 같이, 제어부는, 가상 공간에 배치된 디지털 휴먼을 통해, 제1 가이 드 정보(ex: “임*현님. 재산세 납부를 안내해드릴게요.”, 760)을 제공할 수 있다. 그리고, 도 7b의 (b)에 도시된 것과 같이, 제어부는, 제1 가이드 정보의 제공이 종료되는 것에 근거하여, 가상 공간에 배치된 디지털 휴먼을 통해, 제2 가이드 정보(ex: “계속해서 건강보험료 납부를 안내해 드릴게요.”, 770)를 제공할 수 있다. 즉, 제어부는 서로 다른 제1 기능 및 제2 기능이 처리되는 공간이 동일한 것에 근거하여, 상기 공간에 대응되는 가상 공간 상에서, 디지털 휴먼을 통해 제1 기능에 대응되는 제1 가이드 정보 및 제 2 기능에 대응되는 제2 가이드 정보를 순차적으로 제공할 수 있다. 한편, 제어부는 사용자 정보에 근거하여 적어도 하나, 서로 다른 공간에서 처리되는 복수의 기능을 특정할 수 있다. 그리고, 제어부는 서로 다른 공간 각각에 대응되는 복수의 가상 공간을 생성할 수 있다. 도 8a의 (a)에 도시된 것과 같이, 제어부는 사용자 정보에 근거하여, 제1 공간(ex: “은행”)에서 처리되 는 제1 기능(ex: “재산세 납부”, 811), 제2 공간(ex: “보건소”)에서 처리되는 제2 기능(ex: “보건증 발급 ”, 812) 및 제3 공간(ex: “도로교통공단”)에서 처리되는 제3 기능(ex: “운전면허증 발급”, 813)을 특정할 수 있다. 도 8a의 (b)에 도시된 것과 같이, 제어부는 제1 기능 내지 제3 기능(811 내지 813) 각각이 처리되는 공간 이 서로 다른 것에 근거하여, 제1 기능 내지 제3 기능(811 내지 813) 각각이 처리되는 복수의 가상 공간(821 내 지 823)을 생성할 수 있다. 예를 들어, 제어부는 제1 기능이 처리되는 공간 ex: “은행”)에 대응되는 제1 가상 공간, 제2 기능이 처리되는 공간 ex: “보건소”)에 대응되는 제2 가상 공간 및 제3 기능이 처리되는 공간 ex: “도로교통공단”)에 대응되는 제3 가상 공간을 생성할 수 있다. 이러한 복수의 가상 공간은, 복수의 서로 다른 실제 공간 각각에 대응될 수 있다. 나아가, 제어부는, 제1 기능 내지 제3 기능(811 내지 813)의 우선 순위에 근거하여, 제1 가상 공간 내지 제3 가상 공간(821 내지 823)의 배치를 순차적으로 할 수 있다. 예를 들어, 제1 기능에는 제1 우선 순위가 할당되어 있고, 제2 기능에는 제1 우선 순위보다 낮은 제2 우선 순위가 할당되어 있고, 제3 기능에는 제2 우선 순위보다 낮은 제3 우선 순위가 할당되어 있다고 가정 하자. 도 8의a (a)에 도시된 것과 같이, 제어부는, 제1 우선 순위에 대응하는 제1 가상 공간, 제2 우선 순 위에 대응하는 제2 가상 공간 및 제3 우선 순위에 대응하는 제3 가상 공간을 순차적으로 배치할 수 있다. 한편, 제어부는, 전자기기로부터 복수의 공간에 대한 입장 요청을 수신하는 경우, 사용자(또는 사용자 아바타 또는 사용자 그래픽 객체, 830)가, 복수의 가상 공간 중 제1 우선 순위에 대응하는 제1 가상 공간 에 입장하도록 제어할 수 있다. 도 8b의 (a)에 도시된 것과 같이, 제어부는 전자기기 상에, 제1 가상 공간을 제공할 수 있다. 그 리고, 제어부는 제1 가상 공간 상에, 제1 가상 공간(ex: “은행”))과 관련된 제1 디지털 휴먼(ex: “은행원”, 831)을 배치할 수 있다. 제어부는 제1 가상 공간 상에 존재하는 제1 디지털 휴먼을 통해, 제1 가이드 정보(ex: “임*현님. 재산세 납부를 안내해드릴게요.”, 841)를 제공할 수 있다. 나아가, 제어부는, 제1 가이드 정보의 제공이 종료되는 것에 근거하여, 전자기기 상에 제공되는 가상 공간을 전환할 수 있다. 그리고, 제어부는, 전환된 가상 공간 상에서, 가상된 전환 공간에 대응되는다른 실제 공간에서 종사하는 장사자의 인물 정보에 근거하여 생성된 디지털 휴먼에 의해, 상기 다른 실제 공간 에서 처리되는 기능에 대응되는 가이드 정보를 제공할 수 있다. 도 8b의 (c)에 도시된 것과 같이, 제어부는, 전자기기 상에서, 제1 가상 공간은 사라지고, 제2 우선 순위에 대응하는 제2 가상 공간이 제공되도록 제어할 수 있다. 제어부는 제2 가상 공간 상 에, 제2 가상 공간(ex: “보건소”)과 관련된 제2 디지털 휴먼(ex: “의사”, 832)을 통해, 제2 가이드 정보 (ex: “”임*현님. 보건증 발급을 안내해 드릴게요.”, 842)를 제공할 수 있다. 한편, 제어부는, 전자기기 상에 제공되는 가상 화면을, 제1 가상 공간에서 제2 가상 공간으 로 전환하기 전에, 도 8b의 (b)에 도시된 것과 같이, 가상 공간 전환을 안내하는 안내 정보(ex: “은행 업무가 완료되었습니다. 두번째 업무 처리를 위해 보건소로 이동하시겠습니까?”)를 제공할 수 있다. 즉, 제어부는 제1 가이드 정보 제공이 종료되는 것에 근거하여, 전지 기기 상에 가상 공간 전환을 안내하 는 안내 정보를 제공할 수 있다. 그리고, 제어부는 전자기기로부터 가상 공간 전환과 관련된 사용자 선택을 수신할 수 있다. 제어부는, 수신된 사용자 선택이, 가상 공간 전환에 대응하는 선택(ex: “예”, 851)이면, 전자기기상 에서, 가상 공간의 전환이 이루어지도록 제어할 수 있다. 이와 달리, 제어부는 수신된 사용자 선택이, 가상 공간 미전환에 대응하는 선택(ex: “아니요”, 852)이면, 전자기기 상에서 가상 공간의 전환을 제한할 수 있다. 한편, 도 8b의 (a)에 도시된 것과 같이, 제어부는 가상 공간이 표시되는 전자기기의 디스플레이 상에, 서브 맵을 오버랩 하여 표시할 수 있다. 여기에서, “서브 맵“은, 특정된 기능이 처리되는 공간에 대한 지도로 이해될 수 있다. 제어부는, 서브 맵 중, 전자기기에 표시되는 가상 공간에 대응되는 일 영역 상에 위치 그래픽 객 체을 표시할 수 있다. 예를 들어, 도 8b의 (a)에 도시된 것과 같이, 전자기기의 디스플레이 상에 제1 가상 공간이 표시 되고 있는 경우, 서브 맵 중 제1 가상 공간에 대응되는 영역 상에, 위치 표시 그래픽 객체를 표 시할 수 있다. 다른 예를 들어, 도 8b의 (c)에 도시된 것과 같이, 전자기기의 디스플레이 상에 제2 가상 공간이 표시되고 있는 경우, 서브 맵 중 제2 가상 공간에 대응되는 영역 상에, 위치 표시 그래픽 객체 를 표시할 수 있다. 본 발명에 따른 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법은, 카메라를 이용하여, 공간에 방문한 사용자의 얼굴 이미지를 센싱하고, 사용자 DB로부터 상기 얼굴 이미지에 대응되는 사용자 정보를 추출하여, 사 용자의 공간 방문 목적을 특정할 수 있다. 이와 같이, 본 발명은 사용자로부터 공간 방문 목적을 입력 받는 과 정을 생략할 수 있다. 따라서, 사용자는 공간 방문 목적을 일일이 설명하지 입력하지 않더라도, 업무 처리에 필 요한 안내 서비스를 제공받을 수 있고, 서비스를 제공하는 공간에서는 서비스 제공 시간을 단축시킬 수 있다. 나아가, 본 발명에 따른 사용자 공간 방문 목적에 근거한 디지털 휴먼 제공 방법은, 공간과 관련된 디지털 휴먼 을 통해, 사용자의 공간 방문 목적에 대응되는 가이드 정보를 제공할 수 있다. 이를 통해, 사용자는 텍스트 (text)나 이미지(image)를 통한 안내 서비스보다 직관적이고 편리한 서비스를 제공받을 수 있으며, 서비스를 제 공하는 공간에서는 서비스 제공을 위한 인력을 최소화하여 최대의 효율을 이끌어 낼 수 있다. 한편, 컴퓨터가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽힐 수 있는 데이터가 저장되는 모든 종류의 기 록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다. 나아가, 컴퓨터가 읽을 수 있는 매체는, 저장소를 포함하며 전자기기가 통신을 통하여 접근할 수 있는 서버 또 는 클라우드 저장소일 수 있다. 이 경우, 컴퓨터는 유선 또는 무선 통신을 통하여, 서버 또는 클라우드 저장소 로부터 본 발명에 따른 프로그램을 다운로드 받을 수 있다. 나아가, 본 발명에서는 위에서 설명한 컴퓨터는 프로세서, 즉 CPU(Central Processing Unit, 중앙처리장치)가 탑재된 전자기기로서, 그 종류에 대하여 특별한 한정을 두지 않는다. 한편, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2023-0101798", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 디지털 휴먼 제공 시스템을 설명하기 위한 개념도이다. 도 2는 본 발명에 따른 디지털 휴먼 제공 방법을 설명하기 위한 흐름도이다. 도 3, 도 4, 도 5 및 도 6은 본 발명에서 디지털 휴먼을 통해 안내 서비스를 제공하는 방법을 설명하기 위한 개 념도들이다. 도 7a, 도 7b, 도 8a 및 도 8b는 본 발명에 따른 안내 서비스 제공을 위한 가상 공간을 설명하기 위한 개념도들 이다."}
