{"patent_id": "10-2022-0028942", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0131708", "출원번호": "10-2022-0028942", "발명의 명칭": "농식품 빅데이터와 AI 기반 농식품 거래 시스템", "출원인": "(주) 에이비씨푸드서비스", "발명자": "양완성"}}
{"patent_id": "10-2022-0028942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "경락가 제공 서버를 통해 입력된 전국 도매시장 실시간 농식품 경락정보, 소비자 단말기를 통해 입력된 농식품주문량 및 공급자 단말기를 통해 입력된 농식품 판매량과 관련된 데이터를 수집하는 농식품 데이터 저장부;상기 소비자 단말기로부터 수집된 소비자 주문량 및 상기 공급자 단말기로부터 수집된 공급자 판매량 정보를 기반으로 농식품의 전체 예상 판매량을 산출하여 데이터베이스에 저장하는 농식품 전체 예상 판매량 산출부; 및상기 공급자 단말기로 상기 산출된 농식품의 전체 예상 판매량 정보를 제공하는 농식품 판매 예측 정보 제공부;를 포함하는 농식품 빅데이터와 AI 기반 농식품 거래 시스템."}
{"patent_id": "10-2022-0028942", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 농식품의 전체 예상 판매량 정보를 이용하여 농식품 가격을 분석하는 농식품 가격 분석부;를 더 포함하는농식품 빅데이터와 AI 기반 농식품 거래 시스템."}
{"patent_id": "10-2022-0028942", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 농식품 빅데이터와 AI 기반 농식품 거래 시스템에 관한 것으로, 경락가 제공 서버를 통해 입력된 전국 도매시장 실시간 농식품 경락정보, 소비자 단말기를 통해 입력된 농식품 주문량 및 공급자 단말기를 통해 입력된 농식품 판매량과 관련된 데이터를 수집하는 농식품 데이터 저장부, 소비자 단말기로부터 수집된 소비자 주문량 및 공급자 단말기로부터 수집된 공급자 판매량 정보를 기반으로 농식품의 전체 예상 판매량을 산출하여 데이터베 이스에 저장하는 농식품 전체 예상 판매량 산출부 및 공급자 단말기로 산출된 농식품의 전체 예상 판매량 정보를 제공하는 농식품 판매 예측 정보 제공부를 포함한다."}
{"patent_id": "10-2022-0028942", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 농식품 빅데이터와 AI 기반 농식품 거래 시스템에 관한 것으로, 보다 상세하게는, 농식품 빅데이터와 물류 중심의 공급망관리(SCM) 시스템을 활용하여 농식품 거래를 위한 유통구조를 개선시킬 수 있는 농식품 빅데 이터와 AI 기반 농식품 거래 시스템에 관한 것이다."}
{"patent_id": "10-2022-0028942", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전국 5개 권역에 물류센터 8개소를 운영함으로써 효율적인 물류 네트워크 및 공급사슬관리(SCM) 기반 구축 계획 을 수립하고 있다. 크게 수도권(안성1, 평택, 안성2), 영남권(밀양, 군위), 호남권(장성), 강원권(횡성), 제주 권 등 전국 단위에 분포되어 있으며, 사업별로 허브(안성, 평택) 및 거점물류센터(밀양, 장성, 횡성, 제주)를 연계시키는 물류전략을 추진하고 있다. 8개 물류센터 중 2013년 9월 개장한 안성 농식품물류센터(대표적 DC형 신선농산물 WET 센터)가 농산물을 취급하 고 있으며, 식품 전문 도매 물류센터의 역할을 수행하고 있으며, 각 물류센터는 배송, 가공상품화(전처리, 소포 장), 저장 기능을 수행한다. 농산물 조달은 가입된 회원들로부터 1년 전 연간월간, 상품별 판매 및 구매계획을 받아서 품목별로 산지와의 계 약재배나 산지주문으로 조달한다. 이에 따라 조달상품과 판매상품의 동기화가 가능하여 연중 수급 불균형에 의 한 판매나 조달의 장애요인을 최소화하고 있는 상태이다. 이에 비해 도매시장의 수급은 공급자와 수요자의 의사 결정에 의해 이루어지기 때문에 공급량과 수요량 간에는 항상 동기화가 이루어지기 어려울 뿐만 아니라 그 결과 수급불균형으로 인한 가격변동 현상이 발생하고 있다. 상품조달은 대체로 배송일(입고일) 2일 전에 전산 자동 수·발주 시스템으로 발주량이나 가격이 확정된다. 실제 구매상품의 등급이나 품질은 판매처의 구매계획에 의해 실행되며, 대체로 중앙회나 계열사 업체의 머천다이징 특성상 전체 구매물량의 70% 정도는 상품이며, 나머지 약 30% 수준은 중품으로 파악되고 있다. 코로나 19로 인해, 오프라인 대면 서비스보다는 온라인 비대면 서비스가 폭발적으로 증가하고 있다. 농식품 관 련해서, 기존의 B2C 기반 식자재 시장에도 많은 온라인 오픈 플랫폼이 존재하지만, 전북 지역의 영세 소상공인, 중도매인들이 이용하는 오픈 마켓의 경우에는 상품수가 적어(약 3천여 개), 단체 급식소와 같은 대량의 식자재 를 구매하는 업체의 경우 이들을 이용하는 데 한계가 있다. B2B 기반 수발주 관리 시스템의 경우에도 유통사와 고객사를 직접 연결하는 구조로, 고객 기호도 분석, 판매 동 향 분석, 다양한 납품업체, 유통사, 고객사 등을 수평적 구조로 관리한다. 그러나 기존 오픈 플랫폼들은 전북 지역을 기반으로 저렴한 가격에 농식품을 제공할 수 있는 유통망은 갖추었지만, 전 지역의 대리점(지역 기반의 소형 유통사)을 통해 전국으로 사업을 확장할 수 있는 다단계 유통 마케팅 모델(예를 들어, 납품업체, 대형 유 통사, 대형 유통사 밑에 여려 개의 소형 유통사, 고객사와 같은 구조)이 지원되지 않는다. 따라서, 본 발명은 스마트 물류 및 빅데이터를 활용한 수요변동 분석 및 인공지능(AI) 신경망을 이용하여 가격 변동을 예측할 수 있는 농식품 빅데이터와 AI 기반 농식품 거래 시스템을 제공하고자 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 10-1754734호(2017.06.30 등록)"}
{"patent_id": "10-2022-0028942", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로, 본 발명은 농식품 빅데이터와 물류 중심의 공 급망관리(SCM) 시스템을 활용하여 농식품 거래를 위한 유통구조를 개선시킬 수 있는 농식품 빅데이터와 AI 기반 농식품 거래 시스템을 제공하기 위한 것이다."}
{"patent_id": "10-2022-0028942", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템은 경락가 제공 서버를 통해 입력된 전 국 도매시장 실시간 농식품 경락정보, 소비자 단말기를 통해 입력된 농식품 주문량 및 공급자 단말기를 통해 입 력된 농식품 판매량과 관련된 데이터를 수집하는 농식품 데이터 저장부, 소비자 단말기로부터 수집된 소비자 주 문량 및 공급자 단말기로부터 수집된 공급자 판매량 정보를 기반으로 농식품의 전체 예상 판매량을 산출하여 데 이터베이스에 저장하는 농식품 전체 예상 판매량 산출부 및 공급자 단말기로 산출된 농식품의 전체 예상 판매량 정보를 제공하는 농식품 판매 예측 정보 제공부를 포함한다. 또한, 농식품 빅데이터와 AI 기반 농식품 거래 시스템은 상기 농식품의 전체 예상 판매량 정보를 이용하여 농식 품 가격을 분석하는 농식품 가격 분석부를 더 포함할 수 있다."}
{"patent_id": "10-2022-0028942", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템에 의하면, 농식품 빅데이터와 물류 중심의 공급망관리(SCM) 시스템을 활용하여 농식품 거래를 위한 유통구조를 개선시킬 수 있다."}
{"patent_id": "10-2022-0028942", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는"}
{"patent_id": "10-2022-0028942", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다.비록 제1, 제2 등이 다양한 소자, 구성요소 및/또는 섹션들을 서술하기 위해서 사용되나, 이들 소자, 구성요소 및/또는 섹션들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 소자, 구성요소 또 는 섹션들을 다른 소자, 구성요소 또는 섹션들과 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 소자, 제1 구성요소 또는 제1 섹션은 본 발명의 기술적 사상 내에서 제2 소자, 제2 구성요소 또는 제2 섹션 일 수도 있음은 물론이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"이루어지다(made of)\"는 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 이때, 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭하며, 처리 흐름도 도면들의 각 구성과 흐름 도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴 퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 구성(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 또한, 몇 가지 대체 실시예들에서는 구성들에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능함을 주목 해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 구성들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 구성들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이하, 첨부된 도면들을 참조하여 본 발명의 기술적 특징을 구체적으로 설명한다. 유통구조 개선을 위한 공급망관리(SCM) 시스템 기반 농식품 전용 플랫폼(즉, 농식품 빅데이터와 AI 기반 농식품 거래 시스템) 구축을 위해 공급망관리(SCM) 요소별 기반을 구축해야 한다. 첫번째 SCM 요소별 기반 구축은 거래시스템과 참여주체 조직화이다. 성공적인 농산물 SCM 시스템 구축을 위해서는 SCM 참여 유통주체 간 지속 적이고 고정적인 거래시스템의 구축이 필요하다. 도매시장 반입량에서 산지유통인의 반입 비중이 매우 높으며, 산지유통인과 도매시장법인의 거래 형 태는 대부분 단골거래 형태로 이루어진다. 그러나 현재의 개별 산지유통인 중심의 시장참여와 경매제 도매시장 의 운영시스템을 고려하면 단골거래 형태는 불안정한 거래라고 할 수 있다. 왜냐하면 산지의 수많은 개별 산지 유통인들은 오랜 기간 특정 도매시장법인과의 단골거래 관계를 유지하고 있지만, 특정 도매시장 법인에 대한 지 속적인 거래는 개별 산지유통인의 의사결정에 따라 언제든지 바뀔 수 있는 상태이기 때문이다. 따라서 단골 거 래를 통해 안정적이고 지속적인 SCM을 위해서는 단골거래 주체의 대규모 법인 조직화와 안정적인 단골거래를 위 한 제도가 마련되어야 한다. 노지채소류의 산지유통인과 도매시장법인 간 장기적·고정적 거래관계 유지를 위해서는 우선적으로 합리적인 거 래제도가 모색되어야 할 것이다. 예를 들면 SCM 도입 시 거래방법은 경매제에 비해 가격의 변동 폭이 완화되어 SCM 성과의 변동 폭이 크지 않고 주체 간 합의가격 도출이 가능한 수의매매 방법을 적용하는 것도 검토해 볼 필 요가 있다. 경매제 도매시장에서 SCM을 위한 거래제도의 변화는 수의매매뿐만 아니라 경매를 제외한 정가제나 선취매매 등 도 적극 검토할 필요가 있을 것이다. 또한 산지와 도매시장 간 조정된 출하물량(예약출하물량 등)은 정가·수의 매매로 거래하고, SCM 시스템 도입 시 정가·수의매매를 적용하기 위한 제도적 개선이 필요할 것으로 판단된다. 그리고 노지채소류에 대한 시범적인 SCM 시스템 도 입 후 중장기적으로 SCM 시스템의 전국적인 확대가 이루어질 경우 노지채소류에 대한 도매시장 거래제도를 의무적 정가·수의매매제 등 거래제도의 전환 이 필요할 것으로 판단된다. 또한 장기적으로 규모화 된 시장도매인제의 점진적 확대를 통해 SCM 시스템 확대가 필요할 것이며, 기존 강서도매시장 시장도매 인의 규모화를 통한 SCM 시범 사업도 검토가 필요하다. 다음으로 유통주체의 조직화가 필요하다. 수급 및 가격이 불안정적이고 고비용·저효율의 노지채소류에 대한 성 공적인 SCM 시스템 구축과 도입을 위해서는 도매시장 거래제도의 전환과 동시에 산지유통인의 법인 조직화와 관련된 정책의 개선이 필요하다. 기존에 조직된 대부분의 산지유통인 법인은 농업회사법인 조직 형태일 뿐만 아니 라 법인 회원들의 시장참여 형태가 대부분 개별적으로 이루어지고 있으며, 산지 유통사업에 적극적으로 활동하 고 있는 회원도 소수에 불과하다. SCM 참여주체와 관련하여 산지유통인의 조직화 방향은 영세한 수준의 회사법인 형태보다는 자격을 갖춘 조직을 중심으로 전국 단위의 품목별 광역조합이나 품목별 대표조직으로 육성하는 것이 바람직할 것으로 판단된다. 그 림 2-3는 산지유통인 조직의 계열화 및 규모화 전개 방향을 보여준다. 두번째 SCM 요소별 기반 구축은 산지와 도매단계의 통합정보 네트워크화이다. 성공적인 SCM 시스템의 핵심 중 하나는 참여주체들이 전체 공급사슬의 정 확하고 투명한 정보를 동시에 교류하 고 공유할 수 있는 시스템 구축이라고 할 수 있다. SCM 공급사슬의 유통단계·유통주체 간 정확한 하나의 정보 가 동시에 공유·교류되지 않고 하나의 사실에 대해 유통주체나 유통단계별로 서로 다른 정보가 교환·분산되면 SCM의 궁극적인 목적을 달성하기가 어려울 것으로 판단된다. 왜냐하면 동일한 공급사슬에 참여하는 다양한 구성 원들이 서로 다른 정보를 가지고 있을 경우 각각의 구성원들은 서로 다른 개별적인 의사결정으로 할 것이며, 이 경우 공동목표를 위한 시장행위가 이루어질 수 없을 것이기 때문이다. 노지채소류 SCM 시스템 구축과 도입의 성공적인 실현을 위해서는 우선적으로 산지와 소비지 도매시장의 통합정 보시스템이 구축되어야 할 것이다. 현재 주요 노지채소류의 70~90% 정도가 농가와 산지유통인과의 계약에 의해 재배·생산관리 및 수확·출하가 이루어지고 있다. 농협이 정책사업의 일환인 계약 사업으로 주도하고 있는 비 중은 10% 내외 수준에 불과하다. 전체 산지유통 중 농협이 농가와의 계약 사업으로 차지하고 있는 10% 정도의 사업 물량과 농가 수로는 실질적인 산지유통 통합정보로서의 효과가 미미한 것으로 판단된다. 전체 노지채소류 의 80% 정도가 소비지 도매시장으로 반입되고 있는 상태에서 10% 정도의 산지 유통정보로는 SCM의 목적을 달성 할 수 없는 것이다. 이 경우 도매시장법인이 출하주체인 산지유통인 조직으로부터 획득하는 정보량이나 정보의 정확성과 그리고 산지유통인 조직이 도매시장으로부터 획득하는 도매 시장 정보(도매시장법인 및 중도매인의 정 보)에는 큰 차이가 날 뿐만 아니라 유통주체 간 정보 교환과 공유의 신뢰성이 떨어질 것이다. 노지채소류의 재배·생산의 특성상 통합정보시스템 구축을 위해서는 장기적으로는 품목별 광역지역 주산지 단위 나 전국 단위의 산지유통 통합정보가 생산되고 분산되어야 할 것이다. 그러나 전국 단위의 산지유통 통합정보 네트워크화는 막대한 비용과 시간이 소요되며, 기술적으로 용이하지 않을 것으로 예상되기 때문에 SCM 시스템 측면에서는 우선적으로 SCM 참여주체인 산지와 소비지 유통주체를 중심으로 네트워크화 하는 것이 바람직할 것으로 판단된다. 산지유통 통합정보의 내용은 재배·생산관리 정보가 포함되며, 유통정보에는 품목별·품종별 수확시기, 수확량, 출하처별 출하물량, 품질, 물류정보 등이 반드시 포함되어야 할 것이다. 그리고 물류정보에는 산지 저장량, 저 장 물량 출하정보, 출하처별 출하량, 수송정보 등이 포함되어야 될 것이다. 산지유통 통합정보 네트워크화와 동시에 소비지 도매시장 통합정보시스템화도 구축되어야 한다. 도매시장 내 통 합정보는 도매시장법인이 주체가 되어 산지 물량이 도매시장에 반입된 이후부터 반출까지의 모든 유통·물류 정 보가 포함되어야 한다. 그리고 필요시에는 산지의 재배·생산 관련 의사결정에 영향을 미치는 소매단계 정보와 소비자 정보도 포함될 수 있을 것이다. 도매단계 통합정보에 포함되는 정보는 거래정보, 물류정보, 지원정보, 권고 정보, 소매 및 소비자 정보 등이 포함될 수 있을 것이다. 거래정보에는 품목별·등급별 거래가격, 거래방 법별 가격 등이며, 물류정보에는 품목별·품종별·등급별 반입물량과 거래량, 도매시장법인 재고량, 중도매인 분산정보와 재고정보 등이 포함될 수 있다. 지원정보에는 출하예약 정보, 구매예약 정보, 정산 및 결제 정보 등 이 있다. 그리고 소매 및 소비자 정보에는 소매상 구매 패턴, 선호 품종 및 등급, 선호 포장, 소매점 판매정보, 소비자 소비 패턴 등의 정보가 포함된다. 세번째 SCM 요소별 기반 구축은 정보 교환 및 공유시스템 구축이다. 산지와 소비지 도매단계의 통합정보 생산의 체계화와 동시에 SCM에 참여하는 유통주체 간 통합정보의 실시간 교 환과 공유를 위한 관련 시스템이 구축되어야 한다. 정보 교환·공유시스템은 우선적으로 SCM 공급사슬의 산지유 통인 법인 조직과 소비지 도매시장의 대규모 도매시장법인 간에 구축되는 것이 필요하다. 시스템의 내용은 현재 지역농협과 중앙회 도매사업단이나 유통사업단 간 시스템과 유사한 수준으로 구축되는 것이 필요할 것으로 판단 된다. SCM 참여주체 간 통합정보의 교환·공유시스템을 위해서는 우선적으로 SCM 참여 주체 간 중·장거리 통신 망(MAN, WAN) 구축이 필요하며, 교환 방식으로는 EDI 시스템의 구축이 필요하다. 또한 통신망에는 자동 수·발 주시스템, 정보교환·공유시스템 등이 구축되어야 할 것이다. 그리고 도매시장 내 도매시장법인과 중도매인 간정보통신망으로는 근거리통신망(LAN)의 구축이 필요하다. 산지와 도매시장 간 통합정보의 교환·공유시스템을 구축하기 위해서는 단계 별로 추진하는 것이 바람직할 것이다. 1단계에서는 품목별 전국 산지유통인 법인 조직의 실체와 구체적인 거래실적 및 품목별 시장지배력을 파악 하고, 도매 시장 중 품목별 전국 기준가격을 제시하는 도매시장(예: 가락시장)과 지역의 선도가격을 제시하는 도매시장을 선정해야 한다. 그리고 선정된 도매시장에서 품목별 취급 비중이 높은 도매시장법인을 선정하여 시 장지배력이 높은 개별 산지유통인 법인 조직과 도매시장법인 간에 정보시스템을 구축해야 한다. 즉 1단계는 SCM 에 직접 참여하는 유통 주체 간에 한정되는 시스템을 구축하는 것이다. 2단계에서는 농산물 SCM의 광역화와 일반화에 대응하는 차원에서 품목별 산지유통인 법인조직의 전국적인 연합 조직을 구성하여 품목별 시장점유율이 높은 전국의 대표적 도매시장법인 조직 간에 정보시스템이 구축되어야 한 다. 도 1은 본 발명의 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템을 나타내는 도면이다. 농식품 빅데이터와 AI 기반 농식품 거래 시스템은 빅데이터 및 인공지능(AI)을 활용한다. 여기서, 농식품 분야에 활용할 수 있는 빅데이터는 여러 기관 및 출처로부터 다양하게 생성되고 있다. 농산업 밸류체인 단계별로 예를 들면, 생산분야의 스마트팜 데이터, 유통단계에서 도매시장가격 데이터, 소매단계에서 POS 데이터 및 소비단계에서 가계지출 데이터 등을 빅데이터 분석에 활용할 수 있다. 빅데이터의 세 가지 대표적인 특성(3V, Volume, Variety, Velocity) 중에서 한 개의 특성이라도 보유할 경우 농 림업분야의 빅데이터라고 정의된다. 즉, 데이터의 규모(Volume), 데이터 종류 및 출처의 다양성(Variety), 데이 터 입출력의 속도(Velocity)가 빅데이터가 가지는 장점이자 특징이라고 할 수 있다. 3V 중 Volume(규모)은 빅데이터를 상징하는 가장 기본적인 특성으로 데이터의 크기를 의미하며, 축적되는 데이 터의 크기가 수직 확장성의 물리적 한계를 초과하는 거대한 데이터를 의미한다. Variety(다양성)는 데이터의 다양성으로 다양한 형식과 채널을 의미하며, 여러 데이터 형식의 통합을 뜻한다. 형식에 따라서 빅데이터의 유형을 구분한다면 정형, 반정형, 비정형으로 나눌 수 있다. 정형(Structured) 데이 터는 고정된 필드에 저장된 데이터로서 관계형 데이터베이스 및 스프레드시트 등이 해당된다. 반정형(Semi- structured) 데이터는 고정된 필드에 저장되어 있지는 않지만 메타데이터나 스키마, XML 및 HTML 텍스트 등을 포함한다. 비정형(Unstructured) 데이터는 고정된 필드에 저장되어 있지 않은 데이터로서 텍스트분석이 가능한 문서 및 이미지, 동영상, 음성 데이터 등이 해당된다. 마지막으로 Velocity(속도)는 데이터의 변화와 축적 및 분석속도를 의미하며, 대규모 데이터 처리 및 활용도 제 고를 위해서는 실시간 데이터 처리 및 분석속도가 중요하다. 표 3-7은 빅데이터의 수집부터 활용단계까지 설명 한 것이며, 웹데이터, 센서데이터 등을 수집하고 데이터베이스 및 데이터창고로 저장 후 데이터 마이닝, 텍스트 키워드 방법으로 분석할 수 있다. 분석결과는 생산성 향상, 소비자 효용 증가 등의 가치를 창출하는 데 활용할 수 있다. 데이터 생성 기관 및 형태별로는 정부기관(농림축산식품부, 축산물품질평가원, 농촌진흥청, 산림청, 농협중앙회, 농림수산식품교육문화정보원 등)에서 생성한 정형데이터, 민간부문에서 생성된 정형데이터(농협 출 하 및 판매 데이터, 스마트팜 데이터 등), 비정형 데이터(웹 데이터, 이미지 데이터 등)로 구분할 수 있다. 정부기관에서 생성하는 빅데이터는 농업경영체 정보, 소고기이력제 정보, 농수축산물경락 정보, 소비자패널 정 보 등이 대표적이다. 비공개되는 자료가 있지만 일부 데이터는 각 기관별 홈페이지와 공공데이터포털에서 파일 데이터와 오픈 API 형태로 공개되고 있다. 농림업부문에서 생성되는 대표적인 민간데이터는 농협과 농가단위에 서 생성되는 데이터이며, 활용 수요는 높지만, 자료의 수집 및 공개가 어려운 실정이다. 비정형데이터는 포털사 이트에서 생성되는 웹 데이터와 기상, 작황 등과 관련된 이미지 데이터들이 대표적이다. 빅데이터 속성이 3V를 모두 충족시켜야 한다면 유통, 소비분야 민간업체의 데이터를 제외하고 농림업분야에 존 재하는 빅데이터는 거의 없는 실정이다. 정형데이터는 농협의 출하 및 판매데이터와 농가데이터이며, 비정형데 이터는 웹에서 키워드로 검색할 수 있는 데이터, 농작물 생육상황 등을 기록한 이미지 데이터 등이다. <농식품 분야 빅데이터 시스템 구축 활용> 농식품 분야 빅데이터 시스템은 빅데이터를 관리·통제를 위한 검색, 수집, 저장, 관리, 분석을 가능케 하는 처 리기술이다. 농산물 분야 빅데이터 시스템 구축하기 위해 하둡(Hadoop) 기술을 적용할 계획이다. 하둡(Hadoop)기술은 파일 시스템과 분산처리에 초점을 두고 있는 플랫폼이지만 이를 기반으로 한 다양한 에코 시스템이 구축 됨으로써, 산업계 표준으로 자라잡고 있다. 정보의 형태 및 그 표현 구조가 상호 이질적인 다양한 구조(정형/비정형)의 특성을 가지는 빅데이터의 처리 시 에 요구되는 요소 기술들의 총체를 하둡 에코시스템이라 한다. 요소기술들은 어그리게이터(Aggregator)에서 농산물 데이터를 수집하고 리얼타임 어날러시스에서 (Real-time Analysis)에서 병렬 분산 처리하여 데이터 스토어에 저장한다. 그리고 실증시험을 통해 축적된 다양한 농산물 품목과 거래내역을 기반으로 빅데이터 분석 시스템 개발을 위한 시스템 구축을 고려중이다. 빅데이터 처리기술로는 대표적으로 데이터 분석 기술, 데이터 표현 기술, 분석 플랫폼 기술로 3가지로 구분된다. 데이터 분석 기술은 데이터를 분석하는 기술과 방법을 의미하며 통계, 데이터마이닝, 기계학습, 자연어 처리, 패턴인식 등이 이에 해당된다. 데이터 분석 기술은 ① 하둡 기반의 데이터 처리, ② 분산된 파일의 처리 시 최적화된 하둡은 저장장치를 병렬 로 연결시켜 데이터를 처리함, ③ 별도의 스토리지가 필요 없음, ④ 대규모 데이터를 빠르게, 비용 효율적으로 처리 시 적합, ⑤ NoSQL 기반의 데이터 처리, ⑥ SQL의 사용없이 대량의 데이터를 빠르게 처리하는 기술, ⑦ MapReduce 기반의 데이터 처리, ⑧ 비구조화된, 즉 비정형 데이터를 정형의 데이터로 구조화하는 기술을 포함한 다. 상기 데이터 분석 기술들은 데이터의 안정성이 정합성보다 속도, 비용에 초첨을 맞추어 왔으므로 일부 데이터의 유손실의 발생해도 처리 결과가 영향을 받지 않는 업무에 적합하고, 로그 데이터의 처리 혹은 분석하는 업무에 적합하다. 데이터 표현 기술은 데이터 시각화를 의미하며, 분석된 데이터의 특징이나 의미를 쉽게 알 수 있도록 표현해주 는 기술이다. 데이터 표현 기술의 대표적인 시각화 표현 기술은 R기반의 데이터 표현 기술이고, 통계 계산 및 시각화를 위한 언어 및 개발환경을 제공하며, 기본적인 통계기법으로 모델링, 최신 데이터 마이닝, 시뮬레이션, 수치해석 기법 까지 구현이 가능하다. 데이터 표현 기술의 구현 결과는 그래프 등으로 시각화할 수 있고, 기타 프로그래밍 언 어와 연결도 용이하다. 또한, 게놈, 신약연구와 금융 예측분석에 활용되고 있다. 분석 플랫폼(인프라) 기술은 분석과 표현을 수행할 수 있도록 해주는 기반 기술을 의미한다. 분석 플랫폼(인프라) 기술은 다시 대규모 데이터를 안정적으로 수집해서 저장하는 기술, 저장된 데이터를 효과 적이면서도 빠르게 처리할 수 있는 기술, 저장된 데이터를 다양한 방식과 용도로 사용할 수 있도록 가공하고 관 리해주는 기술 등으로 나누어 진다. 분석 플랫폼(인프라) 기술에는 BI(Business Intelligence), DW(Data Wearhousing), Cloud Computing, 분산 데 이터베이스(NoSQL), 분산 병렬처리(Hadoop MapReduce), 분산파일시스템 등이 분산 플랫폼(인프라)에 속하는 기 술이다. 배치 어날러시스(Batch Analysis)에서 공급량, 수요량, 가격 및 비정상적 판매 행위 검출을 위해 사용되는 분 석 기법은 시계열 분석, 회귀분석, 군집 분석 의 세 가지를 적용한다. 시계열(Time series)은 시간에 따른 측정, 관측 치의 변화를 계열화하고, 시계열 분석은 시계열 데이터의 변동 을 분석, 시계열 분석의 주요 목적인 수요, 공급, 단가 예측 시도를 위해 다음과 같이 경향(Trend)과 주기 (Cycle), 계절성 (Seasonality), 불규칙성(Irregular)을 분석한다. 여기서 경향(Trend)은 장기적으로 증가하거 나 감소하는 추세인지 분석하며, 주기(Cycle)는 일정 주기로 변화가 있는지 분석하며, 아래 예시는 시간이 지남 에 따라 주기를 가지고 점차로 상승·하강하는 경향을 나타낸다. 계절성(Seasonality)은 월, 분기, 계절, 년 단 위로 유사한 패턴이 일어나는지 분석하며, 여름철에 채소의 소비가 증가하여 가격이 상승을 확인한다. 불규칙성 (Irregular)은 패턴을 보이지 않고 불규칙하게 변화한다. 회귀 분석은 원인이 되는 독립 변수와 영향을 받는 종속 변수 사이의 함수 관계를 분석하는 방법으로 종속 변수 에 영향을 미치는 인과 관계를 먼저 판단하는 것이 중요하다. 가격에 영향을 미치는 것은 수요량과 공급량으로 보고 과거의 데이터를 토대로 함수식을 도출할 수 있다.군집 분석은 데이터의 유사성이 큰 것들끼리 모음으로써 그룹 내의 동질성을 극대화하고 서로 다른 그룹 간에는 이질성을 극대화 한다. 군집 분석을 통해 문제가 발생했던 비정상적 군집 형태 경매 행위를 감지하여 온라인 판 매 시 유형별 부정 사용방지를 위한 방안도 시도한다. 외부연동 시스템은 Push 서버 연동, 시세정보 서버 연동, SNS 연동을 하여 여러 가지 정보를 제공한다. OPEN API를 이용하여 도매시장의 정확한 농산물 시세정보를 받아와 출하자와 소상공인에게 제공한다. 본 발명의 실시예에 따른 농식품 전용 플랫폼에서 농식품의 거래 품목, 시세정보, 고객 소비 성향 및 패턴 등 빅데이터를 활용할 수 있으며, 추후 AI 분석 과정을 통해 농식품 데이터 마켓 시장 진출이 가능하며, 플랫폼상 의 모든 공급자, 고객사, 유통사의 품목별 가격과 거래량 등을 가격 예측 모델에 활용할 수 있도록 빅데이터를 구축할 예정이다. 구축된 빅데이터를 근거로, 가격 예측에 따라 스마트 팜 농업에 활용할 수 있을 것으로 판단되며, 자사 플랫폼 (즉, 농식품 빅데이터와 AI 기반 농식품 거래 시스템) 런칭 이후 3년 안에 인공지능(AI)와 접목한 분석 데이터 를 판매할 수 있는 데이터 마켓 시장이 더욱 활성화될 것이다. <데이터 수집 및 저장, 전처리 및 분류, 분석, 시각화 등 빅데이터 활용> 본 발명의 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템을 통해 농산물의 생산부터 유통, 소비 까지 전 과정의 데이터 수집 및 저장, 전처리 및 분류, 분석, 시각화 등 빅데이터 활용이 가능하며, 데이터 처 리 과정을 통해 실제 서비스(문제해결)을 지원한다. 빅데이터를 활용한 농식품 전용 플랫폼 예상도를 설명하면 다음과 같다. 크게 데이터 소스와 제안한 농식품 빅 데이터와 AI 기반 농식품 거래 시스템, 서비스를 구분해 볼 수 있다. 데이터 소스는 크게 내부데이터(자체 수집 가능 자사 데이터)와 외부데이터(웹 & SNS 데이터, 타 회사 데이터) 로 구분할 수 있다. 이러한 데이터들은 크롤러나 Open API를 통해 수집이 된다. 농식품 빅데이터와 AI 기반 농식품 거래 시스템은 크게 수집 및 저장, 전처리 및 분류, 분석, 시각화 부분으로 구성되어 있다. 각 부분의 역할은 다음과 같다. 수집 및 저장 부분은 연계모듈 관련하여 연계 관리에 해당한다. 구체적으로, 수집 및 저장 부분은 ① 정형/비정 형 데이터 수집, ② 메타 데이터 관리(메타 데이터 DB, 메타 어휘 사전), ③ 데이터 저장(RDB, NoSQL, 분산처리 를 통해 수많은 데이터를 저장하고 처리하는 기술인 하둡(Hadoop) 프레임워크 이용 원천 DB 생성) 등을 수행한 다. 전처리 및 분류 부분은 연계모듈 관련하여 정체 및 비식별화에 해당한다. 구체적으로, 전처리 및 분류 부분은 ① 수집된 정형/비정형 데이터의 비식별화 처리, ② 저장된 데이터의 데이터 품질관리/분류(데이터 표준화/자동 분류, 원천 DB에서 분석 DB를 거쳐 개방 DB 생성) 등을 수행한다. 분석 부분은 연계모듈 관련하여 분석도구/모형에 해당한다. 구체적으로, 분석 부분은 ① 데이터 분석(통계 분석, 기계학습, 인공지능(AI) 기술 적용), ② 데이터 분석 이후 분석 모형, 알고리즘 탐색 및 선정, ③ 데이터 분석 이후 실제 서비스(문제 해결) 가능 등을 수행한다. 시각화 부분은 분석 모형, 알고리즘 탐색 및 선정 후 시각화가 가능하다. 구체적으로, 시각화 부분은 GUI 기반 분석 툴인 GIS, R, Tableau를 이용하고, 시각화 DB를 생성한다. <빅데이터를 활용한 수요변동 분석 및 AI를 이용한 가격예측 모형 개발> 웹상에서 생성되고 있는 메시지를 이용하여 소비자 관심지수를 산출한 후 소비자 관심지수와 실제 소비량 사이 의 관계를 검토함으로써 소비자 관심지수가 소비량 변화의 즉각적 지표로서 활용하여 특정 농식품 공급 확보를 통한 매출 증대가 가능하다. 분석자료는 비정형데이터(뉴스, 블로그, 카페, 웹페이지 등)를 활용하였으며, 시계열 회귀모형 분석, 비정형데 이터의 수집 및 처리과정 등을 통해 분석할 수 있다. 이를 통해 웹 기반 메시지로부터 현재의 소비자관심을 반 영하는 지표 구성이 가능할 뿐 아니라 이러한 지표가 미래의 소비량을 예측하는 데 유효한 예측변수가 될 수 있 다. 인공신경망을 이용한 가격예측 모형 개발도 활용사례로 제시할 수 있다. 결과의 활용주체는 연구자들이 될 수 있으며, 고추, 마늘 등 채소류의 수급 예측 시스템 개발 및 구축이 목적이다. 분석 자료는 도매시장가격, 통계청 생산자료, 기상자료 등의 정형데이터를 활용할 수 있으며, 시계열 모형 분석, 인공신경망 분석 등을 수행할 수 있다. 분석을 통해 시계열 모형과 인공신경망을 이용하여 특정 채소의 도매시장 가격 예측을 할 수 있다. <농식품 관련 공공 빅데이터 시스템 분석 예시> 제일 먼저 데이터 설계는 기상청 기상 API를 지역별로 수집하기 위하여 전국 17개 지역 236개소 데이터 모집단 중에서 특정 관측소에 집중하여 데이터 관리대상 농산물과 비교, 분류 및 분석 표본을 추출한다. 예를 들면, 기 상관측 데이터, 농업기상관측 데이터, 상세 날씨정보 등을 포함하는 기상청 날씨 정보 및 기상 데이터를 추출한 다. 그 다음으로 데이터 수집 프로그래밍은 오픈소스 프로그래밍 언어 파이썬(Python)을 이용하여 공공기관 및 마켓 데이터를 수집하고 수집한 데이터를 데이터 구조에 따라 설계된 데이터베이스(Database, Mysql)에 입력하는 프 로그램을 작성한다. 그 다음으로 시스템 설계는 오픈 소스를 기반으로 한 데이터분석 기반을 마련하고 향후 분석 및 요구사항 반영 등 필요에 따른 시스템 확장이 가능하도록 기본적인 분석 환경 구축이 필요하다. 그 다음으로 시스템의 구성은 데이터의 수집, 적재, 시각화를 각각 담당하 고 있으며 수집데이터를 시각화를 통해 빠르게 확인하고 조정할 수 있도록 일 반적인 데이터 사용자를 위한 환경을 고려하여 설계된다. 마지막으로 데이터 사용자 분석은 날씨, 전년도 판매량 및 순위정보를 토대로 한 판매량 및 시장예측이 가능하 며, 다른 예로 지역별 판매 품목, 생산 및 유통 현황도 가능하다. 도 2는 본 발명의 일 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템을 나타내는 상세하게 도면 이다. 또한, 도 3은 본 발명의 일 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템의 구성을 상세 하게 나타내는 도면이다. 도 2 및 도 3을 참고하면, 본 발명의 일 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템은 농식 품 데이터 저장부, 농식품 전체 예상 판매량 산출부, 농식품 판매 예측 정보 제공부 및 농식품 가격 분석부를 포함할 수 있다. 농식품 데이터 저장부는 경락가 제공 서버를 통해 입력된 전국 도매시장 실시간 농식품 경락정보, 소비자 단말 기를 통해 입력된 농식품 주문량 및 공급자 단말기를 통해 입력된 농식품 판매량과 관련된 데이터를 수집할 수 있다. 농식품 전체 예상 판매량 산출부는 소비자 단말기로부터 수집된 소비자 주문량 및 공급자 단말기로부터 수집된 공급자 판매량 정보를 기반으로 농식품의 전체 예상 판매량을 산출하여 데이터베이스에 저장할 수 있다. 농식품 판매 예측 정보 제공부는 공급자 단말기로 산출된 농식품의 전체 예상 판매량 정보를 제공할 수 있다. 농식품 가격 분석부는 농식품의 전체 예상 판매량 정보를 이용하여 농식품 가격을 분석할 수 있다. 이러한 본 발명에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템은 농식품 빅데이터와 물류 중심의 공급 망관리(SCM) 시스템을 활용하여 농식품 거래를 위한 유통구조를 개선시킬 수 있다."}
{"patent_id": "10-2022-0028942", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로, 본 발명이 속하는 기술분야에서 통상의 지식을 갖는 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가능 할 것이다. 따라서, 본 발명에 게시된 실시 예는 본 발명의 기술 사상을 한정하기 위한 것이 아닌 설명을 위한 것이고, 이런 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 따라서 본 발명의 보호 범위는 전술한 실시예에 의해 제한되기보다는 아래의 청구범위에 의하여 해석되어야 하 며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2022-0028942", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템을 나타내는 도면이다. 도 2는 본 발명의 일 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템을 나타내는 상세하게 도면 이다. 도 3은 본 발명의 일 실시예에 따른 농식품 빅데이터와 AI 기반 농식품 거래 시스템의 구성을 상세하게 나타내 는 도면이다."}
