{"patent_id": "10-2021-0017410", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0114194", "출원번호": "10-2021-0017410", "발명의 명칭": "펜 입력 장치를 인식할 수 있는 디스플레이 모듈 및 디스플레이 모듈을 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "안정철"}}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제1 하우징;상기 제1 하우징에 대하여 회전 가능하게 연결되는 제2 하우징;상기 제1 하우징에 배치되는 제1 영역, 상기 제2 하우징에 배치되는 제2 영역, 상기 제1 영역과 상기 제2 영역을 연결하고 적어도 일부분이 휘어질 수 있도록 형성된 제3 영역을 포함하는 디스플레이 패널;상기 디스플레이 패널의 하부에 배치되어 상기 디스플레이 패널을 지지하는 제1 지지부;상기 제1 지지부의 하부에서 상기 제1 하우징에 배치되는 제1 인식 부재, 및 상기 제1 지지부의 하부에서 상기제2 하우징에 배치되는 제2 인식 부재를 포함하고, 펜 입력 장치의 신호를 인식하는 인식 부재;상기 인식 부재의 하부에서 상기 제1 하우징에 배치되는 제1 부분, 상기 제1 부분과 분리되고 상기 인식 부재의하부에서 상기 제2 하우징에 배치되는 제2 부분을 포함하는 제2 지지부;상기 제2 지지부의 하부에서 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판;상기 제2 지지부의 하부에서 상기 제2 하우징에 배치되는 제2 인쇄 회로 기판;상기 디스플레이 패널과 상기 제1 인쇄 회로 기판을 전기적으로 연결하고 상기 제1 하우징에 배치되는 연결부;상기 제1 인식 부재와 상기 제1 인쇄 회로 기판을 전기적으로 연결하고 상기 제1 하우징에 배치되는 제1 인식부재 연결부;상기 제2 인식 부재와 상기 제2 인쇄 회로 기판을 전기적으로 연결하고 상기 제2 하우징에 배치되는 제2 인식부재 연결부;상기 제2 지지부의 제1 부분과 상기 연결부 사이에 배치되어 상기 제2 지지부의 제1 부분과 연결부를 전기적으로 연결하는 제1 컨택부; 및상기 제2 지지부의 제2 부분과 상기 제2 인식 부재 연결부 사이에 배치되어 상기 제2 지지부의 제2 부분과 제2인식 부재 연결부를 전기적으로 연결하는 제2 컨택부;를 포함하는 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제2 지지부의 제2 부분은,판상으로 형성되어 전면이 상기 제2 인식 부재와 접하고, 후면이 상기 제2 인쇄 회로 기판과 마주하도록 배치되고,상기 제2 인식 부재 연결부는,적어도 일부분이 상기 제2 지지부의 제2 부분의 측면을 지나는 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제2 컨택부는,상기 제2 지지부의 제2 부분의 후면과 상기 제2 인식 부재 연결부 사이에 배치되는 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2022-0114194-3-제3항에 있어서,상기 제2 컨택부는, 도전 소재로 형성되며 적어도 일부분이 접착성을 갖도록 형성되는 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제2 인식 부재 연결부는, 제1 층과 제2 층을 포함하고,상기 제2 인식 부재 연결부의 제1 층은,상기 제2 인식 부재와 연결을 위한 배선이 배치된 제1 구역과 상기 제2 컨택부와 연결을 위한 배선이 배치된 제2 구역을 포함하는 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제2 컨택부는 상기 제2 인식 부재 연결부 제1 층의 제2 구역과 상기 제2 지지부의 제2 부분 사이에 배치되고,상기 제2 인식 부재 연결부의 제1 층의 제1 구역과 상기 제2 지지부의 제2 부분 사이를 절연하도록 배치되는 절연층;을 더 포함하는 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제1 지지부는,상기 디스플레이 패널의 제3 영역과 대면하는 부분이 휘어질 수 있도록 복수의 홈이 형성된 유연 연결부를 포함하고,상기 전자 장치는,상기 제1 지지부의 유연 연결부와 대면하는 위치에서 상기 제1 인식 부재의 상부에 배치되고 상기 제1 인식 부재 연결부와 전기적으로 연결되는 제3 컨택부; 및상기 제1 지지부의 유연 연결부와 대면하는 위치에서 상기 제2 인식 부재의 상부에 배치되고 상기 제2 인식 부재 연결부와 전기적으로 연결되는 제4 컨택부;를 더 포함하는 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제3 컨택부 및 상기 제4 컨택부는,상기 제1 지지부의 유연 연결부의 휘어짐에 의해 상기 유연 연결부와 접촉되도록 높이가 조절된 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 제1 지지부는 도전성 소재로 형성되고,상기 제1 인식 부재의 가장자리에 인접하게 상기 제1 지지부와 상기 제1 인식 부재의 사이에 배치되고 상기 제1인식 부재 연결부와 전기적으로 연결되는 제5 컨택부; 및 상기 제2 인식 부재의 가장자리에 인접하게 상기 제1 지지부와 상기 제2 인식 부재의 사이에 배치되고 상기 제2인식 부재 연결부와 전기적으로 연결되는 제6 컨택부;를 더 포함하는 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2022-0114194-4-제9항에 있어서,상기 제5 컨택부는,상기 제1 인식 부재 연결부에 대하여 상기 제1 인식 부재 연결부의 연장 방향과 수직한 위치에서 상기 제1 인식부재 연결부와 인접하도록 배치되고,상기 제6 컨택부는,상기 제2 인식 부재 연결부에 대하여 상기 제2 인식 부재 연결부의 연장 방향과 수직한 위치에서 상기 제2 인식부재 연결부와 인접하도록 배치되는 전자 장치."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "펜 입력 기능을 포함하는 디스플레이 모듈에 있어서,제1 영역, 제2 영역, 상기 제1 영역과 상기 제2 영역을 연결하고 적어도 일부분이 휘어질 수 있도록 형성된 제3영역을 포함하는 디스플레이 패널;상기 디스플레이 패널의 하부에 배치되어 상기 디스플레이 패널을 지지하는 제1 지지부;상기 제1 지지부의 하부에 배치되는 제1 인식 부재, 상기 제1 인식 부재와 분리되고 상기 제1 지지부의 하부에배치되는 제2 인식 부재를 포함하고, 펜 입력 장치의 신호를 인식하는 인식 부재;상기 인식 부재의 하부에 배치되는 제1 부분, 상기 제1 부분과 분리되고 상기 인식 부재의 하부에 배치되는 제2부분을 포함하는 제2 지지부;상기 디스플레이 패널과 제1 인쇄 회로 기판을 전기적으로 연결하는 연결부;상기 제1 인식 부재와 상기 제1 인쇄 회로 기판을 전기적으로 연결하는 제1 인식 부재 연결부;상기 제2 인식 부재와 상기 제1 인쇄 회로 기판과 분절된 제2 인쇄 회로 기판을 전기적으로 연결하는 제2 인식부재 연결부;상기 제2 지지부의 제1 부분과 상기 연결부 사이에 배치되어 상기 제2 지지부의 제1 부분과 연결부를 전기적으로 연결하는 제1 컨택부; 및상기 제2 지지부의 제2 부분과 상기 제2 인식 부재 연결부 사이에 배치되어 상기 제2 지지부의 제2 부분과 제2인식 부재 연결부를 전기적으로 연결하는 제2 컨택부;를 포함하는 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제2 지지부의 제2 부분은,판상으로 형성되어 전면이 상기 제2 인식 부재와 접하고, 후면이 상기 제2 인쇄 회로 기판과 마주하도록 배치되고,상기 제2 인식 부재 연결부는,적어도 일부분이 상기 제2 지지부의 제2 부분의 측면을 지나는 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제2 컨택부는,상기 제2 지지부의 제2 부분의 후면과 상기 제2 인식 부재 연결부 사이에 배치되는 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,공개특허 10-2022-0114194-5-상기 제2 컨택부는, 도전 소재로 형성되며 적어도 일부분이 접착성을 갖도록 형성되는 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 제2 인식 부재 연결부는, 제1 층과 제2 층을 포함하고,상기 제2 인식 부재 연결부의 제1 층은,상기 제2 인식 부재와 연결을 위한 배선이 배치된 제1 구역과 상기 제1 컨택부와 연결을 위한 배선이 배치된 제2 구역을 포함하는 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제2 컨택부는 상기 제2 인식 부재 연결부의 제1 층의 제2 구역과 상기 제2 지지부의 제2 부분 사이에 배치되고,상기 제2 인식 부재 연결부의 제1 층의 제1 구역과 상기 제2 지지부의 제2 부분 사이를 절연하도록 배치되는 절연층;을 더 포함하는 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 제1 지지부는,상기 디스플레이 패널의 제3 영역과 대면하는 부분이 휘어질 수 있도록 복수의 홈이 형성된 유연 연결부를 포함하고,상기 디스플레이 모듈은,상기 제1 지지부의 유연 연결부와 대면하는 위치에서 상기 제1 인식 부재의 상부에 배치되고 상기 제1 인식 부재 연결부와 전기적으로 연결되는 제3 컨택부; 및상기 제1 지지부의 유연 연결부와 대면하는 위치에서 상기 제2 인식 부재의 상부에 배치되고 상기 제2 인식 부재 연결부와 전기적으로 연결되는 제4 컨택부;를 더 포함하는 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제3 컨택부 및 제4 컨택부는,상기 제1 지지부의 유연 연결부의 휘어짐에 의해 상기 유연 연결부와 접촉되도록 높이가 조절된 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 제1 인식 부재의 가장자리에 인접하게 상기 제1 지지부와 상기 제1 인식 부재의 사이에 배치되고 상기 제1인식 부재 연결부와 전기적으로 연결되는 제5 컨택부; 및 상기 제2 인식 부재의 가장자리에 인접하게 상기 제1 지지부와 상기 제2 인식 부재의 사이에 배치되고 상기 제2인식 부재 연결부와 전기적으로 연결되는 제6 컨택부;를 더 포함하는 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,공개특허 10-2022-0114194-6-상기 제5 컨택부는,상기 제1 인식 부재 연결부에 대하여 상기 제1 인식 부재 연결부의 연장 방향과 수직한 위치에서 상기 제1 인식부재 연결부와 인접하도록 배치되고,상기 제6 컨택부는,상기 제2 인식 부재 연결부에 대하여 상기 제2 인식 부재 연결부의 연장 방향과 수직한 위치에서 상기 제2 인식부재 연결부와 인접하도록 배치되는 디스플레이 모듈."}
{"patent_id": "10-2021-0017410", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 회전 가능하게 연 결되는 제2 하우징, 상기 제1 하우징에 배치되는 제1 영역, 상기 제2 하우징에 배치되는 제2 영역, 상기 제1 영 역과 상기 제2 영역을 연결하고 적어도 일부분이 휘어질 수 있도록 형성된 제3 영역을 포함하는 디스플레이 (뒷면에 계속)"}
{"patent_id": "10-2021-0017410", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들은, 펜 입력 장치를 인식할 수 있는 디스플레이 모듈 및 디스플레이 모듈을 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2021-0017410", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "시각적으로 표시되는 정보가 많아지고, 더 많은 기능을 전자 장치가 지원함에 따라, 보다 큰 화면의 디스플레이 를 원하는 사용자들이 증가하고 있다. 휴대가 용이한 크기를 유지하면서도 큰 화면의 디스플레이를 제공하기 위 한 새로운 형태의 전자 장치도 개발되고 있다. 디스플레이 기술이 발전하면서 접힘 가능한(folderable) 디스플레이를 구현할 수 있게 되었다. 이러한 디스플레 이를 이용하여 접힘에 의해 정보를 표시할 수 있는 면적이 가변되는 형태의 전자 장치도 출시되고 있다. 한편, 전자 장치는 다양한 종류의 펜(pen) 입력 장치를 지원할 수 있다. 어떤 전자 장치는 펜 입력 장치의 입력 을 인식하기 위한 별도의 구성 요소(예: 디지타이저(digitizer))가 존재하는 디스플레이 모듈을 포함할 수 있다."}
{"patent_id": "10-2021-0017410", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치의 크기를 유지하면서도 대면적 디스플레이를 제공하기 위하여, 폴더블 전자 장치와 같은 새로운 형태 의 전자 장치가 개발되고 있다. 폴더블 전자 장치의 디스플레이 모듈은 펜 입력 장치를 지원하기 위해 복수의 디지타이저를 포함할 수 있다. 디지타이저를 포함하는 디스플레이의 모듈의 동작에 의해 축적되는 전하는 디스플레이의 비정상적인 깜빡임(플 리커(flicker)) 현상을 발생 시킬 수 있다. 본 문서에 개시된 다양한 실시예는, 복수의 디지타이저와 그라운드의 전기적 연결 구조를 포함하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2021-0017410", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 회전 가능하게 연 결되는 제2 하우징, 상기 제1 하우징에 배치되는 제1 영역, 상기 제2 하우징에 배치되는 제2 영역, 상기 제1 영 역과 상기 제2 영역을 연결하고 적어도 일부분이 휘어질 수 있도록 형성된 제3 영역을 포함하는 디스플레이 패 널, 상기 디스플레이 패널의 하부에 배치되어 상기 디스플레이 패널을 지지하는 제1 지지부, 상기 제1 지지부의 하부에서 상기 제1 하우징에 배치되는 제1 인식 부재, 및 상기 제1 지지부의 하부에서 상기 제2 하우징에 배치 되는 제2 인식 부재를 포함하고, 펜 입력 장치의 신호를 인식하는 인식 부재, 상기 인식 부재의 하부에서 상기 제1 하우징에 배치되는 제1 부분, 상기 제1 부분과 분리되고 상기 인식 부재의 하부에서 상기 제2 하우징에 배 치되는 제2 부분을 포함하는 제2 지지부, 상기 제2 지지부의 하부에서 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판, 상기 제2 지지부의 하부에서 상기 제2 하우징에 배치되는 제2 인쇄 회로 기판, 상기 디스플레이 패널 과 상기 제1 인쇄 회로 기판을 전기적으로 연결하고 상기 제1 하우징에 배치되는 연결부, 상기 제1 인식 부재와 상기 제1 인쇄 회로 기판을 전기적으로 연결하고 상기 제1 하우징에 배치되는 제1 인식 부재 연결부, 상기 제2 인식 부재와 상기 제2 인쇄 회로 기판을 전기적으로 연결하고 상기 제2 하우징에 배치되는 제2 인식 부재 연결 부, 상기 제2 지지부의 제1 부분과 상기 연결부 사이에 배치되어 상기 제2 지지부의 제1 부분과 연결부를 전기 적으로 연결하는 제1 컨택부 및 상기 제2 지지부의 제2 부분과 상기 제2 인식 부재 연결부 사이에 배치되어 상 기 제2 지지부의 제2 부분과 제2 인식 부재 연결부를 전기적으로 연결하는 제2 컨택부를 포함할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 펜 입력 기능을 포함하는 디스플레이 모듈은, 제1 영역, 제2 영역, 상 기 제1 영역과 상기 제2 영역을 연결하고 적어도 일부분이 휘어질 수 있도록 형성된 제3 영역을 포함하는 디스 플레이 패널, 상기 디스플레이 패널의 하부에 배치되어 상기 디스플레이 패널을 지지하는 제1 지지부, 상기 제1 지지부의 하부에 배치되는 제1 인식 부재, 상기 제1 인식 부재와 분리되고 상기 제1 지지부의 하부에 배치되는 제2 인식 부재를 포함하고, 펜 입력 장치의 신호를 인식하는 인식 부재, 상기 인식 부재의 하부에 배치되는 제1 부분, 상기 제1 부분과 분리되고 상기 인식 부재의 하부에 배치되는 제2 부분을 포함하는 제2 지지부, 상기 디 스플레이 패널과 제1 인쇄 회로 기판을 전기적으로 연결하는 연결부, 상기 제1 인식 부재와 상기 제1 인쇄 회로 기판을 전기적으로 연결하는 제1 인식 부재 연결부, 상기 제2 인식 부재와 상기 제1 인쇄 회로 기판과 분절된 제2 인쇄 회로 기판을 전기적으로 연결하는 제2 인식 부재 연결부, 상기 제2 지지부의 제1 부분과 상기 연결부 사이에 배치되어 상기 제2 지지부의 제1 부분과 연결부를 전기적으로 연결하는 제1 컨택부 및 상기 제2 지지부 의 제2 부분과 상기 제2 인식 부재 연결부 사이에 배치되어 상기 제2 지지부의 제2 부분과 제2 인식 부재 연결 부를 전기적으로 연결하는 제2 컨택부를 포함할 수 있다."}
{"patent_id": "10-2021-0017410", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따르면, 디지타이저를 포함하는 디스플레이 모듈이 그라운드 연결 구조를 포 함하여 전하 축적에 따른 다양한 문제점(예: 플리커)이 줄어들 수 있다. 또한, 펜 입력 장치를 인식하는 구성 요소의 면적을 확보하여 펜 입력 장치의 사용성을 보장할 수 있다."}
{"patent_id": "10-2021-0017410", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈,또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a는 본 발명의 다양한 실시예들에 따른 전자 장치의 펼침 상태(unfolded stage)를 도시한 도면이다. 도 2b 는 본 발명의 다양한 실시예들에 따른 도 2a의 전자 장치의 접힘 상태(folded state)를 도시한 도면이다. 도 2a 및 도 2b를 참고하면, 전자 장치(예: 도 1의 전자 장치)는, 서로에 대하여 접히도록 힌지 장치 (예: 도 3의 힌지 장치)를 통해 폴딩축(A1)을 기준으로 회동 가능하게 결합되는 한 쌍의 하우징(210, 220)(예: 폴더블 하우징), 한 쌍의 하우징(210, 220)을 통해 배치되는 제1 디스플레이(예: 플렉서블 (flexible) 디스플레이, 폴더블(foldable) 디스플레이 또는 메인 디스플레이) 및/또는 제2디스플레이(예: 서브 디스플레이)를 포함할 수 있다. 한 실시예에 따르면, 힌지 장치(예: 도 3의 힌지 장치)는, 접힘 상태 에서, 제1 하우징 및 제2 하우징을 통해 외부로부터 보이지 않도록 배치되고, 펼침 상태에서, 힌지 장치를 보호하고, 접힘 가능한 부분을 커버하는 힌지 커버를 통해 외부로부터 보이지 않게 배치될 수 있다. 본 문서에서는 제1 디스플레이가 배치된 면은 전자 장치의 전면으로 정의될 수 있으며, 전면의 다른면은 전자 장치의 후면으로 정의될 수 있다. 또한 전면과 후면 사이의 공간을 둘러싸는 면은 전자 장 치의 측면으로 정의될 수 있다. 다양한 실시예에 따르면, 한 쌍의 하우징(210, 220)은 힌지 장치(예: 도 3의 힌지 장치)를 통해 서로에 대 하여 폴딩 가능하게 배치되는 제1 하우징 및 제2 하우징을 포함할 수 있다. 한 실시예에 따르면, 한 쌍의 하우징(210, 220)은 도 2a 및 도 2b에 도시된 형태 및 결합으로 제한되지 않으며, 다른 형상이나 부품의 조합 및/또는 결합에 의해 구현될 수도 있다. 한 실시예에 따르면, 제1 하우징과 제2 하우징은 폴딩 축(A1)을 중심으로 양측에 배치되고, 폴딩축(A1)에 대하여 전체적으로 대칭인 형상을 가질 수 있다. 어떤 실시 예에 따르면, 제1 하우징과 제2 하우징은 폴딩축(A1)을 기준으로 비대칭으로 접힐 수도 있다. 한 실 시예에 따르면, 제1 하우징 및 제2 하우징은 전자 장치가 펼침 상태(unfolded stage)인지, 접 힘 상태(folded state)인지, 또는 중간 상태(intermediate state)인지 여부에 따라 서로 이루는 각도나 거리가 달라질 수 있다. 다양한 실시예에 따르면, 제1 하우징은 전자 장치의 펼침 상태에서, 힌지 장치(예: 도 3의 힌지 장치 )에 연결되며, 전자 장치의 전면을 향하도록 배치된 제1면, 제1면의 반대 방향을 향하는 제2면, 및/또는 제1면과 제2면 사이의 제1공간의 적어도 일부를 둘러싸는 제1측면 부재를 포함할 수 있다. 한 실시예에 따르면, 제2 하우징은 전자 장치의 펼침 상태에서, 힌지 장치(예: 도 3 의 힌지 장치)와 연결되며, 전자 장치의 전면을 향하도록 배치된 제3면, 제3면의 반대 방 향을 향하는 제4면, 및/또는 제3면 및 제4면 사이의 제2공간의 적어도 일부를 둘러싸는 제2측면 부재를 포함할 수 있다. 한 실시예에 따르면, 제1면은, 펼침 상태에서 제3면과 실질적으로 동일 한 방향을 향하고, 접힘 상태에서 제3면과 마주보도록 대면될 수 있다. 한 실시예에 따르면, 전자 장치 는 제1 하우징과, 제2 하우징의 구조적 결합을 통해 제1 디스플레이를 수용하도록 형성되 는 리세스를 포함할 수도 있다. 한 실시예에 따르면, 리세스는 제1 디스플레이와 실질적으로 동 일한 크기를 가질 수 있다. 다양한 실시예에 따르면, 힌지 커버는, 제1 하우징과 제2 하우징 사이에 배치되어, 힌지 장치 (예: 도 3의 힌지 장치)를 가릴 수 있도록 배치될 수 있다. 한 실시예에 따르면, 힌지 커버는, 전자 장치의 펼침 상태, 접힘 상태 또는 중간 상태에 따라, 제1 하우징 및 제2 하우징의 일부에 의해 가려지거나, 외부로 노출될 수 있다. 예컨대, 전자 장치가 펼침 상태인 경우, 힌지 커버는 제1 하우 징 및 제2 하우징에 의해 가려져 실질적으로 노출되지 않을 수 있다. 한 실시예에 따르면, 전자 장치 가 접힘 상태인 경우, 힌지 커버는 제1 하우징 및 제2 하우징 사이에서 외부로 노출될 수 있다. 한 실시예에 따르면, 제1 하우징 및 제2 하우징이 소정의 각도를 이루는(folded with a certain angle) 중간 상태인 경우, 힌지 커버는 제1 하우징 및 제2 하우징 사이에서 전자 장치 의 외부로 적어도 부분적으로 노출될 수 있다. 예컨대, 힌지 커버가 외부로 노출되는 영역은 완전히 접힌 상태보다 적을 수 있다. 한 실시예에 따르면, 힌지 커버는 곡면을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치가 펼침 상태(예: 도 2a의 상태) 인 경우, 제1 하우징 및 제2 하 우징은 약 180도의 각도를 이루며, 제1 디스플레이의 제1영역(230a), 폴딩 영역(230c) 및 제2영역 (230b)은 동일 평면을 이루며, 실질적으로 동일 방향을 향하도록 배치될 수 있다. 다른 실시예로, 전자 장치 가 펼침 상태인 경우, 제1 하우징은 제2 하우징에 대하여 약 360도의 각도로 회동하여 제2면 과 제4면이 마주보도록 반대로 접힐 수도 있다(out folding 방식). 다양한 실시예에 따르면, 전자 장치가 접힘 상태(예: 도 2b의 상태)인 경우, 제1 하우징의 제1면 및 제2 하우징의 제3면은 서로 마주보게 배치될 수 있다. 이러한 경우, 제1 디스플레이의 제1영역(230a)과 제2영역(230b)은 폴딩 영역(230c)를 통해, 서로 좁은 각도(예: 0도 ~ 약 10도 범위)를 형성하 며, 서로 마주보도록 배치될 수도 있다. 한 실시예에 따르면, 폴딩 영역(230c)은 적어도 일부가 소정의 곡률 반 경을 가지는 곡면으로 형성될 수 있다. 한 실시예에 따르면, 전자 장치가 중간 상태인 경우, 제1 하우징 및 제2 하우징은 서로 소정의 각도(a certain angle)로 배치될 수 있다. 이러한 경우, 제1 디스플레 이의 제1영역(230a)과 제2영역(230b)은 접힘 상태보다 크고, 펼침 상태보다 작은 각도를 형성할 수 있으며, 폴딩 영역(230c)의 곡률 반경은 접힘 상태인 경우보다 클 수 있다. 어떤 실시예에서, 제1 하우징 과 제2 하우징은, 힌지 장치(예: 도 3의 힌지 장치)를 통해, 접힘 상태에서 펼침 상태 사이의 지정된 폴딩 각도에서 멈출 수 있는 각도를 형성할 수 있다(free stop 기능). 어떤 실시예에서, 제1 하우징과 제2 하우징은, 힌지 장치(예: 도 3의 힌지 장치)를 통해, 지정된 변곡 각도를 기준으로, 펼쳐지는 방향 또는 접히는 방향으로, 가압받으면서 동작할 수도 있다. 다양한 실시예에 따르면, 전자 장치는, 제1 하우징 및/또는 제2 하우징에 배치되는 적어도 하나 의 디스플레이(230, 400), 입력 장치, 음향 출력 장치(227, 228)(예: 도 1의 음향 출력 모듈), 센서 모듈(217a, 217b, 226), 카메라 모듈(216a, 216b, 225)(예: 도 1의 카메라 모듈), 키 입력 장치, 인 디케이터(미도시 됨) 또는 커넥터 포트 중 적어도 하나를 포함할 수 있다. 어떤 실시예에서, 전자 장치 는, 구성 요소들 중 적어도 하나를 생략하거나 적어도 하나의 다른 구성 요소를 추가적으로 포함할 수 있 다. 다양한 실시예에 따르면, 적어도 하나의 디스플레이(230, 400)는, 제1 하우징의 제1면으로부터 힌지 장치(예: 도 3의 힌지 장치)를 통해 제2 하우징의 제3면의 지지를 받도록 배치되는 제1 디스플 레이(예: 플렉서블 디스플레이) 및 제2 하우징의 내부 공간에서 제4면을 통해 외부로부터 보일 수 있게 배치되는 제2디스플레이를 포함할 수 있다. 또 다른 예로, 제2디스플레이 제1 하우징의 내부 공간에서 제2면을 통해 외부로부터 보일 수 있게 배치될 수도 있다. 한 실시예에 따르면, 제1 디스플 레이는, 전자 장치의 펼침 상태에서 주로 사용될 수 있으며, 제2디스플레이는, 전자 장치 의 접힘 상태에서 주로 사용될 수 있다. 한 실시예에 따르면, 전자 장치는 중간 상태의 경우, 제1 하우징 과 제2 하우징의 폴딩 각도에 기반하여 제1 디스플레이 및/또는 제2디스플레이를 사용할 수 있다. 다양한 실시예에 따르면, 제1 디스플레이는, 한 쌍의 하우징(210, 220)에 의해 형성된 공간에 배치될 수 있다. 예를 들어, 제1 디스플레이는 한 쌍의 하우징(210, 220)에 의해 형성되는 리세스(recess)에 배 치될 수 있으며, 전자 장치의 전면의 실질적으로 대부분을 차지하도록 배치될 수 있다. 한 실시예에 따르 면, 제1 디스플레이는, 적어도 일부 영역이 평면 또는 곡면으로 변형될 수 있는 플렉서블 디스플레이를 포 함할 수 있다. 한 실시예에 따르면, 제1 디스플레이는 제1 하우징과 대면하는 제1영역(230a), 제2 하 우징과 대면하는 제2영역(230b) 및 제1영역(230a)과 제2영역(230b)을 연결하고, 힌지 장치(예: 도 3의 힌 지 장치)와 대면하는 폴딩 영역(230c)을 포함할 수 있다. 한 실시예에 따르면, 제1 디스플레이의 영 역 구분은 한 쌍의 하우징(210, 220) 및 힌지 장치(예: 도 3의 힌지 장치)에 의한 예시적인 물리적 구분일 뿐, 실질적으로 한 쌍의 하우징(210, 220) 및 힌지 장치(예: 도 3의 힌지 장치)를 통해 제1 디스플레이 는 이음매 없는(seamless), 하나의 전체 화면으로 표시될 수 있다. 한 실시예에 따르면, 제1영역(230a)과 제2영역(230b)은 폴딩 영역(230c)을 기준으로 전체적으로 대칭인 형상을 가지거나, 부분적으로 비대칭 형상을 가질 수 있다. 다양한 실시예에 따르면, 전자 장치는 제1 하우징의 제2면에 배치되는 제1후면 커버 및 제 2 하우징의 제4면에 배치되는 제2후면 커버를 포함할 수 있다. 어떤 실시예에서, 제1후면 커버 의 적어도 일부는 제1측면 부재와 일체로 형성될 수도 있다. 어떤 실시예에서, 제2후면 커버의 적어도 일부는 제2측면 부재와 일체로 형성될 수도 있다. 한 실시예에 따르면, 제1후면 커버 및 제2 후면 커버 중 적어도 하나의 커버는 실질적으로 투명한 플레이트(예: 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트) 또는 불투명한 플레이트로 형성될 수 있다. 한 실시예에 따르면, 제1후 면 커버는, 예를 들어, 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸 (STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합과 같은, 불투명한 플레이트에 의하여 형성될 수 있다. 한 실시예에 따르면, 제2후면 커버는, 예를 들어, 글래스 또는 폴리머와 같은, 실질적으로 투명한 플레이트를 통해 형성될 수 있다. 따라서, 제2디스플레이는, 제2 하우징의 내부 공간에서, 제2후면 커버를 통해 외부로부터 보일 수 있게 배치될 수 있다. 일실시예에서, 제2후면 커버는 제2디스플레이 에 포함될 수도 있다. 다양한 실시예에 따르면, 입력 장치는, 마이크를 포함할 수 있다. 어떤 실시예에서, 입력 장치는 소 리의 방향을 감지할 수 있도록 배치되는 복수 개의 마이크를 포함할 수 있다. 한 실시예에 따르면, 음향 출력 장치(227, 228)는 스피커들을 포함할 수 있다. 한 실시예에 따르면, 음향 출력 장치(227, 228)는, 제2 하우징 의 제4면을 통해 배치되는 통화용 리시버 및 제2 하우징의 측면 부재를 통해 배치되는 외 부 스피커를 포함할 수 있다. 어떤 실시예에서, 입력 장치 , 음향 출력 장치(227, 228) 및 커넥터 는 제1 하우징 및/또는 제2 하우징의 공간들에 배치되고, 제1 하우징 및/또는 제2 하우징 에 형성된 적어도 하나의 홀을 통하여 외부 환경에 노출될 수 있다. 어떤 실시예에서, 제1 하우징 및 /또는 제2 하우징에 형성된 홀들은 입력 장치 및 음향 출력 장치(227, 228)을 위하여 공용으로 사용 될 수 있다. 어떤 실시예에서, 음향 출력 장치(227, 228)는 제1 하우징 및/또는 제2 하우징에 형성된 홀이 배제된 채, 동작되는 스피커(예: 피에조 스피커)를 포함할 수도 있다. 다양한 실시예에 따르면, 카메라 모듈(216a, 216b, 225)은, 제1 하우징의 제1면에 배치되는 제1 카메 라 모듈(216a), 제1 하우징의 제2면에 배치되는 제2 카메라 모듈(216b) 및/또는 제2 하우징의 제4면에 배치되는 제3 카메라 모듈를 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제2 카 메라 모듈(216b) 근처에 배치되는 플래시를 포함할 수 있다. 한 실시예에 따르면, 플래시는, 예를 들 어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 한 실시예에 따르면, 카메라 모듈들(216a, 216b, 225)은 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 어떤 실시예에서, 카메라 모듈들(216a, 216b, 225) 중 적어도 하나의 카메라 모듈은 2개 이상의 렌즈들(광각 및 망원 렌즈) 및 이미지 센서들을 포함하고, 제1 하우징 및/또는 제2 하우징의 어느 한 면에 함께 배치될 수 도 있다. 다양한 실시예에 따르면, 센서 모듈(217a, 217b, 226)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환 경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 한 실시예에 따르면, 센서 모듈(217a, 217b, 226)은, 제1 하우징의 제1면에 배치되는 제1센서 모듈(217a), 제1 하우징의 제2면에 배치 되는 제2센서 모듈(217b) 및/또는 제2 하우징의 제4면에 배치되는 제3센서 모듈을 포함할 수 있 다. 어떤 실시예에서, 센서 모듈(217a, 217b, 226)은 제스처 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 조도 센서, 초음파 센서, 홍채 인식 센서, 또는 거리 검출 센서(TOF 센서 또는 RiDAR 스캐너) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치는, 도시되지 않은 센서 모듈, 예를 들어, 기압 센서, 마그네틱 센서, 생체 센서, 온도 센서, 습도 센서, 또는 지문 인식 센서 중 적어도 하나를 더 포함할 수 있다. 어떤 실시예에서, 지문 인식 센서는 제1 하우징의 제1측면 부재 및/또는 제2 하우징의 제2측면 부재 중 적어도 하나의 측면 부재를 통해 배치될 수도 있다. 다양한 실시예에 따르면, 키 입력 장치는, 제1 하우징의 제1측면 부재를 통해 외부로 노출되도 록 배치될 수 있다. 어떤 실시예에서, 키 입력 장치는 제2 하우징의 제2측면 부재를 통해 외부 로 노출되도록 배치될 수도 있다. 어떤 실시예에서, 전자 장치는 상기 키 입력 장치들 중 일부 또는 전부를 포함하지 않을 수 있고, 포함되지 않은 키 입력 장치는 적어도 하나의 디스플레이(230, 400)상에 소프트 키와 같은 다른 형태로 구현될 수 있다. 다른 실시예로, 키 입력 장치는 적어도 하나의 디스플레이 (230, 400)에 포함된 압력 센서를 이용하여 구현될 수 있다. 다양한 실시예에 따르면, 커넥터 포트는, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥 터(예: USB 커넥터 또는 IF 모듈(interface connector port 모듈))를 포함할 수 있다. 어떤 실시예에서, 커넥 터 포트는 외부 전자 장치와 오디오 신호를 송수신하기 위한 기능을 함께 수행하거나, 오디오 신호의 송수 신 기능을 수행하기 위한 별도의 커넥터 포트(예: 이어잭 홀)를 더 포함할 수도 있다. 다양한 실시예에 따르면, 카메라 모듈들(216a, 216b, 225) 중 적어도 하나의 카메라 모듈(216a, 225), 센서 모 듈(217a, 217b, 226)들 중 적어도 하나의 센서 모듈(217a, 226) 및/또는 인디케이터는 적어도 하나의 디스플레 이(230, 400)를 통해 노출되도록 배치될 수 있다. 예컨대, 적어도 하나의 카메라 모듈(216a, 225), 적어도 하나 의 센서 모듈(217a, 226) 및/또는 인디케이터는 적어도 하나의 하우징(210, 220)의 내부 공간에서, 디스플레이 (230, 240)의 활성화 영역(display area) 아래에 배치되고, 커버 부재(예: 제1 디스플레이의 윈도우층(미 도시 됨) 및/또는 제2후면 커버)까지 천공된 오프닝 또는 투명 영역을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 한 실시예에 따르면, 디스플레이(230, 240)와 적어도 하나의 카메라 모듈(216a, 225)이 대면하 는 영역은 컨텐츠를 표시하는 영역의 일부로서 일정 투과율을 갖는 투과 영역으로 형성될 수 있다. 한 실시예에 따르면, 투과 영역은 약 5% ~ 약20% 범위의 투과율을 갖도록 형성될 수 있다. 이러한 투과 영역은 이미지 센서 로 결상되어 화상을 생성하기 위한 광이 통과하는 적어도 하나의 카메라 모듈(216a, 225)의 유효 영역(예: 화각 영역)과 중첩되는 영역을 포함할 수 있다. 예를 들어, 디스플레이(230, 240)의 투과 영역은 주변 보다 픽셀의 밀도가 낮은 영역을 포함할 수 있다. 예를 들어, 예를 들어, 투과 영역은 상기 오프닝을 대체할 수 있다. 예를 들어, 적어도 하나의 카메라 모듈(216a, 225)은 언더 디스플레이 카메라(UDC, under display camera)를 포함할 수 있다. 다른 실시예로, 일부 카메라 모듈 또는 센서 모듈은 디스플레이를 통해 시각적으로 노출되지 않 고 그 기능을 수행하도록 배치될 수도 있다. 예컨대, 디스플레이(예: 디스플레이 패널)의, 카메라 모듈 및 /또는 센서 모듈과 대면하는 영역은, 천공된 오프닝이 불필요할 수도 있다. 다양한 실시예에 따르면, 전자 장치는 제1 하우징의 제1도전성 측면 부재의 적어도 일부를 통해 구성된 적어도 하나의 안테나를 포함할 수 있다. 한 실시예에 따르면, 적어도 하나의 안테나는 제1 하우징(21 0)의 상측 영역(예: A 영역) 및/또는 하측 영역(예: B 영역)에 배치될 수 있다. 본 발명의 예시적인 실시예들에 따르면, 적어도 하나의 안테나는 제2디스플레이를 포함하는 제2 하우징 의 제2도전성 측면 부재을 이용하여 추가로 구현될 수 있다. 한 실시예에 따르면, 한 적어도 하나의 안테나는 제2도전성 측면 부재의 상측 영역(C 영역) 및/또는 하측 영역(D 영역)에 추가로 배치될 수 있다. 이러한 경우, 안테나의 급전 지점 근처의 적어도 하나의 지정된 위치에서 제2디스플레이의 도전성 시트(예: 도 4b의 도전성 시트)와 공통 그라운드로 사용되는 주변 도전성 구조물(예: 기판 또는 도전성 전 기 구조물)이 전기적으로 연결(접지)됨으로써, 제2측면 부재를 이용한 안테나의 방사 성능 저하를 방지하 는데 도움을 줄 수 있다. 도 3은 본 발명의 다양한 실시예들에 따른 전자 장치(예: 도 1의 전자 장치 또는 도 2a의 전자 장치(20 0))의 분리 사시도이다. 도 3을 참조하면, 전자 장치(예:도 1의 전자 장치 또는 도 2a의 전자 장치)는 제1 디스플레이 , 제2디스플레이, 지지부재 어셈블리, 적어도 하나의 인쇄 회로 기판, 제1 하우징, 제2 하우징, 제1후면 커버 및/또는 제2후면 커버를 포함할 수 있다. 다양한 실시예에 따르면, 제1 디스플레이는 디스플레이 패널(예: 플렉서블 디스플레이 패널)과, 디스 플레이 패널(예: 플렉서블 디스플레이 패널)이 안착되는 하나 이상의 플레이트 또는 층을 포함할 수 있다. 한 실시예에 따르면, 하나 이상의 플레이트는 디스플레이 패널과 지지부재 어셈블리 사이 에 배치되는 도전성 플레이트(예: Cu 시트 또는 SUS 시트)를 포함할 수 있다. 한 실시예에 따르면, 하나 이상의 플레이트는 실질적으로 제1 디스플레이와 동일한 영역을 갖도록 형성될 수 있으며, 제1 디스플레이 (230c)의 폴딩 영역(230c)과 대면하는 영역이 굽힘 가능하도록 형성될 수 있다. 한 실시예에 따르면, 하나 이상 의 플레이트는 디스플레이 패널의 배면에 배치되는 적어도 하나의 부자재층(예: 그라파이트 부재)을 포함할 수 있다. 한 실시예에 따르면, 하나 이상의 플레이트는 디스플레이 패널과 대응되는 형상으로 형성될 수 있다. 다양한 실시예에 따르면, 제2디스플레이는 제2 하우징과 제2후면 커버 사이의 공간에 배치될 수 있다. 한 실시예에 따르면, 제2디스플레이는 제2 하우징과 제2후면 커버 사이의 공간에서, 제2 후면 커버의 실질적으로 전체 면적으로 통해 외부로부터 보일 수 있게 배치될 수 있다. 다양한 실시예에 따르면, 지지부재 어셈블리는 제1지지 부재(예: 제1지지 플레이트), 제2지지 부재 (예: 제2지지 플레이트), 제1지지 부재과 제2지지 부재 사이에 배치되는 힌지 장치, 힌지 장치를 외부에서 볼 때, 이를 커버하는 힌지 커버, 및/또는 제1지지 부재와 제2지지 부재 를 가로지르는 적어도 하나의 배선 부재(예: 연성 회로 기판(FPCB; flexible printed circuit board))를포함할 수 있다. 한 실시예에 따르면, 지지부재 어셈블리는 하나 이상의 플레이트와 적어도 하나의 인쇄 회로 기판 사이에 배치될 수 있다. 한 실시예에 따르면, 제1지지 부재는 제1 디스플레이의 제1영역(231a)과 제1인쇄 회로 기판 사이에 배치될 수 있다. 한 실시예에 따르면, 제2지지 부재는 제 1 디스플레이의 제2영역(231b)과 제2인쇄 회로 기판 사이에 배치될 수 있다. 한 실시예에 따르면, 지 지부재 어셈블리의 내부에는 적어도 하나의 배선 부재와 힌지 장치의 적어도 일부가 배치될 수 있다. 적어도 하나의 배선 부재는 제1지지 부재와 제2지지 부재를 가로지르는 방향(예: X축 방 향)으로 배치될 수 있다. 한 실시예에 따르면, 적어도 하나의 배선 부재는 폴딩 영역(230c)의 폴딩 축(예: y축 또는 도 2a의 폴딩 축(A))에 수직한 방향(예: X축 방향)으로 배치될 수 있다. 다양한 실시예에 따르면, 적어도 하나의 인쇄 회로 기판은, 제1지지 부재와 대면하도록 배치되는 제1 인쇄 회로 기판, 또는 제2지지 부재와 대면하도록 배치되는 제2인쇄 회로 기판을 포함할 수 있 다. 한 실시예에 따르면, 제1인쇄 회로 기판과 제2인쇄 회로 기판은 지지부재 어셈블리, 제2 하 우징, 제2 하우징, 제1후면 커버 및/또는 제2후면 커버에 의해 형성되는 내부 공간에 배치 될 수 있다. 한 실시예에 따르면, 제1인쇄 회로 기판과 제2인쇄 회로 기판은 전자 장치의 다양 한 기능을 구현하기 위하여 배치되는 복수의 전자 부품들을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치는, 제2 하우징의 제1공간에서, 제1지지 부재를 통해 형성된 공간 에 배치되는 제1인쇄 회로 기판, 제1지지 부재의 제1스웰링 홀과 대면하는 위치에 배치되는 제 1배터리(예: 도 1의 배터리), 적어도 하나의 카메라 모듈(예: 도 2a의 제1 카메라 모듈(216a) 및/또는 제2 카메라 모듈(216b)) 또는 적어도 하나의 센서 모듈(예: 도 2a의 제1센서 모듈(217a) 및/또는 제2센서 모듈(217b))을 포함할 수 있다. 한 실시예에 따르면, 제2 하우징의 제2공간에는 제2지지 부재 를 통해 형성된 제2공간에 배치되는 제2인쇄 회로 기판, 또는 제2지지 부재의 제2스웰링 홀 과 대면하는 위치에 배치되는 제2배터리(예: 도 1의 배터리)을 포함할 수 있다. 한 실시예에 따르면, 제1 하우징과 제1지지 부재는 일체로 형성될 수 있다. 한 실시예에 따르면, 제2 하우징(22 0)과 제2지지 부재 역시 일체로 형성될 수도 있다. 다양한 실시예에 따르면, 제1 하우징은 제2회전 지지면을 포함할 수 있고, 제2 하우징은 제2회 전 지지면에 대응되는 제1회전 지지면을 포함할 수 있다. 한 실시예에 따르면, 제2회전 지지면 과 제1회전 지지면은 힌지 커버에 포함된 곡면과 대응되는(자연스럽게 연결되는) 곡면을 포함할 수 있다. 한 실시예에 따르면, 제2회전 지지면과 제1회전 지지면은 전자 장치가 펼침 상태인 경우, 힌지 커버를 덮어 힌지 커버를 전자 장치의 후면으로 노출시키지 않거나 일부만 노출시킬 수 있 다. 한 실시예에 따르면, 제2회전 지지면과 제1회전 지지면은 전자 장치가 접힘 상태인 경우, 힌지 커버에 포함된 곡면을 따라 회전하여 힌지 커버를 전자 장치의 후면으로 노출시킬 수 있다. 이하에서 설명되는 전자 장치는 도 1의 전자 장치 또는 도 2a의 전자 장치를 포함할 수 있다. 이하 설명에서 별도로 언급되지 않더라도 전자 장치는 도 1에서 설명된 구성 요소 및 도 2a, 도 2b 및 도 3에서 설명 된 구성 요소 중 적어도 하나를 포함할 수 있다. 도 2a, 도 2b 및 도 3에 도시된 전자 장치의 레이아웃(rayou t)은 본 발명을 설명하기 위한 하나의 예시에 불과하며 본 발명에서 설명하는 전자 장치의 외형이나 구조를 한 정하기 위한 것은 아니다. 도 4a는, 본 문서에 개시된 다양한 실시예에 따른 디스플레이 모듈의 배면도이다. 도 4b는, 도 2a에 도시된 전 자 장치를 P1-P1선을 따라 절개한 단면의 모식도이다. 도 4c는, 도 4a에 도시된 유연 연결부의 일부를 도시한 도면이다. 이하, 하우징에 대한 설명은 도 2a, 도 2b 및 도 3을 참조하도록 한다. 다양한 실시예에 따르면, 전자 장치는 제1 하우징과 제2 하우징을 포함할 수 있다. 제1 하우징과 제2 하우징은 적어도 일부가 전자 장치의 외관을 형성할 수 있다. 제1 하우징과 제2 하우징은 전자 장치에 포함되는 다양한 전자 부품이나 기구물들을 지지하는 구성 요소일 수 있다. 일 실시예에서, 제1 하우징과 제2 하우징은 회전 가능하게 연결될 수 있다. 예를 들어, 제2 하우징은 제1 하우 징에 대하여 힌지 구조에 의해 회전 가능하게 연결될 수 있다. 예를 들어, 도 2a, 2b 및 도 3에 도시된 전자 장 치와 유사하게 전자 장치는 제1 하우징에 대한 제2 하우징의 회전에 따라, 접힘 상태(예: 도 2b), 펼침상태(예: 도 2a), 중간 상태(예: 제1 하우징과 제2 하우징이 소정 각도를 이룬 상태)로 전환될 수 있다. 이상 설명한 제1 하우징과 제2 하우징은 도 3에 도시된 제1 하우징과 제2 하우징을 포함할 수 있다. 제1 하우징과 제2 하우징은 서로 분절되어 회전 가능하게 연결된 하우징이므로 제1 하우징은 도 3의 제2 하우징 으로 이해될 수 있고, 제2 하우징은 도 3의 제1 하우징으로 이해될 수 있다. 이하 설명에서는 제1 하 우징과 제2 하우징에 대해 도 3의 제1 하우징과 제2 하우징의 부재 번호를 사용하도록 한다. 다양한 실시예에 따르면, 전자 장치는 정보를 시각적으로 표시하는 디스플레이 모듈(예: 도 3의 제1 디스 플레이)을 포함할 수 있다. 여기서 모듈은 적어도 하나의 기능 또는 그 기능과 관련된 기능을 수행하기 위 한 적어도 하나의 전자 부품 및/또는 기구물을 의미할 수 있다. 모듈은 설명의 편의를 위하여 구분한 것에 불과 하므로, 어떤 모듈에 속한 다양한 구성 요소들이 물리적, 전기적으로 모두 연결되는 것으로 한정해석되는 것은 아니다. 예를 들어, 물리적으로 서로 떨어진 전자 부품이라고 하더라도 설명의 편의를 위해서 특정 모듈에 속한 구성으로 볼 수 있고, 각각 서로 다른 기능을 수행하는 전자 부품이라고 하더라도 동일한 모듈에 포함되는 것을 의미할 수 있다. 다양한 실시예에 따르면, 디스플레이 모듈은, 복수의 레이어가 적층된 구조를 포함할 수 있다. 예를 들어, 도 4b에 도시된 것과 같이, 보호층, 글래스층, 편광층, 디스플레이 패널, 제1 지지부 , 인식 부재, 또는 제2 지지부가 적층된 구조를 포함할 수 있다. 일 실시 예에서, 레이어들 사 이에는 레이어의 상대 위치를 고정하기 위한 접착층이 배치될 수 있다. 예를 들어, 도 4b에 도시된 것과 같이, 글래스층과 편광층 사이, 편광층과 디스플레이 패널 사이, 또는 제1 지지부와 인식 부재 사이에 접착층이 배치될 수 있다. 일 실시 예에서, 접착층은 접착 성질을 갖는 합성 수지 소재로 형성될 수 있다. 예를 들어, 광 경화성 접착 소재로 접착층이 형성될 수 있다. 이상에서 설명 한 디스플레이 모듈의 구조는 하나의 예시에 불과하며 디스플레이 모듈은 앞에서 설명한 것 이외의 레이어를 포함할 수 있고 앞서 설명한 레이어 중 하나가 생략될 수 있다. 또 다른 예로, 레이어의 적층 순서는 변경될 수 있고 접착층도 앞서 설명한 것과 다른 위치에 배치될 수 있다. 다양한 실시예에 따르면, 보호층은 글래스층을 보호하기 위한 레이어일 수 있다. 예를 들어, 보호층 은 적어도 일부가 투명한 소재로 형성된 필름일 수 있다. 일 실시 예에서, 보호층은 디스플레이 모듈 의 광학적인 성능을 보조하기 위하여 다양한 코팅이 적용될 수 있다. 다양한 실시예에 다르면, 글래스층은 유리 소재로 형성된 레이어일 수 있다. 예를 들어, 글래스층은 매우 얇은 유리(예: ultra thin glass; UTG)를 포함할 수 있다. 편광층은 외부로부터 디스플레이 모듈 의 내부 부품이 시인되지 않도록 빛을 편광시키는 레이어일 수 있다. 다양한 실시예에 따르면, 도 4b에 도시된 것과 같이, 인식 부재의 제1 인식 부재(460A)와 제2 인식 부재 (460B)를 포함할 수 있다. 예를 들어, 인식 부재는 펜 입력 장치의 움직임을 인식하기 위한 도전성 레이어 를 포함할 수 있다. 전자 장치가 접히고 펼쳐지는 동작에서 도전성 레이저가 손상될 수 있다. 이를 예방하기 위 하여, 인식 부재는 제1 하우징에 배치된 제1 인식 부재(460A)와, 제2 하우징에 배치된 제2 인식 부재(460B)를 포함할 수 있다. 일 실시예에서, 인식 부재는 디지타이저(digitizer)를 포함할 수 있다. 다양한 실시예에 따르면, 제2 지지부의 제1 부분(470A)과 제2 부분(470B)을 포함할 수 있다. 제1 부분 (470A)은 제1 하우징에 배치되고, 제2 부분(470B)은 제2 하우징에 배치될 수 있다. 다른 실시예에서, 인식 부재와 제2 지지부가 접힘 가능하도록 구성되는 경우에는, 인식 부재 및 제2 지지부 도 분절되지 않고 제1 하우징과 제2 하우징에 배치될 수도 있다. 다양한 실시예에 따르면, 디스플레이 패널은 기판과, 기판에 배치된 복수의 발광 소자(예: OLED(oxcide light emitting diode), 또는 LED(light emitting diode)) 및/또는 트랜지스터(예: TFT(thin film transistor)를 포함할 수 있다. 일 실시예에서, 디스플레이 패널의 기판은 일부 영역의 휘어짐을 허 용하도록 유연한 소재(예: 폴리이미드(polyimide; PI), 폴리에텔렌테레프탈레이트(polyethylene terephtalrate; PET))로 형성될 수 있다. 디스플레이 패널의 구동을 제어하는 디스플레이 구동 회로 (display driver IC; DDI)는 발광 소자가 배치된 기판과 동일한 기판에 배치되거나, 발광 소자 가 배치된 기판과 다른 기판에 배치되어 발광 소자가 배치된 기판에 전기적으로 연결될 수 있다. 예를 들어, 도 4b에 도시된 것과 같이, 디스플레이 구동 회로는 디스플레이 패널의 기판 중 일부에 배치될 수 있다. 일 실시예에서, 도 4a 및 도 4b에 도시된 것과 같이, 디스플레이 패널의 기판은 디스플레이 모듈 의 측면을 경유하도록 연장될 수 있다. 디스플레이 모듈의 전면은 도 4b를 기준으로 +Z 방향을 향하 는 면으로 이해될 수 있고, 디스플레이 모듈의 후면은 도 4b를 기준으로 -Z 방향을 향하는 면으로 이해될 수 있다. 디스플레이 모듈의 측면은 전면과 후면을 제외한 나머지 면으로 이해될 수 있다. 디스플레이 패 널의 하부에 배치된 전자 장치의 인쇄 회로 기판과 연결되는 연결부와 디스플레이 패널이 전기적으로 연결됨으로써, 전자 장치의 프로세서(예: 도 1의 프로세서)에서 처리되는 신호가 디스플레이 패널로 전달될 수 있다. 여기서, 하부는 도 4b를 기준으로 -Z 방향을 의미할 수 있다. 연결부는 예를 들어, 유연 인쇄 회로 기판(flexible printed circuit board; FPCB)을 포함할 수 있다. 일 실시예에서, 전자 장치의 인쇄 회로 기판은 제1 하우징에 배치되는 제1 인쇄 회로 기판(510A)과 제2 하우징에 배 치되는 제2 인쇄 회로 기판(510B)을 포함할 수 있다. 도 4a 및 도 4b에 도시된 것과 같이, 연결부는 제1 하우징에 배치되어 디스플레이 패널을 제1 하우징에 배치된 제1 인쇄 회로 기판(510A)에 전기적 으로 연결시킬 수 있다. 다양한 실시예에 따르면, 디스플레이 패널은 제1 하우징에 배치되는 제1 영역(440A)과 제2 하우징 에 배치되는 제2 영역(440B)과 제1 영역(440A)과 제2 영역(440B)을 연결하는 제3 영역(440C)을 포함할 수 있다. 예를 들어, 제3 영역(440C)은 제1 영역(440A)과 제2 영역(440B) 사이에 위치하는 부분을 의미할 수 있으 며, 제1 하우징과 제2 하우징 사이에 배치되는 디스플레이 패널의 영역을 의미할 수 있다. 도 4b에서는 설명의 편의를 위하여 제1 영역(440A), 제2 영역(440B) 및 제3 영역(440C)를 분리시켜 도시하였으나, 실제로 제1 영역(440A), 제2 영역(440B) 및 제3 영역(440C)은 시각적으로 분리되지 않고 연속적으로 이어진 영 역일 수 있다. 일 실시예에서, 제1 하우징과 제2 하우징이 접히는 동작에서 디스플레이 패널의 제3 영역(440 C)은 적어도 일부분이 휘어질 수 있다. 일 실시예에 따르면, 제1 하우징과 제2 하우징이 접히는 동작 에서 실제로 휘어지는 부분은 제3 영역(440C)이므로, 디스플레이 패널의 기판 중 제3 영역(440C)과 대응하는 부분에 배치된 디스플레이 패널의 기판은 유연한 소재로 형성되고, 제1 영역(440A) 및 제2 영역(440B)에 대응하는 부분에 배치된 디스플레이 패널의 기판은 유연하지 않은 소재로 형성될 수 있 다. 또 다른 예로, 제1 영역(440A), 제2 영역(440B), 및 제3 영역(440C)에 대응하는 부분에 배치된 디스플레이 패널의 기판은 유연한 소재로 형성될 수 있다. 다양한 실시예에 따르면, 제1 지지부는 디스플레이 패널 하부에 배치되어 디스플레이 패널을 지 지할 수 있다. 제1 지지부는 유연 연결부를 포함할 수 있다. 유연 연결부는 적어도 일부가 휘어 지는 구조를 포함할 수 있다. 예를 들어, 제1 지지부에서 디스플레이 패널의 제3 영역(440C)에 대응 하는 부분이 유연 연결부일 수 있다. 유연 연결부는, 제1 하우징에 대한 제2 하우징의 회 전에 따라 휘어질 수 있다. 도 4c를 참조하면, 유연 연결부는 복수의 홈(451-1)이 형성된 부분을 포함할 수 있다. 제1 하우징에 대하여 제2 하우징이 회전하면, 복수의 홈(451-1)이 형성된 부분에서 변형이 일어나 제1 지지부가 휘어질 수 있다. 예를 들어, 복수의 홈(451-1)은 격자(lattice) 형태로 배열될 수 있 다. 도 4c에 도시된 유연 연결부의 형상은 예시에 불과하며 이 밖에도 제1 지지부의 휘어짐을 위한 구조가 제1 지지부에 포함될 수 있다. 일 실시예에서, 제1 지지부는 유리 또는 합성 수지 소재의 필 름을 포함할 수 있다. 다양한 실시예에 따르면, 인식 부재는 제1 지지부 하부(예: -Z축 방향)에 배치될 수 있다. 인식 부재 는 디스플레이 모듈에 접근하는 펜 입력 장치를 인식하고, 펜 입력 장치가 디스플레이 모듈 상 에서 움직임에 따라 그 좌표값에 대응하는 신호를 생성할 수 있다. 디스플레이 모듈에 인식 부재가 포함됨으로써, 디스플레이 모듈은 펜 입력 장치를 통한 입력을 인식할 수 있는 디스플레이 모듈이 될 수 있다. 예를 들어, 인식 부재는 복수의 도전 라인이 형성된 도전성 레이어를 포함할 수 있다. 도전성 레 이어에 인가된 교류 전압에 의해 자기장이 형성될 수 있다. 코일이 내장된 펜 입력 장치가 근접함에 따라 전자 기 유도 현상에 의해 펜 입력 장치의 내부 회로에 전류가 흘러 공진 주파수가 형성되고, 인식 부재는 이를 인식함으로써, 펜 입력 장치의 움직임을 인식할 수 있다. 이상 설명한 인식 부재가 펜 입력 장치를 인식하 는 원리는 예시에 불과하며, 이 밖에도 인식 부재는 다양한 방법으로 펜 입력 장치의 움직임을 인식할 수 있다. 일 실시예에서, 인식 부재는 도 4b에 도시된 것과 같이, 제1 인식 부재(460A)와 제2 인식 부재(460B)를 포 함할 수 있다. 예를 들어, 제1 인식 부재(460A)는 제1 하우징에 배치되고, 제2 인식 부재(460B)는 제2 하 우징에 배치될 수 있다. 제1 인식 부재(460A)는 디스플레이 패널의 제1 영역(440A)과 대응하고, 제2 인식 부재(460B)는 디스플레이 패널의 제2 영역(440B)과 대응할 수 있다. 제1 영역(440A)을 통한 펜 입력장치의 입력은 제1 인식 부재(460A)를 통해 인식되고, 제2 영역(440B)을 통한 펜 입력 장치의 입력은 제2 인식 부재(460B)를 통해 인식될 수 있다. 다양한 실시예에 따르면, 제1 인식 부재 연결부(461A)는, 제1 인식 부재(460A)를 인쇄 회로 기판의 제1 인 쇄 회로 기판(510A)에 전기적으로 연결시킬 수 있다. 제1 인식 부재 연결부(461A)는, 일단이 제1 인식 부재 (460A)와 전기적으로 연결되고 제1 인식 부재(460A)의 하부(예: -Z축 방향)에 배치된 구성 요소(예: 도 4b의 제 2 지지부)들의 측면을 경유하도록 연장되어 타단이 제1 하우징에 배치된 제1 인쇄 회로 기판(510A)과 전기적으로 연결될 수 있다. 제1 인식 부재(460A)에서 생성된 신호는 제1 인식 부재 연결부(461A)를 통해 제1 인쇄 회로 기판(510A)에 전달될 수 있다. 제1 인식 부재 연결부(461A)는, 디스플레이 모듈의 측면과 제1 하우징 사이의 공간을 경유하여, 제1 인식 부재(460A) 하부에 배치되는 제1 인쇄 회로 기판(510A)과 제1 인식 부재(460A)를 전기적으로 연결할 수 있다. 이와 같이, 제1 인식 부재 연결부(461A)가 제1 인식 부재(460A) 하부에 배치된 레이어들의 측면을 공유하여 연장됨므로, 제1 인식 부재(460A) 하부에 배치된 구성 요소에 홀 (hole)을 생략할 수 있다. 다양한 실시예에 따르면, 제2 인식 부재 연결부(461B)는, 제2 인식 부재(460B)를 제2 인쇄 회로 기판(510B)에 전기적으로 연결시킬 수 있다. 제2 인식 부재 연결부(461B)는, 일단이 제2 인식 부재(460B)와 전기적으로 연결 되고 제2 인식 부재(460B)의 하부에 배치된 구성 요소(예: 도 4b의 제2 지지부)들의 측면을 경유하도록 연 장되어 타단이 제2 하우징에 배치된 제2 인쇄 회로 기판(510B)과 전기적으로 연결될 수 있다. 제2 인식 부 재(460B)에서 생성된 신호는 제2 인식 부재 연결부(461B)를 통해 제2 인쇄 회로 기판(510B)에 전달될 수 있다. 제2 인식 부재 연결부(461B)는, 디스플레이 모듈의 측면과 제2 하우징 사이의 공간을 경유하여, 제2 인식 부재(460B) 하부에 배치되는 제2 인쇄 회로 기판(510B)과 제2 인식 부재(460B)를 전기적으로 연결할 수 있 다. 이와 같이, 제2 인식 부재 연결부(461B)가 제2 인식 부재(460B) 하부에 배치된 레이어들의 측면을 공유하여 연장됨므로, 제2 인식 부재(460B) 하부에 배치된 구성 요소에 홀(hole)을 생략할 수 있다. 다양한 실시예에 따르면, 제2 지지부는 인식 부재 하부에 배치되어 인식 부재를 지지할 수 있다. 예를 들어, 제2 지지부는 제1 하우징에 배치되어 제1 인식 부재(460A)를 지지하는 제1 부분 (470A)과, 제2 하우징에 배치되어 제2 인식 부재(460B)를 지지하는 제2 부분(470B)을 포함할 수 있다. 제2 지지부는 판(plate) 상으로 형성될 수 있다. 제2 지지부는 디스플레이 모듈의 접지 또는 차폐 기능을 할 수 있도록 도전성 소재를 포함할 수 있다. 다양한 실시에에 따르면, 제1 하우징에는 제1 브라켓(예: 도 3의 제1 지지 부재)가 배치될 수 있다. 제2 하우징에는 제2 브라켓(예: 도 3의 제2 지지 부재)가 배치될 수 있다. 제1 브라켓 은 제1 하우징에 배치된 다양한 구성 요소 중 적어도 일부를 지지할 수 있다. 일 실시예에서, 제1 브 라켓은 제1 하우징과 일체로 형성될 수 있다. 제2 브라켓은 제2 하우징에 배치된 다양한 구성 요소 중 적어도 일부를 지지할 수 있다. 일 실시예에서, 제2 브라켓은 제2 하우징과 일체로 형 성될 수 있다. 디스플레이 모듈의 동작에 관계하지 않는 전기적 신호 또는 전기적 간섭은 디스플레이 모듈의 동작에 영향을 미칠 수 있다. 예를 들어, 디스플레이 모듈의 특정 부분에 쌓이는 전하는 디스플레이가 간헐적으로 깜박이는 플리커(flicker) 현상을 유발할 수 있다. 이러한 비정상적인 전하를 제거하기 위해 디스플레이 모듈 은 그라운드와 연결될 필요가 있다. 본 문서에 개시된 다양한 실시예에 따른 디스플레이 모듈에서 제 2 지지부는 디스플레이 모듈의 접지를 위하여 제2 인쇄 회로 기판(510B)과 전기적으로 연결된 도전성 소재를 포함할 수 있다. 제2 지지부가 제2 인쇄 회로 기판(510B)에 전기적으로 연결됨으로써, 디스플레이 모듈의 정상 작동을 방해하는 비정상적인 전하가 제2 지지부을 통해 제거될 수 있다. 예를 들어, 제2 지지부은 제2 인쇄 회로 기판(510B)에 포함된 그라운드와 전기적으로 연결될 수 있다. 다양한 실시예에 따르면, 제2 지지부의 제1 부분(470A)은 제1 하우징에 배치되어 디스플레이 패널 과 제1 인쇄 회로 기판(510A)을 전기적으로 연결하는 연결부에 전기적으로 연결될 수 있다. 제1 부분 (470A)이 연결부에 전기적으로 연결되면, 제1 부분(470A)과 제1 인쇄 회로 기판(510A)이 전기적으로 연결 될 수 있으므로, 제2 지지부의 제1 부분(470A)은 제1 인쇄 회로 기판(510A)의 그라운드와 전기적으로 연결 될 수 있다. 도 4b을 참조하면, 제1 부분(470A)과 연결부 사이에 배치된 제1 컨택부(480A)에 의해 제1 부 분(470A)과 연결부가 전기적으로 연결될 수 있다. 제1 컨택부(480A)는 예를 들어, 도전성 소재를 포함할 수 있다. 일 실시예에서, 제1 컨택부(480A)의 적어도 일부는 도전 테이프와 같이 접착성 물질을 포함할 수 있다.다양한 실시예에 따르면, 제2 지지부의 제2 부분(470B)은 제2 인식 부재(460B)를 제2 인쇄 회로 기판 (510B)에 전기적으로 연결하는 제2 인식 부재 연결부(461B)와 전기적으로 연결될 수 있다. 제2 부분(470B)이 제 2 인식 부재 연결부(461B)와 전기적으로 연결됨으로써, 제2 부분(470B)이 제2 인쇄 회로 기판(510B)의 그라운드 와 전기적으로 연결될 수 있다. 제2 부분(470B)과 제2 인식 부재 연결부(461B) 사이에 배치되는 제2 컨택부 (480B)에 의해 제2 부분(470B)과 제2 인식 부재 연결부(461B)가 전기적으로 연결될 수 있다. 제2 컨택부(480B) 는 예를 들어, 도전성 소재를 포함할 수 있다. 또 다른 예로, 제2 컨택부(480B)는 외력에 의한 변형에 견딜 수 있도록 탄성력을 갖는 소재를 포함할 수 있다. 도 4b에 도시된 것과 같이, 제2 부분(470B)은 제2 인식 부재 연 결부(461B)와 전기적으로 연결되는데, 제2 컨택부(480B)는 탄성력을 갖는 소재로 형성되므로 외력에 의해 변형 되더라도 복원될 수 있어, 디스플레이 모듈의 표면 형상의 변형이 감소될 수 있다. 도 4b를 참조하면, 제2 브라켓는 제2 부분(470B)의 하부(예: 도 4b의 -Z 방향)에 배치되어 제2 부분(470 B)을 지지할 수 있다. 일 실시예에서, 제2 브라켓에 형성된 리세스(262-1)에 제2 컨택부(480B)가 배치될 수 있다. 리세스(262-1)는 도 4b를 기준으로 -Z 방향으로 제2 브라켓 상에 형성된 홈일 수 있다. 제2 컨택 부(480B)가 제2 브라켓의 리세스(262-1)에 배치되므로, 제2 컨택부(480B) 자체의 부피에 의해 제2 부분 (470B)에서 제2 컨택부(480B)와 대면하는 부분의 변형이 감소할 수 있다. 따라서, 제2 부분(470B)에 지지되는 디스플레이 모듈의 표면 형상 변형도 감소할 수 있다. 또한, 제2 인식 부재(460B)와 제2 인쇄 회로 기판(510B)을 연결하기 위한 제2 인식 부재 연결부(461B)를 통해 제2 부분(470B)을 제2 인쇄 회로 기판(510B)과 전기적으로 연결하기 때문에, 제2 부분(470B)을 제2 인쇄 회로 기판(510B)과 전기적으로 연결시키기 위한 별도의 구성 요소 또는 공간이 생략될 수 있다. 도 5a는, 도 4a에 도시된 제2 인식 부재 연결부(461B)와 그 주변 구성 요소를 P2-P2선을 따라 절개한 단면의 모 식도이다. 도 5b는, 본 문서에 개시된 다양한 실시예에 따른 제2 인식 부재 연결부(461B)의 레이어 구조를 설명 하기 위한 도면이다. 다양한 실시예에 따르면, 도 5a에 도시된 것과 같이, 제2 인식 부재(460B)와 제2 인식 부재 연결부(461B) 사이 에는 제2 지지부(예: 도 4a 및 도 4b의 제2 지지부)의 제2 부분(470B)이 배치될 수 있다. 제2 부분(470 B)과 제2 인식 부재 연결부(461B)는 제2 인식 부재 연결부(461B)와 제2 부분(470B) 사이에 배치되는 제1 컨택부 에 의해 전기적으로 연결될 수 있다. 제2 부분(470B)이 제1 컨택부에 의해 제2 인식 부재 연결부 (461B)와 전기적으로 연결되고, 제2 인식 부재 연결부(461B)가 제2 인쇄 회로 기판(510B)에 전기적으로 연결됨 으로써, 제2 부분(470B)과 제2 인쇄 회로 기판(510B)이 전기적으로 연결될 수 있다. 도 5a 및 도 5b를 참조하면, 제2 부분(470B)과 접하는 제2 인식 부재 연결부(461B)는 복수의 레이어를 포함할 수 있다. 예를 들어, 제2 인식 부재 연결부(461B)는 제1 층과 제2 층을 포함할 수 있다. 제1 층(52 0)은 도 5a에 도시된 것과 같이 제2 층에 적층될 수 있고, 제1 층과 제2 층 사이에는 다른 레이 어가 배치될 수 있다. 일 실시예에서, 제1 층은 제2 인식 부재(460B)와의 연결을 위한 배선이 배치된 제1 구역과 제2 컨택부(480B)와 연결을 위한 배선이 배치된 제2 구역을 포함할 수 있다. 일 실 시예에서, 제1 층의 제2 구역과 제2 부분(470B) 사이에 제2 컨택부(480B)가 배치될 수 있다. 제2 컨 택부(480B)는 제1 층의 제2 구역에 배치된 배선과 제2 부분(470B)을 전기적으로 연결할 수 있다. 제1 층의 제1 구역과 제2 부분(470B) 사이에는 절연층이 배치될 수 있다. 제1 층의 제1 구역에는 제2 인식 부재(460B)의 신호를 전달하는 배선이 배치될 수 있다. 제1 층의 제1 구 역과 제2 부분(470B) 사이에 배치된 절연층은 제2 부분(470B)의 전기적 신호가 제1 구역으로 이 동하는 것을 차단할 수 있다. 절연층에 의해 제2 부분(470B)과 제1 층의 제1 구역이 전기적으로 차단되므로, 제1 구역에 배치된 배선은 제2 부분(470B)의 영향을 받지 않고, 제2 인식 부재(460B)의 신호를 제2 인쇄 회로 기판(510B)으로 전달할 수 있다. 다양한 실시예에 따르면, 제2 인식 부재 연결부(461B)의 제2 층은 제2 인식 부재(460B)의 신호를 전달하는 배선이 배치될 수 있다. 일 실시예에서, 제2 층은 제1 층의 제1 구역 및 제2 구역와 접하게 배치될 수 있다. 제2 층에는 제2 인식 부재(460B)의 신호를 전달하는 배선이 배치될 수 있다. 제1 층의 제1 구역에 배치된 배선과 제2 층에 배치된 배선이 전기적으로 연결될 수 있다. 예를 들어, 제2 층과 제1 구역이 접하는 부분에 비아(VIA)가 형성되고, 이 비아를 통해 제1 구역의 배선과 제2 층의 배선이 전기적으로 연결될 수 있다. 도 5b를 참조하면, 제2 인식 부재 연결부(461B)에서 제2 인식 부재(460B)와 연결된 배선(예: 도 5a의 배선(581, 583))이 배치된 부분(예: 제1 층의 제1 구역 및 제2 층)과 제2 컨택부(480B)와 연결된 배선(예: 도 5a의 배선)이 배치된 부분(예: 제1 층의 제2 구역)은 서로 중첩되지 않을 수 있다. 예를 들어, 도 5b를 기준으로 +Z 방향에서 제2 인식 부재(460B)를 바라봤을 때, 도 5b에 도시된 것과 같이, 제2 인식 부재(460B)와 연결된 배선이 배치된 부분과 제2 컨택부(480B)와 연결된 배선이 배치된 부분이 같은 층에서 는 다른 구역(예: 제1 층의 제1 구역과 제2 구역)에 배치되고, 중첩되는 영역에서는 다른 층(예: 제1 층의 제2 구역, 제2 층)에 배치될 수 있다. 이러한 구조를 통해, 신호 간섭이 감소 할 수 있다. 다양한 실시예에 따르면, 도 5a에 도시된 것과 같이, 제2 인식 부재(460B)의 일부분과 제2 인식 부재 연결부 (461B)의 일부분 사이에는 본딩 부재가 배치될 수 있다. 이 본딩 부재는 도전성 소재를 포함할 수 있 다. 제1 층의 제1 구역에 배치된 배선은 본딩 부재를 통해 제2 인식 부재(460B)와 전기적 으로 연결될 수 있다. 도 6a는, 본 문서에 개시된 다양한 실시예에 따른 디스플레이 모듈의 단면 모식도이다. 도 6b는, 도 6a에 도시 된 인식 부재와 제2 컨택부의 전기적인 연결 관계를 도시한 모식도이다. 도 6c는, 본 문서에 개시된 다양한 실 시예에 따른 전자 장치의 접힘에 따른 제2 컨택부와 유연 연결부의 접촉 관계를 설명하기 위한 도면이다. 도 6a 는, 도 2a에 도시된 전자 장치를 P1-P1선을 따라 절개한 단면의 모식도일 수 있다. 도 6a 및 도 6b를 통해 설명하는 실시예는 앞서 도 4b를 통해 설명한 실시예와 유사할 수 있다. 이하 설명에서 는 도 4a에서 설명한 구성 요소와 동일 또는 유사한 구성요소에 대해서는 동일한 부재 번호를 사용하도록 한다. 또한, 앞서 설명한 것과 동일한 내용에 대해서는 설명을 생략하고 차이점에 대해 설명하도록 한다. 다양한 실시예에 따르면, 제3 컨택부(610A)는 제1 인식 부재(460A)의 상부(예: +Z 축 방향)에 배치되고, 제4 컨 택부(610B)는 제2 인식 부재(460B)의 상부에 배치될 수 있다. 도 6a를 참조하면, 제3 컨택부(610A)는 제1 지지 부와 제1 인식 부재(460A) 사이에 배치되고, 제4 컨택부(610B)는 제1 지지부와 제2 인식 부재(460B) 사이에 배치될 수 있다. 제3 컨택부(610A)는 제1 지지부의 유연 연결부와 대면하는 위치에서 제1 인 식 부재(460A)의 상부에 배치될 수 있다. 제4 컨택부(610B)는 제1 지지부의 유연 연결부와 대면하는 위치에서 제2 인식 부재(460B)의 상부에 배치될 수 있다. 제3 컨택부(610A) 및 제4 컨택부(610B)는 예를 들어, 도전성 소재를 포함할 수 있다. 일 실시예에서, 제3 컨택부(610A) 및 제4 컨택부(610B)는 앞서 설명한 제1 컨택 부(480A) 및 제2 컨택부(480B)와 실질적으로 동일한 소재를 포함할 수 있다. 예를 들어, 제3 컨택부(610A) 및 제4 컨택부(610B) 적어도 일부는 도전 테이프와 같은 접착성 물질을 포함할 수 있다. 일 실시예에서, 제1 지지부는 유리, 필름, 또는 도전성 부재를 포함할 수 있고, 제1 지지부의 유연 연결부는 도전성 소재를 포함할 수 있다. 다양한 실시예에 따르면, 유연 연결부가 도전성 소재를 포 함하고, 전자 장치가 접힘 상태(folded state) 또는 중간 상태(intermediate state)인 경우, 유연 연결부(45 1)는 전자 장치의 인쇄 회로 기판과 전기적으로 연결될 수 있다. 예를 들어, 전자 장치가 접힘 상태 (folded state) 또는 중간 상태(intermediate state)인 경우, 제3 컨택부(610A) 및 제4 컨택부(610B)에 의해 유연 연결부는 인쇄 회로 기판의 그라운드와 전기적으로 연결될 수 있다. 다양한 실시예에 따르면, 제3 컨택부(610A)는 제1 인식 부재(460A)의 상부(예: +Z 축 방향)에 배치되어, 제1 인 식 부재(460A)에 포함된 배선(620A)을 통해 제1 인식 부재 연결부(461A)와 전기적으로 연결될 수 있다. 제4 컨 택부(610B)는 제2 인식 부재(460B)의 상부(예: +Z 축 방향)에 배치되어, 제2 인식 부재(460B)에 포함된 배선 (620B)을 통해 제2 인식 부재 연결부(461B)와 전기적으로 연결될 수 있다. 제1 인식 부재 연결부(461A)는 제1 인쇄 회로 기판(510A)과 전기적으로 연결되고, 제2 인식 부재 연결부(461B)는 제2 인쇄 회로 기판(510B)과 전기 적으로 연결되므로, 제3 컨택부(610A)는 제1 인쇄 회로 기판(510A)과 전기적으로 연결되고, 제4 컨택부(610B)는 제2 인쇄 회로 기판(510B)에 전기적으로 연결될 수 있다. 예를 들어, 전자 장치가 접힘 상태(folded state) 또 는 중간 상태(intermediate state)인 경우, 제1 지지부의 유연 연결부가 제3 컨택부(610A) 및/또는 제4 컨택부(610B)와 접촉함으로써, 제1 지지부와 인쇄 회로 기판이 전기적으로 연결될 수 있다. 일 실시예에서, 제3 컨택부(610A)와 제4 컨택부(610B) 중 하나는 생략될 수 있다. 다양한 실시예에 따르면, 제3 컨택부(610A) 및/또는 제4 컨택부(610B)는 유연 연결부가 변형될 때, 유연 연결부와 접촉되도록 높이가 조절될 수 있다. 유연 연결부는 전자 장치의 제2 하우징이 제1 하우징에 대해 회전함에 따라 변형될 수 있다. 도 6c의 (a)에 도시된 것과 같이, 유연 연결부가 변형되 지 않은 상태에서는 제3 컨택부(610A) 및/또는 제4 컨택부(610B)와 유연 연결부 사이가 이격되어 제3 컨택 부(610A) 및/또는 제4 컨택부(610B)와 유연 연결부가 접촉되지 않을 수 있다. 도 6c의 (b)에 도시된 것과 같이, 전자 장치가 접힘 상태(folded state) 또는 중간 상태(intermediate state)인 경우, 유연 연결부가 변형되면, 제3 컨택부(610A) 및/또는 제4 컨택부(610B)는 유연 연결부가 접촉될 수 있다. 이 상태에서, 유 연 연결부는 제3 컨택부(610A) 및/또는 제4 컨택부(610B)에 의하여 인쇄 회로 기판과 전기적으로 연 결될 수 있다. 유연 연결부에 축적된 전하는 제3 컨택부(610A) 및/또는 제4 컨택부(610B)와의 접촉을 통해 인쇄 회로 기판으로 이동될 수 있다. 따라서, 유연 연결부의 비정상적인 전하 축적에 의한 문제(예: 플리커)가 줄어들 수 있다. 도 7a는, 본 문서에 개시된 다양한 실시예에 따른 디스플레이 모듈의 단면 모식도이다. 도 7b는, 도 7a에 도시 된 인식 부재와 제3 컨택부의 전기적인 연결 관계를 도시한 모식도이다. 도 7a는, 도 2a에 도시된 전자 장치를 P1-P1선을 따라 절개한 단면의 모식도일 수 있다. 도 7a 및 도 7b를 통해 설명하는 실시예는 앞서 도 4b를 통해 설명한 실시예와 유사할 수 있다. 이하 설명에서 는 동일 또는 유사한 구성요소에 대해서는 동일한 부재 번호를 사용하도록 한다. 또한, 앞서 설명한 것과 동일 한 내용에 대해서는 설명을 생략하고 차이점에 대해 설명하도록 한다. 다양한 실시예에 따르면, 제1 지지부은 도전성 부재를 포함할 수 있다. 예를 들어, 유연 연결부을 제 외한 제1 지지부의 부분은 도전성 부재로 형성될 수 있다. 이 경우, 유연 연결부는 도전성 부재 또는 비도전성 부재를 포함할 수 있다. 또 다른 예로, 제1 지지부는 전체가 도전성 부재로 형성될 수도 있다. 다양한 실시예에 따르면, 제5 컨택부(710A)는 제1 인식 부재(460A)의 상부(예: +Z 축 방향)에 배치될 수 있다. 제6 컨택부(710B)는 제2 인식 부재(460B)의 상부에 배치될 수 있다. 도 7a를 참조하면, 제5 컨택부(710A)는 제1 지지부와 제1 인식 부재(460A) 사이에 배치될 수 있다. 제6 컨택부(710B)는 제1 지지부와 제2 인식 부재(460B) 사이에 배치될 수 있다. 예를 들어, 제5 컨택부(710A)는 제1 인식 부재(460A)의 가장자리에 인접하 게 배치될 수 있고, 제6 컨택부(710B)는 제2 인식 부재(460B)의 가장자리에 인접하게 배치될 수 있다. 또 다른 예로, 제5 컨택부(710A)의 적어도 일부는 도 7a의 +Z 축 방향에서 볼 때, 유연 연결부와 중첩되지 않도록 제1 지지부와 제1 인식 부재(460A) 사이에 배치될 수 있고, 제6 컨택부(710B)의 적어도 일부는 도 7a의 +Z 축 방향에서 볼 때, 유연 연결부와 중첩되지 않도록 제1 지지부와 제2 인식 부재(460B) 사이에 배치 될 수 있다. 일 실시예에서, 제5 컨택부(710A)는 제1 인식 부재(460A) 가장자리에 인접하도록 배치되되, 제1 인 식 부재(460A)와 전기적으로 연결된 제1 인식 부재 연결부(461A)와 인접한 위치에 배치될 수 있다. 제6 컨택부 (710B)는 제2 인식 부재(460B) 가장자리에 인접하도록 배치되되, 제2 인식 부재(460B)와 전기적으로 연결된 제2 인식 부재 연결부(461B)와 인접한 위치에 배치될 수 있다. 인식 부재에서 제1 인식 부재 연결부(461A) 또 는 제2 인식 부재 연결부(461B)와 인접한 부분은 다른 부분에 비해 상대적으로 펜 입력 장치를 인식하기 위한 배선의 밀집도가 적은 부분일 수 있다. 이와 같이, 배선의 밀집도가 적은 부분에 제5 컨택부(710A) 및 제6 컨택 부(710B)를 배치할 수 있도록, 제5 컨택부(710A)는 제1 인식 부재 연결부(461A)와 인접한 위치에 배치될 수 있 고, 제6 컨택부(710B)는 제2 인식 부재 연결부(461B)와 인접한 위치에 배치될 수 있다. 제5 컨택부(710A) 및 제 6 컨택부(710B)는 예를 들어, 도전성 소재를 포함할 수 있다. 일 실시예에서, 제5 컨택부(710A) 및 제6 컨택부 (710B)는 앞서 설명한 제2 컨택부(480B)와 실질적으로 동일한 소재로 형성될 수 있다. 예를 들어, 제5 컨택부 (710A) 및 제6 컨택부(710B)의 적어도 일부는 도전 테이프와 같은 접착성 물질을 포함할 수 있다. 일 실시예에 서, 제5 컨택부(710A)와 제6 컨택부(710B) 중 하나는 생략될 수 있다. 도 7b를 참조하면, 제1 인식 부재(460A)와 제1 인식 부재 연결부(461A)가 연결된 부분에는 제1 본딩 영역(462 A)이 위치하고, 제2 인식 부재(460B)와 제2 인식 부재 연결부(461B)가 연결된 부분에는 제2 본딩 영역(462B)이 위치할 수 있다. 일 실시예에서, 인식 부재와 인식 부재 연결부(461A, 461B)는 ACF(anisotropic conductive film)을 통해 본딩(bonding)될 수 있다. 이 경우, 제1 본딩 영역(462A) 및 제2 본딩 영역(462B)는 ACF가 배치된 영역으로 이해될 수 있다. 제5 컨택부(710A)는 제1 본딩 영역(462A)와 인접하게 배치되고, 제6 컨 택부(710B)는 제2 본딩 영역(462B)와 인접하게 배치될 수 있다. 예를 들어, 도 7b에 도시된 것과 같이, 제5 컨 택부(710A)는 제1 본딩 영역(462A)에 대하여 수평 방향(예: 도 7b의 X 축 방향)으로 배치될 수 있고, 제6 컨택 부(710B)는 제2 본딩 영역(462B)에 대하여 수평 방향으로 배치될 수 있다. 여기서, 제1 본딩 영역(462A)과 제2 본딩 영역(462B)에 수평한 방향은, 제1 인식 부재 연결부(461A) 및 제2 인식 부재 연결부(461B)의 연장방향(예: 도 7b의 Y 축 방향)에 수직한 방향으로 이해될 수 있다. 본딩 영역(462A, 462B)과 인접한 부분(예: 본 딩 영역(462A, 462B)에 대한 수평 방향(예: 도 7b의 X 축 방향))에는 펜 입력 장치를 인식하기 위한 도전성 배 선이 존재하지 않을 수 있어, 제5 컨택부(710A) 및 제6 컨택부(710B)를 배치하는데 유리할 수 있다. 다양한 실시예에 따르면, 제5 컨택부(710A)는 제1 인식 부재(460A) 상부에 배치되어, 제1 인식 부재(460A)에 포 함된 배선(720A)을 통해 제1 인식 부재 연결부(461A)와 전기적으로 연결될 수 있다. 제6 컨택부(710B)는 제2 인 식 부재(460B) 상부에 배치되어, 제2 인식 부재(460B)에 포함된 배선(720B)을 통해 제2 인식 부재 연결부(461 B)와 전기적으로 연결될 수 있다. 제1 인식 부재 연결부(461A)는 제1 인쇄 회로 기판(510A)과 전기적으로 연결 되고, 제2 인식 부재 연결부(461B)는 제2 인쇄 회로 기판(510B)과 전기적으로 연결되므로, 제5 컨택부(710A) 및 /또는 제6 컨택부(710B)는 제1 인쇄 회로 기판(510A) 또는 제2 인쇄 회로 기판(510B)과 전기적으로 연결될 수 있다. 제1 지지부가 제5 컨택부(710A) 및/또는 제6 컨택부(710B)와 접촉함으로써, 제1 지지부와 인쇄 회로 기판이 전기적으로 연결될 수 있다. 다양한 실시예에 따르면, 제5 컨택부(710A) 및/또는 제6 컨택부(710B)는 도전성 소재로 형성된 제1 지지부(45 0)와 접촉될 수 있다. 제1 지지부가 제5 컨택부(710A) 및/또는 제6 컨택부(710B)는 접촉되면, 제1 지지부 는 제5 컨택부(710A) 및/또는 제6 컨택부(710B)와 전기적으로 연결될 수 있다. 제5 컨택부(710A) 및 제6 컨택부(710B)는 제1 인식 부재 연결부(461A) 및 제2 인식 부재 연결부(461B)에 각각 연결되어 인쇄 회로 기판 에 전기적으로 연결될 수 있다. 제5 컨택부(710A) 및/또는 제6 컨택부(710B)와 전기적으로 연결된 제1 지 지부는 인쇄 회로 기판의 그라운드와 전기적으로 연결될 수 있다."}
{"patent_id": "10-2021-0017410", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 제1 하우징(예: 도 3의 제1 하우징), 상기 제1 하우 징에 대하여 회전 가능하게 연결되는 제2 하우징(예: 도 3의 제2 하우징), 상기 제1 하우징에 배치되는 제 1 영역(예: 도 4b의 제1 영역(440A)), 상기 제2 하우징에 배치되는 제2 영역(예: 도 4b의 제2 영역(440B)), 상 기 제1 영역과 상기 제2 영역을 연결하고 적어도 일부분이 휘어질 수 있도록 형성된 제3 영역(예: 도 4b의 제3 영역(440C))을 포함하는 디스플레이 패널(예: 도 4b의 디스플레이 패널), 상기 디스플레이 패널의 하부에 배치되어 상기 디스플레이 패널을 지지하는 제1 지지부(예: 도 4b의 제1 지지부), 상기 제1 지지부의 하부 에서 상기 제1 하우징에 배치되는 제1 인식 부재(예: 도 4b의 제1 인식 부재(460A)), 및 상기 제1 지지부의 하 부에서 상기 제2 하우징에 배치되는 제2 인식 부재(예: 도 4b의 제2 인식 부재(460B))를 포함하고, 펜 입력 장 치의 신호를 인식하는 인식 부재(예: 도 4b의 인식 부재), 상기 인식 부재의 하부에서 상기 제1 하우징에 배치되는 제1 부분(예: 도 4b의 제1 부분(470A)), 상기 제1 부분과 분리되고 상기 인식 부재의 하부에서 상기 제2 하우징에 배치되는 제2 부분(예: 도 4b의 제2 부분(470B))을 포함하는 제2 지지부(예: 도 4b의 제2 지지부 ), 상기 제2 지지부의 하부에서 상기 제1 하우징에 배치되는 제1 인쇄 회로 기판(예: 도 4b의 제1 인쇄 회 로 기판(510A)), 상기 제2 지지부의 하부에서 상기 제2 하우징에 배치되는 제2 인쇄 회로 기판(예: 도 4b의 제2 인쇄 회로 기판(510B)), 상기 디스플레이 패널과 상기 제1 인쇄 회로 기판을 전기적으로 연결하고 상기 제1 하 우징에 배치되는 연결부(예: 도 4b의 연결부), 상기 제1 인식 부재와 상기 제1 인쇄 회로 기판을 전기적으 로 연결하고 상기 제1 하우징에 배치되는 제1 인식 부재 연결부(예: 도 4b의 제1 인식 부재 연결부(461A)), 상 기 제2 인식 부재와 상기 제2 인쇄 회로 기판을 전기적으로 연결하고 상기 제2 하우징에 배치되는 제2 인식 부 재 연결부(예: 도 4b의 제2 인식 부재 연결부(461B)), 상기 제2 지지부의 제1 부분과 상기 연결부 사이에 배치 되어 상기 제2 지지부의 제1 부분과 연결부를 전기적으로 연결하는 제1 컨택부(예: 도 4b의 제1 컨택부(480A)) 및 상기 제2 지지부의 제2 부분과 상기 제2 인식 부재 연결부 사이에 배치되어 상기 제2 지지부의 제2 부분과 제2 인식 부재 연결부를 전기적으로 연결하는 제2 컨택부(예: 도 4b의 제2 컨택부(480B))를 포함할 수 있다. 또한, 상기 제2 지지부의 제2 부분은, 판상으로 형성되어 전면이 상기 제2 인식 부재와 접하고, 후면이 상기 제 2 인쇄 회로 기판과 마주하도록 배치될 수 있고, 상기 제2 인식 부재 연결부는, 적어도 일부분이 상기 제2 지지 부의 제2 부분의 측면을 지날 수 있다. 또한, 상기 제2 컨택부는, 상기 제2 지지부의 제2 부분의 후면과 상기 제2 인식 부재 연결부 사이에 배치될 수 있다. 또한, 상기 제2 컨택부는, 도전 소재로 형성되며 적어도 일부분이 접착성을 갖도록 형성될 수 있다. 또한, 상기 제2 인식 부재 연결부는, 제1 층(예: 도 5a의 제1 층)과 제2 층(예: 도 5a의 제2 층)을 포함할 수 있고, 상기 제2 인식 부재 연결부의 제1 층은, 상기 제2 인식 부재와 연결을 위한 배선이 배치된 제1구역(예: 도 5a의 제1 구역)과 상기 제2 컨택부와 연결을 위한 배선이 배치된 제2 구역(예: 도 5a의 제2 구역)을 포함할 수 있다. 또한, 상기 제2 컨택부는 상기 제2 인식 부재 연결부 제1 층의 제2 구역과 상기 제2 지지부의 제2 부분 사이에 배치될 수 있고, 상기 제2 인식 부재 연결부의 제1 층의 제1 구역과 상기 제2 지지부의 제2 부분 사이를 절연하 도록 배치되는 절연층(예: 도 5a의 절연층)을 더 포함할 수 있다. 또한, 상기 제1 지지부는, 상기 디스플레이 패널의 제3 영역과 대면하는 부분이 휘어질 수 있도록 복수의 홈이 형성된 유연 연결부(예: 도 4b의 유연 연결부)를 포함할 수 있고, 상기 전자 장치는, 상기 제1 지지부의 유연 연결부와 대면하는 위치에서 상기 제1 인식 부재의 상부에 배치되고 상기 제1 인식 부재 연결부와 전기적 으로 연결되는 제3 컨택부(예: 도 6a의 제3 컨택부(610A)) 및 상기 제1 지지부의 유연 연결부와 대면하는 위치 에서 상기 제2 인식 부재의 상부에 배치되고 상기 제2 인식 부재 연결부와 전기적으로 연결되는 제4 컨택부(예: 도 6a의 제4 컨택부(610B));를 더 포함할 수 있다. 또한, 상기 제3 컨택부 및 상기 제4 컨택부는, 상기 제1 지지부의 유연 연결부의 휘어짐에 의해 상기 유연 연결 부와 접촉되도록 높이가 조절될 수 있다. 또한, 상기 제1 지지부는 도전성 소재로 형성될 수 있고, 상기 제1 인식 부재의 가장자리에 인접하게 상기 제1 지지부와 상기 제1 인식 부재의 사이에 배치되고 상기 제1 인식 부재 연결부와 전기적으로 연결되는 제5 컨택부 (예: 도 7a의 제5 컨택부(710A)) 및 상기 제2 인식 부재의 가장자리에 인접하게 상기 제1 지지부와 상기 제2 인 식 부재의 사이에 배치되고 상기 제2 인식 부재 연결부와 전기적으로 연결되는 제6 컨택부(예: 도 7a의 제6 컨 택부(710B))를 더 포함할 수 있다. 또한, 상기 제5 컨택부는, 상기 제1 인식 부재 연결부에 대하여 상기 제1 인식 부재 연결부의 연장 방향과 수직 한 위치에서 상기 제1 인식 부재 연결부와 인접하도록 배치될 수 있고, 상기 제6 컨택부는, 상기 제2 인식 부재 연결부에 대하여 상기 제2 인식 부재 연결부의 연장 방향과 수직한 위치에서 상기 제2 인식 부재 연결부와 인접 하도록 배치될 수 있다. 본 문서에 개시된 다양한 실시예에 따른 펜 입력 기능을 포함하는 디스플레이 모듈(예: 도 4b의 디스플레이 모 듈)은, 제1 영역(예: 도 4b의 제1 영역(440A)), 제2 영역(예: 도 4b의 제2 영역(440B)), 상기 제1 영역과 상기 제2 영역을 연결하고 적어도 일부분이 휘어질 수 있도록 형성된 제3 영역(예: 도 4b의 제3 영역(440C))을 포함하는 디스플레이 패널(예: 도 4b의 디스플레이 패널), 상기 디스플레이 패널의 하부에 배치되어 상기 디스플레이 패널을 지지하는 제1 지지부(예: 도 4b의 제1 지지부), 상기 제1 지지부의 하부에 배치되는 제 1 인식 부재(예: 도 4b의 제1 인식 부재(460A)), 상기 제1 인식 부재와 분리되고 상기 제1 지지부의 하부에 배 치되는 제2 인식 부재(예: 도 4b의 제2 인식 부재(460B))를 포함하고, 펜 입력 장치의 신호를 인식하는 인식 부 재(예: 도 4b의 인식 부재), 상기 인식 부재의 하부에 배치되는 제1 부분(예: 도 4b의 제1 부분(470A)), 상기 제1 부분과 분리되고 상기 인식 부재의 하부에 배치되는 제2 부분(예: 도 4b의 제2 부분(470B))을 포함하 는 제2 지지부(예: 도 4b의 제2 지지부), 상기 디스플레이 패널과 제1 인쇄 회로 기판(예: 도 4b의 제1 인 쇄 회로 기판(510A))을 전기적으로 연결하는 연결부(예: 도 4b의 연결부), 상기 제1 인식 부재와 상기 제1 인쇄 회로 기판을 전기적으로 연결하는 제1 인식 부재 연결부(예: 도 4b의 제1 인식 부재 연결부(461A)), 상기 제2 인식 부재와 상기 제1 인쇄 회로 기판과 분절된 제2 인쇄 회로 기판(예: 도 4b의 제2 인쇄 회로 기판 (510B))을 전기적으로 연결하는 제2 인식 부재 연결부(예: 도 4b의 제2 인식 부재 연결부(461B)), 상기 제2 지 지부의 제1 부분과 상기 연결부 사이에 배치되어 상기 제2 지지부의 제1 부분과 연결부를 전기적으로 연결하는 제1 컨택부(예: 도 4b의 제1 컨택부(480A)) 및 상기 제2 지지부의 제2 부분과 상기 제2 인식 부재 연결부 사이 에 배치되어 상기 제2 지지부의 제2 부분과 제2 인식 부재 연결부를 전기적으로 연결하는 제2 컨택부(예: 도 4b 의 제2 컨택부(480B))를 포함할 수 있다. 또한, 상기 제2 지지부의 제2 부분은, 판상으로 형성되어 전면이 상기 제2 인식 부재와 접하고, 후면이 상기 제 2 인쇄 회로 기판과 마주하도록 배치될 수 있고, 상기 제2 인식 부재 연결부는, 적어도 일부분이 상기 제2 지지 부의 제2 부분의 측면을 지날 수 있다. 또한, 상기 제2 컨택부는, 상기 제2 지지부의 제2 부분의 후면과 상기 제2 인식 부재 연결부 사이에 배치될 수 있다. 또한, 상기 제2 컨택부는, 도전 소재로 형성되며 적어도 일부분이 접착성을 갖도록 형성될 수 있다. 또한, 상기 제2 인식 부재 연결부는, 제1 층(예: 도 5a의 제1 층)과 제2 층(예: 도 5a의 제2 층)을 포함할 수 있고, 상기 제2 인식 부재 연결부의 제1 층은, 상기 제2 인식 부재와 연결을 위한 배선이 배치된 제1 구역(예: 도 5a의 제1 구역)과 상기 제1 컨택부와 연결을 위한 배선이 배치된 제2 구역(예: 도 5a의 제2 구역)을 포함할 수 있다. 또한, 상기 제2 컨택부는 상기 제2 인식 부재 연결부의 제1 층의 제2 구역과 상기 제2 지지부의 제2 부분 사이 에 배치될 수 있고, 상기 제2 인식 부재 연결부의 제1 층의 제1 구역과 상기 제2 지지부의 제2 부분 사이를 절 연하도록 배치되는 절연층(예: 도 5a의 절연층)을 더 포함할 수 있다. 또한, 상기 제1 지지부는, 상기 디스플레이 패널의 제3 영역과 대면하는 부분이 휘어질 수 있도록 복수의 홈이 형성된 유연 연결부(예: 도 4b의 유연 연결부)를 포함할 수 있고, 상기 디스플레이 모듈은, 상기 제1 지지 부의 유연 연결부와 대면하는 위치에서 상기 제1 인식 부재의 상부에 배치되고 상기 제1 인식 부재 연결부와 전 기적으로 연결되는 제3 컨택부(예: 도 6a의 제3 컨택부(610A)) 및 상기 제1 지지부의 유연 연결부와 대면하는 위치에서 상기 제2 인식 부재의 상부에 배치되고 상기 제2 인식 부재 연결부와 전기적으로 연결되는 제4 컨택부 (예: 도 6a의 제4 컨택부(610B))를 더 포함할 수 있다. 또한, 상기 제3 컨택부 및 제4 컨택부는, 상기 제1 지지부의 유연 연결부의 휘어짐에 의해 상기 유연 연결부와 접촉되도록 높이가 조절될 수 있다. 또한, 상기 제1 인식 부재의 가장자리에 인접하게 상기 제1 지지부와 상기 제1 인식 부재의 사이에 배치되고 상 기 제1 인식 부재 연결부와 전기적으로 연결되는 제5 컨택부(예: 도 7a의 제5 컨택부(710A)) 및 상기 제2 인식 부재의 가장자리에 인접하게 상기 제1 지지부와 상기 제2 인식 부재의 사이에 배치되고 상기 제2 인식 부재 연 결부와 전기적으로 연결되는 제6 컨택부(예: 도 7a의 제6 컨택부(710B))를 더 포함할 수 있다. 또한, 상기 제5 컨택부는, 상기 제1 인식 부재 연결부에 대하여 상기 제1 인식 부재 연결부의 연장 방향과 수직 한 위치에서 상기 제1 인식 부재 연결부와 인접하도록 배치될 수 있고, 상기 제6 컨택부는, 상기 제2 인식 부재 연결부에 대하여 상기 제2 인식 부재 연결부의 연장 방향과 수직한 위치에서 상기 제2 인식 부재 연결부와 인접 하도록 배치될 수 있다. 그리고 본 명세서와 도면에 개시된 본 문서에 개시된 실시예들은 본 문서에 개시된 실시예에 따른 기술 내용을 쉽게 설명하고 본 문서에 개시된 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 문서에 개시된 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 문서에 개시된 다양한 실시예의 범위는 여기에 개시 된 실시예들 이외에도 본 문서에 개시된 다양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변 형된 형태가 본 문서에 개시된 다양한 실시예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2021-0017410", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a는 본 발명의 다양한 실시예들에 따른 전자 장치의 펼침 상태(unfolded stage)를 도시한 도면이다. 도 2b는 본 발명의 다양한 실시예들에 따른 도 2a의 전자 장치의 접힘 상태(folded state)를 도시한 도면이다. 도 3은 본 발명의 다양한 실시예들에 따른 전자 장치의 분리 사시도이다. 도 4a는, 본 문서에 개시된 다양한 실시예에 따른 디스플레이 모듈의 배면도이다. 도 4b는, 도 2a에 도시된 전자 장치를 P1-P1선을 따라 절개한 단면의 모식도이다. 도 4c는, 도 4a에 도시된 유연 연결부의 일부를 도시한 도면이다. 도 5a는, 도 4a에 도시된 제2 인식 부재 연결부(461B)와 그 주변 구성 요소를 P2-P2선을 따라 절개한 단면의 모 식도이다. 도 5b는, 본 문서에 개시된 다양한 실시예에 따른 제2 인식 부재 연결부(461B)의 레이어 구조를 설명하기 위한 도면이다. 도 6a는, 본 문서에 개시된 다양한 실시예에 따른 디스플레이 모듈의 단면 모식도이다. 도 6b는, 도 6a에 도시된 인식 부재와 제2 컨택부의 전기적인 연결 관계를 도시한 모식도이다. 도 6c는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 접힘에 따른 제2 컨택부와 유연 연결부의 접촉 관계를 설명하기 위한 도면이다. 도 7a는, 본 문서에 개시된 다양한 실시예에 따른 디스플레이 모듈의 단면 모식도이다. 도 7b는, 도 7a에 도시된 인식 부재와 제3 컨택부의 전기적인 연결 관계를 도시한 모식도이다."}
