{"patent_id": "10-2021-0088616", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0093195", "출원번호": "10-2021-0088616", "발명의 명칭": "차량의 흐름방향을 출력하는 방법, 장치, 노변 기기 및 클라우드 제어 플랫폼", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "가오, 쑤"}}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량의 흐름방향을 출력하는 방법으로서, 차량의 주행궤적을 획득하는 단계;도로에 대응되는 흐름방향 곡선 집합을 획득하는 단계 - 상기 흐름방향 곡선 집합은 차량의 흐름방향을 특성화하는 적어도 하나의 흐름방향 곡선을 포함함 - ;상기 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계; 및상기 흐름방향 곡선 집합 중에서 상기 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 상기 주행궤적의 흐름방향으로 선택하여 출력하는 단계를 포함하는, 차량의 흐름방향을 출력하는 방법."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상술한 상기 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계는,최근접 이웃 알고리즘을 사용하여 상기 흐름방향 곡선 위에서 상기 주행궤적 위의 점과 거리가 가장 가까운 비교점을 결정하는 단계;정규화된 교차 상관 알고리즘을 사용하여 상기 주행궤적 위의 점과 상기 비교점의 상관 값을 결정하는 단계; 및상기 상관 값에 기반하여 상기 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계를 포함하는, 차량의 흐름방향을 출력하는 방법."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상술한 상기 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계는,상기 흐름방향 곡선과 상기 주행궤적의 형상의 유사성에 기반하여 상기 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계를 포함하는, 차량의 흐름방향을 출력하는 방법."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상술한 상기 흐름방향 곡선과 상기 주행궤적의 형상의 유사성에 기반하여 상기 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계는,상기 흐름방향 곡선과 상기 주행궤적의 하우스도르프 거리를 결정하고, 상기 하우스도르프 거리를 상기 흐름방향 곡선과 상기 주행궤적의 유사도로 하는 단계를 포함하는, 차량의 흐름방향을 출력하는 방법."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서, 상기 흐름방향은 직진, 좌회전, 우회전, 유턴 중 적어도 하나를 포함하는, 공개특허 10-2021-0093195-3-차량의 흐름방향을 출력하는 방법."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "차량의 흐름방향을 출력하는 장치로서, 차량의 주행궤적을 획득하도록 구성되는 제1 획득 모듈;도로에 대응되는 흐름방향 곡선 집합을 획득하도록 구성되는 제2 획득 모듈 - 상기 흐름방향 곡선 집합은 차량의 흐름방향을 특성화하는 적어도 하나의 흐름방향 곡선을 포함함 - ;상기 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하도록 구성되는 결정 모듈;및상기 흐름방향 곡선 집합 중에서 상기 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 상기 주행궤적의 흐름방향으로 선택하여 출력하도록 구성되는 출력 모듈을 포함하는, 차량의 흐름방향을 출력하는 장치."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 결정 모듈은 나아가, 최근접 이웃 알고리즘을 사용하여 상기 흐름방향 곡선 위에서 상기 주행궤적 위의 점과 거리가 가장 가까운 비교점을 결정하고;정규화된 교차 상관 알고리즘을 사용하여 상기 주행궤적 위의 점과 상기 비교점의 상관 값을 결정하고; 상기 상관 값에 기반하여 상기 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하도록 구성되는, 차량의 흐름방향을 출력하는 장치."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 결정 모듈은 나아가,상기 흐름방향 곡선과 상기 주행궤적의 형상의 유사성에 기반하여 상기 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하도록 구성되는, 차량의 흐름방향을 출력하는 장치."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 결정 모듈은 나아가,상기 흐름방향 곡선과 상기 주행궤적의 하우스도르프 거리를 결정하고, 상기 하우스도르프 거리를 상기 흐름방향 곡선과 상기 주행궤적의 유사도로 하도록 구성되는, 차량의 흐름방향을 출력하는 장치."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항 내지 제9항 중 어느 한 항에 있어서, 상기 흐름방향은 직진, 좌회전, 우회전, 유턴 중 적어도 하나를 포함하는, 차량의 흐름방향을 출력하는 장치."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2021-0093195-4-전자 기기로서, 적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하며, 상기 메모리는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령을 저장하고, 상기 명령은 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제5항 중 어느 한 항의 방법을 수행하도록 하는, 전자 기기."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독가능 저장 매체로서,상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제5항 중 어느 한 항의 방법을 수행하도록 하는, 비일시적 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "노변 기기로서, 제11항에 따른 전자 기기를 포함하는, 노변 기기."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "클라우드 제어 플랫폼으로서, 제11항에 따른 전자 기기를 포함하는, 클라우드 제어 플랫폼."}
{"patent_id": "10-2021-0088616", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "매체에 저장된 컴퓨터 프로그램을 포함하는 컴퓨터 프로그램 제품으로서,당해 컴퓨터 프로그램이 프로세서에 의해 실행되는 경우, 제1항 내지 제5 항 중 어느 한 항의 방법을 구현하는, 컴퓨터 프로그램 제품."}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 실시예는 차량의 흐름방향을 출력하는 방법, 장치, 노변 기기 및 클라우드 제어 플랫폼을 개시하며, 스마트 교통, 자동 운전 등 인공 지능"}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 것이다. 당해 차량의 흐름방향을 출력하는 방법은, 차량 의 주행궤적을 획득하는 단계; 도로에 대응되는 흐름방향 곡선 집합을 획득하는 단계 - 여기서 흐름방향 곡선 집 합은 차량의 흐름방향을 특성화하는 적어도 하나의 흐름방향 곡선을 포함함 - ; 흐름방향 곡선 집합 중의 각 흐 름방향 곡선과 주행궤적의 유사도를 결정하는 단계; 및 흐름방향 곡선 집합 중에서 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 주행궤적의 흐름방향으로 선택하여 출력하는 단계를 포함하는바, 이로써 수동 방식으로 차량 흐름량을 계산함으로 인해 초래되는 오류를 해결할 수 있다. 대 표 도 - 도2"}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2021-0093195 CPC특허분류 G08G 1/0141 (2013.01)명 세 서 청구범위 청구항 1 차량의 흐름방향을 출력하는 방법으로서, 차량의 주행궤적을 획득하는 단계; 도로에 대응되는 흐름방향 곡선 집합을 획득하는 단계 - 상기 흐름방향 곡선 집합은 차량의 흐름방향을 특성화 하는 적어도 하나의 흐름방향 곡선을 포함함 - ; 상기 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계; 및 상기 흐름방향 곡선 집합 중에서 상기 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 상기 주행궤적의 흐 름방향으로 선택하여 출력하는 단계를 포함하는, 차량의 흐름방향을 출력하는 방법. 청구항 2 제1항에 있어서, 상술한 상기 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계는, 최근접 이웃 알고리즘을 사용하여 상기 흐름방향 곡선 위에서 상기 주행궤적 위의 점과 거리가 가장 가까운 비 교점을 결정하는 단계; 정규화된 교차 상관 알고리즘을 사용하여 상기 주행궤적 위의 점과 상기 비교점의 상관 값을 결정하는 단계; 및 상기 상관 값에 기반하여 상기 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계를 포함하는, 차량의 흐름방향을 출력하는 방법. 청구항 3 제1항에 있어서, 상술한 상기 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하는 단계는, 상기 흐름방향 곡선과 상기 주행궤적의 형상의 유사성에 기반하여 상기 흐름방향 곡선과 상기 주행궤적의 유사 도를 결정하는 단계를 포함하는, 차량의 흐름방향을 출력하는 방법. 청구항 4 제3항에 있어서, 상술한 상기 흐름방향 곡선과 상기 주행궤적의 형상의 유사성에 기반하여 상기 흐름방향 곡선과 상기 주행궤적 의 유사도를 결정하는 단계는, 상기 흐름방향 곡선과 상기 주행궤적의 하우스도르프 거리를 결정하고, 상기 하우스도르프 거리를 상기 흐름방 향 곡선과 상기 주행궤적의 유사도로 하는 단계를 포함하는, 차량의 흐름방향을 출력하는 방법. 청구항 5 제1항 내지 제4항 중 어느 한 항에 있어서, 상기 흐름방향은 직진, 좌회전, 우회전, 유턴 중 적어도 하나를 포함하는, 차량의 흐름방향을 출력하는 방법. 청구항 6 차량의 흐름방향을 출력하는 장치로서, 차량의 주행궤적을 획득하도록 구성되는 제1 획득 모듈; 도로에 대응되는 흐름방향 곡선 집합을 획득하도록 구성되는 제2 획득 모듈 - 상기 흐름방향 곡선 집합은 차량 의 흐름방향을 특성화하는 적어도 하나의 흐름방향 곡선을 포함함 - ; 상기 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하도록 구성되는 결정 모듈; 및 상기 흐름방향 곡선 집합 중에서 상기 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 상기 주행궤적의 흐 름방향으로 선택하여 출력하도록 구성되는 출력 모듈을 포함하는, 차량의 흐름방향을 출력하는 장치. 청구항 7 제6항에 있어서, 상기 결정 모듈은 나아가, 최근접 이웃 알고리즘을 사용하여 상기 흐름방향 곡선 위에서 상기 주행궤적 위의 점과 거리가 가장 가까운 비 교점을 결정하고; 정규화된 교차 상관 알고리즘을 사용하여 상기 주행궤적 위의 점과 상기 비교점의 상관 값을 결정하고; 상기 상관 값에 기반하여 상기 흐름방향 곡선과 상기 주행궤적의 유사도를 결정하도록 구성되는, 차량의 흐름방향을 출력하는 장치. 청구항 8 제6항에 있어서, 상기 결정 모듈은 나아가, 상기 흐름방향 곡선과 상기 주행궤적의 형상의 유사성에 기반하여 상기 흐름방향 곡선과 상기 주행궤적의 유사 도를 결정하도록 구성되는, 차량의 흐름방향을 출력하는 장치. 청구항 9 제8항에 있어서, 상기 결정 모듈은 나아가, 상기 흐름방향 곡선과 상기 주행궤적의 하우스도르프 거리를 결정하고, 상기 하우스도르프 거리를 상기 흐름방 향 곡선과 상기 주행궤적의 유사도로 하도록 구성되는, 차량의 흐름방향을 출력하는 장치. 청구항 10 제6항 내지 제9항 중 어느 한 항에 있어서, 상기 흐름방향은 직진, 좌회전, 우회전, 유턴 중 적어도 하나를 포함하는, 차량의 흐름방향을 출력하는 장치. 청구항 11 전자 기기로서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하며, 상기 메모리는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령을 저장하고, 상기 명령은 상기 적어도 하 나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제5항 중 어느 한 항의 방법을 수 행하도록 하는, 전자 기기. 청구항 12 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독가능 저장 매체로서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제5항 중 어느 한 항의 방법을 수행하도록 하는, 비일시적 컴퓨터 판독가능 저장 매체. 청구항 13 노변 기기로서, 제11항에 따른 전자 기기를 포함하는, 노변 기기. 청구항 14 클라우드 제어 플랫폼으로서, 제11항에 따른 전자 기기를 포함하는, 클라우드 제어 플랫폼. 청구항 15 매체에 저장된 컴퓨터 프로그램을 포함하는 컴퓨터 프로그램 제품으로서, 당해 컴퓨터 프로그램이 프로세서에 의해 실행되는 경우, 제1항 내지 제5 항 중 어느 한 항의 방법을 구현하는, 컴퓨터 프로그램 제품. 발명의 설명 기 술 분 야 본 출원은 컴퓨터 기술 분야에 관한 것으로, 구체적으로는 스마트 교통, 자동 운전 등 인공 지능 기술 분야에 관한 것이며, 특히 차량의 흐름방향을 출력하는 방법, 장치, 노변 기기 및 클라우드 제어 플랫폼에 관한 것이다."}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 교통 시스템은 선진적인 과학 기술(정보 기술, 컴퓨터 기술, 데이터 통신 기술, 센서 기술, 전자 제어 기술, 자동 제어 이론, 오퍼레이션 리서치, 인공 지능 등)을 교통운송, 서비스제어 및 차량 제조에 효과적으로 통합 운용하여 차량, 도로, 사용자 삼자 간의 연계를 강화함으로써, 안전보장, 효율향상, 환경개선, 에너지절감 의 통합 운송 시스템을 형성한다. 스마트 교통에서 서로 다른 흐름방향의 차량에 대한 카운팅은 아주 중요한 문제인바, 교통길목에 대한 분석에 사용되어 신호등을 더 잘 동적으로 조절 제어할 수 있다."}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원의 실시예는 차량의 흐름방향을 출력하는 방법, 장치, 노변 기기 및 클라우드 제어 플랫폼을 제공한다."}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "첫 번째 측면으로, 본 출원의 실시예는 차량의 흐름방향을 출력하는 방법을 제공하는바, 당해 방법은, 차량의 주행궤적을 획득하는 단계; 도로에 대응되는 흐름방향 곡선 집합을 획득하는 단계 - 여기서 흐름방향 곡선 집합 은 차량의 흐름방향을 특성화하는 적어도 하나의 흐름방향 곡선을 포함함 -; 흐름방향 곡선 집합 중의 각 흐름 방향 곡선과 주행궤적의 유사도를 결정하는 단계; 및 흐름방향 곡선 집합 중에서 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 주행궤적의 흐름방향으로 선택하여 출력하는 단계를 포함한다. 두 번째 측면으로, 본 출원의 실시예는 차량의 흐름방향을 출력하는 장치를 제공하는바, 당해 장치는, 차량의 주행궤적을 획득하도록 구성되는 제1 획득 모듈; 도로에 대응되는 흐름방향 곡선 집합을 획득하도록 구성되는 제2 획득 모듈 - 여기서 흐름방향 곡선 집합은 차량의 흐름방향을 특성화하는 적어도 하나의 흐름방향 곡선을 포함함 - ; 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 주행궤적의 유사도를 결정하도록 구성되는 결정 모듈; 및 흐름방향 곡선 집합 중에서 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 주행궤적의 흐름방향으로 선택하여 출력하도록 구성되는 출력 모듈을 포함한다. 세 번째 측면으로, 본 출원의 실시예는 전자 기기를 제공하는바, 당해 기기는, 적어도 하나의 프로세서; 및 적 어도 하나의 프로세서와 통신 연결되는 메모리를 포함하며, 메모리는 적어도 하나의 프로세서에 의해 실행 가능 한 명령을 저장하고, 명령은 적어도 하나의 프로세서에 의해 실행되어 적어도 하나의 프로세서가 첫 번째 측면 에서의 어느 한 구현방식에서 서술하는 방법을 수행하도록 한다. 네 번째 측면으로, 본 출원의 실시예는 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독가능 저장 매체를 제 공하는바, 컴퓨터 명령은 컴퓨터가 첫 번째 측면에서의 어느 한 구현방식에서 서술하는 방법을 수행하도록 하는 데 사용된다. 다섯 번째 측면으로, 본 출원의 실시예는 매체에 저장된 컴퓨터 프로그램을 제공하는바, 상술한 프로그램이 프 로세서에 의해 실행되는 경우, 첫 번째 측면에서의 어느 한 구현방식에서 서술하는 방법이 수행된다."}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 실시예에 의해 제공되는 차량의 흐름방향을 출력하는 방법, 장치, 노변 기기 및 클라우드 제어 플랫 폼은 먼저 차량의 주행궤적을 획득하고; 그다음 도로에 대응되는 흐름방향 곡선 집합을 획득하고; 그다음 흐름 방향 곡선 집합 중의 각 흐름방향 곡선과 주행궤적의 유사도를 결정하고; 마지막으로 흐름방향 곡선 집합 중에 서 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 주행궤적의 흐름방향으로 선택하여 출력함으로써, 수동 방식으로 차량 흐름량을 집계함으로 인해 초래되는 오류를 해결할 수 있다. 본 부분에서 설명된 내용은 본 개시의 실시예의 핵심적인 또는 중요한 특징을 표시하기 위한 것이 아니고, 본 개시의 범위를 한정하기 위한 것도 아님을 이해해야 한다. 본 개시의 다른 특징은 아래의 명세서를 통해 이해하 기 수월해질 것이다."}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 실시예들에서 사용되는 용어는 본 실시예들에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 부분에서 상세히 그 의미를 기재할 것이다. 따라서, 본 실시예들에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 실시예들 전반에 걸친 내용을 토대로 정의되어야 한다. 본 실시예들은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는바, 일부 실시예들을 도면에 예시하 고 상세하게 설명하고자 한다. 그러나, 이는 본 실시예들을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 실시예들의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한 다. 본 명세서에서 사용한 용어들은 단지 실시예들의 설명을 위해 사용된 것으로, 본 실시예들을 한정하려는 의 도가 아니다."}
{"patent_id": "10-2021-0088616", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 실시예들에 사용되는 용어들은 다르게 정의되지 않는 한, 본 실시예들이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 일반적으로 사용되는 사전에 정의되어 있는 것 과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 실시 예들에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않아야 한다. 후술하는 본 발명에 대한 상세한 설명은, 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도 면을 참조한다. 이러한 실시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명의 다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 본 명세서에 기재되 어 있는 특정 형상, 구조 및 특성은 본 발명의 정신과 범위를 벗어나지 않으면서 일 실시예로부터 다른 실시예 로 변경되어 구현될 수 있다. 또한, 각각의 실시예 내의 개별 구성요소의 위치 또는 배치도 본 발명의 정신과 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미 로서 행하여지는 것이 아니며, 본 발명의 범위는 특허청구범위의 청구항들이 청구하는 범위 및 그와 균등한 모 든 범위를 포괄하는 것으로 받아들여져야 한다. 도면에서 유사한 참조 부호는 여러 측면에 걸쳐서 동일하거나 유사한 구성요소를 나타낸다. 한편, 본 명세서에서 하나의 도면 내에서 개별적으로 설명되는 기술적 특징은 개별적으로 구현될 수도 있고, 동 시에 구현될 수도 있다. 본 명세서에서, \"~유닛(unit)\"은 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로 세서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다. 이하, 첨부 도면과 실시예를 결부하여 본 출원을 보다 상세히 설명한다. 여기서 설명한 구체적인 실시예는 단지 관련 발명을 해석하기 위한 것이고, 본 발명에 대한 한정이 아님을 이해할 수 있을 것이다. 이외 또 부연하면, 설명의 편의를 위해 첨부 도면에서는 관련 발명과 상관되는 부분만을 도시한다. 부연하면, 상충되지 않은 한, 본 출원의 실시예 및 실시예의 특징은 상호 조합될 수 있다. 아래 첨부 도면을 참 조하면서 실시예를 결부하여 본 출원을 상세히 설명하고자 한다. 종래의 기술방안에서는 교통길목에서의 차량 흐름량을 집계할 때 흔히 수동 방식으로 집계한다. 즉, 교통길목에 서 도로 출구 및 도로 입구의 위치를 표시하고, 도로 출구와 도로 입구의 대응관계 테이블을 작성하며, 차량 궤 적과 당해 테이블을 비교하는 것을 통해 차량의 흐름방향을 판단한다. 그러나, 종래의 기술방안에는 적어도 아래의 두개 폐단이 존재한다. 만약 차량이 길목에서 나가거나 길목에 진입할 때 가려지면 차량을 탐지하지 못할 수 있으므로, 출구 또는 입구에 도달하는 위치도 탐지하지 못해 차량 흐름량을 계산하는 데 오류가 발생할 수 있다. 만약 집계 시작 시 차량이 길목 중앙에 위치하면 상술한 대응관계 테이블에서 대응관계를 구축할 수 없으며, 또한 잘못된 차량 흐름량 집계를 초래할 수 있다. 종래의 기술방안의 상술한 결함을 감안하여, 본 출원의 실시예는 차량의 흐름방향을 출력하는 방법을 제시한다. 도 1은 본 출원의 차량의 흐름방향을 출력하는 방법 또는 차량의 흐름방향을 출력하는 장치의 실시예가 적용될 수 있는 예시적인 시스템 아키텍처를 도시한다. 도 1에 도시한 바와 같이, 시스템 아키텍처는 단말 기기, 네트워크 및 서버를 포함할 수 있다. 네트워크는 단말 기기와 서버 사이에서 통신 링크를 제공하는 매체로 사용된다. 네트워크 는 다양한 연결 유형, 예를 들면 무선 통신 링크 등을 포함할 수 있다. 단말 기기는 네트워크를 통해 서버와 인터랙션할 수 있다. 단말 기기는 차량의 주행궤적 등을 제공할 수 있으며, 차량탑재 기기 등을 포함하나 이에 한정되지 않는다. 서버는 다양한 서비스를 제공할 수 있는바, 예를 들어 서버는 단말 기기로부터 획득된 차량의 주행궤적 등 데이터에 대해 분석 등 처리를 수행하여, 처리 결과(예를 들어 차량의 흐름방향)를 생성할 수 있다. 부연하면, 서버는 하드웨어일 수도 있고 소프트웨어일 수도 있다. 서버가 하드웨어인 경우, 복수의 서버로 구성된 분산 서버 클러스터로 구현될 수도 있고, 단일 서버로 구현될 수도 있다. 서버가 소프트웨 어인 경우, 복수의 소프트웨어 또는 소프트웨어 모듈(예를 들면 분산 서비스를 제공하는 복수의 소프트웨어 또 는 소프트웨어 모듈)로 구현될 수도 있고, 단일 소프트웨어 또는 소프트웨어 모듈로 구현될 수도 있다. 여기서 는 구체적으로 한정하지 않는다. 부연하면, 본 출원의 실시예에 의해 제공되는 차량의 흐름방향을 출력하는 방법은 일반적으로 서버에 의해 수행되며, 상응하게, 차량의 흐름방향을 출력하는 장치는 일반적으로 서버에 설치된다. 도 1에서의 단말 기기, 네트워크 및 서버의 수는 단지 예시적인 것임을 이해해야 한다. 구현의 필요에 따라, 임 의의 수의 단말 기기, 네트워크 및 서버가 있을 수 있다. 도 2는 본 출원에 따른 차량의 흐름방향을 출력하는 방법의 일 실시예의 흐름개략도이다. 계속하여 도 2를 참조하면, 본 출원에 따른 차량의 흐름방향을 출력하는 방법의 일 실시예의 흐름을 도시 한다. 당해 방법은 하기 단계를 포함한다. 단계에서, 차량의 주행궤적을 획득한다. 본 실시예에서, 차량의 흐름방향을 출력하는 방법의 수행 주체(예를 들면 도 1에 도시한 서버)는 차량의 주행궤적을 획득할 수 있다. 여기서, GPS 위치결정 기기 또는 관성 네비게이션 기기(Inertial Measurement Unit, IMU)를 통해 차량에 대한 위치결정을 수행하여 차량 위치를 획득할 수 있으며, 나아가 각 시점의 차량 위치에 따라 차량의 주행궤적을 작 성할 수 있다. 단계에서, 도로에 대응되는 흐름방향 곡선 집합을 획득한다. 본 실시예에서, 상술한 수행 주체는 도로에 대응되는 흐름방향 곡선 집합을 획득할 수 있다. 여기서, 흐름방향 곡선은 차량의 흐름방향을 특성화하는 데 사용될 수 있는바, 예를 들어 흐름방향 곡선이 직진 라인인 경우 당해 직진 라인은 차량의 흐름방향이 직진임을 나타낼 수 있다. 여기서, 도로의 유형이 다름에 따라 이에 대응되는 모든 가능한 흐름방향 곡선도 다르다. 예를 들어, 십자로는 네개 도로가 모이는 것으로, 각 도로의 모든 가능한 흐름방향 곡선은 각각 직진 라인, 좌회전 라인, 우회전 라 인이며, 따라서 십자로는 총 12개 흐름방향 곡선을 가진다. 여기서, 도로에 대응되는 모든 흐름방향 곡선을 흐름방향 곡선 집합으로 구성하고, 흐름방향 곡선 집합 중의 각 흐름방향 곡선을 이산 처리하여 각 흐름방향 곡선의 점 집합을 얻을 수 있다. 단계에서, 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 주행궤적의 유사도를 결정한다. 본 실시예에서, 상술한 수행 주체는 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 주행궤적의 유사도를 결정할 수 있다. 여기서, 이산 처리 후의 각 흐름방향 곡선을 흐름방향 궤적으로 설정하고, 흐름방향 궤적과 주행궤적의 유사도 를 하나씩 판단하여 각 흐름방향 궤적과 주행궤적의 유사도(예를 들어 90%)를 얻을 수 있다. 여기서, 흐름방향 궤적과 주행궤적의 유사도 판단은 점에 기반하는 방법, 예를 들면 최장 공통 부분 수열 (Longest-Common-Subsequence, LCSS) 알고리즘, 동적 시간 워핑(Dynamic Time Warping, DTW) 알고리즘 등을 사 용할 수 있다. 여기서, 최장 공통 부분 수열 문제는 동적 계획(Dynamic Programming) 방법을 사용하여 효율적으로 해를 구할 수 있다. 두개 수열 X , Y로 예를 들면, 2차원 배열 f[i, j]이 X의 i비트 및 Y의 j비트 이전의 최장 공통 부분 수열의 길이를 표시한다고 설정하면, f[1][1] = same(1,1); f[i,j] = max{f[i-1][j -1] + same(i,j),f[i- 1,j],f[i,j-1]}이며, 여기서 same(a,b)은 X의 a 번째 비트와 Y의 b 번째 비트가 같은 경우, \"1\"이고, 아닌 경 우, \"0\"이다. 이때, 2차원 배열에서 가장 큰 수가 바로 X와 Y의 최장 공통 부분 수열의 길이이며, 당해 배열에 따라 역추적하면 최장 공통 부분 수열을 찾을 수 있다. 여기서, DTW는 길이가 서로 다른 두개 수열의 유사도를 가늠하는 방법으로, 이는 전형적인 최적화 문제인바, 일 정한 조건을 충족시키는 시간 워핑 함수 W(n)로 테스트 템플릿과 참조 템플릿의 시간 대응 관계를 설명하여 두 템플릿이 매칭 시, 누계 거리가 가장 작은 경우에 대응되는 워핑(warping) 함수를 구한다. DTW를 이용하여 유사 도 지표값을 계산하는 경우는 주행궤적과 이 중 어느 하나의 흐름방향 궤적 사이의 dtw 수치를 계산하는 것으로, 당해 dtw 수치가 작을수록 두 그룹의 정보가 더 비슷하다는 것을 나타낸다. 단계에서, 흐름방향 곡선 집합 중에서 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 주행궤적의 흐 름방향으로 선택하여 출력한다. 본 실시예에서, 상술한 수행 주체는 흐름방향 곡선 집합 중에서 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 주행궤적의 흐름방향으로 선택하여 출력할 수 있다. 여기서, 단계를 수행하는 것을 통해 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 주행궤적의 유사도를 얻 을 수 있고, 그다음 이러한 유사도에 대해 최적 유사도 판단을 수행할 수 있다. 여기서, 유사도가 가장 높은 흐 름방향 곡선을 주행궤적의 흐름방향으로 선택하여 출력할 수 있다. 본 출원의 상술한 실시예에 의해 제공되는 차량의 흐름방향을 출력하는 방법은, 수동 방식으로 차량 흐름량을 집계함에 따르는 폐단을 해결할 수 있는바, 즉 차량이 길목에서 나오거나 길목에 진입할 때 가려지거나 또는 집 계 시작시 차량이 길목 중앙에 위치하는 경우에 모두 정확히 차량 흐름량을 집계할 수 있다. 본 실시예의 일부 대안적인 구현방식에서, 상술한 단계는, 흐름방향 곡선과 주행궤적의 형상의 유사성에 기반하여 흐름방향 곡선과 주행궤적의 유사도를 결정하는 단계를 포함한다. 여기서, 흐름방향 곡선과 주행궤적의 유사성 계산은 형상의 방법, 예를 들면 프레셰 거리(Frechet Distance), 하우스도르프 거리(Hausdorff Distance)에 기반할 수 있다. 여기서, 프레셰 거리는 궤적 사이의 유사도를 구할 수 있는바, 단계는 하기와 같다. 흐름방향 곡선이 집중된 흐름방향 곡선 궤적 P 및 주행궤적 Q를 선택하고, P궤 적 길이는 M 이고 Q궤적 길이는 N이고 변수 t를 구간 [0, 1] 내로 제한하고 α(t) 및 (t)는 운동 위치 설명 함수인바, 그러면 α = 0, α = N, = 0, = M이다. t시점에서의 각자 궤적 위에서의 P 및 Q 의 공간 위치를 각각 P(α(t)) 및 Q( (t))로 표시하고, 프레셰 거리는 P와 Q 사이의 최대 거리를 최소화하는 이러한 한 쌍의 함수를 찾는다. 프레셰 거리를 통해 P 궤적과 Q 궤적 점 집합 사이의 거리를 얻을 수 있으며, 거리가 작을수록 두 궤적 추정 사이의 유사도가 높다는 것을 말해주고, 거리가 클수록 두 궤적 사이의 유사 정 도가 낮다는 것을 말해준다. 여기서, 하우스도르프 거리는 두 공간의 기하학적 객체의 최소 거리 중의 최댓값을 측정하는 방법으로, 하우스 도르프 거리가 클수록 유사도가 크고, 반대로, 하우스도르프 거리가 작을수록 유사도가 작다. 도 3은 차량의 흐름방향을 출력하는 방법의 다른 실시예의 흐름도이다. 도 3을 참조하면, 단계에서, 차량의 주행궤적을 획득한다. 단계는 단계와 기본적으로 같은바, 상세한 설명은 생략하기로 한다. 단계에서, 도로에 대응되는 흐름방향 곡선 집합을 획득한다. 단계는 단계와 기본적으로 같은바, 상세한 설명은 생략하기로 한다. 단계에서, 최근접 이웃 알고리즘을 사용하여 흐름방향 곡선 위에서 주행궤적 위의 점과 거리가 가장 가까 운 비교점을 결정한다. 여기서, 최근접 이웃 (K-Nearest Neighbor, KNN) 알고리즘의 핵심 사상은, 만약 하나의 샘플의, 특징 공간에서 의 가장 인접한 k개 샘플 중에서의 대다수가 동일 카테고리에 속한다면, 당해 샘플도 해당 카테고리에 속하며 당해 카테고리의 샘플의 특징을 가진다는 것이다. 여기서, 먼저 최근접 이웃 알고리즘을 통해 임의로 선택된 흐름방향 곡선과 주행궤적의 공통 서브 세그먼트 A와 B를 찾는다. A궤적의 제1점 P1에 있어서, B 궤적 내의 모든 점과 P1의 가장 가까운 점 Q1을 찾고, 그다음 A 궤 적의 제2점 P2에 있어서, B 궤적 내의 모든 점과 P2의 가장 가까운 점 Q2를 찾으며, 순차적으로 유추하여 A궤적 의 점과 B궤적의 점의 비교 집합을 형성한다. 단계에서, 정규화된 교차 상관 알고리즘을 사용하여 주행궤적 위의 점과 비교점의 상관 값을 결정한다. 여기서, 정규화된 교차 상관(Normalized Cross Correlation, NCC) 알고리즘은 유사도 측도에 기반하는 매칭 알 고리즘이다. NCC 알고리즘을 사용하면 단계에서의 비교 집합 사이의 상관 값을 산출할 수 있다. 유사 측도 (Similarity), 즉 개체 사이의 유사 정도를 계산하는 것은, 거리 측도와 반대로, 유사도 측도의 값이 작을수록 개체 사이의 유사도가 더 작고 차이가 더 크다는 것을 말해준다. 정규화는 계산을 간소화하는 방식으로, 즉, 차 원 표현식을 무차원 표현식으로 변환하여 스칼라화한다. 정규화된 교차 알고리즘은 상관계수의 치역을 [-1, 1] 로 하고 데이터를 이 범위 내에 매핑시켜 처리하는 것이다. 단계에서, 상관 값에 기반하여 흐름방향 곡선과 주행궤적의 유사도를 결정한다. 여기서, 단계에서 산출된 비교 집합사이의 상관 값을 해당 흐름방향 곡선과 주행궤적의 유사도로 할 수 있 다. 단계에서, 흐름방향 곡선 집합 중에서 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 주행궤적의 흐 름방향으로 선택하여 출력한다. 단계는 단계와 기본적으로 같으므로 상세한 설명은 생략하기로 한다. 본 실시예의 일부 대안적인 구현방식에서, 상술한 단계에서의 흐름방향 곡선 집합은 직진 라인, 좌회전 라 인, 우회전 라인, 유턴 라인 중 적어도 하나를 포함한다. 여기서 직진 라인은 차량의 흐름방향이 직진임을 나타 내고, 좌회전 라인은 차량의 흐름방향이 좌회전임을 나타내며, 순차적으로 유추한다. 도 4는 본 출원에 따른 차량의 흐름방향을 출력하는 방법의 일 실시예의 응용 시나리오 개략도를 도시한다. 도 4에 도시한 바와 같이, 먼저 차량에 대해 추적한 궤적을 획득하고, 그다음 도로의 상황에 따라 도로에 대응 되는 사전 설정된 모든 흐름방향 궤적(흐름방향 궤적 1, 흐름방향 궤적 2, ..., 흐름방향 궤적 N)을 획득한다. 그다음 사전 설정된 순서에 따라 흐름방향 궤적과 추적된 궤적을 하나씩 유사도를 판단하여, 각 흐름방향 궤적 과 추적된 궤적의 유사도(유사도 1, 유사도 2, 쪋, 유사도 N)를 획득한다. 마지막으로 획득된 모든 유사도에 대 해 최적 유사도를 판단하고, 최고 유사도를 가지는 흐름방향 궤적을 추적된 궤적의 흐름방향으로 한다. 도 5는 본 출원의 차량의 흐름방향을 출력하는 장치의 일 실시예의 구조개략도이다. 나아가 도 5를 참조하면, 상술한 각 도면에 도시된 방법의 구현으로, 본 출원은 차량의 흐름방향을 출력하는 장 치의 일 실시예를 제공하는바, 당해 장치의 실시예는 도 2에 도시된 방법의 실시예에 대응되며, 당해 장치는 다 양한 전자 기기에 적용될 수 있다. 도 5에 도시한 바와 같이, 본 실시예의 차량의 흐름방향을 출력하는 장치는 제1 획득 모듈, 제2 획득 모듈, 결정 모듈 및 출력 모듈을 포함할 수 있다. 여기서, 제1 획득 모듈은 차량의 주행궤 적을 획득하도록 구성되고; 제 2 획득 모듈은 도로에 대응되는 흐름방향 곡선 집합을 획득하도록 구성되고 - 여기서 흐름방향 곡선 집합은 차량의 흐름방향을 특성화하는 적어도 하나의 흐름방향 곡선을 포함함 - ; 결정 모듈은 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 주행궤적의 유사도를 결정하도록 구성되고; 및 출력 모듈은 흐름방향 곡선 집합 중에서 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 주행궤적의 흐름 방향으로 선택하여 출력하도록 구성된다. 본 실시예에서 차량의 흐름방향을 출력하는 장치에서, 제1 획득 모듈, 제2 획득 모듈, 결정 모 듈, 출력 모듈의 구체적인 처리 및 이에 따른 기술적 효과는 각각 도 2에 대응되는 실시예에서의 단 계 내지 단계의 관련 설명을 참조할 수 있는바, 이에 대한 상세한 설명은 생략하기로 한다. 본 실시예의 일부 대안적인 구현방식에서, 결정 모듈은 나아가, 최근접 이웃 알고리즘을 사용하여 흐름방 향 곡선 위에서 주행궤적 위의 점과 거리가 가장 가까운 비교점을 결정하고; 정규화된 교차 상관 알고리즘을 사 용하여 주행궤적 위의 점과 비교점의 상관 값을 결정하고; 상관 값에 기반하여 흐름방향 곡선과 주행궤적의 유 사도를 결정하도록 구성된다. 본 실시예의 일부 대안적인 구현방식에서, 결정 모듈은 나아가, 흐름방향 곡선과 주행궤적의 형상의 유사 성에 기반하여 흐름방향 곡선과 주행궤적의 유사도를 결정하도록 구성된다. 본 실시예의 일부 대안적인 구현방식에서, 결정 모듈은 나아가, 흐름방향 곡선과 주행궤적의 하우스도르프 거리를 결정하고, 하우스도르프 거리를 흐름방향 곡선과 주행궤적의 유사도로 하도록 구성된다. 본 실시예의 일부 대안적인 구현방식에서, 흐름방향은 직진, 좌회전, 우회전, 유턴 중 적어도 하나를 포함한다. 도 6은 본 출원의 실시예의 차량의 흐름방향을 출력하는 방법을 구현하는 전자 기기의 블록도이다. 도 6에 도시한 바와 같이, 도 6은 본 출원의 실시예에 따른 차량의 흐름방향을 출력하는 방법의 전자 기기의 블 록도이다. 전자 기기는 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크벤치, 개인용 디지털 보조기, 서버, 블레이드 서버, 대형 컴퓨터 및 다른 적합한 컴퓨터와 같은 다양한 형식의 디지털 컴퓨터를 가리키고자 하는 것이다. 전자 기기 는 개인용 디지털 처리, 셀룰러 폰, 스마트폰, 웨어러블 기기 및 다른 유사한 컴퓨팅 기기와 같은 다양한 형식 의 이동 장치를 가리킬 수도 있다. 본 명세서에서 제시하는 부품, 이들의 연결과 관계 및 이들의 기능은 단지 예시일 뿐, 본 명세서에서 서술한 및/또는 청구하는 본 출원의 구현을 한정하고자 하는 것이 아니다. 도 6에 도시한 바와 같이, 당해 전자 기기는 하나 또는 복수의 프로세서, 메모리 및 각 부품을 연결 하는 인터페이스를 포함하고, 각 부품을 연결하는 인터페이스는 고속 인터페이스와 저속 인터페이스를 포함한다. 각 부품은 서로 다른 버스를 이용하여 서로 연결되고, 공통 메인보드에 장착되거나 또는 필요에 따라 다른 방식으로 장착될 수 있다. 프로세서는 전자 기기 내에서 실행되는 명령을 처리할 수 있는바, 메모리에 저 장되어 외부 입력/출력 장치(인터페이스에 커플링된 표시 기기와 같은)에 GUI의 그래픽 정보를 표시하기 위한 명령이 포함된다. 다른 실시방식에서, 필요하다면 복수의 프로세서 및/또는 복수의 버스를 복수의 메모리와 함 께 사용할 수 있다. 마찬가지로, 복수의 전자 기기를 연결할 수 있고, 각 기기는 (예를 들어 서버 어레이, 한 그룹의 블레이드 서버 또는 멀티프로세서 시스템으로서) 일부 필요한 조작을 제공할 수 있다. 도 6은 하나의 프 로세서를 예시한다. 메모리가 바로 본 출원에 의해 제공되는 비일시적 컴퓨터 판독가능 저장 매체이다. 여기서, 메모리에는 적 어도 하나의 프로세서에 의해 실행될 수 있는 명령이 저장되어, 적어도 하나의 프로세서에 의해 본 출원에 의해 제공되는 차량의 차선변경 검사 방법이 수행되도록 한다. 본 출원의 비일시적 컴퓨터 판독가능 저장 매체는 컴 퓨터 명령을 저장하고, 당해 컴퓨터 명령은 컴퓨터에 의해 본 출원에 의해 제공되는 차량의 흐름방향을 출력하 는 방법이 수행되도록 한다. 메모리는 비일시적 컴퓨터 판독 가능 저장 매체로서, 본 출원의 실시예의 차량의 흐름방향을 출력하는 방 법에 대응되는 프로그램 명령/모듈(예를 들면, 첨부 도면 5에서 도시한 제1 획득 모듈, 제2 획득 모듈 , 결정 모듈 및 출력 모듈)과 같은 비일시적 소프트웨어 프로그램, 비일시적 컴퓨터 실행가능 프로그램 및 모듈을 저장할 수 있다. 프로세서는 메모리에 저장되는 비일시적 소프트웨어 프로그램, 명령 및 모듈을 실행함으로써 서버의 다양한 기능 응용 및 데이터 처리를 실행하는바, 즉 상술한 방법 실시예에 서의 차량의 흐름방향을 출력하는 방법을 구현한다. 메모리는 프로그램 저장 영역 및 데이터 저장 영역을 포함할 수 있는바, 여기서, 프로그램 저장 영역은 운 영 체제, 적어도 하나의 기능에 있어서 필요한 응용 프로그램을 저장할 수 있고, 데이터 저장 영역은 차량의 흐 름방향을 출력하는 방법에 따른 전자 기기의 사용에 따라 생성되는 데이터 등을 저장할 수 있다. 이 외에도, 메 모리는 고속 랜덤 액세스 메모리를 포함할 수도 있고, 비일시적 메모리, 예를 들어 적어도 하나의 자기 디 스크 저장 디바이스, 플래시 메모리 디바이스 또는 다른 비일시적 고체 상태 저장 디바이스를 더 포함할 수도 있다. 일부 실시예에서, 메모리는 대안적으로 프로세서 대비 원격 설치되는 메모리를 포함하는바, 이 러한 원격 메모리는 네트워크를 통해 차량의 흐름방향을 출력하는 방법의 전자 기기에 연결된다. 상술한 네트워 크의 실제 예는 인터넷, 기업 내부 네트워크, 근거리 통신망, 이동 통신 네트워크 및 이들의 조합을 포함하나 이에 한정되지 않는다. 차량의 흐름방향을 출력하는 방법의 전자 기기는 입력 장치 및 출력 장치를 더 포함할 수 있다. 프로 세서, 메모리, 입력 장치 및 출력 장치는 버스 또는 다른 방식으로 연결될 수 있고, 도 6 에서는 버스에 의한 연결을 제시한다. 입력 장치는 입력되는 숫자 또는 문자(character) 정보를 수신하고, 차량의 흐름방향을 출력하는 방법의 전자 기기의 사용자 설정 및 기능 제어에 관련되는 키 신호 입력을 발생시킬 수 있는바, 예를 들면 터치 스크린, 숫자 키패드, 마우스, 트랙패드, 터치패드, 포인팅 스틱, 하나 또는 복수의 마우스 버튼, 트랙볼, 조이 스틱 등의 입력 장치가 있다. 출력 장치는 표시 기기, 보조 조명장치(예를 들어 LED) 및 촉각 피드백 장치 (예를 들어 진동 모터) 등을 포함할 수 있다. 당해 표시 기기는 액정 디스플레이(LCD), 발광 다이오드(LED) 디 스플레이 및 플라즈마 디스플레이를 포함할 수 있으나 이에 한정되지 않는다. 일부 실시방식에서 표시 기기는 터치 스크린일 수 있다. 본 출원의 실시예는 노변 기기를 더 제공하는바, 당해 노변 기기는 도 6에 도시된 전자 기기를 포함한다. 노변 기기는 전자 기기를 포함하는 외에 통신부품 등을 더 포함할 수 있으며, 전자 기기는 통신부품과 일체로 통합될 수도 있고, 별도로 설치될 수도 있다. 전자 기기는 감지 기기(예로 노변 카메라)의 데이터, 예를 들면 사진 및 영상 등을 획득하여, 영상 처리 및 데이터 컴퓨팅을 수행할 수 있다. 본 출원의 실시예는 클라우드 제어 플랫폼을 더 제공하는바, 당해 클라우드 제어 플랫폼은 도 6에 도시된 전자 기기를 포함한다. 클라우드 제어 플랫폼은 클라우드측에서 처리를 수행하는바, 클라우드 제어 플랫폼에 포함된 전자 기기는 감지 기기(예로 노변 카메라)의 데이터, 예를 들면 사진 및 영상 등을 획득하여 영상 처리 및 데이 터 컴퓨팅을 수행할 수 있으며, 클라우드 제어 플랫폼은 차로 협력 관리 플랫폼, 에지 컴퓨팅 플랫폼, 클라우드 컴퓨팅 플랫폼, 센터 시스템, 클라우드측 서버 등으로 지칭될 수도 있다. 여기서 서술하는 시스템과 기술의 다양한 실시방식은 디지털 전자회로 시스템, 집적회로 시스템, 주문형 ASIC (주문형 집적회로), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다 양한 실시방식은 하나 또는 복수의 컴퓨터 프로그램에서 실시되는 것을 포함할 수 있고, 당해 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그램가능 프로세서를 포함하는 프로그램가능 시스템에서 실행 및/또는 해 석될 수 있고, 당해 프로그램가능 프로세서는 전용의 또는 범용의 프로그램가능 프로세서일 수 있고, 저장 시스 템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터와 명령을 수신하고 데이터와 명령을 당 해 저장 시스템, 당해 적어도 하나의 입력 장치 및 당해 적어도 하나의 출력 장치로 전송할 수 있다. 이러한 컴퓨팅 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션 또는 코드로 지칭되기도 함)은 프로그 램가능 프로세서의 기계 명령을 포함하며, 고급 절차 프로그래밍 언어 및/또는 객체지향 프로그래밍 언어, 및/ 또는 어셈블리어/기계어를 이용하여 이러한 컴퓨팅 프로그램을 실시할 수 있다. 본 명세서에서 사용한 바와 같 이, 용어 '기계 판독가능 매체'와 '컴퓨터 판독가능 매체'는 기계 명령 및/또는 데이터를 프로그램가능 프로세 서에 제공하기 위한 임의의 컴퓨터 프로그램 제품, 기기, 및/또는 장치(예를 들면 자기 디스크, 광 디스크, 메 모리, 프로그램가능 논리 장치(PLD))를 가리키는바, 이는 기계 판독가능 신호로서의 기계 명령을 수신하는 기계 판독가능 매체를 포함한다. 용어 '기계 판독가능 신호'는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서 에 제공하기 위한 임의의 신호를 가리킨다. 사용자와의 인터랙션을 제공하기 위해, 여기서 서술하는 시스템과 기술을 컴퓨터에서 실시할 수 있는바, 당해 컴퓨터는, 사용자한테 정보를 표시하기 위한 표시 장치(예를 들면 음극선관(CRT) 또는 액정 디스플레이(LCD) 모 니터) 및 키보드와 포인팅 장치(예를 들면 마우스 또는 트랙볼)를 구비하고, 사용자는 당해 키보드와 당해 포인 팅 장치를 통해 입력을 컴퓨터에 제공할 수 있다. 다른 종류의 장치 또한 사용자와의 인터랙션을 제공하는 데 사용될 수 있는바, 예를 들면 사용자한테 제공되는 피드백은 임의 형식의 감각 피드백(예를 들어 시각 피드백, 청각 피드백 또는 촉각 피드백)일 수 있고, 임의 형식(소리 입력, 음성 입력 또는 촉각 입력을 포함함)으로 사 용자로부터의 입력이 수신될 수 있다. 여기서 서술하는 시스템과 기술을 백그라운드 부품을 포함하는 컴퓨팅 시스템(예를 들면 데이터 서버로서), 미 들웨어 부품을 포함하는 컴퓨팅 시스템(예를 들면 애플리케이션 서버), 프론트엔드 부품을 포함하는 컴퓨팅 시 스템(예를 들면 그래픽 사용자 인터페이스 또는 네트워크 브라우저를 구비하는 사용자 컴퓨터가 있고, 사용자는 당해 그래픽 사용자 인터페이스 또는 당해 네트워크 브라우저를 통해 여기서 서술하는 시스템 및 기술의 실시방 식과 인터랙션할 수 있음), 또는 이러한 백그라운드 부품, 미들웨어 부품 또는 프런트 엔드 부품의 임의 조합을 포함하는 컴퓨팅 시스템에서 실시할 수 있다. 임의 형식 또는 매체의 디지털 데이터 통신(예를 들면 통신 네트 워크)으로 시스템의 부품을 서로 연결시킬 수 있다. 통신 네트워크의 예시는 근거리 통신망(LAN), 광대역 통신 망(WAN) 및 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트와 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있고, 통상적으로 통신 네트워크를 통해 인터랙션한다. 상응한 컴퓨터에서 실행되고 서로 클라이언트-서버 관계 를 가지는 컴퓨터 프로그램에 의해 클라이언트와 서버의 관계가 발생한다. 본 출원의 기술방안에 따르면, 먼저 차량의 주행궤적을 획득하고, 그다음 도로에 대응되는 흐름방향 곡선 집합 을 획득하고, 그다음 흐름방향 곡선 집합 중의 각 흐름방향 곡선과 주행궤적의 유사도를 결정하고, 마지막으로 흐름방향 곡선 집합 중에서 주행궤적과의 최고 유사도를 가지는 흐름방향 곡선을 주행궤적의 흐름방향으로 선택 하여 출력함으로써, 수동 방식으로 차량 흐름량을 집계함으로 인해 초래되는 오류를 해결할 수 있다. 인공 지능은 컴퓨터가 사람의 어떤 사고 과정과 지능 행위(예로 학습, 추론, 사고, 계획 등)을 모방하도록 하는 것을 연구하는 학과로서, 하드웨어 측면의 기술도 있고 소프트웨어 측면의 기술도 있다. 인공 지능 하드웨어 기 술은 일반적으로 센서, 전용 인공 지능 칩, 클라우드 컴퓨팅, 분산 저장, 빅데이터 처리 등 기술을 포함하고, 인공 지능 소프트웨어 기술은 주로 컴퓨터 시각 기술, 음성 식별 기술, 자연 언어 처리 기술 및 머신 러닝/딥 러닝, 빅데이터 처리 기술, 지식 그래프 기술 등 몇가지 주요 방향을 포함한다. 이상에서 제시하는 다양한 형식의 흐름을 사용하여 단계를 재정렬, 추가 또는 삭제할 수 있음을 이해해야 한다. 예를 들어, 본 출원에 기재된 각 단계는 병렬로 수행될 수도 있고 순차적으로 수행될 수도 있고 서로 다 른 순서로 수행될 수도 있는바, 본 출원에서 개시한 기술방안에서 희망하는 결과를 구현할 수만 있다면, 본 명 세서는 여기서 한정하지 않는다. 상술한 구체적인 실시방식은 본 출원의 보호 범위에 대한 한정을 구성하지 않는다. 당업자라면, 설계 요구와 다 른 요소에 따라 다양한 수정, 조합, 서브조합 및 대체를 진행할 수 있음을 이해해야 한다. 본 출원의 사상 및 원칙 내에서 진행한 어떠한 수정, 등가 치환 및 개선 등은 모두 본 출원의 보호 범위 내에 포함되어야 한다."}
{"patent_id": "10-2021-0088616", "section": "도면", "subsection": "도면설명", "item": 1, "content": "아래의 첨부 도면을 참조한 비한정적 실시예에 대한 상세 설명을 읽어보면, 본 출원의 다른 특징, 목적 및 이점 이 더 분명해질 것이다. 첨부 도면은 본 방안을 더 잘 이해하기 위한 것이며, 본 출원에 대한 한정을 구성하지 않는다. 도 1은 본 출원이 적용될 수 있는 예시적인 시스템 아키텍처 도면이다. 도 2는 본 출원에 따른 차량의 흐름방향을 출력하는 방법의 일 실시예의 흐름개략도이다. 도 3은 본 출원에 따른 차량의 흐름방향을 출력하는 방법의 다른 실시예의 흐름도이다. 도 4는 본 출원에 따른 차량의 흐름방향을 출력하는 방법의 일 실시예의 응용 시나리오 개략도이다. 도 5는 본 출원의 차량의 흐름방향을 출력하는 장치의 일 실시예의 구조개략도이다.도 6은 본 출원의 실시예의 차량의 흐름방향을 출력하는 방법을 구현하는 전자 기기의 블록도이다."}
