{"patent_id": "10-2022-0054175", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0055344", "출원번호": "10-2022-0054175", "발명의 명칭": "가상 다중 링크 동작 방법 및 전자 장치", "출원인": "삼성전자주식회사", "발명자": "최준수"}}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,하나 이상의 메모리; 및상기 하나 이상의 메모리에 작동적으로(operatively) 연결된 하나 이상의 프로세서를 포함하고,상기 하나 이상의 프로세서는,무선 통신을 위해 외부 전자 장치에, 상기 외부 전자 장치와 상기 전자 장치 사이의 가상 다중 링크 동작을 위한 요청 프레임을 전송하는 동작;상기 요청 프레임에 대한 응답으로 상기 외부 전자 장치로부터 응답 프레임을 수신하는 동작;상기 외부 전자 장치와 상기 전자 장치 사이의 제1 무선 링크를 설정하는 동작;상기 외부 전자 장치와 상기 전자 장치 사이의 가상 링크를 설정하는 동작- 상기 가상 링크는 상기 외부 전자장치와 또 다른 전자 장치 사이의 제2 무선 링크 및 상기 또 다른 전자 장치와 상기 전자 장치 사이의 통신 링크를 포함함 -; 및상기 제1 무선 링크 및 상기 가상 링크를 통해 상기 외부 전자 장치와 통신하는 동작을 수행하도록 하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 요청 프레임은 상기 전자 장치의 제1 매체 접근 제어(Medium Access Control, MAC) 주소 및 상기 또 다른전자 장치의 제2 MAC 주소를 포함하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 요청 프레임은 상기 전자 장치의 다중 링크 장치(Multi-Link Device, MLD) MAC 주소를 더 포함하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 요청 프레임은 상기 제2 무선 링크에 대해 상기 또 다른 전자 장치가 지원하는 능력(capability)에 대한정보를 더 포함하는, 전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 하나 이상의 프로세서는상기 또 다른 전자 장치로부터 상기 제2 MAC 주소 및 상기 능력에 대한 정보를 수신하는 것을 더 수행하도록 하공개특허 10-2023-0055344-3-는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,제1 프레임이 상기 제1 무선 링크 및 상기 가상 링크 중 어느 하나를 통해 상기 전자 장치로부터 상기 외부 전자 장치로 전송되는 동안 동시에, 제2 프레임이 상기 제1 무선 링크와 상기 가상 링크 중 다른 하나를 통해 상기 외부 전자 장치로부터 상기 전자 장치로 전송되는 것이 허용되는 전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 외부 전자 장치와 통신하는 동작은,상기 제2 무선 링크를 통해 상기 외부 전자 장치로부터 수신된 데이터 유닛을 상기 통신 링크를 통해 상기 또다른 전자 장치로부터 수신하는 동작을 포함하는 전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 외부 전자 장치와 통신하는 동작은,상기 제2 무선 링크를 통해 상기 외부 전자 장치로 전송될 데이터 유닛을 상기 통신 링크를 통해 상기 또 다른전자 장치로 전송하는 동작을 포함하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 하나 이상의 프로세서는,상기 또 다른 전자 장치를 서빙하기로 결정하는 동작;상기 제1 무선 링크 및 상기 가상 링크를 통한 상기 외부 전자 장치와의 통신을 중단하는 동작; 및상기 외부 전자 장치와 상기 또 다른 전자 장치사이의 또 다른 가상 다중 링크 동작에서 상기 제1 무선 링크를사용하여 상기 또 다른 전자 장치를 서빙하는 동작을 더 수행하도록 하고, 상기 또 다른 가상 다중 링크 동작은 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 또 다른 가상 링크및 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 상기 제2 무선 링크를 사용하고,상기 또 다른 가상 링크는 상기 외부 전자 장치와 상기 전자 장치 사이의 제1 무선 링크 및 상기 non-AP 장치와상기 또 다른 전자 장치 사이의 상기 통신 링크를 포함하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 하나 이상의 프로세서는,공개특허 10-2023-0055344-4-상기 제1 무선 링크 및 상기 가상 링크를 통해 상기 외부 전자 장치와 통신을 재개하기로 결정하는 동작;상기 또 다른 전자 장치에 대한 서빙을 중단하는 동작; 및상기 제1 무선 링크 및 상기 가상 링크를 통해 상기 외부 전자 장치와 통신을 재개하는 동작을 더 수행하도록 하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 또 다른 전자 장치를 서빙하기로 결정하는 동작은,상기 전자 장치가 소정의 시간 동안 사용자 입력을 수신하지 못하고, 상기 또 다른 전자 장치가 사용자 입력을수신한 경우, 상기 또 다른 전자 장치를 서빙하는 것으로 결정하는 동작을 포함하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 요청 프레임은 프로브 요청 프레임 또는 연관 요청 프레임(association request frame)이고, 상기 응답 프레임은 프로브 응답 프레임 또는 연관 응답 프레임인전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 통신 링크는 상기 제1 무선 링크보다 더 높은 스루풋(throughput)을 갖고, 상기 통신 링크는 상기 제2 무선 링크보다 더 높은 스루풋을 갖는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,상기 또 다른 전자 장치는 상기 전자 장치를 충전하기 위한 배터리를 포함하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 외부 전자 장치는 제1 AP(access point) 스테이션 및 제2 AP 스테이션을 포함하고,상기 전자 장치는 제1 non-AP(non-access point) 스테이션을 포함하고,상기 또 다른 전자 장치는 제2 non-AP 스테이션을 포함하고,상기 제1 무선 링크는 상기 제1 AP 스테이션과 제1 non-AP 스테이션 사이에 설정되고,상기 제2 무선 링크는 상기 제2 AP 스테이션과 상기 제2 non-AP 스테이션 사이에 설정되는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2023-0055344-5-전자 장치에 있어서,하나 이상의 메모리; 및하나 이상의 메모리에 작동적으로(operatively) 연결된 하나 이상의 프로세서를 포함하고,상기 하나 이상의 프로세서는,또 다른 전자 장치로부터, 상기 또 다른 전자 장치와 외부 전자 장치 사이의 가상 다중 링크 동작을 위한 요청프레임을 수신하는 동작;상기 요청 프레임에 대한 응답으로 상기 또 다른 전자 장치에 응답 프레임을 전송하는 동작;상기 외부 전자 장치와 상기 전자 장치 사이에 제1 무선 링크를 설정하는 동작; 및상기 가상 다중 링크 동작에서 상기 제1 무선 링크를 사용하여 상기 또 다른 전자 장치를 서빙하는 동작을 수행하도록 하고,상기 가상 다중 링크 동작은 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 가상 링크, 및 상기 외부전자 장치와 상기 또 다른 전자 장치 사이의 제2 무선 링크를 사용하고,상기 가상 링크는 상기 외부 전자 장치와 상기 전자 장치 사이의 상기 제1 무선 링크 및 상기 전자 장치와 상기또 다른 전자 장치 사이의 통신 링크를 포함하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 응답 프레임은 상기 전자 장치의 매체 접근 제어(medium access control, MAC) 주소를 포함하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 하나 이상의 프로세서는상기 또 다른 전자 장치에 대한 데이터 유닛이 상기 제1 무선 링크를 통해 상기 외부 전자 장치로부터 수신되는경우, 상기 통신 링크를 통해 상기 데이터 유닛을 상기 또 다른 전자 장치에 전송하는 동작을 더 수행하도록 하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서,상기 하나 이상의 프로세서는 상기 통신 링크를 통해 상기 또 다른 전자 장치로부터 데이터 유닛이 수신되는 경우, 상기 제1 무선 링크를 통해 상기 데이터 유닛을 상기 외부 전자 장치로 전송하는 동작을 더 수행하도록 하는전자 장치."}
{"patent_id": "10-2022-0054175", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치와 무선 통신을 위한 외부 전자 장치에 있어서,하나 이상의 메모리; 및공개특허 10-2023-0055344-6-상기 하나 이상의 메모리에 작동적으로(operatively) 연결된 하나 이상의 프로세서를 포함하고,상기 하나 이상의 프로세서는,상기 전자 장치로부터, 상기 외부 전자 장치와 상기 전자 장치 사이의 가상 다중 링크 동작을 위한 요청 프레임을 수신하는 동작;상기 요청 프레임에 대한 응답으로 상기 전자 장치에 응답 프레임을 전송하는 동작;상기 외부 전자 장치와 상기 전자 장치사이에 제1 무선 링크를 설정하는 동작;상기 외부 전자 장치와 상기 전자 장치 사이에 가상 링크를 설정하는 동작- 상기 가상 링크는 상기 외부 전자장치와 상기 또 다른 전자 장치 사이의 제2 무선 링크 및 상기 또 다른 전자 장치와 상기 전자 장치 사이의 통신 링크를 포함함 -; 및제1 무선 링크 및 가상 링크를 통해 상기 전자 장치와 통신하는 동작을 수행하도록 하는외부 전자 장치."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "무선 통신 네트워크는 외부 전자 장치, 제1 전자 장치 및 제2 전자 장치를 포함할 수 있다. 제1 전자 장치는 외 부 전자 장치 와 제1 전자 장치 사이의 가상 다중 링크 동작을 위한 요청 프레임을 외부 전자 장치에 전송할 수 있다. 제1 전자 장치는 요청 프레임에 대한 응답으로 외부 전자 장치 로부터 응답 프레임을 수신할 수 있다. 외 부 전자 장치 와 제1 전자 장치 사이에 제1 무선 링크가 설정될 수 있다. 외부 전자 장치 와 제1 전자 장치 사이 에 가상 링크가 설정될 수 있다. 가상 링크는 외부 전자 장치 와 제2 전자 장치 사이의 제2 무선 링크 및 제2 전 자 장치와 제1 전자 장치 사이의 통신 링크를 포함할 수 있다. 제1 전자 장치는 제1 무선 링크 및 가상 링크를 통해 외부 전자 장치와 통신할 수 있다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예들은 무선 통신 시스템에 관한 것으로, 특히 예를 들어, 가상 다중 링크 동작에 관한 것이지만 이에 한정되지 않는다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신 장치가 증강 현실(augmented reality, AR), 로봇 공학, 인공 지능(artificial intelligence, AI), 클라우드 컴퓨팅 및 무인 차량과 같은 다양한 지연에 민감한 애플리케이션 또는 실시간 애플리케이션을 지원하 는 것이 점점 더 요구되고 있다. 이러한 애플리케이션이 요구하는 극도로 낮은 지연 시간(latency)와 극도로 높 은 처리량을 구현하기 위해 무선 근거리 통신망(WLAN)에서는 다중 링크 동작(multi-link operation, MLO)이 제 안되었다. WLAN은 가정, 학교, 아파트 또는 사무실 건물과 같은 제한된 영역 내에서 WLAN 장치에 의해 형성된다. 각각의 WLAN 장치는 액세스 포인트(AP) 스테이션(STA) 및 비 액세스 포인트(non-AP) STA와 같은 하나 이상의 스테이션(STA)을 가질 수 있다. MLO는 non-AP 다중 링크 장치(Multi-Link Device, MLD)가 AP MLD와 다중 링크를 설정하도록 할 수 있다. 다중 링크 각각은 non-AP MLD와 AP MLD 사이의 채널 액세스 및 프레임 교환을 독립적으로 가능하게 할 수 있으며, 이 는 지연 시간을 줄이고 처리량을 증가시킬 수 있다. 최근의 스마트폰과 같은 무선 통신 장치들이 가지는 공간적 제약으로 인해 다중 링크를 위한 송수신기나 안테나 가 근접하므로, 다중 링크에 대한 장치 내 공존간섭(in-device coexistence interference)이 발생하게 된다. 장치 내 공존 간섭은 MLD가 한 링크에서 프레임을 전송하는 동안 또 다른 링크에서 프레임을 동시에 수신하는 동시 송수신(Simultaneous Transmit and Receive, STR) 동작을 수행하는 것을 방해한다. 장치 내 공존 간섭(in-device coexistence interference)을 피하기 위해 비 동시 송수신(Non-STR, NSTR) 동작 과 단일 라디오에 의한 강화된 다중 링크(enhanced multi-link with single radio, eMLSR) 동작이 제안되었다. NSTR 동작에서는 STR 동작이 금지되어 있으므로 다중 링크 상에서 프레임을 수신만 하거나 다중 링크 상에서 프 레임을 전송하는 것만이 허용할 수 있다. eMLSR 동작에서는 non-AP MLD는 복수의 링크를 청취할 수 있지만 한 번에 하나의 링크에서만 다른 MLD와 송수신하는 것이 허용된다. 따라서 NSTR 동작이나 eMLSR 동작에서는 STR 동 작이 금지되어 있기 때문에 여전히 매우 낮은 레이턴시를 기대할 수 없다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "최근의 스마트폰과 같은 전자 장치는 공간적 제약으로 인해 다중 링크를 위한 송수신기나 안테나가 근접하므로, 다중 링크에 대한 장치 내 공존간섭(in-device coexistence interference)이 발생하게 될 수 있다. 장치 내 공존 간섭은 MLD가 한 링크에서 프레임을 전송하는 동안 또 다른 링크에서 프레임을 동시에 수신하는 동시 송수신 (Simultaneous Transmit and Receive, STR) 동작을 수행하는 것을 방해할 수 있다. 장치 내 공존 간섭(in-device coexistence interference)을 피하기 위해 비 동시 송수신(Non-STR, NSTR) 동작 과 단일 라디오에 의한 강화된 다중 링크(enhanced multi-link with single radio, eMLSR) 동작이 제안되었다. NSTR 동작에서는 STR 동작이 금지되어 있으므로 다중 링크 상에서 프레임을 수신만 하거나 다중 링크 상에서 프 레임을 전송하는 것만이 허용할 수 있다. eMLSR 동작에서는 non-AP MLD는 복수의 링크를 청취할 수 있지만 한 번에 하나의 링크에서만 다른 MLD와 송수신하는 것이 허용된다. NSTR 동작이나 eMLSR 동작에서는 STR 동작이 금 지되어 있기 때문에 여전히 매우 낮은 레이턴시를 기대할 수 없다. 이에, STR MLO를 사용할 수 없는 제약을 가 지는 전자 장치에 대하여 STR MLO를 사용할 수 있도록 하는 기술이 요구될 수 있다. 실시예에 따르면, 전자 장치는 가상의 MLD를 구성하여 MLO에서 STR을 수행하는 기술을 제공할 수 있다. 다중 링 크에서 장치 내 공존 간섭을 줄이거나 제거할 수 있고, MLO에서 STR을 수행할 수 있으며, 지연에 민감한 애플리 케이션 또는 실시간 애플리케이션을 위한 차별화된 사용자 경험을 제공할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 측면은 무선 통신을 위한 전자 장치를 제공할 수 있다. 이 전자 장치는 하나 이상의 메모리 및 상 기 하나 이상의 메모리에 작동적으로(operatively) 연결된 하나 이상의 프로세서를 포함할 수 있다. 상기 하나 이상의 프로세서는, 외부 전자 장치에, 상기 외부 전자 장치와 상기 전자 장치 사이의 가상 다중 링크 동작을 위한 요청 프레임을 전송하는 동작과, 상기 요청 프레임에 대한 응답으로 상기 외부 전자 장치로부터 응답 프레 임을 수신하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이의 제1 무선 링크를 설정하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이의 가상 링크를 설정하는 동작과, 상기 제1 무선 링크 및 상기 가상 링크 를 통해 상기 외부 전자 장치와 통신하는 동작을 수행하도록 할 수 있다. 상기 가상 링크는 상기 외부 전자 장 치와 또 다른 전자 장치치 사이의 제2 무선 링크 및 상기 또 다른 전자 장치와 상기 전자 장치 사이의 통신 링 크를 포함할 수 있다. 본 개시의 또 다른 측면은 무선 통신을 위한 전자 장치를 제공할 수 있다. 이 전자 장치는 하나 이상의 메모리 및 하나 이상의 메모리에 작동적으로(operatively) 연결된하나 이상의 프로세서를 포함할 수 있다. 상기 하나 이상의 프로세서는, 또 다른 전자 장치로부터, 상기 또 다른 전자 장치와 외부 전자 장치 사이의 가상 다중 링 크 동작을 위한 요청 프레임을 수신하는 동작과, 상기 요청 프레임에 대한 응답으로 상기 또 다른 전자 장치에 응답 프레임을 전송하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이에 제1 무선 링크를 설정하는 동작 과, 상기 가상 다중 링크 동작에서 상기 제1 무선 링크를 사용하여 상기 또 다른 전자 장치를 서빙하는 동작을 수행하도록 하고, 상기 가상 다중 링크 동작은 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 가상 링 크 및 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 제2 무선 링크를 사용하고, 상기 가상 링크는 상 기 외부 전자 장치와 상기 전자 장치 사이의 상기 제1 무선 링크 및 상기 전자 장치와 상기 또 다른 전자 장치 사이의 통신 링크를 포함할 수 있다. 본 개시의 또 다른 측면은 전자 장치와 무선 통신을 위한 외부 전자 장치를 제공할 수 있다. 외부 전자 장치는 하나 이상의 메모리 및 상기 하나 이상의 메모리에 작동적으로(operatively) 연결된 하나 이상의 프로세서를 포 함할 수 있다. 상기 하나 이상의 프로세서는, 상기 전자 장치로부터, 상기 외부 전자 장치와 상기 전자 장치 사 이의 가상 다중 링크 동작을 위한 요청 프레임을 수신하는 동작과, 상기 요청 프레임에 대한 응답으로 상기 전 자 장치에 응답 프레임을 전송하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이에 제1 무선 링크를 설 정하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이에 가상 링크를 설정하는 동작과, 제1 무선 링크 및 가상 링크를 통해 상기 전자 장치와 통신하는 동작을 수행하도록 할 수 있다. 상기 가상 링크는 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 제2 무선 링크 및 상기 또 다른 전자 장치와 상기 전자 장치 사이의 통 신 링크를 포함할 수 있다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들은 MLO에서 STR을 수행하며, 다중 링크에서 장치 내 공존 간섭을 줄이거나 제거할 수 있고, 지연에 민 감한 애플리케이션 또는 실시간 애플리케이션을 위한 차별화된 사용자 경험을 제공할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에 기재된 상세한 설명은 다양한 구현에 대한 설명으로서 의도되며 본 기술이 실행될 수 있는 유일한 구현"}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "을 나타내도록 의도되지 않는다. 기술분야에서 통상의 지식을 가진 자가 인식하는 바와 같이, 설명된 구현은 본 명세서의 범위를 벗어나지 않고 다양한 상이한 방식으로 수정될 수 있다. 따라서, 도면 및 설명은 본질적으로 예시적인 것으로 간주되어야 하며 제한적인 것으로 간주되어서는 안 된다. 동일한 참조 번호는 동일한 구성요 소를 지칭한다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "다음 설명은 본 명세서의 혁신적인 측면에 대한 설명 목적의 특정 구현 예에 관한 것이다. 그러나, 본 기술분야 에서 통상의 지식을 가진 자는 여기에서의 교시가 다수의 상이한 방식으로 적용될 수 있음을 용이하게 인식할 것이다. 본 명세서에서의 예들은 IEEE(institute of electrical and electronics engineers) 802.11 무선 표준 에 따른 WLAN 통신에 기초한다. 그러나 설명된 구현은 IEEE 802.11 표준, Bluetooth 표준, GSM(global system for mobile communications), GSM/GPRS(general packet radio service), EDGE(enhanced data GSM environment), TETRA(terrestrial trunked radio), W-CDMA(광대역 CDMA), EV-DO(evolution data optimized), 1xEV-DO, EV -DO Rev A, EV-DO Rev B, HSPA(high speed packet access), HSDPA(high speed downlink packet access), HSUPA(high speed uplink packet access), HSPA+(evolved high speed packet access), long term evolution(LTE), AMPS, 또는 3G, 4G, 5G, 6G 또는 그 추가 구현 기술을 활용하는 시스템과 같은 무선, 셀룰러또는 사물 인터넷(IoT) 네트워크 내에서 통신하는 데 사용되는 기타 알려진 신호 중 하나 이상에 따라 무선 주 파수(RF) 신호를 송수신할 수 있는 장치, 시스템 또는 네트워크에서 구현될 수 있다. 도 1은 예시적인 무선 통신 네트워크의 개략도를 보여준다. 도 1을 참조하면, 예시적인 무선 통신 네트워크는 복수의 무선 통신 장치(101-104)를 포함할 수 있다. 각 무선 통신 장치(101-104)는 하나 이상의 STA를 포함할 수 있다. STA는 무선 매체(wireless medium, WM)에 대한 매체 접근 제어(medium access control, MAC) 및 물리 계층(PHY) 인터페이스의 단독 주소 지정 가능한 인스턴스 (singly addressable instance)인 논리적 엔티티일 수 있다. STA은 액세스 포인트(access point, AP) STA와 비 액세스 포인트(non-AP) STA로 분류될 수 있다. AP STA는 하나의 STA를 포함하고, 연관된 STA에 대해 무선 매체 를 통해 분배 시스템 서비스에 대한 액세스를 제공하는 엔티티일 수 있다. non-AP STA은 AP STA 내에 포함되지 않은 STA일 수 있다. 도 1에서, 무선 통신 장치는 AP STA를 포함하고, 무선 통신 장치(102-104)(예: 도 21의 전자 장치, 전자 장치, 또는 전자 장치)는 non-AP STA를 포함하는 것으로 가정한다. 일부 실시예에서, 무선 통신 장치는 AP STA 대신에 non-AP STA를 포함할 수 있다. AP STA는 중앙 집중식 컨트롤러(centralized controller), 기지국(base station, BS), 노드 B, 기지국 송수신 시스템(base transceiver system, BTS), 사이트 컨트롤러(site controller), 네트워크 어댑터 및 라우터와 같 은 무선 통신 장치를 포함하거나, 그와 같은 무선 통신 장치로 구현되거나, 그와 같은 무선 통신 장치에 포함될 수 있다. non-AP STA는 단말(terminal), 무선 송수신 유닛(wireless transmit/receive unit, WTRU), 사용자 장 비(user equipment, UE), 이동국(mobile station, MS), 모바일 단말, 모바일 가입자 유닛, 랩탑, 스마트폰, 배 터리 팩 및 비-모바일 컴퓨팅 장치와 같은 무선 통신 장치를 포함하거나, 그와 같은 무선 통신 장치로 구현되거 나, 그와 같은 무선 통신 장치에 포함될 수 있다. non-AP STA는 전자 장치일 수 있고, AP STA는 전자 장치와 통신(예: 무선 통신 및/또는 유선 통신)을 수행할 수 있는 외부 전자 장치일 수 있다. 도 2는 예시적인 무선 통신 장치의 개략도를 보여준다. 일부 실시예에서, 예시적인 무선 통신 장치(예: 도 21의 전자 장치, 전자 장치, 또는 전자 장치)는 도 1을 참조하여 설명되는 무선 통신 장치 (101 내지 104) 중 어느 하나에 대한 예시일 수 있다. 예시적인 무선 통신 장치는 프로세서(예: 도 21의 프로세서), 메모리(예: 도 21의 메모리 ), 사용자 인터페이스, 송신부(예: 도 21의 통신 모듈), 수신부(예: 도 21의 통신 모듈), 및 안테나부(예: 도 21의 안테나 모듈)을 포함할 수 있다. 송신부 및 수신부 는 송수신부(예: 도 21의 통신 모듈)로 결합될 수 있다. 프로세서는 MAC 기능, PHY 기능, RF 기능, 또는 이들 중 일부 또는 전부의 조합을 수행할 수 있다. 일부 실시예에서, 프로세서는 송신부 및 수신부의 일부 또는 전부를 포함할 수 있다. 프로세서 는 메모리 및 사용자 인터페이스에 결합(coupled)될 수 있다. 결합은 직접적이거나 간접적일 수 있다. 일부 실시예에서, 프로세서는 하나 이상의 프로세서를 포함할 수 있다. 메모리는 프로세서에 의해 실행될 때 무선 통신 장치가 본 발명에서 설명되는 동작, 방법 또는 절차를 수행하도록 하는 명령(instructions)을 저장하는 비일시적(non-transitory) 기록 매체일 수 있다. 일부 실시예에서, 메모리는 프로세서, 송신부, 수신부, 및 무선 통신 장치의 다른 구성요 소 중 하나 이상에 의해 필요한 명령을 저장할 수 있다. 메모리는 운영 체제 및 애플리케이션을 더 저장할 수 있다. 메모리는 읽기 및 쓰기 메모리(read-and-write memory), 읽기 전용 메모리, 휘발성 메모리, 비휘 발성 메모리, 또는 전술한 것 중 일부 또는 전부의 조합을 포함하거나, 이들로서 구현되거나, 이들에 포함될 수 있다. 사용자 인터페이스는 사용자로부터 정보를 수신하고, 사용자에게 정보를 출력할 수 있다. 안테나부는 하나 이상의 물리적 안테나를 포함한다. 다중 입력 다중 출력(multiple-input multiple- output, MIMO) 또는 다중 사용자 MIMO(multi-user MIMO, MU-MIMO)가 사용되는 경우, 안테나부는 하나 이 상의 물리적 안테나를 포함할 수 있다. 도 3은 예시적인 송신부의 개략적인 블록도를 보여준다. 예시적인 송신부는 인코더, 인터리버, 매핑부(mapper), 역 푸리에 변환부(inverse Fourier transformer, IFT), 보호 구간(guide interval, GI) 삽입부, 및 RF 송신부를 포함할 수 있다.인코더는 입력 데이터를 인코딩하여 인코딩된 데이터를 생성할 수 있다. 예를 들어, 인코더는 순방향 오류 정정(forward error correction, FEC) 인코더일 수 있다. FEC 인코더는 이진 컨볼루션 코드(binary convolutional code, BCC) 인코더 또는 저밀도 패러티 검사(low density parity-check, LDPC) 인코더를 포함하 거나 이들로서 구현될 수 있다. 인터리버는 인코더로부터 인코딩된 데이터의 비트를 인터리빙하여 비트의 순서를 변경하고 인터리빙 된 데이터를 출력할 수 있다. 일부 실시예에서, BCC 인코딩이 사용될 때 인터리빙이 적용될 수 있다. 매핑부는 인터리빙된 데이터를 성상도 포인트(constellation points)로 매핑하여 성상도 포인트 블록을 생 성할 수 있다. 인코더에서 LDPC 인코딩이 사용되는 경우, 매핑부는 성상도 매핑 대신에 LDPC 톤 매핑 을 더 수행할 수 있다. IFT는 역 이산 푸리에 변환(inverse discrete fourier transform, IDFT) 또는 역 고속 푸리에 변환 (inverse fast fourier transform, IFFT)을 이용하여 성상도 포인트 블록을 심볼에 해당하는 시간 영역 블록으 로 변환할 수 있다. GI 삽입부는 심볼에 GI를 추가할 수 있다. RF 송신부는 심볼을 RF 신호로 변환하여 안테나부를 통해 송신할 수 있다. 도 4는 예시적인 수신부의 개략적인 블록도를 보여준다. 예시적인 수신부는 RF 수신부, GI 제거부, 푸리에 변환부(fourier transformer, FT), 디 매핑부(demapper), 디인터리버, 및 디코더를 포함할 수 있다. RF 수신부는 안테나부를 통해 RF 신호를 수신하고, 수신한 RF 신호를 하나 이상의 심볼로 변환할 수 있다. GI 제거부는 심볼에서 GI를 제거할 수 있다. FT는 구현에 따라 이산 푸리에 변환(discrete fourier transform, DFT) 또는 고속 푸리에 변환(fast fourier transform, FFT)를 이용하여 시간 영역 블록에 해당하는 심볼을 성상도 포인트 블록으로 변환할 수 있 다. 디매핑부는 성상도 포인트 블록을 디맵핑된 데이터 비트로 디맵핑할 수 있다. LDPC 인코딩이 사용되는 경 우, 디매핑부는 성상도 디매핑 전에 LDPC 톤 디맵핑을 더 수행할 수 있다. 디인터리버는 디매핑된 데이터 비트를 디인터리빙하여 디인터리빙된 데이터 비트를 생성할 수 있다. 일부 실시예에서, BCC 인코딩이 사용될 때 디인터리빙이 적용될 수 있다. 디코더는 디인터리빙된 데이터 비트를 디코딩할 수 있다. 예를 들어, 디코더는 FEC 디코더일 수 있다. FEC 디코더는 BCC 디코더 또는 LDPC 디코더를 포함할 수 있다. 이하에서는, 도 5 내지 도 7을 참조하여 일부 실시예에 따른 무선 통신 네트워크에 대해 설명한다. 일부 실시예에서, 도 2를 참조하여 설명된 예시적인 무선 통신 장치는 도 5 내지 도 7를 참조하여 설명되는 AP MLD, 무선 통신 장치(D1), 또는 무선 통신 장치(D2)에 대한 예일 수 있다. 도 5는 제1 실시예에 따른 무선 통신 네트워크의 개략적인 블록도를 보여준다. 도 5를 참조하면, 예시적인 무선 통신 네트워크는 AP MLD, 무선 통신 장치(D1)(예: 도 21의 전자 장치 , 전자 장치, 또는 전자 장치), 및 무선 통신 장치(D2)(예: 도 21의 전자 장치, 전자 장치, 또는 전자 장치)를 포함할 수 있다. AP MLD, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 서로 유선 또는 무선 통신을 수행할 수 있다는 점을 제외하고는 별개의 장치일 수 있다. AP MLD는 다중 링크를 지원할 수 있다. 각 링크는 채널 및 대역(band)에 매핑될 수 있다. 일부 실시예에서, 하나의 링크는 2.4GHz 주파수 대역, 5GHz 주파수 대역, 6GHz 주파수 대역, 또는 60GHz 주파수 대역 중 하나에 매핑될 수 있고, 다른 링크는 다른 주파수 대역(예: 하나의 링크에 매핑된 주파수 대역이 아닌 주파 수 대역)에 매핑될 수 있다. 일부 실시예에서, 하나의 링크는 20MHz 채널 및 2.4GHz 대역에 매핑될 수 있고, 다 른 링크는 40MHz 채널 및 5GHz 대역에 매핑될 수 있다.일부 실시예들에서, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 MLD 또는 비 다중 링크 장치(non-MLD)일 수 있다. 일부 실시예에서, 무선 통신 장치 및 무선 통신 장치(D1)는 non-AP WLAN 장치일 수 있다. AP MLD는 WLAN 통신부를 포함할 수 있다. WLAN 통신부는 MAC 계층 및 MAC 서비스 접근 포 인트(Service Access Point, SAP)를 포함할 수 있다. MAC 계층은 MLD 하위 MAC 부계층 및 MLD 상위 MAC 부계층을 포함할 수 있다. MLD 하위 MAC 부계층은 액세스 포인트 1(AP1) 및 액세스 포인트 2(AP2)를 포함할 수 있다. 도 5에서는 AP1 및 AP2가 편의상 MAC 계층에 포함되는 것으로 도시하였지만, 도 3 및 도 4를 참조하여 설명한 바와 같이 PHY 기능 일부를 포함할 수 있다. 일부 실시예에서, AP MLD는 non-AP MLD일 수 있고, AP1 및 AP2는 non-AP STA일 수 있다. MLD 상위 MAC 부계층은 MLD MAC 주소를 갖고, AP1은 자신의 MAC 주소를 갖고, AP2는 자신의 MAC 주소를 갖을 수 있다. 일부 실시예에서, MLD MAC 주소는 이하에서 설명되는 다중 링크 설정 프로세스에서 사용될 수 있 다. 무선 통신 장치(D1)는 WLAN 통신부 및 통신부를 포함할 수 있다. WLAN 통신부는 무선 통신 장치(D1)와 AP MLD 사이의 WLAN 통신을 수행하며, MAC 계층 및 MAC SAP를 포함할 수 있다. MAC 계층은 MLD 하위 MAC부계층 및 MLD 상위 MAC부계층을 포함할 수 있다. MLD 하위 MAC 부계층은 STA(A1)을 포함할 수 있다. 도 5에서는 편의상 STA(A1)이 MAC 계층(51 1)에 포함되는 것으로 도시하였으나, 도 3과 도 4를 참조하여 설명한 바와 같이 PHY 기능 일부를 포함할 수 있 다. 통신부는 무선 통신 장치(D1)와 무선 통신 장치(D2) 간의 통신을 수행할 수 있다. 일부 실시예에서, 통신 유닛은 USB(universal serial bus) 인터페이스 칩셋, WLAN 칩셋, 또는 WiGig 칩셋을 포함하거나, 이들로 서 구현되거나, 이들에 포함될 수 있다. MLD 상위 MAC 부계층은 MLD MAC 주소를 갖고, STA(A1)은 자신의 MAC 주소를 갖을 수 있다. 무선 통신 장치(D2)는 WLAN 통신부 및 통신부를 포함할 수 있다. WLAN 통신부는 무선 통신 장치(D2)와 AP MLD 간의 WLAN 통신을 수행하며, MAC 계층 및 MAC SAP를 포함할 수 있다. MAC 계층은 MLD 하위 MAC 부계층 및 MLD 상위 MAC 부계층을 포함 할 수 있다. MLD 하위 MAC 부계층은 STA(B1)를 포함할 수 있다. 도 5에서는 편의상 STA(B1)이 MAC 계층 에 포함되는 것으로 도시하였으나, 도 3과 도 4를 참조하여 설명한 바와 같이 PHY 기능 일부를 포함할 수 있다. 통신부는 통신부와 통신 링크(L3)를 설정하고, 무선 통신 장치(D1)와 무선 통신 장치(D2) 간의 통신 을 수행할 수 있다. 일부 실시예에서, 통신 유닛은 USB 인터페이스 칩셋, WLAN 칩셋, 또는 WiGig 칩셋을 포함하거나, 이들로서 구현되거나, 이들에 포함될 수 있다. MLD 상위 MAC 부계층은 MLD MAC 주소를 갖고, STA(B1)은 자신의 MAC 주소를 갖을 수 있다. 일부 실시예에서, 무선 통신 장치(D1)는 스마트폰일 수 있고 무선 통신 장치(D2)는 랩탑일 수 있다. 일부 실시 예에서, 무선 통신 장치(D1)는 스마트폰 또는 랩탑과 같은 전자 장치일 수 있고, 무선 통신 장치(D2)는 무선 통 신 장치(D1)와 같은 다른 전자 장치를 충전하기 위한 배터리 팩을 더 포함하는 장치일 수 있다. 도 6은 제2 실시예에 따른 무선 통신 네트워크의 개략적인 블록도를 보여준다. 도 6을 참조하면, 무선 통신 장치(D1)는 제1 세트의 가상 다중 WLAN 링크들을 통해 가상 MLO를 수행하고, 무선 통신 장치(D2)는 WLAN 링크(L2)를 사용하여 무선 통신 장치(D1)의 가상 MLO에서 무선 통신 장치(D1)를 서빙할 수 있다. 가상 MLO를 수행하기 위해, 무선 통신 장치(D1)는 무선 통신 장치(D2)의 STA(B1)이 무선 통신 장치(D1)의 MLD 하위 MAC부계층의 스테이션인 것처럼 MLD 상위 MAC부계층이 인식할 수 있도록 하는 가상 STA(A2)를 생성할 수 있다. 도 6에서는 편의상 가상 STA(A2)가 MAC 계층에 포함되는 것으로 도시하였으나, 도 3과 도 4를 참조하여 설명한 바와 같이 PHY 기능 일부를 포함할 수 있다. 무선 통신 장치(D1)는 제1 세트의 가상 다중 WLAN 링크들을 통해 프레임을 AP MLD에 전송할 수 있고, 제1 세트의 가상 다중 WLAN 링크들을 통해 AP MLD로부터 프레임을 수신할 수 있다.제1 세트의 가상 다중 WLAN 링크들은 제1 통신 링크 및 제2 통신 링크를 포함한다. 제1 통신 링크는 무선랜 링 크(L2)와 통신 링크(L3)에 의해 가상으로 설정될 수 있다. 제2 통신 링크는 WLAN 링크(L1)일 수 있다. 무선 통신 장치(D2)가 가상 MLO에서 무선 통신 장치(D1)를 서빙할 때, 무선 통신 장치(D2)의 STA(B1)은 MAC SAP가 아닌 통신 유닛에 결합될 수 있다. 도 6에 도시된 바와 같이, 가상 MLO에서 무선 통신 장치(D1)와 무선 통신 장치(D2)는 서로 분리된 장치이며 서 로 떨어져 있으므로, 다중 링크들을 위한 송수신기 또는 안테나의 근접으로 인한 장치 내 공존 간섭을 줄일 수 있다. 따라서, 무선 통신 장치(D1)의 가상 MLO는 무선 통신 장치(D1)가 가상의 다중 WLAN 링크들을 통해 장치 내 공존 간섭 없이 STR 동작을 수행하도록 할 수 있다. 도 6의 실시예에서, 무선 통신 장치(D1)는 가상 MLO를 수행하는 역할을 하고, 무선 통신 장치(D2)는 가상 MLO에 서 무선 통신 장치(D1)를 서빙하는 역할을 한다. 다만, 도 7을 참조하여 설명되는 바와 같이 역할이 서로 바뀔 수 있다. 도 7은 제3 실시예에 따른 무선 통신 네트워크의 개략적인 블록도를 보여준다. 도 7을 참조하면, 무선 통신 장치(D1)는 가상 MLO에서 무선 통신 장치(D2)를 서빙하고, 무선 통신 장치(D2)는 제2 세트의 가상 다중 WLAN 링크들을 통해 가상 MLO를 수행할 수 있다. 무선 통신 장치(D1)가 가상 MLO에서 무선 통신 장치(D2)를 서빙할 때, 무선 통신 장치(D1)의 STA(A1)은 MAC SAP가 아니라 통신 유닛에 결합될 수 있다. 가상 MLO를 수행하기 위해, 무선 통신 장치(D2)는 STA(A1)이 무선 통신 장치(D2)를 위한 MLD 하위 MAC 부계층 의 스테이션인 것처럼 MLD 상위 MAC 부계층이 인식할 수 있도록 하는 가상 STA(B2)를 생성할 수 있다. 도 7에서는 편의상 가상 STA(B2)가 MAC 계층에 포함되는 것으로 도시되었으나, 도 3 또는 도 4를 참 조하여 설명한 바와 같이 PHY 기능 일부를 포함할 수 있다. 무선 통신 장치(D2)는 제2 세트의 가상 다중 WLAN 링크들을 통해 AP MLD에 프레임을 전송할 수 있고, 제2 세트의 가상 다중 WLAN 링크들을 통해 AP MLD(40 0)로부터 프레임을 수신할 수 있다. 제2 세트의 가상 다중 WLAN 링크들은 제3 통신 링크 및 제4 통신 링크를 포함한다. 제3 통신 링크는 무선랜 링 크(L1)와 통신 링크(L3)에 의해 가상으로 설정될 수 있다. 제4 통신 링크는 WLAN 링크(L2)일 수 있다. 도 8은 가상 다중 링크를 설정하기 위한 예시적인 메시지 흐름도를 보여준다. 동작 801 내지 동작 831은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들 어, 각 동작(801~831)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 동작 801에서, 무선 통신 장치(D1)는 가상 MLD 설정 요청 프레임을 무선 통신 장치(D2)에 전송하여 무선 통신 장치(D1)가 무선 통신 장치(D1)의 가상 스테이션으로서 STA(B1)을 사용할 수 있도록 무선 통신 장치(D2)에 요청 할 수 있다. 일부 실시예에서, MAC 계층은 가상 MLD 설정 요청 프레임을 통신 링크(L3)를 통해 MAC 계층 으로 전송할 수 있다. 일부 실시예에서, 가상 MLD 설정 요청 프레임은 MLD 상위 MAC 부계층의 MLD MAC 주소 및 STA(A1)의 MAC 주소 중 어느 하나 또는 둘 다를 포함할 수 있다. 동작 803에서, 무선 통신 장치(D2)가 무선 통신 장치(D1)가 STA(B1)을 무선 통신 장치(D1)의 가상 스테이션으로 사용하도록 허용하면, 무선 통신 장치(D2)는 가상 MLD 설정 응답 프레임을 무선 통신 장치(D1)로 전송할 수 있 다. 일부 실시예에서, 가상 MLD 설정 응답 프레임은 STA(B1)의 MAC 주소 및 무선 통신 장치(D2)의 능력 정보 (capability information) 중 하나 또는 둘 다를 포함할 수 있다. 동작 805에서, 무선 통신 장치(D1)는 무선 통신 장치(D1)와 근접 거리 내에서 WLAN을 발견하기 위해 AP MLD의 AP1에 프로브 요청 프레임을 전송할 수 있다. 일부 실시예에서, 프로브 요청 프레임은 다중 링크 엘 리먼트를 포함할 수 있다. 동작 807에서, AP1은 MLD 상위 MAC 부계층으로 프로브 요청을 보낼 수 있다. 동작 809에서, MLD 상위 MAC 부계층은 AP1으로 프로브 응답을 보낼 수 있다. 일부 실시예에서, 프로브 응 답은 다중 링크 엘리먼트를 포함할 수 있다. 동작 811에서, AP1은 프로브 응답 프레임을 무선 통신 장치(D1)로 전송할 수 있다. 동작 813에서, 무선 통신 장치(D1)가 STA(A1)이 AP1과 연관되기를 원한다고 결정하면, 무선 통신 장치(D1)는 AP MLD의 AP1으로 연관 요청 프레임을 전송할 수 있다. 일부 실시예에서, 연관 요청 프레임은 다중 링크 엘리 먼트를 포함할 수 있다. 동작 815에서, AP1은 MLD 상위 MAC 부계층으로 연관 요청을 보낼 수 있다. 동작 817에서, MLD 상위 MAC 부계층은 연관 응답을 AP1으로 전송할 수 있다. 일부 실시예에서, 연관 응답 은 다중 링크 엘리먼트를 포함할 수 있다. 동작 819에서, AP1은 연관 응답 프레임을 무선 통신 장치(D1)로 전송할 수 있다. 동작 821에서, AP2와 STA(B1)은 AP2와 STA(B1) 사이에 WLAN 링크(L2)를 설정하고, WLAN 링크(L2)는 무선 통신 장치(D1)의 가상 WLAN 링크를 위해 사용될 수 있다. 동작 823에서, AP1과 STA(A1)은 AP1과 STA(A1) 사이에 제1 세트의 가상 다중 WLAN 링크들을 설정할 수 있다. 보다 구체적으로, 동작 825에서, AP1 및 STA(A1)은 제1 세트의 가상 다중 WLAN 링크들의 일부로서 AP1과 STA(A1) 사이에 WLAN 링크(L1)을 설정할 수 있다. 동작 827에서, 제1 세트의 가상 다중 WLAN 링크들의 다른 부 분으로서, AP1 및 STA(A1)은 WLAN 링크(L2) 및 통신 링크(L3)을 사용하여 가상 WLAN 링크를 설정할 수 있다. 동작 829에서, 무선 통신 장치(D1)는 가상 MLO를 수행할 수 있고, 제1 세트의 가상 다중 WLAN 링크들을 통해 AP MLD와 통신할 수 있다. 동작 831에서, 무선 통신 장치(D2)는 WLAN 링크(L2)를 사용하여 가상 MLO에서 무선 통신 장치(D1)를 서빙할 수 있다. 이하, 도 9 내지 도 19를 참조하여 일부 실시예에 따른 가상 MLO에 대해 설명한다. 도 9는 다중 링크 엘리먼트의 예시적인 포맷을 보여준다. 도 9를 참조하면, 다중 링크 엘리먼트는 엘리먼트 ID(element ID) 필드, 길이(length) 필드, 엘리먼트 ID 확장(element ID extension) 필드, 다중 링크 제어(multi-link control) 필드, 공통 정 보(common info) 필드 및 링크 정보(link info) 필드를 포함할 수 있다. 공통 정보 필드는 모든 링크에 공통적인 정보를 제공할 수 있다. 공통 정보 필드는 MLD MAC 주소(MLD MAC address) 필드, 링크 ID 정보(link ID info) 필드, BSS 파라미터 변경 카운트(BSS parameters change count) 필드, 매체 동기화 지연 정보(medium synchronization delay information) 필드, EML(enhanced multi-link) 기능(EML capabilities) 필드 및 MLD 능력(MLD capabilities) 필드를 포 함할 수 있다. 링크 정보 필드는 링크에 지정 정보를 제공할 수 있다. 링크 정보 필드는 복수의 STA별 프로파일 (per-STA profile) 필드를 포함할 수 있다. 각 STA별 프로파일 필드는 부엘리먼트 ID(subelement ID) 필드, 길이(length) 필드, STA 제어(STA control) 필드, STA 정보(STA info) 필드, 및 STA 프로파일(STA profile) 필드를 포함할 수 있다. 일부 실시예에서, 도 8에 설명된 프로브 요청 프레임 또는 연관 요청 프레임에서, 다중 링크 엘리먼트의 MLD MAC 주소 필드는 MLD 상위 MAC 부계층의 MLD MAC 주소로 설정될 수 있다. 일부 실시예에서, 도 8에 설명된 프로브 응답 프레임 또는 연관 응답 프레임에서, 다중 링크 엘리먼트의 MLD MAC 주소 필드 는 MLD 상위 MAC 부계층의 MLD MAC 주소로 설정될 수 있다. 일부 실시예에서, 도 8에서 설명된 프로브 요청 프레임, 프로브 응답 프레임, 연관 요청 프레임, 또는 연관 응 답 프레임의 다중 링크 엘리먼트는 2개의 STA 별 프로파일 필드를 포함할 수 있다. 제1 STA 별 프로 파일 필드는 WLAN 링크(L1)에 대응할 수 있고, 제2 STA 별 프로파일 필드는 WLAN 링크(L2)에 대응할 수 있다. WLAN 링크(L1)에 대응하는 제1 STA 별 프로파일 필드 내의 STA 정보 필드는 STA(A1)의 MAC 주소를 포함할 수 있고, WLAN 링크(L1)에 대응하는 제1 STA 별 프로파일 필드 내의 STA 프로파일 필드는 STA(A1)의 능력 정보를 포함할 수 있다. 마찬가지로, WLAN 링크(L2)에 대응하는 제2 STA별 프로파일 필드 내의 STA 정보 필드 는 STA(B1)의 MAC 주소를 포함할 수 있고, WLAN 링크(L2)에 대응하는 제2 STA별 프로파일 필드 내의 STA 프로파일 필드는 STA(B1)의 능력 정보를 포함할 수 있다. 일부 실시예에서, 능력 정보는 LDPC 코딩된 PPDU의 수신이 지원되는지 여부를 나타내는 LDPC 코딩 능력 필드, 지원되는 채널 폭들을 나타내는 지원 채널 폭 세트 필드(supported channel width set field), STBC를 사용한 PPDU의 전송이 지원되는지 여부를 나타내는 Tx STBC 필드, STBC를 사용한 PPDU의 수신이 지원되는지 여부를 나 타내는 Rx STBC, 및 어떠한 변조 및 코딩 스킴(modulation and coding scheme, MCS)이 지원되는지를 나타내는 지원 MCS 세트 필드(supported MCS set field)의 일부 또는 전부를 포함할 수 있다. 도 10은 가상 다중 링크를 사용하는 다운링크 전송을 위한 예시적인 메시지 흐름도를 보여준다. 도 10은 무선 통신 장치(D1)가 가상 MLO의 AP MLD로부터 다운링크 프레임을 수신하고 무선 통신 장치(D2)가 가상 MLO를 위하여 무선 통신 장치(D1)를 서빙하는 예시적인 메시지 흐름도를 보여주는 것일 수 있다. 동작 1001 내지 동작 1019은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작 (1001~1019)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 동작 1001에서, MLD 상위 MAC 부계층은 무선 통신 장치(D1)로 전송될 데이터 유닛을 상위 계층(미도시)으 로부터 수신할 수 있다. 동작 1003에서, MLD 상위 MAC 부계층은 어떤 WLAN 링크가 데이터 유닛을 전송하는데 사용될 지를 결정할 수 있다. 일부 실시예에서, MLD 상위 MAC 부계층은 WLAN 링크(L1)과 WLAN 링크(L2) 중에서 백오프 카운터 가 먼저 0에 도달하는 WLAN 링크를 사용하기로 결정할 수 있다. 일부 실시예에서, MLD 상위 MAC 부계층은 일부 데이터 유닛을 전송하기 위해 WLAN 링크(L1)을 사용하기로 결정할 수 있고, 다른 데이터 유닛을 전송하기 위해 WLAN 링크(L2)를 사용하기로 결정할 수 있다. 동작 1005에서, MLD 상위 MAC 부계층이 적어도 하나의 데이터 유닛을 전송하기 위해 WLAN 링크(L1)을 사용 하기로 결정할 때, MLD 상위 MAC 부계층은 데이터 유닛을 AP1에 전송할 수 있다. 동작 1007에서, AP1은 STA(A1)의 능력 정보에 기초하여 데이터 유닛을 포함하는 데이터 프레임을 WLAN 링크(L 1)를 통해 무선 통신 장치(D1)의 STA(A1)에 전송할 수 있다. 동작 1009에서, 무선 통신 장치(D1)의 STA(A1)이 데이터 프레임을 성공적으로 수신한 경우, STA(A1)은 WLAN 링 크(L1)을 통해 승인(Ack) 프레임을 AP1에 전송할 수 있다. 동작 1011에서, MLD 상위 MAC 부계층이 적어도 하나의 데이터 유닛을 전송하기 위해 WLAN 링크(L2)를 사용 하기로 결정할 때, MLD 상위 MAC 부계층은 데이터 유닛을 AP2로 전송할 수 있다. 동작 1013에서, AP2는 STA(B1)의 능력 정보에 기초하여 데이터 유닛을 포함하는 데이터 프레임을 WLAN 링크(L 2)를 통해 무선 통신 장치(D2)의 STA(B1)에 전송할 수 있다. 동작 1015에서, 무선 통신 장치(D2)의 STA(B1)이 데이터 프레임을 성공적으로 수신한 경우, STA(B1)은 WLAN 링 크(L2)를 통해 AP2로 Ack 프레임을 전송할 수 있다. 동작 1017에서, STA(B1)은 수신된 데이터 유닛을 통신 링크(L3)을 통해 무선 통신 장치(D1)에 전송할 수 있다. 데이터 유닛이 무선 통신 장치(D2)로 어드레스되지 않고 무선 통신 장치(D1)로 어드레스되기 때문이다. 동작 1019에서, 무선 통신 장치(D1)가 통신 링크(L3)을 통해 STA(B1)로부터 데이터 유닛을 성공적으로 수신한 경우, 무선 통신 장치(D1)는 Ack 프레임을 통신 링크(L3)을 통해 STA(B1)에 전송할 수 있다. 도 11은 가상 다중 링크를 사용하는 업링크 전송을 위한 예시적인 메시지 흐름도를 보여준다. 도 11은 무선 통 신 장치(D1)가 가상 MLO에서 AP MLD에 업링크 프레임을 전송하고 무선 통신 장치(D2)가 가상 MLO에서 무선 통신 장치(D1)를 서빙하는 예시적인 메시지 흐름도를 도시한 것일 수 있다. 동작 1101 내지 동작 1119은 순차적 으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1101~1119)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 동작 1101에서, 무선 통신 장치(D1)의 MLD 상위 MAC 부계층은 AP MLD로 전송될 데이터 유닛들을 상위 계층(미도시)으로부터 수신할 수 있다. 동작 1103에서, MLD 상위 MAC 부계층은 데이터 유닛을 전송하기 위해 어떤 WLAN 링크가 사용될 지 결정할 수 있다. 일부 실시예에서, MLD 상위 MAC 부계층은 WLAN 링크(L1) 및 WLAN 링크(L2) 중에서 백오프 카운터 가 0에 먼저 도달하는 WLAN 링크를 사용하기로 결정할 수 있다. 일부 실시예에서, MLD 상위 MAC 부계층은 일부 데이터 유닛을 전송하기 위해 WLAN 링크(L1)을 사용하기로 결정할 수 있고, 다른 데이터 유닛을 전송하기 위해 WLAN 링크(L2)를 사용하기로 결정할 수 있다.동작 1105에서, MLD 상위 MAC 부계층이 적어도 하나의 데이터 유닛을 전송하기 위해 WLAN 링크(L1)을 사용 하기로 결정할 때, MLD 상위 MAC 부계층은 데이터 유닛을 STA(A1)으로 전송할 수 있다. 동작 1107에서, STA(A1)은 데이터 유닛을 포함하는 데이터 프레임을 WLAN 링크(L1)를 통해 AP MLD의 AP1 에 전송할 수 있다. 동작 1109에서, AP MLD의 AP1이 데이터 프레임을 성공적으로 수신한 경우, AP1은 WLAN 링크(L1)을 통해 Ack 프레임을 STA(A1)으로 전송할 수 있다. 동작 1111에서, AP1은 수신된 데이터 유닛을 MLD 상위 MAC 부계층으로 전송할 수 있다. 동작 1113에서, MLD 상위 MAC 부계층이 적어도 하나의 데이터 유닛을 전송하기 위해 WLAN 링크(L2)를 사용 하기로 결정할 때, MLD 상위 MAC 부계층은 데이터 유닛을 통신 링크(L3)를 통해 무선 통신 장치(D2)의 STA(B1)에 전송할 수 있다. 동작 1115에서, STA(B1)은 데이터 유닛을 포함하는 데이터 프레임을 WLAN 링크(L2)를 통해 AP MLD의 AP2 로 전송할 수 있다. 동작 1117에서, AP MLD의 AP2가 데이터 프레임을 성공적으로 수신한 경우, AP2는 WLAN 링크(L2)를 통해 Ack 프레임을 STA(B1)으로 전송할 수 있다. 동작 1119에서, AP2는 수신된 데이터 유닛을 MLD 상위 MAC 부계층으로 전송할 수 있다. 도 12는 제1 실시예에 따른 다운링크 데이터 전송을 보여준다. 도 12를 참조하면, AP MLD는 무선 통신 장치(D1)로 전송될 데이터 유닛(DU1) 및 데이터 유닛(DU2)을 포함 하는 복수의 데이터 유닛을 수용하는 버퍼를 가지며, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 WLAN 링크 (L1) 및 WLAN 링크(L2)를 이용하여 가상 STA MLD를 형성할 수 있다. 동작 1201 내지 동작 1213은 순차적으로 수 행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1201~1213)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. AP MLD는 어떤 백오프 카운터(예: WLAN 링크에 대한 백오프 카운터)가 0에 먼저 도달하는지 결정할 수 있 다. 동작 1201에서 WLAN 링크(L2)에 대한 백오프 카운터가 먼저 0에 도달하면, 동작 1203에서 AP2는 데이터 유 닛(DU1)을 포함하는 데이터 프레임을 WLAN 링크(L2)를 통해 무선 통신 장치(D2)로 전송하기 시작할 수 있다. AP MLD는 AP2가 데이터 유닛(DU1)을 전송하는 동안 WLAN 링크(L1)에 대한 백오프 카운터가 0에 도달하는지 확인할 수 있다. 동작 1205에서 AP2가 데이터 유닛(DU1)을 전송하는 동안 WLAN 링크(L1)에 대한 백오프 카운터 가 0에 도달하면, 동작 1207에서 AP1은 데이터 유닛(DU2)를 포함하는 데이터 프레임을 WLAN 링크(L1)을 통해 무 선 통신 장치(D1)에 전송하기 시작할 수 있다. AP2가 데이터 유닛(DU1)을 전송하는 동작은 AP1이 데이터 유닛(DU2)을 전송하는 동안 완료될 수 있다. 동작 1209에서, 무선 통신 장치(D2)가 데이터 유닛(DU1)을 성공적으로 수신할 때, 무선 통신 장치(D2)는 데이터 유닛 (DU2)의 수신 동안 WLAN 링크(L2)를 통해 데이터 유닛(DU1)에 대한 Ack 프레임을 AP2에 전송하기 시작할 수 있 다. 동작 1209 동안에, AP MLD 및 무선 통신 장치(D1)는 하향링크 데이터 프레임 및 상향링크 Ack 프레임 에 대해 STR 동작을 수행할 수 있다. 동작 1211에서, 무선 통신 장치(D2)가 무선 통신 장치(D1)에 대한 데이터 유닛(DU1)을 수신하기 때문에, 무선 통신 장치(D2)는 데이터 유닛(DU1)을 통신 링크(L3)를 통해 무선 통신 장치(D1)에 전송할 수 있다. 동작 1213에서, 무선 통신 장치(D1)가 데이터 유닛(DU2)을 성공적으로 수신한 후, 무선 통신 장치(D1)는 데이터 유닛(DU2)에 대한 Ack 프레임을 전송할 수 있다. 도 12의 실시예에서, 무선 통신 장치(D1)는 먼저 WLAN 링크(L2)를 통해 데이터 유닛(DU1)의 수신을 완료한 다음 WLAN 링크(L1)를 통해 데이터 유닛(DU2)의 수신을 완료할 수 있다. 도 13은 제2 실시예에 따른 다운링크 데이터 전송을 보여준다. 도 13을 참조하면, AP MLD는 무선 통신 장치(D1)로 전송될 데이터 유닛(DU1) 및 데이터 유닛(DU2)을 포함 하는 복수의 데이터 유닛을 수용하는 버퍼를 가지며, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 WLAN 링크 (L1) 및 WLAN 링크(L2)를 이용하여 가상 STA MLD를 형성할 수 있다. 동작 1301 내지 동작 1313은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1301~1313)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. AP MLD는 어떤 백오프 카운터(예: WLAN 링크에 대한 백오프 카운터)가 0에 먼저 도달하는지 결정할 수 있 다. 동작 1301에서 WLAN 링크(L1)에 대한 백오프 카운터가 먼저 0에 도달하면, 동작 1303에서 AP1은 데이터 유 닛(DU1)을 포함하는 데이터 프레임을 WLAN 링크(L1)을 통해 무선 통신 장치(D1)로 전송하기 시작할 수 있다. AP MLD는 AP1이 데이터 유닛(DU1)을 전송하는 동안 WLAN 링크(L2)에 대한 백오프 카운터가 0에 도달하는지 확인할 수 있다. 동작 1305에서 AP1이 데이터 유닛(DU1)을 전송하는 동안 WLAN 링크(L2)에 대한 백오프 카운터 가 0에 도달하면(S1305), 동작 1307에서 AP2는 데이터 유닛(DU2)를 포함하는 데이터 프레임을 WLAN 링크(L2)를 통해 무선 통신 장치(D2)로 전송하기 시작할 수 있다. AP1가 데이터 유닛(DU1)을 전송하는 동작은 AP2가 데이터 유닛(DU2)을 전송하는 동안 완료될 수 있다. 동작 1309에서, 무선 통신 장치(D1)가 데이터 유닛(DU1)을 성공적으로 수신하면, 무선 통신 장치(D1)는 무선 통신 장 치(D2)가 데이터 유닛(DU2)을 수신하는 동안 WLAN 링크(L1)을 통해 AP1에 데이터 유닛(DU1)에 대한 Ack 프레임 을 전송하기 시작할 수 있다. 동작 1309 동안, AP MLD 및 무선 통신 장치(D1)는 하향링크 데이터 프레임 및 상향링크 Ack 프레임에 대해 STR 동작을 수행할 수 있다. 동작 1311에서, 무선 통신 장치(D2)가 WLAN 링크(L2)를 통해 데이터 유닛(DU2)을 성공적으로 수신한 후, 무선 통신 장치(D2)는 데이터 유닛(DU2)에 대한 Ack 프레임을 AP2로 전송할 수 있다. 동작 1313에서, 무선 통신 장치(D2)가 무선 통신 장치(D1)에 대한 데이터 유닛(DU2)을 수신하기 때문에, 무선 통신 장치(D2)는 데이터 유닛(DU2)을 통신 링크(L3)를 통해 무선 통신 장치(D1)에 전송할 수 있다. 도 13의 실시예에서, 무선 통신 장치(D1)는 먼저 WLAN 링크(L1)을 통해 데이터 유닛(DU1)의 수신을 완료한 다음 WLAN 링크(L2)를 통해 데이터 유닛(DU2)의 수신을 완료할 수 있다. 도 14는 제1 실시예에 따른 업링크 데이터 송신을 보여준다. 도 14를 참조하면, 무선 통신 장치(D1)는 AP MLD로 전송될 데이터 유닛(DU1) 및 데이터 유닛(DU2)을 포함 하는 복수의 데이터 유닛을 수용하는 버퍼를 가지며, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 WLAN 링크 (L1) 및 WLAN 링크(L2)를 사용하여 가상 STA MLD를 형성할 수 있다. 동작 1401 내지 동작 1413은 순차적으로 수 행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1401~1413)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 무선 통신 장치(D1)는 어떤 백오프 카운터(예: WLAN 링크에 대한 백오프 카운터)가 0에 먼저 도달하는지 결정할 수 있다. 동작 1401에서 WLAN 링크(L2)에 대한 백오프 카운터가 먼저 0에 도달하면, 동작 1402에서 무선 통신 장치(D1)는 통신 링크(L3)을 통해 데이터 유닛(DU1)을 무선 통신 장치(D2)로 전송할 수 있다. 동작 1403에서, 무선 통신 장치(D2)는 데이터 유닛(DU1)을 포함하는 데이터 프레임을 WLAN 링크(L2)를 통해 AP2 로 전송하기 시작할 수 있다. 무선 통신 장치(D2)가 데이터 유닛(DU1)을 전송하는 동안 무선 통신 장치(D1)는 WLAN 링크(L1)에 대한 백오프 카운터가 0에 도달하는지 여부를 확인할 수 있다. 동작 1405에서 무선 통신 장치(D2)가 데이터 유닛(DU1)을 전 송하는 동안 WLAN 링크(L1)에 대한 백오프 카운터가 0에 도달하면, 동작 1407에서 무선 통신 장치(D1)는 데이터 유닛(DU2)를 포함하는 데이터 프레임을 WLAN 링크(L1)를 통해 AP1에 전송하기 시작할 수 있다. 무선 통신 장치(D2)가 데이터 유닛(DU1)을 전송하는 동작은 무선 통신 장치(D1)가 데이터 유닛(DU2)을 전송하는 동안 완료될 수 있다. 동작 1409에서, AP2가 데이터 유닛(DU1)을 성공적으로 수신할 때, AP2는 AP1이 데이터 유 닛(DU2)을 수신하는 동안에 WLAN 링크(L2)를 통해 데이터 유닛(DU1)에 대한 Ack 프레임을 무선 통신 장치(D2)에 전송하기 시작할 수 있다. 동작 1409 동안, AP MLD 및 무선 통신 장치(D1)는 하향링크 Ack 프레임 및 상향 링크 데이터 프레임에 대해 STR 동작을 수행할 수 있다. 동작 1413에서, AP1이 데이터 유닛(DU2)를 성공적으로 수신한 후, AP1은 데이터 유닛(DU2)에 대한 Ack 프레임을 무선 통신 장치(D1)으로 전송할 수 있다. 도 14의 실시예에서, AP MLD는 먼저 WLAN 링크(L2)를 통해 데이터 유닛(DU1)의 수신을 완료하고, 그 다음 WLAN 링크(L1)을 통해 데이터 유닛(DU2)의 수신을 완료할 수 있다.도 15는 제2 실시예에 따른 업링크 데이터 전송을 보여준다. 도 15를 참조하면, 무선 통신 장치(D1)는 AP MLD로 전송될 데이터 유닛(DU1) 및 데이터 유닛(DU2)을 포함 하는 복수의 데이터 유닛을 수용하는 버퍼를 가지며, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 WLAN 링크 (L1) 및 WLAN 링크(L2)를 사용하여 가상 STA MLD를 형성할 수 있다. 동작 1501 내지 동작 1513은 순차적으로 수 행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1501~1513)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 무선 통신 장치(D1)는 어떤 백오프 카운터(예: WLAN 링크에 대한 백오프 카운터)가 0에 먼저 도달하는지 결정할 수 있다. 동작 1501에서 WLAN 링크(L1)에 대한 백오프 카운터가 먼저 0에 도달하면, 동작 1503에서 무선 통신 장치(D1)는 데이터 유닛(DU1)을 포함하는 데이터 프레임을 WLAN 링크(L1)을 통해 AP1으로 전송하기 시작할 수 있다. 무선 통신 장치(D1)가 데이터 유닛(DU1)을 전송하는 동안 무선 통신 장치(D1)는 WLAN 링크(L2)에 대한 백오프 카운터가 0에 도달하는지 여부를 확인할 수 있다. 동작 1505에서 무선 통신 장치(D1)가 데이터 유닛(DU1)을 전 송하는 동안 WLAN 링크(L2)에 대한 백오프 카운터가 0에 도달하면, 동작 1506에서 무선 통신 장치(D1)는 데이터 유닛(DU2)를 통신 링크(L3)을 통해 무선 통신 장치(D2)로 전송하고, 동작 1507에서 무선 통신 장치(D2)는 데이 터 유닛(DU2)을 포함하는 데이터 프레임을 WLAN 링크(L2)를 통해 AP2로 전송하기 시작할 수 있다. 무선 통신 장치(D1)가 데이터 유닛(DU1)을 전송하는 것은 무선 통신 장치(D2)가 데이터 유닛(DU2)을 전송하는 동안 완료될 수 있다. 동작 1509에서, AP1이 데이터 유닛(DU1)을 성공적으로 수신한 경우, AP1은 AP2의 데이터 유닛(DU2)의 수신 중에 WLAN 링크(L1)을 통해 데이터 유닛(DU1)에 대한 Ack 프레임을 무선 통신 장치(D1)에 전 송하기 시작할 수 있다. 동작 1509 동안, AP MLD와 무선 통신 장치(D1)는 하향링크 Ack 프레임 및 상향링 크 데이터 프레임에 대한 STR 동작을 수행할 수 있다. 동작 1513에서, AP2는 데이터 유닛(DU2)을 성공적으로 수신한 후 데이터 유닛(DU2)에 대한 Ack 프레임을 전송할 수 있다. 도 15의 실시예에서, AP MLD는 먼저 WLAN 링크(L1)을 통해 데이터 유닛(DU1)의 수신을 완료하고, 그 다음 WLAN 링크(L2)를 통해 데이터 유닛(DU2)의 수신을 완료할 수 있다. 도 16은 제1 실시예에 따른 STR 동작에서의 데이터 전송을 보여준다. 도 16을 참조하면, AP MLD는 무선 통신 장치(D1)로 전송될 데이터 유닛(DU2)을 포함하는 복수의 데이터 유 닛을 수용하는 버퍼를 갖고, 무선 통신 장치(D1)는 AP MLD로 전송될 데이터 유닛(DU1)을 포함하는 복수의 데이터 유닛을 수용하는 버퍼를 갖을 수 있다. 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 WLAN 링크(L1) 및 WLAN 링크(L2)를 사용하여 가상 STA MLD를 형성할 수 있다. 동작 1601 내지 동작 1613은 순차적으로 수행될 수 도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1601~1613)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 무선 통신 장치(D1)는 어떤 백오프 카운터(예: WLAN 링크에 대한 백오프 카운터)가 0에 먼저 도달하는지 결정할 수 있다. 동작 1601에서 WLAN 링크(L2)에 대한 백오프 카운터가 먼저 0에 도달하면, 동작 1602에서 무선 통신 장치(D1)는 통신 링크(L3)을 통해 데이터 유닛(DU1)을 무선 통신 장치(D2)로 전송할 수 있다. 동작 1603에서, 무선 통신 장치(D2)는 데이터 유닛(DU1)을 포함하는 데이터 프레임을 WLAN 링크(L2)를 통해 AP2 로 전송하기 시작할 수 있다. AP2가 데이터 유닛(DU1)을 수신하는 동안 AP MLD는 WLAN 링크(L1)에 대한 백오프 카운터가 0에 도달하는지 확인할 수 있다. 동작 1605에서 AP2가 데이터 유닛(DU1)을 수신하는 동안 WLAN 링크(L1)에 대한 백오프 카운터 가 0에 도달하면, 동작 1607에서 AP1은 데이터 유닛(DU2)을 포함하는 데이터 프레임을 WLAN 링크(L1)를 통해 무 선 통신 장치(D1)에 전송하기 시작할 수 있다. 동작 1607 동안, AP MLD 및 무선 통신 장치(D1)는 하향링크 데이터 프레임 및 상향링크 데이터 프레임에 대해 STR 동작을 수행할 수 있다. 동작 1609에서, AP1이 데이터 유닛(DU2)을 전송하는 동안 AP2는 WLAN 링크(L2)를 통해 무선 통신 장치(D2)에 데 이터 유닛(DU1)에 대한 Ack 프레임을 전송하기 시작할 수 있다. 동작 1613에서, 무선 통신 장치(D1)가 데이터 유닛(DU2)을 성공적으로 수신한 후, 무선 통신 장치(D1)는 데이터 유닛(DU2)에 대한 Ack 프레임을 AP1에 전송할 수 있다.도 16의 실시예에서, AP MLD는 먼저 WLAN 링크(L2)를 통해 데이터 유닛(DU1)의 수신을 완료할 수 있고, 그 다음 무선 통신 장치(D1)는 WLAN 링크(L1)을 통해 데이터 유닛(DU2)의 수신을 완료할 수 있다. 도 17은 제2 실시예에 따른 STR 동작에서의 데이터 전송을 보여준다. 도 17을 참조하면, AP MLD는 무선 통신 장치(D1)로 전송될 데이터 유닛(DU1)을 포함하는 복수의 데이터 유 닛을 수용하는 버퍼를 갖고, 무선 통신 장치(D1)는 AP MLD로 전송될 데이터 유닛(DU2)을 포함하는 복수의 데이터 유닛을 수용하는 버퍼를 갖을 수 있다. 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 WLAN 링크(L1) 및 WLAN 링크(L2)를 사용하여 가상 STA MLD를 형성할 수 있다. 동작 1701 내지 동작 1713은 순차적으로 수행될 수 도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1701~1713)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. AP MLD는 어떤 백오프 카운터(예: WLAN 링크에 대한 백오프 카운터)가 0에 먼저 도달하는지 결정할 수 있 다. 동작 1701에서 WLAN 링크(L1)에 대한 백오프 카운터가 먼저 0에 도달하면, 동작 1703에서 AP1은 데이터 유 닛(DU1)을 포함하는 데이터 프레임을 WLAN 링크(L1)을 통해 무선 통신 장치(D1)로 전송하기 시작할 수 있다. 무선 통신 장치(D1)는 데이터 유닛(DU1)을 수신하는 동안 WLAN 링크(L2)에 대한 백오프 카운터가 0에 도달하는 지 여부를 확인할 수 있다. 동작 1705에서 무선 통신 장치(D1)가 데이터 유닛(DU1)을 수신하는 동안 WLAN 링크 (L2)에 대한 백오프 카운터가 0에 도달하면, 동작 1706에서 무선 통신 장치(D1)는 데이터 유닛(DU2)을 통신 링 크(L3)을 통해 무선 통신 장치(D2)로 전송할 수 있다. 동작 1707에서, 무선 통신 장치(D1)가 데이터 유닛(DU1) 을 수신하는 동안 무선 통신 장치(D2)는 WLAN 링크(L2)를 통해 데이터 유닛(DU2)을 포함하는 데이터 프레임을 AP2로 전송하기 시작할 수 있다. 동작 1707 동안, AP MLD 및 무선 통신 장치(D1)는 하향링크 데이터 프레 임 및 상향링크 데이터 프레임에 대해 STR 동작을 수행할 수 있다. 동작 1709에서, 무선 통신 장치(D1)는 데이터 유닛(DU1)을 성공적으로 수신한 후, 무선 통신 장치(D2)가 데이터 유닛(DU2)을 전송하는 동안 WLAN 링크(L1)를 통해 데이터 유닛(DU1)에 대한 Ack 프레임을 AP1에 전송할 수 있다. 동작 1713에서, AP2는 데이터 유닛(DU2)에 대한 Ack 프레임을 WLAN 링크(L2)를 통해 무선 통신 장치(D2)로 전송 하기 시작할 수 있다. 도 17의 실시예에서, 무선 통신 장치(D1)는 먼저 WLAN 링크(L1)를 통해 데이터 유닛(DU1)의 수신을 완료할 수 있고, 그 다음 AP MLD는 WLAN 링크(L2)를 통해 데이터 유닛(DU2)의 수신을 완료할 수 있다. 도 18은 제3 실시예에 따른 STR 동작에서의 데이터 전송을 보여준다. 도 18을 참조하면, AP MLD는 무선 통신 장치(D1)로 전송될 데이터 유닛(DU1)을 포함하는 복수의 데이터 유 닛을 수용하는 버퍼를 갖고, 무선 통신 장치(D1)는 AP MLD로 전송될 데이터 유닛(DU2)을 포함하는 복수의 데이터 유닛을 수용하는 버퍼를 갖을 수 있다. 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 WLAN 링크(L1) 및 WLAN 링크(L2)를 사용하여 가상 STA MLD를 형성할 수 있다. 동작 1801 내지 동작 1813은 순차적으로 수행될 수 도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1801~1813)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. AP MLD는 어떤 백오프 카운터(예: WLAN 링크에 대한 백오프 카운터)가 0에 먼저 도달하는지 결정할 수 있 다. 동작 1801에서 WLAN 링크(L2)에 대한 백오프 카운터가 먼저 0에 도달하면, 동작 1803에서 AP2는 데이터 유 닛(DU1)을 포함하는 데이터 프레임을 WLAN 링크(L2)를 통해 무선 통신 장치(D2)로 전송하기 시작할 수 있다. AP2가 데이터 유닛(DU1)을 전송하는 동안 무선 통신 장치(D1)는 WLAN 링크(L1)에 대한 백오프 카운터가 0에 도 달하는지 확인할 수 있다. 동작 1805에서 AP2가 데이터 유닛(DU1)을 전송하는 동안 WLAN 링크(L1)에 대한 백오 프 카운터가 0에 도달하면, 동작 1807에서 무선 통신 장치(D1)는 데이터 유닛(DU2)을 포함하는 데이터 프레임을 WLAN 링크(L1)를 통해 AP1에 전송하기 시작할 수 있다. 동작 1807 동안, AP MLD 및 무선 통신 장치(D1)는 하향링크 데이터 프레임 및 상향링크 데이터 프레임에 대해 STR 동작을 수행할 수 있다. 동작 1809에서, AP1이 데이터 유닛(DU2)을 수신하는 동안 무선 통신 장치(D2)는 WLAN 링크(L2)를 통해 데이터 유닛(DU1)에 대한 Ack 프레임을 AP2로 전송하기 시작할 수 있다(S1809). 동작 1811에서, 무선 통신 장치(D2)는 데이터 유닛(DU1)을 통신 링크(L3)를 통해 무선 통신 장치(D1)에 전송할 수 있다.동작 1813에서, AP1이 데이터 유닛(DU2)을 성공적으로 수신한 후 AP1은 데이터 유닛(DU2)에 대한 Ack 프레임을 무선 통신 장치(D1)에 전송할 수 있다. 도 18의 실시예에서, 무선 통신 장치(D1)는 먼저 WLAN 링크(L2)를 통해 데이터 유닛(DU1)의 수신을 완료할 수 있고, 그 다음 AP MLD는 WLAN 링크(L1)을 통해 데이터 유닛(DU2)의 수신을 완료할 수 있다. 도 19는 제4 실시예에 따른 STR 동작에서의 데이터 전송을 보여준다. 도 19를 참조하면, AP MLD는 무선 통신 장치(D1)로 전송될 데이터 유닛(DU2)을 포함하는 복수의 데이터 유 닛을 수용하는 버퍼를 갖고, 무선 통신 장치(D1)는 AP MLD로 전송될 데이터 유닛(DU1)을 포함하는 복수의 데이터 유닛을 수용하는 버퍼를 갖을 수 있다. 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 WLAN 링크(L1) 및 WLAN 링크(L2)를 사용하여 가상 STA MLD를 형성할 수 있다. 동작 1901 내지 동작 1915은 순차적으로 수행될 수 도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1901~1915)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 무선 통신 장치(D1)는 어떤 백오프 카운터(예: WLAN 링크에 대한 백오프 카운터)가 0에 먼저 도달하는지 결정할 수 있다. 동작 1901에서 WLAN 링크(L1)에 대한 백오프 카운터가 먼저 0에 도달하면, 동작 1903에서 무선 통신 장치(D1)는 데이터 유닛(DU1)을 포함하는 데이터 프레임을 WLAN 링크(L1)을 통해 AP1으로 전송하기 시작할 수 있다. AP1이 데이터 유닛(DU1)을 수신하는 동안 AP MLD는 WLAN 링크(L1)에 대한 백오프 카운터가 0에 도달하는지 확인할 수 있다. 동작 1905에서 AP1이 데이터 유닛(DU1)을 수신하는 동안 WLAN 링크(L1)에 대한 백오프 카운터 가 0에 도달하면, 동작 1907에서 AP2는 데이터 유닛(DU2)을 포함하는 데이터 프레임을 WLAN 링크(L2)를 통해 무 선 통신 장치(D2)로 전송하기 시작할 수 있다. 동작 1907 동안, AP MLD 및 무선 통신 장치(D1)는 하향링 크 데이터 프레임 및 상향링크 데이터 프레임에 대해 STR 동작을 수행할 수 있다. 동작 1909에서, AP2가 데이터 유닛(DU2)을 전송하는 동안 AP1은 데이터 유닛(DU1)에 대한 Ack 프레임을 WLAN 링 크(L1)을 통해 무선 통신 장치(D1)에 전송하기 시작할 수 있다. 동작 1913에서, 무선 통신 장치(D2)가 데이터 유닛(DU2)을 성공적으로 수신한 후 무선 통신 장치(D2)는 WLAN 링 크(L2)를 통해 데이터 유닛(DU2)에 대한 Ack 프레임을 AP2에 전송한다. 동작 1915에서, 무선 통신 장치(D2)는 데이터 유닛(DU2)을 통신 링크(L3)를 통해 무선 통신 장치(D1)에 전송할 수 있다. 도 19의 실시예에서, AP MLD는 먼저 WLAN 링크(L1)을 통해 데이터 유닛(DU1)의 수신을 완료할 수 있고, 무 선 통신 장치(D1)는 WLAN 링크(L2)를 통해 데이터 유닛(DU2)의 수신을 완료할 수 있다. 도 20은 MLO의 역할 변경을 보여주는 예시적인 흐름도를 보여준다. 도 20은 도 8을 참조하여 설명된 동작 이후의 절차를 도시한다. 동작 829 내지 동작 851은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(829~851)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 도 8을 참조하여 전술한 바와 같이, 동작 829에서 무선 통신 장치(D1)는 가상 MLO를 수행하고, 동작 831에서 무선 통신 장치(D2)는 가상 MLO에서 무선 통신 장치 (D1)를 서빙할 수 있다. 동작 833에서, 무선 통신 장치(D1)와 무선 통신 장치(D2)는 역할을 전환하기로 결정할 수 있다. 즉, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 무선 통신 장치(D2)가 가상 MLO를 수행해야 하고 무선 통신 장치(D1)가 가상 MLO에서 무선 통신 장치(D2)를 서빙하기로 결정할 수 있다. 일부 실시예에서, 무선 통신 장치(D1)는 무선 통신 장치(D1)가 가상 MLO를 수행하기 시작한 후 소정의 시간 뒤에 역할 전환을 결정할 수 있다. 일부 실시예에서, 무선 통신 장치(D2)는 무선 통신 장치(D2)가 가상 MLO에서 무선 통신 장치(D1)를 서빙하기 시작한 후 소정의 시 간 뒤에 역할 전환을 결정할 수 있다. 일부 실시예에서, MLD 상위 MAC 부계층이 상위 계층으로부터 MAC SAP를 통해 데이터 유닛을 수신할 때 무선 통신 장치(D2)는 역할 전환을 결정할 수 있다. 일부 실시예에서, 무선 통신 장치(D1)가 역할 전환을 결정하면, 무선 통신 장치(D1)는 이러한 역할 전환에 대한 요청 을 무선 통신 장치(D2)에 전송할 수 있고, 무선 통신 장치(D2)는 무선 통신 장치(D1)에 응답을 전송할 수 있다. 일부 실시예에서, 무선 통신 장치(D2)가 역할 전환을 결정하면, 무선 통신 장치(D2)는 이러한 역할 전환에 대한 요청을 무선 통신 장치(D1)에 전송할 수 있고, 무선 통신 장치(D1)는 무선 통신 장치(D2)에 응답을 전송할 수있다. 일부 실시예에서, 무선 통신 장치(D1)가 사용자 포커스를 상실하고 무선 통신 장치(D2)가 사용자 포커스를 획득 할 때, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는, 무선 통신 장치(D2)가 가상 MLO를 수행하고 무선 통신 장 치(D1)가 가상 MLO에서 무선 통신 장치(D2)를 서빙하도록 결정할 수 있다. 일부 실시예에서, 사용자 포커스는 사용자가 장치를 사용하고 있음을 나타낼 수 있다. 일부 실시예에서, 무선 통신 장치(D1)가 소정의 시간 동안 사용자 인터페이스로부터 사용자 입력을 수신하지 못하는 경우, 무선 통신 장치(D1)는 무선 통신 장치(D 1)가 사용자 포커스를 상실한 것으로 결정할 수 있다. 일부 실시예에서, 무선 통신 장치(D2)가 사용자 인터페이 스로부터 사용자 입력을 수신하는 경우, 무선 통신 장치(D2)는 무선 통신 장치(D2)가 사용자 포커스를 획 득했다고 결정할 수 있다. 동작 835에서, 무선 통신 장치(D1)는 가상 MLO의 수행을 중단할 수 있다. 동작 837에서, 무선 통신 장치(D1)는 WLAN 링크(L1)를 사용하여 가상 MLO에서 무선 통신 장치(D2)를 서빙하기 시작할 수 있다. 동작 839에서, 무선 통신 장치(D2)는 가상 MLO에서 무선 통신 장치(D1)의 서빙을 중단할 수 있다. 동작 841에서, 무선 통신 장치(D2)는 가상 MLO를 수행하기 시작할 수 있다. 역할 전환이 완료되면, 무선 통신 네트워크의 개략적인 블록도는 도 7에서와 같이 변경될 수 있다. 추가적으로, 동작 843에서, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 역할을 다시 전환하기로 결정할 수 있 다. 즉, 무선 통신 장치(D1) 및 무선 통신 장치(D2)는 무선 통신 장치(D1)가 가상 MLO를 수행하고 무선 통신 장 치(D2)가 가상 MLO에서 무선 통신 장치(D1)를 서빙하도록 결정할 수 있다. 무선 통신 장치(D1) 및 무선 통신 장 치(D2)는 동작 833의 실시예에서 설명한 바와 같이 역할을 다시 전환하기로 결정할 수 있다. 동작 845에서, 무선 통신 장치(D1)는 가상 MLO에서 무선 통신 장치(D2)의 서빙을 중단할 수 있다. 동작 847에서, 무선 통신 장치(D1)는 가상 MLO의 수행을 재개할 수 있다. 동작 849에서, 무선 통신 장치(D2)는 가상 MLO의 수행을 중단할 수 있다. 동작 851에서, 무선 통신 장치(D2)는 가상 MLO에서 무선 통신 장치(D1)의 서빙을 재개할 수 있다. 역할 전환이 완료되면, 무선 통신 네트워크의 개략적인 블록도는 도 6에서와 같이 변경될 수 있다. 도 21은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 21을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전 자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버 를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서(2120, 메 모리(2130, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈 , 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배 터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상 의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메 라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘 발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처 리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일 부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예 에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따 르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행 되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경 망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또 는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥 터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트 워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외 부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사 항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하 여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치 와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(2102, 또는 2104) 각각은 전자 장 치와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작 들의 전부 또는 일부는 외부의 전자 장치들(2102, 2104, 또는 2108) 중 하나 이상의 외부의 전자 장치들에서 실 행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로 부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대 신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라 고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달 할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어 도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅 (MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예 를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버(210 8)는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 하드웨어와 소프트웨어의 호환성을 설명하기 위하여, 다양한 예시 블록, 모듈, 구성 요소, 방법, 작업, 명령 및 알고리즘과 같은 아이템들이 그 기능 측면에서 일반적으로 설명되었다. 이러한 기능이 하드웨어로 구현되는지 소프트웨어로 구현되는지는 전체 시스템에 부과되는 특정 애플리케이션 및 설계 제약 조건에 따라 다르다. 숙련 된 기술자는 각 특정 응용 프로그램에 대해 다양한 방식으로 설명된 기능을 구현할 수 있다. 단수의 구성요소에 대한 언급은 특별히 언급되지 않는 한 단 하나를 의미하는 것이 아니라 하나 또는 그 이상을 의미한다. 예를 들어, \"하나의\" 모듈은 하나 이상의 모듈을 참조할 수 있다. \"하나의\", \"한개의\", \"상기\"로 수 식되는 구성요소는 추가 제한이 없다면 추가적인 동일 구성요소의 존재를 배제하지는 않는다. 표제 및 부제목이 있는 경우 이는 편의를 위해 사용된 것이며 본 발명을 제한하지 않는다. 예시적이라는 단어는 예 또는 예시로 제공되는 것을 의미하는 데 사용된다. \"포함하다\", \"갖다\" 등의 용어가 사용되는 한, 그러한 용 어는 \"포함하다\"가 청구항에서 전통적으로 사용될 때의 해석과 유사하게 포함한다는 것으로 의도된다. 제1 및 제2 등과 같은 관계적인 용어는 그러한 개체 또는 작업 간의 실제 관계 또는 순서를 반드시 요구하거나 암시하 지 않고 하나의 개체 또는 작업을 다른 개체와 구별하는 데 사용될 수 있다. 일 측면, 상기 측면, 또 다른 측면, 일부 측면, 하나 이상의 측면, 일 구현, 상기 구현, 또 다른 구현, 일부 구 현, 하나 이상의 구현, 일 실시예, 상기 실시예, 또 다른 실시예, 일부 실시예, 하나 이상의 실시예, 하나의 구 성, 상기 구성, 또 다른 구성, 일부 구성, 하나 이상의 구성, 본 기술, 개시, 본 개시, 이들의 다른 변형 등과 같은 문구는 편의를 위한 것이며, 그러한 문구와 관련된 개시가 본 기술에 필수적이거나 그러한 개시가 본 기술의 모든 구성들에 적용된다는 것을 암시하지는 않는다. 이러한 문구(들)에 관한 개시는 모든 구성 또는 하나 이 상의 구성에 적용될 수 있다. 그러한 문구(들)에 관한 개시는 하나 이상의 예를 제공할 수 있다. 일 측면 또는 일부 측면과 같은 문구는 하나 이상의 측면을 지칭할 수 있고, 그 역도 마찬가지이며, 이는 다른 전술한 문구에 도 유사하게 적용된다. 어떤 항목들(items)을 구분하는 용어 \"및\", \"와/과\", 또는 \"또는\"과 함께, 일련의 항목 앞에 붙는 문구인 \"적어 도 하나의\"는 목록의 각 항목이 아니라 목록을 전체로서 수정한다. \"적어도 하나\"라는 문구는 적어도 하나의 항 목의 선택을 요구하지 않고, 오히려 그 문구는 항목들 중 어느 하나의 적어도 하나, 및/또는 항목들의 임의의 조합 중 적어도 하나, 및/또는 각각의 항목 중 적어도 하나를 포함하는 의미를 허용한다. 예를 들어, \"A, B 및 C 중 적어도 하나\" 또는 \"A, B 또는 C 중 적어도 하나\"라는 문구 각각은 \"오직 A만, 오직 B만 또는 오직 C만\"을 지칭하거나 \"A, B 및 C의 임의의 조합\"을 지칭하거나, \"A, B 및 C의 각각 중 적어도 하나\"를 지칭한다. 개시된 단계, 동작 또는 프로세스의 특정 순서 또는 계층은 예시적인 접근 방식의 설명인 것으로 이해되어져야 한다. 달리 명시적으로 언급되지 않는 한, 단계, 동작 또는 프로세스의 특정 순서 또는 계층 구조는 다른 순서 로 수행될 수 있다. 단계, 동작 또는 프로세스 중 일부는 동시에 수행되거나 하나 이상의 다른 단계, 동작 또는 프로세스의 일부로 수행될 수 있다. 수반되는 방법 청구항이 존재한다면, 이는 다양한 단계, 동작 또는 프로세 스의 구성요소를 예시적 순서로 제시하며, 제시된 특정 순서 또는 계층 구조로 제한되지 않는다. 이들은 직렬, 선형, 병렬 또는 다른 순서로 수행될 수 있다. 설명된 지시(instructions), 동작들 및 시스템들은 일반적으로 단일 소프트웨어/하드웨어 제품에 함께 통합되거나 복수의 소프트웨어/하드웨어 제품으로 패키징될 수 있음을 이해해야 한다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "본 개시는 기술분야에서 통상의 지식을 가진 자가 여기에서 설명된 다양한 측면을 실시할 수 있도록 제공된다. 어떤 경우에는 본 기술의 개념을 모호하게 하는 것을 피하기 위해 잘 알려진 구조와 구성 요소가 블록 다이어그 램 형식으로 표시된다. 본 개시는 본 기술의 다양한 예를 제공하며, 본 기술은 이러한 예에 제한되지 않는다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이러한 측면에 대한 다양한 수정은 기술분야에서 통상의 지식을 가진 자에게 용이하게 명백할 것이며, 여기에 설명된 원리는 다른 측면에도 적용될 수 있다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "기술분야에서 통상의 지식을 가진 자에게 알려져 있거나 나중에 알려지게 되는, 본 개시 전체에 걸쳐 설명된 다 양한 측면의 구성요소에 대한 모든 구조적 및 기능적 등가물은 참조에 의해 본 개시에 명시적으로 포함되고 청 구범위에 포함되는 것으로 의도된다. 더욱이, 여기에 개시된 어떤 것도 그러한 개시가 청구범위에 명시적으로 인용되었는지 여부에 관계없이 대중에게 헌정되도록 의도되지 않는다. 어떠한 청구항 구성요소도 명시적으로 \"~ 을 위한 수단(means for)\"를 사용하여 기재되지 않는 한, 기능식 청구항으로 해석되지 않을 것이다."}
{"patent_id": "10-2022-0054175", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "발명의 명칭, 배경기술, 도면의 간단한 설명, 요약 및 도면은 본 개시에 통합되고 제한적인 설명이 아닌 본 개 시의 예시적인 예로서 제공되며, 청구항의 범위 또는 의미를 제한하는 데 사용되지 않을 것이라는 이해와 함께 제공된다. 또한, 상세한 설명에서, 설명은 설명에 도움이 되는 실례를 제공하고 다양한 특징은 본 개시를 간소 화할 목적으로 다양한 구현에서 함께 그룹화됨을 알 수 있다. 이 개시 방법은 청구된 주제가 각 청구에서 명시 적으로 언급된 것보다 더 많은 특징을 필요로 한다는 의도를 반영하는 것으로 해석되어서는 안 된다. 오히려, 다음의 청구 범위가 반영하는 바와 같이, 독창적인 주제는 단일의 개시된 구성 또는 동작의 모든 특징보다 적은 범위에 있다. 다음 청구범위는 상세한 설명에 통합되며, 각 청구범위는 별도로 청구된 주제로서 그 자체로 존재 한다. 청구 범위는 여기에 설명된 측면으로 제한되도록 의도되지 않고, 청구 범위의 언어와 일치하는 전체 범위가 부 여되어야 하며 모든 법적 등가물을 포함해야 할 것이다. 그럼에도 불구하고, 청구 범위 중 어느 것도 특허법의 요구 사항을 충족하지 못하는 주제를 포함하도록 의도되지 않았으며 그러한 방식으로 해석되어서도 안 된다. 본 개시의 일 측면은 무선 통신을 위한 전자 장치를 제공할 수 있다. 이 전자 장치는 하나 이상의 메모리 및 상 기 하나 이상의 메모리에 작동적으로(operatively) 연결된 하나 이상의 프로세서를 포함할 수 있다. 상기 하나 이상의 프로세서는, 외부 전자 장치에, 상기 외부 전자 장치와 상기 전자 장치 사이의 가상 다중 링크 동작을 위한 요청 프레임을 전송하는 동작과, 상기 요청 프레임에 대한 응답으로 상기 외부 전자 장치로부터 응답 프레 임을 수신하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이의 제1 무선 링크를 설정하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이의 가상 링크를 설정하는 동작과, 상기 제1 무선 링크 및 상기 가상 링크 를 통해 상기 외부 전자 장치와 통신하는 동작을 수행하도록 할 수 있다. 상기 가상 링크는 상기 외부 전자 장 치와 또 다른 전자 장치 사이의 제2 무선 링크 및 상기 또 다른 전자 장치와 상기 전자 장치 사이의 통신 링크 를 포함할 수 있다.일부 실시예에서, 상기 요청 프레임은 상기 전자 장치의 제1 매체 접근 제어(Medium Access Control, MAC) 주소 및 상기 또 다른 전자 장치의 제2 MAC 주소를 포함할 수 있다. 일부 실시예에서, 상기 요청 프레임은 상기 전자 장치의 다중 링크 장치(Multi-Link Device, MLD) MAC 주소를 더 포함할 수 있다. 일부 실시예에서, 상기 요청 프레임은 상기 제2 무선 링크에 대해 상기 또 다른 전자 장치가 지원하는 능력 (capability)에 대한 정보를 더 포함할 수 있다. 일부 실시예에서, 상기 하나 이상의 프로세서는 상기 또 다른 전자 장치로부터 상기 제2 MAC 주소 및 상기 능력 에 대한 정보를 수신하는 것을 더 수행하도록 할 수 있다. 일부 실시예에서, 제1 프레임이 상기 제1 무선 링크 및 상기 가상 링크 중 어느 하나를 통해 상기 외부 전자 장 치로부터 상기 전자 장치로 전송되는 동안 동시에, 제2 프레임이 상기 제1 무선 링크와 상기 가상 링크 중 다른 하나를 통해 상기 전자 장치로부터 상기 외부 전자 장치로 전송되는 것이 허용될 수 있다. 일부 실시예에서, 상기 외부 전자 장치와 통신하는 동작은, 상기 제2 무선 링크를 통해 상기 외부 전자 장치로 부터 수신된 데이터 유닛을 상기 통신 링크를 통해 상기 또 다른 전자 장치로부터 수신하는 동작을 포함할 수 있다. 일부 실시예에서, 상기 외부 전자 장치와 통신하는 동작은, 상기 제2 무선 링크를 통해 상기 외부 전자 장치로 전송될 데이터 유닛을 상기 통신 링크를 통해 상기 또 다른 전자 장치로 전송하는 동작을 포함할 수 있다. 일부 실시예에서, 상기 하나 이상의 프로세서는, 상기 또 다른 전자 장치를 서빙하기로 결정하는 동작과, 상기 제1 무선 링크 및 상기 가상 링크를 통한 상기 외부 전자 장치와의 통신을 중단하는 동작과, 상기 외부 전자 장 치와 상기 또 다른 전자 장치 사이의 또 다른 가상 다중 링크 동작에서 상기 제1 무선 링크를 사용하여 상기 또 다른 전자 장치를 서빙하는 동작을 더 수행하도록 할 수 있다. 상기 또 다른 가상 다중 링크 동작은 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 또 다른 가상 링크 및 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 상기 제2 무선 링크를 사용할 수 있다. 상기 또 다른 가상 링크는 상기 외부 전자 장치와 상기 전 자 장치 사이의 제1 무선 링크 및 상기 전자 장치와 상기 또 다른 전자 장치 사이의 상기 통신 링크를 포함할 수 있다. 일부 실시예에서, 상기 하나 이상의 프로세서는, 상기 제1 무선 링크 및 상기 가상 링크를 통해 상기 외부 전자 장치와 통신을 재개하기로 결정하는 동작과, 상기 또 다른 전자 장치에 대한 서빙을 중단하는 동작과, 상기 제1 무선 링크 및 상기 가상 링크를 통해 상기 외부 전자 장치와 통신을 재개하는 동작을 더 수행하도록 할 수 있다. 일부 실시예에서, 상기 또 다른 전자 장치를 서빙하기로 결정하는 동작은, 상기 전자 장치가 소정의 시간 동안 사용자 입력을 수신하지 못하고, 상기 또 다른 전자 장치가 사용자 입력을 수신한 경우, 상기 또 다른 전자 장 치를 서빙하는 것으로 결정하는 동작을 포함할 수 있다. 일부 실시예에서, 상기 요청 프레임은 프로브 요청 프레임 또는 연관 요청 프레임(association request frame) 이고, 상기 응답 프레임은 프로브 응답 프레임 또는 연관 응답 프레임일 수 있다. 일부 실시예에서, 상기 통신 링크는 상기 제1 무선 링크보다 더 높은 스루풋(throughput)을 갖고, 상기 통신 링 크는 상기 제2 무선 링크보다 더 높은 스루풋을 가질 수 있다. 일부 실시예에서, 상기 또 다른 전자 장치는 상기 전자 장치를 충전하기 위한 배터리를 가질 수 있다. 일부 실시예에서, 상기 외부 전자 장치는 제1 AP 스테이션 및 제2 AP 스테이션을 포함하고, 상기 전자 장치는 제1 non-AP 스테이션을 포함하고, 상기 또 다른 전자 장치는 제2 non-AP 스테이션을 포함하고, 상기 제1 무선 링크는 상기 제1 AP 스테이션과 제1 non-AP 스테이션 사이에 설정되고, 상기 제2 무선 링크는 상기 제2 AP 스테 이션과 상기 제2 non-AP 스테이션 사이에 설정될 수 있다. 본 개시의 또 다른 측면은 무선 통신을 위한 전자 장치를 제공할 수 있다. 이 전자 장치는 하나 이상의 메모리 및 하나 이상의 메모리에 작동적으로(operatively) 연결된 하나 이상의 프로세서를 포함할 수 있다. 상기 하나 이상의 프로세서는, 또 다른 전자 장치로부터, 상기 또 다른 전자 장치와 외부 전자 장치 사이의 가상 다중 링 크 동작을 위한 요청 프레임을 수신하는 동작과, 상기 요청 프레임에 대한 응답으로 상기 또 다른 전자 장치에 응답 프레임을 전송하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이에 제1 무선 링크를 설정하는 동작과, 상기 가상 다중 링크 동작에서 상기 제1 무선 링크를 사용하여 상기 또 다른 전자 장치를 서빙하는 동작을 수행하도록 하고, 상기 가상 다중 링크 동작은 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 가상 링 크 및 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 제2 무선 링크를 사용하고, 상기 가상 링크는 상 기 외부 전자 장치와 상기 전자 장치 사이의 상기 제1 무선 링크 및 상기 전자 장치와 상기 또 다른 전자 장치 사이의 통신 링크를 포함할 수 있다. 일부 실시예에서, 상기 응답 프레임은 상기 전자 장치의 매체 접근 제어(medium access control, MAC) 주소를 포함할 수 있다. 일부 실시예에서, 상기 하나 이상의 프로세서는 상기 또 다른 전자 장치에 대한 데이터 유닛이 상기 제1 무선 링크를 통해 상기 외부 전자 장치로부터 수신되는 경우, 상기 통신 링크를 통해 상기 데이터 유닛을 상기 또 다 른 전자 장치에 전송하는 동작을 더 수행하도록 할 수 있다. 일부 실시예에서, 상기 하나 이상의 프로세서는 상기 통신 링크를 통해 상기 또 다른 전자 장치로부터 데이터 유닛이 수신되는 경우, 상기 제1 무선 링크를 통해 상기 데이터 유닛을 상기 외부 전자 장치로 전송하는 동작을 더 수행하도록 할 수 있다. 본 개시의 또 다른 측면은 전자 장치와 무선 통신을 위한 외부 전자 장치를 제공할 수 있다. 외부 전자 장치는 하나 이상의 메모리 및 상기 하나 이상의 메모리에 작동적으로 연결된 하나 이상의 프로세서를 포함할 수 있다. 상기 하나 이상의 프로세서는, 상기 전자 장치로부터, 상기 외부 전자 장치와 상기 전자 장치 사이의 가상 다중 링크 동작을 위한 요청 프레임을 수신하는 동작과, 상기 요청 프레임에 대한 응답으로 상기 전자 장치에 응답 프레임을 전송하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이에 제1 무선 링크를 설정하는 동작과, 상기 외부 전자 장치와 상기 전자 장치 사이에 가상 링크를 설정하는 동작과, 제1 무선 링크 및 가상 링크를 통 해 상기 전자 장치와 통신하는 동작을 수행하도록 할 수 있다. 상기 가상 링크는 상기 외부 전자 장치와 상기 또 다른 전자 장치 사이의 제2 무선 링크 및 상기 또 다른 전자 장치와 상기 전자 장치 사이의 통신 링크를 포 함할 수 있다."}
{"patent_id": "10-2022-0054175", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 무선 통신 네트워크의 개략도를 보여준다. 도 2는 예시적인 무선 통신 장치의 개략도를 보여준다. 도 3은 예시적인 송신부의 개략적인 블록도를 보여준다. 도 4는 예시적인 수신부의 개략적인 블록도를 보여준다. 도 5는 제1 실시예에 따른 무선 통신 네트워크의 개략적인 블록도를 보여준다. 도 6은 제2 실시예에 따른 무선 통신 네트워크의 개략적인 블록도를 보여준다. 도 7은 제3 실시예에 따른 무선 통신 네트워크의 개략적인 블록도를 보여준다. 도 8은 가상 다중 링크를 설정하기 위한 예시적인 메시지 흐름도를 보여준다. 도 9는 다중 링크 엘리먼트의 예시적인 포맷을 보여준다. 도 10은 가상 다중 링크를 사용하는 다운링크 전송을 위한 예시적인 메시지 흐름도를 보여준다. 도 11은 가상 다중 링크를 사용하는 업링크 전송을 위한 예시적인 메시지 흐름도를 보여준다. 도 12는 제1 실시예에 따른 다운링크 데이터 전송을 보여준다. 도 13은 제2 실시예에 따른 다운링크 데이터 전송을 보여준다. 도 14는 제1 실시예에 따른 업링크 데이터 송신을 보여준다. 도 15는 제2 실시예에 따른 업링크 데이터 전송을 보여준다. 도 16은 제1 실시예에 따른 STR 동작에서의 데이터 전송을 보여준다. 도 17은 제2 실시예에 따른 STR 동작에서의 데이터 전송을 보여준다. 도 18은 제3 실시예에 따른 STR 동작에서의 데이터 전송을 보여준다. 도 19는 제4 실시예에 따른 STR 동작에서의 데이터 전송을 보여준다. 도 20은 MLO의 역할 변경을 보여주는 예시적인 흐름도를 보여준다. 도 21은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다."}
