{"patent_id": "10-2022-0057360", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0096806", "출원번호": "10-2022-0057360", "발명의 명칭": "인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼 및 그 동작 방법", "출원인": "주식회사 옷깃", "발명자": "정용웅"}}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 시스템에 의해 구현되는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼의 동작방법에 있어서, 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계; 및 상기 유저가 방문한 장소와 동일한 장소를 방문한 유저들 간 커뮤니티 공간을 제공하는 단계를 포함하고, 상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 빅데이터 및 지오태깅을 이용하여 사진에 기록되어 있는 메타 정보를 활용하여 방문한 장소를 자동으로 태깅함에 따라 라이프로깅 데이터를 생성하는 것을 특징으로 하는, 메타버스 라이프로깅 모바일 플랫폼의 동작 방법."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 유저와 다른 유저가 공통으로 방문한 장소의 목록을 비교하여 관심사 일치 여부를 판단하는 단계; 및 상기 유저와 다른 유저 사이에 상기 관심사가 일치하는 경우 유저에게 친구 맺기 신청을 제공하는 단계를 더 포함하는, 메타버스 라이프로깅 모바일 플랫폼의 동작 방법."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 동일한 장소를 방문한 유저들 간 커뮤니티 공간을 제공하는 단계는, 상기 유저가 방문한 장소로 설정되는 장소에서 사진 또는 영상을 업로드하거나 게시글을 작성하는 것을 특징으로 하는, 메타버스 라이프로깅 모바일 플랫폼의 동작 방법."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 사진 또는 영상의 메타 정보 또는 GPS를 통해 파악된 위치 정보로부터 소정 거리 이내에 존재하는 관심지점(Point of Interest, POI)의 후보 목록을 도출하는 단계; 도출된 상기 관심지점(POI)의 후보 목록에서 디바이스 센서로부터 수집된 정보, 장소 관련 정보 및 상기 유저의과거 방문 히스토리 중 적어도 어느 하나 이상의 데이터를 추출하는 단계; 및 추출된 상기 데이터를 예측 모델에 입력하여 상기 유저가 방문 가능성이 높은 장소를 방문 장소로 선택하는 단계를 포함하고, 상기 방문 장소를 기반으로 라이프로깅 서비스를 제공하는, 메타버스 라이프로깅 모바일 플랫폼의 동작 방법."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2023-0096806-3-상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 상기 유저가 현재 또는 과거에 촬영한 사진 또는 영상의 메타 정보를 통해 촬영된 위치 정보를 파악하는 단계를 포함하고, 상기 유저가 현재 또는 과거에 촬영한 사진 또는 영상의 메타 정보를 통해 촬영된 위치 정보를 파악하는단계는, 현재 또는 과거에 촬영한 사진 또는 영상에 접근하여 메타 정보를 획득할 수 있는 경우, 상기 메타 정보를 기반으로 과거의 라이프로그를 기록하는 것을 특징으로 하는, 메타버스 라이프로깅 모바일 플랫폼의 동작 방법."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 상기 유저가 현재 또는 과거에 촬영한 사진 또는 영상의 메타 정보를 통해 촬영된 위치 정보를 파악하는 단계를 포함하고, 상기 유저가 현재 또는 과거에 촬영한 사진 또는 영상의 메타 정보를 통해 촬영된 위치 정보를 파악하는단계는, 현재 또는 과거에 촬영한 사진 또는 영상에 접근하여 메타 정보를 획득할 수 없는 경우, 상기 유저의 단말에 저장된 메시지 기록, 결제 내역 및 유저의 동선 중 적어도 어느 하나 이상의 정보를 이용하여 촬영된 위치 정보를파악하는 것을 특징으로 하는, 메타버스 라이프로깅 모바일 플랫폼의 동작 방법."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 지오태깅 및 장소 분석을 위한 관심지점(POI) 데이터베이스를 구축하는 단계를 더 포함하고, 구축된 상기 관심지점(POI) 데이터베이스를 기반으로 상기 관심지점(POI)의 후보 목록을 도출하는, 메타버스 라이프로깅 모바일 플랫폼의 동작 방법."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 상기 유저의 피드백을 바탕으로 상기 예측 모델을 학습시키는 단계를 더 포함하고, 상기 예측 모델을 학습시키는 단계는, 상기 유저가 상기 예측 모델을 통해 선택된 상기 장소를 수정하는 경우 거짓(False) 값으로 판별하고, 상기 장소를 수정하지 않는 경우 참(True) 값으로 판별하여 상기 예측 모델을 학습시키는, 메타버스 라이프로깅 모바일플랫폼의 동작 방법."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제4항에 있어서,공개특허 10-2023-0096806-4-상기 데이터를 예측 모델에 입력하여 상기 유저가 방문 가능성이 높은 장소를 방문 장소로 선택하는 단계는, 상기 사진 또는 영상의 위치 정보와 상기 관심지점(POI)의 후보 목록의 속성 정보를 이용하여 다른 유저의 사진또는 영상을 포함한 빅데이터를 기반으로 방문 장소를 선택하는 것을 특징으로 하는, 메타버스 라이프로깅 모바일 플랫폼의 동작 방법."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼에 있어서, 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 방문 장소 체크인부; 및 상기 유저가 방문한 장소와 동일한 장소를 방문한 유저들 간 커뮤니티 공간을 제공하는 커뮤니티 공간 제공부를 포함하고, 상기 방문 장소 체크인부는, 빅데이터 및 지오태깅을 이용하여 사진에 기록되어 있는 메타 정보를 활용하여 방문한 장소를 자동으로 태깅함에 따라 라이프로깅 데이터를 생성하는 것을 특징으로 하는, 메타버스 라이프로깅 모바일 플랫폼."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 유저와 다른 유저가 공통으로 방문한 장소의 목록을 비교하여 관심사 일치 여부를 판단하고, 상기 유저와다른 유저 사이에 상기 관심사가 일치하는 경우 유저에게 친구 맺기 신청을 제공하는 친구 맺기 제공부를 더 포함하는, 메타버스 라이프로깅 모바일 플랫폼."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 방문 장소 체크인부는, 상기 유저가 방문한 장소로 설정되는 장소에서 사진 또는 영상을 업로드하거나 게시글을 작성하는 것을 특징으로 하는, 메타버스 라이프로깅 모바일 플랫폼."}
{"patent_id": "10-2022-0057360", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 방문 장소 체크인부는, 사진 또는 영상의 메타 정보 또는 GPS를 통해 파악된 위치 정보로부터 소정 거리 이내에 존재하는 관심지점(Point of Interest, POI)의 후보 목록을 도출하는 POI 후보 목록 도출부; 도출된 상기 관심지점(POI)의 후보 목록에서 디바이스 센서로부터 수집된 정보, 장소 관련 정보 및 상기 유저의과거 방문 히스토리 중 적어도 어느 하나 이상의 데이터를 추출하는 입력 데이터 추출부; 및 추출된 상기 데이터를 입력하여 상기 유저가 방문 가능성이 높은 장소를 방문 장소로 선택하는 예측 모델을 포함하고, 상기 방문 장소를 기반으로 라이프로깅 서비스를 제공하는, 메타버스 라이프로깅 모바일 플랫폼."}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼 및 그 동작 방법이 제시된다. 본 발명의 일 실시예에 따른 컴퓨터 시스템에 의해 구현되는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼의 동작 방법은, 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계; 및 상기 유저가 방문한 장 소와 동일한 장소를 방문한 유저들 간 커뮤니티 공간을 제공하는 단계를 포함하고, 상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 빅데이터 및 지오태깅을 이용하여 사진에 기록되어 있는 메타 정보를 활용하여 방문한 장소를 자동으로 태깅함에 따라 라이프로깅 데이터를 생성할 수 있다."}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 본 발명의 실시예들은 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼에 관한 것으로, 더욱 상세 하게는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "라이프로깅(lifelogging)은 개인이 생활하면서 보고, 듣고, 만나고, 느끼는 모든 정보를 자동으로 기록하는 것으로, 장소와 시간에 구애 받지 않고 웹 사이트에 자료를 올릴 수 있는 서비스이다. 이러한 라이프로깅은 빅데 이터 시대에 특정 유저와 관련한 통합 데이터베이스(Database, DB)를 구축하는 관점에서 핵심적이고 포괄적인 기술이며, Instagram, Facebook, Twitter 등 글로벌 SNS 서비스가 궁극적으로 지향하는 바이다. 사람이 지닌 기억력의 한계로 인하여 개인의 일상을 기록하기 위한 일기 등은 과거로부터 존재해 왔던 아날로그 형태의 라이 프로깅이며, 21세기의 라이프로깅은 디지털을 활용하여 진화 중이다. 한편, 모바일 디바이스 센서를 이용한 실시간 위치 정보로는 서비스 이용 개시 시점 이후부터의 라이프로깅만 가능하다는 한계가 존재한다. 서비스 이용 시점 이전 과거로의 라이프로깅 데이터 수집 확장을 위해서는 디바 이스에 저장된 사진 등 다양한 기록을 활용할 수 있는 기술이 필요하다. 한국등록특허 10-1706371호는 이러한 라이프로그 서비스를 수행하는 이동 단말기 및 서버에 관한 기술을 기재하 고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 10-1706371호"}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼 및 그 동작 방법에 관하여 기술하며, 보다 구체적으로 인공지능 기반 지오태깅을 이용하여 유저가 방문한 장소들을 기록하고, 같은 장소를 방문한 유저들을 연결하는 라이프로깅 모바일 플랫폼 기술을 제공한다. 본 발명의 실시예들은 빅데이터 및 지오태깅을 이용하여 사진에 기록되어 있는 메타 정보를 활용하여 방문장소 를 자동으로 태깅함으로써, 빠르게 라이프로깅 데이터를 생성하고, 유저의 과거 방문이력에 대한 라이프로깅의 시간적 범위를 확장할 수 있는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼 및 그 동 작 방법을 제공하는데 있다. 또한, 본 발명의 실시예들은 라이프로깅을 바탕으로 개별 장소 단위의 하이퍼로컬 커뮤니티를 연결하는 메타버 스 서비스를 제공함으로써, 물리적 거리가 아닌 정서적 거리에 기반한 강한 유대감을 형성할 수 있는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼 및 그 동작 방법을 제공하는데 있다."}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 컴퓨터 시스템에 의해 구현되는 인공지능 기반 지오태깅을 이용한 메타버스 라이프 로깅 모바일 플랫폼의 동작 방법은, 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계; 및 상기 유저 가 방문한 장소와 동일한 장소를 방문한 유저들 간 커뮤니티 공간을 제공하는 단계를 포함하고, 상기 유저가 방 문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 빅데이터 및 지오태깅을 이용하여 사진에 기록되어 있는 메타 정보를 활용하여 방문한 장소를 자동으로 태깅함에 따라 라이프로깅 데이터를 생성할 수 있다. 상기 유저와 다른 유저가 공통으로 방문한 장소의 목록을 비교하여 관심사 일치 여부를 판단하는 단계; 및 상기 유저와 다른 유저 사이에 상기 관심사가 일치하는 경우 유저에게 친구 맺기 신청을 제공하는 단계를 더 포함할 수 있다. 상기 동일한 장소를 방문한 유저들 간 커뮤니티 공간을 제공하는 단계는, 상기 유저가 방문한 장소로 설정되는 장소에서 사진 또는 영상을 업로드하거나 게시글을 작성할 수 있다. 상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 사진 또는 영상의 메타 정보 또는 GPS를 통해 파악된 위치 정보로부터 소정 거리 이내에 존재하는 관심지점(Point of Interest, POI)의 후보 목록을 도 출하는 단계; 도출된 상기 관심지점(POI)의 후보 목록에서 디바이스 센서로부터 수집된 정보, 장소 관련 정보 및 상기 유저의 과거 방문 히스토리 중 적어도 어느 하나 이상의 데이터를 추출하는 단계; 및 추출된 상기 데이 터를 예측 모델에 입력하여 상기 유저가 방문 가능성이 높은 장소를 방문 장소로 선택하는 단계를 포함하고, 상 기 방문 장소를 기반으로 라이프로깅 서비스를 제공할 수 있다. 상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 상기 유저가 현재 또는 과거에 촬영한 사 진 또는 영상의 메타 정보를 통해 촬영된 위치 정보를 파악하는 단계를 포함하고, 상기 유저가 현재 또는 과거 에 촬영한 사진 또는 영상의 메타 정보를 통해 촬영된 위치 정보를 파악하는 단계는, 현재 또는 과거에 촬영한 사진 또는 영상에 접근하여 메타 정보를 획득할 수 있는 경우, 상기 메타 정보를 기반으로 과거의 라이프로그를 기록할 수 있다. 상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 상기 유저가 현재 또는 과거에 촬영한 사 진 또는 영상의 메타 정보를 통해 촬영된 위치 정보를 파악하는 단계를 포함하고, 상기 유저가 현재 또는 과거 에 촬영한 사진 또는 영상의 메타 정보를 통해 촬영된 위치 정보를 파악하는 단계는, 현재 또는 과거에 촬영한 사진 또는 영상에 접근하여 메타 정보를 획득할 수 없는 경우, 상기 유저의 단말에 저장된 메시지 기록, 결제 내역 및 유저의 동선 중 적어도 어느 하나 이상의 정보를 이용하여 촬영된 위치 정보를 파악할 수 있다. 상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 지오태깅 및 장소 분석을 위한 관심지점 (POI) 데이터베이스를 구축하는 단계를 더 포함하고, 구축된 상기 관심지점(POI) 데이터베이스를 기반으로 상기 관심지점(POI)의 후보 목록을 도출할 수 있다. 상기 유저가 방문한 장소를 자동 또는 수동으로 체크인 하는 단계는, 상기 유저의 피드백을 바탕으로 상기 예측 모델을 학습시키는 단계를 더 포함하고, 상기 예측 모델을 학습시키는 단계는, 상기 유저가 상기 예측 모델을 통해 선택된 상기 장소를 수정하는 경우 거짓(False) 값으로 판별하고, 상기 장소를 수정하지 않는 경우 참 (True) 값으로 판별하여 상기 예측 모델을 학습시킬 수 있다. 상기 데이터를 예측 모델에 입력하여 상기 유저가 방문 가능성이 높은 장소를 방문 장소로 선택하는 단계는, 상 기 사진 또는 영상의 위치 정보와 상기 관심지점(POI)의 후보 목록의 속성 정보를 이용하여 다른 유저의 사진 또는 영상을 포함한 빅데이터를 기반으로 방문 장소를 선택할 수 있다. 다른 실시예에 따른 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼은, 유저가 방문한 장 소를 자동 또는 수동으로 체크인 하는 방문 장소 체크인부; 및 상기 유저가 방문한 장소와 동일한 장소를 방문 한 유저들 간 커뮤니티 공간을 제공하는 커뮤니티 공간 제공부를 포함하고, 상기 방문 장소 체크인부는, 빅데이 터 및 지오태깅을 이용하여 사진에 기록되어 있는 메타 정보를 활용하여 방문한 장소를 자동으로 태깅함에 따라 라이프로깅 데이터를 생성할 수 있다. 상기 유저와 다른 유저가 공통으로 방문한 장소의 목록을 비교하여 관심사 일치 여부를 판단하고, 상기 유저와 다른 유저 사이에 상기 관심사가 일치하는 경우 유저에게 친구 맺기 신청을 제공하는 친구 맺기 제공부를 더 포 함할 수 있다. 상기 방문 장소 체크인부는, 상기 유저가 방문한 장소로 설정되는 장소에서 사진 또는 영상을 업로드하거나 게 시글을 작성할 수 있다. 상기 방문 장소 체크인부는, 사진 또는 영상의 메타 정보 또는 GPS를 통해 파악된 위치 정보로부터 소정 거리 이내에 존재하는 관심지점(Point of Interest, POI)의 후보 목록을 도출하는 POI 후보 목록 도출부; 도출된 상 기 관심지점(POI)의 후보 목록에서 디바이스 센서로부터 수집된 정보, 장소 관련 정보 및 상기 유저의 과거 방 문 히스토리 중 적어도 어느 하나 이상의 데이터를 추출하는 입력 데이터 추출부; 및 추출된 상기 데이터를 입 력하여 상기 유저가 방문 가능성이 높은 장소를 방문 장소로 선택하는 예측 모델을 포함하고, 상기 방문 장소를 기반으로 라이프로깅 서비스를 제공할 수 있다."}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면 빅데이터 및 지오태깅을 이용하여 사진에 기록되어 있는 메타 정보를 활용하여 방 문장소를 자동으로 태깅함으로써, 빠르게 라이프로깅 데이터를 생성하고, 유저의 과거 방문이력에 대한 라이프 로깅의 시간적 범위를 확장할 수 있는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼 및그 동작 방법을 제공할 수 있다. 또한, 본 발명의 실시예들에 따르면 라이프로깅을 바탕으로 개별 장소 단위의 하이퍼로컬 커뮤니티를 연결하는 메타버스 서비스를 제공함으로써, 물리적 거리가 아닌 정서적 거리에 기반한 강한 유대감을 형성할 수 있는 인 공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼 및 그 동작 방법을 제공할 수 있다."}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 실시예들을 설명한다. 그러나, 기술되는 실시예들은 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 이하 설명되는 실시예들에 의하여 한정되는 것은 아니다. 또한,"}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여러 실시예들은 당해 기술분야에서 평균적인 지식을 가진 자에게 본 발명을 더욱 완전하게 설명하기 위해서 제 공되는 것이다. 도면에서 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 안드로이드 기반으로 Wi-Fi 실내 측위 기술이 적용되어 유저가 방문한 정확한 장소를 백그라운드 위치 정보를 활용하여 자동으로 기록하고, 같은 장소를 방문한 유저 간 실시간 대화 및 친구 연결 기능을 제공할 수 있다. 그러나, 안드로이드 OS 정책 상 백그라운드 위치 권한 사용에 대한 사용자 동의 절차가 강화되어, Wi-Fi 실내 측위 기술로 라이프로깅이 이루어지는 사용자는 소수에 불과(전체 유저의 5% 수준)하다. 또한, 모바일 디바이 스 센서를 활용한 Wi-Fi 실내 측위 기술과 GPS(Global Positioning System)의 경우 정밀도(precision) 및 리콜 (recall) 성능 한계로 인한 방문 장소 오인식 또는 누락이 발생한다. 그리고, 지역 커뮤니티나 다른 유저와의 상호작용을 위한 전제가 되는 라이프로깅 데이터 축적까지 서비스 개시 이후 상당 기간이 소요되어 가입 초기 유저 이탈이 발생될 수 있다. 이에 따라 모바일 디바이스의 실시간 위치 정보만으로는 모바일 플랫폼 서비스 설치 이후부터의 기록은 가능하 나 서비스 설치 이전 유저의 라이프로깅 데이터 확보를 위해서 디바이스에 저장된 사진의 메타 정보를 활용한 라이프로깅의 시간적 범위 확장이 필요하다. 아래의 본 발명의 실시예들은 인공지능 기반 지오태깅을 이용하여 유저가 현재 또는 과거에 방문한 장소들을 기 록하고, 같은 장소를 방문한 유저들을 연결하는 라이프로깅 모바일 플랫폼 및 그 동작 방법을 제공할 수 있다. 본 발명의 실시예들에 따르면 빅데이터 및 지오태깅을 이용하여 사진에 기록되어 있는 메타 정보를 활용하여 방 문장소를 자동으로 태깅함으로써, 빠르게 라이프로깅 데이터를 생성하고, 유저의 과거 방문이력에 대한 라이프 로깅의 시간적 범위를 확장할 수 있다. 이에 따라 과거의 사진 또는 영상이나 애플리케이션이 설치되기 이전의 사진 또는 영상들로 라이프로깅이 가능한 범위를 확장할 수 있다. 또한, 본 발명의 실시예들에 따르면 라이프로깅을 바탕으로 개별 장소 단위의 하이퍼로컬 커뮤니티를 연결하는 메타버스 서비스를 제공함으로써, 물리적 거리가 아닌 정서적 거리에 기반한 강한 유대감을 형성할 수 있다. 도 1은 일 실시예에 있어서 컴퓨터 시스템의 내부 구성의 일례를 설명하기 위한 블록도이다. 예를 들어, 본 발 명의 실시예들에 따른 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼이 도 1의 컴퓨터 시스템을 통해 구현될 수 있다. 도 1에 도시한 바와 같이, 컴퓨터 시스템은 인공지능 기반 지오태깅 을 이용한 메타버스 라이프로깅 모바일 플랫폼의 동작 방법을 실행하기 위한 구성요소로서 프로세서, 메모 리, 영구 저장 장치, 버스, 입출력 인터페이스 및 네트워크 인터페이스를 포함할 수 있다. 프로세서는 명령어들의 임의의 시퀀스를 처리할 수 있는 임의의 장치를 포함하거나 그의 일부일 수 있다. 프로세서는 예를 들어 컴퓨터 프로세서, 이동 장치 또는 다른 전자 장치 내의 프로세서 및/또는 디지털 프 로세서를 포함할 수 있다. 프로세서는 예를 들어, 서버 컴퓨팅 디바이스, 서버 컴퓨터, 일련의 서버 컴퓨 터들, 서버 팜, 클라우드 컴퓨터, 콘텐츠 플랫폼, 이동 컴퓨팅 장치, 스마트폰, 태블릿, 셋톱 박스, 미디어 플 레이어 등에 포함될 수 있다. 프로세서는 버스를 통해 메모리에 접속될 수 있다. 메모리는 컴퓨터 시스템에 의해 사용되거나 그에 의해 출력되는 정보를 저장하기 위한 휘발성 메모리, 영구, 가상 또는 기타 메모리를 포함할 수 있다. 메모리는 예를 들어 랜덤 액세스 메모리(Random Access Memory, RAM) 및/또는 동적 RAM(Dynamic RAM, DRAM)을 포함할 수 있다. 메모리는 컴퓨터 시스템 의 상태 정보와 같은 임의의 정보를 저장하는 데 사용될 수 있다. 메모리는 예를 들어 인공지능 기 반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼을 위한 명령어들을 포함하는 컴퓨터 시스템의 명령어들을 저장하는 데에도 사용될 수 있다. 컴퓨터 시스템은 필요에 따라 또는 적절한 경우에 하나 이 상의 프로세서를 포함할 수 있다. 버스는 컴퓨터 시스템의 다양한 컴포넌트들 사이의 상호작용을 가능하게 하는 통신 기반 구조를 포함 할 수 있다. 버스는 예를 들어 컴퓨터 시스템의 컴포넌트들 사이에, 예를 들어 프로세서와 메 모리 사이에 데이터를 운반할 수 있다. 버스는 컴퓨터 시스템의 컴포넌트들 간의 무선 및/또는 유선 통신 매체를 포함할 수 있으며, 병렬, 직렬 또는 다른 토폴로지 배열들을 포함할 수 있다. 영구 저장 장치는 (예를 들어, 메모리에 비해) 소정의 연장된 기간 동안 데이터를 저장하기 위해 컴 퓨터 시스템에 의해 사용되는 바와 같은 메모리 또는 다른 영구 저장 장치와 같은 컴포넌트들을 포함할 수 있다. 영구 저장 장치는 컴퓨터 시스템 내의 프로세서에 의해 사용되는 바와 같은 비휘발성 메 인 메모리를 포함할 수 있다. 영구 저장 장치는 예를 들어 플래시 메모리, 하드 디스크, 광 디스크 또는 다른 컴퓨터 판독 가능 매체를 포함할 수 있다. 입출력 인터페이스는 키보드, 마우스, 음성 명령 입력, 디스플레이 또는 다른 입력 또는 출력 장치에 대한 인터페이스들을 포함할 수 있다. 구성 명령들 및/또는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼을 위한 데이터가 입출력 인터페이스를 통해 수신될 수 있다. 네트워크 인터페이스는 근거리 네트워크 또는 인터넷과 같은 네트워크들에 대한 하나 이상의 인터페이스를 포함할 수 있다. 네트워크 인터페이스는 유선 또는 무선 접속들에 대한 인터페이스들을 포함할 수 있다. 구성 명령들 및/또는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼을 위한 데이터는 네 트워크 인터페이스를 통해 수신될 수 있다. 또한, 다른 실시예들에서 컴퓨터 시스템은 도 1의 구성요소들보다 더 많은 구성요소들을 포함할 수도 있다. 도 2는 일 실시예에 따른 컴퓨터 시스템의 프로세서가 포함할 수 있는 구성요소를 나타내는 블록도이고, 도 3a 은 일 실시예에 따른 컴퓨터 시스템이 수행할 수 있는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼의 동작 방법을 나타내는 흐름도이다. 또한, 도 3b은 일 실시예에 따른 컴퓨터 시스템이 수행할 수 있는 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 방법을 나타내는 흐름도이다. 도 2에 도시된 바와 같이, 프로세서는 방문 장소 체크인부, 커뮤니티 공간 제공부 및 친구 맺기 제공부을 포함하여 이루어질 수 있다. 또한, 방문 장소 체크인부는 위치 정보 판단부, POI 후보 목록 도출부, 입력 데이터 추출부, 예측 모델 및 예측 모델 학습부를 포함할 수 있으며,실시예에 따라 관심지점(POI) 데이터베이스를 더 포함할 수 있다. 여기서 프로세서는 인공지능 기반 지오 태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼으로 언급될 수 있다. 이러한 프로세서의 구성요소들은 적어도 하나의 프로그램 코드에 의해 제공되는 제어 명령에 따라 프로세서에 의해 수행되는 서로 다른 기 능들(different functions)의 표현들일 수 있다. 예를 들어, 프로세서가 유저가 방문한 장소를 자동 또는 수동으로 체크인 하도록 컴퓨터 시스템을 제어하기 위해 동작하는 기능적 표현으로서 방문 장소 체크인부 가 사용될 수 있다. 프로세서 및 프로세서의 구성요소들은 도 3a의 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼의 동작 방법이 포함하는 단계들(S310 내지 S340)을 수행할 수 있다. 예를 들어, 프로세서 및 프로세서의 구성요소들은 메모리가 포함하는 운영체제의 코드와 상술한 적어도 하나의 프로그램 코드에 따른 명령(instruction)을 실행하도록 구현될 수 있다. 여기서 적어도 하나의 프로그램 코드는 상기 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼의 동작 방법을 처 리하기 위해 구현된 프로그램의 코드에 대응될 수 있다. 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼의 동작 방법은 도시된 순서대로 발생하지 않을 수 있으며, 단계들 중 일부가 생략되거나 추가의 과정이 더 포함될 수 있다. 단계(S310)에서, 방문 장소 체크인부는 유저가 방문한 장소를 자동 또는 수동으로 체크인할 수 있다. 방문 장소 체크인부는 빅데이터 및 지오태깅을 이용하여 사진에 기록되어 있는 메타 정보를 활용하여 방문한 장 소를 자동으로 태깅함에 따라 라이프로깅 데이터를 생성할 수 있다. 단계(S320)에서, 커뮤니티 공간 제공부는 유저가 방문한 장소와 동일한 장소를 방문한 유저들 간 커뮤니티 공간을 제공할 수 있다. 커뮤니티 공간 제공부는 유저가 방문한 장소로 설정되는 장소에서 사진 또는 영상 을 업로드하거나 게시글을 작성할 수 있다. 단계(S330)에서, 친구 맺기 제공부는 유저와 다른 유저가 공통으로 방문한 장소의 목록을 비교하여 관심사 일치 여부를 판단할 수 있다. 단계(S340)에서, 친구 맺기 제공부는 유저와 다른 유저 사이에 관심사가 일치하는 경우 유저에게 친구 맺 기 신청을 제공할 수 있다. 실시예에 따라 방문 장소 체크인부는 위치 정보 판단부, POI 후보 목록 도출부, 입력 데이터 추 출부, 예측 모델 및 예측 모델 학습부를 포함할 수 있으며, 실시예에 따라 관심지점(POI) 데이 터베이스를 더 포함할 수 있다. 단계(S311)에서, 위치 정보 판단부는 유저가 현재 또는 과거에 촬영한 사진 또는 영상의 메타 정보를 통해 촬영된 위치 정보를 파악할 수 있다. 일례로, 위치 정보 판단부는 현재 또는 과거에 촬영한 사진 또는 영상에 접근하여 메타 정보를 획득할 수 있는 경우, 메타 정보를 기반으로 과거의 라이프로그를 기록할 수 있다. 다른 예로, 위치 정보 판단부는 현재 또는 과거에 촬영한 사진 또는 영상에 접근하여 메타 정보를 획득할 수 없는 경우, 유저의 단말에 저장된 메시지 기록, 결제 내역 및 유저의 동선 중 적어도 어느 하나 이상의 정보를 이용하여 촬영된 위치 정보 및 시 간 정보를 파악한 후, 촬영된 위치 정보를 기반으로 과거의 라이프로그를 기록할 수 있다. 예를 들어, 과거의 사진의 메타 정보가 시간 정보만을 포함한 경우, 그 시간 정보에 대응하는 유저의 단말에 저장된 메시지 기록 또는 결제 내역을 통해 위치 정보를 획득할 수 있다. 이 때, 유저의 단말에 저장된 메시지 기록, 결제 내역 및 유저의 동선뿐 아니라, 유사한 시간에 촬영된 다른 사진의 위치 정보 등 사진이 촬영된 위치 정보를 알 수 있는 기록이면 추가적으로 사용할 수 있으며, 추가 정보의 사용은 유저의 동의 여부에 따라 이용하도록 설정할 수 있 다. 한편, 지오태깅 및 장소 분석을 위한 관심지점(POI) 데이터를 저장하는 관심지점(POI) 데이터베이스를 더 포함 할 수 있다. 이에 따라 관심지점(POI) 데이터베이스를 기반으로 관심지점(POI)의 후보 목록을 도출할 수 있다. 단계(S312)에서, POI 후보 목록 도출부는 사진 또는 영상의 메타 정보 또는 GPS를 통해 파악된 위치 정보 로부터 소정 거리 이내에 존재하는 관심지점(Point of Interest, POI)의 후보 목록을 도출할 수 있다. 예를 들 어, 유저의 GPS 좌표 또는 사진 또는 영상의 위치 정보를 기준으로 반경 100m 이내에 존재하는 POI 목록 long- list를 도출할 수 있다.단계(S313)에서, 입력 데이터 추출부는 도출된 관심지점(POI)의 후보 목록에서 디바이스 센서로부터 수집 된 정보, 장소 관련 정보 및 유저의 과거 방문 히스토리 중 적어도 어느 하나 이상의 데이터를 추출할 수 있다. 여기서, 유저의 과거 방문 히스토리는 유저의 단말에 저장된 사진 또는 영상에 포함된 메타 정보를 활용하여 방 문 장소를 자동으로 지오태깅하여 획득할 수 있다. 또한, 유저가 남긴 게시글의 텍스트에서 장소명이나 장소를 유추할 수 있는 키워드를 추출해서 관심지점(POI)의 정보를 파악할 수 있다. 이 때, 유저가 남긴 게시글은 라 이프로깅 모바일 플랫폼 서비스를 제공하는 애플리케이션을 통해 수집할 수 있으며, 실시예에 따라 유저가 허용 한 다른 애플리케이션 또는 웹을 통해 수집할 수도 있다. 단계(S314)에서, 예측 모델은 추출된 데이터를 입력하여 유저가 방문 가능성이 높은 장소를 방문 장소로 선택할 수 있다. 예측 모델은 Logistics regression, Neural network 등의 방법론을 활용하여 유저의 방 문 가능성이 높은 장소를 선택할 수 있다. 예컨대, 예측 모델은 사진 또는 영상의 위치 정보와 관심지점 (POI)의 후보 목록의 속성 정보를 이용하여 다른 유저의 사진 또는 영상을 포함한 빅데이터를 기반으로 방문 장 소를 선택할 수 있다. 이에 따라 방문 장소를 기반으로 라이프로깅 서비스를 제공할 수 있다. 단계(S315)에서, 예측 모델 학습부는 유저의 피드백을 바탕으로 예측 모델을 학습시킬 수 있다. 보다 구 체적으로, 예측 모델 학습부는 유저가 예측 모델을 통해 선택된 장소를 수정하는 경우 거짓(False) 값으로 판별하고, 장소를 수정하지 않는 경우 참(True) 값으로 판별하여 예측 모델을 학습시킬 수 있다. 이와 같이, 실시예들에 따르면 지오태깅을 통한 라이프로깅 기능을 제공할 수 있으며, 특히 사용자 단말에 저장 된 이미지 정보를 활용하여 서비스 이용 시점 이전 기록에 대한 라이프로깅 기간을 확장할 수 있다. 또한, 실시예들에 따르면 서비스 사용성을 강화시킬 수 있으며, 정확한 방문 장소에 대한 지오태깅 기능을 통해 라이프로깅 기능의 편의성 및 정확도를 향상시킬 수 있다. 도 4는 본 발명의 일 실시예에 따른 메타버스 라이프로깅 모바일 플랫폼을 설명하기 위한 도면이다. 도 4를 참조하면, 유저가 방문한 장소들을 기록하고, 같은 장소를 방문한 유저들을 연결하는 메타버스 라이프로 깅 모바일 플랫폼이 제공될 수 있다. 예를 들어 모바일 디바이스의 실시간 위치 정보와 저장된 사진 의 메타 정보를 활용하여 유저가 방문한 장소를 자동으로 “체크인” 형태로 라이프로깅 할 수 있다. 또한, 같은 장소를 방문한 유저들 간 실시간 오픈 채팅으로 모바일 플랫폼 상에서 공통 관심사 기반의 하 이퍼로컬 커뮤니티를 형성할 수 있다. 실시예들은 라이프로깅의 대상인 ‘장소’를 매개로 하이퍼로컬 서비스 영역을 아우르는 메타버스 서비스를 제 공할 수 있다. 특히, 실시예들은 동네 또는 물리적인 거리가 아니라, 잠실 야구장, xx 대학교, 동네 카페 등과 같이 특정 개별 장소를 중심으로 메타버스 서비스를 제공할 수 있다. 이에 따라 물리적 거리가 아닌 정서적 거 리에 기반한 강한 유대감을 형성할 수 있다. 도 5는 본 발명의 일 실시예에 따른 사진에 저장된 메타 정보를 활용한 라이프로깅을 설명하기 위한 도면이다. 도 5를 참조하면, 모바일 디바이스에 저장된 사진에 기록되어 있는 메타 정보를 활용하여 방문장소를 자동 으로 태깅하는 방식(즉, 지오태깅)으로 가입 초기 빠르게 라이프로깅 데이터를 생성하고, 유저의 과거 방 문이력에 대한 라이프로깅의 시간적 범위를 확장하여 서비스의 사용 가치를 증대시킬 수 있다. 이를 위해, 일 실시예에 따르면 사진이 찍힌 GPS 좌표와 주변 POI(Point of Interest) 속성 정보를 기반으로 유 저가 방문한 장소를 자동으로 선택하는 인공지능 예측 모델을 제공할 수 있으며, 머신 러닝을 활용하여 지오태 깅 성능을 지속적으로 향상시킬 수 있다. 따라서 실시예들에 따르면 방문하는 장소마다 애플리케이션(앱)을 실행하는 불편함 없이 자동으로 동선이 기록 되는 라이프로깅 메타버스 서비스를 제공할 수 있다. 또한, 실시예들에 따르면 모바일 디바이스 센서가 아닌 빅데이터와 지오태깅을 활용한 라이프로깅을 통해 유저의 현재와 과거를 포함하는 라이프로깅 기술을 제공할 수 있다. 또한, 실시예들에 따르면 라이프로깅을 바탕으로 개별 장소 단위의 하이퍼로컬 커뮤니티를 연결하는 메 타버스 서비스를 제공할 수 있다. 도 6은 본 발명의 일 실시예에 따른 지오태깅 예측 모델을 통한 라이프로깅 모바일 플랫폼의 구성을 설명하기 위한 도면이다. 도 6을 참조하면, 먼저, 단말을 통해 획득되는 위치 정보 또는 사진(영상)의 메타 정보를 자동으로 태깅하 여 위치 정보를 파악할 수 있다. 라이프로깅 모바일 플랫폼은 파악된 위치 정보를 이용하여 주변 장소 목 록을 추출하고, 유저의 라이프로깅 데이터를 이용하여 예측 모델을 통해 방문 장소를 추정할 수 있다. 이에 따라 추정된 방문 장소를 이용하여 라이프로깅 서비스를 제공할 수 있다. 아래에서 일 실시예에 따른 지오태깅 예측 모델을 통한 라이프로깅 모바일 플랫폼의 구성을 보다 상세히 설명한 다. 일 실시예에 따르면 지오태깅 및 장소 분석을 위한 POI DB를 구축할 수 있다. 여기서, 지오태깅 및 장소 분석 을 위한 POI 데이터 수집 항목을 정할 수 있으며, 예를 들어 [표 1]과 같이 POI 데이터 수집 항목을 정할 수 있 다. [표 1]"}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "DB를 구축하기 위해 웹 크롤링(Web Crawling), 정부지원 데이터바우처 사업 지원 등을 통한 데이터 구매 등의 방법을 이용할 수 있다. 또한, 인공지능 기반 지오태깅 기능의 구현을 위한 예측 모델을 제공할 수 있다. 도 7은 본 발명의 일 실시예 에 따른 인공지능 기반 지오태깅 서비스의 구성을 설명하기 위한 도면이다. 도 7을 참조하면, 본 발명의 일 실시예에 따른 인공지능 기반 지오태깅 서비스를 제공할 수 있으며 이를 위해 예측 모델을 제공할 수 있다. 먼저, 유저의 GPS 좌표를 기준으로 반경 100m 이내에 존재하는 POI의 후보 목록(POI long-list)을 도출할 수 있다. POI의 후보 목록으로부터 디바이스 센서로부터 수집된 정보, 장소 관련 평균적인 방문자 수, 업종, 운영시간 등의 정보, 해당 유저의 과거 방문 히스토리 등 예측 모델의 입력(input)이 되는 데이터를 추출할 수 있다. 그리고, Logistics regression, Neural network 등의 방법론을 활용하여 유저의 방문 가능성이 높은 장소를 선택하는 예측 모델을 제공할 수 있다. 여기서, 유저의 피드백을 바탕으로 유저가 해당 장소를 수정하는 경우 False 값으로 판별하고, 해 당 장소 그대로 등록하는 경우 True 값으로 판별하여 예측 모델의 정확도를 향상할 수 있는 학습 모델을 제공할 수 있다. 또한, 라이프로깅 모바일 플랫폼 서비스를 제공하는 서버 및 DB를 구축할 수 있다. 예를 들어, 라이프로깅 모 바일 플랫폼 서비스를 제공하는 클라우드 DB 서버를 구축하기 위해 구글 클라우드 플랫폼(Google Cloud Platform) 상의 컴퓨팅 엔진(Computing Engine) 서버를 구축하고 SQL DB를 통한 데이터를 축적할 수 있다. 또 한, Autoscaling, Load balancer, Docker 등을 사용하여 트래픽 증가에 대비한 유연한 서버를 구성할 수 있다. 그리고 클라우드 보안을 위한 Firewall 및 whitelist 방식의 IP를 관리할 수 있다. 그리고, 라이프로깅 모바일 플랫폼 서비스를 위한 REST API를 제공할 수 있다. 예를 들어, 라이프로깅 모바일 플랫폼 서비스를 위한 REST API를 제공하기 위해 Node.js, typescript 언어를 기반으로 nest.js framework를 활용하여 Rest API를 제공할 수 있다. 또한, JWT 토큰(token)을 활용한 보안 인증 기능을 구현할 수 있다. 인 증 토큰(Authentication token)과 리프레쉬 토큰(Refresh token)을 통해 보안성과 사용성을 동시에 추구할 수 있다. 그리고 Swagger를 활용하여 RESTful API를 체계적으로 관리할 수 있다.라이프로깅 모바일 플랫폼 서비스를 제공하는 애플리케이션을 제공할 수 있으며, 예컨대 라이프로깅 모바일 플 랫폼 서비스 안드로이드 애플리케이션을 제공할 수 있다. 예를 들어, 라이프로깅 모바일 플랫폼 서비스 안드로 이드 애플리케이션을 제공하기 위 Kotlin 언어를 활용하여 안드로이드 네이티브 앱을 제공하고, Clean Architecture 기반으로 Dagger2(Hilt), Retrofit, Kotlinx, Serialization, Coil을 조합한 프레임워크를 활용 할 수 있다. 또한, 지도 UI 구현을 위한 NAVER Maps SDK, 장소 검색을 위한 NAVER Place API, 채팅을 위한 Sendbird SDK, Notification 기능 구현을 위한 Firebase FCM 등 외부 라이브러리를 활용할 수 있다. 도 8은 일 실시예에 따른 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼의 동작 방법의 예시를 설명하기 위한 도면이다. 도 8을 참조하면, 유저가 사용자 단말을 이용하여 라이프로깅 모바일 플랫폼 서비스가 제공되는 애플리케 이션에 접속한 후, 촬영된 사진을 업로드할 수 있다. 이 때, 촬영된 사진에 포함된 시간, 좌표 등의 메타 정보 를 통해 촬영된 위치 정보를 파악할 수 있으며, 파악된 위치 정보로부터 소정 거리 이내에 존재하는 관심지점 (POI)의 후보 목록을 도출할 수 있다. 이 때, 관심지점(POI)의 후보 목록은 유저의 관심 업종, 물리 적 거리, 장소의 인기도, 영업 시간 등을 고려하여 도출될 수 있다. 관심지점(POI)의 후보 목록에서 사용 자 단말에서 수집된 정보, 장소 관련 정보, 유저의 과거 방문 히스토리(이력) 등의 데이터를 추출할 수 있 으며, 방문 장소를 예측할 수 있는 예측 모델에 추출된 데이터를 입력하여 유저가 방문 가능성이 높은 장 소를 방문 장소로 선택할 수 있다. 이 때, 예측 모델은 애플리케이션 등에서의 유저의 게시글에 포함된 장소 정보, 자주 방문하는 업종, 과거 방문 히스토리 등 유저의 행동 데이터를 기반으로 유저가 방문 가능성이 높은 장소를 방문 장소로 선택할 수 있다. 이상과 같이, 실시예들에 따르면 라이프로깅을 위한 지오태깅 기능을 활용하여 유저 개인의 디지털 저널 (Journal) 서비스로 활용할 수 있고, 장소를 중심으로 하는 관심사 기반의 동호회 등 하이퍼로컬 커뮤니티 유저 들을 위한 플랫폼을 제공할 수 있다. 또한, 지역 소상공인 점주의 지역 유저 대상으로 직접 커뮤니케이션 채널 을 제공할 수 있으며, 예컨대. 매장 관련 실시간 채팅방을 통한 점주와 고객 간 소통이 가능하다. 실시예들은 모바일 디바이스 위치 센서를 활용한 측위를 통해 라이프로깅 기술 영역을 확장하였고, POI 빅데이 터와 지오태깅 예측 모델을 결합한 라이프로깅으로 기술 영역을 확대하였다. 또한, 실시예들은 장소 POI 데이 터 수집 기법에 대한 고도화 및 학습 모델을 활용한 예측 모델의 역량을 강화시켰다. 또한, 실시예들은 모바일 애플리케이션 기반의 라이프로깅 서비스 전반의 활성화에 기여하였고, 오프라인 관심 사 커뮤니티를 온라인으로 활성화시켰다. 모바일 앱을 통해 같은 장소를 기반으로 관심사를 공유하는 사람들 간의 커뮤니티를 활성화(예컨대, 아파트의 맘 카페, 골프장/테니스장 등의 운동 동호회, 대학/학원 등의 스터티 그룹 등)할 수 있다. 더욱이, 실시예들은 디지털 마케팅에서 소외되어 있던 소상공인 점주들이 손쉽게 접근할 수 있는 지역 마케팅 기회를 제공하고, 매장 단골 고객과의 실시간 채팅 등을 통한 단골고객관리 CRM Tool 역할 을 할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 컨트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로(collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터 는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다."}
{"patent_id": "10-2022-0057360", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2022-0057360", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 있어서 컴퓨터 시스템의 내부 구성의 일례를 설명하기 위한 블록도이다. 도 2는 일 실시예에 따른 컴퓨터 시스템의 프로세서가 포함할 수 있는 구성요소를 나타내는 블록도이다. 도 3a은 일 실시예에 따른 컴퓨터 시스템이 수행할 수 있는 인공지능 기반 지오태깅을 이용한 메타버스 라이프 로깅 모바일 플랫폼의 동작 방법을 나타내는 흐름도이다. 도 3b은 일 실시예에 따른 컴퓨터 시스템이 수행할 수 있는 인공지능 기반 지오태깅을 이용한 메타버스 라이프 로깅 방법을 나타내는 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 메타버스 라이프로깅 모바일 플랫폼을 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 사진에 저장된 메타 정보를 활용한 라이프로깅을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에 따른 지오태깅 예측 모델을 통한 라이프로깅 모바일 플랫폼의 구성을 설명하기 위한 도면이다. 도 7은 본 발명의 일 실시예에 따른 인공지능 기반 지오태깅 서비스의 구성을 설명하기 위한 도면이다. 도 8은 일 실시예에 따른 인공지능 기반 지오태깅을 이용한 메타버스 라이프로깅 모바일 플랫폼의 동작 방법의 예시를 설명하기 위한 도면이다."}
