{"patent_id": "10-2017-7006763", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0086017", "출원번호": "10-2017-7006763", "발명의 명칭": "지능형 유체 여과 관리 시스템", "출원인": "워터 플래닛, 아이엔씨.", "발명자": "회크 에릭 엠.브이."}}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "방법으로서,여과 시스템의 하나 이상의 막과 연관된 하나 이상의 파라미터를 모니터링하는 단계;모니터링된 상기 하나 이상의 파라미터에 기초하여 상기 하나 이상의 여과기의 상태를 결정하는 단계; 및결정된 상기 상태에 기초하여 하나 이상의 유지보수 절차를 수행하는 단계를 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 모니터링하는 단계는 상기 여과 시스템 전체의 평균으로서 또는 개별적인 여과기 파울링의공간 변이성을 검출하기 위해, 상기 여과기 시스템 내 로컬 성능 파라미터들을 모니터링함으로써 수행되는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 하나 이상의 파라미터는 트랜스여과기 압력 강하, 여과액 유동률, 여과액 탁도, 여과액 염도, 여과액 pH, 여과액 색상, 여과액 경도, 여과액 총 유기물 농도, 여과액 세균 수, 공급액 세균 수, 하나 이상의 미리 정의된 여과액, 공급액, 또는 농축 이온의 농도, 및 하나 이상의 미리 정의된 여과액, 공급액,또는 농축 비-이온 분자의 농도 중 하나 이상을 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서, 모니터링되는 상기 하나 이상의 파라미터는 전단부(유입), 후단부(농축 또는 거부) 및 여과액(또는 투과)에서 모니터링되고, 공급측 및 여과측 양자의 파라미터들은 모든 위치에서 모니터링되는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 모니터링된 상기 하나 이상의 파라미터에 기초하여 상기 하나 이상의 여과기의 상태를 결정하는 단계는 모니터링된 상기 하나 이상의 파라미터에 기초하여 통계적 분석을 수행하는 단계를 포함하는,방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 상기 하나 이상의 여과기의 상기 상태는 다가올 여과기 숙도 또는 여과 준비 상태, 검출된여과기 숙도 또는 여과 준비의 상태, 다가올 무결성 침해, 검출된 무결성 침해, 다가올 투과성 손실, 및 검출된투과성 손실 중 하나 이상을 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서, 상기 하나 이상의 유지보수 절차는 여과기 세정 절차, 여과기 분리 절차, 여과기 수리절차, 여과기 교체 절차, 및 여과기 고정 절차 중 하나 이상을 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "에 있어서,선택된 상기 세정 프로토콜에 따라 세정 절차를 수행하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서, 여과액 처리량의 변화를 모니터링하는 단계는 미리 정의된 시간 기간 동안 여과액 흐름을측정하는 단계를 포함하고, 압력의 변화를 모니터링하는 단계는 미리 정의된 시간 기간 동안 압력을 측정하는단계를 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 8에 있어서, 파울링 메커니즘을 결정하는 단계는 하나 이상의 미리 결정된 파울링 모델에 기초하여 상기여과액 흐름의 변화 또는 상기 압력의 변화에 대한 수학적 분석을 수행하는 단계를 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 8에 있어서, 상기 파울링 메커니즘은 농도 분극, 화학 활성 분자들의 유기물 흡착, 염 및 수산화물의 석출로 인한 계층 구조, 큰 현탁 입자 또는 작은 콜로이드 입자의 침전으로 인한 케이크 및 구멍 차단, 비활성 거대분자의 침전으로 인한 겔 형성, 및 생리 활성 유기체들의 침전 및 생장으로 인한 미생물-파울링 중 하나 이상을 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 8에 있어서, 상기 하나 이상의 미리 결정된 파울링 모델은 헤르미아(Hermia) 모델, 변형된 헤르미아 모델, 및 직렬 여과 저항(resistance-in-series) 모델 중 하나 이상을 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 8에 있어서, 상기 세정 프로토콜을 선택하는 단계는 세정 방법을 선택하는 단계 및 상기 세정 방법과 연관된 하나 이상의 파라미터를 포함하는, 방법."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "시스템으로서,제1 챔버 및 제2 챔버 간에 흐르는 유체 상에 압력을 인가하도록 구성된 압력 펌프;상기 제1 챔버 및 제2 챔버 간에 놓여진 막에 걸쳐 흐르는 유체와 연관된 적어도 하나의 파라미터를 결정하도록구성된 흐름 센서; 상기 제1 챔버에서 상기 제2 챔버로 흐르는 상기 유체의 압력 판독치를 결정하도록 구성된 압력 센서; 및여과 관리 시스템으로서,상기 압력 펌프가 상기 압력 판독치에 기초하여 제1 미리 결정된 시간 동안 상기 제1 챔버에서 상기 제2 챔버로상기 막에 걸쳐 흐르는 유체 상에 정압을 인가하게 하도록, 그리고상기 압력 펌프가 제2 미리 결정된 시간 동안 상기 적어도 하나의 파라미터에 기초하여 상기 막에 걸친 유체의상기 흐름을 반전시키게 하도록 구성된, 상기 여과 관리 시스템을 포함하는, 시스템."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서, 상기 압력 펌프가 상기 적어도 하나의 파라미터에 기초하여 상기 막에 걸친 유체의 상기흐름을 반전시키게 하는 것은 상기 적어도 하나의 파라미터를 적어도 하나의 임계값과 비교하는 것을 포함하는,시스템."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서, 상기 정압을 가하는 시간을 조절하는 것 및 상기 정압을 반전시키는 시간을 조절하는 것공개특허 10-2017-0086017-4-중 적어도 하나를 위해 구성된 타이머를 더 포함하는, 시스템."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 16에 있어서, 상기 적어도 하나의 파라미터는 유체 흐름 속도, 유체 흐름 속도의 변화율, 미리 정의된시간 기간 동안 상기 막을 통하는 유체 투과 용적 중 하나 이상인, 시스템."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서, 상기 제1 미리 결정된 시간 및 상기 제2 미리 결정된 시간 중 하나 이상은 상수 값인, 시스템."}
{"patent_id": "10-2017-7006763", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 16에 있어서, 상기 제1 미리 결정된 시간 및 상기 제2 미리 결정된 시간 중 하나 이상은 미리 정의된 식에 기초하여 결정되는, 시스템."}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "여과 시스템은 제1 챔버 및 제2 챔버 간에 흐르는 유체 상에 압력을 인가하도록 구성된 압력 펌프를 포함할 수 있다. 여과 시스템은 또한 제1 챔버 및 제2 챔버 간에 놓여진 막에 걸쳐 흐르는 유체와 연관된 적어도 하나의 파 라미터를 결정하도록 구성된 흐름 센서를 포함할 수 있다. 여과 시스템은 제1 챔버에서 제2 챔버로 흐르는 유체 의 압력 판독치를 결정하도록 구성된 압력 센서를 포함할 수 있다. 여과 시스템은 압력 펌프가 압력 판독치에 기 초하여 제1 미리 결정된 시간 동안 막에 걸쳐 흐르는 유체 상에 정압을 인가하게 하도록 구성된 여과 관리 시스 템을 포함할 수 있다. 여과 관리 시스템은 압력 펌프가 제2 미리 결정된 시간 동안 적어도 하나의 파라미터에 기 초하여 막에 걸친 유체 흐름을 역전시키게 하도록 구성될 수 있다."}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 2014년 8월 12일에 출원된 \"십자류 막 시스템들을 위한 지능형 유량 관리 시스템\"이라는 명칭의 미국 가 출원 일련번호 62/036,344 및 2015년 4월 10일에 출원된 \"지능형 유체 여과 관리 시스템\"이라는 명칭의 미국 가 출원 일련번호 62/145,793의 우선권을 주하며, 각 출원의 내용은 이에 의해 참조로 통합된다."}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "실제로, 여과는 다음 6개의 분리 카테고리로 광범위하게 분류될 수 있다: 고체-기체, 고체-액체, 고체-고체, 액 체-액체, 기체-액체, 및 기체-기체. 여과 기술들은 광범위한 공정 적용예, 이를테면 자동차 및 우주 항공기 연 료 및 공기 여과, 가정용 및 산업용 공기 여과, 식품 및 음료 농도 및 살균, 약제학적 분자 분리 및 정제, 신장 투석 및 혈액 산화와 같은 의료 치료법, 식수 처리, 산업 공정용 정수, 뿐만 아니라 폐기물 처리 및 환경 복원 에서 오염물 및 부가 가치 물질을 분리하기 위해 사용된다. 예를 들어, 여과는 크기별 배제, 선택적 흡착 및 대 규모 확산에 의해 완전하게 그리고 지속적으로 불순물을 여과할 수 있는 그것의 능력으로 인해 정수를 위해 가 장 중요하고 폭넓게 사용되는 방법이다(Howe 및 G. Tchobanoglous, Water Treatment: Principles and Design, John Wiley & Sons, Inc., Hoboken, New Jersey, 2판, 2005). 거의 모든 자치 도시 및 산업용 수처리 및 폐수 처리 시설, 대부분의 지하수 처리 시설, 그리고 크고 작은 담수화 시설은 문제가 되는 물질, 이를테면 미생물, 점토, 침전물, 기름, 및 다른 유기성 및 무기성 용질의 제거를 위해 몇몇 형태의 여과를 채용한다(Crittenden, J. 외 Water Treatment: Principles and Design, MWH, Hoboken, NJ, USA). 일반적으로, 유체 여과는 상대적인 분리 매체 통과율에 의해 물에서 타겟 현탁 및 용존 고형물을 분리 및 제거 하게 된다. 유체 여과 시스템들은 대부분 공통적으로 다음 처리 기술들을 채용한다: 입상 매체 여과(예를 들어, 모래, 무연탄, 석류석, 견과 껍질, 부직포, 및 다른 무반응 폐 바이오매스), 이온 교환 매체 여과, 흡착 매체 여과(예를 들어, 입상 활성탄 또는 GAC, 제올라이트, 폴리머 및 유기점토), 반응 매체 여과(예를 들어, 녹사 산 화 여과, 미생물-모래 여과, 미생물-GAC 여과), 저압막 여과(예를 들어, 미세 여과 및 초미세 여과), 고압막 여 과(예를 들어, 나오 여과 및 역삼투). 대부분의 여과 공정들은 필터 매체 상의 또는 그 안의 제거된 물질의 축적으로 인해 제약된다. 예를 들어, 막이 물 시료에서 불순물을 여과하기 위해 사용될 때, 막이 무기성 미립자, 유기성 물질, 및/또는 생물학적 미생물에 의해 막히거나 \"파울링\"되게 되기 때문에 유량은 시간이 지남에 따라 점진적으로 감소할 것이다. 막 파울링 결 과 보통 유량 또는 처리량이 극심하게 감소되고, 공정 효율 및 생성되는 물의 질에 영향을 미치게 된다. 실제로, 여과기 막힘 및 그것의 완화는 여과 수질에 미치는 극적인 영향, 타겟 여과 처리량 유지, 에너지 효율 및 여과기 손상으로 인해 여과 기술들의 운용상 주요 과제로 남아 있다. 여과기 막힘은 여과 동안 일어나는 불가피한 현상이나, 완전한 교체가 요구되기 전 정기적인 유지보수 계획들에 의해 완화될 수 있다. 구체적으로, 유량 유지 기술들은 여과기 상의 또는 그것 내의 가역 파울런트 및 침전물을 제거함으로써 그리고/또는 그것의 장래 침전을 억제함으로써 여과액 유량을 회복시키기 위해 구현되는 시스템 공정들로서 정의될 수 있다. 일반적인 유지보수 계획들은 기계적 그리고 화학적 세정, 이를테면 여과액 역세척및 현장 화학적 세정의 가변 형태들(예를 들어, 부식제, 산화제/살균제, 산성물, 킬레이트화제, 및 계면활성 제)을 포함한다(Liu, C. 외 Membrane Chemical Cleaning: From Art to Science, Pall Corporation, Port Washington, NY 11050, USA). 그러나, 각 유지보수 반응은 시스템 중단 시간을 증가시키고, 상품화된 여과 액 산물을 소비함으로써, 깂비싼 세정 화학물을 소비함으로써, 그리고 거친 세정 방법들을 통해 여과기에 손상 을 입힘으로써 공정 효율에 부정정 영향을 미칠 수 있다. 현재, 이러한 여과기 보수 기술들은 미리 결정된 설계 기준들- 빈도, 세기 및 지속 기간-을 이용하여 구현되고, 소정의 여과 공정 내 공간적 및 시간적 변화에 실시간 으로 적응할 수가 없다. 따라서, 유지보수 반응을 최적화하고 운영 에너지 소요 및 라이프 사이클 성능에 미치 는 여과기 오염물의 영향을 최소화하도록 여과-기반 공정들을 운영하기 위한 적응적 공정 제어 기술들이 필요하 다. 상당한 노력은 기한이 만료된 여과기들의 제거 및 교체에 대응하는 것과 연관되고 상당한 시스템 중단 시간 및 비용을 야기할 수 있다. 여과기 모듈, 여과기 매체, 이온 교환 수지, 또는 입상 활성탄의 유효 라이프타임은 소 정의 처리 목적을 위한 고유의 환경 조건 및 수질에 기초하여 위치-특이적이다. 따라서, 시설 효율을 최대화하 려면 소정의 적용예에서의 모듈(들)의 특정 성능과 직접 연관된 정보에 기초하여 상기 모듈(들)의 유효 수명을 예측할 필요가 있다. 이러한 그리고 다른 결점들이 본 발명에서 해결된다. 다음 일반적인 설명 및 다음 상세한 설명 양자는 청구된 바와 같이, 단지 대표적이고 설명하기 위한 것이고 제 한하는 것이 아니라는 것이 이해되어야 한다. 지능형 유체 여과 관리를 위한 방법들 및 시스템들이 제공된다. 방법들 및 시스템들은 여과 시스템의 하나 이상의 막과 연관된 하나 이상의 파라미터를 모니터할 수 있다. 상기 하나 이상의 여과기의 상태는 상기 여과 시스템의 모니터링된 상기 하나 이상의 파라미터에 기초하여 결정될 수 있다. 상기 상태는 다가올 여과기 숙도 또는 여과 준비 상태, 검출된 여과기 숙도 또는 여과 준비의 상태, 다가 올 무결성 침해, 검출된 무결성 침해, 다가올 투과성 손실, 및 검출된 투과성 손실, 이들의 조합들 기타 같은 종류의 것 중 하나 이상을 포함할 수 있다. 하나 이상의 유지보수 절차가 결정된 상기 상태에 기초하여 수행될 수 있다. 상기 하나 이상의 유지보수 절차는 여과기 세정 절차, 여과기 여과기 분리 절차, 여과기 수리 절차, 여과기 교체 절차, 및 여과기 고정 절차 중 하나 이상을 포함할 수 있다. 일 측면에서, 여과 관리 시스템은 정압 운용 동안 유체 여과액 처리량의 변화 및 일정한 여과액 처리량 운용 동 안 압력의 변화 중 적어도 하나를 모니터링할 수 있다. 파울링 메커니즘은 상기 여과액 처리량의 변화 및 상기 압력의 변화 중 적어도 하나에 기초하여 결정될 수 있다. 상기 파울링 메커니즘은 하나 이상의 미리 결정된 파 울링 모델에 기초하여 상기 여과액 흐름의 변화 또는 상기 압력의 변화에 대한 수학적 분석을 수행함으로써 결 정될 수 있다. 상기 하나 이상의 미리 결정된 파울링 모델은 헤르미아(Hermia) 모델, 변형된 헤르미아 모델, 및 직렬 여과 저항 모델 중 하나 이상을 포함할 수 있다. 세정 프로토콜은 결정된 상기 파울링 메커니즘에 기초하 여 선택될 수 있다. 상기 세정 프로토콜은 세정 방법 및 상기 세정 방법과 연관된 하나 이상의 파라미터를 선택 하는 단계를 포함할 수 있다. 일 측면에서, 여과 시스템은 제1 챔버 및 제2 챔버 간에 흐르는 유체 상에 압력을 인가하도록 구성된 압력 펌 프를 포함할 수 있다. 상기 여과 시스템은 또한 상기 제1 챔버 및 제2 챔버 간에 놓여진 막에 걸쳐 흐르는 유체 와 연관된 적어도 하나의 파라미터를 결정하도록 구성된 흐름 센서를 포함할 수 있다. 상기 여과 시스템은 상기 제1 챔버에서 상기 제2 챔버로 흐르는 상기 유체의 압력 판독치를 결정하도록 구성된 압력 센서를 포함할 수 있 다. 뿐만 아니라, 상기 여과 시스템은 상기 압력 펌프가 상기 압력 판독치에 기초하여 제1 미리 결정된 시간 동 안 상기 제1 챔버에서 상기 제2 챔버로 상기 막에 걸쳐 흐르는 유체 상에 정압을 인가하게 하도록 구성된 여과 관리 시스템을 포함할 수 있다. 상기 여과 관리 시스템은 상기 압력 펌프가 제2 미리 결정된 시간 동안 상기 적 어도 하나의 파라미터에 기초하여 상기 막에 걸친 유체의 상기 흐름을 역전시키게 하도록 더 구성될 수 있다. 추가 이점들은 다음에 나오는 설명에 부분적으로 제시될 것이거나 실시에 의해 학습될 수 있다. 이점들은 특히 첨부된 청구항들에서 언급된 요소들 및 조합들에 의해 실현 및 달성될 것이다. 앞서 말한 일반적인 설명 및 다 음 상세한 설명 양자는 청구된 바와 같이, 단지 대표적이고 설명하기 위한 것이고 제한하는 것이 아니라는 것이 이해되어야 한다."}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 방법들 및 시스템들 및 그에 포함된 예들에 대한 다음 상세한 설명을 참조하여 보다 쉽게 이해될 수 있다. 본 화합물, 구성물, 물품, 시스템, 디바이스, 및/또는 방법이 개시 및 설명되기 전에, 그것들은 다르게 명시되 지 않는 한 특정한 합성 방법들에 또는 다르게 명시되지 않는 한 특정한 시약에 제한되는 것이 아니라는 것, 따 라서 물론 달라질 수 있다는 것이 이해되어야 한다. 또한 본 출원에서 사용된 용어는 단지 특정 측면들을 설명 하기 위한 것이고 제한하는 것으로 의도되지 않는다는 것이 이해되어야 한다. 본 출원에서 설명된 것들과 유사 또는 동일한 임의의 방법들 및 물질들이 본 발명의 실시 또는 테스팅 시 사용될 수 있지만, 이제 예시적인 방법 들 및 물질들이 설명된다. 본 출원에서 언급된 모든 간행물들은 이들과 관련되어 간행물들이 인용된 방법들 및/또는 물질들을 개시 및 설 명하기 위해 참조로 본 출원에 통합된다. 본 출원에서 논의된 간행물들은 단지 본 출원의 출원일 이전 그것들의 개시 내용에 대해 제공된다. 본 출원에서 어떤 것도 본 발명이 이전 개시 내용에 의해 그러한 간행물보다 선행 할 권리가 없다는 인정으로서 간주되지 않아야 한다. 나아가, 본 출원에 제공된 간행물의 일자들은 실제 일자들 과 상이할 수 있으며, 이는 별도의 확인을 필요로 할 수 있다.명세서 및 첨부된 청구항들에서 사용될 때, 단수 형태들 \"일\", \"하나의\" 그리고 \"그\"는 문맥이 명백히 다르게 구술하지 않는 한 복수의 지시 대상을 포함한다. 따라서, 예를 들어, \"막\", \"밸브\", 또는 \"센서\"에 대한 언급은 둘 이상의 그러한 막, 밸브, 또는 센서 기타 같은 종류의 것의 혼합물들을 포함한다. 범위들은 본 출원에서 \"약\" 하나의 특정 값으로부터 그리고/또는 \"약\" 다른 특정 값까지로서 표현될 수 있다. 그러한 범위가 표현될 때, 추가 측면은 하나의 특정 값으로부터 그리고/또는 다른 특정 값까지를 포함한다. 유 사하게, 값들이 근사치로서 표현될 때, 선행하는 \"약\"의 사용에 의해, 특정 값이 추가 측면을 형성한다는 것이 이해될 것이다. 범위들의 각각의 종점들은 다른 종점에 관하여 그리고 다른 종점과 관계 없이 유의미하다는 것 이 더 이해될 것이다. 또한 본 출원에 다수의 값이 개시되고, 각 값은 또한 본 출원에서 그 자체의 값에 더하여 \"약\" 해당 특정 값으로서 개시된다는 것이 이해된다. 예를 들어, 값 \"10\"이 개시되는 경우라면, \"약 10\"이 또한 개시된다. 또한 두 개의 특정 유닛 간 각 유닛이 또한 개시된다는 것이 이해된다. 예를 들어, 10 및 15가 개시 되는 경우하면, 11, 12, 13, 및 14가 또한 개시된다. 본 출원에서 사용될 때, 용어들 \"임의의\" 또는 \"임의로\"는 후속하여 설명된 이벤트 또는 상황이 발생할 수 있거 나 발생하지 않을 수 있다는 것, 그리고 설명이 상기 이벤트 또는 상황이 발생하는 사례들 및 그렇지 않은 사례 들을 포함한다는 것으 의미한다. 본 출원에서 사용될 때, \"유체\"는 전단 응력이 인가되는 상황에서 지속적으로 변형되거나 흐르는 임의의 물질을 지칭한다. 유체는 액체, 기체, 및 플라즈마를 포함하지만, 이것에 한정되지는 않는다. 본 출원에서 사용될 때, \"여과기\"는 유체에서 불순물을 제거하기 위한 임의의 반투성 장벽 또는 다공성 디바이 스를 지칭한다. 유체 여과기는 막 또는 체, 충전 매체 층, 유체 매체 층, 막 생물반응기, 및 이온 교환 시스템 을 포함하지만, 이것에 한정되지는 않는다. 여과 분리 메커니즘들은 크기별 배제, 흡착, 선택적 용해/확산, 전 자기적 인력/반발력, 정전기적 인력/반발력, 화학적 반응, 또는 이들의 조합을 포함하지만, 이것에 한정되지는 않는다. 본 출원에서 사용될 때, \"파울링(fouling)\"은 여과기 표면 상의 또는 여과기 구멍들 및 진공 내의 유기성 및 무 기성 물질의 침전을 나타낸다. 파울링은 본 출원에서 설명된 유체 여과 시스템 여과기 상의 무기성 입자(예를 들어, 점토, 미네랄, 금속 등), 혼합되지 않는 탄화수소(예를 들어, 기름 및 그리즈), 용존 및 침전 유기성 분 자들, 및 박테리아 또는 조류의 침전 또는 흡착을 포함하지만, 이것에 한정되지는 않는다. 본 출원에서 사용될 때, \"공급 시스템\"은 여과가능한 용질 및/또는 미립자 물질을 포함하는 임의의 수용성 또는 비-수용성 유체를 지칭한다. 본 출원에서 사용될 때, \"침투하는 스트림\"은 압력-유도 또는 중력 여과 장치에 의해 여과기를 통해 지향된 공 급 시스템의 임의의 부분을 지칭한다. 본 출원에서 사용될 때, \"유량\"은 여과기의 단위 면적에 걸친 유체 흐름을 지칭한다. 유량은 투과 유량 또는 인 출 유량일 수 있지만, 이것에 한정되지는 않는다. 명백히 다르게 언급되지 않는 한, 본 출원에 제시된 임의의 방법이 그것의 단계들이 특정 순서로 수행될 것을 필요로 하는 것으로 간주되도록 결코 의도되지 않는다. 그에 따라, 방법 청구항이 그것의 단계들이 따를 순서를 실제로 열거하지 않거나 그것이 단계들이 특정 순서로 한정되어야 한다고 청구항들 또는 설명에서 구체적으로 다르게 언급되지 않는 경우, 어떤 측면에서도, 순서가 추론되도록 결코 의도되지 않는다. 이는 단계들 또는 동 작 흐름의 배열에 대한 논리적 문제들; 문법 구조 또는 구두점에서 유도되는 명백한 의미; 및 명세서에서 설명 되는 실시예들의 수 또는 유형을 포함하여, 해석 시 임의의 가능한 분명하지 않은 기초를 위해 유지된다. 본 출원에 개시된 구성물들은 특정 기능들을 갖는다고 이해된다. 개시된 기능들을 수행하기 위한 특정 구조적 요건들이 본 출원에 개시되고, 개시된 구조들에 관한 동일한 기능을 기능을 수행할 수 있는 다양한 구조가 존재 한다는 것, 그리고 이러한 구조들이 통상적으로 동일한 결과를 달성할 것이라고 이해된다. A. 반투성 막들 일 측면에서, 본 발명의 방법들 및 시스템들은 막을 용액 또는 액체 현탁액에서 용질 및 현탁 입자를 제거하기 위한 분리 장벽으로서 사용하는 압력-유도 여과 공정들에 관한 것이다. 일 측면에서 막은 반투성 막일 수 있다. 반투성 막들은 용존 또는 분산 물질을 공급 스트림과 분리하기 위해 사용될 수 있다. 분리 공정은 용존 또는 분 산 물질을 방지하면서 반투성 막을 통해 용매 상의 투과에 영향을 미치기 위해 공급 용액을 압력 하에서 반투성막의 일 표면과 접촉시키는 것을 수반할 수 있다. 반투성 막들은 폴리머, 세라믹, 또는 금속으로 만들어질 수 있다. 이러한 폴리머, 세라믹, 또는 금속 막들은 많 은 가능한 조합(형태 인자), 이를테면 평평한 시트 모듈, 판 및 프레임 모듈, 나권형 모듈, 관형 모듈, 중공 섬 유 모듈, 이들의 조합들 기타 같은 종류의 것을 갖는 요소들 및 모듈들 속에 충전될 수 있다. 뿐만 아니라, 이 러한 반투성 막들은 모두 기본적으로 범위가 미세여과(MF) 및 초미세여과(UF)에서 나노여과(NF) 및 역삼투(RO) 에 이르는, 광범위한 선택도 및 투과도를 보이기 위해 합성될 수 있다. RO 및 NF 양자의 막들은 다공성 담체에 고정되는 박막 선별층을 포함할 수 있어, 총괄적으로 \"복합 막\"으로 지 칭된다. MF 및 UF 막들은 또한 복합 배열을 포함할 수 있다. 다공성 담체는 물리적 세기를 제공할 수 있으나 다 공성 담체는 그것의 다공성으로 인해 흐름 저항은 거의 제공할 수 없다. 다른 한편, 박막 선별층은 덜 다공성일 수 있고 용존 또는 분산 물질의 분리의 주요 수단을 제공할 수 있다. 따라서, 박막 선별층은 주로 소정의 막의 \"거부율(rejection rate)\" - 특정 용존 또는 분산 물질(예를 들어, 용질)이 거부된 비율, 및 \"유량\" - 용매가 막을 통과하는 단위 면적당 유동률에 책임이 있을 수 있다. 반투성 막들은 서로 다른 이온들 뿐만 아니라 유기 및 무기 화합물들에 대한 그것들의 투과도들에 따라 달라진 다. 예를 들어, \"확산성 막들\"(예를 들어, NF 및 RO)은 나트륨 및 염화물, 뿐만 아니라 약 200 달톤을 초과하는 분자량을 갖는 비하전 용질을 포함하여, 거의 모든 이온에 비교적 불투과성이다. 그에 따라, RO 막들은 공업용, 상업용, 또는 가정용 정제수를 제공하기 위한 기수 또는 해수의 담수화를 위해 폭넓게 사용되는데, 이는 RO 막 에 대한 나트륨 및 염화 이온의 거부율이 보통 약 90 퍼센트를 초과하기 때문이다. 반대로, \"저압 막들\"(예를 들어, MF 및 UF)은 비교적 다공성일 수 있고, 그에 따라, 콜라이드 및 미립자 물질(예를 들어, MF에 대해 약 0.1 ㎛ 내지 약 10 ㎛ 그리고 UF에 대해 약 0.01 ㎛ 내지 약 0.1 ㎛)의 제거를 위해 사용될 수 있다. MF 및 UF 는 입자 및 병원체 제거, NF/RO 사전 처리, 화학 합성 정제 기타 같은 종류의 것을 위해 자치 도시 및 공업 처 리 적용예들 양자에서 사용될 수 있다. MF 및 UF 막들은 다양한 기하학적 구조의 무기 또는 폴리머 물질 중 어느 하나로 구성될 수 있다. 막들은 다양 한 모듈 구성, 이를테면, 예를 들어, 관형 구성, 판-및-프레임 구성, 나권형 구성, 중공 섬유 구성, 이들의 조 합 기타 같은 종류의 것으로 구성될 수 있다. 폴리머 MF 및 UF 막들은 다양한 폴리머, 이를테면, 예를 들어, 셀 룰로즈 아세테이트, 폴리비닐리덴 플루오라이드, 폴리아크릴로니트릴, 폴리프로필렌, 폴리설폰, 및 폴리에테르 설폰으로 구성될 수 있다. 폴리머 막들은 다양한 형태 인자로 비교적 경제적으로 제조될 수 있으나, 적당한 pH, 온도, 및 화학적 내성에 대해 좁은 가동 범위로 한정될 수 있다. 물질 이를테면 알루미나, 지르코니아, 및 티타 니아로 만들어진 세라믹 막들은 상태들이 고온에서의 가동을 좌우하거나 유독한 세정 화학 물질이 요구될 수 있 는 적용예들에서 사용될 수 있다. MF 및 UF 막들은 역세정 또는 역플러싱에 의한 현장 파울링 제어를 가능하게 하기 위해 대칭적인 구멍 구조로 구성될 수 있다. 본 출원에서 사용될 때, \"역세정\" 또는 \"역플러싱\"은 기계적으로 그리고/또는 삼투적으로-유도 될 수 있는, 정여과 막경유 압력보다 큰 압력 차이를 인가함으로써 투과 스트림의 흐름 방향을 반전시키는 것을 지칭한다. 역세정은 추가 화학 물질, 이를테면 산성물, 부식제, 및/또는 산화제를 첨가한 투과성 액체, 정제수, 또는 화학적으로 증강된 투과성 액체를 포함하지만, 이것에 한정되지는 않는다. 추가 측면에서, 지능형 유체 여과 관리 공정은 박막 코팅 없이 MF 막, UF 막, NF 막, RO 막, 정삼투막, 및 압력 지연된 삼투막의 사용에 의해 채용될 수 있다. 덧붙여, 지능형 유체 여과 관리 공정은 세라믹 및 폴리머 막의 사용에 의해 채용될 수 있다. 또한 추가 측면에서, 반투성 막은 관형 구성, 판 및 프레임 구성, 나권형 구성, 중공 섬유 구성, 또는 막 생물 반응기 구성으로 채용된다. 또한 추가 측면에서, 지능형 유체 여과 관리 공정은 본 출원에 설명된 막-기반 측면의 그것들을 미러링하는 여 과 및 여과기 유지보수의 메커니즘들로 인해, 비-막-기반 여과, 이온 여과, 및 활성탄 시스템들 이를테면 모래 여과 혼합 매체 여과, 이온 교환, 과립 활성탄, 및 임계 카트리지 및 나권형 여과 시스템들의 사용에 의해 채용 될 수 있다. B. 유체 여과 관리 시스템들 도 1은 여과 관리 시스템이 관리하는 예시적인 여과 시스템을 예시한다. 일 측면에서, 본 발명은 제1 챔버 및 제2 챔버 간에 흐르는 유체 상에 압력을 인가하도록 구성된 압력 펌프를 포함하는 여과 시스템에 관한 것이다. 여과 시스템은 제1 챔버 및 제2 챔버 간에 놓인 막을 가로질 러 흐르는 유체와 연관된 적어도 하나의 파라미터를 결정하도록 구성된 흐름 센서를 더 포함할 수 있다.여과 시스템은 압력 펌프 및 흐름 센서에 접속된 그리고 제1 챔버에서 제2 챔버로 흐 르는 유체의 압력 판독치를 결정하도록 구성된 압력 센서를 더 포함할 수 있다. 뿐만 아니라, 여과 시스템 은 압력 펌프, 흐름 센서, 및 압력 센서와 통신하는 여과 관리 시스템을 포함할 수 있다. 여과 관리 시스템은 압력 펌프가 압력 센서로부터의 압력 판독치에 기초하여 제1 미리 결정된 시간 동안 제1 챔버에서 제2 챔버로 흐르는 유체 상에 정압을 인가하게 하도록 구성될 수 있다. 여과 관리 시스템은 압력 펌프가 적어도 하나의 파라미터에 기초하여 제2 미리 결정된 시간 동안 정압으로 막을 가로지르는 유체 흐름을 반전시키게 할 수 있다. 압력 유도 막 여과 공정들, 이를테면 미세여과(MF), 초미세여과(UF), 나노여과(NF), 및 역삼투(RO)는 반투성 막 을 용액 또는 액체 현탁액에서 용질 및 현탁 입자를 제거하기 위한 분리 장벽으로서 사용한다. 막경유 압력 (TMP)차의 인가는 공급 용질 또는 입자를 유지하면서, 막을 가로질러 용매가 흐르게 한다. 막을 가로지르는 세정 용매의 유동률(또는 유량)은 유량(막의 단위 단면적 당 용적 유동률)이 인가된 압력 차에 선형적으로 비례함을 명시하는, 다시(Darcy) 식에 의해 지배된다: . 여과 공정 동안, 막에 의해 유지되는 용질 및 입자는 막 표면에 축적할 수 있다. 막 표면에의 용질 농도 증가는 농도 분극으로 지칭될 수 있다. 막 표면에의 용질 농도의 증가는 막을 가로지르는 용매 흐름에 대한 추가 저항 으로 이어질 수 있다. 이러한 저항은 여과 또는 투과 유량을 감소시킬 수 있다. 저항 증가 및 뒤이어 일어나는"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "유량 감퇴의 몇몇 관련 메커니즘이 표 1에 요약된다. 표 1 메커니즘 설명 농도 분극막의 공급측 상에 유지된 용질의 고농도가 투과측과 비교하여 용매 활성을 낮춘다. 이는 용질을 투과측에서 공급측으로 유도하는 경향이 있는 압력차(삼투압 차)로서 분명해진다. 이러한 삼투압 차는 막을 가로지르는 용매에 대한 유효 막경유 압력차 를 감소시킨다. 이 메커니즘은 작은 용질, 이를테면 염 이온에 대해 우세하고, 일 반적으로 역삼투 동안 유량 감퇴의 우세한 메커니즘이다. 겔층 형성공급측 상의 막 표면에 유지된 용질 농도가 임계값 소위 겔 농도에 이르는 경우, 농축된 겔형 침전이 막 상에 형성되기 시작한다. 겔층은 그것을 가로지르는 용매의 투과에 대해 추가 저항을 부과한다. 이 메커니즘은 단백질, 유장, 주스 및 음료의 UF 또는 NF 동안 공통되고, 식품, 음료 및 약제 여과 동작들에 공통된다. 케이크 형성작은 용질의 응고에 의해 형성된 현탁 입자 또는 혼합체가 투과 용매의 유체역학적 견인으로 인해 막 표면으로 이동될 수 있다. 이러한 입자가 막 상에 침전됨에 따라, 그것들은 케이크 층을 형성하기 시작하며, 이는 용매의 투과에 대한 추가 저 항을 일으킨다. 케이크 층은 겔층 저항과 유사하며, 차이는 단지 케이크 층과 비교 하여 겔층이 보다 조밀하고, 대체로 얇으며, 매우 높은 비저항을 갖는다는 것이다. 보통 케이크 층의 두께는 흐름이 임계 높이를 너머 케이크 표면을 침에 따라 접선 흐름 여과 동안 한정되어, 그것의 추가 성장을 방지한다. 흡착 용질은 막의 표면 상으로 흡착할 수 있고, 그렇게 함으로써 막 구멍들을 부분적으 로 또는 완전히 막는다. 흡착은 막들의 투과성 손실의 다양한 메커니즘으로 이어지 며, 이의 대부분은 영구적(비가역적) 성격을 갖는다. 흡착은 불완전한 구멍 막힘, 또는 구멍 반경의 감소를 야기할 수 있다. 케이크-증강 농 도 분극이 메커니즘은 나노여과 또는 역삼투막들, 즉, 염을 거부하는 막들에 의한 콜로이 드 입자의 여과 동안 나타난다. 이 경우, 하전 입자가 먼저 막 상에 침전되어, 케 이크 층을 형성한다. 케이크 층이 형성됨에 따라, 하전 입자는 수축된 다공성 매체 의 동전기적 효과들, 뿐만 아니라 간섭 확산으로 인해 케이크 층을 가로지르는 이 온의 수송을 변경한다. 이 메커니즘들은 케이크 층을 가로질러 삼투압 강하가 증강 되게 하고, 그렇게 함으로써 전체 투과 유량을 감소시킨다. 유량 강하 메커니즘들의 다양성은 상이한 유형들의 막 요소들, 모듈들 및 막 여과 시스템들에 따라 상이한 유형 들의 투과 유량의 공간적-시간적 변화로 이어질 수 있다. 표 1에 설명된 각 메커니즘은 상이한 유형의 유량 강 하 거동의 시간 종속성을 야기할 수 있다. 시간이 흐르면서, 보다 많은 용질이 막 상에 축적될 수 있다. 용질의 축적은 막을 가로지르는 용매 흐름에 대한 전체 저항을 증가시키고, 시간이 지남에 따라 여과액 유량의 감소를 야기할 수 있다. 많은 유형의 상업용 규모 접선 흐름 막 요소들 및 모듈들, 이를테면 관형 모듈, 판 및 프레임 모듈, 나권형 모듈, 중공 섬유 모듈, 또는 막 생물 반응기 모듈에서, 막 상의 용질 축적의 정도는 또한 공간적으로 달라질 수 있다. 그 결과, 유량의 시간 종속적 변화와 함께, 또한 각 유형의 막 모듈 또는 요소에 따른 유 량의 국부적인 공간적 변화가 존재할 수 있다. 예를 들어, NF 및 RO 막들에 대한 유량 손실 프로필은 납 요소의 유기물 파울링을 예시할 수 있다. 납 요소의 유기물 파울링은 케이크 형성에 의한 점진적 유량 손실로 특징지어 질 수 있다. 뿐만 아니라, NF 및 RO 막들에 대한 유량 손실 프로필은 미부 요소 상의 무기물 척도화를 예시할 수 있으며, 이는 무기물 석출 및 전체 구멍 막힘에 의한 극적이고 갑작스런 유량 손실로 특징지어질 수 있다. 막 공정들의 상업용 적용예들에서의 상이한 유량 강하 메커니즘들, 다양한 유형의 모듈 및 요소 기하학적 구조, 및 복합 공급 화학 물질 및 구성물은 동작 및 공정 제어 알고리즘으로서 구현될 수 있는 유량 강하 및 막 파울 링의 일반적인 역학 모델을 개발하는 것을 도전적인 일로 만들 수 있다. 막 여과 시스템들의 공정 제어는 막 여 과 시스템으로부터의 일정한 용적 처리량을 유지하는 것을 수반할 수 있다. 다시 말해서, 막 모듈로부터의 평균 투과 유량은 공정 동안 모니터링될 수 있다. 처리량의 임의의 강하가 존재하는 경우, 제어 알고리즘은 유량을 원하는 설정점으로 유지하기 위해 구동력(이를테면 인가 TMP)을 증가시킬 수 있다. 이러한 운용 철학은 임의의 유량 강하 메커니즘들을 완전히 도외시하고, 범위가 미세여과에서 역삼투에 이르는 모든 유형의 압력 유도 막 분리 공정들, 및 막 유형(세라믹 또는 폴리머)에 따라 채용된다. 도 2는 막 요소의 공급측 상의 인가 압력의 변화를 시간에 대해 개략적으로 도시한다. 인가 압력은 막 요소를 통해 일정한 투과 유량을 유지하기 위해 증가된다. 인가 압력은 여과 동안 상이한 파울링 메커니즘들이 전체 막 투과성을 감소시킴에 따라 지속적으로 증가한다. 인가 압력이 여과 사이클(tf) 동안 최대 임계(Pmax)에 이를 때, 여과가 중지되고 막 세정 메커니즘이 개시된다. 몇몇 적용예에서, 여가 사이클은 고정된 타이머를 지키며, tf는 연속적인 사이클들 간에 일정하다. 그러한 경우, 최대 인가 압력(Pmax)은 여과 사이클들 간에 달라질 수 있다. 세정 메커니즘은 막 요소의 유형, 이를테면 막 공정에 따라 상이할 수 있고, 범위가 역세정(BW), 화학적 강화 역세정(CEB), 투과 완화(PR), 압력 펄싱(PP), 공기 세척(AS), 화학적 펄스(CP), 공급 흐름 반전(FFR), 제자리 세정(CIP), 이들의 조합 기타 같은 종류의 것부터 일 수 있다. 세정 메커니즘의 성능에 따라, 막 요소의 투과성 이 부분적으로 회복된다. 투과성의 회복된 부분은 여과 사이클 동안 막 요소의 가역적인 파울링에 기인하고, 투 과성의 비회복된 부분은 비가역적인 파울링에 기인한다. 일정한 처리량 동작 모드에서, 막 요소의 비가역적인 투과성 손상의 부분은 또한 동작 동안 고압으로 인한 막 요소의 조밀화에 의해 야기될 수 있다. 뿐만 아니라, 여과 공정의 에너지 수요는, 압력 증가가 여과 시스템으로의 전력 인출이 증가될 것으로 요구함에 따라, 시간 종속적이다. 정압 가변 처리량 동작 모드에서, TMP는 초기에 설정되고, 투과 유량은 다양한 유량 강하 메커니즘으로 인해 여 과 사이클 동안 시간이 지남에 따라 감소한다. 다음의 두 개의 동작 모드가 가능할 수 있다: (i) 정여과 시간 (tf)이 일정한 고정된 여과 시간 모드, 및 (ii) 세정 메커니즘이 트리거되기 전, 유량이 최소값(Jf)에 이르게 되 는 고정된 유량 강하 모드. 세정 이후, 유량 회복은 보통 비가역적인 막 파울링으로 인해 불완전하다. 도 3은 막 공정의 정압 가변 유량 운용을 도시하는 대표적인 도해를 예시한다. 수직축은 유량을 도시한다. 음영 영역은 비가역적인 투과성 손실을 나타낸다. 가동 여과 시스템들의 모드는 일정한 처리량(CT) 가변 막경유 압력 (TMP) 모드일 수 있으며, 여기서 압력이 막을 가로지르는 일정한 투과 처리량을 유지하기 위해 점진적으로 증가 된다. 이러한 공정 제어의 구현은 공급 압력을 조절하기 위해 처리량 및 압력 제어 메커니즘을 기록하기 위한 유동률 측정 디바이스를 필요로 할 수 있다. 이러한 유형의 공정 제어는 비례 적분 미분(PID) 제어 루프 문제들 을 가질 수 있다; 즉, 공정 제어는 반응적일 수 있고(피드백 제어 메커니즘), 일정한 파라미터들에 기초할 수 있고, 막 유량 강하의 실제 메커니즘들에 기초하지 않으며, 최적 또는 적응적 제어를 제공하지 않는다. 막 공정 관점에서, 상기한 PID 제어 루프의 문제는 유량 설정점의 결정에 따른다. 유량 설정점이 초기 유량(J 0)인 경우, 유량 강하가 여과의 초기 단계들 동안 꽤 급격할 수 있기 때문에, 압력이 이러한 단계들 동안 매우 급격하게 증가할 수 있다. 그러한 압력의 증가는 막을 매우 급격하게 조밀화할 수 있다. CT 동작 모드에서 PID 제어 루프가 갖는 두 번째 문제는 공급에서의 파울런트 농도의 갑작스러운 급증과 관련된 다. 그러한 급증이 막을 칠 때, 유량이 갑작스럽게 강하한다. 그러한 갑작스러운 유량 강하에 반응하여, PID 제 어 루프는 유량을 일정하게 유지하기 위해 압력을 증가시키려고 시도할 수 있다. 물질 전달 제어 레짐으로 작동 하는 막 공정에서, 유량은 인가 압력에 따라 선형으로 반응하지 않을 수 있다. 그에 따라, 압력은 비교적 적은 유량의 증대를 실현하기 위해 상당히 증가될 수 있다. 뿐만 아니라, 투과 견인력이 높을 수록 보다 많은 용질이 막 표면으로 또는 막 구멍들로 넣어져, 막을 보다 적극적으로 파울링하기 때문에, 그러한 유량 증대는 막을 통 하는 낮아진 투과의 비용을 댓가로 이뤄질 수 있다. 몇몇 사례에서, 증가된 공급 압력은 교차 흐름을 증가하게하는, 축압 강하를 증가시킴으로써 막에서의 물질 전달을 강화할 수 있다. 따라서, 공급 용질 농도의 갑작스러 운 증가에 반응한 압력 증가는 막 공정들에서의 유량 제어의 현명한 접근법이 아니다. 막 요소에서의 유량 강하는 여과 공정 동안 발생하는 파울링의 징후일 수 있다. 유량 강하는 막 파울링 및 성능 손실의 직접적이고 분명한 지표인 것으로 고려될 수 있다. 유량 강하가 대규모의 상업용 여과 운용 동안 추적될 수 있는 경우라면, 이러한 정보는 지능적으로: a) 여과 공정 동안 파울링의 지배 메커니즘들을 평가하고; b) 파 울링 및 유량 강하의 임계 레벨이 관찰되면 자동으로 세정 메커니즘들을 트리거하도록 학습하고; c) 소정의 급 수 질 및 공정 구성에 대해 가장 경제적인 가동 레짐에 적응하고; d) 급수 질의 갑작스러운 변동에 동적으로 반 응하고, 심지어 급수 파울런트 레벨들의 원치 않는 그리고 재해적 급증 동안 공정을 정지하고; e) 에너지 소비 를 낮추고; f) 역세정 및 제자리 세정과 같이, 시스템 유지 보수의 다양한 모드간을 자동으로 순환하고; g) 막 들의 유효 수명을 연장시키고 물 처리의 비용을 최적화하고; 이들의 조합들; 기타 같은 종류의 것을 할 수 있는 막 공정들에 대해 제어 및 운용 아키텍처를 개발하도록 적응될 수 있다. 투과 유량은 막 여과 동안 인가 압력(구동력)에 의해 야기된다. 다시 말해서, 인가 압력은 원인이고 유량이 결 과이다. 정압(CP) 운용 모드에서, 구동력은 일정하게 유지되고, 뒤이어 일어나는 유량 변화는 단순히 상이한 파 울링 저항이 시간이 흐르면서 어떻게 증가하여, 고정된 구동력의 영향 하에서 그러한 유량 강하로 이어지는지에 대한 징후이다. 그러나, 일정한 처리량(CT) 운용 모드에서는, 유량의 변화에 반응하여 구동력 자체가 변경된다. 구동력의 변화는 공정 동특성을 추가 메커니즘들이 상이한 동작 압력 하에서 적용될 수 있는 레짐들로 변경시킬 수 있다. 파울링 메커니즘의 이러한 변경의 흔한 예는 몇몇 유형의 단백질 및 폴리머 여과 동안 임계 TMP 차를 초과하는 겔층 제어 및 삼투압 제어 간 전이이다. 임계 압력 미만에서, 폴리머 용액은 겔이 아니고, 농도 분극 의 지배 메커니즘은 삼투압 증가이다. 그러나, 겔 농도에 대한 임계 압력에 이르는 경우, 유량 강하의 지배 메 커니즘은 겔층의 성장이 된다. 정압(CP) 운용 모드는 주요 신호로서 유량 강하에 의존하는 공정 제어 아키텍처에서 사용될 수 있다. 정압 모드 는 압력 및 유량 간 인과 관계의 변경을 방지할 수 있다. 본 출원에서, 정압 운용 모드 하 막을 포함하는 여과 시스템에서 역세정을 트리거하는 제안된 지능형 여과 관리 시스템의 측면이 개시된다. 본 출원에서의 개시 내용은 유량 강하 패턴에 따라 소정의 구동력(TMP) 및 공급 조 건 하 여과 시스템의 거동에 대한 적절한 정보의 수집을 어떻게 가능하게 할 수 있는지, 해당 정보가 여과 시스 템의 성능을 조정하여, 처리량의 갑작스러운 변화에 반응하여 역세정 또는 CIP를 트리거하기 위해 그리고 CP 운 용 모드를 CT 운용 모드와 구별하기 위해 어떻게 이용될 수 있는지를 실증한다. 그러나, 다른 여과 시스템들이 고려된다. 막 여과 시스템이 초기 TMP(ΔP0)에 대응하는 초기 유량(J0)으로 가동을 시작한다고 가정하자. 정여과 사이클 동 안, 유량은 시간이 지남에 따라 변화하고, 이러한 변화는 고정된 시간 간격(Δt)을 두고 기록된다. 정여과 시간 (tf) 이후, 역세정 사이클이 개시된다. 역세정 동안, 여과 사이클 동안 수집되는 투과 부분은 막을 통해 투과측 으로부터 공급측으로 다시 밀어내어진다. 역세정 유량(JBW)은 정여과 유량보다 클 수 있으나, 역세정의 지속기간 (tBW)은 정여과 시간보다 훨씬 작을 수 있다. 이러한 조건은 막의 표면으로부터 침전된 고형물을 집결키셔 그것 을 재순환 공급측으로 혼입한다. 이러한 유형의 역세정은 세라믹 막 기반 여과 동작들 동안 채용될 수 있다. 도 4는 중간 역세정을 갖는 두 개의 연속적인 여과 사이클 동안의 유량 대 시간 프로필을 개략적으로 도시한다. 유량은 시간이 지남에 따라 감소하고, 유량 사이클 동안 투과(또는 여과)의 누적 생산량은 다음과 같다"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서 Am은 막 면적이고, 최종 식은 사다리꼴 법칙을 이용하여 통합되는 고정된 시간 간격(N 간격)을 둔 유량의 불연속 측정치들에 기초한다. 역세정 동안 소모되는 총 투과 용적은 다음과 같다"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "그 다음 역세정비가 다음과 같이 정의된다 역세정을 갖는 여과 동작에 대해, 가능한 작은 역세정비를 갖는 것이 바람직하며, rBW의 통상적인 타겟들은 < 0.2이다. 막 시설로부터의 순 생산 물 처리량은 다음과 같다"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여과 사이클 동안 유량 강하율은 다음으로 주어진다"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "흐름 측정 디바이스가 일정한 간격을 두고 유량을 기록하는 경우하면, 유량 강하율은 각 순시 시간(ti)(순시 강 하)마다 다음과 같이 나타내어질 수 있다"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "식 및 은 각각, 시간 종속적 투과 유량의 동일한 시퀀스의 적분 및 미분을 나타낸다. 추가 정밀 조사 없이 이러한 유량 측정치들을 이용하여 비례 적분 미분(PID) 유형 제어 알고리즘을 구성하도록 유도될 수 있다. 그러한 접근법은 원하는 유량일 수 있는 설정점의 정의를 필요로 할 수 있고, 설정점으로부터 소정의 유량 측정치의 미분에 기초하여, 제어 변수(일반적으로 인가 압력)를 조절할 것이며, 이는 설정점으로부 터 유량의 미분을 최소화할 것이다. 이는 이전에 일정한 처리량(CT) 가변 압력 모델로서 지칭된 접근법이다. 본 출원에서 위에서 논의된 바와 같이, PID 제어 메커니즘은 두 개의 주요 이슈를 겪는다. 첫째로, 유량 설정점 의 결정. 설정점이 초기 유량(J0)인 경우, 유량 강하가 여과의 초기 단계들 동안 꽤 급격하기 때문에, 압력이 이러한 단계들 동안 매우 급격하게 증가할 것이다. 그러한 압력의 증가는 막을 매우 급격하게 조밀화할 수 있다. 두 번째 사항은 공급에서의 파울런트 농도의 갑작스러운 급증하여, 유량이 갑작스럽게 강하하게 하는 것 과 관련된다. PID 여과 관리 시스템들에서, 압력은 비교적 적은 유량의 증대를 실현하기 위해 상당히 증가될 필 요가 있다. 결과적으로 이는 보다 많은 용질을 막 표면으로 밀어내는 보다 높은 투과 견인에 의해 야기되는 증 가된 파울링으로 인해 낮아진 투과성을 야기할 수 있다. 1. 정압 가변 처리량 운용 모드 정압 가변 처리량 운용 모드는 두 개의 유형의 운용 동안 공정의 전력 소비가 고려되는 경우 일정한 처리량 가 변 압력 운용 모드와 범위가 다소 상이하다. 소정의 공정의 전력 소비는 다음으로 주어지는, 수마력과 관계될 수 있다"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "정압 운용 동안, J = J(t)인 반면, 일정한 처리량 운용 동안, TMP 차는 시간 함수이다. 두 개의 모드로 운용되 는 여과 시스템의 전력 출력의 주요한 차이는 정압 운용에 대해서는, 여과 사이클 동안 유량이 감소되기 때문에 전력 소비가 증가되지 않는 반면(그것은 일정하게 유지되거나 감소됨); 일정한 처리량 운용에 대해서는, 여과 사이킁 동안 전력 소비가 증가된다는 것이다. CT 운용 동안 전력 소비의 증가는 투과성이 적은 여과 장벽을 통 해 일정한 비율로 투과를 미는 추가 구동력의 생성과 관계된다. 대부분의 상업용 막 요소 및 모듈에서, 농도 분극, 파울링, 및 입자 침전의 정도는 모듈의 길이에 따라, 축 방 향으로 달라진다. 그러한 변화는 상이한 위치들의 모듈 또는 요소에서의 상이한 정도의 유량 강하를 일으킨다. 모듈로부터의 처리량은 모듈을 따라 공간적으로 평균되는 투과 유량 곱하기 막 면적을 나타낸다. 모듈의 로컬 투과 유량은 파울링 메커니즘에 따라 달라진다. 대부분의 적용예에서, 파울링은 모듈의 하류 위치들에서 보다극심하여, 이러한 위치들로부터의 보다 적은 유량을 야기한다. 이러한 모듈들 중 많은 모듈에서, 파울링의 정도 를 한정하기 위해 접선 흐름이 채용된다. 몇몇 적용예에서, 모듈의 일단의 과잉 비대칭적 파울링을 방지하기 위 해 공급 흐름 반전(FFR)이 이용될 수 있다. 상업용 모듈들에서의 막 파울링의 메커니즘과 관계 없이, 대부분의 모듈 및 요소는 비대칭적으로 파울링되고, 보통 요소는 단지 그것의 부분이 비가역적으로 대단하게 파울링되게 될 때 교체를 필요로 한다 막 요소들의 비 대칭적인 파울링은 접선 흐름 여과 시스템들의 물질 전달 특성들의 결과이다. 정압 가변 처리량 및 일정한 처리 량 가변 압력 모드들을 채용하는 상업용 규모의 막 요소를 운용하는 것이 어떻게 요소의 상이한 정도의 비대칭 적인 파울링으로 이어질 수 있는지를 탐구하는 것이 관심 사항이다. 파울링은 막의 하류 종단에서 개시되어, 막의 이러한 영역들의 투과성의 손실을 야기한다. 여과 회복은 이러한 영역들을 감소시킨다. 정압 운용 시, 보다 낮은 투과성이 정상 상태 공정 동안 접선 용적 흐름을 증가시킨다. 교차 흐름 속도가 증가함에 따라, 축 마찰 손실도 그러하다. 증가된 교차 흐름이 물질 전달에 유익하고, 몇몇 유형의 막 공정에서의 파울링 층들의 제거로 이어지지만, 보다 높은 교차 흐름은 일반적으로 모듈에서의 보다 높은 축압 강하와 연관된다. 이러한 공정은 막 손실 투과성의 부분이 축 흐름 성분을 보다 적극적으로 증가시키 면서 전체 구동 압력을 증가시킴에 따라, 일정한 처리량 운용 모드 동안 심화된다. 그에 따라, 모듈로부터의 여 과액 또는 투과액의 생산량이 이러한 유형의 운용 시 일정하게 유지되더라도, 생산량은 요소들의 최첨단에서의 막의 파울링되지 않은 영역들로부터 증가된 투과가 그 대원인이 된다. 이들 위치로부터의 보다 높은 투과는 투 과 견인, 그리고 그로 인해, 막의 이러한 부분들 상의 파울런트의 축적을 강화한다. 마지막으로, 막이 막히나 보다 높은 구동 압력이 공급측 상에 부과됨에 따라, 축 흐름이 증가하여, 모듈을 따르는 마찰 압력 강하를 증가 시킨다. 이의 전체 결과는 일정한 처리량 가변 압력 모드로 운용될 때 막 공정의 보다 높은 운용 비용이다. 추가 측면에서, 압력 펌프가 적어도 하나의 파라미터에 기초하여 정압을 반전시키게 하는 것은 결정된 적어도 하나의 파라미터를 적어도 하나의 임계값과 비교하는 것을 포함한다. 또한 추가 측면에서, 적어도 하나의 파라 미터는 유체 흐름 속도, 유체 흐름 속도의 변화율, 미리 정의된 시간 기간 동안 막을 통하는 유체 침투 용적 중 하나 이상이다. 추가 측면에서, 여과 시스템은 정압 인가하는 시간을 조절하는 것 및 정력을 반전시키는 시간을 조절하는 것 중 적어도 하나를 위해 구성된 타이머를 더 포함할 수 있다. 추가 측면에서, 제1 미리 결정된 시간 및 제2 미리 결정된 시간 중 하나 이상은 상수 값이다. 또한 추가 측면에 서, 제1 미리 결정된 시간 및 제2 미리 결정된 시간 중 하나 이상은 미리 정의된 식에 기초하여 결정된다. 추가 측면에서, 반전된 압력은 정압이다. 2. 압력 펌프 다양한 측면에서, 여과 시스템은 제1 챔버 및 제2 챔버 간에 흐르는 유체 상에 압력을 인가하도록 구성된 압력 펌프를 포함한다. 압력 펌프는 막이 그것을 통한 막이 불순물의 통과를 거부한 순간에, 막을 통해 유체를 밀기 위해 요구되는 압력을 공급한다. 미세여과 및 초미세여과는 약 3 psi 내지 약 50 psi의 범위 내에서 작동할 수 있으며, 이는 나노여과 및 역삼투 막들(약 200 psi 내지 약 1,200 psi)보다 상당히 낮은 것이다. 3. 흐름 센서 다양한 측면에서, 여과 시스템은 제1 챔버 및 제2 챔버 간에 놓인 막을 가로질러 흐르는 유체와 연관된 적어도 하나의 파라미터를 결정하기 위해 구성된 흐름 센서를 포함한다. 유체 흐름 센서는 여과 시스템에 의해 기록되 는 순시 및 평균 유량들을 나타내도록 설계될 수 있다. 그 다음 시간적 유량 측정치들은 제어 공정에 필수적인 적분 및 미분 유량 항들을 계산하기 위해 사용될 수 있다. 4. 압력 센서 다양한 측면에서, 여과 시스템은 압력 센서를 포함한다. 압력 센서는 제1 챔버를 제2 챔버와 분리하는 막을 가 로지르는 유체 흐름의 압력 판독치를 결정하도록 구성될 수 있다. 압력 센서는 측정될 유체가 유지되지 않는 것 과 같은 방식으로 구성될 수 있다. 추가 측면에서, 압력 센서는 막 및 압력 감지 섹션을 포함하며, 이는 막 내 에 흐르는 유체의 압력을 감지한다. 또한 추가 측면에서, 압력 센서는 막과 별개이다. 5. 여과 관리 시스템 일 측면에서, 여과 시스템은 여과 관리 시스템을 포함할 수 있다. 일 측면에서, 여과 관리 시스템은 압력 펌프, 흐름 센서, 및 압력 센서와 통신한다. 여과 관리 시스템은 압력 펌프가 압력 판독치에 기초하여 제1 미리 결정 된 시간 동안 제1 챔버에서 제2 챔버로 흐르는 유체 상에 정압을 인가하게 하도록 구성될 수 있다. 나아가, 여 과 관리 시스템은 압력 펌프가 적어도 하나의 파라미터에 기초하여 제2 미리 결정된 시간 동안 정압을 반전시키 게 할 수 있다. 반전된 압력을 유체의 흐름이 제1 챔버 및 제2 챔버 간 막을 가로지르는 반전 방향으로 이동하 게 할 수 있다. 반전된 압력은 또한 일정한 입력일 수 있다. C. 유체 여과 관리 시스템들을 트레이닝 모드로 작동시키기 위한 방법들 도 5는 여과 관리 시스템의 방법을 예시한다. 단계에서, 정압이 제1 챔버에서 제2 챔버로 흐르는 유 체 상에 인가될 수 있다. 일 측면에서, 정압은 압력 펌프에 의해 인가될 수 있다. 일 측면에서, 막은 유체가 제 1 챔버에서 제2 챔버로 막을 투과하게 하기 위해 제1 챔버 및 제2 챔버 간에 놓일 수 있다. 단계에서, 제1 챔버에서 제2 챔버로 막을 가로질러 흐르는 유체와 연관된 적어도 하나의 파라미터가 결정 될 수 있다. 일 측면에서, 흐름 센서가 적어도 하나의 파라미터를 결정할 수 있다. 일 측면에서, 적어도 하나의 파라미터는 유체 유동률, 유체 유동률의 변화율, 미리 정의된 시간 기간 동안 막을 통한 유체투과 용적, 막 상 에 형성되는 파울링 중 하나 이상일 수 있다. 일 측면에서, 막 상에 형성되는 파울링은 막의 전기 전도도를 측 정하는 것을 통해 결정될 수 있다. 다른 측면에서, 막 상에 형성되는 파울링은 막 표면의 현장 시각적 검토를 통해 결정될 수 있다. 단계에서, 정압이 적어도 하나의 임계값과 결정된 적어도 하나의 파라미터의 비교에 기초하여 반전될 수 있다. 일 측면에서, 여과 관리 시스템은 압력 펌프가 임계값이 충전되었을 때 정압을 반전시키게 할 수 있다. 일 측면에서, 반전된 압력은 일정한 레벨로 인가될 수 있고 미리 정의된 식에 기초하여 결정될 수 있다. 일 측 면에서, 반전된 압력은 미리 정의된 시간 기간 동안 인가될 수 있다. 미리 정의된 시간 기간은 적어도 하나의 측정된 인자에 기초할 수 있다. 측정된 인자는 각 사이클당 막 상의 파울링 증가량일 수 있다. 반전 압력이 미 리 정의된 시간 기간 동안 유체에 인가된 후, 정압이 제1 챔버에서 제2 챔버로의 유체 흐름의 원래 방향으로 재 인가될 수 있다. 여과 관리 시스템에 의한 지능형 공정 제어는 소정의 자극(구동력)에 대한 여과 시스템의 반응에 대한 일정한 초기 학습을 수반할 수 있다. 막 공정들에서, 이는 여과 시스템을 고정된 TMP로 작동시킴으로써 그리고 뒤이어 일어나는 유량 강하 거동을 관찰함으로써 제1 몇 여과 사이클 동안 용이하게 실현될 수 있다. 여과 시스템의 커 미셔닝 시, 급수의 여과 시스템과의 제1 몇몇 상호 작용은 급수가 막을 어떻게 파울링할 수 있는지, 그리고 여 과 및 역세정 사이클들이 특정 급수에 어떻게 적응되어야 하는지의 탁월한 지시자들을 제공할 수 있다. 미리 설 정된 TMP를 인가하면 여과 시스템의 특정 유량 강하 거동으로 이어질 것이며, 이는 역세정을 트리거하기 전 미 리 설정된 여과 시간 동안 기록될 수 있다. 여과 관리 시스템이 다음 네 개의 미리 설정된 조건으로 구현되는 것을 고려하자: 초기 TMP, 이는 초기 유량 (J0); 정여과 시간(tf,ini); 최대 허용가능한 유량비(JN/Jf); 및 역세정비(rBW)를 제공함. 이러한 초기 미리 설정 된 정여과 시간 동안 유량 강하가 미리 설정된 유량비보다 큰 유량비를 내는 경우, 그리고 후속 역세정 단계 이 후, 유량이 다시 초기 유량(J0)에 이르도록 완전히 회복되는 경우, 미리 설정된 조건이 현재 동작에 대해 적절한 것으로 유지된다. 그러나, 유량비가 tf,ini 이전 미리 설정된 비(JN/Jf)보다 낮은 값에 이르는 경우라면, 정여과 사이클이 예상보다 일찍 중지되고, 다음 여과 사이클에 대해 새로운 여과 시간(tf 〈 tf,ini)이 선택된다. 여과 시간이 단축될 때, 여과액의 생산량은 여과 사이클 동안 낮아질 것이다. 그 결과, 역세정비가 보다 높아지 게 될 것이다. 역세정비가 미리 설정된 한계를 초과하는 경우, 공정은 그것이 사이클 동안 보다 적은 수량을 생 산하기 때문에 덜 경제적일 것이다. 역세정비를 조절하기 위해, 몇몇 옵션이 있으며, 이는 역세정 시간 및 역세 정 유량을 변경하는 것을 포함할 수 있다. 그 다음 역세정 유량을 변경할 수 있고 제1 사이클로부터 변경된 파 라미터들을 사용하여 정여과 및 역세정 단계로 이루어지는 제2 사이클을 실행할 것이다. 도 6은 학습 공정 흐름도를 도시한다. 학습 모듈은 실시간으로 유량을 측정하고 그것 미리 설정된 값들(또는 이 전 트레이닝 단계들에서 획득된 값들)과 비교하는 데이터 획득 모듈 및 비교기이다. 소정의 여과 사이클 동안 저장된 미리 설정된 값들은 초기 유량(J0,ini, 이는 TMP 설정점에 따름), 여과 시간(tf,ini), 및 이전 여과 사이클 의 유량비(rflux = JN/JO)이다. 리이밍 미리 설정된 값들은 역세정 파라미터들, 즉, 역세정 시간, 역세정 유량, 및 역세정비이다. 학습 모듈은 유량 대 시간 데이터를 기록하고, 모듈 내에서 실시간으로 다음 계산들을 수행한 다:1. 식 에 따른 유량의 적분 2. 식 에 따른 유량의 미분 3. 다음과 같이 평가되는 오차 추정:"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서 Kp, Ki, 및 Kd는 각각, 비례, 적부 및 미분 이득들이다. 오차 추정은 여과 시간 및 TMP를 제어하기 위해 사용되어, 다음 여과 실행을 준비한다. 식 의 각 항이 막 여과 공정에서 유량 강하의 메커니즘들을 보다 실 제적으로 나타낸다는 것이 주의되어야 한다. 비례 항은 로컬 유량이 이전 사이클들의 평균 유량과 어떻게 비교 되는지를 묘사하고, 적분 항은 현재 여과 사이클에서 시간(ti)까지 누적 생산량이 이전 사이클로부터의 총 생산 량과 어떻게 비교되는지를 묘사하며, 미분 항은 현재 여과 사이클의 순시 유량 강하율이 이전 여과 사이클에서 의 전체 유량 강하율과 어떻게 비교되는지를 묘사한다. 식 은 여과 시스템의 성능을 제어하기 위한 일반적인 PID 제어 알고리즘이고, 공정 제어의 비례, 적분, 및 미분 모드들의 임의의 조합으로 작용하기 위해 변경될 수 있다. 예를 들어, 적분 이득을 제로로 설정하면, 공정 은 PD 제어기로서 정의될 수 있다. 또한 공정 제어 알고리즘이 설정점들이 파울링 메커니즘의 학습된 피처들을 반영하기 위해 각 여과 사이클 이후 업데이트되는 것과 같은 방식으로 정의된다는 것에 주목할 필요가 있다. 뿐 만 아니라, 학습 공정은 여과 사이클을 미세 조정하기 위해, 인가된 TMP를 조절하는 것 또는 여과 시간을 조절 하는 것, 또는 이들의 조합을 수반할 수 있다. 많은 사례에서 초기 TMP 설정점은 여과 시스템의 설계 동안 선택 되어 파울링이 극심하지 않도록 막을 갖는다. 이러한 측면에서, TMP 설정점을 증가키시기 위해 학습 프로세스를 사용할 수 있다. TMP 설정점이 조절될 때, 인가된 압력이 유량 강하율에 직접적인 영향을 주기 때문에, 미분 입 력들을 고려하는 것이 보다 유용할 수 있다. 보다 높은 TMP는 보다 빠른 유량 강하율로 이어진다. 다른 한편, 여과 시간이 조절될 때, 가중치가 모든 세 개의 오차, 즉 순시 유량, 유량의 적분(처리량을 제공함), 및 유량의 미분에 기인해야 한다. 학습 프로세스의 전체 목표는 모든 다른 동작 조건을 고정되게 유지하면서, 고정된 급수 조성을 위한 유량 강하 동역학을 식별하는 것이다. 공정 제어 메커니즘들을 조정하기 위해 달라진 파라미터들은 단지 인가된 TMP 및 여 과 시간이다. 몇몇 사례에서, 역세정 유량 및 역세정 시간들이 또한 조절될 수 있다. D. 유체 여과 관리 시스템들을 제어 모드로 작동시키기 위한 방법들 도 7은 다양한 측면에 따른 여과 관리 시스템의 방법을 예시한다. 단계에서, 정압이 제1 미리 정의된 시간 동안 제1 챔버에서 제2 챔버로 흐르는 유체 상에 인가될 수 있다. 막은 유체가 제1 챔버에서 제2 챔버로 막을 투과하게 하기 위해 제1 챔버 및 제2 챔버 간에 놓일 수 있다. 일 측면에서, 제1 미리 정의된 시간은 상수 값일 수 있다. 일 측면에서, 제1 미리 정의된 시간은 미리 정의된 식에 기초한 값일 수 있다. 단계에서, 정압은 제2 미리 정의된 시간 동안 반전될 수 있다. 일 측면에서, 제2 미리 정의된 시간은 상수 값일 수 있다. 일 측면에서, 제2 미리 정의된 시간은 미리 정의된 식에 기초할 수 있다. 단계에서, 정압이 제1 미리 정의된 시간 동안 재인가될 수 있다. 제어 모드 동작은 동작 동안 여과 시스템에서의 유량의 갑작스런 또는 예상한 변화에 반응하는 것, 그리고 필수 간격을 두고 역세정 또는 CIP를 수행하는 것을 수반한다. 제어 모드는 몇몇 트레이닝 사이클이후, 공정 TMP, 정 여과시간, 및 역세정 파라미터들이 수립되면 개시된다. 이 경우 지배 PID 방정식은 다음과 같이 쓰여질 수 있다"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "여기서,"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "JAv,0은 이전 시간 단계로부터의 평균 유량이고, Qf,0은 이전 여과 단계로부터의 누적 여과액 용적(유량의 적분)이 며, 그리고"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "상기 식은 이전 여과 단계의 시작과 종료 사이 선형적인 유량 강하율이다. 도 8은 동작의 정규 모드를 도시한다. 제어 모드 동작 동안, 여과 관리 시스템은 일정 시간 간격을 두고 유량을 기록할 것이다. 또한 트레이닝 기간 동안 TMP가 수립되면, 정규 동작 동안 그것은 더 달라질 것이라고 가정된다. 정규 동작 동안, 유량은 여과 관리 시스템에 의해 학습된 동일한 패턴을 따라 감소될 것이고, 특정 시간 간격 이후, 여과 사이클은 중지되고, 역세정이 개시된 다음, 역세정 이후 여과 사이클이 재시작될 것이다. 여과 시간 및 역세정 시퀀스를 제어하는 공정은 흐름 모니터 디바이스를 사용하여 측정되는 순시 유량, 미분, 및 적분 유량(생산량)을 각각, 여과 관리 시스템에 의해 기록되는 평균 유량, 선형적인 유량 강하율, 및 이전 여과 단계 동안의 누적 생산량과 비교하는 것을 수반한다. 제어기는 비례, 미분, 및 적분 성분들에 대한 오차를 측정하고, 필수 액션을 결정한다. 예를 들어, 현재 여과 사이클 동안의 누적 생산량이 이전 사이클로부터의 누 적 생산량과 동일해지고 현재 사이클의 평균 유량 강하율이 이전 사이클과 동일해질 때, 여과 관리 시스템은 역 세정을 트리거한다. 이는 여과 시스템에 어떤 다른 입력 또는 섭동의 어떤 변화도 존재하지 않을 때의 정규 동 작 모드이다. E. 여과 흐름의 단계적 변화에 반응하여 유체 여과 관리 시스템들을 작동시키기 위한 방법들 도 9는 여과액 흐름의 단계적 변화에 반응하여 유체 여과 관리 시스템을 작동하기 위한 방법을 예시한다. 단계에서, 정압이 제1 챔버에서 제2 챔버로 흐르는 유체 상에 인가될 수 있다. 일 측면에서, 막은 유체가 제1 챔버에서 제2 챔버로 막을 투과하게 하기 위해 제1 챔버 및 제2 챔버 간에 놓인다. 단계에서, 여과 시스템 상에서 임계가 초과된다고 결정될 수 있다. 일 측면에서, 임계는 파라미터, 이를테 면, 이에 한정되는 것은 아니지만, 유체 유동률, 유체 유동률의 변화율, 미리 정의된 시간 기간 동안 막을 통한 유체 투과 용적, 막 상에 형성되는 파울링, 이들의 조합들 기타 같은 종류의 것 중 하나 이상에 기초한 임계일 수 있다. 단계에서, 임계가 초과되었다고 결정하는 것에 반응하여 역류 공정이 개시될 수 있다. 일 측면에서, 역류 공정은 미리 정의된 시간 기간 동안 적용될 수 있다. 일 측면에서, 역류 공정은 정압을 반전시키는 것을 포함할 수 있다. 일 측면에서, 반전된 압력은 상수 값일 수 있다. 일 측면에서, 반전된 압력은 미리 정의된 식에 기초 하여 결정될 수 있다. 동작 동안, 조금의 파울런트가 막에 파울링되고 그것의 유량을 갑작스럽게 감소시켜, 투과 유량의 단계적 강하 를 야기한다. 측정된 순시 유량 및 유량 강하율 이러한 단계적 변화에 대한 반응으로서 즉각적으로 변화될 것이다. 적분 응답(누적 용적)은 즉각적으로 보이지는 않을 것이나, 몇몇 후속 측정 동안 분명해질 것이다. 이제 여 과 관리 시스템은 단계적 변화에 반응하기 위한 다수의 옵션을 가질 것인 반면, 결정 프로세스의 종료 시 액션 은 여과 공정을 중지하는 것, 그리고 역세정을 트리거하는 것이다. 비레 모드에서, 여과 관리 시스템은 계속해 서 유량을 기록하고 시간 평균화를 수행할 것이며, 시간 평균이 이전 사이클의 평균 유량 미만으로 떨어지면, 역세정이 트리거될 것이다. 미분 모드에서, 여과 관리 시스템은 순시 도함수, 및 식 으로 나타낸, 선형적인 평균 도함수를 기록할 것이다. 순시 미분 응답(유량 강하율)은 큰 오차(계단 함수의 경우 무한)를 나타낼 것이라는 것, 그리고 단지 순시 미분 오차에 기초한 제어 응답은 너무 갑작스러울 것이라는 것이 분명하다. 그러나, 식 에서와 같은 선형적 인 도함수는 보다 보통의 미분 오차를 낼 것이다. 이러한 선형적인 도함수가 이전 여과 사이클로부터의 선형 도 함수보다 가파르게 되는 경우라면, 프로세스는 역세정을 트리거할 것이다. 적분 모드에서, 여과 관리 시스템은 순시 유량을 적분함으로써 계속해서 누적 생산량을 계산할 것이다. 그러나, 적분 응답은 역세정을 트리거하기 위해서는 사용되지 않을 것이다. 이러한 응답은 역세정 용적비를 계산하기 위해, 그리고 역세정이 효율적이었는지, 또는 CIP가 적용되었는지를 결정하기 위해 사용된다. 여과 관리 시스템은 여과 공정을 예상보다 일찍 중지하고, 역세정을 보다 빈번하게 하며, 그리고 지속적인 불리 한 조건 하에서(예를 들어, 역세정이 유량을 다시 증가시킬 수 없는 경우) CIP를 트리거는 것을 중지함으로써 반응할 것이다. 여과 관리 시스템이 여과 사이클에서 TMP 또는 임의의 다른 파라미터를 변경하기 위해 PID 오차 추정을 사용하 는 것을 수반하지 않을 수 있다는 것이 주의되어야 한다. 단순히 계속해서 평균 유량, 평균 미분, 및 누적 유량 을 누적하고 이들을 이전 여과 단계에서 획득되는 값들과 비교한다. 그 다음 평균 유량이 이전 사이클에서의 평 균 유량과 동일해지거나, 유량 강하율이 이전 사이클에서의 평균 유량 강하율보다 몇몇 미리 결정된 배수만큼 커지게 되면, 공정은 여과를 중지한다. 이러한 유량 관리의 수동 모드는 막이 역세정 사이클의 빈도를 변경하는 것을 통해 임의의 파울링 이벤트로부터 복원되게 한다. 그것은 유량을 회복시키기 위해 TMP를 증가시킴으로써 파울링을 심화시키지 않는다. 공정 제어 방법은 예상보다 이른 시간에 여과 공정을 중지함으로써, 막을 보다 빈 번하게 세정함으로써, 그리고 불리한 조건이 지속적인 경우, 여과 및 CIP 트리거를 중지함으로써 유량의 임의의 섭동에 반응한다. F. 여과 흐름의 단속적 변화에 반응하여 유체 여과 관리 시스템들을 작동시키기 위한 방법들 도 10은 여과액 흐름의 단속적 변화에 반응하여 유체 여과 관리 시스템을 작동하기 위한 방법을 예시한다. 단계에서, 정압이 제1 챔버에서 제2 챔버로 흐르는 유체 상에 인가될 수 있고, 이때 막은 유체 가 제1 챔버에서 제2 챔버로 막을 투과하게 하기 위해 제1 챔버 및 제2 챔버 간에 놓인다. 단계에서, 제1 챔버에서 제2 챔버로 막을 가로질러 흐르는 유체와 연관된 적어도 하나의 파라미터가 결정 될 수 있다. 단계에서, 디파울링 공정이 적어도 하나의 임계값과 결정된 적어도 하나의 파라미터의 비교에 기초하여 개시될 수 있다. 일 측면에서, 디파울링 공정은 역세정 공정을 포함한다. 일 측면에서, 디파울링 공정은 화학적 세정 공정을 포함한다. 일 측면에서, 디파울링 공정은 가압 펄싱 공정을 포함한다. 일 측면에서, 디파울링 공정 은 공기 세척 공정을 포함한다. 일 측면에서, 디파울링 공정은 화학적 펄스 공정을 포함한다. 일 측면에서, 디 파울링 공정은 공급 흐름 반전 공정을 포함한다. 일 측면에서, 디파울링 공정은 제자리 세정 공정을 포함한다. 유량이 갑작스럽게 감소되고 그 다음 일정 시간 이후 회복되는 경우(펄스 함수), 여과 시스템의 반응은 역세정 의 빈도를 증가시켜, 펄스 동안 여과 시간을 낮추는 것, 그리고 그 다음 원래 동작 조건이 회복된 이후 다시 보 다 적은 빈도의 역세정 그리고 보다 긴 여과 단계들로 점진적으로 회복시키는 것이어야 한다. 그러한 조건은 사 건들 이를테면 단기간 공급 용질 농도의 증가에 의해 트리거될 수 있고, 종래 유량 제어 메커니즘들은 유량 강 하에 반응하여 TMP를 증가시킴으로써 그리고 파울링 공정을 심화시킴으로써 이러한 사건들 동안 막 파울링을 악 화시킨다. 본 방법에서, 정압 운용은 구동력을 변경하지 않아 파울링을 심화시킨다. 도 11은 보다 급격한 유량 강하를 트리거하는 펄스 이벤트 동안 여과 사이클들의 통상적인 시퀀스를 도시한다. 도면은 시간에 대한 수직축에 유량을 나타낸다. 상황을 명확히 실증하고 유량 강하 거동의 지능형 관리의 개념 을 설명하기 위해, 유량 강하 거동이 선형이라고 가정하자. 뿐만 아니라, 각 여과 사이클에 걸쳐 초기 유량(J0) 및 초기 유량(JN) 간에 각 여과 사이클마다 차이가 있으며, 역세정이 각 사이클 이후 유량을 초기 유량으로 회복 시킨다. 이러한 단순화된 가정들은 상이한 적용예들에 따라 경감될 수 있다. 예를 들어, 유량 복원이 역세정 이 후 완전하지 않을 수 있다. 또한, 유량 강하 거동이 선형이 아닐 수 있다. 각 여과 사이클 동안 평균 유형은 원 들로 표기되고, 고정된 값(JAv)을 갖는다. 펄스 이벤트가 제3 여과 사이클 동안 몇몇 지점에서 유량 강하율을 변경한다고 가정하자. 이러한 펄스 이벤트로 인한 보다 빠른 유량 강하율은 유량 대 시간 곡선의 경사를 보다 가파르게 만든다. 이러한 상이한 유량 강하율 로 가면서, 이러한 사이클 동안 예상보다 일찍 최소 유량(JN)에 이른다. 예상보다 일찍 평균 값에 이르더라도, 이러한 사이클의 평균 유량은 여전히 JAv이다. 이는 여과 사이클 시간이 tf,3< tf,2임을 암시한다. 여과의 누적 생 산량은 또한 이러한 사이클에서 보다 낮다. JN에 이르면, 역세정이 시작되고, 역세정 이후 제4 사이클의 초기 유 량(J0)에 이른다. 그러나, 제4 사이클에서, 유량 강하율이 보다 크고, 그 결과 이전 사이클보다 일찍 평균 유량 및 JN에 이른다. 다시 말해서, tf,4가 tf,3보다 작다. 뿐만 아니라, 여과의 누적 생산량은 또한 여과 사이클로 부터 낮아진다. 펄스 이벤트로 인해 가속된 파울링은 여과 사이클들의 지속기간이 감소되게 하고, 역세정 사이클들의 빈도가 증가되게 한다. 사이클에서, 펄스 이벤트가 진정되고, 원래 유량 강하율이 회복된다. 이는 사이클와 비교하여 여과 시간 을 즉각적으로 증가시킨다. 사이클에서, 제1 여과 사이클의 원래 파라미터들이 회복된다. 그에 따라, 유량 강하 가속을 트리거하는 펄스 이벤트들은 여과 사이클들의 지속기간을 감소시키고, 역세정 사이클들의 빈도를 증가시킨다. 이것이 막 파울링을 야기하는 임의의 유형의 섭동에 대한 반응으로서 여과액의 생산량을 낮추더라 도, 메커니즘은 막의 비가역적 또는 적극적 파울링을 방지한다. 도 12는 여과 관리 시스템의 방법을 예시한다. 단계에서, 정압 운용 동안 유체 여과액 처리량의 변 화 및 일정한 여과액 처리량 운용 동안 압력의 변화 중 적어도 하나가 모니터링될 수 있다. 일 측면에서, 유체 여과액 처리량의 변화를 모니터링하는 것은 미리 정의된 시간 기간 동안 막을 가로지르는 유량을 측정하는 것을 포함할 수 있다. 예로서, 유량의 변화는 흐름 센서를 통해 측정될 수 있다. 일 측면에서, 압력의 변화를 모니터 링하는 것은 미리 정의된 시간 기간 동안 압력을 측정하는 것을 포함할 수 있다. 예로서, 압력의 변화는 압력 센서를 통해 측정될 수 있다. 단계에서, 파울링 메커니즘은 여과액 처리량의 변화 및 압력의 변화 중 적어도 하나에 기초하여 결정될 수 있다. 일 측면에서, 파울링 메커니즘은 하나 이상의 미리 결정된 파울링 모델에 따라 유량의 변화 및/또는 압력의 변화에 대한 수학적 분석을 수행하는 것을 포함할 수 있다. 예로서, 하나 이상의 미리 결정된 파울링 모 델은 헤르미아(Hermia) 모델, 변형된 헤르미아 모델, 또는 직렬 여과 저항 모델을 포함할 수 있다. 일 측면에서, 파울링 메커니즘은 하나 이상의 미리 결정된 파울링 모델에 따라 유량의 변화 및/또는 압력의 변화에 대한 수학적 분석을 수행하는 것을 포함할 수 있다. 예로서, 하나 이상의 미리 결정된 파울링 모델은 헤르미아 (Hermia) 모델, 변형된 헤르미아 모델, 또는 직렬 여과 저항 모델을 포함할 수 있다. 일 측면에서, 파울링 메커 니즘은 농도 분극, 화학 활성 분자들의 유기물 흡착성, 염 및 수산화물의 석출로 인한 계층 구조, 큰 현탁 입자 또는 작은 콜로이드 입자의 침전으로 인한 단단한 침전물 및 구멍 차단, 비활성 거대분자의 침전으로 인한 겔 형성, 및 생리 활성 유기체들의 침전, 생장으로 인한 미생물-파울링 기타 같은 종류의 것을 포함할 수 있다. 식 12는 유량 강하에 미치는 막 파울링의 영향을 소정의 구동력에 대해 흐름을 방해하는 저항의 누적으로서 설 명한다."}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "여기서 J는 막을 통하는 투과 유량이고, ΔP는 막경류 압력 구동력이고, μ는 유체 속도이고, Rtot는 총 유압 저 항이고, Rm은 고유 막 저항이고, Rcp는 농도 분극에 의해 야기되는 저항이고, Ra는 용질 흡착에 의해 야기되는 저 항이고, Rp는 구멍 막힘 및 케이크 형성에 의해 야기되는 저항이며, Rg는 표면 겔 형성에 의해 야기되는 저항이 다. 일 측면에서, 유량-압력 곡선은 단지 내재 막 저항이 인자이기 때문에, 어떤 파울링도 발생하지 않았을 때 균일 한 선형일 수 있다. 그러나, 파울링의 개시가 파울링의 특정 메커니즘 및 투과 흐름에 대해 추가된 총 저항에 미치는 그것들의 영향에 따라 다양한 수준으로 경사가 변화할 때 반영될 수 있다. 예를 들어, 입자 파울링의 특 정 메커니즘은 식 13 및 식 14에 대한 솔루션에 따라 유량 대 시간을 일련의 이전부터 존재하던 파울링 모델에 맞춤으로써 결정될 수 있다."}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "여기서 t는 여과 시간이고, k 및 n은 여과 공정을 특징짓는 상수들이며, U는 다양한 투과 용적(V), 또는 막경유 압력(ΔP) 중 각각, 정압 또는 일정한 유량 운용에 따른 어느 하나이다. 그에 따라, d2t/dU2를 dt/dU에 대해 나 타냄으로써 그리고 막힘 지수(n)의 값을 결정함으로써, 상이한 막힘 메커니즘들이 단일 그래프로부터 식별될 수 있다. 도 13은 상이한 파울링 메커니즘에 대한 솔루션들 및 관찰된 특정 입자 파울링 메커니즘을 결정하기 위해 적합도 테스트가 적용되는 단일 유량 대 시간 곡선을 도시한다(Maiti, Sadrezadeh 외. 2012). 덧붙여, 헤르미아 경험적 모델을 변형함으로써 십자-흐름 여과에 대한 일반적인 식이 다음과 같이 사용될 수 있다: 여기서 Jp는 투과 유량(m/s)이고, t는 여과 시간(s)이고, KCF는 특정 파울링 메커니즘에 따른 현상학적 계수이고, Jpss는 정상-상태 투과 유량(m/s)이며, n은 막힘 지수이며 여기서 다시 각각, 전체 구멍 막힘, 중간 구멍 협착, 보통 구멍 막힘, 및 케이크 여과/겔 형성에 대해 n = 2, 1.5, 1 및 0이다. 이러한 모델들을 사용한 막 파울링의 평가의 예는 또한 (Chang, Yang 외, \"Assessing the fouling mechanisms of high-pressure nanofiltration membrane using the modified Hermia model and the resistance-in-series model(변형된 헤르 미아 모델 및 직렬 여과 저항 모델을 사용한 고압 나노여과 막의 파울링 메커니즘들 평가)\" Separation and Purification Technology 79 329-336)에 보인다. 따라서, 지능형 학습 프로세스는 유효한 파울링 메커 니즘 및 채용되기에 가장 효율적이고 경제적인 세정 프로세스들을 결정하기 위해 경험적으로 생성된 유량/압력 대 시간 곡선들에 대한 실시간 데이터 분석을 수행할 수 있다. 단계에서, 결정된 파울링 메커니즘에 기초하여 세정 프로토콜이 선택될 수 있다. 일 측면에서, 세정 프로 토콜을 결정하는 것은 세정 방법 및 세정 방법과 연관된 하나 이상의 파라미터를 선택하는 것을 포함할 수 있다. 예로서, 세정 방법은 역플러싱 방법을 포함할 수 있다. 예로서, 하나 이상의 파라미터는 압력, 지속기간, 유동률, 온도, 특정 화학 첨가제, 및 특정 화학 첨가제의 양 중 하나 이상을 포함할 수 있다. 일 측면에서, 특 정 화학 첨가제는 산성물, 염기성물, 산화제, 킬레이트화제 기타 같은 종류의 것 중 하나 이상을 포함할 수 있 다. 상이한 유형들의 세정 프로토콜은 파울링 제어를 위해 채용될 수 있으나, 소정의 세정 프로토콜의 유효성은 제 거될 파울런트에 고도로 따를 수 있다. 표 2는 다양한 유형의 막 파울런트를 가장 효율적인 세정 기술과 짝을 이룬다: 표 2 파울런트/유량 강하 메커니 즘현장 세정 기술 농도 분극 교차 유동률, 공급 흐름 반전, 및/또는 고 빈도 투과 역세정을 증가시킴 으로써 표면 물질 전달을 강화 화학 활성 분자들에 의한 유 기물 흡착부식제, 산화제, 및/또는 계면 활성제를 첨가한 열적 강화 CEB 염 및 수산화물의 석출로 인 한 계층 구조경도 및 금속 산화물들 - 산성물 및/또는 킬레이트제가 첨가된 CEB 실리카 - 부식제가 첨가된 CEB 큰 현탁 및 작은 콜로이드 입자들의 침전으로 인한 케 이크 및 구멍 막힘무기물 - 고압 투과 역플러싱 또는 산성물이 첨가된 CEB 유기물 - 부식제 및/또는 산화제가 첨가된 고압 CEB 비활성 거대 분자의 침전으 로 인한 겔-형성고압 투과 역플러싱 또는 부식제, 산화제, 및/또는 계면 활성제가 첨가 된 열적 강화 고압 CEB 생물학적 활성 유기체의 침 전 및 성장에 의한 미생물- 파울링화학 살균제 및/또는 효소가 첨가된 CEB 일 측면에서, 선택 여과 시스템들, 이를테면 NF 및 RO는 그의 향이 전면적 시스템 데이터를 모니터링함으로써 효과적으로 포착되지 않는 이기종 그리고 공간-종속적 파울링을 겪는다. 이러한 적용예들에서, 지능형 여과 관 리 시스템의 실시예는 전면적 여과 시스템에 따라 전략적으로 배치된 독립적 파울링 모니터들과의 통신을 포함 할 것이다. 파울링 모니터들의 성능 데이터를 모니터링하는 것은 파울링 및 유량 강하의 조기 징후들에 반응하 기 위해 지능형 여과 관리 시스템에 보다 높은 민감도를 제공할 것이다. 일 측면에서, 여과기 성능 및 무결성에 대한 근면한 모니터링 및 테스팅은 여과기의 남은 유효 수명의 확실한 이해를 전개하는 데 그리고 교체가 필요할 때를 결정하는 데 중요할 수 있다. 예를 들어, 즉각적인 고장 반응에 대한 막 무결성 테스팅의 수단은 타겟이 되는 무결성 테스팅 동안 시각적 모니터링을 포함할 수 있다. 비디오 캡처가 하나 이상의 막 요소의 실시간 모니터링을 위해 사용될 수 있고, 그렇게 함으로써 의심스러운 막 요소들 에 대한 임의의 무결성 침해를 검출할 수 있다. 특정 측면에서, 여과 관리 시스템은 하나 이상의 막 요소의 투과 질을 지속적으로 모니터링할 수 있다. 특정 막 의 무결성이 문제가 될 때, 여과 관리 시스템은 현장 기포 무결성 테스트를 위해 하나 이상의 요소를 분리할 수 있다. 무결성 침해가 검출되면, 여과 관리 시스템은 적절한 경보를 송신하고 유지보수를 위해 하나 이상의 결함 이 있는 막을 분리할 수 있으며, 그에 따라, 복구 속도를 최대화하고 전체 여과 시스템 성능에 미치는 영향을 최소화할 수 있다. 이러한 개시된 시스템 및 방법은 또한 장비 오동작, 누설 기타 같은 종류의 것으로 인한 여 과 시스템 고장 발생 시 실시간 시스템 진단 및 유지보수 반응을 위해 다른 시스템 메트릭스를 통합하도록 확장 될 수 있다. 일 측면에서, 방법들 및 시스템들은 하나 이상의 성능 메트릭스에 대한 실시간 경향 분석을 수행할 수 있다. 방 법들 및 시스템들은 소정의 시설의 동작 진단, 이를테면 여과기의 남은 수명 및 예상 교체 일자를 모니터링할 수 있다. 예를 들어, 실시간 경향 분석은 시스템 무결성 침재가 발생하는지 그리고/또는 발생한 때를 결정하기 위해 투과 수질 경향을 분석함으로써 실현될 수 있다. 일 측면에서, 여과 및 회귀 분석이소정의 여과 시스템에 대해 미리 결정된 최소 투과성에 이를 때를 추정하기 위해 사용될 수 있다. 적당한 무결성 침해자 발생했다고 결정되면, 시스템 중단 시간을 최소화하고 전체 시스템 고장을 방지하기 위해 순시 및 자동 반응이 발생될 수 있다. 일 측면에서, 개시된 시스템들 및 방법들은 일정한 유량 또는 정압에서의 운용과 관계 없이 임의의 여과 시스템에 대해 적용가능할 수 있다. 도 14는 여과 관리 시스템의 방법을 예시한다. 단계에서, 여과 시스템의 하나 이상의 여과기와 연 관된 하나 이상의 파라미터가 모니터링될 수 있다. 일 측면에서, 하나 이상의 파라미터는 여과기 경유 압력, 투 과 유량, 투과 탁도, 투과 염도, 투과 pH, 투과 염도, 투과 색상, 투과 경도, 총 투과 유기물 농도, 하나 이상 의 미리 정의된 투과 이온의 농도, 하나 이상의 미리 정의된 유기 분자의 농도를 포함할 수 있다. 이러한 파라 미터들 중 많은 파라미터, 이를테면 pH, 염도, 색상, 및 탁도는 현장에서 측정될 수 있으나, 몇몇 파라미터, 이 를테면 타겟 무기 및 유기 분자들의 농도들은 주기적 샘플링 및 현장 외 측정을 필요로 할 수 있다. 예를 들어, 색상 및 탁도는 통합 프로브를 사용하여 투과 또는 공급 용액을 통과하는 광량을 추적함으로써 분광 측정법으로 측정될 수 있다. 반면 무기 및 유기 구성 성분들의 타겟 농도들은 독립된 기구들, 이를테면 유도 결합된 플라즈 마 광학 방사 분광계, 가스 크로마토그래피-질량 분석계 기타 같은 종류의 것을 사용하여 측정될 수 있다. 단계에서, 하나 이상의 여과기의 상태가 모니터링된 하나 이상의 파라미터에 기초하여 결정될 수 있다. 일 측면에서, 모니터링된 하나 이상의 파라미터에 기초하여 하나 이상의 여과기의 상태를 결정할 때, 모니터링 된 하나 이상의 파라미터에 기초하여 통계적 분석이 수행될 수 있다. 일 측면에서, 통계적 분석은 여과 및 평활 분석, 회귀 및 경향 분석을 포함할 수 있다. 예로서, 여과 및 평활 분석은 Wiener 분석, Kalman 분석, Butterworth 분석, Chebyshev 분석, Elliptical 분석, Bessel 분석, Gaussian 분석, 이동 평균 분석, 및 Savitsky-Golay 분석을 포함할 수 있다. 예로서, 회귀 및 경향 분석은 선형 회귀 분석, 다중 회귀 분석, 요인 회귀 분석, 다항 회귀 분석, 반응 표면 회귀, 혼합물 표면 회귀, 일원 배치 분산 분석(ANOVA; one-way analysis of variance), 주 효과 ANOVA 분석, 요인 ANOVA 분석, 공분산 분석, 등기울기 분석, 선형 피팅 분석, 최소-자승 피팅 분석, Kendell 테스트 분석, Sen 기울기 테스트 분석, Wilcoxon-Mann-Whitney 단계 경향 분석, 유전자 및 뉴럴 네트워크 분석, 이들의 조합들 기타 같은 종류의 것을 포함할 수 있다. 일 측면에서, 하나 이상의 여과기의 상태를 결정하는 것은 하나 이상의 여과기의 수명을 추정하는 것을 포함할 수 있다. 일 측면에서, 추정된 수명이 미리 정의된 임계(예를 들어, 2일) 미만인 경우 통지가 송신될 수 있다. 예로서, 통지는 하나 이상의 여과기에 대한 추정 교체 일자를 포함할 수 있다. 여과기 상태는 특정 여과기 속성 들, 이를테면 투과성(예를 들어, 여과기 경유 압력 및 여과액 유동률), 비가역적 파울링의 수준, 및 무결성 테 스팅에 대해 모니터링될 수 있다. 여과기 상태는 또한 동작 파라미터들 및 성능 메트릭스, 이를테면 인가 압력, 유량 유지보수(예를 들어, 기계적 및 화학적 유지보수, 제자리 세정 유지보수), 및 여과액 질(예를 들어, 탁 도)에 대해 모니터링될 수 있다. 이러한 메트릭스의 실시간 기록 값은 모듈의 나머지 수명을 계산하기 위해 미 리 결정된 임계값과 바교된다. 투과성 측정치들은 실시간으로 기록될 수 있고 시간이 지남에 따른 예측 투과성 경향을 추정하기 위한 통계적 모델에 사용될 수 있다. 현재 여과기가 임계 투과성을 실현하기 위해 모델에 의해 예측되는 시간량은 남은 모듈 수명이다. 남은 수명 값이 미리 결정된 임계에 이를 때, 여과기가 교체될 수 있다. 일 측면에서, 하나 이상의 여과기의 상태를 결정하는 것은 하나 이상의 여과기의 유형을 결정하는 것을 포함할 수 있다. 예로서, 하나 이상의 여과기의 유형은 관형 폴리머 막, 중공 섬유 막, 나권형 막, 관형 세라믹 막, 이 들의 조합들 기타 같은 종류의 것을 포함한다.일 측면에서, 하나 이상의 여과기의 상태는 다가올 무결성 침해, 검출된 무결성 침해, 다가올 투과성 손실, 및 검출된 투과성 손실을 포함할 수 있다. 단계에서, 하나 이상의 유지보수 절차가 결정된 상태에 기초하여 수행될 수 있다. 하나 이상의 유지보수 절차는 상태에 기초하여 이용될 수 있다. 일 측면에서, 하나 이상의 유지보수 절차는 여과기 분리 절차, 여과기 복구 절차, 여과기 교체 절차, 여과기 고정 절차, 이들의 조합들 기타 같은 종류의 것을 포함할 수 있다. 일 측면에서, 특정 여과기 상태에 대한 반응은 무결성 침해에 의해 야기되든 또는 투과성 손실에 의해 야기되든 지에 관계 없이, 사용되는 시스템의 여과기의 유형에 따라 달라질 수 있다. 예를 들어, 중공 섬유 막들에 대해 섬유 손상이 발생할 때, 손상된 섬유 막들은 파손된 섬유의 종단(들)에 작은 핀들 또는 에폭시를 삽입함으로써 분리될 수 있거나 서비스에서 영구적으로 제거될 수 있다. 다른 예로서, 나권형 나노여과 및 역삼투 막들이 손 상 이후 교체될 수 있다. 막 손상 및 교체와 연관된 고 빈도 및 비용을 고려하면, 이른 손상의 검출 및 적절한 준비가 경제적으로 효율적인 교체 실시에 있어 매우 가치있을 수 있다. 도 15 및 도 16은 본 출원에 설명된 여과 관리 시스템 및 방법들을 이용한 실험 결과들을 예시한다. 프로그램가 능한 로직 제어기가 인가된 정압으로 여과 시스템을 작동시키도록 프로그램되었다. 여과 시스템의 유량은 미리 계산된 최소에 이를 때까지 자연적으로 감속하게 되었으며, 이는 도 15에 예시된 바와 같이, 그 다음 유지보수 절차, 예를 들어, 여과액 역세정을 트리거할 수 있다. 미리 정의된 유지보수 절차 빈도를 이용하는 종래 여과 공정들과 달리, 여과 관리 시스템은 여과 시스템 성능이 적절한 유지보수 절차 이를테면 세정 프로토콜을 지시 하게 함으로써 환경 조건에 적응될 수 있다. 도 16은 여과 관리 시스템이 그에 따라, 환경 조건, 이를테면 급수 질 및 온도의 극적인 변동에 어떻게 적응할 수 있는지를 도시한다. 구체적으로, 기름 농도 및 물 온도의 극적인 선회 결과 초기 스타트업 단계 동안 유량이 상당하게 손실될 수 있다. 이에 반응하여, 여과 관리 시스템은 각각 \"제자리 세정\"(CIP)으로서 표기되는, 역세정의 빈도뿐만 아니라 화학정 세정의 횟수를 증가시킬 수 있다. 여과 관리 시스템은 대략 24 시간의 동작 이후 결국 막 성능을 안정화하며, 그 결과 유량 강하 및 CIP 빈도를 최소화 하게 된다. 대표적인 측면에서, 방법들 및 시스템들은 도 17에 예시되고 아래에 설명된 바와 같이 컴퓨터 상에 구현 될 수 있다. 유사하게, 개시된 방법들 및 시스템들은 하나 이상의 위치에서 하나 이상의 기능을 수행하기 위해 하나 이상의 컴퓨터를 이용할 수 있다. 도 17은 개시된 방법들을 수행하기 위한 대표적인 가동 환경을 예시하는 블록도이다. 이러한 대표적인 가동 환경은 단지 가동 환경의 예이고 가동 환경 아키텍처의 용도 또는 기능의 범 위에 관해 어떠한 제한도 뒷받침하도록 의도되지 않는다. 또한 가동 환경은 대표적인 가동 환경에 예시된 구성 요소들의 임의의 구성요소 또는 조합에 관해 어떠한 종속성 또는 요건도 갖지 않도록 해석되어야 한다. 본 방법들 및 시스템들은 많은 다른 범용 또는 전용 컴퓨팅 시스템 환경들 또는 구성으로 동작될 수 있다. 시스 템들 및 방법들과 사용하기에 적합할 수 있는 주지의 컴퓨팅 시스템들, 환경들 및/또는 구성들의 예들은 개인용 컴퓨터들, 서버 컴퓨터들, 랩탑 디바이스들, 및 멀티프로세서 시스템들을 포함하지만, 이것들에 한정되지는 않 는다. 추가 예들은 셋탑 박스들, 프로그램가능한 소비자 전자장치들, 네트워크 PC들, 미니컴퓨터들, 메인프레임 컴퓨터들, 상기 시스템들 또는 디바이스들 중 임의의 시스템 또는 디바이스를 포함하는 분산 컴퓨팅 환경들 기 타 같은 종류의 것을 포함한다. 개시된 방법들 및 시스템들의 프로세싱은 소프트웨어 구성요소들에 의해 수행될 수 있다. 개시된 시스템들 및 방법들은 하나 이상의 컴퓨터 또는 다른 디바이스에 의해 실행되는, 컴퓨터-실행가능한 명령들, 이를테면 프로 그램 모듈들의 일반적인 맥락에서 설명될 수 있다. 일반적으로, 프로그램 모듈들은 컴퓨터 코드, 루틴들, 프로 그램들, 객체들, 구성요소들, 데이터 구조들 및/또는 특정 작업들을 수행하거나 특정 추상 데이터 유형들을 구 현하는 기타 같은 종류의 것을 포함한다. 개시된 방법들은 또한 작업들이 통신 네트워크를 통해 연결되는 원격 프로세싱 디바이스들에 의해 수행되는 그리드-기반 및 분산 컴퓨팅 환경들에서 실시될 수 있다. 분산 컴퓨팅 환 경에서, 프로그램 모듈들은 메모리 저장 디바이스들을 포함하여 로컬 및/또는 원격 컴퓨터 저장 매체에 위치될 수 있다."}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "나아가, 해당 기술분야의 통상의 기술자는 본 출원에 개시된 시스템 및 방법들이 컴퓨터 형태의 범용 컴 퓨팅 디바이스를 통해 구현될 수 있다는 것을 이해할 것이다. 컴퓨터는 하나 이상의 구성요소, 이를테면 하나 이상의 프로세서, 시스템 메모리, 및 하나 이상의 프로세서를 포함하여 컴퓨터의 다양한 구성요소를 시스템 메모리에 접속시키는 버스를 포함할 수 있다. 다수의 프로세서의 경우, 시스템은 병렬 컴퓨팅을 이용할 수 있다.버스는 다양한 버스 아키텍처 중 임의의 아키텍처를 사용하는 몇몇 가능한 유형의 버스 구조, 이를테면 메모리 버스, 메모리 제어기, 주변 버스, 가속된 그래픽 포트, 및 프로세서 또는 로컬 버스 중 하나 이상을 포 함할 수 있다. 예로서, 그러한 아키텍처들은 산업 표준 아키텍처(ISA) 버스, 마이크로 채널 아키텍처(MCA) 버스, 증강된 ISA(EISA) 버스, 비디오 전자장치 표준 협회(VESA) 로컬 버스, 가속된 그래픽 포트(AGP) 버스, 및 주변 구성요소 상호접속(PCI), PCI-고속 버스, 개인용 컴퓨터 메모리 카드 산업 협회(PCMCIA), 유니버셜 시리얼 버스(USB) 기타 같은 종류의 것을 포함할 수 있다. 버스, 및 본 설명에 명시된 모든 버스는 또한 유선 또 는 무선 네트워크 연결을 통해 구현될 수 있고, 컴퓨터의 구성요소들, 이를테면 하나 이상의 프로세서 , 대용량 저장 디바이스, 운영 체제, 데이터 프로세싱 소프트웨어, 유량 데이터 , 네트워크 어댑터, 시스템 메모리, 입력/출력 인터페이스, 디스플레이 어댑터, 디스플레이 디바이스, 및 인간-기계 인터페이스 중 하나 이상은 이러한 형태의 버스들을 통해 연결 되어, 하나 이상의 원격 컴퓨팅 디바이스(1714a,b,c) 내에 물리적으로 별개의 위치들에 포함되어, 사실상 완전 히 분산된 시스템을 구현할 수 있다. 컴퓨터는 통상적으로 다양한 컴퓨터 판독가능한 매체를 포함한다. 대표적인 판독가능한 매체는 컴퓨터 에 의해 액세스가능한 임의의 이용가능한 매체일 수 있고, 예를 들어, 휘발성 및 비-휘발성 매체, 착탈가 능한 그리고 비-착탈가능한 매체 양자를 포함하고 한정적인 것으로 의도되지 않는다. 시스템 메모리는 휘 발성 메모리, 이를테면 랜덤 액세스 메모리(RAM), 및/또는 비-휘발성 메모리, 이를테면 판독 전용 메모리(ROM) 형태의 컴퓨터 판독가능한 매체를 포함할 수 있다. 시스템 메모리는 통상적으로 데이터 이를테면 유량 데 이터 및/또는 하나 이상의 프로세서에 의해 액세스가능하고/하거나 동작되는 프로그램 모듈들 이를 테면 운영 체제 및 데이터 프로세싱 소프트웨어를 포함할 수 있다. 다른 측면에서, 컴퓨터는 또한 다른 착탈가능한/비-착탈가능한, 휘발성/비-휘발성 컴퓨터 저장 매체를 포 함할 수 있다. 대용량 저장 디바이스는 컴퓨터 코드, 컴퓨터 판독가능한 명령들, 데이터 구조들, 프로그 램 모듈들, 및 컴퓨터에 대한 다른 데이터의 비-휘발성 제공을 제공할 수 있다. 예를 들어, 대용량 저장 디바이스는 하드 디스크, 착탈가능한 자기 디스크, 착탈가능한 광 디스크, 자기 카세트들 또는 다른 자기 저장 디바이스들, 플래시 메모리 카드들, CD-ROM, 디지털 다용성 디스크들(DVD) 또는 다른 광 저장장지, 랜덤 액세스 메모리들(RAM), 판독 전용 메모리들(ROM), 전기적으로 소거가능한 프로그램가능한 판독-전용 메모리 (EEPROM) 기타 같은 종류의 것일 수 있다. 임의로, 임의의 다수의 컴퓨터 모듈이 예로서, 운영 체제 및 데이터 프로세싱 소프트웨어를 포함하 여, 대용량 저장 디바이스 상에 저장될 수 있다. 운영 체제 및 데이터 프로세싱 소프트웨어 중 하나 이상(또는 이들의 몇몇 조합)이 프로그래밍 및 데이터 프로세싱 소프트웨어의 요소들을 포함할 수 있다. 유량 데이터는 또한 대용량 저장 디바이스 상에 저장될 수 있다. 유량 데이터는 해"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "당 기술분야에 알려진 하나 이상의 데이터베이스 중 임의의 데이터베이스에 저장될 수 있다. 그러한 데이터베이 스들의 예들은 DB2®, Microsoft® Access, Microsoft® SQL Server, Oracle®, mySQL, PostgreSQL 기타 같은 종류의 것을 포함한다. 데이터베이스는 네트워크 내에 다수의 위치에 걸쳐 일원화 또는 분산될 수 있다. 일 측면에서, 사용자는 입력 디바이스(미도시)를 통해 명령들 및 정보를 컴퓨터로 입력할 수 있다. 그러 한 입력 디바이스들의 예들은 키보드, 포인팅 디바이스(예를 들어, 컴퓨터 마우스, 원격 제어), 마이크로폰, 조 이스틱, 스캐너, 촉각 입력 디바이스들, 이를테면 글로브들, 및 다른 신체 커버링들, 모션 센서 기타 같은 종류 의 것을 포함하지만, 이것에 한정되지는 않는다. 이러한 및 다른 입력 디바이스들은 버스에 접속되는 인 간-기계 인터페이스를 통해 하나 이상의 프로세서에 연결될 수 있지만, 다른 인터페이스 및 버스 구조들, 이를테면 병렬 포트, 게임 포트, IEEE 1394 포트(또한 Firewire 포트로서도 공지됨), 직렬 포트, 네트 워크 어댑터, 및/또는 유니버셜 시리얼 버스(USB)에 의해 연결될 수 있다. 또 다른 측면에서, 디스플레이 디바이스는 또한 인터페이스, 이를테면 디스플레이 어댑터를 통해 버스에 연결될 수 있다. 컴퓨터는 하나보다 많은 디스플레이 어댑터를 가질 수 있고, 컴퓨터 는 하나보다 많은 디스플레이 디바이스를 가질 수 있다는 것이 고려된다. 예를 들어, 디스플레이 디바이스는 모니터, LCD(액정 디스플레이), 발광 다이오드(LED) 디스플레이, 텔레비전, 스마트 렌즈, 스 마트 안경, 및/또는 프로젝터일 수 있다. 디스플레이 디바이스에 더하여, 다른 출력 주변 디바이스들은 입력/출력 인터페이스를 통해 컴퓨터에 연결될 수 있는 구성요소들, 이를테면 스피커들(미도시) 및 프린터(미도시)를 포함할 수 있다. 방법들의 임의의 단계 및/또는 결과는 임의의 형태로 출력 디바이스에 출력 될 수 있다. 그러한 출력은 이것에 한정되지는 않지만, 텍스트, 그래픽, 애니메이션, 청각, 촉각 기타 같은 종 류의 것을 포함하여, 시각적 표현의 임의의 형태일 수 있다. 디스플레이 및 컴퓨터는 하나의 디바이스, 또는 별개의 디바이스들의 부분일 수 있다. 컴퓨터는 하나 이상의 원격 컴퓨팅 디바이스(1714a,b,c)에 로직 연결들을 사용하여 네트워킹된 환경을 작 동할 수 있다. 예로서, 하나 이상의 원격 컴퓨팅 디바이스(1714a,b,c)는 개인용 컴퓨터, 컴퓨팅 스테이션(예를 들어, 워크스테이션), 휴대용 컴퓨터(예를 들어, 랩탑, 모바일 폰, 태블릿 디바이스), 스마트 디바이스(예를 들 어, 스마트 폰, 스마트 워치, 활동 추적기, 스마트 어패럴, 스마트 액세서리), 보안 및/또는 모니터링 디바이스, 서버, 라우터, 네트워크 컴퓨터, 피어 디바이스, 에지 디바이스 또는 다른 공통 네트워크 노드 등일 수 있다. 컴퓨터 및 원격 컴퓨팅 디바이스(1714a,b,c) 간 로직 연결들은 네트워크, 이를테면 로컬 영역 네트워크(LAN) 및/또는 일반 광역 네트워크(WAN)를 통해 이루어질 수 있다. 그러한 네트워크 연결들은 네 트워크 어댑터를 통할 수 있다. 네트워크 어댑터는 유선 및 무선 환경들 양자에 구현될 수 있다. 그러한 네트워킹 환경들은 전 주택들, 사무실들, 기업 컴퓨터 네트워크들, 인트라넷들, 및 인터넷에서 극히 평 범한 것이며 많이 나타나고 있다. 예시를 위해, 애플리케이션 프로그램들 및 다른 실행가능한 프로그램 구성요소들 이를테면 운영 체제는, 그러한 프로그램들 및 구성요소들이 컴퓨팅 디바이스의 상이한 저장 구성요소들에 다양한 경우로 존재할 수 있고, 컴퓨터의 하나 이상의 프로세서에 의해 실행된다고 인식되더라도, 별개의 블록들로서 본 출원에 예시된다. 데이터 프로세싱 소프트웨어의 구현은 컴퓨터 판독가능한 매체의 몇몇 형태 상에 저장 되거나 그것들에 걸쳐 전송될 수 있다. 개시된 방법들 중 임의의 방법은 컴퓨터 판독가능한 매체 상에 구체화되 는 컴퓨터 판독가능한 명령들에 의해 수행될 수 있다. 컴퓨터 판독가능한 매체는 컴퓨터에 의해 액세스될 수 있 는 임의의 이용가능한 매체일 수 있다. 예로서 그리고 한정적인 것도 의도되지 않고, 컴퓨터 판독가능한 매체는 \"컴퓨터 저장 매체\" 및 \"통신 매체\"를 포함할 수 있다. \"컴퓨터 저장 매체\"는 정보, 이를테면 컴퓨터 판독가능 한 명령들, 데이터 구조들, 프로그램 모듈들, 또는 다른 데이터의 저장을 위해 임의의 방법들 또는 기술로 구현 된 휘발성 및 비-휘발성, 착탈가능한 그리고 비-착탈가능한 매체를 포함할 수 있다. 대표적인 컴퓨터 저장 매체 는 RAM, ROM, EEPROM, 플래시 메모리 또는 다른 메모리 기술, CD-ROM, 디지털 다용성 디스크들(DVD) 또는 다른 광 저장장치, 자기 카세트들, 자기 테이프, 자기 디스크 저장 또는 다른 자기 저장 디바이스들, 또는 원하는 정 보를 저장하기 위해 사용될 수 있고 컴퓨터에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 방법들 및 시스템들은 인공 지능(AI) 기술들 이를테면 기계 학습 및 반복 학습을 채용할 수 있다. 그러한 기술 들의 예들은 전문가 시스템들, 사례 기반 추론, 베이즈 네트워크들, 거동 기반 AI, 뉴럴 네트워크들, 퍼지 시스 템들, 진화 연산(예를 들어, 유전자 알고리즘들), 무리지성(예를 들어, 개미 알고리즘들), 및 하이브리드 지능 형 시스템들(예를 들어, 뉴럴 네트워크를 통해 생성된 전문가 추론 규칙들 또는 통계적 학습으로부터의 산출 규 칙들)을 포함하지만, 이것에 한정되지는 않는다. 방법들 및 시스템들이 바람직한 실시예들 및 구체적인 예들과 관련되어 설명되었지만, 실시예들이 모든 측면에 서 한정적인 것이 아니라 예시적인 것으로 의도됨에 따라, 범위가 제시된 특정 실시예들로 한정되도록 의도되지 는 않는다. 본 발명의 측면들이 특정 법적 분류, 이를테면 시스템 법적 분류로 설명되고 청구될 수 있지만, 이는 단지 편리"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "함을 위한 것이고 해당 기술분야의 통상의 기술자는 본 발명의 각 측면이 임의의 법적 분류로 설명되고 청구될 수 있음을 이해할 것이다. 명백히 다르게 언급되지 않는 한, 본 출원에 제시된 임의의 방법 또는 측면이 그것의 단계들이 특정 순서로 수행될 것을 필요로 하는 것으로 간주되도록 결코 의도되지 않는다. 따라서, 방법 청구항 이 단계들이 특정 순서로 한정되어야 한다고 청구항들 또는 설명에서 구체적으로 언급하지 않는 경우에는, 어떤 측면에서도, 순서가 추론되도록 결코 의도되지 않는다. 이는 단계들 또는 동작 흐름의 배열에 대한 논리적 문제 들, 문법 구조 또는 구두점에서 유도되는 명백한 의미, 또는 명세서에 설명되는 측면들의 수 또는 유형을 포함 하여, 해석 시 임의의 가능한 분명하지 않은 기초를 위해 유지된다."}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "해당 기술분야의 통상의 기술자들에게 다양한 변형 및 변경이 본 발명의 범위 또는 사상에서 벗어나지 않고 본 발명에서 이루어질 수 있다는 것이 명백할 것이다. 본 발명의 다른 실시예들은 명세서 및 본 출원에 개시된 방"}
{"patent_id": "10-2017-7006763", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "법들 및/또는 시스템들의 실시를 고려하여 해당 기술분야의 통상의 기술자들에게 명백할 것이다. 명세서 및 예 들은 다음 청구항들에 의해 표시된 본 발명의 진정한 범위 및 사상에 따라, 단지 대표적인 것으로 고려되도록 의도된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17"}
{"patent_id": "10-2017-7006763", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서로 통합되고 이의 부분을 이루는 첨부한 도면들은 설명과 함께 실시예들을 예시하고, 방법들 및 시스 템들의 원리들을 설명하는 역할을 한다: 도 1은 막 공정의 일정한 처리량 가변 공급 압력 운용의 대표적인 개략도를 도시한다; 도 2는 막 공정의 정압 가변 유량 운용의 대표적인 개략도를 도시한다; 도 3은 여과 관리 시스템의 대표적인 도해를 도시한다; 도 4는 역세정이 뒤따르는 정여과 동안 대표적인 유량 프로필들을 도시한다; 도 5는 트레이닝 모드로 여과 관리 시스템을 작동하기 위한 예시적인 방법을 예시하는 흐름도를 도시한다; 도 6은 여과 관리 시스템에 대한 대표적인 흐름도를 도시한다; 도 7은 제어 모드로 여과 관리 시스템을 작동하기 위한 예시적인 방법을 예시하는 흐름도를 도시한다; 도 8은 여과 관리 시스템의 제어 모드 운용에 대한 대표적인 흐름도를 도시한다; 도 9는 유량의 단계적 변화에 반응하여 여과 관리 시스템을 작동하기 위한 예시적인 방법을 예시하는 흐름도를 도시한다; 도 10은 유량의 단속적 변화에 반응하여 여과 관리 시스템을 작동하기 위한 예시적인 방법을 예시하는 흐름도를 도시한다; 도 11은 지속기간(tp)의 펄스 이벤트에 대한 여과 관리 시스템의 반응의 대표적인 개략도를 도시한다; 도 12는 여과 관리 시스템을 작동하기 위한 예시적인 방법을 예시하는 흐름도를 도시한다; 도 13은 상이한 파울링 메커니즘에 대한 솔루션들 및 관찰된 특정 입자 파울링 메커니즘을 결정하기 위해 적합 도 테스트가 적용되는 유량 대 시간 곡선을 도시한다; 도 14는 여과 관리 시스템을 작동하기 위한 예시적인 방법을 예시하는 다른 흐름도를 도시한다; 도 15는 여과 관리 시스템을 이용한 실험 결과들을 도시한다; 도 16은 여과 관리 시스템을 이용한 실험 결과들을 도시한다; 그리고 도 17은 개시된 방법들 및 시스템들이 작동할 수 있는 예시적인 컴퓨팅 디바이스를 예시한다. 본 개시 내용의 추가 이점들은 다음에 나오는 설명에 부분적으로 제시될 것이고, 부분적으로 설명으로부터 명백 할 것이거나, 본 개시 내용의 실시에 의해 학습될 수 있다. 본 개시 내용의 이점들은 특히 첨부된 청구항들에서 언급된 요소들 및 조합들에 의해 실현 및 달성될 것이다. 앞서 말한 일반적인 설명 및 다음 상세한 설명 양자는 청구된 바와 같이, 단지 대표적이고 설명하기 위한 것이고 방법들 및 시스템들에 대해 제한적인 것이 아니라는 것이 이해되어야 한다."}
