{"patent_id": "10-2020-0095574", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0015266", "출원번호": "10-2020-0095574", "발명의 명칭": "플렉서블한 디스플레이 모듈을 포함하는 전자 장치와 이의 동작 방법", "출원인": "삼성전자주식회사", "발명자": "정진교"}}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,적어도 하나의 힌지 구조를 포함하는 폴더블 하우징;상기 폴더블 하우징을 통해 적어도 일부의 영역이 노출되는 플렉서블한 디스플레이 모듈-상기 디스플레이 모듈은 복수 개의 영역과, 상기 적어도 하나의 힌지 구조에 대응하여 상기 복수 개의 영역 사이에 배치되어 상기 적어도 하나의 힌지 구조의 상태에 따라 접혀질 수 있는 적어도 하나의 폴더블 영역을 포함하고-; 및상기 폴더블 하우징의 내부에 구비되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는,상기 적어도 하나의 힌지 구조의 상태가 제 1 상태인 경우, 상기 디스플레이 모듈에 제 1 어플리케이션의 제 1실행 화면을 표시하고, 상기 제 1 상태에서 상기 적어도 하나의 폴더블 영역 중 제 1 폴더블 영역은 접힌 상태(folded state)이고,상기 적어도 하나의 폴더블 영역 중 상기 제 1 폴더블 영역이 접힌 상태인 동안에, 상기 제 1 실행 화면에 포함되는 객체로부터 상기 제 1 폴더블 영역으로의 터치 드래그 입력을 검출하고,상기 터치 드래그 입력을 검출한 후, 상기 적어도 하나의 힌지 구조의 상기 상태가 상기 제 1 상태로부터 제 2상태로 변화하는 것에 기반하여, 상기 객체의 적어도 일부를 이용하여 획득되는, 상기 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 상기 디스플레이 모듈에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제 1 실행 화면은, 상기 제 1 폴더블 영역에 인접하는 영역에 표시되며,상기 제 2 실행 화면은, 상기 적어도 하나의 힌지 구조의 상태가 상기 제 2 상태인 동안에 접혀지지 않는 폴더블 영역의 양방향으로 인접하는 영역들 및 상기 접혀지지 않는 폴더블 영역 상에 표시되고,상기 제 2 상태인 동안에 접혀지지 않는 폴더블 영역은, 상기 제 1 폴더블 영역이거나, 또는 다른 폴더블 영역인 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 적어도 하나의 프로세서는,상기 제 1 폴더블 영역의 접힌 상태가 검출됨과, 상기 객체로부터 상기 제 1 폴더블 영역으로의 상기 터치 드래그 입력이 검출되는 것에 기반하여, 상기 객체에 대응하는 아이콘을 포함하는 리스트를 상기 제 1 폴더블 영역에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 적어도 하나의 프로세서는,상기 터치 드래그 입력을 검출한 후 미리 설정된 시간 동안 상기 힌지 구조의 상기 상태가 상기 제 1 상태를 유지하는 것에 기반하여, 상기 제 1 폴더블 영역에 표시된 상기 리스트를 디스플레이 하지 않도록 제어하는 전자장치.공개특허 10-2022-0015266-3-청구항 5 제 1 항에 있어서, 상기 적어도 하나의 프로세서는,상기 제 2 실행 화면을 표시한 후, 상기 적어도 하나의 힌지 구조의 상기 상태가 상기 제 2 상태로부터 상기 제1 상태로 변화하는 것에 기반하여, 상기 디스플레이 모듈에 상기 제 1 어플리케이션의 상기 제 1 실행 화면을표시하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 적어도 하나의 프로세서는,상기 제 2 실행 화면을 표시한 후, 상기 적어도 하나의 힌지 구조의 상기 상태가 상기 제 2 상태로부터 상기 제1 상태로 변화하는 것에 기반하여, 상기 객체의 적어도 일부를 이용하여 획득되는, 상기 제 1 어플리케이션과상이한 제 3 어플리케이션의 제 3 실행 화면을 상기 디스플레이 모듈에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 적어도 하나의 프로세서는,상기 터치 드래그 입력의 속성에 기반하여, 상기 제 2 실행 화면을 제공하는 상기 제 2 어플리케이션을 결정하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 적어도 하나의 프로세서는,상기 터치 드래그 입력의 종료 위치(end point)에 기반하여, 상기 제 2 실행 화면을 제공하는 상기 제 2 어플리케이션을 결정하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "전자 장치에 있어서,적어도 하나의 힌지 구조를 포함하는 폴더블 하우징;상기 폴더블 하우징을 통해 적어도 일부의 영역이 노출되는 플렉서블한 디스플레이 모듈-상기 디스플레이 모듈은 복수 개의 영역과, 상기 적어도 하나의 힌지 구조에 대응하여 상기 복수 개의 영역 사이에 배치되어 상기 적어도 하나의 힌지 구조의 상태에 따라 접혀질 수 있는 적어도 하나의 폴더블 영역을 포함하고-; 및상기 폴더블 하우징의 내부에 구비되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는,상기 적어도 하나의 힌지 구조의 상태가 제 1 상태인 경우, 상기 디스플레이 모듈에 제 1 어플리케이션의 제 1실행 화면을 표시하고, 상기 제 1 상태에서 상기 적어도 하나의 폴더블 영역 중 제 1 폴더블 영역은 접힌 상태(folded state)이고,제 1 사용자 입력에 응답하여 상기 제 1 실행 화면에 포함된 적어도 하나의 객체를 식별하고,상기 적어도 하나의 힌지 구조의 상태가 상기 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 상기 식별된 적어도 하나의 객체의 적어도 일부를 이용하여 획득되는 제 2 어플리케이션의 제 2 실행 화면을, 상기 제 2상태에 대응하여 설정된 적어도 하나의 영역에 표시하고,상기 적어도 하나의 힌지 구조의 상기 상태가 상기 제 1 상태로부터 제 3 상태로 변화하는 것에 기반하여, 상기식별된 적어도 하나의 객체의 적어도 일부를 이용하여 획득되는 상기 제 2 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을, 상기 제 3 상태에 대응하여 설정된 적어도 하나의 영역에 표시하도록 설정된 전자공개특허 10-2022-0015266-4-장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 제 1 사용자 입력은, 상기 적어도 하나의 객체로부터 상기 제 1 실행 화면이 표시되는 제 1 영역에 인접하는 상기 제 1 폴더블 영역으로의 터치 드래그 입력, 또는 상기 적어도 하나의 객체로부터 상기 제 1 영역의 엣지 영역으로의 터치 드래그 입력인 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서, 상기 적어도 하나의 프로세서는,상기 제 2 실행 화면을 표시한 후, 상기 적어도 하나의 힌지 구조의 상기 상태가 상기 제 2 상태로부터 상기 제3 상태로 변화하는 것에 기반하여, 상기 식별된 적어도 하나의 객체의 적어도 일부를 이용하여 획득되는 상기제 2 어플리케이션과 상이한 상기 제 3 어플리케이션의 상기 제 3 실행 화면을, 상기 제 3 상태에 대응하여 설정된 상기 적어도 하나의 영역에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 9 항에 있어서, 상기 적어도 하나의 프로세서는,상기 제 1 어플리케이션의 상기 제 1 실행 화면 또는 상기 제 1 어플리케이션 이외의 다른 어플리케이션의 실행화면으로부터 상기 적어도 하나의 객체 이외의 적어도 하나의 추가 객체를 인식하고,상기 제 2 실행 화면 또는 상기 제 3 실행 화면은, 상기 적어도 하나의 객체 및 상기 적어도 하나의 추가 객체의 적어도 일부를 이용하여 획득되는 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9 항에 있어서, 상기 적어도 하나의 프로세서는,상기 식별된 적어도 하나의 객체의 개수에 기반하여, 상기 제 2 실행 화면 또는 상기 제 3 실행 화면의 레이아웃을 결정하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 9 항에 있어서, 상기 적어도 하나의 프로세서는,상기 식별된 적어도 하나의 객체가 두 개 이상의 객체인 경우, 제 2 사용자 입력에 응답하여: 상기 두 개 이상의 객체를 병합한 객체의 적어도 일부를 이용하여 획득되는 어플리케이션의 실행 화면을 표시하거나, 또는상기 두 개 이상의 객체 각각에 대응하는 복수 개의 서브 화면을 표시하도록 설정되고,상기 복수 개의 서브 화면은, 하나의 어플리케이션에 의하여 생성되거나, 또는 상이한 어플리케이션들 각각에의하여 생성되는 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2022-0015266-5-제 9 항에 있어서, 상기 적어도 하나의 프로세서는,상기 식별된 적어도 하나의 객체의 속성 타입에 기반하여, 선택 가능한 어플리케이션을 포함하는 제안 옵션을표시하고,제 3 사용자 입력에 응답하여 상기 제안 옵션에 포함된 상기 선택 가능한 어플리케이션 중에서 특정 어플리케이션을 식별하고,상기 제안 옵션 중에서 상기 특정 어플리케이션이 식별되는 것에 기반하여, 상기 식별된 적어도 하나의 객체의적어도 일부를 이용하여 획득되는 상기 특정 어플리케이션의 실행 화면을 상기 제 2 실행 화면 또는 상기 제 3실행 화면으로서 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 9 항에 있어서, 상기 적어도 하나의 프로세서는,상기 식별된 적어도 하나의 객체의 실행을 위한 어플리케이션이 상기 전자 장치에 의하여 실행될 수 없는 경우,상기 식별된 적어도 하나의 객체의 속성 타입에 기반하여, 상기 식별된 적어도 하나의 객체의 실행을 위한 적어도 하나의 어플리케이션의 다운로드 링크를 포함하는 제안 옵션을 표시하고,제 4 사용자 입력에 응답하여, 상기 제안 옵션에 포함된 상기 식별된 적어도 하나의 객체의 실행을 위한 적어도하나의 어플리케이션 중에서 특정 어플리케이션을 다운로드하고,상기 식별된 적어도 하나의 객체의 적어도 일부를 이용하여 획득되는 상기 특정 어플리케이션의 실행화면을 상기 제 2 실행 화면 또는 상기 제 3 실행 화면으로서 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 9 항에 있어서, 상기 적어도 하나의 프로세서는,호출 명령에 기반하여 적어도 하나의 아이콘을 포함하는 리스트를 표시하고,상기 리스트에 포함된 제 1 아이콘에 대한 선택에 기반하여, 제 1 아이콘에 대응하는 특정 어플리케이션의 실행화면을 표시하도록 더 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 제 1 아이콘은 상기 제 1 아이콘에 대응하는 임시 저장된 객체와 상기 임시 저장된 객체에 대응하여 설정된 특정 어플리케이션의 아이콘을 포함하여 구성되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 장치에 있어서,하우징;상기 하우징으로부터 인출 가능하고 롤러블한 디스플레이 모듈; 및상기 하우징의 내부에 구비되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는,상기 디스플레이 모듈의 제 1 영역이 상기 하우징으로부터 인출되어 외부로 노출된 상태에서 제 1 어플리케이션의 제 1 실행 화면을 상기 디스플레이 모듈에 표시하고,상기 제 1 실행 화면에 포함된 객체로부터 상기 제 1 영역의 엣지 영역으로의 터치 드래그 입력을 검출하고,공개특허 10-2022-0015266-6-상기 터치 드래그 입력을 검출한 후, 상기 디스플레이 모듈의 제 2 영역이 상기 하우징으로부터 인출되어 외부로 노출됨에 기반하여, 상기 객체의 적어도 일부를 이용하여 획득되는 상기 제 1 어플리케이션과 상이한 제 2어플리케이션의 제 2 실행 화면을 상기 디스플레이 모듈에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서, 상기 적어도 하나의 프로세서는,상기 터치 드래그 입력을 검출한 후, 미리 설정된 시간 이내에 상기 디스플레이 모듈의 상기 제 2 영역이 상기하우징으로부터 인출되어 외부로 노출됨에 기반하여, 상기 객체의 적어도 일부를 이용하여 획득되는 상기 제 1어플리케이션과 상이한 상기 제 2 어플리케이션의 상기 제 2 실행 화면을 상기 디스플레이 모듈에 표시하도록설정된 전자 장치."}
{"patent_id": "10-2020-0095574", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따라서, 전자 장치는, 적어도 하나의 힌지 구조를 포함하는 폴더블 하우징, 상기 폴더블 하우징 을 통해 적어도 일부의 영역이 노출되는 플렉서블한 디스플레이 모듈, 및 상기 폴더블 하우징의 내부에 구비되는 적어도 하나의 프로세서를 포함할 수 있다. 상기 디스플레이 모듈은 복수 개의 영역과, 상기 적어도 하나의 힌지 (뒷면에 계속)"}
{"patent_id": "10-2020-0095574", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은, 플렉서블한 디스플레이 모듈을 포함하는 전자 장치와 이의 동작 방법에 관한 것 이다."}
{"patent_id": "10-2020-0095574", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 폰(smart phone), 태블릿 PC(tablet PC), PMP(portable multimedia player), PDA(personal digital assistant), 랩탑 PC(laptop personal computer) 및 웨어러블 기기(wearable device)와 같은 다양한 전자 장치 들이 보급되고 있다. 전자 장치, 예를 들어, 스마트 폰과 같은 휴대용 전자 장치를 통해 제공되는 다양한 서비스 및 부가 기능들이 점차 증가하고 있다. 이러한 전자 장치의 효용 가치를 높이고, 다양한 사용자들의 요구를 만족시키기 위해서 통 신 서비스 제공자 또는 전자 장치 제조사들은 다양한 기능들을 제공하고 다른 업체와의 차별화를 위해 전자 장 치를 경쟁적으로 개발하고 있다. 이에 따라, 전자 장치를 통해서 제공되는 다양한 기능들도 점점 고도화 되고 있다. 최근에는, 대화면 디스플레이를 구비하는 다양한 전자 장치들이 개발 및 보급되고 있다. 예를 들면, 디스플레이 를 접을 수 있는 폴더블 디스플레이 또는 플렉서블 디스플레이를 포함하는 전자 장치, 디스플레이를 말아서 보 관할 수 있는 롤러블 디스플레이를 포함하는 장치가 개발 및 보급되고 있다. 대화면 디스플레이를 구비하는 장 치들이 보급되면서, 대화면을 활용하기 위한 다양한 방법이 제공될 수 있다. 디스플레이 모듈을 포함하는 전자 장치의 경우, 어플리케이션의 실행 화면을 디스플레이 모듈에 표시할 때, 디 스플레이 모듈의 표시 영역의 크기, 해상도 및 가로 길이와 세로 길이의 비율에 따라 어플리케이션의 실행 화면 의 비율을 결정할 수 있다. 플렉서블한 디스플레이 모듈을 포함하는 전자 장치의 경우에는, 플렉서블한 디스플레이 모듈의 접힌 상태 또는 펼쳐진 상태에 따라 사용자가 바라보는 전자 장치의 전면에 노출되는 디스플레이 모듈의 특정 영역이 결정될 수 있고, 전면에 노출되는 디스플레이 모듈의 특정 영역에 어플리케이션의 실행 화면을 표시하는 경우, 실행 화면 이 표시되는 특정 영역의 크기 및 비율에 따라 사용자의 작업 환경의 적합성이 달라질 수 있다. 예를 들어, 전자 장치의 전면에 노출되는 플렉서블한 디스플레이 모듈의 특정 영역의 가로 길이 보다 세로 길이 가 상대적으로 긴 경우, 가로 길이 보다 세로 길이가 상대적으로 긴 화면에 적합한 어플리케이션을 이용하여 작 업함으로써 작업의 효율성을 높일 수 있으며, 전자 장치의 전면에 노출되는 플렉서블한 디스플레이 모듈의 특정 영역의 세로 길이 보다 가로 길이가 상대적으로 긴 경우, 세로 길이 보다 가로 길이가 상대적으로 긴 화면에 적 합한 어플리케이션을 이용하여 작업함으로써 작업의 효율성을 높일 수 있다."}
{"patent_id": "10-2020-0095574", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "폴더블 장치와 같은 전자 장치의 경우, 하나의 어플리케이션 화면에 포함된 오브젝트를 이용하여, 더 큰 화면에 서 다른 어플리케이션의 조작이 요구되는 경우가 있다. 예를 들어, 웹 브라우징 어플리케이션의 실행 화면에 포함된 이미지를, 이미지 편집이 가능한 어플리케이션을 통하여 편집하여야 하는 경우가 발생할 수 있다. 이 때, 사용자는, 하나의 어플리케이션 화면에 포함되었던 오브젝트를 임시 저장한 이후, 홈 화면으로 복귀하는 명 령을 전자 장치에 입력하고, 홈 화면에서 다른 어플리케이션을 실행한 이후에나, 임시 저장하였던 오브젝트를 로딩하는 명령을 입력하여야 한다. 또한, 폴딩 상태에서의 폴딩 영역에 대한 터치 입력과 언-폴딩 상태에서의 폴딩 영역에 대한 터치 입력을 구분하여 처리하는 구성에 대하서는 개시된 바가 없다. 아울러, 복수 회의 폴딩이 가능한 폴더블 장치는, 복수 회의 폴딩이 가능함에 따라, 3개 이상의 면적의 화면이 노출될 수 있으나, 3개 이상의 면적의 노출 화면에 대한 기존과 차별화되는 인터페이스에 대하여서는 논의된 바 가 없다. 다양한 실시예에 따른 플렉서블한 디스플레이 모듈을 포함하는 전자 장치와 이의 동작 방법은, 사용자가 바라보 는 전자 장치의 전면에 노출되는 디스플레이 모듈의 특정 영역에 적합한 어플리케이션의 실행 화면을 표시할 수 있다."}
{"patent_id": "10-2020-0095574", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예들에 따르면, 전자 장치는, 적어도 하나의 힌지 구조를 포함하는 폴더블 하우징, 상기 폴더블 하 우징을 통해 적어도 일부의 영역이 노출되는 플렉서블한 디스플레이 모듈, 및 상기 폴더블 하우징의 내부에 구 비되는 적어도 하나의 프로세서를 포함할 수 있다. 상기 디스플레이 모듈은 복수 개의 영역과, 상기 적어도 하 나의 힌지 구조에 대응하여 상기 복수 개의 영역 사이에 배치되어 상기 적어도 하나의 힌지 구조의 상태에 따라 접혀질 수 있는 적어도 하나의 폴더블 영역을 포함할 수 있다. 상기 적어도 하나의 프로세서는,상기 적어도 하 나의 힌지 구조의 상태가 제 1 상태인 경우, 상기 디스플레이 모듈에 제 1 어플리케이션의 제 1 실행 화면을 표 시하고, 상기 제 1 상태에서 상기 적어도 하나의 폴더블 영역 중 제 1 폴더블 영역은 접힌 상태이고,상기 적어 도 하나의 폴더블 영역 중 상기 제 1 폴더블 영역이 접힌 상태인 동안에, 상기 제 1 실행 화면에 포함되는 객체 로부터 상기 제 1 폴더블 영역으로의 터치 드래그 입력을 검출하고,상기 터치 드래그 입력을 검출한 후, 상기 적어도 하나의 힌지 구조의 상기 상태가 상기 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 상기 객체 의 적어도 일부를 이용하여 획득되는, 상기 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 상기 디스플레이 모듈에 표시하도록 설정될 수 있다. 다양한 실시예들에 따르면, 전자 장치는, 적어도 하나의 힌지 구조를 포함하는 폴더블 하우징, 상기 폴더블 하 우징을 통해 적어도 일부의 영역이 노출되는 플렉서블한 디스플레이 모듈, 및 상기 폴더블 하우징의 내부에 구 비되는 적어도 하나의 프로세서를 포함할 수 있다. 상기 디스플레이 모듈은 복수 개의 영역과, 상기 적어도 하 나의 힌지 구조에 대응하여 상기 복수 개의 영역 사이에 배치되어 상기 적어도 하나의 힌지 구조의 상태에 따라 접혀질 수 있는 적어도 하나의 폴더블 영역을 포함할 수 있다. 상기 적어도 하나의 프로세서는, 상기 적어도 하 나의 힌지 구조의 상태가 제 1 상태인 경우, 상기 디스플레이 모듈에 제 1 어플리케이션의 제 1 실행 화면을 표 시하고, 상기 제 1 상태에서 상기 적어도 하나의 폴더블 영역 중 제 1 폴더블 영역은 접힌 상태(folded state) 이고, 제 1 사용자 입력에 응답하여 상기 제 1 실행 화면에 포함된 적어도 하나의 객체를 식별하고, 상기 적어 도 하나의 힌지 구조의 상태가 상기 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 상기 식별된 적어도 하나의 객체의 적어도 일부를 이용하여 획득되는 제 2 어플리케이션의 제 2 실행 화면을, 상기 제 2 상태에 대 응하여 설정된 적어도 하나의 영역에 표시하고, 상기 적어도 하나의 힌지 구조의 상기 상태가 상기 제 1 상태로 부터 제 3 상태로 변화하는 것에 기반하여, 상기 식별된 적어도 하나의 객체의 적어도 일부를 이용하여 획득되 는 상기 제 2 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을, 상기 제 3 상태에 대응하여 설정 된 적어도 하나의 영역에 표시하도록 설정될 수 있다. 다양한 실시예들에 따르면, 전자 장치는, 하우징, 상기 하우징으로부터 인출 가능하고 롤러블한 디스플레이 모 듈 및 상기 하우징의 내부에 구비되는 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서 는, 상기 디스플레이 모듈의 제 1 영역이 상기 하우징으로부터 인출되어 외부로 노출된 상태에서 제 1 어플리케 이션의 제 1 실행 화면을 상기 디스플레이 모듈에 표시하고, 상기 제 1 실행 화면에 포함된 객체로부터 상기 제 1 영역의 엣지 영역으로의 터치 드래그 입력을 검출하고, 상기 터치 드래그 입력을 검출한 후, 상기 디스플레이 모듈의 제 2 영역이 상기 하우징으로부터 인출되어 외부로 노출됨에 기반하여, 상기 객체의 적어도 일부를 이용 하여 획득되는 상기 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 상기 디스플레이 모듈 에 표시하도록 설정될 수 있다."}
{"patent_id": "10-2020-0095574", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예에 따라서, 접힌 상태에서의 폴더블 영역에 대한 터치 입력과 펼쳐진 상태에서의 폴더블 영역에 대한 터치 입력을 구분하여 처리할 수 있는 전자 장치와 이의 동작 방법이 제공될 수 있다. 이에 따라, 플렉서 블 디스플레이 모듈을 포함하는 전자 장치에 대한 차별화되는 인터페이스가 제공될 수 있다. 다양한 실시예에 따라서, 사용자가 바라보는 전자 장치의 전면에 노출되는 디스플레이 모듈의 특정 영역에 적합 한 어플리케이션의 실행 화면을 표시할 수 있는 플렉서블한 디스플레이 모듈을 포함하는 전자 장치와 이의 동작 방법이 제공될 수 있다. 이에 따라, 사용자는 적합한 어플리케이션을 이용하여 작업함으로써 작업의 효율성을 높일 수 있다. 다양한 실시예에 따라서, 플렉서블한 디스플레이 모듈의 노출되는 영역에 따라 미리 설정된 어플리케이션의 실 행 화면을 표시할 수 있는 전자 장치와 이의 동작 방법이 제공될 수 있다. 이에 따라, 노출 영역에 따른 기존과 차별화되는 인터페이스가 제공될 수 있다."}
{"patent_id": "10-2020-0095574", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈 , 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에 서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성 요소(예: 디스플레이 모듈)로 통합될 수 있다.프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 일 실시예에 따른, 전자 장치의 펼쳐진 상태를 도시한 도면이다. 일 실시예에서, 도 2를 참조하면, 전자 장치는, 폴더블 하우징, 및 폴더블 하우징에 의해 형성 된 공간 내에 배치된 디스플레이 모듈을 포함할 수 있다. 디스플레이 모듈의 적어도 일부분은, 플렉 서블(flexible) 또는 폴더블(foldable) 할 수 있다. 디스플레이 모듈이 배치된 면(또는 디스플레이 모듈 이 전자 장치의 외부에서 보여지는 면)을 전자 장치의 전면으로 정의할 수 있다. 그리고, 상기 전면의 반대 면을 전자 장치의 후면으로 정의할 수 있다. 또한, 전면과 후면 사이의 공간을 둘러싸는 면을 전자 장치의 측면으로 정의할 수 있다. 일 실시예에 따르면, 폴더블 하우징은, 제 1 하우징 구조, 제 2 하우징 구조, 제 3 하우징 구조 , 제 1 후면 커버, 제 2 후면 커버, 제 3 후면 커버 및 힌지 구조(예: 후술하는 도 3a의 제 1 힌지 구조 및 제 2 힌지 구조)를 포함할 수 있다. 전자 장치의 폴더블 하우징은 도 2 에 도시된 형태 및 결합으로 제한되지 않으며, 다른 형상이나 부품의 조합 및/또는 결합에 의해 구현될 수 있다. 예를 들어, 다른 실시 예에서는, 제 1 하우징 구조와 제 1 후면 커버가 일체로 형성될 수 있고, 제 2 하우징 구조와 제 2 후면 커버가 일체로 형성될 수 있고, 제 3 하우징 구조와 제 3 후면 커버가 일체로 형성될 수 있다.일 실시예에 따르면, 상기 제 1 하우징 구조는 제 1 힌지 구조(예: 후술하는 도 3a의 제 1 힌지 구조 )에 연결되며, 제 1 방향으로 향하는 제 1 면, 및 상기 제 1 방향과 반대인 제 4 방향으로 향하는 제 4 면 을 포함할 수 있다. 상기 제 2 하우징 구조는 제 1 힌지 구조(예: 후술하는 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 후술하는 도 3a의 제 2 힌지 구조)에 연결되며, 제 2 방향으로 향하는 제 2 면, 및 상기 제 2 방향과 반대인 제 5 방향으로 향하는 제 5 면을 포함할 수 있다. 상기 제 3 하우징 구조는 제 2 힌지 구조(예: 후술하는 도 3a의 제 2 힌지 구조)에 연결되며, 제 3 방향으로 향하는 제 3 면, 및 상기 제 3 방향과 반대인 제 6 방향으로 향하는 제 6 면을 포함할 수 있다. 일 실시예에 따르면, 상기 제 1 하우징 구조는 제 1 힌지 구조(예: 후술하는 도 3a의 제 1 힌지 구조 )(또는 제 1 폴딩 축(A))를 중심으로 상기 제 2 하우징 구조에 대해 회전할 수 있다. 이에 따라, 전 자 장치의 상태는 접힌(folded) 상태 및 펼쳐진 (unfolded) 상태 사이에서 전환될 수 있다. 예를 들어, 전 자 장치의 제 1 힌지 구조(예: 후술하는 도 3a의 제 1 힌지 구조)의 상태는 접힌(folded) 상태 및 펼 쳐진 (unfolded) 상태 사이에서 전환될 수 있다. 예를 들어, 전자 장치의 제 1 힌지 구조가 접힌 (folded) 상태에서 제 1 하우징 구조의 제 1 면이 향하는 제 1 방향은 제 1 하우징 구조의 제 2 면이 향하는 제 2 방향과 실질적으로 반대 방향일 수 있으며, 전자 장치의 제 1 힌지 구조가 펼쳐진 (unfolded) 상태에서 상기 제 1 방향은 상기 제 2 방향과 실질적으로 동일할 수 있다. 일 실시예에 다르면, 상기 제 3 하우징 구조는 제 2 힌지 구조(예: 후술하는 도 3a의 제 2 힌지 구조 )(또는 제 2 폴딩 축(A`))를 중심으로 상기 제 2 하우징 구조에 대해 회전할 수 있다. 이에 따라, 전 자 장치의 상태는 접힌(folded) 상태와 펼쳐진(unfolded) 상태 사이에서 전환될 수 있다. 예를 들어, 전자 장치의 제 2 힌지 구조(예: 후술하는 도 3a의 제 2 힌지 구조)의 상태는 접힌(folded) 상태 또는 펼 쳐진(unfolded) 상태 사이에서 전환될 수 있다. 예를 들어, 전자 장치의 제 2 힌지 구조가 접힌 (folded) 상태에서 제 2 하우징 구조의 제 2 면이 향하는 제 2 방향은 제 3 하우징 구조의 제 3 면이 향하는 제 3 방향과 실질적으로 반대 방향일 수 있으며, 전자 장치의 제 2 힌지 구조가 펼쳐진 (unfolded) 상태에서 상기 제 2 방향은 상기 제 3 방향과 실질적으로 동일할 수 있다. 여기에서, 방향은, 면의 법선 방향을 의미할 수 있으나, 제한은 없다. 일 실시예에 따르면, 제 1 하우징 구조와 제 2 하우징 구조는 제 1 폴딩 축(A)을 중심으로 양측에 배 치되고, 제 2 하우징 구조와 제 3 하우징 구조는 제 2 폴딩 축(A`)을 중심으로 양측에 배치될 수 있 다. 후술하는 바와 같이, 제 1 하우징 구조, 제 2 하우징 구조 및 제 3 하우징 구조는 전자 장 치의 상태가 펼쳐진 상태(unfolded status)인지, 접힌 상태(folded status)인지, 또는 일부 펼쳐진(또는 일부 접힌) 중간 상태(intermediate status)인지 여부에 따라 서로 이루는 각도나 거리가 달라질 수 있다. 일 실시예에 따르면, 제 1 하우징 구조, 제 2 하우징 구조 및 제 3 하우징 구조의 적어도 일부 는 디스플레이 모듈을 지지하기 위해 선택된 크기의 강성을 갖는 금속 재질이나 비금속 재질로 형성될 수 있다. 상기 금속 재질로 형성된 적어도 일부분은 전자 장치의 그라운드 면(ground plane)을 제공할 수 있 으며, 인쇄 회로 기판에 형성된 그라운드 라인(ground line)과 전기적으로 연결될 수 있다. 일 실시예에 따르면, 상기 제 1 후면 커버는 상기 전자 장치의 후면의 제 1 폴딩 축(A)의 일편에 배 치되고, 예를 들어, 실질적으로 직사각형인 가장자리(periphery)를 가질 수 있으며, 상기 제 1 하우징 구조 에 의해 상기 가장자리가 감싸질 수 있다. 유사하게, 상기 제 2 후면 커버는 상기 전자 장치의 후면의 상기 제 1 폴딩 축(A)의 다른편에 배치되고 제 2 폴딩 축(A`)의 일편에 배치되고, 예를 들어, 실질적으 로 직사각형인 가장자리(periphery)를 가질 수 있으며, 상기 제 2 하우징 구조에 의해 그 가장자리가 감싸 질 수 있다. 유사하게, 상기 제 3 후면 커버는 상기 전자 장치의 후면의 상기 제 2 폴딩 축(A`)의 다 른 편에 배치되고, 예를 들어, 실질적으로 직사각형인 가장자리(periphery)를 가질 수 있으며, 상기 제 3 하우 징 구조에 의해 그 가장자리가 감싸질 수 있다. 일 실시예에 따르면, 제 1 후면 커버, 제 2 후면 커버, 제 3 후면 커버, 제 1 하우징 구조 , 제 2 하우징 구조, 및 제 3 하우징 구조는 전자 장치의 적어도 하나의 부품(예: 인쇄 회 로 기판, 또는 배터리)이 배치될 수 있는 공간을 형성할 수 있다. 예를 들어, 상기 전자 장치의 후면에는 하나 이상의 부품(components) 또는 센서가 배치되거나 시각적으로 노출될 수 있다. 예를 들어, 제 3 하우징 구조에 대응하는 제 3 후면 커버의 후면 영역을 통해 하나 이상의 부품 또는 센서가 시각적으로 노출될 수 있다. 예를 들어, 상기 후면 영역을 통해 노출되는 센서는 근접 센서 또는 후면 카메라를 포함 할 수 있다.일 실시예에 따라, 디스플레이 모듈은, 폴더블 하우징에 의해 형성된 공간 상에 배치될 수 있다. 예 를 들어, 디스플레이 모듈은 폴더블 하우징에 의해 형성되는 리세스(recess) 상에 안착되며, 전자 장 치의 전면의 대부분을 구성할 수 있다. 예를 들어, 폴더블 하우징의 제 1 하우징 구조, 제 2 하 우징 구조 및 제 3 하우징 구조는 디스플레이 모듈을 수용하는 상기 리세스(recess)를 함께 형 성할 수 있다. 일 실시예에 따라, 전자 장치의 전면은 디스플레이 모듈 및 디스플레이 모듈에 인접한 제 1 하 우징 구조의 일부 영역, 제 2 하우징 구조의 일부 영역 및 제 3 하우징 구조의 일부 영역을 포 함할 수 있다. 일 실시예에 따라, 전자 장치의 후면은 제 1 후면 커버, 제 1 후면 커버에 인접한 제 1 하우징 구조의 일부 영역, 제 2 후면 커버, 제 2 후면 커버에 인접한 제 2 하우징 구조의 일부 영 역, 제 3 후면 커버 및 제 3 후면 커버에 인접한 제 3 하우징 구조의 일부 영역을 포함할 수 있 다. 일 실시예에 따라, 디스플레이 모듈은, 적어도 일부 영역이 평면 또는 곡면으로 변형될 수 있는 디스플레 이 모듈을 의미할 수 있다. 예를 들어, 디스플레이 모듈은 제 1 폴더블 영역, 제 2 폴더블 영역 , 제 1 폴더블 영역을 기준으로 일측(예: 도 2에 도시된 제 1 폴더블 영역의 좌측)에 배치되는 제 1 영역, 제 1 폴더블 영역을 기준으로 타측(예: 도 2에 도시된 제 1 폴더블 영역의 우측)에 배치되고 제 2 폴더블 영역을 기준으로 일측(예: 도 2에 도시된 제 2 폴더블 영역의 좌측)에 배치되 는 제 2 영역, 및 제 2 폴더블 영역를 기준으로 타측(예: 도 2에 도시된 제 2 폴더블 영역의 우 측)에 배치되는 제 3 영역을 포함할 수 있다. 일 실시예에서, 디스플레이 모듈의 폴더블 영역(예: 제 1 폴더블 영역 또는 제 2 폴더블 영역) 은 힌지 구조(예: 제 1 힌지 구조 또는 제 2 힌지 구조)가 위치한 영역에 대응할 수 있다. 예를 들어, 제 1 폴더블 영역은 제 1 힌지 구조가 위치한 영역에 대응할 수 있고, 제 2 폴더블 영역 은 제 2 힌지 구조가 위치한 영역에 대응할 수 있다. 예를 들어, 폴더블 영역(예: 제 1 폴더블 영역 또는 제 2 폴더블 영역)은 힌지 구조(예: 제 1 힌지 구조 또는 제 2 힌지 구조)가 졉혀지는 것 에 대응하여 졉혀질 수 있고 펼쳐지는 것에 대응하여 펼쳐질 수 있다. 한편, 도 2에 도시된 디스플레이 모듈의 영역 구분은 예시적인 것이며, 디스플레이 모듈은 구조 또는 기능에 따라 복수(예컨대, 6개 이상 혹은 4개 이하)의 영역으로 구분될 수도 있다. 또한, 디스플레이 모듈(16 0)의 제 1 영역, 제 2 영역, 제 3 영역, 제 1 폴더블 영역 및 제 2 폴더블 영역는, 설명의 편의를 위해 논리적으로 구별한 영역이고, 하드웨어적으로 분리된 영역이 아닐 수 있다. 도 3a는 일 실시예에 따른, 전자 장치의 펼쳐진(unfolded) 상태를 설명하기 위한 예시 도면이다. 도 3b는 일 실시예에 따른, 전자 장치의 접힌(folded) 상태를 설명하기 위한 예시 도면이다. 도 3c는 일 실시예에 따른, 전자 장치의 접힌(folded) 상태를 설명하기 위한 예시 도면이다. 도 3a, 도 3b 및 도3c는 도 2에 도시된 전자 장치를 기준선(B-B`)을 따라 절단한 전자 장치를 개략적으로 도시한 절단도이다. 일 실시예에 따르면, 전자 장치는 적어도 하나의 센서(예: 도 1 의 센서 모듈)를 이용하여 전자 장치 의 펼쳐진 상태 또는 접힌 상태를 확인할 수 있다. 예를 들어, 상기 적어도 하나의 센서(예: 도 1 의 센서 모듈)는 각도 센서, 거리 센서, 자이로 센서 또는 홀 센서 중 적어도 하나를 포함할 수 있다. 예를 들어, 전자 장치는 적어도 하나의 센서(예: 도 1 의 센서 모듈)를 통해 감지된 전자 장치의 적어도 하 나의 하우징에 대한 기울기, 가속도, 중력, 전자 장치에 구비된 폴더블 하우징의 하우징 구조들(예: 제 1 하우징 구조, 제 2 하우징 구조 또는 제 3 하우징 구조) 사이의 거리를 이용하여, 전자 장 치의 상태가 펼쳐진 상태인지 또는 접힌 상태인지 여부를 확인할 수 있다. 예를 들어, 전자 장치는 적어도 하나의 센서(예: 도 1 의 센서 모듈)를 통해 감지된 힌지 구조(예: 제 1 힌지 구조 또는 제 2 힌지 구조)의 펼쳐진 상태 또는 접힌 상태를 이용하여 전자 장치의 상태가 펼쳐진 상태인지 또는 접 힌 상태인지 여부를 확인할 수 있다. 예를 들어, 전자 장치는 적어도 하나의 센서(예: 도 1 의 센서 모듈 )를 통해 감지된 전자 장치에 구비된 적어도 하나의 힌지 구조(예: 제 1 힌지 구조 또는 제 2 힌지 구조)의 회전 방향 또는 회전 각도를 이용하여 전자 장치의 펼쳐진 상태 또는 접힌 상태를 확인 할 수 있다. 도 3a, 도 3b 및 도 3c를 참조하면, 일 실시예에 따른 전자 장치의 폴더블 하우징은 제 1 힌지 구조 , 제 2 힌지 구조, 제 1 하우징 구조, 제 2 하우징 구조 및 제 3 하우징 구조를 포 함할 수 있다. 도 3a에서는 제 1 힌지 구조 및 제 2 힌지 구조가 모두 펼쳐진 상태가 예시적으로 도시된다. 설명의 편의상 힌지 구조(예: 제 1 힌지 구조 또는 제 2 힌지 구조)가 완전히 펼쳐진 상태에서의 접힘 각도 는 180도로서 정의될 수 있다. 그러나, 이는 설명의 편의를 위한 것으로서, 힌지 구조(예: 제 1 힌지 구조 또는 제 2 힌지 구조)가 완전히 펼쳐진 상태에서의 접힘 각도는 0도로서 정의될 수도 있다. 도 3b에서는 제 1 힌지 구조는 접힌 상태이고, 제 2 힌지 구조는 펼쳐진 상태가 예시적으로 도시된다. 일 실시예에 따라서, 도 3b에서는 제 1 힌지 구조는 접힌 상태에서 제 1 하우징 구조에 대 응하는 제 1 후면 커버(예: 도 2의 제 1 후면 커버)와 제 2 하우징 구조에 대응하는 제 2 후면 커버 (예: 도 2의 제 2 후면 커버)가 서로 마주보게 배치되는 상태가 예시적으로 도시된다. 이하 설명의 편의를 위하여 제 1 힌지 구조는 접힌 상태이고, 제 2 힌지 구조는 펼쳐진 상태에 대한 설명은 도 3b에 도시 된 예시적인 도면을 기준으로 설명한다. 다만, 도시하지는 않았지만, 제 1 힌지 구조는 펼쳐진 상태이고, 제 2 힌지 구조는 접힌 상태가 존재할 수 있다. 도 3c에서는 제 1 힌지 구조 및 제 2 힌지 구조가 모두 접힌 상태가 예시적으로 도시된다. 일 실시예 에 따라서, 도 3c에서는 제 1 힌지 구조가 접힌 상태에서 제 1 하우징 구조에 대응하는 제 1 후면 커 버(예: 도 2의 제 1 후면 커버)와 제 2 하우징 구조에 대응하는 제 2 후면 커버(예: 도 2의 제 2 후 면 커버)가 서로 마주보게 배치되고, 제 2 힌지 구조가 접힌 상태에서 제 2 하우징 구조에 대응 하는 제 2 영역(예: 도 2의 제 2 영역)과 제 3 하우징 구조에 대응하는 제 3 영역(예: 도 2의 제 3 영역)이서로 마주보게 배치되는 상태가 예시적으로 도시된다. 이하 설명의 편의를 위하여 제 1 힌지 구조 및 제 2 힌지 구조가 모두 접힌 상태에 대한 설명은 도 3c에 도시된 예시적인 도면을 기준으로 설명 한다. 다만, 도시하지는 않았지만, 제 1 힌지 구조가 접힌 상태에서 제 1 하우징 구조에 대응하는 제 1 영역(예: 도 2의 제 1 영역)과 제 2 하우징 구조에 대응하는 제 2 영역(예: 도 2의 제 2 영역 )이 서로 마주보게 배치되고, 제 2 힌지 구조가 접힌 상태에서 제 2 하우징 구조에 대응하는 제 2 후면 커버(예: 도 2 의 제 2 후면 커버)와 제 3 하우징 구조에 대응하는 제 3 후면 커버(예: 도 2 의 제 3 후면 커버)가 서로 마주보게 배치되는 상태가 존재할 수 있다. 또한, 도시하지는 않았지만, 제 1 힌지 구조가 접힌 상태에서 제 1 하우징 구조에 대응하는 제 1 후면 커버(예: 도 2의제 1 후면 커버 )와 제 2 하우징 구조에 대응하는 제 2 후면 커버(예: 도 2의 제 2 후면 커버)가 서로 마주보게 배치되되, 제 2 힌지 구조가 접힌 상태에서 제 3 하우징 구조에 대응하는 제 3 후면 커버(예: 도 2의 제 3 후면 커버)와 제 1 하우징 구조에 대응하는 제 1 영역(예: 도2의 제 1 영역)이 서로 마주 보게 배치되는 상태가 존재할 수 있다. 또한, 도시하지는 않았지만, 제 2 힌지 구조가 접힌 상태에서 제 3 하우징 구조에 대응하는 제 3 후면 커버(예: 도 2의 제 3 후면 커버)와 제 2 하우징 구조에 대 응하는 제 2 후면 커버(예: 도 2의 제 2 후면 커버)가 서로 마주보게 배치되되, 제 1 힌지 구조가 접 힌 상태에서 제 1 하우징 구조에 대응하는 제 1 후면 커버(예: 도 2 의 제 1 후면 커버)와 제 3 하우 징 구조에 대응하는 제 3 영역(예: 도 2의 제 3 영역)이 서로 마주보게 배치되는 상태가 존재할 수 있다. 도 3d는 일 실시예에 따른, 전자 장치의 펼쳐진(unfolded) 상태를 예시적으로 도시하는 사시도이다. 도 3e 는 일 실시예에 따른, 전자 장치의 접힌(folded) 상태를 예시적으로 도시하는 사시도이다. 도 3f는 일 실 시예에 따른, 전자 장치의 접힌(folded) 상태를 예시적으로 도시하는 사시도이다. 도 3d, 도 3e 및 도 3f를 참조하면, 일 실시예에 따른 전자 장치의 폴더블 하우징은 제 1 힌지 구조 (예: 도 3a의 제 1 힌지 구조), 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조), 제 1 하우징 구조 , 제 2 하우징 구조 및 제 3 하우징 구조를 포함할 수 있다. 또한, 전자 장치의 디스플레 이 모듈은 제 1 영역, 제 2 영역, 제 3 영역, 제 1 폴더블 영역 및 제 2 폴더블 영 역를 포함할 수 있다. 도 3d는 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조 )가 모두 펼쳐진 상태가 예시적으로 도시된다. 도 3d는 도 3a에 도시된 전자 장치에 대응하는 전자 장치가 사시도로 표현된 예시 도면이다. 일 실시예에 따라, 도 3d를 참조하면, 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 펼쳐진 상태인 경우, 제 1 하우징 구조, 제 2 하우징 구조 및 제 3 하우징 구조는 180도의 각도를 이루며 동일 방향을 향하도록 배치될 수 있다. 이 경우, 디 스플레이 모듈의 제 1 영역의 표면, 제 2 영역의 표면 및 제 3 영역의 표면은 서로 180도 를 형성하며, 동일한 방향(예: 전자 장치의 전면 방향)을 향할 수 있다. 이 경우, 제 1 폴더블 영역 및 제 2 폴더블 영역은 제 1 영역, 제 2 영역 및 제 3 영역과 동일 평면을 형성할 수 있다. 도 3e는 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고, 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태가 예시적으로 도시된다. 도 3e는 도 3b에 도시된 전자 장치에 대응하는 전 자 장치가 사시도로 표현된 예시 도면이다. 일 실시예에 따라, 도 3e를 참조하면, 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)가 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 펼쳐진 상태인 경우, 디스플레이 모듈의 제 2 영역의 표면 및 제 3 영역의 표면은 서로 180도를 형성하며, 동일한 방향(예: 전자 장치의 전면 방향)을 향 할 수 있다. 이 경우, 제 2 폴더블 영역은 제 2 영역 및 제 3 영역과 동일 평면을 형성할 수 있 다. 이 경우, 디스플레이 모듈의 제 1 영역(예: 도 2의 제 1 영역)의 표면은 제 2 영역의 표면 이 향하는 방향과 반대 방향(예: 전자 장치의 후면 방향)을 향할 수 있다. 이 경우, 제 1 폴더블 영역 은 적어도 일부가 소정의 곡률을 가지는 곡면으로 이루어질 수 있다. 도 3f는 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조 )가 모두 접힌 상태가 예시적으로 도시된다. 도 3f는 도 3c에 도시된 전자 장치에 대응하는 전자 장 치가 사시도로 표현된 예시 도면이다. 일 실시예에 따라, 도 3f를 참조하면, 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 접힌 상태인 경우, 디스플레이 모듈의 제 1 영역은 전자 장치의 전면 방향을 향할 수 있다. 이 경우, 제 1 폴더블 영역은 적어도 일부가 소정의 곡률을 가지 는 곡면으로 이루어질 수 있다. 이 경우, 디스플레이 모듈의 제 2 영역(예: 도 2의 제 2 영역)의 표 면 및 제 3 영역(예: 도 2의 제 3 영역)의 표면은 서로 좁은 각도(예: 0도에서 10도 사이)를 형성하며, 서 로 마주볼 수 있다. 도 4는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 4의 실시예는 도 5 및 도 6을 참조하여 설명하도록 한다. 도 5는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 6 은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 사시도이다. 본 개시에서, 전자 장치가 특정 동작을 수행하는 것은, 프로세서가 특정 동작을 수행하는 것으로 이 해되거나, 또는 프로세서가 다른 하드웨어가 특정 동작을 수행하도록 제어하는 것을 의미할 수도 있다. 또는, 전자 장치가 특정 동작을 수행하는 것은, 메모리에 저장된 인스트럭션들이 수행됨에 따라, 프 로세서 또는 다른 하드웨어에 의하여 특정 동작이 수행됨을 의미할 수도 있다. 일 실시예에 따라서, 도 4, 도 5 및 도 6을 참조하면, 401 동작에서, 전자 장치(예: 도 1의 프로세서 )는, 전자 장치에 구비된 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태인 경우, 제 1 어플리케이션의 제 1 실행 화면을, 디스플레이 모듈에 표시할 수 있 다. 예를 들어, 전자 장치는, 제 1 상태, 예를 들어 제 1 힌지 구조 및 제 2 힌지 구조가 모두 접힌 상태인 경우, 디스플레이 모듈의 제 1 영역이 전면에 노출되고, 디스플레이 모듈의 제 1 폴더블 영역이 적어도 일부가 소정의 곡률을 가지는 곡면을 형성할 수 있다. 예를 들어, 전자 장치는, 제 1 상태, 예를 들어 제 1 힌지 구조 및 제 2 힌지 구조가 모두 접힌 상태인 경우, 제 1 어플리케이션의 제 1 실행 화면을 디스플레이 모듈의 제 1 영역에 표시할 수 있다. 도 5에서 는, 제 1 폴더블 영역에서는 제 1 실행 화면이 표시되지 않는 것과 같이 도시되어 있지만, 이는 예시 적인 것으로, 다른 실시예에서는, 제 1 실행 화면이 제 1 영역 및 제 1 폴더블 영역의 일부에 함께 표시될 수도 있다. 이하 설명의 편의를 위하여, 도 5와 같이 전자 장치의 동작을 설명하는 도면에서, 전자 장치의 힌지 구조(예: 제 1 힌지 구조)가 접힌 상태인 경우, 디스플레이 모듈의 폴더블 영역(예: 제 1 폴더블 영 역)이 평면을 이루는 것과 같이 도시되어 있으나, 이는 설명의 편의를 위한 것일 뿐, 전자 장치의 힌 지 구조(예: 제 1 힌지 구조)가 접힌 상태인 경우, 디스플레이 모듈의 폴더블 영역(예: 제 1 폴더블 영역)은 접힌 상태, 예를 들어 폴더블 영역(예: 제 1 폴더블 영역)의 적어도 일부가 소정의 곡률을가지는 곡면을 형성하는 상태일 수 있으며, 이는 다른 실시예에서도 적용된다. 일 실시예에 따라서, 도 4, 도 5 및 도 6을 참조하면, 403 동작에서, 전자 장치는, 제 1 폴더블 영역(20 4)이 접힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부 터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 523)을 검출할 수 있다. 예를 들어, 전자 장치는, 제 1 객체에 대한 터치를 확인할 수 있으며, 터치의 위치에 대응하여 제 1 객체가 선택되 었음을 확인할 수 있다. 전자 장치는, 제 1 객체의 선택에 기반하여, 제 1 객체에 대응하는 또 다른 객체를, 터치의 위치에 대응하여 표시할 수 있다. 또 다른 객체는, 제 1 객체를 나 타내는 객체로서, 예를 들어 제 1 객체와 동일한 형태 및/또는 동일한 크기를 가질 수 있다. 또는, 또 다 른 객체는, 제 1 객체의 썸네일 이미지, 또는 고스트 뷰(ghost view)와 같은 임의의 객체로 구현될 수도 있고, 그 구현 형태에는 제한이 없다. 전자 장치는, 터치 드래그 입력(예: 도 5의 523)에 기반하여, 이동되는 접촉 위치에 따라서 또 다른 객체를 이동시킬 수 있다. 일 실시예에 따라서, 도 4, 도 5 및 도 6을 참조하면, 405 동작에서, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하 여, 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케 이션의 제 2 실행 화면을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 전자 장치는, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 제 1 객체로부터 제 1 폴더블 영역으로의 터치 드래 그 입력을 검출한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태에서 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조 )는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태로 변화(예: Unfolding)하는 것에 기반하여, 제 1 객체의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 디스플레이 모듈의 특정 영역(예: 디스플레이 모 듈의 제 2 영역, 제 3 영역 및 제 2 폴더블 영역을 포함하는 영역)에 표시할 수 있다. 예 를 들어, 전자 장치는 제 2 어플리케이션을 실행할 수 있으며, 제 2 어플리케이션에 선택된 객체, 예를 들 어 제 1 객체를 할당할 수 있다. 제 2 어플리케이션은, 할당받은 제 1 객체를 이용하여 제 2 실행 화면을 구성할 수 있으며, 전자 장치는 구성된 제 2 실행 화면을 표시할 수 있다. 예를 들어, 도 5의 실시예에서는, 웹 브라우징 어플리케이션인 제 1 어플리케이션의 제 1 실행 화면에 포함된 제 1 객 체, 예를 들어 이미지 파일이 선택될 수 있다. 전자 장치는, 제 1 객체, 예를 들어 이미지 파 일을 제 2 어플리케이션, 예를 들어 갤러리 어플리케이션에 할당할 수 있다. 갤러리 어플리케이션은, 할당받은 이미지 파일을 갤러리 어플리케이션 내 저장소에 저장할 수 있다. 갤러리 어플리케이션은, 이미지 파일이 저장 되었음을 나타내는 썸네일과, 해당 이미지 파일을 전체 화면으로 포함하는 제 2 실행 화면을 구 성할 수 있으며, 전자 장치는 구성된 제 2 실행 화면을 표시할 수 있다. 제 2 어플리케이션은, 선택 된 객체, 예를 들어 제 1 객체의 전체 정보를 이용하거나, 또는 일부 정보를 이용하여 제 2 어플리케이션 실행 화면을 구성할 수도 있다. 한편, 상술한 갤러리 어플리케이션의 할당 객체를 처리하는 방식은 단순히 예 시적인 것으로, 어플리케이션 별로 할당받은 객체를 처리하는 방식이 상이하게 설정될 수 있음을 당업자는 이해 할 것이다. 또한, 실행되는 어플리케이션은 예시적인 것으로서, 객체(예: 제 1 객체)의 속성에 기반하여 실행되는 어플리케이션이 결정될 수 있다. 예를 들어, 객체(예: 제 1 객체)의 속성이 text 속성인 경우, text 편집 어플리케이션이 실행될 수 있고, 객체(예: 제 1 객체)의 속성이 link 속성인 경우, 해당 link와 관련된 어플리케이션이 실행될 수 있으며, 실행되는 어플리케이션에는 제한이 없다. 일 실시예에 따라, 전자 장치는, 디스플레이 모듈의 제 1 폴더블 영역이 접힌 상태인 동안에 디 스플레이 모듈의 제 1 영역에 표시된 제 1 어플리케이션의 제 1 실행 화면에 포함되는 제 1 객 체로부터 제 1 폴더블 영역으로의 터치 드래그 입력을 검출할 수 있다. 이후, 전자 장치는, 미리 설정된 시간 이내에 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조(30 5))의 상태가 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태에서 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태로 변화(예: Unfolding)하는 것을 확인할 수 있다. 전자 장치는, 상태 변화의 검출에 기반하여, 제 1 객체의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면(50 2)을 디스플레이 모듈의 특정 영역(예: 디스플레이 모듈의 제 2 영역, 제 3 영역 및 제 2 폴더블 영역을 포함하는 영역)에 표시할 수 있다. 예를 들어, 상기 미리 설정된 시간은 예시적인 것으로서, 사용자에 의해 설정될 수 있다. 또 다른 예시에서, 전자 장치는, 미리 설정된 시간 내에 폴딩 상 태의 변화가 있었는지 여부를 판단하지 않고, 폴딩 상태 변화에 응답하여 제 2 실행 화면을 표시하도록 설 정될 수도 있다. 본 개시에서 기술된 미리 설정된 시간 내의 폴딩 상태 변화 여부의 판단은 생략될 수도 있음 을 당업자는 이해할 것이다. 도 7은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 7의 실시예는 도 8을 참조하여 설명하도록 한다. 도 8은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 7 및 도 8을 참조하면, 701 동작에서, 전자 장치(예: 도 1의 프로세서)는, 전자 장치에 구비된 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태인 경우, 제 1 어플리케이션의 제 1 실행 화면을, 디스플레이 모듈에 표시할 수 있다. 예를 들어, 701 동작은, 도 4의 401 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 7 및 도 8을 참조하면, 703 동작에서, 전자 장치는, 제 1 폴더블 영역이 접 힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 523)을 검출할 수 있다. 예를 들어, 703 동작은, 도 4의 403 동 작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 7 및 도 8을 참조하면, 705 동작에서, 전자 장치는, 제 1 폴더블 영역의 접 힌 상태가 검출됨과, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력이 검출되는 것에 기반하여, 객체(예: 제 1 객체)에 대응 하는 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시할 수 있다. 예를 들어, 전자 장치는, 제 1 객체로부터 제 1 폴더블 영역으로의 터치 드래그 입력 이 검출되는 것에 기반하여, 제 1 객체에 대응하는 제 1 아이콘을 포함하는 리스트를 제 1 폴더블 영역에 표시할 수 있다. 제 1 아이콘은, 제 1 객체를 나타내는 아이콘으로서, 예를 들 어 제 1 객체와 동일한 형태 및/또는 동일한 크기를 가질 수 있다. 또는, 제 1 아이콘은 제 1 객체 의 전체 정보를 이용하거나, 또는 일부 정보를 이용하여 구성되는 아이콘일 수도 있다. 또는, 제 1 아이 콘은, 제 1 객체의 썸네일 이미지, 또는 고스트 뷰(ghost view)와 같은 임의의 객체로 구현될 수도 있고, 그 구현 형태에는 제한이 없다. 또는, 제 1 아이콘은 제 1 객체를 나타내는 또 다른 객체(51 3)에 대응하는 아이콘으로서, 예를 들어, 또 다른 객체와 동일한 형태 및/또는 동일한 크기를 가질 수 있 고, 또는, 또 다른 객체와 동일한 형태를 갖되, 또 다른 객체의 크기 보다 축소된 크기를 가질 수 있 다. 일 실시예에 따라, 도 8을 참조하면, 전자 장치는, 제 1 폴더블 영역의 접힌 상태가 검출됨과, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력이 검출되는 것에 기반하여, 객체(예: 제 1 객체)와 관련된 정보를 전자 장치 의 임시 저장소에 저장할 수 있다. 전자 장치는, 객체(예: 제 1 객체)와 관련된 정보가 임시 저장소 에 저장되었음을 나타내는 알림 화면(예: 제 1 알림 화면)을 디스플레이 모듈에 표시할 수 있다. 예 를 들어, 전자 장치는, 제 1 객체로부터 제 1 폴더블 영역으로의 터치 드래그 입력이 검출 되는 것에 기반하여, 제 1 객체)와 관련된 정보를 임시 저장소에 저장할 수 있고, 제 1 객체와 관련 된 정보가 임시 저장소에 저장되었음을 나타내는 제 1 알림 화면을 디스플레이 모듈의 제 1 영역 에 표시할 수 있다. 예를 들어, 알림 화면(예: 제 1 알림 화면)은, 디스플레이 모듈의 제 1 영 역의 일부 영역에 표시될 수 있으다. 예를 들어, 알림 화면(예: 제 1 알림 화면)은 디스플레이 모듈 의 제 1 영역에 표시되는 화면(예: 제 1 화면)과 중첩하여 표시될 수 있으며, 알림 화면(예: 제 1 알림 화면)이 표시되는 방식 및 표시되는 위치에는 제한이 없다. 도 8에서는, 리스트에 제 1 아이 콘 이외에도 다른 아이콘들이 포함될 수 있으며, 이는 제 1 아이콘이 임시 저장되기 이전에 임시 저 장된 객체를 의미할 수 있다. 전자 장치는, 도 8에서 도시된 바와 같이, 복수 개의 객체들을 임시 저장할 수도 있으며, 사용자가 인식 및/또는 선택할 수 있는 인터페이스(예를 들어, 리스트)를 제공할 수도 있다. 일 실시예에 따라서, 도 7 및 도 8을 참조하면, 707 동작에서, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 객 체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 전자 장치는, 제 1 객체 에 대응하는 제 1 아이콘을 포함하는 리스트를 제 1 폴더블 영역에 표시한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태, 예를 들어 제 1 힌지 구조 (예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태에 서 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조 (예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태로 변화(예: Unfolding)하는 것에 기반하여, 제 1 객체 의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면 을 디스플레이 모듈의 특정 영역(예: 디스플레이 모듈의 제 2 영역(예: 도 2의 제 2 영역 ), 제 3 영역(예: 도 2의 제 3 영역) 및 제 2 폴더블 영역(예: 도 2의 제 2 폴더블 영역)을 포 함하는 영역)에 표시할 수 있다. 예를 들어, 707 동작은, 도 4의 405 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 전자 장치는, 제 1 객체에 대응하는 제 1 아이콘을 포함하는 리스트을 제 1 폴더블 영역에 표시한 후, 미리 설정된 시간 이내에 힌지 구조(예: 도 3a의 제 1 힌지 구조 또 는 제 2 힌지 구조)의 상태가 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태에서 제 2 상태, 예를 들어 제 1 힌지 구조 (예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐 진 상태로 변화(예: Unfolding)하는 것에 기반하여, 제 1 객체의 적어도 일부를 이용하여 획득 되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 디스플레이 모듈의 특정 영역(예: 디스플레이 모듈의 제 2 영역, 제 3 영역 및 제 2 폴더블 영역을 포함하는 영역)에 표시할 수 있다. 예를 들어, 상기 미리 설정된 시간은 예시적인 것으로서, 사용자에 의해 설정될 수 있 다. 도 9는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 9의 실시예는 도 10 을 참조하여 설명하도록 한다. 도 10은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 9 및 도 10을 참조하면, 901 동작에서, 전자 장치(예: 도 1의 프로세서)는, 전자 장치에 구비된 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태인 경우, 제 1 어플리케이션의 제 1 실행 화면을, 디스플레이 모듈에 표시할 수 있다. 예를 들어, 901 동작은, 도 4의 401 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 9 및 도 10을 참조하면, 903 동작에서, 전자 장치는, 제 1 폴더블 영역이 접 힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 523)을 검출할 수 있다. 예를 들어, 903 동작은, 도 4의 403 동 작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 9 및 도 10을 참조하면, 905 동작에서, 전자 장치는, 제 1 폴더블 영역의 접 힌 상태가 검출됨과, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력이 검출되는 것에 기반하여, 객체(예: 제 1 객체)에 대응 하는 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시할 수 있다. 예를 들어, 905 동작은, 도 7의 705 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 9 및 도 10을 참조하면, 907 동작에서, 전자 장치는, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력 을 검출한 후, 미리 설정된 시간 동안 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조 )의 상태가 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조 (예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태를 유지하는 것에 기반하여, 제 1 폴더블 영역에 표 시된 리스트를 디스플레이 하지 않도록 제어할 수 있다. 예를 들어, 상기 미리 설정된 시간은 예시적인 것으로서, 사용자에 의해 설정될 수 있다. 도 11은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 11의 실시예는 도 12를 참조하여 설명하도록 한다. 도 12는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 11 및 도 12를 참조하면, 1101 동작에서, 전자 장치(예: 도 1의 프로세서)는, 전자 장치에 구비된 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조 )의 상태가 제 1 상태인 경우, 제 1 어플리케이션의 제 1 실행 화면을, 디스플레이 모듈에 표시 할 수 있다. 예를 들어, 1101 동작은, 도 5를 참조하여 도 4의 401 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 11 및 도 12를 참조하면, 1103 동작에서, 전자 장치는, 제 1 폴더블 영역이 접힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 도 5의 523)을 검출할 수 있다. 예를 들어, 1103 동작은, 도 5를 참조하여 도 4의 403 동작과 유사하게 설명될 수 있다. 일 실시예에서, 도 12을 참조하면, 1103 동작 이후, 전자 장치는, 리스트를 표시하는 동작을 추가적 으로 실행할 수 있다. 예를 들어, 전자 장치는, 제 1 폴더블 영역의 접힌 상태가 검출됨과, 제 1 어 플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 도 5의 523)이 검출되는 것에 기반하여, 객체(예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시할 수 있다. 예를 들어, 리스트를 표시하는 동작은, 도 7의 705 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 11 및 도 12를 참조하면, 1105 동작에서, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션 의 제 2 실행 화면을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 1105 동작은, 도 4의 405 동작 과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 11 및 도 12를 참조하면, 1107 동작에서, 전자 장치는, 제 2 실행 화면를 표 시한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 2 상태로부터 제 1 상태로 변화하는 것에 기반하여, 제 1 어플리케이션의 제 1 실행 화면을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 전자 장치는 1105 동작에 의해 제 2 실행 화면을 디스플레이 모듈에 표시 한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구 조)는 펼쳐진 상태에서 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태로 변화(예: Folding)하는 것에 기반하여, 제 1 어플리케이션의 제 1 실행 화면을 디스플레이 모듈의 제 1 영역에 표시할 수 있다. 도 13은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 13의 실시예는 도 14를 참조하여 설명하도록 한다. 도 14는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 13 및 도 14를 참조하면, 1301 동작에서, 전자 장치(예: 도 1의 프로세서)는, 전자 장치에 구비된 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조 )의 상태가 제 1 상태인 경우, 제 1 어플리케이션의 제 1 실행 화면을, 디스플레이 모듈에 표시 할 수 있다. 예를 들어, 1301 동작은, 도 5를 참조하여 도 4의 401 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 13 및 도 14를 참조하면, 1303 동작에서, 전자 장치는, 제 1 폴더블 영역이 접힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 도 5의 523)을 검출할 수 있다. 예를 들어, 1303 동작은, 도 5를 참조하여 도 4의 403 동작과 유사하게 설명될 수 있다. 일 실시예에서, 도 14을 참조하면, 1303 동작 이후, 전자 장치는, 리스트를 표시하는 동작을 추가적 으로 실행할 수 있다. 예를 들어, 전자 장치는, 제 1 폴더블 영역의 접힌 상태가 검출됨과, 제 1 어 플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 도 5의 523)이 검출되는 것에 기반하여, 객체(예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시할 수 있다. 예를 들어, 리스트를 표시하는 동작은, 도 7의 705 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 13 및 도 14를 참조하면, 1305 동작에서, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션 의 제 2 실행 화면을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 1305 동작은, 도 11의 1105 동 작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 13 및 도 14를 참조하면, 1307 동작에서, 전자 장치는, 제 2 실행 화면를 표 시한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 2 상태로부터 제 1 상태로 변화하는 것에 기반하여, 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 전자 장치는 1305 동작에 의해 제 2 실행 화면을 디스플레이 모듈에 표시한 후, 힌지 구 조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 2 상태, 예를 들어 제 1 힌지 구 조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼 쳐진 상태에서 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태로 변화(예: Folding)하는 것에 기반하여, 제 1 객체 의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면 을 디스플레이 모듈의 제 1 영역에 표시할 수 있다. 예를 들어, 전자 장치는 제 3 어플 리케이션을 실행할 수 있으며, 제 3 어플리케이션에 선택된 객체, 예를 들어 제 1 객체를 할당할 수 있다. 제 3 어플리케이션은, 할당받은 제 1 객체를 이용하여 제 3 실행 화면을 구성할 수 있으며, 전자 장 치는 구성된 제 3 실행 화면을 표시할 수 있다. 예를 들어, 도 4의 405 동작에 대한 설명 부분에 자세히 개시된 바와 같이, 도 14의 실시예에서는, 웹 브라우징 어플리케이션인 제 1 어플리케이션의 제 1 실행 화면에 포함된 제 1 객체, 예를 들어 이미지 파일이 선택될 수 있다. 전자 장치는, 제 1 객체 , 예를 들어 이미지 파일을 제 2 어플리케이션, 예를 들어 갤러리 어플리케이션에 할당할 수 있다. 갤러리 어플리케이션은, 제 1 객체, 예를 들어 이미지 파일을 포함하는 제 2 실행 화면을 구성할 수 있으며, 전자 장치는 구성된 제 2 실행 화면를 표시할 수 있다. 전자 장치는, 제 1 객체, 예를 들 어 이미지 파일을 제 3 어플리케이션, 예를 들어 메시지 어플리케이션에 할당할 수 있다. 메시지 어플리케이션 은 할당받은 이미지 파일을 포함하는 메시지 입력 화면과, 메시지 입력에 사용되는 가상 키보드 화면을 포함하 는 제 3 실행 화면을 구성할 수 있으며, 전자 장치는 구성된 제 3 실행 화면을 표시할 수 있 다. 제 3 어플리케이션은, 선택된 객체, 예를 들어 제 1 객체의 전체 정보를 이용하거나, 또는 일부 정보 를 이용하여 제 3 어플리케이션 실행 화면을 구성할 수도 있다. 한편, 상술한 메시지 어플리케이션의 할당 객 체를 처리하는 방식은 단순히 예시적인 것으로, 어플리케이션 별로 할당받은 객체를 처리하는 방식이 상이하게 설정될 수 있음을 당업자는 이해할 것이다. 도 15는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 15의 실시예는 도 17a를 참조하여 설명하도록 한다. 도 17a는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 15를 참조하면, 1501 동작에서, 전자 장치(예: 도 1의 프로세서)는, 전자 장 치에 구비된 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태 인 경우, 제 1 어플리케이션의 제 1 실행 화면(예: 도 5의 제 1 실행 화면)을, 디스플레이 모듈에 표 시할 수 있다. 예를 들어, 1501 동작은, 도 4의 401 동작과 유사하게 설명 될 수 있다. 일 실시예에 따라서, 도 15를 참조하면, 1503 동작에서, 전자 장치는, 제 1 폴더블 영역(예: 도 5의 제 1 폴더블 영역)이 접힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면(예: 도 5의 제 1 실행 화면 )에 포함되는 객체(예: 도 5의 제 1 객체)로부터 제 1 폴더블 영역(예: 도 5의 제 1 폴더블 영역 )으로의 터치 드래그 입력(예: 도 5의 523)을 검출할 수 있다. 예를 들어, 1503 동작은, 도 4의 403 동작 과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 15를 참조하면, 1505 동작에서, 전자 장치는, 제 1 어플리케이션의 제 1 실행 화 면(예: 도 5의 제 1 실행 화면)에 포함되는 객체(예: 도 5의 제 1 객체)로부터 제 1 폴더블 영역(예: 도 5의 제 1 폴더블 영역)으로의 터치 드래그 입력(예: 도 5의 523)의 속성에 기반하여, 제 2 실행 화면 (예: 도 5의 제 2 실행 화면)을 제공하는 제 2 어플리케이션을 결정할 수 있다. 예를 들어, 도 17a를 참조하면, 일 실시예에 따라서, 전자 장치는, 디스플레이 모듈의 제 1 영역 에 표시된 제 1 어플리케이션의 제 1 실행 화면(예: 도 5의 제 1 실행 화면)에 포함된 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력이 검출되는 방향(예: 1718 또는 171 9)에 기반하여, 제 2 실행 화면(예: 도 5의 제 2 실행 화면)을 제공하는 제 2 어플리케이션을 결정할 수 있다. 예를 들어, 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력이 검출되는 방향(예: 1718 또는 1719)에 대응하는 실행 어플리케이션이 미리 설정될 수 있으며, 예를 들어, 실행 어플리케이션은, 객체의 속성 타입(예: text 속성, image 속성, link 속성)에 기반하여 미리 설정될 수 있고, 사용자에 의해 설정되거나 변경될 수 있다. 예를 들어, 도 17a의 실시예에서, 갤러리 어플리케이션이 제 1 방 향에 대응하는 실행 어플리케이션으로 미리 설정되어 있는 경우, 제 1 객체로부터 제 1 폴더블 영 역으로의 터치 드래그 입력이 검출되는 방향이 제 1 방향인 것에 기반하여, 전자 장치는, 갤러리 어플리케이션을 제 2 실행 화면(예: 도 5의 제 2 실행 화면)을 제공하는 제 2 어플리케이션으로 결정할 수 있다. 전자 장치는 갤러리 어플리케이션을 실행할 수 있으며, 갤러리 어플리케이션 에 객체, 예를 들어 제 1 객체를 할당할 수 있다. 갤러리 어플리케이션은 할당받은 객체, 예를 들어 제 1 객체를 이용하여 실행 화면을 구성할 수 있으며, 전자 장치는 구성된 실행 화면을 표시할 수 있다. 도 16은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 16의 실시예는 도 17b를 참조하여 설명하도록 한다. 도 17b는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 16를 참조하면, 1601 동작에서, 전자 장치(예: 도 1의 프로세서)는, 전자 장 치에 구비된 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태 인 경우, 제 1 어플리케이션의 제 1 실행 화면(예: 도 5의 제 1 실행 화면)을, 디스플레이 모듈에 표 시할 수 있다. 예를 들어, 1601 동작은, 도 4의 401 동작과 유사하게 설명 될 수 있다. 일 실시예에 따라서, 도 16을 참조하면, 1603 동작에서, 전자 장치는, 제 1 폴더블 영역(예: 도 5의 제 1 폴더블 영역)이 접힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면(예: 도 5의 제 1 실행 화면 )에 포함되는 객체(예: 도 5의 제 1 객체)로부터 제 1 폴더블 영역(예: 도 5의 제 1 폴더블 영역 )으로의 터치 드래그 입력(예: 도 5의 523)을 검출할 수 있다. 예를 들어, 1603 동작은, 도 4의 403 동작 과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 16을 참조하면, 1605 동작에서, 전자 장치는, 제 1 어플리케이션의 제 1 실행 화 면(예: 도 5의 제 1 실행 화면)에 포함되는 객체(예: 도 5의 제 1 객체)로부터 제 1 폴더블 영역(예: 도 5의 제 1 폴더블 영역)으로의 터치 드래그 입력(예: 도 5의 523)의 속성에 기반하여, 제 2 실행 화면 (예: 도 5의 제 2 실행 화면)을 제공하는 제 2 어플리케이션을 결정할 수 있다. 예를 들어, 도 17b를 참조하면, 일 실시예에 따라서, 전자 장치는, 디스플레이 모듈의 제 1 영역 에 표시된 제 1 어플리케이션의 제 1 실행 화면(예: 도 5의 제 1 실행 화면)에 포함된 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력의 속성, 예를 들어 터치 드래그 입력 의 종료 위치(end point)에 기반하여, 제 2 실행 화면(예: 도 5의 제 2 실행 화면)을 제공하는 제 2 어플리케이션을 결정할 수 있다. 한편, 전자 장치는, 터치 드래그 입력와 연관된 위치, 예를 들어 종료 위치에 기반하여 어플리케이션을 결정하도록 설정될 수도 있다. 예를 들어, 디스플레이 모듈의 제 1 폴더블 영역은 적어도 하나의 설정 영역(set area)(예: 제 1 설정 영역, 제 2 설정 영역, 제 3 설정 영역 또는 제 4 설정 영역)을 포함할 수 있으며, 적어도 하나의 설정 영역(예: 제 1 설정 영역, 제 2 설정 영역, 제 3 설정 영역 또는 제 4 설정 영역)에 각각 대응하는 적어 도 하나의 실행 어플리케이션(예: 제 1 실행 어플리케이션, 제 2 실행 어플리케이션, 제 3 실행 어플리케이션 또는 제 4 실행 어플리케이션)이 미리 설정될 수 있으며, 예를 들어, 적어도 하나의 실행 어플리케이션은, 객체 의 속성 타입(예: text 속성, image 속성, link 속성)에 기반하여 미리 설정될 수 있고, 사용자에 의해 설정되 거나 변경될 수 있다. 전자 장치는, 터치 드래그 입력이 제 1 객체로부터 특정한 설정 영역 (예: 제 2 설정 영역)으로의 터치 드래그 입력인 경우, 특정한 설정 영역(예: 제 2 설정 영역)에 대응하여 미리 설정된 특정한 실행 어플리케이션(예: 제 2 실행 어플리케이션)을 제 2 실행 화면(예: 도 5의 제 2 실행 화면)을 제공하는 제 2 어플리케이션으로 결정할 수 있다. 예를 들어, 도 17b의 실시예에서, 메시 지 어플리케이션이 제 2 설정 영역에 대응하는 실행 어플리케이션으로 미리 설정되어 있는 경우, 제 1 객 체로부터 제 2 설정 영역으로의 터치 드래그 입력이 검출되는 것에 기반하여, 전자 장치 는, 메시지 어플리케이션을 제 2 실행 화면(예: 도 5의 제 2 실행 화면)을 제공하는 제 2 어플리케이 션으로 결정할 수 있다. 메시지 어플리케이션은 제 1 객체를 포함하는 메시지 입력 화면과, 가상 키보드 화면을 포함하는 실행 화면을 구성할 수 있으며, 전자 장치는 구성된 실행 화면을 표시할 수 있다. 한편, 상술한 메시지 어플리케이션의 할당 객체를 처리하는 방식은 단순히 예시적인 것으로, 어플리케이션 별로 할당 받은 객체를 처리하는 방식이 상이하게 설정될 수 있음을 당업자는 이해할 것이다. 도 17c는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에서, 도 17c를 참조하면, 전자 장치는, 디스플레이 모듈의 제 1 영역에 표시된 제 1 어플리케이션의 제 1 실행 화면(예: 도 5의 제 1 실행 화면)에 포함된 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 1716)을 검출하고, 제 1 폴더블 영역에서의 롱 터치 입력(예: 1726)을 검출할 수 있다. 예를 들어, 전자 장치는, 제 1 객체로부터 제 1 폴더블 영역 으로의 터치 드래그 입력(예: 1716)을 검출하고, 제 1 폴더블 영역에서의 롱 터치 입력(예: 1726)을검출하는 것에 기반하여, 제 1 객체와 관련된 정보를 전자 장치의 임시 저장소에 저장할 수 있다. 또는, 예를 들어, 전자 장치는, 제 1 객체로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 1716)을 검출하고, 제 1 폴더블 영역에서의 롱 터치 입력(예: 1726)을 검출하는 것에 기반하여, 제 1 객체에 대응하는 아이콘을 포함하는 리스트(예: 도 8의 880)를 제 1 폴더블 영역에 표시할 수 있다. 또한, 예를 들어, 도 5의 터치 드래그 입력을 검출하는 것은 도 17c의 터치 드래그 입력과 롱 터치 입력을 검출하는 것을 포함할 수 있다. 도 17d는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에서, 도 17d를 참조하면, 전자 장치는, 디스플레이 모듈의 제 1 영역에 표시된 제 1 어플리케이션의 제 1 실행 화면(예: 도 5의 제 1 실행 화면)에 포함된 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 1714)을 검출하고, 제 1 폴더블 영역에서의 터치 드래 그 입력(예: 1715)을 검출하고, 제 1 폴더블 영역에 포함되는 특정 영역(예: 1725)에서의 롱 터치 입력을 검출할 수 있다. 예를 들어, 전자 장치는, 제 1 객체로부터 제 1 폴더블 영역으로의 터치 드래 그 입력(예: 1714)을 검출하고, 제 1 폴더블 영역에서의 터치 드래그 입력(예: 1715)을 검출하고, 제 1 폴 더블 영역에 포함되는 특정 영역(예: 1725)에서의 롱 터치 입력을 검출하는 것에 기반하여, 제 1 객체 와 관련된 정보를 전자 장치의 임시 저장소에 저장할 수 있다. 또는, 예를 들어, 전자 장치는, 제 1 객체로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 1714)을 검출하고, 제 1 폴더블 영 역에서의 터치 드래그 입력(예: 1715)을 검출하고, 제 1 폴더블 영역에 포함되는 특정 영역(예: 1725)에서의 롱 터치 입력을 검출하는 것에 기반하여, 제 1 객체에 대응하는 아이콘을 포함하는 리스트 (예: 도 8의 880)를 제 1 폴더블 영역에 표시할 수 있다. 또한, 예를 들어, 도 5의 터치 드래그 입력(52 3)을 검출하는 것은 도 17d의 터치 드래그 입력, 터치 드래그 입력 및 롱 터치 입력(예: 특정 영역 에서의 롱 터치 입력)을 검출하는 것을 포함할 수 있다. 도 18은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 18의 실시예는 도 19, 도 20 및 도 21을 참조하여 설명하도록 한다. 도 19는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 사시도이다. 도 20은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 21은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라, 도 19를 참조하면, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조) 의 펼쳐진 상태 또는 접힌 상태에 따라 사용자가 바라보는 전자 장치의 전면에 노출되는 디스플레이 모듈 의 특정 영역이 결정되며, 사용자가 바라보는 전자 장치의 전면에 노출되는 디스플레이 모듈의 특정 영역이 결정되는 방식은 상술한 실시예들에 의해 용이하게 이해될 수 있다. 예를 들어, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 펼쳐진 상태 또는 접힌 상태에 따라 디스플레이 모듈의 특정 영역을 활성화하고, 디스플레이 모듈으 다른 특정 영역을 비활 성화 할 수 있다. 예를 들어, 디스플레이 모듈의 특정 영역의 비활성화는 디스플레이 모듈의 특정 영 역의 터치 센싱 및/또는 화면 표시를 비활성화시키는 것을 의미할 수 있고, 디스플레이 모듈의 특정 영역 의 활성화는 디스플레이 모듈의 특정 영역의 터치 센싱 및/또는 화면 표시를 활성화시키는 것을 의미할 수 있다. 예를 들어, 전자 장치는, 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태인 경우, 디스플레이 모듈의 제 2 영역, 제 3 영역 및 제 2 폴더블 영역을 비활성화 할 수 있다. 예를 들어, 전자 장치는, 제 1 힌지 구조 (예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고, 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼 쳐진 상태인 경우, 디스플레이 모듈의 제 1 영역을 비활성화 할 수 있다. 예를 들어, 전자 장치 는, 전자 장치는, 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a 의 제 2 힌지 구조)가 모두 접힌 상태에서 디스플레이 모듈의 제 2 영역, 제 3 영역 및 제 2 폴더블 영역을 비활성화하고 디스플레이 모듈의 제 1 영역 및 제 1 폴더블 영역의 전부 또는 일부 영역을 활성화한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태 가 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고, 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태로 변화(Unfolding)하는 것에 기반하여, 디스플레이 모듈의 제 1 영역을 비활성화 하고 디스플레이 모듈의 제 2 영역, 제 3 영역, 제 2 폴더블 영역, 및 제 1 폴더 블 영역의 전부 또는 일부 영역를 활성화 할 수 있다. 한편, 상술한 디스플레이 모듈의 특정 영역의 활성화 및 비활성화 동작은, 일 실시예를 예시적으로 개시한 것이며, 전자 장치의 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태 변화에 따라 디스플레이 모듈의 특정 영역의 활성화 및 비활성화 동작이 수행될 수 있음은 당업자는 이해할 것이다. 일 실시예에 따라서, 도 18, 도 19, 도 20 및 도 21을 참조하면, 1801 동작에서, 전자 장치(예: 도 1의 프 로세서)는, 전자 장치에 구비된 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조 )의 상태가 제 1 상태인 경우, 제 1 어플리케이션의 제 1 실행 화면을, 디스플레이 모듈에 표시 할 수 있다. 예를 들어, 1801 동작은, 도 4의 401 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 18, 도 19, 도 20 및 도 21을 참조하면, 1803 동작에서, 전자 장치는, 제 1 폴더 블 영역이 접힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체 )를 식별할 수 있다. 예를 들어, 전자 장치는, 사용자 입력에 응답하여, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)를 식별할 수 있다. 예를 들어, 전자 장치는, 사용 자 입력, 예를 들어 객체(예: 제 1 객체)로부터 제 1 실행 화면이 표시되는 제 1 영역에 인접하 는 폴더블 영역(예: 제 1 폴더블 영역)으로의 터치 드래그 입력, 또는 객체(예: 제 1 객체)로부터 제 1 영역의 엣지 영역으로의 터치 드래그 입력에 응답하여, 제 1 어플리케이션의 제 1 실행 화면에 포 함되는 객체(예: 제 1 객체)를 식별할 수 있다. 예를 들어, 객체(예: 제 1 객체)로부터 제 1 실행 화면이 표시되는 제 1 영역에 인접하는 폴더블 영역(예: 제 1 폴더블 영역)으로의 터치 드래그 입력에 대한 설명은, 도 4의 403 동작과 연관된 터치 드래그 입력(예: 도 5의 523)에 대한 설명과 유사하게 설 명될 수 있다. 또한, 폴더블 영역(예: 제 1 폴더블 영역)으로의 터치 드래그 입력, 또는 엣지 영역으로의 터치 드래그 입력의 구체적인 실시예에 대하여는 도 22를 참조하여 후술하도록 한다. 일 실시예에 따라, 도 18, 도 19, 도 20 및 도 21을 참조하면, 1803 동작이 수행된 후, 전자 장치는, 제 1 폴더블 영역의 접힌 상태가 검출됨과, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력이 검출되는 것에 기반하여, 객체(예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시할 수 있다. 예를 들어, 객체(예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘) 을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시하는 동작은, 도 7의 705 동작과 유사하 게 설명될 수 있다. 한편, 상술한 1803 동작이 수행된 후, 후술하는 1805 동작이 수행되기 전에, 상술한 객체 (예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시하는 동작은 수행될 수도 있고, 생략될 수도 있다. 일 실시예에 따라서, 도 18, 도 19, 도 20 및 도 21을 참조하면, 1805 동작에서, 전자 장치는, 힌지 구조 (예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 식별된 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상 이한 제 2 어플리케이션의 제 2 실행 화면을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 전자 장치는, 사용자 입력에 응답하여, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객 체)를 식별한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태에서 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태로 변화(예: Unfolding(202 4))하는 것에 기반하여, 식별된 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 1 어플리케 이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태 이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태에 대응하여 설정된 디스플레이 모듈 의 특정 영역, 예를 들어, 디스플레이 모듈의 제 2 영역, 제 3 영역 및 제 2 폴더블 영역을 포함하는 영역)에 표시할 수 있다. 한편, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태에 대응하여 설정된 디스플레이 모듈의 특정 영역(예: 520)은 제 1 폴더블 영역의 전부 또는 일부를 포함할 수 있다. 도 20의 실시예에서는,예를 들어, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 디스플레이 모듈에 표시하 는 동작은, 도 4의 405 동작에서 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 디스 플레이 모듈에 표시하는 동작과 유사하게 설명될 수 있다. 예를 들어, 도 21의 실시예에서는, 웹 브라우 징 어플리케이션인 제 1 어플리케이션의 제 1 실행 화면에 포함된 특정 객체, 예를 들어 특정 텍스트가 식 별될 수 있다. 전자 장치는, 터치에 응답하여, 특정 객체, 예를 들어 특정 텍스트가 식별되었음을나타내는 또 다른 객체를, 터치의 위치에 대응하여 표시할 수 있다. 또 다른 객체는, 식별된 특정 객체, 예를 들어 식별된 텍스트를 포함하는 객체로서, 그 구현 형태에는 제한이 없다. 도 21에서 전자 장 치가 또 다른 객체를 표시하고 이동시키는 동작은, 도 5에서 전자 장치9101)가 또 다른 객체를 표시하고 이동시키는 동작과 유사하게 설명될 수 있다. 전자 장치는, 특정 객체, 예를 들어 특정 텍스트로 부터 제 1 폴더블 영역으로의 터치 드래그 입력이 검출되는 것에 기반하여, 제 1 폴더블 영역 에 특정 객체, 예를 들어 특정 텍스트에 대응하는 아이콘을 포함하는 리스트를 표시할 수도 있다. 전자 장치는 특정 객체, 예를 들어 특정 텍스트를 제 2 어플리케이션, 예를 들어 메시지 어플리케이션에 할당할 수 있다. 메시지 어플리케이션은, 할당받은 특정 텍스트를 포함하는 메시지 입력 화면과, 메시지 입력 에 사용되는 가상 키보드 화면을 포함하는 제 2 실행 화면을 구성할 수 있으며, 전자 장치는 구성된 제 2 실행 화면을 디스플레이 모듈의 특정 영역(예: 520)에 표시할 수 있다. 일 실시예에 따라서, 도 18, 도 19, 도 20 및 도 21을 참조하면, 1807 동작에서, 전자 장치는, 힌지 구조 (예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태로부터 제 3 상태로 변화하는 것에 기반하여, 식별된 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 2 어플리케이션과 상 이한 제 3 어플리케이션의 제 3 실행 화면을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 전자 장 치는, 사용자 입력에 응답하여, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체 )를 식별한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상 태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구 조)가 모두 접힌 상태에서 제 3 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 펼쳐진 상태로 변화(예: Unfolding)하는 것에 기 반하여, 식별된 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 2 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조 )의 제 3 상태, 예를 들어 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구 조(예: 도 3a의 제 2 힌지 구조)가 모두 펼쳐진 상태에 대응하여 설정된 디스플레이 모듈의 특정 영 역(예: 디스플레이 모듈의 제 1 영역, 제 2 영역, 제 3 영역, 제 1 폴더블 영역 및 제 2 폴더블 영역을 포함하는 영역)에 표시할 수 있다. 예를 들어, 전자 장치는 제 3 어플 리케이션을 실행할 수 있으며, 제 3 어플리케이션에 식별된 객체, 예를 들어 제 1 객체를 할당할 수 있다. 제 3 어플리케이션은, 할당받은 제 1 객체를 이용하여 제 3 실행 화면을 구성할 수 있으며, 전자 장 치는 구성된 제 3 실행 화면을 표시할 수 있다. 예를 들어, 도 20의 실시예에서는, 웹 브라우징 어 플리케이션인 제 1 어플리케이션의 제 1 실행 화면에 포함된 제 1 객체, 예를 들어 이미지 파일이 식 별될 수 있다. 전자 장치는, 제 1 객체, 예를 들어 이미지 파일을 제 3 어플리케이션, 예를 들어 이 미지 편집 어플리케이션에 할당할 수 있다. 이미지 편집 어플리케이션은, 이미지 파일을 수정할 수 있는 아이 콘을 포함하는 툴과, 할당받은 이미지 파일을 전체 화면으로 포함하는 제 3 실행 화면을 구성할 수 있으며, 전자 장치는 구성된 제 3 실행 화면을 표시할 수 있다. 제 3 어플리케이션은, 식별된 객체, 예를 들어 제 1 객체의 전체 정보를 이용하거나, 또는 일부 정보를 이용하여 제 3 어플리케이션 실행 화면 을 구성할 수도 있다. 예를 들어, 도 21의 실시예에서는, 웹 브라우징 어플리케이션인 제 1 어플리케이션의 제 1 실행 화면에 포함된 특정 객체, 예를 들어 특정 텍스트가 식별될 수 있다. 전자 장치는, 특정 객체, 예를 들어 특정 텍스트를 제 3 어플리케이션, 예를 들어 텍스트 편집 어플리케이션에 할당할 수 있다. 텍 스트 편집 어플리케이션은, 텍스트를 수정할 수 있는 아이콘을 포함하는 툴과, 할당받은 특정 텍스트를 포함하 는 제 3 실행 화면을 구성할 수 있으며, 전자 장치는 구성된 제 3 실행 화면을 표시할 수 있 다. 한편, 제 3 어플리케이션은, 식별된 객체, 예를 들어 텍스트의 전체 정보를 이용하거나, 또는 일부 정보를 이용하여 제 3 어플리케이션 실행 화면을 구성할 수도 있다. 도 22는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 예를 들어, 도 22를 참조하면, 도 4 및 도 5의 실시예에 개시된 터치 드래그 입력(예: 523)의 구체적인 실시예, 또는 도 18 및 도 20의 실시예에 개시 된 사용자 입력의 구체적인 실시예를 이해할 수 있다. 일 실시예에 따라서, 도 22를 참조하면, 전자 장치는, 디스플레이 모듈의 활성화 영역에 포함되는 폴 더블 영역(예: 제 1 폴더블 영역 또는 제 2 폴더블 영역) 또는 엣지 영역으로의 터치 드래그 입력을 검출할 수 있다. 디스플레이 영역의 엣지 영역은, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태에 따라, 사용자가 바라보는 전자 장치의 전면에 노출되는 디스플레이 영역의 특정 영역 중에서 가장자리에 위치한 영역을 의미할 수 있으며, 디스플레이 영역의 노출된 영역이 실질적 으로 직사각형 형태인 경우, 엣지 영역은 상단 엣지 영역, 하단 엣지 영역, 우측 엣지 영역 또는 좌측 엣지 영역 중 적어도 하나를 포함할 수 있다. 또한, 디스플레이 영역의 노출된 영역의 형태에 기반하여, 엣지 영 역은 상단 엣지 영역, 하단 엣지 영역, 우측 엣지 영역, 좌측 엣지 영역, 좌상단(upper-left) 엣지 영역, 우상 단(upper-right) 엣지 영역, 좌하단(lower-left) 엣지 영역, 또는 우하단(lower-right) 엣지 영역을 포함할 수 있다. 일 실시예에 따라, 도 22의 (a)를 참조하면, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또 는 제 2 힌지 구조)의 상태가 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태인 경우, 디스플레이 모듈의 제 1 영 역 및 제 1 폴더블 영역의 전부 또는 일부 영역을 활성화할 수 있다. 예를 들어, 도 22의 (a)의 실시 예에서, 전자 장치는, 디스플레이 모듈의 활성화된 영역(예: 제 1 영역)에 포함된 객체(예: 객 체)로부터 디스플레이 모듈의 제 1 폴더블 영역으로의 터치 드래그 입력을 검출할 수 있 고, 디스플레이 모듈의 활성화된 영역(예: 제 1 영역)에 포함된 객체(예: 객체)로부터 디스플 레이 모듈의 엣지 영역으로의 터치 드래그 입력(예: 상단 엣지 영역으로의 터치 드래그 입력, 좌측 엣지 영역으로의 터치 드래그 입력, 또는 하단 엣지 영역으로의 터치 드래그 입력)을 검출할 수 있 다. 예를 들어, 도 22의 (a)의 실시예에서, 전자 장치는, 디스플레이 모듈의 활성화된 영역(예: 제 1 영역)에 포함된 객체(예: 객체)로부터 디스플레이 모듈의 제 1 폴더블 영역으로의 터치 드래그 입력, 또는 디스플레이 모듈의 활성화된 영역(예: 제 1 영역)에 포함된 객체(예: 객체 )로부터 디스플레이 모듈의 엣지 영역으로의 터치 드래그 입력(예: 상단 엣지 영역으로의 터치 드래 그 입력, 좌측 엣지 영역으로의 터치 드래그 입력, 또는 하단 엣지 영역으로의 터치 드래그 입력 )을 객체(예: 객체)를 식별하는 사용자 입력으로 확인할 수 있다. 예를 들어, 전자 장치는, 터치 드래그 입력(예: 2224, 2225, 2226, 또는 2227)을, 객체(예: 객체)를 식별하는 사용자 입력으로 확 인하는 것에 기반하여, 전술한 도 18의 1803 동작을 수행할 수 있다. 일 실시예에 따라, 도 22의 (b)를 참조하면, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또 는 제 2 힌지 구조)의 상태가 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태인 경우, 디스플레이 모듈(16 0)의 제 2 영역, 제 3 영역, 제 2 폴더블 영역 및 제 1 폴더블 영역의 전부 또는 일부 영 역을 활성화할 수 있다. 예를 들어, 도 22의 (b)의 실시예에서, 전자 장치는, 디스플레이 모듈의 활 성화된 영역(예: 제 2 영역)에 포함된 객체(예: 객체)로부터 디스플레이 모듈의 제 1 폴더블 영역으로의 터치 드래그 입력을 검출할 수 있고, 디스플레이 모듈의 활성화된 영역(예: 제 2 영역)에 포함된 객체(예: 객체)로부터 디스플레이 모듈의 엣지 영역으로의 터치 드래그 입력 (예: 상단 엣지 영역으로의 터치 드래그 입력, 우측 엣지 영역으로의 터치 드래그 입력, 또는 하단 엣지 영역으로의 터치 드래그 입력)을 검출할 수 있다. 예를 들어, 도 22의 (b)의 실시예에서, 전자 장치 는, 디스플레이 모듈의 활성화된 영역(예: 제 2 영역)에 포함된 객체(예: 객체)로부터 디 스플레이 모듈의 제 1 폴더블 영역으로의 터치 드래그 입력, 또는 디스플레이 모듈의 활 성화된 영역(예: 제 2 영역)에 포함된 객체(예: 객체)로부터 디스플레이 모듈의 엣지 영역으로 의 터치 드래그 입력(예: 상단 엣지 영역으로의 터치 드래그 입력, 우측 엣지 영역으로의 터치 드래그 입 력, 또는 하단 엣지 영역으로의 터치 드래그 입력)을 객체(예: 객체)를 식별하는 사용자 입 력으로 확인할 수 있다. 예를 들어, 전자 장치는, 터치 드래그 입력(예: 2234, 2235, 2236, 또는 2237)을, 객체(예: 객체)를 식별하는 사용자 입력으로 확인하는 것에 기반하여, 전술한 도 18의 1803 동 작을 수행할 수 있다. 일 실시예에 따라, 도 22의 (c)를 참조하면, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또 는 제 2 힌지 구조)의 상태가 제 3 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 펼쳐진 상태인 경우, 디스플레이 모듈의 제 1 영역, 제 2 영역, 제 3 영역, 제 1 폴더블 영역 및 제 2 폴더블 영역을 활성화할 수 있다. 예를 들어, 도 22의 (c)의 실시예에서, 전자 장치는, 디스플레이 모듈의 활성화된 영역(예: 제 2 영역)에 포함된 객체(예: 객체)로부터 디스플레이 모듈의 엣지 영역으로의 터치 드래그 입력 (예: 상단 엣지 영역으로의 터치 드래그 입력, 우측 엣지 영역으로의 터치 드래그 입력, 좌측 엣지 영역으로의 터치 드래그 입력 또는 하단 엣지 영역으로의 터치 드래그 입력)을 검출할 수 있다. 예 를 들어, 도 22의 (c)의 실시예에서, 전자 장치는, 디스플레이 모듈의 활성화된 영역(예: 제 2 영역 )에 포함된 객체(예: 객체)로부터 디스플레이 모듈의 엣지 영역으로의 터치 드래그 입력(예: 상단 엣지 영역으로의 터치 드래그 입력, 우측 엣지 영역으로의 터치 드래그 입력, 좌측 엣지 영역으로의 터치 드래그 입력 또는 하단 엣지 영역으로의 터치 드래그 입력)을 객체(예: 객체)를 식별하는 사용자 입력으로 확인할 수 있다. 예를 들어, 전자 장치는, 터치 드래그 입력(예: 2244, 2245, 2246, 또는 2247)을, 객체(예: 객체)를 식별하는 사용자 입력으로 확인하는 것에 기반하여, 전술한 도 18 의 1803 동작을 수행할 수 있다. 한편, 일 실시예에 따라, 도 22의 (a), (b), 및 (c)를 참조하면, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태에 기반하여, 객체(예: 도 22의 (a)의 객체, 도 22 의 (b)의 객체, 또는 도 22의 (c)의 객체)로부터 제 1 폴더블 영역으로의 터치 드래그 입력 (예: 도 22의 (a)의 2224, 도 22의 (b)의 2236, 또는 도 22의 (c)의 2248))에 대응하여 수행되는 동작을 결정 할 수 있다. 예를 들어, 도 22의 (a)의 실시예에서, 전자 장치는, 디스플레이 모듈의 활성화된 영역 (예: 제 1 영역)에 포함된 객체(예: 객체)로부터 디스플레이 모듈의 제 1 폴더블 영역으 로의 터치 드래그 입력을 객체(예: 객체)를 식별하는 사용자 입력으로 확인하는 것에 기반하여, 전 술한 도 18의 1803 동작을 수행할 수 있다. 예를 들어, 도 22의 (b)의 실시예에서, 전자 장치는, 디스플레 이 모듈의 활성화된 영역(예: 제 2 영역)에 포함된 객체(예: 객체)로부터 디스플레이 모듈 의 제 1 폴더블 영역으로의 터치 드래그 입력을 객체(예: 객체)를 식별하는 사용자 입력 으로 확인하는 것에 기반하여, 전술한 도 18의 1803 동작을 수행할 수 있다. 한편, 예를 들어, 도 22의 (c)의 실시예에서, 전자 장치는, 디스플레이 모듈의 활성화된 영역(예: 제 2 영역)에 포함된 객체(예: 객체)로부터 디스플레이 모듈의 제 1 폴더블 영역으로의 터치 드래그 입력을 검출하는 것에 기반하여, 객체(예: 객체)를 터치 드래그 입력의 종료 위치(end point)에 대응하는 위치에 표 시할 수 있다., 도 23은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 23의 실시예는 도 24 를 참조하여 설명하도록 한다. 도 24는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 23 및 도 24를 참조하면, 2301 동작에서, 전자 장치(예: 도 1의 프로세서)는, 전자 장치에 구비된 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조 )의 상태가 제 1 상태인 경우, 제 1 어플리케이션의 제 1 실행 화면을, 디스플레이 모듈에 표시 할 수 있다. 예를 들어, 2301 동작은, 도 4의 401 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 23 및 도 24를 참조하면, 2303 동작에서, 전자 장치는, 제 1 폴더블 영역이 접힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)를 식별할 수 있다. 예를 들어, 전자 장치는, 사용자 입력에 응답하여, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)를 식별할 수 있다. 예를 들어, 1803 동작은, 도 4의 402 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 23 및 도 24를 참조하면, 2303 동작이 수행된 후, 전자 장치는, 제 1 폴더블 영역 의 접힌 상태가 검출됨과, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체 )로부터 제 1 폴더블 영역으로의 터치 드래그 입력(예: 도 5의 523)이 검출되는 것에 기반하여, 객체 (예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시할 수 있다. 예를 들어, 객체(예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘 )을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시하는 동작은, 도 7의 705 동작과 유사하게 설명될 수 있다. 한편, 상술한 2303 동작이 수행된 후, 후술하는 1805 동작이 수행되기 전에, 상술한 객체(예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 제 1 폴더블 영역에 표시하는 동작은 수행될 수도 있고, 생략될 수도 있다. 일 실시예에 따라서, 도 23 및 도 24를 참조하면, 2305 동작에서, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 식별된 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플 리케이션의 제 2 실행 화면을, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 제 2 상태에 대응하여 설정된 디스플레이 모듈의 특정 영역에 표시할 수 있다. 예를 들어, 2305 동 작은, 도 18의 1805 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 23 및 도 24를 참조하면, 2307 동작에서, 전자 장치는, 제 2 어플리케이션의 제 2 실행 화면을 디스플레이 모듈에 표시한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 2 상태로부터 제 3 상태로 변화하는 것에 기반하여, 식별된 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 2 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면 을, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 제 3 상태에 대응하여 설 정된 디스플레이 모듈의 특정 영역에 표시할 수 있다. 예를 들어, 전자 장치는, 제 2 어플리케 이션의 제 2 실행 화면을 디스플레이 모듈에 표시한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태에서 제 3 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모 두 펼쳐진 상태로 변화(예: Unfolding)하는 것에 기반하여, 식별된 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 2 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을, 힌지 구 조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 제 3 상태, 예를 들어 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 펼쳐진 상태에 대응하여 설정된 디스플레이 모듈의 특정 영역(예: 디스플레이 모듈의 제 1 영역, 제 2 영역, 제 3 영역, 제 1 폴더블 영역 및 제 2 폴더블 영역을 포함하는 영역)에 표시할 수 있다. 도 25는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 25의 실시예는 도 26 을 참조하여 설명하도록 한다. 도 26은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 25 및 도 26을 참조하면, 2501 동작에서, 전자 장치(예: 도 1의 프로세서)는, 적어도 하나의 객체를 식별할 수 있다. 예를 들어, 전자 장치는, 사용자 입력에 응답하 여, 디스플레이 모듈의 특정 영역(예: 제 1 폴더블 영역)에 리스트를 표시할 수 있다. 예를 들 어, 전자 장치는, 객체(예: 제 1 객체)로부터 디스플레이 모듈의 특정 영역(예: 제 1 폴더블 영 역)으로의 터치 드래그 입력(예: 도 5의 523)에 응답하여, 또는 후술하는 호출 명령에 응답하여, 디스플레 이 모듈의 특정 영역(예: 제 1 폴더블 영역)에 리스트를 표시할 수 있다. 예를 들어, 리스트 는 적어도 하나의 아이콘(예: 제 1 아이콘 또는 제 2 아이콘)을 포함할 수 있다. 예를 들어, 제 1 아이콘은, 제 1 객체에 대응하는 아이콘으로서, 예를 들어, 제 1 객체(예: 제 1 객체)가 임시 저장소에 저장되어 있음을 나타내는 아이콘일 수 있고, 제 2 아이콘은, 제 2 객체(미도시)에 대응하 는 아이콘으로서, 예를 들어, 제 2 객체(미도시)가 임시 저장소에 저장되어 있음을 나타내는 아이콘일 수 있다. 한편, 전자 장치는, 디스플레이 모듈의 특정 영역(예: 제 1 폴더블 영역)에 표시된 리스트(88 0)에 포함된, 적어도 하나의 객체(예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘)에 대한 터치 에 응답하여, 적어도 하나의 객체(예: 제 1 객체)를 식별할 수 있다. 예를 들어, 전자 장치는, 리스트에 포함된, 적어도 하나의 객체(예: 제 1 객체)에 대응하는 아이콘(예: 제 1 아이콘)에 대한 터치에 응답하여 적어도 하나의 객체(예: 제 1 객체)가 식별되는 경우, 리스트에 포함된 터치된 아이콘(예: 제 1 아이콘)에 식별 마크(예: 제 1 식별 마크)를 표시할 수 있다. 예를 들어, 도 26의 실시예에서, 전자 장치는, 리스트에 포함되는 제 1 아이콘에 대한 터치에 응답 하여, 제 1 아이콘에 제 1 식별 마크를 표시할 수 있고, 또한, 리스트에 포함되는 제 2 아이 콘에 대한 터치에 응답하여, 제 2 아이콘에 제 2 식별 마크를 표시할 수 있다. 일 실시예에 따라서, 도 25 및 도 26을 참조하면, 2503 동작에서, 전자 장치는, 식별된 적어도 하나의 객 체(예: 제 1 객체, 제 2 객체(미도시), 제 3 객체(미도시) 또는 제 4 객체(미도시))의 개수에 기반하여, 식별된 적어도 하나의 객체(예: 제 1 객체, 제 2 객체(미도시), 제 3 객체(미도시) 또는 제 4 객체(미도시)) 의 적어도 일부를 이용하여 획득되는, 제 2 어플리케이션의 제 2 실행 화면(예: 2602a 또는 2602b), 또는 식별된 적어도 하나의 객체의 적어도 일부를 이용하여 획득되는, 제 3 어플리케이션의 제 3 실행 화면(예: 2603a 또는 2603b)의 레이아웃을 결정할 수 있다. 예를 들어, 도 26의 실시예에서, 일 실시예에 따라서, 전자 장치는, 2개의 아이콘, 예를 들어 제 1 아이콘 및 제 2 아이콘에 대한 터치(2621 및 2622)에 응답하여, 2개의 객체, 예를 들어 제 1 아이콘 에 대응하는 제 1 객체 및 제 2 아이콘에 대응하는 제 2 객체(미도시)를 식별한 후, 힌지 구 조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태, 예를 들어 제 1 힌지 구 조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태 에서 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조 (예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태로 변화(예: Unfolding)하는 것에 기반하여, 제 1 어 플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면(2602a)의 레이아웃을, 제 1 객체 및 제 2 객체(미도시)를 분할하여 표시하거나 겹쳐서 표시할 수 있는 형태로 결정하고, 결정된 레이아웃에 제 1 객체 및 제 2 객체(미도시)를 포함하여 표시할 수 있다. 마찬가지로, 전자 장치는, 4개의 아이콘에 대한 터치에 응답하여, 4개의 아이콘 각각에 대응하는 4개의 객체를 식별한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 변화(예: Unfolding)하는 것에 기반하여, 제 1 어플리케이션과 상이 한 제 2 어플리케이션의 제 2 실행 화면(2602b)의 레이아웃을, 4개의 객체를 분할하여 표시하거나 겹쳐서 표시 할 수 있는 형태로 결정하고, 결정된 레이아웃에 4개의 객체를 포함하여 표시할 수 있다. 또한, 예를 들어, 도 26의 실시예에서, 일 실시예에 따라서, 전자 장치는, 2개의 아이콘, 예를 들어 제 1 아이콘 및 제 2 아이콘에 대한 터치(2621 및 2622)에 응답하여, 2개의 객체, 예를 들어 제 1 아이 콘에 대응하는 제 1 객체 및 제 2 아이콘에 대응하는 제 2 객체(미도시)를 식별한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상 태에서 제 3 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a 의 제 2 힌지 구조)가 모두 펼쳐진 상태로 변화(예: Unfolding)하는 것에 기반하여, 제 2 어플리케 이션과 상이한 제 3 어플리케이션의 제 3 실행 화면(2603a)의 레이아웃을, 제 1 객체 및 제 2 객체(미도시)를 분할하여 표시하거나 겹쳐서 표시할 수 있는 형태로 결정하고, 결정된 레이아웃에 제 1 객체 및 제 2 객체(미도시)를 포함하여 표시할 수 있다. 마찬가지로, 전자 장치는, 3개의 아이콘에 대한 터치에 응답하여, 3개의 아이콘 각각에 대응하는 3개의 객체를 식별한 후, 힌지 구조(예: 도 3a의 제 1 힌지 구 조 또는 제 2 힌지 구조)의 상태가 변화(예: Unfolding)하는 것에 기반하여, 제 1 어플리케이 션과 상이한 제 2 어플리케이션의 제 3 실행 화면(2603b)의 레이아웃을, 3개의 객체를 분할하여 표시하거나 겹 쳐서 표시할 수 있는 형태로 결정하고, 결정된 레이아웃에 3개의 객체를 포함하여 표시할 수 있다. 한편, 실행 화면의 레이아웃은 도 26에 개시된 실시예에 한정되지 않으며, 식별된 객체의 개수가 미리 설정된 개수를 초과 하는 경우, 적절한 레이아웃이 지원되지 않을 수 있음을 나타내는 알림이 표시될 수 있다. 도 27은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 27의 실시예는 도 28 및 도 29를 참조하여 설명하도록 한다. 도 28은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 29는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 27, 도 28 및 도 29을 참조하면, 2701 동작에서, 전자 장치(예: 도 1의 프로세서 )는, 두 개 이상의 객체를 식별할 수 있다. 예를 들어, 2701 동작은, 도 25의 2501 동작과 유사하게 설명 될 수 있다. 일 실시예에 따라서, 도 27, 도 28 및 도 29을 참조하면, 2703 동작에서, 전자 장치는, 사용자 입력에 응 답하여, 식별된 두 개 이상의 객체를 병합한 객체의 적어도 일부를 이용하여 획득되는 어플리케이션의 실행 화 면을 표시하거나, 또는 식별된 두 개 이상의 객체 각각에 대응하는 복수 개의 서브 화면을 표시할 수 있다. 예 를 들어, 전자 장치는, 동일한 식별 타입에 해당하는 두 개 이상의 객체가 식별되는 경우, 표시 방법(예: 멀티 윈도우 표시 또는 병합 윈도우 표시)을 선택할 수 있는 팝업창을 디스플레이 모듈(16 0)에 표시할 수 있고, 표시 방법(예: 멀티 윈도우 표시 또는 병합 윈도우 표시)을 선택하는 사용자 입력(예: 터치 입력)에 응답하여, 식별된 두 개 이상의 객체를 병합한 객체의 적어도 일부를 이용하여 획득되는 어플리케이션의 실행 화면을 표시하거나, 또는 식별된 두 개 이상의 객체 각각에 대응하는 복수 개의 서브 화면 을 표시할 수 있다. 예를 들어, 전자 장치는, 표시 방법(예: 멀티 윈도우 표시 또는 병합 윈도우 표시)을 선택할 수 있는 팝업창을, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구 조)의 상태가 변화한 후에 표시할 수 있으며, 또는, 두 개 이상의 객체가 식별된 후, 힌지 구조(예: 도 3a 의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 변화하기 전에 표시할 수도 있다. 일 실시예에 따라, 도 28의 실시예에서는, 식별된 두 개 이상의 객체(예:제 1 객체 및 제 2 객체) 가 동일한 식별 타입을 가지는 경우를 예시적으로 개시한다. 예를 들어, 제 1 객체의 식별 타입 및 제 2 객체의 식별 타입은 텍스트 타입이고, 제 1 객체 및 제 2 객체가 식별된 경우, 전자 장치 는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태, 예를 들 어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태에서 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태로 변화(예: Unfolding)하는 것에 기반 하여, 표시 방법(예: 멀티 윈도우 표시 또는 병합 윈도우 표시)을 선택할 수 있는 팝업창을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 사용자 입력에 응답하여 멀티 윈도우 표시가 선택되는 경우, 식별된 제 1 객체에 대응하는 제 1 서브 화면(2802a) 및 식별된 제 2 객체에 대응하는 제 2 서브 화면(2802b)을 디스플레이 모듈에 표시할 수 있다. 이 경우, 제 1 서브 화면(2802a) 및 제 2 서브 화면(2802b)는 하나의 어플리케이션에 의하여 생성될 수 있다. 또한, 예를 들어, 사용자 입력에 응답하여 병합 윈도우 표시가 선택되는 경우, 제 1 객체 및 제 2 객체를 병합한 객체의 적어도 일부 를 이용하여 획득되는 어플리케이션의 실행 화면(2802c)을 디스플레이 모듈에 표시할 수 있다. 한편, 힌지 구조의 상태가 제 3 상태로 변화(예: Unfolding)하는 실시예 또한 상술한 실시예와 유사하게 설명될 수 있다. 일 실시예에 따라, 도 29의 실시예에서는, 식별된 두 개 이상의 객체(예:제 1 객체 및 제 2 객체) 가 상이한 식별 타입을 가지는 경우를 예시적으로 개시한다. 예를 들어, 제 1 객체의 식별 타입은 이미지 타입이고, 제 2 객체의 식별 타입은 텍스트 타입이며, 제 1 객체 및 제 2 객체가 식별된 경 우, 전자 장치는, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 접힌 상태에서 제 2 상태, 예를 들어 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조)는 접힌 상태이고 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)는 펼쳐진 상태로 변화(예: Unfolding(292 4))하는 것에 기반하여, 제 1 객체에 대응하는 제 1 서브 화면(2902a) 및 제 2 객체에 대응하는 제 2 서브 화면(2902b)을 디스플레이 모듈에 표시할 수 있다. 이 경우, 제 1 서브 화면(2902a) 및 제 2 서브 화면(2902b)은 상이한 어플리케이션들 각각에 의하여 생성될 수 있으며, 제 1 서브 화면(2902a)를 생성하는 어 플리케이션과 제 2 서브 화면(2902b)를 생성하는 어플리케이션은 각각 제 1 객체의 식별 타입 및 제 2 객 체의 식별 타입에 의해 결정될 수 있다. 한편, 힌지 구조의 상태가 제 3 상태로 변화(예: Unfolding)하는 실시예 또한 상술한 실시예와 유사하게 설명될 수 있다. 도 30은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도30의 실시예는 도 32 를 참조하여 설명하도록 한다. 도 32은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 30 및 도 32를 참조하면, 3001 동작에서, 전자 장치(예: 도 1의 프로세서)는, 디스플레이 모듈에 표시된 객체를 식별할 수 있다. 예를 들어, 전자 장치는, 디스 플레이 모듈에 표시된 객체에 대한 터치를 검출하는 것에 기반하여 객체를 식별할 수 있다. 예를 들어, 전 자 장치는, 디스플레이 모듈에 표시된 리스트(예: 도 8의 880)에 포함된 아이콘(예: 제 1 아이콘 )에 대한 터치를 검출하는 것에 기반하여, 아이콘(예: 제 1 아이콘)에 대응하는 객체(예: 제 1 객체 )를 식별할 수 있다. 또는, 예를 들어, 전자 장치는, 디스플레이 모듈에 표시된 객체(예: 도 5 의 제 1 객체)에 대한 터치 드래그 입력(예: 도 5의 523)을 검출하는 것에 기반하여 객체(예: 도 5의 제 1 객체)를 식별할 수 있다. 일 실시예에 따라서, 도 30 및 도 32를 참조하면, 3003 동작에서, 전자 장치는, 식별된 객체의 속성 타입 에 기반하여, 선택 가능한 어플리케이션(또는 선택 가능한 어플리케이션에 대응하는 아이콘 및/또는 어플리케이 션 타이틀(예: 제 1 어플리케이션에 대응하는 아이콘 및/또는 타이틀 또는 제 2 어플리케이션에 대응하는 아이콘 및/또는 타이틀))을 포함하는 제안 옵션(예: 도 32의 제안 옵션)을 표시할 수 있다. 예를 들어, 도 32의 실시예에서, 전자 장치는, 식별된 객체의 속성 타입이 텍스트 타입인 경우, 텍스트 편집 어 플리케이션에 대응하는 아이콘 및/또는 타이틀 및 메시지 어플리케이션에 대응하는 아이콘 및/또는 타이 틀를 포함하는 제안 옵션을 표시할 수 있다. 한편, 도 32에 개시된 제안 옵션(예: 제안 옵션 )에 포함되는 선택 가능한 어플리케이션은, 예시적인 것으로서, 식별된 객체의 속성 타입에 기반하여 미 리 설정될 수 있고, 사용자에 의해 설정 또는 변경될 수 있다. 예를 들어, 제안 옵션(예: 제안 옵션)에 포함되는 선택 가능한 어플리케이션은, 전자 장치에 설치된 어플리케이션 또는 클라우드 어플리케이션을 포함할 수 있다. 또한, 제안 옵션(예: 제안 옵션)에 포함되는 선택 가능한 어플리케이션은, 식별된 객체 의 속성 타입 및 전자 장치의 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태에 따라 미리 설정될 수 있다. 일 실시예에 따라서, 도 30 및 도 32를 참조하면, 3005 동작에서, 전자 장치는, 사용자 입력에 응답하여 제안 옵션(예: 제안 옵션)에 포함된 선택 가능한 어플리케이션 중에서 특정 어플리케이션을 식별할 수 있 다. 예를 들어, 도 32의 실시예에서, 전자 장치는, 사용자 입력에 응답하여 제안 옵션(예: 제안 옵션 )에 포함된 선택 가능한 어플리케이션 중에서 텍스트 편집 어플리케이션을 식별할 수 있다. 일 실시예에 따라서, 도 30 및 도 32를 참조하면, 3007 동작에서, 전자 장치는, 제안 옵션(예: 제안 옵션 )에 포함된 선택 가능한 어플리케이션 중에서 특정 어플리케이션이 식별되는 것에 기반하여, 식별된 객체 의 적어도 일부를 이용하여 획득되는 특정 어플리케이션의 실행 화면을 디스플레이 모듈에 표시할 수 있다. 예를 들어, 도 32의 실시예에서, 전자 장치는, 사용자 입력에 응답하여 제안 옵션(예: 제안 옵션 )에 포함된 선택 가능한 어플리케이션 중에서 텍스트 편집 어플리케이션을 식별되는 것에 기반하여, 식별된 객체를 이용하여 획득되는 텍스트 편집 어플리케이션의 실행 화면을 표시할 수 있다. 도 31은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도31의 실시예는 도 32 를 참조하여 설명하도록 한다. 도 32은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 31 및 도 32를 참조하면, 3101 동작에서, 전자 장치(예: 도 1의 프로세서)는, 디스플레이 모듈에 표시된 객체를 식별할 수 있다. 예를 들어, 3101 동작은, 도 30의 3001 동작과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 31 및 도 32를 참조하면, 3103 동작에서, 전자 장치는, 식별된 객체의 속성 타입 에 기반하여, 식별된 객체의 실행을 위한 어플리케이션의 다운로드 링크(예: 3263)를 포함하는 제안 옵션(예: 도 32의 제안 옵션)을 표시할 수 있다. 일 실시예에 따라서, 도 31 및 도 32를 참조하면, 3105 동작에서, 전자 장치는, 사용자 입력에 응답하여, 제안 옵션(예: 도 32의 제안 옵션)에 포함된, 식별된 객체의 실행을 위한 어플리케이션 중에서 특정 어플 리케이션을 다운로드 할 수 있다. 예를 들어, 도 32의 실시예에서, 전자 장치는, 제안 옵션에 포함 된, 식별된 객체의 실행을 위한 어플리케이션의 다운로드 링크에 대한 사용자 입력, 예를 들어 터치 입력 에 응답하여, 다운로드 링크에 대응하는 특정 어플리케이션을 다운로드 할 수 있다. 일 실시예에 따라서, 도 31 및 도 32를 참조하면, 3107 동작에서, 전자 장치는, 식별된 객체의 적어도 일 부를 이용하여 획득되는 특정 어플리케이션의 실행 화면을 표시할 수 있다. 예를 들어, 도 32의 실시예에서, 전 자 장치는, 제안 옵션에 포함된, 식별된 객체의 실행을 위한 어플리케이션의 다운로드 링크에 대한 사용자 입력, 예를 들어 터치 입력에 응답하여, 다운로드 링크에 대응하는 특정 어플리케이션을 다 운로드하고, 다운로드한 특정 어플리케이션을 이용하여 식별된 객체의 적어도 일부를 이용하여 획득되는 실행 화면을 표시할 수 있다. 도 33은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도33의 실시예는 도 34 를 참조하여 설명하도록 한다. 도 34는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 33 및 도 34를 참조하면, 3301 동작에서, 전자 장치(예: 도 1의 프로세서)는, 호출 명령에 기반하여 적어도 하나의 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 표시할 수 있다. 예를 들어, 도 34의 실시예에서, 전자 장치는, 호출 명령, 예를 들어 디 스플레이 모듈의 엣지 영역(예: 도 22의 엣지 영역) 또는 폴더블 영역(예: 제 1 폴더블 영역)으로부 터 디스플레이 모듈의 특정 영역(예: 제 1 영역)으로의 사용자 입력(예: 스와이프 입력)에 기 반하여, 적어도 하나의 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 표시할 수 있다. 일 실시예에 따라서, 도 33 및 도 34를 참조하면, 3303 동작에서, 전자 장치는, 리스트(예: 리스트) 에 포함된 제 1 아이콘(예: 제 1 아이콘)에 대한 선택에 기반하여, 제 1 아이콘(예: 제 1 아이콘) 에 대응하는 특정 객체의 적어도 일부를 이용하여 획득되는 특정 어플리케이션의 실행 화면을 표시할 수 있다. 예를 들어, 제 1 아이콘(예: 제 1 아이콘)에 대응하는 특정 객체의 적어도 일부를 이용하여 획득되는 특 정 어플리케이션의 실행 화면을 표시하는 동작은 전술한 실시예들에 의하여 용이하게 이해될 수 있다. 도 35a, 도 35b, 도 35c, 도 35d, 도 35e 및 도 35f는 일 실시예에 따른 전자 장치에 의해 표시되는 리스트의 표시 형식을 도시한 도면이다. 일 실시예에 따라서, 도 35a를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 1 객체에 대응하는 아이콘(예: 제 1 아이콘)을 포함하는 리스트를 표시할 수 있으며, 아이콘(예: 제 1 아이콘)에 대한 설명은 도 7의 705 동작에 대한 아이콘(예: 제 1 아이콘)에 대한 설명과 유사하게 설명될 수 있다. 일 실시예에 따라서, 도 35b를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 1 객체에 대응하는 아이콘(예: 제 1 아이콘) 및 제 1 객체의 실행을 위한 어플리케이션에 대응하는 아이콘(예: 제 1 어플리 케이션 아이콘)을 포함하는 리스트를 표시할 수 있다.일 실시예에 따라서, 도 35c를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 현재 작동 중인 운영체 제(operating system)에 대한 표시(예: 3571a 또는 3571b), 제 1 객체에 대응하는 아이콘(예: 제 1 아이콘 ) 및 제 1 객체의 실행을 위하여 현재 작동 중인 운영체제에서 지원되는 어플리케이션에 대응하는 아이콘 (예: 제 1 어플리케이션 아이콘(3591a) 또는 제 2 어플리케이션 아이콘(3591b))을 포함하는 리스트(예: 리스트 (880a) 또는 리스트(880b))를 표시할 수 있다. 일 실시예에 따라서, 도 35d를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 현재 사용 중인 사용자 계정(user account)에 대한 표시(예: 3571c 또는 3571d), 제 1 객체에 대응하는 아이콘(예: 제 1 아이콘 ) 및 제 1 객체의 실행을 위하여 현재 사용 중인 사용자 계정과 연동하여 설정된 어플리케이션에 대응하 는 아이콘(예: 제 1 어플리케이션 아이콘(3591c) 또는 제 2 어플리케이션 아이콘(3591d))을 포함하는 리스트(예: 리스트(880c) 또는 리스트(880d))를 표시할 수 있다. 일 실시예에 따라서, 도 35d를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 현재 작동 중인 운영체 제(operating system)에 대한 표시(예: 3571a 또는 3571b), 제 1 객체에 대응하는 아이콘(예: 제 1 아이콘 ) 및 제 1 객체의 실행을 위하여 현재 작동 중인 운영체제에서 지원되는 어플리케이션에 대응하는 아이콘 (예: 제 1 어플리케이션 아이콘(3591a) 또는 제 2 어플리케이션 아이콘(3591b))을 포함하는 리스트(예: 리스트 (880a) 또는 리스트(880b))를 표시하되, 현재 작동 중인 운영체제에서 특정 객체의 실행을 위한 특정 어플리케 이션을 지원하지 않는 경우, 특정 객체에 대응하는 아이콘(예: 제 2 아이콘 또는 제 3 아이콘)은 지원하는 어플리케이션이 없음을 나타내는 표시(예: 음영 표시)와 함께 표시할 수 있다. 일 실시예에 따라서, 도 35d를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 1 객체에 대응하는 아이콘(예: 제 1 아이콘) 및 제 1 객체의 실행을 위한 어플리케이션에 대응하는 아이콘(예: 제 1 어플리 케이션 아이콘)을 포함하는 리스트를 표시하되, 제 2 객체(미도시) 및 제 3 객체(미도시)가 같은 종 류의 특정 어플리케이션에 의해 실행되도록 설정된 경우, 제 2 객체(미도시)에 대응하는 제 2 아이콘과 제 3 객체(미도시)에 대응하는 제 3 아이콘을 리스트에 병렬적으로 표시하고, 제 2 객체(미도시) 및 제 3 객체(미도시)의 실행을 위한 특정 어플리케이션에 대응하는 아이콘(예: 제 2 어플리케이션 아이콘) 을 리스트에 표시할 수 있다. 도 36은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도36의 실시예는 도 37 를 참조하여 설명하도록 한다. 도 37은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 도 36 및 도 37을 참조하면, 3601 동작에서, 전자 장치(예: 도 1의 프로세서)는, 호출 명령에 기반하여 적어도 하나의 아이콘(예: 제 1 아이콘)을 포함하는 리스트(예: 리스트)를 표시할 수 있다. 예를 들어, 3601 동작은, 도 33의 3301 동작과 유사하게 설명될 수 있다. 또한, 전자 장치는, 적어도 하나의 아이콘(예: 제 1 아이콘)이 나타내는 객체(예: 제 1 객체(377 1))의 실행을 위한 특정 어플리케이션에 대응하는 아이콘(예: 제 1 아이콘)을 리스트(예: 리스트)에 포함하여 표시할 수 있다. 일 실시예에 따라서, 도 36 및 도 37을 참조하면, 3603 동작에서, 전자 장치는, 사용자 입력에 응답하여 리스트(예: 리스트)에 포함된 적어도 하나의 아이콘(예: 제 1 아이콘)을 식별 할 수 있다. 예를 들 어, 도 37의 실시예에서, 전자 장치는, 제 1 아이콘에 대한 사용자 입력, 예를 들어 터치 입력 에 응답하여, 리스트(예: 리스트)에 포함된 적어도 하나의 아이콘(예: 제 1 아이콘)을 식별 할 수 있다. 일 실시예에 따라서, 도 36 및 도 37을 참조하면, 3605 동작에서, 전자 장치는, 식별된 적어도 하나의 아 이콘(예: 제 1 아이콘)에 대응하는 객체(예: 제 1 객체)의 속성 타입 및 전자 장치의 힌지 구 조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태에 기반하여 미리 설정된 특정 어플리케 이션을 실행하고, 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는 특정 어플리케이션의 실행 화 면을 표시할 수 있다. 예를 들어, 도 37의 실시예에서, 전자 장치는, 식별된 아이콘, 예를 들어 제 1 아이 콘에 대응하는 객체, 예를 들어 제 1 객체의 속성 타입이 텍스트 타입이고, 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)의 상태가 제 1 힌지 구조(예: 도 3a의 제 1 힌지 구조) 및 제 2 힌지 구조(예: 도 3a의 제 2 힌지 구조)가 모두 펼쳐진 상태인 것에 기반하여, 미리 설정된 특정 어플리케이션, 예를 들어 텍스트 편집 어플리케이션을 실행하고, 제 1 객체을 포함하는 텍스트 편집 어플 리케이션의 실행 화면을 디스플레이 모듈에 표시할 수 있다. 한편, 도 37의 실시예에서 텍스트 편집 어플리케이션이 실행되는 것은 예시적인 것으로서, 객체의 속성 타입 및 전자 장치의 힌지 구조의상태(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)에 따라 객체의 실행을 위한 특정 어플리케이 션이 다르게 설정될 수 있다. 도 38은 다른 실시예에 따른 전자 장치의 폼팩터를 설명하기 위한 도면이다. 다른 실시예에 따라서, 도 38을 참조하면, 전자 장치는, 도 2의 전자 장치와 유사하게 동작하되, 다 른 형태의 폼팩터로 구성될 수 있다. 예를 들어, 전자 장치는, 폴더블 하우징 및 폴더블 하우징 에 의해 형성된 공간 내에 배치된 디스플레이 모듈을 포함할 수 있다. 디스플레이 모듈의 적어도 일부분은, 플렉서블(flexible) 또는 폴더블(foldable) 할 수 있다. 디스플레이 모듈이 배치된 면 (또는 디스플레이 모듈이 전자 장치의 외부에서 보여지는 면)을 전자 장치의 전면으로 정의 할 수 있다. 그리고, 상기 전면의 반대 면을 전자 장치의 후면으로 정의할 수 있다. 또한, 전면과 후면 사이의 공간을 둘러싸는 면을 전자 장치의 측면으로 정의할 수 있다. 일 실시예에 따라, 도 38을 참조하면, 폴더블 하우징은, 제 1 하우징 구조, 제 2 하우징 구조 및 제 1 하우징 구조와 제 2 하우징 구조 사이에 배치되는 힌지 구조를 포함할 수 있 으며, 도 38의 폴더블 하우징은, 도 2의 폴더블 하우징과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 38을 참조하면, 디스플레이 모듈은 적어도 일부 영역이 평면 또는 곡면으로 변형될 수 있는 디스플레이 모듈을 의미할 수 있다. 예를 들어, 디스플레이 모듈은 제 1 영역, 제 2 영역 및 제 1 영역과 제 2 영역와 사이에 배치되는 폴더블 영역을 포함할 수 있으며, 도 38의 디스플레이 모듈은 도 2의 디스플레이 모듈과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 38을 참조하면, 디스플레이 모듈의 폴더블 영역은 힌지 구조가 위치한 영역에 대응할 수 있다. 예를 들어, 폴더블 영역은 힌지 구조가 졉혀지는 것에 대응하여 졉혀질 수 있고 펼쳐지는 것에 대응하여 펼쳐질 수 있으며, 도 38의 폴더블 영역은 도 2의 제 1 폴더블 영역과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 38을 참조하면, 전자 장치의 힌지 구조가 접힌 상태에서, 제 1 하우징 구조 의 후면과 제 2 하우징 구조의 후면이 대면하며, 디스플레이 모듈의 제 1 영역 및 폴 더블 영역의 전부 또는 일부는 사용자가 바라보는 전자 장치의 전면에 노출될 수 있다. 또한, 전자 장치의 힌지 구조가 펼쳐진 상태에서 디스플레이 모듈의 제 1 영역, 제 2 영역 및 폴더블 영역은 동일한 평면을 구성할 수 있다. 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 힌지 구조가 접힌 상태에서, 디스플레이 모듈의 제 2 영역을 비활성화 할 수 있으며, 예를 들어, 전자 장치의 힌지 구조의 상태에 따라 활성화 또는 비활성화 되는 디스플레이 모듈의 특정 영역에 대한 설명은, 도 19의 디스플레이 모듈의 특정 영역의 활성화 또는 비활성화에 대한 설명과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 힌지 구조가 접힌 상태인 경우, 제 1 어플리케이션의 제 1 실행 화면을 디스플레이 모듈의 제 1 영역에 표시할 수 있으며, 예를 들어, 제 1 어플리케이션의 제 1 실행 화면을 디스플레이 모듈의 제 1 영역(380 1)에 표시하는 동작은, 도 4의 401 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 폴더블 영역이 접 힌 상태인 동안에, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 폴 더블 영역으로의 터치 드래그 입력(예: 3823)을 검출할 수 있으며, 예를 들어, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 폴더블 영역으로의 터치 드래그 입력(예: 3823)을 검출하는 동작은, 도 4의 403 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 힌지 구조의 상태 가 접힌 상태로부터 펼쳐진 상태로 변화(예: Unfolding)하는 것에 기반하여, 객체(예: 제 1 객체) 의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면 을 디스플레이 모듈에 표시할 수 있으며, 예를 들어, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 디스플레이 모듈에 표시하는 동작은, 도 4의 405 동작과 유사하게 설명될 수 있 다. 일 실시예에 따라, 도 38에 개시된 전자 장치는 도 2의 전자 장치와 유사하게 동작할 수 있다. 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 객체에 대응하는 아이콘을 포함하는 리스트를 제 1 폴더블 영역에 표시하는 동작을 수행 할 수 있으며, 예를 들 어 전자 장치의 상기 표시하는 동작은 도 7의 705 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 미리 설정된 시간 동안 힌지 구조의 상태가 접힌 상태를 유지하는 것에 기반하여 리스트를 디스플레이 하지 않 도록 제어하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 제어하는 동작은 도 9의 907 동작 과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 실행 화면(예: 제 2 실행 화면)을 표시한 후, 힌지 구조)의 상태가 펼쳐진 상태로부터 접힌 상태로 변화하는 것에 기반하여 제 1 어플리케이션의 제 1 실행 화면(예: 제 1 실행 화면)을 디스플레이 모듈 의 제 1 영역에 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 11의 1107 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 실행 화면(예: 제 2 실행 화면)을 표시한 후, 힌지 구조)의 상태가 펼쳐진 상태로부터 접힌 상태로 변화하는 것에 기반하여 제 1 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을 디스플레이 모듈 의 제 1 영역에 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 13의 1307 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 터치 드래그 입력의 방향 또는 종료 위치에 기반하여, 제 2 실행 화면(예: 제 2 실행 화면)을 제공하는 제 2 어플리케이션을 결정하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 결정하는 동작은 도 15의 1505 동작 또는 도 16의 1605 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 폴더블 영역(예: 폴더블 영역) 또는 엣지 영역으로의 터치 드래그 입력(예: 터치 드래그 입력)을 검출하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 검출하는 동작은 도 22의 실시예와 유사하게 설명 될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 객체의 개수에 기반하여 실행 화면의 레이아웃을 결정하는 동작을 수행할 수 있으며, 예를 들어 전자 장치 의 상기 결정하는 동작은 도 25의 2503 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 사용자 입력에 응답하여, 두 개 이상의 객체를 병합한 객체의 적어도 일부를 이용하여 획득되는 어플리케이션의 실행 화면을 표시하거나, 또는 두 개 이상의 객체 각각에 대응하는 복수 개의 서브 화면을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 27의 2703 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 객체의 속성 타입에 기반하여, 선택 가능한 어플리케이션 또는 식별된 객체의 실행을 위한 특정 어플리케이션의 다운로드 링크를 포함하는 제안 옵션을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 30의 3003 동작 또는 도 31의 3103 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 호출 명령에 기반하여 아이콘을 포함하는 리스트를 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 33의 3301 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 38을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 아이콘에 대응하는 객체의 속성 타입 및 힌지 구조의 상태에 기반하여 객체의 적어도 일부를 이용하여 획 득되는 어플리케이션의 실행 화면을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표 시하는 동작은 도 36의 3605 동작과 유사하게 설명될 수 있다. 도 39는 다른 실시예에 따른 전자 장치의 폼팩터를 설명하기 위한 도면이다. 다른 실시예에 따라서, 도 39를 참조하면, 전자 장치는, 도 2의 전자 장치와 유사하게 동작하되, 다 른 형태의 폼팩터로 구성될 수 있다. 예를 들어, 전자 장치는, 폴더블 하우징, 폴더블 하우징의 적어도 일부를 통하여 보여지는 제 1 디스플레이 모듈 및 폴더블 하우징에 의해 형성된 공간 내에 배치되는 제 2 디스플레이 모듈을 포함할 수 있다. 제 2 디스플레이 모듈의 적어도 일 부분은, 플렉서블(flexible) 또는 폴더블(foldable) 할 수 있다. 일 실시예에 따라, 도 39를 참조하면, 폴더블 하우징은, 제 1 방향으로 향하는 제 1 면, 제 1 방향과 반 대인 제 2 방향으로 향햐는 제 2 면을 포함하는 제 1 하우징 구조, 제 3 방향으로 향하는 제 3 면, 제 3 방향과 반대인 제 4 방향으로 향하는 제 4 면을 포함하는 제 2 하우징 구조 및 제 1 하우징 구조와 제 2 하우징 구조 사이에 배치되는 힌지 구조를 포함할 수 있다. 힌지 구조가 접힌 상태에서 제 1 하우징 구조의 제 2 면은 제 2 하우징 구조의 제 4면에 대면하고, 힌지 구조가 펼쳐진 상태에서 제 1 하우징 구조의 제 1 방향과 제 2 하우징 구조의 제 3 방향은 실질적으로 동일할 수 있다. 일 실시예에 따라, 도 39를 참조하면, 제 1 디스플레이 모듈은 제 1 하우징 구조의 제 1 면의 적어 도 일부를 통하여 보여질 수 있다. 제 2 디스플레이 모듈은 적어도 일부 영역이 평면 또는 곡면으로 변형 될 수 있는 디스플레이 모듈을 의미할 수 있다. 예를 들어, 제 2 디스플레이 모듈은, 제 1 하우징 구조 의 제 2 면으로부터 힌지 구조를 가로질러 제 2 하우징 구조의 제 4 면으로 연장될 수 있고, 힌지 구조에 대응하는 플렉서블 영역을 포함할 수 있다. 제 2 디스플레이 모듈는 제 1 하우징 구조 의 제 2 면에 대응하는 제 1 영역 및 제 2 하우징 구조의 제 4 면에 대응하는 제 2 영역을 포함할 수 있다. 힌지 구조가 접힌 상태에서, 제 2 디스플레이 모듈의 제 1 영역과 제 2 영역은 대면하고, 힌지 구조가 펼쳐진 상태에서, 제 2 디스플레이 모듈의 제 1 영역, 제 2 영역 및 플렉서블 영역은 실질적으로 동일한 평면을 형성할 수 있다. 예를 들어, 힌지 구조가 접힌 상태에서 제 1 디스플레이 모듈 은 사용자가 바라보는 전자 장치의 전면에 노출될 수 있다. 또한, 힌지 구조가 펼쳐진 상태 에서 제 2 디스플레이 모듈은 사용자가 바라보는 전자 장치의 전면에 노출될 수 있다. 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 힌지 구조가 접힌 상태에서, 제 2 디스플레이 모듈을 비활성화 할 수 있고, 힌지 구조가 펼쳐진 상태에서, 제 1 디스 플레이 모듈을 비활성화 할 수 있으며, 예를 들어, 전자 장치의 힌지 구조의 상태에 따라 활 성화 또는 비활성화 되는 디스플레이 모듈(예: 제 1 디스플레이 모듈 또는 제 2 디스플레이 모듈) 에 대한 설명은, 도 19의 디스플레이 모듈의 특정 영역의 활성화 또는 비활성화에 대한 설명과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 39를 참조하면, 전자 장치는, 힌지 구조가 접힌 상태인 경우, 제 1 어플리케 이션의 제 1 실행 화면을 제 1 디스플레이 모듈에 표시할 수 있으며, 예를 들어, 제 1 어플리케이 션의 제 1 실행 화면을 제 1 디스플레이 모듈에 표시하는 동작은, 도 4의 401 동작과 유사하게 설 명될 수 있다. 일 실시예에 따라, 도 39를 참조하면, 전자 장치는, 힌지 구조가 접힌 상태인 동안에, 제 1 어플리 케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 제 1 디스플레이 모듈의 엣 지 영역으로의 터치 드래그 입력(예: 3923)을 검출할 수 있으며, 예를 들어, 제 1 어플리케이션의 제 1 실행 화 면에 포함되는 객체(예: 제 1 객체)로부터 제 1 디스플레이 모듈의 엣지 영역으로의 터치 드 래그 입력(예: 3923)을 검출하는 동작은, 도 4의 403 동작 및 도 22의 실시예와 유사하게 설명될 수 있다. 일 실시예에 따라, 도 39를 참조하면, 전자 장치는, 힌지 구조의 상태가 접힌 상태로부터 펼쳐진 상태로 변화(예: Unfolding)하는 것에 기반하여, 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되 는, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 제 2 디스플레이 모듈에 표시할 수 있으며, 예를 들어, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 제 2 디스플레이 모듈에 표시하는 동작은, 도 4의 405 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 39에 개시된 전자 장치는 도 2의 전자 장치와 유사하게 동작할 수 있다. 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 객체에 대응하는 아이콘을 포함하는 리스트를 제 1 디스플레이 모듈의 엣지 영역에 표시하는 동작을 수행 할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 7의 705 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 미리 설정된 시간 동안 힌지 구조의 상태가 접힌 상태를 유지하는 것에 기반하여 리스트를 디스플레이 하지 않도록 제어하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 제어하는 동작은 도 9의 907 동작 과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 실행 화면(예: 제 2 실행 화면)을 표시한 후, 힌지 구조)의 상태가 펼쳐진 상태로부터 접힌 상태로 변화하는 것에 기반하여 제 1 어플리케이션의 제 1 실행 화면(예: 제 1 실행 화면)을 제 1 디스플레이 모 듈(예: 제 1 디스플레이 모듈)에 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 11의 1107 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 실행 화면(예: 제 2 실행 화면)을 표시한 후, 힌지 구조)의 상태가 펼쳐진 상태로부터 접힌 상태로 변화하는 것에 기반하여 제 1 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을 제 1 디스플레이 모듈(예: 제 1 디스플레이 모듈)에 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상 기 표시하는 동작은 도 13의 1307 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 터치 드래그 입력의 방향 또는 종료 위치에 기반하여, 제 2 실행 화면(예: 제 2 실행 화면)을 제공하는 제 2 어플리케이션을 결정하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 결정하는 동작은 도 15의 1505 동작 또는 도 16의 1605 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 엣지 영역으로의 터치 드래그 입력(예: 터치 드래그 입력)을 검출하는 동작을 수행할 수 있으며, 예를 들어 전 자 장치의 상기 검출하는 동작은 도 22의 실시예와 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 객체의 개수에 기반하여 실행 화면의 레이아웃을 결정하는 동작을 수행할 수 있으며, 예를 들어 전자 장치 의 상기 결정하는 동작은 도 25의 2503 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 사용자 입력에 응답하여, 두 개 이상의 객체를 병합한 객체의 적어도 일부를 이용하여 획득되는 어플리케이션의 실행 화면을 표시하거나, 또는 두 개 이상의 객체 각각에 대응하는 복수 개의 서브 화면을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 27의 2703 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 객체의 속성 타입에 기반하여, 선택 가능한 어플리케이션 또는 식별된 객체의 실행을 위한 특정 어플리케이션의 다운로드 링크를 포함하는 제안 옵션을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 30의 3003 동작 또는 도 31의 3103 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 호출 명령에 기반하여 아이콘을 포함하는 리스트를 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 33의 3301 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 39를 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 아이콘에 대응하는 객체의 속성 타입 및 힌지 구조의 상태에 기반하여 객체의 적어도 일부를 이용하여 획 득되는 어플리케이션의 실행 화면을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표 시하는 동작은 도 36의 3605 동작과 유사하게 설명될 수 있다. 도 40은 다른 실시예에 따른 전자 장치의 폼팩터를 설명하기 위한 도면이다. 다른 실시예에 따라서, 도 40을 참조하면, 전자 장치는, 도 2의 전자 장치와 유사하게 동작하되, 다 른 형태의 폼팩터로 구성될 수 있다. 예를 들어, 전자 장치는, 슬라이더블 하우징 및 슬라이더블 하우징에 의해 형성된 공간에 배치된 디스플레이 모듈을 포함할 수 있다. 디스플레이 모듈의 적어도 일부분은, 플렉서블(flexible) 또는 롤러블(rollable) 할 수 있다. 디스플레이 모듈이 배치된 면 (또는 디스플레이 모듈이 전자 장치의 외부에서 보여지는 면)을 전자 장치의 전면으로 정의 할 수 있다. 그리고, 상기 전면의 반대 면을 전자 장치의 후면으로 정의할 수 있다. 또한, 전면과 후면사이의 공간을 둘러싸는 면을 전자 장치의 측면으로 정의할 수 있다. 일 실시예에 따라, 도 40을 참조하면, 슬라이더블 하우징은, 제 1 하우징 구조 및 제 2 하우징 구 조를 포함할 수 있으며, 제 2 하우징 구조는 제 1 하우징 구조에 내장되거나 제 1 하우징 구 조로부터 인출될 수 있다. 일 실시예에 따라, 도 40을 참조하면, 디스플레이 모듈은 적어도 일부 영역이 평면 또는 곡면으로 변형될 수 있는 디스플레이 모듈을 의미할 수 있다. 예를 들어, 디스플레이 모듈은 제 1 영역, 제 2 영역 및 제 1 영역과 제 2 영역와 사이에 배치되는 제 3 영역을 포함할 수 있다. 예를 들어, 제 2 하우징 구조가 제 1 하우징 구조에 내장된 상태인 경우, 디스플레이 모듈의 제 1 영역 및 제 3 영역은 사용자가 바라보는 전자 장치의 전면에 노출될 수 있고, 디스플레이 모 듈의 제 2 영역은 제 1 하우징 구조에 내장될 수 있다. 예를 들어, 제 2 하우징 구조(402 0)가 제 1 하우징 구조에 내장된 상태인 경우, 제 1 하우징 구조의 형태에 따라, 디스플레이 모듈 의 제 3 영역은, 적어도 일부 영역이 곡면으로 변형된 상태일 수도 있고, 디스플레이 모듈의(406 0)의 제 1 영역과 실질적으로 동일한 평면을 형성할 수도 있다. 또한, 예를 들어, 제 2 하우징 구조 가 제 1 하우징 구조로부터 인출된 상태인 경우, 디스플레이 모듈의 제 1 영역, 제 2 영역 및 제 3 영역은 사용자가 바라보는 전자 장치의 전면에 노출되어 실질적으로 동일한 평 면을 형성할 수 있다. 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 하우징 구조 가 제 1 하우징 구조에 내장된 상태에서, 디스플레이 모듈의 제 2 영역을 비활성화 할 수 있 으며, 예를 들어, 제 2 하우징 구조가 제 1 하우징 구조에 내장된 상태 또는 제 2 하우징 구조 가 제 1 하우징 구조로부터 인출된 상태에 따라 활성화 또는 비활성화 되는 디스플레이 모듈(406 0)의 특정 영역에 대한 설명은, 도 19의 디스플레이 모듈의 특정 영역의 활성화 또는 비활성화에 대한 설 명과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 하우징 구조 가 제 1 하우징 구조에 내장된 상태 인 경우, 제 1 어플리케이션의 제 1 실행 화면을 디스플레이 모듈의 제 1 영역에 표시할 수 있으며, 예를 들어, 제 1 어플리케이션의 제 1 실행 화면을 디스플레이 모듈의 제 1 영역에 표시하는 동작은, 도 4의 401 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 하우징 구조 가 제 1 하우징 구조에 내장된 상태 인 동안에, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 디스플레이 모듈의 제 3 영역으로의 터치 드래그 입력(예: 4023a)을 검출할 수 있으며, 예를 들어, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체(예: 제 1 객체)로부터 디스플레이 모듈의 제 3 영역으로의 터치 드래그 입력(예: 4023a)을 검출하는 동작은, 도 4의 403 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 하우징 구조 가 제 1 하우징 구조에 내장된 상태 로부터 제 2 하우징 구조가 제 1 하우징 구조로부터 인 출된 상태로 변화(예: Slding)하는 것에 기반하여, 객체(예: 제 1 객체)의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 디스플레이 모듈에 표시할 수 있으며, 예를 들어, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 디스 플레이 모듈에 표시하는 동작은, 도 4의 405 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 40에 개시된 전자 장치는 도 2의 전자 장치와 유사하게 동작할 수 있다. 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 객체에 대응하는 아이콘을 포함하는 리스트를 디스플레이 모듈의 제 3 영역에 표시하는 동작을 수행 할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 7의 705 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 미리 설정된 시간 동안 제 2 하우징 구조가 제 1 하우징 구조에 내장된 상태를 유지하는 것에 기반하여 리스트를 디스플레이 하지 않도록 제어하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 제어 하는 동작은 도 9의 907 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 실행 화면(예: 제 2 실행 화면)을 표시한 후, 제 2 하우징 구조가 제 1 하우징 구조로부터 인출된 상태로부터 제 2 하우징 구조가 제 1 하우징 구조에 내장된 상태로 변화하는 것에 기반하여 제 1 어플리케이션의 제 1 실행 화면(예: 제 1 실행 화면)을 디스플레이 모듈의 제 1 영역에 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 11의 1107 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 실행 화면(예: 제 2 실행 화면)을 표시한 후, 제 2 하우징 구조가 제 1 하우징 구조로부터 인출된 상태로부터 제 2 하우징 구조가 제 1 하우징 구조에 내장된 상태로 변화하는 것에 기반하여 제 1 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을 디스플레이 모듈의 제 1 영역 에 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 13의 1307 동작 과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 터치 드래그 입력(4023a)의 방향 또는 종료 위치에 기반하여, 제 2 실행 화면(예: 제 2 실행 화면)을 제공하는 제 2 어플리케이션을 결정하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 결정하는 동작은 도 15의 1505 동작 또는 도 16의 1605 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 디스플 레이 모듈의 제 3 영역으로의 터치 드래그 입력(예: 터치 드래그 입력(4023a)) 또는 제 1 영역 의 엣지 영역으로의 터치 드래그 입력(예: 터치 드래그 입력(4023b))을 검출하는 동작을 수행할 수 있으 며, 예를 들어 전자 장치의 상기 검출하는 동작은 도 22의 실시예와 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 객체의 개수에 기반하여 실행 화면의 레이아웃을 결정하는 동작을 수행할 수 있으며, 예를 들어 전자 장치 의 상기 결정하는 동작은 도 25의 2503 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 사용자 입력에 응답하여, 두 개 이상의 객체를 병합한 객체의 적어도 일부를 이용하여 획득되는 어플리케이션의 실행 화면을 표시하거나, 또는 두 개 이상의 객체 각각에 대응하는 복수 개의 서브 화면을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 27의 2703 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 객체의 속성 타입에 기반하여, 선택 가능한 어플리케이션 또는 식별된 객체의 실행을 위한 특정 어플리케이션의 다운로드 링크를 포함하는 제안 옵션을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 30의 3003 동작 또는 도 31의 3103 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 호출 명령에 기반하여 아이콘을 포함하는 리스트를 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 33의 3301 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 40을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 아이콘에 대응하는 객체의 속성 타입 및 힌지 구조의 상태에 기반하여 객체의 적어도 일부를 이용하여 획 득되는 어플리케이션의 실행 화면을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표 시하는 동작은 도 36의 3605 동작과 유사하게 설명될 수 있다. 도 41은 다른 실시예에 따른 전자 장치의 폼팩터를 설명하기 위한 도면이다. 다른 실시예에 따라서, 도 41을 참조하면, 전자 장치는, 도 2의 전자 장치와 유사하게 동작하되, 다 른 형태의 폼팩터로 구성될 수 있다. 예를 들어, 전자 장치는, 하우징 및 하우징으로부터 인 출 가능한 디스플레이 모듈을 포함할 수 있다. 디스플레이 모듈의 적어도 일부분은, 플렉서블 (flexible) 또는 롤러블(rollable) 할 수 있다. 일 실시예에 따라, 도 41을 참조하면, 하우징은, 제 1 하우징 구조 및 제 2 하우징 구조를 포함할 수 있다. 예를 들어, 제 1 하우징 구조는 디스플레이 모듈의 적어도 일부를 내장할 수 있다. 예를 들어, 제 2 하우징 구조는 디스플레이 모듈과 연결된 상태에서 이동할 수 있다. 일 실시예에 따라, 도 41을 참조하면, 디스플레이 모듈은 적어도 일부 영역이 평면 또는 곡면으로 변형될 수 있는 디스플레이 모듈을 의미할 수 있다. 예를 들어, 디스플레이 모듈은 제 1 영역, 제 2 영역 , 제 1 영역과 제 2 영역 사이에 배치되는 제 3 영역 및 제 2 하우징 구조와 연결되는 제 4 영역을 포함할 수 있다. 예를 들어, 제 2 하우징 구조와 제 1 하우징 구조 사 이의 거리에 비례하여, 디스플레이 모듈의 일부 영역은 제 1 하우징 구조에 내장될 수 있고, 다른 일부 영역은 제 1 하우징 구조로부터 인출될 수 있다. 예를 들어, 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리가 제 1 거리(w1)인 경우, 디스플레이 모듈의 제 1 영역, 제 3 영역 및 제 4 영역은 제 1 하우징 구조로부터 인출되어 실질적으로 동일한 평면을 형성할 수 있고, 디스 플레이 모듈의 제 2 영역는 제 1 하우징 구조에 내장되어 곡면으로 변형된 상태일 수 있다. 예를 들어, 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리가 제 2 거리(w2)인 경우, 디스플레 이 모듈의 제 1 영역, 제 2 영역, 제 3 영역 및 제 4 영역은 제 1 하우징 구조 로부터 인출되어 실질적으로 동일한 평면을 형성할 수 있다. 또한, 예를 들어, 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리가 제 1 거리(w1)인 경우, 디스플레이 모듈의 제 3 영역 및 제 4 영역은, 제 1 영역의 엣지 영역을 형성할 수 있다. 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 1 하우징 구조 과 제 2 하우징 구조 사이의 거리가 제 1 거리(w1)인 경우, 디스플레이 모듈의 제 2 영역을 비활성화 할 수 있으며, 예를 들어, 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리에 따라 활 성화 또는 비활성화 되는 디스플레이 모듈의 특정 영역에 대한 설명은, 도 19의 디스플레이 모듈의 특정 영역의 활성화 또는 비활성화에 대한 설명과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 1 하우징 구조 과 제 2 하우징 구조 사이의 거리가 제 1 거리(w1)인 경우, 제 1 어플리케이션의 제 1 실행 화면을 디스플레이 모듈의 제 1 영역에 표시할 수 있으며, 예를 들어, 제 1 어플리케이션의 제 1 실행 화 면을 디스플레이 모듈의 제 1 영역에 표시하는 동작은, 도 4의 401 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 1 하우징 구조 과 제 2 하우징 구조 사이의 거리가 제 1 거리(w1)인 동안에, 제 1 어플리케이션의 제 1 실행 화면(413 1)에 포함되는 객체(예: 제 1 객체)로부터 디스플레이 모듈의 제 3 영역으로의 터치 드래그 입력(예: 4123a)을 검출할 수 있으며, 예를 들어, 제 1 어플리케이션의 제 1 실행 화면에 포함되는 객체 (예: 제 1 객체)로부터 디스플레이 모듈의 제 3 영역으로의 터치 드래그 입력(예: 4123a)을 검출하는 동작은, 도 4의 403 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 1 하우징 구조 과 제 2 하우징 구조 사이의 거리가 제 1 거리(w1)인 상태로부터 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리가 제 2 거리(w2)인 상태로 변화(예: Rolling)하는 것에 기반하여, 객체(예: 제 1 객체 )의 적어도 일부를 이용하여 획득되는, 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면 을 디스플레이 모듈에 표시할 수 있으며, 예를 들어, 제 1 어플리케이션과 상이한 제 2 어플리케이 션의 제 2 실행 화면을 디스플레이 모듈에 표시하는 동작은, 도 4의 405 동작과 유사하게 설명될 수 있다. 일 실시예에 따라, 도 41에 개시된 전자 장치는 도 2의 전자 장치와 유사하게 동작할 수 있다. 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 객체에 대응하는 아이콘을 포함하는 리스트를 디스플레이 모듈의 제 3 영역에 표시하는 동작을 수행 할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 7의 705 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 미리 설정된 시간 동안 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리가 제 1 거리(w1)인 상태를 유 지하는 것에 기반하여 리스트를 디스플레이 하지 않도록 제어하는 동작을 수행할 수 있으며, 예를 들어 전자 장 치의 상기 제어하는 동작은 도 9의 907 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 실행 화면(예: 제 2 실행 화면)을 표시한 후, 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리가 제 2 거리(w2)인 상태로부터 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리가 제 1 거리(w1)인 상태로 변화하는 것에 기반하여 제 1 어플리케이션의 제 1 실행 화면(예: 제 1 실행 화면)을 디 스플레이 모듈의 제 1 영역에 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상 기 표시하는 동작은 도 11의 1107 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 제 2 실행 화면(예: 제 2 실행 화면)을 표시한 후, 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리가 제 2 거리(w2)인 상태로부터 제 1 하우징 구조과 제 2 하우징 구조 사이의 거리가 제 1 거 리(w1)인 상태로 변화하는 것에 기반하여 제 1 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을 디스플레이 모듈의 제 1 영역에 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 13의 1307 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 터치 드래그 입력(4123a)의 방향 또는 종료 위치에 기반하여, 제 2 실행 화면(예: 제 2 실행 화면)을 제공하는 제 2 어플리케이션을 결정하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 결정하는 동작은 도 15의 1505 동작 또는 도 16의 1605 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 디스플 레이 모듈의 제 3 영역으로의 터치 드래그 입력(예: 터치 드래그 입력(4123a)) 또는 제 1 영역 의 엣지 영역으로의 터치 드래그 입력(예: 터치 드래그 입력(4123b))을 검출하는 동작을 수행할 수 있으 며, 예를 들어 전자 장치의 상기 검출하는 동작은 도 22의 실시예와 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 객체의 개수에 기반하여 실행 화면의 레이아웃을 결정하는 동작을 수행할 수 있으며, 예를 들어 전자 장치 의 상기 결정하는 동작은 도 25의 2503 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 사용자 입력에 응답하여, 두 개 이상의 객체를 병합한 객체의 적어도 일부를 이용하여 획득되는 어플리케이션의 실행 화면을 표시하거나, 또는 두 개 이상의 객체 각각에 대응하는 복수 개의 서브 화면을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 27의 2703 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 객체의 속성 타입에 기반하여, 선택 가능한 어플리케이션 또는 식별된 객체의 실행을 위한 특정 어플리케이션의 다운로드 링크를 포함하는 제안 옵션을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 30의 3003 동작 또는 도 31의 3103 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 호출 명령에 기반하여 아이콘을 포함하는 리스트를 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표시하는 동작은 도 33의 3301 동작과 유사하게 설명될 수 있다. 또한, 예를 들어, 일 실시예에 따라, 도 41을 참조하면, 전자 장치(예: 도 1의 프로세서)는, 식별된 아이콘에 대응하는 객체의 속성 타입 및 힌지 구조의 상태에 기반하여 객체의 적어도 일부를 이용하여 획 득되는 어플리케이션의 실행 화면을 표시하는 동작을 수행할 수 있으며, 예를 들어 전자 장치의 상기 표 시하는 동작은 도 36의 3605 동작과 유사하게 설명될 수 있다. 다양한 실시예에 따라서, 전자 장치(예: 전자 장치)는, 적어도 하나의 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)를 포함하는 폴더블 하우징(예: 폴더블 하우징), 상기 폴더블 하우징 을 통해 적어도 일부의 영역이 노출되는 플렉서블한 디스플레이 모듈(예: 디스플레이 모듈), 및 상기 폴더 블 하우징의 내부에 구비되는 적어도 하나의 프로세서(예: 프로세서)를 포함할 수 있다. 상기 디스플레이 모듈은 복수 개의 영역(예: 제 1 영역, 제 2 영역 또는 제 3 영역)과, 상기 적어도 하나의 힌지 구조에 대응하여 상기 복수 개의 영역 사이에 배치되어 상기 적어도 하나의 힌지 구조의 상태에 따라 접혀질 수 있는 적어도 하나의 폴더블 영역(예: 제 1 폴더블 영역 또는 제 2 폴더블 영역)을 포함할 수 있다. 상기 적어도 하나의 프로세서는,상기 적어도 하나의 힌지 구조의 상태가 제 1 상태인 경우, 상기 디스플레이 모 듈에 제 1 어플리케이션의 제 1 실행 화면을 표시하고, 상기 제 1 상태에서 상기 적어도 하나의 폴더블 영역 중 제 1 폴더블 영역(예: 제 1 폴더블 영역)은 접힌 상태(folded state)이고,상기 적어도 하나의 폴더블 영역 중 상기 제 1 폴더블 영역이 접힌 상태인 동안에, 상기 제 1 실행 화면에 포함되는 객체로부터 상기 제 1 폴더 블 영역으로의 터치 드래그 입력을 검출하고,상기 터치 드래그 입력을 검출한 후, 상기 적어도 하나의 힌지 구조의 상기 상태가 상기 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 상기 객체의 적어도 일부를 이용 하여 획득되는, 상기 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 상기 디스플레이 모듈 에 표시하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 제 1 실행 화면은, 상기 제 1 폴더블 영역에 인접하는 영역에 표시되며, 상기 제 2 실행 화면은, 상기 적어도 하나의 힌지 구조의 상태가 상기 제 2 상태인 동안에 접혀지지 않는 폴더블 영역의 양방향으로 인접하는 영역들 및 상기 접혀지지 않는 폴더블 영역 상에 표시되고, 상기 제 2 상태인 동안에 접혀 지지 않는 폴더블 영역은, 상기 제 1 폴더블 영역이거나, 또는 다른 폴더블 영역(예: 제 2 폴더블 영역)일 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 제 1 폴더블 영역의 접힌 상태가 검출됨과, 상 기 객체로부터 상기 제 1 폴더블 영역으로의 상기 터치 드래그 입력이 검출되는 것에 기반하여, 상기 객체에 대 응하는 아이콘을 포함하는 리스트를 상기 접힌 상태인 상기 제 1 폴더블 영역에 표시하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 터치 드래그 입력을 검출한 후 미리 설정된 시 간 동안 상기 힌지 구조의 상기 상태가 상기 제 1 상태를 유지하는 것에 기반하여, 상기 제 1 폴더블 영역에 표 시된 상기 리스트를 디스플레이 하지 않도록 제어할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는,상기 제 2 실행 화면을 표시한 후, 상기 적어도 하나 의 힌지 구조의 상기 상태가 상기 제 2 상태로부터 상기 제 1 상태로 변화하는 것에 기반하여, 상기 디스플레이 모듈에 상기 제 1 어플리케이션의 상기 제 1 실행 화면을 표시하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 제 2 실행 화면을 표시한 후, 상기 적어도 하나 의 힌지 구조의 상기 상태가 상기 제 2 상태로부터 상기 제 1 상태로 변화하는 것에 기반하여, 상기 객체의 적 어도 일부를 이용하여 획득되는, 상기 제 1 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을 상기 디스플레이 모듈에 표시하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 터치 드래그 입력의 속성에 기반하여, 상기 제 2 실행 화면을 제공하는 상기 제 2 어플리케이션을 결정하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 터치 드래그 입력의 종료 위치(end point)에 기 반하여, 상기 제 2 실행 화면을 제공하는 상기 제 2 어플리케이션을 결정하도록 설정될 수 있다. 다양한 실시예에 따라서, 전자 장치(예: 전자 장치)는, 적어도 하나의 힌지 구조(예: 도 3a의 제 1 힌지 구조 또는 제 2 힌지 구조)를 포함하는 폴더블 하우징(예: 폴더블 하우징), 상기 폴더블 하우징 을 통해 적어도 일부의 영역이 노출되는 플렉서블한 디스플레이 모듈(예: 디스플레이 모듈), 및 상기 폴더 블 하우징의 내부에 구비되는 적어도 하나의 프로세서(예: 프로세서)를 포함할 수 있다. 다양한 실시예에 따라서, 상기 디스플레이 모듈은 복수 개의 영역(예: 제 1 영역, 제 2 영역 또는 제 3 영역)과, 상기 적어도 하나의 힌지 구조에 대응하여 상기 복수 개의 영역 사이에 배치되어 상기 적어도 하나의 힌지 구조의 상태에 따라 접혀질 수 있는 적어도 하나의 폴더블 영역(예: 제 1 폴더블 영역 또는 제 2 폴더블 영역)을 포함할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 적어도 하나의 힌지 구조의 상태가 제 1 상태인 경우, 상기 디스플레이 모듈에 제 1 어플리케이션의 제 1 실행 화면을 표시하고, 상기 제 1 상태에서 상기 적어 도 하나의 폴더블 영역 중 제 1 폴더블 영역(예: 제 1 폴더블 영역)은 접힌 상태(folded state)이고, 제 1 사용자 입력에 응답하여 상기 제 1 실행 화면에 포함된 적어도 하나의 객체를 식별하고, 상기 적어도 하나의 힌 지 구조의 상태가 상기 제 1 상태로부터 제 2 상태로 변화하는 것에 기반하여, 상기 식별된 적어도 하나의 객체 의 적어도 일부를 이용하여 획득되는 제 2 어플리케이션의 제 2 실행 화면을, 상기 제 2 상태에 대응하여 설정 된 적어도 하나의 영역에 표시하고, 상기 적어도 하나의 힌지 구조의 상기 상태가 상기 제 1 상태로부터 제 3 상태로 변화하는 것에 기반하여, 상기 식별된 적어도 하나의 객체의 적어도 일부를 이용하여 획득되는 상기 제 2 어플리케이션과 상이한 제 3 어플리케이션의 제 3 실행 화면을, 상기 제 3 상태에 대응하여 설정된 적어도 하 나의 영역에 표시하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 제 1 사용자 입력은, 상기 적어도 하나의 객체로부터 상기 제 1 실행 화면이 표 시되는 제 1 영역에 인접하는 상기 제 1 폴더블 영역으로의 터치 드래그 입력, 또는 상기 적어도 하나의 객체로 부터 상기 제 1 영역의 엣지 영역으로의 터치 드래그 입력일 수 있다.다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 제 2 실행 화면을 표시한 후, 상기 적어도 하나 의 힌지 구조의 상기 상태가 상기 제 2 상태로부터 상기 제 3 상태로 변화하는 것에 기반하여, 상기 식별된 적 어도 하나의 객체의 적어도 일부를 이용하여 획득되는 상기 제 2 어플리케이션과 상이한 상기 제 3 어플리케이 션의 상기 제 3 실행 화면을, 상기 제 3 상태에 대응하여 설정된 상기 적어도 하나의 영역에 표시하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 제 1 어플리케이션의 상기 제 1 실행 화면 또는 상기 제 1 어플리케이션 이외의 다른 어플리케이션의 실행 화면으로부터 상기 적어도 하나의 객체 이외의 적어 도 하나의 추가 객체를 인식하고, 상기 제 2 실행 화면 또는 상기 제 3 실행 화면은, 상기 적어도 하나의 객체 및 상기 적어도 하나의 추가 객체의 적어도 일부를 이용하여 획득될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 식별된 적어도 하나의 객체의 개수에 기반하여, 상기 제 2 실행 화면 또는 상기 제 3 실행 화면의 레이아웃을 결정하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 식별된 적어도 하나의 객체가 두 개 이상의 객 체인 경우, 제 2 사용자 입력에 응답하여 상기 두 개 이상의 객체를 병합한 객체의 적어도 일부를 이용하여 획 득되는 어플리케이션의 실행 화면을 표시하거나, 또는 상기 두 개 이상의 객체 각각에 대응하는 복수 개의 서브 화면을 표시하도록 설정될 수 있고, 상기 복수 개의 서브 화면은, 하나의 어플리케이션에 의하여 생성되거나, 또는 상이한 어플리케이션들 각각에 의하여 생성될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 식별된 적어도 하나의 객체의 속성 타입에 기반 하여, 선택 가능한 어플리케이션을 포함하는 제안 옵션을 표시하고, 제 3 사용자 입력에 응답하여 상기 제안 옵 션에 포함된 상기 선택 가능한 어플리케이션 중에서 특정 어플리케이션을 식별하고, 상기 제안 옵션 중에서 상 기 특정 어플리케이션이 식별되는 것에 기반하여, 상기 식별된 적어도 하나의 객체의 적어도 일부를 이용하여 획득되는 상기 특정 어플리케이션의 실행 화면을 상기 제 2 실행 화면 또는 상기 제 3 실행 화면으로서 표시하 도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 식별된 적어도 하나의 객체의 실행을 위한 어플 리케이션이 상기 전자 장치에 의하여 실행될 수 없는 경우, 상기 식별된 적어도 하나의 객체의 속성 타입에 기 반하여, 상기 식별된 적어도 하나의 객체의 실행을 위한 적어도 하나의 어플리케이션의 다운로드 링크를 포함하 는 제안 옵션을 표시하고, 제 4 사용자 입력에 응답하여, 상기 제안 옵션에 포함된 상기 식별된 적어도 하나의 객체의 실행을 위한 적어도 하나의 어플리케이션 중에서 특정 어플리케이션을 다운로드하고, 상기 식별된 적어 도 하나의 객체의 적어도 일부를 이용하여 획득되는 상기 특정 어플리케이션의 실행화면을 상기 제 2 실행 화면 또는 상기 제 3 실행 화면으로서 표시하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 호출 명령에 기반하여 적어도 하나의 아이콘을 포함 하는 리스트를 표시하고, 상기 리스트에 포함된 제 1 아이콘에 대한 선택에 기반하여, 제 1 아이콘에 대응하는 특정 어플리케이션의 실행 화면을 표시하도록 더 설정될 수 있다. 다양한 실시예에 따라서, 상기 제 1 아이콘은 상기 제 1 아이콘에 대응하는 임시 저장된 객체와 상기 임시 저장 된 객체에 대응하여 설정된 특정 어플리케이션의 아이콘을 포함하여 구성될 수 있다. 다양한 실시예에 따라서, 전자 장치(예: 전자 장치)는, 하우징(예: 하우징), 상기 하우징으로부터 인출 가능하고 롤러블한 디스플레이 모듈(예: 디스플레이 모듈) 및 상기 하우징의 내부에 구비되는 적어 도 하나의 프로세서(예: 프로세서)를 포함할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 디스플레이 모듈의 제 1 영역(예: 제 1 영역 )이 상기 하우징으로부터 인출되어 외부로 노출된 상태에서 제 1 어플리케이션의 제 1 실행 화면을 상기 디스플레이 모듈에 표시하고, 상기 제 1 실행 화면에 포함된 객체로부터 상기 제 1 영역의 엣지 영역(예: 엣지 영역)으로의 터치 드래그 입력을 검출하고, 상기 터치 드래그 입력을 검출한 후, 상기 디스플레이 모듈 의 제 2 영역(예: 제 2 영역)이 상기 하우징으로부터 인출되어 외부로 노출됨에 기반하여, 상기 객체의 적어도 일부를 이용하여 획득되는 상기 제 1 어플리케이션과 상이한 제 2 어플리케이션의 제 2 실행 화면을 상 기 디스플레이 모듈에 표시하도록 설정될 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 프로세서는, 상기 터치 드래그 입력을 검출한 후, 미리 설정된 시 간 이내에 상기 디스플레이 모듈의 상기 제 2 영역이 상기 하우징으로부터 인출되어 외부로 노출됨에 기반하여,상기 객체의 적어도 일부를 이용하여 획득되는 상기 제 1 어플리케이션과 상이한 상기 제 2 어플리케이션의 상 기 제 2 실행 화면을 상기 디스플레이 모듈에 표시하도록 설정될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다."}
{"patent_id": "10-2020-0095574", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 일 실시예에 따른, 전자 장치의 펼쳐진 상태를 도시한 도면이다. 도 3a는 일 실시예에 따른, 전자 장치의 펼쳐진 상태를 설명하기 위한 예시 도면이다. 도 3b는 일 실시예에 따른, 전자 장치의 접힌 상태를 설명하기 위한 예시 도면이다. 도 3c는 일 실시예에 따른, 전자 장치의 접힌 상태를 설명하기 위한 예시 도면이다. 도 4는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 5는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 6은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 사시도이다. 도 7은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 8은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 9는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 10은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 11은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 12는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 13은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다 도 14는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 15는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 16은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 17a는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 17b는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 17c는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 17d는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 18은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 19는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 사시도이다. 도 20은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 21은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 22는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 23은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 24는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 25는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 26은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 27은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 28은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 29는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 30은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 31은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 32은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 33은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 34는 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 35a는 일 실시예에 따른 전자 장치에 의해 표시되는 리스트의 표시 형식을 도시한 도면이다. 도 35b는 일 실시예에 따른 전자 장치에 의해 표시되는 리스트의 표시 형식을 도시한 도면이다. 도 35c는 일 실시예에 따른 전자 장치에 의해 표시되는 리스트의 표시 형식을 도시한 도면이다. 도 35d는 일 실시예에 따른 전자 장치에 의해 표시되는 리스트의 표시 형식을 도시한 도면이다. 도 35e는 일 실시예에 따른 전자 장치에 의해 표시되는 리스트의 표시 형식을 도시한 도면이다. 도 35f는 일 실시예에 따른 전자 장치에 의해 표시되는 리스트의 표시 형식을 도시한 도면이다. 도 36은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 37은 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 38은 다른 실시예에 따른 전자 장치의 폼팩터를 설명하기 위한 도면이다. 도 39는 다른 실시예에 따른 전자 장치의 폼팩터를 설명하기 위한 도면이다. 도 40은 다른 실시예에 따른 전자 장치의 폼팩터를 설명하기 위한 도면이다. 도 41은 다른 실시예에 따른 전자 장치의 폼팩터를 설명하기 위한 도면이다."}
