{"patent_id": "10-2022-7004180", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0025148", "출원번호": "10-2022-7004180", "발명의 명칭": "웨이크업 지표 모니터링 방법, 장치 및 전자 기기", "출원인": "베이징 바이두 넷컴 사이언스 테크놀로지 컴퍼니", "발명자": "리, 쒸"}}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웨이크업 지표 모니터링 방법에 있어서, 상기 방법은, 모니터링할 기기의 M개의 오디오 데이터를 획득하는 단계 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하는 단계 - 상기 제1 웨이크업신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가 포함될 확률을나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하는 단계 -상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업단어가 포함됨을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 웨이크업율로 확정하는 단계 - 모니터링할 기기의 웨이크업 지표는, 상기 웨이크업율을 포함함 -; 를 포함하는 웨이크업 지표 모니터링 방법."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 모니터링할 기기의 M개의 오디오 데이터를 획득하기 전에, 상기 방법은, N개의 오디오 기기의 P개의 오디오 데이터 및 상기 P개의 오디오 데이터의 라벨링 결과를 획득하는 단계 - 상기라벨링 결과는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 제2 웨이크업 단어가 포함되는지 여부를나타내기 위한 것이며, N은 양의 정수이며, P는 1보다 큰 양의 정수임 -; 상기 P개의 오디오 데이터 중 각 오디오 데이터의 제2 웨이크업 신뢰도를 확정하는 단계; 및 상기 P개의 오디오 데이터 중에서 점유한 비례가 기설정 임계치보다 큰 제2 오디오 데이터의 제2 웨이크업 신뢰도가 위치한 구간을 통계하여, 상기 타겟 구간을 획득하는 단계 - 상기 제2 오디오 데이터는, 라벨링 결과가 상기 제2 웨이크업 단어를 포함함을 나타내는 오디오 데이터임 -; 를 더 포함하는 웨이크업 지표 모니터링 방법."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 N개의 오디오 기기의 오디오 로그 데이터에서 상기 P개의 오디오 데이터를 획득하며, 상기 오디오 로그 데이터는, 복수 개의 오디오 데이터를 포함하며, 상기 N개의 오디오 기기의 P개의 오디오 데이터를 획득하는 단계는, 상기 오디오 로그 데이터 중 각 오디오 데이터에 대해 각각 L개의 차원의 분류를 진행하여, 상기 오디오 로그데이터 중 각 오디오 데이터의 L개의 분류 특징 정보를 획득하는 단계 - L은 양의 정수임 -; 상기 오디오 로그 데이터의 분류 특징 정보를 토대로, 각 차원의 오디오 특징 정보를 확정하는 단계; 각 차원의 오디오 특징 정보를 토대로, 상기 오디오 로그 데이터 중에서 각각 샘플링을 진행하여, 상기 L개의차원의 오디오 샘플링 결과를 획득하는 단계; 및 상기 L개의 차원의 오디오 샘플링 결과를 포함하는 상기 P개의 오디오 데이터를 생성하는 단계; 공개특허 10-2022-0025148-3-를 포함하는 웨이크업 지표 모니터링 방법."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하는 단계는, 타겟 오디오 데이터에 대해 특징 추출을 진행하여, 상기 타겟 오디오 데이터의 오디오 특징을 획득하는 단계 -상기 타겟 오디오 데이터는 상기 M개의 오디오 데이터 중 어느 하나의 오디오 데이터임 -; 및상기 오디오 특징을 토대로, 상기 타겟 오디오 데이터에 대해 평점을 진행하여, 상기 타겟 오디오 데이터의 제1웨이크업 신뢰도를 획득하는 단계; 를 포함하는 웨이크업 지표 모니터링 방법."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "웨이크업 지표 모니터링 방법에 있어서, 상기 방법은, 모니터링할 기기의 M개의 오디오 데이터를 획득하는 단계 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하는 단계 - 상기 제1 웨이크업신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가 포함될 확률을나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하는 단계 -상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업단어가 포함되지 않음을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 잘못된 웨이크업율로 확정하는 단계 - 모니터링할 기기의 웨이크업 지표는, 상기 잘못된 웨이크업율을 포함함 -; 를 포함하는 웨이크업 지표 모니터링 방법."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "웨이크업 지표 모니터링 장치에 있어서, 상기 장치는, 모니터링할 기기의 M개의 오디오 데이터를 획득하기 위한 제1 획득 모듈 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하기 위한 제1 확정 모듈 - 상기제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가포함될 확률을 나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하기 위한제2 획득 모듈 - 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기위한 웨이크업 단어가 포함됨을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 웨이크업율로 확정하기 위한 제2 확정 모듈 - 상기 모니터링할 기기의 웨이크업 지표는, 상기 웨이크업율을 포함함 -; 을 포함하는 웨이크업 지표 모니터링 장치."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 장치는, N개의 오디오 기기의 P개의 오디오 데이터 및 상기 P개의 오디오 데이터의 라벨링 결과를 획득하기 위한 제3 획공개특허 10-2022-0025148-4-득 모듈 - 상기 라벨링 결과는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 제2 웨이크업 단어가 포함되는지 여부를 나타내기 위한 것이며, N은 양의 정수이며, P는 1보다 큰 양의 정수임 -; 상기 P개의 오디오 데이터 중 각 오디오 데이터의 제2 웨이크업 신뢰도를 확정하기 위한 제3 확정 모듈; 및 상기 P개의 오디오 데이터 중에서 점유한 비례가 기설정 임계치보다 큰 제2 오디오 데이터의 제2 웨이크업 신뢰도가 위치한 구간을 통계하여, 상기 타겟 구간을 획득하기 위한 통계 모듈 - 상기 제2 오디오 데이터는, 라벨링결과가 상기 제2 웨이크업 단어를 포함함을 나타내는 오디오 데이터임 -; 을 포함하는 웨이크업 지표 모니터링 장치."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서, 상기 N개의 오디오 기기의 오디오 로그 데이터에서 상기 P개의 오디오 데이터를 획득하며, 상기 오디오 로그 데이터는, 복수 개의 오디오 데이터를 포함하며, 상기 제3 획득 모듈은, 상기 오디오 로그 데이터 중 각 오디오 데이터에 대해 각각 L개의 차원의 분류를 진행하여, 상기 오디오 로그데이터 중 각 오디오 데이터의 L개의 분류 특징 정보를 획득하기 위한 분류 유닛 - L은 양의 정수임 -; 상기 오디오 로그 데이터의 분류 특징 정보를 토대로, 각 차원의 오디오 특징 정보를 확정하기 위한 제1 확정유닛; 각 차원의 오디오 특징 정보를 토대로, 상기 오디오 로그 데이터 중에서 각각 샘플링을 진행하여, 상기 L개의차원의 오디오 샘플링 결과를 획득하기 위한 제2 확정 유닛; 및 상기 L개의 차원의 오디오 샘플링 결과를 포함하는 상기 P개의 오디오 데이터를 생성하기 위한 생성 유닛; 을 포함하는 웨이크업 지표 모니터링 장치."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6 항에 있어서, 상기 제1 확정 모듈은, 구체적으로, 타겟 오디오 데이터에 대해 특징 추출을 진행하여, 상기 타겟 오디오 데이터의 오디오 특징을 획득하기 위한 것이며, 상기 타겟 오디오 데이터는 상기 M개의 오디오 데이터 중 어느 하나의 오디오 데이터이며; 상기 오디오 특징을 토대로, 상기 타겟 오디오 데이터에 대해 평점을 진행하여, 상기 타겟 오디오 데이터의 제1 웨이크업 신뢰도를 획득하기 위한 것인, 웨이크업 지표 모니터링 장치."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "웨이크업 지표 모니터링 장치에 있어서, 상기 장치는, 모니터링할 기기의 M개의 오디오 데이터를 획득하기 위한 제4 획득 모듈 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하기 위한 제4 확정 모듈 - 상기제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가포함될 확률을 나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하기 위한제5 획득 모듈 - 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기위한 웨이크업 단어가 포함되지 않음을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 잘못된 웨이크업율로 확정하기 위한 제5 확정 모듈 - 상기 모니터링할 기기의 웨이크업 지표는, 상기 잘못된 웨이크업율을 포함함 -; 을 포함하는 웨이크업 지표 모니터링 장치.공개특허 10-2022-0025148-5-청구항 11 전자 기기에 있어서, 상기 전자 기기는, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리; 를 포함하며, 그중, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행될 수 있는 명령이 저장되어 있고, 상기 명령은 상기적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서로 하여금 청구항 제1 항 내지 제4 항중 어느 한 항에 따른 방법을 수행하도록 하거나, 또는 청구항 제5 항에 따른 방법을 수행하도록 하는 것인, 전자 기기."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체에 있어서, 상기 컴퓨터 명령은 상기 컴퓨터로 하여금 제1 항 내지 제4 항 중 어느 한 항에 따른 방법을 수행하도록하거나, 또는 청구항 제5 항에 따른 방법을 수행하도록 하는 것인 비일시적 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2022-7004180", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "컴퓨터 프로그램 제품에 있어서, 상기 컴퓨터 프로그램 제품이 전자 기기에서 실행될 때, 상기 전자 기기는 청구항 제1 항 내지 제4 항 중 어느한 항에 따른 방법을 수행하거나, 또는 청구항 제5 항에 따른 방법을 수행하는 것인 컴퓨터 프로그램 제품."}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 웨이크업 지표 모니터링 방법, 장치 및 전자 기기를 제공한다. 구체적인 구현 방안은, 모니터링할 기 기의 M개의 오디오 데이터를 획득하고; M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정 하며, 제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단 어가 포함될 확률을 나타내기 위한 것이며; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위 치한 제1 오디오 데이터를 획득하며, 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업 단어가 포함됨을 나타내며; 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 모니터링할 기기의 웨이크업율로 확정하고, 상기 모니터링할 기기의 웨이크업 지표는, 상기 웨이 크업율을 포함한다."}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 2020년 12월 28일 중국에 제출한 중국 특허 출원 제 202011577341.7호의 우선권을 주장하며, 그 전체 내용을 본 출원에 원용한다."}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "본 개시는 인공지능 기술분야에 관한 것이며, 특히 오디오 테스트 기술분야에 관한 것으로, 구체적으로 웨이크 업 지표 모니터링 방법, 장치 및 전자 기기에 관한 것이다."}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지능(smart) 음성 인터렉션 기기에서 웨이크업 지표는 중요한 사용자 체험 적도 지표로서, 지능 음성 인터렉션 기기의 사용자 인터렉션율 및 유지율에 직접적으로 영향을 준다. 따라서, 웨이크업 지표는 사용자 체험의 하나 의 중요한 지표로서, 온라인 지능 음성 인터렉션 기기의 웨이크업 지표의 변화 상황을 알아야 한다. 인공 라벨링 방식을 통해, 지능 음성 인터렉션 기기의 웨이크업 지표를 모니터링하여, 지능 음성 인터렉션 기기 의 웨이크업 지표 변화를 모니터링할 수 있다."}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 웨이크업 지표 모니터링 방법, 장치 및 전자 기기를 제공한다. 제1 측면에 있어서, 본 개시는 웨이크업 지표 모니터링 방법을 제공하며, 상기 방법은, 모니터링할 기기의 M개의 오디오 데이터를 획득하는 단계 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하는 단계 - 상기 제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가 포함될 확률을 나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하는 단계 - 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업 단어가 포함됨을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 웨이크업 율로 확정하는 단계 - 상기 모니터링할 기기의 웨이크업 지표는, 상기 웨이크업율을 포함함 -; 를 포함한다. 제2 측면에 있어서, 본 개시는 웨이크업 지표 모니터링 방법을 제공하며, 상기 방법은, 모니터링할 기기의 M개의 오디오 데이터를 획득하는 단계 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하는 단계 - 상기 제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가 포함될 확률을 나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하는 단계 - 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업 단어가 포함되지 않음을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 잘못된 웨 이크업율로 확정하는 단계 - 상기 모니터링할 기기의 웨이크업 지표는, 상기 잘못된 웨이크업율을 포함함 -; 를 포함한다. 제3 측면에 있어서, 본 개시는 웨이크업 지표 모니터링 장치를 제공하며, 상기 장치는, 모니터링할 기기의 M개의 오디오 데이터를 획득하기 위한 제1 획득 모듈 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하기 위한 제1 확정 모듈 - 상기 제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가 포함될 확률을 나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하기 위한 제2 획득 모듈 - 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업 단어가 포함됨을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 웨이크업 율로 확정하기 위한 제2 확정 모듈 - 상기 모니터링할 기기의 웨이크업 지표는, 상기 웨이크업율을 포함함 -; 을 포함한다. 제4 측면에 있어서, 본 개시는 웨이크업 지표 모니터링 장치를 제공하며, 상기 장치는, 모니터링할 기기의 M개의 오디오 데이터를 획득하기 위한 제4 획득 모듈 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하기 위한 제4 확정 모듈 - 상기 제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가 포함될 확률을 나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하기 위한 제5 획득 모듈 - 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업 단어가 포함되지 않음을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 잘못된 웨 이크업율로 확정하기 위한 제5 확정 모듈 - 상기 모니터링할 기기의 웨이크업 지표는, 상기 잘못된 웨이크업율 을 포함함 -; 을 포함한다. 제5 측면에 있어서, 본 개시는 전자 기기를 제공하며, 상기 전자 기기는, 적어도 하나의 프로세서; 및 적어도 하나의 프로세서와 통신 연결되는 메모리; 를 포함하며, 그중, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행될 수 있는 명령이 저장되어 있고, 해당 명령은 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서로 하여금 본 개시의 제1 측면 중의 어 느 하나에 따른 방법을 수행하도록 하거나, 또는 제2 측면 중의 어느 하나에 따른 방법을 수행하도록 한다. 제6 측면에 있어서, 본 개시는 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체를 제공하며, 해당 컴퓨터 명령은 상기 컴퓨터로 하여금 제1 측면 중의 어느 하나에 따른 방법을 수행하도록 하거나, 또는 제 2 측면 중의 어느 하나에 따른 방법을 수행하도록 한다. 제7 측면에 있어서, 본 개시는 컴퓨터 프로그램 제품을 제공하며, 상기 컴퓨터 프로그램 제품이 전자 기기에서 실행될 때, 상기 전자 기기는 제1 측면 중의 어느 하나에 따른 방법을 수행하거나, 또는 제2 측면 중의 어느 하 나에 따른 방법을 수행한다. 이해해야 할 것은, 본 개시의 부분적으로 설명된 내용들은 본 개시의 실시예의 포인트를 표시하거나 또는 중요 한 특징을 표시하는 것이 아니며, 또한 본 개시의 청구 범위에 대해 제한하기 위한 것이 아님은 자명한 것이다. 본 개시의 기타 특징들은 아래와 같은 설명을 통해 쉽게 이해할 수 있을 것이다"}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 도면을 결부시켜, 본 출원의 예시적인 실시예에 대해 설명하기로 한다. 그 중에는 이해를 돕기"}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "위한 본 개시의 각종 디테일도 포함되어 있으며, 이러한 실시예들은 단지 예시적인 것이며, 해당 기술분야에서 통상의 지식을 가진 자들은 본 개시의 실시예에 대해 본 개시의 정신 및 특허청구범위를 일탈하지 않고 다양한"}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "개변 및 변형을 진행할 수 있다. 간단 명료하게 설명하기 위해, 아래에서는 해당 기술분야에 공지된 기능 및 구 조에 대해 진일보하여 기술하지 않기로 한다. 제1 실시예 도 1에 도시된 바와 같이, 본 개시는 웨이크업 지표 모니터링 방법을 제공하며, 상기 방법은 하기의 단계를 포 함한다. 단계 S101: 모니터링할 기기의 M개의 오디오 데이터를 획득하며, M은 1보다 큰 양의 정수이다."}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "해당 실시예에서, 웨이크업 지표 모니터링 방법은 인공 지능 기술분야에 관한 것으로, 특히 오디오 테스트 기술 분야에 관한 것이며, 각종 신형 지능 음성 인터렉션 기기의 단대단 검수 및 웨이크업 기능에 대한 온라인 모니 터링 등과 같은 다양한 시나리오에 광범위하게 응용될 수 있다. 실제로 사용할 경우, 본 개시의 실시예의 웨이크업 지표 모니터링 방법은, 본 개시의 실시예의 웨이크업 지표 모니터링 장치에 의해 실행될 수 있다. 본 개시의 실시예의 웨이크업 지표 모니터링 장치는 어느 전자 기기에 배치되어, 본 개시의 실시예의 웨이크업 지표 모니터링 방법을 실행할 수 있다. 전자 기기는 서버일 수 있고, 단말일 수도 있으며, 여기서 이에 대해 한정하지 않는다. 상기 모니터링할 기기는 지능 오디오 기기일 수 있고, 지능 음성 인터렉션 기기로 칭할 수 있으며, 예컨대, 상 기 모니터링할 기기는 지능 음향 기기 또는 지능 녹음 기기 등일 수 있다. 지능 음성 인터렉션 기기란, 음성을 통해 웨이크업될 수 있는 기기를 의미하며, 예컨대, 사용자가 지능 음성 인 터렉션 기기에 대해 \"쑈두쑈두\"라고 말하면, 지능 음성 인터렉션 기기는 해당 음성을 응답할 수 있으며, 작동 모드로 진입한다. 이 때, 지능 음성 인터렉션 기기가 웨이크업되면, 상응하게, \"쑈두쑈두\"는 지능 음성 인터렉 션 기기의 웨이크업 단어로 칭할 수 있다. 상기 모니터링할 기기의 M개의 오디오 데이터란, 상기 모니터링할 기기가 부팅된 후의 오디오 데이터를 의미하 며, 해당 오디오 데이터는, 수신한 사용자가 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어의 데이터, 및/또는, 상기 모니터링할 기기가 웨이크업된 후 산생한 데이터를 포함할 수 있다. 통상적으로, 모니터링할 기기는, 수면 모드 및 작동 모드 등과 같은 다양한 모드를 포함할 수 있으며, 모니터링 할 기기가 수면 모드에 처할 경우에, 사용자는 제1 웨이크업 단어를 포함한 음성 데이터를 통해, 모니터링할 기 기에 대해 웨이크업을 진행하며, 상응하게, 모니터링할 기기는 웨이크업되어, 수면 모드로부터 작동 모드로 스 위칭될 수 있으며, 이 때, 모니터링할 기기의 1회의 웨이크업으로 칭할 수 있다. 그러나, 다양한 요소에 의해, 모니터링할 기기는 수면 모드하에 잘못 웨이크업될 수 있으며, 예컨대, 모니터링 할 기기가 사용자의 기타 음성 데이터에 응답하여 웨이크업되며, 해당 기타 음성 데이터는, 사용자가 모니터링 할 기기를 웨이크업하는 제1 웨이크업 단어를 포함하지 않으며, 예를 더 들면, 모니터링할 기기가 그 어떤 징조 가 없는 상황하에, 즉 그 어떤 음성 데이터를 수신하지 않은 상황하에 웨이크업되며, 이러한 웨이크업들은 모두 모니터링할 기기의 잘못된 웨이크업으로 칭할 수 있다. 본 개시의 실시예의 목적은, 모니터링할 기기의 웨이크 업 지표를 모니터링하기 위한 것이며, 상기 웨이크업 지표는 웨이크업율일 수 있으며, 모니터링할 기기의 웨이 크업 성능을 모니터링하여, 기기 검수 또는 제품 개발을 진행한다. 모니터링할 기기가 매번 웨이크업되는 경우, 모니터링할 기기가 수면 모드로부터 작동 모드로 스위칭되는 과정 에서 수신하고 산생된 오디오 데이터를 저장하여, 오디오 로그 데이터를 생성할 수 있다. 상응하게, 오디오 로 그 데이터 중에서 모니터링할 기기의 M개의 오디오 데이터를 획득할 수 있다. 그중, 모니터링할 기기의 각 오디 오 데이터는, 모니터링할 기기의 1회의 웨이크업 과정에서 수신하고 산생된 데이터일 수 있다. 설명해야 할 것은, M은 1보다 큰 양의 정수이며, 통상적으로 모니터링할 기기의 웨이크업 지표의 모니터링 정확 도를 향상시키고, 모니터링 수량이 작아 초래되는 모니터링할 기기의 웨이크업 지표의 파동을 방지하기 위해, 통상적으로 M의 수량은 비교적 크며, 수천 또는 수만 개의 수량급일 수 있으며, 예컨대, M은 5천이거나 또는 1 만이다. 단계 S102: 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하며, 상기 제1 웨이 크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가 포함될 확 률을 나타낸다. 본 개시의 실시예에서, 상기 모니터링할 기기가 정상적으로 웨이크업되는 상황하에, 상기 모니터링할 기기의 오 디오 데이터 중에, 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가 포함되어 있으며, 잘못 웨 이크업되는 상황하에, 상기 모니터링할 기기의 오디오 데이터 중에, 통상적으로 상기 모니터링할 기기를 웨이크 업하기 위한 제1 웨이크업 단어가 포함되지 않는다. 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하는 것을 통해, 상기 모니터링할 기기의 각 오디오 데이터 중에 상기 제1 웨이크업 단어가 포함되는지 여부를 확정할 수 있다. 그중, 상기 제1 웨이크업 신뢰도는, 모니터링할 기기의 오디오 데이터 중에 상기 제1 웨이크업 단어가 포함될 확률을 나타낸다. 상기 제1 웨이크업 신뢰도의 통상적인 값은 0 내지 1일 수 있고, 상기 제1 웨이크업 신뢰도가 1인 경우에, 모니 터링할 기기의 오디오 데이터 중에 상기 제1 웨이크업 단어가 포함됨을 나타내며, 상기 제1 웨이크업 신뢰도가 0인 경우에, 모니터링할 기기의 오디오 데이터 중에 상기 제1 웨이크업 단어가 포함되지 않음을 나타내며, 상기 제1 웨이크업 신뢰도가 높을수록, 모니터링할 기기의 오디오 데이터 중에 상기 제1 웨이크업 단어가 포함될 확 률이 더 높다는 것을 설명하며, 그렇지 않으면, 더 낮다는 것을 설명한다. 타겟 모델을 통해, 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정할 수 있으며, 상기 타겟 모델을 웨이크업 신뢰도 모델로 칭할 수 있으며, 딥러닝 모델일 수 있으며, 상기 M개의 오디오 데이 터를 프로그램을 통해 웨이크업 신뢰도 모델로 주입시킬 수 있으며, 상기 웨이크업 신뢰도 모델은 각 오디오 데 이터에 대해, 각 오디오 데이터를 평점하여, 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신 뢰도를 획득할 수 있다. 설명해야 할 것은, 웨이크업 신뢰도 모델이 평점하기 전에, 미리 훈련을 진행하여야 하며, 복수 개의 지능 오디 오 기기의 복수 개의 오디오 데이터, 및 각 오디오 데이터의 태그를 웨이크업 신뢰도 모델로 하는 트레이닝 샘 플 데이터를 획득하여, 웨이크업 신뢰도 모델에 대해 훈련을 진행할 수 있다. 그중, 오디오 데이터의 태그는, 플러스 태그 및 마이너스 태그를 포함하며, 플러스 태그는 0으로 식별될 수 있으며, 오디오 데이터 중에 웨이크 업 단어가 포함되지 않음을 나타내며, 마이너스 태그는 1로 식별될 수 있으며, 오디오 데이터 중에 웨이크업 단 어가 포함됨을 나타낼 수 있다. 최종 훈련으로 획득한 웨이크업 신뢰도 모델은 지능 오디오 기기의 오디오 데이터에 대해 웨이크업 신뢰도 평점을 진행하여, 평점이 0 내지 1인 웨이크업 신뢰도를 획득할 수 있으며, 오디오 데이터 중에 웨이크업 단어가 포함될 확률을 나타낸다. 단계 S103: 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득 하며, 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이 크업 단어가 포함됨을 나타낸다. 상기 타겟 구간은 미리 확정될 수 있고, 웨이크업 임계치 범위일 수 있으며, 이러한 애플리케이션 시나리오하에, 상기 타겟 구간은, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업 단어가 포함 됨을 나타낸다. 그중, 오디오 기기는 지능 오디오 기기일 수 있다. 즉, 만약 오디오 데이터의 웨이크업 신뢰도 가 상기 타겟 구간에 위치한다면, 오디오 데이터 중에 통상적으로 오디오 기기의 웨이크업 단어가 포함되어 있 다. 상기 타겟 구간이 웨이크업 임계치 범위인 애플리케이션 시나리오하에, 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 상기 타겟 구간과 매칭시키며, 만약 상기 M개의 오디오 데이터 중의 오디오 데 이터의 제1 웨이크업 신뢰도가 상기 타겟 구간에 위치한다면, 해당 오디오 데이터는 제1 오디오 데이터이며, 해 당 오디오 데이터 내에 제1 웨이크업 단어가 포함되어 있으며, 즉, 해당 오디오 데이터는 모니터링할 기기가 정 상적으로 웨이크업되는 상황하의 오디오 데이터이다. 만약 상기 M개의 오디오 데이터 중의 오디오 데이터의 제1 웨이크업 신뢰도가 상기 타겟 구간에 위치하지 않는다면, 해당 오디오 데이터는 제1 오디오 데이터가 아니며, 해당 오디오 데이터내에 제1 웨이크업 단어가 포함되지 않으며, 즉, 해당 오디오 데이터는 모니터링할 기기가 잘못 웨이크업되는 상황하의 오디오 데이터이다. 단계 S104: 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기 의 웨이크업율로 확정하며, 상기 모니터링할 기기의 웨이크업 지표는, 상기 웨이크업율을 포함한다. 해당 단계에서, 상기 타겟 구간이 웨이크업 임계치 범위인 경우에, 상기 획득된 제1 오디오 데이터를 토대로, 상기 모니터링할 기기의 웨이크업율을 확정할 수 있으며, 상기 웨이크업 지표는 웨이크업율일 수 있다. 구체적으로, 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를 확정할 수 있으며, 해 당 비례는 제1 오디오 데이터의 수량을 기반으로 M으로 나누어 획득될 수 있다. 상기 타겟 구간이 웨이크업 임계치 범위인 애플리케이션 사나리오하에, 제1 오디오 데이터는, 모니터링할 기기 가 진정으로 웨이크업되는 경우에 대응하는 오디오 데이터이기에, 해당 비례를 상기 모니터링할 기기의 웨이크 업율로 확정할 수 있다. 실제 애플리케이션에서, 해당 웨이크업율을 제품 검증의 평가 표준으로 할 수 있으며, 예컨대, 모니터링할 기기 의 웨이크업율이 높을수록, 해당 제품의 웨이크업 성능이 비교적 양호하다는 것을 설명하며, 모니터링할 기기의 웨이크업율이 낮을수록, 해당 제품은 웨이크업 성능 방면에 대한 개진이 필요하다는 것을 설명한다. 실제 애플리케이션에서, 해당 웨이크업율은 제품 버전의 웨이크업 기능에 대해 검증을 진행할 수 있으며, 예컨 대, 제품 개발시, 모니터링할 기기에 새로운 소프트웨어 버전이 임베딩되며, 해당 소프트웨어 버전이 웨이크업 성능 상에서 향상되었는지 여부를 검증하기 위해, 새로운 소프트웨어 버전이 임베딩되어 있는 모니터링할 기기 의 웨이크업율과 올드한 소프트웨어 버전이 임베딩되어 있는 모니터링할 기기의 웨이크업율을 비교할 수 있으며, 만약 웨이크업율이 향상되었다면, 새로운 소프트웨어 버전이 웨이크업 성능 상에서 향상되었음을 설명 하며, 그렇지 않으면, 개진이 필요하다는 것을 설명한다. 해당 실시예에서, 모니터링할 기기의 M개의 오디오 기기 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하 는 것을 통해, 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하며, 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업 단어가 포함됨을 나타내며, 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례 를, 상기 모니터링할 기기의 웨이크업율로 확정한다. 이로서, 자동화 및 적시율이 높게 모니터링할 기기의 온라 인 오디오 데이터에 대해 웨이크업율 모니터링을 진행할 수 있으며, 웨이크업율 모니터링의 정확도를 향상시킨 다. 또한, 온라인의 각 오디오 기기의 웨이크업율의 변화 상황을 대량적으로 신속하게 모니터링할 수 있다. 또한, 인공 라벨링 등과 같은 불확실한 요소를 고려할 필요가 없이, 웨이크업율 모니터링의 조작 가능성이 강하 며, 인적자원을 절약하고, 상이한 기기에 대해 웨이크업율 모니터링을 진행하는 것을 구현할 수 있으며, 멀티플 렉싱 가능성이 양호하고, 확장 가능성이 강하다. 그 외, 무감독 모니터링을 구현할 수 있고, 경보 임계치를 한정하여, 온라인 모니터링 경보를 구현할 수 있다. 선택적으로, 상기 단계 S101 전에, 상기 방법은, N개의 오디오 기기의 P개의 오디오 데이터 및 상기 P개의 오디오 데이터의 라벨링 결과를 획득하는 단계 - 상기 라벨링 결과는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 제2 웨이크업 단어가 포함되는지 여부를 나타내기 위한 것이며, N은 양의 정수이며, P는 1보다 큰 양의 정수임 -; 상기 P개의 오디오 데이터 중 각 오디오 데이터의 제2 웨이크업 신뢰도를 확정하는 단계; 및 상기 P개의 오디오 데이터 중에서 점유한 비례가 기설정 임계치보다 큰 제2 오디오 데이터의 제2 웨이크업 신뢰 도가 위치한 구간을 통계하여, 상기 타겟 구간을 획득하는 단계 - 상기 제2 오디오 데이터는, 라벨링 결과가 상 기 제2 웨이크업 단어를 포함함을 나타내는 오디오 데이터임 -; 를 포함한다. 해당 실시방식은, 모니터링할 기기의 웨이크업율을 모니터링하기 전에, 웨이크업율 모니터링 장치가 타겟 구간 을 확정하는 과정에 대해 설명하였다. 그중, 해당 타겟 구간이 확정된 후, 후속으로 통상적으로 여러 차례 사용 할 수 있다. 온라인의 각각의 오디오 기기의 오디오 데이터가 진정으로 웨이크업되는 경우의 웨이크업 신뢰도의 구간을 평가 하는 것을 통해, 상기 타겟 구간을 확정할 수 있으며, 상기 타겟 구간은 웨이크업 임계치 범위일 수 있다. 즉, 만약 복수 개의 오디오 기기의 다수의 오디오 데이터가 웨이크업 신뢰도의 어느 구간에서, 모두 오디오 기기를 웨이크업하기 위한 웨이크업 단어를 포함한다면, 해당 구간 내의 웨이크업 신뢰도에 대응하는 오디오 데이터는, 오디오 기기가 진정으로 웨이크업되는 경우에 산생된 데이터임을 설명한다. 구체적으로, 온라인의 N개의 오디오 기기의 P개의 오디오 데이터를 가져오며, N은 양의 정수이고, N의 값은 통 상적으로 1보다 크다. 즉, 온라인의 복수 개의 오디오 기기의 다수의 오디오 데이터를 가져올 수 있으며, 예컨 대, 온라인의 복수 개의 오디오 기기의 5만개의 오디오 데이터를 가져온다. 동시에, 상기 P개의 오디오 데이터의 라벨링 결과를 획득할 수 있으며, 해당 라벨링 결과는, 인공 라벨링 방식 또는 음성 식별 기술을 채용하는 것을 통해, 상기 P개의 오디오 데이터에 대해 라벨링을 진행하여 획득할 수 있 다. 그중, 라벨링 결과는 두가지를 포함할 수 있는데, 첫번째는 오디오 데이터 중에 웨이크업 단어가 포함되는 것일 수 있고, 두번째는 오디오 데이터 중에 웨이크업 단어가 포함되지 않는 것일 수 있다. 웨이크업 신뢰도 모델을 채용하여 상기 P개의 오디오 데이터 중 각 오디오 데이터에 대해 웨이크업 신뢰도 평점 을 진행하여, 상기 P개의 오디오 데이터 중 각 오디오 데이터의 제2 웨이크업 신뢰도를 획득할 수 있으며, 상기 제2 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 제2 웨이크업 단어가 포함될 확 률을 나타내기 위한 것일 수 있다. 라벨링 결과를 제2 웨이크업 신뢰도의 평점 구간에 따라, 통계할 수 있으며, 만약 제2 웨이크업 신뢰도가 위치 한 구간 중의 오디오 데이터의 라벨링 결과가, 진정으로 웨이크업되는 오디오 데이터의 점유 비례가 기설정 임 계치 예하면 99%보다 큰 것으로 표시된다면, 제2 웨이크업 신뢰도가 위치한 해당 구간이 타겟 구간임을 알 수 있으며, 예컨대, 해당 타겟 구간은 0.7을 초과한 것일 수 있으며, 즉, 0.7을 초과한 제2 웨이크업 신뢰도에 대 응하는 오디오 데이터는, 모두 오디오 기기가 진정으로 웨이크업되는 경우의 데이터임을 알 수 있다. 해당 실시방식에서, 온라인의 각각의 오디오 기기의 다수의 오디오 데이터가 진정으로 웨이크업되는 경우의 제2 웨이크업 신뢰도가 위치한 구간을 통계하는 것을 통해, 웨이크업 임계치 범위의 타겟 구간임을 확정하며, 따라 서, 모니터링할 기기의 웨이크업율에 대해 자동화 및 무감독 모니터링을 진행하는 것을 구현할 수 있다. 선택적으로, 상기 N개의 오디오 기기의 오디오 로그 데이터에서 상기 P개의 오디오 데이터를 획득하며, 상기 오 디오 로그 데이터는, 복수 개의 오디오 데이터를 포함하며, 상기 N개의 오디오 기기의 P개의 오디오 데이터를 획득하는 단계는, 상기 오디오 로그 데이터 중 각 오디오 데이터에 대해 각각 L개의 차원의 분류를 진행하여, 상기 오디오 로그 데이터 중 각 오디오 데이터의 L개의 분류 특징 정보를 획득하는 단계 - L은 양의 정수임 -; 상기 오디오 로그 데이터의 분류 특징 정보를 토대로, 각 차원의 오디오 특징 정보를 확정하는 단계; 각 차원의 오디오 특징 정보를 토대로, 상기 오디오 로그 데이터 중에서 각각 샘플링을 진행하여, 상기 L개의 차원의 오디오 샘플링 결과를 획득하는 단계; 및 상기 L개의 차원의 오디오 샘플링 결과를 포함하는 상기 P개의 오디오 데이터를 생성하는 단계; 를 포함한다. 해당 실시방식에서, 오디오 기기의 오디오 데이터는, 사용자의 사용 시간과 밀접하게 관련되기에, 시간 차원 상 에서 오디오 데이터에 대해 분류를 진행할 수 있다. 그 외, 남북방에서 오디오 기기에 대한 사용 습관이 상이하고, 상이한 지역의 오디오 데이터도 비교적 큰 차이 가 있기에, 지역 차원 상에서 오디오 데이터에 대해 분류를 진행할 수도 있다. 그 외, 온라인의 오디오 기기의 버전 및 종류가 다양할 수 있고, 오디오 데이터의 출처는 지능 음향 기기 또는 지능 녹음 기기 등과 같이 다양할 수 있기에, 오디오 데이터의 출처 차원 상에서 오디오 데이터에 대해 분류를 진행할 수도 있다. 최대한 더 많은 사용 시나리오를 커버하기 위해, L가 3인 것으로 예를 들면, 상기 L개의 차원은, 시간 차원, 지 역 차원 및 오디오 데이터의 출처 차원이다. 각 오디오 데이터에 대해, 상기 오디오 로그 데이터 중 각 오디오 데이터에 대해 각각 시간 차원, 지역 차원 및 오디오 데이터의 출처 차원 상의 분류를 진행할 수 있다. 예컨대, 하나의 오디오 데이터가, 사용자의 사용 시간과 밀접하게 관련되고, 오디오 데이터가 사용자의 아침의 오디오 데이터이면, 시간 차원 상에서 해당 오디오 데이터의 분류 특징 정보는, 아침의 오디오 데이터이다. 또 한, 해당 오디오 데이터가 북방 지역의 오디오 데이터이면, 지역 차원 상에서 해당 오디오 데이터의 분류 특징 정보는, 북방 지역의 오디오 데이터이다. 그 외, 해당 오디오 데이터가 지능 음향 기기에서 나온 것이면, 오디 오 데이터의 출처 차원 상에서 해당 오디오 데이터의 분류 특징 정보는, 지능 음향 기기에서 나온 오디오 데이 터이다. 상기 오디오 로그 데이터 중 오디오 데이터의 분류 특징 정보를 토대로, 각 차원의 오디오 특징 정보를 확정할 수 있다. 예컨대, 상기 오디오 로그 데이터 중 오디오 데이터가 시간 차원 상에서의 분류 특징 정보를 토대로, 시간 차원 상의 오디오 특징 정보는, 아침 및 밤의 오디오 데이터가 비교적 많고, 오전 및 오후의 오디오 데이 터가 비교적 적은 것임을 통계하여 획득할 수 있다. 상기 오디오 로그 데이터 중 오디오 데이터가 지역 차원 상에서의 분류 특징 정보를 토대로, 지역 차원 상의 동 서남북 지역의 오디오 데이터의 비례를 통계하여 획득할 수 있다. 상기 오디오 로그 데이터 중 오디오 데이터가 오디오 데이터의 출처 차원 상에서의 분류 특징 정보를 토대로, 각각의 출처하의 오디오 데이터 트래픽을 통계 하여 획득할 수 있다. 그 후, 각 차원의 오디오 특징 정보를 토대로, 상기 오디오 로그 데이터 중에서 각각 샘플링을 진행하여, 상기 L개의 차원의 오디오 샘플링 결과를 획득한다. 예컨대, 오디오 로그 데이터가 시간 차원 상에서의 오디오 특징 정보는, 아침 및 밤의 오디오 데이터가 비교적 많고, 오전 및 오후의 오디오 데이터가 비교적 적은 것이며, 샘플링할 경우, 아침의 오디오 데이터 및 밤의 오 디오 데이터 중에서 고주파 샘플링을 진행할 수 있고, 오전의 오디오 데이터 및 오후의 오디오 데이터 중에서 저주파 샘플링을 진행할 수 있다. 지역 차원 상에서, 동서남북 지역의 오디오 데이터 비례에 따라, 상이한 지역의 오디오 데이터를 선택하여, 선 택된 오디오 데이터가 더 많은 사용 시나리오를 명중하도록 보장할 수 있다. 예컨대, 동서남북 지역의 오디오 데이터의 비례는 각각 1：2：3：4이며, 만약 1만개의 오디오 데이터를 선택하여야 한다면, 동쪽 지역의 오디오 데이터 중에서 1천개의 오디오 데이터를 선택하고, 서쪽 지역의 오디오 데이터 중에서 2천개의 오디오 데이터를 선택하며, 남쪽 지역의 오디오 데이터 중에서 3천개의 오디오 데이터를 선택하며, 북쪽 지역의 오디오 데이터 중에서 4천개의 오디오 데이터를 선택할 수 있다. 오디오 데이터의 출처 차원 상에서, 동일한 비례에 따라 상이한 출처하의 오디오 데이터를 선택할 수 있으며, 만약 어느 출처하의 오디오 데이터 트래픽이 비교적 작다면, 샘플링의 비례를 높일 수 있으며, 어느 기기의 오 디오 데이터의 수량이 비교적 작아 진정으로 웨이크업되는 경우의 웨이크업 신뢰도가 위치한 타겟 구간을 효율 적으로 평가하지 못하는 것을 방지한다. 예컨대, 각각 0.01%의 비례에 따라, 각 출처하의 오디오 데이터 중에서 오디오 데이터를 샘플링할 수 있으며, 만약 지능 음향 기기의 오디오 데이터 트래픽이 비교적 작다면, 1%의 비 례에 따라, 지능 음향 기기의 오디오 데이터 중에서 오디오 데이터를 샘플링할 수 있다. 상기 L개의 차원의 오디오 샘플링 결과를 중합하여, 오디오 데이터 세트를 획득한다. 그중, 중합할 경우, 만약 L개의 차원의 오디오 샘플링 결과의 오디오 데이터에 중첩이 존재한다면, 중첩된 오디오 데이터를 제거하면 되고, 최종적으로 상기 N개의 오디오 기기의 P개의 오디오 데이터를 획득한다. 해당 실시방식에서, 오디오 로그 데이터 중 각 오디오 데이터에 대해 각각 L개의 차원의 분류를 진행하는 것을 통해, 상기 오디오 로그 데이터 중 각 오디오 데이터의 L개의 분류 특징 정보를 획득하며, 상기 오디오 로그 데 이터의 분류 특징 정보를 토대로, 각 차원의 오디오 특징 정보를 확정한다. 이로서, 상이한 차원의 오디오 특징 정보에 따라, 오디오 로그 데이터 중의 오디오 데이터를 세밀화하게 선택할 수 있으며, 따라서, 획득된 P개의 오디오 데이터가 더 많은 사용 시나리오를 명중하도록 할 수 있으며, 더 나아가 각각의 오디오 기기가 진정으로 웨이크업되는 경우의 대부분 오디오 데이터의 제2 웨이크업 신뢰도가 위치한 타겟 구간을 효율적으로 평가할 수 있으며, 타겟 구간의 표시 능력을 향상시킨다. 선택적으로, 상기 L개의 차원은, 오디오 데이터에 대응하는 기기 타입; 오디오 데이터에 대응하는 시간대; 및 오디오 데이터에 대응하는 지역; 중 적어도 하나를 포함한다. 해당 실시방식에서, 오디오 데이터에 대응하는 기기 타입은 오디오 데이터의 출처이며, 오디오 데이터의 출처 차원에 대응하며, 예컨대, 오디오 데이터에 대응하는 기기 타입이 지능 음향 기기이면, 해당 오디오 데이터의 출처는 해당 지능 음향 기기이다. 해당 실시방식에서, 오디오 데이터에 대응하는 기기 타입, 시간대 및 지역 이 몇몇 차원을 통해, 상기 오디오 로그 데이터 중 각 오디오 데이터에 대해 분류를 진행하며, 따라서 오디오 로그 데이터 중에서 오디오 기기의 더 많은 사용 시나리오의 오디오 데이터를 세밀화하게 선택할 수 있다. 선택적으로, 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하는 단계는, 타겟 오디오 데이터에 대해 특징 추출을 진행하여, 상기 타겟 오디오 데이터의 오디오 특징을 획득하는 단계 - 상기 타겟 오디오 데이터는 상기 M개의 오디오 데이터 중 어느 하나의 오디오 데이터임 -; 및 상기 오디오 특징을 토대로, 상기 타겟 오디오 데이터에 대해 평점을 진행하여, 상기 타겟 오디오 데이터의 제1 웨이크업 신뢰도를 획득하는 단계; 를 포함한다. 해당 실시방식에서, 상기 웨이크업 신뢰도 모델은, 웨이크업 오프라인 모델 및 신뢰도 모델을 포함할 수 있으며, 상기 웨이크업 오프라인 모델 및 신뢰도 모델은 직렬로 구현될 수 있으며, 상기 웨이크업 오프라인 모 델은, 타겟 오디오 데이터에 대해 특징 추출을 진행하기 위한 것이며, 상기 타겟 오디오 데이터의 오디오 특징 을 획득하기 위한 것이며, 신뢰도 모델은, 타겟 오디오 데이터의 오디오 특징을 토대로, 상기 타겟 오디오 데이 터에 대해 평점을 진행하여, 상기 타겟 오디오 데이터의 제1 웨이크업 신뢰도를 획득할 수 있다. 해당 실시방식에서, 타겟 오디오 데이터에 대해 특징 추출을 진행하는 것을 통해, 상기 타겟 오디오 데이터의 오디오 특징을 획득하며, 상기 오디오 특징을 토대로, 상기 타겟 오디오 데이터에 대해 평점을 진행하여, 상기 타겟 오디오 데이터의 제1 웨이크업 신뢰도를 획득함으로써, 오디오 데이터 중에 상기 모니터링할 기기를 웨이 크업하기 위한 제1 웨이크업 단어가 포함될 확률에 대해 평가를 진행하는 것을 구현할 수 있다. 제2 실시예 도 2에 도시된 바와 같이, 본 개시는 웨이크업 지표 모니터링 방법을 제공하며, 상기 방법은, 단계 S201: 모니터링할 기기의 M개의 오디오 데이터를 획득하는 단계 - M은 1보다 큰 양의 정수임 -; 단계 S202: 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하는 단계 - 상기 제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단어가 포함 될 확률을 나타내기 위한 것임 -; 단계 S203: 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득 하는 단계 - 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위 한 웨이크업 단어가 포함되지 않음을 나타냄 -; 및 단계 S204: 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기 의 잘못된 웨이크업율로 확정하는 단계 - 상기 모니터링할 기기의 웨이크업 지표는, 상기 잘못된 웨이크업율을포함함 -; 를 포함한다. 본 개시의 실시예의 목적은, 모니터링할 기기의 웨이크업 지표를 모니터링하기 위한 것이며, 상기 웨이크업 지 표는 잘못된 웨이크업율일 수 있으며, 모니터링할 기기의 웨이크업 성능을 모니터링하여, 기기 검수 또는 제품 개발을 진행한다. 해당 실시예와 제1 실시예 중의 단계의 구현 방식은 유사하며, 단지 타겟 구간의 임계치 범위가 상이하기에, 나 타내는 의미가 상이하며, 모니터링한 웨이크업 지표는 상기 모니터링할 기기의 잘못된 웨이크업율이다. 구체적으로, 상기 타겟 구간은 잘못된 웨이크업 임계치 범위일 수 있으며, 이러한 애플리케이션 시나리오하에, 상기 타겟 구간은, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업 단어가 포함되지 않음을 나 타낸다. 그중, 오디오 기기는 지능 오디오 기기일 수 있다. 즉, 만약 오디오 데이터의 웨이크업 신뢰도가 상기 타겟 구간에 위치한다면, 오디오 데이터 중에 통상적으로 오디오 기기의 웨이크업 단어가 포함되지 않는다. 상기 타겟 구간이 잘못된 웨이크업 임계치 범위인 애플리케이션 시나리오하에, 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 상기 타겟 구간과 매칭시키며, 만약 M개의 오디오 데이터 중의 오디오 데이터의 제1 웨이크업 신뢰도가 상기 타겟 구간에 위치한다면, 해당 오디오 데이터는 제1 오디오 데이터이며, 오디오 데이터 내에 제1 웨이크업 단어가 포함되지 않으며, 즉, 해당 오디오 데이터는 모니터링할 기기가 잘못 웨이크업되는 상황하의 오디오 데이터이다. 만약 상기 M개의 오디오 데이터 중의 오디오 데이터의 제1 웨이크업 신뢰도가 상기 타겟 구간에 위치하지 않는다면, 해당 오디오 데이터는 제1 오디오 데이터가 아니며, 해당 오디 오 데이터내에 제1 웨이크업 단어가 포함될 수 있으며, 즉, 해당 오디오 데이터는 모니터링할 기기가 정상적으 로 웨이크업되는 상황하의 오디오 데이터이다. 상기 타겟 구간이 잘못된 웨이크업 임계치 범위인 애플리케이션 시나리오하에, 제1 오디오 데이터는, 모니터링 할 기기가 잘못 웨이크업되는 경우에 대응하는 오디오 데이터이기에, 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 잘못된 웨이크업율로 확정할 수 있다. 실제 애플리케이션에서, 해당 잘못된 웨이크업율을 제품 검증의 평가 표준으로 할 수 있으며, 예컨대, 모니터링 할 기기의 잘못된 웨이크업율이 높을수록, 해당 제품의 웨이크업 성능이 비교적 차하고, 해당 제품은 웨이크업 성능 방면에 대한 개진이 필요하다는 것을 설명하며, 모니터링할 기기의 잘못된 웨이크업율이 낮을수록, 해당 제품의 웨이크업 성능이 비교적 양호하다는 것을 설명한다. 실제 애플리케이션에서, 해당 잘못된 웨이크업율은 제품 버전의 웨이크업 기능에 대해 검증을 진행할 수 있으며, 예컨대, 제품 개발시, 모니터링할 기기에 새로운 소프트웨어 버전이 임베딩되며, 해당 소프트웨어 버전 이 웨이크업 성능 상에서 향상되었는지 여부를 검증하기 위해, 새로운 소프트웨어 버전이 임베딩되어 있는 모니 터링할 기기의 잘못된 웨이크업율과 올드한 소프트웨어 버전이 임베딩되어 있는 모니터링할 기기의 잘못된 웨이 크업율을 비교할 수 있으며, 만약 잘못된 웨이크업율이 낮아진다면, 새로운 소프트웨어 버전이 웨이크업 성능 상에서 향상되었음을 설명하며, 그렇지 않으면, 개진이 필요하다는 것을 설명한다. 해당 실시예에서, 모니터링할 기기의 M개의 오디오 기기 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하 는 것을 통해, 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하며, 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 웨이크업 단어가 포함되지 않음 나타내며, 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 잘못된 웨이크업율로 확정한다. 이로서, 자동화 및 적시율이 높게 모니터링할 기기의 온라인 오디오 데이터에 대해 잘못된 웨이크업율 모니터링을 진행할 수 있으며, 잘못된 웨이크업율 모니 터링의 정확도를 향상시킨다. 또한, 온라인의 각 오디오 기기의 잘못된 웨이크업율의 변화 상황을 대량적으로 신속하게 모니터링할 수 있다. 선택적으로, 상기 단계 S201 전에, 상기 방법은, N개의 오디오 기기의 P개의 오디오 데이터 및 상기 P개의 오디오 데이터의 라벨링 결과를 획득하는 단계 - 상기 라벨링 결과는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 제2 웨이크업 단어가 포함되는지 여부를 나타내기 위한 것이며, N은 양의 정수이며, P는 1보다 큰 양의 정수임 -; 상기 P개의 오디오 데이터 중 각 오디오 데이터의 제2 웨이크업 신뢰도를 확정하는 단계; 및 상기 P개의 오디오 데이터 중에서 점유한 비례가 기설정 임계치보다 큰 제2 오디오 데이터의 제2 웨이크업 신뢰 도가 위치한 구간을 통계하여, 상기 타겟 구간을 획득하는 단계 - 상기 제2 오디오 데이터는, 라벨링 결과가 상기 제2 웨이크업 단어를 포함하지 않음을 나타내는 오디오 데이터임 -; 를 포함한다. 해당 실시방식에서, 온라인의 각각의 오디오 기기의 오디오 데이터가 잘못 웨이크업되는 경우의 웨이크업 신뢰 도의 구간을 평가하는 것을 통해, 상기 타겟 구간을 확정할 수 있으며, 상기 타겟 구간은 잘못된 웨이크업 임계 치 범위일 수 있다. 즉, 만약 복수 개의 오디오 기기의 다수의 오디오 데이터가 웨이크업 신뢰도의 어느 구간에 서, 모두 오디오 기기를 웨이크업하기 위한 웨이크업 단어를 포함하지 않는다면, 해당 구간 내의 웨이크업 신뢰 도에 대응하는 오디오 데이터는, 오디오 기기가 잘못 웨이크업되는 경우에 산생된 데이터임을 설명한다. 구체적으로, 상기 P개의 오디오 데이터 중 각 오디오 데이터의 제2 웨이크업 신뢰도를 확정한 후, 라벨링 결과 를 제2 웨이크업 신뢰도의 평점 구간에 따라, 통계할 수 있으며, 만약 제2 웨이크업 신뢰도가 위치한 구간 중의 오디오 데이터의 라벨링 결과가, 잘못 웨이크업되는 오디오 데이터의 점유 비례가 기설정 임계치 예하면 95%보 다 큰 것으로 표시된다면, 제2 웨이크업 신뢰도가 위치한 해당 구간이 타겟 구간임을 알 수 있으며, 예컨대, 해 당 타겟 구간은 0.6보다 낮은 것일 수 있으며, 즉, 0.6보다 낮은 제2 웨이크업 신뢰도에 대응하는 오디오 데이 터는, 모두 오디오 기기가 잘못 웨이크업되는 경우의 데이터임을 알 수 있다. 온라인의 각각의 오디오 기기의 다수의 오디오 데이터가 잘못 웨이크업되는 경우의 제2 웨이크업 신뢰도가 위치 한 구간을 통계하는 것을 통해, 잘못된 웨이크업 임계치 범위의 타겟 구간임을 확정할 수도 있으며, 따라서, 모 니터링할 기기의 잘못된 웨이크업율에 대해 자동화 및 무감독 모니터링을 진행하는 것을 구현할 수 있다. 제3 실시예 도 3에 도시된 바와 같이, 본 개시는 웨이크업 지표 모니터링 장치를 제공하며, 상기 장치는, 모니터링할 기기의 M개의 오디오 데이터를 획득하기 위한 제1 획득 모듈 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하기 위한 제1 확정 모듈 - 상기 제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단 어가 포함될 확률을 나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하기 위한 제2 획득 모듈 - 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크 업하기 위한 웨이크업 단어가 포함됨을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 웨이크업 율로 확정하기 위한 제2 확정 모듈 - 상기 모니터링할 기기의 웨이크업 지표는, 상기 웨이크업율을 포함함 -; 을 포함한다. 선택적으로, 상기 장치는, N개의 오디오 기기의 P개의 오디오 데이터 및 상기 P개의 오디오 데이터의 라벨링 결과를 획득하기 위한 제3 획 득 모듈 - 상기 라벨링 결과는, 오디오 데이터 중에 오디오 기기를 웨이크업하기 위한 제2 웨이크업 단어가 포 함되는지 여부를 나타내기 위한 것이며, N은 양의 정수이며, P는 1보다 큰 양의 정수임 -; 상기 P개의 오디오 데이터 중 각 오디오 데이터의 제2 웨이크업 신뢰도를 확정하기 위한 제3 확정 모듈; 및 상기 P개의 오디오 데이터 중에서 점유한 비례가 기설정 임계치보다 큰 제2 오디오 데이터의 제2 웨이크업 신뢰 도가 위치한 구간을 통계하여, 상기 타겟 구간을 획득하기 위한 통계 모듈 - 상기 제2 오디오 데이터는, 라벨링 결과가 상기 제2 웨이크업 단어를 포함함을 나타내는 오디오 데이터임 -; 을 포함한다. 선택적으로, 상기 N개의 오디오 기기의 오디오 로그 데이터에서 상기 P개의 오디오 데이터를 획득하며, 상기 오 디오 로그 데이터는, 복수 개의 오디오 데이터를 포함하며, 상기 제3 획득 모듈은, 상기 오디오 로그 데이터 중 각 오디오 데이터에 대해 각각 L개의 차원의 분류를 진행하여, 상기 오디오 로그 데이터 중 각 오디오 데이터의 L개의 분류 특징 정보를 획득하기 위한 분류 유닛 - L은 양의 정수임 -; 상기 오디오 로그 데이터의 분류 특징 정보를 토대로, 각 차원의 오디오 특징 정보를 확정하기 위한 제1 확정 유닛; 각 차원의 오디오 특징 정보를 토대로, 상기 오디오 로그 데이터 중에서 각각 샘플링을 진행하여, 상기 L개의 차원의 오디오 샘플링 결과를 획득하기 위한 제2 확정 유닛; 및 상기 L개의 차원의 오디오 샘플링 결과를 포함하는 상기 P개의 오디오 데이터를 생성하기 위한 생성 유닛; 을 포함한다. 선택적으로, 상기 제1 확정 모듈은, 구체적으로, 타겟 오디오 데이터에 대해 특징 추출을 진행하기 위한 것이며, 상기 타겟 오디오 데이터의 오디오 특징을 획득하기 위한 것이며, 상기 타겟 오디오 데이터는 상기 M개 의 오디오 데이터 중 어느 하나의 오디오 데이터이며; 상기 오디오 특징을 토대로, 상기 타겟 오디오 데이터에 대해 평점을 진행하기 위한 것이며, 상기 타겟 오디오 데이터의 제1 웨이크업 신뢰도를 획득하기 위한 것이다. 본 개시에서 제공한 웨이크업 지표 모니터링 장치는 상술한 웨이크업 지표 모니터링 방법의 제1 실시예에 서 구현한 각각의 과정을 구현할 수 있으며, 동일한 유익한 효과를 달성할 수 있는바, 중복되는 설명을 피하기 위해, 여기서 더 이상 상세하게 기술하지 않기로 한다. 제4 실시예 도 4에 도시된 바와 같이, 본 개시는 웨이크업 지표 모니터링 장치를 제공하며, 상기 장치는, 모니터링할 기기의 M개의 오디오 데이터를 획득하기 위한 제4 획득 모듈 - M은 1보다 큰 양의 정수임 -; 상기 M개의 오디오 데이터 중 각 오디오 데이터의 제1 웨이크업 신뢰도를 확정하기 위한 제4 확정 모듈 - 상기 제1 웨이크업 신뢰도는, 오디오 데이터 중에 상기 모니터링할 기기를 웨이크업하기 위한 제1 웨이크업 단 어가 포함될 확률을 나타내기 위한 것임 -; 상기 M개의 오디오 데이터 중 제1 웨이크업 신뢰도가 타겟 구간에 위치한 제1 오디오 데이터를 획득하기 위한 제5 획득 모듈 - 상기 타겟 구간에 위치한 웨이크업 신뢰도는, 오디오 데이터 중에 오디오 기기를 웨이크 업하기 위한 웨이크업 단어가 포함되지 않음을 나타냄 -; 및 상기 제1 오디오 데이터가 상기 M개의 오디오 데이터 중에서 점유한 비례를, 상기 모니터링할 기기의 잘못된 웨 이크업율로 확정하기 위한 제5 확정 모듈 - 상기 모니터링할 기기의 웨이크업 지표는, 상기 잘못된 웨이크 업율을 포함함 -; 을 포함한다. 본 개시에서 제공한 웨이크업 지표 모니터링 장치는 상술한 웨이크업 지표 모니터링 방법의 제2 실시예에 서 구현한 각각의 과정을 구현할 수 있으며, 동일한 유익한 효과를 달성할 수 있는바, 중복되는 설명을 피하기 위해, 여기서 더 이상 상세하게 기술하지 않기로 한다. 본 개시의 실시예에 있어서, 본 개시는 전자 기기, 판독 가능 저장 매체 및 컴퓨터 프로그램 제품을 더 제공한 다. 도 5는 본 개시의 실시예의 예를 구현하기 위한 전자 기기의 예시적인 블록도이다. 전자 기기는 예하면 랩 탑 컴퓨터, 데스크톱 컴퓨터, 워킹 테이블, 개인용 디지털 보조기, 서버, 블레이드 서버, 대형 컴퓨터, 및 기타 적합한 컴퓨터와 같이 다양한 형태의 디지털 컴퓨터를 나타낸다. 전자 기기는 또한 다양한 형태의 이동 장치를 나타낼 수 있으며, 예컨대, 개인용 디지털 프로세스, 셀룰러 휴대폰, 지능 휴대폰, 웨어러블 기기 및 기타 유사 한 컴퓨팅 장치이다. 본문에서 나타내는 컴포넌트, 그들의 연결 및 관계, 및 그들의 기능은 단지 예시적인 것이 지, 본 명세서에 설명된 및/또는 요구하는 본 개시의 구현을 제한하기 위함이 아님은 자명한 것이다. 도 5에 도시된 바와 같이, 상기 기기는, 연산 유닛을 포함하며, 상기 기기는, 판독 전용 메모리 (ROM, 502)에 저장된 컴퓨터 프로그램 또는 저장 유닛으로부터 랜덤 액세스 메모리(RAM, 503)로 로딩될 컴 퓨터 프로그램에 따라, 다양한 적절한 동작 및 처리를 수행할 수 있다. RAM중에, 기기의 조작에 필요 한 다양한 프로그램 및 데이터를 저장할 수 있다. 연산 유닛, ROM 및 RAM은 버스를 통해 서로 연결된다. 입력/출력(I/O) 인터페이스도 버스에 연결된다. 기기중의 복수 개의 컴포넌트들은 I/O 인터페이스에 연결되고, I/O 인터페이스는, 키보드, 마우 스 등과 같은 입력 유닛; 다양한 타입의 디스플레이, 스피커 등과 같은 출력 유닛; 자기 디스크, 광 디스크 등과 같은 저장 유닛; 및 네트워크 카드, 조정 복조기, 무선 통신 송수신기 등과 같은 통신 유닛 을 포함한다. 통신 유닛은 기기가 예하면 인터넷의 컴퓨터 네트워크 및/또는 다양한 전기 통신 네트워크를 통해 기타 기기와 정보/데이터를 교환하는 것을 허용하고 있다. 연산 유닛은 처리 및 컴퓨팅 능력이 있는 범용 및/또는 전용 처리 어셈블리이다. 연산 유닛의 일부 예는, 중앙 프로세스 유닛(CPU), 그래픽 프로세스 유닛(GPU), 각종 전용 인공지능(AI) 컴퓨팅 칩, 기계 학습 모 델링 알고리즘을 실행하는 연산 유닛, 디지털 신호 프로세서(DSP), 및 어느 적절한 프로세서, 제어기, 마이크로제어기 등을 포함하나 이에 한정되지 않는다. 연산 유닛은 웨이크업 지표 모니터링 방법과 같은 위에서 설 명된 각각의 방법 및 처리를 수행한다. 예하면, 일부 실시예에서, 웨이크업 지표 모니터링 방법은 컴퓨터 소프 트웨어 프로그램으로 구현될 수 있고, 컴퓨터 소프트웨어 프로그램은 저장 유닛과 같은 형태가 있는 기계 판독 가능 매체에 저장될 수 있다. 일부 실시예에서, 컴퓨터 프로그램의 부분 또는 전부는 ROM 및/또는 통 신 유닛을 경유하여 기기상에 로딩 및/또는 설치될 수 있다. 컴퓨터 프로그램은 RAM로 로딩되어 연산 유닛에 의해 실행될 때, 위에서 설명한 웨이크업 지표 모니터링 방법의 하나 또는 복수 개의 단계를 수행할 수 있다. 대안적으로, 기타 실시예에서, 연산 유닛은 기타 어느 적절한 방식(예하면, 펌웨어를 이 용하는 것)을 통해 웨이크업 지표 모니터링 방법을 수행하도록 배치될 수 있다. 본문에서 상술한 시스템 및 기술의 다양한 실시방식은 디지털 전기 회로 시스템, 집적 회로 시스템, 필드 프로 그램 가능한 게이트 어레이(FPGA), 전용 집적 회로(ASIC), 전용 표준 제품(ASSP), 시스템 온 칩(SOC), 부하 프 로그램 가능한 로직 기기(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합에서 구현될 수 있 다. 이러한 각종 실시방식은, 하나 또는 복수 개의 컴퓨터 프로그램에서 구현하는 방식을 포함할 수 있으며, 상 기 하나 또는 복수 개의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능한 프로세서를 포함하는 프로그램 시스 템에서 실행 및/또는 해석될 수 있으며, 상기 프로그램 가능한 프로세서는 전용 또는 범용 프로그램 가능한 프 로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치, 및 적어도 하나의 출력 장치로부터 데이터 및 명령 을 수신할 수 있으며, 데이터 및 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치, 및 상기 적어도 하 나의 출력 장치로 전송한다. 본 개시를 실시하기 위한 방법의 프로그램 코드는 하나 이상의 언어를 편집하는 어느 조합을 채용하여 작성될 수 있다. 이러한 프로그램 코드를 범용 컴퓨터, 전용 컴퓨터 또는 기타 프로그램 가능한 데이터 처리 장치의 프 로세서 또는 제어기에 제공하여, 프로그램 코드로 하여금 프로세서 또는 제어기에 의해 실행될 때 흐름도 및/또 는 블록도에 규정된 기능/조작으로 하여금 실행되도록 한다. 프로그램 코드는 기계에서 완전히 실행되거나, 기 계에서 부분적으로 실행될 수 있으며, 독립 소프트웨어 패키지로서 부분적으로 기계에서 실행되거나, 부분적으 로 원격 기계에서 실행되거나, 또는 완전히 원격 기계 또는 서버에서 실행될 수 있다. 본 개시의 콘텍스트에서, 기계 판독 가능 매체는 형태가 있는 매체일 수 있고, 기계 판독 가능 매체는, 명령 수 행 시스템, 장치 또는 기계에 사용될 수 있거나 또는 명령 수행 시스템, 장치 또는 기기를 결합하여 사용할 수 있는 프로그램을 포함하거나 또는 저장할 수 있다. 기계 판독 가능 매체는 기계 판독 가능 신호 매체이거나 또 는 기계 판독 가능 저장 매체일 수 있다. 기계 판독 가능 매체는 전자적, 자기적, 광학적, 전자기적, 적외선, 또는 반도체 시스템, 장치 또는 기기, 또는 상술한 내용들의 어느 적절한 조합을 포함할 수 있으나 이에 한정되 지 않는다. 기계 판독 가능 저장 매체의 더 구체적인 예는 하나 또는 복수 개의 선을 기반한 전기 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 랜덤 액세스 메모리(RAM), 판독 전용 메모리(ROM), 소거 프로그램 가능한 프로그 램 가능 메모리(EPROM 또는 플래시 메모리), 광섬유, 휴대용 콤팩트 디스크 판독 전용 메모리(CD-ROM), 광학 저 장 기기, 자기 저장 기기, 또는 상술한 내용들의 어느 적합한 조합을 포함한다. 사용자와의 인터렉션을 제공하기 위해, 본 명세서에서 설명된 시스템 및 기술을 컴퓨터에서 실시할 수 있으며, 상기 컴퓨터는, 사용자에게 정보를 디스플레이하기 위한 디스플레이 장치(예컨대, 칼라 음극선관(CRT) 또는 액 정 디스플레이(LCD) 모니터); 및 키보드 및 포인팅 장치(예컨대, 마우스 또는 트랙볼)를 구비하고, 사용자는 상 기 키보드 및 상기 포인팅 장치를 통해 입력을 컴퓨터에 제공할 수 있다. 기타 타입의 장치는 사용자와의 인터 렉션을 제공할 수 있으며; 예컨대, 사용자에게 제공된 피드백은 어느 형태의 센싱 피드백(예컨대, 시각적 피드 백, 청각적 피드백, 또는 촉각 피드백)일 수 있으며; 그리고 어느 형태(음향 입력, 음성 입력, 또는 촉각 입 력)를 사용하여 사용자로부터의 입력을 수신할 수 있다. 여기서 설명된 시스템 및 기술을 백스테이지 컴포넌트를 포함하는 컴퓨팅 시스템(예컨대, 데이터 서버), 또는 중간 컴포넌트를 포함하는 컴퓨팅 시스템(예컨대, 애플리케이션 서버), 또는 전방 컴포넌트를 포함하는 컴퓨팅 시스템(예컨대, 그래픽 사용자 인터페이스 또는 네트워크 브라우저를 구비한 사용자 컴퓨터, 사용자는 상기 그 래픽 사용자 인터페이스 또는 상기 네트워크 브라우저를 통해 여기에서 설명된 시스템 및 기술의 실시방식과 인 터렉션할 수 있음), 또는 이런 백스테이지 컴포넌트, 중간 컴포넌트, 또는 전방 컴포넌트의 어느 조합을 포함하 는 컴퓨팅 시스템에서 구현될 수 있다. 시스템의 컴포넌트들은 어느 형태 또는 매체의 디지털 데이터 통신(예컨 대, 통신 네트워크)에 의해 서로 연결될 수 있다. 통신 네트워크의 예는, 로컬 네트워크(LAN), 광역 네트워크 (WAN), 인터넷 및 블록체인 네트워크를 포함한다. 컴퓨터 시스템은, 클라이언트 및 서버를 포함할 수 있다. 클라이언트 및 서버는 일반적으로 서로 멀리 떨어져 있고, 통상적으로 통신 네트워크를 통해 서로 인터렉션을 진행한다. 상응한 컴퓨터에서 실행되고 서로 클라이언 트-서버 관계를 구비한 컴퓨터 프로그램을 통해 클라이언트와 서버의 관계를 생성한다. 서버는 클라우드 컴퓨팅 서버 또는 클라우드 메인 프레임으로 불리기도 하는 클라우드 서버일 수 있고, 클라우드 컴퓨팅 서비스 체계에 서 하나의 메인 프레임 제품이며, 전통 물리 메인 프레임과 가상 전용 서버(\"Virtual Private Server\"，또는 \"VPS\"로 약칭)에 존재하는 관리 난이도가 크고, 트래픽 확장성이 약한 결함을 해결하였다. 서버는 분산 시스템 의 서버일 수 있고, 또는 블록체인을 결합한 서버일 수도 있다. 위에서 도시된 각종 형태의 흐름을 사용하여, 단계를 재정렬, 추가 또는 삭제할 수 있다. 예하면, 본 개시에서 기재된 각 단계들은 병렬적으로 수행될 수 있고, 또한 순차적으로 수행될 수도 있으며, 상이한 순서로 수행될 수도 있는바, 단지 본 출원에서 개시한 기술방안이 희망하는 결과를 구현할 수만 있다면, 본문에서는 이에 대해 한정하지 않는다."}
{"patent_id": "10-2022-7004180", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "상술한 구체적인 실시방식은, 본 개시의 보호 범위의 한정을 구성하지 않는다. 해당 기술분야에서 통상의 지식 을 가진 자들은 본 개시의 실시예에서의 설계 요구 및 기타 요소에 따라, 다양한 개변, 조합, 서브 조합 및 교 체를 진행할 수 있다. 본 개시의 정신 및 특허청구범위를 일탈하지 않고, 이러한 개변, 등가 교체 및 변형은 모 두 본 개시의 청구범위 내에 속한다."}
{"patent_id": "10-2022-7004180", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면들은 더 바람직하게 본 개시를 이해하기 위한 것이며, 본 개시에 대한 한정을 구성하지 않는다. 도 1은 본 개시의 제1 실시예에 따른 웨이크업 지표 모니터링 방법의 흐름 예시도이다. 도 2는 본 개시의 제2 실시예에 따른 웨이크업 지표 모니터링 방법의 흐름 예시도이다. 도 3은 본 개시의 제3 실시예에 따른 웨이크업 지표 모니터링 장치의 구조 예시도이다. 도 4는 본 개시의 제4 실시예에 따른 웨이크업 지표 모니터링 장치의 구조 예시도이다. 도 5는 본 개시의 실시예의 예를 실시할 수 있는 전자 기기의 예시적인 블록도를 나타낸다."}
