{"patent_id": "10-2021-0037179", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0039997", "출원번호": "10-2021-0037179", "발명의 명칭": "멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법 및 장치", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "판, 리앙후앙"}}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "멀티-턴(multi-turn) 대화 중 공개 장면 대화의 백트래킹 방법으로서,조회 문장을 수신한 것에 응답하여, 상기 조회 문장에 따라 업무 장면을 결정하는 단계; 상기 업무 장면에 진입하고, 상기 업무 장면에 대응되는 제1 대화 노드 트리에 진입하는 단계; 상기 제1 대화 노드 트리의 각각의 파라미터 검증 대화 노드에 대해, 상기 파라미터 검증 대화 노드에 따라 관련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검증 대화 노드를 저장하고, 상기 공개 장면으로 이동하며, 상기 공개 장면의 제2 대화 노드 트리에 진입하는 단계; 상기 제2 대화 노드 트리를 통해 사용자 정보를 수집하고, 상기 수집에 성공하면, 상기 제2 대화 노드 트리의처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정하는 단계; 및상기 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 파라미터 검증 대화 노드에 따라 상기 업무 장면에 복귀하여, 상기 업무 장면의 기타 대화 논리 처리를 계속하여 수행하는 단계;를 포함하는 방법."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 공개 장면을 밀폐 상태로 설정하고, 사용자에 의해 입력된 의도에 따라 상기 공개 장면에서 장면 전환을금지시키는 단계;를 더 포함하는 방법."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 조회 문장에 따라 업무 장면을 결정하는 단계는,상기 조회 문장을 의미 분석하여, 상기 조회 문장에 의도가 존재하는지 여부를 결정하는 단계; 및상기 의도가 존재하면, 상기 의도에 대응되는 업무 장면을 결정하는 단계;를 포함하는 방법."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 조회 문장에 따라 업무 장면을 결정하는 단계는,상기 의도가 존재하지 않고, 현재 대화에 어떤 장면도 존재하지 않으면, 사용자가 의도를 입력하도록 유도하는단계; 및입력된 의도에 따라 대응되는 업무 장면을 결정하는 단계;를 포함하는 방법."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 의도가 존재하지 않고, 현재 대화가 장면에 존재하면, 상기 현재 대화가 존재하는 장면을 업무 장면으로결정하는 단계;를 더 포함하는 방법."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 수집에 실패하면, 상기 사용자 정보를 재수집하는 단계; 및공개특허 10-2021-0039997-3-상기 재수집의 횟수가 기설정 임계값에 도달하면, 상기 수집에 실패한 공개 장면을 종료하는 단계;를 더 포함하는 방법."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서, 상기 제2 대화 노드 트리 중 제2 대화 노드에 대해, 상기 제2 대화 노드에 따라 관련 파라미터를 검증하여 새로운 공개 장면에 진입해야 하는 것으로 판정되면, 상기 제2 대화 노드를 저장하고, 상기 새로운 공개 장면으로이동하며, 상기 새로운 공개 장면의 제3 대화 노드 트리에 진입하는 단계; 상기 제3 대화 노드 트리를 통해 사용자 정보를 수집하고, 상기 수집에 성공하면, 상기 제3 대화 노드 트리의처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정하는 단계; 및상기 제3 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 제2 대화 노드에 따라 상기 공개 장면으로 복귀하고, 상기 공개 장면의 기타 대화 논리 처리를 계속하여 수행하는 단계;를 더 포함하는 방법."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 사용자 정보를 수집하는 단계는,상기 사용자 정보가 이미 수집된 기타 공개 장면에서 상기 이미 수집된 사용자 정보를 계승 받는 단계;를 포함하는 방법."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "멀티-턴 대화 중 공개 장면 대화의 백트래킹 장치로서,조회 문장을 수신한 것에 응답하여, 상기 조회 문장에 따라 업무 장면을 결정하는 결정 유닛; 상기 업무 장면에 진입하고, 상기 업무 장면에 대응되는 제1 대화 노드 트리에 진입하는 진입 유닛; 상기 제1 대화 노드 트리의 각각의 파라미터 검증 대화 노드에 대해, 상기 파라미터 검증 대화 노드에 따라 관련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검증 대화 노드를 저장하고, 상기 공개 장면으로 이동하며, 상기 공개 장면의 제2 대화 노드 트리에 진입하는 이동 유닛; 상기 제2 대화 노드 트리를 통해 사용자 정보를 수집하고, 상기 수집에 성공하면, 상기 제2 대화 노드 트리의처리 결과가 백트래킹 조건에 부합되는지 여부를 판정하는 수집 유닛; 및상기 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 파라미터 검증 대화 노드에 따라 상기 업무 장면에 복귀하여, 상기 업무 장면의 기타 대화 논리 처리를 계속하여 수행하는 백트래킹 유닛;을 포함하는 장치."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 이동 유닛은,상기 공개 장면을 밀폐 상태로 설정하고, 사용자에 의해 입력된 의도에 따라 상기 공개 장면에서 장면 전환을금지시키는 장치."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 결정 유닛은,상기 조회 문장을 의미 분석하여, 상기 조회 문장에 의도가 존재하는지 여부를 결정하고, 상기 의도가 존재하면, 상기 의도에 대응되는 업무 장면을 결정하는 장치. 공개특허 10-2021-0039997-4-청구항 12 제11항에 있어서, 상기 결정 유닛은,상기 의도가 존재하지 않고 현재 대화에 어떤 장면도 존재하지 않으면, 사용자가 의도를 입력하도록 유도하고, 입력된 의도에 따라 대응되는 업무 장면을 결정하는 장치."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 결정 유닛은,상기 의도가 존재하지 않고, 현재 대화가 장면에 존재하면, 상기 현재 대화가 존재하는 장면을 업무 장면으로결정하는 장치."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서, 상기 수집 유닛은,상기 수집에 실패하면, 상기 사용자 정보를 재수집하고, 상기 재수집의 횟수가 기설정 임계값에 도달하면, 상기수집에 실패한 공개 장면을 종료하는 장치."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항 내지 제14항 중 어느 한 항에 있어서,상기 이동 유닛은, 상기 제2 대화 노드 트리 중 제2 대화 노드에 대해, 상기 제2 대화 노드에 따라 관련 파라미터를 검증하여 새로운 공개 장면에 진입해야 하는 것으로 판정되면, 상기 제2 대화 노드를 저장하고, 상기 새로운 공개 장면으로이동하며, 상기 새로운 공개 장면의 제3 대화 노드 트리에 진입하며,상기 수집 유닛은, 상기 제3 대화 노드 트리를 통해 사용자 정보를 수집하고, 상기 수집에 성공하면, 상기 제3 대화 노드 트리의처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정하도록 구성되며, 상기 백트래킹 유닛은 또한, 상기 제3 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 제2 대화 노드에 따라 상기 공개 장면으로 복귀하고, 상기 공개 장면의 기타 대화 논리 처리를 계속하여 수행하는 장치."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 수집 유닛은,상기 사용자 정보가 이미 수집된 기타 공개 장면에서 상기 이미 수집된 사용자 정보를 계승 받는 장치."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하는 전자 기기로서,상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되며, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제8항 중 어느 한 항에 따른 방법을 수행할 수 있도록 하는 전자 기기. 공개특허 10-2021-0039997-5-청구항 18 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장 매체로서,상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제8항 중 어느 한 항에 따른 방법을 수행하도록 하는 비일시적컴퓨터 판독 가능한 저장 매체."}
{"patent_id": "10-2021-0037179", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "컴퓨터 판독 가능한 저장 매체에 저장된 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램이 프로세서에 의해 실행될 경우 제1항 내지 제8항 중 어느 한 항에 따른 방법을 구현하도록 하는 컴퓨터 프로그램."}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법 및 장치에 관하며, 인공 지능"}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 것 이다. 일 측면에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법은, 조회 문장을 수신한 것에 응답하여, 조회 문장에 따라 업무 장면을 결정하는 단계; 업무 장면 및 대응되는 제1 대화 노드 트리에 진입하는 단계; 제1 (뒷면에 계속) 대 표 도 - 도2"}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2021-0039997 대화 노드 트리의 파라미터 검증 대화 노드에 따라 관련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검증 대화 노드를 저장하고, 공개 장면으로 이동하며, 상기 공개 장면의 제2 대화 노드 트리에 진입하는 단계; 제2 대화 노드 트리를 통해 사용자 정보를 수집하고, 상기 수집에 성공하면, 백트래킹 조 건에 부합되는 지의 여부를 판정하는 단계; 백트래킹 조건에 부합되면, 저장된 파라미터 검증 대화 노드에 따라 업무 장면에 복귀하여, 업무 장면의 기타 대화 논리 처리를 계속하여 수행하는 단계;를 포함한다. 상기 실시형태 는 멀티-턴 대화에서 공개 장면 대화의 자동 백트래킹을 실현하였고, 시스템 문턱, 복잡성, 유지 코스트를 감소 시키고, 즉시성, 유효성 및 정확도를 향상시킨다. CPC특허분류 G06N 3/02 (2019.01) 발명자 자오, 씨아오준 중국 베이징 100085 하이뎬 디스트릭트 샹디 10번 가 바이두 캠퍼스 2층 허, 씨에 중국 베이징 100085 하이뎬 디스트릭트 샹디 10번 가 바이두 캠퍼스 2층바이, 창푸 중국 베이징 100085 하이뎬 디스트릭트 샹디 10번 가 바이두 캠퍼스 2층명 세 서 청구범위 청구항 1 멀티-턴(multi-turn) 대화 중 공개 장면 대화의 백트래킹 방법으로서, 조회 문장을 수신한 것에 응답하여, 상기 조회 문장에 따라 업무 장면을 결정하는 단계; 상기 업무 장면에 진입하고, 상기 업무 장면에 대응되는 제1 대화 노드 트리에 진입하는 단계; 상기 제1 대화 노드 트리의 각각의 파라미터 검증 대화 노드에 대해, 상기 파라미터 검증 대화 노드에 따라 관 련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검증 대화 노드를 저장하 고, 상기 공개 장면으로 이동하며, 상기 공개 장면의 제2 대화 노드 트리에 진입하는 단계; 상기 제2 대화 노드 트리를 통해 사용자 정보를 수집하고, 상기 수집에 성공하면, 상기 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정하는 단계; 및 상기 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 파라미터 검증 대화 노드에 따라 상 기 업무 장면에 복귀하여, 상기 업무 장면의 기타 대화 논리 처리를 계속하여 수행하는 단계;를 포함하는 방법. 청구항 2 제1항에 있어서, 상기 공개 장면을 밀폐 상태로 설정하고, 사용자에 의해 입력된 의도에 따라 상기 공개 장면에서 장면 전환을 금지시키는 단계;를 더 포함하는 방법. 청구항 3 제1항에 있어서, 상기 조회 문장에 따라 업무 장면을 결정하는 단계는, 상기 조회 문장을 의미 분석하여, 상기 조회 문장에 의도가 존재하는지 여부를 결정하는 단계; 및 상기 의도가 존재하면, 상기 의도에 대응되는 업무 장면을 결정하는 단계;를 포함하는 방법. 청구항 4 제3항에 있어서, 상기 조회 문장에 따라 업무 장면을 결정하는 단계는, 상기 의도가 존재하지 않고, 현재 대화에 어떤 장면도 존재하지 않으면, 사용자가 의도를 입력하도록 유도하는 단계; 및 입력된 의도에 따라 대응되는 업무 장면을 결정하는 단계;를 포함하는 방법. 청구항 5 제3항에 있어서, 상기 의도가 존재하지 않고, 현재 대화가 장면에 존재하면, 상기 현재 대화가 존재하는 장면을 업무 장면으로 결정하는 단계;를 더 포함하는 방법. 청구항 6 제1항에 있어서, 상기 수집에 실패하면, 상기 사용자 정보를 재수집하는 단계; 및상기 재수집의 횟수가 기설정 임계값에 도달하면, 상기 수집에 실패한 공개 장면을 종료하는 단계;를 더 포함하 는 방법. 청구항 7 제1항 내지 제6항 중 어느 한 항에 있어서, 상기 제2 대화 노드 트리 중 제2 대화 노드에 대해, 상기 제2 대화 노드에 따라 관련 파라미터를 검증하여 새로 운 공개 장면에 진입해야 하는 것으로 판정되면, 상기 제2 대화 노드를 저장하고, 상기 새로운 공개 장면으로 이동하며, 상기 새로운 공개 장면의 제3 대화 노드 트리에 진입하는 단계; 상기 제3 대화 노드 트리를 통해 사용자 정보를 수집하고, 상기 수집에 성공하면, 상기 제3 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정하는 단계; 및 상기 제3 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 제2 대화 노드에 따라 상기 공개 장 면으로 복귀하고, 상기 공개 장면의 기타 대화 논리 처리를 계속하여 수행하는 단계;를 더 포함하는 방법. 청구항 8 제7항에 있어서, 상기 사용자 정보를 수집하는 단계는, 상기 사용자 정보가 이미 수집된 기타 공개 장면에서 상기 이미 수집된 사용자 정보를 계승 받는 단계;를 포함 하는 방법. 청구항 9 멀티-턴 대화 중 공개 장면 대화의 백트래킹 장치로서, 조회 문장을 수신한 것에 응답하여, 상기 조회 문장에 따라 업무 장면을 결정하는 결정 유닛; 상기 업무 장면에 진입하고, 상기 업무 장면에 대응되는 제1 대화 노드 트리에 진입하는 진입 유닛; 상기 제1 대화 노드 트리의 각각의 파라미터 검증 대화 노드에 대해, 상기 파라미터 검증 대화 노드에 따라 관 련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검증 대화 노드를 저장하 고, 상기 공개 장면으로 이동하며, 상기 공개 장면의 제2 대화 노드 트리에 진입하는 이동 유닛; 상기 제2 대화 노드 트리를 통해 사용자 정보를 수집하고, 상기 수집에 성공하면, 상기 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되는지 여부를 판정하는 수집 유닛; 및 상기 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 파라미터 검증 대화 노드에 따라 상 기 업무 장면에 복귀하여, 상기 업무 장면의 기타 대화 논리 처리를 계속하여 수행하는 백트래킹 유닛;을 포함 하는 장치. 청구항 10 제9항에 있어서, 상기 이동 유닛은, 상기 공개 장면을 밀폐 상태로 설정하고, 사용자에 의해 입력된 의도에 따라 상기 공개 장면에서 장면 전환을 금지시키는 장치. 청구항 11 제9항에 있어서, 상기 결정 유닛은, 상기 조회 문장을 의미 분석하여, 상기 조회 문장에 의도가 존재하는지 여부를 결정하고, 상기 의도가 존재하면, 상기 의도에 대응되는 업무 장면을 결정하는 장치. 청구항 12 제11항에 있어서, 상기 결정 유닛은, 상기 의도가 존재하지 않고 현재 대화에 어떤 장면도 존재하지 않으면, 사용자가 의도를 입력하도록 유도하고, 입력된 의도에 따라 대응되는 업무 장면을 결정하는 장치. 청구항 13 제11항에 있어서, 상기 결정 유닛은, 상기 의도가 존재하지 않고, 현재 대화가 장면에 존재하면, 상기 현재 대화가 존재하는 장면을 업무 장면으로 결정하는 장치. 청구항 14 제9항에 있어서, 상기 수집 유닛은, 상기 수집에 실패하면, 상기 사용자 정보를 재수집하고, 상기 재수집의 횟수가 기설정 임계값에 도달하면, 상기수집에 실패한 공개 장면을 종료하는 장치. 청구항 15 제9항 내지 제14항 중 어느 한 항에 있어서, 상기 이동 유닛은, 상기 제2 대화 노드 트리 중 제2 대화 노드에 대해, 상기 제2 대화 노드에 따라 관련 파라미터를 검증하여 새로 운 공개 장면에 진입해야 하는 것으로 판정되면, 상기 제2 대화 노드를 저장하고, 상기 새로운 공개 장면으로 이동하며, 상기 새로운 공개 장면의 제3 대화 노드 트리에 진입하며, 상기 수집 유닛은, 상기 제3 대화 노드 트리를 통해 사용자 정보를 수집하고, 상기 수집에 성공하면, 상기 제3 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정하도록 구성되며, 상기 백트래킹 유닛은 또한, 상기 제3 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 제2 대 화 노드에 따라 상기 공개 장면으로 복귀하고, 상기 공개 장면의 기타 대화 논리 처리를 계속하여 수행하는 장 치. 청구항 16 제15항에 있어서, 상기 수집 유닛은, 상기 사용자 정보가 이미 수집된 기타 공개 장면에서 상기 이미 수집된 사용자 정보를 계승 받는 장치. 청구항 17 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하는 전자 기기로서, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되며, 상기 명령이 상기 적어도 하 나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제8항 중 어느 한 항에 따른 방법 을 수행할 수 있도록 하는 전자 기기. 청구항 18 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장 매체로서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제8항 중 어느 한 항에 따른 방법을 수행하도록 하는 비일시적 컴퓨터 판독 가능한 저장 매체. 청구항 19 컴퓨터 판독 가능한 저장 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램이 프로세서에 의해 실행될 경우 제1항 내지 제8항 중 어느 한 항에 따른 방법을 구현하도 록 하는 컴퓨터 프로그램. 발명의 설명 기 술 분 야 본 발명의 실시예는 컴퓨터 기술 분야에 관한 것으로서, 구체적으로는 인공 지능 기술 분야에 관한 것이다."}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자연어 기술의 발달로 멀티-턴 대화 기술이 더욱 성숙하고 완벽해짐에 따라 다양한 업종의 업무 장면 (scenarios)에 적용될 수 있으며, 고객 서비스의 효율성을 높이는 동시에 기업의 비용을 대폭 절감하였다. 현재 대부분의 상업용 멀티-턴 대화 시스템은 슬롯 채우기 방식 또는 개선된 버전의 슬롯 채우기 방식을 기반으 로 구현되고 있다. 대화 능력은 상대적으로 간단하고 기본적으로 사전 설정 프로세스에 따라 대화의 인터랙션이 완료되어, 공개 장면 대화 백트래킹을 쉽고 빠르게 구현할 수 없다."}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법, 장치, 기기 및 저장 매체를 제공한다."}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측면에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법은, 조회 문장을 수신한 것에 응답하여, 조회 문장에 따라 업무 장면을 결정하는 단계; 업무 장면에 진입하고, 업무 장면에 대응되는 제1 대화 노드 트리에 진입하는 단계; 제1 대화 노드 트리의 각각의 파라미터 검증 대화 노드에 대해, 상기 파라미터 검증 대화 노드 에 따라 관련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검증 대화 노드 를 저장하고, 공개 장면으로 이동하며, 공개 장면의 제2 대화 노드 트리에 진입하는 단계; 제2 대화 노드 트리 를 통해 사용자 정보를 수집하고, 수집에 성공하면, 상기 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정하는 단계; 및 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 파라미터 검증 대화 노드에 따라 업무 장면에 복귀하여, 업무 장면의 기타 대화 논리 처리를 계속하여 수행하는 단계;를 포함한다. 다른 측면에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 장치는, 조회 문장을 수신한 것에 응답하여, 조 회 문장에 따라 업무 장면을 결정하는 결정 유닛; 업무 장면에 진입하고, 업무 장면에 대응되는 제1 대화 노드 트리에 진입하는 진입 유닛; 제1 대화 노드 트리의 각각의 파라미터 검증 대화 노드에 대해, 상기 파라미터 검 증 대화 노드에 따라 관련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검 증 대화 노드를 저장하고, 공개 장면으로 이동하며, 공개 장면의 제2 대화 노드 트리에 진입하는 이동 유닛; 제 2 대화 노드 트리를 통해 사용자 정보를 수집하고, 수집에 성공하면, 상기 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정하는 수집 유닛; 및 제2 대화 노드 트리의 처리 결과가 백트래킹 조 건에 부합되면, 저장된 파라미터 검증 대화 노드에 따라 업무 장면에 복귀하여, 업무 장면의 기타 대화 논리 처 리를 계속하여 수행하도록 구성되는 백트래킹 유닛;을 포함한다. 또 다른 측면에 따른 전자 기기는, 적어도 하나의 프로세서; 및 적어도 하나의 프로세서와 통신 연결되는 메모 리;를 포함하고, 메모리에 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되며, 명령은 적어도 하나의 프로세서에 의해 실행되어, 적어도 하나의 프로세서가 상술한 방법을 수행할 수 있도록 한다. 또 다른 측면에 따른 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장 매체에서, 컴퓨터 명령은 컴퓨터 가 상술한 방법을 수행하도록 한다. 본 발명의 기술에 따르면, 멀티-턴 대화의 장면에서, 대화 노드 트리를 통해 공공 대화 장면의 대화의 자동 백 트래킹을 지원한다. 대화 백트래킹이 필요한 경우의 중복 구성을 대폭 감소하고, 동시에 대화 시스템 장면의 점 유율을 향상시킬 수 있다. 간단한 구성을 통해 대화를 원 장면에 자동 백트래킹하고 원 장면의 후속적인 대화 논리를 원활하게 수행할 수 있으며, 멀티-턴 대화 시스템 구성의 문턱 및 복잡도를 대폭 감소시켰고, 멀티-턴 대화 시스템 구성의 유지 비용도 대폭 절감하였다. 멀티-턴 대화에서 검증된 파라미터를 공유할 수 있고, 파라 미터 검증 과정을 감소시켰으며, 공공 대화 장면에서 필요한 파라미터 정보의 즉시성, 유효성 및 정확도를 향상 시켰다. 본 발명에서 제공하는 수단은 어느 한 업무 장면에 기반하여 맞춤 개발된 수단이 아니라, 이러한 타입 의 수요에 대한 추상이며, 제로 원가로 로컬에서 다른 장면에 천이되어, 멀티-턴 대화 로봇이 이러한 타입의 수 요를 만족하는 구축 코스트를 감소시킬 수 있다. 이 부분에서 설명된 내용은 본 발명의 실시예의 핵심 또는 중요 특징을 나타내는 것이 아니고, 본 발명의 범위 를 한정하기 위한 것도 아님을 이해해야 한다. 본 발명의 다른 특징은 아래의 명세서를 통해 용이하게 이해될 것이다."}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래 도면과 결부시켜 본 발명의 예시적 실시예를 설명하되, 여기에 이해를 돕기 위한 본 발명의 실시예의 다양"}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한 세부사항들이 포함되지만, 이들은 단지 예시적인 것으로 이해해야 한다. 따라서, 본 기술분야의 통상의 기술 자는 본 발명의 범위 및 정신을 벗어나지 않는 전제 하에 여기서 설명된 실시예에 대해 다양한 변형 및 수정을 진행할 수 있음을 이해해야 한다. 마찬가지로, 명확 및 간략을 위해, 아래의 설명에서 공지 기능 및 구조에 대 한 설명을 생략한다. 본 실시예들에서 사용되는 용어는 본 실시예들에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 부분에서 상세히 그 의미를 기재할 것이다. 따라서, 본 실시예들에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 실시예들 전반에 걸친 내용을 토대로 정의되어야 한다. 본 실시예들은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는바, 일부 실시예들을 도면에 예시하 고 상세하게 설명하고자 한다. 그러나, 이는 본 실시예들을 특정한 개시형태에 대해 한정하려는 것이 아니며, 본 실시예들의 사상 및 기술범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한 다. 본 명세서에서 사용한 용어들은 단지 실시예들의 설명을 위해 사용된 것으로, 본 실시예들을 한정하려는 의 도가 아니다."}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 실시예들에 사용되는 용어들은 다르게 정의되지 않는 한, 본 실시예들이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 실시 예들에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않아야 한다. 후술하는 본 발명에 대한 상세한 설명은, 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도 면을 참조한다. 이러한 실시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명의 다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 본 명세서에 기재되 어 있는 특정 형상, 구조 및 특성은 본 발명의 정신과 범위를 벗어나지 않으면서 일 실시예로부터 다른 실시예 로 변경되어 구현될 수 있다. 또한, 각각의 실시예 내의 개별 구성요소의 위치 또는 배치도 본 발명의 정신과 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미 로서 행하여지는 것이 아니며, 본 발명의 범위는 특허청구범위의 청구항들이 청구하는 범위 및 그와 균등한 모 든 범위를 포괄하는 것으로 받아들여져야 한다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유 사한 구성요소를 나타낸다. 한편, 본 명세서에서 하나의 도면 내에서 개별적으로 설명되는 기술적 특징은 개별적으로 구현될 수도 있고, 동 시에 구현될 수도 있다. 본 명세서에서, \"~유닛(unit)\"은 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로 세서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다. 서로 모순되지 않는 한, 본 출원 중의 실시예 및 실시예 중의 특징은 서로 조합될 수 있음을 설명하고자 한다. 아래에 첨부된 도면을 참조하고 실시예를 결부하여 본 출원에 대한 상세한 설명을 진행하기로 한다. 도 1은 본 발명의 실시예가 응용될 수 있는 예시적 시스템 아키텍처이다. 도 1에 도시된 바와 같이, 시스템 아키텍처는 단말 기기(101, 102, 103), 네트워크 및 서버를 포함할 수 있다. 네트워크는 단말 기기(101, 102, 103)와 서버 사이에서 통신 링크의 매체를 제공한 다. 네트워크는 다양한 연결 타입을 포함할 수 있는 바, 예를 들어 유선, 무선 통신 링크 또는 광섬유 케 이블 등이다. 사용자는 단말 기기(101, 102, 103)를 사용하여 네트워크를 통해 서버와 인터랙션함으로써 메시지 등 을 수신 또는 송신할 수 있다. 단말 기기(101, 102, 103)에는 예를 들어 인간-기계 대화 애플리케이션, 웹 브라 우저 애플리케이션, 쇼핑 애플리케이션, 검색 애플리케이션, 인스턴트 메시지 도구, 이메일 클라이언트, 소셜 플랫폼 소프트웨어 등과 같은 다양한 통신 클라이언트 애플리케이션이 설치될 수 있다. 단말 기기(101, 102, 103)는 디스플레이 스크린을 구비하고 서버 메시지에 대한 수신을 지원하는 다양한 전자 기기일 수 있는데, 스마트폰, 태블릿 PC, 전자책 리더기, MP3 플레이어(Moving Picture Experts Group Audio Layer III, 무빙 픽쳐 압축 그룹 오디오 레이어 3), MP4(Moving Picture Experts Group Audio Layer IV, 무빙 픽쳐 압축 그룹 오디오 레이어 4) 플레이어, 랩톱 컴퓨터 및 데스크톱 컴퓨터 등을 포함하지만 이에 한정되지 않는다. 단말 기기(101, 102, 103)가 소프트웨인 경우 상기 열거된 전자 기기에 설치될 수 있다. 예를 들어, 다 수의 소프트웨어 또는 소프트웨어 모듈(예를 들어, 분산형 서비스를 제공하는 다수의 소프트웨어 모듈)로 구현 되거나, 하나의 소프트웨어 또는 소프트웨어 모듈로 구현될 수 있으며 여기서는 구체적으로 한정하지 않는다. 서버는 다양한 서비스를 제공하는 서버일 수 있고, 예를 들면 단말 기기(101, 102, 103)에서 진행되는 인 간-기계 인터랙션을 지원하는 백그라운드 대화 서버일 수 있다. 백그라운드 대화 서버는 수신된 조회 문장 등 데이터에 대해 분석 등 처리를 진행하고 처리 결과(예를 들면 계정 잔액)를 단말 기기에 피드백할 수 있다. 서버는 하드웨어 또는 소프트웨어일 수 있다. 서버가 하드웨어인 경우, 복수의 서버로 구성된 분산형 서버 클러스터로 구현될 수 있고, 하나의 서버로 구현될 수도 있다. 서버가 소프트웨어인 경우, 복수의 소 프트웨어 또는 소프트웨어 모듈(예를 들면 분산형 서비스를 제공하는 복수의 소프트웨어 또는 소프트웨어 모 듈)로 구현되거나, 하나의 소프트웨어 또는 소프트웨어 모듈로 구현될 수 있으며 여기서는 구체적으로 한정하지 않는다. 본 발명의 실시예가 제공하는 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법은 일반적으로 서버에 의해 수행되고, 이에 상응하게, 멀티-턴 대화 중 공개 장면 대화의 백트래킹 장치는 서버에 설치될 수 있다. 도 1 중의 단말 기기(101, 102, 103), 네트워크 및 서버의 개수는 예시적인 것일 뿐이며, 시스템 아 키텍처는 실제 필요에 따라 임의의 개수의 단말 기기, 네트워크 및 서버를 구비할 수 있다.도 2는 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 일 실시예의 흐름도이다. 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법은 하기의 단계를 포함한다. 단계에서, 조회 문장을 수신한 것에 응답하여, 조회 문장에 따라 업무 장면을 결정한다. 본 실시예에 있어서, 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 수행 주체(예를 들면, 도 1에 도시된 서버)는 유선 연결 방식 또는 무선 연결 방식을 통해 사용자는 인간-기계 대화를 진행하는 단말기를 이용 하여 조회 문장을 수신할 수 있다. 수행 주체는 조회 문장에 따라 업무 장면을 결정한다. 기술적 해결수단을 설명하기 전에 몇 가지 개념을 먼저 설명한다. 의도: 예컨대 날씨 조회, 잔액 조회, 계좌 이체 등과 같은 사용자가 완성하고자 하는 하나의 업무 동작을 대표 하며, 코드 중의 함수와 유사하다. 의도는 최상층 의도 및 서브 의도로 분류될 수 있는 바, 여기서 최상층 의도 는 대화 과정에서 언제나 트리거될 수 있는 의도일 수 있고, 서브 의도는 단지 대응되는 장면에서만 트리거될 수 있다. 의도의 인식은 템플릿 매칭, 텍스트 카테고리 등 방안에 기반하여 실현될 수 있다. 대화 노드: 대화 과정에서 사용자와 로봇의 한 라운드의 인터랙션을 정의하였고, 사용자의 조회 문장은 어느 한 대화 노드를 트리거하여 요청을 처리하고 답장을 획득한다. 엔티티 수집, 컨텍스트 계승, 컨텍스트 변천, 업무 시스템 도킹, 답안 생성 등을 포함한다. 장면: 하나의 의도 및 상기 의도 하의 모든 대화 인터랙션(예컨대 수집 엔티티, 규명, 확인, 서브 의도 등)은 하나의 장면을 구성하고, 사용자가 새로운를 표달하였거나 또는 의도 대화를 종료해야만, 장면은 전환되거나 종 료된다. 장면은 업무 장면 및 공개 장면을 포함한다. 공개 장면은 모든 세션 공용의 장면을 가리키며, 예를 들 면, 신원 검증함, 계좌 검증 등을 위한 장면이다. 업무 장면은 공개 장면 이외의 장면을 가리킨다. 세션: 동일한 사용자가 어느 한 시간대 내에서 (예컨대, 콜센터 중의 하나의 전화와 같이), 로봇과 진행한 일련 의 대화는 하나의 세션이다. 대화: 사용자와 로봇의 일문일답은 한 라운드의 대화이다. 조회 문장에 따라 업무 장면을 결정하는 방법은 하기의 몇가지 방식을 포함할 수 있다. 1: 조회 문장을 의미 분석하여, 의도가 존재하는 지의 여부를 결정하고, 의도가 존재하면, 의도에 대응되는 업 무 장면을 결정한다. 미리 트레이닝된 신경망 모듈을 통해 의미 분석을 진행하여 의도를 결정할 수 있다. 템플릿 매칭의 방식을 통해 의도를 결정할 수도 있다. 예를 들어, 사용자가 “돈이 얼마나 남았는가”를 입력하면, 의도가 “잔액 조회”임 을 인식할 수 있다. 그 다음 상기 의도에 대응되는 것은 금융 업무 장면임을 결정한다. 의미 분석을 통해 사용 자의 의도를 결정한 후 다시 장면 인식을 진행하고, 단지 키워드 매칭의 방식을 통해 장면을 결정하는 것에 비 하면 더욱 정확하고 모호성을 방지하기에, 상기 방식은 장면 인식의 정확도를 향상시킬 수 있다. 2: 의도가 존재하지 않고 현재 대화에 그 어떤 장면도 존재하지 않으면, 사용자가 의도를 입력하도록 유도하고, 입력된 의도에 따라 대응되는 업무 장면을 결정한다. 사용자가 이미 입력한 정보에서 의도를 인식하지 못하면, 일부 질문을 통해 사용자가 의도를 입력하도록 가이드 하는 바, 예를 들어, “무엇에 관련된 내용을 상담하시겠습니까”를 제시하고 선택항을 제공한다. 만약 사용자 가 잔액 조회를 선택하면, 대응되는 금융 업무 장면을 결정할 수 있다. 사용자가 인간-기계 인터랙션을 신속하 게 완료하도록 가이드함으로써, 사용자가 의도를 입력하지 않아 인터랙션이 실패하는 상황의 발생을 방지하여 인간-기계 인터랙션의 성공률을 향상시킬 수 있다. 3: 의도가 존재하지 않지만 현재 대화가 장면에 있다면, 현재 대화가 위치한 장면을 업무 장면으로 결정한다. 사용자가 문장을 입력한 의도를 인식하지 못하였지만, 현재 대화가 이미 장면에 있으면, 현재 대화가 위치한 장 면을 업무 장면으로 결정한다. 현재 대화가 위치한 장면을 사용하여 직접 업무 장면으로 하고, 사용자의 의도를 묻는 단계를 생략함으로써, 장면 인식의 속도를 향상시킬 수 있다. 단계에서, 업무 장면에 진입하고, 업무 장면에 대응되는 제1 대화 노드 트리에 진입한다. 본 실시예에 있어서, 장면의 대화 노드가 복수이면, 대화 노드 트리를 구성한다. 본 실시예에 있어서, 상이한 장면의 대화 노드 트리를 구분하기 위해, 업무 장면에 대응되는 대화 노드 트리를 제1 대화 노드 트리로 명명하고, 공개 장면에 대응되는 대화 노드 트리를 제2 대화 노드 트리로 명명한다. 각각의 대화 노드는 모두 기설정 된 처리 논리를 구비한다. 사용자가 상응한 정보에 대해 업무를 처리하도록 가이드한다. 공개 장면에서, 이를 밀폐 상태로 설치할 수 있고, 밀폐 상태는 사용자의 표달이 다른 의도를 뜻하며 또한 장면 이 조건에 부합되도록 전환될 경우, 장면 전환이 발생할 수 없게 되는 것을 카리킨다. 이로써 업무 장면이 사용 자의 오작동으로 인해 전환되지 않도록 보장하고, 업무 장면이 끊기지 않으며, 업무 흐름의 완전성을 확보할 수 있다. 밀폐 상태에 처한 장면이 반드시 자체 장면의 대화 논리에 포커싱되기에, 밀폐 상태에 처한 장면은 스택 공간의 백트래킹 노드를 통해 대화를 하나의 장면에 백트랙킹할 수 있다. 단계에서, 제1 대화 노드 트리의 각각의 파라미터 검증 대화 노드에 대해, 상기 파라미터 검증 대화 노드 에 따라 관련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검증 대화 노드 를 저장하고, 공개 장면으로 이동하며, 공개 장면의 제2 대화 노드 트리에 진입한다. 본 실시예에 있어서, 대화 노드에는 전문적으로 파라미터를 검증하기 위한 대화 노드가 있으며, 기타 대화 노드 는 파라미터를 검증하지 않는다. 파라미터 검증 대화 노드는 관련 검증 파라미터에 따라 공개 장면에 진입할 지 의 여부를 판정하는 바, 예를 들면 신원 검증이 필요한 대화 노드이며, 검사하기 전의 대화 논리 처리 결과가 신원 검증 통과한 정보를 찾지 못하면, 공개 장면으로 이동되어 신원을 검증해야 한다. 신원 검증 후 원 장면에 백트래킹되는 것을 보장하기 위해, 현재 파라미터 검증 대화 노드를 보존해야 하며, 그 다음 장면으로 이동을 진행해야 한다. 공개 장면에 진입한 후, 공개 장면의 제2 대화 노드 트리에 진입한다. 공개 장면의 대화 노드는 역시 다수이고 대화 노드 트리를 구성한다. 단계에서, 제2 대화 노드 트리를 통해 사용자 정보를 수집하고, 수집에 성공하면, 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정한다. 본 실시예에 있어서, 제2 대화 노드는 사용자의 정보를 수집하기 위한 대화 논리를 구성하였다. 각각의 제2 대 화 노드는 한 가지 류의 사용자 정보를 수집할 수 있고, 하나의 제2 대화 노드 트리는 완전한 사용자 정보를 수 집할 수 있다. 사용자가 사용자 정보를 입력하도록 가이딩하는 정보는, 예를 들어, \"신분증 번호를 입력하세요, 신분증 사진을 제공해주세요\" 등과 같다. 수집된 정보는 제3자 인터페이스를 호출하여 신원을 검증하며, 검증이 통과되면 수집 성공이다. 수집된 정보를 사용하여 다음 처리를 진행할 수 있다. 그 다음 처리 결과가 백트래킹 조건에 부합되는지 여부를 판정한다. 공개 장면에 미리 백트래킹 조건을 구성하는 바, 예를 들어, 모든 공개 장 면의 대화 노드 대화 논리 처리가 완료되면, 정보 검증이 통과된 결과 등을 획득할 수 있다. 수집이 실패하면 재수집한다. 재수집하는 횟수가 기설정 임계값에 도달하면, 수집에 실패한 공개 장면을 종료한 다. 이는 인간-기계 인터랙션 효율을 향상시킬 수 있고, 실패율을 감소시켜 교착 상태를 방지한다. 기절성 질문 을 통해 사용자가 정보를 재수집하도록 가이드할 수 있다. 만약 사용자에게 신분증 번호를 입력하기를 수차례 프롬프팅 하였으나, 사용자가 제공하지 않거나, 또는 제공한 신분증이 검증 통과 불가하면, 수집에 실패한 공개 장면을 종료한다. 정보 수집 실패를 프로프팅하고, 직전의 업무 장면에 백트래킹된다. 단계에서, 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 파라미터 검증 대화 노드 에 따라 업무 장면에 복귀하여, 업무 장면의 기타 대화 논리 처리를 계속하여 수행한다. 본 실시예에 있어서, 백트래킹 조건에 부합될 경우, 공개 장면 이전으로 전환된 업무 장면에 백트래킹될 수 있 다. 그 다음 업무 장면의 기타 대화 논리 처리를 계속하여 수행한다. 다른 대화 논리 처리는 파라미터 검증 대 화 노드 이외의 대화 노드의 대화 논리 처리를 가리킨다. 도 3은 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 일 응용 장면의 모식도이다. 도 3을 참조하면, 사용자가 입력한 “잔액 조회”를 수신하고 이를 의도 인식으로 하고, 상기 의도에 대응되는 금융 업무 장면에 진입한다. 대화 노드 및 관련 검증 파라미터에 따라 공개 장면에 진입할 지의 여부를 판정한 다. 공개 장면에 진입할 필요가 없다면, 금융 업무 장면의 기타 대화 노드의 대화 논리를 수행한다. 공개 장면 에 진입해야 하면, 현재 업무 장면의 대화 노드(A)를 스택 공간에 임시 저장하여, 공개 장면 종료 시 원 업무의 장면에 백트래킹 되도록 한다. 공개 장면으로 이동되어, 공개 장면 대화 노드(x)에 진입한다. 사용자가 정보를 수집하도록 가이딩하고, 사용자가 입력한 문장에 대해 엔티티 인식을 진행하여 정보를 수집한다. 사용자 정보가 수집 성공하지 않았으면, 사용자가 정보를 수집하도록 계속하여 가이딩해야 한다. 사용자가 정보 수집에 성공하 면 수집된 사용자 정보에 대해 공공 대화 장면 논리 처리를 진행한다. 원 업무 장면에 자동 백트래킹되도록 설 정하였는 지의 여부를 판단한다. 원 업무 장면에 자동 백트래킹되도록 설정하지 않았다면, 원 업무 장면에 잠시 저장되고 공개 장면에 복귀한 대화 처리 결과에 따라 공공 업무 장면에 진입해야 하는 지의 여부를 판정한다.원 업무 장면에 자동 백트래킹되도록 설정하지 않았다면, 공개 장면의 기타 대화 노드의 대화 논리를 계속하여 수행한다. 원 업무 장면의 기타 대화 노드의 대화 논리를 수행한다. 임시 저장된 노드에 자동 백트래킹되면 사용자가 공개 장면 대화에서 대화를 백트래킹하는 구성을 대폭 감소할 수 있다. 정상적인 업무 논리에 따라, 공개 장면 대화 논리 처리에 있어서, 사용자는 언제든지 원 업무의 논리 처리에 백트래킹될 수 있으나, 대화의 자동 백트래킹은 사용자가 대화 논리의 백트래킹 이동을 진행하는 데 유 리하고, 사용자가 원 업무의 논리 처리에 백트래킹하고 싶을 때 원 업무 논리의 처리 흐름에 자동으로 리턴할 수 있다. 본 발명의 상기 실시예에서 제공하는 방법은, 멀티-턴 대화의 장면에서, 공공 대화 장면 대화의 자동 백트래킹 을 지원하며, 대화 백트래킹이 필요한 경우의 중복 구성을 대폭 감소하고, 동시에 대화 시스템 장면의 점유율을 향상시킬 수 있다. 간단한 구성을 통해 대화를 원 장면에 자동 백트래킹하고 원 장면의 후속적인 대화 논리를 원활하게 수행할 수 있으며, 이 멀티-턴 대화 시스템 구성의 문턱 및 복잡도를 대폭 감소시켰고, 멀티-턴 대화 시스템 구성의 유지 비용도 대폭 절감하였다. 아울러 공개 장면 대화에서 필요한 파라미터 정보의 즉시성, 유효 성 및 정확도를 향상시켰다. 본 발명에서 제공하는 수단은 어느 한 업무 장면에 기반하여 맞춤 개발된 수단이 아니라, 이러한 타입의 수요에 대한 추상이며, 제로 원가로 로컬에서 다른 장면에 천이되어, 멀티-턴 대화 로봇 이 이러한 타입의 수요를 만족하는 구축 원가를 감소시킬 수 있다. 도 4는 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 다른 일 실시예의 흐름도이다. 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법은 하기의 단계를 포함한다. 단계에서, 조회 문장을 수신한 것에 응답하여, 조회 문장에 따라 업무 장면을 결정한다. 단계에서, 업무 장면에 진입하고, 업무 장면에 대응되는 제1 대화 노드 트리에 진입한다. 단계에서, 제1 대화 노드 트리의 각각의 파라미터 검증 대화 노드에 대해, 상기 파라미터 검증 대화 노드 에 따라 관련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검증 대화 노드 를 저장하고, 공개 장면으로 이동하며, 공개 장면의 제2 대화 노드 트리에 진입한다. 단계에서, 제2 대화 노드 트리를 통해 사용자 정보를 수집하고, 수집 성공하면, 제2 대화 노드 트리의 처 리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정한다. 단계 - 단계와 단계 - 단계는 기본적으로 동일하기에 더 서술하지 않는다. 단계에서, 제2 대화 노드 트리 중 제2 대화 노드에 대해, 상기 제2 대화 노드에 따라 관련 파라미터를 검 증하여 새로운 공개 장면에 진입해야 하는 것으로 판정되면, 상기 제2 대화 노드를 저장하고, 새로운 공개 장면 으로 이동하며, 새로운 공개 장면의 제3 대화 노드 트리에 진입한다. 본 실시예에 있어서, 공개 장면 사이는 역시 전환이 존재할 수 있다. 예를 들어, 잔액 조회 동작은 신분증 검증 에 관련될 뿐만 아니라, 은행 계좌 검증에도 관련되기에, 새로운 공개 장면에 진입할 필요가 있다. 새로운 공개 장면에 진입하기 전에, 현재 공개 장면의 제2 대화 노드를 저장하고, 다시 새로운 공개 장면으로 이동하며, 새 로운 공개 장면의 제3 대화 노드 트리에 진입한다. 제3 대화 노드 트리는 원 공개 장면의 대화 노드 트리를 구 분하기 위한 것이다. 단계에서, 제3 대화 노드 트리를 통해 사용자 정보를 수집하고, 수집 성공하면, 제3 대화 노드 트리의 처 리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정한다. 단계과 단계는 기본적으로 동일하기에 더 서술하지 않는다. 사용자 정보를 이미 수집한 기타 공개 장 면에서 이미 수집된 사용자 정보를 계승 받을 수 있고, 기존 자원을 충분히 이용하여, 중복으로 수집되어 사용 자의 반감을 일으키는 것을 방지한다. 이미 수집되고 검증된 신분증 정보는 새로운 공개 장면에서 재차 수집 검 증될 필요가 없다. 단계에서, 제3 대화 노드의 처리 결과가 백트래킹 조건에 부합되면, 저장된 제2 대화 노드에 따라 공개 장 면으로 복귀하고, 공개 장면의 기타 대화 논리 처리를 계속하여 수행한다. 단계과 단계는 기본적으로 동일하고, 이전에 저장된 공개 장면에 백트래킹된다. 공개 장면의 처리를 계속한다. 여기서 공개 장면의 기타 대화 논리 처리는 이미 처리된 제3 대화 노드 이외의 기타 대화 노드의 대 화 논리를 가리킨다. 공개 장면 처리 완료 후 이후의 단계를 수행하여 직전의 업무 장면에 백트래킹한다. 단계에서, 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 파라미터 검증 대화 노드 에 따라 업무 장면에 복귀하여, 업무 장면의 기타 대화 논리 처리를 계속하여 수행한다. 단계과 단계는 기본적으로 동일하기에 더 서술하지 않는다. 도 4에 대응되는 실시예와 도 2와 대응되는 실시예에 비교하면, 도 4에 대응되는 실시예는 공개 장면에 대해 백트래킹을 진행하는 단계를 구현하였다. 이로써, 본 실시예에 서술되는 방안은 공개 장면의 백트래킹을 진행할 수 있다. 도 5는 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 다른 일 응용 장면의 모식도이다. 도 5를 참조하면, 구체적인 처리 흐름은 하기와 같다. 단계에서, 업무 장면에 진입하고, 계속하여 단계를 수행한다. 단계에서, 공개 장면에 진입해야 할 지의 여부를 판정한다. 단계(2.1)에서, 공개 장면에 진입할 필요가 없다면, 계속하여 단계를 수행한다. 단계(2.2)에서, 공개 장면에 진입해야 하면, 현재 업무 장면(대화가 시작된 업무 장면) 대화 노드(A)를 임시 저장하고, 후속적으로 다른 대화 장면에 진입하면, 임시 저장된 대화 노드에 따라 현재 대화의 장면에 자동 백 트래킹될 수 있으며, 계속하여 단계을 수행한다. 단계에서, 공개 장면에 진입하고, 계속하여 단계를 수행한다. 단계에서, 공개 장면에 진입해야 할 여부를 판정한다. 단계(4.1)에서, 공개 장면에 진입할 필요가 없으면, 계속하여 단계를 수행한다. 단계(4.2)에서, 공개 장면에 진입해야 하고, 현재 업무 장면(공개 장면)의 대화 노드(B)를 임시 저장하고, 다른 대화 장면에 진입하면, 임시 저장된 대화 노드에 따라 현재 대화의 장면에 자동 백트래킹될 수 있고, 계속하여 단계을 수행한다. 단계에서, 사용자가 공개 장면의 기타 논리를 처리하도록 가이딩하고, 계속하여 단계을 수행한다. 단계에서, 공개 장면의 기타 대화 노드의 논리 처리가 종료되고, 임시 저장 대화 노드(A)에 따라 바로 전 의 대화 장면에 자동 백트래킹되는 바, 즉 대화가 시작된 업무 장면의 대화 처리 논리이며, 계속하여 단계 를 수행한다. 단계에서, 공개 장면에 진입하고, 계속하여 단계을 수행한다. 단계에서, 공개 장면(n)에 진입할 필요가 있는 지를 판정한다. 단계(8.1)에서, 공개 장면(n)에 진입할 필요가 없으면, 계속하여 단계를 수행한다. 단계(8.2)에서, 공개 장면(n)에 진입해야 하고, 현재 업무 장면(공개 장면) 대화 노드(C)를 임시 저장하고, 후속적으로 다른 대화 장면에 진입하면, 임시 저장된 대화 노드에 따라 현재 대화의 장면에 자동 백트래킹될 수 있으며, 계속하여 단계을 수행한다. 단계에서, 사용자가 공개 장면의 기타 대화 노드의 대화 논리를 처리하도록 가이딩하고, 계속하여 단계 을 수행한다. 단계에서, 대화 장면 2 논리 처리가 종료되고, 임시 저장 대화 노드(B)에 따라 바로 전의 대화 장면에 자동 백트래킹되며, 즉 대화 장면 1논리 처리이고, 계속하여 단계를 수행한다. 단계에서, 공개 장면(n)에 진입하고, 계속하여 단계를 수행한다. 단계에서, 사용자가 대화 장면(n) 논리 처리를 진행하도록 가이딩하고, 계속하여 단계을 수행한다. 단계에서, 대화 장면(n)의논리 처리가 종료되고, 임시 저장 대화 노드(C)에 따라 바로 전의 대화 장면에 자 동 백트래킹되며, 즉 공개 장면의 대화 처리 논리이고, 계속하여 단계를 수행한다. 단계에서, 사용자가 대화 시작 업무 장면의 기타 논리를 처리하도록 가이딩한다. 도 6은 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 장치의 일 실시예의 구조 모식도이다. 도 6을 참조하면, 멀티-턴 대화 중 공개 장면 대화의 백트래킹 장치의 실시예는 도 2에 도시된 방법 실시예와 서로 대응되며, 상기 장치는 구체적으로 여러 가지 전자 기기에 응용될 수 있다. 도 6에 도시된 바와 같이, 본 실시예의 멀티-턴 대화 중 공개 장면 대화의 백트래킹 장치는 결정 유닛 , 진입 유닛, 이동 유닛, 수집 유닛, 백트래킹 유닛을 포함한다. 여기서, 결정 유닛 은 조회 문장을 수신한 것에 응답하여, 조회 문장에 따라 업무 장면을 결정한다. 진입 유닛은 업무 장면에 진입하고, 업무 장면에 대응되는 제1 대화 노드 트리에 진입한다. 이동 유닛은 제1 대화 노드 트리 의 각각의 파라미터 검증 대화 노드에 대해, 상기 파라미터 검증 대화 노드에 따라 관련 파라미터를 검증하여 공개 장면에 진입해야 하는 것으로 판정되면, 상기 파라미터 검증 대화 노드를 저장하고, 공개 장면으로 이동하 며, 공개 장면의 제2 대화 노드 트리에 진입한다. 수집 유닛은 제2 대화 노드 트리를 통해 사용자 정보를 수집하고, 수집 성공하면, 상기 제2 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되는지 여부를 판정한 다. 백트래킹 유닛은 제2 대화 노드의 처리 결과가 백트래킹 조건에 부합되면, 저장된 파라미터 검증 대화 노드에 따라 업무 장면에 복귀하여, 업무 장면의 기타 대화 논리 처리를 계속하여 수행한다. 본 실시예에 있어서, 멀티-턴 대화 중 공개 장면 대화의 백트래킹 장치의 결정 유닛, 진입 유닛 , 이동 유닛, 수집 유닛, 백트래킹 유닛의 구체적인 처리는 도 2에 대응되는 실시예 중의 단계, 단계, 단계, 단계, 단계를 참조 가능하다. 본 실시예의 일부 선택 가능한 실시형태에 있어서, 이동 유닛은, 공개 장면을 밀폐 상태로 설정하고, 사용 자에 의해 입력된 의도에 따라 공개 장면에서 장면 전환을 금지시킨다. 본 실시예의 일부 선택 가능한 실시형태에 있어서, 결정 유닛은, 조회 문장을 의미 분석하여, 의도가 존재 하는지 여부를 결정하고, 의도가 존재하면, 의도에 대응되는 업무 장면을 결정한다. 본 실시예의 일부 선택 가능한 실시형태에 있어서, 결정 유닛은, 의도가 존재하지 않고 현재 대화에 그 어 떤 장면도 존재하지 않으면, 사용자가 의도를 입력하도록 유도하며, 입력된 의도에 따라 대응되는 업무 장면을 결정한다. 본 실시예의 일부 선택 가능한 실시형태에 있어서, 결정 유닛은, 의도가 존재하지 않지만 현재 대화가 장 면에 존재하면, 현재 대화가 존재하는 장면을 업무 장면으로 결정하도록 구성된다. 본 실시예의 일부 선택 가능한 실시형태에 있어서, 수집 유닛은, 수집 실패하면, 재수집하고, 재수집하는 횟수가 기설정 임계값에 도달하면, 수집에 실패한 공개 장면을 종료한다. 본 실시예의 일부 선택 가능한 실시형태에 있어서, 이동 유닛은, 제2 대화 노드 트리 중 제2 대화 노드에 대해, 상기 제2 대화 노드에 따라 관련 파라미터를 검증하여 새로운 공개 장면에 진입해야 하는 것으로 판정되 면, 상기 제2 대화 노드를 저장하고, 새로운 공개 장면으로 이동하며, 새로운 공개 장면의 제3 대화 노드 트리 에 진입한다. 수집 유닛은, 제3 대화 노드 트리를 통해 사용자 정보를 수집하고, 수집에 성공하면, 상기 제3 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되는 지의 여부를 판정한다. 백트래킹 유닛은, 제 3 대화 노드 트리의 처리 결과가 백트래킹 조건에 부합되면, 저장된 제2 대화 노드에 따라 공개 장면으로 복귀 하고, 공개 장면의 기타 대화 논리 처리를 계속하여 수행한다. 본 실시예의 일부 선택 가능한 실시형태에 있어서, 수집 유닛은, 사용자 정보를 이미 수집한 기타 공개 장 면에서 이미 수집된 사용자 정보를 계승 받는다. 본 발명의 실시예에 따라, 본 발명은 전자 기기 및 판독 가능한 저장 매체를 더 제공한다. 도 7은 본 발명의 실시예에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 전자 기기의 블록도이다. 전자 기기는 랩톱 컴퓨터, 데스크톱 컴퓨터, 운영 플랫폼, 개인 정보 단말기, 서버, 블레이드 서버, 대형 컴퓨 터, 및 다른 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 의미한다. 전자 기기는 개인 디지털 처리, 셀룰러폰, 스마트폰, 웨어러블 기기 및 다른 유사한 컴퓨팅 장치와 같은 다양한 형태의 이동 장치를 의미할 수 도 있다. 본문에서 나타낸 부재, 이들의 연결과 관계, 및 이들의 기능은 단지 예시적인 것으로, 본문에서 설명 및/또는 요구된 본 발명의 구현을 한정하지 않는다. 도 7에 도시된 바와 같이, 상기 전자 기기는 하나 또는 다수의 프로세서, 메모리, 및 고속 인터페이 스 및 저속 인터페이스를 포함하는 각 부재를 연결하기 위한 인터페이스를 포함한다. 각 부재는 상이한 버스를 이용하여 서로 연결되고, 공통 메인보드에 장착될 수 있거나 필요에 따라 다른 방식으로 장착될 수 있다. 프로세서는, 메모리에 저장되거나 메모리에서 외부 입력/출력 장치(예를 들어, 인터페이스에 커플링 된 표시 기기)에 GUI의 그래픽 정보를 표시하는 명령을 포함하는 전자 기기 내에서 실행되는 명령을 처리할 수 있다. 다른 실시형태에서, 필요에 따라 다수의 프로세서 및/또는 다수의 버스를 다수의 메모리와 함께 사용할 수 있다. 마찬가지로, 다수의 전자 기기를 연결할 수 있고, 각 기기는 일부 필요한 동작(예를 들어, 서버 어레 이, 한 그룹의 블레이드 서버, 또는 다중 프로세서 시스템)을 제공한다. 도 7에서 하나의 프로세서를 예로 든다. 메모리는 즉 본 발명에서 제공되는 비일시적 컴퓨터 판독 가능한 저장 매체이다. 여기서, 상기 메모리에는 적어도 하나의 프로세서에 의해 수행되는 명령이 저장되어, 상기 적어도 하나의 프로세서가 본 발명에서 제공하 는 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법을 수행하도록 한다. 본 발명의 비일시적 컴퓨터 판독 가능 한 저장 매체에 컴퓨터 명령이 저장되어 있고, 상기 컴퓨터 명령은 컴퓨터가 본 발명에서 제공하는 멀티-턴 대 화 중 공개 장면 대화의 백트래킹 방법을 수행하도록 한다. 메모리는 비일시적 컴퓨터 판독 가능한 저장 매체로서, 비일시적 소프트웨어 프로그램, 비일시적 컴퓨터 실행 가능한 프로그램, 및 본 발명의 실시예의 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법에 대응되는 프 로그램 명령/모듈(예를 들어, 도 6에 도시된 결정 유닛, 진입 유닛, 이동 유닛, 수집 유닛 , 백트래킹 유닛)과 같은 모듈을 저장할 수 있다. 프로세서는 메모리에 저장된 비일시적 소프트웨어 프로그램, 명령 및 모듈을 실행함으로써, 서버의 다양한 기능 애플리케이션 및 데이터 처리를 수행 하는데, 즉 상기 방법 실시예의 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법을 구현한다. 메모리는 프로그램 저장 영역 및 데이터 저장 영역을 포함할 수 있고, 여기서, 프로그램 저장 영역은 운영 체제, 적어도 하나의 기능에 필요한 응용 프로그램을 저장할 수 있으며, 데이터 저장 영역은 멀티-턴 대화 중 공개 장면 대화의 백트래킹 전자 기기의 사용에 따라 구축된 데이터 등을 저장할 수 있다. 이 밖에, 메모리 는 고속 랜덤 액세스 메모리를 포함할 수 있고, 적어도 하나의 자기 디스크 메모리, 플래시 메모리, 또는 다른 비일시적 고체 상태 메모리와 같은 비일시적 메모리를 더 포함할 수 있다. 일부 실시예에서, 메모리 는 프로세서에 대해 원격으로 설치된 메모리를 선택적으로 포함할 수 있고, 이러한 원격 메모리는 네트워 크를 통해 멀티-턴 대화 중 공개 장면 대화의 백트래킹 전자 기기에 연결될 수 있다. 상기 네트워크의 구현예로 인터넷, 인트라넷, 블록체인 네트워크, 근거리 통신망, 이동 통신망 및 이들의 조합을 포함하지만 이에 한정되 지 않는다. 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 전자 기기는 입력 장치 및 출력 장치를 더 포함 할 수 있다. 프로세서, 메모리, 입력 장치 및 출력 장치는 버스 또는 다른 방식을 통해 연 결될 수 있고, 도 7에서 버스를 통해 연결되는 것을 예로 든다. 입력 장치는 입력된 디지털 또는 캐릭터 정보를 수신할 수 있고, 비디오 검색 전자 기기의 사용자 설정 및 기능 제어와 관련된 키 신호 입력을 발생할 수 있으며, 상기 입력 장치는 예를 들어 터치스크린, 키패드, 마우 스, 트랙 패널, 터치 패널, 지시 바, 하나 또는 다수의 마우스 버튼, 트랙 볼, 조이스틱 등 입력 장치이다. 출 력 장치는 표시 기기, 보조 조명 장치(예를 들어, LED) 및 촉각 피드백 장치(예를 들어, 진동 모터) 등을 포함할 수 있다. 상기 표시 기기는 액정 표시 장치(LCD), 발광 다이오드(LED) 표시 장치 및 플라스마 표시 장치 를 포함할 수 있지만 이에 한정되지 않는다. 일부 실시형태에서, 표시 기기는 터치 스크린일 수 있다. 여기서 설명된 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 전용 ASIC(전 용 집적 회로), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다양 한 실시형태는 하나 또는 다수의 컴퓨터 프로그램에서의 구현을 포함할 수 있고, 상기 하나 또는 다수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템에서 실행 및/또는 해석될 수 있으며, 상기 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가능 프로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치, 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 데이터 및 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치, 및 상기 적어도 하나의 출력 장치에 전송할 수 있다. 이러한 컴퓨팅 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션, 또는 코드라고도 함)은 프로그램 가 능 프로세서의 기계 명령을 포함하고, 하이레벨 프로세스 및/또는 객체에 대한 프로그래밍 언어, 및/또는 어셈 블리/기계 언어를 이용하여 이러한 컴퓨팅 프로그램을 실행할 수 있다. 본문에서 사용된 바와 같이, 용어 “기 계 판독 가능한 매체” 및 “컴퓨터 판독 가능한 매체”는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서 에 제공하기 위한 임의의 컴퓨터 프로그램 제품, 기기, 및/또는 장치(예를 들어, 자기 디스크, 광 디스크, 메모 리, 프로그램 가능 로직 장치(PLD))를 의미하고, 기계 판독 가능한 신호인 기계 명령을 수신하는 기계 판독 가능한 매체를 포함한다. 용어 “기계 판독 가능한 신호”는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서 에 제공하기 위한 임의의 신호를 의미한다. 사용자와의 인터랙션을 제공하기 위하여, 컴퓨터에서 여기서 설명된 시스템 및 기술을 실시할 수 있고, 상기 컴 퓨터는 사용자에게 정보를 표시하기 위한 표시 장치(예를 들어, CRT(음극선관) 또는 LCD(액정 표시 장치) 모니 터); 및 키보드 및 지향 장치(예를 들어, 마우스 또는 트랙 볼)를 구비하며, 사용자는 상기 키보드 및 상기 지 향 장치를 통해 컴퓨터에 입력을 제공한다. 다른 타입의 장치는 또한 사용자와의 인터랙션을 제공할 수 있는데, 예를 들어, 사용자에게 제공된 피드백은 임의의 형태의 감지 피드백(예를 들어, 시각 피드백, 청각 피드백, 또 는 촉각 피드백)일 수 있고, 임의의 형태(소리 입력, 음성 입력, 또는 촉각 입력)로 사용자로부터의 입력을 수 신할 수 있다. 여기서 설명된 시스템 및 기술을 백그라운드 부재를 포함하는 컴퓨팅 시스템(예를 들어, 데이터 서버), 또는 미 들웨어 부재를 포함하는 컴퓨팅 시스템(예를 들어, 응용 서버), 또는 프론트 엔드 부재를 포함하는 컴퓨팅 시스 템(예를 들어, 그래픽 사용자 인터페이스 또는 웹 브라우저를 구비하는 사용자 컴퓨터이고, 사용자는 상기 그래 픽 사용자 인터페이스 또는 웹 브라우저를 통해 여기서 설명된 시스템 및 기술의 실시형태와 인터랙션할 수 있 음), 또는 이러한 백그라운드 부재, 미들웨어 부재, 또는 프론트 엔드 부재의 임의의 조합을 포함하는 컴퓨팅 시스템에서 실시할 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들어, 통신 네트워크)을 통해 시스템의 부재를 서로 연결시킬 수 있다. 통신 네트워크의 예시로 근거리 통신망(LAN), 광역 통신망(WAN), 인터 넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트 및 서버는 일반적으로 서로 멀리 떨어져 있 고 일반적으로 통신 네트워크를 통해 서로 인터랙션한다. 대응되는 컴퓨터에서 실행되고 또한 서로 클라이언트- 서버 관계를 가지는 컴퓨터 프로그램을 통해 클라이언트 및 서버의 관계를 생성한다. 본 발명의 실시예의 기술적 해결수단에 따르면, 멀티-턴 대화의 장면에서, 공공 대화 장면 대화의 자동 백트래 킹을 지원하며, 대화 백트래킹이 필요한 경우의 중복 구성을 대폭 감소하고, 동시에 대화 시스템 장면의 점유율 을 향상시킬 수 있다. 간단한 구성을 통해 대화를 원 장면에 자동 백트래킹하고 원 장면의 후속적인 대화 논리 를 원활하게 수행할 수 있으며, 이 멀티-턴 대화 시스템 구성의 문턱 및 복잡도를 대폭 감소시켰고, 멀티-턴 대 화 시스템 구성의 유지 비용도 대폭 절감하였다. 아울러 공공 대화 장면에서 필요한 파라미터 정보의 즉시성, 유효성 및 정확도를 향상시켰다. 본 발명에서 제공하는 수단은 어느 한 업무 장면에 기반하여 맞춤 개발된 수단 이 아니라, 이러한 타입의 수요에 대한 추상이며, 제로 원가로 로컬에서 다른 장면에 천이되어, 멀티-턴 대화 로봇이 이러한 타입의 수요를 만족하는 구축 원가를 감소시킬 수 있다. 위에서 설명한 다양한 형태의 프로세스를 사용하여, 단계를 재배열, 추가 또는 삭제할 수 있음을 이해해야 한다. 예를 들어, 본 발명에 기재된 각 단계는 동시에 수행될 수 있거나 순차적으로 수행될 수 있거나 상이한 순서로 수행될 수 있고, 본 발명에서 공개된 기술적 해결수단이 이루고자 하는 결과를 구현할 수만 있으면, 본 문은 여기서 한정하지 않는다."}
{"patent_id": "10-2021-0037179", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상기 구체적인 실시형태는 본 발명의 보호 범위를 한정하지 않는다. 본 기술분야의 통상의 기술자는 설계 요구 및 다른 요소에 따라 다양한 수정, 조합, 서브 조합 및 대체를 진해할 수 있음을 이해해야 한다. 본 발명의 정 신 및 원칙 내에서 진행한 임의의 수정, 등가적 대체 및 개선 등은 모두 본 발명의 보호 범위 내에 속해야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2021-0037179", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 해결수단을 더 잘 이해하도록 제공되는 것으로, 본 발명을 한정하지 않는다. 도 1은 본 발명의 실시예가 응용될 수 있는 예시적 시스템 아키텍처이다. 도 2는 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 일 실시예의 흐름도이다. 도 3은 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 일 응용 장면의 모식도이다. 도 4는 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 다른 일 실시예의 흐름도이다. 도 5는 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 다른 일 응용 장면의 모식도이다. 도 6은 본 발명에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 장치의 일 실시예의 구조 모식도이다. 도 7은 본 발명의 실시예에 따른 멀티-턴 대화 중 공개 장면 대화의 백트래킹 방법의 전자 기기의 블록도이다."}
