{"patent_id": "10-2023-0103255", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0022343", "출원번호": "10-2023-0103255", "발명의 명칭": "운세 컨텐츠 제공 시스템 및 이를 이용한 방법", "출원인": "임태경", "발명자": "임태경"}}
{"patent_id": "10-2023-0103255", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 출생일자를 포함하는 출생정보 데이터를 토대로, 사주팔자 중 적어도 연, 월 및 일에 대응되는 사주팔자데이터가 도출되는 사주팔자 도출 단계; 및 상기 사주팔자 데이터 중 적어도 하나에 대하여, 뜻풀이 컨텐츠가 제공되는 사주팔자 해석 단계를 포함하는 것을 특징으로 하는 운세 컨텐츠 제공 방법."}
{"patent_id": "10-2023-0103255", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 뜻풀이 컨텐츠는,오행에 대응되는 관념이 배경 및 사물 중 적어도 하나로 이미지화된 단위 이미지 컨텐츠를 포함하는 것을 특징으로 하는 운세 컨텐츠 제공 방법."}
{"patent_id": "10-2023-0103255", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 사주팔자 해석 단계는,상기 사주팔자 데이터 중 적어도 두 개의 선택 요소 및 각 상기 선택 요소들의 상기 뜻풀이 컨텐츠가 선택되는선택 단계; 및 상기 뜻풀이 컨텐츠들이 단일 이미지 내에서 조합되어 표현되는 종합 이미지화 단계를 포함하는 것을 특징으로하는 운세 컨텐츠 제공 방법."}
{"patent_id": "10-2023-0103255", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항 또는 제 3 항에 있어서,상기 뜻풀이 컨텐츠는,각 상기 사주팔자 데이터에 지정된 단위 음양 컨텐츠에 대응하여, 크기, 수량, 군집도, 강도, 명암, 온도, 높이및 속도 중 적어도 하나의 상대적인 차이를 달리하는 것을 특징으로 하는 운세 컨텐츠 제공 방법."}
{"patent_id": "10-2023-0103255", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "출생정보 데이터를 토대로, 사주팔자 중 적어도 연, 월 및 일에 대응되는 사주팔자 데이터를 도출하는 사주팔자도출부; 및 상기 사주팔자 데이터에 대응되는 텍스트들 중 적어도 하나에 대하여, 뜻풀이 컨텐츠를 제공하는 사주팔자 해석부를 포함하는 것을 특징으로 하는 운세 컨텐츠 제공 시스템."}
{"patent_id": "10-2023-0103255", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 의한 운세 컨텐츠 제공 방법은 적어도 출생일자를 포함하는 출생정보 데이터를 토대로, 사주팔자 중 적어도 연, 월 및 일에 대응되는 사주팔자 데이터가 도출되는 사주팔자 도출 단계 및 상기 사주팔자 데이터에 대 응되는 텍스트들 중 적어도 어느 하나에 대하여, 뜻풀이 컨텐츠가 제공되는 사주팔자 해석 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0103255", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사주명리를 기반으로 각종 운세 컨텐츠를 제공하기 위한 운세 컨텐츠 제공 시스템 및 이를 이용한 방 법에 관한 것이다."}
{"patent_id": "10-2023-0103255", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "타로, 주역, 사주명리 등 운세를 보기 위한 다양한 점술 컨텐츠들이 널리 제공되고 있다. 특히, 사주명리는 동 아시아권에서 유래된 점술 행위이며, 흔히 사주팔자로도 알려져 있다. 또한, 사주명리(사주팔자)는 근래 활발한 문화 교류를 통해 전세계적으로 유행하고 있다. 사주명리를 기반으로 운세를 보기 위해서는, 먼저 생년일시 각각이 만세력에 매칭된다. 다음으로, 생년일시 각 각의 천간이 십간의 형태로 도출된다. 또한, 생년일시 각각의 지지가 십이지의 형태로 도출된다. 그리하여, 연 주(연간/연지), 월주(월간/월지), 일주(일간/일지), 시주(시간/시지)와 같이, 4개의 기둥으로 구분되는 8개의 글자인 사주팔자가 도출된다. 그리고, 사주팔자의 위치별 각 글자들은 음양, 오행, 그 외 다양한 동양 사상에 대하여 고유의 의미를 지니고 있다. 또한, 사주팔자들의 각 글자들간 조합은 사주명리 전문 역술가의 견해에 따라 다양하게 해석될 수 있다. 상술한 내용과 같은 사주팔자 도출 및 해석을 위해서는, 별도의 만세력 서적 및 사주역학 풀이용 책자의 활자 컨텐츠 해석을 통해 수행되는 것이 일반적이었다. 그러나, 이와 같이 책자를 이용한 오프라인 방식에 따르는 경 우, 상당한 수고 및 시간이 소요된다는 단점이 발생하게 된다. 특히, 컨텐츠 수요자로써는 전문 역술가가 소재 한 위치까지 물리적으로 이동하여야 하는 등, 컨텐츠 접근성에서도 상당한 불편함이 존재한다. 이에 관해, 선행하는 한국 등록특허 제10-2306827호에는 기문둔갑을 기반으로 하는 사주 분석시스템이 개시되어 있다. 또한, 상기 선행문헌에는 사주팔자에 관한 각종 정보를 전산상으로 데이터베이스화하기 위한 방안을 개시 하고 있다. 이에 따라, 사주팔자 해석을 위한 전문적 지식 및 관련 책자의 구입이 최소화된다는 장점이 발생할 수 있다. 다만, 상기 선행문헌에 따르면, 사주팔자의 해석 관련 컨텐츠들은 전문 용어로만 제공될 뿐이어서, 이로 인해 일반인으로써는 해당 컨텐츠에 대한 직관적 이해도를 높이기 어렵다는 문제점이 발생하게 된다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허 제10-2306827호"}
{"patent_id": "10-2023-0103255", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 과제 해결의 일환으로, 본 발명은 사주팔자 해석 컨텐츠들의 직관적 이해도를 높일 수 있는 운세 컨텐츠 제공 시스템 및 이를 이용한 방법을 제공하고자 하는 것을 그 목적으로 한다."}
{"patent_id": "10-2023-0103255", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 의한 운세 컨텐츠 제공 방법은, 적어도 출생일자를 포함하는 출생정보 데이터를 토대로, 사주팔자 중 적어도 연, 월 및 일에 대응되는 사주팔자 데이터가 도출되는 사주팔자 도출 단계 및 상기 사주팔자 데이터 중 적어도 하나에 대하여, 뜻풀이 컨텐츠가 제공되는 사주팔자 해석 단계를 포함하는 것을 특징으로 한다. 또한, 상기 뜻풀이 컨텐츠는, 오행에 대응되는 관념이 배경 및 사물 중 적어도 하나로 이미지화된 단위 이미지 컨텐츠를 포함하는 것을 특징으로 한다. 또한, 상기 사주팔자 해석 단계는, 상기 사주팔자 데이터 중 적어도 두 개의 선택 요소 및 각 상기 선택 요소들 의 상기 뜻풀이 컨텐츠가 선택되는 선택 단계 및 상기 뜻풀이 컨텐츠들이 단일 이미지 내에서 조합되어 표현되 는 종합 이미지화 단계를 포함하는 것을 특징으로 한다. 또한, 상기 뜻풀이 컨텐츠는, 각 상기 사주팔자 데이터에 지정된 단위 음양 컨텐츠에 대응하여, 크기, 수량, 군 집도, 강도, 명암, 온도, 높이 및 속도 중 적어도 하나의 상대적인 차이를 달리하는 것을 특징으로 한다.그리고, 본 발명에 의한 운세 컨텐츠 제공 시스템은, 출생정보 데이터를 토대로, 사주팔자 중 적어도 연, 월 및 일에 대응되는 사주팔자 데이터를 도출하는 사주팔자 도출부 및 상기 사주팔자 데이터에 대응되는 텍스트들 중 적어도 하나에 대하여, 뜻풀이 컨텐츠를 제공하는 사주팔자 해석부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0103255", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사주팔자 글자들 각각이 내포하고 있는 오행 관련 각종 관념들이 이미지화되어 제공될 수 있 다. 이에 따라, 사용자로서는 전문 역술가의 도움 없이도, 직관적인 시각적 이미지를 통해 오행에 기초한 자신 의 사주팔자 해석 결과를 파악할 수 있게 된다."}
{"patent_id": "10-2023-0103255", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 구체적인 설명에 앞서, 본 발명을 실시하기 위한 구체적인 사항들은 다음에 기재할 실시예 및 도면에 포함되어 있고, 명세서 전체에 기재된 동일 참조 부호는 동일 구성요소를 지칭한다. 또한, 본 명세서에서의 단수형 표현들은 문구에서 특별히 언급하지 않는 이상 복수형도 포함한다. 이하, 도면을 참조하여 본 발명에 따른 운세 컨텐츠 제공 시스템 및 이를 이용한 방법에 대해 설명하도록 한다. 도 1은 본 발명에 의한 운세 컨텐츠 제공 시스템을 나타내는 구성도이다. 그리고, 도 2는 본 발명에 의한 운세 컨텐츠 제공 방법을 나타내는 흐름도이다. 도 1 및 도 2를 참조하면, 본 발명에 의한 운세 컨텐츠 제공 시스템은 출생정보 수신부, 사주팔자 도출부 및 사주팔자 해석부를 포함한다. 또한, 본 발명에 의한 운세 컨텐츠 제공 방법은 출생정보 입 력 단계(S100), 사주팔자 도출 단계(S200) 및 사주팔자 해석 단계(S300)를 포함한다. 본 발명에 의한 운세 컨텐츠 제공 시스템 및 그 방법에 따르면, 사용자 기기를 통해 시스템에 입력된 운세 컨텐츠 수령자의 출생정보를 토대로, 사주팔자에 대응되는 맞춤형 운세 컨텐츠가 제공될 수 있다. 여기서, 시스템은 프로그램/어플리케이션/앱 등과 같이 컴퓨팅으로 판독 가능한 기록 매체일 수 있다. 또 한, 사용자는 자신 소유의 사용자 기기를 통해 시스템의 기능들을 이용할 수 있다. 아울러, 사용자 기기는 각종 스마트 기기, 랩탑, 데스크탑, 태블릿, PDA, 그 외 언급되지 않은 다양한 수단들로부터 취사 선택될 수 있다. 그리고, 상기 사용자란, 자신의 운세를 점치고 싶어하는 운세 컨텐츠 수령자일 수 있다. 또한, 전문 역술가 등 과 같이, 운세 컨텐츠 수령자로부터 역술 의뢰를 받은 사람들 또한 상기 사용자에 포함될 수 있다. 그리고, 시스템, 사용자 기기, 그 밖의 외부 컨텐츠 플랫폼 등은 도시가 생략된 네트워크 망을 통해 상호 통신할 수 있다. 이때, 상기 네트워크 망은 유선 인터넷 전산망, 롱텀 에볼루션, 와이파이,블루투스, 사물인터넷 수단, 인공 위성, 그 외 언급되지 않은 각종 유/무선 통신 수단들을 총괄하는 수단으로 이해될 수 있다. 또한, 상기 외부 컨텐츠 플랫폼은 만세력 제공 플랫폼(20-1), 이미지 제공 플랫폼(20-2), 그 외 전자상거래 제공 등 시스템 운용상 필요한 일체의 외부 플랫폼일 수 있다. 여기서, 컨텐츠 제공자는 네트워크 망을 통해 시스템을 온라인상에 공급할 수 있다. 또한, 컨텐츠 제공자 는 해당 시스템을 개발/운영하는 사업자일 수 있다. 이어서, 도 3은 도 2에 도시된 출생정보 입력 단계를 나타내는 모식도이다. 도 3을 더 참조하면, 상기 출생정보 입력 단계(S100)를 통해 상기 출생정보 수신부로 운세 컨텐츠 수령자 의 출생정보 데이터(bd)가 입력 내지 수신된다. 이를 위해, 사용자 기기를 통해 상기 출생정보 데이터(bd) 가 입력될 수 있다. 상기 출생정보 데이터(bd)는 출생 연도(yy), 출생 월(mm) 및 출생 일(dd)과 같은 출생일자 외에도, 출생 시각 (tt)을 더 포함할 수 있다. 여기서, 일반적으로 출생일자는 개개인들이 기억하고 있으나, 정확한 출생 시각까지 기억하는 사용자들은 비교적 적을 수 있다. 이러한 사정을 감안하여, 적어도 출생 시각(tt)의 입력은 필요에 따 라 생략될 수 있다. 이때, 출생일자의 경우 양력/음력이 구분될 수 있다. 또한, 상기 출생정보 데이터(bd)는 성별 및 성명을 포함할 수 있다. 사용자의 사정에 따라 출생 시각(tt)이 생략된 경우, 임의의 출생 시각이 상기 출생정보 데이터(bd)에 적용될 수 있다. 예컨대, 상기 임의의 출생 시각은 0시일 수 있다. 또한, 상기 출생 시각(tt)은 컨텐츠 제공자에 의해 지정된 소정의 지역 표준시를 기준으로 특정될 수 있다. 다음으로, 도 4는 도 2에 도시된 사주팔자 도출 단계를 나타내는 모식도이다. 도 4를 더 참조하면, 상기 사주팔자 도출부가 상기 출생정보 데이터(bd)를 기초로 사주팔자 데이터(fd)를 산출함으로써, 상기 사주팔자 도출 단계(S200)가 수행된다. 이러한 사주팔자 도출을 위하여, 별도의 만세력 데 이터들이 사주팔자 도출부에 적용될 수 있다. 또한, 만세력 관련 데이터들은 외부에 존재하는 별도의 만세 력 제공 플랫폼(20-1)으로부터 제공될 수 있다. 일 예로, 입력된 출생정보 데이터(bd)가 만세력에 매칭됨으로써, 출생정보의 각 요소들에 대응되는 천간 및 지 지가 모두 도출될 수 있다. 즉, 연간/연지, 월간/월지, 일간/일지, 시간/시지 각각에 대응되는 총 8개의 문자들 로 구성된 사주팔자가 도출되는 것이다. 이러한 사주팔자 데이터(fd)는 사용자 기기로 현출될 수 있다. 이어서, 도 5는 도 1에 도시된 사주팔자 해석부를 나타내는 구성도이다. 그리고, 도 6은 도 2에 도시된 사주팔 자 해석 단계를 나타내는 흐름도이다. 도 5 및 도 6을 더 참조하면, 상기 사주팔자 해석부는 기초 단위 지정부 및 해석 매칭부를 포함 한다. 또한, 상기 사주팔자 해석 단계(S300)는, 텍스트 매칭 단계(S310), 단위 이미지 매칭 단계(S320) 및 종합 이미지 제공 단계(S330)를 포함한다. 그리고, 사주팔자 해석부에 의한 사주팔자 해석 단계(S300)가 수행됨으로써, 최대 8글자의 사주팔자에 대 한 텍스트/이미지 기반 사용자 맞춤형 해석 결과가 도출된다. 이어서, 도 7a 내지 도 7d 는 도 5에 도시된 기초 단위 지정부의 일 실시예를 나타내는 모식도이다. 도 7a 내지 도 7d를 더 참조하면, 상기 기초 단위 지정부에는 10간 및 12지 각각에 대한 각종 뜻풀이 컨텐 츠용 지정값들이 입력 및 저장될 수 있다. 이러한 지정값들을 토대로, 맞춤형 사주팔자에 대한 해석이 진행된다. 또한, 상기 기초 단위 지정부는 오행 지정부, 음양 지정부, 텍스트 지정부, 이 미지 지정부 및 지장간 지정부를 포함할 수 있다. 더 상세하게는, 도 7a 및 도 7b를 참조하면, '갑/을/병/정/무/기/경/신/임/계'로 구분되는 천간(10간) 각각에 대하여, 상기 오행 지정부는 '화/수/목/금/토'와 같은 단위 오행 컨텐츠(sc)들을 지정할 수 있다. 그리고, 천간 각각에 대하여, 상기 음양 지정부는 음 또는 양과 같은 성질을 나타내는 단위 음양 컨텐츠 (yc)를 지정할 수 있다. 그리고, 천간 각각에 대하여, 상기 텍스트 지정부는 단위 오행 컨텐츠(sc) 및 단위 음양 컨텐츠(yc)에 대 응되는 단위 텍스트 컨텐츠(tc)를 지정할 수 있다. 또한, 서로 동일한 단위 오행 컨텐츠(sc)가 지정된 천간들이라 하더라도, 서로 배정된 음양 컨텐츠(yc)가 상이 하다면, 해당 천간들에 대한 단위 텍스트 컨텐츠(tc)는 상이하게 지정될 수 있다. 보다 상세하게는, 음양 컨텐 츠(yc)에 대응하여, 단위 텍스트 컨텐츠(tc)의 관념이 지니고 있는 크기/수량/군집도/강도/명암/온도/높이/속도 에서 상대적인 차이가 발생할 수 있다. 일 예로, 도 7a를 참조하면, 천간 중 갑과 을의 단위 오행 컨텐츠(sc)는 모두 목으로 지정되어 있다는 공통점이 존재한다. 반면, 단위 음양 컨텐츠(yc)의 경우, 갑은 양으로, 을은 음으로 지정되어 있다는 차이가 있다. 이에 대응하여, 갑에서의 단위 텍스트 컨텐츠(tc)는 '(크기가) 큰 나무'로, 을에서의 단위 텍스트 컨텐츠(tc)는 '(나 무의 속성에 해당하면서도 상대적으로 크기가 작은) 덩굴 식물'로 지정될 수 있다. 이때, 상술한 갑과 을의 예시는 크기의 상대적인 차이에 관한 것이나, 크기/수량/군집도/강도/온도/높이/속도 모두에 대해서도 음양 컨텐츠(yc)의 특성이 적용될 수 있다. 그리고, 천간 각각에 대하여, 상기 이미지 지정부는 상기 단위 텍스트 컨텐츠(tc)의 관념에 대응되는 단위 이미지 컨텐츠(ic)를 지정할 수 있다. 예컨대, 앞서 언급된 갑/을의 경우, '큰 나무' 및 '덩굴 식물'의 관념에 대응되는 형상을 나타내는 단위 이미지 컨텐츠(ic)들이 적용될 수 있다. 또한, 외부 컨텐츠 플랫폼에서 제공하는 문자 인식 기반 이미지 제공 서비 스가 접목됨으로써, 각 단위 이미지 컨텐츠(ic)들이 제공될 수 있다. 그리고, 도 7a에서 '정'의 예시를 살펴보면, 이때의 단위 이미지 컨텐츠(ic)는 '(어두운 밤 하늘 아래 보름달로 부터 방출되는) 달빛'이라는 배경 및 사물의 관념이 이미지화 된 것이다. 즉, 각 단위 텍스트 컨텐츠(tc)가 내포하고 있는 사물 자체의 관념만이 아닌, 해당 사물에 수반되는 배경의 관 념 또한 단위 이미지 컨텐츠(ic)에 적용될 수 있다. 그리고, 상기 지장간 지정부는 자/축/인/묘/진/사/오/미/신/유/술/해와 같은 지지(12지) 각각에 대하여 지 장간 컨텐츠(jc)를 지정할 수 있다. 예컨대, 해의 경우, 천간 중 무/갑/임과 같은 지장간 컨텐츠(jc)가 적용될 수 있다. 또한, 지지 각각에 대하여, 천간과 마찬가지로 단위 오행 컨텐츠(sc), 단위 음양 컨텐츠(yc), 단위 텍스트 컨텐 츠(tc), 단위 이미지 컨텐츠(ic) 등이 마찬가지 원리로 적용될 수 있다. 첨언하여, 지지에서의 단위 오행 컨텐츠(sc)의 경우, 예컨대 도 7c의 '인'과 '묘'에는 '목'이라는 단위 오행 컨 텐츠(sc)가 공통된다. 그리고, 인과 묘의 지장간에는 ‘갑’이 공통적으로 포함되어 있다. 이때, 인과 묘에서 공통되는 '갑'이라는 지장간은 천간을 기준으로 ‘큰 나무’라는 관념을 나타낸다. 따라서, 해당 큰 나무에 대한 관념은 인과 묘 각각의 단위 이미지 컨텐츠(ic)에 부분 이미지로서 삽입될 수 있다. 반면, 인과 묘에서의 단위 음양 컨텐츠(yc)의 경우, 인은 양을 나타내고 묘는 음을 나타낸다는 차이가 있다. 이 러한 음양 컨텐츠(yc)의 차이를 감안한다면, 인에서의 단위 이미지 컨텐츠(ic)에서는 다수의 큰 나무가 표현될 수 있고, 묘에서의 단위 이미지 컨텐츠(ic)에서는 (비교적 적은 개수인) 단일 개수의 큰 나무가 표현될 수 있다. 덧붙여, 기초 단위 지정부가 다루는 상술한 데이터들의 구체적인 내용은 컨텐츠 제공자에 의해 다양하게 지정/변경될 수 있다. 다음으로, 도 8은 도 6에 도시된 텍스트 매칭 단계의 일실시예를 나타내는 도면이다. 그리고, 도 9는 도 6에 도 시된 단위 이미지 매칭 단계의 일실시예를 나타내는 도면이다. 여기서, 상기 해석 매칭부는 단위 해석 제공부 및 종합 해석 제공부를 포함한다. 도 8 및 도 9를 더 참조하면, 텍스트 매칭 단계(S310)를 통해, 사주팔자 데이터(fd)에 맞춤화된 단위 오행 컨텐 츠(sc), 단위 음양 컨텐츠(yc), 단위 텍스트 컨텐츠(tc), 단위 지장간 컨텐츠(jc) 및 단위 이미지 컨텐츠(ic)들 이 제공된다. 이에 관해, 도 4에 도시된 사주팔자 데이터(fd)를 기준으로 설명을 진행하도록 한다. 보다 상세하게는, 단위 해석 제공부는 사주팔자 데이터(fd)와 매칭되는 단위 텍스트 컨텐츠(tc)들을 검색 한다. 다음으로, 사주팔자 데이터(fd)와 매칭되는 각 단위 텍스트 컨텐츠(tc)들은 사용자 기기로 현출된다. 그리고, 단위 이미지 매칭 단계(S320)를 통해 단위 해석 제공부는 사주팔자 데이터(fd)와 매칭되는 단위 이미지 컨텐츠(ic)들을 검색한다. 다음으로, 사주팔자 데이터(fd)와 매칭되는 각 이미지 컨텐츠들은 사용자 기 기로 현출된다. 이와 같이, 사주팔자의 각 문자들에 맞춤화된 오행 연계 해석 결과들이 텍스트 및 이미지 형태로 제공된다. 그 리하여, 사주팔자의 각 위치별 단어들에 대한 오행 해석은 시각적 텍스트/이미지를 통해 직관적으로 이해될 수 있게 된다. 예를 들어, 사주팔자에서 각 오행 구성요소들의 순서, 각 오행 구성요소들의 관념, 각 오행 구성요 소별 비중 등 오행에 대응되는 운세 파악용 지표들이 시각적으로 직관화되어 제공된다. 다음으로, 도 10은 도 6에 도시된 종합 이미지 제공 단계를 나타내는 흐름도이다. 그리고, 도 11은 도 10에 도 시된 종합 이미지 제공 단계의 일 실시예를 나타내는 도면이다. 도 10 및 도 11을 더 참조하면, 상기 종합 이미지 제공 단계(S330)는 선택 단계(S331), 추출 단계(S332) 및 종 합 이미지화 단계(S333)를 포함한다. 보다 상세하게는, 먼저, 종합 해석 제공부가 사주팔자 데이터(fd) 중 적어도 두 개의 선택 요소(se)들을 선택함으로써 상기 선택 단계(S331)가 수행된다. 이때, 시간/일간/월간/연간/시지/일지/월지/연지와 같은 사주팔자의 8 글자들 중, 어떠한 위치에 해당하는 글자 들이 상기 선택 요소(se)로 지정될지에 관해서는 사전 설정될 수 있다. 일 예로, 도 4 및 도 11을 참조하면, 일 간, 일지 및 월지에 위치하는 글자들이 선택 요소(se)화되도록 설정되어 있다. 그 외, 사주팔자에서의 글자별 위치/개수 등 모든 경우의 수를 감안하여, 선택 요소(se) 선정 기준은 다양하게 적용될 수 있다. 다음으로, 선택된 선택 요소(se)들에 대응되는 단위 텍스트 컨텐츠(tc)들이 추출됨으로써 상기 추출 단계(S33 2)가 수행된다. 예컨대, 도 4 및 도 11을 기준으로, 선택 요소(se)들의 간지는 '정, 묘, 신'이다. 그리고, 도 7a 내지 도 7d를 기준으로, '정, 묘, 신'에 매칭되는 단위 텍스트 컨텐츠(tc)들은 '달빛', '덩굴이 휘감은 큰 나무', '큰 산과 큰 강' 이다. 또한, 해당 복수 개의 단위 텍스트 컨텐츠(tc)들은 단일의 종합 텍스트 요소(te)로 조합 및 분류 된다. 다음으로, 상기 종합 텍스트 요소(te)에 대응되는 종합 이미지 컨텐츠(cc)가 제공됨으로써 상기 종합 이미지화 단계(S333)가 수행된다. 예컨대, 도 11에 도시된 단일의 종합 이미지 컨텐츠(cc) 내에서, (a) 내지 (c)와 같은 부분 이미지들의 관념은 앞서 언급된 단위 텍스트 컨텐츠(tc)들인 '달빛', '덩굴이 휘감은 큰 나무', '큰 산과 큰 강' 에 대응됨을 알 수 있다. 이와 같이, '달빛이 환한 밤 하늘 아래 큰 산이 솟아나 있고, 그 산 아래 큰 강이 흐르고 있으며, 그 강 주변으로 커다란 덩굴 나무가 자라나고 있는 모습'을 나타내는 단일 이미지가 생성된다. 즉, 상기 종합 이미지 컨텐츠(cc)는 종합 텍스트 요소(te)의 관념/의미를 단일 이미지 내에 시각적으로 배경화 및 사물화하여 표현한 것이다. 또한, 별도의 외부 컨텐츠 플랫폼과 연동됨으로써, 상기 종합 이미지화 단계(S333)가 수행될 수 있다. 보다 상세하게는, 먼저, 종합 해석 제공부는 종합 텍스트 요소(te)를 이미지 제공 플랫폼(20-2)으로 송신 할 수 있다. 이때, 바람직하게는, 상기 이미지 제공 플랫폼(20-2)은 기계학습/심층학습/인공지능 등을 기반으로 구축된 주문형 이미지 제작 플랫폼일 수 있다. 특히, 상기 이미지 제공 플랫폼(20-2)은 입력된 문자의 관념을 파악한 후, 이를 이미지화할 수 있다. 다음으로, 상기 이미지 제공 플랫폼(20-2)이 종합 텍스트 요소(te)에 대응되는 관념을 인식 및 이미지로 표현함 으로써, 상기 종합 이미지 컨텐츠(cc)가 생성된다. 그리고, 이러한 종합 이미지 컨텐츠(cc)는 사용자 기기 등으로 최종 전송된다. 첨언하여, 언급된 도면들에는 텍스트 매칭 단계(S310), 단위 이미지 매칭 단계(S320) 및 종합 이미지 제공 단계 (S330)가 상호 순서대로 수행되는 것으로 도시되어 있으나, 이는 설명을 위한 일 예일 뿐이다. 그 외, 이러한 단계들은 동시적으로 진행될 수 있다. 또한, 이러한 단계들의 수행 순서는 파생 가능한 모든 경우의 수로 지정 될 수 있다. 아울러, 이미지 제공 플랫폼(20-2)은 시스템 외부가 아닌, 시스템 내부에도 적용될 수 있다. 이상과 같이 본 발명은 운세 컨텐츠 제공 시스템 및 이를 이용한 방법을 제공하고자 하는 것을 주요한 기술적 사상으로 하고 있다. 그리고, 도면을 참고하여 상술한 실시예는 단지 일부의 실시예에 불과하고, 본 발명의 권 리범위는 특허 청구범위를 기준으로 정해져야 한다. 아울러, 본 발명의 권리범위는 다양하게 파생 가능한 균등 한 실시예에도 미친다."}
{"patent_id": "10-2023-0103255", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 의한 운세 컨텐츠 제공 시스템을 나타내는 구성도이다. 도 2는 본 발명에 의한 운세 컨텐츠 제공 방법을 나타내는 흐름도이다. 도 3은 도 2에 도시된 출생정보 입력 단계를 나타내는 모식도이다. 도 4는 도 2에 도시된 사주팔자 도출 단계를 나타내는 모식도이다. 도 5는 도 1에 도시된 사주팔자 해석부를 나타내는 구성도이다. 도 6은 도 2에 도시된 사주팔자 해석 단계를 나타내는 흐름도이다. 도 7a 내지 도 7d 는 도 5에 도시된 기초 단위 지정부의 일 실시예를 나타내는 모식도이다. 도 8은 도 6에 도시된 텍스트 매칭 단계의 일실시예를 나타내는 도면이다. 도 9는 도 6에 도시된 단위 이미지 매칭 단계의 일실시예를 나타내는 도면이다. 도 10은 도 6에 도시된 종합 이미지 제공 단계를 나타내는 흐름도이다. 도 11은 도 10에 도시된 종합 이미지 제공 단계의 일 실시예를 나타내는 도면이다."}
