{"patent_id": "10-2021-0147134", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0062153", "출원번호": "10-2021-0147134", "발명의 명칭": "인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템 및 안내방법", "출원인": "광주대학교산학협력단", "발명자": "문승혁"}}
{"patent_id": "10-2021-0147134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "건축구조물의 2차원 도면정보를 토대로 건축 구조물의 내부 구조정보를 획득하는 건축구조물의 내부구조 정보획득부;상기 건축구조물의 내부에 산재해 있는 재실자의 위치정보를 감지 또는 입력받는 재실자 정보획득부;상기 건축구조물 실내외에 설치되어 재난발생을 감시하는 재난발생 감시부;상기 건축구조물의 내부구조 정보획득부에서 획득된 건축구조물의 내부구조 정보와 재실자 정보획득부에서 획득된 재실자 정보 및 재난발생 감시부에서 획득된 재난발생 신호를 송/수신하는 통신부;상기 통신부를 통해 수신된 정보를 상기 재실자에게 대피경로 정보를 제공하거나 재난 발생시 재실자가 대피경로 정보를 요청할 수 있도록 실내의 복수개소에 설치되거나 휴대 가능하도록 구성된 대피경로 정보제공부;상기 건축구조물의 내부구조 정보획득부와, 재실자 정보획득부에서 획득된 정보를 토대로 건축구조물의 내부 대피경로를 파악하고, 상기 재난발생 감시부를 통해 획득된 재난발생 신호를 토대로 상기 대피경로 정보제공부로최적 대피경로를 제공하는 대피경로 안내관리부;를 포함하고,상기 대피경로 안내관리부는,상기 건축구조물의 내부구조 정보획득부와 재실자 정보획득부에서 획득된 건물구조 정보와 재실자의 정보를 수신하여 저장 및 분류하고,상기 저장 및 분류된 데이터를 학습하며,상기 데이터 학습을 기반으로 재실자가 위치한 각 층별로 재실자의 이동동선과 내부 대피경로를 파악,분석하고,상기 데이터 학습과 재실자 위치 및 내부 대피경로의 구조 분석결과를 토대로 각 층의 재실자 위치별 최적의 대피경로를 미리 예측, 판단하고,상기 재난발생 감시부에서 재난발생신호를 획득한 후 상기 대피경로 정보제공부를 통해 재실자의 대피로 안내요청시 또는 자동으로 상기 예측 및 판단결과를 토대로 재실자의 위치별로 최적의 대피경로 정보를 제공하며, 상기 대피경로를 미리 예측, 판단할 때, 재난 상황에 따라 각 층별 및 재실자의 위치별 분포현황, 재실자의 이동동선 및 재실자의 이동동선에 위치한 이동장애 엘레먼트를 토대로 최적의 대피경로를 예측 및 판단하는 것을특징으로 하는 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템."}
{"patent_id": "10-2021-0147134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 대피안내 관리부는,상기 데이터를 학습할 때 이용되는 이동장애 엘레먼트는 재실자의 인원 수, 통로 폭, 재실자의 위치 또는 이동동선에서 출입구에 이르는 통로에 존재하는 벽체, 인공시설물, 도어, 계단, 출입구까지의 거리 데이터를 포함하는 것을 특징으로 하는 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템."}
{"patent_id": "10-2021-0147134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 대피안내 관리부는,상기 데이터를 학습할 때, 건축구조물 내부의 주요 통로에 새로운 장비 또는 인공시설물이 배치되면 그 새로운장비 또는 인공시설물을 이동장애 엘레먼트로 추출하고, 추출된 이동장애 엘레먼트를 기존의 학습모델에서 설정공개특허 10-2023-0062153-3-된 이동장애 엘레먼트의 구성에 추가하고, 추가된 신규의 이동장애 엘레먼트를 재학습하여 각 재실자의 위치별최적의 대피경로를 예측, 판단하는 것을 특징으로 하는 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템."}
{"patent_id": "10-2021-0147134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "인공지능을 기반으로 건축구조물 내의 재난 발생시 대피로를 안내하는 방법에 있어서,건축구조물의 2차원 도면정보를 토대로 건축구조물의 내부구조 정보를 획득하는 단계;상기 건축구조물의 내부구조 정보획득단계에서 획득된 데이터 중 이동통로 상에 배치된 이동장애 엘레먼트 데이터를 획득하는 단계;상기 건축구조물을 이용하는 재실자의 실내 위치정보를 획득하는 재실자 실내 위치정보 획득단계;상기 획득한 건축구조물의 내부구조 정보와 이동장애 엘레먼트 데이터 및 재실자의 위치 데이터를 저장 및 분류하는 단계;상기 저장 및 분류된 데이터를 학습하는 단계;상기 데이터 학습과 상기 파악된 이동장애 엘레먼트 결과를 토대로 재실자의 위치별 또는 이동 동선별로 대피경로를 미리 예측 및 판단하는 단계;상기 건축구조물의 내외부에 설치된 재난발생 감시부를 통해 재난발생 정보를 획득하는 재난발생정보 획득단계;상기 재난발생정보 획득시 재실자의 위치별 또는 이동 동선별로 상기 대피경로의 예측 및 판단결과를 토대로 각재실자의 최단 대피경로를 산출하는 단계;상기 재난발생정보 획득시 재실자가 휴대 또는 착용하거나 건축구조물의 내부에 배치된 대피경로 정보제공부를상기 산출된 대피경로 정보를 전송하여 재실자가 대피경로 정보제공부에서 제시된 대피경로를 통해 신속하고 안전하게 대피할 수 있도록 하는 대피 경로정보 전송단계를 포함하여 이루어지는 것을 특징으로 하는 인공지능 기반 건축구조물 내의 최적 대피경로 안내방법."}
{"patent_id": "10-2021-0147134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 이동장애 엘레먼트 데이터를 획득하는 단계에서는, 이동통로상에 배치된 인공시설물의 특성에 따라 각각의이동장애 엘레먼트별로 이동장애 가중치가 차등적으로 적용되어 분류 및 저장하고,상기 대피경로를 미리 예측 및 판단하는 단계에서는, 상기 이동장애 엘레먼트 데이터 획득단계에서 획득된 서로다른 가중치를 갖는 이동장애 엘레먼트 데이터를 이용하여 대피경로를 예측 및 판단하도록 구성되는 것을 특징으로 하는 인공지능 기반 건축구조물 내의 최적 대피경로 안내방법."}
{"patent_id": "10-2021-0147134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 이동장애 엘레먼트 데이터 획득단계 및 대피경로 예측 및 판단단계는, 다수의 질점(노드)과 저항요소를 토대로 유체의 효율적인 흐름과 분배를 평면적 네트워크망으로 표시하는 수력학적 네트워크 모델링 기법이 적용된것을 특징으로 하는 인공지능 기반 건축구조물 내의 최적 대피경로 안내방법."}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템 및 안내방법에 관한 것으로, 더욱 상세하게 는 건축구조물의 2차원 도면정보를 토대로 건축 구조물의 내부 구조정보를 획득하는 건축구조물의 내부구조 정보 획득부; 상기 건축구조물의 내부에 산재해 있는 재실자의 위치정보를 감지 또는 입력받는 재실자 정보획득부; 상 (뒷면에 계속)"}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템 및 안내방법에 관한 것으로, 더욱 상세하 게는 각종 대형 공사현장이나 다중 집합시설 등에서 재해 발생시 서버에 구축된 수력학적 네트워크 모델링을 응 용한 딥러닝 기법으로 작업자 및 재실자의 현재 위치에 최적화된 대피경로를 신속하게 추출하여 제공할 수 있도 록 하는 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템 및 안내방법에 관한 것이다."}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래에 들어 자연적, 인적 재해가 자주 발생되고 있으며, 그 규모가 커지고 있을 뿐만 아니라 재해의 형태도 매 우 다양한 요인에 의해 발생되고 있는 실정이다. 본 발명은 일정한 구조물 내에 작업자나 불특정 다수인이 있는 상태에서 재해, 특정공간이나 장소에 화재나 붕 괴 사고와 같은 불가항력적인 사고가 발생될 경우, 외부의 지원이 없는 상태에서 구조물 내부에 잔류하는 인원 이 능동적으로 재해 현장을 빠져 나갈 수 있도록 하는 대피경로 안내 방법에 관한 것이다. 일반적으로 재해가 발생되면, 목격자 등에 의해 재해발생 신고가 이루어지고, 재해 발생 후 일정시간이 경과한 후에 출동한 119 구조대가 도착한 후에 구조활동이 이루어지게 된다. 하지만, 구조대의 도착이 지연되거나 구조대가 도착 하더라도 재해현장에 구조대의 접근이 어려운 경우, 재해현 장에 갇힌 인원들은 스스로 안전지대로 대피하여 인명을 보존하여야 하지만, 급박한 재해현장 상황에 허둥대다 가 대피경로를 찾지 못하거나 대피경로를 찾더라도 장애물에 갇힌 경우 스스로 재해현장을 빠져 나오기가 매우 어렵게 되고, 구조 시간이 지체될 경우 자칫 인명을 잃을 수 있는 상황이 발생되기 쉽다. 또한, 재해 현장에 구조대가 출동하더라도 구조물의 내부상황이나 구조물의 구조, 재해 발생지점을 정확하게 파 악하지 못한 경우, 효율적인 인명구조 작업에 애로를 겪는 경우가 자주 발생되고 있으며, 재해현장에 대한 정확 한 파악이 없는 상태에서 구조대원이 구조물 내부로 진입한 경우, 구조대원마져도 재해현장에 갇히게 되어 더욱 많은 인명 피해가 발생되는 일이 종종 일어나고 있다. 따라서, 이러한 종래의 재해발생시 구조물 내부에 잔류하는 인원들에게 재해지점을 회피하여 능동적으로 대피할 수 있도록 하여 인명피해를 줄이기 위한 다양한 형태와 방법으로 재난에 대응할 수 있는 시스템 및 재난 발생시 인명피해를 최소화할 수 있는 대피안내 시스템에 대한 발명이 다수 안출되고 있다. 종래에 안출된 일부 실시예를 살펴보면, 특허등록 제10-2136092호(등록일:2020.07.15)에 “재난발생정보를 이용 한 최단 대피경로 안내 시스템”이 안출된 바 있다. 상기 선행 등록 특허의 경우, 위치정보 수집장치, 화재감지센서 및 가스센서를 포함하는 환경정보 측정장치, 구 조 및 대피 안내장치, 이들 장치와 네트워크로 연결된 안내서버를 포함하는 구성으로 이루어지고, 상기 안내서 버는 대상지역을 복수개의 구역(zone)으로 구분하여 관하도록 구성됨으로써, 특정구역에서 재난이 발생한 경우 해당 재난구역으로부터 최단거리의 출구를 파악하여 시각적으로 제공하도록 구성되었다. 그러나, 상기 시스템은 관리서버에서 관리하고 있는 대상지역을 출입하는 인원들에 대해 실시간 재실자의 위치 를 추적, 파악해야 하고, 출입하는 인원들은 위치정보를 수집할 수 있는 위치발신장치를 착용해야 하는 번거로 움이 발생될 수 밖에 없었다. 또한, 구조 및 대피안내장치에서 안내되는 내용이 화살표나 글자로 표시되어 재난이 발생한 건물에 대한 구조를 정확히 파악하지 못한 재실자의 경우 대피과정에서 혼선이 발생될 수 밖에 없다. 특히, 건물 내부가 넓고 고층 건물인 경우 구조 및 대피 안내장치에 표시된 평면적인 방향표시 신호만으로 재난 현장에서 탈출구까지 찾아가기가 어렵고, 재실자의 위치가 수시로 변경되는 경우, 각 재실자의 현재 위치에서 다시 최단 대피경로를 찾기 위해 대피 시뮬레이션 엔진이 동작됨으로 인해 관리서버는 데이터 처리에 부하가 걸 릴 뿐만 아니라 신속한 안내가 어려운 문제점이 있었다. 또한, 상기 선행 등록 특허는 대상지역을 여러개의 구역으로 나누고, 각 구역에서 탈출구까지의 이동경로를 기 준으로 대피안내가 이루어지고 있지만, 각 이동경로에 특정 장애물(내부 시설물, 계단, 내부 구조변경 등)이 있 거나 탈출구가 제역할을 하지 못할 경우, 기 입력된 탈출구 정보만을 토대로 대피 안내가 이루어져 현실감이 떨 어지는 단점이 있었다. 또 다른 종래의 실시예로, 특허공개 제10-2021-73102호(공개일: 2021.06.18)로 “2차원의 건물 평면도를 활용한 건물 재난 상황 발생시 대응시스템”이 안출된 바 있다. 상기 공개특허의 경우, 건물 내에 스마트 IoT와 CCTV를 설치하고, 2차원 건물 평면도와 증강현실을 활용하여 재 난시 건물 내 재실자 및 외부 구조자에게 대피로와 구조로를 안내하도록 구성되며, 재실자에게는 소지하고 있는 휴대기기를 통해 재난상황을 전파하고 대피로를 안내하도록 구성되어 있다. 하지만, 상기 공개 특허의 경우 재난발생이 이루어진 장소와 해당 공간에 있는 재실자의 대피경로 및 다른 공간 에 있는 재실자들에게 대피경로 및 탈출구를 안내하는 구체적인 방법이 제시되어 있지 않아 당업자가 용이하게 실시할 수 있을 정도로 발명의 구성이 명확하게 기재되어 있지 않은 추상적인 아이디어 수준의 재난 대응 시스 템을 소개하고 있어 현실적으로 그 적용이 어려운 상태이다. 한편, 본 발명은 종래의 기술의 문제점들을 개선하여 재실자에게 보다 효율적인 대피안내가 이루어질 수 있도록 하기 위해, ‘수력(수리)학적 네트워크(Hydraulic network)’모델 기법을 이용하고자 한다. 본 발명에 이용되는 ‘수력(수리)학적 네트워크(Hydraulic network)’모델 기법은 하나의 도시를 구성하는 많은 사용자에게 물을 공급하기 위해 반드시 필요한 수도시설의 물 공급망을 구축하기 위한 수리설계망의 네트워크 구조를 단순화한 모델기법이라 할 수 있다. 또한, 이러한 ‘수력(수리)학적 네트워크(Hydraulic network)’모델 기법은 다양한 형상과 구조로 이루어진 가 스터빈의 내부 유로에서 압력차에 따라 고압지점에서 저압지점까지 압축공기가 흘러가는 과정을 해석하는데 사 용되기도 하며, 이러한 수력 네트워크 모델의 일 실시예가 도 1에 도시되어 있다. 수리설계망을 구성하는 수력 네트워크의 경우, 물을 사용하는 이용자와, 각 이용자를 연결하는 파이프 관의 연 속적인 결합 상태를 연속된 선(line)으로 표시하고, 연결된 파이프를 통과하는 물이 갖는 여러가지 손실, 즉 파 이프의 마찰계수, 파이프의 길이나 직경, 유압, 유량 및 수두 손실 등을 감안하여 감안하여 물 분배 네트워크가 최적으로 구축될 수 있는 방안을 제시할 수 있도록 한다. 또한, 이러한 수력 네트워크는 다양한 형상과 복잡한 구조로 이루어지는 특정 구조물의 형상특성에 기반을 두고 구조물을 구분하고, 구조물을 이루는 어떤 물리량의 흐름을 제한하는 것을 저항요소(resistance element)으로 표현하는 방식으로 수치화함으로써, 관심 대상의 전체 시스템을 하나의 네트워크로 구성하여 임의의 지점에서 다른 지점으로 물리량이 흘러가는 것을 모델링할 수 있는 기법이다. 이러한 ‘수력(수리)학적 네트워크(Hydraulic network)’모델 기법에서 물리량의 이동이 자연수러울 수 있는 가 장 바람직한 경로는 가장 저항이 작은 요소로 연결되는 경로라는 점에 착안하여, 본 발명에서는 상술한 수력 네 트워크의 모델링 기법을 이용하여 물리량의 가장 바람직한 흐름(방향)이 구조물 내에서 재난발생시 가장 효율적 인 대피경로를 도출하는데 이용될 수 있음을 감안하여 본 발명에 적용하게 되었다. 즉, 건축구조물 내에서 비상대피 경로를 찾는 방법에 대해서 살펴보면, 건축 구조물의 내부는 다수의 벽, 도어, 계단, 통로, 창문, 출입구 및 내부 시설물(이하 이들을 ‘저항요소’라 칭함)로 구성되어 있으므로, 건축 구조 물의 2차원 도면을 바탕으로 전체 형상을 입구, 출구 및 저항요소로 구분하여 도식화할 수 있다. 또한, 도식화된 각 저항요소는 그것의 특징을 결정하는 요소들의 면적 또는 거리, 재실자의 이동용이성 등에 따 라 저항요소별로 가중치를 부여하여 건축 구조물 전체를 다수의 저항요소로 구성된 거대한 네트워크를 구성할 수 있고, 이러한 개념을 활용하여 복잡한 건축 구조물 내의 작업자 또는 재실자를 위한 대피경로를 도출하는데 ‘수력(수리)학적 네트워크(Hydraulic network)’모델 기법을 적용할 수 있는 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) - 특허등록 제10-2136092호(등록일:2020.07.15) (특허문헌 0002) - 특허공개 제10-2021-73102호(공개일: 2021.06.18) (특허문헌 0003) - 특허공개 제10-2021-85323호(공개일: 2021.07.08)"}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 종래에 안출된 재난시 대피경로 안내시스템 및 안내방법의 단점을 극복하기 위해 안출된 것으로, 해 당 건축구조물의 구조 및 저항요소를 인공지능기법으로 모델링한 후 최신 정보를 실시간 반영하여 재난 발생시 대피경로 안내부의 부하를 줄이면서 재실자에게 신속하고 최적의 대피경로를 제공할 수 있도록 하는 인공지능기반 건축구조물 내의 최적 대피경로 안내시스템 및 안내방법을 제공하고자 하는데 그 목적이 있다."}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위해, 본 발명에 따른 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템은 건 축구조물의 2차원 도면정보를 토대로 건축 구조물의 내부 구조정보를 획득하는 건축구조물의 내부구조 정보획득 부; 상기 건축구조물의 내부에 산재해 있는 재실자의 위치정보를 감지 또는 입력받는 재실자 정보획득부; 상기 건축구조물 실내외에 설치되어 재난발생을 감시하는 재난발생 감시부; 상기 건축구조물의 내부구조 정보획득부 에서 획득된 건축구조물의 내부구조 정보와 재실자 정보획득부에서 획득된 재실자 정보 및 재난발생 감시부에서 획득된 재난발생 신호를 송/수신하는 통신부; 상기 통신부를 통해 수신된 정보를 상기 재실자에게 대피경로 정 보를 제공하거나 재난 발생시 재실자가 대피경로 정보를 요청할 수 있도록 실내의 복수개소에 설치되거나 휴대 가능하도록 구성된 대피경로 정보제공부; 상기 건축구조물의 내부구조 정보획득부와, 재실자 정보획득부에서 획 득된 정보를 토대로 건축구조물의 내부 대피경로를 파악하고, 상기 재난발생 감시부를 통해 획득된 재난발생 신 호를 토대로 상기 대피경로 정보제공부로 최적 대피경로를 제공하는 대피경로 안내관리부;를 포함하고, 상기 대 피경로 안내관리부는, 상기 건축구조물의 내부구조 정보획득부와 재실자 정보획득부에서 획득된 건물구조 정보 와 재실자의 정보를 수신하여 저장 및 분류하고, 상기 저장 및 분류된 데이터를 학습하며, 상기 데이터 학습을 기반으로 재실자가 위치한 각 층별로 재실자의 이동동선과 내부 대피경로를 파악, 분석하고, 상기 데이터 학습 과 재실자 위치 및 내부 대피경로의 구조 분석결과를 토대로 각 층의 재실자 위치별 최적의 대피경로를 미리 예 측, 판단하고, 상기 재난발생 감시부에서 재난발생신호를 획득한 후 상기 대피경로 정보제공부를 통해 재실자의 대피로 안내요청시 또는 자동으로 상기 예측 및 판단결과를 토대로 재실자의 위치별로 최적의 대피경로 정보를 제공하며, 상기 대피경로를 미리 예측, 판단할 때, 재난 상황에 따라 각 층별 및 재실자의 위치별 분포현황, 재 실자의 이동동선 및 재실자의 이동동선에 위치한 이동장애 엘레먼트를 토대로 최적의 대피경로를 예측 및 판단 하도록 구성된다. 또한, 상기 대피안내 관리부는, 상기 데이터를 학습할 때 이용되는 이동장애 엘레먼트로 재실자의 인원 수, 통 로 폭, 재실자의 위치 또는 이동동선에서 출입구에 이르는 통로에 존재하는 벽체, 인공시설물, 도어, 계단, 출 입구까지의 거리 데이터를 포함하는 구성으로 이루어진다. 또한, 상기 대피안내 관리부는, 상기 데이터를 학습할 때, 건축구조물 내부의 주요 통로에 새로운 장비 또는 인 공시설물이 배치되면 그 새로운 장비 또는 인공시설물을 이동장애 엘레먼트로 추출하고, 추출된 이동장애 엘레 먼트를 기존의 학습모델에서 설정된 이동장애 엘레먼트의 구성에 추가하고, 추가된 신규의 이동장애 엘레먼트를 재학습하여 각 재실자의 위치별 최적의 대피경로를 예측, 판단하도록 구성된다. 한편, 상술한 목적을 달성하기 위한 본 발명에 따른 인공지능 기반 건축구조물 내의 최적 대피경로 안내방법은 건축구조물의 2차원 도면정보를 토대로 건축구조물의 내부구조 정보를 획득하는 단계; 상기 건축구조물의 내부 구조 정보획득단계에서 획득된 데이터 중 이동통로 상에 배치된 이동장애 엘레먼트 데이터를 획득하는 단계; 상 기 건축구조물을 이용하는 재실자의 실내 위치정보를 획득하는 재실자 실내 위치정보 획득단계; 상기 획득한 건 축구조물의 내부구조 정보와 이동장애 엘레먼트 데이터 및 재실자의 위치 데이터를 저장 및 분류하는 단계; 상 기 저장 및 분류된 데이터를 학습하는 단계; 상기 데이터 학습과 상기 파악된 이동장애 엘레먼트 결과를 토대로 재실자의 위치별 또는 이동 동선별로 대피경로를 미리 예측 및 판단하는 단계; 상기 건축구조물의 내외부에 설 치된 재난발생 감시부를 통해 재난발생 정보를 획득하는 재난발생정보 획득단계; 상기 재난발생정보 획득시 재 실자의 위치별 또는 이동 동선별로 상기 대피경로의 예측 및 판단결과를 토대로 각 재실자의 최단 대피경로를 산출하는 단계; 상기 재난발생정보 획득시 재실자가 휴대 또는 착용하거나 건축구조물의 내부에 배치된 대피경 로 정보제공부를 상기 산출된 대피경로 정보를 전송하여 재실자가 대피경로 정보제공부에서 제시된 대피경로를 통해 신속하고 안전하게 대피할 수 있도록 하는 대피 경로정보 전송단계를 포함하여 이루어진다. 특히, 상기 이동장애 엘레먼트 데이터를 획득하는 단계에서는, 이동통로상에 배치된 인공시설물의 특성에 따라 각각의 이동장애 엘레먼트별로 이동장애 가중치가 차등적으로 적용되어 분류 및 저장하고, 상기 대피경로를 미 리 예측 및 판단하는 단계에서는, 상기 이동장애 엘레먼트 데이터 획득단계에서 획득된 서로 다른 가중치를 갖 는 이동장애 엘레먼트 데이터를 이용하여 대피경로를 예측 및 판단하도록 구성된다. 또한, 상기 이동장애 엘레먼트 데이터 획득단계 및 대피경로 예측 및 판단단계는, 다수의 질점(노드)과 저항요 소를 토대로 유체의 효율적인 흐름과 분배를 평면적인 네트워크망으로 표시하는 수력학적 네트워크 모델링 기법 이 적용된 특징으로 이루어진다."}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 인공지능 기반의 건축구조물 내의 최적 대피경로 안내시스템 및 안내방법은 건출구조 물의 2차원도면 정보를 바탕으로 건축구조물의 내부 구조에 대한 데이터를 획득하여 재실자의 위치에 따라 효율 적인 대피경로는 안내할 수 있도록 하여 재난발생시 재실자들이 안전하게 대피할 수 있도록 한다. 특히, 본 발명에서 재실자의 대피경로를 미리 예측 및 판단하는 과정에서 재실자의 각 위치에서 출입구까지 연 결되는 이동통로상에 배치되어 이동에 저항을 주는 이동장애 엘레먼트들의 특성에 따라 차등적으로 가중치가 부 여되어 재실자의 위치 및 이동동선에 따른 최적의 대피경로를 미리 예측 및 판단하게 되어 재난발생시 다수의 재실자가 한 곳으로 몰려 대피시간이 증가하는 것을 줄임으로써 인명피해가 발생되는 것을 최소화할 수 있도록 한다."}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 건축구조물 내에서 재난 발생시 수력 네트워크 모델링 기법을 이용한 최적의 대피경로를 찾아 각 층 의 재실자들에게 안내하는 시스템 및 안내방법(이하, “대피경로 안내 시스템 및 안내방법”으로 약칭함)에 관 한 것이다. 본 발명의 구체적인 실시예를 설명하기에 앞서 본 발명에서 이루고자 하는 최적의 대피경로를 찾는 방법에 이용 되는 수력 네트워크의 모델링의 개념 및 그 적용 기법에 대해서 간단히 설명한다. 본 발명은 사무실, 복합 쇼핑센터, 쇼핑몰 등 다층으로 이루어지는 다중 복합시설물(이하, 건축구조물로 통칭함)에 적용하기 위한 대피경로 안내시스템 및 안내방법에 관한 것으로, 특히 건축구조물 내부에 존재하는 다수의 벽체, 도어, 계단, 통로, 창문, 출입구 및 기타 내부 시설물 등(이하, ‘이동장애 엘레멘트’라 칭함)을 2차원 도면으로부터 추출하여 수력네트워크 모델에 적용되는 복수개의 질점(노드)과 유로를 표시하는 형태로 도 식화한 네트워크망을 구성하되, 상기 복수의 이동장애 엘레멘트들이 갖는 특성 즉, 공간을 차지하는 면적, 크기 등을 대피시 이동장애 요소로 산정하고, 재실자의 이동위치 및 이동 동선에 따라 상기 이동장애 엘레먼트들에 서로 다른 크기의 가중치를 부여하여 건축구조물 내부의 이동통로와 각 엘레먼트 및 출입구를 연결되는 선으로 표시하는 네트워크망을 모델링하여 재실자의 위치에 따라 최적 또는 최단의 이동동선인 대피경로를 찾을 수 있 는 방법을 제시할 수 있도록 한다. 일례로, 건축구조물에 기반한 대피경로를 산정하고자 할 경우 텅빈 공간의 양측에 출입구가 있는 경우와, 다수 의 벽체와 그 벽체들 사이에 위치한 도어 그리고 그 벽체나 도어로 인해 분할된 또 다른 공간의 벽체와 통로가 구성된 구조물의 내부에 마련되는 대피경로는 서로 다를 수 밖에 없을 것이다. 그 이유는 텅빈 공간의 경우 출입구와 재실자가 위치한 공간에 마련된 도어 사이의 거리가 대피경로를 찾는데 중요한 요인이 되나, 다수의 벽체와 그 벽체 사이에 위치한 도어의 수, 그리고 각 벽체와 도어로 분할된 또 다 른 공간들의 벽체와 통로, 계단, 내부시설물 등이 구비된 건축구조물에서 재실자가 위치한 특정공간에서 출입구까지 연결하는 대피경로에서 중간에 위치한 도어나 벽체, 내부 시설물의 종류나 갯수 및 이동거리 등이 대피하 는데 하나의 이동장애 엘레먼트가 될 수 있기 때문에 재실자에게 최적의 대피경로를 안내하는데 있어서 이들 건 축구조물 내부에 존재하는 다수의 이동장애 엘레멘트가 대피자에게 저항요소로 작용하게 된다. 특히, 건축 구조물의 내부가 단순한 경우보다 건축 구조물의 내부가 복잡하고 다양한 공간들로 분할되어 다수의 벽체와 도어, 통로에 배치되는 내부 시설물 등이 존재하는 대형 건물이나 다중이용 집합시설 등에서는 건축구조 물 내부에서 재난상황 발생시 재실자들의 효율적인 대피를 위해 복잡한 내부 구조나 실내 시설물을 피해 최적의 대피경로를 산출할 수 있는 체계적인 방법을 찾기 위해 본 발명에서는 이동통로상에 구비된 이동장애 엘레먼트 에 서로 다른 가중치를 부여하여 수력네트워크 모델 형태를 이용하는 대피경로 안내방법을 제시하도록 한다. 즉, 수력 네트워크 모델에서 다수의 노드(node)와, 각 노드를 연결하는 유로(流路)인 선(line)은 본 발명이 적 용되는 건축구조물 내의 이동통로 상에 존재하게 되는 각종 장애물(본 발명에서는 ‘이동장애 엘레멘트’로 표 시함)과 재실자가 위치한 공간에서 출입구까지의 이동동선으로 표현되고 있다. 특히, 본 발명은 특정 건축구조물의 2차원 도면을 토대로 내부구조를 복수의 노드와 이동장애 엘레멘트로 단순 화하여 전체 건축구조물의 평면 네트워크를 구축한 후에 일정 주기별로 기 구축된 네크워크를 업데이트시켜 현 실적인 네트워크망을 구축하고, 구축된 네트워크의 각 노드 및 이동장애 엘레멘트들이 갖는 저항요소에 비례해 서 서로 다른 가중치를 부여하여 재실자가 위치한 장소에서 출입구까지 최단 이동동선을 찾아 최적의 대피경로 를 산출, 재실자에게 제공할 수 있는 방법을 제공한다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예에 따른 최적대피경로 안내시스템 및 그 안내방법에 대하여 상 세하게 설명한다. 본 발명의 상세한 설명에서 사용되는 용어는 발명의 구성 기능을 고려하여 당 업계에서 널리 사용되는 일반적인 용어를 사용하고 있으며, 그 용어의 의미는 상세한 설명 전반에 걸친 내용을 토대로 해석된다. 도 2는 본 발명의 실시예에 적용되는 다층 건축구조물의 평면 구조도의 일례를 도시하고 있다. 그리고, 도 3은 도 2의 다층 건축구조물의 평면 구조를 수력네트워크 모델로 도시한 일 실시예이고, 도 4는 본 발명의 실시예에 따른 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템의 주요 구성을 블럭도로 간략 하게 도시하고 있다. 도 4에 도시된 바와 같이, 본 발명의 실시예에 따른 대피경로 안내시스템은 건축구조물의 내부 구조에 대 한 정보를 도 2에 도시된 바와 같이 해당 건축구조물의 2차원 설계도면을 바탕으로 필요한 건축구조물의 내부구 조 정보가 입력되는 건축구조물 내부구조 정보획득부와, 상기 건축구조물의 내부에 근무하거나 이용하는 재실자의 위치정보를 획득하기 위한 재실자 정보획득부와, 건축구조물의 내외측에서 설치되어 건축구조물 에서 발생되는 각종 재난상태를 감시 및 파악하기 위한 재난발생 감시부 및 상기 각 정보획득부와 재난발 생 감시부에서 입력되는 정보를 송수신하는 통신부, 그리고 통신부를 통해 수신되는 각종 정보를 토 대로 건축구조물의 재난상태 파악 및 재난상태 발생시 재실자의 위치별로 가정 최적의 대피경로를 산출, 제공하 는 대피경로 안내부를 포함한다. 여기서, 상기 건축구조물 내부구조 정보획득부는 해당 건축구조물의 평면도에 표시된 건축구조물의 구조도 를 스캔 또는 수동 입력할 수 있는 스캐너 또는 컴퓨터 장치를 포함할 수 있다. 상기 건축구조물 내부구조 정보획득부에서 획득되는 건축구조물의 내부 구조정보는 컴퓨터 프로그램을 통 해 2D모델링 및 디지털작업을 통해 수력학적 네트워크 모델을 구성할 수 있는 형태로 데이터의 변환 및 처리가 이루어진다. 또한, 상기 재실자 정보획득부는 건축구조물 내부에서 업무를 보는 통상의 재실자 및 수시로 출입하는 재 실자의 실시간 위치를 획득할 수 있는 인체감지장치로, 동적감지 센서, 이미지 센서, 적외선 센서, GPS 센서 및 이들을 포함하는 통합센서 중 어느 하나를 포함하는 구성으로 이루어져 재실자의 정보를 실시간으로 획득할 수 있도록 구성된다. 물론, 상기 재실자 정보획득부는 건축구조물의 내부에서 한 곳 이상 설치되고, 또한 각 층별 주요 통로나 공간에 배치되어 내부의 인원 수를 효과적으로 파악할 수 있도록 구성되는 것이 바람직하다. 또한, 상기 재실자 정보획득부는 재실자가 착용 가능한 웨어러블 장치, 개인식별카드, 출입구에 설치되는 생체인식센서 중 어느 하나를 포함할 수 있다.그리고, 상기 재난발생 감시부는 건축구조물의 내부에서 발생되는 재난을 감시하는 실내 재난감시부 와, 건축구조물의 외부에서 발생되는 재난을 감시하는 실외 재난감시부를 포함한다. 상기 실내 재난감시부와 실외 재난감시부는 건축구조물의 내외부에 설치되어 각종 재난상태를 감시하 기 위한 센서장치로, 일례로 온도센서, 화재감지센서, 조도센서, 가스센서, 전력감지센서, 충격센서, 측위센서, 먼지센서 중 어느 하나 이상을 포함하지만, 이에 한정되지는 않는다. 그리고, 상기 통신부는 건축구조물의 기본정보와 재실자 정보 및 건축구조물의 내외부에 설치된 재난발생 감시부에서 획득된 정보를 대피경로 안내부로 송수신하기 위한 장치로, 유무선 이동 통신모듈, 무선 인테 넛 모듈, 근거리 통신모듈, 위치정보 모듈 중 어느 하나 이상을 포함한다. 상기 통신부의 통신모듈, 즉 이동통신 모듈, 무선 인터넷기술, 근거리 통신모듈 등은 기존에 널리 사용되 는 통신기술로, 각각의 통신모듈에 따라 통신을 수행하기 위한 기술표준 및 통신방식이 채택되어 기 구축된 통 신망을 거쳐 외부의 단말기나 관리서버로 무선신호를 송수신할 수 있도록 구성되며, 본 발명의 상세한 설명에서 는 기 공지된 다양한 통신방식 및 통신모듈에 대한 자세한 설명은 생략한다. 상기 무선신호는 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태의 데이터를 포함하여 송수신이 이루어질 수 있도록 구성된다. 그리고, 상기 위치정보 모듈은 사용자의 이동단말기 위치(또는 현재 위치)를 획득하기 위한 모듈로, GPS모듈, 와이파이 모듈, 비콘 모듈 등이 포함될 수 있다. 일례로, 재실자의 이동단말기는, GPS모듈을 활용하면, GPS위성에서 보내는 신호를 이용하여 자신의 위치를 획득 하고, 획득한 자신의 위치 정보를 통신부를 통해 대피경로 안내부로 제공할 수 있다. 또한, 재실자의 이동단말기에 구비된 와이파이 모듈을 활용할 경우, 와이파이 모듈과 무선신호를 송신 또는 수 신하는 무선 AP(Wireless Access Point)의 정보에 기반하여, 자신의 위치를 획득하고, 획득한 자신의 위치 정보 를 통신부를 통해 대피경로 안내부로 제공할 수도 있다. 또한, 본 발명의 실시예에 따른 대피경로 안내시스템은 견축구조물의 내부 곳곳에 설치 또는 비치되어 있 는 대피경로 정보제공부를 더 포함할 수 있다. 상기 대피경로 정보제공부는 상기 통신부를 대피경로 안내부에서 수신된 대피경로 데이터를 수 신하는 대피경로 수신부와, 재실자가 대피경로 안내부로 대피경로를 요청하는 대피경로 요청부 로 구성될 수 있으며, 수신된 대피경로를 음성 또는 2차원/3차원 영상으로 재실자에게 보여줄 수 있는 스피커 일체형 모니터가 구비된 형태로, 재실자가 소지하는 휴대용 통신기기 뿐만 아니라 건축구조물의 벽체에 설치된 고정식 타입 또는 재실자가 임의로 탈거하여 휴대할 수 있는 휴대용 타입, 일례로 랩탑컴퓨터, 태블릿 PC 등으 로 구성될 수 있다. 한편, 상기 대피경로 안내부는, 수신된 건축구조물의 내부구조 정보, 재실자의 위치정보, 재난발생 정보에 대한 데이터를 저장하는 데이터 저장부와, 수신된 건축구조물의 내부구조 정보, 재실자의 위치정보, 재난 발생 정보에 대한 데이터를 분류하는 데이터분류부와, 저장 및 분류된 데이터를 학습하는 학습부와, 데이터 학습을 기반으로 각 층별 내부구조, 이동장애 엘레먼트, 재실자의 위치, 재난발생 데이터를 분석하는 분 석부와, 데이터 학습과 각 층별/재실자의 위치별 분석결과를 토대로 최적의 대피경로를 미리 예측 및 판단 하는 대피경로 예측/판단부와, 대피경로 예측/판단 결과를 토대로 재난상태 발생시 대피경로 제공부로 대 피경로 정보를 제공하도록 관리하는 제어관리부를 포함한 구성으로 이루어진다. 또한, 상기 대피경로 안내부는, 상기 분석부를 통해 파악된 대피경로나 재실자의 위치별 현황 등을 평면적 또는 입체적 정보로 실시간 표시하는 모니터링부를 더 포함할 수 있다. 그리고, 상기 대피경로 안내부의 학습부는 인공 신경망(ANN: Artificial Neural Network)을 이용하 여 데이터를 학습할 수 있도록 구성된다. 여기서 인공 신경망(ANN)은, 한 개의 입력레이어와 출력레이어 사이에 다수의 은닉층(hidden layer)으로 구성된 심층 신경망(Deep Neural Network, DNN)을 의미한다. 일례로, 상기 심층 신경망(Deep Neural Network, DNN)은. 합성곱 신경망(CNNs: Convolutional Neural Networks), 순환 신경망(RNNs: Recurrent Neural Networks), 심층 신뢰 신경망(DBN : Deep Belief Network),심층 오토인코더(deep autoencoder) 등을 포함할 수 있으며, 이에 한정되지는 않는다. 또한, 상기 학습부에서 이루어지는 학습방식은 지도학습(supervised learning), 준 지도학습(Semi- Supervised Learning), 비 지도학습(Unsupervised Learning) 중 어느 하나의 방식을 이용하여 학습이 이루어진 다. 여기서, 인공 신경망의 학습은, 출력의 오류를 최소화하기 위한 것으로, 반복적으로 학습 데이터를 인공 신경망 에 입력시키고 학습 데이터에 대한 인공 신경망의 출력과 목표치의 에러를 계산하며, 에러를 줄이기 위한 방향 으로 인공 신경망의 에러를 인공 신경망의 출력 레이어에서부터 입력레이어 방향으로 역전파(Backpropagation) 하여 인공 신경망의 각 노드의 가중치를 조정하는 방법이 이용될 수 있다. 따라서, 상기 대피경로 안내부의 학습부는, 데이터를 학습할 때 수력네트워크 모델의 저항요소로 사 용되는 건축구조물의 각 층별 내부 통로의 길이, 통로에서 벽체에 의해 구분된 공간을 출입하기 위한 도어의 수, 통로에 위치하는 이동장애 엘레먼트의 수 및 크기, 재실자의 위치에서 출입구까지의 거리, 계단의 수, 재실 자의 수에 관련된 데이터를 학습할 수 있다. 또한, 상기 학습부에서 데이터를 학습할 때, 건축구조물의 각 층별 재실자의 위치별, 재실자의 인원 수별, 통로에 존재하는 이동장애 엘레먼트의 종류별 최적의 대피경로를 학습할 수 있다. 또한, 상기 학습부에서 데이터를 학습할 때, 이동통로에 설치된 이동장애 엘레먼트의 수와 종류, 이동장애 엘레먼트가 차지하는 이동통로의 면적에 대응하여 서로 다른 가중치를 부여하여 최적의 대피경로를 산출 및 예 측하는 것을 학습할 수 있다. 또한, 상기 학습부에서 데이터를 학습할 때, 각 층의 밀폐된 공간에 위치하는 재실자, 각 층의 이동통로에 위치하는 재실자를 포함하는 제1조건 중 어느 하나와, 각 층의 이동통로에 존재하는 이동장애 엘레먼트의 종류, 이동장애 엘레먼트의 수, 이동통로의 중간 지점에서 출입구까지의 거리를 포함하는 제2조건 중 어느 하나가 상 호 중첩되는 각각의 상황에서 최적의 대피경로를 산출 및 예측하는 것을 학습할 수 있다. 또한, 상기 학습부에서 데이터를 학습할 때, 재실자의 총 인원 수, 재실자의 위치에 상응하는 서로 다른 최적의 대피경로를 미리 예측하는 것을 학습할 수 있다. 또한, 상기 학습부에서 데이터를 학습할 때, 파악된 재난상황의 종류, 위치, 재난발생 경과시간에 대응하 여 각 층별 재실자의 위치에 따른 최적의 대피경로를 미리 예측하거나 산출하는 것을 학습할 수 있다. 그리고, 상기 대피경로 안내부의 분석부는 대피경로의 예측 및 산출할 때, 각 층의 재실자의 인원 수 와 대피경로의 폭, 출입구까지의 거리, 대피경로의 이동통로 또는 출입구 주변에 존재하는 이동장애 엘레먼트의 종류와 갯수에 따라 별도로 가중치가 부여하여 각 층별 최적의 대피경로를 통합적으로 분석할 수 있다. 또한, 대피경로 안내부의 예측/판단부는, 대피경로를 미리 예측/판단할 때, 데이터 학습과 재실자의 인원 수 및 이동장애 엘레먼트의 종류와 갯수의 분석결과를 토대로 재실자의 이동 동선을 미리 예측 판단하고, 각 층별 실시간 대피경로를 예측 및 판단할 수 있다. 또한, 상기 대피경로 안내부의 예측/판단부는, 대피경로를 미리 예측/판단할 때, 데이터 학습과 재실 자의 인원 수 및 이동장애 엘레먼트의 종류와 갯수의 분석결과를 토대로 재난상황에 따른 최단의 대피경로를 예 측 및 판단하고, 재난상황에 따른 각 층별 최적의 대피경로를 예측 및 판단할 수 있다. 한편, 상기 대피경로 안내부의 대피안내 제어부는, 대피경로의 예측 및 판단결과 각 층의 재실자의 인원 수가 기준치 이하일 경우, 각 층의 주 출입구로 대피할 수 있도록 대피경로를 안내할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 대피경로의 예측 및 판단결과 각 층의 재실자의 인원 수가 기준치를 초과할 경우, 각 층의 주 출입구 뿐만 아니라 보조 출입구로 분산 대피할 수 있도록 대피경 로 안내를 제어할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 대피경로의 예측 및 판단결과 각 층의 재실자의 인원 수가 기준치를 초과할 경우, 재실자의 위치별로 서로 다른 대피경로를 이용하여 대피할 수 있도록 제어할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 대피경로의 예측 및 판단결과 각 층의 주 이동통 로상에 이동장애 엘레먼트가 존재하여 정상적인 이동속도로 대피가 어려울 것으로 예측되는 경우, 재실자의 위치별로 서로 다른 출입구로 분산 대피할 수 있도록 대피경로 안내를 제어할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 대피경로 예측 및 판단결과를 토대로 재실자가 대 피하려고 하는 출입구에 이동장애 엘레먼트가 존재하거나 폐쇄된 경우, 대체 대피경로로 대피하도록 제어할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 재난상황이 발생된 해당 층에 우선적으로 대피경 로를 안내하여 대피가 이루어지도록 안내 및 제어하고, 재난상황이 발생된 해당 층에 인접된 층부터 차례대로 대피경로 안내가 순차적으로 이루어지도록 우선순위 정보를 생성하여 안내 및 제어할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 재난상황이 발생하여 각 층으로 대피경로 안내를 할 때, 외부의 구조기관이나 관리자측으로 재난상황 발생신호를 전송하도록 상기 통신부를 제어할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 재난상황이 발생하여 각 층으로 대피경로 안내를 할 때, 대피 안내 메시지 또는 대피경로 이미지 정보를 각 층에 구비된 대피경로 정보제공부로 전송하도록 상기 통신부를 제어할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 대피 안내 메시지 또는 대피경로 이미지 정보를 각 층에 구비된 대피경로 정보제공부로 전송할 때, 재실자의 숫자나 이동장애 엘레먼트의 갯수의 분석결과 를 토대로 재실자 맞춤형 대피경로 정보를 생성 및 제공할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 대피 안내 메시지를 생성, 제공할 때 재실자의 위치, 재실자의 인원 수에 따라 문자, 음성(소리), 빛(광원), 진동 중 어느 하나를 생성, 제공할 수 있다. 또한, 상기 대피경로 안내부의 대피안내 제어부는, 대피 안내 메시지를 생성 및 제공할 때, 재난이 발생된 해당층과 다른 층으로 제공되는 안내 메시지의 내용을 각각 다르게 생성, 제공하여 각 층별로 안전하고 효율적인 대피가 이루어질 수 있도록 할 수 있다. 그리고, 상기 대피경로 안내부의 대피안내 제어부는, 데이터를 학습할 때 각 층의 재실자의 인원 수 가 증가됨에 따라, 기 학습된 모델에 인원 수가 증가된 데이터를 재학습하여 대피경로 예측 및 판단을 하고, 강 화된 데이터를 토대로 예측 및 판단된 대피경로로 재실자가 대피할 수 있도록 분석 및 안내할 수 있다. 이와 더불어, 상기 대피경로 안내부의 대피안내 제어부는, 각 층별 재실자의 인원 수에 따른 최적의 대피경로를 예측 및 판단할 때, 실내의 환기장치를 자동으로 제어할 수 있다. 이와 같이, 본 발명은 각 층의 재실자의 인원 수 및 변화된 인원 수에 따라 기 설정되거나 미리 예측된 학습데 이터에 새로운 데이터를 추가하여 재학습이 이루어지도록 함으로써 재실자의 인원 수에 따라 대피경로의 안내 및 정보제공이 더욱 효율적으로 이루어질 수 있도록 한다. 또한, 본 발명은 인공지능을 이용하여 재실자의 인원 수에 따른 건축구조물의 파악된 실내구조 및 이동통로상에 존재하는 이동장애 엘레먼트의 종류나 크기, 재실자의 위치, 재실자의 이동동선에 따른 학습데이터를 바탕으로 재실자의 대피경로를 효율적으로 분산, 안내하여 재난상황 발생시 인명피해가 최소화될 수 있는 안전한 대피경 로를 예측 및 판단하여 안내가 이루어질 수 있도록 한다. 또한, 본 발명은 재난상황이 발생된 층과 재실자의 인원수, 재실자의 분포현황 등을 감안하여 긴급순위별로 차 등화하여 재난상황 안내 및 대피경로 안내가 이루어질 수 있도록 하여 다중집합 건축물에서 다수의 인원이 동시 에 대피함으로써 발생될 수 있는 각종 안전사고 발생 위험을 줄일 수 있도록 한다. 도 5는 본 발명의 일 실시예에 따른 인공지능 기반 건축구조물 내의 최적 대피경로 안내방법을 설명하기 위한 플로우차트를 간단하게 도시하고 있다. 도 5에 도시된 바와 같이, 본 발명의 일 실시예에 따른 최적 대피경로 안내방법은, 먼저, 건축구조물의 내부 구 조에 관한 기본적인 정보를 획득하고, 재실자의 정보를 획득한다(S100). 상기 건축구조물의 내부 구조정보 획득은, 건축구조물의 평면 설계도를 바탕으로 획득되거나 건축구조물의 사용 중 실시간 업데이트되는 건축 구조물의 내부구조에 대한 정보를 수력네트워크 모델에 적용되는 각각의 구성요소, 즉 각 층별 공간구조 정보와 이동통로, 도어, 계단, 내부 시설물 등 건축구조물의 내부 대피경로 상에 존재하는 이동장애 엘레먼트에 대한 기본적인 정보 뿐만 아니라 시공 후 변경되는 건축구조물의 실내 구조정 보를 더 포함할 수 있다. 또한, 상기 재실자의 정보획득은, 각 층별 상주하는 재실자의 수, 비상주 인원의 재실현황 및 재실자의 이동동 선 등에 대한 정보를 획득할 수 있다. 이러한 재실자의 정보획득은 각 층에 설치된 재실자 정보획득부, 즉 재실자의 움직임이나 형체를 감지할 수 있 는 이미지센서, 적외선 센서, CCTV, GPS센서 중 어느 하나 이상으로 이루어지는 재실자 정보획득부를 통해 재실 자의 상태 파악이 이루어진다. 이어, 본 발명은 획득한 건축구조물의 실내 구조정보 및 재실자 정보에 대한 데이터를 저장 및 분류하게 되고 (S110), 저장 및 분류된 데이터를 수력네트워크 모델을 통해 학습하는 과정이 이루어진다(S120). 상기 학습과정(S120)에서 이루어지는 내용은, 각 층별 실내 공간구조, 이동통로의 거리와 폭, 즉 각 실에서 출 입구까지의 거리, 각 실에서 출입구에 이르는 이동통로상에 존재하는 이동장애 엘레먼트의 종류와 특징을 학습 할 수 있다. 다음으로, 수력네트워크 모델에 기반한 데이터 학습을 토대로 각 층별 또는 호실별로 재실자의 위치 및 이동동 선을 분석하고, 각 층별 및 호실별로 재실자의 파악 및 건축구조물의 내부 구조 상태를 파악 및 분석할 수 있다 (S130). 또한, 상기 데이터 학습을 기반으로 각 층별로 재실자의 이동 동선에 존재하는 이동장애 엘레먼트의 종류와 특 징에 따라 이동장애요소로 작용할 수 있는 가능성을 파악 및 분석할 수 있다. 또한, 상기 데이터 학습을 기반으로 건축구조물 내부에서 벽체로 분리된 각 실별 도어의 배치구조나 개폐방식을 토대로 이동통로로 이어지는 대피경로 및 이동통로를 거쳐 출입구로 이어지는 대피경로에 대한 이동동선을 파악 및 분석할 수 있다. 또한, 상기 데이터 학습을 기반으로 각 층의 재실자들에게 적합한 대피안내 메시지 및 대피경로 영상을 선택적 또는 차별적으로 제공할 수 있다. 다음으로, 데이터 학습과 재실자 파악 및 건축구조물의 내부구조 파악 및 분석결과를 토대로 각 층별로 재난 발 생시 제공될 대피경로를 미리 예측 및 판단할 수 있다(S140). 상기 대피경로의 예측 및 판단과정(S140)에서는, 데이터 학습과 재실자 파악 및 건축구조물의 내부구조 파악 및 분석결과를 토대로 각 층별 재실자의 분포 현황 및 재실자의 이동동선을 예측 판단하고, 이동통로 상에 존재하 는 이동장애 엘레먼트의 수나 공간의 점유면적, 각 실에서 출입구까지의 거리에 따른 이동장애 엘레먼트별 이동 장애 가중치를 미리 예측 및 판단할 수 있다. 본 발명은 재난의 종류나 발생 위치별로 각 층의 재실자들이 최적의 이동통로를 경유하여 대피할 수 있는 대피 경로 우선순위를 예측 및 판단할 수 있도록 한다. 또한, 본 발명은 데이터 학습과 재실자 파악 및 건축구조물의 내부구조 파악 및 분석결과를 토대로 이동통로상 에 존재하는 이동장애 엘레먼트의 종류와 특징에 따라 각각의 이동장애 엘레먼트별로 서로 다른 이동장애 가중 치를 부여하여 각 층의 재실자 위치별로 출입구까지의 이동동선 및 각 실에서 출입구까지의 최단시간에 대피할 수 있는 대피경로를 미리 예측 및 판단할 수 있다. 이와 같은 데이터학습과 각 층별 대피경로를 미리 예측/판단하고 있다가 재난감지부를 통해 일정한 신호가 수신 되면, 재난발생 여부를 판단(S150)하여 재난 발생이 이루어진 것으로 판단된 경우, 상기 예측 및 판단된 각 층 별 대피경로를 각 층의 재실자에게 안내가 이루어지게 된다(S160). 물론, 재난발생 감지부에서 수신된 신호의 분석결과 재난발생이 아니라고 판단된 경우에는, 상술한 학습모델을 이용한 데이터 학습이 반복되고, 새로운 정보가 입력된 경우 강화된 학습을 통해 각 층별 대피경로에 대해 미리 예측/판단하는 과정이 반속 수행되면서 재난 발생에 대해 대비하게 된다. 상기 대피경로 안내(S160)는, 재난 상황이 발생하면 각 층별로 재실자 원원 수, 재실자의 이동동선 정보를 토대 로 알림 메시지를 생성하여 재실자의 휴대용 통신기기나 각 층에 비치된 대피경로 정보제공부로 대피경로 정보 를 전송할 수 있다. 특히, 재난상황이 발생된 경우, 재난이 발생된 해당 층의 재실자에게 가장 먼저 대피경로 안내가 이루어질 수 있도록 하고, 그 다음으로 재난이 발생된 층과 가장 인접한 층부터 차례대로 대피경로 안내가 이루어질 수 있도 록 할 수 있다. 여기서, 각 층별로 파악된 대피경로 예측 및 판단 결과를 토대로 재실자의 인원이 가장 많은 층, 재실자의 이동 분포가 가장 많은 층, 이동통로 상에 존재하는 이동장애 엘레먼트가 가장 많은 층을 포함하는 제1조건 중 어느 하나와, 재난이 발생한 해당 층에서 가장 가까운 층, 대피경로가 가장 긴 층, 출입구가 가장 적은 수의 층을 포 함하는 제2조건 중 어느 하나가 상호 중첩되는 상황별로 각 층의 대피경로 안내에 대한 우선순위가 정해져 안내 가 이루어질 수 있다. 또한, 본 발명은 재난상황 발생시 외부 구조기관으로 재난발생 알림메시지나 영상을 전송하고, 구조대원들에게 각 층의 재실자들이 대피하는 대피경로를 안내하여 신속한 구조작업이 이루어질 수 있도록 하며, 재난 발생에 따른 대피경로 안내 후에는 재난상황이 해제될 때까지 대기상태가 유지되거나 대피경로 안내를 종료하게 된다 (S170). 이와 같이, 본 발명은 인공지능을 이용하여 건축구조물의 내부 구조와 재실자의 수, 재실자의 이동동선, 이동장 애 엘레먼트의 종류와 수에 따라 각 층별로 각각 다른 대피경로 안내가 이루어지도록 함으로써 신속하고 안전한 대피가 이루어질 수 있도록 한다. 도 6은 본 발명의 변형 실시예에 따른 일시에 최적 대피경로 안내방법에 대한 흐름도이다. 본 발명의 변형 실시예에 따른 최적 대피경로 안내방법은, 건축구조물의 기본정보를 정보획득부를 통해 기본정 보 획득이 이루어진다(S200). 본 발명에 이용되는 기본정보는, 건축구조물 내부구조에 대한 정보와, 건축구조물 내에 잔류하는 재실자의 인원 수 및 상주인원의 기본적인 이동동선이 포함될 수 있다. 재실자 정보는 재실자 정보획득부를 통해 이루어지게 되며, 재실자 정보 획득부는 실내에 설치된 각종 센서나 카메라 및 건축구조물 내부구조 정보획득부를 통해 내부구조 획득시 상주할 재실자 인원정보가 함께 획득될 수 있다. 또한, 상기 건축구조물 내부구조 정보는, 건축구조물에 대한 평면 설계도를 바탕으로 각 층별 실내공간구조, 즉 벽체, 벽체로 구비된 공간, 도어, 이동통로, 출입구, 이동통로상에 존재하는 이동장애 엘레먼트 등이 포함될 수 있으며, 이러한 건축구조물 내부구조 정보는 스캐너장치를 이용한 평면 정보와, 평면 구조도를 컴퓨터 프로그램 을 통해 입체적인 3차원 정보로 변환된 상태로 획득할 수 있다. 이어, 본 발명은 획득된 기본정보를 분류 및 저장하고(S210), 분류 및 저장된 정보에 대해 학습모델을 통해 인 공지능 학습을 수행한다(S220). 또한, 상기 기본정보로 입력된 상주 인원보다 많은 재실자가 있는 경우, 비상주 재실자 정보를 추가로 획득할 수 있고(S230), 실내에 배치된 이동장애 엘레먼트가 추가된 경우, 추가된 이동장애 엘레먼트 정보를 획득할 수 있다(S240). 상기 추가로 획득된 재실자정보와 이동장애 엘레먼트 정보와 학습모델에서 설정된 분류기준을 토대로 기 설정된 분류기준을 재설정하여 강화된 학습을 수행할 수 있다(S250). 이와 같이 강화된 학습을 토대로 각 층별 재실자의 인원 수, 이동장애 엘레먼트의 수를 파악하여 각 층별 재실 자의 인원 수 및 이동동선에 따른 대피경로를 미리 예측/판단(S260)하는 과정이 반복적으로 이루어지게 된다. 이와 같은 데이터 학습과 강화된 학습을 통해 대피경로를 미리 예측/판단하고 있는 상태에서 재난발생 감시부에 서 일정한 신호가 수신될 경우, 그 수신된 신호를 분석하여 재난발생 여부를 판단(S270)한 후, 재난발생으로 판 단될 경우 기존에 학습된 정보에 재난발생 감지정보를 업데이트하여 신속하게 각 층에 구비된 대피경로 정보제 공부 또는 각 재실자가 휴대하고 다니는 휴대용 통신기기로 대피경로를 안내할 수 있도록 한다(S280). 즉, 본 발명은 건축구조물의 기본적인 실내 구조정보와 재실자의 인원 수 및 재실자의 이동동선에 따른 대피경 로를 미리 예측/판단하여 재난 발생시 각 층에 비치된 대피경로 정보제공부나 각각의 재실자가 휴대하고 다니는 휴대용 통신기기로 대피경로를 안내할 수 있게 된다. 또한, 최초 획득한 기본정보 이외에 추가로 비상주 인원이 증가하거나 이동장애 엘레먼트가 추가되는 경우, 기 설정된 학습모델의 강화학습을 통해 대피경로를 예측/판단하여 재실 인원이나 이동장애 엘레먼트에 대응하는 대 피경로를 산출/제공할 수 있도록 함으로써 재실자의 안전한 대피가 이루어질 수 있도록 한다. 본 발명은 상기 대피경로를 안내할 때, 재실자의 인원 수가 기 설정된 기준을 초과하거나 이동통로에 이동장애 엘레먼트가 추가되어 이동장애 가중치가 증가된 경우, 재실자를 분산시켜 대피할 수 있는 대피경로를 제공할 수 있게 되어 재난 발생시 인명피해가 발생하는 것을 최소화할 수 있도록 한다. 또한, 상기 대피경로 안내시, 재실자 뿐만 아니라 외부의 구조기관으로 재난발생 및 재실자의 대피경로 정보를 제공하여 효과적인 구난작업이 이루어질 수 있도록 할 수 있도록 하며, 대피경로 안내 후에는 대기상태로 전환 되거나 시스템이 종료(S290) 된다. 한편, 상술한 본 발명의 건축구조물 내의 최적 대피경로 산출 및 안내에 이용되는 수력네트워크 모델은 건축 구 조물의 내부 구조 및 이동장애 엘레먼트의 종류 등에 따라 도3과 같은 네트워크 모델(도 3에서 원형 표시는 이 동장애 엘레먼트, 직선은 이동장애 엘레먼트를 연결하는 통로를 의미함)로 표현할 수 있고, 이러한 수력네트워 크 모델 기법을 통해 건축 구조물의 각 층별 최적의 대피경로를 산출한 실시예에 대하여 도 7을 참고하여 이하 에서 간단하게 설명한다. 도 7은 간단한 건축구조물의 내부 단면을 도시하고 있는 것으로, 도 7에 도시된 바와 같이, 건축구조물의 실내 공간 중 재실자(P1)가 특정공간(SP1)의 임의의 위치에 있는 경우의 예를 들면, 특정공간(SP1)의 임의의 위치에 있는 재실자(P1)는 그 특정공간의 중심점(C1)에서 일정거리(S1) 떨어져 있다고 가정할 때, 재실자(P1)의 위치에 서 도어(RD1)까지의 거리는 S1+S2가 되고, 도어(RD1)에서 택할 수 있는 대피경로는 경로 1(Pt1)과 경로 2(Pt2)가 있다. 경로 1(Pt1)을 선택하게 되면 두 개 이상의 통로와 두 개 이상의 도어(RD1, RD2, …), 한 개 이상의 계단(RSt1)을 만나게 되어 이들이 대피에 지장을 주는 이동장애 엘레먼트로 작용하게 되고, 경로 2(Pt2)를 선택하게 되면 경로 1(Pt1)에 비해 통로의 길이는 다소 길지만 통과해야 할 이동장애 엘레먼트는 한 개의 도어(RD1), 한 개의 모퉁이 (방향턴), 출입구(RE1) 뿐이다. 따라서, 수력네트워크 모델링 기법을 이용하여 최단의 대피경로를 산출할 때, 각각의 경로에 대한 이동장애 엘 레먼트와 이동거리 등을 감안하여 최단시간에 대피할 수 있는 경로를 선택하여 재실자에게 안내가 이루어지도록 한다. 즉, 도 7에서 특정공간(SP1)에 위치한 재실자의 최단 대피경로 산출에 필요한 정보는 도어(RD1)까지의 거리 (S1+S2), 경로의 거리(L1, L2), 이동장애 엘레먼트 수가 될 것이고, 특히 이동장애 엘레먼트는 그 특성에 따라 이동에 장애를 주는 가중치가 다를 수 있기 때문에 본 발명에서는 건축구조물 내부구조에 위치한 이동장애 엘레 먼트의 종류별로 각각 별도의 가중치를 부여하여 대피경로 산출에 이용할 수 있도록 정의된다. 즉, 수력네트워크 모델링 기법을 이용하여 도 7의 경로 1(Pt1)과 경로 2(Pt2)에 대한 대피경로 산출 예는 아래와 같은 식으로 정의 될 수 있다. - 경로 1(Pt1)의 대피경로 산출식 경로 1(Pt1)="}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "= S1 + S2 + RD1 + 방향turn + L1 + RD2 + 방향turn + RSt1 + 방향turn + … RStn - 경로 2(Pt2)의 대피경로 산출식 경로 2(Pt2)= = S1 + S2 + RD1 + L2+ 방향turn+ L3+ RE1 으로 나타낼 수 있다. 여기서, R은 건축구조물의 내부구조의 형상패턴에 근거한 이동장애 엘레먼트, M은 재실자의 수를 의미하며, S1, S2 는 공간 내부에서 도어까지의 거리, L1,~ L3는 경로상의 거리를 의미한다. 또한, 대피경로 산출에 적용되는 이동장애 엘레멘트(R)는 각 특성에 따라 일정한 가중치가 가중된 상태를 의미 한다. 그 일례로, 도어의 경우,"}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "계단의 경우,"}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "출입구의 경우,"}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "창문의 경우,"}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "내부 시설물의 경우, 으로 표현할 수 있으며, 여기서 는 가중상수이다. 또한, 최초 건축구조물의 도면을 토대로 내부구조의 정보획득시 도면의 패턴인식 및 이동장애 엘레먼트의 설정 은 아래 표 1과 같은 정의를 통해 이루어지게 된다. 표 1 도면패턴 식별 기호 정의 대피경로 계산에 영향을 주는 물리량 벽(wall) Rwall 벽에 대한 저항 이동불가 도어(door) Rdoor 도어 등 출입구에 대한 정항 도어의 크기, 개방에 필 요한 시간 통로(corridor)Rcorridor복도 및 옥상과 같은 직선부로 이루 어진 통로에 대한 저항직선거리 계단(stairs)Rstair 계단부에 대한 저항 계단수, 계단높이 창문(window)Rwindow 창문에 대한 저항 이동가능성 시설물(facilities)Rfacility재실자 보행에 불편을 주는 통로에 설치된 시설물에 대한 저항설치시설물을 피해 이동 할 수 있는 경로의 폭과 거리 가스누설(gas leak)Rgas 가스발생에 대한 저항 가스오염 구역의 면적, 가스발생시간 화재발생(fire)Rfire 화재발생에 대한 저항 화재발생 구역 연기발생(smoke)Rsmoke 연기발생에 대한 저항 연기발생 구역 상하수도배관 등 수전문 제(water)Rwater 수전설비 문제에 대한 저항 수전부 사고구역 면적 방향전환(turn)Rturn 직선통로를 벗어난 방향전환에 대한 저항시간 및 회전반경 승강기(elevator)Relevator승강기 또는 완강기에 대한 저항이용가능성 또한, 상술한 여러가지 이동장애 엘레먼트가 수력학적 네트워크 모델에 적용하여 대피경로를 산출될 때 부여되 는 각 이동장애 엘레먼트별 가중치 부여기준은 아래 표 2과 같다.표 2 이동저항 엘레먼트 식별 기호 가중치 적용예 (가중치×저항요소)가중치() 범위 벽(wall) Rwall 0 도어(door) Rdoor 1.2~1.4 통로(corridor) Rcorridor 1.0 계단(stairs) Rstair 2.5~4.0 창문(window) Rwindow 2.2~2.7 시설물(facilities)Rfacility 3.1~4.0 가스누설(gas leak)Rgas 5.0 이상 화재발생(fire) Rfire 10.0 이상 연기발생(smoke) Rsmoke 10.0 이상 상하수도배관 등 수전문제(water)Rwater 4.0 이상 방향전환(turn) Rturn 1.3~1.8 승강기(elevator) Relevator 3.0 이상 상기 이동장애 엘레먼트 별로 부여되는 가중치는 건축 구조물의 내부 구조에 대한 일반인들의 반응시간을 고려 하여 산출된 것으로, 이들 가중치는 인공지능 딥러닝 기법으로 보다 정밀하게 세분화하여 형상이나 구조 등에 따라 부여할 수 있도록 구성될 수 있다. 한편, 도 7에서 공간(SP2), 공간(SP3), 공간(SP4)에의 경우도 재실자가 대피할 수 있는 통로는 경로 1(Pt1)과 경 로 2(Pt2)가 있으나, 각 공간에서 선택할 수 있는 대피경로는 서로 다르게 도출되는 것이 정상적이다. 그 이유는 각 공간에 위치한 재실자자 경로 1 또는 경로 2를 이용하여 대피할 때 대피시간을 결정하는 이동저항 엘레먼트가 다를 수 있기 때문이다. 즉, 각 공간에서 출입구까지 가는데 거쳐야 할 이동저항 엘레먼트 요소로 도어까지의 거리, 도어의 수, 방향전 환 수, 계단, 직선부의 거리 등에 따라 이동저항이 다르기 때문에 대피경로를 산출하는 과정에서 각 공간별 재 실자의 최단 대피경로는 상술한 이동저항 엘레먼트에 일정한 가중치가 부여되어 산출되기 때문이다. 따라서, 본 발명은 이러한 각각의 이동저항 엘레먼트 구성이 각 층별, 각 건물별, 각 층의 공간별로 수력네트워 크 모델이 구성되어 이동저항 요소가 가장 작은 경로로 재실자의 위치별 대피경로를 안내하게 되므로, 각 재실 자는 가장 짧은 시간이 결리는 대피경로로 안전하게 대피할 수 있게 된다. 이상에서 설명한 바와 같이, 본 발명의 실시예에 따른 건축구조물 내의 최적 대피경로 안내시스템 및 안내방법 에 의하면, 최초 입력된 건축 구조물의 내부구조에 대한 정보입력이 완료되면 설정된 수력네트워크 모델 기법이 적용된 인공지능 알고리즘을 통해 각 층별 및 각 공간별 최단 대피경로를 산출하고 있다가 특정 이벤트가 발생 시에 기존의 정보에 특정 이벤트 발생내용을 반영한 대피경로를 산출하도록 구성되기 때문에 대피경로 안내관리 부의 부하를 줄이고, 신속한 대피경로 산출을 통해 재실자에게 제공할 수 있는 장점이 있다."}
{"patent_id": "10-2021-0147134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "이상, 본 발명의 바람직한 실시예에 대해 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 들에 의해 본 발명의 기술적 사상의 범위 이내에서 다양한 변형 실시가 가능하다."}
{"patent_id": "10-2021-0147134", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 수처리 분야에서 사용되는 수력네트워크 모델을 도시한 일 실시예, 도 2는 본 발명의 실시예에 따른 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템에 적용되는 다층 건 축구조물의 평면 구조도의 일 실시예, 도 3은 도 2의 다층 건축구조물의 평면 구조를 수력네트워크 모델로 도시한 일 실시예, 도 4는 본 발명의 실시예에 따른 인공지능 기반 건축구조물 내의 최적 대피경로 안내시스템의 주요 구성 블럭도, 도 5는 본 발명의 일 실시예에 따른 인공지능 기반 건축구조물 내의 최적 대피경로 안내방법을 설명하기 위한 플로우차트, 도 6은 본 발명의 변형 실시예에 따른 인공지능 기반 건축구조물 내의 최적 대피경로 안내방법을 도시한 플로우 차트, 도 7은 본 발명에 적용되는 수력네트워크 모델 기법을 통해 최적 대피경로를 산출하기 위한 정의되는 건축구조 물의 내부구조에 대한 예시이다."}
