{"patent_id": "10-2017-0180274", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0078394", "출원번호": "10-2017-0180274", "발명의 명칭": "인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치", "출원인": "주식회사 포스코", "발명자": "이진휘"}}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "열간 압연 소재 정보 및 조업정보에 관련된 변수를 이용하여 기계 학습을 통해 런아웃 테이블의 출측의 권취온도를 추정하기 위한 인공 신경망 구조의 권취온도 추정 모델을 생성하는 권취온도 학습부;상기 권취온도 추정 모델에 조업 중 실측된 변수를 입력하여 조업 중인 런아웃 테이블의 권취온도를 추정하는권취온도 계산부;상기 권취온도 계산부에서 추정된 권취온도와 사전 설정된 목표 권취온도를 비교하는 권취온도 비교부;상기 권취온도 비교부의 비교 결과, 상기 추정된 권취온도와 상기 목표 권취온도의 차이가 사전 설정 범위 이내인 경우, 상기 권취온도 계산부의 권취온도 추정 모델에 입력 변수로 사용된 열유속계수를 상기 런아웃 테이블의 열유속계수로 결정하는 열유속계수 결정부를 포함하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치."}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 권취온도 학습부는, 조업데이터가 저장된 데이터베이스에서 사전 설정된 정상범위를 벗어나는 이상 변수들과, 권취온도와 관련이 없는 미관련 변수들을 제거하고, 상기 이상 변수 및 미관련 변수들이 제거된 조업 데이터에서 실제 권취 온도와 목표 권취 온도의 차이가 사전 설정 범위 미만인 강판에 대한 변수들을 우량 변수로선정하는 것을 특징으로 하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치."}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 권취온도 학습부는, 상기 우량 변수들을 강판 별로 입력 변수와 출력 변수의 세트로 형성하는 것을 특징으로 하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치."}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 권취온도 학습부는, 상기 세트 내에서 권취온도를 출력값으로 설정하고, 열유속계수를 포함하는 그 나머지변수를 입력값으로 설정하는 것을 특징으로 하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치."}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 권취온도 학습부는, 상기 세트를 기계 학습에 사용되는 학습용 세트, 기계 학습의 결과를 검증하고 테스트하는 검증용 세트 및 테스트 세트로 구분하는 것을 특징으로 하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치."}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 권취온도 학습부는, 상기 학습용 세트를 이용한 기계 학습을 통해 인공 신경망 구조의 가중치를 결정하여상기 권취온도 추정 모델을 결정하는 것을 특징으로 하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정장치."}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2019-0078394-3-제6항에 있어서,상기 권취온도 학습부는, 사전 설정된 주기 마다 기계 학습을 실행하거나 상기 권취온도 추정 모델의 입력 변수가 변경될 때 기계 학습을 실행하여 상기 가중치를 업데이트하고, 업데이트된 가중치를 상기 권취온도 연산부로제공하는 것을 특징으로 하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치."}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 권취온도 비교부의 비교 결과, 상기 추정된 권취온도와 상기 목표 권취온도의 차이가 사전 설정 범위를 벗어나는 경우, 상기 권취온도 계산부의 권취온도 추정 모델에 입력 변수로 사용된 열유속계수를 보정하여 상기권취온도 계산부로 제공하는 열유속계수 보정부를 더 포함하는 것을 특징으로 하는 인공지능 기반 열연 런아웃테이블 열유속계수 결정 장치."}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 열유속계수 보정부는, 상기 추정된 권취온도가 상기 목표 권취온도 보다 상기 사전 설정 범위를 벗어나 더큰 경우 상기 열유속계수를 증가시키고, 상기 추정된 권취온도가 상기 목표 권취온도 보다 상기 사전 설정 범위를 벗어나 더 작은 경우 상기 열유속계수를 감소시켜 상기 권취온도 계산부로 제공하는 것을 특징으로 하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치."}
{"patent_id": "10-2017-0180274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 열유속계수 결정부에서 결정된 열유속계수 및 상기 런아웃 테이블의 입측 온도센서에서 실측된 온도를 제공받고, 사전 설정된 연산식 또는 알고리즘에 입력받은 열유속계수 및 런아웃 테이블의 입측 온도를 적용하여상기 런아웃 테이블의 주수량을 연산하는 주수량 계산부; 및상기 주수량 계산부에서 제공받은 주수량을 강판에 제공하도록 상기 뱅크의 헤더의 온/오프 상태를 제어하는 헤더 제어부를 더 포함하는 것을 특징으로 하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치."}
{"patent_id": "10-2017-0180274", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "열연 공정의 런아웃 테이블의 열유속계수를 결정하는 장치가 개시된다. 상기 장치는 열간 압연 소재 정보 및 조 업정보에 관련된 변수를 이용하여 기계 학습을 통해 런아웃 테이블의 출측의 권취온도를 추정하기 위한 인공 신 경망 구조의 권취온도 추정 모델을 생성하는 권취온도 학습부; 상기 권취온도 추정 모델에 조업 중 실측된 변수 를 입력하여 조업 중인 런아웃 테이블의 권취온도를 추정하는 권취온도 계산부; 상기 권취온도 계산부에서 추정 된 권취온도와 사전 설정된 목표 권취온도를 비교하는 권취온도 비교부; 및 상기 권취온도 비교부의 비교 결과, 상기 추정된 권취온도와 상기 목표 권취온도의 차이가 사전 설정 범위 이내인 경우, 상기 권취온도 계산부의 권 취온도 추정 모델에 입력 변수로 사용된 열유속계수를 상기 런아웃 테이블의 열유속계수로 결정하는 열유속계수 결정부를 포함한다."}
{"patent_id": "10-2017-0180274", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 열연 공정의 런아웃 테이블의 열유속계수를 결정하는 장치에 관한 것으로, 더욱 상세하게는 인공 신 경망을 이용하여 열연 공정에 관련된 다양한 입력 변수에 따른 권취 온도를 학습하여 권취 온도 추정 모델을 생 성하고, 추정 모델을 이용하여 실제 공정상의 권취 온도를 추정한 후 목표 권취 온도와의 차이를 기반으로 하여 열유속계수 설정하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치에 관한 것이다."}
{"patent_id": "10-2017-0180274", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "열간압연 공정의 런아웃 테이블(ROT: Run Out Table)은 조압연과 마무리 압연으로 두께와 폭이 결정된 강판을 냉각시키는 장치이다. 런아웃 테이블에는 일렬의 노즐이 장착된 헤더를 복수개 갖는 뱅크(bank)가 강판의 상하 로 다수 개 구비된다. 런아웃 테이블의 후단에는 강판을 코일 형태로 권취하는 권취기가 마련되며, 귄취기로 진 입하기 직전의 강판 온도, 즉 권취 온도가 목표 권취 온도와 일치하도록 강판의 냉각이 제어되어야 한다. 런아웃 테이블의 냉각 제어는 온/오프 되는 헤더의 수가 조정됨으로써 강판에 제공되는 냉각수의 양, 즉 주수량 을 조정함으로써 이루어진다. 이러한 각 뱅크별 주수량 결정에는 강판 소재의 열전달 특성을 반영한 열유속계수 가 관여하게 된다. 종래에는, 강판 소재의 두께, 폭, 사상압연 완료 온도, 이동 속도, 목표 권취 온도(Coiling Temperature: CT) 등의 변수를 기반으로 사전에 회귀식을 마련하고 이 회귀식을 이용하여 열유속계수를 추정하였다. 특히, 회귀식 을 구성하는 각 변수에 적용되는 계수는 사전에 피냉각 소재의 두께에 따라 테이블 형태로 사전에 저장해 주었다가 각 뱅크별 주수량 설정시 사용하였다. 이러한 종래의 열유속계수 추정 방식은, 특정 두께 범위 내에서 각 변수에 대해 동일한 계수 값을 사용하기 때 문에 연속적인 입력값에 대한 대응이 불가하고, 두께 범위의 구분도 동일하지 않도록 구성되어 있어, 특정 두께 범위의 경계에 있는 소재에 대해서는 열유속계수의 계산 오차로 인해 주수량 설정이 제대로 되지 않아 피냉각 소재의 온도를 목표 권취 온도에 일치시키는 것이 어렵다. 또한, 종래의 열유속계수 추정 방식은, 단순 두께 구분에 의해서만 변수별 계수의 값을 정하였기 때문에, 두께 이외의 폭, 속도, 강종, 압연 속도 등 다양한 조건에 대해서 계수를 정해야 하므로 더욱 많은 내용의 테이블이 필요하다. 실제로는 사전에 마련된 테이블만을 이용하여 열유속계수를 계산하게 되므로 정확한 변수의 적용이 어렵고 새로운 항목이 추가되는 경우 각각의 변수에 대한 계수가 재계산되어야 하는 문제가 발생한다. 또한, 종래의 열유속계수 추정 방식은, 가열로, 조압연, 사상압연에서의 조업 조건이나, 소재의 강종 특성에 대 해서도 회귀식에 반영이 되어야 수식으로 모델링하기 어렵고 이에 따라 회귀식의 수정이나 업데이트가 어려운 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2000-0325328호 (특허문헌 0002) 대한민국 공개특허공보 제10-2009-0069854호 (특허문헌 0003) 대한민국 공개특허공보 제10-2015-0021777호"}
{"patent_id": "10-2017-0180274", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은 인공지능을 구현하는 인공 신경망을 이용하여 다양한 입력 변수에 따른 권취 온도를 기계 학습 하여 모델링하고, 실제 공정 상에서 추정 모델을 이용하여 추정된 권취 온도와 목표 권취 온도의 차이를 기반으 로 열유속계수를 설정함으로써, 열간 압연 공정에서 목표 권취 온도를 달성할 수 있고 강판의 품질 편차를 해소 할 수 있는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치를 제공하는 것을 해결하고자 하는 기술적 과제로 한다."}
{"patent_id": "10-2017-0180274", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 해결하기 위한 수단으로서 본 발명은, 열간 압연 소재 정보 및 조업정보에 관련된 변수를 이용하여 기계 학습을 통해 런아웃 테이블의 출측의 권취온 도를 추정하기 위한 인공 신경망 구조의 권취온도 추정 모델을 생성하는 권취온도 학습부; 상기 권취온도 추정 모델에 조업 중 실측된 변수를 입력하여 조업 중인 런아웃 테이블의 권취온도를 추정하는 권취온도 계산부; 상기 권취온도 계산부에서 추정된 권취온도와 사전 설정된 목표 권취온도를 비교하는 권취온도 비교부; 상기 권취온도 비교부의 비교 결과, 상기 추정된 권취온도와 상기 목표 권취온도의 차이가 사전 설정 범위 이내 인 경우, 상기 권취온도 계산부의 권취온도 추정 모델에 입력 변수로 사용된 열유속계수를 상기 런아웃 테이블 의 열유속계수로 결정하는 열유속계수 결정부 를 포함하는 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치. 본 발명의 일 실시형태에서, 상기 권취온도 학습부는, 조업데이터가 저장된 데이터베이스에서 사전 설정된 정상 범위를 벗어나는 이상 변수들과, 권취온도와 관련이 없는 미관련 변수들을 제거하고, 상기 이상 변수 및 미관련변수들이 제거된 조업 데이터에서 실제 권취 온도와 목표 권취 온도의 차이가 사전 설정 범위 미만인 강판에 대 한 변수들을 우량 변수로 선정할 수 있다. 본 발명의 일 실시형태에서, 상기 권취온도 학습부는, 상기 우량 변수들을 강판 별로 입력 변수와 출력 변수의 세트로 형성할 수 있다. 본 발명의 일 실시형태에서, 상기 권취온도 학습부는, 상기 세트 내에서 권취온도를 출력값으로 설정하고, 열유 속계수를 포함하는 그 나머지 변수를 입력값으로 설정할 수 있다. 본 발명의 일 실시형태에서, 상기 권취온도 학습부는, 상기 세트를 기계 학습에 사용되는 학습용 세트, 기계 학 습의 결과를 검증하고 테스트하는 검증용 세트 및 테스트 세트로 구분할 수 있다. 본 발명의 일 실시형태에서, 상기 권취온도 학습부는, 상기 학습용 세트를 이용한 기계 학습을 통해 인공 신경 망 구조의 가중치를 결정하여 상기 권취온도 추정 모델을 결정할 수 있다. 본 발명의 일 실시형태에서, 상기 권취온도 학습부는, 사전 설정된 주기 마다 기계 학습을 실행하거나 상기 권 취온도 추정 모델의 입력 변수가 변경될 때 기계 학습을 실행하여 상기 가중치를 업데이트하고, 업데이트된 가 중치를 상기 권취온도 연산부로 제공할 수 있다. 본 발명의 일 실시형태에서, 상기 권취온도 비교부의 비교 결과, 상기 추정된 권취온도와 상기 목표 권취온도의 차이가 사전 설정 범위를 벗어나는 경우, 상기 권취온도 계산부의 권취온도 추정 모델에 입력 변수로 사용된 열 유속계수를 보정하여 상기 권취온도 계산부로 제공하는 열유속계수 보정부를 더 포함할 수 있다. 본 발명의 일 실시형태에서, 상기 열유속계수 보정부는, 상기 추정된 권취온도가 상기 목표 권취온도 보다 상기 사전 설정 범위를 벗어나 더 큰 경우 상기 열유속계수를 증가시키고, 상기 추정된 권취온도가 상기 목표 권취온 도 보다 상기 사전 설정 범위를 벗어나 더 작은 경우 상기 열유속계수를 감소시켜 상기 권취온도 계산부로 제공 할 수 있다. 본 발명의 일 실시형태에서, 상기 열유속계수 결정부에서 결정된 열유속계수 및 상기 런아웃 테이블의 입측 온 도센서에서 실측된 온도를 제공받고, 사전 설정된 연산식 또는 알고리즘에 입력받은 열유속계수 및 런아웃 테이 블의 입측 온도를 적용하여 상기 런아웃 테이블의 주수량을 연산하는 주수량 계산부 및 상기 주수량 계산부에서 제공받은 주수량을 강판에 제공하도록 상기 뱅크의 헤더의 온/오프 상태를 제어하는 헤더 제어부를 더 포함할 수 있다.."}
{"patent_id": "10-2017-0180274", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치는, 인공 신경망 구조를 이용하여 도출된 추정 모 델을 이용하여 권취 온도를 추정한 후 추정된 권취 온도와 목표 권취 온도의 차이에 기반하여 열유속계수를 설 정하게 하므로, 계절별로 조업 조건이 변화하거나 압연 대상 강종이 변경되는 경우에도 기계 학습을 통해 열유 속계수 추정 모델을 쉽게 업데이트할 수 있다. 이를 통해 강판의 권취 온도가 원하는 목표치를 추종하게 할 수 있다. 이는 열연 제품의 재질 및 품질 편차를 감소시키고 및 미스 롤 등 설비 오작동에 의한 소손을 방지할 수 있어 생산성 향상에 큰 도움을 주게 된다."}
{"patent_id": "10-2017-0180274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부 도면을 참조하여 본 발명의 다양한 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치를 더욱 상세하게 설명한다. 도 1은 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치가 적용되는 열 간 압연 설비를 개략적으로 도시한 도면이다. 예컨대, 도 1에서 도시한 바와 같이, 압연소재인 슬라브(slab)를 가열로에서 압연에 적당한 온도(예 를 들어, 1100~1200 ℃)로 가열한다. 이어, 가열된 슬라브를 조 압연기와 마무리 압연기(사상압연기)를 통하여 원하는 두께의 열연 강판 (strip)으로 압연을 실시한다. 이어, 강판은 런아웃 테이블(Run Out Table: ROT)을 통과하면서 소정의 온도로 강판을 냉각시켜 요구되는 기계적 성질을 부여한 후, 권취기 즉, 다운 코일러에서 열연코일(150') 형태의 제품으로 생산하여 열간 압 연작업을 완료하게 된다. 즉, 가열로에서 가열된 열연 슬라브는 조압연과 마무리 압연으로 두께와 폭이 변화하고 최종적으로 런아웃 테이블에서 냉각된 후 권취기에서 코일형태(150')로 제작된다. 이러한 열간 압연 공정에서, 열연강재의 품질은 런아웃 테이블에서 이루어지는 냉각에 의하여 주로 결정되 는데, 런아웃 테이블의 출구 즉 권취기에 유입되기 직전의 강판 온도(권취 온도: Coiling Temperature)를 원하는 목표 온도가 되게 제어하는 방식으로 냉각 제어가 이루어지고 있다. 도 2는 도 1의 열간 압연 공정 설비 중 런아웃 테이블을 더욱 상세하게 도시한 도면이다. 도 2에서 도시한 바와 같이, 마무리 압연을 거친 강판은 런아웃 테이블에서 목표 냉각 온도로 냉각제 어가 실시된다. 예를 들어, 런아웃 테이블은 복수(N개)의 뱅크(160a, 160b, ..., 160n)들을 포함하며, 런아웃 테이블 의 입측과 중간 및 출측에는 각각 온도측정기(180a, 180b,180c)들이 설치된다. 각 뱅크(160a, 160b, ..., 160n)는 냉각수를 강판으로 배출하는 일렬의 노즐을 갖는 헤더를 가지며 헤더의 온/ 오프 제어를 통해 냉각수를 분사함으로써 주수량을 제어하고 있다. 이를 위해, 런아웃 테이블에서는 입측, 중간 및 출측 온도 측정기(180a)(180b)(180c)를 통하여 강판의 냉 각대 입측온도, 중간온도 및 출측온도를 측정하고, 이를 근거로 피드포워드(feedforward) 또는 피드백(feedbak) 냉각제어를 실시함으로써 권취 온도를 원하는 목표 온도가 되도록 제어한다. 배경 기술에서 설명한 바와 같이, 뱅크의 헤더 제어를 통해 주수량을 결정하는데 있어서, 종래에는 강판 소재의 두께, 폭, 사상압연 완료 온도, 이동 속도, 목표 권취 온도(Coiling Temperature: CT) 등의 변수를 기반으로 사 전에 회귀식을 마련하고 이 회귀식을 이용하여 열유속계수를 추정하고, 추정된 열유속계수에 기반하여 주수량을 결정하였다. 종래의 회귀식을 이용한 열유속계수 추정의 한계를 극복하기 위해 본 발명의 여러 실시형태는 인공 신경망을 기 반으로한 기계 학습 기법을 이용하여 권취 온도를 추정하고, 추정된 권취 온도와 목표 권취 온도의 차이에 기반 하여 열유속계수를 설정하는 기법을 제공한다. 도 3은 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치를 도시한 블록 구성도이다.도 3에 도시한 바와 같이, 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치는, 권취온도 학습부와, 권취온도 계산부와, 권취온도 비교부와, 열유속계수 결정부 및 열 유속계수 보정부를 포함하여 구성될 수 있다. 권취온도 학습부는 인공 신경망 구조를 이용하여 권취온도에 영향을 미치는 다양한 입력 변수와 다양한 입 력 변수에 따른 열유속계수와의 관계를 모델링한다. 더욱 구체적으로, 권취온도 학습부는 권취온도와, 열유속계수를 포함하는 다양한 조업데이터를 저장한 데이 터베이스에 저장된 데이터를 이용하여 신경망 구조의 권취온도 추정 모델을 생성한다. 이 과정에서 기계 학습 알고리즘이 적용될 수 있다. 도 4는 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치에 적용된 인공 신경망 모델의 일례를 도시한 도면이다. 권취온도 학습부는 도 4에 도시된 것과 같은 권취온도 추정을 위한 인공 신경망 모델을 기계학습을 통해 생 성하게 된다. 도 4에 도시된 인공 신경망 모델은 하나의 입력층(input layer)과 복수의 은닉층(hidden layer) 및 하나의 출력층(output layer)를 갖는 전체 연결(fully connected) 구조를 갖는 신경망을 예로 도시한 것이다. 권취온도 학습부는 조업데이터를 활용하여 기계 학습 알고리즘을 수행하여 인공 신경망을 구성하는 은닉층 의 최적 가중치를 결정함으로써 권취온도 결정 모델을 완성한다. 여기서 사용되는 인공신경망 구조 또는 학습 알고리즘 등에 따라 다앙한 방식으로 권취온도 추정 모델을 완성할 수 있다. 도 5는 이러한 다양한 권취온도 추정 모델의 제작 과정의 일례를 도시한다. 도 5를 참조하면, 권취온도 학습부는 데이터베이스에 저장된 열간 압연 공정 관련 다양한 변수들을 포함하 는 조업 데이터 중 사전 설정된 정상범위를 벗어나는 이상 변수들을 제거한다(S11). 이어, 권취온도 학습부는, 이상 변수가 제거된 조업 데이터 중에서 코일 넘버, 인덱스 등과 같은 권취온도 의 결정에 영향을 미치지 못하는 관련 없는 미관련 변수들을 제거한다(S12). 이어, 권취온도 학습부는, 이상 변수 및 미관련 변수들이 제거된 조업 데이터에서 실제 권취 온도와 목표 권취 온도의 차이가 10% 미만인 강판(코일), 즉 목표 권취 온도의 적중률이 90% 이상인 강판(코일)에 대한 변수 들을 선정한다(S13). 이러한, 과정들(S11-S13)은 권취온도 추정 모델을 학습하기 위한 변수들을 선별하는 과정으로 실제 권취 온도와 목표 권취 온도의 차이가 거의 나지 않는 양호한 제어가 이루어진 경우의 우량 변수들을 선정하는 과정이다. 이어, 권취온도 학습부는 우량 변수들 중 추정하고자 하는 결과값이 되는 권취온도를 출력값(통상, Y값이라 고 함)으로 설정한다(S14) 이어, 권취온도 학습부는 각 변수들마다 갖는 값들의 범위가 차이가 나므로 최소최대 스케일링 (MinMaxScaling) 기법 등을 이용하여 각 변수들의 범위를 0과 1 사이의 값으로 정규화한다(S15). 이어, 권취온도 학습부는 여러 변수들 중 권취온도에 미치는 영향도가 큰 변수들을 입력변수(통상 X값이라 고 함)를 결정할 수 있다. 예를 들어, 입력변수는 소재의 특성(두께, 폭, 성분 정보 등) 및 조업 조건(런아웃 테이블 입구측 온도, 런아웃 테이블 출구측 온도(권취 온도), 목표 권취 온도 등)에 관련된 변수일 수 있다. 특 히, 본 발명의 일 실시형태에서 입력변수는 열유속계수를 포함한다. 위의 과정들(S14-S16)은 기계 학습 알고리즘을 적용하기 위한 데이터 세트(set)를 준비하는 과정으로, 각 변수 들을 정규화하고 입력 변수와 출력 변수를 결정한다. 이 때, 각 변수들은 하나의 세트를 형성하게 되는데 이는 과정(S13)에서 선정된 강판(코일) 별로 이루어진다. 즉, 하나의 세트는 과정(S13)에서 선정된 코일의 조업 시 측정되거나 사용된 변수들로 이루어질 수 있다. 이어, 권취온도 학습부는 정규화된 입력변수 및 출력변수로 이루어진 데이터 세트를 학습용 데이터 세트, 검증용 데이터 세트, 테스트용 데이터 세트로 구분하고, 검증용 데이터 세트를 이용하여 기계 학습 알고리즘을 수행함으로써 열유속계수 추정 모델을 생성한 후 검증용 데이터 세트 및 테스트용 데이터 세트를 생성된 권취온 도 추정 모델에 적용하여 출력값에 대한 검증과 테스트를 수행하여 이상이 없는 경우 최종적으로 권취온도 추정 모델을 완성한다(S17).다시, 도 3을 참조하면, 권취온도 계산부는 권취온도 학습부에서 작성된 권취온도 추정 모델을 실제 공 정에 적용하는 요소로서, 실측된 입력 변수를 권취온도 추정 모델에 입력하여 현재 런아웃 테이블의 권취온도를 추정한다. 권취온도 계산부는 실제 열간 압연 공정에 권취온도 학습부에서 생성된 열유속계수 추정 모델을 적용하 는 요소로서, 현재 진행 중인 공정에서 권취온도 추정 모델의 입력 변수를 실측한 값을 권취온도 추정 모델에 입력하고 이에 따른 권취온도 추정 모델의 결과값, 즉 권취온도 추정값을 도출할 수 있다. 한편, 권취온도 학습부는 사전 설정된 주기로 권취온도 추정 모델의 업데이트를 수행할 수 있다. 또한, 권 취온도 학습부는 새로운 입력 변수 추가 또는 기존 입력 변수 삭제 등과 같은 이벤트 발생시 권취온도 추정 모델의 업데이트를 수행할 수 있다. 즉, 도 5에 설명된 것과 같은 과정들을 주기별 또는 입력변수 변경 시 수행하여 인공 신경망 구조의 은닉층에 대한 가중치를 업데이트 하고 이를 권취온도 계산부에도 적용한다. 권취온도 비교부는 사전에 설정된 목표 권취온도와 권취온도 계산부에서 권취온도 추정 모델을 이용하 여 추정한 권취 온도를 서로 비교한다. 권취온도 비교부에서 사전에 설정된 목표 권취온도와 권취온도 계산부에서 권취온도 추정 모델을 이용 하여 추정한 권취 온도를 서로 비교한 결과, 그 차이가 사전 설정된 범위 이내인 경우에 권취온도 계산부에 서 권취온도 추정 모델에 입력변수로서 입력된 열유속계수를 주수량 계산을 위한 열유속계수로 결정한다. 반면, 권취온도 비교부에서 사전에 설정된 목표 권취온도와 권취온도 계산부에서 권취온도 추정 모델을 이용 하여 추정한 권취 온도를 서로 비교한 결과 그 차이가 사전 설정된 범위를 벗어나면, 열유속계수 보정부가 권취온도 계산부에서 권취온도 추정 모델에 입력변수로서 적용된 열유속계수의 값을 변경하여 다시 권취온 도 계산부의 입력변수로 제공한다. 권취온도 계산부는 열유속계수 보정부에 의해 변경된 열유속계 수의 값을 입력변수로 하여 다시 권취온도를 추정한다. 도 6은 권취 온도와 열유속계수와의 관계를 도시한 그래프로서, 도 6에 도시한 바와 같이, 열유속계수의 값이 커질수록 냉각 주수량이 커지므로 권취온도가 하강하는 음의 상관관계로 표현가능하며, 선형 회귀로 추세를 고 려하면 약 97.6%도 그래프를 표현할 수 있다. 다시 말하면, 도 6에 나타난 바와 같이, 열유속계수 값이 커질수 록 냉각 주수량이 커지게 되고 권취온도는 낮아지게 되므로, 권취온도 추정시 목표 권취온도보다 값이 크다면 열유속계수의 값을 더 크게 조정하여 설정하고, 목표 권취온도보다 값이 작다면 열유속계수의 값을 더 작게 조 정하여 설정할 수 있다. 이러한 특징을 고려하여, 열유속계수 보정부는 권취온도 계산부에서 추정된 권취온도가 목표 권취온도 보다 일정 범위를 벗어나 높은 경우에는 열유속계수의 값을 이전보다 더 크게 설정하고, 추정된 권취온도가 목 표 권취온도보다 일정 범위를 벗어나 낮은 경우에는 열유속계수의 값을 이전보다 더 작게 설정할 수 있다. 열유속계수 결정부에서 결정된 열유속계수 및 런아웃 테이블의 입측 온도센서(180a)에서 실측된 온도 가 주수량 계산부에 제공되고, 주수량 계산부는 사전 설정된 연산식 또는 알고리즘을 적용하여 열유속 계수 및 런아웃 테이블의 입측 온도에 따른 뱅크별 주수량을 연산한다. 주수량 계산부에서 연산된 주수량 정보는 헤더 제어부로 제공되고 헤더 제어부는 주수량 계산부 에서 제공된 주수량을 강판에 제공하도록 헤더의 온/오프 상태를 제어할 수 있다. 도 7은 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치에서 추정된 권 취온도와 실측된 권취온도를 비교한 그래프이다. 도 7의 가로축은 실측된 권취온도 값이고, 세로축은 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치에서 신경망 모델을 통해 추정된 권취온도의 값인데, 직선에 가까울수록 신경망 모 델의 정확도가 높다고 볼 수 있다. 도 7에 도시된 산점도의 정확도를 비교하면 약 95.5%의 정확도를 가진다고 볼 수 있고, 목표 권취온도의 +-20도 이내로 예측하는 비율은 95.7%로서 상당히 높은 정확도로 권취온도를 추정 하고 있음을 확인할 수 있다. 이와 같이, 본 발명의 여러 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치는, 인공 신경망 구조를 이용하여 열유속계수 추정 모델을 제작하므로 계절별로 조업 조건이 변화하거나 압연 대상 강종이 변경 되는 경우에도 기계 학습을 통해 열유속계수 추정 모델을 쉽게 업데이트할 수 있다. 이를 통해 강판의 권취 온도가 원하는 목표치를 추종하게 할 수 있다. 이는 열연 제품의 재질 및 품질 편차를 감소시키고 및 미스 롤 등 설비 오작동에 의한 소손을 방지할 수 있어 생산성 향상에 큰 도움을 주게 된다."}
{"patent_id": "10-2017-0180274", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치가 적용되는 열 간 압연 설비를 개략적으로 도시한 도면이다. 도 2는 도 1의 열간 압연 공정 설비 중 런아웃 테이블을 더욱 상세하게 도시한 도면이다. 도 3은 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치를 도시한 블록 구성도이다. 도 4는 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치에 적용된 인공 신경망 모델의 일례를 도시한 도면이다.도 5는 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치에 적용된 인공 신경망 모델의 제작 과정의 일례를 도시한 흐름도이다. 도 6은 통상적인 열간압연 설비의 런아웃 테이블에서의 권취온도와 열유속계수와의 관계를 도시한 그래프이다. 도 7은 본 발명의 일 실시형태에 따른 인공지능 기반 열연 런아웃 테이블 열유속계수 결정 장치에서 추정된 권 취온도와 실측된 권취온도를 비교한 그래프이다."}
