{"patent_id": "10-2022-0041906", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0127816", "출원번호": "10-2022-0041906", "발명의 명칭": "차량용 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "허영"}}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량에 장착되어 V2X (Vehicle to-Everything) 통신을 수행하는 차량용 전자장치에 있어서,적어도 하나의 외부 장치와 제1 통신 유형의 통신을 수행하는 제1 통신 모듈;제2 통신 유형의 통신을 수행하는 제2 통신 모듈;하나 이상의 인스트럭션들을 저장하는 메모리; 및상기 메모리에 저장된 상기 하나 이상의 인스트럭션들을 실행하는 프로세서를 포함하고,상기 프로세서는,상기 적어도 하나의 외부 장치로부터, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 나타내는 브로드캐스트 메시지를 수신하도록 상기 제1 통신 모듈을 제어하고,상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키고, 상기 적어도 하나의 외부 장치와 통신을 수행하도록 상기 제2 통신 모듈을 제어하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는,상기 차량용 전자 장치가 지원하는 통신 유형을 요청하는 정보를 포함하는 요청 메시지를 수신하도록 상기 제1통신 모듈을 제어하고,상기 요청 메시지에 기초하여, 상기 차량용 전자 장치가 지원하는 통신 유형과 관련된 정보를 포함하는 응답 메시지를 전송하도록 상기 제1 통신 모듈을 제어하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 프로세서는,상기 요청 메시지 및 상기 브로드캐스트 메시지에 기초하여, 상기 차량용 전자 장치가 포함된 커버리지 내의 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별하고,상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보에 기초하여, 상기 제1 통신 모듈의 활성화 또는 비활성화를 식별하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서, 상기 요청 메시지는 BSM (Basic Safety Message)과 함께 전송되고, 상기 요청 메시지는 기 설정된 주기에 기초하여 전송되는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항에 있어서, 상기 프로세서는,상기 차량용 전자 장치가 지원하는 통신 유형을 요청하는 정보를 포함하는 요청 메시지 및 상기 브로드캐스트메시지에 기초하여, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보가 제1 통신 유형에 대응하는지 여부를 식별하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2 항에 있어서, 상기 브로드캐스트 메시지는 상기 요청 메시지에 대한 상기 적어도 하나의 외부 장치의 응답메시지에 대응하는, 차량용 전자 장치.공개특허 10-2023-0127816-3-청구항 7 제 1항에 있어서, 상기 프로세서는,상기 브로드캐스트 메시지에 기초하여, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별하고,상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보에 기초하여, 상기 제1 통신 모듈의 활성화 또는 비활성화 여부를 식별하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서, 상기 프로세서는,상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보가 제2 통신 유형에 대응하는 경우, 상기 제1통신 모듈을 비활성화하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 프로세서는,상기 제1 통신 유형을 위해 할당된 시간 구간에서, 상기 브로드캐스트 메시지 또는 요청 메시지를 센싱하고,임계 값에 기초하여, 상기 브로드캐스트 메시지 또는 상기 요청 메시지를 검출하고,상기 브로드캐스트 메시지 또는 상기 요청 메시지가 검출된 경우, 통신 유형을 요청하는 정보, 또는 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서, 상기 프로세서는,상기 브로드캐스트 메시지 또는 요청 메시지를 센싱한 결과에 기초하여, 상기 제1 통신 유형을 위해 할당된 시간 구간을 식별하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9항에 있어서,상기 제1 통신 유형을 위해 할당된 시간 구간은, 상기 브로드캐스트 메시지 또는 요청 메시지의 수신을 위해,고정적 또는 동적으로 상기 차량용 전자 장치에게 할당되는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1항에 있어서,상기 브로드캐스트 메시지는 BSM (Basic Safety Message)과 함께 전송되는, 차량용 전자 장치."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "차량용 전자 장치가 V2X (Vehicle to-Everything) 통신을 수행하는 방법에 있어서,적어도 하나의 외부 장치로부터, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 나타내는브로드캐스트 메시지를 수신하도록 제1 통신 유형의 통신을 수행하는 제1 통신 모듈을 제어하는 단계;상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 단계; 및 제2 통신 유형의 통신을 수행하는 제2 통신 모듈을 이용하여, 상기 외부 장치와 통신을 수행하도록 제어하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 차량용 전자 장치가 지원하는 통신 유형을 요청하는 정보를 포함하는 요청 메시지를 수신하도록 상기 제1공개특허 10-2023-0127816-4-통신 모듈을 제어하는 단계; 및상기 요청 메시지에 기초하여, 상기 차량용 전자 장치가 지원하는 통신 유형과 관련된 정보를 포함하는 응답 메시지를 전송하도록 상기 제1 통신 모듈을 제어하는 단계;를 더 포함하는, 방법."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 단계;는,상기 요청 메시지 및 상기 브로드캐스트 메시지에 기초하여, 상기 차량용 전자 장치가 포함된 커버리지 내의 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별하는 단계; 및상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보에 기초하여, 상기 제1 통신 모듈의 활성화 또는 비활성화를 식별하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서, 상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 단계;는,상기 차량용 전자 장치가 지원하는 통신 유형을 요청하는 정보를 포함하는 요청 메시지 및 상기 브로드캐스트메시지에 기초하여, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보가 제1 통신 유형에 대응하는지 여부를 식별하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서, 상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 단계;는,상기 브로드캐스트 메시지에 기초하여, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별하는 단계; 및상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보에 기초하여, 상기 제1 통신 모듈의 활성화 또는 비활성화 여부를 식별하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서, 상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 단계;는,상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보가 제2 통신 유형에 대응하는 경우, 상기 제1통신 모듈을 비활성화하는 단게;를 포함하는, 방법."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서, 상기 제1 통신 유형을 위해 할당된 시간 구간에서, 상기 브로드캐스트 메시지 또는 요청 메시지를 센싱하는 단계;임계 값에 기초하여, 상기 브로드캐스트 메시지 또는 상기 요청 메시지를 검출하는 단계; 및상기 브로드캐스트 메시지 또는 상기 요청 메시지가 검출된 경우, 통신 유형을 요청하는 정보, 또는 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2022-0041906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 제1 통신 유형을 위해 할당된 시간 구간은, 상기 브로드캐스트 메시지 또는 요청 메시지의 수신을 위해,고정적 또는 동적으로 상기 차량용 전자 장치에게 할당되는, 방법."}
{"patent_id": "10-2022-0041906", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 차량용 전자 장치가 V2X (Vehicle to-Everything) 통신을 수행하는 방법이 제공 될 수 있다. 방법은, 적어도 하나의 외부 장치로부터, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대 한 정보를 나타내는 브로드캐스트 메시지를 수신하도록 제1 통신 유형의 통신을 수행하는 제1 통신 모듈을 제어 하는 단계; 상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 단계; 및 제2 통신 유형의 통신을 수행하는 제2 통신 모듈을 이용하여, 상기 외부 장치와 통신을 수행하도록 제어하는 단계;를 포함할 수 있다."}
{"patent_id": "10-2022-0041906", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시예들은 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 전자 장치 및 그 동작 방 법에 관한 것이다."}
{"patent_id": "10-2022-0041906", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G(4th generation) 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 5G 이동통신 기술에 대한 개발이 진행되었다. 5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도 록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수(‘Sub 6GHz’) 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불리는 초고주파 대역(‘Above 6GHz’)에서도 구현이 가능하다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 따라서, 4세대 이동 통신 기술인 LTE V2X 기술과 5세대 이동 통신 기술인 NR V2X 기술간의 원활한 공존을 도모 할 수 있는 방법이 필요하다."}
{"patent_id": "10-2022-0041906", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "다양한 실시예들은, 4세대 이동 통신 기술인 LTE V2X 기술과 5세대 이동 통신 기술인 NR V2X 기술간의 원활한 공존을 위한 효율적인 무선 자원 할당 방법을 제공할 수 있다. 다양한 실시예들은, 필요에 따라 LTE V2X 는 비활성화하는 단말 및 단말의 동작 방법을 제공할 수 있다."}
{"patent_id": "10-2022-0041906", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 차량에 장착되어 V2X (Vehicle to-Everything) 통신을 수행하는 차량용 전자 장 치가 제공될 수 있다. 차량용 전자장치는, 적어도 하나의 외부 장치와 제1 통신 유형의 통신을 수행하는 제1 통신 모듈; 제2 통신 유형의 통신을 수행하는 제2 통신 모듈; 하나 이상의 인스트럭션들을 저장하는 메모리; 및 상기 메모리에 저장된 상기 하나 이상의 인스트럭션들을 실행하는 프로세서를 포함할 수 있다. 프로세서는, 적 어도 하나의 외부 장치로부터, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 나타내는 브 로드캐스트 메시지를 수신하도록 상기 제1 통신 모듈을 제어할 수 있다. 프로세서는, 브로드캐스트 메시지에 기 초하여, 제1 통신 모듈을 비활성화시키고, 적어도 하나의 외부 장치와 통신을 수행하도록 상기 제2 통신 모듈을 제어할 수 있다. 본 개시의 일 실시예에 따르면, 차량용 전자 장치가 V2X (Vehicle to-Everything) 통신을 수행하는 방법이 제공 될 수 있다. 방법은, 적어도 하나의 외부 장치로부터, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 나타내는 브로드캐스트 메시지를 수신하도록 제1 통신 유형의 통신을 수행하는 제1 통신 모듈을 제 어하는 단계; 상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 단계; 및 제2 통신 유형 의 통신을 수행하는 제2 통신 모듈을 이용하여, 상기 외부 장치와 통신을 수행하도록 제어하는 단계;를 포함할수 있다."}
{"patent_id": "10-2022-0041906", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따른 단말은 4세대 이동 통신 기술인 LTE V2X 기술과 5세대 이동 통신 기술인 NR V2X 기술간의 원 활한 공존을 위한 동작을 수행할 수 있다. 일 실시예에 따른 단말의 소모 전력이 절감될 수 있다. 일 실시예에 따른 무선 자원의 효율이 증가될 수 있다."}
{"patent_id": "10-2022-0041906", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 명세서의 실시예들에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반 적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따 라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 실시예들에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자 가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시에서, \"a, b 또는 c 중 적어도 하나\" 표현은 \" a\", \" b\", \" c\", \"a 및 b\", \"a 및 c\", \"b 및 c\", \"a, b 및 c 모두\", 혹은 그 변형들을 지칭할 수 있다. 도 1은 단말들의 V2X 기술에 기반한 통신 방법을 설명하기 위한 도면이다. V2X(vehicle-to-everything) 서비스로 대표되는 차량 통신 서비스는 자동차와 자동차(Vehicle-to-Vehicle, V2V), 자동차와 인프라(Vehicle-to-Infrastructure, V2I), 자동차와 네트워크(Vehicle-to-Network, V2N) 및 자 동차와 보행자 (Vehicle-to-Pedestrian, V2P) 타입 등을 포함한다. V2X 서비스는 PC5 인터페이스 및/또는 Uu 인터페이스에 의해 제공될 수 있다. PC5 인터페이스를 통한 V2X 서비스 지원은 단말이 PC5 인터페이스를 통해 직접 서로 통신할 수 있는 통신 모드인 V2X 사이드링크 통신에 의해 제공되며, 단말이 차세대 무선 액세스 네트 워크(NG- RAN)에 의해 서빙되고 단말이 NG-RAN 커버리지 밖에 있을 경우에 지원된다. V2X 서비스 사용 권한이 있는 단말만이 V2X 사이드링크 통신을 수행할 수 있다. 이동통신기반 차량사물통신(Cellular-V2X, C-V2X) 기술은 V2X 기술을 규정하기 위한 표준 기술의 한 형태이다. C-V2X 기술은 롱텀에벌루션(LTE)과 5세대 이동통신(5G) 등 셀룰러 기반의 V2X 기술을 의미할 수 있다. 3GPP(3rd Generation Partnership Project)는 C-V2X 기술과 관련된 기술을 규정한다. 예로, C-V2X 기술은 표준 규격 (Release 14 및 Release 15)에서 제시한 LTE(Long-Term Evolution) 기반의 V2X 기술(이하, LTE V2X 기술)과 표 준 규격(Release 16)에서 규정되는 NR (5G New Radio)기반의 V2X 기술(이하, NR V2X 기술)을 모두 포함할 수 있다. 또한, C-V2X 기술은 상술한 표준 규격에서 규정한 V2X 기술에 한정되지 않는다. 현재 Release 14 및 Release 15에서 규정된 LTE V2X 기술은 상용화가 진행 중이다. 예로, LTE V2X 기술을 규 정한 표준 규격에 기초하여, LTE V2X 기술을 지원하는 단말 및 차량이 구현될 수 있고, RSU(roadside unit)이 지역별로 설치될 수 있다. 후에 LTE가 아닌 다른 RAT(Radio access technology)이 개발되는 경우, 현재 상용화 된 LTE V2X 기술에 기반한 통신 시스템과 다른 RAT 기술에 기반한 통신 시스템이 공존(Coexistence)하는 상황이 발생할 것이다. 현재, NR V2X 기술의 표준화가 진행 중에 있다. 또한, NR V2X 기술이 보편화 된 상황에서도, 사용자는 사용하는 단말이 NR V2X 기술을 수행할 필요가 없다면, LTE V2X 기술만 지원하는 단말을 선택하여 사용할 수도 있다. LTE V2X 기술만 지원하는 단말 보다 NR V2X 기술 도 지원하는 단말이 상대적으로 가격이 비쌀 수 있기 때문이다. 따라서, 혼선과 자원 낭비를 피하기 위해, 서로 다른 RAT를 지원하는 V2X 기술 간의 효율적인 공존 방안이 필요 하다. 또한, 현재 개발이 진행 중인 NR V2X 기술을 고려하여, LTE V2X 기술과 NR V2X 기술 간의 연계가 필요하 다. 하기의 [표 1]은 LTE V2X 기술과 NR V2X 기술에서 지원하는 통신 형태를 설명하기 위한 표이다. 표 1 LTE V2X NR V2X Broadcast Broadcast, Unicast, Multicast 브로드캐스트(Broadcast)는 단말이 불특정된 다수의 다른 단말들에게 동시에 데이터, 또는 제어 정보를 전송하 는 통신 형태를 의미할 수 있다. 즉, 브로드캐스트는 1 대 다수의 통신 형태를 의미할 수 있다. 유니캐스트 (Unicast)는 단말이 특정된 하나의 다른 단말에게 데이터, 또는 제어 정보를 전송하는 통신 형태를 의미할 수있다. 유니 캐스트는는 1 대 1의 통신 형태를 의미할 수 있다. 멀티 캐스트(Multicast)는 단말이 특정된 다수의 다른 단말들(그룹)에 동시에 데이터, 또는 제어 정보를 전송하는 통신 형태를 의미할 수 있다. [표 1]을 참고하면, LTE V2X 기술은, 단말이 브로드캐스트타입으로 메시지를 전송 또는 수신하는 것을 지원할 수 있다. NR 기반의 V2X 기술은, 브로드캐스트 타입, 유니캐스트 타입, 멀티 캐스트 타입 중 적어도 하나의 타 입을 이용하여, 단말이 메시지를 전송 또는 수신하는 것을 지원할 수 있다. 도 1을 참고하여 NR V2X 기술을 지원하는 제1 단말 및 제2 단말과 LTE V2X 기술을 지원하는 제3 단말 및 제4 단말의 통신 방법이 설명될 수 있다. LTE V2X 기술을 지원하는 제3 단말 및 제4 단말은 LTE V2X 기술에 기초한 LTE V2X 메시지를 송 수신할 수 있다. 또한, NR V2X 기술을 지원하는 제1 단말 및 제2 단말은 LTE V2X 기술에 기초한 LTE V2X 메시지, 또는 NR V2X 기술에 기초한 NR V2X 메시지를 송수신할 수 있다. 또한, NR V2X 기술을 지원하는 제1 단말과 LTE V2X 기술을 지원하는 제3 단말은 LTE V2X 메시지를 송수신할 수 있다. LTE 기반의 V2X 기술을 사용할 필요가 없는 상황에서, NR 기반의 V2X 기술을 사용할 수 있는 능력이 있는 제1 단말 및 제2 단말은 LTE V2X 메시지를 송수신할 필요가 없다. 제1 단말 및 제2 단말(11 5)은 NR V2X 메시지를 송수신할 수 있기 때문이다. 본 개시는, 4세대 이동 통신 기술인 LTE V2X 기술과 5세대 이동 통신 기술인 NR V2X 기술간의 원활한 공존을 위 해서, 무선 자원이 효율적으로 활용될 수 있고, 단말이 효율적으로 동작될 수 있는 방법을 제공함에 목적이 있 다. 일 실시예에 따른 제1 단말 및 제2 단말은 LTE 기반의 V2X 기술은 비활성화(disable)하고, NR 기반의 V2X 기술만 사용하도록 설정할 수 있다. 상술한 본 개시의 일 실시예에 따르면 송수신을 위해 사용하는 무선 자 원의 낭비와 단말에서 낭비되는 전력을 줄일 수 있다. 도 2a 및 도 2b는 서로 다른 RAT가 공존하는 상황에서 시간 자원을 할당하는 방식을 설명하기 위한 도면이다. 서로 다른 RAT (Radio Access Technology)인 LTE V2X 기술과 NR V2X 기술이 동시에 사용되어야 하는 상황에서, TDM(time division multiplexing) 방식과 FDM(frequency division multiplexing) 방식이 고려되고 있다. TDM 방식이 사용되는 경우 시간 축에서 두 개의 RAT이 구분하여 사용될 수 있다. 도 2a 및 도 2b를 참고하여, TDM 방식에 기초하여 LTE V2X 기술과 NR V2X 기술이 공존하는 상황이 설명될 수 있다. 도 2a를 참고할 때, LTE V2X 기술이 제1 서브프레임 및 제3 서브프레임 동안 사용될 수 있고, NR V2X 기술이 제2 서브프레임 및 제4 서브프레임 동안 사용될 수 있다. LTE V2X 기술을 지원하는 단말은 제 1 서브프레임 및 제3 서브프레임 동안 LTE V2X 자원들(LTE V2X resources)을 이용하여 LTE 기반의 신호를 송신 또는 수신(Tx or Rx)할 수 있다. 제1 서브프레임 및 제3 서브프레임 동안, NR V2X 기술 을 지원하는 단말은 NR V2X 자원들(NR V2X resources)에 대해 비활성화(Disabled)될 수 있다. NR V2X 기술을 지원하는 단말은 제2 서브프레임 및 제4 서브프레임 동안 NR V2X 자원들을 이용하여 NR 기반의 신호 를 송신 또는 수신할 수 있다. 일 예로, 각 서브프레임은 2 개의 슬랏(slot)으로 구성될 수 있다. 제2 서브프레 임 및 제4 서브프레임 동안, LTE V2X 기술을 지원하는 단말은 LTE V2X 자원들에 대해 비활성화 (Disabled)될 수 있다. 도 2b를 참고할 때, LTE V2X 기술이 제5 서브프레임 및 제7 서브프레임동안 사용될 수 있고, NR V2X 기술이 제6 서브프레임 중 일부 슬랏(slot)과 제7 서브프레임동안 사용될 수 있다. LTE V2X 기술을 지원하는 단말은 제5 서브프레임동안 LTE V2X 자원들을 이용하여 LTE 기반의 신호를 송신(Tx) 할 수 있다. 제5 서브프레임동안, NR V2X 자원들(NR V2X resources)을 이용한 송신 또는 수신 신호가 없을 수 있다(No Tx or Rx). NR V2X 기술을 지원하는 단말은 제6 서브프레임에 포함된 2개의 슬랏 중 적어도 하나의 슬랏 동안 NR V2X 자원들을 이용하여 NR 기반의 신호를 송신할 수 있다. 일 예로, 제6 서브프레임에 포함된 2 개의 슬랏 중 첫번째 슬랏을 이용하여, 단말이 NR 기반의 신호를 송신할 수 있다. LTE V2X 기술을 지원하는 단 말은 제7 서브프레임동안 LTE V2X 자원들을 이용하여 LTE 기반의 신호를 수신(Rx) 할 수 있다. NR V2X 기 술을 지원하는 단말은 제7 서브프레임동안 NR V2X 자원들을 이용하여 NR 기반의 신호를 수신할 수 있다. TDM 방식에 기초하여 LTE V2X 기술과 NR V2X 기술이 공존하는 상황에서, 주변에 LTE V2X만을 지원하는 단말이 없는데도 불구하고, NR V2X 기술과 LTE V2X 기술을 모두 지원하는 단말이 LTE V2X 기술을 사용하는 것은 비효율 적이다. 즉, 이러한 방식은 무선 자원의 사용 효율이 저하되는 방법이고, 단말의 전력 사용 측면에서도 비효율적이다. 따라서 일 실시예에 따라서, LTE V2X 기술을 상황에 따라, 단말이 오프(off) 할 수 있다면 효율적인 V2X 서비스가 제공될 수 있다. 본 개시는 LTE V2X 기술과 NR V2X 기술을 동시에 지원하는 단말이 TDM 방식으로 자원을 할당 받는 경우, LTE V2X 기술을 최소로 사용하고 NR V2X 기술의 사용을 최대화 하는 단말을 제공하는 것을 목적으로 한다. 도 3은 본 개시의 일 실시예에 따른 차량용 전자 장치의 구성을 나타내는 블록도이다. 차량용 전자 장치는 후술하는 제1 단말, 제2 단말, 및 제3 단말에 대응될 수 있다. 도 3을 참조하면, 차량용 전자 장치는 제1 통신 모듈, 제2 통신 모듈, 프로세서 및 메모리 를 포함할 수 있다. 일 실시예에 따른 제1 통신 모듈은 이동 통신 모듈을 포함할 수 있으며, 기지국과 이동 통신 방법으로 데 이터를 송수신할 수 있다. 이동 통신 방법은 4G 통신 방법 또는 3G 통신 방법을 포함할 수 있다. 다만, 이에 한 정되지 않는다. 제1 통신 모듈은 차량용 전자 장치의 커버리지에 포함된 적어도 하나의 전자 장치와, 제1 무선 액세스 기술의 V2X 통신에 대응하는 제1 통신 유형의 통신을 수행할 수 있다. 일 예로, 제1 무선 액세 스 기술의 V2X 통신은 LTE V2X 기술을 포함할 수 있다. 일 실시예에 따른 제2 통신 모듈은 이동 통신 모듈을 포함할 수 있으며, 기지국과 이동 통신 방법으로 데 이터를 송수신할 수 있다. 이동 통신 방법은 mmWave 대역 기반의 5G 통신 방법, 또는 6Ghz 이하의 대역(sub-6 대역) 기반의 5G 통신 방법을 포함할 수 있다. 다만, 이에 한정되지 않는다. 제2 통신 모듈은 차량용 전자 장치의 커버리지에 포함된 적어도 하나의 전자 장치와, 제2 무선 액세스 기술의 V2X 통신에 대응하는 제2 통신 유형의 통신을 수행할 수 있다. 일 예로, 제2 무선 액세스 기술의 V2X 통신은 NR V2X 기술을 포함할 수 있 다. 또한, 제1 통신 모듈은 제1 안테나 모듈을 포함할 수 있으며, 제2 통신 모듈은 제2 안테나 모듈 을 포함할 수 있다. 제1 안테나 모듈 및 제2 안테나 모듈에서는 이동 통신 방법을 위한 빔이 생 성될 수 있으며, 제1 안테나 모듈 및 제2 안테나 모듈은 빔의 진행 방향이나 빔의 형상 등을 조절하 는 빔포밍을 수행할 수 있다. 프로세서는 차량용 전자 장치의 전반적인 동작을 제어할 수 있다. 프로세서는 메모리에 저 장되는 하나 이상의 프로그램들을 실행할 수 있다. 일 실시예에 따른 메모리는 차량용 전자 장치를 구동하고 제어하기 위한 다양한 데이터, 프로그램 또는 어플리케이션을 저장할 수 있다. 프로세서는 산술, 로직 및 입출력 연산과 시그널 프로세싱을 수행하는 하드웨어 구성 요소로 구성될 수 있 다. 프로세서는 예를 들어, 중앙 처리 장치(Central Processing Unit), 마이크로 프로세서 (microprocessor), 그래픽 프로세서(Graphic Processing Unit), ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), 및 FPGAs(Field Programmable Gate Arrays) 중 적어도 하나로 구성될 수 있으나, 이에 제한되는 것은 아니다. 메모리는 예를 들어, 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미 디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 롬(ROM, Read-Only Memory), 및 EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory) 중 적어도 하나를 포함하는 비휘발성 메모리 및 램(RAM, Random Access Memory) 또는 SRAM(Static Random Access Memory)과 같은 휘발성 메모리를 포함할 수 있다. 메모리에는 프로세서가 판독할 수 있는 명령어들, 데이터 구조, 및 프로그램 코드(program code)가 저장될 수 있다. 이하의 실시예에서, 프로세서는 메모리에 저장된 프로그램의 명령어들 또는 코드들을 실 행함으로써 구현될 수 있다. 일 실시예에 따른 프로세서는 적어도 하나의 외부 장치로부터, 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 나타내는 브로드캐스트 메시지를 수신하도록 상기 제1 통신 모듈을 제어할 수 있다. 프로세서는 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시킬 수 있다. 프로세서(33 0)는 적어도 하나의 외부 장치와 통신을 수행하도록 제2 통신 모듈을 제어할 수 있다. 일 실시예에 따른 프로세서는 차량용 전자 장치가 지원하는 통신 유형을 요청하는 정보를 포함하는 요청 메시지를 수신하도록 제1 통신 모듈을 제어할 수 있다. 프로세서는 요청 메시지에 기초하여, 차 량용 전자 장치가 지원하는 통신 유형과 관련된 정보를 포함하는 응답 메시지를 전송하도록 제1 통신 모듈 을 제어할 수 있다. 일 실시예에 따른 프로세서는 요청 메시지 및 브로드캐스트 메시지에 기초하여, 차량용 전자 장치가 포함된 커버리지 내의 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별할 수 있다. 프로세서 는 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보에 기초하여, 상기 제1 통신 모듈의 활성화 또는 비활성화를 식별할 수 있다. 일 실시예에 따른 프로세서는 차량용 전자 장치가 지원하는 통신 유형을 요청하는 정보를 포함하는 요청 메시지 및 상기 브로드캐스트 메시지에 기초하여, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보가 제1 통신 유형에 대응하는지 여부를 식별할 수 있다. 일 실시예에 따른 프로세서는 브로드캐스트 메시지에 기초하여, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별할 수 있다. 프로세서는 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보에 기초하여, 제1 통신 모듈의 활성화 또는 비활성화 여부를 식별할 수 있다. 일 실시예에 따른 프로세서는 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보가 제2 통신 유 형에 대응하는 경우, 제1 통신 모듈을 비활성화할 수 있다. 일 실시예에 따른 프로세서는 제1 통신 유형을 위해 할당된 시간 구간에서, 브로드캐스트 메시지 또는 요 청 메시지를 센싱할 수 있다. 프로세서는 임계 값에 기초하여, 브로드캐스트 메시지 또는 요청 메시지를 검출할 수 있다. 프로세서는 브로드캐스트 메시지 또는 요청 메시지가 검출된 경우, 통신 유형을 요청하는 정보, 또는 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별할 수 있다. 일 실시예에 따른 프로세서는 브로드캐스트 메시지 또는 요청 메시지를 센싱한 결과에 기초하여, 상기 제1 통신 유형을 위해 할당된 시간 구간을 식별할 수 있다. 일 실시예에 따른 프로세서는 제2 단말로부터, 제1 통신 유형을 위해 할당된 시간 구간에서 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 수신하도록 제1 통신 모듈을 제어할 수 있다. 프로세서 는 제1 브로드캐스트 메시지에 기초하여, 제1 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화 여부를 식별할 수 있다. 프로세서는 식별 결과에 기초하여, 제1 단말의 제1 통신 유형에 대 응하는 통신 모드의 활성화 또는 비활성화를 수행할 수 있다. 일 실시예에 따른 프로세서는 제1 브로드캐스트 메시지에 포함된 통신 유형을 요청하는 정보에 기초하여, 제1 단말이 지원하는 적어도 하나의 통신 유형을 식별할 수 있다. 일 실시예에 따른 프로세서는 제1 브로드캐스트 메시지에 기초하여, 통신 유형을 요청하는 정보에 대한 응 답으로, 제2 통신 유형을 지시하는 정보를 포함하는 제2 브로드캐스트 메시지를 전송하도록 제1 통신 모듈(31 0)을 제어할 수 있다. 일 예로, 제2 브로드캐스트 메시지는 제1 통신 유형에 대응하는 메시지이고, 제1 단말 이 포함된 커버리지 내의 적어도 하나의 다른 단말로 브로드캐스트될 수 있다. 일 실시예에 따른 프로세서는 제1 브로드캐스트 메시지에 기초하여, 제1 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말로부터, 다른 단말의 통신 유형을 지시하는 정보를 포함하는 적어도 하나의 제2 브로드 캐스트 메시지를 수신하도록 제1 통신 모듈을 제어할 수 있다. 프로세서는 제1 브로드캐스트 메시지 및 적어도 하나의 제2 브로드캐스트 메시지에 기초하여, 제1 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말의 통신 유형을 식별할 수 있다. 프로세서는 상기 적어도 하나의 다른 단말의 통신 유형에 기초 하여, 제1 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 식별할 수 있다. 일 실시예에 따른 프로세서는 제1 브로드캐스트 메시지 및 적어도 하나의 제2 브로드캐스트 메시지에 기초 하여, 제1 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말의 통신 유형이 제1 통신 유형에 대응하는 지 여부를 식별할 수 있다. 제1 단말이 포함된 커버리지 내의 모든 다른 단말의 통신 유형이 제2 통신 유형 에 대응하는 경우, 제1 통신 유형에 대응하는 통신 모드는 비활성화되고, 제1 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말의 통신 유형이 제1 통신 유형에 대응하는 경우, 제1 통신 유형에 대응하는 통신 모드 는 활성화될 수 있다. 일 실시예에 따른 프로세서는 제1 브로드캐스트 메시지에 기초하여, 제2 단말이 지원하는 통신 유형을 지시하는 정보를 식별할 수 있다. 프로세서는 제2 단말이 지원하는 통신 유형을 지시하는 정보에 기초하여, 제1 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화 여부를 식별할 수 있다. 프 로세서는 제2 단말이 지원하는 통신 유형을 지시하는 정보가 제2 통신 유형에 대응하는 경우, 제1 단 말의 제1 통신 유형에 대응하는 통신 모드를 비활성화할 수 있다. 일 실시예에 따른 프로세서는 제1 통신 유형을 위해 할당된 시간 구간에서, 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 센싱할 수 있다. 프로세서는 임계 값에 기초하여, 제1 브로드캐스트 메시지를 검출 할 수 있다. 프로세서는 제1 브로드캐스트 메시지가 검출된 경우, 제1 브로드캐스트 메시지에 포함된 통신 유형을 요청하는 정보, 또는 제2 단말이 지원하는 통신 유형을 지시하는 정보 중 적어도 하나를 식별할 수 있다. 일 실시예에 따른 프로세서는 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 센싱한 결과에 기초하 여, 제1 통신 유형을 위해 할당된 시간 구간을 식별할 수 있다. 일 실시예에 따른 프로세서는 제2 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말에게, 제1 통 신 유형을 위해 할당된 시간 구간에서 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 전송하도록 제1 통 신 모듈을 제어할 수 있다. 프로세서는 시간 구간에서, 적어도 하나의 다른 단말로부터 제1 통신 유 형에 대응하는 제2 브로드캐스트 메시지를 수신할 수 있다. 프로세서는 제1 브로드캐스트 메시지, 또는 제 2 브로드캐스트 메시지 중 적어도 하나에 기초하여, 제2 단말의 제1 통신 유형에 대응하는 통신 모드의 활 성화 또는 비활성화 여부를 식별할 수 있다. 프로세서는 식별 결과에 기초하여, 제2 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행하도록 구성될 수 있다. 한편, 도 3에 도시된 차량용 전자 장치의 블록도는 일 실시예를 위한 블록도이다. 블록도의 각 구성요소는 실제 구현되는 차량용 전자 장치의 사양에 따라 통합, 추가, 또는 생략될 수 있다. 즉, 필요에 따라 2 이 상의 구성요소가 하나의 구성요소로 합쳐지거나, 혹은 하나의 구성요소가 2 이상의 구성요소로 세분되어 구성될 수 있다. 또한, 각 블록에서 수행하는 기능은 실시예들을 설명하기 위한 것이며, 그 구체적인 동작이나 장치는 본 발명의 권리범위를 제한하지 아니한다. 본 개시에서, 제1 통신 유형은 제1 무선 액세스 기술(Radio access technology)의 V2X에 대응될 수 있다. 일 예로, 제1 통신 유형은 LTE V2X에 대응될 수 있다. 본 개시에서, 제2 통신 유형은 제2 무선 액세스 기술의 V2X에 대응될 수 있다. 일 예로, 제2 통신 유형은 NR V2X에 대응될 수 있다. 본 개시에서, 제1 단말, 제2 단말 및 제3 단말은 제1 통신 유형 및 제2 통신 유형을 지원하는 단말 에 대응될 수 있다. 본 개시에서, 제1 단말, 제2 단말 및 제3 단말은 제1 통신 유형에 대응하는 통신 모드를 활성화 (enable) 또는 비활성화(disable)할 수 있다. 제1 통신 유형에 대응하는 통신 모드가 비활성화된다는 것은, 제1 통신 유형 및 제2 통신 유형을 지원하는 단말이 제2 통신 유형에 기초하여 통신을 수행하는 것을 의미할 수 있 다. 예로, 제1 통신 유형에 대응하는 통신 모드가 비활성화된다는 것은, LTE V2X 기술과 NR V2X 기술을 지원하 는 단말이 NR V2X 기술에 기초하여 통신을 수행하는 것을 의미할 수 있다. 반면, 제1 통신 유형에 대응하는 통 신 모드가 활성화된다는 것은, LTE V2X 기술과 NR V2X 기술을 지원하는 단말이 LTE V2X 기술에 기초하여 통신을 수행하는 것을 의미할 수 있다. 본 개시에서, 제1 통신 유형에 대응하는 통신 모드가 비활성화된다는 것은 비활성화 상태의 제1 통신 유형에 대 응하는 통신 모드가 비활성화된 상태로 유지되는 것을 포함할 수 있다. 본 개시에서, 제1 통신 유형에 대응하는 통신 모드가 활성화된다는 것은 활성화 상태의 제1 통신 유형에 대응하 는 통신 모드가 활성화된 상태로 유지되는 것을 포함할 수 있다. 본 개시에서, LTE에 기초한 통신을 지원하는 단말은 LTE V2X 기술 만을 지원할 수 있다. 또한, NR에 기초한 통 신을 지원하는 단말은 NR V2X 기술과 LTE V2X 기술을 동시에 지원할 수 있다. 본 개시에서, 브로드캐스트 메시지는 제1 브로드캐스트 메시지 및 제2 브로드캐스트 메시지를 포함할 수 있다. 브로드캐스트 메시지는 기본 안전 메시지(Basic Safety Message, 이하 BSM)를 더 포함할 수 있다. BSM은 주기적 으로 전송되는 안전 메시지 (Safety massage)를 의미할 수 있다. 본 개시에서, 브로드캐스트 메시지를 송신 또는 수신하는 것은, 데이터, 신호, 제어 정보 등일 포함된 메시지를 브로드캐스트 방식으로 송신 또는 수신하는 것을 의미할 수 있다. 브로드캐스트 메시지를 송신 또는 수신하는 것은, 커버리지 내에 포함된 특정되지 않은 다수의 단말들에게 해당 메시지를 송신하는 것, 또는 수신하는 것을 의미할 수 있다. 본 개시에서, 단말은 차량용 전자 장치, 차량에 장착될 수 있는 전자 장치, 또는 차량 등을 의미할 수 있으며, 상술한 예에 한정되지 않는다. 본 개시에서, 단말이 통신 유형을 지원한다는 의미는, 단말이 해당 RAT에 대응되는 V2X 기술에 기초하여 통신을 수행할 수 있음을 의미할 수 있다. 일 예로, 단말이 제1 통신 유형을 지원한다는 의미는, 단말이 LTE V2X 기술 에 기초하여 데이터, 메시지, 제어 정보, 신호 등을 송신 또는 수신할 수 있고, LTE V2X 기술에서 할당한 시간 대역 및 주파수 대역에서 LTE 신호가 존재하는지 여부를 센싱할 수 있음을 의미할 수 있다. 도 4a은 본 개시의 일 실시예에 따른 차량용 전자 장치가 V2X (Vehicle to-Everything) 통신을 수행하는 방법의 흐름도이다. 일 실시예에 따른 차량용 전자 장치는 후술하는 제1 단말에 대응할수 있다. 단계 410에서, 차량용 전자 장치는 적어도 하나의 외부 장치로부터, 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 나타내는 브로드캐스트 메시지를 수신하도록 제1 통신 모듈을 제어할 수 있다. 일 실시예에 따른 차량용 전자 장치는 상기 차량용 전자 장치가 지원하는 통신 유형을 요청하는 정보를 포 함하는 요청 메시지를 수신하도록 상기 제1 통신 모듈을 제어할 수 있다. 차량용 전자 장치는 요청 메시지 에 기초하여, 상기 차량용 전자 장치가 지원하는 통신 유형과 관련된 정보를 포함하는 응답 메시지를 전송하도 록 상기 제1 통신 모듈을 제어할 수 있다. 일 실시예에 따른 브로드캐스트 메시지는 요청 메시지에 대한 적어도 하나의 외부 장치의 응답 메시지에 대응할 수 있다. 일 실시예에 따른 요청 메시지는 BSM (Basic Safety Message)과 함께 전송되고, 요청 메시지는 기 설정된 주기 에 기초하여 전송될 수 있다. 일 실시예에 따른 브로드캐스트 메시지는 BSM (Basic Safety Message)과 함께 전송될 수 있다. 단계 420에서, 차량용 전자 장치는 상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시킬 수 있다. 일 실시예에 따른 차량용 전자 장치는 상기 요청 메시지 및 상기 브로드캐스트 메시지에 기초하여, 상기 차량용 전자 장치가 포함된 커버리지 내의 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별할 수 있다. 차량용 전자 장치는 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보에 기초 하여, 상기 제1 통신 모듈의 활성화 또는 비활성화를 식별할 수 있다. 일 실시예에 따른 차량용 전자 장치는 차량용 전자 장치가 지원하는 통신 유형을 요청하는 정보를 포 함하는 요청 메시지 및 브로드캐스트 메시지에 기초하여, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형 에 대한 정보가 제1 통신 유형에 대응하는지 여부를 식별할 수 있다. 일 실시예에 따른 차량용 전자 장치는 브로드캐스트 메시지에 기초하여, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별할 수 있다. 차량용 전자 장치는 적어도 하나의 외부 장치가 지원 하는 통신 유형에 대한 정보에 기초하여, 제1 통신 모듈의 활성화 또는 비활성화 여부를 식별할 수 있다. 일 실시예에 따른 차량용 전자 장치는 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보가 제2 통신 유형에 대응하는 경우, 상기 제1 통신 모듈을 비활성화할 수 있다. 단계 430에서, 차량용 전자 장치는 적어도 하나의 외부 장치와 통신을 수행하도록 상기 제2 통신 모듈을 제어할 수 있다. 일 실시예에 따른 차량용 전자 장치는 상기 요청 메시지 및 상기 브로드캐스트 메시지에 기초하여, 상기 차량용 전자 장치가 포함된 커버리지 내의 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별할 수 있다. 차량용 전자 장치는 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보에 기초 하여, 상기 제1 통신 모듈의 활성화 또는 비활성화를 식별할 수 있다. 일 실시예에 따른 차량용 전자 장치는 제1 통신 유형을 위해 할당된 시간 구간에서, 브로드캐스트 메시지 또는 요청 메시지를 센싱할 수 있다. 차량용 전자 장치는 임계 값에 기초하여, 브로드캐스트 메시지 또는 요청 메시지를 검출할 수 있다. 차량용 전자 장치는 브로드캐스트 메시지 또는 요청 메시지가 검출된 경우, 통신 유형을 요청하는 정보, 또는 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 식별할 수 있다. 일 실시예에 따른 차량용 전자 장치는 브로드캐스트 메시지 또는 요청 메시지를 센싱한 결과에 기초하여, 제1 통신 유형을 위해 할당된 시간 구간을 식별할 수 있다. 일 실시예에 따른 제1 통신 유형을 위해 할당된 시간 구간은, 브로드캐스트 메시지 또는 요청 메시지의 수신을 위해, 고정적 또는 동적으로 차량용 전자 장치에게 할당될 수 있다. 도 4b는 본 개시의 일 실시예에 따른 차량에 장착된 제1 단말이 V2X (Vehicle to-Everything) 통신을 수행하는 방법의 흐름도이다. 단계 S450에서, 제1 단말은 제2 단말로부터, 제1 통신 유형을 위해 할당된 시간 구간에서 상기 제1 통 신 유형에 대응하는 제1 브로드캐스트 메시지를 수신할 수 있다. 일 실시예에 따른 제1 브로드캐스트 메시지는, 제2 단말이 포함된 커버리지 내의 적어도 하나의 단말이 지 원하는 통신 유형을 요청하는 정보, 또는 제2 단말이 지원하는 통신 유형을 지시하는 정보 중 적어도 하나 를 포함할 수 있다. 일 실시예에 따른 제1 단말은 제1 브로드캐스트 메시지에 포함된 통신 유형을 요청하는 정보에 기초하여, 제1 단말이 지원하는 적어도 하나의 통신 유형을 식별할 수 있다. 일 실시예에 따른 제1 단말은 제1 브로드캐스트 메시지에 기초하여, 통신 유형을 요청하는 정보에 대한 응 답으로, 제2 통신 유형을 지시하는 정보를 포함하는 제2 브로드캐스트 메시지를 전송할 수 있다. 일 예로, 제2 브로드캐스트 메시지는 제1 통신 유형에 대응하는 메시지일 수 있다. 2 브로드캐스트 메시지는 제1 단말이 포함된 커버리지 내의 적어도 하나의 단말들로 브로드캐스트될 수 있다. 일 실시예에 따른 제1 통신 유형을 위해 할당된 시간 구간은, 제1 통신 유형에 대응하는 제1 브로드캐스트 메시 지의 수신을 위해, 고정적 또는 동적으로 상기 제1 단말에게 할당될 수 있다. 일 실시예에 따른 제1 브로드캐스트 메시지는 BSM(Basic Safety Message)과 함께 전송될 수 있다. 제1 브로드캐 스트 메시지는 기 설정된 주기에 기초하여 전송될 수 있다. 일 실시예에 따른 제1 단말은 제1 통신 유형을 위해 할당된 시간 구간에서, 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 메시지를 센싱할 수 있다. 제1 단말은 임계 값에 기초하여, 제1 브로드캐스트 메시 지를 메시지를 검출할 수 있다. 제1 단말은 제1 브로드캐스트 메시지가 검출된 경우, 제1 브로드캐스트 메 시지에 포함된 통신 유형을 요청하는 정보, 또는 제2 단말이 지원하는 통신 유형을 지시하는 정보 중 적어도 하 나를 식별할 수 있다. 일 실시예에 따른 제1 단말은 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 센싱한 결과에 기초하 여, 제1 통신 유형을 위해 할당된 시간 구간을 식별할 수 있다. 단계 S460에서, 제1 단말은 제1 브로드캐스트 메시지에 기초하여, 제1 단말의 제1 통신 유형에 대응하 는 통신 모드의 활성화 또는 비활성화 여부를 식별할 수 있다. 일 실시예에 따른 제1 단말은 제1 브로드캐스트 메시지에 기초하여, 제1 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말로부터, 다른 단말의 통신 유형을 지시하는 정보를 포함하는 적어도 하나의 제2 브로드 캐스트 메시지를 수신할 수 있다. 일 실시예에 따른 제1 단말은 제1 브로드캐스트 메시지 및 적어도 하나의 제2 브로드캐스트 메시지에 기초 하여, 제1 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말의 통신 유형을 식별할 수 있다. 일 예로, 제1 단말은 제1 브로드캐스트 메시지 및 적어도 하나의 제2 브로드캐스트 메시지에 기초하여, 제1 단말(1 0)이 포함된 커버리지 내의 적어도 하나의 다른 단말의 통신 유형이 제1 통신 유형에 대응하는지 여부를 식별할 수 있다. 일 실시예에 따른 제1 단말은 적어도 하나의 다른 단말의 통신 유형에 기초하여, 제1 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 식별할 수 있다. 일 예로, 제1 단말이 포함된 커버리지 내의 모든 다른 단말의 통신 유형이 제2 통신 유형에 대응하는 경우, 제1 통신 유형에 대응하는 통신 모드는 비활성화될 수 있다. 다른 일 예로, 제1 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말의 통신 유 형이 제1 통신 유형에 대응하는 경우, 상기 제1 통신 유형에 대응하는 통신 모드는 활성화될 수 있다. 일 실시예에 따른 제1 단말은 제1 브로드캐스트 메시지에 기초하여, 제2 단말이 지원하는 통신 유형을 지시하는 정보를 식별할 수 있다. 본 개시의 실시예에 따른 제1 단말은 제2 단말이 지원하는 통신 유형을 지시하는 정보에 기초하여, 제1 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화 여부를 식별할 수 있다. 일 예로, 제2 단말이 지원하는 통신 유형을 지시하는 정보가 제2 통신 유형에 대응하는 경우, 제1 단말의 제1 통신 유형에 대응하는 통신 모드가 비활성화될 수 있다. 단계 S470에서, 제1 단말은 상기 식별 결과에 기초하여, 제1 단말의 제1 통신 유형에 대응하는 통신 모 드의 활성화 또는 비활성화를 수행할 수 있다. 도 5는 본 개시의 일 실시예에 따른 차량에 장착된 제2 단말이 V2X (Vehicle to-Everything) 통신을 수행하는 방법의 흐름도이다. 단계 S510에서, 제2 단말은 제2 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말에게, 제1 통신 유형을 위해 할당된 시간 구간에서 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 전송할 수 있다. 일 실시예에 따른 제1 브로드캐스트 메시지는, 제2 단말이 포함된 커버리지 내의 적어도 하나의 단말이 지 원하는 통신 유형을 요청하는 정보, 또는 제2 단말이 지원하는 통신 유형을 지시하는 정보 중 적어도 하나 를 포함할 수 있다. 일 실시예에 따른 제2 단말은 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 센싱한 결과에 기초하 여, 제1 통신 유형을 위해 할당된 시간 구간을 식별할 수 있다. 일 실시예에 따른 제1 통신 유형을 위해 할당된 시간 구간은, 상기 제1 통신 유형에 대응되는 메시지의 송신 또 는 수신 중 적어도 하나를 위해, 고정적 또는 동적으로 제1 단말 및 제2 단말에게 할당될 수 있다. 일 실시예에 따른 제1 브로드캐스트 메시지는 BSM(Basic Safety Message)과 함께 전송될 수 있고, 제1 브로드캐 스트 메시지는 기 설정된 주기에 기초하여 전송될 수 있다. 단계 S520에서, 제2 단말은 시간 구간에서, 적어도 하나의 다른 단말로부터 제1 통신 유형에 대응하는 제2 브로드캐스트 메시지를 수신할 수 있다. 일 실시예에 따른 제2 단말은 제1 브로드캐스트 메시지에 기초하여, 통신 유형을 요청하는 정보에 대한 응 답으로, 제1 통신 유형 또는 제2 통신 유형을 지시하는 정보를 포함하는 적어도 하나의 제2 브로드캐스트 메시 지를 수신할 수 있다. 일 실시예에 따른 제2 브로드캐스트 메시지는 제2 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말로 부터 브로드캐스트될 수 있다. 단계 S530에서, 제2 단말은 제1 브로드캐스트 메시지, 또는 제2 브로드캐스트 메시지 중 적어도 하나에 기 초하여, 제2 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화 여부를 식별할 수 있다. 일 실시예에 따른 제2 단말은 제1 브로드캐스트 메시지 및 적어도 하나의 제2 브로드캐스트 메시지에 기초 하여, 제2 단말이 포함된 커버리지 내의 적어도 하나의 단말의 통신 유형을 식별할 수 있다. 일 예로, 제2 단말은 제1 브로드캐스트 메시지 및 적어도 하나의 제2 브로드캐스트 메시지에 기초하여, 제2 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말의 통신 유형이 제1 통신 유형에 대응하는지 여부를 식별할 수 있다. 일 실시예에 따른 제2 단말은 적어도 하나의 단말의 통신 유형에 기초하여, 제2 단말의 제1 통신 유형 에 대응하는 통신 모드의 활성화 또는 비활성화를 식별할 수 있다. 일 예로, 제2 단말이 포함된 커버리지 내의 모든 다른 단말의 통신 유형이 제2 통신 유형에 대응하는 경우, 제1 통신 유형에 대응하는 통신 모드는 비 활성화될 수 있다. 다른 일 예로, 제2 단말이 포함된 커버리지 내의 적어도 하나의 다른 단말의 통신 유형 이 제1 통신 유형에 대응하는 경우, 제1 통신 유형에 대응하는 통신 모드는 활성화될 수 있다. 일 실시예에 따른 제2 단말은 제2 브로드캐스트 메시지에 기초하여, 상기 적어도 하나의 다른 단말이 지원 하는 통신 유형을 지시하는 정보를 식별할 수 있다. 제2 단말은 적어도 하나의 단말이 지원하는 통신 유형 을 지시하는 정보에 기초하여, 제2 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화 여 부를 식별할 수 있다. 일 예로, 제2 브로드캐스트 메시지는 제2 단말이 포함된 커버리지 내의 적어도 하나 의 다른 단말이 지원하는 통신 유형을 지시하는 정보를 포함할 수 있다. 일 예로, 제2 단말이 지원하는 통신 유형을 지시하는 정보가 제2 통신 유형에 대응하고, 적어도 하나의 단 말이 지원하는 통신 유형이 제1 통신 유형에 대응하는 경우, 제2 단말의 제1 통신 유형에 대응하는 통신 모 드가 활성화될 수 있다. 단계 S540에서, 제2 단말은 식별 결과에 기초하여, 제2 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행할 수 있다. 도 6는 본 개시의 일 실시예에 따른 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말이 데이터를 송수신하는 방법을 설명하기 위한 도면이다. 제1 단말, 제2 단말 및 제3 단말은 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말을 의미할 수 있다. 또한, 제4 단말은 LTE V2X 기술만을 지원하는 단말을 의미할 수 있다. 제1 커버리지은 LTE 기반 의 V2X을 위해 형성된 커버리지(coverage)를 의미할 수 있다. 제2 커버리지은 NR 기반의 V2X을 위해 형성된 커버리지를 의미할 수 있다. 이하의 도면들에서 상술한 단어의 정의는 동일하게 적용될 수 있다. 제1 단말, 제2 단말 및 제3 단말은 LTE 기반의 V2X 기술, 또는 NR 기반의 V2X 기술 중 적어도 하 나의 통신 기술에 기초하여 데이터 송수신을 수행할 수 있다. 제1 단말, 제2 단말 및 제3 단말은 LTE V2X 기술 및 NR V2X 기술의 브로드캐스트 메시지를 송수신할 수 있다. 제1 단말, 제2 단말 및 제3 단말은 제2 커버리지 내에서, NR V2X 기술에 기초한 데이터 송수신을 수행할 수 있다. 도 6와 같이, 제2 커버리지에 다른 RAT인 LTE 기반의 V2X 기술을 지원하는 제4 단말이 진입하는 경우, 제4 단말과 제1 단말, 제2 단말 및 제3 단말에 대해, LTE V2X 기술에 기초한 통신을 위해 제 1 커버리지가 생성될 수 있다. 본 개시의 실시예에 따른 제1 단말, 제2 단말, 또는 제3 단말 중 적어도 하나의 단말은 LTE V2X에 대응하는 통신 모드를 활성화(enable)할 수 있다. 제1 단말, 제2 단말 , 또는 제3 단말 중 적어도 하나의 단말은 제4 단말과의 통신을 수행하기 위해 제4 단말로 LTE 기반의 브로드캐스트 메시지를 송신하고, 제4 단말로부터 LTE 기반의 브로드캐스트 메시지를 수신할 수 있 다. 도 6의 케이스에서, LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말(예, 제1 단말, 제2 단말 및 제3 단말)은 LTE 기반의 브로드캐스트 메시지를 센싱하고, 센싱 결과에 따라서 LTE V2X에 대응하는 통신 모드를 활성화할 수 있다. 그리고, LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말은 LTE 기반의 브로드캐스트 메시 지를 송신 및 수신할 수 있다. 도 7은 본 개시의 일 실시예에 따른 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말이 데이터를 송수신하는 방법을 설명하기 위한 도면이다. 제5 단말 및 제6 단말은 LTE V2X 기술만을 지원하는 단말을 의미할 수 있다. 도 7은 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 제1 단말이 LTE 기반의 V2X을 위해 형성된 커버리지인 제1 커버리지에 진입하는 경우, 제1 단말의 동작 방법을 설명하기 위한 도면이다. 제1 단말은 LTE 기반의 브로드캐스트 메시지를 센싱하고, 센싱 결과에 따라서 LTE V2X에 대응하는 통신 모드를 활성화할 수 있다. 예로, 제1 단말은 제4 단말이 송신한 LTE 기반의 브로드캐스트 메시지를 센 싱 및 검출할 수 있다. 제1 단말은 LTE V2X 기술만을 지원하는 제4 단말과의 통신을 위해, LTE 기반 의 브로드캐스트 메시지를 송신 및 수신할 수 있다. 도 8은 본 개시의 일 실시예에 따른 제1 커버리지와 제2 커버리지가 중첩된 상황에서 LTE V2X 기술과 NR V2X 기 술을 모두 지원하는 단말의 동작 방법을 설명하기 위한 도면이다. 제1 단말, 제2 단말 및 제3 단말은 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말을 의미할 수 있다. 또한, 제4 단말, 제5 단말 및 제6 단말은 LTE V2X 기술만을 지원하는 단말을 의미할 수 있다. 제1 커버리지은 LTE 기반의 V2X을 위해 형성된 커버리지를 의미할 수 있다. 제2 커버리지은 NR 기반의 V2X을 위해 형성된 커버리지를 의미할 수 있다.도 8을 참고하면, 제2 단말은 제1 커버리지와 제2 커버리지에 포함되어 있을 수 있다. 제2 단말 은 LTE 기반의 브로드캐스트 메시지를 전송하고, 제1 단말 및 제3 단말은 LTE 기반의 브로드캐스트 메시지를 센싱할 수 있다. 기존 방식에 따르면, 제1 단말 및 제3 단말은 제2 단말이 전송한 LTE 기 반의 브로드캐스트 메시지를 검출하게 되고, 제1 단말 및 제3 단말은 LTE V2X에 대응하는 통신 모드를 활성화한다. 그러나, 단말의 효율적인 동작을 위해서는, 단말의 커버리지 내에 LTE V2X 기술만을 지원하는 단말 이 없으므로, 제1 단말 및 제3 단말은 LTE V2X 기술을 사용하지 않는 것이 유리하다. 일 실시예에 따른 제1 단말 및 제3 단말은 도 4에서 전술한 방법에 따라, 제1 단말 및 제3 단말 의 LTE V2X에 대응하는 통신 모드를 비활성화할 수 있다. 단말들 간의 동작 방법은 도 10 내지 도 13에서 보다 상세히 후술된다. 도 9은 본 개시의 일 실시예에 따른 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말의 커버리지 이동에 따른 동작 방법을 설명하기 위한 도면이다. 제1 단말, 제2 단말 및 제3 단말은 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말을 의미할 수 있다. 또한, 제4 단말, 제5 단말 및 제6 단말은 LTE V2X 기술만을 지원하는 단말을 의미할 수 있다. 제1 커버리지은 LTE 기반의 V2X을 위해 형성된 커버리지를 의미할 수 있다. 제2 커버리지은 NR 기반의 V2X을 위해 형성된 커버리지를 의미할 수 있다. 도 9을 참고하면, 제2 단말은 제1 단말 및 제3 단말과 형성한 제2 커버리지에서 벗어나, 제1 커버리지로 이동할 수 있다. 제2 단말은 이동에 따라 LTE 기반의 브로드캐스트 메시지를 전송하고, 제1 단말 및 제3 단말은 LTE 기반의 브로드캐스트 메시지를 센싱한다. 기존 방식에 따르면, 제1 단말 및 제3 단말은 제2 단말이 전송한 LTE 기반의 브로드캐스트 메시지를 검출하게 되고, 제1 단말 및 제3 단말은 LTE V2X에 대응하는 통신 모드를 활성화한다. 그러나, 단말의 효율적인 동작을 위해서는, 단말 의 커버리지 내에 LTE V2X 기술만을 지원하는 단말이 없으므로, 제1 단말 및 제3 단말은 LTE V2X 기술 을 사용하지 않는 것이 유리하다. 또한, 제2 단말의 커버리지 내에 LTE V2X 기술만을 지원하는 단말이 존재 하지 않는다면, 제2 단말 역시 LTE V2X 기술을 사용하지 않는 것이 유리하다. 일 실시예에 따른 제1 단말 및 제3 단말은 도 4에서 전술한 방법에 따라, 제1 단말 및 제3 단말 의 LTE V2X에 대응하는 통신 모드를 비활성화할 수 있다. 일 실시예에 따른 제2 단말은 도 5에서 전술한 방법에 따라, 제2 단말의 LTE V2X에 대응하는 통신 모드 를 비활성화할 수 있다. 단말들 간의 동작 방법은 도 10 내지 도 13에서 보다 상세히 후술된다. 도 10는 본 개시의 일 실시예에 따른 단말들이 요청 정보에 기초하여, 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행하기 위한 메시지의 송수신 흐름도를 도시한 도면이다. 도 10은 통신 유형을 요청하는 정보를 이용한 디스커버리(Discovery) 방식에 기초하여, 제1 단말, 제2 단말 및 제3 단말이 제1 통신 유형에 대응하는 통신 모드를 활성화 또는 비활성화하기 위해 메시지를 송수 신하는 방법을 도시한 도면이다. 제1 단말, 제2 단말 및 제3 단말은 제1 통신 유형(예, LTE V2X 기 술)과 제2 통신 유형(예, NR V2X 기술)을 모두 지원하는 단말을 의미할 수 있다. 제4 단말은 제1 통신 유형 만을 지원하는 단말을 의미할 수 있다. 일 예로, LTE V2X를 이용하여, 제2 단말은 메시지를 수신하는 단말(예, 제1 단말, 제2 단말, 제4 단말)의 디바이스 타입(device type)을 회신하라는 제1 브로드캐스트 메시지를 전송할 수 있다. 여기서, 디 바이스 타입은 단말이 지원하는 적어도 하나의 통신 유형을 의미할 수 있으며, 예로, 제1 통신 유형(예, LTE V2X 기술), 또는 제2 통신 유형(예, NR V2X 기술) 중 단말이 지원하는 적어도 하나의 통신 유형을 의미할 수 있 다. 제2 단말은 제1 단말, 제3 단말 및 제4 단말로부터 수신한 메시지에 기초하여, 제2 단말 의 주변에 있는 단말이 어떤 통신 유형을 지원하는 단말인지 확인할 수 있다. 그리고, 제2 단말은 제1 통신 유형에 대응하는 통신 모드를 활성화 또는 비활성화할지 여부를 결정할 수 있다. 일 예로, 제2 단말은 BSM(Basic Safety Message) 메시지를 브로드캐스팅할 때, 제1 브로드캐스트 메시지(예, 요청 정보가 포함된 요청 메시지(request message))를 함께 전송할 수 있다. BSM 메시지와 함께 제1 브로드캐스트 메시지를 송수신하는 방법은, 현재 표준 프로토콜을 고려할 때, 상위 레이어에서 동작하는 별도의 어플리케이션(application) 레이어가 이용될 수 있다. 일 예로, BSM은 주기적으로 브로드캐스트 되어 전송될 수 있다. 어플리케이션이 설치되면, BSM에 어플리케이션 레이어가 부착되어 전송될 수 있다. 일 예로, 어플리케이션 레이어에 요청(request) 정보가 포함되어 전송될 수 있다. BSM을 수신한 단말은 BSM에 포함된 정보와 어플리 케이션 레이어에 포함된 정보를 각각 디코딩할 수 있다. 본 실시예는, 3GPP가 제안하는 표준 프로토콜 (protocol)의 수정 없이 통신 시스템에 적용될 수 있는 장점이 있다. 하기에서 단말들의 동작이 보다 구체적으 로 설명될 수 있다. 단계 S1010-1 및 S1010-3에서, 제1 단말 및 제3 단말은 제1 브로드캐스트 메시지를 센싱할 수 있다. 제 1 통신 유형을 위해 할당된 시간 구간 및 주파수 채널에서, 제1 단말 및 제3 단말은 다른 단말이 제1 통신 유형에 대응하는 신호 또는 메시지를 전송하는지 여부를 식별하기 위해 센싱을 수행할 수 있다. 예로, 제1 단말 및 제3 단말은 LTE 신호에 대응되는 RF(radio frequency) 신호의 주파수를 스캐닝하고, LTE 신호 가 존재하는지 또는 존재하지 않는지를 식별할 수 있다. 단계 S1020에서, 제2 단말은 제1 브로드캐스트 메시지를 커버리지 내에 포함된 단말들로 전송할 수 있다. 제2 단말은 제1 통신 유형을 위해 할당된 시간 구간 및 주파수 채널에서 제1 브로드캐스트 메시지를 제1 단 말, 제3 단말 및 제4 단말로 브로드캐스팅할 수 있다. 일 예로, 제2 단말은 주기적으로 전송하 는 BSM과 함께 제1 브로드캐스트 메시지를 전송할 수 있다. 일 예로, BSM이 전송되는 주기와 제1 브로드캐스트 메시지가 전송되는 주기는 같을 수 있다. BSM이 1초에 10번 전송될 때, 어플리케이션 레이어도 1초에 10번 전송될 수 있다. 다른 일 예로, BSM이 전송되는 주기와 제1 브로 드캐스트 메시지가 전송되는 주기는 다를 수 있다. BSM이 1초에 10번 전송될 때, 어플리케이션 레이어는 1초에 5번만 전송될 수도 있다. 단계 S1030-1 및 S1030-2에서, 제1 단말 및 제3 단말은 제1 브로드캐스트 메시지를 검출할 수 있다. 예 로, 제1 단말 및 제3 단말은 LTE 신호의 수신 세기가 임계값 이상인지 여부를 식별하고, LTE 신호의 수 신 세기가 임계값 이상인 경우 해당 주파수를 검출(detect)할 수 있다. 본 개시의 일 실시예에 따른 제1 단말 및 제3 단말은 제1 통신 유형에 대응하는 제1 브로드캐스트 메 시지의 RSSI (Received Signal Strength Indicator)를 식별할 수 있다. 제1 단말 및 제3 단말은 제1 브로드캐스트 메시지의 RSSI와 임계 값을 비교할 수 있다. 제1 단말 및 제3 단말은 제1 브로드캐스트 메시지의 RSSI가 임계값보다 큰 경우, 제1 브로드캐스트 메시지의 유효성을 식별할 수 있다. 본 개시의 일 실시예에 따른 제1 단말 및 제3 단말은 제1 브로드캐스트 메시지를 확인하기 위해, 제1 통신 유형에 대응하는 모뎀(예, LTE V2X 모뎀)을 동작시킬 수 있다. 단계 S1040-1, S1040-3 및 S1040-4에서, 제1 단말, 제3 단말, 및 제4 단말은 제2 단말이 전송 한 제1 브로드캐스트 메시지 내의 정보를 식별할 수 있다. 일 예로, 제1 단말, 제3 단말, 및 제4 단말 은 제2 단말이 전송한 신호가 진짜 LTE 기반의 데이터(Data) 신호인지, 아니면 노이즈(Noise)인지를 식 별할 수 있다. 노이즈가 아니라면, 1 단말, 제3 단말, 및 제4 단말은 해당 신호에 대응되는 데이터 를 식별할 수 있다. 일 실시예에 따른 제1 단말, 제3 단말, 제4 단말은 제1 브로드캐스트 메시지에 포함된 제2 단말 이 포함된 커버리지 내의 적어도 하나의 단말이 지원하는 통신 유형을 요청하는 정보를 식별할 수 있다. 단계 S1050-1, S1050-3, S1050-4에서, 제1 단말, 제3 단말, 제4 단말은 단말의 통신 유형이 제1 통신 유형인지, 또는 제2 통신 유형인지 여부를 식별할 수 있다. 일 예로, 제1 통신 유형 및 제2 통신 유형을 지원하는 단말들은 제2 통신 유형(예, NR)에 대응하는 신호로 통신 이 가능하다. 따라서, 제1 단말 및 제3 단말은 제2 통신 유형으로 단말의 통신 유형을 식별할 수 있다. 반면, 제4 단말은 제1 통신 유형만을 지원하는 단말에 대응되므로, 단말의 통신 유형을 제1 통신 유형으로 식별할 수 있다. 단계 S1060-1, S1060-3, 및 S1060-4에서, 제1 단말, 제3 단말, 및 제4 단말은 각 단말의 통신 유 형(예, 제1 통신 유형, 또는 제2 통신 유형)을 지시하는 정보를 포함하는 제2 브로드캐스트 메시지를 전송할 수 있다. 일 예로, 제2 브로드캐스트 메시지는 제1 통신 유형에 대응하는 메시지일 수 있다. 단계 S1060-1에서, 제1 단말은 제2 통신 유형(예, NR V2X 기술)을 지시하는 정보를 포함하는 제2 브로드캐 스트 메시지를 제1 단말의 커버리지에 포함된 제3 단말 및 제2 단말로 전송할 수 있다. 단계 S1060-3에서, 제3 단말은 제2 통신 유형(예, NR V2X 기술)을 지시하는 정보를 포함하는 제2 브로드캐 스트 메시지를 제3 단말의 커버리지에 포함된 제1 단말 및 제2 단말로 전송할 수 있다. 단계 S1060-4에서, 제4 단말은 제1 통신 유형(예, LTE V2X 기술)을 지시하는 정보를 포함하는 제2 브로드캐 스트 메시지를 제4 단말의 커버리지에 포함된 제2 단말로 전송할 수 있다. 단계 S1070-1, S1070-2, 및 S1070-에서, 제1 단말, 제2 단말, 및 제3 단말은 커버리지 내의 다른 단말의 통신 유형을 식별할 수 있다. 일 실시예에 따르면, 제1 통신 유형 및 제2 통신 유형을 지원하는 단말(예, NR 단말)만이 제1 브로드캐스트 메 시지를 송신할 수 있다. 따라서, 제1 브로드캐스트 메시지를 수신한 단말은 제1 브로드캐스트 메시지를 전송한 단말이 제2 통신 유형을 지원하는 단말임을 식별할 수 있다. 단계 S1070-1에서, 제3 단말로부터 수신한 제2 통신 유형(예, NR V2X 기술)을 지시하는 정보를 포함하는 제 2 브로드캐스트 메시지와 제2 단말로부터 수신한 제1 브로드캐스트 메시지에 기초하여, 제1 단말은 제1 단말의 커버리지에 제2 통신 유형을 지원하는 2개의 단말이 있다고 식별할 수 있다. 또한, 제1 단말은 제1 단말의 커버리지에 제1 통신 유형을 지원하는 단말이 없다고 식별할 수 있다. 단계 S1070-2에서, 제3 단말로부터 수신한 제2 통신 유형(예, NR V2X 기술)을 지시하는 정보를 포함하는 제 2 브로드캐스트 메시지, 제1 단말로부터 수신한 제2 통신 유형(예, NR V2X 기술)을 지시하는 정보를 포함하 는 제2 브로드캐스트 메시지, 및 제4 단말로부터 수신한 제1 통신 유형(예, LTE V2X 기술)을 지시하는 정보 를 포함하는 제2 브로드캐스트 메시지에 기초하여, 제2 단말은 제2 단말의 커버리지에 제2 통신 유형을 지원하는 2개의 단말과 제1 통신 유형을 지원하는 1개의 단말이 있다고 식별할 수 있다. 단계 S1070-3에서, 제1 단말로부터 수신한 제2 통신 유형(예, NR V2X 기술)을 지시하는 정보를 포함하는 제 2 브로드캐스트 메시지와 제2 단말로부터 수신한 제1 브로드캐스트 메시지에 기초하여, 제3 단말은 제3 단말의 커버리지에 제2 통신 유형을 지원하는 2개의 단말이 있다고 식별할 수 있다. 또한, 제3 단말은 제3 단말의 커버리지에 제1 통신 유형을 지원하는 단말이 없다고 식별할 수 있다. 단계 S1080-1, S1080-2, 및 S1080-3에서, 제1 단말, 제2 단말, 및 제3 단말은 제1 통신 유형에 대 응하는 통신 모드의 활성화 또는 비활성화 여부를 식별할 수 있다. 또한, 제1 단말, 제2 단말, 및 제3 단말은 식별 결과에 기초하여, 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행할 수 있다. 단계 S1080-1에서, 제1 단말은 제1 통신 유형에 대응하는 신호의 송수신이 필요 없으므로, 제1 단말은 제1 통신 유형에 대응하는 통신 모드를 비활성화할 수 있다. 단계 S1080-2에서, 제2 단말은 제1 통신 유형에 대응하는 신호의 송수신이 필요하므로, 제2 단말은 제1 통신 유형에 대응하는 통신 모드가 활성화된 상태로 유지할 수 있다. 단계 S1080-3에서, 제3 단말은 제1 통신 유형에 대응하는 신호의 송수신이 필요 없으므로, 제3 단말은 제1 통신 유형에 대응하는 통신 모드를 비활성화할 수 있다. 본 개시의 일 실시예에 따른 제1 단말과 제3 단말은 제1 통신 유형에 대응하는 통신이 필요하지 않은 환경에서, 제1 통신 유형에 대응하는 통신 모드를 비활성화할 수 있다. 도 11은 본 개시의 일 실시예에 따른 단말들이 지시 정보에 기초하여, 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행하기 위한 메시지의 송수신 흐름도를 도시한 도면이다. 도 11은 통신 유형을 지시하는 정보를 이용한 지시자(Indicator) 방식에 기초하여, 제1 단말, 제2 단말 및 제3 단말이 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행하기 위해 메시지를 송 수신하는 방법을 도시한 도면이다. 일 예로, LTE V2X를 이용하여, 제1 단말 및 제3 단말이 제2 단말이 지원하는 RAT에 대해서 알 수 있도록, 제2 단말은 제2 단말이 지원하는 통신 유형을 지시하는 지시 정보를 포함하는 제1 브로드캐스 트 메시지를 전송할 수 있다. 제1 단말 및 제3 단말은 제2 단말로부터 수신한 메시지에 기초하여, 제2 단말이 어떤 통신 유형을 지원하는 단말인지 확인할 수 있다. 그리고, 제1 단말 및 제3 단말은 제1 통신 유형에 대응하는 통신 모드를 활성화 또는 비활성화 여부를 결정할 수 있다. 예로, 제1 단말 및 제3 단말은 제1 브로드캐스트 메시지에서 지시하는 정보가 제2 통신 유형(예, NR V2X 기술)인 경우 제1 통 신 유형에 대응하는 통신 모드의 비활성화 상태를 유지할 수 있다. 다른 예로, 제1 단말 및 제3 단말은제1 브로드캐스트 메시지에서 지시하는 정보가 제1 통신 유형(예, LTE V2X 기술)인 경우 제1 통신 유형에 대응 하는 통신 모드를 활성화 상태로 변경할 수 있다. 일 예로, 제2 단말은 BSM(Basic Safety Message) 메시지를 브로드캐스팅할 때, 제1 브로드캐스트 메시지(예, 지시 정보가 포함된 메시지)를 함께 전송할 수 있다. BSM 메시지와 함께 제1 브로드캐스트 메시지를 송수신하는 방법은, 현재 표준 프로토콜을 고려할 때, 상위 레이어에서 동작하는 별도의 어플리케이션 (application) 레이어가 이용될 수 있다. 일 예로, BSM은 주기적으로 브로드캐스트 되어 전송될 수 있다. 어플 리케이션이 설치되면, BSM에 어플리케이션 레이어가 부착되어 전송될 수 있다. 일 예로, 어플리케이션 레이어에 지시자(indicator) 정보가 포함되어 전송될 수 있다. BSM을 수신한 단말은 BSM에 포함된 정보와 어플리케이션 레이어에 포함된 정보를 각각 디코딩할 수 있다. 본 실시예는, 3GPP가 제안하는 표준 프로토콜(protocol)의 수 정 없이 통신 시스템에 적용될 수 있는 장점이 있다. 하기에서 단말들의 동작이 보다 구체적으로 설명될 수 있다. 전술한 내용과 중복되는 내용은 생략한다. 단계 S1110-1 및 S1110-3에서, 제1 단말 및 제3 단말은 제1 브로드캐스트 메시지를 센싱할 수 있다. 단계 S1120에서, 제2 단말은 제1 브로드캐스트 메시지를 커버리지 내에 포함된 단말들로 전송할 수 있다. 일 실시예에 따른 제1 브로드캐스트 메시지는 제2 단말이 지원하는 통신 유형인 제2 통신 유형을 지시하는 정보를 포함할 수 있다. 일 실시예에 따른 통신 유형을 지시하는 정보는 기 설정된 값에 대응될 수 있고, 한정되지 않은 일 예로, 제1 통신 유형을 지시하는 정보는 0에 대응되고, 제2 통신 유형을 지시하는 정보는 1에 대응될 수 있다. 단계 S1130에서, 제4 단말은 제2 브로드캐스트 메시지를 커버리지 내에 포함된 단말들로 전송할 수 있다 일 실시예에 따른 제2 브로드캐스트 메시지는 제4 단말이 지원하는 통신 유형인 제1 통신 유형을 지시하는 정 보를 포함할 수 있다. 일 실시예에 따른 제2 브로드캐스트 메시지는 제1 통신 유형에 대응할 수 있다. 단계 S1140-1 및 S1140-2에서, 제1 단말 및 제3 단말은 제1 브로드캐스트 메시지를 검출할 수 있다. 예 로, 제1 단말 및 제3 단말은 LTE 신호의 수신 세기가 임계값 이상인지 여부를 식별하고, LTE 신호의 수 신 세기가 임계값 이상인 경우 해당 주파수를 검출(detect)할 수 있다. 단계 S1150-1 및 S1150-3에서, 제1 단말 및 제3 단말은 제2 단말이 전송한 제1 브로드캐스트 메시 지 내의 정보를 식별할 수 있다. 일 실시예에 따른 제1 단말, 및 제3 단말 은 제1 브로드캐스트 메시지 에 포함된 제2 단말이 지원하는 통신 유형을 지시하는 정보를 식별할 수 있다. 단계 S1150-2에서, 제2 단말은 제4 단말이 전송한 제2 브로드캐스트 메시지 내의 정보를 식별할 수 있 다. 단계 S1160-1 및 S1160-3에서, 제1 단말 및 제3 단말은 제2 단말이 전송한 제1 브로드캐스트 메시 지 내의 정보에 기초하여, 제2 단말의 통신 유형을 식별할 수 있다. 단계 S1160-2에서, 제2 단말은 제4 단말이 전송한 제2 브로드캐스트 메시지 내의 정보에 기초하여, 제4 단말의 통신 유형을 식별할 수 있 다. 단계 S1170-1, S1170-2, 및 S1170-3에서, 제1 단말, 제2 단말, 및 제3 단말은 제1 통신 유형에 대 응하는 통신 모드의 활성화 또는 비활성화 여부를 식별할 수 있다. 또한, 제1 단말, 제2 단말, 및 제3 단말은 식별 결과에 기초하여, 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행할 수 있다. 단계 S1170-1에서, 제1 단말은 제1 통신 유형에 대응하는 신호의 송수신이 필요 없으므로, 제1 단말은 제1 통신 유형에 대응하는 통신 모드를 비활성화할 수 있다. 단계 S1170-2에서, 제2 단말은 제1 통신 유형에 대응하는 신호의 송수신이 필요하므로, 제2 단말은 제1 통신 유형에 대응하는 통신 모드가 활성화된 상태로 유지할 수 있다. 단계 S1170-3에서, 제3 단말은 제1 통신 유형에 대응하는 신호의 송수신이 필요 없으므로, 제3 단말은 제1 통신 유형에 대응하는 통신 모드를 비활성화할 수 있다. 본 개시의 일 실시예에 따른 제1 단말과 제3 단말은 제1 통신 유형에 대응하는 통신이 필요하지 않은 환경에서, 제1 통신 유형에 대응하는 통신 모드를 비활성화할 수 있다. 단말이 LTE V2X에 대응되는 신호를 센싱하는 경우, 단말은 LTE V2X에 대응되는 신호의 주파수 채널의 RSSI(Received Signal Strength Indicator)를 결정할 수 있다. LTE V2X에 대응되는 신호의 RSSI 가 임계 값 보 다 큰 경우, 단말은 해당 LTE 모뎀을 활성화 할 수 있다. 그리고, 단말은 LTE V2X에 대응되는 신호의 유효성을 판단할 수 있다. 단말은 센싱을 수행하는 주기를 고정적(static)으로 유지하거나, 또는 역동적(dynamic)으로 변 경할 수 있다. 일 예로, 단말은 센싱을 수행하는 서브 프레임(sub frame)의 주기를 고정적으로 유지하거나, 또 는 역동적으로 변경하여, NR V2X 사용 효율을 증가시킬 수 있다. 하기의 도 12 및 도 13은 센싱을 수행하기 위 한 시간 자원을 할당하는 방법에 대한 실시예이다. 도 12는 본 개시의 일 실시예에 따른 고정적 주기를 이용하여 센싱을 수행하는 방법을 설명하기 위한 도면이다. LTE에서 지원되는 SCS (Subcarrier Spcaing)이 15Khz인 서브프레임의 경우, 하나의 프레임은 제1 서브프 레임, 제2 서브프레임, 제3 서브프레임, 제4 서브프레임, 제5 서브프레임, 제6 서브프레임, 제7 서브프레임, 제8 서브프레임, 제9 서브프레임 및 제10 서브프레임 을 포함할 수 있다. 하나의 프레임은 10ms에 대응될 수 있다. NR에서 지원되는 SCS이 30Khz인 프레임은 20개의 시간 구간을 포함할수 있다. 프레임은 제1 시간 구간, 제2 시간 구간, 제3 시간 구간, 제4 시간 구간, 제5 시간 구간, 제6 시 간 구간, 제7 시간 구간, 제8 시간 구간, 제9 시간 구간, 제10 시간 구간, 제 12 시간 구간, 제12 시간 구간, 제13 시간 구간, 제14 시간 구간, 제15 시간 구간 , 제16 시간 구간, 제17 시간 구간, 제18 시간 구간, 제19 시간 구간, 및 제20 시간 구간을 포함할 수 있다. 하나의 시간 구간은 서브프레임, 또는 슬롯(slot)에 대응될 수 있다. 하나 의 프레임은 10ms에 대응될 수 있다. 도 12는 고정적인 TDM(Static TDM) 할당 방식에 기초하여, 단말이 제1 브로드캐스트 메시지를 센싱하는 방법을 설명하기 위한 도면이다. 도 12를 참고할 때, 제1 서브프레임, 제3 서브프레임, 제5 서브프레임, 제7 서브프레임 및 제9 서브프레임는 LTE V2X을 위한 송신 및 수신을 위해 할당될 수 있다. 제4 단말은 해당 서브프레임들에서 LTE 기반의 브로드캐스트 메시지를 송수신할 수 있다. 제2 서브프레임, 제4 서브프레임, 제6 서브프레임, 제8 서브프레임, 및 제10 서브프레 임에 대응되는 시간 구간인 제3 시간 구간, 제4 시간 구간, 제7 시간 구간, 제8 시간 구간, 제11 시간 구간, 제12 시간 구간, 제15 시간 구간, 제16 시간 구간, 제 19 시간 구간, 및 제20 시간 구간은 NR V2X을 위한 송신 및 수신을 위해 할당될 수 있다. LTE V2X을 위한 송신 및 수신을 위해 할당된 시간 구간(예, 제1 시간 구간, 제2 시간 구간, 제5 시 간 구간, 제6 시간 구간, 제9 시간 구간, 제10 시간 구간, 제13 시간 구간, 제 14 시간 구간, 제17 시간 구간 및 제18 시간 구간)에서, 일 실시예에 따른 제1 단말은 LTE 신호를 센싱할 수 있다. 일 예로, 제2 단말은 해당 시간 구간들에서 제1 브로드캐스트 메시지를 전송할 수 있다. 제1 단말은 해당 시간 구간들에서 제1 브로드캐스트 메시지를 센싱하고, 검출할 수 있다. 기존 방식에 따르면, LTE V2X 기술과 NR V2X 기술을 모두 지원하는 제1 단말은 제1 서브프레임에 대 응하는 제1 시간 구간 및 제2 시간 구간에서 LTE 모뎀을 동작 시키고, 제2 서브프레임에 대 응하는 제3 시간 구간 및 제4 시간 구간에서 NR 모뎀을 동작시켜야 했다. 그러나 본 개시의 실시예에 따른 제1 단말은 제1 시간 구간 및 제2 시간 구간에서 식별 결과에 따라서 LTE 모뎀을 동작시키거나, 동작시지키 않을 수 있다. (즉, on/off 가능) 즉, 제1 단말은 LTE 신호를 센싱하는 동안, LTE 모뎀(Modem)을 동작 시키지 않은 상태에서, 제1 단말은 커버리지 내에 포함된 다른 단 말이 LTE 기반의 메시지를 송신하는지 여부를 식별할 수 있다. 따라서, 본 개시의 실시예에 따른 단말은 LTE 모 뎀 자체를 켜기 위한 전력 소모를 줄일 수 있다. 또한, 기존 방식에 다르면, BSM을 전송하기 위해서, LTE V2X을 위한 송신 및 수신을 위해 할당된 시간 구간에서 단말은 송신을 수행해야했다. 그러나 본 개시의 실시예에 따르면, LTE 신호의 전송이 필요없다고 식별되면, LTE V2X을 위한 송신 및 수신을 위해 할당된 시간 구간에서 단말은 송신을 수행하지 않을 수 있다. 결과적으로 제1 단말의 전력 소모가 절감될 수 있고, 무선 자원의 효율도 증가될 수 있다. 도 13a 및 도 13b는 본 개시의 일 실시예에 따른 동적 주기를 이용하여 센싱을 수행하는 방법을 설명하기 위한 도면이다. 도 13a 및 도 13b는 동적인 TDM(dynamic TDM) 할당 방식에 기초하여, 제1 단말이 제1 브로드캐스트 메시지 를 센싱하는 방법을 설명하기 위한 도면이다. 제1 단말은 LTE 신호를 센싱한 결과에 기초하여, LTE V2X 신호의 송수신을 위한 시간 구간들과 NR V2X 신호 의 송수신을 위한 시간 구간들의 개수를 동적으로 결정할 수 있다. 도 12를 참고하면, 도 12는 총 20개의 시간 구간 중 10개의 시간 구간은 LTE 신호를 센싱하기 위해 LTE 및 NR을 모두 지원하는 단말에게 할당되었고, 나머지 10개의 시간 구간은 NR 신호를 송신 및 수신하기 위해 LTE 및 NR을 모두 지원하는 단말에게 할당되었다. 도 13a를 참고하면, 총 20개의 시간 구간 중 6개의 시간 구간은 LTE 신호를 센싱하기 위해 LTE 및 NR을 모두 지 원하는 단말에게 할당될 수 있다. 나머지 14개의 시간 구간은 NR 신호를 송신 및 수신하기 위해 LTE 및 NR을 모 두 지원하는 단말에게 할당될 수 있다. 도 13b를 참고하면, 총 20개의 시간 구간 중 2개의 시간 구간은 LTE 신호를 센싱하기 위해 LTE 및 NR을 모두 지 원하는 단말에게 할당될 수 있다. 나머지 184개의 시간 구간은 NR 신호를 송신 및 수신하기 위해 LTE 및 NR을 모두 지원하는 단말에게 할당될 수 있다. 상술한 실시예는 제1 단말의 주변 상황에 따라 RAT에 해당하는 자원 할당 비율을 동적으로 조정하는 방법에 관한 것이다. 정적 TDM 할당 방식의 장점을 유지하면서, NR V2X 기술을 최대화하여 단말이 사용할 수 있음에 효 과가 있다. 개시된 실시예에 있어서, 프로세서에서 수행되는 동작들 중 적어도 하나의 동작은 인공지능(AI: Artificial Intelligence) 기술을 이용하여 수행될 수 있다. 인공 지능(AI) 기술을 이용하여 수행되는 적어도 하나의 동작은 이하에서, 도 14 내지 도 16을 참조하여 상세히 설명한다. 도 14는 개시된 실시예에서 인공 지능 기술을 이용하여 수행되는 동작을 설명하기 위한 도면이다. 구체적으로, 프로세서에서 수행되는 'i) 상기 적어도 하나의 외부 장치로부터, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 나타내는 브로드캐스트 메시지를 수신하도록 상기 제1 통신 모듈을 제어하는 동작, ii) 상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 동작, 또는 iii) 상기 적어도 하나의 외부 장치와 통신을 수행하도록 상기 제2 통신 모듈을 제어하는 동작' 중 적어도 하나의 동 작은, 신경망(neural network)을 통한 연산을 수행하는 인공지능(AI: Artificial Intelligence) 기술을 이용하 여 수행될 수 있다. 인공 지능 기술(이하, 'AI 기술')은 신경망(Neural Network)을 통한 연산을 수행하여 입력된 데이터를 분석 및/ 또는 분류 등과 같은 처리를 하여 목적하는 결과를 획득하는 기술이다. 이러한 AI 기술은 알고리즘을 활용하여 구현될 수 있다. 여기서, AI 기술을 구현하기 위한 알고리즘 또는 알고 리즘의 집합을 신경망(Neural Network)이라 한다. 여기서, 신경망은 입력 데이터를 입력받고, 전술한 분석 및/ 또는 분류를 위한 연산을 수행하여, 결과 데이터를 출력할 수 있다. 이렇게, 신경망이 입력 데이터에 대응되는 결과 데이터를 정확하게 출력하기 위해서는, 신경망을 학습(training) 시킬 필요가 있다. 여기서, '학습 (training)'은 신경망으로 다양한 데이터들을 입력시키고, 입력된 데이터들을 분석하는 방법, 입력된 데이터들 을 분류하는 방법, 및/또는 입력된 데이터들에서 결과 데이터 생성에 필요한 특징을 추출하는 방법 등을 신경망 이 스스로 발견 또는 터득할 수 있도록 신경망을 훈련시키는 것을 의미할 수 있다. 구체적으로, 학습 과정을 통 하여, 신경망은 학습 데이터(예를 들어, 서로 다른 복수의 이미지들)를 학습(training)하여 신경망 내부의 가중 치 값들을 최적화하여 설정할 수 있다. 그리고, 최적화된 가중치 값을 가지는 신경망을 통하여, 입력된 데이터 를 스스로 학습(learning)함으로써, 목적하는 결과를 출력한다. 구체적으로, 신경망은 연산을 수행하는 내부의 레이어(layer)인 은닉 레이어(hidden layer)의 개수가 복수일 경 우, 즉 연산을 수행하는 신경망의 심도(depth)가 증가하는 경우, 심층 신경망으로 분류될 수 있다. 신경망의 예 로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 및 심층 Q-네트워크 (Deep Q-Networks) 등이 있으며, 전술한 예에 한정되지 않는다. 또한, 신 경망은 세분화될 수 있다. 예를 들어, CNN 신경망은 DCNN(Deep Convolution Neural Network) 또는 캡스넷(Capsnet) 신경망(미도시) 등으로 세분화 될 수 있다. 개시된 실시예에서, 'AI 모델'은 입력 데이터를 수신하고 목적하는 결과를 출력하도록 동작하는 적어도 하나의 레이어를 포함하는 신경망을 의미할 수 있다. 또한, 'AI 모델'은 신경망을 통한 연산을 수행하여 목적하는 결과 를 출력하는 알고리즘 또는 복수의 알고리즘의 집합, 이러한 알고리즘 또는 그의 집합을 실행하기 위한 프로세 서(processor), 이러한 알고리즘 또는 그의 집합을 실행하기 위한 소프트웨어, 또는 이러한 알고리즘 또는 그의 집합을 실행하기 위한 하드웨어를 의미할 수 있다. 도 14를 참조하면, 신경망은 학습 데이터(training data)를 입력받아 트레이닝(training)될 수 있다. 그 리고, 학습된 신경망은 입력단으로 입력 데이터를 입력받고, 출력단입력 데이터(141 1)를 분석하여 목적하는 결과인 출력 데이터를 출력하기 위한 연산을 수행할 수 있다. 신경망을 통한 연 산은 은닉 레이어(hidden layer)를 통하여 수행될 수 있다. 도 14에서는 편의상 은닉 레이어가 1단 의 계층으로 형성되도록 간략화하여 도시하였으나, 은닉 레이어는 복수개의 계층으로 형성될 수 있다. 구체적으로, 개시된 실시예에서, 신경망은 제 상기 적어도 하나의 외부 장치로부터, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 나타내는 브로드캐스트 메시지를 수신하도록 상기 제1 통신 모 듈을 제어하도록 학습될 수 있다. 또한, 개시된 실시예에서, 신경망은 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키도록 학습될 수 있다. 또한, 개시된 실시예에서, 신경망은 적어도 하나의 외부 장치와 통신을 수행하도록 상기 제2 통신 모듈을 제어하도록 학습될 수 있다. 개시된 실시예에서, 신경망은 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 센싱한 결과에 기초 하여, 제1 통신 유형을 위해 할당된 시간 구간을 식별하도록 학습될 수 있다. 개시된 실시예에서, 전술한 적어도 하나의 'i) 상기 적어도 하나의 외부 장치로부터, 상기 적어도 하나의 외부 장치가 지원하는 통신 유형에 대한 정보를 나타내는 브로드캐스트 메시지를 수신하도록 상기 제1 통신 모듈을 제어하는 동작, ii) 상기 브로드캐스트 메시지에 기초하여, 제1 통신 모듈을 비활성화시키는 동작, 또는 iii) 상기 적어도 하나의 외부 장치와 통신을 수행하도록 상기 제2 통신 모듈을 제어하는 동작'중 적어도 하나의 동 작을 수행하는 차량용 전자 장치와 구별되며, 차량 내에 위치하는 별도의 전자 장치(미도시) 또는 프로세 서(미도시) 내에 구현될 수 있다. 또한, 전술한 신경망을 통한 연산은 일 실시예에 따른 차량용 전자 장치와 무선 통신 네트워크를 통하여 통신할 수 있는 서버(미도시)에서 수행될 수 있다. 차량용 전자 장치와 서버(미도시) 간의 통신은 이하에 서, 도 14 및 도 15를 참조하여 자세히 후술하기로 한다. 신경망은 프로세서(예를 들어, 도 3의 330) 내에 구현 될 수 있다. 도 15는 서버와 연동하여 동작하는 개시된 실시예에 따른 전자 장치를 나타내는 도면이다. 서버는 통신 네트워크를 통하여 전자 장치, 예를 들어, 차량용 전자 장치와 데이터를 송수신 하며 데이터를 처리하는 서버, 서버 시스템, 서버 기반의 장치 등을 포함할 수 있다. 구체적으로, 차량용 전자 장치는 차량 내에 위치하는 전자 장치로, 개시된 실시예에 따른 제1 단말 , 제2 단말 또는 제3 단말이 될 수 있다. 개시된 실시예에서, 서버는 차량용 전자 장치와 통신하는 통신부 및 적어도 하나의 인스트럭 션을 수행하는 프로세서를 포함한다. 개시된 실시예에서, 서버는 AI 모델을 훈련시키고, 훈련된 AI 모델을 저장하고 있을 수 있다. 그리고, 서 버는 훈련된 AI 모델을 이용하여, i) 제2 단말로부터, 제1 통신 유형을 위해 할당된 시간 구간에서 상기 제1 통신 유형에 대응하는 제1 브로드캐스트 메시지를 수신하도록 상기 제1 통신 모듈을 제어하는 동작, ii) 상 기 제1 브로드캐스트 메시지에 기초하여, 제1 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활 성화 여부를 식별하는 동작, 및 iii) 상기 식별 결과에 기초하여, 상기 제1 단말의 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행하는 동작 중 적어도 하나의 동작 중 적어도 하나를 수행할 수 있다. 일반적으로, 차량용 전자 장치는 메모리 저장 용량, 연산의 처리 속도, 학습 데이터 셋의 수집 능력 등이 서버에 비하여 제한적일 수 있다. 따라서, 대용량 데이터의 저장 및 대용량의 연산량이 필요한 동작은 서 버에서 수행한 후, 통신 네트워크를 통하여 필요한 데이터 및/또는 이용되는 AI 모델을 차량용 전자 장치 에 전송할 수 있다. 그러면, 차량용 전자 장치는 대용량의 메모리 및 빠른 연산 능력을 갖는 프로세 서 없이도, 서버를 통하여 필요한 데이터 및/또는 AI 모델을 수신하여 이용함으로써, 빠르고 용이하게 필요한동작을 수행할 수 있다. 도 16은 도 15를 상세하게 설명하기 위한 도면이다. 도 16에 있어서, 도 16 및 도 15에서와 동일한 구성은 동일 한 도면 기호를 이용하여 도시하였다. 따라서, 도 16의 구성들을 설명하는데 있어서, 전술한 설명들과 중복되는 설명들은 생략한다. 구체적으로, 차량용 전자 장치는 개시된 실시예에 따른 제1 단말, 제2 단말 또는 제3 단말이 될 수 있다. 도 16의 차량용 전자 장치은 도 3에서 설명한 차량용 전자 장치와 동일한 경우를 예로 들어 설명 및 도시하였다. 도 16를 참조하면, 서버는, 통신부, 및 프로세서를 포함할 수 있다. 또한, 서버는 DB을 더 포함할 수 있다. 통신부는 차량용 전자 장치와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. 또한, 통 신부은, 근거리 통신 모듈, 유선 통신 모듈, 이동 통신 모듈, 방송 수신 모듈 등과 같은 적어도 하나의 통신 모듈을 포함한다. 여기서, 적어도 하나의 통신 모듈은 방송 수신을 수행하는 튜너, 블루투스, WLAN(Wireless LAN)(Wi-Fi), Wibro(Wireless broadband), Wimax(World Interoperability for Microwave Access), CDMA, WCDMA, 인터넷, 3G, 4G, 및/또는 5G, 밀리미터파(mmWAVE)를 이용하여 통신을 수행하는 방식 등 과 같은 통신 규격을 따르는 네트워크를 통하여 데이터 송수신을 수행할 수 있는 통신 모듈을 뜻한다. 예를 들어, 통신부가 밀리미터파(mmWAVE)를 이용하여 통신을 수행하면, 대용량의 데이터를 빠르게 송수신 할 수 있다. 구체적으로, 차량에서는 대용량의 데이터를 빠르게 수신함으로써, 차량의 안전에 필요한 데이터(예 를 들어, 자율 주행에 필요한 데이터, 네비게이션 서비스를 위해 필요한 데이터 등), 사용자 이용 컨텐츠(예를 들어, 영화, 음악 등)을 빠르게 제공함으로써, 차량의 안전성 및/또는 사용자의 편리성을 증가시킬 수 있다. 구체적으로, 통신부에 포함되는 이동 통신 모듈은 3G, 4G, 및/또는 5G 등의 통신 규격에 따르는 통신 네 트워크를 통하여 원거리에 위치하는 다른 장치(예를 들어, 서버(미도시))와 통신을 수행할 수 있다. 여기서, 원 거리에 위치하는 서버(미도시)와 통신을 수행하는 통신 모듈을 '원거리 통신 모듈'이라 칭할 수 있다. 프로세서는 서버의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 서버의 적어도 하나의 인스트럭션, 및 프로그램들 중 적어도 하나를 실행함으로써, 요구되는 동작들을 수행할 수 있다. 또한, DB는 메모리(미도시)를 포함할 수 있으며, 메모리(미도시) 내에 서버가 소정 동작을 수행하 기 위해서 필요한 적어도 하나의 인스트럭션, 프로그램, 데이터 중 적어도 하나를 저장할 수 있다. 또한, DB는 서버가 신경망에 따른 연산을 수행하기 위해서 필요한 데이터들을 저장할 수 있다. 구체적으로, 개시된 실시예에서, 서버는 도 14에서 설명한 신경망을 저장하고 있을 수 있다. 신경 망은 프로세서 및 DB 중 적어도 하나에 저장될 수 있다. 서버가 포함하는 신경망 은 학습이 완료된 신경망이 될 수 있다. 또한, 서버는 학습이 완료된 신경망을 통신부를 통하여 차량용 전자 장치의 제1 통신 모듈 또는 제2 통신 모듈으로 전송할 수 있다. 그러면, 차량용 전자 장치는 학습이 완료된 신경망을 획득 및 저장하고, 신경망을 통하여 목적하는 출력 데이터를 획득할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비 일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미 할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하 지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운 로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 전술한 실시예들은 독립적으로 구현될 수 있고, 결합되어 구현될 수도 있다. 이상에서 실시예들에 대하여 상세 하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발 명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속한다."}
{"patent_id": "10-2022-0041906", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 단말들의 V2X 기술에 기반한 통신 방법을 설명하기 위한 도면이다. 도 2a 및 도 2b는 서로 다른 RAT가 공존하는 상황에서 시간 자원을 할당하는 방식을 설명하기 위한 도면이다. 도 3은 본 개시의 일 실시예에 따른 차량용 전자 장치의 구성을 나타내는 블록도이다. 도 4a은 본 개시의 일 실시예에 따른 차량용 전자 장치가 V2X (Vehicle to-Everything) 통신을 수행하는 방법의 흐름도이다. 도 4b은 본 개시의 일 실시예에 따른 차량에 장착된 제1 단말이 V2X (Vehicle to-Everything) 통신을 수행하는 방법의 흐름도이다. 도 5는 본 개시의 일 실시예에 따른 차량에 장착된 제2 단말이 V2X (Vehicle to-Everything) 통신을 수행하는 방법의 흐름도이다. 도 6는 본 개시의 일 실시예에 따른 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말이 데이터를 송수신하는 방법을 설명하기 위한 도면이다. 도 7은 본 개시의 일 실시예에 따른 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말이 데이터를 송수신하는 방법을 설명하기 위한 도면이다. 도 8은 본 개시의 일 실시예에 따른 제1 커버리지와 제2 커버리지가 중첩된 상황에서 LTE V2X 기술과 NR V2X 기 술을 모두 지원하는 단말의 동작 방법을 설명하기 위한 도면이다. 도 9은 본 개시의 일 실시예에 따른 LTE V2X 기술과 NR V2X 기술을 모두 지원하는 단말의 커버리지 이동에 따른 동작 방법을 설명하기 위한 도면이다. 도 10는 본 개시의 일 실시예에 따른 단말들이 요청 정보에 기초하여, 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행하기 위한 메시지의 송수신 흐름도를 도시한 도면이다. 도 11은 본 개시의 일 실시예에 따른 단말들이 지시 정보에 기초하여, 제1 통신 유형에 대응하는 통신 모드의 활성화 또는 비활성화를 수행하기 위한 메시지의 송수신 흐름도를 도시한 도면이다. 도 12는 본 개시의 일 실시예에 따른 고정적 주기를 이용하여 센싱을 수행하는 방법을 설명하기 위한 도면이다. 도 13a 및 도 13b는 본 개시의 일 실시예에 따른 동적 주기를 이용하여 센싱을 수행하는 방법을 설명하기 위한 도면이다. 도 14는 개시된 실시예에서 인공 지능 기술을 이용하여 수행되는 동작을 설명하기 위한 도면이다. 도 15는 서버와 연동하여 동작하는 개시된 실시예에 따른 전자 장치를 나타내는 도면이다. 도 16은 도 15를 상세하게 설명하기 위한 도면이다."}
