{"patent_id": "10-2020-0161820", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0073912", "출원번호": "10-2020-0161820", "발명의 명칭": "임베디드 인공지능 설치 시스템 및 방법", "출원인": "(주)심플랫폼", "발명자": "임대근"}}
{"patent_id": "10-2020-0161820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "모니터링 대상이 되는 복수의 디바이스의 기종에 관한 디바이스 기종 정보를 저장하는 디바이스 기종 정보 저장부;상기 디바이스 기종 별로 하나 이상의 인공지능 설정 정보를 저장하는 인공지능 설정 정보 저장부;상기 디바이스 기종 각각의 실제 디바이스에 대한 디바이스 정보를 저장하는 디바이스 정보 저장부;사용자로부터 상기 복수의 디바이스 기종 중 하나에 대한 디바이스 추가 명령을 수신하고, 상기 인공지능 설정정보 저장부를 참고하여 상기 사용자로부터 상기 디바이스 추가 명령에 대응되는 디바이스 기종에 대한 인공지능 설정 정보 중 하나에 대한 선택 입력을 수신하는 인공지능 설정부; 및상기 디바이스 추가 명령에 포함된 실제 디바이스에 대한 디바이스 정보 및 상기 선택된 인공지능 설정 정보를상기 디바이스에 저장할 수 있는 포맷으로 변환하여 네트워크를 통해 상기 디바이스로 전송하는 디바이스 설정부; 를 포함하는 인공지능 설치 시스템."}
{"patent_id": "10-2020-0161820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "중앙처리장치 및 메모리를 구비하는 인공지능 설치 시스템에서의 인공지능 설정 방법에 있어서,모니터링 대상이 되는 복수의 디바이스의 기종에 관한 디바이스 기종 정보를 디바이스 기종 정보 저장부에 저장하는 디바이스 기종 정보 저장 단계;상기 디바이스 기종 별로 하나 이상의 인공지능 설정 정보를 인공지능 설정 정보 저장부에 저장하는 인공지능설정 정보 저장 단계;상기 디바이스 기종 각각의 실제 디바이스에 대한 디바이스 정보를 디바이스 정보 저장부에 저장하는 디바이스정보 저장 단계;사용자로부터 상기 복수의 디바이스 기종 중 하나에 대한 디바이스 추가 명령을 수신하고, 상기 인공지능 설정정보 저장부를 참고하여 상기 사용자로부터 상기 디바이스 추가 명령에 대응되는 디바이스 기종에 대한 인공지능 설정 정보 중 하나에 대한 선택 입력을 수신하는 인공지능 설정 단계; 및상기 디바이스 추가 명령에 포함된 실제 디바이스에 대한 디바이스 정보 및 상기 선택된 인공지능 설정 정보를상기 디바이스에 저장할 수 있는 포맷으로 변환하여 네트워크를 통해 상기 디바이스로 전송하는 디바이스 설정단계를 포함하는 인공지능 설정 방법."}
{"patent_id": "10-2020-0161820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항의 방법을 컴퓨터가 실행하도록 기능시키기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2020-0161820", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 설치 시스템 및 방법에 관한 것으로, 모니터링 대상이 되는 복수의 디바이스의 기종에 관한 디바이스 기종 정보를 저장하는 디바이스 기종 정보 저장부, 상기 디바이스 기종 별로 하나 이상의 인공지능 설 정 정보를 저장하는 인공지능 설정 정보 저장부, 상기 디바이스 기종 각각의 실제 디바이스에 대한 디바이스 정 (뒷면에 계속)"}
{"patent_id": "10-2020-0161820", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 임베디드 인공지능 설치 시스템 및 방법에 관한 것으로, 클라우드 시스템에서 사용자가 임베디드 디 바이스를 등록하고 인공지능 설정을 선택하여 손쉽게 사용자의 디바이스에 인공지능 분석을 적용할 수 있도록 하는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0161820", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 기술이 발달하면서 공정 또는 장비의 각종 정보를 센서로 모니터링하고 인공지능을 기반으로 이상상태 를 감지하거나 이상상태를 예측할 수 있도록 하여 공정의 효율을 높이고 관리에 필요한 노력을 최소화할 수 있 도록 하는 스마트 팩토리 기술이 활성화되고 있다. 종래기술인 한국 등록특허 제10-0570528호, \"공정장비 모니터링 시스템 및 모델생성 방법\"은 이처럼 인공지능을 이용하여 공정장비의 이상상태를 판별할 수 있도록 하는 시스템을 제시하고 있으며, 이와 같이 인공지능을 이용 하여 공정을 관리하기 위해서는 각 공정에서 도출되는 데이터를 분석하여 학습을 통해 인공지능 모델을 수립해 야 한다. 그러나, 이와 같이 공정장비를 모니터링 할 때에, 공정 또는 장비에 따라서 각기 다른 인공지능 알고리즘 및 모 델이 적용되어야 하고, 새로운 장비가 추가될 때마다 해당 장비의 인공지능 학습 데이터를 준비하여 새로운 인 공지능 모델을 학습하고, 학습된 인공지능 모델에 새로 연결된 장비의 데이터를 연결하여 분석하는 시스템을 새 롭게 개발해야 하는 불편함이 이었다. 한편, 임베디드 디바이스의 성능이 향상되고 낮은 성능의 장치에서도 구동 가능한 인공지능 기술이 발달하면서, 네트워크 연결이 어려운 장비에서도 인공지능 분석이 가능하도록 하는 임베디드 인공지능 기술이 확산되고 있다. 따라서, 사용자가 새로운 디바이스를 추가하는 경우에도 별도의 시스템 개발이 없이 임베디드 디바이스에 대해 서 인공지능 분석을 쉽게 적용할 수 있도록 하는 방법이 요구된다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-0570528호"}
{"patent_id": "10-2020-0161820", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 사용자가 클라우드 시스템에서 설정한 인공지능 설정을 임베디드 디바이스에 적용할 수 있도록 인공 지능 설정 데이터를 임베디드 디바이스에 전송하는 것을 목적으로 한다. 본 발명은 지속적인 네트워크 연결이 어려운 임베디드 디바이스에서, 인공지능 설정의 업데이트가 있는 경우에 만 일시적으로 접속하여 업데이트를 수행할 수 있도록 하는 것을 목적으로 한다. 본 발명은 사용자가 새로운 디바이스를 설치하는 경우에 별도의 시스템 개발 등의 과정 없이도 새로운 디바이스 에 대한 인공지능 분석을 가능하도록 하는 것을 목적으로 한다. 본 발명은 사용자가 새롭게 설치하는 디바이스의 기종과 동일한 기종에 적용한 바 있는 인공지능 설정을 선택하 여 새로운 디바이스에 인공지능 분석을 쉽게 적용할 수 있도록 하는 것을 목적으로 한다. 본 발명은 사용자가 인공지능 알고리즘과 학습 데이터를 선택하는 것만으로 쉽게 새로운 디바이스에 대한 인공 지능 분석이 가능하도록 하는 것을 목적으로 한다. 본 발명은 동일한 기종의 다른 디바이스들의 센싱 데이터를 해당 기종의 새로운 디바이스의 학습 데이터로 사용 할 수 있도록 함으로써, 디바이스 설치와 동시에 인공지능 분석이 가능하도록 하는 것을 목적으로 한다. 본 발명은 사용자가 동일한 기종의 다른 디바이스 중 선택한 디바이스의 센싱 데이터를 학습 데이터로 사용할 수 있도록 함으로써, 상황에 맞는 인공지능 설정을 생성할 수 있도록 하는 것을 목적으로 한다. 본 발명은 다른 디바이스의 센싱 정보에 대해서 사용자가 라벨링을 하고, 각 라벨에 대응되는 상태 정보를 선택 할 수 있도록 함으로써, 상황에 맞는 학습 데이터를 생성하여 인공지능 설정을 생성할 수 있도록 하는 것을 목 적으로 한다."}
{"patent_id": "10-2020-0161820", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위하여 본 발명의 일실시예에 따른 인공지능 설치 시스템은 모니터링 대상이 되는 복수 의 디바이스의 기종에 관한 디바이스 기종 정보를 저장하는 디바이스 기종 정보 저장부, 상기 디바이스 기종 별 로 하나 이상의 인공지능 설정 정보를 저장하는 인공지능 설정 정보 저장부, 상기 디바이스 기종 각각의 실제 디바이스에 대한 디바이스 정보를 저장하는 디바이스 정보 저장부, 사용자로부터 상기 복수의 디바이스 기종 중 하나에 대한 디바이스 추가 명령을 수신하고, 상기 인공지능 설정 정보 저장부를 참고하여 상기 사용자로부터 상기 디바이스 추가 명령에 대응되는 디바이스 기종에 대한 인공지능 설정 정보 중 하나에 대한 선택 입력을 수 신하는 인공지능 설정부, 상기 디바이스 추가 명령에 포함된 실제 디바이스에 대한 디바이스 정보 및 상기 선택 된 인공지능 설정 정보를 상기 디바이스에 저장할 수 있는 포맷으로 변환하여 네트워크를 통해 상기 디바이스로 전송하는 디바이스 설정부를 포함하여 구성될 수 있다."}
{"patent_id": "10-2020-0161820", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 사용자가 클라우드 시스템에서 설정한 인공지능 설정을 임베디드 디바이스에 적용할 수 있도록 인공 지능 설정 데이터를 임베디드 디바이스에 전송하는 효과가 있다. 본 발명은 지속적인 네트워크 연결이 어려운 임베디드 디바이스에서, 인공지능 설정의 업데이트가 있는 경우에 만 일시적으로 접속하여 업데이트를 수행할 수 있도록 하는 효과가 있다. 본 발명은 사용자가 새롭게 설치하는 디바이스의 기종과 동일한 기종에 적용한 바 있는 인공지능 설정을 선택하 여 새로운 디바이스에 인공지능 분석을 쉽게 적용할 수 있도록 하는 효과가 있다. 본 발명은 사용자가 인공지능 알고리즘과 학습 데이터를 선택하는 것만으로 쉽게 새로운 디바이스에 대한 인공 지능 분석이 가능하도록 하는 효과가 있다. 본 발명은 동일한 기종의 다른 디바이스들의 센싱 데이터를 해당 기종의 새로운 디바이스의 학습 데이터로 사용 할 수 있도록 함으로써, 디바이스 설치와 동시에 인공지능 분석이 가능하도록 하는 효과가 있다. 본 발명은 사용자가 동일한 기종의 다른 디바이스 중 선택한 디바이스의 센싱 데이터를 학습 데이터로 사용할 수 있도록 함으로써, 상황에 맞는 인공지능 설정을 생성할 수 있도록 하는 효과가 있다. 본 발명은 다른 디바이스의 센싱 정보에 대해서 사용자가 라벨링을 하고, 각 라벨에 대응되는 상태 정보를 선택 할 수 있도록 함으로써, 상황에 맞는 학습 데이터를 생성하여 인공지능 설정을 생성할 수 있도록 하는 효과가 있다."}
{"patent_id": "10-2020-0161820", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 본 발명을 설명함에 있어, 관 련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상 세한 설명은 생략하기로 한다. 또한 본 발명의 실시예들을 설명함에 있어 구체적인 수치는 실시예에 불과하며 이에 의하여 발명의 범위가 제한되지 아니한다. 본 발명에 따른 인공지능 설치 시스템은 중앙처리장치(CPU) 및 메모리(Memory, 기억장치)를 구비하고 인터넷 등 의 통신망을 통하여 다른 단말기와 연결 가능한 서버의 형태로 구성될 수 있다. 그러나 본 발명이 중앙처리장 치 및 메모리 등의 구성에 의해 한정되지는 아니한다. 또한, 본 발명에 따른 데이터 경계 도출 시스템은 물리 적으로 하나의 장치로 구성될 수도 있으며, 복수의 장치에 분산된 형태로 구현될 수도 있다. 다양한 장비에서 인공지능을 통한 분석을 활용하고자 하는 요구가 늘어나고 있지만, 클라우드 기반의 인공지능 분석을 위해서는 디바이스가 지속적으로 네트워크를 통해 외부 통신망에 연결되어야 하기 때문에, 보안 문제 등 이 발생될 수 있고, 네트워크를 아예 연결하지 않는 경우에는 인공지능 설정 등이 변경되는 경우에 이를 반영하 기 어려우므로, 본 발명에서는 업데이트가 필요한 경우에만 일시적으로 네트워크로 연결하여 인공지능 설정을 업데이트하고 실제 분석은 임베디드 디바이스에서 수행될 수 있도록 하는 것을 특징으로 한다. 도 1은 본 발명의 일실시예에 따른 인공지능 설치 시스템의 내부 구성을 도시한 도면이다. 본 발명의 일실시예에 따른 인공지능 설치 시스템은 디바이스 기종 정보 저장부, 인공지능 설정 정보 저장부, 디바이스 정보 저장부, 인공지능 설정부, 디바이스 설정부, 센싱 데이터 분석부 및 센싱 정보 저장부를 포함하여 구성될 수 있다. 각각의 구성요소들은 물리적으로 동일한 컴퓨터 시스템 내에서 동작하는 소프트웨어 모듈일 수 있으며, 물리적으로 2개 이상으로 분리된 컴퓨터 시스템이 서로 연동하여 동작할 수 있도록 구성된 형태일 수 있는데, 동일한 기능을 포함하는 다양한 실시형태가 본 발명의 권 리범위에 속한다. 디바이스 기종 정보 저장부는 모니터링 대상이 되는 복수의 디바이스의 기종에 관한 디바이스 기종 정보를 저장한다. 사용자가 설정하고자 하는 디바이스는 셀룰러(Cellular), 와이파이(Wi-Fi), 블루투스(Bluetooth), 지그비(Zig-Bee) 등 다양한 통신 모듈을 통하여 클라우드 시스템과 통신할 수 있는 네트워크 디바이스이거나, 자체적으로 인공지능을 구동시킬 수 있는 임베디드 디바이스일 수 있다. 디바이스 기종 정보 저장부는 이와 같은 디바이스들이 어떤 기종에 속하는지에 관한 정보를 저장할 수 있 는데, 예를 들어 디바이스의 제조사 및 제품번호, 버전 등의 정보를 포함할 수 있다. 이처럼 디바이스의 기종 에 관한 정보가 저장되면 이를 통해서 새로운 디바이스를 설치할 때에, 동일한 기종의 다른 디바이스의 정보를 활용할 수 있게 되어, 보다 쉽게 인공지능 설정을 할 수 있게 된다. 디바이스 기종 정보 저장부는 사전에 본 발명의 인공지능 설치 시스템과 연동 가능한 디바이스들에 대한 정보가 기록되어 있도록 구성되는 것이 바람직하며, 필요에 따라서는 사용자가 기존에 없었던 새로운 디바 이스도 등록할 수 있도록 구성하는 것도 가능하다. 인공지능 설정 정보 저장부는 상기 디바이스 기종 별로 하나 이상의 인공지능 설정 정보를 저장한다. 본 발명의 인공지능 설치 시스템에 등록되어 연결된 디바이스들은 각각의 디바이스를 분석하기 위한 인공지능 설정 정보를 가지는데, 인공지능 설정 정보는 디바이스 분석을 위하여 필요한 입력 데이터, 분석 결과로 도출되 는 출력 정보, 분석을 위한 인공지능 알고리즘, 학습 데이터를 통해 학습된 인공지능 모델 등에 관한 정보를 포 함할 수 있다. 인공지능 설정 정보 저장부에 저장되는 인공지능 설정 정보는 디바이스 기종에 대응되어 저장됨으로써, 하 나의 디바이스에 대해 인공지능 설정 정보가 존재한다면, 동일한 기기를 연결하는 경우에 미리 설정되어 있는 인공지능 설정을 사용하여 디바이스 분석을 수행하도록 할 수 있다. 특히, 사용자 본인이 직접 연결한 디바이 스가 아니더라도, 인공지능 설치 시스템의 클라우드 시스템에 기존에 동일한 디바이스를 연결하여 사용한 경우가 있다면 손쉽게 기존의 인공지능 설정을 이용할 수 있다. 디바이스 정보 저장부는 상기 디바이스 기종 각각의 실제 디바이스에 대한 디바이스 정보를 저장한다. 하 나의 디바이스 기종에 대해서 여러 개의 실제 디바이스가 연결되어 사용될 수 있는데, 디바이스 정보 저장부 에서는 이와 같은 실제 개별 디바이스 각각의 정보를 저장한다. 디바이스 정보는 디바이스를 식별하기 위 한 식별정보(제품 일련번호 등), 디바이스의 소유자 정보, 디바이스의 사용 환경에 관한 정보, 디바이스의 사용 용도에 관한 정보 등을 포함할 수 있으며, 이를 통하여 각각의 실제 디바이스별 특성을 확인할 수 있다. 디바이스 정보 저장부는 사용자가 새로운 디바이스를 하나씩 설정할 때마다 새로운 디바이스 정보를 저장 하게 되는데, 디바이스에 설정된 인공지능 설정에 관한 정보를 각 디바이스에 매칭시켜 저장할 수 있다. 이처 럼 디바이스의 인공지능 설정 정보가 저장됨에 따라서 각 디바이스에서 수집되는 센싱 데이터를 대응되는 인공 지능 설정 정보를 이용하여 분석할 수 있다. 인공지능 설정부는 사용자로부터 상기 복수의 디바이스 기종 중 하나에 대한 디바이스 추가 명령을 수신하 고, 상기 인공지능 설정 정보 저장부를 참고하여 상기 사용자로부터 상기 디바이스 추가 명령에 대응되는 디바이스 기종에 대한 인공지능 설정 정보 중 하나에 대한 선택 입력을 수신한다. 인공지능 설정부는 먼저 사용자에게 본 발명의 인공지능 설치 시스템에서 설정 가능한 디바이스 기종 정보를 리스트 또는 검색화면 등의 형태로 제공할 수 있으며, 사용자가 이 중 실제 설정할 디바이스의 기종을 선택하고, 설정할 실제 디바이스에 관한 정보들을 입력하는 것을 디바이스 추가 명령으로 수신할 수 있다. 이처럼 인공지능 설정부에서 디바이스 추가 명령을 수신하면, 인공지능 설정부는 인공지능 설정 정보 저장부를 조회하여, 설정할 디바이스 기종에 대응되는 인공지능 설정 정보를 확인하여 사용자에게 제공하 고, 사용자가 이 중 필요한 인공지능 설정 정보를 선택하도록 할 수 있다. 이 때, 사용자에게 제공되는 디바이 스 기종에 대응되는 인공지능 설정 정보는 사용자가 기존에 설정한 디바이스에 관한 것일 수도 있고, 다른 사용 자가 이전에 설정했던 디바이스에 관한 인공지능 설정 정보가 될 수도 잇다. 인공지능 설정부는 필요에 따라서 사용자가 직접 설정한 인공지능 설정 정보에 대해서 권한을 관리하도록 할 수 있으며, 사용자가 직접 생성한 인공지능 설정 정보를 타인에게 공유할 수 있도록 설정한 경우에만 타인에 게 해당 디바이스의 인공지능 설정 정보가 공개되도록 구현하는 것도 가능하다. 또한, 경우에 따라서는 사용자 간에 인공지능 설정 정보를 매매할 수 있도록 하는 플랫폼을 제공할 수도 있다. 인공지능 설정부에서 사 용자의 인공지능 설정 정보를 수신하면, 이에 관한 정보를 디바이스 설정부에 전달하게 된다. 또한, 인공지능 설정부는 사용자가 기존에 저장되어 있던 인공지능 설정을 이용하지 않고, 새로운 인공지 능 설정을 생성하고자 하는 경우에, 상기 사용자로부터 인공지능 설정 추가 명령을 수신하여, 상기 디바이스 추 가 명령에 대응되는 디바이스 기종에 적용할 수 있는 복수의 인공지능 알고리즘 중 하나를 선택 입력 받아 새로 운 인공지능 설정을 생성하여 상기 인공지능 설정 저장부에 저장하고 사용자가 설정하고자 하는 디바이스 에 적용할 수 있다. 기존에 등록되어 있는 인공지능 설정을 그대로 사용하게 된다면, 기존과 다른 용도로 다른 환경에서 디바이스를 사용하게 되는 경우 적합한 인공지능 설정을 활용할 수 없게 되기 때문에, 필요한 경우 사용자가 새로운 인공지 능 설정을 하도록 하는 것이 가능하다. 인공지능 설정부에서 새로운 인공지능 설정을 하기 위해서는 상술한 바와 같이 인공지능 설정 정보에 포함 되는 인공지능 알고리즘, 학습 데이터 등이 선택되어야 한다. 따라서, 인공지능 설정부는 사용자가 설정 하고자 하는 디바이스의 디바이스 기종 정보를 참고하여, 해당 디바이스 기종의 분석에 사용할 수 있는 복수의 인공지능 알고리즘을 사용자에게 제공하고, 사용자가 이 중 하나의 알고리즘을 선택하도록 할 수 있다. 또한, 인공지능 설정부는 학습 데이터를 확보하기 위하여, 기존의 다른 디바이스에서 수신되었던 센싱 정 보가 저장되는 센싱 정보 저장부를 참조하여, 기존의 센싱 정보를 학습 데이터로 학습을 수행하여 인공지 능 모델을 생성하고 이를 인공지능 설정에 포함시킬 수 있다. 이 때, 설정하고자 하는 디바이스의 기종의 기존 디바이스들이 여러 개 존재하는 경우, 이 디바이스들에 관한 정보를 제공하고, 사용자가 디바이스의 용도, 사용환경 등의 정보를 확인하여 학습 데이터로 활용할 센싱 정보 를 선택하도록 할 수 있다. 동일한 디바이스 기종이라고 하더라도, 어떤 용도로 어떤 환경에서 사용하는지에 따라 입력되는 센싱 정보가 달라질 수 있기 때문에, 사용자가 이를 선택하지 않고 그대로 사용하게 된다면 필요 한 상황에 맞는 학습 데이터를 이용할 수 없어 정확한 인공지능 분석이 이루어지지 않을 수 있다. 따라서, 인공지능 설정부는 상기 디바이스 추가 명령에 대응되는 디바이스 기종에 속하는 실제 디바이스를 상기 사용자에게 제공하고, 상기 사용자로부터 하나 이상의 실제 디바이스에 대한 선택 입력을 수신하고, 상기 센싱 정보 저장부에서 상기 선택된 실제 디바이스에서 수집되는 센싱 정보를 학습 데이터로 선택하도록 한다. 또한, 경우에 따라서는 디바이스별로 사용할 센싱 데이터의 기간을 설정함으로써, 원하는 학습 데이터를 구성하 도록 할 수 있다. 인공지능 설정부는 상기 선택된 센싱 정보를 상기 사용자에게 제공하고, 상기 사용자로부터 센싱 정보 각 각에 대한 라벨링 정보를 수신하고, 상기 사용자로부터 상기 각각의 라벨링 정보에 대한 상태 정보를 수신하여 상기 라벨링 정보가 부가된 센싱 정보를 학습 데이터로 생성할 수 있다. 지도학습이 이루어지기 위해서는 학습을 할 데이터 각각이 어떤 상태를 나타내는 데이터인지에 대한 분류가 되 어야 하는데, 이를 위하여 각 데이터에 라벨링 정보가 포함되어야 한다. 디바이스에서 수신되어 온 센싱 정보 들은 센싱된 정보만을 포함하고 있기 때문에, 각각이 어떤 상태를 나타내는 정보인지 구분되어 있지 않다.따라서, 인공지능 설정부는 사용자가 선택한 디바이스들에 대한 센싱 정보를 사용자에게 리스트로 제공하 고, 사용자가 해당 디바이스에서 발생될 수 있는 상태 정보에 대응하는 라벨링 정보를 설정해 두고, 각 센싱 정 보에 대해 라벨링 정보를 부가함으로써, 각 데이터들이 어떤 상태를 나타내는지 명확히 하는 학습 데이터를 생 성할 수 있다. 간단한 예로, 디바이스가 온도계이고 센싱 정보가 온도 정보라면, 사용자가 상태 정보로 \"고온\", \"저온\", \"적정 온도\"를 각각 라벨링 정보 1, 2, 3에 대응시켜 설정해 두고, 센싱 정보를 보면서 온도에 따라서 1, 2, 3을 각각 부여하게 되면, 이를 학습 데이터로 학습하여 냉난방기를 적절히 동작하도록 하는 인공지능 설정을 생성할 수 있다. 또한, 인공지능 설정부에서 생성되는 학습 데이터는 센싱 정보에 단순히 라벨링이 된 정보뿐 아니라, 센싱 데이터를 가공하거나 증강하여 생성한 학습데이터가 될 수 있다. 디바이스 설정부는 상기 디바이스 추가 명령에 포함된 실제 디바이스에 대한 디바이스 정보 및 상기 선택 된 인공지능 설정 정보를 상기 디바이스에 저장할 수 있는 포맷으로 변환하여 네트워크를 통해 상기 디바이스로 전송한다. 디바이스 설정부는 인공지능 설정부에서 인공지능 설정 정보가 확정되면, 이 인공지능 설정 정보를 실제 디바이스에 대한 정보와 대응시켜 저장함으로써, 그 이후에 설정되는 디바이스에서부터 수신되는 센싱 정 보를 해당 인공지능 설정 정보를 이용하여 분석할 수 있게 된다. 또한, 디바이스 설정부는 디바이스가 네트워크 연결이 어려워 클라우드 서비스를 이용하기 어려운 임베디 드 디바이스인 경우, 임베디드 디바이스에서 구동 가능한 인공지능 설정을 상기 임베디드 디바이스에 저장하여 자체적인 분석을 수행할 수 있도록 정해진 포맷으로 인공지능 설정을 구비하여 사용자에게 파일 등의 형태로 제 공할 수 있다. 센싱 데이터 분석부는 상기 선택된 인공지능 설정 정보를 이용하여 상기 설정된 연결을 통해 상기 디바이 스의 센싱 정보를 수신하고, 상기 선택된 인공지능 설정 정보를 이용하여 상기 수신되는 센싱 정보를 분석하여 분석 결과를 상기 사용자에게 제공한다. 센싱 데이터 분석부는 인공지능 설정 정보를 토대로 설정된 인공지능 모델을 구동시킬 수 있으며, 이 인공 지능 모델에 설정된 연결을 통해 수신되는 디바이스 센싱 정보를 입력하여, 결과 값을 도출할 수 있다. 앞서 설 명한 바와 같이 학습 데이터에 라벨링이 되어 있었기 때문에, 이를 기초로 사용자가 설정한 상태 정보 중 현재 센싱 정보가 어떤 상태를 나타내는지를 실시간으로 분석할 수 있으며, 이 정보를 사용자에게 제공함으로써, 사 용자가 디바이스의 현재 상태를 쉽게 파악할 수 있도록 한다. 이처럼 센싱 데이터 분석부에서 인공지능 설정 정보를 기초로 별도의 프로그램 설치나 구동 없이도 연결된 디바이스에서 수집되는 센싱 정보를 분석하여 분석 결과를 제공할 수 있기 때문에, 누구라도 손쉽게 디바이스에 대해 인공지능 분석을 이용할 수 있게 된다. 센싱 정보 저장부는 상기 실제 디바이스 별로 수집되는 센싱 정보를 저장한다. 상술한 바와 같이, 디바이 스의 센싱 정보는 디바이스를 분석하기 위해 사용되고, 향후 해당 디바이스 또는 다른 디바이스를 분석하기 위 한 학습 데이터로 활용될 수 있도록 저장될 수 있다. 특히 센싱 정보가 실제 각각의 디바이스 정보와 대응되어 저장됨으로써, 사용자가 기존의 디바이스 중에서 새롭게 설정하는 디바이스와 관련성이 높은 디바이스만을 선택 하여 해당 디바이스의 센싱 정보를 학습 데이터로 활용할 수 있도록 구성할 수 있다. 도 2는 본 발명의 일실시예에 따른 인공지능 설치 시스템에서 사용자가 인공지능 설정을 선택하는 화면의 일례 를 도시한 도면이다. 도면에 도시된 바와 같이, 도면에 도시한 것처럼, 사용자가 새로운 디바이스를 등록하게 되면 등록할 디바이스 기종을 선택하고, 선택된 디바이스 기종에 대응되는 인공지능 설정 정보들을 확인하여 적용하기에 적절한 인공 지능 설정 정보가 있는 경우에는 인공지능 설정 정보를 선택하여 바로 이용하도록 할 수 있다. 또한, 도면에서와 같이 기존에 설정하고자 하는 디바이스와 동일한 기종의 다른 디바이스의 인공지능 설정 정보 가 저장되어 있지 않거나, 설정하고자 하는 디바이스에 적용하기에 적당하지 않은 경우에는 새로운 인공지능 구 성 만들기를 선택하고, 새로운 인공지능 구성에 적용할 인공지능 알고리즘을 선택하여 인공지능 설정을 새롭게 생성할 수 있다.도 3은 본 발명의 일실시예에 따른 인공지능 설치 시스템에서 인공지능 알고리즘 및 학습 데이터를 선택하는 화 면의 일례를 도시한 도면이다. 도면에 도시한 것처럼, 사용자가 먼저 설정하고자 하는 디바이스와 동일한 기종의 디바이스 중에서 센싱 정보를 참조하고자 하는 디바이스를 선택하게 되면, 해당 디바이스의 센싱 정보가 중앙 상단과 같이 원본 데이터로 사 용자에게 출력되게 된다. 이 때, 화면 좌측 하단에서와 같이 센싱 정보를 이용하고자 하는 시간 구간에 관한 정보를 선택하도록 할 수 있 으며, 이를 통해 새로 설정하는 디바이스와 동일한 상황에서의 학습 데이터를 선택하도록 할 수 있다. 또한, 인공지능 분석을 통해 디바이스의 오류 등을 확인하고자 하는 경우에는 실제 오류가 발생했던 시점을 포함하는 센싱 정보가 학습 데이터로 활용되는 것이 바람직하므로, 이를 사용자가 선택하도록 할 수 있다. 이처럼 사용자의 선택에 따라 기존의 다른 디바이스의 센싱 정보가 원본 데이터로 출력되면, 사용자는 여기에 대해서 라벨링을 수행하고, 각 라벨에 대응되는 상태 정보를 저장할 수 있다. 도면에서는 중앙 상단의 \"타겟 설정\"이라는 버튼을 클릭하게 되면, 각각의 상태를 타겟으로 설정하고, 해당 타겟에 대응되는 원본 데이터를 선 택하여 라벨링된 학습 데이터를 생성할 수 있다. 생성된 학습 데이터는 중앙 하단에 리스트로 표시되어 사용자가 이를 최종 확인하도록 할 수 있다. 이와 같이 생성된 학습 데이터를 이용하여 학습을 수행하도록 하고 학습된 모델을 평가할 수 있으며, 평가 결과를 확인한 후 사용자의 선택에 따라 최종 학습 모델을 인공지능 설정으로 확정하여 설정된 디바이스의 분석을 위해 적용할 수 있다. 도 4는 본 발명의 일실시예에 따른 인공지능 설치 시스템에서 사용자가 학습 데이터로 적용할 다른 디바이스를 선택하는 화면의 일례를 도시한 도면이다. 도면에 도시한 것처럼, 본 발명의 인공지능 설치 시스템은 사용자가 새로운 디바이스를 설정하고자 하는 경우에, 해당 디바이스와 동일한 기종의 다른 디바이스들에 대한 목록을 사용자에게 제공하고, 사용자가 목록에 서 적절한 디바이스를 선택하도록 함으로써, 설정하고자 하는 디바이스와 유사한 환경에서 유사한 용도로 사용 되는 디바이스의 센싱 정보를 학습 데이터로 활용하도록 할 수 있다. 도 5는 본 발명의 일실시예에 따른 인공지능 설치 시스템에서 다른 디바이스의 센싱 데이터에 라벨링을 하는 화 면의 일례를 도시한 도면이다. 도면에 도시된 바와 같이, 사용자는 복수의 타겟을 설정할 수 있으며, 이 타겟은 사용자가 확인하고자 하는 특 정 상태 정보를 가리키게 된다. 또한, 이 상태 정보에 각각 대응되는 라벨링 정보가 부여됨으로써, 사용자가 센싱 정보를 보고 이 라벨링 정보를 부여함으로써, 정확한 학습 데이터가 생성되도록 할 수 있다. 도 6은 본 발명의 일실시예에 따른 인공지능 설정 방법의 흐름을 도시한 흐름도이다. 본 발명에 따른 인공지능 설정 방법은 중앙처리장치 및 메모리를 구비하는 인공지능 설치 시스템에서 인공지능 을 설정하는 방법으로, 이와 같은 컴퓨팅 시스템에서 구동될 수 있다. 따라서, 인공지능 설정 방법은 상술한 인공지능 설치 시스템에 대하여 설명된 특징적인 구성을 모두 포함하고 있으며, 아래의 설명에서 설명되지 않은 내용도 상술한 인공지능 설치 시스템에 대한 설명을 참조하여 구현할 수 있다. 디바이스 기종 정보 저장 단계(S601)는 모니터링 대상이 되는 복수의 디바이스의 기종에 관한 디바이스 기종 정 보를 디바이스 기종 정보 저장부에 저장한다. 사용자가 설정하고자 하는 디바이스는 셀룰러(Cellular), 와이파이(Wi-Fi), 블루투스(Bluetooth), 지그비(Zig-Bee) 등 다양한 통신 모듈을 통하여 클라우드 시스템과 통 신할 수 있는 네트워크 디바이스이거나, 자체적으로 인공지능을 구동할 수 있는 임베디드 디바이스일 수 있다. 디바이스 기종 정보 저장 단계(S601)는 이와 같은 디바이스들이 어떤 기종에 속하는지에 관한 정보를 저장할 수 있는데, 예를 들어 디바이스의 제조사 및 제품번호, 버전 등의 정보를 포함할 수 있다. 이처럼 디바이스의 기 종에 관한 정보가 저장되면 이를 통해서 새로운 디바이스를 설치할 때에, 동일한 기종의 다른 디바이스의 정보 를 활용할 수 있게 되어, 보다 쉽게 인공지능 설정을 할 수 있게 된다. 디바이스 기종 정보 저장 단계(S601)는 사전에 본 발명의 인공지능 설치 시스템과 연동 가능한 디바이스들 에 대한 정보가 기록되어 있도록 구성되는 것이 바람직하며, 필요에 따라서는 사용자가 기존에 없었던 새로운디바이스도 등록할 수 있도록 구성하는 것도 가능하다. 인공지능 설정 정보 저장 단계(S602)는 상기 디바이스 기종 별로 하나 이상의 인공지능 설정 정보를 인공지능 설정 정보 저장부에 저장한다. 본 발명의 인공지능 설치 시스템에 등록되어 연결된 디바이스들은 각 각의 디바이스를 분석하기 위한 인공지능 설정 정보를 가지는데, 인공지능 설정 정보는 디바이스 분석을 위하여 필요한 입력 데이터, 분석 결과로 도출되는 출력 정보, 분석을 위한 인공지능 알고리즘, 학습 데이터를 통해 학 습된 인공지능 모델 등에 관한 정보를 포함할 수 있다. 인공지능 설정 정보 저장 단계(S602)에서 저장되는 인공지능 설정 정보는 디바이스 기종에 대응되어 저장됨으로 써, 하나의 디바이스에 대해 인공지능 설정 정보가 존재한다면, 동일한 기기를 연결하는 경우에 미리 설정되어 있는 인공지능 설정을 사용하여 디바이스 분석을 수행하도록 할 수 있다. 특히, 사용자 본인이 직접 연결한 디 바이스가 아니더라도, 인공지능 설치 시스템의 클라우드 시스템에 기존에 동일한 디바이스를 연결하여 사 용한 경우가 있다면 손쉽게 기존의 인공지능 설정을 이용할 수 있다. 디바이스 정보 저장 단계(S603)는 상기 디바이스 기종 각각의 실제 디바이스에 대한 디바이스 정보를 디바이스 정보 저장부에 저장한다. 하나의 디바이스 기종에 대해서 여러 개의 실제 디바이스가 연결되어 사용될 수 있는데, 디바이스 정보 저장 단계(S603)에서는 이와 같은 실제 개별 디바이스 각각의 정보를 저장한다. 디바이 스 정보는 디바이스를 식별하기 위한 식별정보(제품 일련번호 등), 디바이스의 소유자 정보, 디바이스의 사용 환경에 관한 정보, 디바이스의 사용 용도에 관한 정보 등을 포함할 수 있으며, 이를 통하여 각각의 실제 디바이 스별 특성을 확인할 수 있다. 디바이스 정보 저장 단계(S603)는 사용자가 새로운 디바이스를 하나씩 설정할 때마다 새로운 디바이스 정보를 저장하게 되는데, 디바이스에 설정된 인공지능 설정에 관한 정보를 각 디바이스에 매칭시켜 저장할 수 있다. 이처럼 디바이스의 인공지능 설정 정보가 저장됨에 따라서 각 디바이스에서 수집되는 센싱 데이터를 대응되는 인공지능 설정 정보를 이용하여 분석할 수 있다. 인공지능 설정 단계(S604)는 사용자로부터 상기 복수의 디바이스 기종 중 하나에 대한 디바이스 추가 명령을 수 신하고, 상기 인공지능 설정 정보 저장부를 참고하여 상기 사용자로부터 상기 디바이스 추가 명령에 대응 되는 디바이스 기종에 대한 인공지능 설정 정보 중 하나에 대한 선택 입력을 수신한다. 인공지능 설정 단계(S604)는 먼저 사용자에게 본 발명의 인공지능 설치 시스템에서 설정 가능한 디바이스 기종 정보를 리스트 또는 검색화면 등의 형태로 제공할 수 있으며, 사용자가 이 중 실제 설정할 디바이스의 기 종을 선택하고, 설정할 실제 디바이스에 관한 정보들을 입력하는 것을 디바이스 추가 명령으로 수신할 수 있다. 이처럼 인공지능 설정 단계(S604)에서 디바이스 추가 명령을 수신하면, 인공지능 설정 단계(S604)는 인공지능 설정 정보 저장부를 조회하여, 설정할 디바이스 기종에 대응되는 인공지능 설정 정보를 확인하여 사용자에 게 제공하고, 사용자가 이 중 필요한 인공지능 설정 정보를 선택하도록 할 수 있다. 이 때, 사용자에게 제공되 는 디바이스 기종에 대응되는 인공지능 설정 정보는 사용자가 기존에 설정한 디바이스에 관한 것일 수도 있고, 다른 사용자가 이전에 설정했던 디바이스에 관한 인공지능 설정 정보가 될 수도 잇다. 또한, 인공지능 설정 단계(S604)는 사용자가 기존에 저장되어 있던 인공지능 설정을 이용하지 않고, 새로운 인 공지능 설정을 생성하고자 하는 경우에, 상기 사용자로부터 인공지능 설정 추가 명령을 수신하여, 상기 디바이 스 추가 명령에 대응되는 디바이스 기종에 적용할 수 있는 복수의 인공지능 알고리즘 중 하나를 선택 입력 받아 새로운 인공지능 설정을 생성하여 상기 인공지능 설정 저장부에 저장하고 사용자가 설정하고자 하는 디바 이스에 적용할 수 있다. 인공지능 설정 단계(S604)에서 새로운 인공지능 설정을 하기 위해서는 상술한 바와 같이 인공지능 설정 정보에 포함되는 인공지능 알고리즘, 학습 데이터 등이 선택되어야 한다. 따라서, 인공지능 설정 단계(S604)는 사용자 가 설정하고자 하는 디바이스의 디바이스 기종 정보를 참고하여, 해당 디바이스 기종의 분석에 사용할 수 있는 복수의 인공지능 알고리즘을 사용자에게 제공하고, 사용자가 이 중 하나의 알고리즘을 선택하도록 할 수 있다. 또한, 인공지능 설정 단계(S604)는 학습 데이터를 확보하기 위하여, 기존의 다른 디바이스에서 수신되었던 센싱 정보가 저장되는 센싱 정보 저장부를 참조하여, 기존의 센싱 정보를 학습 데이터로 학습을 수행하여 인공 지능 모델을 생성하고 이를 인공지능 설정에 포함시킬 수 있다. 인공지능 설정 단계(S604)는 상기 디바이스 추가 명령에 대응되는 디바이스 기종에 속하는 실제 디바이스를 상 기 사용자에게 제공하고, 상기 사용자로부터 하나 이상의 실제 디바이스에 대한 선택 입력을 수신하고, 상기 센싱 정보 저장부에서 상기 선택된 실제 디바이스에서 수집되는 센싱 정보를 학습 데이터로 선택하도록 한다. 또 한, 경우에 따라서는 디바이스별로 사용할 센싱 데이터의 기간을 설정함으로써, 원하는 학습 데이터를 구성하도 록 할 수 있다. 인공지능 설정 단계(S604)는 상기 선택된 센싱 정보를 상기 사용자에게 제공하고, 상기 사용자로부터 센싱 정보 각각에 대한 라벨링 정보를 수신하고, 상기 사용자로부터 상기 각각의 라벨링 정보에 대한 상태 정보를 수신하 여 상기 라벨링 정보가 부가된 센싱 정보를 학습 데이터로 생성할 수 있다. 인공지능 설정 단계(S604)는 사용자가 선택한 디바이스들에 대한 센싱 정보를 사용자에게 리스트로 제공하고, 사용자가 해당 디바이스에서 발생될 수 있는 상태 정보에 대응하는 라벨링 정보를 설정해 두고, 각 센싱 정보에 대해 라벨링 정보를 부가함으로써, 각 데이터들이 어떤 상태를 나타내는지 명확히 하는 학습 데이터를 생성할 수 있다. 또한, 인공지능 설정 단계(S604)에서 생성되는 학습 데이터는 센싱 정보에 단순히 라벨링이 된 정보뿐 아니라, 센싱 데이터를 가공하거나 증강하여 생성한 학습데이터가 될 수 있다. 디바이스 설정 단계(S605)는 상기 디바이스 추가 명령에 포함된 실제 디바이스에 대한 디바이스 정보 및 상기 선택된 인공지능 설정 정보를 상기 디바이스에 저장할 수 있는 포맷으로 변환하여 네트워크를 통해 상기 디바이 스로 전송한다. 디바이스 설정 단계(S605)는 인공지능 설정 단계(S604)에서 인공지능 설정 정보가 확정되면, 이 인공지능 설정 정보를 실제 디바이스에 대한 정보와 대응시켜 저장함으로써, 그 이후에 설정되는 디바이스에서부터 수신되는 센싱 정보를 해당 인공지능 설정 정보를 이용하여 분석할 수 있게 된다. 또한, 디바이스 설정 단계는 디바이스가 네트워크 연결이 어려워 클라우드 서비스를 이용하기 어려운 임베 디드 디바이스인 경우, 임베디드 디바이스에서 구동 가능한 인공지능 설정을 상기 임베디드 디바이스에 저장하 여 자체적인 분석을 수행할 수 있도록 정해진 포맷으로 인공지능 설정을 구비하여 사용자에게 파일 등의 형태로 제공할 수 있다. 센싱 데이터 분석 단계(S606)는 상기 선택된 인공지능 설정 정보를 이용하여 상기 설정된 연결을 통해 상기 디 바이스의 센싱 정보를 수신하고, 상기 선택된 인공지능 설정 정보를 이용하여 상기 수신되는 센싱 정보를 분석 하여 분석 결과를 상기 사용자에게 제공한다. 센싱 데이터 분석 단계(S606)는 인공지능 설정 정보를 토대로 설정된 인공지능 모델을 구동시킬 수 있으며, 이 인공지능 모델에 설정된 연결을 통해 수신되는 디바이스 센싱 정보를 입력하여, 결과 값을 도출할 수 있다. 앞 서 설명한 바와 같이 학습 데이터에 라벨링이 되어 있었기 때문에, 이를 기초로 사용자가 설정한 상태 정보 중 현재 센싱 정보가 어떤 상태를 나타내는지를 실시간으로 분석할 수 있으며, 이 정보를 사용자에게 제공함으로써, 사용자가 디바이스의 현재 상태를 쉽게 파악할 수 있도록 한다. 이처럼 센싱 데이터 분석 단계(S606)에서 인공지능 설정 정보를 기초로 별도의 프로그램 설치나 구동 없이도 연 결된 디바이스에서 수집되는 센싱 정보를 분석하여 분석 결과를 제공할 수 있기 때문에, 누구라도 손쉽게 디바 이스에 대해 인공지능 분석을 이용할 수 있게 된다. 센싱 정보 저장 단계(S607)는 상기 실제 디바이스 별로 수집되는 센싱 정보를 저장한다. 상술한 바와 같이, 디 바이스의 센싱 정보는 디바이스를 분석하기 위해 사용되고, 향후 해당 디바이스 또는 다른 디바이스를 분석하기 위한 학습 데이터로 활용될 수 있도록 저장될 수 있다. 특히 센싱 정보가 실제 각각의 디바이스 정보와 대응되 어 저장됨으로써, 사용자가 기존의 디바이스 중에서 새롭게 설정하는 디바이스와 관련성이 높은 디바이스만을 선택하여 해당 디바이스의 센싱 정보를 학습 데이터로 활용할 수 있도록 구성할 수 있다. 본 발명에 따른 인공지능 설정 방법은 컴퓨터가 실행하도록 기능시키기 위한 프로그램으로 제작되어 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 컴퓨터로 읽을 수 있는 기록 매체의 예에는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CDROM, DVD 와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 ROM, RAM, 플래시 메모리 등과 같은 프로그램 명령어를 저장하고 수행하도록 특별히 구성된 하드웨 어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사 용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 상기 하드웨어 장치는 본 발명에 따른 처 리를 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 이상에서는 실시예들을 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구범위에 기 재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있 다."}
{"patent_id": "10-2020-0161820", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 인공지능 설치 시스템의 내부 구성을 도시한 도면이다. 도 2는 본 발명의 일실시예에 따른 인공지능 설치 시스템에서 사용자가 인공지능 설정을 선택하는 화면의 일례 를 도시한 도면이다. 도 3은 본 발명의 일실시예에 따른 인공지능 설치 시스템에서 인공지능 알고리즘 및 학습 데이터를 선택하는 화 면의 일례를 도시한 도면이다. 도 4는 본 발명의 일실시예에 따른 인공지능 설치 시스템에서 사용자가 학습 데이터로 적용할 다른 디바이스를 선택하는 화면의 일례를 도시한 도면이다. 도 5는 본 발명의 일실시예에 따른 인공지능 설치 시스템에서 다른 디바이스의 센싱 데이터에 라벨링을 하는 화 면의 일례를 도시한 도면이다. 도 6은 본 발명의 일실시예에 따른 인공지능 설정 방법의 흐름을 도시한 흐름도이다."}
