{"patent_id": "10-2015-0166008", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0061250", "출원번호": "10-2015-0166008", "발명의 명칭": "유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼 장치", "출원인": "주식회사 나노바이오라이프", "발명자": "김수경"}}
{"patent_id": "10-2015-0166008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "3차원 체형 맞춤형 리컴번트 사이클 플랫폼에 있어서, 재활운동중의 재활운동대상자(P)의 심장자동조절에 따른 심박수, 혈압, 심근산소 요구량이 감소하는 의학적 특성과 연계되어, 제1 제어기(313), 그리고 제2 제어기(322), 산소포화도센서(330) 및 부하/케이던스 측정센서 각각의 감지/제어결과에 근거하여, 의자(310)의 등받이 각도(a1), 의자높이(H1), 의자(310)와 크랭크축간거리(L),양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)가 각각 조절되는 것을 특징으로 하는 유산소 운동 중 통증감소를 위한3차원 체형 맞춤형 리컴번트 사이클 플랫폼."}
{"patent_id": "10-2015-0166008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 의자(310)의 등받이 각도(a1), 의자높이(H1), 의자(310)와 크랭크축간거리(L), 양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)의 조정변수를 제어하도록, 상기 재활운동중의 재활운동대상자(P)의 체형을 기억하여 자동으로 조절하는 회로부를 갖는 것을 특징으로 하는 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클플랫폼."}
{"patent_id": "10-2015-0166008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 의자(310)의 등받이 각도(a1), 의자높이(H1), 의자(310)와 크랭크축간거리(L), 양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)의 조정변수를 제어하여, 상기 재활운동중의 재활운동대상자(P)의 운동시 최대의 운동 파워를 발휘하도록 하는 것을 특징으로 하는 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클플랫폼."}
{"patent_id": "10-2015-0166008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 양쪽 페달(pd_1,pd_2)에 압력측정 센서를 더 부가하여, 압력 차이를 비율로 표시하여 제공받거나, 또는 양쪽 페달링 구간 중 상기 재활운동중의 재활운동대상자(P)의 대퇴사두근(quadriceps)이 주로 사용되는 구간의 각속도 차이를 계측하여, 그 이용비율로 제공받을 수 있는 것을 특징으로 하는 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼."}
{"patent_id": "10-2015-0166008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 양쪽 페달(pd_1,pd_2)이 별도의 플라이휠(Fw)을 구비시켜 구동하게하고, 각각의 휠은 별도의 마그네틱 저항기(Mr)로 부하를 줌으로써, 상기 재활운동중의 재활운동대상자(P)의 좌우측 다리에 가해지는 운동부하를 다르게 하는 듀얼 플라이휠 방식을 특징으로 하는 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼.공개특허 10-2017-0061250-3-청구항 6 제4항에 있어서, 상기 양쪽 페달(pd_1,pd_2)로부터 패달축(pd_3)까지의 각각의 이격거리가 변경되게 구성됨을 특징으로 하는 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼."}
{"patent_id": "10-2015-0166008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서, 상기 양쪽 페달(pd_1,pd_2)이 서로 다른 각각의 플라이휠(Fw1, Fw2)로 연결됨을 특징으로 하는 유산소 운동 중통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼."}
{"patent_id": "10-2015-0166008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항중의 어느 한항에 기재된 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클플랫폼을 활용한 재활운동 관리방법으로서, 재활운동중의 재활운동대상자(P)의 심장자동조절에 따른 심박수, 혈압, 심근산소 요구량이 감소하는 의학적 특성과 연계되어, 제1 제어기(313), 그리고 제2 제어기(322), 산소포화도센서(330) 및 부하/케이던스 측정센서 각각의 감지/제어결과에 근거하여, 의자(310)의 등받이 각도(a1), 의자높이(H1), 의자(310)와 크랭크축간거리(L),양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)가 각각 조절되는 것을 특징으로 하는 유산소 운동 중 통증감소를 위한3차원 체형 맞춤형 리컴번트 사이클 플랫폼의 재활운동 관리방법."}
{"patent_id": "10-2015-0166008", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼은, 재활운동중의 재활운 동대상자(P)의 심장자동조절에 따른 심박수, 혈압, 심근산소 요구량이 감소하는 의학적 특성과 연계되어, 제1 제 어기, 그리고 제2 제어기, 산소포화도센서 및 부하/케이던스 측정센서 각각의 감지/제어결과에 (뒷면에 계속)"}
{"patent_id": "10-2015-0166008", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 퇴행성 슬관절 질환, 요통, 뇌졸중으로 인한 관절 구축 등 각종 원인에 의한 통증 발생으로 유산소 운동이 불가능한 질환자 또는 노약자가 통증으로부터 최대한 자유로운 자세로 유산소 운동을 하도록 하는 것으 로, 더욱 상세하게는 기존에 적용되어온 실내 사이클의 의자와 페달링 축의 거리 조절 시스템에 더하여 사이클 의자 등받이의 후방 경사도 조절(리컴번트 각도 조절)과 페달링 축의 높이 조절 시스템을 추가하여 3차원적으로 이용자 각 개개인이 안락한 자세로 유산소 운동을 수행할 수 있도록 하는 유산소 운동 중 통증감소를 위한 3차 원 체형 맞춤형 리컴번트 사이클 플랫폼에 관한 것이다. 또한, 본 발명은 이용자 각 개인에게 가장 적합한 운동 자세가 기억되도록 하여, 이용자 정보를 입력함에 따라 거리, 각도, 높이가 자동으로 조절되도록 하는 자동기억 조절 시스템을 포함한다. 그리고, 본 발명은 환자의 편마비가 와서 한쪽 다리의 근력이 다른 경우에는 양측 페달링 부하를 다르게 설정하 여 적용할 필요가 있다. 이를 위하여, 좌우 측 부하를 달리 설정할 수 있는 듀얼 플라이 휠방식의 페달링 장치를 적용함으로써, 좌/우측 다리를 적절히 운동시켜 올바른 재활운동효과를 극대화할 수 있도록 한다."}
{"patent_id": "10-2015-0166008", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어, 고령화 사회에서 노인인구 및 만성 질환자의 증가에 따른 건강관리 및 유산소 운동 치료 서비스에 대한 헬스 케어 기술이 향후 미래 산업으로의 성장 가능성이 높게 부각되고 있다. 또한, 통계청 자료에 따르면, 우리나라 노인인구는 지속적으로 증가하여 2025년에는 전체 인구의 약 20%를 차지 할 전망이며, 2050년에는 약 37%를 차지할 전망이다. 이에 따라, 노인인구의 심뇌혈관 질환 등 만성질환 치료를 위한 의료비용은 지속적으로 증가할 전망이지만, 현 재의 실내 운동시설의 대부분은 젊은 사람들이 주로 이용하는 헬스시설이며, 운동 장비 또한 노인들이 이용하기 에는 적절치 못한 현실에 있다. 그리고, 야외 시설의 경우 노인인구의 운동을 위해 지역자치 단체에서 곳곳에 운동기구들을 설치하였으나, 우리 나라는 황사, 장마, 미세 먼지, 겨울철 등의 계절적 영향으로 야외에서 걷기와 함께 이러한 운동장비들을 규칙 적으로 이용하기에는 어려운 현실에 있다. 따라서, 노인인구가 실내에서 운동할 수 있도록 노인의 다양한 질환을 고려한 안전하고 효율적인 실버 헬스케어 전문 장비들의 개발이 절실히 필요하며, 지방 자치단체에서는 시/ 군/ 구청의 주민 센터 및 노인 회관 등 거주 지역의 실내 센터에서 젊은 사람들을 의식하지 않고 유산소 운동을 통한 건강관리를 할 수 있는 실버 헬스케어 서비스의 공급이 필요하다. 현재, 노인 인구에게 적합한 실내 유산소 운동장비로서 가장 유용하게 이용되고 있는 장비가 실내 사이클이다. 실내 사이클은 야외 사이클과 비슷한 디자인의 안장에 앉아 페달링 운동을 하는 스피닝 사이클과 페달링 축 뒤 쪽 의자에 앉아 운동을 하는 좌식 사이클의 형태가 있다. 즉, 스피닝 사이클은 이용자의 체형에 맞추기 위해 페달링 축으로부터 안장의 높이를 조절하는 시스템을 이용하 고 있으며, 좌식 사이클은 페달링 축으로부터 의자의 거리를 조절하여 이용자의 체형에 맞추는 자세를 조절하도 록 하는 1차원적인 시스템을 이용하고 있다. 그러나, 노인인구의 대부분은 심뇌혈관 질환 및 만성 퇴행성 관절염에 의한 무릎 통증, 척추질환에 의한 요통 등으로 인하여 단순한 안장높이나 의자의 거리 조절만으로는 유산소 운동 중 발생할 수 있는 통증으로부터 자유 로울 수 없으며, 잘못된 자세에서의 지속 운동으로 인해 만성 질환의 악화를 더욱 초래할 수도 있는 현실에 있 다. 한편, 야외 스피닝 사이클에 비해 운동 중 상체에 가해지는 맞바람의 영향을 최소화시키기 위해 고안된 야외용 리컴번트 사이클에 관한 운동생리학적 특성을 연구한 해외 논문을 살펴보면, 일반 사이클에 비해서 같은 운동 강도에서의 심박수가 낮고 1회 박출량이 높은 특성(누운 자세의 특성)이 있으며(egana 등, 2010, Eur J Appl Physiol), 다리의 신전근을 주로 이용하는 특성으로 계단 오르기나 등산과 비슷한 근육군의 사용으로 일상생활 동작훈련과 유사한 운동효과를 얻을 수 있다고 하였다(Kerr 등, 2007, Clinical Biomechanics). 그리고, 대한심장호흡물리치료학회에 개재된 국내 연구(유호열 등, 2014, 대한심장호흡물리치료학회)에 의하면, 리컴번트 사이클 운동은 일반적 직립 사이클 운동에 비하여 같은 강도의 운동에서 수축기 혈압과 심근산소 소비 량, 호흡 교환률(이산화탄소 발생량 산소소비량)이 통계적으로 유의하게 낮아 심부전 환자나 쉽게 호흡곤란을 느끼는 호흡기 계통 질환자의 재활운동 치료법으로 유용하게 이용될 수 있을 것이라고 하였다. 여기서, 상체를 뒤로 기울인 리컴번트 자세는 또한, 입원이나 수술 후 초기 재활 운동치료를 실시할 수 있는 장 점이 있다. 그리고, 입원 후 장기간 누운 환자가 일상생활로 복귀하는 과정에서 기립성 저혈압 등을 예방하기 위해 경사침 대(tilt table)를 이용하여 중력에 적응하는 기간이 필요한 것이 보편적인 현실에서 경사침대를 이용한 리컴번 트 자세 사이클 운동을 통한 초기 재활의 필요성을 제시한 연구도 있다(이정원 등, 2012, 한국정밀공학회). 또한, 입원이나 수술 후 초기 재활운동치료의 시작은 노약자 및 질환자의 병원 재원일수를 줄일 수 있어 국가 보험재정 부담을 감소시키는 효과를 얻을 수 있을 뿐 아니라, 노인인구 개개인의 삶의 질 향상에도 도움이 될 수 있다. 그러나, 종래기술들 또는 국내ㆍ외에서 이미 판매중인 재활운동장비들은, 대부분이 800 ~ 1,000만원대의 고가의 외국제품으로서, 가정용으로 널리 사용되기에는 곤란할 뿐만 아니라, 리컴번트 형식의 심박수 변화를 인지한 운 동자세/각도 자동조절 기술은 전무하며, 일반 헬스용 자전거는 심폐 질환자, 또는 노약자가 오르내리기에는 낙 상의 위험이 높은 문제점이 있다. 또한, 종래기술들 또는 국내ㆍ외에서 이미 판매중인 재활운동장비들은, 사이클 의자 등받이의 후방 경사도 조절 (리컴번트 각도 조절)과 페달링 축의 높이 조절 시스템을 추가하여 3차원적으로 이용자 각 개개인이 안락한 자 세로 유산소 운동을 수행할 수 있도록 하는 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이 클 플랫폼으로서는 부적합한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-1510088 B1 (특허문헌 0002) KR 10-0759962 B1 (특허문헌 0003) KR 10-1416282 B1 (특허문헌 0004) KR 10-1528562 B1"}
{"patent_id": "10-2015-0166008", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래의 문제점을 해소하기 위해 제안된 것으로, 본 발명의 목적은, 재활운동자의 생체신 호에 따라 지능형으로 작동하는 리컴번트 운동장비를 제공하며, 개인 맞춤형 운동처방 및 훈련가이드와 재활운 동 관리 정보 제공함으로써, 심폐질환자 및 노약자에게 적합한 병원, 가정용 심폐재활 전문 운동시스템인 유산 소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼 및 그 재활운동 관리방법을 제공하는 것이다."}
{"patent_id": "10-2015-0166008", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼은, 3차원 체 형 맞춤형 리컴번트 사이클 플랫폼에 있어서, 재활운동중의 재활운동대상자(P)의 심장자동조절에 따른 심박수, 혈압, 심근산소 요구량이 감소하는 의학적 특성과 연계되어, 제1 제어기, 그리고 제2 제어기, 산소포 화도센서 및 부하/케이던스 측정센서 각각의 감지/제어결과에 근거하여, 의자의 등받이 각도(a1), 의자높이(H1), 의자와 크랭크축간거리(L), 양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)가 각각 조절되는 것을 특징으로 한다. 그리고, 상기 의자의 등받이 각도(a1), 의자높이(H1), 의자와 크랭크축간거리(L), 양쪽 페달 (pd_1,pd_2)의 페달링 높이(H2)의 조정변수를 제어하도록, 상기 재활운동중의 재활운동대상자(P)의 체형을 기억 하여 자동으로 조절하는 회로부를 갖는 것을 특징으로 한다. 또한, 상기 의자의 등받이 각도(a1), 의자높이(H1), 의자와 크랭크축간거리(L), 양쪽 페달 (pd_1,pd_2)의 페달링 높이(H2)의 조정변수를 제어하여, 상기 재활운동중의 재활운동대상자(P)의 운동시 최대의 운동 파워를 발휘하도록 하는 것을 특징으로 한다. 여기서, 상기 양쪽 페달(pd_1,pd_2)에 압력측정 센서를 더 부가하여, 압력 차이를 비율로 표시하여 제공받거나, 또는 양쪽 페달링 구간 중 상기 재활운동중의 재활운동대상자(P)의 대퇴사두근(quadriceps)이 주로 사용되는 구 간의 각속도 차이를 계측하여, 그 이용비율로 제공받을 수 있는 것을 특징으로 한다. 한편, 상기 양쪽 페달(pd_1,pd_2)이 별도의 플라이휠(Fw)을 구비시켜 구동하게하고, 각각의 휠은 별도의 마그네 틱 저항기(Mr)로 부하를 줌으로써, 상기 재활운동중의 재활운동대상자(P)의 좌우측 다리에 가해지는 운동부하를 다르게 하는 듀얼 플라이휠 방식을 특징으로 한다. 그리고, 상기 양쪽 페달(pd_1,pd_2)로부터 패달축(pd_3)까지의 각각의 이격거리가 변경되게 구성됨을 특징으로 한다. 한편, 상기 양쪽 페달(pd_1,pd_2)이 서로 다른 각각의 플라이휠(Fw1, Fw2)로 연결됨을 특징으로 한다. 그리고, 본 발명의 일실시예의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼을 활용한 재활운동 관리방법은, 재활운동중의 재활운동대상자(P)의 심장자동조절에 따른 심박수, 혈압, 심근산소 요구량이 감소하는 의학적 특성과 연계되어, 제1 제어기, 그리고 제2 제어기, 산소포화도센서 및 부하/케이던스 측정센서 각각의 감지/제어결과에 근거하여, 의자의 등받이 각도(a1), 의자높이(H1), 의 자와 크랭크축간거리(L), 양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)가 각각 조절되는 것을 특징으로 한다."}
{"patent_id": "10-2015-0166008", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일실시예의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼에 따르면, 거리조절 시스템 이외에 의자 각도를 후방으로 기울이는 리컴번트 조절 시스템과 페달링 축의 높이를 올릴 수 있는 축높이 조절 시스템으로서, 이에 따르면 리컴번트 조절 시스템은 이용자의 허리와 등받이를 밀착시켜 허리 통증을 최소화 시키는 자세를 찾는 효과 이외에도 다음과 같은 효과를가지고 있다. 즉, 페달링 축 높이 조절은 스피닝이나 좌식 실내 사이클에 비해 운동하는 다리를 더욱 높게 유지한 자세로 운 동할 수 있어, 다리에 몰린 정맥혈의 심장 환류를 촉진시켜주고 리컴번트 자세와 더불어 심장의 1회 박출량을 촉진시켜 심장근육으로의 혈액공급을 향상시킬 뿐만 아니라, 다리의 부종을 예방하여 심장 부담을 낮추어 주는 효과도 기대할 수 있다. 또한, 페달링 하는 다리의 위치가 높아지면 대퇴사두근을 더욱 주로 사용하게 되어, 의자에서 일어나기, 계단 오르기, 경사진 길 걸어 올라가기 등의 일상생활에 큰 도움을 얻을 수 있다."}
{"patent_id": "10-2015-0166008", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명과 본 발명의 실시에 의해 달성되는 기술적 과제는 다음에서 설명하는 본 발명의 바람직한 실시예들에 의하여 보다 명확해질 것이다. 다음의 실시예들은 단지 본 발명을 설명하기 위하여 예시된 것에 불과하며, 본 발명의 범위를 제한하기 위한 것은 아니다. 도 1은 본 발명의 일실시예의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼을 포 함하는 스마트 리컴번트 재활운동 시스템을 도시한 개략도이고, 도 2는 도 1에 도시된 스마트 리컴번트 재활운 동 시스템의 주요 구성요소에 따른 기능을 나타낸 모식도이며, 도 3은 리컴번트 자세에 따른 본 발명의 3차원 체형 맞춤형 리컴번트 사이클 플랫폼, 플랫폼 제어보드와 중앙관리 소프트웨어, 그리고 이에 연동되는 스마트기 기 및 생체센서와 현장 진단기기간의 연결관계를 나타낸 블럭도이다. 그리고, 도 4는 본 발명의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼이 중앙 관리 소프트웨어 및 운동처방 데이터베이스/운동관리 데이터베이스/대사관리 데이터베이스와 연동되는 것을 나 타낸 블럭도이고, 도 5는 의자의 등받이 각도(a1), 의자높이(H1), 의자와 크랭크축간거리(L), 양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)의 조정변수를 나타낸 개략도이다. 한편, 도 6은 양쪽 페달(pd_1,pd_2)이 하나의 플라이휠(Fw)에 연결됨을 나타내는 개략도이고, 도 7은 양쪽 페달 (pd_1,pd_2)이 서로 다른 각각의 플라이휠(Fw1, Fw2)에 연결됨을 나타내는 개략도이다. 도 1 내지 도 3에 도시된 바와 같이, 본 발명의 일실시예의 스마트 리컴번트 재활운동 시스템은, 재활운동 대상자(P)가 착석할 수 있도록 등받이부와 의자부로 이루어지되 상기 등받이부는 경사각도가 조 절될 수 있으며 상기 의자부는 전후방으로 이동될 수 있어 심폐부담을 감소시킬 수 있는 자세조절형 리컴 번트 의자, 전면부에 디스플레이가 구비되어 상기 재활운동중의 재활운동대상자(P)의 신체상태 등을 표시할 수 있는 스마트폰 등과 같은 디지털단말기, 재활운동중의 재활운동대상자(P)의 Sp02 및 맥파를 감 지하는 산소포화도센서, 그리고 운동부하패달부를 갖는 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼을 포함하여 구성된다. 이를 좀더 살펴보면, 본 발명의 스마트 리컴번트 재활운동 시스템은, 재활운동대상자(P)가 착석한 상태에 서 각도조절힌지부(311a)를 중심으로 회동되어 등받이부의 경사각도가 조절되고, 바닥면(G)에 설치된 상태 에서 의자부가 전/후방으로 슬라이딩 이동될 수 있게 작동되며, 재활운동대상자(P)의 심박 및 체형에 대응 되도록 제어신호를 생성시키는 제1 제어기를 갖는 자세조절형 리컴번트 의자, 전면부에 디스플레이 가 배치되고, 재활운동중의 재활운동대상자(P)의 신체상태 및 재활운동상황을 표시하고, 향후 진행하게되 는 재활운동과 관련한 지침이 표시되도록 제어신호를 생성하는 제2 제어기를 갖는 디지털단말기, 재 활운동중의 재활운동대상자(P)의 Sp02 및 맥파를 감지하여 감지신호를 생성시키는 산소포화도센서 및 재활 운동중의 재활운동대상자(P)가 작동시킴에 따라, 저항 및 운동부하패달의 RPM을 측정할 수 있는 부하/케이던스 측정센서가 부착되는 운동부하패달부를 갖는 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트사이클 플랫폼을 포함하여 구성되는 것을 특징으로 한다. 여기서, 본 발명의 스마트 리컴번트 재활운동 시스템을 이루는 각각의 구성요소를 좀더 살펴본다. 우선, 본 발명의 스마트 리컴번트 재활운동 시스템에 있어서, 상기 자세조절형 리컴번트 의자는, 심 박 및 체형별 조정이 가능하며, 인공지능 자세 조절형의 기댄 상태로 누울 수 있는 리컴번트 의자로서, 이때, 상기 등받이부는 상기 제1 제어기의 제어신호에 의하여 제어됨으로써, 자동으로 전동으로 각도조절힌 지부(311a)를 중심으로 경사각도가 조절되게 구성되는 것이 바람직하다. 이와 같이, 본 발명의 자세조절형 리컴번트 의자를 활용하여 재활운동대상자(P)가 착석한 상태에서 리컴번 트 자세를 취함에 따라, 신체활동이 전반적으로 부족한 재활운동 대상자(P)로 하여금, 안전사고에 대한 공포감 을 경감시킬 수 있고, 근력약화로 인한 기능저하에 대비할 수도 있으며, 요통 또는 퇴행성 관절통 등과 같이 운 동중에 발생되는 '급격한 통증'을 사전에 경감시킬 수 있을 뿐만 아니라, 외부에서 이루어지는 재활운동에 따른 황사/장마비/외부온도로부터의 영향에서 자유로울 수 있어 '가정기반의 운동'이 가능해 진다. 더욱이, 리컴번트 자세를 취함에 따라, 심폐질환자 및 노약자에 있어서, 재활운동 중 심박수, 수축기 혈압, 심 근 산소요구량, 및 산소 소비량을 감소시킴으로써, 심폐부담을 경감시킬 수 있으며, 똑바로 앉은 자세에서 실시 하는 운동과 달리 일상생활에서의 동작과 유사한 근육을 사용함에 따라, 전반적으로 근력 및 운동에 따른 기능 을 개선시킬 수도 있다. 그리고, 본 발명의 스마트 리컴번트 재활운동 시스템에 있어서, 상기 디지털단말기는, 운동프로그램 이 별도로 어플리케이션 형태로 조장되는 스마트폰 등과 같은 디지털기기로서, 재활운동대상자(P)가 착석한 상 태에서 재활운동을 진행하는 동안의 신체상황을 비롯하여 운동상황 등을 디스플레이시켜줄 뿐만 아니라, 향후 상기 재활운동대상자(P)에게 적합한 재활운동 프로그램을 가이드 할 수 있도록 작동된다. 이때, 상기 디지털단말기는 대다수의 사람들이 사용하는 통상의 스마트폰을 활용할 수도 있으나, 전면에 구비되는 디스플레이에 표시되는 내용을 'text to speech solution'을 적용하여 육성으로써 들려주거나, 재활운동을 보다 효과적으로 하도록 힐링용 음향을 지원해주도록 하는 등의 전용 디지털단말기로 구성할 수도 있고, 디스플레이에 표시되는 내용을 재활운동 담당 의료진의 스마트폰(도시하지 않음) 또는 재활운동 관 리서버(도시하지 않음)에 연결되어 있는 컴퓨터의 모니터(도시하지 않음)에 디스플레이되도록 구성될 수도 있다. 또한, 본 발명의 스마트 리컴번트 재활운동 시스템에 있어서, 상기 산소포화도센서는, 재활운동대상 자(P)가 착석한 상태에서 신체의 일측에 접촉시킨 상태에서, 재활운동이 진행됨에 따라 변화하는 Sp02 및 맥파 를 감지하여 감지신호를 생성시키도록 작동된다. 그리고, 본 발명의 스마트 리컴번트 재활운동 시스템에 있어서, 상기 유산소 운동 중 통증감소를 위한 3차 원 체형 맞춤형 리컴번트 사이클 플랫폼은, 통상적인 일반 헬스용 자전거를 넘어서, 본체 양측으로 돌출 회전되게 배치되는 운동부하패달부에 재활운동중의 재활운동대상자(P)가 작동시킴에 따라, 저항 및 운동부 하패달의 RPM을 측정할 수 있는 부하/케이던스(cadence) 측정센서를 부착시킴에 본 발명의 기술적 특징이 있다. 도 5 내지 도 7에 도시된 바와 같이, 본 발명의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼에 있어서, 재활운동대상자(P)가 착석한 상태에서 각도조절힌지부(311a)를 중심으로 회동되어 등받이부의 경사각도가 조절되고, 바닥면(G)에 설치된 상태에서 의자부가 전/후방으로 슬라이딩 이동될 수 있게 작동되며, 재활운동대상자(P)의 심박 및 체형에 대응되도록 제어신호를 생성시키는 제1 제어기 를 갖는 자세조절형 리컴번트 의자에서, 상기 의자의 등받이 각도(a1), 의자높이(H1), 의자 와 크랭크축간거리(L), 양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)의 조정변수를 제어하도록 구성되고, 이때 상기 재활운동중의 재활운동대상자(P)의 체형을 기억하여 자동으로 조절하는 회로부를 더 갖는 것을 특징으로 한다. 그리고, 상기 의자의 등받이 각도(a1), 의자높이(H1), 의자와 크랭크축간거리(L), 양쪽 페달 (pd_1,pd_2)의 페달링 높이(H2)의 조정변수를 제어하여, 상기 재활운동중의 재활운동대상자(P)의 운동시 최대의 운동 파워를 발휘하도록 구성될 수 있다. 한편, 상기 양쪽 페달(pd_1,pd_2)에 압력측정 센서를 더 부가하여, 압력 차이를 비율로 표시하여 제공받거나, 또는 양쪽 페달링 구간 중 상기 재활운동중의 재활운동대상자(P)의 대퇴사두근(quadriceps)이 주로 사용되는 구 간의 각속도 차이를 계측하여, 그 이용비율로 제공받을 수 있도록 구성될 수도 있다. 더욱이, 상기 양쪽 페달(pd_1,pd_2)이 별도의 플라이휠(Fw)을 구비시켜 구동하게하고, 각각의 휠은 별도의 마그 네틱 저항기(Mr)로 부하를 줌으로써, 상기 재활운동중의 재활운동대상자(P)의 좌우측 다리에 가해지는 운동부하 를 다르게 하는 듀얼 플라이휠 방식을 취할 수 있다. 특히, 상기 양쪽 페달(pd_1,pd_2)로부터 패달축(pd_3)까지의 각각의 이격거리가 변경되게 구성될 수 있다. 이때, 상기 양쪽 페달(pd_1,pd_2)이 서로 다른 각각의 플라이휠(Fw1, Fw2)로 연결되고, 상기 서로 다른 각각의 플라이휠(Fw1, Fw2)은 별도의 마그네틱 저항기(Mr1,Mr2)로 부하를 주도록 구성될 수도 있다. 즉, 본 발명의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼에 따르면, 재 활운동중의 재활운동대상자(P)의 심장자동조절에 따른 심박수, 혈압, 심근산소 요구량이 감소하는 의학적 특성 과 연계되어, 제1 제어기, 그리고 제2 제어기, 산소포화도센서 및 부하/케이던스 측정센서 각각 의 감지/제어결과에 근거하여, 리컴번트의 등받이 각도와 더불어서, 페달링(pedaling) 각도가 자동으로 조절되 도록 구성될 수도 있다. 그리고, 상기에 기재된 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼을 활용한 재활운동 관리방법은, 재활운동중의 재활운동대상자(P)의 심장자동조절에 따른 심박수, 혈압, 심근산소 요구량 이 감소하는 의학적 특성과 연계되어, 제1 제어기, 그리고 제2 제어기, 산소포화도센서 및 부하 /케이던스 측정센서 각각의 감지/제어결과에 근거하여, 의자의 등받이 각도(a1), 의자높이(H1), 의자(31 0)와 크랭크축간거리(L), 양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)가 각각 조절되는 것을 특징으로 한다. 여기서, 만성 질환 예방 및 건강관리를 위해 가장 보편적으로 이용되고 있는 실내 사이클 운동 中 왼쪽 페달과 오른쪽 페달의 파워를 실시간 계측함으로써 좌우 다리의 이용비율을 실시간 제공하여 이용자 스스로 양쪽 근육 을 효율적으로 운동하도록 '왼쪽 페달과 오른쪽 페달'을 구성할 수 있다. 즉, 양쪽 페달 동일부하 적용 운동 시 좌우 다리 이용비율을 feed back 받는데, 예를들어 양쪽 페달부위에 압력 측정 센서를 부착하여 압력 차이를 비율로 표시하여 제공받거나, 또는 양쪽 페달링 구간 중 대퇴사두근이 주로 사용되는 구간의 각속도 차이를 계측하여 이용비율로 제공받을 수 있는데, 이로써 좌우 다리의 이용 비율이 다양한 원인(뇌졸중, 소아마비, 퇴행성 관절염, 골절 과거력 등에 의한 한 쪽 근력 약화)에 의해 표준편차 범위 (10% 이상 편차)를 벗어난 경우 좌우 페달에 다른 부하가 적용되어 운동 중 좌우 다리의 이용비율을 표준편차 범위 이내로 조절하도록 함으로써 약화된 쪽 다리의 기능을 강화시키도록 구성할 수 있다. 이에 따라, 본 특허의 개발 장비인 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼 은, 의자와 페달링 축과의 거리 조절에 더불어 의자 등받이의 후방 경사조절과 페달링 축의 높이 조절의 3차원 적 개인 맞춤형 운동자세 조절을 통해, 이용자 개개인이 통증으로부터 가장 자유로운 최적화된 자세를 찾아내어 안전하면서도 효율적인 유산소 운동효과를 얻을 수 있도록 하고, 이 자세 정보를 기억하도록 하여, 이용자가 자 신의 정보를 입력하면 기억된 최적의 운동 자세로 자동 제어 되도록 하여, 다양한 질환의 노인인구가 통증으로 부터 자유롭고 질환을 악화시키지 않으며 효율적인 유산소 운동효과를 얻도록 돕는 것을 특징으로 한다. 본 특허 장비의 특징은 거리조절 시스템 이외에 의자 각도를 후방으로 기울이는 리컴번트 조절 시스템과 페달링 축의 높이를 올릴 수 있는 축높이 조절 시스템으로서, 이에 따르면 리컴번트 조절 시스템은 이용자의 허리와 등 받이를 밀착시켜 허리 통증을 최소화 시키는 자세를 찾는 효과 이외에도 다음과 같은 특성을 가지고 있다. 즉, 페달링 축 높이 조절은 스피닝이나 좌식 실내 사이클에 비해 운동하는 다리를 더욱 높게 유지한 자세로 운 동할 수 있어, 다리에 몰린 정맥혈의 심장 환류를 촉진시켜주고 리컴번트 자세와 더불어 심장의 1회 박출량을 촉진시켜 심장근육으로의 혈액공급을 향상시킬 뿐만 아니라, 다리의 부종을 예방하여 심장 부담을 낮추어 주는 효과도 기대할 수 있다. 또한, 페달링 하는 다리의 위치가 높아지면 대퇴사두근을 더욱 주로 사용하게 되어, 의자에서 일어나기, 계단 오르기, 경사진 길 걸어 올라가기 등의 일상생활에 큰 도움을 얻을 수 있다."}
{"patent_id": "10-2015-0166008", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상에서 본 발명은 도면에 도시된 일 실시예를 참고로 설명되었으나, 본 기술분야의 통상의 지식을 가진 자라 면 이로부터 다양한 변형 및 균등한 타 실시예로 확장할 수 있다는 점을 이해할 것이다."}
{"patent_id": "10-2015-0166008", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼을 포 함하는 스마트 리컴번트 재활운동 시스템을 도시한 개략도. 도 2는 도 1에 도시된 스마트 리컴번트 재활운동 시스템의 주요 구성요소에 따른 기능을 나타낸 모식도. 도 3은 리컴번트 자세에 따른 본 발명의 3차원 체형 맞춤형 리컴번트 사이클 플랫폼, 플랫폼 제어보드와 중앙관리 소프트웨어, 그리고 이에 연동되는 스마트기기 및 생체센서와 현장 진단기기간의 연결관계를 나타낸 블럭도. 도 4는 본 발명의 유산소 운동 중 통증감소를 위한 3차원 체형 맞춤형 리컴번트 사이클 플랫폼이 중앙관리 소프 트웨어 및 운동처방 데이터베이스/운동관리 데이터베이스/대사관리 데이터베이스와 연동되는 것을 나타낸 블럭 도. 도 5는 의자의 등받이 각도(a1), 의자높이(H1), 의자와 크랭크축간거리(L), 양쪽 페달(pd_1,pd_2)의 페달링 높이(H2)의 조정변수를 나타낸 개략도. 도 6은 양쪽 페달(pd_1,pd_2)이 하나의 플라이휠(Fw)에 연결됨을 나타내는 개략도. 도 7은 양쪽 페달(pd_1,pd_2)이 서로 다른 각각의 플라이휠(Fw1, Fw2)에 연결됨을 나타내는 개략도."}
