{"patent_id": "10-2023-0025211", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0131760", "출원번호": "10-2023-0025211", "발명의 명칭": "모바일 장치와 그 베이지안 연합학습 방법", "출원인": "한국과학기술원", "발명자": "강준혁"}}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 네트워크를 통해 서버와 베이지안 연합학습을 수행하는 다수의 모바일 장치 중 어느 하나가 수행하는 베이지안 연합학습 방법으로서,상기 서버로부터 학습모델에 대한 파티클을 다운로드하는 단계와,상기 다운로드 된 파티클을 학습을 통해 업데이트하는 단계와,상기 업데이트 된 파티클과 상기 다운로드 된 파티클의 차이 값을 압축하는 단계와,상기 압축된 파티클 업데이트를 양자화한 후 위치정보와 함께 상기 서버에 업로드하는 단계를 포함하는 베이지안 연합학습 방법."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 압축하는 단계는, 파티클 업데이트 값이 모델사이즈 에 대해 형태의 행렬일 경우, 상기 행렬의각 열에 대해 독립적으로 Top-k 희소화(sparsification)를 진행하는베이지안 연합학습 방법."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 압축하는 단계는, 파티클 업데이트 값이 모델사이즈 에 대해 형태의 행렬일 경우, 상기 행렬의각 열에 대해 같은 패턴으로 희소화를 진행하는베이지안 연합학습 방법."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 압축하는 단계는, 큰 k개의 값 위치는 절대값의 합을 통해 정하고, 모든 파티클에 대해 해당 위치에 있는값을 보내고 나머지는 0으로 처리하는베이지안 연합학습 방법."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 압축하는 단계는, 파티클 업데이트 값이 모델사이즈 에 대해 형태의 행렬일 경우, 파티클을 복수의 그룹으로 나누어 그룹 안에서만 희소화 패턴을 공유해 희소화를 진행하는베이지안 연합학습 방법."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 압축하는 단계는, 상기 희소화 패턴을 그룹 내에서 파티클끼리 절대값 합을 한 뒤 큰 k개의 위치를 골라공개특허 10-2024-0131760-3-정하는베이지안 연합학습 방법."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "컴퓨터 프로그램을 저장하고 있는 컴퓨터 판독 가능 기록매체로서,상기 컴퓨터 프로그램은, 프로세서에 의해 실행되면,무선 네트워크를 통해 서버와 베이지안 연합학습을 수행하는 다수의 모바일 장치 중 어느 하나가 수행하는 베이지안 연합학습 방법으로서, 상기 서버로부터 학습모델에 대한 파티클을 다운로드하는 단계와, 상기 다운로드 된파티클을 학습을 통해 업데이트하는 단계와, 상기 업데이트 된 파티클과 상기 다운로드 된 파티클의 차이 값을압축하는 단계와, 상기 압축된 파티클 업데이트를 양자화한 후 위치정보와 함께 상기 서버에 업로드하는 단계를포함하는 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함하는, 컴퓨터 판독 가능한 기록매체."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "무선 네트워크를 통해 서버와 베이지안 연합학습을 수행하는 다수의 모바일 장치 중 어느 하나로서,적어도 하나의 명령어를 저장하는 메모리부와,프로세서부와,통신부를 포함하며,상기 프로세서부에 의해 상기 적어도 하나의 명령어가 실행됨으로써,상기 서버로부터 상기 통신부를 통해 학습모델에 대한 파티클을 다운로드하고,상기 다운로드 된 파티클을 학습을 통해 업데이트하며,상기 업데이트 된 파티클과 상기 다운로드 된 파티클의 차이 값을 압축하고,상기 압축된 파티클 업데이트를 양자화한 후 위치정보와 함께 상기 통신부를 통해 상기 서버에 업로드하는 베이지안 연합학습을 수행하는모바일 장치."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 압축할 때에, 파티클 업데이트 값이 모델사이즈 에 대해 형태의 행렬일 경우, 상기 행렬의 각 열에 대해 독립적으로 Top-k 희소화(sparsification)를 진행하는모바일 장치."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 압축할 때에, 파티클 업데이트 값이 모델사이즈 에 대해 형태의 행렬일 경우, 상기 행렬의 각 열에 대해 같은 패턴으로 희소화를 진행하는모바일 장치."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 압축할 때에, 큰 k개의 값 위치는 절대값의 합을 통해 정하고, 모든 파티클에 대해 해당 위치에 있는 값을보내고 나머지는 0으로 처리하는공개특허 10-2024-0131760-4-모바일 장치."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8 항에 있어서,상기 압축할 때에, 파티클 업데이트 값이 모델사이즈 에 대해 형태의 행렬일 경우, 파티클을 복수의그룹으로 나누어 그룹 안에서만 희소화 패턴을 공유해 희소화를 진행하는모바일 장치."}
{"patent_id": "10-2023-0025211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 압축할 때에, 상기 희소화 패턴을 그룹 내에서 파티클끼리 절대값 합을 한 뒤 큰 k개의 위치를 골라 정하는모바일 장치."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따라 무선 네트워크를 통해 서버와 베이지안 연합학습을 수행하는 다수의 모바일 장치 중 어느 하나 가 수행하는 베이지안 연합학습 방법은, 상기 서버로부터 학습모델에 대한 파티클을 다운로드하는 단계와, 상기 다운로드 된 파티클을 학습을 통해 업데이트하는 단계와, 상기 업데이트 된 파티클과 상기 다운로드 된 파티클의 차이 값을 압축하는 단계와, 상기 압축된 파티클 업데이트를 양자화한 후 위치정보와 함께 상기 서버에 업로드하 는 단계를 포함한다."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 모바일 장치와 이 장치가 베이지안 연합학습(bayesian federated learning)을 수행하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "머신러닝에서는 정확도와 학습 모델의 신뢰도를 올리기 위해 다양한 데이터를 모으는 것이 중요하다. 하지만 데 이터를 직접적으로 공유하게 되면 개인 정보 유출 등의 보안문제가 발생할 수 있으며, 이런 문제를 다루기 위해 연합 학습의 개념이 제안되었다. 연합 학습의 경우 직접적으로 데이터를 교환하지 않고, 데이터를 통해 학습된 모델을 공유함으로써 개인 데이터 보안을 한층 강화시킨다는 장점이 있다. 베이지안 학습의 경우 일반적인 학습 방법과는 다르게 학습 모델을 통해서 도출되는 결과가 확률을 통해서 표현"}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이 된다. 이러한 점 덕분에 비교적 작은 확률이라도 무시할 수 없는 기술분야 또는 안전과 밀접한 관련이 있는"}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "기술분야로서, 자율주행이나 의학 분야 등의 분야에서 많이 사용되고 있다. 이러한 베이지안 학습은 크게 몬테 카를로(Monte-Carlo) 샘플링 기반의 방법과 변분추론(variational inference) 기반의 방법으로 나누어 지는데, 두 방법의 장점을 조합해서 만든 학습방법이 SVGD(stein variational gradient descent) 방법이다. SVGD 방법 은 학습 모델 에 대한 최적의 사후 분포를 추정하기 위해, 개의 파티클이라 불리는 서로 다른 모델 들을 동시에 학습한다. 파티클들의 분포에 따라 학습 모델 의 사후 분포를 추정하고, 이를 통해 학습 모델의 정확도 및 신뢰도를 향상시킨다. 분산네트워크에서 SVGD 방법의 경우 기존 연합학습에 비해 그 정확도와 신뢰도에 있어서 우수한 것으로 알려져 있는데, 이는 통신 용량의 제한이 없는 경우에 가능하며 만약 무선 통신 환경과 같이 통신 용량의 제한이 있는 경우 다수의 파티클을 통해 학습 모델을 업데이트 하는 과정에서 양자화를 하더라도 큰 모델 사이즈와 파티클의 곱에 비례하는 정보량을 필요로 하게 되고, 통신 용량 제한에 의해 모든 정보를 전달하는 것이 불가능하다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2022-0107690호, 공개일자 2022년 8월 2일."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 4, "content": "발명의 내용"}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예에 따르면, 통신 용량의 제한이 있을 수 있는 무선 통신 환경에서 서버와 베이지안 연합학습을 수행하는 다수의 모바일 장치 중 어느 하나가 모델 업데이트 정보의 압축 및 양자화를 통해 정보 전달의 용이성을 향상시 킴으로써 정확도와 신뢰도 높은 학습 결과를 제공하는 베이지안 연합학습 방법 및 이 방법을 수행하는 모바일 장치를 제공한다. 본 발명의 해결하고자 하는 과제는 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 해결하고 자 하는 과제는 아래의 기재로부터 본 발명이 속하는 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "제 1 관점에 따라 무선 네트워크를 통해 서버와 베이지안 연합학습을 수행하는 다수의 모바일 장치 중 어느 하 나가 수행하는 베이지안 연합학습 방법은, 상기 서버로부터 학습모델에 대한 파티클을 다운로드하는 단계와, 상 기 다운로드 된 파티클을 학습을 통해 업데이트하는 단계와, 상기 업데이트 된 파티클과 상기 다운로드 된 파티 클의 차이 값을 압축하는 단계와, 상기 압축된 파티클 업데이트를 양자화한 후 위치정보와 함께 상기 서버에 업 로드하는 단계를 포함한다. 제 2 관점에 따라 컴퓨터 프로그램을 저장하고 있는 컴퓨터 판독 가능 기록매체는, 상기 컴퓨터 프로그램이, 프 로세서에 의해 실행되면, 무선 네트워크를 통해 서버와 베이지안 연합학습을 수행하는 다수의 모바일 장치 중 어느 하나가 수행하는 베이지안 연합학습 방법으로서, 상기 서버로부터 학습모델에 대한 파티클을 다운로드하는 단계와, 상기 다운로드 된 파티클을 학습을 통해 업데이트하는 단계와, 상기 업데이트 된 파티클과 상기 다운로 드 된 파티클의 차이 값을 압축하는 단계와, 상기 압축된 파티클 업데이트를 양자화한 후 위치정보와 함께 상기 서버에 업로드하는 단계를 포함하는 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함한다. 제 3 관점에 따라 무선 네트워크를 통해 서버와 베이지안 연합학습을 수행하는 다수의 모바일 장치 중 어느 하 나는, 적어도 하나의 명령어를 저장하는 메모리부와, 프로세서부와, 통신부를 포함하며, 상기 프로세서부에 의 해 상기 적어도 하나의 명령어가 실행됨으로써, 상기 서버로부터 상기 통신부를 통해 학습모델에 대한 파티클을 다운로드하고, 상기 다운로드 된 파티클을 학습을 통해 업데이트하며, 상기 업데이트 된 파티클과 상기 다운로 드 된 파티클의 차이 값을 압축하고, 상기 압축된 파티클 업데이트를 양자화한 후 위치정보와 함께 상기 통신부 를 통해 상기 서버에 업로드하는 베이지안 연합학습을 수행한다."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따르면, 통신 용량의 제한이 있을 수 있는 무선 통신 환경에서 서버와 베이지안 연합학습을 수행하 는 다수의 모바일 장치 중 어느 하나가 모델 업데이트 정보의 압축 및 양자화를 통해 정보 전달의 용이성을 향 상시킴으로써 정확도와 신뢰도 높은 학습 결과를 제공하는 효과가 있다."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예들을 참 조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구 항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 '포함'한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에서 사용되는 '부'라는 용어는 소프트웨어 또는 FPGA나 ASIC과 같은 하드웨어 구성요소를 의미하 며, '부'는 어떤 역할들을 수행한다. 그렇지만 '부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키 도록 구성될 수도 있다. 따라서, 일 예로서 '부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브 루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이 터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '부'들로 결합되거나 추가적인 구성요소들과 '부'들로 더 분리될 수 있다. 도 1은 본 발명의 실시예에 따른 무선 통신 환경의 베이지안 연합학습 시스템의 구성도이다. 복수의 모바일 장치는 무선 네트워크를 통해 서버에 접속될 수 있다. 모바일 장치는 서버 로부터 학습모델에 대한 파티클을 다운로드하며, 다운로드 된 파티클을 학습을 통해 업데이트하고, 업데이 트 된 파티클과 다운로드 된 파티클의 차이 값을 압축하며, 압축된 파티클 업데이트를 양자화한 후 위치정보와 함께 서버에 업로드 한다. 이로써, 서로 다른 데이터 셋에 의해 학습된 파티클들이 서버에 업로드 되 고, 서버는 복수의 모바일 장치로부터 업로드 된 파티클들의 평균값을 취하는 등의 방식으로 학습모 델을 업데이트 한다. 도 2는 본 발명의 실시예에 따른 베이지안 연합학습 방법을 수행하는 모바일 장치의 구성도이다. 모바일 장치는 메모리부, 프로세서부 및 통신부를 포함할 수 있다. 예를 들어, 모바일 장 치는 프로세서부에 의한 처리 결과를 제공하기 위한 디스플레이부를 더 포함할 수 있다. 이러한 모바 일 장치는 노트북 PC, 태블릿 PC, 스마트폰 등의 다양한 기기로 구현될 수 있다. 메모리부에는 모바일 장치의 다양한 기능 내지는 인스트럭션과 관련된 정보가 저장될 수 있다. 메모 리부는 ROM, RAM 외에도 하드 디스크, SSD, 플래시 메모리 등을 포함할 수 있다. 메모리부에는 프로 세서부의 프로세서가 실시예에 따른 베이지안 연합학습을 수행하도록 하기 위한 명령어가 적어도 하나 이 상 저장된다. 이러한 메모리부에 저장된 명령어가 프로세서부에 의해 실행됨으로써 실시예에 따른 베 이지안 연합학습을 수행할 수 있다. 프로세서부는 하나 또는 복수의 프로세서로 구성될 수 있다. 예를 들어, 하나 또는 복수의 프로세서는 CPU(central process unit), DSP(digital signal processor) 등과 같은 범용 프로세서, GPU(graphic process unit), VPU(vision process Unit) 등과 같은 그래픽 전용 프로세서 또는 NPU(neural process unit)와 같은 인 공지능 전용 프로세서일 수 있다. 통신부는 프로세서부의 제어에 따라 서버와 정보 및/또는 데이터를 송수신할 수 있다. 이러한 모바일 장치는 프로세서부에 의해 메모리부의 명령어가 실행됨으로써, 서버로부터 통신부를 통해 학습모델에 대한 파티클을 다운로드하고, 다운로드 된 파티클을 학습을 통해 업데이트하며, 업데이트 된 파티클과 다운로드 된 파티클의 차이 값을 압축하고, 압축된 파티클 업데이트를 양자화한 후 위치 정보와 함께 통신부를 통해 서버에 업로드 한다. 프로세서부는 압축할 때에, 파티클 업데이트 값이 모델사이즈 에 대해 형태의 행렬일 경우, 행렬의 각 열에 대해 독립적으로 Top-k 희소화(sparsification)를 진행할 수 있다. 또는, 프로세서부는 압축할 때에, 행렬의 각 열에 대해 같은 패턴으 로 희소화를 진행할 수 있다. 큰 k개의 값 위치는 절대값의 합을 통해 정하고, 모든 파티클에 대해 해당 위치에 있는 값을 보내고 나머지는 0으로 처리할 수 있다. 또는, 프로세서부는 압축할 때에, 파티클을 복수의 그 룹으로 나누어 그룹 안에서만 희소화 패턴을 공유해 희소화를 진행할 수 있다. 희소화 패턴을 그룹 내에서 파티 클끼리 절대값 합을 한 뒤 큰 k개의 위치를 골라 정할 수 있다. 도 3은 본 발명의 실시예에 따른 베이지안 연합학습 방법을 설명하기 위한 흐름도이고, 도 4 내지 도 6은 본 발 명의 실시예에 따른 베이지안 연합학습 방법 중 압축 과정의 다양한 예를 보인 개념도이며, 도 7 및 도 8은 본 발명의 실시예에 따른 베이지안 연합학습 방법에서 알파 값에 따른 테스트 정확도와 ECE 값의 차이를 나타낸 그 래프이고, 도 9는 본 발명의 실시예에 따른 베이지안 연합학습과 비-베이지안 연합학습의 성능을 비교한 그래프 이다. 이하, 도 1 내지 도 9를 참조하여 실시예에 따른 베이지안 연합학습 방법에 대해 살펴보기로 한다. 복수의 모바일 장치는 서로 다른 데이터 셋을 가지고, 서버에서는 학습모델에 대한 개의 파티클을 가지며, 각 모바일 장치는 해당 파티클을 다운로드 받는다(S310). 그리고, 각 모바일 장치는 다운로드 된 파티클을 학습을 통해 업데이트 한다. 예를 들어, 각 모바일 장치 는 SVGD 또는 DSVGD(distributed stein variational gradient descent) 방법을 통해 업데이트를 할 수 있 다(S320). 아울러, 각 모바일 장치의 프로세서부는 업데이트 된 파티클을 업로드 하기에 앞서 기존 파티클과 업 데이트 된 파티클의 차이 값에 대해 압축(S330) 및 양자화(S340)를 진행한다. 파티클 업데이트의 압축은 절대값이 큰 개의 값만 남기고 나머지는 모두 0으로 만드는 Top-k 희소화 방법을 사용할 수 있다. Top-k 희소화 방법은 특정한 벡터 에 대해서, 절대값이 큰 순서 대로 개의 값들 서버로 해당 개 의 값과, 해당 값들의 위치 를 업로드 하게 된다. 이때, 위치 값을 업로드하기 위한 인코딩은 골롬 포지션 코딩(Golomb position encoding) 방법을 사용할 수 있다. Top-k 희소화 기반의 압축방법은 도 4 내지 도 6에 나타낸 세 가지의 방법 중 어느 하나를 이용할 수 있다. 도 4를 참조하면, per-particle sparsification의 경우, 업로드 해야하는 파티클 업데이트 값이 모델사이즈"}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "에 대해 아래와 같은 형태의 행렬이므로, 다음과 같이 각 파티클, 즉 각 열에 대해 독립적으로 Top-k sparsification 방법을 적용한다."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이 경우 모든 파티클에 대해 희소화를 진행해주기 때문에, 위치 정보를 업로드 하는데 값에 비례하는 정보량 을 사용하게 된다. 도 5를 참조하면, shared sparsification은 도 4의 방법에서 위치 정보량을 절약하기 위해 모든 파티클에 대해 같은 패턴으로 희소화를 진행한다. 즉, 희소화 후의 업데이트 행렬은 아래와 같은 꼴이 된다."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이 때, 큰 k개의 값 위치는 절대값의 합 을 통해 정하고, 모든 파티클에 대해 해 당 위치에 있는 값을 보내고 나머지는 0으로 처리한다. 이렇게 되면 업로드 해야하는 값에 대한 정보량은 동일 하지만, 위치 정보에 대한 정보량을 줄일 수 있게 된다. 도 6를 참조하면, 도 4의 방법과 도 5의 방법을 섞어 파티클을 몇 개의 그룹으로 나누어 그룹 안에서만 희소화 패턴을 공유하는 (alpha)-shared sparsification 방법을 사용할 수 있다. 이 경우, 는 각 그룹에 들어가는 파티클의 비율을 의미하며, 일 때 shared 방법, 일 때 per-particle 방법을 표현하게 된다. 각 그룹별로 아래와 같이 같은 희소화 패턴을 공유하게 된다."}
{"patent_id": "10-2023-0025211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "희소화 패턴을 정하는 방법은 shared sparsification과 비슷하게, 그룹내에서 파티클끼리 절대값 합을 한 뒤 큰 k개의 위치를 골라 패턴을 정한다. 이렇게 압축된 개의 값을 예컨대 stochastic quantization 방법을 통해 양자화 시키고, 인코딩 (encoding) 된 값들의 위치정보와 함께 서버에 업로드 한다(S340). 압축 및 양자화시 k 값과 stochastic quantization level(양자화 되는 정도)에 따라서 용량 제한을 만족시키는 통신을 가능하게 할 수 있다. 도 7 및 도 8은 본 발명의 실시예에 따른 베이지안 연합학습 방법에서 알파 값에 따른 테스트 정확도와 ECE 값 의 차이를 나타낸 그래프이다. 도 7 및 도 8은 -shared sparsification 방법에서 값에 따른 성능을 비교한그래프이다. 도 7 및 도 8에서 볼 수 있듯이, (shared), (per-particle) 경우 테스트 데이터셋에 대 한 정확도와 ECE 값에 있어서 sub-optimal한 성능을 내며 를 조절함에 따라 최적의 성능을 얻을 수 있다. 도 9는 본 발명의 실시예에 따른 베이지안 연합학습과 비-베이지안 연합학습의 성능을 비교한 그래프이다. 베이 지안 학습(DSVGD) 및 비-베이지안 학습(FedAvg)을 통신 용량 제한이 있는 분산 무선 네트워크에서 실험 및 비교 한 그래프이다. 해당 실험 결과를 통해 본 발명의 실시예에 따른 방법이 통신 용량 제한이 있는 환경에서도 여 전히 비-베이지안 학습방법에 비해 정확도 및 신뢰도 측면에서 더 우수함을 알 수 있다. 지금까지 설명한 바와 같이, 본 발명의 실시예들에 따르면, 통신 용량의 제한이 있을 수 있는 무선 통신 환경에 서 서버와 베이지안 연합학습을 수행하는 다수의 모바일 장치 중 어느 하나가 모델 업데이트 정보의 압축 및 양 자화를 통해 정보 전달의 용이성을 향상시킴으로써 정확도와 신뢰도 높은 학습 결과를 제공하는 효과가 있다. 한편, 전술한 실시예에 따른 베이지안 연합학습 방법에 포함된 각각의 단계는, 이러한 단계를 수행하도록 프로 그램된 컴퓨터 프로그램을 기록하는 컴퓨터 판독가능한 기록매체에서 구현될 수 있다. 또한, 전술한 실시예에 따른 베이지안 연합학습 방법에 포함된 각각의 단계는, 이러한 단계를 수행하도록 프로 그램된, 컴퓨터 판독가능한 기록매체에 저장된 컴퓨터 프로그램의 형태로 구현될 수 있다. 본 발명에 첨부된 각 흐름도의 각 단계의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수도 있다. 이 들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도의 각 단계에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이 터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 기록매체에 저장되는 것도 가능하 므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 기록매체에 저장된 인스트럭션들은 흐름도의 각 단계에서 설 명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스 트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프 로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 의 각 단계에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 단계는 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실시예들에서는 단계들에서 언급된 기능 들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 단계들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 단계들이 때때로 해당하는 기능에 따라 역순으로 수행 되는 것도 가능하다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 품질에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술사상은 본 발명의 권 리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0025211", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 무선 통신 환경의 베이지안 연합학습 시스템의 구성도이다. 도 2는 본 발명의 실시예에 따른 베이지안 연합학습 방법을 수행하는 모바일 장치의 구성도이다. 도 3은 본 발명의 실시예에 따른 베이지안 연합학습 방법을 설명하기 위한 흐름도이다. 도 4 내지 도 6은 본 발명의 실시예에 따른 베이지안 연합학습 방법 중 압축 과정의 다양한 예를 보인 개념도이 다. 도 7 및 도 8은 본 발명의 실시예에 따른 베이지안 연합학습 방법에서 알파 값에 따른 테스트 정확도와 ECE(expected calibration error) 값의 차이를 나타낸 그래프이다. 도 9는 본 발명의 실시예에 따른 베이지안 연합학습과 비-베이지안 연합학습의 성능을 비교한 그래프이다."}
