{"patent_id": "10-1999-0006346", "section": "특허_기본정보", "subsection": "특허정보", "content": {"출원번호": "10-1999-0006346", "출원인": "대원강업 주식회사    허영준", "발명자": "박세진"}}
{"patent_id": "10-1999-0006346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시트 각 체압 센서FSR(Force Sensing Resistor)값을 받아 디지털 값으로 변환시켜 컴퓨터로 데이 터를 전송하고, 체압 분포 축적용 컨트롤러(controller)는 컴퓨터와 통신을 하는 IO 버퍼(Buffer)와, 순차 적으로 측정되는 각 FSR의 주소를 지정해주는 어드레스 디코더(Address decoder)에 데이터를 보내고, 지정되는 주소에 따라 각 체압 센서를 ON/OFF 시켜주는 입력 멀티플렉서(Multiplexor)와, 측정된 체압 센서 값 을 주소에 맞게 내보내주는 출력 멀티플렉서(Multiplexor) 및, 그 값을 증폭시켜주는 Pre. AMP.,와 증 폭된 아날로그 값을 디지털 값으로 변환시켜 주는 A/D 컨버터(Converter)와, 시트 각 체압 센서FSR(Forc e Sensing Resistor)값을 받아 디지털 값으로 변환시켜 컴퓨터로 데이터를 전송하여 상기의 데이터를 기준으로 시트의 모터를 구동시켜 시트의 위치 및 각도를 변형시키는 것을 특징으로 하는 감성 인식이 되는 자동차용 시트.10-51019990006346청구항 2 사용자가 자신의 체형(키, 몸무게)를 입력하면 미리 정해진 규 칙 (SP=ｆ(Anth))에 의해 입력된 체형에 가장 적합한 시트 조절량이 일차적으로 결정되고, 입력된 체형은 체압 분포와 체형과의 관계식(BP*=ｆ(Anth))에 의해 입력된 체형에 가장 적합한 최적 체압 및 체압비를 결정하게 되는 것을 특징으로 하는 감성 인식이 되는 자동차용 시트."}
{"patent_id": "10-1999-0006346", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "통합제어 시스템(컴퓨터)에서 시트 모터의 회전수를 지정하고 동작시키면 통신선을 통해 시트 조절용 컨트롤러에 데이터가 전달되고, 컨트롤러에 있는 프로세서는 컴퓨터에서 보낸 데이터를 받아 회전수를 판단하고 모터를 회전하기 위한 모터 드라이브 회로에 신호를 전달하여 제어하고자 하는 위치만큼 모터의 회전을 가하게 되는 것과, 모터의 회전축은 프로세서에서 제어하는 회전수만큼 돌게 되고 회전축에 연결된 위치 판별용 가이드(guide)는 원하는 위치만큼 움직이게 되는 것으로 구성되어진 것을 특징으로 하는 감성 인식이 되는 자동차용 시트.도면 도면1 도면210-61019990006346 도면3 도면4 도면510-71019990006346 도면6 도면710-81019990006346 도면810-91019990006346 도면9 도면1010-101019990006346"}
{"patent_id": "10-1999-0006346", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 감성 인식이 되는 자동차용 시트에 관한 것으로서, 더 상세하게는 운전자가 시트에 앉았을 때 운전자가 가장 편안한 운전 자세를 유지할 수 있도록 시트의 주요 조절부위가 운전자의 신체 특성에 따라 자동으로 조절될 수 있도록 하는 인공 지능형 자동차용 시트에 관한 것이다. 체압 분포 측정용 컨트롤러(controller)는 컴퓨터와 통신을 하는 IO 버퍼(Buffer)와, 순차적으로 측정되는 각 FSR의 주소를 지정해주는 어드레스 디코더(Address decoder)에 데이터를 보내고, 지정되는 주소에 따라 각 체압 센서를 ON/OFF 시켜주는 입력 멀티플렉서(Multiplexor)와, 측정된 체압 센서 값 을 주소에 맞게 내보내주는 출력 멀티플렉서(Multiplexor) 및, 그 값을 증폭시켜주는 Pre. AMP.,와 증 폭된 아날로그 값을 디지털 값으로 변환시켜 주는 A/D 컨버터(Converter)로 구성되어진다, 시트 각 체압 센서 FSR(Force Sensing Resistor)값을 받아 디지털 값으로 변환시켜 컴퓨터로 데이터를 전송하고, 시 트의 위 치 및 각도 조절용 모터를 작동시켜 변형시키는 감성 인식이 되는 자동차용 시트이다."}
{"patent_id": "10-1999-0006346", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "및 그 분야의 종래기술 본 발명은 감성 인식이 되는 자동차용 시트에 관한 것으로서, 더 상세하게는 운전자가 시트에 앉았을 때 운전자가 가장 편안한 운전 자세를 유지할 수 있도록 시트의 주요 조절부위가 운전자의 신체 특성에 따라 자동으로 조절될 수 있도록 하는 인공 지능형 자동차용 시트에 관한 것이다. 자동차 시트는 운전자 및 탑승객에게는 가장 밀접한 부분으로서, 자동차 운행 중 노면의 불규칙한 형상에 따라 발생하는 진동과 쇼크로부터 운전자와 탑승객을 진동으로부터 보호해야 하며 제한된 공간에 서 오는 불편함을 조금이나마 해소할 수 있도록 안락하게 설계되어야 한다. 자동차 시트는 넓은 범위의 인체 특성치를 수용해야 하며, 자동차 내부 기기나 조종장치와 인간과 의 원활한 상호작용을 위해 인간의 신체치수 제약과 잘 부합되어야 한다. 자동차 시트의 인간공학적 설계를 위해서는 크게 두 가지 요소가 고려된다 . 첫째, 운전자 가 편안한 운전자세를 유지할 수 있도록 시트의 위치 및 각도가 제공되어야 하며, 둘째 자동차 시트는 특정 신체 부위의 과도한 눌림이 없이 최적의 압력분포를 제공해야 한다. 즉 운전자세 및 시트 조절 특성은 운전 효율성, 안전성, 그리고 안락감에 중요한 영향을 미치는 요소이다. 그리고 시트와 신체 사이에 발생 하는 압력은 시트 안락감에 결정적인 영향을 미친다. 그러므로 특정부위의 과도한 눌림이나 불완전한 압력분포는 원활한 혈액순환을 방해하여 운전자의 신체에 저림이나 마비를 초래할 수 있어 이로 인하여 자동차 사고가 발생하는 등 문제점이 발생하였다. 상기의 문제점을 해결하기 위해 종래에도 여러 가지 방법이 시도되었으며 그 중 메모리 시트를 개 발하였는데 메모리시트의 구성 및 작용을 살펴보면 다음과 같다. 메모리 시트의 조절 부위 구성은 시트 좌판의 전방 높이 조절과 시트의 좌판의 후방 높이 조절 및 시트 높이(프론트 틸팅과 리어 틸팅이 동시에 이루어짐) 조절과, 시트 전후방으로 레일을 따라 이동 및 시트 등판의 각도가 전동식으로 조절이 되는 것으로 이루어졌다. 상기의 메모리 시트의 작동은 최대 3명까지 시트를 조절한 후 가장 최적의 시트 상태에서 시트의 위치 및 각도를 메모리 하여 저장한 후 운전자에 따라 버튼을 작동하여 1,2,3 번으로 시트의 위치 및 각 도를 변형하였다. 즉 운전을 하고자 시트에 착석 후 1,2,3 번 버튼 중 하나를 누르면 미리 기억된 위치대로 시트 위 치 및 각도가 자동으로 조절된다. 그러나 상기의 시트 위치 및 각도가 가장 운전하기에 적당한 형상을 취하고 있는지 알 수 없을 뿐 만 아니라 장시간 자동차로 여러 명이 여행을 할 때에는 피로를 적게 갖도록 돌아가면서 운전을 함으로 운전자가 수시로 바뀌게 되는데 이러한 상황에서는 메모리를 기억된 것이 필요가 없게 되므로 운전자는 수시로 임의 시트를 변형해 가면서 운전을 해야 하는 불편한 문제점이 발생하였다. 발명이 이루고자 하는 기술적 과제 본 발명은 상기와 같은 문제점을 해결하기 위하여 안출한 것으로서, 운전자가 운전을 하고자 시트에 앉았 을 때 운전자가 가장 편안한 운전 자세를 유지할 수 있도록 시트의 주요 조절부위가 운전자의 신체 특성과 체압에 따라 자동으로 조절될 수 있도록 하는 인공 지능형 자동차용 시트를 제작하고자 하는데 그 목 적이 있는 것이다. 상기의 목적 달성을 위해 모터와 체압 센서가 장착된 시트와 상기 체압 센서의 체압 분포를 측정하는 체 압 분포 측정기와 체압 분포 측정기가 감지한 체압에 따라 시트의 위치 및 각도를 조절하는 시트 조절 시스템과 상기 이들을 통합적으로 제어하는 통합 제어 시스템으로 구성되는 것을 제공하여 운전자의 체형 에 따라 시트가 자동으로 조절되는 자동차용 시트를 제공함에 있다. 발명의 구성 및 작용 첨부된 도면에 의거하여 본 발명의 구성 및 작용을 상세히 설명하면 다음과 같다. 도 1 은 본 발명 자동차용 시트의 전체 구성 사시도,도 2 는 본 발명 자동 체형 감지 시트의 구성도,도 3 은 본 발명 자동 체형 감지 시트의 조절 부위 상태를 나타낸 측면도,도 4 는 본 발명 체압 센서 삽입 위치를 나타낸 구성도,도 5 는 본 발명 체압 센서의 힘에 대한 저항을 나타낸 그래프, 10-21019990006346도 6 은 본 발명 자동 체형 감지 시트의 작동 상태 순서도, 도 7 은 본 발명 자동 시트용 테이타 베이스의 구성도,도 8 은 본 발명 자동 체형 감지 시트 제어시스템의 구성도,도 9 는 본 발명 자동 체형 감지 시트의 일시예의 체압 분포도,도 10은 본 발명 자동 체형 감지 시트의 콘트롤 박스의 외형도를 도시한 것이다. 시트 등판과 좌판에 각각 7개씩의 체압 센서가 내장되어 있다. 그리고 4가지의 주요 조절 부위에 4개의 모터인 프론트 상·하향 모터, 리어 상·하향 모터, 등받이 모터, 슬라이딩 모터가 장착되어 있어서 시트 좌판의 전 후방 높이 조절 및 전 후방 거리 조절, 그리고 시트 등받이의 등판 각도 조 절은 전동식으로 조절된다. 체압 분포 시스템은 시트 각 FSR(Force Sensing Resistor)(이하 체압 센서는 FSR로 표기한다 )을 받아 디 지털 값으로 변환시켜 컴퓨터로 데이터를 전송하는 기능을 가지고 있다. 상기의 체압 센서인 FSR은 폴리머(polymer)로 된 박막형 필름으로 매우 유연하여 응력(shear stres s)이 거의 없다. 이 체압 센서(FSR)는 그 표면에 작용된 힘(force)이 증가함에 따라 저항치의 감소를 나타낸다. 그림 는 FSR의 작용된 힘에 대한 저항치의 변화 특성을 나타낸다. 도 5에서 볼 수 있듯이 log F와 log R은 거의 선형을 이룬다. 힘에 대한 저항치를 일반적인 수치로 비교하면 다음과 같다. 100 g -〉 80,000 ohm 500 g -〉 25,000 ohm 1 kg -〉 13,000 ohm 10 kg -〉 2,200 ohm 각 FSR은 서로간에 ±15%의 오차를 수반하기 때문에 교정이 필요하다. 교정은 도 5의 특성을 이용 한다. 도 5의 특성을 수식으로 표현하면 다음과 같다."}
{"patent_id": "10-1999-0006346", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "미지수 a, b를 결정하기 위해 1000g과 2000g의 부하를 FSR에 가하고, 그 부하에 대한 디지털 값을 측정하여 각 FSR에 대한 a, b를 결정하여 서로간의 오차를 보상하였다. 체압 분포 측정용 컨트롤러(controller)는 컴퓨터와 통신을 하는 IO Buffer, 순차적으로 측정되는 각 FSR 의 주소를 지정해주는 어드레스 디코더(Address decoder), 지정되는 주소에 따라 각 FSR을 ON/OF F 시켜주 는 입력 멀티플렉서(Multiplexor),측정된 FSR 값을 주소에 맞게 내보내주는 출력 멀티플렉서 (Multiplexor), 그 값을 증폭시켜주는 Pre. AMP., 증폭된 아날로그 값을 디지털 값으로 변환시켜 주는 A/D 컨버터(Converter)로 구성되어졌으며 상기의 시스템에서 읽혀진 데이터를 분석하여 시트에 부착된 모 터를 구동시켜 시트의 변형을 가질 수 있는 것이다. 시트 조절 시스템은 파워 시트와 DC 모터 컨트롤러(Motor Controller)를 이용하였으며 통합 제어 시스 템 에서는 입력되는 체형, 체압 분포, 시트 조절 데이터 등을 미리 정해진 규칙에 의해 통합적으로 제어한다. 본 발명 자동 체형 감지시트의 기본 메카니즘은 도 6에 도시되어 있는 바와 같이 SP(Seat Position)는 시 트 조절량을, BP(Body Pressure)는 체압 분포를 BP*는 최적 체압 분포를, 그리고 Anth(Anthropometry)는 체형을 각각 나타낸다. 사용자가 자신의 체형(키, 몸무게)를 입력하면 미리 정해진 규 칙 (SP=ｆ(Anth))에 의해 입력된 체형에 가장 적합한 시트 조절량이 일차적으로 결정된다.한편 입력된 체형은 체압 분포와 체형과의 관계 식(BP*=ｆ(Anth))에 의해 입력된 체형에 가장 적합한 최적 체압 및 체압비를 결정하게 되는 것이다. 여기서 사용자의 체형을 입력하는 것은 추후 계속 축적되는 데이터 베이스와 개선될 규칙 베이스에 활용 하기 위한 것이다. 체압 분포를 이용하여 체형을 추정할 정도의 체형과 체압 분포에 대한 데이터가 확보되면 체형을 입력할 필요 없이 자동으로 사용자의 체형을 추정하여 자동 체형 감지 시트의 메카니즘이 실행될 것이다. 시트 제어 시스템은 일차적으로 결정된 시트 조절량에 따라 시트 주요부위의 모터를 구동시켜 시트를 자 동으로 조절한다. 즉 슬라이딩 모터를 작동시켜 시트 전체를 전후로 이동시킬 수 있으며, 후론트 상·하향 모터나 리어 상·하향 모터 및 등받이 모터를 작동시켜 모터가 작동이 되면서 모터에 결합된 볼트 형상의 나사 를 구동시키고 볼트 형상의 나사가 구동으로 연동되어 작동되게 설치된 너트 나사가 다시 작동이 되고 너트 나사의 작동으로 인해 시트에 부착된 스크루가 회전이 됨으로 시트가 상·하 방향으로 이동이 되게 되 는 것이다. 다시 한번 그 작동 예를 살펴보면 통합제어 시스템(컴퓨터)에서 시트 모터의 회전수를 지정하고 동작시키면 통신선을 통해 시트 조절용 컨트롤러에 데이터가 전달된다. 컨트롤러에 있는 프로세서는 컴퓨 터에서 보낸 데이터를 받아 회전수를 판단하고 모터를 회전하기 위한 모터 드라이브 회로에 신호를 전달 하여 제어하고자 하는 위치만큼 모터의 회전을 가하게 된다. 모터의 회전축은 프로세서에서 제어하는 회전수만큼 돌게 되고 회전축에 연결된 위치 판별용 가이드(guide)는 원하는 위치만큼 움직이게 되므로 시 트의 위치 및 각도가 변형이 되는 것이다. 상기 자동 시트 제어 시스템은 입력되는 운전자 체형, 체압 분포 데이터, 시트 조절 데이터 등에 10-31019990006346따라 미리 정해진 규칙에 의해 이들을 종합적으로 제어하는 것이다. 운전자의 체형, 기준위치에서의 체압 분포 데이터, 최적 위치에서의 체압분 포 데이터, 최적 시트 조절량 등에 대한 지속적인 정보 관리를 위해 도 7과 같은 데이터 베이스를 구축하였다. 데이터 베이스의 필드 구성은 사용자 정보(성명, 성별, 키, 몸무게, 신체충실지수, 키에 대한 몸 무게 비), 기준 위치에서의 체압 정보(STBP_b1, STBP_b2,…, STBP_c7), 최적위치에서의 체압 정보 (OPBP_b1, OPBP_b2,…, OPBP_c7), 시트 조절량 정보(Front tilting, Rear ti lting, Sliding, Reclining) 등으로 구성되어 있다. 1) 규칙 베이스는 다음과 같다. 운전자의 체형 정보, 최적 시트 조절량 정보, 최적 체압 정보 등에 대한 통계적 분석을 통해 규칙 베이스를 구성하였다. 자동체형 감지시트의 통합적 제어를 위한 기본적인 규칙은 다음과 같다. 가. 입력된 체형에 따라 일차적으로 시트를 구동하기 위한 규칙이다. 이 규칙은 체형과 시트 조절량간 의 다중회귀분석을 통해 추정된 회귀식을 이용하였다. 자동체형 감지시트의 사용자가 체형을 입력하면 아 래의 규칙에 의해 시트의 각 부분이 일차적으로 자동 조절되게 된다."}
{"patent_id": "10-1999-0006346", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 3, "content": "(상기 및 하기의 상수 값은 회귀분석을 한 시트의 움직임을 100을 기준으로 하였을 때 움직임을 나 타낸 치수임) 나. 입력된 사용자의 체형에 대한 최적 체압 및 체압비를 추정하기 위한 규칙이다. 이 규칙은 의 규칙에 따라 일차적으로 시트가 조절된 상태에서 체압을 측정하게 되는데, 이 측정된 체 압과 최적 체압을 비교하기 위해서이다. 이 규칙은 체형과 체압 분포 데이터의 다중회귀분석 결과를 이용 하여 구축하였다. 자동체형 감지시트의 사용자가 체형을 입력하면 다음의 규칙에 의해 시트 각 부위의 최적 체압 및 체 압비를 추정하게 된다."}
{"patent_id": "10-1999-0006346", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 4, "content": "다. 시트가 일차적으로 구동된 후의 측정 체압과 최적 체압과의 비교를 위한 규칙이다. 측정 체압과 최적 체압을 서로 비교할 때, 측정 체압이 최적 체압을 만족할 기준을 최적 체압의 범위로 결정하기 위해 다중 회귀식의 추정 표준오차(standard error of the estimate) 를 이용하였다. 측정 체압이 아래의 규칙을 만족하면 다음 단계(사용자의 만족 여부)로 넘어가고, 그렇지 않으면 시트 조절량과 체압과의 관 계 규칙에 의해 시트가 재 구동된다."}
{"patent_id": "10-1999-0006346", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 5, "content": "10-41019990006346"}
{"patent_id": "10-1999-0006346", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 6, "content": "라. 측정 체압이 최적 체압의 범위를 만족하지 못할 경우에 다음의 규칙에 따라 시트가 재 조절된다. 이 규칙은 시트 조절량 정보와 체압 분포 간의 상관분석 결과를 이용하여 구축하였다. 아래의 규칙에 따 라 측정 체압이 최적 체압의 범위를 만족할 때까지 반복하여 재 조절된다."}
{"patent_id": "10-1999-0006346", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 7, "content": "2) 자동 시트 제어 시스템 자동 시트 제어 시스템은 도 8과 같이 크게 사용자 정보, 체압 정보, 시트 조절 정보 패널과 몇 개의 명령키 등으로 구성되어 있다. 사용자 정보 패널에서는 사용자의 성별, 키, 몸무게 등을 입력하여 데이터베이스에 추가할 수 있 다. 입력된 키와 몸무게를 입력하면 신체충실지수 및 키에 대한 몸무게 비 등 이 자동으로 계산된다. 체 압 정보 패널에는 운전자와 시트 사이에 발생하는 체압을, 시트 조절 정보 패널에서는 시트의 위치 및 각 도의 조절량을 실시간으로 보여준다. 시트 조절은 사용자가 수동으로 조절하는 수동 모드와 제어 시스템 에서 자동으로 조절하는 자동 모드가 있다. 명령키 [기준 위치]는 시트를 미리 정해진 일정 위치로 초기화하고, 사용자가 착석하기 전의 체압 을 측정, 기록한다. 이렇게 측정된 체압은 오프 셋(off set)값을 결정하기 위해서이다. [작동개시] 버튼 은 입력된 사용자의 체형을 이용하여 정해진 규칙에 의해 시트를 구동한다. [자료저장] 버튼은 사용자 정 보, 체압 정보, 시트 조절량 정보 등을 데이터베이스에 추가 저장한다. [취소 버튼]을 이용하여 실행 중 인 상태를 취소하고 다시 시작할 수 있다. 즉 운전자가 운전을 하기 위해 시트에 앉게 되면 도 9와 같이 체압의 분포가 나타나고 이를 시스 템에서 읽어 시트의 형상을 변형시키는 것이다. 도 10에 도시한 컨트롤 박스는 자동으로도 아니면 메모리된 시트의 형상으로도 각각 시트의 형상 을 변형시켜 운전자에게 최적의 시트 형상을 제공할 수 있도록 하는 것이다."}
