{"patent_id": "10-2023-0080279", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0178433", "출원번호": "10-2023-0080279", "발명의 명칭": "AI 기반의 직거래 마켓 플랫폼 시스템 및 영업방법", "출원인": "천성권", "발명자": "천성권"}}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "유무선 인터넷상에서 직거래 마켓 플랫폼 시스템을 이용한 영업방법에 있어서,생산자단말기에서 어플리케이션의 직거래장터에 접속하여 마켓개설 탭을 클릭하고 상품정보 생산자정보 생산지정보를 입력하고 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 수신된 정보를 확인한 후 마켓개설 실행 신호를 상기 생산자단말기로 전송하는 단계, 상기수신된 정보를 클라우드로 전송하여 저장하는 단계, 그리고 상기 어플리케이션에 마켓을 생성시키고 생성된 마켓을 직거래장터에 배치하는 단계;소비자단말기에서 상기 어플리케이션의 직거래장터에 접속하여 상품을 검색하고 상기 플랫폼서버로 전송하는 단계와,AI가 상기 플랫폼서버의 제어 아래 상기 클라우드로부터 마켓 목록을 전송받는 단계, 상기 AI가 학습된 모델에따라 해당 상품을 판매하는 마켓 목록을 추출하는 단계, 추출된 마켓 목록의 상품을 상기 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 목록상 마켓의 상품을 상기 소비자단말기로 전송하여 UI에 목록상 마켓의 상품을 디스플레이 하는 단계; 및상기 소비자단말기에서 구매할 상품을 장바구니에 담고 결재아이콘을 클릭하여 상기 플랫폼서버로 결재요청을전송하는 단계와,상기 플랫폼서버에서 결재요청 사항을 결재회사서버로 전송하는 단계, 상기 결재회사서버에서 결재한 후 결재된사항을 다시 상기 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 결재된 사항을 상기 소비자단말기와 상기 생산자단말기로 전송하여 UI에 결재사항을 디스플레이 하는 단계;를 거쳐 상기 소비자단말기와 상기 생산자단말기간 직거래하는 단계를 포함하는 것을 특징으로 하는 AI 기반의직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 직거래장터에 축제장터를 개설하는 단계는,상기 AI가 상기 플랫폼서버의 제어 아래 상기 클라우드로부터 축제명과 마켓 목록을 전송받는 단계, 상기 AI가학습된 모델에 따라 축제가 확정된 축제명과 관련 마켓 목록을 추출하는 단계, 추출된 축제명과 마켓 목록을 상기 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 축제장터를 개설한 후 목록상 마켓의 상기 생산자단말기로 축제장터에 참가할지를 묻는 메시지를 전송하는 단계,상기 생산자단말기에서 축제장터 참가를 선택해 전송하면 상기 플랫폼서버에서 상기 마켓을 축제장터에 배치하는 단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 직거래장터에 떨이장터를 개설하는 단계는,상기 AI가 상기 플랫폼서버의 제어 아래 상기 클라우드로부터 마켓 목록을 전송받는 단계, 상기 AI가 학습된 모델에 따라 상품 재고수량이 이상탐지된 마켓 목록을 추출하는 단계, 추출된 마켓 목록을 상기 플랫폼서버로 전송하는 단계와,공개특허 10-2024-0178433-3-상기 플랫폼서버에서 떨이장터를 개설한 후 목록상 마켓의 상기 생산자단말기로 떨이장터에서 판매할지를 묻는메시지를 전송하는 단계, 상기 생산자단말기에서 떨이장터에서 판매할 상품, 할인율, 수량을 선택해 전송하면상기 플랫폼서버에서 상기 마켓을 떨이장터에 배치하는 단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 직거래장터에 꾸러미장터를 개설하는 단계는,상기 AI가 상기 플랫폼서버의 제어 아래 상기 클라우드로부터 마켓 목록을 전송받는 단계, 상기 AI가 학습된 모델에 따라 꾸러미 판매가 확정된 지역명과 관련 마켓 목록을 추출하는 단계, 추출된 꾸러미 판매 지역명과 관련마켓 목록을 상기 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 꾸러미장터를 개설한 후 목록상 마켓의 상기 생산자단말기로 꾸러미장터에서 판매할지를묻는 메시지를 전송하는 단계, 상기 생산자단말기에서 꾸러미장터에서 판매할 상품, 포장단위, 포장단위별 판매가격, 수량 등을 지정해 전송하면 상기 플랫폼서버에서 상기 마켓을 꾸러미장터에 배치하는 단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 직거래장터에 직구대행장터를 개설하는 단계는, 마켓을 개설한 직구대행자단말기에서직구예정 상품명, 상품생산지, 상품포장단위, 상품등급별가격, 직구희망수량, 직구총수량 등의 직구예정 상품정보를 입력하여 상기 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 상기 수신된 정보를 상기 클라우드로 전송하여 저장하는 단계, 그리고 상기 마켓을 직구대행장터에 배치하는 단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 상기 직거래장터에 예약판매장터를 개설하는 단계는,마켓을 개설한 상기 생산자단말기에서 예약상품명, 출하예정일, 상품등급별 출하예정수량, 상품등급별가격 등의예약상품 정보를 입력하여 상기 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 상기 수신된 정보를 상기 클라우드로 전송하여 저장하는 단계, 그리고 상기 마켓을 예약판매장터에 배치하는 단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 2, 3, 4, 5, 6에 있어서, 신규로 마켓을 개설한 상기 생산자단말기에서 각 장터에 참가하는 단계는,상기 생산자단말기에서 상기 장터 중 어느 하나를 선택해 상기 플랫폼서버로 참가요청을 전송하는 단계,상기 AI가 상기 플랫폼서버의 제어 아래 상기 클라우드로부터 마켓 목록을 전송받는 단계, 상기 AI가 학습된 모델에 따라 해당 장터의 마켓 목록을 추출하는 단계, 추출된 마켓 목록과 상기 생산자단말기의 마켓이 일치되는지를 확인하는 단계, 그리고 확인된 결과를 상기 플랫폼서버로 전송하는 단계,상기 플랫폼서버에서 일치 확인으로 통보된 마켓을 해당 장터에 배치하는 단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 책정된 상품의 판매가격 중 비정상적인 판매가격을 조정하는 단계는,상기 AI가 상기 플랫폼서버의 제어 아래 상기 클라우드로부터 마켓 목록을 전송받는 단계, 상기 AI가 학습된 모델에 따라 상품의 판매가격이 이상탐지된 마켓 목록을 추출하는 단계, 추출된 마켓 목록을 상기 플랫폼서버로공개특허 10-2024-0178433-4-전송하는 단계와,상기 플랫폼서버에서 목록상 마켓의 상기 생산자단말기로 판매가격 확인 메시지를 전송하여 상기 생산자단말기에서 판매가격을 조정하는 단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서, 생산자단말기에 주요 지역의 상품 시세를 제공하는 단계는,상기 AI가 플랫폼서버의 제어 아래 클라우드로부터 빅데이터를 전송받는 단계, 상기 AI가 학습된 모델에 따라상품별로 주요 지역의 평균경매낙찰가격과 평균소비자가격에 대한 자료를 1차로 추출하는 단계, 1차로 추출된자료를 다시 해당 상품을 판매하는 상기 생산자단말기별로 2차로 추출하는 단계, 그리고 2차로 추출된 자료를상기 플랫폼서버로 전송하는 단계, 상기 플랫폼서버에서 2차로 추출된 자료를 해당 상품을 판매하는 상기 생산자단말기로 전송하여 UI에 상품의 평균경매낙찰가격과 평균소비자가격을 디스플레이 하는 단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서, 상기 생산자단말기에서 결산을 실시간 관리하게 하는 단계는,상기 AI가 상기 플랫폼서버의 제어 아래 상기 클라우드로부터 마켓 목록을 전송받는 단계, 상기 AI가 학습된 모델에 따라 마켓별로 누적판매수량과 누적판매금액을 추출하는 단계, 추출된 누적판매수량과 누적판매금액을 상기 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 누적판매수량과 누적판매금액을 해당 마켓의 상기 생산자단말기로 전송하여 UI에 누적판매수량과 누적판매금액을 디스플레이하는 단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서, 상기 생산자단말기에서 재고를 실시간 관리하게 하는 단계는,상기 AI가 상기 플랫폼서버의 제어 아래 상기 클라우드로부터 마켓 목록을 전송받는 단계, 상기 AI가 학습된 모델에 따라 마켓별로 판매할 총수량에서 판매된 수량을 차감한 재고수량을 추출하는 단계, 추출된 재고수량을 상기 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 재고수량을 해당 마켓의 상기 생산자단말기로 전송하여 UI에 재고수량을 디스플레이 하는단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서, 상기 생산자단말기에서 거래내역에 대한 장부를 관리하게 하는 단계는,상기 생산자단말기에서 스프레드시트에 필요항목을 체크하여 상기 플랫폼서버로 전송하는 단계와,상기 AI가 상기 플랫폼서버의 제어 아래 상기 클라우드로부터 마켓 목록을 전송받는 단계, 상기 AI가 학습된 모델에 따라 해당 마켓의 선택항목 데이터를 추출하는 단계, 추출된 해당 마켓의 데이터를 상기 플랫폼서버로 전송하는 단계와,상기 플랫폼서버에서 데이터를 상기 생산자단말기로 전송하여 UI의 스프레드시트에 데이터를 디스플레이 하는단계;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "유무선 인터넷상에서 이용하는 직거래 마켓 플랫폼 시스템에 있어서, 생산자단말기에서 상품정보 생산자정보 생공개특허 10-2024-0178433-5-산지정보를 입력하고 전송하면 마켓을 생성시켜 개설하는 마켓개설부;소비자단말기에서 상품을 검색하고 전송하면 UI에 해당 상품을 판매하는 마켓의 상품을 디스플레이 하는 상품검색부;상기 생산자단말기에서 개설한 마켓이 배치돼 있고, 상기 소비자단말기에서 검색한 마켓의 상품을 디스플레이하여 상기 소비자단말기와 상기 생산자단말기간 직거래할 수 있게 하는 직거래장터부;상기 마켓개설부 상기 상품검색부 그리고 상기 직거래장터부를 구성하는 어플리케이션; 및상기 어플리케이션이 탑재된 상태로써 상기 소비자단말기와 상기 생산자단말기를 유무선 네트워크를 통해 연결하여 제어하고 관리하는 플랫폼서버;를 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,상기 어플리케이션은 지역특산품 축제나 중소기업 우수상품전에 대하여 축제장터를 개설한 후 관련 상기 생산자단말기에서 축제장터에 마켓을 열고 상품을 판매할 수 있게 하는 축제장터부;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서,상기 축제장터부는 농수산물과 같이 계절적으로 출하 시기가 정해져 있는 상품에 대하여 해당 상품의 첫 출하시점부터 마지막 출하 시점까지의 기간내에서 상당 기간을 정해 축제장터를 개설한 후 관련 상기 생산자단말기에서 축제장터에 마켓을 열고 상품을 판매할 수 있게 하는 축제장터부;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 13에 있어서,상기 어플리케이션은 등록된 상품의 재고수량이 이상탐지된 마켓에 대하여 떨이장터를 개설한 후 관련 상기 생산자단말기에서 떨이장터에 마켓을 열고 상품을 판매할 수 있게 하는 떨이장터부;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 13에 있어서,상기 어플리케이션은 일정 지역내에서 생산된 각기 다른 상품을 꾸러미로 묶음 판매하려는 것에 대하여 꾸러미장터를 개설한 후 관련 상기 생산자단말기에서 꾸러미장터에 마켓을 열고 상품을 판매할 수 있게 하는 꾸러미장터부;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 13에 있어서,상기 어플리케이션은 일정 지역내에서 극소량의 상품 또는 대용량의 상품을 직구하려는 것에 대하여 직구대행장터를 개설한 후 관련 직구대행자단말기에서 직구대행장터에 마켓을 열고 직구대행 할 수 있게 하는 직구대행장터부;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "공개특허 10-2024-0178433-6-청구항 13에 있어서,상기 어플리케이션은 생산 중이거나 생산 예정인 상품 또는 구매결재 중 품절된 상품에 대하여 예약판매장터를개설한 후 관련 상기 생산자단말기에서 예약판매장터에 마켓을 열고 상품을 예약판매 할 수 있게 하는 예약판매장터부;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 13에 있어서,상기 어플리케이션은 책정된 판매가격 중 비정상인 판매가격을 이상탐지하여 플랫폼서버에서 해당 상품을 판매하는 마켓의 상기 생산자단말기로 전송하여 UI에서 판매가격을 조정하게 하는 판매가격조정부;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 20에 있어서,상기 판매가격조정부는 AI가 빅데이터를 분석하여 추출한 상품별 주요 지역의 평균경매낙찰가격과 평균소비자가격에 대한 시세 자료를 플랫폼서버에서 해당 상품을 판매하는 마켓의 상기 생산자단말기로 전송하여 UI에 시세자료를 디스플레이 하는 것을더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 13에 있어서,상기 어플리케이션은 AI가 마켓별 판매데이터를 분석하여 추출한 판매현황을 플랫폼서버에서 해당 마켓의 상기생산자단말기로 전송하여 UI에서 결산 및 재고관리를 하게 하는 판매현황관리부;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "청구항 13에 있어서,상기 어플리케이션은 AI가 마켓별 거래데이터를 분석하여 추출한 거래데이터를 플랫폼서버에서 해당 마켓의 상기 생산자단말기로 전송하여, UI의 스프레드시트에 거래데이터를 디스플레이 하여 장부를 관리할 수 있게 하는거래장부관리부;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "에 있어서,상기 플랫폼서버는 상기 소비자단말기와 상기 생산자단말기가 직거래장터를 비롯한 각 장터에서 결재회사서버및 택배회사서버와 상호 유기적으로 연결되게 함으로써 직거래를 가능하게 하는 어플리케이션;를 더 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템."}
{"patent_id": "10-2023-0080279", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 유무선 인터넷상에서 소비자와 생산자 사이에 이루어지는 AI 기반의 직거래 마켓 플랫폼 시스템 및 영 업방법에 관한 것이다. 본 발명은 생산자가 직거래장터에 마켓을 개설하고 상품가격을 결정하여 직접 운영하게 하고, 소비자가 직거래장 (뒷면에 계속)"}
{"patent_id": "10-2023-0080279", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인터넷상에서 이용하는 소비자와 생산자간 직거래 마켓 플랫폼 시스템 및 영업방법에 관한 것으로서, 구체적으로는 소비자와 생산자가 실질적인 직거래를 할 수 있게 하는 기능을 제공하고, 더 나아가서는 직거래를 활성화시킬 수 있게 하는 기능을 제공하는 AI 기반의 직거래 마켓 플랫폼 시스템 및 영업방법에 관한 것이다."}
{"patent_id": "10-2023-0080279", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 사물인터넷(Internet of Things:IOT), 5G, 스마트폰, 웨어러블, 빅데이터, 클라우드, 인공지능 (Artificial Intelligence:AI, 이하 AI라 칭함), 블록체인, 핀테크와 같은 첨단 정보통신기술이 발전하고, 컴퓨 팅 파워 또한 엄청나게 향상되었다. 그리고 각종 디바이스가 유무선 네트워크를 통해 상호 연결되고, 다양한 디 바이스에서 생성/수집된 빅데이터가 클라우드에 저장될 뿐만 아니라, 초연결, 초고속, 초대용량, 초실시간의 서 비스가 가능하게 됨으로써 인터넷상에서 가상세계와 현실세계(online to offline:O2O, 이하 O2O라 칭함))의 융 합에 의한 O2O 플랫폼 비즈니스 모델이 활발히 이용되고 있다. 본 발명은 이와 관련된 것으로서, 본 발명의 배경이 되는 종래 기술에는 대한민국 등록특허 10-1539625호 (2015.07.21.등록) 모바일 마켓 플랫폼 제공 서버 및 시스템, 대한민국 등록특허 10-2138843호(2020.07.22.등 록) AI 기반의 농축수산물 직거래 유통 서비스 시스템 및 방법, 대한민국 등록특허 10-2428932호(2022.07.29.등 록) 컨텐츠 기반 농축수산물 직거래 플랫폼 서비스 제공 방법 및 시스템이 있다. 상기 종래 기술은 소비자와 생산자간 직거래를 연결하는 시스템 및 방법을 제공하고 있다. 그러나, 코로나19 펜데믹 상황에서 정부의 거리두기 정책에 따라 락다운되어 단체급식이 중단되자, 농수산물의 판로가 막혀 농작물은 그냥 밭에서 갈아엎어지고, 양식장의 물고기 또한 그대로 양식장에서 폐사하는 것을 목도 하였다. 이처럼 판로가 막히자 생산자는 생산물을 폐기할 수밖에 없는 실정이었지만 소비자는 구매할 방법이 없었고, 시 장에서의 소비자가격은 그리 싸지도 않았다는 데 문제가 있다. 다른 한편, 마스크가 꼭 필요한 소비자는 비싼 값을 주고서라도 마스크를 구하려 했지만, 가뜩이나 공급부족으 로 품귀현상을 빚자 마스크값이 천정부지로 튀어 오르는 상황에서 일부의 사재기로 인하여, 정작 마스크가 필요 한 소비자는 구매할 수 없었다는 데도 문제가 있다. 또 다른 면에서 볼 때 상품유통과 관련해서는 절대적 약자인 농축수산물 생산자, 1인창업 기업, 신설 중소벤처 기업들은 유통업체에 어렵게 상품을 론칭한다 하더라도 납품단가, 판매수수료 및 광고비 등에서 일방적으로 불 합리한 처우를 받아 분쟁이 끊이질 않고 있다. 이를 극복하고자 농축수산물 생산자는 판로개척의 일환으로서 온 라인상에 홈페이지를 구축하거나 유튜브 또는 블로그를 통해서 활동도 해보지만, 광고나 홍보에 한계가 있어 지 속적인 유지관리가 쉽지 않다는 데 문제가 있다. 이와 같은 사실에 비추어 볼 때 종래 기술은 분명 소비자와 생산자가 실질적으로 직거래할 수 있는 시스템이나 방법을 제공하지 못한다는 문제점이 있다. 선행기술문헌 특허문헌(특허문헌 0001) 대한민국 등록특허 10-1539625호(2015.07.21.등록) 모바일 마켓 플랫폼 제공 서버 및 시스템 (특허문헌 0002) 대한민국 등록특허 10-2138843호(2020.07.22.등록) AI 기반의 농축수산물 직거래 유통 서비스 시스템 및 방법 (특허문헌 0003) 대한민국 등록특허 10-2428932호(2022.07.29.등록) 컨텐츠 기반 농축수산물 직거래 플랫폼 서 비스 제공 방법 및 시스템"}
{"patent_id": "10-2023-0080279", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해결하기 위하여, 본 발명은 소비자와 생산자가 실질적으로 직거래를 할 수 있게 하는 AI 기반 의 직거래 마켓 플랫폼 시스템 및 영업방법을 제공하는 데 있다. 본 발명의 다른 목적은 소비자와 생산자간 직거래를 활성화시킬 수 있게 하는 AI 기반의 직거래 마켓 플랫폼 시 스템 및 영업방법을 제공하는 데 있다."}
{"patent_id": "10-2023-0080279", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 이루기 위하여, 본 발명인 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법에 있어서, 직거래장터에 접속한 생산자단말기에서 마켓개설 탭을 클릭하고 상품정보 생산자정보 생산지정보를 입력하고 플 랫폼서버로 전송하는 단계, 플랫폼서버에서 수신된 정보를 확인한 후 마켓개설 실행 신호를 생산자단말기로 전 송하는 단계, 수신된 정보를 클라우드로 전송하여 저장하는 단계, 그리고 어플리케이션에 마켓을 생성시키고 생 성된 마켓을 직거래장터에 배치하는 단계, 직거래장터에 접속한 소비자단말기에서 상품을 검색하고 플랫폼서버 로 전송하는 단계, AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받는 단계, 상기 AI가 학습된 모델에 따라 해당 상품을 판매하는 마켓 목록을 추출하는 단계, 추출된 마켓 목록의 상품을 상기 플랫폼서버로 전송하는 단계, 플랫폼서버에서 목록상 마켓의 상품을 소비자단말기로 전송하여 UI에 목록상 마켓의 상품을 디 스플레이 하는 단계, 소비자단말기에서 구매할 상품을 장바구니에 담고 결재아이콘을 클릭하여 플랫폼서버로 결 재요청을 전송하는 단계, 플랫폼서버에서 결재요청 사항을 결재회사서버로 전송하는 단계, 결재회사서버에서 결 재한 후 결재된 사항을 다시 플랫폼서버로 전송하는 단계, 플랫폼서버에서 결재된 사항을 소비자단말기와 생산 자단말기로 전송하는 단계를 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업 방법을 제공한다. 직거래장터에 축제장터를 개설하는 단계, 직거래장터에 떨이장터를 개설하는 단계, 직거래장터에 꾸러미장터를 개설하는 단계, 직거래장터에 직구대행장터를 개설하는 단계 및 직거래장터에 예약판매장터를 개설하는 단계를 더 포함할 수 있다. 또한 직거래장터에는 책정된 상품의 판매가격 중 비정상적인 판매가격을 이상탐지하여 판매가격을 조정하게 하 는 단계, 주요 지역의 상품별 평균경매낙찰가격과 평균소비자가격의 시세 자료를 제공하는 단계, 마켓별로 누적 판매수량과 누적판매금액을 제공하여 실시간 결산 관리하게 하는 단계, 마켓별로 판매할 총수량에서 판매된 수 량을 차감한 재고수량을 제공하여 실시간 재고를 관리하게 하는 단계 및 마켓별로 선택항목 데이터를 스프레드 시트에 제공하여 거래내역에 대한 장부를 관리하게 하는 단계를 더 포함할 수 있다. 다른 면에서는, 본 발명인 AI 기반의 직거래 마켓 플랫폼 시스템에 있어서, 생산자단말기에서 상품정보 생산자 정보 생산지정보를 입력하면 마켓을 생성시켜 개설하는 마켓개설부, 소비자단말기에서 상품을 검색하면 UI에 해 당 상품을 판매하는 마켓의 상품을 디스플레이 하는 상품검색부, 생산자단말기에서 개설한 마켓이 배치돼 있고, 소비자단말기에서 검색한 마켓의 상품을 디스플레이 하여 소비자단말기와 생산자단말기간 직거래할 수 있게 하 는 직거래장터부, 마켓개설부 상품검색부 그리고 직거래장터부를 구성하는 어플리케이션, 어플리케이션이 탑재 된 상태이고 소비자단말기와 생산자단말기를 유무선 네트워크를 통해 연결하여 제어하고 관리하는 플랫폼서버를 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템이 제공된다. 플랫폼서버는 축제장터부, 떨이장터부, 꾸러미장터부, 직구대행장터부, 예약판매장터부, 판매가격조정부, 판매 현황관리부, 거래장부관리부, 상품결재부 및 상품배송부를 구성하는 어플리케이션을 포함할 수 있다. 또 다른 면에서는, 본 발명인 AI 기반의 직거래 마켓 플랫폼 시스템에 있어서, 상품을 검색하고 선호상품을 등 록하고 구매할 상품에 대한 결재를 요청하는 소비자단말기, 상품정보 생산자정보 생산지정보 등을 등록하여 마 켓을 개설하고 상품 판매가격을 결정하여 직접 마켓을 운영하고 관리하는 생산자단말기, 플랫폼서버의 제어 아 래 클라우드부터 빅테이터를 전송받아 학습된 모델에 따라 학습한 결과를 출력해서 플랫폼서버로 전송하는 AI, 플랫폼서버로부터 생산자와 소비자의 데이터 그리고 각종 빅데이터를 전송받아 저장하고 플랫폼서버의 제어 아 래 빅데이터를 AI로 전송하는 클라우드, 소비자단말기 생산자단말기 AI 클라우드를 연결하여 제어하고 관리하는 플랫폼서버를 포함하는 것을 특징으로 하는 AI 기반의 직거래 마켓 플랫폼 시스템이 제공된다. 플랫폼서버는 소비자단말기와 생산자단말기가 직거래장터를 비롯한 각 장터에서 결재회사서버 및 택배회사서버 와 상호 유기적으로 연결되게 함으로써 직거래를 가능하게 하는 어플리케이션을 포함하는 것이 바람직하다."}
{"patent_id": "10-2023-0080279", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 생산자는 상품에 대한 가격결정권을 갖고 판매가격을 책정하여 마켓을 직접 운영할 수 있고, 소비자로부터의 상품평 등 피드백을 실시간 받을 수 있는 장점이 있다. 또한, 축제장터와 꾸러미장터에서 상품을 판매하여 판매증진 효과를 누릴 수 있고, 떨이장터에서 적정재고량을 초과 보유한 상품을 긴급 처분하거나 판매중 소량 남은 상품을 신속히 판매할 수 있으며, 직구대행장터에서 직 구대행을 통해 판매할 상품을 다양화하여 수익을 다변화하고 재고 부담을 없앨 수 있으며, 예약판매장터에서 예 약판매를 함으로써 사전에 판로를 확보하게 되는 장점이 있다. 그뿐만 아니라 비정상적으로 책정된 판매가격을 신속히 확인하고 조정하여 너무 싼 가격으로 팔지 않아 적정이 윤을 확보할 수 있는 반면에, 너무 비싼 가격으로 팔지 않아 소비자로부터의 신뢰를 저버리지 않게 되는 효과도 있다. 한편, 소비자는 상품을 가격대별, 품질등급별, 생산지역별 및 생산자별로 사용 용도에 따라 쉽고 빠르게 찾아 한눈에 보고 비교/구매할 수 있는 장점이 있다. 그리고 여러 지역에서 동시다발적으로 개최되는 축제장터와 떨이장터에서 색다른 경험을 하며 가성비 최고의 상 품을 구매할 수 있고, 꾸러미장터에서 여러 가지 상품을 한꺼번에 구매할 수도 있고, 극소량의 상품을 구매하려 는 1인 가족 소비자뿐만 아니라 대용량의 상품을 구매하려는 소비자도 직구대행장터를 통해 구매할 수 있으며, 선호하는 상품을 예약구매 할 수 있는 장점이 있다."}
{"patent_id": "10-2023-0080279", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 첨부한 도면을 참고하여 상세히 설명하기로 한다. 우선, 본 발명에서 사용하는 용어에 대해 혼동을 방지하고 통일을 기하기 위하여 소비자와 사용자를 다음과 같 이 정의한다. 상품이나 서비스를 구매하고 소비하는 소비자에는 수요자와 구매자를 포함(이하, 소비자로 칭함) 할 수 있고, 상품이나 서비스를 생산하고 판매하는 생산자에는 공급자와 판매자를 포함(이하, 생산자로 칭함)할 수 있다. 아울러 소비자와 생산자는 개인을 한정하는 것은 아니고, 조직이나 단체 또는 기업을 포함할 수 있다. 도1은 본 발명의 구성요소를 나타내는 구성도이다. 도시된 바와 같이, AI 기반의 직거래 마켓 플랫폼 시스템은 소비자단말기, 생산자단말기, 플랫폼서버, 어플리케이션, AI, 클라우드, 결재회 사서버 및 택배회사서버를 포함하여 구성한다. 상기 구성요소가 유무선 네트워크를 통해 플랫폼서버에 연결되고, 플랫폼서버의 제어 아래 상호 작동함으로써, 소비자와 생산자가 직거래할 수 있는 AI 기반의 직거래 마켓 플랫폼 시스템을 제공하게 된다. 상기 구성요소 중 소비자단말기, 생산자단말기, 결재회사서버 및 택배회사서버는 본 발명의 어플리케이션이 이 미 다운로드 된 상태로 컴퓨터 및 서버, 노트북, 테블릿, 스마트폰 등의 기기를 포함할 수 있다. 또한 상기 구 성요소가 플랫폼서버의 어플리케이션에 접속하여 플랫폼서버의 제어 아래 상호간 정보를 전송하고 저장하고 처 리하는 일련의 과정은 공지기술이 적용되고 있음을 전제로, 본 발명에 있어서 기술 사상의 핵심 사항을 설명하 는 이외에는 설명이 생략될 수 있다. 소비자단말기는 유무선 네트워크를 통해 플랫폼서버에 연결되어 상품을 검색하고, 선호하는 상품을 등록하 고, 구매할 상품을 결재하고, 상품배송 상황을 확인하는 데 사용되는 소비자의 기기이다. 생산자단말기는 유무선 네트워크를 통해 플랫폼서버에 연결되어 상품정보, 생산자정보 및 생산지정보를 등 록하여 마켓을 개설하고, 상품가격을 책정하여 직접 마켓을 운영하며, 상기 등록정보를 변경/추가/삭제하는데 사용되는 생산자의 기기이다. 플랫폼서버는 유무선 네트워크를 통해 상기 구성요소들과 연결되어 각각의 구성요소를 제어하고 관리하며 작동시키는 기능을 하는 플랫폼의 컴퓨터시스템 및 서버이다. 플랫폼서버는 관리자의 기기를 포함할 수 있다. 특히 플랫폼서버는 본 발명의 특징적 구성요소인 어플리케이션을 탑재하고 있어서, 생산자단말기와 연결되어 생 산자단말기로부터 상품정보를 전송받아 마켓을 생성시켜 개설하고, 소비자단말기와 연결되어 소비자단말기에서 검색한 상품을 전송하여 사용자인터페이스(user interface;UI, 이하 UI라 칭함)에 상품을 디스플레이하고, 결재 회사서버와 연결되어 소비자단말기에서 결재를 요청하면 결재사항을 전송하여 결재하게 하고, 택배회사서버와 연결되어 결재된 상품에 대한 배송사항을 전송하여 상품을 배송하게 함으로써, 소비자단말기와 생산자단말기가 상호 직거래할 수 있게 한다. 또한, 플랫폼서버는 소비자단말기와 생산자단말기로부터 전송받은 데이터뿐만 아니라 사물인터넷과 스마트폰 등 다양한 디바이스를 통해 수집되는 빅데이터를 클라우드에 전송하여 저장한다. 빅데이터를 수집하는 방법에는 오 픈 API를 이용한 방법, 웹 크롤링 방법 및 로그수집 방법 등이 사용될 수 있다. 어플리케이션은 본 발명의 가장 큰 특징적 구성요소로서 플랫폼서버에 탑재되어 생산자단말기에서 상품을 등록하여 마켓을 개설하게 하고, 소비자단말기에서 검색한 상품을 UI에 디스플레이 하여 볼 수 있게 하고, 결재 회사서버 및 택배회사서버를 유기적으로 연결함으로써 소비자단말기와 생산자단말기간 실질적인 직거래를 구현 할 수 있게 만들어진 하이브리드 웹과 앱이다. AI는 플랫폼서버에 장착된 상태로 플랫폼서버의 제어 아래 클라우드부터 빅테이터를 전송받아 학습된 모델 에 따라 학습한 결과를 출력해서 플랫폼서버로 전송하는 컴퓨터공학의 기술이다. 클라우드는 유무선 네트워크를 통해 플랫폼서버와 연결되어 플랫폼서버로부터 전송되는 생산자와 소비자의 데이터 및 각종 디바이스로부터 수집되어 전송되는 빅데이터를 저장하고, 플랫폼서버의 제어 아래 빅데이터를 AI로 전송하는 데이터센터의 서버이다. 결재회사서버는 유무선 네트워크를 통해 플랫폼서버와 연결되어 소비자단말기로부터 요청된 결재사항을 플 랫폼서버로부터 전송받아 결재한 후 결재된 사항을 플랫폼서버로 전송하는 결재회사의 서버이다. 택배회사서버는 유무선 네트워크를 통해 플랫폼서버와 연결되어 생산자단말기로부터 요청된 상품배송 사항 을 플랫폼서버로부터 전송받아 상품을 배송한 후 소비자단말기와 플랫폼서버로 배송완료 메시지를 전송하는 택 배회사의 서버 및 택배배송자의 기기이다. 본 발명 즉, AI 기반의 직거래 마켓 플랫폼 시스템에 있어서, 플랫폼서버에 탑재된 어플리케이션에 대하여 첨부 한 도면을 참조하여 상세히 설명하기로 한다. 도2는 본 발명의 플랫폼서버에 탑재된 어플리케이션의 구성요소를 나타내는 구성도이다. 본 발명의 플랫폼서버 는 도시된 바와 같은 어플리케이션을 탑재하는 것이 가장 큰 특징이다. 어플리케이션은 직거래장터부, 축제장터부, 떨이장터부, 꾸러미장터부, 직구대행장터부 , 예약판매장터부, 마켓개설부, 상품검색부, 판매가격조정부, 판매현황관리부, 거래장부관리부, 상품결재부, 상품배송부를 포함하여 구성한다. 이와 같은 구성요소를 갖춘 어플리케이션으로 말미암아 본 발명의 기술적 사상이 구체적으로 구현될 수 있고, 소비자와 생산자가 실질적인 직거래를 할 수 있게 하는 기능을 제공할 뿐만 아니라, 더 나아가서는 직거래를 활 성화시킬 수 있게 하는 기능도 제공하게 된다.직거래장터부는 생산자가 생산자단말기에서 마켓개설부를 통해 개설한 마켓을 배치해 놓은 장터이고, 어플 리케이션에 접속한 소비자단말기 UI에 표시되는 장터로써, 소비자가 상품을 검색하고 구매결정된 상품을 결재하 여 소비자와 생산자가 직거래할 수 있게 하기 위한 것이다. 마켓개설부는 생산자가 생산자단말기에서 마켓을 개설하여 가격결정권을 갖고 판매가격을 책정한 후 마켓 을 직접 운영하게 하기 위한 것이다. 상품검색부는 소비자가 소비자단말기에서 상품을 가격대별, 품질등급별, 생산지역별과 생산자별로 사용 용 도에 따라 쉽고 빠르게 찾아 한눈에 보고 상품을 구매하게 하기 위한 것이다. 축제장터부는 지방자치단체나 중소벤처기업부 등에서 개최하는 지역특산품 축제나 중소기업 우수상품전 등 에 있어서, 축제장터를 개설한 후 관련 생산자단말기에서 축제장터에 마켓을 열고 상품을 판매하게 하기 위한 것이다. 떨이장터부는 생산자가 적정재고량을 초과 보유한 상품이나 판매 중 소량 남은 상품에 있어서, 떨이장터를 개설한 후 관련 생산자단말기에서 떨이장터에 마켓을 열고 상품을 신속히 판매할 수 있게 하기 위한 것이다. 꾸러미장터부는 일정 지역내에서 각기 다른 상품을 생산하는 생산자가 꾸러미로 묶음 판매하는 것에 있어 서, 꾸러미장터를 개설한 후 관련 생산자대표단말기에서 꾸러미장터에 마켓을 열고 상품을 판매하게 하기 위한 것이다. 직구대행장터부는 일정 지역내의 소비자가 극소량의 상품이나 대용량의 상품을 직거래로 구매하려는 것에 있어서, 직구대행장터를 개설한 후 관련 직구대행자단말기에서 직구대행장터에 마켓을 열고 직구대행을 하게 하 기 위한 것이다. 예약판매장터부는 생산자가 생산 예정이거나 생산 중인 상품 또는 구매결재 중 품절된 상품에 있어서, 예 약판매장터를 개설한 후 관련 생산자단말기에서 예약판매장터에 마켓을 열고 상품을 예약판매 하게 하기 위한 것이다. 판매가격조정부는 생산자가 생산자단말기에서 책정한 판매가격 중 비정상적인 판매가격을 신속히 이상탐지 하여 판매가격을 조정하게 하기 위한 것이다. 판매현황관리부는 생산자단말기에 판매현황을 실시간 제공하여 생산자가 결산 및 재고관리를 쉽고 빠르게 하게 하기 위한 것이다. 거래장부관리부는 다수 생산자가 거래장부를 별도 관리하는 불편을 없애 UI의 스프레드시트에 거래내역 데 이터를 제공하여 생산자단말기에서 직접 거래장부를 관리할 수 있게 하기 위한 것이다. 상품결재부는 결재회사서버에서 제공되는 결재 어플리케이션이 소비자단말기 UI에 단독으로 또는 장바구니 와 결합하여 연동되게 결재아이콘을 생성시켜 소비자가 소비자단말기에서 구매 결정한 상품을 장바구니에 담아 결재하게 하기 위한 것이다. 상품배송부는 거래가 체결된 상품의 배송사항을 택배회사서버로 전송하여 상품을 배송하게 하고, 소비자가 소비자단말기에서 배송상황을 확인하게 하기 위한 것이다. 다른 면에서는 본 발명 즉, AI 기반의 직거래 마켓 플랫폼 시스템을 이용한 영업방법에 대하여, 도2를 참조하여 상세히 설명하기로 한다. 소비자와 생산자가 직거래를 할 수 있게 하기 위한 직거래장터개설 단계에 따른, 일실시예는 생산자가 생산자단 말기에서 마켓개설 단계를 거쳐 생성된 마켓을 플랫폼서버에서 직거래장터에 배치하는 것이고, 소비자단말기에 서 어플리케이션에 접속하면 UI에 직거래장터를 나타내게 되므로 소비자는 상품을 검색하고 구매할 상품을 장바 구니에 담고 결재아이콘을 클릭하여 결재함으로써, 소비자단말기와 생산자단말기간 직거래를 할 수 있게 되는 것이다. 생산자는 직거래장터에 마켓을 입점시킴으로써 고객 확보가 가능하고 상품에 대한 소비자의 반응을 실시간으로 파악할 수 있는 장점이 있다. 생산자가 마켓을 개설하고 직접 운영하게 하는 마켓개설 단계에 따른, 일실시예는 생산자단말기에서 어플리케이 션에 접속하여 UI에 표시된 마켓개설 탭을 클릭하고 상품정보(상품명, 상품사진, 상품등급별가격, 상품등급별수 량, 생산사진 등), 생산자정보(상호명, 생산자명, 지역번호, 전화번호, 휴대전화번호, 주소, 거래은행, 예금주,계좌번호 등) 및 생산지정보(농지원부, 축사인허가증명, 선박원부, 가공식품허가증, 상품제조허가증 등)와 같은 필요한 사항을 입력하여 플랫폼서버로 전송하면, 플랫폼서버에서 수신된 정보를 확인한 후 마켓을 어플리케이션 에 생성시키고, 수신된 상품정보 등을 클라우드로 전송하여 저장하고, 생산자단말기로 마켓개설 실행 신호를 전 송하여 마켓을 개설하게 하는 것이다. 다른 실시예는 생산자단말기에서 플랫폼서버로 상품정보 등을 전송하여 등록하는 방법에 있어서, 플랫폼서버의 어플리케이션에 내장된 카메라로 상품정보 등을 촬영하여 등록하는 방법, 기존의 사진, 동영상, 파일 등을 업로 드하여 등록하는 방법 또는 키보드로 입력하여 등록하는 방법이 사용될 수 있으며, 등록된 상품정보 등은 수정/ 변경/삭제할 수 있다. 생산자는 마켓을 개설하여 직접 운영하게 됨으로써 판매할 상품에 대한 가격결정권을 갖는다는 것이 가장 큰 특 징이고, 시장에 출하하지 못하던 등급외 농산물도 판매할 수 있으며, 소비자로부터 상품평 등에 대한 피드백을 실시간으로 확인할 수 있다는 장점이 있다. 소비자가 용도에 따라 상품을 찾아 한눈에 볼 수 하게 하는 상품검색 단계에 따른, 일실시예는 어플리케이션에 접속한 소비자단말기에서 UI에 생성된 직거래장터에서 찾고자 하는 상품명을 검색하고 플랫폼서버로 전송하면, AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 검색한 상품에 대한 가 격대별, 품질등급별, 생산지역별 및 생산자별로 마켓 목록을 추출하고 추출된 마켓 목록을 플랫폼서버로 전송하 면, 플랫폼서버에서 목록상 마켓의 상품을 소비자단말기로 전송하여 UI에 마켓의 상품을 디스플레이 하는 것이다. 다른 실시예는 소비자단말기에서 상품을 검색할 때 상품명을 선택한 후 가격대별, 품질등급별, 생산지역별 및 생산자별 중에서 어느 하나의 아이콘을 선택하고 디스플레이 할 상품의 갯수를 지정하면, 선택항목에 대한 지정 갯수 만큼의 상품을 UI에 디스플레이 하게 된다. 선택하지 않은 나머지 항목에 대해서는 해당 항목을 클릭하거 나 스크롤하면 순차적으로 UI에 지정 갯수 만큼의 상품을 디스플레이 하게 된다. 플랫폼서버에서 UI에 상품을 디스플레이 하는 순서는 AI가 클라우드로부터 전송받은 빅데이터를 분석한 결과에 따라 정해질 수 있고, 또는 소비자단말기에서 수집된 선호하는 상품이나 소비성향(즉, 비싼 가격대, 좋은 품질, 유기농 등)과 같은 상품구매 이력을 분석한 결과에 따라 정해질 수도 있다. 또 다른 실시예는 UI에서 아이콘을 클릭하는 방법으로도 상품을 검색할 수 있다. 예를 들어, 사과를 구매하고자 하는 경우 UI상의 농산물아이콘을 클릭하면 하위에 구성된 청과아이콘이 생성되고, 청과아이콘을 클릭하면 하위 에 구성된 사과아이콘이 생성되고, 사과아이콘을 클릭하면 하위에 구성된 지역별아이콘이 생성되고, 계속해서 지역별아이콘을 클릭하면 하위에 구성된 생산자별 마켓의 사과가 UI에 디스플레이 되는 것이다. 아이콘의 구성 및 사용방법은 사용자의 사용 편의성에 따라 추가/변경/삭제될 수 있다. 소비자는 사용 용도에 따라 가격대별, 품질등급별, 생산지역별과 생산자별로 상품을 쉽고 빠르게 찾아 한눈에 볼 수 있고, 목적에 맞는 가성비 최고의 상품을 구매할 수 있는 장점이 있다. 생산자가 축제장터에서 마켓을 열고 상품을 판매하게 하기 위한 축제장터개설 단계에 따른, 일실시예는 AI가 플 랫폼서버의 제어 아래 클라우드로부터 축제명과 마켓 목록을 전송받아 학습된 모델에 따라 축제가 확정된 축제 명과 관련 마켓 목록을 추출하고 추출된 축제명과 관련 마켓 목록을 플랫폼서버로 전송하면, 플랫폼서버에서 축 제장터를 개설한 후 목록상 마켓의 생산자단말기로 축제장터에 참가할지를 묻는 메시지를 전송하여, 생산자단말 기에서 축제장터 참가를 선택해 전송하면 해당 마켓을 축제장터에 배치하여 상품을 판매하게 하는 것이다. 생산자단말기에서 아니오를 선택하고 전송하면 해당 마켓은 축제장터에 배치하지 아니한다. 또한 메시지 중 어 느 하나도 선택하지 않고 일정 시간이 경과하면 메시지를 종료한다.(단, 플랫폼서버에서 생산자단말기 또는 소 비자단말기로 어떤 의사를 묻는 메시지를 전송하는 경우 위와 같은 방식이 적용되므로 이하에서는 설명을 생략 한다.) 다른 실시예는 농수산물과 같이 계절적으로 출하 시기가 정해져 있는 상품과 관련하여 해당 상품의 첫 출하 시 점부터 마지막 출하 시점까지의 기간내에서 상당 기간을 정해 축제장터를 개설하는 단계는, AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 해당 상품명과 출하 기간 및 관련 마켓 목 록을 추출하고 추출된 상품명과 출하 기간 및 마켓 목록을 플랫폼서버로 전송하면, 플랫폼서버에서 축제장터를 개설한 후 목록상 마켓의 생산자단말기로 축제장터에 참가할지를 묻는 메시지를 전송하여, 생산자단말기에서 축 제장터 참가를 선택해 전송하면 해당 마켓을 축제장터에 배치하여 상품을 판매하게 하는 것이다.또 다른 실시예는 축제기간중 신규로 마켓을 개설한 생산자가 축제장터에 참가하는 방법에 있어서는, 어플리케 이션에 접속하여 신규로 마켓을 개설한 생산자단말기에서 축제장터 참가요청을 선택하고 플랫폼서버로 전송하면, AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 축제명과 관 련 마켓 목록을 추출하고, 추출된 마켓 목록과 상기 생산자단말기의 마켓이 일치되는지를 확인한 후 확인된 결 과를 플랫폼서버로 전송하면, 플랫폼서버에서 일치 확인으로 수신된 생산자단말기의 마켓을 축제장터에 배치하 여 상품을 판매하게 하는 것이다. 생산자는 축제장터에서 상품을 판매함으로써 판매증진 효과를 얻을 수 있고, 소비자는 여러 지역에서 동시다발 적으로 실시되는 다양한 축제를 경험하고 가성비 최고의 상품을 구매할 수 있는 장점이 있다. 또한 지방자치단 체 등의 주관부서는 축제장터를 통해 판로개척에 대한 지원이 수월할 뿐만 아니라 배가된 지원정책의 효과도 얻 을 수 있다. 생산자가 적정재고량을 초과 보유한 상품이나 판매 중 소량 남은 상품을 신속히 처분하게 하는 떨이장터개설 단 계에 따른, 일실시예는 AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 보유한 상품의 재고수량이 적정재고 수량보다 많은 마켓 목록을 추출하고 추출된 마켓 목록을 플랫폼서버로 전 송하면, 플랫폼서버에서 목록상 마켓의 생산자단말기로 떨이장터에서 판매할지를 묻는 메시지를 전송하여, 생산 자단말기에서 떨이장터에서 판매할 상품, 할인율, 수량 등을 선택해 전송하면 해당 마켓을 떨이장터에 배치하여 상품을 판매하게 하는 것이다. 다른 실시예는 AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 판매할 총수량에서 판매된 수량을 차감하고 남은 수량이 일정 비율의 수량보다 적게 남은 마켓 목록을 추출하여 추출된 마켓 목록을 플랫폼서버로 전송하면, 플랫폼서버에서 목록상 마켓의 생산자단말기로 떨이장터에서 판매할지를 묻는 메시지를 전송하여, 생산자단말기에서 떨이장터에서 판매할 상품, 할인율, 수량 등을 선택해 전송하면 해 당 마켓을 떨이장터에 배치하여 상품을 판매하게 하는 것이다. 생산자는 적정재고량을 초과 보유한 상품을 긴급 처분할 수 있을 뿐만 아니라 조기에 판매를 마감할 수 있는 장 점이 있고, 소비자는 가성비 최고중의 최고인 상품을 구매하게 되는 효과가 있다. 일정 지역내에서 각기 다른 상품을 생산하는 생산자가 꾸러미로 묶음 판매할 수 있게 하는 꾸러미장터개설 단계 에 따른, 일실시예는 AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 꾸러미 판매가 확정된 지역명과 관련 마켓 목록을 추출하여 추출된 꾸러미 판매 지역명과 관련 마켓 목록을 플 랫폼서버로 전송하면, 플랫폼서버에서 생산대표자단말기에 꾸러미장터(지역 꾸러미 마켓)를 개설한 후 목록상 마켓의 생산자단말기로 꾸러미장터에서 판매할지를 묻는 메시지를 전송하여, 생산자단말기에서 꾸러미장터에서 판매할 상품, 포장단위별 판매가격, 수량 등을 지정해 전송하면 해당 마켓을 꾸러미장터에 배치해 상품을 판매 하게 하는 것이다. 생산자는 꾸러미로 묶음 판매하는 자체뿐만 아니라, 때에 따라서는 떨이로 판매해야 할 상품도 꾸러미로 묶음 판매할 수 있어 판매증진 효과를 얻을 수 있고, 소비자는 다양한 상품을 한꺼번에 구매할 수 있는 장점이 있다. 일정 지역내의 직구대행자가 극소량의 상품 또는 대용량의 상품을 직구대행하게 하기 위한 직구대행장터개설 단 계에 따른, 일실시예는 직구대행자단말기에서 직구예정 상품명, 상품생산지, 상품포장단위, 상품등급별가격, 직 구희망수량, 직구총수량 등의 직구예정 상품정보를 입력하고 전송하면, 플랫폼서버는 수신된 정보를 클라우드로 전송하여 저장하고, 해당 마켓을 직구대행장터에 배치하여 상품을 직구대행 할 수 있게 하는 것이다. 직구대행자는 판매상품을 다양화하여 사전에 판매처를 확보함으로써 수익이 안정화되고 재고 부담을 없앨 수 있 는 장점이 있고, 특히 1인 가족 소비자는 박스째 구매하기 곤란했던 상품도 극소량만 구매할 수 있고 상품을 배 송받기 편한 주거지나 직장 근처에서 직구대행 마켓을 통해 구매할 수 있는 장점이 있으며, 대용량의 상품이 필 요한 소비자 또한 여러 지역에 소량으로 산재한 상품을 직구대행 마켓을 통해 취합하여 구매하게 되는 효과도 있다. 생산자가 상품을 예약판매할 수 있게 하는 예약판매장터개설 단계에 따른, 일실시예는 생산자단말기에서 생산중 이거나 생산예정인 상품명, 출하예정일, 출하예정수량, 상품등급별가격 등의 상품정보를 등록하고 전송하면, 플 랫폼서버는 수신된 정보를 클라우드로 전송하여 저장하고, 해당 마켓을 예약판매장터에 배치하여 상품을 판매하 게 하는 것이다. 다른 실시예는 소비자단말기에서 구매결재 진행 중 상품이 품절된 경우 플랫폼서버에서 해당 마켓의 예약상품 등록여부를 확인하고 예약상품이 등록되어 있으면 소비자단말기 UI에 품절안내 메시지와 함께 해당 마켓의 상품 을 예약구매할지를 묻는 메시지를 전송하여 소비자단말기에서 예약구매를 선택해 전송하면, 플랫폼서버에서 소 비자단말기를 예약판매장터로 연결시킨 후 해당 마켓의 예약상품을 소비자단말기로 전송하여 UI에 예약상품을 디스플레이 하는 것이다. 생산자는 사전에 판로를 확보하는 장점이 있고, 소비자는 선호하는 상품을 예약구매 할 수 있는 효과가 있다. 생산자가 책정한 판매가격 중 비정상적인 판매가격을 신속히 확인하여 판매가격을 조정하게 하는 판매가격조정 단계에 따른, 일실시예는 AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따 라 상품 판매가격이 평균경매낙찰가격 보다 낮게 책정된 마켓 목록을 추출하고 추출된 마켓 목록을 플랫폼서버 로 전송하면, 플랫폼서버에서 목록상 마켓의 생산자단말기로 판매가격 확인 메시지를 전송하여 생산자단말기에 서 판매가격을 조정하게 하는 것이다. 다른 실시예는 AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 상품의 판매가격이 평균소비자가격 보다 높게 책정된 마켓 목록을 추출하고 추출된 마켓 목록을 플랫폼서버로 전송하면, 플랫폼서버에서 목록상 마켓의 생산자단말기로 판매가격 확인 메시지를 전송하여 생산자단말기에서 판매가격을 조정하게 하는 것이다. 또 다른 실시예는 AI가 플랫폼서버의 제어 아래 클라우드로부터 빅데이터를 전송받아 학습된 모델에 따라 상품 별로 주요 지역의 평균경매낙찰가격과 평균소비자가격에 대한 자료를 1차로 추출하고, 1차로 추출된 자료를 다 시 해당 상품을 판매하는 생산자단말기별로 2차로 추출하여 2차로 추출된 자료를 플랫폼서버로 전송하면, 플랫 폼서버에서 2차로 추출된 자료를 해당 상품을 판매하는 생산자단말기로 전송하여 UI에 상품의 평균경매낙찰가격 과 평균소비자가격을 디스플레이 하는 것이다. 생산자는 너무 싸게 팔지 않아 적정이윤을 얻을 수 있는 반면에, 너무 비싸게 팔지 않아 소비자로부터의 신뢰를 저버리지 않는 효과가 있다. 또한 상품의 출하 시기를 조절하거나 출하량을 조절하는 데 활용할 수 있는 장점도 있다. 생산자가 판매현황을 실시간으로 확인할 수 있게 하는 판매현황관리 단계에 따른, 일실시예는 AI가 플랫폼서버 의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 누적판매수량과 누적판매금액을 추출하 고 추출된 누적판매수량과 누적판매금액을 플랫폼서버로 전송하면, 플랫폼서버에서 누적판매수량과 누적판매금 액을 각각의 생산자단말기로 전송하여 UI에 누적판매수량과 누적판매금액을 디스플레이 하는 것이다. 다른 실시예는 AI가 플랫폼서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 판매할 총수량에서 판매된 수량을 차감한 재고수량을 추출하여 추출된 재고수량을 플랫폼서버로 전송하면, 플랫폼서버 에서 재고수량을 각각의 생산자단말기로 전송하여 UI에 재고수량을 디스플레이 하는 것이다. 생산자는 판매현황을 실시간으로 확인하여 결산 및 재고관리도 쉽게 할 수 있는 장점이 있다. 생산자가 거래장부를 별도로 관리하던 불편을 없애주기 위한 거래장부관리 단계에 따른, 일실시예는 생산자단말 기에서 스프레드시트에 필요항목을 체크하여 플랫폼서버로 전송하면, AI가 플랫폼서버의 제어 아래 클라우드로 부터 마켓 목록을 전송받아 학습된 모델에 따라 해당 마켓의 선택항목 데이터를 추출하여 추출된 해당 마켓의 데이터를 플랫폼서버로 전송하면, 플랫폼서버에서 데이터를 상기 생산자단말기로 전송하여 UI의 스프레드시트에 데이터를 디스플레이 하는 것이다. 다른 실시예는 축제관리자단말기에서 스프레드시트에 필요항목을 체크하여 플랫폼서버로 전송하면, AI가 플랫폼 서버의 제어 아래 클라우드로부터 마켓 목록을 전송받아 학습된 모델에 따라 축제장터에 참가한 마켓 목록과 선 택항목 데이터를 추출하여 추출된 마켓 목록과 선택항목 데이터를 플랫폼서버로 전송하면, 플랫폼서버에서 목록 상 마켓의 선택항목 데이터를 축제관리자단말기로 전송하여 UI의 스프레드시트에 목록상 마켓의 데이터를 순차 적으로 디스플레이 하는 것이다. 생산자나 축제관리자는 스프레드시트를 내려받기한 후 다른 거래내역과 함께 통합관리 할 수 있는 장점이 있다. 특히 축제관리자는 축제장터 운영에 따른 정책비용 지급과 통계관리를 간편하게 처리할 수 있고, 축제기간 중의 성과분석을 통해 향후 계획을 수립하는 데 활용할 수도 있다. 도3은 본 발명에서 검색한 상품을 결재하고 결재된 상품을 배송하는 프로세스를 나타내는 순서도이다. 소비자가 소비자단말기에서 검색한 상품을 구매하는 단계에 따른, 일실시예는 소비자단말기에서 상품을 검색하 고 구매를 결정하여 상품을 장바구니에 담고 배송받을 주소, 성명, 연락처 및 수량을 등록한 후 결재아이콘을 클릭하여 플랫폼서버로 결재요청을 전송하면, 플랫폼서버에서 결재요청 사항을 결재회사서버로 전송하여 결재회 사서버에서 결재한 후 결재정보를 다시 플랫폼서버로 전송하면, 플랫폼서버에서 결재사항을 소비자단말기와 생 산자단말기로 전송하는 것이다. 이와 동시에 플랫폼서버는 택배회사서버로 결재된 상품의 출하장소와 배송사항을 전송하는 것을 포함할 수도 있 다. 배송받을 곳이 다수인 경우 소비자는 소비자단말기에서 배송지 추가를 선택하고 배송받을 곳을 추가로 입력할 수 있다. 거래가 체결된 상품을 배송하는 단계에 따른, 일실시예는 생산자단말기에서 상품배송 요청을 플랫폼서버로 전송 하면(별도 요청이 없어도 이후 절차는 진행될 수 있음), 플랫폼서버에서 지정된 택배회사서버로 출하장소, 출하 자 성명, 상품명, 배송수량, 크기, 무게, 부피, 배송할 곳, 받는이 성명, 연락처 등을 전송하고, 택배회사서버 에서 운송장번호를 플랫폼서버로 전송하면, 플랫폼서버에서 생산자단말기와 소비자단말기로 운송장번호를 전송 하게 되고 이후 소비자는 소비자단말기에서는 상품 배송상황을 확인할 수 있으며, 상품배송을 완료하면 택배회 사서버는 플랫폼서버와 소비자단말기로 배송완료 메시지를 전송하는 것이다. 이상과 같이 첨부한 도면을 참조하여 본 발명의 실시예에 대하여 상세히 설명하였으나, 이는 예시적 설명에 불 과한 것으로 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 다양한 수정과 변형된 실시가 가능 할 것이다. 본 발명의 권리범위는 아래의 특허청구범위의 기재에 의하여 정하여져야 할 것이며, 그와 균등한 범위내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다. 산업상 이용가능성 소비자와 생산자의 편익에 중점을 두고 있는 본 발명 즉, AI 기반의 직거래 마켓 플랫폼 시스템 및 영업방법은 소비자와 생산자간 직거래를 가능하게 하고, 더 나아가서 직거래를 활성화시킬 수 있게 하므로 유통업 분야에서 이용될 수 있다."}
{"patent_id": "10-2023-0080279", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명의 구성요소를 나타내는 구성도이다. 도2는 본 발명의 플랫폼서버에 탑재된 어플리케이션의 구성요소를 나타내는 구성도이다. 도3은 본 발명에서 검색한 상품을 결재하고 결재된 상품을 배송하는 프로세스를 나타내는 순서도이다."}
