{"patent_id": "10-2023-0085004", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0003062", "출원번호": "10-2023-0085004", "발명의 명칭": "부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치 및 그 동작 방법", "출원인": "한전케이디엔주식회사", "발명자": "박성철"}}
{"patent_id": "10-2023-0085004", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치의 동작 방법에 있어서,상기 전자 장치의 최초 실행 여부를 판단하는 단계;상기 판단 결과, 상기 전자 장치의 최초 실행인 경우, 부분방전 진단 알고리즘을 이용하여 펄스 데이터 입력 단계들 각각에 대한 부분방전횟수 및 노이즈 횟수에 대한 부분방전비율을 계산한 부분방전 비율 테이블을 생성하는 단계;상기 판단 결과 상기 전자 장치의 최초 실행이 아닌 경우, 상기 부분 방전 비율 테이블로부터 확인된 상기 부분방전비율 및 상기 부분방전횟수에 기초하여, 상기 펄스 데이터 입력 단계들 중에서 적어도 하나의 특정 단계를선택하는 단계;상기 적어도 하나의 특정 단계에 대응하는 임계 전압 범위들을 이용하여 부분방전 계측범위를 선택하는 단계;상기 부분방전 계측범위를 이용하여 상기 부분방전 진단 알고리즘을 수행하는 단계;를 포함하는,부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0085004", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 펄스 데이터 입력 단계들은, 전압 범위 별로 구분되고, 상기 부분방전 비율 테이블을 생성하는 단계는,상기 펄스 데이터 입력 단계들을 제1 단계로부터 임계 단계에 도달할 때까지 한 단계씩 증가시키면서 상기 부분방전 진단 알고리즘을 이용하여, 상기 펄스 데이터 입력 단계들 각각에 대한 상기 부분방전 비율 테이블을 생성하는 단계를 포함하는,부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0085004", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 펄스 데이터 입력 단계들의 누적 단계가 상기 임계 단계를 초과하면, 상기 전자 장치의 최초 실행이 아닌경우에 수행하는 단계들을 수행하는 단계를 더 포함하는,부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0085004", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 전자 장치의 최초 실행이 아닌 경우, 상기 부분 방전 비율 테이블로부터 확인된 상기 부분방전비율이 미리설정된 특정 비율을 초과하고, 상기 부분방전횟수가 미리 설정된 특정 횟수 이상인 펄스 데이터 입력 단계가 존재하지 않는 경우, 상기 펄스 데이터 입력 단계들을 재실행하고, 상기 재실행 횟수가 미리 설정한 특정 횟수 이공개특허 10-2025-0003062-3-상인 경우, 상기 부분방전 계측범위를 미리 설정된 기본 값으로 지정하는 단계를 더 포함하는,부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0085004", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 적어도 하나의 특정 단계를 선택하는 단계는, 상기 부분 방전 비율 테이블로부터 확인된 상기 부분방전비율이 미리 설정된 특정 비율을 초과하고, 상기 부분방전횟수가 미리 설정된 특정 횟수 이상인 펄스 데이터 입력 단계가 존재 하는 경우, 상기 존재하는 펄스 데이터 입력 단계를 상기 적어도 하나의 특정 단계로 선택하는 단계를 포함하는,부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0085004", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 부분방전 계측범위를 선택하는 단계는, 상기 적어도 하나의 특정 단계로 선택된 단계가 1개 일 경우, 상기 선택된 단계에 대응하는 임계 전압범위를 상기 부분방전 계측 범위로 선택하는 단계; 및상기 적어도 하나의 특정 단계로 선택된 단계가 2개 이상일 경우, 상기 선택된 단계들 중 가장 낮은 단계에 대응하는 임계 전압범위의 Min값과, 가장 높은 단계에 대응하는 임계 전압범위의 Max 값을 상기 부분방전 계측범위로 선택하는 단계를 포함하는,부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0085004", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치 장치에 있어서,메모리,프로세서,통신 인터페이스를 포함하고,상기 프로세서는,상기 전자 장치의 최초 실행 여부를 판단하고, 상기 판단 결과, 상기 전자 장치의 최초 실행인 경우, 부분방전 진단 알고리즘을 이용하여 펄스 데이터 입력 단계들 각각에 대한 부분방전횟수 및 노이즈 횟수에 대한 부분방전비율을 계산한 부분방전 비율 테이블을 생성하고, 상기 판단 결과 상기 전자 장치의 최초 실행이 아닌 경우, 상기 부분 방전 비율 테이블로부터 확인된 상기 부분방전비율 및 상기 부분방전횟수에 기초하여, 상기 펄스 데이터 입력 단계들 중에서 적어도 하나의 특정 단계를 선택하고, 상기 적어도 하나의 특정 단계에 대응하는 임계전압 범위들을 이용하여 부분방전 계측범위를 선택하고, 상기 부분방전 계측범위를 이용하여 상기 부분방전 진단 알고리즘을 수행하도록 설정된,부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치"}
{"patent_id": "10-2023-0085004", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예들에 따라서, 부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치 장치는 메 모리, 프로세서, 통신 인터페이스를 포함하고, 상기 프로세서는, 상기 전자 장치의 최초 실행 여부를 판단하고, 상기 판단 결과, 상기 전자 장치의 최초 실행인 경우, 부분방전 진단 알고리즘을 이용하여 펄스 데이터 입력 단 (뒷면에 계속)"}
{"patent_id": "10-2023-0085004", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는, 부분방전 진단 계측 범위를 판단하는 알고리즘을 실행하기 위한 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0085004", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존 부분방전 진단 알고리즘은 배전설비 부분방전 신호를 계측하는 아날로그 센서의 계측범위가 넓은 만큼 Pulse 데이터를 처리해야 하는데 저전력/무선 환경의 특성상 많은 Pulse 데이터를 연산하고 분류하기에는 장치 의 한계가 있고 짧은 시간에 발생하는 최대 전력 사용량을 감당하기 위한 많은 전력 발생장치를 필요로 하는데 비용 문제가 발생한다. 이러한 환경의 특성을 고려하여 모니터링 화면에서 사용자가 제어하는 대신 장치 자체적 인 알고리즘에 의해 범위와 계측 주기를 조절하여 무선 환경의 위험을 회피하고 사용자 불편을 줄이고 시스템을 효율적으로 운영하도록 한다."}
{"patent_id": "10-2023-0085004", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래기술은 부분방전 진단설비를 최초 설치 시 부분방전 계측 센서에서 서버로 보내는 짧은 주기로 제어하여 받 아서 확인해야 하며 데이터를 사용자 판단 하에 어떤 범위를 주로 계측해야 하는지 Min. Max 범위를 PRPD(phase resolved partial discharge, 이하 PRPD) 패턴이 제대로 식별될 때까지 변경해야 하는 불편함이 있고, 시간 흐 름에 따라 기기 노후화로 인해 부분방전 크기가 커지면 계측범위가 수시로 변경되어야 하는 문제 발생한다. 위의 문제가 해결되더라도 부분방전 진단설비를 최초 설치 시 부분방전 계측 센서에서 서버로 보내는 짧은 주기 로 제어하여 받아서 확인해야 하며 데이터를 사용자 판단 하에 어떤 범위를 주로 계측해야 하는지 Min. Max 범 위를 PRPD 패턴이 제대로 식별될 때까지 변경해야 하는 불편함이 있고, 시간 흐름에 따라 기기 노후화로 인해 부분방전 크기가 커지면 계측범위가 수시로 변경되어야 한다. 본 발명은 배전설비 부분방전 진단시스템의 부분방전 계측 센서에서 계측 된 데이터 중 부분방전이 발생 시 주 요 발생 크기의 위치를 자동으로 추적하여 모니터링 UI에서 별도의 Min. Max. 계측 주기를 설정하여 계측 센서 를 제어하는 기존 시스템에서 자동으로 Min. Max. 계측 주기를 조절하여 별도의 제어 프로토콜 개발을 지양하여 무선통신 환경에서의 제어오류를 방지한다. 또한 중요 부분방전 발생 위치를 적절히 스케일링하여 이미지로 추 출 시 PRPD패턴 분류에 적합하게 활용하고자 하는 방법을 제공 할 수 있다."}
{"patent_id": "10-2023-0085004", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예들에 따라서, 부분방전 진단 계측범위를 판단하는 알고리즘을 실행하기 위한 전자 장치 장치는 메 모리, 프로세서, 통신 인터페이스를 포함하고, 상기 프로세서는, 상기 전자 장치의 최초 실행 여부를 판단하고, 상기 판단 결과, 상기 전자 장치의 최초 실행인 경우, 부분방전 진단 알고리즘을 이용하여 펄스 데이터 입력 단 계들 각각에 대한 부분방전횟수 및 노이즈 횟수에 대한 부분방전비율을 계산한 부분방전 비율 테이블을 생성하 고, 상기 판단 결과 상기 전자 장치의 최초 실행이 아닌 경우, 상기 부분 방전 비율 테이블로부터 확인된 상기 부분방전비율 및 상기 부분방전횟수에 기초하여, 상기 펄스 데이터 입력 단계들 중에서 적어도 하나의 특정 단 계를 선택하고, 상기 적어도 하나의 특정 단계에 대응하는 임계전압 범위들을 이용하여 부분방전 계측범위를 선 택하고, 상기 부분방전 계측범위를 이용하여 상기 부분방전 진단 알고리즘을 수행할 수 있다."}
{"patent_id": "10-2023-0085004", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 본 발명은 계측 실행 시 계측 범위를 N분할하여 시간대별로 계측데이터 범위를 제한하여 장치의 Peak 전력사용량을 통제하고 기기 성능의 제약사항을 회피하며, 사용자 판단으로 집중 모니터링 하기 위한 mV구간 (Min Max)을 자동화하여 사용자 개입을 최소화 할 수 있으며, Min. Max. 계측 주기 변수를 자동화하여 무선 hopping 중 제어데이터 유실을 방지하고, 부분방전 유형분류를 하기 위한 이미지데이터(PRPD)를 Min. Max. 값에 의해 자동화 스케일링하여 유형분류 성능 향상을 기대 할 수 있다."}
{"patent_id": "10-2023-0085004", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예들이 첨부된 도면을 참조하여 기재된다. 실시예 및 이에 사용된 용어들은 본 문 서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 및 /또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사 한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 문서에서, \"A 또는 B\" 또는 \"A 및/또는 B 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 해당 구성요소들을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요 소들을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으로 또는 통신적으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 문서에서, \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, 하드웨어적 또는 소프 트웨어적으로 \"~에 적합한,\" \"~하는 능력을 가지는,\" \"~하도록 변경된,\" \"~하도록 만들어진,\" \"~를 할 수 있 는,\" 또는 \"~하도록 설계된\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로 세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버 중 적어도 하나를 포함할 수 있다. 도 1을 참조하여, 다양한 실시예에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 및 통신 인터페이스를 포함할 수 있 다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으 로 구비할 수 있다. 버스는 구성요소들(110-160)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 또는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치, 어플리케이션 프로세서, 또 는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서 는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 1)의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨 어, 어플리케이션 프로그래밍 인터페이스(API), 및/또는 어플리케이션 프로그램(또는 \"어플리케이 션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일부는, 운영 시스템으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서 , 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이 션 프로그램 중 적어도 하나에 전자 장치의 시스템 리소스(예: 버스, 프로세서, 또는 메모 리 등)를 사용할 수 있는 우선 순위를 부여하고, 상기 하나 이상의 작업 요청들을 처리할 수 있다. API는 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스 로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함 수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장치의 다른 구성요소(들)에 전달하거나, 또는 전자 장치의 다른 구 성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외부 전 자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또 는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있다. 한 실시예 에 따르면, 무선 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE), 지그비 (Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 한실시예에 따르면, 무선 통신은 GNSS를 포함할 수 있다. GNSS는, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system일 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 상호 호환적으로 사용될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨 터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 다 양한 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치(102,104), 또는 서버에서 실행될 수 있다. 한 실시예에 따르면, 전자 장치가 어 떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치 (102, 104), 또는 서버)에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(102, 104), 또는 서버(10 6))는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 2는 다양한 실시예들에 따른, 전자 장치(예: 도 1의 전자 장치)가 동작하는 방법을 설명하기 위한 흐름 도이다. 도 3a 및 3b는 다양한 실시예들에 따른, 전자 장치가 생성하는 부분 방전 비율 테이블의 실시예를 나타내 는 도면이다. 도 4는 다양한 실시예들에 따른, 전자 장치가 선택한 임계전압 범위의 실시예를 나타내는 도면이다. 201 동작에서, 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 프로세서)는 전자 장치의 최초 실행 여부를 판단 할 수 있다. 여기서 최초 실행이란, 전자 장치의 초기화 상태에서 처음 전원이 on된 상 태, 전자 장치의 전원이 off 상태에서 on 상태로 부팅된 상태, 전자 장치가 재부팅 된 상태, 전자 장치의 미리 설정된 프로그램이 처음 실행된, 전자 장치의 미리 설정된 프로그램이 한 번 이상 실행된 후라도 미리 설정된 특정 조건을 만족시키는 상태를 의미 할 수 있다. 특정 조건은 예를 들면, 사용자가 전자 장치의 초기화를 실행한 경우, 프로세서 동작 중 오류가 발생하는 경우 등 최초 실행으로 설정 되어 야 하는 다양한 조건을 의미 할 수 있다. 일 실시예에 따르면, 전자 장치가 최초 실행이라고 판단한 경우, 203 동작을 실행하고, 전자 장치가 최초 실행이 아니라고 판단한 경우, 205 동작을 실행 할 수 있다."}
{"patent_id": "10-2023-0085004", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "203 동작에서, 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 프로세서)는 부분방전 진단 알고리 즘을 이용하여 펄스 데이터 입력 단계들 각각에 대한 부분 방전 횟수 및 노이즈 횟수에 대한 부분방전 비율을 계산한 부분방전 비율 테이블을 생성 할 수 있다. 예를 들어, 부분방전 진단 알고리즘은 부분방전 계측 센서를 통해 취득한 데이터(PD, partial discharge)를 펄스 모양에 따라 파생변수를 발생시켜 이를 취득한 후 인공지능 학습을 활용하여 부분방전과 노이즈를 구분하는 것을 의미 할 수 있다. 일 실시예에 따르면, 펄스 데이터 입력 단계들은 전압 범위 별로 구분 될 수 있다. 예를 들어, 부분방전 발생에 따른 펄스 데이터의 전압범위(예: 0~1660mV)를 4등분하여 4단계로 나눌 수 있고, 이 경우, 제1 단계는 0~415mV, 제2 단계는 415~830mV, 제3 단계는 830~1245mV, 제4 단계는 1245~1660mV로 구분될 수 있다. 앞서 예로든 전압 범위와 구분 단계 값은 고정적이지 않고 사용자가 임의로 설정한 값으로 지정 할 수 있다. 일 실시예에 따르면, 부분방전 비율 테이블을 생성하는 단계는 펄스 데이터 입력 단계들을 제 1단계로부터 임계 단계에 도달할 때까지 한 단계씩 증가시키면서 부분방전 진단 알고리즘을 이용하여, 펄스 데이터 입력 단계들 각각에 대한 부분방전 비율 테이블을 생성하는 단계를 포함할 수 있다. 예를 들어, 도 3a를 참조하면, 제 1단계 에 해당하는 전압 범위에 부분방전 진단 알고리즘을 실행하여 제 1단계에 해당하는 부분 방전 횟수(예: 21번) 및 노이즈 횟수(예: 79번)을 산출함으로써, 제 1단계에 해당하는 부분방전 비율(예: 21%)을 확인할 수 있다. 부 분방전 비율이란, 부분방전 진단 알고리즘을 실행하여 나온 결과값 중 부분방전 횟수와 노이즈 횟수를 합산한 값 중에 부분방전의 비율을 백분율로 나타낸 값으로 정의 할 수 있다. 전자 장치는 제 1단계에 해당하는 부분방전 비율을 확인한 후에, 단계를 한 단계씩 증가 시키면서 각 단계에 해당하는 부분방전 비율을 확인할 수 있다. 일 실시예에 따라, 도 3a를 참조하면, 전자 장치는 펄스 데이터 입력 단계들 각각에 대한 부분방전 비율을 이용하여 부분방전 비율 테이블을 생성 할 수 있다. 전자 장치는 생성한 부분방전 비율 테이 블을 메모리에 저장 할 수 있다. 일 실시예에 따르면, 펄스 데이터 입력 단계들의 누적 단계가 임계 단계를 초과하면, 전자 장치의 최초 실 행이 아닌 경우에 수행하는 단계들을 수행 할 수 있다. 예를 들어, 펄스 데이터 입력 단계가 미리 설정한 4단계 값을 초과하여 5단계 이상이 될 경우, 최초 실행이 아닌 것으로 판단할 수 있다. 205 동작에서, 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 프로세서)는 전자 장치의 최초 실행이 아닌 경우, 부분 방전 비율 테이블로부터 확인된 부분 방전 비율 및 부분방전 횟수에 기초하여, 펄 스 데이터 입력 단계들 중에서 적어도 하나의 특정 단계를 선택 할 수 있다. 일 실시예에 따르면, 전자 장치는 부분 방전 비율 테이블로부터 확인된 부분방전 비율이 미리 설정된 특정 비율을 초과하고, 부분방전횟수가 미리 설정된 특정 횟수 이상인 펄스 데이터 입력 단계가 존재하지 않는 경우, 펄스 데이터 입력 단계를 재실행 할 수 있다. 예를 들어, 전자 장치는 미리 설정된 특정 비율(예 : 30%)을 초과하고 미리 설정된 특정 횟수(예 : 30회)를 초과하는 단계가 부분 방전 비율 테이블 내에 존재 하지 않 는 경우, 펄스 데이터 입력 단계들을 재실행 할 수 있다. 여기서, 미리 설정된 비율 및 미리 설정된 특정 횟수 는 고정된 값이 아니며, 사용자가 언제든지 유동적으로 조정 할 수 있는 값을 의미 할 수 있다. 일 실시예에 따르면, 전자 장치는 재실행 횟수가 특정 횟수 이상인 경우, 부분방전 계측 범위를 미리 설정 된 기본 값으로 지정 할 수 있다. 예를 들어, 전자 장치는 재실행을 미리 설정된 횟수(예: 5회) 이상으로 실행한 후에도 부분 방전 비율 테이블로부터 확인된 부분방전 비율이 미리 설정된 특정 비율을 초과하고, 부분 방전횟수가 미리 설정된 특정 횟수 이상인 펄스 데이터 입력 단계가 존재하지 않는 경우 부분 방전 계측 범위를 설정된 기본 값(예: 400~1200 mV)으로 지정 할 수 있다. 여기서 말하는 미리 설정된 횟수 및 미리 설정된 기본 값 역시 사용자가 언제든지 조정 할 수 있는 유동적인 값을 의미 할 수 있다.일 실시예에 따르면, 전자 장치는 부분 방전 비율 테이블로부터 확인된 부분방전비율이 미리 설정된 특정 비율을 초과하고, 상기 부분방전횟수가 미리 설정된 특정 횟수 이상인 펄스 데이터 입력 단계가 존재 하는 경우, 해당 펄스 데이터 입력 단계를 적어도 하나의 특정 단계로 선택할 수 있다. 예를 들어 도 3b를 참고하면, 전자 장치는 미리 설정된 특정 비율(예: 30%)과 미리 설정된 특정 횟수(예 : 30회)를 만족하는 단계가 존 재하는 경우(도 3b의 2단계 : 빨간색 음영표시) 해당단계(2단계)를 특정 단계로 선택 할 수 있다. 207 동작에서, 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 프로세서)는 적어도 하나의 특정 단 계에 대응하는 임계 전압 범위들을 이용하여 부분 방전 계측범위를 선택 할 수 있다. 일 실시예에 따르면, 전자 장치는 각각의 펄스 데이터 입력 단계 별로 임계 전압 범위들을 매칭하여 메모리(예: 도 1의 메모리(13 0))에 저장할 수 있다. 예를 들어, 전자 장치는 제1 펄스 입력 단계에는 제1 임계 전압 범위(예: min=0mV, max=415mV)를 매칭하고, 제2 펄스 입력 단계에는 제2 임계 전압 범위(예: min=415mV, max=830mV)를 매칭하고, 제3 펄스 입력 단계에는 제3 임계 전압 범위(예: min=830mV, max=1245mV)를 매칭하고, 제4 펄스 입력 단계에는 제4 임계 전압 범위(예: min=1245mV, max=1660mV)를 매칭하여, 해당 매칭 정보들을 메모리에 저장할 수 있 다. 일 실시예에 따르면, 전자 장치는 적어도 하나의 특정 단계로 선택된 단계가 1개 일 경우, 선택된 단계에 대응하는 임계 전압범위를 부분 방전 계측 범위로 선택 할 수 있다. 예를 들어, 도 3b와 같이 특정 단계로 선택 된 단계가 1개(2단계)(빨간색 표시)일 경우, 선택된 단계(2단계)에 대응하는 제2 임계 전압범위(415~830mV)를 부분 방전 계측 범위로 선택 할 수 있다. 일 실시예에 따르면, 적어도 하나의 특정 단계로 선택된 단계가 2개 이상일 경우, 선택된 단계들 중 가장 낮은 단계에 대응하는 임계 전압범위의 Min값과, 가장 높은 단계에 대응하는 임계 전압범위의 Max 값을 부분방전 계 측 범위로 선택 할 수 있다. 예를 들어, 도 4를 참조하면, 선택된 특정 단계가 2개 이상(예: 2단계 내지 3단 계)일 경우, 선택된 단계들 중 가장 낮은 단계(2단계)에 대응하는 임계전압범위의 Min값(2단계: 415~830mV 중 415mV)과, 가장 높은 단계(3단계)에 대응하는 임계 전압범위의 Max 값(830~1245mV 중 1245mV) 값을 부분방전 계 측 범위(415~1245mV)(도면의 빨간색 음영표시 부분)로 선택 할 수 있다. 209 동작에서, 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 프로세서)는 부분방전 계측 범위를 이용하여 부분방전 진단 알고리즘을 수행 할 수 있다. 예를 들어, 207 동작에서 선택한 부분방전 계측 범위가 415~1245mV 인 경우, 해당 범위 내에서만 부분방전 진단 알고리즘을 수행 할 수 있다. 본 문서에서 사용된 용어 \"모듈\" 또는 \"~부\"은 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. \"모듈\" 또는 \"~부\"는, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. \"모듈\" 또는 \"~부\"는 기계적으로 또는 전자적으로 구현될 수 있으며, 예를 들면, 어떤 동작들을 수행하는, 알려졌거나 앞으로 개발될, ASIC(application-specific integrated circuit) 칩, FPGAs(field- programmable gate arrays), 또는 프로그램 가능 논리 장치를 포함할 수 있고, 프로세서에 의하여 실행될 수 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는 프로 그램 모듈의 형태로 컴퓨터로 판독 가능한 저장 매체(예: 메모리)에 저장된 명령어로 구현될 수 있다. 상 기 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 프로세서가 상기 명령어에 해당하는 기능을 수 행할 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(예: 자기테이프), 광기록 매체(예: CD-ROM, DVD, 자기-광 매체 (예: 플롭티컬 디스크), 내장 메모리 등을 포함할 수 있다. 명령어 는 컴파일러에 의해 만들어지는 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 다양한 실시예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부가 생략 되거나, 또는 다른 구성요소를 더 포함할 수 있다. 다양한 실시예에 따른, 모듈, 프로그램 모듈 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다 른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 개시의 범위를 한정하는 것은 아니다. 따라서, 본 개시의 범위는, 본 개시의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0085004", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른 전자 장치 및 네트워크의 블록도를 도시한다. 도 2는 다양한 실시예들에 따른, 전자 장치(예: 도 1의 전자 장치)가 동작하는 방법을 설명하기 위한 흐름 도이다. 도 3a 및 3b는 다양한 실시예들에 따른, 전자 장치가 생성하는 부분 방전 비율 테이블의 실시예를 나타내 는 도면이다. 도 4는 다양한 실시예들에 따른, 전자 장치가 선택한 임계전압 범위의 실시예를 나타내는 도면이다."}
