{"patent_id": "10-2022-0088072", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0128943", "출원번호": "10-2022-0088072", "발명의 명칭": "적대적 생성 신경망으로 구성된 상품 이미지 복원 및 합성 모델, 및 상품 이미지 복원 및 합", "출원인": "오드컨셉 주식회사", "발명자": "정재원"}}
{"patent_id": "10-2022-0088072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "상품 이미지 복원 모델을 이용하여 패션 상품과 관련된 원본 이미지에 기초하여 패션 상품과 관련된 복원 이미지를 생성하도록 구성된 상품 이미지 복원 장치가 상품 이미지 복원 모델을 학습시키는 방법에 있어서, 패션 상품과 관련된 원본 이미지를 획득하고, 상기 패션 상품과 관련된 엣지 이미지를 획득하는 단계; 상기 엣지 이미지로부터 제1 피처를 추출하고, 상기 원본 이미지로부터 제2 피처를 추출하는 단계; 상기 제1 피처와 상기 제2 피처에 기초하여 패션 상품과 관련된 복원 이미지를 생성하기 위한 대상 피처를 획득하는 단계;생성자를 통하여, 상기 대상 피처로부터 패션 상품과 관련된 페이크 이미지를 생성하는 단계; 및상기 원본 이미지와 상기 페이크 이미지에 기초하여 상기 상품 이미지 복원 모델을 학습시키는 단계;를 포함하는, 상품 이미지 복원 모델의 학습 방법."}
{"patent_id": "10-2022-0088072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 상품 이미지 복원 모델을 학습시키는 단계는, 추출자를 통하여, 상기 페이크 이미지로부터 제1 피처 정보를 획득하고 상기 원본 이미지로부터 제2 피처 정보를 획득하는 단계; 미리 결정된 러닝 밸런스 조건을 획득하는 단계; 상기 제1 피처 정보 및 상기 제2 피처 정보에 기초하여, 상기 러닝 밸런스 조건에 따라, 상기 페이크 이미지를상기 원본 이미지에 근사하도록 상기 생성자를 학습시키는 단계; 및상기 러닝 밸런스 조건에 따라, 상기 페이크 이미지를 가짜라고 판단하고 상기 원본 이미지는 진짜라고 판단하도록 판별자를 학습시키는 단계;를 더 포함하는,상품 이미지 복원 모델의 학습 방법."}
{"patent_id": "10-2022-0088072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 러닝 밸런스 조건은, 상기 생성자의 학습 횟수와 관련된 제1 값과 상기 판별자의 학습 횟수와 관련된 제2값을 포함하며, 상기 생성자는, 상기 러닝 밸런스 조건의 상기 제1 값에 기초하여 학습되되, 상기 판별자는, 상기 러닝 밸런스 조건의 상기 제2 값에 기초하여 학습되도록 구성되되,상기 제1 값과 상기 제2 값은 상이한, 상품 이미지 복원 모델의 학습 방법.공개특허 10-2023-0128943-3-청구항 4 제2 항에 있어서,상기 러닝 밸런스 조건은 제1 학습 시간 구간에서의 상기 생성자의 학습 횟수와 관련된 제3 값과 상기 판별자의학습 횟수와 관련된 제4 값, 및 상기 제1 학습 시간 구간 이후의 시간 구간인 제2 학습 시간 구간에서의 상기생성자의 학습 횟수와 관련된 제5 값과 상기 판별자의 학습 횟수와 관련된 제6 값을 포함하되,상기 제3 값은 상기 제4 값보다 더 큰 값으로 미리 설정되고, 상기 제5 값과 상기 제6 값은 동일한 값으로 미리 설정되는, 상품 이미지 복원 모델의 학습 방법."}
{"patent_id": "10-2022-0088072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 러닝 밸런스 조건은, 상기 제2 학습 시간 구간 이후의 시간 구간인 제3 학습 시간 구간에서의 상기 생성자의 학습 횟수와 관련된 제7 값과 상기 판별자의 학습 횟수와 관련된 제8 값을 포함하되, 상기 제7 값은 상기 제8 값보다 같거나 작은 값으로 미리 설정되는, 상품 이미지 복원 모델의 학습 방법."}
{"patent_id": "10-2022-0088072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "컴퓨터에 제1 항 내지 제5 항 중 어느 한 항에 따른 방법을 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을수 있는 기록 매체."}
{"patent_id": "10-2022-0088072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "패션 상품과 관련된 이미지를 획득하고, 이미지를 복원하는 상품 이미지 복원 모델을 학습시키는 상품 이미지복원 장치에 있어서,패션 상품과 관련된 엣지 이미지로부터 제1 피처를 추출하고, 패션 상품과 관련된 원본 이미지로부터 제2 피처를 추출하는 콘볼루션 신경망을 포함하는 피처 추출부; 및 상기 제1 피처와 상기 제2 피처에 기초하여 패션 상품과 관련된 복원 이미지를 생성하기 위한 대상 피처를 획득하고, 상기 대상 피처로부터 패션 상품과 관련된 페이크 이미지를 생성하는 생성자(Generator)를 포함하되, 상기 생성자는 원본 이미지와 상기 페이크 이미지에 기초하여 학습되도록 구성되는, 상품 이미지 복원 모델을 학습시키는 상품 이미지 복원 장치."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법은, 패션 상품과 관련된 원본 이미지로부터, 패 션 상품과 관련된 엣지 이미지 및 패션 상품과 관련된 마스킹 이미지를 획득하는 단계-상기 마스킹 이미지는 상 기 원본 이미지의 관심 영역이 마스킹된 이미지임-; 상기 엣지 이미지로부터 제1 피처를 추출하고, 상기 마스킹 이미지로부터 제2 피처를 추출하는 단계; 상기 추출된 제1 피처와 상기 추출된 제2 피처에 기초하여 병합 피처 (Concatenate feature)를 생성하는 단계; 상기 병합 피처를 변환하여 패션 상품과 관련된 복원 이미지를 생성하 기 위한 대상 피처를 획득하는 단계; 생성자를 통하여, 상기 대상 피처로부터 패션 상품과 관련된 페이크 이미지 를 생성하는 단계; 및 상기 원본 이미지와 상기 페이크 이미지에 기초하여 상기 상품 이미지 복원 모델을 학습시 키는 단계;를 포함할 수 있다."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 상품 이미지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법에 관한 것이다. 구체적으로 본 출원 은 적대적 생성 신경망으로 구성된 상품 이미지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법에 관한 것이다. 또한 본 출원은 상품 이미지 합성 모델, 및 상품 이미지 합성 모델의 학습 방법에 관한 것이다. 구체적으로 본 출원은 적대적 생성 신경망으로 구성된 상품 이미지 합성 모델, 및 상품 이미지 합성 모델의 학습 방법에 관한 것이다."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 기술이 발전하면서 다양한 산업 분야에서 인공지능 기술들이 활용되고 있다. 특히, 이커머스 분야에서 는 인공지능 기법을 이용하여 사용자가 선호하는 상품이나 상품에 대응되는 이미지 검색하거나 추천해주는 기술 들이 활발하게 연구되고 있다. 종래의 경쟁적 학습에 따른 이미지 복원 모델(혹은 이미지 합성 모델, 이하 이미지 복원 모델로 지칭)은 제1 패 션 상품과 관련된 원본 이미지로부터 생성자를 통하여 마스크 부분과 이미지 부분을 각각 획득하고, 추가적인 연산(예컨대, Self-Attention Mask Operation(SAM))을 통하여 마스크 부분과 이미지 부분을 별도로 합침으로써 이미지를 복원하도록 훈련되었다. 또한, 종래의 경쟁적 학습에 따르면, 복원 이미지를 생성하는 생성자를 훈련 시키는 것에 추가적으로 제1 패션 상품과 관련된 마스킹 이미지와 제2 패션 상품과 관련된 엣지 이미지에 기초 하여 제1 패션 상품의 속성과 제2 패션 상품의 속성이 모두 반영된 상품 이미지를 합성하는 모델을 훈련시켜왔 다. 다만 종래의 이미지 복원 모델에 따르면, 복원된 이미지 또는 합성된 이미지에 마스크 부분이 잔존한다는 문제와, 복원 이미지를 생성하는 생성자가 일정 수준까지 훈련이 된 이후에 합성 이미지를 생성하는 생성자 또 는 판별자가 훈련되어야 하며 추가적인 연산이 필요하다는 점에서 이미지 복원 모델의 학습에 필요한 시간과 리 소스가 상대적으로 많이 소요된다는 제약이 존재하였다. 이에, 패션 상품과 관련된 복원 이미지를 생성하는 새로운 상품 이미지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법의 개발이 요구된다."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 일 과제는, 마스크 영역이 잔존하지 않는 복원 이미지 및/또는 합성 이미지를 생성 하는 상품 이미지 복원 방법, 상품 이미지 복원 장치, 상품 이미지 합성 방법, 상품 이미지 합성 장치를 제공하 는 것이다. 본 발명이 해결하고자 하는 일 과제는, 마스크 부분이 잔존하지 않는 복원 이미지를 생성하면서도 학습에 필요 한 시간과 리소스를 낮추기 위한 상품 이미지 복원 모델 및 이를 이용한 상품 이미지 복원 방법, 및 상품 이미 지 복원 장치를 제공하는 것이다. 본 발명이 해결하고자 하는 일 과제는, 제1 상품과 관련된 마스크 이미지와 제2 상품과 관련된 엣지 이미지로부 터, 마스크 부분이 잔존하지 않는 합성 이미지를 생성하면서도 학습에 필요한 시간과 리소스를 낮추기 위한 상 품 이미지 합성 모델 및 이를 이용한 상품 이미지 합성 방법, 및 상품 이미지 합성 장치를 제공하는 것이다. 본 발명이 해결하고자 하는 과제가 상술한 과제로 제한되는 것은 아니며, 언급되지 아니한 과제들은 본 명세서"}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "및 첨부된 도면으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법은, 패션 상품과 관련된 원본 이미지로부터, 패 션 상품과 관련된 엣지 이미지 및 패션 상품과 관련된 마스킹 이미지를 획득하는 단계-상기 마스킹 이미지는 상 기 원본 이미지의 관심 영역이 마스킹된 이미지임-; 상기 엣지 이미지로부터 제1 피처를 추출하고, 상기 마스킹 이미지로부터 제2 피처를 추출하는 단계; 상기 추출된 제1 피처와 상기 추출된 제2 피처에 기초하여 병합 피처 (Concatenate feature)를 생성하는 단계; 상기 병합 피처를 변환하여 패션 상품과 관련된 복원 이미지를 생성하 기 위한 대상 피처를 획득하는 단계; 생성자를 통하여, 상기 대상 피처로부터 패션 상품과 관련된 페이크 이미 지를 생성하는 단계; 및 상기 원본 이미지와 상기 페이크 이미지에 기초하여 상기 상품 이미지 복원 모델을 학 습시키는 단계;를 포함할 수 있다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델은, 패션 상품과 관련된 엣지 이미지로부터 제1 피처를 추출 하는 제1 콘볼루션 신경망, 및 패션 상품과 관련된 마스킹 이미지로부터 제2 피처를 추출하는 제2 콘볼루션 신 경망을 포함하는 피처 추출부; 및 상기 제1 피처와 상기 제2 피처에 기초하여 생성된 병합 피처를 변환하여 패 션 상품과 관련된 복원 이미지를 생성하기 위한 대상 피처를 생성하는 맵핑 네트워크(Mapping Network); 및 상 기 대상 피처로부터 패션 상품과 관련된 페이크 이미지를 생성하는 생성자(Generator)를 포함하되, 상기 생성자 는 원본 이미지와 상기 페이크 이미지에 기초하여 학습되도록 구성될 수 있다."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "본 발명의 과제의 해결 수단이 상술한 해결 수단들로 제한되는 것은 아니며, 언급되지 아니한 해결 수단들은 본"}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "명세서 및 첨부된 도면으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 일 실시예에 따른 상품 이미지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법에 의하면, 제1 패 션 상품과 관련된 마스킹 이미지와 엣지 이미지, 및 제2 패션 상품과 관련된 엣지 이미지로 구성된 학습 세트를 이용하여 상품 이미지 복원 모델을 훈련시킴으로써, 상품 이미지 복원 모델의 학습에 필요한 파라미터를 줄여, 학습에 필요한 시간과 리소스를 절약할 수 있다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법에 의하면, 학습 시 간 구간별로 미리 설정된 러닝 밸런스 조건에 따라 생성자와 판별자를 훈련시킴으로써, 생성자와 판별자의 학습 균형을 최적으로 맞추면서 동시에 학습을 수행함으로써, 학습에 필요한 시간과 리소스를 절약할 수 있다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법에 의하면, 복원 이 미지에 마스크 경계선이 없는 자연스러운 복원 이미지를 생성할 수 있다는 유리한 효과를 제공할 수 있다."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과가 상술한 효과들로 제한되는 것은 아니며, 언급되지 아니한 효과들은 본 명세서 및 첨부된 도면"}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 출원의 상술한 목적, 특징들 및 장점은 첨부된 도면과 관련된 다음의 상세한 설명을 통해 보다 분명해질 것 이다. 다만, 본 출원은 다양한 변경을 가할 수 있고 여러 가지 실시예들을 가질 수 있는 바, 이하에서는 특정 실시예들을 도면에 예시하고 이를 상세히 설명하고자 한다. 명세서 전체에 걸쳐서 동일한 참조번호들은 원칙적으로 동일한 구성요소들을 나타낸다. 또한, 각 실시예의 도면 에 나타나는 동일한 사상의 범위 내의 기능이 동일한 구성요소는 동일한 참조부호를 사용하여 설명하며, 이에 대한 중복되는 설명은 생략하기로 한다. 본 출원과 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 출원의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 본 명세서의 설명 과정에서 이용되는 숫자(예를 들어, 제1, 제2 등)는 하나의 구성요소를 다른 구성요소와 구분하기 위한 식별기호에 불과하다. 또한, 이하의 실시예에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되 어 부여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 이하의 실시예에서, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 이하의 실시예에서, 포함하다 또는 가지다 등의 용어는 명세서상에 기재된 특징, 또는 구성요소가 존재함을 의 미하는 것이고, 하나 이상의 다른 특징들 또는 구성요소가 부가될 가능성을 미리 배제하는 것은 아니다. 도면에서는 설명의 편의를 위하여 구성 요소들이 그 크기가 과장 또는 축소될 수 있다. 예컨대, 도면에서 나타 난 각 구성의 크기 및 두께는 설명의 편의를 위해 임의로 나타낸 것으로, 본 발명이 반드시 도시된 바에 한정되 지 않는다. 어떤 실시예가 달리 구현 가능한 경우에 특정한 프로세스의 순서는 설명되는 순서와 다르게 수행될 수도 있다. 예를 들어, 연속하여 설명되는 두 프로세스가 실질적으로 동시에 수행될 수도 있고, 설명되는 순서와 반대의 순 서로 진행될 수 있다. 이하의 실시예에서, 구성 요소 등이 연결되었다고 할 때, 구성 요소들이 직접적으로 연결된 경우뿐만 아니라 구 성요소들 중간에 구성 요소들이 개재되어 간접적으로 연결된 경우도 포함한다. 예컨대, 본 명세서에서 구성 요소 등이 전기적으로 연결되었다고 할 때, 구성 요소 등이 직접 전기적으로 연결 된 경우뿐만 아니라, 그 중간에 구성 요소 등이 개재되어 간접적으로 전기적 연결된 경우도 포함한다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법은, 패션 상품과 관련된 원본 이미지로부터, 패 션 상품과 관련된 엣지 이미지 및 패션 상품과 관련된 마스킹 이미지를 획득하는 단계-상기 마스킹 이미지는 상 기 원본 이미지의 관심 영역이 마스킹된 이미지임-; 상기 엣지 이미지로부터 제1 피처를 추출하고, 상기 마스킹 이미지로부터 제2 피처를 추출하는 단계; 상기 추출된 제1 피처와 상기 추출된 제2 피처에 기초하여 병합 피처 (Concatenate feature)를 생성하는 단계; 상기 병합 피처를 변환하여 패션 상품과 관련된 복원 이미지를 생성하 기 위한 대상 피처를 획득하는 단계; 생성자를 통하여, 상기 대상 피처로부터 패션 상품과 관련된 페이크 이미 지를 생성하는 단계; 및 상기 원본 이미지와 상기 페이크 이미지에 기초하여 상기 상품 이미지 복원 모델을 학 습시키는 단계;를 포함할 수 있다. 본 출원의 일 실시예에 따르면, 상기 상품 이미지 복원 모델을 학습시키는 단계는, 추출자를 통하여, 상기 페이 크 이미지로부터 제1 피처 정보를 획득하고 상기 원본 이미지로부터 제2 피처 정보를 획득하는 단계; 미리 결정 된 러닝 밸런스 조건을 획득하는 단계; 상기 제1 피처 정보 및 상기 제2 피처 정보에 기초하여, 상기 러닝 밸런 스 조건에 따라, 상기 페이크 이미지를 상기 원본 이미지에 근사하도록 상기 생성자를 학습시키는 단계; 및 상 기 러닝 밸런스 조건에 따라, 상기 페이크 이미지를 가짜라고 판단하고 상기 원본 이미지는 진짜라고 판단하도 록 판별자를 학습시키는 단계;를 더 포함할 수 있다. 본 출원의 일 실시예에 따르면, 상기 러닝 밸런스 조건은, 상기 생성자의 학습 횟수와 관련된 제1 값과 상기 판 별자의 학습 횟수와 관련된 제2 값을 포함하며, 상기 생성자는, 상기 러닝 밸런스 조건의 상기 제1 값에 기초하 여 학습되되, 상기 판별자는, 상기 러닝 밸런스 조건의 상기 제2 값에 기초하여 학습되도록 구성되되, 상기 제1 값과 상기 제2 값은 상이할 수 있다. 본 출원의 일 실시예에 따르면, 상기 러닝 밸런스 조건은 제1 학습 시간 구간에서의 상기 생성자의 학습 횟수와 관련된 제3 값과 상기 판별자의 학습 횟수와 관련된 제4 값, 및 상기 제1 학습 시간 구간 이후의 시간 구간인 제2 학습 시간 구간에서의 상기 생성자의 학습 횟수와 관련된 제5 값과 상기 판별자의 학습 횟수와 관련된 제6 값을 포함하되, 상기 제3 값은 상기 제4 값보다 더 큰 값으로 미리 설정되고, 상기 제5 값과 상기 제6 값은 동 일한 값으로 미리 설정될 수 있다. 본 출원의 일 실시예에 따르면, 상기 러닝 밸런스 조건은, 상기 제2 학습 시간 구간 이후의 시간 구간인 제3 학 습 시간 구간에서의 상기 생성자의 학습 횟수와 관련된 제7 값과 상기 판별자의 학습 횟수와 관련된 제8 값을 포함하되, 상기 제7 값은 상기 제8 값보다 같거나 작은 값으로 미리 설정될 수 있다. 본 출원의 일 실시예에 따르면, 상기 상품 이미지 복원 모델의 학습 방법을 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체가 제공될 수 있다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델은, 패션 상품과 관련된 엣지 이미지로부터 제1 피처를 추출 하는 제1 콘볼루션 신경망, 및 패션 상품과 관련된 마스킹 이미지로부터 제2 피처를 추출하는 제2 콘볼루션 신경망을 포함하는 피처 추출부; 및 상기 제1 피처와 상기 제2 피처에 기초하여 생성된 병합 피처를 변환하여 패 션 상품과 관련된 복원 이미지를 생성하기 위한 대상 피처를 생성하는 맵핑 네트워크(Mapping Network); 및 상 기 대상 피처로부터 패션 상품과 관련된 페이크 이미지를 생성하는 생성자(Generator)를 포함하되, 상기 생성자 는 원본 이미지와 상기 페이크 이미지에 기초하여 학습되도록 구성될 수 있다. 이하에서는 도 1 내지 도 7을 참고하여 본 출원의 실시예들에 따른 상품 이미지 복원 모델, 상품 이미지 복원 모델의 학습 방법, 및 상품 이미지 복원 장치(혹은 상품 이미지 복원 서버, 이하 상품 이미지 복원 장치로 지칭)에 관하여 설명한다. 또한 본 출원의 실시예들에 따른 상품 이미지 합성 모델, 상품 이미지 합성 모델의 학습 방법, 및 상품 이미지 합성 장치(혹은 상품 이미지 합성 서버)에 관하여 설명한다. 이하에서는 상품 이미 지 복원 모델, 상품 이미지 복원 모델의 학습 방법, 및 상품 이미지 복원 장치 각각은 상품 이미지 합성 모델, 상품 이미지 합성 모델의 학습 방법, 및 상품 이미지 합성 장치를 지칭하는 용어로 사용한다. 다만 이는 설명의 편의를 위한 것일 뿐 이에 제한적으로 해석되어서는 안 된다."}
{"patent_id": "10-2022-0088072", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 2, "content": "도 1은 본 출원의 일 실시예에 따른 상품 이미지 복원 장치에 관한 개략도이다. 본 출원의 일 실시예에 따른 상품 이미지 복원 장치는 패션 상품과 관련된 원본 이미지로부터 획득된 엣 지 이미지(edge image) 및/또는 마스킹 이미지(masking image)를 포함하는 학습 세트에 기초하여 상품 이미지 복원 모델을 훈련시킬 수 있다. 또한, 상품 이미지 복원 장치는 훈련이 완료된 상품 이미지 복원 모 델을 이용하여 패션 상품과 관련된 대상 엣지 이미지 및/또는 대상 마스킹 이미지들로부터, 복원 이미지를 획득하는 동작을 수행하도록 구성될 수 있다. 또한 본 출원의 일 실시예에 따른 상품 이미지 복원 장치는 제1 패션 상품과 관련된 엣지 이미지와 제2 패션 상품과 관련된 마스킹 이미지를 포함하는 학습 세트에 기초하여 상품 이미지를 합성하는 상품 이미지 복원 모델을 훈련시킬 수 있다. 또한, 상품 이미지 복원 장치는 훈련이 완료된 상품 이미지 복원 모델 을 이용하여 제1 상품과 관련된 대상 엣지 이미지와 제2 상품과 관련된 대상 마스킹 이미지로부터 생성된 합성 이미지를 획득하는 동작을 수행하도록 구성될 수 있다. 본 출원의 일 실시예에 따른 상품 이미지 복원 장치는 송수신부, 메모리, 및 프로세서 를 포함할 수 있다. 송수신부는 사용자 단말을 포함한 임의의 외부 기기와 통신을 수행할 수 있다. 예컨대, 상품 이미지 복원 장치는, 송수신부를 통해, 패션 상품과 관련된 복수의 원본 이미지, 원본 이미지로부터 획득된 엣 지 이미지, 및/또는 마스킹 이미지를 포함하는 학습 세트를 획득할 수 있다. 다른 예를 들면, 상품 이미지 복원 장치는, 송수신부를 통해, 복원하기 위한 패션 상품과 관련된 대상 엣지 이미지, 및/또는 마스킹 이미지를 획득할 수 있다. 또한, 상품 이미지 복원 장치는, 송수신부를 통해, 상품 이미지 복원 모델을 실행시키기 위한 임의의 실행 데이터를 획득할 수 있다. 여기서 실행 데이터는 상품 이미지 복원 모델의 구조 정보, 계층 정보, 연산 라이브러리, 및 상품 이미지 복원 모델에 포함된 가중치와 관련된 파라미터 세트를 포함하여 상품 이미지 복원 모델을 실행시키기 위한 임의의 적절한 데이터를 포괄하는 의미일 수 있다. 또한, 상품 이미지 복원 장치는, 송수신부를 통하여, 상품 이미지 복원 모델을 통하여 획득한 복원 이미지 를 사용자 단말을 포함한 임의의 외부 기기로 송신하거나 출력할 수 있다. 상품 이미지 복원 장치는, 송수신부를 통해 네트워크에 접속하여 각종 데이터를 송수신할 수 있다. 송수신부는 크게 유선 타입과 무선 타입을 포함할 수 있다. 유선 타입과 무선 타입은 각각의 장단점을 가 지므로, 경우에 따라서 상품 이미지 복원 장치에는 유선 타입과 무선 타입이 동시에 마련될 수도 있다. 여기서, 무선 타입의 경우에는 주로 와이파이(Wi-Fi) 같은 WLAN(Wireless Local Area Network) 계열의 통신 방 식을 이용할 수 있다. 또는, 무선 타입의 경우에는 셀룰러 통신, 예컨대, LTE, 5G 계열의 통신 방식을 이용할 수 있다. 다만, 무선 통신 프로토콜이 상술한 예시에 제한되는 것은 아니며, 임의의 적절한 무선 타입의 통신 방식을 이용하는 것도 가능하다. 유선 타입의 경우에는 LAN(Local Area Network)이나 USB(Universal Serial Bus) 통신이 대표적인 예이며 그 외의 다른 방식도 가능하다. 메모리는 각종 정보를 저장할 수 있다. 메모리에는 각종 데이터가 임시적으로 또는 반영구적으로 저장될 수 있다. 메모리의 예로는 하드 디스크(HDD: Hard Disk Drive), SSD(Solid State Drive), 플래쉬 메모리(flash memory), 롬(ROM: Read-Only Memory), 램(RAM: Random Access Memory) 등이 있을 수 있다. 메모 리는 상품 이미지 복원 장치에 내장되는 형태나 탈부착 가능한 형태로 제공될 수 있다. 메모리 에는 상품 이미지 복원 장치를 구동하기 위한 운용 프로그램(OS: Operating System)이나 상품 이미 지 복원 장치의 각 구성을 동작시키기 위한 프로그램을 비롯해 상품 이미지 복원 장치의 동작에 필 요한 각종 데이터가 저장될 수 있다. 프로세서는 상품 이미지 복원 장치의 전반적인 동작을 제어할 수 있다. 예컨대, 프로세서는 후술할 상품 이미지 복원 모델을 학습시키는 동작 및/또는 훈련이 완료된 상품 이미지 복원 모델을 이용하여 복원 이미지를 획득하는 동작 등을 포함하여 상품 이미지 복원 장치의 전반적인 동작을 제어할 수 있다. 구체적으로 프로세서는 메모리로부터 상품 이미지 복원 장치의 전반적인 동작을 위 한 프로그램을 로딩하여 실행할 수 있다. 프로세서는 하드웨어나 소프트웨어 또는 이들의 조합에 따라 AP(Application Processor), CPU(Central Processing Unit)나 이와 유사한 장치로 구현될 수 있다. 이때, 하드 웨어적으로는 전기적 신호를 처리하여 제어 기능을 수행하는 전자 회로 형태로 제공될 수 있으며, 소프트웨어적 으로는 하드웨어적 회로를 구동시키는 프로그램이나 코드 형태로 제공될 수 있다. 이하에서는 도 2를 참고하여, 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 구조와 상품 이미지 복원 모델의 학습 방법에 대하여 구체적으로 서술한다. 도 2는 본 출원의 일 실시예에 따른 상품 이미지 복원 모델을 도시한 개략도이다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델은 제1 콘볼루션 신경망 및 제2 콘볼루션 신경망 을 포함하는 피처 추출부, 피처 추출부로부터 추출된 피처들에 기초하여 생성된 병합 피처를 대 상 피처로 변환하는 맵핑 네트워크; 및 대상 피처에 기초하여 페이크 이미지를 생성자;를 포함할 수 있다. 피처 추출부는 적어도 하나 이상의 콘볼루션 신경망(예컨대, 제1 콘볼루션 신경망, 및 제2 콘볼루션 신경망)을 포함할 수 있다. 피처 추출부는 패션 상품과 관련된 엣지 이미지 또는 마스킹 이미지를 획 득하고, 엣지 이미지 또는 마스킹 이미지 각각으로부터 패션 상품의 재질, 스타일, 크기, 비율, 모양 및/또는 색상 등을 포함한 패션 상품의 속성과 관련된 피처를 추출할 수 있다. 일 예로, 제1 콘볼루션 신경망은 패션 상품과 관련된 원본 이미지로부터 획득된 엣지 이미지를 수신하고, 엣지 이미지로부터 패션 상품(혹은 이미지)의 속성과 관련된 제1 피처를 추출할 수 있다. 여기서 엣지 이미지란, 이미지 내에서 특정 픽셀의 밝기가 주변 픽셀의 밝기 대비 급격히 변하는 픽셀들의 집합으로 구성된 이미지를 포괄하는 의미일 수 있다. 다른 예로, 제2 콘볼루션 신경망은 패션 상품과 관련된 원본 이미지로 부터 획득된 마스킹 이미지를 수신하고, 마스킹 이미지로부터 패션 상품(혹은 이미지)의 속성과 관련된 제2 피 처를 추출할 수 있다. 이때 마스킹 이미지란, 임의의 방식에 따라 이미지에 포함된 관심 영역이 마스킹된 이미 지를 포괄하는 의미일 수 있다. 한편, 관심 영역은 이미지에 포함된 영역 중에서 랜덤하게 선택된 영역일 수 있 다. 구체적으로 상품 이미지 복원 장치는 원본 이미지에 포함된 영역 중에서 랜덤하게 선택된 관심 영역 을 획득하고, 관심 영역을 임의의 형태(예컨대, 사각형, 붓, 원 형태 등)로 마스킹하여 마스킹 이미지를 획득하 도록 구현될 수 있다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델은 랜덤하게 선택된 관심 영역이 마스킹된 마스킹 이미지에 기초하여 훈련될 수 있으며, 이를 통하여 원본 이미지에 포함된 상품의 특정 영역(예 컨대, 칼라(collar), 소매(sleeve))의 속성뿐 만 아니라, 원본 이미지의 일반적인 속성을 반영하여 복원 이미지 (혹은 합성 이미지)를 생성하도록 학습될 수 있다. 일 예로, 마스킹 이미지와 엣지 이미지는 공통 패션 상품과 관련된 원본 이미지로부터 획득될 수 있다. 예컨대, 마스킹 이미지는 공통 패션 상품과 관련된 원본 이미지의 특정 영역이 마스킹된 이미지일 수 있으며, 엣지 이미 지는 공통 패션 상품과 관련된 원본 이미지의 엣지 영역이 추출된 이미지일 수 있다. 이때, 공통 패션 상품과 관련된 원본 이미지로부터 획득된 마스킹 이미지와 엣지 이미지로 구성된 학습 세트로 훈련된 상품 이미지 복원 모델은 대상 마스킹 이미지와 대상 엣지 이미지에 기초하여 원본 이미지를 복원하도록 구성될 수 있다. 다른 예로, 마스킹 이미지와 엣지 이미지는 각각 별개의 상품과 관련된 원본 이미지로부터 획득될 수 있다. 예 컨대, 마스킹 이미지는 제1 패션 상품과 관련된 제1 원본 이미지의 특정 영역이 마스킹된 이미지일 수 있으며, 엣지 이미지는 제2 패션 상품과 관련된 제2 원본 이미지의 엣지 영역이 추출된 이미지일 수 있다. 이때, 제1 원 본 이미지로부터 획득된 마스킹 이미지와 제2 원본 이미지로부터 획득된 엣지 이미지로 구성된 학습 세트로 훈 련된 상품 이미지 복원 모델은 제1 상품과 관련된 대상 마스킹 이미지와 제2 상품과 관련된 대상 엣지 이미지로부터 제1 상품의 속성과 제2 상품의 속성이 모두 반영된 합성 이미지를 생성할 수 있다. 상품 이미지 복원 모델은 추출된 제1 피처 및 제2 피처를 획득하고, 제1 피처와 제2 피처를 병합하여 병합 피처(Concatenate feature)를 생성하도록 구성될 수 있다. 일 예로, 상품 이미지 복원 모델은 제1 피처 및 제2 피처 각각에 노멀라이제이션(normalization)을 수행한 후 병합하여 병합 피처를 생성하도록 구성될 수 있다. 다른 예로, 상품 이미지 복원 모델은 제1 피처 및 제2 피처 각각에 노멀라이제이션을 수행한 후 병합하여 중간 피처를 생성하고, 중간 피처에 노멀라이제이션을 수행하여 병합 피처를 생성하도록 구성될 수 있다. 여기서 노멀라이제이션이란 임의의 벡터를 유닛화하는 임의의 기법과 관련된 데이터 처리 기법을 지칭하며, 상 품 이미지 복원 모델은 L1 노멀라이제이션 및/또는 L2 노멀라이제이션을 통하여 피처 추출부로부터 획득한 복수의 피처들 또는 중간 피처를 정규화할 수 있다. 또한 본 출원의 일 실시예에 따른 상품 이미지 복원 모델은 병합 피처를 변환하여, 패션 상품과 관련된 복 원 이미지를 생성하기 위한 대상 피처를 획득할 수 있다. 예컨대, 상품 이미지 복원 모델은 맵핑 네트워크 를 포함할 수 있으며, 상품 이미지 복원 모델은 맵핑 네트워크를 통하여 병합 피처를 변환하여 복원 이미지를 생성하기 위한 대상 피처를 획득할 수 있다. 맵핑 네트워크는 피처 공간의 특정 바운더리 내에 대상 피처가 생성되도록 하는 효과를 제공할 수 있다. 본 출원의 일 실시예에 따른 맵핑 네트워크는 콘볼루션 뉴럴 네트워크(Convolutional Neural Networks(CNN)) 또는 완전 연결 계층(Fully connected(Dense) layer)로 구성된 다중 퍼셉트론(Multi-Layer Perceptron, MLP) 신경망일 수 있다. 다만 필요에 따라, 본 출원의 일 실시예에 따른 상품 이미지 복원 모델 은 맵핑 네트워크를 포함하지 않을 수 있다. 이때, 상품 이미지 복원 모델은 전술한 병합 피처를 직 접 후술할 생성자(Generator, 130)에 입력하도록 구성될 수 있다. 생성자는 대상 피처를 획득하고, 대상 피처에 기초하여 패션 상품과 관련된 페이크 이미지를 생성할 수 있 다. 이때, 상품 이미지 복원 모델(혹은 상품 이미지 복원 장치)은 패션 상품과 관련된 원본 이미지를 획 득하고, 원본 이미지와 페이크 이미지에 기초하여, 원본 이미지에 근사된 페이크 이미지를 생성하도록 생성자 를 학습시킬 수 있다. 예컨대, 상품 이미지 복원 모델은 원본 이미지와 페이크 이미지의 차이의 절대 값과 관련된 L1 로스를 생성자에 부여하여 생성자를 학습시킬 수 있다. 다른 예를 들면, 상품 이미지 복원 모델은 원본 이미지와 페이크 이미지를 비교하여 유클리디안 거리와 관련된 L2 로스를 획득하고, L2 로스를 생성자에 부여하여 생성자를 학습시킬 수 있다. 이하에서는 도 3을 참고하여 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법에 대하여 구 체적으로 서술하기로 한다. 도 3(a)은 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 이미지 복원 과 관련된 학습 방법의 일 양상을 도시한 개략도이다. 도 3(b)은 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 이미지 복원과 관련된 학습 방법의 일 양상을 도시한 개략도이다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델은 판별자를 더 포함할 수 있다. 일 예로, 도 3(a)를 참고하면, 판별자는 원본 이미지와 생성자로부터 생성된 페이크 이미지를 획득하 고, 원본 이미지와 페이크 이미지를 비교하여 페이크 이미지의 진위를 판별하는 동작을 수행할 수 있다. 이때, 생성자와 판별자는 적대적 생성 신경망(Generative Adversarial Network, GAN)을 구성하여 경쟁적 방식으로 학습될 수 있다. 구체적으로 판별자는 페이크 이미지를 가짜라고 판단하고, 원본 이미지는 진짜 라고 판단하도록 학습되며, 생성자는 판별자의 판단 결과에 기초하여, 판별자가 페이크 이미지 를 진짜라고 판단하도록 페이크 이미지를 원본 이미지에 근사하여 출력하도록 학습될 수 있다. 예컨대, 판별자 는 원본 이미지 및 페이크 이미지 각각에 대하여 진위와 관련된 지표(예컨대, 진짜일 확률값 혹은 임의의 형태의 점수)를 연산할 수 있으며, 생성자는, 판별자가 페이크 이미지의 진위 지표를 원본 이미지의 진위 지표(혹은 목표하는 진위 지표)에 근사하여 연산하도록, 페이크 이미지를 출력하도록 학습될 수 있다. 다른 예로, 전술한 바와 같이, 제1 패션 상품과 관련된 엣지 이미지와 제2 패션 상품과 관련된 마스킹 이미지를 포함하는 학습 세트에 기초하여 상품 이미지를 합성하는 실시예에서는 합성 이미지에 대응되는 원본 이미지가 존재하지 않을 수 있다. 따라서 본 실시예의 경우(도 3(b)의 경우)에는, 생성자는, 판별자가 생성된 합성 이미지(도 3(b)의 페이크 이미지)를 진짜라고 판단하도록, 페이크 이미지를 생성하도록 학습될 수 있다. 또한, 판별자는 제1 패션 상품과 관련된 엣지 이미지와 제2 패션 상품과 관련된 마스킹 이미지로부터 기초 하여 생성자가 생성한 페이크 이미지를 가짜라고 판단하도록 학습될 수 있다. 한편, 생성자와 판별자의 학습 진행 단계에 따른 학습 횟수(즉 학습 밸런스)는 적절한 값으로 미리 설정될 수 있다. 예컨대, 초기 학습 시간 구간에서는 생성자의 학습 횟수가 판별자보다 학습 횟수보 다 상대적으로 크도록 설정될 수 있다. 다른 예로, 중기 학습 시간 구간에서는 생성자의 학습 횟수와 판별 자의 학습 횟수의 차이가 미리 설정된 임계값보다 작도록(혹은 실질적으로 동일하도록) 구성될 수 있다. 또 다른 예로, 후기 학습 시간 구간에서는 판별자의 학습 횟수가 생성자의 학습 횟수보다 같거나 크 도록 설정될 수 있다. 다만, 이는 예시에 불과하며, 생성자의 학습 횟수와 판별자의 학습 횟수가 임 의의 적절한 값으로 미리 설정될 수 있다. 생성자의 학습 횟수와 판별자의 학습 횟수에 대하여는 도 7과 관련하여 보다 자세하게 서술하기로 한다. 도 4는 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법의 일 양상을 도시한 개략도이다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델은 페이크 이미지 및/또는 원본 이미지로부터 엣지 정 보를 추출하는 엣지 추출기(152, Edge extractor), 및 페이크 이미지 및/또는 원본 이미지로부터 피처 정보를 추출하는 피처 추출기(154, Feature extractor)를 포함하는 추출자를 더 포함할 수 있다. 구체적으로 추출자는 엣지 추출기를 통하여 페이크 이미지로부터 제1 엣지 정보를 추출할 수 있다. 또는 추출자는 엣지 추출기를 통하여 원본 이미지로부터 제2 엣지 정보를 추출할 수 있다. 이때, 생 성자는 페이크 이미지와 관련된 제1 엣지 정보와 원본 이미지와 관련된 제2 엣지 정보에 기초하여 학습될 수 있다. 구체적으로 생성자는, 페이크 이미지와 관련된 제1 엣지 정보와 원본 이미지와 관련된 제2 엣지 정보의 차이에 기초하여, 제1 엣지 정보와 제2 엣지 정보 간의 차이를 감소시키도록, 페이크 이미지를 생성하도 록 학습될 수 있다. 또한, 추출자는 피처 추출기를 통하여 페이크 이미지로부터 제1 피처 정보를 추출할 수 있다. 또는 추출자는 피처 추출기를 통하여 원본 이미지로부터 제2 피처 정보를 추출할 수 있다. 이때, 생성자 는 페이크 이미지와 관련된 제1 피처 정보와 원본 이미지와 관련된 제2 피처 정보에 기초하여 학습될 수 있다. 구체적으로 생성자는, 페이크 이미지와 관련된 제1 피처 정보와 원본 이미지와 관련된 제2 피처 정 보의 차이에 기초하여 제1 피처 정보와 제2 피처 정보 간의 차이를 감소시키도록, 페이크 이미지를 생성하도록 학습시킬 수 있다. 보다 구체적으로 상품 이미지 복원 모델(혹은 상품 이미지 복원 장치)은 제1 피처 정보와 제2 피처 정보의 차이(또는 제1 엣지 정보와 제2 엣지 정보의 차이)의 절대값과 관련된 L1 로스를 생성자에 부여하 여 생성자를 학습시킬 수 있다. 또는 상품 이미지 복원 모델(혹은 상품 이미지 복원 장치)은 제1 피처 정보와 제2 피처 정보 간(또는 제1 엣지 정보와 제2 엣지 정보 간)의 유클리디안 거리와 관련된 L2 로 스를 생성자에 부여하여 생성자를 학습시킬 수 있다. 이하에서는 도 5 내지 도 7을 참고하여 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법을 설명한다. 도 5는 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법을 도시한 순서도이다. 상품 이미 지 복원 모델의 학습 방법을 설명함에 있어서, 앞서 도 2 내지 도 4에서 서술한 설명과 중복되는 일부 실 시예는 생략될 수 있다. 다만, 이는 설명의 편의를 위한 것일 뿐이며, 제한적으로 해석되어서는 아니된다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법은 패션 상품과 관련된 원본 이미지로부터, 패선 상품과 관련된 엣지 이미지 및 패션 상품과 관련된 마스킹 이미지를 획득하는 단계(S1100), 엣지 이미지로부터 제1 피처를 추출하고, 마스킹 이미지로부터 제2 피처를 추출하는 단계(S1200), 제1 피처와 제2 피처에 기초하여 병합 피처를 생성하는 단계(S1300), 병합 피처를 병합하여 패션 상품과 관련된 복원 이미 지를 생성하기 위한 대상 피처를 획득하는 단계(S1400), 생성자를 통하여 대상 피처로부터 패션 상품과 관련된페이크 이미지를 생성하는 단계(S1500), 및 원본 이미지와 페이크 이미지에 기초하여 상품 이미지 복원 모델을 학습시키는 단계(S1600)를 포함할 수 있다. 패션 상품과 관련된 원본 이미지로부터, 패선 상품과 관련된 엣지 이미지 및 패션 상품과 관련된 마스킹 이미지 를 획득하는 단계(S1100)에서는, 상품 이미지 복원 장치는 패션 상품과 관련된 원본 이미지로부터 엣지 (edge)를 추출한 이미지인 엣지 이미지를 획득할 수 있다. 또한, 상품 이미지 복원 장치는 패션 상품과 관련된 원본 이미지의 관심 영역(Region of Interest, RoI)을 마스킹한 이미지인 마스킹 이미지를 획득할 수 있 다. 엣지 이미지로부터 제1 피처를 추출하고, 마스킹 이미지로부터 제2 피처를 추출하는 단계(S1200)에서는, 상품 이미지 복원 장치는 제1 컨볼루션 신경망을 통하여 엣지 이미지로부터 제1 피처를 획득하고, 제2 컨 볼루션 신경망을 통하여 마스킹 이미지로부터 제2 피처를 획득할 수 있다. 여기서, 제1 피처 및 제2 피처 는 패션 상품의 재질, 스타일, 크기, 비율, 모양, 및/또는 색상 등을 포함한 패션 상품의 속성과 관련된 피처일 수 있다. 구체적으로 제1 컨볼루션 신경망은 엣지 이미지를 획득하고, 엣지 이미지로부터 추출된 제1 피처 를 출력하도록 구성될 수 있다. 또한 제2 컨볼루션 신경망은 마스킹 이미지를 획득하고, 마스킹 이미지로 부터 추출된 제2 피처를 출력하도록 구성될 수 있다. 이때, 상품 이미지 복원 장치는 제1 컨볼루션 신경 망을 통하여 출력되는 제1 피처 및/또는 제2 컨볼루션 신경망을 통하여 출력되는 제2 피처를 획득할 수 있다. 제1 피처와 제2 피처에 기초하여 병합 피처를 생성하는 단계(S1300)에서는, 상품 이미지 복원 장치는 제1 피처 및 제2 피처를 병합하여 병합 피처(Concatenate feature)를 생성할 수 있다. 일 예로, 상품 이미지 복원 모델은 제1 피처 및 제2 피처 각각에 노멀라이제이션(normalization)을 수행한 후 병합하여 병합 피처를 생성하도록 구성될 수 있다. 다른 예로, 상품 이미지 복원 모델은 제1 피처 및 제2 피처 각각에 노멀라이 제이션을 수행한 후 병합하여 중간 피처를 생성하고, 중간 피처에 노멀라이제이션을 수행하여 병합 피처를 생성 하도록 구성될 수 있다. 여기서 노멀라이제이션이란 임의의 벡터를 유닛화하는 임의의 기법과 관련된 데이터 처 리 기법을 지칭하며, 상품 이미지 복원 모델은 L1 노멀라이제이션 및/또는 L2 노멀라이제이션을 통하여 피 처 추출부로부터 획득한 복수의 피처들 또는 중간 피처를 정규화할 수 있다. 병합 피처를 병합하여 패션 상품과 관련된 복원 이미지를 생성하기 위한 대상 피처를 획득하는 단계(S1400)에서 는, 상품 이미지 복원 장치는 병합 피처를 병합하여 패션 상품과 관련된 복원 이미지를 생성하기 위한 대 상 피처를 획득할 수 있다. 예컨대, 상품 이미지 복원 모델은 맵핑 네트워크를 포함할 수 있으며, 상 품 이미지 복원 모델은 맵핑 네트워크를 통하여 병합 피처를 변환하여 복원 이미지를 생성하기 위한 대상 피처를 획득할 수 있다. 맵핑 네트워크는 피처 공간의 특정 바운더리 내에 대상 피처가 생성되도록 하는 효과를 제공할 수 있다. 다만 필요에 따라, 본 출원의 일 실시예에 따른 상품 이미지 복원 모델은 맵 핑 네트워크를 포함하지 않을 수 있다. 이때, 상품 이미지 복원 모델은 병합 피처를 후술할 생성자 (Generator)에 직접 입력하도록 구성될 수도 있다. 생성자를 통하여 대상 피처로부터 패션 상품과 관련된 페이크 이미지를 생성하는 단계(S1500)에서는, 상품 이미 지 복원 장치는, 생성자를 통하여, 대상 피처로부터 패션 상품과 관련된 페이크 이미지를 획득할 수 있다. 구체적으로 상품 이미지 복원 장치는, 생성자에 대상 피처를 입력하고, 대상 피처에 기초하여 원본 이미지를 예측한 이미지인 페이크 이미지를 생성하도록 구성된 생성자를 통하여, 출력되는 페이크 이 미지를 획득할 수 있다. 원본 이미지와 페이크 이미지에 기초하여 상품 이미지 복원 모델을 학습시키는 단계(S1600)에서는, 상품 이미지 복원 장치는 패션 상품과 관련된 원본 이미지를 획득하고, 원본 이미지와 페이크 이미지에 기초하여 원본 이미지에 근사된 페이크 이미지를 생성하도록 생성자를 학습시킬 수 있다. 예컨대, 상품 이미지 복원 모델 은 원본 이미지와 페이크 이미지를 비교하고, 비교 결과에 기초하여 원본 이미지와 페이크 이미지의 차이 와 관련된 손실 함수(예컨대, L1 손실함수 및/또는 L2 손실함수 등)를 획득하고, 해당 손실 함수를 생성자(13 0)에 부여하여 생성자를 학습시킬 수 있다. 도 6은 본 출원의 일 실시예에 따른 상품 이미지 복원 모델을 학습시키는 단계를 구체화한 순서도이다. 본 실시 예에 따르면, 상품 이미지 복원 모델은 생성자 및 판별자를 포함할 수 있으며, 생성자와 판별자는 적대적 생성 신경망(GAN)을 구성하여 경쟁적 방식으로 훈련될 수 있다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델을 학습시키는 단계(S1600)는, 추출자를 통하여, 페이크 이미지로부터 제1 피처 정보를 획득하고 원본 이미지로부터 제2 피처 정보를 획득하는 단계(S1610), 미 리 결정된 러닝 밸런스 조건을 획득하는 단계(S1620), 제1 피처 정보 및 제2 피처 정보에 기초하여 러닝 밸런스 조건에 따라 페이크 이미지를 원본 이미지에 근사하도록 생성자를 학습시키는 단계(S1630), 및 러닝 밸런 스 조건에 따라 페이크 이미지를 가짜라고 판단하고 원본 이미지는 진짜라고 판단하도록 판별자를 학습시 키는 단계(S1640)를 더 포함할 수 있다. 추출자를 통하여, 페이크 이미지로부터 제1 피처 정보를 획득하고 원본 이미지로부터 제2 피처 정보를 획 득하는 단계(S1610)에서는, 상품 이미지 복원 장치는 상품 이미지 복원 모델의 추출자를 통하 여, 페이크 이미지로부터 제1 피처 정보를 획득하고, 원본 이미지로부터 제2 피처 정보를 획득할 수 있다. 구체 적으로 추출자는 페이크 이미지 및/또는 원본 이미지를 포함한 임의의 이미지를 획득하고, 임의의 이미지 에 포함된 피처 정보를 추출하도록 구성될 수 있다. 이때, 상품 이미지 복원 장치는 추출자를 통하 여 출력되는, 페이크 이미지로부터 추출된 제1 피처 정보와 원본 이미지로부터 추출된 제2 피처 정보를 획득할 수 있다. 이때 상품 이미지 복원 장치는 추출자를 통하여 추출된 제1 피처 정보와 제2 피처 정보를 생성자에 입력하도록 구성될 수 있다. 미리 결정된 러닝 밸런스 조건을 획득하는 단계(S1620)에서는, 상품 이미지 복원 장치는 미리 설정된 러 닝 밸런스 조건을 획득할 수 있다. 이때, 러닝 밸런스 조건은 상품 이미지 복원 모델의 학습 진행 단계에 따른 생성자의 학습 횟수와 판별자의 학습 횟수에 대한 정보를 포함할 수 있다. 도 7은 본 출원의 일 실시예에 따른 러닝 밸런스 조건의 양상들을 도시한 도면이다. 일 예로, 러닝 밸런스 조건은 생성자의 학습 횟수와 관련된 제1 값(예, 도 7(a)의 a1)과 판별자의 학 습 횟수와 관련된 제2 값(예, 도 7(a)의 b1)을 포함할 수 있다. 이때, 제1 값과 제2 값은 상이할 수 있다. 구체 적으로 생성자와 판별자는 동시에 학습될 수 있는데, 생성자는 제1 값(a1)에 따른 학습 횟수로 학습되되, 판별자는 제2 값(b1)에 따른 학습 횟수로 학습되도록 구성될 수 있다. 다른 예로, 러닝 밸런스 조건은 제1 학습 시간 구간(예컨대, 초기 학습 시간 구간)에서의 생성자의 학습 횟수와 관련된 제3 값(예, 도 7(b)의 a2)과 판별자의 학습 횟수와 관련된 제4 값(예, 도 7(b)의 b2), 및/ 또는 제2 학습 시간 구간(예컨대, 중기 학습 시간 구간 및/또는 후기 학습 시간 구간)에서의 생성자의 학 습 횟수와 관련된 제5 값(예, 도 7(b)의 a3)과 판별자의 학습 횟수와 관련된 제6 값(예, 도 7(b)의 b3)을 포함할 수 있다. 예컨대, 제3 값(a2)과 제4 값(b2)은 상이할 수 있다. 예컨대, 제3 값(a2)은 제4 값(b2)보다 더 큰 값일 수 있다. 구체적으로 제1 학습 시간 구간에서는, 생성자는 제3 값(a2)에 따른 학습 횟수로 학습되 되, 판별자는 제4 값(b2)에 따른 학습 횟수로 학습되도록 구성될 수 있다. 한편, 제5 값(a3)과 제6 값(b 3)의 차이는 미리 정해진 임계값 이내일 수 있다. 즉 제5 값(a3)과 제6 값(b3)은 실질적으로 동일할 수 있다. 일 예에 따르면, 초기 학습 단계에서는 판별자에 비하여 훈련이 어려운 생성자를 상대적으로 많은 횟 수로 학습을 진행하고 중기 학습 단계(혹은 후기 학습 단계)에서는 생성자와 판별자를 동일한 비중으 로 학습을 진행하여, 생성자와 판별자 간의 학습 밸런스를 최적으로 맞춤으로써 효율적으로 훈련을 수행할 수 있다. 또 다른 예로, 러닝 밸런스 조건은 제1 학습 시간 구간(예컨대, 초기 학습 시간 구간)에서의 생성자의 학 습 횟수와 관련된 제7 값(예, 도 7(c)의 a4)과 판별자의 학습 횟수와 관련된 제8 값(예, 도 7(c)의 b4), 제2 학습 시간 구간(예컨대, 중간 학습 시간 구간)에서의 생성자의 학습 횟수와 관련된 제9 값(예, 도 7(c)의 a5)과 판별자의 학습 횟수와 관련된 제10 값(예, 도 7(c)의 b5), 및/또는 제3 학습 시간 구간(예컨 대, 후기 학습 시간 구간)에서의 생성자의 학습 횟수와 관련된 제11 값(예, 도 7(c)의 a6)과 판별자 의 학습 횟수와 관련된 제12 값(예, 도 7(c)의 b6)을 포함할 수 있다. 예컨대, 제7 값(a4)과 제8 값(b4)은 상이 할 수 있다. 이때, 제7 값(a4)은 제8 값(b4)보다 더 큰 값일 수 있다. 예컨대, 제9 값(a5)과 제10 값(b5)은 동 일할 수 있다. 예컨대, 제11 값(a6)은 제12 값(b6)보다 같거나 작을 수 있다. 일 예에 따르면, 초기 학습 단계 에서는 판별자에 비하여 훈련이 어려운 생성자를 상대적으로 많은 횟수로 학습을 진행하고 후기 학습 단계에서는 판별자를 생성자에 비하여 상대적으로 큰 비중으로 학습을 진행하여, 생성자와 판별 자 간의 학습 밸런스를 최적으로 맞춤으로써 효율적으로 훈련을 수행할 수 있다. 다만 상술한 학습 시간 구간 별 학습 횟수는 예시에 불과하며, 학습 시간 구간 별로 생성자와 판별자(14 0)의 학습 횟수가 임의의 적절한 학습 횟수로 설정되어 상품 이미지 복원 모델이 학습될 수 있을 것이다. 제1 피처 정보 및 제2 피처 정보에 기초하여 러닝 밸런스 조건에 따라 페이크 이미지를 원본 이미지에 근사하도 록 생성자를 학습시키는 단계(S1630)에서는, 상품 이미지 복원 장치는 상품 이미지 복원 장치는 추 출자를 통하여 획득한 제1 피처 정보 및 제2 피처 정보에 기초하여 원본 이미지에 근사된 페이크 이미지를 생성하도록 생성자를 훈련시킬 수 있다. 구체적으로 상품 이미지 복원 장치는, 판별자가 페이 크 이미지를 진짜라고 판단하도록, 페이크 이미지를 원본 이미지에 근사하여 출력하도록 생성자를 훈련시 킬 수 있다. 이때, 상품 이미지 복원 장치는 전술한 바와 같이, 미리 결정된 러닝 밸런스 조건에 포함된 학습 시간 구간별 학습 횟수 정보에 기초하여 생성자를 훈련시킬 수 있다. 러닝 밸런스 조건에 따라 페이크 이미지를 가짜라고 판단하고 원본 이미지는 진짜라고 판단하도록 판별자를 학 습시키는 단계(S1640)에서는, 상품 이미지 복원 장치는 페이크 이미지 및 원본 이미지에 기초하여 판별자 를 훈련시킬 수 있다. 구체적으로 판별자는 원본 이미지와 생성자로부터 생성된 페이크 이미지 를 획득하고, 원본 이미지와 페이크 이미지를 비교하여 페이크 이미지의 진위를 판별하는 동작을 수행할 수 있 다. 이때, 판별자는 페이크 이미지를 가짜라고 판단하고 원본 이미지는 진짜라고 판단하도록 훈련될 수 있 다. 이때, 상품 이미지 복원 장치는 전술한 바와 같이, 미리 결정된 러닝 밸런스 조건에 포함된 학습 시 간 구간별 학습 횟수 정보에 기초하여 판별자를 훈련시킬 수 있다. 본 출원의 일 실시예에 따른 상품 이미지 복원 장치는 훈련이 완료된 상품 이미지 복원 모델을 이용 하여, 대상 엣지 이미지 및/또는 대상 마스킹 이미지로부터 생성된 복원 이미지를 획득할 수 있다. 구체적으로 상품 이미지 복원 모델은 패션 상품과 관련된 엣지 이미지 및/또는 마스킹 이미지로부터 이미지를 복원하 도록 훈련되었기 때문에, 훈련이 완료된 상품 이미지 복원 모델은 대상 엣지 이미지 및/또는 대상 마스킹 이미지로부터 복원 이미지를 생성할 수 있다. 이때, 상품 이미지 복원 장치는 상품 이미지 복원 모델 을 통하여 생성된 복원 이미지를 획득할 수 있다. 또한 본 출원의 일 실시예에 따른 상품 이미지 복원 장치는 훈련이 완료된 상품 이미지 복원 모델을 이용하여, 제1 상품과 관련된 대상 엣지 이미지 및 제2 상품과 관련된 대상 마스킹 이미지로부터 제1 상품의 속 성과 제2 상품의 속성이 반영된 합성 이미지를 획득할 수 있다. 구체적으로 상품 이미지 복원 모델은 제1 패션 상품과 관련된 엣지 이미지 및 제2 패션 마스킹 이미지로부터 제1 패션 상품의 속성과 제2 패션 상품의 속 성이 모두 반영된 이미지를 합성하도록 훈련되었기 때문에, 훈련이 완료된 상품 이미지 복원 모델은 대상 엣지 이미지 및/또는 대상 마스킹 이미지로부터 합성 이미지를 생성할 수 있다. 이때, 상품 이미지 복원 장치 는 상품 이미지 복원 모델을 통하여 생성된 합성 이미지를 획득할 수 있다. 종래 기술에 따르면, 제1 패션 상품과 관련된 마스킹 이미지 및 엣지 이미지에 기초하여 복원 이미지를 생성하 는 생성자를 1차적으로 훈련시키고, 훈련된 생성자를 이용하여 제1 패션 상품과 관련된 마스킹 이미지와 제2 패 션 상품과 관련된 엣지 이미지에 기초하여 제1 패션 상품의 속성과 제2 패션 상품의 속성이 모두 반영된 상품 이미지를 합성하기 위한 생성자 또는 판별자를 2차적으로 훈련시켜왔다. 다만 종래 기술에 따르면, 복원된 이미 지 또는 합성된 이미지에 마스크 부분이 잔존한다는 문제와, 복원 이미지를 생성하는 생성자가 일정 수준까지 훈련이 된 이후에 합성 이미지를 생성하는 생성자 또는 판별자가 훈련되어야 한다는 점에서 이미지 복원 모델의 학습에 필요한 시간과 리소스가 상대적으로 많이 소요된다는 제약이 존재하였다. 본 출원의 일 실시예에 따르면, 제1 패션 상품과 관련된 마스킹 이미지와 엣지 이미지, 및 제2 패션 상품과 관 련된 엣지 이미지로 구성된 학습 세트를 이용하여 원본 이미지를 복원하면서도 제1 패션 상품의 속성과 제2 패 션 상품의 속성이 반영된 합성 이미지를 생성하기 위한 생성자와 판별자를 훈련시킬 수 있다. 본 출원의 일 실 시예에 따른 상품 이미지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법에 의하면, 상품 이미지 복원 모델 (혹은 상품 이미지 합성 모델)의 학습에 필요한 파라미터를 줄여, 학습에 필요한 시간과 리소스를 절약할 수 있 다. 또한 본 출원의 일 실시예에 따른 상품 이미지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법에 의하면, 학 습 시간 구간별로 미리 설정된 러닝 밸런스 조건에 따라 생성자와 판별자를 훈련시킴으로써, 생성자와 판별자의 학습 균형을 최적으로 맞추어 동시에 학습을 수행함으로써, 학습에 필요한 시간과 리소스를 절약할 수 있다. 본 출원의 일 실시예에 따른 상품 이미지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법에 의하면, 생성자 가 마스크 부분과 이미지 부분이 합쳐진 상품 이미지를 생성할 수 있다. 따라서, 종래 기술과 같이 마스크 부분 과 이미지 부분을 별도로 합치는 과정이 생략될 수 있다. 이를 통하여, 본 출원의 일 실시예에 따른 상품 이미 지 복원 모델, 및 상품 이미지 복원 모델의 학습 방법에 의하면, 복원 이미지에 마스크 경계선이 잔존하는 종래 기술의 한계점을 해결하고, 복원 이미지에 마스크 경계선이 없는 자연스러운 복원 이미지를 생성할 수 있다는 유리한 효과를 제공할 수 있다. 상술한 상품 이미지 복원 장치의 다양한 동작들은 상품 이미지 복원 장치의 메모리에 저장될 수 있으며, 상품 이미지 복원 장치 의 프로세서는 메모리에 저장된 동작들을 수행하도록 제 공될 수 있다. 이상에서 실시 형태들에 설명된 특징, 구조, 효과 등은 본 발명의 적어도 하나의 실시 형태에 포함되며, 반드시 하나의 실시 형태에만 한정되는 것은 아니다. 나아가, 각 실시 형태에서 예시된 특징, 구조, 효과 등은 실시 형 태들이 속하는 분야의 통상의 지식을 가지는 자에 의해 다른 실시 형태들에 대해서도 조합 또는 변형되어 실시 가능하다. 따라서 이러한 조합과 변형에 관계된 내용들은 본 발명의 범위에 포함되는 것으로 해석되어야 할 것 이다. 또한, 이상에서 실시 형태를 중심으로 설명하였으나 이는 단지 예시일 뿐 본 발명을 한정하는 것이 아니며, 본 발명이 속하는 분야의 통상의 지식을 가진 자라면 본 실시 형태의 본질적인 특성을 벗어나지 않는 범위에서 이 상에 예시되지 않은 여러 가지의 변형과 응용이 가능함을 알 수 있을 것이다. 즉, 실시 형태에 구체적으로 나타 난 각 구성 요소는 변형하여 실시할 수 있는 것이다. 그리고 이러한 변형과 응용에 관계된 차이점들은 첨부된 청구 범위에서 규정하는 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0088072", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 출원의 일 실시예에 따른 상품 이미지 복원 장치에 관한 개략도이다. 도 2는 본 출원의 일 실시예에 따른 상품 이미지 복원 모델을 도시한 개략도이다. 도 3은 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법의 일 양상들을 도시한 개략도이다. 도 4는 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법의 일 양상을 도시한 개략도이다. 도 5는 본 출원의 일 실시예에 따른 상품 이미지 복원 모델의 학습 방법을 도시한 순서도이다. 도 6은 본 출원의 일 실시예에 따른 상품 이미지 복원 모델을 학습시키는 단계를 구체화한 순서도이다. 도 7은 본 출원의 일 실시예에 따른 러닝 밸런스 조건의 양상들을 도시한 도면이다."}
