{"patent_id": "10-2021-0041674", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0042858", "출원번호": "10-2021-0041674", "발명의 명칭": "라이브 방송룸의 사용자 커뮤니케이션 방법, 장치, 기기 및 저장 매체", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "시 난셍"}}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "라이브 방송룸의 사용자 커뮤니케이션 방법으로서,마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자중에서 타깃 슬레이브 사용자를 결정하는 단계;상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하는 초대 메시지를 발송하는 단계; 및토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자를상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이션을 진행하는 단계를 포함하는 라이브 방송룸의 사용자 커뮤니케이션 방법."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 단계는,상기 마스터 사용자에게 상기 다른 참가자의 사용자 프로필 태그 및/또는 거리 옵션을 발송하는 단계;상기 마스터 사용자가 상기 사용자 프로필 태그에서 선택한 타깃 프로필 태그 및/또는 타깃 거리를 수신하는 단계; 및상기 타깃 프로필 태그 및/또는 상기 타깃 거리, 상기 마스터 사용자의 위치 정보와 상기 다른 참가자의 위치정보에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하는 단계를 포함하는 라이브 방송룸의 사용자 커뮤니케이션 방법."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 단계는,상기 마스터 사용자의 사용자 정보를 획득하는 단계;상기 마스터 사용자의 사용자 정보와 상기 다른 참가자의 사용자 정보를 매칭하는 단계; 및매칭 결과에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하는 단계를 포함하는 라이브 방송룸의 사용자 커뮤니케이션 방법."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 단계는,라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 슬레이브 사용자 후보를 결정하는 단계; 및상기 슬레이브 사용자 후보를 상기 마스터 사용자에게 발송하고, 상기 마스터 사용자가 상기 슬레이브 사용자후보 중에서 상기 타깃 슬레이브 사용자를 결정하는 단계를 포함하는 라이브 방송룸의 사용자 커뮤니케이션 방법.공개특허 10-2021-0042858-3-청구항 5 제1항 내지 제4항 중 어느 한 항에 있어서, 상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시키는 단계 이후, 상기 방법은,상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득하는 단계를 더 포함하되,상기 공공 디스플레이 영역은 상기 토론 그룹 내 구성원과 라이브 방송룸 내 상기 구성원을 제외한 다른 참가자의 커뮤니케이션에 사용되고;상기 토론 영역은 상기 토론 그룹 내 구성원과 상기 토론 그룹에서 당해 구성원을 제외한 다른 팀원의 커뮤니케이션에 사용되는 라이브 방송룸의 사용자 커뮤니케이션 방법."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득하는 단계이후, 상기 방법은,상기 토론 그룹 내 구성원의 메시지 발송 요청에 응답하여, 상기 구성원이 상기 공공 디스플레이 영역 및 상기토론 영역으로부터 선택한 타깃 디스플레이 영역에 따라, 메시지를 상기 타깃 디스플레이 영역과 연관된 클라이언트에 발송하고, 상기 클라이언트의 타깃 디스플레이 영역에 표시하는 단계를 더 포함하되,상기 타깃 디스플레이 영역이 상기 토론 영역이면, 상기 타깃 디스플레이 영역과 연관된 클라이언트는 상기 토론 그룹 내 구성원의 클라이언트인 라이브 방송룸의 사용자 커뮤니케이션 방법."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제4항 중 어느 한 항에 있어서, 상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시키는 단계 이후, 상기 방법은,상기 라이브 방송룸과 연관된 라이브 방송이 종료되면, 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자와 상기 토론 그룹의 식별자의 연관 관계를 삭제하는 단계를 더 포함하는 라이브 방송룸의사용자 커뮤니케이션 방법."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "라이브 방송룸의 사용자 커뮤니케이션 장치로서,마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자중에서 타깃 슬레이브 사용자를 결정하도록 구성되는 사용자 결정 모듈;상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하는 초대 메시지를 발송하도록 구성되는 메시지 발송 모듈; 및토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자를상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이션을 진행하도록구성되는 토론 그룹 구성 모듈을 포함하는 라이브 방송룸의 사용자 커뮤니케이션 장치."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 사용자 결정 모듈은,상기 마스터 사용자에게 상기 다른 참가자의 사용자 프로필 태그 및/또는 거리 옵션을 발송하도록 구성되는 태공개특허 10-2021-0042858-4-그 발송 유닛;상기 마스터 사용자가 상기 사용자 프로필 태그에서 선택한 타깃 프로필 태그 및/또는 타깃 거리를 수신하도록구성되는 태그 수신 유닛; 및상기 타깃 프로필 태그 및/또는 상기 타깃 거리, 상기 마스터 사용자의 위치 정보와 상기 다른 참가자의 위치정보에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하도록 구성되는 사용자 결정 유닛을포함하는 라이브 방송룸의 사용자 커뮤니케이션 장치."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 사용자 결정 모듈은,상기 마스터 사용자의 사용자 정보를 획득하도록 구성되는 정보 획득 유닛;상기 마스터 사용자의 사용자 정보와 상기 다른 참가자의 사용자 정보를 매칭하도록 구성되는 정보 매칭 유닛;및매칭 결과에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하도록 구성되는 사용자 결정 유닛을 포함하는 라이브 방송룸의 사용자 커뮤니케이션 장치."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 사용자 결정 모듈은,라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 슬레이브 사용자 후보를 결정하도록 구성되는 슬레이브 사용자 후보 결정 유닛; 및상기 슬레이브 사용자 후보를 상기 마스터 사용자에게 발송하고, 상기 마스터 사용자가 상기 슬레이브 사용자후보 중에서 상기 타깃 슬레이브 사용자를 결정하도록 구성되는 타깃 슬레이브 사용자 결정 유닛을 포함하는 라이브 방송룸의 사용자 커뮤니케이션 장치."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항 내지 제11항 중 어느 한 항에 있어서,상기 장치는,상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시킨 후, 상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득하도록 구성되는 영역 구획 모듈을 더 포함하되,상기 공공 디스플레이 영역은 상기 토론 그룹 내 구성원과 라이브 방송룸 내 상기 구성원을 제외한 다른 참가자의 커뮤니케이션에 사용되고;상기 토론 영역은 상기 토론 그룹 내 구성원과 상기 토론 그룹에서 당해 구성원을 제외한 다른 팀원의 커뮤니케이션에 사용되는 라이브 방송룸의 사용자 커뮤니케이션 장치."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 장치는,상기 상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득한후, 상기 토론 그룹 내 구성원의 메시지 발송 요청에 응답하여, 상기 구성원이 상기 공공 디스플레이 영역 및상기 토론 영역으로부터 선택한 타깃 디스플레이 영역에 따라, 메시지를 상기 타깃 디스플레이 영역과 연관된클라이언트에 발송하고, 상기 클라이언트의 타깃 디스플레이 영역에 표시하도록 구성되는 메시지 발송 모듈을더 포함하되,공개특허 10-2021-0042858-5-상기 타깃 디스플레이 영역이 상기 토론 영역이면, 상기 타깃 디스플레이 영역과 연관된 클라이언트는 상기 토론 그룹 내 구성원의 클라이언트인 라이브 방송룸의 사용자 커뮤니케이션 장치."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항 내지 제11항 중 어느 한 항에 있어서,상기 장치는,상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시키는 단계 이후, 상기 라이브 방송룸과 연관된 라이브 방송이종료되면 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자와 상기 토론 그룹의 식별자의 연관 관계를 삭제하도록 구성되는 관계 삭제 모듈을 더 포함하는 라이브 방송룸의 사용자 커뮤니케이션장치."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하는 전자 기기로서,상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제7항 중 어느 한 항에 따른 방법을 수행할 수 있도록 하는 전자 기기."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장 매체로서,상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제7항 중 어느 한 항에 따른 방법을 수행하도록 하는 비일시적컴퓨터 판독 가능한 저장 매체."}
{"patent_id": "10-2021-0041674", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "컴퓨터 판독 가능한 저장 매체에 저장된 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램이 프로세서에 의해 실행될 경우 제1항 내지 제7항 중 어느 한 항에 따른 방법을 구현하도록 하는 컴퓨터 프로그램."}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 라이브 방송룸의 사용자 커뮤니케이션 방법, 장치, 기기 및 저장 매체를 제공하고, 데이터 처리"}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 것이고, 특히 인공 지능, 정보 흐름, 라이브 방송 기술에 관한 것이다. 구체적인"}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "라이브 방송 산업의 급속한 발전으로 인해 점점 더 많은 사용자가 라이브 방송을 애용하고 있다. 사용자는 라이 브 방송룸에서 라이브 방송 콘텐츠를 시청하는 동시에 라이브 방송룸의 방송 진행자와 소통할 수 있고, 소통 방 식은 일반적으로 방송 진행자에게 댓글 또는 자막 댓글을 보내는 것이다. 이러한 소통 방식은 단조롭고 사용자 간의 인터랙션을 저하시킨다."}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 라이브 방송룸의 사용자 커뮤니케이션 방법, 장치, 기기 및 저장 매체를 제공한다."}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "은, 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참 가자 중에서 타깃 슬레이브 사용자를 결정하고; 상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하는 초대 메시지를 발송하며; 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬 레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이션 을 진행한다. 본 발명에 따른 기술은 라이브 방송룸 내 사용자의 인터랙션을 향상시킨다. 대 표 도 - 도1"}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "공개특허10-2021-0042858 CPC특허분류 H04L 65/403 (2013.01) H04N 21/2187 (2013.01)명 세 서 청구범위 청구항 1 라이브 방송룸의 사용자 커뮤니케이션 방법으로서, 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 단계; 상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하는 초대 메시지를 발송하는 단계; 및 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식 별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이션을 진행하는 단 계를 포함하는 라이브 방송룸의 사용자 커뮤니케이션 방법. 청구항 2 제1항에 있어서, 상기 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 단 계는, 상기 마스터 사용자에게 상기 다른 참가자의 사용자 프로필 태그 및/또는 거리 옵션을 발송하는 단계; 상기 마스터 사용자가 상기 사용자 프로필 태그에서 선택한 타깃 프로필 태그 및/또는 타깃 거리를 수신하는 단 계; 및 상기 타깃 프로필 태그 및/또는 상기 타깃 거리, 상기 마스터 사용자의 위치 정보와 상기 다른 참가자의 위치 정보에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하는 단계를 포함하는 라이브 방송룸 의 사용자 커뮤니케이션 방법. 청구항 3 제1항에 있어서, 상기 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 단 계는, 상기 마스터 사용자의 사용자 정보를 획득하는 단계; 상기 마스터 사용자의 사용자 정보와 상기 다른 참가자의 사용자 정보를 매칭하는 단계; 및 매칭 결과에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하는 단계를 포함하는 라이브 방 송룸의 사용자 커뮤니케이션 방법. 청구항 4 제1항에 있어서, 상기 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 단 계는, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 슬레이브 사용자 후보를 결정하는 단계; 및 상기 슬레이브 사용자 후보를 상기 마스터 사용자에게 발송하고, 상기 마스터 사용자가 상기 슬레이브 사용자 후보 중에서 상기 타깃 슬레이브 사용자를 결정하는 단계를 포함하는 라이브 방송룸의 사용자 커뮤니케이션 방 법.청구항 5 제1항 내지 제4항 중 어느 한 항에 있어서, 상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용 자 식별자 및 상기 토론 그룹의 식별자를 연관시키는 단계 이후, 상기 방법은, 상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득하는 단계 를 더 포함하되, 상기 공공 디스플레이 영역은 상기 토론 그룹 내 구성원과 라이브 방송룸 내 상기 구성원을 제외한 다른 참가자 의 커뮤니케이션에 사용되고; 상기 토론 영역은 상기 토론 그룹 내 구성원과 상기 토론 그룹에서 당해 구성원을 제외한 다른 팀원의 커뮤니케 이션에 사용되는 라이브 방송룸의 사용자 커뮤니케이션 방법. 청구항 6 제5항에 있어서, 상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득하는 단계 이후, 상기 방법은, 상기 토론 그룹 내 구성원의 메시지 발송 요청에 응답하여, 상기 구성원이 상기 공공 디스플레이 영역 및 상기 토론 영역으로부터 선택한 타깃 디스플레이 영역에 따라, 메시지를 상기 타깃 디스플레이 영역과 연관된 클라이 언트에 발송하고, 상기 클라이언트의 타깃 디스플레이 영역에 표시하는 단계를 더 포함하되, 상기 타깃 디스플레이 영역이 상기 토론 영역이면, 상기 타깃 디스플레이 영역과 연관된 클라이언트는 상기 토 론 그룹 내 구성원의 클라이언트인 라이브 방송룸의 사용자 커뮤니케이션 방법. 청구항 7 제1항 내지 제4항 중 어느 한 항에 있어서, 상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용 자 식별자 및 상기 토론 그룹의 식별자를 연관시키는 단계 이후, 상기 방법은, 상기 라이브 방송룸과 연관된 라이브 방송이 종료되면, 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사 용자의 사용자 식별자와 상기 토론 그룹의 식별자의 연관 관계를 삭제하는 단계를 더 포함하는 라이브 방송룸의 사용자 커뮤니케이션 방법. 청구항 8 라이브 방송룸의 사용자 커뮤니케이션 장치로서, 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하도록 구성되는 사용자 결정 모듈; 상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하는 초대 메시지를 발송하도록 구성되는 메시지 발송 모 듈; 및 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식 별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이션을 진행하도록 구성되는 토론 그룹 구성 모듈을 포함하는 라이브 방송룸의 사용자 커뮤니케이션 장치. 청구항 9 제8항에 있어서, 상기 사용자 결정 모듈은, 상기 마스터 사용자에게 상기 다른 참가자의 사용자 프로필 태그 및/또는 거리 옵션을 발송하도록 구성되는 태그 발송 유닛; 상기 마스터 사용자가 상기 사용자 프로필 태그에서 선택한 타깃 프로필 태그 및/또는 타깃 거리를 수신하도록 구성되는 태그 수신 유닛; 및 상기 타깃 프로필 태그 및/또는 상기 타깃 거리, 상기 마스터 사용자의 위치 정보와 상기 다른 참가자의 위치 정보에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하도록 구성되는 사용자 결정 유닛을 포함하는 라이브 방송룸의 사용자 커뮤니케이션 장치. 청구항 10 제8항에 있어서, 상기 사용자 결정 모듈은, 상기 마스터 사용자의 사용자 정보를 획득하도록 구성되는 정보 획득 유닛; 상기 마스터 사용자의 사용자 정보와 상기 다른 참가자의 사용자 정보를 매칭하도록 구성되는 정보 매칭 유닛; 및 매칭 결과에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하도록 구성되는 사용자 결정 유 닛을 포함하는 라이브 방송룸의 사용자 커뮤니케이션 장치. 청구항 11 제8항에 있어서, 상기 사용자 결정 모듈은, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 슬레이브 사용자 후보를 결정하도록 구성되 는 슬레이브 사용자 후보 결정 유닛; 및 상기 슬레이브 사용자 후보를 상기 마스터 사용자에게 발송하고, 상기 마스터 사용자가 상기 슬레이브 사용자 후보 중에서 상기 타깃 슬레이브 사용자를 결정하도록 구성되는 타깃 슬레이브 사용자 결정 유닛을 포함하는 라 이브 방송룸의 사용자 커뮤니케이션 장치. 청구항 12 제8항 내지 제11항 중 어느 한 항에 있어서, 상기 장치는, 상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용 자 식별자 및 상기 토론 그룹의 식별자를 연관시킨 후, 상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하 여, 공공 디스플레이 영역과 토론 영역을 획득하도록 구성되는 영역 구획 모듈을 더 포함하되, 상기 공공 디스플레이 영역은 상기 토론 그룹 내 구성원과 라이브 방송룸 내 상기 구성원을 제외한 다른 참가자 의 커뮤니케이션에 사용되고; 상기 토론 영역은 상기 토론 그룹 내 구성원과 상기 토론 그룹에서 당해 구성원을 제외한 다른 팀원의 커뮤니케 이션에 사용되는 라이브 방송룸의 사용자 커뮤니케이션 장치. 청구항 13 제12항에 있어서, 상기 장치는, 상기 상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득한 후, 상기 토론 그룹 내 구성원의 메시지 발송 요청에 응답하여, 상기 구성원이 상기 공공 디스플레이 영역 및 상기 토론 영역으로부터 선택한 타깃 디스플레이 영역에 따라, 메시지를 상기 타깃 디스플레이 영역과 연관된 클라이언트에 발송하고, 상기 클라이언트의 타깃 디스플레이 영역에 표시하도록 구성되는 메시지 발송 모듈을 더 포함하되,상기 타깃 디스플레이 영역이 상기 토론 영역이면, 상기 타깃 디스플레이 영역과 연관된 클라이언트는 상기 토 론 그룹 내 구성원의 클라이언트인 라이브 방송룸의 사용자 커뮤니케이션 장치. 청구항 14 제8항 내지 제11항 중 어느 한 항에 있어서, 상기 장치는, 상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용 자 식별자 및 상기 토론 그룹의 식별자를 연관시키는 단계 이후, 상기 라이브 방송룸과 연관된 라이브 방송이 종료되면 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자와 상기 토론 그룹의 식 별자의 연관 관계를 삭제하도록 구성되는 관계 삭제 모듈을 더 포함하는 라이브 방송룸의 사용자 커뮤니케이션 장치. 청구항 15 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하는 전자 기기로서, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되고, 상기 명령이 상기 적어도 하 나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제7항 중 어느 한 항에 따른 방법 을 수행할 수 있도록 하는 전자 기기. 청구항 16 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장 매체로서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제7항 중 어느 한 항에 따른 방법을 수행하도록 하는 비일시적 컴퓨터 판독 가능한 저장 매체. 청구항 17 컴퓨터 판독 가능한 저장 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램이 프로세서에 의해 실행될 경우 제1항 내지 제7항 중 어느 한 항에 따른 방법을 구현하도 록 하는 컴퓨터 프로그램. 발명의 설명 기 술 분 야"}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "본 발명은 데이터 처리 기술분야에 관한 것이고, 특히 인공 지능, 정보 흐름, 라이브 방송 기술에 관한 것이며, 구체적으로 라이브 방송룸의 사용자 커뮤니케이션 방법, 장치, 기기 및 저장 매체에 관한 것이다. 배 경 기 술 라이브 방송 산업의 급속한 발전으로 인해 점점 더 많은 사용자가 라이브 방송을 애용하고 있다. 사용자는 라이 브 방송룸에서 라이브 방송 콘텐츠를 시청하는 동시에 라이브 방송룸의 방송 진행자와 소통할 수 있고, 소통 방 식은 일반적으로 방송 진행자에게 댓글 또는 자막 댓글을 보내는 것이다. 이러한 소통 방식은 단조롭고 사용자 간의 인터랙션을 저하시킨다."}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "해결하려는 과제 본 발명은 라이브 방송룸의 사용자 커뮤니케이션 방법, 장치, 기기 및 저장 매체를 제공한다."}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 5, "content": "과제의 해결 수단본 발명의 일 양태에 따르면, 라이브 방송룸의 사용자 커뮤니케이션 방법을 제공하고, 상기 방법은, 마스터 사 용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 단계; 상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하는 초대 메시 지를 발송하는 단계; 및 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레 이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤 니케이션을 진행하는 단계를 포함한다. 본 발명의 다른 양태에 따르면, 라이브 방송룸의 사용자 커뮤니케이션 장치를 제공하고, 상기 장치는, 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 사용자 결정 모듈; 상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하 는 초대 메시지를 발송하는 메시지 발송 모듈; 및 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사 용자 및 가입을 확인한 타깃 슬레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이션을 진행하는 토론 그룹 구성 모듈을 포함한다. 본 발명의 또 다른 양태에 따르면, 적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하는 전자 기기를 제공하고, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명 령이 저장되고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서는 본 발명의 실시예 중 어느 하나에 따른 방법을 수행할 수 있다. 본 발명의 또 다른 양태에 따르면, 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능한 저장 매체를 제공하고, 상기 컴퓨터 명령은 상기 컴퓨터가 본 발명의 실시예 중 어느 하나에 따른 방법을 수행하도록 한다. 본 발명의 또 다른 양태에 따르면, 컴퓨터 판독 가능한 저장 매체에 저장된 컴퓨터 프로그램을 제공하고, 상기 컴퓨터 프로그램이 프로세서에 의해 실행될 경우 본 발명의 실시예 중 어느 하나에 따른 방법을 구현하도록 한 다."}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 기술은 라이브 방송룸 내 사용자의 인터랙션을 향상시킨다. 본 부분에서 설명하는 내용은 본 발명의 실시예의 핵심 또는 중요한 특징을 식별하기 위한 것이 아니며, 본 발 명의 범위를 한정하지 않는다는 것을 이해해야 한다. 본 발명의 다른 특징은 아래 명세서를 통해 이해하기 쉬울 것이다."}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래 도면을 참조하여 본 발명의 예시적 실시예를 설명하되, 여기에 이해를 돕기 위한 본 발명의 실시예의 다양"}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한 세부사항들이 포함되지만, 이들은 단지 예시적인 것으로 이해해야 한다. 따라서, 본 기술분야의 통상의 기술 자는 본 발명의 범위 및 정신을 벗어나지 않는 전제 하에 여기서 설명된 실시예에 대해 다양한 변형 및 수정을 진행할 수 있음을 이해해야 한다. 마찬가지로, 명확하고 간략한 설명을 위해, 아래의 설명에서 공지된 기술 및 구조에 대한 설명을 생략한다. 도 1은 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 흐름도이다. 본 발명은 라이 브 방송의 참가자를 위한 토론 그룹을 구성하여 사용자가 커뮤니케이션하는 경우에 적용된다. 전형적으로, 본 발명은 라이브 방송 과정에서 다수의 시청자를 위한 토론 그룹을 구성하여, 라이브 방송 콘텐츠에 대하여 커뮤 니케이션을 진행하는 경우에 적용된다. 상기 방법은 라이브 방송룸의 사용자 커뮤니케이션 장치에 의해 수행될 수 있고, 상기 장치는 소프트웨어 및/또는 하드웨어의 방식으로 구현될 수 있다. 도 1을 참조하면, 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법은 아래와 같은 단계를 포함한다. 단계(S110)에서, 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제 외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정한다. 여기서, 마스터 사용자는 토론 그룹 구성 요청을 보낸 라이브 방송룸 참가자를 의미한다. 라이브 방송룸 참가자는 라이브 방송에 참여한 사람을 의미한다. 구체적으로 라이브 방송룸 참가자는 방송 진행 자와 시청자를 포함한다. 라이브 방송룸 내의 임의의 참가자는 모두 토론 그룹 구성 요청을 보낼 수 있다. 일 실시예에 있어서, 라이브 방송룸 내의 시청자는 토론 그룹 구성 요청을 보낼 수 있고; 선택 가능하게, 라이 브 방송룸 내의 방송 진행자도 토론 그룹 구성 요청을 보낼 수 있다. 토론 그룹은 속성이 같고, 어떠한 방식으로 통신하는 온라인 사용자 그룹을 의미한다. 예시적으로, 상기 토론 그룹은 적어도 2명의 관심이 같은 라이브 방송룸 참가자로 구성될 수 있다. 타깃 슬레이브 사용자는 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 토론 그룹에 가입하는 사용자이다. 타깃 슬레이브 사용자는 라이브 방송의 방송 진행자일 수 있고 라이브 방송의 시청자일 수도 있다. 단계(S120)에서, 상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하는 초대 메시지를 발송한다. 단계(S130)에서, 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사 용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬 레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이 션을 진행한다. 일 실시예에 있어서, 토론 그룹을 구성하는 단계는, 토론 그룹의 식별자를 생성하고 토론 그룹에 저장 공간을 할당하며 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자의 연관 관계를 저장하는 단계를 포함한다. 본 발명의 실시예는 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸에서 마스터 사용자를 제 외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하고; 토론 그룹을 구성하고, 마스터 사용자의 사용자 식 별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 토론 그룹의 식별자를 연관시켜, 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자를 포함하는 토론 그룹을 구성하며, 나아가 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이션을 구현하고 라이브 방송룸 내 사용자의 인터랙션을 향상시킨다. 이 밖에, 타깃 슬레이브 사용자를 결정하여 타깃 슬레이브 사용자에게 토론 그룹에 가입하는 초대 메시지를 발 송함으로써 비 타깃 슬레이브 사용자를 방해하는 것을 방지한다. 저장 공간의 사용을 줄이기 위해, 라이브 방송룸과 연관된 라이브 방송이 종료되면 마스터 사용자의 사용자 식 별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 토론 그룹의 식별자의 연관 관계를 삭제한다. 도 2는 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 다른 흐름도이다. 본 해결 수단은 상기 해결 수단을 기반으로, “라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정”하는 상기 단계를 구체적으로 최적화한다. 도 2를 참조하면, 본 해결 수단이 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법은 아래와 같은 단계를 포함한다.단계(S210)에서, 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제 외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정한다. 단계(S220)에서, 상기 마스터 사용자에게 상기 다른 참가자의 사용자 프로필 태그 및/또는 거리 옵션을 발송한 다. 여기서, 사용자 프로필 태그는 사용자의 구체적인 이미지를 설명하는 태그를 의미한다. 일 실시예에 있어서, 사 용자 프로필 태그는 취향, 연령대, 성별, 직업 등일 수 있다. 예를 들어, 사용자 프로필 태그는 농구를 좋아하고 연령은 25세에서 35세 사이에 있으며 남성 등일 수 있다. 거리 옵션은 마스터 사용자와 타깃 슬레이브 사용자 사이의 최대 거리를 설명하는 옵션을 의미한다. 일 실시예에 있어서, 거리 옵션은 마스터 사용자 중에서 거리가 100m 이내, 200m 이내 등일 수 있다. 단계(S230)에서, 상기 마스터 사용자가 상기 사용자 프로필 태그에서 선택한 타깃 프로필 태그 및/또는 타깃 거 리를 수신한다. 여기서, 타깃 프로필 태그는 마스터 사용자가 선택한 사용자 프로필 태그를 의미하고, 타깃 슬레이브 사용자가 부합되는 사용자 프로필 태그로도 이해할 수 있다. 타깃 거리는 마스터 사용자가 선택한 거리 옵션을 의미하고, 타깃 슬레이브 사용자와 마스터 사용자 사이의 거 리 최대치로도 이해할 수 있다. 단계(S240)에서, 상기 타깃 프로필 태그 및/또는 상기 타깃 거리, 상기 마스터 사용자의 위치 정보와 상기 다른 참가자의 위치 정보에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정한다. 일 실시예에 있어서, 타깃 프로필 태그에 따라 상기 다른 참가자 중에서 타깃 슬레이브 사용자를 결정할 수 있 고; 타깃 거리, 마스터 사용자의 위치 정보 및 상기 다른 참가자의 위치 정보에 따라, 상기 다른 참가자 중에서 타깃 슬레이브 사용자를 결정할 수도 있으며; 타깃 프로필 태그, 및/또는, 타깃 거리, 마스터 사용자의 위치 정 보와 상기 다른 참가자의 위치 정보에 따라, 상기 다른 참가자 중에서 타깃 슬레이브 사용자를 결정할 수도 있 다. 타깃 프로필 태그에 따라, 상기 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하는 단계는, 타깃 프로필 태 그와 상기 다른 참가자의 사용자 프로필 태그를 매칭하는 단계; 및 매칭 결과에 따라, 상기 다른 참가자 중에서 타깃 슬레이브 사용자를 선별하는 단계를 포함한다. 타깃 거리, 마스터 사용자의 위치 정보 및 상기 다른 참가자의 위치 정보에 따라, 상기 다른 참가자 중에서 타 깃 슬레이브 사용자를 결정하는 단계는, 마스터 사용자의 위치 정보 및 상기 다른 참가자의 위치 정보에 따라, 마스터 사용자와 상기 다른 참가자 사이의 거리를 산출하는 단계; 산출하여 획득한 거리와 타깃 거리를 매칭하 는 단계; 및 매칭 결과에 따라, 상기 다른 참가자 중에서 타깃 슬레이브 사용자를 선별하는 단계를 포함한다. 단계(S250)에서, 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사 용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬 레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이 션을 진행한다. 본 해결 수단은 마스터 사용자에게 라이브 방송룸에서 상기 마스터 사용자를 제외한 다른 참가자의 사용자 프로 필 태그 및/또는 거리 옵션을 발송하는 것을 통해; 마스터 사용자가 선택한 타깃 프로필 태그, 및/또는, 마스터 사용자의 위치 정보, 상기 다른 참가자의 위치 정보와 마스터 사용자가 선택한 타깃 거리에 따라 상기 다른 참 가자 중에서 타깃 슬레이브 사용자를 결정함으로써, 사용자의 타깃 슬레이브 사용자에 대한 결정을 보조하고, 타깃 슬레이브 사용자의 결정 효율을 향상시키며, 상기 유익한 효과는 특히 라이브 방송룸 내 참가자의 인원수 가 비교적 많을 경우에 뚜렷하다. 도 3은 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 또 다른 흐름도이다. 본 해 결 수단은 상기 해결 수단을 기반으로, “라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정”하는 상기 단계를 구체적으로 최적화한다. 도 3을 참조하면, 본 해결 수단이 제 공하는 라이브 방송룸의 사용자 커뮤니케이션 방법은 아래와 같은 단계를 포함한다. 단계(S310)에서, 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제 외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정한다. 단계(S320)에서, 상기 마스터 사용자의 사용자 정보를 획득한다. 여기서, 상기 사용자 정보는 사용자를 설명하는 정보를 의미한다. 일 실시예에 있어서, 상기 사용자 정보는 사용자 프로필 태그일 수 있다. 단계(S330)에서, 상기 마스터 사용자의 사용자 정보와 상기 다른 참가자의 사용자 정보를 매칭한다. 단계(S340)에서, 매칭 결과에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정한다. 일 실시예에 있어서, 매칭 결과에 따라 상기 다른 참가자 중에서 마스터 사용자와 관심이 같은 타깃 슬레이브 사용자를 선별할 수 있다. 단계(S350)에서, 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사 용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬 레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이 션을 진행한다. 사용자 정보를 사용자 프로필 태그로 예를 들면, 상기 해결 수단에서 사용자 간의 인터랙션은 도 4를 참조한다. 본 해결 수단은 마스터 사용자의 사용자 정보와 라이브 방송룸에서 마스터 사용자를 제외한 다른 참가자의 사용 자 정보를 매칭하여, 마스터 사용자와 같거나 유사한 사용자 정보를 가진 타깃 슬레이브 사용자를 자동으로 선 별함으로써, 타깃 슬레이브 사용자의 결정 효율을 더 향상시킨다. 도 5는 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 흐름도이다. 본 해결 수단은 상기 해결 수단을 기반으로, “라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이 브 사용자를 결정”하는 상기 단계를 구체적으로 최적화한다. 도 5를 참조하면, 본 해결 수단이 제공하는 라이 브 방송룸의 사용자 커뮤니케이션 방법은 아래와 같은 단계를 포함한다. 단계(S410)에서, 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제 외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정한다. 단계(S420)에서, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 슬레이브 사용자 후보를 결정한다. 여기서, 슬레이브 사용자 후보는 타깃 슬레이브 사용자의 사용자를 의미할 수 있다. 단계(S430)에서, 상기 슬레이브 사용자 후보를 상기 마스터 사용자에게 발송하고, 상기 마스터 사용자가 상기 슬레이브 사용자 후보 중에서 상기 타깃 슬레이브 사용자를 결정한다. 단계(S44)에서, 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사 용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬 레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이 션을 진행한다. 본 해결 수단은 라이브 방송룸에서 마스터 사용자를 제외한 다른 참가자 중에서 슬레이브 사용자 후보를 결정하 는 것을 통해; 상기 슬레이브 사용자 후보를 상기 마스터 사용자에게 발송하고, 상기 마스터 사용자가 상기 슬 레이브 사용자 후보 중에서 상기 타깃 슬레이브 사용자를 결정하여, 타깃 슬레이브 사용자의 정확도를 향상시킨 다. 도 6은 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 흐름도이다. 본 해결 수단은 상기 해결 수단을 기반으로, 상기 해결 수단을 확장한다. 도 6을 참조하면, 본 해결 수단이 제공하는 라이브 방 송룸의 사용자 커뮤니케이션 방법은 아래와 같은 단계를 포함한다. 단계(S510)에서, 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마스터 사용자를 제 외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정한다. 단계(S520)에서, 상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하는 초대 메시지를 발송한다. 단계(S530)에서, 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사 용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인한 타깃 슬 레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이 션을 진행한다. 단계(S540)에서, 상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역 을 획득한다. 여기서, 공공 디스플레이 영역은 상기 토론 그룹 내 구성원과 라이브 방송룸 내 상기 구성원을 제외한 다른 참 가자의 커뮤니케이션에 사용된다. 토론 영역은 상기 토론 그룹 내 구성원과 상기 토론 그룹에서 당해 구성원을 제외한 다른 팀원의 커뮤니케이션 에 사용된다. 구체적으로, 본 해결 수단에서 메시지 하달 부분의 논리적 모식도는 도 8을 참조한다. 본 해결 수단은 공공 디스플레이 영역 및 토론 영역의 개수에 대해 한정하지 않는다. 선택 가능하게, 하나의 토 론 영역일 수 있고, 2개의 토론 영역일 수 있으며, 다수의 토론 영역일 수도 있다. 토론 영역의 개수는 상기 구성원이 가입한 토론 그룹의 개수에 의해 결정될 수 있고 사전 설정할 수도 있다. 예를 들어, 상기 구성원이 3개의 토론 그룹에 가입했다면, 상기 구성원의 클라이언트는 3개의 토론 영역으로 구 획된다. 선택 가능하게, 하나의 토론 영역은 다수의 토론 그룹과 연관시킬 수 있다. 상기 하나의 토론 영역을 기반으로 다른 토론 그룹의 클릭을 통해 다른 토론 그룹의 커뮤니케이션을 구현한다. 본 해결 수단은 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득 함으로써, 토론 그룹 내 구성원과 라이브 방송룸 내 상기 구성원을 제외한 다른 참가자의 커뮤니케이션을 구현 하고, 토론 그룹 내 구성원과 토론 그룹에서 구성원을 제외한 다른 팀원의 커뮤니케이션을 구현한다. 상기 해결 수단은 디스플레이 영역의 증가를 통해 메시지의 디스플레이 시간을 증가시켜 선행기술 중 하나의 디스플레이 영역으로 인해 정보 손실이 심각한 과제를 해결한다. 이 밖에, 하나의 같은 디스플레이 영역에서 토론 그룹의 내부 커뮤니케이션 정보와 라이브 방송룸의 공공 커뮤 니케이션 정보를 디스플레이하는 것에 비해, 본 해결 수단은 내부 커뮤니케이션 정보의 디스플레이 시간을 증가 시키고 사용자가 내부 커뮤니케이션 정보를 쉽게 볼 수 있도록 한다. 또한, 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득하는 단계 이후, 상기 해결 수단은, 토론 그룹 내 구성원의 메시지 발송 요청에 응답하여, 상기 구성원이 공공 디스플레이 영역 및 토론 영역으로부터 선택한 타깃 디스플레이 영역에 따라, 메시지를 타깃 디스플레이 영역과 연관된 클 라이언트에 발송하고, 상기 클라이언트의 타깃 디스플레이 영역에 표시하는 단계를 더 포함하되; 타깃 디스플레 이 영역이 토론 영역이면, 상기 타깃 디스플레이 영역과 연관된 클라이언트는 토론 그룹 내 구성원의 클라이언 트이다. 상기 기술 특징에 기반하여, 본 해결 수단은 상기 구성원이 공공 디스플레이 영역 및 토론 영역으로부터 선택한 타깃 디스플레이 영역에 따라, 메시지를 타깃 디스플레이 영역과 연관된 클라이언트에 발송하고, 상기 클라이언 트의 타깃 디스플레이 영역에 표시하여, 토론 영역 내의 내부 커뮤니케이션 정보를 토론 내 구성원만 볼 수 있 도록 함으로써, 내부 커뮤니케이션 정보의 프라이버시를 더 잘 보호한다. 본 해결 수단은 상기 해결 수단을 기반으로, 상기 해결 수단을 확장한다. 본 해결 수단이 제공하는 라이브 방송 룸의 사용자 커뮤니케이션 방법은 아래와 같은 과정을 포함한다. 1. 마스터 사용자와 슬레이브 사용자의 라이브 방송룸 입장 마스터 사용자와 슬레이브 사용자는 단말 기기를 통해 관심있는 라이브 방송룸에 입장하고, 이 단계는 클라이언 트와 서버 측의 연결 구축 과정을 포함하며 세부 사항은 아래와 같다. 본 해결 수단은 사용자의 프라이버시 문제를 고려하여, 마스터 사용자와 슬레이브 사용자의 권한을 부여받은 경 우에 마스터 사용자와 슬레이브 사용자의 현재 기기의 지리적 위치 정보를 리포트하고, 서버 측이 클라이언트의 연결 요청을 수신한 후 마스터 사용자와 슬레이브 사용자의 지리적 위치 정보를 저장하며, 위치 정보의 정확도 를 보장하기 위해 타이밍 빈도의 하트 비트를 유지한다.서버 측은 페아노 곡선 원리에 기반하여, Redis 베이스 저장 구조를 통해 2차원의 지리적 위 치 정보를 1차원의 순차적 링크로 저장하여 주변 사람들이 빠르게 획득할 수 있도록 한다. 여기서, Redis는 하나의 오픈 소스로서 ANSIC 언어로 작성하고 네트워크를 지원하며 메모리 기반으로도 지속 가 능한 로그 유형이자 Key-Value 데이터베이스이고 여러 가지 언어의 API를 제공한다. 본 해결 수단은 Redis를 통해 사용자가 지정한 지리적 위치 정보를 저장하는 것에만 한정되지 않고, “근접” 기능을 저장하고 검색할 수 있는 임의의 자체 개발 또는 오픈 소스의 메모리 시스템일 수 있다. 2. 토론 그룹의 구성 토론 그룹의 구성은 특징이 유사한 사용자 또는 맞춤화 선별 조건의 사용자가 서로의 의견에 주의를 기울이고 커뮤니케이션을 용이하게 하기 위한 것이다. 상기 과정은 아래와 같은 5개의 서비스 모듈에 관한 것이고, 구체적인 시스템 흐름도는 도 7을 참조한다. 온라인 프로필 서비스 클라이언트가 보낸 토론 그룹 구성 요청을 수신하고, 상기 클라이언트와 연관된 마스터 사용자에 부합되는 사용 자 프로필 태그 및 거리 옵션을 하달한다(예를 들어, 500m 이내, 5km 이내, 10km 이내 및 10km 초과 등). 마스터 사용자가 선별한 타깃 프로필 태그 및 타깃 거리에 따라, 라이브 방송룸 내 마스터 사용자를 제외한 다 른 참가자 중에서 적어도 하나의 슬레이브 사용자 후보를 결정한다. 여기서 슬레이브 사용자 후보의 인원수는 다양한 장면에 따라 설정할 수 있고, 본 해결 수단은 이에 대해 어떠 한 한정도 하지 않는다. 온라인 프로필 서비스 모듈은 여러 가지 전략의 선별을 지원하고, 랜덤으로 선택한 조건에 부합되는 적어도 하 나의 슬레이브 사용자 후보를 디폴트한다. 다양한 장면에 대해 전략을 미리 결정하면(예를 들어, 유사성 최적 전략, 가장 핫한 태그 전략 등), 미리 결정 된 전략에 따라 슬레이브 사용자 후보의 선별을 진행한다. 토론 그룹 관리 서비스 마스터 사용자는 슬레이브 사용자 후보 중에서 타깃 슬레이브 사용자의 결정을 수신한 후, 토론 그룹 관리 서비 스에 요청하여 토론 그룹을 구성한다. 토론 그룹 관리 서비스는 서버 측에 하나의 사용자 그룹을 구성하고, 이 때 그룹 내 구성원은 마스터 사용자만 포함하며, 라이브 방송룸식별자, 사용자 식별자, 토론 그룹 식별자의 3원 관계 매핑을 수립한다. 중앙 제어 초대 서비스 마스터 사용자가 발송한 관계 구축 메시지 요청을 수신하고, 타깃 슬레이브 사용자에게 토론 그룹에 가입하는 메시지를 발송한다. 타깃 슬레이브 사용자가 피드백한 응답 메시지를 수신하고, 응답 메시지가 가입에 동의하는 경우, 상기 타깃 슬 레이브 사용자의 사용자 식별자를 관계 관리 서비스에 발송한다. 관계 관리 서비스 타깃 슬레이브 사용자가 발송한 사용자 식별자를 수신하고, 상기 식별자와 상기 마스터 사용자의 사용자 식별자, 토론 그룹식별자 및 라이브 방송룸 식별자를 연관시켜 저장한다. 뒷정리 서비스 모듈 본 해결 수단은 라이브 방송 관계 그룹의 유효성을 고려하여, 각 라이브 방송이 종료된 후 뒷정리 서비스에 의 해 그룹 매핑 관리 데이터 및 관계 저장 데이터를 포함하는 데이터 관계 저장을 정리함으로써 저장 공간 사용률 을 줄이기 위한 목적을 달성한다. 3. 메시지 구획 하달 이미 구성된 토론 그룹에 기반하여, 토론 그룹 내 구성원은 메시지를 발송할 경우 영역을 구획하여 디스플레이 할 수 있다. 구체적인 모식도는 도 8에 도시된 바와 같다.본 해결 수단은 사용자의 개별화 선택을 고려하여, 아래와 같은 두 가지 모드의 발송 옵션을 제공한다. 옵션 1은 라이브 방송 방송 진행자가 발송한 메시지를 볼 수 있는지 여부이고; 옵션 2는 발송한 메시지가 공공 영역에 디스플레이되는지 여부이다. 하달 서비스 모듈은 사용자의 발송 메시지 요청을 수신할 경우, 사용자의 옵션에 따라 메시지 구획과 가시도 하 달을 진행하고 구체적인 논리는 아래와 같다. 논리 1에서, 하나의 같은 라이브 방송 기간에, 한 명의 사용자는 하나의 토론 그룹에만 가입할 수 있고; 사용자 가 새로운 토론 그룹 구성 요청을 보낼 경우, 관계 관리 서비스는 이전의 토론 그룹을 자동으로 탈퇴한다. 논리 2에서, 사용자가 토론 그룹에 가입했다면 메시지를 토론 영역에 발송하는 것을 디폴트한다. 논리 3에서, 공공 영역을 선택했다면 토론 그룹에 가입했는지 여부와 관계없이 메시지를 공공 영역에 발송한다. 논리 4에서, 방송 진행자가 볼 수 있는 공공 영역과 토론 영역을 디폴트하고, 방송 진행자를 차단한다면 토론 영역에만 유효하고 공공 영역에는 무효하다. 여기서 메시지의 하달은 2개의 핵심 요소를 포함한다. 메시지 프로토콜 리포트 정의: 메시지 몸체에서 타깃 디스플레이 영역을 결정하는 핵심 정보를 증가한다. 또한, 본 해결 수단은 비지니스 반복 과정 중의 다른 논리의 제정을 지원하고, 노드에 따른 방법으로 논리 리스 트에 가입하여 판단하기만 하면 된다. 메시지 하달 서비스: 상기 논리를 활용하고, 메시지 프로토콜의 해석을 통해 메시지 몸체에서 상기 핵심 정보를 추출하여 하달 판단 을 진행한다. 본 해결 수단은 라이브 방송룸 메시지의 완전 송수신과 정보 흐름 손실이 심각한 과제를 해결하였다. 태그 적용, 비공개 토론 영역 및 공공 영역의 메시지 구획 하달을 통해, 실제 라이브 방송을 시청하는 느낌을 더 시 뮬레이션하여 사용자 간의 인터랙션과 친밀감을 향상시키는 동시에 제품에 대한 사용자 참여성을 크게 항상시켜 경쟁품에 비해 보다 큰 경쟁력을 가지게 한다. 도 9는 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 장치의 구조 모식도이다. 도 9를 참 조하면, 본 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 장치는 사용자 결정 모듈, 메시 지 발송 모듈 및 토론 그룹 구성 모듈을 포함한다. 여기서, 사용자 결정 모듈은 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸 중 상기 마 스터 사용자를 제외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정한다. 메시지 발송 모듈은 상기 타깃 슬레이브 사용자에게 상기 토론 그룹에 가입하는 초대 메시지를 발송한다. 토론 그룹 구성 모듈은 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시켜, 상기 마스터 사용자 및 가입을 확인 한 타깃 슬레이브 사용자를 상기 토론 그룹의 구성원으로 하며, 상기 토론 그룹에 기반하여 그룹 내 구성원의 커뮤니케이션을 진행한다. 본 발명의 실시예는 마스터 사용자의 토론 그룹 구성 요청에 응답하여, 라이브 방송룸에서 마스터 사용자를 제 외한 다른 참가자 중에서 타깃 슬레이브 사용자를 결정하고; 토론 그룹을 구성하고, 마스터 사용자의 사용자 식 별자, 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자 및 토론 그룹의 식별자를 연관시켜, 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자를 포함하는 토론 그룹을 구성하며, 나아가 토론 그룹을 기반으로 그룹 내 구성원의 커뮤니케이션을 구현하여 라이브 방송룸 내 사용자의 인터랙션을 향상시킨다. 이 밖에, 타깃 슬레이브 사용자를 결정하여 타깃 슬레이브 사용자에게 토론 그룹에 가입하는 초대 메시지를 발 송함으로써 비 타깃 슬레이브 사용자를 방해하는 것을 방지한다. 또한, 상기 사용자 결정 모듈은, 상기 마스터 사용자에게 상기 다른 참가자의 사용자 프로필 태그 및/또는 거리 옵션을 발송하는 태그 발송 유닛; 상기 마스터 사용자가 상기 사용자 프로필 태그에서 선택한 타깃 프로필 태그및/또는 타깃 거리를 수신하는 태그 수신 유닛; 및 상기 타깃 프로필 태그 및/또는 상기 타깃 거리, 상기 마스 터 사용자의 위치 정보 및 상기 다른 참가자의 위치 정보에 따라, 상기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하는 사용자 결정 유닛을 포함한다. 또한, 상기 사용자 결정 모듈은, 상기 마스터 사용자의 사용자 정보를 획득하는 정보 획득 유닛; 상기 마스터 사용자의 사용자 정보와 상기 다른 참가자의 사용자 정보를 매칭하는 정보 매칭 유닛; 및 매칭 결과에 따라, 상 기 다른 참가자 중에서 상기 타깃 슬레이브 사용자를 결정하는 사용자 결정 유닛을 포함한다. 또한, 상기 사용자 결정 모듈은, 라이브 방송룸 중 상기 마스터 사용자를 제외한 다른 참가자 중에서 슬레이브 사용자 후보를 결정하는 슬레이브 사용자 후보 결정 유닛; 및 상기 슬레이브 사용자 후보를 상기 마스터 사용자 에게 발송하고, 상기 마스터 사용자가 상기 슬레이브 사용자 후보 중에서 상기 타깃 슬레이브 사용자를 결정하 는 타깃 슬레이브 사용자 결정 유닛을 포함한다. 또한, 상기 장치는, 상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬 레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시킨 후, 상기 토론 그룹 내 구성원의 디스 플레이 영역을 구획하여, 공공 디스플레이 영역과 토론 영역을 획득하는 영역 구획 모듈을 더 포함하되; 상기 공공 디스플레이 영역은 상기 토론 그룹 내 구성원과 라이브 방송룸 내 상기 구성원을 제외한 다른 참가자의 커 뮤니케이션에 사용되고; 상기 토론 영역은 상기 토론 그룹 내 구성원과 상기 토론 그룹에서 당해 구성원을 제외 한 다른 팀원의 커뮤니케이션에 사용된다. 또한, 상기 장치는, 상기 상기 토론 그룹 내 구성원의 디스플레이 영역을 구획하여, 공공 디스플레이 영역과 토 론 영역을 획득한 후, 상기 토론 그룹 내 구성원의 메시지 발송 요청에 응답하여, 상기 구성원이 상기 공공 디 스플레이 영역 및 상기 토론 영역으로부터 선택한 타깃 디스플레이 영역에 따라, 메시지를 상기 타깃 디스플레 이 영역과 연관된 클라이언트에 발송하고, 상기 클라이언트의 타깃 디스플레이 영역에 표시하는 메시지 발송 모 듈을 더 포함하되; 상기 타깃 디스플레이 영역이 상기 토론 영역이면, 상기 타깃 디스플레이 영역과 연관된 클 라이언트는 상기 토론 그룹 내 구성원의 클라이언트이다. 또한, 상기 장치는, 상기 토론 그룹을 구성하고, 상기 마스터 사용자의 사용자 식별자, 가입을 확인한 타깃 슬 레이브 사용자의 사용자 식별자 및 상기 토론 그룹의 식별자를 연관시킨 후, 상기 라이브 방송룸과 연관된 라이 브 방송이 종료되면 상기 마스터 사용자 및 가입을 확인한 타깃 슬레이브 사용자의 사용자 식별자와 상기 토론 그룹의 식별자의 연관 관계를 삭제하는 관계 삭제 모듈을 더 포함한다. 본 발명의 실시예에 따르면, 본 발명은 전자 기기 및 판독 가능 저장 매체를 더 제공한다. 도 10에 도시된 바와 같이, 본 발명의 실시예에 따른 라이브 방송룸의 사용자 커뮤니케이션 방법의 전자 기기의 블록도이다. 전자 기기는 랩톱 컴퓨터, 데스크톱 컴퓨터, 운영 플랫폼, 개인 정보 단말기, 서버, 블레이드 서버, 대형 컴퓨터, 및 다른 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 의미한다. 전자 기기는 개인 디지털 처리, 셀룰러폰, 스마트폰, 웨어러블 기기 및 다른 유사한 컴퓨팅 장치와 같은 다양한 형태의 이동 장치 를 의미할 수도 있다. 본문에서 나타낸 부재, 이들의 연결과 관계, 및 이들의 기능은 단지 예시적인 것으로, 본 문에서 설명 및/또는 요구된 본 발명의 구현을 한정하지 않는다. 도 10에 도시된 바와 같이, 상기 전자 기기는 하나 또는 다수의 프로세서, 메모리, 및 고속 인터페 이스 및 저속 인터페이스를 포함하는 각 부재를 연결하기 위한 인터페이스를 포함한다. 각 부재는 상이한 버스 를 이용하여 서로 연결되고, 공통 메인보드에 장착될 수 있거나 필요에 따라 다른 방식으로 장착될 수 있다. 프 로세서는, 메모리에 저장되거나 메모리에서 외부 입력/출력 장치(예를 들어, 인터페이스에 커플링된 표시 기 기)에 GUI의 그래픽 정보를 표시하는 명령을 포함하는 전자 기기 내에서 실행되는 명령을 처리할 수 있다. 다른 실시형태에서, 필요에 따라 다수의 프로세서 및/또는 다수의 버스를 다수의 메모리와 함께 사용할 수 있다. 마 찬가지로, 다수의 전자 기기를 연결할 수 있고, 각 기기는 일부 필요한 동작(예를 들어, 서버 어레이, 한 그룹 의 블레이드 서버, 또는 다중프로세서 시스템)을 제공한다. 도 10에서 하나의 프로세서를 예로 든다. 메모리는 본 발명에서 제공하는 비일시적 컴퓨터 판독 가능한 저장 매체이다. 여기서, 적어도 하나의 프 로세서가 본 발명에서 제공된 라이브 방송룸의 사용자 커뮤니케이션 방법을 수행할 수 있도록 상기 메모리에는 적어도 하나의 프로세서에 의해 실행될 수 있는 명령이 저장된다. 본 발명의 비일시적 컴퓨터 판독 가능한 저장 매체에는 컴퓨터 명령이 저장되고, 상기 컴퓨터 명령은 컴퓨터가 본 발명에서 제공되는 라이브 방송룸의 사용자 커뮤니케이션 방법을 수행하도록 한다. 메모리는 비일시적 컴퓨터 판독 가능한 저장 매체로서, 비일시적 소프트웨어 프로그램, 비일시적 컴퓨터 실행 가능한 프로그램, 및 본 발명의 실시예의 라이브 방송룸의 사용자 커뮤니케이션 방법에 대응되는 프로그램 명령/모듈(예를 들어, 도 9에 도시된 사용자 결정 모듈, 메시지 발송 모듈 및 토론 그룹 구성 모듈 ). 과 같은 모듈을 저장할 수 있다. 프로세서는 메모리에 저장된 비일시적 소프트웨어 프로그 램, 명령 및 모듈을 실행함으로써, 서버의 다양한 기능 애플리케이션 및 데이터 처리를 수행하는데, 즉 상기 방 법 실시예의 라이브 방송룸의 사용자 커뮤니케이션 방법을 구현한다. 메모리는 프로그램 저장 영역 및 데이터 저장 영역을 포함할 수 있고, 여기서, 프로그램 저장 영역은 운 영 체제, 적어도 하나의 기능에 필요한 응용 프로그램을 저장할 수 있으며; 데이터 저장 영역은 라이브 방송룸 의 사용자 커뮤니케이션 전자 기기의 사용에 따라 구축된 데이터 등을 저장할 수 있다. 이 밖에, 메모리 는 고속 랜덤 액세스 메모리를 포함할 수 있고, 적어도 하나의 자기 디스크 메모리, 플래시 메모리, 또는 다른 비일시적 고체 상태 메모리와 같은 비일시적 메모리를 더 포함할 수 있다. 일부 실시예에서, 메모리는 프 로세서에 대해 원격으로 설치된 메모리를 선택적으로 포함할 수 있고, 이러한 원격 메모리는 네트워크를 통해 비디오 검색 전자 기기에 연결될 수 있다. 상기 네트워크의 구현예로 인터넷, 인트라넷, 근거리 통신망, 이동 통신망 및 이들의 조합을 포함하지만 이에 한정되지 않는다. 라이브 방송룸의 사용자 커뮤니케이션 방법의 전자 기기는 입력 장치 및 출력 장치를 더 포함할 수 있다. 프로세서, 메모리, 입력 장치 및 출력 장치는 버스 또는 다른 방식을 통해 연결 될 수 있고, 도 10에서 버스를 통해 연결되는 것을 예로 든다. 입력 장치는 입력된 디지털 또는 캐릭터 정보를 수신할 수 있고, 라이브 방송룸의 사용자 커뮤니케이션 전자 기기의 사용자 설정 및 기능 제어와 연관된 키 신호 입력을 발생할 수 있으며, 상기 입력 장치는 예를 들 어 터치 스크린, 키패드, 마우스, 트랙 패널, 터치 패널, 지시 바, 하나 또는 다수의 마우스 버튼, 트랙 볼, 조 이스틱 등 입력 장치이다. 출력 장치는 표시 기기, 보조 조명 장치(예를 들어, LED) 및 촉각 피드백 장치 (예를 들어, 진동 모터) 등을 포함할 수 있다. 상기 표시 기기는 액정 표시 장치(LCD), 발광 다이오드(LED) 표 시 장치 및 플라스마 표시 장치를 포함할 수 있지만 이에 한정되지 않는다. 일부 실시형태에서, 표시 기기는 터 치 스크린일 수 있다. 여기서 설명된 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 전용 ASIC(전 용 집적 회로), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다양 한 실시형태는 하나 또는 다수의 컴퓨터 프로그램에서의 구현을 포함할 수 있고, 상기 하나 또는 다수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템에서 실행 및/또는 해석될 수 있으며, 상기 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가능 프로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치, 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 데이터 및 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치, 및 상기 적어도 하나의 출력 장치에 전송할 수 있다. 이러한 컴퓨팅 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션, 또는 코드라고도 함)은 프로그램 가 능 프로세서의 기계 명령을 포함하고, 하이레벨 프로세스 및/또는 객체에 대한 프로그래밍 언어, 및/또는 어셈 블리/기계 언어를 이용하여 이러한 컴퓨팅 프로그램을 실행할 수 있다. 본문에서 사용된 바와 같이, 용어 “기 계 판독 가능한 매체” 및 “컴퓨터 판독 가능한 매체”는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서 에 제공하기 위한 임의의 컴퓨터 프로그램 제품, 기기, 및/또는 장치(예를 들어, 자기 디스크, 광 디스크, 메모 리, 프로그램 가능 로직 장치(PLD))를 의미하고, 기계 판독 가능한 신호인 기계 명령을 수신하는 기계 판독 가 능한 매체를 포함한다. 용어 “기계 판독 가능한 신호”는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서 에 제공하기 위한 임의의 신호를 의미한다. 사용자와의 인터랙션을 제공하기 위하여, 컴퓨터에서 여기서 설명된 시스템 및 기술을 실시할 수 있고, 상기 컴 퓨터는 사용자에게 정보를 표시하기 위한 표시 장치(예를 들어, CRT(음극선관) 또는 LCD(액정 표시 장치) 모니 터); 및 키보드 및 지향 장치(예를 들어, 마우스 또는 트랙 볼)를 구비하며, 사용자는 상기 키보드 및 상기 지 향 장치를 통해 컴퓨터에 입력을 제공한다. 다른 타입의 장치는 또한 사용자와의 인터랙션을 제공할 수 있는데, 예를 들어, 사용자에게 제공된 피드백은 임의의 형태의 감지 피드백(예를 들어, 시각 피드백, 청각 피드백, 또 는 촉각 피드백)일 수 있고; 임의의 형태(소리 입력, 음성 입력, 또는 촉각 입력)로 사용자 중에서의 입력을 수 신할 수 있다. 여기서 설명된 시스템 및 기술을 백그라운드 부재를 포함하는 컴퓨팅 시스템(예를 들어, 데이터 서버), 또는 미 들웨어 부재를 포함하는 컴퓨팅 시스템(예를 들어, 응용 서버), 또는 프론트 엔드 부재를 포함하는 컴퓨팅 시스 템(예를 들어, 그래픽 사용자 인터페이스 또는 웹 브라우저를 구비하는 사용자 컴퓨터이고, 사용자는 상기 그래픽 사용자 인터페이스 또는 웹 브라우저를 통해 여기서 설명된 시스템 및 기술의 실시형태와 인터랙션할 수 있 음), 또는 이러한 백그라운드 부재, 미들웨어 부재, 또는 프론트 엔드 부재의 임의의 조합을 포함하는 컴퓨팅 시스템에서 실시할 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들어, 통신 네트워크)을 통해 시스템의 부재를 서로 연결시킬 수 있다. 통신 네트워크의 예시로 근거리 통신망(LAN), 광역 통신망(WAN), 인터 넷, 블록체인 네트워크를 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트 및 서버는 일반적으로 서로 멀리 떨어져 있 고 일반적으로 통신 네트워크를 통해 서로 인터랙션한다. 대응되는 컴퓨터에서 실행되고 또한 서로 클라이언트- 서버 관계를 가지는 컴퓨터 프로그램을 통해 클라이언트 및 서버의 관계를 생성한다. 서버는 클라우드 서버일 수 있고, 일명 클라우드 컴퓨팅 서버 또는 클라우드 호스트라고도 할 수 있으며, 클라우드 컴퓨팅 서비스 시스 템 중의 하나의 호스트 제품으로, 전통적인 물리적 호스트와 VPS 서비스 중 존재하는 관리 난이도가 높고 업무 확장성이 약한 결함을 해결하였다. 본 발명에 따른 기술은 라이브 방송룸 내 사용자의 인터랙션을 향상시킨다. 위에서 설명한 다양한 형태의 프로세스를 사용하여 단계를 재배열, 추가 또는 삭제할 수 있음을 이해해야 한다. 예를 들어, 본 발명에 기재된 각 단계는 동시에 수행될 수 있거나 순차적으로 수행될 수 있거나 상이한 순서로 수행될 수 있고, 본 발명에서 공개된 기술적 해결수단이 이루고자 하는 결과를 구현할 수만 있으면, 본문은 여 기서 한정하지 않는다."}
{"patent_id": "10-2021-0041674", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 구체적인 실시형태는 본 발명의 보호 범위를 한정하지 않는다. 본 기술분야의 통상의 기술자는 설계 요구 및 다른 요소에 따라 다양한 수정, 조합, 서브 조합 및 대체를 진해할 수 있음을 이해해야 한다. 본 발명의 정 신 및 원칙 내에서 진행한 임의의 수정, 등가적 대체 및 개선 등은 모두 본 발명의 보호 범위 내에 속해야 한다."}
{"patent_id": "10-2021-0041674", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 해결수단을 더 잘 이해하기 위한 것이고 본 발명을 한정하지 않는다. 도 1은 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 흐름도이다. 도 2는 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 다른 흐름도이다. 도 3은 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 또 다른 흐름도이다. 도 4는 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션의 모식도이다. 도 5는 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 또 다른 흐름도이다. 도 6은 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 방법의 흐름도이다. 도 7은 본 발명의 실시예가 제공하는 토론 그룹 구성 모식도이다. 도 8은 본 발명의 실시예가 제공하는 메시지의 구획 하달 모식도이다. 도 9는 본 발명의 실시예가 제공하는 라이브 방송룸의 사용자 커뮤니케이션 장치의 구조 모식도이다. 도 10은 본 발명의 실시예의 라이브 방송룸의 사용자 커뮤니케이션 방법에 따른 전자 기기의 블록도이다."}
