{"patent_id": "10-2018-0132270", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0050071", "출원번호": "10-2018-0132270", "발명의 명칭": "일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을", "출원인": "주식회사 씨앤유글로벌", "발명자": "하충목"}}
{"patent_id": "10-2018-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "각각 무선통신모뎀을 구비하고 물 사용량을 계측하는 수도 미터(11), 가스 사용량을 계측하는 가스 미터(12),온수 사용량을 사용하는 온수 미터(13) 및 열량 사용량을 계측하는 열량계(14) 중 하나 이상을 포함하는 각종계기;상기 각종 계기의 무선통신모뎀과의 무선통신을 위한 무선통신모뎀과 PLC 모뎀을 구비하고 전기 사용량을 계측하는 전자식 전력량계(15); 및상기 전자식 전력량계(15)의 PLC 모뎀과 전력선으로 연결되어 상기 각종 계기와 상기 전자식 전력량계(15)의 검침 데이터를 수집하는 데이터 수집장치(20)를 포함하여 구성되는, 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계."}
{"patent_id": "10-2018-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 각종 계기와 상기 전자식 전력량계(15)는, Rola, NB-IOT, Wireless_M-Bus, Wi-Sun 중 하나 이상의 무선통신방식과 PLC 유선 모뎀으로 연결되는 것을 특징으로 하는, 일체형 유무선 통신모듈을 이용한 상위 서버 또는데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계."}
{"patent_id": "10-2018-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 데이터 수집장치(20)는, PLC 모뎀과 LTE 모뎀을 구비하는 것을 특징으로 하는, 일체형 유무선 통신모듈을이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계."}
{"patent_id": "10-2018-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 데이터 수집장치(20)는 WAN(Wide Area Network) 또는 LAN(Local Area Network)으로 상위 서버에접속되어, 상기 각종 계기와 상기 전자식 전력량계(15)로부터 수집되는 검침 데이터를 상기 상위 서버에 전송하는 것을 특징으로 하는, 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계."}
{"patent_id": "10-2018-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 전자식 전력량계(15)는, 슈퍼 캡 또는 충방전 배터리 및 AC 전원의 정전상태를 감지하는 기능을 구비하여,AC 전원 정전시 상기 슈퍼 캡 또는 충방전 배터리의 DC 전원이 사전에 정해진 시간동안 공급되어 해당 전자식전력량계(15)의 정전상태를 상기 상위 서버 및 상기 데이터 수집 장치(20)에 전송하는 것을 특징으로 하는, 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전공개특허 10-2020-0050071-3-송해 주는 인공지능형 전자식 전력량계."}
{"patent_id": "10-2018-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 전자식 전력량계(15)는, AC 전원의 제로 클로싱 시점을 감지하는 센서를 구비하여, 해당 전자식 전력량계(15)에 제로 클로싱 인터럽트가 발생시 해당 정보를 상기 상위 서버 및 상기 데이터 수집 장치(20)에 전송하고,상기 상위 서버 및 상기 데이터 수집 장치(20)는 상기 전자식 전력량계와의 동기화를 통해 제로 클로싱 인터럽트 발생시 전송되는 제로 클로싱 시점과 자신이 발생한 제로 클로싱 시점을 비교하여 가장 가까운 동 시간대의상을 확인하여 해당 전자식 전력량계에 어떤 상이 연결되어 있는지 보여주거나 상기 상위 서버에 전송하는 것을특징으로 하는, 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계."}
{"patent_id": "10-2018-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 데이터 수집 장치(20)는 전력량에서 제로 클로싱 발생시 해당 정보(event)를 상기 상위 서버에 전송하는것을 특징으로 하는, 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계."}
{"patent_id": "10-2018-0132270", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 상위 서버는 전력량에서 제로 클로싱 발생시 해당 정보(event)를 상기 데이터 수집 장치(20)에 전송하는것을 특징으로 하는, 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계."}
{"patent_id": "10-2018-0132270", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계가 개시된다. 이는 각각 무선통신모뎀을 구비하고 물 사용량을 계측하는 수도 미터, 가스 사용량을 계측하는 가스 미터, 온수 사용량을 사용하는 온수 미터 및 열량 사용량 을 계측하는 열량계 중 하나 이상을 포함하는 각종 계기; 각종 계기의 무선통신모뎀과의 무선통신을 위한 무 선통신모뎀과 PLC 모뎀을 구비하고 전기 사용량을 계측하는 전자식 전력량계; 및 전자식 전력량계의 PLC 모뎀과 전력선으로 연결되어 각종 계기와 전자식 전력량계의 검침 데이터를 수집하는 데이터 수집장치를 포함하여 구성된다."}
{"patent_id": "10-2018-0132270", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계에 관한 것으로서, 더욱 상세하게는 수도, 가스, 열량, 온수, 전기 등과 같은 계기를 원격 검침하는 데이터 수집 장치(DCU) 또는 원격지의 상위 서버가 수도, 가스, 열량, 온 수, 전기 등과 같은 계기들과 전자식 전력량계를 매개로 전력선 통신과 같은 유선 통신방식과 무선(Wireless M- Bus)통신방식으로 검침 데이터를 원격 검침할 수 있는 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계에 관한 것이다."}
{"patent_id": "10-2018-0132270", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "주택 또는 아파트 등과 같은 수용가에 설치된 수도, 가스, 열량, 온수, 전기 등과 같은 5종 계기들의 검침 데 이터를 검침을 위해서 관리자가 현장을 방문하여 디스플레이 항목을 육안으로 직접 확인하거나, RS-232, RS- 485, DC-PLC 등과 같은 유선통신방식으로 검침 데이터를 검침하고 있다. 하지만, 최근에는 기술의 발달로 Zigbee, RF, Wi-Fi, CDMA, LTE 등과 같은 무선통신방식을 적용하고 있는데, 5 종 계기들은 상용전원을 사용할 수 없어 배터리로 동작해야 하므로, 소비전력이 아주 작은 통신 방식을 채택하 여 사용해야 한다. 그러므로, Rola, NB-IOT, Wireless_M-Bus, Wi-Sun 등과 같은 통신방식이 사용되고 있다. 하 지만, 한 가지 통신방식으로는 수용가에 설치되어 있는 수도, 가스, 열량, 온수, 전기 등과 같은 5종 계기를 원격에서 100% 데이터 손실없이 검침할 수 없다는 문제점이 있다. 또한, 기존의 노후화된 아파트 등과 같은 수용 가의 계기를 교체하여도 데이터 검침을 위해서 통신 인프라를 구축하기가 매우 어렵다는 문제점이 있다. 또한, 종래에는 3상 변압기 밑단에 설치되는 각종 계기들은 설치시 한쪽 부하에만 설치되는 경우 변압기의 상불 평형이 발생하여 계통에 문제가 발생하는 경우가 종종 일어나고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허 제10-1768679호(2017. 08. 17. 등록공고)"}
{"patent_id": "10-2018-0132270", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 바와 같은 종래기술의 문제점을 해결하기 위한 것으로서, 일체형 유무선 통신방식(모듈)을 이 용하여 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전 자식 전력량계를 제공하는데 그 목적이 있다."}
{"patent_id": "10-2018-0132270", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 종래기술의 문제점을 해결하기 위한 본 발명의 목적은, 각각 무선통신모뎀을 구비하고 물 사 용량을 계측하는 수도 미터, 가스 사용량을 계측하는 가스 미터, 온수 사용량을 사용하는 온수 미터 및 열량 사 용량을 계측하는 열량계 중 하나 이상을 포함하는 각종 계기; 상기 각종 계기의 무선통신모뎀과의 무선통신을 위한 무선통신모뎀과 PLC 모뎀을 구비하고 전기 사용량을 계측하는 전자식 전력량계; 및 상기 전자식 전력량계 의 PLC 모뎀과 AC 전원이 흐르는 전력선으로 연결되어 상기 각종 계기와 상기 전자식 전력량계의 검침 데이터를 수집하는 데이터 수집장치를 포함하여 구성되는, 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계에 의해 달성된다. 본 발명의 하나의 측면에 의하면, 상기 각종 계기와 상기 전자식 전력량계는, Rola, NB-IOT, Wireless_M-Bus, Wi-Sun 중 하나 이상의 무선통신방식과 PLC 모뎀으로 연결되는 것을 특징으로 한다. 본 발명의 다른 측면에 의하면, 상기 데이터 수집장치는, PLC 모뎀과 LTE 모뎀을 구비하는 것을 특징으로 한다. 본 발명의 또 다른 측면에 의하면, 상기 데이터 수집장치는 WAN(Wide Area Network) 또는 LAN(Local Area Network)으로 상위 서버에 접속되어, 상기 각종 계기와 상기 전자식 전력량계로부터 수집되는 검침 데이터를 상 기 상위 서버에 전송하는 것을 특징으로 한다. 본 발명의 또 다른 측면에 의하면, 상기 전자식 전력량계는, 슈퍼 캡 또는 충방전 배터리 및 AC 전원의 정전상 태를 감지하는 기능을 구비하여, AC 전원 정전시 상기 슈퍼 캡 또는 충방전 배터리의 DC 전원이 사전에 정해진 시간동안 공급되어 해당 전자식 전력량계의 정전상태를 상기 상위 서버 및 상기 데이터 수집 장치에 전송하는 것을 특징으로 한다. 본 발명의 또 다른 측면에 의하면, 상기 전자식 전력량계는, AC 전원의 제로 클로싱 시점을 감지하는 센서를 구 비하여, 해당 전자식 전력량계에 제로 클로싱 인터럽트가 발생시 해당 정보를 상기 상위 서버 및 상기 데이터 수집 장치에 전송하고, 상기 상위 서버 및 상기 데이터 수집 장치는 상기 전자식 전력량계와의 동기화를 통해 제로 클로싱 인터럽트 발생시 전송되는 제로 클로싱 시점과 자신이 발생한 제로 클로싱 시점을 비교하여 가장 가까운 동 시간대의 상을 확인하여 해당 전자식 전력량계에 어떤 상이 연결되어 있는지 보여주거나 상기 상위 서버에 전송하는 것을 특징으로 한다. 본 발명의 또 다른 측면에 의하면, 상기 데이터 수집 장치는 전력량에서 제로 클로싱 발생시 내부 CPU연산 알고 리즘을 통해 해당 정보(event)를 상기 상위 서버에 전송하는 것을 특징으로 한다.본 발명의 또 다른 측면에 의하면, 상기 상위 서버는 전자식 전력량에서 제로 클로싱 발생시 해당 정보(event) 를 상기 데이터 수집 장치에 전송하는 것을 특징으로 한다."}
{"patent_id": "10-2018-0132270", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 소비전력이 작은 무선통신모듈을 탑재하여 항시 가정에서 사용하고 있는 전기를 계량하는 미 터에 유무선 통신이 가능한 일체형 통신모듈을 탑재하여 게이트웨이 역할을 하는 전자식 전력량계를 개발함으로 써, 서로 간에 데이터를 손쉽게 검침한 후 데이터 수집 장치에 검침된 데이터를 전송할 수 있는 효과가 있다. 또한, 발명은 각종 계기 설치시 제로 클로싱 시점을 데이터 수집 장치와 상위 서버에 알려줌으로써, 동기화를 통해 어떤 상인지 확인할 수 있도록 하는 데 그 목적이 있다."}
{"patent_id": "10-2018-0132270", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부도면과 함께 상세히 설명하기로 한다. 도 1은 본 발명의 실시예에 의한 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계를 보인 구성도이고, 도 2는 제로 클로 싱, 즉 5.53 msec마다 R. S. T.상에서의 인터럽트를 보인 그래프이다. 도 1 및 도 2에 의하면, 본 발명의 실시예에 의한 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수 집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계는, 각각 소비전력 이 작은 무선통신모뎀(모듈)을 구비하고 수용가의 물 사용량을 계측하는 수도 미터, 수용가의 가스 사용량 을 계측하는 가스 미터, 수용가의 온수 사용량을 사용하는 온수 미터 및 수용가의 열량 사용량을 계측 하는 열량계를 포함하여 구성된 각종 계기, 각종 계기의 무선통신모뎀과의 무선통신을 위한 소비전력이 작 은 무선통신모뎀과 PLC 모뎀을 구비하고 수용가의 전기 사용량을 계측하는 전자식 전력량계; 및 전자식 전 력량계의 PLC 모뎀과 수용가에 가설된 전력선으로 연결되어 각종 계기와 전자식 전력량계에 의해 계측 되는 물, 가스, 온수, 열량 및 전기 등의 사용량, 즉 검침 데이터를 수집하는 데이터 수집 장치로 구성된다. 위의 실시예에서, 수도 미터, 가스 미터, 온수 미터 및 열량계를 포함하는 각종 계기와 전자식 전력량계는 Rola, NB-IOT, Wireless_M-Bus, Wi-Sun 등과 같은 소비전력이 작은 무선통신방식(모듈)으로 연 결됨으로써, 신규로 설치되는 수도 미터, 가스 미터, 온수 미터, 열량계 뿐만 아니라 기존에 아파트 등과 같은 수용가에 가설되어 있는 수도 미터, 가스 미터, 온수 미터, 열량계 등에도 적용할 수 있다. 위의 실시예에서, 데이터 수집장치는 유무선 통신모듈, 즉 PLC 모뎀과 LTE 모뎀을 모두 구비함으로써, 수도 미터, 가스 미터, 온수 미터 및 열량계와 무선통신을 할 수 있을 뿐더러 데이터 수집 장치(2 0)와의 전력선 통신을 할 수 있다. 위의 실시예에서, 데이터 수집 장치가 WAN(Wide Area Network) 또는 LAN(Local Area Network)에 의해 상위 서버에 통신가능하도록 접속됨으로써, 데이터 수집 장치는 수도 미터, 가스 미터, 온수 미터, 열량계 및 전자식 전력량계로부터 수집되는 각종 계기들의 검침 데이터를 상위 서버에 전송할 수 있다. 여기서, 데이터 수집 장치는 수도 미터, 가스 미터, 온수 미터, 열량계 및 전자식 전력량 계나, 상위 서버와 양방향이 통신이 가능함으로써, 각종 계기들의 검침 데이터를 수집할 수 있을 뿐더러 각 종 계기들의 원격 제어도 가능하다. 다른 실시예는, 전자식 전력량계가 AC 전원을 DC전원으로 변환하여 충전하는 슈퍼 캡 또는 충방전 배터리를 구비함과 동시에 해당 전자식 전력량계에 공급되는 AC 전원의 정전상태를 감지하는 기능을 구비함으로써, 해당 전자식 전력량계는 AC 전원 정전시 슈퍼 캡 또는 충방전 배터리에 충전된 DC 전원에 의해 사전에 정해 진 시간동안 구동되어 해당 전자식 전력량계의 정전상태를 상위 서버 및 데이터 수집 장치에 전송할 수 있다. 즉, AC 전원이 정상적으로 공급되는 상태에서는 전자식 전력량계는 슈퍼 캡 또는 충방전 배터리에 AC 전원 을 DC 전원으로 변환하여 사전에 정해진 용량을 유지할 수 있도록 충전하면서 해당 전자식 전력량계에 공급 되는 AC 전원이 정전되었는지를 확인하게 된다. 해당 전자식 전력량계에 공급되는 AC 전원이 정전되었을 때 해당 전자식 전력량계는 슈퍼 캡이나 충방 전 배터리에 충전된 DC 전원에 의해 사전에 정해진 시간(용량) 구동되어 해당 전자식 전력량계에 공급되는 AC 전원의 정전상태를 데이터 수집 장치, 더 나아가서는 데이터 수집 장치를 통해 상위 서버까지 전송 하게 된다. 또 다른 실시예는, 전자식 전력량계에 전력선을 통해 공급되는 AC 전원의 제로 클로싱 시점을 감지하는 센 서(sensor)를 구비하고, 전자식 전력량계에서 제로 클로싱 인터럽트가 발생시 해당 정보를 상위 서버 및 데 이터 수집 장치에 전송하도록 함으로써, 상위 서버 및 데이터 수집 장치는 전자식 전력량계와의 동 기화를 통해 제로 클로싱 인터럽트 발생시 전송되는 제로 클로싱 시점과 자신이 발생한 제로 클로싱 시점을 비 교하여 가장 가까운 동 시간대의 상을 확인하여 해당 전자식 전력량계는 어떤 상이 연결되어 있는지 보여주 거나 상위 서버에 전송할 수 있다. 위의 실시예에서, 데이터 수집 장치는 전자식 전력량계에서 제로 클로싱 발생시 해당 정보(event)를 상 위 서버에 전송할 수 있다. 위의 실시예에서, 상위 서버는 전자식 전력량계에서 제로 클로싱 발생시 해당 정보(event)를 데이터 수집 장치에 전송할 수 있다. 지금까지 본 발명에 따른 구체적인 실시 예에 관하여 설명하였으나, 본 발명의 범위에서 벗어나지 않는 한도 내 에서는 여러 가지 변형이 가능함은 물론이다. 그러므로, 본 발명의 범위는 설명된 실시예에 국한되어 정해져서 는 안 되며, 후술하는 특허청구의 범위뿐 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다. 이상과 같이 본 발명은 비록 한정된 실시 예와 도면에 의해 설명되었으나, 본 발명은 상기의 실시 예에 한정되 는 것은 아니며, 이는 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명 사상은 아래에 기재된 특허청구범위에 의해서만 파악되어야 하고, 이의 균등 또는 등가적 변형 모두는 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2018-0132270", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 의한 일체형 유무선 통신모듈을 이용한 상위 서버 또는 데이터 수집 장치에 정전 및 설치된 상을 감지하여 데이터를 전송해 주는 인공지능형 전자식 전력량계를 보인 구성도이다. 도 2는 제로 클로싱, 즉 5.53 msec마다 R. S. T.상에서의 인터럽트를 보인 그래프이다."}
