{"patent_id": "10-2022-0169319", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0085264", "출원번호": "10-2022-0169319", "발명의 명칭": "홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 시스템 및 그 정보 제", "출원인": "피앤피넷 주식회사", "발명자": "최익수"}}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "의류에 대한 인공지능을 이용한 정보 제공 시스템에 있어서,서버;를 포함하되,상기 서버는,클라이언트 단말기가 큐알(QR) 코드를 카메라에 의해 획득하여 상기 서버에 접속하면, 해당 큐알 코드에 관련된의류의 3차원 모델을 상기 클라이언트 단말기에 표시하는, 정보 제공 시스템."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 서버는,상기 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하고, 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 상기 클라이언트 단말기에표시하는, 정보 제공 시스템."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 서버는,상기 클라이언트 단말기로부터 선택된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 상기 클라이언트 단말기에 표시하는, 정보 제공 시스템."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 서버는,상기 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하고, 해당 식별 정보에 대해 기저장된 의류 판매 정보와 관련된 의류를 아바타가 착용하고 있는 3차원의 제1 모델과 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 상기 아바타가 착용하고 있는 3차원의 제2 모델을 동시에 상기 클라이언트 단말기에 표시하는, 정보 제공 시스템."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 서버는,상기 제1 모델과 상기 제2 모델의 핏감을 비교하여, 해당 큐알 코드에 관련된 의류에 대한 추천 사이즈 정보를상기 클라이언트 단말기에 제공하는, 정보 제공 시스템."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 서버는,추천 사이즈 정보가 기저장된 사이즈 정보와 상이할 경우, 추천 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 아바타가 착용하고 있는 3차원의 제3 모델을 상기 클라이언트 단말기에 표시하는, 정보 제공 시스템.공개특허 10-2024-0085264-3-청구항 7 제1항에 있어서,상기 서버는,다수의 아바타의 3차원 모델을 상기 클라이언트 단말기로 제공하고, 상기 클라이언트 단말기로부터 다수의 아바타 중 하나의 아바타를 선택하는 선택 정보를 입력받는, 정보 제공 시스템."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 서버는,상기 선택 정보에 의해 선택된 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 상기 클라이언트 단말기에 표시하는, 정보 제공 시스템."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "의류에 대한 인공지능을 이용한 정보 제공 방법에 있어서,(a) 서버가 클라이언트 단말기의 큐알(QR) 코드에 의한 접속을 승인하는 단계; 및(b) 상기 서버가 해당 큐알 코드에 관련된 의류의 3차원 모델을 상기 클라이언트 단말기에 표시하는 단계;를 포함하는, 정보 제공 방법."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 (b) 단계는,(b-1-1) 상기 서버가, 상기 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하는 단계; 및(b-1-2) 상기 (b-1-1) 단계에서 인식된 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 아바타가 해당큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 클라이언트 단말기에 표시하는 단계;를 포함하는, 정보제공 방법."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 (b) 단계는,(b-2-1) 상기 서버가, 상기 클라이언트 단말기로부터 선택된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 상기 클라이언트 단말기에 표시하는 단계;를 포함하는, 정보 제공 방법."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 (b) 단계는,(b-3-1) 상기 서버가, 상기 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하는 단계; 및(b-3-2) 상기 서버가, 해당 식별 정보에 대해 기저장된 의류 판매 정보와 관련된 의류를 아바타가 착용하고 있는 3차원의 제1 모델과 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 상기 아바타가 착용하고 있는 3차원의 제2 모델을 동시에 상기 클라이언트 단말기에 표시하는 단계;를 포함하는, 정보 제공 방법."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2024-0085264-4-제12항에 있어서,상기 (b) 단계는,(b-3-3) 상기 서버가, 상기 제1 모델과 상기 제2 모델의 핏감을 비교하여, 해당 큐알 코드에 관련된 의류에 대한 추천 사이즈 정보를 상기 클라이언트 단말기에 제공하는 단계;를 더 포함하는, 정보 제공 방법."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 (b) 단계는,(b-3-4) 상기 서버가, 추천 사이즈 정보가 기저장된 사이즈 정보와 상이할 경우, 추천 사이즈 정보에 기반하여해당 큐알 코드에 관련된 의류를 아바타가 착용하고 있는 3차원의 제3 모델을 상기 클라이언트 단말기에 표시하는 단계;를 더 포함하는, 정보 제공 방법."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서,상기 (b) 단계는,(b-4-1) 상기 서버가, 다수의 아바타의 3차원 모델을 상기 클라이언트 단말기로 제공하고, 상기 클라이언트 단말기로부터 다수의 아바타 중 하나의 아바타를 선택하는 선택 정보를 입력받는 단계;를 더 포함하는, 정보 제공방법."}
{"patent_id": "10-2022-0169319", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 (b) 단계는,(b-4-2) 상기 서버가, 상기 선택 정보에 의해 선택된 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는3차원 모델을 상기 클라이언트 단말기에 표시하는 단계;를 더 포함하는, 정보 제공 방법."}
{"patent_id": "10-2022-0169319", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "의류에 대한 인공지능을 이용한 정보 제공 시스템은, 서버;를 포함하되, 상기 서버는, 클라이언트 단말기가 큐알 (QR) 코드를 카메라에 의해 획득하여 상기 서버에 접속하면, 해당 큐알 코드에 관련된 의류의 3차원 모델을 상기 클라이언트 단말기에 표시하되, 상기 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하고, 해당 식별 정보 에 대해 기저장된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델 을 상기 클라이언트 단말기에 표시한다."}
{"patent_id": "10-2022-0169319", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 시스 템 및 그 정보 제공 방법에 관한 것이다."}
{"patent_id": "10-2022-0169319", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 의류의 경우 동일한 사이즈라도 브랜드 및 스타일별로 실제 크기 및 핏감이 전혀 상이하여, 소비자 들은 홈쇼핑 등과 같이 실제 의류의 착용이 불가능한 판매 환경에서 의류를 구매하는 것에 주저하게 된다. 따라서, 실제 의류의 착용이 불가능한 판매 환경에서도 실제 의류를 착용해 본 것과 유사한 효과를 발휘할 수 있는 정보 제공 시스템에 대한 요구가 있다."}
{"patent_id": "10-2022-0169319", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은, 실제 의류의 착용이 불가능한 판매 환경에서도 실제 의류를 착용해 본 것 과 유사한 효과를 발휘할 수 있는, 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 시스 템 및 그 정보 제공 방법을 제공하는 것에 그 목적이 있다."}
{"patent_id": "10-2022-0169319", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "의류에 대한 인공지능을 이용한 정보 제공 시스템은, 서버;를 포함하되, 상기 서버는, 클라이언트 단말기가 큐 알(QR) 코드를 카메라에 의해 획득하여 상기 서버에 접속하면, 해당 큐알 코드에 관련된 의류의 3차원 모델을 상기 클라이언트 단말기에 표시한다. 아울러, 상기 서버는, 상기 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하고, 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 상기 클라이언트 단말기에 표시할 수 있다. 또한, 상기 서버는, 상기 클라이언트 단말기로부터 선택된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 상기 클라이언트 단말기에 표시할 수 있다. 상기 서버는, 상기 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하고, 해당 식별 정보에 대해 기저장된 의류 판매 정보와 관련된 의류를 아바타가 착용하고 있는 3차원의 제1 모델과 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 상기 아바타가 착용하고 있는 3차원의 제2 모델을 동 시에 상기 클라이언트 단말기에 표시할 수 있다. 또한, 상기 서버는, 상기 제1 모델과 상기 제2 모델의 핏감을 비교하여, 해당 큐알 코드에 관련된 의류에 대한 추천 사이즈 정보를 상기 클라이언트 단말기에 제공한다. 아울 러, 상기 서버는, 추천 사이즈 정보가 기저장된 사이즈 정보와 상이할 경우, 추천 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 아바타가 착용하고 있는 3차원의 제3 모델을 상기 클라이언트 단말기에 표시할 수 있다. 또한, 상기 서버는, 다수의 아바타의 3차원 모델을 상기 클라이언트 단말기로 제공하고, 상기 클라이언트 단말 기로부터 다수의 아바타 중 하나의 아바타를 선택하는 선택 정보를 입력받는다. 상기 서버는, 상기 선택 정보에 의해 선택된 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 상기 클라이언트 단말기에 표시한다. 의류에 대한 인공지능을 이용한 정보 제공 방법은, (a) 서버가 클라이언트 단말기의 큐알(QR) 코드에 의한 접속 을 승인하는 단계; 및 (b) 상기 서버가 해당 큐알 코드에 관련된 의류의 3차원 모델을 상기 클라이언트 단말기 에 표시하는 단계;를 포함한다. 구체적으로, 상기 (b) 단계는, (b-1-1) 상기 서버가, 상기 클라이언트 단말기의 사용자에 대한 식별 정보를 인 식하는 단계; 및 (b-1-2) 상기 (b-1-1) 단계에서 인식된 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하 여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 클라이언트 단말기에 표시하는 단 계;를 포함할 수 있다. 아울러, 상기 (b) 단계는, (b-2-1) 상기 서버가, 상기 클라이언트 단말기로부터 선택된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 상기 클라이언트 단말기에 표시하는 단 계;를 더 포함할 수 있다. 또한, 상기 (b) 단계는, (b-3-1) 상기 서버가, 상기 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하는 단계; (b-3-2) 상기 서버가, 해당 식별 정보에 대해 기저장된 의류 판매 정보와 관련된 의류를 아바타가 착용하 고 있는 3차원의 제1 모델과 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 상기 아바타가 착용하고 있는 3차원의 제2 모델을 동시에 상기 클라이언트 단말기에 표시하는 단계; (b- 3-3) 상기 서버가, 상기 제1 모델과 상기 제2 모델의 핏감을 비교하여, 해당 큐알 코드에 관련된 의류에 대한 추천 사이즈 정보를 상기 클라이언트 단말기에 제공하는 단계; 및 (b-3-4) 상기 서버가, 추천 사이즈 정보가 기 저장된 사이즈 정보와 상이할 경우, 추천 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 아바타가 착 용하고 있는 3차원의 제3 모델을 상기 클라이언트 단말기에 표시하는 단계;를 더 포함할 수 있다. 아울러, 상기 (b) 단계는, (b-4-1) 상기 서버가, 다수의 아바타의 3차원 모델을 상기 클라이언트 단말기로 제공 하고, 상기 클라이언트 단말기로부터 다수의 아바타 중 하나의 아바타를 선택하는 선택 정보를 입력받는 단계; 및 (b-4-2) 상기 서버가, 상기 선택 정보에 의해 선택된 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있 는 3차원 모델을 상기 클라이언트 단말기에 표시하는 단계;를 더 포함할 수 있다."}
{"patent_id": "10-2022-0169319", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 시스템 및 그 정보 제공 방법에 따르면, 실제 의류의 착용이 불가능한 판매 환경에서도 실제 의류를 착용해 본 것과 유사한 효과를 발휘할 수 있다."}
{"patent_id": "10-2022-0169319", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하면서 본 개시의 실시예들에 따른 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능 을 이용한 정보 제공 시스템 및 그 정보 제공 방법에 대해 상세히 설명하기로 한다. 본 개시의 하기의 실시예들 은 본 개시를 구체화하기 위한 것일 뿐 본 개시의 권리 범위를 제한하거나 한정하는 것이 아님은 물론이다. 본 개시의 상세한 설명 및 실시예들로부터 본 개시가 속하는 기술 분야의 전문가가 용이하게 유추할 수 있는 것은 본 개시의 권리 범위에 속하는 것으로 해석된다. 도 1은 일실시예들에 따른 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 시스템의 구성도를 나타낸다. 도 1로부터 알 수 있는 바와 같이 일실시예들에 따른 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용 한 정보 제공 시스템은, 클라이언트 단말기와 서버를 포함하여 구성된다. 클라이언트 단말기와 서버는 각각, 컴퓨팅 장치(CA)로서 도 2와 같이 구성될 수 있다. 즉, 클라이언트 단말기와 서버는 각각, 프로세서(P), 메모리(M), 통신 장치(C)를 포함하여 구성될 수 있다. 메모리(M) 에는 프로세서(P)에 의해 실행 가능한 명령어들이 포함되고, 프로세서(P)는 명령어들을 실행한다. 통신 장치 (C)는 클라이언트 단말기와 서버는 각각 서로 통신하거나, 외부 장치와 통신하기 위한 장치이다. 아울러, 도 2에는 도시되지 않았지만, 클라이언트 단말기와 서버는 각각, 사용자로부터 데이터를 입력 받는 키보드 등을 포함한 다양한 입력 장치와 데이터 등을 화면에 표시하기 위한 디스플레이 등의 다양한 출력 장치를 더 포함할 수 있다. 아울러, 클라이언트 단말기는 카메라를 구비한다. 클라이언트 단말기는 큐알(QR) 코드를 카메라에 의해 획득하여, 서버에 큐알 코드에 의해 서버에 접속한다. 즉, 큐알 코드는 홈쇼핑의 방송 화면에 표시되며, 해당 화면 중 QR 코드를 클라이언트 단말기가 카메라에 획득할 수 있다. 서버는, 해당 큐알 코드에 관련된 의류의 3차원 모델을 클라이언트 단말기에 표시한다. 서버는 클라이언트 단말기의 설정 정보에 따라 다음과 같이 인공지능을 이용하여 3차원 모델을 클라이 언트 단말기에 표시할 수 있다. 서버는, 서버에 접속한 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하고, 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 클라이언트 단말기에 표시한다. 서버는, 클라이언트 단말기로부터 선택된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련 된 의류를 착용하고 있는 3차원 모델을 클라이언트 단말기에 표시한다. 서버는, 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하고, 해당 식별 정보에 대해 기저장 된 의류 판매 정보와 관련된 의류를 아바타가 착용하고 있는 3차원의 제1 모델과 해당 식별 정보에 대해 기저장 된 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 아바타가 착용하고 있는 3차원의 제2 모델을 동시 에 클라이언트 단말기에 표시한다. 서버는, 제1 모델과 제2 모델의 핏감을 비교하여, 해당 큐알 코드에 관련된 의류에 대한 추천 사이즈 정보 를 클라이언트 단말기에 제공한다. 서버는, 추천 사이즈 정보가 기저장된 사이즈 정보와 상이할 경우, 추천 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 아바타가 착용하고 있는 3차원의 제3 모델을 클라이언트 단말기에 표시한다. 서버는, 다수의 아바타의 3차원 모델을 클라이언트 단말기로 제공하고, 클라이언트 단말기로부 터 다수의 아바타 중 하나의 아바타를 선택하는 선택 정보를 입력받는다. 서버는, 선택 정보에 의해 선택된 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 클라이언트 단말기에 표시한다. 도 3은 일실시예들에 따른 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 방법의 흐름도 를 나타낸다. 일실시예들에 따른 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 방법은, 상술한 일실 시예들에 따른 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 시스템을 사용하므로 별도의 설명이 없더라도 정보 제공 시스템의 모든 특징을 포함하고 있음은 물론이다. 도 3으로부터 알 수 있는 바와 같이, 일실시예들에 따른 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이 용한 정보 제공 방법은, 서버가 클라이언트 단말기의 큐알(QR) 코드에 의한 접속을 승인하는 단계 (S100); 및 서버가 해당 큐알 코드에 관련된 의류의 3차원 모델을 클라이언트 단말기에 표시하는 단계 (S200);를 포함한다. 구체적으로 S200 단계는, 서버가, 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하는 단계 (S211); 및 S211 단계에서 인식된 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 클라이언트 단말기에 표시하는 단계(S212);를 포함한다. 또한, S200 단계는, 서버가, 클라이언트 단말기로부터 선택된 사이즈 정보에 기반하여 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 클라이언트 단말기에 표시하는 단계(S221);를 더 포함한다. 아울러, S200 단계는, 서버가, 클라이언트 단말기의 사용자에 대한 식별 정보를 인식하는 단계(S231); 서버가, 해당 식별 정보에 대해 기저장된 의류 판매 정보와 관련된 의류를 아바타가 착용하고 있는 3차원의 제1 모델과 해당 식별 정보에 대해 기저장된 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 아바타가 착용하고 있는 3차원의 제2 모델을 동시에 클라이언트 단말기에 표시하는 단계(S232); 및 서버가, 제1 모델과 제2 모델의 핏감을 비교하여, 해당 큐알 코드에 관련된 의류에 대한 추천 사이즈 정보를 클라이언트 단 말기에 제공하는 단계(S233); 및 서버가, 추천 사이즈 정보가 기저장된 사이즈 정보와 상이할 경우, 추 천 사이즈 정보에 기반하여 해당 큐알 코드에 관련된 의류를 아바타가 착용하고 있는 3차원의 제3 모델을 클라 이언트 단말기에 표시하는 단계(S234);를 더 포함한다. 또한, S200 단계는, 서버가, 다수의 아바타의 3차원 모델을 클라이언트 단말기로 제공하고, 클라이언트 단말기로부터 다수의 아바타 중 하나의 아바타를 선택하는 선택 정보를 입력받는 단계(S241); 및 서버 가, 선택 정보에 의해 선택된 아바타가 해당 큐알 코드에 관련된 의류를 착용하고 있는 3차원 모델을 클라이언 트 단말기에 표시하는 단계(S242);를 더 포함한다. 상술한 바와 같이 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 시스템 및 그 정 보 제공 방법에 따르면, 실제 의류의 착용이 불가능한 판매 환경에서도 실제 의류를 착용해 본 것과 유사한 효 과를 발휘할 수 있음을 알 수 있다."}
{"patent_id": "10-2022-0169319", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일실시예들에 따른 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 시스템의 구성 도. 도 2는 컴퓨팅 장치의 구성도. 도 3은 일실시예들에 따른 홈쇼핑 방송에서 판매 중인 의류에 대한 인공지능을 이용한 정보 제공 방법의 흐름도."}
