{"patent_id": "10-2023-0082143", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0000374", "출원번호": "10-2023-0082143", "발명의 명칭": "물품 재활용 관리시스템", "출원인": "김형주", "발명자": "김형주"}}
{"patent_id": "10-2023-0082143", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "물품 재활용 관리시스템에 있어서,외부장치와 통신하는 제조통신부 및 재활용을 수행하는 재활용방법을 포함하는 재활용정보 및 복수의 부품으로이루어지는 물품정보를 저장하며, 저장된 상기 물품정보의 물품이 출고를 포함하는 이동정보에 따라 상기 재활용정보 및 상기 물품정보를 상기 이동정보에 대응하는 외부장치로 전송하도록 상기 제조통신부를 제어하는 제조제어부를 포함하는 제조유닛;상기 물품정보를 수신하는 재활용통신부 및 수신된 상기 재활용정보 및 상기 물품정보를 저장하며, 상기 물품정보의 해당 물품이 입고되면 상기 재활용통신부에 수신된 상기 물품정보에 기초하여 상기 해당 물품의 재활용작업이 이루어지게 상기 해당 물품의 상기 복수의 부품에 대한 상기 재활용정보를 재활용을 수행하는 재활용작업자의 재활용단말기로 전송하도록 상기 재활용통신부를 제어하는 재활용제어부를 포함하는 재활용유닛을 포함하는 것을 특징으로 하는 물품 재활용 관리시스템."}
{"patent_id": "10-2023-0082143", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 재활용유닛은,상기 물품정보의 해당 물품이 입고되면 상기 해당 물품의 식별코드를 인식하기 위한 식별코드인식부를 더 포함하는 것을 특징으로 하는 물품 재활용 관리시스템."}
{"patent_id": "10-2023-0082143", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 재활용유닛은,상기 물품정보의 해당 물품이 입고부터 재활용작업이 이루어져 상기 복수의 부품이 분해되어 재활용분리수거가이루어지는 것까지의 영상을 촬영하는 복수의 카메라를 더 포함하는 것을 특징으로 하는 물품 재활용 관리시스템."}
{"patent_id": "10-2023-0082143", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 해당 물품의 상기 복수의 부품 각각에는 식별칩이 포함되며,상기 재활용유닛은,상기 물품정보의 해당 물품이 입고되면 상기 해당 물품의 상기 식별칩을 인식하기 위한 식별칩인식부를 더 포함하는 것을 특징으로 하는 물품 재활용 관리시스템."}
{"patent_id": "10-2023-0082143", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,공개특허 10-2025-0000374-3-상기 재활용정보는,각 부품들의 재활용처리방법, 재활용처리조건 및 재활용규정을 포함하는 것을 특징으로 하는 물품 재활용 관리시스템."}
{"patent_id": "10-2023-0082143", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "물품 재활용 관리시스템은 외부장치와 통신하는 제조통신부 및 재활용을 수행하는 재활용방법을 포함하는 재활용 정보 및 복수의 부품으로 이루어지는 물품정보를 저장하며, 저장된 물품정보의 물품이 출고를 포함하는 이동정보 에 따라 재활용정보 및 물품정보를 이동정보에 대응하는 외부장치로 전송하도록 제조통신부를 제어하는 제조제어 부를 포함하는 제조유닛, 물품정보를 수신하는 재활용통신부 및 수신된 재활용정보 및 물품정보를 저장하며, 물 품정보의 해당 물품이 입고되면 재활용통신부에 수신된 물품정보에 기초하여 해당 물품의 재활용작업이 이루어지 게 해당 물품의 복수의 부품에 대한 재활용정보를 재활용을 수행하는 재활용작업자의 재활용단말기로 전송하도록 재활용통신부를 제어하는 재활용제어부를 포함하는 재활용유닛을 포함한다."}
{"patent_id": "10-2023-0082143", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 물품 재활용 관리시스템에 관한 것으로, 보다 상세하게는 물품이 폐기되는 경우 재활용이 제대로 이 루어지도록 할 수 있는 물품 재활용 관리시스템에 관한 것이다."}
{"patent_id": "10-2023-0082143", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "예전에는 폐기물을 쓰레기 취급하여 모두 폐기 처분하다가 자원을 재활용해야 한다는 인식이 생겨 나면서 재활 용이 제도화되어 모든 가정과 사업자에서 일반적으로 이루어지고 있다. 이러한 재활용은 가정이나 사업장에서 재활용을 수행하는 담당자가 종류별로 분리하여 이루어진다. 그러나 이렇게 분리수거가 이루어지면서 종류가 애매한 것들은 어느 한 종류로 잘못 분류되기도 한다. 또한, 여 러 종류의 재료로 이루어진 재활용물품이 분리하기 어려워 그대로 어느 한 종류로 분류되어 재활용장으로 이동 되기도 한다. 특히, 전자제품, 자동차 및 복잡한 제품 같은 경우 부품별로 서로 다른 재활용처리방법, 재활용처리조건 및 재 활용규정이 마련되어 있음에도 재활용작업자들이 이에 대한 정보를 가지고 있지 않으므로 정확한 재활용이 이루 어지지 않고 있는 문제가 있다."}
{"patent_id": "10-2023-0082143", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명의 목적은 물품에 대한 정확한 재활용정보를 제공하여 재활용이 제대로 이루어질 수 있도록 하는 물품 재활용 관리시스템을 제공하는 것이다."}
{"patent_id": "10-2023-0082143", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명에 따른 물품 재활용 관리시스템은 외부장치와 통신하는 제조통신부 및 재활 용을 수행하는 재활용방법을 포함하는 재활용정보 및 복수의 부품으로 이루어지는 물품정보를 저장하며, 저장된 상기 물품정보의 물품이 출고를 포함하는 이동정보에 따라 상기 재활용정보 및 상기 물품정보를 상기 이동정보 에 대응하는 외부장치로 전송하도록 상기 제조통신부를 제어하는 제조제어부를 포함하는 제조유닛; 상기 물품정 보를 수신하는 재활용통신부 및 수신된 상기 재활용정보 및 상기 물품정보를 저장하며, 상기 물품정보의 해당 물품이 입고되면 상기 재활용통신부에 수신된 상기 물품정보에 기초하여 상기 해당 물품의 재활용작업이 이루어 지게 상기 해당 물품의 상기 복수의 부품에 대한 상기 재활용정보를 재활용을 수행하는 재활용작업자의 재활용 단말기로 전송하도록 상기 재활용통신부를 제어하는 재활용제어부를 포함하는 재활용유닛을 포함한다. 물품을 제조하는 경우 복수의 부품 각각에 대한 재활용정보를 재활용유닛으로 제공하여 재활용을 수행하는 작업자가 이 정보를 이용하여 재활용이 이루어지도록 할 수 있으므로 마구잡이로 이루어지던 재활용작업이 제대로 이루어지 며 이로 인하여 자원에 대한 재활용률이 향상될 수 있다. 여기서, 상기 재활용유닛은, 상기 물품정보의 해당 물품이 입고되면 상기 해당 물품의 식별코드를 인식하기 위 한 식별코드인식부를 더 포함하면 재활용작업을 해야 하는 물품의 식별코드를 인식하여 정확한 재활용 정보를 제공받은 후 재활용작업이 이루어질 수 있어 바람직하다.그리고 상기 재활용유닛은, 상기 물품정보의 해당 물품이 입고부터 재활용작업이 이루어져 상기 복수의 부품이 분해되어 재활용분리수거가 이루어지는 것까지의 영상을 촬영하는 복수의 카메라를 더 포함하면 재활용 작업 전 반을 투명하게 이루어지게 할 수 있으므로 재활용에 대한 투명성이 증가할 수 있어 바람직하다. 여기서, 상기 해당 물품의 상기 복수의 부품 각각에는 식별칩이 포함되며, 상기 재활용유닛은, 상기 물품정보의 해당 물품이 입고되면 상기 해당 물품의 상기 식별칩을 인식하기 위한 식별칩인식부를 더 포함하면 재활용작업 을 해야 하는 물품의 식별칩을 인식하여 정확한 재활용 정보를 제공받은 후 재활용작업이 이루어질 수 있어 바 람직하다. 그리고 상기 재활용정보는, 각 부품들의 재활용처리방법, 재활용처리조건 및 재활용규정을 포함하면 재활용처리 가 정확하고 효율적으로 이루어질 수 있어 바람직하다."}
{"patent_id": "10-2023-0082143", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 물품을 제조하는 경우 복수의 부품 각각에 대한 재활용정보를 재활용유닛으로 제공하여 재활 용을 수행하는 작업자가 이 정보를 이용하여 재활용이 이루어지도록 할 수 있으므로 마구잡이로 이루어지던 재 활용작업이 제대로 이루어지며 이로 인하여 자원에 대한 재활용률이 향상될 수 있는 효과가 있다. 또한, 재활용작업을 해야 하는 물품의 식별코드를 인식하여 정확한 재활용 정보를 제공받은 후 재활용작업이 이 루어질 수 있고, 재활용 작업 전반을 투명하게 이루어지게 할 수 있으므로 재활용에 대한 투명성이 증가할 수 있는 효과가 있다. 또한, 재활용작업을 해야 하는 물품의 식별칩을 인식하여 정확한 재활용 정보를 제공받은 후 재활용작업이 이루 어질 수 있고, 재활용처리가 정확하고 효율적으로 이루어질 수 있는 효과가 있다."}
{"patent_id": "10-2023-0082143", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하면서 본 발명의 바람직한 실시 예에 따른 물품 재활용 관리시스템을 상세히 설 명한다. 도 1은 본 발명에 따른 물품 재활용 관리시스템의 물품 재활용 동작도이고, 도 2는 물품 재활용 관리시스템 의 전체 제어블록도이며, 도 3은 제조유닛과 재활용유닛의 제어블록도이고, 도 4는 제조유닛의 상세 제어블록도이다. 도 1 내지 도 4를 참조하여 물품 재활용 관리시스템의 구성을 설명한다. 물품 재활용 관리시스템은 제조유닛, 재활용유닛, 제조단말기 및 재활용단말기을 포함한다. 제조유닛은 제조통신부 및 제조제어부를 포함한다. 제조통신부는 외부장치와 통신한다. 제조통신부는 무선통신을 수행할 수 있으며, 무선통신은 적외선 통 신, RF, 지그비, 블루투스 중 적어도 하나를 포함한다. 제조통신부는 영상신호를 수신하여 후술할 제조제어 부에 전달하며, 수신하는 영상신호의 규격 및 사용자단말기의 구현 형태에 대응하여 다양한 방식으로 구현 될 수 있다. 예를 들면, 제조통신부는 방송국(미도시)으로부터 송출되는 RF(radio frequency) 신호를 무선 으로 수신하거나, 컴포지트(composite) 비디오, 컴포넌트(component) 비디오, 슈퍼 비디오(super video), SCART, HDMI(high definition multimedia interface) 규격 등에 의한 영상신호를 유선으로 수신할 수 있다. 영 상신호가 방송신호인 경우, 제조통신부는 이 방송신호를 채널별로 튜닝하는 튜너(tuner)를 포함할 수 있다.제조제어부는 재활용을 수행하는 재활용방법을 포함하는 재활용정보 및 복수의 부품으로 이루어지는 물품정 보를 저장하며, 저장된 물품정보의 물품이 출고를 포함하는 이동정보에 따라 재활용정보 및 물품정보를 이동정 보에 대응하는 외부장치로 전송하도록 제조통신부를 제어한다. 재활용정보는, 각 부품들의 재활용처리방법, 재활용처리조건 및 재활용규정을 포함할 수 있다. 재활용유닛은 재활용통신부, 식별코드인식부, 식별칩인식부, 카메라 및 재활용제어부 를 포함한다. 재활용통신부는 물품정보를 수신한다. 재활용통신부는 무선통신을 수행할 수 있으며, 무선통신은 적외 선 통신, RF, 지그비, 블루투스 중 적어도 하나를 포함한다. 재활용통신부는 영상신호를 수신하여 후술할 재활용제어부에 전달하며, 수신하는 영상신호의 규격 및 사용자단말기의 구현 형태에 대응하여 다양한 방식 으로 구현될 수 있다. 예를 들면, 재활용통신부는 방송국(미도시)으로부터 송출되는 RF(radio frequency) 신호를 무선으로 수신하거나, 컴포지트(composite) 비디오, 컴포넌트(component) 비디오, 슈퍼 비디오(super video), SCART, HDMI(high definition multimedia interface) 규격 등에 의한 영상신호를 유선으로 수신할 수 있다. 영상신호가 방송신호인 경우, 재활용통신부는 이 방송신호를 채널별로 튜닝하는 튜너(tuner)를 포함 할 수 있다. 식별코드인식부는 물품정보의 해당 물품이 입고되면 해당 물품의 식별코드를 인식할 수 있다. 식별코드인식 부는 식별코드를 인식할 수 있도록 하며, 휴대용일 수 있다. 해당 물품의 식별코드를 식별코드인식부로 인식하여 물품정보와 재활용정보내용을 확인할 수 있다. 식별코드인식부는 코드센서부, 코드통신부, 코드디스플레이부 및 코드제어부를 포함할 수 있다. 식별코드인식부는 식별코드를 인식할 수 있는 센서로 이루어질 수 있다. 레이저센서, 카메라로 구현될 수 있다. 코드센서부는 식별코드로 광을 출력한 후 회신되는 광을 이용하여 바코드나 QR코드를 읽을 수 있도록 마 련된다. 코드통신부는 재활용통신부와 통신하며, 위치정보를 수신할 수 있다. 코드디스플레이부는 주문내용을 표시하기 위한 구성이다. 코드제어부는 코드센서부로 해당 물품의 식별코드를 인식하면 물품정보와 재활용정보가 표시되도록 코드디스플 레이부를 제어하고, 코드통신부로부터 수신되는 위치정보에 기초하여 기설정 복수의 영역에 있는 것으로 판단되 면 재활용통신부로 해당 물품에 대한 위치정보를 전송하도록 코드통신부를 제어할 수 있다. 식별칩인식부는 해당 물품의 복수의 부품 각각에는 식별칩이 포함되며, 재활용유닛은, 물품정보의 해당 물 품이 입고되면 해당 물품의 사기 식별칩을 인식할 수 있다. 식별칩인식부는 식별코드인식부와 유사한 구성으로 이루어질 수 있으며, 식별칩을 인식하는 것과 식별코드를 인식하는 것의 차이만 있을 뿐 그 외는 동일 한 구성이다. 카메라는 물품정보의 해당 물품이 입고부터 재활용작업이 이루어져 복수의 부품이 분해되어 재활용분리수거 가 이루어지는 것까지의 영상을 촬영하는 복수의 구성으로 이루어질 수 있다. 카메라는 제1카메라, 제2카메라 및 제3카메라를 포함한다. 제1카메라는 일 위치에서 해당 물품을 감지 및 인식할 수 있도록 할 수 있다. 제2카메라는 제1카메라와는 다른 위치에서 해당 물품을 감지 및 인식할 수 있도록 할 수 있다. 제3카메라는 제1카메라와 제2카메라와는 다른 위치에서 해당 물품을 감지 및 인식할 수 있도록 할 수 있다. 재활용제어부 수신된 재활용정보 및 물품정보를 저장하며, 물품정보의 해당 물품이 입고되면 재활용통신부 에 수신된 물품정보에 기초하여 해당 물품의 재활용작업이 이루어지게 해당 물품의 복수의 부품에 대한 재 활용정보를 재활용을 수행하는 재활용작업자의 재활용단말기로 전송하도록 재활용통신부를 제어한다. 제조단말기는 제조단말통신부, 제조단말디스플레이부, 제조단말입력부, 제조단말스피커, 제조단말마이크, 제조단말카메라 및 제조단말제어부를 포함한다. 제조단말통신부는 무선통신을 수행할 수 있으며, 무선통신은 적외선 통신, RF, 지그비, 블루투스 중 적어도 하나를 포함한다. 제조단말통신부는 영상신호를 수신하여 후술할 제조단말제어부에 전달하며, 수신하는 영상신호의 규격 및 사용자단말기의 구현 형태에 대응하여 다양한 방식으로 구현될 수 있다. 예를 들면, 제조단 말통신부는 방송국(미도시)으로부터 송출되는 RF(radio frequency) 신호를 무선으로 수신하거나, 컴포지트 (composite) 비디오, 컴포넌트(component) 비디오, 슈퍼 비디오(super video), SCART, HDMI(high definition multimedia interface) 규격 등에 의한 영상신호를 유선으로 수신할 수 있다. 영상신호가 방송신호인 경우, 제 조단말통신부는 이 방송신호를 채널별로 튜닝하는 튜너(tuner)를 포함할 수 있다. 제조단말디스플레이부는 영상처리에 의해 처리되는 영상신호에 기초하여 영상을 표시한다. 제조단말디스플 레이부의 구현 방식은 한정되지 않으며, 예컨대 액정(liquid crystal), 플라즈마(plasma), 발광 다이오드 (light-emitting diode), 유기발광 다이오드(organic light-emitting diode), 면전도 전자총 (surfaceconduction electron-emitter), 탄소 나노 튜브(carbon nano-tube), 나노 크리스탈(nano-crystal) 등 의 다양한 디스플레이 방식으로 구현될 수 있다. 제조단말디스플레이부는 그 구현 방식에 따라서 부가적인 구성을 추가적으로 포함할 수 있다. 예를 들면, 제조단말디스플레이부가 액정 방식인 경우, 제조단말디스플레이부는 액정 디스플레이 패널(미도시)과, 이에 광을 공급하는 백라이트유닛(미도시)과, 패널(미도시)을 구동시키는 패널구동기판(미도시)을 포함한다. 제 조단말디스플레이부는 인식된 음성에 대한 정보로서 음성인식결과를 표시할 수 있다. 여기서, 음성인 식결 과는 텍스트, 그래픽, 아이콘 등의 다양한 형태로 표시 가능하며, 텍스트는 문자와 숫자를 포함한다. 제조단말 디스플레이부는 음성인식 결과에 따른 후보 명령어 및 어플리케이션 정보를 더 표시할 수 있다. 사용자는 제조단말디스플레이부에 표시된 음성인식결과에 의해 음성이 올바르게 인식되었는지를 확인할 수 있으며, 리모컨에 마련된 제조단말입력부를 조작하여 표시된 후보 명령어 중에서 사용자가 발화한 음성에 대응하는 명령어를 선택하거나, 음성인식 결과와 관련된 정보를 선택하여 확인할 수도 있다. 제조단말입력부는 사용자가 사용자명령을 입력할 수 있는 입력수단으로 이루어질 수 있다. 제조단말입력부 는 사용자의 터치입력 또는 리모트 컨트롤러(remote controller)를 이용한 사용자의 원격입력을 수신하여 해당 제조단말제어부로 전달할 수 있다. 또한, 제조단말입력부는 사용자가 발화하는 음성입력을 수신하 여 그 음성신호를 사용자제어부로 전달할 수 있다. 그 경우 제조단말입력부는, 예를 들어, 마이크로 구현될 수 있다. 제조단말입력부는 수신한 음성신호에 대한 신호처리를 자체적으로 수행할 수도 있다. 다만, 제조단말입력부가 수신 가능한 사용자 입력에 형태는 이에 한정되는 것은 아니고, 예를 들어 모션 인 식 등을 통한 사용자 입력 등도 수신할 수 있다. 제조단말스피커는 영상의 음성, 어플리케이션의 음성 및 사용자의 음성을 포함하는 음성일체를 출력할 수 있다. 제조단말마이크는 영상의 음성, 어플리케이션의 음성 및 사용자의 음성을 포함하는 음성일체를 수신할 수 있다. 제조단말카메라는 사용자를 포함하는 외부 및 전방을 촬영할 수 있다. 제조단말제어부는 제조유닛의 제어설정 및 작업자의 입력을 할 수 있다. 재활용단말기는 재활용유닛의 제어설정 및 작업자의 입력을 할 수 있다. 본 발명의 물품 재활용 관리시스템은 물품을 추적 관리를 할 수도 있으며 이에 대한 설명을 한다. 물건을 살 때부터 관리하고 버릴 때까지의 모든 것을 담당하는 시스템일 수 있다. 핸드폰의 카메라처럼 초소형카메라와 적외선 센서 등 여러 센서를 세트화하여 회전이 되고 각도조절도 되는 기 구에 여러 각도와 방향으로 장착하여 방과 거실, 냉장고 등등 많은 곳에서 모든 방향을 추적하고 음식에 대한 유통기한, 보관 장소, 조리법등 물건의 사용법, 위치 등을 알 수 있게 제공해 줄 수 있다. 고장이 나면 수리에 대한 연락처와 수리법 등을 알려주고 버릴 때에 분리수거 방법과 위치도 안내하는 모든 것 을 케어하는 시스템일 수 있다. 촬영과 추적 등을 담당하는 카메라, 센서장치는 환경의 크기, 금전적인 부분을 고려하여 세트마다 개수가 적을 수도 있고, 장착을 하지 않고 이동형 로봇과 연동하여 동일한 기능을 제공할 수 있기도 하다. 또한 LED전구를 장착하고 인공지능 조명역할을 하거나 어두운 곳에서 조명을 비추니 환경을 인식하고 대상을 추 적하기도 한다. 해당 기기는 노트북이나 특수 전자장비와 연동하여 사용자가 메타환경을 즐길 수도 있게 하며남는 카메라와 센서의 회전 등으로 실시간 추적 기능을 할 수도 있고 로봇의 연동으로 부족한 부분을 보완할 수 도 있다. 해당기기가 환경에 대한 인식을 마치면 사용자가 VR을 더 안전하게 이용할 수 있도록 음성 경고와 일정거리에서 의 간략화된 환경표시를 제공할 수 있다. 처음 사물을 보면 상세분석에 들어가고 분석, 등록이 끝나면 동선파악 등의 추적과 상태변화 감지 등의 간략모 드로 이용되다가 특이현상이 생기거나 추적을 놓치면 묻는 기능으로 재등록하거나 재분석 모드에 들어가게 할 수 있다. 카메라로 촬영할 경우 사람에 대한 개인정보 유출이 있을 수 있으므로 사물에 대한 사진적자료 외의 사진자료는 저장하지 않을 수도 있다. 위치 추적 또한 선택적으로 off할 수 있다. 또한 민감한 자료나 물건이 있는 곳에서는 설치하지 않고 추적범위 밖으로 갔던 것에 대해서는 공간에 대한 정 보만 갖고 안내하고 이동될 시에 묻는 기능으로 사물에 대한 정보를 갱신할 수 있다. 추적 등을 놓칠 것을 대비해 핸드폰, 냉장고, TV등 다른 전자제품과도 연동되어 무선으로 정보를 통신할 수 있 게 할 수 있다. 야간이나 어두운 환경에서 조명으로 눈부실 수 있을 때는 적외선 추적을 활용할 수 있다. 인식된 환경에 대하여 AI프로그램이 공간의 크기, 좌표 등을 학습하고 정확한 데이터를 바탕으로 추적, 변화감지, 음성경고 등을 위한 신속성과 신뢰성을 높인다. 업체에서 물건이 만들어질 때부터 바코드와 칩에 물건의 특성에 대한 자료가 저장되고 권한마다 제공되는 자료 를 구분하여 인증된 기관의 인증을 얻은 권한으로 권한이 유지되는 동안 해당 물건이 유통되고 가공되고 변형되 는 등의 이력을 저장하여 사용자에게 해당 권한만큼 유용히 쓸 수 있는 자료를 제공할 수 있다. 물건의 제조사, 원산지, 유통과정 등을 제공하여 제조사 진위확인, 원산지확인, 주인이 누구인지를 확인하여 거 래 시에 신뢰성을 높인다. 또한 인터넷상에서도 해당 물건의 자료를 권한만큼 얻을 수 있다. 이것은 물건이 만 들어질 때부터 폐기되기까지 그 상태, 상황, 용도에 따라 권한이 달라지며 허용 범위 내에서 사용자가 유용한 자료를 얻어 물건을 최대한 활용할 수 있도록 하는 시스템일 수 있다. 물건등록, 물건위치 추적안내, 사용방법, 요리법, 필요재료, 유통기한, 메타 보안, 도청과 도촬도 감시하고 방 지, 도둑차단, 재고확인, 재활용 등의 버리는 방법, 카메라 촬영, 동영상 촬영, 의상 안내 및 장착 등 많은 역 할을 할 수 있게 할 수 있다. 카메라와 센서 고장 진단 및 다른 물건의 고장도 진단하고 조치할 수 있게 할 수 있다. 권한의 위임이나 인증기기 변경이 가능하여 핸드폰 같은 중요 기기가 없을시에 카드나 칩에 권한을 받아 허용범 위 내에서 교통요금, 출퇴근카드, 기기작동 아이디 등의 제공, 택배 등에 대한 출입문 오픈, 택배함 보관 등의 많은 것을 할 수 있게 할 수 있다. 해당 권한은 수시로 사용자확인을 하는데 실시간 추적이 되면 해당 권한을 기간 동안 허용한다. 해당 기기들은 권한을 위임하거나 기기 변경이 가능하여 특정기기의 고장이나 전원꺼짐에 대비, 대응할 수 있게 하며 배터리 모드도 제공할 수 있다. 또한 다양한 주변기기의 AI에 의한 방향성 무선 충전으로 전파 간섭이 적도록 여러 기기에서 무선 충전을 할 수 있게 할 수 있다. 빠른 응답성을 위해 실제 영상 제공 말고도 형태에 대한 사진, 센서 정보로 가상공간에 표시할 수도 있다. 공간 을 확대하여 볼 수도 있고 실제 촬영사진을 볼 수도 있으며 사물에 대한 세부적인 확인을 위해 고해상도 자료를 볼 수도 있다. 인식된 정보들은 중요 정보 순으로 서버에 저장이 되어 빠르게 확인이 가능하도록 할 수 있다. 정보 갱신으로 새로운 정보를 업데이트하고 기존 이력 또한 남겨 물건에 대한 변화 과정과 최신 정보 습득이 가능하도록 한다. 로봇과의 연동 등 여러 기기와 연동을 위해서 사람이 보는 자료 외에도 전자기기가 확인하고 활용할 수 있는 형 태로의 자료도 저장 및 업데이트 한다. 자료 접근에 관하여 세부적으로 나눌 수 있다. 일반인, 전문가, 관계자, 마스터 일반인은 유용한 낮은 등급의 자료를 받고 전문가는 해당제품을 수리하거나 변 형, 최적화시킬 수 있으며 관계자는 거의 모든 권한을 얻고 마스터는 해당 자료에 대한 권한 변경과 자료 수정 등 모든 권한을 가질 수도 있다. 이것 또한 실시간 추적으로 사용자의 권한을 유지시킬 수도 있다. 재활용에 대해서는 해당 제품에 의해 공개된 부분에 한해서 공식적인 재활용 방법도 얻고 개인들의 재활용 방법에 대한 정보도 얻어 재활용률을 높일 수 있다. 조리법, 보관방법, 수 리법, 재활용법 등 많은 정보를 교환하고 권한 및 이용범위에 따라 월마다 일정금액을 지불하고 사용할 수 있기 도 하다. 추적에 대해서는 센서로 감지하다가 등록, 안내, 분석 등을 할 때에만 촬영한 이미지를 활용 및 제공 하기도 한다. 재활용 참여율을 높일 수 있게 정보를 제공해도 될 만큼 기업에 대한 권리를 보장하고 재활용이 용이한 소재를 사용하도록 독려한다. 정부의 큰 방향이 될 수 있도록 제도화가 되면 좋을 듯하다. 의류에 대해서는 가상으로 입어보고 중고거래도하고 세탁방법 공유도 있을 수 있다. 재활용 구역을 두어 많이 나오는 재활용은 구역을 많이 두고 특이재료 등은 구역을 적게 둔다. 추적, 감시가 되 는 기기와 연동하여 CCTV 기능도 하고 재활용이 모이면 해당 차량을 불러서 수거하여 처리장으로 간다. 재활용 시스템은 정부가 주도하는 메인서버와 각각의 기업이 주도하는 개별서버 등이 있으며 제품이 생산됐을 당시의 재활용 데이터와 제품 데이터를 받고 일정 주기로 업데이트할 수 있다. 재활용이 안되던 게 재활용이 되기도 하고 국가나 지역마다 다르기도 하고 재활용 위치와 방법, 일자 등의 변경 이 있을 수도 있기에 기업과 국가 간에도 정보를 교환하고 업데이트할 수 있다. 도 1은 본 발명에 따른 물품 재활용 관리시스템의 물품 재활용 동작도이다. 1) 제조단말기에서 제조유닛으로 복수의 부품 정보를 전송한다. 2) 제조유닛에서 복수의 부품정보에 기초하여 재활용방법, 재화용정보를 생성하여 저장한다. 3) 물품이 제조되어 출고된다. 4) 제조유닛에서 재활용유닛로 재활용정보 및 물품정보를 전송한다. 5) 재활용유닛은 재활용정보 및 물품정보를 저장한다. 6) 재활용장으로 해당 물품이 입고된다. 7) 재활용유닛은 재활용단말기로 재활용정보를 전송한다. 8) 식별코드인식부 및 식별칩인식부를 이용하여 해당 물품의 부품을 인식한다. 9) 재활용유닛은 재활용단말기로 물품정보를 전송한다. 10) 물품의 제조부터 재활용분리수거까지 영상을 촬영한다. 11) 입고된 물품에 대해 재활용 분리수거를 수행한다. 12) 재활용단말기는 재활용유닛으로 재활용분리수거 작업 정보를 전송한다. 상기의 물품 재활용 관리시스템으로 인하여, 물품을 제조하는 경우 복수의 부품 각각에 대한 재활용정보를 재활용유닛으로 제공하여 재활용을 수행하는 작업자가 이 정보를 이용하여 재활용이 이루어지도록 할 수 있으므 로 마구잡이로 이루어지던 재활용작업이 제대로 이루어지며 이로 인하여 자원에 대한 재활용률이 향상될 수 있 다. 또한, 재활용작업을 해야 하는 물품의 식별코드를 인식하여 정확한 재활용 정보를 제공받은 후 재활용작업이 이 루어질 수 있고, 재활용 작업 전반을 투명하게 이루어지게 할 수 있으므로 재활용에 대한 투명성이 증가할 수 있다. 또한, 재활용작업을 해야 하는 물품의 식별칩을 인식하여 정확한 재활용 정보를 제공받은 후 재활용작업이 이루 어질 수 있고, 재활용처리가 정확하고 효율적으로 이루어질 수 있다. 부호의 설명1: 물품 재활용 관리시스템 10: 제조유닛 11: 제조통신부 12: 제조제어부 20: 재활용유닛 21: 재활용통신부 22: 식별코드인식부 23: 식별칩인식부 24: 카메라 241: 제1카메라 242: 제2카메라 243: 제3카메라 25: 재활용제어부 30: 제조단말기 31: 제조단말통신부 32: 제조단말디스플레이부 33: 제조단말입력부 34: 제조단말스피커 35: 제조단말마이크 36: 제조단말카메라 37: 제조단말제어부 40: 재활용단말기도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2023-0082143", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 물품 재활용 관리시스템의 물품 재활용 동작도이다. 도 2는 물품 재활용 관리시스템의 전체 제어블록도이다. 도 3은 제조유닛과 재활용유닛의 제어블록도이다. 도 4는 제조유닛의 상세 제어블록도이다."}
