{"patent_id": "10-2019-0096914", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0017525", "출원번호": "10-2019-0096914", "발명의 명칭": "거리 추정 장치 및 이의 동작 방법", "출원인": "삼성전자주식회사", "발명자": "이상준"}}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 카메라를 포함하는 거리 추정 장치의 동작 방법에 있어서, 적어도 하나의 카메라를 통해 획득한 이미지에 기반하여, 타겟 차량에 대한 바운딩 박스(bounding box)를 획득하는 단계;상기 타겟 차량과의 제1 직선 거리를 획득하는 단계;상기 제1 직선 거리 및 상기 바운딩 박스의 너비(width)에 기반하여 제1 월드-폭(world-width)를 획득하는단계;미리 설정된 제1 비율에 기반하여 상기 바운딩 박스의 영역 중 상기 타겟 차량의 후면에 상응하는 영역에 대한제2 비율을 획득하는 단계;상기 제2 비율에 기반하여 상기 타겟 차량의 제2 월드-폭을 계산하는 단계를 포함하고,상기 제1 비율은, 상기 타겟 차량의 측면 및 후면의 비율을 지시하는 것을 특징으로 하는 거리 추정 장치의 동작 방법."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 동작 방법은,상기 제2 월드-폭의 값이 미리 정의된 최소 월드-폭보다 작거나, 또는 미리 정의된 최대 월드-폭을 초과하는지여부를 판단하는 단계를 더 포함하는 거리 추정 장치의 동작 방법."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 동작 방법은,상기 제2 월드-폭이 상기 미리 정의된 최소 월드-폭보다 작은 경우, 상기 제2 월드-폭의 값을 상기 미리 정의된최소 월드-폭의 값으로 변경하고, 상기 제2 월드-폭이 상기 미리 정의된 최대 월드-폭을 초과하는 경우, 상기제2 월드-폭의 값을 상기 미리 정의된 최대 월드-폭의 값으로 변경하는 단계를 더 포함하는 것을 특징으로 하는거리 추정 장치의 동작 방법."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 동작 방법은,상기 제2 월드-폭의 값이 상기 미리 정의된 최소 월드-폭의 값 또는 상기 미리 정의된 최대 월드-폭의 값으로변경된 경우, 상기 변경된 제2 월드-폭 값에 기반하여 상기 제2 비율을 계산하는 단계를 더 포함하는 것을 특징으로 하는 거리 추정 장치의 동작 방법."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 직선 거리 및 상기 제1 월드-폭은, 상기 타겟 차량이 전방(front)에 위치하는 경우에 기반하여 결정되는 것을 특징으로 하는 거리 추정 장치의 동작 방법.공개특허 10-2021-0017525-3-청구항 6 제1항에 있어서, 상기 제1 직선 거리는, 상기 적어도 하나의 카메라가 지면으로부터 이격된 수직 거리, 상기 적어도 하나의 카메라의 초점 거리 및 상기바운딩 박스 중 하단으로부터 소실점(vanishing point)까지 수직 거리에 기반하여 결정되는 것을 특징으로 하는거리 추정 장치의 동작 방법."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제1 월드-폭은,상기 초점 거리, 상기 바운딩 박스의 너비, 상기 제1 직선 거리에 기반하여 결정되는 것을 특징으로 하는 거리추정 장치의 동작 방법."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 적어도 하나의 카메라의 광축(optical axis)이 상기 바운딩 박스의 좌우 범위 내에 포함되는 경우, 상기타겟 차량과 상기 거리 추정 장치는 동일 차선(ego-lane)에 위치하는 것을 특징으로 하는 거리 추정 장치의 동작 방법."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 동작 방법은,상기 획득된 이미지에 기반하여, 제1 차량 유형 및 제2 차량 유형 중 상기 타겟 차량에 정합하는 차량 유형을식별하는 단계; 및식별된 차량 유형에 매핑된 측면 및 후면의 비율 값을 제1 비율의 값으로 변경하는 단계를 더 포함하고, 상기 제1 차량 유형에 따른 측면 및 후면의 비율 값과 상기 제2 차량 유형에 따른 측면 및 후면의 비율 값은 서로 상이한 것을 특징으로 하는 거리 추정 장치의 동작 방법."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 동작 방법은,상기 제2 비율에 기반하여, 상기 바운딩 박스 중 상기 타겟 차량의 후면 영역이 차지하는 픽셀의 너비를 획득하는 단계;상기 획득한 픽셀의 너비, 상기 초점 거리 및 상기 제2 월드-폭에 기반하여 상기 거리 추정 장치와 상기 타겟차량간에 거리 중 전방 성분의 거리를 획득하는 단계를 더 포함하는 것을 특징으로 하는 거리 추정 장치의 동작방법."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "거리 추정 장치에 있어서, 타겟 차량과 관련된 이미지를 획득하는 적어도 하나의 카메라; 및 타겟 차량에 대한 바운딩 박스(bounding box)를 획득하고, 상기 타겟 차량과의 제1 직선 거리를 획득하고, 상기제1 직선 거리 및 상기 바운딩 박스의 너비(width)에 기반하여 제1 월드-폭(world-width)를 획득하고, 미리 설정된 제1 비율에 기반하여 상기 바운딩 박스의 영역 중 상기 타겟 차량의 후면에 상응하는 영역에 대한 제2 비공개특허 10-2021-0017525-4-율을 획득하고, 상기 제2 비율에 기반하여 상기 타겟 차량의 제2 월드-폭을 계산하는 이미지 신호 프로세서를포함하고, 상기 제1 비율은, 상기 타겟 차량의 측면 및 후면의 비율을 지시하는 것을 특징으로 하는 거리 추정 장치."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 이미지 신호 프로세서는,상기 제2 월드-폭의 값이 미리 정의된 최소 월드-폭보다 작거나, 또는 미리 정의된 최대 월드-폭을 초과하는지여부를 더 판단하는 것을 특징으로 하는 거리 추정 장치."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 이미지 신호 프로세서는,상기 제2 월드-폭의 값이 미리 정의된 최소 월드-폭보다 작거나, 또는 미리 정의된 최대 월드-폭을 초과하는지여부를 더 판단하는 것을 특징으로 하는 거리 추정 장치."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 이미지 신호 프로세서는,상기 제2 월드-폭의 값이 상기 미리 정의된 최소 월드-폭의 값 또는 상기 미리 정의된 최대 월드-폭의 값으로변경된 경우, 상기 변경된 제2 월드-폭 값에 기반하여 상기 제2 비율을 더 계산하는 것을 특징으로 하는 거리추정 장치."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 제1 직선 거리 및 상기 제1 월드-폭은, 상기 타겟 차량이 전방(front)에 위치하는 경우에 기반하여 결정되는 것을 특징으로 하는 거리 추정 장치."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 이미지 신호 프로세서는, 상기 적어도 하나의 카메라가 지면으로부터 이격된 수직 거리, 상기 적어도 하나의 카메라의 초점 거리 및 상기바운딩 박스 중 하단으로부터 소실점(vanishing point)까지 수직 거리에 기반하여 상기 제1 직선 거리를 결정하고,상기 초점 거리, 상기 바운딩 박스의 너비, 상기 제1 직선 거리에 기반하여 상기 제1 월드-폭을 결정하는 것을특징으로 하는 거리 추정 장치."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 이미지 신호 프로세서는, 상기 적어도 하나의 카메라의 광축(optical axis)이 상기 바운딩 박스의 좌우 범위 내에 포함되는 경우, 상기타겟 차량과 상기 거리 추정 장치는 동일 차선(ego-lane)에 위치하는 것으로 결정하는 것을 특징으로 하는 거리추정 장치.공개특허 10-2021-0017525-5-청구항 18 제11항에 있어서, 상기 이미지 신호 프로세서는,상기 획득된 이미지에 기반하여, 제1 차량 유형 및 제2 차량 유형 중 상기 타겟 차량에 정합하는 차량 유형을식별하고, 식별된 차량 유형에 매핑된 측면 및 후면의 비율 값을 제1 비율의 값으로 변경하고, 상기 제1 차량 유형에 따른 측면 및 후면의 비율 값과 상기 제2 차량 유형에 따른 측면 및 후면의 비율 값은 서로 상이한 것을 특징으로 하는 거리 추정 장치."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서,상기 이미지 신호 프로세서는,상기 제2 비율에 기반하여, 상기 바운딩 박스 중 상기 타겟 차량의 후면 영역이 차지하는 픽셀의 너비를 획득하고, 상기 획득한 픽셀의 너비, 상기 초점 거리 및 상기 제2 월드-폭에 기반하여 상기 거리 추정 장치와 상기 타겟 차량간에 거리 중 전방 성분의 거리를 획득하는 것을 특징으로 하는 거리 추정 장치."}
{"patent_id": "10-2019-0096914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "호스트 차량 장치에 있어서, 타겟 차량과 관련된 이미지를 획득하는 적어도 하나의 카메라;타겟 차량에 대한 바운딩 박스(bounding box)를 획득하고, 상기 타겟 차량과의 제1 직선 거리를 획득하고, 상기제1 직선 거리 및 상기 바운딩 박스의 너비(width)에 기반하여 제1 월드-폭(world-width)를 획득하고, 미리 설정된 제1 비율에 기반하여 상기 바운딩 박스의 영역 중 상기 타겟 차량의 후면에 상응하는 영역에 대한 제2 비율을 획득하고, 상기 제2 비율에 기반하여 상기 타겟 차량의 제2 월드-폭을 계산하고, 상기 제2 월드-폭 및 상기 제2 비율에 기반하여, 상기 타겟 차량과의 전방 거리 및 측방 거리를 추정하는 이미지 신호 프로세서; 및 상기 측정된 전방 거리 및 측방 거리에 기반하여, 상기 호스트 차량의 속도를 증가하거나, 감소시키는 차량 제어부를 포함하는 것을 특징으로 하는 호스트 차량 장치."}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "거리 추정 장치의 동작 방법이 개시된다. 본 개시의 예시적 실시예에 따른 거리 추정 장치의 동작 방법은, 적어 도 하나의 카메라를 통해 획득한 이미지에 기반하여, 타겟 차량에 대한 바운딩 박스(bounding box)를 획득하는 단계, 상기 타겟 차량과의 제1 직선 거리를 획득하는 단계, 상기 제1 직선 거리 및 상기 바운딩 박스의 너비 (width)에 기반하여 제1 월드-폭(world-width)를 획득하는 단계, 미리 설정된 제1 비율에 기반하여 상기 바운딩 박스의 영역 중 상기 타겟 차량의 후면에 상응하는 영역에 대한 제2 비율을 획득하는 단계, 상기 제2 비율에 기 반하여 상기 타겟 차량의 제2 월드-폭을 계산하는 단계를 포함하고, 상기 제1 비율은, 상기 타겟 차량의 측면 및 후면의 비율을 지시하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 기술적 사상은 거리 추정 장치 및 이의 동작 방법에 관한 것으로, 보다 구체적으로는, 카메라를 이용 하여 전방 차량과의 거리를 추정하는 장치 및 이의 동작 방법에 관한 것이다."}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이미지 센서(image sensor)를 사용하는 영상 촬영 장치는, 스마트 폰, PC, 감시용 카메라, 그리고 자동차 등과 같은 다양한 유형의 전자 장치에 포함되거나, 하나의 독립된 전자 장치로 사용될 수 있다. 자율 주행이 가능한 차량에 있어서, 이미지 센서를 통해 주변 차와의 거리를 인식하고, 이에 따라 차량을 제어 함으로써 안전한 주행을 수행할 수 있다. 다만, 주변 차량을 인식함에 있어서, 차량의 후미등(tail light), 번호판 등과 같은 특징 정보에 의존하는 경우 가 많아, 기상 악화 또는 교통 상황에 따라 특징 정보가 가려지는 경우(occlusion), 주변 차량을 인식하는데 어 려움이 있어, 이를 인식하고, 주변 차량과의 정확한 거리를 추정할 필요성이 증대되고 있다."}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 기술적 사상은 타겟 차량(target vehicle)에 대한 바운딩 박스(bounding box) 중 타겟 차량의 후면 영역의 비율을 계산하고, 계산된 후면 영역의 비율에 기반하여 타겟 차량과의 직선 거리 및 측면 거리를 정확하 게 측정할 수 있는 거리 추정 장치 및 이의 동작 방법을 제공할 수 있다."}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여, 본 개시의 기술적 사상의 일 측면에 따른 거리 추정 장치의 동작 방법은, 적어도 하나의 카메라를 통해 획득한 이미지에 기반하여, 타겟 차량에 대한 바운딩 박스(bounding box)를 획득 하는 단계, 상기 타겟 차량과의 제1 직선 거리를 획득하는 단계, 상기 제1 직선 거리 및 상기 바운딩 박스의 너 비(width)에 기반하여 제1 월드-폭(world-width)를 획득하는 단계, 미리 설정된 제1 비율에 기반하여 상기 바운 딩 박스의 영역 중 상기 타겟 차량의 후면에 상응하는 영역에 대한 제2 비율을 획득하는 단계, 상기 제2 비율에 기반하여 상기 타겟 차량의 제2 월드-폭을 계산하는 단계를 포함하고, 상기 제1 비율은, 상기 타겟 차량의 측면 및 후면의 비율을 지시하는 것을 특징으로 할 수 있다. 상기와 같은 목적을 달성하기 위하여, 본 개시의 기술적 사상의 일 측면에 따른 거리 추정 장치는, 타겟 차량과 관련된 이미지를 획득하는 적어도 하나의 카메라, 및 타겟 차량에 대한 바운딩 박스(bounding box)를 획득하고, 상기 타겟 차량과의 제1 직선 거리를 획득하고, 상기 제1 직선 거리 및 상기 바운딩 박스의 너비(width)에 기반 하여 제1 월드-폭(world-width)를 획득하고, 미리 설정된 제1 비율에 기반하여 상기 바운딩 박스의 영역 중 상 기 타겟 차량의 후면에 상응하는 영역에 대한 제2 비율을 획득하고, 상기 제2 비율에 기반하여 상기 타겟 차량 의 제2 월드-폭을 계산하는 이미지 신호 프로세서를 포함하고, 상기 제1 비율은, 상기 타겟 차량의 측면 및 후 면의 비율을 지시하는 것을 특징으로 할 수 있다. 상기와 같은 목적을 달성하기 위하여, 본 개시의 기술적 사상의 일 측면에 따른 호스트 차량 장치는, 타겟 차량 과 관련된 이미지를 획득하는 적어도 하나의 카메라, 타겟 차량에 대한 바운딩 박스(bounding box)를 획득하고, 상기 타겟 차량과의 제1 직선 거리를 획득하고, 상기 제1 직선 거리 및 상기 바운딩 박스의 너비(width)에 기반 하여 제1 월드-폭(world-width)를 획득하고, 미리 설정된 제1 비율에 기반하여 상기 바운딩 박스의 영역 중 상 기 타겟 차량의 후면에 상응하는 영역에 대한 제2 비율을 획득하고, 상기 제2 비율에 기반하여 상기 타겟 차량 의 제2 월드-폭을 계산하고, 상기 제2 월드-폭 및 상기 제2 비율에 기반하여, 상기 타겟 차량과의 전방 거리 및 측방 거리를 추정하는 이미지 신호 프로세서, 및 상기 측정된 전방 거리 및 측방 거리에 기반하여, 상기 호스트 차량의 속도를 증가하거나, 감소시키는 차량 제어부를 포함하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 예시적 실시예에 따른 거리 추정 장치는, 카메라를 통해 검출된 타겟 차량의 바운딩 박스 중에서 후 면 영역의 비율을 이용하여 타겟 차량과의 거리를 추정함으로써, 타겟 차량과의 거리를 추정하는 데에 정확성을 향상시킬 수 있다."}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 개시의 예시적 실시예들에 대하여 상세히 설명하기로 한다. 상세한 설명에 앞 서, 용어들을 정리하면 하기와 같다. 호스트 차량(host vehicle)은, 본 개시의 예시적 실시예들에 따른 거리 추정 장치가 임베디드(embedded)된 차량 (vehicle)을 지칭할 수 있다. 상기 호스트 차량은, 에고-비히클(ego-vehicle), 셀프-비히클(self-vehicle), 자 율주행 차량(autonomous driving vehicle)을 포함한 다양한 용어들로 지칭될 수 있다. 타겟 차량(target vehicle)은 상기 호스트 차량을 제외한 나머지 차량들 중 적어도 하나의 차량을 지칭할 수 있 다. 구체적으로, 타겟 차량은 본 개시의 예시적 실시예에 따른 거리 추정 장치에 포함되는 카메라에 의해 캡쳐 (capture)되고, 거리 추정의 대상이 되는 차량을 지칭할 수 있다. 이미지 플레인(image plane)은 실제 세계(world)가 거리 추정 장치의 카메라를 통해 투영(projection)되는 2차 원의 영역을 지칭할 수 있다. 이미지 플레인은 2차원의 영역이므로, 픽셀 단위로 구별되는 좌표계(coordinate) 를 가질 수 있다. 상기 좌표계는 이미지 좌표계(image coordinate)로 지칭될 수 있다. 예를 들어, 이미지 플레 인의 좌측 상단을 원점(origin)으로 설정하는 경우, 우측 방향은 x축으로, 아래 방향은 y축으로 표현될 수 있다. 월드 좌표계(world coordinate)는 거리 추정 장치의 카메라 외부 환경에 대응하는 실제 세계를 표현하기 위한 좌표계를 지칭할 수 있다. 다양한 실시예들에 따라, 거리 추정 장치의 카메라를 원점(origin)으로 설정하는 경 우, 카메라 좌표계(camera coordinate)로 지칭될 수도 있다. 카메라 좌표계 또는 거리 추정 장치의 카메라를 원 점으로 하는 월드 좌표계는 x축, y축 및 z축을 가질 수 있다. 예를 들어, x축은 카메라가 응시하는 정면(front) 방향에 대응될 수 있고, y축은 카메라의 정면을 기준으로 왼쪽(left) 방향에 대응될 수 있고, z축은 카메라의 정면을 기준으로 위쪽(upper) 방향에 대응될 수 있다. 전장(full length)은 차량의 전후 길이를 지칭할 수 있다. 즉, 전장은 타겟 차량을 측면 방향에서 응시하였을 때, 수평 길이를 지시할 수 있다. 전폭(full width)은 차량의 좌우 길이를 지칭할 수 있다. 즉, 전폭은 타겟 차량을 후면 방향에서 응시하였을 때, 수평 길이를 지시할 수 있다. 전고는 차량의 상하 길이를 지칭할 수 있다. 즉, 전고는 차량과 접촉하는 지면(ground)부터 차량의 상부 커버 (cover)까지의 수직 길이를 지시할 수 있다. 일 예로, 거리 추정 장치의 카메라가 차량의 상부 커버에 배치될 수 있으며, 이 경우, 카메라의 고도(height)는 전고에 대응될 수 있다. 월드-폭(world-width)은 월드 좌표계에서 타겟 차량의 전폭에 대응될 수 있다. 또는, 월드-폭은 월드 좌표계에 서 타겟 차량의 후면 영역의 가로 길이를 지칭할 수도 있다. 픽셀-폭(pixel width)는 이미지 플레인에 투영된 타겟 차량의 가로 길이를 지칭할 수 있다. 예를 들어, 카메라 의 정면 방향에 타겟 차량이 위치하는 경우, 픽셀-폭은 타겟 차량의 후면에 대한 이미지의 가로 길이를 지칭할 수 있다. 다른 예를 들어, 카메라의 정면 방향으로부터 일정 각도만큼 벗어난 측면에 타겟 차량이 위치하는 경 우, 픽셀-폭은 타겟 차량의 후면과 타겟 차량의 측면을 모두 포함하는 이미지의 가로 길이를 지칭할 수 있다. 도 1은 본 개시의 예시적 실시예에 따른 거리 추정 장치의 블록도이다. 도 1을 참조하면, 거리 추정 장치는 카메라 및 이미지 신호 프로세서(image signal processor, ISP)를 포함할 수 있다. 카메라는 호스트 차량에 임베디드되어, 호스트 차량의 외부 환경을 인식할 수 있다. 예를 들어, 카메라 는 전방 또는 여러 방향의 외부 환경에 대한 빛을 전기적 에너지로 변환하여 이미지를 생성하고, 이미지 신호 프로세서에게 전달할 수 있다. 카메라는 전자 장치에 내장(embedded)되거나 또는 전자 장치로 구현될 수 있다. 전자 장치는 예를 들어, PC(personal computer), IoT (Internet of Things) 장치, 또는 휴대 용 전자 기기로 구현될 수 있다. 휴대용 전자 기기는, 랩탑 컴퓨터, 이동 전화기, 스마트폰, 태블릿 PC, PDA(personal digital assistant), EDA(enterprise digital assistant), 디지털 스틸 카메라, 디지털 비디오 카메라, 오디오 장치, PMP(portable multimedia player), PND(personal navigation device), MP3 플레이어, 휴대용 게임 콘솔(handheld game console), e-북(e-book), 웨어러블 기기 등일 수 있다. 이미지 신호 프로세서는 카메라로부터 획득한 이미지에 기초하여, 호스트 차량의 주변 차량들을 인식 하고, 주변 차량들과의 거리를 추정할 수 있다. 예를 들어, 이미지 신호 프로세서는 획득한 이미지에 포함 된 다수의 오브젝트들 중에서, 차량을 인식하고, 인식된 차량을 표시하는 바운딩 박스를 생성할 수 있다. 또한, 이미지 신호 프로세서는 바운딩 박스에 포함되는 차량의 후면에 대한 이미지의 비율을 계산하고, 이에 기 반하여 바운딩 박스에 포함되는 차량과의 거리를 추정할 수도 있다. 이에 대한 구체적인 기재는 후술하기로 한 다. 도 2는 본 개시의 예시적 실시예에 따른 거리 추정 장치를 포함하는 호스트 차량의 측면도이다. 도 1과 중복되 는 기재는 생략하기로 한다. 도 1 및 도 2를 참조하면, 호스트 차량은 거리 추정 장치 및 차량 제어부를 포함할 수 있다. 차량 제어부는 호스트 차량의 전반적인 주행을 제어할 수 있다. 예를 들어, 거리 추정 장치로부터 수 신된 직선 거리를 지시하는 정보를 수신하고, 이에 기반하여 호스트 차량의 속도를 제어할 수 있다. 상기 직선 거리는 타겟 차량과 호스트 차량간에 거리를 지칭할 수 있다. 예를 들어, 직선 거리는 월드 좌표계에 서 x축 성분으로 표현될 수 있다. 차량 제어부는 타겟 차량과의 직선 거리가 임계 거리 이하인 것을 식별 할 수 있다. 차량 제어부는 임계 거리 이하의 직선 거리를 식별함에 응답하여, 호스트 차량의 속도를 감소시키기 위한 제어를 수행할 수 있다. 이를 위하여, 차량 제어부는 감속을 지시하는 제어 신호를 생성 하고, 브레이크 시스템에게 제어 신호를 전달할 수 있다. 도 3은 본 개시의 예시적 실시예에 따른 거리 추정 장치에 투영되는 타겟 차량에 대한 이미지의 일 예를 도시한 다. 도 3을 참조하면, 거리 추정 이미지는 적어도 하나의 타겟 차량을 포함할 수 있다. 설명의 편의를 위하여, 타겟 차량을 기준으로 설명하기로 한다. 다만, 이에 제한되는 것은 아니며, 복수의 타겟 차량들 각각에 대 하여 거리 추정이 독립적으로 수행될 수 있음은 자명할 것이다. 일 실시예에 따라, 타겟 차량은 호스트 차량의 정면 방향에 위치할 수 있다. 즉, 거리 추정 이미지 에 포함되는 타겟 차량은 타겟 차량의 후면 이미지에 대응될 수 있다. 다양한 실시예들에 따라, 바운딩 박스가 생성될 수 있다. 바운딩 박스는 특정한(specific) 오브젝트 나 객체의 위치 정보를 포함하는 사각형 형상의 영역을 지칭할 수 있다. 타겟 차량을 검출하는 경우, 바운 딩 박스는 타겟 차량을 적어도 포함하는 영역으로 표시될 수 있다. 예를 들어, 바운딩 박스는 4 개의 엣지로 표현될 수 있다. 4개의 엣지는, 바텀 엣지(bottom edge), 탑 엣지(top edge), 왼쪽 엣지(left edge), 오른쪽 엣지(right edge)를 포함할 수 있다. 바운딩 박스는 영상처리, 패턴인식, 기계학습(machine learning), 딥러닝(deep learning)을 포함하는 객체 검출 알고리즘에 기반하여 형성될 수 있다. 일 실시예에 따 라, 타겟 차량의 개수는 하나에 제한되지 않으므로, 바운딩 박스의 개수 또한 복수 개일 수 있다. 거리 추정 이미지는 복수의 차선(lane)들을 포함할 수 있다. 복수의 차선들 각각은 서로 평행 (parallel)할 수 있다. 월드 좌표계에서 평행한 선들이 이미지 플레인에 투영되는 경우, 평행한 선들은 하 나의 점(point)에서 모일 수 있다. 평행한 선들이 모이는 하나의 점은 소실점(vanishing point)으로 지칭 될 수 있다. 다양한 실시예들에 따라, 타겟 차량의 크기는 카메라와 타겟 차량간에 물리적 거리에 기반하여 변경 될 수 있다. 예를 들어, 타겟 차량이 카메라로부터 멀어질수록 소실점에 가까워지므로 거리 추 정 이미지에 투영된 객체의 크기는 작아질 수 있다. 다른 예를 들어, 타겟 차량이 카메라에 가 까워질수록 소실점으로부터 멀어지므로, 거리 추정 이미지에 투영되는 객체의 크기는 증가될 수 있다. 도 4는 본 개시의 예시적 실시예에 따른 거리 추정 장치 및 타겟 차량을 포함하는 월드 좌표계의 일 예를 도시 한다. 도 4를 참조하면, 타겟 차량의 형상이 카메라의 렌즈를 통해 이미지 센서에 입사될 수 있 다. 예를 들어, 카메라를 월드 좌표계의 원점(origin)으로 설정하는 경우, 타겟 차량은 렌즈로 부터 x축으로 초기 직선 거리 Z만큼 선행할 수 있다. 초기 직선 거리 Z를 나타내면 수학식 1과 같다.수학식 1"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, f는 카메라의 고유 파라미터(intrinsic parameter)로서, 초점 거리에 상응하고, Hc는 렌즈의 고도 (height)에 상응할 수 있다. 는 이미지 플레인 상에서 소실점과 타겟 차량의 바운딩 박스 중 바텀 엣지간에 픽셀 거리에 상응할 수 있다. 렌즈는 지면으로부터 Hc 만큼 이격되어 배치될 수 있다. 예를 들어, 카메라가 호스트 차량(도 2 의 호스트 차량)의 상부 커버상에 배치되는 경우, 상기 일정 거리는 호스트 차량(도 2의 호스트 차량 )의 전고에 대응될 수 있다. 다만 이에 제한되는 것은 아니며, 다른 예를 들어, 카메라가 호스트 차 량의 내부에 배치되는 경우, 상기 일정 거리는 전고보다 작은 값에 대응될 수 있다. 이미지 센서는 카메라의 렌즈를 통해 입사광을 수신하고, 이미지 플레인(예를 들어, 도 3의 거 리 추정 이미지)을 생성할 수 있다. 예를 들어, 카메라가 핀홀(pinhole) 카메라인 경우, 타겟 차량 의 상하 반전된 이미지가 투영될 수 있다. 상하 반전된 이미지는 타겟 차량에 대한 바운딩 박스(32 0)로 표시될 수 있다. 렌즈는 이미지 센서와 물리적으로 이격될 수 있다. 상기 이격된 거리는 초점 거리 f에 대응될 수 있다. 렌즈의 광 축(optical axis)을 따라 입사되는 빛은 도 3의 소실점을 형성할 수 있다. 즉, 도 3 의 소실점의 y축 성분의 크기는, 렌즈의 고도(height)에 따라 결정될 수 있다. 다양한 실시예들에 따라, Hc는 하기의 수학식 2와 같이 표현될 수 있다. 수학식 2"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, R은 회전 매트릭스(rotation matrix)를 지칭하고, t는 전달 벡터(translation vector)를 지칭할 수 있 다. 은 벡터의 세 번째 엘리먼트를 나타낼 수 있다. 다양한 실시예들에 따라, 상기 수학식 1에 기반하여 거리를 추정하는 방법은 고도 기반 방법(height based method)으로 지칭될 수 있다. 다만, 고도 기반 방법은 호스트 차량과 타겟 차량이 동일 평면 상에서 주행하는 가정을 포함하기 때문에, 실제 주행 환경에 적용하기에 오차를 야기할 수 있다. 따라서, 이미지 플레 인에서 표시되는 바운딩 박수의 픽셀 폭과 월드 좌표계에서 타겟 차량의 전폭의 관계에 기반한 방법을 후술하기 로 한다. 도 5는 본 개시의 예시적 실시예에 따른 버드아이 뷰(bird eye view)의 일 예를 도시한다. 도 5를 참조하면, 카메라에 포함되는 렌즈와 이미지 센서 및 타겟 차량이 도시된다. 도 5 는 카메라와 타겟 차량을 위에서 내려다 본 상황을 도시한 것으로, 도 3 내지 도 4와 중복되는 내용은 생 략하기로 한다. 다양한 실시예들에 따라, 타겟 차량은 직선 거리(Z)만큼 호스트 차량에 선행할 수 있다. 타겟 차량 과 호스트 차량이 동일한 차선을 따라 주행하는 경우, 직선 거리(Z)는 하기의 수학식 3을 이용하여 계산될 수 있다. 수학식 3"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, f는 초점 거리를 지칭할 수 있고, W는 타겟 차량의 월드-폭을 지칭하고, w는 이미지 플레인에서 생성된 바운딩 박스의 픽셀-폭을 지칭할 수 있다. 다양한 실시예들에 따라, 상기 수학식 3을 이용하여 직선 거리를 추정하는 방법은 폭 기반 방법(width based method)으로 지칭될 수 있다. 다만, 타겟 차량이 동일 차선을 따라 주행하지 않고, 이웃하는 차선을 따라 동일한 방향으로 주행하는 경우, 바운딩 박스는 타겟 차량의 후면에 대한 이미지뿐만 아니라, 타겟 차량의 측면에 대한 이미지를 모두 포함할 수 있다. 즉, 바운딩 박스의 픽셀-폭은 타겟 차량의 후면에 대한 월드-폭에 완전히 매핑되지 않으며, 적어도 일부 길이는 타겟 차량의 측면에 대한 픽셀 길이 를 포함할 수 있다. 또한, 타겟 차량과 호스트 차량간에 직선 거리에 따라 바운딩 박스 중 타겟 차량의 측면에 대한 이미지와 타겟 차량의 후면에 대한 이미지의 비율이 상이해질 수 있다. 예를 들어, 이웃하는 차선을 따라 주행하는 타겟 차량이라도 직선 거리가 충분히 큰 경우, 즉 호스트 차량으로부터 전방으로 멀리 떨어져 있는 경우, 바운딩 박스의 크기는 작아질 수 있으나, 바운딩 박스 중 타겟 차량의 측면 에 대한 이미지는 충분히 감소될 수 있다. 다른 예를 들어, 이웃하는 차선을 따라 주행하는 타겟 차량과 직선 거리가 작은 경우, 즉 호스트 차량과 거의 나란히 주행할 수 있다. 이 경우, 카메라를 통해 획 득한 이미지의 바운딩 박스의 크기는 크지만, 바운딩 박스 중 타겟 차량의 측면에 대한 이미지 의 비율은 타겟 차량의 후면에 대한 이미지의 비율보다 충분히 클 수 있다. 즉, 바운딩 박스는 타겟 차량의 측면에 대한 이미지만을 포함할 수도 있다. 이웃하는 차선을 따라 주행중인 타겟 차량의 월드 -폭을 획득하기 위한 구체적인 방법은 후술하기로 한다. 도 6a은 본 개시의 예시적 실시예에 따른 버드아이 뷰의 다른 예를 도시한다. 도 6a은 호스트 차량과 타겟 차량을 위에서 내려다 본 상황을 도시한 것으로, 도 3 내지 도 5와 중복 되는 내용은 생략하기로 한다. 도 6a을 참조하면, 동일한 방향을 따라 주행하는 호스트 차량 및 타겟 차량이 개시된다. 타겟 차량 은 호스트 차량에 대하여, 전방으로 Z0만큼 선행(proceeding)하며, 호스트 차량에 대하여 왼쪽 으로 이웃하는 차선을 따라 주행하는 것으로 이해될 수 있다. 수학식 1을 참조하여, 직선 거리 Z0를 표현하면, 하기의 수학식 4, 수학식 5와 같다. 수학식 4"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 5"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "다양한 실시예들에 따라, w0는 타겟 차량에 대한 바운딩 박스의 픽셀-폭을 지칭할 수 있고, W0는 바운 딩 박스에 대응하는 월드 좌표계의 월드-폭을 지칭할 수 있다. 기하학적(geometrical) 비례 관계를 도시하면 하기의 수학식 6과 같으며, 호스트 차량에게 투영되는 타겟 차량에 대한 월드-폭은 수학식 7과 같 이 표현될 수 있다. 수학식 6"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 7"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "다양한 실시예들에 따라, 호스트 차량은 카메라를 통해 획득된 이미지에 기반하여 타겟 차량과 동일한 차선에서 주행 중인지 또는 이웃하는 차선에서 주행 중인지 여부를 결정할 수 있다. 도 3의 광 축을 따 라 입사되는 광을 이미지 좌표계에서 표시하는 경우, 카메라를 통해 획득된 이미지의 x축 센터(center)에 대응될 수 있다. 는 상기 x축 센터와 바운딩 박스의 좌측 엣지 또는 우측 엣지까지의 픽셀 거리 중 작은 값으로 정의될 수 있다. 예를 들어, 타겟 차량이 전방 좌측에서 주행중인 경우, 바운딩 박스 는 카메라를 통해 획득된 이미지의 우측에 생성될 수 있으며, 따라서, 는 x축 센터로부터 바운 딩 박스의 좌측 엣지까지의 픽셀 거리에 대응될 수 있다. 다른 예를 들어, 타겟 차량이 전방 우측에 서 주행중인 경우, 바운딩 박스는 카메라를 통해 획득된 이미지의 좌측에 생성될 수 있으며, 는 x축 센터로부터 바운딩 박스의 우측 엣지까지의 픽셀 거리에 대응될 수 있다. 다만, 타겟 차량이 호 스트 차량과 동일한 차선의 전방에서 주행중인 경우, 바운딩 박스는 카메라에 의해 획득된 이미 지의 센터 근방에 생성될 수 있다. 즉, x축 센터는 바운딩 박스의 좌측 엣지와 우측 엣지 사이 에 위치할 수 있고, 이 경우, 는 0으로 정의될 수 있다. 따라서, 호스트 차량은 카메라에 의해 획득된 이미지 내의 바운딩 박스와 x축 센터의 위치를 비교함으로써 가 0인 경우, 타겟 차량은 동일한 차선의 전방에서 주행 중임을 판단할 수 있고, 가 0이 아닌 경우, 타겟 차량이 이웃하는 차선 의 전방에서 주행 중임을 판단할 수 있다. 또한, 타겟 차량이 호스트 차량과 동일한 차선의 전방에서 주행중인 경우, 바운딩 박스는 타겟 차량의 후방에 대한 이미지만을 포함할 수 있다. 바운딩 박스 중에서 타겟 차량의 후면에 대한 이미지가 가지는 폭의 비율을 라고 정의하는 경우, 가 0인 경우, 는 1에 대응될 수 있다. 호스트 차량 은 타겟 차량에 후행하며 타겟 차량의 후면에 대한 이미지만을 획득하기 때문이다. 다만, 가 0이 아닌 경우, 즉 타겟 차량이 호스트 차량과 이웃하는 차선을 따라 전방에서 주행중 인 경우, 는 1이 될 수 없으며, 0과 1 사이의 임의의 값을 가질 수 있다. 전술한 바에 따르면, 는 바운딩 박스 중 타겟 차량의 후면에 대한 이미지가 가지는 폭의 비율이므로, 타겟 차량의 측면에 대한 이미 지가 가지는 폭의 비율은 1- 대응할 수 있다. 다양한 실시예들에 따라, 타겟 차량의 전장 대비 전폭의 비율을 k라고 정의할 수 있다. 이 경우, 타겟 차 량이 투영된 이미지 중에서 타겟 차량의 후면의 길이에 대응되는 월드-폭과 바운딩 박스에서 타 겟 차량의 후면에 대한 이미지의 폭의 비율 의 비례 관계는 하기의 수학식 8과 같을 수 있다.수학식 8"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "전술한 바에 따르면, 는 x축 센터(광 축)와 바운딩 박스의 좌측 엣지 또는 우측 엣지까지 의 픽셀 거리 중 짧은 거리로 정의하였으므로, 으로 표현할 수 있다. 수학식 8을 정리하면 하기의 수 학식 9와 같이 나타낼 수 있다. 수학식 9"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "다양한 실시예들에 따라, k 값을 임의로 결정하는 경우, 값을 계산할 수 있다. k 값은 타겟 차량의 전 장 대비 전폭의 비율이며, 차량 제조사들에 따라 상이할 수 있다. 표 1 분류 전장[mm] 전폭[mm] k 소형 3595 1595 2.253918 준중형 4550 1775 2.56338 중형 4855 1865 2.603217 중형 SUV 4700 1880 2.5 대형 5155 1935 2.664083 버스 10975 2495 4.398798 냉동탑차 5440 1740 3.126437 트럭 10125 2495 4.058116 표 1을 참조하면, 차량 유형에 따라 전장 대비 전폭의 비율인 k 값은 각각 상이할 수 있으나, 전폭이 최대 2.5m 를 초과하지 않는다는 것을 알 수 있다. 법규에 의해 최대 전폭 및 최소 전폭의 크기가 제한되기 때문이다. 따 라서, 호스트 차량은 k 값을 임의의 값으로 설정할 수 있다. 예를 들어, 호스트 차량은 k 값을 2.5로 설정하고, 값을 계산할 수 있다. 다양한 실시예들에 따라, k 값을 임의의 값으로 고정하고, 값을 계산한 경우, 바운딩 박스의 비례 관계 에 기반하여 타겟 차량의 월드-폭은 하기의 수학식 10과 같이 표현될 수 있다. 수학식 10"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "다양한 실시예들에 따라, 표 1을 참조하면 차량 유형에 따라 k 값의 범위가 상이한 것을 알 수 있다. 예를 들어, 소형, 준중형, 중형, 대형, 중형 SUV를 포함하는 일반 승용차의 경우, k 값의 범위는 2.2 내지 2.7 사이 에 위치함을 알 수 있다. 다만, 트럭이나 버스 냉동 탑차의 경우, k 값은 3.1 내지 4.4 사이에 위치함을 알 수 있다. 따라서, 트럭이나 버스와 같은 특장차에 대하여 일반 승용차에 상응하는 k 값을 적용하는 경우, 타겟 차 량의 인식에 오류가 발생할 수 있고, 이는 자율주행 시스템을 구비한 차량에 있어서 매우 치명적일 수 있다. 따라서, 차량의 유형에 대응되는 적절한 k 값이 설정되었는지 및 적절하지 않는 k 값이 설정된 경우, 이를 보정하 기 위한 수단이 요구될 수 있다. 다양한 실시예들에 따라, k 값의 보정이 필요한지 여부를 판단하기 위하여, 표 1에 도시된 전폭의 범위를 이용 할 수 있다. 즉, 실질적으로 도로의 폭은 제한되어 있는 점, 법규를 통해서 차량의 폭을 제한하고 있는 점을 고 려하면, 적절한 범위의 윌드-폭을 설정함으로써 적절하지 않은 k 값을 이용한 거리 추정을 미연에 방지할 수 있 다. 다양한 실시예들에 따라, 최소 월드-폭 및 최대 월드-폭이 설정될 수 있다. 예를 들어, 상기 표 1을 참조하면, 현재 출시된 차량이 가질 수 있는 최저 전폭인 1595mm를 상기 최저 월드-폭으로 설정하고, 현재 출시된 차량이 가질 수 있는 최대 진폭인 2495mm를 최대 월드-폭으로 설정할 수 있다. 만약, 타겟 차량이 버스 또는 트럭 과 같은 높은 k 값을 가지는 차량임에도 불구하고, 소형차나 중형차의 낮은 k 값을 임의로 설정하여 값 및 월드-폭을 계산하는 경우, 낮은 k 값에 기반하여 계산된 타겟 차량의 월드-폭은 최소 월드-폭보다 작거나 최대 월드-폭을 초과할 수 있다. 타겟 차량이 소형차 또는 중형차임에도 불구하고, 높은 k 값을 설정하는 경우에도 마찬가지이다. 다양한 실시예들에 따라, 이미지 신호 프로세서는 임의의 k 값을 이용하여 타겟 차량의 월드-폭을 계 산하고, 계산된 월드-폭이 최소 월드-폭(Wmin) 내지 최대 월드-폭(Wmax) 사이에 포함되는지 여부를 판단할 수 있 다. 이미지 신호 프로세서는 계산된 월드-폭이 최소 월드-폭보다 크고, 최대 월드-폭보다 작은 경우, 계산 된 월드-폭을 타겟 차량의 월드-폭으로 결정할 수 있다. 다만, 계산된 월드-폭이 최소 월드-폭보다 작거나, 최대 월드-폭보다 큰 경우, k 값을 보정할 필요가 있다고 판단하고, 월드-폭을 업데이트할 것을 지시하 는 신호 또는 k 값을 보정할 것을 지시하는 신호를 생성할 수 있다. 다양한 실시예들에 따라, 이미지 신호 프로세서는 월드-폭을 업데이트할 수 있다. 즉, 계산된 월드-폭이 최소 월드-폭 내지 최대 월드-폭의 범위에 포함되지 않으므로, 계산된 월드-폭을 최소 월드-폭 또는 최대 월드- 폭의 값으로 변경할 수 있다. 예를 들어, 부적절한 k 값에 기반하여 계산된 월드-폭이 3100mm인 경우, 이미지 신호 프로세서는 계산된 월드-폭을 업데이트할 수 있으며, 업데이트되는 값은 최대 월드-폭 값인 2495mm에 대응될 수 있다. 다른 예를 들어, 부적절한 k 값에 기반하여 계산된 월드-폭이 1300mm인 경우, 이미지 신호 프 로세서는 계산된 월드-폭을 업데이트할 수 있으며, 업데이트되는 값은 최소 월드-폭 값인 1595mm에 대응될 수 있다. 일 실시예에 따라, 월드-폭을 최대 월드-폭 값으로 업데이트한 경우, 보정된 k 값은 하기의 수학식 11과 같다. 수학식 11"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "상기 수학식 11은 하기의 수학식 12 및 수학식 13을 통해 유도될 수 있다. 상기 수학식 11에서는 월드-폭을 최 대 월드-폭 값으로 업데이트한 것을 기준으로 도시되어 있으나, 이에 제한되는 것은 아니다. 월드-폭을 최소 월 드-폭 값으로 업데이트한 경우, 수학식 11 중 최대 월드-폭을 최소 월드-폭으로 대체할 수 있다. 수학식 12 수학식 13"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "다양한 실시예들에 따라, 이미지 신호 프로세서는 타겟 차량에 대한 월드-폭의 정보가 없는 경우, 업 데이트 신호를 생성할 수 있다. 즉, 이미지 신호 프로세서는 거리 추정 장치로부터 획득한 이미지에 기반하여 타겟 차량을 검출한 경우, 이전 프레임의 이미지에서 타겟 차량이 검출되었는지 및 최소 월 드-폭 내지 최대 월드-폭 사이의 월드-폭 값이 저장되어 있는지 판단하고, 검출된 타겟 차량에 대한 월드- 폭 값이 존재하지 않는 경우, 업데이트 신호를 생성할 수 있다. 거리 추정 장치는 업데이트 신호에 응답하 여, 월드-폭을 획득하기 위한 동작들을 수행할 수 있다. 이는 도 7에서 후술하기로 한다. 다양한 실시예들에 따라, 이미지 신호 프로세서는 타겟 차량에 대한 전장 대비 전폭의 비율 k와 월드 -폭 W에 대한 정보를 가지고 있는 경우, 바운딩 박스 중 타겟 차량의 후면에 대한 이미지 폭의 비율 를 수학식 14를 이용하여 계산할 수 있다. 수학식 14"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "수학식 14에 따라 를 계산한 경우, 이미지 신호 프로세서는 타겟 차량의 바운딩 박스의 픽셀 너비를 이용하여, 바운딩 박스 중 타겟 차량의 후면에 대응하는 이미지의 폭을 계산할 수 있다. 수학식 15"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "타겟 차량과 호스트 차량은 이웃하는 차선을 따라 주행 중이므로, 타겟 차량과 호스트 차량 간에 거리는 전방 거리의 성분과 측방(lateral) 거리의 성분을 모두 포함할 수 있다. 상기 전방 거리의 성 분은 하기의 수학식 16에 의해 계산될 수 있다. 수학식 16"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "또한, 상기 측방 거리의 성분은 하기의 수학식 17과 같이 표현될 수 있다. 수학식 17"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "상기 수학식 17에서 는 를 이용하여 획득될 수 있다. 수학식 18"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "전술한 실시예들에서, k의 값을 임의의 값으로 설정하는 것을 기준으로 기재하였으나, 이에 제한되는 것은 아니 다. 이미지 신호 프로세서는 이미지 처리(processing)을 통해 검출된 타겟 차량의 유형을 식별할 수 있다. 예를 들어, 식별될 수 있는 차량의 유형은 승용차, 특장차, 버스 등을 포함할 수 있다. 승용차의 경우, 소형차, 중형차, 준중형차, 대형차, 중형 SUV 등을 포함할 수 있고, 특장차의 경우, 트럭, 냉동 탑차 등을 포함 할 수 있다. 이미지 신호 프로세서는 타겟 차량의 유형을 식별하고, 식별된 유형에 따라 미리 설정된 k 값을 설정할 수 있다. 예를 들어, 이미지 신호 프로세서는 식별된 유형이 승용차에 해당하는 경우, k 의 값을 2.2 내지 2.7 사이의 임의의 값으로 설정할 수 있다. 다른 예를 들어, 이미지 신호 프로세서는 식별 된 유형이 특장차 또는 버스인 경우, 3.1 내지 4.5 사이의 임의의 값을 k 값으로 설정할 수 있다. 이미지 신호 프로세서에 의해 타겟 차량의 유형을 식별하고, 식별된 유형에 대응되는 범위의 k 값을 설정하는 경 우, 전술한 최소 월드-폭 내지 최대 월드-폭을 벗어나는 월드-폭이 계산될 가능성이 현저하게 줄어들 수 있다. 도 6b는 본 개시의 예시적 실시예에 따른 버드아이 뷰의 또 다른 예를 도시한다. 도 6b는 호스트 차량과 타겟 차량을 위에서 내려다 본 상황을 도시한 것으로, 도 3 내지 도 6a와 중 복되는 내용은 생략하기로 한다. 도 6b를 참조하면, 타겟 차량의 주행 방향은 호스트 차량의 주행 방향과 상이할 수 있다. 도 6a를 참 조하면, 타겟 차량과 호스트 차량은 서로 이웃하는 차선을 따라 주행하였으나, 주행 방향은 모두 월 드 좌표계의 x축 방향으로 동일하였으나, 도 6b는 주행 방향이 상이할 수 있다. 예를 들어, 호스트 차량이 월드 좌표계의 x축 방향으로 진행하는 동안, 타겟 차량은 음의 y축 방향으로 45만큼 기울어져(tilting) 주 행할 수 있다. 즉, 도 6b는 타겟 차량이 호스트 차량과 동일한 차선으로 진입하기 위하여 차선을 변 경하는 시점에 대응하는 버드아이 뷰일 수 있다. 다양한 실시예들에 따라, 타겟 차량이 주행 각도를 유지하면서 주행하는 경우, 이미지 신호 프로세서(12 0)는 도 6a의 에 상기 주행 각도를 더하거나 뺀 각도를 새로운 로 설정할 수 있다. 이미지 신호 프로세서 는 타겟 차량의 주행 각도로 인하여 변경된 x 값 및 에 기반하여 새로운 를 계산할 수 있다. 타겟 차량과의 전방 거리 및 측방 거리를 획득하기 위한 나머지 동작들은 도 6a와 중복되므로 생략 하기로 한다. 전술한 실시예에서, 타겟 차량의 주행 각도가 변경되는 예를 기준으로 설명하였으나, 이에 제한되는 것은 아니다. 호스트 차량 및/또는 타겟 차량 각각의 주행 각도가 모두 변경되는 경우에도 마찬가지로 적 용될 수 있을 것이다. 도 7은 본 개시의 예시적 실시예에 따른 거리 추정 장치의 동작을 도시하는 순서도이다. 도 7을 참조하면, 이미지 신호 프로세서는 동작 S701에서 타겟 차량의 바운딩 박스를 획득할 수 있다. 바운딩 박스는 기계학습, 딥러닝을 포함하는 인공지능 알고리즘에 의해 수행될 수 있다. 동작 S702에서, 이미지 신호 프로세서는 월드-폭의 값이 알려져 있는지 또는 업데이트 신호가 존재하는지 여부를 판단할 수 있다. 이미지 신호 프로세서는 업데이트 신호를 수신한 경우, 검출된 차량에 대하여 부 적절한 k 값을 이용한 월드-폭을 계산하였음을 결정할 수 있다. 또는, 이미지 신호 프로세서는 바운딩 박 스에 대응하는 타겟 차량의 월드-폭 값이 존재하는지 판단할 수 있다. 이미지 신호 프로세서는 이전 프레임에서 타겟 차량이 존재하였는지 여부를 판단할 수 있다. 이미지 신호 프로세서는 현재 프 레임에서 타겟 차량이 카메라의 시야에 진입하였음을 판단하고, 월드-폭 값이 없음을 결정할 수 있다. 동작 S703에서, 이미지 신호 프로세서는 초기 직선 거리를 계산할 수 있다. 이미지 신호 프로세서는 카메라가 설치된 고도(예를 들어, 전고), 카메라의 초점 거리, 및 바운딩 박스의 바텀 엣지부터 소실점까지 y축의 픽셀 거리간에 기하학적 비례 관계에 기반하여 초기 직선 거리를 계산할 수 있다. 초기 직선 거리는, 타겟 차량과 호스트 차량이 동일한 차선을 따라 주행하는 것을 전제로 포함할 수 있다. 동작 S704에서, 이미지 신호 프로세서는 초기 월드-폭을 계산할 수 있다. 이미지 신호 프로세서는 바 운딩 박스의 가로 픽셀 거리, 카메라의 초점 거리, 동작 S703에서 계산된 초기 직선 거리간에 기하학 적 비례 관계에 기반하여 초기 월드-폭을 계산할 수 있다. 초기 월드-폭은 타겟 차량과 호스트 차량 이 동일한 차선을 따라 주행하는 것을 전제로 포함할 수 있다. 동작 S705에서, 이미지 신호 프로세서는 k 값을 임의의 값으로 설정하고, 이에 기반하여 값을 계산할 수 있다. 여기서, k 값은 타겟 차량의 전장 대비 전폭의 비율을 지칭할 수 있고, 값은 바운딩 박스 중 타겟 차량의 후면에 대한 이미지가 차지하는 폭의 비율을 지칭할 수 있다. 동작 S706에서, 이미지 신호 프로세서는 계산된 값에 기반하여 타겟 차량의 월드-폭을 계산할 수 있다. 동작 S707에서, 이미지 신호 프로세서는 계산된 월드-폭이 최소 월드-폭 내지 최대 월드-폭에 포함되는지 여부를 판단할 수 있다. 최소 월드-폭 내지 최대 월드-폭은 복수의 차량 스펙(spec)들을 참조하여 결정될 수 있 다. 동작 S708에서, 이미지 신호 프로세서는 계산된 월드-폭을 타겟 차량의 월드-폭으로 결정할 수 있다. 이후, 미 도시되었지만, 이미지 신호 프로세서는 계산된 월드-폭을 이용하여 바운딩 박스 중 타겟 차 량의 후면에 대한 이미지가 차지하는 폭의 비율을 통해 타겟 차량과 호스트 차량간에 전방 거리 성분을 획득할 수도 있다. 동작 S709에서, 이미지 신호 프로세서는 최소 월드-폭 또는 최대 월드-폭을 이용하여 값을 다시 계산할 수 있다. 예를 들어, 동작 S706에서 계산된 월드-폭이 최대 월드-폭을 초과하는 경우, 이미지 신호 프로세서 는 계산된 월드-폭의 값을 최대 월드-폭 값으로 설정하고, 값을 계산하고, k 값을 보정할 수 있다. 도 8은 본 개시의 예시적 실시예에 따른 복수의 거리 추정 장치들을 구비하는 호스트 차량의 버드아이 뷰를 도 시한다. 도 8을 참조하면, 호스트 차량은 복수의 거리 추정 장치들을 구비할 수 있다. 예를 들어, 호스트 차량 은 제1 거리 추정 장치 및 제2 거리 추정 장치를 구비할 수 있다. 전술한 실시예에서, 호스트 차량은 2개의 거리 추정 장치들(810, 820)을 구비하는 것으로 도시되었으나, 이에 제한되는 것은 아니다. 다양한 실시예들에 따라, 호스트 차량은 보다 많은 수의 거리 추정 장치들을 구비할 수 있으며, 상기 거리 추정 장치들 각각은 전방의 타겟 차량뿐만 아니라, 측방 및 후방의 이미지들을 획득하도록 배치될 수도 있 다. 다양한 실시예들에 따라, 이미지 신호 프로세서는 제1 거리 추정 장치 및 제2 거리 추정 장치에 의해 각각 획득되는 정보들 중 적어도 하나에 기반하여 타겟 차량과의 전방 거리를 추정할 수 있다. 예를 들어, 이미지 신호 프로세서는 제1 거리 추정 장치 및 제2 거리 추정 장치로부터 각각 획득된 제1 월드-폭 및 제2 월드-폭 중 적어도 하나에 기반하여 타겟 차량과의 전방 거리를 추정할 수 있다. 제1 거리 추정 장치는 k1 값에 기반하여 타겟 차량의 월드-폭을 계산할 수 있고, 제2 거리 추정 장치는 k2 값에 기반하여 타겟 차량의 월드-폭을 계산할 수 있다. 일 예로, 제1 거리 추정 장치에서 k1 값에 기반하여 계산한 월드-폭의 값이 최소 월드-폭 내지 최대 월드- 폭 사이일 수 있으며, 제2 거리 추정 장치에서 k2 값에 기반하여 계산한 월드-폭의 값 또한 최소 월드-폭 내지 최대 월드-폭 사이일 수 있다. 이 경우, 이미지 신호 프로세서는 제1 거리 추정 장치 및/또는 제2 거리 추정 장치에 의해 각각 획득되는 전방 거리 값을 사용할 수 있다. 즉, 이미지 신호 프로세서 는 제1 거리 추정 장치에 의해 획득된 제1 전방 거리를 호스트 차량과 타겟 차량과의 거리 로 결정할 수도 있고, 제2 거리 추정 장치에 의해 획득된 제2 전방 거리를 호스트 차량과 타겟 차량 과의 거리로 결정할 수도 있으며, 상기 제1 전방 거리 및 제2 전방 거리의 평균을 계산하여 계산된 값을 호스트 차량과 타겟 차량 사이의 거리로 결정할 수도 있다. 다른 예로, 제1 거리 추정 장치에서 k1 값에 기반하여 계산한 월드-폭의 값이 최소 월드-폭보다 작거나, 최대 월드-폭보다 크게 계산될 수도 있다. 제2 거리 추정 장치에서 k2 값에 기반하여 계산한 월드-폭의 값 은 최소 월드-폭 내지 최대 월드-폭 사이에 포함될 수 있다. 이 경우, 이미지 신호 프로세서는 제1 거리 추정 장치의 k1 값은 부적절한 값으로 결정하고, 제2 거리 추정 장치에 의해 획득된 월드-폭을 타겟 차량의 월드-폭으로 결정할 수 있다. 이미지 신호 프로세서는 상기 제2 거리 추정 장치에서 계 산된 월드-폭을 이용하여 타겟 차량과의 전방 거리를 계산할 수 있을 것이다. 전술한 실시예에서는, 제1 거리 추정 장치의 k1 값이 부적절하며, 제2 거리 추정 장치의 k2 값은 적절한 것을 기준으로 도시하 였으나, 이에 제한되는 것은 아니다. 예를 들어, 제2 거리 추정 장치의 k2 값이 부적절하고, 제1 거리 추 정 장치의 k1 값이 적절한 경우, 이미지 신호 프로세서는 제1 거리 추정 장치에 의해 획득된 월 드-폭을 타겟 차량의 월드-폭으로 결정하고, 이에 기반하여 타겟 차량과 호스트 차량 사이의 거 리를 추정할 수도 있을 것이다. 도 9는 본 개시의 예시적 실시예에 따른 바운딩 박스에 대한 연속적인 보정(continuous refinement)의 예를 도 시한다. 도 9를 참조하면, 거리 추정 장치는 연속적인 주행에 따른 연속적인 이미지들을 획득할 수 있다. 호스트 차량은 차선을 따라 주행하는 동안, 카메라를 통해 전방의 3개의 타겟 차량에 대한 연속적인 이미지 들을 획득할 수 있다. 예를 들어, 호스트 차량은 시간의 흐름에 따라 n-2번째 프레임부터 현재 프레임에 대응하는 n번째 프레임까지 연속적으로 전방의 타겟 차량들에 대한 이미지들을 획득할 수 있다. 다양한 실시예들에 따라, 이미지 신호 프로세서는 현재 시점에 대응하는 n번째 프레임의 바운딩 박스(93 0)를 검출할 수 있다. 이전 시점들에 대응하는 n-2번째 프레임 또는 n-1번째 프레임에서 바운딩 박스들(910, 920)은 타겟 차량에 대응하는 최소한의 영역을 포함하도록 설정되는 반면, n번째 프레임의 바운딩 박스는 타겟 차량에 상응하는 영역을 초과하여 타겟 차량의 주변(peripheral) 영역까지 포함하도록 설정될 수 있다. 이 경우, 전술한 바와 같이, 본 개시의 예시적 실시예에 따른 거리 추정 장치는 검출된 바운딩 박스의 픽셀- 폭을 고려하여 타겟 차량과의 전방 거리를 추정하므로, 바운딩 박스가 n번째 프레임의 바운딩 박스와 같이 타겟 차량 주변의 불필요한 영역까지 포함하도록 설정되는 경우, 바운딩 박스의 픽셀-폭의 크기가 부정확 하게 되고, 따라서, 부정확한 픽셀-폭의 크기에 기반하여 추정된 전방 거리 또한 정확하지 않을 수 있다. 다양한 실시예들에 따라, 이미지 신호 프로세서는 이전 시점의 프레임들에서 획득된 바운딩 박스들(예를 들어, n-2번째 프레임의 바운딩 박스, n-1번째 프레임의 바운딩 박스)의 픽셀-폭들의 평균 값을 이용 하여, 현재 시점의 프레임에서 획득된 바운딩 박스(예를 들어, n번째 프레임의 바운딩 박스)의 신뢰도 (credibility)를 판단할 수 있다. 이미지 신호 프로세서는 이전 시점의 프레임들에서 검출된 바운딩 박스 들의 픽셀-폭이 x에 대응되지만, 현재 시점의 프레임에서 검출된 바운딩 박스의 픽셀-폭은 y이며, x와 y의 차이 가 임계 값을 초과하는 경우, 현재 시점의 프레임에서 검출된 바운딩 박스의 크기에 오류가 있음을 판단할 수 있다. 예를 들어, n-2번째 프레임에서 검출된 바운딩 박스 및 n-1번째 프레임에서 검출된 바운딩 박스 의 픽셀-폭은 각각 90, 91이고, n번째 프레임에서 검출된 바운딩 박스의 픽셀-폭은 120인 경우, 이미 지 신호 프로세서는 바운딩 박스의 검출 과정에서 오류가 발생하였음을 판단할 수 있다. 연속적인 주 행 과정에서, 나란히 주행하는 타겟 차량에 대한 바운딩 박스의 크기가 1개 내지 몇 개의 프레임 시간 간격 사 이에 급격하게 증가하는 것은 불가능하기 때문이다. 또는 이미지 신호 프로세서는 연속적인 시간 흐름에 상응하는 바운딩 박스들(910, 920, 930)의 픽셀-폭뿐만 아니라, 계산된 월드-폭에 기반하여 타겟 차량과의 전방 거리를 추정하는 데에 오류가 발생하였음을 판단할 수도 있다. 다양한 실시예들에 따라, 이미지 신호 프로세서는 이전 시점에 상응하는 프레임들에 기반하여, 현재 시점 의 프레임을 보정할 수 있다. 예를 들어, 이미지 신호 프로세서는 현재 프레임에서 계산된 월드-폭에 대하 여, 로우 패스 필터링(low pass filtering)을 수행하거나, 칼만 필터링(kalman filtering)을 수행할 수 있다. 상기 로우 패스 필터링 또는 칼만 필터링을 이용하는 경우, 이미지 신호 프로세서는 n번째 프레임에서 실 제보다 크거나 작게 검출된 바운딩 박스의 픽셀-폭 또는 상기 실제보다 크거나 작게 검출된 바운딩 박스 의 픽셀-폭에 기반하여 계산된 월드-폭을 보정할 수 있다. 다양한 실시예들에 따라, 호스트 차량은 타겟 차량과의 전방 거리를 계산하고, 계산 결과에 기초하여 호스트 차량을 제어할 수 있다. 예를 들어, 호스트 차량은 차량 제어부 뿐만 아니라, 자율 주행 제어부(automotive driving)(미도시)를 더 포함할 수 있다. 상기 자율 주행 제어부(미도시)는 호스트 차량(20 0)의 주행 경로를 생성하고, 주행 방향을 결정하고, 차선을 변경하거나 가속 또는 감속하는 데에 있어, 상기 계 산된 결과를 반영할 수 있다. 다양한 실시예들에 따라, 자율 주행 제어부(미도시)는 타겟 차량과의 전방 거리 및 측방 거리에 기반하여 타겟 차량의 위험도를 판단하고, 상기 위험도에 따라 차량 제어부를 통해 호스트 차량의 속력을 조절할 수도 있고, 상기 위험도에 따라 타겟 차량의 차선을 기준으로 호스트 차량의 차선을 변경할 수도 있다. 자율 주행 제어부(미도시)는 타겟 차량과의 전방 거리가 미리 정의된 거리보다 작은 경우, 에 기반하여 판단한 결과 타겟 차량의 차선 변경 횟수가 많은 경우, 타겟 차량이 적재 공간을 구비하여, 주행 도로 상에 적재된 물품이 추락할 가능성이 있는 차량 유형인 경우 등에 해당하는지 여부를 판단 할 수 있고, 판단 결과들에 따라 타겟 차량의 위험도를 계산할 수 있다. 자율 주행 제어부(미도시)는 위험 도에 기반하여 호스트 차량의 주행을 제어함으로써 주변 차량들로 인해 발생할 수 있는 갑작스러운 사고 위험성에 안전하게 대비할 수 있을 것이다. 이상에서와 같이 도면과 명세서에서 예시적인 실시예들이 개시되었다. 본 명세서에서 특정한 용어를 사용하여 실시예들을 설명되었으나, 이는 단지 본 개시의 기술적 사상을 설명하기 위한 목적에서 사용된 것이지 의미 한"}
{"patent_id": "10-2019-0096914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "정이나 특허청구범위에 기재된 본 개시의 범위를 제한하기 위하여 사용된 것은 아니다. 그러므로 본 기술분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라 서, 본 개시의 진정한 기술적 보호범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2019-0096914", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 예시적 실시예에 따른 거리 추정 장치의 블록도이다. 도 2는 본 개시의 예시적 실시예에 따른 거리 추정 장치를 포함하는 호스트 차량의 측면도이다. 도 3은 본 개시의 예시적 실시예에 따른 거리 추정 장치에 투영되는 타겟 차량에 대한 이미지의 일 예를 도시한 다. 도 4는 본 개시의 예시적 실시예에 따른 거리 추정 장치 및 타겟 차량의 측면의 일 예를 도시한다. 도 5는 본 개시의 예시적 실시예에 따른 버드아이 뷰(bird eye view)의 일 예를 도시한다. 도 6a은 본 개시의 예시적 실시예에 따른 버드아이 뷰의 다른 예를 도시한다. 도 6b는 본 개시의 예시적 실시예에 따른 버드아이 뷰의 또 다른 예를 도시한다. 도 7은 본 개시의 예시적 실시예에 따른 거리 추정 장치의 동작을 도시하는 순서도이다. 도 8은 본 개시의 예시적 실시예에 따른 복수의 거리 추정 장치들을 구비하는 호스트 차량의 버드아이 뷰를 도 시한다. 도 9는 본 개시의 예시적 실시예에 따른 바운딩 박스에 대한 연속적인 보정(continuous refinement)의 예를 도시한다."}
