{"patent_id": "10-2008-0049432", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2009-0123383", "출원번호": "10-2008-0049432", "출원인": "성균관대학교산학협력단", "발명자": "홍광석"}}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자신의 위치 정보를 포함하는 오감 멀티미디어 컨텐츠 요청 메시지를 전송하며, 상기 요청에 따라 수신되는 오감 멀티미디어의 컨텐츠를 재현하는 휴대 단말기; 와오감 멀티미디어 컨텐츠를 해당 위치에 따라 매핑하여 데이터베이스에 저장하고, 상기 휴대 단말기로부터 컨텐츠 제공을 요청받은 경우 상기 휴대 단말기의 위치에 따른 오감 멀티미디어 컨텐츠를 검색하여 휴대 단말기로전송하는 중앙 관리 서버를 포함하는 위치기반 오감 멀티미디어 컨텐츠 서비스 제공 시스템."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,주변의 단말로부터 오감 정보를 요청받는 경우, 자신 주변의 오감 정보를 측정하여, 오감 정보를 요청한 단말로그 측정 결과를 전송하는 오감정보 측정기를 더 포함하고,상기 휴대 단말기는 상기 오감정보 측정기로 오감 정보를 요청하고, 상기 오감정보 측정기로부터 수신한 오감정보 측정 결과와 상기 휴대 단말기의 위치를 결합하여 오감 멀티미디어의 컨텐츠를 생성하는 것을 특징으로 하는 위치기반 오감 멀티미디어 컨텐츠 서비스 제공 시스템."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 휴대 단말기는 생성된 오감 멀티미디어의 컨텐츠를 상기 중앙 관리 서버로 전송하고,상기 중앙 관리 서버는 휴대 단말기로부터 제공된 오감 멀티미디어 컨텐츠를 제공 휴대 단말기의 위치와 매핑하여 데이터베이스에 저장하는 것을 특징으로 하는 위치기반 오감 멀티미디어 컨텐츠 서비스 제공 시스템."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 휴대 단말기는 자신의 주위에 위치하는 오감정보 측정기의 정보를 상기 중앙 관리 서버로 요청하고,상기 중앙 관리 서버는 오감정보 측정기의 위치를 관리하며, 상기 휴대 단말기로부터 오감정보 측정기의 정보를요청받은 경우 상기 휴대 단말기 주위에 위치한 오감정보 측정기의 정보를 전달하는 것을 특징으로 하는 위치기반 오감 멀티미디어 컨텐츠 서비스 제공 시스템."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 중앙 관리 서버는 의미 기반 검색 기능을 제공하는 것을 특징으로 하는 위치기반 오감 멀티미디어 컨텐츠서비스 제공 시스템."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 중앙 관리 서버는 카테고리 기반의 검색 기능을 제공하는 것을 특징으로 하는 위치기반 오감 멀티미디어컨텐츠 서비스 제공 시스템."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "오감 멀티미디어 컨텐츠 서비스 제공 서버에 있어서,외부의 휴대 단말기와 데이터 송수신을 위한 데이터 송수신부;- 3 -공개특허 10-2009-0123383오감 멀티미디어 컨텐츠와 상기 오감 멀티미디어 컨텐츠에 매핑되는 위치 정보를 저장하는 데이터베이스; 및 컨텐츠를 요청한 휴대 단말의 위치 정보를 추출하고, 상기 추출된 위치 정보에 매핑되는 오감 멀티미디어 컨텐츠를 상기 데이터베이스에서 검색하여 상기 휴대 단말기로 제공하도록 제어하는 에이전트를 포함하는 오감 멀티미디어 컨텐츠 서비스 제공 서버."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,외부의 휴대 단말기로부터 오감 멀티미디어 컨텐츠를 제공받는 오감 멀티미디어 컨텐츠 수신부를 더 포함하는것을 특징으로 하는 오감 멀티미디어 컨텐츠 서비스 제공 서버."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 오감 멀티미디어 컨텐츠 수신부는,휴대 단말기로부터 제공되는 오감 멀티미디어 컨텐츠의 주석을 추출하고, 상기 제공된 오감 멀티미디어 컨텐츠의 주석을 반영하도록 상기 데이터베이스를 업데이트하는 주석 추출 모듈; 과휴대 단말기로부터 제공되는 오감 멀티미디어 컨텐츠의 위치 정보를 추출하고, 상기 제공된 오감 멀티미디어 컨텐츠의 위치 정보를 반영하도록 상기 데이터베이스를 업데이트하는 위치 기반 분류 모듈을 포함하는 오감 멀티미디어 컨텐츠 서비스 제공 서버."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 에이전트는,다수의 오감정보 측정기의 정보를 관리하며, 외부 단말로부터 오감정보 측정기의 정보를 요청받는 경우 상기 외부 단말의 위치에 근접한 오감정보 측정기의 정보를 상기 외부 단말로 전달하는 오감정보 측정기 알림 모듈을포함하는 오감 멀티미디어 컨텐츠 서비스 제공 서버."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 데이터베이스는,적어도 하나 이상의 오감 멀티미디어 콘텐츠를 저장하는 콘텐츠 DB;상기 오감 멀티미디어 콘텐츠를 의미 별로 분류한 정보를 저장하는 분류 DB; 및상기 오감 멀티미디어 콘텐츠에 매칭되는 주소 정보를 저장하는 주소지 DB를 포함하는 오감 멀티미디어 컨텐츠서비스 제공 서버."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "오감 멀티미디어 컨텐츠 서비스를 제공하기 위한 휴대 단말기에 있어서,외부와의 데이터를 송수신하기 위한 통신 인터페이스;오감 멀티미디어 컨텐츠를 재현하기 위한 오감 멀티미디어 재생 장치; 및상기 휴대 단말기의 음성 및 데이터 송수신과 휴대 단말기의 전반적인 제어를 수행하는 중앙 처리 장치; 및휴대 단말기의 위치 정보를 포함하는 오감 멀티미디어 컨텐츠 요청 메시지를 외부 서버로 전송하며, 상기 요청에 따라 수신되는 오감 멀티미디어의 컨텐츠가 상기 오감 멀티미디어 재생 장치에서 재현되도록 제어하는 오감멀티미디어 처리부를 포함하는 휴대 단말기."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "- 4 -공개특허 10-2009-0123383제12항에 있어서,상기 오감 멀티미디어 처리부는,상기 휴대 단말기 외부에 위치하는 오감정보 측정기로 오감 정보를 요청하는 오감 정보 요청 모듈; 과상기 오감정보 측정기로부터 수신한 오감 정보 측정 결과와 상기 휴대 단말기의 위치를 결합하여 오감 멀티미디어 컨텐츠를 생성하는 오감 멀티미디어 컨텐츠 생성 모듈을 포함하는 것을 특징으로 하는 휴대 단말기."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 오감 정보 요청 모듈은 외부 서버로 상기 오감 정보 측정기의 정보를 요청하는 것을 특징으로 하는 휴대단말기."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 오감 멀티미디어 컨텐츠 생성 모듈은 생성된 오감 멀티미디어 컨텐츠를 외부의 멀티미디어 컨텐츠 관리 서버로 전송하는 것을 특징으로 하는 휴대 단말기."}
{"patent_id": "10-2008-0049432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 오감 멀티미디어 컨텐츠 재생 장치는,시각, 청각, 후각, 미각 또는 촉각 중 적어도 하나의 오감을 재현하는 것을 특징으로 하는 휴대 단말기.명 세 서발명의 상세한 설명 기 술 분 야본 발명은 유비쿼터스 환경에서 위치정보에 기반한 집단지능형 오감 멀티미디어 컨텐츠 서비스 제공 시스템에 <1>관한 것이다. 배 경 기 술HCI(human computer interaction)는 인간과 컴퓨터의 상호작용에 관한 것이다. 차세대 컴퓨팅 패러다임으로서 <2>유비쿼터스 컴퓨팅 기술이 HCI 기술을 중요한 이슈로 다루는 것은 사람과 컴퓨터 사이의 인터페이스가 컴퓨팅분야에서 중요한 요소 기술임을 보여준다.기존의 시청각 위주의 상호작용 기술은 촉각, 후각, 미각을 포함한 오감 서비스를 지원하는 방향으로 발전하고 <3>있다. 또한 IT 인프라의 발전은 고정단말 뿐 아니라 이동단말의 연결성을 보장하면서 큰 대역폭을 지원하여 이동 중 멀티미디어 서비스를 제공할 것으로 예상된다. 결과적으로 시각과 청각을 포함한 멀티미디어에 촉각, 후각, 미각을 더한 오감 콘텐츠가 필요하고 이러한 오감 콘텐츠를 사용자와 상호작용하면서 시공간의 제약 없이서비스할 수 있는 시스템이 요구된다. 2000년, 피에르 레비는 디지털 기술의 사회적 활용을 연구하면서 집단 지능에 관한 저서 \"World Philosophy\" <4>를 발간한 바 있다. 이 저서에서, 사람은 과학 기술을 이용해 공동의 지적 능력과 자산을 서로 소통하며 집단적 지성을 쌓아 왔고, 이를 통해 시공간의 제약을 극복하는 인류의 통합이 실현되어 새로운 인간 진화의 완성단계를 이룰 수 있다고 주장하였다. 이는 사용자의 참여와 공유를 매개로 하는 웹 2.0의 패러다임과도 일치하며,정보 시스템의 발전 과정과 그 맥을 같이 하고 있다. 오감정보의 처리는 차세대 컴퓨팅을 위한 기술로 전망되고 있으며, 이에 국내외 연구기관에서 많은 연구가 진행 <5>중에 있으나, 일대일 전송 혹은 서비스 제공자에 의한 일대다 전송기술 기반의 오감정보시스템이 주를이루었다. 이와 같은 일대일 전송 혹은 서비스 제공자에 의한 일대다 전송기술 기반의 오감정보시스템은 통신- 5 -공개특허 10-2009-0123383사업자 및 서비스 제공자가 제작한 컨텐츠 위주의 정보 유통이 이루어져 왔기 때문에 보다 다양한 컨텐츠의 제공이 힘들다는 문제점이 존재하였다. 발명의 내용 해결 하고자하는 과제따라서 본 발명은 상기한 종래 기술에 따른 문제점을 해결하기 위한 것으로, 사용자들에 의해 만들어진 오감 멀 <6>티미디어 컨텐츠를 공유시켜 사용자로 하여금 오감 멀티미디어 컨텐츠를 이용할 수 있도록 제공하여 주며, 각사용자들에게 컨텐츠에 대한 검색 서비스 등을 제공하는 시스템 및 이러한 서비스를 제공하기 위한 중앙 관리서버 및 휴대 단말기의 제공을 그 목적으로 한다. 과제 해결수단본 발명의 일 측면에 따른 위치기반 오감 멀티미디어 컨텐츠 서비스 제공 시스템은 자신의 위치 정보를 포함하 <7>는 오감 멀티미디어 컨텐츠 요청 메시지를 전송하며, 상기 요청에 따라 수신되는 오감 멀티미디어의 컨텐츠를재현하는 휴대 단말기와 오감 멀티미디어 컨텐츠를 해당 위치에 따라 매핑하여 데이터베이스에 저장하고, 상기휴대 단말기로부터 컨텐츠 제공을 요청받은 경우 상기 휴대 단말기의 위치에 따른 오감 멀티미디어 컨텐츠를 검색하여 휴대 단말기로 전송하는 중앙 관리 서버를 포함한다.상기 오감 멀티미디어 컨텐츠 서비스 제공 시스템은 주변의 단말로부터 오감 정보를 요청받는 경우, 자신 주변 <8>의 오감 정보를 측정하여, 오감 정보를 요청한 단말로 그 측정 결과를 전송하는 오감정보 측정기를 더포함하고, 휴대 단말기는 상기 오감정보 측정기로 오감 정보를 요청하고, 상기 오감정보 측정기로부터 수신한오감 정보 측정 결과와 상기 휴대 단말기의 위치를 결합하여 오감 멀티미디어의 컨텐츠를 생성하는 것을 특징으로 할 수 있다.이 경우 상기 휴대 단말기는 생성된 오감 멀티미디어의 컨텐츠를 상기 중앙 관리 서버로 전송하고, 상기 중앙 <9>관리 서버는 휴대 단말기로부터 제공된 오감 멀티미디어 컨텐츠를 제공 휴대 단말기의 위치와 매핑하여 데이터베이스에 저장하는 것을 특징으로 할 수 있다.또한, 상기 휴대 단말기는 자신의 주위에 위치하는 오감정보 측정기의 정보를 상기 중앙 관리 서버로 요청하고 <10>상기 중앙 관리 서버는 오감정보 측정기의 위치를 관리하며, 상기 휴대 단말기로부터 오감정보 측정기의 정보를요청받은 경우 상기 휴대 단말기 주위에 위치한 오감정보 측정기의 정보를 전달하는 것을 특징으로 할 수 있다.한편, 상기 중앙 관리 서버는 의미 기반 검색 기능을 제공할 수 있으며, 카테고리 기반의 검색 기능을 제공할 <11>수도 있다.본 발명의 다른 측면에 따른 오감 멀티미디어 컨텐츠 서비스 제공 서버는 외부의 휴대 단말기와 데이터 송수신 <12>을 위한 데이터 송수신부, 오감 멀티미디어 컨텐츠와 상기 오감 멀티미디어 컨텐츠에 매핑되는 위치 정보를 저장하는 데이터베이스 및 컨텐츠를 요청한 휴대 단말의 위치 정보를 추출하고, 상기 추출된 위치 정보에 매핑되는 오감 멀티미디어 컨텐츠를 상기 데이터베이스에서 검색하여 상기 휴대 단말기로 제공하도록 제어하는 에이전트를 포함한다.상기 오감 멀티미디어 컨텐츠 서비스 제공 서버는 외부의 휴대 단말기로부터 오감 멀티미디어 컨텐츠를 제공받 <13>는 오감 멀티미디어 컨텐츠 수신부를 더 포함할 수 있다.이 경우 상기 오감 멀티미디어 컨텐츠 수신부는 휴대 단말기로부터 제공되는 오감 멀티미디어 컨텐츠의 주석을 <14>추출하고, 상기 제공된 오감 멀티미디어 컨텐츠의 주석을 반영하도록 상기 데이터베이스를 업데이트하는 주석추출 모듈과 휴대 단말기로부터 제공되는 오감 멀티미디어 컨텐츠의 위치 정보를 추출하고 상기 제공된 오감 멀티미디어 컨텐츠의 위치 정보를 반영하도록 상기 데이터베이스를 업데이트하는 위치 기반 분류 모듈을 포함할수 있다.한편, 상기 에이전트는 다수의 오감정보 측정기의 정보를 관리하며, 외부 단말로부터 오감정보 측정기의 정보를 <15>요청받는 경우 상기 외부 단말의 위치에 근접한 오감정보 측정기의 정보를 상기 외부 단말로 전달하는 오감정보측정기 알림 모듈을 포함할 수 있다.상기 데이터베이스는 적어도 하나 이상의 오감 멀티미디어 콘텐츠를 저장하는 콘텐츠 DB, 오감 멀티미디어 콘텐 <16>츠를 의미 별로 분류한 정보를 저장하는 분류 DB 및 오감 멀티미디어 콘텐츠에 매칭되는 주소 정보를 저장하는- 6 -공개특허 10-2009-0123383주소지 DB를 포함할 수 있다.본 발명의 다른 측면에 따른 오감 멀티미디어 컨텐츠 서비스를 제공하기 위한 휴대 단말기는 외부와의 데이터를 <17>송수신하기 위한 통신 인터페이스, 오감 멀티미디어 컨텐츠를 재현하기 위한 오감 멀티미디어 재생 장치 및 휴대 단말기의 음성 및 데이터 송수신과 휴대 단말기의 전반적인 제어를 수행하는 중앙 처리 장치 및 휴대 단말기의 위치 정보를 포함하는 오감 멀티미디어 컨텐츠 요청 메시지를 외부 서버로 전송하며, 상기 요청에 따라 수신되는 오감 멀티미디어의 컨텐츠가 상기 오감 멀티미디어 재생 장치에서 재현되도록 제어하는 오감 멀티미디어처리부를 포함한다.상기 오감 멀티미디어 처리부는 상기 휴대 단말기 외부에 위치하는 오감정보 측정기로 오감 정보를 요청하는 오 <18>감 정보 요청 모듈과 오감정보 측정기로부터 수신한 오감 정보 측정 결과와 상기 휴대 단말기의 위치를 결합하여 오감 멀티미디어 컨텐츠를 생성하는 오감 멀티미디어 컨텐츠 생성 모듈을 포함할 수 있다.상기 오감 정보 요청 모듈은 외부 서버로 상기 오감 정보 측정기의 정보를 요청할 수 있으며, 상기 오감 멀티미 <19>디어 컨텐츠 생성 모듈은 생성된 오감 멀티미디어 컨텐츠를 외부의 멀티미디어 컨텐츠 관리 서버로 전송하는 것을 특징으로 할 수 있다.상기 오감 멀티미디어 컨텐츠 재생 장치는 시각, 청각, 후각, 미각 또는 촉각 중 적어도 하나의 오감을 재현할 <20>수 있다. 효 과본 발명에 따른 오감 멀티미디어 컨텐츠 서비스 제공 시스템에 의하면 기존의 텍스트 및 정지 영상 그리고 동영 <21>상 등의 미디어가 중심이 되는 정보공유가 아니라, 사람의 오감을 통해 체험되는 멀티미디어 컨텐츠가 중심이되는 멀티미디어 서비스의 제공하여 더욱 실감이 나는 컨텐츠의 제공이 가능하게 된다.또한, 사용자가 컨텐츠를 생성할 때 위성으로부터 수신한 고유정보를 포함하므로 참여와 공유 그리고 개방으로 <22>대표되는 최근의 정보 시스템의 기술적 과제인 저작권에 관한 문제가 다소 해결될 수 있으며, 멀티미디어 생성시에 위치정보를 포함하므로 기존 위치기반 서비스보다 간편한 공유가 가능하고, 사용자의 위치에 기반을 두는맞춤형 서비스의 제공이 가능해 질 수도 있다. 발명의 실시를 위한 구체적인 내용이하, 본 발명에 따른 유비쿼터스 환경에서 오감 멀티미디어 컨텐츠 서비스 제공 시스템에 대하여 첨부된 도면 <23>을 참조하여 상세히 설명한다.도 1은 본 발명의 일 실시예에 따른 유비쿼터스 환경에서 오감 멀티미디어 컨텐츠 서비스의 개념을 나타낸 도면 <24>이다.도 1에 제시된 바와 같이 위치기반 오감 멀티미디어 컨텐츠 서비스 제공 시스템은 중앙 관리 서버(100), 사용자 <25>가 서비스를 이용하기 위한 다수의 휴대 단말기(200), 일정 위치에 설치되어 오감정보를 측정하는 오감정보 측정기(300) 등으로 구성될 수 있다.상기 중앙 관리 서버(100), 휴대 단말기(200), 오감정보 측정기(300)는 인공위성(400) 등을 이용하여 데이터를 <26>송수신할 수 있으나, 통신 방법은 인공위성(400)을 이용하는 것에 한정되지 않으며, 다양한 통신 방식이 이용될수 있다.이러한 구성의 오감 멀티미디어 컨텐츠 서비스 시스템은 유비쿼터스 환경에서 오감정보를 활용한 멀티미디어 컨 <27>텐츠의 생성, 재현 및 전송 기능을 수행한다. 특히, 상기 오감정보는 사용자의 위치정보와 결합되어 보다 정확하고 유요한 정보가 될 수 있다. 또한, 오감 멀티미디어 컨텐츠 서비스 시스템은 오감 멀티미디어 컨텐츠의 공유 및 검색 기능 및 사용자 맞춤형 서비스를 위한 지능형 에이전트 기능 등도 제공한다. 이하, 각각의 기능에대하여 더욱 자세히 살펴보기로 한다.먼저, 오감 정보를 이용한 멀티미디어 컨텐츠의 생성, 재현 및 전송과 관련된 휴대 단말기(200)의 기능으로는 <28>다음과 같은 기능들이 존재한다.① 휴대 단말기(200)는 GPS(global positioning system)(500)를 통해 휴대 단말기(200)의 위치, 현재 시각, 현 <29>재 날짜, 현재 고도 등의 정보를 획득한다. 즉, 사용자가 위치한 곳의 위도 및 경도 등의 위치 정보를 포함하는 오감 멀티미디어 컨텐츠의 생성 시 사용할 메타데이터(metadata)인 시각, 날짜, 고도정보를 획득하는- 7 -공개특허 10-2009-0123383것이다. 상기 GPS(500)를 통해서 획득한 위치 정보는 집단 지능형 공유 및 개인화 서비스를 위한 공유 정보로써, 오감 멀티미디어 컨텐츠와 함께 주소 등의 필드로 변환되어 중앙 관리 서버(100)의 데이터베이스(120)에 기록된다. 이와 같이 오감 멀티미디어 컨텐츠에 위치 정보가 결합됨으로써, 사용자의 위치에 따른 컨텐츠 제공이가능케 된다.② 휴대용 단말기(200)는 유비쿼터스 환경에서 오감정보의 수집이 가능한 컴퓨터, 즉 오감정보 측정기(300)를 <30>감지하는 기능을 포함한다. 사용자의 휴대 단말기(200)는 근접하거나 또는 특정 반경 내에 위치한 오감정보의수집이 가능한 컴퓨터, 즉 오감정보 측정기(300)의 위치를 감지하여 사용자에게 알린다. 감지된 오감정보 측정기(300)와 휴대 단말기(200)를 이용하여 사용자는 언제 어디서나 오감정보를 수집할 수 있 <31>도록 하는 환경을 제공받을 수 있게 된다.③ 또한, 휴대 단말기(200)는 수집된 오감정보를 근간으로 위치기반 멀티미디어 컨텐츠를 생성하는 기능을 수행 <32>한다. 오감정보의 수집이 가능한 오감정보 측정기(300)와 휴대 단말기(200) 간 연동을 통해서, 수집된 시각(동영상 및 정지영상 등), 청각(사용자의 육성 및 환경 소리 등), 촉각(질감), 후각(냄새), 미각(맛) 등의 사용자가 체감할 수 있는 오감 정보들은 GPS(500)에서 획득한 정보들과 함께 결합되어 하나의 오감 멀티미디어 컨텐츠로 가공된다.④ 본 발명에 따른 오감 멀티미디어 컨텐츠 서비스 제공 시스템은 생성된 멀티미디어 컨텐츠의 재현 및 전송 기 <33>술을 수행한다. 오감정보 측정기(300)와 사용자의 휴대 단말기(200) 간의 연동을 통해서 생성된 오감 멀티미디어 컨텐츠는 사용자의 휴대 단말기(200) 상에서 재현(혹은 재생)될 수 있고, 사용자가 입력한 검색용 키워드들및 컨텐츠의 위치 분류(관광지, 식당, 숙박업소 등의 장소 구분을 위한 분류)와 함께 중앙 관리 서버(100)로 전송될 수도 있다. 이와 같이 컨텐츠가 중앙 관리 서버(100)로 전송됨으로써 사용자 개인에 의해 생성된 위치기반 오감 멀티미디어 컨텐츠의 공유 및 집단지능화가 가능케 된다.다음으로, 본 발명에 따른 오감 멀티미디어 컨텐츠 서비스 제공 시스템 중 중앙 관리 서버(10)가 제공하는 멀티 <34>미디어 컨텐츠의 공유 및 검색 기술에 대하여 더욱 자세히 살펴본다.① 위치기반의 멀티미디어 컨텐츠 서비스를 제공하기 위한 중앙 관리 서버(100)는 다수의 유저들이 참여하여 전 <35>송한 오감 멀티미디어 컨텐츠들의 데이터 웨어하우징(datawarehousing) 기능을 수행할 수 있다. 데이터웨어하우징 기능은 사용자들에 의해 생성되어 전송된 오감 멀티미디어 컨텐츠와 그것과 관련된 위치 정보 <36>를 수신하고, 이를 중앙 데이터베이스에 저장, 구축하는 기술을 의미한다.② 멀티미디어 컨텐츠 제공 시스템의 중앙 관리 서버는(100) 상기 ①의 웨어하우징 기능의 세부 기능으로 오감 <37>멀티미디어 컨텐츠 데이터베이스의 위치기반 자동 카테고라이징(categorizing)을 수행할 수 있다.사용자에 의해 전송된 위치정보는 중앙 관리 서버(100)에 내장된 지도상의 특정 지점을 가리킨다. 상기 위치정 <38>보와 결합된 해당 오감 멀티미디어 컨텐츠는 그 지도상의 지점에 대한 정보와 매칭되는 것이다. 즉, 중앙 관리 서버(100) 데이터베이스(120)에 오감 멀티미디어 컨텐츠를 저장하는 경우, GPS(500)로부터 획득 <39>한 위치정보는 미리 구축된 주소지의 정보로 변환되며 변환된 주소지의 정보가 오감 멀티미디어 컨텐츠와 매핑되어 저장되는 것이다. 뿐만 아니라, 중앙 관리 서버(100)는 사용자가 수동적으로 선택하거나 입력한 컨텐츠의 위치 분류도 동시에 저 <40>장하여 관리할 수 있다.③ 또한, 위치기반 오감 멀티미디어 컨텐츠 제공 시스템은 의미 기반의 주석(annotation)을 자동으로 추출하는 <41>기능을 수행할 수 있다. 즉, 사용자에 의해 전송된 컨텐츠와 함께 입력된 키워드를 이용하여 의미 기반 주석을생성하는 것이다. 이러한 의미 기반의 주석은 추후 컨텐츠 검색에 이용된다.여기서 의미 기반 주석이란, 사용자에 의해 입력된 키워드를 가지고 온톨로지(ontology)를 기반으로 구축된 단 <42>어 사전에서 동의어 및 다의어를 추출하고, 수신된 컨텐츠가 학습된 오감정보의 특징 데이터베이스로부터 유사한 특징을 가진 컨텐츠를 찾아 새로운 키워드를 자동적으로 부여하고, 유사한 컨텐츠와 연관 지어 사용자가 지정한 키워드 이외의 것을 첨가하는 것이다.④ 또한 위치기반 오감 멀티미디어 컨텐츠 제공 시스템은 오감 멀티미디어 컨텐츠를 대상으로 하는 의미 기반 <43>검색을 할 수 있다. 의미 기반 검색은 사용자가 특정한 컨텐츠와 유사한 것들을 찾고자 할 때 컨텐츠의 내용을직접 분석하여 결과를 찾아내는 기술에 해당한다. 이는 오감에 기반을 둔 컨텐츠에서 유사한 오감 정보를 가진- 8 -공개특허 10-2009-0123383오감 멀티미디어 컨텐츠를 찾아내기 위한 것으로서, 기존의 영상 및 음성 정보를 포함한 멀티미디어에서 사용하는 내용 기반 검색은 물론, 유사한 후각과 미각 그리고 촉각정보를 가진 컨텐츠를 찾아내기 위한 것이다.⑤ 오감 멀티미디어 컨텐츠 제공 시스템은 카테고리 기반의 검색 기능을 제공한다. 구체적으로 카테고리로 구 <44>분된 오감 멀티미디어 컨텐츠들을 트리(tree) 형태로 검색하는 기술에 해당한다. ②번 기술에 따라 카테고리화된 컨텐츠를 주소지, 키워드, 컨텐츠에 매핑되는 위치 종류 등을 기준으로 하여 분류하고, 분류된 컨텐츠를 각기준 별 트리 형태로 나타낼 수 있다.⑥ 또한, 오감 멀티미디어 컨텐츠를 제공하기 위한 중앙 관리 서버(100)는 컨텐츠 위치정보를 기반으로 하는 검 <45>색 기능을 제공한다. 위치정보 기반 검색이란, 다른 사용자에 의해 공유된 컨텐츠를 사용자가 소유한 휴대형단말기 상의 지도에 표기하는 검색 기술이다. 이는 GPS(500)로부터 획득한 위도 및 경도를 지도상의 매핑을 통해서 사용자에게 출력하는 기술이다.또 다른 카테고리의 중앙 관리 서버(100) 중 에이전트(110)의 기능에 대하여 설명한다. <46>① 중앙 관리 서버(100)의 에이전트(110)는 사용자의 관심 지역 내에서 컨텐츠 갱신 여부의 실시간 자동 안내 <47>및 재현을 수행한다. 사용자가 설정한 관심 지역 내에서 새로운 오감 멀티미디어 컨텐츠가 공유되면, 사용자에게 이러한 공유 사실을 알리는 지능형 기술에 해당한다. 이러한 기능은 사용자의 휴대 단말기(200)에서 사용자의 의도에 의해 활성화되는 에이전트(100)에 의하여 구현이 가능하다.② 한편, 위치기반 오감 멀티미디어 컨텐츠 제공 시스템은 컨텐츠의 실시간 자동 안내 및 재현 기능을 <48>제공한다. 사용자가 현재 위치한 곳을 기준으로, 특정 반경 내에 공유된 오감 멀티미디어 컨텐츠를 사용자가이동함에 따라서 실시간으로 안내하고, 사용자가 원하는 컨텐츠를 재현하는 기술이다. 이 때, 위도 및 경도를통한 위치정보는 물론이며 고도까지 고려할 수도 있다.도 2 본 발명의 일 실시예에 따른 위치기반 집단지능 시스템의 아키텍처를 나타낸 도면이다. <49>도 2에 도시된 바와 같이 위치기반 집단지능 시스템은 크게 중앙 관리 서버(100), 휴대 단말기(200), 오감정보 <50>측정기(300), 인공위성(400) 및 GPS 시스템(500) 등으로 구성될 수 있다.먼저 휴대 단말기(200)는 사용자들에게 오감 멀티미디어 컨텐츠 서비스를 받고자 하는 사용자가 휴대하는 터미 <51>널에 해당한다. 상기 휴대 단말기(200)는 오감정보를 측정하고, 이를 이용하여 멀티미디어 컨텐츠를 생성 및가공하는 기능을 포함한다.한편, 휴대 단말기(200)는 주위에 정밀한 오감정보 측정기(300)가 존재하는 여부를 중앙 관리 서버(100)의 에이 <52>전트 통신부(110)로부터 통보받을 수 있다. 사용자는 휴대 단말기(200) 및 오감정보 측정기(300)로부터 해당위치에 따른 오감정보 및 GPS로부터 위치정보를 획득한다. 휴대단말기는 획득한 정보들을 융합하여 위치기반오감 멀티미디어 컨텐츠를 생성하는 것이다.이와 같이 생성된 오감 멀티미디어 컨텐츠는 중앙 관리 서버(100)로 전송되며, 중앙 관리 서버(100)는 사용자가 <53>보내온 오감 멀티미디어 컨텐츠를 위치 기반으로 분류하고, 의미 기반 주석 추출을 수행하고, 사용자가 입력한컨텐츠의 분류(관광지, 상점, 바다, 산 등의 위치 분류)에 따라 데이터베이스(120)에 저장한다. 중앙 관리 서버(100)의 에이전트(110)는 항상 사용자와 연결을 유지하면서 사용자의 현재 위치에 기반한 특정 <54>반경 내의 컨텐츠 알림, 관심 지역 내에 새로이 공유된 컨텐츠 알림 등을 수행하게 된다. 도 3은 본 발명에 따른 위치기반 집단지능 시스템 데이터베이스의 구조를 나타낸 것이다. <55>중앙 관리 서버(100)의 데이터베이스(120)는 주소지 DB(124), 컨텐츠 DB(122), 카테고리 DB(123) 등을 구분하여 <56>저장할 수 있다.여기서 주소지 DB(124)는 국가(country), 주소(address), 위도 정보(s_latitude, e_latitude), 경도 <57>(s_longitude, e_latitude) 등의 ID 필드를 포함할 수 있다. 또한, 컨텐츠 DB(122)는 컨텐츠별로 메시지 정보(msg), 주소(address), 카테고리(category), 시간(datetime), 고도(altitude), 파일정보(file) 등의 ID 필드를포함할 수 있다. 여기서 주소지 DB(124)와 컨텐츠 DB(123)는 각 DB의 address 필드를 매칭시킴으로써 연결될수 있다.한편, 카테고리 DB(123)는 카테고리의 이름(name) ID를 포함한다. 상기 카테고리 DB(123)의 name ID 필드와 컨 <58>텐츠 DB(122)의 category ID 필드가 매칭됨으로써 컨텐츠 DB(122)와 카테고리 DB(123)는 연결될 수 있다.- 9 -공개특허 10-2009-0123383도 4는 본 발명의 다른 실시예에 따른 위치기반 집단지능 시스템을 이용한 서비스 제공을 위한 휴대 단말기의 <59>구성을 나타낸 도면이다.도 4에 도시된 바와 같이 본 발명에 따른 휴대 단말기(200)는 오감 멀티미디어 처리부(210), 중앙처리장치 <60>(220), 메모리부(230), RF 신호처리부(240), 키 입력부(250), 디스플레이부(260), 스피커(270), 기타 오감 재생 장치(280) 등으로 구성될 수 있다.중앙처리장치(210)는 휴대 단말기(200)의 통신제어기능과 기타 휴대폰 환경관리 등 휴대 단말기(200)의 전반적 <61>인 제어를 수행하는 구성 요소에 해당한다. RF 신호처리부(240)는 안테나를 통하여 입력되는 무선데이터 신호및 RF 음성 신호를 변복조 처리하는 구성 요소에 해당한다. 키 입력부(250)는 사용자로 하여금 휴대 단말기(200)가 제공하는 메뉴 또는 기능을 선택하고, 알파벳, 숫자 등의 문자를 입력하는 인터페이스에 해당한다. 휴대 단말기(200)의 메모리부(230)에는 휴대 단말기(200)의 운영체제 프로그램, 응용 소프트웨어 및 사용자가 다운로드한 데이터 등이 저장된다.본 발명에 따른 휴대 단말기(200)의 핵심적 기능 블록인 오감 멀티미디어 처리부(210)는 오감 멀티미디어 컨텐 <62>츠를 생성, 재생하는 동작을 수행한다. 상기 오감 멀티미디어 처리부(210)는 오감 정보 요청 모듈(211), 오감멀티미디어 컨텐츠 생성 모듈(212) 및 오감 멀티미디어 컨텐츠 재생 모듈(213)의 세부 구성을 가질 수 있다.오감 정보 요청 모듈(211)은 휴대 단말기(200) 외부에 위치하는 오감정보 측정기(300)로 오감 정보를 요청하고, <63>오감정보 측정기(300)로부터 오감 정보를 전달받는다. 또한, 오감 정보 요청 모듈(211)은 휴대 단말기(200) 주위의 오감정보 측정기(300)를 파악하기 위하여 중앙 관리 서버(100)로 오감정보 측정기(300)의 정보를 요청할수도 있다.오감 멀티미디어 컨텐츠 생성 모듈(212)은 오감정보 측정기(300)로부터 수신한 오감 정보 측정 결과와 상기 휴 <64>대 단말기(200)의 위치를 결합하여 오감 멀티미디어 컨텐츠를 생성하는 역할을 수행한다. 여기서 오감 멀티미디어 컨텐츠 생성 모듈(212)은 GPS 시스템(500)으로부터 위도, 경도, 고도 등 휴대 단말기(200)의 위치 정보를획득할 수 있다.또한, 상기 오감 멀티미디어 컨텐츠 생성 모듈(212)은 생성한 오감 멀티미디어 컨텐츠를 중앙 관리 서버(100)로 <65>제공하여, 다른 유저들과 상기 컨텐츠를 공유할 수 있다.오감 멀티미디어 처리부(210)의 오감 멀티미디어 컨텐츠 재생 모듈(213)은 자신의 메모리부(230) 등에 저장한 <66>컨텐츠 또는 중앙 관리 서버(100)로부터 제공되는 오감 멀티미디어 컨텐츠를 재생하는 역할을 담당한다. 이러한 컨텐츠는 디스플레이부(260), 스피커(270) 및 기타 오감 재생 장치(280) 등을 통하여 재현 또는 재생될 수있다.도 5는 본 발명의 실시예에 따른 위치기반 집단지능 시스템을 이용한 서비스 제공 방법을 나타낸 도면이다. <67>도 2, 4 등에서 제공하는 중앙 관리 서버(100), 휴대 단말기(200) 등을 통하여, 유저들은 도 5와 같이 오감 멀 <68>티미디어 컨텐츠 서비스를 제공받을 수 있다.도 5의 최상단에서 볼 수 있듯이 n명의 유저는 자신의 휴대 단말기(200)를 이용하여 오감 멀티미디어 컨텐츠를 <69>생성한다. 이들이 생성한 컨텐츠는 오감 정보 시스템 중 중앙 관리 서버(100)로 전달된다.n명에 의해 공유된 m개의 위치기반 오감 멀티미디어 컨텐츠들은 중앙 관리 서버(100)에 의하여 집단 <70>지능화된다. 즉, 중앙 관리 서버(100)는 웨어하우징, 카테고라이징, 주석 자동 추출 기능 등을 통하여 m개의위치기반 오감 멀티미디어 컨텐츠를 자동으로 분류하게 된다. 또한, 중앙 관리 서버(100)는 유저가 컨텐츠의내용, 위치정보, 카테고리 등을 검색어로 하여 컨텐츠를 검색할 수 있도록 한다. 한편, 중앙 관리 서버(100)는 컨텐츠를 요청한 유저의 현재 위치에 따른 컨텐츠를 제공할 수도 있으며, 유저가 <71>관심을 보이는 지역에 대한 컨텐츠를 제공할 수도 있다.사용자는 자신의 휴대 단말기(200) 지도상에 표시된 공유 컨텐츠를 선택함으로써, 그 지역과 관련하여 공유된 <72>컨텐츠를 재현할 수 있다. 사용자는 이와 같이 공유된 컨텐츠에 대하여 텍스트 또는 음성을 통하여 코멘트 등을 작성하여 저장함으로써 다른 사람이 참조할 수 있도록 한다.한편, 휴대 단말기(200)는 사용자의 선택에 따라 특정 컨텐츠와 유사한 내용을 가진 컨텐츠를 검색하기 위해 내 <73>용 기반 검색을 수행할 수 있다. 본 발명에서 제시하는 내용 기반 검색은 유사한 시각, 청각, 촉각, 후각, 미각을 가지는 오감 멀티미디어 컨텐츠를 검색한다는 것이다. 이것은 중앙 관리 서버(100)에서 저장된 컨텐츠들- 10 -공개특허 10-2009-0123383을 가지고 특징 추출을 수행하여 유사한 특징을 가진 컨텐츠를 순위별로 나열하는 방식으로 구현될 수 있다.이상에서 대표적인 실시예를 통하여 본 발명에 대하여 상세하게 설명하였으나, 본 발명이 속하는 기술 분야에서 <74>통상의 지식을 가진 자는 상술한 실시예에 대하여 본 발명의 범주에서 벗어나지 않는 한도 내에서 다양한 변형이 가능함을 이해할 것이다. 그러므로 본 발명의 권리 범위는 설명된 실시예에 국한되어 정해져서는 안 되며,후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 것들에 의하여 정해져야 한다.도면의 간단한 설명도 1은 본 발명의 일 실시예에 따른 오감 멀티미디어 컨텐츠의 위치기반 집단지능 시스템의 개념을 나타낸 <75>도면.도 2 본 발명의 일 실시예에 따른 위치기반 집단지능 시스템의 아키텍처를 나타낸 도면. <76>도 3은 본 발명의 실시예에 따른 위치기반 집단지능 시스템을 이용한 서비스 제공 방법을 나타낸 도면. <77>도 4는 본 발명의 다른 실시예에 따른 위치기반 집단지능 시스템을 이용한 서비스 제공을 위한 휴대 단말기의 <78>구성을 나타낸 도면.도 5는 본 발명의 실시예에 따른 위치기반 집단지능 시스템을 이용한 서비스 제공 방법을 나타낸 도면. <79><도면의 주요 부분에 대한 부호 설명> <80>100 : 중앙관리서버 110 : 에이전트 통신부 <81>120 : 데이터베이스 130 : 데이터 수신부 <82>140 : 데이터 송신부 200 : 휴대단말기 <83>300 : 오감정보 측정기 400 : 인공위성 <84>500 : GPS 시스템 <85>- 11 -공개특허 10-2009-0123383도면 도면1- 12 -공개특허 10-2009-0123383 도면2- 13 -공개특허 10-2009-0123383 도면3- 14 -공개특허 10-2009-0123383 도면4- 15 -공개특허 10-2009-0123383 도면5- 16 -공개특허 10-2009-0123383"}
{"patent_id": "10-2008-0049432", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 유비쿼터스 환경에서의 오감 멀티미디어 컨텐츠 서비스 제공 시스템에 관한 것으로, 자신의 위치 정보 를 포함하는 오감 멀티미디어 컨텐츠 요청 메시지를 전송하며 수신되는 오감 멀티미디어의 컨텐츠를 재현하는 휴 대 단말기와 오감 멀티미디어 컨텐츠를 해당 위치에 따라 매핑하여 데이터베이스에 저장해두고, 상기 휴대 단말 기의 위치에 따른 오감 멀티미디어 컨텐츠를 검색하여 휴대 단말기로 제공하는 중앙 관리 서버를 포함하는 오감 멀티미디어 컨텐츠 서비스 제공 시스템을 제공함으로써 보다 실감나는 멀티미디어 서비스의 제공을 할 수 있다."}
{"patent_id": "10-2008-0049432", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 유비쿼터스 환경에서 위치정보에 기반한 집단지능형 오감 멀티미디어 컨텐츠 서비스 제공 시스템에 <1> 관한 것이다."}
{"patent_id": "10-2008-0049432", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "HCI(human computer interaction)는 인간과 컴퓨터의 상호작용에 관한 것이다. 차세대 컴퓨팅 패러다임으로서 <2> 유비쿼터스 컴퓨팅 기술이 HCI 기술을 중요한 이슈로 다루는 것은 사람과 컴퓨터 사이의 인터페이스가 컴퓨팅 분야에서 중요한 요소 기술임을 보여준다. 기존의 시청각 위주의 상호작용 기술은 촉각, 후각, 미각을 포함한 오감 서비스를 지원하는 방향으로 발전하고 <3> 있다. 또한 IT 인프라의 발전은 고정단말 뿐 아니라 이동단말의 연결성을 보장하면서 큰 대역폭을 지원하여 이 동 중 멀티미디어 서비스를 제공할 것으로 예상된다. 결과적으로 시각과 청각을 포함한 멀티미디어에 촉각, 후 각, 미각을 더한 오감 콘텐츠가 필요하고 이러한 오감 콘텐츠를 사용자와 상호작용하면서 시공간의 제약 없이 서비스할 수 있는 시스템이 요구된다. 2000년, 피에르 레비는 디지털 기술의 사회적 활용을 연구하면서 집단 지능에 관한 저서 \"World Philosophy\" <4> 를 발간한 바 있다. 이 저서에서, 사람은 과학 기술을 이용해 공동의 지적 능력과 자산을 서로 소통하며 집단 적 지성을 쌓아 왔고, 이를 통해 시공간의 제약을 극복하는 인류의 통합이 실현되어 새로운 인간 진화의 완성단 계를 이룰 수 있다고 주장하였다. 이는 사용자의 참여와 공유를 매개로 하는 웹 2.0의 패러다임과도 일치하며, 정보 시스템의 발전 과정과 그 맥을 같이 하고 있다. 오감정보의 처리는 차세대 컴퓨팅을 위한 기술로 전망되고 있으며, 이에 국내외 연구기관에서 많은 연구가 진행 <5> 중에 있으나, 일대일 전송 혹은 서비스 제공자에 의한 일대다 전송기술 기반의 오감정보시스템이 주를 이루었다. 이와 같은 일대일 전송 혹은 서비스 제공자에 의한 일대다 전송기술 기반의 오감정보시스템은 통신 - 5 -공개특허 10-2009-0123383사업자 및 서비스 제공자가 제작한 컨텐츠 위주의 정보 유통이 이루어져 왔기 때문에 보다 다양한 컨텐츠의 제 공이 힘들다는 문제점이 존재하였다."}
{"patent_id": "10-2008-0049432", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용 해결 하고자하는 과제 따라서 본 발명은 상기한 종래 기술에 따른 문제점을 해결하기 위한 것으로, 사용자들에 의해 만들어진 오감 멀 <6> 티미디어 컨텐츠를 공유시켜 사용자로 하여금 오감 멀티미디어 컨텐츠를 이용할 수 있도록 제공하여 주며, 각 사용자들에게 컨텐츠에 대한 검색 서비스 등을 제공하는 시스템 및 이러한 서비스를 제공하기 위한 중앙 관리 서버 및 휴대 단말기의 제공을 그 목적으로 한다. 과제 해결수단 본 발명의 일 측면에 따른 위치기반 오감 멀티미디어 컨텐츠 서비스 제공 시스템은 자신의 위치 정보를 포함하 <7> 는 오감 멀티미디어 컨텐츠 요청 메시지를 전송하며, 상기 요청에 따라 수신되는 오감 멀티미디어의 컨텐츠를 재현하는 휴대 단말기와 오감 멀티미디어 컨텐츠를 해당 위치에 따라 매핑하여 데이터베이스에 저장하고, 상기 휴대 단말기로부터 컨텐츠 제공을 요청받은 경우 상기 휴대 단말기의 위치에 따른 오감 멀티미디어 컨텐츠를 검 색하여 휴대 단말기로 전송하는 중앙 관리 서버를 포함한다. 상기 오감 멀티미디어 컨텐츠 서비스 제공 시스템은 주변의 단말로부터 오감 정보를 요청받는 경우, 자신 주변 <8> 의 오감 정보를 측정하여, 오감 정보를 요청한 단말로 그 측정 결과를 전송하는 오감정보 측정기를 더 포함하고, 휴대 단말기는 상기 오감정보 측정기로 오감 정보를 요청하고, 상기 오감정보 측정기로부터 수신한 오감 정보 측정 결과와 상기 휴대 단말기의 위치를 결합하여 오감 멀티미디어의 컨텐츠를 생성하는 것을 특징으 로 할 수 있다. 이 경우 상기 휴대 단말기는 생성된 오감 멀티미디어의 컨텐츠를 상기 중앙 관리 서버로 전송하고, 상기 중앙 <9> 관리 서버는 휴대 단말기로부터 제공된 오감 멀티미디어 컨텐츠를 제공 휴대 단말기의 위치와 매핑하여 데이터 베이스에 저장하는 것을 특징으로 할 수 있다. 또한, 상기 휴대 단말기는 자신의 주위에 위치하는 오감정보 측정기의 정보를 상기 중앙 관리 서버로 요청하고 <10> 상기 중앙 관리 서버는 오감정보 측정기의 위치를 관리하며, 상기 휴대 단말기로부터 오감정보 측정기의 정보를 요청받은 경우 상기 휴대 단말기 주위에 위치한 오감정보 측정기의 정보를 전달하는 것을 특징으로 할 수 있다. 한편, 상기 중앙 관리 서버는 의미 기반 검색 기능을 제공할 수 있으며, 카테고리 기반의 검색 기능을 제공할 <11> 수도 있다. 본 발명의 다른 측면에 따른 오감 멀티미디어 컨텐츠 서비스 제공 서버는 외부의 휴대 단말기와 데이터 송수신 <12> 을 위한 데이터 송수신부, 오감 멀티미디어 컨텐츠와 상기 오감 멀티미디어 컨텐츠에 매핑되는 위치 정보를 저 장하는 데이터베이스 및 컨텐츠를 요청한 휴대 단말의 위치 정보를 추출하고, 상기 추출된 위치 정보에 매핑되 는 오감 멀티미디어 컨텐츠를 상기 데이터베이스에서 검색하여 상기 휴대 단말기로 제공하도록 제어하는 에이전 트를 포함한다. 상기 오감 멀티미디어 컨텐츠 서비스 제공 서버는 외부의 휴대 단말기로부터 오감 멀티미디어 컨텐츠를 제공받 <13> 는 오감 멀티미디어 컨텐츠 수신부를 더 포함할 수 있다. 이 경우 상기 오감 멀티미디어 컨텐츠 수신부는 휴대 단말기로부터 제공되는 오감 멀티미디어 컨텐츠의 주석을 <14> 추출하고, 상기 제공된 오감 멀티미디어 컨텐츠의 주석을 반영하도록 상기 데이터베이스를 업데이트하는 주석 추출 모듈과 휴대 단말기로부터 제공되는 오감 멀티미디어 컨텐츠의 위치 정보를 추출하고 상기 제공된 오감 멀 티미디어 컨텐츠의 위치 정보를 반영하도록 상기 데이터베이스를 업데이트하는 위치 기반 분류 모듈을 포함할 수 있다. 한편, 상기 에이전트는 다수의 오감정보 측정기의 정보를 관리하며, 외부 단말로부터 오감정보 측정기의 정보를 <15> 요청받는 경우 상기 외부 단말의 위치에 근접한 오감정보 측정기의 정보를 상기 외부 단말로 전달하는 오감정보 측정기 알림 모듈을 포함할 수 있다. 상기 데이터베이스는 적어도 하나 이상의 오감 멀티미디어 콘텐츠를 저장하는 콘텐츠 DB, 오감 멀티미디어 콘텐 <16> 츠를 의미 별로 분류한 정보를 저장하는 분류 DB 및 오감 멀티미디어 콘텐츠에 매칭되는 주소 정보를 저장하는 - 6 -공개특허 10-2009-0123383주소지 DB를 포함할 수 있다. 본 발명의 다른 측면에 따른 오감 멀티미디어 컨텐츠 서비스를 제공하기 위한 휴대 단말기는 외부와의 데이터를 <17> 송수신하기 위한 통신 인터페이스, 오감 멀티미디어 컨텐츠를 재현하기 위한 오감 멀티미디어 재생 장치 및 휴 대 단말기의 음성 및 데이터 송수신과 휴대 단말기의 전반적인 제어를 수행하는 중앙 처리 장치 및 휴대 단말기 의 위치 정보를 포함하는 오감 멀티미디어 컨텐츠 요청 메시지를 외부 서버로 전송하며, 상기 요청에 따라 수신 되는 오감 멀티미디어의 컨텐츠가 상기 오감 멀티미디어 재생 장치에서 재현되도록 제어하는 오감 멀티미디어 처리부를 포함한다. 상기 오감 멀티미디어 처리부는 상기 휴대 단말기 외부에 위치하는 오감정보 측정기로 오감 정보를 요청하는 오 <18> 감 정보 요청 모듈과 오감정보 측정기로부터 수신한 오감 정보 측정 결과와 상기 휴대 단말기의 위치를 결합하 여 오감 멀티미디어 컨텐츠를 생성하는 오감 멀티미디어 컨텐츠 생성 모듈을 포함할 수 있다. 상기 오감 정보 요청 모듈은 외부 서버로 상기 오감 정보 측정기의 정보를 요청할 수 있으며, 상기 오감 멀티미 <19> 디어 컨텐츠 생성 모듈은 생성된 오감 멀티미디어 컨텐츠를 외부의 멀티미디어 컨텐츠 관리 서버로 전송하는 것 을 특징으로 할 수 있다. 상기 오감 멀티미디어 컨텐츠 재생 장치는 시각, 청각, 후각, 미각 또는 촉각 중 적어도 하나의 오감을 재현할 <20> 수 있다. 효 과 본 발명에 따른 오감 멀티미디어 컨텐츠 서비스 제공 시스템에 의하면 기존의 텍스트 및 정지 영상 그리고 동영 <21> 상 등의 미디어가 중심이 되는 정보공유가 아니라, 사람의 오감을 통해 체험되는 멀티미디어 컨텐츠가 중심이 되는 멀티미디어 서비스의 제공하여 더욱 실감이 나는 컨텐츠의 제공이 가능하게 된다. 또한, 사용자가 컨텐츠를 생성할 때 위성으로부터 수신한 고유정보를 포함하므로 참여와 공유 그리고 개방으로 <22> 대표되는 최근의 정보 시스템의 기술적 과제인 저작권에 관한 문제가 다소 해결될 수 있으며, 멀티미디어 생성 시에 위치정보를 포함하므로 기존 위치기반 서비스보다 간편한 공유가 가능하고, 사용자의 위치에 기반을 두는 맞춤형 서비스의 제공이 가능해 질 수도 있다. 발명의 실시를 위한 구체적인 내용 이하, 본 발명에 따른 유비쿼터스 환경에서 오감 멀티미디어 컨텐츠 서비스 제공 시스템에 대하여 첨부된 도면 <23> 을 참조하여 상세히 설명한다. 도 1은 본 발명의 일 실시예에 따른 유비쿼터스 환경에서 오감 멀티미디어 컨텐츠 서비스의 개념을 나타낸 도면 <24> 이다. 도 1에 제시된 바와 같이 위치기반 오감 멀티미디어 컨텐츠 서비스 제공 시스템은 중앙 관리 서버, 사용자 <25> 가 서비스를 이용하기 위한 다수의 휴대 단말기, 일정 위치에 설치되어 오감정보를 측정하는 오감정보 측 정기 등으로 구성될 수 있다. 상기 중앙 관리 서버, 휴대 단말기, 오감정보 측정기는 인공위성 등을 이용하여 데이터를 <26> 송수신할 수 있으나, 통신 방법은 인공위성을 이용하는 것에 한정되지 않으며, 다양한 통신 방식이 이용될 수 있다. 이러한 구성의 오감 멀티미디어 컨텐츠 서비스 시스템은 유비쿼터스 환경에서 오감정보를 활용한 멀티미디어 컨 <27> 텐츠의 생성, 재현 및 전송 기능을 수행한다. 특히, 상기 오감정보는 사용자의 위치정보와 결합되어 보다 정확 하고 유요한 정보가 될 수 있다. 또한, 오감 멀티미디어 컨텐츠 서비스 시스템은 오감 멀티미디어 컨텐츠의 공 유 및 검색 기능 및 사용자 맞춤형 서비스를 위한 지능형 에이전트 기능 등도 제공한다. 이하, 각각의 기능에 대하여 더욱 자세히 살펴보기로 한다. 먼저, 오감 정보를 이용한 멀티미디어 컨텐츠의 생성, 재현 및 전송과 관련된 휴대 단말기의 기능으로는 <28> 다음과 같은 기능들이 존재한다. ① 휴대 단말기는 GPS(global positioning system)를 통해 휴대 단말기의 위치, 현재 시각, 현 <29> 재 날짜, 현재 고도 등의 정보를 획득한다. 즉, 사용자가 위치한 곳의 위도 및 경도 등의 위치 정보를 포함하 는 오감 멀티미디어 컨텐츠의 생성 시 사용할 메타데이터(metadata)인 시각, 날짜, 고도정보를 획득하는 - 7 -공개특허 10-2009-0123383것이다. 상기 GPS를 통해서 획득한 위치 정보는 집단 지능형 공유 및 개인화 서비스를 위한 공유 정보로 써, 오감 멀티미디어 컨텐츠와 함께 주소 등의 필드로 변환되어 중앙 관리 서버의 데이터베이스에 기 록된다. 이와 같이 오감 멀티미디어 컨텐츠에 위치 정보가 결합됨으로써, 사용자의 위치에 따른 컨텐츠 제공이 가능케 된다. ② 휴대용 단말기는 유비쿼터스 환경에서 오감정보의 수집이 가능한 컴퓨터, 즉 오감정보 측정기를 <30> 감지하는 기능을 포함한다. 사용자의 휴대 단말기는 근접하거나 또는 특정 반경 내에 위치한 오감정보의 수집이 가능한 컴퓨터, 즉 오감정보 측정기의 위치를 감지하여 사용자에게 알린다. 감지된 오감정보 측정기와 휴대 단말기를 이용하여 사용자는 언제 어디서나 오감정보를 수집할 수 있 <31> 도록 하는 환경을 제공받을 수 있게 된다. ③ 또한, 휴대 단말기는 수집된 오감정보를 근간으로 위치기반 멀티미디어 컨텐츠를 생성하는 기능을 수행 <32> 한다. 오감정보의 수집이 가능한 오감정보 측정기와 휴대 단말기 간 연동을 통해서, 수집된 시각(동 영상 및 정지영상 등), 청각(사용자의 육성 및 환경 소리 등), 촉각(질감), 후각(냄새), 미각(맛) 등의 사용자 가 체감할 수 있는 오감 정보들은 GPS에서 획득한 정보들과 함께 결합되어 하나의 오감 멀티미디어 컨텐츠 로 가공된다. ④ 본 발명에 따른 오감 멀티미디어 컨텐츠 서비스 제공 시스템은 생성된 멀티미디어 컨텐츠의 재현 및 전송 기 <33> 술을 수행한다. 오감정보 측정기와 사용자의 휴대 단말기 간의 연동을 통해서 생성된 오감 멀티미디 어 컨텐츠는 사용자의 휴대 단말기 상에서 재현(혹은 재생)될 수 있고, 사용자가 입력한 검색용 키워드들 및 컨텐츠의 위치 분류(관광지, 식당, 숙박업소 등의 장소 구분을 위한 분류)와 함께 중앙 관리 서버로 전 송될 수도 있다. 이와 같이 컨텐츠가 중앙 관리 서버로 전송됨으로써 사용자 개인에 의해 생성된 위치기 반 오감 멀티미디어 컨텐츠의 공유 및 집단지능화가 가능케 된다. 다음으로, 본 발명에 따른 오감 멀티미디어 컨텐츠 서비스 제공 시스템 중 중앙 관리 서버가 제공하는 멀티 <34> 미디어 컨텐츠의 공유 및 검색 기술에 대하여 더욱 자세히 살펴본다. ① 위치기반의 멀티미디어 컨텐츠 서비스를 제공하기 위한 중앙 관리 서버는 다수의 유저들이 참여하여 전 <35> 송한 오감 멀티미디어 컨텐츠들의 데이터 웨어하우징(datawarehousing) 기능을 수행할 수 있다. 데이터웨어하우징 기능은 사용자들에 의해 생성되어 전송된 오감 멀티미디어 컨텐츠와 그것과 관련된 위치 정보 <36> 를 수신하고, 이를 중앙 데이터베이스에 저장, 구축하는 기술을 의미한다. ② 멀티미디어 컨텐츠 제공 시스템의 중앙 관리 서버는 상기 ①의 웨어하우징 기능의 세부 기능으로 오감 <37> 멀티미디어 컨텐츠 데이터베이스의 위치기반 자동 카테고라이징(categorizing)을 수행할 수 있다. 사용자에 의해 전송된 위치정보는 중앙 관리 서버에 내장된 지도상의 특정 지점을 가리킨다. 상기 위치정 <38> 보와 결합된 해당 오감 멀티미디어 컨텐츠는 그 지도상의 지점에 대한 정보와 매칭되는 것이다. 즉, 중앙 관리 서버 데이터베이스에 오감 멀티미디어 컨텐츠를 저장하는 경우, GPS로부터 획득 <39> 한 위치정보는 미리 구축된 주소지의 정보로 변환되며 변환된 주소지의 정보가 오감 멀티미디어 컨텐츠와 매핑 되어 저장되는 것이다. 뿐만 아니라, 중앙 관리 서버는 사용자가 수동적으로 선택하거나 입력한 컨텐츠의 위치 분류도 동시에 저 <40> 장하여 관리할 수 있다. ③ 또한, 위치기반 오감 멀티미디어 컨텐츠 제공 시스템은 의미 기반의 주석(annotation)을 자동으로 추출하는 <41> 기능을 수행할 수 있다. 즉, 사용자에 의해 전송된 컨텐츠와 함께 입력된 키워드를 이용하여 의미 기반 주석을 생성하는 것이다. 이러한 의미 기반의 주석은 추후 컨텐츠 검색에 이용된다. 여기서 의미 기반 주석이란, 사용자에 의해 입력된 키워드를 가지고 온톨로지(ontology)를 기반으로 구축된 단 <42> 어 사전에서 동의어 및 다의어를 추출하고, 수신된 컨텐츠가 학습된 오감정보의 특징 데이터베이스로부터 유사 한 특징을 가진 컨텐츠를 찾아 새로운 키워드를 자동적으로 부여하고, 유사한 컨텐츠와 연관 지어 사용자가 지 정한 키워드 이외의 것을 첨가하는 것이다. ④ 또한 위치기반 오감 멀티미디어 컨텐츠 제공 시스템은 오감 멀티미디어 컨텐츠를 대상으로 하는 의미 기반 <43> 검색을 할 수 있다. 의미 기반 검색은 사용자가 특정한 컨텐츠와 유사한 것들을 찾고자 할 때 컨텐츠의 내용을 직접 분석하여 결과를 찾아내는 기술에 해당한다. 이는 오감에 기반을 둔 컨텐츠에서 유사한 오감 정보를 가진 - 8 -공개특허 10-2009-0123383오감 멀티미디어 컨텐츠를 찾아내기 위한 것으로서, 기존의 영상 및 음성 정보를 포함한 멀티미디어에서 사용하 는 내용 기반 검색은 물론, 유사한 후각과 미각 그리고 촉각정보를 가진 컨텐츠를 찾아내기 위한 것이다. ⑤ 오감 멀티미디어 컨텐츠 제공 시스템은 카테고리 기반의 검색 기능을 제공한다. 구체적으로 카테고리로 구 <44> 분된 오감 멀티미디어 컨텐츠들을 트리(tree) 형태로 검색하는 기술에 해당한다. ②번 기술에 따라 카테고리화 된 컨텐츠를 주소지, 키워드, 컨텐츠에 매핑되는 위치 종류 등을 기준으로 하여 분류하고, 분류된 컨텐츠를 각 기준 별 트리 형태로 나타낼 수 있다. ⑥ 또한, 오감 멀티미디어 컨텐츠를 제공하기 위한 중앙 관리 서버는 컨텐츠 위치정보를 기반으로 하는 검 <45> 색 기능을 제공한다. 위치정보 기반 검색이란, 다른 사용자에 의해 공유된 컨텐츠를 사용자가 소유한 휴대형 단말기 상의 지도에 표기하는 검색 기술이다. 이는 GPS로부터 획득한 위도 및 경도를 지도상의 매핑을 통 해서 사용자에게 출력하는 기술이다. 또 다른 카테고리의 중앙 관리 서버 중 에이전트의 기능에 대하여 설명한다. <46> ① 중앙 관리 서버의 에이전트는 사용자의 관심 지역 내에서 컨텐츠 갱신 여부의 실시간 자동 안내 <47> 및 재현을 수행한다. 사용자가 설정한 관심 지역 내에서 새로운 오감 멀티미디어 컨텐츠가 공유되면, 사용자에 게 이러한 공유 사실을 알리는 지능형 기술에 해당한다. 이러한 기능은 사용자의 휴대 단말기에서 사용자 의 의도에 의해 활성화되는 에이전트에 의하여 구현이 가능하다. ② 한편, 위치기반 오감 멀티미디어 컨텐츠 제공 시스템은 컨텐츠의 실시간 자동 안내 및 재현 기능을 <48> 제공한다. 사용자가 현재 위치한 곳을 기준으로, 특정 반경 내에 공유된 오감 멀티미디어 컨텐츠를 사용자가 이동함에 따라서 실시간으로 안내하고, 사용자가 원하는 컨텐츠를 재현하는 기술이다. 이 때, 위도 및 경도를 통한 위치정보는 물론이며 고도까지 고려할 수도 있다. 도 2 본 발명의 일 실시예에 따른 위치기반 집단지능 시스템의 아키텍처를 나타낸 도면이다. <49> 도 2에 도시된 바와 같이 위치기반 집단지능 시스템은 크게 중앙 관리 서버, 휴대 단말기, 오감정보 <50> 측정기, 인공위성 및 GPS 시스템 등으로 구성될 수 있다. 먼저 휴대 단말기는 사용자들에게 오감 멀티미디어 컨텐츠 서비스를 받고자 하는 사용자가 휴대하는 터미 <51> 널에 해당한다. 상기 휴대 단말기는 오감정보를 측정하고, 이를 이용하여 멀티미디어 컨텐츠를 생성 및 가공하는 기능을 포함한다. 한편, 휴대 단말기는 주위에 정밀한 오감정보 측정기가 존재하는 여부를 중앙 관리 서버의 에이 <52> 전트 통신부로부터 통보받을 수 있다. 사용자는 휴대 단말기 및 오감정보 측정기로부터 해당 위치에 따른 오감정보 및 GPS로부터 위치정보를 획득한다. 휴대단말기는 획득한 정보들을 융합하여 위치기반 오감 멀티미디어 컨텐츠를 생성하는 것이다. 이와 같이 생성된 오감 멀티미디어 컨텐츠는 중앙 관리 서버로 전송되며, 중앙 관리 서버는 사용자가 <53> 보내온 오감 멀티미디어 컨텐츠를 위치 기반으로 분류하고, 의미 기반 주석 추출을 수행하고, 사용자가 입력한 컨텐츠의 분류(관광지, 상점, 바다, 산 등의 위치 분류)에 따라 데이터베이스에 저장한다. 중앙 관리 서버의 에이전트는 항상 사용자와 연결을 유지하면서 사용자의 현재 위치에 기반한 특정 <54> 반경 내의 컨텐츠 알림, 관심 지역 내에 새로이 공유된 컨텐츠 알림 등을 수행하게 된다. 도 3은 본 발명에 따른 위치기반 집단지능 시스템 데이터베이스의 구조를 나타낸 것이다. <55> 중앙 관리 서버의 데이터베이스는 주소지 DB, 컨텐츠 DB, 카테고리 DB 등을 구분하여 <56> 저장할 수 있다. 여기서 주소지 DB는 국가(country), 주소(address), 위도 정보(s_latitude, e_latitude), 경도 <57> (s_longitude, e_latitude) 등의 ID 필드를 포함할 수 있다. 또한, 컨텐츠 DB는 컨텐츠별로 메시지 정보 (msg), 주소(address), 카테고리(category), 시간(datetime), 고도(altitude), 파일정보(file) 등의 ID 필드를 포함할 수 있다. 여기서 주소지 DB와 컨텐츠 DB는 각 DB의 address 필드를 매칭시킴으로써 연결될 수 있다. 한편, 카테고리 DB는 카테고리의 이름(name) ID를 포함한다. 상기 카테고리 DB의 name ID 필드와 컨 <58> 텐츠 DB의 category ID 필드가 매칭됨으로써 컨텐츠 DB와 카테고리 DB는 연결될 수 있다. - 9 -공개특허 10-2009-0123383도 4는 본 발명의 다른 실시예에 따른 위치기반 집단지능 시스템을 이용한 서비스 제공을 위한 휴대 단말기의 <59> 구성을 나타낸 도면이다. 도 4에 도시된 바와 같이 본 발명에 따른 휴대 단말기는 오감 멀티미디어 처리부, 중앙처리장치 <60> , 메모리부, RF 신호처리부, 키 입력부, 디스플레이부, 스피커, 기타 오감 재 생 장치 등으로 구성될 수 있다. 중앙처리장치는 휴대 단말기의 통신제어기능과 기타 휴대폰 환경관리 등 휴대 단말기의 전반적 <61> 인 제어를 수행하는 구성 요소에 해당한다. RF 신호처리부는 안테나를 통하여 입력되는 무선데이터 신호 및 RF 음성 신호를 변복조 처리하는 구성 요소에 해당한다. 키 입력부는 사용자로 하여금 휴대 단말기 가 제공하는 메뉴 또는 기능을 선택하고, 알파벳, 숫자 등의 문자를 입력하는 인터페이스에 해당한다. 휴 대 단말기의 메모리부에는 휴대 단말기의 운영체제 프로그램, 응용 소프트웨어 및 사용자가 다 운로드한 데이터 등이 저장된다. 본 발명에 따른 휴대 단말기의 핵심적 기능 블록인 오감 멀티미디어 처리부는 오감 멀티미디어 컨텐 <62> 츠를 생성, 재생하는 동작을 수행한다. 상기 오감 멀티미디어 처리부는 오감 정보 요청 모듈, 오감 멀티미디어 컨텐츠 생성 모듈 및 오감 멀티미디어 컨텐츠 재생 모듈의 세부 구성을 가질 수 있다. 오감 정보 요청 모듈은 휴대 단말기 외부에 위치하는 오감정보 측정기로 오감 정보를 요청하고, <63> 오감정보 측정기로부터 오감 정보를 전달받는다. 또한, 오감 정보 요청 모듈은 휴대 단말기 주 위의 오감정보 측정기를 파악하기 위하여 중앙 관리 서버로 오감정보 측정기의 정보를 요청할 수도 있다. 오감 멀티미디어 컨텐츠 생성 모듈은 오감정보 측정기로부터 수신한 오감 정보 측정 결과와 상기 휴 <64> 대 단말기의 위치를 결합하여 오감 멀티미디어 컨텐츠를 생성하는 역할을 수행한다. 여기서 오감 멀티미 디어 컨텐츠 생성 모듈은 GPS 시스템으로부터 위도, 경도, 고도 등 휴대 단말기의 위치 정보를 획득할 수 있다. 또한, 상기 오감 멀티미디어 컨텐츠 생성 모듈은 생성한 오감 멀티미디어 컨텐츠를 중앙 관리 서버로 <65> 제공하여, 다른 유저들과 상기 컨텐츠를 공유할 수 있다. 오감 멀티미디어 처리부의 오감 멀티미디어 컨텐츠 재생 모듈은 자신의 메모리부 등에 저장한 <66> 컨텐츠 또는 중앙 관리 서버로부터 제공되는 오감 멀티미디어 컨텐츠를 재생하는 역할을 담당한다. 이러 한 컨텐츠는 디스플레이부, 스피커 및 기타 오감 재생 장치 등을 통하여 재현 또는 재생될 수 있다. 도 5는 본 발명의 실시예에 따른 위치기반 집단지능 시스템을 이용한 서비스 제공 방법을 나타낸 도면이다. <67> 도 2, 4 등에서 제공하는 중앙 관리 서버, 휴대 단말기 등을 통하여, 유저들은 도 5와 같이 오감 멀 <68> 티미디어 컨텐츠 서비스를 제공받을 수 있다. 도 5의 최상단에서 볼 수 있듯이 n명의 유저는 자신의 휴대 단말기를 이용하여 오감 멀티미디어 컨텐츠를 <69> 생성한다. 이들이 생성한 컨텐츠는 오감 정보 시스템 중 중앙 관리 서버로 전달된다. n명에 의해 공유된 m개의 위치기반 오감 멀티미디어 컨텐츠들은 중앙 관리 서버에 의하여 집단 <70> 지능화된다. 즉, 중앙 관리 서버는 웨어하우징, 카테고라이징, 주석 자동 추출 기능 등을 통하여 m개의 위치기반 오감 멀티미디어 컨텐츠를 자동으로 분류하게 된다. 또한, 중앙 관리 서버는 유저가 컨텐츠의 내용, 위치정보, 카테고리 등을 검색어로 하여 컨텐츠를 검색할 수 있도록 한다. 한편, 중앙 관리 서버는 컨텐츠를 요청한 유저의 현재 위치에 따른 컨텐츠를 제공할 수도 있으며, 유저가 <71> 관심을 보이는 지역에 대한 컨텐츠를 제공할 수도 있다. 사용자는 자신의 휴대 단말기 지도상에 표시된 공유 컨텐츠를 선택함으로써, 그 지역과 관련하여 공유된 <72> 컨텐츠를 재현할 수 있다. 사용자는 이와 같이 공유된 컨텐츠에 대하여 텍스트 또는 음성을 통하여 코멘트 등 을 작성하여 저장함으로써 다른 사람이 참조할 수 있도록 한다. 한편, 휴대 단말기는 사용자의 선택에 따라 특정 컨텐츠와 유사한 내용을 가진 컨텐츠를 검색하기 위해 내 <73> 용 기반 검색을 수행할 수 있다. 본 발명에서 제시하는 내용 기반 검색은 유사한 시각, 청각, 촉각, 후각, 미 각을 가지는 오감 멀티미디어 컨텐츠를 검색한다는 것이다. 이것은 중앙 관리 서버에서 저장된 컨텐츠들 - 10 -공개특허 10-2009-0123383을 가지고 특징 추출을 수행하여 유사한 특징을 가진 컨텐츠를 순위별로 나열하는 방식으로 구현될 수 있다. 이상에서 대표적인 실시예를 통하여 본 발명에 대하여 상세하게 설명하였으나, 본 발명이 속하는 기술 분야에서 <74> 통상의 지식을 가진 자는 상술한 실시예에 대하여 본 발명의 범주에서 벗어나지 않는 한도 내에서 다양한 변형 이 가능함을 이해할 것이다. 그러므로 본 발명의 권리 범위는 설명된 실시예에 국한되어 정해져서는 안 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 것들에 의하여 정해져야 한다."}
