{"patent_id": "10-2020-0093197", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0013792", "출원번호": "10-2020-0093197", "발명의 명칭": "인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법", "출원인": "박성우", "발명자": "박성우"}}
{"patent_id": "10-2020-0093197", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 학생 단말기(300), 강사 단말기(200) 및 멘토 단말기(400)와 네트워크망(500)을 통해 연결되는인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템의 인공지능을 이용한 에듀테크 학습 관리 플랫폼서비스 방법으로서,상기 학생 단말기(300)가 접속하면, 서버(110)가 정당한 가입자인지 인증하는 단계;인증이 완료되면 상기 서버(110)가 메뉴 정보를 학생 단말기(300)에 제공하는 단계;상기 서버(110)가 메뉴 정보가 선택되었는지 판단하는 단계;학생 단말기(300)에 위해 메뉴가 선택되면, 상기 서버(110)가 선택된 메뉴에 따라 문제은행 정보, 컨설팅 정보,체험학습 정보, 유학 정보, 도서 정보, 예체능 정보중 적어도 하나의 정보를 제공하는 단계를 포함하는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 방법."}
{"patent_id": "10-2020-0093197", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 선택된 메뉴가 문제 은행 정보인 경우, 상기 서버(110)가 상기 학생의 성적에 대응하는 일별, 주별 및 월별 문제를 제공하는 단계;상기 선택된 메뉴가 컨설팅인 경우, 상기 서버(110)가 상기 학생의 과목별 성적에 대응하는 모의지원 컨설팅 정보, 수시지원 컨설팅 정보 또는 정시지원 컨설팅 정보를 제공하는 단계를 더 포함하는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 방법."}
{"patent_id": "10-2020-0093197", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 선택된 메뉴가 체험 학습 정보인 경우, 상기 서버(110)가 상기 학생의 과목별 성적에 대응하는 체험 학습정보를 제공하는 단계;상기 선택된 메뉴가 유학 정보인 경우, 상기 학생의 과목별 성적에 대응하는 유학 정보를 제공하는 단계;상기 선택된 메뉴가 도서 정보인 경우, 상기 학생의 과목별 성적에 대응하는 도서 정보를 제공하는 단계;상기 선택된 메뉴가 예체능 정보인 경우, 상기 학생의 과목별 성적에 대응하는 예체능 정보를 제공하는 단계를더 포함하는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 방법."}
{"patent_id": "10-2020-0093197", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "적어도 하나의 학생 단말기(300), 강사 단말기(200) 및 멘토 단말기(400)와 네트워크망(500)을 통해 연결되는인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템으로서,학생의 정보, 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정보, 예체능 정보를 저장하는 데이터베이스부(120);상기 학생 단말기(300)가 접속하면 인증을 하고, 상기 학생 단말기(300)에 위해 메뉴가 선택되면, 선택된 메뉴에 따라 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정보, 예체능 정보중 적어도 하나의 정보를 제공하는 서버(110)를 포함하는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템."}
{"patent_id": "10-2020-0093197", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,공개특허 10-2022-0013792-3-상기 데이터베이스부(120)는,학생의 정보를 저장하는 학생 정보 DB(121);강사의 정보를 저장하는 강사정보 DB(122);멘토의 정보를 저장하는 멘토 DB(123);문제은행 정보를 저장하는 문제은행 정보 DB(124);컨설팅 정보를 저장하는 컨설팅 정보 DB(125);체험학습 정보를 저장하는 체험학습 정보DB(126);유학 정보를 저장하는 유학 정보 DB(127);도서 정보를 저장하는 도서 정보 DB(128);예체능 정보를 저장하는 예체능 정보 DB(129);학습에 관한 부가 정보를 저장하는 부가정보 DB(130)를 포함하는 인공지능을 이용한 에듀테크 학습 관리 플랫폼서비스 시스템."}
{"patent_id": "10-2020-0093197", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 서버(110)는, 상기 선택된 메뉴가 문제 은행 정보인 경우, 상기 학생의 성적에 대응하는 일별, 주별 및 월별 문제를 제공하는문제은행 제공부(111);상기 선택된 메뉴가 컨설팅인 경우, 상기 학생의 과목별 성적에 대응하는 모의지원 컨설팅 정보, 수시지원 컨설팅 정보 또는 정시지원 컨설팅 정보를 제공하는 컨설팅 제공부(112);상기 선택된 메뉴가 체험 학습 정보인 경우, 상기 학생의 과목별 성적에 대응하는 체험 학습 정보를 제공하는체험학습정보 제공부(113);상기 선택된 메뉴가 유학 정보인 경우, 상기 학생의 과목별 성적에 대응하는 유학 정보를 제공하는 유학정보 제공부(114);상기 선택된 메뉴가 도서 정보인 경우, 상기 학생의 과목별 성적에 대응하는 도서 정보를 제공하는 도서정보 제공부(115);상기 선택된 메뉴가 예체능 정보인 경우, 상기 학생의 과목별 성적에 대응하는 예체능 정보를 제공하는 예체능정보 제공부(116);회원 인증을 하고 부가 정보를 제공하는 회원 관리부(117)를 포함하는 인공지능을 이용한 에듀테크 학습 관리플랫폼 서비스 시스템."}
{"patent_id": "10-2020-0093197", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 서버(110)는,상기 학생단말기, 강사 단말기(200) 및 멘토 단말기(400) 간의 실시간 강의를 제공하는 강의 제공부(118);상기 학생 단말기(300)로부터 수신되는 음성을 텍스트로 변환하여 인식하고 그에 대응하는 정보를 텍스트 형태의 음성으로 변환하여 제공하고, 질문에 대한 응답이 없는 경우 멘토 단말기(400)에 알려서 답변을 하도록 하는챗봇(119)을 더 포함하고,상기 챗봇은 정보를 음성으로 변환하여 제공하는 TTS 기능 및 수신되는 음성을 텍스트로 변환하는 STT 기능을구비하는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템.공개특허 10-2022-0013792-4-"}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 적어도 하나의 학생 단말기, 강사 단말기 및 멘토 단말기와 네트워크망을 통해 연결되는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법에 관한 것이다. 에듀테크 학습 관리 플랫폼 서비스 시스템은, 학생의 정보, 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정 보, 예체능 정보를 저장하는 데이터베이스부; 상기 학생 단말기가 접속하면 인증을 하고, 상기 학생 단말기에 위해 메뉴가 선택되면, 선택된 메뉴에 따라 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정 보, 도서 정보, 예체능 정보중 적어도 하나의 정보를 제공하는 서버를 포함한다. 이러한 본 발명의 실시예 에서는, 인공지능을 이용한 에듀테크로 교육 및 평가 방법을 구현하여 시간, 공간의 제약을 극복하고 교육 및 평 가 내용의 질적 향상과 공정한 교육 및 평가를 구현할 수 있다."}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법에 관한 것으로 특히, 자기주도 학습을 하는 학생, 독서실에서 공부하는 학생, 학원생, 학교에서 공부하는 학생 등 다양한 환경의 학생들에게 문제은행, 입시정보, 체험학습, 유학 정보, 도서 정보, 예체능 정보 등 다양한 정보를 제공하는, 인공지능을 이 용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 통신기술과 컴퓨터 분야의 급격한 발전과 더불어 컴퓨터 통신 및 인터넷 통신이 현대인에게는 정보 습득과 교류의 장으로서 하나의 필수적인 수단이 되었으며, 그 기능 및 역할이 폭발적으로 증대되고 있는 추세 이다. 한편, 학교나 학원 등 다양한 학습 기관에서는 강의식 교육 또는 가정 방문식 교육 등 다양한 방식으로 학생들 에게 학습 서비스를 제공하고 있다. 그리고 최근에는 코로나의 영향으로 비대면 교육이 강조되고 있으며, 동영상 또는 실시간 화상 학습 등의 다양 한 방식으로 온라인 교육이 진행되고 있다. 그런데 종래의 온-오프라인 교육 형태는 다음과 같은 문제점을 갖고 있었다. 첫째, 학원의 강의식 교육 방식은 다수의 학생을 대상으로 강의를 진행하는 관계로 인해 학생 개개인에 대한 정 확한 분석 및 일대일 첨삭지도와 학업성취도 파악이 어려운 문제점이 있었다. 둘째, 가정방문식 교육방식은 개개인에 대한 정보 및 학업 성취도 파악은 가능하나 주어진 짧은 시간 내에 학습 지도를 하기에 역부족인 시간적 제약이 따랐다. 또한, 종래에 학원의 지도방법과 학습방법은, 학생이 직접 학원으로 이동하여 강의를 들어야 함으로써 시간소비 와 함께, 범죄에 노출되고 탈선위험이 상존한다는 문제점이 있었을 뿐만 아니라, 일방적인 문제풀이로 학습의 질보다 양을 중시함으로써 학생 개개인의 수준과 능력에 맞는 학습이 제대로 이루어지지 못했다. 한편, 방문과외의 경우 개인에게 맞는 학습이 가능하고 단기간 내에 성적을 향상시킬 수 있다는 긍정적인 면이 있는 것이 사실이나, 의존적 경향의 학생을 양산하고 고액과외에 따른 사회적 문제가 대두되기에 이르렀다. 이 에, 효과적이면서도 저렴한 학습 시스템이 필요하였고, 이러한 시대적 요청에 따라 등장한 것이 가정방문 학습 시스템이다. 그러나, 최근에 이르러서 가정방문 학습시스템은 여러 가지 제약조건으로 인해 교사의 책임감 결여에 따른 형식 적 지도, 단시간 관리에 따른 피드백(Feed-back)기능결여, 객관적 평가 기준의 미비, 교과서와 무관한 내용편성 , 시간적, 공간적 제한으로 인해 현실적으로 1:1 관리가 거의 불가능한 실정이다. 즉, 피드백(Feed-back)기능 이 부족하여 실효를 거두기 어렵다는 단점을 안고 있다. 그리고, 종래에는 학원의 강사의 개인 능력이 떨어지는 경우 도는 입시의 복잡함에 따라 효율적인 입시 컨설팅 이 이루어지지 못하는 문제가 있다."}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적 과제는 종래의 문제점을 해결하고자 하는 것으로, 인공지능을 이용한 에듀테크 로 교육 및 평가 방법을 구현하여 시간, 공간의 제약을 극복하고 교육 및 평가 내용의 질적 향상과 공정한 교육 및 평가를 구현하는, 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법을 제공하는 것이다. 또한, 본 발명이 이루고자 하는 기술적 과제는 종래의 불편한 점을 개선하고자 하는 것으로, 인공지능을 이용한 에듀테크로 각 과목별 문제 은행을 온라인을 통해 배포하고, 배포된 문제를 사용자가 풀면 이에 대응하여 사용 자의 문제풀이에 대한 채점 및 부족한 부분에 대한 티칭을 실시하는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법을 제공하는 것이다. 또한, 본 발명이 이루고자 하는 기술적 과제는 종래의 불편한 점을 개선하고자 하는 것으로, 인공지능을 이용한 에듀테크로 학생 개개인에 최적화된 입시 컨설팅을 제공하여 자신의 지역에 관계없이 최적의 교육 서비스를 받 을 수 있는, 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법을 제공하는 것이다. 또한, 본 발명이 이루고자 하는 기술적 과제는 종래의 불편한 점을 개선하고자 하는 것으로, 자기주도 학습을 하는 학생, 독서실에서 공부하는 학생, 학원생, 학교에서 공부하는 학생 등 다양한 환경의 학생들에게 문제은행, 입시정보, 체험학습, 유학 정보, 도서 정보, 예체능 정보 등 다양한 정보를 제공하는, 인공지능을 이 용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법을 제공하는 것이다."}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 과제를 해결하기 위한 본 발명의 특징에 따른 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 방 법은, 적어도 하나의 학생 단말기, 강사 단말기 및 멘토 단말기와 네트워크망을 통해 연결되는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템의 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 방법으로서, 상기 학생 단말기가 접속하면, 서버가 정당한 가입자인지 인증하는 단계; 인증이 완료되면 상기 서버가 메뉴 정보를 학생 단말기에 제공하는 단계; 상기 서버가 메뉴 정보가 선택되었는지 판단하는 단계; 학생 단말기에 위해 메뉴가 선택되면, 상기 서버가 선택된 메뉴에 따라 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정보, 예체능 정보중 적어도 하나의 정보를 제공하는 단계를 포함한다."}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "상기 선택된 메뉴가 문제 은행 정보인 경우, 상기 서버가 상기 학생의 성적에 대응하는 일별, 주별 및 월 별 문제를 제공하는 단계를 더 포함한다. 상기 선택된 메뉴가 컨설팅인 경우, 상기 서버가 상기 학생의 과목별 성적에 대응하는 모의지원 컨설팅 정 보, 수시지원 컨설팅 정보 또는 정시지원 컨설팅 정보를 제공하는 단계를 더 포함한다. 상기 선택된 메뉴가 체험 학습 정보인 경우, 상기 서버가 상기 학생의 과목별 성적에 대응하는 체험 학습 정보를 제공하는 단계를 더 포함한다. 상기 선택된 메뉴가 유학 정보인 경우, 상기 학생의 과목별 성적에 대응하는 유학 정보를 제공하는 단계를 더 포함한다. 상기 선택된 메뉴가 도서 정보인 경우, 상기 학생의 과목별 성적에 대응하는 도서 정보를 제공하는 단계를 더 포함한다. 상기 선택된 메뉴가 예체능 정보인 경우, 상기 학생의 과목별 성적에 대응하는 예체능 정보를 제공하는 단계를 더 포함한다. 이러한 과제를 해결하기 위한 본 발명의 특징에 따른 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시 스템은, 적어도 하나의 학생 단말기, 강사 단말기 및 멘토 단말기와 네트워크망을 통해 연결되는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템으로서, 학생의 정보, 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정보, 예체능 정보를 저장하는 데 이터베이스부; 상기 학생 단말기가 접속하면 인증을 하고, 상기 학생 단말기에 위해 메뉴가 선택되면, 선택된 메뉴 에 따라 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정보, 예체능 정보중 적어도 하나의 정 보를 제공하는 서버를 포함한다. 상기 데이터베이스부는, 학생의 정보를 저장하는 학생 정보 DB; 강사의 정보를 저장하는 강사정보 DB; 멘토의 정보를 저장하는 멘토 DB; 문제은행 정보를 저장하는 문제은행 정보 DB; 컨설팅 정보를 저장하는 컨설팅 정보 DB; 체험학습 정보를 저장하는 체험학습 정보DB; 유학 정보를 저장하는 유학 정보 DB; 도서 정보를 저장하는 도서 정보 DB; 예체능 정보를 저장하는 예체능 정보 DB; 학습에 관한 부가 정보를 저장하는 부가정보 DB를 포함한다. 상기 서버는, 상기 선택된 메뉴가 문제 은행 정보인 경우, 상기 학생의 성적에 대응하는 일별, 주별 및 월별 문제를 제공하는 문제은행 제공부; 상기 선택된 메뉴가 컨설팅인 경우, 상기 학생의 과목별 성적에 대응하는 모의지원 컨설팅 정보, 수시지원 컨설 팅 정보 또는 정시지원 컨설팅 정보를 제공하는 컨설팅 제공부; 상기 선택된 메뉴가 체험 학습 정보인 경우, 상기 학생의 과목별 성적에 대응하는 체험 학습 정보를 제공하는 체험학습정보 제공부; 상기 선택된 메뉴가 유학 정보인 경우, 상기 학생의 과목별 성적에 대응하는 유학 정보를 제공하는 유학정보 제 공부; 상기 선택된 메뉴가 도서 정보인 경우, 상기 학생의 과목별 성적에 대응하는 도서 정보를 제공하는 도서정보 제 공부; 상기 선택된 메뉴가 예체능 정보인 경우, 상기 학생의 과목별 성적에 대응하는 예체능 정보를 제공하는 예체능 정보 제공부; 회원 인증을 하고 부가 정보를 제공하는 회원 관리부를 포함한다. 상기 서버는, 상기 학생단말기, 강사 단말기 및 멘토 단말기 간의 실시간 강의를 제공하는 강의 제공부; 상기 학생 단말기로부터 수신되는 음성을 텍스트로 변환하여 인식하고 그에 대응하는 정보를 텍스트 형태 의 음성으로 변환하여 제공하고, 질문에 대한 응답이 없는 경우 멘토 단말기에 알려서 답변을 하도록 하는 챗봇을 더 포함한다. 상기 챗봇은 정보를 음성으로 변환하여 제공하는 TTS 기능 및 수신되는 음성을 텍스트로 변환하는 STT 기능을 구비한다."}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에서는, 인공지능을 이용한 에듀테크로 교육 및 평가 방법을 구현하여 시간, 공간의 제약을 극 복하고 교육 및 평가 내용의 질적 향상과 공정한 교육 및 평가를 구현하는, 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법을 제공할 수 있다. 또한, 본 발명의 실시예에서는, 인공지능을 이용한 에듀테크로 각 과목별 문제 은행을 온라인을 통해 배포하고, 배포된 문제를 사용자가 풀면 이에 대응하여 사용자의 문제풀이에 대한 채점 및 부족한 부분에 대한 티칭을 실시하는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법을 제공할 수 있다. 또한, 본 발명의 실시예에서는, 인공지능을 이용한 에듀테크로 학생 개개인에 최적화된 입시 컨설팅을 제공하여 자신의 지역에 관계없이 최적의 교육 서비스를 받을 수 있는, 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서 비스 시스템 및 방법을 제공할 수 있다. 또한, 본 발명의 실시예에서는, 자기주도 학습을 하는 학생, 독서실에서 공부하는 학생, 학원생, 학교에서 공부 하는 학생 등 다양한 환경의 학생들에게 문제은행, 입시정보, 체험학습, 유학 정보, 도서 정보, 예체능 정보 등 다양한 정보를 제공하는, 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템 및 방법을 제공할 수 있 다."}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하의 본 발명의 실시예는 금융기관에서 상담을 진행하는데 있어서, 단순히 펀드에만 국한되는 것이 아니라 펀 드, 신착, 방카슈랑스, 대출, 콜센터 상담 등 다양한 금융상품 판매 과정에 적용될 수 있다. 도 1은 본 발명의 실시예에 따른 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템의 구성도이다. 도 1을 참조하면, 본 발명의 실시예에 따른 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템은, 적어도 하나의 학생 단말기, 강사 단말기 및 멘토 단말기와 네트워크망을 통해 연결되는 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템으로서, 학생의 정보, 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정보, 예체능 정보를 저장하는 데 이터베이스부; 상기 학생 단말기가 접속하면 인증을 하고, 상기 학생 단말기에 위해 메뉴가 선택되면, 선택된 메뉴 에 따라 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정보, 예체능 정보중 적어도 하나의 정 보를 제공하는 서버를 포함한다. 상기 데이터베이스부는, 학생의 정보를 저장하는 학생 정보 DB; 강사의 정보를 저장하는 강사정보 DB; 멘토의 정보를 저장하는 멘토 DB; 문제은행 정보를 저장하는 문제은행 정보 DB; 컨설팅 정보를 저장하는 컨설팅 정보 DB; 체험학습 정보를 저장하는 체험학습 정보DB; 유학 정보를 저장하는 유학 정보 DB; 도서 정보를 저장하는 도서 정보 DB; 예체능 정보를 저장하는 예체능 정보 DB; 학습에 관한 부가 정보를 저장하는 부가정보 DB를 포함한다. 상기 서버는, 상기 선택된 메뉴가 문제 은행 정보인 경우, 상기 학생의 성적에 대응하는 일별, 주별 및 월별 문제를 제공하는 문제은행 제공부; 상기 선택된 메뉴가 컨설팅인 경우, 상기 학생의 과목별 성적에 대응하는 모의지원 컨설팅 정보, 수시지원 컨설 팅 정보 또는 정시지원 컨설팅 정보를 제공하는 컨설팅 제공부; 상기 선택된 메뉴가 체험 학습 정보인 경우, 상기 학생의 과목별 성적에 대응하는 체험 학습 정보를 제공하는 체험학습정보 제공부; 상기 선택된 메뉴가 유학 정보인 경우, 상기 학생의 과목별 성적에 대응하는 유학 정보를 제공하는 유학정보 제 공부; 상기 선택된 메뉴가 도서 정보인 경우, 상기 학생의 과목별 성적에 대응하는 도서 정보를 제공하는 도서정보 제 공부; 상기 선택된 메뉴가 예체능 정보인 경우, 상기 학생의 과목별 성적에 대응하는 예체능 정보를 제공하는 예체능 정보 제공부; 회원 인증을 하고 부가 정보를 제공하는 회원 관리부; 상기 학생단말기, 강사 단말기 및 멘토 단말기 간의 실시간 강의를 제공하는 강의 제공부; 상기 학생 단말기로부터 수신되는 음성을 텍스트로 변환하여 인식하고 그에 대응하는 정보를 텍스트 형태 의 음성으로 변환하여 제공하고, 질문에 대한 응답이 없는 경우 멘토 단말기에 알려서 답변을 하도록 하는 챗봇을 포함한다. 상기 챗봇은 정보를 음성으로 변환하여 제공하는 TTS 기능 및 수신되는 음성을 텍스트로 변환하는 STT 기 능을 구비한다. 도 2는 도 1의 학생 단말기의 내부 블록 구성도이다. 도 2를 참조하면, 학생 단말기는, 입력부, GPS부, 저장부, 카메라부, 통신부, 제어부, 표시부를 포함한다. 표시부는 입력부 선택에 따라 다양한 화면 정보를 표시한다. 입력부는 터치패널, 키패드 등의 입력장치가 포함될 수 있으며, 사용자가 메뉴선택을 하기 위하여 사용한 다. GPS부는 적어도 두개의 GPS 위성으로부터 GPS 신호를 수신하여 자신의 위치정보를 생성하여 출력한다. 필 요에 따라 GPS부를 생략하고, 이동 통신사에서 제공하는 위치정보를 이용할 수도 있다. 저장부는 학습을 위한 앱 프로그램을 저장할 수 있고, 카메라부에서 촬영되는 촬영정보를 저장할 수도 있 다. 카메라부는 입력부의 선택에 따라 촬영한다. 제어부는 서버로부터 수신되는 내용을 상기 표시부에 표시하고, 상기 입력부에 의해 입력 된 정보를 상기 서버로 전달한다. 통신부는 제어부의 제어에 따라 정보를 송수신하며, 블루투스 방식 또는 와이파이 방식, 3G, 4G 등 다양한 무선 인터넷이나 다른 무선 통신망을 이용할 수도 있다. 상기 서버는 학생 단말기가 모바일 또는 웹 링크를 통해서도 접근 가능하도록 한다. 상기 학생 단말기는 학생이 접근 가능한 PC, 스마트폰, 태플릿 PC를 포함한다. 이러한 구성을 가진 본 발명의 실시예에 따른 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템의 동작을 설명하면 다음과 같다. 도 3은 본 발명의 실시예에 따른 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 방법의 동작흐름도이다. 도 3을 참조하면, 먼저, 상기 학생 단말기가 서버에 접속하고(S200), 서버의 회원 관리부 가 학생정보 DB를 참조하여 접속한 학생이 정당한 가입자인지 인증한다(S210). 인증이 안되는 경우, 회원 가입을 할 수 있고(S220), 필요에 따라 회원 인증 절차는 생략 가능하다. 한편, 강사 또는 멘토도 서버에 접속하여 필요한 정보를 얻을 수 있다. 회원 관리부가 강사정보 DB와 멘토정보 DB를 참조하여 접속한 강사와 멘토가 정당한 가입자인지 인증할 수 있다. 인증이 완료되면 상기 서버가 메뉴 정보를 학생 단말기에 제공한다(S230). 이러한 메뉴 정보는 문제 은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정보, 예체능 정보 제공 등 다양하며, 필요에 따라 추가, 수정 및 삭제가 가능하다. 이 상태에서 학생은 학생 단말기로 자신이 원하는 메뉴를 선택한다. 그러면, 상기 서버가 메뉴 정보가 선택되었는지 판단한다(S240). 학생 단말기에 위해 메뉴가 선택되면, 상기 서버가 선택된 메뉴에 따라 문제은행 정보, 컨설팅 정보, 체험학습 정보, 유학 정보, 도서 정보, 예체능 정보중 적어도 하나의 정보를 제공한다(S250)."}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 선택된 메뉴가 문제 은행 정보인 경우, 상기 서버의 문제은행 제공부가 상기 학생의 성적에 대 응하는 일별, 주별 및 월별 문제를 문제은행 정보 DB를 참조하여 제공한다. 일별 문제는 과목당 3~5문제를 제공하고, 주별은 주단위로 제공된 틀린 문제와 유사한 문제를 묶어서 보내주고, 월별 문제는 학생이 틀린 문제 즉, 취약 부분 문제를 발췌하여 보내준다. 그리고 필요시에 해당 문제 풀이시 해당문제의 교과서의 목차 및 해당 페이지 부분을 제공하여 학생이 좀 더 용이하게 이해하도록 한다. 이때, 서버의 문제은행 제공부는 학생의 학년, 점수 및 등급에 대응되는 해당 과목의 문제를 제공하 고, 채점 및 오답 풀이를 한다. 그리고, 오답 풀이시 서버는 설명 및 틀린 문제와 유사한 문제를 제공하 여 취약 부분을 강화하도록 한다. 그리고 학생의 학부모에게도 학부모 단말기에 학생의 점수 및 전국석차에 대해 알람을 할 수 있다. 또한, 학생의 토털 점수가 확인되면 서버는 학생의 토털 성적으로 지원이 가능한 대학 및 학과에 대하여 알람을 하고, 학생 선택에 따라 좀 더 자세한 컨설팅을 제공할 수도 있다. 그리고 학생의 취약 부분에 대해 개 선안을 제공할 수도 있다. 상기 선택된 메뉴가 컨설팅인 경우, 상기 서버의 컨설팅 제공부가 컨설팅정보 DB를 참조하여 상 기 학생의 과목별 성적에 대응하는 모의지원 컨설팅 정보, 수시지원 컨설팅 정보 또는 정시지원 컨설팅 정보를 제공한다. 여기서, 서버는 학생의 과목별 성적에 대응하여 각 대학별 전형방법에 매칭시켜, 모의지원, 수 시지원 및 정시지원시 지원 가능한 대학 및 학과에 대하여 컨설팅을 제공한다. 즉, 모의지원 컨설팅에서는 현재 상황에서 남은 기간 시기별로 해야할 것은 무엇인지에 대한 코칭 및 계획을 제 공할 수 있다. 그리고 수신지원 컨설팅에서는 학생부가 완료된 시점에서 수시 원서 접수 전까지 완성된 학생부와 자기소개서를 분석하여 수시 개월 지원 전략에 대한 코팅을 제공할 수 있다. 정시지원 컨설팅에서는 수능 성적 발표 이후 정시 원서 접수전까지 진행하며, 수능 성적 분석후에 정기 가, 나, 다군 지원에 관한 컨설팅 정보를 제공한다. 이때, 필요에 따라서는 챗봇이 컨설팅에 대한 궁급한 점을 문답식으로 제공할 수도 있다. 이러한 컨설팅을 챗 봇이 인공지능으로 제공함으로써 코디네이터에게 값비싼 비용으로 컨설팅을 받지 않아도 자신에게 적합한 대학 및 학과를 컨설팅받을 수 있다. 또한, 서버의 컨설팅 제공부는 학생의 지원 가능한 대학 및 학과에 대한 학생부 관리, 자기소개서 및 면접에 관한 컨설팅 정보를 제공해줄 수 있다. 학생부 관리는 고입 및 대입을 위한 전략적 학생부 관리 정보를 제공하며, 진로를 고려한 교과 및 비교과 계획 및 수행 관리 정보를 제공한다.자기소개서 관리는 특목고 2단계 최종 합격을 위한 자기소개서 컨설팅 정보, 대입 수시 전형 1단계 서류평가 합 격을 위한 컨설팅 정보, 학생부 전략적 보완 및 합격하는 컨설팅 정보 등을 제공할 수 있다. 면접은 특목고 최종 합격을 대비하는 면접 컨설팅, 대입 수시전형 최종 합격을 위한 면접 컨설팅, 각 대학의 구술고사 제시문, 의대나 과기원 등의 인적성 면접 정보 등의 컨설팅 정보를 제공할 수 있다. 이외에도 서버는 초, 중, 고 입시를 알고 싶은 학생 및 학부모에세 현재 입시의 흐름 및 대입 전형에 대한 안내, 합격 사례 및 준비 전략에 대한 정보, 현재 상황에서 준비할 사항에 대한 계획, 진로, 진학에 대한 종합 상담 정보를 제공할 수 있다. 그리고 서버는 내신향상 프로젝트 등에 대한 학습 컨설팅을 제공할 수도 있다. 상기 선택된 메뉴가 체험 학습 정보인 경우, 상기 서버의 체험학습정보 제공부가 상기 학생의 과목별 성적에 대응하는 체험 학습 정보를 체험학습정보 DB를 참조하여 제공한다. 특히, 서버는 해당 학생의 관심 대학 관심 학과에 도움이 되는 체험 학습 정보를 제공한다. 그리고 체험 학습의 장소, 시간 및 스케쥴 등도 제공하여 학생이 용이하게 체험 학습을 하도록 한다. 상기 선택된 메뉴가 유학 정보인 경우, 유학정보 제공부r 유학정보 DB를 참조하여 상기 학생의 과목 별 성적에 대응하는 유학 정보를 제공한다. 여기서 서버는 학생이 성적에 대응하는 국가별 대학 및 학과 정보를 제공한다. 그리고 유학을 위한 필요 정보도 제공한다. 상기 선택된 메뉴가 도서 정보인 경우, 도서정보 제공부가 도서정보 DB를 참조하여 상기 학생의 과목 별 성적에 대응하는 도서 정보를 제공한다. 여기서 서버는 과목 공부에 도움이 되는 도서 정보를 제공하 되, 성적에 대응하여 공부에 도움이 되는 도서를 추천한다. 상기 선택된 메뉴가 예체능 정보인 경우, 예체능정보 제공부가 예체능정보 DB를 참조하여 상기 학생 의 과목별 성적에 대응하는 예체능 정보를 제공한다. 여기서 서버는 해당 학생이 지원하고자 하는 예체능 계열의 학과를 가기 위해 준비해야할 입시정보를 제공한다. 이외에도 다양한 메뉴가 추가될 수 있으며, 이에 대해 설명하면 다음과 같다. 상기 선택된 메뉴가 챗봇인 경우, 서버는 챗봇을 구동하여 학생이 원하는 질문에 대한 응답을 할 수 있다. 이때 챗봇은 상기 학생 단말기로부터 수신되는 음성을 텍스트로 변환하여 인식하고 그에 대응하는 정보를 텍스트 형태의 음성으로 변환하여 제공하고, 질문에 대한 응답이 없는 경우 멘토 단말기에 알려서 답변을 하도록 할 수 있다. 이때 챗봇은 데이터베이스부를 참조하되, 데이터베이스부에 없는 질문인 경우, 멘토 단말기 에 의해 답변이 되는 음성 또는 텍스트 내용은 텍스트 형태로 데이터베이스부에 저장한다. 상기 선택된 메뉴가 실시간 강의인 경우, 상기 서버의 강의제공부는 상기 학생단말기, 강사 단말기 및 멘토 단말기 간의 실시간 강의를 진행한다. 이때 서버는 학생단말기, 강사 단말기 및 멘토 단말기 등의 화면에 90분할 화면을 제공하여 최대 90명까지 참여가 가능하도록 하며, 강사의 강의 내 용에 대한 질문이 있는 경우 전문가인 멘토가 추가 설명을 해주므로 학습 효과가 매우 뛰어나다. 특히, 온라인 으로 이루어지는 강의이므로 지방이나 외진곳에 있는 학생이어도 전문 강사의 명강의를 수강할 수 있다. 부가 정보 DB에는 이러한 강의 내용을 저장해두고 추후에 학생의 요청에 따라 제공해줄 수 있다. 본 발명의 실시예에서는, 인공지능을 이용한 에듀테크로 교육 및 평가 방법을 구현하여 시간, 공간의 제약을 극 복하고 교육 및 평가 내용의 질적 향상과 공정한 교육 및 평가를 구현할 수 있다. 또한, 본 발명의 실시예에서는, 인공지능을 이용한 에듀테크로 각 과목별 문제 은행을 온라인을 통해 배포하고, 배포된 문제를 사용자가 풀면 이에 대응하여 사용자의 문제풀이에 대한 채점 및 부족한 부분에 대한 티칭을 실 시할 수 있다. 또한, 본 발명의 실시예에서는, 인공지능을 이용한 에듀테크로 학생 개개인에 최적화된 입시 컨설팅을 제공하여 자신의 지역에 관계없이 최적의 교육 서비스를 받을 수 있다. 또한, 본 발명의 실시예에서는, 자기주도 학습을 하는 학생, 독서실에서 공부하는 학생, 학원생, 학교에서 공부 하는 학생 등 다양한 환경의 학생들에게 문제은행, 입시정보, 체험학습, 유학 정보, 도서 정보, 예체능 정보 등 다양한 정보를 제공할 수 있다.이상에서 설명한 본 발명의 실시예는 장치 및 방법을 통해서만 구현이 되는 것은 아니며, 본 발명의 실시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있으며,"}
{"patent_id": "10-2020-0093197", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이러한 구현은 앞서 설명한 실시예의 기재로부터 본 발명이 속하는 기술분야의 전문가라면 쉽게 구현할 수 있는 것이다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2020-0093197", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 시스템의 구성도이다. 도 2는 학생 단말기의 구성도이다. 도 3은 본 발명의 실시예에 따른 인공지능을 이용한 에듀테크 학습 관리 플랫폼 서비스 방법의 동작흐름도이다."}
