{"patent_id": "10-2020-0082118", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0004884", "출원번호": "10-2020-0082118", "발명의 명칭": "가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼", "출원인": "부산대학교 산학협력단", "발명자": "신용일"}}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "정보 획득수단으로부터 노동자의 생체정보, 감정정보, 및 특성정보 중 적어도 하나의 노동자정보를 획득하는 통신부;상기 노동자정보를 이용하여 상기 노동자의 신체와 대응되는 가상클론 모델을 생성하는 가상클론 생성부;상기 가상클론 모델에 상기 노동자의 작업정보를 반영하여 근골격계 질환의 발병 가능성을 분석하는 시뮬레이션분석부; 및상기 분석 결과에 기초하여 상기 노동자에 대한 헬스케어 서비스를 제공하는 서비스 제공부;를 포함하는, 가상클론을 활용한 노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 정보 획득수단은, 영상인식 장치 또는 착용형 장치를 이용하여 상기 노동자정보를 획득하는, 가상 클론을 활용한 노동자 맞춤형헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 생체정보는,뇌파, 맥파, 체온, 호흡, 근전도, 심전도, 및 혈중 산소 포화도 중 적어도 하나를 포함하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 특성정보는, 상기 노동자의 성별, 연령, 결혼 유무, 교육 수준, 흡연력, 음주력, 운동활동, 근속연수, 직무수행, 고용형태,작업 시간, 신체 치수, 운동능력, 정신건강 평가자료, 직무 만족도, 노동 강도, 및 작업의 복잡도 중 적어도 하나를 포함하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 가상클론 생성부는,인체 해부학 정보를 더 고려하여 상기 가상클론 모델을 생성하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 시뮬레이션 분석부는,상기 작업정보인 단위작업, 작업자세, 작업속도, 작업동작, 작업공간, 및 작업환경 중 적어도 하나를 고려하여상기 가상클론 모델에 대한 시뮬레이션을 수행하는 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼.공개특허 10-2022-0004884-3-청구항 7 제1 항에 있어서,상기 시뮬레이션 분석부는,상기 가상클론 모델을 활용한 시뮬레이션을 통해 상기 노동자에게 적합한 작업 방법 및 형태를 제시하는 것을포함하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 시뮬레이션 분석부는,상기 노동자의 작업정보와 건강상태 간의 상관관계인 질환 유발 매개변수 및 작업공정에 따른 위험 가중치 중적어도 하나를 도출하여 분석하는 것을 포함하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 시뮬레이션 분석부는,상기 가상클론 모델을 활용한 시뮬레이션을 통해서 기 설정된 생산력을 유지할 수 있는 헬스케어 관리모델을 생성하는 것을 포함하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서,상기 서비스 제공부는,상기 노동자에게 적합한 건강 검진 주기 및 건강 관리 방법에 대한 처방 콘텐츠를 제공하는 것을 포함하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서,상기 서비스 제공부는,상기 노동자에게 개선된 건강 상태 및 생산성 향상에 대한 정보를 제공하는 것을 포함하는, 가상 클론을 활용한노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항에 있어서,상기 서비스 제공부는,상기 노동자에게 작업 환경 및 방법에 대한 정보를 제공하는 것을 포함하는, 가상 클론을 활용한 노동자 맞춤형헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1 항에 있어서,상기 시뮬레이션 분석부는,상기 작업정보 및 상기 가상클론 모델을 클라우드 서버에 저장 및 분석하여 제공하는 것을 포함하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2022-0004884-4-제1 항에 있어서,상기 서비스 제공부는,상기 노동자정보를 기반으로 동일한 특성을 가진 집단을 분류하는 방식으로 작업형태 및 작업할당 계획을 제공하는 것을 포함하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼."}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시 예에 따른 가상 클론을 활용한 노동자 맞춤형 스마트 헬스케어 플랫폼은, 정보 획득수단으로부터 노동자 의 생체정보, 감정정보, 및 특성정보 중 적어도 하나의 노동자정보를 획득하는 통신부; 상기 노동자정보를 이용 하여 상기 노동자의 신체와 대응되는 가상클론 모델을 생성하는 가상클론 생성부; 상기 가상클론 모델에 상기 노 동자의 작업정보를 반영하여 근골격계 질환의 발병 가능성을 분석하는 시뮬레이션 분석부; 및 상기 분석 결과에 기초하여 상기 노동자에 대한 헬스케어 서비스를 제공하는 서비스 제공부;를 포함할 수 있다."}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼에 대한 관한 것이다."}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 세계적으로 4차 산업혁명에 따른 제조업 분야의 혁신이 화두되고 있다. 특히 스마트 공장 및 스마트 헬스 케어는 범국가적인 주제로 국내외 많은 연구와 기업들(IBM Watson, Apple, Google, 삼성 등)의 참여가 이루어지 고 있는 상황이다. 국내의 경우, 제조업 노동 생산성은 해마다 하락하고 있으며, 많은 산업단지 기반의 중소 도 시들은 단지내의 노후화로 인한 경쟁력 또한 상실하고 있는 추세이다. 이에 따른 현장에 대한 개선이 시급한 상 황이며, 다가오는 4차 산업혁명에 대비한 혁신적인 산업 단지로의 패러다임 전환이 절실히 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2017-0053858 A (특허문헌 0002) KR 10-2018-0064952 A"}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하려는 과제는, 노동자의 작업 환경과 건강 상태 사이의 상관관계를 분석하고 이에 대한 진단, 예방 그리고 처방 등이 가능한 의료 서비스를 제공하여 생산성 향상 및 산업 재해 예방을 실현할 수 있는 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼을 제공하기 위한 것이다. 실시 예에서 해결하고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급하지 않은 또 다른 기술적 과제는 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시 예는, 정보 획득수단으로부터 노동자의 생체정보, 감정정보, 및 특성정보 중 적어도 하나의 노동자정보 를 획득하는 통신부; 상기 노동자정보를 이용하여 상기 노동자의 신체와 대응되는 가상클론 모델을 생성하는 가 상클론 생성부; 상기 가상클론 모델에 상기 노동자의 작업정보를 반영하여 근골격계 질환의 발병 가능성을 분석 하는 시뮬레이션 분석부; 및 상기 분석 결과에 기초하여 상기 노동자에 대한 헬스케어 서비스를 제공하는 서비 스 제공부;를 포함하는, 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼을 제공한다. 상기 정보 획득수단은, 영상인식 장치 또는 착용형 장치를 이용하여 상기 노동자정보를 획득할 수 있다. 상기 생체정보는 뇌파, 맥파, 체온, 호흡, 근전도, 심전도, 및 혈중 산소 포화도 중 적어도 하나를 포함할 수 있다. 상기 특성정보는 상기 노동자의 성별, 연령, 결혼 유무, 교육 수준, 흡연력, 음주력, 운동활동, 근속연수, 직무 수행, 고용형태, 작업 시간, 신체 치수, 운동능력, 정신건강 평가자료, 직무 만족도, 노동 강도, 및 작업의 복 잡도 중 적어도 하나를 포함할 수 있다.상기 가상클론 생성부는 인체 해부학 정보를 더 고려하여 상기 가상클론 모델을 생성할 수 있다. 상기 시뮬레이션 분석부는 상기 작업정보인 단위작업, 작업자세, 작업속도, 작업동작, 작업공간, 및 작업환경 중 적어도 하나를 고려하여 상기 가상클론 모델에 대한 시뮬레이션을 수행할 수 있다. 상기 시뮬레이션 분석부는, 상기 가상클론 모델을 활용한 시뮬레이션을 통해 상기 노동자에게 적합한 작업 방법 및 형태를 제시할 수 있다. 상기 시뮬레이션 분석부는 상기 노동자의 작업정보와 건강상태 간의 상관관계인 질환 유발 매개변수 및 작업공 정에 따른 위험 가중치 중 적어도 하나를 도출하여 분석할 수 있다. 상기 시뮬레이션 분석부는, 상기 가상클론 모델을 활용한 시뮬레이션을 통해서 기 설정된 생산력을 유지할 수 있는 헬스케어 관리모델을 생성할 수 있다. 상기 서비스 제공부는, 상기 노동자에게 적합한 건강 검진 주기 및 건강 관리 방법에 대한 처방 콘텐츠를 제공 할 수 있다. 상기 서비스 제공부는, 상기 노동자에게 개선된 건강 상태 및 생산성 향상에 대한 정보를 제공할 수 있다. 상기 서비스 제공부는, 상기 노동자에게 작업 환경 및 방법에 대한 정보를 제공할 수 있다. 상기 시뮬레이션 분석부는, 상기 작업정보 및 상기 가상클론 모델을 클라우드 서버에 저장 및 분석하여 제공할 수 있다. 상기 서비스 제공부는, 상기 노동자정보를 기반으로 동일한 특성을 가진 집단을 분류하는 방식으로 작업형태 및 작업할당 계획을 제공할 수 있다."}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 적어도 일 실시 예에 의하면, 노동자의 생체정보 등에 기반하여 가상클론을 생성하고, 상기 가상클론 에 노동자의 작업정보를 반영하여 장래에 발병 가능한 질환을 미리 진단 및 예측할 수 있다. 그리고, 융합기술(사물 인터넷, 빅데이터, 인공지능, 기계학습 등)에 입각한 가상클론의 시뮬레이션을 통해 노 동자의 작업정보와 건강상태 사이의 상관관계를 도출하여 효율적인 작업환경 및 맞춤형 건강 관리 서비스를 제 공함으로써 노동자의 생산력 향상과 산업 재해 비용의 절감을 도모할 수 있다. 아울러, 노동자는 건강한 삶과 함께 안전한 환경에서 업무를 효율적으로 할 수 있으며, 사업체에서는 양질의 노동력을 확보하고 생산성을 향상 시키며, 정부에서는 산업재해 예방 및 비용 감소를 기대할 수 있다. 또한, 병원에서는 개별 노동자에 대한 맞춤형 건강관리 서비스를 제공하기 위해 사업체와의 긴밀한 정보 교류 및 DB(데이터 베이스) 구축을 통해 효율적으로 질환을 예방 또는 진단하고 치료할 수 있다. 이러한 노동자 맞춤형 헬스케어 서비스 정착은 국가적으로 미래 융합 산업 기술 발전 및 노동자의 건강한 삶의 질 개선을 통한 생산력 향상에 크게 이바지할 것으로 기대한다. 본 실시 예에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며 언급하지 않은 또 다른 효과는 아래의 기재로부터 본 발명이 속하는 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는"}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다 른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 이하, 본 발명과 관련된 가상 클론을 활용한 노동자 맞춤형 헬스케어 플랫폼에 대해 첨부된 도면을 참조하여 보 다 상세하게 설명한다. 도 1은 본 발명의 일 실시 예에 따른 사물인터넷 기반의 헬스케어 시스템을 개략적으로 도시한 블록도이다. 도 1을 참조하면, 일 실시 예에 따른 헬스케어 시스템은 정보 획득수단, 헬스케어 플랫폼, 클 라우드 서버, 및 외부기관 DB을 포함할 수 있다. 정보 획득수단은 웨어러블 디바이스, 이미지 센서, 사용자 단말을 포함할 수 있다. 웨어러블 디바이스는 노동자의 신체에 착용되어 생체정보를 감지하도록 구성되는 임의의 디바이스를 지칭 할 수 있다. 웨어러블 디바이스는 밴드, 안경, 시계, 벨트, 의복 등과 같이 인체에 착용할 수 있는 다양한 형태로 구현 되며, 노동자의 신체(예: 피부)와 직접 접촉하여 배치되거나, 또는 소정거리 이격되어 배치될 수 있다. 웨어러블 디바이스는 뇌파, 맥파, 체온, 호흡, 근전도, 심전도, 혈중 산소 포화도 등의 다양한 생체 정보 를 감지할 수 있으나, 이들은 본 발명의 용이한 이해를 위한 일 예에 불과할 뿐이다. 이미지 센서는 광학계를 통해 노동자와 실제 작업환경(예: 작업공간, 설비, 및 도구 등을 포함함)을 촬상 하여 영상정보를 출력하고, 이에 대한 이미지 처리(예: 노이즈 제거, 화질 및 채도 조절, 파일 압축 등)를 수행 하여 노동자의 감정정보(예: 기쁨, 슬픔, 분노, 즐거움 등)를 수집할 수 있다. 사용자 단말은 스마트폰, 노트북, 디지털방송용 단말기, 개인휴대단말기(PDA), PMP(Portable Multimedia Player), 태블릿(tablet) PC, 울트라북(ultrabook) 등의 형태를 포함한다. 사용자 단말에는 후술하는 헬스케어 플랫폼에서 다운로드 받은 헬스케어 어플리케이션이 설치되고, 이를 통해서 노동자는 자신의 고유한 특성정보를 입력할 수 있다. 여기서, 특성정보는 노동자의 신체정보(예: 키, 나이, 몸무게, 허리둘레 등), 건강정보(예: 흡연력, 음주력, 병력, 체지방, 혈압, 운동활동 등), 개인정보 (예: 성별, 연령, 결혼유무, 교육수준 등), 심리정보(예: 정신건강 평가자료 등), 및 직무정보(예: 근속연수, 고용형태, 직무만족도, 노동강도, 작업의 복잡도 등) 중 적어도 하나를 포함하여 구성될 수 있다. 전술한 웨어러블 디바이스, 이미지 센서, 사용자 단말은 블루투스, USB, NFC, RFID, 또는 지그 비 등과 같은 근거리 통신수단을 통해 헬스케어 플랫폼에 접속하여 노동자의 생체정보, 감정정보, 및 특성 정보(이하, 편의상 \"노동자정보\"라 칭함)를 전송할 수 있다. 다만, 본 발명의 범주가 근거리 통신수단에 국한되 는 것은 아니며, 필요에 따라 와이파이, 3G, 4G, 5G, 이더넷 등과 같은 중장거리 유무선 통신수단을 포괄적으로 활용하는 것도 가능하다. 헬스케어 플랫폼은 정보 획득수단으로부터 수신하는 노동자정보를 이용하여 가상클론(Virtual Clone, VC)을 생성하고, 상기 클론클론(VC)에 노동자의 작업정보를 반영하여 장래에 발병 가능한 질환을 진단 및 예측 할 수 있다. 헬스케어 플랫폼은 클라우드 서버에 접속하여 근골격계 질환이 발병된 노동자의 작업이력 정보를 추 출하고, 인공지능(Artificial Intelligence, AI) 알고리즘을 토대로 노동자의 작업정보와 건강상태 간의 상관관 계를 분석할 수 있다. 또한, 헬스케어 플랫폼은 가상클론(VC)을 활용한 시뮬레이션을 통해 기 설정된 생산력을 유지하기 위한 처 방 콘텐츠를 사용자 단말 및/또는 외부기관 DB에 서비스의 형태로 제공할 수 있다. 클라우드 서버는 유무선 통신수단을 통해 헬스케어 플랫폼 및 외부기관 DB와 연동되며, 정형 데 이터와 비정형 데이터를 연계하여 빅데이터를 활용한 클라우드 컴퓨팅 서비스를 제공할 수 있다. 클라우드 서버는 외부기관 DB로부터 산업계에 종사하는 노동자의 건강검진 정보와 작업이력 정보를 수집하고, 고유 식별자(노동자 ID)에 대응하는 방대한 양의 정형/비정형 데이터를 축적하여 데이터베이스 (database)에 저장할 수 있다. 여기서, 외부기관 DB는 병원, 피트니스 센터, 심리상담 센터, 및/또는 사업 체가 보유한 데이터베이스를 포함할 수 있다. 이하에서는, 도 2 내지 도 4를 참조하여 일 실시 예에 따른 헬스케어 플랫폼에 대하여 보다 상세히 설명하 기로 한다. 도 2는 본 발명의 일 실시 예에 따른 헬스케어 플랫폼의 개략적인 블록도이다. 도 3 내지 도 4는 본 발명의 일 실시 예에 따른 헬스케어 플랫폼에 따라 제공되는 노동자 맞춤형 헬스케어 서비 스의 방식을 설명하기 위한 도면이다. 도 2 내지 도 4를 함께 참조하면, 가상클론을 활용한 헬스케어 플랫폼은 통신부, 가상클론 생성부 , 시뮬레이션 분석부, 및 서비스 제공부를 포함할 수 있다. 통신부는 정보 획득수단으로부터 노동자정보(생체정보, 감정정보, 및 특성정보)를 수신하고, 상기 노 동자정보를 가상클론 생성부로 전달할 수 있다. 여기서, 생체정보는 노동자의 뇌파, 맥파, 체온, 호흡, 근 전도, 심전도, 및 혈중 산소 포화도 중 적어도 하나를 포함할 수 있다. 또한, 특성정보는 노동자의 성별, 연령, 결혼유무, 교육수준, 흡연력, 음주력, 병력, 운동활동, 정신건강 평가자료, 신체치수(예: 키, 나이, 몸무게, 허 리둘레 등), 근속연수, 고용형태, 직무만족도, 노동강도, 및 작업의 복잡도 중 적어도 하나를 포함할 수 있다. 통신부는 블루투스, USB, NFC, RFID, 또는 지그비와 같은 근거리 통신 수단 및/또는 와이파이, 3G, 4G, 5G, 이더넷과 같은 중장거리 유무선 통신수단에 기반하여 구현될 수 있다. 가상클론 생성부는 통신부로부터 전달받은 생체정보, 감정정보, 및 특성정보를 이용하여 노동자의 속 성이 반영된 가상클론(Virtual Clone, VC)을 생성할 수 있다. 가상클론(VC)은 디지털 환경에서 노동자의 신체를 복제하여 구현된 가상의 인체 모델로, 실제현실이 아닌 컴퓨터 프로그래밍에 의해 구현된 가상현실에서 제어될 수 있다. 또한, 가상클론(VC)은 증강현실(Augmented Reality) 기술과의 결합을 통해 실제 환경과 가상 환경이 동기화된 공간 상에서 구현될 수도 있다. 또한, 가상클론 생성부는 노동자의 생체신호와 가상클론(VC)의 동작 간에 높은 신뢰성을 구현하기 위해 인 체 해부학 정보를 더 고려하여 생성할 수 있다. 예컨대, 가상클론 생성부는 노동자의 CT와 MRI 영상을 3D 체표면에 정합하고, 포인트 클라우드(point cloud) 형태의 데이터를 이용하여 골격과 골격 주변의 연부조직을 그대로 재현함으로써 노동자의 근골격계와 유사한 속성을 가진 가상클론(VC)을 제작할 수 있다. 시뮬레이션 분석부는 가상클론(VC)에 대한 유한요소해석(Finite element analysis, FEA)을 기반으로 노동 자의 작업정보와 건강상태 사이의 상관관계를 분석하고, 장래에 발병 가능한 질환을 진단 및 예측할 수 있다. 이에 대한 설명은 도 5를 함께 참조하여 이하에서 설명한다. 도 5는 본 발명의 일 실시 예에 따른 가상클론의 시뮬레이션 수행과정을 설명하기 위한 도면이다. 도 2 내지 도 4와 함께 도 5를 참조하면, 시뮬레이션 분석부는 노동자의 작업정보를 독립변수로 설정하여 가상클론(VC)에 적산하는 방식으로 시뮬레이션을 수행하고, 신체부위(예: 목, 어깨, 팔, 손목, 허리, 및/또는 다리 등)에 가해지는 작업부하를 정량적으로 치환하여 평가할 수 있다. 여기서, 작업정보는 작업공정, 작업자세, 작업패턴, 작업속도, 작업동작, 작업공간, 및 작업환경 중 적어도 하나를 포함할 수 있으나, 이는 예시적인 것에 불과하다. 시뮬레이션 분석부는 이미지 센서에서 촬상된 영상정보 에 기초하여(도 5의 (a) 참조) 실제 작 업환경을 3차원의 가상공간에 구축한 뒤(도 5의 (b) 참조), 노동자의 실제 작업자세와 관련된 특징점(예: 관절정보)을 추출하고, 상기 특징점을 기반으로 가상클론(VC)의 자세를 제어하여 각 신체부위의 작업부하를 실 시간으로 산출할 수 있다(도 5의 (c) 내지 (d) 참조). 작업부하는 각 신체부위의 근육에 가해지는 육체적인 피 로도를 정량화한 척도로, 1 내지 10의 수치범위 사이에서 결정될 수 있다. 이때, 작업부하가 10에 인접할수록 육체적인 피로도가 크고, 1에 인접할수록 육체적인 피로도가 작다는 것을 의미한다. 또한, 시뮬레이션 분석부는 빅데이터 기술에 입각하여 클라우드 서버에 저장된 데이터를 분석하고, 작업공정에 따른 위험 가중치를 할당할 수 있다. 예컨대, 시뮬레이션 분석부는 클라우드 서버에 기록 된 산업계에 종사하는 노동자의 건강검진 정보와 작업이력 정보를 독출하고, 데이터마이닝(data mining) 및/또 는 머신러닝(machine learning) 알고리즘을 통해 공정별 위험 가중치를 산출할 수 있다. 공정별 위험 가중치에 대한 예시는 하기의 표 1과 같다. 표 1"}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "표 1을 참조하면, 시뮬레이션 분석부는 작업공정을 다수의 단위작업으로 분류하고, 단위작업과 직종에 따 른 공정별 위험 가중치를 할당할 수 있다. 만일, 작업공정이 \"조선업\"인 것으로 가정하면, \"조선업\"을 \"가공, 소조립, 평블록조립, 곡블록조립, 의장생산\" 등의 단위작업으로 분류하고, 클라우드 서버에 저장된 건강검진 정보와 작업이력 정보의 정형/비정형 데이 터를 연계하여 대응되는 직종(예: 마킹공, 배관공, 용접공, 설비운전공, 보온공, 부착공, 가스공, 전기공 등)의 위험 가중치를 할당할 수 있다. 예컨대, \"마킹공\"의 \"가공\"작업은 위험 가중치가 '2'인 반면에, \"용접공\"의 \"곡 블록 조립\"작업은 위험 가중치가 '9'로 할당될 수 있다. 이후, 시뮬레이션 분석부는 각 신체부위에 대한 작업부하와 작업공정에 따른 위험 가중치를 고려하여 노동 자의 근골격계 지수를 도출하고, 클라우드 서버로부터 근골격계 질환이 발병된 노동자의 작업이력 정보를 추출하여, 노동자의 작업정보와 건강상태 사이의 상관관계를 분석할 수 있다. 이에 대하여, 도 6을 참조하여 이 하에서 설명하기로 한다. 도 6은 본 발명의 일 실시 예에 따른 노동자의 작업정보와 건강상태 간의 상관관계를 설명하기 위한 도면이다. 도 6을 참조하면, 시뮬레이션 분석부는 인공지능 알고리즘을 기반으로 노동자의 작업정보와 건강상태 사이 의 상관관계를 예측할 수 있다. 시뮬레이션 분석부는 가상클론(VC)의 시뮬레이션을 통해 도출된 노동자의 근골격계 지수를 입력값으로 설 정하고, 머신러닝을 통한 지도학습 및/또는 비지도학습을 수행하여 근골격계 질환을 야기하는 매개변수를 발굴 할 수 있다. 매개변수란 상기 작업정보 중 근골격계 질환을 유발하는 주요 인자를 의미한다. 그리고, 시뮬레이 션 분석부는 상기 매개변수에 의한 근골격계 질환의 진행속도, 한계시간, 및 상태변화를 예측하고, 이를 사용자 단말과 외부기관 DB에 전송할 수 있다. 또한, 시뮬레이션 분석부는 발굴된 매개변수에 대한 검증을 통해 헬스케어 플랫폼의 신뢰성을 확보할 수 있다. 시뮬레이션 분석부는 상기 매개변수를 차단한 후, 인공지능(AI) 알고리즘을 토대로 가상클론(V C)에 대한 시뮬레이션을 수행하여 노동자가 기 설정된 생산력을 유지할 수 있는지를 판단하고, 이에 대응하는 헬스케어 관리모델을 도출하여 서비스 제공부에 전달할 수 있다. 여기서, 헬스케어 관리모델은 노동자에게 적합한 작업배치 및 건강검진에 관한 총체적인 솔루션을 포함할 수 있다. 한편, 시뮬레이션 분석부는 현장에서 발생하는 상황변수를 가상클론(VC)에 반영하여 지속적인 갱신 및 학 습 과정을 수행할 수 있다. 여기서, 상황변수란 산업 과정에서 발생되는 노동자의 업무상 재해, 사고, 질병 등 을 포함하며, 가상클론(VC)을 생성할 당시 반영된 노동자정보 및/또는 작업정보가 변경될 만한 현저한 사정을 의미한다. 그리고, 시뮬레이션 분석부는 가상클론(VC)의 시뮬레이션 수행 결과에 따라 출력되는 모든 정보를 클라우 드 서버에 저장하여 노동자 맞춤형 데이터베이스를 구축할 수 있다. 예컨대, 시뮬레이션 분석부는 작 업정보에 따른 노동자의 근골격계 지수, 예측되는 질환정보, 매개변수, 상황변수, 및 헬스케어 관리모델을 클라 우드 서버에 데이터베이스의 형태로 저장하여 스마트 헬스케어 및 스마트 공장 등에 제공할 수 있다. 서비스 제공부는 시뮬레이션 분석부로부터 헬스케어 관리모델을 수신하고, 이에 기초하여 노동자에게 적합한 처방 콘텐츠를 생성하여 노동자 단말 및 외부기관 DB에 서비스의 형태로 제공할 수 있다. 서비스 제공부는 헬스케어 관리모델에 기초하여 건강검진 주기 및 건강관리 방법 등에 대한 콘텐츠를 시각 적으로 제작하여 노동자 단말 및/또는 외부기관 DB에 제공할 수 있다. 서비스 제공부는 헬스케어 관리모델에 기초하여 노동자의 생산력을 극대화할 수 있는 작업환경 개선, 작업 자세 교정, 작업순환 계획, 작업공정 배치 방안 등에 관한 콘텐츠를 제작하여 노동자 단말 및/또는 외부기 관 DB에 제공할 수 있다. 또는, 서비스 제공부는 노동자정보를 기반으로 동일한 특성을 가진 집단을 분류하는 방식으로 작업형태 및 작업할당 계획을 제공할 수 있다. 이에 따라, 사업체는 노동자의 산재비용을 절 감하고, 양질의 노동력과 생산성을 확보할 수 있다. 또한, 서비스 제공부는 장래에 발병 가능한 노동자의 질환을 미리 진단 및 예측하여 근골격계 질환의 진행 속도, 한계시간, 및 상태변화에 대한 콘텐츠를 노동자 단말 및/또는 외부기관 DB에 제공할 수도 있다. 도 7은 본 발명의 일 실시 예에 따른 가상 클론을 활용한 노동자 맞춤형 헬스케어 서비스의 효과를 나타내는 도 면이다. 도 7을 참조하면, 가상클론에 기반한 헬스케어 플랫폼을 도입함으로써 노동자는 맞춤형 건강 및 작업 관리 서비스를 제공받을 수 있고, 기업은 생산성 향상에 따른 최대 수익 실현 그리고 정부는 노동자들의 산업 재해를 예방하고 비용을 감소시키는 효과를 거둠으로써 서로의 시너지 효과를 얻을 수 있다. 도 8은 본 발명의 일 실시 예에 따른 노동자 맞춤형 헬스케어 시스템을 나타내는 도면이다. 본 발명의 헬스케어 시스템은 노동자의 생체정보, 감정정보, 및 특성정보를 토대로 가상클론(VC)을 생성 하고, 가상클론(VC)에 노동자의 작업정보를 반영하여 발병 가능한 질환을 미리 진단 및 예측할 수 있다. 또한, 가상클론(VC)의 시뮬레이션 수행 결과에 따라 출력되는 모든 정보-예컨대, 노동자의 근골격계 지수, 예측 되는 질환정보, 매개변수, 상황변수, 및 헬스케어 관리모델 등-를 클라우드 서버에 저장하고 데이터베이스 화하여 구축함으로써, 실제 작업 환경에서 노동자에게 요구되는 생산력을 유지하기 위한 작업환경 개선, 작업순 환 계획, 및 건강관리 방안 등이 지속적으로 제공될 수 있다. 즉, 일 실시 예에 따른 헬스케어 시스템은 노동자에게 발생할 수 있는 질환을 미리 진단, 예방 및 치료하 거나, 작업 효율성에 대한 예측 및 개선 방안을 효율적으로 제시할 수 있다. 이로 인하여, 노동자에게는 건강한 삶을, 사업체에게는 생산성 향상을 그리고 국가적으로는 산업 재해 감소에 기여함으로써 4차 산업 혁명에 부응 한 스마트 제조 및 스마트 헬스케어 분야의 미래 융합 기술 발전에 크게 기여할 수 있다. 상술한 실시 예에 따른 헬스케어 서비스 제공방법은 컴퓨터에서 실행되기 위한 프로그램으로 제작되어 컴퓨터가 읽을 수 있는 기록 매체에 저장될 수 있으며, 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자 기 테이프, 플로피디스크, 광 데이터 저장장치 등이 포함될 수 있다. 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을"}
{"patent_id": "10-2020-0082118", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수 있는 코드가 저장되고 실행될 수 있다. 그리고, 상술한 방법을 구현하기 위한 기능적인(function) 프로그램,코드 및 코드 세그먼트들은 실시예가 속하는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 실시 예와 관련하여 전술한 바와 같이 몇 가지만을 기술하였지만, 이외에도 다양한 형태의 실시가 가능하다. 앞 서 설명한 실시 예들의 기술적 내용들은 서로 양립할 수 없는 기술이 아닌 이상은 다양한 형태로 조합될 수 있 으며, 이를 통해 새로운 실시 형태로 구현될 수도 있다. 한편, 전술한 실시 예에 의한 가상클론을 활용한 헬스케어 플랫폼은 스마트 헬스케어 및 스마트 공장 등에 적용 될 수 있다. 본 발명은 본 발명의 정신 및 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있음은 통상의 기술자에게 자명하다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예 시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2020-0082118", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 사물인터넷 기반의 헬스케어 시스템을 개략적으로 도시한 블록도이다. 도 2는 본 발명의 일 실시 예에 따른 헬스케어 플랫폼의 개략적인 블록도이다. 도 3 내지 도 4는 본 발명의 일 실시 예에 따른 헬스케어 플랫폼에 따라 제공되는 노동자 맞춤형 헬스케어 서비 스의 방식을 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시 예에 따른 가상클론의 시뮬레이션 수행과정을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시 예에 따른 노동자의 작업정보와 건강상태 간의 상관관계를 설명하기 위한 도면이다. 도 7은 본 발명의 일 실시 예에 따른 가상 클론을 활용한 노동자 맞춤형 헬스케어 서비스의 효과를 나타내는 도 면이다.도 8은 본 발명의 일 실시 예에 따른 노동자 맞춤형 헬스케어 시스템을 나타내는 도면이다."}
