{"patent_id": "10-2022-0088911", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0011445", "출원번호": "10-2022-0088911", "발명의 명칭": "전주 완철 이격거리 측정 장치 및 그 방법", "출원인": "한국전력공사", "발명자": "고병관"}}
{"patent_id": "10-2022-0088911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "입력 모듈;전주 완철 이미지를 촬영하는 촬영 모듈; 및상기 촬영 모듈을 통해 전주 완철 이미지를 획득하고, 상기 입력 모듈을 통해 완철 규격을 입력받으면, 상기 전주 완철 이미지를 분석하여 완철을 인식하고, 상기 인식된 완철의 픽셀수와 상기 완철 규격에 기초하여 픽셀당실제 거리 추정값을 산출하며, 상기 전주 완철 이미지에서 두 점이 선택된 경우, 상기 두 점간의 픽셀수 및 상기 픽셀당 실제 거리 추정값에 기초하여 상기 두 점간의 실제 거리를 산출하는 프로세서를 포함하는 전주 완철 이격거리 측정 장치."}
{"patent_id": "10-2022-0088911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는, 상기 인식된 완철에 대해 가로 픽셀수 및 세로 픽셀수를 각각 카운팅하고, 상기 완철 규격을 상기 완철의 가로픽셀수 또는 완철의 세로 픽셀수로 나누어 픽셀당 실제 거리 추정값을 산출하는 것을 특징으로 하는 전주 완철이격거리 측정 장치."}
{"patent_id": "10-2022-0088911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는,상기 두 점간의 픽셀수와 상기 픽셀당 실제 거리 추정값을 곱연산하여 상기 두 점간의 실제 거리를 산출하는 것을 특징으로 하는 전주 완철 이격거리 측정 장치."}
{"patent_id": "10-2022-0088911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는, 상기 두 점 간의 실제 거리를 상기 전주 완철 이미지상에 표시하는 것을 특징으로 하는 전주 완철 이격거리 측정 장치."}
{"patent_id": "10-2022-0088911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "프로세서가 촬영 모듈을 통해 전주 완철 이미지를 획득하고, 사용자로부터 완철 규격을 입력받는 단계;상기 프로세서가 상기 전주 완철 이미지를 분석하여 완철을 인식하는 단계;상기 프로세서가 상기 인식된 완철의 픽셀수와 상기 완철 규격에 기초하여 픽셀당 실제 거리 추정값을 산출하는단계; 및상기 전주 완철 이미지에서 두 점이 선택된 경우, 상기 프로세서가 상기 두 점간의 픽셀수 및 상기 픽셀당 실제공개특허 10-2024-0011445-3-거리 추정값에 기초하여 상기 두 점간의 실제 거리를 산출하는 단계를 포함하는 전주 완철 이격거리 측정 방법."}
{"patent_id": "10-2022-0088911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 픽셀당 실제 거리 추정값을 산출하는 단계에서, 상기 프로세서는, 상기 인식된 완철에 대해 가로 픽셀수 및 세로 픽셀수를 각각 카운팅하고, 상기 완철 규격을상기 완철의 가로 픽셀수 또는 완철의 세로 픽셀수로 나누어 픽셀당 실제 거리 추정값을 산출하는 것을 특징으로 하는 전주 완철 이격거리 측정 방법."}
{"patent_id": "10-2022-0088911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 두 점간의 실제 거리를 산출하는 단계에서, 상기 프로세서는, 상기 두 점간의 픽셀수와 상기 픽셀당 실제 거리 추정값을 곱연산하여 상기 두 점간의 실제거리를 산출하는 것을 특징으로 하는 전주 완철 이격거리 측정 방법."}
{"patent_id": "10-2022-0088911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 두 점간의 실제 거리를 산출하는 단계 이후, 상기 프로세서가 상기 두 점 간의 실제 거리를 상기 전주 완철 이미지상에 표시하는 단계를 더 포함하는 것을특징으로 하는 전주 완철 이격거리 측정 방법."}
{"patent_id": "10-2022-0088911", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 전주 완철 이미지상에 표시하는 단계 이후, 상기 프로세서가 상기 전주 완철 이미지 및 상기 두 점 간의 실제 거리가 표시된 전주 완철 이미지를 저장하는단계를 더 포함하는 것을 특징으로 하는 전주 완철 이격거리 측정 방법."}
{"patent_id": "10-2022-0088911", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전주 완철 이격거리 측정 장치 및 그 방법이 개시된다. 본 발명의 일 측면에 따른 전주 완철 이격거리 측정 장치 는, 입력 모듈, 전주 완철 이미지를 촬영하는 촬영 모듈, 및 상기 촬영 모듈을 통해 전주 완철 이미지를 획득하 고, 상기 입력 모듈을 통해 완철 규격을 입력받으면, 상기 전주 완철 이미지를 분석하여 완철을 인식하고, 상기 인식된 완철의 픽셀수와 상기 완철 규격에 기초하여 픽셀당 실제 거리 추정값을 산출하며, 상기 전주 완철 이미 지에서 두 점이 선택된 경우, 상기 두 점간의 픽셀수 및 상기 픽셀당 실제 거리 추정값에 기초하여 상기 두 점간 의 실제 거리를 산출하는 프로세서를 포함한다."}
{"patent_id": "10-2022-0088911", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전주 완철 이격거리 측정 장치 및 그 방법에 관한 것으로서, 보다 상세하게는 전주 완철을 촬영하고, 촬영된 전주 완철 이미지를 이용하여 완철 간의 실제 거리를 측정할 수 있도록 하는 전주 완철 이격거리 측정 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0088911", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 가공배전선로는 일정 간격을 두고 설치되는 전주, 전주에 고정되는 완철, 완철에 현수애자를 통해 절연상태로 지지되는 배전케이블, 배전케이블을 연결하는 점퍼선 및 상기 점퍼선을 완철에 대하여 절연 상태로 지지하는 라인포스트 애자 등을 포함하여 구성된다.고압 전주에 고압 전선을 설치하기 위해서 완철과 애자 등을 이용하여 전선을 설치한다. 완철은 완금(cross arm)이라고도 하며, 가공선로를 지지하기 위해 전주에 가로로 설치하여 전선을 가설할 수 있게 만든 직선형 구 조물이다. 완철은 완철밴드(완금밴드)로 전주에 고정되고, 완철에 애자(현수애자 또는 라인포스트 애자)를 매개 로 전선이 설치된다. 완철은 고압전선을 장악하는 애자, 인장클램프 등이 설치되는 중요한 자재인데 경우에 따른 설치 기준이 있다. 특히, 1개의 전주에 2개 이상의 완철이 설치되는 경우 두 완철 간의 최소 이격거리를 지켜주어야 하는데, 이격 거리 기준에 비하여 이격거리가 더 짧은 경우 전선 간 혼촉 위험이 발생할 수 있고, 이격거리 기준에 비하여 이 격거리가 큰 경우 지상고 확보가 미흡한 경우가 생길 수 있다. 이에, 완철 설치에 대한 검사를 수행하고 있다. 예를 들면, 배전공사 완료 후 준공검사를 위한 현장 확인 혹은 선로 순시를 진행할 때 배전 감독자들이 완철 설치에 대한 검사를 직접 눈으로 확인하는 방법을 이용하고 있다. 그러나 안전에 대한 패러다임이 변화하는 시점에 완철 설치 적정 여부를 판단하기 위해 감독자들이 활선 상태의 특고압 전선에 가까이 가서 눈으로 확인하는 방법은 많은 위험이 있고, 완철 간의 이격거리가 설치 기준에 맞는 지에 대한 정확성이 떨어지는 문제가 있다. 이에, 완철 간의 이격거리가 설치 기준에 맞는지에 대한 정확성을 높일 수 있도록 하는 기술 개발이 요구되고 있다."}
{"patent_id": "10-2022-0088911", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 발명의 배경기술은 대한민국 등록특허 제10-1403674호(2014.05.28. 등록, 송전선로 안전이격거리 검토시스템 및 그 방법)에 개시되어 있다."}
{"patent_id": "10-2022-0088911", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점들을 개선하기 위하여 안출된 것으로, 본 발명의 일 측면에 따른 목적은 완철 간 의 이격거리가 설치 기준에 맞는지에 대한 정확성을 높일 수 있도록 하는 전주 완철 이격거리 측정 장치 및 그 방법을 제공하는 것이다. 본 발명이 해결하고자 하는 과제는 이상에서 언급한 과제(들)로 제한되지 않으며, 언급되지 않은 또 다른 과제 (들)은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0088911", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따른 전주 완철 이격거리 측정 장치는, 입력 모듈, 전주 완철 이미지를 촬영하는 촬영 모 듈, 및 상기 촬영 모듈을 통해 전주 완철 이미지를 획득하고, 상기 입력 모듈을 통해 완철 규격을 입력받으면, 상기 전주 완철 이미지를 분석하여 완철을 인식하고, 상기 인식된 완철의 픽셀수와 상기 완철 규격에 기초하여 픽셀당 실제 거리 추정값을 산출하며, 상기 전주 완철 이미지에서 두 점이 선택된 경우, 상기 두 점간의 픽셀수 및 상기 픽셀당 실제 거리 추정값에 기초하여 상기 두 점간의 실제 거리를 산출하는 프로세서를 포함한다. 본 발명에서 상기 프로세서는, 상기 인식된 완철에 대해 가로 픽셀수 및 세로 픽셀수를 각각 카운팅하고, 상기 완철 규격을 상기 완철의 가로 픽셀수 또는 완철의 세로 픽셀수로 나누어 픽셀당 실제 거리 추정값을 산출할 수 있다. 본 발명에서 상기 프로세서는, 상기 두 점간의 픽셀수와 상기 픽셀당 실제 거리 추정값을 곱연산하여 상기 두 점간의 실제 거리를 산출할 수 있다. 본 발명에서 상기 프로세서는, 상기 두 점 간의 실제 거리를 상기 전주 완철 이미지상에 표시할 수 있다. 본 발명의 다른 측면에 따른 전주 완철 이격거리 측정 방법은, 프로세서가 촬영 모듈을 통해 전주 완철 이미지 를 획득하고, 사용자로부터 완철 규격을 입력받는 단계, 상기 프로세서가 상기 전주 완철 이미지를 분석하여 완 철을 인식하는 단계, 상기 프로세서가 상기 인식된 완철의 픽셀수와 상기 완철 규격에 기초하여 픽셀당 실제 거 리 추정값을 산출하는 단계, 및 상기 전주 완철 이미지에서 두 점이 선택된 경우, 상기 프로세서가 상기 두 점 간의 픽셀수 및 상기 픽셀당 실제 거리 추정값에 기초하여 상기 두 점간의 실제 거리를 산출하는 단계를 포함한 다. 본 발명은 상기 픽셀당 실제 거리 추정값을 산출하는 단계에서, 상기 프로세서는, 상기 인식된 완철에 대해 가 로 픽셀수 및 세로 픽셀수를 각각 카운팅하고, 상기 완철 규격을 상기 완철의 가로 픽셀수 또는 완철의 세로 픽 셀수로 나누어 픽셀당 실제 거리 추정값을 산출할 수 있다. 본 발명은 상기 두 점간의 실제 거리를 산출하는 단계에서, 상기 프로세서는, 상기 두 점간의 픽셀수와 상기 픽 셀당 실제 거리 추정값을 곱연산하여 상기 두 점간의 실제 거리를 산출할 수 있다. 본 발명은 상기 두 점간의 실제 거리를 산출하는 단계 이후, 상기 프로세서가 상기 두 점 간의 실제 거리를 상 기 전주 완철 이미지상에 표시하는 단계를 더 포함할 수 있다. 본 발명은 상기 전주 완철 이미지상에 표시하는 단계 이후, 상기 프로세서가 상기 전주 완철 이미지 및 상기 두 점 간의 실제 거리가 표시된 전주 완철 이미지를 저장하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2022-0088911", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 장치 및 그 방법은, 전주 완철을 촬영하고, 촬영된 전주 완철 이미지를 이용하여 완철 간의 실제 거리를 측정함으로써, 완철 간의 이격거리가 설치 기준에 맞는지에 대 한 정확성을 높일 수 있다. 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 장치 및 그 방법은, 촬영된 전주 완철 이미지를 자동으로 분석하여 원거리에서 물체의 두 점간의 거리 등을 출력해주는 어플리케이션(application)을 제공함으로써, 배전 원들이 현장 순시 혹은 공사 후 준공검사 등을 시행할 때 원거리에서도 기자재 설치의 적합 여부를 개인적인 감 /경험 등이 아닌 명확한 데이터를 통해 확인할 수 있기에 배전공사의 품질을 향상시킬 수 있다."}
{"patent_id": "10-2022-0088911", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "한편, 본 발명의 효과는 이상에서 언급한 효과들로 제한되지 않으며, 이하에서 설명할 내용으로부터 통상의 기 술자에게 자명한 범위 내에서 다양한 효과들이 포함될 수 있다."}
{"patent_id": "10-2022-0088911", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 장치 및 그 방법을 설명 한다. 이 과정에서 도면에 도시된 선들의 두께나 구성요소의 크기 등은 설명의 명료성과 편의상 과장되게 도시 되어 있을 수 있다. 또한, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례에 따라 달라질 수 있다. 그러므로 이러한 용어들에 대한 정의는 본 명세서 전반에 걸 친 내용을 토대로 내려져야 할 것이다. 본 명세서에서 설명된 구현은, 예컨대, 방법 또는 프로세스, 장치, 소프트웨어 프로그램, 데이터 스트림 또는 신호로 구현될 수 있다. 단일 형태의 구현의 맥락에서만 논의(예컨대, 방법으로서만 논의)되었더라도, 논의된 특징의 구현은 또한 다른 형태(예컨대, 장치 또는 프로그램)로도 구현될 수 있다. 장치는 적절한 하드웨어, 소 프트웨어 및 펌웨어 등으로 구현될 수 있다. 방법은, 예컨대, 컴퓨터, 마이크로프로세서, 집적 회로 또는 프로 그래밍 가능한 로직 디바이스 등을 포함하는 프로세싱 디바이스를 일반적으로 지칭하는 프로세서 등과 같은 장 치에서 구현될 수 있다. 프로세서는 또한 최종-사용자 사이에 정보의 통신을 용이하게 하는 컴퓨터, 셀 폰, 휴 대용/개인용 정보 단말기(personal digital assistant: \"PDA\") 및 다른 디바이스 등과 같은 통신 디바이스를 포함한다.도 1은 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 장치를 나타낸 블럭도, 도 2는 본 발명의 일 실시 예에 따른 완철 인식 방법을 설명하기 위한 예시도, 도 3은 본 발명의 일 실시예에 따른 완철의 픽셀수를 설명 하기 위한 예시도, 도 4는 본 발명의 일 실시예에 따른 완철 간의 실제 거리를 산출하는 방법을 설명하기 위한 예시도, 도 5는 본 발명의 일 실시예에 따른 전주 완철 이미지 상에 실제 거리를 표시하는 것을 설명하기 위한 예시도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 장치는 메모리, 촬영 모듈 , 입력 모듈, 디스플레이 모듈 및 프로세서를 포함한다. 메모리는 전주 완철 이격거리 측정 장치의 동작과 관련된 데이터들을 저장하는 구성이다. 여기서 메 모리는 공지된 저장매체를 이용할 수 있으며, 예를 들어, ROM, PROM, EPROM, EEPROM, RAM 등과 같이 공지 된 저장매체 중 어느 하나 이상을 이용할 수 있다. 특히, 메모리에는 영상을 분석하여 완철을 인식하고, 인식된 완철의 픽셀수와 완철 규격에 기초하여 픽셀당 실제 거리 추정값을 산출하며, 두 점이 선택된 경우, 두 점간의 픽셀수 및 픽셀당 실제 거리 추정값에 기초하여 두 점간의 실제 거리를 산출하는 프로그램(애플리케이션 또는 애플릿) 등이 저장될 수 있으며, 저장되는 정보들은 필요에 따라 프로세서에 의해 취사선택될 수 있 다. 또한, 메모리는 프로세서의 제어에 의해 메모리에 저장된 사용자 인터페이스 및/또는 그래 픽 사용자 인터페이스를 이용하여 다양한 메뉴 화면 등과 같은 다양한 콘텐츠를 표시할 수 있다. 촬영 모듈은 전주 완철을 촬영하고, 촬영된 전주 완철 이미지를 프로세서로 전송할 수 있다. 이때, 촬영 모듈은 전주 완철의 정면을 촬영할 수 있다. 이러한 촬영 모듈은 적어도 하나의 이미지 센서를 포함할 수 있다. 예를 들어, 촬영 모듈에 포함된 이미지 센서는 외부로부터 수신되는 빛을 전기적인 신호로 변환하여 출력할 수 있으며, 전기적인 신호는 버스를 통하여 프로세서로 출력되어 처리되거나, 또는 메모리에 저장될 수 있다. 촬영 모듈은 복수의 픽셀들로 구성된 픽셀 어레이를 포함할 수 있으며, 픽셀 어레이는 외부로부터 수광된 빛을 아날로그의 전기적인 신호로 변환하는 포토 다이오드를 포함할 수 있다. 한편, 촬영 모듈에 포함된 이미지 센서는, 아날로그의 전기적인 신호를 디지털의 전기적인 신호로 변환하여 출력하는 ADC를 포함할 수 있다. 또한, 촬영 모듈에 포함된 이미지 센서는 복수 개의 픽셀들로 구성된 픽셀 어레이를 스캐닝하기 위한 회로를 포함할 수 있다. 아울 러, 촬영 모듈에 포함된 이미지 센서는 내부에 메모리를 포함할 수 있으며, 내부에 포함된 메모리 에 디지털의 전기적인 신호, 즉 픽셀로부터 출력된 데이터를 일시적으로 저장하였다가 외부 회로(예를 들 어, 프로세서 또는 메모리 등)로 출력할 수 있다. 촬영 모듈에 포함된 이미지 센서는 데이터 입 출력을 위해 사용되는 인터페이스를 포함할 수 있으며, 인터페이스의 출력 속도에 따라 외부 회로로 데이터를 출력할 수 있다. 입력 모듈은 사용자가 전주 완철 이격거리 측정을 위해 필요한 정보들을 입력하기 위해 제공되는 것으로, 완철 규격 등을 입력받을 수 있다. 여기서, 완철 구격은 완철의 가로 길이, 세로 길이 등을 포함할 수 있다. 이러한 입력 모듈은, 예를 들면, 키보드, 마우스, 터치패드, 터치 패널, (디지털) 펜 센서, 키, 또는 초음 파 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타 일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학 식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마이크를 통해, 입력 도구에서 발생된 초음파를 감 지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이 모듈은 전주 완철 이격거리 측정 장치에서 실행되는 어플리케이션 및 콘텐츠 등을 표시하 는 역할을 한다. 디스플레이 모듈은, 예를 들면, 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오 드(OLED) 디스플레이, 또는 마이크로 전자기계 시스템 (MEMS) 디스플레이, 또는 전자종이(electronic paper) 디 스플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 및/또는 심볼 등)를 표시할 수 있다. 디스플레이 모듈은, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 한편, 본 발명의 실시예에서는 입력 모듈과 디스플레이 모듈을 별도로 구현하는 것으로 설명하였으나, 입력 모듈과 디스플레이 모듈은 일체형으로 구현될 수도 있다. 프로세서는 메모리에 저장된 전주 완철 이격거리 측정 어플리케이션 또는 전주 완철 이격거리 측정 사이트를 실행 및/또는 표시할 수 있으며, 전주 완철 이격거리 측정 어플리케이션 또는 전주 완철 이격거리 측 정 사이트를 통해 완철 간의 이격거리를 측정할 수 있다. 프로세서는 촬영 모듈로부터 전주 완철 이미지를 수신받고, 입력 모듈을 통해 완철 규격을 입력 받으며, 전주 완철 이미지를 분석하여 완철을 인식하고, 인식된 완철의 픽셀수와 완철 규격에 기초하여 픽셀당 실제 거리 추정값을 산출하며, 입력 모듈을 통해 두 점이 선택된 경우, 두 점간의 픽셀수 및 픽셀당 실제 거리 추정값에 기초하여 두 점간의 실제 거리를 산출할 수 있다. 이하, 프로세서의 동작에 대해 구체적으로 설명하기로 한다. 메모리에 저장된 전주 완철 이격거리 측정 어플리케이션이 실행되면, 프로세서는 촬영 모듈을 구동시킬 수 있다. 촬영 모듈은 전주 완철을 촬영하여 전주 완철 이미지를 프로세서로 전송할 수 있 다. 프로세서는 촬영 모듈을 통해 촬영된 전주 완철 이미지를 획득하고, 전주 완철 이미지를 디스플레이 모듈을 통해 출력할 수 있다. 전주 완철 이미지가 디스플레이 모듈을 통해 출력되면, 프로세서는 완철 규격 입력 화면을 디스플레 이할 수 있다. 완철 규격 입력 화면에는 완철의 가로 길이, 세로 길이 등의 규격을 입력하기 위한 영역이 존재 하고, 사용자는 입력 모듈을 통해 완철의 가로 길이, 세로 길이 등의 규격을 입력할 수 있다. 완철 규격 입력 화면을 통해 완철 규격이 입력되면, 프로세서는 전주 완철 이미지에 사물인식기법을 적용 하여 완철을 자동으로 인식할 수 있다. 이때, 프로세서는 전주 완철 이미지들을 사전 기계학습이 완료된 사물 인식 모델에 입력으로 인가함으로써, 완철을 인식할 수 있다. 또한, 프로세서는 인공지능 딥러닝 기 반의 사물인식을 이용하여 완철을 인식할 수도 있다. 예를 들어, 도 2의 (a)와 같은 전주 완철 이미지의 경우, 프로세서는 도 2의 (b)와 같이 전주 완철을 인식 하여 자동으로 표시할 수 있다. 전주 완철 이미지에서 완철이 인식되면, 프로세서는 인식된 완철에 대해 가로 픽셀수 및 세로 픽셀수를 각 각 카운팅할 수 있다. 예를 들면, 프로세서는 도 3에 도시된 A와 같이 완철의 가로 및 세로의 픽셀수를 카운팅할 수 있다. 프로세서는 입력받은 완철 규격을 카운팅된 완철의 픽셀수로 나누어, 픽셀당 실제 거리 추정값을 산출할 수 있다. 예를 들어, 전주 완철 이미지에서 완철의 가로 픽셀이 100pixel 이고, 완철 가로 길이가 2400mm인 경우, 프로세 서는 2400/100=24mm를 픽셀당 실제 거리 추정값으로 산출할 수 있다. 픽셀당 실제 거리 추정값이 산출되면, 프로세서는 거리 측정을 원하는 두 점을 선택할 수 있도록 하는 두 점 선택 화면을 디스플레이할 수 있다. 두 점 선택 화면은 전주 완철 이미지를 활성화시킴으로써, 두 점의 선택 을 인식할 수 있도록 하는 화면일 수 있다. 두 점 선택 화면을 통해 두 점이 선택되면, 프로세서는 선택된 두 점간의 픽셀수를 카운팅하고, 두 점간의 픽셀수와 픽셀당 실제 거리 추정값을 곱연산하여 두 점간의 실제 거리를 산출할 수 있다. 예를 들어, 도 4의 (a)와 같은 두 점 선택 화면에서 (b)에 도시된 바와 같이 B와 C가 선택된 경우에 대해 설명 하기로 한다. 이때, 픽셀당 실제 거리 추정값이 24mm라고 가정하기로 한다. 이 경우, 도 4의 (c)에 도시된 바와 같이 B와 C 간의 가로 픽셀 수 2개, 세로 픽셀 수 30개이므로, 프로세서는 B와 C 간의 픽셀수를 30개로 카 운팅할 수 있다. 그런 후, 프로세서는 30×24mm = 720mm를 B와 C 간의 실제 거리로 산출할 수 있다. 프로세서는 전주 완철 이미지상에 두 점 간의 실제 거리를 표시할 수 있다. 예를 들면, 프로세서는 도 5에 도시된 바와 같이 전주 완철 이미지상에 B와 C간의 실제 거리를 표시할 수 있다. 프로세서는 촬영 모듈로부터 수신한 전주 완철 이미지, 두 점 간의 실제 거리가 표시된 전주 완철 이 미지 등을 메모리에 저장할 수 있다. 프로세서는 운영 체제 또는 어플리케이션을 구동하여 프로세서에 연결된 복수의 하드웨어 또는 소프 트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서는 SoC(system on chip)로 구현될 수 있다. 프로세서는 다른 구성요소들 중 적어도 하나로부터 수신된 인스트 럭션(instruction) 또는 데이터를 메모리에 로드(load)하여 처리하고, 다양한 데이터를 메모리에 저 장할 수 있다. 한편, 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 장치는 별도의 장치로 구현될 수 있으나, 반 드시 이에 한정되는 것은 아니며, PDA(Personal Digital Assistant), 스마트폰, PMP(Portable Multimedia Player), 개인용 컴퓨터(PC: Personal Computer), 노트북 및 이동통신 단말기(Mobile Communication Terminal) 등 중 어느 하나일 수 있는 단말기 또는 서버 내에 탑재되도록 구현될 수 있을 것이다. 또한, 본 발명의 전주 완철 이격거리 측정 장치는 인터넷망, 인트라넷망, 이동통신망, 위성 통신망 등 다양한 유무선 통신망과 연동하는 것이 바람직하나 반드시 이에 한정되는 것은 아니다. 또한, 전주 완철 이격거리 측정 장치는 외 부 입출력 장치가 탑재되어 외부로부터 영상을 입력받도록 구현되는 것이 바람직하나 반드시 이에 한정되는 것 은 아니다. 도 6은 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 방법을 설명하기 위한 흐름도이다. 도 6을 참조하면, 전주 완철 이격거리 측정 어플리케이션이 실행되면(S602), 프로세서는 촬영 모듈을 구동시켜 전주 완철 이미지를 획득한다(S604). 이때, 촬영 모듈이 구동되면, 촬영 모듈은 전주 완철 을 촬영하여 전주 완철 이미지를 프로세서로 전송할 수 있다. 그러면, 프로세서는 촬영 모듈을 통해 촬영된 전주 완철 이미지를 디스플레이 모듈을 통해 출력할 수 있다. S604 단계가 수행되면, 프로세서는 완철 규격 입력 화면을 디스플레이하여 완철 규격을 입력받는다(S606). 완철 규격 입력 화면에는 완철의 가로 길이, 세로 길이 등의 규격을 입력하기 위한 영역이 존재하고, 사용자는 입력 모듈을 통해 완철의 가로 길이, 세로 길이 등의 규격을 입력할 수 있다. S606 단계가 수행되면, 프로세서는 전주 완철 이미지에 사물인식기법을 적용하여 완철을 자동으로 인식한 다(S608). 이때, 프로세서는 전주 완철 이미지들을 사전 기계학습이 완료된 사물 인식 모델에 입력으로 인 가함으로써, 완철을 인식할 수 있다. 또한, 프로세서는 인공지능 딥러닝 기반의 사물인식을 이용하여 완철 을 인식할 수도 있다. S608 단계가 수행되면, 프로세서는 인식된 완철에 대해 가로 및 세로의 픽셀수를 각각 카운팅하고(S610), 완철 규격 및 카운팅된 완철의 가로/세로 픽셀수에 기초하여 픽셀당 실제 거리 추정값을 산출한다(S612). 이때, 프로세서는 완철 규격을 카운팅된 완철의 가로 픽셀수 또는 세로 픽셀수로 나누어, 픽셀당 실제 거리 추정 값을 산출할 수 있다. S612 단계가 수행되면, 프로세서는 두 점 선택 화면을 통해 두 점을 선택받고(S614), 선택된 두 점 간의 픽셀수를 카운팅한다(S616). 즉, 프로세서는 거리 측정을 원하는 두 점을 선택할 수 있도록 하는 두 점 선 택 화면을 디스플레이할 수 있다. 두 점 선택 화면을 통해 두 점이 선택되면, 프로세서는 선택된 두 점간 의 픽셀수를 카운팅할 수 있다. S616 단계가 수행되면, 프로세서는 두 점간의 픽셀수와 픽셀당 실제 거리 추정값에 기초하여 두 점간의 실 제 거리 산출하고(S618), 두 점 간의 실제 거리를 전주 완철 이미지상에 표시한다(S620). 이때. 프로세서 는 두 점간의 픽셀수와 픽셀당 실제 거리 추정값을 곱연산하여 두 점간의 실제 거리를 산출할 수 있다. 상술한 바와 같이, 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 장치 및 그 방법은, 전주 완철을 촬영 하고, 촬영된 전주 완철 이미지를 이용하여 완철 간의 실제 거리를 측정함으로써, 완철 간의 이격거리가 설치 기준에 맞는지에 대한 정확성을 높일 수 있다. 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 장치 및 그 방법은, 촬영된 전주 완철 이미지를 자동으로 분석하여 원거리에서 물체의 두 점간의 거리 등을 출력해주는 어플리케이션(application)을 제공함으로써, 배전 원들이 현장 순시 혹은 공사 후 준공검사 등을 시행할 때 원거리에서도 기자재 설치의 적합 여부를 개인적인 감 /경험 등이 아닌 명확한 데이터를 통해 확인할 수 있기에 배전공사의 품질을 향상시킬 수 있다. 본 발명은 도면에 도시된 실시예를 참고로 하여 설명되었으나, 이는 예시적인 것에 불과하며, 당해 기술이 속하 는 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호범위는 아래의 특허청구범위에 의해서 정하여져야 할 것이다."}
{"patent_id": "10-2022-0088911", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 장치를 나타낸 블럭도이다. 도 2는 본 발명의 일 실시예에 따른 완철 인식 방법을 설명하기 위한 예시도이다. 도 3은 본 발명의 일 실시예에 따른 완철의 픽셀수를 설명하기 위한 예시도이다. 도 4는 본 발명의 일 실시예에 따른 완철 간의 실제 거리를 산출하는 방법을 설명하기 위한 예시도이다. 도 5는 본 발명의 일 실시예에 따른 전주 완철 이미지 상에 실제 거리를 표시하는 것을 설명하기 위한 예시도이 다. 도 6은 본 발명의 일 실시예에 따른 전주 완철 이격거리 측정 방법을 설명하기 위한 흐름도이다."}
