{"patent_id": "10-2023-0077219", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0165828", "출원번호": "10-2023-0077219", "발명의 명칭": "2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템", "출원인": "심승규", "발명자": "심승규"}}
{"patent_id": "10-2023-0077219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 전신을 360도 스캐닝 하여 3차원 사용자 신체데이터 및 3차원 사용자 얼굴데이터를 각각 생성하고, 온/오프라인을 통해 판매하는 실제상품을 360도 스캐닝 하여 3차원 상품데이터를 생성하는 3차원 스캐닝 장치부;상기 3차원 사용자 신체데이터 및 상기 3차원 사용자 얼굴데이터를 기반으로 3차원 사용자 캐릭터를 모델링하는3차원 사용자 캐릭터 모델링 수행부; 온/오프라인을 통해 판매하는 실제상품에 대하여 2차원 코드를 각각 생성하고, 생성된 상기 2차원 코드를 해당실제상품을 대상으로 생성된 상기 3차원 상품데이터와 매칭하는 2차원 코드 관리부; 및사용자 통신단말을 통해 상기 2차원 코드를 인식하면, 인식된 상기 2차원 코드와 매칭되는 상기 3차원 상품데이터를 상기 3차원 사용자 캐릭터에 적용하는 3차원 가상피팅정보를 생성하여 제공하는 3차원 가상피팅정보 생성부를 포함하는 것을 특징으로 하는 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템."}
{"patent_id": "10-2023-0077219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 쇼핑몰 시스템은,초상권에 대한 사전 합의가 이루어진 연예인 및 인플루언서 중 적어도 하나의 실제인물에 대한 얼굴이미지데이터로부터 얼굴특징을 추출하고, 추출된 얼굴특징을 기반으로 3차원 모델링을 수행하여 3차원 실제인물 캐릭터를생성하는 3차원 실제인물 캐릭터 모델링 수행부를 더 포함하고,상기 3차원 가상피팅정보 생성부는,온/오프라인을 통해 판매하는 실제상품에 대한 2차원 코드를 사용자 통신단말을 통해 인식하면, 인식된 2차원코드와 매칭되어 있는 상기 3차원 상품데이터를 사용자에 의해 선택된 상기 3차원 실제인물 캐릭터에 적용하되,배경, 헤어스타일 및 피부톤 중 적어도 하나의 설정이 가능한 3차원 가상피팅정보를 생성하는 것을 특징으로 하는 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템."}
{"patent_id": "10-2023-0077219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 쇼핑몰 시스템은,인공지능 기술을 기반으로 가상인물에 대한 3차원 모델링을 수행하되, 성별, 신체, 나이, 체형에 따른 모델링을각각 수행하여 3차원 가상인물 캐릭터를 생성하는 3차원 가상인물 캐릭터 모델링 수행부를 더 포함하고,상기 3차원 가상피팅정보 생성부는,온/오프라인을 통해 판매하는 실제상품에 대한 2차원 코드를 사용자 통신단말을 통해 인식하면, 인식된 2차원코드와 매칭되어 있는 상기 3차원 상품데이터를 사용자에 의해 선택된 상기 3차원 가상인물 캐릭터에 적용하되,배경, 헤어스타일 및 피부톤 중 적어도 하나의 설정이 가능한 3차원 가상피팅정보를 생성하는 것을 특징으로 하는 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템."}
{"patent_id": "10-2023-0077219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,공개특허 10-2024-0165828-3-상기 사용자 캐릭터 모델링 수행부는,상기 3차원 사용자 신체데이터 및 상기 3차원 사용자 얼굴데이터를 기반으로 사용자의 스캐닝 시점에서의 신체및 얼굴 특징이 반영된 3차원 사용자 캐릭터를 모델링하며, 3차원 사용자 캐릭터에 대한 배경, 헤어스타일 및피부톤 중 적어도 하나의 설정이 가능한 현재 시점 3차원 사용자 캐릭터 생성부; 및사용자로부터 다이어트 및 성형 중 적어도 하나에 대한 목표 값을 설정 받고, 설정된 목표 값을 인공지능 기술을 기반으로 상기 3차원 사용자 신체데이터 및 상기 3차원 사용자 얼굴데이터 중 적어도 하나에 반영하여 사용자의 미래 시점에서의 신체 및 얼굴 특징 중 적어도 하나의 특징이 반영된 차원 사용자 캐릭터를 모델링하며, 3차원 사용자 캐릭터에 대한 배경, 헤어스타일 및 피부톤 중 적어도 하나의 설정이 가능한 미래 시점 3차원 사용자 캐릭터 생성부를 포함하는 것을 특징으로 하는 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템."}
{"patent_id": "10-2023-0077219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 3차원 가상피팅정보 생성부는,인공지능 기술을 기반으로 상기 3차원 사용자 캐릭터의 자세 및 움직임에 따른 상기 3차원 상품데이터에 대한변형정보를 3차원 가상피팅정보에 반영하여 표현되도록 3차원 가상피팅정보를 가공하고,상기 3차원 사용자 캐릭터의 자세 및 움직임은 상기 3차원 사용자 신체데이터에 포함된 데이터인 것을 특징으로하는 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템."}
{"patent_id": "10-2023-0077219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 3차원 가상피팅정보 생성부는,디스플레이에서 출력 가능한 3차원 콘텐츠인 3차원 가상피팅정보를 VR(Virtual Reality) 콘텐츠 및AR(Augmented Reality) 콘텐츠 중 적어도 하나의 콘텐츠로 변환하여 추가 제공하는 것을 특징으로 하는 2차원코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템."}
{"patent_id": "10-2023-0077219", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템에 관한 것으로, 해결하고자 하는 과제는 3 차원 스캐너를 통해 획득된 사용자의 신체외형정보에 기반한 3차원 아바타와 실물제품에 대한 3차원 그래픽을 결 합하여 해당 아바타에 가상으로 착용된 의류의 피팅, 재질, 질감, 구김, 주름 등을 실제와 가깝게 구현한 3차원 (뒷면에 계속)"}
{"patent_id": "10-2023-0077219", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템에 관한 것이다."}
{"patent_id": "10-2023-0077219", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온라인 쇼핑 유저가 증가함에 따라 현재 제공되고 있는 온라인 쇼핑몰 서비스들은 사용자의 사진과 판매 상품의 사진을 합성한 착용 사진을 제공함으로써 사용자가 상품 구매 전에 해당 상품이 사용자 자신에게 잘 어울리는지 등을 미리 확인할 수 있게 하는 서비스를 제공하고 있다. 그러나, 일반적인 2차원 사진을 합성하는 방식은 사람의 체형에 따른 입체감을 고려하지 않고, 단순히 의류 사 진의 크기와 형태만을 고려하여 변환하기 때문에 합성된 사진이 부자연스럽다는 문제점이 있다. 또한, 3차원 기술을 이용하여 사진을 합성하는 경우, 3차원 아바타 혹은 실시간 촬영을 통해 획득한 영상에 3차 원 의류를 입히는 방식을 취하는데, 이러한 방식은 3차원 처리 기술에 대한 높은 비용, 속도 및 안정성에 대한 한계가 있다는 문제점이 있다. 이와 더불어, 각각의 판매 상품에 대해 3차원 처리를 수행해야 하기 때문에 수많은 상품을 대상으로 처리하고 등록하는 데에 소요되는 시간과 비용이 크다는 문제점이 있다.선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2015-0070459호(공개일자: 2015년06월25일) (특허문헌 0002) 공개특허공보 제10-2020-0038777호(공개일자: 2020년04월14일) (특허문헌 0003) 공개특허공보 제10-2007-0010702호(공개일자: 2007년01월24일) (특허문헌 0004) 공개특허공보 제10-2021-0141322호(공개일자: 2021년11월23일)"}
{"patent_id": "10-2023-0077219", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는, 3차원 스캐너를 통해 획득된 사용자의 신체외형정보에 기반한 3차원 아바타와 실물제품에 대한 3차원 그래픽을 결합하여 해당 아바타에 가상으로 착용된 의류의 피팅, 재질, 질감, 구김, 주름 등을 실제 와 가깝게 구현한 3차원 가상피팅정보를 제공함으로써 실제제품을 착용하지 않더라도 사용자가 사실과 가까운 제품 착용 상태를 확인할 수 있도록 하며, 사용자의 스타일과 사용자의 외형적 변화를 아바타에 반영함으로써 판매 제품이 사용자 자신에게 잘 매칭되는지에 대한 정확한 판단과 그에 따른 구매 결정을 하는데 도움을 줄 수 있는 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템을 제공한다."}
{"patent_id": "10-2023-0077219", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템은, 사용자의 전신을 360도 스캐닝 하여 3차원 사용자 신체데이터 및 3차원 사용자 얼굴데이터를 각각 생성하고, 온/오프라인을 통해 판매 하는 실제상품을 360도 스캐닝 하여 3차원 상품데이터를 생성하는 3차원 스캐닝 장치부; 상기 3차원 사용자 신 체데이터 및 상기 3차원 사용자 얼굴데이터를 기반으로 3차원 사용자 캐릭터를 모델링하는 3차원 사용자 캐릭터 모델링 수행부; 온/오프라인을 통해 판매하는 실제상품에 대하여 2차원 코드를 각각 생성하고, 생성된 상기 2차 원 코드를 해당 실제상품을 대상으로 생성된 상기 3차원 상품데이터와 매칭하는 2차원 코드 관리부; 및 사용자 통신단말을 통해 상기 2차원 코드를 인식하면, 인식된 상기 2차원 코드와 매칭되는 상기 3차원 상품데이터를 상 기 3차원 사용자 캐릭터에 적용하는 3차원 가상피팅정보를 생성하여 제공하는 3차원 가상피팅정보 생성부를 포 함한다. 또한, 상기 쇼핑몰 시스템은, 초상권에 대한 사전 합의가 이루어진 연예인 및 인플루언서 중 적어도 하나의 실 제인물에 대한 얼굴이미지데이터로부터 얼굴특징을 추출하고, 추출된 얼굴특징을 기반으로 3차원 모델링을 수행 하여 3차원 실제인물 캐릭터를 생성하는 3차원 실제인물 캐릭터 모델링 수행부를 더 포함하고, 상기 3차원 가상 피팅정보 생성부는, 온/오프라인을 통해 판매하는 실제상품에 대한 2차원 코드를 사용자 통신단말을 통해 인식 하면, 인식된 2차원 코드와 매칭되어 있는 상기 3차원 상품데이터를 사용자에 의해 선택된 상기 3차원 실제인물 캐릭터에 적용하되, 배경, 헤어스타일 및 피부톤 중 적어도 하나의 설정이 가능한 3차원 가상피팅정보를 생성할 수 있다. 또한, 상기 쇼핑몰 시스템은, 인공지능 기술을 기반으로 가상인물에 대한 3차원 모델링을 수행하되, 성별, 신체, 나이, 체형에 따른 모델링을 각각 수행하여 3차원 가상인물 캐릭터를 생성하는 3차원 가상인물 캐릭터 모 델링 수행부를 더 포함하고, 상기 3차원 가상피팅정보 생성부는, 온/오프라인을 통해 판매하는 실제상품에 대한 2차원 코드를 사용자 통신단말을 통해 인식하면, 인식된 2차원 코드와 매칭되어 있는 상기 3차원 상품데이터를 사용자에 의해 선택된 상기 3차원 가상인물 캐릭터에 적용하되, 배경, 헤어스타일 및 피부톤 중 적어도 하나의 설정이 가능한 3차원 가상피팅정보를 생성할 수 있다. 또한, 상기 사용자 캐릭터 모델링 수행부는, 상기 3차원 사용자 신체데이터 및 상기 3차원 사용자 얼굴데이터를 기반으로 사용자의 스캐닝 시점에서의 신체 및 얼굴 특징이 반영된 3차원 사용자 캐릭터를 모델링하며, 3차원 사용자 캐릭터에 대한 배경, 헤어스타일 및 피부톤 중 적어도 하나의 설정이 가능한 현재 시점 3차원 사용자 캐 릭터 생성부; 및 사용자로부터 다이어트 및 성형 중 적어도 하나에 대한 목표 값을 설정 받고, 설정된 목표 값 을 인공지능 기술을 기반으로 상기 3차원 사용자 신체데이터 및 상기 3차원 사용자 얼굴데이터 중 적어도 하나에 반영하여 사용자의 미래 시점에서의 신체 및 얼굴 특징 중 적어도 하나의 특징이 반영된 차원 사용자 캐릭터 를 모델링하며, 3차원 사용자 캐릭터에 대한 배경, 헤어스타일 및 피부톤 중 적어도 하나의 설정이 가능한 미래 시점 3차원 사용자 캐릭터 생성부를 포함할 수 있다. 또한, 상기 3차원 가상피팅정보 생성부는, 인공지능 기술을 기반으로 상기 3차원 사용자 캐릭터의 자세 및 움직 임에 따른 상기 3차원 상품데이터에 대한 변형정보를 3차원 가상피팅정보에 반영하여 표현되도록 3차원 가상피 팅정보를 가공하고, 상기 3차원 사용자 캐릭터의 자세 및 움직임은 상기 3차원 사용자 신체데이터에 포함된 데 이터일 수 있다. 또한, 상기 3차원 가상피팅정보 생성부는, 디스플레이에서 출력 가능한 3차원 콘텐츠인 3차원 가상피팅정보를 VR(Virtual Reality) 콘텐츠 및 AR(Augmented Reality) 콘텐츠 중 적어도 하나의 콘텐츠로 변환하여 추가 제공 할 수 있다. 또한, 상기 쇼핑몰 시스템은, 상기 3차원 스캐닝 장치부를 통한 스캐닝 시점 시 인바디 측정기로부터 사용자의 체성분 측정 데이터를 획득하여 기준 체성분 데이터로 설정하고, 쇼핑 시점 시 인바디 측정기로부터 사용자의 체성분 측정 데이터를 획득하고, 쇼핑 시점에서 획득된 체성분 측정 데이터 및 스캐닝 시점에서 설정된 상기 기 준 체성분 데이터를 비교하여 체성분 차이가 기준치를 초과하는 경우 쇼핑 시점에서 획득된 체성분 측정 데이터 를 상기 3차원 사용자 신체데이터에 반영하여 상기 3차원 사용자 캐릭터의 외형을 수정하는 인바디 기반 3차원 사용자 캐릭터 수정부를 더 포함할 수 있다. 또한, 상기 쇼핑몰 시스템은, 사용자의 신체 각 부위에 벨트 방식으로 착용되고, 착용된 신체 부위를 미리 설정 된 단계에 따라 조이는 동작을 수행하면서 단계 별로 해당 신체 부위에 가해지는 압력 값을 측정하고, 각 단계 별 둘레 값이 각각 미리 저장되어 있고, 측정된 압력 값이 미리 설정된 기준 압력 값에 도달할 때 가압된 신체 부위에 대한 둘레를 측정하는 신체 둘레 측정 장치부; 및 상기 3차원 스캐닝 장치부를 통한 스캐닝 시점 시 상 기 신체 둘레 측정 장치부로부터 사용자의 둘레 값을 획득하여 기준 둘레 값으로 설정하고, 쇼핑 시점 시 상기 신체 둘레 측정 장치부로부터 사용자의 둘레 값을 획득하고, 쇼핑 시점에서 획득된 둘레 값과 및 스캐닝 시점에 서 설정된 상기 기준 둘레 값을 비교하여 둘레 차이가 기준치를 초과하는 경우 쇼핑 시점에서 획득된 둘레 값을 상기 3차원 사용자 신체데이터에 반영하여 상기 3차원 사용자 캐릭터의 외형을 수정하는 신체 둘레 기반 3차원 사용자 캐릭터 수정부를 더 포함할 수 있다. 또한, 상기 쇼핑몰 시스템은, 판매 완료된 상품정보와 해당 상품을 구매한 사용자의 3차원 사용자 신체데이터를 기반으로 일정 시간 단위로 체형 별 선호상품정보를 생성하여 제공하는 상품통계정보 제공부를 더 포함할 수 있 다. 또한, 상기 3차원 가상피팅정보 생성부는, 사용자로부터 상기 3차원 사용자 캐릭터의 자세 및 움직임에 옵션을 선택 받고, 선택된 옵션에 따른 자세 및 움직임을 인공지능 기술을 기반으로 상기 3차원 가상피팅정보에 반영하 여 표현되도록 3차원 가상피팅정보를 가공할 수 있다."}
{"patent_id": "10-2023-0077219", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 3차원 스캐너를 통해 획득된 사용자의 신체외형정보에 기반한 3차원 아바타와 실물제품에 대 한 3차원 그래픽을 결합하여 해당 아바타에 가상으로 착용된 의류의 피팅, 재질, 질감, 구김, 주름 등을 실제와 가깝게 구현한 3차원 가상피팅정보를 제공함으로써 실제제품을 착용하지 않더라도 사용자가 사실과 가까운 제품 착용 상태를 확인할 수 있도록 하며, 사용자의 스타일과 사용자의 외형적 변화를 아바타에 반영함으로써 판매 제품이 사용자 자신에게 잘 매칭되는지에 대한 정확한 판단과 그에 따른 구매 결정을 하는데 도움을 줄 수 있는 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템을 제공할 수 있다."}
{"patent_id": "10-2023-0077219", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나 이상의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설 명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 본 발명의 실시예에 따른 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템의 전체 구성을 나타 낸 개요도이고, 도 2는 본 발명의 실시예에 따른 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템의 전체 구성을 나타낸 블록도이고, 도 3은 본 발명의 실시예에 따른 3차원 사용자 캐릭터 모델링 수행부의 구성을 나타낸 블록도이고, 도 4는 본 발명의 실시예에 따른 미래 시점 3차원 사용자 캐릭터 생성 과정을 설명하기 위 해 나타낸 도면이고, 도 5는 본 발명의 실시예에 따른 2차원 코드 관리부와 연계된 3차원 가상피팅정보 생성부 의 동작을 설명하기 위해 나타낸 도면이고, 도 6은 본 발명의 실시예에 따른 3차원 사용자 캐릭터를 설명하기 위해 나타낸 도면이고, 도 7은 본 발명의 실시예에 따른 3차원 실제인물 캐릭터를 설명하기 위해 나타낸 도면이 고, 도 8은 본 발명의 실시예에 따른 3차원 가상인물 캐릭터를 설명하기 위해 나타낸 도면이고, 도 9는 본 발명 의 실시예에 따른 제품 별 실제인물 또는 가상인물의 3D 가상피팅 모델 컷 확인 후 해당 제품의 QR 코드 스캔 시 사용자 본인의 캐릭터에 적용되어 표시하는 사용자 본인에 대한 3D 가상피팅정보의 제공 방식을 설명하기 위 해 나타낸 도면이고, 도 10은 본 발명의 실시예에 따른 인바디 기반 3차원 사용자 캐릭터 수정 방식을 설명하기 위해 나타낸 도면이고, 도 11은 본 발명의 실시예에 따른 신체 둘레 측정 장치부의 동작 원리를 설명하기 위해 나타낸 도면이며, 도 12는 본 발명의 실시예에 따른 신체 둘레 기반 3차원 사용자 캐릭터 수정 방식을 설명하기 위해 나타낸 도면이다.도 1 및 도 2를 참조하면, 본 발명의 실시예에 따른 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템 은, 3차원 스캐닝 장치부, 3차원 사용자 캐릭터 모델링 수행부, 2차원 코드 관리부, 3차원 가상피팅정보 생성부, 3차원 실제인물 캐릭터 모델링 수행부, 3차원 가상인물 캐릭터 모델링 수행부 , 인바디 기반 3차원 사용자 캐릭터 수정부, 신체 둘레 측정 장치부, 신체 둘레 기반 3차원 사 용자 캐릭터 수정부 및 상품통계정보 제공부 중 적어도 하나를 포함할 수 있다. 상기 3차원 스캐닝 장치부는, 사용자의 전신을 360도 스캐닝(촬영) 하여 3차원 사용자 신체데이터 및 3차 원 사용자 얼굴데이터를 각각 생성하고, 실제상품을 360도 스캐닝 하여 3차원 상품데이터를 생성할 수 있다. 상기 3차원 스캐닝 장치부에는 카메라 모듈(미도시)이 설치될 수 있으며, 이러한 카메라 모듈은 촬영 대상 인 사용자로부터 미리 설정된 기준 거리에 설치되고, 미리 구축된 구동 제어 프로세스에 따라 카메라 모듈이 사 용자의 주변을 360도 회전하면서 미리 설정된 프레임(frames) 속도로 촬영함으로써 사용자에 대한 3D 신체데이 터를 획득할 수 있다. 이때, 카메라 모듈은 지면으로부터 미리 설정된 기준 높이에 각각 설치될 수 있다. 예를 들어, 카메라 모듈은 사용자를 360도 회전시키면서 사용자 주변에 설치된 1대 내지 4대의 카메라를 사용하여 초당 30~60 프레임의 속 도로 사용자를 촬영하고, 촬영된 다수의 이미지를 정합하여 깊이(depth) 값을 산출할 수 있다. 바람직하게는, 사용자를 중심으로 4개의 방향에 90도 간격으로 배치된 카메라를 이용하여 사용자의 전면 영상을 동시에 신속하 게 촬영할 수 있다. 이와 같이 3차원 스캐닝 장치부의 카메라 모듈은 미리 설정된 기준 거리 및 기준 높이에 맞게 배치되어 사 용자를 촬영함으로써 촬영된 이미지 상에 동일한 위치 좌표를 지정할 수 있고, 지정된 위치 좌표를 통해 촬영된 사용자의 신체 지수를 측정하기 위한 기준 크기를 설정할 수 있다. 이때 사용자를 360도 회전시키면서 필요한 전방위 영상 정보를 수집하기 위한 턴테이블(미도시)을 더 포함할 수 있다. 또한, 3차원 스캐닝 장치부의 카메라 모듈은 후술하는 사용자의 치수 측정을 용이하게 하기 위해 카메라를 통한 사용자의 촬영 시 미리 설정된 기준 대상체를 동일한 디스플레이 상에서 사용자와 함께 촬영하여 사용자의 치수 측정을 위한 기준 크기를 설정할 수 있다. 이때, 기준 대상체는 동전, 지폐, 담뱃갑 등과 같이 크기가 규 격화되어 누구나 쉽게 정확한 크기를 알 수 있는 물체가 적용될 수 있으며, 3D 영상 정보를 이용하여 사용자의 치수 추출을 위한 비교 기준 크기 정보를 제공할 수 있다. 또한, 3차원 스캐닝 장치부은 카메라 모듈을 통해 스캔한 사용자의 얼굴에 대한 3차원 깊이 정보 및 영상 정보를 통해 사용자에 대한 3차원 얼굴데이터를 생성할 수 있다. 상기 3차원 스캐닝 장치부의 카메라 모듈은 사용자의 신체를 대상으로 한 3차원 스캐닝뿐만 아니라, 동일 한 방식으로 실제상품(의류, 신발, 가방, 액세서리 등)을 360도 스캐닝(촬영) 하여 실제상품에 대한 3차원 상품 데이터를 생성할 수 있다. 상기 3차원 사용자 캐릭터 모델링 수행부는, 3차원 사용자 신체데이터 및 3차원 사용자 얼굴데이터를 기반 으로 3차원 사용자 캐릭터를 모델링 할 수 있다. 이러한 3차원 사용자 캐릭터 모델링 수행부는 도 3에 도시된 바와 같이, 현재 시점 3차원 사용자 캐릭터 생성부 및 미래 시점 3차원 사용자 캐릭터 생성부 중 적어도 하나를 포함할 수 있다. 상기 현재 시점 3차원 사용자 캐릭터 생성부는, 3차원 사용자 신체데이터 및 상기 3차원 사용자 얼굴데이 터를 기반으로 사용자의 스캐닝 시점에서의 신체 및 얼굴 특징이 반영된 3차원 사용자 캐릭터를 모델링하며, 3 차원 사용자 캐릭터에 대한 배경, 헤어스타일 및 피부톤 중 적어도 하나를 설정할 수 있다. 이를 위해, 현재 시점 3차원 사용자 캐릭터 생성부는, 딥러닝 학습을 기반으로 얼굴의 눈, 코, 입, 턱 등 을 인식하도록 학습 모듈을 구비하며, 기계 학습 모듈을 이용하여 얼굴의 특징점 정보를 추출할 수 있다. 미리 구축된 딥러닝 학습모델로 얼굴데이터를 검출해 새로운 이미지에 적용된 딥러닝 모델의 정확도를 교차 검증하고 검출된 이목구비의 주요 특징을 도출할 수 있다. 이러한 얼굴 특징점 추출 과정은 먼저 전처리 과정을 수행한 후 레이블링 연산에서 추출된 후보 객체정보로부터 특징점을 추출하기 위해 다음과 같은 각각의 얼굴 검출 알고리즘이 적용될 수 있다. 눈 특징점 검출은 레이블링 연산을 수행한 후 추출한 얼굴개체들에 대해 수직, 수평좌표를 이용하여 수평중앙선 위쪽과 수직중앙선 왼쪽에 존재하는 객체 중에서 대칭되는 객체의 존재여부를 가려낼 수 있다. 대칭되는 객체가 두 개 이상 존재하면 대칭 되는 객체들의 아래 쪽에 위치하고, 임계 값 이하인 대칭 쌍을 눈 특징점 영역으로 추출할 수 있다. 코 특징점검출은 눈 특징점을 검출한 후 레이블링 된 연산된 객체들 중에서 눈 아래와 양쪽 눈 사이에 존재하며, 수직좌 표 차이가 임계 값 이하인 객체를 코 영역으로 추출할 수 있다. 입 특징점 추출은 코 특징점 추출 후 레이블링 연산된 객체들 중에서 코 영역 아래에 위치하고 두 눈 좌표의 외곽 끝점 내에 존재하는 객체를 입 영역으로 추 출할 수 있다. 이외에도 얼굴 특징점 정보를 세부 분류하기 위해 얼굴형태, 눈 크기, 눈꼬리 높이, 눈썹 모양, 눈썹 길이, 눈썹꼬리 높이, 이마 높이, 이마 폭, 코 길이, 콧망울 크기, 입술 두께, 입 크기, 입술 꼬리 높이, 인당(눈과 눈썹 간 거리), 인중(코와 윗입술간 거리), 미간(눈썹간 거리)의 형태와 길이 정보를 추출하여 세부 분류에 사용할 수 있다. 상기 미래 시점 3차원 사용자 캐릭터 생성부는, 사용자로부터 다이어트 및 성형 중 적어도 하나에 대한 목 표 값을 설정 받고, 설정된 목표 값을 인공지능 기술을 기반으로 3차원 사용자 신체데이터 및 3차원 사용자 얼 굴데이터 중 적어도 하나에 반영하여 사용자의 미래 시점에서의 신체 및 얼굴 특징 중 적어도 하나의 특징이 반 영된 차원 사용자 캐릭터를 모델링 할 수 있다. 좀 더 구체적으로, 사용자는 자신의 스캐닝 시점(현재 시점에 해당)이 아닌 향후 가까운 미래에 바뀔 자신의 모 습을 설정할 수 있으며, 예를 들어 도 4에 도시된 바와 같이 현재 시점에서 10kg 감량된 모습을 인공지능 기술 을 기반으로 3차원 사용자 신체데이터 및 3차원 사용자 얼굴데이터를 수정함으로써, 그에 따라 변형된 3차원 사 용자 캐릭터 즉, 미래 시점 3차원 사용자 캐릭터를 생성할 수 있다. 또한, 코 성형 또는 가슴 성형 후 외형적으 로 달라질 부분을 인공지능 기술을 기반으로 예측하고, 예측된 데이터를 기반으로 현재 시점 3차원 사용자 캐릭 터를 수정함으로써, 그에 따라 변형된 차원 사용자 캐릭터 즉, 미래 시점 3차원 사용자 캐릭터를 생성할 수 있 다. 이와 같이, 미래 시점 3차원 사용자 캐릭터 생성부는 사용자의 다이어트나 성형 등으로 인해 향후 미래에 외모 변화를 인공지능 기술 기반으로 예측 및 설정하고, 설정된 목표 값을 현재 시점 3차원 사용자 캐릭터에 적 용하여 해당 캐릭터의 외형적 특징을 수정함으로써 목표 값에 따라 변형된 미래의 사용자 모습을 반영하는 3차 원 사용자 캐릭터를 사용자 자신의 아바타로서 이용할 수 있도록 한다. 또한, 미래 시점 3차원 사용자 캐릭터 생성부는 3차원 사용자 캐릭터에 대한 배경, 헤어스타일 및 피부톤 중 적어도 하나를 설정할 수 있다. 예를 들어, 사용자가 디스플레이 장치를 통해 3차원 사용자 캐릭터를 확인할 때, 해당 캐릭터 주변 환경인 배경 을 해변, 스튜디오, 교실, 서점, 길거리, 카페 등으로 설정하면 해당 캐릭터가 설정된 배경에 배치된 모습을 볼 수 있도록 한다. 또한, 3차원 사용자 캐릭터의 헤어스타일을 다양하게 설정할 수 있으며 컷 방식에 따른 헤어스 타일에 대한 일례로, 머쉬룸 컷, 언밸런스 컷, 블런트 컷, 모던 컷, 레이어드 컷, 히메 컷, 보보 컷, 에이라인 컷 등 어느 하나로 설정할 수 있으며, 펌의 경우 미로 펌, 보더 펌, 레인 펌, 러플 펌, 빌드 펌, 샌드 펌, 벌룬 펌, 에그 펌 등 다양한 펌 종류 중 하나를 설정할 수 있다. 피부톤의 경우, 사람의 피부색에 속하는 다양한 색 상표를 선택 가능하게 제공하여, 자신의 피부톤에 맞는 색상을 설정할 수 있다. 상기 2차원 코드 관리부는, 온/오프라인 쇼핑몰을 통해 판매하는 실제상품에 대하여 2차원 코드를 각각 생 성하고, 생성된 2차원 코드를 해당 실제상품을 대상으로 생성된 3차원 상품데이터와 매칭할 수 있다. 본 실시예에 따른 2차원 코드는 QR 코드, 바코드 형태로 구현될 수 있으며, 온라인 쇼핑몰에서 판매하는 실제상 품의 경우, 해당 상품정보에 표시될 수 있으며, 오프라인 쇼핑몰에서 판매하는 실제상품의 경우, 해당 상품의 택(tag)에 인쇄된 형태로 표시될 수 있어, 사용자 통신단말의 카메라를 통해 촬영(스캔)하면 해당 2차원 코 드에 포함된 식별정보가 인식될 수 있다. 이때, 2차원 코드는 3차원 스캐닝 장치부를 통하여 3차원 상품데이터가 생성된 실제상품을 대상으로 생성 되며, 생성 후 해당 실제상품에 대한 3차원 상품데이터와 매칭되어 관리될 수 있다. 상기 3차원 가상피팅정보 생성부는, 도 5 및 도 6에 도시된 바와 같이 온/오프라인 쇼핑몰에서 판매하는 사용자 통신단말을 통해 2차원 코드를 인식하면, 인식된 2차원 코드와 매칭되는 3차원 상품데이터를 사용자 본인에 대하여 미리 생성해 놓은 3차원 사용자 캐릭터에 적용함으로써, 사용자 본인이 QR 코드와 매칭된 상품 (의류)를 가상으로 피팅한 모습을 볼 수 있는 3차원 가상피팅정보를 생성하여 제공할 수 있다. 좀 더 구체적으로 설명하면, 사용자 통신단말의 전용 어플리케이션을 통해 실제상품의 QR 코드를 스캔하면, 스캔된 QR 코드의 식별정보를 인식하고, 이와 동시에 해당 어플리케이션을 통해 사전에 등록해 놓은 캐릭터 ID (사용자의 3차원 사용자 캐릭터 ID)를 추출하여, QR 코드의 인식정보 및 캐릭터 ID를 3차원 가상피팅정보 생성 부로 전달할 수 있다. 물론, 사용자의 선택에 따라 사용자 자신의 캐릭터 이외에 후술하는제3자(실제인물, 가상인물)에 대한 캐릭터를 3차원 사용자 캐릭터를 대신 적용함으로써 부가적인 서비스를 제공 할 수도 있다. 본 실시예에 따라 QR 코드의 응용 방식에 대하여 설명하면, 예를 들어 온/오프라인 쇼핑몰에서 판매하는 실제상 품에 대한 QR 코드를 찍으면 사용자 자신이 해당 상품을 입은 가상의 모습을 바로 확인할 수 있고, 이후 구매 결정이 이루어질 수 있다. 이러한 서비스는 전용 어플리케이션을 통해 제공될 수 있으며, 좀 더 구체적으로는 생성된 3차원 가상피팅정보를 타 사용자에게 전송하기 기능, 선물 조르기 기능, 선물하기 기능, BJ 방송에 후원 기능, BJ에게 현금대신 선물(실물의류, 가방, 여행상품권 등) 지급 기능을 제공할 수 있다. 또한, 전용 어플리 케이션은 선물 받은 실제상품에 대한 리셀을 돕는 기능, 선물 받기를 성공하였을 경우 3차원 가상피팅정보에 배 경이미지를 삽입하여 배경 인증샷혼자 찍은 것을 제공하는 사진 선물 서비스를 추가적으로 제공할 수도 있다. 한편, 오프라인 쇼핑 시 여자친구가 남자친구에서 3차원 가상피팅정보를 전송하고, 남자친구가 해당 이미지나 영상을 확인한 후 결제를 진행하는 기능을 제공함으로써, 남녀 커플이 오프라인 쇼핑몰에 동행하지 않더라도 실 물상품에 대한 착용샷을 확인하고 선물할 수 있도록 한다. 상기 3차원 가상피팅정보 생성부는, 인공지능 기술을 기반으로 3차원 사용자 캐릭터의 자세 및 움직임에 따른 3차원 상품데이터에 대한 변형정보를 3차원 가상피팅정보에 반영하여 표현되도록 3차원 가상피팅정보를 가 공(수정)할 수 있다. 이때, 3차원 사용자 캐릭터의 자세 및 움직임은 3차원 사용자 신체데이터에 포함된 데이터일 수 있다. 즉, 사용 자를 3차원 스캐닝 하는 과정에서 모션센서를 활용한 모션데이터를 추가적으로 획득할 수 있으며, 획득한 모션 데이터를 3차원 사용자 캐릭터에 적용함으로써 3차원 사용자 캐릭터의 특정 자세와 움직임을 구현할 수 있다. 또한, 3차원 상품데이터가 적용(착용)되어 있는 3차원 사용자 캐릭터가 특정 자세와 움직임을 취했을 때 나타나 는 옷감의 주름, 접힘, 늘어남 등이 3차원 상품데이터에 반영되도록 함으로써, 사용자가 제품을 실제 착용하여 입은 상태에서 특정 자세를 취하거나 움직였을 때 해당 제품에서 나타나는 외형적 현상을 사실적으로 묘사하여 표현될 수 있도록 한다. 상기 3차원 가상피팅정보 생성부는, 디스플레이에서 출력 가능한 3차원 콘텐츠인 3차원 가상피팅정보를 VR(Virtual Reality) 콘텐츠 및 AR(Augmented Reality) 콘텐츠 중 적어도 하나의 콘텐츠로 변환하여 추가적으 로 제공할 수 있다. 즉, 3차원 가상피팅정보 생성부는 3차원 가상피팅정보를 스마트폰, PC, 테블릿 PC 등 일반적인 디스플레이 를 통해 출력되는 3차원 콘텐츠로 기본 제공하며, 이뿐만 아니라, VR이나 AR 콘텐츠로 변환 또는 제작하여 제공 할 수도 있다. 이에 따라, 3차원 가상피팅정보를 VR이나 AR로 시청할 수 있도록 하여 보다 큰 사실감이나 현실 감을 느낄 수 있도록 할 수 있으며, 이에 다라 상품 구매 시 보다 정확한 판단이 가능하도록 도울 수 있다. 상기 3차원 가상피팅정보 생성부는, 사용자로부터 사용자 본인에 대한 3차원 사용자 캐릭터의 자세 및 움 직임에 옵션을 선택 받고, 선택된 옵션에 따른 자세 및 움직임을 인공지능 기술을 기반으로 3차원 가상피팅정보 에 반영하여 표현되도록 3차원 가상피팅정보를 가공할 수 있다. 상술한 바와 같이, 사용자를 3차원 스캐닝 하는 과정에서 사용자의 자세와 움직임에 대한 모션데이터를 추가적 으로 획득할 수 있는데, 획득한 모션데이터를 3차원 사용자 캐릭터에 적용한 후, 사용자가 원하는 자세나 움직 임을 설정하면, 설정된 자세나 움직임에 따라 3차원 사용자 캐릭터가 그에 따른 모션을 취하도록 구현할 수 있 다. 예를 들어, 사용자가 쪼그려 앉은 자세와 움직임 동작을 설정한 경우, 3차원 사용자 캐릭터가 해당 모션을 취하 는데, 3차원 사용자 캐릭터의 신체치수 및 3차원 상품데이터에 대한 길이, 치수, 옷의 재질 등 특성 등을 반영 함으로써, 3차원 사용자 캐릭터의 모션에 따라 상품의 변화를 확인할 수 있다. 가령, 바지를 가상으로 피팅한 경우 허리가 잘 늘어나는지, 복부 부분이 심하게 돌출되는지, 바지가 파손되는 부분은 없는지, 불필요하게 노출 되는 부분이 없는지 등을 3차원 사용자 캐릭터의 모션데이터, 신체치수정보, 3차원 상품데이터의 치수정보, 재 질정보 등을 고려해 미리 구축된 인공기술 알고리즘을 통해 예상되는 현상을 3차원 가상피팅정보에 반영하여 보 여줄 수 있다. 상기 3차원 실제인물 캐릭터 모델링 수행부는, 초상권에 대한 사전 합의가 이루어진 연예인 및 인플루언서 중 적어도 하나의 실제인물에 대한 얼굴이미지데이터로부터 얼굴특징을 추출하고, 추출된 얼굴특징을 기반으로 3차원 모델링을 수행하여 3차원 실제인물 캐릭터를 생성할 수 있으며, 사용자의 선택에 따라 실제상품에 할당된QR 코드를 이용하여 3차원 상품데이터를 3차원 실제인물 캐릭터에 적용하여 사용자 자신이 아닌 제3자가 상품을 가상 피팅하여 보여줄 수 있는 3차원 가상피팅정보를 생성하는 부가 서비스를 제공할 수 있다. 예를 들어, 도 7에 도시된 바와 같이 아이돌, 여배우, 인스타 인플루언서 등 유명한 실제인물 대상으로 사전에 초상권 합의를 이룬 후에 해당 실제인물에 대한 얼굴특징데이터를 기반으로 3차원 실제인물 캐릭터를 생성할 수 있으며, 이때, 해당 캐릭터의 체형은 사용자 자신의 체형에 맞게 적용하거나, 마름, 보통, 통통함 등의 옵션을 제공하여 사용자가 원하는 조합에 따라 변형할 수도 있다. 한편, 3차원 가상피팅정보 생성부는, 쇼핑몰에서 판매하는 실제상품 중 사용자에 의해 선택된 상품에 대한 3차원 상품데이터를 3차원 실제인물 캐릭터에 적용한 3차원 가상피팅정보를 생성 및 제공함에 있어서, 배경, 헤 어스타일 및 피부톤 중 적어도 하나에 대한 설정이 가능하도록 한다. 예를 들어, 사용자가 디스플레이 장치를 통해 3차원 실제인물 캐릭터를 확인할 때, 해당 캐릭터 주변 환경인 배 경을 해변, 스튜디오, 교실, 서점, 길거리, 카페 등으로 설정하면 해당 캐릭터가 설정된 배경에 배치된 모습을 볼 수 있도록 한다. 또한, 3차원 실제인물 캐릭터의 헤어스타일을 다양하게 설정할 수 있으며 컷 방식에 따른 헤어스타일에 대한 일례로, 머쉬룸 컷, 언밸런스 컷, 블런트 컷, 모던 컷, 레이어드 컷, 히메 컷, 보보 컷, 에 이라인 컷 등 어느 하나로 설정할 수 있으며, 펌의 경우 미로 펌, 보더 펌, 레인 펌, 러플 펌, 빌드 펌, 샌드 펌, 벌룬 펌, 에그 펌 등 다양한 펌 종류 중 하나를 설정할 수 있다. 피부톤의 경우, 사람의 피부색에 속하는 다양한 색상표를 선택 가능하게 제공하여, 사용자가 원하는 피부톤을 설정할 수 있다. 상기 3차원 가상인물 캐릭터 모델링 수행부는, 도 8에 도시된 바와 같이 인공지능 기술을 기반으로 가상인 물에 대한 3차원 모델링을 수행하되, 성별, 신체, 나이, 체형에 따른 모델링을 각각 수행하여 3차원 가상인물 캐릭터를 생성할 수 있다. 본 실시예에 따른 3차원 가상인물 캐릭터는 실존하지 않은 가상의 인물에 대한 캐릭 터로서, 임의의 창작물에 해당될 수 있다. 이때, 사용자의 선택에 따라 실제상품에 할당된 QR 코드를 이용하여 3차원 상품데이터를 3차원 실제인물 캐릭터에 적용하여 사용자 자신이 아닌 가상의 인물이 상품을 가상 피팅하 여 보여줄 수 있는 3차원 가상피팅정보를 생성하는 부가 서비스를 제공할 수 있다. 또한, 3차원 가상피팅정보 생성부는, 쇼핑몰에서 판매하는 실제상품 중 사용자에 의해 선택된 상품에 대한 3차원 상품데이터를 3차원 가상인물 캐릭터에 적용한 3차원 가상피팅정보를 생성 및 제공함에 있어서, 배경, 헤 어스타일 및 피부톤 중 적어도 하나에 대한 설정이 가능하도록 한다. 예를 들어, 사용자가 디스플레이 장치를 통해 3차원 가상인물 캐릭터를 확인할 때, 해당 캐릭터 주변 환경인 배 경을 해변, 스튜디오, 교실, 서점, 길거리, 카페 등으로 설정하면 해당 캐릭터가 설정된 배경에 배치된 모습을 볼 수 있도록 한다. 또한, 3차원 가상인물 캐릭터의 헤어스타일을 다양하게 설정할 수 있으며 컷 방식에 따른 헤어스타일에 대한 일례로, 머쉬룸 컷, 언밸런스 컷, 블런트 컷, 모던 컷, 레이어드 컷, 히메 컷, 보보 컷, 에 이라인 컷 등 어느 하나로 설정할 수 있으며, 펌의 경우 미로 펌, 보더 펌, 레인 펌, 러플 펌, 빌드 펌, 샌드 펌, 벌룬 펌, 에그 펌 등 다양한 펌 종류 중 하나를 설정할 수 있다. 피부톤의 경우, 사람의 피부색에 속하는 다양한 색상표를 선택 가능하게 제공하여, 사용자가 원하는 피부톤을 설정할 수 있다. 한편, 도 9에 도시된 바와 같이, 사용자가 실제인물 3D 가상피팅 모델 컷(제품의 상세정보 중 하나)을 확인한 후 해당 실제인물 캐릭터가 착용하고 있는 제품에 대한 QR 코드를 스캔하면, 해당 제품(실제인물이 착용했던 제 품)을 사용자 본인이 가상으로 착용한 모습을 나타내는 3D 가상피팅정보를 표시할 수 있다. 또한, 사용자가 가 상인물 3D 가상피팅 모델 컷(제품의 상세정보 중 하나)을 확인한 후 해당 가상인물 캐릭터가 착용하고 있는 제 품에 대한 QR 코드를 스캔하면, 해당 제품(가상인물이 착용했던 제품)을 사용자 본인이 가상으로 착용한 모습을 나타내는 3D 가상피팅정보를 표시할 수 있다. 상기 인바디 기반 3차원 사용자 캐릭터 수정부는, 도 9에 도시된 바와 같이 3차원 스캐닝 장치부를 통한 스캐닝 시점 시 인바디 측정기로부터 사용자의 체성분 측정 데이터를 획득하여 기준 체성분 데이터로 설정하고, 쇼핑 시점 시 인바디 측정기로부터 사용자의 체성분 측정 데이터를 획득하고, 쇼핑 시점에서 획득된 체성분 측정 데이터 및 스캐닝 시점에서 설정된 기준 체성분 데이터를 비교하여 체성분 차이가 기준치를 초과하 는 경우 쇼핑 시점에서 획득된 체성분 측정 데이터를 3차원 사용자 신체데이터에 반영하여 3차원 사용자 캐릭터 의 외형을 수정할 수 있다. 예를 들어, 스캐닝 시점에서 사용자의 체지방률이 35%로 측정되어 기준 체지방률이 35%로 설정되었고, 이후 쇼 핑 시점(쇼핑 직전에 측정해야 함)에서 사용자의 체지방률이 25%로 측정되었으며, 기준치가 7%인 경우, 체지방 률 차이가 10%이므로 기준치인 7%를 초과한 경우에 해당되므로, 체지방률 변화 -10%에 맞게 3차원 사용자 캐릭터를 수정할 수 있다. 이때, 3차원 사용자 캐릭터는 스캐닝 시점에서 생성된 캐릭터를 기준으로 전체적으로 다 이어트 효과가 나타나도록 팔, 다리, 몸통, 가슴, 배 등의 볼륨을 체지방률 변화 값인 -10%에 상응하게 수정할 수 있다. 상기 신체 둘레 측정 장치부는, 도 10에 도시된 바와 같이 사용자의 신체 각 부위에 벨트 방식으로 착용되 고, 착용된 신체 부위를 미리 설정된 단계에 따라 조이는 동작을 수행하면서 단계 별로 해당 신체 부위에 가해 지는 압력 값을 측정하고, 각 단계 별 둘레 값이 각각 미리 저장되어 있고, 측정된 압력 값이 미리 설정된 기준 압력 값에 도달할 때 가압된 신체 부위에 대한 둘레를 측정할 수 있다. 예를 들어, 신체 둘레 측정 장치부는, 총 10개의 조임 단계(1~10단계)로 설정되어 있고, 조임 단계를 진행 할 때마다 벨트에 설치된 압력센서를 이용하여 피부에 가해지는 압력 값을 측정할 수 있으며, 스캐닝 시점에서 사용자로부터 측정된 기준 입력 값 K(N/m2)(신체부위별로 상이함)이 미리 설정되어 있다. 상기 신체 둘레 기반 3차원 사용자 캐릭터 수정부는, 도 11에 도시된 바와 같이 3차원 스캐닝 장치부(10 0)를 통한 스캐닝 시점 시 신체 둘레 측정 장치부로부터 사용자의 둘레 값을 획득하여 기준 둘레 값으로 설정하고, 쇼핑 시점 시 신체 둘레 측정 장치부로부터 사용자의 둘레 값을 획득하고, 쇼핑 시점에서 획득 된 둘레 값과 및 스캐닝 시점에서 설정된 기준 둘레 값을 비교하여 둘레 차이가 기준치를 초과하는 경우 쇼핑 시점에서 획득된 둘레 값을 3차원 사용자 신체데이터에 반영하여 3차원 사용자 캐릭터의 외형을 수정할 수 있다. 예를 들어, 신체 둘레 측정 장치부를 사용자의 복부에 착용할 경우 1단계부터 순차적으로 조이면서 압력 값 X(N/m2)을 측정하고 기준 압력 값 K(N/m2)과 대소 비교를 해 가면 신체 둘레를 측정할 수 있으며, 이러한 과 정에서 가령 5단계에서 측정된 압력 값 X(N/m2)이 기준 압력 값 K(N/m2)을 초과한 경우, 조임 단계를 5단계에서 중지시키고, 복부 부위에 대한 단계 및 압력 관계가 정의된 룩-업 테이블을 기반으로 5단계에 해당하는 복부 둘 레 값을 반환할 수 있다. 이때, 스캐닝 시점과 현재 시점 간의 복부 둘레 변화 값(inch 또는 cm)에 맞게 3차원 사용자 캐릭터를 수정할 수 있다. 가령, 복부 둘레 값이 감소한 경우, 3차원 사용자 캐릭터는 스캐닝 시점에서 생성된 캐릭터를 기준으 로 전체적으로 다이어트 효과가 나타나도록 복부의 볼륨을 복부 둘레 변화 값(inch 또는 cm)에 상응하게 수정할 수 있다. 상기 상품통계정보 제공부는, 판매 완료된 상품정보와 해당 상품을 구매한 사용자의 3차원 사용자 신체데 이터를 기반으로 일정 시간 단위로 체형 별 선호상품정보를 생성하여 제공할 수 있다. 이를 위해, 모든 사용자에 대한 3차원 신체데이터를 기반으로 체형 정의 및 분류를 실시한 후, 분류된 체형 별 로 각각의 사용자가 구매한 상품에 대한 통계정보를 생성할 수 있으며, 이러한 과정은 주 단위 또는 월 단위로 갱신할 수 있다. 이와 같이 통계된 체형 별 선호상품정보를 기반으로 사용자 자신이 현재 어떠한 체형이며, 이 러한 체형에 어떠한 상품을 많이 구매하는지 상품 트렌드를 확인할 수 있을 뿐만 아니라, 그 자체가 상품평에 대한 특성을 갖기 때문에 상품 구매 시 어떠한 상품을 구매할지 결정하는데 도움을 줄 수 있다. 이상에서 설명한 것은 본 발명에 의한 인공지능 기술을 기반으로 가상 피팅이 가능한 쇼핑몰 시스템을 실시하기 위한 하나의 실시예에 불과한 것으로서, 본 발명은 상기 실시예에 한정되지 않고, 이하의 특허청구범위에서 청 구하는 바와 같이 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 분야에서 통상의 지식을 가진 자라면 누 구든지 다양한 변경 실시가 가능한 범위까지 본 발명의 기술적 정신이 있다고 할 것이다."}
{"patent_id": "10-2023-0077219", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템의 전체 구성을 나타 낸 개요도이다. 도 2는 본 발명의 실시예에 따른 2차원 코드를 이용하여 가상 피팅이 가능한 쇼핑몰 시스템의 전체 구성을 나타 낸 블록도이다. 도 3은 본 발명의 실시예에 따른 3차원 사용자 캐릭터 모델링 수행부의 구성을 나타낸 블록도이다.도 4는 본 발명의 실시예에 따른 미래 시점 3차원 사용자 캐릭터 생성 과정을 설명하기 위해 나타낸 도면이다. 도 5는 본 발명의 실시예에 따른 2차원 코드 관리부와 연계된 3차원 가상피팅정보 생성부의 동작을 설명하기 위 해 나타낸 도면이다. 도 6은 본 발명의 실시예에 따른 3차원 사용자 캐릭터를 설명하기 위해 나타낸 도면이다. 도 7은 본 발명의 실시예에 따른 3차원 실제인물 캐릭터를 설명하기 위해 나타낸 도면이다. 도 8은 본 발명의 실시예에 따른 3차원 가상인물 캐릭터를 설명하기 위해 나타낸 도면이다. 도 9는 본 발명의 실시예에 따른 제품 별 실제인물 또는 가상인물의 3D 가상피팅 모델 컷 확인 후 해당 제품의 QR 코드 스캔 시 사용자 본인의 캐릭터에 적용되어 표시하는 사용자 본인에 대한 3D 가상피팅정보의 제공 방식 을 설명하기 위해 나타낸 도면이다. 도 10은 본 발명의 실시예에 따른 인바디 기반 3차원 사용자 캐릭터 수정 방식을 설명하기 위해 나타낸 도면이 다. 도 11은 본 발명의 실시예에 따른 신체 둘레 측정 장치부의 동작 원리를 설명하기 위해 나타낸 도면이다. 도 12는 본 발명의 실시예에 따른 신체 둘레 기반 3차원 사용자 캐릭터 수정 방식을 설명하기 위해 나타낸 도면 이다."}
