{"patent_id": "10-2020-0094051", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0014228", "출원번호": "10-2020-0094051", "발명의 명칭": "인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치 이를 이용한 중개 방법", "출원인": "주식회사 레뷰코퍼레이션", "발명자": "장대규"}}
{"patent_id": "10-2020-0094051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "광고주에 대한 정보를 등록 받는 광고주 정보 등록부;인플루언서에 대한 정보를 등록 받는 인플루언서 정보 등록부;상기 인플루언서가 포스팅한 컨텐츠를 플랫폼별로 크롤링(crawling)하여 인플루언서의 활동 정보를 수집하는 인플루언서 정보 수집부;상기 인플루언서의 광고 결과 정보 및 상기 인플루언서에 대한 평가 정보를 수집하는 광고 결과 정보 수집부;및상기 광고주 정보 등록부, 인플루언서 정보 등록부, 인플루언서 정보 수집부 및 광고 결과 정보 수집부에 의해수집된 정보를 기초로 상기 광고주에게 적합한 인플루언서 추천 리스트를 생성하여 상기 광고주에게 제공하는추천 리스트 생성부;를 포함하고상기 추천 리스트 생성부는,상기 광고주 정보 등록부에 의해 등록된 정보, 상기 인플루언서에 대한 분석 정보를 입력값으로 하고, 트레이닝된 인공신경망(ANN)을 이용하여 딥 러닝(Deep Learning)을 수행하여 상기 광고주에게 적합한 추천 인플루언서리스트를 생성하고, 상기 광고 활동 모니터링부에 의해 수집된 광고 활동 정보 및 평가 정보를 기초로 상기 추천 인플루언서 리스트에 대한 피드백을 수행하는 인공신경망 모듈을 포함하는, 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0094051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 인플루언서 정보 등록부, 인플루언서 정보 수집부, 광고 결과 정보 수집부에 의해 수집된 정보를 기초로상기 추천 리스트에 있는 인플루언서에 대한 종합 정보를 생성하고, 상기 종합 정보를 상기 인플루언서에 정보등록부에 등록되어 있는 모든 인플루언서와 비교하여 생성한 정보를 상기 광고주에게 제공하는 인플루언서 분석정보 생성부;를 더 포함하는 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0094051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 인플루언서 분석 정보 생성부는,상기 비교한 정보를 시간의 추이에 대한 정보와 함께 생성하거나, 플랫폼별로 분류하여 정보를 생성하는, 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0094051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서,상기 인플루언서 분석 정보 생성부는,인플루언서들의의 플랫폼별 광고 활동량, 광고 플랫폼, 상품 또는 서비스 카테고리별 광고 내역, 상품 또는 서비스별 광고 효과 및 상품 또는 서비스별 비용 대비 광고 효과 가운데 적어도 하나에 대한 정보를 생성하는 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0094051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,공개특허 10-2022-0014228-3-상기 인플루언서 정보 등록부는,상기 인플루언서의 선호 플랫폼, 포스팅 스타일, 활동지역, 촬영장치의 종류, 신체 정보, 피부 정보, 직업정보, 반려동물 소유 여부, 자주 사용하는 주요 키워드 및 관심사에 대한 정보 중 적어도 하나에 대한 정보를등록 받는, 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치."}
{"patent_id": "10-2020-0094051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 추천 리스트 생성부는,광고 대상이 되는 상품 또는 서비스에 대한 인플루언서별 또는 플랫폼별 예상 광고 효과를 산출하고, 예상 광고효과가 높은 순으로 추천 인플루언서 리스트를 생성하는, 인공지능을 이용한 광고주와 인플루언서 중개 서비스제공 장치."}
{"patent_id": "10-2020-0094051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "광고주에 대한 정보를 등록 받는 단계;인플루언서에 대한 정보를 등록 받는 단계;상기 인플루언서가 포스팅한 컨텐츠를 플랫폼별로 크롤링(crawling)하여 인플루언서의 활동 정보를 수집하는 단계;상기 인플루언서의 광고 결과 정보 및 상기 인플루언서에 대한 평가 정보를 수집하는 단계; 및상기 광고주에 대한 정보 및 상기 인플루언서 대한 정보를 기초로 상기 광고주에게 적합한 인플루언서 추천 리스트를 생성하여 제공하는 추천 리스트 생성하는 단계;를 포함하고,상기 추천 리스트 생성하는 단계는,상기 광고주에 대한 정보 및 인플루언서에 대한 정보를 입력값으로 하고, 트레이닝된 인공신경망(ANN)을 이용하여 딥 러닝(Deep Learning)을 수행하여 상기 광고주에게 적합한 추천 인플루언서 리스트를 생성하고, 상기 광고결과 정보 및 평가 정보를 기초로 상기 추천 인플루언서 리스트에 대한 피드백을 수행하는 단계를 포함하는 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 방법."}
{"patent_id": "10-2020-0094051", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른 인플루언서 중개 서비스 제공 장치는 광고주에 대한 정보를 등록 받는 광고주 정보 등록부, 인 플루언서에 대한 정보를 등록 받는 인플루언서 정보 등록부, 상기 인플루언서가 포스팅한 컨텐츠를 플랫폼별로 크롤링(crawling)하여 인플루언서의 활동 정보를 수집하는 인플루언서 정보 수집부, 상기 인플루언서의 광고 결 (뒷면에 계속)"}
{"patent_id": "10-2020-0094051", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인플루언서 중개 시스템 및 이를 이용한 중개 방법에 관한 것으로, 더욱 상세하게는 광고주에 대한 정보 및 인플루언서(Influencer)의 활동을 분석한 결과를 기초로 광고 대상 상품 또는 서비스에 적합한 인플루 언서를 광고주에게 중개함으로써 광고주에게는 광고 효과를 높일 수 있는 방안을 제공하고, 동시에 인플루언서 에게는 광고 아이템을 자동으로 제공하여 수익을 제공할 수 있는 인플루언서 중개 시스템 및 이를 이용한 중개 방법에 관한 것이다."}
{"patent_id": "10-2020-0094051", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신 기술의 발달로 개인들은 PC를 통해 인터넷 기술을 이용하여 인터넷상에서 네트워크를 형성함으로써 종래의 장소와 시간적 제약을 동시에 해결하는 역할을 하고 있다. 이와 더불어 개인이 자신의 인터넷상의 가상 공간에 서 타인과 관계를 맺을 수 있는 서비스, 즉, 커뮤니케이션을 제공하고 다양한 정보를 공유할 수 있도록 하는 서 비스가 대두되고 있는데, 이를 소셜 네트워크 서비스(Social Networking Service, SNS)라 한다. 소셜 네트워크의 서버스의 대표적인 종류로는 Youtube와 같은 동영상 플랫폼, Afreeca TV, Twitch TV, TV 다음 팟 등과 같은 인터넷 방송 플랫폼, 네이버, 구글, 다음, 야후 등과 같은 포털 사이트 플랫폼, facebook, Instagram, twitter, cacao story 등과 같은 소셜 미디어 플랫폼, 다음 블로그, 네이버 블로그, 티스토리 블로 그, 블로그 스팟 등과 같은 블로그 플랫폼 등이 존재한다. 소셜 미디어 플랫폼에서는 누구나가 특정 브랜드의 제품 또는 서비스에 대한 정보 및 리뷰를 공유 할 수 있지만, 다른 사용자들에 비해 유난히 더 영향력 있는 목소리를 내는 소비자들이 있다. 이들이 만들어내는 콘텐츠는 직접적인 브랜드 프로모션과 비슷한, 혹은 더 큰 효과를 가져오곤 한다. 이러한 소셜 미디어 콘텐츠 크리 에이터들을 \"인플루언서\"라고 한다. 즉, 인플루언서는 특정 플랫폼 내에서 영향력이 높은 사용자를 말하며, 일 예로 소셜미디어 플랫폼에서 팔로워(follower)의 수가 많은 사용자, 방문자수가 많은 블로그를 운영하는 사용자, 구독자 수가 많은 채널을 운영하는 유튜브 사용자 등이 이에 해당할 수 있다. 인플루언서들은 자신만의 컨텐츠를 생산 및 제작하여 포스팅(posting)하고 있으며, 해당 컨텐츠는 플랫폼 내 다 수의 사용자들에게 노출되고 있다. 노출 빈도의 증가와 함께 인플루언서가 이용하는 상품, 즐기는 장소, 취미, 특기 등 인플루언서와 관련된 것들에 대한 다른 사용자들의 관심도가 증가하고 있으며, 이들이 공유하는 특정 제품에 대한 의견이나 스토리는 다른 소비자들의 브랜드에 대한 인식이나 구매 결정에 많은 영향을 준다. 인플루언서들은 이러한 영향력을 이용하여 다양한 혜택을 얻을 수 있다. 예를 들어, 광고주는 인플루언서들에게 특정 상품 또는 서비스에 대한 광고를 의뢰하고, 인플루언서들은 광고 의뢰에 대한 대가로 금전적 또는 물질적 혜택을 얻을 수 있다. 즉, 인플루언서는 광고주들에게 하나의 광고 채널로 이용될 수 있다. 따라서, 인플루언서 마케팅에 관심을 갖는 브랜드와 광고주들이 계속해서 늘어나는 추세이다. 그러나, 기존 인플루언서를 통한 광고 방식의 경우 광고주들이 인플루언서를 개별적으로 접촉하여 광고를 의뢰 하여야 하므로 광고주에게 많은 시간과 비용이 소모되는 문제가 있었다. 또한, 광고주들이 광고를 의뢰하는 인 플루언서에 대한 정보를 얻기 어려우며 해당 인플루언서에 광고 의뢰 시 얻을 수 있는 광고 효과를 예상하기 어 려운 문제점이 있었다. 또한, 중개 플랫폼을 이용하여 광고주와 인플루언서들을 연결해준다 하더라도 종래 기술에 의한 경우 단순히 팔 로워(follower)의 수가 많은 사용자, 방문자수가 많은 블로그를 운영하는 사용자 등 단순히 유명세를 기준으로 광고주와 인플루언서들을 연결해 주다 보니, 광고주 입장에서는 광고주가 원하는 스타일을 인플루언서들을 연결 해주기가 어려웠었고 인플루언서들 입장에서도 수동적으로 광고를 받다 보니, 인플루언서 본인들이 하고 싶은 종류의 광고 또는 잘 할 수 있는 광고를 하지 못해 인플루언서를 통한 광고의 효과가 저해되는 문제점이 존재하 였다."}
{"patent_id": "10-2020-0094051", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치 및 이를 이용한 방법 은, 앞서 설명한 문제점을 해결하기 위해 고안된 발명으로서, 광고주에 대한 정보와 인플루언서에 대한 정보로 기초로 광고주에게 맞는 최적의 인플루언서를 중개해주는데 그 목적이 있다. 구체적으로, 광고주가 광고하고자 하는 상품 또는 서비스에 대한 정보와 인플루언서에 대한 다양한 정보와 인플 루언서들의 광고 효과 정보 및 특정 상품 또는 서비스에 대한 피드백 정보 등을 기초로 인공지능 기술을 활용하 여 광고주에게 맞는 최적의 인플루언서를 중개해주는데 그 목적이 있다."}
{"patent_id": "10-2020-0094051", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 인플루언서 중개 서비스 제공 장치는 광고주에 대한 정보를 등록 받는 광고주 정보 등록부, 인플루언서에 대한 정보를 등록 받는 인플루언서 정보 등록부, 상기 인플루언서가 포스팅한 컨텐츠를 플랫폼별 로 크롤링(crawling)하여 인플루언서의 활동 정보를 수집하는 인플루언서 정보 수집부, 상기 인플루언서의 광고 결과 정보 및 상기 인플루언서에 대한 평가 정보를 수집하는 광고 결과 정보 수집부 및 상기 광고주 정보 등록 부, 인플루언서 정보 등록부, 인플루언서 정보 수집부 및 광고 결과 정보 수집부에 의해 수집된 정보를 기초로 상기 광고주에게 적합한 인플루언서 추천 리스트를 생성하여 상기 광고주에게 제공하는 추천 리스트 생성부를 포함하고 상기 추천 리스트 생성부는 상기 광고주 정보 등록부에 의해 등록된 정보, 상기 인플루언서에 대한 분 석 정보를 입력값으로 하고, 트레이닝된 인공신경망(ANN)을 이용하여 딥 러닝(Deep Learning)을 수행하여 상기 광고주에게 적합한 추천 인플루언서 리스트를 생성하고, 상기 광고 활동 모니터링부에 의해 수집된 광고 활동 정보 및 평가 정보를 기초로 상기 추천 인플루언서 리스트에 대한 피드백을 수행하는 인공신경망 모듈을 포함할 수 있다. 상기 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치는 상기 인플루언서 정보 등록부, 인플루언 서 정보 수집부, 광고 결과 정보 수집부에 의해 수집된 정보를 기초로 상기 추천 리스트에 있는 인플루언서에 대한 종합 정보를 생성하고, 상기 종합 정보를 상기 인플루언서에 정보 등록부에 등록되어 있는 모든 인플루언서와 비교하여 생성한 정보를 상기 광고주에게 제공하는 인플루언서 분석 정보 생성부를 더 포함할 수 있다. 상기 인플루언서 분석 정보 생성부는, 상기 비교한 정보를 시간의 추이에 대한 정보와 함께 생성하거나, 플랫폼 별로 분류하여 정보를 생성할 수 있다. 상기 인플루언서 분석 정보 생성부는, 인플루언서들의의 플랫폼별 광고 활동량, 광고 플랫폼, 상품 또는 서비스 카테고리별 광고 내역, 상품 또는 서비스별 광고 효과 및 상품 또는 서비스별 비용 대비 광고 효과 가운데 적어 도 하나에 대한 정보를 생성할 수 있다. 상기 인플루언서 정보 등록부는, 상기 인플루언서의 선호 플랫폼, 포스팅 스타일, 활동지역, 촬영장치의 종류, 신체 정보, 피부 정보, 직업 정보, 반려동물 소유 여부, 자주 사용하는 주요 키워드 및 관심사에 대한 정보 중 적어도 하나에 대한 정보를 등록 받을 수 있다. 상기 추천 리스트 생성부는, 광고 대상이 되는 상품 또는 서비스에 대한 인플루언서별 또는 플랫폼별 예상 광고 효과를 산출하고, 예상 광고 효과가 높은 순으로 추천 인플루언서 리스트를 생성할 수 있다. 다른 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 서비스 방법은, 광고주에 대한 정보를 등록 받는 단계, 인플루언서에 대한 정보를 등록 받는 단계, 상기 인플루언서가 포스팅한 컨텐츠를 플랫폼별로 크롤 링(crawling)하여 인플루언서의 활동 정보를 수집하는 단계, 상기 인플루언서의 광고 결과 정보 및 상기 인플루 언서에 대한 평가 정보를 수집하는 단계 및 상기 광고주에 대한 정보 및 상기 인플루언서 대한 정보를 기초로 상기 광고주에게 적합한 인플루언서 추천 리스트를 생성하여 제공하는 추천 리스트 생성하는 단계를 포함하고, 상기 추천 리스트 생성하는 단계는, 상기 광고주에 대한 정보 및 인플루언서에 대한 정보를 입력값으로 하고, 트레이닝된 인공신경망(ANN)을 이용하여 딥 러닝(Deep Learning)을 수행하여 상기 광고주에게 적합한 추천 인플 루언서 리스트를 생성하고, 상기 광고 결과 정보 및 평가 정보를 기초로 상기 추천 인플루언서 리스트에 대한 피드백을 수행하는 단계를 포함할 수 있다."}
{"patent_id": "10-2020-0094051", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치 및 이를 이용한 서비스 방법 은 종래 기술과 다르게 광고주에 대한 정보와 인플루언서에 대한 정보로 기초로 광고주에게 맞는 최적의 인플루 언서를 찾아서 중개해줌으로써, 인플루언서를 통환 광고 효과를 극대화시킬 수 있는 장점이 존재한다. 또한, 추천 인플루언서 리스트를 생성함에 있어서, 동일한 알고리즘이 아닌 인공지능 기술을 이용하여 실제 광 고 효과에 대한 피드백 정보가 반영된 알고리즘을 업데이트 한 후, 업데이트가 된 알고리즘을 이용하여 추천 인 플루언서 리스트를 생성하므로, 보다 광고주에 맞는 인플루언서를 중개해 줄 수 있는 효과가 존재한다. 또한, 인플루언서에 대해 분석된 정보를 광고주에게 제공함에 있어서, 단순한 수치가 아닌 시간에 따라 변화되 는 정보 및 다른 인플루언서들과의 비교 정보도 같이 제공하므로, 광고주가 보다 자신이 선호하는 인플루언서를 선택할 수 있는 장점이 존재한다."}
{"patent_id": "10-2020-0094051", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 실시 예들은 첨부된 도면들을 참조하여 설명한다. 각 도면의 구성요소들에 참조 부호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면 상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시 예를 설명함에 있어, 관련된 공지 구성 또는 기능 에 대한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생 략한다. 또한, 이하에서 본 발명의 실시 예들을 설명할 것이나, 본 발명의 기술적 사상은 이에 한정되거나 제한 되지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있다. 또한, 본 명세서에서 사용한 용어는 실시 예를 설명하기 위해 사용된 것으로, 개시된 발명을 제한 및/또는 한정 하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\", \"구비하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들 이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않 는다. 또한, 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함하며, 본 명세서에 서 사용한 \"제 1\", \"제 2\" 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지 만, 상기 구성 요소들은 상기 용어들에 의해 한정되지는 않는다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략한다. 도 1은 본 일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 시스템에 관한 일부 구성 요소를 도시한 블럭도이다. 도 1을 참조하면, 일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 시스템은 광고주의 단말 장치, 인플루언서 중개 서비스 제공 장치, 인플루언서의 단말 장치 및 플랫폼 시스템 서버 등을 포함할 수 있다. 인플루언서 중개 시스템은 광고주 단말 장치와 인플루언서 중개 서비스 제공 장치 및 인플루언서 단말 장치를 통해 광고주(110, Advertiser)와 인플루언서(310, Influencer) 사이에 광고 의뢰를 중개하고, 인플루언서의 광고 활동을 모니터링할 수 있다. 광고주 단말 장치는 광고주의 제어에 따라 인플루언서 중개 서비스 제공 장치에 접속할 수 있다. 광고주 단말 장치는 인플루언서 중개 서비스 제공 장치에 접속하여 해당 시스템에 등록된 인플 루언서 및 해당 인플루언서의 정보를 검색할 수 있다. 또한, 광고주 단말 장치는 인플루언서 중개 서비스 제공 장치으로부터 광고 대상 상품 또는 서비스에 대한 인플루언서를 추천 받을 수 있다. 광고주 단말 장치는 광고주의 제어에 따라 광고를 의뢰할 인플루언 서를 선정하고, 인플루언서 중개 서비스 제공 장치에 광고를 의뢰할 수 있다. 인플루언서 중개 서비스 제 공 장치으로부터 인플루언서의 광고 활동 모니터링 결과 또는 분석 결과를 수신하는 경우, 광고주 단말 장 치는 수신된 모니터링 결과 또는 분석 결과를 화면에 디스플레이 할 수 있다. 따라서, 광고주 단말 장치는 전용 어플리케이션 또는 범용 어플리케이션을 통해 인플루언서 중개 서비스 제공 장치에 접속할 수 있는 모바일 단말 장치를 포함할 수 있는데 컴퓨팅 장치를 포함한다. 예를 들어, PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC, 스마트와치(smart watch), 스마트 글라스(smart glass), 웨어러블 기기(wearable device) 등과 같은 모든종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 인플루언서 중개 서비스 제공 서버는 각 플랫폼(예를 들어, 동영상 플랫폼, 인터넷 방송 플랫폼, 포털 사 이트 플랫폼, 소셜 미디어 플랫폼, 블로그 플랫폼 등)에서 활동하는 인플루언서의 활동 내용을 분석하고 분석 결과를 기초로 광고주와 인플루언서를 중개할 수 있다. 일 실시예에서, 인플루언서 중개 서비스 제공 장치는 해당 시스템에 등록된 인플루언서의 활동을 분 석하여 광고주와 인플루언서를 중개할 수도 있고, 해당 시스템에 등록되지 않은 인플루언서의 활동을 분석하여 광고주와 인플루언서를 중개할 수도 있다. 예를 들어, 인플루언서 중개 서비스 제공 장치은 플랫폼 시스템 서버에 등록된 인플루언서의 컨텐츠를 수집하여 해당 인플루언서의 활동 을 분석할 수 있다. 광고주와 인플루언서가 매칭된 경우, 인플루언서 중개 서비스 제공 장치는 광고 의뢰 및 광고 수행 과정을 관리할 수 도 있다. 인플루언서에 광고가 의뢰되고 인플루언서가 광고를 플랫폼 시스템 서버에 업로드를 하면, 인플루언 서 중개 서비스 제공 장치는 광고가 의뢰된 인플루언서의 광고 활동을 모니터링하고 이에 대한 결과 및 이 를 기초로 광고주에게 광고 전략을 제시할 수도 있다. 일 실시예에서, 인플루언서 중개 서비스 제공 장치 는 서버로 구현될 수 있다. 따라서, 일 실시예에 따른 인플루언서 중개 서비스 제공 장치는 서버로 구현될 수 있는데, 웹서버 이외에 클라우드 서버와 같은 가상 서버, 스마트폰, 태블릿 PC, 데스크탑 PC 등의 컴퓨팅 장치의 제어모듈에 의해 처리 되고, 각 장치의 메모리 모듈에 저장되도록 구성될 수 있다. 인플루언서 중개 서비스 제공 장치는 각종 정보를 저장할 수 있는 저장부(미도시)를 더 포함할 수 있다. 저장부에는 인플루언서 중개 서비스 제공 장치에 수신된 데이터 및 인플루언서 중개 서비스 제공 장치 의 동작 과정에서 생성된 데이터 및 결과 데이터가 저장될 수 있다. 예를 들어, 광고주 단말 장치로 부터 수신된 광고주에 대한 정보, 인플루언서 단말 장치로부터 수신된 인플루언서에 대한 정보 및 플 랫폼 시스템 서버에서 수집되는 인플루언서의 광고 활동 정보 및 이에 대한 피드백 정보는 데이터화 되어 저장부에 저장되어 관리될 수 있다. 인플루언서 단말 장치는 인플루언서의 제어에 따라 인플루언서 중개 서비스 제공 장치에 접속하고, 인플루언서의 기본 정보를 등록하거나 광고주로부터 의뢰된 광고에 대한 광고 의뢰 정보를 검색할 수 있다. 또한, 인플루언서 단말 장치는 인플루언서의 제어에 따라 컨텐츠를 생성하여 플랫폼 시스템 서버에 업로드할 수 있다. 예를 들어, 인플루언서 단말 장치는 인플루언서의 제어에 따라 동영상을 생성하거나, 블로그 게시글 또는 소셜 미디어 게시글을 생성하여 플랫폼 시스템 서버에 업로드할 수 있다. 따라서, 일 실시예에 따른, 인플루언서 단말 장치는 전용 어플리케이션 또는 범용 어플리케이션을 통해 인 플루언서 중개 서비스 제공 장치에 접속할 수 있는 컴퓨팅 장치를 포함한다. 예를 들어, 앞서 설명한 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC, 스마트와치(smart watch), 스마트 글라스(smart glass), 웨어러블 기기(wearable device) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 플랫폼 시스템 서버은 해당 플랫폼 사용자에 의해 생성된 컨텐츠를 등록하고 관리할 수 있다. 플랫폼 시스 템 서버에 등록된 컨텐츠는 다른 사용자에게 공유되거나 조회될 수 있다. 예를 들어, 인플루언서에 의해 플랫폼 시스템 서버에 등록된 광고 컨텐츠는 해당 인플루언서의 계정 연계 사용자들(예를 들어, 팔로워 (follower))에게 공유될 수 있다. 도 2는 일 실시예에 따른 인플루언서 중계 서비스 제공 장치의 일부 구성 요소를 도시한 블럭도이다. 도 2를 참조하면, 인플루언서 중개 서비스 제공 장치는 광고주 정보 등록부, 인플루언서 정보 등록부 , 인플루언서 정보 수집부, 광고 결과 정보 수집부, 추천 리스트 생성부 및 인플루언서 분 석 정보 생성부를 포함할 수 있다. 광고주 정보 등록부는 광고주로부터 광고주가 광고하고자는 하는 상품 또는 서비스에 대한 정보 및 광고주 에 대한 기본적인 인적 정보를 수집 받고 수집된 정보를 등록할 수 있다. 상품에 대한 정보는 광고하자는 상품에 대한 가격 정보, 원산지 정보, 효과 등에 대한 정보가 포함될 수 있고, 광고주에 대한 정보는 광고주에 대한 기본적인 인적 정보와 더불어, 광고주가 선호하는 인플루언서에 대한 정보, 플랫폼에 대한 정보 및 광고주가 선호하는 광고 스타일에 대한 정보를 포함할 수 있다. 이러한 정보는 추후 리스트 생성부가 광고주에게 추천 인플루언서 리스트를 제공할 때 기초 정보로 사용될 수 있다. 인플루언서 정보 등록부는 중개 서비스 제공 장치에 인플루언서 등록을 요청하는 인플루언서로부터 기본 정보를 입력 받아 해당 인플루언서를 등록할 수 있다. 다른 실시예에서, 인플루언서 등록부는 각 플랫폼에서 인플루언서를 검색하여 해당 인플루언서에 등록 요 청 메시지를 전송하고, 해당 인플루언서로부터 기본 정보를 입력 받아 등록할 수도 있다. 기본 정보는 활동 플 랫폼, 플랫폼 계정 정보, 연락처, 인플루언서 중개 시스템 접속 아이디 및 비밀번호 가운데 적어도 하나를 포함 할 수 있으며, 더 나아가 인플루언서의 선호 플랫폼, 포스팅 스타일, 활동지역, 촬영 장치의 종류, 신체 정보, 피부 정보, 직업 정보, 반려동물 소유 여부, 자주 사용하는 주요 키워드 및 관심사에 대한 정보 등을 포함할 수 있다. 또한, 인플루언서 정보 등록부에 등록되는 정보는 인플루언서가 선호하는 상품에 대한 정보 또는 선호하는 광고주에 대한 정보를 포함할 수 있으며, 선호하는 플랫폼 또는 광고 방식에 대한 정보를 포함할 수 있으며, 인 플루언서가 생각하기에는 본인에게 잘 맞는 상품 또는 서비스에 대한 정보들에 대한 정보가 포함되어 있을 수 있다. 이러한 수집된 정보는 추후 리스트 생성부가 광고주에게 추천 인플루언서 리스트를 제공할 때 기초 정보로 사용될 수 있다. 인플루언서 정보 수집부는 등록된 인플루언서가 포스팅한 컨텐츠를 플랫폼별로 크롤링(crawling)하여 각 인플루언서의 활동 정보를 수집한다. 예를 들어, 정보 수집부는 인플루언서의 소셜 미디어 계정(예를 들어 인스타그램, 페이스북) 정보, 블로그 계정 정보 또는 동영상 사이트 계정 정보 등 해당 인플루언서의 계정 정보 를 기초로 해당 인플루언서의 활동 정보를 수집할 수 있다. 구체적으로, 인플루언서 정보 수집부는 일 예로 크롤러(crawler)를 통해 컨텐츠를 수집하고, 수집된 컨텐 츠를 저장부(미도시)에 저장할 수 있다. 인플루언서 정보 수집부는 저장된 컨텐츠를 미리 설정된 분석 방 법 및 분류 방법에 따라 인플루언서의 활동 정보를 수집할 수 있다. 일 실시예에서, 활동 정보는 인플루언서의 플랫폼별 포스팅 컨텐츠 수, 플랫폼별 활동량, 컨텐츠 카테고리, 컨텐츠 내용, 컨텐츠 포맷, 활동 기간 및 인플 루언서에 대한 광고에 대한 피드백 정보(예를 들어 평점 정보 또는 댓글 정보) 가운데 적어도 하나를 포함할 수 있다. 또한, 인플루언서 정보 수집부는 일 예로 블로그 메뉴를 통해 각 메뉴에 포스팅된 컨텐츠의 카테고리를 분 류하거나, 컨텐츠에 포함된 태그(tag) 정보를 기초로 컨텐츠의 카테고리를 분류할 수 있다. 또는, 인플루언서 정보 수집부는 컨텐츠에 포함된 이미지나 동영상 또는 텍스트(예를 들어, 미리 저장되어 있는 키워드 또는 문장)를 인식하여 해당 컨텐츠의 카테고리를 분류할 수도 있다. 또한, 인플루언서 정보 수집부는 컨텐츠에 포함된 이미지, 영상 또는 텍스트를 추출하여 해당 인플루언서 가 포스팅한 컨텐츠 내용을 데이터 베이스화할 수 있고, 컨텐츠를 구성하는 구성요소(예를 들어, 이미지, 영상, 텍스트 등)의 종류 및 구성요소의 배열을 분석하여 해당 인플루언서가 자주 사용하는 컨텐츠 포맷을 분석할 수 도 있다. 광고 결과 정보 수집부는 광고주가 의뢰한 상품에 대해 인플루언서가 포스팅한 컨텐츠에 대한 정보와 더불 어 이와 관련된 다양한 정보를 수집하고, 수집된 정보를 광고주 단말 장치로 송신할 수 있다. 구체적으로, 광고 결과 정보 수집부는 광고주에 의해 선정된 인플루언서의 광고 활동 결과를 모니터링하고 동시에 인플루언서에 의해 포스팅된 광고 컨텐츠에 임베디드(embeded)된 모니터링 코드로부터 모니터링 정보를 수신하여 광고 활동 결과를 모니터링할 수 있다. 광고 활동 결과 정보에는 플랫폼별 광고 활동량, 상품 또는 서비스 카테고리별 광고 내역, 상품 또는 서비스별 광고 효과를 포함할 수 있다. 예를 들어, 광고 컨텐츠 방문수, 조회수 및 상기 인플루언서의 플랫폼을 거친 상 품 또는 서비스의 매출에 대한 정보 등을 포함할 수 있다. 일 실시예로, 광고 결과 정보 수집부는 광고주의 광고 의뢰 및 인플루언서의 광고 의뢰 승인 후 인플루언 서에 모니터링 코드를 발행하여 인플루언서 단말 장치에 제공할 수 도 있다. 또한, 광고 결과 정보 수집부는 인플루언서가 포스팅한 컨텐츠와 연계된 타 사용자의 피드백(feedback)을 수집하여 피드백의 양과 피드백의 내용(예를 들어, 피드백 경향(긍정 또는 부정) 등)등을 수집할 수 있다. 일 실시예에서, 피드백 경향은 인플루언서 중개 서비스 제공 장치의 운영자에 의해 수동으로 분류되어 입력되 거나, 경향 관련 단어의 포함 여부에 따라 자동으로 분류될 수 있다. 피드백 양과 피드백 내용은 추후에 인플루언서 분석 정보 생성부가 컨텐츠 카테고리, 컨텐츠 내용 또는 컨텐츠 포맷과 연계하여 해당 인플루언서의 컨텐츠 카테고리별 피드백 추이, 컨텐츠 내용별 피드백 추이 또는 컨텐츠 포맷별 피드백 추이에 대한 정보를 생성하는데 사용될 수 있으며, 추천 리스트 생성부가 인공지능 을 이용하여 인플루언서 추천 리스트를 생성하는데 피드백 정보로 활용할 수 있다. 이에 대한 자세한 설명은 후 술하도록 한다. 광고 결과 정보 수집부는 또 다른 실시 예로, 인플루언서가 플랫폼 시스템 서버에 포스팅한 광고 컨 텐츠의 광고 효과, 예를 들어, 광고 컨텐츠 방문수, 조회수 등에 정보를 실시간으로 수집하여 광고주 단말 장치 로 제공할 수 있다. 수집된 정보는 특별한 가공 없이 광고주 단말 장치로 제공될 수 도 있으며, 인플 루언서 분석 정보 생성부를 거쳐 다양하게 분석된 결과로 광고주 단말 장치로 제공할 수 있다. 인플 루언서 분석 정보 생성부에 대한 자세한 내용은 후술하도록 한다. 또한, 광고 결과 정보 수집부는 실제 특정 상품 또는 서비스에 대해 광고를 하였던 인플루언서와 광고주에 대한 서로의 평가 정보를 수집할 수 도 있다. 즉, 광고주는 광고주의 상품 또는 서비스에 대해 광고를 하였던 인플루언서에 대한 종합적인 평가 정보(예를 들어, 매출 만족도, 커뮤니케이션 만족도, 플랫폼별 만족도, 홍보 효과 만족도, 종합 평가 점수 등)를 수집할 수 있고, 반대로 인플루언서 또한 광고주에 대한 종합적인 평가 정 보(예를 들어, 원가에 대한 만족도, 수익에 대한 만족도, 커뮤니케이션 만족도, 종합 평가 점수 등) 등을 수집 할 수 있으며, 이러한 정보는 추천 리스트 생성부가 추후 추천 인플루언서 리스트를 생성하는데 피드백 정 보로 활용될 수 있다. 추천 리스트 생성부는 광고주 단말 장치로부터 광고 대상 상품 또는 서비스 정보가 수신되는 경우, 광고주 정보 등록부, 인플루언서 정보 등록부, 인플루언서 정보 수집부 및 광고 결과 정보 수집 부에서 수집한 정보를 기초로 광고주에게 가장 적합한 인플루언서 추천 리스트를 생성하고, 생성된 리스트 를 광고주 단말 장치로 송신할 수 있다. 구체적으로, 추천 리스트 생성부는 광고 결과 정보 수집부를 통해 수집한 동일/유사 상품 또는 서비 스에 대한 인플루언서들의 광고 효과 정보를 기초로 인플루언서 추천 리스트를 생성할 수 있다. 예를 들어, 추 천 리스트 생성부는 인플루언서의 해당 플랫폼 방문수가 높은 순, 조회수가 높은 순, 피드백(예를 들어, 댓글, 리트윗, '좋아요' 등) 수가 높은 순 등을 기초로 추천 리스트를 생성할 수 있다. 또한, 일 실시예에 따라 추천 리스트 생성부는 인공신경망 모듈을 포함하고 있다. 따라서, 인플루언 서 추천 리스트를 생성함에 있어서, 인공지능 신경망을 이용하여 딥 러닝을 수행한 후 추천 리스트를 생성하여 광고주에게 제공할 수 있다. 이하 도면을 통하여 이에 대해 자세히 알아보도록 한다. 도 3과 도 4는 일 실시예에 따른 인공신경망 모듈의 일부 구성 요소와 인공신경망 모듈에 입력되는 인풋 데이터와 아웃풋 데이터 및 피드백 정보들을 도시한 도면이다. 구체적으로, 인공신경망 모듈은 광고주에 적합한 인플루언서를 선정하는 방법에 대해 학습(training)하는 학습 세션과 학습 세션에서 학습한 결과를 기초로 광고주에 가장 적합한 인플루언서를 선정하는 방법 에 대해 추론(inference)을 하는 추론 세션을 포함할 수 있다. 따라서, 학습 세션 광고주 및 인플루언서에 대한 정보 및 인플루언서들의 과거 광고 활동 정보를 기초로 광고주에게 가장 적합한 인플루언서를 선정하는 방법에 대해 학습을 수행할 수 있다. 일 예로, 광고주와 인플루언서를 각각 복수 개의 그룹으로 분류한 후, 그룹 끼리 매칭을 한 후, 과거 광고 효과 에 대한 정보를 분석하여 실제로 광고 효과가 가장 좋았던 매칭 결과에 대해 학습을 할 수 있다. 광고주와 인플루언서를 복수 개의 그룹으로 분류하는 방법은 앞서 설명한 광고주 정보 등록부와 인플루언 서 정보 등록부에 등록되어 정보들을 기초로 다양한 기준에 따라 분류할 수 있다. 인공신경망 모듈에 사용하는 신경망 모델(Neural Network model)은 생물학에서의 뉴런 구조로부터 착안된 지도 학습(supervised learning) 알고리즘이다. 신경망 모델의 기본적인 작동 원리는 여러 개의 뉴런들을 상호 연결하여 입력값에 대한 최적의 출력값을 예측하 는 것이다. 통계적인 관점에서 보면 신경망 모델은 입력 인자의 선형 결합에 비선형 함수를 취하는 사영추적회 귀로 볼 수 있다. 도 4에 도시된 바와 같이, 인플루언서 정보와 광고주 정보를 구성하는 각 속성은 x1, x2, x3와 같은 인 공신경망 모듈의 입력층(input layer)의 각 노드에 입력되고, w1과 같은 weight을 기반으로 h1, h2, h3와 같은 은닉층(hidden layer)의 컴퓨팅 이후에 softmax나 ReLU와 같은 cost function을 기반으로 예측되는 인플 루언서 추천 리스트에 대한 정보가 y1인 출력층(output layer)에서 출력될 수 있다 추천 리스트에 대한 정 보에는 특정 상품 또는 서비스를 특정 인플루언서에게 광고를 맡겼을 때 발생될 수 있는 예측 결과(예를 들 어, 좋아요 수, 긍정 또는 부정적인 댓글의 수, 광고를 맡긴 인플루언서를 통해 창출될 수 있는 매출에 대한 정 보) 등을 포함할 수 있다. 또한, 인공 신경망 모듈은 현재 추천 리스트에 있는 인플루언서들의 광고 효과에 대한 정보를 일정 시 간이 지난 후에 광고 결과 정보 수집부를 통해 수집한 실제 정보를 기초로 피드백을 수행할 수 있다. 구체 적으로, 도 4에 도시된 바와 같이 예상 정보 실제 광고 효과 정보를 기초로 에러(error, -Sigma(yi log pi))를 줄이는 방향으로 은닉층의 weight를 업데이트 시키도록 Back propagation 할 수 있다. 예를 들어, A 그룹에 속하는 광고주와 X 그룹에 속하는 인플루언서를 매칭시켰는데, 실제 광고 결과가 예측 결 과보다 좋지 않은 경우 이러한 오차를 줄이는 방법으로 weight를 업데이트 하며, 반대로 B그룹에 속하는 광고주 와 Y그룹에 속하는 인플루언서를 매칭시켰는데, 실제 광고 결과가 예측 결과보다 더 좋은 경우 은닉층의 weight 에 대한 가중치를 증가시키는 방법으로 피드백을 수 행할 수 있다. 도 5는 본 발명의 일 실시예에 따른 인공신경망 모듈의 구체적인 구조와 관련하여, 다층 신경망 모델(딥러 닝 또는 심층 신경망 모델)의 구조를 도시한 모식도이다. 도 5에 도시된 바와 같이 본 발명의 일실시예에 따른 인공신경망 모듈의 다층 신경망 모델은 입력층(input layer), 은닉층(hidden layer), 출력층(output layer)으로 구성될 수 있다. 입력층은 각 입력인자에 대응되는 노드로 구성되며, 노드의 수는 입력인자의 개수와 같다. 은닉층은 입력층으로 부터 전달되는 인자값들의 선형 결합을 시그모이드 함수와 같은 비선형 함수로 처리하여 출력층 또는 다른 은닉 층에 전달하는 역할을 할 수 있다. 출력층은 출력 인자에 대응되는 노드로서 분류 모형에서는 클래스의 수만큼 출력 노드가 생성될 수 있다. 도 6은 본 발명의 일실시예에 따른 인공신경망 모듈의 노드에서의 계산 과정을 도시한 모식도이다. 도 6에 도시된 바와 같이, 각각의 노드에서는 실제로 연산이 일어나는데, 이 연산 과정은 인간의 신경망을 구성 하는 뉴런에서 일어나는 과정을 모사하도록 수학적으로 설계되어있다. 노드는 일정 크기 이상의 자극을 받으면 반응을 하는데, 그 반응의 크기는 바이어스(bias) 값을 제외하고 입력 값과 노드의 계수(또는 가중치, weights)를 곱한 값과 대략 비례한다. 일반적으로 노드는 여러 개의 입력을 받 으며 입력의 개수만큼 계수를 가지고 있다. 따라서 이 계수를 조절함으로써 여러 입력에 다른 가중치를 부여할 수 있다. 최종적으로 곱한 값들은 전부 더해지고 그 합은 활성 함수(activation function)의 입력으로 들어가게 된다. 활성 함수의 결과가 노드의 출력에 해당하며 이 출력값이 궁극적으로 분류나 회귀 분석에 쓰이게 된다. 신경망 모델의 각 층은 적어도 하나의 노드로 이루어져 있으며 입력값에 따라 각 노드의 활성화/비활성화 여부 가 결정된다. 입력 정보는 첫 번째 층(입력층, input layer)의 입력이 되며 그 이후엔 각 층의 출력이 다시 다 음 층의 입력이 된다. 모든 계수는 학습 과정에서 계속 조금씩 변하는데, 결과적으로 각 노드가 어떤 입력을 중 요하게 여기는지를 반영한다. 그리고 신경망 모델의 '학습(training)'은 이 계수를 업데이트하는 과정이다. 다층 신경망 모델, 즉 딥러닝에서 가장 문제되는 것은 과적합(overfitting) 문제이다. 과적합(Overfitting)은 주어진 정보의 양에 비해 모델의 복잡도(complexity)가 높으면 발생하게 된다. 안타깝게도 신경망(neural network)이 깊어질수록 모델의 복잡도는 exponential하게 증가하게 되는 문제가 존재하였다. 따라서, 이러한 문제점을 해결하기 위해 새로운 initialization 방법인 RBM(Restricted Boltzmann Machine)과 CNN(Convolutional Neural Network)이 제안되면서, 다시 딥러닝 연구가 활발하게 진행되고 있다. 특히, RBM은 DBN(Deep Belief Network)을 구성하는 요소로 이용되고, unsupervised RBM(restricted Boltzmann machine)을 통해 학습시킬 feedforward neural network의 각 층을 효과적으로 사전훈련(pre-training)하여 과 적합(overfitting)을 방지할 수 있는 수준의 initialize point를 잡았고, 이를 다시 supervised back propagation를 사용하는 형태로 학습을 진행하며, 최근에는 Random initialization의 일환으로 Drop-out 방식 이 많이 이용되고 있다. 도 7은 본 발명의 일 실시예에 따른 인공신경망 모듈의 Drop-out 방식을 도시한 모식도이다. 도 7에 도시된 바와 같이, 본 발명의 일실시예에 따른 인공신경망 모듈의 Drop-out 방식은 매 학습시 은닉 층에서 모든 neuron을 사용하는 것이 아니라 50% 정도의 neuron을 사용한다. 하나의 딥러닝에서 여러 개의 작은 neural network이 앙상블(ensemble)되어진 효과가 있고, 앙상블은 과적합이 크게 줄어든다고 알려져 있다. 또한, 비슷한 weight를 갖는 뉴런들이 줄어들게 되어서 중복된 판단을 하는 뉴런들이 줄어들게 되어 뉴런을 효 율적으로 사용 가능한 장점이 있다. 또한, 최근에는 ReLU(Rectified Linear Unit) 라는 활성함수(activation function)로 느린 학습시간과 과적합 문제 등을 해결하고 있는데 도 6은 ReLU 활성함수를 도시한 그래프이다. 도 8에 도시된 바와 같이, 기존의 sigmoid 함수는 기울기 하강(Gradient Descent)를 여러 층으로 해나갈 때마다 error가 소멸되는 문제가 발생한다. 여러 층을 지나 극한으로 갈수록 sigmoid 함수는 Gradient(기울기)가 작아 져서 weight가 업데이트되지 않는 문제가 발생하는 것이다. 그런데 활성함수로 ReLU 함수를 사용시, 기울기가 0 또는 1로 학습되는 경우에 100%로 error가 전파되어 이러한 문제가 해소될 수 있다. ReLU 함수는 sigmoid 처럼 [0,1]로 제한되는 것이 아니고 그 범위가 무제한이기 때문에 좀 더 확실한 표현력을 가진다고 볼 수 있다. 또한, 각 노드의 출력값 중 필요 없는 값들이 많다. 이럴 때, sigmoid 함수 사용시 모든 값에 대한 계산을 해야하는데, ReLU 함수는 상당 부분의 연산량을 줄일 수 있어 컴퓨팅 속도가 개선되는 효과가 발생된다. ReLU 함수에 의해 정규화(Regularization)가 향상될 수 있다. 다시 도 2로 돌아와 인플루언서 분석 정보 생성부에 대해 설명하면, 인플루언서 분석 정보 생성부 인 플루언서 정보 등록부, 인플루언서 정보 수집부, 광고 결과 정보 수집부에 의해 수집된 정보를 기초로 인플루언서에 대한 종합적인 정보를 생성하고 생성된 정보를 광고주 단말 장치로 송신할 수 있다. 구체적으로, 인플루언서 분석 정보 생성부는 인플루언서의 기본 정보와 수집된 활동 정보 및 광고 이력 정 보를 기초로 각 인플루언서의 활동을 분석하여 분석 정보를 생성할 수 있다. 예를 들어, 인플루언서 분석 정보 생성부는 인플루언서의 기본 정보와 활동 정보를 기초로 인플루언서의 신체 조건(예를 들어, 성별, 키, 몸 무게, 신체부위(자신 있는 신체부위 또는 자주 노출되는 신체부위) 등), 주요 활동 매체, 계정 연계 사용자 수 (예를 들어, 팔로워 등), 컨텐츠 방문 또는 조회 수(예를 들어, 방문수, 기간 평균 방문수, 조회 수, 기간 평균 조회수 등) 등에 대한 정보를 분석하여 생성할 수 있다. 또한, 인플루언서 분석 정보 생성부는 인플루언서의 광고 이력 정보를 기초로 인플루언서의 플랫폼별 광고 활동량, 주요 광고 플랫폼, 상품 또는 서비스 카테고리별 광고 내역, 상품 또는 서비스별 광고 효과(예를 들어, 광고 컨텐츠 방문수, 조회수, 피드백 수, 피드백 경향) 또는 상품 또는 서비스별 비용 대비 광고 효과 가운데 적어도 하나를 분석하여 분석 정보를 생성할 수 있다. 또한, 인플루언서 분석 정보 생성부는 컨텐츠 피드백 수(예를 들어, 댓글, 리트윗, '좋아요' 등) 및 피드 백 경향(예를 들어, 긍정 또는 부정) 가운데 적어도 하나를 분석하여 분석 정보를 생성할 수 있다. 일 실시예에 서, 신체 조건은 기본 정보로 미리 입력 받을 수도 있고, 인플루언서가 포스팅한 컨텐츠의 내용 분석을 통해 획 득될 수도 있다. 그리고 지금까지 설명한 인플루언서 분석 정보 생성부가 생성한 정보들은 추천 리스트 생성부로 송신 될 수 있고, 추천 리스트 생성부는 이러한 정보들을 기초로 광고주에게 가장 적합한 인플루언서 추천 리스 트를 생성할 수 있다. 또한, 추천 리스트 생성부 및 인플루언서 분석 정보 생성부를 통해 생성된 정보는 해당 인플루언서와 연계되어 저장부(미도시)에 저장될 수 있다. 광고주 단말 장치로부터 인플루언서에 대한 조회 또는 정보 요청이 수신되는 경우, 인플루언서 중개 서비스 제공 장치는 해당 인플루언서에 대한 분석 결과를 광고주 단말 장치에 제공할 수 있다. 도 9 내지 도 12는 일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 시스템에서 광고주에게 제공 되는 정보의 일 예를 도시한 도면으로서, 구체적으로 인플루언서 분석 정보 생성부가 생성한 정보가 광고주 단말 장치에 표시되는 일 예들을 도시한 도면이다. 인플루언서 분석 정보 생성부는 인플루언서 분석 정보를 생성함에 있어서, 특정 인플루언서에 대한 정보를 인플루언서에 정보 등록부에 등록되어 있는 모든 인플루언서와 비교한 정보를 시각적으로 표시한 정보를 생성하여 광고주 단말 장치로 송신할 수 있다. 예를 들어, 도 9에 도시된 바와 같이 광고주 단말 장치의 디스플레이에는 특정 인플루언서가 전체 그룹에 서 현재 어느 그룹에 속해 있는지 피라미트 형태의 도형을 이용하여 시각적으로 표시되거나, 선을 이용하 여 표시될 수 있으며, 항목 별로 절대적 수치에 대한 정보도 같이 표시될 수 있다. 도 9에 도시된 바 와 같이 현재 인플루언서가 전체 그룹 내에서 어느 위치에 있는지 비교 정보를 광고주에게 시각적으로 제시해주 면 광고주는 보다 쉽게 자신의 취향에 맞는 인플루언서를 선택할 수 있는 장점이 존재한다. 또한, 인플루언서 분석 정보 생성부는 도9와 도10에 도시된 바와 특정 인플루언서에 대한 각종 정보, 예를 들어 포스트 참여도 정보, 팔로워/팔로잉 비교 분석 정보, 구독자 정보, 조회 수 정보를 시간의 흐름에 따른 그래프로 정보를 생성하여 광고주 단말 장치로 송신할 수 있다. 단순히 절대적 수치로 정보를 제공해주는 것이 아니라 도 9와 도 10에 도시된 바와 같이 시간의 흐름에 따른 정 보를 광고주에게 제공해 주면, 광고주는 현재 특정 인플루언서의 영향력이 높아지고 있는지, 낮아지고 있는지 등에 대한 정보를 쉽게 알 수 있어 보다 자신의 기호에 맞는 인플루언서를 선택할 수 있는 장점이 존재한다. 또한, 인플루언서 분석 정보 생성부는 도12에 도시된 바와 같이 특정 인플루언서에 대한 플랫폼별 랭킹 정 보를 비교 정보로 생성하여 광고주에게 제공할 수 있다. 단순히 절대적 수치로 정보를 제공해주는 것이 아 니라 도12에 도시된 바와 같이 플랫폼 별로 랭킹 정보를 제공해주면, 광고주는 자신이 선호하는 플랫폼에 대해 어느 인플루언서가 랭킹이 높은지 쉽게 알 수 있어, 보다 자신의 기호에 맞는 인플루언서를 선택할 수 있는 장 점이 존재한다. 도 13은 일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 시스템의 동작 흐름을 도시한 순서도이 다. 도 13을 참조하면, 인플루언서는 인플루언서 단말 장치를 통해 본인의 인적 정보를 포함한 다양한 정보를 중개 서비스 제공 장치에 등록할 수 있다.(S10) 중개 서비스 제공 장치는 인플루언서에 대한 정보가 등록되면, 해당 인플루언서의 플랫폼별 활동에 대한 다양한 정보를 수집하고 그에 따른 광고 결과를 수집할 수 있다. (S20, S30) 이에 대한 자세한 설명은 도2에서 전술하였는바 생략하도록 한다. 한편, 광고주는 광고주 단말 장치를 통해 광고주의 정보를 중개 서비스 제공 장치에 등록하고 특정 상품 또는 서비스에 대해 광고를 해줄 인플루언서 추천 요청을 할 수 있다. (S40) 광고주 단말 장치로부터 인플루언서 추천 요청을 수신하면, 중개 서비스 제공 장치는 광고주에 대한 정보와 인플루언서들에 대한 정보를 기초로 딥러닝을 수행하여 예상 광고 효과를 산출하고 이에 근거하 추천 리 스트를 생성할 수 있다. (S50, S60) 이에 대한 자세한 설명은 도 3과 도 4에서 설명하였는바 생략하도록 한다. 중개 서비스 제공 장치는 생성한 추천 리스트 정보를 광고주 단말 장치로 송신하고, 광고주가 광고주 단말 장치를 통해 광고를 할 인플루언서를 선택하면, 매칭 결과를 인플루언서의 단말 장치로 송신할 수 있 다. (S70~S90) 그 후, 중개 서비스 제공 장치는 광고주로부터 의뢰 받은 상품 또는 서비스에 대한 광고를 하는 인플루언 서의 실제 광고 효과 정보를 수집하고 이를 기초로 피드백 딥러닝을 수행할 수 있다. (S100, S110) 그 후, 서비스 제공 장치는 인플루언서에 대한 종합적이고 다양한 정보를 생성한 후, 생성한 정보를 광고 주 단말 장치와 인플루언서 단말 장치로 송신할 수 있다. 지금까지 도면을 통해 본 발명의 특징에 대해 자세히 살펴 보았다. 일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 서비스 제공 장치 및 이를 이용한 서비스 방법 은 종래 기술과 다르게 광고주에 대한 정보와 인플루언서에 대한 정보로 기초로 광고주에게 맞는 최적의 인플루 언서를 찾아서 중개해줌으로써, 인플루언서를 통환 광고 효과를 극대화시킬 수 있는 장점이 존재한다. 또한, 추천 인플루언서 리스트를 생성함에 있어서, 동일한 알고리즘이 아닌 인공지능 기술을 이용하여 실제 광 고 효과에 대한 피드백 정보가 반영된 알고리즘을 업데이트 한 후, 업데이트가 된 알고리즘을 이용하여 추천 인 플루언서 리스트를 생성하므로, 보다 광고주에 맞는 인플루언서를 중개해 줄 수 있는 효과가 존재한다. 또한, 인플루언서에 대해 분석된 정보를 광고주에게 제공함에 있어서, 단순한 수치가 아닌 시간에 따라 변화되 는 정보 및 다른 인플루언서들과의 비교 정보도 같이 제공하므로, 광고주가 보다 자신이 선호하는 인플루언서를 선택할 수 있는 장점이 존재한다. 한편, 본 명세서에 기재된 \"~부\"로 기재된 구성요소들, 유닛들, 모듈들, 컴포넌트들 등은 함께 또는 개별적이지 만 상호 운용 가능한 로직 디바이스들로서 개별적으로 구현될 수 있다. 모듈들, 유닛들 등에 대한 서로 다른 특 징들의 묘사는 서로 다른 기능적 실시예들을 강조하기 위해 의도된 것이며, 이들이 개별 하드웨어 또는 소프트 웨어 컴포넌트들에 의해 실현되어야만 함을 필수적으로 의미하지 않는다. 오히려, 하나 이상의 모듈들 또는 유 닛들과 관련된 기능은 개별 하드웨어 또는 소프트웨어 컴포넌트들에 의해 수행되거나 또는 공통의 또는 개별의 하드웨어 또는 소프트웨어 컴포넌트들 내에 통합될 수 있다. 특정한 순서로 작동들이 도면에 도시되어 있지만, 이러한 작동들이 원하는 결과를 달성하기 위해 도시된 특정한 순서, 또는 순차적인 순서로 수행되거나, 또는 모든 도시된 작동이 수행되어야 할 필요가 있는 것으로 이해되지 말아야 한다. 임의의 환경에서는, 멀티태스킹 및 병렬 프로세싱이 유리할 수 있다. 더욱이, 상술한 실시예에서 다양한 구성요소들의 구분은 모든 실시예에서 이러한 구분을 필요로 하는 것으로 이해되어서는 안되며, 기술된 구성요소들이 일반적으로 단일 소프트웨어 제품으로 함께 통합되거나 다수의 소프트웨어 제품으로 패키징될 수 있다는 것이 이해되어야 한다. 단말 장치 프로그램(프로그램, 소프트웨어, 소프트웨어 어플리케이션, 스크립트 또는 코드로도 알려져 있음)은 컴파일되거나 해석된 언어나 선험적 또는 절차적 언어를 포함하는 프로그래밍 언어의 어떠한 형태로도 작성될 수 있으며, 독립형 프로그램이나 모듈, 컴포넌트, 서브루틴 또는 단말 장치 환경에서 사용하기에 적합한 다른 유닛을 포함하여 어떠한 형태로도 전개될 수 있다. 부가적으로, 본 특허문헌에서 기술하는 논리 흐름과 구조적인 블럭도는 개시된 구조적인 수단의 지원을 받는 대 응하는 기능과 단계의 지원을 받는 대응하는 행위 및/또는 특정한 방법을 기술하는 것으로, 대응하는 소프트웨 어 구조와 알고리즘과 그 등가물을 구축하는 데에도 사용 가능하다. 본 명세서에서 기술하는 프로세스와 논리 흐름은 입력 데이터 상에서 작동하고 출력을 생성함으로써 기능을 수 행하기 위하여 하나 이상이 단말 장치 프로그램을 실행하는 하나 이상이 프로그래머블 프로세서에 의하여 수행 가능하다. 본 기술한 설명은 본 발명의 최상의 모드를 제시하고 있으며, 본 발명을 설명하기 위하여, 그리고 당업자가 본 발명을 제작 및 이용할 수 있도록 하기 위한 예를 제공하고 있다. 이렇게 작성된 명세서는 그 제시된 구체적인 용어에 본 발명을 제한하는 것이 아니다. 이상에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자 또는 해당 기술 분야에 통상의 지식을 갖는 자라면, 후술될 특허청구범위에 기재된 본 발명의 사상 및 기술 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 따라서, 본 발명의 기술적 범위는 명세서의 상세한 설명에 기재된 내용으로 한정되는 것이 아니라 특허청구범위 에 의해 정해져야 할 것이다."}
{"patent_id": "10-2020-0094051", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 시스템에 관한 일부 구성 요소를 도시한 블럭도이다. 도 2는 일 실시예에 따른 인플루언서 중계 서비스 제공 장치의 일부 구성 요소를 도시한 블럭도이다. 도 3은 일 실시예에 따른 인플루언서 중계 서비스 제공 장치의 인공 신경망 모듈을 설명하기 위한 도면이다. 도 4는 일 실시예에 따른 인공 신경망 모듈의 학습 세션과 추론 세션을 설명하기 위한 도면이다. 도 5는 일 실시예에 따른 다층 신경망 모델(딥러닝 또는 심층 신경망 모델)의 구조를 도시한 도면이다. 도 6은 일 실시예에 따른 인공신경망 모듈의 노드에서의 계산 과정을 도시한 도면이다. 도 7은 일 실시예에 따른 인공신경망 모듈의 Drop-out 방식을 도시한 도면이다. 도 8 일 실시예에 따른 ReLU 활성함수를 도시한 그래프이다. 도 9 내지 도 12는 일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 시스템에서 광고주에게 제공 되는 정보의 일 예를 도시한 도면이다.도 13은 일 실시예에 따른 인공지능을 이용한 광고주와 인플루언서 중개 시스템의 동작 흐름을 도시한 순서도이 다."}
