{"patent_id": "10-2023-0030781", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0138604", "출원번호": "10-2023-0030781", "발명의 명칭": "자동차 운행정보 제공장치와, 이를 이용한 자동차 관리 시스템 및 자동차 관리방법", "출원인": "주식회사 엠닥터", "발명자": "최경호"}}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부 장치에 대해 자동차의 주행과 관련된 GPS 정보를 제공하는 자동차 운행정보 제공장치에 있어서,자동차에 내부적으로 설치되고, 근거리 통신을 위한 제1 네트워크 접속기능을 구비하는 부설장치와,운전자가 휴대하고, GPS 기능과 상기 부설장치와의 제1 네트워크 접속기능 및, 상기 외부 장치와의 제2 네트워크 접속기능을 구비하는 이동자 단말기를 포함하여 구성되고,상기 부설장치는 제1 네트워크 접속을 위하여 장치 고유의 식별정보를 송출하고,상기 이용자 단말기는 부설장치의 식별정보가 탐색되는 경우에 외부 장치에 대해 자신의 GPS 정보를 제공하는것을 특징으로 하되,상기 제1 네트워크가 블루투스인 것을 특징으로 하는 자동차 운행 정보 제공장치."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 식별정보가 MAC 주소인 것을 특징으로 하는 자동차 운행 정보 제공장치."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 부설장치는 자동차 배터리로 구동되는 것을 특징으로 하는 자동차 운행 정보 제공장치."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 부설장치가 네비게이션 또는 블랙박스인 것을 특징으로 하는 자동차 운행 정보 제공장치."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 부설장치가 자동차 시거잭와 전기적으로 결합되는 것을 특징으로 하는 자동차 운행 정보 제공장치."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 부설장치가 자동차의 USB 커넥터에 결합되어 사용되는 것을 특징으로 하는 자동차 운행 정보 제공장치."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 부설장치가 태양전지를 구비하는 것을 특징으로 하는 자동차 운행 정보 제공장치."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "자동차에 내부적으로 설치되고, 근거리 통신을 위한 네트워크 접속기능을 구비하는 부설장치와,운전자가 휴대하고, GPS 기능과 상기 부설장치와의 블루투스 네트워크 접속기능을 구비하는 이동자 단말기를 포함하여 구성되고,상기 부설장치는 네트워크 접속을 위하여 장치 고유의 식별정보를 송출하고,공개특허 10-2024-0138604-3-상기 이용자 단말기는 부설장치의 식별정보가 탐색되는 경우에 자신의 GPS 정보를 근거로 자동차의 운행 정보를생성하여 운전자에게 제공하는 것을 특징으로 하는 자동차 운행 정보 제공장치."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "네트워크를 통해 자동차에 대한 관리정보를 제공하는 자동차 관리 시스템에 있어서,관리장치와,상기 관리장치와 제1 네트워크를 통해 결합되어, 자동차의 운행과 관련된 GPS 정보를 제공하는 자동차 운행 정보 제공장치를 구비하여 구성되고,상기 운행 정보 제공장치는 자동차에 내부적으로 설치되고, 근거리 통신을 위한 제2 네트워크 접속기능을 구비하는 부설장치와,운전자가 휴대하고, GPS 기능과 상기 관리 장치와의 제1 네트워크 접속기능 및, 상기 부설장치와의 제2 네트워크 접속기능을 구비하는 이동자 단말기를 포함하여 구성되고,상기 부설장치는 제2 네트워크 접속을 위하여 장치 고유의 식별정보를 송출하고,상기 이용자 단말기는 부설장치의 식별정보가 탐색되는 경우에 상기 관리장치에 대해 자신의 GPS 정보를 제공하며,상기 관리장치는 상기 GPS 정보를 근거로 자동차의 운행 정보를 산정하고, 산정된 운행 정보에 근거해서 상기이용자 단말기에 대해 자동차 관리를 위한 관리 정보를 제공하며,상기 제2 네트워크는 블루투스 통신 네트워크인 것을 특징으로 하는 자동차 관리 시스템."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 자동차 관리 시스템은 회원사를 구비하고,상기 회원사는 자동차 정비업체를 포함하며,상기 자동차 정비업체는 자동차의 수리정보를 관리장치로 제공하고,상기 수리정보에는 차종과 연식, 주행거리 및 수리 정보 중 적어도 하나를 포함하며,상기 관리장치는 자동차의 운행 정보와 상기 수리 정보에 근거해서 이용자 단말기에 대해 자동차 관리정보를 제공하는 것을 특징으로 하는 자동차 관리 시스템."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 회원사는 보험업체 또는 중고차 중개업체를 포함하고,상기 관리 정보는 이용자의 동의하에 회원사에 제공되는 것을 특징으로 하는 자동차 관리 시스템."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 자동차 정비업체는 관리 대상의 자동차에 대해 점검을 실행하고,상기 관리장치는 상기 점검 내용에 근거해서 자동차 관리정보를 제공하는 것을 특징으로 하는 자동차 관리 시스템."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "이용자 단말기와 자동차에 설치된 부설장치 및 자동차 운행정보를 관리하는 관리장치, 및 회원사 단말기가 유무선네트워크로 연결된 자동차 관리 시스템을 통한 자동차 관리 방법에 있어서,공개특허 10-2024-0138604-4-이용자 단말기의 자동차 주행정보 기록 앱(이하 앱이라 칭함)을 관리를 원하는 차량과 무선 통신으로 연결된 상태에서 최초 등록하는 제1 단계,이후에 앱이 실행된 상태에서 차량을 인식하는 제2 단계,이후에 앱이 백그라운드상태에서 실행되는 제3 단계, 및이후에 앱을 통해 이용자 단말기의 GPS 정보를 수집하는 제4 단계,를 포함하여 이루어진 것을 특징으로 하는 자동차 관리 시스템을 통한 자동차 관리 방법."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제 1 단계에서는개인정보, 차량정보, 차량상태정보를 기입하여 저장하는 것을 특징으로 하는 자동차 관리 시스템을 통한 자동차관리 방법."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 제 1 단계에서, 사용자는 앱이 실행된 상태에서, 차량 누적 주행거리를 입력하는 것을 특징으로 하는 자동차 관리 시스템을 통한 자동차 관리 방법."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 제 2 단계에서, 앱의 작동중에, 이용자단말기와 자동차에 설치된 부설장치와의 최초 1회 블루투스 페어링이후에 차량에 접근시 자동으로 정보 인식을 하는 것을 특징으로 하는 자동차 관리 시스템을 통한 자동차 관리방법."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서, 차량의 인식은 차량의 맥 어드레스를 통해 인식 및 등록이 가능한 것을 특징으로 하는 자동차관리 시스템을 통한 자동차 관리 방법."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서, 등록된 차량 블루스트 신호가 발생한 경우에는, 차량에서 30cm이하로 접근했는지를 판단하는것을 특징으로 하는 자동차 관리 시스템을 통한 자동차 관리 방법."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서, 앱은 차량에서 10~30cm 범위를 가지고 차량 접근 여부를 판단하되 그 범위 안에 있는지 여부를 판단하는 것을 특징으로 하는 자동차 관리 시스템을 통한 자동차 관리 방법."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항에 있어서, 차량을 인식한 후에 차량의 주행 정보기록을 백라운드 상태에서 실행하는 것을 특징으로 하는자동차 관리 시스템을 통한 자동차 관리 방법."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제15항에 있어서, 앱은 이용자 단말기의 GPS 장치와 연결(연동)되어, GPS정보를 수집하게 되고, 수집된 GPS 정보를 관리 장치로 전송하여 데이터베이스에 저장하는 자동차 관리 시스템을 통한 자동차 관리 방법."}
{"patent_id": "10-2023-0030781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서, GPS정보는 이용자의 운전패턴정보(과속, 급정지 등)와 누적 주행거리가 될 수 있는 것을 특징공개특허 10-2024-0138604-5-으로 하는 자동차 관리 시스템을 통한 자동차 관리 방법."}
{"patent_id": "10-2023-0030781", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 자동차의 주행거리 정보와 같은 운행 정보를 외부적으로 제공할 수 있는 자동차 운행 정보 제공장치와, 이 운행 정보 제공장치로부터 얻어진 정보를 근거로 운전자에 대해 자동차 관리에 필요한 각종 맞춤 정보를 제공하여 자동차 운전자가 자신의 자동차를 효율적을 관리할 수 있도록 해주는 자동차 관리 시스템에 관 (뒷면에 계속)"}
{"patent_id": "10-2023-0030781", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자동차의 주행거리 정보와 같은 운행 정보를 외부적으로 제공할 수 있는 자동차 운행 정보 제공장치 및 자동차 관리시스템 및 자동차 관리방법에 관한 것이다. 또한, 본 발명은 자동차 소유자에 대하여 자동차 관리에 필요한 각종 맞춤 정보를 제공하여 자동차 운전자가 자 신의 자동차를 효율적으로 관리할 수 있도록 해주는 자동차 관리 시스템 및 자동차 관리방법에 관한 것이다."}
{"patent_id": "10-2023-0030781", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 자동차라 하면 원동기를 동력원으로 하여 도로 위를 달릴 수 있도록 구성된 차를 칭한다. 현재 자동 차로서는 승용차, 트럭, 버스, 특수차 등 매우 다양한 것이 개발되어 사용되고 있다. 자동차는 운전 못지않게 관리가 매우가 중요하다. 자동차의 효율적인 관리는 자동차의 수명 연장과 사고의 예방에 필수적이다. 그러나 자동차의 관리에는 많은 어려움이 존재한다. 자동차는 기본적으로 매우 많은 부품이 사용되고, 이들 중 상당 부 분은 소모품으로서 적절한 시기에 교환되어야 한다. 운전자가 많은 소모품에 대해 그 교환 주기와 교환 시기를 점검 및 판단한다는 것은 현실적으로 어렵다. 자동차 관리와 관련하여, 대한민국 특허공고 제10-1996-0007410호(명칭: 자동차 관리장치), 공개특허 제10- 2007-0059604호(명칭: 휴대전화기를 이용한 자동차 이력관리 방법 및 시스템), 공개특허 제10-2009-0073267호 (명칭: 인터넷을 이용한 자동차 관리 시스템), 공개특허 제10-2015-0029932호(명칭: 자동차 통합 관리 장치 및 그 방법), 공개특허 제10-2021-0101390호(명칭: 네트워크를 통한 중고 자동차 관리방법), 공개특허 제10-2021- 0101391호(명칭: 온라인-오프라인을 연계한 자동차 관리 서비스 시스템과 자동차 관리 방법), 공개특허 제10- 2023-0020050호(명칭: 운전자와 차량 상호작용 UI/UX를 이용한 자동차통합관리 시스템) 및 공개실용신안 제20- 2014-0000659호(명칭: 무선인식 휴대폰 의한 자동차관리) 등에는 네트워크를 이용하여 자동차 운전자가 자동차 를 효율적으로 관리할 수 있도록 해주는 시스템 및 방법에 대하여 소개하고 있다. 그러나 종래의 자동차 관리 시스템은 운전자의 자동차 관리에 실질적인 도움을 주기에 미흡하다는 단점이 있다. 즉, 자동차를 효율적으로 관리하기 위해서는 기본적으로 주행거리와 같은 자동차의 운행정보가 요구된다. 통상 자동차는 계기판을 통해 자동차의 운행과 관련된 정보를 운전자에게 제공한다. 그러나, 이러한 운행정보를 자동 차 관리에 적용하기 위해서는 운전자가 이를 관리 시스템에 수동으로 제공해야 하는 번거로운 작업이 요구된다. 또한, 관리 시스템에서 운전자 도움 없이 자동차의 운행 정보를 제공받기 위해서는 관리 시스템과 자동차와의 적절한 인터페이스가 요구된다. 그런데 이러한 인터페이스의 마련을 위해서는 자동차 제조회사의 적절한 도움이 요구된다. 따라서, 하나의 자동차 관리 시스템을 통하여 다양하면서도 많은 자동차에 대하여 효과적인 관리 서 비스를 제공한다는 것은 현실적으로 매우 어렵다."}
{"patent_id": "10-2023-0030781", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 사정을 감안하여 창출된 것으로서, 자동차와의 전용의 인터페이스 없이도 외부 장치나 기기에 대해 자동차 운행 정보를 제공할 수 있는 자동차 운행정보 제공장치를 제공함에 주된 기술적 목적이 있다. 또한, 본 발명은 상기한 자동차 운행정보 제공장치를 이용하여 자동차 소유주나 운전자에게 자동차의 효율적인 관리를 위한 각종 정보를 제공할 수 있도록 구성된 자동차 관리 시스템을 제공함에 다른 기술적 목적이 있다. 또한, 본 발명은 상기한 사정을 감안하여 창출된 것으로서, 자동차와의 전용의 인터페이스 없이도 외부 장치나 기기에 대해 자동차 운행 정보를 제공할 수 있는 자동차 관리 장치를 이용한 자동차 관리 방법을 제공함에 주된 기술적 목적이 있다."}
{"patent_id": "10-2023-0030781", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 실현하기 위한 본 발명의 제1 관점에 따른 자동차 운행 정보 제공장치는 외부 장치에 대해 자동차 의 주행과 관련된 GPS 정보를 제공하는 자동차 운행정보 제공장치에 있어서, 자동차에 내부적으로 설치되고, 근거리 통신을 위한 제1 네트워크 접속기능을 구비하는 부설장치와, 운전자가 휴대하고, GPS 기능과 상기 부설장 치와의 제1 네트워크 접속기능 및, 상기 외부 장치와의 제2 네트워크 접속기능을 구비하는 이동자 단말기를 포 함하여 구성되고, 상기 부설장치는 제1 네트워크 접속을 위하여 장치 고유의 식별정보를 송출하고, 상기 이용자 단말기는 부설장치의 식별정보가 탐색되는 경우에 외부 장치에 대해 자신의 GPS 정보를 제공하고 상기 제1 네트 워크가 블루투스인 것을 특징으로 한다. 또한, 상기 식별정보가 MAC 주소인 것을 특징으로 한다. 또한, 상기 부설장치는 자동차 배터리로 구동되는 것을 특징으로 한다. 또한, 상기 부설장치가 네비게이션 또는 블랙박스인 것을 특징으로 한다. 또한, 상기 부설장치가 자동차 시거잭와 전기적으로 결합되는 것을 특징으로 한다. 또한, 상기 부설장치가 자동차의 USB 커넥터에 결합되어 사용되는 것을 특징으로 한다. 또한, 상기 부설장치가 태양전지를 구비하는 것을 특징으로 한다. 본 발명의 제2 관점에 따른 자동차 운행 정보 제공장치는 자동차에 내부적으로 설치되고, 근거리 통신을 위한 네트워크 접속기능을 구비하는 부설장치와, 운전자가 휴대하고, GPS 기능과 상기 부설장치와의 블루투스 네트워 크 접속기능을 구비하는 이동자 단말기를 포함하여 구성되고, 상기 부설장치는 네트워크 접속을 위하여 장치 고 유의 식별정보를 송출하고, 상기 이용자 단말기는 부설장치의 식별정보가 탐색되는 경우에 자신의 GPS 정보를 근거로 자동차의 운행 정보를 생성하여 운전자에게 제공하는 것을 특징으로 한다. 또한, 본 발명의 제3 관점에 따른 자동차 관리 시스템은 네트워크를 통해 자동차에 대한 관리정보를 제공하는 자동차 관리 시스템에 있어서, 관리장치와, 상기 관리장치와 제1 네트워크를 통해 결합되어, 자동차의 운행과 관련된 GPS 정보를 제공하는 자동차 운행 정보 제공장치를 구비하여 구성되고, 상기 운행 정보 제공장치는 자동 차에 내부적으로 설치되고, 근거리 통신을 위한 제2 네트워크 접속기능을 구비하는 부설장치와, 운전자가 휴대 하고, GPS 기능과 상기 관리 장치와의 제1 네트워크 접속기능 및, 상기 부설장치와의 제2 네트워크 접속기능을 구비하는 이동자 단말기를 포함하여 구성되고, 상기 부설장치는 제2 네트워크 접속을 위하여 장치 고유의 식별 정보를 송출하고, 상기 이용자 단말기는 부설장치의 식별정보가 탐색되는 경우에 상기 관리장치에 대해 자신의 GPS 정보를 제공하며, 상기 관리장치는 상기 GPS 정보를 근거로 자동차의 운행 정보를 산정하고, 산정된 운행 정보에 근거해서 상기 이용자 단말기에 대해 자동차 관리를 위한 관리 정보를 제공하고 상기 제2 네트워크는 블 루투스 네트워크인 것을 특징으로 한다. 또한, 상기 자동차 관리 시스템은 회원사를 구비하고, 상기 회원사는 자동차 정비업체를 포함하며, 상기 자동차 정비업체는 자동차의 수리정보를 관리장치로 제공하고, 상기 수리정보에는 차종과 연식, 주행거리 및 수리 정보 중 적어도 하나를 포함하며, 상기 관리장치는 자동차의 운행 정보와 상기 수리 정보에 근거해서 이용자 단말기 에 대해 자동차 관리정보를 제공하는 것을 특징으로 한다. 또한, 상기 회원사는 보험업체 또는 중고차 중개업체를 포함하고, 상기 관리 정보는 이용자의 동의하에 회원사 에 제공되는 것을 특징으로 한다. 또한, 상기 자동차 정비업체는 관리 대상의 자동차에 대해 점검을 실행하고, 상기 관리장치는 상기 점검 내용에 근거해서 자동차 관리정보를 제공하는 것을 특징으로 한다. 또한, 본 발명의 제 3 관점에 따르면, 이용자 단말기와 자동차에 설치된 부설장치 및 자동차 운행정보를 관리하 는 관리장치, 및 회원사 단말기가 유무선네트워크로 연결된 자동차 관리 시스템을 통한 자동차 관리 방법에 있 어서, 이용자 단말기의 자동차 주행정보 기록 앱(이하 앱이라 칭함)을 관리를 원하는 차량과 무선 통신으로 연결된 상 태에서 최초 등록하는 제1 단계, 이후에 앱이 실행된 상태에서 차량을 인식하는 제2 단계, 이후에 앱이 백그라운드상태에서 실행되는 제3 단계, 및 이후에 앱을 통해 이용자 단말기의 GPS 정보를 수집하는 제4 단계,를 포함하여 이루어진 것을 특징으로 하는 자 동차 관리 시스템을 통한 자동차 관리 방법이 제공된다.또한, 상기 제 1 단계에서는 개인정보, 차량정보, 차량상태정보를 기입하여 저장하는 것을 특징으로 한다. 또한, 상기 제 1 단계에서, 사용자는 앱이 실행된 상태에서, 차량 누적 주행거리를 입력하는 것을 특징으로 한 다. 또한, 상기 제 2 단계에서, 앱의 작동중에, 이용자단말기와 자동차에 설치된 부설장치와의 최초 1회 블루투스 페어링이후에 차량에 접근시 자동으로 정보 인식을 하는 것을 특징으로 한다. 또한, 차량의 인식은 차량의 맥 어드레스를 통해 인식 및 등록이 가능한 것을 특징으로 한다. 또한, 등록된 차량 블루스트 신호가 발생한 경우에는, 차량에서 30cm이하로 접근했는지를 판단하는 것을 특징으 로 한다. 또한, 앱은 차량에서 10~30cm 범위를 가지고 차량 접근 여부를 판단하되 그 범위 안에 있는지 여부를 판단하는 것을 특징으로 한다. 또한, 차량을 인식한 후에 차량의 주행 정보기록을 백라운드 상태에서 실행하는 것을 특징으로 한다. 또한, 앱은 이용자 단말기의 GPS 장치와 연결(연동)되어, GPS정보를 수집하게 되고, 수집된 GPS 정보를 관리 장 치로 전송하여 데이터베이스에 저장하는 것을 특징으로 한다. 또한, GPS정보는 이용자의 운전패턴정보(과속, 급정지 등)와 누적 주행거리가 될 수 있는 것을 특징으로 한다."}
{"patent_id": "10-2023-0030781", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 구성으로 된 본 발명에 의하면, 자동차의 이동에 대응하는 GPS 정보를 제공하는 자동차 운행 정보 제공 장치가 제공된다. 이 자동차 운행 정보 제공장치는 자동차 내부에 설치되는 부설장치와, 스마트폰 등의 이용자 단말기를 포함한다. 이용자 단말기는 부설장치와의 네트워크 접속기능을 이용하여 운전자가 자동차를 운행하는 것을 판별하고, 자동차가 운행 중인 경우에는 자신의 GPS 정보를 자동차 운행 정보로서 외부 장치에 대해 제공 하게 된다. 따라서, 본 발명에 있어서는 자동차와의 직접적인 인터페이스 없이 자동차에 대한 정확한 운행 정보 를 획득할 수 있게 된다. 또한 본 발명에 따른 자동차 관리 시스템은 상기 자동차 운행 정보 제공장치로부터 제공되는 자동차 운행 정보 를 근거로 자동차 관리에 필요한 각종 정보를 생성하여 운전자에게 제공하게 된다. 또한, 관리 시스템은 상기 자동차 운행 정보와 더불어, 자동차의 차종이나 연식, 해당 차종과 관련된 수리 정보 등을 근거로 자동차에 요 구되는 관리 내용을 예측하여 이를 운전자에 제공할 수 있게 된다. 또한 본 발명에 따른 자동차 관리 방법은 상기 자동차 운행 정보 제공장치로부터 제공되는 자동차 운행 정보를 근거로 자동차 관리에 필요한 각종 정보를 생성하여 운전자에게 제공하게 된다. 또한, 관리 시스템은 상기 자동 차 운행 정보와 더불어, 자동차의 차종이나 연식, 해당 차종과 관련된 수리 정보 등을 근거로 자동차에 요구되 는 관리 내용을 예측하여 이를 운전자에 제공할 수 있게 된다."}
{"patent_id": "10-2023-0030781", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명에 따른 실시 예를 설명한다. 다만, 이하에서 설명하는 실시 예는 본 발명의 하 나의 바람직한 구현 예를 예시적으로 나타낸 것으로서, 이러한 실시 예의 예시는 본 발명의 권리범위를 제한하 기 위한 것이 아니다. 본 발명은 그 기술적 사상을 벗어나지 않는 범위 내에서 다양하게 변형시켜 실시할 수 있 다. 우선, 본 발명의 기본 개념을 설명한다. 일반적으로 자동차에는 운전자의 편의성을 위해 다양한 장치가 구비된다. 이들 장치는 자동차 제조회사에서 자 동차에 고정적으로 설치하거나, 운전자가 필요에 따라 자동차에 임의적으로 설치하게 된다. 이러한 장치로서는 네비게이션, 블랙박스, 공기청청기 등 다양하다. 이들 장치들은 통상 자동차에 내부적으로 설치 및 부착되어 사 용된다. 이하에서는 네비게이션, 블랙박스, 공기청청기 등과 같이 자동차에 내부적으로 부착되어 자동차 전용으 로 사용되는 장치를 부설장치라 칭하기로 한다. 일반적으로 부설장치는 예컨대 블루투스(Bluetooth) 등의 네트 워크 접속기능을 구비하여, 네트워크를 통해 통신 및 제어가 가능하도록 구성된다. 본 발명에서 부설장치라 하 면, 자동차에 내부적으로 구비되거나 설치되고, 근거리 통신을 위한 네트워크 접속기능이나 그에 상응하는 기능 을 구비한 장치로서 정의될 것이다. 한편, 현재 거의 대부분의 사람들은 스마트폰을 휴대 및 사용하고 있다. 2022년도를 기준으로 대한민국의 스마 트폰 보급률은 97%에 이르고 있다. 현재 사용되고 있는 스마트폰은 기본적으로 와이파이(WiFi)와 블루투스 등의 네트워크 접속기능과 GPS(Global Positioning System) 기능을 구비하고 있다. 운전자가 스마트폰을 휴대한 상태 에서 운전을 하고 있다면, 우리는 운전자가 휴대한 스마트폰의 GPS 정보를 근거로 운전자의 이동거리와 이동속 도 등의 정보를 획득할 수 있다. 그리고 이때 얻어진 운전자에 대한 이동정보는 차동차의 운행정보와 실질적으 로 동일할 것이다. 우리가 스마트폰과 부설장치와의 네트워크 접속기능을 이용하여 스마트폰 소유자가 자동차를 운전하고 있다는 사실을 확인할 수 있다면, 우리는 그 자동차에 대한 훌륭한 인터페이스 기능을 갖게 될 것이다. 본 발명의 일 실시 예에 따른 자동차 운행정보 제공장치는 상기한 부설장치와 이용자 단말기를 포함하여 구성된 다. 여기서 이용자 단말기로서는 스마트폰과 더불어, 예컨대 노트북, 태블릿 컴퓨터(Tablet computer), 개인 정 보 단말기(PDA: Personal Digital Assistant) 등 무선 인터넷과 블루투스 등의 통신기능과 더불어 GPS 기능을 구비한 디지탈 단말기가 바람직하게 채용될 수 있다. 한편, 이용자 단말기에는 예컨대 어플이라 칭하는 어플리케이션 프로그램(Application Program)이 설치된다. 단 말기, 즉 어플리케이션 프로그램은 부설장치 탐색기능, 부설장치에 대한 네트워크 페어링 및 해제 기능, 외부 장치나 기기와의 연동기능 및 외부장치나 기기에 대한 GPS 정보 제공기능을 구비하고, 이들 기능의 적절한 수행 을 위한 사용자 인터페이스(UI: User Interface)를 제공한다. 사용자 인터페이스는 바람직하게 터치패널을 통해 선택 가능한 메뉴화면을 포함한다. 부설장치는 통상 자동자의 배터리 전원에 의해 동작되므로, 자동차의 시동이 오프상태인 경우에는 비동작상태로 설정되고, 자동차의 시동이 온상태가 되면 동작상태로 전환된다. 그리고 부설장치는 동작상태가 되면, 네트워크 페어링, 즉 블루투스 페어링을 위해 주변 기기에 대해 자신의 MAC 주소(MACA: Media Access Control Address) 를 제공하게 된다. 이러한 MAC 주소의 제공은 일정한 주기를 갖고 반복적으로 실행된다. 따라서 부설장치에서제공하게 되는 MAC 주소는 자동차가 현재 운행 중인지의 여부를 판정하기 위한 근거로서 사용될 수 있다. 한편, 이용자 단말기에는 관리 대상의 자동차를 등록하기 위한 등록 메뉴가 구비된다. 이용자 단말기는 이용자 가 자동차 등록 메뉴를 선택하게 되면, 디스플레이를 통해 현재 네트워크 페어링이 가능한 기기들의 MAC 주소를 표시하게 된다. 이때 부설장치가 동작상태에 있다면, 이용자 단말기를 통해 표시되는 MAC 주소에는 부설장치의 MAC 주소가 포함되어 있을 것이다. 이용자가 부설장치의 MAC 주소를 선택하면, 단말기는 부설장치와 네트워크 페어링을 실행하게 된다. 단말기의 어플리케이션 프로그램은 이때 이용자가 선택한 MAC 주소를 자동차의 고유 정보로서 인식 및 저장하게 된다. 이후 어플리케이션 프로그램은 이용자가 등록한 MAC 주소의 탐색 결과를 근거로 등록된 자동차가 운행 중인지의 여부를 판정하게 된다. 그리고, 부설장치의 MAC 주소가 탐색되면, 이후 일정한 시간 주기로 이용자 단말기의 GPS 정보를 외부장치나 기기에 대해 제공하게 된다. 이와 같은 GPS 정보의 제공은 자동차의 시동이 오프되거나, 이용자가 자동차로부터 일정 거리 이상 떨어져셔 부설장치의 MAC 주소가 탐색되지 않을 때까지 실행된다. 상기한 운행 정보 제공장치는 자동차 내부에 설치되는 부설장치와의 네트워크 페어링 기능을 이용하여 등록된 자동차가 현재 운행되고 있는지를 판정하게 된다. 그리고, 자동차가 운행 중인 것으로 판정되면, 이용자 단말기 의 GPS 정보를 자동차의 GPS 정보로서 외부장치나 기기에 대해 제공하게 된다. 따라서, 상기 실시 예의 운행정 보 제공장치는 자동차와 직접적인 인터페이스 기능을 구비하지 않고서도, 실질적으로 자동차의 운행정보에 상응 하는 정보를 외부장치나 기기에 제공할 수 있게 된다. 한편, 도 1은 운행정보 제공장치에 채용 가능한 부설장치의 다른 구성 예를 나타낸 것이다. 본 실시 예의 부 설장치는 이용자가 운행정보를 제공하고자 하는 자동차에 네비게이션, 블랙박스, 공기청청기 등의 부설장치 가 구비되어 있지 않는 경우를 고려한 것이다. 도면에서 부설장치는 본체(1a)와, 자동차 배터리로부터 부설 장치로 동작 전원을 입력하기 위한 전원 입력단자(1b)를 구비한다. 바람직하게 전원 입력단자(1b)는 통상 시 거잭이라 칭하는 자동차에 구비된 전원 공급용 단자에 결합될 수 있는 형태 및 구성으로 이루어진다. 또한, 본 발명의 다른 바람직한 실시 예에서 부설장치를 위한 전원 입력단자는 자동차에 구비되는 USB(Universal Serial Bus) 단자에 결합 가능한 USB 커넥터나 USB 케이블로 구성될 수 있다. 또한, 도면에 구체적으로 나타내지 않았으나 상기 본체(1a)에는 외부 기기와 예컨대 블루투스 방식을 통해 통신 을 실행하기 위한 통신모듈과, 이 통신모듈의 동작을 제어하여 외부 기기에 대해 블루투스 페어링 및 해제 프로 세스 기능을 실행하는 제어부가 구비된다. 부설장치는 바람직하게 자동차의 시거잭 등에 고정적으로 설치된 다. 부설장치는 네비게이션, 블랙박스, 공기청청기 등의 장치를 대신하여 이용자 단말기에 대해 네트워크 페 어링 기능을 제공하게 된다. 즉, 부설장치는 자동차의 시동이 온되어 전원 입력단자(1b)를 통해 동작전원이 입력되면, 적절한 통신 프로토콜에 따라 MAC 주소 또는 MAC 주소에 상응하는 장치의 고유 정보를 송출하게 된다. 그리고 이러한 고유 정보의 송출은 전원 입력이 종료될 때까지 실행하게 된다. 따라서, 본 실시 예에 있어서는 자동차에 별도의 부설장치가 구비되어 있지 않은 경우에도, 운전자가 자동차의 시거잭 등에 부설장치를 설치하는 것만으로 외부장치나 기기에 대해 자동차의 운행정보에 상응하는 정보를 제공할 수 있게 된다. 도 2는 상기한 부설장치를 이용한 자동차 관리 시스템의 전체적인 구성을 나타낸 시스템 구성도이다. 도면에서 관리 시스템은 시스템 전체를 제어 및 관리하는 관리장치를 구비하고, 관리장치에는 유무선 인터넷 등 의 네트워크를 통해 이용자 단말기(30: 30-1, 30-2, …, 30-n)와, 회원사(50: 50-1, 50-2, …, 50-n)가 결 합된다. 여기서 회원사라 하면 회원사가 소유하고 있는 서버나 통신 단말기를 지칭하는 용어로서 이해될 것 이다. 그리고 이용자 단말기에는 블루투스 등의 근거로 네트워크를 통해서 부설장치(40: 40-1, 40-2, …, 40-n)가 결합된다. 본 발명에서 이용자 단말기와 부설장치와의 통신 방식은 특정되지 않는다. 이용자 단말기와 부설장치는 일정 이하의 통신거리를 가지는 예컨대 지그비(ZigBee)나. 무선랜(WLAN) 등의 근 거리 통신 네트워크를 통해 결합될 수 있다. 이하에서는 이용자 단말기와 부설장치가 블루투스를 이용 하여 통신을 실행하는 경우를 예로 들어 설명한다. 도 3은 상기 관리장치의 구성을 나타낸 블록구성도이다. 관리장치는 관리서버와 데이터베이스 및 운영자 단말기를 구비한다. 이들은 LAN을 통해 결합된다. 또한 도면에 구체적으로 나타내지 않았으 나 관리장치에는 허브 및/또는 라우터가 구비되거나, 이들 장치와 결합된다. 관리서버에는 전체 시스템을 관리 및 제어하기 위한 관리 프로그램이 구비된다. 관리 프로그램은 이용자 단 말기와 연동하여 이용자에 대한 회원 등록 및 자동차 등록 기능과, 자동차 운행정보의 수집 및 분석 기능및, 이용자 단말기에 대한 자동차 관리 정보의 제공기능을 실행한다. 또한, 관리 프로그램은 운영자를 위한 사 용자 인터페이스(UI: User Interface) 제공기능과, 회원사와의 연동 기능 등을 수행한다. 관리서버에 의한 관리 및 제어 동작에 대해서는 이후 보다 구체적으로 설명될 것이다. 데이터베이스는 관리서버의 관리 및 제어동작에 수반되는 각종 데이터를 저장한다. 데이터베이스에 저장되는 정보에는 회원 및 자동차 정보, 자동차 운행정보, 등록된 자동차에 대한 관리정보, 회원의 회원사 이용정보 등이 포함된다. 운영자 단말기는 운영자를 위한 것이다. 운영자는 단말기를 이용하여 관리장치를 전체적으로 관리 한다. 운영자에 의한 시스템 관리는 일반적인 사항이므로 구체적인 설명은 생략한다. 도 2로 돌아가서, 이용자 단말기 및 부설장치는 자동차 운행정보를 수집 및 관리하기 위한 것이다. 이 들의 구성 및 동작에 대해서는 상술한 바 있으므로, 보다 구체적인 설명은 생략한다. 회원사는 예컨대 자동차 정비업체, 주유소, 보험회사, 자동차 용품 판매업체, 렌터카 업체, 중고차 중개업 체 등 자동차의 운행 및 관리와 관련된 일체의 업체를 포함한다. 또한, 회원사에는 본 시스템에서 자동차의 차적정보 등을 조회하기 위한 예컨대 국토교통부의 자동차종합정보 서비스 시스템이나, 이들 차적정보의 제공을 대행하는 대행업체가 포함될 수 있다. 상기한 바와 같이 회원사에는 본 시스템과의 통신 결합을 위한 서버 또는 단말장치가 구비된다. 그리고 이들 서버 및 단말장치에는 바람직하게 본 시스템과의 연동을 위한 클라이언 트 프로그램이나 API(Application Programming Interface)가 구비될 것이다. 이어, 상기 시스템의 동작을 설명한다. 자동차 운전자나 소유자가 본 시스템을 이용하는 경우에는 우선 자신의 이용자 단말기에 대해 본 시스템의 이용을 위한 어플리케이션 프로그램을 설치하게 된다. 이때 어플리케이션 프 로그램은 관리장치에 의해 설치되거나, 이용자가 예컨대 구글 플레이 등을 통해 다운로드하여 설치하게 된 다. 어플리케이션 프로그램은 이용자에 대해 본 서비스의 이용을 위한 각종 인터페이스 화면을 제공한다. 인터 페이스 화면에는 기본적으로 회원 등록과 자동차 등록을 위한 등록 메뉴와 , 운행정보 조회, 관리정보 조회 등 자동차 관리와 관련된 각종 정보 등을 조회하기 위한 메뉴가 포함된다. 또한 바람직하게 인터페이스 화면에는 이용자가 회원사를 조회하거나 이용하기 위한 선택 메뉴가 포함된다. 본 시스템에 대한 자동차 등록은 이용자가 단말기를 휴대한 상태에서 자동차에 탑승하고, 자동차의 시동을 온시킨 상태에서 실행하게 된다. 이용자가 단말기를 이용하여 관리장치에 로그인한 후, 자동차 등록메 뉴를 선택하게 되면, 관리서버는 자동차 번호와 소유자 정보, 즉 소유자 이름 및 전화번호의 입력을 요구하 게 된다. 바람직한 실시 예에서, 관리서버는 이용자가 자동차 번호와 소유자 정보를 입력하게 되면, 회원사 를 통해 차적 정보를 조회하여 자동차 번호와 소유자 이름이 정상적인 것인지의 여부를 확인하게 된다. 또 한, 본 발명의 다른 구현 예에서 관리서버는 자동차 등록 시에 이용자에 대해 자동차 번호판에 대한 촬상정 보의 업로드를 요구할 수 있다. 본 서비스를 이용함에 있어서 이용자와 자동차의 소유자는 일치되지 않을 수 있 다. 이 경우, 관리장치는 바람직하게 자동차 소유자의 동의를 요구하는 절차를 수행할 수 있다. 자동차 정보와 소유자 정보의 입력이 완료되면, 관리서버는 이용자 단말기를 제어하여 현재 블루투스 페어링이 가능한 주변 기기를 탐색하고, 그때 탐색된 주변 기기의 식별정보, 즉 MAC 주소를 표시하도록 하게 된 다. 이용자가 단말기의 표시 정보로부터 부설장치의 MAC 주소를 선택하게 되면, 이용자 단말기는 이용자가 선택한 MAC 주소를 자동차의 고유정보로서 등록하게 된다. 그리고 이후에는 이 MAC 주소의 탐색 결과 를 근거로 자동차가 운행 중인지의 여부를 판단하게 된다, 관리서버는 이용자가 MAC 주소를 선택하면, 현재까지의 자동차의 총 주행거리 정보를 요구하게 된다. 그리 고 이용자가 자동차 주행거리 입력을 완료하면, 관리서버는 해당 자동차를 관리대상 자동차로서 데이터베이 스에 등록하게 된다. 이때 등록되는 자동차 정보에는 소유자명, 소유자 연락처 정보 및 자동차 정보가 포함 된다. 그리고 자동차 정보에는 이용자가 입력한 자동차 번호와, MAC 주소 및 자동차 주행거리 정보와 더불어, 회원사의 차적 초회를 통해 얻어진 자동차의 연식, 차종 등 자동차 관리에 필요한 일체의 정보가 포함된다. 관리서버는 자동차에 대한 등록처리가 완료되면 이용자 단말기와 연동하여 자동차에 대한 관리 기능을 제공하게 된다. 우선, 이용자 단말기는 이용자에 의해 등록된 MAC 주소가 탐색되면, 관리서버에 대해 자동차의 운행이 개시되었음을 통보하고, 이후 일정한 시간 주기로 이용자 단말기의 GPS 정보를 관리서버 에 대해 제공하게 된다. 이러한 동작은 부설장치에 의한 MAC 주소의 송출이 종료되어, 자동차의 운행이 종료된 것으로 판단될 때까지 실행된다. 관리서버는 이용자 단말기로부터 GPS 정보가 제공되면, 이를 근거로 자동차의 주행거리를 산출하고, 그 산출된 주행거리 정보를 근거로 데이터베이스를 업데이트하게 된다. 또한, 본 발명의 바람직한 구현 예에서 관리서버는 이용자 단말기로부터 제공되는 GPS 정보를 근거 로 자동차의 주행 속도를 산출하고, 그 산출 정보를 운전자의 운전습관 등을 판단하는 데이터로서 활용하게 된 다. 관리서버는 이용자 단말기로부터 얻어진 자동차 운행정보를 근거로 이용자에 대해 자동차 관리정보를 제공하게 된다. 이때 운전자에게 제공되는 관리정보에는 자동차의 주행거리와 관련된 기본 관리 정보가 포함된 다. 이 기본 정보에는 예컨대 엔진오일을 포함하는 각종 오일류의 교환, 타이밍 벨트 등을 포함하는 각종 벨트 류의 교환, 타이어 교환과 관련된 안내정보가 포함된다. 또한, 관리서버가 운전자에게 제공하는 정보에는 자동차의 고장과 관련된 예측 정보가 포함될 수 있다. 예 를 들어, 관리서버는 자동차의 주행속도를 근거로 자동차 브레이크 패드나 타이어의 교환 시기를 보다 정밀 하게 예측하여 이를 운전자에게 안내할 수 있다. 또한, 관리서버는 GPS 정보에 대응한 도로 정보를 구비하 여 자동차의 주행 환경을 판단하고, 이를 근거로 자동차에 대한 관리정보를 제공할 수 있다. 또한, 관리서버 는 협력사로 등록되어 있는 정비업체의 고장수리 정보 등을 근거로 자동차의 차종과 연식 및 주행거리 에 따른 고장 발생 패턴을 분석하고, 이를 근거로 운전자에 대해 자동차의 점검 등을 안내할 수 있다. 또한, 본 발명의 바람직한 구현 예에서는 이용자가 자동차를 등록하게 되면, 이용자로 하여금 지정된 정비 업체를 통해 자동차의 타이어, 브레이크 패드, 오일류, 벨트류 등 관리가 요구되는 부분에 대해 점검을 실행하도록 함으로써 자동차에 대해 보다 정밀한 관리정보를 제공할 수 있다. 또한, 관리서버는 상기한 절차를 통해 얻어진 자동차 관리정보를 이용자의 동의하에 자동차 보험회사나 중 고차 중개업체에 제공함으로써 보험료의 산정이나 중고차 가격 산정에 활용되도록 할 수 있다. 이상으로 본 발명에 따른 실시 예를 설명하였다. 그러나 본 발명은 상술한 실시 에에 한정되지 않고, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양하게 변형시켜 실시할 수 있다. 예를 들어, 본 발명에 있어서는 기본적으로 부설장치와 이용자 단말기의 네트워크 접속기능을 이용하여 자동차 에 대한 이용자 승차 여부를 확인하고, 자동차의 운행 정보는 이용자 단말기의 GPS 기능을 이용하여 획득하게 된다. 따라서, 부설장치로서는 자동차 배터리 이외에 내부 배터리나 예컨대 태양전지 등의 다른 전력원을 이용 하여 구동되도록 구성된 것도 바람직하게 채용할 수 있다. 또한, 상술한 실시 예에서 이용자 단말기는 단순히 자신의 GPS 정보를 외부 장치에 대해 제공하는 것으로 설명 하였으나, 이용자 단말기가 자신의 GPS 정보를 근거로 자동차의 주행거리나 속도를 산출하여, 그 산출결과를 외 부 장치에 대해 제공하도록 구성될 수 있다. 또한, 상기 실시 예에 있어서는 이용자 단말기가 관리장치와 연동하여 운전자에게 자동차 관리정보를 제공하도록 구성되어 있으나, 이는 이용자 단말기가 자동차 관리 프로그램을 구비하여, 자체적으로 운전자 에 대해 차계부 등이 관리기능을 제공하도록 구현될 수 있다. 도 4는 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 주행정보 기록과정을 개념적으로 설명한 모식 도이다. 도 4를 참조하면, 본 발명에 따른 자동차 관리 시스템을 통한 지파에스 주행정보 기록과정은, 최초등록과정과 등록 이후 주행 정보 기록과정을 분류할 수 있다. 최초 등록과정은 아래와 같다. 본 발명에 따른 전용 앱(일명 엠닥터 앱이라 함)을 이용자 단말기에 다운로드 받아 설치하고, 최초 앱 설정 을 하는 과정이다. 이때 차량 블루투스는 온상태이다. 이용자는 이용자 단말기를 실행시킨 후에, 차량 누적 주행거리를 입력하고, 해당 차량과 블루투스 페어링을 진행하고(최초 1회 정보 인식 및 등록과정), 이후 운영자 관리장치에 유무선 네트워크로 접속한 상태에서 페어링된 차량에 관한 차량 눅적 주행거리 및 차량 정보(데 이터)를 저장한다. 한편, 최초 등록이후 주행 정보 기록과정은 아래와 같다. 차량 블루투스가 오프(OFF)상태인 경우에는, 엠닥터 앱 상태는 차량과 블루투스 연결이 안된 상태이지만, 이용 자가 앱을 실행시키게 되면, 앱은 백그라운드에서 실행되고(앱 실행중), 일정 시간 간격(30초 또는 1분, 이에 제한되지 않음, 운영자 및 이용자가 설정가능함)으로 등록된 차량 블루투스 신호를 확인하게 된다. 만약 등록된 차량 블루투스 신호가 인식되지 않으면, GPS 정보를 활용한 누적 주행 기능을 중지하게 된다. 차량 블루투스가 온 상태인 경우에는, 이용자 앱을 실행 시킨 경우, 이때 이용자 단말기는 GPS 정보를 관리 장치(운영자 단말기, 관리서버, 및 데이터베이스를 포함하는 관리장치를 지칭함)로 전송하게 된다. 구체적으로, 앱은 백그라운드에서 실행되고(앱 실행중), 일정 시간 간격(30초 또는 1분, 이에 제한되지 않음, 운영자 및 이용자가 설정가능함)으로 등록된 차량 블루투스 신호를 확인하게 된다. 만약 등록된 차량 블 루투스 신호가 인식되면, 블루투스 신호 발생과 동시에 이용자 단말기 GPS 연동/GPS 정보는 앱을 통해 서 버에 자동으로 ㅈ저장되게 된다. 도 5는 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반서비스를 활용한 차량 미래 정비 예측 서 비스 흐름도를 나타낸 도면이다. 도 5를 참조하면, 회원가입단계(①)로서, 앱(일명 엠닥터 앱이라 칭함, 본 발명에서 엠닥터 앱은 블루투스 연결 이후 차량 주행 기록을 수집하는 전용 앱이다) 본인인증 후 회원가입을 진행한다. 이때 차량번호, 소유자명으로 차량 등록을 수행할 수 있다. 이후, 자동 차계부 설정단계(②)로서, 해당 차량 현재 누적 주행거리를 입력하는 과정이다. 이후, 차량 블루투스 페어링단계(③)로서, 최초 1회 차량 앱 실행 후 블루투스 페어링을 실행하고, 차량 고유 블루투스 맥(MAC) 어드레스(ADDRESS) 인식 및 저장하게 된다. 또는 표준 규격 블루투스를 인지할 수 있다(블루 투스 규격이 맞지 않는 경우에는 별도 규정된 설정 매뉴얼에 따라 페어링 할 수 있다). 이후, 블루투스 등록단계(④)로서, 이용자 단말기과 유무선 네트워크로 연결되는 관리장치에서 수행되 며, 회원 정보와 매칭해서 차량 고유 맥 어드레스를 관리장치에 저장하게 된다. 이후, 등록 차량 운행단계(⑤)로서, 차량 블루투스가 온(ON)된 상태에서, 앱에서 등록차량 블루투스 신호를 인 식한 상태이고, 등록 차량이 운행되는 상태이다. 이후, 이용자 단말기의 GPS와 연결하는 단계(⑥)로서, 앱은 백그라운드에서 자동으로 실행되며, 이용자 단 말기의 GPS 실행 및 주행(이동) 정보가 관리장치에 저장되며, 물론 이용자 단말기의 메모리(저장장 치)에도 저장될 수 있다. 이후, 주행 정보 저장 단계(⑦)로서, 관리 장치에서는 등록 차량 GPS 정보(주행 거리)를 저장하게 되며, 최 초 등록했던 누적 주행 거리 데이터와 누적 합산하게 된다. 이후, 부품 교환 주기 알림 단계(⑧)로서, 앱 실행중에, 주행 거리 및 이동 경로 데이터를 기반으로 분석하고 자동차 부품 교환주기 알림 서비스를 제공하게 되는데, 앱을 통한 차량 정비를 실행시킬 수 있는 것이다. 도 6은 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 미래 정비 예측 서비스의 일예를 나타낸 흐름도이다. 도 6을 참조하여 미래 정비 예측 서비스의 일예를 설명한다. 서비스 도입부(모듈)는 회원가입과 AI(인공지능) 자동 차계부 설정 및 블루투스 페어링 및 정보 등록(최초 1 회)과정을 수행할 수 있다. 구체적으로, 세분하면, 간편 본인인증과정, 차량 등록 과정, AI 자동 차계부 설정과 정, 차량 블루투스 페어링/등록 과정을 순차적으로 혹은 개별적으로 수행할 수 있다. 간편 본인인증 과정에서는, 카카오, 네이버, 구글 로그인 과정을 이용하여 간편 본인 인증을 수행할 수 있을 것 이다(이에 제한되지 않음, 일회용 OTP 번호제공, 큐알코드 인증 및 기타 인증 또는 기타 SNS를 통한 인증서비스 제공도 물론 가능할 것이다). 이후 차량등록 과정에서는 차량번호, 소유주명 입력, 국토부, 마이데이터를 통해 차량 제원 데이터 저장 및 출 력이 가능할 것이다. 이후 AI 자동 차계부 설정과정에서는, 차량 누적 주행 거리 입력과정이 수행된다. 이후, 차량 블루투스 페어링/등록 과정에서는, 최초 1회 앱 연동 및 블루투스 페어링 과정이 수행되며, 고유 맥 어드레스가 저장되게 된다. 한편 서비스 실행부(모듈)에서는 서비스 도입부(모듈)에서의 동작 이후의 과정을 이어서 수행하되, 등록 차량 운행 및 주행정보 저장과정과, 미래 정비 예측 서비스 과정을 수행한다. 구체적으로, 상기 차량 블루투스 페어 링/등록 과정이후에, 등록 차량 운행과정과, 주행 정보 저장과정과, 부품 교환 주기 알림과정과 차량 선제 점검 및 정비과정이 수행된다. 등록 차량 운행과정은 블루투스 신호 인식 및 인식 후 운행과정이 실행된다. 이후 주행 정보 저장과정은 앱이 백그라운드 자동 실행되고, 이용자 단말기의 GPS 실행 및 GSP 정보 저장과 정을 실행된다. 이후 부품 교환 주기 알림 과정은, 주행 거리, 정비이력 데이터를 기반으로 분석과정이 실행되고, 이에 따라 부 품 교환주기 알림과정이 실행된다. 이후 차량 선제 점검 및 정비과정은, 해당 부품 점검 및 정비를 진행하고 앱을 통한 연계 정비소 정비 예약 및 실행과정을 수행하게 된다. 도 7은 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 리워드 서비스의 일예를 나타낸 흐름도 이다. 도 7을 참조하여 리워드 서비스의 일예를 설명한다. 서비스 도입부(모듈)는 회원가입과 AI(인공지능) 자동 차계부 설정 및 블루투스 페어링 및 정보 등록(최초 1 회)과정을 수행할 수 있다. 구체적으로, 세분하면, 간편 본인인증과정, 차량 등록 과정, AI 자동 차계부 설정과 정, 차량 블루투스 페어링/등록 과정을 순차적으로 혹은 개별적으로 수행할 수 있다. 간편 본인인증 과정에서는, 카카오, 네이버, 구글 로그인 과정을 이용하여 간편 본인 인증을 수행할 수 있을 것 이다(이에 제한되지 않음, 일회용 OTP 번호제공, 큐알코드 인증 및 기타 인증 또는 기타 SNS를 통한 인증서비스 제공도 물론 가능할 것이다). 이후 차량등록 과정에서는 차량번호, 소유주명 입력, 국토부, 마이데이터를 통해 차량 제원 데이터 저장 및 출 력이 가능할 것이다. 이후 AI 자동 차계부 설정과정에서는, 차량 누적 주행 거리 입력과정이 수행된다. 이후, 차량 블루투스 페어링/등록 과정에서는, 최초 1회 앱 연동 및 블루투스 페어링 과정이 수행되며, 고유 맥 어드레스가 저장되게 된다. 한편 서비스 실행부(모듈)에서는 서비스 도입부(모듈)에서의 동작 이후의 과정을 이어서 수행하되, 등록 차량 운행 및 주행거리 저장 및 정비 이력 저장과정과, 리워드 지급 및 사용 과정을 수행한다. 구체적으로, 상기 차 량 블루투스 페어링/등록 과정이후에, 등록 차량 운행과정과, 주행 거리 정비 이력 저장과정과, 리워드 지급 과 정과 리워드 사용과정이 수행된다. 등록 차량 운행과정은 블루투스 신호 인식 및 인식 후 운행과정이 실행된다. 이후 주행 거리 이력 저장과정은 앱 실행 및 주행 거리 및 주행 정보 저장과정이 실행된다. 이후 리워드 지급 과정은, 주행 거리, 정비이력 데이터를 환산하여 리워드를 지급하는 과정이 실행되고, 앱에서 확인이 가능하도록 화면 혹시 텍스트 메시지 혹은 알림 메시지 혹은 아이콘 표시등이 제공될 수 있다. 이후 리워드 사용 과정은, 앱에서 리워드를 인출하여 현금처럼 사용하도록 서비스 제공화면이 표시되며, 앱에 제공하는 구매 안내 사이트 혹은 쇼핑몰에서 부품 구매가 가능하도록 서비스 제공화면이 표시되며, 정비 예약시 포인트로 사용가능하도록 서비스 제공화면이 표시될 수 있다. 도 8은 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 안심 귀가 서비스의 일예를 나타낸 흐름 도이다. 도 8을 참조하여 안심 귀가 서비스의 일예를 설명한다. 서비스 도입부(모듈)는 회원가입과 AI(인공지능) 자동 차계부 설정 및 블루투스 페어링 및 정보 등록(최초 1 회)과정을 수행할 수 있다. 구체적으로, 세분하면, 간편 본인인증과정, 차량 등록 과정, AI 자동 차계부 설정과 정, 차량 블루투스 페어링/등록 과정을 순차적으로 혹은 개별적으로 수행할 수 있다. 간편 본인인증 과정에서는, 카카오, 네이버, 구글 로그인 과정을 이용하여 간편 본인 인증을 수행할 수 있을 것 이다(이에 제한되지 않음, 일회용 OTP 번호제공, 큐알코드 인증 및 기타 인증 또는 기타 SNS를 통한 인증서비스 제공도 물론 가능할 것이다). 이후 차량등록 과정에서는 차량번호, 소유주명 입력, 국토부, 마이데이터를 통해 차량 제원 데이터 저장 및 출 력이 가능할 것이다. 이후 AI 자동 차계부 설정과정에서는, 차량 누적 주행 거리 입력과정이 수행된다. 이후, 차량 블루투스 페어링/등록 과정에서는, 최초 1회 앱 연동 및 블루투스 페어링 과정이 수행되며, 고유 맥 어드레스가 저장되게 된다. 한편 서비스 실행부(모듈)에서는 서비스 도입부(모듈)에서의 동작 이후의 과정을 이어서 수행하되, 등록 차량 운행 및 주행거리 저장 및 안심 귀가 알림 서비스 실행 과정을 수행한다. 구체적으로, 상기 차량 블루투스 페어 링/등록 과정이후에, 등록 차량 운행과정과, 주행 거리 저장과정과, 안심 귀가 알림 시작 과정과 안심귀가 인지 및 서비스 종료과정 수행된다. 등록 차량 운행과정은 블루투스 신호 인식 및 인식 후 운행과정이 실행된다. 이후 주행 거리 이력 저장과정은 앱 실행 및 주행 거리 및 주행 정보 저장과정이 실행된다. 이후 안심귀가 알림 시작 과정은, 차량 블루투스 신호가 오프된 것을 센싱하여 차량 운행 종료를 인식함에 따라 안심 귀가 프로세스가 시작되도록 앱이 작동되며, 이용자 단말기의 GPS 실행과정이 수행되며 GPS 위치 인지 과정이 수행된다. 이후 귀가 완료버튼을 차량 운행 종료시점으로부터 n분 내로 눌렀는가?를 판단하는 과정이 수 행된다. n분은 예를 들면 0.5분, 1분, 1분 30초, 2분...과 같이 30초 단위로 설정가능할 것이다. 그러나 이에 제한되지 않는다. 예를 들어, 1분이내에 귀가 완료버튼 누름 신호가 센싱 또는 선택되지 않는 경우에는 앱에서 는 해당 위치 현재시간을 센싱하여 GPS 위치, 시간을 인지하게 되며, 미리 저장된 긴급연락처(112, GPS로 파악 된 가장 근접한 위치의 파출소 번호로 연락되도록 설정가능, 혹은 동시에 또는 별도로 친구, 가족 전화번호로 자동으로 긴급메시지가 전송되도록 설정가능할 것이다)로 SOS 및 안내 문자 전송이 가능하도록 실행되며, 상황 을 알리는 안내메시지가 앱이 장착된 이용자 단말기 화면상에 계속 표시되고, 알람신호도 계속 자동 발신되 도록 할 수 있을 것이다. 만약 귀가 완료버튼이 일정시간내에 눌려진 것이 수신된다면 안심 귀가 인지상태로 저장하고 안심 귀가 서비스 를 종료하게 된다. 도 9는 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 보험사, 중고차 정비 이력 제공 서비스 의 일예를 나타낸 흐름도이다. 도 9를 참조하여 중고차 정비 이력 제공 서비스의 일예에 대하여 설명한다. 서비스 도입부(모듈)는 회원가입과 AI(인공지능) 자동 차계부 설정 및 블루투스 페어링 및 정보 등록(최초 1 회)과정을 수행할 수 있다. 구체적으로, 세분하면, 간편 본인인증과정, 차량 등록 과정, AI 자동 차계부 설정과 정, 차량 블루투스 페어링/등록 과정을 순차적으로 혹은 개별적으로 수행할 수 있다. 간편 본인인증 과정에서는, 카카오, 네이버, 구글 로그인 과정을 이용하여 간편 본인 인증을 수행할 수 있을 것 이다(이에 제한되지 않음, 일회용 OTP 번호제공, 큐알코드 인증 및 기타 인증 또는 기타 SNS를 통한 인증서비스 제공도 물론 가능할 것이다). 이후 차량등록 과정에서는 차량번호, 소유주명 입력, 국토부, 마이데이터를 통해 차량 제원 데이터 저장 및 출 력이 가능할 것이다. 이후 AI 자동 차계부 설정과정에서는, 차량 누적 주행 거리 입력과정이 수행된다. 이후, 차량 블루투스 페어링/등록 과정에서는, 최초 1회 앱 연동 및 블루투스 페어링 과정이 수행되며, 고유 맥 어드레스가 저장되게 된다. 한편 서비스 실행부(모듈)에서는 서비스 도입부(모듈)에서의 동작 이후의 과정을 이어서 수행하되, 등록 차량 운행 및 주행거리 저장 및 정비 이력 저장 과정및 보험사 중고차 정비 이력 제공과정을 수행한다. 구체적으로, 상기 차량 블루투스 페어링/등록 과정이후에, 등록 차량 운행과정과, 주행 거리 및 운행 패턴 저장과정을 수행 하고, 이후, 주행거리/운전패턴/정비 이력 제공과정을 수행한다. 이후, 보험사(보험사 단말기서버(미도시)는 제 공된 주행거리/주행패턴/정비 이력 정보를 활용하는 방안으로 다양한 기능을 실행시킬 수 있다. 즉, 운전 패턴 분석을 통한 운전 점수를 환산하여 보험료 할인 서비스를 제공할 수 있고, 월별, 일별 주행거리 분석을 통해 맞 춤형 보험사 및 상품을 추천할 수 있는 서비스를 제공할 수 있다. 또한, 주행거리/운전패턴/정비 이력 제공과정을 수행한 이후에, 중고차 매매상사(중고차 매매 단말기 서버(미도 시))에서는 누적 주행거리, 운전 패턴 분석을 통한 차량 상태를 확인하는 서비스를 제공할 수 있고, 소모품 교 환, 정비 이력 분석을 통한 차량 상태 확인 서비스를 제공할 수 있다. 위와 같은 보험사 및 중고차 매매상사를 통한 맞춤형 보험사 및 상품 추천 서비스와 차량 상태 확인 서비스를 제공하는 등 신뢰할 수 있는 정보를 이용자 단말기를 통해 제공함으로써 이용자 단말기를 통해 접속한 이용자 즉, 소비자에게 경제적인 추가 이익을 도모하도록 서비스를 제공할 수 있다. 도 10은 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 차량 운행정보 수집서비스의 일예를 나 타낸 흐름도이다. 도 10을 참조하면, 본 발명의 자동차 관리시스템을 사용하기 위하여 사전준비로서, 운영자(구글플레이 혹은 전 용앱 다운로드 사이트에서 다운로드가능함, 안드로이드 또는 아이폰 전용 앱이 구비되어 있음)의 전용 앱(app) (일명, 엠닥터(M Doctor 앱이라 칭함)을 다운로드 받아 설정기능을 통해 블루투스 연결한다(S2). 이 과정은 운 영자가 운영하는 위치기반 서비스를 이용한 자동차 관리 서비스를 받기 위한 기본적인 과정이다. 물론 로그인 과정으로 회원가입과정(개인정보, 차량정보, 차량상태정보 등을 기입할 수 있다. 이에 제한되지 않음)이 있을 수 있다. 전용 앱을 다운로드 받는 과정을 일반적인 앱 다운로드 과정과 유사하므로 자세한 설명을 생략하기로 한다. 이하, 차량에 탑승한 사용자의 이동단말기(이용자단말기, 도2 참조)와 자동차에 설치된 부설장치(도 2 참조) 및 관리장치(도 2 참조), 회원사가 유무선네트워크로 연결된 시스템에 관한 도2의 시스템 구성도 를 기반으로 설명될 것이다. 상기 단계 S2이후에, 자동차(미도시)에 탑승한 사용자는 휴대폰(혹은 개인휴대단말기 또는 이용자단말기라 고도 칭함)에 설치된 전용앱을 작동시킨다(물론 미리 앱을 작동시킨 후 차량에 접근하여 블루투스 연결을 시도 할 수도 있을 것이다) (이때 물론 사용자는 사전에 회원가입과정을 거쳐 등록된 사용자로 가정한다.최초등록과 정). 블루투스가 연결된 상태에서 사용자는 최초등록 상태로 선택하여 최초등록과정을 진행할 수 있다(S4). 이후, 사용자는 앱이 실행된 상태에서, 차량 누적 주행거리를 입력한다(S6)(최초 앱 설정 과정). 입력된 차량 누적 주행거리 자료는 관리장치의 데이터베이스에 저장관리된다(기본적인 데이터는 앱이 설치된 이용자 단말기의 메모리에 저장될 수 도 있을 것이다. 또한, 네트워크가 연결된 상태에서는 기본적인 차량 데이터는 스트리밍 상태로 혹은 다운로드로 관리장치의 데이터베이스로부터 이용자 단말기로 전송가능할 수도 있을 것이다. 상기 단계 S2에서, 만약 회원(본 발명에 따른 서비스 가입자)인 경우에는, 최초등록과정이 이미 실행되었다고 가정할 수 있기 때문에(이 경우, 앱의 작동중에, 이용자단말기와 자동차에 설치된 부설장치와의 최초 1 회 블루투스 페어링이후에 차량에 접근시 자동으로 정보 인식(예를 들어, 차량의 맥 어드레스를 통해 인식이 가 능함) 및 등록이 가능할 수 있다), 앱은 차량 블루투스가 켜져 있는 상태인가를 판단한다(S8). 이후, 단계 S8이 후에, 앱 작동상태에서, 만약 차량 블루투스가 꺼져 있는 경우에는, 앱을 인식못하는 상태이고(S10), 앱은 이런 상태로서 대기상태모드로 전환되거나 이용자 단말기의 화면에 예를 들면, \"차량 블루투스를 켜십시오.\" 라 든지 \"차량 블루투스 미작동상태입다.\"라는 메시지를 표시할 수 있다. 또는 앱은 백그라운드 상태에서 계속 본 발명에서의 핵심 기능 중 하나인 차량 주행 정보기록을 실행할 수 있을 것이다(도 4 참조). 상기 단계 S8에서, 앱 작동중에, 차량 불루투스가 켜진 상태로 판단되면, 앱에서는 이후 등록된 차량 블루투스 신호가 발생했는가를 판단한다(S12).이후 단계 S12의 판단결과, 등록된 차량 블루스트 신호가 발생한 경우에는, 앱은 본 발명에 따른 차량 운행정보 수집의 기본적인 목적을 달성하기 위한 과정을 수행하기 시작하는데, 즉, 차량에서 30cm이하(이에 제한되지 않 음, 예를 들면, 10~30cm 범위를 가지고 차량 접근 여부를 판단하여 그 범위 안에 있는지 여부를 판단하도록 정 할 수도 있다.)로 접근했는지 여부를 판단하게 된다(S16). 이후, 앱은 차량을 인식한 후에(차량의 블루투스 맥 어드레스(MAC ADDRESS)를 기반으로 차량을 인식하게 된다), 본 발명에서의 핵심 기능 중 하나인 차량의 주행 정 보기록을 백라운드 상태에서 실행한다(도 4 참조)(S18). 이후, 앱은 이용자 단말기(휴대폰)의 GPS 장치(미도시)와 연결(연동)되어(S20), GPS정보를 수집하게 된다 (S22). 이후, 수집된 GPS 정보를 관리 장치로 전송하여 데이터베이스에 저장한다(S24, S26). GPS정보는 이용자 의 운전패턴정보(과속, 급정지 등)와 누적 주행거리가 될 수 있다. 상기한 구성으로 된 본 발명에 의하면, 자동차의 이동에 대응하는 GPS 정보를 제공하는 자동차 운행 정보 제공 장치가 제공된다. 이 자동차 운행 정보 제공장치는 자동차 내부에 설치되는 부설장치와, 스마트폰 등의 이용자 단말기를 포함한다. 이용자 단말기는 부설장치와의 네트워크 접속기능을 이용하여 운전자가 자동차를 운행하는 것을 판별하고, 자동차가 운행 중인 경우에는 자신의 GPS 정보를 자동차 운행 정보로서 외부 장치에 대해 제공 하게 된다. 따라서, 본 발명에 있어서는 자동차와의 직접적인 인터페이스 없이 자동차에 대한 정확한 운행 정보 를 획득할 수 있다. 또한 본 발명에 따른 자동차 관리 시스템은 상기 자동차 운행 정보 제공장치로부터 제공되는 자동차 운행 정보 를 근거로 자동차 관리에 필요한 각종 정보를 생성하여 운전자에게 제공하게 된다. 또한, 관리 시스템은 상기 자동차 운행 정보와 더불어, 자동차의 차종이나 연식, 해당 차종과 관련된 수리 정보 등을 근거로 자동차에 요 구되는 관리 내용을 예측하여 이를 운전자에 제공할 수 있다. 또한 본 발명에 따른 자동차 관리 방법은 상기 자동차 운행 정보 제공장치로부터 제공되는 자동차 운행 정보를 근거로 자동차 관리에 필요한 각종 정보를 생성하여 운전자에게 제공하게 된다. 또한, 관리 시스템은 상기 자동 차 운행 정보와 더불어, 자동차의 차종이나 연식, 해당 차종과 관련된 수리 정보 등을 근거로 자동차에 요구되 는 관리 내용을 예측하여 이를 운전자에 제공할 수 있다."}
{"patent_id": "10-2023-0030781", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부된 도면은 본 발명의 실시 예를 설명하기 위한 것이다. 따라서 본 발명의 효율적인 설명과 이해를 위해 일 부 구성이 과장되게 묘사되거나 누락될 수 있음을 이해하여야 할 것이다. 또한, 도면에서 실실적으로 동일한 구 성에 대해서는 전체적으로 동일한 참조번호가 부가되어 있다. 도 1은 본 발명에 따른 자동차 운행 정보 제공장치의 일례를 나타낸 구성도이다. 도 2는 본 발명에 따른 자동차 관리 시스템의 시스템 구성도이다. 도 3은 도 2에서 관리장치의 구성의 일례를 나타낸 블록구성도이다. 도 4는 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 주행정보 기록과정을 개념적으로 설명한 모식 도이다. 도 5는 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반서비스를 활용한 차량 미래 정비 예측 서 비스 흐름도를 나타낸 도면이다.도 6은 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 미래 정비 예측 서비스의 일예를 나타낸 흐름도이다. 도 7은 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 리워드 서비스의 일예를 나타낸 흐름도 이다. 도 8은 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 안심 귀가 서비스의 일예를 나타낸 흐름 도이다. 도 9는 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 보험사, 중고차 정비 이력 제공 서비스 의 일예를 나타낸 흐름도이다. 도 10은 본 발명에 따른 자동차 관리 시스템을 통한 지피에스(GPS) 기반 차량 운행정보 수집서비스의 일예를 나 타낸 흐름도이다."}
