{"patent_id": "10-2021-0039169", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0133707", "출원번호": "10-2021-0039169", "발명의 명칭": "실시간 방송에 연관된 홈쇼핑 채널 제공방법, 이를 구현하는 장치 및 시스템", "출원인": "주식회사 케이티", "발명자": "김정호"}}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "방송 채널별로 연관 홈쇼핑 채널을 설정하는 장치의 동작 방법으로서,상기 방송 채널별로 수신한 실시간 방송의 영상 신호에 포함된 자막 텍스트를 추출하고 상기 자막 텍스트에서주제어 그리고 상기 주제어와 연관된 하나 이상의 키워드를 도출하는 단계, 수집한 홈쇼핑 채널별 방송편성 정보에 기초하여 생방송 중인 홈쇼핑 상품에 대한 데이터를 조회하여 상기 키워드와의 연관도를 분석하는 단계, 그리고 상기 방송 채널별로 연관도가 가장 높은 홈쇼핑 상품을 가지는 홈쇼핑 채널을 매칭하고, 상기 방송 채널별로 매칭된 홈쇼핑 채널 정보를 히든 미러 채널의 로케이터로 생성하는 단계,를 포함하고, 상기 히든 미러 채널은, 상기 실시간 방송이 송출되는 단말에서 설정된 조건에 해당되는 경우 노출되는 논리적인 채널인, 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 히든 미러 채널은,상기 히든 미러 채널의 로케이터에 기초하여 특정 채널 번호의 홈쇼핑 채널과 물리적으로 동일한 방송 스트림이송출되는 채널로, 설정된 조건에 해당되지 않는 경우 노출되지 않는 히든 채널인 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서,상기 키워드를 도출하는 단계는,방송 채널별 실시간 방송 스트림 소스의 영상 신호에 포함된 폐쇄 자막을 추출하고, 일정 시간동안 수집한 폐쇄자막을 하나 이상의 학습된 인공지능 알고리즘에 입력하여 해당 폐쇄 자막에 대한 주제어를 획득하고, 상기 주제어와 연관된 키워드를 도출하는, 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에서상기 연관도를 분석하는 단계는,상기 홈쇼핑 상품에 대한 상품명, 카테고리 그리고 상품 내에 기초하여 유추된 상기 홈쇼핑 상품에 대한 주제어에 대한 확장된 단어 벡터들을 포함하는 상기 홈쇼핑 상품에 대한 데이터를 조회하고, 상기 홈쇼핑 상품에 대한 단어 벡터들과 상기 키워드와의 유사도를 산출하는 , 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에서,상기 히든 미러 채널의 로케이터를 생성하는 단계는,방송 채널 제공 시스템에서 생성한 히든 미러 채널에 대한 정보를 수신하면, 상기 히든 미러 채널 정보에 기초하여 방송 채널별로 히든 미러 채널의 로케이터를 생성하고, 상기 히든 미러 채널을 상기 방송 채널 제공 시스공개특허 10-2022-0133707-3-템으로 전달하는, 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에서,상기 히든 미러 채널의 로케이터는,상기 단말로 전송되면, MPEG-TS 테이블이나 텍스트 데이터 형태로 인코딩되어 연관도가 높은 특정 방송 채널의스트림 영상과 동기화되며, 상기 특정 방송 채널의 콘텐츠가 종료된 일정 시간 이후 상기 특정 방송 채널에 대한 상기 히든 미러 채널의 로케이터가 삭제되는 데이터인, 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에서,상기 히든 미러 채널은, 상기 단말에서 재생중인 방송 채널에 대해 채널 이동 신호를 수신하면, 상기 히든 미러 채널의 로케이터에 기초하여 상기 방송 채널에 대응하는 히든 미러 채널이 튜닝되어 해당 홈쇼핑 방송 영상이 재생되도록 설정되는 채널인, 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "단말의 동작 방법으로서,방송 채널 제공 시스템으로부터 수신한 채널 서비스 정보와 실시간 방송 스트림을 통해 특정 방송 채널에 대해일반 채널 튜닝을 수행하고 실시간 방송 영상을 재생하는 단계, 상기 방송 채널 제공 시스템에 의해 히든 미러 채널을 포함하는 채널 서비스 정보와 히든 미러 채널의 로케이터데이터를 포함한 실시간 방송 채널 스트림을 수신하는 단계, 그리고 사용자로부터 채널 이동 신호를 수신하면, 히든 채널의 로케이터 데이터에 기초하여 상기 특정 방송 채널과 연관된 홈쇼핑 채널을 히든 미러 채널로 튜닝하여 홈쇼핑 방송 영상을 재생하는 단계를 포함하는 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에서,상기 실시간 방송 채널 스트림을 수신하는 단계는,상기 연관된 홈쇼핑 채널 데이터가 MPEG-TS 테이블이나 텍스트 데이터 형태로 인코딩되어 재생중인 특정 방송채널의 스트림과 상기 연관된 홈쇼핑 채널 데이터간에 동기화된 실시간 방송 채널 스트림을 수신하는 동작방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에서,상기 홈쇼핑 방송 영상을 재생하는 단계는, 상기 채널 이동 신호를 수신하면, 상기 특정 방송 채널의 스트림 이외의 상기 연관된 홈쇼핑 채널 데이터를 수신한지 확인하는 단계, 그리고 상기 수신된 홈쇼핑 채널 데이터가 있는 경우, 히든 미러 채널로 튜닝하여 홈쇼핑 방송 영상을 재생하고, 상기수신된 홈쇼핑 채널 데이터가 없는 경우, 상기 채널 이동 신호에 기초하여 이동된 채널에 대한 일반 채널 튜닝을 수행하고 실시간 방송 영상을 재생하는 단계를 포함하는 동작 방법.공개특허 10-2022-0133707-4-청구항 11 제10항에서,상기 홈쇼핑 방송 영상을 재생하는 단계는, 상기 히든 미러 채널로 튜닝하는 경우, 실제 방송 채널 번호가 변경되지 않고, 연관 홈쇼핑 채널의 네트워크 주소로부터 실시간 방송 스트림을 수신하여 상기 연관 홈쇼핑 채널의 방송 영상을 재생하는 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에서,상기 히든 미러 채널로 상기 홈쇼핑 방송 영상을 재생하는 중에 채널 이동 신호를 수신하면, 상기 특정 방송 채널에서 채널 이동 신호에 기초하여 이동된 채널에 대한 일반 채널 튜닝을 수행하고 실시간 방송 영상을 재생하는 단계를 더 포함하는 동작 방법."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "단말과 네트워크로 연결된 방송 채널 제공 시스템에 있어서, 방송 채널별로 실시간 방송의 영상 신호에 포함된 자막 텍스트를 추출하고 상기 자막 텍스트에서 주제어 그리고상기 주제어와 연관된 하나 이상의 키워드를 도출하는 단계, 홈쇼핑 채널별 방송편성 정보에 기초하여 생방송 중인 홈쇼핑 상품에 대한 데이터를 조회하여 상기 키워드와의연관도를 분석하는 단계, 상기 방송 채널별로 연관도가 가장 높은 홈쇼핑 상품을 가지는 홈쇼핑 채널을 매칭하고, 생성된 히든 미러 채널정보에 기초하여 상기 방송 채널별로 매칭된 홈쇼핑 채널 정보를 히든 미러 채널의 로케이터로 생성하는 단계,그리고히든 미러 채널을 포함하는 채널 서비스 정보와 히든 미러 채널의 로케이터 데이터를 포함한 실시간 방송 채널스트림을 상기 단말로 전송하는 단계, 를 포함하는 방송 채널 제공 시스템."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에서,상기 단말로 전송하는 단계는,실시간 방송 채널별 방송 스트림과 연관 홈쇼핑 채널 데이터를 동기화하여 송출하는 방송 채널 제공 시스템."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에서,상기 단말은, 상기 채널 이동 신호를 수신하면, 상기 채널 이동 신호 직전의 상기 단말에서 재생중인 방송 채널의 스트림 이외의 상기 연관된 홈쇼핑 채널 데이터의 수신 여부를 확인하고, 수신된 홈쇼핑 채널 데이터가 있는 경우, 히든미러 채널로 튜닝하여 홈쇼핑 방송 영상을 재생하고, 상기 수신된 홈쇼핑 채널 데이터가 없는 경우, 상기 채널이동 신호에 기초하여 일반 채널로 튜닝하여 실시간 방송 영상을 재생하는 방송 채널 제공 시스템."}
{"patent_id": "10-2021-0039169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에서,상기 히든 미러 채널은,특정 채널 번호의 홈쇼핑 채널과 물리적으로 동일한 방송 스트림과 네트워크 주소로 송출되는 채널로, 설정된공개특허 10-2022-0133707-5-조건에 해당되지 않는 경우 노출되지 않는 히든 채널 속성을 가지며, 상기 단말은, 상기 히든 미러 채널로 튜닝하는 경우, 실제 방송 채널 번호가 변경되지 않는 방송 채널 제공 시스템."}
{"patent_id": "10-2021-0039169", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "방송 채널별로 연관 홈쇼핑 채널을 설정하는 장치의 동작 방법으로서, 상기 방송 채널별로 수신한 실시간 방송의 영상 신호에 포함된 자막 텍스트를 추출하고 자막 텍스트에서 주제어 그리고 주제어와 연관된 하나 이상의 키워 드를 도출하는 단계, 수집한 홈쇼핑 채널별 방송편성 정보에 기초하여 생방송 중인 홈쇼핑 상품에 대한 데이터를 조회하여 상기 키워드와의 연관도를 분석하는 단계, 그리고 방송 채널별로 연관도가 가장 높은 홈쇼핑 상품을 가 지는 홈쇼핑 채널을 매칭하고, 방송 채널별로 매칭된 홈쇼핑 채널 정보를 히든 미러 채널의 로케이터로 생성하는 단계를 포함하고, 히든 미러 채널은, 실시간 방송이 송출되는 단말에서 설정된 조건에 해당되는 경우 노출되는 논리적인 채널이다."}
{"patent_id": "10-2021-0039169", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 실시간 방송에 연관된 홈쇼핑 채널 제공 기술에 관한 것이다."}
{"patent_id": "10-2021-0039169", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 IPTV(Internet Protocol Television), 케이블 등의 유료 방송사는 지상파 방송, 종합 편성 채널, 개별 방송(PP) 사이에 채널 번호를 부여하여 채널들을 통해 해당 방송 콘텐츠를 제공하고 있다. 다양한 방송 콘텐츠들 중에서 홈쇼핑 관련 콘텐츠는 해당 제품의 판매와 직결되는 높은 노출 빈도를 위해 시청 률이 높은 주요 채널과의 근접한 채널 번호를 부여받는 것이 중요하다. 다만, 이러한 채널 번호는 한정되어 있어, 근접한 채널 번호를 확보하기 위해서는 높은 송출 수수료를 지불해야 하며, 정해진 채널 번호로만 접근이 가능하기 때문에 방송 시청을 유도하기에는 한계가 있다. 또한, 시청률이 높은 주요 채널의 방송 콘텐츠와 연계된 상품을 제공하더라도 사용자의 실제 채널 이동의 제한 으로 근접 채널 방송에만 의존하게 되는 문제점이 있다. 그러므로 사용자의 채널 제어 신호에 기초하여 시청 중인 방송 콘텐츠에 연계된 홈쇼핑 방송을 동적으로 제공하 는 기술이 요구된다."}
{"patent_id": "10-2021-0039169", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "해결하고자 하는 과제는, 실시간 방송 콘텐츠와 연계된 홈쇼핑 채널을 히든 미러 채널로 설정하고 사용자의 채 널 제어 신호에 기초하여 해당 히든 미러 채널을 제공하는 실시간 방송에 연관된 홈쇼핑 채널 제공방법과 이를 구현하는 장치 및 시스템을 제공하는 것이다."}
{"patent_id": "10-2021-0039169", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 방송 채널별로 연관 홈쇼핑 채널을 설정하는 장치의 동작 방법으로서, 방송 채널별로 수신한 실시간 방송의 영상 신호에 포함된 자막 텍스트를 추출하고 자막 텍스트에서 주제어 그리고 주제어와 연 관된 하나 이상의 키워드를 도출하는 단계, 수집한 홈쇼핑 채널별 방송편성 정보에 기초하여 생방송 중인 홈쇼 핑 상품에 대한 데이터를 조회하여 키워드와의 연관도를 분석하는 단계, 그리고 방송 채널별로 연관도가 가장 높은 홈쇼핑 상품을 가지는 홈쇼핑 채널을 매칭하고, 방송 채널별로 매칭된 홈쇼핑 채널 정보를 히든 미러 채널 의 로케이터로 생성하는 단계를 포함하고, 히든 미러 채널은, 실시간 방송이 송출되는 단말에서 설정된 조건에 해당되는 경우 노출되는 논리적인 채널이다. 히든 미러 채널은, 히든 미러 채널의 로케이터에 기초하여 특정 채널 번호의 홈쇼핑 채널과 물리적으로 동일한 방송 스트림이 송출되는 채널로, 설정된 조건에 해당되지 않는 경우 노출되지 않는 히든 채널일 수 있다. 키워드를 도출하는 단계는, 방송 채널별 실시간 방송 스트림 소스의 영상 신호에 포함된 폐쇄 자막을 추출하고, 일정 시간동안 수집한 폐쇄 자막을 하나 이상의 학습된 인공지능 알고리즘에 입력하여 해당 폐쇄 자막에 대한 주제어를 획득하고, 주제어와 연관된 키워드를 도출할 수 있다. 연관도를 분석하는 단계는, 홈쇼핑 상품에 대한 상품명, 카테고리 그리고 상품 내에 기초하여 유추된 홈쇼핑 상 품에 대한 주제어에 대한 확장된 단어 벡터들을 포함하는 홈쇼핑 상품에 대한 데이터를 조회하고, 홈쇼핑 상품 에 대한 단어 벡터들과 상기 키워드와의 유사도를 산출할 수 있다. 히든 미러 채널의 로케이터를 생성하는 단계는, 방송 채널 제공 시스템에서 생성한 히든 미러 채널에 대한 정보 를 수신하면, 히든 미러 채널 정보에 기초하여 방송 채널별로 히든 미러 채널의 로케이터를 생성하고, 히든 미 러 채널을 상기 방송 채널 제공 시스템으로 전달할 수 있다. 히든 미러 채널의 로케이터는, 단말로 전송되면, MPEG-TS 테이블이나 텍스트 데이터 형태로 인코딩되어 연관도 가 높은 특정 방송 채널의 스트림 영상과 동기화되며, 특정 방송 채널의 콘텐츠가 종료된 일정 시간 이후 특정 방송 채널에 대한 히든 미러 채널의 로케이터가 삭제되는 데이터일 수 있다. 히든 미러 채널은, 단말에서 재생중인 특정 방송 채널에 대해 채널 이동 신호를 수신하면, 히든 미러 채널의 로 케이터에 기초하여 특정 방송 채널에 대응하는 히든 미러 채널이 튜닝되어 해당 홈쇼핑 방송 영상이 재생되도록 설정되는 채널일 수 있다. 본 발명의 실시예에 따른 단말의 동작 방법으로서, 방송 채널 제공 시스템으로부터 수신한 채널 서비스 정보와 실시간 방송 스트림을 통해 특정 방송 채널에 대해 일반 채널 튜닝을 수행하고 실시간 방송 영상을 재생하는 단 계, 방송 채널 제공 시스템에 의해 히든 미러 채널을 포함하는 채널 서비스 정보와 히든 미러 채널의 로케이터 데이터를 포함한 실시간 방송 채널 스트림을 수신하는 단계, 그리고 사용자로부터 채널 이동 신호를 수신하면, 히든 채널의 로케이터 데이터에 기초하여 특정 방송 채널과 연관된 홈쇼핑 채널을 히든 미러 채널로 튜닝하여 홈쇼핑 방송 영상을 재생하는 단계를 포함한다. 실시간 방송 채널 스트림을 수신하는 단계는, 연관된 홈쇼핑 채널 데이터가 MPEG-TS 테이블이나 텍스트 데이터 형태로 인코딩되어 재생중인 특정 방송 채널의 스트림과 연관된 홈쇼핑 채널 데이터간에 동기화된 실시간 방송 채널 스트림을 수신할 수 있다. 홈쇼핑 방송 영상을 재생하는 단계는, 채널 이동 신호를 수신하면, 특정 방송 채널의 스트림 이외의 연관된 홈 쇼핑 채널 데이터를 수신한지 확인하는 단계, 그리고 수신된 홈쇼핑 채널 데이터가 있는 경우, 히든 미러 채널 로 튜닝하여 홈쇼핑 방송 영상을 재생하고, 수신된 홈쇼핑 채널 데이터가 없는 경우, 채널 이동 신호에 기초하 여 이동된 채널에 대한 일반 채널 튜닝을 수행하고 실시간 방송 영상을 재생하는 단계를 포함할 수 있다. 홈쇼핑 방송 영상을 재생하는 단계는, 히든 미러 채널로 튜닝하는 경우, 실제 방송 채널 번호가 변경되지 않고, 연관 홈쇼핑 채널의 네트워크 주소로부터 실시간 방송 스트림을 수신하여 연관 홈쇼핑 채널의 방송 영상을 재생 할 수 있다. 히든 미러 채널로 홈쇼핑 방송 영상을 재생하는 중에 채널 이동 신호를 수신하면, 특정 방송 채널에서 채널 이 동 신호에 기초하여 이동된 채널에 대한 일반 채널 튜닝을 수행하고 실시간 방송 영상을 재생하는 단계를 더 포 함할 수 있다. 본 발명의 실시예에 따른 단말과 네트워크로 연결된 방송 채널 제공 시스템에 있어서, 방송 채널별로 실시간 방 송의 영상 신호에 포함된 자막 텍스트를 추출하고 자막 텍스트에서 주제어 그리고 주제어와 연관된 하나 이상의 키워드를 도출하는 단계, 홈쇼핑 채널별 방송편성 정보에 기초하여 생방송 중인 홈쇼핑 상품에 대한 데이터를 조회하여 키워드와의 연관도를 분석하는 단계, 방송 채널별로 연관도가 가장 높은 홈쇼핑 상품을 가지는 홈쇼핑 채널을 매칭하고, 생성된 히든 미러 채널 정보에 기초하여 방송 채널별로 매칭된 홈쇼핑 채널 정보를 히든 미러 채널의 로케이터로 생성하는 단계, 그리고 히든 미러 채널을 포함하는 채널 서비스 정보와 히든 미러 채널의 로 케이터 데이터를 포함한 실시간 방송 채널 스트림을 단말로 전송하는 단계 를 포함한다. 단말로 전송하는 단계는, 실시간 방송 채널별 방송 스트림과 연관 홈쇼핑 채널 데이터를 동기화하여 송출할 수 있다. 단말은, 채널 이동 신호를 수신하면, 채널 이동 신호 직전의 단말에서 재생중인 방송 채널의 스트림 이외의 연 관된 홈쇼핑 채널 데이터의 수신 여부를 확인하고, 수신된 홈쇼핑 채널 데이터가 있는 경우, 히든 미러 채널로 튜닝하여 홈쇼핑 방송 영상을 재생하고, 수신된 홈쇼핑 채널 데이터가 없는 경우, 채널 이동 신호에 기초하여 일반 채널로 튜닝하여 실시간 방송 영상을 재생할 수 있다. 히든 미러 채널은, 특정 채널 번호의 홈쇼핑 채널과 물리적으로 동일한 방송 스트림과 네트워크 주소로 송출되 는 채널로, 설정된 조건에 해당되지 않는 경우 노출되지 않는 히든 채널 속성을 가지며, 단말은 히든 미러 채널 로 튜닝하는 경우, 실제 방송 채널 번호가 변경되지 않을 수 있다."}
{"patent_id": "10-2021-0039169", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 사용자가 시청한 방송 프로그램과 연관된 홈쇼핑 상품이 방송되는 홈쇼핑 채널을 동적으로 제공할 수 있다. 본 발명의 실시예에 따르면, 주요 채널의 실시간 방송 프로그램과 연관된 홈쇼핑 상품에 대한 방송을 진행함에 있어 채널 번호 제약을 최소화하여 높은 노출 빈도를 확보할 수 있다."}
{"patent_id": "10-2021-0039169", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구 성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 네트워크를 구성하는 장치 들은 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 본 발명에서 설명하는 장치들은 적어도 하나의 프로세서, 메모리 장치, 통신 장치 등을 포함하는 하드웨어로 구 성되고, 지정된 장소에 하드웨어와 결합되어 실행되는 프로그램이 저장된다. 하드웨어는 본 발명의 방법을 실행 할 수 있는 구성과 성능을 가진다. 프로그램은 도면들을 참고로 설명한 본 발명의 동작 방법을 구현한 명령어 (instructions)를 포함하고, 프로세서와 메모리 장치 등의 하드웨어와 결합하여 본 발명을 실행한다. 본 명세서에서 \"전송 또는 제공\"은 직접적인 전송 또는 제공하는 것뿐만 아니라 다른 장치를 통해 또는 우회 경 로를 이용하여 간접적으로 전송 또는 제공도 포함할 수 있다. 본 명세서에서 단수로 기재된 표현은 \"하나\" 또는 \"단일\" 등의 명시적인 표현을 사용하지 않은 이상, 단수 또는 복수로 해석될 수 있다. 본 명세서에서 도면에 관계없이 동일한 도면번호는 동일한 구성요소를 지칭하며, \"및/또는\" 은 언급된 구성 요 소들의 각각 및 하나 이상의 모든 조합을 포함한다. 본 명세서에서 도면을 참고하여 설명한 흐름도에서, 동작 순서는 변경될 수 있고, 여러 동작들이 병합되거나, 어느 동작이 분할될 수 있고, 특정 동작은 수행되지 않을 수 있다. 도 1은 한 실시예에 따른 방송 채널 제공 시스템을 나타낸 예시도이다. 도 1은 본 발명의 실시예에 따른 주요 구성만 간략하게 도시한 것으로 실시간 방송을 제공하는 필요한 구성들은 생략되었지만, 본 발명의 실시예 범주에 포함되는 것임은 자명하다. 더불어, 도 1에 도시한 구성으로 본 발명의 실시예가 제한되는 것은 아니다. 도 1에 도시한 바와 같이, 방송 채널 제공 시스템은 방송 채널을 생성하고 관리하는 방송 채널 관리 장치 , 연동되는 단말로 방송 채널에 대한 실시간 방송 스트림을 제공하는 방송 스트림 송출 장치, 그리고 실시간 방송에 기초하여 분석된 연관 홈쇼핑 채널을 제어하는 연관 방송 분석 장치를 포함한다. 방송 채널 관리 장치는 기존의 방송 채널 서비스 정보에 추가로 홈쇼핑 채널별 히든 미러 채널을 생성한다. 그리고 방송 채널 관리 장치는 기존 방송 채널(일반 채널)과 히든 미러 채널에 대한 채널 서비스 정보를 단말에 제공한다. 여기서, 히든 미러 채널은 논리적인 채널 서비스가 별도로 존재하는 미러 채널로, 일반적인 상황에서는 시청자 에게 노출되지 않는 히든 채널 속성을 가지는 채널이다. 그리고 히든 미러 채널이 시청자에게 노출되는 경우, 특정 채널 번호의 홈쇼핑 채널과 물리적으로 동일한 방송 스트림과 네트워크 주소가 히든 미러 채널로 송출된다. 방송 스트림 송출 장치는 실시간 방송 채널별 실시간 방송 스트림을 단말에 제공한다. 그리고 방송 스트림 송출 장치는 수신한 히든 미러 채널의 로케이터에 기초하여 방송 스트림과 함께 연관된 홈쇼핑 채널 데이 터를 실시간 방송 채널로 송출할 수 있다. 다시 말해, 방송 스트림 송출 장치는 실시간 방송 채널별 연관된 홈쇼핑 채널 정보를 수신하면, 실시간 방 송 채널별 연관 홈쇼핑 채널 데이터를 해당 방송 스트림과 동기화하여 송출할 수 있다. 또는 방송 스트림 송출 장치는 실시간 방송 채널에 매칭된 홈쇼핑 채널을 단말로 송출할 수 있다. 연관 방송 분석 장치는 채널별의 방송 영상에 기초하여 방송 영상과 관련도가 높은 홈쇼핑 방송 채널을 검 색하여 서로 매칭한다. 연관 방송 분석 장치는 인공지능(AI) 알고리즘을 통해 실시간 방송 자막 텍스트를 분석하여 주제를 분류하 고 해당 주제에 대한 주제어와 연관도가 높은 홈쇼핑 상품이 방송중인 채널을 찾아 연계할 수 있다. 그리고 연관 방송 분석 장치는 실시간 방송 채널별로 연계된 홈쇼핑 채널을 매칭하여 방송 스트림 송출 장 치에 전송할 수 있다. 방송 채널 제공 시스템은 유선 또는 무선 네트워크를 통해 실시간 영상, 소리, 자막 등을 포함하는 방송 스 트림을 단말에 제공한다. 여기서, 단말은 TV 단말, 모바일 단말, 스마트폰, 태블릿 pc 등 방송 채널 제공 시스템에서 제공하는 방송 을 재생 가능한 단말을 모두 포함한다. 단말은 사용자에 의해 실시간으로 특정 방송 채널을 재생하고, 연동된 리모컨, 스마트폰과 같은 단말에 의 한 입력 신호 또는 스크린 터치와 같은 입력 신호에 기초하여 채널 이동 신호를 수신하면 그에 따른 채널 전환 에 따른 방송 영상을 제공한다. 그리고 단말은 재생된 방송 영상에 기초하여 연관된 홈쇼핑 채널을 제공받을 수 있는 히든 미러 채널 서비 스를 신청한 단말일 수 있다. 여기서, 방송 채널 제공 시스템으로 방송 채널 관리 장치, 방송 스트림 송출 장치 그리고 연관 방송 분석 장치을 도시하였으나, 각각의 장치는 개별적으로 구현되거나 하나의 서버 또는 장치로 구현될 수 있다. 또한, 방송 채널 관리 장치, 방송 스트림 송출 장치는 하나의 시스템으로 구현되고 연관 방 송 분석 장치가 별도의 장치로 구현될 수 있다. 이하에서는 연관 방송 분석 장치에 대해서 상세하게 설명한다. 도 2는 한 실시예에 따른 연관 방송 분석 장치의 구성도이다. 도 2에 도시한 바와 같이, 연관 방송 분석 장치는 실시간 방송 스트림 소스를 수신하여 자막 텍스트로부터 주제어와 그에 따른 키워드를 추출하는 자막 텍스트 분석기, 추출한 키워드에 기초하여 방송 편성된 홈쇼 핑 상품과 매칭되는 홈쇼핑 방송을 선택하는 홈쇼핑 상품 추출기, 그리고 추출된 홈쇼핑 상품을 판매하는 홈쇼핑 채널을 히든 미러 채널로 설정하는 연관 홈쇼핑 채널 설정기을 포함하다. 자막 텍스트 분석기, 홈쇼핑 상품 추출기, 그리고 연관 홈쇼핑 채널 설정기는 적어도 하나의 프 로세서에 의해 동작할 수 있다. 연관 방송 분석 장치를 구성하는 일부 장치는 분리되어 구현될 수 있으며, 설명의 편의를 위해 통합 구현된 것으로 설명한다. . 별도의 컴퓨팅 장치에 분산 구현된 경우, 자막 텍스트 분 석기, 홈쇼핑 상품 추출기, 그리고 연관 홈쇼핑 채널 설정기는 통신 인터페이스를 통해 서로 통 신할 수 있다. 컴퓨팅 장치는 본 발명을 수행하도록 작성된 소프트웨어 프로그램을 실행할 수 있는 장치이면 충 분하고, 예를 들면, 서버, 랩탑 컴퓨터 등일 수 있다. 연관 방송 분석 장치는 하나 이상의 학습된 인공지능 알고리즘을 통해 실시간 방송에 포함된 자막에서의 주제어와 하나 이상의 키워드를 추출한다. 그리고 연관 방송 분석 장치는 홈쇼핑 상품 주제에 따른 연관단어 벡터를 생성하며, 각 키워드와 연관도가 가장 높은 단어 벡터를 확인할 수 있다. 이때, 연관 방송 분석 장치는 학습된 인공지능 알고리즘을 이용하기 위해 추출한 데이터들을 전처리 작업 을 수행하고, 각 대응되는 인공지능 모델을 통해 각 방송 내용과 연관도가 높은 홈쇼핑 채널을 매칭할 수 있다. 그리고 단어-역문서 빈도 산출알고리즘, LDA 토픽 모델 등과 같이 텍스트에서 주제를 유추하고 키워드를 추출하 는 하나 이상의 학습된 인공지능 알고리즘을 사용함에 있어 자막 텍스트 분석기와 홈쇼핑 상품 추출기 가 하나 이상의 학습된 인공지능 알고리즘을 공유할 수 있다. 또는 자막 텍스트 분석기와 홈쇼핑 상 품 추출기가 각 별도로 학습된 인공지능 알고리즘들을 이용할 수 있다. 자막 텍스트 분석기는 채널별로 수신한 실시간 방송의 영상 신호에 포함된 자막 텍스트를 추출하고 자막 텍스트에서 주제어 그리고 주제어와 연관된 하나 이상의 키워드를 도출한다. 상세하게는 자막 텍스트 분석기는 실시간 방송 자막 추출 기능은 방송 채널별 실시간 방송 스트림 소스의 영상 신호에 포함된 폐쇄 자막을 추출하여 학습된 인공지능 알고리즘을 통해 자막 텍스트 분석을 수행한다. 자 막 텍스트 분석기는 일정 시간 수집한 자막 텍스트에서 형태소 분석, 주제 및 연관 키워드 분석을 통해 방 송 시간대별 주제와 하나 이상의 키워드를 도출한다. 그리고 자막 텍스트 분석기는 형태 어휘 DB, 연관 단어 벡터 DB를 이용하여 자막 텍스트 분석을 수행할 수 있다. 다시 말해, 자막 텍스트 분석기는 실시간 방송의 자막 텍스트에서 형태소 분석, 토큰화, 일반어 필터링 등 과 같은 전처리 작업을 수행하고, 전처리 작업된 데이터들에서 출현 빈도가 높은 하나 이상의 단어들을 추출할 수 있다. 예를 들어 자막 텍스트 분석기는 단어-역문서 빈도(Term Frequency - Inverse Document Frequency, TF- IDF)를 산출하여 해당 방송 자막에서 주제어를 추출할 수 있다. 이외에도 자막 텍스트 분석기는 LDA 토픽 모델과 같이 미리 구축된 주제 분류 모델을 통해 방송 시간대 별 로 주제어를 추정할 수 있다. 자막 텍스트 분석기는 이러한 주제어를 도출하는 과정에서 출현 빈도가 임계치 이상의 단어들을 키워드로 도출할 수 있다. 또한, 자막 텍스트 분석기는 주제어를 도출하는 과정에서 분류된 주제에 속하는 자막 텍 스트의 단어들을 키워드로 도출할 수 있다. 이때, 자막 텍스트 분석기는 출현 빈도가 임계치 이상 또는 분류된 주제에 포함되는 단어들에 기초하여 각 단어들에 대해서 단어 확장을 통한 유사어들을 키워드로 더 도출할 수 있다. 홈쇼핑 상품 추출기는 홈쇼핑 채널별 방송 편성 정보로부터 현재 방송 중인 상품 정보를 조회하고 해당 상 품명, 카테고리, 상품내용 등에 나오는 주요 단어들을 최근 시점에 분석된 방송 채널별 주제 및 키워드와 연관 도를 분석하여 방송 채널별로 가장 연관도가 높은 홈쇼핑 채널을 선택한다. 홈쇼핑 상품 추출기는 홈쇼핑 채널별 방송 편성 정보 이외에도 웹상에 게재되어 있는 홈쇼핑 상품 정보를 대량으로 수집할 수 있다. 그리고 홈쇼핑 상품 추출기는 LDA 토픽 모델과 같이 미리 구축된 홈쇼핑 상품 주제 분류 모델을 통해 홈쇼 핑 상품과 가장 연관도가 높은 주제어를 유추할 수 있다. 홈쇼핑 상품 추출기는 해당 주제어에 대해 확장 된 단어 벡터들을 생성할 수 있다. 이때, 홈쇼핑 상품 정보는 반드시 실시간 방송 시기에 수집 가능한 것이 아니기 때문에 방송 이전 시점에서 미 리 분석을 통해 홈쇼핑 채널별로 주제어, 연관 단어들을 분석하여 별도의 데이터베이스에 저장할 수 있다. 이에 따라 홈쇼핑 상품 추출기는 실시간으로 자막 텍스트 분석기로부터 전달되는 방송 영상에 대한 하나 이상의 키워드와 방송 시간대별로 저장된 홈쇼핑 상품 정보들을 비교하여 빠르게 연관도가 높은 홈쇼핑 상 품을 추출할 수 있다. 홈쇼핑 상품 추출기는 word2vec 알고리즘을 통해 수신한 방송의 키워드와 홈쇼핑 상품에 대한 주제어, 그 리고 확장 단어 벡터간의 유사도를 도출하여 유사도가 가장 높은 홈쇼핑 상품을 추출할 수 있다. 다시 말해, 홈쇼핑 상품 추출기는 방송과 관련하여 유사도가 높은 방송중인 홈쇼핑 상품 정보를 가지는 홈 쇼핑 채널을 해당 방송과 연관도가 높다고 추정하여 매칭할 수 있다. 그리고 홈쇼핑 상품 추출기는 실시간 방송 내용 또는 프로그램이 변경되거나 홈쇼핑 방송이 변경되면 자동 으로 방송 채널별로 가장 연관도가 높은 홈쇼핑 채널을 업데이트할 수 있다. 다시 말해 홈쇼핑 상품 추출기 는 일정한 주기에 기초하거나 실시간으로 방송 채널별 매칭되는 홈쇼핑 상품을 추출하여 해당 방송 채널에 대응하는 홈쇼핑 채널을 업데이트할 수 있다. 그리고 연관 홈쇼핑 채널 설정기는 실시간 방송 채널별 연관 홈쇼핑 채널이 업데이트되면 해당 홈쇼핑 채 널의 히든 미러 채널 정보를 조회하여 연관 홈쇼핑 채널 정보를 방송 스트림 송출 장치으로 전달한다. 연관 홈쇼핑 채널 설정기는 연관 홈쇼핑 채널이 업데이트될 때마다 히든 미러 채널이 존재하는 경우, 업데 이트된 연관 홈쇼핑 채널 정보를 전달할 수 있다. 한편, 연관 방송 분석 장치는 실시간 수집되는 자막 데이터 또는 홈쇼핑 상품 정보를 입력데이터로 설정하 고, 해당 자막 데이터 또는 홈쇼핑 상품 정보에 대응한 주제어, 키워드들을 결과데이터로 매칭하여 학습 데이터 를 구성하고, 학습 데이터를 이용하여 인공지능 알고리즘을 학습시킬 수 있다. 그리고 연관 방송 분석 장치 는 학습이 완료된 인공지능 알고리즘에 대해서 일정한 주기에 따라 재학습을 수행할 수 있다. 이외에도 연관 방송 분석 장치는 인공지능 알고리즘을 학습하지 않고, 별도의 장치에서 학습이 완료된 인 공지능 알고리즘을 공유하여 이용할 수 있다. 도 3는 한 실시예에 따른 히든 미러 채널 제공하는 방법을 나타낸 순서도이다. 도 3에 도시한 바와 같이, 방송 채널 관리 장치는 일반 채널 서비스를 생성하고(S101), 일반 채널에 대한 채널 서비스 정보를 단말에 전송한다(S103). 단말은 수신한 채널 서비스 정보 및 채널 리스트를 구성한다(S105). 이를 통해 단말은 사용자의 입력에 의해 선택된 방송 채널을 재생하는 준비를 수행한다. 방송 스트림 송출 장치는 일반 채널별 서비스 실시간 방송 스트림을 단말과 연관 방송 분석 장치 로 송출한다(S107). 이에 단말은 선택된 방송 채널에 대해 실시간 방송 영상을 재생하다(S109) 반면에 연관 방송 분석 장치는 수신한 실시간 방송 스트림에 기초하여 방송 자막에서 키워드를 추출한다 (S111). 그리고 연관 방송 분석 장치는 홈쇼핑 편성 정보를 방송 채널 관리 장치에 요청하여(S113) 홈쇼핑 편 성 정보를 수신하면(S115), 홈쇼핑 편성 정보에 기초하여 홈쇼핑 상품들 중에서 방송 영상에서 추출한 키워드와 연관된 홈쇼핑 상품을 추출한다(S117). 이때, 연관 방송 분석 장치는 홈쇼핑 편성 정보 이외에도 관련 사이트, 엔진, 관련 데이터들을 수집하여 홈쇼핑 상품들을 더 이용하여 홈쇼핑 상품에 대한 주제어, 관련 단어들을 추출하여 방송 영상에서 추출한 키워 드와 가장 유사도가 높은 홈쇼핑 상품을 추출할 수 있다. 또는 연관 방송 분석 장치는 이전 시점에서 홈쇼핑 상품 정보에 기초하여 주제어, 관련 단어들을 추출하여 저장된 홈쇼핑 상품에 대한 데이터를 검색하여 방송 영상에서 추출한 키워드와 가장 유사도가 높은 홈쇼핑 상품 을 추출할 수 있다. 한편, 방송 채널 관리 장치는 히든 미러 채널을 생성하여(S119) 연관 방송 분석 장치로 히든 미러 채 널 정보를 전송한다(S121). 그리고 방송 채널 관리 장치는 생성한 히든 미러 채널을 포함하는 채널 서비스 정보를 단말에 전송한다(S123). 설명의 편의상 연관 방송 분석 장치의 홈쇼핑 상품 추출한 후 방송 채널 관리 장치가 히든 미러 채널 을 생성하는 것으로 설명하였지만, 해당 순서는 반드시 한정되는 것은 아니며, 실제 구현함에 있어, 각 단계가 동시에 진행되거나 방송 채널 관리 장치가 히든 미러 채널을 생성한 후, 연관 방송 분석 장치가 연관 도가 높은 홈쇼핑 상품을 추출할 수 있다. 이에 단말은 채널 서비스 정보 및 채널 리스트를 업데이트한다(S125). 그리고 연관 방송 분석 장치는 추출한 홈쇼핑 상품의 채널과 히든 미러 채널 정보를 연계하여 연관 홈쇼핑 채널을 업데이트한다(S127). 이에 연관 방송 분석 장치는 홈쇼핑 채널을 해당 히든 미러 채널과 연계하는 히든 미러 채널의 로케이터를 생성하여 방송 스트림 송출 장치로 전송한다(S129). 방송 스트림 송출 장치는 히든 미러 채널의 로케이터를 추가적으로 단말에 전송한다(S131). 이때, 방 송 스트림 송출 장치는 방송 채널별로 연관된 홈쇼핑 채널 데이터를 동기화하여 단말에 전송할 수 있 다. 이에 특정 방송 채널을 재생하는 단말은 특정 방송 채널의 스트림 이외에도 연관된 홈쇼핑 채널 데이터를 함께 수신할 수 있다. 도 4는 한 실시예에 따른 연관 방송 분석 장치의 동작 방법을 나타낸 순서도이다. 도 4에 도시한 바와 같이, 연관 방송 분석 장치는 실시간 방송 스트림 소스를 수신하여 방송 채널별로 자 막 데이터를 추출한다(S210). 그리고 연관 방송 분석 장치는 자막 데이터에서 하나 이상의 키워드를 추출한다(S220). 연관 방송 분석 장 치는 일정 시간동안 수집한 방송 영상에 포함된 폐쇄 자막을 추출할 수 있으며, 해당 폐쇄 자막에 대한 데 이터를 전처리하여 학습된 인공지능 알고리즘에 입력하고, 인공지능 알고리즘을 통해 형태소 분석, 주제 분석, 그리고 연관 키워드 분석을 수행하여 방송 영상에 대한 하나 이상의 키워드를 도출할 수 있다. 이때, 키워드의 개수는 최소 N개 이상으로 도출 가능하다(N은 자연수). 다음으로 연관 방송 분석 장치는 하나 이상의 키워드에 기초하여 방송 편성된 홈쇼핑 상품 정보와 연관도 를 분석한다(S230). 연관 방송 분석 장치는 홈쇼핑 채널별 방송편성 정보로부터 생방송 중인 홈쇼핑 상품을 확인하고, 생방송 중인 홈쇼핑 상품에 대해 미리 분석한 주제어와 연관 단어들을 검색한다. 그리고 연관 방송 분석 장치는 방송에서 추출한 하나 이상의 키워드와 검색된 홈쇼핑 상품의 주제어와 연 관 단어들 간에 유사도를 산출하고, 유사도가 가장 높은 홈쇼핑 상품이 연관도가 가장 높다고 추정한다. 이에 연관 방송 분석 장치는 연관도가 가장 높은 홈쇼핑 상품을 가지는 홈쇼핑 채널을 선택하고, 방송 채 널별로 선택된 홈쇼핑 채널을 업데이트한다(S240). 연관 방송 분석 장치는 방송 채널별로 그리고 같은 방송 프로그램에서도 시간대별로 연관도가 높은 홈쇼핑 상품을 선택하고 홈쇼핑 채널을 업데이트할 수 있다. 연관 방송 분석 장치는 히든 미러 채널 정보에 기초하여 업데이트된 홈쇼핑 채널에 대한 히든 미러 채널의 로케이터를 전송한다(S250). 연관 방송 분석 장치는 선택된 홈쇼핑 채널이 업데이트될 때마다 업데이트된 홈쇼핑 채널에 대한 히든 미 러 채널의 로케이터를 전송할 수 있다. 도 5는 한 실시예에 따른 단말에서의 동작을 나타낸 순서도이다. 도 5에 도시한 바와 같이, 단말은 채널 서비스 정보를 수신하여 채널 리스트 구성하고 실시간 방송 스트림 을 수신한다(S310). 단말은 부팅 후 TV 채널 서비스 정보를 수신하고 채널 리스트를 구성함으로써 시청자가 채널을 선택하여 시청할 수 있게 준비한다. 그리고 단말은 사용자로부터 특정 채널 번호를 입력받아 특정 채널 번호를 가지는 일반 채널을 튜닝하여 실시간 방송 영상 제공한다(S320). 시청자로부터 시청하고자 하는 특정 채널 번호를 입력받으면 단말은 일반적인 채널 튜닝 방식대로 해당 채 널 번호에 대한 채널 서비스의 네트워크 주소로부터 실시간 방송 스트림을 수신하여 방송 영상을 재생한다. 단말은 히든 미러 채널을 포함하는 채널 서비스 정보와 히든 미러 채널의 로케이터 데이터를 포함한 실시 간 방송 채널 스트림을 수신한다(S330). 여기서, 단말은 상기 연관된 홈쇼핑 채널 데이터가 MPEG-TS 테이블이나 텍스트 데이터 형태로 인코딩되어 재생중인 특정 방송 채널의 스트림과 상기 연관된 홈쇼핑 채널 데이터간에 동기화된 실시간 방송 채널 스트림을수신한다. 다음으로 단말은 채널 이동 신호를 수신하면, 홈쇼핑 채널을 히든 미러 채널로 튜닝하여 홈쇼핑 방송 영상 을 재생한다(S340). 사용자가 채널 시청 중에 리모컨 업다운 버튼을 선택하게 되면 단말은 현재 시청 채널에서 연관 홈쇼핑 채 널 데이터가 일정 시간 지속적으로 수신되었다면 연관 홈쇼핑 채널이 존재하는 것으로 판단하고 해당 데이터에 포함된 연관 홈쇼핑 채널의 히든 미러 채널의 로케이터를 가지고 히든 미러 채널로 튜닝하게 된다. 다시 말해, 히든 미러 채널은 특정 채널 번호를 가지는 연관 홈쇼핑 채널과 물리적으로 동일한 방송 채널이므로 TV 단말에서 히든 미러 채널 튜닝 시 채널 번호는 변경되지 않지만 연관 홈쇼핑 채널의 네트워크 주소로부터 실 시간 방송 스트림을 수신하여 연관 홈쇼핑 상품 방송 영상이 재생되게 된다. 여기서, 단말은 현재 재생중인 방송 채널에서 영상 데이터 외에 연관 홈쇼핑 채널 데이터가 수신되는지 확 인할 수 있다. 예를 들어 일정시간 홈쇼핑 채널 데이터가 수신되지 않으면, 단말은 연관 홈쇼핑 채널이 존 재하지 않는 것으로 판단하여 채널 이동 신호에 따라 실제 채널을 변경할 수 있다. 그리고 단말은 다시 채널 이동 신호를 수신하면, 신호에 기초하여 특정 채널에서 이동된 일반 채널을 튜닝 하여 실시간 방송 영상 제공한다(S350). 이때는 실제 채널이 변경되는 것으로, 변경된 채널에 해당하는 실시간 방송 영상을 제공할 수 있다. 도 6는 한 실시예에 따른 히든 미러 채널을 설명하기 위한 예시도이다. 도 6에 도시한 바와 같이, 단말에 실시간으로 방송되는 MBC 방송사의 채널은 10번으로 방송 콘텐츠의 주제 와 키워드는 각각 캠핑과 캠핑카, 텐트, 바비큐를 가진다. 이에 해당 주제 또는 키워드에 기초하여 검색된 캠프밸리 차박 텐트 콘텐츠를 판매하는 K 쇼핑의 채널 2번을 히 든 미러 채널로 설정되면, 히든 미러 채널은 채널 10번에서의 채널 이동 신호에 기초하여 제공된다. 다시 말해, 10번 채널에서 단말이 채널다운 신호를 수신하면, 기존의 9번 채널인 KBS 방송사의 컨텐츠를 제공하 는 것이 아니라 히든 미러 채널을 제공할 수 있다. 다시 말해 기존의 채널 2번에 할당된 K쇼핑 채널을 임시적으로 히든 미러 채널에 연계하여 채널다운 신호에 따 른 채널 변경에서 히든 미러 채널로 튜닝하여 제공할 수 있다. 이때, 단말에 다시 한번 채널다운 신호가 입력되면, 기존의 9번 채널인 KBS 방송사의 콘텐츠를 제공할 수 있다. 여기서, 채널다운 신호로 도시하였으나, 반드시 채널다운 신호에 한정하는 것은 아니며, 채널 업 신호로도 해당 히든 미러 채널을 제공할 수 있다. 도 7은 한 실시예에 따른 컴퓨팅 장치의 하드웨어 구성도이다. 도 7를 참고하면, 연관 방송 분석 장치는 적어도 하나의 컴퓨팅 장치로 구현될 수 있고, 본 개시의 동작을 실행하도록 기술된 명령들(instructions)이 포함된 컴퓨터 프로그램을 실행할 수 있다. 연관 방송 분석 장치의 하드웨어는 적어도 하나의 프로세서, 메모리, 스토리지, 통신 인터 페이스를 포함할 수 있고, 버스를 통해 연결될 수 있다. 이외에도 입력 장치 및 출력 장치 등의 하드웨어 가 포함될 수 있다. 연관 방송 분석 장치은 컴퓨터 프로그램을 구동할 수 있는 운영 체제를 비롯한 각종 소프트웨어가 탑재될 수 있다. 프로세서는 컴퓨팅 장치의 동작을 제어하는 장치로서, 컴퓨터 프로그램에 포함된 명령들을 처리하는 다양 한 형태의 프로세서일 수 있고, 예를 들면, CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 등 일 수 있다. 또한, 프로세서는 위에서 설 명한 방법을 실행하기 위한 프로그램에 대한 연산을 수행할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 개시의 동작을 실행하도록 기술 된 명령들이 프로세서에 의해 처리되도록 해당 컴퓨터 프로그램을 스토리지로부터 로드할 수 있다. 메모리는 예를 들면, ROM(read only memory), RAM(random access memory) 등 일 수 있다. 스토리지 는 본 개시의 동작을 실행하는데 요구되는 각종 데이터, 컴퓨터 프로그램 등을 저장할 수 있다. 스토리지는 컴퓨터 프로그램을 비임시적으로 저장할 수 있다. 스토리지는 비휘발성 메모리로 구현될 수 있다. 통신 인터페이스는 유/무선 통신 모듈일 수 있고, USB 인터페이스, WiFi 인터페이스, LAN 인터페이스, 5G 네트워크 인터페이스 등을 포함할 수 있다. 컴퓨터 프로그램은 어플리케이션 계층에서 동작하는 에이전트 프로그램을 포함할 수 있다. 컴퓨터 프로그램은 각종 네트워크 인터페이스 드라이버 소프트웨어를 포함할 수 있다. 본 발명에 따르면, 사용자가 시청한 방송 프로그램과 연관된 홈쇼핑 상품이 방송되는 홈쇼핑 채널을 동적으로 제공할 수 있다. 또한, 주요 채널의 실시간 방송 프로그램과 연관된 홈쇼핑 상품에 대한 방송을 진행함에 있어 채널 번호 제약을 최소화하여 높은 노출 빈도를 확보할 수 있다. 이상에서 설명한 본 개시의 실시예는 장치 및 방법을 통해서만 구현이 되는 것은 아니며, 본 개시의 실시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있다. 이상에서 본 개시의 실시예에 대하여 상세하게 설명하였지만 본 개시의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 개시의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 개시의 권리범위에 속하는 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2021-0039169", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 한 실시예에 따른 방송 채널 제공 시스템을 나타낸 예시도이다. 도 2는 한 실시예에 따른 연관 방송 분석 장치의 구성도이다. 도 3은 한 실시예에 따른 히든 미러 채널 제공하는 방법을 나타낸 순서도이다. 도 4는 한 실시예에 따른 연관 방송 분석 장치의 동작 방법을 나타낸 순서도이다. 도 5는 한 실시예에 따른 단말의 동작을 나타낸 순서도이다. 도 6는 한 실시예에 따른 히든 미러 채널을 설명하기 위한 예시도이다. 도 7은 한 실시예에 따른 컴퓨팅 장치의 하드웨어 구성도이다."}
