{"patent_id": "10-2023-0141150", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0057392", "출원번호": "10-2023-0141150", "발명의 명칭": "인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법 및 장치", "출원인": "주식회사 헬린캠프", "발명자": "이창호"}}
{"patent_id": "10-2023-0141150", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 메모리; 및적어도 하나의 코어를 포함하는 프로세서를 포함하고,상기 프로세서는,회원의 신체 정보 및 목표 정보를 입력받고;상기 회원의 신체 정보, 상기 목표 정보 및 PT(personal trainer) 수업 일정을 제1 인공지능(artificialintelligence, AI) 모델에 입력하여 상기 PT 수업 일정 별 추천 운동 세트 및 추천 식단 세트를 제공하고;상기 PT 수업 일정 중 특정 일자에 진행된 PT 수업과 관련된 정보가 입력됨에 기반하여, 상기 PT 수업과 관련된정보, 상기 PT 수업 일정 별 추천 운동 세트, 및 상기 목표 정보를 통해 상기 회원의 PT 수업 성과 정보를 획득하고; 및상기 회원의 PT 수업 성과 정보에 기초한 사용자의 PR(public relation) 정보를 복수의 트레이너 중개 플랫폼에업로드하는, 장치."}
{"patent_id": "10-2023-0141150", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 회원의 신체 정보는, 상기 회원의 신체 부위 별 골격근량 및 체지방률 및 상기 회원의 체중을 포함하고,상기 목표 정보는, 상기 회원의 신체 부위 별 목표 골격근량 및 목표 체지방률 및 상기 회원의 목표 체중을 포함하고,상기 제1 AI 모델은,상기 회원의 신체 정보 및 상기 목표 정보 간의 차이에 기초하여 상기 PT 수업 일정 별 추천 운동 세트 및 상기추천 식단 세트를 산출하도록 학습되는, 장치."}
{"patent_id": "10-2023-0141150", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제1 AI 모델은,상기 회원의 신체 부위 별 골격근량 및 체지방률과 상기 회원의 신체 부위 별 목표 골격근량 및 목표 체지방률간의 제1 차이 값을 산출하고,상기 회원의 체중 및 상기 회원의 목표 체중 간의 제2 차이 값을 산출하고,상기 제1 차이 값 및 상기 제2 차이 값에 기초하여 상기 회원의 필요 운동량을 산출하도록 학습되는, 장치."}
{"patent_id": "10-2023-0141150", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서상기 제1 AI 모델은,상기 회원의 필요 운동량을 상기 PT 수업 일정 별로 분배하여 상기 PT 수업 일정 별 추천 운동 세트를산출하고,상기 PT 수업 일정 별 추천 운동 세트에 대응되는 상기 추천 식단 세트를 산출하도록 학습되는, 장치.공개특허 10-2025-0057392-3-청구항 5 제4항에 있어서,상기 PT 수업과 관련된 정보는, 상기 PT 수업이 진행된 시간에 대한 정보, 상기 PT 수업에서 상기 회원이 진행한 운동 유형 및 회수에 대한 정보, 상기 특정 일자까지의 상기 회원의 식단 정보, 상기 PT 수업 완료 후 상기 회원의 신체 정보, 및 상기 PT수업에 대한 상기 회원의 평가 점수를 포함하는, 장치."}
{"patent_id": "10-2023-0141150", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 프로세서는,상기 PT 수업 일정 별 추천 운동 세트와 상기 PT 수업에서 상기 회원이 진행한 운동 유형 및 회수 간의 차이 값에 기초하여 제1 목표 달성률을 산출하고,상기 PT 수업 완료 후 상기 회원의 신체 정보 및 상기 목표 정보 간의 차이 값에 기초하여 제2 목표 달성률을산출하고,상기 추천 식단 세트와 상기 특정 일자까지의 상기 회원의 식단 정보 간의 일치율에 기초하여 제3 목표 달성률을 산출하는, 장치."}
{"patent_id": "10-2023-0141150", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 프로세서는,상기 제1 목표 달성률, 상기 제2 목표 달성률 및 상기 제3 목표 달성률에 기초하여 종합 목표 달성률을 획득하고,상기 종합 목표 달성률 및 상기 PT 수업에 대한 상기 회원의 평가 점수가 포함된 상기 회원의 PT 수업 성과 정보를 생성하는, 장치."}
{"patent_id": "10-2023-0141150", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,상기 제1 목표 달성률에 대해 제1 가중치를 적용하여 제1 중간 수치를 획득하고,상기 제2 목표 달성률에 대해 제2 가중치를 적용하여 제2 중간 수치를 획득하고,상기 제3 목표 달성률에 대해 제3 가중치를 적용하여 제3 중간 수치를 획득하고,상기 제1 중간 수치, 상기 제2 중간 수치, 및 상기 제3 중간 수치를 합산하여 상기 종합 목표 달성률을 산출하고,상기 제1 가중치, 상기 제2 가중치, 및 상기 제3 가중치 각각의 크기는 상기 사용자에 의해 결정되는, 장치."}
{"patent_id": "10-2023-0141150", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 프로세서는,상기 회원의 PT 수업 성과 정보 및 재등록률을 PR 정보 템플릿에 입력하여 상기 사용자의 PR 정보를 생성하고,상기 사용자의 PR 정보를 상기 복수의 트레이너 중개 플랫폼에 업로드하는, 장치."}
{"patent_id": "10-2023-0141150", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2025-0057392-4-장치에 의해 수행되는, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법에 있어서,회원의 신체 정보 및 목표 정보를 입력받는 단계;상기 회원의 신체 정보, 상기 목표 정보 및 PT(personal trainer) 수업 일정을 제1 인공지능(artificialintelligence, AI) 모델에 입력하여 상기 PT 수업 일정 별 추천 운동 세트 및 추천 식단 세트를 제공하는 단계;상기 PT 수업 일정 중 특정 일자에 진행된 PT 수업과 관련된 정보가 입력됨에 기반하여, 상기 PT 수업과 관련된정보, 상기 PT 수업 일정 별 추천 운동 세트, 및 상기 목표 정보를 통해 상기 회원의 PT 수업 성과 정보를 획득하는 단계; 및상기 회원의 PT 수업 성과 정보에 기초한 사용자의 PR(public relation) 정보를 업로드하는 단계를 포함하는,방법."}
{"patent_id": "10-2023-0141150", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법 및 장치가 개시된다. 본 개시의 일 실시예에 따른, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 장치는, 적어도 하나의 메모리; 및 적어도 하나의 코어를 포함하는 프로세서를 포함하고, 상기 프로세서는, 회원의 신체 정보 및 목표 정보를 입력받고; 상 (뒷면에 계속)"}
{"patent_id": "10-2023-0141150", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 헬스데이터를 관리하는 방법 및 장치에 관한 것이다. 보다 상세하게는, 본 개시는 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0141150", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "건강 관리의 중요성이 대두됨에 따라, 건강 및 영양 관리를 위해 헬스장에서 PT 수업을 받아 체계적으로 건강을 관리하려는 사람들의 수가 급증하고 있다. 다만, 기존의 PT 수업의 경우, 일반적으로 트레이너가 PT 이용자의 헬스 데이터를 수기로 입력 및 관리하였으며, 이에 따라 체계적인 수업 및 식단 관리가 어렵다는 문제점이 존재 하였다. 또한, PT 이용자는 트레이너가 관리하는 헬스 데이터에 쉽게 액세스하지 못하며, 액세스하더라도 헬스 데이터가 내포하는 의미를 쉽게 분석하지 못한다는 문제점이 존재하였다. 이에 따라, PT 이용자의 헬스데이터를 보다 효율적으로 관리 및 분석하는 기술의 필요성이 점차 대두되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허공보 제10-2023-0079709호 (2023.06.07)"}
{"patent_id": "10-2023-0141150", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에 개시된 실시예는 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법 및 장치를 제공 하는데 그 목적이 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0141150", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예로, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 장치는, 적어도 하나의 메모리; 및 적어도 하나의 코어를 포함하는 프로세서를 포함하고, 상기 프로세서는, 회원의 신체 정보 및 목표 정보를 입력받고; 상기 회원의 신체 정보, 상기 목표 정보 및 PT(personal trainer) 수업 일정을 제1 인공지능 (artificial intelligence, AI) 모델에 입력하여 상기 PT 수업 일정 별 추천 운동 세트 및 추천 식단 세트를 제공하고; 상기 PT 수업 일정 중 특정 일자에 진행된 PT 수업과 관련된 정보가 입력됨에 기반하여, 상기 PT 수 업과 관련된 정보, 상기 PT 수업 일정 별 추천 운동 세트, 및 상기 목표 정보를 통해 상기 회원의 PT 수업 성과 정보를 획득하고; 및 상기 회원의 PT 수업 성과 정보에 기초한 사용자의 PR(public relation) 정보를 복수의 트레이너 중개 플랫폼에 업로드할 수 있다. 그리고, 상기 회원의 신체 정보는, 상기 회원의 신체 부위 별 골격근량 및 체지방률 및 상기 회원의 체중을 포 함하고, 상기 목표 정보는, 상기 회원의 신체 부위 별 목표 골격근량 및 목표 체지방률 및 상기 회원의 목표 체 중을 포함하고, 상기 제1 AI 모델은, 상기 회원의 신체 정보 및 상기 목표 정보 간의 차이에 기초하여 상기 PT 수업 일정 별 추천 운동 세트 및 상기 추천 식단 세트를 산출하도록 학습될 수 있다. 그리고, 상기 제1 AI 모델은, 상기 회원의 신체 부위 별 골격근량 및 체지방률과 상기 회원의 신체 부위 별 목 표 골격근량 및 목표 체지방률 간의 제1 차이 값을 산출하고, 상기 회원의 체중 및 상기 회원의 목표 체중 간의 제2 차이 값을 산출하고, 상기 제1 차이 값 및 상기 제2 차이 값에 기초하여 상기 회원의 필요 운동량을 산출하 도록 학습될 수 있다. 그리고, 상기 제1 AI 모델은, 상기 회원의 필요 운동량을 상기 PT 수업 일정 별로 분배하여 상기 PT 수업 일정 별 추천 운동 세트를 산출하고, 상기 PT 수업 일정 별 추천 운동 세트에 대응되는 상기 추천 식단 세트를 산출 하도록 학습될 수 있다. 그리고, 상기 PT 수업과 관련된 정보는, 상기 PT 수업이 진행된 시간에 대한 정보, 상기 PT 수업에서 상기 회원 이 진행한 운동 유형 및 회수에 대한 정보, 상기 특정 일자까지의 상기 회원의 식단 정보, 상기 PT 수업 완료 후 상기 회원의 신체 정보, 및 상기 PT 수업에 대한 상기 회원의 평가 점수를 포함할 수 있다. 그리고, 상기 프로세서는, 상기 PT 수업 일정 별 추천 운동 세트와 상기 PT 수업에서 상기 회원이 진행한 운동 유형 및 회수 간의 차이 값에 기초하여 제1 목표 달성률을 산출하고, 상기 PT 수업 완료 후 상기 회원의 신체 정보 및 상기 목표 정보 간의 차이 값에 기초하여 제2 목표 달성률을 산출하고, 상기 추천 식단 세트와 상기 특 정 일자까지의 상기 회원의 식단 정보 간의 일치율에 기초하여 제3 목표 달성률을 산출할 수 있다. 그리고, 상기 프로세서는, 상기 제1 목표 달성률, 상기 제2 목표 달성률 및 상기 제3 목표 달성률에 기초하여 종합 목표 달성률을 획득하고, 상기 종합 목표 달성률 및 상기 PT 수업에 대한 상기 회원의 평가 점수가 포함된 상기 회원의 PT 수업 성과 정보를 생성할 수 있다. 그리고, 상기 프로세서는, 상기 제1 목표 달성률에 대해 제1 가중치를 적용하여 제1 중간 수치를 획득하고, 상 기 제2 목표 달성률에 대해 제2 가중치를 적용하여 제2 중간 수치를 획득하고, 상기 제3 목표 달성률에 대해 제 3 가중치를 적용하여 제3 중간 수치를 획득하고, 상기 제1 중간 수치, 상기 제2 중간 수치, 및 상기 제3 중간 수치를 합산하여 상기 종합 목표 달성률을 산출하고, 상기 제1 가중치, 상기 제2 가중치, 및 상기 제3 가중치 각각의 크기는 상기 사용자에 의해 결정될 수 있다. 그리고, 상기 프로세서는, 상기 회원의 PT 수업 성과 정보 및 재등록률을 PR 정보 템플릿에 입력하여 상기 사용 자의 PR 정보를 생성하고, 상기 사용자의 PR 정보를 상기 복수의 트레이너 중개 플랫폼에 업로드할 수 있다. 본 개시의 또 다른 예로, 장치에 의해 수행되는, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법은, 회원의 신체 정보 및 목표 정보를 입력받는 단계; 상기 회원의 신체 정보, 상기 목표 정보 및 PT(personal trainer) 수업 일정을 제1 인공지능(artificial intelligence, AI) 모델에 입력하여 상기 PT 수업 일정 별 추천 운동 세트 및 추천 식단 세트를 제공하는 단계; 상기 PT 수업 일정 중 특정 일자에 진행된 PT 수 업과 관련된 정보가 입력됨에 기반하여, 상기 PT 수업과 관련된 정보, 상기 PT 수업 일정 별 추천 운동 세트, 및 상기 목표 정보를 통해 상기 회원의 PT 수업 성과 정보를 획득하는 단계; 및 상기 회원의 PT 수업 성과 정보 에 기초한 사용자의 PR(public relation) 정보를 업로드하는 단계를 포함할 수 있다. 이 외에도, 본 개시를 구현하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 더 제공될 수 있다. 이 외에도, 본 개시를 구현하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2023-0141150", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 전술한 과제 해결 수단에 의하면, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법 및 장치가 제공될 수 있다. 또한, 본 개시의 전술한 과제 해결 수단에 의하면, 보다 효율적으로 PT 수업을 받는 사용자들의 헬스데이터를 보다 효율적으로 관리 및 분석하는 효과가 제공될 수 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0141150", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 개시가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2023-0141150", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 '부, 모듈, 부재, 블록'이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블 록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제 1, 제 2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 본 명세서에서 '본 개시에 따른 장치'는 연산처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들 이 모두 포함된다. 예를 들어, 본 개시에 따른 장치는, 컴퓨터, 서버 장치 및 휴대용 단말기를 모두 포함하거나, 또는 어느 하나의 형태가 될 수 있다. 여기에서, 상기 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱 (laptop), 태블릿 PC, 슬레이트 PC 등을 포함할 수 있다. 상기 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 애플리케이션 서버, 컴퓨팅 서버, 데이터베이스 서버, 파일 서버, 게임 서버, 메일 서버, 프록시 서버 및 웹 서버 등을 포함할 수 있다. 상기 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International MobileTelecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD) 등과 같은 웨어러블 장치를 포함할 수 있다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인 공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만 들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로 써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미 한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버 및/ 또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도 형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 본 개시의 예시적인 실시예에 따르면, 프로세서는 인공지능을 구현할 수 있다. 인공지능이란 사람의 신경세포 (biological neuron)를 모사하여 기계가 학습하도록 하는 인공신경망(Artificial Neural Network) 기반의 기계 학습법을 의미한다. 인공지능의 방법론에는 학습 방식에 따라 훈련데이터로서 입력데이터와 출력데이터가 같이 제공됨으로써 문제(입력데이터)의 해답(출력데이터)이 정해져 있는 지도학습(supervised learning), 및 출력데 이터 없이 입력데이터만 제공되어 문제(입력데이터)의 해답(출력데이터)이 정해지지 않는 비지도학습 (unsupervised learning), 및 현재의 상태(State)에서 어떤 행동(Action)을 취할 때마다 외부 환경에서 보상 (Reward)이 주어지는데, 이러한 보상을 최대화하는 방향으로 학습을 진행하는 강화학습(reinforcement learning)으로 구분될 수 있다. 또한, 인공지능의 방법론은 학습 모델의 구조인 아키텍처에 따라 구분될 수도 있는데, 널리 이용되는 딥러닝 기술의 아키텍처는, 합성곱신경망(CNN; Convolutional Neural Network), 순환신 경망(RNN; Recurrent Neural Network), 트랜스포머(Transformer), 생성적 대립 신경망(GAN; generative adversarial networks) 등으로 구분될 수 있다. 본 장치와 시스템은 인공지능 모델을 포함할 수 있다. 인공지능 모델은 하나의 인공지능 모델일 수 있고, 복수 의 인공지능 모델로 구현될 수도 있다. 인공지능 모델은 뉴럴 네트워크(또는 인공 신경망)로 구성될 수 있으며, 기계학습과 인지과학에서 생물학의 신경을 모방한 통계학적 학습 알고리즘을 포함할 수 있다. 뉴럴 네트워크는 시냅스의 결합으로 네트워크를 형성한 인공 뉴런(노드)이 학습을 통해 시냅스의 결합 세기를 변화시켜, 문제 해 결 능력을 가지는 모델 전반을 의미할 수 있다. 뉴럴 네트워크의 뉴런은 가중치 또는 바이어스의 조합을 포함할 수 있다. 뉴럴 네트워크는 하나 이상의 뉴런 또는 노드로 구성된 하나 이상의 레이어(layer)를 포함할 수 있다. 예시적으로, 장치는 input layer, hidden layer, output layer를 포함할 수 있다. 장치를 구성하는 뉴 럴 네트워크는 뉴런의 가중치를 학습을 통해 변화시킴으로써 임의의 입력(input)으로부터 예측하고자 하는 결과 (output)를 추론할 수 있다. 프로세서는 뉴럴 네트워크를 생성하거나, 뉴럴 네트워크를 훈련(train, 또는 학습(learn)하거나, 수신되는 입력 데이터를 기초로 연산을 수행하고, 수행 결과를 기초로 정보 신호(information signal)를 생성하거나, 뉴럴 네 트워크를 재훈련(retrain)할 수 있다. 뉴럴 네트워크의 모델들은 GoogleNet, AlexNet, VGG Network 등과 같은 CNN(Convolution Neural Network), R-CNN(Region with Convolution Neural Network), RPN(Region Proposal Network), RNN(Recurrent Neural Network), S-DNN(Stacking-based deep Neural Network), S-SDNN(State-Space Dynamic Neural Network), Deconvolution Network, DBN(Deep Belief Network), RBM(Restrcted Boltzman Machine), Fully Convolutional Network, LSTM(Long Short-Term Memory) Network, Classification Network 등 다양한 종류의 모델들을 포함할 수 있으나 이에 제한되지는 않는다. 프로세서는 뉴럴 네트워크의 모델들에 따른 연산을 수행하기 위한 하나 이상의 프로세서를 포함할 수 있다. 예를 들어 뉴럴 네트워크는 심층 뉴럴 네트워크 (Deep Neural Network)를 포함할 수 있다. 뉴럴 네트워크는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), 퍼셉트론(perceptron), 다층 퍼셉트론(multilayer perceptron), FF(Feed Forward), RBF(Radial Basis Network), DFF(Deep Feed Forward), LSTM(Long Short Term Memory), GRU(Gated Recurrent Unit), AE(Auto Encoder), VAE(Variational Auto Encoder), DAE(Denoising Auto Encoder), SAE(Sparse Auto Encoder), MC(Markov Chain), HN(Hopfield Network), BM(Boltzmann Machine), RBM(Restricted Boltzmann Machine), DBN(Depp Belief Network), DCN(Deep Convolutional Network), DN(Deconvolutional Network), DCIGN(Deep Convolutional Inverse Graphics Network), GAN(Generative Adversarial Network), LSM(Liquid State Machine), ELM(Extreme Learning Machine), ESN(Echo State Network), DRN(Deep Residual Network), DNC(Differentiable Neural Computer), NTM(Neural Turning Machine), CN(Capsule Network), KN(Kohonen Network) 및 AN(Attention Network)를 포함 할 수 있으나 이에 한정되는 것이 아닌 임의의 뉴럴 네트워크를 포함할 수 있음은 통상의 기술자가 이해할 것이다. 본 개시의 예시적인 실시예에 따르면, 프로세서는 GoogleNet, AlexNet, VGG Network 등과 같은 CNN(Convolution Neural Network), R-CNN(Region with Convolution Neural Network), RPN(Region Proposal Network), RNN(Recurrent Neural Network), S-DNN(Stacking-based deep Neural Network), S-SDNN(State-Space Dynamic Neural Network), Deconvolution Network, DBN(Deep Belief Network), RBM(Restrcted Boltzman Machine), Fully Convolutional Network, LSTM(Long Short-Term Memory) Network, Classification Network, Generative Modeling, eXplainable AI, Continual AI, Representation Learning, AI for Material Design, 자 연어 처리를 위한 BERT, SP-BERT, MRC/QA, Text Analysis, Dialog System, GPT-3, GPT-4, 비전 처리를 위한 Visual Analytics, Visual Understanding, Video Synthesis, ResNet 데이터 지능을 위한 Anomaly Detection, Prediction, Time-Series Forecasting, Optimization, Recommendation, Data Creation 등 다양한 인공지능 구 조 및 알고리즘을 이용할 수 있으며, 이에 제한되지 않는다. 이하, 첨부된 도면을 참조하여 본 개시의 실시예를 상세하게 설명한다. 본 개시를 설명함에 있어서, \"사용자\"는 PT 수업을 진행하는 PT 트레이너를 의미할 수 있다. \"회원\"은 사용자에 의해 PT 수업을 받는 주체를 통칭한다. 도 1은 본 개시의 일 실시예에 따른, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법을 구현 하기 위한 시스템의 개략도이다. 도 1에 도시된 바와 같이, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법을 구현하기 위한 시스템은 사용자가 이용하는 장치, 회원이 이용하는 장치 및 서버를 포함할 수 있다. 시스템에 포함된 장치, 회원이 이용하는 장치 및 서버는 네트워크(W)를 통해 통신을 수행 할 수 있다. 여기서, 네트워크(W)는 유선 네트워크와 무선 네트워크를 포함할 수 있다. 예를 들어, 네트워크는 근거리 네트워크(LAN: Local Area Network), 도시권 네트워크(MAN: Metropolitan Area Network), 광역 네트워 크(WAN: Wide Area Network) 등의 다양한 네트워크를 포함할 수 있다. 또한, 네트워크(W)는 공지의 월드 와이드 웹(WWW: World Wide Web)을 포함할 수도 있다. 그러나, 본 개시의 실 시예에 따른 네트워크(W)는 상기 열거된 네트워크에 국한되지 않고, 공지의 무선 데이터 네트워크나 공지의 전 화 네트워크, 공지의 유무선 텔레비전 네트워크를 적어도 일부로 포함할 수도 있다. 장치는 회원의 신체 정보, 목표 정보 및 PT 수업 일정에 기초하여 PT 수업 일정 별 추천 운동 세트 및 추 천 식단 세트를 획득할 수 있다. 일 예로, 장치는 AI 알고리즘을 회원의 신체 정보, 목표 정보 및 PT 수업 일정에 적용함으로써 회원에 대한 PT 수업 일정 별 추천 운동 세트 및 추천 식단 세트를 획득할 수 있다.장치는 PT 수업이 진행된 후 PT 수업과 관련된 정보를 이용함으로써 회원의 PT 수업 성과 정보를 획득할 수 있다. 그리고, 장치는 회원의 PT 수업 성과 정보에 기초한 사용자의 PR 정보를 업로드할 수 있다. 한편, 장치가 수행하는 상술된 동작은 서버에 의해 제공되는 어플리케이션/웹 사이트를 통해 진행될 수 있다. 즉, 장치는 서버에 의해 제공되는 어플리케이션을 이용함으로써, PT 수업 일정 별 추천 운 동 세트 및 추천 식단 세트를 획득하고, 회원의 PT 수업 성과 정보를 획득할 수 있다. 또한, 장치는 획득한 각종 데이터(예로, 회원의 PT 수업 성과 정보, PR 정보 등)를 어플리케이션/웹 사이 트 상에 자동으로 업로드할 수 있다. 회원이 이용하는 단말 장치는 어플리케이션/웹 사이트를 통해 장치가 제공하는 각종 데이터를 획득할 수 있다. 즉, 회원이 이용하는 단말 장치는 사용자로부터 자신의 헬스 데이터, 식단 추천 정보 및 성과 정 보를 공유받을 수 있다. 장치가 이용하는 AI 모델은 장치에 내장될 수 있으나 이에 제한되는 것은 아니다. AI 모델은 장치 외부(예로, 서버)에 포함될 수 있고, 장치는 클라우드 기반의 AI 모델을 이용할 수 있다. 도 2는 본 개시의 일 실시예에 따른, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 장치의 구성 을 설명하기 위한 블록도이다. 도 2에 도시된 바와 같이, 장치는 메모리, 통신 모듈, 디스플레이, 입력 모듈 및 프 로세서를 포함할 수 있다. 다만, 이에 국한되는 것은 아니며, 장치는 필요한 동작에 따라 당업자 관 점에서 자명한 범위 내에서 소프트웨어 및 하드웨어 구성이 수정/추가/생략될 수 있다. 메모리는 본 장치의 다양한 기능을 지원하는 데이터와, 프로세서의 동작을 위한 프로그램을 저 장할 수 있고, 입/출력되는 데이터들(예를 들어, 음악 파일, 정지영상, 동영상 등)을 저장할 있고, 본 장치에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 본 장치의 동작 을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외 부 서버로부터 다운로드 될 수 있다. 이러한, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입 (Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 본 장치와는 분리되어 있으나, 유선 또는 무선으로 연결된 데이터베이스를 포함할 수 있다. 즉, 도 1에 도시된 데이터 베이스는 메모리의 일 구성 요소로 구현될 수 있다. 통신 모듈는 외부 장치와 통신을 가능하게 하는 하나 이상의 구성 요소를 포함할 수 있으며, 예를 들어, 방송 수신 모듈, 유선통신 모듈, 무선통신 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나를 포함할 수 있다. 유선 통신 모듈은, 지역 통신(Local Area Network; LAN) 모듈, 광역 통신(Wide Area Network; WAN) 모듈 또는 부가가치 통신(Value Added Network; VAN) 모듈 등 다양한 유선 통신 모듈뿐만 아니라, USB(Universal Serial Bus), HDMI(High Definition Multimedia Interface), DVI(Digital Visual Interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 다양한 케이블 통신 모듈을 포함할 수 있다. 무선 통신 모듈은 와이파이(Wifi) 모듈, 와이브로(Wireless broadband) 모듈 외에도, GSM(global System for Mobile Communication), CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), UMTS(universal mobile telecommunications system), TDMA(Time Division Multiple Access), LTE(Long Term Evolution), 4G, 5G, 6G 등 다양한 무선 통신 방식을 지원하는 무선 통신 모듈을 포함할 수 있 다. 디스플레이는 본 장치에서 처리되는 정보(예로, 회원의 신체 정보, 목표 정보, PT 수업 일정, 성과 등)를 표시(출력)한다. 예를 들어, 디스플레이는 본 장치에서 구동되는 응용 프로그램(일 예로, 어플리케이션)의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 디스플레이에서 출력되는 UI에 대한 종류는 후술하도록 한다. 입력 모듈은 사용자로부터 정보를 입력받기 위한 것으로서, 사용자 입력부를 통해 정보가 입력되면, 프로 세서는 입력된 정보에 대응되도록 본 장치의 동작을 제어할 수 있다. 이러한, 입력 모듈은 하드웨어식 물리 키(예를 들어, 본 장치의 전면, 후면 및 측면 중 적어도 하나에 위 치하는 버튼, 돔 스위치 (dome switch), 조그 휠, 조그 스위치 등) 및 소프트웨어식 터치 키를 포함할 수 있다. 일 예로서, 터치 키는, 소프트웨어적인 처리를 통해 터치스크린 타입의 디스플레이 상에 표시되는 가상 키 (virtual key), 소프트 키(soft key) 또는 비주얼 키(visual key)로 이루어지거나, 상기 터치스크린 이외의 부 분에 배치되는 터치 키(touch key)로 이루어질 수 있다. 한편, 상기 가상키 또는 비주얼 키는, 다양한 형태를 가지면서 터치스크린 상에 표시되는 것이 가능하며, 예를 들어, 그래픽(graphic), 텍스트(text), 아이콘(icon), 비디오(video) 또는 이들의 조합으로 이루어질 수 있다. 프로세서는 본 장치 내의 구성요소들의 동작을 제어하기 위한 알고리즘 또는 알고리즘을 재현한 프로 그램에 대한 데이터를 저장하는 메모리, 및 메모리에 저장된 데이터를 이용하여 전술한 동작을 수행하는 적어도 하나의 프로세서(미도시)로 구현될 수 있다. 이때, 메모리와 프로세서는 각각 별개의 칩으로 구현될 수 있다. 또는, 메모리와 프로세서는 단일 칩으로 구현될 수도 있다. 또한, 프로세서는 이하의 도 3 내지 도 4d에서 설명되는 본 개시에 따른 다양한 실시 예들을 본 장치 상에서 구현하기 위하여, 위에서 살펴본 구성요소들을 중 어느 하나 또는 복수를 조합하여 제어할 수 있다. 도 3은 본 개시의 일 실시예에 따른, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 동작을 설명 하기 위한 순서도이다. 장치는 회원의 신체 정보 및 목표 정보를 입력받을 수 있다(S310). 구체적으로, 장치는 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 어플리케이션을 설치할 수 있 다. 장치는 어플리케이션의 회원 정보 입력 화면 내에서 사용자로부터 회원의 신체 정보 및 목표 정보를 입력받 을 수 있다. 추가적으로 또는 대안적으로, 장치는 체성분 분석 장치로부터 회원의 신체 정보를 입력받을 수 있다. 구체적으 로, 장치는 체성분 분석 장치와 연동될 수 있다. 체성분 분석 장치가 회원의 체성분 분석을 완료한 경우, 체성 분 분석 장치는 어플리케이션을 통해 장치로 회원의 신체 정보를 전송하거나 직접 장치로 회원의 신체 정보를 전송할 수 있다. 여기서, 회원의 신체 정보는 회원의 신체 부위 별 골격근량 및 체지방률 및 회원의 체중을 포함할 수 있다. 그리고, 목표 정보는 회원의 신체 부위 별 목표 골격근량 및 목표 체지방률 및 회원의 목표 체중을 포함할 수 있다. 장치는 회원의 신체 정보, 목표 정보 및 PT(personal trainer) 수업 일정을 제1 인공지능(artificial intelligence, AI) 모델에 입력하여 PT 수업 일정 별 추천 운동 세트 및 추천 식단 세트를 제공할 수 있다 (S320). 여기서, PT 수업 일정은 사용자와 회원 간의 협의로 결정될 수 있다. 사용자는 장치 상에 PT 수업 일정을 업로 드할 수 있다. 제1 AI 모델은 회원의 신체 정보 및 목표 정보 간의 차이에 기초하여 PT 수업 일정 별 추천 운동 세트 및 추천 식단 세트를 산출하도록 학습될 수 있다. 구체적으로, 제1 AI 모델은 회원의 신체 부위 별 골격근량 및 체지방률과 회원의 신체 부위 별 목표 골격근량 및 목표 체지방률 간의 제1 차이 값을 산출하도록 학습될 수 있다. 제1 AI 모델은 회원의 체중 및 회원의 목표 체중 간의 제2 차이 값을 산출하도록 학습될 수 있다. 그리고, 제1 AI 모델은 제1 차이 값 및 상기 제2 차이 값에 기초하여 회원의 필요 운동량을 산출하도록 학습될 수 있다. 일 예로, 제1 AI 모델은 제1 차이 값에 제3 가중치를 적용하여 제4 중간 수치를 산출하고, 제2 차이 값에 제4 가중치를 적용하여 제5 중간 수치를 산출하도록 학습될 수 있다. 제1 AI 모델은 제4 중간 수치 및 제5중간 수치에 대해 미리 정의된 함수를 적용하여 회원의 운동량을 산출하도록 학습될 수 있다. 여기서, 필요 운동량은 운동 유형 별로 세트 횟수 등으로 환산되어 산출될 수 있다. 일 예로, 필요 운동량은 크 런치 x 세트, 랫 풀 다운 y 세트, 스쿼트 z 세트의 합산량 등으로 산출될 수 있다. 제1 AI 모델은 회원의 필요 운동량을 PT 수업 일정 별로 분배하여 PT 수업 일정 별 추천 운동 세트를 산출하도 록 학습될 수 있다. 그리고, 제1 AI 모델은 PT 수업 일정 별 추천 운동 세트에 대응되는 추천 식단 세트를 산출 하도록 학습될 수 있다. 구체적으로, 복수의 유형의 추천 운동 세트에 적합한 식단 세트 데이터베이스가 장치 상에 저장될 수 있다. 제1 AI 모델은 식단 세트 데이터베이스 중 PT 수업 일정 별 추천 운동 세트에 대응되는 추천 식단 세트를 식별 및 산출하도록 학습될 수 있다. PT 수업 일정 중 특정 일자에 진행된 PT 수업과 관련된 정보가 입력됨에 기반하여, 장치는 PT 수업과 관련된 정 보, PT 수업 일정 별 추천 운동 세트, 및 목표 정보를 통해 회원의 PT 수업 성과 정보를 획득할 수 있다(S330). 여기서, PT 수업과 관련된 정보는 PT 수업이 진행된 시간에 대한 정보, PT 수업에서 회원이 진행한 운동 유형 및 회수에 대한 정보, 특정 일자까지의 회원의 식단 정보, PT 수업 완료 후 회원의 신체 정보, 및 PT 수업에 대 한 회원의 평가 점수를 포함할 수 있다. 그리고, PT 수업 성과 정보는 회원의 종합 목표 달성률 및 PT 수업에 대한 회원의 평가 점수를 포함할 수 있다. 구체적으로, 장치는 PT 수업 일정 별 추천 운동 세트와 PT 수업에서 회원이 진행한 운동 유형 및 회수 간의 차 이 값에 기초하여 제1 목표 달성률을 산출할 수 있다. 즉, 장치는 제1 AI 모델에 의해 추천된 운동 세트 및 횟 수와 실제 회원이 진행한 운동 유형 및 횟수 간의 차이 값에 기초하여 제1 목표 달성률을 산출할 수 있다. 장치는 PT 수업 완료 후 회원의 신체 정보 및 목표 정보 간의 차이 값에 기초하여 제2 목표 달성률을 산출할 수 있다. 즉, 장치는 PT 수업 완료 후의 신체 정보와 목표 정보 간의 차이를 통해 제2 목표 달성률을 산출할 수 있 다. 장치는 추천 식단 세트와 특정 일자까지의 회원의 식단 정보 간의 일치율에 기초하여 제3 목표 달성률을 산출할 수 있다. 장치는 제1 목표 달성률, 제2 목표 달성률 및 제3 목표 달성률에 기초하여 종합 목표 달성률을 획득할 수 있다. 예로, 장치는 제1 목표 달성률에 대해 제1 가중치를 적용하여 제1 중간 수치를 획득하고, 제2 목표 달성률에 대 해 제2 가중치를 적용하여 제2 중간 수치를 획득하고, 제3 목표 달성률에 대해 제3 가중치를 적용하여 제3 중간 수치를 획득할 수 있다. 장치는 제1 중간 수치, 제2 중간 수치, 및 제3 중간 수치를 합산하여 종합 목표 달성률을 산출할 수 있다. 여기 서, 제1 가중치, 제2 가중치, 및 제3 가중치 각각의 크기는 사용자 또는 회원의 성향에 기초하여 결정될 수 있 다. 일 예로, 회원이 성향이 식단 관리를 어려워하는 성향인 경우를 가정한다. 이 때, 제3 가중치는 제1 가중치 및 제2 가중치보다 큰 값으로 결정될 수 있다. 장치는 회원의 PT 수업 성과 정보에 기초한 사용자의 PR(public relation) 정보를 복수의 트레이너 중개 플랫폼 에 업로드할 수 있다(S340). 장치는 회원의 PT 수업 성과 정보 및 재등록률을 PR 정보 템플릿에 입력하여 사용자의 정보를 생성할 수 있다. PR 정보 템플릿은 회원의 PT 수업 성과 정보가 입력될 수 있는 영역 및 재등록률을 홍보하는 텍스트가 입력될 수 있는 영역 등으로 구분될 수 있다. 장치는 각 영역에 PT 수업 성과 정보 및 재등록률을 입력함으로써 PR 정 보를 생성할 수 있다. 장치는 PR 정보를 복수의 트레이너 중개 플랫폼에 업로드할 수 있다. 도 4a, 도 4b, 도 4c 및 도 4d는 본 개시의 일 실시예에 따른, 인공 지능 기반의 헬스데이터 공유를 위한 플랫 폼(즉, 어플리케이션) 화면을 설명하기 위한 도면이다. 도 4a에 도시된 바와 같이, 장치는 특정 일자에 진행된 PT 수업과 관련된 정보를 입력할 수 있다. 일 예로, 장 치는 PT를 진행한 회원명, PT 수업 회차, 날짜, 시간, 회원의 컨디션, 특이 사항, 메모 등을 입력할 수 있다. 도 4b에 도시된 바와 같이, 장치는 특정 일자에 진행된 PT 수업에서 회원이 수행한 운동 유형 별 세트 개수 및/ 또는 운동 시간을 입력할 수 있다. 도 4c에 도시된 바와 같이, 장치는 회원이 특정 일자에 진행될 PT 수업에서 할당된 운동의 설명을 제공할 수 있 다. 운동의 설명은 해당 운동을 설명하는 동영상 및 텍스트를 포함할 수 있다. 또한, 장치는 해당 운동을 실제 수행할 때 회원이 지켜야 할 사항(즉, 수업 피드백)을 추가적으로 입력할 수 있다. 도 4d에 도시된 바와 같이, 장치는 PT 수업 완료 후 회원의 신체 정보를 제공할 수 있다. 구체적으로, 장치는 PT 수업 일정 별로 PT 수업 완료 후 변화하는 회원의 신체 정보를 그래프 형태로 시각적으로 제공할 수 있다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2023-0141150", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2023-0141150", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 방법을 구현 하기 위한 시스템의 개략도이다. 도 2는 본 개시의 일 실시예에 따른, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 장치의 구성 을 설명하기 위한 블록도이다. 도 3은 본 개시의 일 실시예에 따른, 인공 지능 기반의 헬스데이터 공유를 위한 플랫폼을 제공하는 동작을 설명 하기 위한 순서도이다. 도 4a, 도 4b, 도 4c 및 도 4d는 본 개시의 일 실시예에 따른, 인공 지능 기반의 헬스데이터 공유를 위한 플랫 폼 화면을 설명하기 위한 도면이다."}
