{"patent_id": "10-2023-0118260", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0035802", "출원번호": "10-2023-0118260", "발명의 명칭": "인공지능 기반 카나비노이드 온라인 분석　ＴＨＣ－Ｓａｆｅ 인증　시스템", "출원인": "비조팹 주식회사", "발명자": "김남수"}}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "카나비노이드 성분을 포함하는 카나비노이드 제품의 제공을 위한 시스템에 있어서,사용자 단말로부터의 제품 요청에 따라 카나비노이드 제품을 제공하도록 네트워크 상의 제품 생성기를 제어하는클라우드 운영 플랫폼을 포함하고, 상기 클라우드 운영 플랫폼은, 상기 제품 요청에 상응하는 상기 해당 카나비노이드 성분 정보를 포함하는 메시지를 생성하는 성분 정보부; 및상기 메시지를 상기 제품 생성기로 전송하는 통보부를 포함하고, 상기 제품 생성기는, 직렬형 연속 추출 공정을 위한 복수의 칼럼; 및 각 칼럼의 배출구로부터의 용액에 대해 성분 분석 테스트를 수행하는 분석 및 측정 장치를 구비하고, 상기 메시지에 따라 약용식물로부터 추출된 대마 추출물을 상기 복수의 칼럼에 통과시키면서 상기 성분 분석 테스트에 따라 상기 해당 카나비노이드 성분 정보에상응하게 카나비노이드 성분을 한가지 이상 포함하는 해당 컬럼의 용액을 포함하는 카나비노이드 제품을 제공하며, 상기 제품 생성기는, 상기 카나비노이드 제품의 THC 성분의 총량이 미리 설정한 제한 기준 이하가 되도록 제어하는 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제품 요청에 포함된 수면상태, 혈당, 또는 스트레스 지수를 포함하는 사용자 추가 정보가 상기 메시지에포함되고, 상기 제품 생성기는, 상기 사용자 추가 정보에 대응된 카나비노이드 성분별 농도에 상응하는 하나 이상의 카나비노이드 성분이 포함된 상기 카나비노이드 제품을 제공하는 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 THC 성분은, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA 중 하나 이상의 성분을 포함하는 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제품 생성기는, 상기 대마 추출물을 활성탄, 알루미나, 감마알루미나, 실리카등이 포함된 상기 복수의칼럼에서 소정의 흡착시간과 속도로 통과 속도를 조절하여, 상기 카나비노이드 성분을 한가지 이상 포함하는 상기 카나비노이드 제품을 분리해 제공하고, 상기 복수의 칼럼은 최초 컬럼으로부터 최종컬럼후 다시 최초 컬럼으로 상기 대마 추출물을 순환시켜 상기 흡착을 반복 가능한 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 분석 및 측정 장치는, 상기 복수의 칼럼 각각의 배출구에 마련된 밸브의 개폐를 통해 배출되는 각각의 용액에 대한 상기 성분 분석 테스트에 따라 불순물이 제거되어 하나 이상의 카나비노이드 성분에 대한 소정의 농도 기준을 만족하는 목표 용액을 용기에 담기도록 해당 컬럼의 배출구에 마련된 밸브의 개폐를 제어해 해당 카나비노이드 제품을 제공하되,공개특허 10-2025-0035802-3-상기 분석 및 측정 장치는, 상기 성분 분석 테스트에서 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비에서 출력되는 성분 분석 결과 정보에 대해, 테스트셋의 학습된 결과에 따라 획득한 학습 정보를 참조하여, 비교 분석함으로써하나 이상의 카나비노이드 성분을 추정하는 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 분석 및 측정 장치가, 상기 성분 분석 테스트에서 전송하는, HPLC, LCMSMS, GC-MASS, 또는 NMR 장비에서출력되는 성분 분석 결과 정보에 대한 함량 정보 요청을 수신하여, 테스트셋의 학습된 결과에 따라 획득한 학습정보를 참조하여, 비교 분석함으로써 하나 이상의 카나비노이드 성분을 추정하고, 추정된 카나비노이드 성분에대한 정보를 상기 분석 및 측정 장치로 전송하는 인터페이스부를 더 포함하는 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항 또는 제6항에 있어서,상기 학습 정보로서, 제조 현장에서 입수된 테스트용 성분 분석 결과 정보, 및 이동상들의 속도, 압력, 칼럼의종류, 또는 온도를 포함하는 분석조건과, 정답 카나비노이드 성분에 대한 상기 테스트셋에 대하여, 심층신경망을 이용하여, 상기 카나비노이드 성분을 추정하는 학습 모델을 이용하는 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,카나비노이드 성분이 포함된 상기 약용식물로서, 헴프, 캐나비스, 삼, 마황, 마자, 마분, 마발, 마인, 마엽, 또는 마근 중 하나 이상을 포함하고, 상기 제품 생성기는, 상기 약용식물의 잎, 꽃, 뿌리, 줄기, 또는 씨앗 중 하나 이상을, 직경 5mm 이하로 파쇄하고 초임계 추츨 방식으로 추출한 추출 용액과 소정의 희석 용제(PK0)와의 혼합물인 상기 대마 추출물을 이용하되, 상기 추출 용액에 대하여 상기 희석 용제(PK0)의 비율이 0~10,000 배로 희석되며, 상기 분석 및 측정 장치를 통해 불순물이 포함된 상기 대마 추출물에 대한 상기 성분 분석 테스트가 가능한 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 희석 용제(PK0)로서 에틸알콜 함량이 0~80wt.%;포도씨유, 식용유, 팜유, 코코넛유, 참기름, 들기름, 유칼립튜스유, 헴프씨드유 중 하나 이상의 합이 0~5wt.%, 및 증류수가 15~100wt.% 되도록 혼합하고, 온도 25~270oC에서 5초 ~ 30분 및 1~10기압 조건으로 상기 대마 추출물을 전처리하여 이용하는 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 약용 식물이 상기 씨앗 중 껍질이 있는 씨앗의 경우, 표면의 THC, CBN, CBC, 또는 CBL 중 하나 이상이 포함된 카나비노이드 유효 성분을 선별적으로 제거하기 위하여, 파쇄 없이 원씨앗 그대로를 에틸알콜 함량이20wt.% 이상 포함된 증류수에 넣고, 온도 35oC 이상에서 5 초 ~ 30분 및 1~10 기압 조건에서 노출시킨 후, 건조후 상기 파쇄를 통해 상기 대마 추출물의 획득에 이용된 것인 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 제품 생성기는, 상기 전처리 후에 발생된 용출물이 포함하는 카나비노이드 성분, 미생물, 중금속 이온, 흙, 뿌리 잔여물, mycotoxin, 및 부유물이 혼합된 액상을, 원심분리방식또는 가압방식의 필터링, 또는 중력여과방식에 의해 고액분리하여, 생성된 단백질, 탄수화물, 유효지방 및 카나비노이드 성분을 포함하는 유효성분을 포함하는 해당 생성 물질을 재활용하고, 상기 생성 물질에 존재할 수 있는 상기 카나비노이드 성분, 공개특허 10-2025-0035802-4-미생물, 중금속 이온을 안전하게 분리 제거하고, 잔여물은 폐기하도록 제어하는 시스템."}
{"patent_id": "10-2023-0118260", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 분석 및 측정 장치는, 제공되는 상기 카나비노이드 제품에 대한 총 THC 성분에 대한 인증(THC-Safe) 요구에 따라, 상기 카나비노이드 제품을 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비 중 하나이상으로 전달해, Δ9-THC,Δ8-THC, THCA-A, CBGA, CBN, CBNA를 포함하는 THC 성분의 총량을 결정하기 위한 성분 분석이 이루어지도록 상기 장비를 제어하여, 상기 THC 성분의 총량이 소정의 규제 기준 이하인 경우에 대한 적합 인증에 대한 정보를출력하되,상기 분석 및 측정 장치는, 상기 성분 분석에서 테스트셋의 학습된 결과에 따라 획득한 학습 정보를 참조하여,하나 이상의 카나비노이드 성분을 추정하는 시스템."}
{"patent_id": "10-2023-0118260", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 기반 카나비노이드 온라인 분석 THC-Safe 인증 시스템에 관한 것으로서, 본 발명의 카나비 노이드 성분을 포함하는 카나비노이드 제품의 제공을 위한 시스템은,사용자 단말로부터의 제품 요청에 따라 카나 비노이드 제품을 제공하도록 네트워크 상의 제품 생성기를 제어하는 클라우드 운영 플랫폼을 포함하고, 상기 클 (뒷면에 계속)"}
{"patent_id": "10-2023-0118260", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 현장에서 다양한 분석장비 (HPLC, LCMSMS, NMR 등)을 통해 분석된 데이터를 웹으로 전송되고 그에 따 라 머쉰러닝 모델을 통해 그래프데이터 등을 학습한 결과를 이용하여, 표준용액의 사용이 최소화 또는 없는 상 황에서도 온라인 상에서 요구에 따라 현장에서의 측정 데이터를 분석하여 대마 추출물의 농도를 측정하고, 더 나아가 주변 장비를 제어하고 분리 농축하여 제공하며 제공되는 카나비노이드 제품(대마 제품)의 THC 성분의 안 정되고 안전한 인증 (THC-Safe)이 가능한 시스템에 관한 것이다."}
{"patent_id": "10-2023-0118260", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "대마초 사티바(Cannabis Sativa)는 고대부터 인간이 음식, 약, 섬유질, 사회, 종교적 의식을 위해 사용한 유명 한 식물 중 하나이다. 인류 역사를 통틀어 사용했다는 방대한 증거를 고려할 때, 대마초 사용의 범죄화는 최근 에 목격되었다. 이러한 제한에도 불구하고 연구에 따르면 2010년부터 2019년까지 대마초 사용이 꾸준히 증가하 고 있다. 유엔마취약품위원회(CND)는 2020년 12월 대마초와 대마수지의 의학적 가치를 인정한 국제상장으로 재 분류해 대마초 기반 의약품 연구개발이 가능해졌다. 몇몇 국가들은 오락적인 목적이 아니더라도 적어도 의료용 으로 대마초 제품을 수용하기 위해 법을 바꾸거나 수정했다. 사회적 낙인이 대마초 주입 제품 소비에 영향을 미 치는 요인 중 하나이지만, 도움이 필요한 환자에게 효과적으로 전달하기 위한 혁신적인 연구가 진행 중이다. 불 투명한 법에도 불구하고 2020년부터 2025년까지 합법적 대마초 시장 점유율은 34조 9100억 달러 증가할 것으로 예상된다. 남한에서는 안동 지역의 낙동강 유역이 삼베 재배에 적합하며 1,400년 이상 동안 한국 고유의 전통 직물로 알려 져 있다. 국내에서 오락 목적으로 대마초를 사용하는 것은 박정희 군사정권이 1976년 대마초관리법을 시행한 1960년대와 1970년대 초까지만 해도 드물지 않았다. 대마초의 의료 혜택을 활용하기 위한 조치가 취해지고 있으 며, 2018년에 적절한 법 개정이 이루어졌다. 한국 정부가 의료용 대마초 사용에 유리하도록 규정을 개정하고 있 지만, Δ9-테트라하이드로카나비놀(THC)이 함유되지 않은 CBD(canabidiol) 기반 의료용 대마초의 수입에 중점을 두고 있다. 대마초 규정 개정 이후 2019년 합법적으로 수입된 대마유는 총 2억770만 달러에 달하는 것으로 알려 졌다. 경북 동남부 안동시에 삼베 규제자유구역이 지정돼 전국에서 유일하게 대마 재배가 가능해졌다. 이와 같 이 특히 한국은 대마초와 그 제품에 대해 보수적인 접근법을 취해왔고, 그 결과 대마초 농도가 낮게 나타났다. 관련 선행 문헌으로서 특허출원 제10-2022-0135660호 (2022.10.20), 등록특허 제10-2355482호 (2022.02.08) 등 이 참조될 수 있다."}
{"patent_id": "10-2023-0118260", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이와 같은 대마초의 의료 혜택을 활용하기 위한 목적으로, 다양한 카나비노이드 성분을 요구하는 사용자의 주문 에 따라 용이하고 안전하게 카나비노이드 제품(대마 제품)을 제공할 수 있는 시스템이 요구되고 있다. 따라서, 본 발명의 목적은, IoT 상에서 웹 기반으로 주문에 따라 인공지능형(AI) 딥러닝 학습된(머쉰러닝된) 축적 데이터를 활용해, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA를 포함하는 총 THC 성분(T-THC, Total THC)이 미리 설정한 수준 이하가 되도록 분리 농축하여 카나비노이드 제품을 제공하되, HPLC(High-Performance Liquid Chromatography, 고성능 액체 크로마토그래피), LC MS-MS(LCMSMS)(Liquid Chromatography Tandem Mass Spectrometry, 액체 크로마토그래피 탠덤 질량분석법), GC-MASS (Gas Chromatograph/Mass Spectroscopy, 기체 크로마토그래피-질량분석법), NMR(Nuclear Magnetic Resonance) 등의 방법으로 총 THC 성분에 대한 안정되고 안전한 인증(THC-Safe) 처리가 가능한 시스템을 제공하는 데 있다."}
{"patent_id": "10-2023-0118260", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "먼저, 본 발명의 특징을 요약하면, 상기의 목적을 달성하기 위한 본 발명의 일면에 따른 카나비노이드 성분을 포함하는 카나비노이드 제품의 제공을 위한 시스템은, 사용자 단말로부터의 제품 요청에 따라 카나비노이드 제 품을 제공하도록 네트워크 상의 제품 생성기를 제어하는 클라우드 운영 플랫폼을 포함하고, 상기 클라우드 운영 플랫폼은, 상기 제품 요청에 상응하는 상기 해당 카나비노이드 성분 정보를 포함하는 메시지를 생성하는 성분 정보부; 및 상기 메시지를 상기 제품 생성기로 전송하는 통보부를 포함하고, 상기 제품 생성기는, 직렬형 연속 추출 공정을 위한 복수의 칼럼; 및 각 칼럼의 배출구로부터의 용액에 대해 성분 분석 테스트를 수행하는 분석 및 측정 장치를 구비하고, 상기 메시지에 따라 약용식물로부터 추출된 대마 추출물을 상기 복수의 칼럼에 통과 시키면서 상기 성분 분석 테스트에 따라 상기 해당 카나비노이드 성분 정보에 상응하게 카나비노이드 성분을 한 가지 이상 포함하는 해당 컬럼의 용액을 포함하는 카나비노이드 제품을 제공하며, 상기 제품 생성기는, 상기 카 나비노이드 제품의 THC 성분의 총량이 미리 설정한 제한 기준 이하가 되도록 제어할 수 있다. 상기 THC 성분은, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA 중 하나 이상의 성분을 포함할 수 있다, 상기 분석 및 측정 장치는, HPLC, LCMSMS, GC-MASS, 또는 NMR 장비 중 하나이상을 이용하여 상기 성분 분석 테 스트를 수행할 수 있다. 상기 제품 요청에 포함된 수면상태, 혈당, 또는 스트레스 지수를 포함하는 사용자 추가 정보가 상기 메시지에 포함되고, 상기 제품 생성기는, 상기 사용자 추가 정보에 대응된 카나비노이드 성분별 농도에 상응하는 하나 이 상의 카나비노이드 성분이 포함된 상기 카나비노이드 제품을 제공할 수 있다. 상기 제품 생성기는, 상기 대마 추출물을 활성탄, 알루미나, 감마알루미나, 실리카등이 포함된 상기 복수의 칼럼에서 소정의 흡착시간과 속도로 통과 속도를 조절하여, 상기 카나비노이드 성분을 한가지 이상 포함하는 상 기 카나비노이드 제품을 분리해 제공하고, 상기 복수의 칼럼은 최초 컬럼으로부터 최종컬럼후 다시 최초 컬럼으 로 상기 대마 추출물을 순환시켜 상기 흡착을 반복 가능하다. 상기 분석 및 측정 장치는, 상기 복수의 칼럼 각각의 배출구에 마련된 밸브의 개폐를 통해 배출되는 각각의 용 액에 대한 상기 성분 분석 테스트에 따라 불순물이 제거되어 하나 이상의 카나비노이드 성분에 대한 소정의 농 도 기준을 만족하는 목표 용액을 용기에 담기도록 해당 컬럼의 배출구에 마련된 밸브의 개폐를 제어해 해당 카 나비노이드 제품을 제공하되, 상기 분석 및 측정 장치는, 상기 성분 분석 테스트에서 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비에서 출력되는 성분 분석 결과 정보에 대해, 테스트셋의 학습된 결과에 따라 획득한 학습 정보를 참조하여, 비교 분석함으로써 하나 이상의 카나비노이드 성분을 추정할 수 있다. 상기 시스템은, 상기 분석 및 측정 장치가, 상기 성분 분석 테스트에서 전송하는, HPLC, LCMSMS, GC-MASS, 또는 NMR 장비에서 출력되는 성분 분석 결과 정보에 대한 함량 정보 요청을 수신하여, 테스트셋의 학습된 결과에 따 라 획득한 학습 정보를 참조하여, 비교 분석함으로써 하나 이상의 카나비노이드 성분을 추정하고, 추정된 카나 비노이드 성분에 대한 정보를 상기 분석 및 측정 장치로 전송하는 인터페이스부를 더 포함할 수 있다. 상기 학습 정보로서, 제조 현장에서 입수된 테스트용 성분 분석 결과 정보, 및 이동상들의 속도, 압력, 칼럼의 종류, 또는 온도를 포함하는 분석조건과, 정답 카나비노이드 성분에 대한 상기 테스트셋에 대하여, 심층신경망 을 이용하여, 상기 카나비노이드 성분을 추정하는 학습 모델을 이용할 수 있다. 카나비노이드 성분이 포함된 상기 약용식물로서, 헴프, 캐나비스, 삼, 마황, 마자, 마분, 마발, 마인, 마엽, 또 는 마근 중 하나 이상을 포함하고, 상기 제품 생성기는, 상기 약용식물의 잎, 꽃, 뿌리, 줄기, 또는 씨앗 중 하 나 이상을, 직경 5mm 이하로 파쇄하고 초임계 추츨 방식으로 추출한 추출 용액과 소정의 희석 용제(PK0)와의 혼 합물인 상기 대마 추출물을 이용하되, 상기 추출 용액에 대하여 상기 희석 용제(PK0)의 비율이 0~10,000 배로 희석되며, 상기 분석 및 측정 장치를 통해 불순물이 포함된 상기 대마 추출물에 대한 상기 성분 분석 테스트가 가능하다.상기 희석 용제(PK0)로서 에틸알콜 함량이 0~80wt.%; 포도씨유, 식용유, 팜유, 코코넛유, 참기름, 들기름, 유칼립튜스유, 헴프씨드유 중 하나 이상의 합이 0~5wt.% 및 증류수가 15~100wt.% 되도록 혼합하고, 온도 25~270oC에서 5초 ~ 30분 및 1~10기압 조건으로 상기 대마 추출물을 전처리하여 이용할 수 있다. 상기 약용 식물이 상기 씨앗 중 껍질이 있는 씨앗의 경우, 표면의 THC, CBN, CBC, 또는 CBL 중 하나 이상이 포 함된 카나비노이드 유효 성분을 선별적으로 제거하기 위하여, 파쇄 없이 원씨앗 그대로를 에틸알콜 함량이 20wt.% 이상 포함된 증류수에 넣고, 온도 35oC 이상에서 5 초 ~ 30분 및 1~10 기압 조건에서 노출시킨 후, 건조 후 상기 파쇄를 통해 상기 대마 추출물의 획득에 이용된 것이 바람직하다. 상기 제품 생성기는, 상기 전처리 후에 발생된 용출물이 포함하는 카나비노이드 성분, 미생물, 중금속 이온, 흙, 뿌리 잔여물, mycotoxin, 및 부유물이 혼합된 액상을, 원심분리방식또는 가압방식의 필터링, 또는 중 력여과방식에 의해 고액분리하여, 생성된 단백질, 탄수화물, 유효지방 및 카나비노이드 성분을 포함하는 유 효성분을 포함하는 해당 생성 물질을 재활용하고, 상기 생성 물질에 존재할 수 있는 상기 카나비노이드 성분, 미생물, 중금속 이온을 안전하게 분리 제거하고, 잔여물은 폐기하도록 제어할 수 있다. 상기 분석 및 측정 장치는, 제공되는 상기 카나비노이드 제품에 대한 총 THC 성분에 대한 인증(THC-Safe) 요구 에 따라, 상기 카나비노이드 제품을 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비 중 하나이상으로 전달해, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA를 포함하는 THC 성분의 총량을 결정하기 위한 성분 분석이 이루어지도록 상 기 장비를 제어하여, 상기 THC 성분의 총량이 소정의 규제 기준 이하인 경우에 대한 적합 인증에 대한 정보를 출력하되, 상기 분석 및 측정 장치는, 상기 성분 분석에서 테스트셋의 학습된 결과에 따라 획득한 학습 정보를 참조하여, 하나 이상의 카나비노이드 성분을 추정할 수 있다."}
{"patent_id": "10-2023-0118260", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 시스템에 따르면, IoT 상에서 웹 기반으로 주문에 따라 제품생성기의 인공지능형(AI) 딥 러닝 학습된 축적 데이터를 활용해, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA를 포함하는 총 THC 성분(T- THC, Total THC)이 미리 설정한 수준 이하가 되도록 분리 농축하여 해당 카나비노이드 제품을 용이하게 제공할 수 있으며, 필요에 따라 요구된 카나비노이드 제품에 대하여 HPLC, LCMSMS, GC-MASS, NMR 등의 방법으로 총 THC 성분에 대한 안정되고 안전한 인증(THC-Safe) 처리가 가능하다. 본 발명에서는, 현장에서 비교적 다양한 분석장비 (HPLC, LCMSMS, NMR 등)를 통해 측정된 데이터를 온라인 상에 서 웹으로 전송됨으로써, 머쉰러닝 모델을 통해 그래프데이터를 학습한 결과를 이용하여, 표준용액의 사용이 최 소화 또는 없는 상황에서도 온라인 상에서 요구에 따라 현장에서의 측정 데이터를 분석하여 대마 추출물의 농도 를 특정짓고, 지정된 수준에 도달할때까지 분리, 농축 등 주변 장비를 제어하여 최종 설정된 농도로 카나비노이 드 제품(대마 제품)의 THC 성분을 안전인증 (THC-Safe)할 수 있다. 이를 통해, 공간, 시간에 제약을 받지 않으 며, 대마 성분(카나비노이드 성분)의 분석결과를 웹상에서 쉽게 정량화할 수 있는 장점이 있다."}
{"patent_id": "10-2023-0118260", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면들을 참조하여 본 발명에 대해서 자세히 설명한다. 이때, 각각의 도면에서 동일한 구성 요소는 가능한 동일한 부호로 나타낸다. 또한, 이미 공지된 기능 및/또는 구성에 대한 상세한 설명은 생략한다. 이하에 개시된 내용은, 다양한 실시 예에 따른 동작을 이해하는데 필요한 부분을 중점적으로 설명하며, 그 설명 의 요지를 흐릴 수 있는 요소들에 대한 설명은 생략한다. 또한 도면의 일부 구성요소는 과장되거나 생략되거나 또는 개략적으로 도시될 수 있다. 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니며, 따라서 각각의 도면에 그려진 구성요소들의 상대적인 크기나 간격에 의해 여기에 기재되는 내용들이 제한되는 것은 아 니다. 본 발명의 실시예들을 설명함에 있어서, 본 발명과 관련된 공지기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 그리고, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 상세한 설명에서 사용되 는 용어는 단지 본 발명의 실시 예들을 기술하기 위한 것이며, 결코 제한적이어서는 안 된다. 명확하게 달리 사 용되지 않는 한, 단수 형태의 표현은 복수 형태의 의미를 포함한다. 본 설명에서, \"포함\" 또는 \"구비\"와 같은 표현은 어떤 특성들, 숫자들, 단계들, 동작들, 요소들, 이들의 일부 또는 조합을 가리키기 위한 것이며, 기술된 것 이외에 하나 또는 그 이상의 다른 특성, 숫자, 단계, 동작, 요소, 이들의 일부 또는 조합의 존재 또는 가능 성을 배제하도록 해석되어서는 안 된다. 또한, 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어 들에 의해 한정되는 것은 아니며, 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. <발명의 동기> 먼저, 본 발명에서, 카나비노이드 성분은, 16가지 물질(PK-16 Reference Solutions)을 포함하며, 예를 들어, Cannabichromene (CBC), Cannabichromenic acid (CBCA), Cannabidiol (CBD), Cannabigerol (CBG), Cannabinol (CBN), Cannabidiolic acid (CBDA), Cannabigerolic acid (CBGA), Cannabinolic acid (CBNA), Cannabicyclol (CBL), Cannabidivarin (CBDV), Cannabidivarinic acid (CBDVA), Δ8-Tetrahydrocannabinol (Δ8-THC), Δ9- Tetrahydrocannabinol (Δ9-THC), Δ9-Tetrahydrocannabinolic acid (THCA-A), Tetrahydrocannabivarin (THCV), 및 Tetrahydrocannabivarinic acid (THCVA) 등의 물질을 포함하는 개념이다. 또한, 이러한 카나비노이 드 성분이 한 가지 이상 함유된 제품은 카나비노이드 제품(또는 대마 제품)으로 칭하기로 한다. 상기 카나비노이드 성분은, 대마초와 관련되며, 대마초의 의학적 이점은 수천 년 동안 동양의 의학서등에 문서 화되어 왔으며, 대마초 사용의 위험성과 이익은 수십 년 동안 논쟁되어 왔다. 2020년 12월 이후, 최근 전세계 대마초의 의료용, 레져용 완화로, 태국은 성분함량에 특별한 규제가 없는 대마초 전면개방으로, 미국, 캐나다, 유럽, 한국, 일본, 스위스 등은 THC함량에 대해 0.1~1 wt.%까지 제한을 두는 방향으로 법규제정이 진행되고 있 으며, CBD에 대해서는 THC와 달리 특별한 규제없는 방향으로 대마 마리화나 또는 헴프(hemp) 시장은 성장할 것으로 예상된다. 2022년 8월 현재 국가간 복잡한 법률과 규제가 있다. 이를 근거로 조사한 내용은 아래와 같다. 미국은 2018년 Farm Bill을 통해 헴프 합법화, 바이든 정부에서는 THC 허용 농도에 따른 마리화나 합법화를 추 진하고 있다. 캐나다는 G7 국가중 최초로 대마의 의료 및 레져용으로 허가하였으며 THC 함량에 따른 국가간 이 동제한에 촛점을 두고 있다. 영국은 THC 0.2 wt.% 이하의 식품, 화장품 사용은 허가하지만, THC 함량에 따라 수 출입은 엄격하게 제한하고 있다. 중국은 근본적으로 대마 헴프 마리화나의 이동을 금지하고 있으나 2017년 헤이 룽장성, 2018년 지린성 그 이후 CBD의 재배, 가공허가 하고 있으며 전 세계 대마관련 특허 출원을 앞장서, 향후 변화될 시장에 자국의 이익을 최우선하는 방향으로 진행하고 있다. 일본은 의료용 레져용 산업용 헴프의 재배는 불법이나 2018년 CBD 원료 수출입과 이의 가공은 허가하고 있다. 수입물품의 THC가 포함되어 있지 않은 원료에 한해 미국과 캐나다에서 제품으로 수입되고, 최근 일본내 원료가공을 통한 최종제품을 준비하고 있다. 무엇보다 노년층 수면장애에 시장을 확대하려하고 있다. 호주와 뉴질랜드는 영국과 마찬가지로 THC 0.2 wt.%이하를 2017 년 허가하여 전면합법화의 방향으로 나아가고 있다. 태국은 근본적으로 CBD 함유 대마의 수입을 금지하고 있으 나, 자국산 헴프의 수출을 권장하고 있다. 이는 한국과 비슷한 상황이지만 국가간의 거래에는 THC 0.2 wt.% 라 는 국가간 거래의 가능성은 열려있다. 최근 2022년 6월 의료용, 레져용, 식품, 화장품등 및 민간의 재배 또한전면 허가하였으며, 특히 의료용 적용은 임상을 넘어 현재 활발하게 활용되고 있다. 그러나 THC 0.2 wt.% 내의 제품의 수출입 자국내 거래로 제한되고 있다. 한국은 의료용, 레져용, 산업용 등 대부분의분야에 특별한 수치없 이 대마의 사용은 불법이며, 일부 제품이 희귀의학물로 지정되어 Isolated CBD를 사용하고 있으나 이 또한 복잡 한 절차로 실용화되지 못하고 있다. 현재 식용으로는 헴프오일내 CBD 20 ppm (0.002 wt.%), THC 10 ppm (0.001 wt.%) 이라는 엄격한 식용기준이 적용되고 있으며, 대마, 헴프, 마리화나의 수출입은 불가능한 상황이다. 일본 은 이와 반대로 대마의 국내 재배는 금지하고 있으나, CBD 수입은 허가하고 있다. 미국, 캐나다, 유럽, 등은 THC 함유 농도에 따른, 국가간 국내 이동으로 제한하고 있으며, 최초 의료용에 국한된 개발에서 일반음식 레져 용으로도 많은 시장개방이 예상되어, 식음료에 대한 성분규제 및 관리는 국가가 확보되어야 할 핵심기술로 예상 된다. 이에 따라 자국의 법을 준수하기 위해 제품을 질적, 양적으로 분석할 수 있는 절차를 수립할 필요가 있 음에도 최소 60여년간의 규제로 인하여, 카나비노이드 제품은 물론 연구를 위한 분석 물질도 국가간 이동이 제 한되어 왔다. 대마의 의료용 일반 전면 허가 (2022년 6월)된 태국도 2022년 8월 현재까지, 임상 시험이 시행되 는 상황임에도 불구하고 CBD, THC 및 이의 유도체에 대한 분석기술 및 개체와 시기, 상품, 임상결과에 대한 데 이타를 보유하지 못한 상태에 있다. CBD와 THC는 모든 카나비노이드 중에서 더 많은 관심을 받았다. 모든 카나비노이드 중 THC는 정신 활성 효과로, CBD는 정신 활성 효과가 있는 것으로 알려져 있다. THC의 진통제 효과는 CB1 수용체와의 상호작용과 관련이 있 는 반면, 면역조절 활성은 CB2 수용체와의 결합에 기인한다. 따라서, CBD의 비정신 활성은 CB1 및 CB2 수용체에 대한 낮은 친화력으로 설명될 수 있다. 대마초 생물 활성 화합물의 일종인 테르페노페놀과 가열, 산화, 이성화 를 통한 이들의 전환에 대한 연구가 진행되고 있다. 수많은 카나비노이드는 계속 증가하는 목록에서 확인되고 분류되며, 알려지지 않은 샘플에서 이러한 카나비노이드의 정확한 확인이 필요하다. 가스 크로마토그래피-질량 분광법(GC-MS)은 카나비노이드의 법의학적 분석에 종종 사용되지만, 특정 카나비노이드의 고유한 열가소성 특성 때문에 동일한 절차를 정량적 분석에 적용할 수 없다. 이 연구는 고해상도/성능 액체 크로마토그래피(HPLC)가 분해능의 손실 없이 더 빠르고 더 낮은 온도에서 정확하게 분석을 수행할 수 있음을 시사한다. 한예로 한국은 대마초와 그 제품에 대해 보수적인 접근법을 취해왔고, 그 결과 대마초 농도가 낮게 나타났다. 이에 따라 다양 한 카나비노이드 성분을 요구하는 사용자의 주문에 따라 용이하고 안전하게 카나비노이드 제품을 제공할 수 있 는 시스템을 제공하고자 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반 카나비노이드 온라인 분석과 THC-Safe 인증을 위한 시스템 을 설명하기 위한 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 시스템은, 네트워크 상에서 연동 가능한 제품 생성기, 서버 형태의 클라우드 운영 플랫폼 및 다수의 단말기를 포함한다. 여기서, 제품 생성기, 클라우드 운영 플랫폼 및 다수의 단말기 간에 연동을 위한 네트워크는, 유선 인터넷 통신이나 WiFi, WiBro 등 무선 인터넷 통신, WCDMA, LTE 등 이동통신 등을 포함하는, 유선 통신 또 는 무선 통신을 지원하는 네트워크일 수 있다. 단말기는 스마트폰, 스마트와치, 음성/영상 전화 통화가능한 웨어러블 디바이스, 테블릿 PC, 노트북 PC, 등 무선 단말을 포함하며, 이외에도 경우에 따라 데스크탑 PC, 기타 통신 전용 단말기 등 유선 단말을 포함할 수 있다. 단말기는 본 발명의 카나비노이드 제품 제공 서비스를 제공받기 위하여 사물인터넷 (IoT, Internet of Things)이 가능한 어플리케이션을 탑재할 수 있다. 클라우드 운영 플랫폼은 단말기를 통하여 본 발명의 카나비노이드 제품 제공 서비스를 제공받는 사용 자들에 대한 가입 정보를 관리하고, 단말기와 제품 생성기 간의 각종 제어나 필요한 정보의 송수신을 중계할 수 있다. 클라우드 운영 플랫폼의 중계에 따라, 사용자들이나 의사, 약사 등 전문가들은 IoT 기능 이 탑재된 어플리케이션이 탑재된 단말기를 이용하여 원격에서도 제품 요청을 전송할 수 있고, 클라우드 운영 플랫폼은 상기 제품 요청에 따라 카나비노이드 제품을 제공하도록 네트워크 상의 제품 생성기를 제어할 수 있다. 본 발명에서 제품 생성기는 약용식물로부터 추출된 대마 추출물을 복수의 칼럼에 통과시키면서 소정의 성 분 분석 테스트에 따라 클라우드 운영 플랫폼으로부터의 해당 카나비노이드 성분 정보에 상응하게 카나비 노이드 성분을 한가지 이상 포함하는 해당 컬럼의 용액을 포함하는 카나비노이드 제품을 제공하며, 상기 카나비 노이드 제품의 THC 성분의 총량이 미리 설정한 제한 기준 이하가 되도록 제어하여, 상기 카나비노이드 제품을 제공할 수 있다. 상기 THC 성분은, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA 중 하나 이상의 성분을 포함하며, 상기 THC 성 분의 총량은, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA 각각의 성분에 대하여 소정의 가중치(예, 0.1, 0.2,,,,등)를 주어 합산한 값일 수 있다. 상기 제한 기준은 국가별로 서로 다른 규제에 미리 정한 값으로서, 해당국이나 지방 등의 규정이나 세금부과 체계 등에 맞게 적절한 값으로 설정될 수 있다. 이를 위하여, 도 1과 같이, 본 발명의 클라우드 운영 플랫폼은 인증부, 성분 정보부, 통보부 , 인터페이스부, 데이터베이스를 포함할 수 있다. 클라우드 운영 플랫폼은, 하기하는 바와 같이, 성분 정보부는 상기 제품 요청에 상응하는 해당 카나 비노이드 성분 정보를 포함하는 메시지를 생성하고, 통보부는 상기 메시지를 제품 생성기로 전송할 수 있다. 이와 같은 카나비노이드 성분이 포함된 대마초의 의료 혜택을 활용하기 위하여, 본 발명은 다양한 카나비노이드 성분을 요구하는 사용자의 주문에 따라 용이하고 안전하게 카나비노이드 제품을 제공할 수 있는 시스템을 제공한다. 특히, 본 발명의 시스템은, IoT 상에서 웹 기반으로 주문에 따라 제품 생성기(100의 )인공지능형(AI) 딥 러닝 학습된 축적 데이터를 활용해, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA를 포함하는 총 THC 성분(T- THC, Total THC)이 미리 설정한 수준 이하가 되도록 분리 농축하여 카나비노이드 제품을 제공하되, HPLC(High- Performance Liquid Chromatography, 고성능 액체 크로마토그래피), LC MS-MS(LCMSMS)(Liquid Chromatography Tandem Mass Spectrometry, 액체 크로마토그래피 탠덤 질량분석법), GC-MASS (Gas Chromatograph/Mass Spectroscopy, 기체 크로마토그래피-질량분석법), NMR(Nuclear Magnetic Resonance) 등의 방법으로 총 THC 성 분에 대한 안정되고 안전한 인증(THC-Safe) 처리가 가능하도록 하였다. 이하 도 2의 흐름도를 참조하여 본 발명의 일 실시예에 따른 클라우드 운영 플랫폼을 포함한 시스템 의 동작을 설명한다. 도 2는 본 발명의 일 실시예에 따른 시스템의 클라우드 운영 플랫폼과 연동된 동작을 설명하기 위한 흐름도이다. 먼저, 사용자 단말은 본 발명의 카나비노이드 제품 제공 서비스를 제공받기 위하여 사물인터넷 (IoT)이 가 능한 어플리케이션을 탑재할 수 있다. 사용자는 사용자 단말에서 어플리케이션을 실행하여 어플리케이션 화면(예, 메뉴, 아이콘 등)을 통하여, 건강 관련 카나비노이드 제품, 예를 들어, 신경안정, 근육이완, 불면증, 진통, 간질, 류마티스, 암, 파킨스 등에 도움을 주거나 치료하기 위한 카나비노이드 제품으로서, 카나비노이드 성분에 따라 미리 목록화된 제품들의 리스트(예, 제품1, 제품2, 제품3,,,,등)에서 어느 하나를 선택함으로써 제 품 요청을 전송할 수 있다(S210). 이에 따라 클라우드 운영 플랫폼은 상기 제품 요청에 따라 카나비노이드 제품을 제공하도록 네트워크 상의 제품 생성기를 제어할 수 있다(S220, S230). 클라우드 운영 플랫폼에서, 인증부는 사용자 단말로부터의 요청(예, 아이디, 패스워드, 연락처 등 사용자 확인 정보가 포함됨)에 따라 데이터베이스를 참조해 해당 사용자 정보(예, 아이디, 패스워드, 연락처, 원인증상, 성인여부 등)에 대한 카나비노이드 제품 제공 서비스 허용여부를 결정하기 위한 사용자 인증 을 수행한다. 예를 들어, 인증부는 상기 사용자 인증을 위하여, 사용자 단말로부터의 제품 요청에 포 함된 사용자 확인정보(예, 아이디, 패스워드, 연락처 등)와 데이터베이스의 사용자 정보(예, 아이디, 패스 워드, 연락처, 원인증상, 성인여부 등) 사이의 소정의 매칭 여부를 확인하여 인증함으로써, 인증에 성공하면 카 나비노이드 제품 제공 서비스를 이용하도록 허용할 수 있다. 경우에 따라, 상기 사용자 인증을 위하여, 인증부 는 관리기관 서버와 통신으로 추가 인증을 수행할 수도 있다. 예를 들어, 관리기관은 카나비노이드 제품의 사용량을 통제하는 정부, 정부산하기관, 정부의 인가를 받은 사립기관 등 외부 기관일 수 있고 인증을 위한 서 버를 운영할 수 있으며, 인증부는 공인인증서 등 소정의 인증서를 이용하여 관리기관 서버에서의 인증을 통과할 수 있다. 이와 같은 상기 사용자 인증이 이루어진 후, 클라우드 운영 플랫폼에서, 성분 정보부는 상기 제품 요 청에 상응하는 해당 카나비노이드 성분 정보를 포함하는 메시지를 생성한다(S220). 상기 제품들의 리스트(예, 제품1, 제품2, 제품3,,,,등)에 있는 각 제품에 대한 해당 카나비노이드 성분 정보, 즉, 상기한 다양한 성분들의 비율(예, wt.% 등)은 데이터베이스에 저장 유지되어 있을 수 있으며, 이를 참조하여, 성분 정보부는 해당 카나비노이드 성분 정보를 포함하는 메시지를 생성할 수 있다. 통보부는 소정의 모뎀 등을 통해 상기 메시지를 제품 생성기로 전송할 수 있다(S230). 본 발명에서 제품 생성기는 약용식물로부터 추출된 대마 추출물을 복수의 칼럼에 통과시키면서 소정 의 성분 분석 테스트에 따라 클라우드 운영 플랫폼으로부터의 해당 카나비노이드 성분 정보에 상응하게 카 나비노이드 성분을 한가지 이상 포함하는 해당 컬럼의 용액을 포함하는 카나비노이드 제품을 제공하며, 상기 카 나비노이드 제품의 THC 성분의 총량이 미리 설정한 제한 기준 이하가 되도록 제어하여, 상기 카나비노이드 제품 을 제공할 수 있다(S240). 이를 위해, 제품 생성기의 분석 및 측정 장치는, 복수의 칼럼 각각의 배출구에 마련된 밸브의 개폐를 통해 배출되는 각각의 용액에 대한 상기 성분 분석 테스트에 따라 불순물이 제거되어 하나 이상의 카나 비노이드 성분에 대한 소정의 농도 기준을 만족하는 목표 용액을 용기에 담기도록 해당 컬럼의 배출구에 마련된 밸브의 개폐를 제어해 해당 카나비노이드 제품을 제공할 수 있다. 상기 분석 및 측정 장치는, 상기 성분 분석 테스트에서 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비에서 출력되는 성분 분석 결과 정보에 대해, 테스트셋의 학습된 결과에 따라 획득한 학습 정보를 참조하여, 하나 이상의 카나비노이드 성분을 추정하는 학습부를 구비할 수 있다. 또한, 사용자는 사용자 단말을 통해 상기 제품 요청 시에, 추가적으로 상기 제품 요청에 수면상태, 혈당, 또는 스트레스 지수를 포함하는 사용자 추가 정보를 추가할 수 있으며, 이에 따라 상기 사용자 추가 정보가 상 기 메시지에 포함되며, 이때, 제품 생성기는, 상기 사용자 추가 정보에 대응된 카나비노이드 성분별 농도 에 상응하는 하나 이상의 카나비노이드 성분이 포함된 상기 카나비노이드 제품을 제공할 수 있다. 상기 카나비 노이드 제품은 미리 정해진 전체 양(부피)에 대해 다수 카나비노이드 성분이 각각 미리 정해진 양만큼의 농도로 포함될 수 있는 것이다. 인터페이스부는 사용자의 제품 요청에 따라 제품 생성기로 생산한 각 카나비노이드 제품의 생산 이력 을 데이터베이스에 관리하여 데이터를 누적해 나간다. 인터페이스부는 사용자 단말 등을 통한 통계 요구에 따라 생산된 일자별, 제품별 카나비노이드 제품의 이력을 분석하여 통계 정보를 제공할 수도 있다. 예를 들어, 각 카나비노이드 제품에 대한 섭취횟수(예, 하루 3번 섭취시 5일, 10일, 한달 등)에 대한 효과(예, 상, 중, 하 등) 등의 통계 정보를 제공할 수 있다. 통계 정보는 막대그래프 등으로 그래피컬하게 표시되도록 제 공될 수 있다. 나아가, 후술하는 바와 같이, 인터페이스부는 학습부를 구비할 수 있으며, 상기 성분 분석 테스트에서 상기 분석 및 측정 장치로부터 함량 정보의 요청이 있는 경우, 상기 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비에서 출력되는 성분 분석 결과 정보에 대해, 테스트셋의 학습된 결과에 따라 획득한 학습 정보(학 습 모델)를 참조하여, 하나 이상의 카나비노이드 성분을 추정하고 추정된 결과를 상기 분석 및 측정 장치 로 전송할 수도 있다. 나아가, 후술하는 바와 같이, 분석 및 측정 장치는, 제공되는 상기 카나비노이드 제품에 대한 총 THC 성분 에 대한 인증(THC-Safe) 요구에 따라, 상기 카나비노이드 제품을 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비 중 하 나이상으로 전달해, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA를 포함하는 THC 성분의 총량을 결정하기 위한 성분 분석이 이루어지도록 상기 장비를 제어하여, 상기 THC 성분의 총량이 소정의 규제 기준 이하인 경우, 해당 카나비노이드 제품에 대한 적합 인증에 대한 정보(THC 성분의 총량이 규제 기준 이하로서 작합한 제품임을 인증 하는 정보)를 출력할 수 있다(S250). 이하 본 발명의 일 실시예에 따른 제품 생성기에 대하여 도 5를 참조하여 좀 더 자세히 설명한다. 도 3은 본 발명의 일 실시예에 따른 제품 생성기의 개략적인 도면이다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 카나비노이드 성분을 포함하는 목표 용액을 갖는 카나비노이드 제품을 획득하기 위한 제품 생성기는, 대마 추출물 유입구, 직렬형 연속 공정을 위한 복수의 칼럼(또 는 흡착탑), 분석 및 측정 장치, 및 저장 용기들을 포함한다. 소정의 추출 장비는, 약용식물로부터 카나비노이드 성분을 포함하는 대마 추출물을 획득하여, 대마 추출물 유입 구로 제공할 수 있다. 여기서, 약용 식물은 헴프, 캐나비스, 삼, 마황, 마자, 마분, 마발, 마인, 마엽, 또 는 마근 등 대마 성분 또는 카나비노이드 성분을 추출 가능한 식물이다. 카나비노이드 성분으로서, 위에서도 기 술한 바와 같이 THC (tetrahydrocannabinol), CBD (cannabidiol), CBG (cannabigerol) 등 다양한 성분이나 유 도체들을 포함하며, 상술한 16가지 물질(PK-16 Reference Solutions) 중 한가지 이상의 물질이나 기타 카나비노 이드 성분을 포함할 수 있다. 상기 추출 장비로서, 초임계이산화탄소추출법, 용매추출법, 고압추출법 등을 통해 카나비노이드 성분을 포함하는 대마 추출물을 획득할 수 있는 장비가 이용될 수 있다. 예를 들어, 제품 생성기는, 상기 약용식물의 잎, 꽃, 뿌리, 줄기, 또는 씨앗 중 하나 이상을, 직경 5mm 이 하로 파쇄하고 초임계 추츨 방식(초임계이산화탄소추출법)으로 추출한 추출 용액과 소정의 희석 용제(PK0)와의 혼합물인 상기 대마 추출물을 이용하되, 상기 추출 용액에 대하여 상기 희석 용제(PK0)의 비율이 0~10,000 배로 희석되며, 상기 분석 및 측정 장치를 통해 불순물이 포함된 상기 대마 추출물에 대한 상기 성분 분석 테스 트가 가능하다. 상기 희석 용제(PK0)로서 에틸알콜 함량이 0~80wt.%; 포도씨유, 식용유, 팜유, 코코넛유, 참기름, 들기름, 유칼립튜스유, 헴프씨드유 중 하나 이상의 합이 0~5wt.%; 및 증류수가 15~100wt.% 되도록 혼합한 용액을 이용하고, 온도 25~270oC 에서 5초 ~ 30분 및 1~10기압 조건으로 상기 대마 추출물을 전처리하여 이용할 수 있다. 이때 상기 약용 식물이 상기 씨앗 중 껍질이 있는 씨앗의 경우, 표면의 THC, CBN, CBC, 또는 CBL 중 하나 이상 이 포함된 카나비노이드 유효 성분을 선별적으로 제거하기 위하여, 파쇄 없이 원씨앗 그대로를 에틸알콜 함량이 20wt.% 이상 포함된 증류수에 넣고, 온도 35oC 이상에서 5 초 ~ 30분 및 1~10 기압 조건에서 노출시킨 후, 건조 후 상기 파쇄를 통해 상기 초임계 추츨 방식 등으로 상기 대마 추출물의 획득에 이용될 수 있다. 또한, 제품 생성기는, 소정의 제어장치를 통해, 상기 전처리 후에 발생된 상기 대마 추출물 이외의 용출물 에 포함된, 카나비노이드 성분, 미생물, 중금속 이온, 흙, 뿌리 잔여물, mycotoxin, 및 부유물이 혼합된 액 상을, 원심분리방식(예, 400 RPM 회전 이상) 또는 가압방식으로 필터링하거나, 또는 중력여과방식에 의해 고 액분리하도록 제어하여, 생성된 단백질, 탄수화물, 유효지방 및 카나비노이드 성분을 포함하는 유효성분을 재활용하도록 해당 생성 물질을 소정의 재활용 용기로 이송할 수 있다. 또한, 제품 생성기는, 상기 재활용 용기의 상기 생성 물질에 존재할 수 있는 상기 카나비노이드 성분, 미생물, 중금속 이온을 안전하게 분리 제 거하고, 잔여물은 폐기하도록 제어할 수도 있다. 복수의 칼럼은, 가늘고 긴 튜브 형태의 칼럼들을 복수개 직렬 연결하여 유입구로부터의 상기 카나비노 이드 성분을 포함하는 대마 추출물을 통과시켜 연속 공정이 이루어지도록 구성된다. 즉, 도면과 같이, 각 칼럼 의 배출구에서 다음 인접 칼럼의 유입구로 유체 소통관(또는 파이프)에 의해 연결되고, 마지막 최종 칼럼 의 배출구는 시작점 최초 칼럼의 유입구로 해당 유체 소통관에 의해 연결되어 대마 추출물을 순환시켜 각 칼럼 에서의 흡착 등 과정이 반복 가능하도록 구성된다. 유입구는 최초 칼럼과 유체 소통관으로 연결되며, 유입구는 유체 흐름의 개폐를 위한 밸브를 포함할 수 있다. 최초 칼럼과 최종 칼럼 사이를 포함하여, 각 칼럼의 배출구에서 다음 인접 칼럼의 유입구 사이에는, 필요에 따라 유체 흐름의 개폐를 위한 각각의 밸브가 구비될 수도 있다. 또한, 각 칼럼의 배출구에서 분석 및 측정 장치 간에도 필요에 따라 유체 흐름의 개폐를 위한 각각의 밸브가 구비될 수 있고, 각 칼럼 의 배출구에서 각각의 저장 용기로 필요에 따라 해당 물질이 흘러 저장될 수 있도록 유체 흐름의 개폐를 위한 각각의 밸브가 구비될 수 있다. 유입구로부터의 상기 카나비노이드 성분을 포함하는 대마 추출물은, 유입구의 밸브의 열림에 따라 복수 의 칼럼의 최초 칼럼으로부터 최종 칼럼까지 차례로 통과한다. 최종 칼럼의 배출구에서 최초 칼럼으로 용 액을 순환시킬 수도 있다. 복수의 칼럼에서의 원활한 용액 흐름을 위하여, 소정의 압축기를 이용하여 복수 의 칼럼의 어느 한 칼럼과 인접 칼럼 사이(필요시 복수 위치 가능)의 유체 소통관을 통하여 압력을 인가할 수 있다. 예를 들어, 각 칼럼에 1-300기압이 가해지도록, 헬리컬기어와 스테핑 모터를 이용하여 피스톤의 움직임을 정밀하게 제어하는 방식으로, 압력을 인가할 수 있는 압축기를 이용할 수 있다. 기타 다양한 다른 방 식의 압축기가 사용될 수 있다. 이와 같은 복수의 칼럼 각각에서의 용액 통과에 따라, 상기 카나비노이드 성분을 포함하는 대마 추출물의 불순물을 각 칼럼의 충진물(예, 중공사막형, 팰랫충진형, 용액충진형, 표면처리형 등의 충진물)에서의 흡 수, 흡착 및 확산의 속도차를 이용해, 해당 칼럼에서의 상기 PK-16 Reference Solutions 중 하나 이상의 성분이 포함된 물질(제품)을 출력하게 된다. 상기 흡수, 흡착 및 확산의 속도차에는 분자량 차이 및 극성과 비극성에 따른 용해도 차이 등이 이용되도록 충진물이 선택될 수 있다. 예를 들어, 제품 생성기는, 상기 대마 추출물을 활성탄, 알루미나, 감마알루미나, 실리카등으로 충진된 상기 복수의 칼럼에서 소정의 흡착시간 (예, 1분 ~ 60분)과 속도 (예, 1 micro cc/s~100cc/s)로 통과 속도를 조절하여, 소정의 토출시간에 따라 상기 카나비노이드 성분(CBD 성분, THC성분 등)을 한가지 이상 포함 하는 상기 카나비노이드 제품을 분리해 제공할 수 있다. 즉, 상기 복수의 칼럼 각각이 하나의 카나비노이 드 제품이 될 수도 있고, 복수의 칼럼에서 출력되는 물질(제품)을 혼합하여 클라우드 운영 플랫폼으로부터의 해당 카나비노이드 성분 정보에 상응하게 카나비노이드 성분을 한가지 이상 포함하는 해당 컬럼의 용 액을 포함하는 카나비노이드 제품을 생산할 수 있다. 분석 및 측정 장치는, 복수의 칼럼의 각 칼럼의 배출구에 장착된 밸브(미도시)를 통해 배출된 일부 용액에 대하여, 클라우드 운영 플랫폼으로부터의 해당 카나비노이드 성분 정보에 상응하게 카나비노이드 성분을 한가지 이상 포함하도록 카나비노이드 제품을 생산하도록, 해당 목표 용액에 도달하였는지 여부에 대한 성분 분석 테스트를 수행한다. 여기서, 성분 분석 방법으로서, HPLC(High-Performance Liquid Chromatography, 고성능 액체 크로마토그래피), LC MS-MS(LCMSMS)(Liquid Chromatography Tandem Mass Spectrometry, 액체 크로 마토그래피 탠덤 질량분석법), 및 GC-MASS (Gas Chromatograph/Mass Spectroscopy, 기체 크로마토그래피-질량 분석법) 등이 이용될 수 있다. 분석 및 측정 장치에서의 상기 테스트에 따라, 제품 생성기는, 상기 목표 용액에 도달한 각 칼럼의 배출구의 해당 밸브(미도시)를 통해 상기 목표 용액을 배출하여 저장 보관하고 관리할 수 있다. 특히, 상술한 16가지 물질(PK-16 Reference Solutions) 중 한가지 이상의 물질을 포함하는 미리 정해진 목표 용액이 복수의 칼럼의 각 칼럼의 배출구를 통해 배출될 수 있고 저장 용기에 저장될 수 있다. 즉, 상기 대마 추출물 을 복수의 칼럼에 통과시키면서 불순물을 흡수, 흡착, 확산의 속도차를 이용해, 복수의 칼럼 각각에 서 또는 그들을 혼합하여 필요한 목표 용액이 각 칼럼의 배출구를 통해 배출될 수 있고 저장 용기에 저장 될 수 있다. 상기 복수의 칼럼 각각이 하나의 카나비노이드 제품이 될 수도 있고, 복수의 칼럼에서 출력되는 물질 (제품)을 혼합하여 클라우드 운영 플랫폼으로부터의 해당 카나비노이드 성분 정보에 상응하게 카나비노이 드 성분을 한가지 이상 포함하는 해당 컬럼의 용액을 포함하는 카나비노이드 제품을 생산할 수 있다. 이와 같은 방법으로 분석 및 측정 장치에서 생산되는 카나비노이드 제품 역시, 제품 생성기는, 저장 용기에 저장 보관하고 저장 용기에 포장 번호가 트래킹되도록 포장하여 관리할 수도 있다. 이와 같이, 본 발명에 따른 카나비노이드 추출을 위한 연속 분리 및 측정을 수행하는 제품 생성기는, THC, CBD 또는 CBG 등의 건강 증진을 보조하는 카나비노이드 제품을 안정적으로 획득할 수 있도록 한다. 이와 같은, 본 발명에서 제품 생성기는 약용식물로부터 추출된 대마 추출물을 복수의 칼럼에 통과시 키면서 소정의 성분 분석 테스트에 따라 클라우드 운영 플랫폼으로부터의 해당 카나비노이드 성분 정보에 상응하게 카나비노이드 성분을 한가지 이상 포함하는 해당 컬럼의 용액을 포함하는 카나비노이드 제품을 제공하 며, 상기 카나비노이드 제품의 THC 성분의 총량이 미리 설정한 제한 기준 이하가 되도록 제어하여, 상기 카나비 노이드 제품을 제공할 수 있다(S240). 이를 위해, 제품 생성기의 분석 및 측정 장치는, 복수의 칼럼 각각의 배출구에 마련된 밸브의 개폐를 통해 배출되는 각각의 용액에 대한 상기 성분 분석 테스트에 따라 불순물이 제거되어 하나 이상의 카나 비노이드 성분에 대한 소정의 농도 기준을 만족하는 목표 용액을 용기에 담기도록 해당 컬럼의 배출구에 마련된 밸브의 개폐를 제어해 해당 카나비노이드 제품을 제공할 수 있다. 특히, 상기 분석 및 측정 장치는, 상기 성분 분석 테스트에서 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비에서 출력되는 성분 분석 결과 정보에 대해, 테스트셋의 학습된 결과에 따라 획득한 학습 정보를 참조하여, 하나 이 상의 카나비노이드 성분을 추정하는 학습부를 구비할 수 있다. 예를 들어, 상기 학습부는, HPLC, LCMSMS, GC-MASS, 또는 NMR 장비의 성분 분석 결과 정보(예, 도 4의 크로마토 그램, 도 5의 스펙트럼 등 이미지)에 대한 학습 정보를 참조하여, 각 용액 물질에 포함된 하나 이상의 카나비노 이드 성분을 추정할 수 있다. 예를 들어, 학습부는, 제조 현장 등에서 입수된 테스트용 성분 분석 결과 정보(크 로마토그램, NMR 스펙트럼 등의 그래프 정보 등), 및 HPLC 장비 등에서의 이동상들의 속도, 압력, 칼럼의 종류, 온도를 포함하는 분석조건과, 정답 카나비노이드 성분(해당 성분 분석 결과 정보에 대한 함량 정보)에 대한 테 스트셋을 입력받아, 심층신경망(예, CNN, Convolutional Neural Network)를 이용하여, 상기 분석 조건 및 상기 테스트 성분 분석 결과 정보에서의 피크의 개수, 각 피크의 위치와 높이(세기), 각 피크의 중심에서의 피크의 폭 등의 파라미터에 대응된 카나비노이드 성분을 추정하는 학습 모델을 학습시킬 수 있다. 이와 같은 심층신경 망을 이용한 딥러닝은 수백 내지 수천회 이상 학습하는 과정을 포함할 수 있다. 학습부는 학습된 상기 학습 모 델(학습 정보)을 이용하여, 즉, 학습된 결과에 따라 획득한 학습 정보를 참조하여, 비교 분석함으로써 해당 물 질에 포한된 카나비노이드 성분을 추정할 수 있다. 이와 같은 상기 학습부의 기능은 클라우드 운영 플랫폼의 인터페이스부에서 수행될 수도 있다. 예를 들어, 상기 분석 및 측정 장치는, 상기 성분 분석 테스트에서 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비에서 출력되는 성분 분석 결과 정보를 인터페이스부로 전송하여 함량 정보를 요청할 수 있으며, 인터페이스부 는 상기와 같이 작동되는 학습부를 구비할 수 있으며, 상기 함량 정보 요청에 응답하여, 상기 학습부애서 테스트셋의 학습된 결과에 따라 획득한 학습 정보를 참조하여, 비교 분석함으로써 하나 이상의 카나비노이드 성 분을 추정하고, 추정된 카나비노이드 성분에 대한 정보를 상기 분석 및 측정 장치로 전송할 수도 있다. 또한, 분석 및 측정 장치는, 제공되는 상기 카나비노이드 제품에 대한 총 THC 성분에 대한 인증(THC-Safe) 요구에 따라, 상기 카나비노이드 제품을 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비 중 하나이상으로 전달해, Δ9- THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA를 포함하는 THC 성분의 총량을 결정하기 위한 성분 분석이 이루어지도 록 상기 장비를 제어하여, 상기 THC 성분의 총량이 소정의 규제 기준 이하인 경우, 해당 카나비노이드 제품에 대한 적합 인증에 대한 정보를 출력할 수 있다(S250). 여기서도 상기 분석 및 측정 장치는, 자체 또는 클 라우드 운영 플랫폼의 인터페이스부에 구비된 학습부를 이용해, 상기 성분 분석을 위한 테스트에서 HPLC, LCMSMS, GC-MASS, 또는 NMR 장비에서 출력되는 성분 분석 결과 정보에 대해, 테스트셋의 학습된 결과에 따라 획득한 학습 정보를 참조하여, 해당 제품에 대한 하나 이상의 카나비노이드 성분을 추정할 수 있다. 도 4는 본 발명의 제품 생성기의 각 칼럼의 용액에 대하여 HPLC 장비로 성분 분석한 크로마토그램의 예이 다. 도 4를 참조하면, Isocratic Perkin-Elmer 300 series HPLC-PDA 장치(검출기 흡수파장 228nm)를 이용한 방법으 로 검출된 카나비노이드 성분들을 나타내는 크로마토그램의 예를 나타내었다. 도 4는 본 발명의 상기한 16가지 물질(PK-16 Reference Solutions)에 대해 PEP(PerkinElmer Protocol) 방법(각 성분 50mg/l 사용)을 교정한 본 발명의 PKP(PerkinElmer-Korea University Protocol) 방법(각 성분 25mg/l)으로 검출된 크로마토그램의 예이다. 도 4와 같이, 상기 카나비노이드 성분으로서, 상기 16가지 물질(PK-16 Reference Solutions)이 포함된 시료들에 서, 머무름 시간 (Retention time)에 따라 다음 순서로 순차로, 성분 1) ~ 16)이 검출될 수 있다. 이는 소프트 웨어로 Perkin Elmer LC 300 HPLC-PDA(컬럼: Perkin Elmer Quasar SPP C18 컬럼, 150Х3.0 mm, 2.6 μm)를 보 정하기 위해 미국 Cayman Chemical, USP 16개의 카나비노이드 모노그래프 기준 성분들로 참조된 것이다. 교정 과정에 사용된 16개의 카나비노이드의 존재를 확인하고 정량화하도록 본 발명의 PK-16 Reference Solutions으로 반복 교정되었다. Perkin Elmer는 대부분의 분석 요구사항에 적합한 검증된 보정 절차를 제공한다. 그러나, 대 마초 규제와 본 발명에서 시료의 고유성 때문에 더 낮은 카나비노이드 농도에 초점을 맞춘 구체적인 교정절차가 필요했다. 낮은 카나비노이드 농도를 교정 수준에서 수용하면 획득된 분석 결과를 쉽게 확인할 수 있다. 도면들 에서 아래 성분들의 표시는 각각의 도면 기호로 표시되어 있다. 1) Cannabidivarinic acid (CBDVA) (도면 기호 ◀) 2) Cannabidivarin (CBDV) (도면 기호 ◁) 3) Cannabidiolic acid (CBDA) (도면 기호 ◆) 4) Cannabigerolic acid (CBGA) (도면 기호 +) 5) Cannabigerol (CBG) (도면 기호 ±) 6) Cannabidiol (CBD) (도면 기호 ◇) 7) Tetrahydrocannabivarin (THCV) (도면 기호 ■) 8) Tetrahydrocannabivarinic acid (THCVA) (도면 기호 □) 9) Cannabinol (CBN) (도면 기호 =) 10) Cannabinolic acid (CBNA) (도면 기호 *) 11) △9-Tetrahydrocannabinol (△9-THC) (도면 기호 ●) 12) △8-Tetrahydrocannabinol (△8-THC) (도면 기호 ◑) 13) Cannabicyclol (CBL) (도면 기호 #) 14) △9-Tetrahydrocannabinolic acid (THCA-A) (도면 기호 ○) 15) Cannabichromene (CBC) (도면 기호 X) 16) Cannabichromenic acid (CBCA) (도면 기호 -) 이와 같은 HPLC(High-Performance Liquid Chromatography, 고성능 액체 크로마토그래피) 외에도, 분석 및 측정 장치에서의 상술한 본 발명의 16가지 성분(PK-16 Reference Solutions) 중 한가지 이상의 성분을 포함하는 물질의 성분 분석을 위해, LC MS-MS(LCMSMS)(Liquid Chromatography Tandem Mass Spectrometry, 액체 크로마토 그래피 탠덤 질량분석법), 및 GC-MASS (Gas Chromatograph/Mass Spectroscopy, 기체 크로마토그래피-질량분석 법), NMR 등의 분석 방법이 이용될 수 있다. 분석 및 측정 장치에서의, 예를 들어, HPLC의 정성분석은, 머무름 시간 (Retention time)에 의한 방법, 검 출기의 감응에 의한 확인법 등을 포함할 수 있다. 예를 들어, 상기 머무름 시간 (Retention time)에 의한 방법 은, 머무름 시간이 주어진 실험조건에서 이동상과 고정상에 따른 특성이므로 이를 화학물질을 확인하는데 이용 하는 방법이다. 즉 동일한 HPLC 등의 크로마토그래피 조건에서 미지의 물질과 표준 물질의 머무름 시간을 비교 하는 방법이다. 또 다른 방법으로는 상대적인 머무름 시간에 의한 방법이다. 이것은 분석하고자하는 성분과 표 준 물질의 머무름 시간의 비를 이용하는 방법으로 보다 정확한 값을 가지고 있다. 또 다른 방법은 두가지 이상 의 컬럼에 대한 머무름시간을 표준물질과 함께 비교하는 방법이다. 분석 및 측정 장치에서의, 예를 들어, HPLC의 검출기의 감응에 의한 확인법은, 일정한 조건에서 두 개 이 상의 서로 다른 검출기를 사용하여 화학물질의 특성을 비교하는 방법이다. 시료를 한컬럼에서 용출시켜 첫 번째 검출기를 통과시키고 난 후에 제2의 검출기에서 다시 확인하는 방법이다. 그러나 다이오드어레이(Diode-array detector)를 사용하는 경우에는 시료성분에 대한 각 피크에 대한 특이한 가시광선-자외선 흡수스펙트럼을 확인 할 수 있기 때문에 제2의 검출기를 사용하지 않고도 확인이 가능하다. 분석하고자하는 물질이 특이적인 자외선 흡수를 하지 않는 경우는 유도체를 만들어 확인할 수도 있다. 분석 및 측정 장치에서의, 예를 들어, 정량 분석은 내부표준법, 외부표준법, 표준물질 첨가법 등을 포함할 수 있다. 예를 들어, 상기 내부표준법은, 상대적 또는 간접적인 방법으로 시료와 표준물질과의 농도비를 적절히 여러 개로 만들어 분석하고 피크넓이의 비와 농도비를 이용하여 검량선을 만든 다음 내부표준물질을 일정량 정 확하게 미지시료에 넣은 후 추출 분석을 한다. 이때 넓이의 비를 측정하고 검량선 위에서 미지시료와 표준물질 의 농도비를 구할 수 있다. 일정량의 내부표준물질을 첨가하였으므로 미지물질의 양을 쉽게 계산할 수 있다. 이 방법의 장점은 주입된 표준물질의 양을 정확히 측정할 필요가 없고 검출기의 반응이 변하더라도 넓이의 비에는 영향을 미치지 않는다는 것이다. 상기 외부표준법은, 표준물질 시액을 정확한 양 주입한 후 얻은 피크의 넓이를 농도에 따라 표시하여 검량선을 만들고 미지시료를 정확한 양 주입하여 피크넓이를 측정한 후 검량선으로부터 시료성분의 양을 계산하는 방법이 다. 이 방법은 주입된 시료의 양을 정확히 알아야 하고 검출기의 감도가 분석할 때마다 다르기 때문에 항상 새 로운 검량 곡선을 만들 필요가 있다. 상기 표준물질 첨가법은, 외부표준법과 내부표준법의 복합이다. 최적조건에 시료를 분석하고 난 후 시료에 일정 량의 정량할 표준물질을 넣어 준 후 다시 분석한다. 이들 피크의 면적으로부터 성분의 농도를 구할 수 있다. 도 5는 본 발명의 제품 생성기의 각 칼럼의 용액에 대하여 NMR 장비로 성분 분석한 스펙트럼의 예이 다. 도 5를 참조하면, 제품 생성기의 분석 및 측정 장치에서의 NMR 장비의 분광 분석을 통한 성분분석 테 스트를 통해 Cannabidiol (CBD)의 화학적 이동(ppm)에 대한 수소원자들의 피크들을 나타내었다. 상기 NMR 장비의 분광 분석은, 자기장 속에 놓인 분자 내의 원자핵이 특정 주파수의 전자기파와 공명하는 현상 을 이용하여 분자의 구조를 결정하는 분석 방법이다. 여기서 분석 대상 원자핵들은 스핀운동이 가능한 핵들로서, 주로 1H, 13C, 15N, 29Ni 등을 대상으로 한다. 이와 같은 방식으로 상기한 16가지 성분(PK-16 Reference Solutions) 등의 성분 결정이 이루어질 수 있다. 도 6은 본 발명의 일 실시예에 따른 인공지능 기반 카나비노이드 분석과 THC-Safe 인증을 위한 시스템의 각 장치의 구현 방법의 일례를 설명하기 위한 도면이다. 도 6을 참조하면, 본 발명의 일 실시예에 따른 시스템의 클라우드 운영 플랫폼, 제품 생성기 또 는 분석 및 측정 장치 등 각 장치는, 하드웨어, 소프트웨어, 또는 이들의 결합으로 이루어질 수 있다. 예 를 들어, 상기 각 장치는 위와 같은 기능/단계/과정들을 수행하기 위한 적어도 하나의 프로세서를 갖는 도 6과같은 컴퓨팅 시스템 또는 인터넷 상의 서버 형태로 구현될 수 있다. 컴퓨팅 시스템은 버스를 통해 연결되는 적어도 하나의 프로세서, 메모리, 사용자 인터 페이스 입력 장치, 사용자 인터페이스 출력 장치, 스토리지, 및 네트워크 인터페이스 를 포함할 수 있다. 프로세서는 중앙 처리 장치(CPU) 또는 메모리 및/또는 스토리지에 저장 된 명령어들에 대한 처리를 실행하는 반도체 장치일 수 있다. 메모리 및 스토리지는 다양한 종류의 휘발성 또는 불휘발성 저장 매체를 포함할 수 있다. 예를 들어, 메모리는 ROM(Read Only Memory) 및 RAM(Random Access Memory)을 포함할 수 있다. 또한, 네트워크 인터페이스는 스마트폰, 노트북 PC, 데스크탑 PC 등 사용자 단말에서의 유선 인터넷 통신 이나 WiFi, WiBro 등 무선 인터넷 통신, WCDMA, LTE, 5G 등 이동통신을 지원하는 모뎀 등의 통신 모듈이나, 근 거리 무선 통신 방식(예, 블루투스, 지그비, 와이파이 등)의 통신을 지원하는 모뎀 등의 통신모듈을 포함할 수 있다. 따라서, 본 명세서에 개시된 실시예들과 관련하여 설명된 방법 또는 알고리즘의 단계는 프로세서에 의해 실행되는 하드웨어, 소프트웨어 모듈, 또는 그 2 개의 결합으로 직접 구현될 수 있다. 소프트웨어 모듈은 RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터, 하드 디스크, 착탈형 디스크, CD-ROM과 같이 컴퓨터 등 장치로 판독 가능한 저장/기록 매체(즉, 메모리 및/또는 스토리지)에 상 주할 수도 있다. 예시적인 저장 매체는 프로세서에 커플링되며, 그 프로세서는 저장 매체로부터 정 보(코드)를 판독할 수 있고 저장 매체에 정보(코드)를 기입할 수 있다. 다른 방법으로, 저장 매체는 프로세서 와 일체형일 수도 있다. 프로세서 및 저장 매체는 주문형 집적회로(ASIC) 내에 상주할 수도 있다. ASIC는 사용자 단말기 내에 상주할 수도 있다. 다른 방법으로, 프로세서 및 저장 매체는 사용자 단말기 내에 개별 컴포 넌트로서 상주할 수도 있다. 상술한 바와 같이, 본 발명에 따른 시스템은, IoT 상에서 웹 기반으로 주문에 따라 제품 생성기의 인공지능형(AI) 딥러닝 학습된 축적 데이터를 활용해, Δ9-THC, Δ8-THC, THCA-A, CBGA, CBN, CBNA를 포함하는 총 THC 성분(T-THC, Total THC)이 미리 설정한 수준 이하가 되도록 분리 농축하여 해당 카나비노이드 제품을 용 이하게 제공할 수 있으며, 필요에 따라 요구된 카나비노이드 제품에 대하여 HPLC, LCMSMS, GC-MASS, NMR 등의 방법으로 총 THC 성분에 대한 안정되고 안전한 인증(THC-Safe) 처리가 가능하다. 이상과 같이 본 발명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 의해 설명되 었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정되 는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나 지 않는 범위에서 다양한 수정 및 변형이 가능할 것이다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모 든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0118260", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는 첨부도면은, 본 발명에 대한 실시예를 제공하 고 상세한 설명과 함께 본 발명의 기술적 사상을 설명한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반 카나비노이드 온라인 분석과 THC-Safe 인증을 위한 시스템 을 설명하기 위한 도면이다. 도 2는 본 발명의 일 실시예에 따른 시스템의 클라우드 운영 플랫폼과 연동된 동작을 설명하기 위한 흐름도이다. 도 3은 본 발명의 일 실시예에 따른 제품 생성기의 개략적인 도면이다. 도 4는 본 발명의 제품 생성기의 각 칼럼의 용액에 대하여 HPLC 장비로 성분 분석한 크로마토그램의 예이다. 도 5는 본 발명의 제품 생성기의 각 칼럼의 용액에 대하여 NMR 장비로 성분 분석한 스펙트럼의 예이다. 도 6은 본 발명의 일 실시예에 따른 인공지능 기반 카나비노이드 분석과 THC-Safe 인증을 위한 시스템의 각 장치의 구현 방법의 일례를 설명하기 위한 도면이다."}
