{"patent_id": "10-2022-0159730", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0077313", "출원번호": "10-2022-0159730", "발명의 명칭": "실시간 시스템 및 서비스의 부하 인공지능 예측 및 장애판별 방법 및 시스템", "출원인": "(주)인포플라", "발명자": "최인묵"}}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "중앙 서버 및 부하 서버를 포함하는 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법으로서,부하 서버의 개별 시스템의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상에서 데이터를 수집하는 단계;수집된 데이터를 기초로 부하 서버에서 현재 데이터를 학습하고 미래 데이터를 예측하는 단계; 수집된 데이터를 기초로 부하 서버에서 장애탐지를 학습하고 장애를 예측하는 단계; 및웹소켓을 통해 실시간 데이터 및 미래예측 데이터를 중앙 서버로 송신하는 단계;를 포함하고, 상기 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크,네트워크, 및 어플리케이션 중 하나 이상의 미래 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 LSTM신경망 학습을 통해 상기 시스템의 현재 시점 이후의 미래 데이터를 예측하는, 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 복수의 n개의 입력 데이터 및 복수의 n개의 예측출력 데이터를 학습 데이터 세트로 하여 LSTM 신경망 학습을 통해 미래 데이터를 예측하도록 학습시키며, 미래데이터의 예측을 위한 이터레이션(iteration)을 1 회만 수행하고 1 에포크(epoch)가 1 이터레이션이 되도록 하여서, 복수의 n개의 데이터를 입력으로 하여 한번에 복수의 n개의 예측 데이터를 출력시키도록 하는 것을 포함하는, 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 수집된 데이터를 기초로 부하 서버에서 장애탐지를 학습하고 장애를 예측하는 단계는 장애탐지(AnomalyDetection)을 위해서 딥러닝의 비지도학습인 오토인코더를 사용하여 입력값과 출력값이 동일하도록 학습시키고,특정 입력값을 입력하여 예측 출력값이 상기 입력값과 다른 경우 장애로 인식하게 하는 것을 포함하는,실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 수집된 데이터를 기초로 부하 서버에서 장애탐지를 학습하고 장애를 예측하는 단계는 입력데이터셋이 n개(1 ~ n)의 경우 출력예측값도 동일 수량이 출력(1’ ~ n’)하게 하고, 해당 출력값의 오차값(입력값-출력값)의평균 절대값을 구하고, 각 출력값에서 평균을 뺀 값중에서 최대 절대값을 오차로 구하여, 입력데이터세트의 다음 n개(2 ~ n+1)에 대한 출력예측값(2’ ~ n+1’)에서 평균을 뺀 오차 절대값이 최대오차 절대값을 넘어간다면장애로 판단하는 방식으로, 실시간으로 변화하는 직전 n개의 데이터변화를 반영하여 최근 새로운 1개의 데이터공개특허 10-2024-0077313-3-가 추가되었을 때의 변화를 감지하고 상기 변화를 장애로 판단하는,실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항 내지 제4 항 중 어느 한 항에 따른 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법을 실행하도록프로그래밍된 프로그램을 저장한 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "실시간 시스템 및 서비스의 부하 엣지 컴퓨팅 온라인 학습 시스템으로서,중앙 서버 및 부하 서버를 포함하고,상기 부하 서버는부하인 개별 시스템의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 데이터를 수집하는 클라이언트 부하 수집기;수집된 데이터를 기초로 현재 데이터를 학습하고 미래 데이터를 예측하는 부하 온라인 학습예측기; 수집된 데이터를 기초로 부하 서버에서 장애탐지를 학습하고 장애를 예측하는 장애탐지 학습예측기; 및웹소켓을 통해 실시간 데이터 및 미래예측 데이터를 서버 웹소켓 통신모듈로 송신하는 클라이언트 웹소켓 통신모듈;을 포함하고, 상기 부하 서버는 학습 데이터를 생산하는 개별시스템에 대해 직접 인공지능 학습 및 예측을 할 수 있도록하고, 예측의 결과값만을 상기 중앙서버에 리포팅하여서, 상기 중앙서버는 개별 시스템 예측값의 집계 및 사용자 표출만을 담당하되,상기 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크,네트워크, 및 어플리케이션 중 하나 이상의 미래 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 LSTM신경망 학습을 통해 상기 시스템의 현재 시점 이후의 미래 데이터를 예측하는, 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 시스템."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제7 항에 있어서,상기 부하 온라인 학습예측기는 n개의 입력 데이터 및 n개의 예측출력 데이터를 학습 데이터 세트로 하여 LSTM신경망 학습을 통해 미래 데이터를 예측하도록 학습시키며, 미래 데이터의 예측을 위한 이터레이션을 1 회만 수행하고 1 에포크가 1 이터레이션이 되도록 하여서, n개의 데이터를 입력으로 하여 한번에 n개의 예측 데이터를출력시키도록 하는,실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 시스템."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 부하 온라인 학습예측기는 장애탐지(Anomaly Detection)을 위해서 딥러닝의 비지도학습인 오토인코더를 사용하여 입력값과 출력값이 동일하도록 학습시키고, 특정 입력값을 입력하여 예측 출력값이 상기 특정 입력값과다른 경우 장애로 인식하게 하는,공개특허 10-2024-0077313-4-실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 시스템."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 부하 온라인 학습예측기는 입력데이터셋이 n개(1 ~ n)의 경우 출력예측값도 동일 수량이 출력(1’ ~ n’)하게 하고, 해당 출력값의 오차값(입력값-출력값)의 평균 절대값을 구하고, 각 출력값에서 평균을 뺀 값중에서최대 절대값을 오차로 구하여, 입력데이터세트의 다음 n개(2 ~ n+1)에 대한 출력예측값(2’ ~ n+1’)에서 평균을 뺀 오차 절대값이 최대오차 절대값을 넘어간다면 이를 장애로 판단하는 방식으로, 실시간으로 변화하는 직전n개의 데이터변화를 반영하여 최근 새로운 1개의 데이터가 추가되었을 때의 변화를 감지하고 상기 변화를 장애로 판단하는,실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 시스템."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "중앙 서버 및 부하 서버를 포함하는 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법으로서,부하 서버의 개별 시스템의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상에서 데이터를 수집하는 단계;수집된 데이터를 기초로 부하 서버에서 현재 데이터를 학습하고 미래 데이터를 예측하는 단계; 및웹소켓을 통해 실시간 데이터 및 미래예측 데이터를 중앙 서버로 송신하는 단계;를 포함하고, 상기 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크,네트워크, 및 어플리케이션 중 하나 이상의 미래 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 LSTM신경망 학습을 통해 상기 시스템의 현재 시점 이후의 미래 데이터를 예측하고,상기 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 n개의 입력 데이터 및 n개의 예측출력 데이터를학습 데이터 세트로 하여 LSTM 신경망 학습을 통해 미래 데이터를 예측하도록 학습시키며, 미래 데이터의 예측을 위한 이터레이션을 1 회만 수행하고, 미래 데이터의 예측을 위한 이터레이션을 1 회만 수행하고 1 에포크가1 이터레이션이 되도록 하여서, n개의 데이터를 입력으로 하여 한번에 n개의 예측 데이터를 출력시키도록 하는것을 포함하는, 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법."}
{"patent_id": "10-2022-0159730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "실시간 시스템 및 서비스의 부하 엣지 컴퓨팅 온라인 학습 시스템으로서,중앙 서버 및 부하 서버를 포함하고,상기 부하 서버는부하인 개별 시스템의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 데이터를 수집하는 클라이언트 부하 수집기;수집된 데이터를 기초로 현재 데이터를 학습하고 미래 데이터를 예측하는 부하 온라인 학습예측기; 및웹소켓을 통해 실시간 데이터 및 미래예측 데이터를 서버 웹소켓 통신모듈로 송신하는 클라이언트 웹소켓 통신모듈;을 포함하고, 상기 부하 서버는 학습 데이터를 생산하는 개별시스템에 대해 직접 인공지능 학습 및 예측을 할 수 있도록하고, 예측의 결과값만을 상기 중앙서버에 리포팅하여서, 상기 중앙서버는 개별 시스템 예측값의 집계 및 사용자 표출만을 담당하되,공개특허 10-2024-0077313-5-상기 부하 온라인 학습예측기는 부하 수집기에서 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중하나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크, 네트워크, 및어플리케이션 중 하나 이상의 미래 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 LSTM 신경망 학습을 통해 상기 시스템의 현재 시점 이후의 미래 데이터를 예측하고,부하 온라인 학습예측기는 n개의 입력 데이터 및 n개의 예측출력 데이터를 학습 데이터 세트로 하여 LSTM 신경망 학습을 통해 미래 데이터를 예측하도록 학습시키며, 미래 데이터의 예측을 위한 이터레이션을 1 회만 수행하고 1 에포크가 1 이터레이션이 되도록 하여서, n개의 데이터를 입력으로 하여 한번에 n개의 예측 데이터를 출력시키도록 하는, 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 시스템."}
{"patent_id": "10-2022-0159730", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "중앙 서버 및 부하 서버를 포함하는 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법은 부하 서버의 개별 시 스템의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상에서 데이터를 수집하는 단계; 수집된 데 이터를 기초로 부하 서버에서 현재 데이터를 학습하고 미래 데이터를 예측하는 단계; 및 웹소켓을 통해 실시간 데이터 및 미래예측 데이터를 중앙 서버로 송신하는 단계;를 포함하고, 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 특정 시점의 현재 데 이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 미 래 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 딥러닝 학습을 통해 시스템의 현재 시점 이후의 미 래 데이터를 예측할 수 있다."}
{"patent_id": "10-2022-0159730", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 엣지 컴퓨팅, 더 자세하게는 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0159730", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "수십 내지 수천대의 장비(서버, 네트워크, IoT 등)는 시스템 및(또는) 서비스의 상태를 실시간 학습하고 미래를 예측하기 위한 인공지능 서비스를 필요로 한다. 변화하는 시스템 및 서비스의 부하 등의 상태가 실시간으로 수집되므로, 수십 내지 수천대의 장비(서버, 네트워 크, IoT 등)로부터 대부분의 인공지능 학습에서 사용되는 많은 데이터를 수집한 뒤 반복해서 여러 번 학습하는 오프라인 학습은 불가능하다. 따라서 실시간 수집되는 데이터를 실시간 주기적으로 학습하는 온라인 학습을 수 행하는 것이 필요하다. 그러나, 시스템 또는 서비스마다 모두 부하가 다르고 변화의 모습이 모두 다르기 때문에, 수십 내지 수천대의 장비(서버, 네트워크, IoT 등)는 시스템 및(또는) 서비스의 상태를 실시간 학습하고 미래를 예측하기 위해서는 개별적으로 학습하고 예측하여야 한다. 수십 내지 수천대 장비의 데이터를 수집하여 중앙의 학습서버에서 여러 프로세스를 동시에 실행하며 수행하는 것은 GPU의 도움을 받더라도 수집된 데이터를 학습시키는데 한계가 따른 다. 일반적으로 한대의 장비 부하에 대한 인공지능 학습을 수행하는 경우에도 하나의 GPU 메모리가 80%이상이 되므로 한 개이상의 알고리즘 학습이 어렵다. 따라서 부하가 발생 및 수집되는 해당 클라이언트 장비에서 직접 데이터의 학습 및 예측을 수행하여 그 결과만 중앙 서버에 보고하는 엣지컴퓨팅 학습을 수행하는 것이 필요하다. 또한, 시스템 및(또는) 서비스의 상태를 실시간 학습하고 미래를 예측하기 위해, 부하예측을 위한 LSTM 신경망 사용한 미래 예측과 이상징후 판별을 위한 오토인코더(오토인코더)을 이용한 장애판별을 수행할 때 발생하는 문 제점을 해결한 좀더 개선된 예측 방법 및 장애 판별 방법이 필요하게 되었다. 시스템 및 서비스의 상태 학습 및 예측 후에는 장애여부 판별까지 필요하며 이를 위해 딥러닝의 부하예측을 위 한 LSTM 신경망과 이상징후 판별을 위한 오토인코더 등 복수의 인공지능 학습이 수행되므로 해당 엣지장비의 컴 퓨팅 파워가 높게 소비될 수 밖에 없다. 해당 엣지 장비는 웹서비스 등 고유한 역할이 있으므로 인공지능 학습 및 예측을 위해 CPU 등 많은 컴퓨팅 리소스를 사용하면 안된다. 따라서 컴퓨터 부하를 낮게 유지하면서 제한된 시간안에 학습을 완료할 수 있는 경량 컴퓨팅을 수행하는 것이 필요하게 되었다. 상술한 과제를 해결하기 위한 본 발명의 일 실시 예에 따른 중앙 서버 및 부하 서버를 포함하는 실시간 시스템 에 대한 엣지 컴퓨팅 온라인 학습 방법은 AI 기술을 기반으로 컴퓨터 부하를 낮게 유지하면서 제한된 시간 안에학습을 완료할 수 있는 경량 컴퓨팅을 수행할 수 있다. 구체적으로, 중앙 서버 및 부하 서버를 포함하는 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법은 부하 서버의 개별 시스템의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상에서 데이터를 수집하는 단계; 수집된 데이터를 기초로 부하 서버에서 현재 데이터를 학습하고 미래 데이터를 예측하는 단계; 및 웹소켓 을 통해 실시간 데이터 및 미래예측 데이터를 중앙 서버로 송신하는 단계;를 포함하고, 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 미래 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 딥러닝 학습을 통해 시스템의 현재 시점 이후의 미래 데이터를 예측할 수 있다. 본 발명의 다른 실시 예에서, 중앙 서버 및 부하 서버를 포함하는 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학 습 방법은 수집된 데이터를 기초로 부하 서버에서 장애탐지를 학습하고 장애를 예측하는 단계; 및 웹소켓을 통 해 장애탐지 데이터를 중앙 서버로 송신하는 단계;를 더 포함하고, 수집된 데이터를 기초로 부하 서버에서 장애 탐지를 학습하고 장애를 예측하는 단계는 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이 상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크, 네트워크, 및 어플리 케이션 중 하나 이상의 장애탐지 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 딥러닝 학습을 통해 시스템의 현재 시점 이후의 장애탐지 데이터를 예측하는 것을 포함할 수 있다. 본 발명의 다른 실시 예에서, 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 현재 시점의 현재 데이터 를 학습하고 미래 데이터를 예측하기 위해, 인공지능 모델의 학습 데이터의 가중치(Weights)를 생성하고, 학습 된 완료된 수집 데이터를 모두 지우고 인공지능 모델의 학습 데이터의 가중치만을 유지하며, 신규 데이터가 수 집된 경우 최근에 수집된 몇 개의 수집데이터와 함께 기존 가중치를 기반으로 학습하는 것을 포함할 수 있다. 본 발명의 다른 실시 예에서, 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 인공지능 모델의 학습 데 이터에 가중치(Weights)를 생성할 때, 최신의 데이터일수록 더 큰 가중치를 부여하는 것을 포함할 수 있다. 본 발명의 다른 실시 예에서, 현재 데이터를 학습하고 미래 데이터를 예측하는 단계는 LSTM을 사용하여 시계열 데이터의 학습을 실행하고, 온라인 학습을 위해 stateful 옵션을 True로 주면 앞서 학습된 가중치(Weights)가 다음단계의 샘플 학습시의 초기상태로 입력되며, False인 경우 가중치가 전달되지 않을 수 있다. 본 발명의 다른 실시 예에서, 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학습 방법을 실행하는 컴퓨터 프로그램 을 저장한 컴퓨터 판독가능 저장 매체가 더 제공될 수 있다. 본 발명의 다른 실시 예에서, 실시간 시스템 및 서비스의 부하 엣지 컴퓨팅 온라인 학습 시스템은 중앙 서버 및 부하 서버를 포함하고, 부하 서버는 부하인 개별 시스템의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 데이터를 수집하는 클라이언트 부하 수집기; 수집된 데이터를 기초로 현재 데이터를 학습하고 미래 데이터를 예측하는 부하 온라인 학습예측기; 수집된 데이터를 기초로 장애탐지를 학습하고 장애를 예측하는 장 애탐지 학습예측기; 및 웹소켓을 통해 실시간 데이터 및 미래예측 데이터를 서버 웹소켓 통신모듈로 송신하는 클라이언트 웹소켓 통신모듈;을 포함하고, 부하 서버는 학습 데이터를 생산하는 개별시스템에 대해 직접 인공지 능 학습 및 예측을 할 수 있도록 하고, 예측의 결과값만을 중앙서버에 리포팅하여서, 중앙서버는 개별 시스템 예측값의 집계 및 사용자 표출만을 담당하되, 부하 온라인 학습예측기는 부하 수집기에서 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이 후의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 미래 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 딥러닝 학습을 통해 시스템의 현재 시점 이후의 미래 데이터를 예측할 수 있다. 본 발명의 다른 실시 예에서, 수집된 데이터를 기초로 장애탐지를 학습하고 장애를 예측하는 장애탐지 학습예측 기를 더 포함하고, 클라이언트 웹소켓 통신모듈은 웹소켓을 통해 장애탐지 데이터를 서버 웹소켓 통신모듈로 송 신하고, 장애탐지 학습예측기는 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 장애탐지 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 딥러닝 학습을 통해 시스템의 현재 시점 이후의 장애탐지 데이터를 예측할 수 있다. 본 발명의 다른 실시 예에서, 부하 온라인 학습예측기는 현재 시점의 현재 데이터를 학습하고 미래 데이터를 예측하기 위해, 인공지능 모델의 학습 데이터의 가중치(Weights)를 생성하고, 학습된 완료된 수집 데이터를 모 두 지우고 인공지능 모델의 학습 데이터의 가중치만을 유지하며, 신규 데이터가 수집된 경우 최근에 수집된 몇개의 수집데이터와 함께 기존 가중치를 기반으로 학습할 수 있다. 본 발명의 다른 실시 예에서, 부하 온라인 학습예측기는 인공지능 모델의 학습 데이터에 가중치(Weights)를 생 성할 때, 최신의 데이터일수록 더 큰 가중치를 부여할 수 있다. 본 발명의 다른 실시 예에서, 부하 온라인 학습예측기는 LSTM을 사용하여 시계열 데이터의 학습을 실행하고, 온 라인 학습을 위해 stateful 옵션을 True로 주면 앞서 학습된 가중치(Weights)가 다음단계의 샘플 학습시의 초기 상태로 입력되며, False인 경우 가중치가 전달되지 않을 수 있다. 본 발명의 다른 실시 예에서, 부하 온라인 학습예측기는 데이터 수집 주기 안에서 데이터의 학습 및 예측, 그리 고 장애를 판별까지 모두 마칠 수 있는 범위 내에서 최대한 컴퓨팅을 조각화하도록 배치하여 컴퓨터 자원의 사 용피크가 발생하지 않도록 할 수 있다. 본 발명의 다른 실시 예에서, 부하 온라인 학습예측기는 인공지능 학습 에포크(epoch) 루프안에서 학습속도를 조절하여, 단일 Core에서 CPU 최대 10% 내외의 컴퓨팅 리소스만을 사용할 수 있다."}
{"patent_id": "10-2022-0159730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 설명되는 실시 예들 을 참조하면 명확해질 것이다. 그러나 본 발명은 아래에서 제시되는 실시 예들로 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 아래에 제시되는 실시 예들은 본 발명의 개시가 완전하도록 하며, 본 발"}
{"patent_id": "10-2022-0159730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 상기 용어들에 의해 한정되어서 는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 이하, 본 발명에 따른 실시 예들을 첨부된 도면을 참조하여 상세히 설명하기로 하며, 첨부 도면을 참조하여 설 명함에 있어, 동일하거나 대응하는 구성 요소는 동일한 도면번호를 부여하고 이에 대한 중복되는 설명은 생략하 기로 한다. 도 1은 본 발명의 실시예에 따른 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 시스템의 구 성에 관한 예시도이다. 실시간 시스템 및 서비스의 부하 엣지 컴퓨팅 온라인 학습 시스템은 중앙 서버 및 부하 서버를 포함 할 수 있다. 중앙 서버는 실시간으로 수신데이터를 화면에 표시하는 모니터링 웹페이지부, 앱소켓을 통해 부하서 버의 클라이언트 웹소켓 통신모듈과 통신하는 서버 웹소켓 통신모듈, 및 검색 및 중앙 서버에서 수행되는 작업을 위해 수신데이터를 저장하는 실제 DB 및 예측 DB를 포함할 수 있다. 부하 서버는 클라이언트 웹소켓 통신모듈, 부하 수집기, 부하 온라인 학습예측기, 및 장애 탐지 학습예측기을 포함할 수 있다. 부하 서버는 학습 데이터를 생산하는 개별시스템에 대해 직접 인 공지능 학습 및 예측을 할 수 있도록 하고, 예측의 결과값만을 중앙서버에 리포팅하여서, 중앙서버는 개별 시스템 예측값의 집계 및 사용자 표출만을 담당할 수 있다. 클라이언트 웹소켓 통신모듈은 웹소켓을 통해 실시간 데이터 및 미래예측 데이터를 서버 웹소켓 통신모듈 로 송신할 수 있다. 엣지 컴퓨팅 학습의 반대의 의미는 중앙서버 컴퓨팅 학습이다. 기존 인공지능 학습의 경우 대부분 학습데이터를 수집 및 생산하여 GPU를 탑재한 강력한 중앙서버에서 빠르게 학습을 진행하였다. 이 경우 오프라인 학습에는 최적의 학습조건이 될 수 있으나, 학습데이터가 실시간으로 수집되는 경우 그리고 시스템 및 서비스처럼 학습대 상이 수백만개까지 확장되는 경우 엄청난 컴퓨팅 리소스가 필요하여 현실적으로 학습이 불가능해졌다. 이에 따 라 학습데이터를 생산하는 개별시스템에서 직접 인공지능 학습 및 예측을 할 수 있도록 하고, 예측의 결과값만 을 중앙서버에 리포팅하여 중앙서버에는 개별 시스템 예측값의 집계 및 사용자 표출만을 담당하므로 아무리 시 스템 및 서비스가 증가하여도 인공지능 학습으로 인한 전체 시스템의 성능저하는 발생하지 않을 수 있다. 이를 위해 클라이언트 시스템에 Client 부하 수집기 외에 부하 온라인 학습예측기, 장애탐지 학습예측기 를 탑재하여 시스템 및 서비스의 부하학습 및 예측, 그리고 장애판별까지 클라이언트에서 수행될 수 있다. 클라이언트 부하 수집기는 부하인 개별 시스템의 CPU 부하, 메모리 부하, 디스크 부하, 네트워크 부하, 및 어플리케이션 부하 중 하나 이상의 데이터를 수집할 수 있다. 시스템 및 서비스의 부하는 실시간으로 변화하므로 이를 20초 또는 1분 등 주기적으로 수집하여 학습하고 예측할 수 있다. 부하 온라인 학습예측기는 수집된 데이터를 기초로 현재 데이터를 학습하고 미래 데이터를 예측할 수 있다. 온라인 학습의 반대의 의미는 오프라인 학습 또는 배치(batch) 학습이다. 부하 온라인 학습예측기는 부하 수집기에서 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크 , 네트워크, 및 어플리케이션 중 하나 이상의 미래 데이터를 출력 데이터로 한 학습 데이터 세 트를 사용하여 딥러닝 학습을 통해 상기 시스템의 현재 시점 이후의 미래 데이터를 예측할 수 있다. 본 발명의 일 실시예에서, 상기 부하 온라인 학습예측기는 현재 시점의 현재 데이터를 학습하고 미래 데이터를 예측하기 위해, 인공지능 모델의 학습 데이터의 가중치(Weights)를 생성하고, 학습된 완료된 수집 데이터를 모 두 지우고 인공지능 모델의 학습 데이터의 가중치만을 유지하며, 신규 데이터가 수집된 경우 최근에 수집된 몇 개의 수집데이터와 함께 기존 가중치를 기반으로 학습할 수 있다. 기존의 오프라인 학습의 경우 신규 데이터가 추가되는 경우 기존의 모든 데이터와 함께 새롭게 학습하여야 하는데, 이 방법은 많은 자원(CPU, DISK, Memory)을 소모하며 오랜 학습시간이 걸리므로 실시간 부하 예측에 부적절하다. 이에 반해 온라인 학습의 경우 학습 된 완료된 수집 데이터는 모두 지우고 인공지능 모델의 학습 데이터만을 유지하며, 신규 데이터가 수집된 경우 최근 몇 개의 수집데이터와 함께 기존 가중치들을 기반으로 학습하므로, 제한된 컴퓨터자원을 사용하며 빠르게 학습할 수 있다는 장점이 있다. 하지만 온라인 학습의 경우 시간이 오래된 과거의 데이터일 수록 학습된 내용을 쉽게 잊는다는 단점이 있으나, 시스템 및 서비스 부하 학습분야에서는 과거의 데이터는 현재 데이터보다 중요성 이 상당히 떨어지므로 최신의 데이터일수록 학습에 더 많은 비중을 둘 수 있으므로 오히려 이는 장점으로 작용 한다. 본 발명의 일 실시예에서, 상기 부하 온라인 학습예측기는 인공지능 모델의 학습 데이터에 가중치 (Weights)를 생성할 때, 최신의 데이터일수록 더 큰 가중치를 부여하게 할 수 있다. LSTM(Long Short Term Memory networks)은 RNN(순환신경망, Recurrent Neural Network)의 한 종류이며, 과거의 데이터가 미래에 영향을 줄 수 있는 구조를 가진다. 따라서 LSTM은 실시간 시스템 및 서비스의 부하에 대한 엣 지 컴퓨팅 온라인 학습에 적합한 모델이다. 기존의 RNN 신경망에서는 장기 의존성 문제점인 체인 룰(Chain Rule)에 의해 [-1, 1]사이의 값들이 계속 곱해지다보니 앞쪽으로 갈수록 그 값이 작아지고 결국에는 소멸한다. 따라서 기존의 RNN 방식은 파라미터(Parameter)들이 업데이트 되지 않는 문제를 가진다. LSTM은 이를 해결하기 위해 제안된 방식이다. 기존의 RNN은 은닉층(Hidden Layer)에서 은닉 상태(Hidden State, St)를 계산할 때 단순히 St=tanh(Uxt+WSt)로 계산하였지만, LSTM에서는 총 4가지의 계산과정이 있다. 도 2에서 보는 바와 같이, LSTM의 은닉층(Hidden Layer)에서 신경망 레이어(Neural Network Layer)가 4개가 존 재한다. 즉, 도 2의 중앙 사각형 모양 내에 신경망 레이어가 4개 존재함을 확인할 수 있다. 또한 LSTM의 핵심 은 뉴럴(A)의 상단부분에 있는 수평선에 아주 마이너한 선형 연산을 거치고 전체 체인을 관통하여 정보는 큰 변 함없이 다음 단계로 전달하게 된다는 것이다. 또한, LSTM은 특정 시점 이전의 부하 데이터를 기본값으로 하여 학습된다. 특히, 특정 시점 이전의 부하 데이터 에 대해 특정 주기(예를 들어 , 20초 또는 1분) 동안 과거 데이터를 가지고 학습시키고 미래 데이터를 예측하여 실제 데이터와 비교한다. 이와 같이 비교하면서 특정 주기(일례로서 20초) 단위로 학습 세트가 미래로 이동하면 서 학습된다. 또한, 가중치를 조정을 반복하고 미래 데이터를 정하여 장애탐지를 결정하도록 한다. 또한, LSTM 신경망은 예측하고자 하는 미래 데이터에 대응하는 LSTM 신경망을 부하 별로 구비한다. 즉, 각 부하 에 해당하는 LSTM 신경망을 다수 구비하고, 부하 별로 해당 부하의 과거 데이터로 학습한다. 다음으로, 부하 온라인 학습예측기는 LSTM 신경망을 학습시킨다. 즉, 부하의 특정 시점의 과거 데이터를 수집하여, 수집된 과거 데이터를 이용하여 LSTM 신경망을 학습시킨다. 특히, 바람직하게는, 예측하려는 특정 시 점까지의 부하 정보의 시계열 데이터를 LSTM 신경망에 넣어, LSTM 신경망을 학습시킨다. 표1은 도 5b의 온라인 학습 그래프의 학습 데이터의 예시(가는 실선으로 표시됨)이다. 표 1의 각 부하의 단위는 그 데이터가 각 부하에서 차지하는 비율이다. 예를 들어, CPU 부하 3.528172%라면 CPU 최고 100%중 3.528172%를 차지한다고 할 수 있다. 데이터의 수집간격이 1분이고 예측하려는 특정 시점이 60분 후까지라고 한다면, 과거 데이터 120개를 학습에 사용할 수 있으며, 60개를 각각 입력 및 출력으로 하여 과거 데이터를 통해 미래 데이터 의 학습이 가능하다. 표 1 No Time(Unixtime) (a)CPU 부 하 (%) (b)Memory부 하(%) (c)Disk부하 (%) (d)Network inbound 부하(%) (e)Network outbound 부하(%) 생략 118 1663290360005 3.52817252.96069 0.007086 0.04782 0.460667 119 1663290420010 3.93106352.55638 0.007759 0.0399070.6429 120 1663290480003 3.76681 52.28501 0.006962 0.0455710.5169<학습데이터 예시> 본 발명의 실시예에서, 시계열 데이터의 학습에는 LSTM을 주로 사용하며 온라인 학습을 위해 stateful 옵션을 True로 주면 앞서 학습된 가중치(Weights)가 다음단계의 샘플 학습시의 초기상태로 입력되며, False인 경우 아 래 상단의 그림처럼 가중치가 전달되지 않을 수 있다. 예들 들어, 표 1의 데이터로 학습시 학습시 119번 데이터 를 마지막 120개로 하는 직전의 학습 가중치를 함께(프로그래밍적으로 stateful 옵션을 True로 함) 입력으로 넣 어서 최근 학습시 과거 데이터의 학습도 기억하게 한다. 이렇게 함으로써 최신의 데이터가 가중치가 가장 많이 반영되고, 과거의 데이터일수록 가중치에 기여하는 바가 낮아진다. 표2는 도 5b의 온라인 학습 그래프를 나타내는 미래예측 데이터의 예시(굵은 실선으로 표시됨)이다. 실제 예측 시에는 LSTM 신경망을 통해 61번~120번 데이터를 입력으로 하여 미래 데이터 60개를 예측값으로 출력한다. 표 2 No Time (Unixtime)(a)CPU 부 하(%)(b)Memory 부하(%)(c)Disk 부하(%)(d)Network inbound 부 하(%)(e)Network outbound 부하(%)전체 부하 장애(a) 부 하 장 애(b) 부 하 장 애(c) 부 하 장 애(d) 부 하 장 애(e) 부 하 장 애 생략 581663293960 3.63658653.052630.1008870.1349150.36347000000 591663294020 3.81775652.572690.1274730.133190.490904000000 601663294080 3.78316952.37502 0 0.1496720.559265000000 <예측데이터 예시> 표 2에서 전체부하장애판정 (a) 내지 (e) 부하의 장애탐지를 위해 오토인코더가 사용될 수 있다. 표 2에서 (a)~(e)부하장애의 경우 앞의 열 (a)~(e)부하에 대한 장애탐지를 수행하여 각 장애정도를 나타내고 있다. 0인 경우 장애가 나타나지 않았음을 나타내며, 0보다 큰 숫자의 경우 장애가 발생했으며, 숫자가 크면 클수록 장애 의 정도가 큼을 의미한다. 전체부하장애의 경우 모든 항목의 장애정도에 대한 합산으로 해당 시스템 전체의 장 애를 한눈에 알 수 있도록 한다. 도 3을 참조하면 오토인코더는 딥러닝 기술의 한 종류로서, 학습을 통해 입력 데이터의 중요한 특징(feature)을 추출하는 인공 신경망이다. 즉, 오토인코더는 신경망을 이용하여 입력 데이터의 중요한 특징들만 뽑아낸 후에 이 특징들로부터 다시 입력 데이터를 복원하는 기술이다. 도 3의 이상 영역이 나타나기 전 입력과 출력이 동일하게 나타나는 정상 영역에서와 같이, 오토인코 더는 학습 데이터를 이용하여 학습된다. 이때, 오토인코더에 입력 데이터가 입력되면, 입력 데이터를 인코딩 및 디코딩(복원)한 데이터가 오토인코더에서 출력되는데, 출력 데이터가 입력 데이터에 가까워지도록 오토인코더가 학습된다. 이때, 도 3의 정상 영역에서와 같이, 오토인코더의 학습에 사용되는 학습 데이터가 정상 데이터 만으로 구성된 경우, 정상 데이터로 학습된 오토인코더는 비정상 데이터가 입력되더라도 정상 데이터와 유사한 패턴의 데이터를 출력한다. 도 3을 참조하면, 정상 데이터로 학습된 오토인코더에 비정상 데이터가 입력되면, 출력 데이터는 정상 데이터와 유사한 패턴으로 복원된다. 따라서 입력 데이터가 정상을 벗어나는 정도가 클수록, 오토인코더를 통해 복원된 출력 데이터와 입력 데이터의 차이, 즉 입력 데이터와 출력 데이터 사이의 거리값(distance)이 커진다. 이상 영 역과 같은 장애판정을 위해 학습이 끝난 후 학습데이터를 입력하여 출력값과의 거리값에 대한 평균절대값 을 구하고 거리값과 평균절대값과의 최대오차절대값을 구하여 저장한다. 다음번 LSTM 예측값이 생성된 후 오토 인코더에 입력하여 출력데이터가 얻어지면 입력데이터와 출력데이터의 거리값에 대해 직전의 평균절대값과의 차 이가 직전의 최대오차절대값보다 크다면 이를 장애로 판정하게 된다. 도 4는 본 발명의 실시예에 따른 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 방법의 흐름 도에 관한 예시도이다.본 발명의 실시예에 따른 중앙 서버 및 부하 서버를 포함하는 실시간 시스템에 대한 엣지 컴퓨팅 온 라인 학습 방법이 제공된다. 부하 서버는 개별 시스템의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상에서 데이터를 수집할 수 있다(S1100). 수집된 데이터를 기초로 부하 서버에서 현재 데이터를 학습하고 미래 데이터를 예측할 수 있다(S1200). 현재 데 이터를 학습하고 미래 데이터를 예측하는 것은 수집된 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하 나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 미래 데이터를 출력 데이터로 한 학습 데이터 세트를 사용하여 딥러닝 학습을 통 해 상기 시스템의 현재 시점 이후의 미래 데이터를 예측하는 것을 포함할 수 있다. 수집된 데이터를 기초로 부하 서버에서 장애탐지를 학습하고 장래(이상여부)를 예측할 수 있다(S1300). 수집된 데이터를 기초로 부하 서버에서 장애탐지를 학습하고 장애를 예측하는 것은 수집된 CPU, 메모리, 디스크, 네트 워크, 및 어플리케이션 중 하나 이상의 특정 시점의 현재 데이터를 입력 데이터, 및 특정 시점 이후의 CPU, 메 모리, 디스크, 네트워크, 및 어플리케이션 중 하나 이상의 장애탐지 데이터를 출력 데이터로 한 학습 데이터 세 트를 사용하여 딥러닝 학습을 통해 상기 시스템의 현재 시점 이후의 장애탐지 데이터를 예측하는 것을 포함할 수 있다. 부하 서버는 웹소켓을 통해 실시간 데이터, 미래예측 데이터, 장애탐지 데이터 중 하나 이상을 중앙 서버 로 송신할 수 있다(S1400). 중앙 서버는 앱소켓을 통해 부하서버로부터 실시간 데이터, 미래예측 데이터, 장애탐지 데이터 중 하나 이상을 수신할 수 있다(S1500). 및 중앙 서버는 수행되는 작업을 위해 수신된 데이터를 DB에 저장할 수 있다(S1600). 중앙 서버는 수신 데이터를 화면에 표출할 수 있다(S1700). 본 발명의 일 실시예에서, 컴퓨터 판독 가능 저장 매체는 전술한 실시간 시스템에 대한 엣지 컴퓨팅 온라인 학 습 방법을 실행하도록 프로그래밍된 프로그램을 저장할 수 있다. 동일한 데이터에 대해 오프라인 학습 및 온라인 학습을 수행한 경우의 예측데이터 비교는 도4a 및 도 5b에서 볼 수 있다. 시계열 초기 데이터는 학습을 위해 사용되며 예측 후 실제 데이터를 겹치게 배치하여 예측 데이터의 정확도를 비교할 수 있도록 했다. 도 5a의 (a) 내지 (f)를 참조하면, 오프라인 학습의 경우 정확도가 20% 미만임을 알 수 있다. 실선 부분이 실제 데이터이고, 점선 부분이 예측 데이터이다. 도 5a의 (a) 내지 (f)에서 실선 부분과 예측 부분은 20%으로 중첩됨 을 알 수 있다. 반면, 도 5b의 (a) 내지 (e)를 참조하면, 온라인 학습의 경우 70% 이상으로 오프라인 학습과 큰 차이를 나타냈 다. 실선 부분이 실제 데이터이고, 점선 부분이 예측 데이터이다. 도 5b의 (a) 내지 (e)에서 실선 부분과 예측 부분은 70%이상 중첩됨을 확인할 수 있다. 엣지 컴퓨팅 학습을 통해 도 6에 도시된 바와 같이 여러 장비의 부하를 모니터링, 학습할 수 있다. 도 6는 중앙 서버에서 표시된 앙당, 무크, Al1, Al2, Al3, Al4, Al5, lee, Ubuntu의 개별 시스템 장비들의 CPU 부하 및 메모리 사용량(MEMORY USAGE)(%)이며, 전체 예측 조회을 클릭하면 개별 시스템에서 학습시키고 예측한 CPU 부하, 메모리 부하, 디스크 부하, 네트워크 부하, 및 어플리케이션 부하의 현재 사용량 및 미래 데이터의 사용량을 보여줄 수 있다. 도 7a, 및 도 7b에 도시된 바와 같이 CPU, Memory, Network, Disk, Application 등 시스템 및 서비스의 부하를 통합 또는 각각 예측할 수 있다. 도 7a는 본 발명의 실시예에 따른 한 장비의 통합 부하에 대한 예측 및 장애 판정의 예시 그래프이다. 도 7a에 서 현재 시점을 기준으로 실선 부분은 과거 데이터이고 점선 부분은 미래 데이터를 표시한다. 장애판정 영역 내의 2개의 점은 이전 장애탐지 데이터들을 표시한다. 도 7b는 본 발명의 실시예에 따른 한 장비의 CPU 부하에 대한 예측 및 장애 판정의 예시 그래프이다. 도 7a와 마찬가지로 도 7b에서 현재 시점을 기준으로 실선 부분은 과거 데이터이고 점선 부분은 미래 데이터를 표 시한다. 장애판정 영역 내의 1개의 점은 미래 장애탐지 데이터들을 표시한다. 기존 장애탐지 방법은 개별 시스템의 전체 부하, 또는 개별 부하이 상한선 및 하한선의 기준선을 설정하고, 상 한선을 넘거나 하한선을 하회하면 일률적으로 장해탐지로 간주하였다. 그러나, 본 발명의 실시예에 따른 부하 장비에서 온라인 학습 및 장애판별 학습예측 방법 및 시스템은 주기적은 이전 데이터의 학습 통해 미래 데이터 를 예측하고 장애탐지를 예측하기 때문에, 상한선 및 하한선의 경계선 설정없이, 예를 들어 사용량의 상한을 넘 거나 사용량의 하한을 하회하더라도 학습에 따라 장애가 아닌 것으로 결정할 수 있으며, 이전 데이터의 AI 학습 결과에 따라 상한 및 하한 경계가 일률적이지 않고 유동적인 장애탐지가 가능하다. 도 8은 본 발명의 실시예에 따른 부하 장비에서 온라인 학습 및 장애판별 학습예측기 구성도 CPU의 코어들의 동 작상태 예시도이다. 도 8을 참조하면, CPU 코어중 사용량 높은 코어를 볼 수 있다. 도 8에 도시된 바와 같 이, 부하인 클라이언트 장비에서 부하 온라인 학습예측기, 그리고 장애판별 학습예측기 구동시 도 8 에서와 같이 CPU 코어들 중 하나의 코어만 사용하므로 부하가 특정 코어에서 높게 나오는 것으로 나타난다. 대규모 시스템 학습을 위해서는 엣지 컴퓨팅 학습을 수행이 필수적이나 웹서비스 등 고유의 운영목적이 있는 해 당 시스템의 컴퓨팅 파워를 인공지능 학습에 모두 소비한다면 고유의 웹서비스가 정상적으로 유지되기 어렵다. 일반적으로 인공지능 학습은 GPU를 탑재한 장비에서 그렇지 않은 장비보다 수십배 빠르게 학습할 수 있으나, 시 스템 및 서비스 부하학습 및 예측을 위한 엣지 컴퓨팅 환경에서는 인공지능학습을 위한 GPU 탑재가 일반적으로 불가능하므로 CPU만을 이용하여 인공지능 학습을 수행하며, 이경우에도 웹서비스 등 기존 서비스에도 영향이 미 미하여야 한다. 이에 따라 온라인 학습방법으로 학습데이터의 수를 줄이는 한편 데이터 수집주기안에서 데이터의 학습 및 예측, 그리고 장애판별까지 모두 마칠 수 있는 범위내에서 최대한 컴퓨팅을 조각화하고 넓게 배치하여 CPU 등의 컴퓨 터 자원의 사용피크가 발생하지 않도록 해야 한다. 이를 위해 인공지능 학습 에포크(epoch) 루프안에서 학습속 도를 조절하여, 하나의 Core에서 CPU 최대 10% 내외의 사용량을 기록하도록 할 수 있다. 최근 인공지능 기술이 부각되면서 서비스의 품질 및 고객만족 등에 상당한 영향을 끼치는 시스템 및 서비스의 부하예측 및 장애판단은 해당분야의 관심 사항이 되고 있다. 전술한 바와 같이, 본 발명에서 실시간으로 생산되고 수집되는 시스템 및 서비스 부하 데이터를 실시간으로 온 라인 학습하여 과거 데이터에 비해 실시간의 의미가 더 크게 반영된 예측데이터 생산하는 것이 가능하다. 엣지 컴퓨팅 학습을 적용하는 경우 시스템 및 서비스의 수를 무제한으로 증가해도 전체 서비스의 품질저하가 발 생하지 않는다는 장점이 있다. 고유의 자체 서비스를 수행하는 시스템에서 엣지 컴퓨팅 수행을 위해 인공지능 학습 및 예측의 컴퓨팅 부하는 필연적이다. 서버에 여러 CPU 및 여러 Core가 존재하나 인공지능 학습 및 예측을 위해 단일 Core의 10% 이하의 컴퓨팅 리소스만을 사용한다면 전체서비스에 영향없이 인공지능 프로세싱이 가능하다. 이러한 경량 컴퓨팅 역시 고객의 선택에 따라 이 기능을 disable할 수 있도록 할 수 있다. 본 발명의 실시예에 따른 부하예측을 위한 LSTM 신경망 사용한 미래 예측과 이상징후 판별을 위한 오토인코더를 이용한 장애판별을 수행하는, 개선된 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 방법의 순서도가 도 9에 도시된다. 개선된 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 시스템은 먼저 S910단계에서 타겟시스 템의 CPU, 메모리, 디스크, 네트워크, 및 어플리케이션 등의 부하를 실시간 데이터 수집할 수 있다(S910). 도 9 에서 수집데이터 패턴은 1~2n, 2~2n+1, 3~2n+2, ... n~3n-1 방법을 사용한다. S920단계에서 수집된 데이터 갯수가 2n에 도달되었는지를 판단할 수 있다. 수집된 데이터의 갯수가 아직 2n에 도달하지 않았으면 S910단계의 실시간 데이터 수집을 계속한다. 데이터 수집의 간격은 예를 들어 1분마다 수행 할 수 있으며 30분(n=30)을 기준으로 하면 60분(2n)이면 LSTM 학습을 할 수 있다. LSTM을 이용한 부하 데이터를 예측하는 일반적인 방법은 일명 N:1 방식을 사용할 수 있다. N:1 방식에서는 n개 (1 ~ n)의 데이터를 입력으로 하여 n+1번째의 1개의 데이터를 예측하여 출력하며, 만약 n개의 예측이 필요한 경 우 다시 n개(2 ~ n+1)를 입력으로 하여 n+2번째의 1개의 데이터를 예측하여 출력하는 방법으로 n번을 에포크 (epoch)하여 n개의 예측출력을 얻게 된다. 그런데, n개(n+1 ~ n+n)의 예측출력값 중에 어느 하나가 예측이 크게 빗나가게 된다면 해당 예측값은 이후의 에 포크에 지속적으로 입력으로 사용되게 되므로, 도 5a에 도시된 바와 같이, 연속적인 예측값은 모두 크게 빗나가 게 되는 결과가 된다. 본 발명에서는 일반적인 LSTM 예측방법과 달리 n개의 데이터를 입력으로 하여 한번에 n개의 예측출력을 하는 일 명 N:N 방식을 도입하였다. N:N 방식에서 예측을 위한 이터레이션(iteration)은 1번만 수행하게 되므로 예측반 복횟수가 기존보다 1/n 로 줄어들게 되어 매우 빠르게 동작한다. 또한 잘못 예측된 데이터가 다른 예측 데이터 의 입력으로 사용되지 않으므로 일부 예측오류가 타 예측에 전파되지 않는 장점이 있다. N:N방식의 적용예는 도 5b에 도시된다. 학습은 과거의 데이터를 통하여 진행하므로 두 알고리즘의 학습반복 횟수는 동일하다. 배치 크 기(Batch Size)는 모델 학습 중 파라미터(parameter)를 업데이트할 때 사용할 데이터 개수를 의미한다. 이터레 이션(Iteration)은 전체 데이터에 대해 총 배치(Batch)의 수를 의미한다. 에포크(Epoch)는 전체 데이터셋을 학 습한 횟수를 의미한다. 예를 들어, 전체 데이터셋을 1회 활용하여 모델을 학습했다면 에포크는 1이다. 예를 들 어, 배치(Batch) 크기가 300이고 전체 데이터 개수가 3,000이라면 전체 데이터셋을 학습시키기 위해서는 총 10 개의 배치(Batch)가 필요하고, 10번에 걸쳐 파라미터를 업데이트해야 하므로, 이터레이션(Iteration)의 수는 10 이고, 3000의 전체 데이터 개수를 1회 활용하여 모델을 학습하였다면 에포크는 1이다. S930 단계에서, 수집된 데이터들에 대해 학습을 시킬 수 있다. 수집된 데이터의 갯수가 2n개이면 인공지능 학습, 예를 들어 LSTM을 통해 학습을 시작할 수 있다. 입력 데이터(x:1~n) 및 출력 데이터(y:n+1~2n)를 학습 데 이터 세트로 하여 LSTM을 통해 n개의 데이터를 입력으로 하여 한번에 n개의 예측을 출력하도록 학습시키는 N:N 학습이 수행될 수 있다. 상기 서술한 대로 N:N 학습은 1 에포크(epoch)가 1 이터레이션(iteration)이므로 학습 및 예측속도가 매우 빠르며, 예측 데이터가 다시 입력 데이터로 사용되면서 나타날 수 있는 발산 등의 문제가 발생하지 않는 장점이 있다. S940단계에서, S930단계에서 학습된 인공지능학습모델을 사용하여, 입력 데이터 N개(x:n+1~2n)를 입력받아서, 동시에 출력 데이터 N개(y:2n+1'~3n')를 출력하는 N:N 방식의 미래 데이터 예측을 수행할 수 있다. 도 5a 및 도 5b을 비교해 보면 도 5a의 N:1 방식에서는 한번 잘못 예측된 출력때문에 이후의 예측값이 20% 미만 의 정확도를 나타내는 등 상당한 오류를 나타내는 것으로 나타났다. 따라서 실시간 운영중인 시스템으로부터 실 시간으로 수집되는 데이터는 도 5b에 도시된 결과를 얻을 수 있는 N:N방식을 사용하여 더욱 빠르고 정확하게 예 측이 가능하다. 본 발명의 다른 실시예에서, 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 방법은 미래 데 이터를 예측하는 것에 덧붙여 미래 데이터로부터 실시간 시스템 및 서비스의 이상(장애) 여부를 예측하는 것을 포함할 수 있다. 실시간 시스템 또는 서비스의 미래의 장애 판별은 미래 데이터를 예측하는 이유 중 가장 주요 한 이유가 될 수 있다. 일반적으로 시스템의 장애를 판단하기 위해서는 예를 들면 CPU부하 상위 90%, 하위 10%의 고정된 값을 제시하고, 해당 시스템이 이 값을 상위로 넘어가거나 하위로 내려오는 경우 장애로 판단하는 방법을 많이 사용 한다. 그러나 이 방법은 여러 용도로 사용하는 실시간 시스템들의 정확한 장애를 판단하지 못한다. 따라서 인공지능방법을 사용하여 장애판별(Anomaly Detection)을 위해서 인공지능 오토인코더를 사용하게 되었 고, 입력값과 출력값이 동일하도록 학습한 뒤, 어떤 입력값을 입력하여 예측 출력값이 입력값과 다른 경우 이를 장애로 인식하게 된다. 인공지능 방법을 사용하는 경우 지속적으로 변화하는 시스템의 부하가 이전과 달리 상당 히 변동된 패턴을 보이는 경우 장애로 판단할 수 있다는 장점이 있다. 그러나 상당히 변동된다는 기준을 어떻게측정하는지에 대한 방법은 특별히 정해진 바가 없다. 본 발명의 일 실시예에서 실시간 시스템 부하에 대해 장애판단을 위해 장애기준을 실시간으로 변경하면서 측정 하는 방법이 수행될 수 있다. 실시간으로 수집된 데이터를 학습시키고, S940단계에서 미래 데이터 예측을 수행 한 후, S950 단계에서 장애를 예측하기 위해 오토인코더의 평균절대값 및 최대오차절대값을 계산할 수 있다. 입 력데이터셋이 N개(예, 60분) 즉, 60개(1 ~ n)의 경우 출력예측값도 동일 수량이 출력(1’ ~ n’)되는데, 해당 출력값의 오차값(입력값-출력값)의 평균 절대값을 구할 수 있다. S960단계에서, 오토리코더로 장애를 예측할 수 있다. 해당 출력값의 오차값(입력값-출력값)의 평균 절대값을 구 한 이후, 각 출력값에서 평균을 뺀 값중에서 최대 절대값을 오차로 구하여, 다음 출력예측값(2’ ~ n+1’)에서 평균을 뺀 오차 절대값을 장애 예측값(y:2\" ~ n+1\")으로 하고, 이 장애 예측값(y:2\" ~ n+1\")이 최대오차 절대값 을 넘어간다면 이를 장애로 판단하여서 오토인코더로 장애를 예측할 수 있다. 이후, S 다시 (2’ ~ n+1’)에 대 해 평균 절대값과 최대오차 절대값을 구하여 (3’ ~ n+2’)에 적용할 수 있다. 일 실시예에서, 전술한 표 2에서 와 같이, 장애 예측값(y:2\" ~ n+1\")이 최대오차 절대값을 넘기지 않는다면 전체 부하장애, (a)~(e)부하장애를 \"0\"으로 표시할 수 있다. 반대로, 장애 예측값(y:2\" ~ n+1\")이 최대오차 절대값을 넘긴다면 전체 부하장애, (a)~(e)부하장애값을 \"1\"으로 표시할 수 있다. 본 발명의 일 실시예에서, 부하장애값 \"1\"일 경우 서버 모니터에 장애예측 데이터를 표시하거나 유무선 네트워크로 사용자에게 알림을 보낼 수 있다. S970단계에서, 오토인코더로 장애를 학습한다((x:n+1~2n, y:n+1~2n). 오토인코더는 정상적인 데이터를 학습한 뒤 비정상적인 데이터가 입력으로 들어오면 출력 데이터와 비교하여 그 차이가 많은 경우 장애로 판정하게 된다. 입력 데이터가 실시간으로 수집되는 경우에는 어떤 데이터가 정상 또는 비정상인지 알 수 없으나 비정상 데이터는 일시적이므로 전체 시스템의 장애판정에 일시적으로만 영향을 끼치게 되므로 모든 실제 데이터를 입력 으로 넣어 학습하도록 한다. 따라서 이전 LSTM N:N 예측 단계(S940)에서 x:n+1~2n을 통해 y:2n+1'~3n'을 예측 하였더라도 오토인코더의 학습단계(S970)에서는 x:n+1~2n, y:n+1~2n으로 학습을 진행한다. 오토인코더는 최대한 입력 데이터 및 출력 데이터가 동일하게 되도록 학습을 진행하는 특성이 있다. S980에서, 수집 데이터(x:1~n, y:n+1~2n) 중 1번째 데이터(x:1, y:n+1)를 삭제한다. 데이터의 수집이 실시간으 로 이루어지므로 데이터의 수가 2n개에 도달하는 경우 LSTM과 오토인코더의 학습 및 예측이 수행되게 된다. 따 라서 미래데이터 예측 과정 및 장애 예측 및 학습 과정이 종료된 후에 S980 단계에서 가장 과거의 데이터 1개를 삭제할 수 있다. 타겟시스템을 정지한다면 실시간 시스템 부하에 대해 장애판단을 위해 장애기준을 실시간으로 변경하면서 측정하는 방법을 종료하고, 타겟시스템을 정지하지 않는다면(S990), S910 단계에서 최신 데이터 1개 를 수집하여 새로운 2n에 대하여 다시 미래 데이터 예측 학습 및 예측, 그리고 장애 예측 및 학습이 수행한다. 상기 방법은 실시간으로 변화하는 직전 n개의 데이터변화를 반영하여 최근 새로운 1개의 데이터가 추가되었을 때의 변화를 감지하고 이를 장애로 판단하는 동적 실시간 장애판별방법으로 사용할 수 있다. 본 발명의 다른 실시예에서, 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 방법은 타겟시스 템 부하의 데이터를 실시간으로 수집한 후, 실시간으로 수집된 데이터를 학습시키는 단계없이, 바로 장애 판별 에 관한 프로세스를 진행할 수 있다. 이 경우, 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학 습 방법은 S920 단계 진행후, 미래 데이터 학습(S930) 및 예측(S940) 단계들을 건너뛰고, S940단계로 진행할 수 있다. S950 단계에서 장애를 예측하기 위해, 입력 데이터 2N개(x:1~2n)를 입력받아서, 오토인코더의 평균절대값 및 최대오차절대값을 계산할 수 있다. 이상 설명된 본 발명에 따른 실시 예는 컴퓨터 상에서 다양한 구성요소를 통하여 실행될 수 있는 컴퓨터 프로그 램의 형태로 구현될 수 있으며, 이와 같은 컴퓨터 프로그램은 컴퓨터로 판독 가능한 매체에 기록될 수 있다. 이 때, 매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같은, 프로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 한편, 상기 컴퓨터 프로그램은 본 발명을 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 프로그램의 예에는, 컴파일러에 의하여 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함될 수 있다. 본 발명의 명세서(특히 특허청구범위에서)에서 \"상기\"의 용어 및 이와 유사한 지시 용어의 사용은 단수 및 복수 모두에 해당하는 것일 수 있다. 또한, 본 발명에서 범위(range)를 기재한 경우 상기 범위에 속하는 개별적인 값 을 적용한 발명을 포함하는 것으로서(이에 반하는 기재가 없다면), 발명의 상세한 설명에 상기 범위를 구성하는 각 개별적인 값을 기재한 것과 같다. 본 발명에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 발명이 한정되는 것은 아니 다. 본 발명에서 모든 예들 또는 예시적인 용어(예들 들어, 등등)의 사용은 단순히 본 발명을 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 발명의 범위 가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다."}
{"patent_id": "10-2022-0159730", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 시스템의 구 성에 관한 예시도이다. 도 2은 본 발명의 실시예에 따른 LSTM 신경망의 구조를 예시한 도면이다. 도 3은 오토인코더 학습 및 오토인코더 거리값(Distance)을 설명하는 도면이다. 도 4는 본 발명의 실시예에 따른 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학습 방법의 흐름 도에 관한 예시도이다. 도 5a는 부하들의 실제 데이터에 대해 오프라인 학습을 수행한 경우 예측 데이터에 관한 그래프의 예시도이다."}
{"patent_id": "10-2022-0159730", "section": "도면", "subsection": "도면설명", "item": 2, "content": "도 5b는 본 발명의 실시예에 따른 부하들의 실제 데이터에 대해 온라인 학습을 수행한 경우 예측 데이터에 관한 그래프이다. 도 6는 본 발명의 실시예에 따른 엣지 컴퓨팅 학습을 통해 여러 장비의 부하를 모니러링하고 학습시킨 예시도이 다. 도 7a는 본 발명의 실시예에 따른 한 장비의 통합 부하에 대한 예측 및 장애 판정의 예시 그래프이다. 도 7b는 본 발명의 실시예에 따른 한 장비의 CPU 부하에 대한 예측 및 장애 판정의 예시 그래프이다. 도 8은 본 발명의 실시예에 따른 부하 장비에서 온라인 학습 및 장애판별 학습예측기 구성도 CPU의 코어들의 작 성상태 예시도이다. 도 9은 본 발명의 실시예에 따른 부하예측을 위한 LSTM 신경망 사용한 미래 예측과 이상징후 판별을 위한 오토 인코더를 이용한 장애판별을 수행하는, 개선된 실시간 시스템 및 서비스의 부하에 대한 엣지 컴퓨팅 온라인 학 습 방법의 흐름도에 관한 예시도이다."}
