{"patent_id": "10-2015-0151409", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0050190", "출원번호": "10-2015-0151409", "발명의 명칭": "활동 가이드 정보 제공 방법 및 이를 지원하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이노아"}}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,센서 정보를 수집하는 센서; 및상기 센서와 기능적으로 연결되는 프로세서;상기 프로세서와 기능적으로 연결되고 상기 센서 정보를 저장하며, 상기 프로세서에 의해 실행되는 적어도 하나의 명령어를 저장하는 메모리;를 포함하고, 상기 프로세서에 의해 실행되는 명령어는,상기 센서를 이용하여 상기 전자 장치에 대응하는 사용자에 대한 활동 정보를 수집하고, 상기 수집하는 동작은상기 활동 정보를 이용하여 지정된 목표에 대한 상기 사용자의 활동량 또는 활동 참여도를 생성하는 동작을 포함하고,상기 활동량 또는 상기 활동 참여도에 적어도 기반하여, 상기 사용자에 대한 활동 가이드 정보의 출력 시점, 출력 주기, 출력 횟수, 또는 출력 내용 중 적어도 하나를 활동 가이드 변수로 조정하고, 및상기 조정된 활동 가이드 변수를 이용하여 생성된 상기 활동가이드 정보를 상기 프로세서와 기능적으로 연결된출력 장치를 통해 제공하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 전자 장치에 대한 상황 정보를 확인하고,상기 상황 정보에 적어도 더 기반하여, 상기 활동 가이드 변수를 조정하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서에 의해 실행되는 명령어는상기 활동 참여도가 상대적으로 높은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 짧게 하도록하고, 상기 활동 참여도가 상대적으로 낮은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 길게 하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서에 의해 실행되는 명령어는상기 활동 참여도가 상대적으로 높은 경우, 상기 활동 가이드 정보의 출력 횟수를 상대적으로 크게 하고, 상기활동 참여도가 상대적으로 낮은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 적게 하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서에 의해 실행되는 명령어는상기 현재 상태가 움직임 상태이면, 상기 활동 가이드 정보의 출력을 생략하고, 상기 현재 상태가 지정된 시간공개특허 10-2017-0050190-3-동안 비움직임 상태이면, 상기 활동 가이드 정보를 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 프로세서에 의해 실행되는 명령어는현재 상태가 움직임 상태이거나 또는 비움직임 상태 인지를 구분하고, 구분된 상태에 대응하는 지정된 활동 가이드 정보를 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서에 의해 실행되는 명령어는현재 시간이 속하는 시간대에 따라, 다른 내용의 활동 가이드 정보를 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 프로세서에 의해 실행되는 명령어는출력할 활동 가이드 정보가 이전 출력된 활동 가이드 정보와 동일한내용인 경우, 활동 가이드 정보의 내용을 변경하고, 변경된 활동 가이드 정보를 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서에 의해 실행되는 명령어는상기 프로그램의 기본 설정 기간 동안의 활동 정보를 기반으로 프로그램 참여 수준을 결정하고, 상기 결정된 프로그램 참여 수준에 따라 결정된 활동 참여도를 저장하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 프로세서에 의해 실행되는 명령어는상기 활동 정보의 반복의 정도에 따라, 상기 활동 참여도를 조정하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 프로세서에 의해 실행되는 명령어는상기 활동 정보의 크기가 지정된 크기 이하로 지정된 시간 동안 유지되는 경우 상기 활동 참여도를 하향 조정하고, 상기 활동 정보의 크기가 지정된 크기 이상으로 지정된 시간 동안 유지되는 경우 상기 활동 참여도를 상향조정하도록 설정된 전자 장치."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 프로세서에 의해 실행되는 명령어는상기 활동 가이드 정보 생성과 관련하여 상기 활동 정보의 패턴을 분석하고, 상기 분석된 패턴과 저장된 기준패턴들을 비교하여, 적어도 일부가 유사 또는 동일한 패턴을 검출하고, 상기 검출된 패턴을 기준으로 활동 추정정보를 산출한 후, 상기 활동 추정 정보와 상기 목표를 비교하여 목표 달성률을 산출하고 상기 산출된 목표 달성률을 기반으로 상기 활동 가이드 정보의 내용을 결정하도록 설정된 전자 장치.공개특허 10-2017-0050190-4-청구항 13 센서를 이용하여 전자 장치에 대응하는 사용자에 대한 활동 정보를 수집하는 동작; 상기 활동 정보를 이용하여 지정된 목표에 대한 상기 사용자의 활동량 또는 활동 참여도를 생성하는 동작;상기 활동량 또는 상기 활동 참여도에 적어도 기반하여, 상기 사용자에 대한 활동 가이드 정보의 출력 시점, 출력 주기, 출력 횟수, 또는 출력 내용 중 적어도 하나를 활동 가이드 변수로 조정하는 동작;상기 조정된 활동 가이드 변수를 이용하여 생성된 상기 활동가이드 정보를 출력 장치를 통해 제공하는 동작;을포함하는 활동 가이드 정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 상황 정보에 적어도 더 기반하여, 상기 활동 가이드 변수를 조정하는 동작;을 더 포함하는 활동 가이드 정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 제공하는 동작은상기 활동 참여도가 상대적으로 높은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 짧게 하는 동작;상기 활동 참여도가 상대적으로 낮은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 길게 하는 동작;을 포함하는 활동 가이드 정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 제공하는 동작은상기 활동 참여도가 상대적으로 높은 경우, 상기 활동 가이드 정보의 출력 횟수를 상대적으로 많게 하는 동작;상기 활동 참여도가 상대적으로 낮은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 적게 하는 동작;을 포함하는 활동 가이드 정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서,상기 제공하는 동작은상기 현재 움직임 상태가 움직임 상태이면, 상기 활동 가이드 정보의 출력을 생략하는 동작;상기 현재 움직임 상태가 지정된 시간 동안 비움직임 상태이면, 상기 활동 가이드 정보를 출력하는 동작;을 포함하는 활동 가이드 정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서,상기 제공하는 동작은현재 상태가 움직임 상태이거나 또는 비움직임 상태 인지를 구분하는 동작;상기 구분된 상태에 대응하는 지정된 활동 가이드 정보를 출력하는 동작;을 포함하는 활동 가이드 정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "공개특허 10-2017-0050190-5-제13항에 있어서,상기 제공하는 동작은현재 시간이 속하는 시간대에 따라, 다른 내용의 활동 가이드 정보를 출력하는 동작;을 포함하는 활동 가이드정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항에 있어서,상기 제공하는 동작은출력할 활동 가이드 정보가 이전 출력된 활동 가이드 정보와 동일한내용인 경우, 활동 가이드 정보의 내용을 변경하고, 변경된 활동 가이드 정보를 출력하는 동작;을 포함하는 활동 가이드 정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제13항에 있어서,상기 프로그램의 기본 설정 기간 동안의 활동 정보를 기반으로 프로그램 참여 수준을 결정하는 동작;상기 결정된 프로그램 참여 수준에 따라 결정된 활동 참여도를 저장하는 동작;을 더 포함하는 활동 가이드 정보제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제13항에 있어서,상기 활동 정보의 반복의 정도에 따라, 상기 활동 참여도를 조정하는 동작;을 더 포함하는 활동 가이드 정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서,상기 조정하는 동작은상기 활동 정보의 크기가 지정된 크기 이하로 지정된 시간 동안 유지되는 경우 상기 활동 참여도를 하향 조정하는 동작;상기 활동 정보의 크기가 지정된 크기 이상으로 지정된 시간 동안 유지되는 경우 상기 활동 참여도를 상향 조정하는 동작;을 포함하는 활동 가이드 정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제13항에 있어서,상기 활동 가이드 정보를 생성하는 동작은상기 활동 정보의 패턴을 분석하는 동작;상기 분석된 패턴과 저장된 기준 패턴들을 비교하여, 적어도 일부가 유사 또는 동일한 패턴을 검출하는 동작;상기 검출된 패턴을 기준으로 활동 추정 정보를 산출하는 동작;상기 활동 추정 정보와 상기 목표를 비교하여 목표 달성률을 산출하는 동작;상기 산출된 목표 달성률을 기반으로 상기 활동 가이드 정보의 내용을 결정하는 동작;을 포함하는 활동 가이드정보 제공 방법."}
{"patent_id": "10-2015-0151409", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시된 실시 예는 프로세서, 상기 프로세서와 전기적으로 연결되고 센서 정보를 저장하며, 상기 프로 세서에 의해 실행되는 적어도 하나의 명령어를 저장하는 메모리를 포함하고, 상기 프로세서에 의해 실행되는 명 령어는 상기 센서 정보 기반으로 활동 정보 산출하고, 설정된 목표를 기반으로 상기 활동 정보에 대해 출력할 활 동 가이드 정보를 생성하고, 전자 장치의 현재 움직임 상태, 프로그램 참여 수준에 따라 설정된 활동 참여도, 현 재 시간 중 적어도 하나를 기반으로 상기 활동 가이드 정보의 출력 시점, 출력 주기, 출력 횟수, 출력 내용 중 적어도 하나를 다르게 출력하도록 설정된 전자 장치를 개시한다. 이 외에도 명세서를 통해 파악되는 다양한 실시 예가 가능하다."}
{"patent_id": "10-2015-0151409", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서의 다양한 실시 예들은 사용자 활동과 관련된 활동 가이드 정보 제공에 관한 것이다."}
{"patent_id": "10-2015-0151409", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 전자 장치는 건강에 대한 관심이 높아지면서, 사용자의 운동 정보를 측정하고 처리하는 사용자 기능을 제 공하고 있다."}
{"patent_id": "10-2015-0151409", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "사용자들의 운동 성향은 각각의 개인성향에 따라 큰 차이가 있는데도 불구하고, 종래 운동 관련 사용자 기능은 획일적이고 보편적인 운동 정보만을 제공하고 있었다. 그래서, 종래 전자 장치가 제공하는 운동 관련 사용자 기 능은 사용자 이용도가 매우 낮은 문제가 있었다. 본 명세서의 다양한 실시 예들은, 사용자 성향에 따라 개인화된 활동 가이드 정보를 제공할 수 있는 활동 가이 드 정보 제공 방법 및 이를 지원하는 전자 장치를 제공할 수 있다. 또한, 본 명세서의 다양한 실시 예들은, 활동 가이드 정보의 제공 시점이나 주기 등을 사용자의 상태나 환경에 따라 적응적으로 제공하여 운동 기능에 대한 거부감을 줄이고 사용자가 설정한 목표를 안정적이고 지속적으로 달성할 수 있도록 하는 활동 가이드 정보 제공 방법 및 이를 지원하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2015-0151409", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "한 실시 예에 따른 전자 장치는 센서 정보를 수집하는 센서 및 상기 센서와 기능적으로 연결되는 프로세서, 상 기 프로세서와 기능적으로 연결되고 상기 센서 정보를 저장하며, 상기 프로세서에 의해 실행되는 적어도 하나의 명령어를 저장하는 메모리를 포함하고, 상기 프로세서에 의해 실행되는 명령어는, 상기 센서를 이용하여 상기 전자 장치에 대응하는 사용자에 대한 활동 정보를 수집하고, 상기 수집하는 동작은 상기 활동 정보를 이용하여 지정된 목표에 대한 상기 사용자의 활동량 또는 활동 참여도를 생성하는 동작을 포함하고, 상기 활동량 또는 상 기 활동 참여도에 적어도 기반하여, 상기 사용자에 대한 활동 가이드 정보의 출력 시점, 출력 주기, 출력 횟수, 또는 출력 내용 중 적어도 하나를 활동 가이드 변수로 조정하고, 및 상기 조정된 활동 가이드 변수를 이용하여 생성된 상기 활동가이드 정보를 상기 프로세서와 기능적으로 연결된 출력 장치를 통해 제공하도록 설정될 수 있 다. 한 실시 예에 따른 활동 가이드 정보 제공 방법은 센서를 이용하여 전자 장치에 대응하는 사용자에 대한 활동 정보를 수집하는 동작, 상기 활동 정보를 이용하여 지정된 목표에 대한 상기 사용자의 활동량 또는 활동 참여도 를 생성하는 동작, 상기 활동량 또는 상기 활동 참여도에 적어도 기반하여, 상기 사용자에 대한 활동 가이드 정 보의 출력 시점, 출력 주기, 출력 횟수, 또는 출력 내용 중 적어도 하나를 활동 가이드 변수로 조정하는 동작, 상기 조정된 활동 가이드 변수를 이용하여 생성된 상기 활동가이드 정보를 출력 장치를 통해 제공하는 동작을 포함할 수 있다."}
{"patent_id": "10-2015-0151409", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예는 사용자 운동 성향을 파악하고, 파악된 성향에 따라 적응적인 활동 가이드 정보를 제공함으로 써 운동 기능 이용에 대한 거부감을 최소화하고 사용자가 설정한 목표 달성을 안정적이고 지속적으로 할 수 있 도록 지원한다."}
{"patent_id": "10-2015-0151409", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시 예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구 성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있 다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크 스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플 레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택 트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부 착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나를 포 함할 수 있다. 어떤 실시 예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자 기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things) (예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 한 실시 예에 따른 전자 장치의 한 예를 나타낸 도면이다. 도 1을 참조하면, 한 실시 예에 따른 전자 장치는 사용자에 의해 소유 또는 파지된 상태에서 적어도 하나 의 활동 상태(또는 움직임 상태, 또는 이동 상태 등)를 가질 수 있다. 활동 상태는 예컨대, 움직임이 없거나 지 정된 기준 값 이하인 정지 상태, 걷기 활동 상태, 달리기 활동 상태, 싸이클 운용 상태, 차량 이용 상태 등을 포함할 수 있다. 한 실시 예에 따르면, 전자 장치는 사용자의 손목이나 발목, 목 또는 허리 등에 거치된 상태에서 사용자의 활동 상태와 관련한 센서 정보(또는 센서 데이터)를 수집할 수 있다. 또는 상기 전자 장치 는 예컨대, 휴대용 전자 장치로 구현될 수 있다. 상기 휴대용 전자 장치는 예컨대, 이동 전화기, 스마트 폰(smart phone), 태블릿 (tablet) PC, PDA(personal digital assistant), EDA(enterprise digital assistant), 디지털 스틸 카메라 (digital still camera), 디지털 비디오 카메라 (digital video camera), PMP(portable multimedia player), PND(personal navigation device 또는 portable navigation device), 휴대 용 게임 콘솔(handheld game console), 모바일 인터넷 장치(mobile internet device(MID)), 인터넷 태블릿, 또 는 e-북(e-book) 등으로 구현될 수 있다. 상술한 전자 장치는 활동 상태에 따라 수집되는 활동 정보를 기 반으로 기본 활동 참여도 설정과 관련한 기본 설정 기능, 활동 가이드 정보(activity guide information) 생성및 출력과 관련한 활동 가이드 기능을 제공할 수 있다. 상기 기본 설정 기능은 예컨대, 활동 가이드 프로그램 사용 초반부 지정된 기간 동안의 활동 패턴에 따라 사용자의 프로그램 참여도를 설정하는 기능을 포함할 수 있 다. 기본 설정 기능 수행 기간(예: 프로그램 사용 초반부) 초기에 별도의 활동 참여도는 설정되지 않고, 활동 정보에 따른 활동 가이드 정보가 제공될 수 있다. 또는, 기본 설정 기능 수행 기간 사용자 정보(예: 사용자의 나이, 체중, 직업, 키, 운동 이력, 해당 사용자와 동일한 군에 속하는 다른 사용자들의 정보 등)를 토대로 임시 적으로 특정 활동 참여도가 설정될 수도 있다. 상기 활동 가이드 기능은 기본 설정 기능 이후 프로그램 사용 기 간 동안 활동 가이드 정보를 제공하는 기능을 포함할 수 있다. 상술한 전자 장치는, 예를 들면, 프로세서, 메모리, 센서, 출력 모듈(입출력 인터페이스 , 디스플레이), 및 통신 인터페이스를 포함할 수 있다. 상기 메모리는 전자 장치 운용과 관련한 적어도 하나의 프로그램 및 프로그램 운용과 관련한 데이터 를 저장할 수 있다. 한 실시 예에 따르면, 메모리는 전자 장치의 운영 체제를 저장할 수 있다. 또한, 메모리는 활동 가이드 정보 제공 프로그램을 저장할 수 있다. 상기 활동 가이드 정보 제공 프로그램은 사 용자가 프로그램을 통해서 달성하고자 하는 목표 설정 기능, 목표 달성과 관련하여 제공되는 상태 정보, 또는 동기를 부여할 수 있는 다양한 활동 가이드 정보를 출력하는 기능을 제공할 수 있다. 상기 활동 가이드 정보 제 공 프로그램은 사용자의 활동 정보를 바탕으로 사용자의 행동 패턴, 프로그램과 연관된 목표 달성 패턴, 사용자 활동 참여도, 또는 진행상황 등의 분석 기능을 제공할 수 있다. 상기 패턴은 활동 가이드 정보 결정과 관련하여 이용될 수 있다. 상기 활동 가이드 정보 제공 기능은 다양한 정보 전달 시점 및 다양한 메시지 내용을 포함하는 정보를 제공할 수 있다. 이와 관련하여, 상기 활동 가이드 정보 제공 프로그램은 예컨대, 기본 설정 기능과 관련한 적어도 하나의 명령 어 셋(또는 루틴, 함수, 클래스, 구문 등)을 포함할 수 있다. 또한, 상기 활동 가이드 정보 제공 프로그램은 활 동 가이드 정보의 생성과 관련한 적어도 하나의 명령어 셋, 활동 가이드 정보 출력과 관련한 적어도 하나의 명 령어 셋 등을 저장할 수 있다. 또한, 활동 가이드 정보 제공 프로그램은 기본 활동 참여도 조정과 관련한 적어 도 하나의 명령어 셋, 활동 가이드 정보 변경과 관련한 적어도 하나의 명령어 셋 등을 저장할 수 있다. 상기 메 모리에 저장된 명령어 셋들은 프로세서에 의하여 실행되어, 활동 가이드 기능을 위해 이용될 수 있다. 상술한 메모리는 예컨대, 전자 장치의 내/외부에 존재할 수 있으며, 통신 인터페이스를 통해서 연결되는 클라우드 서버일 수 있다. 상기 메모리는 활동 정보 및 활동 가이드 정보를 저장할 수 있다. 상기 활동 정보는 지정 된 크기 이상의 센서 정보가 수집되는 활동 구간 정보, 활동 구간 동안의 활동의 종류(예: 걷기, 달리기, 싸이 클 등) 정보, 지정된 크기 이하의 센서 정보가 수집되거나 센서 정보가 미수집되는 비활동 구간 정보를 포함할 수 있다. 상기 비활동 구간 정보는 예컨대, 전자 장치의 움직임이 없는 시점, 움직임이 없었던 시간 구간, 전자 장치의 움직임이 지정된 크기 이하인 시점이나 시간 구간 등의 정보를 포함할 수 있다. 또한, 센서 정보를 외부 전자 장치로부터 수신하는 경우, 상기 비활동 구간 정보는 상기 센서 정보가 미수신되는 구간 정보 등을 포함할 수 있다. 상기 활동 정보는 예컨대, 센서 정보들을 토대로 분석된 패턴 정보를 포함할 수 있 다. 상기 활동 가이드 정보는 기본 설정 기능과 관련한 제1 타입 활동 가이드 정보, 활동 가이드 기능과 관련 한 제2 타입 활동 가이드 정보를 포함할 수 있다. 제1 타입 활동 가이드 정보는 예컨대, 제2 타입 활동 가이드 정보와 비교하여, 내용, 출력 주기, 출력 시점이 다르게 정의된 정보일 수 있다. 또는, 제1 타입 활동 가이드 정보는 제2 타입 활동 가이드 정보와 유사한 내용을 포함하되, 표현이 다른 형태의 내용을 가지는 정보일 수 있 다. 제1 타입 활동 가이드 정보는 활동 정보에 따라 선택되고 운용될 수 있다. 제2 타입 활동 가이드 정보는 기 본 활동 참여도, 활동 정보, 출력 시점, 출력 주기 중 적어도 하나에 따라 선택되고 운용될 수 있다. 상기 센서는 사용자의 활동 상태에 따른 센서 정보를 수집할 수 있는 적어도 하나의 센서 모듈을 포함할 수 있다. 예컨대, 상기 센서는 가속도 센서, 위치 정보 수집 센서 등을 포함할 수 있다. 또는 센서는 만보계, 페도미터 등을 포함할 수 있다. 다양한 실시 예에 따르면, 센서는 사용자 위치 판단과 관련한 센 서를 포함할 수 있다. 예컨대, 전자 장치는 GPS, Glonass, Galileo 등의 위치 정보 수집 센서를 기반의 위 성 항법 시스템, 각/가속도계 센서를 활용한 관성항법 시스템을 운용할 수 있다. 전자 장치 위치 파악과 관련하 여, 2G, 3G, 4G, 5G 등과 같은 원거리 통신을 활용한 위치 파악 시스템, WiFi, BT, BLE 등 근거리 통신을 활용 한 방식 등이 이용될 수도 있다. 상기 입출력 인터페이스은, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 상 기 전자 장치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 상기 입출력 인터페이스은 상기 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다 른 외부 기기로 출력할 수 있다. 상기 입출력 인터페이스은 예컨대, 적어도 하나의 물리 버튼 또는 터치 버튼이나 터치 패드 또는 터치스크린 등을 포함할 수 있다. 또한 상기 입출력 인터페이스은 전자펜 등에 의한 입력 수단을 포함할 수 있다. 또한 상기 입출력 인터페이스은 오디오 신호를 수집할 수 있는 오디오 수집 장치를 포함할 수 있다. 한 실시 예에 따르면, 상기 입출력 인터페이스은 활동 가이드 정보에 대응하 는 오디오 정보 또는 대표 활동 상태(예: 걷기 중, 달리기 중 등) 에 대응하는 오디오 정보를 오디오 장치를 출 력할 수 있다. 다양한 실시 예에 따르면, 입출력 인터페이스은 활동 가이드 정보에 대응하는 진동 정보, 램프 점멸 정보 등을 진동 소자 또는 램프 등을 통해 출력할 수 있다. 상기 디스플레이은 TFT-LCD(thin film transistor-liquid crystal display) 패널, LED(light emitting diode) 패널, OLED(organic LED) 패널, AMOLED(active matrix OLED) 패널, 또는 플렉서블(flexible) 패널 등으 로 구현될 수 있다. 상기 디스플레이은 지정된 어플리케이션 실행에 따른 실행 화면을 출력할 수 있다. 예 컨대, 상기 디스플레이은 턴-오프 상태에서, 지정된 시간 범위 이상 지정된 활동 상태에 대응하는 센서 정 보가 수집되면, 활동 상태 변화에 대응하는 정보를 출력할 수 있다. 다양한 실시 예에 따르면, 디스플레이(16 0)은 일정 시간 단위(예: 하루, 3일, 일주일, 한달, 3개월, 6개월, 1년 등)로 누적된 활동 상태 변화에 대응하 는 정보를 출력할 수 있다. 또한, 디스플레이는 텍스트 또는 이미지 중 적어도 하나를 포함하는 활동 가이 드 정보를 출력할 수 있다. 상기 통신 인터페이스은 전자 장치의 통신 기능을 수행과 관련한 통신 채널을 형성할 수 있다. 한 실 시 예에 다르면, 전자 장치은 외부 전자 장치로부터 센서 정보를 수신할 수 있다. 통신 인터페이스은 수신된 센서 정보를 프로세서에 전달하고, 프로세서는 수신된 센서 정보에 대한 활동 정보를 수집(또 는 산출)할 수 있다. 다양한 실시 예에 따르면, 통신 인터페이스은 프로세서 제어에 대응하여 활동 가이드 정보를 외부 전자 장치(예: 웨어러블 장치 등)에 전송할 수도 있다. 상기 프로세서는 전자 장치의 전반적인 동작을 제어할 수 있다. 한 실시 예에 따르면, 프로세서(12 0)는 집적 회로, 시스템 온 칩, 또는 모바일 AP로 구현될 수 있다. 상기 프로세서는 지정된 센서(예: 가속도 센서, 만보계, 페도미터 등)를 기반으로 수집된 활동 정보를 이용하여 사용자의 활동 상태를 분석하고, 이를 기반으로 활동 가이드 정보 제공을 수행할 수 있다. 예컨대, 상기 프로세서는 기본 활동 참여도를 설 정하는 기본 설정 기능과 관련한 신호 처리를 수행할 수 있다. 또한, 상기 프로세서는 상기 기본 설정 기 능을 통해 결정된 기본 활동 참여도와 수집된 활동 정보 및 전자 장치의 상태 중 적어도 하나를 기반으로 활동 가이드 정보를 생성하기 위한 신호 처리 및 활동 가이드 정보 출력과 관련한 신호 처리를 수행할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 활동 참여도 조정, 상기 활동 가이드 정보의 변경 등과 관련한 신호 처리를 수행할 수 있다. 프로세서는 활동 참여도에 따라서 같은 상황에 서로 다른 활동 가이 드 정보를 제공할 수도 있다. 또한, 프로세서는 같은 상황인 경우 특정 활동 참여도에서만 제공되는 활동 가이드 정보를 운용할 수도 있다. 상기 프로세서는 신호 처리와 관련하여, 도 2에서 설명하는 구성들을 포 함할 수 있다. 도 2는 한 실시 예에 따른 프로세서의 한 예를 나타낸 도면이다. 도 2를 참조하면, 상기 프로세서는, 예를 들면, 사용자 패턴 분석 모듈, 활동 참여도 처리 모듈 , 및 활동 가이드 정보 처리 모듈을 포함할 수 있다. 상기 사용자 패턴 분석 모듈은 센서를 이용하여 센서 정보를 수집할 수 있다. 예컨대, 사용자 패턴 분석 모듈은 전자 장치가 턴-온된 상태이면, 자동으로 또는 설정에 따라 센서를 활성화하여 센 서 정보를 수집할 수 있다. 또는, 사용자 패턴 분석 모듈은 외부 전자 장치(예: 웨어러블 디바이스)로부터 실시간 또는 일정 주기로 센서 정보를 수집할 수 있다. 사용자 패턴 분석 모듈은 센서가 전달한 센서 정보의 패턴을 분석할 수 있다. 예컨대, 사용자 패턴 분석 모듈은 지정된 크기의 윈도우(예: 일정 시간 범 위를 지시하는 윈도우)를 설정하고, 설정된 윈도우 범위 내의 시간 동안의 센서 정보들의 패턴을 분석할 수 있 다. 한 실시 예에 따르면, 사용자 패턴 분석 모듈은 분 단위, 시간 단위, 일 단위, 주 단위 또는 월 단위 등의 윈도우를 운용할 수 있다. 이하 설명에서는 지정된 시간 단위 윈도우를 기준으로 설명하기로 한다. 예컨대, 12시간 단위 윈도우를 운용하는 경우, 사용자 패턴 분석 모듈은 매 분 단위 또는 매 시간 단위를 기준으로 12시간 동안 수집한 센서 정보들의 패턴 분석을 수행할 수 있다. 사용자 패턴 분석 모듈은 분석 된 패턴 정보를 활동 참여도 처리 모듈 및 활동 가이드 정보 처리 모듈에 전달할 수 있다. 다양한 실시 예에 따르면, 상기 사용자 패턴 분석 모듈의 윈도우 크기는 기본 설정 기능 및 활동 가이드 기능 운용에서 동일하게 적용될 수 있다. 또는, 상기 사용자 패턴 분석 모듈의 윈도우 크기는 기능 종류 (예: 기본 설정 기능 또는 활동 가이드 기능)에 따라 다르게 정의될 수 있다. 예컨대, 기본 설정 기능과 관련하 여, 사용자 패턴 분석 모듈은 윈도우 크기를 상대적으로 작게(예: 1시간 단위) 설정할 수 있다. 또한, 활 동 가이드 기능과 관련하여 사용자 패턴 분석 모듈은 윈도우 크기를 상대적으로 크게(예: 6시간 단위)하거 나 또는 상대적으로 작게(예: 30분 단위)할 수도 있다. 다양한 실시 예에 따르면, 상기 윈도우 크기는 기본 활 동 참여도에 따라서, 달라질 수도 있다. 예컨대, 기본 활동 참여도가 상대적으로 높은 경우 윈도우 크기는 상대 적으로 작게 설정되고, 기본 활동 참여도가 상대적으로 낮은 경우 윈도우 크기는 상대적으로 크게 설정될 수 있 다. 상기 활동 참여도 처리 모듈은 기본 설정 기능이 수행되는 동안의 센서 정보들의 패턴에 따라 특정 기본 활동 참여도를 설정할 수 있다. 예컨대, 활동 참여도 처리 모듈은 본 발명의 사용자 기능 최초 시작 시점 부터 지정된 기간(예: 7일, 14일, 30일 등) 동안의 센서 정보들을 바탕으로 전자 장치 사용자의 기본 활동 참여도를 결정할 수 있다. 예컨대, 사용자가 설정한 목표 및 센서 정보를 통해 계산된 목표 달성률에 따라, 사 용자의 기본 활동 참여도를 다수의 레벨(또는 등급) 중 어느 하나의 레벨로 결정할 수 있다. 다양한 실시 예에 따르면, 사용자의 기본 활동 참여도 결정과 관련해서, 지정된 기준 값들이 이용될 수 있다. 상기 지정된 기준 값은 예컨대, 설정된 목표의 크기와 설정된 목표의 달성률을 다수의 참여도 레벨로 나누는 값 들을 포함할 수 있다. 또는, 상기 기준 값은 본 발명의 사용자 기능을 사용하는 사용자들의 데이터들(예: 사용 자들이 설정한 목표와 목표 달성률에 대한 이력 정보)을 기반으로 선택될 수 있다. 이와 관련하여, 활동 참여도 처리 모듈은 기본 활동 참여도 기준과 관련한 정보를 제공하는 서버로부터 기준 값을 수신하여 운용할 수 있다. 상기 서버는 다수의 전자 장치로부터 목표 설정 및 달성률에 대한 정보를 수신하고, 이를 기반으로, 통계 적 그룹핑(예: 유사한 특성을 가지는 데이터들을 그룹핑)을 수행한 후, 각 그룹핑되는 그룹들에 대응하는 기본 활동 참여도에 대한 기준 값을 설정할 수 있다. 예컨대, 서버는 어떠한 형태의 그룹에 어떠한 기본 활동 참여도 를 할당할지를 결정하도록 하는 기준 값을 마련할 수 있다. 다양한 실시 예에 따르면, 활동 참여도 처리 모듈은 지정된 기준 값을 기반으로 수집된 활동 정보에 대응 하는 사용자의 기본 활동 참여도를 결정할 수 있다. 활동 참여도 처리 모듈은 일정 주기 또는 실시간으로 서버가 제공한 기준 값을 이용하여 이전 기준 값을 변경하는 학습 기능을 제공할 수도 있다. 활동 참여도 처리 모듈은 사용자의 기본 활동 참여도가 결정되면, 결정된 기본 활동 참여도 정보를 활동 가이드 정보 처리 모듈에 제공할 수 있다. 상기 활동 참여도 처리 모듈은 활동 가이드 기능이 운용되는 기간 중에, 사용자가 설정한 목표 및 목표 달 성률을 기반으로 수집된 활동 정보가 어떠한 활동 참여도에 속하는지 확인할 수 있다. 전체 활동 참여도는 예컨 대, 활동 정보를 기반으로 산출된 복수개의 레벨들 및 각 활동 참여도들의 목표 달성률이나 성취도 등을 포함할 수 있다. 기본 활동 참여도는 앞서 설명한 바와 같이, 지정된 기간(예: 활동 가이드 정보 제공 프로그램 사용 초반부 일정 기간) 동안의 활동 정보를 기반으로 설정된 활동 참여도를 포함할 수 있다. 한 실시 예에 따르면, 활동 참여도 처리 모듈은 지정된 기간 동안 또는 지정된 횟수 동안 설정한 목표의 달성률이 지정된 조건을 만족하는 경우, 상대적으로 높은 활동 참여도를 나타내고 있는 것으로 판단할 수 있다. 활동 참여도 처리 모듈은 지정된 기간 동안 목표 달성률이 지정된 값 이하인 경우, 상대적으로 낮은 활동 참여도를 나타내고 있는 것으로 판단할 수 있다. 활동 참여도 처리 모듈은 활동 정보에 따른 활동 참여도 를 활동 가이드 정보 처리 모듈에 전달할 수 있다. 다양한 실시 예에 따르면, 활동 참여도 처리 모듈은 설정된 기본 활동 참여도 또는 활동 가이드 기능 중에 획득된 활동 참여도를 조정할 수 있다. 예컨대, 활동 참여도 처리 모듈은 지정된 크기 이상의 성취도(예: 목표 달성률)가 지정된 기간 이상(예: 7일 이상 등) 유지되는 경우, 설정된 활동 참여도를 수집된 활동 참여도 로 조정할 수 있다. 한 실시 예에 따르면, 활동 참여도 처리 모듈은 센서 정보 분석으로 판단된 활동 참여 도가 지정된 값 이하인 상태로 지정된 기간 동안 반복해서 발생하는 경우, 활동 참여도를 하향 조정할 수 있다. 또는, 활동 참여도 처리 모듈은 지정된 기간 동안 목표 달성률이 지정된 값 이상이어서 활동 참여도가 지 정된 크기 이상인 경우, 활동 참여도를 상향 조정할 수 있다. 활동 참여도 조정 시, 활동 참여도 처리 모듈 은 활동 참여도를 자동으로 변경한 후, 변경을 안내할 수 있다. 또는, 활동 참여도 처리 모듈은 활동 참여도 변경을 안내하고, 사용자 확인에 따라 활동 참여도를 변경하거나, 사용자 거부에 따라 이전 활동 참여도 를 유지할 수 있다. 다양한 실시 예에 따르면, 활동 참여도 처리 모듈은 본 발명의 사용자 기능이 초기화되는 경우 기본 설정 기간 동안의 활동 참여도 설정 기능을 자동으로 재수행할 수 있다. 상기 활동 가이드 정보 처리 모듈은 수신된 활동 정보, 패턴 정보(예: 현재의 활동 정보가 속한 활동 참여 도), 활동 참여도 정보 중 적어도 하나를 기반으로 출력할 활동 가이드 정보를 생성하거나 기 저장된 활동 가이 드 정보들 중 어느 하나의 활동 가이드 정보를 선택할 수 있다. 한 실시 예에 따르면, 활동 가이드 정보는 기본 설정 기능에 이용되는 정보들과, 활동 가이드 기능 중에 이용되는 정보들을 포함할 수 있다. 활동 가이드 정보 처리 모듈은 전자 장치의 사용자 기능 운용 상태에 따라 기본 설정 기능과 관련한 활동 가이드 정보 또는 활동 가이드 기능과 관련한 활동 가이드 정보 중 적어도 하나를 선택하여 출력할 수 있다. 한 실시 예에 따르면, 기본 설정 기능 이용 중에, 활동 가이드 정보 처리 모듈은 수집된 활동 정보를 기반 으로 활동 가이드 정보를 선택할 수 있다. 예컨대, 활동 가이드 정보 처리 모듈은 매 시간 단위 또는 일 단위 등으로 지정된 이전 시간 동안의 활동 정보를 분석한 패턴 정보를 기반으로 출력할 활동 가이드 정보를 선 택(또는 생성)하고, 출력할 수 있다. 다양한 실시 예에 따르면, 활동 가이드 정보 처리 모듈은 기본 설정 기간에 관한 정보(예: 기본 설정 시작 정보, 기본 설정 잔여 시간 정보, 기본 설정 경과 시간 정보 등)를 사용 자 입력에 따라 또는 지정된 스케줄링 시간에 따라 출력할 수 있다. 기본 설정 기능 종료 조건 만족에 따라, 기 본 설정 기능이 종료되면(예: 지정된 기간이 경과), 활동 가이드 정보 처리 모듈은 결정된 기본 활동 참여 도를 출력할 수 있다. 활동 가이드 정보 처리 모듈은 활동 가이드 기능 운용 중에, 활동 참여도의 종류 및 목표 달성률을 기반으 로 서로 다른 활동 가이드 정보를 출력할 수 있다. 예컨대, 활동 가이드 정보 처리 모듈은 설정된 활동 참 여도(예: 기본 설정 기간 동안 설정된 활동 참여도 또는 활동 가이드 기능 중에 갱신된 활동 참여도 등)의 종류 및 목표 달성률에 따라, 출력되는 활동 가이드 정보의 내용, 활동 가이드 정보의 출력 시점, 또는 출력 주기 등 을 다르게 할 수 있다. 예컨대, 동일한 목표 달성률이라 하더라도 상대적으로 낮은 활동 참여도가 설정되어 있는 경우, 활동 가이드 정 보 처리 모듈은 출력 주기가 상대적으로 더 적게 활동 가이드 정보를 출력할 수 있다. 출력 시점이 비활동 상태인 시점에, 정보의 내용이 운동 유도를 위하여 긍정적인 표현들의 내용을 포함할 수 있다. 또한, 예컨대, 동일한 목표 달성률이라 하더라도 상대적으로 높은 활동 참여도로 설정되어 있는 경우, 출력 주기가 상대적으로 (기본 활동 참여도가 낮은 경우보다) 더 많게, 출력 시점이 비활동 상태인 시점과 활동 상태인 시점에, 정보의 내용이 운동 유도를 위하여 긍정적인 표현 및 부정적인 표현들의 내용을 포함할 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 센서 정보를 수집하는 센서 및 상기 센서와 기능적으로 연결되는 프로세서, 상기 프로세서와 기능적으로 연결되고 상기 센서 정보를 저장하며, 상기 프로세 서에 의해 실행되는 적어도 하나의 명령어를 저장하는 메모리를 포함하고, 상기 프로세서에 의해 실행되는 명령 어는, 상기 센서를 이용하여 상기 전자 장치에 대응하는 사용자에 대한 활동 정보를 수집하고, 상기 수집하는 동작은 상기 활동 정보를 이용하여 지정된 목표에 대한 상기 사용자의 활동량 또는 활동 참여도를 생성하는 동 작을 포함하고, 상기 활동량 또는 상기 활동 참여도에 적어도 기반하여, 상기 사용자에 대한 활동 가이드 정보 의 출력 시점, 출력 주기, 출력 횟수, 또는 출력 내용 중 적어도 하나를 활동 가이드 변수로 조정하고, 및 상기 조정된 활동 가이드 변수를 이용하여 생성된 상기 활동가이드 정보를 상기 프로세서와 기능적으로 연결된 출력 장치를 통해 제공하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 상기 전자 장치에 대한 상황 정보(예: 전자 장치()의 움직임 상태 또는 움직임이 없는 상태, 사용자의 활동 상태 또는 비활동 상태, 스케줄 정보 등)를 확 인하고, 상기 상황 정보에 적어도 더 기반하여, 상기 활동 가이드 변수를 조정하도록 설정될 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 프로세서, 상기 프로세서와 전기적으로 연결 되고 상기 프로세서에 의해 실행되는 적어도 하나의 명령어를 저장하는 메모리를 포함하고, 상기 프로세서에 의 해 실행되는 명령어는 센서 정보의 수집 유무 또는 상기 센서 정보의 크기 중 적어도 하나를 기반으로 활동 정 보 수집하고, 설정된 목표를 기반으로 상기 활동 정보에 대해 출력할 활동 가이드 정보를 생성하고, 전자 장치 의 움직임 상태, 프로그램 참여 수준에 따라 설정된 활동 참여도, 현재 시간 중 적어도 하나를 기반으로 상기 활동 가이드 정보의 출력 시점, 출력 주기, 출력 횟수, 출력 내용 중 적어도 하나를 다르게 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 상기 활동 참여도가 상대적으로 높은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 짧게 하도록 하고, 상기 활동 참여도가 상대적으로 낮은경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 길게 하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 상기 활동 참여도가 상대적으로 높은 경우, 상기 활동 가이드 정보의 출력 횟수를 상대적으로 크게 하고, 상기 활동 참여도가 상대적으로 낮은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 적게 하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 상기 현재 상태가 움직임 상태이면, 상기 활동 가이드 정보의 출력을 생략하도록 하고, 상기 현재 상태가 지정된 시간 동안 비움직임(움직임이 없는) 상 태이면, 상기 활동 가이드 정보를 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 현재 상태가 움직임 상태이거나 또는 비움 직임 상태 인지를 구분하고, 구분된 상태에 대응하는 지정된 활동 가이드 정보를 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 현재 시간이 속하는 시간대에 따라, 다른 내용의 활동 가이드 정보를 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 출력할 활동 가이드 정보가 이전 출력된 활 동 가이드 정보와 동일한내용인 경우, 활동 가이드 정보의 내용을 변경하고, 변경된 활동 가이드 정보를 출력하 도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 상기 프로그램의 기본 설정 기간 동안의 활 동 정보를 기반으로 프로그램 참여 수준을 결정하고, 상기 결정된 프로그램 참여 수준에 따라 결정된 활동 참여 도를 저장하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 상기 활동 정보의 반복의 정도에 따라, 상 기 활동 참여도를 조정하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 상기 활동 정보의 크기가 지정된 크기 이하 로 지정된 시간 동안 유지되는 경우 상기 활동 참여도를 하향 조정하고, 상기 활동 정보의 크기가 지정된 크기 이상으로 지정된 시간 동안 유지되는 경우 상기 활동 참여도를 상향 조정하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서에 의해 실행되는 명령어는 상기 활동 가이드 정보 생성과 관련하여 상 기 활동 정보의 패턴을 분석하고, 상기 분석된 패턴과 저장된 기준 패턴들을 비교하여, 적어도 일부가 유사 또 는 동일한 패턴을 검출하고, 상기 검출된 패턴을 기준으로 활동 추정 정보를 산출한 후, 상기 활동 추정 정보와 상기 목표를 비교하여 목표 달성률을 산출하고 상기 산출된 목표 달성률을 기반으로 상기 활동 가이드 정보의 내용을 결정하도록 설정될 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 센서 정보를 수집하는 센서 또는 센서 정보를 외부 전자 장치로부터 수신하는 통신 인터페이스 중 적어도 하나, 상기 센서 또는 상기 통신 인터페이스와 전기 적으로 연결되는 프로세서, 상기 프로세서와 전기적으로 연결되고 상기 프로세서에 의해 실행되는 적어도 하나 의 명령어를 저장하는 메모리를 포함하고, 상기 프로세서에 의해 실행되는 명령어는 센서 정보의 수집 유무 또 는 상기 센서 정보의 크기 중 적어도 하나를 기반으로 활동 정보 수집하고, 설정된 목표를 기반으로 상기 활동 정보에 대해 출력할 활동 가이드 정보를 생성하고, 전자 장치의 현재 움직임 상태, 프로그램 참여 수준에 따라 설정된 활동 참여도, 현재 시간 중 적어도 하나를 기반으로 상기 활동 가이드 정보의 출력 시점, 출력 주기, 출 력 횟수 중 적어도 하나를 다르게 출력하도록 설정될 수 있다. 도 3은 한 실시 예에 따른 활동 가이드 정보 제공 구조를 설명하는 도면이다. 도 3을 참조하면, 활동 가이드 정보 제공 구조와 관련하여, 본 발명의 사용자 기능은 활동 가이드 정보(예: insight message or activity guide information)를 동일한 센서 정보에 대해서 다양한 형태로 제공할 수 있다. 예컨대, 활동 가이드 정보 제공 구조는 출력 시점(delivery time), 분석된 사용자 패턴(pattern), 제공될 활동 가이드 정보(insight message) 구조를 포함할 수 있다. 한 실시 예에 따르면, 출력 시점(delivery time)은 예 컨대, 아침(morning), 지정된 시간 주기(specific time period), 변경 시간(variable time), 사용자 지정 시간 (user fixed time) 등을 가질 수 있다. 또한, 상기 사용자 패턴(pattern)은 가이드 프로그램 수행 초반부 가이 드 프로그램 수행 초반부, 활동 참여 수준(low, mid, high, etc.)을 포함할 수 있다. 활동 가이드 정보는 각각 의 설정된 활동 참여도, 수집된 활동 정보가 속하는 활동 참여도에 따라, 복수개의 내용 또는 표현 중 적어도하나가 다른 메시지 정보를 포함할 수 있다. 상기 프로세서는 전자 장치에 출력할 시점과, 센서 정보를 바탕으로 사용자의 활동 패턴을 분석하고, 분석된 활동 패턴에 대응하는 활동 가이드 정보를 결정할 수 있다. 상기 활동 가이드 정보는 사용자가 설정한 목표에 대한 달성 여부, 목표 달성을 돕는 활동 가이드 정보, 목표 달성에 대한 보상(reward) 정보, 현재 진행 되고 있는 사용자 기능 수행 상태 정보, 리마인더(program reminder), 사용자 기능 준수 상태 정보, 모니터링된"}
{"patent_id": "10-2015-0151409", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "활동 요약 정보, 사용자 기능과 관련한 프로그램에서 전달하는 시스템 정보 등을 포함할 수 있다. 다양한 실시 예에 따르면, 본 발명의 활동 가이드 정보 제공 구조는 가이드 프로그램 수행 초반부에 해당하는 기본 설정 기간과 활동 가이드 기능 운용 기간으로 구분되어 운용될 수 있다. 활동 가이드 기능 운용 기간에 프 로세서는 활동 참여도(가이드 프로그램 수행 초반부 및 활동 가이드 기능 운용 기간 내내 프로그램 참여 수준 등으로 구분되는 레벨, 예: High, Mid, Low)와 수집된 활동 정보, 활동 가이드 정보의 출력 시점 등에 따 라 다양한 형태의 활동 가이드 정보를 출력할 수 있다. 프로세서는 기본 설정 기간(예: 가이드 프로그램 수행 초반부에 해당하는 지정된 기간)과 활동 가이드 기 능 운용 기간을 구분하여 다른 형태의 활동 가이드 정보를 출력할 수 있다. 또한, 프로세서는 사용자의 활 동 상태 및 최초 움직임 발생 시점(first movement)을 고려하여 활동 가이드 정보의 출력 시점을 조정할 수 있 다. 기본 설정 기간에, 프로세서는 설정된 목표에 대한 지정된 수준(예: 40%, 80%) 달성한 시점에 활동 가이드 정보를 전달할 수 있다. 기본 설정 기간이 지나면, 프로세서는 사용자의 비활동 상태 중 특정 시점에 목표 추정 달성률(예: 사용자의 그날 총 활동 시간의 추정치를 기반으로 산출되는 목표 달성 가능성)이 낮다고 판단 되면(예: 20%) 목표 달성을 위해서 열심히 해야 한다는 활동 가이드 정보를 추가로 전달할 수 있다. 기본 설정 기간은 지정된 특정 시간으로, 프로그램 이용 초기 14일, 20일 등으로 지정될 수 있다. 기본 설정 기 간에 프로세서는 운동(fitness) 프로그램에 대한 반감을 낮추고 흥미를 느낄 수 있도록 긍정적 내용을 포 함하는 정보로 분류된 활동 가이드 정보들을 출력할 수 있다. 프로세서는 기본 설정 기간이 지나면, 목표 달성을 높이기 위해 필요한 부정적 내용을 포함하는 정보로 분류된 활동 가이드 정보 및 긍정적인 내용을 포함 하는 활동 가이드 정보 중 적어도 하나를 출력할 수 있다. 다양한 실시 예에 따르면, 프로세서는 활동 가이드 정보의 내용이 사용자의 행동의 변화가 필요한지 아니 면 유지가 필요한 지 고려(사용자 active/inactive 상태 고려(step count, phone usage 등 활용))하여 활동 가 이드 정보를 출력할 수 있다. 예컨대, 프로세서는 사용자의 행동(상태)의 변화가 필요한 활동 가이드 정보 는 행동의 변화가 필요한 상태(시점)에 전달할 수 있다. 한 실시 예에 따르면, 프로세서는 사용자가 비활 동 상태이고, 현재 상태로는 목표 달성이 어렵다고 예측되면, 활동을 가지도록 하는 내용의 활동 가이드 정보를 전달할 수 있다. 프로세서는 또한, 사용자가 활동 상태인 시점에 비록 목표 달성이 어렵다고 예측되어도 활동 가이드 정보를 전달하지 않을 수 있다. 상기 프로세서는 행동 변화 필요를 요구하는 내용의 활동 가 이드 정보 생성 시, 행동 변화를 유도하는 내용의 데이터베이스를 이용할 수 있다. 전자 장치는 행동 변화 에 대한 다양한 사전 데이터베이스(예: 비활동 상태에서 활동 상태로 변경하도록 요청하는 내용의 메시지, 활동 상태를 유지하도록 요청하는 내용의 메시지 등을 포함)를 포함하고, 이를 제공할 수 있다. 예컨대, 사전 데이터베이스는 Halfway! 50% of goal achieved, Almost done! 90% of goal achieved, Don`t fall behind! Estimated active minutes 20 less than goal 등과 같은 메시지를 포함할 수 있다. 각 메시지에 는 행동 변화와 관련하여 어떠한 시점에 출력되어야 하는지에 대한 출력 조건 정보들이 매핑될 수 있다. 다양한 실시 예에 따르면, 기본 설정 기간 중에, 설정한 목표 달성이 실패한 경우, 프로세서는 다음날의 최초 움직임 시점에 목표 대비 어느 정도 수준이었는지에 대한 활동 가이드 정보를 출력할 수 있다. 기본 설정 기간이 지나면, 프로세서는 설정한 목표를 연속적으로 달성하지 못한 경우나(예: 2주, 2달, 3달) 목표를 지정된 일정 기간 동안(예: 7일) 연속해서 달성한 후에 하루를 실패를 하는 경우에 대한 활동 가이드 정보를 다 음 날 아침의 최초 움직임 시점에 출력할 수 있다. 프로세서는 일정 기간 이상(예: 7일) 목표보다 두 배 이상 달성한 경우나, 최근 거의 실패를 하지 않은 경우에(예: 일주일 동알 6일 이상, 2동안 12일 이상, 한달 동 안 27이상)에 대한 활동 가이드 정보를 다음날 아침의 최초 움직임 시점에 출력할 수 있다. 다양한 실시 예에 따르면, 기본 설정 기간에, 프로세서는 사용자의 프로그램 사용 동기를 높이고 운동 프 로그램에 적응하도록 하기 위해 어제 목표 달성에 실패한 경우에 목표 대비 어느 정도 수준이었는지를 전달할 수 있다. 기본 설정 기간이 지나면 사용자가 식상함을 느끼지 않게 하기 위해서, 프로세서는 목표 달성 실패에 대한 일일 피드백은 전달하지 않고, 거의 지속적으로 목표를 달성했거나 또는 지속적으로 목표를 달성하지 못했거나, 목표 달성 수준이 지속적으로 매우 높은 경우 등 지정된 수준 이상의 예외적인 경우에 활동 가이드 정보를 출력할 수 있다. 다양한 실시 예에 따르면, 프로세서는 사용자의 오전 최초 움직임 시점을 파악하여 해당 시점에 활동 가이 드 정보를 출력할 수 있다. 이때, 프로세서는 전자 장치의 폰 사용성 패턴, 현재 시간, 스텝 카운트 등을 고려하여 오전 최초 움직임 시점을 결정할 수 있다. 다양한 실시 예에 따르면, 프로세서는 전날에 대한 목표 달성 정도 또는 최근 목표 달성 현황 등과 관련한 활동 가이드 정보를 사용자에게 동기부여가 잘 될 수 있고 사용자가 목표 달성을 위한 계획을 세우기에 적절한 오전의 최초 움직임 시점에 전달할 수 있다. 상술한 활동 가이드 정보는 예컨대, ”Awesome! 98% of goals achieved in last 2 weeks.”, “Goal exceeded by 200 minutes on average. Try setting new goal.”, “Almost! Just 5 minutes below goal yesterday.”, “Goal not achieved for 1 month(20 minutes below on average).”, “Try setting new goal. Be more active and improve your health.” 등의 내용을 포함할 수 있다. 도 4는 한 실시 예에 따른 활동 가이드 정보 제공의 한 예를 설명하는 도면이다. 도 4를 참조하면, 전자 장치의 프로세서는 활동 참여도에 따라 활동 가이드 정보의 출력 시점과 주기, 출력 내용 중 적어도 하나를 다르게 줄 수 있다. 한 실시 예에 따르면, 프로세서는 활동 가이드 정 보 출력 시점이 활동 가이드 정보 출력 횟수에 따라 달라지도록 처리할 수 있다. 예컨대, 프로세서는 설정 된 기본 활동 참여도 또는 활동 참여도(예: 사용자의 프로그램 참여 수준에 따른 레벨)이 상대적으로 낮은(예: Low) 경우, 상대적으로 높은 경우(예: High)에 비하여 더 적은 횟수의 활동 가이드 정보를 출력할 수 있다. 상기 참여 수준의 크기는 예컨대, 활동 가이드 정보 제공 프로그램의 이용 시간 또는 이용 횟수 등으로 구분될 수 있다. 예컨대, 참여 수준의 크기는 일정 시간 단위 목표 설정과 목표 달성률, 목표 달성 여부 횟수 등을 기 설정된 기준 값을 기준으로 구분될 수 있다. 또한 프로세서는 수집된 센서 정보 분석(또는 센서 정보를 기반으로 활동 정보를 산출하고, 산출된 활동 정보를 분석)을 기반으로 지정된 시간 동안의 사용자 활동량(또는 활동 정보)이 사용자가 설정한 목표에 가까워 지거나 참여 수준(또는 참여도)이 증가 추세인 경우 사용자의 관심, 동기 부여를 할 수 있도록 활동 가이드 정 보의 출력 횟수를 높일 수 있다. 도시된 도면에서와 같이, 기본 활동 참여도 또는 현재 활동 정보를 통해 분석된 활동 참여도(예: 활동 가이드 기능 중에 획득된 활동 참여도)가 상대적으로 낮은 사용자의 활동 정보에 대해서, 프로세서는 상대적으로 더 적은 활동 가이드 정보를 출력할 수 있다. 또한, 기본 활동 참여도 또는 활동 참여도가 상대적으로 높은 사 용자의 활동 정보에 대해서 프로세서는 상대적으로 더 많은 활동 가이드 정보를 출력할 수 있다. 각 기본 활동 참여도 또는 활동 참여도에서 이용되는 활동 가이드 정보는 서로 다른 내용을 포함할 수 있다. 또한 동일 한 활동 참여도에서 동일한 활동 정보가 수집되는 경우, 프로세서는 이전 활동 정보와 관련하여 출력한 활 동 가이드 정보의 내용 또는 표현 중 적어도 일부가 다른 새로운 활동 가이드 정보를 출력할 수 있다. 도 5는 한 실시 예에 따른 활동 가이드 정보의 한 예를 설명하는 도면이다. 도 5를 참조하면, 프로세서는 출력 시점(delivery time), 활동 참여도(user pattern), 설정 목표 달성 상 태(condition)에 따라 출력할 활동 가이드 정보를 다르게 할 수 있다. 추가로, 프로세서는 기본 활동 참여 도에 따라서도 활동 가이드 정보를 다르게 하여 출력할 수 있다. 예컨대, 사용자 모니터링에 따른 센서 정보를 바탕으로 프로세서는 목표 달성 상태를 확인할 수 있다. 예컨대, onboarding 활동 참여도(기본 활동 참여 도)는 사용자가 목표까지 D% 달성한 상태, Low 활동 참여도는 사용자가 D% 목표 이하인 상태, Mid 활동 참여도 는 사용자가 목표를 달성한 상태, High 활동 참여도는 사용자가 목표 2배 이상 달성한 날이 지정 기간(x days) 인 상태 등을 나타낼 수 있다. 프로세서는 아침 출력 시점(morning)에, onboarding 사용자(프로그램 사용 초기 이용자)의 전자 장치에 D% 목표 달성에 대응하는 활동 가이드 정보를 출력할 수 있다. 프로세서는 아침 출력 시점(morning)에, 지정된 시간 동안 획득된 Low 활동 참여도를 나타내는 사용자의 전자 장치에 새로운 목표 설정을 요청(try setting new goal)하는 활동 가이드 정보를 출력할 수 있다. 프 로세서는 아침 출력 시점(morning)에, 지정된 시간 동안 획득된 활동 정보가 Mid 활동 참여도를 나타내는 사용자인 경우 목표 달성을 안내하는 활동 가이드 정보를 출력할 수 있다. 프로세서는 아침 출력 시점에지정된 시간 동안 획득된 활동 정보가 High 활동 참여도를 나타내는 사용자인 경우 뛰어난 활동량을 나타내고 있음을 지시하는 활동 가이드 정보를 출력할 수 있다. 다양한 실시 예에 따르면, 프로세서는 현재 나타나 고 있는 활동 참여도(참여 수준으로서, 기본 활동 참여도 또는 활동 참여도)에 따라서 프로그램 사용자를 독려 하거나, 새로운 목표를 제안하여 프로그램의 관심을 유도하고, 프로그램 참여 수준을 지속적으로 유지시킬 수 있다. 프로세서는 활동 가이드 정보를 제공하는 과정에서, 이전 설정된 활동 참여도를 기준으로, 현재 획 득된 활동 정보가 속하는 활동 참여도에 따라 다양한 활동 가이드 정보를 출력할 수 있다. 다양한 실시 예에 따르면, 프로세서는 전자 장치의 연산 능력의 한계, 배터리 부족 등과 같은 여러 제약사항이 발생하는 경우, 패턴 분석(예: 활동 정보가 속하는 활동 참여도 판단), 활동 가이드 정보 전달 시점 결정, 활동 가이드 정보 내용 조정 중 적어도 하나 이상을 외부 연결된 전자 장치, 혹은 클라우드 서버, 지정된 서버 등을 통해 수행하고, 해당 외부 장치로부터 수신된 수행 결과를 출력할 수도 있다. 도 6은 한 실시 예에 따른 활동 가이드 정보 제공 방법을 설명하는 도면이다. 도 6을 참조하면, 동작 601에서, 전자 장치(예: 프로세서)는 기본 설정 동작(예: 프로그램 사용 초기 또는 초기화된 프로그램의 재사용 초기 기간에서의 동작)을 수행할 수 있다. 예컨대, 전자 장치의 프로세 서는 본 발명의 사용자 기능과 관련한 프로그램이 설치되고 기본 설정과 관련한 입력 이벤트를 수신하면, 기본 설정 상태로 진입할 수 있다. 기본 설정 동작과 관련하여, 프로세서는 전자 장치 또는 외부 전 자 장치(예: wearable 기기, 혹은 센싱 정보를 수집할 수 있는 다양한 IOT 기기들)와 연결되어 센서 정보 를 수집하고, 센서 정보로부터 활동 정보를 획득할 수 있다. 또한, 프로세서는 사용자로부터 목표 설정 값 을 설정할 수 있다. 이와 관련하여, 프로세서는 목표 설정과 관련한 화면 인터페이스를 제공할 수 있다. 기본 설정 동작에서, 프로세서는 획득된 사용자의 활동 정보를 이용하여, 사용자의 활동 패턴을 분석하고, 분석된 내용을 바탕으로 사용자에게 설정된 목표를 완수할 수 있는 활동 가이드 정보를 생성하고, 상기 활동 가 이드 정보 출력 시점을 결정할 수 있다. 가이드 프로그램 수행 초반부는 사용자가 활동 가이드 정보 제공 프로그램을 지정된 시간 또는 지정된 횟수 이 상 이용하는 과정에서, 지정된 활동 가이드 정보를 제공하면서, 활동 참여도를 결정하는 과정을 포함할 수 있다. 상술한 기본 설정 과정은 디폴트로 정의되거나, 사용자 선택에 따라 조정될 수 있다. 예컨대, 상기 기본 설정 과정은 예컨대, 최초 프로그램 실행 이후 지정된 시일(예: 14일)이 경과되는 시점까지 프로그램을 운용하 는 과정을 포함할 수 있다. 다양한 실시 예에 따르면, 기본 설정 과정에서의 기간은 사용자의 개인 정보(예: 나 이, 직업, 사용자가 입력한 평소 운동량, 성별 등)를 기반으로 다르게 정의될 수 있다. 또는 다양한 실시 예에 따르면, 기본 설정 과정에서의 기간은 사용자의 프로그램 참여 수준에 따라 탄력적으로 운용될 수 있다. 예컨대, 사용자의 일일(또는 일주) 프로그램 참여 수준이 지정된 값 이하(또는 이상)이면 상대적으로 더 긴 시 간이 기본 설정 기간으로 정의될 수 있다. 또한, 사용자의 일일(또는 일주) 프로그램 참여 수준이 지정된 값 이 상(또는 이하)이면, 상대적으로 더 짧은 시간이 기본 설정 기간으로 정의될 수 있다. 기본 설정 동작에서, 지정 된 시간이 경과하면, 프로세서는 지정된 시간 동안의 활동 정보를 토대로 사용자의 활동 참여도를 결정할 수 있다. 프로세서는 기본 설정 동작에서는 프로그램에 대한 안내 정보, 활동 유도 정보 등을 제공할 수 있다. 동작 603에서, 프로세서는 활동 참여도 결정 여부를 확인할 수 있다. 활동 참여도가 결정되지 않은 경우, 프로세서는 동작 601로 분기하여 이하 동작을 재수행할 수 있다. 활동 참여도가 결정된 경우, 프로세서는 동작 605에서 활동 참여도에 따른 활동 가이드 기능을 운용할 수 있다. 예컨대, 프로세서는 사용자의 프로그램 참여 수준에 따라 일정 활동 참여도를 결정할 수 있다. 한 실시 예에 따르면, 프로세서는 기본 설정 과정에서의 프로그램 참여 수준에 따라, 활동 참여도를 Low, medium, high로 결정할 수 있다. 예컨대, 사용자가 14일 중 3일, 7일, 10일 프로그램을 운용(예: 일일 목표 설 정 및 지정된 기준치 이상의 목표 달성을 위한 활동)했다면 활동 참여도는 사용 시간에 따라 각각 low, medium, high로 정의할 수 있다. 다양한 실시 예에 따르면, 상술한 활동 참여도는 사용자의 개인 정보에 따라 다르게 적 용될 수 있다. 예컨대, 프로그램에 대한 동일 사용 기간을 가지더라도, 상대적으로 나이 많은 사용자의 활동 참 여도는 상대적으로 나이 적은 사용자보다 높을 수 있다. 상기 프로세서는 결정된 활동 참여도를 기준으로, 이후, 사용자가 입력한 목표 및 목표 달성률을 미리 정 해진 시간 간격(예: 실시간, daily, weekly 그리고 monthly 등 다른 time period 기준)으로 분석할 수 있다. 이를 기반으로, 프로세서는 사용자가 설정한 목표에 해당 시간에 달성할 수 있을지 예측할 수 있다. 예컨 대, 프로세서는 적어도 하나의 사용자들의 과거 프로그램 사용 이력(또는 기본 설정 과정에서의 사용이력)을 시간 연속 그래프로 변환하고, 클러스터링을 수행한 후, 클러스터링된 그룹들의 평균 사용 이력을 기준 으로 목표 달성 가능성에 대한 예측률을 계산할 수 있다. 다양한 실시 예에 따르면, 프로세서는 설정된 목표를 달성한 날의 패턴을 기반으로 활동 가이드 정보를 제 공할 수 있다. 프로세서는 사용자(또는 다수의 사용자들)의 과거 목표 달성 패턴과, 최근 특정 기간 동안 의 달성 패턴을 비교하여 차이점을 제공할 수 있다. 예를 들면, 프로세서는 최근 특정 기간 동안 n% 이상 (또는 이하) 목표를 달성했다면, 목표 달성에 대한 활동 가이드 정보를 제공할 수 있다. 또한 프로세서는 특정 기간 동안의 목표 달성 빈도, 트랜드 등을 분석하고, 분석 결과에 따른 활동 가이드 정보를 제공할 수 있 다. 한 실시 예에 따르면, 프로세서는 사용자가 설정한 목표를 특정 기간 동안 2배 정도 달성하였다면 사용자 의 목표를 높이이라는 활동 가이드 정보를 출력할 수 있다. 또한, 프로세서는 설정 목표 달성률이 절반인 경우, 목표를 낮출 것을 추천하는 활동 가이드 정보를 출력할 수 있다. 다양한 실시 예에 따르면, 프로세서는 예를 들어 일주일 중 계속 목표를 달성하다가 직후 목표를 달성 못 했다면 실수와 관련한 내용의 활동 가이드 정보를 출력할 수 있다. 프로세서는 일주일 동안 계속 목표를 달성 못하다가 이후 목표를 달성한 경우, 그에 관한 내용을 포함하는 활동 가이드 정보를 출력할 수 있다. 상술 한 기능 제공에서, 전자 장치는 사용자의 과거 이력과 관련한 정보는 서버 등을 통하여 제공받을 수 있다. 또한, 전자 장치는 사용자의 과거 이력 제공을 위하여, 활동 정보, 패턴 분석 정보 등을 상기 서버에 제공 할 수도 있다. 도 7은 한 실시 예에 따른 활동 가이드 정보 제공 방법 중 기본 설정 방법을 설명하는 도면이다. 도 7을 참조하면, 기본 설정 방법과 관련하여, 전자 장치 운용과 관련한 입력 이벤트가 발생하면, 동작 701에서, 전자 장치(예: 프로세서)는 발생한 입력 이벤트가 기본 설정 상태 진입과 관련한 입력 이벤트인 지 확인할 수 있다. 기본 설정 상태 진입과 관련이 없는 이벤트인 경우, 동작 703에서, 프로세서는 입력 이벤트 종류에 대응하는 기능 처리를 수행할 수 있다. 기본 설정 상태 진입과 관련한 이벤트는 예컨대 활동 가 이드 정보 제공 프로그램을 설치하고 최초 실행을 요청하는 입력 이벤트, 기본 설정 메뉴를 선택하는 입력 이벤 트, 프로그램 초기화를 요청하는 입력 이벤트 등을 포함할 수 있다. 기본 설정 상태 진입과 관련한 입력 이벤트가 발생하면, 동작 705에서, 프로세서는 기본 활동 정보를 수집 할 수 있다. 기본 활동 정보는 지정된 크기 이상의 센서 정보가 수집되는 시간 구간, 센서 정보의 종류, 센서 정보 미 수집 시간 구간 또는 지정된 크기 이하의 센서 정보가 수집된 시간 구간의 정보를 포함할 수 있다. 동작 707에서, 프로세서는 수집된 기본 활동 정보에 따른 기본 활동 가이드 정보를 생성 및 출력할 수 있 다. 예컨대, 프로세서는 기본 활동 정보의 패턴 분석을 수행할 수 있다. 프로세서는 저장된 기준 패 턴과 기본 활동 정보 기반의 패턴을 분석하여 어떠한 기준 패턴에 해당하는지 확인할 수 있다. 프로세서는 대응되는 기준 패턴을 검출하고, 해당 기준 패턴에 매핑된 기본 활동 가이드 정보를 선택할 수 있다. 프로세서 는 선택된 기본 활동 가이드 정보를 디스플레이 또는 입출력 인터페이스를 통해 출력할 수 있다. 다양한 실시 예에 따르면, 프로세서는 활동 참여도에 따른 활동 가이드 정보 제공을 할 수 있다. 예를 들 어, 프로세서는 사용자 활동 참여도를 onboarding, low, medium, high 등으로 구분하고, 프로그램 시작 후, 초반(기본 설정 상태)에는 사용자가 설정한 목표 혹은 짧은 기간(ex. 수일, 1~2주 등) 동안 수행한 운동 정 보 및 진행 상태를 제공한다. 다양한 실시 예에 따르면, 사용자가 현재 실행하고 있는 프로그램을 시작한지 얼마 되지 않는 경우(예: 기본 설 정의 경우)와 일정 시간 이상 지속적으로 프로그램을 사용하였는지 여부(예: 활동 참여도)에 따라서 활동 가이 드 정보 제공의 내용을 달리할 수 있다. 예를 들어 프로세서는 기본 설정 상태에서는 사용자의 참여 수준 을 줄일 것으로 예상되는 메시지 출력을 제한할 수 있다. 예컨대, 프로그램 사용 초기(예: 기본 설정)의 경우, 프로세서는 사용자의 상태를 모니터링하고 이에 대한 사실 정보(fact)를 제공할 수 있다. 또는 프로세서 는 기본 설정 상태에서 분발, 참여 유도와 같은 메시지의 빈도를 상대적으로 줄일 수 있다. 이 때, 상기 기본 설정은 onboarding 시기에 해당될 수 있다. 동작 709에서, 프로세서는 기본 설정 상태 종료와 관련한 조건이 만족되는지 확인할 수 있다. 예컨대, 프 로세서는 기본 설정 기능과 관련하여 지정된 시간이 경과 여부를 확인할 수 있다. 또는, 프로세서는 기본 설정 기능과 관련하여, 지정된 양 이상의 센서 정보 수집 여부, 지정된 횟수 이상의 기본 활동 가이드 정보 출력 여부, 기본 설정 상태 종료를 지시하는 입력 이벤트 발생 여부 등을 확인할 수 있다. 프로세서는 기본 설정 상태 종료와 관련한 조건이 만족되지 않은 경우, 동작 705 이전으로 분기하여 이하 동작을 재수행할 수 있다. 기본 설정 상태 종료와 관련한 조건이 만족되면, 동작 711에서, 프로세서는 기본 활동 정보들을 기반으로 활동 참여도 결정 및 저장을 수행할 수 있다. 동작 713에서, 프로세서는 기본 설정에 대한 재설정 조건이 만족되는지 확인할 수 있다. 재설정 조건은 예 컨대, 본 발명의 사용자 기능이 초기화되거나, 기본 설정을 요청하는 입력 이벤트가 발생하는 조건일 수 있다. 상술한 재설정이 없는 경우, 프로세서는 기본 설정 기능을 종료할 수 있다. 재설정 조건이 발생하는 경우, 프로세서는 동작 705 이전으로 분기하여 이하 동작을 재수행할 수 있다. 도 8은 한 실시 예에 따른 활동 참여도 조정 방법을 설명하는 도면이다. 도 8을 참조하면, 활동 참여도 조정 방법과 관련하여, 동작 801에서, 전자 장치(예: 프로세서)는 활동 정 보를 수집할 수 있다. 예컨대, 프로세서는 센서가 수집한 센서 정보들 중 지정된 크기 이상의 움직임 에 대응하는 센서 정보와 지정된 크기 이하의 움직임에 대응하는 센서 정보를 구분하여 활동 정보를 수집할 수 있다. 동작 803에서, 프로세서는 설정된 활동 참여도 및 활동 정보를 기반으로 활동 가이드 정보를 출력할 수 있 다. 예컨대, 프로세서는 현재 시점을 기준으로 이전 지정된 시간 범위 동안의 활동 정보들을 분석하여 패 턴을 추출할 수 있다. 프로세서는 추출한 패턴과 동일 또는 유사한 패턴을 가지는 특정 패턴을 저장된 기 준 패턴들에서 검출할 수 있다. 프로세서는 검출된 패턴에 매핑된 활동 가이드 정보를 출력할 수 있다. 다 양한 실시 예에 따르면, 프로세서는 검출된 패턴을 기반으로 사용자가 설정한 목표에 대한 달성 예측률을 산출할 수 있다. 프로세서는 달성 예측률에 따라 설정된 활동 가이드 정보를 출력할 수 있다. 이 동작에서, 프로세서는 활동 참여도 또는 활동 가이드 정보가 생성된 시점에 따라 활동 가이드 정보의 출력 여부, 출력 시기, 출력 주기, 출력 횟수, 출력 내용 중 적어도 하나를 다르게 출력할 수 있다. 동작 805에서, 프로세서는 수집된 활동 정보를 기반으로 활동 참여도 변경 조건을 확인할 수 있다. 예컨대, 프로세서는 수집된 활동 정보에 대응하는 패턴을 추출하고, 추출된 패턴이 어떠한 활동 참여도에 대응하는지 판단할 수 있다. 프로세서는 추출된 패턴이 활동 참여도와 다른 경우, 활동 참여도 변경 조건 을 만족하는 것으로 판단할 수 있다. 또는, 프로세서는 추출된 패턴이 활동 참여도와 다른 상황이 유지되 는 지속 시간 또는 추출된 패턴이 활동 참여도와 다른 상황이 발생한 횟수가 지정된 값 이상인지 확인할 수 있 다. 프로세서는 추출 패턴이 활동 참여도와 다른 상황의 지속 시간 또는 발생 횟수가 지정된 값 이상이면 활동 참여도 변경 조건을 만족하는 것으로 판단할 수 있다. 활동 참여도 변경 조건이 만족되는 경우, 동작 807에서, 프로세서는 활동 정보를 기반으로 활동 참여도를 조정할 수 있다. 예컨대, 프로세서는 활동 정보를 기반으로 활동 참여도를 하향 조정하거나 또는 상향 조 정할 수 있다. 예컨대, 프로세서는 활동 참여도가 Mid이며, 활동 참여도 변경과 관련하여 활동 정보의 추 출 패턴이 High 패턴인 경우, 활동 참여도를 High로 변경할 수 있다. 또는, 활동 참여도 변경과 관련하여 활동 정보의 추출 패턴이 Low 패턴인 경우, 활동 참여도를 Low로 변경할 수 있다. 활동 참여도 변경에 따라, 프로세 서는 출력할 활동 가이드 정보의 종류를 변경할 수 있다. 앞서 도 3 등에서 설명한 바와 같이, 활동 가이 드 정보는 활동 참여도에 따라 사용되는 정보의 내용, 정보 출력의 횟수, 정보 출력의 주기, 정보 출력의 시점 등이 다르게 정의될 수 있다. 활동 참여도 변경 조건이 만족되지 않는 경우, 프로세서는 동작 801 이전으로 분기하여 이하 동작을 재수 행할 수 있다. 다양한 실시 예에 따르면, 상술한 설명에서는 기본 설정 동작 수행 이후, 활동 가이드 기능을 수행하는 것으로 설명하였으나, 본 발명의 다양한 실시 예들이 이에 한정되는 것은 아니다. 예컨대, 본 발명의 활동 가이드 정보 제공 프로그램은 기본 설정 기간의 운용 없이, 활동 가이드 기능을 기반으로 다양한 상황에 따른 활동 가이드 정보를 제공할 수 있다. 이와 관련하여, 전자 장치는 디폴트로 활동 참여도를 결정하고, 사용자의 활동 정보(또 는 행동 패턴) 등에 따라, 활동 참여도를 변경할 수 있다. 이 동작에서, 전자 장치()는 지정된 시간 동안에는 제1 시간 단위(예: 실시간 또는 1시간 단위 등)로 활동 참여도를 변경하고, 지정된 시간이 경과된 이후에는 제2 시간 단위(예: 일단위, 주단위, 월 단위 등)로 활동 참여도를 변경할 수 있다. 전자 장치는 변경된 활동 참여도 를 기준으로, 현재 활동 정보의 참여도 레벨에 따라 활동 가이드 정보를 생성하고, 이를 출력할 수 있다. 출력 과정에서, 전자 장치()는 활동 가이드 정보의 출력 여부, 출력 시점, 출력 횟수, 출력 주기, 출력 내용 중 적어도 하나를 활동 가이드 변수로 설정하고, 상황에 따라, 상기 활동 가이드 변수의 조정에 따라 다양한 활동 가이 드 정보 중 어느 하나를 출력할 수 있다. 도 9는 한 실시 예에 따른 활동 가이드 정보 생성 방법을 설명하는 도면이다. 도 9를 참조하면, 활동 가이드 정보 생성 방법과 관련하여, 동작 901에서, 전자 장치(예: 프로세서)는 센 서를 이용하여 활동 정보 수집을 수행할 수 있다. 예컨대, 프로세서는 실시간으로 또는 일정 주기로 센서 정보를 수집할 수 있다. 프로세서는 센서 정보를 지정된 크기 이상인 움직임에 대응하는 센서 정보와, 지정된 크기 이하의 움직임에 대응하는 센서 정보를 분류할 수 있다. 또한, 프로세서는 센서 정보 가 수집되지 않는 시간 정보를 수집할 수 있다. 상기 프로세서는 상술한 센서 정보 및 센서 정보 미 수집 시간 등에 대응하는 활동 정보를 수집할 수 있다. 동작 903에서, 프로세서는 지정된 시간 구간(예: 상기 윈도우) 동안의 누적 활동 정보 분석을 수행할 수 있다. 예컨대, 프로세서는 현재 시점을 기준으로 이전 일정 시간(예: 6시간) 동안의 누적된 활동 정보 분 석을 수행할 수 있다. 프로세서는 예컨대, 센서 정보 수집이 없는 구간, 지정된 크기 이상의 움직임에 대 응하는 센서 정보가 수집된 구간 등을 그래프 형태로 처리하여, 누적된 활동 정보에 대한 패턴을 추출할 수 있 다. 동작 905에서, 프로세서는 활동 추정 정보를 산출할 수 있다. 프로세서는 추출된 패턴(예: 6시간 동 안의 활동 패턴)과 동일 또는 유사한 특성의 패턴을 기준 패턴들에서 검출할 수 있다. 이와 관련하여, 전자 장 치는 다양한 기준 패턴들을 저장할 수 있다. 상기 기준 패턴들은 예컨대 다양한 시간대의 패턴 정보들을 포함할 수 있다. 예컨대, 기준 패턴들은 오전 6시부터 저녁 12시 또는 오전 6시부터 그 다음날 오전 5시 59분까 지의 패턴 정보들을 포함할 수 있다. 상기 프로세서는 유사 패턴 검출과 관련하여, 활동 정보 수집 시간대 정보를 이용할 수 있다. 예컨대, 프로세서는 기준 패턴들 중 추출된 패턴이 분석된 시간대와 동일한 시간 대에서의 패턴이 동일 또는 유사한 패턴을 기준 패턴들에서 검출할 수 있다. 프로세서는 동일 또는 유사 패턴이 검출되면, 해당 기준 패턴의 나머지 시간 대에서의 패턴 정보를 토대로 활동 추정 정보를 산출할 수 있 다. 동작 907에서, 프로세서는 목표 추정 달성률 산출을 수행할 수 있다. 예컨대, 프로세서는 사용자가 설정한 목표와 활동 정보 및 활동 추정 정보를 토대로 목표를 달성할 수 있을지, 또는, 목표의 어느 정도를 달 성할 수 있을지 등을 산출할 수 있다. 한 실시 예에 따르면, 프로세서는 사용자가 설정한 목표 달성과 관 련한 패턴을 기준 패턴들에서 산출할 수 있다. 여기서, 전자 장치는 설정 목표 값들을 달성하기 위한 기준 패턴들에 대한 정보를 저장할 수 있다. 목표 달성과 관련한 기준 패턴이 검출되면, 프로세서는 활동 추정 정보에 이용되는 패턴 정보와 기준 패턴을 비교하여, 일치율 또는 상이율을 산출할 수 있다. 프로세서는 활동 추정 정보가 기준 패턴보다 낮은 경우 목표 추정 달성률이 낮은 것으로 판단하고, 활동 추정 정보가 기준 패턴과 가깝거나 높을수록 목표 추정 달성률이 높은 것으로 판단할 수 있다. 동작 909에서, 프로세서는 활동 참여도, 현재 시간, 목표 추정 달성률 중 적어도 하나를 기반으로 활동 가 이드 정보를 생성할 수 있다. 예컨대, 프로세서는 분석된 정보를 바탕으로 사용자에게 독려, 현상 유지, 분발, 동기 부여, 현재 상태 전달 등과 같은 정보를 생성할 수 있다. 예컨대, 프로세서는 실시간 모니터링 정보에 대한 분석 결과 혹은 과거 사용자의 목표 달성 형태(달성, 미달성 등)를 적어도 하나 이상 결합하여 활 동 가이드 정보(예: 알림, 가이드, 부가정보, 차트 등)를 생성할 수 있다. 예컨대, 프로세서는 목표 추정 달성률이 높은 경우, 목표 추정 달성이 가능함을 시사하는 활동 가이드 정 보를 출력할 수 있다. 이때, 프로세서는 현재까지의 활동 시간이 목표 완료 설정 시간(예: 2시간)보다 크 게 못 미치는 경우(예: 30분)와 목표 완료 설정 시간과 가까운 경우(예; 1시간 50분) 등에 따라 다른 내용의 활 동 가이드 정보를 생성할 수 있다. 예컨대, 프로세서는 목표 완료 설정 시간보다 작은 경우에는 잘해나가 기를 안내하는 내용의 활동 가이드 정보를 생성하여 출력할 수 있다. 프로세서 목표 완료 설정 시간과 가 까운 경우에는, 현재까지 잘해 왔고, 조금 더 활동을 하면 완전한 목표 달성이 가능함을 안내하는 활동 가이드 정보를 생성하여 출력할 수 있다. 다양한 실시 예에 따르면, 프로세서는 활동 참여도에 따라 출력하는 활동 가이드 정보의 내용 또는 출력 주기를 다르게 할 수 있다. 예컨대, 프로세서는 활동 참여도가 Low인 경우 사용자의 참여 수준을 칭찬하는 내용의 활동 가이드 정보를 생성 및 출력하고, 활동 참여도가 High인 경우 사용자의 목표 달성을 위해 조금 더 활동을 유도하는 내용의 활동 가이드 정보를 생성 및 출력할 수 있다.다양한 실시 예에 따르면, 프로세서는 프로그램에 대한 동일한 수행 결과가 반복적으로 나오고 있는 경우, 정해진 시간에 메시지를 제공하지 않고 변화를 줄 수 있다. 예컨대, 프로세서는 정해진 시간에 분석 혹은 활동 가이드 정보를 제공하지 않고, 기존에 제공했던 시간 간격 혹은 정해진 시간보다 랜덤하게 변위시간을 부 여하여 활동 가이드 정보를 출력할 수 있다. 이를 기반으로, 프로세서는 사용자가 활동 가이드 정보의 출 력 예측에 변화를 줌으로서, 프로그램 사용에 대한 식상함을 느끼지 않도록 하는 효과를 부여할 수 있다. 다양한 실시 예에 따르면, 프로세서는 활동 가이드 정보를 전달하는 시간대별로 내용을 다르게 전달할 수 있다. 예컨대, 프로세서는 time delivery windows(활동 가이드 정보를 제공할 시간대로서, 예컨대, 아침 시간대, 오후 시간대 등)에 대해서 고려할 수 있다. 프로세서는 활동 가이드 정보를 전해주기 위해 설정된 일단위 중 최초 움직임(예: first morning movement)을 보이는 아침 시간대 및 사용자의 활동이 활발한 오후 시 간대 등 사용자의 활동 정보를 기반으로 시간 윈도우(time windows)를 구분하고 시간 윈도우별로 다른 정보 제"}
{"patent_id": "10-2015-0151409", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "공(ex, 아침 시간대: 전날까지의 요약 정보 전달 및 관련 활동 가이드 정보 제공)할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 열거된 요소들을 적어도 하나 이상을 사용하여 사용자에 게 전달할 활동 가이드 정보를 생성 또는 선택하는데 활용할 수 있다. 도 10은 한 실시 예에 따른 활동 가이드 정보 출력 방법을 설명하는 도면이다. 도 10을 참조하면, 활동 가이드 정보 출력 방법과 관련하여, 동작 1001에서, 전자 장치(예: 프로세서)는 활동 가이드 정보 생성 여부를 확인할 수 있다. 활동 가이드 정보 생성이 없는 경우, 동작 1003에서, 프로세서 는 지정된 기능 수행을 처리할 수 있다. 예컨대, 프로세서는 활동 정보를 수집할 수 있다. 동작 1005에서, 프로세서는 전자 장치의 상황 정보(예: 상태 정보, 전자 장치의 움직임 정보, 또는 일정 정보)를 수집할 수 있다. 예컨대, 프로세서는 전자 장치의 움직임 여부에 따라 활동 상태인지 또는 비활동 상태인지 판단할 수 있다. 프로세서는 지정된 크기 이상의 움직임이 있는 경우, 활동 상태로 판단하고, 지정된 크기 이하의 움직임이 있거나 또는 움직임이 없는 경우 비활동 상태로 판단할 수 있다. 동작 1007에서, 프로세서는 상태 정보를 기반으로 활동 가이드 정보 변경 조건이 만족되는지 확인할 수 있 다. 예컨대, 프로세서는 전자 장치가 비활동 상태로 지정된 시간 이상 유지되는 경우 활동 가이드 정 보 변경 조건을 만족하는 것으로 판단할 수 있다. 또는, 프로세서는 전자 장치가 비활동 상태로 지정 된 시간 이상 있다가 활동 상태로 변경되는 경우, 활동 가이드 정보 변경 조건을 만족하는 것으로 판단할 수 있 다. 다양한 실시 예에 따르면, 프로세서는 활동 가이드 정보를 출력하는 시점에 전자 장치가 활동 상 태이면 활동 가이드 정보 변경 조건을 만족하는 것으로 판단할 수 있다. 활동 가이드 정보 변경 조건이 만족되는 경우, 동작 1009에서, 프로세서는 활동 가이드 정보를 변경하고, 변경된 활동 가이드 정보를 디스플레이 또는 입출력 인터페이스 중 적어도 하나를 통해 출력할 수 있 다. 예컨대, 프로세서는 디스플레이에 지정된 화면, 오디오 장치를 통해 지정된 오디오 정보를 출력 하도록 제어할 수 있다. 다양한 실시 예에 따르면, 프로세서는 활동 가이드 정보가 생성되고, 출력 시점이 도래했는데, 출력 상태가 활동 상태이면, 활동 가이드 정보 출력을 생략할 수 있다. 또는, 프로세서는 활 동 가이드 정보의 내용이 활동을 유도하는 내용이 포함된 경우, 이미지 활동을 시작했기 때문에, 활동 시작을 칭찬하는 내용의 활동 가이드 정보를 출력하도록 제어할 수 있다. 다양한 실시 예에 따르면, 프로세서는 사용자가 현재 활동 상태(또는 움직이고 있는 상태)에서 활동 가이 드 정보를 출력하는 경우 상대적으로 긍정적인 내용을 가지도록 정보 변경을 수행한 후 활동 가이드 정보를 출 력할 수 있다. 프로세서는 사용자가 현재 비활동 상태에서 활동 가이드 정보를 출력하는 경우 상대적으로 부정적인 내용을 가지도록 정보 변경을 수행한 후 활동 가이드 정보를 출력할 수 있다. 다양한 실시 예에 따르 면, 프로세서는 목표 달성 진행률(예, 50%, 60%, 90%, 95%)에 따라, 진행 정도 기반으로 활동 가이드 정보 의 제공 시점 및 내용을 결정할 수 있다. 활동 가이드 정보 변경 조건이 만족되지 않는 경우, 동작 1011에서, 프로세서는 활동 가이드 정보 출력 조 건이 만족되는지 확인할 수 있다. 활동 가이드 정보 출력 조건이 만족되지 않는 경우, 프로세서는 동작 1005 이전으로 분기하여 이하 동작을 재수행할 수 있다. 상술한 바와 같이, 사용자에게 전달할 활동 가이드 정보는 프로그램 수행 초기인지 여부, 프로그램의 참여 수준 에 기반하여 메시지 전달 횟수 및 간격의 조절, 사용자에 의해서 정해진 시간 혹은 사용자의 프로그램 수행 가 능 시간 여부 등 중 적어도 하나가 조정될 수 있다. 프로세서는 아침, 점심, 저녁, 취침 전과 같은 시간을메시지 전달 시간으로 결정하고, 해당 시간 도래 여부를 확인할 수 있다. 하나의 실시 예에 따르면, 프로세서 는 사용자가 활발하게 활동하는 시간인지 여부, 목표를 달성한 날 혹은 달성이 거의 확실시 되는 시점의 도래 여부를 확인할 수 있다. 다양한 실시 예에 따르면, 프로세서는 활동 가이드 정보를 전달할 시점이 결 정되면, 사용자의 상황에 맞는 메시지를 결정할 수 있다. 다양한 실시 예에 따르면, 프로세서는 활동 참여도에 따라서 활동 가이드 정보 제공의 시점을 달리할 수 있다. 예컨대, 프로세서는 프로그램 수행 초기인 경우, 자주 정보를 제공하여 프로그램에 대한 관심을 유 도할 수 있다. 프로그램 수행 참여 수준이 낮은 경우, 프로세서는 다른 참여 수준에 비해서 활동 가이드 정보 제공 시점을 달리하여 지나치게 빈번하게 제공하여 사용자의 불편함을 초래하지 않도록 메시지 제공 횟수 를 낮출 수 있다. 반면 수행 참여 수준이 높아질수록, 프로세서는 프로그램 수행상황 혹은 목표 달성율에 대한 정보를 자주 제공하여 목표를 달성할 수 있도록 유도할 수 있다. 활동 가이드 정보 출력 조건이 만족되는 경우, 동작 1013에서, 프로세서는 활동 가이드 정보 출력을 수행 할 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 활동 가이드 정보 제공 방법은 센서를 이용하여 전자 장치 에 대응하는 사용자에 대한 활동 정보를 수집하는 동작, 상기 활동 정보를 이용하여 지정된 목표에 대한 상기 사용자의 활동량 또는 활동 참여도를 생성하는 동작, 상기 활동량 또는 상기 활동 참여도에 적어도 기반하여, 상기 사용자에 대한 활동 가이드 정보의 출력 시점, 출력 주기, 출력 횟수, 또는 출력 내용 중 적어도 하나를 활동 가이드 변수로 조정하는 동작, 상기 조정된 활동 가이드 변수를 이용하여 생성된 상기 활동가이드 정보를 출력 장치를 통해 제공하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 상황 정보에 적어도 더 기반하여, 상기 활동 가이드 변수를 조정하 는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제공하는 동작은 현재 상태가 움직임 상태이거나 또는 비움직임 상태 인지를 구 분하는 동작, 상기 구분된 상태에 대응하는 지정된 활동 가이드 정보를 출력하는 동작을 포함할 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 활동 가이드 정보 제공 방법은 센서 정보를 수집하는 동작, 상기 센서 정보의 수집 유무 또는 상기 센서 정보의 크기 중 적어도 하나를 기반으로 활동 정보를 수집하 는 동작, 설정된 목표를 기반으로 상기 활동 정보에 대해 출력할 활동 가이드 정보를 생성하는 동작, 전자 장치 의 현재 움직임 상태, 프로그램 참여 수준에 따라 설정된 활동 참여도, 현재 시간 중 적어도 하나를 기반으로 상기 활동 가이드 정보의 출력 시점, 출력 주기, 출력 횟수 중 적어도 하나를 다르게 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 출력하는 동작은 상기 활동 참여도가 상대적으로 높은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 짧게 하는 동작, 상기 활동 참여도가 상대적으로 낮은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 길게 하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 출력하는 동작은 상기 활동 참여도가 상대적으로 높은 경우, 상기 활동 가이드 정보의 출력 횟수를 상대적으로 많게 하는 동작, 상기 활동 참여도가 상대적으로 낮은 경우, 상기 활동 가이드 정보의 출력 주기를 상대적으로 적게 하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 출력하는 동작은 상기 현재 움직임 상태가 움직임 상태이면, 상기 활동 가이드 정보의 출력을 생략하는 동작, 상기 현재 움직임 상태가 지정된 시간 동안 비움직임 상태이면, 상기 활동 가이 드 정보를 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 출력하는 동작은 현재 시간이 속하는 시간대에 따라, 다른 내용의 활동 가이드 정보를 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 출력하는 동작은 출력할 활동 가이드 정보가 이전 출력된 활동 가이드 정보와 동일한 내용인 경우, 활동 가이드 정보의 내용을 변경하고, 변경된 활동 가이드 정보를 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 프로그램의 기본 설정 기간 동안의 활동 정보를 기반으로 프로그램 참여 수준을 결정하는 동작, 상기 결정된 프로그램 참여 수준에 따라 결정된 활동 참여도를 저장하는 동작을 더 포함할 수 있다.다양한 실시 예에 따르면, 상기 방법은 상기 활동 정보의 반복의 정도에 따라, 상기 활동 참여도를 조정하는 동 작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 조정하는 동작은 상기 활동 정보의 크기가 지정된 크기 이하로 지정된 시간 동 안 유지되는 경우 상기 활동 참여도를 하향 조정하는 동작, 상기 활동 정보의 크기가 지정된 크기 이상으로 지 정된 시간 동안 유지되는 경우 상기 활동 참여도를 상향 조정하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 활동 가이드 정보를 생성하는 동작은 상기 활동 정보의 패턴을 분석하는 동작, 상기 분석된 패턴과 저장된 기준 패턴들을 비교하여, 적어도 일부가 유사 또는 동일한 패턴을 검출하는 동작, 상기 검출된 패턴을 기준으로 활동 추정 정보를 산출하는 동작, 상기 활동 추정 정보와 상기 목표를 비교하여 목표 달성률을 산출하는 동작, 상기 산출된 목표 달성률을 기반으로 상기 활동 가이드 정보의 내용을 결정하는 동작을 포함할 수 있다. 도 11은 한 실시 예에 따른 활동 가이드 정보 출력과 관련한 화면 인터페이스의 한 예를 나타낸 도면이다. 도 11을 참조하면, 전자 장치의 디스플레이는 도시된 바와 같이, 활동 가이드 정보를 출력할 수 있다. 예컨대, 전자 장치는 디스플레이를 통해 사용자 입력에 따라 또는 지정된 설정에 따라 메시 지 화면을 출력할 수 있다. 상기 메시지 화면은 예컨대, 전자 장치 운용과 관련한 적어도 하나의 메시지를 포함하는 화면일 수 있다. 상기 활동 가이드 정보는 예컨대, 전자 장치의 디스플레이를 통해서 notification 형식으로 제공될 수 있다. notification은 목표 진행에 활동 가이드 정보일 수 있다. 과거 사용자의 활동 시간 진행 정도(active time progress)를 분석하여 목표 달성 가능성(goal achievement possibility)과 진행 기대 정보(expected degree of progress)를 계산한 후 그에 대응하는 활동 가이드 정보를 출력할 수 있다. 도시된 도면에서, 프로세서는 목표 달성이 불가능하다고 예측되어 기대 활동 시간(expected active time)을 계산한 후 사용 자의 목표와의 차이가 42분이라는 것을 나타낸 것이다. 상술한 바와 같이, 전자 장치는 수집된 사용자의 활동(activity) 정보를 기반으로 사용자가 수립한 목표를 완수하기 위해서, 프로그램 진행상태 정보 혹은 리마인더(reminder) 기능을 사용자의 패턴(pattern) 분석 내용 을 바탕으로 적절한 시점 및 적절한 내용을 선택하여 제공함으로써 사용자에게 전자 장치와 인터랙티브한 정보 운용을 하도록 함으로써 프로그램 수행자에게 장기적으로 프로그램 참여를 유도할 수 있다. 상술한 전자 장치의 활동 가이드 정보 제공 방법은 어플리케이션을 통해서 목표를 설정하는 동작, 사용자의 휴 대기기의 센서로 사용자의 행동 상태 정보를 획득하는 동작, 상기 설정된 목표에 기반하여 상기 사용자의 행동 상태 정보에 대한 분석 정보를 생성하는 동작, 상기 분석된 정보를 바탕으로 사용자에게 제공할 정보의 제공 시 점, 내용, 횟수 중 적어도 하나 이상을 결정하는 동작, 상기 결정된 정보를 사용자의 상기 휴대기기를 통해서 제공하는 동작을 포함할 수 있다. 상기 분석된 정보는, 상기 설정된 목표와 관련된 사용자의 행동 패턴 정보를 포함할 수 있다. 상기 사용자의 행 동 패턴 정보는, 사용자 활동 참여도(user engagement level), 진행 패턴(progress pattern), 목표 달성 패턴 (goal attainment pattern), 목표 과도/미 달성 패턴(Overachieving / underachieving pattern), 일시적 목표 달성 패턴(Anomaly defection in goal attainment) 중 적어도 하나 이상을 포함할 수 있다. 도 12은 다양한 실시 예에 따른 네트워크 환경 내의 전자 장치를 나타낸다. 도 12을 참조하면, 다양한 실시 예에서의 전자 장치, 제1 전자 장치, 제2 전자 장치 또는 서 버가 네트워크 또는 근거리 통신을 통하여 서로 연결될 수 있다. 전자 장치는 버스 , 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 및 통신 인터페이스 를 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성 요소를 추가적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(1210-170)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/ 또는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치(Central Processing Unit (CPU)), 어플리케이션 프로세서(Application Processor (AP)), 또는 커뮤니케이션 프로세서(Communication Processor (CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치 의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시 예에 따르면, 메 모리는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널 , 미들웨어, 어플리케이션 프로그래밍 인터페이스(Application Programming Interface (API)), 및/또는 어플리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일부는, 운영 시스템(Operating System (OS))으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램 )에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어 플리케이션 프로그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또 는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이션 프로그램 중 적어도 하나에 전자 장치 의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선 순위 를 부여할 수 있다. 예컨대, 미들웨어는 상기 적어도 하나에 부여된 우선 순위에 따라 상기 하나 이상의 작업 요청들을 처리함으로써, 상기 하나 이상의 작업 요청들에 대한 스케쥴링 또는 로드 밸런싱 등을 수행할 수 있다. API는, 예를 들면, 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터 페이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기 로 출력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(Liquid Crystal Display (LCD)), 발광 다이오드(Light- Emitting Diode (LED)) 디스플레이, 유기 발광 다이오드(Organic LED (OLED)) 디스플레이, 또는 마이크로 전자 기계 시스템(microelectromechanical systems, MEMS) 디스플레이, 또는 전자 종이(electronic paper) 디스플레 이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 컨텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스처, 근접, 또는 호버링(hovering) 입력을 수신할 수 있 다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제1 전자 장치, 제2 전자 장치 , 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제2 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신은, 예를 들면 셀룰러 통신 프로토콜로서, 예를 들면 LTE(Long-Term Evolution), LTE-A(LTE- Advanced), CDMA(Code Division Multiple Access), WCDMA(Wideband CDMA), UMTS(Universal Mobile Telecommunications System), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 중 적어도 하나를 사용할 수 있다. 또한 무선 통신은, 예를 들면, 근거리 통신을 포함할 수 있다. 근거리 통신는, 예를 들면, Wi-Fi(Wireless Fidelity), Bluetooth, NFC(Near Field Communication), MST(magnetic stripe transmission), 또는 GNSS 중 적어도 하나를 포함할 수 있다. MST는 전자기 신호를 이용하여 전송 데이터에 따라 펄스를 생성하고, 상기 펄스는 자기장 신호를 발생시킬 수 있다. 전자 장치는 상기 자기장 신호를 POS(point of sales)에 전송하고, POS는 MST 리더(MST reader)를 이용하여 상기 자기장 신호는 검출하고, 검출된 자기장 신호를 전기 신호로 변환함으로써 상기 데이터를 복원할수 있다. GNSS는 사용 지역 또는 대역폭 등에 따라, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo(the European global satellite-based navigation system) 중 적어도 하나를 포함할 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 혼용되어 사용(interchangeably used)될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크 는 통신 네트워크(telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 제1 전자 장치 및 제2 전자 장치 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있 다. 한 실시 예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시 예 에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 제 1 전자 장치, 제2 전자 장치, 또는 서버)에서 실행될 수 있다. 한 실시 예에 따르면, 전자 장치가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기 능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 전자 장치(예: 제1 전자 장치, 제2 전자 장치, 또는 서버)에게 요청할 수 있다. 다른 전자 장치는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수 신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 13는 다양한 실시 예에 따른 전자 장치의 블록도를 나타낸다. 도 13를 참조하면, 전자 장치는, 예를 들면, 도 12에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드 웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서 는, 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시 예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서는 도 13에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프 로세서는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈은, 도 12의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈(132 0)은, 예를 들면, 셀룰러 모듈, Wi-Fi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모듈, Beidou 모듈, 또는 Galileo 모듈), NFC 모듈, MST 모듈, 및 RF(radio frequency) 모듈을 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)를 이용 하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시 예에 따 르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP)를 포함할 수 있다. Wi-Fi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈, 또는 MST 모듈 각각은, 예 를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시 예에 따르면, 셀룰러 모듈, Wi-Fi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈, 또는 MST 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 IC(integrated chip) 또는 IC 패키지 내에 포 함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜 시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또 는 안테나 등을 포함할 수 있다. 다른 실시 예에 따르면, 셀룰러 모듈, Wi-Fi 모듈, 블루투스 모듈 , GNSS 모듈, NFC 모듈, MST 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신 호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포함할 수 있으며, 고유한 식별 정보(예: ICCID (integrated circuit card identifier)) 또는 가입자 정보(예: IMSI (international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비-휘발성(non-volatile) 메모리 (예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), 마스크(mask) ROM, 플래시(flash) ROM, 플래시 메모리(예: 낸드플래시(NAND flash) 또는 노아플래시(NOR flash) 등), 하드 드라이브, 또는 SSD(solid state drive) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(MultiMediaCard), 또는 메모리 스틱(memory stick) 등을 더 포 함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 전자 장치와 기능적으로 및/또는 물리적 으로 연결될 수 있다. 보안 모듈은 메모리보다 상대적으로 보안 레벨이 높은 저장 공간을 포함하는 모듈로써, 안전한 데 이터 저장 및 보호된 실행 환경을 보장해주는 회로일 수 있다. 보안 모듈은 별도의 회로로 구현될 수 있 으며, 별도의 프로세서를 포함할 수 있다. 보안 모듈은, 예를 들면, 탈착 가능한 스마트 칩, SD(secure digital) 카드 내에 존재하거나, 또는 전자 장치의 고정 칩 내에 내장된 내장형 보안 요소(embedded secure element(eSE))를 포함할 수 있다. 또한, 보안 모듈은 전자 장치의 운영 체제(OS)와 다른 운영 체제로 구동될 수 있다. 예를 들면, 보안 모듈은 JCOP(java card open platform) 운영 체제를 기반 으로 동작할 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지 된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(1340A), 자이로 센서 (1340B), 기압 센서(1340C), 마그네틱 센서(1340D), 가속도 센서(1340E), 그립 센서(1340F), 근접 센서 (1340G), 컬러 센서(1340H)(예: RGB 센서), 생체 센서(1340I), 온/습도 센서(1340J), 조도 센서(1340K), 또는 UV(ultra violet) 센서(1340M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈 은, 예를 들면, 후각 센서(E-nose sensor), EMG(electromyography) 센서, EEG(electroencephalogram) 센 서, ECG(electrocardiogram) 센서, IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구 성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 다양한 실시 예에 따르면, 상기 센서 모듈은 혈압계, 혈당계, PPG, ECG, EMG, EEG, 산소포화도 측정 센서, 피부 수분 측정 센서, 비만측정기, 체온센서 등을 포함할 수 있다. 사용자의 개인별 생체적 특징을 인식 하기 위한 생체정보 센서로 지문센서, 홍채인식센서, 얼굴인식기, 손모양 인식기, 손혈관 인식기, 음성인식기, 필기서명인식기가 있으며 카메라와 IR 카메라, 터치센서, 마이크 등이 이용될 수 있다. 이 중에서 health 센서는 사용자로부터 하나 이상의 생체신호를 수집하는 센서이다. 예컨대 사용자의 혈압, 혈 류, 심박수 (HRM, HRV), 체온, 호흡수, 산소포화도, 심폐음 감지, 혈당, 허리둘레, 키, 체중, 체지방, 칼로리소 비량, 뇌파, 목소리, 피부저항, 근전도, 심전도, 걸음걸이, 초음파영상, 수면상태, 표정(얼굴), 동공확장, 눈깜 박임 중 한 가지 이상을 측정하기 위한 기본 데이터(raw data)를 수집한다. 이러한 생체신호를 분석하여 생체특 성 정보를 추출할 수 있다. 한 예로 HRV(Heart Rate Variability) 센서를 통해 얻은 맥파 신호를 생체신호라고 할 수 있고, 이를 분석하면 평균 심박수, 심박 분포도 등과 같은 1차적인 생체특성 정보를 얻을 수도 있고, 이 러한 생체특성 정보를 가공하여 더 고차원적인 스트레스 상태, 혈관노화도와 같은 2차적인 생체특성 정보를 얻 을 수도 있다. health 센서는 수집한 사용자 생체신호를 단순 출력할 수도 있고, 센서와 함께 내장된 프로세서 장치를 통해 생체신호를 분석하여 생체특성 정보를 출력할 수도 있다. 따라서 health 센서를 통해 수집한 생체신호는 센서와 결합된 자체 프로세서, 센서장치가 내장된 로컬 장치의 프로세서에 전달되어 분석되어 생체특성 정보를 생산하는데 이용할 수 있다. 예를 들어 ECG센서가 내장된 휴대전화를 이용할 수도 있고, PPG센서가 내장 된 손목시계를 이용할 수도 있다. 또 다른 예로 이어클립에 내장된 HRV 센서가 수집한 생체신호는 손목시계 장치나 스마트폰에 전달되고, 이를 수 신한 장치가 생체특성 정보를 추출할 수 있다. 추출된 정보는 추출한 장치 혹은 하나 이상의 다른 장치에 전달 될 수 있다. 만약 스마트폰에서 생체특성 정보를 추출하였다면, 이 정보를 수신한 손목시계 장치에는 디스플레 이에, 이를 수신한 이어클립에서는 음성을 통해 전달할 수도 있다. 다양한 실시 예에 따르면, 터치센서, 키입력 감지센서, 충격감지 센서, 진동감지 센서, 유/무선 기기연결과 같은 신호를 감지할 수도 있다. 하나의 센서는 두 가지 이상의 정보를 센싱할 수도 있다. 예컨대, 가속도 센서는 사용자의 모션과 걸음 수를 동시에 측정할 수 있다. 다른 예에서, PPG 센서는 심박수, 스트레스와 같은 생체정보 센서로 활용될 수도 있고, 수신한 광량을 기 반으로 근접센서로 활용할 수도 있다. 또 다른 예에서 ECG 신호는 사용자의 심전도 분석을 통한 감정인식, 심박 수, HRV(Heart rate variation)을 인식할 수도 있고, 사용자를 구분하는 인증을 위한 용도로도 사용할 수 있다. 하나의 실시 예로 센서는 전자기기가 전원 on된 상태에서 상시 구동 될 수 있다. 또 다른 실시 예로 센서는 사 용자의 입력(예: 키 입력, 버튼 입력, GUI 입력, 제스처 인식)에 따라 구동될 수 있다. 다른 실시 예로 하나의 센서가 동작하면 이와 연관된 센서가 자동으로 구동될 수도 있다. 다양한 실시 예에 따르면, 상기 센서는 상기 전자기기에 내장될 수도 있고, 다른 전자기기에 내장되거나 혹은 외부 환경(예: 실내, 실외, 건물, 기지국 등) 에 설치될 수도 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정 전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널 은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 시트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치 는 마이크(예: 마이크)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 또는 프로젝터을 포함할 수 있다. 패널은, 도 12의 디스플레이과 동일 또는 유사한 구성을 포함할 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패 널은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린 은, 예를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 디스플레이 는 패널, 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI, USB, 광 인터페이스(optical interface), 또는 D- sub(D-subminiature)을 포함할 수 있다. 인터페이스는, 예를 들면, 도 12에 도시된 통신 인터페이 스에 포함될 수 있다. 추가적으로 또는 대체적으로, 인터페이스는, 예를 들면, MHL(mobile high- definition link) 인터페이스, SD 카드/MMC 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이 스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈(138 0)의 적어도 일부 구성요소는, 예를 들면, 도 12에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또 는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 제논 램프(xenon lamp))를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관 리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리은, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터는 전자 장치 혹은 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있 고, 진동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치 는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들 면, DMB(Digital Multimedia Broadcasting), DVB(Digital Video Broadcasting), 또는 미디어플로(MediaFLOTM) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시 예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시 예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나 의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 도 14은 다양한 실시 예에 따른 프로그램 모듈의 블록도를 나타낸다. 한 실시 예에 따르면, 프로그램 모듈(예: 프로그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영 체제(OS) 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프 로그램)을 포함할 수 있다. 운영 체제는, 예를 들면, Android, iOS, Windows, Symbian, Tizen, 또는 Bada 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, API, 및/또는 어플리케이션을 포함할 수 있 다. 프로그램 모듈의 적어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 제1 전자 장치, 제2 전자 장치, 서버 등)로부터 다운로드 가능하다. 커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저 또는 디바이스 드라이버를 포함 할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시 예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등을 포함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투 스 드라이버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, Wi-Fi 드라이버, 오디오 드라이버, 또는 IPC(inter-process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API을 통해 다양한 기능 들을 어플리케이션으로 제공할 수 있다. 한 실시 예에 따르면, 미들웨어(예: 미들웨어)은 런 타임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파 워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 보안 매니저(security manager), 또는 결제 매니저 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입 출력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기 (life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미 디어 매니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어플리케이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리 할 수 있다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 또 는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매니저은 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있 다. 패키지 매니저은 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있 다. 연결 매니저은, 예를 들면, Wi-Fi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할 수 있다. 위치 매니저은 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저은 사용자에게 제공 될 그래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 전자 장치 )가 전화 기능을 포함한 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니저(telephony manager)를 더 포함할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들 웨어는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미 들웨어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)은, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타 이젠(tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일, 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리 (health care)(예: 운동량 또는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 제1 전자 장치, 제2 전자 장치) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의상, \"정보 교 환 어플리케이션\")을 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전 달하기 위한 알림 전달(notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리 (device management) 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치의 적어도 하나의 기능(예: 외부 전자 장치 자체(또는 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기(또는 해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비 스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시 예에 따르면, 어플리케이션은 외부 전자 장치의 속성에 따라 지정된 어플리케이션(예: 모바일 의 료 기기의 건강 관리 어플리케이션)을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 외부 전자 장치(예: 제1 전자 장치, 제2 전자 장치), 및 서버) 로부터 수신된 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 프리로드 어플리케이션(preloaded application) 또는 서 버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시 예에 따른 프로그램 모듈의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시 예에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세서(예: 프로세서)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로 세스 등을 포함할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프 로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서 가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리 이 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM, DVD(Digital Versatile Disc), 자기-광 매체(magneto- optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장치(예: ROM, RAM, 또는 플래시 메모리 등) 등을 포함할 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 범위 를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 발명의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2015-0151409", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 한 실시 예에 따른 전자 장치의 한 예를 나타낸 도면이다. 도 2는 한 실시 예에 따른 프로세서의 한 예를 나타낸 도면이다. 도 3은 한 실시 예에 따른 활동 가이드 정보 제공 구조를 설명하는 도면이다. 도 4는 한 실시 예에 따른 활동 가이드 정보 제공의 한 예를 설명하는 도면이다. 도 5는 한 실시 예에 따른 활동 가이드 정보의 한 예를 설명하는 도면이다.도 6은 한 실시 예에 따른 활동 가이드 정보 제공 방법을 설명하는 도면이다. 도 7은 한 실시 예에 따른 활동 가이드 정보 제공 방법 중 기본 설정 방법을 설명하는 도면이다. 도 8은 한 실시 예에 따른 활동 참여도 조정 방법을 설명하는 도면이다. 도 9는 한 실시 예에 따른 활동 가이드 정보 생성 방법을 설명하는 도면이다. 도 10은 한 실시 예에 따른 활동 가이드 정보 출력 방법을 설명하는 도면이다. 도 11은 한 실시 예에 따른 활동 가이드 정보 출력과 관련한 화면 인터페이스의 한 예를 나타낸 도면이다. 도 12는 다양한 실시 예에 따른 네트워크 환경 내의 전자 장치를 나타낸다. 도 13은 다양한 실시 예에 따른 전자 장치의 블록도를 나타낸다. 도 14는 다양한 실시 예에 따른 프로그램 모듈의 블록도를 나타낸다."}
