{"patent_id": "10-2023-0036153", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0141907", "출원번호": "10-2023-0036153", "발명의 명칭": "인공지능 딥러닝에 기초한 청성뇌간반응검사의 자동화 결과 판독 장치", "출원인": "연세대학교 원주산학협력단", "발명자": "서영준"}}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "청성뇌간반응검사의 청력 검사 영상에 대해 데이터 전처리를 실행하여, 데이터의 각 파형의 값을 각 파형의 최대값으로 나누어 0 내지 1 사이의 값으로 정규화 하는 데이터 전처리부; 상기 데이터 전처리부로부터 전달되는 상기 파형의 특징을 추출 및 분석하고, 상기 파형의 전체 형태로부터 피크 값 및 피크가 발생하는 시간 정보를 산출하는 AI 모듈; 및상기 AI 모듈에서 산출된 상기 파형의 피크 값 및 피크가 발생하는 시간 정보로부터 난청 유무를 판독하는 난청판독부를 포함하는 것을 특징으로 하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 데이터 전처리부는파형의 전체 형태를 이용해 피크를 추출하여 분석하는 것을 특징으로 하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 데이터 전처리부는정규화(Normalization0화정을 통해 파형의 y값이 (100, 200) 의 범주를 갖는다면, 해당 파형의 모든 y값을 최대값인 200으로 나누어 (0.5, 1) 의 범주를 갖도록 각 파형의 값을 각 파형의 최대값으로 나누어 0 내지 1 사이의값으로 변경하는 것을 특징으로 하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 AI모듈은상기 데이터 전처리부를 통해 전처리가 이루어진 청력 검사 결과 데이터가 입력되면, 입력된 데이터 내 관심영역을 추출 및 분석하고, 데이터의 파형 내 V파(5번 피크)를 출력하는 것을 특징으로 하는 청력 검사 결과 판독장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 AI모듈에서 사용된 기계 학습 기법은 딥 러닝(deep learning)으로, 인공신경망(ANN, Artificial Neural Network)에서 설명하는 NN 즉, 신경망을 여러 층 쌓은 것으로, 다층 구조의 신경망을 통해 학습이 실행되는 DNN(Deep Neural Network)을 사용하는 것을 특징으로 하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0141907-3-청구항 5에 있어서,상기 AI모듈은모든 층이 이전 층에서 입력 받은 값을 계산하여 다음 층으로 보내는 역할을 수행하도록 하기 위하여 다중 레이어로 구성하는 것을 특징으로 하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 다중 레이어는제1 레이어 내지 제6 레이어를 포함하도록 구성하고, 제1 레이어는 제1 입력층(Input1) 및 제2 입력층(Input2),제2 레이어는 밀집층(Dense Layer) 및 양방향(Bidirectional) RNN, 제3 레이어는 재형성층(Reshape layer) 및시간 분배 밀집층(Time Distributed Dense Layer), 제4 레이어는 연결층(Concatenate Layer), 제5 레이어는 밀집층, 제6 레이어는 소프트맥스 밀집층(softmax Dense Layer)을 포함하도록 구성하는 것을 특징으로 하는 청력검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 제1 레이어는청성뇌간반응검사 결과의 각 파형은 이전에 측정한 데시벨의 파형 내 피크에 영향을 받는 것을 기준으로 2개의입력층으로 구성하여, 각 파형 내 피크 간 연관 관계를 분석하기 위해 제1 입력층(Input1)에는 이전 측정된 데시벨의 파형의 피크 값이 입력되고, 입력 데이터의 형식은 파형의 총 시간(이하 T)의 길이와 같으며, 그 중 피크가 발견된 시간 t를 1, 피크가 발견되지 않은 시간은 0으로 설정하고 제2 입력층에는 현재 데시벨 파형의 전처리된 값을 입력하는 것을 특징으로 하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7에 있어서,상기 제2 레이어는이전층에서 추출된 데이터의 특징을 이용하여 분석 혹은 판단을 진행하고, 양방향(Bidirectional) RNN은 RNN(순환신경망, Recurrent Neural Network)의 일종으로 이전 층의 데이터를 시간의 흐름에 따라 분석하는데 사용되는신경망인 것을 특징으로 하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7에 있어서,상기 제3 레이어의 재형성층(Reshape layer)은별다른 연산 과정 없이, 입력 받은 데이터의 형식을 변경하는데 사용되는 것으로, 재형성층은 제1 입력층으로부터 계산되어 전달된 데이터를 제2 입력층으로부터 계산되어 전달된 데이터와 같은 형식으로 맞추기 위해 사용되고, 시간 분배 밀집층(Time Distributed Dense Layer)은 일반적인 밀집층과 유사하나, RNN의 후방에서 각 LSTM셀로부터 출력되는 값을 입력받는 것을 특징으로 하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2024-0141907-4-청구항 7에 있어서,상기 제4 레이어의 연결층은상기 제3 레이어의 재형성층과 시간 분배 밀집층으로부터 전달되는 결과 값을 하나의 배열로 합쳐주는 역할을수행하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 7에 있어서,상기 제6 레이어의 소프트웨어 밀집층은softmax 활성화 함수를 사용하여, 밀집층의 결과값을 계산하는 것으로, AI 모듈의 출력층으로 출력된 값은 총시간 T 중에서 각 시간이 피크일 확률에 관한 분포도인 것을 특징으로 하는 청력 검사 결과 판독 장치."}
{"patent_id": "10-2023-0036153", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 청력 검사 결과 판독 장치 및 방법에 관한 것으로, 특히, 청성뇌간반응검사의 청력 검사 영상을 판독 하여 관심영역을 추출하고, 인공지능 딥러닝을 통하여 파형의 특정 신호가 발생하는 구간과 시간을 측정하여 분 석함으로써 난청 유무를 판독하는 청력 검사 결과 판독 장치 및 방법에 관한 것이다. 본 발명의 일 실시예에 따 른 청력 검사 결과 판독 장치는, 청성뇌간반응검사의 청력 검사 영상에 대해 데이터 전처리를 실행하여, 데이터 의 각 파형의 값을 각 파형의 최대값으로 나누어 0 내지 1 사이의 값으로 정규화 하는 데이터 전처리부, 상기 데 이터 전처리부로부터 전달되는 상기 파형의 특징을 추출 및 분석하고, 상기 파형의 전체 형태로부터 피크 값 및 피크가 발생하는 시간 정보를 산출하는 AI 모듈, 및 상기 AI 모듈에서 산출된 상기 파형의 피크 값 및 피크가 발 생하는 시간 정보로부터 난청 유무를 판독하는 난청 판독부를 포함한다."}
{"patent_id": "10-2023-0036153", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 청력 검사 결과 판독 장치에 관한 것으로, 특히, 청성뇌간반응검사의 청력 검사 영상을 판독하여 관 심영역을 추출하고, 인공지능 딥러닝을 통하여 파형의 특정 신호가 발생하는 구간과 시간을 측정하여 분석함으 로써 난청 유무를 판독하는 청력 검사 결과 판독 장치에 관한 것이다."}
{"patent_id": "10-2023-0036153", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "소리가 잘 안 들리는 것을 난청이라 한다. 난청은 이상 부위에 따라 크게 전음성 난청, 감각신경성 난청, 혼합 성 난청으로 나눌 수 있으며, 난청의 원인에 따라 보다 세분화 된다. 전음성 난청은 음을 전달하는 외이나 중이에 문제가 있는 경우이며, 감각신경성 난청은 내이 이후 신경 회로에 문제가 있는 경우이고, 혼합성 난청은 외이, 중이, 내이 모두에 문제가 있는 경우이다. 난청 판독은 환자의 청력검사 중 순음청력검사(PTA, Pure Tone Audiometry)와 청성뇌간반응검사(ABR, Auditory Brainstem Response)의 검사 결과에 기초하여 청력을 판독한다. 순음청력검사는 피검사자의 반응이 필요한 주관적 평가방법 중 하나이다. 피검사자에게 각 주파수 대역의 순음 (pure-tone)을 제시하여 개인이 들을 수 있는 가장 작은 소리 레벨을 산출하는 검사 방법이다. 순음청력검사는 피검사자가 헤드폰을 착용하고 순음을 전달하여 공기전도경로를 확인하는 기도순음청력검사(ACT)와 피검사자가 골전동체를 착용하고 두개골의 진동을 통해 소리를 전달하여 골전도경로를 확인하는 골도순음청력검사(BCT)가 있다. 검사자는 기도순음청력검사(ACT)와 골도순음청력검사(BCT)를 통한 청력검사 결과를 판독하여, 전음성 난 청, 감각신경성 난청, 혼합성 난청 등을 변별할 수 있다. 청성뇌간반응검사는 소리 자극을 들려주고 이에 대한 청각계로부터의 전기반응을 두피에 위치한 전극을 통하여 기록하는 검사이다. 청성뇌간반응은 소리 자극 후 10msec 이내에 청신경과 뇌간에서 나타나는 반응으로 마취와 수면의 영향을 받지 않고 측정이 가능하다. 자극음은 클릭(click), 톤핍(tone pip) 등이 사용되는데 이 중에서 클릭음은 주파수 특성이 없으나 생성시간과 지속시간이 짧고 청신경원을 동시에 흥분시킬 수 있어 임상적으로 널리 사용된다. 톤핍은 주파수 특이성 검사, 특히 저음역 난청이 있는 경우 사용된다. 청각 장애 판정을 받기 위해서는 청성뇌간반응검사를 반드시 받아야 하며, 청성뇌간반응검사는 객관적 검사로서, 청각 신호가 뇌간(brainstem)에 전달되는 과정에서 여러 파형의 잠복기와 진폭 등을 확인하여 청력 역치를 파악한다. 청성뇌간반응검사는 주로 누워서 검사를 시행하며, 아이의 경우 각성 상태에 있을 때, 검사 자체가 어려우므로, 수면제를 섭취 후 검사를 시행하는 경우가 많다. 성인의 경우도, 각성 상태에서 긴장을 하 면 정확한 파형을 획득할 수 없으므로, 최소한 명상 단계에서 검사하는 것이 바람직하다. 난청 검사와 관련하여, 일본공개특허 2001-231767호는 노이즈 검출 및 판정 능력을 구비한 청력 판정 장치에 관 한 것으로, 음향 자극에 응답해 발생하는 청각 뇌의 중추부 반응(ABR) 판정 검사의 개발에 있어서 과도한 노이즈 및 과도한 비생리 노이즈의 정확한 검출을 가능하게 하는 구성을 개시하며, 한국공개특허 2015-0131022호는 청력 검사 장치, 청력 검사 방법 및 청력 검사용 단어 작성 방법에 관한 것으로, 잘못 들을 가능성이 있는 단어 를 적어도 하나 포함하는 설문 문장을 음성 출력하고, 이에 대한 회답의 내용에 기초하여 회답자의 청력 저하의 유무를 판별하는 구성을 개시하고, 일본등록특허 5221545호는 타각적 자동 청력 검사 장치의 자동 청력 검사 방 법 및 타각적 자동 청력 검사 장치에 관한 것으로, 청성 유발 전위(auditory evoked potential, AEP)의 평가에 기초하여 목표하는 청력 검사를 자동화 하는 방법을 개시한다. 상기 종래 기술들은 청성뇌간반응검사(ABR)의 청력 검사 영상으로부터 난청 유무 판독을 위한 데이터 추출 및 분석에 있어 개선의 여지가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 일본공개특허 2001-231767호 (특허문헌 0002) 한국공개특허 2015-0131022호 (특허문헌 0003) 일본등록특허 5221545호"}
{"patent_id": "10-2023-0036153", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 사정을 감안하여 창출된 것으로서, 본 발명의 목적은 청성뇌간반응검사의 청력 검사 영상을 판독하여 관심영역을 추출하고, 인공지능 딥러닝을 통하여 파형의 특정 신호가 발생하는 구간과 시간을 측정하 여 분석함으로써 난청 유무를 판독하는 청력 검사 결과 판독 장치를 제공하는데 있다."}
{"patent_id": "10-2023-0036153", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 청력 검사 결과 판독 장치는, 청성뇌간반응검사의 청력 검사 영상에 대해 데이터 전처리를 실행하여, 데이터의 각 파형의 값을 각 파형의 최대값으로 나누어 0 내지 1 사이의 값으로 정규화 하 는 데이터 전처리부, 상기 데이터 전처리부로부터 전달되는 상기 파형의 특징을 추출 및 분석하고, 상기 파형의 전체 형태로부터 피크 값 및 피크가 발생하는 시간 정보를 산출하는 AI 모듈, 및 상기 AI 모듈에서 산출된 상기 파형의 피크 값 및 피크가 발생하는 시간 정보로부터 난청 유무를 판독하는 난청 판독부를 포함한다. 상기 데이터 전처리부는 파형의 전체 형태를 이용해 피크를 추출하여 분석하며, 정규화(Normalization0화정을 통해 파형의 y값이 (100, 200) 의 범주를 갖는다면, 해당 파형의 모든 y값을 최대값인 200으로 나누어 (0.5, 1) 의 범주를 갖도록 각 파형의 값을 각 파형의 최대값으로 나누어 0 내지 1 사이의 값으로 변경하도록 동작한다. 상기 AI모듈은 상기 데이터 전처리부를 통해 전처리가 이루어진 청력 검사 결과 데이터가 입력되면, 입력된 데 이터 내 관심영역을 추출 및 분석하고, 데이터의 파형 내 V파(5번 피크)를 출력한다. 상기 AI모듈에서 사용된 기계 학습 기법은 딥 러닝(deep learning)으로, 인공신경망(ANN, Artificial Neural Network)에서 설명하는 NN 즉, 신경망을 여러 층 쌓은 것으로, 다층 구조의 신경망을 통해 학습이 실행되는 DNN(Deep Neural Network)을 사용하고, 상기 AI모듈은 모즌 층이 이전 층에서 입력 받은 값을 계산하여 다음 층으로 보내는 역할을 수행하도록 하기 위하여 다중 레이 어로 구성하되, 제1 레이어 내지 제6 레이어를 포함하도록 구성하고, 제1 레이어는 제1 입력층(Input1) 및 제2 입력층(Input2), 제2 레이어는 밀집층(Dense Layer) 및 양방향(Bidirectional) RNN, 제3 레이어는 재형성층 (Reshape layer) 및 시간 분배 밀집층(Time Distributed Dense Layer), 제4 레이어는 연결층(Concatenate Layer), 제5 레이어는 밀집층, 제6 레이어는 소프트맥스 밀집층(softmax Dense Layer)을 포함하도록 구성한다."}
{"patent_id": "10-2023-0036153", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 청력 검사 결과 판독 장치 및 방법은 청성뇌간반응검사의 청력 검사 영상에 인공지능 딥러닝 기 술을 적용하여 관심영역 추출 및 분석을 실행함으로써, 난청 유무 판독의 정밀성을 높일 수 있는 효과가 있다."}
{"patent_id": "10-2023-0036153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정 해석되지 아니하며, 발명자 는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입 각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재 된 \"…부\", \"…기\", \"모듈\", \"장치\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이 는 하드웨어 및/또는 소프트웨어의 결합으로 구현될 수 있다. 명세서 전체에서 \"및/또는\"의 용어는 하나 이상의 관련 항목으로부터 제시 가능한 모든 조합을 포함하는 것으로 이해되어야 한다. 예를 들어, \"제1 항목, 제2 항목 및/또는 제3 항목\"의 의미는 제1, 제2 또는 제3 항목뿐만 아 니라 제1, 제2 또는 제3 항목들 중 2개 이상으로부터 제시될 수 있는 모든 항목의 조합을 의미한다. 명세서 전체에서 각 단계들에 있어 식별부호(예를 들어, a, b, c, ...)는 설명의 편의를 위하여 사용되는 것으 로 식별부호는 각 단계들의 순서를 한정하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않은 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 이하, 도면을 참고하여 본 발명의 일실시예에 대하여 설명한다. 도 1은 본 발명의 일 실시예에 따른 청력 검사 결과 판독 장치의 구성을 도시한 블록도이다. 도 1을 참조하면, 본 발명의 청력 검사 결과 판독 장치는 데이터 전처리부, AI 모듈 및 난청 판 독부를 포함한다. 데이터 전처리부는 청성뇌간반응검사의 청력 검사 영상에 대해 데이터 전처리를 실행하여, 데이터의 각 파 형의 값을 각 파형의 최대값으로 나누어 0 내지 1 사이의 값으로 정규화 한다. AI 모듈은 데이터 전처리부로부터 전달되는 파형의 특징을 추출 및 분석하고, 상기 파형의 전체 형태 로부터 피크 값 및 피크가 발생하는 시간 정보를 산출한다. 이를 위해, AI 모듈은 제1 레이어, 제2 레이어, 제3 레이어, 제4 레이어, 제5 레이어 및 제6 레이어를 포함할 수 있으며, 각 레이어의 기능 및 역할에 대해서는 후술한다. 난청 판독부는 AI 모듈에서 산출된 상기 파형의 피크 값 및 피크가 발생하는 시간 정보로부터 난청 유무를 판독한다. 도 2는 학습 데이터로 사용되는 청력 검사 결과 파형을 도시하는 도면이다. 도 2를 참조하면, 총 6개의 파형이 있으며, 각 파형은 학습 데이터로 사용되며, 6개 파형은 각각 다른 크기(데 시벨)의 소리 자극에 대한 청력 검사 결과를 나타낸다. 우선, 데이터 전처리부를 통해 전처리가 이루어진 청력 검사 결과 데이터가 입력되면, AI 모듈은 데 이터 내 관심영역을 추출 및 분석하고, 데이터의 파형 내 V파(5번 피크)를 출력한다. 도 2에서 추출된 파형은 실제 측정 데이터이다. 측정 데이터는 소리의 크기(데시벨)에 따라 각각 다른 범위의 값을 갖고 있다. 이 상태에서 기계 학습을 실행시키면, AI 모듈이 계산해야 할 데이터 범위가 매우 방대 해지며, 실제 피크 값을 분석하는데 초점이 맞춰진다. 그러나, 본 발명에서는 파형의 값 자체보다는 파형의 전체 형태를 이용해 피크를 추출하는 것이므로, 파형의 전 체 형태에 초점을 두고 분석을 진행한다. 따라서, 전처리 과정(정규화, Normalization)을 통해 각 파형의 값을 각 파형의 최대값으로 나누어 0 내지 1 사 이의 값으로 변경한다. 예를 들어, 파형의 y값이 (100, 200) 의 범주를 갖는다면, 해당 파형의 모든 y값을 최대 값인 200으로 나누어 (0.5, 1) 의 범주를 갖도록 한다. 상기와 같이 전처리가 실행된 데이터에 대해 AI 모듈은 학습(DNN)을 실행한다. 이하에서는, 본 발명의 이 해의 편의를 위해 실제 실험예에 대해 설명하지만, 본 발명의 사상은 이에 제한적이지 않으며, 다양한 변형 또 는 수정이 가능하다. 청력 검사 결과로부터 추출된 데이터는 2,098개이며, 이중 80%인 1,684개를 학습데이터, 414개를 테스트 데이터 로 설정하여 학습을 진행한다. 모든 기계 학습은 학습 데이터 및 테스트 데이터를 활용하여 학습한다. 학습데이터는 학습을 진행하는 데이터로, AI 모듈은 기계 학습 기법을 이용하여 해당 학습 데이터를 학습한다. 테스트 데이터는 학습을 완료한 AI 모듈을 테스트 하는데 사용하는 데이터로, 실제 AI 모듈의 성능은 테스트 데이터의 테스트 결과로 평가된다. 본 발명의 AI 모듈에서 사용된 기계 학습 기법은 딥 러닝(deep learning)으로, 그 중 DNN(Deep Neural Network)을 사용한다. DNN은 인공신경망(ANN, Artificial Neural Network)의 딥 러닝 버전이다. DNN은 ANN에서 설명하는 NN 즉, 신경망을 여러 층 쌓은 것으로, 다층 구조의 신경망을 통해 학습이 실행된다. 도 3은 본 발명의 AI 모듈의 신경망 구조를 도시한 도면이다. 도 3을 참조하면, AI 모듈은 제1 레이어 내지 제6 레이어를 포함한다. 제1 레이어는 제1 입력층(Input1) 및 제2 입력층(Input2), 제2 레이어는 밀집층(Dense Layer) 및 양방향(Bidirectional) RNN, 제3 레이어는 재형성층(Reshape layer) 및 시간 분배 밀집층(Time Distributed Dense Layer), 제4 레이어는 연결층(Concatenate Layer), 제5 레이어는 밀집층, 제6층은 소프트맥스 밀집층(softmax Dense Layer)을 포함할 수 있다. 모든 층은 이전 층에서 입력 받은 값을 계산하여 다음 층으로 보내는 역할을 한다. 도 3에서, 각 층 사이의 화 살표는 데이터 처리 및 이동의 방향을 나타낸다. AI 모듈의 제1 레이어는 2개의 입력층으로 구성될 수 있다. 청성뇌간반응검사 결과의 각 파형은 이전 에 측정한 데시벨의 파형 내 피크에 영향을 받는다. 각 파형 내 피크 간 연관 관계를 분석하기 위해 제1 입력층 (Input1)에는 이전 측정된 데시벨의 파형의 피크 값이 입력된다. 입력 데이터의 형식은 파형의 총 시간(이하 T)의 길이와 같다. 그 중 피크가 발견된 시간 t를 1, 피크가 발견되지 않은 시간은 0으로 설정한다. 이를 수식으로 나타내면 하기와 같다. [수학식 1]"}
{"patent_id": "10-2023-0036153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "제2 입력층(Input2)에는 현재 데시벨 파형의 전처리 된 값이 입력된다. 제2 입력층에 입력되는 파형은 제1 입력 층에 입력되는 파형과 마찬가지로 총 시간은 T이다. 밀집층(Dense Layer)은 데이터의 전반적인 분석을 실행한다. 일반적으로, 밀집층의 이전 층은 데이터의 특징을 추출하는 층이 위치한다. 데이터 특징이 입력되는 밀집층은 특징으로부터 분석 혹은 판단을 한다. 재형성층(Reshape layer)은 별다른 연산 과정 없이, 입력 받은 데이터의 형식을 변경하는데 사용된다. 본 발명 의 AI 모듈에서, 재형성층은 제1 입력층으로부터 계산되어 전달된 데이터를 제2 입력층으로부터 계산되어 전달된 데이터와 같은 형식으로 맞추기 위해 사용될 수 있다. 양방향(Bidirectional) RNN은 RNN(순환신경망, Recurrent Neural Network)의 일종이다. RNN은 이전 층의 데이 터를 시간의 흐름에 따라 분석하는데 사용되는 신경망이다. 제2 입력층에 입력된 데이터는 총시간 T인 시간의흐름에 따라 y 값이 변하는 파형이며, RNN은 이러한 파형을 분석하는데 사용된다. 일반적인 RNN의 경우, 시간의 순행의 분석에 사용된다. 본 발명의 AI 모듈은 양방향 RNN이 사용될 수 있으 며, 파형에서 시간의 순행에 따른 값의 변화와 역행에 따른 값의 변화를 모두 분석하여 청성뇌간반응검사 결과 의 피크를 정밀하게 검출할 수 있다. 도 4는 양방향 RNN 내부구조 및 시간 분배 밀집층(Time Distributed Dense Layer)을 도시한 도면이다. 도 4를 참조하면, RNN 내부에는 LSTM(Long Short-Term Memory) 셀(Cell)이 총시간 T 개 만큼 구성된다. 각 셀에는 제2 입력층에서 전달되는 파형의 y값이 입력된다. LSTM은 각 y값 뿐만 아니라, 같은 RNN 내부의 다른 LSTM의 결과값을 참고하여 분석한다. 시간 분배 밀집층(Time Distributed Dense Layer)은 일반적인 밀집층과 유사하나, RNN의 후방에서 각 LSTM 셀 로부터 출력되는 값을 입력 받는다는 점에서 다른 밀집층과 차이가 있다. 일반적으로 RNN 전체의 결과만 밀집층의 입력 값으로 사용되는 것과는 달리, 본 발명의 시간 분배 밀집층은 RNN 내부의 모든 셀의 후방에서 각 셀에 상응하여 밀집층이 위치한다. 연결층(Concatenate Layer)은 제3 레이어의 재형성층과 시간 분배 밀집층으로부터 전달되는 결과 값을 하 나의 배열로 합쳐주는 역할을 한다. 소프트맥스 밀집층(softmax Dense Layer)은 softmax 활성화 함수를 사용하여, 밀집층의 결과값을 계산한다. 또 한, 소프트맥스 밀집층은 본 발명의 AI 모듈의 출력층이다. 출력된 값은 총시간 T 중에서 각 시간이 피크 일 확률에 관한 분포도이다. 손실 함수(Loss function)는 출력층에서 계산된 결과값과 실제 피크 값의 차이를 계산한다. 출력층의 결과값은 총 면적 1을 갖는 확률분포이다. 실제 피크 값은 학습에 사용하는 파형의 실제 피크 시간 t를 1로, 나머지를 0으로 한 그래프이며, 전술한 수 학식 1과 같다. 손실 함수는 여러 계산법을 이용해 - 의 값을 산출한다. 본 발명의 일 실시예에서, cosine similarity를 이용하여 계산될 수 있으며, - 의 산출 값은 각 레이어 (121~126)에 다시 전달될 수 있다. 이 과정이 역전파(back propagation)이며, 학습은 제1 레이어에서 제6 레이어로 순차적으로 데이터가 전달되는 순전파(feedforward)와 역전파를 반복 계산하여 이루어진다. 본 발명의 실험예에서, 학습데이터 세트(set) 1,684개 모두 각각 순전파, 역전파 계산을 한 경우를 1 epoch 라 고 하며, AI 모듈은 총 139 epoch의 학습을 진행하였다. 해당 AI 모듈의 성능은 MSE(Mean Squared Error)를 이용해 오차를 계산하였으며, 테스트 데이터를 모두 계산한 결과, 평균 MSE가 0.10515368729829788 로 도출되었다. 즉, AI 모듈을 통해 산출되는 값은 결국 실제 피크 시간 t인 것으로 보입니다. 청성뇌간반응검사는 청력역치를 파악하여 난청 여부를 판단하는 것인데, 피크 시간 t 값 산출을 통해 난청 여부 판단이 가능한 것이다. AI 모듈에 데이터 파형이 입력되는 단계에서, 전처리를 통해 파형의 y값이 정규화(0~1) 되었으므로, 다시 역의 과정을 거쳐 y값을 산출해야 청력역치를 파악할 수 있는 것이다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 컨트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로 컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또 는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특 수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하 나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이 터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으"}
{"patent_id": "10-2023-0036153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "로 설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody) 될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나, 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드 뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한 다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성 될 수 있으며, 그 역도 마찬가지이다. 지금까지 본 발명을 바람직한 실시 예를 참조하여 상세히 설명하였지만, 본 발명이 상기한 실시 예에 한정되는 것은 아니며, 이하의 특허청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 본 발명이 속하는 기술 분야 에서 통상의 지식을 가진 자라면 누구든지 다양한 변형 또는 수정이 가능한 범위까지 본 발명의 기술적 사상이 미친다 할 것이다. 이상에서 본 발명은 기재된 구체예에 대하여 상세히 설명되었지만 본 발명의 기술사상 범위 내에서 다양한 변형 및 수정이 가능함은 당업자에게 있어서 명백한 것이며, 이러한 변형 및 수정이 첨부된 특허 청구범위에 속함은 당연한 것이다."}
{"patent_id": "10-2023-0036153", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 청력 검사 결과 판독 장치의 구성을 도시한 블록도이다. 도 2는 학습 데이터로 사용되는 청력 검사 결과 파형을 도시하는 도면이다. 도 3은 본 발명의 AI 모듈의 신경망 구조를 도시한 도면이다. 도 4는 양방향 RNN 내부구조 및 시간 분배 밀집층(Time Distributed Dense Layer)을 도시한 도면이다."}
