{"patent_id": "10-2022-0136653", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0056254", "출원번호": "10-2022-0136653", "발명의 명칭": "이미지 분류 방법 및 장치", "출원인": "국립한국교통대학교산학협력단", "발명자": "곽정환"}}
{"patent_id": "10-2022-0136653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "각 단계의 적어도 일부가 프로세서에 의해 수행되는, 이미지 분류 방법으로서,입력 이미지를 획득하는 단계; 및상기 입력 이미지를 제1 학습 모델에 입력하여 상기 입력 이미지를 분류하는 단계를 포함하고,상기 제1 학습 모델은 제1 인코더 및 제1 분류기를 포함하고,상기 제1 인코더는, 상기 제1 학습 모델인 분류 모델이 아닌 다른 종류의 학습 모델로서, 인코더 및 디코더를포함하는 학습 모델에서 훈련된 인코더인,이미지 분류 방법."}
{"patent_id": "10-2022-0136653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제1 인코더는 이미지의 노이즈를 제거하거나 이미지를 분할(segmentation)하는 딥러닝 기반의 상기 학습모델에서 훈련된 인코더인,이미지 분류 방법."}
{"patent_id": "10-2022-0136653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 제1 인코더는,동일한 인코더 및 각각 서로 다른 디코더로 구성되고, 이미지의 노이즈를 제거하는 딥러닝 기반의 제2 학습 모델 및 이미지를 분할하는 딥러닝 기반의 제3 학습 모델에서 훈련된 인코더인,이미지 분류 방법."}
{"patent_id": "10-2022-0136653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제2 학습 모델은 소스 이미지와 노이즈가 포함된 이미지를 포함하는 디노이징 데이터 셋으로 훈련되고,상기 제3 학습 모델은 소스 이미지와 객체 영역이 마스크로 표시된 실제 이미지(ground-truth)를 포함하는 분할데이터 셋으로 훈련된,이미지 분류 방법."}
{"patent_id": "10-2022-0136653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 제1 학습 모델은, 훈련 페이즈 (training phasa)를 거쳐 훈련되고,정상, 비정상 및 미정 중 하나로 레이블링 된 이상 감지 이미지 데이터 셋을 수집하는 단계; 기 학습된 상기 제1 인코더에서 학습된 가중치를 기반으로 상기 획득한 이미지의 특징맵을 추출하는 단계; 및상기 특징맵을 기반으로 상기 수집 이미지를 정상, 비정상 및 미정 중 하나의 클래스로 분류하는 단계를 포함하는,이미지 분류 방법.공개특허 10-2024-0056254-3-청구항 6 이미지 분류 장치로서,메모리; 및상기 메모리와 연결되고, 상기 메모리에 포함된 컴퓨터 판독 가능한 명령들을 실행하도록 구성된 적어도 하나의프로세서를 포함하고,상기 적어도 하나의 프로세서는,입력 이미지를 획득하고,상기 입력 이미지를 제1 학습 모델에 입력하여 상기 입력 이미지를 분류하도록 설정되며,상기 제1 학습 모델은 제1 인코더 및 제1 분류기를 포함하고,상기 제1 인코더는, 상기 제1 학습 모델인 분류 모델이 아닌 다른 종류의 학습 모델로서, 인코더 및 디코더를포함하는 학습 모델에서 훈련된 인코더인,이미지 분류 장치."}
{"patent_id": "10-2022-0136653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 제1 인코더는 이미지의 노이즈를 제거하거나 이미지를 분할(segmentation)하는 딥러닝 기반의 상기 학습모델에서 훈련된 인코더인,이미지 분류 장치."}
{"patent_id": "10-2022-0136653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 제1 인코더는,동일한 인코더 및 각각 서로 다른 디코더로 구성되고, 이미지의 노이즈를 제거하는 딥러닝 기반의 제2 학습 모델 및 이미지를 분할하는 딥러닝 기반의 제3 학습 모델에서 훈련된 인코더인,이미지 분류 장치."}
{"patent_id": "10-2022-0136653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 제2 학습 모델은 소스 이미지와 노이즈가 포함된 이미지를 포함하는 디노이징 데이터 셋으로 훈련되고,상기 제3 학습 모델은 소스 이미지와 객체 영역이 마스크로 표시된 실제 이미지(ground-truth)를 포함하는 분할데이터 셋으로 훈련된,이미지 분류 장치."}
{"patent_id": "10-2022-0136653", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6 항에 있어서,상기 제1 학습 모델은, 훈련 페이즈 (training phasa)를 거쳐 훈련되고,정상, 비정상 및 미정 중 하나로 레이블링 된 이상 감지 이미지 데이터 셋을 수집하는 단계; 기 학습된 상기 제1 인코더에서 학습된 가중치를 기반으로 상기 획득한 이미지의 특징맵을 추출하는 단계; 및상기 특징맵을 기반으로 상기 수집 이미지를 정상, 비정상 및 미정 중 하나의 클래스로 분류하는 단계를 포함하는,공개특허 10-2024-0056254-4-이미지 분류 장치."}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이미지 분류 방법 및 장치가 개시된다. 본 개시의 일 실시 예에 따른 이미지 분류 방법은, 입력 이미지를 획득하 는 단계와, 입력 이미지를 제1 학습 모델에 입력하여 입력 이미지를 분류하는 단계를 포함하고, 제1 학습 모델은 제1 인코더 및 제1 분류기를 포함하고, 제1 인코더는, 제1 학습 모델인 분류 모델이 아닌 다른 종류의 학습 모델 로서, 인코더 및 디코더를 포함하는 학습 모델에서 훈련된 인코더일 수 있다."}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 멀티태스크 전이 학습(Multitask Transfer Learning) 기반 딥러닝 알고리즘을 통해 강건한 이미지 분 류가 수행될 수 있도록 하는 이미지 분류 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사람의 시신경은 망막을 통해 들어온 시각 정보를 전기적 자극을 통해 대뇌의 후두엽으로 전달하는 과정 중 망 막에 비친 장면에서 중요한 정보들을 파악하고 사람의 경험, 주관적 생각 등을 통해 결론을 낼 수 있다. 특히 중요도가 높은 객체가 어디에, 어떤 상태로 존재하느냐에 따라 다른 결론을 도출할 수 있다. 하지만 일반적인 Computer-Vision 기반 인공지능 알고리즘에서는 입력된 이미지에서 학습된 데이터와 유사한 부 분을 찾아내어 확률을 제시하는 것에 불과하다. 이는 학습된 데이터와 전혀 다른 분포를 가지지만 찾아내고자 하는 객체가 분명히 존재하는 이미지가 입력될 경 우 오류를 초래할 수 있으며 이를 인공지능의 불확실성이라고 한다. 이러한 불확실성은 자율주행, 자동화 공장 등 4차 산업혁명, 국가 주도 C-ITS 사업 등에서 이용자들의 신뢰성을 떨어트리는 주된 요인이다. 따라서 인공지능 시스템의 불확실성을 제거하고 신뢰성을 높이는 것은 매우 중요하다. 이를 통해 추후 인공지능 시스템은 사용자에게 출력 결과에 대한 근거를 제시할 필요성을 알 수 있으며, 여기서 이야기되는 근거는 인공 지능 모델이 어디서, 무엇을 보고 어떻게 판단하였는지를 보여줄 수 있어야 한다. 따라서 중요 객체의 위치 정 보와 객체에 대한 중요 정보를 학습하여 근거 있는 이미지 분류가 가능한 기법이 필요하다."}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "전술한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다. 선행기술문헌 특허문헌 (특허문헌 0001) 선행기술 1: 한국 등록특허공보 제10-2425396호(2022.07.21.)"}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 실시 예의 일 과제는, 멀티태스크 전이 학습 기반 딥러닝 알고리즘을 통해 강건한 이미지 분류가 수 행될 수 있도록 하는 것이다. 본 개시의 실시 예의 일 과제는, 이미지 분류를 위해 위치 정보를 전달할 수 있는 분할(Segmentation) 네트워크 와 객체의 중요 정보를 학습 가능한 고해상도 변환(Super-Resolution) 및 디노이징(Denoising) 네트워크를 활용 하여 학습된 계층 집합들의 가중치를 이용해, 이미지 분류를 위한 딥러닝 모델을 설계하여, 이미지의 이상 감지 정확도를 향상시키고자 하는 것이다. 본 개시의 실시 예의 일 과제는, 고해상도 변환(SR)과 디노이징을 통한 주요 특징정보, 분할을 통한 위치 정보 를 학습하기 위해 보조 태스크로 선택하여 멀티태스크 학습(Multitask Learning) 기법을 이용해 학습시킨 후 전 이 학습(Transfer Learning) 기법을 이용하여 가중치 공유를 통한 이미지 분류기를 설계하는데 있다. 본 개시의 실시예의 목적은 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 이미지 분류 방법은, 입력 이미지를 획득하는 단계와, 입력 이미지를 제1 학습 모 델에 입력하여 입력 이미지를 분류하는 단계를 포함하고, 제1 학습 모델은 제1 인코더 및 제1 분류기를 포함하 고, 제1 인코더는, 제1 학습 모델인 분류 모델이 아닌 다른 종류의 학습 모델로서, 인코더 및 디코더를 포함하 는 학습 모델에서 훈련된 인코더일 수 있다. 이 외에도, 본 발명의 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램이 저장된 컴퓨터로 판독 가능한 기록매체가 더 제공될 수 있다. 전술한 것 외의 다른 측면, 특징, 이점이 이하의 도면, 특허청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시 예에 의하면, 멀티태스크 전이 학습 기반 딥러닝 알고리즘을 통해 강건한 이미지 분류가 수행될 수 있도록 함으로써, 이미지에서 관심 객체의 식별의 정확도를 향상시킬 수 있다. 또한, 이미지 분류를 위해 위치 정보를 전달할 수 있는 분할 네트워크와 객체의 중요 정보를 학습 가능한 고해 상도 변환(SR) 및 디노이징 네트워크를 활용하여 학습된 계층 집합들의 가중치를 이용해, 이미지 분류를 위한 딥러닝 모델을 설계함으로써, 분류 모델의 성능을 향상시킬 수 있다. 또한, 고해상도 변환(SR)과 디노이징을 통한 주요 특징정보, 분할을 통한 위치 정보를 학습하기 위해 보조 태스 크로 선택하여 멀티태스크 학습 기법을 이용해 학습시킨 후 전이 학습 기법을 이용하여 가중치 공유를 통한 이 미지 분류기를 설계함으로써, 이미지의 이상 감지 정확도를 향상시킬 수 있다. 또한, 전이 학습을 이용하는 만큼 일반적인 기법으로 설계된 딥러닝 모델과 비교하였을 때, 같은 파라미터 수로 더 높은 정확도와 확실한 근거를 제시할 수 있는 모델을 설계할 수 있다. 또한, 보조 태스크와 주요 태스크를 필요성에 따라 변경할 수 있도록 함으로써, 자율주행 시스템, 자동화 공장 등 필요 부분에 따라 보조 태스크와 주요 태스크가 선택되도록 하여 인력을 대신할 수 있는 동시에 신뢰성을 가 진 딥러닝 모델 설계가 가능하도록 할 수 있다. 본 개시의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 설명되는 실시 예들 을 참조하면 명확해질 것이다. 그러나 본 개시는 아래에서 제시되는 실시 예들로 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있고, 본 개시의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어야"}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한다. 아래에 제시되는 실시 예들은 본 개시가 완전하도록 하며, 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 개시의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 개시를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 개시를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 상기 용어들에 의해 한정되어서 는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 이하, 본 개시에 따른 실시 예들을 첨부된 도면을 참조하여 상세히 설명하기로 하며, 첨부 도면을 참조하여 설 명함에 있어, 동일하거나 대응하는 구성요소는 동일한 도면번호를 부여하고 이에 대한 중복되는 설명은 생략하 기로 한다. 도 1은 일 실시 예에 따른 이미지 분류 시스템 환경을 개략적으로 나타낸 도면이다. 도 1에 도시된 바와 같이, 이미지 분류 시스템은 이미지 분류 모델을 이용하여 이미지의 이상 여부를 분류하 고자 하는 것이다. 일 실시 예의 이미지 분류 시스템에서, 이미지 분류 모델은 멀티태스크 전이 학습(Multitask Transfer Learning)을 기반으로 하여 다수의 보조 태스크를 통해 이미지 분류를 위한 중요 객체의 위치, 특징정보를 학습 하고, 학습된 특징을 추출하는 레이어 집합을 이용하여 이미지를 분류하는 딥러닝 모델이다. 예를 들어, 일 실시 예에서는, 멀티태스크 전이 학습을 사용하여 레일 패스너에 대한 심층 이상 감지를 수행할 수 있다. 레일 패스너는 레일을 철도 타이에 고정하여 안전한 열차 운행에 기여하는 레일 트랙의 주요 구성 요 소이다. 부재나 파손 등의 이상은 대형사고로 이어질 수 있으므로 정기적으로 점검해야 한다. 효율적인 관리를 위해 영상 기반 유지관리 시스템이 제안되고 있지만, 여전히 영상의 장애물이나 노이즈에 의한 막힘으로 인한 이상 현상을 감지하기 어려운 실정이다. 따라서, 일 실시 예에서는, 이미지 분류 시스템의 불확실성을 제거하고 신뢰성을 높이기 위해, 인공지능 모델이 어디서, 무엇을 보고 어떻게 판단하였는지와 같은 출력 결과에 대한 근거를 사용자에게 제시할 필요가 있다. 따 라서 일 실시 예에서는, 중요 객체의 위치 정보와 객체에 대한 중요 정보를 학습하여 근거 있는 이미지 분류가 가능한 기법을 수행할 수 있다. 이를 위해, 이미지 분류 시스템에서는 멀티태스크 전이 학습 기반 이미지 분류 딥러닝 모델을 제안한다. 멀 티태스크 전이 학습이랑 멀티태스크 학습과 전이 학습을 합친 기법이다. 딥러닝 분야에서 멀티태스크 학습은 여러 학습 태스크를 동시에 해결하면서 작업 간의 공통점과 차이점을 활용 하는 기법으로 일반적인 모델과 비교할 때 작업별 모델에 대한 학습 효율성과 정확도를 향상시킬 수 있다는 장 점을 가지고 있다. 따라서 일 실시 예의 이미지 분류 모델에서는 이미지 분류를 위해 위치 정보를 전달할 수 있는 분할 네트워크와 객체의 중요 정보를 학습 가능한 고해상도 변환(SR) 및 디노이징 네트워크를 활용할 수 있다. 분할 기술은 이미지를 여러 개의 픽셀 집합으로 나누는 기법으로 입력 이미지 내 관심 객체의 위치 정보를 픽셀 단위로 나타낸다. 고해상도 변환 기술은 비교적 저화질의 이미지를 고해상도 이미지로 향상시키는 기술의 일종 으로 픽셀과 픽셀 사이의 연관성을 학습하여 입력 이미지의 전체적인 정보를 학습시킬 수 있는 기법이다. 디노 이징 기술은 이미지 내 노이즈를 제거하는 기술로 이미지에서 필요 없는 부분을 제거할 수 있는 기법이다. 또한, 전이 학습이란 사전 학습된 인공지능 모델에서 일부분의 가중치를 그대로 가져와 다른 모델에 공유하여 사용하는 기법으로, 보통 특징정보를 추출하는 레이어 집합의 가중치를 이용한다. 따라서 일 실시 예에서는, 분할 네트워크, 고해상도 변환 및 디노이징 네트워크를 특징 정보를 추출하기 위한 하나의 레이어 집합과 멀티태스크 학습을 이용하여 학습한 후, 전이 학습에 기반하여 학습된 레이어 집합들의 가중치를 이용해 이미지 분류를 위한 딥러닝 기반 이미지 분류 모델을 설계할 수 있다. 이미지 분류 모델은 일반적인 이미지 분류를 위해 설계된 모델들과 비교하였을 때, 더 높은 정확도와 비교적 확 실한 근거를 보여줄 수 있다. 이는 사람, 강아지, 고양이 등 객체의 종류를 분류할 수 있으며 사용 방법에 따라 기차가 주행하는 선로 결함 등 관심 객체의 식별도 가능하다. 한편 본 실시 예에서는, 사용자들이 사용자 단말에서 구현되는 어플리케이션 또는 웹사이트에 접속하여, 이상 감지를 위한 대상 객체 이미지(예컨대, 철도 레일 트랙 이미지)를 입력하거나, 이상 감지 결과를 확인하는 것뿐만 아니라, 학습 모델의 하이퍼 파라미터를 설정(입력)하는 등의 과정을 수행할 수 있다. 이러한 사용자 단 말은 이미지 분류 어플리케이션 또는 이미지 분류 웹사이트에 접속한 후 인증 과정을 통하여 서비스를 제공받을 수 있다. 인증 과정은 회원가입 등 사용자 정보를 입력하는 인증, 사용자 단말에 대한 인증 등을 포함할 수 있으나, 이에 한정되지 않고 이미지 분류 장치 및/또는 서버에서 전송되는 링크에 접속하는 것만 으로 인증 과정이 수행될 수도 있다. 본 실시 예에서, 사용자 단말은 사용자가 조작하는 데스크 탑 컴퓨터, 스마트폰, 노트북, 태블릿 PC, 스마 트 TV, 휴대폰, PDA(personal digital assistant), 랩톱, 미디어 플레이어, 마이크로 서버, GPS(global positioning system) 장치, 전자책 단말기, 디지털방송용 단말기, 네비게이션, 키오스크, MP3 플레이어, 디지털 카메라, 가전기기 및 기타 모바일 또는 비모바일 컴퓨팅 장치일 수 있으나, 이에 제한되지 않는다. 또한, 사용 자 단말은 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 단 말기 일 수 있다. 사용자 단말은 상술한 내용에 제한되지 아니하며, 웹 브라우징이 가능한 단말기는 제한 없이 차용될 수 있다. 한편, 일 실시 예에서, 이미지 분류 시스템은 이미지 분류 장치 및/또는 서버에 의해 구현될 수 있다. 다시 말하면, 일 실시 예에서, 이미지 분류 장치는 서버에서 구현될 수 있는데, 이때 서버는 이 미지 분류 장치가 포함되는 이미지 분류 시스템을 운용하기 위한 서버이거나 이미지 분류 장치의 일부분 또는 전 부분을 구현하는 서버일 수 있다. 또한, 서버는 이미지 분류 장치를 동작시키는 데이터를 제공하는 데이터베이스 서버일 수 있다. 그 밖에 서버는 웹 서버 또는 어플리케이션 서버 또는 딥러닝 네트워크 제공 서버를 포함할 수 있다. 그리고 서버는 각종 인공 지능 알고리즘을 적용하는데 필요한 빅데이터 서버 및 AI 서버, 각종 알고리즘의 연산을 수행하는 연산 서버 등을 포함할 수 있다. 또한 일 실시 예에서, 서버는 상술하는 서버들을 포함하거나 이러한 서버들과 네트워킹 할 수 있다. 즉, 본 실시 예에서, 서버는 상기의 웹 서버 및 AI 서버를 포함하거나 이러한 서버들과 네트워킹 할 수 있다. 한편, 이미지 분류 시스템에서 이미지 분류 장치 및 서버는 네트워크에 의해 연결될 수 있다. 이러한 네트워크는 예컨대 LANs(local area networks), WANs(Wide area networks), MANs(metropolitan area networks), ISDNs(integrated service digital networks) 등의 유선 네트워크나, 무선 LANs, CDMA, 블루투스, 위성 통신 등의 무선 네트워크를 망라할 수 있으나, 본 개시의 범위가 이에 한정되는 것 은 아니다. 또한 네트워크는 근거리 통신 및/또는 원거리 통신을 이용하여 정보를 송수신할 수 있다. 또한, 네트워크는 허브, 브리지, 라우터, 스위치 및 게이트웨이와 같은 네트워크 요소들의 연결을 포함할 수 있다. 네트워크는 인터넷과 같은 공용 네트워크 및 안전한 기업 사설 네트워크와 같은 사설 네트워크를 비롯한 하나 이상의 연결된 네트워크들, 예컨대 다중 네트워크 환경을 포함할 수 있다. 네트워크에의 액세 스는 하나 이상의 유선 또는 무선 액세스 네트워크들을 통해 제공될 수 있다. 더 나아가 네트워크는 사물 등 분산된 구성 요소들 간에 정보를 주고받아 처리하는 IoT(Internet of Things, 사물인터넷) 망 및/또는 5G 통 신을 지원할 수 있다. 도 2는 일 실시 예에 따른 이미지 분류 장치를 개략적으로 나타낸 블록도이다. 도 2를 참조하면, 이미지 분류 장치는 통신부, 사용자 인터페이스, 메모리 및 프로세서 를 포함할 수 있다. 통신부는 네트워크와 연동하여 외부 장치간의 송수신 신호를 패킷 데이터 형태로 제공하는 데 필요한 통신 인터페이스를 제공할 수 있다. 또한 통신부는 다른 네트워크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프트웨어를 포함하는 장치일 수 있다. 이러한 통신부는 각종 사물 지능 통신(IoT(internet of things), IoE(internet of everything), IoST(internet of small things) 등)을 지원할 수 있으며, M2M(machine to machine) 통신, V2X(vehicle to everything communication) 통신, D2D(device to device) 통신 등을 지원할 수 있다. 통신부는 WiFi 모듈, Bluetooth 모듈, 무선 통신 모듈, 및 NFC 모듈 중 적어도 하나를 포함할 수 있다. 사용자 인터페이스는 이상 감지를 위해 이미지 분류 장치에 적용되는 소스 이미지와 노이즈가 포함된 이미지를 포함하는 디노이징 데이터 셋, 소스 이미지와 객체 영역이 마스크로 표시된 실제 이미지(ground- truth)를 포함하는 분할 데이터 셋, 그리고 정상, 비정상, 미정으로 레이블링된 이미지 등이 획득 및 수집되고, 이상 감지를 위한 사용자 요청 및 명령들이 입력되는 입력 인터페이스를 포함할 수 있다. 이때 디노이징 데이서셋의 소스 이미지와 분할 데이터 셋의 소스 이미지는 동일 이미지일 수 있으며, 상기 이미지들은 사용자에 의해 입력되거나 서버로부터 획득될 수 있다. 그리고 사용자 인터페이스는 이미지 분류 장치에서 수행된 결과가 출력되는 출력 인터페이스를 포함 할 수 있다. 예를 들어, 이상 감지 결과에 따른 점검 필요 여부가 출력될 수 있다. 즉 사용자 인터페이스 는 이상 감지를 위한 사용자 요청 및 명령에 따른 결과를 출력할 수 있다. 이러한 사용자 인터페이스의 입력 인터페이스와 출력 인터페이스는 동일한 인터페이스에서 구현될 수 있다. 메모리는 이미지 분류 장치의 동작의 제어(연산)에 필요한 각종 정보들을 저장하고, 제어 소프트웨어 를 저장할 수 있는 것으로, 휘발성 또는 비휘발성 기록 매체를 포함할 수 있다. 메모리는 하나 이상의 프로세서와 연결되는 것으로, 하나 이상의 프로세서와 전기적 또는 내부 통신 인터페이스로 연결될 수 있으며, 프로세서에 의해 실행될 때, 프로세서로 하여금 이미지 분류 장치를 제어하도록 야기하는(cause) 코드들을 저장할 수 있다. 여기서, 메모리는 자기 저장 매체(magnetic storage media) 또는 플래시 저장 매체(flash storage medi a)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 이러한 메모리는 내장 메모리 및/ 또는 외장 메모리를 포함할 수 있으며, DRAM, SRAM, 또는 SDRAM 등과 같은 휘발성 메모리, OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, NAND 플래시 메모리, 또는 NOR 플래시 메모리 등과 같은 비휘발성 메모리, SSD. CF(compact flash) 카드, SD 카드, Micro-SD 카드, Mini-SD 카드, Xd 카드, 또는 메모리 스틱(memory stick) 등과 같은 플래시 드라이브, 또는 HDD와 같은 저장 장치를 포함할 수 있다. 특히, 본 실시 예에서, 메모리에는 본 개시에 따른 신경망 모델, 신경망 모델을 이용하여 본 개시의 다양 할 실시 예를 구현할 수 있도록 구현된 모듈이 저장될 수 있다. 그리고, 메모리에는 본 개시에 따른 학습 을 수행하기 위한 알고리즘에 관련된 정보가 저장될 수 있다. 또한 메모리에는 본 개시에 따른 학습을 수 행하기 위한 알고리즘 및 수행 코드에 관련된 정보가 일시적 또는 비 일시적으로 저장될 수 있다. 그 밖에도 본 개시의 목적을 달성하기 위한 범위 내에서 필요한 다양한 정보가 메모리에 저장될 수 있으며, 메모리(13 0)에 저장된 정보는 서버 또는 외부 장치로부터 수신되거나 사용자에 의해 입력됨에 따라 갱신될 수도 있다. 프로세서는 이미지 분류 장치의 전반적인 동작을 제어할 수 있다. 구체적으로, 프로세서는 상술 한 바와 같은 메모리를 포함하는 이미지 분류 장치의 구성과 연결되며, 상술한 바와 같은 메모리 에 저장된 적어도 하나의 명령을 실행하여 이미지 분류 장치의 동작을 전반적으로 제어할 수 있다. 프로세서는 다양한 방식으로 구현될 수 있다. 예를 들어, 프로세서는 주문형 집적 회로(Application Specific Integrated Circuit, ASIC), 임베디드 프로세서, 마이크로 프로세서, 하드웨어 컨트롤 로직, 하드웨 어 유한 상태 기계(Hardware Finite State Machine, FSM), 디지털 신호 프로세서(Digital Signal Processor, DSP) 중 적어도 하나로 구현될 수 있다. 프로세서는 일종의 중앙처리장치로서 메모리에 탑재된 제어 소프트웨어를 구동하여 이미지 분류 장치 의 전체의 동작을 제어할 수 있다. 프로세서는 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 여기서, '프로세서(processor)'는, 예를 들어 프로그램 내에 포함된 코드 또는 명령어로 표현된 기능 을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로써, 마이크로프로세서(microprocessor), 중앙처리장치 (central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망 라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 본 실시 예에서 프로세서는 이미지 분류 장치가 최적의 이미지 분류 결과를 출력하도록, 획득된 이미 지에 대하여 딥러닝(Deep Learning) 등 머신 러닝(machine learning)을 수행할 수 있고, 메모리는, 머신 러닝에 사용되는 데이터, 결과 데이터 등을 저장할 수 있다. 즉 본 실시 예에서, 프로세서는 딥러닝 기반 이미지 처리 기술을 활용한 이상 감지를 수행하는 것으로, 이 상 상태를 감지하고자 하는 대상 객체를 촬영한 이미지를 획득하고, 상기 이미지에 대해 정상, 비정상, 미정(검 출 불가)으로 분류하도록 훈련된 딥러닝 기반 학습 모델을 로딩할 수 있다. 그리고 프로세서는 획득한 이 미지에 상기 로딩한 학습 모델을 적용하여 상기 이미지에 대해 정상, 비정상, 미정을 출력할 수 있다. 즉 본 실시 예는, 예를 들어, 철도 레일의 이상 상태를 감지하는 인공신경망의 효과적인 학습 방법을 제안하는 것으로, 프로세서는 이러한 인공신경망, 즉 이미지 분류 모델을 기반으로 이상 상태를 정확히 진단할 수 있다. 일 실시 예의 이미지 분류 모델에 대한 구체적인 설명은 도 3을 참조하여 후술하도록 한다. 도 3은 일 실시 예에 따른 이미지 분류 모델의 구조를 설명하기 위한 도면이다. 최근 몇 년 동안 인공 지능(AI)의 발전으로, 예를 들어 인공 지능의 하위 분야인 딥 러닝 기반 알고리즘은 초음 파나 압력을 감지하는 등의 센서에서 얻은 시계열 데이터를 사용하여, 이상 상태를 감지하고자 하는 객체가 포 함된 이미지에서 이상 상태를 분류할 수 있다. 또한 대표적인 딥러닝 모델인 CNN(Convolutional Neural Network) 아키텍처는 디콘볼루션 계층을 사용하여 연산량과 메모리를 줄여 공간 정보 추출과 정확한 분류를 가 능하게 할 수 있다. 그러나 이미지에 표시된 객체(이상 감지를 위한 객체)의 위치가 가변적인 경우 장애물에 의해 가려질 수 있고, 저해상도의 시각센서에 의해 수집되는 경우 노이즈가 발생할 가능성이 높기 때문에, 일 실시 예에서는, 이러한 제한 사항을 고려하여 분류 성능이 향상되도록 할 수 있다. 따라서 일 실시 예에서는, 멀티태스크 전이 학습을 사용하여, 이상 감지 객체에 대한 심층 이상 탐지를 수행할 수 있다. 일 실시 예의 멀티태스크 전이 학습은 주요 태스크(목표 태스크)와 관련된 보조 태스크를 훈련시켜 주 요 태스크에 대한 성능을 향상시킬 수 있다. 일 실시 예에서 주요 태스크는 이상 감지이며, 미리 정의된 보조 태스크(소스 태스크)는 이미지의 분할 및 노이즈 제거이다. 즉, 일 실시 예에서는 먼저 분할 및 노이즈 제거로 구성된 보조 태스크에 대해 학습될 수 있다. 따라서 관심 영 역의 노이즈 및 가변성과 같은 제한 사항에 대해 비교적 견고할 수 있다. 그리고 일 실시 예에서, 머신 러닝 또는 딥 러닝 기반 분류기는 사전 훈련된 모델에서 특징 추출 레이어의 출력 을 사용하여 이상을 감지할 수 있다. 즉, 일 실시 예에서는, 신뢰성을 위한 멀티태스크 전이 학습을 이용하여 이미지 기반 객체의 이상 탐지를 수행 할 수 있다. 이때 적용되는 이미지 분류를 위한 학습 모델의 전체 구조는 도 3과 같다. 먼저, 이미지 분류 모델은 분할 및 노이즈 제거로 구성된 보조 태스크를 위해 훈련된다. 각 보조 태스크에 대한 딥러닝 모델의 구조는 U-Net을 기반으로 할 수 있다. U-Net은 생물의학 분야에서 제안된 end-to-end 방식의 영 상 분할 접근 방식을 기반으로 하는 full-convolution network로, 구조가 알파벳 'U'와 유사하여 U-Net이라고 한다. U-Net은 영상의 전체적인 맥락 정보를 얻기 위한 네트워크와 대칭적인 형태의 위치 정보를 위한 네트워크 로 구성된다. 또한, 이미지 분류 모델의 특징 추출 단계에서는 3 x 3 컨볼루션 레이어와 ReLU(Rectified Linear Unit)를 사용 하여 특징맵을 수집할 수 있다. 예를 들어, 3개의 채널이 있는 128 x 128 크기의 이미지가 입력되고 1024개의 채널이 있는 8 x 8 크기의 특징맵이 출력될 수 있다. 노이즈 제거 네트워크와 분할 네트워크는 특징 추출 단계 에서 특징맵 출력을 수신하고 128 x 128의 노이즈 제거 이미지로 객체에 대한 분할 마스크를 생성할 수 있다. 그리고 이미지 분류 모델은 보조 태스크를 통해 사전 훈련된 인코더에서 추출한 특징 맵을 이용하여 이상 감지 를 위한 분류기를 훈련시킬 수 있다. 분할 및 디노이징을 수행하는 보조 태스크에 대해 보다 구체적으로 설명하면, 보조 태스크는 컨텍스트 정보 수 집 및 노이즈 제거를 통해 성능을 더욱 향상시키기 위해 분할 네트워크 및 디노이징 네트워크로 구성될 수 있다. 분할 태스크는, 객체의 상태에 따라 분류되는 이상 감지 태스크에서, 객체의 위치를 지정하도록 모델을 훈련시 키는 것이다. 이상 감지 모델에 신뢰성을 주기 위해서는 객체를 기반으로 정상 및 비정상 클래스를 예측해야 한 다. 따라서 본 역할을 충분히 수행하기 위해서는 객체의 특성을 찾는 것이 필요하다. 예를 들어, 객체가 패스너인 경우 다음과 같은 특성이 있다. 1) 모든 패스너가 레일에 가깝고 철도 타이에 설치 된다. 2) 패스너에는 레일을 레일 로드 타이 위의 올바른 위치에 고정하기 위한 핀이 있다. 위의 특징을 표현하 기 위해서는 패스너 뿐만 아니라 레일 정보도 필요하다는 의미이다. 또한, 패스너와 레일이 서로 독립적이라는 정보가 필요하므로 둘 다 분할될 수 있도록 학습할 필요가 있다. 따라서 분할 데이터 셋을 생성할 때, 레일 정 보 및 패스너의 특성 정보를 모두 포함하되, 독립된 객체임을 표현해야 한다. 이를 바탕으로 총 2개의 분할 클 래스를 가지고 패스너와 레일을 제외한 모든 객체가 배경으로 설정되도록 할 수 있다. 노이즈 제거 태스크는 이미지에서 노이즈를 제거하여 고품질 이미지를 얻기 위한 일련의 프로세스이다. 이미지 를 이용한 이상 감지 시스템은 카메라 센서를 이용하여 촬영한 후 데이터를 입력한다. 따라서 철도 트랙의 이상을 감지하는 효율적인 방법이다. 단, 고속열차에서 촬영하면 초점불량, 노이즈 발생 등 의 상황이 발생할 수 있기 때문에, 일 실시 예에서는, 이러한 문제를 해결하기 위한 보조 태스크로 노이즈 제거 를 선택하여 추가적인 성능 향상을 기대할 수 있다. 노이즈 제거 네트워크 훈련은 인위적으로 추가된 노이즈를 사용하며 Autoencoder 기반으로 설계된 네트워크일 수 있다. 노이즈 제거 네트워크용 데이터셋의 경우, 예를 들어, 컴퓨터 비전 알고리즘을 사용하여 인위적으로 생성된 노 이즈 이미지를 포함할 수 있다. 한편, 보조 태스크에 사용된 데이터 세트는 원본 이미지에 가우시안 블러, 솔트 앤 페퍼 노이즈, 회전(0도에서 20도 사이), 뒤집기(세로 및 수평), 확대/축소(0%에서 20% 사이)의 데이터 증강 기술을 적용하여 생성될 수 있 다. 또한, train, validation, test를 나누어 Data Augmentation 기법을 사용하여, 중복된 이미지가 없도록 할 수 있다. 한편, 이상 감지는 일반적으로 정상이 아닌 여러 상황 및 조건을 예측하는 이상 클래스를 예측하는 이진 클래스 분류이다. 그러나 일 실시 예에서는, 정상, 비정상, 미정으로 총 3가지 등급을 정의할 수 있다. 그 이유는 철도 이미지에서 패스너는 언제 어디서나 볼 수 있지만 전혀 보이지 않을 수 있기 때문이다. 특히, 패스너는 이미지의 어느 위치에나 있을 수 있으며 바위 및 나뭇가지와 같은 장애물에 의해 가려질 수 있다. 따 라서 파스너 유무를 확인한 후 정상과 비정상을 구분할 필요가 있다. 이미지 분류 모델은 기능 맵 평면화 또는 GAP(Global Average Pooling)를 사용하여 결과를 수신한 다음 각 클래 스에 대한 확률을 출력할 수 있다. 예를 들어, SVM(Support Vector Machine), RF(Random Forest), DT(Decision Tree), AB(AdaBoost), MLP(Multilayer Perceptron), FC(Fully Connected Layer) 및 GAP가 분류기로 사용될 수 있다. FC와 GAP의 차이점은 2D 기능 맵을 1D로 변환하는 방법이고, FC는 플랫 레이어를 사용하는 반면 GAP는 글 로벌 평균 풀링을 사용한다. 주요 태스크에 사용되는 데이터 중, 정상 데이터 셋에서는 철도용 타이와 패스너가 짝을 이루고 있으며, 패스너 는 정상적인 역할을 수행할 수 있다고 판단되는 이미지로 구성될 수 있다. 반면에 비정상 데이터는 분실 및 파 손과 같은 이상 레일 패스너의 이미지일 수 있고, 결정되지 않은 미정 데이터는 돌, 나뭇가지 등의 장애물에 의 해 패스너가 가려진 이미지일 수 있다. 주요 태스크에 사용된 데이터셋은 가우시안 블러, 솔트 앤 페퍼 노이즈, 회전(0도에서 20도 사이), 뒤집기(세로 및 수평), 확대/축소(0%에서 20% 사이)의 데이터 증강 기술이 적용될 수 있다. 또한, train, validation, test 를 나누어 Data Augmentation 기법을 사용하여 중복 이미지가 없도록 할 수 있다. 도 4는 일 실시 예에 따른 이미지 분류 방법을 설명하기 위한 흐름도이다. 도 4를 참조하면, S100단계에서, 프로세서는 입력 이미지를 획득한다. 여기서, 입력 이미지는 이상 상태 감지를 위한 객체가 포함된 이미지일 수 있으며, 학습 단계에서는 정상, 비정 상, 미정으로 레이블링된 이미지 데이터셋일 수 있다. S200단계에서, 프로세서는 입력 이미지를 제1 학습 모델에 입력하여 입력 이미지를 분류한다. 여기서, 제1 학습 모델은 제1 인코더 및 제1 분류기를 포함할 수 있다. 그리고 제1 인코더는 제1 학습 모델과 다른 종류의 학습 모델로서, 인코더 및 디코더를 포함하는 학습 모델에서 훈련된 인코더일 수 있다. 즉, 제1 인코더는 이미지의 노이즈를 제거하거나 이미지를 분할하는 딥러닝 기반의 상기 학습 모델에서 훈련된 인코더일 수 있다. 예를 들어, 제1 인코더는 보조 멀티태스크로서 수행되는 디노이 징 및 분할 네트워크에 의해 학습된 것일 수 있다. 그리고 제1 인코더는, 동일한 인코더 및 각각 서로 다른 디코더로 구성되고, 이미지의 노이즈를 제거하는 딥러 닝 기반의 제2 학습 모델 및 이미지를 분할하는 딥러닝 기반의 제3 학습 모델에서 훈련된 인코더일 수 있다. 즉, 일 실시예에서는, 인코더가 디노이징으로도 훈련되고 분할으로도 훈련된 다음, 제1 학습 모델에 전이될 수 있다. 이때, 제2 학습 모델은 소스 이미지와 노이즈가 포함된 이미지를 포함하는 디노이징 데이터 셋으로 훈련될 수 있으며, 제3 학습 모델은 소스 이미지와 객체 영역이 마스크로 표시된 실제 이미지(ground-truth)를 포함하는 분할 데이터 셋으로 훈련될 수 있다. 제2 학습 모델의 소스 이미지와 제3 학습 모델의 소스 이미지는 동일한 이 미지일 수도 있다. 일 실시 예에서, 제1 학습 모델은 이미지 분류 모델을 의미할 수 있으며, 훈련 페이즈(training phasa)를 거쳐 훈련될 수 있다. 이러한 제1 학습 모델은, 정상, 비정상 및 미정 중 하나로 레이블링 된 이상 감지 이미지 데이 터 셋을 수집하는 단계와, 기 학습된 제1 인코더에서 학습된 가중치를 기반으로 획득한 이미지의 특징맵을 추출 하는 단계와, 특징맵을 기반으로 수집 이미지를 정상, 비정상 및 미정 중 하나의 클래스로 분류하는 단계로 구 성될 수 있다. 한편, 일 실시 예에서는, 학습 모델의 훈련 단계에서, 소스 이미지와 노이즈가 포함된 이미지를 포함하는 디노 이징 데이터 셋으로 제2 학습 모델을 훈련하고, 소스 이미지와 객체 영역이 마스크로 표시된 실제 이미지 (ground-truth)를 포함하는 분할 데이터 셋으로 제3 학습 모델을 훈련한 후, 학습된 인코더의 가중치를 공유하 여, 정상, 비정상, 미정으로 레이블링된 데이터셋으로 제1 학습 모델을 훈련할 수 있다. 그리고 적용 단계에서는, 이상 감지를 위한 객체가 포함된 이미지가 입력되면, 제2 학습 모델 및 제3 학습 모델 의 멀티태스크 네트워크에서 기 학습된 인코더 기반 디노이징 및 분할 태스크를 수행하고, 이후 제1 학습 모델 에서 정상, 비정상, 미정 중 하나의 클래스를 분류할 수 있다. 한편, 일 실시 예에서는, 이미지 분류 모델의 성능 확인을 위한 실험 결과를 통해 멀티태스크 전이 학습을 기반 으로 한 이미지 분류 모델을 검증할 수 있다. 멀티태스크 전이 학습을 기반으로 객체 이상 감지의 성능을 향상시키려면 정확한 보조 태스크 선택 및 데이터셋 이 필요하다. 이에 일 실시 예에서는, 위치 정보를 위한 분할 네트워크와 추가적인 성능 향상 및 노이즈 제거를 위한 노이즈 제거 네트워크를 선택할 수 있다. 이때, 일 실시 예에서는, 객체의 특성을 반영하여 데이터셋을 수집(생성)할 수 있으며, 객체의 특징이 여러 개 인 경우, 각 객체가 독립된 객체임을 표현해야 한다. 이를 기반으로 객체별 복수의 클래스를 포함하고 해당 객 체를 제외한 모든 객체가 배경으로 설정된 데이터셋이 수집(생성)될 수 있다. 또한, 노이즈 제거 네트워크용 데 이터셋의 경우 컴퓨터 비전 알고리즘을 사용하여 인위적으로 생성된 노이즈 이미지를 포함할 수 있다. 그리고 주요 태스크를 위한 데이터셋에는 정상, 비정상 및 미정으로 레이블링된 데이터셋이 포함될 수 있다. 예 를 들어, 정상 데이터셋에는 철도용 타이와 패스너가 짝을 이루고 있으며 패스너는 정상적인 역할을 수행할 수 있다고 판단되는 이미지로 구성된다. 반면에 비정상 데이터셋은 분실 및 파손과 같은 이상 레일 패스너의 이미 지로 구성되고, 미정 데이터셋은 돌, 나뭇가지 등의 장애물에 의해 패스너가 가려진 이미지로 구성될 수 있다. 상기의 보조 태스크를 위한 데이터셋과 주요 태스크를 위한 데이터셋은 모두 가우시안 블러, 솔트 앤 페퍼 노이 즈, 회전(0도에서 20도 사이), 뒤집기(세로 및 수평), 확대/축소(0%에서 20% 사이)의 데이터 증강 기술이 적용 되어 데이터가 생성될 수 있으며, train, validation, test를 나누어 Data Augmentation 기법을 사용하였기 때 문에 중복된 이미지가 없다. 그리고 일 실시 예의 이미지 분류 모델은, 예를 들어, SVM(Support Vector Machine), RF(Random Forest), DT(Decision Tree), AB(AdaBoost), MLP(Multilayer Perceptron), FC(Fully Connected Layer) 및 GAP가 분류기 로 사용될 수 있다. 표 1 표 1은 단일 태스크 학습 기반 분류 모델 비교 결과를 나타낸 것으로, 이상 감지를 위한 멀티태스크 전이 학습 없이 단일 태스크 학습 방식을 사용하여 훈련된 7개의 선택된 모델에 대한 평가 결과를 보여준다. 표 1을 참조하면, 머신러닝 모델을 사용할 경우 RF, MLP 이외의 모델은 정확도 기준으로 약 52% 성능을 보이며 결과가 좋지 않다. 반면 RF와 MLP는 각각 80.59%와 78.93%로 좋은 결과를 얻을 수 있었음을 확인할 수 있다. 딥 러닝 모델의 경우 GAP가 95.77%의 성능으로 Top-1 모델로 선정되었으며 FC는 78.28%로 RF 및 MLP보다 약간 낮은 성능을 보였다. FC, RF, MLP 모델의 경우 미정 클래스가 비교적 잘 식별되지만 정상 및 비정상 감지가 정확하지 않음을 확인할 수 있다. 그 이유는 단순히 이미지에 다른 장애물이나 물질이 많기 때문이라고 생각되나, 정상 및 비정상 감지를 위한 객체의 특성이 불분명하면 정해진 클래스가 아닌 것으로 예측되는 경향이 있다. 표 2"}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "표 2는 분할 태스크만을 이용한 멀티태스크 학습 기반 분류 모델의 비교 결과를 나타낸 것으로, 보조 태스크로 분할 태스크만 사용하는 경우 객체의 위치 정보가 학습되는지 확인하기 위한 실험 결과를 보여준다. 표 2를 참조하면, 멀티태스크 전이 학습은 단일 태스크 모델과 정확도를 비교할 때 약 13% 더 높았다. 또한, 멀 티태스크 전이 학습(분할)의 Top-1 모델만 GAP로 선택했는데, 이는 단일 태스크 실험에서의 Top-1 모델에 비해 정확도 기준으로 약 1.1% 더 높다는 것을 확인할 수 있다. 분할 태스크만을 이용한 멀티태스크 학습 기반 분류 모델의 경우, 단일 태스크 모델에 비해 보다 정확한 검출이 필요한 영역에 가중치가 있으나 노이즈가 섞인 이미 지에서는 아직 검출에 필요하지 않은 부분에 가중치가 있음을 확인할 수 있다. 표 3"}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "표 3은 디노이징 태스크만 있는 멀티태스크 학습 기반 분류 모델의 비교 결과를 나타낸 것으로, 단일 태스크 모 델과 정확도를 비교할 때, 멀티태스크 전이 학습은 약 2% 낮은 성능을 보임을 확인할 수 있으나, FC와 SVM은 92.5%와 67.07%로 더 높은 정확도를 보임을 확인할 수 있다. 또한 분할 태스크만 보조 태스크로 사용하는 FC 및 GAP 모델과 단순 비교하면 성능 차이가 약 2%로 크지 않으며, Top-1 모델에는 95.96%의 성능을 가진 GAP가 선정 될 수 있다. 표 3을 참조하면, 디노이징 태스크만 사용한 멀티태스크 모델에서 FC 및 GAP에 GradCAM을 적용하면, 분할 태스 크와 달리 분류에 필요하지 않은 부분의 가중치나 두 개의 객체 중 하나만의 가중치 등 분류를 위한 위치 정보 가 거의 없을 수 있어, 각 감지 모델의 성능에 미치는 영향이 다르다는 것을 알 수 있다. 따라서 디노이징 태스 크는 사용 방법에 따라 성능 향상을 기대할 수 있다. 표 4"}
{"patent_id": "10-2022-0136653", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "표 4는 분할 태스크 및 디노이징 태스크를 사용한 멀티태스크 학습 기반 분류 모델 비교 결과를 나타낸 것으로, 보조 태스크로 디노이징과 분할을 동시에 사용할 때 각 이상 감지 모델의 실험 결과를 보여준다. 표 4를 참조하 면, 단일 태스크 모델에 비해 성능이 약 15% 향상되었으며, 다른 실험 결과와 달리 FC 모델이 Top-1 모델로 선 정되었음을 확인할 수 있다. FC 모델의 정확도는 97.57%로 모든 작업 대비 최고의 성능을 보였으며, 분할 태스 크만 사용했을 때보다 추가적인 성능 향상을 보여 디노이징 효과가 있음을 확인할 수 있다. 또한 FC의 경우 분 할 태스크만 사용하는 경우보다 더 정확한 위치 정보를 표현할 수 있음을 확인할 수 있다. 따라서 멀티태스크 전이 학습 기반 이상 감지를 위한 이미지 분류 모델을 학습하면 성능을 향상시킬 수 있고, ROI를 별도로 설정하지 않고도 모델의 신뢰도를 높일 수 있다. 즉, 상술한 바에 따르면, 일 실시 예에서는, 이미지를 사용하여 이상 상태를 감지하기 위한, 멀티태스크 전이 학습 기반 딥러닝 아키텍처를 제안할 수 있으며, 이러한 이미지 분류 모델의 성능 검증 결과를 보면, 표 1에서 보는 바와 같이 대부분의 단일 태스크 학습 기반 분류기의 분류 성능은 81% 이하이다. 한편, 표 2 내지 4에서 보는 바와 같이, 이상 감지를 위한 분류기를 멀티태스크 전이 학습 기반으로 하는 경우 성능이 향상됨을 확인할 수 있다. 가장 성능이 좋은 모델은 약 97.5%의 정확도로 분할과 디노이징을 보조 태스 크로 사용하는 FC임을 확인할 수 있다. 결론적으로 일 실시 예의 이미지 분류 모델은, ROI를 위한 분할과 디노 이징으로 구성된 보조 태스크를 통해 이미지에 대한 이해도를 높여 작은 크기의 데이터셋을 사용함에도 불구하 고 보다 정확한 이상 감지에 기여할 수 있다. 즉, 멀티태스크 전이 학습 기반의 이상 감지를 위한 이미지 분류 모델이 일반 분류 모델보다 우수한 성능과 신뢰성을 가짐을 확인할 수 있다. 이상 설명된 본 개시에 따른 실시 예는 컴퓨터 상에서 다양한 구성요소를 통하여 실행될 수 있는 컴퓨터 프로그 램의 형태로 구현될 수 있으며, 이와 같은 컴퓨터 프로그램은 컴퓨터로 판독 가능한 매체에 기록될 수 있다. 이 때, 매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같은, 프로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 한편, 상기 컴퓨터 프로그램은 본 개시를 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨어 분야의 통상의 기술자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 프로그램의 예에는, 컴파일러에 의하여 만들어 지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함될 수 있다. 본 개시의 명세서(특히 특허청구범위에서)에서 \"상기\"의 용어 및 이와 유사한 지시 용어의 사용은 단수 및 복수 모두에 해당하는 것일 수 있다. 또한, 본 개시에서 범위(range)를 기재한 경우 상기 범위에 속하는 개별적인 값 을 적용한 발명을 포함하는 것으로서(이에 반하는 기재가 없다면), 발명의 상세한 설명에 상기 범위를 구성하는 각 개별적인 값을 기재한 것과 같다.본 개시에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 개시가 한정되는 것은 아니 다. 본 개시에서 모든 예들 또는 예시적인 용어(예들 들어, 등등)의 사용은 단순히 본 개시를 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 개시의 범위 가 한정되는 것은 아니다. 또한, 통상의 기술자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다. 따라서, 본 개시의 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 개시의 사상의 범주에 속한 다고 할 것이다."}
{"patent_id": "10-2022-0136653", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 이미지 분류 시스템 환경을 개략적으로 나타낸 도면이다. 도 2는 일 실시 예에 따른 이미지 분류 장치를 개략적으로 나타낸 블록도이다. 도 3은 일 실시 예에 따른 이미지 분류 모델의 구조를 설명하기 위한 도면이다. 도 4는 일 실시 예에 따른 이미지 분류 방법을 설명하기 위한 흐름도이다."}
