{"patent_id": "10-2022-0034531", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0019766", "출원번호": "10-2022-0034531", "발명의 명칭": "복수의 무선 통신 방식을 지원하는 기지국 및 그 방법", "출원인": "삼성전자주식회사", "발명자": "안진수"}}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통신 모듈; 및 프로세서를 포함하고,상기 프로세서는,복수의 네트워크 중 적어도 하나를 이용하고, 상기 복수의 네트워크가 공유하는 주파수 자원을 할당해야 하는베어러를 확인하고,상기 확인된 베어러에 기초해 상기 복수의 네트워크 중 다음 단위 시간에 상기 주파수 자원을 할당할 네트워크를 결정하고, 상기 결정된 네트워크에 기초해 상기 확인된 베어러 중 적어도 일부의 베어러에 상기 주파수 자원 중 적어도 일부를 할당하는, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는,상기 다음 단위 시간 이전에 자원이 할당된 네트워크의 히스토리와 상기 복수의 네트워크 간 분배 비율을 고려하여 상기 네트워크를 결정하는, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 다음 단위 시간 이전에 자원이 할당된 네트워크의 히스토리는 상기 복수의 네트워크 각각에 할당된RB(resource block) 수, 단말 수, 베어러 수, 및 이들의 누적값 중 적어도 일부를 포함하는, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 복수의 네트워크 간 분배 비율은 상기 다음 단위 시간에 상기 복수의 네트워크 각각에 연결된 단말 수, 베어러 수, 버퍼 크기 중 적어도 일부에 기초하여 결정된 비율인, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 프로세서는,상기 결정된 네트워크에 의해 지원되지 않는 베어러 중 우선 순위가 임계값보다 높은 베어러에 상기 주파수 자원 중 적어도 일부를 할당하는, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 프로세서는,공개특허 10-2023-0019766-3-상기 베어러를 스케쥴링하는데 필요한 자원을 계산하는, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 프로세서는,네트워크 별로 할당되는 자원의 비율을 결정하는, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 프로세서는,상기 확인된 베어러 중 우선 순위가 높은 베어러에 상기 주파수 자원 중 적어도 일부를 할당하는, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 프로세서는,상기 확인된 베어러 중 우선 순위가 동일한 베어러는 미리 설정된 파라미터, 공정성 계산자, 또는 이들의 통합에 기초해 상기 주파수 자원 중 적어도 일부를 할당하는, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 복수의 네트워크는 LTE 네트워크와 NR 네트워크를 포함하는, 네트워크 장치."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "네트워크 장치의 동작 방법에 있어서,복수의 네트워크 중 적어도 하나를 이용하고, 상기 복수의 네트워크가 공유하는 주파수 자원을 할당해야 하는베어러를 확인하는 동작;상기 확인된 베어러에 기초해 상기 복수의 네트워크 중 다음 단위 시간에 상기 주파수 자원을 할당할 네트워크를 결정하는 동작;및상기 결정된 네트워크에 기초해 상기 확인된 베어러 중 적어도 일부의 베어러에 상기 주파수 자원 중 적어도 일부를 할당하는 동작을 포함하는 네트워크 장치의 동작 방법."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 네트워크를 결정하는 동작은,상기 다음 단위 시간 이전에 자원이 할당된 네트워크의 히스토리와 상기 복수의 네트워크 간 분배 비율을 고려하여 상기 네트워크를 결정하는 동작인, 네트워크 장치의 동작 방법."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 공개특허 10-2023-0019766-4-상기 다음 단위 시간 이전에 자원이 할당된 네트워크의 히스토리는 상기 복수의 네트워크 각각에 할당된RB(resource block) 수, 단말 수, 베어러 수, 및 이들의 누적값 중 적어도 일부를 포함하는, 네트워크 장치의동작 방법."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 복수의 네트워크 간 분배 비율은 상기 다음 단위 시간에 상기 복수의 네트워크 각각에 연결된 단말 수, 베어러 수, 버퍼 크기 중 적어도 일부에 기초하여 결정된 비율인, 네트워크 장치의 동작 방법."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 결정된 네트워크에 의해 지원되지 않는 베어러 중 우선 순위가 임계값보다 높은 베어러에 상기 주파수 자원 중 적어도 일부를 할당하는 동작을 더 포함하는 네트워크 장치의 동작 방법."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 베어러를 확인하는 동작은,상기 베어러를 스케쥴링하는데 필요한 자원을 계산하는 동작을 포함하는 네트워크 장치의 동작 방법."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서, 상기 네트워크를 결정하는 동작은,네트워크 별로 할당되는 자원의 비율을 결정하는 동작을 포함하는 네트워크 장치의 동작 방법."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 주파수 자원 중 적어도 일부를 할당하는 동작은,상기 확인된 베어러 중 우선 순위가 높은 베어러에 상기 주파수 자원 중 적어도 일부를 할당하는 동작인, 네트워크 장치의 동작 방법."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 주파수 자원 중 적어도 일부를 할당하는 동작은,상기 확인된 베어러 중 우선 순위가 동일한 베어러는 미리 설정된 파라미터, 공정성 계산자, 또는 이들의 통합에 기초해 상기 주파수 자원 중 적어도 일부를 할당하는 동작인, 네트워크 장치의 동작 방법."}
{"patent_id": "10-2022-0034531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서, 상기 복수의 네트워크는 LTE 네트워크와 NR 네트워크를 포함하는, 네트워크 장치의 동작 방법.공개특허 10-2023-0019766-5-"}
{"patent_id": "10-2022-0034531", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예들에 따른 네트워크 장치는 통신 모듈 및 프로세서를 포함하고 프로세서는 복수의 네트워크 중 적 어도 하나를 이용하고, 복수의 네트워크가 공유하는 주파수 자원을 할당해야 하는 베어러를 확인하고, 확인된 베 어러에 기초해 복수의 네트워크 중 다음 단위 시간에 주파수 자원을 할당할 네트워크를 결정하고, 결정된 네트 워크에 기초해 확인된 베어러 중 적어도 일부의 베어러에 주파수 자원 중 적어도 일부를 할당할 수 있다."}
{"patent_id": "10-2022-0034531", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예들은 복수의 무선 통신 방식을 지원하는 기지국 및 그 방법에 관한 것으로, 구체적으로, 복수의 무선 통신 방식이 공유하는 주파수 자원을 스케쥴링하는 기지국 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0034531", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래에는 각 통신 방식 별로 이용 가능한 주파수 대역을 배타적으로 미리 정해두고 이용하였다. 그런데 주파수 자원은 한정적인 반면 통신 방식은 점차 다양해지고 발전함에 따라, 복수의 무선 통신 방식이 주파수 자원을 공 유해야 하는 상황이 발생하고 있다. 동일 주파수 대역을 복수의 무선 통신 기술이 이용할 수 있는 방법은 주파수/시간을 나누어 각 주파수 대역/시 간 구간을 이용할 무선 통신 기술을 사전에 정하여 이용하거나, 다른 무선 통신 기술이 사용하고자 하는 주파수 대역을 이용하는지 확인하고 이용하는 방법이 있다."}
{"patent_id": "10-2022-0034531", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "기지국은 주파수 자원을 공유하는 복수의 무선 통신 방식을 지원하기 위해 주파수 자원을 미리 스케쥴링하거나, 캐리어를 센싱해 이용 중이 아닌 캐리어에 대해 스케쥴링을 수행하고 있다. 기지국이 주파수 자원을 미리 스케 쥴링하는 경우, 주파수 자원 할당이 동적이지 않아 서비스의 QoS를 만족시키지 못 할 수 있다. 기지국이 캐리어 를 센싱해 주파수 자원을 스케쥴링하는 경우에는, 캐리어를 센싱하기 위한 시간이 더 필요할 수 있어 서비스 제 공이 지연될 수 있다."}
{"patent_id": "10-2022-0034531", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예들에 따른 네트워크 장치는 통신 모듈 및 프로세서를 포함하고 프로세서는 복수의 네트워크 중 적 어도 하나를 이용하고, 복수의 네트워크가 공유하는 주파수 자원을 할당해야 하는 베어러를 확인하고, 확인된 베어러에 기초해 복수의 네트워크 중 다음 단위 시간에 주파수 자원을 할당할 네트워크를 결정하고, 결정된 네 트워크에 기초해 확인된 베어러 중 적어도 일부의 베어러에 주파수 자원 중 적어도 일부를 할당할 수 있다. 다양한 실시예들에 따른 네트워크 장치의 동작 방법은 복수의 네트워크 중 적어도 하나를 이용하고, 복수의 네 트워크가 공유하는 주파수 자원을 할당해야 하는 베어러를 확인하는 동작, 확인된 베어러에 기초해 복수의 네트 워크 중 다음 단위 시간에 주파수 자원을 할당할 네트워크를 결정하는 동작 및 결정된 네트워크에 기초해 확인 된 베어러 중 적어도 일부의 베어러에 주파수 자원 중 적어도 일부를 할당하는 동작을 포함할 수 있다."}
{"patent_id": "10-2022-0034531", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예에 따르면, 기지국은 복수의 네트워크가 공유하는 주파수 자원을 통합하여 스케쥴링할 수 있어 복수의 네트워크를 동시에 지원할 수 있다. 본 개시의 다양한 실시예에 따르면, 기지국은 주파수 자원을 공유하는 복수의 네트워크를 이용하는 전자 장치들 또는 베어러에 대해 단위 시간 별로 주파수 자원을 스케쥴링할 수 있어, 주파수 자원을 효율적으로 이용할 수 있다. 본 개시의 다양한 실시예에 따르면, 기지국은 복수의 네트워크에 대해 공평하게 주파수 자원을 분배할 수 있으 며, 서비스 별 QoS를 보장할 수 있고, 지연을 줄일 수 있다."}
{"patent_id": "10-2022-0034531", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모 듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가 입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈) 은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다.배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a 내지 2c는, 다양한 실시예들에 따른 레거시(Legacy) 통신 및/또는 5G 통신의 네트워크를 제공하는 무선 통신 시스템들을 도시하는 도면들이다. 도 2a 내지 도 2c를 참조하면, 네트워크 환경(200A 내지 200C)은, 레거 시 네트워크 및 5G 네트워크 중 적어도 하나를 포함할 수 있다. 레거시 네트워크는, 예를 들어, 전자 장치(예: 도 1의 전자 장치)와 무선 접속을 지원하는 3GPP 표준의 4G 또는 LTE 기지국(예를 들어, eNB(eNodeB)) 및 4G 통신을 관리하는 EPC(evolved packet core)를 포함할 수 있다. 5G 네트워크는, 예를 들어, 전자 장치와 무선 접속을 지원하는 New Radio(NR) 기지국(예를 들어, gNB(gNodeB)) 및 전자 장치의 5G 통신을 관리하는 5GC(5th generation core)를 포함할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 레거시 통신 및/또는 5G 통신을 통해 제어 메시지(control message) 및 사용자 데이터(user data)를 송수신할 수 있다. 제어 메시지는 예를 들어, 전자 장치의 보안 제어(security control), 베어러 설정(bearer setup), 인증(authentication), 등록(registration), 또는 이동 성 관리(mobility management) 중 적어도 하나와 관련된 메시지를 포함할 수 있다. 사용자 데이터는 예를 들어, 전자 장치와 코어 네트워크(예를 들어, EPC)간에 송수신되는 제어 메시지를 제외한 사용자 데이 터를 의미할 수 있다. 도 2a를 참조하면, 일 실시예에 따른 전자 장치는 레거시(legacy) 네트워크의 적어도 일부(예: 도 2c의 LTE 기지국, EPC)를 이용하여 5G 네트워크의 적어도 일부(예: 도 2c의 NR 기지국, 5GC)와 제어 메시지 또는 사용자 데이터 중 적어도 하나를 송수신할 수 있다. 다양한 실시예에 따르면, 네트워크 환경(200A)은 LTE 기지국 및 NR 기지국으로의 무선 통신 듀얼 커 넥티비티(multi-RAT(radio access technology) dual connectivity, MR-DC)를 제공하고, EPC 또는 5GC 중 하나의 코어 네트워크를 통해 전자 장치와 제어 메시지를 송수신하는 네트워크 환경을 포함할 수 있다. 다양한 실시예에 따르면, MR-DC 환경에서, LTE 기지국 또는 NR 기지국 중 하나의 기지국은 MN(master node)으로 작동하고 다른 하나는 SN(secondary node)로 동작할 수 있다. MN은 코어 네트워크 에 연결되어 제어 메시지를 송수신할 수 있다. MN과 SN은 네트워크 인터페이스를 통해 연결되어 무선 자원(예를 들어, 통신 채널) 관리와 관련된 메시지를 수신할 수 있다. 다양한 실시예에 따르면, MN은 LTE 기지국, SN은 NR 기지국, 코어 네트워크는 EPC로 구성될 수 있다. 예를 들어, LTE 기지국 및 EPC를 통해 제어 메시지가 송수신될 수 있고, LTE 기지국과 NR 기지국을 통해 사용자 데이터가 송수신될 수 있다. 도 2b를 참조하면, 다양한 실시예에 따르면, 5GC는 NR 기지국을 통해 제어 메시지 및 사용자 데이터 를 전자 장치와 독립적으로 송수신할 수 있다. 도 2c를 참조하면, 다양한 실시예에 따른 레거시 네트워크 및 5G 네트워크는 각각 독립적으로 데이터 송수신을 제공할 수 있다. 예를 들어, 전자 장치와 EPC는 LTE 기지국을 통해 제어 메시지 및 사용자 데이 터를 송수신할 수 있다. 또 다른 예를 들어, 전자 장치와 5GC는 NR 기지국을 통해 제어 메시지및 사용자 데이터를 송수신할 수 있다. 다양한 실시예에 따르면, 전자 장치는 EPC 또는 5GC 중 적어도 하나에 등록(registration)되어 제어 메시지를 송수신할 수 있다. 다양한 실시예에 따르면, EPC 또는 5GC는 연동(interworking)하여 전자 장치의 통신을 관리할 수도 있다. 예를 들어, 전자 장치의 이동 정보가 EPC 및 5GC간의 인터페이스를 통해 송수신될 수 있다."}
{"patent_id": "10-2022-0034531", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 2, "content": "도 3a와 도 3b는 복수의 네트워크가 자원을 정적으로 공유하는 예를 나타낸 도면이다. 도 3a와 도 3b를 참조하면, 주파수 자원을 공유하는 복수의 네트워크는 LTE(long term evolution) 네트워크와 NR(new radio) 네트워크일 수 있다. 일 실시예에 따르면, 기지국은 도 3a와 같이 공유하는 주파수 대역 중 일부 주파수 대역을 LTE 네트워크를 이용하는 전자 장치에 할당할 수 있고, 나머지 주파수 대역을 NR 네트워크를 이용하는 전자 장치에 할당할 수 있다. 도 3a와 같이, 복수의 네트워크가 주파수를 나누어 공유하는 방식은 FDM(frequency division multiplexing) 방식일 수 있다. 기지국이 FDM 방식을 이용하여 주파수 자원을 할당하는 경우, LTE 네트워크를 이용하는 전자 장치와 NR 네트워크를 이용하는 전자 장치는 동시에 통신을 수행할 수 있다. FDM 방식의 경우, 각 네트워크가 이용할 수 있는 주파수 대역은 고정된 주파수 대역일 수 있다. 다른 실시예에 따르면, 기지국은 도 3b와 같이 시간을 나누어 LTE 네트워크를 이용하는 전자 장치와 NR 네트워 크를 이용하는 전자 장치에 주파수 자원을 할당할 수 있다. 도 3b와 같이, 복수의 통신 방식이 시간을 나누어 공유하는 방식은 TDM(time division multiplexing) 방식일 수 있다. 기지국은 일정 시간 동안 LTE 네트워크를 이용하는 전자 장치에 주파수 자원을 할당 후, 다시 일정 시간 동안 NR 네트워크를 이용하는 전자 장치에 주파수 자원을 할당할 수 있다. 일 실시예에 따르면, 도 3a와 도 3b에서 설명하는 FDM 방식과 TDM 방식은 분할하는 주파수 대역 또는 이용 시간 을 미리 정하고 이용하는 방식으로 정적(static) 자원 공유 방식일 수 있다. FDM 방식과 TDM 방식은 무선 자원 의 전송 효율이 높다는 장점이 있을 수 있으나, 사전에 결정된 대로 주파수 대역 또는 시간을 이용해야 한다는 단점이 있을 수 있다. 도 3a와 도 3b에서는 복수의 네트워크로 LTE와 NR을 예로 설명하나, 다른 네트워크에도 적용될 수 있다. 예를 들어, eMBMS(evolved Multimedia Broadcast Multicast Service), NB-IoT, 또는 RB blanking을 통한 2G + LTE 에도 본 개시에서 설명하는 다양한 실시예가 적용될 수 있다. 이하에서는 복수의 네트워크로 LTE와 NR을 예로 설명하나, 복수의 네트워크가 이용하는 주파수 대역의 적어도 일부를 공유한다면 본 개시에서 설명하는 다양한 실시예가 적용될 수 있을 것이다. 도 4는 FDM 방식과 TDM 방식을 결합하여 자원을 공유한 예를 나타낸 도면이다. 일 실시예에 따르면, 기지국은 FDM 방식과 TDM 방식의 단점을 보완하고자 시간에 따라 복수의 네트워크 각각이 요구하는 주파수 자원 요구량을 반영하여 주파수 자원을 분배할 수 있다. 기지국은 일정 시간 단위로 각 네트워 크가 요구하는 주파수 자원 요구량에 기초해 주파수 자원을 할당할 수 있다. 예를 들어, 기지국은 t1 시점에 LTE 네트워크를 이용하는 전자 장치와 NR 네트워크를 이용하는 전자 장치 가 요구하는 주파수 자원 요구량을 확인해 각 네트워크에 자원을 할당할 수 있다. 이후, 기지국은 t2 시점(42 0)에 LTE 네트워크를 이용하는 전자 장치와 NR 네트워크를 이용하는 전자 장치가 요구하는 주파수 자원 요구량 을 다시 확인해 각 네트워크에 자원을 할당할 수 있다. 일 실시예에 따르면, 기지국은 시간을 나누어 주파수 자원을 네트워크에 할당하거나 주파수를 나누어 네트워크 에 할당할 수 있다. 기지국은 자원을 할당하는 시점에 FDM 방식을 이용할지, TDM 방식을 이용할지, 또는 두 방 식을 모두 이용할지 결정할 수 있다. 이와 같은 방식은 반정적(semi-static) 자원 공유 방식 또는 동적 공유 (dynamic sharing) 방식으로 불릴 수 있다.도 5는 본 개시의 다양한 실시예에 따라 복수의 네트워크를 통합하여 자원을 공유하는 예를 나타낸 도면이다. 일 실시예에 따르면, 기지국은 자원 할당 관점에서 복수의 네트워크를 통합하여 관리할 수 있다. 기지국은 일정 시간 단위로 네트워크의 종류와 관계없이 자원을 할당해야 할 베어러를 통합하여 자원을 할당할 수 있다. 일정 시간은 예를 들어, TTI(transmit time interval)일 수 있다. 일 실시예에 따르면, 기지국은 네트워크의 종류와 관계없이 통합된 베어러에 자원을 할당하기 위한 기준(또는 정책)이 필요할 수 있다. 예를 들어, 베어러에 자원을 할당하기 위한 기준은 베어러의 우선 순위, 자원 이용의 효율성, 서비스간 공평도 중 적어도 일부가 될 수 있다. 일 실시예에 따르면, 기지국은 베어러에 자원을 할당하기 위한 기준을 정하고 베어러에 자원을 할당할 수 있다. 예를 들어, 기지국은 베어러에 자원을 할당하기 위한 기준으로 우선 순위를 정해 매 TTI 단위로 베어러의 우선 순위를 정렬하고, 정렬된 우선 순위를 고려해 베어러에 자원을 할당할 수 있다. 도 4에서는 자원이 각 네트워크에 의해 제공되어야 할 베어러(예: 베어러의 우선 순위)와 관계없이 네트워크만 을 고려하여 할당되는 반면, 도 5에서는 네트워크에 관계없이 베어러를 통합하고, 베어러에 자원을 할당하기 위 한 기준에 따라 자원이 할당될 수 있다. 도 5와 같은 방식은 주파수 자원을 즉각적으로 스케쥴링하여 인스턴트 (instant) 공유 방식으로 불릴 수 있다. 본 개시는 도 5에서 설명하는 인스턴트(instant) 공유 방식에 관한 것으로, 도 7과 도 8에서는 이러한 인스턴트 공유 방식에 대해 구체적으로 설명될 것이다. 도 6은 FDM 방식으로 우선 순위에 기초해 자원을 할당한 예를 나타낸 것이다. 일 실시예에 따르면, 전자 장치는 FDM 방식에 의해 LTE 네트워크를 이용하는 베어러와 NR 네트워크를 이용 하는 베어러에 자원을 분배할 수 있다. 도 6을 참조하면, 시간 영역에서 제1 구간은 LTE 네트워크를 이용 하는 베어러(예: LTE PDCCH)에 자원이 할당되는 구간을 의미할 수 있다. 제2 구간은 LTE 네트워크를 이용 하는 베어러와 NR 네트워크를 이용하는 베어러에 자원이 분배되는 구간을 의미할 수 있다. 제2 구간에서는 LTE 네트워크를 이용하는 베어러와 NR 네트워크를 이용하는 베어러의 경쟁에 의해 주파수 영역의 제1 영역(63 0)은 LTE 네트워크를 이용하는 베어러에 할당된 것을 나타낸 것이고, 제2 영역은 NR 네트워크를 이용하는 베어러에 할당된 것을 나타낸 것일 수 있다. 제2 영역은 NR 네트워크를 이용하는 베어러에 할당되었기 때 문에 기지국은 제2 영역에 LTE 네트워크를 이용하는 베어러를 할당할 수 없다. 제2 영역은 NR PDCCH 영역 또는 NR PDSCH 영역만 될 수 있어 기지국이 NR 네트워크를 이용하는 베어러 중 할당할 베어러가 없는 경우 제2 영역 중 일부는 사용하지 않는 자원이 될 수 있어 자원의 이용성 측면에서 효율이 좋지 않을 수 있다. 일 실시예에 따르면, 기지국이 LTE 네트워크를 이용하는 베어러와 NR 네트워크를 이용하는 베어러를 통합하여 TDM 방식으로 자원을 할당하는 경우, 상대적으로 우선 순위가 낮은 베어러는 자원이 늦게 할당될 수 있어 지연 (latency) 관점에서 QoS 만족도가 낮을 수 있다. 일 실시예에 따르면, 자원이 TDM 방식으로 할당되는 경우 FDM 방식과 비교하여 자원의 효율성은 높게 유지될 수 있으나, 자원의 유연한 할당 및 지연(latency) 관점에서 불리할 수 있다. 여기서 자원의 지연(latency) 이란 자 원이 할당되는데 소요되는 시간이 늦어지는 상황을 의미할 수 있다. 이러한 이유로 완전한 RB(resource block) 단위의 유연한(flexible) 자원 할당보다는 RBG(resource block group) 단위의 양자화된 주파수 할당이 자원의 효율성이 높을 수 있다. 도 7과 도 8에서는 도 6에서 설명한 문제점을 보완하기 위한 다양한 실시예가 구체적으로 설명될 수 있다. 도 7은 본 개시의 일 실시예에 따른 네트워크 장치의 블록도이다. 일 실시예에 따르면, 네트워크 장치는 기지국을 의미할 수 있다. 도 7을 참조하면, 네트워크 장치는 Instant sharing coordinator(이하 'ISC')와 통합 스케줄러(unified scheduler)를 포함할 수 있다. 도 7에서는 ISC와 통합 스케줄러를 나누어 설명하나 이는 설명의 편의를 위한 것으로 하나의 구성이 ISC와 통합 스케줄러의 동작/기능을 수행하거나 복수의 구성이 ISC와 통합 스케줄러의 동 작/기능을 나누어 수행할 수 있다.일 실시예에 따르면, ISC는 복수의 시스템들 간 공평도를 계산하여 매 TTI에 특정 무선 통신 시스템(예: LTE, NR)이 우선권을 갖고 시스템을 활용하도록 제어할 수 있다. 네트워크 장치는 이러한 방법을 이용하여 통합 스케쥴링만 수행하는 경우 발생할 수 있는 자원 분배의 비효율성을 감소시킬 수 있다. 네트워크 장치는 예를 들어, 하나의 TTI(transmit time interval)에 LTE와 NR자원을 모두 할당해야 하는 혼잡(busy)상황을 인식할 수 있다. 네트워크 장치는 이러한 혼잡 상황에서 ISC를 이용하지 않고, 무 선 통신 기술에 대한 고려 없이 우선순위가 높은 서비스를 우선적으로 스케줄링할 수도 있다. 이러한 스케줄링 방법은 통합 스케줄링 방법으로 지칭될 수 있다. 그러나 통합 스케줄링 방법은 서비스의 QoS(quality of service)관점에서 우선 순위를 제공하는데 적합할 수 있으나, 무선 주파수의 이용 측면에서 비효율적일 수 있다. 예를 들어, 네트워크 장치는 하나의 TTI(transmit time interval)에 LTE 및 NR 자원을 동시에 할당 하는 경우, 적어도 일부 공간(예: 도 6의 640)에서 공간 활용이 비효율적일 수 있다. 일 실시예에 따르면, 네트워크 장치는 하나의 TTI(transmit time interval)에 복수의 자원(예: LTE 및 NR)을 할당하는 FDM(frequency division multiplexing) 구조를 이용할 수 있으나, FDM(frequency division multiplexing) 구조는 무선 주파수의 이용 측면에서 비효율적일 수 있다. 반면, 네트워크 장치는 하나의 TTI(transmit time interval)에 하나의 자원을 할당하는 TDM(time division multiplexing) 구조를 이용할 수 있으며, TDM(time division multiplexing) 구조는 무선 주파수의 이용 측면에서 효율적일 수 있다. 또한, 네트 워크 장치는 하나의 RB(resource block)단위로 자원을 할당하는 것보다 RBG(resource block group) 처럼 양자화(quantized)된 그룹 단위로 자원을 할당하는 경우 주파수 활용 효율을 높일 수 있다. 일 실시예에 따르면, ISC는 도 5에서 설명한 인스턴트 공유 방식의 정책(policy)을 결정할 수 있다. 인스 턴트 공유 방식의 정책은 복수의 네트워크에 주파수 자원을 할당(또는 스케쥴링)하기 위한 기준을 의미할 수 있 다. 일 실시예에 따르면, ISC는 자원을 할당하기 위해 복수의 네트워크의 베어러(또는 서비스)를 확인할 수 있 다. ISC는 일정 시간 단위(예: TTI)로 자원을 동적으로 할당하기 위한 베어러를 확인할 수 있다. ISC(71 0)는 확인된 베어러에 기초해 요구되는 RB 수 및/또는 CCE(control channel elements) 수를 더 확인할 수 있다. RB 수 및/또는 CCE 수는 PDSCH 및/또는 PDCCH가 필요할 것으로 예상되는 수일 수 있다. ISC는 자원 을 할당하기 위한 각 베어러의 우선 순위, 주파수 자원의 효율, 각 베어러 간의 공평도 중 적어도 일부를 고려 하여 인스턴트 공유 방식의 정책을 결정할 수 있다. 일 실시예에 따르면, ISC가 자원을 할당할 베어러에는 LTE 네트워크를 이용하는 베어러와 NR 네트워크를 이용하는 베어러 중 하나의 베어러가 포함될 수도 있지만, LTE 네트워크를 이용하는 베어러와 NR 네트워크를 이 용하는 베어러가 모두 포함될 수도 있다. ISC는 복수의 네트워크를 모두 지원해야 하는 상황을 혼잡(busy) 상황으로 인식할 수 있다. ISC가 혼잡 상황에서 자원을 할당하기 위해 베어러의 우선 순위만을 고려하는 경우, 하나의 네트워크를 이용하는 베어러에만 자원이 할당될 수 있다. 이 경우, 서비스의 QoS(quality of service) 관점에서는 우선 순위가 높은 서비스를 지원해 서비스에 대한 만족도가 높을 수 있으나 무선 주파수 사용의 효율성이 떨어질 수 있다. 일 실시예에 따르면, ISC는 복수의 네트워크가 이전에 주파수 자원을 점유한 공평도를 인스턴트 공유 방식 의 정책을 결정해 자원을 동적으로 베어러에 할당할 수 있다. ISC는 계산한 공평도에 기초해 다음 단위 시 간(예: TTI)에 주파수 자원을 우선 점유할 네트워크를 선택할 수 있다. ISC는 매 단위 시간에 대해 주파수 자원을 점유할 네트워크를 선택할 수 있다. ISC가 주파수 자원을 점유할 네트워크를 선택하기 위한 단위 시간은 여러 조건에 따라 달라질 수 있다. 예를 들어, ISC는 연결된 베어러가 모두 같은 네트워크를 이용 한다면 다른 네트워크를 이용하는 베어러가 접속되기 전까지 단위 시간을 늘릴 수 있다. 일 실시예에 따르면, ISC는 이전에 자원이 할당된 네트워크의 히스토리에 기초해 다음 단위 시간에 주파수 자원을 우선 점유할 네트워크를 선택할 수 있다. 이전에 자원이 할당된 네트워크의 히스토리는 예를 들어, 복수 의 네트워크 각각에 할당된 RB(resource block) 수, 단말 수, 베어러 수, 또는 각각의 누적값이거나, 이들의 조 합일 수 있다. 누적값은 윈도우를 단순히 옮겨 계산한 평균값, 절대 시간 윈도우를 이용해 계산한 평균값, IIR(infinite impulse response) 필터를 이용해 계산한 평균값 중 하나일 수 있으나 다른 방법을 이용하여 계산 한 누적값을 제한하지 않을 수 있다. 일 실시예에 따르면, ISC는 복수의 네트워크 간 분배 비율을 더 고려해 다음 단위 시간에 주파수 자원을 우선 점유할 네트워크를 선택할 수 있다. 예를 들어, ISC는 이전에 자원이 할당된 네트워크의 히스토리와복수의 네트워크 간 목적 분배 비율의 차이를 최소화하도록 다음 단위 시간에 주파수 자원을 우선 점유할 네트 워크를 선택할 수 있다. 일 실시예에 따르면, 복수의 네트워크 간 목적 분배 비율은 단위 시간에서 각 네트워크에 연결된 단말 수, 베어 러 수, 버퍼의 크기(buffer occupancy) 중 어느 하나의 비율이거나, 이들의 조합에 기초해 결정된 비율일 수 있 다. 다른 실시예에 따르면, 복수의 네트워크 간 목적 분배 비율은 임의로 설정된 값일 수 있다. 예를 들어, ISC는 이전에 자원이 할당된 네트워크의 히스토리를 RB의 수로 결정하고, 누적값을 정해진 윈 도우 내에서 계산한 값으로 결정하여, 매 단위 시간마다 할당한 자원 및 그에 따른 스케쥴링 결과에 기초해 각 네트워크에 할당한 RB의 수를 누적하여 계산할 수 있다. ISC는 각 네트워크에 할당된 누적된 RB의 수를 복 수의 네트워크 간 목적 분배 비율과 비교하여 그 차이가 작아지도록 다음 단위 시간에 주파수 자원을 우선 점유 할 네트워크를 선택할 수 있다. 목적 분배 비율은 각 네트워크에 연결된 단말 수의 비율일 수 있다. 아래의 <표 1>은 다음 단위 시간에 주파수 자원을 우선 점유할 네트워크를 선택한 예를 나타낸 것이다. 예를 들어, ISC가 slot 2의 주파수 자원을 우선 점유할 네트워크를 결정하는 경우, 히스토리로 각 네트워크에 누적된 RB 수를 살펴보면, LTE 누적 RB 수는 110인 반면, NR 누적 RB 수는 10으로 목적 분배 비율인 5:5와 비교하여 NR 누적 RB 수가 LTE 누적 RB 수에 비해 부족함을 판단하고 다음 단위 시간에 주파수 자원을 우선 점유할 네트워크 로 NR을 선택할 수 있다. ISC는 LTE 누적 RB 수와 NR 누적 RB 수를 비교해 다음 단위 시간에 주파수 자원 을 우선 점유할 네트워크를 선택할 수 있다. ISC는 선택한 네트워크를 고려해 RB를 할당할 수 있다. 표 1 Busy Slot 0 1 2 3 4 LTE/NR UE 비율 5:5 5:5 5:5 5:5 5:5 LTE 목적 비율 50% 50% 50% 50% 50% 총 RB 수 20 120 220 320 420 LTE 누적 RB 수 10 110 110 210 210 NR 누적 RB 수 10 10 110 110 210 LTE RB 비율 50% 92% 50% 66% 50% LTE로 할당된 RB 수 100 0 100 0 100 NR로 할당된 RB 수 0 100 0 100 0 다음 단위 시간에 주파수 자원을 우선 점유 할 네트워크LTE NR LTE NR LTE 일 실시예에 따르면, ISC는 각 네트워크에 서비스할 버퍼가 있는 경우에 한해 다음 단위 시간에 주파수 자 원을 우선 점유할 네트워크를 선택할 수 있다. ISC는 혼잡 상황임을 인식하고, TDM 방식으로 각 단위 시간 에 주파수 자원을 점유할 네트워크를 선택할 수 있다.이상에서는 ISC가 단위 시간 별로 하나의 네트워크를 선택하는 예에 대해 설명하였지만, ISC는 네트워크의 종류보다 베어러의 우선 순위에 가중치를 두어 자원 을 할당할 수도 있다. 예를 들어, 우선 순위가 임계값보다 높은 베어러(예: 브로드캐스팅 정보와 연관된 베어러)는 선택된 네트워크에 의해 지원되지 않더라도 ISC는 자원을 할당할 수 있다. 일 실시예에 따르면, ISC는 선택한 네트워크를 통합 스케줄러로 전달할 수 있다. ISC는 할당된 자원에 대한 정보(예: RB 수)를 통합 스케줄러로 더 전달할 수 있다. 일 실시예에 따르면, 네트워크 장치는 통합 스케줄러를 이용하여 서로 다른 무선 통신 기술(예: LTE, NR)에 대해 동일한 하나의 절차로 스케줄링을 수행할 수 있다. 네트워크 장치는 일정한 기준에 기초하여 스케줄링의 대상이 되는 베어러를 선정할 수 있다. 여기서 베어러를 선정하는 기준은 예를 들어, 자원 배분의 우선 순위에 대한 가중치를 포함할 수 있다. 이 경우 네트워크 장치는 베어러의 구조적인 제약을 무시하고, 자원 배분의 우선 순위에 대한 가중치에 기초하여 스케줄링의 대상이 되는 베어러를 선정할 수 있다. 일 실시예에 따르면, 네트워크 장치는 각각의 베어러들의 종류, 각각의 데이터 비트들의 종류, 각각의 베 어러들의 우선순위 또는 각각의 데이터 비트들의 우선순위 중 적어도 어느 하나에 기초하여 LTE 및 NR을 포함하 는 자원들 각각의 스케줄링 우선 순위를 결정할 수 있다. 네트워크 장치는 스케줄링 우선 순위의 결정 과 정에서 우선순위의 경쟁이 발생하는 경우 파라미터를 설정하거나 또는 공정성 계산자(fairness metric)의 통합 을 이용하여 우선순위를 결정할 수 있다.일 실시예에 따르면, 네트워크 장치는 파라미터를 설정하여 LTE 및 NR의 복수의 베어러들 중 어떤 베어러 를 우선하여 선정할 지 결정할 수 있다. 또한, 네트워크 장치는 공정성 계산자(fairness metric)를 이용하 여 스케줄러(scheduler) 내 에서 베어러의 우선 순위를 결정할 수 있다. 네트워크 장치는 시간 또는 처리 한 데이터 양 중 적어도 어느 하나에 기반하여 현 시점에서 어느 베어러를 선정할 것인지 결정할 수 있다. 일 실시예에 따르면, 네트워크 장치는 통합 베어러 선정 과정을 거쳐 스케줄링의 대상이 되는 베어러를 선 정할 수 있다. 네트워크 장치는 ISC를 이용하여 통합 베어러 선정 과정을 통해 선정된 복수의 베어러 들에 대응하여 각각의 베어러들을 스케줄링 하는 데 필요한 PDSCH(physical downlink shared channel)의 RB(resource block)의 수 및 PDCCH(physical downlink control channel)의 CCE(control channel elements)의 수를 계산할 수 있다. 네트워크 장치는 이러한 계산에 기초하여 LTE 및 NR을 포함하는 자원을 할당할 수 있다. 일 실시예에 따르면, 네트워크 장치는 서로 다른 무선 통신 기술(예: LTE, NR)을 동일한 수준에서 제어할 수 있다. 네트워크 장치는 통합 스케줄러를 이용하여 자원 배분에 대해 차등을 두지 않도록 제어할 수 있다. 자원 배분에 대해 차등을 두지 않는 방법은 '통합 자원 할당 방법'으로 지칭될 수 있다. 예를 들어, 네트워크 장치는 통합 스케줄러를 이용하여 순서대로 PDSCH(physical downlink shared channel)자원 과 PDCCH(physical downlink control channel)자원을 할당하고, 해당 TTI의 LTE 또는 NR의 스케줄링이 종료될 때까지 하나의 주체(예: 네트워크 장치 내 통합 자원 할당 소프트웨어(미도시))가 LTE 및 NR의 자원을 모 두 할당하도록 제어할 수 있다. 일 실시예에 따르면, 통합 스케줄러는 네트워크 별로 분리된 스케줄러를 포함할 수 있다. 예를 들어, 통합 스케줄러는 LTE 스케줄러와 NR 스케줄러를 포함할 수 있다. 통합 스케줄러는 ISC로부터 베어러 들을 스케줄링하는데 필요한 정보를 수신할 수 있으며, 각 네트워크가 베어러들을 스케줄링하도록 제어할 수 있 다. 통합 스케줄러는 ISC로부터 DL PDSCH RB 수 또는 DL/UL 스케쥴링에 필요한 PDCCH CCE의 수에 대 한 정보 중 적어도 어느 하나를 수신할 수 있다. 일 실시예에 따르면, 네트워크 장치는 통합 자원 할당 방법을 이용하여 NR PDCCH 자원과 NR PDSCH 자원이 서로 경쟁하도록 제어할 수 있다. 예를 들어, 통합 스케줄러는 LTE PDSCH자원을 할당할 때 NR PDCCH 영역 과 NR PDSCH 자원이 모두 할당되지 않은 RB 영역에 대해서만 새롭게 자원을 할당하는 형태로 통합 자원 할당 동 작을 수행할 수 있다. 이 때 NR PDCCH영역은 NR PDSCH를 위한 CCE 자원 뿐 아니라 NR PUSCH(physical uplink shared channel)을 위한 자원을 포함할 수 있다. 또한, 통합 스케줄러는 파라미터를 이용하여 복수의 자원 들에 대해 가중치를 부여하고, NR PDSCH를 위한 CCE 자원 및 NR PUSCH(physical uplink shared channel)을 위 한 자원을 포함하는 복수의 자원들간의 경쟁을 제어할 수 있다. 통합 스케줄러는 특정 파라미터 (예: 설정 변경이 가능한(configurable) 파라미터)를 이용하여 특정 RAT(LTE/NR)에 대한 최소한의 자원 양 설정 또는 자원 분배 순서에 있어서 우선 순위의 가중치(weight) 설정(예: 특정 서비스에 대한 제공 순서를 강제로 결정)이 가 능하도록 제어할 수 있다. 일 실시예에 따르면, 네트워크 장치는 통합 베어러 선정 방법 및 통합 자원 할당 방법을 이용하여 네트워 크 자원을 할당하고, PDU(protocol data unit) 생성과정에서 복수의 무선 통신 기술들(예: LTE, NR)의 동작을 그대로 활용할 수 있다. 예를 들어, 네트워크 장치는 통합 베어러 선정 방법을 이용하여 적어도 하나의 베 어러를 선정하고, ISC를 이용하여 각각의 베어러들을 스케줄링하기 위해 필요한 PDSCH RB 및/또는 PDCCH CCE 수를 계산할 수 있다. 네트워크 장치는 계산된 PDSCH RB 및/또는 PDCCH CCE 수에 기초하여 자원 할당 동작을 제어할 수 있다. 일 실시예에 따르면, 통합 스케줄러는 ISC로부터 선택된 네트워크에 대한 정보 및 자원이 분할된 형 태에 대한 정보를 수신할 수 있다. 통합 스케줄러는 수신된 선택된 네트워크에 대한 정보 및 자원이 분할 된 형태에 대한 정보에 기초해 각 네트워크에 할당된 베어러들을 스케쥴링 할 수 있다. 일 실시예에 따르면, 네트워크 장치는 자원을 할당할 베어러의 종류 및/또는 우선 순위에 기초해 네트워크 의 스케쥴링 우선 순위를 결정할 수 있다. 네트워크의 스케쥴링에 우선 순위 경쟁이 발생하는 경우 네트워크 장 치는 파라미터 설정 또는/및 공정성 계산자(fairness metric)에 기초해 네트워크의 스케쥴링 우선 순위를 결정할 수 있다.도 8은 본 개시의 일 실시예에 따른 네트워크 장치의 순서도이다. 일 실시예에 따르면, 네트워크 장치(예: 도 7의 네트워크 장치)는, 동작 810에서, 복수의 네트워크 중 적 어도 하나를 이용하고, 복수의 네트워크가 공유하는 주파수 자원을 할당해야 하는 베어러를 확인할 수 있다. 일 실시예에 따르면, 네트워크 장치는 통합 스케줄러(예: 도 7의 통합 스케줄러)를 이용하여 서로 다 른 무선 통신 기술(예: LTE, NR)에 대해 동일한 하나의 절차로 스케줄링을 수행할 수 있다. 네트워크 장치(70 0)는 일정한 기준에 기초하여 스케줄링의 대상이 되는 베어러를 선정할 수 있다. 여기서 베어러를 선정하는 기 준은 예를 들어, 자원 배분의 우선 순위에 대한 가중치를 포함할 수 있다. 이 경우 네트워크 장치는 베어 러의 구조적인 제약을 무시하고, 자원 배분의 우선 순위에 대한 가중치에 기초하여 스케줄링의 대상이 되는 베 어러를 선정할 수 있다. 네트워크 장치는 베어러를 확인해 베어러를 스케쥴링하는데 필요한 자원을 계산할 수 있다. 일 실시예에 따르면, 네트워크 장치는, 동작 820에서, 확인된 베어러에 기초해 복수의 네트워크 중 다음 단위 시간에 주파수 자원을 할당할 네트워크를 결정할 수 있다. 다음 단위 시간에 주파수 자원을 할당할 네트워 크는 다음 단위 시간 이전에 자원이 할당된 네트워크의 히스토리에 기초해 결정될 수 있다. 다음 단위 시간 이 전에 자원이 할당된 네트워크의 히스토리는 복수의 네트워크 각각에 할당된 RB(resource block)의 수, 복수의 네트워크 각각에 연결된 단말 수, 복수의 네트워크 각각에 연결된 베어러 수, 및 이들의 누적값 중 적어도 일부 를 포함할 수 있다. 일 실시예에 따르면, 네트워크 장치는 통합 베어러 선정 방법 및 통합 자원 할당 방법을 이용하여 네트워 크 자원을 할당하고, PDU(protocol data unit) 생성과정에서 복수의 무선 통신 기술들(예: LTE, NR)의 동작을 그대로 활용할 수 있다. 예를 들어, 네트워크 장치는 통합 베어러 선정 방법을 이용하여 적어도 하나의 베 어러를 선정하고, ISC(예: 도 7의 ISC)를 이용하여 각각의 베어러들을 스케줄링하기 위해 필요한 PDSCH RB 및/또는 PDCCH CCE 수를 계산할 수 있다. 네트워크 장치는 계산된 PDSCH RB 및/또는 PDCCH CCE 수에 기초 하여 자원 할당 동작을 제어할 수 있다. 일 실시예에 따르면, 네트워크 장치는 복수의 네트워크 간 분배 비율을 더 고려하여 다음 단위 시간에 주 파수 자원을 할당할 네트워크를 결정할 수 있다. 복수의 네트워크 간 분배 비율은 단위 시간에 복수의 네트워크 각각에 연결된 단말 수, 베어러 수, 버퍼 크기 중 적어도 일부에 기초한 복수의 네트워크 간 비율일 수 있다. 일 실시예에 따르면, 통합 스케줄러는 ISC로부터 선택된 네트워크에 대한 정보 및 자원이 분할된 형 태에 대한 정보를 수신할 수 있다. 통합 스케줄러는 수신된 선택된 네트워크에 대한 정보 및 자원이 분할 된 형태에 대한 정보에 기초해 각 네트워크에 할당된 베어러들을 스케쥴링 할 수 있다. 일 실시예에 따르면, 네 트워크 장치는 확인된 베어러에 기초해 복수의 네트워크 중 다음 단위 시간에 주파수 자원을 할당할 네트 워크 별 할당할 자원의 비율을 결정할 수 있다. 예를 들어, 네트워크 장치는 다음 단위 시간에 주파수 자 원을 할당할 네트워크를 결정하고, 네트워크 별 자원 할당 비율을 결정할 수 있다. 일 실시예에 따르면, 네트워크 장치는, 동작 830에서, 결정된 네트워크에 기초해 확인된 베어러 중 적어도 일부의 베어러에 주파수 자원 중 적어도 일부를 할당할 수 있다. 네트워크 장치는 결정된 네트워크에 기초 해 확인된 베어러 중 우선 순위에 기초해 주파수 자원을 할당할 수 있다. 네트워크 장치는 우선 순위가 동 일한 베어러에 대해서는 설정된 파라미터, 공정성 계산자, 또는 이들의 통합에 기초해 주파수 자원을 할당할 수 있다. 일 실시예에 따르면, 네트워크 장치는 자원을 할당할 베어러의 종류 및/또는 우선 순위에 기초해 네트워크 의 스케쥴링 우선 순위를 결정할 수 있다. 네트워크의 스케쥴링에 우선 순위 경쟁이 발생하는 경우 네트워크 장 치는 파라미터 설정 또는/및 공정성 계산자(fairness metric)에 기초해 네트워크의 스케쥴링 우선 순위를 결정할 수 있다. 일 실시예에 따르면, 네트워크 장치는, 결정된 네트워크에 의해 지원되지 않는 베어러 중 우선 순위가 임 계값보다 높은 베어러에 대해 주파수 자원 중 적어도 일부를 할당할 수 있다. 일 실시예에 따르면, 복수의 네트워크는 LTE 네트워크와 NR 네트워크를 포함할 수 있다. 다양한 실시예들에 따르면, 네트워크 장치의 동작 방법은 복수의 네트워크 중 적어도 하나를 이용하고, 복수의 네트워크가 공유하는 주파수 자원을 할당해야 하는 베어러를 확인하는 동작, 확인된 베어러에 기초해 복수의 네트워크 중 다음 단위 시간에 주파수 자원을 할당할 네트워크를 결정하는 동작 및 결정된 네트워크에 기초해 확 인된 베어러 중 적어도 일부의 베어러에 주파수 자원 중 적어도 일부를 할당하는 동작을 포함할 수 있다. 일 실시예에 따르면, 네트워크를 결정하는 동작은, 다음 단위 시간 이전에 자원이 할당된 네트워크의 히스토리 와 복수의 네트워크 간 분배 비율을 고려하여 네트워크를 결정하는 동작을 더 포함할 수 있다. 일 실시예에 따르면, 다음 단위 시간 이전에 자원이 할당된 네트워크의 히스토리는 복수의 네트워크 각각에 할 당된 RB(resource block) 수, 단말 수, 베어러 수, 및 이들의 누적값 중 적어도 일부를 포함할 수 있다. 일 실시예에 따르면, 복수의 네트워크 간 분배 비율은 다음 단위 시간에 복수의 네트워크 각각에 연결된 단말 수, 베어러 수, 버퍼 크기 중 적어도 일부에 기초하여 결정될 수 있다. 일 실시예에 따르면, 네트워크 장치의 동작 방법은 결정된 네트워크에 의해 지원되지 않는 베어러 중 우선 순위 가 임계값보다 높은 베어러에 주파수 자원 중 적어도 일부를 할당하는 동작을 더 포함할 수 있다. 일 실시예에 따르면, 베어러를 확인하는 동작은, 베어러를 스케쥴링하는데 필요한 자원을 계산하는 동작을 포함 할 수 있다. 일 실시예에 따르면, 네트워크를 결정하는 동작은, 네트워크 별 할당할 자원의 비율을 결정하는 동작을 포함할 수 있다. 일 실시예에 따르면, 주파수 자원 중 적어도 일부를 할당하는 동작은, 확인된 베어러 중 우선 순위가 높은 베어 러에 주파수 자원 중 적어도 일부를 할당하는 동작을 포함할 수 있다. 일 실시예에 따르면, 주파수 자원 중 적어도 일부를 할당하는 동작은, 확인된 베어러 중 우선 순위가 동일한 베 어러는 미리 설정된 파라미터, 공정성 계산자, 또는 이들의 통합에 기초해 주파수 자원 중 적어도 일부를 할당 하는 동작을 더 포함할 수 있다. 일 실시예에 따르면, 복수의 네트워크는 LTE 네트워크와 NR 네트워크를 포함할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치)에 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2a 도면2b 도면2c 도면3a 도면3b 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2022-0034531", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a, 도 2b 및 2c는, 다양한 실시예들에 따른 레거시(Legacy) 통신 및/또는 5G 통신의 네트워크를 제공하는 무선 통신 시스템들을 도시하는 도면들이다. 도 3a와 도 3b는 복수의 네트워크가 자원을 정적으로 공유하는 예를 나타낸 도면이다. 도 4는 FDM 방식과 TDM 방식을 결합하여 자원을 공유한 예를 나타낸 도면이다. 도 5는 본 개시의 다양한 실시예에 따라 복수의 네트워크를 통합하여 자원을 공유하는 예를 나타낸 도면이다. 도 6은 FDM 방식으로 우선 순위에 기초해 자원을 할당한 예를 나타낸 것이다. 도 7은 본 개시의 일 실시예에 따른 네트워크 장치의 블록도이다. 도 8은 본 개시의 일 실시예에 따른 네트워크 장치의 순서도이다."}
