{"patent_id": "10-2015-0015076", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0094032", "출원번호": "10-2015-0015076", "발명의 명칭": "통합 메시지 어플리케이션 운용 방법 및 이를 지원하는 전자장치", "출원인": "삼성전자주식회사", "발명자": "설기환"}}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통합 메시지 어플리케이션을 운용하는 방법에 있어서,특정 대화상대를 설정하는 동작;상기 특정 대화상대에게 전송 가능한 메시지 형식을 분석하는 동작;상기 분석결과를 기반으로 전송 가능한 메시지 형식에 대응하는 적어도 하나의 탭을 생성하는 동작; 및상기 탭을 상기 특정 대화상대와의 대화방에 표시하는 동작;을 포함하는 것을 특징으로 하는, 통합 메시지 어플리케이션 운용방법."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 특정 대화상대를 설정하는 동작은,대화상대로부터 메시지를 수신한 경우, 상기 대화상대를 상기 특정 대화상대로 설정하고, 상기 통합 메시지 어플리케이션 실행 후 사용자에 의해 대화상대가 선택된 경우, 상기 선택된 대화상대를 상기특정 대화상대로 설정하는 것을 특징으로 하는, 통합 메시지 어플리케이션 운용방법."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 메시지 형식을 분석하는 동작은,상기 특정 대화상대와 통합 메시지 어플리케이션을 통해 메시지를 송수신한 이력을 분석하는 동작;상기 이력이 존재하는 경우 상기 특정 대화상대와 최근 사용한 메시지의 형식을 판단하는 동작;상기 특정 대화상대와의 대화방에 상기 전송 가능한 메시지 형식에 대응하는 적어도 하나의 탭을 표시하는동작;상기 표시된 적어도 하나의 탭 중 상기 최근 사용된 메시지 형식에 해당하는 탭을 활성화 표시하는 동작; 을 포함하는 것을 특징으로 하는, 통합 메시지 어플리케이션 운용방법."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,대화상대 별로 전송 가능한 메시지 형식에 대응하는 탭을 미리 생성하여 저장하는 동작을 더 포함하는 것을 특징으로 하는, 통합 메시지 어플리케이션 운용방법."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 탭을 활성화 표시하는 동작은,상기 탭에 대해, 하이라이트, 깜박임, 대조되는 색상, 모양 및 무늬 중 적어도 하나를 이용하여 표시하는 것을특징으로 하는, 통합 메시지 어플리케이션 운용방법."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 표시하는 동작은,메시지 표시영역의 송수신된 메시지에 메시지의 형식을 표현하기 위한 아이콘을 표시하는 동작을 포함하는 것을특징으로 하는, 통합 메시지 어플리케이션 운용방법.공개특허 10-2016-0094032-2-청구항 7 제6항에 있어서,상기 아이콘은 상기 특정 대화상대와 송수신한 메시지 형식에 대한 메시지 정보, 해당 메시지 형식을 전송하는사용자 정보를 포함하여 표시하고, 상기 메시지 정보 및 상기 사용자 정보는 적어도 하나의 텍스트, 이미지, 도형, 마크 및 심볼 중 적어도 하나에 기반하여 표시하는 것을 특징으로 하는, 통합 메시지 어플리케이션 운용방법."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서, 상기 이력을 분석하는 동작은,상기 이력이 존재하지 않는 경우, 상기 특정 대화상대에게 전송 가능한 메시지 형식을 분석하는 동작;상기 분석에 따라 상기 특정 대화상대에게 전송 가능한 메시지 형식을 설정하는 동작;상기 설정된 메시지 형식 중 어느 하나를 선택할 수 있는 탭을 생성하는 동작; 및상기 생성된 탭을 대화방에 표시하는 동작;을 더 포함하는 것을 특징으로 하는, 통합 메시지 어플리케이션 운용방법."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제3항에 있어서, 상기 이력을 분석하는 동작은, 문자 어플리케이션을 통해 상기 특정 대화상대와 송수신한 SMS/MMS 메시지 이력을 판단하는 동작;전자장치에 설치된 다른 인스턴트 메신저 어플리케이션을 통해 상기 특정 대화상대와 송수신한 IM 메시지 이력을 판단하는 동작;상기 전자장치에 상기 특정 대화상대의 전화번호가 저장되어 있는지 판단하는 동작; 및상기 인스턴트 메신저 어플리케이션에 상기 특정 대화상대가 등록되어 있는지 여부를 판단하는 동작; 중 적어도하나의 동작을 더 포함하는 것을 특징으로 하는, 통합 메시지 어플리케이션 운용방법."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 메시지 형식은,SMS, MMS, IM을 구분하는 메시지 전송 타입 및 인스턴트 메신저의 ID, 전자장치의 전화번호, SIM을 구분하는 메시지 전송 구분자 중 적어도 하나를 기반으로 상기 대화상대와 송수신할 수 있는 메시지 타입인 것을 특징으로하는, 통합 메시지 어플리케이션 운용방법."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "통합 메시지 어플리케이션을 실행시키고, 특정 대화상대에게 전송 가능한 메시지 형식을 분석하여, 상기 분석결과를 기반으로 상기 특정 대화상대에게 전송 가능한 메시지 형식에 대응하는 적어도 하나의 탭을 생성하는 제어부;상기 탭을 상기 특정 대화상대와의 대화방에 표시하는 표시부; 및사용자에 의해 선택된 상기 탭의 메시지 형식에 해당하는 통신방식으로 메시지를 전송하는 통신부;를 포함하는것을 특징으로 하는, 통합 메시지 어플리케이션을 지원하는 전자장치."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 제어부는,대화상대로부터 메시지를 수신한 경우 상기 대화상대를 상기 특정 대화상대로 설정하고, 상기 통합 메시지 어플리케이션 실행 후 사용자에 의해 대화상대가 선택된 경우 상기 선택된 대화상대를 상기 특정 대화상대로 설정하는 것을 특징으로 하는, 통합 메시지 어플리케이션을 지원하는 전자장치. 공개특허 10-2016-0094032-3-청구항 13 제11항에 있어서, 상기 제어부는,대상화대 별로 전송 가능한 메시지 형식에 대응하는 대응하는 탭을 생성하여 저장하는 것을 특징으로 하는, 통합 메시지 어플리케이션을 지원하는 전자장치."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 제어부는,상기 특정 대화상대와 상기 통합 메시지 어플리케이션을 통해 메시지를 송수신한 이력을 분석하고, 상기 이력이있는 경우 상기 특정 대화상대와 최근 사용한 메시지의 형식을 판단하고, 상기 메시지 형식에 대응하는 적어도하나의 탭을 표시하고, 상기 적어도 하나의 탭에서 상기 최근 사용된 메시지 형식에 해당하는 탭을 활성화 표시하는 것을 특징으로 하는, 통합 메시지 어플리케이션을 지원하는 전자장치."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 제어부는,상기 탭에 대해, 하이라이트, 깜박임, 대조되는 색상, 모양 및 무늬 중 적어도 하나를 이용하여 표시하는 것을특징으로 하는, 통합 메시지 어플리케이션을 지원하는 전자장치."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 제어부는,상기 메시지 형식을 표현하기 위한 아이콘을 표시하고,상기 아이콘은 상기 특정 대화상대와 송수신한 메시지 형식에 대한 메시지 정보, 해당 메시지 형식을 전송하는사용자 정보를 포함하고, 상기 메시지 정보 및 상기 사용자 정보는 적어도 하나의 텍스트, 이미지, 도형, 마크및 심볼 중 적어도 하나에 기반하여 표시되는 것을 특징으로 하는, 통합 메시지 어플리케이션을 지원하는 전자장치."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14항에 있어서, 상기 제어부는,상기 특정 대화상대와 상기 통합 메시지 어플리케이션을 통해 메시지를 송수신한 이력이 없는 경우 상기 특정대화상대에게 전송 가능한 메시지 형식을 분석하는 것을 특징으로 하는, 통합 메시지 어플리케이션을 지원하는전자장치."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 제어부는,문자 어플리케이션을 통해 상기 특정 대화상대와 송수신한 SMS/LMS/MMS 메시지 이력, 또는 상기 전자장치에 설치된 다른 인스턴트 메신저 어플리케이션을 통해 상기 특정 대화상대와 송수신한 IM 메시지 이력 중 적어도 일부에 기반하여 상기 이력을 분석하는 것을 특징으로 하는, 통합 메시지 어플리케이션을 지원하는 전자장치."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 제어부는,상기 특정 대화상대의 전화번호가 저장되어 있는지 여부, 또는 상기 인스턴트 메신저 어플리케이션에 상기 특정대화상대가 등록되어 있는지 여부 중 적어도 일부에 기반하여 상기 이력을 분석하는 것을 특징으로 하는, 통합메시지 어플리케이션을 지원하는 전자장치."}
{"patent_id": "10-2015-0015076", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서, 상기 메시지 형식은,공개특허 10-2016-0094032-4-SMS/LMS/MMS 및 IM 메시지를 구분하는 메시지 전송 타입 및 인스턴트 메신저 어플리케이션의 계정 ID, 전자장치의 전화번호, SIM을 구분하는 메시지 전송 구분자 중 적어도 하나를 기반으로 상기 대화상대와 송수신할 수 있는 메시지 타입인 것을 특징으로 하는, 통합 메시지 어플리케이션을 지원하는 전자장치."}
{"patent_id": "10-2015-0015076", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 전자 장치에서 통합 메시지 어플리케이션을 운용하여 다양한 메시지 형식 중 전송할 메시지의 형식을 하나의 실행화면에서 선택 또는 변경할 수 있는 방법 및 장치에 관한 것이다. 본 발명의 실시 예에 따르면, 통합 애플리케이션을 운용하는 방법은, 특정 대화상대를 설정하는 동작, 상기 특정 대화상대에게 전송 가능한 메시지 형식을 분석하는 동작, 상기 분석결과를 기반으로 전송 가능한 메시지 형식에 대응하는 적어 도 하나의 탭을 생성하는 동작, 및 상기 탭을 상기 특정 대화상대와의 대화방에 표시하는 동작을 포함한다."}
{"patent_id": "10-2015-0015076", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 전자 장치에서 통합 메시지 어플리케이션을 운용하여 다양한 메시지 형식 중 전송 할 메시지의 형식을 하나의 실행화면에서 선택 또는 변경할 수 있는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2015-0015076", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보통신 기술 및 반도체 기술의 발전으로 각종 전자 장치들이 다양한 멀티미디어 서비스를 제공하는 멀티미디 어 장치로 발전하고 있다. 예를 들어, 휴대용 전자 장치는 방송 서비스, 무선 인터넷 서비스, 카메라 서비스 및 음악 재생 서비스와 같은 다양한 멀티미디어 서비스를 제공할 수 있다. 일반적으로, 전자장치에서 실행되는 메시지 어플리케이션에서는 하나의 대화방에 하나의 작성창을 제공한다. 또 한, 사용자는 다양한 메시지 전송타입(SMS, MMS, IM) 또는 다양한 전송 구분자(ID, 전화번호, SIM)에 기반하여 메시지를 작성할 수 있다. 하지만, 메시지 어플리케이션에서는 각 전송 타입 별 또는 전송 구분자 별 작성창을 별도로 지원하지 않으므로, 사용자가 특정 메시지 전송타입 또는 특정 전송 구분자에 기반하여 메시지를 작성하 는 중에, 메시지 전송 타입을 변경하거나 전송 구분자를 변경하기 어렵다. 이는 메시지 전송 타입이 다르면, 전 송 포맷 및 프로토콜이 다르기 때문에 메시지 작성 중 변환이 어렵기 때문이다. 예를 들어, 텍스트 10000자를 지원하는 IM에서 MMS로 전송 타입을 변경하는 경우, MMS는 통상 최대 2000자(예시)를 지원하므로, 2000자 이상 의 텍스트에 대해서는 잘림 처리가 불가피하다. 또한, 종래의 메시지 어플리케이션에서는 메시지 작성창(message composer)이 각 대화방마다 하나씩 존재하므로, 서로 다른 전송 구분자에 대한 각 메시지마다 임시 저장(Draft message)이 어렵다. 일반적으로 드 래프트 메시지의 복구는 메시지 작성창에서 구현된다. 그러므로 한 개의 작성창에서는 전송 메시지 타입 별, 전 송 구분자 별로 각각 드래프트 메시지를 저장할 수 없다. 예를 들어, 멀티 SIM을 지원하는 전자장치의 경우, SIM 1에 대한 임시 저장 메시지와 SIM 2에 대한 임시 저장 메시지를 각각 구별하여 저장할 수 없다. 이는 대화 방에 하나의 작성창이 제공되기 때문에 발생되는 문제점이다."}
{"patent_id": "10-2015-0015076", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시 예는 복수의 메시지 전송 타입 또는 전송 구분자를 지원하고, 하나의 대화방에 각 전송 타입별 또는 전송 구분자별 작성 창을 각각 제공하여, 작성 중 전송 타입 변경, 전송 구분자 변경을 쉽게 가능하도록 하는 통합 메시지 어플리케이션 운용 방법 및 이를 지원하는 전자장치를 제공할 수 있다. 또한, 본 발명의 실시 예는 전저장치에서 메시지 임시 저장도 전송 타입별 또는 전송 구분자별로 각각 저장하고 복구하여, 여러 개의 드래프트 메시지를 저장하여 사용성을 높일 수 있는 통합 메시지 어플리케이션 운용 방법 및 이를 지원하는 전자장치를 제공할 수 있다."}
{"patent_id": "10-2015-0015076", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 전자 장치는 통합 메시지 어플리케이션을 실행시키고, 특정 대화상대에게 전송 가 능한 메시지 형식을 분석하여, 상기 분석결과를 기반으로 상기 특정 대화상대에게 전송 가능한 메시지 형식에 대응하는 적어도 하나의 탭을 생성하는 제어부, 상기 탭을 상기 특정 대화상대와의 대화방에 표시하는 표시부, 및 사용자에 의해 선택된 상기 탭의 메시지 형식에 해당하는 통신방식으로 메시지를 전송하는 통신부를 포함한 다. 본 발명의 실시 예에 따르면, 통합 메시지 어플리케이션의 운용방법은, 특정 대화상대를 설정하는 동작, 상기 특정 대화상대에게 전송 가능한 메시지 형식을 분석하는 동작, 상기 분석결과를 기반으로 전송 가능한 메시지 형식에 대응하는 적어도 하나의 탭을 생성하는 동작, 및 상기 탭을 상기 특정 대화상대와의 대화방에 표시하는동작을 포함한다."}
{"patent_id": "10-2015-0015076", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 통합 메시지 어플리케이션은 하나의 대화방에서 다양한 전송 타입(SMS/LMS/MMS, IM)과 전송 구분자 (ID, 전화번호, SIM) 중 하나를 선택하여 메시지를 발신할 수 있도록 한다. 이에 따라 사용자에게 발신 방법 선 택에 있어서 직관적인 UI를 제공하므로, 사용자가 간편하고 편리하게 원하는 메시지 형식으로 발신할 수 있다. 뿐만 아니라 본 발명의 통합 메시지 어플리케이션의 편리한 발신 방법에 의해 메시지 형식에 따른 과금 정책에 유리한 메시지를 빠르고 편리하게 보낼 수 있다. 예를 들어, 통합 메시지 어플리케이션을 이용한 메시지 발신에 있어서, SMS/LMS/MMS를 이용한 통신방식이 저렴한 상황이고, 멀티 SIM 단말에서 특정 SIM이 저렴한 상황일 경우, 사용자는 상기 특정 SIM에 해당하는 SMS 메시지 형식을 메시지 작성영역에서 바로 선택하여 메시지를 발 신할 수 있다. 또한, 저장된 드래프트 메시지를 복구하는 경우, 복수의 메시지 형식 각각에 해당하는 드래프트 메시지를 저장하고, 복구할 수 있으므로, 종래에 메시지 어플리케이션에서 제공된 하나의 작성창에 대한 하나의 드래프트 메시지보다 많은 드래프트 메시지를 저장하고 이용할 수 있다."}
{"patent_id": "10-2015-0015076", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명의 다양한 실시 예 를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물 (equivalent) 및/또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사 한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 문서에서, “가진다,” “가질 수 있다,”“포함한다,” 또는 “포함할 수 있다” 등의 표현은 해당 특징 (예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는 다. 본 문서에서, “A 또는 B”, “A 또는/및 B 중 적어도 하나” 또는 “A 또는/및 B 중 하나 또는 그 이상” 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, “A 또는 B”, “A 및 B 중 적어 도 하나” 또는 “A 또는 B 중 적어도 하나”는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또 는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 다양한 실시 예에서 사용된 “제 1”, “제 2”, “첫째” 또는 “둘째” 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 해당 구성요소들을 한정하지 않는다. 상술한 표현들은 한 구 성요소를 다른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 발명의 권리 범위를 벗 어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소 (예: 제 1 구성요소)가 다른 구성요소 (예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연 결되어 ((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어 (connected to)\" 있다고 언 급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소 (예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소 (예: 제 1 구성요소)가 다른 구성요소 (예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 어떤 구성요소와 다른 구성요소 사이에 다른 구성요소 (예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 “~하도록 구성된 (또는 설정된)(configured to)”은 상황에 따라, 예를 들면, “~에 적합한 (suitable for)”, “~하는 능력을 가지는 (having the capacity to)”, “~하도록 설계된 (designed to)”, “~하도록 변경된 (adapted to)”, “~하도록 만들어진 (made to)” 또는 “~를 할 수 있는 (capable of)”과 바꾸어 사용될 수 있다. 용어 “~하도록 구성 (또는 설정)된”은 하드웨어적으로 “특별히 설계된 (specifically designed to)”것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, “~하도록 구성된 전자 장치”라는 표현은, 그 전자 장치가 다른 전자 장치 또는 부품들과 함께 “~할 수 있는” 것을 의미할 수 있다. 예를 들면, 문구 “A, B, 및 C를 수행하도록 구성 (또는 설정)된 프로세서”는 해당 동작을 수행하기 위 한 전용 프로세서 (예: 임베디드 프로세서), 또는 메모리 전자 장치에 저장된 하나 이상의 소프트웨어 프로그램 들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서 (generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 기술 분야에서 통 상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전 에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있 으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우 에 따라서, 본 문서에서 정의된 용어일지라도 본 발명의 실시 예들을 배제하도록 해석될 수 없다. 본 발명의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 전자 장치는 스마트폰 (smartphone), 태블릿 PC (tablet personal computer), 이동 전화기 (mobile phone), 화상 전화기, 전자북 리더기 (e-book reader), 데 스크탑 PC (desktop personal computer), 랩탑 PC (laptop personal computer), 넷북 컴퓨터 (netbook computer), 워크스테이션 (workstation), 서버, PDA (personal digital assistant), PMP (portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라 (camera), 또는 웨어러블 전자 장치 (wearable device)(예: 스마트 안경, 머리 착용형 전자 장치 (head-mounted-device(HMD)), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리 (appcessory), 전자 문신, 스마트 미러, 또는 스마트 와치 (smart watch))중 적어도 하 나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 스마트 가전 제품 (smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들면, 텔레비전, DVD (digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스 (set-top box), 홈 자동 제어 패널 (home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스 (예: 삼성 HomeSync™, 애플TV™, 또는 구글 TV ™), 게임 콘솔 (예: Xbox™, PlayStation™), 전자 사전, 전자 키, 캠코더 (camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기 (예: 각종 휴대용 의료측정기기 (혈당 측정기, 심박 측정기, 혈 압 측정기, 또는 체온 측정기 등), MRA (magnetic resonance angiography), MRI (magnetic resonance imaging), CT (computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 (navigation) 전자 장치, GPS 수신기 (global positioning system receiver), EDR (event data recorder), FDR (flight data recorder), 자 동차 인포테인먼트 (infotainment) 전자 장치, 선박용 전자 장비(예: 선박용 항법 전자 장치, 자이로 콤파스 등), 항공 전자기기 (avionics), 보안 기기, 차량용 헤드 유닛 (head unit), 산업용 또는 가정용 로봇, 금융 기 관의 ATM (automatic teller’s machine), 상점의 POS (point of sales), 또는 사물 인터넷 전자 장치 (internet of things)(예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 전자 장치, 화재경보기, 온도 조절기 (thermostat), 가로등, 토스터 (toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포 함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구 (furniture) 또는 건물/구조물의 일부, 전자 보드 (electronic board), 전자 사인 수신 전자 장치 (electronic signature receiving device), 프로젝터 (projector), 또는 각 종 계측 기기 (예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 전술한 다양한 전자 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 발명의 실시 예에 따른 전자 장치는 전술한 기기들에 한 정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다.이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 전자 장치 (예: 인공지능 전자 장치)를 지칭할 수 있다. 이하 본 발명의 다양한 실시 예는 전자 장치에서 통합 메시지 어플리케이션을 운용하여 다양한 메시지 형식 중 전송할 메시지의 형식을 하나의 실행화면에서 선택 또는 변경할 수 있는 기술에 대해 설명한다. 도 1은 본 발명의 실시 예에 따른 전자 장치의 블록도를 도시하고 있다. 도 1을 참조하면, 전자 장치는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플 레이 및 통신 인터페이스를 포함할 수 있다. 본 발명의 다양한 예에 따르면, 전자 장치는, 상술 한 구성요소들 중 적어도 하나를 생략하거나 다른 구성 요소를 추가적으로 구비할 수 있다. 버스는 상술한 구성요소들(예: 프로세서, 메모리, 입출력 인터페이스, 디스플레이 또 는 통신 인터페이스 등)을 서로 연결하고, 상술한 구성요소들 간의 통신(예: 제어 메시지)을 전달하는 회 로일 수 있다. 프로세서는, 중앙처리전자 장치 (central processing unit (CPU)), 어플리케이션 프로세서 (application processor (AP)), 또는 커뮤니케이션 프로세서 (communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신 에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는 전자 장치의 적어도 하 나의 다른 구성요소에 관련된 명령 또는 데이터(예: 수신 제어 목록)를 저장할 수 있다. 한 실시 예에 따르면, 메모리는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 예를 들어, 프로그램은 커널, 미들웨어, 응용프로그램 프로그래밍 인터페이스(API: application programming interface) 또는 응 용프로그램 등을 포함할 수 있다. 커널, 미들웨어, 또는 응용프로그램 프로그래밍 인터페이스 (API)의 적어도 일부는 운영 시스템(operating system (OS))라 불릴 수 있다. 커널은 다른 프로그램들(예: 미들웨어, API 또는 응용프로그램)에 구현된 동작 또는 기능 을 실행하는데 사용되는 시스템 리소스들(예: 버스, 프로세서 또는 메모리 등)을 제어 또는 관 리할 수 있다. 커널은 미들웨어, API 또는 응용프로그램에서 전자 장치의 개별 구성 요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는 API 또는 응용프로그램이 커널과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 미들웨어는 응용프로그램으로부터 수신된 작업 요청에 대한 제어를 수행할 수 있다. 예를 들어, 미들웨어는 응용프로그램 중 적어도 하나의 응용프로그램에 전자 장치의 시스템 리소스를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케 쥴링 또는 로드 밸런싱)을 수행할 수 있다. API는 응용프로그램이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스 로 또는 함수(예: 명령어)를 포함할 수 있다. 예를 들어, API는 파일 제어, 창 제어, 화상 처리 또는 문자 제어와 같은 적어도 하나의 인터페이스를 포함할 수 있다. 입출력 인터페이스는 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장치의 다 른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스는 전자 장 치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이 (LCD), 발광 다이오드 (LED) 디스플레이, 유기 발광 다이오드 (OLED) 디스플레이, 또는 마이크로 전자기계 시스템 (microelectromechanical systems (MEMS)) 디스플레이, 또 는 전자종이 (electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각 종 콘텐츠 (예: 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또 는 호버링 입력을 수신할 수 있다. 통신 인터페이스는 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치 또는 서버 )와의 통신을 연결할 수 있다. 예를 들어, 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네 트워크에 연결되어 외부 전자 장치와 통신할 수 있다. 예컨대, 무선 통신은, 근거리 통신 프로토콜로서, 예를 들면, WiFi(wireless fidelity), 블루투스(Bluetooth), NFC(near field communication), BLE(bluetoothlow energy) 또는 GPS(global positioning system) 등 중 적어도 하나를 포함할 수 있다. 추가적으로 또는 대 체적으로, 무선 통신은, 셀룰러 통신 프로토콜로서, 예를 들면, LTE(long term evolution), LTE-A(advanced), CDMA(code division multiple access), WCDMA(wide-CDMA), UMTS(universal mobile telecommunication system), WiBro, 또는 GSM(global system for mobile communication) 등 중 적어도 하나를 사용할 수 있다. 예 컨대, 유선 통신은, USB (universal serial bus), HDMI (high definition multimedia interface), RS-232 (recommended standard 232), 또는 POTS (plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 통신 네트워크 (telecommunications network), 예를 들면, 컴퓨터 네트워크 (computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망 (telephone network) 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 프로세서와 기능적으로 또는 물리적으로 분리된 적 어도 하나의 모듈을 이용하여 단일 무선 환경에서 LTE 서비스를 제공할 수 있다. 도 2는 본 발명의 실시 예에 따른 전자 장치의 상세 블록도를 도시하고 있다. 이하 설명에서 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 구성할 수 있다. 도 2를 참조하면, 전자 장치는 하나 이상의 응용프로그램 프로세서(AP: application processor), 통 신 모듈, SIM(subscriber identification module) 카드, 메모리, 센서 모듈, 입력 전자 장치, 디스플레이, 인터페이스, 오디오 모듈, 이미지 센서 모듈, 전력관리 모듈 , 배터리, 인디케이터 또는 모터를 포함할 수 있다. AP는 운영체제 또는 응용 프로그램을 구동하여 AP에 연결된 다수의 하드웨어 또는 소프트웨어 구성요 소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 또는 연산을 수행할 수 있다. AP는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시 예에 따르면, AP는 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 통신 모듈(예: 통신 인터페이스)은 전자 장치(예: 전자 장치)와 네트워크를 통해 연결된 다른 전자 장치들간의 통신에서 데이터 송수신을 수행할 수 있다. 한 실시 예에 따르면, 통신 모듈은 셀룰 러 모듈, Wifi 모듈, 블루투스(BT) 모듈, GPS 모듈, NFC 모듈 또는 RF(radio frequency) 모듈를 포함할 수 있다. 셀룰러 모듈은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통화, 영 상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 셀룰러 모듈은, 예를 들면, 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 또는 인증을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 AP가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 예를 들면, 셀룰러 모듈은 멀티 미디어 제어 기능의 적어도 일부를 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 또한, 셀룰러 모듈은, 예를 들면, SoC로 구현될 수 있다. 도 2에서는 셀룰러 모듈(예: 커뮤니 케이션 프로세서), 메모리 또는 전력관리 모듈 등의 구성요소들이 AP와 별개의 구성요소로 도시 되어 있으나, 한 실시 예에 따르면, AP가 전술한 구성요소들의 적어도 일부(예: 셀룰러 모듈)를 포함 하도록 구현될 수 있다. WiFi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 각각은, 예를 들면, 해당하는 모듈을 통해 서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 2에서는 셀룰러 모듈, Wifi 모듈 , BT 모듈, GPS 모듈 또는 NFC 모듈이 각각 별개의 블록으로 도시되었으나, 한 실시 예에 따르면, 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 중 적어도 일부 (예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. 예를 들면, 셀룰러 모듈 , Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 각각에 대응하는 프로세서들 중 적 어도 일부(예: 셀룰러 모듈에 대응하는 커뮤니케이션 프로세서 및 Wifi 모듈에 대응하는 Wifi 프로세 서)는 하나의 SoC로 구현될 수 있다. RF 모듈은 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. RF 모듈은, 도시되지는 않 았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, RF 모듈은 무선 통신에서 자유 공간상의 전자파를송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 2에서는 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 및 NFC 모듈이 하나의 RF 모듈을 서로 공유하는 것으 로 도시되어 있으나, 한 실시 예에 따르면, 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행할 수 있다. 한 실시 예에 따르면, RF 모듈은 전자 장치와 기능적으로 연결된 메인 안테와 서브 안테나 중 적어도 하나의 안테나를 포함할 수 있다. 통신 모듈은 메인 안테나와 서브 안테나를 이용하여 다이버시티 (diversity) 등과 같은 다중 안테나 서비스(MIMO: multiple input multiple output)를 지원할 수 있다. SIM 카드는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 삽입 될 수 있다. SIM 카드는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리는 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘 발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM) 등) 또는 비 휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 내장 메모리는 Solid State Drive (SSD)일 수 있다. 외장 메모리는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital) 또는 Memory Stick 등을 더 포함할 수 있다. 외장 메모리는 다양 한 인터페이스를 통하여 전자 장치와 기능적으로 연결될 수 있다. 한 실시 예에 따르면, 전자 장치는 하드 드라이브와 같은 저장 전자 장치(또는 저장 매체)를 더 포함할 수 있다. 센서 모듈은 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(240A), 자이로 센서(240B), 기압 센서 (240C), 마그네틱 센서(240D), 가속도 센서(240E), 그립 센서(240F), 근접 센서(240G), color 센서(240H)(예: RGB(red, green, blue) 센서), 생체 센서(240I), 온/습도 센서(240J), 조도 센서(240K) 또는 UV(ultra violet) 센서(240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서 (electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센서 (미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 센서 모듈은 그 안에 속한 적 어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 입력 전자 장치는 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키(key) 또는 초음파(ultrasonic) 입력 전자 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정전식, 감압식, 적 외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 터치 패널은 사용자에게 촉각 반응을 제 공할 수 있다. (디지털) 펜 센서는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도의 인 식용 쉬트(sheet)를 이용하여 구현될 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키 또는 키패드를 포함할 수 있다. 초음파(ultrasonic) 입력 전자 장치는 초음파 신호를 발생하는 입력 도구를 통해, 전자 장치에서 마이크로 음파를 감지하여 데이터를 확인할 수 있는 전자 장치로서, 무선 인식이 가능하다. 한 실시 예에 따르면, 전자 장치는 통신 모듈을 이용하여 이와 연결된 외부 전자 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 전자 장치 또는 프로젝터를 포함할 수 있다. 패널은, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light- emitting diode) 등일 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent) 또는 착 용할 수 있게(wearable) 구현될 수 있다. 패널은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로 그램 전자 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 디스플레이는 패널, 홀로그램 전자 장치, 또는 프로젝터를 제어 하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface) 또는 D-sub(D-subminiature)를 포함할 수 있다. 추가 적으로 또는 대체적으로, 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터 페이스를 포함할 수 있다. 오디오 모듈은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰 또는 마이크 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 이미지 센서 모듈은 정지 영상 및 동영상을 촬영할 수 있는 전자 장치로서, 한 실시 예에 따르면, 하나 이 상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래쉬 (flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 전력 관리 모듈은 전자 장치의 전력을 관리할 수 있다. 도시하지는 않았으나, 전력 관리 모듈은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분될 수 있다. 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시 예에 따르면, 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가될 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 배터리 는 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 전자 장치에 전원을 공 급할 수 있다. 배터리는, 예를 들면, 충전식 전지(rechargeable battery) 또는 태양 전지(solar batter y)를 포함할 수 있다. 인디케이터는 전자 장치 혹은 그 일부(예: AP)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상 태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있다. 도시되 지는 않았으나, 전자 장치는 모바일 TV 지원을 위한 처리 전자 장치(예: GPU)를 포함할 수 있다. 모바일 TV지원을 위한 처리 전자 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(componen t)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다 양한 실시 예에 따른 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요 소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시 예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 도 3은 본 발명의 다양한 실시 예에 따른 프로그램 모듈의 블록도를 도시하고 있다. 한 실시예에 따르면, 프로그램 모듈(예: 프로그램)은 전자 장치(예: 전자 장치(100 또는 200))에 관 련된 자원을 제어하는 운영 체제(operating system(OS)) 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이 션(예: 어플리케이션 프로그램)을 포함할 수 있다. 운영 체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈(windows), 심비안(symbian), 타이젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API), 및/또는 어 플리케이션을 포함할 수 있다. 프로그램 모듈의 적어도 일부는 전자 장치에 프리로드(preload) 되거 나, 외부 전자 장치(예: 전자 장치(102, 104), 서버 등)로부터 다운로드(download) 가능하다.커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저 및/또는 디바이스 드라이버를 포함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시 예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등을 포 함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이 버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 또는 IPC(inter- process communication) 드라이버를 포함할 수 있다. 미들웨어(예: 미들웨어)는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하 거나, 어플리케이션이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API를 통해 다양한 기능들을 어플리케이션으로 제공할 수 있다. 한 실시예에 따르면, 미들웨어는 런타임 라 이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀티 미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매 니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입출 력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 무선랜 라이브러리는, 예를 들면, 어플리케이션이 무선랜(예: 와이파이) 연결을 수행하기 위한 제어 정보를 해당 어플리케이션으로 제공할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기(life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미디어 매 니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하 여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어플리케 이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리할 수 있 다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 (battery) 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매 니저는 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저는, 예를 들면, WiFi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도 착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할 수 있 다. 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는 사용자에게 제공될 그 래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용 자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시예에 따르면, 전자 장치(예: 전자 장치)가 전화 기능을 포함한 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니 저(telephony manager)를 더 포함할 수 있다. 한 실시예에 따르면, 전자 장치(예: 전자 장치)가 화면 공유 기능을 포함한 경우, 미들웨어는 다른 전자 장치와의 화면 공유를 위한 화면 공유 제어 매니저를 더 포함 할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들웨 어는 차별화된 기능을 제공하기 위해 운영 체제의 종류별로 특화된 모듈을 제공할 수 있다. 또한, 미들웨 어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제 공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이 젠(tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일 , 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리(health care)(예: 운동량 또 는 혈당 등을 측정), 화면 공유 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 도 4는 본 발명의 실시예에 따른 전자장치의 구성을 개략적으로 도시한 블록도이다. 도 4를 참조하면, 본 발명의 실시 예에 따른 전자장치는 제어부, 표시부, 저장부, 입력부 및 통신부를 포함한다. 제어부는 전자장치의 전반적인 동작을 제어할 수 있다. 특히, 본 발명의 제어부는 통합 메시지 어플리케이션을 실행할 수 있다. 예를 들어, 타 전자장치(대화상대)로부터 메시지를 수신한 경우, 사용자에 의 해 이를 확인하고자 하는 명령에 따라 통합 메시지 어플리케이션을 실행할 수 있다. 이때 대화상대로부터 SMS/LMS/MMS 및 IM 메시지 중 적어도 하나의 메시지를 수신할 수 있다. 또는, 전자장치의 사용자가 특정 대화상대에게 메시지를 전송하기 위한 명령에 따라 메시지 어플리케이션을 실행시킬 수 있다. 제어부는 저장부를 통해 해당 대화상대와 통합 메시지 어플리케이션을 통하여 메시지를 송수신한 이 력이 있는지 판단한다. 즉, 제어부는 전자장치가 본 발명의 메시지 어플리케이션을 이용하여 해당 대 화상대와 메시지를 송수신한 이력 여부를 판단한다. 전자장치가 통합 메시지 어플리케이션을 이용하여 대 화상대와 메시지를 송수신한 이력이 있는 것으로 판단된 경우, 제어부는 특정 대화상대에게 최근에 전송한 메시지의 형식이나 메시지 작성창에 대해 저장된 드래프트 메시지에 해당하는 메시지 형식을 파악한다. 여기서, 메시지 형식이란 SMS/LMS/MMS, IM의 메시지 전송 타입 및 인스턴트 메신저 어플리케이션에 인증된 계정(ID), 전 화번호, SIM의 메시지 전송 구분자 중 적어도 하나를 기반으로 대화상대와 송수신할 수 있는 메시지 타입을 일 컫는다. SMS(Short Message Service), LMS(Long Message Service), MMS(Multi Media Service)는 데이터 크기 별로 나뉘고, 각 형식에 따라 과금되는 요금이 다르다. SMS/LMS/MMS 메시지는 LTE, 와이브로, WCDMA 등과 같은 무선 이동통신과 와이파이와 같은 무선 랜을 통하여 송수신되며, IM 메시지는 와이파이와 같은 무선 랜을 통하 여 송수신 된다. 이와 같이 서로 다른 형식의 메시지에 따라 입력 가능한 데이터 크기, 부여되는 과금 및 이용 되는 통신수단이 서로 다르다. 제어부는 특정 대화상대와 최근에 사용한 대화방을 표시부를 통해 출력한다. 그리고, 대화방의 메시 지 작성영역에 전송 가능한 메시지 형식을 선택할 수 있는 탭을 표시한다. 이때 최근에 전송한 메시지 형식에 해당하는 탭을 활성화 표시하거나, 작성창에 저장된 드래프트 메시지의 형식에 해당하는 탭을 활성화 표시하도 록 제어한다. 또는 사용자의 사전 설정에 따라 정해진 메시지 형식에 해당하는 탭이 활성화 표시될 수도 있다. 상기와 같은 탭 표시를 위해, 제어부는 사전에 메시지를 전송할 기반으로서의 SMS/LMS/MMS, IM 전송방식 및 IM에 인증된 ID, 전화번호, SIM 가입자 식별번호 중 적어도 하나에 해당하여 메시지 작성영역에 표시될 탭을 생성하여 저장한다. 구체적으로, SMS/LMS/MMS는 하나의 탭으로 구성되고, 사용자가 입력하는 메시지의 데이터 크기에 따라 탭에 표시되는 내용이 SMS, LMS 및 MMS 중 적어도 하나로 설정 또는 변경될 수 있다. IM 메시지에 대한 탭은 인스턴트 메신저 어플리케이션의 명칭이나 약자를 표시하고, 인증된 ID를 함께 표시할 수 있다. 또한, 서로 다른 ID에 따라 각 탭을 분리하여 구성할 수 있다. SIM에 대한 탭은 문자 메시지에 대한 탭과 합쳐 서 예를 들어, SMS1, SMS2와 같이 표시할 수 있다. SMS1을 표시하는 탭은 SIM1을 이용하여 문자를 전송하고, SMS2를 표시하는 탭은 SIM2를 이용하여 문자를 전송하는 것을 의미할 수 있다. 제어부는 입력부를 통해 메시지 작성영역의 탭 선택 변경을 검출한다. 즉, 과거 이력에 의해 활성화 된 탭이 아닌 다른 어느 하나의 탭이 사용자에 의해 선택되는 것을 검출한다. 상기 검출결과에 따라 제어부 는 표시부를 통해 선택 변경된 탭을 활성화 표시하도록 제어한다. 한편, 과거 이력에 의해 활성화된 탭이 사용자에 의해 변경되지 않은 경우, 제어부는 표시부를 통해 최근에 전송한 메시지 형식에 해당하는 탭을 활성화 표시하거나, 메시지 작성창에 대해 저장된 드래프트 메시지 의 형식에 해당하는 탭을 활성화 표시하거나, 사용자가 사전에 설정한 메시지 형식에 해당하는 탭을 활성화 표 시하도록 제어한다. 제어부는 메시지 작성창을 통해 사용자에 의해 입력된 정보를 메시지로 획득하고, 사용자에 의해 메시지 전송 요청이 입력되면, 획득된 메시지를 전송하도록 통신부를 제어한다. 여기서, 사용자는 먼저 메시지 작 성창에 정보를 입력하고, 다음으로 전송할 메시지 타입을 정하기 위해 탭 선택을 하고, 전송 아이콘을 실행시킬수 있다. 또는, 상기 순서와 반대로 사용자는 먼저 탭을 선택하여 전송할 메시지 타입을 정하고, 다음으로 메시 지 작성창에 정보를 입력한 후, 전송 아이콘을 실행시킬 수 있다. 이와 같이 본 발명의 통합 메시지 어플리케이션은 메시지 작성창에 대한 UI는 하나를 제공하더라도, 서로 다른 메시지 형식을 선택할 수 있는 탭을 제공함으로써, 하나의 실행화면에서 다양한 메시지 형식 중 어느 하나의 메 시지 형식을 선택 또는 변경을 용이하게 할 수 있도록 한다. 한편, 제어부는 사용자가 선택한 탭에 따라 입력 가능 용량을 화면에 표시해줄 수 있다. 예를 들어, 사용 자가 SMS 메시지에 해당하는 탭을 선택한 경우, 제어부는 사용자에게 80바이트(byte), 한글은 40자, 영문 과 숫자, 기호는 80자를 입력할 수 있다고 안내해 준다. 그리고 만약, 80바이트(byte) 이상의 메시지가 입력되 면 제어부는 SMS 메시지 형식을 LMS 메시지 형식으로 자동 변환시키고, 사용자에게는 용량 초과로 인하여 SMS 메시지가 LMS 메시지로 변환된다는 사실을 사용자에게 알려주며, SMS로 표시된 탭의 내용을 LMS로 변경하여 출력한다. 더불어 LMS 메시지는 2000바이트(한글 1000자)를 입력할 수 있음을 안내해준다. 이후 사용자 입력이 LMS 메시지 용량을 초과하면, MMS 메시지 형식으로 자동 변환시키고, 사용자에게는 용량 초과로 인하여 LMS 메 시지가 MMS 메시지로 변환된다는 사실을 사용자에게 알려주며, LMS로 표시된 탭의 내용을 MMS로 변경하여 출력 한다. 제어부는 최종적으로 설정된 탭의 메시지 형식에 해당하는 통신방식으로 메시지를 전송하도록 통신부(49 0)를 제어한다. 제어부는 통합 메시지 어플리케이션의 종료 요청을 수신하면, 통합 메시지 어플리케이션의 실행을 종료한 다. 한편, 제어부는 사용자 전자장치가 특정 대화상대와 메시지를 송수신하기 위해 본 발명의 통합 메시 지 어플리케이션을 처음 이용하는 경우, 해당 대화상대에게 전송 가능한 메시지 형식을 분석한다. 이를 위해 제어부는 대화상대와 송수신한 메시지 이력을 추적할 수 있다. 즉, 대화상대와 이전에 SMS/LMS/MMS, IM 메시지를 송수신한 이력을 추적할 수 있다. 구체적으로, 문자 어플리케이션을 통해 SMS/LMS/MMS 메시지를 송수신한 이력이 존재하면, SMS/LMS/MMS 메시지 형식을 대화상대와 전송 가능한 메시지 형식으로 분석한다. 또한, 본 발명의 통합 메시지 어플리케이션 이외의 전자장치에 설치된 다른 인스턴트 메신저 어플리케이션을 통해 IM 메시지를 송수신한 이력이 존재하면, IM 메시지 형식을 대화상대에게 전송 가능 한 메시지 형식으로 분석하고, 해당 IM 메신저를 통한 메시지 송수신이 가능한 것으로 분석한다. 또한, 상기 인 스턴트 메신저 어플리케이션에 인증된 적어도 하나의 계정(ID)으로 메시지 송수신이 가능한 것으로 분석한다. 또한, 멀티 SIM 단말에서 특정 SIM을 기반으로 메시지가 송수신된 이력이 존재하면, 멀티 SIM들 중 상기 특정 SIM 을 우선순위로 설정할 수 있다. 또는, 설계자의 설정에 따라 멀티 SIM중 사용빈도가 높은 SIM을 디폴트로 설정할 수도 있다. 다른 방편으로, 제어부는 대화상대에게 전송 가능한 메시지 형식을 분석하기 위해, 사용자 전자장치 에 대화상대의 전화번호의 저장여부와 IM 메신저 어플리케이션의 대화상대(또는 친구) 등록여부를 판단할 수 있 다. 사용자 전자장치에 대화상대의 전화번호가 저장되어 있는 경우, SMS/LMS/MMS 메시지 형식을 대화상대 에게 전송 가능한 메시지 형식으로 분석한다. IM 메신저 어플리케이션의 대화상대(또는 친구)로 등록되어 있는 경우, IM 메시지 형식을 대화상대에게 전송 가능한 메시지 형식으로 분석한다. 제어부는 상기 분석된 메시지 형식에 해당하는 아이콘을 생성하고, 생성된 아이콘들을 표시부를 통해 메시지 작성영역 및 메시지 표시영역에 출력하여 서로 다른 메시지 형식이 구분되도록 표시한다. 제어부는 메시지 작성영역의 탭 선택 발생을 검출하고, 선택된 탭을 표시부를 통해 활성화 표시한다. 여기서 사용자에 의해 아무 탭이 선택되지 않은 경우, 제어부는 디폴트로 설정된 메시지 전송방식에 해당 하는 탭을 활성화한다. 표시부는 액정 디스플레이(LCD; liquid crystal display), 발광 다이오드(LED; light emitting diode) 디 스플레이, 유기 발광 다이오드(OLED; organic LED) 디스플레이, 마이크로 전자기계 시스템(MEMS; micro electro mechanical systems) 디스플레이 및 전자 종이(electronic paper) 디스플레이를 포함할 수 있다. 여기 서, 표시부은 입력부와 결합되어, 터치 스크린(touch screen)으로 구현될 수 있다. 특히, 본 발명의 표시부는 통합 메시지 어플리케이션의 실행화면을 표시하고, 이에 따라 대화방(또는 채팅 창이라 할 수 있음)을 표시하며, 상기 대화방은 메시지 표시영역과 메시지 작성영역으로 구분될 수 있다. 메시지 표시영역 내에 송수신된 메시지를 말풍선으로 표시하고, 메시지 형식을 사용자가 알아볼 수 있게 아이콘을 말풍선 내부 또는 말풍선에 인접한 외부영역에 표시한다. 이를 위해 말풍선 말단부분 또는 말풍선 하단의 외곽 영역에 SMS/LMS/MMS의 표시, 전화번호 표시, SIM카드 식별번호를 표시하거나, IM의 명칭이나 약자를 표시할 수 있으며, 인스턴트 메신저에 인증된 ID도 표시할 수 있다. 이러한 문자나 숫자 등의 텍스트로 아이콘을 표시할 수도 있고, 그림이나 도형, 마크, 심볼 등으로 아이콘을 표시할 수도 있다. 또한, 표시부는 활성화된 탭의 표시를 위해 해당 탭을 하이라이트 표시하거나, 메시지 작성영역에서 숨겼다가 출력하는 수행을 반복하는 깜박 이 표시하거나, 다른 탭들과 비교하여 활성화된 탭에 대조되는 다른 색상, 다른 모양, 다른 무늬를 이용하여 표 시할 수 있다. 저장부은 전자 장치의 동작 프로그램들을 저장할 수 있다. 이 때 저장부은 다양한 기능들을 실 행하기 위한 프로그램을 저장할 수 있다. 그리고 저장부은 프로그램들을 수행하는 중에 발생되는 데이터를 저장할 수 있다. 특히, 저장부는 통합 메시지 어플리케이션을 저장하고, 통합 메시지 어플리케이션의 실행에 따라 발생한 데이터들을 저장할 수 있다. 구체적으로 저장부는 통합 메시지 어플리케이션 사용 이력, 통합 메시지 어플 리케이션을 이용하여 송수신한 메시지, 특정 대화상대에게 최근 전송한 메시지 형식, 특정 대화상대가 전송한 메시지 형식, 특정 대화상대에게 전송 가능한 복수의 메시지 형식에 대응하여 생성된 아이콘 및 탭, 메시지 작 성창에 입력된 드래프트 메시지 등을 저장할 수 있다. 이를 위해 저장부는 메시지 데이터베이스를 구비할 수 있고, 메시지 데이터베이스는 전송 타입(SMS, LMS, MMS, IM) 및 전송 구분자(ID, 전화번호, SIM) 각각에 대 응하는 데이터베이스들로 구성되거나, 이들을 통합 저장하는 하나의 데이터베이스로 구성될 수 있다. 입력부은 전자 장치에서 입력 데이터를 발생시킬 수 있다. 이 때 입력부은 전자 장치 의 사용자 입력에 대응하여, 입력 데이터를 발생시킬 수 있다. 그리고 입력부은 적어도 하나의 입력 수단을 포함할 수 있다. 이러한 입력부은 키 패드(key pad), 돔 스위치(dome switch), 물리 버튼, 터치 패널 (touch panel), 조그 셔틀(jog & shuttle) 및 센서(sensor)를 포함할 수 있다. 특히, 본 발명의 입력부는 통합 메시지 애플리케이션의 실행에 따라 메시지 작성영역의 메시지 작성창 (message composer)에 메시지를 입력시킬 수 있다. 한편, 메시지 작성창에 입력된 메시지는 사용자에 의해 전송 요청이 발생하기 전에는 메시자 작성창에 지워지지 않고 드래프트 메시지로 저장될 수 있다. 입력부를 통 해 사용자는 메시지 작성영역의 메시지 형식에 대한 선택 탭에 대해 터치 이벤트, 롱 프레스, 탭으로부터 작성 창(message composer)까지 드래그 앤 드롭 이벤트 등을 발생시킬 수 있다. 통신부는 전자 장치에서 통신을 수행할 수 있다. 이 때 통신부은 다양한 통신 방식으로, 외부 장치(도시되지 않음)와 통신할 수 있다. 여기서, 통신부은 무선 통신 또는 유선 통신 중 적어도 어느 하나 를 수행할 수 있다. 이를 위해, 통신부은 이동 통신망 또는 데이터 통신망 중 적어도 어느 하나에 접속할 수 있다. 또는 통신부은 근거리 통신을 수행할 수 있다. 예를 들면, 외부 장치는 전자 장치, 기지국, 서버 및 위성을 포함할 수 있다. 그리고 통신 방식은 LTE(long term evolution), WCDMA(wideband code division multiple access), GSM(global system for mobile communications), WiFi(wireless fidelity), 블루투스 (bluetooth) 및 NFC(near field communications)를 포함할 수 있다. 특히, 본 발명의 통신부는 통합 메시지 애플리케이션에서 사용자에 의해 설정된 메시지 형식과 전자장치 에서 이용하는 통신방식을 고려하여 메시지를 전송할 수 있다. 예를 들어, 전자장치가 Wifi와 LTE를 기반으로 한 통신이 설정된 상태에서 통합 메시지 애플리케이션 실행을 통해 IM 메시지를 전송하려는 경우, 통 신부는 상대적으로 과금이 발생하지 않는 Wifi를 이용하여 IM 메시지를 전송할 수 있다. 도 5는 본 발명의 실시 예에 따른 통합 메시지 어플리케이션 운용방법을 설명하기 위한 순서도이다. 도 5를 참조하면, 본 발명의 통합 메시지 어플리케이션 운용방법은 먼저, 501 동작에서 제어부는 메시지 어플리케이션을 실행할 수 있다. 여기서 특정 대화상대가 설정된다. 예를 들어, 타 전자장치(특정 대화상대)로 부터 메시지를 수신한 경우, 사용자에 의해 이를 확인하고자 하는 명령에 따라 통합 메시지 어플리케이션을 실 행할 수 있다. 이때 대화상대로부터 SMS, LMS, MMS 및 IM 메시지 중 적어도 하나의 메시지를 수신할 수 있다. 또는, 전자장치의 사용자가 특정 대화상대에게 메시지를 전송하기 위한 명령에 따라 통합 메시지 어플리케 이션을 실행시킬 수 있다. 503동작에서 제어부는 특정 대화상대와 통합 메시지 어플리케이션을 통하여 메시지를 송수신한 이력이 있 는지 판단한다. 503동작에서 전자장치가 통합 메시지 어플리케이션을 이용하여 특정 대화상대와 메시지를 송수신한 이력이 있는 것으로 판단된 경우, 제어부는 505동작에서 특정 대화상대에게 최근에 전송한 메시지 형식이나 해당 대화방의 메시지 작성창에 대해 저장된 드래프트 메시지에 해당하는 메시지 형식을 파악한다. 여기서, 메시지 형식이란 SMS/LMS/MMS, IM 의 메시지 전송 타입 및 인스턴트 메신저에 인증된 ID, 전화번호, SIM 의 메시지 전송 구분자 중 적어도 하나를 기반으로 대화상대에게 전송할 수 있는 메시지 타입을 일컫는다. 여기서 전자장치는 하나의 인스턴트 메신저 어플리케이션에 대해 다수개의 계정(Identification)을 이용할 수 있다. 또한, 멀티 SIM을 지원하는 전자장치의 경우, 다수개의 SIM 중 어느 하나를 선택하여 사용할 수 있다. 또한, 하나의 전자장치가 다중 전화번호를 이용할 수 있다. 507 동작에서 제어부는 특정 대화상대와 최근에 사용한 대화방을 표시하고, 상기 대화방에 전송 가능한 어 느 하나의 메시지 형식을 선택할 수 있는 탭을 표시하며, 이때 최근에 사용한 메시지 형식에 해당하는 탭을 활 성화 표시하거나, 작성창에 저장된 드래프트 메시지의 형식에 해당하는 탭을 활성화 표시한다. 이를 위해 사전에 제어부는 대화상대 별로 전송 가능한 메시지 형식에 대응하는 탭을 미리 생성하여 저장 할 수 있다. 예를 들어, 제어부는 메시지를 전송할 기반으로서의 SMS/LMS/MMS, IM 전송방식 및 IM에 인증 된 ID, 전화번호, SIM 가입자 식별번호 중 적어도 하나에 해당하여 메시지 작성영역에 표시될 탭을 생성하여 저 장한다. 구체적으로, SMS/LMS/MMS는 하나의 탭으로 구성되고, 사용자가 입력하는 메시지의 데이터 크기에 따라 탭에 표시되는 내용이 SMS, LMS 및 MMS 중 적어도 하나로 설정 또는 변경될 수 있다. IM 메시지에 대한 탭은 인 스턴트 메신저 어플리케이션의 명칭이나 약자를 표시하고, 인증된 ID를 함께 표시할 수 있다. 또한, 서로 다른 ID에 따라 각 탭을 분리하여 구성할 수 있다. SIM에 대한 탭은 문자 메시지에 대한 탭과 합쳐서 예를 들어, SMS1, SMS2와 같이 표시할 수 있다. SMS1을 표시하는 탭은 SIM1을 이용하여 문자를 전송하고, SMS2를 표시하는 탭은 SIM2를 이용하여 문자를 전송하는 것을 의미할 수 있다. 활성화 표시는 선택된 탭을 하이라이트 처리하거나, 선택된 탭을 메시지 작성영역에서 숨겼다가 출력하는 수행 을 반복하는 깜박이 처리하거나, 선택되지 않은 다른 탭들과 비교하여 선택된 탭에 대조되는 다른 색상, 다른 모양, 다른 무늬를 이용할 수 있다. 대화방은 메시지 표시영역 및 메시지 작성영역을 포함하여 표시될 수 있고, 메시지 표시영역 내에 말풍선에 메시지 내용이 표시될 수 있다. 이와 더불어 제어부는 송수신된 메시지 형식을 표현하는 아이콘을 표시한다. 상기 아이콘은 특정 대화상대 와 송수신한 메시지 형식에 대한 메시지 정보, 해당 메시지 형식을 전송하는 사용자 정보를 포함하여 표시될 수 있다. 예를 들어, 상기 아이콘이 말풍선으로 제공되는 경우, 상기 말풍선 말단부분 또는 말풍선 하단의 외곽영 역 등에 상기 메시지 정보 및 상기 사용자 정보가 표시될 수 있다. 예를 들어, SMS/MMS의 표시, 전화번호 표시, SIM카드 식별번호를 표시하거나, IM의 명칭이나 약자를 표시할 수 있으며, 이용된 ID도 표시할 수 있다. 이러한 문자나 숫자 등의 텍스트로 아이콘을 표시할 수도 있고, 이미지나 도형, 마크, 심볼 등으로 아이콘을 표시할 수 도 있다. 509 동작에서 제어부는 메시지 작성영역의 탭 선택 변경을 검출한다. 즉, 과거 이력에 의해 활성화된 탭이 아닌 다른 어느 하나의 탭이 사용자에 의해 선택되는 것을 검출한다. 사용자에 의한 선택은 어느 하나의 탭에 대해 발생한 터치 이벤트, 롱 프레스, 탭으로부터 작성창(message composer)까지 드래그 앤 드롭 이벤트 등을 통해 구현될 수 있다. 과거 이력에 의해 활성화된 탭이 이와 같은 사용자의 선택에 의해 변경될 수 있다. 511 동작에서 제어부는 선택 변경된 탭을 활성화 표시한다. 마찬가지로 활성화 표시는 탭을 하이라이트 처 리하거나, 탭을 메시지 작성영역에서 숨겼다가 출력하는 수행을 반복하는 깜박이 처리하거나, 선택되지 않은 다 른 탭들과 비교하여 선택된 탭에 대조되는 다른 색상, 다른 모양, 다른 무늬를 이용할 수 있다. 한편, 509 동작에서 과거 이력에 의해 활성화된 탭이 사용자에 의해 변경되지 않은 경우, 제어부는 최근에 전송한 메시지 형식에 해당하는 탭을 활성화 표시하거나, 메시지 작성창에 대해 저장된 드래프트 메시지의 형식 에 해당하는 탭을 활성화 표시한다. 513 동작에서 제어부는 통합 메시지 어플리케이션의 해당 기능을 수행한다. 예를 들어, 제어부는 메 시지 작성창을 통해 사용자에 의해 입력된 정보를 메시지로 획득하고, 사용자에 의해 메시지 전송 요청이 입력 되면, 획득된 메시지를 전송하도록 제어한다. 여기서, 사용자는 먼저 메시지 작성창에 정보를 입력하고, 다음으 로 전송할 메시지 타입을 정하기 위해 탭 선택을 하고, 전송 아이콘을 실행시킬 수 있다. 또는, 상기 순서와 반 대로 사용자는 먼저 탭을 선택하여 전송할 메시지 타입을 정하고, 다음으로 메시지 작성창에 정보를 입력한 후,전송 아이콘을 실행시킬 수 있다. 이와 같이 본 발명의 통합 메시지 어플리케이션은 메시지 작성창에 대한 UI는 하나를 제공하더라도, 서로 다른 메시지 형식을 선택할 수 있는 탭을 제공함으로써, 하나의 실행화면에서 다양한 메시지 형식 중 어느 하나의 메 시지 형식을 선택 또는 변경을 용이하게 할 수 있도록 한다. 한편, 제어부는 사용자가 선택한 탭에 따라 입력 가능 용량을 화면에 표시해줄 수 있다. 예를 들어, 사용 자가 SMS 메시지에 해당하는 탭을 선택한 경우, 제어부는 사용자에게 80바이트(byte), 한글은 40자, 영문 과 숫자, 기호는 80자를 입력할 수 있다고 안내해 준다. 그리고 만약, 80바이트(byte) 이상의 메시지가 입력되 면 제어부는 SMS 메시지 형식을 LMS 메시지 형식으로 자동 변환시키고, 사용자에게는 용량 초과로 인하여 SMS 메시지가 LMS 메시지로 변환된다는 사실을 사용자에게 알려주며, SMS로 표시된 탭의 내용을 LMS로 변경하여 출력한다. 더불어 LMS 메시지는 2000바이트(한글 1000자)를 입력할 수 있음을 안내해준다. 이후 사용자 입력이 LMS 메시지 용량을 초과하면, MMS 메시지 형식으로 자동 변환시키고, 사용자에게는 용량 초과로 인하여 LMS 메 시지가 MMS 메시지로 변환된다는 사실을 사용자에게 알려주며, LMS로 표시된 탭의 내용을 MMS로 변경하여 출력 한다. 515 동작에서 제어부는 통합 메시지 어플리케이션의 종료 요청을 수신하면, 통합 메시지 어플리케이션의 실행을 종료한다. 도 6은 본 발명의 실시 예에 따른 통합 메시지 어플리케이션 운용방법을 설명하기 위한 순서도이다. 도 6은 도 5의 503 동작에서 사용자 전자장치가 특정 대화상대와 메시지를 송수신하기 위해 통합 메시지 어플리 케이션을 이용한 이력이 없는 경우의 실시 예를 도시한다. 즉, 도 6은 사용자 전자장치가 특정 대화상대와 메시지를 송수신하기 위해 본 발명의 통합 메시지 어플리케이션을 처음 이용하는 경우의 실시 예를 도시한다. 도 6을 참조하면, 먼저 503 동작에서 사용자 전자장치가 해당 대화상대와 통합 메시지 어플리케이션을 통 해 메시지를 송수신한 이력이 존재하지 않는 경우, 제어부는 603 동작에서 해당 대화상대에게 전송 가능한 메시지 형식을 분석한다. 여기서, 메시지 형식이란 SMS/LMS/MMS, IM 의 메시지 전송 타입 및 인스턴트 메신저에 인증된 ID, 전화번호, SIM 의 메시지 전송 구분자 중 적어도 하나를 기반으로 대화상대에게 전송할 수 있는 메시지 타입을 일컫는다. 여기서 전자장치는 하나의 인스턴트 메신저 어플리케이션에 대해 다수개의 계정(Identification)을 이용할 수 있다. 또한, 멀티 SIM을 지원하는 전자장치의 경우, 다수개의 SIM 중 어느 하나를 선택하여 사용할 수 있다. 또한, 하나의 전자장치가 다중 전화번호를 이용할 수 있다. 이를 위해 제어부는 대화상대에 해당하는 메시지 송수신 이력을 추적할 수 있다. 즉, 대화상대와 이전에 문자 메시지 어플리케이션을 통해 SMS, LMS 및 MMS 메시지 중 적어도 하나를 송수신한 이력이나, 본 발명의 통 합 메시지 어플리케이션 이외의 전자장치에 설치된 다른 인스턴트 메신저 어플리케이션을 통해 IM 메시지 를 송수신한 이력을 추적할 수 있다. 예를 들어, SMS, LMS 및 MMS 중 적어도 하나의 메시지 송수신 이력이 존재 하면, SMS, LMS 및 MMS 메시지 형식을 대화상대에게 전송 가능한 메시지 형식으로 분석한다. 마찬가지로 IM 메 시지 송수신 이력이 존재하면 IM 메시지 형식을 대화상대에게 전송 가능한 메시지 형식으로 분석하며, 해당 인 스턴트 메신저 어플리케이션을 통한 메시지 송수신이 가능한 것으로 분석한다. 또한, 멀티 SIM 단말에서 특정 SIM을 기반으로 메시지가 송수신된 이력이 존재하면, 멀티 SIM들 중 상기 특정 SIM 을 우선순위로 설정하거나 특정 SIM의 사용을 디폴트로 설정할 수 있다. 다른 방편으로, 제어부는 대화상대에게 전송 가능한 메시지 형식을 분석하기 위해, 사용자 전자장치 에 대화상대의 전화번호 저장여부와 본 발명의 통합 메시지 어플리케이션 이외의 전자장치에 설치된 다른 인스턴트 메신저 어플리케이션의 대화상대(또는 친구) 등록여부를 판단할 수 있다. 사용자 전자장치에 대 화상대의 전화번호가 저장되어 있는 경우, SMS/LMS/MMS 메시지 형식을 대화상대에게 전송 가능한 메시지 형식으 로 분석한다. 다른 인스턴트 메신저 어플리케이션의 대화상대(또는 친구)로 등록되어 있는 경우, 해당 인스턴트 메신저 어플리케이션을 통한 IM 메시지 형식을 대화상대에게 전송 가능한 메시지 형식으로 분석한다. 605동작에서 제어부는 603 동작에서 분석된 메시지 형식에 해당하는 아이콘 및 탭을 생성한다. 구체적으로, 제어부는 메시지 작성영역에 메시지를 전송할 기반으로서 SMS/LMS/MMS, IM 전송방식 및 IM에 인증된 ID, 전화번호, SIM 가입자 식별번호 중 적어도 하나를 선택할 수 있는 탭을 생성한다. SMS/LMS/MMS는 하나의 탭으로 구성되고, 사용자가 입력하는 메시지의 데이터 크기에 따라 탭에 표시되는 내용이 SMS, LMS 및 MMS 중 적어도 하나로 설정 또는 변경될 수 있다. IM 메시지에 대한 탭은 인스턴트 메신저 어플리케이션의 명칭이나 약자를 표시하고, 인증된 ID를 함께 표시할 수 있다. 또한, 서로 다른 ID에 따라 각 탭을 분리하여 구성할 수 있다. SIM에 대한 탭은 문자 메시지에 대한 탭과 합쳐서 예를 들어, SMS1, SMS2와 같이 표시할 수 있다. SMS1을 표시하는 탭은 SIM1을 이용하여 문자를 전송하고, SMS2를 표시하는 탭은 SIM2를 이용하여 문자를 전송하는 것을 의미할 수 있다. 그리고, 제어부는 메시지 표시영역에 대해서는 송수신 메시지에 해당하는 말풍선을 표시하고, 상기 말풍선 의 인접한 영역에 SMS, LMS, MMS 또는 IM 메시지와 같은 메시지 타입과, 이용된 ID, 전화번호, SIM과 같은 전송 구분자를 사용자가 알아볼 수 있도록 표시하는 아이콘을 생성한다. SMS, LMS, MMS의 표시, 전화번호 표시, SIM 카드 식별번호 표시, 인스턴트 메신저 어플리케이션의 명칭이나 약자 표시, 이용된 ID 표시로 상기 아이콘을 생 성할 수 있다. 이러한 문자나 숫자 등의 텍스트로 아이콘을 표시할 수도 있고, 이미지나 도형, 마크, 심볼 등으 로 아이콘을 표시할 수도 있다. 607 동작에서 제어부는 605 동작에서 생성된 아이콘 및 탭을 메시지 표시영역 및 메시지 작성영역에 출력 하여 서로 다른 메시지 형식을 구분되게 표시한다. 예를 들어, 탭은 메시지 작성창 상위에 인접하게 표시할 수 있다. 또한, 탭들은 소정 간격 이격되게 배치하여 SMS/LMS/MMS와 IM, SIM, 전화번호, ID 중 적어도 하나를 선택할 수 있게 표시한다. IM 탭들은 인스턴트 메신저 어플리케이션 별로 구성하고, 하나의 인스턴트 메신저 어플리케이션에 대해 복수의 계정 별로 탭을 구성할 수 있다. 전자장치가 멀티 SIM을 지원하는 단말인 경우, 멀티 SIM 중 하나를 선택할 수 있게 탭을 구성한다. 메시지 표시영역에는 송수신된 메시지의 형식을 말풍선이나 상기 말풍선의 인접한 영역에 표시한다. 609 동작에서 제어부는 메시지 작성영역의 탭 선택 발생을 검출한다. 즉, 서로 다른 메시지 형식에 해당하 는 탭들 중 사용자에 의해 어느 하나의 탭이 선택되는 것을 검출한다. 사용자에 의한 선택은 어느 하나의 탭에 대해 발생한 터치 이벤트, 롱 프레스, 탭으로부터 작성창(message composer)까지 드래그 앤 드롭 이벤트 등을 통해 구현될 수 있다. 이를 통해 복수의 메시지 전송방식 중 사용자 선택에 의해 어느 하나의 메시지 전송방식 이 결정된다. 611 동작에서 제어부는 선택된 탭을 활성화 표시한다. 활성화 표시는 선택된 탭을 하이라이트 처리하거나, 선택된 탭을 메시지 작성영역에서 숨겼다가 출력하는 수행을 반복하는 깜박이 처리하거나, 선택되지 않은 다른 탭들과 비교하여 선택된 탭에 대조되는 다른 색상, 다른 모양, 다른 무늬를 이용할 수 있다. 한편, 609 동작에서 사용자에 의해 아무 탭이 선택되지 않은 경우, 613 동작에서 제어부는 디폴트로 설정 된 메시지 전송방식에 해당하는 탭을 활성화한다. 대화상대로부터 메시지가 최초로 수신되어 메시지 어플리케이 션이 활성화된 경우, 대화상대로부터 수신한 메시지의 형식과 동일한 메시지 형식을 디폴트로 설정할 수 있다. 또는, 전자장치가 멀티 SIM을 지원하는 단말인 경우, 사용자가 자주 사용하는 SIM을 디폴트로 설정할 수 있다. 또는, Wifi가 지원되는 상황에서는 인스턴트 메신저 어플리케이션에 해당하는 IM 메시지를 전송하도록 디 폴트로 설정할 수 있다. 또는 사용자가 사전에 설정한 메시지 형식에 해당하는 탭을 디폴트로 설정할 수 있다. 615 동작에서 제어부는 통합 메시지 어플리케이션의 해당 기능을 수행한다. 예를 들어, 제어부는 메 시지 작성창을 통해 사용자에 의해 입력된 정보를 메시지로 획득하고, 사용자에 의해 메시지 전송 요청이 입력 되면, 획득된 메시지를 전송하도록 제어한다. 여기서, 사용자는 먼저 메시지 작성창에 정보를 입력하고, 다음으 로 전송할 메시지 타입을 정하기 위해 탭 선택을 하고, 전송 아이콘을 실행시킬 수 있다. 또는, 상기 순서와 반 대로 사용자는 먼저 탭을 선택하여 전송할 메시지 타입을 정하고, 다음으로 메시지 작성창에 정보를 입력한 후, 전송 아이콘을 실행시킬 수 있다. 한편, 제어부는 사용자가 선택한 탭에 따라 입력 가능 용량을 화면에 표시해줄 수 있다. 예를 들어, 사용 자가 SMS 메시지에 해당하는 탭을 선택한 경우, 제어부는 사용자에게 80바이트(byte), 한글은 40자, 영문 과 숫자, 기호는 80자를 입력할 수 있다고 안내해 준다. 그리고 만약, 80바이트(byte) 이상의 메시지가 입력되 면 제어부는 SMS 메시지 형식을 LMS 메시지 형식으로 자동 변환시키고, 사용자에게는 용량 초과로 인하여 SMS 메시지가 LMS 메시지로 변환된다는 사실을 사용자에게 알려주며, SMS로 표시된 탭의 내용을 LMS로 변경하여 출력한다. 더불어 LMS 메시지는 2000바이트(한글 1000자)를 입력할 수 있음을 안내해준다. 이후 사용자 입력이 LMS 메시지 용량을 초과하면, MMS 메시지 형식으로 자동 변환시키고, 사용자에게는 용량 초과로 인하여 LMS 메 시지가 MMS 메시지로 변환된다는 사실을 사용자에게 알려주며, LMS로 표시된 탭의 내용을 MMS로 변경하여 출력한다. 617 동작에서 제어부는 통합 메시지 어플리케이션의 종료 요청을 수신하면, 통합 메시지 어플리케이션의 실행을 종료한다. 도 7 내지 도 11은 본 발명의 실시 예에 따른 통합 메시지 어플리케이션의 실행화면 예시를 나타낸 도면들이다. 도 5 및 도 6을 기준으로 도 7을 참조하여 설명하면, 도 5의 501 동작에서와 같이 통합 메시지 어플리케이션이 실행되면, 제어부는 표시부를 통해 도 7의 <710>과 같은 실행화면을 표시할 수 있다. 예를 들면, 사 용자가 특정 대화상대에게 메시지를 전송하기 위해 바탕화면(또는, 홈 화면, 어플리케이션 목록 화면)에 있는 통합 메시지 어플리케이션에 해당하는 아이콘을 선택하여 실행할 수 있다. 제어부는 상기 아이콘을 선택 하는 사용자 입력에 응답하여, 통합 메시지 어플리케이션 실행을 제어할 수 있고, 실행화면<710>과 같이 표시부 를 통해 사용자에게 대화상대를 선택할 수 있는 대화상대 선택창을 출력할 수 있다. 상기 대화상대 선택창에서 사용자 입력(예: 터치)에 의해 “기대한 책임”이라는 특정 대화상대가 선택되면, 제 어부는 503 동작에서와 같이 “기대한 책임”과 통합 메시지 어플리케이션을 통하여 메시지를 송수신한 이 력이 있는지 판단한다. 이때, 통합 메시지 어플리케이션을 통하여 “기대한 책임”과 메시지를 송수신한 이력이 없는 경우, 제어부 는 603 동작에서와 같이 기대한 책임에게 전송 가능한 메시지 형식을 분석한다. 분석 결과, 기대한 책임의 전화번호가 전자장치의 전화번호부에 등록되어 있고, 제1 메시지 형식(예: SMS1), 제2 메시지 형식(예: Chat on)과 제3 메시지 형식(예: Hang out)이라는 인스턴트 메신저 어플리케이션의 친구로 등록되어 있으며, 전자장치가 SIM1과 SIM2를 지원하는 경우, 제어부는 605 동작에서와 같이 분석된 메시지 형식 각각에 해당하는 아이콘 및 탭을 생성한다. 여기서 추가로 제어부는 SIM1이나 SIM2 중 어느 하나의 가입자 식별번호를 이용할 것인지 사용자에게 선택 할 수 있도록 실행화면<720>을 표시부를 통해 출력할 수 있다. 이와 달리, 전자장치가 하나의 SIM을 지원하는 경우 실행화면<720>의 표시는 생략될 수 있다. 실행화면<720>에서 사용자에 의해 SIM1이 선택되면, 제어부는 사용자 선택에 대응하는 대화상대(예: 기대 한 책임)과 대화를 위한 대화방을 표시한다. 상기 대화방은 실행화면<730>에 도시한 바와 같이 메시지 표시영역 및 메시지 작성영역로 구분될 수 있다. 제어부은 607 동작에서와 같이 상기 대화방을 표시할 때, 상기 메시지 형식 분석에 대응하여 생성된 아이콘 및 탭을 대화방의 메시지 작성영역에 출력한다. 상 기 탭은 “기대한 책임”에게 전송 가능한 메시지 형식들을 표시하고, 사용자가 어느 하나를 선택할 수 있도록 제공된다. 실행화면<730>의 대화방은 SIM1을 기반으로 SMS/LMS/MMS의 메시지를 전송할 수 있는 SMS1 탭과, Chat on 메신저 어플리케이션의 메시지를 전송할 수 있는 탭 및 Hang out 메신저 어플리케이션의 메시지를 전송할 수 있는 탭을 표시한다. 만약, 탭들이 한 화면에 표시될 수 없는 경우, 스크롤을 이용하여 다수의 탭들을 표시할 수 있다. 탭(740~746) 하단에 메시지 작성창이 표시될 수 있고, 메시지 작성창의 인접한 영역에 메시지 전송 명령 입력을 위한 아이콘이 표시될 수 있다. 실행화면<720>에서 실행화면<730>으로 전환될 때, 전자장치는 탭(740~746)의 인접한 영역에 “전송방식 탭 을 선택해주세요”라는 알림 문구를 출력함으로써, 사용자에게 다양한 메시지 전송방식을 선택할 수 있음 을 인지하도록 해준다. 이후, 사용자에 의해 어느 하나의 탭(예: SMS1 탭)이 선택되면, 실행화면<740>과 같이 “SMS1 전송방식을 선택하셨습니다.”와 같은 알림 문구를 출력함으로써, 사용자가 선택한 탭을 확인할 수 있도록 한다. 도 5를 기준으로 도 9를 참조하여 설명하면, 도 5의 501 동작에서와 같이 통합 메시지 어플리케이션이 실행되면, 제어부는 표시부를 통해 도 9의 <750>과 같은 실행화면을 표시할 수 있다. 예를 들면, 사 용자가 특정 대화상대에게 메시지를 전송하기 위해 바탕화면(또는, 홈 화면, 어플리케이션 목록 화면)에 있는통합 메시지 어플리케이션에 해당하는 아이콘을 선택하여 실행할 수 있다. 제어부는 상기 아이콘을 선택하 는 사용자 입력에 응답하여, 통합 메시지 어플리케이션 실행을 제어할 수 있고, 실행화면<750>과 같이 표시부 를 통해 사용자에게 대화상대를 선택할 수 있는 대화상대 선택창을 출력할 수 있다. 상기 대화상대 선택창에서 사용자 입력(예: 터치)에 의해 “김대리님”이라는 특정 대화상대가 선택되면, 제어 부는 503 동작에서와 같이 “김대리님”과 통합 메시지 어플리케이션을 통하여 메시지를 송수신한 이력이 있는지 판단한다. 이때, 통합 메시지 어플리케이션을 통하여 “김대리님”과 메시지를 송수신한 이력이 있는 경우, 제어부는 505동작에서와 같이 “김대리님”에게 최근에 전송한 메시지 형식이나 해당 대화방의 메시지 작성창에 대해 저 장된 드래프트 메시지에 해당하는 메시지 형식을 파악한다. 도 9에서는, 제1 메시지 형식(예: SMS1), 제2 메시 지 형식(예: SMS2), 제3 메시지 형식(예: Chat on), 및 제4 메시지 형식(예: Hang out)이라는 메시지 형식인 것을 예시로 나타낸다. 제어부는 507 동작에서와 같이 실행화면<760>과 같이 표시부를 통해 “김대리님”과 대화할 수 있는 대화방을 표시한다. 이때 상기 대화방에는 “김대리님”에게 전송 가능한 어느 하나의 메시지 형식(예: 제1 내 지 제4 메시지 형식)을 선택할 수 있는 탭(예: SMS1 탭, SMS2 탭, Chat on 탭, Hang out 탭 )을 표시하며, 이때 최근에 사용한 메시지 형식에 해당하는 탭(예: SMS2 탭)을 활성화 표시하거나, 작성창에 저장된 드래프트 메시지의 형식에 해당하는 탭을 활성화 표시한다. 실행화면<760>의 대화방에서는 이 전에 “김대리님”에게 보낸 메시지 형식에 해당하는 SMS2 탭을 활성화 표시한다. 활성화 표시는 SMS2 탭 을 하이라이트 처리하거나, SMS2 탭을 메시지 작성영역에서 숨겼다가 출력하는 수행을 반복하는 깜박 이 처리하거나, 선택되지 않은 다른 탭들(740, 742, 746)과 비교하여 선택된 SMS2 탭에 대조되는 다른 색 상, 다른 모양, 다른 무늬를 이용할 수 있다. 509 동작에서와 같이 제어부는 메시지 작성영역의 탭 선택 변경 여부를 판단할 수 있다. 예를 들어, 대화 상대와의 메시지 형식에 대응하는 복수의 탭들 중 최근에 사용된 메시지 형식에 대응하는 탭을 자동 활성화할 수 있고, 자동 활성화된 탭 외의 다른 탭의 선택이 있는지 여부를 판단할 수 있다. 509동작에서 제어부는 사용자에 의해 탭 선택 변경이 검출되지 않는 경우, 도 10의 실행화면<810>과 같이 탭 변경 없이 자동 활성화된 탭(예: SMS2 탭)을 그대로 표시한다. 실행화면<810>에서와 같이 사용자가 SMS2 탭이 활성화된 상태에서 “대리님 회의 동영상 부탁드려요”라는 메시지를 전송(예: 전송 명령을 위한 아이콘 855 선택(터치))하면, 실행화면<820>과 같이 대화방에 사용자 입력 에 대응하는 메시지(“대리님 회의 동영상 부탁드려요”)가 말풍선에 담겨 표시되고, 말풍선 내의 메시지의 하 단에는 해당 메시지 형식에 대한 메시지 정보(예: SMS)가 표시되고, 말풍선 앞에는 해당 메시지 형식에 따 라 메시지를 전송하는 사용자의 사용자 정보(예: 식별정보, SIM2)에 해당하는 사용자의 전화번호(010-3333- 4444)가 출력된다. 또한 대화상대(예: 김대리님)으로부터 수신한 IM 메시지가 대화방에 표시된다. 이때, IM 메시지가 Chat on 메신 저 어플리케이션의 메시지라는 메시지 정보가 말풍선 내에 표시된다. 509 동작에서 제어부는 사용자에 의해 탭 선택 변경을 검출하는 경우, 511 동작에서와 같이 사용자에 의해 선택된 탭을 활성화 하여 표시한다. 예를 들어, 제어부는 도 11의 실행화면<830>과 같이 SMS2 탭이 ID1(mama21) 탭으로 선택 변경되는 것을 검출한다. 사용자에 의한 탭 선택 변경은 어느 하나의 탭에 대해 발생한 터치 이벤트, 롱 프레스, 탭으로부터 작성창(message composer)까지 드래그 앤 드롭 이벤트 등을 통해 구현될 수 있다. 이를 통해 과거 이력에 의해 활성화된 탭이 이와 같은 사용자의 선택에 의해 변경될 수 있다. 511 동작에서와 같이 제어부는 선택 변경된 탭을 활성화 표시할 때, 해당 탭을 하이라이트 처리하거나, 탭 을 메시지 작성영역에서 숨겼다가 출력하는 수행을 반복하는 깜박이 처리하거나, 선택되지 않은 다른 탭들과 비 교하여 선택된 탭에 대조되는 다른 색상, 다른 모양, 다른 무늬를 이용할 수 있다. 이와 더불어 제어부는 탭이 변경된 사실을 사용자에게 확인시켜주기 위해 “Chat on(ID1) 전송 방식을 선택하였습니다”라는 안내문구 를 표시부를 통해 출력한다. 이후, 제어부는 513 동작에서와 같이 통합 메시지 어플리케이션의 해당 기능을 수행한다. 실행화면<830>과 같이, 제어부는 메시지 작성창을 통해 메시지를 입력받고, 사용자에 의해 전송 명령이 요청되면, 대화상대 (예: 김대리님)에게 메시지를 전송하고, 대화방에 말풍선으로 메시지를 표시한다. 여기서, 사용자는 먼저 메시 지 작성창에 정보를 입력하고, 다음으로 전송할 메시지 타입을 정하기 위해 탭 선택을 하고, 전송 아이콘을 실행시킬 수 있다. 또는, 상술한 순서와 반대로 사용자는 먼저 탭을 선택하여 전송할 메시지 타입을 정하고, 다음 으로 메시지 작성창에 정보를 입력한 후, 전송 아이콘을 실행시킬 수 있다. 실행화면<840>은 Chat on 인스턴트 메신저 어플리케이션을 기반으로 대화상대에게 메시지를 전송하고, 동영상을 첨부하여 전송한 상황을 나타낸다. 예를 들어, 실행화면<840>에서와 같이 사용자가 ID1(mama21) 탭이 활성 화된 상태에서 메시지를 전송하면, 대화방에 사용자 입력에 대응하는 메시지(“네 저도 챗온 통해서 첨부드릴께 요”, 첨부파일)가 각각의 말풍선에 담겨 표시된다. 앞서 또한 살펴본 바와 같이 말풍선 내의 메시지의 하단에 는 해당 메시지 형식에 대한 메시지 정보(예: Chat on)가 표시되고, 말풍선 앞에는 해당 메시지 형식에 따 라 메시지를 전송하는 사용자의 사용자 정보(예: 식별정보, ID1)에 해당하는 사용자의 아이디(mama21)가 출력된다. 실행화면<810>, <820>, <830> 및 <840>과 같이 각 메시지가 어떠한 메시지 전송타입(SMS/LMS/MMS, IM)과 어떠 한 전송 구분자(IM/ID, 전화번호, SIM)로 발신되었는지 표시할 수 있다. 한편, 통합 메시지 어플리케이션은 특정 대화상대와 주고받은 메시지들을 시간순으로 정렬할 수 있다. 반대로 시간의 역순으로 정렬할 수도 있다. 또한 도시하지 않았지만, 메시지들을 메시지 형식별로 분류하여 새로운 대 화창에 표시할 수 있다. 기본적으로는 IM 및 SMS/LMS/MMS 방식의 송수신 메시지와, 서로 다른 SIM(SIM1, SIM2), 서로 다른 ID(ID1: mama21, SKH), 서로 다른 전화번호를 기반으로 송수신된 메시지가 하나의 대화방에 함께 표시될 수 있다. 상술한 바와 같이 본 발명의 통합 메시지 어플리케이션은 하나의 대화방에서 다양한 전송 타입(SMS/LMS/MMS, IM) 또는 전송 구분자(IM/ID, 전화번호, SIM) 중 하나를 선택하여 메시지를 발신할 수 있도록 한다. 이에 따라 사용자에게 발신 방법 선택에 있어서 직관적인 UI를 제공하므로, 사용자가 간편하고 편리하게 원하는 메시지 형 식으로 발신할 수 있다. 뿐만 아니라 본 발명의 통합 메시지 어플리케이션의 편리한 발신 방법에 의해 메시지 형식에 따른 과금 정책에 유리한 메시지를 빠르고 편리하게 보낼 수 있다. 예를 들어, 통합 메시지 어플리케이 션을 이용한 메시지 발신에 있어서, SMS/LMSD/MMS를 이용한 통신방식이 저렴한 상황이고, 멀티 SIM 단말에서 특 정 SIM이 저렴한 상황일 경우, 사용자는 상기 특정 SIM에 해당하는 SMS 메시지 형식을 메시지 작성영역에서 바 로 선택하여 메시지를 발신할 수 있다. 또한, 저장된 드래프트 메시지를 복구하는 경우, 복수의 메시지 형식 각각에 해당하는 드래프트 메시지를 저장 하고, 복구할 수 있으므로, 종래에 메시지 어플리케이션에서 제공된 하나의 작성창에 대한 하나의 드래프트 메 시지보다 많은 드래프트 메시지를 저장하고 이용할 수 있다. 본 발명에서 사용된 용어 “모듈”은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어 (firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위 (unit)를 의미할 수 있다. “모듈”은, 예를 들면, 유닛 (unit), 로직 (logic), 논리 블록 (logical block), 부품 (component), 또는 회로 (circuit) 등의 용어와 바꾸어 사용 (interchangeably use)될 수 있다. “모듈”은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. “모듈”은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. “모듈”은 기계적 으로 또는 전자적으로 구현될 수 있다. 예를 들면,“모듈”은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행 하는 ASIC (application-specific integrated circuit) 칩, FPGAs (field-programmable gate arrays) 또는 프 로그램 가능 논리 전자 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 전자 장치 (예: 모듈들 또는 그 기능들) 또는 방법 (예: 동작들)의 적어도 일부는, 예컨 대, 프로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체 (computer-readable storage media)에 저장된 명 령어로 구현될 수 있다. 명령어는, 프로세서 (예: 프로세서 120)에 의해 실행될 경우, 하나 이상의 프로세서가 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리 가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체 (magnetic media)(예: 자기테이 프), 광기록 매체 (optical media)(예: CD-ROM (compact disc read only memory), DVD (digital versatile disc), 자기-광 매체 (magneto-optical media)(예: 플롭티컬 디스크 (floptical disk)), 하드웨어 전자 장치 (예: ROM (read only memory), RAM (random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또 한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해 서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 전자 장치는 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가 지다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱 (heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 다양 한 실시 예의 범위를 한정하는 것은 아니다. 따라서, 본 발명의 다양한 실시 예의 범위는, 본 발명의 다양한 실 시 예의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2015-0015076", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 전자 장치의 블록도를 도시한다. 도 2는 본 발명의 실시 예에 따른 전자 장치의 상세 블록도를 도시한다. 도 3은 본 발명의 다양한 실시 예에 따른 프로그램 모듈의 블록도를 도시한다. 도 4는 본 발명의 실시예에 따른 전자장치의 구성을 개략적으로 도시한 블록도이다. 도 5는 본 발명의 실시 예에 따른 통합 메시지 어플리케이션 운용방법을 설명하기 위한 순서도이다. 도 6은 본 발명의 실시 예에 따른 통합 메시지 어플리케이션 운용방법을 설명하기 위한 순서도이다. 도 7 내지 도 11은 본 발명의 실시 예에 따른 통합 메시지 어플리케이션의 실행화면 예시를 나타낸 도면들이다."}
