{"patent_id": "10-2023-0020153", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0127134", "출원번호": "10-2023-0020153", "발명의 명칭": "스마트 안전관리 시스템", "출원인": "(주)휴넷가이아", "발명자": "정희자"}}
{"patent_id": "10-2023-0020153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트팩토리의 생산관리시스템(MES)에 연동 가능한 스마트 안전관리 시스템에 있어서, 스마트팩토리의 제조공간에 설치되거나 작업자가 휴대 또는 착용하여 주변의 제조환경정보를 감지할 수 있는 환경센서; 상기 제조공간의 환경을 변화시킬 수 있는 환경제어장치; 상기 작업자에게 정보를 전달할 수 있는 정보전달장치; 상기 환경센서에 감지되는 제조환경정보를 수집하는 데이터로거 디바이스; 상기 데이터로거 디바이스에 수집되는 제조환경정보를 모니터링할 수 있는 모니터링 단말; 및 상기 데이터로거 디바이스에 수집되는 제조환경정보를 분석하여 안전관리 이상 여부를 판단하는 연산부와, 상기연산부에서 판단된 안전관리 이상에 대응하여 상기 환경제어장치와 상기 정보전달장치의 작동을 제어하는 제어부가 구비된 통합관제 서버;를 포함하는 것을 특징으로 하는 스마트 안전관리 시스템."}
{"patent_id": "10-2023-0020153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 환경센서는, 감지할 수 있는 제조환경정보에 소음, 진동, 온도, 습도, CO2, VOCs, 미세먼지, 침수, 화재또는 유해가스, 작업자의 생체정보 또는 위치 중 선택된 어느 하나 이상을 포함하는 것을 특징으로 하는 스마트안전관리 시스템."}
{"patent_id": "10-2023-0020153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 연산부는, 판단할 수 있는 안전관리의 종류로 환경안전, 소방안전, 작업자안전을 포함하되, 상기 환경센서에서 감지된 제조환경정보에서 소음, 진동, 온도, 습도, CO2, VOCs, 미세먼지 중 어느 하나 이상이 설정된 적정범위를 이탈했다고 분석된 경우 환경안전 이상으로 판단하고, 상기 환경센서에서 감지된 제조환경정보에서 침수, 화재 또는 유해가스가 감지된 경우 소방안전 이상으로 판단하며, 상기 환경센서에서 감지된 제조환경정보에서 작업자의 생체정보 또는 위치에 이상이 있다고 분석된 경우 작업자안전 이상으로 판단하는 것을 특징으로 하는 스마트 안전관리 시스템."}
{"patent_id": "10-2023-0020153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 환경제어장치는, 창문개폐기, 공조기, 광량제어기, 환풍기 및 소화기를 포함하고; 상기 제어부는, 상기 연산부에서 안전관리 이상으로 판단된 경우 소정의 기준에 따라 상기 창문개폐기, 공조기,광량제어기, 환풍기 및 소화기 중 설정된 환경제어장치를 작동시킴과 동시에 상기 정보전달장치를 작동시키는것을 특징으로 하는 스마트 안전관리 시스템."}
{"patent_id": "10-2023-0020153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 공개특허 10-2024-0127134-3-상기 정보전달장치는, 상기 작업자에게 청각적으로 정보를 전달하는 스피커, 상기 작업자에게 시각적으로 정보를 전달하는 디스플레이 및 상기 작업자에게 물리적 자극을 통해 정보를 전달하는 웨어러블 자극발생기 중 선택된 어느 하나 이상의 조합으로 이루어지는 것을 특징으로 하는 스마트 안전관리 시스템."}
{"patent_id": "10-2023-0020153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 하나의 항에 있어서, 상기 스마트 안전관리 시스템은, 상기 데이터로거 디바이스에 수집되는 제조환경정보와, 외부기관으로부터 제공되는 환경데이터를 빅데이터로 학습한 인공지능 모델을 통해 상기 제조공간의 환경오염 발생을 안전 단계별로 예측하는 인공지능 서버;를 더 포함하고, 상기 제어부는, 상기 인공지능서버에서 환경오염 발생이 예측된 경우 예측된 안전 단계별로 정해진 기준에 따라상기 환경제어장치와 상기 정보전달장치의 작동을 제어하는 것을 특징으로 하는 스마트 안전관리 시스템."}
{"patent_id": "10-2023-0020153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 스마트 안전관리 시스템은, 상기 연산부에서 안전관리 이상이 판단되거나 상기 인공지능 서버에서 환경오염 발생이 예측되는 경우를 가정하여 상기 환경제어장치와 상기 정보전달장치가 작동되는 상태를 가상현실(VR) 또는 증강현실(AR) 환경에서 시뮬레이션함과 동시에 작업자가 취해야 하는 행동을 교육시킬 수 있는 안전교육 서버;를 더 포함하는 것을 특징으로 하는 스마트 안전관리 시스템."}
{"patent_id": "10-2023-0020153", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트 안전관리 시스템에 관한 것으로, 보다 상세하게는 스마트팩토리의 생산관리시스템(MES)을 고도 화시킬 수 있도록 제조공간의 제조환경정보를 감지하고, 안전관리 이상을 판단하여 자동으로 안전조치를 함으로 써 작업자의 안전을 도모하고 제조공간을 유해환경으로부터 보호할 수 있는 스마트 안전관리 시스템에 관한 것이 (뒷면에 계속)"}
{"patent_id": "10-2023-0020153", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 안전관리 시스템에 관한 것으로, 보다 상세하게는 스마트팩토리의 생산관리시스템(MES)을 고 도화시킬 수 있도록 제조공간의 제조환경정보를 감지하고, 안전관리 이상을 판단하여 자동으로 안전조치를 함으 로써 작업자의 안전을 도모하고 제조공간을 유해환경으로부터 보호할 수 있는 스마트 안전관리 시스템에 관한 것이다."}
{"patent_id": "10-2023-0020153", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 스마트 팩토리는 설계, 개발, 제조, 유통, 물류 등의 각종 생산과정에 디지털 자동화 솔루션이 결합 된 정보통신기술(ICT)을 적용하여 생산성과 품질 및 고객만족도를 향상시킬 수 있도록 하는 지능형 생산공장으 로 정의할 수 있으며, 공장 내 설비와 기계에 사물인터넷(IoT) 등을 접목하여 공정 데이터를 실시간으로 수집하 고 이를 분석해 목적된 바에 따라 스스로 제어할 수 있는 공장을 의미한다. 즉, 사전적 의미일 수는 있으나, 생산 전략에 기반을 둔 제조 여건 변화에 유연하게 대응하고, 공급망 관리 (Supply Chain Management, SCM) 통합 관점의 QCD(Quality, Cost, Delivery) 및 제약 관리로 생산 운영을 신뢰 성 있게 수행할 수 있도록 하는 지능형 공장이라 할 수 있다. 최근 가볍고 유연한 생산체계가 요구됨에 따라 스마트 팩토리는 제조업 혁신 방안으로서 대두되고 있다. Markets&Markets에 따르면, 한국의 스마트팩토리 시장 규모는 2018년 기준 약 80.6억 달러에 달하며, 2024년에 는 1.9배 규모인 약 152.8억 달러 규모를 형성할 것으로 전망되고, 한국의 스마트 팩토리 시장 연평균 성장률은 11.4%로 글로벌 시장에 비해 빠른 속도로 성장할 것으로 예측되고 있다. 글로벌 스마트 팩토리 시장규모는 2018년 기준 약 1,410.8억 달러에 달하며, 2024년에는 1.7배 규모인 약 2,448.2억 달러 규모를 형성할 것으로 전망되고, 세계 스마트 팩토리 시장 연평균 성장률은 9.8%로 최근 5년간 의 전년 대비 성장률보다 높으며, 시장의 크기는 과거에 비해 더 빠르게 성장할 것으로 예측되고 있다. 한편, 스마트팩토리의 플랫폼으로서 생산관리시스템(MES; Manufacturing Execution System)은 제조실행시스템이 라고도 불리는데, 이는 제조업체의 공장 관리를 위한 개념이자 구현 도구이다.MESA 인터내셔널에서 정의하는 생산관리시스템(MES)은 다음과 같은 일반적인 기본 기능 11개를 포함하고 있다. 즉, 생산관리시스템(MES)은 통상 자원 할당과 상태 관리(resource allocation status), 작업과 상세 일정 관리 (operation/detail scheduling), 생산 단위 분배(dispatching production units), 문서 제어(document control), 데이터 집계와 취득(data collection/acquisition), 근로 관리(labor management), 품질 관리 (quality management), 공정 관리(process control), 유지보수 관리(maintenance management), 생산추적과 이 력(product tracking and genealogy), 실행 분석(performance analysis) 기능을 포함하고 있다. 종래기술로 대한민국 공개특허공보 제10-2019-0106612호(2019.09.18. 공개)에는 '클라우드 기반의 스마트 공장 생산운영관리시스템'이 제안된 바 있고, 대한민국 공개특허공보 제 제10-2022-0110943호(2022.08.09. 공개)에는 '스마트 팩토리 구현을 위한 제어 및 관리 시스템'이 제안된 바 있으며, 대한민국 공개특허공보 제 10-2022- 0099497호(2022.07.13. 공개)에는 '스마트 팩토리 관리 시스템'이 제안된 바 있다. 하지만, 상기 종래기술들과 같은 기존의 스마트팩토리 생산관리시스템(MES)은 제조공정의 데이터 생산 및 관리 에 역점을 둔 스마트화에 중점을 두고 있는 것으로, 생산관리시스템(MES)을 통해 안전관리는 이루어지지 않아 환경안전, 소방안전 및 작업자안전 등에 대한 대비가 부족한 문제점이 있었고, 대비 부족으로 인해 작업중 사고 로 인한 인명피해나 재산손실 피해가 끊이질 않는 문제점이 있었다. 한편, 산업안전보건법에서 근로자에 대한 안전보건교육을 의무화하도록 규정하여, 사업주가 이를 수행하고 있다. 하지만 안전교육 이수만으로 작업자의 안전을 보장할 수 없는 현실에서 이를 보조 및 보강할 수 있는 스마트 안 전관리 시스템이 필요한 실정이다."}
{"patent_id": "10-2023-0020153", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래기술의 문제점을 해결하기 위하여 안출된 것으로, 본 발명의 목적은 제조공간의 제 조환경정보를 감지하고, 안전관리 이상을 판단하여 자동으로 안전조치를 할 수 있는 스마트팩토리의 생산관리시 스템(MES)에 연동 가능한 스마트 안전관리 시스템을 제공하는 데에 있다."}
{"patent_id": "10-2023-0020153", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하고자 본 발명에 따른 스마트팩토리의 생산관리시스템(MES)에 연동 가능한 스마트 안 전관리 시스템은 스마트팩토리의 제조공간에 설치되거나 작업자가 휴대 또는 착용하여 주변의 제조환경정보를 감지할 수 있는 환경센서; 상기 제조공간의 환경을 변화시킬 수 있는 환경제어장치; 상기 작업자에게 정보를 전 달할 수 있는 정보전달장치; 상기 환경센서에 감지되는 제조환경정보를 수집하는 데이터로거 디바이스; 상기 데 이터로거 디바이스에 수집되는 제조환경정보를 모니터링할 수 있는 모니터링 단말; 및 상기 데이터로거 디바이 스에 수집되는 제조환경정보를 분석하여 안전관리 이상 여부를 판단하는 연산부와, 상기 연산부에서 판단된 안 전관리 이상에 대응하여 상기 환경제어장치와 상기 정보전달장치의 작동을 제어하는 제어부가 구비된 통합관제 서버;를 포함하는 것을 특징으로 한다. 여기서, 상기 환경센서는 감지할 수 있는 제조환경정보에 소음, 진동, 온도, 습도, CO2, VOCs, 미세먼지, 침수, 화재 또는 유해가스, 작업자의 생체정보 또는 위치 중 선택된 어느 하나 이상을 포함하는 것을 특징으로 한다. 여기서, 상기 연산부는 판단할 수 있는 안전관리의 종류로 환경안전, 소방안전, 작업자안전을 포함하되, 상기 환경센서에서 감지된 제조환경정보에서 소음, 진동, 온도, 습도, CO2, VOCs, 미세먼지 중 어느 하나 이상이 설 정된 적정범위를 이탈했다고 분석된 경우 환경안전 이상으로 판단하고, 상기 환경센서에서 감지된 제조환경정보 에서 침수, 화재 또는 유해가스가 감지된 경우 소방안전 이상으로 판단하며, 상기 환경센서에서 감지된 제조환 경정보에서 작업자의 생체정보 또는 위치에 이상이 있다고 분석된 경우 작업자안전 이상으로 판단하는 것을 특 징으로 한다. 여기서, 상기 환경제어장치는 창문개폐기, 공조기, 광량제어기, 환풍기 및 소화기를 포함하고, 상기 제어부는 상기 연산부에서 안전관리 이상으로 판단된 경우 소정의 기준에 따라 상기 창문개폐기, 공조기, 광량제어기, 환 풍기 및 소화기 중 설정된 환경제어장치를 작동시킴과 동시에 상기 정보전달장치를 작동시키는 것을 특징으로한다. 여기서, 상기 정보전달장치는 상기 작업자에게 청각적으로 정보를 전달하는 스피커, 상기 작업자에게 시각적으 로 정보를 전달하는 디스플레이 및 상기 작업자에게 물리적 자극을 통해 정보를 전달하는 웨어러블 자극발생기 중 선택된 어느 하나 이상의 조합으로 이루어지는 것을 특징으로 한다. 또한, 본 발명에 따른 스마트 안전관리 시스템은 상기 데이터로거 디바이스에 수집되는 제조환경정보와, 외부기 관으로부터 제공되는 환경데이터를 빅데이터로 학습한 인공지능 모델을 통해 상기 제조공간의 환경오염 발생을 안전 단계별로 예측하는 인공지능 서버;를 더 포함하고, 상기 제어부는 상기 인공지능서버에서 환경오염 발생이 예측된 경우 예측된 안전 단계별로 정해진 기준에 따라 상기 환경제어장치와 상기 정보전달장치의 작동을 제어 하는 것을 특징으로 한다. 또한, 본 발명에 따른 스마트 안전관리 시스템은 상기 연산부에서 안전관리 이상이 판단되거나 상기 인공지능 서버에서 환경오염 발생이 예측되는 경우를 가정하여 상기 환경제어장치와 상기 정보전달장치가 작동되는 상태 를 가상현실(VR) 또는 증강현실(AR) 환경에서 시뮬레이션함과 동시에 작업자가 취해야 하는 행동을 교육시킬 수 있는 안전교육 서버;를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0020153", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 구성에 의하여 본 발명에 따른 스마트 안전관리 시스템은 환경안전으로서 작업현장에 대한 안전관 리 항목으로서 제품생산 과정에서 발생하는 각종 환경 유해요소를 사전에 제거함으로써 제품의 품질에 대한 보 증과 작업자 안전을 동시에 달성할 수 있는 장점이 있다. 또한, 본 발명에 따른 스마트 안전관리 시스템은 소방안전으로서 작업공간 내에서의 정전이나 화재발생, 침수발 생, 유해가스 유출을 신속히 탐지하여 경보를 울리고 필요시 긴급조치를 취할 수 있는 장점이 있다. 또한, 본 발명에 따른 스마트 안전관리 시스템은 작업자안전으로서 작업자의 작업위치 이탈을 파악하고, 넘어짐 이나 추락을 감지하며, 유해가스 노출에 대한 안전탐지 기능을 부여할 수 있는 장점이 있다."}
{"patent_id": "10-2023-0020153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면에 도시된 실시예를 참조하여 본 발명에 따른 스마트 안전관리 시스템을 상세하게 설명하기로 한다. 도 1은 본 발명의 일실시예에 따른 스마트 안전관리 시스템의 구성도이고, 도 2는 본 발명의 일실시예에 따른 모니터링 단말의 화면 예시도이며, 도 3은 본 발명의 일실시예에 따른 인공지능 서버의 개념도이고, 도 4는 본 발명의 일실시예에 따른 스마트팩토리의 생산관리시스템(MES) 구성도이다. 도 1을 살펴보면, 본 발명의 일실시예에 따른 스마트 안전관리 시스템은 스마트팩토리의 생산관리시스템(MES)에 연동 가능한 시스템으로서 환경센서, 환경제어장치, 정보전달장치, 데이터로거 디바이스, 모니 터링 단말, 통합관제 서버, 인공지능 서버 및 안전교육 서버를 포함한다. 스마트팩토리의 생산관리시스템(MES)은 도 4에 도시된 바와 같이 통상적인 관리로서 영업관리, 자재관리, 생산 관리, 재고관리, 품질관리, 설비관리 등을 포함할 수 있고, 본 발명의 일실시예에서는 상기와 같은 통상적인 생 산관리시스템(MES)에 추가로 안전관리를 연동시키려는 것이다. 여기서, 안전관리는 환경안전, 소방안전, 작업자안전 항목으로 세분될 수 있고, 이에 대한 상세한 설명은 후술 하기로 한다. 상기 환경센서는 스마트팩토리의 제조공간에 설치되거나 작업자가 착용하여 주변의 제조환경정보를 감지할 수 있는 구성이다. 상기 환경센서는 제조공간에 고정형으로 설치될 수도 있고, 이동 및 휴대형으로 설계되어 작업자가 휴대 또 는 착용하도록 구성될 수도 있다. 제조공간에 고정형으로 설치되는 환경센서는 소음 및 진동센서, 온도 및 습도센서, CO2 센서, VOCs 센서, 미 세먼지 센서 등이 하나의 장치에 통합된 형태로 구성될 수 있다. 한편, 작업자가 휴대 또는 착용하는 환경센서는 작업자가 헬멧 또는 가슴 부근에 착용한 상태로 주변 영상 의 촬영이 가능한 스마트캠이나, 작업자가 손목에 착용한 상태로 심박수 등의 생체신호를 감지할 수 있는 생체 신호감지센서, GPS 및 자이로센서 등이 내장된 스마트워치 등으로 구성될 수 있다. 물론, 제조공간에 고정형으로 설치되는 환경센서와 같은 기능을 같는 장치를 휴대형으로 제작하여 작업자가 휴대하도록 구성할 수도 있다. 본 발명의 일실시예에서 상기 환경센서는 감지할 수 있는 제조환경정보에 소음, 진동, 온도, 습도, CO2, VOCs, 미세먼지, 침수, 화재 또는 유해가스, 작업자의 생체정보 또는 위치 중 선택된 어느 하나 이상을 포함할 수 있다. 상기 환경제어장치는 통합관제 서버의 제어부에 의해 작동이 제어되며 제조공간의 환경을 변화시킬 수 있는 장치이다. 본 발명의 일실시예에서 상기 환경제어장치는 창문개폐기, 공조기, 광량제어기, 환풍기 및 소화기를 포함하 고, 통합관제 서버의 연산부에서 안전관리 이상으로 판단된 경우 소정의 기준에 따라 상기 창문개폐기, 공조기, 광량제어기, 환풍기 및 소화기 중 설정된 장치가 작동되도록 제어된다. 상기 정보전달장치는 통합관제 서버의 제어부에 의해 작동이 제어되며 상기 작업자에게 정보를 전 달할 수 있는 장치이다. 본 발명의 일실시예에서 상기 정보전달장치는 상기 작업자에게 청각적으로 정보를 전달하는 스피커, 상 기 작업자에게 시각적으로 정보를 전달하는 디스플레이 및 상기 작업자에게 물리적 자극을 통해 정보를 전 달하는 웨어러블 자극발생기 중 선택된 어느 하나 이상의 조합으로 이루어질 수 있다. 특히, 상기 웨어러블 자극발생기의 경우 작업자에게 강한 진동이나 전기충격과 같은 강한 물리적 자극을 전 달함으로써 사고 등으로 잠시 정신을 잃은 작업자가 정신을 차릴 수 있게 도움을 줄 수 있는 효과를 기대할 수 도 있다. 상기 데이터로거 디바이스는 상기 환경센서에 감지되는 제조환경정보를 수집하는 구성이다. 상기 데이터로거 디바이스는 상기 환경센서, 모니터링 단말, 통합관제 서버 및 인공지능 서버 에 통신망으로 연결되어 상기 환경센서에 감지되는 제조환경정보를 송수신 가능하도록 구성된다. 상기 모니터링 단말은 상기 데이터로거 디바이스에 수집되는 제조환경정보를 모니터링할 수 있는 구성 이다. 상기 모니터링 단말은 통신망을 상기 데이터로거 디바이스에 접속할 수 있는 컴퓨터, 태블릿 및 스마트 폰 등으로 구성될 수 있고, 전용 모니터링 프로그램, 애플리케이션(앱) 또는 웹을 통해 제조환경정보를 모니터 링할 수 있도록 구성된다. 도 2에는 상기 모니터링 단말에서 표시되는 화면을 예시하였고, 접속할 수 있는 권한이 있는 사용자만 상기 모니터링 단말을 통해 상기 데이터로거 디바이스에 수집되는 제조환경정보를 모니터링할 수 있도록 구 성하는 것이 바람직하다. 상기 통합관제 서버는 안전관리 이상 여부를 판단하고 그에 따른 자동 조치를 할 수 있도록 하는 구성으로 본 발명의 일실시예에서는 연산부와, 제어부가 구비된다. 상기 연산부는 상기 데이터로거 디바이스에 수집되는 제조환경정보를 분석하여 안전관리 이상 여부를 판단하는 구성이다. 본 발명의 일실시예에서 상기 연산부는 판단할 수 있는 안전관리의 종류로 환경안전, 소방안전, 작업자안전 을 포함한다. 보다 구체적으로 상기 연산부는 상기 환경센서에서 감지된 제조환경정보에서 소음, 진동, 온도, 습도, CO2, VOCs, 미세먼지 중 어느 하나 이상이 설정된 적정범위를 이탈했다고 분석된 경우 환경안전 이상으로 판단 한다. 또한, 상기 연산부는 상기 환경센서에서 감지된 제조환경정보에서 침수, 화재 또는 유해가스가 감지된 경우 소방안전 이상으로 판단한다. 또한, 상기 연산부는 상기 환경센서에서 감지된 제조환경정보에서 작업자의 생체정보 또는 위치(또는 활동성)에 이상이 있다고 분석된 경우 작업자안전 이상으로 판단한다. 상기 제어부는 상기 연산부에서 판단된 안전관리 이상에 대응하여 상기 환경제어장치와 상기 정보 전달장치의 작동을 제어하고, 후술할 인공지능 서버에서 환경오염 발생이 예측된 경우 예측된 안전 단 계별로 정해진 기준에 따라 상기 환경제어장치와 상기 정보전달장치의 작동을 제어하는 구성이다. 보다 구체적으로 상기 제어부는 소정의 기준에 따라 창문개폐기, 공조기, 광량제어기, 환풍기 및 소화기 중 설정된 환경제어장치를 작동시킴과 동시에 정보전달장치를 작동시키도록 구성된다. 상기 인공지능 서버는 상기 데이터로거 디바이스에 수집되는 제조환경정보, 자가진단 환경예찰정보 및 외부기관으로부터 제공되는 환경데이터를 빅데이터로 학습한 인공지능 모델을 통해 상기 제조공간의 환경오염 발생을 안전 단계별로 예측하는 구성이다. 외부기관으로부터 제공되는 환경데이터는 기상청으로부터 제공되는 날씨데이터, 재해발생정보 등이 포함될 수 있다. 도 3에는 본 발명의 일실시예에 따른 인공지능 서버의 개념도를 도시하였다. 제조공간의 환경오염 발생을 안전 단계별로 예측하기 위해서는 인공지능 기계 학습(AI Machine Learning) 분류 기법 중 정확도가 높은 Support Vector Machine(SVM) 알고리즘 적용이 바람직하고, 안전등급에 따른 4단계 경보 조치와, 대응을 위해서는 4가지 분류에 필요한 Multi-Class SVM 기법 적용이 필요할 수 있다. 상기 안전교육 서버는 상기 연산부에서 안전관리 이상이 판단되거나 상기 인공지능 서버에서 환경 오염 발생이 예측되는 경우를 가정하여 상기 환경제어장치와 상기 정보전달장치가 작동되는 상태를 가 상현실(VR) 또는 증강현실(AR) 환경에서 시뮬레이션함과 동시에 작업자가 취해야 하는 행동을 교육시킬 수 있는 구성이다. 즉, 상기 안전교육 서버를 통해 작업자가 실제와 유사한 가상현실(VR) 또는 증강현실(AR) 환경에서 작업자 취해야 하는 행동을 교육받음으로써 재해 또는 사고 등의 발생시 신속한 조치가 가능하게 된다. 본 발명에 따른 스마트 안전관리 시스템은 도 4에 도시된 바와 같이 스마트팩토리의 생산관리시스템(MES)에 안 전관리를 연동시킴으로써 환경안전으로서 작업현장에 대한 안전관리 항목으로서 제품생산 과정에서 발생하는 각 종 환경 유해요소를 사전에 제거함으로써 제품의 품질에 대한 보증과 작업자 안전을 동시에 달성할 수 있고, 소 방안전으로서 작업공간 내에서의 정전이나 화재발생, 침수발생, 유해가스 유출을 신속히 탐지하여 경보를 울리 고 필요시 긴급조치를 취할 수 있으며, 작업자안전으로서 작업자의 작업위치 이탈을 파악하고, 넘어짐이나 추락 을 감지하며, 유해가스 노출에 대한 안전탐지 기능을 부여할 수 있게 되는 것이다. 앞에서 설명되고 도면에서 도시된 스마트 안전관리 시스템은 본 발명을 실시하기 위한 하나의 실시예에 불과하 며, 본 발명의 기술적 사상을 한정하는 것으로 해석되어서는 안된다. 본 발명의 보호범위는 이하의 특허청구범 위에 기재된 사항에 의해서만 정하여지며, 본 발명의 요지를 벗어남이 없이 개량 및 변경된 실시예는 본 발명이"}
{"patent_id": "10-2023-0020153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 자명한 것인 한 본 발명의 보호범위에 속한다고 할 것이다."}
{"patent_id": "10-2023-0020153", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 스마트 안전관리 시스템의 구성도 도 2는 본 발명의 일실시예에 따른 모니터링 단말의 화면 예시도 도 3은 본 발명의 일실시예에 따른 인공지능 서버의 개념도 도 4는 본 발명의 일실시예에 따른 스마트팩토리의 생산관리시스템(MES) 구성도"}
