{"patent_id": "10-2014-0068159", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0140021", "출원번호": "10-2014-0068159", "발명의 명칭": "위치 정보를 제공하기 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "허창룡"}}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "위치 정보를 제공하기 위한, 전자 장치의 운영 방법에 있어서,상기 전자 장치에서, 상기 전자 장치의 제 1 위치로부터 제 2 위치로의 이동에 반응하여, 상기 전자 장치의 위치 변화에 대응하는 경로 정보를 확인하는 동작; 및상기 전자 장치에서, 상기 경로 정보를 이용하여 상기 제 2 위치로부터 상기 제 1 위치까지의 경로에 대응하는가이드 정보를 제공하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 경로 정보는 제 1 경로 정보 및 제 2 경로 정보를 포함하고, 상기 제공하는 동작은, 상기 가이드 정보로서, 상기 제 1 경로 정보에 대응하는 제 1 가이드 정보 및 상기 제 2 경로 정보에 대응하는제 2 가이드 정보를 상기 제 1 경로 정보 및 상기 제 2 경로 정보가 획득된 순서와 반대 순서로 출력하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 제공하는 동작은,상기 이동에 대한 반대 방향을 상기 가이드 정보의 적어도 일부로 출력하는 동작을 포함하는 방법."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 확인하는 동작 이전에, 상기 전자 장치와 통신 중인 외부 장치의 위치에 대응하는 위치 정보를 획득하는동작을 더 포함하는 방법."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 경로 정보는,상기 위치 정보를 기준으로 상기 이동에 따라 결정된 상대적 위치 정보를 포함하는 방법."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서, 상기 위치 정보는,상기 통신과 연관된 신호 세기가 지정된 범위에 속하는 경우, 상기 외부 장치로부터 자동으로 수신되는 방법."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "전자 장치에 있어서, 공개특허 10-2015-0140021-3-상기 전자 장치에 대한 외부 장치와 통신하기 위한 통신 모듈; 및상기 통신 모듈과 기능적으로 연결된 경로 제공 모듈을 포함하고, 상기 경로 제공 모듈은, 상기 전자 장치의 제 1 위치로부터 제 2 위치로의 이동에 반응하여, 상기 전자 장치의 위치 변화에 대응하는 경로 정보를 확인하고, 상기 경로 정보를 이용하여 상기 제 2 위치로부터 상기 제 1 위치까지의 경로에 대응하는 가이드 정보를 제공하도록 설정된 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 경로 정보는 제 1 경로 정보 및 제 2 경로 정보를 포함하고, 상기 경로 제공 모듈은, 상기 가이드 정보로서, 상기 제 1 경로 정보에 대응하는 제 1 가이드 정보 및 상기 제 2 경로 정보에 대응하는제 2 가이드 정보를 상기 제 1 경로 정보 및 상기 제 2 경로 정보가 획득된 순서와 반대 순서로 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서, 상기 경로 정보는,상기 이동에 대응하는 이동 방향 또는 이동 거리 중 적어도 하나의 정보를 포함하는 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서, 상기 경로 정보는, 상기 외부 장치에 대한 통신과 연관된 신호 세기가 지정된 범위에 속하는 경우, 자동으로 획득되는 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7 항에 있어서, 상기 경로 제공 모듈은,상기 외부 장치에 대한 통신과 연관된 신호 세기가 지정된 범위에 속하는 경우, 상기 외부 장치의 위치에 대응하는 위치 정보를 상기 외부 장치로부터 수신하도록 설정된 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서, 상기 경로 정보는 제 1 경로 정보 및 제 2 경로 정보를 포함하고, 상기 제 1 경로 정보는 상기 위치 정보를 기준으로 상기 이동의 제 1 구간에 따라 결정된 상대적 위치 정보를포함하고, 상기 제 2 경로 정보는 상기 제 1 경로 정보를 기준으로 상기 이동의 제 2 구간에 따라 결정된 상대적 위치 정보를 포함하는 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서, 상기 위치 정보는, 상기 외부 장치의 이동에 따라 업데이트되는 전자 장치. 공개특허 10-2015-0140021-4-청구항 14 제 11 항에 있어서, 상기 위치 정보는상기 위치에 대응하는 위도, 경도, 또는 장소 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 7 항에 있어서, 상기 경로 제공 모듈은,상기 외부 장치를 통하여 상기 경로 정보에 해당하는 지도 정보가 표시될 수 있도록 상기 경로 정보를 상기 외부 장치로 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치에 있어서,상기 전자 장치의 위치를 감지하기 위한 적어도 하나의 센서; 및 상기 위치에 기반하여 다르게 결정된 주기에 따라, 외부 장치로부터 송신된 신호를 감지하도록 설정된 신호 감지 모듈을 포함하는 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서, 상기 신호 감지 모듈은, 상기 위치가 제 1 위치인 경우, 제 1 주기에 따라 상기 신호를 감지하고,상기 위치가 제 2 위치인 경우, 제 2 주기에 따라 상기 신호를 감지하도록 설정된 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 16 항에 있어서, 상기 신호 감지 모듈은,상기 신호의 세기 또는 상기 전자 장치의 움직임 정도가 지정된 범위에 속하는 경우, 상기 위치를 획득하도록설정된 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 17 항에 있어서, 상기 주기는,상기 전자 장치가 위치했던 장소(place)의 방문 횟수 또는 상기 전자 장치에 대한 사용자의 일정(schedule) 중적어도 하나에 더 기반하여, 결정되도록 설정된 전자 장치."}
{"patent_id": "10-2014-0068159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서, 상기 신호 감지 모듈은,상기 일정에 기반하여, 상기 외부 장치의 예측 장소를 확인하고, 상기 전자 장치가 상기 예측 장소에 위치하는 경우, 제 1 주기에 따라 상기 신호를 감지하고,상기 전자 장치가 상기 예측 장소에 위치하지 않는 경우, 제 2 주기에 따라 상기 신호를 감지하도록 설정된 전자 장치.공개특허 10-2015-0140021-5-"}
{"patent_id": "10-2014-0068159", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치에서 위치 정보를 제공하기 위한, 전자 장치의 운영 방법이 개시되어 있는 바, 다양한 실시예에 따르면, 전자 장치의 운영 방법은 상기 전자 장치에서, 상기 전자 장치의 제 1 위치로부터 제 2 위치로의 이동에 반응하여, 상기 전자 장치의 위치 변화에 대응하는 경로 정보를 확인하는 동작 및 상기 전자 장치에서, 상기 경 로 정보를 이용하여 상기 제 2 위치로부터 상기 제 1 위치까지의 경로에 대응하는 가이드 정보를 제공하는 동작 을 포함할 수 있다. 다른 실시예들이 가능하다."}
{"patent_id": "10-2014-0068159", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 전자 장치에 관한 것으로서, 예를 들면, 위치 정보를 제공하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2014-0068159", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신 기술이 발전함에 따라, 전자 장치는 다양한 방식의 무선 통신을 지원하는 하나 이상의 모듈들(예: 3G, LTE, Wifi, 또는 Bluetooth 통신 모듈)을 포함하게 되었다. 전자 장치는 다양한 통신 기술을 통하여, 하나 이상 의 외부 장치들(예: 액세서리 장치들로서, 전자 시계, 이어폰, HMD(head-mounted device), 또는 무선 마이크)과 데이터를 직접적으로 송수신할 수 있다. 예를 들면, 전자 장치는 D2D(device to device) 통신을 통하여, 사진, 음악, 또는 각종 데이터를 직접적으로 외부 장치로 전송할 뿐만 아니라, 상기 외부 장치로부터 다양한 정보를 수신할 수 있다."}
{"patent_id": "10-2014-0068159", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래 기술에 따르면, 전자 장치와 외부 장치 사이의 거리 상의 제약으로 인하여, 상기 전자 장치는 상기 외부 장치와 통신(예: 근거리 통신으로서, D2D 통신)을 수행하지 못할 수 있다. 이 경우, 상기 전자 장치에 대한 사 용자는 상기 외부 장치를 분실할 수 있다. 예를 들면, 사용자는 서로 통신하고 있는 스마트 폰 및 전자 시계를 소지할 수 있다. 전자 시계를 착용한 사용자가 제 1 장소(예: 회의실)에 상기 스마트 폰을 놓아두고, 제 2 장소 (예: 화장실)로 이동한 경우, 상기 전자 시계와 상기 스마트 폰은 거리 상의 제약으로 서로 통신을 하지 못할 수 있다. 또한, 상기 사용자는 D2D 통신 등을 통하여, 상기 스마트 폰의 기능(예: 소리 또는 진동 출력, 또는 화면 깜빡임)을 제어하지 못하는 바, 상기 스마트 폰을 인지하기가 어려울 수 있다. 예를 들면, 상기 전자 시계 를 착용한 사용자는 스마트 폰을 놓아둔 위치를 잊을 수도 있으며, 상기 사용자가 현재 위치한 장소에서 스마트 폰을 놓아둔 장소까지의 경로를 알기 어려울 수 있다. 종래 기술에 따르면, 전자 장치는 외부 장치와 통신하기 위하여, 기본적으로 설정된 일정한 주기로 외부 장치로 부터 송신되는 신호를 감지(예: 스캔)하게 된다. 이 경우, 거리 상의 제약으로 상기 전자 장치가 상기 외부 장 치로부터 신호를 수신하지 못함에도 불구하고, 상기 전자 장치는 상기 일정한 주기로 상기 외부 장치로부터 송 신되는 신호를 감지하게 된다. 이에 따라, 상기 전자 장치의 불필요한 소모 전류가 증가할 수 있다. 또한, 상기 외부 장치가 분실 상태인 경우, 상기 전자 장치는 상기 외부 장치가 위치할 가능성을 고려하지 않고, 각각의 위 치마다 동일한 주기로 상기 외부 장치를 검색함으로써, 상기 외부 장치의 검색에 대한 효율성이 낮아질 수 있다. 다양한 실시예들은, 예를 들면, 상기 외부 장치의 위치 정보를 기준으로 상기 전자 장치의 이동에 대응하는 경 로를 획득함으로써, 상기 전자 장치에 대한 사용자에게 상기 외부 장치까지의 가이드 정보(예: 상기 외부 장치 까지의 이동 방향 또는 이동 거리)를 출력하는 전자 장치 및 방법을 제공할 수 있다. 또한, 다양한 실시예들은, 예를 들면, 상기 외부 장치가 분실된 경우, 상기 전자 장치의 위치에 따라 다르게 결정된 주기에 기반하여, 상 기 외부 장치를 검색할 수 있는 전자 장치 및 방법을 제공할 수 있다."}
{"patent_id": "10-2014-0068159", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 과제 또는 다른 과제를 해결하기 위한, 한 실시예에 따른 전자 장치는, 상기 전자 장치에 대한 외부 장 치와 통신하기 위한 통신 모듈 및 상기 통신 모듈과 기능적으로 연결된 경로 제공 모듈을 포함할 수 있으며, 상 기 경로 제공 모듈은, 상기 전자 장치의 제 1 위치로부터 제 2 위치로의 이동에 반응하여, 상기 전자 장치의 위 치 변화에 대응하는 경로 정보를 확인하고, 상기 경로 정보를 이용하여 상기 제 2 위치로부터 상기 제 1 위치까지의 경로에 대응하는 가이드 정보를 제공할 수 있다. 전술한 과제 또는 다른 과제를 해결하기 위한, 한 실시예에 따른 전자 장치는, 상기 전자 장치의 위치를 감지하 기 위한 적어도 하나의 센서 및 상기 위치에 기반하여 다르게 결정된 주기에 따라, 외부 장치로부터 송신된 신 호를 감지하도록 설정된 신호 감지 모듈을 포함할 수 있다."}
{"patent_id": "10-2014-0068159", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예에 따른 전자 장치 및 방법은, 예를 들면, 외부 장치의 위치 정보를 기준으로 획득된 상기 전자 장치의 이동에 따른 경로 정보를 이용하여, 상기 외부 장치까지의 가이드 정보를 제공할 수 있는 바, 사용자가 상기 외부 장치를 분실하더라도, 상기 외부 장치의 위치 및 상기 외부 장치까지의 경로를 쉽게 파악할 수 있도 록 도움을 줄 수 있다. 다양한 실시예에 따른 전자 장치 및 방법은, 예를 들면, 외부 장치가 분실된 경우, 상기 전자 장치의 위치에 따 라 상기 외부 장치로부터 송신되는 신호를 검색하기 위한 주기를 다르게 조정함으로써, 상기 전자 장치의 소모 전류를 감소시킬 수 있다."}
{"patent_id": "10-2014-0068159", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시예는 다양한 변경 을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기재되어 있다. 그러나, 이는 본 발명의 다양한 실시예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 다양한 실시예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 발명의 다양한 실시예에서 사용될 수 있는 \"포함한다\" 또는 \"포함할 수 있다\" 등의 표현은 개시(disclosur e)된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 발명의 다양한 실시예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상 에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하 나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시예에서 \"또는\" 또는 \" A 또는/및 B 중 적어도 하나\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\" 또는 \" A 또는/및 B 중 적어도 하나\" 각각은, A 를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시예에서 사용된 \"제 1\", \"제2\", \"첫째\", 또는 \"둘째\"등의 표현들은 다양한 실시예들의 다 양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구 성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분하 기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1 구성요소 는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소 가 상기 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명의 다 양한 실시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표 현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 다양한 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의 미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시예에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 다양한 실시예에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자 북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷 북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플 레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head- mounted-device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마 트 와치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수 신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파스 등), 항공 전자기 기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller뭩 machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발 명의 다양한 실시예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되 는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 다양한 실시예에 따른 사용자에 대한 복수의 전자 장치들의 사용 환경 100을 도시한다. 도 1을 참조하면, 메인 전자 장치 101 및 서브 전자 장치 103을 포함하는 복수의 전자 장치들은, 사용자 105와 연관된 다양한 위치에 위치하여, 상호 간에 통신 111(예: 무선 통신으로서, D2D(device to device) 통신)을 수 행할 수 있다. 예를 들면, 메인 전자 장치 101과 서브 전자 장치 103은 Wifi, NFC, 또는 BT 등을 통하여 무선 페어링이 될 수 있다. 또한, 메인 전자 장치 101와 서브 전자 장치 103는 상기 통신 111을 통하여 정보(예: 자 신의 위치에 대응하는 위치 정보)를 서로 직접적으로 교환할 수 있다. 한 실시예에 따르면, 메인 전자 장치 101은 통신 111과 연관된 신호(예: radio frequency(RF) 신호)의 세기(예: received signal strength indicator(RSSI))가 지정된 범위에 속하는 경우, 메인 전자 장치 101의 위치에 대응 하는 위치 정보(예: 메인 전자 장치 101가 현재 위치하는 장소 또는 GPS(global positioning system) 정보)를 서브 전자 장치 103으로 전달(예: 전송)할 수 있다. 반대로, 서브 전자 장치 103은 통신 111의 신호 세기가 상 기 지정된 범위에 속하는 경우, 서브 전자 장치 103의 위치에 대응하는 위치 정보(예: 서브 전자 장치 103가 현 재 위치하는 장소 또는 GPS 정보)를 메인 전자 장치 101로 전달할 수 있다. 상기 지정된 범위는, 예를 들면, 상 기 통신 111와 연관된 상기 신호의 세기가 일정하게 유지되지 않고 점점 약해지는 구간에 대응하는 신호 범위일 수 있다. 상기 신호의 세기에 대한 추가 정보는 도 5와 관련하여 후술된다. 한 실시예에 따르면, 메인 전자 장치 101 또는 서브 전자 장치 103은 사용자 105가 소지(예: 사용자 105가 손으 로 휴대) 또는 착용(예: 웨어러블 전자 장치로서, 사용자 105의 신체 일부에 부착)할 수 있는 장치일 수 있다. 또한, 메인 전자 장치 101 또는 서브 전자 장치 103은 사용자 105의 신체 일부에 이식(예: 문신, 피부 내에 삽 입, 또는 머리카락 등을 통하여 사용자 105의 신체 일부화)될 수 있다. 웨어러블 전자 장치는, 예를 들면, 전자 모자, 전자 안경(예: HMD, head mounted display), 전자 목걸이, 전자 벨트, 전자 시계(예: smart watch), 전 자 팔찌, 전자 링, 전자 신발, 전자 의복 또는 전자 문신 등이 될 수 있다. 도 2a는 다양한 실시예에 따른 메인 전자 장치 201(예: 메인 전자 장치 101)과 서브 전자 장치 203(예: 서브 전 자 장치 103)를 통하여 장치 찾기 어플리케이션을 실행하는 일례 210를 도시한다. 도 2a를 참조하면, 메인 전자 장치 201과 서브 전자 장치 203은 통신 211(예: 통신 111)을 할 수 있다. 상기 메 인 전자 장치 201와 상기 서브 전자 장치 203이 통신 211을 하더라도, 메인 전자 장치 201의 위치 또는 상기 메 인 전자 장치 201와 상기 서브 전자 장치 203 간의 거리 등 다양한 상황에 따라 서브 전자 장치 203을 착용, 소 지, 또는 이식한 사용자(예: 사용자 105)는 메인 전자 장치 201을 인지하지 못할 수 있다. 이 경우, 상기 사용 자는 상기메인 전자 장치 201의 소재 또는 위치를 확인하기 위해, 서브 전자 장치 203을 통하여 장치 찾기 어플 리케이션 215를 실행할 수 있다. 장치 찾기 어플리케이션은, 예를 들면, 어느 하나의 전자 장치(예: 서브 전자 장치 203)가 다른 전자 장치(예: 메인 전자 장치 201)의 위치 또는 소재 등을 확인하거나, 상기 어느 하나의 전자 장치가 위치한 장소에서 상기 다른 전자 장치까지 이동할 수 있는 경로를 확인하기 위해 이용될 수 있는 어플리케이션이다. 한 실시예에 따르 면, 서브 전자 장치 203을 통하여 장치 찾기 어플리케이션 215가 실행되는 경우, 사용자가 메인 전자 장치 201 을 인지할 수 있도록, 메인 전자 장치 201의 소재 또는 위치를 알리기 위한 다양한 정보(이하, 설명의 편의 상,\"위치 알림 정보\")가 메인 전자 장치 201 또는 서브 전자 장치 203 중 적어도 하나를 통하여 사용자에게 제공 (예: 출력 )될 수 있다. 예를 들면, 메인 전자 장치 201은 상기 사용자가 시각, 청각, 촉각, 또는 후각 등의 감각 기관을 통하여 메인 전자 장치 201을 인지할 수 있도록, 메인 전자 장치 201과 기능적으로 연결된 출력 장치를 통하여 위치 알림 정 보를 출력할 수 있다. 예컨대, 메인 전자 장치 201은 턴-오프(turn-off) 상태인 디스플레이 223을 턴-온(turn- on)하거나, 디스플레이 223을 깜빡이거나, 또는 디스플레이 223를 통하여 다양한 시각 정보 225를 제공할 수 있 다. 또는, 메인 전자 장치 201은 소리 227 또는 진동 229을통하여 위치 알림 정보를 사용자에게 제공할 수 있다. 한 실시예에 따르면, 도시되지는 않았으나, 메인 전자 장치 201은 상기 메인 전자 장치 201과 기능적으로 연결 된 향기 장치를 통하여 향기를 발산함으로써, 메인 전자 장치 201 자신에 대한 소재를 사용자에게 알릴 수 있다. 한 실시예에 따르면, 서브 전자 장치 203은 메인 전자 장치 201이 상기 위치 알림 정보를 출력할 수 있도 록, 상기 통신 211을 통하여, 장치 찾기 어플리케이션 215이 실행되었음을 알리는 정보를 상기 메인 전자 장치 201로 제공할 수 있다. 한 실시예에 따르면, 장치 찾기 어플리케이션 215가 실행된 경우, 서브 전자 장치 203은 서브 전자 장치 203과 기능적으로 연결된 출력 장치를 통하여 메인 전자 장치 201의 위치 정보(예: 메인 전자 장치 201가 위치하는 장 소 또는 GPS 정보)를 사용자에게 제공할 수 있다. 예를 들면, 서브 전자 장치 203은 디스플레이 213을 통해 제 공되는 시각 정보 217, 스피커를 통해 제공되는 소리 정보 219, 또는 진동 장치를 통해 제공되는 진동 정보 221 중 적어도 하나를 이용하여 메인 전자 장치 201의 위치 정보를 출력할 수 있다. 또한, 서브 전자 장치 203은 사 용자가 현재 위치에서 메인 전자 장치 201이 소재하는 위치까지 이동할 수 있도록, 이동 방향 또는 이동 거리 등을 나타내는 적어도 하나의 가이드 정보를 출력 장치를 통하여 제공할 수 있다. 가이드 정보에 대한 추가 정 보는 도 2b와 관련하여 후술된다. 한 실시예에 따르면, 메인 전자 장치 201 또는 서브 전자 장치 203 중 적어도 하나의 전자 장치는, 장치 찾기 어플리케이션 215가 실행되었음을 알리는 알림을 제공할 수 있다. 예를 들면, 서브 전자 장치 203은 디스플레이 213을 통해 제공되는 시각 정보, 스피커를 통해 제공되는 소리, 진동 장치를 통해 제공되는 진동, 또는 향기 장 치를 통해 제공되는 향기 중 적어도 하나를 이용하여 상기 장치 찾기 어플리케이션 215이 실행 중이라는 알림을 사용자에게 제공할 수 있다. 한 실시예에 따르면, 서브 전자 장치 203은 통신 211의 신호 세기에 기반하여 장치 찾기 어플리케이션 215를 자 동으로 실행시킬 수 있다. 예를 들면, 통신 211의 신호 세기가 지정된 범위(예: 상기 통신 211의 신호 세기가 일정하게 유지되지 않고, 점점 약해지는 범위)에 속하는 경우, 서브 전자 장치 203은 자동으로(예: 장치 찾기 어플리케이션 215를 실행하기 위한 사용자의 요청 없이) 장치 찾기 어플리케이션 215를 실행할 수 있다. 한 실 시예에 따르면, 서브 전자 장치 203은 사용자 또는 설계자의 설정에 따라 찾기 어플리케이션 215가 자동으로 실 행되는 기능을 제한할 수 있다. 예를 들면, 서브 전자 장치 203에 장치 찾기 어플리케이션 215의 자동 실행 기 능이 있더라도, 사용자의 설정으로 장치 찾기 어플리케이션 215의 자동 실행 기능이 제한된 경우에는, 사용자 입력이 있는 경우에 한하여 장치 찾기 어플리케이션 215이 실행될 수 있다. 한 실시예에 따르면, 서브 전자 장치 203은 사용자의 요청에 응답하여 장치 찾기 어플리케이션 215를 실행할 수 있다. 예를 들면, 서브 전자 장치 203은 장치 찾기 어플리케이션 215를 실행하기 위한 사용자 입력이 획득된 경 우, 상기 획득에 응답하여 장치 찾기 어플리케이션 215를 실행시킬 수 있다. 예컨대, 서브 전자 장치 203을 착 용한 사용자가 메인 전자 장치 201의 위치를 인지하지 못하는 경우, 사용자는 서브 전자 장치 203을 통하여 장 치 찾기 어플리케이션 215를 실행시킴으로써, 메인 전자 장치 201 또는 서브 전자 장치 203 중 적어도 하나를 통하여 메인 전자 장치 201의 소재 또는 위치를 확인할 수 있다. 도 2b는 다양한 실시예에 따른 메인 전자 장치 201(예: 메인 전자 장치 101)와 서브 전자 장치 203(예: 서브 전 자 장치 103)을 통하여 장치 찾기 어플리케이션을 실행하는 일례 230를 도시한다. 도 2b에 도시된 구성요소들 중 도 2a와 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 도면 부호가 사용된다. 도 2b를 참조하면, 서브 전자 장치 203과 메인 전자 장치 201은 상대 전자 장치로부터 송신되는 통신(예: 통신 211)의 신호를 감지하지 못하는 상태 231(이하, 설명의 편의 상, \"통신 끊김 상태 231\")일 수 있다. 통신 끊김 상태 231은, 예를 들면, 상기 통신의 연결이 완전히 해제된 상태(예: NFC, Wifi, 또는 BT를 끈 상 태)이거나, 또는 어느 하나의 전자 장치(예: 메인 전자 장치 201)가 거리 상의 제약으로 인하여 상대 전자 장치(예: 서브 전자 장치 203)로부터 송신되는 신호를 수신하지 못하는 상태(예: 연결 손실(link loss) 상태)일 수 있다. 예컨대, 서브 전자 장치 203을 착용한 사용자가 어느 위치(예: 건물의 15층)에 메인 전자 장치 201를 놔 두고, 다른 위치(예: 건물의 20층)까지 이동할 수 있다. 이 경우, 상기 메인 전자 장치 201와 서브 전자 장치 203 사이의 거리 상의 제약으로 인하여, 서브 전자 장치 203는 메인 전자 장치 201로부터 송신되는 통신의 신호 를 수신할 수 없다. 한 실시예에 따르면, 상기 통신 끊김 상태 231에서 장치 찾기 어플리케이션이 실행되는 경우, 상기 서브 전자 장치 203는 메인 전자 장치 201의 위치 정보에 기반하여, 상기 서브 전자 장치 203이 현재 위치하는 위치(예: 장치 찾기 어플리케이션 215를 실행시킨 위치로서, 이하, 설명의 편의 상, \"현재 위치\")에서부터 메인 전자 장 치 201의 위치에 대응하는 영역(이하, 설명의 편의 상, \"메인 영역\")까지 가이드 정보(예: 현재 위치에서 메인 영역까지 이동하기 위한 이동 방향 또는 이동 거리)를 사용자에게 제공할 수 있다. 예를 들면, 서브 전자 장치 203은 디스플레이 213을 통하여 메인 영역까지의 이동 방향 또는 이동 거리를 시각 정보 233으로서 제공하거나, 스피커를 통하여 소리 정보 235로서 제공할 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 203이 상가 가이드 정보에 기반하여 상기 메인 영역까지 도달한 경우, 상기 메인 전자 장치 201는 소리, 진동, 또는 디스플레이 233의 밝기 조정 등을 통하여 상기 위치 알림 정보를 제공할 수 있다. 이에 따라, 상기 서브 전자 장치 203의 사용자는 상기 메인 전자 장치 201를 인지할 수 있다. 상기 메인 전자 장치 201의 위치 정보는, 예를 들면, 통신 211의 신호 세기가 제 1 지정된 범위(예: 상기 신호 의 세기가 일정하게 유지되지 않고, 점점 약해지는 구간에 대응하는 범위)에 속하는 경우, 상기 통신 211을 통 하여 메인 전자 장치 201로부터 획득될 수 있다. 상기 위치 정보는, 예를 들면, 메인 전자 장치 201의 절대적 좌표로서, 위도, 경도, 또는 GPS 정보이거나, 메인 전자 장치 201이 위치하는 건물 이름, 건물 층수 또는 장소 등에 대한 정보를 포함할 수 있다. 한 실시예에 따르면, 상기 메인 전자 장치 201와 상기 서브 전자 장치 203가 통신 끊김 상태 231인 경우, 상기 메인 전자 장치 201 또는 상기 서브 전자 장치 203는 상대 전자 장치를 검색하기 위한 신호 스캔 주기를 조정할 수 있다. 예를 들면, 상기 메인 전자 장치 201가 상기 서브 전자 장치 203로부터 송신된 신호를 수신하지 못하 는 경우, 상기 메인 전자 장치 201는 상기 송신된 신호를 스캔하기 위한 주기를, 상기 메인 전자 장치 201의 위 치 정보에 기반하여 조정할 수 있다. 예컨대, 상기 사용자의 방문 정도에 따라 우선 순위가 다르게 부여된 제 1 방문 장소 및 제 2 방문 장소가 있을 수 있다. 이 경우, 상기 메인 전자 장치 201의 위치 정보에 기반하여, 상 기 메인 전자 장치 201가 상기 제 1 방문 장소에 위치하는 것으로 판단된 경우, 상기 메인 전자 장치 201는 제 1 주기로 상기 서브 전자 장치 203를 검색할 수 있다. 상기 메인 전자 장치가 제 2 방문 장소에 위치하는 것으 로 판단된 경우, 상기 메인 전자 장치 201는 상기 제 1 주기보다 더 긴 제 2 주기로 상기 서브 전자 장치 203를 검색할 수 있다. 한 실시예에 따르면, 서브 전자 장치 203로부터 송신되는 통신의 신호 세기가 제 2 지정된 범위(예: 신호 세기 가 매우 미약하거나, 신호의 감지와 미감지가 반복되거나, 신호가 완전히 감지되지 않는 경우)에 속하는 경우, 메인 전자 장치 201는 보안 모드 237로 동작할 수 있다. 보안 모드 237은, 예를 들면, 메인 전자 장치 201에 대 한 사용자(예: 서브 전자 장치 203를 착용한 사용자)가 인증된 경우에 한하여, 메인 전자 장치 201과 연관된 기 능(예: 메인 전자 장치 201에 설치된 어플리케이션의 실행 또는 메인 전자 장치 201의 화면 밝기, 소리, 또는 기타 기능 조정)이 제어될 수 있도록 메인 전자 장치 201의 기능을 제한하는 잠금 어플리케이션일 수 있다. 메인 전자 장치 201에 대한 사용자 인증은, 예를 들면, 비밀 번호 239를 입력함으로써 수행될 수 있다. 또한, 도시되지는 않았으나, 상기 사용자 인증은, 예를 들면, 사용자와 연관된 생체 특성을 통하여 수행될 수 있다. 예컨대, 상기 사용자 인증은, 사용자의 지문, 홍채, 생체 신호, 머리카락, 맥박수, 또는 심박수 등 다양한 인체 정보를 통하여 수행될 수 있다. 한 실시예에 따르면, 메인 전자 장치 201의 보안 모드 237가 실행되는 경우, 메 인 전자 장치 201은 보안 모드 237이 실행되었음을 알리는 알림을 시각 정보 239, 소리 241, 또는 진동 243을 통하여 제공할 수 있다. 한 실시예에 따르면, 상기 통신 끊김 상태 231은 통신이 끊어진 상태 또는 통신이 해제된(disconnected) 상태를 포함할 수 있다. 통신이 끊어진 상태는, 예를 들면, 메인 전자 장치 201과 서브 전자 장치 203 사이의 거리(예: 제1 지정된 거리)로 인하여, 메인 전자 장치 201(또는, 서브 전자 장치 203)이 서브 전자 장치 203(또는, 메인 전자 장치 201)으로부터 전송되는 신호(예: 데이터)를 수신하지 못하는 상태일 수 있다. 예컨대, 통신이 끊어진 상태는 연결 손실(link loss) 상태일 수 있다. 이 경우, 메인 전자 장치 201와 서브 전자 장치 203 사이의 거리가 제 2 지정된 거리(예: 메인 전자 장치 201가 서브 전자 장치 203로부터 송신되는 RF 신호를 감지할 수 있는 거리, 또는 그 반대도 가능)에 속하는 경우, 메인 전자 장치 201와 서브 전자 장치 203의 통신을 다시 연결시키 는 동작(예: 메인 전자 장치 201에 PIN(personal identification number) 정보를 입력하는 동작)을 수행하지 않더라도, 메인 전자 장치 201 및 서브 전자 장치 203는 데이터를 서로 송수신할 수 있다. 예를 들면, 상기 서브 전자 장치 203가 상기 메인 전자 장치 201로부터 상기 제 2 지정된 거리 내에 위치하는 경우, 외부 장치로부터 송신된 신호의 스캔을 통하여, 상기 메인 전자 장치 201는 상기 서브 전자 장치 203를 포함하는 하나 이상의 외부 장치들을 검색할 수 있다. 이 경우, 상기 메인 전자 장치 201는 상기 하나 이상의 외부 장치들 중 상기 서브 전자 장치 203를 선택함으로써, 상기 서브 전자 장치 203와 데이터를 서로 교환할 수 있다. 한편, 통신이 해제된 상태는, 예를 들면, 메인 전자 장치 201와 서브 전자 장치 203 사이의 통신을 하기 위한 통신 모듈(예: 통신 인터페이스 360)을 비활성화한 상태일 수 있다. 이 경우, 메인 전자 장치 201과 서브 전자 장치 203 사이의 거리가 상기 제2 지정된 거리에 속하더라도, 메인 전자 장치 201이 서브 전자 장치 203으로부 터 송신되는 신호를 수신하지 않을 수 있다. 이 경우, 메인 전자 장치 201는 통신 모듈을 활성화시켜, 서브 전 자 장치 203과 재-연결(reconnection)을 수행함으로써, 서브 전자 장치 203과 통신을 수행할 수 있다. 다양한 실시예에서 사용된 용어 \"메인 전자 장치\" 또는 \"서브 전자 장치\"는 설명의 편의를 위하여 사용된 것으 로서 전자 장치의 기능에 따라 부여된 특별한 의미를 가지지 않는다. 예를 들면, 전술된 설명에서 \"메인 전자 장치\"로 기재된 전자 장치(예: 스마트 폰 201)가 \"서브 전자 장치\"로 칭해질 수 있으며, \"서브 전자 장치\"로 기 재된 전자 장치(예: 전자 시계 203)가 \"메인 전자 장치\"로 칭해질 수도 있다. 도 3은 다양한 실시예에 따른, 전자 장치 301을 포함하는 네트워크 환경 300를 도시한다. 도 3을 참조하면, 상기 전자 장치(예: 메인 전자 장치 201 또는 서브 전자 장치 203) 301는 버스 310, 프로세서 320, 메모리 330, 입출력 인터페이스 340, 디스플레이 350, 통신 인터페이스 360, 경로 제공 모듈 370, 및 신호 감지 모듈 390을 포함할 수 있다. 상기 버스 310는 전술한 구성요소들을 서로 연결하고, 전술한 구성요소들 간의 통신(예: 제어 메시지)을 전달하 는 회로일 수 있다. 상기 프로세서 320는, 예를 들면, 상기 버스 310를 통해 전술한 다른 구성요소들(예: 상기 메모리 330, 상기 입 출력 인터페이스 340, 상기 디스플레이 350, 상기 통신 인터페이스 360, 상기 경로 제공 모듈 370, 또는 신호 감지 모듈 390 등)로부터 명령을 수신하여, 수신된 명령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리 를 실행할 수 있다. 상기 메모리 330는, 상기 프로세서 320 또는 다른 구성요소들(예: 상기 입출력 인터페이스 340, 상기 디스플레 이 350, 상기 통신 인터페이스 360, 상기 경로 제공 모듈 370, 또는 상기 신호 감지 모듈 390 등)로부터 수신되 거나 상기 프로세서 320 또는 다른 구성요소들에 의해 생성된 명령 또는 데이터를 저장할 수 있다. 상기 메모 리 330는, 예를 들면, 커널 331, 미들웨어 332, 어플리케이션 프로그래밍 인터페이스(API: application programming interface) 333 또는 어플리케이션 334 등의 프로그래밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래밍 모듈들은 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 상기 커널 331은 나머지 다른 프로그래밍 모듈들, 예를 들면, 상기 미들웨어 332, 상기 API 333 또는 상기 어플 리케이션 334에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 상기 버스 310, 상기 프로 세서 320 또는 상기 메모리 330 등)을 제어 또는 관리할 수 있다. 또한, 상기 커널 331은 상기 미들웨어 332, 상기 API 333 또는 상기 어플리케이션 334에서 상기 전자 장치 301의 개별 구성요소에 접근하여 제어 또는 관리 할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어 332는 상기 API 333 또는 상기 어플리케이션 334이 상기 커널 331과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어 332는 상기 어플리케이션 334로부터 수신된 작업 요청들과 관련하여, 예를 들면, 상기 어플리케이션 334 중 적어도 하나의 어플리케이션에 상기 전자 장치 301의 시스템 리소스(예: 상기 버스 310, 상기 프로세서 320 또는 상기 메모리 330 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또는 로드 밸런싱)을 수행할 수 있다. 상기 API 333는 상기 어플리케이션 334이 상기 커널 331 또는 상기 미들웨어 332에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션 334는 SMS/MMS 어플리케이션, 이메일 어플리케이션, 달력 어플리케 이션, 알람 어플리케이션, 건강 관리(health care) 어플리케이션(예: 운동량 또는 혈당 등을 측정하는 어플리케 이션) 또는 환경 정보 어플리케이션(예: 기압, 습도 또는 온도 정보 등을 제공하는 어플리케이션) 등을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 어플리케이션 334은 상기 전자 장치 301와 외부 전자 장치(예: 전 자 장치 304) 사이의 정보 교환과 관련된 어플리케이션일 수 있다. 상기 정보 교환과 관련된 어플리케이션은, 예를 들어, 상기 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달(notification relay) 어플리케이션, 또는 상기 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 상기 알림 전달 어플리케이션은 상기 전자 장치 301 의 다른 어플리케이션(예: SMS/MMS 어플리케이 션, 이메일 어플리케이션, 건강 관리 어플리케이션 또는 환경 정보 어플리케이션 등)에서 발생한 알림 정보를 외부 전자 장치(예: 전자 장치 304)로 전달하는 기능을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 알 림 전달 어플리케이션은, 예를 들면, 외부 전자 장치(예: 전자 장치 304)로부터 알림 정보를 수신하여 사용자에 게 제공할 수 있다. 상기 장치 관리 어플리케이션은, 예를 들면, 상기 전자 장치 301와 통신하는 외부 전자 장 치(예: 전자 장치 304)의 적어도 일부에 대한 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴온/턴 오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 상기 외부 전자 장치에서 동작하는 어플리케이션 또는 상기 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스)를 관리(예: 설치, 삭제 또는 업데이 트)할 수 있다. 다양한 실시예에 따르면, 상기 어플리케이션 334은 상기 외부 전자 장치(예: 전자 장치 304)의 속성(예: 전자 장치의 종류)에 따라 지정된 어플리케이션을 포함할 수 있다. 예를 들어, 외부 전자 장치가 MP3 플레이어인 경 우, 상기 어플리케이션 334은 음악 재생과 관련된 어플리케이션을 포함할 수 있다. 유사하게, 외부 전자 장치 가 모바일 의료기기인 경우, 상기 어플리케이션 334은 건강 관리와 관련된 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 상기 어플리케이션 334은 전자 장치 301에 지정된 어플리케이션 또는 외부 전자 장치(예: 서 버 306 또는 전자 장치 304)로부터 수신된 어플리케이션 중 적어도 하나를 포함할 수 있다. 상기 입출력 인터페이스 340은, 입출력 장치(예: 센서, 키보드 또는 터치 스크린)를 통하여 사용자로부터 입력 된 명령 또는 데이터를, 예를 들면, 상기 버스 310를 통해 상기 프로세서 320, 상기 메모리 330, 상기 통신 인 터페이스 360, 상기 경로 제공 모듈 370, 또는 상기 신호 감지 모듈 390에 전달할 수 있다. 예를 들면, 상기 입출력 인터페이스 340은 터치 스크린을 통하여 입력된 사용자의 터치에 대한 데이터를 상기 프로세서 320로 제 공할 수 있다. 또한, 상기 입출력 인터페이스 340은, 예를 들면, 상기 버스 310을 통해 상기 프로세서 320, 상 기 메모리 330, 상기 통신 인터페이스 360, 상기 경로 제공 모듈 370, 또는 상기 신호 감지 모듈 390로부터 수 신된 명령 또는 데이터를 상기 입출력 장치(예: 스피커 또는 디스플레이)를 통하여 출력할 수 있다. 예를 들면, 상기 입출력 인터페이스 340은 상기 프로세서 320를 통하여 처리된 음성 데이터를 스피커를 통하여 사용자에게 출력할 수 있다. 상기 디스플레이 350은 사용자에게 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)을 표시할 수 있다. 상기 통신 인터페이스 360은 상기 전자 장치 301와 외부 장치(예: 전자 장치 304 또는 서버 306) 간의 통신을 연결할 수 있다. 예를 들면, 상기 통신 인터페이스 360은 무선 통신 또는 유선 통신을 통해서 네트워크 362에 연결되어 상기 외부 장치와 통신할 수 있다. 상기 무선 통신은, 예를 들어, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 상기 유선 통신은, 예 를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 네트워크 362는 통신 네트워크(telecommunications network)일 수 있다. 상기 통신 네트워크는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전 화망(telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 전자 장치 301와 외부 장치 간의 통신을 위한 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol))은 어플리케이션 334, 어플리케이션 프로그래밍 인터페이스 333, 상기 미들웨어 332, 커널 331 또는 통신 인터페이스 360 중 적어도 하나에서 지원될 수 있다.한 실시예에 따르면, 상기 서버 306는 상기 전자 장치 301에서 구현되는 동작(또는, 기능)들 중 적어도 하나의 동작을 수행함으로써, 상기 전자 장치 301의 구동을 지원할 수 있다. 예를 들면, 상기 서버 306는 상기 전자 장 치 301에 구현된 경로 제공 모듈 370을 지원할 수 있는 경로 제공 서버 모듈 308을 포함할 수 있다. 예컨대, 상 기 경로 제공 서버 모듈 308은 경로 제공 모듈 370의 적어도 하나의 구성요소를 포함하여, 경로 제공 모듈 370 이 수행하는 동작들 중 적어도 하나의 동작을 수행(예: 대행)할 수 있다. 한 실시예에 따르면, 도시되지는 않았 으나, 상기 서버 306는 상기 신호 감지 모듈 390의 적어도 일부 구성 요소를 포함하여, 상기 신호 감지 모듈 390의 적어도 일부 기능 또는 동작을 지원할 수 있다. 상기 경로 제공 모듈 370은, 다른 구성요소들(예: 상기 프로세서 320, 상기 메모리 330, 상기 입출력 인터페이 스 340, 또는 상기 통신 인터페이스 360 등)로부터 획득된 정보 중 적어도 일부를 처리하고, 이를 다양한 방법 으로 사용자에게 제공할 수 있다. 예컨대, 상기 경로 제공 모듈 370은 상기 프로세서 320를 이용하여 또는 이와 는 독립적으로, 전자 장치 301의 이동에 반응하여 상기 전자 장치 301의 위치 변화에 대응하는 경로 정보를 확 인할 수 있다. 또한, 상기 경로 제공 모듈 370은 상기 경로 정보를 이용하여 상기 경로 정보에 대응하는 가이드 정보를 상기 전자 장치 301에 대한 사용자에게 제공할 수 있다. 한 실시예에 따르면, 경로 제공 모듈 370은 다른 전자 장치(예: 전자 장치 304)의 위치에 대응하는 위치 정보에 기반하여, 상기 전자 장치 301에 대응하는 위치(예: 현재 위치)에서 상기 다른 전자 장치의 위치에 대응하는 영 역(예: 메인 영역)까지 가이드 정보를 제공할 수 있다. 이에 따라, 사용자는 가이드 정보를 따라 이동함으로써, 상기 현재 위치에서 상기 메인 영역까지 이동할 수 있다. 한 실시예에 따르면, 경로 제공 모듈 370의 적어도 하 나의 구성은 상기 서버 306(예: 경로 제공 서버 모듈 308)에 포함될 수 있으며, 상기 서버 306로부터 경로 제공 모듈 370에서 구현되는 적어도 하나의 동작을 지원받을 수 있다. 상기 신호 감지 모듈 390은, 예를 들면, 상기 전자 장치 301의 위치에 기반하여 다르게 결정된 주기에 따라, 상 기 다른 전자 장치(예: 전자 장치 304)로부터 송신되는 신호를 감지(예: 스캐닝(scanning))할 수 있다. 예컨대, 상기 신호 감지 모듈 390은, 상기 전자 장치 301가 다른 전자 장치로부터 송신되는 신호를 감지하지 못하는 경 우, 상기 전자 장치 301의 위치에 따라 다른 기간을 가지도록 결정된 스캐닝 주기에 기반하여, 상기 송신되는 신호를 스캐닝할 수 있다. 한 실시예에 따르면, 전자 장치 301는, 상기 전자 장치 301에서 지원되는 기능, 동작, 또는 성능 등에 따라 상 기 경로 제공 모듈 370 또는 상기 신호 감지 모듈 390 중 어느 하나를 포함하지 않을 수 있다. 예를 들면, 상기 전자 장치 301는 경로 제공 모듈 370만을 포함하거나, 신호 감지 모듈 390만을 포함하거나, 또는 경로 제공 모 듈 370 및 신호 감지 모듈 390 모두를 포함할 수 있다. 이하, 설명의 편의 상, 상기 경로 제공 모듈 370의 동작 또는 기능과 관련된 추가적인 정보가 기재되고, 이어서, 상기 신호 감지 모듈 390의 동작 또는 기능과 관련된 추가적인 정보가 기재된다. 먼저, 도 4 내지 도 10을 참조하여, 상기 경로 제공 모듈 370과 연관된 추가적인 정보가 기재된다. 도 4는 다양한 실시예에 따른 전자 장치(예: 전자 장치 301, 이하, 설명의 편의 상, \"서브 전자 장치\")의 경로 제공 모듈 370의 블록도 400를 도시한다. 도 4를 참조하면, 경로 제공 모듈 370은 획득 모듈 410, 확인 모듈 430, 제공 모듈 450, 및 전송 모듈 470을 포 함할 수 있다. 획득 모듈 410은, 예를 들면, 외부 장치(예: 전자 장치 304, 이하, 설명의 편의 상, \"메인 전자 장치\")의 위치 에 대응하는 위치 정보를 획득할 수 있다. 한 실시예에 따르면, 획득 모듈 410은 상기 서브 전자 장치와 상기 메인 전자 장치의 통신(예: BT, Wifi, 또는 NFC 등)과 연관된 신호 세기(예: RSSI)가 지정된 범위에 속하는 경 우, 상기 위치 정보를 상기 메인 전자 장치로부터 수신할 수 있다. 예를 들면, 상기 신호 세기는 상기 서브 전 자 장치와 상기 메인 전자 장치의 거리에 따라 변화되는 신호의 강도에 따라, '상(예: 강함)', '중(예: 약함)', 또는 '하(예: 미감지)'로 구분될 수 있다. 상기 신호 세기가, 예를 들면, '중'에 속하는 경우, 상기 위치 정보 는 상기 메인 전자 장치로부터 자동으로 수신될 수 있다. 한 실시예에 따르면, 상기 위치 정보는 상기 신호 세 기가 지정된 범위로 구분되지 않더라도, 지정된 특정 값을 가지는 경우에도 상기 메인 전자 장치로부터 자동으 로 수신될 수 있다. 한 실시예에 따르면, 상기 획득 모듈 410은 상기 메인 전자 장치와의 통신의 해제 요청이 발생되는 경우에도, 상기 메인 전자 장치의 상기 위치 정보를 수신할 수 있다. 예를 들면, 상기 메인 전자 장치에서 BT 통신 모듈에 대한 비활성화 요청이 획득되는 경우, 상기 메인 전자 장치는 BT 통신 모듈을 비활성화하기 전에, 상기 메인 전자 장치의 위치 정보를 상기 서브 전자 장치로 전송할 수 있다. 또는, 상기 서브 전자 장치에서 BT 통신 모듈에 대한 비활성화 요청이 획득되는 경우, 상기 서브 전자 장치는 이에 대한 알림을 메인 전자 장치로 제공할 수 있 다. 또한, 메인 전자 장치는 상기 알림에 대한 응답으로 상기 위치 정보를 상기 서브 전자 장치로 전송할 수 있 다. 한 실시예에 따르면, 상기 위치 정보는 상기 메인 전자 장치의 이동에 따라 업데이트 될 수 있다. 예를 들면, 상기 메인 전자 장치는 제 1 위치(예: 거실)에서 제 2 위치(예: 화장실)로 이동할 수 있다. 이 경우, 상기 획득 모듈 210은 제 1 위치에 대응하는 제 1 위치 정보를 상기 메인 전자 장치로부터 수신할 수 있으며, 상기 메인 전자 장치의 이동에 따라 변화된 상기 메인 전자 장치의 위치 정보를 획득하기 위해, 상기 제 2 위치에 대응하 는 제 2 위치 정보를 상기 메인 전자 장치로부터 새로이 수신할 수 있다. 한 실시예에 따르면, 상기 위치 정보는 상기 D2D 통신을 통하여 상기 메인 전자 장치로부터 직접적으로 수신될 수도 있으나, 네트워크(예: 네트워크 362)를 통하여 서버(예: 306)로부터 수신할 수도 있다. 이 경우, 메인 전 자 장치는 네트워크를 통하여 상기 위치 정보를 상기 서버로 제공(예: 전송)할 수 있다. 상기 메인 전자 장치 또는 상기 서버를 통하여 획득된 위치 정보는 메모리(예: 메모리 330)에 저장될 수 있다. 위치 정보는, 예를 들 면, 위도, 경도, 또는 고도 정보 등을 포함하는 수리적 위치(mathematical location) 정보 또는 GPS를 통하여 획득된 정보를 포함할 수 있다. GPS를 통하여 획득된 정보는, 예를 들면, 위도, 경도, 또는 고도뿐만 아니라 메 인 전자 장치의 속도 또는 가속도 정보 등을 함께 포함할 수 있다. 또한, 위치 정보는, 예를 들면, 상기 메인 전자 장치의 위치에 대응하는 주소 정보, 건물 명칭, 또는 건물 층수 등에 대한 장소 정보를 포함할 수 있다. 확인 모듈 430은, 예를 들면, 상기 서브 전자 장치의 이동에 반응하여, 상기 서브 전자 장치의 위치 변화에 대 응하는 경로 정보를 확인할 수 있다. 예컨대, 상기 서브 전자 장치가 제 1 위치에서 제 2 위치로 이동하는 경우, 상기 확인 모듈 430은 상기 제 1 위치에서 상기 제 2 위치까지의 이동 방향 또는 이동 거리에 대한 정보 를 상기 경로 정보로서 획득할 수 있다. 한 실시예에 따르면, 상기 경로 정보는, 상기 서브 전자 장치와 상기 메인 전자 장치 사이의 통신의 신호 세기가 지정된 범위에 속하는 경우, 자동으로 획득될 수 있다. 예컨대, 상 기 메인 전자 장치로부터 송신된 신호가 상기 서브 전자 장치에 수신되지 않는 경우, 상기 확인 모듈 430은 상 기 경로 정보를 상기 서브 전자 장치의 이동에 반응하여 상기 서브 전자 장치의 경로를 추적할 수 있다. 한 실시예에 따르면, 상기 경로 정보는, 상기 경로 정보가 획득되기 이전에 확인된 상기 메인 전자 장치의 위치 정보를 기준으로 상기 서브 전자 장치의 이동에 따라 결정된 상대적 위치 정보(예: 상기 메인 전자 장치의 위치 에 대응하는 영역(예: 메인 영역)으로부터 상기 서브 전자 장치의 이동에 대응하는 이동 방향 또는 이동 거리) 를 포함할 수 있다. 예컨대, 상기 메인 전자 장치가 A지점에 위치하는 경우, 위치 정보는 A지점이 될 수 있다. 또한, 상기 서브 전자 장치가 A지점에서 동쪽 방향으로 약 5m 이동한 경우, 상기 경로 정보는 상기 A지점을 기 준으로 상기 경로 정보의 이동 방향으로서 동쪽 또는 상기 경로 정보의 이동 거리로서 약 5m라는 상대적 위치 정보를 포함할 수 있다. 한 실시예에 따르면, 확인 모듈 430은 상기 서브 전자 장치가 순차적으로 이동하는 경우, 상기 메인 전자 장치 의 위치 정보와 연관된 적어도 하나의 경로 정보를 순차적으로 획득할 수 있다. 예컨대, 상기 경로 정보는 상기 이동의 제 1 구간에 대응하는 제 1 경로 정보 및 상기 이동의 제 2 구간에 대응하는 제 2 경로 정보를 포함할 수 있다. 상기 제 1 경로 정보는, 예를 들면, 상기 메인 전자 장치의 상기 위치 정보를 기준으로 상기 제 1 구 간의 이동에 따라 결정된 상대적 위치 정보이고, 상기 제 2 경로 정보는, 예를 들면, 상기 제 1 경로 정보를 기 준으로 상기 제 2 구간의 이동에 따라 결정된 상대적 위치 정보일 수 있다. 예를 들면, 상기 서브 전자 장치가 상기 메인 전자 장치에 대응하는 위치 정보인 A지점에서 동쪽으로 약 5m만큼 이동(이하, 설명의 편의 상, \"B지점\")한 후, 상기 B지점에서 북쪽으로 약 10m만큼 순차적으로 이동(이하, 설명 의 편의 상, \"C지점\")한 경우, 확인 모듈 430은 상기 경로 정보로서 상기 B지점과 상기 C지점에 대한 이동 방향 또는 이동 거리에 대한 정보를 순차적으로 획득할 수 있다. 예를 들면, B지점에 대한 경로 정보는 A지점을 기준 으로 획득된 상대적 위치 정보일 수 있으며, C지점에 대한 경로 정보는 B지점을 기준으로 획득된 상대적 위치 정보일 수 있다. 예컨대, C지점에 대한 경로 정보는 B지점을 기준으로 상기 C지점에 대한 이동 방향으로서 북쪽 또는 이동 거리 로서 약 10m라는 정보 중 적어도 하나의 정보를 포함할 수 있다. 이 경우, C지점에 대한 경로 정보는, 예를 들 면, A지점의 위치 정보와 연관된 B지점의 경로 정보를 기준으로 결정된 위치 정보로서, A지점의 위치 정보와 간 접적으로 연관된 정보일 수 있다. 한 실시예에 따르면, C지점에 대한 경로 정보는 A지점의 위치 정보와 직접적 으로 연관된 위치 정보를 포함할 수 있다. 예컨대, 상기 서브 전자 장치가 B지점으로부터 북쪽으로 약 10m만큼이동한 위치가 A지점으로부터 북동쪽으로 약 12m만큼 이동한 것이라면, C지점에 대한 경로 정보는 A지점을 기준 으로 이동 방향으로서 약 북동쪽 또는 이동 거리로서 약 12M라는 정보를 포함할 수 있다. 한 실시예에 따르면, 확인 모듈 430은 상기 서브 전자 장치의 제 1 위치에서부터 제 2 위치까지의 이동에 대한 이동 방향의 변화 정도 또는 이동 거리가 지정된 범위에 속하는 경우, 각각의 위치(예: 상기 제 1 위치 또는 상 기 제 2 위치)에 대한 경로 정보를 획득할 수 있다. 예를 들면, 제 1 위치인 메인 전자 장치의 위치 정보를 기 준으로 상기 제 2 위치까지의 이동이 동쪽으로 약 15cm인 경우, 상기 확인 모듈 430은 상기 제 2 위치에 대한 경로 정보를 무시할 수 있다. 예컨대, 확인 모듈 430은 상기 제 2 위치에 대한 경로 정보를 획득하지 않을 수 있다. 이는, 상기 이동 거리(예: 약 15cm)는 상기 사용자의 한 발자국 정도되는 거리로서, 상기 메인 전자 장치 를 찾는 것에 미치는 영향이 미비하기 때문이다. 반면에, 상기 서브 전자 장치가 상기 제 1 위치에서 상기 제 2 위치까지 동쪽으로 약 3m 이동한 경우, 확인 모 듈 430은 상기 제 2 위치에 대한 경로 정보(예: 상기 제 1 위치에서 동쪽으로 약 3M)를 확인할 수 있다. 이는, 상기 이동 거리(예: 약 3M)는 상기 사용자가 메인 전자 장치를 찾기 위해 상당히 이동해야 하는 거리로서, 상기 메인 전자 장치를 찾는 것에 영향을 미칠 수 있기 때문이다. 또한, 상기 서브 전자 장치의 상기 제 1 위치까지의 이동 방향이 동쪽이고, 상기 제 2 위치까지의 이동 방향이 동쪽 방향을 기준으로 오차가 ±0.1도인 경우, 상기 확인 모듈 430은 상기 제 2 위치까지의 이동 방향을 무시할 수 있다. 이 경우, 예를 들면, 확인 모듈 430은 상기 제 1 위치까지의 이동 방향에 대한 정보를 동쪽으로 유지 하면서 이동 거리에 대한 수치를 증가시킴으로써, 상기 제 1 위치에 대한 경로 정보를 획득할 수 있다. 반면에, 상기 서브 전자 장치의 상기 제 1 위치까지의 이동 방향이 동쪽이고, 상기 제 2 위치까지의 이동 방향이 동쪽 방향을 기준으로 오차가 ±10도(예: 북동쪽)인 경우, 상기 확인 모듈 430은 상기 제 1 위치에 대한 경로 정보 및 상기 제 2 위치에 대한 경로 정보를 각각 획득할 수 있다. 한 실시예에 따르면, 상기 경로 정보는 가속도 센 서, 지자기 센서, 또는 자이로 센서 등을 포함하는 다양한 센서들을 통하여 획득될 수 있다. 제공 모듈 450은, 예를 들면, 상기 경로 정보를 이용하여 서브 상기 전자 장치의 이동의 경로에 대응하는 가이 드 정보를 제공(예: 출력)할 수 있다. 예컨대, 상기 서브 전자 장치가 상기 제 1 위치에서 상기 제 2 위치로 이 동한 경우, 제공 모듈 450은 상기 경로 정보를 이용하여 상기 제 2 위치에서 상기 제 1 위치까지의 경로에 대응 하는 가이드 정보를 제공할 수 있다. 상기 가이드 정보는, 예를 들면, 상기 서브 전자 장치에 대한 사용자가 현 재 위치에서부터 상기 메인 전자 장치가 위치하는 영역(예: 메인 영역으로서, 상기 서브 전자 장치가 상기 위치 정보를 획득한 위치)까지 이동할 수 있도록, 사용자에게 이동 방향 또는 이동 거리를 알려주는 정보일 수 있다. 한 실시예에 따르면, 제공 모듈 450은 상기 가이드 정보를 상기 경로 정보가 획득된 순서와 반대 순서로 출력할 수 있다. 예를 들면, 상기 서브 전자 장치의 이동에 따라 제 1 경로 정보 및 제 2 경로 정보가 차례로(예: 순차 적으로) 획득된 경우, 상기 제공 모듈 450은 상기 가이드 정보로서, 상기 제 1 경로 정보에 대응하는 제 1 가이 드 정보 및 상기 제 2 경로 정보에 대응하는 제 2 가이드 정보를 상기 제 1 및 제 2 경로 정보가 획득된 순서와 반대 순서로 출력할 수 있다. 예컨대, 상기 제공 모듈 450은 상기 제 2 가이드 정보와 상기 제 1 가이드 정보를 순차적으로 출력할 수 있다. 한 실시예에 따르면, 제공 모듈 450은 상기 서브 전자 장치의 이동(예: 상기 제 1 위치에서 상기 제 2 위치로의 이동)에 대한 반대 방향을 상기 가이드 정보의 적어도 일부로서 출력할 수 있다. 예컨대, 상기 가이드 정보는 상기 경로 정보에 대응하는 이동 방향과 반대 방향을 나타낼 수 있다. 예를 들면, 상기 제 1 경로 정보가 동쪽 방향을 나타내는 경우, 상기 제 1 경로 정보에 대응하는 제 1 가이드 정보는 서쪽 방향을 나타낼 수 있다. 또한, 상기 제 2 경로 정보가 남쪽 방향을 나타내는 경우, 상기 제 2 경로 정보에 대응하는 제 2 가이드 정보는 북쪽 방향을 나타낼 수 있다. 이는, 상기 서브 전자 장치를 착용한 사용자가 상기 메인 전자 장치의 위치 정보 로부터 상기 서브 전자 장치의 현재 위치까지 이동한 경로를 역으로 알려줌으로써, 사용자가 메인 전자 장치에 대응하는 메인 영역까지 이동할 수 있도록 하기 위함이다. 한 실시예에 따르면, 제공 모듈 450은 상기 메인 전자 장치와 연관된 요청이 획득되는 경우, 상기 가이드 정보 를 제공(예: 출력)할 수 있다. 상기 메인 전자 장치와 연관된 요청은, 예를 들면, 상기 서브 전자 장치에서 상 기 메인 전자 장치를 찾기 위하여 장치 찾기 어플리케이션을 실행되는 것을 포함할 수 있다. 상기 장치 찾기 어 플리케이션의 실행 요청은, 예를 들면, 사용자의 직접적인 요청(예: 상기 서브 전자 장치와 기능적으로 연결된 입력 장치를 통하여 장치 찾기 어플리케이션을 실행)에 의해서 획득될 수 있다. 한 실시예에 따르면, 상기 메인 전자 장치와 연관된 요청은, 상기 서브 전자 장치의 이동 거리(예: 상기 메인 전자 장치의 위치에 대응하는 위치 정보를 기준으로 상기 장치 찾기 어플리케이션의 실행 요청이 발생된 위치까 지 상기 서브 전자 장치의 총 이동 거리), 지정된 시간(예: 상기 메인 전자 장치의 상기 위치 정보가 획득된 시 점부터 경과된 시간), 또는 상기 서브 전자 장치의 이동에 따라 누적된 경로 정보 량 중 적어도 하나에 기반하 여 자동으로 획득될 수 있다. 예를 들면, 제공 모듈 450은 상기 메인 전자 장치의 위치 정보를 기준으로 상기 서브 전자 장치의 총 이동 거리 가 지정된 범위(예: 약 1km)에 속하는 경우, 장치 찾기 어플리케이션을 자동으로 실행할 수 있다. 또한, 상기 제공 모듈 450은 상기 위치 정보를 획득한 시점부터 경과된 시간이 지정된 시간(예: 약 30분)에 속하는 경우, 장치 찾기 어플리케이션을 자동으로 실행할 수 있다. 또는, 상기 제공 모듈 450은 상기 서브 전자 장치의 이동 에 따라 획득된 경로 정보 량이 지정된 범위(예: 약 10Kbyte)에 속하는 경우, 상기 장치 찾기 어플리케이션을 자동으로 실행할 수 있다. 한 실시예에 따르면, 제공 모듈 450은 상기 가이드 정보를 디스플레이(예: 디스플레이 350)를 통하여 시각 정보 로서 제공하거나, 스피커를 통하여 음성 정보로서 제공할 수 있다. 이에 따라, 상기 서브 전자 장치를 착용, 소 지, 또는 이식한 사용자는 청각 또는 시각 등을 통하여 상기 가이드 정보를 인지함으로써, 상기 메인 전자 장치 의 위치(예: 메인 영역)로 이동할 수 있다. 다양한 실시예에서 기재된 \"지정된 범위\"에 대한 수치 등은 예시로 서, 상기 서브 전자 장치의 사용자 또는 설계자에 따라 다양하게 구현될 수 있다. 전송 모듈 470은, 예를 들면, 외부 장치를 통하여 상기 경로 정보에 해당하는 지도 정보가 표시될 수 있도록, 상기 경로 정보를 상기 외부 장치로 전송할 수 있다. 상기 지도 정보는, 예를 들면, 상기 경로 정보를 이용하여, 상기 메인 전자 장치의 위치에 대응하는 메인 영역에서부터 상기 서브 전자 장치가 이동한 경로를 지 도 상에 표시되는 정보일 수 있다. 상기 외부 장치는, 예를 들면, 상기 위치 정보를 제공한 메인 전자 장치와 다른 전자 장치로서, 지도와 관련된 어플리케이션을 실행시킬 수 있는 전자 장치일 수 있다. 도 5a는 다양한 실시예에 따른 서브 전자 장치(예: 서브 전자 장치 203)와 메인 전자 장치(예: 메인 전자 장치 201) 사이의 통신과 연관된 신호 세기의 일례 510를 도시한다. 도 5a를 참조하면, 서브 전자 장치 503와 메인 전자 장치 501 사이의 거리에 따라, 서브 전자 장치 503와 메인 전자 장치 501 사이의 통신(예: 근거리 통신으로서, D2D 통신)의 세기가 달라질 수 있다. 예를 들면, 서브 전자 장치 503를 착용, 소지, 또는 이식한 사용자의 이동에 따라 변화되는 통신의 신호 세기에 기반하여, 메인 전자 장치 501와 서브 전자 장치 503 사이의 영역은 제 1 내지 제 3 영역 513, 515, 517로 구분될 수 있다. 제 1 영 역 513의 신호 세기는, 예를 들면, '상(강함)'에 속할 수 있다. 제 2 영역 515의 신호 세기는, 예를 들면, '중 (약함)'에 속할 수 있다. 제 3 영역 517의 신호 세기는, 예를 들면, '하(미감지)'에 속할 수 있다. 예컨대, 제 3 영역 517에서는 서브 전자 장치 503(또는, 메인 전자 장치 501)는 메인 전자 장치 501(또는, 서브 전자 장치 503)로부터 송신되는 신호를 감지할 수 없는 미감지 상태 519가 될 수 있다. 도 5b는 다양한 실시예에 따른 서브 전자 장치(예: 서브 전자 장치 203)와 메인 전자 장치(예: 메인 전자 장치 201) 사이의 통신과 연관된 신호 세기의 일례 530를 도시한다. 도 5b에 도시된 구성요소들 중 도 5a에 동일 또 는 유사한 구성요소에 대해서는 동일 또는 유사한 도면 부호가 사용된다. 도 5b를 참조하면, 상기 제 1 영역 513은, 예를 들면, 상기 서브 전자 장치 503와 상기 메인 전자 장치 501 사 이의 제 1 거리가 제 1 지정된 범위 531(예: 약 10M 미만)에 속하는 영역일 수 있다. 상기 제 1 거리가 상기 제 1 지정된 범위 531에 속하는 경우, 상기 서브 전자 장치 503(또는, 상기 메인 전자 장치 501)는 상기 메인 전자 장치 501(또는, 상기 서브 전자 장치 503)로부터 송신되는 신호를 안정적으로 수신할 수 있다. 이 경우, 상기 서브 전자 장치 503는 상기 메인 전자 장치 501로부터 신호가 안정적으로 수신된다는 ACK(acknowledge) 신호를 수신할 수 있다. 이에 따라, 상기 서브 전자 장치 503는 지정된 송신 신호 세기(예: 상기 서브 전자 장치 503에 기본적으로 설정된 신호 세기) 533를 일정하게 유지하면서 신호(예: packet data)를 상기 메인 전자 장치 501로 전송할 수 있다. 상기 지정된 송신 신호 세기 533는, 예를 들면, 상기 서브 전자 장 치 503가 최대로 강하게 송신할 수 있는 최대 송신 신호 세기 535보다는 작을 수 있다. 상기 제 2 영역 515은, 예를 들면, 상기 서브 전자 장치 503와 상기 메인 전자 장치 501 사이의 제 2 거리가 제 2 지정된 범위 537 (예: 약 10M 이상 15M 미만)에 속하는 영역일 수 있다. 상기 제 2 거리가 상기 제 2 지정된 범위 537에 속하는 경우, 상기 서브 전자 장치 503가 상기 메인 전자 장치 501로부터 멀어짐에 따라, 상기 서브 전자 장치 503는 상기 메인 전자 장치 501로부터 송신되는 신호를 점점 더 약하게 수신할 수 있다. 예를 들면, 상기 서브 전자 장치 503가 제 1 임계 지점 539(예: a fist threshold position)에서 제 2 임계 지 점 541(예: a second threshold position)으로 이동함에 따라, 상기 메인 전자 장치 501로부터 송신되는 신호 는 점점 더 약하게 상기 서브 전자 장치 503로 수신될 수 있다. 이에 따라, 상기 서브 전자 장치 503는 제 2 거 리가 증감함에 따라, 송신 신호 세기를 상기 지정된 송신 신호 세기 533에서 점점 더 강하게 할 수 있다. 상기 서브 전자 장치 503의 배터리 소모량 등을 고려하여, 상기 서브 전자 장치 503는 상기 최대 송신 신호 세기 535 까지 송신 신호 세기를 증가시킬 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 503가 제 1 임계 지점에 539에 도달한 경우, 상기 서브 전자 장치 503는 상기 메인 전자 장치 501로부터 신호 세기가 약하다는 ACK를 수 신할 수 있다. 상기 제 3 영역 517은, 예를 들면, 상기 서브 전자 장치 503와 상기 메인 전자 장치 501 사이의 제 3 거리가 제 3 지정된 범위 543(예: 약 15m 이상)에 속하는 영역일 수 있다. 상기 제 3 거리가 상기 제 3 지정된 범위 543에 속하는 경우, 상기 서브 전자 장치 503(또는, 상기 메인 전자 장치 501)는 상기 메인 전자 장치 501(또는, 상기 서브 전자 장치 503)로부터 송신되는 신호를 수신할 수 없다. 예컨대, 연결 손실(link loss) 상태가 될 수 있다. 상기 서브 전자 장치 503가 제 2 임계 지점 541에 도달한 경우, 상기 서브 전자 장치 503는 상기 메인 전 자 장치 501로부터 더 이상 ACK를 받지 못할 수 있다. 이에 따라, 상기 서브 전자 장치 503는 상기 메인 전자 장치 501로 신호를 송신하는 것을 중단할 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 503가 제 2 영역 515에 위치하는 경우, 상기 서브 전자 장치 503(예: 획득 모듈 410)는 상기 메인 전자 장치 501의 위치에 대응하는 위치 정보를 수신할 수 있다. 한 실시예에 따르 면, 상기 서브 전자 장치 503가 제 3 영역 517에 위치하는 경우, 상기 서브 전자 장치 503(예: 확인 모듈 430) 는 가속도 센서, 지자기 센서, 또는 자이로 센서 등을 포함한 9축 센서를 통하여 상기 서브 전자 장치 503의 이 동을 추적(예: 트래킹) 545할 수 있다. 이 경우, 상기 메인 전자 장치 501의 위치에 대응하는 상기 메인 영역은, 예를 들면, 상기 제 2 임계 지점 541이 될 수 있다. 예컨대, 상기 메인 영역은 상기 메인 전자 장치 501로부터 상기 제 2 거리만큼 떨어진 영역이 될 수 있다. 한 실시예에 따르면, 도시되지는 않았으나, 상기 서브 전자 장치 503는 상기 메인 전자 장치 501의 위치 정보를 수신한 경우, 예를 들면, 상기 제 2 영역 515에서 상기 서브 전자 장치 503의 이동을 추적할 수 있다. 이 경우, 상기 메인 전자 장치 501의 위치에 대응하는 상기 메인 영역은, 예를 들면, 상기 제 2 임계 지점 539이 될 수 있다. 예컨대, 상기 메인 영역은 상기 메인 전자 장치 501로부터 상기 제 1 거리만큼 떨어진 영역이 될 수 있다. 도 5에서 구분된 제 1 내지 제 3 영역 513, 515, 517은 설명의 편의를 위하여 구분된 일 예로서, 상기 서 브 전자 장치 503의 사용자 또는 설계자 등에 의해 다양하게 구현될 수 있다. 또한, 상기 서브 전자 장치 503의 송신 신호 세기를 지정된 범위로 구분한 것은 일 예로서, 다양한 실시예에 따르면, 송신 신호 세기가 특정한 값 을 가지는 경우, 상기 서브 전자 장치 503는 상기 메인 전자 장치 501의 위치 정보를 수신하거나 이동 추적 545 을 수행할 수 있다. 도 6은 다양한 실시예에 따른 서브 전자 장치(예: 서브 전자 장치 503)의 경로 정보를 획득하는 일 예 600를 도 시한다. 도 6을 참조하면, 상기 서브 전자 장치 603(예: 확인 모듈 430)는 상기 서브 전자 장치 603의 이동에 대응하는 상기 서브 전자 장치 603의 경로 정보를 메모리 651(예: 스택 구조를 가지는 메모리로서, 상기 메모리 330)에 차례로 저장(예: 폴링(polling))할 수 있다. 예를 들면, 상기 서브 전자 장치 603가 상기 메인 전자 장 치 601(예: 메인 전자 장치 501)로부터 제 1 거리 D1만큼 떨어진 제 1 기준 지점 639(예: 상기 제 1 임계 지점 539)에 위치하는 경우(예: 상기 제 1 기준 지점 639에 위치하는 시점부터), 상기 서브 전자 장치 603(예: 획득 모듈 410)는 상기 메인 전자 장치 601의 위치에 대응하는 위치 정보 605인 (X0, Y0, Z0)를 상기 메인 전자 장치 601로부터 수신할 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 603는 상기 위치 정보 605를 상기 메모리 651에 저장할 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 603(예: 확인 모듈 430)가 상기 메인 전자 장치 601로부터 제 2 거리 D2만큼 떨어진 제 2 기준 지점 641(예: 상기 제 2 임계 지점 541)까지 이동하는 동안, 상기 메인 전자 장치 601 의 위치 정보 605를 주기적으로 수신할 수 있다. 또는, 상기 서브 전자 장치 603는 상기 메인 전자 장치 601의 위치가 변화되는 경우, 상기 변화된 위치에 대응하는 위치 정보를 상기 메인 전자 장치 601로부터 새로이 수신 할 수 있다. 위치 정보 605인 (X0, Y0, Z0)의 각각의 값은, 예를 들면, 상기 메인 전자 장치 601의 위도, 경도, 또는 고도에 대한 정보를 포함할 수 있다. 한 실시예에 따르면, (X0, Y0, Z0)가 포함할 수 있는 상기 메인 전자 장치 601의 위치 정보 605는 사용자 또는 서브 전자 장치 603(또는, 메인 전자 장치 601)의 설계자에 의해서 다 양하게 변형될 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 603가 제 2 기준 지점 641(예: 상기 제 2 임계 지점 541)에 위치하는 경우(예: 상기 제 2 기준 지점 641에 위치하는 시점부터), 상기 서브 전자 장치 603(예: 확인 모듈 430)는 상기 서브 전자 장치 603의 이동에 대응하는 경로 정보를 상기 메모리 651에 순차적으로 저장할 수 있다. 예컨대, 상 기 서브 전자 장치 603가 상기 제 2 기준 지점 641에서 특정 방향을 가지고 제 1 이동 지점 643으로 이동한 경 우, 상기 서브 전자 장치 603는 상기 위치 정보 605를 기준으로 상기 제 1 이동 지점 643에 대응하는 경로 정보 653인 (X1, Y1, Z1)을 획득하여, 상기 메모리 651에 저장할 수 있다. 상기 경로 정보 653는, 예를 들면, 상기 제 2 기준 지점 641에서 제 1 이동 지점 643까지의 이동에 대응하는 이동 방향, 이동 거리 또는 고도 변화 등을 포함할 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 603가 제 1 이동 지점 643부터 제 2 이동 지점 645으로 이동한 경우, 상기 서브 전자 장치 603는 상기 제 1 이동 지점 643에 대응하는 경로 정보 653을 기준으로 상기 제 2 이동 지 점 645에 대응하는 경로 정보 655인 (X2, Y2, Z2)를 획득하여, 상기 메모리 651에 상기 경로 정보 653의 다음 정보로서 차례로 저장할 수 있다. 또한, 상기 서브 전자 장치 603의 이동에 반응하여, 상기 서브 전자 장치 603 가 제 N 이동 지점 647(N > 2, 자연수)이 위치하는 경우, 상기 서브 전자 장치 603는 상기 제 N-1 이동 지점에 대응하는 경로 정보를 기준으로 상기 제 N 지점에 대응하는 경로 정보 657인 (Xn, Yn, Zn)를 획득할 수 있다. 또한, 상기 서브 전자 장치 630는 상기 경로 정보 657를 상기 제 N-1 이동 지점에 대응하는 경로 정보의 다음 정보로서 상기 메모리 651에 차례로 저장할 수 있다. 상기 서브 전자 장치 603는 상기 서브 전자 장치 603의 이 동에 따라 상기 서브 전자 장치 603의 위치 변화에 대응하는 경로 정보를 상기 메모리 651에 저장함으로써, 상 기 서브 전자 장치 603를 착용한 사용자가 이전의 위치로 이동할 수 있도록 가이드 정보를 제공할 수 있다. 도 6에서는, 한 실시예로서, 상기 서브 전자 장치 603가 상기 제 2 기준 지점 641에 위치한 시점을 기준으로 상 기 경로 정보를 획득하는 일 예가 기재되었다. 그러나, 다양한 실시예에 따르면, 상기 서브 전자 장치 603가 경 로 정보를 획득할 수 있는 시점은 상기 제 2 기준 지점 641에 한정되지 않으며, 상기 서브 전자 장치 603가 제 1 기준 지점 639에 위치하는 시점도 가능하다. 예컨대, 상기 서브 전자 장치 603는 상기 메인 전자 장치 601로 부터 위치 정보 605를 수신한 경우에는 언제든지 상기 서브 전자 장치 603의 이동에 대응하는 경로 정보를 획득 할 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 603는 상기 메인 전자 장치 601가 소리, 진동, 또는 화면 깜박임을 제공하는 경우, 상기 메인 전자 장치 601를 인지할 수 있는 특정한 영역에서 상기 메인 전자 장치 601의 위치 정보를 획득할 수 있다. 또한, 상기 서브 전자 장치 603는 상기 특정한 영역을 기준으로 상기 서브 전자 장치 603의 이동에 대응하는 경로 정보를 획득할 수 있다. 한 실시예에 따르면, 상기 메인 영역은 상기 서브 전자 장 치 603의 경로 정보가 획득되기 시작한 지점에 대응할 수 있다. 예컨대, 상기 제 1 기준 지점 639에서 상기 서 브 전자 장치 603의 경로 정보가 획득된 경우, 상기 메인 영역은 상기 제 1 기준 지점 639이 될 수 있다. 반면 에, 상기 제 2 기준 지점 641에서 상기 서브 전자 장치 603의 경로 정보가 획득된 경우, 상기 메인 영역은 상기 제 2 기준 지점 641이 될 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 603는 메인 전자 장치 601의 위치 정보, 메인 전자 장치 601와의 거 리 정보 등과 관계 없이, 서브 전자 장치 603의 경로 정보를 독립적으로 획득할 수 있다. 예컨대, 상기 서브 전 자 장치 603가 상기 메인 전자 장치 603의 위치 정보 605를 획득하지 않더라도, 상기 서브 전자 장치 603는 서 브 전자 장치 603의 자신의 이동에 대한 경로 정보를 확인할 수 있다. 도 7은 다양한 실시예에 따른 서브 전자 장치(예: 상기 서브 전자 장치 603)가 경로 정보를 이용하여 가이드 정 보를 제공하는 일 예 700를 도시한다. 도 7에서 도시된 구성들 중 도 6과 동일 또는 유사한 구성에 대해서는 도 6과 동일 또는 유사한 도면 부호가 사용되며, 그에 대한 설명은 생략된다. 한 실시예에 따르면, 서브 전자 장치 603(예: 제공 모듈 450)는 상기 경로 정보에 대응하는 가이드 정보를 적어도 하나의 출력 장치를 통해서 사용자 750에게 제공할 수 있다. 예를 들면, 장치 찾기 어플리케이션 710의 실행에 대한 요청이 획득되는 경우, 상기 서브 전자 장치 603는 메모리 651에 상기 서브 전자 장치 601의 이동에 반응하여 차례로 저장된 경로 정보 653, 655, 657를 꺼내어 상기 경로 정보에 대응하는 가이드 정보를 제공할 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 603는 경로 정보 653, 655, 657가 획득된 순서의 반대 순서로 상기 경로 정보 653, 655, 657를 차례 로 상기 메모리 651에서 꺼낼 수 있다. 예컨대, 상기 서브 전자 장치 603는 마지막으로 저장된 상기 서브 전자 장치의 제 N 이동 지점(예: 제 N 이동 지점 647)에 대응하는 경로 정보 657인 (Xn, Yn, Zn)를 상기 메모리 651에서 첫 번째로 꺼내어 상기 경로 정보 657에 대응하는 제 1 가이드 정보를 디스플레이 713를 통하여 유저 인터페이스 730(예: 이동 방향)로서 표시할 수 있다. 상기 제 1 가이드 정보는, 예를 들면, 상기 제 N 이동 지점에서, 상기 제 N 이동 지점의 이전의 위치인 제 N-1 이동 지점까지 이동하기 위한 이동 방향, 이동 거리, 또는 고도 변화 등에 대한 정보를 포함할 수 있 다. 예컨대, 상기 제 1 가이드 정보의 이동 방향은 상기 경로 정보 657에 포함된 이동 방향과 반대 방향일 수 있다. 상기 가이드 정보를 제공하는 것에 반응하여, 상기 서브 전자 장치 603는, 상기 서브 전자 장치 603의 이동에 따라 두 번째로 획득된 제 2 이동 지점(예: 상기 제 2 이동 지점 645)에 대응하는 경로 정보 655인 (X2, Y2, Z2)를 상기 메모리 651에서 꺼내어, 상기 경로 정보 655에 대응하는 제 2 가이드 정보를 상기 디스플레이 730를 통해서 표시할 수 있다. 상기 제 2 가이드 정보는, 예를 들면, 상기 제 2 이동 지점에서, 상기 제 2 이동 지점 의 이전의 위치인 제 1 이동 지점(예: 상기 제 1 이동 지점 643)까지 이동하기 위한 이동 방향, 이동 거리, 또 는 고도 변화 등에 대한 정보를 포함할 수 있다. 또한, 상기 서브 전자 장치 603는, 상기 서브 전자 장치 603의 이동에 따라 첫 번째로 획득된 상기 제 1 이동 지점(예: 상기 제 1 이동 지점 643)에 대응하는 경로 정보 653인 (X1, Y1, Z1)를 상기 메모리 651에서 경로 정 보 655 다음에 꺼내어, 상기 경로 정보 653에 대응하는 제 3 가이드 정보를 상기 디스플레이 713를 통해서 표시 할 수 있다. 상기 제 3 가이드 정보는, 예를 들면, 상기 제 1 이동 지점에서, 상기 경로 정보의 획득의 시작의 기준이 되는 기준 지점(예: 상기 제 2 기준 지점 641)까지 이동하기 위한 이동 방향, 이동 거리, 또는 고도 변 화 등에 대한 정보를 포함할 수 있다. 상기 서브 전자 장치 603(예: 제공 모듈 450)는 상기 서브 전자 장치 603의 이동에 반응하여 상기 메모리 651에 차례로 저장된 경로 정보를, 상기 경로 정보가 획득된 순서의 반대로 상기 메모리 651에서 꺼낼 수 있다. 또한, 상기 서브 전자 장치 603는 상기 메모리 651에서 꺼낸 경로 정보 653, 655, 657를 이용하여 가이드 정보를 사용 자 750에게 제공할 수 있다. 이에 따라, 상기 사용자 750는 상기 사용자 750가 현재 위치하는 위치에서 상기 메 인 전자 장치를 인지할 수 있는 영역(예: 메인 영역)까지 이동할 수 있다. 도 8은 다양한 실시예에 따른 서브 전자 장치(예: 상기 서브 전자 장치 603)가 경로 정보를 이용하여 가이드 정 보를 제공하는 일 예 800를 도시한다. 한 실시예에 따르면, 서브 전자 장치 603(예: 전송 모듈 470)는 메인 전 자 장치 601가 아닌 외부 장치 810를 통하여 상기 경로 정보에 대응하는 가이드 정보를 제공할 수 있다. 예를 들면, 상기 서브 전자 장치 603는 제 1 영역 803(예: 상기 1 기준 지점 639 또는 상기 제 2 기준 지점 641)에서, 상기 메인 전자 장치 601와 통신(예: D2D 통신)의 연결이 끊어진 상태 830인 제 2 영역 805으로 이동 할 수 있다. 상기 제 1 영역 803은, 예를 들면, 상기 서브 전자 장치 603를 착용한 사용자 750가 상기 메인 전 자 장치 601에 출력되는 소리, 또는 진동 등의 알림을 통하여 상기 메인 전자 장치 601를 인지할 수 있는 특정 영역일 수 있다. 상기 제 2 영역 805은, 예를 들면, 상기 메인 전자 장치 601를 찾기(예: 검색) 위한 요청이 획 득된 영역일 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치 603는 상기 서브 전자 장치 603의 이동에 반응하여 획득된 경로 정보 841가 상기 외부 장치 810의 지도 어플리케이션 813을 통하여 출력될 수 있도록 상기 경로 정보 841(예: 상기 메모리 651에 저장된 경로 정보)를 상기 외부 장치 810로 전달(예: 전송)할 수 있다. 이에 따라, 지도 어플리케 이션 813에는 상기 제 1 영역 803에 대응하는 제 1 표시 833, 상기 제 2 영역 805에 대응하는 제 2 표시 835, 및 상기 제 2 영역 805에서 상기 제 1 영역 803까지의 이동 경로에 대응하는 제 3 표시 837가 출력될 수 있다. 다양한 실시예에 따른 위치 정보를 제공하기 위한 전자 장치는, 예를 들면, 상기 전자 장치에 대한 외부 장치와 통신하기 위한 통신 모듈 및 상기 통신 모듈과 기능적으로 연결된 경로 제공 모듈을 포함하고, 상기 경로 제공 모듈은, 상기 전자 장치의 제 1 위치로부터 제 2 위치로의 이동에 반응하여, 상기 전자 장치의 위치 변화에 대 응하는 경로 정보를 확인하고, 상기 경로 정보를 이용하여 상기 제 2 위치로부터 상기 제 1 위치까지의 경로에 대응하는 가이드 정보를 제공할 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는 제 1 경로 정보 및 제 2 경로 정보를 포함하고, 상기 경로 제공 모 듈은, 상기 가이드 정보로서, 상기 제 1 경로 정보에 대응하는 제 1 가이드 정보 및 상기 제 2 경로 정보에 대 응하는 제 2 가이드 정보를 상기 제 1 경로 정보 및 상기 제 2 경로 정보가 획득된 순서와 반대 순서로 출력할 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는 상기 이동에 대응하는 이동 방향 또는 이동 거리 중 적어도 하나의 정보를 포함할 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는 상기 외부 장치에 대한 통신과 연관된 신호 세기가 지정된 범위에 속하는 경우, 자동으로 획득될 수 있다. 다양한 실시예에 따르면, 상기 경로 제공 모듈은, 상기 통신과 연관된 신호 세기가 지정된 범위에 속하는 경우, 상기 외부 장치의 위치에 대응하는 위치 정보를 상기 외부 장치로부터 수신할 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는 제 1 경로 정보 및 제 2 경로 정보를 포함하고, 상기 제 1 경로 정 보는 상기 위치 정보를 기준으로 상기 이동의 제 1 구간에 따라 결정된 상대적 위치 정보를 포함하고, 상기 제 2 경로 정보는 상기 제 1 경로 정보를 기준으로 상기 이동의 제 2 구간에 따라 결정된 상대적 위치 정보를 포함 할 수 있다. 다양한 실시예에 따르면, 상기 위치 정보는 상기 외부 장치의 이동에 따라 업데이트될 수 있다. 다양한 실시예에 따르면, 상기 위치 정보는 상기 위치에 대응하는 위도, 경도, 또는 장소 중 적어도 하나를 포 함할 수 있다. 다양한 실시예에 따르면, 상기 경로 제공 모듈은, 상기 외부 장치를 통하여 상기 경로 정보에 해당하는 지도 정 보가 표시될 수 있도록 상기 경로 정보를 상기 외부 장치로 전송할 수 있다. 다양한 실시예에 따르면, 상기 경로 제공 모듈은, 상기 이동에 대한 반대 방향을 상기 가이드 정보의 적어도 일 부로 출력할 수 있다. 다양한 실시예에 따르면, 상기 경로 제공 모듈은, 상기 경로 정보를 확인하기 이전에, 상기 전자 장치와 통신 중인 외부 장치의 위치에 대응하는 위치 정보를 획득할 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는, 상기 위치 정보를 기준으로 상기 이동에 따라 결정된 상대적 위치 정보를 포함할 수 있다. 다양한 실시예에 따르면, 상기 위치 정보는, 상기 통신과 연관된 신호 세기가 지정된 범위에 속하는 경우, 상기 외부 장치로부터 자동으로 수신될 수 있다. 도 9는 다양한 실시예에 따른 서브 전자 장치의 가이드 정보를 제공하는 방법의 일 예 900를 보여주는 흐름도를 도시한다. 동작 910에서, 서브 전자 장치(예: 확인 모듈 430)은, 예를 들면, 상기 서브 전자 장치가 제 1 위치 에서 제 2 위치로 이동하는 경우, 상기 이동에 반응하여 상기 서브 전자 장치의 위치 변화에 대응하는 경로 정 보를 확인할 수 있다. 상기 경로 정보는, 예를 들면, 상기 제 1 위치에서 상기 제 2 위치까지의 이동 방향, 이 동 거리, 또는 고도 변화 등에 대한 정보를 포함할 수 있다. 동작 930에서, 상기 서브 전자 장치(예: 제공 모듈 450)은, 예를 들면, 상기 제 2 위치에서 상기 제 1 위치까지 의 경로에 대응하는 가이드 정보를 제공할 수 있다. 한 실시예에 따르면, 상기 서브 전자 장치는 상기 가이드 정보를 상기 서브 전자 장치에 구현된 출력 장치뿐만 아니라, 상기 서브 전자 장치의 외부 장치에 구현된 출력 장치를 통해서도 사용자에게 제공할 수 있다. 상기 가이드 정보는, 예를 들면, 상기 제 1 위치에서 상기 제 2 위치까지의 이동 방향의 반대 방향을 포함할 수 있다. 도 10은 다양한 실시예에 따른 서브 전자 장치의 가이드 정보를 제공하는 방법의 일 예 1000를 보여주는 흐름도 를 도시한다. 동작 1010에서, 서브 전자 장치(예: 서브 전자 장치 203)는, 예를 들면, 메인 전자 장치(예: 메인 전자 장치 201)로부터 D2D 통신의 일 예인 BT를 통하여 패킷 데이터를 수신할 수 있다. 동작 1020에서, 상기 서 브 전자 장치는 상기 패킷 데이터에 기반하여, 상기 메인 전자 장치로부터 수신되는 신호의 세기(예: RSSI)가 기준 값보다 큰 지를 판단할 수 있다. 상기 신호의 세기가 기준 값보다 큰 경우, 상기 서브 전자 장치는, 예를 들면, 상기 패킷 데이터를 안정적으로 수신할 수 있다. 반면에, 동작 1030에서, 상기 신호의 세기가 기준 값보다 작거나 같은 경우, 상기 서브 전자 장치는 상기 서브 전자 장치의 이동을 추적할 수 있다. 예컨대, 상기 서브 전자 장치(예: 확인 모듈 430)는 9축 센서(9-axis sensor)를 통하여 상기 서브 전자 장치의 이동에 대응하는 경로 정보를 획득할 수 있다. 동작 1040에서, 상기 서브 전자 장치는, 예를 들면, 상기 메인 전자 장치를 찾기 위한 장치 찾기 어플리케이션 이 실행되는 지를 판단할 수 있다. 한 실시예에 따르면, 장치 찾기 어플리케이션이 실행되지 않은 것으로 확인 (판단)된 경우, 동작 1030을 통하여, 상기 서브 전자 장치는 상기 서브 전자 장치의 이동을 계속 추적함으로써 경로 정보를 확인할 수 있다. 반면에, 동작 1050에서, 상기 장치 찾기 어플리케이션이 실행된 것으로 확인된 경 우, 상기 서브 전자 장치(예: 제공 모듈 450)는 상기 서브 전자 장치의 이동을 역으로 추적하는 이동 방향을 가 이드 정보로서 출력 장치를 통해서 제공할 수 있다. 동작 1060에서, 상기 서브 전자 장치는 상기 서브 전자 장치가 메인 영역의 도착 여부를 판단할 수 있다. 상기 메인 영역(예: 제 1 기준 지점 639 또는 제 2 기준 지점 641)은, 예를 들면, 상기 메인 전자 장치가 장치 찾기 어플리케이션의 실행 등에 응답하여 소리, 진동, 향기, 또는 디스플레이를 통한 시각 정보를 출력하는 경우, 상 기 서브 전자 장치를 착용한 사용자가 상기 메인 전자 장치를 인식할 수 있는 영역이 될 수 있다. 상기 서브 전 자 장치가 상기 메인 영역에 도착하지 못한 경우, 동작 1050을 통하여, 상기 서브 전자 장치는 상기 메인 영역 에 도착하기 위하여 역 추적의 방향을 계속 표시할 수 있다. 반면에, 동작 1070에서, 상기 서브 전자 장치가 메 인 영역에 도착한 경우, 상기 서브 전자 장치는 역 추적을 종료할 수 있다. 다양한 실시예에 따르면, 위치 정보를 제공하기 위한 전자 장치의 운영 방법은, 예를 들면, 상기 전자 장치에서, 상기 전자 장치의 제 1 위치로부터 제 2 위치로의 이동에 반응하여, 상기 전자 장치의 위치 변화에 대응하는 경로 정보를 확인하는 동작 및 상기 전자 장치에서, 상기 경로 정보를 이용하여 상기 제 2 위치로부터 상기 제 1 위치까지의 경로에 대응하는 가이드 정보를 제공하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는 제 1 경로 정보 및 제 2 경로 정보를 포함하고, 상기 제공하는 동작 은, 상기 가이드 정보로서, 상기 제 1 경로 정보에 대응하는 제 1 가이드 정보 및 상기 제 2 경로 정보에 대응 하는 제 2 가이드 정보를 상기 제 1 경로 정보 및 상기 제 2 경로 정보가 획득된 순서와 반대 순서로 출력하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 제공하는 동작은, 상기 이동에 대한 반대 방향을 상기 가이드 정보의 적어도 일 부로 출력하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 확인하는 동작 이전에, 상기 전자 장치와 통신 중인 외부 장치의 위치에 대응하 는 위치 정보를 획득하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는, 상기 위치 정보를 기준으로 상기 이동에 따라 결정된 상대적 위치 정보를 포함할 수 있다. 다양한 실시예에 따르면, 상기 위치 정보는, 상기 통신과 연관된 신호 세기가 지정된 범위에 속하는 경우, 상기 외부 장치로부터 자동으로 수신될 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는, 상기 이동에 대응하는 이동 방향 또는 이동 거리 중 적어도 하나의 정보를 포함할 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는, 상기 외부 장치에 대한 통신과 연관된 신호 세기가 지정된 범위에 속하는 경우, 자동으로 획득될 수 있다. 다양한 실시예에 따르면, 상기 통신과 연관된 신호 세기가 지정된 범위에 속하는 경우, 상기 외부 장치의 위치 에 대응하는 위치 정보를 상기 외부 장치로부터 수신하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 경로 정보는 제 1 경로 정보 및 제 2 경로 정보를 포함하고, 상기 제 1 경로 정 보는 상기 위치 정보를 기준으로 상기 이동의 제 1 구간에 따라 결정된 상대적 위치 정보를 포함하고, 상기 제 2 경로 정보는 상기 제 1 경로 정보를 기준으로 상기 이동의 제 2 구간에 따라 결정된 상대적 위치 정보를 포함 할 수 있다. 다양한 실시예에 따르면, 상기 위치 정보는, 상기 외부 장치의 이동에 따라 업데이트될 수 있다. 다양한 실시예에 따르면, 상기 위치 정보는, 상기 위치에 대응하는 위도, 경도, 또는 장소 중 적어도 하나를 포 함할 수 있다. 다양한 실시예에 따르면, 상기 외부 장치를 통하여 상기 경로 정보에 해당하는 지도 정보가 표시될 수 있도록 상기 경로 정보를 상기 외부 장치로 전송하는 동작을 더 포함할 수 있다. 이하, 도 11 내지 도 13과 관련하여, 상기 신호 감지 모듈 390과 연관된 추가적인 정보가 기재된다. 상기 경로 제공 모듈 370의 추가적인 정보와 동일 또는 유사한 추가적인 정보에 대한 설명은 생략된다. 도 11은 다양한 실 시예에 따른 전자 장치(예: 전자 장치 301, 이하, 설명의 편의 상, \"메인 전자 장치\")의 신호 감지 모듈 390의 블록도 1100을 도시한다. 한 실시예에 따르면, 상기 신호 감지 모듈 390은 확인 모듈 1110, 획득 모듈 1130, 결정 모듈 1150, 및 감지 모 듈 1170을 포함할 수 있다. 확인 모듈 1110은, 예를 들면, 상기 메인 전자 장치와 기능적으로 연결된 적어도 하나의 센서를 통하여, 상기 메인 전자 장치의 위치를 감지할 수 있다. 한 실시예에 따르면, 상기 확인 모듈 1110은 상기 메인 전자 장치와 통신(예: 근거리 통신으로서, D2D 통신) 가능한 외부 장치(예: 전자 장치 304, 이하, 설명의 편의 상, \"서브 전 자 장치\")에서 송신되는 신호의 세기가 지정된 범위에 속하는 경우, 상기 메인 전자 장치의 상기 위치를 확인할 수 있다. 예를 들면, 상기 확인 모듈 1110은 상기 서브 전자 장치로부터 송신되는 신호(이하, 설명의 편의 상, \"송신 신호\")가 감지되지 않는 경우(예: '상', '중', 또는 '하'로 구분된 신호 세기에서 '하'에 속하는 경우), 상기 메인 전자 장치의 위치를 자동으로 확인할 수 있다. 한 실시예에 따르면, 상기 송신 신호가 '하'에 속하는 경우, 상기 확인 모듈 1110은 상기 서브 전자 장치가 분실되었다고 판단할 수 있다. 또한, 상기 확인 모듈 1110 은 상기 분실에 대한 알림을 상기 메인 전자 장치를 통하여 제공할 수 있다. 한 실시예에 따르면, 상기 확인 모듈 1110은 상기 메인 전자 장치의 움직임 정도가 지정된 범위에 속하는 경우, 상기 위치를 획득할 수 있다. 예를 들면, 상기 메인 전자 장치의 움직임 정도는 '상(빠름)', '중(느림)', 또는 '하(정지)'로 구분될 수 있다. 예컨대, 상기 메인 전자 장치를 소지한 사용자가 빨리 걷거나 뛰거나, 또는 상기 메인 전자 장치가 이동 차량에 위치하는 경우, 상기 메인 전자 장치의 움직임 정도는 '상'에 속할 수 있다. 상 기 메인 전자 장치를 소지한 사용자가 보통 걸음으로 걷는 경우, 상기 메인 전자 장치의 움직임 정도는 '중'에 속할 수 있다. 상기 메인 전자 장치가 특정 위치에 놓여져 있거나, 상기 사용자가 움직이지 않는 경우, 상기 메 인 전자 장치의 움직임 정도는 '하'에 속할 수 있다. 한 실시예에 따르면, 상기 메인 전자 장치의 움직임 정도가 '상'에 속하는 경우, 상기 확인 모듈 1110은 메인 전자 장치의 위치를 확인하지 않을 수 있다. 예를 들면, 상기 송신 신호가 감지되지 않더라도, 상기 메인 전자 장치가 빠른 속도로 이동하는 경우, 상기 확인 모듈 1110은 상기 메인 전자 장치의 위치를 확인하는 동작을 생 략할 수 있다. 반면에, 상기 메인 전자 장치의 움직임 정도가 '하'에 속하는 경우, 상기 확인 모듈 1110은 상기 메인 전자 장치의 위치를 확인할 수 있다. 예를 들면, 상기 송신 신호가 감지되지 않을 뿐만 아니라, 상기 메인 전자 장치가 정지된 상태인 경우, 상기 확인 모듈 1110은 상기 메인 전자 장치의 위치를 확인할 수 있다. 한 실시예에 따르면, 상기 메인 전자 장치의 위치는, 한 지점의 좌표 단위, 선 단위, 또는 지오펜싱(geo- fencing) 단위로 나타낼 수 있다. 지오펜싱은, 예를 들면, GPS 울타리(예: 특정 면적을 가지는 영역)를 설정하 여, 상기 메인 전자 장치가 상기 GPS 울타리를 넘나드는 것(예: 출입 여부)을 감지할 수 있다. 한 실시예에 따 르면, 상기 확인 모듈 1110은 GPS 정보를 수신할 수 있는 GPS 모듈을 통하여 상기 메인 전자 장치의 위치를 확 인할 수 있다. 또한, 상기 확인 모듈 1110은, 예를 들면, Wifi 통신을 지원하는 Wifi 모듈을 통한 삼각측량법 (triangulation method)을 이용하여 상기 메인 전자 장치의 지리적 위치를 결정할 수 있다. 상기 GPS 모듈 또는 Wifi 모듈을 이용한 상기 메인 전자 장치의 위치 확인 방법은 일 예로서, 확인 모듈 1110은 다양한 센서들을 통 하여 상기 메인 전자 장치의 위치를 확인할 수 있다. 상기 획득 모듈 1130은, 예를 들면, 상기 메인 전자 장치와 연관된 로그 정보(log information)를 획득할 수 있 다. 예를 들면, 상기 획득 모듈 1130은 상기 메인 전자 장치가 방문한 장소 또는 상기 방문한 장소에 대응하는 방문 횟수를 확인할 수 있다. 한 실시예에 따르면, 상기 획득 모듈 1130은 상기 방문 횟수에 기반하여, 상기 방 문한 장소에 다른 우선 순위를 부여할 수 있다. 예컨대, 제 1 방문 횟수를 가지는 제 1 방문 장소에는 제 1 우 선 순위가 부여될 수 있으며, 제 2 방문 횟수를 가지는 제 2 방문 장소에는 제 2 우선 순위가 부여될 수 있다. 또한, 제 1 방문 횟수가 제 2 방문 횟수보다 많은 경우, 상기 제 1 우선 순위가 상기 제 2 우선 순위보다 높을 수 있다. 한 실시예에 따르면, 상기 획득 모듈 1130은 상기 메인 전자 장치의 사용자와 연관된 일정을 확인할 수 있다. 예컨대, 획득 모듈 1130은 일정 어플리케이션에 저장된 사용자의 일정을 이용하여, 특정 시간(예: 년, 월, 일, 또는 시)에 대응하는 특정 장소를 확인할 수 있다. 예를 들면, 상기 일정 어플리케이션을 통하여 2014년 1월 31 일 14시에 건물 A에서 회의가 있다고 저장된 경우, 상기 획득 모듈 1130은 '2014년 1월 31일 14시' 및 '건물 A'라는 정보를 확인할 수 있다. 한 실시예에 따르면, 상기 획득 모듈 1130은 상기 일정에 기반하여, 상기 서브 전자 장치가 현재 위치할 가능성 이 있는 장소(이하, 설명의 편의 상, \"예측 장소\")를 예측할 수 있다. 예컨대, 상기 획득 모듈 1130은 '2014년 1월 31일 14시' 및 '건물 A'라는 일정에 기반하여, 상기 서브 전자 장치에 대해 발생할 수 있는 이벤트(예: 특 정 시간에 건물 A에 진입)를 확인할 수 있으며, 그에 따른 예측 장소를 결정할 수 있다. 결정 모듈 1150은, 예를 들면, 상기 메인 전자 장치의 위치에 기반하여, 상기 서브 전자 장치로부터 송신되는 신호를 감지하기 위한 주기를 다르게 결정할 수 있다. 예를 들면, 상기 결정 모듈 1150은 상기 위치가 제 1 위치인 경우, 상기 주기를 제 1 주기로 결정할 수 있으며, 상기 위치가 제 2 위치인 경우, 상기 주기를 제 2 주기 로 결정할 수 있다. 한 실시예에 따르면, 상기 결정 모듈 1150은 상기 방문 장소에 대응하는 방문 횟수 또는 상 기 일정 중 적어도 하나에 더 기반하여, 상기 주기를 결정할 수 있다. 예를 들면, 상기 결정 모듈 1150은 더 높 은 우선 순위를 가지는 제 1 방문 장소에는 더 짧은 주기를 가지는 제 1 주기를 결정(예: 부여)할 수 있으며, 더 낮은 우선 순위를 가지는 제 2 방문 장소에는 더 긴 주기를 가지는 제 2 주기를 결정(예: 부여)할 수 있다. 이 경우, 상기 메인 전자 장치가 상기 제 1 방문 장소에 위치하는 경우, 상기 제 1 주기가 결정되며, 상기 메인 전자 장치가 제 2 방문 장소에 위치하는 경우, 상기 제 2 주기가 결정된다. 한 실시예에 따르면, 상기 결정 모듈 1150은 상기 메인 전자 장치가 상기 일정에 기반하여 결정된 상기 예측 장 소에 위치하는 경우, 상기 주기를 제 1 주기로 결정할 수 있다. 반면에, 상기 메인 전자 장치가 상기 예측 장소 에 위치하지 않는 경우, 상기 주기를 제 2 주기로 결정할 수 있다. 상기 제 1 주기는 상기 제 2 주기보다 더 짧 을 수 있다. 감지 모듈 1170은, 예를 들면, 상기 메인 전자 장치의 위치에 기반하여 다르게 결정된 주기에 따라 상기 서브 전자 장치로부터 송신되는 신호를 감지(예: 스캐닝)할 수 있다. 한 실시예에 따르면, 상기 메인 전자 장치가 제 1 우선 순위를 가지는 제 1 방문 장소에 위치하는 경우, 상기 감지 모듈 1170은 상기 서브 전자 장치로부터 송 신되는 송신 신호를 제 1 주기로 감지할 수 있다. 반면에, 상기 메인 전자 장치가 제 2 우선 순위를 가지는 제 2 방문 장소에 위치하는 경우, 상기 감지 모듈 1170은 상기 송신 신호를 제 2 주기로 감지할 수 있다. 한 실시예에 따르면, 상기 메인 전자 장치가 상기 일정에 반영된 시간에, 상기 시간에 대응하는 지오펜싱에 위 치하는 경우, 상기 감지 모듈 1170은 제 1 주기로 상기 송신 신호를 감지할 수 있다. 반면에, 상기 메인 전자 장치가 상기 시간에 상기 지오펜싱이 아닌 다른 지역에 위치하는 경우, 상기 감지 모듈 1170은 상기 제 1 주기 보다 더 긴 제 2 주기로 상기 송신 신호를 감지할 수 있다. 상기 감지 모듈 1170은, 예를 들면, 상기 메인 전자 장치가 상기 서브 전자 장치로부터 송신되는 송신 신호를 수신하지 못하는 경우, 상기 송신 신호를 스캐닝하기 위한 주기를 메인 전자 장치의 위치에 따라 조정함으로써, 메인 전자 장치의 소모 전류를 개선시킬 수 있다. 다양한 실시예에 따른 신호를 감지하기 위한 전자 장치는, 예를 들면, 상기 전자 장치의 위치를 감지하기 위한 적어도 하나의 센서 및 상기 위치에 기반하여 다르게 결정된 주기에 따라, 외부 장치로부터 송신된 신호를 감지 하도록 설정된 신호 감지 모듈을 포함할 수 있다. 다양한 실시예에 따르면, 상기 신호 감지 모듈은, 상기 위치가 제 1 위치인 경우, 제 1 주기에 따라 상기 신호 를 감지하고, 상기 위치가 제 2 위치인 경우, 제 2 주기에 따라 상기 신호를 감지할 수 있다. 다양한 실시예에 따르면, 상기 신호 감지 모듈은, 상기 신호의 세기 또는 상기 전자 장치의 움직임 정도가 지정 된 범위에 속하는 경우, 상기 위치를 획득할 수 있다. 다양한 실시예에 따르면, 상기 주기는, 상기 전자 장치가 위치했던 장소(place)의 방문 횟수 또는 상기 전자 장 치에 대한 사용자의 일정(schedule) 중 적어도 하나에 더 기반하여, 결정될 수 있다. 다양한 실시예에 따르면, 상기 신호 감지 모듈은, 상기 일정에 기반하여, 상기 외부 장치의 예측 장소를 확인하 고, 상기 전자 장치가 상기 예측 장소에 위치하는 경우, 제 1 주기에 따라 상기 신호를 감지하고, 상기 전자 장 치가 상기 예측 장소에 위치하지 않는 경우, 제 2 주기에 따라 상기 신호를 감지할 수 있다. 도 12는 다양한 실시예에 따른 메인 전자 장치가 서브 전자 장치로부터 송신된 신호를 감지하는 방법의 일 예 1200를 보여주는 흐름도를 도시한다. 동작 1210에서, 메인 전자 장치(예: 확인 모듈 1110)는 적어도 하나의 센 서(예: GPS 모듈 또는 Wifi 모듈)를 통하여 상기 메인 전자 장치의 위치(예: 상기 메인 전자 장치가 현재 위치 하는 GPS 정보 또는 지오펜싱 정보)를 확인할 수 있다. 동작 1230에서, 상기 메인 전자 장치(예: 감지 모듈 1170)는 상기 위치에 기반하여 다르게 결정된 주기에 따라, 상기 메인 전자 장치와 통신 가능한 서브 전자 장치 로부터 송신된 신호를 감지(예: 스캐닝)를 할 수 있다. 예컨대, 상기 위치가, 상기 메인 전자 장치가 과거에 자 주 위치했던 사무실인 경우, 상기 메인 전자 장치는 기본적으로 설정된 주기보다 더 짧은 주기로 상기 송신 신 호를 감지할 수 있다. 반면에, 상기 위치가, 상기 메인 전자 장치가 과거에 드물게 위치했던 놀이 동산인 경우, 상기 메인 전자 장치는 기본적으로 설정된 주기보다 더 긴 주기로 상기 송신 신호를 감지할 수 있다. 도 13은 다양한 실시예에 따른 메인 전자 장치가 서브 전자 장치로부터 송신된 신호를 감지하는 방법의 일 예 1300를 보여주는 흐름도를 도시한다. 동작 1310에서, 상기 메인 전자 장치와 서브 전자 장치가 신호를 서로 안 정적으로 송수신하는 경우(예: 송신 신호의 세기가 '상' 또는 '중'에 속하는 경우), 상기 메인 전자 장치는 상 기 메인 전자 장치의 사용자 또는 설계자에 의해서 기본적으로 설정된 기본 주기로 상기 서브 전자 장치로부터송신되는 송신 신호를 스캔(scan)할 수 있다. 동작 1320에서, 상기 메인 전자 장치는 상기 송신 신호의 수신 감 도(예: RSSI)에 기반하여, 상기 메인 전자 장치가 상기 서브 전자 장치로부터 송신된 신호를 수신하지 못하는 상태, 예컨대, 서브 전자 장치가 분실 상태인 지를 판단할 수 있다. 상기 메인 전자 장치가 상기 송신 신호를 안정적으로 수신하는 경우, 동작 1310를 통하여, 상기 메인 전자 장치 는 상기 기본 주기를 유지하여 상기 송신 신호를 계속 스캔할 수 있다. 반면에, 동작 1330에서, 서브 전자 장치 가 분실 상태인 것으로 판단된 경우, 상기 메인 전자 장치는 상기 메인 전자 장치의 소모 전류를 감소시키기 위 하여, 스캔 주기를 증가시킬 수 있다. 상기 스캔 주기는, 예를 들면, 상기 기본 주기보다 더 길 수 있다. 동작 1340에서, 상기 메인 전자 장치는 상기 메인 전자 장치의 상태(예: 움직임 정도)를 체크할 수 있다. 예를 들면, 상기 메인 전자 장치는 상기 메인 전자 장치가 움직이는 지, 움직임이 어느 정도인지, 또는 상기 메인 전 자 장치의 정지 여부 등에 대한 정보를 획득할 수 있다. 동작 1350에서, 상기 메인 전자 장치는 상기 메인 전자 장치의 상태에 기반하여, 상기 메인 전자 장치의 정지 여부를 판단할 수 있다. 상기 메인 전자 장치가 정지하지 않은 경우, 동작 1340을 통하여, 상기 메인 전자 장치는 상기 메인 전자 장치의 상태를 계속 체크할 수 있다. 동작 1360에서, 상기 메인 전자 장치가 정지한 경우, 상기 메인 전자 장치는 상기 메인 전자 장치가 현재 위치 하는 위치를 확인할 수 있다. 동작 1370에서, 상기 메인 전자 장치는 상기 메인 전자 장치의 방문 장소 또는 일정 중 적어도 하나에 기반하여, 상기 스캔 주기를 조정할 수 있다. 예를 들면, 상기 메인 전자 장치의 현재 위치가 방문 횟수가 상대 적으로 많은 방문 장소에 위치하는 경우, 상기 메인 전자 장치는 스캔 주기가 현재 설정된 스캔 주기보다 좀 더 짧게 되도록 상기 스캔 주기를 조정할 수 있다. 반면에, 상기 메인 전자 장치의 현재 위치가 방문 횟수가 상대 적으로 적은 방문 장소에 위치하는 경우, 상기 메인 전자 장치는 스캔 주기가 현재 설정된 주기보다 좀 더 길게 되도록 상기 스캔 주기를 조정할 수 있다. 다른 예를 들면, 상기 메인 전자 장치의 상기 현재 위치가 상기 사용자의 일정에 저장된 시간에 대응하는 위치 에 위치하는 경우, 상기 메인 전자 장치는 상기 스캔 주기가 상기 설정된 주기보다 좀 더 짧게 되도록, 상기 스 캔 주기를 조정할 수 있다. 반면에, 상기 메인 전자 장치의 상기 현재 위치가 상기 사용자의 일정에 저장된 시 간에 상기 대응하는 위치가 아닌 다른 위치에 위치하는 경우, 상기 메인 전자 장치는 상기 스캔 주기가 상기 설 정된 주기보다 좀 더 길게 되도록, 상기 스캔 주기를 조정할 수 있다. 다양한 실시예는 메인 전자 장치가 상기 메인 전자 장치의 서브 전자 장치(예: 액세서리 장치)의 존재를 확인하지 못하는 경우(예: 상기 액세서리 장치 의 분실), 상기 서브 전자 장치를 검색하기 위한 주기를 조정함으로써, 상기 메인 전자 장치의 소모 전류를 개 선시킬 수 있다. 도 14는 다양한 실시예들에 따른 전자 장치 1401의 블록도 1400를 도시한다. 상기 전자 장치 1401는, 예를 들면, 도 3에 도시된 전자 장치 301의 전체 또는 일부를 구성할 수 있다. 도 14를 참조하면, 상기 전자 장치 1401는 하나 이상의 어플리케이션 프로세서(AP: application processor) 1410, 통신 모듈 1420, SIM(subscriber identification module) 카드 1424, 메모리 1430, 센서 모듈 1440, 입력 장치 1450, 디스플레 이 1460, 인터페이스 1470, 오디오 모듈 1480, 카메라 모듈 1491, 전력관리 모듈 1495, 배터리 1496, 인디케이 터 1497 및 모터 1498 를 포함할 수 있다. 상기 AP 1410는 운영체제 또는 응용 프로그램을 구동하여 상기 AP 1410에 연결된 다수의 하드웨어 또는 소프트 웨어 구성요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 상기 AP 1410는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시예에 따르면, 상기 AP 1410는 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 상기 통신 모듈 1420(예: 상기 통신 인터페이스 160)은 상기 전자 장치 1401(예: 상기 전자 장치 301)와 네트워 크를 통해 연결된 다른 전자 장치들(예: 전자 장치 304 또는 서버 306) 간의 통신에서 데이터 송수신을 수행할 수 있다. 한 실시예에 따르면, 상기 통신 모듈 1420은 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427, NFC 모듈 1428 및 RF(radio frequency) 모듈 1429를 포함할 수 있다. 상기 셀룰러 모듈 1421은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈 1421은, 예를 들면, 가입자 식별 모듈(예: SIM 카드 1424)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수 행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈 1421은 상기 AP 1410가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 예를 들면, 상기 셀룰러 모듈 1421은 멀티 미디어 제어 기능의 적어도 일부를 수행할 수 있다. 한 실시예에 따르면, 상기 셀룰러 모듈 1421은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 또한, 상기 셀룰러 모듈 1421은, 예를 들면, SoC로 구현될 수 있다. 도 14에서는 상기 셀룰러 모듈 1421(예: 커뮤니케이션 프로세서), 상기 메모리 1430 또는 상기 전력관리 모듈 1495 등의 구성요소들이 상기 AP 1410와 별개의 구성요소로 도시되어 있으나, 한 실시예에 따르면, 상기 AP 1410가 전술한 구성요소들의 적어도 일부(예: 셀룰러 모듈 1421)를 포함하도록 구현될 수 있다. 한 실시예에 따르면, 상기 AP 1410 또는 상기 셀룰러 모듈 1421(예: 커뮤니케이션 프로세서)은 각각에 연결된 비휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리할 수 있다. 또한, 상기 AP 1410 또는 상기 셀룰러 모듈 1421은 다른 구성요소 중 적어도 하나 로부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 상기 Wifi 모듈 1423, 상기 BT 모듈 1425, 상기 GPS 모듈 1427 또는 상기 NFC 모듈 1428 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 14에서는 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 또는 NFC 모듈 1428이 각각 별개의 블록으로 도시되 었으나, 한 실시예에 따르면, 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 또는 NFC 모듈 1428 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. 예 를 들면, 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 또는 NFC 모듈 1428 각각에 대응하 는 프로세서들 중 적어도 일부(예: 셀룰러 모듈 1421에 대응하는 커뮤니케이션 프로세서 및 Wifi 모듈 1423에 대응하는 Wifi 프로세서)는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈 1429는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈 1429는, 도 시되지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈 1429는 무선 통신에서 자 유 공간상의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 14에서는 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 및 NFC 모듈 1428이 하나의 RF 모듈 1429을 서로 공유하는 것으로 도시되어 있으나, 한 실시예에 따르면, 셀룰러 모듈 1421, Wifi 모듈 1423, BT 모듈 1425, GPS 모듈 1427 또는 NFC 모듈 1428 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행 할 수 있다. 상기 SIM 카드 1424는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 삽입될 수 있다. 상기 SIM 카드 1424는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리 1430(예: 상기 메모리 130)는 내장 메모리 1432 또는 외장 메모리 1434를 포함할 수 있다. 상기 내장 메모리 1432는, 예를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM) 등) 또는 비휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 상기 내장 메모리 1432는 Solid State Drive (SSD)일 수 있다. 상기 외장 메모리 1434는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini- SD(mini secure digital), xD(extreme digital) 또는 Memory Stick 등을 더 포함할 수 있다. 상기 외장 메모리 1434는 다양한 인터페이스를 통하여 상기 전자 장치 1401과 기능적으로 연결될 수 있다. 한 실시예에 따르면, 상기 전자 장치 1401는 하드 드라이브와 같은 저장 장치(또는 저장 매체)를 더 포함할 수 있다. 상기 센서 모듈 1440은 물리량을 계측하거나 전자 장치 1401의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 상기 센서 모듈 1440은, 예를 들면, 제스처 센서 1440A, 자이로 센서 1440B, 기 압 센서 1440C, 마그네틱 센서 1440D, 가속도 센서 1440E, 그립 센서 1440F, 근접 센서 1440G, color 센서 1440H(예: RGB(red, green, blue) 센서), 생체 센서 1440I, 온/습도 센서 1440J, 조도 센서 1440K 또는 UV(ultra violet) 센서 1440M 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모 듈 1440은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG센서(electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infrared) 센 서(미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈 1440은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 입력 장치 1450은 터치 패널(touch panel) 1452, (디지털) 펜 센서(pen sensor) 1454, 키(key) 1456 또는 초음파(ultrasonic) 입력 장치 1458를 포함할 수 있다. 상기 터치 패널 1452은, 예를 들면, 정전식, 감압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널 1452은 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터 치 패널 1452은 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널 1452은 사용 자에게 촉각 반응을 제공할 수 있다. 상기 (디지털) 펜 센서 1454는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도 의 인식용 쉬트(sheet)를 이용하여 구현될 수 있다. 상기 키 1456는, 예를 들면, 물리적인 버튼, 광학식 키 또 는 키패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치 1458는 초음파 신호를 발생하는 입력 도구를 통해, 전자 장치 1401에서 마이크(예: 마이크 1488)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서, 무 선 인식이 가능하다. 한 실시예에 따르면, 상기 전자 장치 1401는 상기 통신 모듈 1420를 이용하여 이와 연결 된 외부 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 상기 디스플레이 1460(예: 상기 디스플레이 150)은 패널 1462, 홀로그램 장치 1464 또는 프로젝터 1466을 포함 할 수 있다. 상기 패널 1462은, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등일 수 있다. 상기 패널 1462은, 예를 들면, 유연하게(flexible), 투명하게 (transparent) 또는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널 1462은 상기 터치 패널 1452과 하 나의 모듈로 구성될 수도 있다. 상기 홀로그램 장치 1464은 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터 1466는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치 1401의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 상기 디스플레이 1460은 상기 패널 1462, 상기 홀로그램 장치 1464, 또는 프로젝터 1466를 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 인터페이스 1470는, 예를 들면, HDMI(high-definition multimedia interface) 1472, USB(universal serial bus) 1474, 광 인터페이스(optical interface) 1476 또는 D-sub(D-subminiature) 1478를 포함할 수 있 다. 상기 인터페이스 1470는, 예를 들면, 도 3에 도시된 통신 인터페이스 160에 포함될 수 있다. 추가적으로 또는 대체적으로, 상기 인터페이스 1470는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터 페이스를 포함할 수 있다. 상기 오디오 모듈 1480은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈 1480의 적어도 일부 구성요소는, 예를 들면, 도 3 에 도시된 입출력 인터페이스 140에 포함될 수 있다. 상기 오디오 모듈 1480은, 예를 들면, 스피커 1482, 리시버 1484, 이어폰 1486 또는 마이크 1488 등을 통해 입력 또는 출력 되는 소리 정보를 처리할 수 있다. 상기 카메라 모듈 1491은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래 쉬 (flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈 1495은 상기 전자 장치 1401의 전력을 관리할 수 있다. 도시되지는 않았으나, 상기 전력 관리 모듈 1495은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분 될 수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충 전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방 식 등이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리 1496의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 상기 배터리 1496는 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치1401에 전원을 공급할 수 있다. 상기 배터리 1496는, 예를 들면, 충전식 전지(rechargeable battery) 또는 태 양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터 1497는 상기 전자 장치 1401 혹은 그 일부(예: 상기 AP 1410)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터 1498는 전기적 신호를 기계적 진동으로 변 환할 수 있다. 도시되지는 않았으나, 상기 전자 장치 1401는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함 할 수 있다. 상기 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(component) 으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다양 한 실시예에 따른 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소 들의 기능을 동일하게 수행할 수 있다. 도 15는 다양한 실시예들에 따른 복수의 전자 장치들(예: 전자 장치 1510 및 전자 장치 1530) 사이의 통신 프로 토콜 1500을 도시한다. 도 15를 참조하면, 예를 들면, 상기 통신 프로토콜 1500은, 장치 발견 프로토콜(device discovery protocol) 1551, 기능 교환 프로토콜(capability exchange protocol) 1553, 네트워크 프로토콜 (network protocol) 1555 및 어플리케이션 프로토콜(application protocol) 1557 등을 포함할 수 있다. 한 실시예에 따르면, 상기 장치 발견 프로토콜 1551은 전자 장치들(예: 전자 장치 1510 또는 전자 장치 1530)이 자신과 통신 가능한 외부 전자 장치를 감지하거나 감지된 외부 전자 장치와 연결하기 위한 프로토콜일 수 있다. 예를 들면, 전자 장치 1510(예: 전자 장치 301)은, 상기 장치 발견 프로토콜 1551을 이용하여, 상기 전자 장치 1510에서 사용 가능한 통신 방법(예: Wifi, BT 또는 USB 등)을 통해, 상기 전자 장치 1510와 통신 가능한 기기 (device)로, 전자 장치 1530(예: 전자 장치 304)를 감지할 수 있다. 상기 전자 장치 1510는, 상기 전자 장치 1530과의 통신 연결을 위해, 상기 장치 발견 프로토콜 1551을 이용하여, 감지된 전자 장치 1530에 대한 식별 정 보를 획득하여 저장할 수 있다. 상기 전자 장치 1510는, 예를 들면, 적어도 상기 식별 정보에 기반하여, 상기 전자 장치 1530와의 통신 연결을 개설할 수 있다. 어떤 실시예에 따르면, 상기 장치 발견 프로토콜 1551은 복수의 전자 장치들 사이에서 상호 인증을 하기 위한 프로토콜일 수 있다. 예를 들면, 전자 장치 1510는 적어도 전자 장치 1530와 연결을 위한 통신 정보(예: MAC(media access control) address, UUID(universally unique identifier), SSID(subsystem identification), IP(internet protocol) address)에 기반하여, 상기 전자 장치 1510와 상기 전자 장치 1530 간의 인증을 수행할 수 있다. 한 실시예에 따르면, 상기 기능 교환 프로토콜 1553은 전자 장치 1510 또는 전자 장치 1530 중 적어도 하나에서 지원 가능한 서비스의 기능과 관련된 정보를 교환하기 위한 프로토콜일 수 있다. 예를 들면, 전자 장치 1510 및 전자 장치 1530은 상기 기능 교환 프로토콜 1553을 통하여, 각각이 현재 제공하고 있는 서비스의 기능과 관 련된 정보를 서로 교환할 수 있다. 교환 가능한 정보는 전자 장치 1510 및 전자 장치 1530에서 지원 가능한 복 수의 서비스들 중에서 특정 서비스를 가리키는 식별 정보를 포함할 수 있다. 예를 들면, 전자 장치 1510는 상 기 기능 교환 프로토콜 1553을 통해 전자 장치 1530로부터 상기 전자 장치 1530가 제공하는 특정 서비스의 식별 정보를 수신할 수 있다. 이 경우, 제 1 전자 장치 1510는 상기 수신된 식별 정보에 기반하여, 상기 전자 장치 1510이 상기 특정 서비스를 지원할 수 있는지 여부를 판단할 수 있다. 한 실시예에 따르면, 상기 네트워크 프로토콜 1555은 통신이 가능하도록 연결된 전자 장치들(예: 전자 장치 1510, 전자 장치 1530) 간에, 예컨대, 서비스를 연동하여 제공하기 위하여 송수신 되는, 데이터 흐름을 제어하 기 위한 프로토콜일 수 있다. 예를 들면, 전자 장치 1510 또는 전자 장치 1530 중 적어도 하나는 상기 네트워 크 프로토콜 1555을 이용하여, 오류 제어, 또는 데이터 품질 제어 등을 수행할 수 있다. 추가적으로 또는 대체 적으로, 상기 네트워크 프로토콜 1555은 전자 장치 1510와 전자 장치 1530 사이에서 송수신되는 데이터의 전송 포맷을 결정할 수 있다. 또한, 전자 장치 1510 또는 전자 장치 1530 중 적어도 하나는 상기 네트워크 프로토콜 1555를 이용하여 상호간의 데이터 교환을 위한 적어도 세션(session)을 관리(예: 세션 연결 또는 세션 종료)할 수 있다. 한 실시예에 따르면, 상기 어플리케이션 프로토콜 1557은 외부 전자 장치로 제공되는 서비스와 관련된 데이터를 교환하기 위한, 절차 또는 정보를 제공하기 위한 프로토콜일 수 있다. 예를 들면, 전자 장치 1510(예: 전자 장 치 101)은 상기 어플리케이션 프로토콜 1557을 통해 전자 장치 1530(예: 전자 장치 304 또는 서버 306)로 서비 스를 제공할 수 있다. 한 실시예에 따르면, 상기 통신 프로토콜 1500은 표준 통신 프로토콜, 개인 또는 단체에서 지정한 통신 프로토 콜(예: 통신 장치 제조 업체 또는 네트워크 공급 업체 등에서 자체적으로 지정한 통신 프로토콜) 또는 이들의 조합을 포함할 수 있다. 본 발명의 다양한 실시예에 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은 예를 들면, 유닛(unit), 로직 (logic), 논리 블록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용 (interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으 로 또는 전자적으로 구현될 수 있다. 예를 들면, 본 발명의 다양한 실시예에 따른 \"모듈\"은, 알려졌거나 앞으 로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field- programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함 할 수 있다. 다양한 실시예에 따르면, 본 발명의 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동 작들)의 적어도 일부는, 예컨대, 프로그래밍 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어는, 하나 이상의 프로세서 (예: 상기 프로세서 122)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨 터로 읽을 수 있는 저장매체는, 예를 들면, 상기 메모리 130가 될 수 있다. 상기 프로그래밍 모듈의 적어도 일 부는, 예를 들면, 상기 프로세서210에 의해 구현(implement)(예: 실행)될 수 있다. 상기 프로그래밍 모듈 의 적어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트 (sets of instructions) 또는 프로세스 등을 포함할 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체에는 하드디스크, 플로피디스크 및 자기 테이프와 같은 마그네틱 매체 (Magnetic Media)와, CD-ROM(Compact Disc Read Only Memory), DVD(Digital Versatile Disc)와 같은 광기록 매체(Optical Media)와, 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media)와, 그 리고 ROM(Read Only Memory), RAM(Random Access Memory), 플래시 메모리 등과 같은 프로그램 명령(예: 프로그 래밍 모듈)을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함될 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실 행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 본 발명의 다양한 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 본 발명의 다양한 실시예에 따른 모듈 또는 프로그래밍 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함 하거나, 일부가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 본 발명의 다양한 실시예에 따른 모듈, 프로그래밍 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리 스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 다양한 실시예에 따르면, 명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서 에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로 서, 상기 적어도 하나의 동작은, 위치 정보를 제공하기 위한, 전자 장치의 운영 방법에 관한 것으로서, 상기 전 자 장치에서, 상기 전자 장치의 제 1 위치로부터 제 2 위치로의 이동에 반응하여, 상기 전자 장치의 위치 변화 에 대응하는 경로 정보를 확인하는 동작 및 상기 전자 장치에서, 상기 경로 정보를 이용하여 상기 제 2 위치로 부터 상기 제 1 위치까지의 경로에 대응하는 가이드 정보를 제공하는 동작을 포함할 수 있다. 또는, 상기 적어도 하나의 동작은, 상기 전자 장치의 위치를 감지하는 동작 및 상기 위치에 기반하여 다르게 결 정된 주기에 따라, 외부 장치로부터 송신된 신호를 감지하는 동작을 포함할 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시예들은 본 발명의 실시예에 따른 의 기술 내용을 쉽게 설명하 고 본 발명의 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시예의 범위는 여기에 개시된 실시예들 이외에도 본 발명의 다양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0068159", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예에 따른, 사용자에 대한 복수의 전자 장치들의 사용 환경을 도시한다. 도 2a 및 도 2b는 다양한 실시예에 따른, 메인 전자 장치와 서브 전자 장치를 통하여 어플리케이션을 실행하는 일 예를 도시한다. 도 3은 다양한 실시예에 따른, 전자 장치를 포함하는 네트워크 환경을 도시한다. 도 4는 다양한 실시예에 따른, 전자 장치의 경로 제공 모듈의 블록도를 도시한다. 도 5a 및 도 5b는 다양한 실시예에 따른, 서브 전자 장치와 메인 전자 장치 사이의 통신과 연관된 신호 세기의 일 예를 도시한다. 도 6은 다양한 실시예에 따른, 서브 전자 장치의 경로 정보를 획득하는 일 예를 도시한다. 도 7은 다양한 실시예에 따른, 서브 전자 장치가 경로 정보를 이용하여 가이드 정보를 제공하는 일 예를 도시한 다. 도 8은 다양한 실시예에 따른, 서브 전자 장치가 경로 정보를 이용하여 가이드 정보를 제공하는 일 예를 도시한 다. 도 9는 다양한 실시예에 따른, 서브 전자 장치의 가이드 정보를 제공하는 방법의 일 예를 보여주는 흐름도를 도 시한다. 도 10은 다양한 실시예에 따른, 서브 전자 장치의 가이드 정보를 제공하는 방법의 일 예를 보여주는 흐름도를 도시한다. 도 11은 다양한 실시예에 따른, 전자 장치의 신호 감지 모듈의 블록도를 도시한다. 도 12는 다양한 실시예에 따른, 메인 전자 장치가 서브 전자 장치로부터 송신된 신호를 감지하는 방법의 일 예 를 보여주는 흐름도를 도시한다. 도 13은 다양한 실시예에 따른, 메인 전자 장치가 서브 전자 장치로부터 송신된 신호를 감지하는 방법의 일 예 를 보여주는 흐름도를 도시한다. 도 14는 다양한 실시예들에 따른, 전자 장치의 블록도를 도시한다. 도 15는 다양한 실시예들에 따른, 복수의 전자 장치들 사이의 통신 프로토콜을 도시한다."}
