{"patent_id": "10-2022-0109771", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0030564", "출원번호": "10-2022-0109771", "발명의 명칭": "골 성장 단계의 분석 방법, 골 성장 단계 분석 장치, 및 골 성장 단계 분석 시스템", "출원인": "주식회사 크레스콤", "발명자": "이재준"}}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "골 분석 장치가 골의 성장 단계를 분석하는 방법에 있어서, 골 영역을 포함하는 의료 이미지를 획득하는 단계; 상기 의료 이미지로부터 관심 영역들을 검출하는 단계; 각 관심 영역 별로 골격 성숙 지표를 연산하는 단계; 상기 골격 성숙 지표에 기반하여 임시 성장 단계를 연산하는 단계; 상기 의료 이미지의 전체 영역으로부터 골 연령을 연산하는 단계; 골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상기 상관 관계 정보를 이용하여 상기 연산된 골 연령에 대응되는 기준 성장 단계를 연산하는 단계; 및상기 임시 성장 단계 및 상기 기준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하는 단계;를 포함하는, 골의 성장 단계 분석 방법."}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 골의 최종 성장 단계 정보를 연산하는 단계는, 상기 연산된 임시 성장 단계의 보정 이벤트를 검출하는 단계; 및상기 보정 이벤트가 검출된 경우에는 상기 기준 성장 단계에 기반하여 상기 임시 성장 단계를 보정하여 상기 최종 성장 단계 정보를 획득하고, 상기 보정 이벤트가 검출되지 않은 경우에는 상기 연산된 임시 성장 단계를 상기 최종 성장 단계 정보로 결정하는 단계;를 더 포함하는, 골의 성장 단계 분석 방법."}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 상기 골격 성숙 지표는, 골간과 골단의 넓이의 일치 여부, 골간을 골단이 덮었는지 여부, 또는 골단의 융합 여부에 따라 복수의 하위 분류로 구성된 SMI 지표인,골의 성장 단계 분석 방법."}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서, 상기 각 관심 영역 별로 골격 성숙 지표를 연산하는 단계는, 학습이 완료된 인공지능 모델을 획득하는 단계; 및공개특허 10-2024-0030564-3-학습이 완료된 인공지능 모델을 통하여, 상기 관심 영역으로부터 상기 골격 성숙 지표의 하위 분류에 해당할 확률값을 획득하는 단계;를 더 포함하는, 골의 성장 단계 분석 방법."}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 상기 인공지능 모델은, 의료 이미지의 관심 영역과 관심 영역에 대하여 할당된 상기 골격 성숙 지표의 하위 분류 값으로 구성된 학습데이터 세트에 기반하여 훈련되는, 골의 성장 단계 분석 방법."}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서, 상기 인공지능 모델은, 상기 인공지능 모델로부터 출력된 예측 값과 상기 하위 분류 값의 차이에 근거하여 상기 예측 값이 상기 하위분류 값에 근사되어 출력되도록 훈련되는, 골의 성장 단계 분석 방법."}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 상기 임시 성장 단계 또는 상기 기준 성장 단계는, 급성장기, 급성장기 이전, 및 급성장기 이후 중 적어도 하나에 해당하는, 골의 성장 단계 분석 방법."}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서, 상기 관심 영역은, 세번째 손가락 말절골(DP3), 세번째 손가락 중절골(MP3), 세번째 손가락 기절골(PP3MC), 다섯째 손가락 중절골(MP5), 엄지 종자골(PP1), 및 요골(Radius) 중 적어도 하나에 대응되는 영역을 포함하는,골의 성장 단계 분석 방법."}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "컴퓨터에 제1 항 내지 제8 항 중 어느 하나의 항에 따른 방법을 실행시키기 위한 프로그램을 기록한 컴퓨터로읽을 수 있는 기록 매체."}
{"patent_id": "10-2022-0109771", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2024-0030564-4-골 영역을 포함하는 의료 이미지를 획득하고, 의료 이미지로부터 골의 성장 단계를 연산하는 골 성장 단계 분석장치에, 골 영역을 포함하는 의료 이미지를 획득하는 영상 획득부; 및상기 의료 이미지로부터 골의 성장 단계를 연산하도록 구성될 프로세스를 포함하되,상기 프로세서는, 상기 의료 이미지로부터 관심 영역들을 검출하고, 각 관심 영역 별로 골격 성숙 지표를 연산하고, 상기 골격 성숙 지표에 기반하여 임시 성장 단계를 연산하고, 상기 의료 이미지의 전체 영역으로부터 골 연령을 연산하고,골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상기 상관 관계 정보를 이용하여 상기 연산된 골 연령에 대응되는 기준 성장 단계를 연산하고, 상기 임시 성장 단계 및 상기 기준 성장 단계에 기반하여 골의 최종성장 단계 정보를 연산하도록 구성된, 골 성장 단계 분석 장치."}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 일 실시예에 따른 골의 성장 단계 분석 방법은, 골 영역을 포함하는 의료 이미지를 획득하는 단계; 상 기 의료 이미지로부터 관심 영역들을 검출하는 단계; 각 관심 영역 별로 골격 성숙 지표를 연산하는 단계; 상기 골격 성숙 지표에 기반하여 임시 성장 단계를 연산하는 단계; 상기 의료 이미지의 전체 영역으로부터 골 연령을 연산하는 단계; 골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상기 상관 관계 정보를 이용하여 상기 연산된 골 연령에 대응되는 기준 성장 단계를 연산하는 단계; 및 상기 임시 성장 단계 및 상기 기준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하는 단계;를 포함한다."}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 골 성장 단계의 분석 방법, 골 성장 단계의 분석 장치, 및 골 성장 단계의 분석 시스템에 관한 것이다. 구체적으로 본 출원은 골 영역을 포함하는 의료 이미지로부터 골 성장 단계를 연산하기 위한 골 성장 단계 의 분석 방법, 골 성장 단계의 분석 장치, 및 골 성장 단계의 분석 시스템에 관한 것이다."}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이미지 분석 기술의 향상으로 인해, 골 영역을 포함하는 의료 영상을 분석하여 골의 성숙도를 연산하고 연산된 골의 성숙도에 기반하여 골의 성장 단계를 판단하기 위한 기술이 다방면으로 연구되고 있다. 아동청소년이 급성장기 이전인지, 급성장단계인지, 급성장기를 지났는지를 정확히 판단하는 것은, 아동청소년의 성장상태를 평가하고, 필요시 성장단계에 맞는 성장치료를 하는데 있어서 중요하다. 또한 치과에서는 적합한 교 정 방법을 찾기 위해, 아동청소년의 성장 단계를 평가하기 위하여 skeletal maturity indicators(SMI) 평가 방 식이 많이 활용되고 있다. SMI 평가 방식은 엄지의 중자골, 세번째 손가락의 기절골, 중절골과 말절골, 다섯번 손가락의 중절골, 및 요골 의 구조적 형태에 기반하여 골의 성숙도를 정량화하는 방식으로서, 편리하고 신속하게 아동 청소년의 성장단계 를 분류할 수 있다는 장점이 있다. 다만, SMI 평가 방식은 대상자에 따라 각 부위별 성장 단계의 변화 시기의 편차가 다양하고, 골의 성숙 단계를 구분하기 모호하도록 각 부위의 구조적 형태가 검출되는 경우가 빈번하게 발생하여, 아동 청소년기의 성장 단계를 정밀하게 판단하기에 한계가 존재하였다. 이에 보다 정밀하게 골의 성장 단계를 분석하기 위한 골 성장 단계의 분석 방법, 골 성장 단계의 분석 장치, 및 골 성장 단계의 분석 시스템의 개발이 요구된다."}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 일 과제는, 골 영역을 포함하는 의료 이미지로부터 골 성장 단계를 연산하기 위한 골 성장 단계의 분석 방법, 골 성장 단계의 분석 장치, 및 골 성장 단계의 분석 시스템을 제공하는 것이다. 본 발명이 해결하고자 하는 과제가 상술한 과제로 제한되는 것은 아니며, 언급되지 아니한 과제들은 본 명세서"}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "및 첨부된 도면으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 일 실시예에 따른 골의 성장 단계 분석 방법은, 골 영역을 포함하는 의료 이미지를 획득하는 단계; 상기 의료 이미지로부터 관심 영역들을 검출하는 단계; 각 관심 영역 별로 골격 성숙 지표를 연산하는 단계; 상 기 골격 성숙 지표에 기반하여 임시 성장 단계를 연산하는 단계; 상기 의료 이미지의 전체 영역으로부터 골 연 령을 연산하는 단계; 골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상기 상관 관계 정보를 이용하 여 상기 연산된 골 연령에 대응되는 기준 성장 단계를 연산하는 단계; 및 상기 임시 성장 단계 및 상기 기준 성 장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하는 단계;를 포함할 수 있다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는, 골 영역을 포함하는 의료 이미지를 획득하는 영상 획득 부; 및 상기 의료 이미지로부터 골의 성장 단계를 연산하도록 구성될 프로세스를 포함하되, 상기 프로세서는, 상기 의료 이미지로부터 관심 영역들을 검출하고, 각 관심 영역 별로 골격 성숙 지표를 연산하고, 상기 골격 성 숙 지표에 기반하여 임시 성장 단계를 연산하고, 상기 의료 이미지의 전체 영역으로부터 골 연령을 연산하고, 골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상기 상관 관계 정보를 이용하여 상기 연산된 골 연 령에 대응되는 기준 성장 단계를 연산하고, 상기 임시 성장 단계 및 상기 기준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하도록 구성될 수 있다."}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "본 발명의 과제의 해결 수단이 상술한 해결 수단들로 제한되는 것은 아니며, 언급되지 아니한 해결 수단들은 본"}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "명세서 및 첨부된 도면으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 실시예에 따른 골 성장 단계 분석 방법, 장치 및 시스템에 의하면, 골격 성숙 지표에 기초하여 연산 된 성장 단계와 골 연령에 기초하여 연산된 성장 단계에 기반하여 골의 성장 단계 정보를 연산함으로써, 보다 정밀하게 골의 성장 단계를 연산할 수 있다. 본 출원의 실시예에 따른 골 성장 단계 분석 방법, 장치 및 시스템에 의하면, 골격 성숙 지표에 기초하여 연산 된 성장 단계에 존재하는 보정 이벤트를 검출하고, 골 연령에 기초하여 연산된 성장 단계를 이용하여 골격 성숙 지표에 기초하여 연산된 성장 단계를 보정함으로써, 보다 정밀하게 골의 성장 단계를 연산할 수 있다. 본 출원의 실시예에 따른 골 성장 단계 분석 방법, 장치 및 시스템에 의하면, 골의 성장 단계를 정밀하게 연산 함으로써, 각 성장 단계에 최적의 교정 치료를 대상자에게 제공할 수 있다."}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과가 상술한 효과들로 제한되는 것은 아니며, 언급되지 아니한 효과들은 본 명세서 및 첨부된 도면"}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0109771", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 출원의 상술한 목적, 특징들 및 장점은 첨부된 도면과 관련된 다음의 상세한 설명을 통해 보다 분명해질 것 이다. 다만, 본 출원은 다양한 변경을 가할 수 있고 여러 가지 실시예들을 가질 수 있는 바, 이하에서는 특정 실시예들을 도면에 예시하고 이를 상세히 설명하고자 한다. 명세서 전체에 걸쳐서 동일한 참조번호들은 원칙적으로 동일한 구성요소들을 나타낸다. 또한, 각 실시예의 도면 에 나타나는 동일한 사상의 범위 내의 기능이 동일한 구성요소는 동일한 참조부호를 사용하여 설명하며, 이에 대한 중복되는 설명은 생략하기로 한다. 본 출원과 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 출원의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 본 명세서의 설명 과정에서 이용되는 숫자(예를 들어, 제1, 제2 등)는 하나의 구성요소를 다른 구성요소와 구분하기 위한 식별기호에 불과하다. 또한, 이하의 실시예에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되 어 부여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 이하의 실시예에서, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 이하의 실시예에서, 포함하다 또는 가지다 등의 용어는 명세서상에 기재된 특징, 또는 구성요소가 존재함을 의 미하는 것이고, 하나 이상의 다른 특징들 또는 구성요소가 부가될 가능성을 미리 배제하는 것은 아니다. 도면에서는 설명의 편의를 위하여 구성 요소들이 그 크기가 과장 또는 축소될 수 있다. 예컨대, 도면에서 나타 난 각 구성의 크기 및 두께는 설명의 편의를 위해 임의로 나타낸 것으로, 본 발명이 반드시 도시된 바에 한정되 지 않는다. 어떤 실시예가 달리 구현 가능한 경우에 특정한 프로세스의 순서는 설명되는 순서와 다르게 수행될 수도 있다. 예를 들어, 연속하여 설명되는 두 프로세스가 실질적으로 동시에 수행될 수도 있고, 설명되는 순서와 반대의 순 서로 진행될 수 있다. 이하의 실시예에서, 구성 요소 등이 연결되었다고 할 때, 구성 요소들이 직접적으로 연결된 경우뿐만 아니라 구 성요소들 중간에 구성 요소들이 개재되어 간접적으로 연결된 경우도 포함한다. 예컨대, 본 명세서에서 구성 요소 등이 전기적으로 연결되었다고 할 때, 구성 요소 등이 직접 전기적으로 연결 된 경우뿐만 아니라, 그 중간에 구성 요소 등이 개재되어 간접적으로 전기적 연결된 경우도 포함한다. 본 출원의 일 실시예에 따른 골의 성장 단계 분석 방법은, 골 영역을 포함하는 의료 이미지를 획득하는 단계; 상기 의료 이미지로부터 관심 영역들을 검출하는 단계; 각 관심 영역 별로 골격 성숙 지표를 연산하는 단계; 상 기 골격 성숙 지표에 기반하여 임시 성장 단계를 연산하는 단계; 상기 의료 이미지의 전체 영역으로부터 골 연 령을 연산하는 단계; 골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상기 상관 관계 정보를 이용하 여 상기 연산된 골 연령에 대응되는 기준 성장 단계를 연산하는 단계; 및 상기 임시 성장 단계 및 상기 기준 성 장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하는 단계;를 포함할 수 있다. 본 출원의 일 실시예에 따르면, 상기 골의 최종 성장 단계 정보를 연산하는 단계는, 상기 연산된 임시 성장 단 계의 보정 이벤트를 검출하는 단계; 및 상기 보정 이벤트가 검출된 경우에는 상기 기준 성장 단계에 기반하여 상기 임시 성장 단계를 보정하여 상기 최종 성장 단계 정보를 획득하고, 상기 보정 이벤트가 검출되지 않은 경 우에는 상기 연산된 임시 성장 단계를 상기 최종 성장 단계 정보로 결정하는 단계;를 더 포함할 수 있다. 본 출원의 일 실시예예 따르면, 상기 골격 성숙 지표는, 골간과 골단의 넓이의 일치 여부, 골간을 골단이 덮었 는지 여부, 또는 골단의 융합 여부에 따라 복수의 하위 분류로 구성된 SMI 지표일 수 있다. 본 출원의 일 실시예예 따르면, 상기 각 관심 영역 별로 골격 성숙 지표를 연산하는 단계는, 학습이 완료된 인 공지능 모델을 획득하는 단계; 및 학습이 완료된 인공지능 모델을 통하여, 상기 관심 영역으로부터 상기 골격 성숙 지표의 하위 분류에 해당할 확률값을 획득하는 단계;를 더 포함할 수 있다. 본 출원의 일 실시예예 따르면, 상기 인공지능 모델은, 의료 이미지의 관심 영역과 관심 영역에 대하여 할당된 상기 골격 성숙 지표의 하위 분류 값으로 구성된 학습 데이터 세트에 기반하여 훈련될 수 있다. 본 출원의 일 실시예예 따르면, 상기 인공지능 모델은, 상기 인공지능 모델로부터 출력된 예측 값과 상기 하위 분류 값의 차이에 근거하여 상기 예측 값이 상기 하위 분류 값에 근사되어 출력되도록 훈련될 수 있다. 본 출원의 일 실시예예 따르면, 상기 임시 성장 단계 또는 상기 기준 성장 단계는, 급성장기, 급성장기 이전, 및 급성장기 이후 중 적어도 하나에 해당할 수 있다. 본 출원의 일 실시예예 따르면, 상기 관심 영역은, 세번째 손가락 말절골(DP3), 세번째 손가락 중절골(MP3), 세 번째 손가락 기절골(PP3MC), 다섯째 손가락 중절골(MP5), 엄지 종자골(PP1), 및 요골(Radius) 중 적어도 하나에 대응되는 영역을 포함할 수 있다. 본 출원의 일 실시예에 따르면, 상기 골의 성장 단계 분석 방법을 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체가 제공될 수 있다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는, 골 영역을 포함하는 의료 이미지를 획득하는 영상 획득 부; 및 상기 의료 이미지로부터 골의 성장 단계를 연산하도록 구성될 프로세스를 포함하되, 상기 프로세서는, 상기 의료 이미지로부터 관심 영역들을 검출하고, 각 관심 영역 별로 골격 성숙 지표를 연산하고, 상기 골격 성 숙 지표에 기반하여 임시 성장 단계를 연산하고, 상기 의료 이미지의 전체 영역으로부터 골 연령을 연산하고, 골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상기 상관 관계 정보를 이용하여 상기 연산된 골 연 령에 대응되는 기준 성장 단계를 연산하고, 상기 임시 성장 단계 및 상기 기준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하도록 구성될 수 있다. 이하에서는 도 1 내지 도 12를 참고하여, 본 출원의 골 성장 단계 분석 방법, 골 성장 단계 분석 장치 및 골 성 장 단계 분석 시스템에 관하여 설명한다. 도 1은 본 출원의 일 실시예에 따른 골 성장 단계 분석 시스템의 개략도이다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 시스템은 의료 영상 획득 장치 및 골 성장 단계 분석 장치를 포함할 수 있다. 의료 영상 획득 장치는 의료 이미지를 촬영할 수 있다. 예컨대, 의료 영상 획득 장치는 자기 공명 영 상 장치(magnetic resonance imaging), 컴퓨터 단층 촬영 장치(computerized tomography equipment), X-선 장 치(X-ray equipment) 등을 포함하여 임의의 형태의 의료 이미지를 획득하는 장치를 포괄하는 의미일 수 있다. 의료 영상 획득 장치에 의해 획득된 의료 이미지는 2차원 형태의 영상일 수 있다. 이때, 의료 이미지는 픽 셀의 좌표, 색상, 강도 등과 관련된 픽셀 정보를 포함할 수 있다. 의료 영상 획득 장치에 의해 획득된 의 료 이미지는 3차원 형태의 영상일 수 있다. 이때, 의료 이미지는 복셀의 좌표, 색상, 강도와 관련된 픽셀 정보 를 포함할 수 있다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 의료 이미지를 분석하여 골 성장 단계 정보를 획 득할 수 있다. 보다 구체적으로, 골 성장 단계 분석 장치는 의료 이미지의 관심 영역들로부터 골격 성숙 지표를 연산하고, 연산된 골격 성숙 지표에 기반하여 임시적인 제1 성장 단계(이하, 임시 성장 단계로 지칭)를 연산할 수 있다. 또한, 골 성장 단계 분석 장치는 의료 이미지의 관심 영역들을 포함하는 의료 이미지의 전체 영역으로부터 골 연령을 연산하고, 연산된 골 연령에 기반하여 임시 성장 단계의 보정 여부를 판단하기 위 하여 기준이 되는 제2 성장 단계(이하, 기준 성장 단계로 지칭)를 연산할 수 있다. 이때, 골 성장 단계 분석 장 치는 임시 성장 단계와 기준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하거나 획득할 수 있 다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 송수신부, 메모리 및 프로세서(130 0)를 포함할 수 있다. 골 성장 단계 분석 장치의 송수신부는 의료 영상 획득 장치를 포함한 임의의 외부 기기와 통 신을 수행할 수 있다. 예컨대, 골 성장 단계 분석 장치는, 송수신부를 통해, 의료 영상 획득 장치 가 촬영한 의료 이미지를 수신할 수 있다. 또한, 골 성장 단계 분석 장치는, 송수신부를 통해, 골의 성장 단계 정보를 의료 영상 획득 장치를 포함한 임의의 외부 기기로 송신할 수 있다. 골 성장 단계 분석 장치는, 송수신부를 통해 네트워크에 접속하여 각종 데이터를 송수신할 수 있다. 송수신부는 크게 유선 타입과 무선 타입을 포함할 수 있다. 유선 타입과 무선 타입은 각각의 장단점을 가 지므로, 경우에 따라서 골 성장 단계 분석 장치에는 유선 타입과 무선 타입이 동시에 마련될 수도 있다. 여기서, 무선 타입의 경우에는 주로 와이파이(Wi-Fi) 같은 WLAN(Wireless Local Area Network) 계열의 통신 방 식을 이용할 수 있다. 또는, 무선 타입의 경우에는 셀룰러 통신, 예컨대, LTE, 5G 계열의 통신 방식을 이용할 수 있다. 다만, 무선 통신 프로토콜이 상술한 예시에 제한되는 것은 아니며, 임의의 적절한 무선 타입의 통신 방식을 이용하는 것도 가능하다. 유선 타입의 경우에는 LAN(Local Area Network)이나 USB(Universal Serial Bus) 통신이 대표적인 예이며 그 외의 다른 방식도 가능하다. 골 성장 단계 분석 장치의 메모리는 각종 정보를 저장할 수 있다. 메모리에는 각종 데이터가 임시적으로 또는 반영구적으로 저장될 수 있다. 메모리의 예로는 하드 디스크(HDD: Hard Disk Drive), SSD(Solid State Drive), 플래쉬 메모리(flash memory), 롬(ROM: Read-Only Memory), 램(RAM: Random Access Memory) 등이 있을 수 있다. 메모리는 골 성장 단계 분석 장치에 내장되는 형태나 탈부착 가능한 형태로 제공될 수 있다. 메모리에는 골 성장 단계 분석 장치를 구동하기 위한 운용 프로그램(OS: Operating System)이나 골 성장 단계 분석 장치의 각 구성을 동작시키기 위한 프로그램을 비롯해 골 성장 단계 분석 장치의 동작에 필요한 각종 데이터가 저장될 수 있다. 프로세서는 골 성장 단계 분석 장치의 전반적인 동작을 제어할 수 있다. 예컨대, 프로세서는 의료 이미지를 획득하는 동작, 의료 이미지로부터 관심 영역을 검출하는 동작, 관심 영역으로부터 골격 성숙 지 표를 분류하는 동작, 분류된 골격 성숙 지표에 기반하여 임시 성장 단계를 연산하는 동작, 의료 이미지로부터 골 연령을 분석하여 기준 성장 단계를 연산하는 동작, 임시 성장 단계와 기준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하는 동작 등 골 성장 단계 분석 장치의 전반적인 동작을 제어할 수 있다. 구체적 으로 프로세서는 메모리로부터 골 성장 단계 분석 장치의 전반적인 동작을 위한 프로그램을 로딩하여 실행할 수 있다. 프로세서는 하드웨어나 소프트웨어 또는 이들의 조합에 따라 AP(Application Processor), CPU(Central Processing Unit), MCU(Microcontroller Unit)나 이와 유사한 장치로 구현될 수 있다. 이때, 하드웨어적으로는 전기적 신호를 처리하여 제어 기능을 수행하는 전자 회로 형태로 제공될 수 있으 며, 소프트웨어적으로는 하드웨어적 회로를 구동시키는 프로그램이나 코드 형태로 제공될 수 있다. 한편 도 1에서는 도시하지 않았지만, 골 성장 단계 분석 장치는 임의의 적절한 입력부 및/또는 출력부를 포함할 수 있다. 구체적으로 골 성장 단계 분석 장치는 입력부를 통하여, 의료 이미지의 분석에 필요한 사용자의 입력을 수신할 수 있다. 예컨대, 골 성장 단계 분석 장치는 입력부를 통하여, 의료 이미지에 포 함된 복수의 영역 각각에, 관심 영역과 관련된 라벨 정보를 할당하는 사용자의 입력을 획득할 수 있다. 다른 예 를 들어, 골 성장 단계 분석 장치는 입력부를 통하여, 관심 영역에 골격 성숙 지표의 하위 분류 값을 할 당하는 사용자의 입력을 획득할 수 있다. 또한, 골 성장 단계 분석 장치는 출력부를 통하여, 골의 최종 성장 단계 정보를 포함하여 임의의 분석 결 과를 출력할 수 있다. 이하에서는 도 2 내지 도 12를 참고하여, 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치의 동작과 골 성장 단계의 분석 방법을 구체적으로 서술한다. 도 2는 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치의 동작들을 나타낸 도면이다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 영상 획득부를 포함할 수 있다. 구체적으로 골 성 장 단계 분석 장치의 영상 획득부는 의료 영상 획득 장치로부터 획득된 의료 이미지를 획득할 수 있 다. 예컨대, 영상 획득부는 송수신부를 통하여 의료 영상 획득 장치을 포함한 임의의 외부 장치로부 터 의료 이미지를 획득할 수 있다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 관심 영역 검출부를 포함할 수 있다. 골 성장 단 계 분석 장치의 관심 영역 검출부는 의료 이미지로부터 관심 영역을 검출할 수 있다. 구체적으로 관심 영 역 검출부는 골격 성숙 지표를 연산하기 위하여 적어도 하나 이상의 관심 영역을 검출할 수 있다. 예컨대, 관심영역은 세번째 손가락 말절골(DP3), 세번째 손가락 중절골(MP3), 세번째 손가락 기절골(PP3MC), 다섯째 손가락 중절골(MP5), 엄지 종자골(PP1), 및 요골(Radius) 중 적어도 하나에 대응되는 영역일 수 있다. 한편 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치의 관심 영역 검출부는 인공지능 기법을 활용하여 의료 이미지 로부터 관심 영역을 검출할 수 있다. 관심 영역을 검출하는 내용과 관련해서는 도 3과 도 4와 관련하여 보다 구 체적으로 서술하기로 한다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 골격 성숙 지표 분류부를 포함할 수 있다. 골 성 장 단계 분석 장치의 골격 성숙 지표 분류부는 검출된 관심 영역을 분석하여 골격 성숙 지표를 연산할 수 있다. 일 예로, 골격 성숙 지표 분류부는 인공지능 기법을 활용하여 관심 영역에 기반하여 관심 영역(예컨대, 세번째 손가락 말절골(DP3), 세번째 손가락 중절골(MP3), 세번째 손가락 기절골(PP3MC), 다섯째 손가락 중절골 (MP5), 엄지 종자골(PP1) 등)의 골간과 골단의 넓이의 일치 여부, 골간을 골단이 덮었는지 여부, 또는 골단의 융합 여부에 따라 복수의 하위 분류(예컨대, 제1 분류 내지 제11 분류)로 구성된 골격 성숙 지표(예컨대, skeletal maturity indicators(SMI))를 연산할 수 있다. 보다 구체적으로 골격 성숙 지표 분류부는 학습이 완 료된 인공지능 모델을 이용하여 관심 영역으로부터 골격 성숙 지표의 하위 분류에 해당할 확률값 또는 골격 성 숙 지표의 하위 분류 정보를 연산하도록 구성될 수 있다. 골격 성숙 지표를 연산하는 내용에 대하여는 도 5 내 지 도 6에서 보다 구체적으로 서술하기로 한다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 임시 성장 단계 연산부를 포함할 수 있다. 골 성 장 단계 분석 장치의 임시 성장 단계 연산부는 골격 성숙 지표로부터 골의 임시 성장 단계를 연산할 수 있다. 일 예로, 임시 성장 단계 연산부는, 대상자가 남아이고 골격 성숙 지표(예컨대, SMI)가 제6 단계 내지 제7 단계 로 연산된 경우에는, 임시 성장 단계를 급성장기로 판단할 수 있다. 또는 임시 성장 단계 연산부는, 대상자가 남아이고 골격 성숙 지표(예컨대, SMI)가 제1 단계 내지 제5 단계로 연산된 경우에는, 임시 성장 단계를 급성장 기의 이전으로 판단할 수 있다. 또는 임시 성장 단계 연산부는, 대상자가 남아이고 골격 성숙 지표(예컨대, SMI)가 제8 단계 내지 제11 단계로 연산된 경우에는, 임시 성장 단계를 급성장기의 이후로 판단할 수 있다. 다른 예로, 임시 성장 단계 연산부는, 대상자가 여아이고 골격 성숙 지표(예컨대, SMI)가 제4 단계 내지 제6 단 계로 연산된 경우에는, 임시 성장 단계를 급성장기로 판단할 수 있다. 또는 임시 성장 단계 연산부는, 대상자가 여아이고 골격 성숙 지표(예컨대, SMI)가 제1 단계 내지 제3 단계로 연산된 경우에는, 임시 성장 단계를 급성장 기의 이전으로 판단할 수 있다. 또는 임시 성장 단계 연산부는, 대상자가 여아이고 골격 성숙 지표(예컨대, SMI)가 제7 단계 내지 제11 단계로 연산된 경우에는, 임시 성장 단계를 급성장기의 이후로 판단할 수 있다. 임시 성장 단계를 연산하는 내용에 대하여는 도 7과 관련하여 보다 구체적으로 서술하기로 한다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 기준 성장 단계 연산부를 포함할 수 있다. 골 성 장 단계 분석 장치의 기준 성장 단계 연산부는 의료 이미지의 전체 영역을 분석하여 골 연령을 연산할 수 있다. 구체적으로 기준 성장 단계 연산부는 의료 이미지의 전체 영역으로부터 추출된 특징값 및/또는 의료 이미 지의 각 관심 영역으로부터 추출된 특징값에 기반하여 골 연령을 연산하도록 구성될 수 있다. 예컨대, 기준 성 장 단계 연산부는 의료 이미지의 각 관심 영역으로부터 분류된 골격 성숙 지표와 의료 이미지의 전체 영역으로 부터 분류된 골격 성숙 지표에 기반하여 골 연령을 연산할 수 있다. 예컨대, 기준 성장 단계 연산부는 의료 이 미지의 전체 영역으로부터 추출된 특징값에 기반하여 골격 성숙 지표를 연산(또는 분류)할 수 있다. 이때, 기준 성장 단계 연산부는 의료 이미지의 각 관심 영역으로부터 분류된 골격 성숙 지표와 의료 이미지의 전체 영역으 로부터 분류된 골격 성숙 지표에 기반하여 골 연령을 연산할 수 있다. 나아가 기준 성장 단계 연산부는 골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상관 관계 정보를 이용하여 연산된 골 연령에 대응되는 기준 성장 단계를 연산하도록 구성될 수 있다. 예컨대, 골 연령과 골 성장 단계 간의 상관 관계 정보는 골 연령과 성장 속도 간의 상관 관계 정보와 성장 속도에 따른 골 성장 단계 정보 를 포함할 수 있다. 이때, 골 성장 단계 분석 장치는 상관 관계 정보를 이용하여 연산된 골 연령에 대응 되는 골 성장 단계 정보를 기준 성장 단계로 연산하도록 구성될 수 있다. 기준 성장 단계를 연산하는 내용에 대 하여는 도 8과 관련하여 보다 구체적으로 서술하기로 한다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 최종 성장 단계 정보 연산부를 포함할 수 있다. 골 성장 단계 분석 장치의 최종 성장 단계 정보 연산부는 골격 성숙 지표에 기초하여 연산된 임시 성장 단계와 골 연령에 기초하여 연산된 기준 성장 단계에 기반하여 최종 성장 단계 정보를 연산하도록 구성될 수 있다. 일 예로, 최종 성장 단계 정보 연산부는 연산된 임시 성장 단계에 대한 보정 이벤트가 존재하는 지 여부를 판단하고, 보정 이벤트가 존재하는 경우에는 기준 성장 단계에 기반하여 임시 성장 단계를 보정하여 최종 성장 단계 정보를 획득하도록 구성될 수 있다. 반면, 보정 이벤트가 존재하지 않는 경우에는 최종 성장 단계 정보 연 산부는 연산된 임시 성장 단계를 최종 성장 단계 정보로 결정하도록 구성될 수 있다. 최종 성장 단계 정보를 연 산하는 내용에 대하여는 도 9 내지 도 12와 관련하여 보다 구체적으로 서술하기로 한다. 이하에서는 도 3 내지 도 12를 참고하여 본 출원의 일 실시예에 따른 골의 성장 단계 분석 방법에 대하여 보다 구체적으로 설명하기로 한다. 골의 성장 단계 분석 방법을 설명함에 있어서, 도 2와 관련하여 설명한 중복되는 실시예는 생략될 수 있으나, 이는 설명의 편의를 위한 것일 뿐이며, 이에 제한적으로 해석되어서는 아니된다. 도 3은 본 출원의 일 실시예에 따른 골 성장 단계의 분석 방법을 나타낸 순서도이다. 본 출원의 일 실시예에 따른 골 성장 단계의 분석 방법은, 골 영역을 포함하는 의료 이미지를 획득하는 단계 (S1000), 관심 영역들을 검출하는 단계(S2000), 각 관심 영역 별로 골격 성숙 지표를 연산하는 단계(S3000), 골 격 성숙 지표에 기반하여 임시 성장 단계를 연산하는 단계(S4000), 의료 이미지의 전체 영역으로부터 골 연령을 연산하는 단계(S5000), 골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상관 관계 정보를 이용하여 연산된 골 연령에 대응되는 기준 성장 단계를 연산하는 단계(S6000), 및 임시 성장 단계 및 기준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하는 단계(S7000)를 포함할 수 있다. 골 영역을 포함하는 의료 이미지를 획득하는 단계(S1000)에서는, 골 성장 단계 분석 장치는 송수신부 를 통하여 의료 영상 획득 장치을 통하여 촬영된 의료 이미지를 포함할 수 있다. 이때, 의료 이미지 는 골 영역을 포함하는 이미지를 포괄하여 지칭한다. 관심 영역들을 검출하는 단계(S2000)에서는, 골 성장 단계 분석 장치는 의료 이미지로부터 관심 영역을 검출할 수 있다. 구체적으로 골 성장 단계 분석 장치는 골격 성숙 지표를 연산하기 위하여 적어도 하나 이상의 관심 영역을 검출할 수 있다. 예컨대, 관심 영역은 세번째 손가락 말절골(DP3), 세번째 손가락 중절골 (MP3), 세번째 손가락 기절골(PP3MC), 다섯째 손가락 중절골(MP5), 엄지 종자골(PP1), 및 요골(Radius) 중 적 어도 하나에 대응되는 영역일 수 있다. 한편 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 인공 지능 기법을 활용하여 의료 이미지로부터 관심 영역을 검출할 수 있다. 도 4는 본 출원의 일 실시예에 따른 관심 영역을 획득하는 양상을 설명하기 위한 도면이다. 구체적으로 도 4 (a)는 학습이 완료된 인공지능 모델을 이용하여 관심 영역을 검출하는 양상을 설명하기 위한 도면이다. 또한 도 4(b)는 관심 영역을 검출하기 위한 인공지능 모델을 훈련시키는 양상을 설명하기 위한 도면이다. 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 학습이 완료된 인공지능 모델을 이용하여 의료 이 미지로부터 관심 영역을 검출할 수 있다. 구체적으로 골 성장 단계 분석 장치는 학습이 완료된 인공지능 모델에 의료 이미지를 입력하고, 인공지능 모델을 통하여 출력되는 관심 영역 정보를 획득할 수 있다. 학습이 완료된 인공지능 모델은 의료 이미지와 의료 이미지에 포함된 각 관심 영역에 할당된 라벨 정보로 구성 된 학습 데이터 세트에 기반하여 훈련될 수 있다. 구체적으로 인공지능 모델은 의료 이미지에 기초하여 각 관심 영역과 관련된 예측 값을 출력하도록 구성될 수 있다. 이때, 골 성장 단계 분석 장치는 예측 값과 각 관 심 영역에 할당된 라벨 정보의 차이에 기초하여 인공지능 모델에 포함된 파라미터 정보를 갱신함으로써 인공지 능 모델을 훈련시킬 수 있다. 특히 인공지능 모델은 라벨 정보에 근사되도록 예측 값을 출력하도록 훈련될 수 있으며, 훈련이 완료된 인공지능 모델은 의료 이미지로부터 관심 영역 정보를 연산할 수 있다. 각 관심 영역 별로 골격 성숙 지표를 연산하는 단계(S3000)에서는, 골 성장 단계 분석 장치는 S2000 단계 를 통하여 획득한 관심 영역 정보에 기반하여 골격 성숙 지표를 연산할 수 있다. 일 예로, 골 성장 단계 분석 장치는 인공지능 기법을 활용하여 관심 영역에 기반하여 관심 영역(예컨대, 세번째 손가락 말절골(DP3), 세번째 손가락 중절골(MP3), 세번째 손가락 기절골(PP3MC), 다섯째 손가락 중절골(MP5), 엄지 종자골(PP1) 등) 의 골간과 골단의 넓이의 일치 여부, 골간을 골단이 덮었는지 여부, 또는 골단의 융합 여부에 따라 복수의 하위 분류(예컨대, 제1 분류 내지 제11 분류)로 구성된 골격 성숙 지표(예컨대, skeletal maturity indicators(SMI))를 연산할 수 있다. 이하에서는 도 5 및 도 6을 참고하여 본 출원의 일 실시예에 따른 골격 성숙 지표를 연산하는 내용에 대하여 보 다 구체적으로 서술하기로 한다. 도 5는 본 출원의 일 실시예에 따른 골격 성숙 지표를 연산하는 단계를 구체화한 순서도이다. 도 6은 본 출원의 일 실시예에 따른 골격 성숙 지표를 연산하는 양상을 설명하기 위한 도면이다. 구체적으로 도 6(a)는 학습이 완료된 인공지능 모델을 이용하여 골격 성숙 지표의 하위 분류에 해당 할 확률값을 연산하는 양상을 설명하기 위한 도면이다. 또한 도 6(b)는 골격 성숙 지표를 연산하기 위한 인공지 능 모델을 훈련시키는 양상을 설명하기 위한 도면이다. 본 출원의 일 실시예에 따른 골격 성숙 지표를 연산하는 단계(S3000)는 학습이 완료된 인공지능 모델을 획득하 는 단계(S3100), 및 학습이 완료된 인공지능 모델을 통하여, 관심 영역으로부터 골격 성숙 지표의 하위 분류에 해당할 확률값을 획득하는 단계(S3200)를 더 포함할 수 있다. 학습이 완료된 인공지능 모델을 획득하는 단계(S3100)에서는, 골 성장 단계 분석 장치는 송수신부 를 통하여 골격 성숙 지표를 연산하도록 구성된 학습이 완료된 인공지능 모델의 실행 데이터를 획득할 수 있다. 여기서 실행 데이터란, 인공지능 모델의 연산 정보, 구조 정보, 및/또는 파라미터 정보를 포함하여 학습이 완료 된 인공지능 모델을 적절하게 실행시키기 위한 임의의 데이터를 포괄하는 의미일 수 있다. 본 출원의 일 실시예에 따른 골격 성숙 지표를 연산하기 위한 인공지능 모델은 관심 영역의 구조적 형태와 관심 영역의 구조적 형태에 따라 분류된 골격 성숙 지표의 하위 분류 값으로 구성된 학습 데이터 세트에 기반하여 훈 련될 수 있다. 구체적으로 골격 성숙 지표를 연산하기 위한 인공지능 모델은 의료 이미지의 관심 영역에 기초하 여 관심 영역의 구조적 형태에 따라 골격 성숙 지표의 하위 분류 값에 대응되는 예측 값을 출력하도록 구성될 수 있다. 이때, 이때, 골 성장 단계 분석 장치는 예측 값과 관심 영역의 구조적 형태에 따라 분류된 골격 성숙 지표의 하위 분류 값의 차이에 기초하여 인공지능 모델에 포함된 파라미터 정보를 갱신함으로써 인공지능 모델을 훈련시킬 수 있다. 특히 인공지능 모델은 골격 성숙 지표의 하위 분류 값에 근사되도록 예측 값을 출력 하도록 훈련될 수 있으며, 훈련이 완료된 인공지능 모델은 관심 영역의 구조적 형태를 분석하여 골격 성숙 지표 의 특정 하위 분류에 해당할 확률값을 연산할 수 있다. 학습이 완료된 인공지능 모델을 통하여, 관심 영역으로부터 골격 성숙 지표의 하위 분류에 해당할 확률값을 획 득하는 단계(S3200)에서는, 골 성장 단계 분석 장치는 학습이 완료된 인공지능 모델을 이용하여 관심 영 역으로부터 골격 성숙 지표의 하위 분류에 해당할 확률값을 획득할 수 있다. 구체적으로 골 성장 단계 분석 장 치는 학습이 완료된 인공지능 모델에 S2000 단계를 통하여 획득한 관심 영역 정보를 입력하고, 인공지능 모델을 통하여 출력되는 골격 성숙 지표의 하위 분류에 해당할 확률값을 획득할 수 있다. 한편, 도 6에서는 골격 성숙 지표의 하위 분류에 해당할 확률값을 획득하는 것으로 설명하였다. 다만 이는 예시 에 불과하며, 골격 성숙 지표의 하위 분류와 관련된 임의의 형태의 정보를 출력하도록 인공지능 모델이 적절하 게 구성될 수 있다. 골격 성숙 지표에 기반하여 임시 성장 단계를 연산하는 단계(S4000)에서는, 골 성장 단계 분석 장치는 S3000 단계(혹은 S3200 단계)를 통하여 획득한 골격 성숙 지표(혹은 골격 성숙 지표의 하위 분류에 해당할 확률 값)에 기반하여 골의 임시 성장 단계를 연산할 수 있다. 도 7은 본 출원의 일 실시예에 따른 골격 성숙 지표로부터 임시 성장 단계를 연산하는 양상을 설명하기 위한 도 면이다. 일 예로, 골 성장 단계 분석 장치는, 대상자가 남아이고 골격 성숙 지표(예컨대, SMI)가 제6 단계 내지 제7 단계로 연산된 경우에는, 임시 성장 단계를 급성장기로 판단할 수 있다. 또는 골 성장 단계 분석 장치 는, 대상자가 남아이고 골격 성숙 지표(예컨대, SMI)가 제1 단계 내지 제5 단계로 연산된 경우에는, 임시 성장 단계를 급성장기의 이전으로 판단할 수 있다. 또는 골 성장 단계 분석 장치는, 대상자가 남아이고 골격 성숙 지표(예컨대, SMI)가 제8 단계 내지 제11 단계로 연산된 경우에는, 임시 성장 단계를 급성장기의 이 후로 판단할 수 있다. 다른 예로, 골 성장 단계 분석 장치는, 대상자가 여아이고 골격 성숙 지표(예컨대, SMI)가 제4 단계 내지 제6 단계로 연산된 경우에는, 임시 성장 단계를 급성장기로 판단할 수 있다. 또는 골 성장 단계 분석 장치 는, 대상자가 여아이고 골격 성숙 지표(예컨대, SMI)가 제1 단계 내지 제3 단계로 연산된 경우에는, 임시 성장 단계를 급성장기의 이전으로 판단할 수 있다. 또는 골 성장 단계 분석 장치는, 대상자가 여아이고 골격 성숙 지표(예컨대, SMI)가 제7 단계 내지 제11 단계로 연산된 경우에는, 임시 성장 단계를 급성장기의 이 후로 판단할 수 있다. 일 실시예에 따른 골 성장 단계 분석 장치는 분류된 골격 성장 지표의 하위 분류들 중 가장 큰 단계의 하 위 분류에 대응되는 성장 단계를 임시 성장 단계로 결정할 수 있다. 예컨대, 골격 성장 지표(예컨대, SMI)의 연산 결과, 제2 단계의 하위 분류(즉, 세번째 손가락 중절골 골간, 골단 넓이가 일치됨이 검출됨)로 분류되고, 제 6 단계의 하위 분류(즉, 세번째 손가락 중절골 골단의 덮음이 검출됨)로 분류되었으나, 제3 단계 내지 제5 단계 및 제7 단계 내지 제11 단계의 하위 분류는 분류되지 않은 경우가 존재할 수 있다. 이때, 골 성장 단계 분석 장 치는 분류된 골격 성장 지표 중 가장 큰 단계(즉, 제6 단계)의 하위 분류에 대응되는 성장 단계(예컨대, 급성장기)를 임시 성장 단계로 연산할 수 있다. 다만 골격 성숙 지표에 기반하여 연산된 임시 성장 단계는, 도 9와 도 10에서 후술할 바와 같이, 오차가 존재할 가능성이 존재한다. 따라서 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치는 골 연령을 연산하고, 연산된 골 연령을 이용하여 임시 성장 단계를 보정하도록 구성될 수 있다. 의료 이미지의 전체 영역으로부터 골 연령을 연산하는 단계(S5000)에서는, 골 성장 단계 분석 장치는 의 료 이미지의 전체 영역을 분석하여 골 연령을 연산할 수 있다. 일 실시예에 따르면, 골 성장 단계 분석 장치 는 각 관심 영역으로부터 추출된 특징값과 전체 영역으로부터 추출된 특징값에 기반하여 골 연령을 연산 하도록 구성될 수 있다. 골 연령과 골 성장 단계 간의 상관 관계 정보를 획득하고, 상관 관계 정보를 이용하여 연산된 골 연령에 대응되 는 기준 성장 단계를 연산하는 단계(S6000)에서는, 골 성장 단계 분석 장치는 골 연령과 골 성장 단계 간 의 상관 관계 정보를 획득할 수 있다. 예컨대, 골 연령과 골 성장 단계 간의 상관 관계 정보는 골 연령과 성장 속도 간의 상관 관계 정보와 성장 속도에 따른 골 성장 단계 정보를 포함할 수 있다. 이때, 골 성장 단계 분석 장치는 상관 관계 정보를 이용하여 연산된 골 연령에 대응되는 골 성장 단계 정보를 기준 성장 단계로 연 산하도록 구성될 수 있다. 도 8은 본 출원의 일 실시예에 따른 골 연령으로부터 기준 성장 단계를 연산하는 양상을 설명하기 위한 도면이 다. 구체적으로 도 8 (a)는 일 형태의 상관 관계 정보로부터 기준 성장 단계를 연산하는 양상을 도시한 도면이 다. 나아가 도 8 (b)는 다른 형태의 상관 관계 정보로부터 기준 성장 단계를 연산하는 도시한 도면이다. 도 8(a)를 참고하면, 골 성장 단계 분석 장치는 연령에 따른 신장의 연간 성장치로 구성된 상관 관계 정 보로부터 기준 성장 단계를 연산하도록 구성될 수 있다. 예컨대, 골 성장 단계 분석 장치는 상관 관계 정 보의 신장의 연간 성장치에 따라 미리 구분된 성장 단계에 기반하여 기준 성장 단계를 연산하도록 구성될 수 있 다. 구체적으로 골 성장 단계 분석 장치는 S5000 단계를 통하여 연산된 골 연령(*)을 획득하고, 연산된 골 연령에 대응되는 미리 구분된 성장 단계(예컨대, 도 8(a)에서의 연산된 골 연령에 대응되는 급성장기 단계) 를 기준 성장 단계로 연산하도록 구성될 수 있다. 도 8(b)를 참고하면, 골 성장 단계 분석 장치는 성별 및 연령에 따른 신장의 연간 성장치로 구성된 상관 관계 정보로부터 기준 성장 단계를 연산하도록 구성될 수 있다. 있다. 예컨대, 골 성장 단계 분석 장치는 상관 관계 정보의 신장의 연간 성장치에 따라 미리 구분된 성장 단계 및 성별에 기반하여 기준 성장 단계를 연 산하도록 구성될 수 있다. 구체적으로 골 성장 단계 분석 장치는 분석 대상의 의료 이미지에 대응되는 피 시술자의 성별 정보와 S5000 단계를 통하여 연산된 골 연령(*)을 획득하고, 연산된 골 연령에 대응되는 미리 구 분된 성장 단계(예컨대, 남아인 경우에는 도 8(b)에서의 연산된 골 연령에 대응되는 급성장기 단계, 여아인 경 우에는 급성장기 후 단계)를 기준 성장 단계로 연산하도록 구성될 수 있다. 도 8에서는 특정 형태의 상관 관계 정보로부터 기준 성장 단계를 연산하는 것으로 설명하였다. 다만, 이는 설명 의 편의를 위한 것일 뿐, 임의의 적절한 형태의 골 연령과 골의 성장 단계 간의 상관 관계 정보를 이용하여 연 산된 골 연령로부터 기준 성장 단계가 연산될 수 있을 것이다. 임시 성장 단계 및 기준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산하는 단계(S7000)에서는, 골 성 장 단계 분석 장치는 골격 성숙 지표에 기반하여 연산된 임시 성장 단계와 골 연령에 기반하여 연산된 기 준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산할 수 있다. 구체적으로 골 성장 단계 분석 장치 는 연산된 임시 성장 단계에 대하여 보정 이벤트가 존재하는 지 여부를 판단하고, 판단 결과에 따라 임시 성장 단계와 기준 성장 단계에 기반하여 골의 최종 성장 단계 정보를 연산할 수 있다. 이하에서는 도 9 내지 도 12를 참고하여 본 출원의 일 실시예에 따른 골의 최종 성장 단계 정보를 연산하는 내 용에 대하여 보다 구체적으로 서술하기로 한다. 도 9는 본 출원의 일 실시예에 따른 골의 최종 성장 단계 정보를 연산하는 단계를 구체화한 순서도이다. 본 출원의 일 실시예에 따른 골의 최종 성장 단계 정보를 연산하는 단계(S7000)는 연산된 임시 성장 단계의 보 정 이벤트를 검출하는 단계(S7100), 및 보정 이벤트가 검출된 경우에는 기준 성장 단계에 기반하여 임시 성장 단계를 보정하여 최종 성장 단계 정보를 획득하고, 보정 이벤트가 검출되지 않은 경우에는 연산된 임시 성장 단 계에 기반하여 최종 성장 단계 정보를 결정하는 단계(S7200)를 더 포함할 수 있다. 연산된 임시 성장 단계의 보정 이벤트를 검출하는 단계(S7100)에서는, 골 성장 단계 분석 장치는 연산된 임시 성장 단계(또는 연산된 골격 성장 지표)에 보정 이벤트가 존재하는 지 여부를 판단할 수 있다. 도 10은 본 출원의 일 실시예에 따른 임시 성장 단계를 보정하기 위한 보정 이벤트를 판단하는 일 양상을 도시 한 도면이다. 일 예로, 골 성장 단계 분석 장치는 연산된 골격 성장 지표(예컨대, SMI)가 불연속적으로 연산된 경우에 는 연산된 임시 성장 단계에 대한 보정 이벤트가 존재한다고 판단할 수 있다. 예컨대, 도 10을 참고하면, SMI의 연산 결과, 제2 단계의 하위 분류(즉, 세번째 손가락 중절골 골간, 골단 넓이가 일치됨이 검출됨)로 분류되고, 제6 단계의 하위 분류(즉, 세번째 손가락 중절골 골단의 덮음이 검출됨)로 분류되었으나, 제3 단계 내지 제5 단 계의 하위 분류에 대응되는 현상은 검출되지 않은 경우가 존재할 수 있다. 이때, 제3 단계 내지 제5 단계의 하 위 분류에 대응되는 현상은 검출되지 않았음에도 제6 단계의 하위 분류 값이 연산되었기에 제6 단계에 대응되는 급성장기로 골의 성장 단계를 결정하는 것은 부정확할 가능성이 높다. 따라서, 골 성장 단계 분석 장치는 연산된 골격 성장 지표의 하위 분류가 불연속적으로 연산된 경우에는 연산된 임시 성장 단계에 대한 보정 이벤트가 존재한다고 판단하도록 구성될 수 있다. 한편, 골 성장 단계 분석 장치는 연산된 골격 성장 지표의 하위 분류가 연속적으로 연산된 경우에는 연산 된 임시 성장 단계에 보정 이벤트가 존재하지 않는다고 판단하고, 전술한 바와 같이, 가장 큰 단계의 하위 분류 에 대응되는 골의 성장 단계를 임시 성장 단계로 결정할 수 있다. 도 11은 본 출원의 일 실시예에 따른 임시 성장 단계를 보정하기 위한 보정 이벤트를 판단하는 일 양상을 도시 한 도면이다. 전술한 바와 같이, 일 실시예에 따른 골 성장 단계 분석 장치는 인공지능 모델을 통하여 골격 성숙 지표 의 하위 분류에 해당할 확률 값(예컨대, 도 11의 확률값(P1 내지 P11))의 형태의 정보를 획득하도록 구성될 수 있다. 이때, 골 성장 단계 분석 장치는 골격 성숙 지표의 하위 분류에 해당할 확률 값에 기반하여 임시 성장 단계에 해당할 확률 값(예컨대, 급성장기, 급성장기 이전, 급성장기 이후 중 어느 하나에 해당할 확률 값)을 연산할 수 있다. 이때, 골 성장 단계 분석 장치는 임시 성장 단계에 해당할 확률값을 미리 정해진 임계 확률값과 비교하고, 임시 성장 단계에 해당할 확률값이 임계 확률값보다 작거나 같은 경우에는 연산된 임 시 성장 단계에 보정 이벤트가 존재한다고 판단하도록 구성될 수 있다. 한편, 임시 성장 단계에 해당할 확률값 이 임계 확률값보다 큰 경우에는, 골 성장 단계 분석 장치는 연산된 임시 성장 단계에 보정 이벤트가 존 재하지 않는다고 판단하도록 구성될 수 있다. 일 예로, 골 성장 단계 분석 장치는 골격 성숙 지표에 기반하여 연산된 임시 성장 단계와 골 연령에 기반 하여 연산된 기준 성장 단계를 비교하고, 임시 성장 단계와 기준 성장 단계가 일치하지 않은 경우에는 임시 성 정 단계에 보정 이벤트가 존재한다고 판단하고, 임시 성장 단계와 기준 성장 단계가 일치하는 경우에는 임시 성 정 단계에 보정 이벤트가 존재하지 않는다고 판단할 수 있다. 예컨대, 임시 성장 단계가 급성장기로 연산되었으 나 기준 성장 단계가 급성장기 전으로 연산된 경우에는, 골 성장 단계 분석 장치는 임시 성장 단계에 보 정 이벤트가 존재한다고 판단할 수 있다. 예컨대, 임시 성장 단계와 기준 성장 단계가 모두 급성장기로 연산된 경우에는, 골 성장 단계 분석 장치는 임시 성정 단계에 보정 이벤트가 존재하지 않는다고 판단할 수 있다. 도 12는 본 출원의 일 실시예에 따른 골의 최종 성장 단계 정보를 연산하는 양상을 설명하기 위한 도면이다. 보정 이벤트가 검출된 경우에는 기준 성장 단계에 기반하여 임시 성장 단계를 보정하여 최종 성장 단계 정보를 획득하고, 보정 이벤트가 검출되지 않은 경우에는 연산된 임시 성장 단계에 기반하여 최종 성장 단계 정보를 결 정하는 단계(S7200)에서는, 골 성장 단계 분석 장치는 S7100 단계를 통하여 임시 성장 단계에 보정 이벤 트가 존재한다고 판단된 경우에는, 골 연령에 기반하여 연산된 기준 성장 단계를 이용하여 임시 성장 단계를 보 정하여 골의 최종 성장 단계 정보를 획득할 수 있다. 반면, 골 성장 단계 분석 장치는 S7100 단계를 통하 여 임시 성장 단계에 보정 이벤트가 존재하지 않는다고 판단된 경우에는, 골격 성숙 지표에 기반하여 연산된 임 시 성장 단계를 골의 최종 성장 단계 정보를 결정하도록 구성될 수 있다.한편 도 9 내지 도 12에서는 보정 이벤트가 검출된 경우에는 임시 성장 단계를 보정하는 것으로 설명하였다. 다 만 이는 예시에 불과하며, 보정 이벤트가 검출된 경우에는, 골 성장 단계 분석 장치는 골격 성숙 지표의 하위 분류 정보를 보정하고, 보정된 골격 성숙 지표에 기반하여 골의 성장 단계 정보를 연산하도록 구현될 수도 있을 것이다. 본 출원의 실시예에 따른 골 성장 단계 분석 방법, 장치 및 시스템에 의하면, 골격 성숙 지표에 기초하여 연산 된 성장 단계와 골 연령에 기초하여 연산된 성장 단계에 기반하여 골의 성장 단계 정보를 연산함으로써, 보다 정밀하게 골의 성장 단계를 연산할 수 있다. 본 출원의 실시예에 따른 골 성장 단계 분석 방법, 장치 및 시스템에 의하면, 골격 성숙 지표에 기초하여 연산 된 성장 단계에 존재하는 보정 이벤트를 검출하고 골 연령에 기초하여 연산된 성장 단계를 이용하여 골격 성숙 지표에 기초하여 연산된 성장 단계를 보정함으로써, 보다 정밀하게 골의 성장 단계를 연산할 수 있다. 본 출원의 실시예에 따른 골 성장 단계 분석 방법, 장치 및 시스템에 의하면, 골의 성장 단계를 정밀하게 연산 함으로써, 각 성장 단계에 적절한 교정 치료를 피시술자에게 제공할 수 있다. 상술한 골 성장 단계 분석 장치의 다양한 동작들은 골 성장 단계 분석 장치의 메모리에 저장 될 수 있으며, 골 성장 단계 분석 장치의 프로세서는 메모리에 저장된 동작들을 수행하도록 제공될 수 있다. 이상에서 실시 형태들에 설명된 특징, 구조, 효과 등은 본 발명의 적어도 하나의 실시 형태에 포함되며, 반드시 하나의 실시 형태에만 한정되는 것은 아니다. 나아가, 각 실시 형태에서 예시된 특징, 구조, 효과 등은 실시 형 태들이 속하는 분야의 통상의 지식을 가지는 자에 의해 다른 실시 형태들에 대해서도 조합 또는 변형되어 실시 가능하다. 따라서 이러한 조합과 변형에 관계된 내용들은 본 발명의 범위에 포함되는 것으로 해석되어야 할 것 이다. 또한, 이상에서 실시 형태를 중심으로 설명하였으나 이는 단지 예시일 뿐 본 발명을 한정하는 것이 아니며, 본 발명이 속하는 분야의 통상의 지식을 가진 자라면 본 실시 형태의 본질적인 특성을 벗어나지 않는 범위에서 이 상에 예시되지 않은 여러 가지의 변형과 응용이 가능함을 알 수 있을 것이다. 즉, 실시 형태에 구체적으로 나타 난 각 구성 요소는 변형하여 실시할 수 있는 것이다. 그리고 이러한 변형과 응용에 관계된 차이점들은 첨부된 청구 범위에서 규정하는 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0109771", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 출원의 일 실시예에 따른 골 성장 단계 분석 시스템의 개략도이다. 도 2는 본 출원의 일 실시예에 따른 골 성장 단계 분석 장치의 동작들을 나타낸 도면이다. 도 3은 본 출원의 일 실시예에 따른 골 성장 단계의 분석 방법을 나타낸 순서도이다. 도 4는 본 출원의 일 실시예에 따른 관심 영역을 획득하는 양상을 설명하기 위한 도면이다. 도 5는 본 출원의 일 실시예에 따른 골격 성숙 지표를 연산하는 단계를 구체화한 순서도이다. 도 6은 본 출원의 일 실시예에 따른 골격 성숙 지표를 연산하는 양상을 설명하기 위한 도면이다. 도 7은 본 출원의 일 실시예에 따른 골격 성숙 지표로부터 임시 성장 단계를 연산하는 양상을 설명하기 위한 도 면이다. 도 8은 본 출원의 일 실시예에 따른 골 연령으로부터 기준 성장 단계를 연산하는 양상을 설명하기 위한 도면이 다.도 9는 본 출원의 일 실시예에 따른 골의 최종 성장 단계 정보를 연산하는 단계를 구체화한 순서도이다. 도 10은 본 출원의 일 실시예에 따른 임시 성장 단계를 보정하기 위한 보정 이벤트를 판단하는 일 양상을 도시 한 도면이다. 도 11은 본 출원의 일 실시예에 따른 임시 성장 단계를 보정하기 위한 보정 이벤트를 판단하는 일 양상을 도시 한 도면이다. 도 12는 본 출원의 일 실시예에 따른 골의 최종 성장 단계 정보를 연산하는 양상을 설명하기 위한 도면이다."}
