{"patent_id": "10-2023-0134056", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0082180", "출원번호": "10-2023-0134056", "발명의 명칭": "사용자에게 여행 장소 컨텐츠를 제공하는 방법 및 장치", "출원인": "주식회사 트립빌더", "발명자": "김명준"}}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 방법에 있어서,상기 사용자의 여행 성향에 관한 사용자 성향 특징 데이터를 식별하는 단계; 및상기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계 또는 상기 복수의 여행 장소들별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터의 유사도 중적어도 하나에 기초하여 결정된 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출력하는 단계; 를 포함하는,방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 여행 장소 컨텐츠를 출력하는 단계는상기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들 사이의 상관 관계에 기초하여 제1 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함하는 제1 장소 리스트를 획득하는 단계;상기 사용자 성향 특징 데이터와 여행 장소들 별 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데이터사이의 유사도 및 상기 사용자 성향 특징 데이터와 상기 여행 장소들 별 후기 태그 데이터에 따라 결정된 장소여행 성향 특징 데이터 사이의 유사도에 기초하여 제2 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함하는 제2 장소 리스트를 획득하는 단계; 및상기 제1 장소 리스트 또는 상기 제2 장소 리스트 중 적어도 하나에 기초하여 생성되는 제3 장소 리스트 중 일부의 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출력하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 사용자 성향 특징 데이터를 식별하는 단계는상기 사용자의 여행 성향 식별을 위해 제공된 복수의 질의들을 포함하는 시뮬레이션을 통해 응답 데이터를 획득하는 단계; 및상기 응답 데이터가 입력되면 상기 사용자 여행 성향을 나타내는 사용자 성향 특징 데이터를 출력하는 사용자여행 성향 분석 인공지능 모델에 상기 응답 데이터를 입력함으로써 상기 사용자 여행 성향 분석 인공지능 모델로부터 상기 사용자 성향 특징 데이터를 식별하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 제1 장소 리스트를 획득하는 단계는상기 사용자 성향 특징 데이터에 포함된 특징 값들에 대응되는 사용자 여행 성향 변수들 별 POI 조건 정보에 따른 상기 사용자 여행 성향 변수들과 상기 복수의 여행 장소들의 POI 변수들 사이의 상관 관계에 기초하여, 상기사용자 성향 특징 데이터가 입력되면, 상기 제1 타입의 스코어에 기초하여 결정된 제1 우선순위에 따른 상기 제1 장소 리스트를 출력하도록 미리 학습된 POI 기반 장소 추천 모델로부터 상기 제1 장소 리스트를 획득하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 제2 장소 리스트를 획득하는 단계는상기 사용자 성향 특징 데이터와 상기 여행 장소들 별 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데이터의 차이값과, 상기 사용자 성향 특징 데이터와 상기 여행 장소 별 후기 태그 데이터에 따라 결정된 장소 여행 성향 특징 데이터의 차이값을 최소화하는 손실 함수의 출력 값에 기초하여, 상기 사용자 성향 특징 데이터가입력되면, 상기 제2 타입의 스코어에 기초하여 결정된 제2 우선순위에 따른 상기 제2 장소 리스트를 출력하도록공개특허 10-2024-0082180-3-미리 학습된 소셜 감성 데이터 기반 장소 추천 모델로부터 상기 제2 장소 리스트를 획득하는 단계; 를포함하는, 방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 여행 장소 컨텐츠를 출력하는 단계는상기 제1 장소 리스트 또는 상기 제2 장소 리스트 중 적어도 하나에서 식별되는 여행 장소들 별로 매칭될 제3타입의 스코어를 결정하기 위해, 상기 제1 타입의 스코어 및 상기 제2 타입의 스코어에 적용될 가중치들의 비율을 결정하는 단계;상기 결정된 가중치들의 비율에 기초하여 상기 여행장소들 별 상기 제1 타입의 스코어 및 상기 제2 타입의 스코어를 가중합함으로써 결정되는 제3 타입의 스코어에 기초하여 제3 우선순위를 결정하는 단계; 및상기 제3 우선순위에 기초하여, 상기 제3 장소 리스트 중 상기 일부의 여행 장소 정보들을 포함하는 여행 장소컨텐츠를 출력하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 가중치들의 비율을 결정하는 단계는상기 여행 장소들 별, 미리 매칭되어 있는 POI 변수의 수 또는 상기 POI 변수 별 POI 값이 공백인 POI 변수 공백 비율을 식별하는 단계;상기 미리 매칭되어 있는 POI 변수의 수가 임계치 보다 작거나, 상기 POI 변수 공백 비율이 임계 공백 비율보다크게 식별되는 여행 장소에 대한 상기 제3 타입의 스코어를 결정함에 있어, 상기 제1 타입의 스코어의 비중이작아지도록 상기 가중치들의 비율을 결정하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 가중치들의 비율을 결정하는 단계는상기 여행 장소들 별 감성 특징 데이터를 결정하는데 사용된 소셜 데이터의 수를 식별하는 단계; 및상기 식별된 소셜 데이터의 수가 임계 데이터 수 보다 작게 식별되는 여행 장소에 대한 제3 타입의 스코어를 결정함에 있어, 상기 제2 타입의 스코어의 비중이 작아지도록 상기 가중치들의 비율을 결정하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서, 상기 가중치들의 비율을 결정하는 단계는제1 타입의 스코어 또는 제2 타입의 스코어 중 동일한 스코어를 나타내는 2이상의 여행 장소들이 제1 장소 리스트 또는 제2 장소 리스트에서 식별되는 경우, 상기 동일한 스코어를 나타내는 2이상의 여행 장소들이 식별되는장소 리스트의 타입과 다른 장소 리스트상에서, 상기 2이상의 여행 장소들에 대한 스코어를 식별하는 단계; 및상기 동일한 스코어를 나타내는 2이상의 여행 장소들에 대한 제3 타입의 스코어를 결정함에 있어, 상기 다른 장소 리스트 상에서 식별된 상기 2이상의 여행 장소들에 대한 스코어의 비중이 높아지도록, 상기 가중치들의 비율을 결정하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서, 상기 여행 장소 컨텐츠를 출력하는 단계는상기 제2 타입의 스코어에 기초하여 상기 제2 장소 리스트 상 여행 장소 정보들을 정렬하기 위한 제2 우선 순위를 결정하는 단계;상기 제1 장소 리스트상에서 매칭된, 상기 제2 장소 리스트 상 식별되는 여행 장소들의, 제1 타입의 스코어를식별하는 단계;상기 제2 장소 리스트 상 식별되는 여행 장소들이 상기 제1 장소 리스트상에서 가지는 제1 타입의 스코어에 기초하여, 상기 제2 우선 순위를 조정하는 단계; 및공개특허 10-2024-0082180-4-상기 조정된 제2 우선 순위에 기초하여 상기 제2 장소 리스트상 일부의 장소 정보를 포함하는 여행 장소 컨텐츠를 출력하는 단계; 를 포함하는, 방법"}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제3항에 있어서, 상기 방법은상기 성향 특징 데이터를 식별하는 단계에 앞서, 상기 상관 관계에 기초하여, 상기 사용자 성향 특징 데이터가입력되면, 상기 제1 타입의 스코어에 기초하여 결정된 제1 우선순위에 따른 상기 제1 장소 리스트를 출력하도록POI 기반 장소 추천 모델을 학습시키는 단계; 및상기 손실 함수의 출력 값에 기초하여, 상기 사용자 성향 특징 데이터가 입력되면, 상기 제2 타입의 스코어에기초하여 결정된 제2 우선순위에 따른 상기 제2 장소 리스트를 출력하는 소셜 감성 데이터 기반 장소 추천 모델을 학습시키는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "사용자에게 여행 장소 컨텐츠를 제공하는 전자 장치에 있어서,네트워크 인터페이스;하나 이상의 인스트럭션을 저장하는 메모리; 및상기 하나 이상의 인스트럭션을 실행하는 적어도 하나의 프로세서; 를 포함하고,상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써,상기 사용자의 여행 성향에 관한 사용자 성향 특징 데이터를 식별하고,상기 사용자 성향 특징 데이터가 입력되면, 상기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계 또는 상기 복수의 여행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터 중 적어도 하나에 기초하여 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를출력하는, 전자 장치."}
{"patent_id": "10-2023-0134056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 방법에 있어서,상기 사용자의 여행 성향에 관한 사용자 성향 특징 데이터를 식별하는 단계; 및상기 사용자 성향 특징 데이터가 입력되면, 상기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계 또는 상기 복수의 여행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터 중 적어도 하나에 기초하여 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를출력하는 단계; 를 포함하는, 방법을 수행하도록 하는 프로그램이 저장된 컴퓨터로 읽을 수 있는 기록 매체."}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 일 실시 예에 따른 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 방법은 상기 사용자의 여행 성향에 관한 사용자 성향 특징 데이터를 식별하는 단계; 및 상기 사용자 성향 특징 데이터와 복수의 여행 장소들 의 POI 변수들의 상관 관계 또는 상기 복수의 여행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터의 유사도 중 적어도 하나에 기초하여 결정된 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출력하는 단계; 를 포함할 수 있다."}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 여행 장소 컨텐츠를 제공하는 방법 및 장치에 관한 것이다. 보다 상세하게는 인공지능 기반 사용자에 게 여행 장소에 대한 컨텐츠를 제공하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "혼자 여행 또는 즉흥 여행 문화의 확산으로 여행 성향 및 취향 기반의 여행 추천 서비스에 대한 수요가 증가하 고 있다. 일반적인 여행 추천 기술의 경우, 많은 트래픽과 여행 데이터가 발생하는 경우 적합할 수 있음은 별론, 여행 산업 분야는 신규 유입 여행자가 많지 않고, 트래픽이 낮은 특성이 있다. 따라서, 종래 인공지능 기술을 활용하여 여행 컨텐츠를 추천하기 위한 기술들이 개시되어 왔으나, 정확한 여행 컨텐츠 추천을 위한 학습 데이터를 확보하는데 어려움이 있기 때문에 트래픽이 적은 여행 산업 분야에 적합하지 않은 문제점이 있으며, 또한, 대부분의 여행 추천 기술의 경우 적은 트래픽으로 인해 충분한 학습용 데이터 베이스를 구축하지 못하고, 그 결과 사용자의 성향에 적합한 여행 컨텐츠를 추천하는데 한계가 있다. 또한, 종래 인공지능 기술을 활용한 여행 추천 기술의 경우, 이용하는 학습용 데이터의 객관성 신뢰도가 담보되 지 않는 문제점이 있으며, 여행에 영향을 미치는 다양한 요인을 완벽하게 고려하는 것이 불가할 뿐만 아니라, 여행 계절, 동반 유형 등에 따라 여행자의 성향 및 취향이 변하는 현상을 반영하지 못하는 한계가 있다. 따라서, 트래픽이 낮은 여행 산업 분야에서 사용자의 여행 성향을 분석하고, 이를 통해 사용자의 여행 성향에 적합한 여행 컨텐츠 추천 기술 개발이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제2236546호"}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 실시 예에 의하면, 사용자에게 여행 장소 컨텐츠를 제공하는 방법 및 이를 수행하는 전자 장치가 제공될 수 있다. 일 실시 예에 의하면 여행 장소 별 POI 변수들 또는 여행 장소 별 소셜 데이터 기반 결정되는 장소 별 감성 특 징 중 적어도 하나에 기초하여 사용자에게 여행 장소 컨텐츠를 제공하는 방법 및 이를 수행하는 전자 장치가 제 공될 수 있다."}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 일 실시 예에 의하면, 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 방법에 있어서, 상기 사용자의 여행 성향에 관한 사용자 성향 특징 데이터를 식별하는 단계; 및 상기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계 또는 상기 복수의 여 행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터의 유사도 중 적어도 하나에 기초하여 결정된 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출력하는 단계; 를 포함하는, 방법이 제공될 수 있다. 상술한 기술적 과제를 달성하기 위한 또 다른 실시 예에 의하면, 사용자에게 여행 장소 컨텐츠를 제공하는 전자 장치에 있어서, 네트워크 인터페이스; 하나 이상의 인스트럭션을 저장하는 메모리; 및 상기 하나 이상의 인스트 럭션을 실행하는 적어도 하나의 프로세서; 를 포함하고, 상기 적어도 하나의 프로세서는 상기 하나 이상의 인스 트럭션을 실행함으로써, 상기 사용자의 여행 성향에 관한 사용자 성향 특징 데이터를 식별하고, 상기 사용자 성 향 특징 데이터가 입력되면, 상기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계 또 는 상기 복수의 여행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터 중 적어도 하나에 기초하여 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출력하는, 전자 장치가 제공될 수 있다. 상술한 기술적 과제를 달성하기 위한 또 다른 실시 예에 의하면, 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 방법에 있어서, 상기 사용자의 여행 성향에 관한 사용자 성향 특징 데이터를 식별하는 단계; 및 상기 사용자 성향 특징 데이터가 입력되면, 상기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상 관 관계 또는 상기 복수의 여행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상 기 사용자 성향 특징 데이터 중 적어도 하나에 기초하여 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출력 하는 단계; 를 포함하는, 방법을 수행하도록 하는 프로그램이 저장된 컴퓨터로 읽을 수 있는 기록 매체가 제공 될 수 있다."}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시 예에 의하면, 여행 장소에 대한 컨텐츠가 부족한 상황에서도 사용자의 성향에 맞는 여행 장소 컨텐츠를 제공할 수 있다.일 실시 예에 의하면, 트래픽이 낮은 여행 산업 분야에서 사용자의 여행 성향과 매칭되는 여행 장소를 정확하게 식별할 수 있다."}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 일 실시 예에 따른 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 과정을 개략적으로 나타내는 도면이다. 일 실시 예에 의하면 여행 장소 컨텐츠 매칭 시스템은 사용자의 여행 성향에 관한 사용자 성향 특징 데이터 를 식별하고 식별된 사용자 성향 특징 데이터에 대응되는 복수의 여행 장소들을 포함하는 여행 장소 컨텐 츠를 결정할 수 있고, 결정된 여행 장소 컨텐츠를 사용자(예컨대 여행 예정자, 여행자 등)에게 제공 할 수 있다. 일 실시 예에 의하면 여행 장소 컨텐츠 매칭 시스템은 전자 장치 및 서버를 포함 할 수 있다. 그러나 상술한 예에 한정되는 것은 아니며, 여행 추천 서비스 가입자들이 이용하는 장치로, 전자 장치 또는 서버와 연결될 수 있는 전자 장치를 더 포함할 수 있다. 본 개시에 따른 여행 장소 컨텐츠 매칭 시스템은 여행 장소(예컨대 여행 장소지) 별 미리 설정된 POI 변수 들에 기초하여 결정되는 여행 장소 리스트 정보 또는 여행 장소 별 소셜 데이터 또는 상기 여행 장소 별 복수의 소셜 데이터들에서 나타나는 감성 특징 데이터에 기초하여 결정되는 여행 장소 리스트 중 적어도 하나에 기초하 여 사용자 여행 성향에 매칭되는 여행 장소 컨텐츠를 제공할 수 있다. 또 다른 예에 의하면 여행 장소 컨텐츠 매칭 시스템은 POI 변수들에 기초하여 결정되는 여행 장소 리스트 정보 또는 여행 장소 별 소셜 데이터 및 상기 여행 장소 별 복수의 소셜 데이터들에서 나타나는 감성 특징 데이터에 기초하여 결정되는 여행 장소 리스 트를 복합적으로 이용함으로써 사용자 성향 특징 데이터에 매칭되는 여행 장소 컨텐츠를 제공할 수 있다. 또 다른 예에 의하면, 여행 장소 컨텐츠 매칭 시스템은 후술하는 소셜 감성 데이터 기반 장소 추천 모델의 출력 값과 POI 기반 장소 추천 모델의 출력 값을 미리 설정된 조건에 따라 조합함으로써 사용자 성향 특징 데이 터에 최적화된 여행 장소 컨텐츠를 제공할 수 있다. 또 다른 예에 의하면, 여행 장소 컨텐츠 매칭 시스템은 감성 데이터 기반 장소 추천 모델의 출력 값과 POI 기반 장소 추천 모델의 출력 값을 상호 보완적으로 이용함으 로써 사용자 성향 특징 데이터에 최적화된 여행 장소 컨텐츠를 제공할 수 있다. 일 실시 예에 의하면, 전자 장치는 사용자 입력을 획득하고, 획득된 사용자 입력에 기초하여 식별되는 사용자 성향 특징 데이터에 대응되는 여행 장소 컨텐츠를 출력할 수 있다. 일 실시 예에 의하면, 사용자 입력은 응답 데이터 및 사용자 정보를 포함할 수 있고, 사용자 입력은 전자 장치에 대한 사용자 입력에 기초하여 획득되는 사용자 입력 기반 획득 정보들을 포함할 수 있다. 또 다른 예에 의하면, 전자 장치는 전자 장치에 대한 사용자 입력에 기초하여 응답 데이터 및 사용자 정보를 획 득할 수도 있다. 일 실시 예에 의하면, 전자 장치는 사용자의 여행 성향 식별을 위해 복수의 질의들을 포함하는 시뮬레이 션을 제공할 수 있고, 소정의 우선 순위에 따른 미리 정해진 응답지 수가 할당되어 있는 복수의 질의들에 대한 응답들을 포함하는 응답 데이터를 획득할 수 있다. 또한, 일 실시 예에 의하면 사용자 정보는 사용자 의 나이 정보, 성별 정보, 전화번호 정보, 개인정보 동의 확인 정보, 마케팅 정보 수신여부 확인 정보 중 적어 도 하나를 포함할 수 있다. 또 다른 예에 의하면, 사용자 정보는 이전에 제공된 사용자의 여행 성향 특징 데이터 정보를 포함할 수도 있다. 일 실시 예에 의하면 여행 장소 컨텐츠는 장소 리스트 및 우선 순위를 포함할 수 있다. 일 실 시 예에 의하면 여행 장소 컨텐츠는 복수의 여행 장소들에 대한 정보와 상기 복수의 여행 장소들 중 사용 자 성향 특징 데이터에 대한 매칭 정도에 따른 우선 순위에 대한 정보를 포함할 수 있다. 예를 들어, 장소 리스 트는 여행 장소 별, 여행 장소에 관한 SNS 데이터, 여행 장소에 관한 이미지 또는 여행 장소에 대한 영상 중 적어도 하나에 관한 여행 장소 정보들을 포함할 수 있으며, 상기 여행 장소 정보들 중 사용자 여행 성향 특 징에 따른 스코어 순위에 기초하여 결정되는 우선 순위에 대한 정보를 더 포함할 수도 있다. 본 명세서에서 개시되는 여행 장소 컨텐츠를 제공하는 방법은 전자 장치 또는 서버 중 적어도 하나 에 의해 수행될 수 있다. 일 실시 예에 의하면, 전자 장치는 사용자 입력을 획득하고, 획득된 사용 자 입력을 서버로 전송할 수 있다. 서버는 사용자 입력에 기초하여 응답 데이터를 식별 하고, 식별된 응답 데이터를 사용자 여행 성향 분석 인공지능 모델에 입력함으로써 사용자 성향 특징 데이터를 식별할 수 있다. 일 실시 예에 의하면, 사용자 여행성향 분석 인공지능 모델은 사용자 성향 특징 데이터들을 서 로 다른 수준으로 클러스터링할 수 있는 하나 이상의 타입의 클러스터들을 이용하여 사용자 성향 특징 데이터를 분류하는 신경망 기반 네트워크를 포함할 수 있다. 서버는 사용자 성향 분석 인공지능 모델에서 출력된 사용자 성향 특징 데이터를 여행 장소 추천 모 델에 입력함으로써 여행 장소 컨텐츠를 결정할 수 있다. 일 실시 예에 의하면 여행 장소 추천 모델 은 여행 장소 별 POI 변수들 또는 여행 장소들에 대한 소셜 데이터 상에서 나타나는 감성 특징 데이터 중 적어도 하나에 기초하여 사용자 성향 특징 데이터에 맞는 여행 장소를 추천하는 하나 이상의 모델들을 포함할 수 있다. 서버는 여행 장소 추천 모델로부터 획득된 여행 장소 컨텐츠를 전자 장치로 전 송할 수 있다. 전자 장치는 서버로부터 획득된 여행 장소 컨텐츠를 출력할 수 있다.일 실시 예에 의하면, 전자 장치, 전자 장치 및 서버는 서로 네트워크를 통해 연결될 수 있다. 예를 들어, 전자 장치는 네트워크를 통해 서버와 사용자 입력, 사용자 성향 특징 데이터, 여행 장소 컨텐츠, 하나 이상의 인공지능 모델에 대한 정보, 복수의 여행 장소 추천 모델들에 대한 정 보를 송수신할 수도 있다. 일 실시 예에 의하면, 여행 장소 추천 모델은 POI 기반 장소 추천 모델 또는 소 셜 감성 데이터 기반 장소 추천 모델 중 적어도 하나를 포함할 수 있다. 일 실시 예에 의하면 여행 장소 컨텐츠 는 서로 다른 타입의 스코어, 상기 서로 다른 타입의 스코어에 기초하여 각각 결정되는 서로 다른 타입의 우선순위를 포함할 수 있다. 또 다른 예에 의하면, 여행 장소 컨텐츠는 상기 서로 다른 타입의 스코어에 기초하여 결정되는 종합 스코어에 기초하여 결정되는 종합 우선순위에 대한 정보를 더 포함할 수도 있다. 도 2는 또 다른 실시 예에 따른 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 과정을 설명하기 위한 도 면이다. 도 2에 도시된 모듈(module)은 전자 장치의 메모리 또는 여행 장소 컨텐츠 매칭 시스템의 데이터베이스에 저장되는 하나 이상의 인스트럭션 또는 하나 이상의 인스트럭션의 집합들을 의미할 수 있다. 도 2에 도시된 모 듈은 여행 장소 컨텐츠를 제공하는 방법을 수행하는데 필요한 기능을 실행하기 위해, 전자 장치 또는 여행 장소 컨텐츠 매칭 시스템에 포함된 적어도 하나의 프로세서에 의해 실행 가능한 인스트럭션에 대응될 수 있다. 일 실시 예에 의하면, 전자 장치는 TRI-PIN Module에 대응되는 인스트럭션을 실행함으로써 사용자 입력, POI 변수 또는 후술하는 여행 감성 분석 인공지능 모델(TRI-FIT) 로부터 획득되는, 소셜 데이 터상 나타나는 여행 장소 별 감성 특징 데이터에 따른 장소 여행 성향 특징 데이터 중 적어도 하나를 입력 데이터로 획득할 수 있다. 또한, 전자 장치는 획득된 입력 데이터를 적어도 하나의 장소 추천 모델 (210, 212)에 입력함으로써, 적어도 하나의 장소 추천 모델의 출력 값을 획득하고, 획득된 적어도 하나의 장소 추천 모델의 출력 값들에 기초하여 사용자 성향에 매칭되는 여행 장소 컨텐츠를 출력 데이터로 제공할 수 있다. 일 실시 예에 의하면, 전자 장치는 메모리에 저장된 POI-V NETWORK에 대응되는 인스트럭션을 실행함 으로써, 사용자 성향 특징 데이터가 입력되면, 제1 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함하 는 제1 장소 리스트를 출력하는, POI 기반 장소 추천 모델을 학습 및 실행할 수 있다. 또한, 전자 장치는 메모리에 저장된 WORD-V NETWORK에 대응되는 인스트럭션을 실행함으로써, 사용자 성향 특징 데이터가 입력 되면, 제2 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함하는 제2 장소 리스트를 출력하는 소셜 감성 데이터 기반 장소 추천 모델을 학습 및 실행할 수 있다. 일 실시 예에 의하면, 전자 장치는 후술하는 사용자의 여행 성향 변수들 별로 미리 설정된 POI 조건 값에 기초하여, 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계를 결정하고, 결정된 상관 관계에 기초하여 POI 기반 장소 추천 모델을 구축&학습시킬 수 있다. 예를 들어, 전자 장치는 시각 중시 형 사용자 여행 성향 변수들의 경우, 여행 장소들 별 POI 변수들 중 운영 시간(TIME)에 대해 민감한 특성이 있 다는 통계 데이터에 기초하여 시각 중시형 사용자 여행 성향 변수들에 대해서는 POI 변수들 중, 운영 시간 (TIME) POI 변수와의 상관 관계를 높게 매칭하여야 한다는 조건을 POI 조건 값으로 미리 설정할 수 있다. 전자 장치는 사용자 여행 성향 변수들 별로 미리 설정된 POI 조건 값에 기초하여, 사용자 여행 성향 변수 들 별로 관련되는 POI 변수들의 수를 식별할 수 있다. 일 실시 예에 의하면 전자 장치는 사용자 여행 성 향 변수들 별 POI 조건 값에 기초하여, 사용자 여행 성향 변수들 별 관련되는 POI 변수들의 수가 많을수록 POI 변수들과 해당 사용자 여행 성향 변수들의 상관 관계를 높게 결정할 수 있다. 또한, 일 실시 예에 의하면, 전자 장치는 복수의 여행 장소들 별 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데이터(216, 220)와 사용자의 여행 성향에 관한 사용자 성향 특징 데이터의 차이 값을 최소화하 는 손실 함수의 출력 값에 기초하여, 소셜 감성 데이터 기반 장소 추천 모델을 구축&학습시킬 수 있다. 또 다른 예에 의하면, 전자 장치는 복수의 여행 장소들 별 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데이터와 사용자 여행 성향 특징 데이터의 차이 값과, 복수의 여행 장소들 별 후기 태그 데이터에 따라 결 정된 장소 여행 성향 특징 데이터와 사용자 성향 특징 데이터의 차이 값을 최소화하는 손실 함수의 출력 값에 기초하여 소셜 감성 데이터 기반 장소 추천 모델을 학습시킬 수도 있다. 일 실시 예에 의하면 여행 장소 별 감성 특징 데이터는, 여행 장소 별 소셜 데이터상(예컨대 경복궁 관련 네이 버 블로그, 페이스북 게시글등) 워드투벡터 모델을 적용함으로써 획득되는 형태소 키워드들 기반 유효 감성 키 워드들과, 미리 구축된 여행 특화 사전 데이터에 포함된 대표 감성 키워드들의 유사도에 기초하여 여행 감성 분석 인공지능 모델로부터 출력되는, 대표 감성 키워드들의 특징 값을 포함할 수 있다. 또한, 장소 여행 성향 특 징 데이터는 여행 감성 분석 인공지능 모델의 출력 값이 입력되면, 사용자 여행 성향 변수 별 특징 값을 포함하 는 사용자 여행 성향 특징 데이터로 변환 및 출력하는 적어도 하나의 신경망 기반 네트워크를 포함하는 WORD V LINKING 네트워크의 출력 값을 의미할 수 있다. 본 개시에 따른 전자 장치는 여행 산업 분야에서 여행 장소에 대한 데이터가 많지 않은 경우에도, POI 기 반 장소 추천 모델의 출력 값과, 소셜 감성 데이터 기반 장소 추천 모델의 출력 값을 상호 보완적으로 이용함으 로써, 비록 소정의 여행 장소에 대한 소셜 데이터가 부족하더라도, 사용자 성향에 매칭가능한 여행 장소 컨텐츠 들을 효과적으로 제공할 수 있다. 도 3은 일 실시 예에 따른 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 방법의 흐름도이다. S310에서, 전자 장치는 사용자의 여행 성향에 관한 사용자 성향 특징 데이터를 식별할 수 있다. 예를 들 어, 도 3에는 도시되지 않았지만, 전자 장치는 사용자의 여행 성향 식별을 위해 제공된 복수의 질의들을 포함하는 시뮬레이션을 통해 응답 데이터를 획득할 수 있다. 전자 장치는 응답 데이터가 입력되면 상기 사용자 여행 성향을 나타내는 사용자 성향 특징 데이터를 출력하는 사용자 여행 성향 분석 인공지능 모델에 상 기 응답 데이터를 입력함으로써 상기 사용자 여행 성향 분석 인공지능 모델로부터 상기 사용자 성향 특징 데이 터를 식별할 수 있다. 또 다른 예에 의하면, 전자 장치는 사용자로부터 응답 데이터를 포함하는 사용자 입력을 획득하고, 획득 된 응답 데이터가 입력되면, 사용자 여행 성향 변수들 별 특징 값을 포함하는 성향 특징 데이터를 출력하는 사 용자 여행 성향 분석 인공지능 모델로부터, 상기 사용자 성향 특징 데이터를 획득할 수도 있다. 전자 장치 는 응답 데이터가 입력되면 사용자 여행 성향 변수들 별 특징 값을 포함하는 사용자 여행 성향 특징 정보 및 상기 사용자 여행 성향 특징 정보들이 속하는, 서로 다른 수준의 다차원 공간상의 클러스터들 중 하나의 클 러스터를 식별하는 클러스터 식별 정보에 관한 사용자 여행 성향 클러스터 라벨 정보를 포함하는 성향 특징 데 이터를, 사용자 여행 성향 분석 인공지능 모델로부터 획득하게 된다. 전자 장치가 사용자 성향 특징 데이 터를 획득하기 위한 사용자 여행 성향 변수들과 사용자 여행 성향 분석 인공지능 모델에 대한 구체적인 내용은 후술하는 도 7을 참조하여 설명하기로 한다. S320에서, 전자 장치는 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계 또는 상기 복수의 여행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터의 유사도 중 적어도 하나에 기초하여 결정된 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출 력할 수 있다. 예를 들어, 전자 장치는 식별된 사용자의 성향 특징 데이터에 대해 매칭 가능한 여행 장소 리스트를 결정함에 있어, 복수의 여행 장소들의 POI 변수들을 기초로 결정되는 여행 장소 리스트 및 각 여행 장 소들 별 소셜 데이터로부터 획득되는 감성 키워드들을 기초로 결정되는 여행 장소 리스트를 여행 장소 단위 별 로 새롭게 조합함으로써, 사용자 성향에 맞는 여행 장소 리스트를 출력할 수 있다. 도 4는 일 실시 예에 따른 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 구체적인 방법의 흐름도이다. S410에서, 전자 장치는 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들 사이의 상관 관계에 기초하여 제1 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함하는 제1 장소 리스트를 획득할 수 있다. 예를 들어, 전자 장치는 사용자 성향 특징 데이터에 포함된 특징 값들에 대응되는 사용자 여행 성향 변수 들 별 POI 조건 정보에 따른 상기 사용자 여행 성향 변수들과 상기 복수의 여행 장소들의 POI 변수들 사이의 상 관 관계에 기초하여, 상기 사용자 성향 특징 데이터가 입력되면, 상기 제1 타입의 스코어에 기초하여 결정된 제 1 우선순위에 따른 상기 제1 장소 리스트를 출력하도록 미리 학습된 POI 기반 장소 추천 모델로부터 상기 제1 장소 리스트를 획득할 수 있다. S420에서, 사용자 성향 특징 데이터와 여행 장소들 별 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데 이터 사이의 유사도 및 상기 사용자 성향 특징 데이터와 상기 여행 장소들 별 후기 태그 데이터에 따라 결정된 장소 여행 성향 특징 데이터 사이의 유사도에 기초하여 제2 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함하는 제2 장소 리스트를 획득할 수 있다. 예를 들어, 전자 장치는 사용자 성향 특징 데이터와, 후술하는 여행 감성 분석 인공지능 모델로부터 출력 된 감성 특징 데이터가 변환된 장소 여행 성향 특징 데이터의 차이 값에 기초하여 사용자 성향 특징 데이터와 감성 특징 데이터 기반 장소 여행 성향 특징 데이터 사이의 유사도를 결정할 수 있다. 또한, 전자 장치는 사용자 성향 특징 데이터와 여행 장소 별 후기 태그 데이터에 따라 결정되는 장소 여행 성향 특징 데이터의 차이 값에 기초하여, 사용자 성향 특징 데이터와 여행 장소 별 후기 태그 데이터 기반 장소 여행 성향 특징 데이 터 사이의 유사도를 결정할 수 있다. 전자 장치는 사용자 성향 특징 데이터와 감성 특징 데이터 기반 장 소 여행 성향 특징 데이터 사이의 유사도와 사용자 성향 특징 데이터와 여행 장소 별 후기 태그 데이터 기반 장 소 여행 성향 특징 데이터 사이의 유사도가 모두 높게 식별되는, 여행 장소 정보들을 제2 장소 리스트로 획득할 수 있다. 또 다른 예에 의하면, 전자 장치는 상기 사용자 성향 특징 데이터와 상기 여행 장소들 별 감성 특징 데이 터에 따라 결정된 장소 여행 성향 특징 데이터의 차이값과, 상기 사용자 성향 특징 데이터와 상기 여행 장소 별 후기 태그 데이터에 따라 결정된 장소 여행 성향 특징 데이터의 차이값을 최소화하는 손실 함수를 정의할 수 있 다. 전자 장치는 정의된 손실 함수의 출력 값에 기초하여, 사용자 성향 특징 데이터가 입력되면, 제2 타 입의 스코어에 기초하여 결정된 제2 우선순위에 따른 제2 장소 리스트를 출력하도록 미리 학습된 소셜 감성 데 이터 기반 장소 추천 모델로부터 제2 장소 리스트를 획득할 수 있다. S430에서, 전자 장치는 제1 장소 리스트 또는 상기 제2 장소 리스트 중 적어도 하나에 기초하여 생성되는 제3 장소 리스트 중 일부의 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출력할 수 있다. 본 개시에 따른 전자 장치는 제1 장소 리스트와 제2 장소 리스트를 상호 보완적으로 사용함으로써 제1 장소 리스트 또는 제2 장소 리스트 중 적어도 하나에 나타나는 여행 장소들을 포함하는 제3 장소 리스트를 결정하고, 결정된 제3 장소 리스트 중 일부의 여행 장소들에 대한 정보를 포함하는 여행 장소 컨텐츠를 제공할 수 있다. 일 실시 예에 의하면, 전자 장치가 획득하는 제1 장소 리스트에 포함된 여행 장소들에는 제1 타입의 스코 어가 미리 매칭될 수 있고, 제1 장소 리스트상 여행 장소들은 제1 타입의 스코어에 기초하여 결정되는 제1 우선 순위에 기초하여 정렬된 상태일 수 있다. 일 실시 예에 의하면 제1 타입의 스코어는 사용자 여행 성향 변수들 별로 미리 설정된 POI 조건 값에 기초하여, 여행 장소들 별 POI 변수들을 필터링함으로써 결정되는 점수일 수 있다. 일 실시 예에 의하면, 제1 타입의 스코어는 사용자 여행 성향 변수들과 여행 장소들 별로 미리 설정되는 POI 변수들의 상관 관계에 기초하여 결정되는 점수일 수 있다. 또한, 전자 장치가 획득하는 제2 장소 리스트에 포함된 여행 장소들에는 제2 타입의 스코어가 미리 매칭 될 수 있고, 제2 장소 리스트상 여행 장소들은 제2 타입의 스코어에 기초하여 결정되는 제2 우선순위에 기초하 여 정렬된 상태일 수 있다. 일 실시 예에 의하면, 제2 타입의 스코어는 소셜 데이터 상 나타나는 감성 키워드 또는 후기 태그 데이터에 따라 결정되는 장소 여행 성향 특징 데이터와 사용자 성향 특징 데이터의 차이에 기초 하여 결정되는 점수일 수 있다. 일 실시 예에 의하면, 제2 타입의 스코어는 여행 장소들 별 소셜 데이터에서 나 타나는 키워드를 기반으로 결정되는 점수일 수 있다. 이하에서는 전자 장치가 제3 장소리스트상 여행 장소들 별 제3 타입의 스코어를 결정하는 과정과, 제3 타 입의 스코어에 기초하여 결정되는 제3 우선 순위에 따라 제3 장소 리스트상 일부 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 제공하는 과정을 구체적으로 설명하기로 한다. 예를 들어, 본 개시에 따른 전자 장치는 여행 장소들 중 특정 여행 장소들에 대한 소셜 데이터가 부족한 경우, 제3 장소 리스트를 결정함에 있어 POI 기반 장소 추천 모델의 출력 값을 더 비중있게 활용할 수 있다. 또 다른 예에 의하면, 전자 장치는 여행 장소들 중, 특정 여행 장소별 POI 변수들을 식별한 결과 POI 데이터 의 공백이 있거나, 해당 여행 장소에 대해 매칭되는 POI 변수의 수가 임계 수미만인 경우, 소셜 감성 데이터 기 반 장소 추천 모델의 출력 값을 더 비중있게 활용함으로써 제3 장소 리스트를 결정할 수도 있다. 보다 상세하게는, 일 실시 예에 따른 전자 장치는 상기 제1 장소 리스트 또는 상기 제2 장소 리스트 중 적어도 하나에서 식별되는 여행 장소들 별로 매칭될 제3 타입의 스코어를 결정하기 위해, 상기 제1 타입의 스코 어 및 상기 제2 타입의 스코어에 적용될 가중치들의 비율을 결정할 수 있다. 또한, 전자 장치는 결정된 가중치들의 비율에 기초하여 상기 여행장소들 별 상기 제1 타입의 스코어 및 상기 제2 타입의 스코어를 가중합 함으로써 결정되는 제3 타입의 스코어에 기초하여 제3 우선순위를 결정할 수 있다. 전자 장치는 제3 우선 순위에 기초하여 제3 장소 리스트 중 일부 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출력할 수 있다. 일 실시 예에 의하면, 전자 장치는 여행 장소들 별 소셜 데이터의 수가 부족하거나, 여행 장소들 별 매칭 가능한 POI 변수의 수가 적거나, POI 변수의 공백 값의 비율이 높은 여행 장소가 식별되는 경우, 소셜 감성 데 이터 기반 장소 추천 모델과 POI 기반 장소 추천 모델의 출력 값을 상호 보완적으로 이용하기 위해 가중치들의 비율을 조정할 수 있다. 예를 들어, 전자 장치는 소정의 여행 장소에 대한 소셜 데이터의 수가 기 설정된 임계 데이터수 미만으로 식별되는 경우, 해당 여행 장소에 대한 제3 타입의 스코어를 결정함에 있어, 소셜 감성 데이터 기반 장소 추천 모델의 출력 값의 비중을 낮추고, 상대적으로 POI 기반 장소 추천 모델의 출력 값을 제3 타입의 스코어에 더 비 중있게 반영할 수 있다. 예를 들어, 전자 장치는 여행 장소들 별로 미리 할당되는 POI 변수들의 수나 POI 변수의 값이 공백인 비율이 높은 여행 장소에 대한 제3 타입의 스코어를 결정함에 있어서, POI 기반 장소 추천 모델의 출력 값의 비중을 낮추고, 소셜 감성 데이터 기반 장소 추천 모델의 출력 값의 비중을 더 높게 반영할 수 있다. 보다 상세하게는, 전자 장치는 여행 장소들 별 미리 매칭되어 있는 POI 변수의 수 또는 POI 변수 별 POI 값이 공백인 POI 변수 공백 비율(예컨대 여행 장소 별 전체 POI 변수들의 수 대비 POI 변수 값이 공백인 POI 변 수의 수의 비율)을 식별하고, 미리 매칭되어 있는 POI 변수의 수가 임계치 보다 작거나, 상기 POI 변수 공백 비 율이 임계 공백 비율 보다 크게 식별되는 여행 장소에 대한 제3 타입의 스코어를 결정함에 있어서, 제1 타입의 스코어의 비중이 작아지도록 가중치들의 비율을 결정할 수 있다. 또한, 전자 장치는 여행 장소들 별 감성 특징 데이터를 결정하는데 사용된 소셜 데이터의 수를 식별하고, 식별된 소셜 데이터의 수가 임계 데이터 수 보다 작게 식별되는 여행 장소에 대한 제3 타입의 스코어를 결정함 에 있어, 상기 제2 타입의 스코어의 비중이 작아지도록 가중치들의 비율을 결정할 수 있다. 또 다른 실시 예에 의하면, 전자 장치는 제1 타입의 스코어 또는 제2 타입의 스코어 중 동일한 스코어를 나타내는 2이상의 여행 장소들이 제1 장소 리스트 또는 제2 장소 리스트에서 식별되는 경우, 상기 동일한 스코 어를 나타내는 2이상의 여행 장소들이 식별된 장소 리스트의 타입과 다른 장소 리스트상에서 상기 2이상의 여행 장소들에 대한 스코어를 식별하고, 상기 동일한 스코어를 나타내는 2이상의 여행 장소들에 대한 제3 타입의 스 코어를 결정함에 있어, 상기 다른 장소 리스트상에서 식별된 상기 2이상의 여행 장소들에 대한 스코어의 비중이 높아지도록, 가중치들의 비율을 결정할 수 있다. (예컨대 제1 타입의 장소 리스트상에서 동일한 제1 타입의 스코어를 가지는 서로 다른 여행 장소들 A와 B가 식 별되는 경우, 여행 장소 A와 여행 장소 B에 대한 제2 타입의 장소 리스트상 제2 타입의 스코어를 식별하고, 여 행 장소 A 및 여행 장소 B를 포함하는 제3 장소리스트상 제3 타입의 스코어를 결정함에 있어, 여행 장소 A 및 여행 장소 B의 제2 타입의 스코어에 적용되는 가중치를 높게, 여행 장소 A 및 여행 장소 B의 제1 타입의 스코어 에 적용되는 가중치를 낮게하는 가중치들의 비율을 결정할 수 있음) 또 다른 예에 의하면, 전자 장치는 제1 장소 리스트상 동일한 제1 타입의 스코어를 가지는 2이상의 여행 장소들에 대한 제3 타입의 스코어를 결정함에 있어, 제1 타입의 스코어의 비중이 작아지도록 상기 가중치들의 비율을 결정하고, 상기 제2 장소 리스트상 동일한 제2 타입의 스코어를 가지는 2이상의 여행 장소들에 대한 제3 타입의 스코어를 결정함에 있어, 제2 타입의 스코어의 비중이 작아지도록 상기 가중치들이 비율을 결정할 수도 있다. 또한, 일 실시 예에 의하면, 전자 장치는 하나의 타입의 장소 리스트상 나타나는 우선 순위 또는 상기 우 선 순위를 결정하는데 사용되는 스코어에 기초하여, 다른 장소 리스트상 우선 순위 또는 상기 다른 장소 리스트 상 우선 순위를 결정하는데 사용되는 스코어를 수정할 수도 있다. 예를 들어, 전자 장치는 제2 타입의 스코어에 기초하여 상기 제2 장소 리스트 상 여행 장소 정보들을 정 렬하기 위한 제2 우선 순위를 결정할 수 있다. 전자 장치는 제1 장소 리스트상에서 나타나는, 상기 제2 장소 리스트상 식별되는 여행 장소들의 제1 타입의 스코어를 식별할 수 있다. (예컨대 제2 장소 리스트상 나타 나는 여행 장소 A와 여행 장소 B를 제1 장소 리스트상에서 검색하고, 제1 장소 리스트상 나타나는 여행 장소 A 와 여행 장소 B에 대한 제1 타입의 스코어를 식별) 전자 장치는 제2 장소 리스트상 식별되는 여행 장소들 이 제1 장소 리스트상에서 가지는 제2 타입의 스코어에 기초하여 제2 우선 순위를 조정할 수 있다. 전자 장치 는 조정된 제2 우선 순위에 기초하여 제2 장소 리스트상 일부의 장소 정보를 포함하는 여행 장소 컨텐츠 를 출력할 수 있다. 또 다른 예에 의하면, 전자 장치는 여행 장소 별 소셜 데이터의 수가 임계 데이터 수보다 작은 것으로 식 별되는 경우에는 제1 우선순위에 기초하여 제2 우선순위를 조정할 수도 있고, 또 다른 예에 의하면, 전자 장치 는 여행 장소 별 POI 변수의 수가 적거나, POI 변수 별 공백 값을 가지는 POI 변수의 공백비율이 임계 비 율 이상으로 식별되는 경우, 제2 우선 순위에 기초하여 제1 우선순위를 조정할 수도 있다. 도 5는 일 실시 예에 따른 전자 장치가 적어도 하나의 여행 장소 추천 모델을 학습시키는 방법을 설명하기 위한 도면이다.일 실시 예에 의하면 전자 장치는 사용자의 여행 성향에 관한 사용자 성향 특징 데이터가 입력되면, 상기 사용자 성향 특징 데이터에 따른 복수의 여행 장소 정보들을 포함하는 여행 장소 컨텐츠가 출력되는 여행 장소 추천 모델을, 상기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계 또는 상기 복수의 여행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터 의 유사도 중 적어도 하나에 기초하여 학습시킬 수 있다. 예를 들어, 전자 장치가 여행 장소 추천 모델을 학습하는 동작은 여행 장소 추천 모델의 입력 및 출력 데 이터를 정의하고, 여행 장수 추천 모델의 파라미터를 설정하는 구축 동작과, 여행 장소 추천 모델을 학습시키는 동작을 포함할 수 있다. 일 실시 예에 의하면, 여행 장소 추천 모델은 적어도 하나의 장소 추천 모델들을 포함 할 수 있다. 예를 들어, 여행 장소 추천 모델은 POI 기반 장소 추천 모델 또는 소셜 감성 데이터 기반 장소 추 천 모델 중 적어도 하나를 포함할 수도 있다. 또한, 도 5에는 도시되지 않았지만, 전자 장치는 여행 장소 추천 모델을 학습시키는 단계에 앞서, 여행 상황 별 행동유형과 상기 사용자 여행 성향 변수들 사이의 상관 관계에 기초하여, 사용자로부터 획득되는 상기 여행 상황 별 행동 유형을 나타내는 응답 데이터가 입력되면, 상기 응답 데이터에 대응되는 성향 특징 데이터가 출력되도록 사용자 여행 성향 분석 인공지능 모델을 학습시키는 단계 및 여행 장소들 별 소셜 컨텐츠에 포함된 텍스트를 포함하는 소셜 데이터가 입력되면, 상기 소셜 데이터에 포함된 형태소 키워드들을 분류하는 여행 특화 사전 데이터에 기초하여, 상기 소셜 데이터에 대응되는 감성 특징 데이터를 출력하는 여행 감성 분석 인공지능 모델을 학습시키는 단계를 먼저 수행할 수도 있다. 도 6은 일 실시 예에 따른 전자 장치가 적어도 하나의 여행 장소 추천 모델을 학습시키는 구체적인 방법을 나타 내는 흐름도이다. S610에서, 전자 장치는 성향 특징 데이터를 식별하는 단계에 앞서, 사용자 여행 성향에 관한 사용자 여행 성향 변수들과 여행 장소들 별로 미리 설정된 POI 변수들의 상관 관계에 기초하여, 상기 사용자 성향 특징 데이 터가 입력되면, 상기 제1 타입의 스코어에 기초하여 결정된 제1 우선순위에 따른 상기 제1 장소 리스트를 출력 하도록 POI 기반 장소 추천 모델을 학습시킬 수 있다. 제1 장소 리스트는 제1 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함할 수 있다. 예를 들어, 사용자 여행 성향 변수들과 여행 장소들 별 POI 변수들의 상관 관계는 사용자 여행 성향 변수들 별 미리 설정된 POI 조건 값에 따른 수치로 결정될 수 있다. 예를 들어, 전자 장치는 시각중시형 사용자 여행 성향 변수가 있다면 시각 중시형 사용자 여행 성향 변수 들에 대해서는 POI 변수들 중, 운영 시간(TIME) POI 변수와의 상관 관계를 높게 매칭하여야 한다거나 또는, 해 당 시각 중시형 사용자 여행 성향 변수들의 경우 카운팅하여야하는 POI 변수들의 목록 정보를 POI 조건 값으로 미리 설정할 수 있다. (예컨대 여행 장소별 POI 변수들 중, 시각 중시형 사용자 여행 성향 변수에 대해 카운팅 하여야 하는 POI 변수들의 목록 정보에 기초하여, 운영 시간 POI 변수, 위치 정보 POI 변수, 휴무일 POI 변수를 카운팅할 수 있음) 전자 장치는, 미리 설정된 POI 조건 값에 기초하여 복수의 여행 장소들에 대해, 특정 사용자 여행 성향 변수에 관련되는 POI 변수들의 수를 식별할 수 있다. 일 실시 예에 의하면 전자 장치는 사용자 여행 성향 변수들 별 POI 조건 값에 기초하여, 사용자 여행 성향 변수들 별 관련되는 POI 변수들의 수가 많을수록 POI 변수들과 해당 사용자 여행 성향 변수들의 상관 관계를 높게 결정할 수 있다. S610단계에서 학습 된 POI 기반 장소 추천 모델은 특정 사용자 여행 성향 변수들과 상관 관계가 높은 POI 변수들이 많은 여행 장소 들의 우선 순위를 높게 결정(예컨대 제1 타입의 스코어를 높게 매칭)하고, 특정 사용자 여행 성향 변수들과 상 관 관계가 높은 여행 장소들의 랭크가 높게 정렬된 제1 타입의 장소 리스트를 출력하게 된다. S620에서, 전자 장치는 상기 손실 함수의 출력 값에 기초하여, 상기 사용자 성향 특징 데이터가 입력되면, 상기 제2 타입의 스코어에 기초하여 결정된 제2 우선순위에 따른 상기 제2 장소 리스트를 출력하는 소셜 감성 데이터 기반 장소 추천 모델을 학습시킬 수 있다. 예를 들어, 전자 장치는 복수의 여행 장소들 별 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터의 차이 값과, 상기 복수의 여행 장소들 별 후기 태그 데이터에 따라 결정된 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터의 차이 값을 최소화하는 손실 함수의 출력 값에 기초하여, 상기 사용자 여행 성향 특징 데이터가 입력되면 제2 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함하는 제1 장소 리스트를 출력하는, 소셜 감성 데이터 기반 장소 추천 모델을 학습시킬 수 있다. 도 6에 도시된 전자 장치가 적어도 하나의 장소 추천 모 델을 학습시키는 동작은 적어도 하나의 장소 추천 모델의 입력 및 출력을 정의하는 모델 구축 동작을 포함할 수 있다. 또한, 도 6에는 도시되지 않았지만, 전자 장치는 적어도 하나의 장소 추천 모델을 학습시키는 동작에 앞 서, 또는 여행 장소 추천 모델을 학습시키는 동작에 앞서 전자 장치와 연결된 서버로부터 복수의 여행 장소들 별로 미리 설정된 POI 변수들을 획득할 수 있다. 일 실시 예에 의하면 POI(Place of Interest) 변수들은 여행 장소들의 명칭, 위치 정보, 주소 정보, 상기 여행 장소들과 관련된 전화 번호 정보, 상기 여행 장소들의 운영 시간, 휴무일, 상기 여행 장소들에 대한 후기 태그 정보, 상기 여행 장소들 별 전체 후기의 수, 상기 여행 장소 들에 사용자 평균 체류 시간, 상기 여행 장소들에 대한 방문자 수, 상기 여행 장소들에 대한 사업자 정보 또는 상기 여행 장소들과 관련된 비용 정보 중 적어도 하나를 포함할 수 있다. 또한, 전자 장치는 사용자 여행 성향 변수들 별 POI 조건 정보에 기초하여 획득된 POI 변수들 중 일부의 POI 변수들을 추출할 수 있다. 전자 장치는 추출된 POI 변수들 및 사용자 여행 성향 변수들의 상관 관계 를 결정하고, 상기 결정된 상관 관계에 기초하여 POI 기반 장소 추천 모델을 학습시킬 수도 있다. 또한 도 6에는 도시되지 않았지만 전자 장치는 상기 전자 장치와 연결된 서버로부터 복수의 여행 장소들 별 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데이터를 획득하고, 서버로부터 상기 POI 변수들 중, 상기 여행 장소들 별 후기 태그 데이터에 따라 결정되는 장소 여행 성향 특징 데이터를 획득할 수 있다. 전자 장치는 서버로부터 두가지 타입의 장소 여행 성향 특징 데이터가 획득되면, 감성 특징 데이터에 따 라 결정된 장소 여행 성향 특징 데이터와 상기 사용자 여행 성향 특징 데이터의 차이 값과, 상기 후기 태그 데 이터에 따라 결정된 장소 여행 성향 특징 데이터와 상기 사용자 여행 성향 특징 데이터의 차이 값이 최소화되도 록 하는 손실 함수를 결정할 수 있다. 전자 장치는 손실 함수의 출력 값에 기초하여 소셜 감성 데이터 기 반 장소 추천 모델을 학습시킬 수 있다. 도 7은 일 실시 예에 따른 전자 장치가 사용자 여행 성향에 맞는 여행 장소 컨텐츠를 제공하기 위해 사용자의 여행 성향을 식별하는 과정을 나타내는 흐름도이다. 도 7을 참조하면, 전자 장치가 전자 장치에 대한 사용자 입력에 기초하여 응답 데이터를 획득하고, 획득된 응답 데이터를 사용자 여행 성향 분석 인공지능 모델에 입력함으로써, 사용자 여행 성향 분석 인공 지능 모델로부터 성향 특징 데이터를 식별하는 과정과, 사용자 성향 특징 데이터 및 장소 여행 성향 특징 데이터를 결정하는데 사용되는 사용자 여행 성향 변수들의 종류가 도시된다. 일 실시 예에 의하면 사용자 여행 성향 분석 인공지능 모델은 STTI 네트워크 또는 클러스터 식별 네 트워크 중 적어도 하나를 포함할 수 있다. 일 실시 예에 의하면 응답 데이터는 사용자 여행 성향을 식별하기 위한 복수의 질의들에 대한 응답들과, 상기 응답을 고유하게 식별하는 응답 식별 정보 및 응답 데이터를 제공하는 사용자의 성별, 나이, 전화번호와 같은 사용자 정보를 포함할 수 있다. 일 실시 예에 의하면, 사용자 성향 특징 데이터는 사용자 여행 성향 특징 정보와 사용자 여행 성향 클러스터 라벨 정보를 포함할 수 있다. 예를 들어, 사용자 여행 성향 특징 정보는 세부 여행 성향 변 수들 별 특징 값을 포함하는 세부 여행 성향 특징 정보와, 종합 여행 성향 변수들 별 특징 값을 포함하는 종합 여행 성향 특징 정보를 포함할 수 있다. 일 실시 예에 의하면, 사용자 여행 성향 클러스터 라벨 정보는 종 합 여행 성향 변수들에 기초하여 정의되는 다차원 공간상에서 배치되는, 종합 여행 성향에 관한 종합 여행 성향 클러스터들 중, 하나의 클러스터를 식별하는 종합 여행 성향 클러스터 라벨 정보와, 특이 세부 여행 성향 변수 들에 기초하여 정의되는 다차원 공간상에서 배치되는, 세부 여행 성향에 관한 세부 여행 성향 클러스터들 중, 하나의 클러스터를 식별하는 특이 세부 여행 성향 클러스터 라벨 정보를 포함할 수 있다. 일 실시 예에 의하면, 세부 여행 성향 클러스터들은 종합 여행 성향 클러스터 별로 생성될 수 있다. 일 실시 예에 의하면 STTI 네트워크 모델은 응답 데이터가 입력되면, 여행 성향 변수들 중, 세부 여행 성 향 변수들(V11~Vnn) 별 특징 값을 포함하는 세부 여행 성향 특징 정보를 출력하는, 세부 여행 성향 변수 수 치 연산 네트워크와, 여행 성향 변수들 중, 일부 세부 여행 성향 변수들을 대표하는 종합 여행 성향 변수 들(G1,G2,G3,G4,G5,G6) 별 특징 값을 포함하는 종합 여행 성향 특징 정보를 출력하는, 종합 여행 성향 변수 수치 연산 네트워크를 포함할 수 있다. 일 실시 예에 의하면, STTI 네트워크 모델은 응답 데이터들이 입력되면, 사용자의 여행 성향 변수들 중, 세부 여행 성향 변수들 별 특징 값을 포함하는 학습용 세부 여행 성 향 특징 정보들과, 상기 세부 여행 성향 변수들 중, 일부 세부 여행 성향 변수들을 대표하는 종합 여행 성향 변 수들 별 특징 값을 포함하는 학습용 종합 여행 성향 특징 정보들을 출력하는, 신경망 기반 수치 연산 네트워크 들을 포함할 수 있다. 일 실시 예에 의하면, 클러스터 식별 네트워크는 종합 여행 성향 클러스터 식별 네트워크 및 특이 세 부 여행성향 클러스터 식별 네트워크를 포함할 수 있다. 또 다른 예에 의하면, 클러스터 식별 네트워크 는 종합 여행 성향 변수들에 기초하여 정의되는 다차원 공간상에서 배치되는, 상기 종합 여행 성향에 관한 종합 여행 성향 클러스터들 중, 사용자 여행 성향 분석 인공지능 모델로 입력된 응답 데이터에 따른 사용자 여 행 성향 특징 정보가 속하는 하나의 클러스터를 식별하는 종합 여행 성향 클러스터 라벨 정보와, 상기 종 합 여행 성향 클러스터들 별로 생성되며, 상기 특이 세부 여행 성향 변수들에 기초하여 정의되는 다차원 공간상 에서 상기 세부 여행 성향에 관한 세부 여행 성향 클러스터들 중, 응답 데이터에 따른 사용자 여행 성향 특징 정보가 속하는 하나의 클러스터를 식별하는 특이 세부 여행 성향 클러스터 라벨 정보를 출력하는, 신경망 기반 식별 네트워크들을 포함할 수 있다. 보다 상세하게는, 클러스터 식별 네트워크는 종합 여행 성향 변수들에 기초하여 정의되는 다차원 공간상에 서 배치되는, 상기 종합 여행 성향에 관한 종합 여행 성향 클러스터들 중, 상기 응답 데이터에 따른 사용자 여 행 성향 특징 정보가 속하는 하나의 클러스터를 식별하는 종합 여행 성향 클러스터 라벨 정보와 종합 여행 성향 클러스터들 별로 생성되며, 상기 특이 세부 여행 성향 변수들에 기초하여 정의되는 다차원 공간상에서 배치되는, 상기 세부 여행 성향에 관한 세부 여행 성향 클러스터들 중, 상기 응답 데이터에 따른 사용자 여행 성향 특징 정보가 속하는 하나의 클러스터를 식별하는 특이 세부 여행 성향 클러스터 라벨 정보를 출력하는 신 경망 기반 식별 네트워크들을 포함할 수 있다. 또한, 일 실시 예에 의하면 종합 여행 성향 클러스터들은, 상기 종합 여행 성향 변수들 각각을 기준축으로 포함 하는 다차원 공간상에서, 사용자 여행 성향 특징 정보들을 제1 수준으로 클러스터링함으로써 생성되고, 상기 세 부 여행 성향 클러스터들은, 상기 종합 여행 성향 클러스터들에 해당하는 각 사용자 여행 성향 특징 정보들을, 상기 특이 세부 여행 성향 변수들에 기초하여 정의되는 다차원 공간상에서 제2 수준으로 클러스터링함으로써 생 성될 수 있다. 일 실시 예에 의하면 전자 장치는 응답 데이터가 입력되면 성향 특징 데이터가 출력되도록 사용자 여행 성향 분석 인공지능 모델을 구축하고, 구축된 사용자 여행 성향 분석 인공지능 모델에 응답 데이터 들을 입력함으로써 획득되는 성향 특징 데이터들이 속하는 클러스터들의 경계가 명확해지도록 상기 사용자 여행 성향 분석 인공지능 모델을 수정 및 갱신함으로써 사용자들의 여행 성향을 정확하게 식별할 수 있다. 일 실시 예에 의하면 사용자 여행 성향 분석 인공지능 모델, 후술하는 여행 감성 분석 인공지능 모델, 적 어도 하나의 장소 추천 모델은 CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 일 수 있으나, 이에 한정되는 것은 아니다. 이하에서는 본원 명세서에 기재된 여행 성향 변수들에 대해 구체적으로 설명하기로 한다. 일 실시 예에 의 하면 사용자 여행 성향 변수는 종합 여행 성향 변수들, 세부 여행 성향 변수들 또는 특이 세부 여행 성향 변수들 중 적어도 하나를 포함할 수 있다. 예를 들어, 세부 여행 성향 변수들은 여행 상황 시나리오 데이터를 활용하여 여행에 영향을 줄 수 있는 요인을 브레인스토밍과정으로 정의한 변수들을 포함할 수 있다. 전자 장치가 이용하는 여행 성향 변수들은 시뮬레이션을 통해 상황별 행동 유형과의 상관 관계 가 미리 결정될 수 있다. 종합 여행 성향 변수들은 소정의 세부 여행 성향 변수들을 대표하는 하나 이상의 변수들을 포함할 수 있다. 예를 들어, 종합 여행 성향 변수들(G, 762)은 하나 이상의 세부 여행 성향 변수들(V, 764)을 포함할 수 있고, 세부 여행 성향 변수들은 종합 여행 성향 변수들에 종속 또는 포함될 수 있다. 일 실시 예에 의하면, 전자 장치 는 사용자 여행 성향 분석 인공지능 모델의 출력 값으로, 종합 여행 성향 변수들, 세부 여행 성향 변수들 별 특징 값의 분포 패턴에 기초하여, 분포 패턴이 한쪽에 밀집된 형태를 나타냄으로써 변별력이 없는 이슈가 식 별되거나, 분포 패턴이 모두 균등하거나, 정규분포 양상으로 분포하는 형태를 나타냄으로써 분별 가능한 다양성 이 없는 이슈가 식별되는 경우, 사용자 여행 성향 분석에 사용되는 변수들을 추가 또는 삭제함으로써 변경할 수 있다. 일 실시 예에 의하면, 특이 세부 여행 성향 변수(S, 766)는 세부 여행 성향 변수들 중, 사용자 여행 성향 변별 정도가 임계치 이상으로 식별되는 소정의 세부 여행 성향 변수들을 포함할 수 있다. 일 실시 예에 의하면 특이 세부 여행 성향 변수들은 종합 여행 성향 변수들에 포함된 세부 여행 성향 변수들 중, 사용자 여행 성향 변별 정도가 임계치 이상으로 식별되는 소정의 세부 여행 성향 변수들을 포함할 수 있다. 일 실시 예에 의하면, 특이 세부 여행 성향 변수들은 종합 여행 성향 변수들 별로 적어도 하나 이상 할당될 수 있으나, 이에 한정되는 것은 아니다.본 개시에 따른 전자 장치는 여행 상황 시나리오를 토대로 정의되는 3가지 레벨의 여행 성향 변수들을 정 의하고, 3가지 레벨의 여행 성향 변수들 중, 종합 여행 성향 변수들에 기초하여 다차원 공간상에서 정의되는 종 합 여행 성향 클러스터들과, 상기 종합 여행 성향 클러스터들에 종속되나, 상기 특이 세부 여행 성향 변수들에 기초하여 상기 다차원 공간과 다른 차원의 다차원공간상에서 다시 정의되는 세부 여행 성향 클러스터들을 이용 하여 사용자 여행 성향 특징 정보를 분류함으로써, 비교적 적은 여행 성향 학습을 위한 데이터에도 불구하고 사 용자의 여행 성향을 효과적으로 식별할 수 있다. 도 8은 일 실시 예에 따른 전자 장치가 사용자 여행 성향에 맞는 여행 장소 컨텐츠를 제공하기 위해 이용하는 적어도 하나의 인공지능 모델과 적어도 하나의 장소 추천 모델의 동작을 설명하기 위한 도면이다. 도 8을 참조하면, 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하기 위해 이용하는 인공지능 모델 또 는 적어도 하나의 장소 추천 모델들이 도시된다. 그림 에 도시된 응답 데이터, 사용자 정보, 사 용자 여행 성향 분석 인공지능 모델, 성향 특징 데이터, 사용자 여행 성향 특징 정보 및 사용자 여행 성향 클러스터 라벨 정보에 대한 내용은 도 7에서 상술한 바와 같으므로 생략하기로 한다. 이하에서 는 그림 을 참조하여 전자 장치가 여행 장소들에 대한 소셜 데이터로부터 감성 특징 데이터 및 장소 여행 성향 변수 연결 모델(WORD-V LINKING 모델)을 이용하여 장소 여행 성향 특징 데이터를 획득하는 과정을 구체적으로 설명하기로 한다. 일 실시 예에 의하면, 전자 장치는 여행 장소들에 대한 소셜 컨텐츠로부터 소셜 데이터(소셜 네트워 크 서비스에 게시된 여행 장소가 언급된 게시물로, 여행 감성과 관련된 텍스트, 센텐스, 키워드들 중 적어도 하"}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "나를 포함)를 획득하고, 획득된 소셜 데이터를 전처리(예컨대 문장 요약, 형태소 추출)후 여행 감성 분석 인공 지능 모델에 입력함으로써, 여행 장소 별 소정의 감송 키워드 별 특징 값을 포함하는 감성 특징 데이터 를 식별할 수 있다."}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "일 실시 예에 의하면, 여행 감성 분석 인공지능 모델은 텍스트 랭크 기반 분장 요약 모델, 워드투벡터 모"}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "델 또는 코버트 분류 모델 중 적어도 하나를 포함할 수 있다. 예를 들어, 전자 장치는 문장 요약 모델을 이용 소셜 데이터가 입력되면 소셜 데이터에 포함된 문장들 중, 여행 관련 키워드들 사이의 상관 관계 및 문장"}
{"patent_id": "10-2023-0134056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "의 구조를 분석함으로써, 결정되는 문장들의 랭크에 기초하여 결정된 소정의 문장들을 포함하는 소셜 요약 데이 터를 결정할 수 있다. 전자 장치는 워드투벡터 모델을 이용하여 여행 장소에 관한 복수의 유효 키워드들을 추출하고, 출력된 유효 키워드들 중 일부 유효 키워드들을 사용자 입력에 기초하여 유효 감성 키워드로 결정하며, 결정된 유효 감 성 키워드를 코버트 분류 모델에 입력함으로써, 감성 특징 데이터를 획득할 수 있다. 일 실시 예에 의하면 워드투벡터 모델은 복수의 형태소 키워드들 중 여행 장소 별 입력된 빈도수가 임계 빈도수 이상인 일부의 복수 의 형태소 키워드들을 복수의 유효 키워드들로 획득하는 신경망 기반 수치연산 네트워크들을 포함할 수 있다. 일 실시 예에 의하면, 코버트 분류 모델은 워드투벡터 모델에서 출력된 복수의 유효 감성 키워드들이 입력되면 여행 장소에 관한 감성 특징 데이터를 출력할 수 있다. 예를 들어, 코버트 분류 모델은 상기 입력된 유효 감성 키워드들과 여행 특화 사전 데이터에 포함된 대표 감성 키워드들의 유사도 점수에 기초하여, 상기 대표 감성 키 워드들의 특징 값들을 포함하는 감성 특징 데이터를 출력하는, 신경망 기반 수치 연산 네트워크들을 포함할 수 있다. 일 실시 예에 의하면, 여행 특화 사전 데이터는 워드투벡터 모델로부터 획득된 유효 감성 키워드들과 상기 여행 특화 사전 별로 설정되는 대표 감성 키워드들의 코사인 유사도 점수에 기초하여, 수정 및 갱신될 수 있다. 예를 들어, 워드투벡터 모델로부터 출력된 유효 감성 키워드들 중, 대표 감성 키워드와의 코사인 유사도 점수가 미리 결정된 점수 이상인 유효 감성 키워드는 상기 대표 감성 키워드와 매핑된 파생 감성 키워드로 결점됨으로써, 여 행 특화 사전 데이터가 수정 및 갱신될 수 있다. 또 다른 예에 의하면, 전자 장치는 여행 감성 분석 인공지능 모델에서 출력된 여행 장소들에 대한 감성 특징 데이터를 사용자 여행 성향 변수들 별 특징 값을 가지는 성향 특징 데이터로 변환하기 위해 장소 여 행 성향 변수 연결 모델(WORD V LINKING) 모델에 입력함으로써, 장소 여행 성향 특징 데이터를 획득할 수 있다. 장소 여행 성향 특징 데이터는 여행 장소 별 소셜 데이터상에서 나타나는 키워드들에 기초하여 결정 되는, 사용자 여행 성향 특징 데이터와 매칭가능한 형태의 벡터들일 수 있다. 일 실시 예에 의하면, 장소 여행 성향 변수 연결 모델은 감성 특징 데이터가 입력되면, 감성 특징 데이터에 따른 사용자 여행 성향 변수들 별 특 징 값을 포함하는 장소 여행 성향 특징 데이터가 출력되도록 미리 학습된 신경망 기반 수치연산 네트워크를 포함할 수 있다. 본 개시에 따른 전자 장치는 상술한 서로 다른 2가지 타입의 클러스터드를 이용하여 응답 데이터에 따른 사용자 성향 특징 정보를 분류함으로써 획득되는 성향 특징 데이터를 여행 장소 추천 모델에 입 력하고, 여행 장소 추천 모델로부터 여행 장소 컨텐츠를 획득하게 된다. 본 개시에 따른 여행 장소 추천 모델은 적어도 하나의 장소 추천 모델을 포함할 수 있다. 예를 들어, 상술한 바와 같이, 여행 장소 추천 모델에 포함된 POI 기반 장소 추천 모델은 여행 장소 들 별로 미리 설정되는 POI 변수들과 사용자 여행 성향 변수들의 상관 관계에 기초하여 제1 타입의 장소 리스트 를 추천하는 장소 추천 모델이고, 소셜 감성 데이터 기반 장소 추천 모델은 소셜 데이터상에서 나타나는 키워드들(예컨대 감성 키워드 또는 후기 태그 데이터상 키워드)을 기반으로 제2 타입의 장소 리스트를 추천하는 장소 추천 모델일 수 있다. 보다 상세하게는, 전자 장치는 여행 감성 분석 인공지능 모델과 장소 여행 성향 변수 연결 모델 을 통해 복수의 여행 장소들에 대한 장소 여행 성향 특징 데이터를 획득하고, 복수의 여행 장소들에 대한 후기 태그데이터에 대해서도 동일한 과정을 적용함으로써 장소 여행 성향 특징 데이터를 획득할 수 있다. 전자 장치는 여행 장소들의 소셜 데이터에서 나타나는 키워드들에 기초하여 결정되는 장소 여행 성 향 특징 데이터와, 사용자 여행 성향 분석 인공지능 모델로부터 획득되는 사용자 성향 특징 데이터의 차이 값이 최소화되는 손실 함수를 정의하고, 손실 함수의 출력 값에 기초하여 소셜 감성 데이터 기반 장소 추천 모델 를 구축&학습시킬 수 있다. 전자 장치는 POI 기반 장소 추천 모델과 소셜 감성 데이터 기반 장 소 추천 모델의 출력 값들을, 여행 장소들 별로 상호 보완적으로 이용함으로써, 사용자 성향에 맞는 여행 장소 컨텐츠를 제공할 수 있다. 도 9는 일 실시 예에 따른 전자 장치의 블록도이다. 도 10은 또 다른 실시 예에 따른 전자 장치의 블록도이다. 도 9에 도시된 바와 같이, 일 실시 예에 따른 전자 장치는 프로세서, 네트워크 인터페이스 및 메모리를 포함할 수 있다. 그러나, 도시된 구성 요소가 모두 필수구성요소인 것은 아니다. 도시된 구 성 요소보다 많은 구성 요소에 의해 전자 장치가 구현될 수도 있고, 그 보다 적은 구성 요소에 의해서도 전자 장치는 구현될 수도 있다. 예를 들어, 도 10에 도시된 바와 같이, 전자 장치는 프로세서, 네트워크 인터페이스 및 메모 리외에, 사용자 입력 인터페이스, 출력부, 센싱부, 네트워크 인터페이스, A/V 입력부 및 메모리를 더 포함할 수도 있다. 사용자 입력 인터페이스는, 사용자가 전자 장치를 제어하기 위한 데이터를 입력하는 수단을 의미한 다. 예를 들어, 사용자 입력 인터페이스에는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접 촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 조그 휠, 조그 스위치 등이 있을 수 있으나 이에 한정되는 것은 아니다. 사용자 입력 인터페이스는, 사용자가 시뮬레이션에 대한 응답들을 선택하기 위한 사용자 입력을 획득할 수 있다. 또 다른 예에 의하면, 사용자가 여행 컨텐츠를 선택하기 위한 사용자 입력, 주문 결제 서비스를 진행 하기 위한 사용자 입력을 획득할 수 있다. 출력부는, 오디오 신호 또는 비디오 신호 또는 진동 신호를 출 력할 수 있으며, 출력부는 디스플레이부, 음향 출력부, 및 진동 모터를 포함할 수 있 다. 디스플레이부는 전자 장치에서 처리되는 정보를 표시 출력하기 위한 화면을 포함한다. 또한, 화면 은 전자 장치가 결정한 사용자 여행 성향, 사용자 여행 성향을 기초로 생성되는 여행 성향 컨텐츠, 사용 자 여행 성향에 맞는 여행 장소 컨텐츠에 대한 정보들을 출력할 수 있다. 음향 출력부는 네트워크 인터페 이스로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력한다. 또한, 음향 출력부는 전 자 장치에서 수행되는 기능(예를 들어, 호신호 수신음, 메시지 수신음, 알림음)과 관련된 음향 신호를 출 력한다. 프로세서는 통상적으로 전자 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 메 모리에 저장된 프로그램들을 실행함으로써, 사용자 입력 인터페이스, 출력부, 센싱부, 네트워크 인터페이스, A/V 입력부 등을 전반적으로 제어할 수 있다. 또한, 프로세서는 메모리에 저장된 프로그램들을 실행함으로써, 도 1 내지 도 8에 기재된 전자 장치의 기능을 수행할 수 있다. 일 실시 예에 의하면, 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 사 용자의 여행 성향에 관한 사용자 성향 특징 데이터를 식별하고, 상기 사용자 성향 특징 데이터가 입력되면, 상 기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계 또는 상기 복수의 여행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터 중 적어도 하나 에 기초하여 여행 장소 정보들을 포함하는 여행 장소 컨텐츠를 출력할 수 있다. 일 실시 예에 의하면, 적어도 하나의 프로세서는 사용자의 여행 성향에 관한 사용자 성향 특징 데이터가 입력되면, 상기 사용자 성향 특징 데이터에 따른 복수의 여행 장소 정보들을 포함하는 여행 장소 컨텐츠가 출력 되는 여행 장소 추천 모델을, 상기 사용자 성향 특징 데이터와 복수의 여행 장소들의 POI 변수들의 상관 관계 또는 상기 복수의 여행 장소들 별 소셜 데이터에 기초하여 결정되는 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터의 유사도 중 적어도 하나에 기초하여 학습시킬 수 있다. 일 실시 예에 의하면, 적어도 하나의 프로세서는 복수의 여행 장소들 별로 미리 설정된 POI 변수들 별 조 건 정보에 따른 상기 사용자의 여행 성향에 관한 사용자 여행 성향 변수들과의 상관 관계에 기초하여, 상기 사 용자의 여행 성향에 관한 사용자 성향 특징 데이터가 입력되면, 제1 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함하는 제1 장소 리스트를 출력하는, POI 기반 장소 추천 모델을 학습시키고, 복수의 여행 장소들 별 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터의 차이 값과, 상기 복수의 여행 장소들 별 후기 태그 데이터에 따라 결정된 장소 여행 성향 특징 데이터와 상기 사용자 성향 특징 데이터의 차이 값을 최소화하는 손실 함수의 출력 값에 기초하여, 상기 사용자 여행 성향 특징 데이터가 입력되면 제2 타입의 스코어가 매칭된 복수의 여행 장소 정보들을 포함하는 제1 장소 리스트를 출력하는, 소셜 감성 데이터 기반 장소 추천 모델을 학습시킬 수 있다. 또한, 일 실시 예에 의하면, 적어도 하나의 프로세서는 상기 전자 장치와 연결된 서버로부터 상기 복수의 여행 장소들 별로 미리 설정된 POI 변수들을 획득하고, 상기 사용자 여행 성향 변수들 별 POI 조건 정보에 기초 하여 상기 획득된 POI 변수들 중 일부의 POI 변수들을 추출하고, 상기 추출된 POI 변수들 및 상기 사용자 여행 성향 변수들의 상관 관계를 결정하고, 상기 상관 관계에 기초하여 상기 POI 기반 장소 추천 모델을 학습시킬 수 있다. 일 실시 예에 의하면, 적어도 하나의 프로세서는 상기 전자 장치와 연결된 서버로부터 복수의 여행 장소 들 별 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데이터를 획득하고, 상기 서버로부터 상기 POI 변 수들 중, 상기 여행 장소들 별 후기 태그 데이터에 따라 결정되는 장소 여행 성향 특징 데이터를 획득하고, 상 기 감성 특징 데이터에 따라 결정된 장소 여행 성향 특징 데이터와 상기 사용자 여행 성향 특징 데이터의 차이 값과, 상기 후기 태그 데이터에 따라 결정된 장소 여행 성향 특징 데이터와 상기 사용자 여행 성향 특징 데이터 의 차이 값이 최소화되도록 하는 손실 함수를 결정하고, 상기 손실 함수의 출력 값에 기초하여 상기 소셜 감성 데이터 기반 장소 추천 모델을 학습시킬 수 있다. 일 실시 예에 의하면 적어도 하나의 프로세서는 상기 여행 장소 추천 모델을 학습시키기 전에, 여행 상황 별 행동유형과 상기 사용자 여행 성향 변수들 사이의 상관 관계에 기초하여, 사용자로부터 획득되는 상기 여행 상황 별 행동 유형을 나타내는 응답 데이터가 입력되면, 상기 응답 데이터에 대응되는 성향 특징 데 이터가 출력되도록 사용자 여행 성향 분석 인공지능 모델을 학습시키고, 여행 장소들 별 소셜 컨텐츠에 포함된 텍스트를 포함하는 소셜 데이터가 입력되면, 상기 소셜 데이터에 포함된 형태소 키워드들을 분류하는 여행 특화 사전 데이터에 기초하여, 상기 소셜 데이터에 대응되는 감성 특징 데이터를 출력하는 여행 감성 분석 인공지능 모델을 학습시킬 수 있다. 센싱부는, 전자 장치의 상태 또는 전자 장치 주변의 상태를 감지하고, 감지된 정보를 프로세 서로 전달할 수 있다. 센싱부는 전자 장치의 사양 정보, 모니터링 대상 공간에 대한 온도, 습도, 기압 정보 등을 센싱할 수 있다. 예를 들어, 센싱부는, 지자기 센서(Magnetic sensor), 가속도 센서(Acceleration sensor), 온/습도 센서, 적외선 센서, 자이로스코프 센서, 위치 센서(예컨대, GPS), 기압 센서 , 근접 센서, 및 RGB 센서(illuminance sensor) 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 각 센서들의 기능은 그 명칭으로부터 당업자가 직관적으로 추론할 수 있으므로, 구체적인 설명은 생략하기로 한다. 네트워크 인터페이스는 전자 장치가 다른 장치(미도시) 및 서버와 통신을 하게 하는 하나 이 상의 구성요소를 포함할 수 있다. 다른 장치(미도시)는 전자 장치와 같은 컴퓨팅 장치이거나, 센싱 장치 일 수 있으나, 이에 제한되지 않는다. 예를 들어, 네트워크 인터페이스는, 무선 통신 인터페이스 , 유선 통신 인터페이스 , 이동 통신부를 포함할 수 있다. 무선 통신 인터페이스는 근거리 통 신부(short-range wireless communication unit), 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거 리 무선 통신부(Near Field Communication unit), WLAN(와이파이) 통신부, 지그비(Zigbee) 통신부, 적외선 (IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(ultra wideband) 통신부 등을 포 함할 수 있으나, 이에 한정되는 것은 아니다. 유선 통신 인터페이스는 유선 통신을 통해 전자 장치와 연결된 외부 디바이스와 데이터를 주고받기 위한 적어도 하나의 유선 인터페이스를 포함할 수 있다. 이동 통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 여기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신 호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태의 데이터를 포함할 수 있다. A/V(Audio/Video) 입력부는 오디오 신호 또는 비디오 신호 입력을 위한 것으로, 이에는 카메라와 마이크로폰 등이 포함될 수 있다. 카메라는 화상 통화모드 또는 촬영 모드에서 이미지 센서를 통해 정지영상 또는 동영상 등의 화상 프레임을 얻을 수 있다. 이미지 센서를 통해 캡쳐된 이미지는 프로세서 또는 별도의 이미지 처리부(미도시)를 통해 처리될 수 있다. 마이크로폰은, 외부의 음향 신호를 입력 받아 전기적인 음성 데이터로 처리한다. 예를 들어, 마이크로폰 은 외부 디바이스 또는 사용자로부터 음향 신호를 수신할 수 있다. 마이크로폰은 사용자의 음성 입 력을 수신할 수 있다. 마이크로폰은 외부의 음향 신호를 입력 받는 과정에서 발생되는 잡음(noise)을 제 거하기 위한 다양한 잡음 제거 알고리즘을 이용할 수 있다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 전자 장치로 입력되 거나 전자 장치로부터 출력되는 데이터를 저장할 수도 있다. 또한, 메모리는 전자 장치가 이용하는 사용자 여행성향 분석 인공지능 모델, 언어 모델, 신경망 기반 모델, STTI 네트워크 모델, 여행 감성 분석 인공지능 모델, 여행 특화 사전 데이터, 장소 여행 성향 변수 연결 모델, 클러스터 식별 네트워크, TRIFIT 네트워크 모델, TRI-PIN 네트워크 모델에 대한 정보를 저장할 수 있다. 예를 들어, 메모리는 적어도 하나의 신경망 모델 내 레이어들, 노드들, 상기 레이어들의 연결 강도에 관 한 가중치 값들을 저장할 수 있다. 또한, 전자 장치는 신경망 모델을 학습하기 위해 전자 장치가 생성한 학습 데이터를 더 저장할 수도 있다. 또한, 메모리는 전자 장치와 연결된 카메라들 또는 서버의 동작 환경에 대한 정보들을 더 저장할 수도 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 메모리에 저장된 프로그램들은 그 기능에 따라 복수 개의 모듈들로 분류할 수 있는데, 예를 들어, UI 모 듈, 터치 스크린 모듈, 알림 모듈 등으로 분류될 수 있다. UI 모듈은, 전자 장치가 여행 성향 분석, 여행 장소 특징 및 여행 장소 컨텐츠 제공을 위한 UI, GUI 등을 제공할 수 있다. 터치 스크린 모듈은 사용자의 터치 스크린 상의 터치 제스처를 감지하고, 터치 제스처에 관한 정보를 프로세서로 전달할 수 있다. 일부 실시예에 따른 터치 스크린 모듈은 터치 코드를 인식하고 분석할 수 있다. 터치 스크린 모듈은 컨트롤러를 포함하는 별도의 하드웨어로 구성될 수 도 있다. 알림 모듈은 전자 장치의 이벤트 발생을 알리기 위한 신호를 발생할 수 있다. 예를 들어, 전자 장 치가 제공한 여행 컨텐츠에 대한 사용자 피드백이 획득되거나, 여행 성향에 대한 알림 컨텐츠가 제공될 때 이에 따른 알림음을 제공할 수 있다. 일 실시 예에 따른 이벤트의 예로는 호 신호 수신, 메시지 수신, 키 신 호 입력, 일정 알림 등이 있다. 알림 모듈은 디스플레이부를 통해 비디오 신호 형태로 알림 신호를 출력할 수도 있고, 음향 출력부를 통해 오디오 신호 형태로 알림 신호를 출력할 수도 있고, 진동 모터를 통해 진동 신호 형태로 알림 신호를 출력할 수도 있다. 도 11은 일 실시 예에 따른 서버의 블록도이다. 일 실시 예에 의하면, 서버는 네트워크 인터페이스, 데이터 베이스 및 프로세서를 포 함할 수 있다. 도 11에 도시된 서버의 구성은 도 9 내지 도 10에 기재된 전자 장치의 구성에 대응 될 수 있다. 네트워크 인터페이스는 상술한 전자 장치의 네트워크 인터페이스(미도시)에 대응될 수 있다. 예를 들어, 네트워크 인터페이스는 전자 장치로부터 응답 데이터, 응답 식별 정보, 사용자 정보를 획득하고, 여행 성향 특징 데이터, 사용자 여행 성향 특징 데이터, 사용자 여행 성향 특징 정보, 사용자 여행 성향 클러스터 라벨 정보, 장소 여행 성향 컨텐츠, 제1 장소 리스트, 제2 장소 리스트, 제3 장소 리스트, 여행 성향 컨텐츠 또는 여행 장소 컨텐츠 중 적어도 하나 전자 장치로 전송할 수 있다. 또 다른 실시 예에 의하면, 네트워크 인터페이스는 전자 장치가 학습한 인공지능 모델, 적어도 하나의 장 소 추천 모델에 대한 정보, 또는 신경망 모델에 대한 정보(예컨대 레이어들 및 레이어들 사이의 연결 강도에 관 한 가중치 값)를 수신할 수 있다. 또 다른 실시 예에 의하면, 네트워크 인터페이스는 서버가 학습시킨 사 용자 여행 성향 분석 인공지능 모델에 대한 정보, 여행 감성 분석 인공지능 모델에 대한 정보, 장소 여행 성향 변수 연결 모델에 대한 정보, 적어도 하나의 장소 추천 모델을 포함하는 여행 장소 추천 모델에 대한 정보(예컨 대 모델의 입출력 값 정보, 인공 신경망의 레이어들 및 레이어들에 포함된 노드에 관한 정보 또는 신경망 내 레 이어들의 연결 강도에 관한 가중치 값들)를 전자 장치로 전송할 수도 있다. 또한, 일 실시 예에 의하면 데이터 베이스는 도 9 내지 도 10에서 상술한 메모리에 대응될 수 있다. 예를 들어, 데이터 베이스는 전자 장치로부터 획득되는 응답 데이터, 사용자 정보, 여행 경험 데이터들, 여행 성향 컨텐츠들, 여행 장소 특징 데이터들, 여행자 성향 특징 데이터들, 여행 장소 별 감성 특징 데이터들, 여행 장소별 장소 여행 성향 특징 데이터들, 적어도 하나의 장소 추천 모델에 대한 정보 등을 저장할 수 도 있 다. 일 실시 예에 의하면, 프로세서는 서버의 전반적인 동작을 제어할 수 있다. 예를 들어, 프로세서 는 네트워크 인터페이스 및 데이터 베이스를 제어함으로써, 도 1 내지 10에서 기재된 전자 장치가 수행하는 사용자에게 여행 장소 컨텐츠를 제공하는 방법 중 적어도 일부 또는 전부를 수행할 수 있다. 도 12는 일 실시 예에 따른 전자 장치 및 서버가 연동함으로써 여행 장소 컨텐츠를 제공하는 방법을 수행하는 과정을 설명하기 위한 도면이다. S1202에서, 전자 장치는 응답 데이터 및 사용자 정보를 획득할 수 있다. S1204에서, 전자 장치는 응답 데이터 및 사용자 정보를 서버로 전송할 수 있다. S1206에서, 서버는 전자 장치로부터 획득된 응답 데이터를 사용자 여행 성향 분석 인공지능 모델에 입력함으로써 사용자 성향 특징 데이터를 식별할 수 있 다. S1208에서, 서버는 사용자 성향 특징 데이터를 전자 장치로 전송할 수 있다. S1210에서, 전자 장치는 사용자 성향 특징 데이터에 기초하여 사용자 여행 성향 컨텐츠를 생성할 수 있다. S1212에서, 전 자 장치는 사용자 여행 성향 컨텐츠를 출력할 수 있다. S1214에서, 서버는 사용자 성향 특징 데이터를 여행 장소 추천 모델에 입력함으로써 여행 장소 컨텐츠를 획득할 수 있다. S1216에서, 서버는 여행 장소 컨텐츠를 전자 장치로 전송할 수 있다. S1218에서, 전자 장치는 서버에서 획득된 여행 장소 컨텐츠를 출력할 수 있다. S1220에서, 전자 장치는 출력한 여행 장소 컨텐츠들에 대한 사용자 피드백 정보를 획득할 수 있다. S1224에서, 전자 장치는 사용자 피드 백 정보를 서버로 전송할 수 있다. S1226에서, 서버는 사용자 피드백 정보에 기초하여 여행 장소 추천 모델을 수정 및 갱신할 수 있다. 도 12에서 기재된 방법들을 수행하는 주체는 도 12에 기재된 바에 한정되지 않으며, 서버 또는 전자 장치 중 적어도 하나에 의해 수행될 수 있음은 물론이다. 본 개시에 따른 사용자에게 여행 장소 컨텐츠를 제공하는 방법, 사용자에게 여행 장소 컨텐츠를 제공하기 위한 적어도 하나의 장소 추천 모델을 학습시키는 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명 령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령 은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical dis k)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명 령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속한다."}
{"patent_id": "10-2023-0134056", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 과정을 개략적으로 나타내는 도면이다. 도 2는 또 다른 실시 예에 따른 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 과정을 설명하기 위한 도 면이다. 도 3은 일 실시 예에 따른 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 방법의 흐름도이다. 도 4는 일 실시 예에 따른 전자 장치가 사용자에게 여행 장소 컨텐츠를 제공하는 구체적인 방법의 흐름도이다. 도 5는 일 실시 예에 따른 전자 장치가 적어도 하나의 여행 장소 추천 모델을 학습시키는 방법을 설명하기 위한 도면이다. 도 6은 일 실시 예에 따른 전자 장치가 적어도 하나의 여행 장소 추천 모델을 학습시키는 구체적인 방법을 나타 내는 흐름도이다. 도 7은 일 실시 예에 따른 전자 장치가 사용자 여행 성향에 맞는 여행 장소 컨텐츠를 제공하기 위해 사용자의 여행 성향을 식별하는 과정을 나타내는 흐름도이다. 도 8은 일 실시 예에 따른 전자 장치가 사용자 여행 성향에 맞는 여행 장소 컨텐츠를 제공하기 위해 이용하는 적어도 하나의 인공지능 모델과 적어도 하나의 장소 추천 모델의 동작을 설명하기 위한 도면이다. 도 9는 일 실시 예에 따른 전자 장치의 블록도이다. 도 10은 또 다른 실시 예에 따른 전자 장치의 블록도이다. 도 11은 일 실시 예에 따른 서버의 블록도이다. 도 12는 일 실시 예에 따른 전자 장치 및 서버가 연동함으로써 여행 장소 컨텐츠를 제공하는 방법을 수행하는 과정을 설명하기 위한 도면이다."}
