{"patent_id": "10-2022-0044026", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0083975", "출원번호": "10-2022-0044026", "발명의 명칭": "유소년 골연령 기반 운동 프로그램 관리 시스템 및 이의 제어 방법", "출원인": "숭실대학교산학협력단", "발명자": "김동호"}}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "피검사자의 생물학적인 골격 연령에 관한 정보인 골연령 정보 및 상기 피검사자의 연령 정보를 입력받도록 구성되는 피검사자 정보 입력부;상기 골연령 정보를 기초로 상기 피검사자의 발육발달 단계를 결정하도록 구성되는 발육발달 단계 결정부; 및상기 연령 정보 및 상기 발육발달 단계를 기초로 상기 피검사자에게 추천할 운동 프로그램을 결정하도록 구성되는 운동 프로그램 결정부를 포함하고,상기 운동 프로그램은,운동 종류 정보 및 운동 강도 정보를 포함하는, 유소년 골연령 기반 운동 프로그램 관리 시스템."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 운동 프로그램 결정부는,상기 연령 정보 및 상기 발육발달 단계를 기초로 인공지능 모델을 이용하여 상기 운동 종류 정보 및 상기 운동강도 정보를 결정하도록 구성되는, 유소년 골연령 기반 운동 프로그램 관리 시스템."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 피검사자 정보 입력부는:복수의 학습용 피검사자들의 학습용 골연령 정보 및 학습용 연령 정보를 입력받고;상기 복수의 학습용 피검사자가 추천받은 운동 프로그램의 정보를 입력받고; 그리고운동 프로그램 성과 정보를 입력받도록 구성되고,상기 운동 프로그램 성과 정보는,상기 추천받은 운동 프로그램을 상기 복수의 학습용 피검사자들이 수행한 이후의 상기 복수의 학습용 피검사자들의 체격 정보 및 체력평가 정보를 포함하는 운동 프로그램 성과정보인, 유소년 골연령 기반 운동 프로그램 관리 시스템."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 학습용 골연령 정보, 상기 학습용 연령 정보, 상기 운동 프로그램 성과 정보를 입력 변수로 설정하고, 상기 추천받은 운동 프로그램의 정보를 출력 변수로 설정하여 상기 인공지능 모델을 학습하도록 구성되는 기계학습부를 더 포함하는, 유소년 골연령 기반 운동 프로그램 관리 시스템."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 운동 프로그램 결정부는:상기 연령 정보와 상기 골연령 정보를 비교해서 상기 피검사자의 골격성숙도를 결정하고; 그리고상기 연령 정보 및 상기 골격성숙도를 기초로 상기 운동 프로그램을 결정하도록 구성되는, 유소년 골연령 기반공개특허 10-2023-0083975-3-운동 프로그램 관리 시스템."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 운동 프로그램 결정부는:상기 연령 정보가 상기 골연령 정보 미만이면, 상기 골격성숙도를 조숙 상태로 결정하고;상기 연령 정보가 상기 골연령 정보와 동일하면, 상기 골격성숙도를 보통 상태로 결정하고; 그리고상기 연령 정보가 상기 골연령 정보를 초과하면, 상기 골격성숙도를 미숙 상태로 결정하도록 구성되는, 유소년골연령 기반 운동 프로그램 관리 시스템."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 운동 프로그램 결정부는:상기 연령 정보가 동일한 복수의 피검사자에게 서로 동일한 운동 종류가 추천되도록 상기 운동 프로그램을 결정하고;상기 연령 정보가 동일한 복수의 피검사자 중 골격성숙도가 조숙 상태인 피검사자에 대해서는 골격성숙도가 보통 상태인 피검사자보다 높은 운동 강도를 추천하도록 상기 운동 프로그램을 결정하고; 그리고상기 연령 정보가 동일한 복수의 피검사자 중 골격성숙도가 미숙 상태인 피검사자에 대해서는 골격성숙도가 보통 상태인 피검사자보다 낮은 운동 강도를 추천하도록 상기 운동 프로그램을 결정하도록 구성되는, 유소년 골연령 기반 운동 프로그램 관리 시스템."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 피검사자의 관절 위치 정보를 포함하는 X선 촬영 사진 정보 및 상기 피검사자에 대한 초음파 검사 결과 정보 중 적어도 하나를 기초로 상기 피검사자의 골연령 정보를 결정하도록 구성되는 골연령 결정부를 더포함하는, 유소년 골연령 기반 운동 프로그램 관리 시스템."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "운동 프로그램 관리 서버의 동작방법으로서,피검사자 정보 입력부에 의해, 피검사자의 골연령 정보 및 상기 피검사자의 연령 정보를 입력받는 단계;상기 골연령 정보를 기초로 상기 피검사자의 발육발달 단계를 결정하는 단계;상기 연령 정보 및 상기 발육발달 단계를 기초로 상기 피검사자에게 추천할 운동 종류 정보 및 운동 강도 정보를 포함하는 운동 프로그램을 결정하는 단계;복수의 학습용 피검사자의 학습용 골연령 정보 및 학습용 연령 정보, 상기 복수의 학습용 피검사자가 실제로 추천받은 운동 프로그램의 정보 및 운동 프로그램 성과 정보를 입력받는 단계; 및상기 학습용 골연령 정보, 상기 학습용 연령 정보, 상기 운동 프로그램 성과 정보를 입력 변수로 설정하고, 상기 실제로 추천받은 운동 프로그램의 정보를 출력 변수로 설정하여 인공지능 모델을 학습하는 단계를 포함하고,상기 운동 프로그램 성과 정보는,상기 실제로 추천받은 운동 프로그램을 상기 피검사자가 수행한 이후의 상기 학습용 피검사자의 체격 정보 및체력평가 정보를 포함하는 운동 프로그램 성과정보인, 유소년 골연령 기반 운동 프로그램 관리 시스템의 제어방법."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2023-0083975-4-제9항에 있어서,상기 운동 프로그램을 결정하는 단계는:상기 연령 정보 및 상기 발육발달 단계를 기초로 상기 인공지능 모델을 이용하여 상기 운동 종류 정보 및 상기운동 강도 정보를 결정하는 단계;상기 연령 정보와 상기 골연령 정보를 비교해서 상기 피검사자의 골격성숙도를 결정하고, 상기 연령 정보 및 상기 골격성숙도를 기초로 상기 운동 프로그램을 결정하는 단계;상기 연령 정보가 상기 골연령 정보 미만이면, 상기 골격성숙도를 조숙 상태로 결정하고, 상기 연령 정보가 상기 골연령 정보와 동일하면, 상기 골격성숙도를 보통 상태로 결정하고, 상기 연령 정보가 상기 골연령 정보를초과하면, 상기 골격성숙도를 미숙 상태로 결정하는 단계;상기 연령 정보가 동일한 복수의 피검사자에게 서로 동일한 운동 종류가 추천되도록 상기 운동 프로그램을 결정하고, 상기 연령 정보가 동일한 복수의 피검사자 중 골격성숙도가 조숙 상태인 피검사자에 대해서는 골격성숙도가 보통 상태인 피검사자보다 높은 운동 강도를 추천하도록 상기 운동 프로그램을 결정하고, 상기 연령 정보가동일한 복수의 피검사자 중 골격성숙도가 미숙 상태인 피검사자에 대해서는 골격성숙도가 보통 상태인 피검사자보다 낮은 운동 강도를 추천하도록 상기 운동 프로그램을 결정하는 단계를 포함하는, 유소년 골연령 기반 운동프로그램 관리 시스템의 제어 방법."}
{"patent_id": "10-2022-0044026", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항 및 제10항 중 어느 한 항의 유소년 골연령 기반 운동 프로그램 관리 시스템의 제어 방법을 실행시키도록컴퓨터로 판독 가능한 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0044026", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개시된 발명의 일 실시예에 따른 유소년 골연령 기반 운동 프로그램 관리 시스템은, 피검사자의 생물학적인 골격 연령에 관한 정보인 골연령 정보 및 상기 피검사자의 연령 정보를 입력받도록 구성되는 피검사자 정보 입력부; 상기 골연령 정보를 기초로 상기 피검사자의 발육발달 단계를 결정하도록 구성되는 발육발달 단계 결정부; 상기 연령 정보 및 상기 발육발달 단계를 기초로 상기 피검사자에게 추천할 운동 프로그램을 결정하도록 구성되는 운 동 프로그램 결정부를 포함하고, 상기 운동 프로그램은, 운동 종류 정보 및 운동 강도 정보를 포함할 수 있다."}
{"patent_id": "10-2022-0044026", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 유소년의 발육발달 정도에 따라 적절한 운동 프로그램을 추천할 수 있는 운동 프로그램 관리 시스템 및 시스템의 제어 방법에 관한 것이다."}
{"patent_id": "10-2022-0044026", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "유소년 시기는 인간의 발육발달 중 신체적, 심리적 변화가 가장 많이 이루어지는 중요한 시기이며, 만 3세부터 중학교 취학 전까지 어린이로 규정하고 있다. 유소년의 발육발달 속도와 패턴은 모두 다를 뿐 아니라 그에 따른 체력도 개인차가 발생한다. 이에 따라 유소년의 체력 요인을 정확하게 평가하여 체력을 향상시킬 필요성이 제시 되고 있다. 한편, 역연령을 중심으로 이루어지고 있는 현대사회에서는 일반적으로 유소년들에게 역연령에 따른 운동프로그 램을 적용시키고 있다. 이러한 방식의 운동프로그램 적용은 유소년의 생체적인 나이를 고려하지 않았기 때문에 유소년들에게 적절한 운동을 처방하지 못한다는 문제가 있다. 따라서, 단순히 역연령을 중심으로 유소년에게 운동 프로그램을 추천하는 방식이 아니라 실제 발육발달 단계에 맞는 적절한 운동프로그램 코칭이 가능한 시스템이 필요하다."}
{"patent_id": "10-2022-0044026", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 유소년기의 발육발달 단계와 골격성숙도를 이용하여 유소년들에게 적절한 운동프로그램을 추천할 수 있다. 본 발명을 통하여 유소년의 생물학적 성숙지표에 맞는 보다 정확한 체력측정평가 및 운동프로그램을 유 소년들에게 제공할 수 있다. 본 발명을 통하여 통해 유소년의 성장 발육발달에 도움이 될 수 있는 운동 프로그 램 관리 시스템 및 이의 제어 방법을 제공할 수 있다. 또한, 본 발명은 유소년 공공 스포츠 기관 및 사설 스포츠 기관에서 유소년 체력측정에 기초적인 자료에 적용 가능한 유소년의 골연령 기반 운동 프로그램을 생성할 수 있는 유소년 골연령 기반 운동 프로그램 관리 시스템 및 이의 제어 방법을 제공하기 위한 것이다."}
{"patent_id": "10-2022-0044026", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "개시된 발명의 일 측면에 따른 유소년 골연령 기반 운동 프로그램 관리 시스템은, 피검사자의 생물학적인 골격 연령에 관한 정보인 골연령 정보 및 상기 피검사자의 연령 정보를 입력받도록 구성되는 피검사자 정보 입력부; 상기 골연령 정보를 기초로 상기 피검사자의 발육발달 단계를 결정하도록 구성되는 발육발달 단계 결정부; 및 상기 연령 정보 및 상기 발육발달 단계를 기초로 상기 피검사자에게 추천할 운동 프로그램을 결정하도록 구성되 는 운동 프로그램 결정부를 포함하고, 상기 운동 프로그램은, 운동 종류 정보 및 운동 강도 정보를 포함할 수 있다. 또한, 상기 운동 프로그램 결정부는, 상기 연령 정보 및 상기 발육발달 단계를 기초로 인공지능 모델을 이용하 여 상기 운동 종류 정보 및 상기 운동 강도 정보를 결정하도록 구성될 수 있다. 또한, 상기 피검사자 정보 입력부는: 복수의 학습용 피검사자들의 학습용 골연령 정보 및 학습용 연령 정보를 입력받고; 상기 복수의 학습용 피검사자가 추천받은 운동 프로그램의 정보를 입력받고; 그리고 운동 프로그램 성과 정보를 입력받도록 구성되고, 상기 운동 프로그램 성과 정보는, 상기 추천받은 운동 프로그램을 상기 복수 의 학습용 피검사자들이 수행한 이후의 상기 복수의 학습용 피검사자들의 체격 정보 및 체력평가 정보를 포함하 는 운동 프로그램 성과정보일 수 있다. 또한, 상기 학습용 골연령 정보, 상기 학습용 연령 정보, 상기 운동 프로그램 성과 정보를 입력 변수로 설정하 고, 상기 실제로 추천받은 운동 프로그램의 정보를 출력 변수로 설정하여 상기 인공지능 모델을 학습하도록 구 성되는 기계학습부를 더 포함할 수 있다. 또한, 상기 운동 프로그램 결정부는: 상기 연령 정보와 상기 골연령 정보를 비교해서 상기 피검사자의 골격성숙 도를 결정하고; 그리고 상기 연령 정보 및 상기 골격성숙도를 기초로 상기 운동 프로그램을 결정하도록 구성될 수 있다. 또한, 상기 운동 프로그램 결정부는: 상기 연령 정보가 상기 골연령 정보 미만이면, 상기 골격성숙도를 조숙 상 태로 결정하고; 상기 연령 정보가 상기 골연령 정보와 동일하면, 상기 골격성숙도를 보통 상태로 결정하고; 그 리고 상기 연령 정보가 상기 골연령 정보를 초과하면, 상기 골격성숙도를 미숙 상태로 결정하도록 구성될 수 있 다. 또한, 상기 운동 프로그램 결정부는: 상기 연령 정보가 동일한 복수의 피검사자에게 서로 동일한 운동 종류가 추천되도록 상기 운동 프로그램을 결정하고; 상기 연령 정보가 동일한 복수의 피검사자 중 골격성숙도가 조숙 상태인 피검사자에 대해서는 골격성숙도가 보통 상태인 피검사자보다 높은 운동 강도를 추천하도록 상기 운동 프로그램을 결정하고; 그리고 상기 연령 정보가 동일한 복수의 피검사자 중 골격성숙도가 미숙 상태인 피검사자 에 대해서는 골격성숙도가 보통 상태인 피검사자보다 낮은 운동 강도를 추천하도록 상기 운동 프로그램을 결정 하도록 구성될 수 있다. 또한, 상기 피검사자의 관절 위치 정보를 포함하는 X선 촬영 사진 정보 및 상기 피검사자에 대한 초음파 검사 결과 정보 중 적어도 하나를 기초로 상기 피검사자의 골연령 정보를 결정하도록 구성되는 골연령 결정부를 더 포함할 수 있다. 개시된 발명의 일 측면에 따른 유소년 골연령 기반 운동 프로그램 관리 시스템의 제어 방법은, 운동 프로그램 관리 서버의 동작방법으로서, 피검사자 정보 입력부에 의해, 피검사자의 생물학적인 골격 연령에 관한 정보인 골연령 정보 및 상기 피검사자의 연령 정보를 입력받는 단계; 상기 골연령 정보를 기초로 상기 피검사자의 발육 발달 단계를 결정하는 단계; 상기 연령 정보 및 상기 발육발달 단계를 기초로 상기 피검사자에게 추천할 운동 종류 정보 및 운동 강도 정보를 포함하는 운동 프로그램을 결정하는 단계; 복수의 학습용 피검사자의 학습용 골 연령 정보 및 학습용 연령 정보를 입력받고, 상기 복수의 학습용 피검사자가 실제로 추천받은 운동 프로그램의 정보를 입력받고, 운동 프로그램 성과 정보를 입력받는 단계; 및 상기 학습용 골연령 정보, 상기 학습용 연령 정보, 상기 운동 프로그램 성과 정보를 입력 변수로 설정하고, 상기 실제로 추천받은 운동 프로그램의 정보를 출력 변수로 설정하여 인공지능 모델을 학습하는 단계를 포함하고, 상기 운동 프로그램 성과 정보는, 상기 실제 로 추천받은 운동 프로그램을 상기 피검사자가 수행한 이후의 상기 학습용 피검사자의 체격 정보 및 체력평가 정보를 포함하는 운동 프로그램 성과정보일 수 있다. 또한, 상기 운동 프로그램을 결정하는 단계는: 상기 연령 정보 및 상기 발육발달 단계를 기초로 상기 인공지능 모델을 이용하여 상기 운동 종류 정보 및 상기 운동 강도 정보를 결정하는 단계; 상기 연령 정보와 상기 골연령정보를 비교해서 상기 피검사자의 골격성숙도를 결정하고, 상기 연령 정보 및 상기 골격성숙도를 기초로 상기 운동 프로그램을 결정하는 단계; 상기 연령 정보가 상기 골연령 정보 미만이면, 상기 골격성숙도를 조숙 상태로 결정하고, 상기 연령 정보가 상기 골연령 정보와 동일하면, 상기 골격성숙도를 보통 상태로 결정하고, 상기 연 령 정보가 상기 골연령 정보를 초과하면, 상기 골격성숙도를 미숙 상태로 결정하는 단계; 상기 연령 정보가 동 일한 복수의 피검사자에게 서로 동일한 운동 종류가 추천되도록 상기 운동 프로그램을 결정하고, 상기 연령 정 보가 동일한 복수의 피검사자 중 골격성숙도가 조숙 상태인 피검사자에 대해서는 골격성숙도가 보통 상태인 피 검사자보다 높은 운동 강도를 추천하도록 상기 운동 프로그램을 결정하고, 상기 연령 정보가 동일한 복수의 피 검사자 중 골격성숙도가 미숙 상태인 피검사자에 대해서는 골격성숙도가 보통 상태인 피검사자보다 낮은 운동 강도를 추천하도록 상기 운동 프로그램을 결정하는 단계를 포함할 수 있다. 개시된 발명의 일 측면에 따른 컴퓨터 프로그램은, 상기 유소년 골연령 기반 운동 프로그램 관리 시스템의 제어 방법을 실행시키도록 컴퓨터로 판독 가능한 기록매체에 저장될 수 있다."}
{"patent_id": "10-2022-0044026", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 발명의 일 측면에 따르면, 인공지능 기반의 설계 방법을 이용하여 특정 가속기에 최적화된 저전력 고성 능 캐시 구조를 도출할 수 있다. 또한, 본 발명의 실시예에 의하면, 일반적인 캐시 메모리 설계 방법과 달리 자동화 설계 방법을 이용하여 캐시 메모리 설계에 소요되는 시간 및 인적 자원을 감소시킬 수 있다."}
{"patent_id": "10-2022-0044026", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "명세서 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 명세서가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2022-0044026", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 개시된 발명이 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생 략한다. 명세서에서 사용되는 '~부'라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따 라 복수의 '~부'가 하나의 구성요소로 구현되거나, 하나의 '~부'가 복수의 구성요소들을 포함하는 것도 가능하 다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 제1, 제2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전 술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 개시된 발명의 작용 원리 및 실시예들에 대해 설명한다. 도 1은 일 실시예에 따른 유소년 골연령 기반 운동 프로그램 관리 시스템의 구성도이다. 도 1을 참조하면, 본 발명의 실시예에 따른 운동 프로그램 관리 시스템은, 피검사자 정보 입력부, 발 육발달 단계 결정부, 운동 프로그램 결정부, 골연령 결정부, 기계학습부 및 메모리를포함할 수 있다. 운동 프로그램 관리 시스템은 피검사자 정보를 입력 받고, 이를 기초로 추천 운동 프로그램을 출력할 수 있다. 피검사자 정보는 피검사자의 연령(age)에 관련된 정보일 수 있다. 구체적으로, 피검사자 정보는 피검사자의 일 반적인 연령 또는 생물학적 골격 연령인 골연령(bone age)일 수 있다. 운동 프로그램 관리 시스템은 운동 프로그램 관리 서버에 마련되고 사용자 단말과 유무선 통신이 가능할 수 있다. 이때, 피검사자의 골연령 정보 및 연령 정보를 입력받는 것은, 사용자 단말에 입력된 피검사자 정보를 운동 프로그램 관리 서버에 마련된 피검사자 정보 입력부가 운동 프로그램 관리 서버의 통신 모듈을 통해 사용자 단말로부터 정보를 전달받는 방식일 수 있다. 하지만, 운동 프로그램 관리 시스템이 반드시 운동 프로그램 관리 서버에 마련되고, 유무선 통신을 통해 피검사자 정보를 입력받는 방식으로 한정되어야 하는 것은 아니다. 골연령은 신장 증가 및 성적 성숙과 밀접한 관계가 있고 뼈의 길이, 굵기 및 무게 등의 물리적 측정과 골수, 골 단선, 골막 등의 조직학적 검사 등에 의해 결정될 수 있다. 골연령은 인간의 출생부터 성인때까지 가장 좋은 생 물학적 성숙의 지표로 제안되고 있다. 연령 정보는 피검사자의 역연령(chronological age)의 값일 수 있다. 역연령은 달력에 따라서 측정되는 나이로서 해가 바뀌는 순간 1살을 가산하는 방식으로 결정되는 피검사자의 나 이일 수 있다. 피검사자의 성장이나 노화가 정확하게 역연령에 병행하는 것은 아니고, 피검사자에 따라서 그 속 도가 다를 수 있다. 이와 같은 점에서 피검사자 특유의 성장속도를 나타내기 위해서 골연령을 사용하는 것이 바 람직할 수 있으며, 피검사자의 골연령은 역연령과 차이가 있을 수 있다. 도 2는 일 실시예에 따른 연구대상자 중 골연령이 11세, 12세 및 13세인 유소년의 특성을 정리한 표이다. 도 2를 참조하면, 본 발명의 실시예에 따른 피검사자의 실제 연령과 골연령 사이의 차이에 대해 분석하기 위하 여 연구를 진행하였다. 본 연구의 모집단은 6세 내지 16세에 해당하는 유소년을 대상으로 다단계 유층집락무선 표집법을 사용하여 수도권 소재 초등학교 1곳, 중학교 1곳, 스포츠 관련 사설기관 1곳으로 총 3곳을 선정하여 총 2851명을 표집하였다. 표집 된 자료 중 골연령 11세∼13세 및 역연령 11세∼13세에 해당하지 않거나 기록이 누락되고 측정 태도가 불성실하다고 판단된 1390명을 제외하여 실제 분석에 사용된 자료는 총 1461명이다. 본 연구대상자 중 골연령(BA: Bone Age)이 11세∼13세에 해당하는 유소년의 일반적 특성을 확인할 수 있다. 구체적으로, 골연령이 서로 동일한 유소년이라 할지라도 실제 연령(CA: Chronological Age)은 4살까지 차이날 수 있음을 확인할 수 있다. 예를 들어, 남자 유소년 중에 실제 나이(CA)가 13세로 동일한 유소년 중에서는 골연령(BA)이 11세인 유소년이 72명, 골연령(BA)이 12세인 유소년이 57명, 골연령(BA)이 13세인 유소년이 39명으로 나타나므로 어느 한 쪽에 크게 치우치지 않다는 것을 확인할 수 있다. 이들은 실제 나이가 13세로 서로 같기 때문에 일반적인 체육 교육과정이나 운동 프로그램이 서로 동일하게 짜일 가능성이 높다. 하지만, 유소년의 키(Height) 및 체중(Weight)도 골연령(BA)에 비례하는 경향이 있으므로, 각 유소년마다 실제 생체적인 나이를 나타내는 골연령(BA)을 기초로 운동 프로그램을 추천하는 것이 바람직하다. 도 3은 일 실시예에 따른 골연령과 일반적인 연령에 따른 체력의 차이를 나타낸 표이다. 본 발명의 실시예에 따른 실제 연령과 골연령에 따른 체력의 차이에 대해 분석하기 위해여 연구를 진행하였다. 구체적으로, 모집단의 유소년들의 측정된 13개의 뼈의 러스 점수(Radius. Ulnar. Short bone score; RUS score)를 골격성숙도 환산표에 의해 골연령을 산출하고, 골연령 11세 내지 13세의 유소년을 대상으로 체격과 체 력의 특성을 분석하기 위해 기술통계를 실시하고, 골연령 11세 내지 13세의 체력과 역연령 11세 내지 13세 체력 의 차이를 검증하기 위해 독립 티-테스트(t-test)를 실시하였고 유의수준은 p< 0.05로 분석하고, 골연령 11세 내지 13세를 대상으로 체력 표준지표를 산출하기 위해 비교분석을 실시하였으며, 백분위를 이용하여 등급에 따 라 1등급 5%, 2등급 35%, 3등급 65%, 4등급 95%, 5등급 100%로 구분하여 실시했다. 도 3을 참조하면, 전술한 연구에 따른 결과로서 11세 및 12세의 유소년들의 골연령과 역연령에 따른 체력의 차 이를 확인할 수 있다.구체적으로, 상단의 표를 참고하면, 11세 남자의 경우, 악력은 골연령(20.44±4.1321)이 역연령(16.63±3.919 7)보다 높게 나타났고 통계적으로 유의한 차이(t=10.075)가 나타났다. 플랫테핑은 골연령(6.82±1.2566)이 역연 령(7.14±1.4322)보다 높게 나타났고 통계적으로 유의한 차이(t=-2.585)가 나타났다. 마찬가지로, 제자리 멀리 뛰기, 윗몸 일으키기 및 셔틀런의 경우도 통계적으로 유의한 차이가 나타났다. 11세 여자의 경우도, 악력, 플랫 테핑, 제자리 멀리뛰기, 윗몸 일으키기 및 셔틀런의 경우 골연령이 역연령의 결과보다 높게 나타났고 통계적으 로 유의한 차이가 나타났다. 또한, 하단의 표를 참고하면, 12세의 남자 및 여자의 경우도 마찬가지로 골연령과 역연령에 따른 통계적으로 유 의한 차이가 있음을 확인할 수 있다. 한편, 연령 정보가 반드시 피검사자의 역연령의 값이어야만 하는 것은 아니다. 예를 들어 연령 정보는 피검사자 가 태어난 때를 기산점으로 매해 생일마다 하나씩 더하는 셈법으로 구해진 피검사자의 나이일 수 있다. 유소년의 체력을 평가하는 방법으로는 시간의 흐름에 따라 자연스럽게 증가하는 역연령보다 골격성숙도를 평가 하는 골연령으로 측정하는 것이 바람직할 수 있다. 즉 골연령은 소아나 유소년의 몸 성장 상태를 추정하는데 가 장 정확하고 신뢰되는 수치일 수 있다. 피검사자는 자신의 연령 및 골연령을 통해 가장 적절한 운동 프로그램을 추천받고자 하는 유소년일 수 있다. 다 만, 피검사자가 반드시 유소년으로 한정되는 것은 아니다. 추천 운동 프로그램은 피검사자에게 추천할 운동 프로그램일 수 있다. 운동 프로그램은 운동 종류 정보 및 운동 강도 정보를 포함할 수 있다. 운동 종류 정보는 피검사자에게 추천할 운동의 종류에 관한 정보일 수 있다. 예를 들어, 운동 종류 정보는 '구 기', '육상' 등과 같이 특정 운동 분류에 속하는 모든 운동일 수도 있고, '축구', '오래 달리기' 등과 같이 특 정한 운동일 수도 있다. 운동 강도 정보는 운동을 어느 정도의 시간동안 어느 정도의 강도로 하는지에 관한 정보일 수 있다. 정리하면, 어느 한 운동 프로그램은 어떠한 운동을 어느 정도의 강도로 수행할 지에 대한 하나의 패키지일 수 있다. 따라서 운동 프로그램은 운동 종류 또는 운동 강도에 따라 서로 다른 패키지로서 다양하게 존재할 수 있 다. 다시 도 1을 참조하면, 피검사자 정보 입력부는 피검사자의 생물학적인 골격 연령에 관한 정보인 골연령 정보 및 피검사자의 연령 정보를 입력받을 수 있다. 피검사자 정보 입력부는 사용자가 직접 입력한 골연령 정보를 전달받을 수도 있으나, 사용자가 피검사자의 골연령을 모르는 경우에는 전달받지 못할 수 있다. 이때, 운동 프로그램 관리 시스템은 피검사자의 다른 생체 정보를 통해 자체적으로 피검사자의 골연령 정보를 결정할 수 있다. 골연령 결정부는 피검사자의 관절 위치 정보를 포함하는 X선 촬영 사진 정보 및 피검사자에 대한 초음파 검사 결과 정보 중 적어도 하나를 기초로 피검사자의 골연령 정보를 결정할 수 있다. 골연령 결정부는 골연령 정보를 피검사자 정보 입력부에 전달할 수 있다. 발육발달 단계 결정부는 골연령 정보를 기초로 피검사자의 발육발달 단계를 결정할 수 있다. 운동 프로그램 결정부는 연령 정보 및 발육발달 단계를 기초로 피검사자에게 추천할 운동 프로그램을 결정 할 수 있다. 도 4는 일 실시예에 따른 골연령 및 발육발달 단계를 기준으로 운동 프로그램을 결정하는 방법을 설명하기 위한 표이다. 도 4를 참조하면, 유소년의 발육발달을 골격성숙도를 통해 5단계로 분류하여 유소년기의 발육발달 단계를 구분 할 수 있다. 예를 들어, 발육발달 단계는 골연령을 기준으로 1단계(충실기), 2단계(신장기), 3단계(성장기), 4단계(성숙기), 5단계(감속기)로 구성될 수 있다. 구체적으로, 발육발달 단계 결정부는 골연령이 6세 내지 7세면 해당 유 소년의 발육발달 단계를 1단계, 골연령이 8세 내지 9세면 해당 유소년의 발육발달 단계를 2단계, 골연령이 10세 내지 11세면 해당 유소년의 발육발달 단계를 3단계, 골연령이 12세 내지 13세면 해당 유소년의 발육발달 단계를4단계, 골연령이 14세 내지 15세면 해당 유소년의 발육발달 단계를 5단계로 결정할 수 있다. 각 단계마다 주요 체력 요소는 다를 수 있고, 이러한 체력 요소를 감안하여 각 단계의 유소년에게 가장 적절한 운동 프로그램이 결정될 수 있다. 일 실시예에 따른 운동 프로그램 관리 시스템은 발육발달 5단계와 골격 성숙도를 통해 유소년들을 구분하고, 그에 맞는 운동프로그램을 추천 및 코칭해주는 설계를 진행할 수 있다. 한편, 일 실시예에 따른 발육발달 단계가 반드시 전술한 예시와 같은 나이를 기준으로 5개의 단계로 분류되어야 하는 것은 아니며, 발육발달 단계는 정수가 아닌 소수단위의 골연령을 기준으로 더 세분화단 단계로 분류될 수 도 있다. 각 골연령마다 대응되는 운동 프로그램은 미리 결정될 수 있다. 각 골연령의 유소년에게 추천할 운동 종류 및 운동 강도는 운동 프로그램의 관리자가 임의로 미리 정할 수도 있 으나, 최적의 운동 프로그램을 추천하기 위해서는 인간이 임의로 각 골연령에 맞는 운동 프로그램을 미리 정하 는 것이 바람직하지 않을 수 있다. 다시 도 1을 참조하면, 운동 프로그램 결정부는, 연령 정보 및 발육발달 단계를 기초로 인공지능 모델 을 이용하여 운동 종류 정보 및 운동 강도 정보를 결정할 수 있다. 미리 학습된 인공지능 모델은 메 모리에 저장될 수 있다. 피검사자 정보 입력부는 복수의 학습용 피검사자의 정보를 입력 받을 수 있다. 구체적으로, 피검사자 정보 입력부는 복수의 학습용 피검사자들의 학습용 골연령 정보 및 학습용 연령 정 보를 입력받고, 복수의 학습용 피검사자들이 과거에 추천받은 운동 프로그램의 정보를 입력받을 수 있다. 이때, 복수의 학습용 피검사자의 골연령 정보 및 연령 정보를 입력받는 것은, 사용자 단말에 입력된 학습용 피 검사자 정보를 운동 프로그램 관리 서버에 마련된 피검사자 정보 입력부가 운동 프로그램 관리 서버의 통 신 모듈을 통해 사용자 단말로부터 정보를 전달받는 방식일 수 있다. 이때, 피검사자 정보 입력부는 피검사자가 운동 프로그램 관리 시스템을 통해 추천받은 운동 프로그 램이 아니라, 각각의 피검사자가 인간의 선택 또는 다른 방법에 의해 추천받은 운동 프로그램의 정보를 입력받 을 수 있다. 피검사자 정보 입력부는 운동 프로그램 성과 정보를 입력받을 수 있다. 운동 프로그램 성과 정보는 실제로 추천받은 운동 프로그램을 학습용 피검사자가 수행한 이후의 학습용 피검사 자의 체격 정보 및 체력평가 정보를 포함하는 운동 프로그램 성과정보일 수 있다. 즉, 각각의 학습용 피검사자마다 자신만의 골연령이 있으며, 각각의 학습용 피검사자는 실제로 수행한 운동 프 로그램이 하나씩 대응될 수 있다. 또한, 각각의 학습용 피검사자가 실제로 수행한 운동 프로그램으로 인한 효과 에 관한 정보가 각 학습용 피검사자마다 대응되는 운동 프로그램 성과 정보일 수 있다. 최적의 운동 종류 또는 운동 강도가 미리 정해진 각 골연령에 대한 운동 프로그램들은 기계학습 방식으로 생성 될 수 있다. 기계학습부는 학습용 골연령 정보, 학습용 연령 정보, 운동 프로그램 성과 정보를 입력 변수로 설정하고, 실제로 추천받은 운동 프로그램의 정보를 출력 변수로 설정하여 인공지능 모델을 학습할 수 있다. 이때, 기계학습부는 반복적인 기계 학습(Machine Learning)을 통해 손실 함수가 감소하는 방식 등을 이용하여 인 공지능 모델을 학습할 수 있다. 기계 학습이란 다수의 파라미터로 구성된 모델을 이용하며, 주어진 데이터로 파라미터를 최적화하는 것을 의미 할 수 있다. 기계 학습은 학습 문제의 형태에 따라 지도 학습(supervised learning), 비지도 학습 (unsupervised learning), 강화 학습(reinforcement learning)을 포함할 수 있다. 지도 학습(supervised learning)은 입력과 출력 사이의 매핑을 학습하는 것이며, 입력과 출력 쌍이 데이터로 주어지는 경우에 적용할 수 있다. 비지도 학습(unsupervised learning)은 입력만 있고 출력은 없는 경우에 적용하며, 입력 사이의 규칙 성 등을 찾아낼 수 있다. 다만, 일 실시예에 따른 기계 학습이 반드시 전술한 학습 방식으로 한정되는 것은 아 니다. 기계학습부는 다양한 방식으로 인공지능 모델을 학습할 수 있다. 예를 들어, 기계학습부는 복수 의 학습용 피검사자의 정보에 대해서 각각의 학습용 피검사자가 실제로 수행한 운동 프로그램의 정보로부터 추출되는 특징(feature)을 딥러닝 기반의 학습방법으로 학습할 수 있다. 이때, 특징을 추출하는 방법을 학습하기 위해 여러 단계의 컨볼루션 계층(Convolution layer)을 쌓은 CNN(Convolutional Neural Networks) 구조가 활용될 수 있으나, 기계학습부의 학습방법이 반드시 CNN 구 조를 활용하는 방법으로 한정되는 것은 아니다. 예를 들어, 기계학습부는 컴퓨팅 시스템 컴포넌트(computing system component)간의 최적의 토폴로지 (topology)를 빠르게 예측하는 GNN(Graph Neural Network) 구조를 활용하여 기계학습을 수행할 수도 있으며, 특정 골연령의 피검사자를 타겟으로 최적의 운동 프로그램을 결정하도록 학습할 수 있다면 어떠한 ANN(Artificial Neural Network)를 활용하더라도 문제없다. 이처럼 기계학습부에 의하여 인공지능 모델이 학습되면, 각 골연령에 대응되는 최적의 운동 종류 또 는 운동 강도가 결정되고, 해당 운동 종류 또는 운동 강도의 정보가 포함된 운동 프로그램들이 생성될 수 있다. 운동 프로그램 결정부는 연령 정보와 골연령 정보를 비교해서 피검사자의 골격성숙도를 결정할 수 있다. 구체적으로, 운동 프로그램 결정부는 연령 정보가 골연령 정보 미만이면, 골격성숙도를 조숙 상태로 결정 할 수 있다. 운동 프로그램 결정부는 연령 정보가 골연령 정보와 동일하면, 골격성숙도를 보통 상태로 결 정할 수 있다. 운동 프로그램 결정부는 연령 정보가 골연령 정보를 초과하면, 골격성숙도를 미숙 상태로 결정할 수 있다. 한편, 설령 골연령이 차이가 나더라도 동일한 역연령의 피검사자에게 추천할 운동 프로그램이 너무 이질적인 것 은 바람직하지 않다. 일반적으로 동일한 영연령의 피검사자들끼리 같이 운동하거나 체육활동을 하는 경우가 많 으므로 피검사자에게 추천할 운동 프로그램은 골연령 뿐 아니라 역연령도 고려하여 결정되는 것이 바람직하다. 운동 프로그램 결정부는 연령 정보 및 골격성숙도를 기초로 운동 프로그램을 결정할 수 있다. 예를 들어, 운동 프로그램 결정부는 연령 정보가 동일한 복수의 피검사자에게 서로 동일한 운동 종류가 추 천되도록 운동 프로그램을 결정할 수 있다. 운동 프로그램 결정부는 연령 정보가 동일한 복수의 피검사자 중 골격성숙도가 조숙 상태인 피검사자에 대 해서는 골격성숙도가 보통 상태인 피검사자보다 높은 운동 강도를 추천하도록 운동 프로그램을 결정할 수 있다. 운동 프로그램 결정부는 연령 정보가 동일한 복수의 피검사자 중 골격성숙도가 미숙 상태인 피검사자에 대 해서는 골격성숙도가 보통 상태인 피검사자보다 낮은 운동 강도를 추천하도록 운동 프로그램을 결정할 수 있다. 이상에서 설명된 구성요소들의 성능에 대응하여 적어도 하나의 구성요소가 추가되거나 삭제될 수 있다. 또한, 구성요소들의 상호 위치는 시스템의 성능 또는 구조에 대응하여 변경될 수 있다는 것은 당해 기술 분야에서 통 상의 지식을 가진 자에게 용이하게 이해될 것이다. 도 5는 일 실시예에 따른 유소년 골연령 기반 운동 프로그램 관리 시스템의 제어 방법의 순서도이다. 이는 본 발명의 목적을 달성하기 위한 바람직한 실시예일 뿐이며, 필요에 따라 일부 구성이 추가되거나 삭제될 수 있음 은 물론이다. 도 5를 참조하면, 기계학습 단계에서, 피검사자 정보 입력부는 학습용 피검사자의 정보를 입력받을 수 있 다. 이때, 피검사자 정보 입력부는 학습용 골연령 정보, 학습용 연령 정보, 학습용 피검사자가 실제 로 추천받은 운동 프로그램의 정보 및 운동 프로그램 성과 정보를 입력받을 수 있다. 기계학습부는 학습용 골연령 정보, 학습용 연령 정보, 운동 프로그램 성과 정보를 입력 변수로 설정하고, 실제로 추천받은 운동 프로그램의 정보를 출력 변수로 설정하여 인공지능 모델을 학습할 수 있다. 이후 실제로 피검사자에 대해 운동 프로그램을 추천하는 단계에서, 피검사자 정보 입력부는 피검사자의 골 연령 정보 및 연령 정보를 입력받을 수 있다. 발육발달 단계 결정부는 골연령 정보를 기초로 피검사자의 발육발달 단계를 결정할 수 있다. 운동 프로그램 결정부는 연령 정보와 골연령 정보를 비교해서 피검사자의 골격성숙도를 결정할 수 있다 . 운동 프로그램 결정부는 연령 정보 및 발육발달 단계를 기초로 인공지능 모델을 이용하여 운동 종류 정보 및 운동 강도 정보를 결정할 수 있다.이때, 운동 프로그램 결정부는 피검사자의 연령 정보 및 발육발달 단계를 기초로 인공지능 모델을 이 용하여 운동 종류 정보 및 운동 강도 정보를 결정할 수 있다. 또한, 운동 프로그램 결정부는 인공지능 모 델을 통해 운동 프로그램을 결정할 때, 피검사자의 연령 정보 및 골격성숙도를 반영하여 결정할 수 있다. 피검사자 정보 입력부, 발육발달 단계 결정부, 운동 프로그램 결정부, 골연령 결정부, 기 계학습부는 운동 프로그램 관리 시스템에 포함된 복수개의 프로세서 중 어느 하나의 프로세서를 포함 할 수 있다. 또한, 지금까지 설명된 본 발명의 실시예 및 앞으로 설명할 실시예에 따른 운동 프로그램 관리 시 스템의 제어 방법은 프로세서에 의해 구동될 수 있는 프로그램의 형태로 구현될 수 있다. 여기서 프로그램은, 프로그램 명령, 데이터 파일 및 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 프로그램은 기계어 코드나 고급 언어 코드를 이용하여 설계 및 제작된 것일 수 있다. 프로그램은 상술한 부호 수정을 위한 방법을 구현하기 위하여 특별히 설계된 것일 수도 있고, 컴퓨터 소프트웨어 분야에서 통상의 기술 자에게 기 공지되어 사용 가능한 각종 함수나 정의를 이용하여 구현된 것일 수도 있다. 전술한 정보 표시 방법 을 구현하기 위한 프로그램은 프로세서에 의해 판독 가능한 기록매체에 기록될 수 있다. 이때, 기록매체는 메모 리일 수 있다. 메모리는 전술한 동작 및 후술하는 동작을 수행하는 프로그램을 저장할 수 있으며, 메모리는 저장된 프로그램을 실행시킬 수 있다. 프로세서와 메모리가 복수인 경우에, 이들이 하나의 칩에 집적되는 것도 가 능하고, 물리적으로 분리된 위치에 마련되는 것도 가능하다. 메모리는 데이터를 일시적으로 기억하기 위한 D램(DRAM: Dynamic Random Access Memory) 등의 휘발성 메 모리일 수 있으나 이에 한정되는 것은 아니며, 메모리는 제어 프로그램 및 제어 데이터를 장기간 저장하기 위한 롬(Read Only Memory), 이피롬(Erasable Programmable Read Only Memory: EPROM), 이이피롬 (Electrically Erasable Programmable Read Only Memory: EEPROM) 등의 비휘발성 메모리를 포함할 수도 있다. 프로세서는 각종 논리 회로와 연산 회로를 포함할 수 있으며, 메모리로부터 제공된 프로그램에 따라 데이 터를 처리하고, 처리 결과에 따라 제어 신호를 생성할 수 있다."}
{"patent_id": "10-2022-0044026", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 발명이 속하는 기술분야에서 통상 의 지식을 가진 자는 본 발명의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 발명이 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2022-0044026", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 유소년 골연령 기반 운동 프로그램 관리 시스템의 구성도이다. 도 2는 일 실시예에 따른 연구대상자 중 골연령이 11세, 12세 및 13세인 유소년의 특성을 정리한 표이다. 도 3은 일 실시예에 따른 골연령과 일반적인 연령에 따른 체력의 차이를 나타낸 표이다. 도 4는 일 실시예에 따른 골연령 및 발육발달 단계를 기준으로 운동 프로그램을 결정하는 방법을 설명하기 위한 표이다. 도 5는 일 실시예에 따른 유소년 골연령 기반 운동 프로그램 관리 시스템의 제어 방법의 순서도이다."}
